[
  {
    "id": 38745348,
    "title": "النمس: نموذج متعدد الوسائط لإحالة الكائنات الدقيقة والتأريض",
    "originLink": "https://github.com/apple/ml-ferret",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38745348",
    "commentBody": "",
    "originSummary": [
      "تقدم الورقة نموذج Ferret ، وهو MLLM من طرف إلى طرف يمكنه الرجوع إلى الأشياء الأرضية في الصور بدقة عالية.",
      "يقدم تمثيل المنطقة الهجينة وأخذ العينات المرئية المدركة للمكان كمساهمات رئيسية.",
      "تقدم الورقة أيضا مجموعة بيانات GRIT لضبط التعليمات و Ferret-Bench ، وهو معيار تقييم متعدد الوسائط.",
      "تم إصدار الكود ونقاط التفتيش لطراز Ferret و Ferret-Bench ، ولكن مع قيود الاستخدام لأغراض البحث فقط.",
      "توفر الورقة إرشادات شاملة لتثبيت نموذج Ferret وتدريبه وتقييمه واستخدامه في عرض توضيحي."
    ],
    "commentSummary": [
      "قدمت Apple Ferret ، وهو نموذج لغة كبيرة متعدد الوسائط (LLM) لتعزيز إمكانية الوصول للأفراد ضعاف البصر.",
      "يسلط الكشف الضوء على تقدم Apple في تكنولوجيا الذكاء الاصطناعي وتطويرها المستمر لقدرات الذكاء الاصطناعي في كل من الأجهزة والبرامج.",
      "تدور المناقشات حول قدرة Apple على تجاوز المنافسين في مجال الذكاء الاصطناعي ، والمخاوف المتعلقة بقيود ميزات Siri والإكمال التلقائي ، والمناقشات حول نهج Apple تجاه التقنيات الجديدة.",
      "يستكشف المستخدمون أيضا استراتيجيات التسويق الخاصة بشركة Apple ، وفرص العمل المحتملة ، والأوراق البحثية ، وأداء المساعدين الافتراضيين.",
      "يعبر البعض عن استيائهم من منتجات Apple الحالية وشكوكهم تجاه إصداراتها المستقبلية."
    ],
    "points": 557,
    "commentCount": 273,
    "retryCount": 0,
    "time": 1703348389
  },
  {
    "id": 38745673,
    "title": "ميتا متهمة بالرقابة العالمية المؤيدة للفلسطينيين، بحسب تقرير",
    "originLink": "https://www.theguardian.com/technology/2023/dec/21/meta-facebook-instagram-pro-palestine-censorship-human-rights-watch-report",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38745673",
    "commentBody": "",
    "originSummary": [
      "يزعم تقرير صادر عن هيومن رايتس ووتش أن ميتا (فيسبوك سابقا) قد انخرطت في رقابة \"منهجية وعالمية\" على المحتوى المؤيد للفلسطينيين خلال الحرب بين إسرائيل وغزة.",
      "ويحدد التقرير ستة أنماط من الرقابة، بما في ذلك إزالة المحتوى وتعليق الحسابات.",
      "تنفي ميتا هذه المزاعم، مدعية أنها ترتكب أخطاء ولكنها لا تقمع عمدا أصواتا محددة.",
      "هذه هي المرة الثانية هذا الشهر التي تتهم فيها ميتا بإسكات المحتوى المؤيد للفلسطينيين.",
      "حكم مجلس الإشراف على ميتا مؤخرا بأن إزالة مقطعي فيديو يتعلقان بالنزاع كان خطأ.",
      "أبلغ المستخدمون عن تحيز تكنولوجي لصالح المحتوى المؤيد لإسرائيل وإلحاق الضرر بالمنشورات المؤيدة للفلسطينيين على منصات ميتا."
    ],
    "commentSummary": [
      "ميتا (فيسبوك سابقا) متهمة بفرض رقابة على المحتوى المؤيد للفلسطينيين، مما يثير مخاوف بشأن التحيز في الإشراف على المحتوى.",
      "تتضمن المناقشة موضوعات مثل مدى وصول المحتوى ورؤيته ، والتأثير الخوارزمي ، والمناقشات حول عبارة \"من النهر إلى البحر\".",
      "هناك آراء متنوعة حول الصراع الإسرائيلي الفلسطيني، والرقابة على المحتوى، ودور منصات التواصل الاجتماعي. كما يتعمق الحوار في السياق التاريخي، ومعاملة اليهود في الدول العربية، وأهمية التعايش والاعتراف بالحقائق التاريخية."
    ],
    "points": 498,
    "commentCount": 463,
    "retryCount": 0,
    "time": 1703350620
  },
  {
    "id": 38745668,
    "title": "فك تشفير عيد الميلاد العبقري (1988) - تشفير بديل يضغط النص في كود C المبهم",
    "originLink": "https://udel.edu/~mm/xmas/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38745668",
    "commentBody": "",
    "originSummary": [
      "يناقش الملخص xmas.c ، وهو رمز C الذي فاز في مسابقة C Code الدولية المبهمة.",
      "تم تحليل الكود في نوفمبر 2008 ، وتم فك تشفير وظائفه.",
      "يستخدم xmas.c ضغط النص وتشفير الاستبدال والعودية.",
      "يقدر المؤلف إبداع الكود ويتمنى للقراء عيد ميلاد سعيد."
    ],
    "commentSummary": [
      "يستكشف المقال رمز قراصنة تحت عنوان عيد الميلاد يسمى \"Xmas.c\" من عام 1988 وأوجه التشابه مع رمز \"xii.tex\".",
      "يشارك المستخدمون تجاربهم في تشغيل الكود على الأنظمة الحديثة ولكنهم يواجهون أخطاء بسبب التغييرات في لغة البرمجة C.",
      "يؤدي نقل الوظيفة الرئيسية إلى حل خطأ الكود ، مما يسلط الضوء على أهمية فهم تغييرات لغة C."
    ],
    "points": 492,
    "commentCount": 80,
    "retryCount": 0,
    "time": 1703350606
  },
  {
    "id": 38748370,
    "title": "فن الإلكترونيات (2015): دليل شامل من قبل هورويتز وهيل لعشاق الحلبات والمهنيين",
    "originLink": "https://artofelectronics.net/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38748370",
    "commentBody": "",
    "originSummary": [
      "\"فن الإلكترونيات\" من تأليف هورويتز وهيل هو كتاب شامل يحظى باحترام كبير ويغطي القطع الأثرية في الدوائر.",
      "وقد تلقى مراجعات إيجابية من المتخصصين في هذا المجال وهو متاح للشراء عبر الإنترنت.",
      "يجب أن يكون المشترون حذرين من النسخ المزيفة ويجب عليهم فقط شراء إصدار الكتاب الإلكتروني المصرح به على Kindle."
    ],
    "commentSummary": [
      "\"فن الإلكترونيات\" هو كتاب يحظى بتقدير كبير في تصميم الدوائر وكان له تأثير كبير على العديد من القراء ، وأشاد بفصوله حول أجهزة الكمبيوتر الصغيرة وتقنيات البناء.",
      "يشتهر المؤلف ، هورويتز ، بإلقاء المحادثات وحل مشاكل الإلكترونيات بكفاءة.",
      "يتضمن النقاش حول الكتاب آراء حول أفضل إصدار ، والإصدارات المزيفة ، والكتب البديلة ، فضلا عن ضرورة شراء الإصدار الأخير.",
      "يوصي المؤلف بمواد أحدث للتصميم التناظري والرقمي ، لكن الموارد القديمة لا تزال كافية للتعرف على تصميم الدوائر ومشاريع الإلكترونيات المنفصلة.",
      "يعتبر الكتاب مرجعا رائعا مع بعض الأخطاء وفرصة لأخذ دورة مرتبطة به في ملحق هارفارد.",
      "هناك نقاش حول موقع ويب يسمى \"الدوائر السيئة\" والرغبة في الحصول على مزيد من التفاصيل حول سبب اعتبار بعض الدوائر سيئة.",
      "يتم تقييم الكتاب للتطوير الشخصي من قبل بعض المعلقين ، الذين يشاركون أيضا تجاربهم الشخصية مع الإلكترونيات والتوصيات للعثور على مكونات ومعدات رخيصة."
    ],
    "points": 299,
    "commentCount": 69,
    "retryCount": 0,
    "time": 1703366639
  },
  {
    "id": 38743719,
    "title": "سونو الذكاء الاصطناعي: كسر الحواجز في إنشاء الموسيقى",
    "originLink": "https://www.suno.ai/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38743719",
    "commentBody": "",
    "originSummary": [
      "Sound About Suno هو فريق من الموسيقيين وخبراء الذكاء الاصطناعي في كامبريدج ، ماساتشوستس ، يهدف إلى سد الفجوة بين الناس والموسيقى.",
      "إنهم يسعون جاهدين من أجل مستقبل حيث يمكن لأي شخص إنشاء موسيقى استثنائية باستخدام خيالهم فقط ، مما يلغي الحاجة إلى الآلات الموسيقية.",
      "تعزز الشركة ثقافة الموسيقى والتجريب الصوتي وتشجع الأفراد من خلفيات متنوعة على الانضمام إليهم."
    ],
    "commentSummary": [
      "ينقسم المستخدمون في آرائهم حول قدرة منصة Suno الذكاء الاصطناعي على توليد الموسيقى ، حيث أشاد البعض بقدراتها والبعض الآخر يسلط الضوء على قيودها.",
      "تركز المناقشة أيضا على العلاقة العاطفية والتحكم في الموسيقى التي يتم إنشاؤها الذكاء الاصطناعي ، ومناقشة ما إذا كان يمكن أن تتطابق مع العنصر البشري.",
      "تتم مناقشة فوائد وقيود الذكاء الاصطناعي في المجالات الإبداعية ، والمقارنات مع الذكاء الاصطناعي الصديقات والمعالجين ، والحاجة إلى عنصر بشري في الموسيقى. يشارك المستخدمون تجاربهم واقتراحاتهم ومخاوفهم بشأن حقوق النشر وتأثيرها على صناعة الموسيقى."
    ],
    "points": 290,
    "commentCount": 124,
    "retryCount": 0,
    "time": 1703334254
  },
  {
    "id": 38749155,
    "title": "حاكم نيويورك يوقع مشروع قانون الشفافية LLC ، ويسمح بالوصول المحدود إلى قاعدة البيانات ، ويستخدم حق النقض ضد الحظر غير التنافسي ومتطلبات سلة إعادة التدوير",
    "originLink": "https://gothamist.com/news/ny-gov-hochul-vetoes-ban-on-noncompete-clauses-waters-down-llc-transparency-bill",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38749155",
    "commentBody": "",
    "originSummary": [
      "وقعت حاكمة نيويورك كاثي هوتشول مشروع قانون يتطلب من الشركات ذات المسؤولية المحدودة (LLCs) الكشف عن \"أصحابها المستفيدين\".",
      "ومع ذلك، فقد منعت وصول الجمهور إلى قاعدة البيانات التي تحتوي على هذه المعلومات، مما أثار مخاوف بشأن الشفافية.",
      "كما استخدم هوتشول حق النقض ضد مشروع قانون يهدف إلى حظر الاتفاقيات غير التنافسية وآخر كان سيتطلب من مدينة نيويورك تركيب صناديق إعادة التدوير في مناطق معينة.",
      "على الجانب الإيجابي ، وافقت على مشروع قانون من شأنه نقل العديد من الانتخابات على مستوى المقاطعات والمدن إلى السنوات الزوجية.",
      "يجادل النقاد بأن هذه التغييرات يمكن أن تفيد الديمقراطيين ويكون لها تأثير سلبي على المجتمعات المحلية.",
      "ولا تزال خمسة تشريعات تنتظر الموافقة عليها أو رفضها بحلول نهاية العام، مما يضيف إلى التغييرات الجارية في المشهد القانوني في نيويورك."
    ],
    "commentSummary": [
      "تغطي التعليقات مجموعة متنوعة من الموضوعات بما في ذلك الاتفاقيات غير التنافسية ، والشفافية في الكيانات التجارية ، والمشهد السياسي في نيويورك ، وأنظمة التصويت ، والمواقف السياسية في الحكومة.",
      "هناك مناقشات حول فعالية الاتفاقيات غير التنافسية ومخاوف بشأن تأثير الشركات الكبرى على السياسة.",
      "وتركز المناقشات أيضا على الإصلاح الانتخابي، والتحديات التي تواجهها الأطراف الثالثة في الولايات المتحدة، والسياق التاريخي، والحقوق الدستورية، وعيوب نظام الحزبين."
    ],
    "points": 287,
    "commentCount": 184,
    "retryCount": 0,
    "time": 1703372371
  },
  {
    "id": 38749434,
    "title": "StreamDiffusion: إنشاء الصور في الوقت الفعلي مع أداء محسن",
    "originLink": "https://github.com/cumulo-autumn/StreamDiffusion",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38749434",
    "commentBody": "",
    "originSummary": [
      "StreamDiffusion هو خط أنابيب نشر يتيح إنشاء صور تفاعلية في الوقت الفعلي.",
      "إنه يعزز الأداء من خلال التخزين المؤقت المحسن ، وتقنيات التصفية المتقدمة ، وعمليات الدفعات الفعالة ، وآلية التوجيه الخالية من المصنف.",
      "يمكن دمج خط الأنابيب مع PyTorch ويدعم إنشاء كل من تحويل النص إلى صورة وصورة إلى صورة ، مع ميزات اختيارية مثل تصفية التشابه العشوائي وتقريب التعقيد الحسابي."
    ],
    "commentSummary": [
      "يغطي الملخص مجموعة واسعة من الموضوعات في مجتمع الذكاء الاصطناعي والتعلم الآلي ، بما في ذلك التطورات ، وإمكانية استبدال الوظائف ، وتحسين النموذج ، واستخدام وحدة معالجة الرسومات ، ومقارنات النماذج ، ومتطلبات النظام البيئي ، وخطط Apple المستقبلية ل NPU ووحدة معالجة الرسومات ذات الذاكرة الموحدة ، والتحديات في هذا المجال.",
      "كما يناقش دور المؤتمرات في نشر البحوث وعدم مواءمة الحوافز للباحثين.",
      "يتم تضمين ذكر MidJourney كمكتبة دفق انتشار مستقر في وقت التشغيل المحلي."
    ],
    "points": 272,
    "commentCount": 48,
    "retryCount": 0,
    "time": 1703374974
  },
  {
    "id": 38750411,
    "title": "هل يمكن ل Microsoft Flight Simulator تعزيز مهارات الطيران والمعرفة؟",
    "originLink": "https://aviation.stackexchange.com/questions/738/can-microsoft-flight-simulator-help-me-learn-to-fly-or-make-me-a-better-pilot",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38750411",
    "commentBody": "",
    "originSummary": [
      "تعد محاكيات الطيران مثل Microsoft Flight Simulator و Xplane 10 مفيدة لممارسة الإجراءات والعمليات في بيئة خاضعة للرقابة.",
      "ومع ذلك ، لا يمكنهم تكرار تجربة الطيران الحقيقية بشكل كامل أو تعليم مهارات معينة مطلوبة للتجريب.",
      "من المهم طلب التوجيه من مدرب طيران لاستكمال تدريب المحاكاة واكتساب فهم كامل للطيران."
    ],
    "commentSummary": [
      "تعد أجهزة محاكاة الطيران موضوعا للنقاش عندما يتعلق الأمر بتدريب الطيارين ، حيث يجادل البعض بفوائدها في تعلم وممارسة جوانب محددة من الطيران ، خاصة بالنسبة لقواعد طيران الأجهزة (IFR).",
      "ومع ذلك ، قد لا تكون أجهزة المحاكاة فعالة في تدريب قواعد الطيران المرئية (VFR) ويمكن أن تؤدي إلى تطوير عادات سيئة.",
      "كما تتم مناقشة قيود وتكاليف أجهزة المحاكاة ، مما يسلط الضوء على أهمية الخبرة في العالم الحقيقي وساعات الطيران العملية في تطوير مهارات القيادة. يمكن أن تكون أجهزة المحاكاة مكملا مفيدا للتدريب ، ولكن لا ينبغي أن تكون التركيز الوحيد."
    ],
    "points": 232,
    "commentCount": 130,
    "retryCount": 0,
    "time": 1703383693
  },
  {
    "id": 38746187,
    "title": "في عام 2023 ، ارتفعت الخرائط العضوية إلى مليون مستخدم ، مدافعة عن الخصوصية والمصدر المفتوح",
    "originLink": "https://organicmaps.app/news/2023-12-23/in-2023-organic-maps-got-its-first-million-users/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38746187",
    "commentBody": "",
    "originSummary": [
      "وصلت الخرائط العضوية ، وهي بديل لخرائط Google و Apple ، إلى مليون مستخدم في عام 2023.",
      "تمت إضافة ميزات جديدة ، بما في ذلك استيراد GPX وأداة المسطرة ونمط الخريطة الخارجية والاتجاهات الصوتية للخلفية و Android Auto.",
      "حصل التطبيق على تقييمات إيجابية وحصل على مساهمات كبيرة من مجتمع المصادر المفتوحة. تخطط الشركة لمواصلة تحسين جودة الخريطة ، وزيادة مشاركة المستخدم مع OpenStreetMap ، وتوفير بديل يركز على الخصوصية."
    ],
    "commentSummary": [
      "وصل تطبيق Organic Maps ، وهو تطبيق ملاحة ، إلى مليون مستخدم ولكنه يفتقر إلى مزامنة الإشارات المرجعية ، وهي ميزة مهمة للعديد من المستخدمين.",
      "يدرس المطورون متطلبات المستخدم وجودة الكود وتركيز المشروع والتكلفة عند اتخاذ قرار بشأن تنفيذ مزامنة الإشارات المرجعية.",
      "تم تقديم اقتراحات لاستخدام منصات الجهات الخارجية أو التصدير اليدوي والمزامنة للإشارات المرجعية.",
      "تغطي المناقشة أيضا موضوعات مثل النسخ الاحتياطي للبيانات والخصوصية والمنصات المفتوحة.",
      "تم ذكر OpenStreetMap (OSM) مع قيوده ، وتم الإشادة بالتطبيق سهل الاستخدام StreetComplete لإضافة التفاصيل.",
      "يؤكد المستخدمون على الحاجة إلى المزيد من المساهمين وقاعدة بيانات OpenPOI العالمية.",
      "تتلقى الخرائط العضوية الثناء على المشي لمسافات طويلة ، لكن بعض المستخدمين يذكرون القيود وعدم الدقة في بيانات نقاط الاهتمام (POI).",
      "يناقش الموضوع تطبيقات التنقل المختلفة والميزات وسهولة الاستخدام.",
      "يوصي المستخدمون بالخرائط العضوية و OSM وخرائط Apple للتنقل.",
      "تقوم الخرائط العضوية بتنزيل الخرائط مباشرة من OSM ، لكن التغييرات المحتملة في التنسيق تثير المخاوف.",
      "تم الإشادة بالخرائط العضوية لكونها مفتوحة المصدر."
    ],
    "points": 222,
    "commentCount": 82,
    "retryCount": 0,
    "time": 1703353366
  },
  {
    "id": 38749170,
    "title": "خجل التاج: استكشاف أسباب وآثار وأهمية هذه الظاهرة المثيرة للاهتمام",
    "originLink": "https://en.wikipedia.org/wiki/Crown_shyness",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38749170",
    "commentBody": "",
    "originSummary": [
      "خجل التاج هو ظاهرة لا تلمس فيها مظلات الأشجار بعضها البعض ، ويتم استكشاف ذلك في المقالة.",
      "تتم مناقشة أسباب وآثار خجل التاج ، بما في ذلك التآكل الميكانيكي وتأثير الأشجار المجاورة.",
      "كما تم ذكر دور المستقبلات الضوئية في الكشف عن النباتات المجاورة ، فضلا عن الآثار البيئية وأهمية دراسة بيئة المظلة والحفاظ عليها."
    ],
    "commentSummary": [
      "خجل التاج هو ظاهرة لا تلمس فيها تيجان الأشجار المجاورة بعضها البعض.",
      "تشير التطورات الأخيرة إلى وجود علاقة إيجابية بين خجل التاج ونحافة الشجرة وشكل الورقة.",
      "قد يكون خجل التاج استراتيجية لإدارة الموارد والتكيف مع الضغوط البيئية ، ولكن من الصعب تحديد انتشاره وعالميته بين أنواع الأشجار."
    ],
    "points": 200,
    "commentCount": 34,
    "retryCount": 0,
    "time": 1703372457
  },
  {
    "id": 38744588,
    "title": "دعت طرق بايزي إلى التحليل الإحصائي في التجارب السريرية",
    "originLink": "https://statmodeling.stat.columbia.edu/2023/12/23/bayesians-moving-from-defense-to-offense-i-really-think-its-kind-of-irresponsible-now-not-to-use-the-information-from-all-those-thousands-of-medical-trials-that-came-before-is-that-very/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38744588",
    "commentBody": "",
    "originSummary": [
      "تشير دراسة حديثة إلى أن العديد من التجارب السريرية لديها قوة إحصائية أقل مما تم الإبلاغ عنه ، مما يؤدي إلى المبالغة في تقدير آثار العلاج وفشل النسخ المتماثل المحتمل.",
      "يقترح المؤلفون إعادة تفسير قيمة P باستخدام مجموعة مرجعية من الدراسات لتوفير مزيد من التبصر ومنع التفسيرات الساذجة.",
      "كما قارنوا أداء مقدر الانكماش بالمقدر غير المتحيز ، ووجدوا أن مقدر الانكماش يعمل بشكل أفضل.",
      "يدعو المؤلفون إلى استخدام أساليب بايزي ودمج المعلومات السابقة في التحليل الإحصائي لتحسين دقة النتائج."
    ],
    "commentSummary": [
      "تستكشف المناقشة جوانب مختلفة من إحصائيات بايزي والمتكررة ، بما في ذلك تقديرات النقاط ، ومقدمات بايزي ، وفترات الثقة في التأثير العشوائي ، والتعلم الآلي ، والقيم p ، والمصطلحات ، والمقارنة بين النهجين.",
      "كما يتعمق في تأثير التحيزات والجدل وتعقيد الدماغ وأزمة النسخ المتماثل ودور أساليب بايزي في اختبار A / B.",
      "يؤكد النقاش على أهمية اتخاذ القرارات المستنيرة في التحليل الإحصائي ويسلط الضوء على نقاط القوة والقيود لكل من نهج بايزي والمتكرر."
    ],
    "points": 192,
    "commentCount": 90,
    "retryCount": 0,
    "time": 1703342915
  },
  {
    "id": 38744168,
    "title": "فهم هيكل ومحتويات وحدة WASM",
    "originLink": "https://danielmangum.com/posts/every-byte-wasm-module/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38744168",
    "commentBody": "",
    "originSummary": [
      "تقدم المقالة نظرة عامة شاملة على بنية ومحتويات وحدة WebAssembly (WASM).",
      "يناقش عملية فهم وفك تشفير الأقسام المختلفة داخل الوحدة ، مثل قسم النوع وقسم الوظائف وقسم الذاكرة والقسم العام وقسم الصادرات وقسم التعليمات البرمجية والأقسام المخصصة.",
      "تؤكد المقالة على استخدام أدوات مثل Clang و Zig و xxd و wasm2wat لتجميع محتويات وحدة WASM والتحقق منها وعرضها."
    ],
    "commentSummary": [
      "تستكشف المقالة بنية البايت لوحدات WebAssembly وتوصي بكتاب للتعرف على رموز البايت ومترجمي لغات البرمجة.",
      "يناقش المستخدمون تجاربهم مع محللي البناء ل WebAssembly ويناقشون خيارات التصميم.",
      "وتشمل المناقشة مخططات الترميز، ومدى ملاءمتها لأغراض محددة، وتأثيرها على الأداء والكفاءة."
    ],
    "points": 173,
    "commentCount": 33,
    "retryCount": 0,
    "time": 1703338908
  },
  {
    "id": 38748433,
    "title": "كيف تقوم B-tree بتحسين استعلامات قاعدة البيانات",
    "originLink": "https://blog.allegro.tech/2023/11/how-does-btree-make-your-queries-fast.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38748433",
    "commentBody": "",
    "originSummary": [
      "B-tree هي بنية بيانات شائعة الاستخدام في قواعد البيانات للبحث الفعال عن كميات كبيرة من البيانات.",
      "على الرغم من اختراعها منذ أكثر من 40 عاما ، لا تزال شجرة B مستخدمة على نطاق واسع اليوم في قواعد البيانات الحديثة.",
      "تعمل البنية على تحسين الوصول المتسلسل وهي ذاتية التوازن ، مما يجعلها متينة وفعالة للتعامل مع معظم استعلامات قاعدة البيانات."
    ],
    "commentSummary": [
      "تستخدم أشجار B بشكل شائع كفهارس في قواعد البيانات لتحسين أداء الاستعلام.",
      "تعتمد كفاءة B-trees على أنماط الوصول إلى البيانات والاستعلامات المحددة التي يتم تنفيذها.",
      "يمكن لهياكل البيانات الأخرى مثل BRIN وقواعد البيانات التي تم فرزها في الذاكرة أيضا تحسين أنماط الوصول.",
      "تتم مناقشة مشكلات الأداء المتعلقة بأشجار B وتفضيل الوصول المتسلسل على محركات أقراص الحالة الصلبة.",
      "يتم النظر في أشجار LSM والمصفوفات وتحسين الأجهزة لتحسين الأداء.",
      "يتم استخدام مخططي الاستعلام والتمثيلات المتخصصة للفهارس في قواعد البيانات التجارية العليا.",
      "يتم استخدام الفهارس المؤقتة وجداول التجزئة والصور النقطية للمعالجة في الذاكرة.",
      "وتناقش مسألة أثر فهرسة أعمدة الاتحاد على الكفاءة والأداء.",
      "تتضمن اقتراحات فهرسة UUID الفعالة استخدام UUIDs المتسلسلة أو مخططات الفرز.",
      "يعد اختيار المفاتيح جيدا أمرا مهما للحصول على أداء جيد وقابلية للتوسع."
    ],
    "points": 172,
    "commentCount": 39,
    "retryCount": 0,
    "time": 1703367181
  },
  {
    "id": 38745070,
    "title": "قضاعة: ذاكرة تخزين مؤقت سريعة وفعالة في الذاكرة مع خوارزمية S3-FIFO",
    "originLink": "https://github.com/maypok86/otter",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38745070",
    "commentBody": "",
    "originSummary": [
      "Otter هي مكتبة ذاكرة تخزين مؤقت عالية الأداء في الذاكرة ل Golang تهدف إلى توفير ذاكرة تخزين مؤقت سريعة وخالية من التنافس مع نسبة إصابة عالية.",
      "يستخدم العديد من الخوارزميات والميزات ، بما في ذلك التكوين التلقائي ، وانتهاء صلاحية TTL ، والإخلاء على أساس التكلفة ، وخوارزمية S3-FIFO.",
      "يقدم Otter واجهة برمجة تطبيقات بسيطة ، ويدعم الأدوية الجنيسة ، ويوفر أمثلة للتثبيت والاستخدام. تم قياسه مقابل مكتبات ذاكرة التخزين المؤقت الأخرى ، مما يدل على الأداء الجيد ونسب الضرب. يتم تشجيع المساهمات ، ويتم ترخيص المشروع بموجب Apache 2.0."
    ],
    "commentSummary": [
      "تستكشف المناقشة التخزين المؤقت بلغة برمجة Go ، مع التركيز على الأداء والنتائج المعيارية ونسب النتائج لمكتبات التخزين المؤقت.",
      "تتم أيضا مناقشة خوارزمية S3-FIFO وتأثير جمع القمامة واستخدام الحزمة \"غير الآمنة\" فيما يتعلق بأنظمة التخزين المؤقت في Go.",
      "يشارك المستخدمون آرائهم حول كفاءة وموثوقية أساليب التخزين المؤقت المختلفة ، مما يوفر روابط للموارد ذات الصلة."
    ],
    "points": 163,
    "commentCount": 53,
    "retryCount": 0,
    "time": 1703346561
  }
]
