[
  {
    "id": 41527143,
    "title": "Заметки о новых моделях цепочки рассуждений o1 от OpenAI",
    "originLink": "https://simonwillison.net/2024/Sep/12/openai-o1/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41527143",
    "commentBody": "",
    "originSummary": [
      "OpenAI выпустила две новые модели, o1-preview и o1-mini, под кодовым названием «клубника», которые предлагают улучшенные возможности рассуждения через шаблон цепочки мыслей.",
      "Эти модели предназначены для учетных записей пятого уровня (более $1,000 на API-кредиты) и вводят «токены рассуждений», которые оплачиваются, но не видны в ответе API, что вызывает некоторое недовольство из-за отсутствия прозрачности.",
      "Новые модели могут лучше справляться со сложными запросами и имеют увеличенные лимиты на количество выходных токенов, что расширяет спектр задач, которые могут решать большие языковые модели (LLM)."
    ],
    "commentSummary": [
      "Новые модели цепочки рассуждений o1 от OpenAI все еще создают галлюцинации, такие как несуществующие библиотеки и функции, и часто предоставляют неверные факты.",
      "Пользователи отмечают, что, хотя способности к рассуждению улучшились, модели по-прежнему не могут проверять фактическую точность своих выводов, что требует дополнительной проверки со стороны пользователя.",
      "Некоторые пользователи сравнивают модели с наивными, но умными стажерами, предполагая, что они могут быть полезны при правильном руководстве, хотя им не хватает способности задавать уточняющие вопросы или признавать неопределенность, что влияет на их надежность."
    ],
    "points": 593,
    "commentCount": 520,
    "retryCount": 0,
    "time": 1726188481
  },
  {
    "id": 41525778,
    "title": "Детективы данных, которые обнаружили неправомерные действия в исследовании, оправданы по обвинению в клевете",
    "originLink": "https://arstechnica.com/science/2024/09/court-clears-researchers-of-defamation-for-identifying-manipulated-data/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41525778",
    "commentBody": "",
    "originSummary": [
      "Суд оправдал исследователей Data Colada от обвинений в клевете за выявление манипулированных данных в расследовании Гарвардской школы бизнеса.",
      "Гарвард все равно будет судиться по поводу своего обращения с делом, несмотря на подтверждение неправомерных действий профессора Франчески Джино, которая находится в административном отпуске и может лишиться должности.",
      "Суд постановил, что выводы, подкрепленные доказательствами, не являются клеветой, полностью оправдав команду Data Colada благодаря их осторожному, основанному на доказательствах подходу."
    ],
    "commentSummary": [
      "«Детективы данных, обвиненные в клевете за выявление научных нарушений, были оправданы, дело было прекращено до начала расследования.»",
      "Суд постановил, что выводы, подкрепленные доказательствами, о сфабрикованных данных не являются клеветой, поддерживая научную целостность.",
      "Ответчики собрали более 300 тысяч долларов на GoFundMe для своей юридической защиты, подчеркивая высокие затраты и эмоциональные издержки исков о клевете в США."
    ],
    "points": 519,
    "commentCount": 99,
    "retryCount": 0,
    "time": 1726176497
  },
  {
    "id": 41528075,
    "title": "Рабочие Boeing голосуют за забастовку",
    "originLink": "https://www.washingtonpost.com/business/2024/09/13/boeing-union-contract-strike/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41528075",
    "commentBody": "",
    "originSummary": [
      "Десятки тысяч рабочих Boeing проголосовали подавляющим большинством за забастовку после отклонения предложения по контракту, при этом 96% поддержки было получено от Международной ассоциации машинистов и работников аэрокосмической отрасли округа 751.",
      "Забастовка, начавшаяся у заводов Boeing в штате Вашингтон, может стоить компании примерно $1 миллиард в неделю и нарушить её восстановление после финансовых и безопасностных проблем.",
      "Несмотря на предложенное повышение заработной платы на 25% в течение четырех лет и улучшенные льготы, соглашение не удовлетворило другие требования профсоюза; Boeing готов вернуться к переговорам, а администрация Байдена следит за ситуацией."
    ],
    "commentSummary": [
      "Работники Boeing проголосовали за забастовку, 96% из них отклонили предложенную сделку, которая включала значительное повышение заработной платы.",
      "Союз машинистов требует повышения заработной платы, улучшения условий труда и чтобы Boeing «перестала нарушать закон».",
      "Забастовка подчеркивает более широкое недовольство руководством Boeing, которое критикуют за приоритет прибыли над качеством инженерных решений и безопасностью, что способствовало таким проблемам, как крушения 737 Max."
    ],
    "points": 468,
    "commentCount": 429,
    "retryCount": 0,
    "time": 1726202517
  },
  {
    "id": 41526288,
    "title": "FDA разрешает первое безрецептурное программное обеспечение для слуховых аппаратов",
    "originLink": "https://www.fda.gov/news-events/press-announcements/fda-authorizes-first-over-counter-hearing-aid-software",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41526288",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "FDA одобрило первое программное обеспечение для слуховых аппаратов, доступное без рецепта, что позволяет использовать AirPods в качестве слуховых аппаратов, потенциально снижая стигму и увеличивая доступность.",
      "Ожидается, что это одобрение снизит затраты и побудит больше людей заняться лечением потери слуха, хотя сохраняются опасения по поводу срока службы батареи и социального восприятия.",
      "Пользователи сообщили о положительном опыте использования функций доступности слуховых аппаратов и AirPods, что является значительным шагом к тому, чтобы сделать слуховые аппараты более доступными и признанными."
    ],
    "points": 343,
    "commentCount": 191,
    "retryCount": 0,
    "time": 1726179871
  },
  {
    "id": 41528266,
    "title": "Весь персонал издателя игр Annapurna Interactive, как сообщается, подал в отставку",
    "originLink": "https://www.theverge.com/games/2024/9/12/24243317/annapurna-interactive-staff-reportedly-resigns",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41528266",
    "commentBody": "",
    "originSummary": [
      "Весь персонал Annapurna Interactive, включая бывшего президента Натана Гэри, подал в отставку после неудачной попытки выделить компанию в независимую структуру.",
      "Существующие игры и проекты Annapurna Interactive останутся под управлением компании, при этом Гектор Санчес недавно был назначен президентом интерактивных и новых медиа.",
      "Annapurna планирует интегрировать свои игровые операции с подразделениями кино, телевидения и театра, продолжая выпускать игры, такие как Lorelei and the Laser Eyes и Open Roads, а также предстоящие проекты, такие как Blade Runner 2033: Labyrinth."
    ],
    "commentSummary": [
      "Весь персонал Annapurna Interactive, издателя игр, подал в отставку из-за неудачных переговоров с их материнской компанией, Annapurna Pictures, по поводу финансовой интеграции.",
      "Сотрудники и руководители предпочли отделиться, чтобы сохранить контроль над своим творческим направлением, особенно после успеха таких игр, как «Outer Wilds» и «Stray».",
      "Эта массовая отставка подчеркивает напряжение между творческой независимостью и финансовым давлением в игровой индустрии."
    ],
    "points": 332,
    "commentCount": 163,
    "retryCount": 0,
    "time": 1726205668
  },
  {
    "id": 41527564,
    "title": "Вашему стартапу нужна сложная облачная инфраструктура?",
    "originLink": "https://www.hadijaveed.me/2024/09/08/does-your-startup-really-need-complex-cloud-infrastructure/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41527564",
    "commentBody": "",
    "originSummary": [
      "Питер Левелс выступает за более простую инфраструктуру, используя одиночные серверы вместо сложных облачных настроек, чтобы сосредоточиться на соответствии продукта рынку, как обсуждалось в подкасте Лекса Фридмана.",
      "Два примера из практики подчеркивают недостатки чрезмерно сложных настроек: один с избыточным количеством функций Lambda и другой с ненужными микросервисами, оба отвлекающие от разработки функционала.",
      "Современные серверы и инструменты, такие как Docker Compose, могут предоставить мощные, управляемые и бюджетные решения, позволяя небольшим командам сосредоточиться на создании отличных продуктов, а не на управлении сложной инфраструктурой."
    ],
    "commentSummary": [
      "Стартапы часто используют сложную облачную инфраструктуру, такую как Kubernetes, для масштабируемости, но это может привести к низкому качеству и высоким затратам из-за незрелых решений команды.",
      "Некоторые опытные профессионалы утверждают, что более простые и воспроизводимые настройки с использованием таких инструментов, как Puppet и системы с долгосрочной поддержкой (LTS), могут быть более эффективными и экономичными.",
      "Дебаты подчеркивают компромиссы между современными облачно-нативными подходами и традиционными, детерминированными методами управления инфраструктурой."
    ],
    "points": 239,
    "commentCount": 305,
    "retryCount": 0,
    "time": 1726194591
  },
  {
    "id": 41530783,
    "title": "Портирование SBCL на Nintendo Switch",
    "originLink": "https://reader.tymoon.eu/article/437",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41530783",
    "commentBody": "",
    "originSummary": [
      "Чарльз Чжан и Шинмера работали два года над переносом игрового движка Trial на Nintendo Switch, сосредоточив внимание на адаптации среды выполнения Common Lisp.",
      "Несмотря на успешную компиляцию и выполнение кода на Lisp на Switch, нерешенные проблемы включают сборку мусора и вывод звука, при этом проект обошелся примерно в $17,000.",
      "Чип ARM64 Cortex-A57 и поддержка OpenGL на Switch сделали портирование возможным, но остаются проблемы, такие как взаимодействие с проприетарной ОС Switch и оптимизация компиляции CLOS."
    ],
    "commentSummary": [
      "SBCL (Steel Bank Common Lisp) портируется на Nintendo Switch, что имеет большое значение для разработки игр на Common Lisp благодаря интерактивной оценке кода и быстрым циклам разработки.",
      "Проект возглавляет Shinmera, который занимается переносимостью и архитектурой сборки, подчеркивая технические трудности и потенциальные преимущества запуска SBCL на специализированном игровом оборудовании.",
      "Использование официального SDK (Software Development Kit) от Nintendo необходимо для публикации игр на Switch, так как самодельные SDK не поддерживаются для розничных выпусков на консоли."
    ],
    "points": 234,
    "commentCount": 40,
    "retryCount": 0,
    "time": 1726232021
  },
  {
    "id": 41527991,
    "title": "Кому принадлежит Nebula?",
    "originLink": "https://medium.com/@cameron-paul/who-actually-owns-nebula-952a1c12d9c0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41527991",
    "commentBody": "",
    "originSummary": [
      "Небула — это сервис потокового видео по запросу, ориентированный на образовательный контент, созданный авторами контента, но не полностью принадлежащий им.",
      "«Standard Broadcast владеет 83,125% Nebula, CuriosityStream владеет 16,875%, а создатели напрямую не владеют долей, хотя они получают 50% прибыли и доходов от продажи.»",
      "Создатели имеют «теневую долю», что означает, что они получают компенсацию как владельцы, не имея фактических акций, что вызывает вопросы о соответствии платформы ценностям создателей."
    ],
    "commentSummary": [
      "Небула принадлежит компании Standard Broadcast LLC, при этом 44 создателя имеют теневую долю вместо прямого владения, чтобы избежать логистических и налоговых проблем.",
      "Если Nebula будет продана, создатели получат 50% от выручки, но некоторые утверждают, что структура не обладает прозрачностью и истинным кооперативным владением.",
      "Критики утверждают, что маркетинг вводит в заблуждение, так как создатели не имеют прямой доли или контроля над Nebula."
    ],
    "points": 226,
    "commentCount": 74,
    "retryCount": 0,
    "time": 1726201127
  },
  {
    "id": 41530190,
    "title": "FlowTracker – Отслеживание данных, проходящих через программы на Java",
    "originLink": "https://github.com/coekie/flowtracker",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41530190",
    "commentBody": "",
    "originSummary": [
      "«FlowTracker — это Java-агент, предназначенный для отслеживания потока данных в Java-программах, что помогает понять происхождение и значение выходных данных.»",
      "Он предлагает видеоурок и живую демонстрацию, чтобы пользователи могли изучить его функциональные возможности.",
      "Больше информации и доступ к инструменту можно найти на его странице GitHub: https://github.com/coekie/flowtracker."
    ],
    "commentSummary": [
      "«FlowTracker — это Java-агент, предназначенный для отслеживания потока данных в Java-программах, что помогает в понимании выходных данных программы.»",
      "Пользователи сравнивают FlowTracker с такими инструментами, как jitwatch и динамическое отслеживание загрязнений, подчеркивая его потенциал для устранения неполадок и отслеживания происхождения данных.",
      "Демонстрация показывает свою способность отслеживать HTML-элемент до SQL-запроса, который добавил его в базу данных, вызывая интерес к его интеграции в различные среды разработки."
    ],
    "points": 209,
    "commentCount": 27,
    "retryCount": 0,
    "time": 1726227208
  },
  {
    "id": 41527675,
    "title": "Более производительная криптография на эллиптических кривых «25519»",
    "originLink": "https://www.amazon.science/blog/better-performing-25519-elliptic-curve-cryptography",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41527675",
    "commentBody": "",
    "originSummary": [
      "АWS улучшила производительность и корректность криптографии на эллиптической кривой «25519» в своей библиотеке с открытым исходным кодом AWS LibCrypto (AWS-LC) с помощью автоматизированного анализа и оптимизаций, специфичных для процессора.",
      "«Эти улучшения, основанные на BoringSSL от Google, включают значительное повышение производительности для алгоритмов x25519 и Ed25519 на процессорах x86_64 и Arm64, при этом операции подписи Ed25519 увеличились на 108%, а операции x25519 улучшились на 113%.»",
      "«Улучшения обеспечивают выполнение за постоянное время для предотвращения атак по сторонним каналам, с проверкой корректности с помощью библиотеки s2n-bignum и теоремного доказателя HOL Light, что делает AWS-LC надежным выбором для безопасных криптографических реализаций.»"
    ],
    "commentSummary": [
      "Новая эллиптическая криптография Amazon \"25519\" демонстрирует значительные улучшения в производительности, особенно с оптимизированной реализацией AVX512 от команды Firedancer, которая превосходит OpenSSL.",
      "Алгоритм x25519 используется в TLS 1.3 и гибридных схемах SSH для постквантового согласования ключей, что подчеркивает его важность в современных криптографических протоколах.",
      "«Кодовая база Firedancer, известная оптимизацией блокчейна, получила признание за свою производительность и безопасные программные практики, что способствует более широкому использованию ed25519 вместо RSA для SSH-ключей благодаря лучшей производительности, безопасности и совместимости.»"
    ],
    "points": 183,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1726195912
  },
  {
    "id": 41532946,
    "title": "Приглашение в календарь без кликов – Критическая цепочка уязвимостей без кликов в macOS",
    "originLink": "https://mikko-kenttala.medium.com/zero-click-calendar-invite-critical-zero-click-vulnerability-chain-in-macos-a7a434fc887b",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41532946",
    "commentBody": "",
    "originSummary": [
      "Уязвимость нулевого клика в macOS Calendar позволяла злоумышленникам добавлять или удалять файлы в песочнице Calendar, что могло привести к выполнению вредоносного кода и компрометации данных iCloud Photos.",
      "Apple устранила эти уязвимости в период с октября 2022 года по сентябрь 2023 года, решив проблемы, такие как произвольная запись/удаление файлов, удаленное выполнение кода и доступ к конфиденциальным данным фотографий.",
      "Цепочка эксплуатации включала несколько шагов для обхода безопасности macOS, включая уклонение от песочницы, обход Gatekeeper и обход защиты TCC, с исправлениями, реализованными в различных обновлениях macOS."
    ],
    "commentSummary": [
      "Критическая уязвимость нулевого клика в macOS позволяет злоумышленникам отправлять вредоносные приглашения в календарь с вложениями файлов, что потенциально может привести к краже фотографий iCloud без взаимодействия пользователя.",
      "Пользователи ставят под сомнение безопасность таких приглашений и предлагают в качестве меры предосторожности включать в белый список определенных отправителей.",
      "Apple медленно выплачивает вознаграждения за эти уязвимости, что вызывает обеспокоенность по поводу их приверженности к конфиденциальности пользователей и своевременным обновлениям."
    ],
    "points": 171,
    "commentCount": 29,
    "retryCount": 0,
    "time": 1726246226
  },
  {
    "id": 41526754,
    "title": "Notepat – Эстетичный компьютер",
    "originLink": "https://aesthetic.computer/notepat",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41526754",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "\"Notepat\" — это проект цифрового искусства Джеффри Скаддера, доступный через веб-сайт aesthetic.computer, который представляет собой ретро-компьютерную среду и уникальные инструменты для создания цифрового искусства.",
      "Проект включает интерактивные элементы, такие как приложение 'notepat' для создания музыки, с командами и уникальной раскладкой клавиатуры, основанной на хроматической гамме.",
      "Пользователи могут исследовать различные функции, включая VR-опыт, такой как «Странные цветы», и проект вызвал значительный интерес благодаря своему инновационному и художественному подходу к цифровым инструментам."
    ],
    "points": 149,
    "commentCount": 35,
    "retryCount": 0,
    "time": 1726183908
  },
  {
    "id": 41533060,
    "title": "Meta обучала свой ИИ на всем, что взрослые публично публиковали с 2007 года",
    "originLink": "https://www.theverge.com/2024/9/12/24242789/meta-training-ai-models-facebook-instagram-photo-post-data",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41533060",
    "commentBody": "",
    "originSummary": [
      "Meta использует публичные посты и фотографии с Facebook и Instagram с 2007 года для обучения своих моделей ИИ, если пользователи не установили для своих постов статус «приватный».",
      "Европейские пользователи могут отказаться от использования этих данных в соответствии с местными законами о конфиденциальности, но пользователи в других регионах, включая Австралию, не имеют такой возможности.",
      "Meta не предоставила четких деталей о специфике использования данных и сроках их сбора, что вызывает обеспокоенность пользователей по поводу конфиденциальности."
    ],
    "commentSummary": [
      "Meta использует публичные посты взрослых с 2007 года для обучения своего ИИ, что вызвало дебаты об этике и законности использования публичных данных для обучения ИИ.",
      "Критики беспокоятся о том, что работы создателей копируются без их согласия, что поднимает вопросы о добросовестном использовании и законах об авторском праве.",
      "«Обсуждение подчеркивает напряжение между технологическим прогрессом и защитой прав личности.»"
    ],
    "points": 120,
    "commentCount": 144,
    "retryCount": 0,
    "time": 1726247104
  },
  {
    "id": 41526825,
    "title": "Оползень в Гренландии вызвал аномальную волну, которая сотрясала Землю в течение девяти дней",
    "originLink": "https://www.newscientist.com/article/2447567-greenland-landslide-caused-freak-wave-that-shook-earth-for-nine-days/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41526825",
    "commentBody": "",
    "originSummary": [
      "В августе 2023 года оползень в фьорде Диксон в Гренландии вызвал цунами высотой 110 метров, создав стоячую волну, которая длилась девять дней.",
      "Сейсмологи первоначально идентифицировали волну как «неопознанный сейсмический объект» (НСО) с частотой 11 миллигерц, вызванный истончением ледников, вызванным изменением климата.",
      "Уникальная форма и особенности фьорда задержали энергию волны, подчеркивая значительное влияние изменения климата на геологические явления Земли."
    ],
    "commentSummary": [
      "Оползень в Гренландии вызвал цунами высотой 110 метров, которое впервые заметили, когда бывший сотрудник увидел, как заброшенная исследовательская станция SIRIUS была смыта после того, как круизный корабль сел на мель.",
      "Цунами, первоначально высотой 7 метров, было обнаружено в течение недели из-за инцидента с круизным лайнером, хотя сейсмические данные в конечном итоге бы его выявили.",
      "Сейсмологические устройства по всему миру зафиксировали событие, которое длилось девять дней, подчеркивая, как случайные происшествия могут привести к значительным открытиям."
    ],
    "points": 89,
    "commentCount": 13,
    "retryCount": 0,
    "time": 1726184600
  },
  {
    "id": 41527378,
    "title": "Wallops: современный IRC-клиент для классической Mac OS",
    "originLink": "https://jcs.org/wallops",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41527378",
    "commentBody": "",
    "originSummary": [
      "Wallops, современный IRC-клиент для классической Mac OS, выпустил версию 2.0, совместимую с System 6 и новыми версиями, и включает значительные обновления и исправления ошибок.",
      "Ключевые особенности включают интерфейс с вкладками для нескольких подключений, каналов и личных сообщений, изменение размера окна и оптимизированную сортировку списка ников для больших каналов.",
      "Wallops 2.0 также вводит новые команды, улучшенные элементы интерфейса и улучшения производительности, делая его мощным инструментом для пользователей IRC на классических системах Mac."
    ],
    "commentSummary": [
      "Wallops — это современный IRC (Internet Relay Chat) клиент, разработанный для классической операционной системы Mac OS, вызывающий интерес у энтузиастов винтажных вычислений.",
      "Выпуск вызвал волну восторга из-за редкости нового программного обеспечения для старых систем, пользователи вспоминают свои впечатления от работы с классическими Маками.",
      "Некоторые пользователи отметили улучшения в эмуляции Mac, предлагая использовать такие инструменты, как MAME (Multiple Arcade Machine Emulator), для тех, у кого нет работающего винтажного оборудования."
    ],
    "points": 81,
    "commentCount": 22,
    "retryCount": 0,
    "time": 1726192270
  }
]
