[
  {
    "id": 41527143,
    "title": "Notas sobre los nuevos modelos de cadena de pensamiento o1 de OpenAI",
    "originLink": "https://simonwillison.net/2024/Sep/12/openai-o1/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41527143",
    "commentBody": "",
    "originSummary": [
      "OpenAI ha lanzado dos nuevos modelos, o1-preview y o1-mini, con el nombre en clave \"strawberry\", que ofrecen capacidades de razonamiento mejoradas mediante un patrón de indicación en cadena de pensamiento.",
      "Estos modelos están reservados para cuentas de nivel 5 (más de $1,000 en créditos de API) e introducen \"tokens de razonamiento\" que se facturan pero no son visibles en la respuesta de la API, lo que genera cierta insatisfacción debido a la falta de transparencia.",
      "La nueva generación de modelos puede manejar mejor las indicaciones complejas y ha aumentado las asignaciones de tokens de salida, ampliando las tareas potenciales que pueden resolver los grandes modelos de lenguaje (LLMs)."
    ],
    "commentSummary": [
      "Los nuevos modelos de cadena de pensamiento o1 de OpenAI aún producen alucinaciones, como bibliotecas y funciones inexistentes, y a menudo proporcionan hechos incorrectos.",
      "Los usuarios observan que, aunque las capacidades de razonamiento han mejorado, los modelos aún no logran verificar la exactitud factual de sus resultados, lo que requiere que los usuarios verifiquen dos veces.",
      "Algunos usuarios comparan los modelos con pasantes ingenuos pero inteligentes, sugiriendo que pueden ser útiles con la orientación adecuada, aunque carecen de la capacidad de hacer preguntas aclaratorias o admitir incertidumbre, lo que afecta su fiabilidad."
    ],
    "points": 593,
    "commentCount": 520,
    "retryCount": 0,
    "time": 1726188481
  },
  {
    "id": 41525778,
    "title": "Detectives de datos que detectaron mala conducta en la investigación absueltos de difamación",
    "originLink": "https://arstechnica.com/science/2024/09/court-clears-researchers-of-defamation-for-identifying-manipulated-data/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41525778",
    "commentBody": "",
    "originSummary": [
      "Un tribunal ha exonerado a los investigadores de Data Colada de difamación por identificar datos manipulados en una investigación de la Escuela de Negocios de Harvard.",
      "Harvard aún enfrentará un juicio por su manejo del caso, a pesar de confirmar la mala conducta de la profesora Francesca Gino, quien está en licencia administrativa y podría perder la titularidad.",
      "La corte dictaminó que las conclusiones respaldadas por pruebas no son difamación, exonerando completamente al equipo de Data Colada debido a su enfoque cauteloso y basado en evidencias."
    ],
    "commentSummary": [
      "Los detectives de datos acusados de difamación por identificar mala conducta en la investigación han sido absueltos, con el caso desestimado antes del descubrimiento.",
      "La corte dictaminó que las conclusiones respaldadas por pruebas sobre datos fabricados no constituyen difamación, apoyando la integridad científica.",
      "Los acusados recaudaron más de $300,000 en GoFundMe para su defensa legal, destacando los altos costos y el impacto emocional de las demandas por difamación en los EE. UU."
    ],
    "points": 519,
    "commentCount": 99,
    "retryCount": 0,
    "time": 1726176497
  },
  {
    "id": 41528075,
    "title": "Boeing trabajadores votan a favor de la huelga",
    "originLink": "https://www.washingtonpost.com/business/2024/09/13/boeing-union-contract-strike/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41528075",
    "commentBody": "",
    "originSummary": [
      "Decenas de miles de maquinistas de Boeing votaron abrumadoramente a favor de la huelga tras rechazar una oferta de contrato, con un 96% de apoyo del Distrito 751 de la Asociación Internacional de Maquinistas y Trabajadores Aeroespaciales.",
      "La huelga, que comenzó fuera de las plantas de Boeing en el estado de Washington, podría costarle a la empresa un estimado de $1 mil millones por semana y perturbar su recuperación de los desafíos financieros y de seguridad.",
      "A pesar de un aumento salarial propuesto del 25% durante cuatro años y beneficios mejorados, el acuerdo no cumplió con otras demandas del sindicato; Boeing está listo para volver a las negociaciones, y la administración Biden está monitoreando la situación."
    ],
    "commentSummary": [
      "Boeing trabajadores han votado a huelga, con un 96% rechazando un acuerdo propuesto que incluía un aumento salarial significativo.",
      "La unión de maquinistas está exigiendo mejor salario, mejores condiciones de trabajo y que Boeing \"deje de infringir la ley\".",
      "La huelga subraya una insatisfacción más amplia con la gestión de Boeing, criticada por priorizar las ganancias sobre la calidad y seguridad de la ingeniería, contribuyendo a problemas como los accidentes del 737 Max."
    ],
    "points": 468,
    "commentCount": 429,
    "retryCount": 0,
    "time": 1726202517
  },
  {
    "id": 41526288,
    "title": "FDA autoriza el primer software de audífonos de venta libre",
    "originLink": "https://www.fda.gov/news-events/press-announcements/fda-authorizes-first-over-counter-hearing-aid-software",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41526288",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "La FDA ha aprobado el primer software de audífonos de venta libre, permitiendo que los AirPods se utilicen como audífonos, lo que podría reducir el estigma y aumentar la accesibilidad.",
      "Se anticipa que esta aprobación reducirá los costos y alentará a más personas a abordar su pérdida auditiva, aunque persisten preocupaciones sobre la duración de la batería y la percepción social.",
      "Los usuarios han reportado experiencias positivas con las funciones de accesibilidad de los audífonos y los AirPods, marcando un paso significativo hacia la asequibilidad y aceptación de los audífonos."
    ],
    "points": 343,
    "commentCount": 191,
    "retryCount": 0,
    "time": 1726179871
  },
  {
    "id": 41528266,
    "title": "Se informa que todo el personal de la editorial de juegos Annapurna Interactive ha renunciado",
    "originLink": "https://www.theverge.com/games/2024/9/12/24243317/annapurna-interactive-staff-reportedly-resigns",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41528266",
    "commentBody": "",
    "originSummary": [
      "La totalidad del personal de Annapurna Interactive, incluido el ex presidente Nathan Gary, ha renunciado tras un intento fallido de escindir la empresa en una entidad independiente.",
      "Los juegos y proyectos existentes de Annapurna Interactive permanecerán bajo la compañía, con Héctor Sánchez recientemente nombrado como presidente de interactivos y nuevos medios.",
      "Annapurna planea integrar sus operaciones de juegos con sus divisiones de cine, televisión y teatro, continuando con la publicación de juegos como Lorelei and the Laser Eyes y Open Roads, con títulos próximos como Blade Runner 2033: Labyrinth."
    ],
    "commentSummary": [
      "La totalidad del personal de Annapurna Interactive, una editorial de videojuegos, ha renunciado debido a las fallidas negociaciones con su empresa matriz, Annapurna Pictures, sobre la integración financiera.",
      "La plantilla y los ejecutivos prefirieron escindirse para mantener el control sobre su dirección creativa, especialmente después del éxito de juegos como 'Outer Wilds' y 'Stray'.",
      "Esta renuncia masiva destaca la tensión entre la independencia creativa y las presiones financieras dentro de la industria de los videojuegos."
    ],
    "points": 332,
    "commentCount": 163,
    "retryCount": 0,
    "time": 1726205668
  },
  {
    "id": 41527564,
    "title": "¿Necesita su startup una infraestructura en la nube compleja?",
    "originLink": "https://www.hadijaveed.me/2024/09/08/does-your-startup-really-need-complex-cloud-infrastructure/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41527564",
    "commentBody": "",
    "originSummary": [
      "Pieter Levels aboga por una infraestructura más simple, utilizando servidores únicos en lugar de configuraciones complejas en la nube, para centrarse en el ajuste del producto al mercado, como se discutió en el Podcast de Lex Friedman.",
      "Dos estudios de caso destacan las trampas de configuraciones demasiado complicadas: uno con funciones Lambda excesivas y otro con microservicios innecesarios, ambos restando valor al desarrollo de características.",
      "Los servidores modernos y herramientas como Docker Compose pueden proporcionar soluciones poderosas, manejables y económicas, permitiendo a los equipos pequeños centrarse en crear excelentes productos en lugar de gestionar infraestructuras complejas."
    ],
    "commentSummary": [
      "Las startups a menudo adoptan infraestructuras en la nube complejas como Kubernetes para la escalabilidad, pero esto puede llevar a una mala calidad y altos costos debido a decisiones inmaduras del equipo.",
      "Algunos profesionales experimentados argumentan que configuraciones más simples y reproducibles utilizando herramientas como Puppet y sistemas LTS (Soporte a Largo Plazo) pueden ser más eficientes y rentables.",
      "La discusión resalta las compensaciones entre los enfoques modernos nativos de la nube y los métodos tradicionales y deterministas para gestionar la infraestructura."
    ],
    "points": 239,
    "commentCount": 305,
    "retryCount": 0,
    "time": 1726194591
  },
  {
    "id": 41530783,
    "title": "Portar SBCL a la Nintendo Switch",
    "originLink": "https://reader.tymoon.eu/article/437",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41530783",
    "commentBody": "",
    "originSummary": [
      "Charles Zhang y Shinmera han estado trabajando durante dos años para portar el motor de juego Trial a la Nintendo Switch, centrándose en adaptar el tiempo de ejecución de Common Lisp.",
      "A pesar de compilar y ejecutar con éxito el código Lisp en la Switch, los problemas no resueltos incluyen la recolección de basura y la salida de audio, con un costo del proyecto de alrededor de $17,000.",
      "La compatibilidad del chip ARM64 Cortex-A57 de la Switch y OpenGL hizo posible la adaptación, pero persisten desafíos, como la interfaz con el sistema operativo propietario de la Switch y la optimización de la compilación de CLOS."
    ],
    "commentSummary": [
      "SBCL (Steel Bank Common Lisp) está siendo portado a la Nintendo Switch, lo cual es significativo para el desarrollo de juegos en Common Lisp debido a su evaluación interactiva de código y ciclos de desarrollo rápidos.",
      "La dirección del proyecto está a cargo de Shinmera, quien se encarga de la portabilidad y la arquitectura de construcción, destacando los desafíos técnicos y los beneficios potenciales de ejecutar SBCL en hardware de juego especializado.",
      "La utilización del SDK oficial de Nintendo (Kit de Desarrollo de Software) es necesaria para publicar juegos en la Switch, ya que los SDK caseros no son compatibles para lanzamientos en consolas comerciales."
    ],
    "points": 234,
    "commentCount": 40,
    "retryCount": 0,
    "time": 1726232021
  },
  {
    "id": 41527991,
    "title": "¿Quién es el dueño de Nebula?",
    "originLink": "https://medium.com/@cameron-paul/who-actually-owns-nebula-952a1c12d9c0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41527991",
    "commentBody": "",
    "originSummary": [
      "Nebula es un servicio de transmisión de video a pedido que se centra en contenido educativo, creado por creadores de contenido pero no verdaderamente propiedad de ellos.",
      "Standard Broadcast posee el 83.125% de Nebula, CuriosityStream posee el 16.875%, y los creadores no poseen directamente ningún porcentaje, aunque reciben el 50% de las ganancias y los ingresos de una venta.",
      "Los creadores tienen 'equidad en la sombra', lo que significa que son compensados como propietarios sin tener acciones reales, lo que plantea preguntas sobre la alineación de la plataforma con los valores de los creadores."
    ],
    "commentSummary": [
      "Nebula es propiedad de Standard Broadcast LLC, con 44 creadores que tienen participación en sombra en lugar de propiedad directa para evitar problemas logísticos y fiscales.",
      "Si se vende Nebula, los creadores reciben el 50% de los ingresos, pero algunos argumentan que la estructura carece de transparencia y verdadera propiedad cooperativa.",
      "Los críticos afirman que la publicidad es engañosa ya que los creadores no tienen participación directa ni control sobre Nebula."
    ],
    "points": 226,
    "commentCount": 74,
    "retryCount": 0,
    "time": 1726201127
  },
  {
    "id": 41530190,
    "title": "FlowTracker – Rastrea datos que fluyen a través de programas Java",
    "originLink": "https://github.com/coekie/flowtracker",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41530190",
    "commentBody": "",
    "originSummary": [
      "FlowTracker es un agente de Java diseñado para rastrear el flujo de datos dentro de programas Java, ayudando a comprender el origen y la importancia de las salidas.",
      "Ofrece un tutorial en video y una demostración en vivo para que los usuarios exploren sus funcionalidades.",
      "Más información y acceso a la herramienta se pueden encontrar en su página de GitHub: https://github.com/coekie/flowtracker."
    ],
    "commentSummary": [
      "FlowTracker es un agente de Java diseñado para rastrear el flujo de datos en programas Java, ayudando a comprender las salidas del programa.",
      "Los usuarios comparan FlowTracker con herramientas como jitwatch y el seguimiento dinámico de contaminación, destacando su potencial para la resolución de problemas y el seguimiento del origen de los datos.",
      "La demostración muestra su capacidad para rastrear un elemento HTML hasta la declaración SQL que lo agregó a la base de datos, generando entusiasmo por su integración en varios entornos de desarrollo."
    ],
    "points": 209,
    "commentCount": 27,
    "retryCount": 0,
    "time": 1726227208
  },
  {
    "id": 41527675,
    "title": "Criptografía de curvas elípticas “25519” de mejor rendimiento",
    "originLink": "https://www.amazon.science/blog/better-performing-25519-elliptic-curve-cryptography",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41527675",
    "commentBody": "",
    "originSummary": [
      "AWS ha mejorado el rendimiento y la corrección de la criptografía de curva elíptica \"25519\" en su biblioteca de código abierto, AWS LibCrypto (AWS-LC), mediante razonamiento automatizado y optimizaciones específicas de la CPU.",
      "Estas mejoras, basadas en BoringSSL de Google, incluyen ganancias significativas de rendimiento para los algoritmos x25519 y Ed25519 en CPUs x86_64 y Arm64, con las operaciones de firma Ed25519 viendo un aumento del 108% y las operaciones x25519 mejorando en un 113%.",
      "Las mejoras garantizan una ejecución en tiempo constante para prevenir ataques de canal lateral, con la corrección verificada por la biblioteca s2n-bignum y el demostrador de teoremas HOL Light, lo que convierte a AWS-LC en una opción robusta para implementaciones criptográficas seguras."
    ],
    "commentSummary": [
      "El nuevo cifrado de curva elíptica \"25519\" de Amazon demuestra mejoras significativas en el rendimiento, particularmente con una implementación optimizada para AVX512 por el equipo de Firedancer que supera a OpenSSL.",
      "La algoritmo x25519 se utiliza en los esquemas híbridos de TLS 1.3 y SSH para el acuerdo de claves post-cuánticas, destacando su importancia en los protocolos criptográficos modernos.",
      "El código base de Firedancer, conocido por la optimización de blockchain, es elogiado por su rendimiento y prácticas de programación seguras, contribuyendo a la adopción más amplia de ed25519 sobre RSA para claves SSH debido a su mejor rendimiento, seguridad y compatibilidad."
    ],
    "points": 183,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1726195912
  },
  {
    "id": 41532946,
    "title": "Invitación de calendario sin clic: Cadena de vulnerabilidad crítica sin clic en macOS",
    "originLink": "https://mikko-kenttala.medium.com/zero-click-calendar-invite-critical-zero-click-vulnerability-chain-in-macos-a7a434fc887b",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41532946",
    "commentBody": "",
    "originSummary": [
      "Una vulnerabilidad de cero clic en el Calendario de macOS permitía a los atacantes agregar o eliminar archivos dentro del entorno aislado del Calendario, lo que potencialmente podía llevar a la ejecución de código malicioso y comprometer los datos de Fotos de iCloud.",
      "Apple solucionó estas vulnerabilidades entre octubre de 2022 y septiembre de 2023, abordando problemas como la escritura/eliminación arbitraria de archivos, la ejecución remota de código y el acceso a datos sensibles de fotos.",
      "La cadena de explotación involucró múltiples pasos para eludir la seguridad de macOS, incluyendo la evasión del sandbox, la omisión de Gatekeeper y la elusión de la protección TCC, con correcciones implementadas en varias actualizaciones de macOS."
    ],
    "commentSummary": [
      "Una vulnerabilidad crítica de cero clics en macOS permite a los atacantes enviar invitaciones de calendario maliciosas con archivos adjuntos, lo que podría robar Fotos de iCloud sin interacción del usuario.",
      "Los usuarios están cuestionando la seguridad de tales invitaciones y sugiriendo la inclusión en la lista blanca de remitentes específicos como precaución.",
      "Apple ha sido lenta en pagar recompensas por estas vulnerabilidades, lo que genera preocupaciones sobre su compromiso con la privacidad del usuario y las actualizaciones oportunas."
    ],
    "points": 171,
    "commentCount": 29,
    "retryCount": 0,
    "time": 1726246226
  },
  {
    "id": 41526754,
    "title": "Notepat – Computadora Estética",
    "originLink": "https://aesthetic.computer/notepat",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41526754",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "\"Notepat\" es un proyecto de arte digital de Jeffrey Scudder, accesible a través del sitio web aesthetic.computer, que presenta un entorno de computación retro y herramientas únicas para crear arte digital.",
      "La propuesta incluye elementos interactivos como una aplicación 'notepat' para la creación musical, con comandos y un diseño de teclado distintivo basado en la escala cromática.",
      "Los usuarios pueden explorar varias características, incluidas experiencias de realidad virtual como \"Freaky Flowers\", y el proyecto ha generado un interés significativo por su enfoque innovador y artístico hacia las herramientas digitales."
    ],
    "points": 149,
    "commentCount": 35,
    "retryCount": 0,
    "time": 1726183908
  },
  {
    "id": 41533060,
    "title": "Meta alimentó su IA con todo lo que los adultos han publicado públicamente desde 2007",
    "originLink": "https://www.theverge.com/2024/9/12/24242789/meta-training-ai-models-facebook-instagram-photo-post-data",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41533060",
    "commentBody": "",
    "originSummary": [
      "Meta ha estado utilizando publicaciones y fotos públicas de Facebook e Instagram desde 2007 para entrenar sus modelos de IA, a menos que los usuarios configuren sus publicaciones como privadas.",
      "Los usuarios europeos pueden optar por no participar en este uso de datos debido a las leyes locales de privacidad, pero los usuarios en otras regiones, incluida Australia, no tienen esta opción.",
      "Meta no ha proporcionado detalles claros sobre los aspectos específicos de su uso y recopilación de datos, lo que genera preocupaciones de privacidad entre los usuarios."
    ],
    "commentSummary": [
      "Meta ha estado utilizando publicaciones públicas de adultos desde 2007 para entrenar su IA, lo que ha generado un debate sobre la ética y la legalidad del uso de datos públicos para el entrenamiento de IA.",
      "Los críticos se preocupan por el trabajo de los creadores que se copia sin consentimiento, lo que plantea preguntas sobre el uso justo y las leyes de derechos de autor.",
      "La discusión subraya la tensión entre el progreso tecnológico y la protección de los derechos individuales."
    ],
    "points": 120,
    "commentCount": 144,
    "retryCount": 0,
    "time": 1726247104
  },
  {
    "id": 41526825,
    "title": "Un deslizamiento de tierra en Groenlandia causó una ola anómala que sacudió la Tierra durante nueve días",
    "originLink": "https://www.newscientist.com/article/2447567-greenland-landslide-caused-freak-wave-that-shook-earth-for-nine-days/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41526825",
    "commentBody": "",
    "originSummary": [
      "En agosto de 2023, un deslizamiento de tierra en el fiordo Dickson de Groenlandia causó un tsunami de 110 metros de altura, creando una ola estacionaria que duró nueve días.",
      "Los sismólogos inicialmente identificaron la onda como un \"objeto sísmico no identificado\" (USO) con una frecuencia de 11 milihertz, desencadenado por el adelgazamiento de los glaciares inducido por el cambio climático.",
      "La forma y características únicas del fiordo atraparon la energía de la ola, destacando el impacto significativo del cambio climático en los fenómenos geológicos de la Tierra."
    ],
    "commentSummary": [
      "Un deslizamiento de tierra en Groenlandia provocó un tsunami de 110 metros de altura, inicialmente notado cuando un ex empleado vio una estación de investigación SIRIUS abandonada ser arrasada después de que un crucero encallara.",
      "La tsunami, inicialmente de 7 metros de altura, fue detectada dentro de una semana debido al incidente del crucero, aunque los datos sísmicos eventualmente la habrían revelado.",
      "Los dispositivos sismológicos de todo el mundo registraron el evento, que duró nueve días, destacando cómo los sucesos aleatorios pueden llevar a descubrimientos significativos."
    ],
    "points": 89,
    "commentCount": 13,
    "retryCount": 0,
    "time": 1726184600
  },
  {
    "id": 41527378,
    "title": "Wallops: Un cliente IRC moderno para Mac OS clásico",
    "originLink": "https://jcs.org/wallops",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41527378",
    "commentBody": "",
    "originSummary": [
      "Wallops, un cliente IRC moderno para Mac OS clásico, ha lanzado la versión 2.0, compatible con System 6 y versiones más recientes, e incluye actualizaciones significativas y correcciones de errores.",
      "Las características clave incluyen una interfaz con pestañas para múltiples conexiones, canales y mensajes privados, redimensionamiento de ventanas y una clasificación optimizada de la lista de nicks para canales grandes.",
      "Wallops 2.0 también introduce nuevos comandos, elementos de interfaz mejorados y mejoras de rendimiento, convirtiéndolo en una herramienta robusta para los usuarios de IRC en sistemas Mac clásicos."
    ],
    "commentSummary": [
      "Wallops es un cliente IRC (Internet Relay Chat) moderno diseñado para el clásico Mac OS, generando interés entre los entusiastas de la informática vintage.",
      "La publicación ha generado entusiasmo debido a la rareza de nuevo software para sistemas antiguos, con usuarios recordando sus experiencias con los Macs clásicos.",
      "Algunos usuarios han notado mejoras en la emulación de Mac, sugiriendo herramientas como MAME (Multiple Arcade Machine Emulator) para aquellos que no tienen hardware vintage en funcionamiento."
    ],
    "points": 81,
    "commentCount": 22,
    "retryCount": 0,
    "time": 1726192270
  }
]
