[
  {
    "id": 38826283,
    "title": "ஹேப்பி நியூ இயர் ஹேக்கர் நியூஸ்: பல முறை பார்க்க வேண்டிய ஒரே வலைத்தளம்",
    "originLink": "https://news.ycombinator.com/item?id=38826283",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38826283",
    "commentBody": "",
    "originSummary": [
      "ஹேக்கர் நியூஸின் (எச்.என்) அதிகப்படியான பயன்பாட்டை ஆசிரியர் ஒப்புக்கொள்கிறார், ஆனால் இது அடிக்கடி பார்க்க வேண்டிய ஒரே வலைத்தளம் என்று நம்புகிறார்.",
      "ஆசிரியர் 2024 ஆம் ஆண்டிற்கான நல்வாழ்த்துக்களை அனுப்புகிறார்.",
      "உரையில் கணிசமான அல்லது குறிப்பிடத்தக்க தகவல்கள் எதுவும் வழங்கப்படவில்லை."
    ],
    "commentSummary": [
      "ஹேக்கர் நியூஸில் பயனர்கள் உறவுகளை உருவாக்குவது, லினக்ஸ் மற்றும் எதிர்காலத்திற்கான நன்றி மற்றும் அபிலாஷைகளை வெளிப்படுத்துவது பற்றிய விவாதங்களில் ஈடுபடுகிறார்கள்.",
      "விவாதங்களின் ஒட்டுமொத்த தொனி நேர்மறையானது மற்றும் தனிப்பட்ட வளர்ச்சியில் கவனம் செலுத்தியது.",
      "இந்த சமூகம் அனுபவங்களைப் பகிர்ந்து கொள்வதற்கும் தொழில்நுட்ப ஆர்வலர்களிடையே சமூக உணர்வை வளர்ப்பதற்கும் ஒரு தளமாக செயல்படுகிறது."
    ],
    "points": 1267,
    "commentCount": 246,
    "retryCount": 0,
    "time": 1704047614
  },
  {
    "id": 38823101,
    "title": "ஸ்டீம்ஓஎஸ் தனிப்பயனாக்குதல்: சவால்கள், புதுப்பிப்புகள் மற்றும் மோட்ஸ்",
    "originLink": "https://iliana.fyi/blog/build-your-own-steamos-updates/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38823101",
    "commentBody": "",
    "originSummary": [
      "ஆசிரியர் தங்கள் வரவேற்பறை பிசிக்கு ஸ்டீம்ஓஎஸ் தனிப்பயனாக்குவதில் அவர்களின் அனுபவத்தைப் பற்றி விவாதிக்கிறார், அவர்கள் சந்தித்த சிரமங்களை கோடிட்டுக் காட்டுகிறார்.",
      "ஸ்டீம்ஓஎஸ் இல் பயன்படுத்தப்படும் பகிர்வு அமைப்பு மற்றும் புதுப்பிப்பு செயல்முறையை அவர்கள் விளக்குகிறார்கள், லினக்ஸ் நெப்டியூன் களஞ்சியத்தை மாற்றியமைப்பது மற்றும் ஸ்டீம் டெக்கிற்கான ஸ்டீம்ஓஎஸ் ரூட் கோப்பு அமைப்பு படத்தைப் பெறுவதற்கான வழிமுறைகளை வழங்குகிறார்கள்.",
      "இந்த கட்டுரை பேக்மேன் களஞ்சியங்களைப் பயன்படுத்தி பேக்கேஜிங் தனிப்பயன் மென்பொருளையும், ஸ்டீம்ஓஎஸ் நிறுவல்களைப் புதுப்பிப்பதையும் உள்ளடக்கியது. வால்வின் EULA க்கு ஒரு புதுப்பிப்பின் அவசியத்தை பரிந்துரைப்பதன் மூலம் ஆசிரியர் முடிக்கிறார்."
    ],
    "commentSummary": [
      "இந்த விவாதம் லினக்ஸில் கேமிங்கின் பல்வேறு அம்சங்களை உள்ளடக்கியது, அதாவது ஓஎஸ் தனிப்பயனாக்கம் மற்றும் விருப்பமான மேம்பாட்டு சூழல்கள்.",
      "இது விண்டோஸுடன் ஒப்பிடும்போது லினக்ஸில் பணிகளைச் செய்வதில் உள்ள சவால்கள் மற்றும் லினக்ஸ் கேமிங்கில் உள்ள வரம்புகளை ஆராய்கிறது.",
      "இந்த உரையாடல் மல்டிபிளேயர் கேம்களில் மோசடி, ஏமாற்று எதிர்ப்பு அமைப்புகள், கேமிங்கிற்கான லினக்ஸ் விநியோகங்களின் நிலைத்தன்மை மற்றும் லினக்ஸ் கேமிங்கில் நீராவி டெக்கின் தாக்கம் ஆகியவற்றையும் தொடுகிறது."
    ],
    "points": 426,
    "commentCount": 214,
    "retryCount": 0,
    "time": 1704019533
  },
  {
    "id": 38823514,
    "title": "குறைந்த சக்தி கொண்ட சேவையகம் / என்ஏஎஸ் உருவாக்குதல்: இன்டெல் 12 வது / 13 வது ஜெனரல் மூலம் 7 வாட்ஸ்களை அடைதல்",
    "originLink": "https://mattgadient.com/7-watts-idle-on-intel-12th-13th-gen-the-foundation-for-building-a-low-power-server-nas/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38823514",
    "commentBody": "",
    "originSummary": [
      "இன்டெல் செயலிகளைப் பயன்படுத்தி குறைந்த சக்தி சேவையகம் / என்ஏஎஸ் அமைப்பை உருவாக்குவதில் ஆசிரியர் தங்கள் அனுபவத்தைப் பகிர்ந்து கொள்கிறார் மற்றும் 7 வாட்ஸ் மின் நுகர்வை வெற்றிகரமாக அடைகிறார்.",
      "போதுமான எம்.2 ஸ்லாட்டுகளைக் கொண்ட மதர்போர்டைக் கண்டுபிடிப்பதில் உள்ள சவால்கள் மற்றும் குறைந்த மின் நுகர்வுக்கு ஏஎம்டியை விட இன்டெல் சிப்செட்களுக்கான பரிந்துரைகள் விவாதிக்கப்படுகின்றன.",
      "இந்த கட்டுரை மதர்போர்டு, சிபியு, நினைவகம் மற்றும் சேமிப்பு கூறுகளின் விரிவான தேர்வுகள், குறைந்த மின் நுகர்வை அடைவதற்கான உதவிக்குறிப்புகள் மற்றும் மின் நுகர்வு மற்றும் எதிர்கால மேம்பாடுகளை அளவிடுவதற்கான பரிந்துரைகளை வழங்குகிறது."
    ],
    "commentSummary": [
      "கட்டுரை மற்றும் விவாதம் இன்டெல் அல்லது ஏஎம்டி செயலிகளைப் பயன்படுத்தி குறைந்த சக்தி சேவையகங்கள் / என்ஏஎஸ் அமைப்புகளின் கட்டுமானத்தைச் சுற்றி வருகிறது.",
      "வன்பொருள் உள்ளமைவுகள், விலை-செயல்திறன் விருப்பங்கள் மற்றும் மாற்றுகள் உள்ளிட்ட பல்வேறு அம்சங்கள் ஆராயப்படுகின்றன.",
      "ஈ.சி.சி ஆதரவு, டி.டி.ஆர் 5 நினைவகம், சினாலஜியின் டி.எஸ்.எம் இயக்க முறைமை மற்றும் பல்வேறு என்.ஏ.எஸ் அமைப்புகளின் நன்மை தீமைகள் போன்ற தலைப்புகளும் உள்ளடக்கப்படுகின்றன, பயனர்கள் ஆற்றல்-செயல்திறன் மற்றும் செலவு குறைந்த சேவையக உருவாக்கங்களுக்கான தங்கள் அனுபவங்களையும் விருப்பங்களையும் பகிர்ந்து கொள்கிறார்கள்."
    ],
    "points": 289,
    "commentCount": 151,
    "retryCount": 0,
    "time": 1704024652
  },
  {
    "id": 38828040,
    "title": "Bazzite: நீராவி டெக் மற்றும் பலவற்றிற்கான பல்துறை OCI படம், SteamOS சிக்கல்களைத் தீர்க்கிறது",
    "originLink": "https://github.com/ublue-os/bazzite",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38828040",
    "commentBody": "",
    "originSummary": [
      "பாசைட் என்பது ஒரு ஓசிஐ படமாகும், இது ஸ்டீம் டெக் மற்றும் பிற சாதனங்களுக்கான மாற்று இயக்க முறைமையை வழங்குகிறது, இது ஸ்டீம்ஓஎஸ் உடனான சிக்கல்களைத் தீர்க்கிறது.",
      "இது பல்வேறு அம்சங்கள் மற்றும் தனிப்பயனாக்க விருப்பங்கள், ஏஎம்டி ஜிபியூக்களுக்கான ஆதரவு மற்றும் சோர்ஸ் 1 எஞ்சின் கேம்களில் பிழைகளுக்கான திருத்தங்கள் ஆகியவற்றை உள்ளடக்கியது.",
      "பாசைட் வேலாண்டில் டிஸ்கார்ட் ஸ்கிரீன்ஷேரிங் ஆதரிக்கிறது, ஒரு வெபாப் மேலாளரை வழங்குகிறது, மேலும் டெஸ்க்டாப் கணினிகள் மற்றும் ஸ்டீம் டெக்கிற்கான வெவ்வேறு வகைகளைக் கொண்டுள்ளது. இது ஆவணங்கள் மற்றும் செய்திமடல்களைக் கொண்ட சமூகத்தால் இயக்கப்படும் திட்டமாகும், மேலும் பயனர்கள் தங்கள் சொந்த தனிப்பயன் பதிப்பை உருவாக்கலாம்."
    ],
    "commentSummary": [
      "இந்த இடுகை பாசைட், நிக்ஸ்ஓஎஸ், சிமெராஓஎஸ் மற்றும் ஸ்டீம்ஓஎஸ் உள்ளிட்ட பல்வேறு இயக்க முறைமைகளை ஆராய்கிறது, அவற்றின் நன்மைகளை முன்னிலைப்படுத்துகிறது.",
      "பி.டி.ஆர்.எஃப்.எஸ் கோப்பு அமைப்பு கேமிங் காட்சிகள் தொடர்பாக விவாதிக்கப்படுகிறது, ஆனால் வி.ஆருடன் பொருந்தக்கூடிய தன்மை, சில ஏமாற்று எதிர்ப்பு நடவடிக்கைகள் மற்றும் எபிக்கிலிருந்து விளையாட்டுகள் குறித்து வரம்புகள் குறிப்பிடப்பட்டுள்ளன.",
      "இந்த இடுகை சிமெராஓஎஸ் இன் வளர்ச்சி மற்றும் அம்சங்களையும் உள்ளடக்கியது, ஒரு ஊடக மையமாக அதன் திறனைப் பற்றி விவாதிக்கிறது. பாசைட் மற்றும் யுனிவர்சல் ப்ளூ ஆகியவை ஏஎம்டி, என்விடியா மற்றும் இன்டெல் ஆகியவற்றிற்கான திட்டங்களாகக் குறிப்பிடப்பட்டுள்ளன.",
      "ஸ்டீம் டெக்கிற்கான மாற்று இயக்க முறைமையாக பாசைட்டின் நிறுவல் மற்றும் செயல்பாடு விளக்கப்படுகிறது, வைன்சாபோஸுடன் ஒப்பிடப்படுகிறது.",
      "சேமிப்பக இடத்தைச் சேமிக்க பயனர் கே.டி.இ வகைகளைப் பயன்படுத்த பரிந்துரைக்கிறார் மற்றும் கே.டி.இ மற்றும் க்னோம் படங்களில் பிளாட்பாக்களின் எண்ணிக்கையை ஒப்பிடுவதற்கான இணைப்புகளை வழங்குகிறார்."
    ],
    "points": 281,
    "commentCount": 70,
    "retryCount": 0,
    "time": 1704061316
  },
  {
    "id": 38823817,
    "title": "மின்னஞ்சல் முகவரிகளை \"நிரந்தர\" கணக்கு ஐடிகளாகப் பயன்படுத்துதல்: ஒரு குறைபாடுள்ள அணுகுமுறை",
    "originLink": "https://utcc.utoronto.ca/~cks/space/blog/tech/EmailAddressesBadPermanentIDs",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38823817",
    "commentBody": "",
    "originSummary": [
      "பயனர் கணக்குகளுக்கான நிரந்தர அடையாளங்காட்டிகளாக மின்னஞ்சல் முகவரிகளின் நம்பகத்தன்மையை கிறிஸ் சீபென்மேன் சவால் செய்கிறார்.",
      "மின்னஞ்சல் முகவரிகள் நிறுவனங்களுக்குள் மாறக்கூடும் மற்றும் மீண்டும் பயன்படுத்தப்படலாம் அல்லது மறுஒதுக்கீடு செய்யப்படலாம், இதனால் அவை நீண்டகால அடையாளத்திற்கு நம்பகத்தன்மையற்றவை.",
      "கணக்கு மீட்பு நோக்கங்களுக்காக மின்னஞ்சல் முகவரிகள் பயன்படுத்தப்பட்டாலும், கணக்கு அடையாளத்திற்கு தனித்துவமான மற்றும் அர்த்தமற்ற உள் ஐடிகளைப் பயன்படுத்த சீபென்மேன் பரிந்துரைக்கிறார்."
    ],
    "commentSummary": [
      "ஆன்லைன் கணக்குகளுக்கான நீண்டகால அடையாளங்காட்டிகளாக மின்னஞ்சல் முகவரிகளைப் பயன்படுத்துவதன் வரம்புகள் மற்றும் குறைபாடுகளை கட்டுரை எடுத்துக்காட்டுகிறது.",
      "இது பாலியல் குற்றவாளி பதிவேடுகளின் சவால்கள் மற்றும் குறைபாடுகள் மற்றும் அமெரிக்க நீதி அமைப்பில் பாலியல் குற்றவாளிகளின் வகைப்பாடு மற்றும் தண்டனை குறித்து விவாதிக்கிறது.",
      "இந்த உரையாடல் பாதுகாப்பான அடையாள சேவைகளின் முக்கியத்துவத்தையும் டிஜிட்டல் அடையாளங்களை நிர்வகிப்பதில் உள்ள சிரமங்களையும் ஆராய்கிறது. அடையாள சரிபார்ப்புக்கு பிளாக்செயின் தொழில்நுட்பத்தின் சாத்தியமான பயன்பாட்டையும் இது குறிப்பிடுகிறது, ஆன்லைன் அடையாளங்களை நிர்வகிப்பதில் பாதுகாப்பான மற்றும் நம்பகமான தீர்வுகளின் அவசியத்தை வலியுறுத்துகிறது."
    ],
    "points": 264,
    "commentCount": 382,
    "retryCount": 0,
    "time": 1704028380
  },
  {
    "id": 38825623,
    "title": "ப்ளூஸ்கி இயங்குதள புதுப்பிப்பில் ஸ்டைலிங் விதிகள் அடங்கும், ஆனால் சோனி மென்பொருள் புதுப்பிப்பு தியேட்டர் ப்ரொஜெக்டர் சிக்கல்களை ஏற்படுத்துகிறது",
    "originLink": "https://bsky.app/profile/donohoe.dev/post/3khu7w2kz7l2b",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38825623",
    "commentBody": "",
    "originSummary": [
      "@donohoe.dev ப்ளூஸ்கி இயங்குதளத்தில் மாற்றங்களைச் செய்தார், எதிர்வினை-நேட்டிவ்-வலை மீட்டமைப்பை நீட்டிப்பதில் கவனம் செலுத்தினார்.",
      "இந்த மாற்றங்களில் சிஎஸ்எஸ் ஸ்டைலிங் விதிகள், வண்ண தீமிங் மற்றும் வெவ்வேறு கூறுகளுக்கான கூடுதல் ஸ்டைலிங் ஹேக்குகள் ஆகியவை அடங்கும்.",
      "ப்ரொஜெக்டர்களுக்கான மென்பொருள் புதுப்பிப்பு சம்பந்தப்பட்ட ஒரு சம்பவத்தின் விளைவாக அலமோ டிராஃப்ட்ஹவுஸில் அனைத்து திரைப்படங்களும் ரத்து செய்யப்பட்டன, இது மற்ற திரையரங்குகளில் ஏற்படக்கூடிய தாக்கங்களை எடுத்துக்காட்டுகிறது."
    ],
    "commentSummary": [
      "காலாவதியான குறியாக்க சான்றிதழ் காரணமாக சோனி மென்பொருள் புதுப்பிப்புகள் மூவி தியேட்டர் ப்ரொஜெக்டர்களில் செயலிழப்புக்கு வழிவகுத்தன.",
      "இந்த நிலைமை பதிப்புரிமை, டிஆர்எம் மற்றும் புதுப்பிப்பு தொடர்பான செயலிழப்புகளுக்கான உற்பத்தியாளர்களின் பொறுப்பு குறித்து கேள்விகளை எழுப்புகிறது.",
      "மென்பொருள் புதுப்பிப்புகளின் குறைபாடுகள், பயனர் ஒப்புதலின் முக்கியத்துவம் மற்றும் செயல்பாட்டை இழப்பது அல்லது முன்பு இலவச அம்சங்களுக்கு பணம் செலுத்துவது குறித்த கவலைகள் குறித்தும் விவாதம் ஆராய்கிறது."
    ],
    "points": 214,
    "commentCount": 108,
    "retryCount": 0,
    "time": 1704043251
  },
  {
    "id": 38823673,
    "title": "பன் அறிமுகம்: டெயில் கால் ஆப்டிமைசேஷன் (டி.சி.ஓ) உடன் ஒரு வேகமான ஜாவாஸ்கிரிப்ட் ரன்டைம்",
    "originLink": "https://www.onsclom.net/posts/javascript-tco",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38823673",
    "commentBody": "",
    "originSummary": [
      "பன் என்பது ஒரு புதிய ஜாவாஸ்கிரிப்ட் ரன்டைம் ஆகும், இது அதன் வேகத்திற்கு பெயர் பெற்றது மற்றும் வி 8 இல் கட்டப்பட்ட நோட் மற்றும் டெனோவைப் போலல்லாமல் ஜாவாஸ்கிரிப்ட்கோரில் கட்டப்பட்டுள்ளது.",
      "ஜாவாஸ்கிரிப்ட்கோர் டெயில் கால் ஆப்டிமைசேஷன் (டி.சி.ஓ) எனப்படும் ஒரு முக்கிய தேர்வுமுறை அம்சத்தைக் கொண்டுள்ளது, இது அழைப்பு அடுக்கைத் தாண்டாமல் மீண்டும் வர அனுமதிக்கிறது.",
      "செயல்பாடுகளை மாற்றி எழுதுவதன் மூலமும், வாதங்களுக்கு நிலையை நகர்த்துவதன் மூலமும் டி.சி.ஓ பன்னில் செயல்படுத்தப்படலாம் என்றாலும், பன்னில் உள்ள டி.சி.ஓ தீர்வு லூப் தீர்வுக்கான அசல் விட மெதுவாக உள்ளது. இருப்பினும், பிறழ்வைப் பயன்படுத்துவது ஒரு மறுசீரமைப்பு தீர்வில் இதேபோன்ற செயல்திறனை அடைய முடியும்.",
      "டி.சி.ஓ நிரலாளர்களுக்கு சிக்கலான மற்றும் திறமையான நிரல்களை கட்டாய வளையங்களை நம்பாமல் வெளிப்படுத்த உதவுகிறது."
    ],
    "commentSummary": [
      "விவாதம் ஜாவாஸ்கிரிப்டில் ரிகர்ஷன் மற்றும் டெயில் கால் ஆப்டிமைசேஷன் பயன்பாடு மற்றும் செயல்பாட்டு நிரலாக்கத்தின் நன்மை தீமைகள் ஆகியவற்றில் கவனம் செலுத்துகிறது.",
      "கருத்துரையாளர்கள் வெவ்வேறு குறியீடு எடுத்துக்காட்டுகளின் செயல்திறன் மற்றும் வாசிப்புத்திறன் மற்றும் பல்வேறு நிரலாக்க மொழிகள் மற்றும் உலாவிகளில் டெயில் கால் தேர்வுமுறையை செயல்படுத்துவது பற்றி விவாதிக்கின்றனர்.",
      "செயல்பாட்டு நிரலாக்கத்திற்கு சிறப்பாக பொருத்தப்பட்ட எல்ம் மற்றும் ரீசன்எம்எல் போன்ற மாற்று மொழிகளையும் உரையாடல் குறிப்பிடுகிறது."
    ],
    "points": 163,
    "commentCount": 141,
    "retryCount": 0,
    "time": 1704026439
  },
  {
    "id": 38823304,
    "title": "மீண்டும் கண்டுபிடிக்கப்பட்ட கரோலினா ஆப்பிரிக்க ரன்னர் வேர்க்கடலை விவசாயிகள் மற்றும் சமையல்காரர்களுக்கு உற்சாகத்தை அளிக்கிறது",
    "originLink": "https://nationalpeanutboard.org/news/a-1690s-peanut-is-reborn/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38823304",
    "commentBody": "",
    "originSummary": [
      "முன்னர் அழிந்துவிட்டதாகக் கருதப்பட்ட கரோலினா ஆப்பிரிக்க ரன்னர் வேர்க்கடலை மீண்டும் கண்டுபிடிக்கப்பட்டு இப்போது விவசாயிகள் மற்றும் சமையல்காரர்களால் பயிரிடப்படுகிறது.",
      "1690 ஆம் ஆண்டில் அமெரிக்க காலனிகளுக்கு கொண்டு வரப்பட்ட வேர்க்கடலை சிறியது, இனிமையானது மற்றும் நவீன வேர்க்கடலையை விட அதிக எண்ணெய் உள்ளடக்கத்தைக் கொண்டுள்ளது.",
      "ஆராய்ச்சியாளர்கள் ஒரு இனப்பெருக்க வசதியிலிருந்து விதைகளைப் பெற்று ஒரு வணிகப் பயிரை வெற்றிகரமாக வளர்த்தனர், இது கரோலினா ஆப்பிரிக்க வேர்க்கடலையை வளர்ப்பதற்கும் பயன்படுத்துவதற்கும் ஆர்வமுள்ள விவசாயிகள் மற்றும் கைவினைஞர் உணவு நிறுவனங்களுக்கு சாத்தியமான சந்தை வாய்ப்புகளுக்கு வழிவகுத்தது."
    ],
    "commentSummary": [
      "இந்த கட்டுரை கரோலினா கோல்ட் ரைஸ் பாரம்பரிய உணவு வகைகள் என்று அழைக்கப்படும் 1690 களில் இருந்து வேர்க்கடலை வகையின் மறுமலர்ச்சியை ஆராய்கிறது.",
      "இது அமெரிக்காவில் வேர்க்கடலை வளர்ப்பதில் எதிர்கொள்ளும் சிரமங்கள் மற்றும் சிறிய வேர்க்கடலையைக் கையாள்வதற்கான தீர்வுக்கான விருப்பத்தை ஆராய்கிறது.",
      "பாரம்பரிய தக்காளிகளில் சுவைகளின் மாறுபாடு மற்றும் உள்நாட்டில் வளர்க்கப்படும் பொருட்களுக்கான விருப்பம் ஆகியவையும் விவாதிக்கப்படுகின்றன."
    ],
    "points": 158,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1704022105
  },
  {
    "id": 38823482,
    "title": "ஸ்வீடனின் கண்கவர் சூரிய குடும்ப மாதிரி",
    "originLink": "https://en.wikipedia.org/wiki/Sweden_Solar_System",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38823482",
    "commentBody": "",
    "originSummary": [
      "சுவீடன் சூரியக் குடும்பம் என்பது சுவீடனில் அமைந்துள்ள சூரியக் குடும்பத்தின் அளவுகோல் மாதிரியாகும்.",
      "இது சூரியன், கோள்கள், நிலவுகள், குள்ள கிரகங்கள் மற்றும் பிற வான்பொருட்களின் பிரதிநிதித்துவங்களை உள்ளடக்கியது.",
      "இந்த மாதிரி சூரிய குடும்பத்தில் உள்ள அளவு மற்றும் தூரங்களை சித்தரிக்க ஸ்வீடனின் பல்வேறு இடங்களில் பரவியுள்ளது.",
      "இது ஒரு கல்வி கருவியாகவும், பிரபலமான சுற்றுலா ஈர்ப்பாகவும் செயல்படுகிறது."
    ],
    "commentSummary": [
      "ஸ்வீடன் சூரியக் குடும்பம் ஸ்வீடனில் சூரியக் குடும்பத்தின் அளவுகோல் மாதிரியாக விவாதிக்கப்படுகிறது.",
      "நடக்கக்கூடிய ஒன்று உட்பட பல்வேறு மாதிரிகள் விவாதிக்கப்படுகின்றன.",
      "பங்கேற்பாளர்கள் உலகெங்கிலும் இதேபோன்ற மாதிரிகளைப் பற்றிய தகவல்களைப் பகிர்ந்து கொள்கிறார்கள், மேலும் விண்வெளியைப் பற்றி கற்பிப்பதற்கான அவற்றின் துல்லியம் மற்றும் பயன்பாடு விவாதிக்கப்படுகிறது."
    ],
    "points": 150,
    "commentCount": 43,
    "retryCount": 0,
    "time": 1704024263
  },
  {
    "id": 38826187,
    "title": "ஏஎம்டியின் விண்டேஜ் லான்ஸ் ஈத்தர்நெட் சிப்பின் உள்ளே: சுற்று மற்றும் உற்பத்தியை ஆராய்தல்",
    "originLink": "https://www.righto.com/2023/12/amd-lance-ethernet-double-poly.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38826187",
    "commentBody": "",
    "originSummary": [
      "வலைப்பதிவு இடுகை 1982 முதல் ஒரு விண்டேஜ் ஈத்தர்நெட் சிப்பை ஆராய்கிறது மற்றும் அதன் சுற்றுகள், சேமிப்பு முறைகள் மற்றும் உற்பத்தி நடைமுறைகளை ஆராய்கிறது.",
      "இது லாச் சர்க்யூட்டுகள் மற்றும் சிப்பில் நிலையான ரேம் ஆகியவற்றை ஆராய்கிறது, இது தொழில்நுட்பத்தின் உள் செயல்பாடுகளில் வெளிச்சம் பாய்ச்சுகிறது.",
      "இந்த கட்டுரை சிப்பின் டிரான்சிஸ்டர் கட்டுமானம் குறித்த நுண்ணறிவுகளையும் வெளிப்படுத்துகிறது, அத்துடன் தொடர்புடைய இரண்டு காப்புரிமைகளையும் குறிப்பிடுகிறது."
    ],
    "commentSummary": [
      "இந்த கட்டுரை ஏஎம்டியின் விண்டேஜ் லான்ஸ் ஈதர்நெட் சிப்பில் இரட்டை-பாலி லாச்சுகளின் கண்டுபிடிப்பை எடுத்துக்காட்டுகிறது.",
      "அவர்களின் கண்டுபிடிப்புகளின் அடிப்படையில் சிப்பின் தனித்துவமான அம்சங்களை ஆசிரியர் ஆராய்கிறார்.",
      "வாசகர் கருத்துக்கள் கட்டுரைக்கான பாராட்டை வெளிப்படுத்துகின்றன மற்றும் சிப்புடன் தனிப்பட்ட அனுபவங்களைப் பகிர்ந்து கொள்கின்றன."
    ],
    "points": 135,
    "commentCount": 9,
    "retryCount": 0,
    "time": 1704046855
  },
  {
    "id": 38828804,
    "title": "ஹார்வர்டு ஹானர் கவுன்சில் உறுப்பினர் கருத்து திருட்டு விவகாரத்தில் அதிபர் கே பதவி விலக வேண்டும்",
    "originLink": "https://www.thecrimson.com/article/2023/12/31/honor-council-member-gay/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38828804",
    "commentBody": "",
    "originSummary": [
      "ஹார்வர்டு கல்லூரி ஹானர் கவுன்சிலின் பெயர் குறிப்பிட விரும்பாத உறுப்பினர் ஒருவர், அதிபர் கிளாடின் கேயை விமர்சித்து, அவர் பதவி விலகக் கோரி ஒரு கட்டுரை எழுதியுள்ளார்.",
      "ஹானர் கவுன்சிலின் நடைமுறைகள் மற்றும் தடைகளை ஆதாரமாக மேற்கோள் காட்டி, திருட்டு குற்றம் சாட்டப்பட்ட மாணவர்களை பல்கலைக்கழகம் நடத்துவது ஜனாதிபதியை நடத்துவதை விட கடுமையானது என்று ஆசிரியர் வாதிடுகிறார்.",
      "ஹார்வர்ட் கார்ப்பரேஷன் அவர்கள் இரட்டை நிலைப்பாடு என்று கருதுவதை நிவர்த்தி செய்வதற்காக ஜனாதிபதி கே பதவி விலகக் கோர வேண்டும் என்று ஆசிரியர் அழைக்கிறார்."
    ],
    "commentSummary": [
      "ஹார்வர்டு பல்கலைக்கழகத்தின் தலைவருக்கு எதிரான குற்றச்சாட்டுகள் உட்பட கல்வித்துறையில் திருட்டு வழக்குகள் குறித்து இந்த கட்டுரை விவாதிக்கிறது.",
      "திருட்டுத்தனம், அதன் தீவிரம் மற்றும் திருட்டு குற்றம் சாட்டப்பட்ட நபர்களுக்கான விளைவுகள் குறித்த வெவ்வேறு கண்ணோட்டங்கள் ஆராயப்படுகின்றன.",
      "வெறுப்பு பேச்சு, பேச்சு சுதந்திரம் மற்றும் இஸ்ரேல் மற்றும் யூத மதம் தொடர்பான சொற்றொடர்களின் விளக்கம் போன்ற தலைப்புகளையும் இந்த விவாதம் தொடுகிறது."
    ],
    "points": 113,
    "commentCount": 55,
    "retryCount": 0,
    "time": 1704070238
  },
  {
    "id": 38826130,
    "title": "இரண்டாம் உலகப் போரின் நாயகனின் மகள் சாதனை படைத்தார்: தந்தையின் வீரத்தை வெளிப்படுத்துகிறார்",
    "originLink": "https://www.dispatch.com/story/news/local/2023/12/31/bazooka-charlies-granville-daughter-shares-wwii-heroics-in-new-book/72033226007/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38826130",
    "commentBody": "",
    "originSummary": [
      "\"பஜூகா சார்லி\" என்று அழைக்கப்படும் இரண்டாம் உலகப் போரின் நாயகன் மேஜர் சார்லஸ் கார்பெண்டரின் மகள், போரின் போது தனது தந்தையின் வீர நடவடிக்கைகளை ஆதரிப்பதற்கான சான்றுகளை கடிதங்கள், புகைப்படங்கள் மற்றும் ஆவணங்கள் மூலம் வழங்குகிறார்.",
      "அவரது கதை ஒரு ஓய்வு பெற்ற இயந்திர பொறியாளரின் கவனத்தை ஈர்க்கிறது, அவர் ஒரு புத்தகத்தை எழுத ஊக்குவிக்கிறார், இது இப்போது ஒரு அருங்காட்சியகத்தில் காட்சிக்கு வைக்கப்பட்டுள்ள அவரது தந்தையின் விமானத்தை மீட்கவும் மீட்டெடுக்கவும் வழிவகுக்கிறது.",
      "இந்த புத்தகம் தனது தந்தையின் ஆரோக்கியத்தில் போரின் தாக்கத்தையும், அவரது தாயின் தியாகங்களையும் ஆராய்கிறது, மேலும் அவரது குடும்பத்தின் கதையை வெளிப்படையாக பகிர்ந்து கொண்டதற்காக முன்னாள் வீரர்களின் பாராட்டைப் பெறுகிறது."
    ],
    "commentSummary": [
      "இரண்டாம் உலகப் போரின் ஹீரோவான \"பஜூகா சார்லியின்\" மகள், தனது தந்தையின் வீரச் செயல்கள் கேள்விக்குள்ளாக்கப்பட்ட பின்னர் அவற்றை நியாயப்படுத்துகிறார்.",
      "அசாதாரணமான போர்க்கால சாதனைகளை உறுதிப்படுத்துவதில் சாட்சி சாட்சியங்கள் மற்றும் சான்றுகளின் முக்கியத்துவத்தை இக்கதை வலியுறுத்துகிறது.",
      "விமானங்களில் துப்பாக்கி கேமராக்கள், எதிரி கப்பல் மூழ்குவதை சரிபார்ப்பதில் டைவர்ஸின் பங்கு மற்றும் பி.டி.எஸ்.டி.யைக் கையாளும் போர் வீரர்களின் அனுபவங்கள் போன்ற தலைப்புகளையும் இந்த விவாதம் உள்ளடக்கியது."
    ],
    "points": 112,
    "commentCount": 24,
    "retryCount": 0,
    "time": 1704046396
  },
  {
    "id": 38825520,
    "title": "ஒரு சிறிய சமூக வலைப்பின்னலை எவ்வாறு உருவாக்குவது: சமூகம் மற்றும் பயனர் கட்டுப்பாட்டை வலியுறுத்துதல்",
    "originLink": "https://runyourown.social/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38825520",
    "commentBody": "",
    "originSummary": [
      "ஒரு சிறிய சமூக வலைப்பின்னல் தளத்தை இயக்குவது சமூக உருவாக்கம் மற்றும் பயனர் கட்டுப்பாடு போன்ற நன்மைகளை வழங்குகிறது.",
      "திறந்த மூல மென்பொருள் மற்றும் வடிவமைக்கப்பட்ட ஆன்லைன் சூழல்கள் சிறிய சமூக வலைப்பின்னல்களுக்கு நன்மை பயக்கும்.",
      "ஒரு சிறிய சமூக வலைப்பின்னலை இயக்க மாஸ்டோடன் மற்றும் டால்பின் டவுன் போன்ற தளங்கள் பரிந்துரைக்கப்படுகின்றன.",
      "ஒரு சிறிய சமூகத்தை நிர்வகிப்பது சவால்கள் மற்றும் பொறுப்புகளுடன் வருகிறது, ஆனால் நேர்மறையான பயனர் அனுபவத்தை பராமரிப்பது முக்கியம்.",
      "நடத்தை விதிகளை செயல்படுத்துவது முக்கியம், மேலும் சமூக வலைப்பின்னல் தளங்களில் தொழில்நுட்ப மேம்பாடுகள் தேவை.",
      "சமூக வலைப்பின்னல்களில் \"அக்கம்பக்கங்கள்\" என்ற கருத்து மேம்பட்ட பயனர் அனுபவங்களுக்காக முன்மொழியப்படுகிறது.",
      "சமூக வலைப்பின்னல்களின் எதிர்காலம் விவாதிக்கப்படுகிறது, மற்றவர்களின் பங்களிப்புகளை ஏற்றுக்கொள்கிறது.",
      "ஆசிரியர் அவர்களின் சொந்த இணைப்புகள் மற்றும் உரிமத் தகவல்களை வழங்குகிறார்.",
      "குறிப்பு: இந்த இடுகை ஒரு சிறிய சமூக வலைப்பின்னலை இயக்குவதற்கான நன்மைகள், சவால்கள் மற்றும் பரிந்துரைகளைப் பற்றி விவாதிக்கிறது. இது சமூக மேலாண்மை, நடத்தை விதிகள் மற்றும் சமூக வலைப்பின்னல் தளங்களில் தொழில்நுட்ப மேம்பாடுகளின் முக்கியத்துவத்தையும் எடுத்துக்காட்டுகிறது. சமூக வலைப்பின்னல்களில் \"அக்கம்பக்கங்கள்\" என்ற கருத்தாக்கம் ஆசிரியரால் முன்மொழியப்பட்ட ஒரு புதிய மற்றும் உற்சாகமான யோசனையாகும்."
    ],
    "commentSummary": [
      "பிரபலமான வலைத்தளமான ஹேக்கர் நியூஸ் தற்போது தொழில்நுட்ப சிக்கல்களை எதிர்கொள்கிறது, இது பயனர் கோரிக்கைகளுக்கு மெதுவான பதில் நேரங்களை ஏற்படுத்துகிறது.",
      "வலைத்தளத்தை அணுக முயற்சிக்கும்போது அல்லது அதன் அம்சங்களுடன் தொடர்பு கொள்ளும்போது பயனர்கள் தாமதங்கள் அல்லது சிரமங்களை அனுபவிக்கலாம்.",
      "தொழில்நுட்ப சிக்கல்கள் எப்போது தீர்க்கப்படும் என்பது தெளிவாகத் தெரியவில்லை, ஆனால் வலைத்தளத்தின் குழு சிக்கலை நிவர்த்தி செய்ய வேலை செய்ய வாய்ப்புள்ளது."
    ],
    "points": 111,
    "commentCount": 104,
    "retryCount": 0,
    "time": 1704042493
  }
]
