[
  {
    "id": 40160429,
    "title": "FCC, Yasal Zorlukların Ortasında Ağ Tarafsızlığı Kurallarını Geri Getirdi",
    "originLink": "https://www.nytimes.com/2024/04/25/technology/fcc-net-neutrality-open-internet.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40160429",
    "commentBody": "",
    "originSummary": [
      "Federal İletişim Komisyonu, internet sağlayıcılarının rakiplerinin hizmetlerini engellemesini veya yavaşlatmasını engellemek için ağ tarafsızlığı kurallarını yeniden yürürlüğe koyma kararı aldı.",
      "Hükümetin genişbant şirketleri üzerindeki kontrolünü yenileyen bu karar, muhtemelen sektörün yasal mücadelesine yol açacak.",
      "İlk olarak Obama döneminde uygulamaya konulan kurallar, Trump yönetimi döneminde hurdaya çıkarıldı ve şimdi hem destek hem de eleştiriler alarak özgür internet konusunda yeniden tartışmalara yol açıyor."
    ],
    "commentSummary": [
      "Tartışma, FCC tarafından ağ tarafsızlığı kurallarının yeniden düzenlenmesini ve İSS uyum yükü, hükümet düzenlemesi ve ağ tarafsızlığı yasalarının toplumsal etkileri üzerine tartışmaları içeriyor.",
      "Siyasi dinamikler, tekeller, özgürlükçülük ve politika yapımında devlet kurumları üzerine çeşitli perspektifler, ISP uygulamaları ve yürürlükten kaldırmanın sonuçlarına ilişkin endişelerle birlikte incelenmektedir.",
      "Diyalog, Cumhuriyetçi partiye yönelik eleştirilere, yasama karar alma süreçlerine, siyasi söylem üzerindeki kutuplaşma etkilerine, medya etkisine ve marjinal gruplar ile sosyal ilerleme üzerindeki etkisine değiniyor."
    ],
    "points": 826,
    "commentCount": 460,
    "retryCount": 0,
    "time": 1714065780
  },
  {
    "id": 40163405,
    "title": "Microsoft ve IBM Açık Kaynak DOS 4.0 için İşbirliği Yapıyor",
    "originLink": "https://www.hanselman.com/blog/open-sourcing-dos-4",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40163405",
    "commentBody": "",
    "originSummary": [
      "Microsoft, IBM'in işbirliğiyle MS-DOS 4.00'ın kaynak kodunu beta ikili dosyalar, belgeler ve disk görüntüleri içeren MIT lisansı altında açıkladı.",
      "Önemli bir tarihi parça olan MS-DOS 4.00'ın 8086 montaj kodu, eski Microsoft CTO'su Ray Ozzie ile yapılan bir görüşmenin ardından açık inovasyonu teşvik etmek için paylaşıldı.",
      "Kaynak koduna GitHub üzerinden erişilebilmekte ve kullanıcıların bu kodu gerçek donanım veya emülatörler üzerinde çalıştırabilmelerine olanak sağlamaktadır."
    ],
    "commentSummary": [
      "GitHub kullanıcıları nostaljik bir şekilde eski MS-DOS sürümlerini tartışıyor ve bir hex editörü ile yazılım hackleme anılarını paylaşıyor.",
      "Sohbet, MS-DOS gibi eski yazılımların açık kaynak kullanımı, programlamada terminoloji değişiklikleri ve dilin hassasiyeti konularına değiniyor.",
      "Microsoft'un GitHub'da, Çoklu Görev MS-DOS beta dahil olmak üzere geçmiş MS-DOS dosyalarını yayınlamak ve kaldırmak da dahil olmak üzere son eylemleri vurgulanmakta ve tartışılmaktadır."
    ],
    "points": 542,
    "commentCount": 206,
    "retryCount": 0,
    "time": 1714081326
  },
  {
    "id": 40156330,
    "title": "Canvas-Confetti ile Konfeti Animasyonlarını Özelleştirme",
    "originLink": "https://github.com/catdad/canvas-confetti",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40156330",
    "commentBody": "",
    "originSummary": [
      "Canvas-confetti modülü, web sayfalarında hız, yerçekimi, şekiller ve renkler gibi ayarlanabilir parametreler sunan özelleştirilmiş konfeti animasyonları sağlar.",
      "Kullanıcılar matris değerlerini önbelleğe alarak performansı artırabilir, hareketi devre dışı bırakabilir, özel şekiller oluşturabilir, tuvali yeniden boyutlandırabilir, web çalışanlarından yararlanabilir ve animasyonları durdurabilir/silebilir.",
      "Modülde çeşitli konfeti animasyonları oluşturma, bunları farklı yöntemlerle başlatma ve çeşitli yönlerden sürekli animasyonlar sürdürme örnekleri gösterilmektedir."
    ],
    "commentSummary": [
      "Tartışma, tuval kullanan ve işaretçi olaylarını devre dışı bırakan yüksek performanslı animasyonlar geliştirmek için GitHub'daki ön uç konfeti animasyon kütüphanelerinin kullanımını araştırıyor.",
      "Kullanıcılar, çeşitli uygulamalardaki konfeti animasyonlarına ilişkin kişisel anekdotlar ve içgörüler paylaşarak bunların etkinliği hakkında farklı görüşler ifade etmektedir.",
      "Konfetinin tarihi, şenliklerdeki rolü ve hatta simüle edilmiş bir ortamda yaşama kavramının tartışıldığı sohbette, teknik uygulama, JavaScript'in gizlilik etkileri ve web animasyonları için alternatif yöntemler de ele alınıyor."
    ],
    "points": 443,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1714045984
  },
  {
    "id": 40156275,
    "title": "TSMC Arka Tarafta Güç Dağıtımı ile A16 1.6nm Teknolojisini Tanıttı",
    "originLink": "https://www.tomshardware.com/tech-industry/tsmc-unveils-16nm-process-technology-with-backside-power-delivery-rivals-intels-competing-design",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40156275",
    "commentBody": "",
    "originSummary": [
      "TSMC, arka taraf güç dağıtım ağı (BSPDN) ve kapı etrafı (GAA) nanosheet transistörleri içeren gelişmiş 1.6nm sınıfı süreç teknolojisi A16'yı tanıttı.",
      "A16, Intel'in 14A node'una rakip olacak şekilde, öncülüne kıyasla gelişmiş performans, verimlilik, güç tüketimi ve transistör yoğunluğuna sahiptir.",
      "BSPDN'nin, özellikle de Süper Güç Rayı'nın (SPR) A16'ya eklenmesi karmaşıklığını artırsa da yapay zeka ve HPC işlemcileri için önemli avantajlar sağlamaktadır."
    ],
    "commentSummary": [
      "TSMC, arka taraf güç dağıtımına sahip son teknoloji 1.6nm sürecini tanıtırken, Intel 1.4nm süreci için DSA teknolojisini kullanarak sektörün performans odaklı odağını vurguladı.",
      "Tartışmalarda yarı iletken üretim üstünlüğü, transistör yoğunluğu, çip tasarım optimizasyonu ve EUV litografi teknolojisinin engelleri gibi konular ele alınıyor.",
      "Yapay zeka/HPC işlemcilerindeki ilerlemeler, geçiş yolları, üretimde tungsten kullanımı ve silikon teknolojisindeki karmaşıklıklar da yarı iletken sektöründe devam eden evrimi ve zorlukları vurgulayan konuşmanın kilit noktalarıdır."
    ],
    "points": 360,
    "commentCount": 178,
    "retryCount": 0,
    "time": 1714045656
  },
  {
    "id": 40159278,
    "title": "NAND: Kendin Yap Teknoloji Meraklıları için Web Tabanlı Programlanabilir Bilgisayar",
    "originLink": "https://github.com/ArhanChaudhary/NAND",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40159278",
    "commentBody": "",
    "originSummary": [
      "Yaratıcı, özel bir çalışma zamanı, kullanıcı arayüzü (UI) ve Entegre Geliştirme Ortamı (IDE) içeren Nand to Tetris kursunun web tabanlı bir uyarlamasını sunan kişisel bir proje olan NAND'ı tanıtıyor.",
      "Kullanıcılar NAND'ın simüle edilmiş donanımı üzerinde 2048 ve genetik algoritma gibi programları deneyebilirler.",
      "Projenin web sitesinde ve GitHub deposunda daha fazla ayrıntı mevcuttur."
    ],
    "commentSummary": [
      "Kullanıcılar, Nand to Tetris dersinden etkilenerek NAND kapılarını kullanarak NAND adında programlanabilir bir bilgisayar oluşturmayı tartışıyor.",
      "Konuşma, yalnızca NAND kapılarıyla fiziksel bir bilgisayar oluşturmayı, mikro kodlanmış bir RISC işlemci tasarlamayı, NAND kapılarından saatler oluşturmayı, bilgisayarlarda sonlu belleğin önemini ve mantık devrelerindeki NOR kapılarını içermektedir.",
      "Katılımcılar nand2tetris.org ve nandgame.com'daki öğrenme deneyimlerini paylaşarak mantık kapılarından bilgisayarlar inşa etmeye ilgi duyduklarını ifade ettiler."
    ],
    "points": 318,
    "commentCount": 51,
    "retryCount": 0,
    "time": 1714061285
  },
  {
    "id": 40161697,
    "title": "Sıfırdan Kablosuz İnternet Hizmet Sağlayıcısı (WISP) Kurmak",
    "originLink": "https://startyourownisp.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40161697",
    "commentBody": "",
    "originSummary": [
      "Web sitesi, bireylerin Kablosuz İnternet Hizmet Sağlayıcılarını (WISP) kurmalarına yardımcı olmaya odaklanmakta ve bir WISP'nin kurulması ve yönetilmesi için ayrıntılı, adım adım bir kılavuz sunmaktadır.",
      "Maliyetler, terminoloji, altyapı, pazarlama ve bakım gibi çeşitli konularda kaynakların yanı sıra backhauls, RF temelleri, MDU'lar ve ağ planlaması için Google Earth kullanımı gibi konularda araçlar ve kılavuzlar sağlar.",
      "Kullanıcılar ayrıca kişiselleştirilmiş yardımdan faydalanabilir, topluluk tartışmalarına katılabilir, web seminerlerine katılabilir ve siteyi sürdürmek için bağışta bulunabilirler."
    ],
    "commentSummary": [
      "Yazı, Jared Mauch'un bir fiber İSS ile elde ettiği başarılara atıfta bulunarak bağımsız bir internet servis sağlayıcısı kurmanın fizibilitesini araştırıyor.",
      "Ağ altyapısı için Mikrotik, Ubiquiti, Edgecore ve Nokia gibi şirketlerin ekipmanlarını kullanan küçük WISP'ler ile Starlink gibi büyük oyuncular arasındaki rekabeti tartışıyor.",
      "Kullanıcılar Starlink, 5G ve Yeni Zelanda'da Sabit Kablosuz Erişim için 4G'nin başarısı gibi farklı sağlayıcılarla deneyimlerini paylaşıyor, çeşitli bölgelerdeki zorlukları ve Starlink'in geleneksel kablo ve fiber İSS'lere kıyasla sürdürülebilirliği ve maliyet etkinliği ile ilgili endişeleri vurguluyor."
    ],
    "points": 316,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1714072018
  },
  {
    "id": 40156534,
    "title": "Tribler: Medyada Devrim Yaratan Dirençli Bir Mikro-Ekonomi",
    "originLink": "https://github.com/Tribler/tribler/wiki",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40156534",
    "commentBody": "",
    "originSummary": [
      "Tribler, Delft Teknoloji Üniversitesi'nden gizlilik odaklı Bittorrent uyumlu bir platformdur ve bankalar veya reklamcılar olmadan bir mikro ekonomiyi teşvik eder.",
      "100'den fazla geliştiricisi olan Tribler, Bittorrent protokolünü, P2P iletişimini sürekli olarak geliştirmekte ve sanatçıların finansal ödülleri için bir token ekonomisi sunmaktadır.",
      "Benzersiz bir blok zinciri olan Trustchain, anonimlik özelliklerini vurgulayarak ve güvenli bir ortam ve yenilikçi kapitalizm modelleri için yeni bir kaplama sistemine geçiş yaparak Bittorrent tohumlamayı teşvik ediyor."
    ],
    "commentSummary": [
      "Tribler, dijital medya alanındaki yaratıcı tazminatı sorunlarını ele almak için eşiklere dayalı bir \"medya ekonomisi\" öneriyor ve ademi merkeziyetçilik, güven ve kâr amacı gütmeyen akademik ilkeleri vurguluyor.",
      "Tartışmalar kripto paranın rolü, dijital eşitsizlik endişeleri ve Tribler'ın platformundaki reklam modelinin potansiyel çöküşünü içeriyor.",
      "Şifreleme, protokoller ve izinsiz içerik paylaşımı ile ilgili yasal engeller, Tribler'ın büyük oyuncuların tekelinde olan içerik endüstrisini yeniden şekillendirmesinde zorluklar oluşturmaktadır."
    ],
    "points": 263,
    "commentCount": 107,
    "retryCount": 0,
    "time": 1714047231
  },
  {
    "id": 40161794,
    "title": "API Tasarımında Gerçek Dünya Olaylarına Verilen Önem Artıyor",
    "originLink": "https://increase.com/articles/no-abstractions",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40161794",
    "commentBody": "",
    "originSummary": [
      "Increase'in API tasarım ilkesi \"Soyutlama Yok\", API kaynaklarının gerçek dünya olaylarından sonra adlandırılmasını, ağ terminolojisinden yararlanılmasını ve kaynakların belirli kullanım durumlarına göre kategorize edilmesini savunur.",
      "Stripe'tan etkilenen bu strateji, Increase'in ödeme ağlarına aşina olan kullanıcılarını hedefliyor, kolaylaştırılmış entegrasyon ve şeffaf bir sistem eşlemesi için kaynak değişmezliğine ve net adlandırmaya öncelik veriyor.",
      "Evrensel olmamakla birlikte, bu ilke kullanıcının kavrayışını geliştirir ve karar verme sürecindeki bilişsel yükü azaltır ve belirli API bağlamlarında potansiyel olarak önemli bir değer sunar."
    ],
    "commentSummary": [
      "Makale, farklı kullanıcı ihtiyaçlarını karşılamak için hem düşük seviyeli hem de yüksek seviyeli API'ler sağlayarak soyutlama ağırlıklı ve soyutlama hafif API'ler arasında bir denge kurmayı vurgulamaktadır.",
      "Node.js ve Vulkan gibi platformlardan örnekler kullanarak API tasarımında tutarlılığı ve esnekliği korumanın zorluklarını vurgularken, aynı zamanda alana özgü terminoloji, basitlik ve fiyatlandırma stratejilerinin öneminin altını çiziyor.",
      "Tartışma, perakende dışı senaryolarda fiyatların gösterilmesi, para birimi hassasiyeti için tamsayıların kullanılması, Stripe'ın API'sinin sınırlamaları, iade ücretlerinden tasarruf etmek için yetkilendirme stratejileri ve anlaşmazlıklar için Stripe web kancaları gibi araçlardan yararlanma hakkında bilgiler içeriyor."
    ],
    "points": 262,
    "commentCount": 97,
    "retryCount": 0,
    "time": 1714072511
  },
  {
    "id": 40164199,
    "title": "Jeff Lawson ve Ben Collins The Onion'ı Satın Aldı",
    "originLink": "https://www.nytimes.com/2024/04/25/business/media/the-onion-sold.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40164199",
    "commentBody": "",
    "originSummary": [
      "Satirik bir haber sitesi olan The Onion, Global Tetrahedron tarafından G/O Media'dan satın alındı ve Chicago'daki mevcut personeli korurken kullanıcı deneyimini geliştirmeyi ve multimedyaya dalmayı hedefliyor.",
      "G/O Media'nın The Onion'ı satma kararı, kilit platformlara odaklandığını gösteriyor.",
      "Dijital medya alanında tanınan yeni sahipleri Jeff Lawson ve Ben Collins, yayının sadık hayranları olarak The Onion'ın kalitesini korumaya ve yükseltmeye kararlılar."
    ],
    "commentSummary": [
      "Hiciv içerikli bir haber kuruluşu olan The Onion'a ve onun farklı partiler tarafından satın alınmasına odaklanılarak ABD'de habercilik önyargısı, kültürel emperyalizm ve seçmen baskısı konuları gündeme getiriliyor.",
      "Tartışmalar, The Onion'ın etkisi, önemli makaleleri ve video içeriğine geçişinin yanı sıra mizah, alaka düzeyi ve etik hususlar hakkındaki tartışmaları da ele alıyor.",
      "Yazıda ayrıca The Babylon Bee gibi diğer hiciv haber platformlarıyla yapılan karşılaştırmalara da değiniliyor."
    ],
    "points": 262,
    "commentCount": 214,
    "retryCount": 0,
    "time": 1714086674
  },
  {
    "id": 40160331,
    "title": "IBM, Açık Kaynaktan Uzaklaşan Kurumsal Değişimin Ortasında HashiCorp'u 6,4 Milyar Dolara Satın Aldı",
    "originLink": "https://www.jeffgeerling.com/blog/2024/corporate-open-source-dead",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40160331",
    "commentBody": "",
    "originSummary": [
      "IBM, HashiCorp'un yazılım endüstrisinde bir değişime işaret eden 'İş Kaynağı Lisansı'na geçişini takiben HashiCorp'u 6.4 milyar dolara satın alıyor.",
      "Şirketler giderek açık kaynaktan tescilli lisanslara geçerek Terraform ve Vault gibi projelerde çatallanma gibi bölünmelere neden oluyor.",
      "Kurumsal açık kaynaktan uzaklaşma eğilimi, güven, gelir ve topluluk odaklı yazılımın sürdürülebilirliği ile ilgili endişeleri artırmakta ve potansiyel olarak daha küçük ekiplerin gelecekteki açık kaynak girişimlerine bağımsız olarak öncülük etmelerinin önünü açmaktadır."
    ],
    "commentSummary": [
      "Makale, şirketlerin açık kaynaklı yazılımlardan karşılıksız olarak nasıl faydalandığını araştırıyor ve adil iş uygulamalarını teşvik etmek için SSPL veya Commons Clause gibi daha katı lisansların kullanılmasını öneriyor.",
      "Geliştiricilerin geçimlerini sağlamak ve açık kaynak ilkelerini korumak arasındaki ikilemleri üzerine bir tartışma yürütülmekte ve açık kaynak topluluğunda kâr ve işbirliği arasında bir denge kurulması gerektiği vurgulanmaktadır.",
      "Katkıda bulunanlar, açık kaynaklı projeleri finansal olarak sürdürmenin zorluklarını tartışıyor, uygun lisansları seçmenin önemini vurguluyor ve yeniden lisanslama risklerine ve açık kaynakta kurumsal katılımın potansiyel dezavantajlarına karşı uyarıyor."
    ],
    "points": 214,
    "commentCount": 130,
    "retryCount": 0,
    "time": 1714065401
  },
  {
    "id": 40156890,
    "title": "Rust Stream API'yi Keşfetmek: Eşzamanlılık ve Performansı Dengeleme",
    "originLink": "https://github.com/alexpusch/rust-magic-patterns/blob/master/rust-stream-visualized/Readme.md",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40156890",
    "commentBody": "",
    "originSummary": [
      "Makale, Rust Stream API'sini inceleyerek pratik senaryolarda eşzamanlılık ve geri baskıyı ele almanın zorluklarını tartışıyor.",
      "Rust'ın async/await özelliği ve Stream API'si asenkron iş akışları tasarlamak için sofistike yollar sunar, ancak bunları yürütmek beklenmedik karmaşıklıklar ortaya çıkarabilir.",
      "Görselleştirme için Bevy'yi kullanan yazar, çeşitli Stream yöntemlerinin davranışlarını sergileyerek şaşırtıcı sonuçları ortaya çıkarıyor ve Rust futures ve async yürütücülerini kapsamlı bir şekilde kavrama ihtiyacını vurguluyor."
    ],
    "commentSummary": [
      "Rust Stream API, görselleştirme yetenekleri nedeniyle GitHub'da sergilenen ve tartışılan sıcak bir konudur.",
      "Bazı kullanıcılar Rust'taki belirli tamponlu akış API'lerinin eşzamanlılıktan yoksun olduğu konusunda uyarırken, diğerleri görselleştirme özelliğini takdir ediyor.",
      "Tartışmalar, API sorunlarını blog gönderileri aracılığıyla çözme, daha yüksek dereceli akış potansiyeli ve bir oyun motoru olan Bevy ile Rust kodunu görselleştirme konularına değiniyor."
    ],
    "points": 207,
    "commentCount": 10,
    "retryCount": 0,
    "time": 1714049504
  },
  {
    "id": 40162433,
    "title": "Backpage Kurucu Ortağı Michael Lacey Çoğu Suçlamadan Beraat Etti",
    "originLink": "https://reason.com/2024/04/25/judge-acquits-backpage-co-founder-michael-lacey-on-most-counts/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40162433",
    "commentBody": "",
    "originSummary": [
      "Federal bir yargıç Backpage kurucularından Michael Lacey ile birlikte eski yöneticiler Jed Brunst ve Scott Spear'ı çeşitli suçlardan beraat ettirerek Lacey'in komplo ve kara para aklama gibi diğer suçlardan yeniden yargılanmasına yol açtı.",
      "Başarılı bir temyiz olasılığına rağmen, Lacey uluslararası kara para aklama suçuna karıştığı için hala hapis cezasına çarptırılabilirken, Brunst ve Spear birden fazla suçtan ceza almayı bekliyor."
    ],
    "commentSummary": [
      "Tartışma, Backpage'in kurucularından Michael Lacey'in davası etrafında dönüyor; haber medyasındaki önyargılar ve kara para aklama yasaları da dahil olmak üzere, işçi ve seks kaçakçılığına değiniliyor.",
      "Tartışmalar ayrıca haksız yere suçlananlara tazminat ödenmesi, yasal reform ve siyaset, din ve sosyal konuların kesişimi konularını da kapsamaktadır.",
      "Ek konular arasında fuhuşun düzenlenmesi, veganlık, sağlık hizmetleri ve HIV tedavisi yer almakta ve bu konuların karmaşıklığı ile dengeli ve hesap verebilir çözümlerin gerekliliği vurgulanmaktadır."
    ],
    "points": 189,
    "commentCount": 140,
    "retryCount": 0,
    "time": 1714076050
  },
  {
    "id": 40159766,
    "title": "OLED Ekranı DDC Protokolü ile Dizüstü Bilgisayara Bağlama: Linux Zorlukları ve Çözümleri",
    "originLink": "https://mitxela.com/projects/ddc-oled",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40159766",
    "commentBody": "",
    "originSummary": [
      "Yazar, bir OLED ekranı DDC protokolü aracılığıyla bir dizüstü bilgisayarın HDMI bağlantı noktasına bağlayarak Linux i2c cihaz zorluklarının üstesinden gelmeyi anlatıyor.",
      "Ekranla etkileşim kurmak, güncelleme oranlarını iyileştirmek ve xrandr kullanarak monitöre dönüştürmeyi denemek için bir Python betiği kullanıyorlar.",
      "Çözünürlük ve video sürücüsü kısıtlamalarına rağmen yazar, OLED ekranda bir kısmını göstermek için çerçeve arabelleğini manipüle ediyor ve sonuçta Github'da geri bildirim için paylaşılan farklı bir ekran yapılandırması ortaya çıkıyor."
    ],
    "commentSummary": [
      "Kullanıcılar, Linux üzerinde kontrol ve cihaz algılama için I2C kullanımına odaklanan kompakt bir HDMI ekran olan DDC OLED'i tartışıyor.",
      "Paylaşılan zorluklar arasında cihaz tanıma ile ilgili sorunlar, I2C veri yolunun taranması ile ilgili riskler ve DDC/CI spesifikasyonunun karmaşıklığı yer almaktadır.",
      "Konuşma, I2C cihazlarının komutlara verdiği çeşitli yanıtları sergileyerek, ekran cihazı kontrolü için I2C'yi yönetmenin karmaşıklıklarını vurguluyor."
    ],
    "points": 182,
    "commentCount": 20,
    "retryCount": 0,
    "time": 1714063325
  },
  {
    "id": 40158183,
    "title": "Eski savcı yapay zeka tarafından üretilen sahte ses çerçevelemesi nedeniyle tutuklandı",
    "originLink": "https://www.thebaltimorebanner.com/education/k-12-schools/eric-eiswert-ai-audio-baltimore-county-YBJNJAS6OZEE5OQVF5LFOFYN6M/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40158183",
    "commentBody": "",
    "originSummary": [
      "Pikesville Lisesi'nin eski spor müdürü Dazhon Darien, yapay zeka kullanarak okul müdürünün ırkçı ve antisemitik sözler söylediği bir kayıt uydurduğu gerekçesiyle tutuklandı.",
      "Olay okulda aksamalara yol açmış, güvenliği sağlamak için polisin varlığı artmış ve Darien okul faaliyetlerini aksatmak, hırsızlık ve bir tanığa misilleme yapmakla suçlanmıştır.",
      "Uzmanlar, sahte kayıtlar oluşturmak için yapay zeka kullanımının giderek artan bir endişe kaynağı olduğunun altını çizerek, bu sorunun üstesinden gelmek için gelişmiş düzenlemelerin gerekliliğini vurguluyor."
    ],
    "commentSummary": [
      "Eski bir atletizm direktörü, bir hırsızlık soruşturmasında bir müdürü suçlamak için yapay zeka tarafından üretilen ses kullandığı gerekçesiyle tutuklanarak güvenlik ve teknolojinin kötüye kullanımı konusunda endişelere yol açtı.",
      "Tartışmalar, ses kayıtlarının ve ekran görüntülerinin güvenilirliğine yönelik şüphelerin yanı sıra yapay zekanın gizlilik ve güven konusundaki risklerini ve etik sonuçlarını vurgulamaktadır.",
      "YZ tarafından üretilen kanıtların yasal davalarda kötüye kullanılması, düzenlemelerin yokluğu ve deepfake teknolojilerinin geliştirilmesiyle ilgili etik ikilemler hakkında endişeler dile getirilmekte, meslekler ve toplum üzerindeki etkisi vurgulanmaktadır."
    ],
    "points": 182,
    "commentCount": 79,
    "retryCount": 0,
    "time": 1714056207
  }
]
