[
  {
    "id": 37967126,
    "title": "ஜிபியு கம்ப்யூட்டிங் பற்றி ஒவ்வொரு டெவலப்பரும் தெரிந்து கொள்ள வேண்டியவை",
    "originLink": "https://codeconfessions.substack.com/p/gpu-computing",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37967126",
    "commentBody": "",
    "originSummary": [
      "இந்த கட்டுரை சிபியு (மத்திய செயலாக்க அலகு) மற்றும் ஜிபியு (கிராபிக்ஸ் செயலாக்க அலகு) ஆகியவற்றுக்கு இடையிலான வேறுபாடுகள், அவற்றின் கட்டமைப்புகள், வடிவமைப்பு நோக்கங்கள் மற்றும் ஆழமான கற்றல் போன்ற பயன்பாடுகளில் அவற்றின் முக்கியத்துவம் ஆகியவற்றை விவரிக்கிறது.",
      "இந்த விவாதம் லிட்டலின் விதியையும் உள்ளடக்கியது — வரிசைக் கோட்பாட்டில் ஒரு முக்கியமான கொள்கை — மற்றும் ஜிபியுக்கள் மற்றும் சிபியூக்களுக்கு இடையில் அதிகரித்து வரும் செயல்திறன் முரண்பாடு.",
      "ஜி.பி.யுக்களின் சிக்கலான கட்டமைப்பு மற்றும் குறியீடு தேர்வுமுறையின் தேவை ஆகியவை வலியுறுத்தப்படுகின்றன, அத்துடன் உகந்த செயல்திறனுக்கான பயனுள்ள வள ஒதுக்கீட்டின் அத்தியாவசியங்களும் வலியுறுத்தப்படுகின்றன. குடா கர்னல்கள், நூல் தொகுதிகள் மற்றும் தரவு நகலெடுத்தல் போன்ற முக்கிய கலைச்சொற்கள் தெளிவுபடுத்தப்படுகின்றன."
    ],
    "commentSummary": [
      "இந்த கட்டுரை ஜிபியூ கம்ப்யூட்டிங்கின் சிக்கலான தன்மையைப் பற்றி விவாதிக்கிறது, இந்த துறையில் சிபியூக்கள், நினைவக பயன்பாடு மற்றும் திறமையான குறியீடு தேர்வுமுறை ஆகியவற்றைப் புரிந்துகொள்வதன் முக்கியத்துவத்தை வலியுறுத்துகிறது.",
      "குவாட்காப்டர்கள் மற்றும் ட்ரோன்களுக்கு இடையிலான வேறுபாடுகள், ஆப்பிள் சிலிக்கான் வெர்சஸ் என்விடியா ஜிபியு கட்டமைப்புகள் மற்றும் இயந்திர கற்றலில் மிதவைகளின் பயன்பாடு போன்ற கருத்துக்களும் ஆராயப்படுகின்றன.",
      "மென்பொருள் துறையில் தொடர்ச்சியான கற்றலின் நன்மைகள், ஜிபியு சந்தையில் சீன நிறுவனங்களின் வளர்ந்து வரும் தாக்கம் மற்றும் இயந்திர கற்றல் மற்றும் ஜிபியு கம்ப்யூட்டிங்கிற்கான மாற்று வன்பொருள் விருப்பங்களை பரிசீலிப்பதன் முக்கியத்துவத்தை இது வலியுறுத்துகிறது."
    ],
    "points": 433,
    "commentCount": 157,
    "retryCount": 0,
    "time": 1697899007
  },
  {
    "id": 37967936,
    "title": "FPGA N64",
    "originLink": "http://www.ultrafp64.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37967936",
    "commentBody": "",
    "originSummary": [
      "ஐந்து ஆண்டுகளாக வளர்ச்சியில் உள்ள அல்ட்ரா எஃப்பி 64 எஃப்பிஜிஏ என் 64 ஹோம் கன்சோல் நிறைவடையும் தருவாயில் உள்ளது. சிபியு, டிஎல்பி, எஃப்பியு, கேச் மற்றும் பஸ் வடிவமைப்புகள் போன்ற முக்கிய கூறுகள் வடிவமைக்கப்பட்டு வெற்றிகரமாக சோதிக்கப்பட்டுள்ளன.",
      "பஸ் வடிவமைப்பு வழியாக அதிகரித்த நினைவக அணுகல் மற்றும் 2.2 ஜிபிட் ட்ரோபுட் கொண்ட ரேம் கன்ட்ரோலரால் இயக்கப்பட்ட மேம்பட்ட தரவு ஓட்டம் போன்ற மேம்பாடுகளை கன்சோல் கொண்டுள்ளது. வீடியோ கோர் ஒரு ஸ்கேலிங் யூனிட் மற்றும் எச்.டி.எம்.ஐ வெளியீட்டைக் கொண்டுள்ளது, ஆடியோவும் எச்.டி.எம்.ஐ போர்ட் வழியாக வழங்கப்படுகிறது.",
      "இந்த திட்டம் என் 64பிரூ மற்றும் பல்வேறு டிகாம்பிலர் குழுக்களிடமிருந்து ஆதரவைப் பெற்றுள்ளது, இது கன்சோலின் வளர்ச்சிக்குப் பின்னால் ஒரு சுறுசுறுப்பான மற்றும் ஈடுபாடு கொண்ட சமூகத்தை முன்னிலைப்படுத்துகிறது. சில சிறிய பிரச்சினைகள், குறிப்பாக ஆர்.டி.பி மையத்தில், இன்னும் தீர்க்கப்பட்டு வருகின்றன."
    ],
    "commentSummary": [
      "உரையாடலின் முதன்மை கவனம் அசல் நிண்டெண்டோ 64 (என் 64) வன்பொருளில் இயக்க சூப்பர் மரியோ 64 ஐ மேம்படுத்தும் திட்டங்களில் உள்ளது.",
      "மிஸ்டர் அமைப்பு, அனலாக் என் 64 எஃப்பிஜிஏ குளோன், மார்ஸ்எஃப்பிஜிஏ கன்சோல் மற்றும் எஃப்பிஜிஏ எமுலேஷன் போன்ற வரவிருக்கும் திட்டங்கள் உள்ளிட்ட பிற ரெட்ரோ கேமிங் அமைப்புகளையும் விவாதங்கள் உள்ளடக்குகின்றன.",
      "நிண்டெண்டோ கன்சோல்களுக்கான விளையாட்டு மேம்பாட்டு மொழி (சி) பற்றி பயனர்கள் விவாதிக்கிறார்கள், எஃப்.பி.ஜி.ஏ மேம்பாட்டு வாரியங்களுக்கான பரிந்துரைகளைப் பகிர்ந்துகொள்கிறார்கள், மேலும் நந்த்2டெட்ரிஸ் மற்றும் பென் ஈட்டரின் திட்டங்கள் போன்ற கல்வி வளங்களைத் தொடுகிறார்கள்."
    ],
    "points": 350,
    "commentCount": 73,
    "retryCount": 0,
    "time": 1697904105
  },
  {
    "id": 37971795,
    "title": "ஸ்டார்ட் அப் சி.டி.ஓ.வின் கையேடு",
    "originLink": "https://github.com/ZachGoldberg/Startup-CTO-Handbook",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37971795",
    "commentBody": "",
    "originSummary": [
      "\"ஸ்டார்ட் அப் சிடிஓவின் கையேடு\" என்பது தொழில்நுட்ப ஸ்டார்ட்அப்களில் உள்ள தலைவர்களுக்கான தலைமைத்துவம், மேலாண்மை மற்றும் மென்பொருள் பொறியியல் தலைப்புகளைக் கையாளும் திறந்த மூல புத்தகமாகும்.",
      "இந்த புத்தகம் மார்க்டவுன் வடிவத்திற்கு மாற்றப்படுகிறது மற்றும் கிட்ஹப்பில் பார்வை மற்றும் திருத்தங்களுக்கு கிடைக்கிறது, இது அணுகல் மற்றும் ஒத்துழைப்பு திறனை அதிகரிக்கிறது.",
      "ஆசிரியர் பங்களிப்புகளை அழைக்கிறார் மற்றும் உள்ளடக்க உரிமம் மற்றும் பயன்பாட்டிற்கான விதிகளை வழங்குகிறார், திறந்த மற்றும் உள்ளடக்கிய உருவாக்க செயல்முறையை ஊக்குவிக்கிறார்."
    ],
    "commentSummary": [
      "இந்த உரையாடல் முதன்மையாக ஒரு தொடக்க சூழலில் கூட்டங்களைப் பதிவு செய்வதன் நன்மை தீமைகளைப் பற்றி விவாதிக்கிறது, ஆதரவாளர்கள் மேம்பட்ட உற்பத்தித்திறன் மற்றும் வெளிப்படைத்தன்மைக்கான சாத்தியத்தை மேற்கோள் காட்டுகின்றனர், அதே நேரத்தில் எதிர்ப்பாளர்கள் ஒப்புதல் மற்றும் பொருத்தம் குறித்த கவலைகளை வெளிப்படுத்துகிறார்கள்.",
      "ஒரு தலைமை தொழில்நுட்ப அதிகாரியின் (சி.டி.ஓ) பங்கு மற்றும் சவால்கள் மற்றும் அது குறித்த பொதுவான சந்தேகம், அத்துடன் மென்பொருள் மேம்பாடு மற்றும் தகவல் தொழில்நுட்ப செயல்பாடுகளை ஒருங்கிணைக்கும் ஒரு நடைமுறையான DevOps இன் வரையறை மற்றும் விளக்கம் ஆகியவை விவாதத்தின் பிற குறிப்பிடத்தக்க புள்ளிகளாகும்.",
      "தொழில்நுட்ப கடன், அதிக நேரம் எடுக்கும் சிறந்த அணுகுமுறையைப் பயன்படுத்துவதற்குப் பதிலாக இப்போது எளிதான தீர்வைத் தேர்ந்தெடுப்பதால் ஏற்படும் கூடுதல் மறுசீரமைப்பின் மறைமுக செலவைக் குறிக்கும் சொல், தொடக்க மேலாண்மை ஆலோசனை மற்றும் விரிவான ஆவணப்படுத்தலின் முக்கியத்துவம் ஆகியவை பிற தொடர்புடைய தலைப்புகளில் அடங்கும்."
    ],
    "points": 238,
    "commentCount": 54,
    "retryCount": 0,
    "time": 1697934587
  },
  {
    "id": 37969248,
    "title": "அட்டெக் கண்காணிப்பு மற்றும் அரசாங்க கண்காணிப்பு பெரும்பாலும் ஒரே மாதிரியானவை",
    "originLink": "https://www.eff.org/deeplinks/2023/10/adtech-surveillance-and-government-surveillance-are-often-same-surveillance",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37969248",
    "commentBody": "",
    "originSummary": [
      "தரவு தரகர்களிடமிருந்து அரசாங்கங்கள் தனிப்பட்ட தரவை வாங்குவதால் கார்ப்பரேட் மற்றும் அரசாங்க கண்காணிப்புக்கு இடையிலான கோடு மறைந்து வருகிறது; இந்தத் தரவு முதலில் இலக்கு வைக்கப்பட்ட விளம்பரத் துறையிலிருந்து பெறப்பட்டது.",
      "இந்த நடைமுறை அரசாங்க அமைப்புகளை வாரண்ட் தேவையில்லாமல் பில்லியன் கணக்கான சாதனங்களின் தகவல்களை அணுக அனுமதிக்கிறது; ஸ்மார்ட்போன் பயன்பாட்டு டெவலப்பர்கள் பெரும்பாலும் பயனர் தரவை அரசாங்கத்திற்கு கூட விற்கிறார்கள், இது மக்களை கண்காணிப்பு மற்றும் இலக்குக்கு ஆளாக்குகிறது.",
      "தரவு தரகர் ஓட்டை மூடுவதற்கும், தனிநபர்களின் தனியுரிமை பாதுகாக்கப்படுவதை உறுதி செய்யும் விரிவான நுகர்வோர் தரவு தனியுரிமை சட்டங்களை இயற்றுவதற்கும் நடவடிக்கைகள் நடந்து வருகின்றன."
    ],
    "commentSummary": [
      "இந்த கட்டுரை அட்டெக் மற்றும் அரசாங்க கண்காணிப்புக்கு இடையிலான ஒற்றுமைகளைப் பற்றி விவாதிக்கிறது, தனிப்பட்ட தரவு சுரண்டல் குறித்த கவலைகளை எழுப்புகிறது மற்றும் செல்லுலார் கேரியர்களால் இருப்பிட தரவு விற்பனைக்கு எதிராக ஒழுங்குமுறை நடவடிக்கைகளுக்கு அழைப்பு விடுக்கிறது.",
      "குறியாக்கம், பொறுப்புடைமை, ஆபத்து பற்றிய பயனர் கல்வி மற்றும் மேம்பட்ட தனியுரிமை நடவடிக்கைகளின் முக்கியத்துவத்தை வலியுறுத்தும் இந்த கட்டுரை, தொழில்நுட்ப ஜாம்பவான்களான மெட்டா மற்றும் கூகிள் ஆகியவற்றை ஆட்டெக் மற்றும் பயனர் தரவு விற்பனையிலிருந்து இலாபம் ஈட்டுவதில் தங்கள் பங்கிற்காக விமர்சிக்க கண்காணிப்பு நடைமுறைகளுக்கு எடுத்துக்காட்டாக \"AdInt\" ஐ அறிமுகப்படுத்துகிறது.",
      "கண்காணிப்பு, மேம்பட்ட தொழில்நுட்பத்தை தவறாகப் பயன்படுத்துதல், தனிப்பட்ட தரவு ஒழுங்குமுறையின் அவசியம், வெளிப்படையான பயனர் ஒப்புதல் மற்றும் தொழில்நுட்ப நிறுவனங்கள் மற்றும் தரவு தரகர்களுக்கு இடையிலான ஒத்துழைப்பு ஆகியவற்றின் சாத்தியமான பாதகமான விளைவுகளையும் இது வெளிச்சம் போட்டுக் காட்டுகிறது."
    ],
    "points": 237,
    "commentCount": 39,
    "retryCount": 0,
    "time": 1697912552
  },
  {
    "id": 37969387,
    "title": "பிளாக்செயின் நிரல் முடிவடைவதற்கு சில மணி நேரங்களுக்கு முன்பு ரெட்டிட் மோட்கள் டம்ப் செய்யப்பட்ட டோக்கன்கள்",
    "originLink": "https://cointelegraph.com/news/reddit-mods-dumped-tokens-hours-before-blockchain-program-termination",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37969387",
    "commentBody": "",
    "originSummary": [
      "ரேடிட் அதன் பிளாக்செயின் அடிப்படையிலான சமூக புள்ளிகள் திட்டத்தை அளவிடுதல் சிக்கல்கள் காரணமாக நிறுத்தியுள்ளது.",
      "சுமார் மூன்று ரெட்டிட் நடுவர்கள் அறிவிப்புக்கு சற்று முன்பு தங்கள் டோக்கன்களை விற்றதாக குற்றச்சாட்டுகள் உள்ளன, இது உள் தகவல்களைப் பயன்படுத்தி இருக்கலாம்.",
      "கிரிப்டோ சந்தைகளில் சரிவு இருந்தபோதிலும், யு.எஸ்.டி.டி ஸ்டேபிள்காயினுக்குப் பின்னால் உள்ள அமைப்பான டெதர், 2023 ஆம் ஆண்டில் அதன் சொத்துக்கள் மற்றும் கடன்களில் வளர்ச்சியை சந்தித்துள்ளது. இது 2024 முதல் ரிசர்வ் தரவை நிகழ்நேரத்தில் பகிரத் தொடங்க திட்டமிட்டுள்ளது."
    ],
    "commentSummary": [
      "டோக்கன்களை விற்பதன் மூலம் இடைத்தரகர்கள் உள் வர்த்தகத்தில் ஈடுபட்டதாகக் கூறப்படும் ரெடிட்டில் ஒரு உரையாடல், கிரிப்டோகரன்சி சந்தையில் பத்திரங்களை ஒழுங்குபடுத்துவது குறித்த விவாதங்களைத் தூண்டுகிறது.",
      "மோசடிகள், திருட்டுகள் மற்றும் நாணயமாக அதன் சட்டப்பூர்வத்தன்மை குறித்த கேள்விகள் போன்ற கிரிப்டோகரன்சி தொடர்பான பிற சிக்கல்களையும் இந்த உரை விவாதிக்கிறது.",
      "இதில் பல்வேறு நாணய முறைகள் குறித்த விமர்சனங்கள், ஊழல் குறித்த விவாதங்கள் மற்றும் காங்கிரஸ் உறுப்பினர்களின் சட்டவிரோத வர்த்தக நடவடிக்கைகள் குறித்த விஷயத்தை முன்னிலைப்படுத்தும் அதே நேரத்தில் ரெட்டிட்டின் வீழ்ச்சியை ஒரு தளமாகக் குறிப்பிடுதல் ஆகியவை அடங்கும்."
    ],
    "points": 231,
    "commentCount": 138,
    "retryCount": 0,
    "time": 1697913525
  },
  {
    "id": 37966569,
    "title": "பிக்சல் 8 ப்ரோவின் டென்சர் ஜி 3 ஆனது அனைத்து உற்பத்தி செயற்கை நுண்ணறிவு பணிகளையும் கிளவுட்டுக்கு ஏற்றுகிறது",
    "originLink": "https://www.notebookcheck.net/MrWhosetheboss-video-reveals-Google-s-Pixel-8-Pro-Tensor-G3-off-loads-all-generative-AI-tasks-to-the-cloud.760215.0.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37966569",
    "commentBody": "",
    "originSummary": [
      "யூடியூபர் @Mrwhosetheboss கூகிள் பிக்சல் 8 ப்ரோவின் டென்சர் ஜி 3 செயலியை விமர்சிக்கிறார், கூகிளின் சந்தைப்படுத்தலுக்கு மாறாக, சாதனத்திற்கு சில செயற்கை நுண்ணறிவு செயல்பாடுகளுக்கு நிலையான இணைய இணைப்பு தேவைப்படுகிறது என்று வாதிடுகிறார், இது கிளவுட்டில் செயற்கை நுண்ணறிவு பணிகளை ஆஃப்-லோட் செய்கிறது என்பதைக் குறிக்கிறது.",
      "டென்சர் ஜி 3 சிப்பின் செயல்திறன் எதிர்பார்த்ததை விட மெதுவானது மற்றும் மிட்-ரேஞ்ச் செயலிகளுடன் ஒப்பிடத்தக்கது என்று யூடியூபர் சுட்டிக்காட்டுகிறார், இது கூகிளின் முதன்மை உரிமைகோரல்களை கேள்விக்குள்ளாக்குகிறது.",
      "மதிப்பாய்வு தடை காலத்தில் மதிப்பாய்வாளர்கள் பெஞ்ச்மார்க் பயன்பாடுகளைப் பயன்படுத்துவதைத் தடுப்பதற்காக கூகிள் மேலும் விமர்சிக்கப்படுகிறது, இது புறநிலை செயல்திறன் மதிப்பீட்டை அனுமதித்திருக்கலாம்."
    ],
    "commentSummary": [
      "மொபைல் சாதனங்களில் செயற்கை நுண்ணறிவின் தயார்நிலை மற்றும் திறன்களைப் பற்றி முக்கிய விவாதம் உள்ளது, குறிப்பாக கூகிளின் பிக்சல் 8 ப்ரோ மற்றும் அதன் டென்சர் ஜி 3 சிப்பில் கவனம் செலுத்துகிறது.",
      "சிப்பின் செயல்திறன் குறித்த சந்தேகங்கள், அதன் செயல்திறன் குறித்த கூகிளின் கூற்றுக்கள் மற்றும் பயனர் தனியுரிமையை பாதிக்கும் கிளவுட்டில் செயற்கை நுண்ணறிவு பணிகளை இறக்குவது குறித்த கவலைகள் உள்ளன.",
      "இது பழைய சிப்செட்டுகளுக்கான குவால்காமின் நிறுத்தப்பட்ட ஆதரவு மற்றும் சாதன செயற்கை நுண்ணறிவு செயலாக்கத்தின் வரம்புகளையும் குறிப்பிடுகிறது, அதே நேரத்தில் கூகிள் வாக்குறுதிகளை நிறைவேற்றவில்லை என்று விமர்சிக்கிறது மற்றும் அதிக வெளிப்படைத்தன்மை மற்றும் நீண்டகால ஆதரவைக் கோருகிறது."
    ],
    "points": 226,
    "commentCount": 124,
    "retryCount": 0,
    "time": 1697894055
  },
  {
    "id": 37970484,
    "title": "கனடாவில் 20 ஆண்டுகளுக்கு முன்பு இருந்ததை விட இன்று தொழில் முனைவோர் குறைவு",
    "originLink": "https://www.cbc.ca/news/business/canada-entrepreneurs-shortage-solutions-1.7002171",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37970484",
    "commentBody": "",
    "originSummary": [
      "கனடாவின் வணிக மேம்பாட்டு வங்கி (பி.டி.சி) அறிக்கை கடந்த 20 ஆண்டுகளில் தொழில்முனைவில் குறிப்பிடத்தக்க வீழ்ச்சியைக் காட்டுகிறது, வளர்ந்து வரும் மக்கள்தொகை இருந்தபோதிலும் 100,000 குறைவான தொழில்முனைவோர் உள்ளனர்.",
      "ஒரு வணிகத்தைத் தொடங்குவதிலும் இயக்குவதிலும் உள்ள சவால்களைச் சமாளிக்க சந்தைப்படுத்தல், நிதி மற்றும் தலைமைத்துவம் போன்ற \"மென் திறன்களை\" வளர்ப்பதன் அவசியத்தை பி.டி.சி பரிந்துரைக்கிறது.",
      "சரிவுக்கு பங்களிக்கும் காரணிகளில் சாத்தியமான நிறுவனர்களின் மக்கள்தொகை குறைதல், அதிக ஊதியங்களுடன் குறைந்த வேலையின்மை மற்றும் வணிக சூழலில் பல ஊக்கமளிக்கும் காரணிகள் ஆகியவை அடங்கும். கீழ்நோக்கிய போக்கை மாற்றியமைப்பதற்கான முன்மொழிவுகளில் தொழில்முனைவோருக்கான உதவித்தொகை மற்றும் வயதான, அனுபவம் வாய்ந்த தொழில்முனைவோரை ஈடுபடுத்துதல் ஆகியவை அடங்கும்."
    ],
    "commentSummary": [
      "வரையறுக்கப்பட்ட புரிதல் மற்றும் முதலீட்டு வாய்ப்புகள், அடக்குமுறை வணிகச் சூழல் மற்றும் இடர் வெறுப்பு போக்குகள் போன்ற காரணிகளால் கனடாவில் தொழில்முனைவோர் குறைவதை இந்த உரையாடல் மையமாகக் கொண்டுள்ளது.",
      "அதிக வாழ்க்கைச் செலவுகள், குறிப்பாக வீட்டுச் செலவுகள், இளம் ஆர்வலர்களுக்கு ஒரு தடையாகப் பார்க்கப்படுகின்றன; அரசாங்கத்தின் திறமையின்மை மற்றும் உற்பத்தித்திறனில் அவற்றின் தாக்கம் ஆகியவை விவாதிக்கப்படுகின்றன.",
      "அதிகரித்து வரும் பொதுத்துறை வளர்ச்சி, கனடாவின் பிம்பம் மற்றும் குடியேற்றம் மற்றும் வரிவிதிப்பு பிரச்சினைகள் போன்ற கருப்பொருள்கள் எழுப்பப்படுகின்றன, இது வீட்டுவசதி மற்றும் கட்டுமான விஷயங்களில் அரசாங்க தலையீட்டின் அவசியத்தை சுட்டிக்காட்டுகிறது."
    ],
    "points": 173,
    "commentCount": 237,
    "retryCount": 0,
    "time": 1697922755
  },
  {
    "id": 37967748,
    "title": "மனித நுண்ணுயிர் கட்டுக்கதைகள் மற்றும் தவறான கருத்துக்கள்",
    "originLink": "https://www.nature.com/articles/s41564-023-01426-7",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37967748",
    "commentBody": "",
    "originSummary": [
      "இந்த கட்டுரை மனித நுண்ணுயிரி ஆராய்ச்சி பற்றிய பொதுவான கட்டுக்கதைகள் மற்றும் தவறான கருத்துக்களை குறிவைக்கிறது, இதில் இது ஒரு புதிய துறை என்ற நம்பிக்கை மற்றும் மனித மலத்தில் உள்ள பாக்டீரியா செல்கள் பற்றிய தவறான புள்ளிவிவரங்கள் ஆகியவை அடங்கும்.",
      "இது நுண்ணுயிரி ஆராய்ச்சியின் வரம்புகளைப் பற்றி விவாதிக்கிறது, நோயில் நுண்ணுயிரியின் பங்கு குறித்த பிரபலமான கருத்துக்களை சவால் செய்கிறது, மேலும் சான்று அடிப்படையிலான கூற்றுக்களை ஆதரிக்கிறது.",
      "இறுதி இலக்கு வாசகர்களுக்கு மனித நுண்ணுயிரி பற்றிய மிகவும் துல்லியமான கண்ணோட்டத்தை வழங்குவதாகும்."
    ],
    "commentSummary": [
      "இந்த கட்டுரை மனித நுண்ணுயிரி பற்றிய தவறான கருத்துக்களை ஆராய்கிறது, ஆரோக்கியத்தை பராமரிப்பதில் அதன் பங்கின் பன்முக தன்மையை வலியுறுத்துகிறது.",
      "இது நுண்ணுயிரியின் முழு சாத்தியமான தாக்கத்தை ஆராய்வதற்கான மேலதிக ஆராய்ச்சியின் முக்கியத்துவத்தை எடுத்துக்காட்டுகிறது மற்றும் தற்போதைய நுண்ணுயிர் ஆராய்ச்சியின் விமர்சனங்களை நிவர்த்தி செய்கிறது.",
      "வீக்கத்தைக் குறைப்பது போன்ற இரைப்பை குடல் ஆரோக்கியத்தில் புளித்த உணவுகளின் நன்மை பயக்கும் விளைவுகள் வலியுறுத்தப்படுகின்றன, உணவு மாற்றங்கள் தொடர்பான தனிப்பட்ட அனுபவங்களால் ஆதரிக்கப்படுகின்றன."
    ],
    "points": 173,
    "commentCount": 58,
    "retryCount": 0,
    "time": 1697903169
  },
  {
    "id": 37966485,
    "title": "மறுஉற்பத்திக்கு ஒரு விலை உள்ளது, மறுஉற்பத்திக்கு செலவு இல்லை",
    "originLink": "https://www.germanvelasco.com/blog/refactoring-is-a-habit",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37966485",
    "commentBody": "",
    "originSummary": [
      "இந்த கட்டுரை வளர்ச்சியில் மறுஉற்பத்தியின் இன்றியமையாத பங்கை வலியுறுத்துகிறது, மறுஉற்பத்தி செய்யாதது அதிகரித்த பராமரிப்பு செலவுகளுடன் தொடர்புடையது என்பதைக் குறிக்கிறது.",
      "தொடர்ச்சியான மறுஉற்பத்தி இல்லாதது மோசமான மற்றும் பராமரிக்க கடினமாக இருக்கும் குறியீட்டு தளத்தை ஏற்படுத்துகிறது, இது சாத்தியமான இடைவெளிகள் காரணமாக அம்ச சேர்த்தல்களை ஆபத்தானதாக ஆக்குகிறது என்று அது வாதிடுகிறது.",
      "வழக்கமான மறுஉற்பத்தியைத் தேர்ந்தெடுப்பது அல்லது க்ரூஃப்ட் குவிப்பை அனுமதிப்பது இரண்டும் ஒரு செலவை ஈர்க்கின்றன - இருப்பினும், ஒரு முழுமையான மறுபதிப்பின் செலவு அதிகம் என்ற கருத்துடன் கட்டுரை முடிவடைகிறது."
    ],
    "commentSummary": [
      "காலாவதியான தொழில்நுட்பத்தைப் புதுப்பிக்கப் புறக்கணிப்பதன் விளைவுகளை இந்த கட்டுரை வலியுறுத்துகிறது, தொழில்நுட்பக் கடனைக் கையாள்வதன் முக்கியத்துவத்தையும், அத்தகைய புதுப்பிப்புகளுக்கு முன்னுரிமை அளிப்பதன் அவசியத்தைப் புரிந்துகொள்வதில் மூத்த தலைமையின் பங்கையும் வலியுறுத்துகிறது.",
      "புதிய வணிக அம்சங்களை வழங்குவதற்கும் தொழில்நுட்ப பணிகளில் கவனம் செலுத்துவதற்கும் இடையில் ஒரு சமநிலையின் அவசியத்தை பரிந்துரைக்கும், பாதிப்புகளை நிவர்த்தி செய்ய சைபர் பாதுகாப்பு குழுக்களின் ஈடுபாடு பரிந்துரைக்கப்படுகிறது.",
      "ஐ.டி.இ போன்ற வெளிப்புற கருவிகளைப் பயன்படுத்துவதற்கான முன்னோக்குகள், ஒரு கணினியை மீண்டும் எழுதுவதன் தாக்கங்கள் மற்றும் நிரல் அமைப்பின் முறையான கோட்பாட்டின் சாத்தியமான தேவை உள்ளிட்ட மென்பொருள் மேம்பாட்டில் வடிவமைப்பு மற்றும் மறுஉற்பத்தியின் மதிப்பைச் சுற்றி விவாதங்கள் சுழல்கின்றன."
    ],
    "points": 172,
    "commentCount": 151,
    "retryCount": 0,
    "time": 1697893334
  },
  {
    "id": 37970800,
    "title": "OpenRefine",
    "originLink": "https://openrefine.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37970800",
    "commentBody": "",
    "originSummary": [
      "ஓபன்ரெஃபைன் என்பது ஒழுங்கமைக்கப்படாத தரவை சுத்தம் செய்வதற்கும் மாற்றுவதற்கும் ஒரு இலவச, திறந்த மூல கருவியாகும், இது ஃபேசிங், கிளஸ்டரிங், சமரசம் மற்றும் வரம்பற்ற செயல்தவிர்ப்பு / மறுவடிவமைத்தல் போன்ற அம்சங்களைக் கொண்டுள்ளது.",
      "கருவி உள்நாட்டில் தரவை சுத்தம் செய்வதன் மூலம் தனியுரிமைக்கு முன்னுரிமை அளிக்கிறது மற்றும் வலை சேவைகள் மற்றும் பிற வெளிப்புற ஆதாரங்களுடன் தரவு நீட்டிப்பை அனுமதிக்கிறது.",
      "பயனர்கள் விக்கிடேட்டாவிற்கு கூடுதலாக பங்களிக்கலாம் மற்றும் கூடுதல் வளங்கள் மற்றும் ஆவணங்களை அணுகலாம், அதன் பயன்பாடு மற்றும் கூட்டுத் தன்மையை மேம்படுத்தலாம்."
    ],
    "commentSummary": [
      "ஓபன்ரெஃபைன் என்பது அதன் தரவு சுத்தம் மற்றும் ஒருங்கிணைப்பு திறன்களுக்காக பாராட்டப்படும் ஒரு கருவியாகும், குறிப்பாக செயல்முறையைக் கண்காணிக்கும்போது மாறுபட்ட மற்றும் தளர்வாக கட்டமைக்கப்பட்ட தரவு மூலங்களைக் கையாளுகிறது.",
      "பயனர்கள் Exploratory.io போன்ற மாற்று கருவிகள் மற்றும் வெவ்வேறு தொழில்நுட்பங்களுடன் ஓபன்ரெஃபைனை மறுவடிவமைப்பதற்கான சாத்தியம் பற்றி விவாதிக்கின்றனர்.",
      "OpenRefine இன் பரிணாமம், ஃப்ரீபேஸ் கிரிட்வொர்க்ஸ் என்ற அதன் தோற்றத்திலிருந்து கூகிள் ரிஃபைன் வரை, இறுதியாக ஓபன் ரெஃபைன் என்ற அதன் தற்போதைய நிலைக்கு குறிப்பிடப்படுகிறது."
    ],
    "points": 162,
    "commentCount": 11,
    "retryCount": 0,
    "time": 1697925118
  },
  {
    "id": 37970572,
    "title": "பொதுநோக்கு தொழில்நுட்பமாக கணினிகளின் வீழ்ச்சி (2021)",
    "originLink": "https://cacm.acm.org/magazines/2021/3/250710-the-decline-of-computers-as-a-general-purpose-technology/fulltext",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37970572",
    "commentBody": "",
    "originSummary": [
      "இந்த கட்டுரை பொது நோக்க சிபியூக்களில் மெதுவான முன்னேற்றத்தை எடுத்துக்காட்டுகிறது, இது அவற்றின் செயல்திறன் மற்றும் சக்தி செயல்திறன் நன்மைகளுக்காக ஜிபியூக்கள் போன்ற சிறப்பு செயலிகளை நோக்கி மாற வழிவகுக்கிறது.",
      "இருப்பினும், இந்த மாற்றம் அதிக செலவுகள், நிரலாக்க சிக்கல் மற்றும் கணினி மற்றும் உலகளாவிய செயலி உற்பத்தி பொருளாதாரத்தில் ஒட்டுமொத்த வளர்ச்சிக்கு சாத்தியமான தடைகள் போன்ற குறைபாடுகளைக் கொண்டுள்ளது.",
      "மேலும், அதிகரித்த செலவுகள், பிளவு, வேலை சந்தைகளில் சாத்தியமான விளைவு மற்றும் போட்டி உள்ளிட்ட இந்த போக்கின் சவால்கள் மற்றும் தாக்கங்களை கட்டுரை ஆராய்கிறது, இது ஒரு புதிய கணக்கீட்டு மாதிரியின் அவசியத்தை வலியுறுத்துகிறது."
    ],
    "commentSummary": [
      "நிரலாக்க திறன்கள் இல்லாதவர்களுக்கு பயனுள்ள கருவிகளை உருவாக்க மென்பொருள் தோல்வியுற்றதை மேற்கோள் காட்டி, உலகளாவிய தொழில்நுட்பமாக கணினிகளின் பயன்பாடு குறைவதை கட்டுரை விவாதிக்கிறது.",
      "ஆட்டோமேஷனை நோக்கிய சாத்தியமான மாற்றங்கள், ஸ்கிரிப்டிங் மற்றும் தரவு பகுப்பாய்வைச் சுற்றியுள்ள மேம்பட்ட கல்வி மற்றும் உலகளாவிய மத்திய செயலாக்க அலகுகளை (சிபியூ) விட சிறப்பு செயலிகளை நோக்கி வளர்ந்து வரும் போக்கு ஆகியவற்றில் கவனம் செலுத்தப்படுகிறது.",
      "மென்பொருளின் சிக்கலான தன்மை, கணினி தளங்களின் சாத்தியமான சிதைவு மற்றும் அதிகரித்து வரும் தானியங்கி தொழில்துறையில் வேலைவாய்ப்பின் சவால்கள் ஆகியவையும் விவாதிக்கப்படுகின்றன."
    ],
    "points": 160,
    "commentCount": 100,
    "retryCount": 0,
    "time": 1697923447
  },
  {
    "id": 37967751,
    "title": "கெஜு, சீனாவின் கடினமான சிவில் சர்வீஸ் தேர்வு",
    "originLink": "https://aeon.co/essays/why-chinese-minds-still-bear-the-long-shadow-of-keju",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37967751",
    "commentBody": "",
    "originSummary": [
      "இந்த கட்டுரை சீனாவின் சிவில் சர்வீஸ் தேர்வான கெஜுவின் வரலாற்று தாக்கத்தை மையமாகக் கொண்டுள்ளது, இது அதிகார மரியாதை மற்றும் கூட்டுவாதத்தை ஊக்குவித்தது; 1905 ஆம் ஆண்டில் இது அகற்றப்பட்டது பிராந்திய கலகங்களுக்கும் குயிங் வம்சத்தின் வீழ்ச்சிக்கும் வழிவகுத்தது.",
      "ஆசிரியர் கெஜு முறையை மேற்கில் சிவில் சர்வீஸ் தேர்வுகளுடன் ஒப்பிட்டு, ஜனாதிபதி ஜி ஜின்பிங்கின் கீழ் சீனாவின் எதேச்சதிகாரம் விளாடிமிர் புடினின் கீழ் ரஷ்யாவின் சர்வாதிகாரத்தை விட வலுவானது என்று பரிந்துரைக்கிறார்.",
      "கெஜு முறை வேட்பாளர்களின் நேரத்தையும் ஆற்றலையும் ஏகபோகமாக்கியது, எதேச்சதிகார சார்பு மதிப்புகளை ஊக்குவித்தது, படைப்பாற்றலை அடக்கியது என்று வாதிடப்படுகிறது. சீன எதேச்சதிகாரத்தின் வெற்றிக்கு கெஜு அமைப்பில் கன்பூசிய நூல்களைப் பயன்படுத்தியதன் காரணமாக இருக்கலாம் என்று கட்டுரை ஊகிக்கிறது."
    ],
    "commentSummary": [
      "இந்த கட்டுரை சமூக இயக்கம் மற்றும் குடும்ப முதலீடுகளில் சீனாவின் சிவில் சர்வீஸ் சோதனையான கெஜுவின் செல்வாக்கைப் பற்றி விவாதிக்கிறது, மேலும் பண்டைய மற்றும் நவீன தென் கொரியாவில் இதேபோன்ற தேர்வு முறைகளுடன் ஒப்பீடு செய்கிறது.",
      "இது இந்தியத் தேர்வுகளின் கௌரவத்தையும் வரலாற்றையும், பிரிட்டிஷ் கல்வி முறையுடன் அவற்றின் ஒற்றுமையையும் எடுத்துக்காட்டுகிறது, மேலும் ஹார்வர்ட் போன்ற மதிப்புமிக்க நிறுவனங்களில் சேர்வதில் உள்ள சிரமங்களைப் பற்றி விவாதிக்கிறது.",
      "சார்பு, நெட்வொர்க்கிங் மற்றும் வெற்றிக்கான வழக்கத்திற்கு மாறான பாதைகள் உள்ளிட்ட தொழில்நுட்பத் துறையில் கல்லூரி மற்றும் பாடத்திட்டம் சாரா செயல்பாடுகளின் முக்கியத்துவம் குறித்த விவாதத்துடன் கட்டுரை முடிவடைகிறது."
    ],
    "points": 136,
    "commentCount": 80,
    "retryCount": 0,
    "time": 1697903200
  },
  {
    "id": 37966367,
    "title": "18 கே ஸ்பியர் கேமராவைப் பயன்படுத்த 12 பேர் தேவை",
    "originLink": "https://petapixel.com/2023/10/20/darren-aronofsky-says-it-takes-12-people-to-use-the-18k-sphere-camera/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37966367",
    "commentBody": "",
    "originSummary": [
      "பிரபல திரைப்பட இயக்குனர் டேரன் அரோனோஃப்ஸ்கி தனது புதிய படமான 'போஸ்ட்கார்ட் ஃப்ரம் எர்த்' படத்திற்காக 'பிக் ஸ்கை' என்ற 18 கே சினிமா கேமராவைப் பயன்படுத்தினார். சுமார் 12 ஆபரேட்டர்கள் தேவைப்படும் கேமரா, நிலையான 4 கே கேமராக்களை விட 40 மடங்கு அதிக தெளிவுத்திறனை வழங்குகிறது.",
      "படம் வினாடிக்கு 60 பிரேம்களில் இயங்குகிறது, வழக்கமான இயக்க படங்களை விட இரண்டு மடங்கு வேகம், வினாடிக்கு சுமார் 32 ஜிபி தரவு விகிதம் மற்றும் மொத்த அளவு அரை பெட்டாபைட்.",
      "'போஸ்ட் கார்டு ஃப்ரம் எர்த்' இரண்டு ஆண்டுகளுக்கு லாஸ் வேகாஸில் உள்ள ஸ்பியர் அரங்கில் பிரத்யேகமாக திரையிடப்படும். அரங்கின் வலிமையான திரையில் படத்திற்கு பார்வையாளர்களின் எதிர்வினையைக் கண்டு அரோனோஃப்ஸ்கி தனது ஆச்சரியத்தை வெளிப்படுத்தினார்."
    ],
    "commentSummary": [
      "இந்த கட்டுரை 18 கே ஸ்பியர் கேமராவின் மேம்பட்ட அம்சங்களை எடுத்துக்காட்டுகிறது, அதாவது அதன் உயர் தெளிவுத்திறன், பிரேம் விகிதம், அலைவரிசை மற்றும் தரவு அளவு.",
      "இந்த கேமரா திரைப்பட உருவாக்கம், மெய்நிகர் ரியாலிட்டி (விஆர்) மற்றும் வீட்டு பார்க்கும் அனுபவங்களை எவ்வாறு புரட்சிகரமாக மாற்ற முடியும் என்பதை இது ஆராய்கிறது.",
      "விவாதங்கள் வெவ்வேறு வீடியோ பிரேம் விகிதங்களுக்கு இடையில் மாற்றுவதில் உள்ள சிக்கல்கள் மற்றும் சமரசங்களுக்கும் நீட்டிக்கப்படுகின்றன."
    ],
    "points": 134,
    "commentCount": 59,
    "retryCount": 0,
    "time": 1697892312
  },
  {
    "id": 37966767,
    "title": "நோர்வேயில் மோட்டார் எரிபொருள் விற்பனையில் எண்ணெய்க்கு முற்றுப்புள்ளி வைக்கும் மரணச் சுழல்",
    "originLink": "https://electrek.co/2023/10/20/cratering-motor-fuel-sales-in-norway-show-the-death-spiral-that-can-end-oil/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37966767",
    "commentBody": "",
    "originSummary": [
      "நார்வேயின் மோட்டார் எரிபொருள் விற்பனையில் கணிசமான சரிவுக்கு மின்சார வாகனங்களின் (எலெக்ட்ரிக் வாகனங்கள்) அதிக விற்பனையே காரணம், புதிய வாகன கொள்முதலில் 90% க்கும் அதிகமானவை மின்சார வாகனங்களாகும்.",
      "எண்ணெய் நுகர்வு குறைவது உலகளவில் எலெக்ட்ரிக் வாகன விற்பனை அதிகரிப்பதால் எண்ணெய் தொழில்துறைக்கு ஒரு சாத்தியமான வீழ்ச்சியை விளக்குகிறது மற்றும் புதிய பிரித்தெடுத்தல் நுட்பங்களை ஆராய்வதில் இருந்து எண்ணெய் நிறுவனங்களைத் தடுப்பதன் மூலம் சுற்றுச்சூழல் நன்மைகளை வழங்கக்கூடும்.",
      "நார்வேயில் அமல்படுத்தப்பட்ட சரியான எண்ணெய் விலை நிர்ணயம், நுகர்வோரை அதிக நிதி அறிவு மற்றும் சுற்றுச்சூழலுக்கு உகந்த முடிவுகளுக்கு ஊக்குவிக்கும், சந்தை தொடர்ந்து இயற்கையாக வளர்ந்தால் எண்ணெய் தொழில் வழக்கொழிந்த நிலைக்கு வழிவகுக்கும்."
    ],
    "commentSummary": [
      "நோர்வேயில் மின்சார வாகனங்களின் (எலெக்ட்ரிக் வாகனங்கள்) பயன்பாடு அதிகரிப்பு, மோட்டார் எரிபொருள் விற்பனை மற்றும் எரிவாயு நிலையங்கள் மூடல் குறைவதற்கு வழிவகுத்தது, இது எண்ணெய் தொழில்துறையை பாதிக்கும் என்பது விவாதிக்கப்பட்ட முக்கிய அம்சங்களில் அடங்கும்.",
      "மலிவு விலை எலெக்ட்ரிக் வாகனங்கள், குறிப்பாக மன்ஹாட்டன் மற்றும் புரூக்ளினில் ஈ.வி சார்ஜிங் நிலையங்களின் கிடைக்கும் தன்மை மற்றும் சாத்தியக்கூறுகள், நிலையான நகர்ப்புற சூழல்களை அடைதல் மற்றும் வீட்டு அடர்த்தியை அதிகரிப்பதன் நன்மைகள் குறித்து விவாதங்கள் நடந்தன.",
      "எலெக்ட்ரிக் வாகனங்களின் சுற்றுச்சூழல் விளைவுகள், அவற்றின் மறுசுழற்சி திறன், எரிப்பு இயந்திரங்களுடன் ஒப்பீடு மற்றும் நோர்வேயில் மின்சார வாகனங்களை பிரபலப்படுத்துவதில் மானியங்கள் மற்றும் வரி சலுகைகளின் பங்கு போன்ற தலைப்புகளும் விவாதிக்கப்படுகின்றன."
    ],
    "points": 121,
    "commentCount": 192,
    "retryCount": 0,
    "time": 1697896136
  },
  {
    "id": 37970325,
    "title": "பாலின பாகுபாடு வழக்கை இழந்த கூகிள் நிர்வாகத்திற்கு $ 1 மில்லியன் பாக்கி",
    "originLink": "https://www.theverge.com/2023/10/21/23926501/google-cloud-lawsuit-ulku-rowe-verdict",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37970325",
    "commentBody": "",
    "originSummary": [
      "உல்கு ரோவ் என்ற பெண் நிர்வாகி தாக்கல் செய்த வழக்கில், கூகிள் பாலியல் பாகுபாடு காட்டியதாகவும், குறைந்த அனுபவம் கொண்ட ஆண் சகாக்களுக்கு அதிக சம்பளத்துடன் ஆதரவளித்ததாகவும், புகார்களை வெளிப்படுத்தியதற்காக அவரது பதவி உயர்வுகளை மறுத்ததாகவும் கண்டறியப்பட்டுள்ளது.",
      "நடுவர் குழு ரோவுக்கு 1.1 மில்லியன் டாலர் இழப்பீடாக வழங்கியது, இது கூகுளுக்கு எதிரான தவறான குற்றச்சாட்டுகளின் சரிபார்ப்பு என்று அறிவித்தது, பணியிடத்தில் பாகுபாடு மற்றும் பழிவாங்கல் பொறுத்துக்கொள்ளப்படாது என்பதை சமிக்ஞை செய்தது.",
      "2018 ஆம் ஆண்டில் 20,000 க்கும் மேற்பட்ட கூகிள் ஊழியர்கள் ஒரு நிர்வாகிக்கு எதிரான பாலியல் குற்றச்சாட்டுகளைத் தொடர்ந்து மாற்றங்களைக் கோரி வெளிநடப்பு செய்ததைத் தொடர்ந்து இந்த வழக்கு வந்துள்ளது."
    ],
    "commentSummary": [
      "பதவி உயர்வுக்காக புறக்கணிக்கப்பட்டதாகக் கூறி, பாலின பாகுபாடு காட்டியதாக குற்றம் சாட்டிய முன்னாள் பெண் நிர்வாகிக்கு கூகிள் 1 மில்லியன் டாலர் வழங்க கட்டாயப்படுத்தப்பட்டது.",
      "இந்த வழக்கு பணி அமைப்புகளில் பாலின பாகுபாடு, நிர்வாகிகள் விளம்பர முடிவுகளை சவாலுக்கு உட்படுத்துவதற்கான திறன் மற்றும் அத்தகைய சந்தர்ப்பங்களில் சேதங்களை நிரூபிப்பதில் உள்ள சிரமங்கள் பற்றிய விவாதத்தைத் தூண்டியுள்ளது.",
      "இந்த விவாதம் பாலினம் மற்றும் இனவாதத்தின் வரையறைகள், ஆண்கள் இதேபோன்ற வழக்குகளை கொண்டு வருவதற்கான சாத்தியக்கூறுகள், சமத்துவத்திற்காக பேசும் தனிநபர்கள் அதிக உணர்திறன் கொண்டவர்கள் என்று முத்திரை குத்தப்படுவது குறித்த கவலைகளை வெளிப்படுத்தியது மற்றும் சமத்துவமின்மை விவாதங்களில் புறநிலை ஆதாரத்தின் அவசியத்தை வலியுறுத்தியது."
    ],
    "points": 120,
    "commentCount": 73,
    "retryCount": 0,
    "time": 1697921507
  }
]
