[
  {
    "id": 37967126,
    "title": "Mitä jokaisen kehittäjän tulisi tietää GPU-laskennasta",
    "originLink": "https://codeconfessions.substack.com/p/gpu-computing",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37967126",
    "commentBody": "",
    "originSummary": [
      "Tässä artikkelissa käsitellään yksityiskohtaisesti CPU:n (Central Processing Unit) ja GPU:n (Graphics Processing Unit) eroja, niiden arkkitehtuureja, suunnittelutavoitteita ja niiden merkitystä sovelluksissa, kuten syväoppimisessa.",
      "Keskustelussa käsitellään myös Littlen lakia, joka on tärkeä periaate jonoteoriassa, sekä GPU:iden ja CPU:iden kasvavaa suorituskykyeroa.",
      "GPU:iden monimutkaista arkkitehtuuria ja koodin optimoinnin tarvetta korostetaan, samoin kuin resurssien tehokkaan jakamisen tärkeyttä optimaalisen suorituskyvyn saavuttamiseksi. Keskeiset termit, kuten CUDA-ytimet, säikeiden lohkot ja datan kopiointi, selvitetään."
    ],
    "commentSummary": [
      "Artikkelissa käsitellään GPU-laskennan monimutkaisuutta ja korostetaan prosessoreiden, muistin käytön ja tehokkaan koodin optimoinnin ymmärtämisen tärkeyttä tällä alalla.",
      "Tutustutaan myös käsitteisiin, kuten nelikopterien ja lennokkien välisiin eroihin, Applen Silicon- ja Nvidian GPU-arkkitehtuureihin sekä liukulukujen käyttöön koneoppimisessa.",
      "Siinä korostetaan jatkuvan oppimisen hyötyjä ohjelmistoteollisuudessa, kiinalaisten yritysten kasvavaa vaikutusta GPU-markkinoilla sekä vaihtoehtoisten laitteistovaihtoehtojen harkitsemisen tärkeyttä koneoppimisessa ja GPU-laskennassa."
    ],
    "points": 433,
    "commentCount": 157,
    "retryCount": 0,
    "time": 1697899007
  },
  {
    "id": 37967936,
    "title": "FPGA N64",
    "originLink": "http://www.ultrafp64.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37967936",
    "commentBody": "",
    "originSummary": [
      "Viisi vuotta kehitteillä ollut ULTRA FP64 FPGA N64 -kotikonsoli on valmistumassa. Keskeiset komponentit, kuten CPU, TLB, FPU, välimuisti ja väyläsuunnittelu, on suunniteltu ja testattu onnistuneesti.",
      "Konsolissa on parannuksia, kuten parannettu muistin käyttömahdollisuus väyläsuunnittelun avulla ja parannettu tiedonkulku, jonka mahdollistaa RAM-ohjain, jossa on 2,2 gbitin läpäisykyky. Videoytimessä on skaalausyksikkö ja HDMI-lähtö, ja ääni toimitetaan myös HDMI-portin kautta.",
      "Projekti on saanut tukea N64Brew:lta ja useilta dekompilaattoritiimeiltä, mikä osoittaa, että konsolin kehityksen takana on aktiivinen ja sitoutunut yhteisö. Joitakin pieniä ongelmia, erityisesti RDP-ytimen kanssa, käsitellään edelleen."
    ],
    "commentSummary": [
      "Keskustelun pääpaino on hankkeissa, joissa optimoidaan Super Mario 64:n romhackit alkuperäisen Nintendo 64:n (N64) laitteistoon.",
      "Keskusteluissa käsitellään myös muita retropelijärjestelmiä, kuten MiSTer-järjestelmää, tulevia projekteja, kuten Analogue N64 FPGA-kloonia, MARSFPGA-konsolia ja FPGA-emulointia.",
      "Käyttäjät keskustelevat Nintendon konsoleiden pelinkehityskielestä (C), jakavat ehdotuksia FPGA-kehityslevyistä ja käsittelevät opetusresursseja, kuten nand2tetris ja Ben Eaterin projekteja."
    ],
    "points": 350,
    "commentCount": 73,
    "retryCount": 0,
    "time": 1697904105
  },
  {
    "id": 37971795,
    "title": "Startup CTO:n käsikirja",
    "originLink": "https://github.com/ZachGoldberg/Startup-CTO-Handbook",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37971795",
    "commentBody": "",
    "originSummary": [
      "\"The Startup CTO's Handbook\" on avoimen lähdekoodin kirja, jossa käsitellään johtajuuteen, johtamiseen ja ohjelmistotekniikkaan liittyviä aiheita teknologia-alan startup-yritysten johtajille.",
      "Kirja muunnetaan markdown-muotoon, ja sitä voi tarkastella ja muokata GitHubissa, mikä lisää saatavuutta ja yhteistyömahdollisuuksia.",
      "Kirjoittaja kehottaa osallistumaan ja antaa säännöt sisällön lisensoinnille ja käytölle, mikä edistää avointa ja osallistavaa luomisprosessia."
    ],
    "commentSummary": [
      "Keskustelussa pohditaan lähinnä kokousten tallentamisen hyviä ja huonoja puolia startup-ympäristössä, ja kannattajat mainitsevat, että se voi parantaa tuottavuutta ja avoimuutta, kun taas vastustajat ovat huolissaan suostumuksesta ja asianmukaisuudesta.",
      "Teknologiajohtajan (Chief Technology Officer, CTO) rooli ja haasteet ja yleinen skeptisyys sitä kohtaan sekä ohjelmistokehitystä ja IT-operaatioita yhdistävän DevOps-käytännön määritelmä ja tulkinta ovat muita merkittäviä keskustelunaiheita.",
      "Muita tärkeitä aiheita ovat muun muassa tekninen velka, termi, joka edustaa ylimääräisen uudelleentyöstön kustannuksia, jotka johtuvat siitä, että valitaan helppo ratkaisu nyt sen sijaan, että käytettäisiin parempaa lähestymistapaa, joka veisi pidempään, sekä neuvoja käynnistysvaiheen hallinnasta ja kattavan dokumentoinnin tärkeydestä."
    ],
    "points": 238,
    "commentCount": 54,
    "retryCount": 0,
    "time": 1697934587
  },
  {
    "id": 37969248,
    "title": "Mainosteknologian valvonta ja valtion valvonta ovat usein sama asia.",
    "originLink": "https://www.eff.org/deeplinks/2023/10/adtech-surveillance-and-government-surveillance-are-often-same-surveillance",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37969248",
    "commentBody": "",
    "originSummary": [
      "Rajanveto yritysten ja hallitusten harjoittaman valvonnan välillä on hämärtymässä, kun hallitukset ostavat henkilötietoja tiedonvälittäjiltä; nämä tiedot ovat alun perin peräisin kohdennetusta mainonnasta.",
      "Tämän käytännön ansiosta viranomaiset pääsevät käsiksi miljardien laitteiden tietoihin ilman etsintälupaa; älypuhelinsovellusten kehittäjät myyvät usein käyttäjätietoja jopa hallitukselle, mikä tekee ihmisistä alttiimpia seurannalle ja kohdentamiselle.",
      "Parhaillaan on käynnissä toimenpiteitä, joilla pyritään sulkemaan tietojenvälittäjien porsaanreikä ja säätämään kattavat kuluttajansuojalainsäädännöt, joilla varmistetaan yksilöiden yksityisyyden suoja."
    ],
    "commentSummary": [
      "Artikkelissa käsitellään mainosteknologian ja julkisen valvonnan yhtäläisyyksiä, tuodaan esiin huoli henkilötietojen hyväksikäytöstä ja vaaditaan sääntelytoimia matkapuhelinoperaattoreiden sijaintitietojen myyntiä vastaan.",
      "Artikkelissa korostetaan salauksen, vastuuvelvollisuuden, käyttäjille suunnatun riskivalistuksen ja parempien yksityisyydensuojatoimenpiteiden merkitystä, ja siinä esitellään \"AdInt\", joka on esimerkki valvontakäytännöistä, ja kritisoidaan teknologiajättejä Metaa ja Googlea niiden osuudesta mainosteknologiaan ja käyttäjätietojen myynnistä saatavasta voitosta.",
      "Se valottaa myös valvonnan mahdollisia haittavaikutuksia, kehittyneen teknologian väärinkäyttöä, henkilötietojen sääntelyn tarpeellisuutta, käyttäjien nimenomaista suostumusta sekä teknologiayritysten ja tiedonvälittäjien välistä yhteistyötä."
    ],
    "points": 237,
    "commentCount": 39,
    "retryCount": 0,
    "time": 1697912552
  },
  {
    "id": 37969387,
    "title": "Reddit modit dumppasivat poletteja tunteja ennen lohkoketjuohjelman lopettamista",
    "originLink": "https://cointelegraph.com/news/reddit-mods-dumped-tokens-hours-before-blockchain-program-termination",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37969387",
    "commentBody": "",
    "originSummary": [
      "Reddit on lopettanut lohkoketjupohjaisen yhteisöpisteohjelmansa skaalautuvuusongelmien vuoksi.",
      "On väitetty, että noin kolme Redditin moderaattoria myi kuponkiaan juuri ennen julkistusta, mahdollisesti sisäpiiritietoja käyttäen.",
      "Huolimatta kryptomarkkinoiden laskusuhdanteesta Tether, USDT-vakioidun kolikon taustalla oleva organisaatio, on kokenut varojensa ja luotonannon kasvaneen vuonna 2023. Se aikoo aloittaa varantotietojen jakamisen reaaliaikaisesti vuodesta 2024 alkaen."
    ],
    "commentSummary": [
      "Tekstin pääpaino on Redditissä käydyssä keskustelussa, jossa moderaattorit väitetään harjoittaneen sisäpiirikauppaa myymällä tokeneita, mikä herättää keskustelua arvopapereiden sääntelystä kryptovaluuttamarkkinoilla.",
      "Tekstissä käsitellään myös muita kryptovaluuttaan liittyviä kysymyksiä, kuten huijauksia, varkauksia ja kysymyksiä sen laillisuudesta valuuttana.",
      "Se sisältää kritiikkiä eri valuuttajärjestelmiä kohtaan, keskusteluja korruptiosta ja mainintoja Redditin havaitusta rappiosta foorumina samalla kun se nostaa esiin kongressin jäsenten laittoman kaupankäynnin aiheen."
    ],
    "points": 231,
    "commentCount": 138,
    "retryCount": 0,
    "time": 1697913525
  },
  {
    "id": 37966569,
    "title": "Pixel 8 Pron Tensor G3 siirtää kaikki generatiiviset tekoälytehtävät pilveen.",
    "originLink": "https://www.notebookcheck.net/MrWhosetheboss-video-reveals-Google-s-Pixel-8-Pro-Tensor-G3-off-loads-all-generative-AI-tasks-to-the-cloud.760215.0.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37966569",
    "commentBody": "",
    "originSummary": [
      "YouTuber @Mrwhosetheboss kritisoi Google Pixel 8 Pron Tensor G3 -prosessoria ja väittää, että toisin kuin Google markkinoi, laite vaatii jatkuvan internetyhteyden tiettyjä tekoälytoimintoja varten, mikä viittaa siihen, että se siirtää tekoälytehtävät pilveen.",
      "YouTuber huomauttaa, että Tensor G3 -piirin suorituskyky on odotettua hitaampi ja verrattavissa keskitason prosessoreihin, mikä kyseenalaistaa Googlen lippulaivaväitteet.",
      "Lisäksi Googlea arvostellaan siitä, että se esti arvioijia käyttämästä vertailusovelluksia arviointikiellon aikana, mikä olisi mahdollistanut objektiivisen suorituskyvyn arvioinnin."
    ],
    "commentSummary": [
      "Keskeinen keskustelu koskee generatiivisen tekoälyn valmiutta ja ominaisuuksia mobiililaitteissa, ja siinä keskitytään erityisesti Googlen Pixel 8 Pro -malliin ja sen Tensor G3 -piiriin.",
      "Sirun tehokkuus, Googlen väitteet sen suorituskyvystä ja huoli siitä, että tekoälytehtävien siirtäminen pilvipalveluun vaikuttaa käyttäjien yksityisyyteen, herättävät epäilyjä.",
      "Siinä mainitaan myös Qualcommin lopetettu tuki vanhemmille piirisarjoille ja laitteessa tapahtuvan tekoälyn käsittelyn rajoitukset, samalla kun siinä arvostellaan Googlea siitä, ettei se ole täyttänyt lupauksia, ja vaaditaan lisää avoimuutta ja pitkäaikaista tukea."
    ],
    "points": 226,
    "commentCount": 124,
    "retryCount": 0,
    "time": 1697894055
  },
  {
    "id": 37970484,
    "title": "Kanadassa on nykyään vähemmän yrittäjiä kuin 20 vuotta sitten.",
    "originLink": "https://www.cbc.ca/news/business/canada-entrepreneurs-shortage-solutions-1.7002171",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37970484",
    "commentBody": "",
    "originSummary": [
      "Business Development Bank of Canadan (BDC) raportti osoittaa, että yrittäjyys on vähentynyt huomattavasti viimeisten 20 vuoden aikana, ja yrittäjiä on 100 000 vähemmän huolimatta väestönkasvusta.",
      "BDC ehdottaa, että on kehitettävä \"pehmeitä taitoja\", kuten markkinointia, rahoitusta ja johtajuutta, jotta voidaan selviytyä yrityksen perustamiseen ja toimintaan liittyvistä haasteista.",
      "Vähenemiseen ovat vaikuttaneet muun muassa potentiaalisten perustajien vähenevä väestörakenne, matala työttömyys ja korkeat palkat sekä useat lannistavat tekijät liiketoimintaympäristössä. Ehdotuksia laskusuuntauksen kääntämiseksi ovat muun muassa yrittäjyysapurahat ja vanhempien, kokeneiden yrittäjien sitouttaminen."
    ],
    "commentSummary": [
      "Keskustelun aiheena on yrittäjyyden väheneminen Kanadassa, mikä johtuu muun muassa rajallisesta ymmärryksestä ja investointimahdollisuuksista, ahdistavasta liiketoimintaympäristöstä ja riskin välttämisestä.",
      "Korkeiden elinkustannusten, erityisesti asumiskustannusten, katsotaan haittaavan nuoria pyrkijöitä, ja keskustellaan hallinnon tehottomuudesta ja sen vaikutuksesta tuottavuuteen.",
      "Julkisen sektorin kasvuun, Kanadan imagoon ihanteellisena asuinpaikkana sekä maahanmuutto- ja verokysymyksiin liittyvät teemat nostetaan esiin, ja ne viittaavat siihen, että hallituksen on puututtava asumiseen ja rakentamiseen liittyviin asioihin."
    ],
    "points": 173,
    "commentCount": 237,
    "retryCount": 0,
    "time": 1697922755
  },
  {
    "id": 37967748,
    "title": "Ihmisen mikrobiomin myytit ja väärinkäsitykset",
    "originLink": "https://www.nature.com/articles/s41564-023-01426-7",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37967748",
    "commentBody": "",
    "originSummary": [
      "Artikkelissa käsitellään yleisiä myyttejä ja väärinkäsityksiä ihmisen mikrobiomitutkimuksesta, kuten uskomusta, että kyseessä on uusi ala, ja virheellisiä lukuja ihmisen ulosteessa olevista bakteerisoluista.",
      "Siinä käsitellään mikrobiomitutkimuksen rajoituksia, haastetaan suosittuja käsityksiä mikrobiomin roolista sairauksissa ja puolustetaan näyttöön perustuvia väitteitä.",
      "Lopputavoitteena on tarjota lukijoille tarkempi näkökulma ihmisen mikrobiomiin."
    ],
    "commentSummary": [
      "Artikkelissa tarkastellaan ihmisen mikrobiomiin liittyviä väärinkäsityksiä ja korostetaan sen monitahoista roolia terveyden ylläpitämisessä.",
      "Siinä korostetaan lisätutkimusten merkitystä mikrobiomin kaikkien mahdollisten vaikutusten selvittämiseksi ja käsitellään mikrobiomin nykyistä tutkimusta koskevaa kritiikkiä.",
      "Käymisteitse valmistettujen elintarvikkeiden suolistoterveyteen kohdistuvia myönteisiä vaikutuksia, kuten tulehduksen vähentämistä, korostetaan ja niitä tuetaan henkilökohtaisilla kokemuksilla ruokavalion muutoksista."
    ],
    "points": 173,
    "commentCount": 58,
    "retryCount": 0,
    "time": 1697903169
  },
  {
    "id": 37966485,
    "title": "Refaktoroinnilla on hintansa, refaktoroinnilla ei ole hintaa.",
    "originLink": "https://www.germanvelasco.com/blog/refactoring-is-a-habit",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37966485",
    "commentBody": "",
    "originSummary": [
      "Artikkelissa korostetaan refaktoroinnin keskeistä roolia kehitystyössä ja osoitetaan, että refaktoroinnin laiminlyönti korreloi ylläpitokustannusten kasvuun.",
      "Siinä väitetään, että jatkuvan refaktoroinnin puute aiheuttaa huonontuneen ja vaikeasti ylläpidettävän koodipohjan, jolloin ominaisuuksien lisääminen on riskialtista mahdollisten katkosten vuoksi.",
      "Artikkelin lopuksi todetaan, että olipa kyseessä säännöllinen refaktorointi tai roskien kasaantuminen, molemmilla on hintansa - täydellisen uudelleenkirjoittamisen hinta on kuitenkin korkeampi."
    ],
    "commentSummary": [
      "Artikkelissa korostetaan vanhentuneen tekniikan päivittämisen laiminlyönnin seurauksia, teknologiavelan käsittelyn tärkeyttä ja ylimmän johdon roolia päivitysten priorisoinnin tarpeellisuuden ymmärtämisessä.",
      "Tietoturvaryhmien osallistumista suositellaan haavoittuvuuksien korjaamiseen, mikä viittaa siihen, että uusien liiketoimintaominaisuuksien tarjoamisen ja teknisiin tehtäviin keskittymisen välillä on löydettävä tasapaino.",
      "Keskusteluissa käsitellään suunnittelun ja refaktoroinnin arvoa ohjelmistokehityksessä, mukaan lukien näkökulmat ulkoisten työkalujen, kuten IDE:n, käyttöön, järjestelmän uudelleenkirjoittamisen vaikutukset ja mahdollinen tarve muodolliselle teorialle ohjelmien organisoinnista."
    ],
    "points": 172,
    "commentCount": 151,
    "retryCount": 0,
    "time": 1697893334
  },
  {
    "id": 37970800,
    "title": "OpenRefine",
    "originLink": "https://openrefine.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37970800",
    "commentBody": "",
    "originSummary": [
      "OpenRefine on ilmainen, avoimen lähdekoodin työkalu järjestämättömän datan puhdistamiseen ja muuntamiseen, ja siinä on ominaisuuksia, kuten fasettien erottelu, klusterointi, täsmäytys ja rajoittamaton peruuttaminen/uudelleen tekeminen.",
      "Työkalu asettaa yksityisyyden suojan etusijalle puhdistamalla tiedot paikallisesti ja mahdollistaa tietojen laajentamisen verkkopalveluihin ja muihin ulkoisiin lähteisiin.",
      "Käyttäjät voivat lisäksi osallistua Wikidatan kehittämiseen ja käyttää lisäresursseja ja -asiakirjoja, mikä lisää sen hyödyllisyyttä ja yhteistoiminnallista luonnetta."
    ],
    "commentSummary": [
      "OpenRefine on työkalu, jota kehutaan sen tietojen puhdistus- ja yhdistämisominaisuuksista, erityisesti erilaisten ja löyhästi jäsenneltyjen tietolähteiden käsittelystä ja prosessin seurannasta.",
      "Käyttäjät keskustelevat vaihtoehtoisista työkaluista, kuten Exploratory.io:sta, ja mahdollisuudesta kehittää OpenRefineä uudelleen eri teknologioiden avulla.",
      "OpenRefinen kehitys on kuvattu, sen alkuajoista Freebase Gridworksistä Google Refineen ja lopulta OpenRefinen nykytilaan."
    ],
    "points": 162,
    "commentCount": 11,
    "retryCount": 0,
    "time": 1697925118
  },
  {
    "id": 37970572,
    "title": "Tietokoneiden väheneminen yleiskäyttöisenä teknologiana (2021).",
    "originLink": "https://cacm.acm.org/magazines/2021/3/250710-the-decline-of-computers-as-a-general-purpose-technology/fulltext",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37970572",
    "commentBody": "",
    "originSummary": [
      "Artikkelissa korostetaan yleissuorittimien kehityksen hidastumista, mikä johtaa siirtymiseen kohti erikoissuorittimia, kuten näytönohjaimia, niiden suorituskyky- ja energiatehokkuushyötyjen vuoksi.",
      "Tähän siirtymiseen liittyy kuitenkin haittoja, kuten korkeammat kustannukset, ohjelmoinnin monimutkaisuus ja mahdolliset esteet tietojenkäsittelyn yleiskehitykselle ja yleiskäyttöisten prosessoreiden tuotannon taloudellisuudelle.",
      "Lisäksi artikkelissa tarkastellaan tämän suuntauksen haasteita ja vaikutuksia, kuten kustannusten kasvua, pirstaloitumista, mahdollista vaikutusta työmarkkinoihin ja kilpailua, ja korostetaan uuden laskentamallin tarvetta."
    ],
    "commentSummary": [
      "Artikkelissa käsitellään tietokoneiden käytön vähenemistä yleismaailmallisena tekniikkana ja vedotaan siihen, että ohjelmistot eivät ole kyenneet luomaan tehokkaita välineitä niille, joilla ei ole ohjelmointitaitoja.",
      "Keskitytään mahdollisiin siirtymiin kohti automaatiota, tehostettuun koulutukseen skriptauksen ja data-analyysin parissa sekä kehittyvään suuntaukseen kohti erikoistuneita prosessoreita yleisten keskusyksiköiden (CPU) sijaan.",
      "Lisäksi käsitellään ohjelmistojen monimutkaista luonnetta, tietotekniikka-alustojen mahdollista pirstoutumista ja työllistymisen haasteita yhä automatisoidummassa teollisuudessa."
    ],
    "points": 160,
    "commentCount": 100,
    "retryCount": 0,
    "time": 1697923447
  },
  {
    "id": 37967751,
    "title": "Keju, Kiinan vaikea virkamiestesti",
    "originLink": "https://aeon.co/essays/why-chinese-minds-still-bear-the-long-shadow-of-keju",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37967751",
    "commentBody": "",
    "originSummary": [
      "Artikkelissa keskitytään Kiinan virkamiestutkinnon, Kejun, historialliseen vaikutukseen ja esitetään, että se edisti auktoriteettien kunnioittamista ja kollektivismia; sen poistaminen vuonna 1905 johti alueellisiin kapinoihin ja Qing-dynastian romahdukseen.",
      "Kirjoittaja vertaa Keju-järjestelmää länsimaiden virkamiestutkintoihin ja esittää, että presidentti Xi Jinpingin johtama Kiinan itsevaltius on vahvempi kuin Vladimir Putinin johtama Venäjän itsevaltius.",
      "Väitetään, että Keju-järjestelmä monopolisoi ehdokkaiden aikaa ja energiaa, edisti autokratiaa suosivia arvoja ja tukahdutti luovuuden. Artikkelissa arvellaan, että Kiinan itsevaltiuden menestys saattoi osittain johtua konfutselaisten tekstien käytöstä Keju-järjestelmässä."
    ],
    "commentSummary": [
      "Artikkelissa käsitellään Kiinan virkamiestutkinnon, Kejun, vaikutusta sosiaaliseen liikkuvuuteen ja perheinvestointeihin ja verrataan sitä muinaisen ja nykyisen Etelä-Korean vastaaviin tutkintojärjestelmiin.",
      "Siinä korostetaan intialaisten kokeiden arvostusta ja historiaa, niiden samankaltaisuutta brittiläisen koulutusjärjestelmän kanssa ja käsitellään vaikeuksia päästä Harvardin kaltaisiin arvostettuihin oppilaitoksiin.",
      "Lopuksi keskustellaan korkeakoulun ja koulun ulkopuolisten aktiviteettien merkityksestä teknologiateollisuudessa, mukaan lukien ennakkoluulot, verkostoituminen ja epätavanomaiset polut menestykseen."
    ],
    "points": 136,
    "commentCount": 80,
    "retryCount": 0,
    "time": 1697903200
  },
  {
    "id": 37966367,
    "title": "Tarvitaan 12 ihmistä käyttämään 18k Sphere-kameraa -",
    "originLink": "https://petapixel.com/2023/10/20/darren-aronofsky-says-it-takes-12-people-to-use-the-18k-sphere-camera/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37966367",
    "commentBody": "",
    "originSummary": [
      "Tunnettu elokuvantekijä Darren Aronofsky käytti uudessa elokuvassaan \"Postcard From Earth\" 18K-elokuvakameraa nimeltä \"Big Sky\". Noin 12 operaattoria vaativa kamera tarjoaa 40 kertaa suuremman resoluution kuin tavalliset 4K-kamerat.",
      "Elokuva toistuu 60 kuvan sekuntinopeudella, mikä on kaksinkertainen nopeus tavalliseen elokuvaan verrattuna, ja sen tiedonsiirtonopeus on noin 32 gigatavua sekunnissa ja kokonaiskoko puoli petatavua.",
      "Postcard From Earth -elokuvaa esitetään kahden vuoden ajan yksinoikeudella Las Vegasin Sphere-tapahtumapaikalla. Aronofsky kertoi hämmästyneensä yleisön reaktiosta elokuvaan Spheren valkokankaalla."
    ],
    "commentSummary": [
      "Artikkelissa korostetaan 18k Sphere -kameran kehittyneitä ominaisuuksia, kuten suurta resoluutiota, kuvataajuutta, kaistanleveyttä ja datakokoa.",
      "Siinä tutkitaan, miten tämä kamera voisi mullistaa elokuvien tekemisen, virtuaalitodellisuuden (VR) ja kotikatselun.",
      "Keskusteluissa käsitellään myös eri videokuvanopeuksien väliseen muuntamiseen liittyviä ongelmia ja kompromisseja."
    ],
    "points": 134,
    "commentCount": 59,
    "retryCount": 0,
    "time": 1697892312
  },
  {
    "id": 37966767,
    "title": "Polttoaineiden romahtava myynti Norjassa osoittaa, että öljyn loppuminen voi olla kuoleman kierre",
    "originLink": "https://electrek.co/2023/10/20/cratering-motor-fuel-sales-in-norway-show-the-death-spiral-that-can-end-oil/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37966767",
    "commentBody": "",
    "originSummary": [
      "Norjan polttoainemyynnin merkittävä lasku johtuu sähköajoneuvojen suuresta myynnistä, sillä yli 90 prosenttia uusien ajoneuvojen ostoista on sähköautoja.",
      "Öljynkulutuksen väheneminen on osoitus öljyteollisuuden mahdollisesta laskusta, kun sähköajoneuvojen myynti kasvaa maailmanlaajuisesti, ja se voi tuoda ympäristöhyötyjä, koska se saa öljy-yhtiöt luopumaan uusien louhintatekniikoiden etsimisestä.",
      "Norjassa toteutettu öljyn asianmukainen hinnoittelu voisi kannustaa kuluttajia tekemään taloudellisesti järkevämpiä ja ympäristöystävällisempiä päätöksiä, mikä saattaa johtaa öljyteollisuuden vanhentumiseen, jos markkinat jatkavat orgaanista kehitystään."
    ],
    "commentSummary": [
      "Keskeisiä keskustelunaiheita ovat muun muassa sähköajoneuvojen käytön lisääntyminen Norjassa, mikä johtaa polttoaineiden myynnin vähenemiseen ja huoltoasemien sulkemiseen, mikä saattaa vaikuttaa öljyteollisuuteen.",
      "Keskustelua käytiin kohtuuhintaisista sähköautoista, sähköautojen latausasemien saatavuudesta ja toteutettavuudesta erityisesti Manhattanilla ja Brooklynissa, kestävän kaupunkiympäristön saavuttamisesta ja asukastiheyden lisäämisen hyödyistä.",
      "Lisäksi käsitellään aiheita, kuten sähköautojen ympäristövaikutuksia, niiden kierrätysmahdollisuuksia, vertailua polttomoottoreihin sekä tukien ja verokannustimien merkitystä sähköautojen suosimisessa Norjassa."
    ],
    "points": 121,
    "commentCount": 192,
    "retryCount": 0,
    "time": 1697896136
  },
  {
    "id": 37970325,
    "title": "Google on johtajalle velkaa miljoona dollaria hävittyään sukupuolisyrjintää koskevan oikeusjutun",
    "originLink": "https://www.theverge.com/2023/10/21/23926501/google-cloud-lawsuit-ulku-rowe-verdict",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37970325",
    "commentBody": "",
    "originSummary": [
      "Naispuolisen johtajan Ulku Rowen nostamassa kanteessa Googlen on todettu syyllistyneen sukupuoliseen syrjintään, koska se on suosinut vähemmän kokeneita miespuolisia kollegojaan korkeammalla palkalla ja evännyt häneltä ylennykset valitusten esittämisen vuoksi.",
      "Valamiehistö myönsi Rowelle 1,1 miljoonan dollarin vahingonkorvaukset ja totesi tuomion vahvistavan Googlea vastaan esitetyt syytökset huonosta kohtelusta ja osoittavan, että syrjintää ja kostotoimia työpaikoilla ei suvaita.",
      "Tämä oikeusjuttu on seurausta vuonna 2018 järjestetystä joukkomielenosoituksesta, jossa yli 20 000 Googlen työntekijää käveli ulos vaatien muutoksia johtohenkilön seksuaalisen hyväksikäytön syytösten jälkeen."
    ],
    "commentSummary": [
      "Google velvoitettiin maksamaan miljoona dollaria entiselle naispuoliselle johtajalle, joka väitti, että häntä ei otettu huomioon ylennyskierroksilla.",
      "Tämä oikeusjuttu on herättänyt keskustelua sukupuoleen liittyvistä ennakkoluuloista työympäristössä, johtajien mahdollisuudesta kyseenalaistaa ylennyspäätökset ja vahingonkorvausten osoittamisen vaikeudesta tällaisissa tapauksissa.",
      "Keskustelussa on myös pohdittu seksismin ja rasismin määritelmiä, miesten mahdollisuutta nostaa vastaavia kanteita, ilmaistu huoli siitä, että tasa-arvon puolesta puhuvia henkilöitä pidetään liian herkkähipiäisinä, ja korostettu objektiivisen todistusaineiston tarpeellisuutta eriarvoisuutta koskevissa keskusteluissa."
    ],
    "points": 120,
    "commentCount": 73,
    "retryCount": 0,
    "time": 1697921507
  }
]
