[
  {
    "id": 37967126,
    "title": "Her geliştiricinin GPU bilişim hakkında bilmesi gerekenler",
    "originLink": "https://codeconfessions.substack.com/p/gpu-computing",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37967126",
    "commentBody": "",
    "originSummary": [
      "Bu makale CPU (Merkezi İşlem Birimi) ve GPU (Grafik İşlem Birimi) arasındaki farkları, mimarilerini, tasarım hedeflerini ve derin öğrenme gibi uygulamalardaki önemlerini detaylandırmaktadır.",
      "Tartışma ayrıca kuyruk teorisinde önemli bir ilke olan Little yasasını ve GPU'lar ile CPU'lar arasındaki artan performans farkını da kapsıyor.",
      "GPU'ların karmaşık mimarisi ve kod optimizasyonu ihtiyacı, optimum performans için etkili kaynak tahsisinin temelleri ile birlikte vurgulanmaktadır. CUDA çekirdekleri, iş parçacığı blokları ve veri kopyalama gibi temel terminolojiler açıklanmaktadır."
    ],
    "commentSummary": [
      "Makale, GPU hesaplamanın karmaşıklığını tartışmakta ve bu alanda CPU'ları, bellek kullanımını ve verimli kod optimizasyonunu anlamanın önemini vurgulamaktadır.",
      "Quadcopter ve drone'lar arasındaki farklar, Apple Silicon ve Nvidia GPU mimarileri ve makine öğreniminde float kullanımı gibi kavramlar da incelenmiştir.",
      "Yazılım endüstrisinde sürekli öğrenmenin faydalarını, Çinli şirketlerin GPU pazarındaki artan etkisini ve makine öğrenimi ve GPU hesaplama için alternatif donanım seçeneklerini değerlendirmenin önemini vurguluyor."
    ],
    "points": 433,
    "commentCount": 157,
    "retryCount": 0,
    "time": 1697899007
  },
  {
    "id": 37967936,
    "title": "FPGA N64",
    "originLink": "http://www.ultrafp64.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37967936",
    "commentBody": "",
    "originSummary": [
      "Beş yıldır geliştirme aşamasında olan ULTRA FP64 FPGA N64 ev konsolu tamamlanmak üzere. CPU, TLB, FPU, önbellek ve veri yolu tasarımları gibi temel bileşenler tasarlandı ve başarıyla test edildi.",
      "Konsol, veri yolu tasarımı aracılığıyla artırılmış bellek erişimi ve 2,2 gbit verimliliğe sahip bir RAM denetleyicisi tarafından sağlanan gelişmiş veri akışı gibi geliştirmelere sahiptir. Video çekirdeğinde bir ölçeklendirme birimi ve HDMI çıkışı bulunurken, ses de HDMI bağlantı noktası üzerinden iletiliyor.",
      "Proje, N64Brew ve çeşitli derleyici ekiplerinden destek alarak konsolun geliştirilmesinin arkasında aktif ve ilgili bir topluluk olduğunu vurgulamıştır. Özellikle RDP çekirdeği ile ilgili bazı küçük sorunlar hala ele alınmaktadır."
    ],
    "commentSummary": [
      "Konuşmanın ana odak noktası, Super Mario 64'ü orijinal Nintendo 64 (N64) donanımında romhack çalıştıracak şekilde optimize eden projelerdir.",
      "Tartışmalar ayrıca MiSTer sistemi, Analogue N64 FPGA klonu, MARSFPGA konsolu ve FPGA emülasyonu gibi yaklaşan projeler de dahil olmak üzere diğer retro oyun sistemlerini de kapsıyor.",
      "Kullanıcılar Nintendo konsolları için oyun geliştirme dilini (C) tartışıyor, FPGA geliştirme kartları için önerilerini paylaşıyor ve nand2tetris ve Ben Eater'ın projeleri gibi eğitim kaynaklarına değiniyor."
    ],
    "points": 350,
    "commentCount": 73,
    "retryCount": 0,
    "time": 1697904105
  },
  {
    "id": 37971795,
    "title": "Startup CTO'sunun El Kitabı",
    "originLink": "https://github.com/ZachGoldberg/Startup-CTO-Handbook",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37971795",
    "commentBody": "",
    "originSummary": [
      "\"The Startup CTO's Handbook\", teknoloji girişimlerindeki liderler için liderlik, yönetim ve yazılım mühendisliği konularını ele alan açık kaynaklı bir kitaptır.",
      "Kitap markdown formatına dönüştürülüyor ve GitHub'da görüntülenebilir ve düzenlenebilir hale getirilerek erişilebilirlik ve işbirliği potansiyeli artırılıyor.",
      "Yazar, katkıları davet eder ve açık ve kapsayıcı bir yaratım sürecini teşvik ederek içerik lisanslama ve kullanım kuralları sağlar."
    ],
    "commentSummary": [
      "Söylem, öncelikle bir startup ortamında toplantıları kaydetmenin artılarını ve eksilerini tartışıyor; destekçiler daha fazla üretkenlik ve şeffaflık potansiyelinden bahsederken, karşıtlar rıza ve uygunluk konusundaki endişelerini dile getiriyor.",
      "Baş Teknoloji Sorumlusu'nun (CTO) rolü ve zorlukları ve buna yönelik yaygın şüpheciliğin yanı sıra yazılım geliştirme ve BT operasyonlarını birleştiren bir uygulama olan DevOps'un tanımı ve yorumlanması da diğer önemli tartışma noktalarıdır.",
      "Diğer ilgili konular arasında, daha uzun sürecek daha iyi bir yaklaşım kullanmak yerine şimdi kolay çözümü seçmenin neden olduğu ek yeniden çalışmanın zımni maliyetini temsil eden bir terim olan teknoloji borcu, başlangıç yönetimi tavsiyeleri ve kapsamlı dokümantasyonun önemi yer alıyor."
    ],
    "points": 238,
    "commentCount": 54,
    "retryCount": 0,
    "time": 1697934587
  },
  {
    "id": 37969248,
    "title": "Reklam teknolojisi gözetimi ve devlet gözetimi genellikle aynıdır",
    "originLink": "https://www.eff.org/deeplinks/2023/10/adtech-surveillance-and-government-surveillance-are-often-same-surveillance",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37969248",
    "commentBody": "",
    "originSummary": [
      "Hükümetlerin kişisel verileri veri simsarlarından satın almasıyla kurumsal ve hükümet gözetimi arasındaki çizgi azalıyor; bu veriler aslında hedefli reklamcılık endüstrisinden kaynaklanıyor.",
      "Bu uygulama, hükümet organlarının arama emri gerektirmeden milyarlarca cihazdaki bilgilere erişmesine olanak tanıyor; akıllı telefon uygulama geliştiricileri genellikle kullanıcı verilerini hükümete bile satıyor ve bu da insanları gözetleme ve hedeflemeye daha açık hale getiriyor.",
      "Veri simsarı boşluğunun kapatılması ve bireylerin mahremiyetinin korunmasını sağlayacak kapsamlı tüketici veri gizliliği yasalarının çıkarılması için tedbirler alınmaktadır."
    ],
    "commentSummary": [
      "Makale, reklam teknolojisi ve devlet gözetimi arasındaki benzerlikleri tartışıyor, kişisel verilerin istismarına ilişkin endişeleri dile getiriyor ve hücresel taşıyıcılar tarafından konum verilerinin satışına karşı düzenleyici önlemler alınması çağrısında bulunuyor.",
      "Şifreleme, hesap verebilirlik, risk konusunda kullanıcı eğitimi ve gelişmiş gizlilik önlemlerinin önemini vurgulayan makale, teknoloji devleri Meta ve Google'ı adtech'teki rolleri ve kullanıcı verilerinin satışından elde ettikleri kazanç nedeniyle eleştirmek için gözetim uygulamalarına bir örnek olan \"AdInt \"i tanıtıyor.",
      "Ayrıca gözetimin potansiyel olumsuz etkilerine, ileri teknolojinin kötüye kullanımına, kişisel veri düzenlemesinin gerekliliğine, açık kullanıcı rızasına ve teknoloji firmaları ile veri simsarları arasındaki işbirliğine de ışık tutuyor."
    ],
    "points": 237,
    "commentCount": 39,
    "retryCount": 0,
    "time": 1697912552
  },
  {
    "id": 37969387,
    "title": "Reddit modları, blockchain programının sonlandırılmasından saatler önce tokenleri çöpe attı",
    "originLink": "https://cointelegraph.com/news/reddit-mods-dumped-tokens-hours-before-blockchain-program-termination",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37969387",
    "commentBody": "",
    "originSummary": [
      "Reddit, ölçeklenebilirlik sorunları nedeniyle blok zinciri tabanlı topluluk puan programını durdurdu.",
      "Yaklaşık üç Reddit moderatörünün, muhtemelen içeriden bilgi kullanarak, duyurudan hemen önce tokenlarını sattığına dair iddialar var.",
      "Kripto piyasalarındaki gerilemeye rağmen, USDT stablecoin'in arkasındaki kuruluş olan Tether, 2023'te varlıklarında ve borç vermede bir büyüme yaşadı. Rezerv verilerini 2024'ten itibaren gerçek zamanlı olarak paylaşmaya başlamayı planlıyor."
    ],
    "commentSummary": [
      "Metnin ana odağı, Reddit'te moderatörlerin token satarak içeriden bilgi ticareti yaptıkları iddiasıyla kripto para piyasasında menkul kıymetlerin düzenlenmesine ilişkin tartışmalara yol açan bir konuşma.",
      "Metin ayrıca dolandırıcılık, hırsızlık ve bir para birimi olarak meşruiyetine ilişkin sorular gibi kripto para birimiyle ilgili diğer konuları da ele almaktadır.",
      "Çeşitli para sistemlerinin eleştirilerini, yolsuzluk tartışmalarını ve Reddit'in bir platform olarak algılanan düşüşünden bahsederken, kongre üyelerinin yasadışı ticaret faaliyetleri konusunu vurguluyor."
    ],
    "points": 231,
    "commentCount": 138,
    "retryCount": 0,
    "time": 1697913525
  },
  {
    "id": 37966569,
    "title": "Pixel 8 Pro'nun Tensor G3'ü tüm üretken yapay zeka görevlerini buluta yüklüyor",
    "originLink": "https://www.notebookcheck.net/MrWhosetheboss-video-reveals-Google-s-Pixel-8-Pro-Tensor-G3-off-loads-all-generative-AI-tasks-to-the-cloud.760215.0.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37966569",
    "commentBody": "",
    "originSummary": [
      "YouTuber @Mrwhosetheboss, Google Pixel 8 Pro'nun Tensor G3 işlemcisini eleştirerek, Google'ın pazarlamasının aksine, cihazın belirli AI işlevleri için sürekli bir internet bağlantısı gerektirdiğini ve AI görevlerini buluta yüklediğini ima ettiğini savunuyor.",
      "YouTuber, Tensor G3 çipinin performansının beklenenden daha yavaş ve orta sınıf işlemcilerle karşılaştırılabilir olduğuna dikkat çekerek Google'ın amiral gemisi iddialarını sorguluyor.",
      "Google ayrıca, inceleme ambargosu süresi boyunca, objektif performans değerlendirmesine olanak tanıyabilecek kıyaslama uygulamalarını incelemecilerin kullanmasını engellediği için de eleştiriliyor."
    ],
    "commentSummary": [
      "Temel tartışma, özellikle Google'ın Pixel 8 Pro ve Tensor G3 çipine odaklanarak, mobil cihazlarda üretken yapay zekanın hazırlığı ve yetenekleri hakkındadır.",
      "Çipin verimliliğine ilişkin şüpheler, Google'ın performansına ilişkin iddiaları ve yapay zeka görevlerinin buluta aktarılmasının kullanıcı gizliliğini etkilemesine ilişkin endişeler var.",
      "Ayrıca Qualcomm'un eski yonga setleri için desteğini kesmesinden ve cihaz üzerinde yapay zeka işlemenin sınırlamalarından bahsederken, Google'ı verdiği sözleri yerine getirmediği için eleştiriyor ve daha fazla şeffaflık ve uzun vadeli destek talep ediyor."
    ],
    "points": 226,
    "commentCount": 124,
    "retryCount": 0,
    "time": 1697894055
  },
  {
    "id": 37970484,
    "title": "Kanada'da bugün 20 yıl öncesine göre daha az girişimci var",
    "originLink": "https://www.cbc.ca/news/business/canada-entrepreneurs-shortage-solutions-1.7002171",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37970484",
    "commentBody": "",
    "originSummary": [
      "Kanada İş Geliştirme Bankası (BDC) raporu, artan nüfusa rağmen 100.000 daha az girişimci ile son 20 yılda girişimcilikte gözle görülür bir düşüş olduğunu göstermektedir.",
      "BDC, bir işletmenin kurulması ve işletilmesindeki zorlukların üstesinden gelmek için pazarlama, finans ve liderlik gibi \"sosyal becerilerin\" geliştirilmesinin gerekliliğini öne sürmektedir.",
      "Düşüşe katkıda bulunan faktörler arasında potansiyel kurucu demografisinin azalması, yüksek ücretlerle düşük işsizlik ve iş ortamındaki çeşitli cesaret kırıcı faktörler yer almaktadır. Düşüş eğilimini tersine çevirmeye yönelik öneriler arasında girişimcilik bursları ve daha yaşlı, deneyimli girişimcilerin katılımı yer almaktadır."
    ],
    "commentSummary": [
      "Söylem, sınırlı anlayış ve yatırım fırsatları, baskıcı bir iş ortamı ve riskten kaçınma eğilimleri gibi faktörler nedeniyle Kanada'da girişimciliğin azalmasına odaklanmaktadır.",
      "Yüksek yaşam giderleri, özellikle de konut maliyetleri, genç adaylar için bir engel olarak görülmekte; hükümetin verimsizliği ve bunların üretkenlik üzerindeki etkileri tartışılmaktadır.",
      "Artan kamu sektörü büyümesi, Kanada'nın ideal bir yaşam yeri olarak imajı ve göç ve vergilendirme konuları, konut ve inşaat konularında hükümet müdahalesine ihtiyaç duyulduğuna işaret etmektedir."
    ],
    "points": 173,
    "commentCount": 237,
    "retryCount": 0,
    "time": 1697922755
  },
  {
    "id": 37967748,
    "title": "İnsan mikrobiyomu mitleri ve yanılgıları",
    "originLink": "https://www.nature.com/articles/s41564-023-01426-7",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37967748",
    "commentBody": "",
    "originSummary": [
      "Makale, yeni bir alan olduğu inancı ve insan dışkısındaki bakteri hücreleriyle ilgili yanlış rakamlar da dahil olmak üzere, insan mikrobiyomu araştırmalarıyla ilgili yaygın mitleri ve yanlış anlamaları hedef alıyor.",
      "Mikrobiyom araştırmalarındaki sınırlamaları tartışmakta, mikrobiyomun hastalıktaki rolüne ilişkin popüler kavramlara meydan okumakta ve kanıta dayalı iddiaları savunmaktadır.",
      "Nihai hedef, okuyuculara insan mikrobiyomu hakkında daha doğru bir bakış açısı sağlamaktır."
    ],
    "commentSummary": [
      "Makale, insan mikrobiyomuna ilişkin yanlış anlamaları ele alarak, sağlığın korunmasındaki rolünün çok yönlü doğasını vurguluyor.",
      "Mikrobiyomun tam potansiyel etkisini keşfetmek için daha fazla araştırma yapılmasının önemini vurgulamakta ve mevcut mikrobiyom araştırmalarına yönelik eleştirileri ele almaktadır.",
      "Fermente gıdaların inflamasyonu azaltmak gibi gastrointestinal sağlık üzerindeki yararlı etkileri vurgulanmakta ve diyet değişikliklerine ilişkin kişisel deneyimlerle desteklenmektedir."
    ],
    "points": 173,
    "commentCount": 58,
    "retryCount": 0,
    "time": 1697903169
  },
  {
    "id": 37966485,
    "title": "Yeniden düzenlemenin bir bedeli vardır, yeniden düzenlememenin bir bedeli yoktur",
    "originLink": "https://www.germanvelasco.com/blog/refactoring-is-a-habit",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37966485",
    "commentBody": "",
    "originSummary": [
      "Makale, yeniden düzenlemenin geliştirmedeki önemli rolünü vurgulamakta ve yeniden düzenlememenin bakım maliyetlerinin artmasıyla ilişkili olduğunu belirtmektedir.",
      "Sürekli yeniden düzenleme eksikliğinin, bozulmuş ve bakımı zor bir kod tabanına neden olduğunu ve potansiyel kırılmalar nedeniyle özellik eklemelerini riskli hale getirdiğini savunuyor.",
      "Makale, ister düzenli refactoring'i tercih edin ister cruft birikimine izin verin, her ikisinin de bir maliyeti olduğu, ancak tamamen yeniden yazmanın maliyetinin daha yüksek olduğu fikriyle sona eriyor."
    ],
    "commentSummary": [
      "Makale, eski teknolojiyi güncellemeyi ihmal etmenin sonuçlarını vurgulayarak, teknoloji borcuyla başa çıkmanın önemini ve üst düzey liderliğin bu tür güncellemelere öncelik verme ihtiyacını anlamadaki rolünü vurguluyor.",
      "Güvenlik açıklarının ele alınmasına yardımcı olmak için siber güvenlik ekiplerinin katılımı önerilmekte ve yeni iş özellikleri sunmak ile teknik görevlere odaklanmak arasında bir denge kurulması gerektiği belirtilmektedir.",
      "Tartışmalar, IDE gibi harici araçların kullanımına ilişkin bakış açıları, bir sistemi yeniden yazmanın etkileri ve program organizasyonuna ilişkin resmi bir teoriye duyulan potansiyel ihtiyaç da dahil olmak üzere yazılım geliştirmede tasarım ve yeniden düzenlemenin değeri etrafında dönmektedir."
    ],
    "points": 172,
    "commentCount": 151,
    "retryCount": 0,
    "time": 1697893334
  },
  {
    "id": 37970800,
    "title": "OpenRefine",
    "originLink": "https://openrefine.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37970800",
    "commentBody": "",
    "originSummary": [
      "OpenRefine, faceting, kümeleme, mutabakat ve sınırsız geri alma/yineleme gibi özellikleriyle organize edilmemiş verileri temizlemek ve dönüştürmek için ücretsiz, açık kaynaklı bir araçtır.",
      "Araç, verileri yerel olarak temizleyerek gizliliğe öncelik verir ve web hizmetleri ve diğer harici kaynaklarla veri uzantısına izin verir.",
      "Kullanıcılar ayrıca Vikiveri'ye katkıda bulunabilir ve ekstra kaynaklara ve belgelere erişebilir, bu da Vikiveri'nin faydasını ve işbirlikçi doğasını geliştirir."
    ],
    "commentSummary": [
      "OpenRefine, süreci takip ederken özellikle farklı ve gevşek yapılandırılmış veri kaynaklarını ele alan veri temizleme ve birleştirme yetenekleriyle övülen bir araçtır.",
      "Kullanıcılar Exploratory.io gibi alternatif araçları ve OpenRefine'i farklı teknolojilerle yeniden geliştirme olasılığını tartışıyor.",
      "OpenRefine'in Freebase Gridworks olarak ortaya çıkışından Google Refine'a ve son olarak OpenRefine olarak günümüzdeki haline kadar geçirdiği evrim not edilmiştir."
    ],
    "points": 162,
    "commentCount": 11,
    "retryCount": 0,
    "time": 1697925118
  },
  {
    "id": 37970572,
    "title": "Genel amaçlı bir teknoloji olarak bilgisayarların düşüşü (2021)",
    "originLink": "https://cacm.acm.org/magazines/2021/3/250710-the-decline-of-computers-as-a-general-purpose-technology/fulltext",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37970572",
    "commentBody": "",
    "originSummary": [
      "Makale, genel amaçlı CPU'lardaki ilerlemenin yavaşladığını, bunun da performans ve güç verimliliği avantajları için GPU'lar gibi özel işlemcilere doğru bir kaymaya yol açtığını vurguluyor.",
      "Ancak, bu değişimin daha yüksek maliyetler, programlama karmaşıklığı ve bilgi işlem ve evrensel işlemci üretim ekonomisindeki genel gelişime olası engeller gibi dezavantajları vardır.",
      "Makale ayrıca, artan maliyetler, parçalanma, iş piyasaları üzerindeki potansiyel etki ve rekabet dahil olmak üzere bu eğilimin zorluklarını ve sonuçlarını inceleyerek yeni bir hesaplama modeline duyulan ihtiyacı vurgulamaktadır."
    ],
    "commentSummary": [
      "Makalede, bilgisayarların evrensel bir teknoloji olarak kullanımındaki azalma ele alınmakta ve yazılımın programlama becerisi olmayanlar için etkili araçlar yaratmadaki başarısızlığına değinilmektedir.",
      "Otomasyona yönelik potansiyel değişimlere, komut dosyası oluşturma ve veri analizi konusunda gelişmiş eğitime ve evrensel Merkezi İşlem Birimleri (CPU'lar) yerine özel işlemcilere yönelik ortaya çıkan eğilime odaklanılıyor.",
      "Ayrıca yazılımın karmaşık doğası, bilgi işlem platformlarının olası parçalanması ve giderek otomatikleşen bir endüstride istihdamın zorlukları da tartışılmaktadır."
    ],
    "points": 160,
    "commentCount": 100,
    "retryCount": 0,
    "time": 1697923447
  },
  {
    "id": 37967751,
    "title": "Keju, Çin'in zorlu kamu hizmeti sınavı",
    "originLink": "https://aeon.co/essays/why-chinese-minds-still-bear-the-long-shadow-of-keju",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37967751",
    "commentBody": "",
    "originSummary": [
      "Makale, Çin'in kamu hizmeti sınavı olan Keju'nun tarihsel etkisine odaklanarak, bu sınavın otoriteye itaati ve kolektivizmi teşvik ettiğini; 1905 yılında kaldırılmasının bölgesel isyanlara ve Qing hanedanının çöküşüne yol açtığını öne sürüyor.",
      "Yazar, Keju sistemini Batı'daki kamu hizmeti sınavlarıyla karşılaştırıyor ve Çin'in Başkan Xi Jinping yönetimindeki otokrasisinin Vladimir Putin yönetimindeki Rusya'dan daha güçlü olduğunu öne sürüyor.",
      "Keju sisteminin adayların zamanını ve enerjisini tekelleştirdiği, otokrasi yanlısı değerleri teşvik ettiği ve yaratıcılığı bastırdığı savunulmaktadır. Makale, Çin otokrasisinin başarısının kısmen Keju sisteminde Konfüçyüsçü metinlerin kullanılmasından kaynaklanabileceğini tahmin etmektedir."
    ],
    "commentSummary": [
      "Makale, Çin'in kamu hizmeti sınavı Keju'nun sosyal hareketlilik ve aile yatırımları üzerindeki etkisini tartışmakta ve eski ve modern Güney Kore'deki benzer sınav sistemleriyle karşılaştırmalar yapmaktadır.",
      "Hindistan'daki sınavların prestijini ve tarihini, İngiliz eğitim sistemine benzerliğini vurgulamakta ve Harvard gibi prestijli kurumlara kabul edilmenin zorluklarını tartışmaktadır.",
      "Yazı, önyargı, ağ oluşturma ve başarıya giden alışılmadık yollar gibi konular da dahil olmak üzere, teknoloji sektöründe üniversite ve müfredat dışı faaliyetlerin önemi üzerine bir tartışmayla sona eriyor."
    ],
    "points": 136,
    "commentCount": 80,
    "retryCount": 0,
    "time": 1697903200
  },
  {
    "id": 37966367,
    "title": "18k Sphere kamerayı kullanmak için 12 kişi gerekiyor",
    "originLink": "https://petapixel.com/2023/10/20/darren-aronofsky-says-it-takes-12-people-to-use-the-18k-sphere-camera/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37966367",
    "commentBody": "",
    "originSummary": [
      "Ünlü film yapımcısı Darren Aronofsky, yeni filmi 'Postcard From Earth' için 'Big Sky' adlı 18K sinema kamerasını kullandı. Yaklaşık 12 operatör gerektiren kamera, standart 4K kameralardan 40 kat daha fazla çözünürlük sunuyor.",
      "Film, saniyede 60 kare hızında, tipik sinema filmlerinin iki katı hızında, saniyede yaklaşık 32 GB veri hızında ve toplam boyutu yarım petabayt olacak şekilde oynatılıyor.",
      "'Postcard From Earth' iki yıl boyunca sadece Las Vegas'taki Sphere salonunda gösterilecek. Aronofsky, mekanın müthiş ekranında seyircinin filme verdiği tepkiden duyduğu şaşkınlığı dile getirdi."
    ],
    "commentSummary": [
      "Makalede 18k Sphere kameranın yüksek çözünürlük, kare hızı, bant genişliği ve veri boyutu gibi gelişmiş özellikleri vurgulanıyor.",
      "Bu kameranın film yapımında, sanal gerçeklikte (VR) ve evde izleme deneyimlerinde nasıl devrim yaratabileceğini araştırıyor.",
      "Tartışmalar ayrıca farklı video kare hızları arasında dönüştürme ile ilgili karmaşıklıkları ve uzlaşmaları da kapsamaktadır."
    ],
    "points": 134,
    "commentCount": 59,
    "retryCount": 0,
    "time": 1697892312
  },
  {
    "id": 37966767,
    "title": "Norveç'te düşen motorlu yakıt satışları petrolün sonunu getirebilecek ölüm sarmalını gösteriyor",
    "originLink": "https://electrek.co/2023/10/20/cratering-motor-fuel-sales-in-norway-show-the-death-spiral-that-can-end-oil/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37966767",
    "commentBody": "",
    "originSummary": [
      "Norveç'in motorlu yakıt satışlarındaki önemli düşüş, yeni araç alımlarının %90'ından fazlasının elektrikli olması nedeniyle elektrikli araçların (EV) yüksek satış oranlarına bağlanmaktadır.",
      "Petrol tüketimindeki düşüş, elektrikli araç satışları küresel olarak arttıkça petrol endüstrisi için potansiyel bir düşüşü göstermektedir ve petrol şirketlerini yeni çıkarma tekniklerini keşfetmekten caydırarak çevresel faydalar sağlayabilir.",
      "Norveç'te uygulandığı gibi uygun petrol fiyatlandırması, tüketicileri mali açıdan daha anlayışlı ve çevre dostu kararlar almaya teşvik edebilir ve pazar organik olarak gelişmeye devam ederse petrol endüstrisini muhtemelen tükenmeye doğru götürebilir."
    ],
    "commentSummary": [
      "Tartışılan kilit noktalar arasında Norveç'te elektrikli araç (EV) kullanımının artması, motorlu yakıt satışlarının azalmasına ve benzin istasyonlarının kapanmasına yol açarak petrol endüstrisini potansiyel olarak etkilemesi yer alıyor.",
      "Uygun fiyatlı elektrikli araçlar, özellikle Manhattan ve Brooklyn'de elektrikli araç şarj istasyonlarının mevcudiyeti ve fizibilitesi, sürdürülebilir kentsel çevreler elde etme ve konut yoğunluğunu artırmanın faydaları üzerine tartışmalar yapıldı.",
      "Elektrikli araçların çevresel etkileri, geri dönüşüm potansiyelleri, içten yanmalı motorlarla karşılaştırılması ve Norveç'te elektrikli araçların yaygınlaştırılmasında sübvansiyonların ve vergi teşviklerinin rolü gibi konular da tartışılmaktadır."
    ],
    "points": 121,
    "commentCount": 192,
    "retryCount": 0,
    "time": 1697896136
  },
  {
    "id": 37970325,
    "title": "Google, cinsiyet ayrımcılığı davasını kaybeden yöneticisine 1 milyon dolar borçlu",
    "originLink": "https://www.theverge.com/2023/10/21/23926501/google-cloud-lawsuit-ulku-rowe-verdict",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37970325",
    "commentBody": "",
    "originSummary": [
      "Bir kadın yönetici olan Ülkü Rowe tarafından açılan davada Google, daha az deneyimli erkek meslektaşlarını daha yüksek ücretle kayırdığı ve şikayetlerini dile getirdiği için terfisini reddettiği için cinsel ayrımcılıktan suçlu bulundu.",
      "Jüri Rowe'u 1,1 milyon dolar tazminata mahkum ederken, kararı Google'a yönelik kötü muamele iddialarının doğrulanması olarak müjdeledi ve işyerinde ayrımcılık ve misillemeye müsamaha gösterilmeyeceğinin sinyalini verdi.",
      "Bu dava, 2018 yılında bir yöneticiye yönelik cinsel saldırı iddialarının ardından 20,000'den fazla Google çalışanının değişiklik talebiyle iş bıraktığı kitlesel bir protestonun ardından geldi."
    ],
    "commentSummary": [
      "Google, terfilerde göz ardı edildiğini belirterek cinsiyet ayrımcılığı yapıldığını iddia eden eski bir kadın yöneticiye 1 milyon dolar ödemek zorunda kaldı.",
      "Bu dava, çalışma ortamlarındaki cinsiyet önyargısı, yöneticilerin terfi kararlarına itiraz etme potansiyeli ve bu tür durumlarda zararların kanıtlanmasının zorlukları hakkında tartışmalara neden oldu.",
      "Tartışmada ayrıca cinsiyetçilik ve ırkçılık tanımları, erkeklerin benzer davalar açma olasılığı sorgulandı, eşitlik için sesini yükselten bireylerin aşırı hassas olarak etiketlenmesine ilişkin endişeler dile getirildi ve eşitsizlik tartışmalarında nesnel kanıtların gerekliliği vurgulandı."
    ],
    "points": 120,
    "commentCount": 73,
    "retryCount": 0,
    "time": 1697921507
  }
]
