[
  {
    "id": 37967126,
    "title": "Det alle utviklere bør vite om GPU-databehandling",
    "originLink": "https://codeconfessions.substack.com/p/gpu-computing",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37967126",
    "commentBody": "",
    "originSummary": [
      "Denne artikkelen beskriver forskjellene mellom CPU (Central Processing Unit) og GPU (Graphics Processing Unit), deres arkitekturer, designmål og deres betydning i applikasjoner som dyp læring.",
      "Diskusjonen tar også for seg Littles lov - et viktig prinsipp innen køteori - og den økende ytelsesforskjellen mellom GPU-er og CPU-er.",
      "GPU-enes komplekse arkitektur og behovet for kodeoptimalisering understrekes, sammen med viktigheten av effektiv ressursallokering for optimal ytelse. Sentrale begreper som CUDA-kjerner, trådblokker og datakopiering forklares."
    ],
    "commentSummary": [
      "Artikkelen tar for seg kompleksiteten i GPU-databehandling og understreker viktigheten av å forstå CPU-er, minnebruk og effektiv kodeoptimalisering på dette feltet.",
      "Konsepter som forskjeller mellom quadcopters og droner, Apple Silicon vs. Nvidia GPU-arkitekturer og bruk av floats i maskinlæring blir også utforsket.",
      "Den legger vekt på fordelene ved kontinuerlig læring i programvarebransjen, kinesiske selskapers økende innflytelse på GPU-markedet og viktigheten av å vurdere alternative maskinvarealternativer for maskinlæring og GPU-databehandling."
    ],
    "points": 433,
    "commentCount": 157,
    "retryCount": 0,
    "time": 1697899007
  },
  {
    "id": 37967936,
    "title": "FPGA N64",
    "originLink": "http://www.ultrafp64.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37967936",
    "commentBody": "",
    "originSummary": [
      "Hjemmekonsollen ULTRA FP64 FPGA N64, som har vært under utvikling i fem år, nærmer seg ferdigstillelse. Nøkkelkomponenter som CPU, TLB, FPU, hurtigbuffer og busskonstruksjoner har blitt designet og testet med suksess.",
      "Konsollen har forbedringer som økt minnetilgang via bussdesignet og forbedret dataflyt takket være en RAM-kontroller med 2,2 gbit gjennomstrømning. Videokjernen har en skaleringsenhet og HDMI-utgang, og lyd leveres også via HDMI-porten.",
      "Prosjektet har fått støtte fra N64Brew og ulike dekompilerteam, noe som viser at det er et aktivt og engasjert miljø som står bak utviklingen av konsollen. Noen mindre problemer, spesielt med RDP-kjernen, er fortsatt under utbedring."
    ],
    "commentSummary": [
      "Hovedfokuset i samtalen er på prosjekter som optimaliserer Super Mario 64 til å kjøre romhacks på den originale Nintendo 64-maskinvaren (N64).",
      "Diskusjonene omfatter også andre retrospillsystemer, inkludert MiSTer-systemet, kommende prosjekter som Analogue N64 FPGA-klonen, MARSFPGA-konsollen og FPGA-emulering.",
      "Brukerne diskuterer spillutviklingsspråk (C) for Nintendo-konsoller, deler forslag til FPGA-utviklingskort og tar for seg pedagogiske ressurser som nand2tetris og Ben Eaters prosjekter."
    ],
    "points": 350,
    "commentCount": 73,
    "retryCount": 0,
    "time": 1697904105
  },
  {
    "id": 37971795,
    "title": "Håndbok for nystartede teknologidirektører",
    "originLink": "https://github.com/ZachGoldberg/Startup-CTO-Handbook",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37971795",
    "commentBody": "",
    "originSummary": [
      "\"The Startup CTO's Handbook\" er en bok med åpen kildekode som tar for seg temaer innen ledelse, management og programvareteknikk for ledere i nystartede teknologibedrifter.",
      "Boken konverteres til markdown-format og er tilgjengelig for visning og redigering på GitHub, noe som øker tilgjengeligheten og samarbeidspotensialet.",
      "Forfatteren inviterer til bidrag og gir regler for lisensiering og bruk av innhold, noe som fremmer en åpen og inkluderende skapelsesprosess."
    ],
    "commentSummary": [
      "Diskusjonen dreier seg først og fremst om fordeler og ulemper ved å ta opp møter i oppstartsmiljøer. Tilhengerne fremhever potensialet for økt produktivitet og åpenhet, mens motstanderne uttrykker bekymring for samtykke og hensiktsmessighet.",
      "Rollen og utfordringene til en Chief Technology Officer (CTO) og den utbredte skepsisen til dette, samt definisjonen og tolkningen av DevOps, en praksis som kombinerer programvareutvikling og IT-drift, er andre viktige diskusjonspunkter.",
      "Andre relevante temaer er tech debt, et begrep som representerer den implisitte kostnaden for ekstra omarbeiding forårsaket av at man velger den enkle løsningen nå i stedet for å bruke en bedre tilnærming som tar lengre tid, råd om oppstartsledelse og viktigheten av omfattende dokumentasjon."
    ],
    "points": 238,
    "commentCount": 54,
    "retryCount": 0,
    "time": 1697934587
  },
  {
    "id": 37969248,
    "title": "Adtech-overvåking og myndighetsovervåking er ofte det samme",
    "originLink": "https://www.eff.org/deeplinks/2023/10/adtech-surveillance-and-government-surveillance-are-often-same-surveillance",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37969248",
    "commentBody": "",
    "originSummary": [
      "Grensen mellom bedriftsovervåking og myndighetsovervåking er i ferd med å viskes ut i takt med at myndighetene kjøper personopplysninger fra datameglere, som opprinnelig kommer fra den målrettede reklamebransjen.",
      "Denne praksisen gjør det mulig for myndighetene å få tilgang til informasjon på milliarder av enheter uten at det kreves en fullmakt. Utviklere av smarttelefonapper selger ofte brukerdata, også til myndighetene, noe som gjør folk mer utsatt for overvåking og målretting.",
      "Det er satt i gang tiltak for å tette smutthullet for datameglere og innføre omfattende personvernlover som sikrer at personvernet til enkeltpersoner blir ivaretatt."
    ],
    "commentSummary": [
      "Artikkelen diskuterer likhetene mellom reklameteknologi og myndighetsovervåking, uttrykker bekymring for utnyttelse av personopplysninger og etterlyser regulatoriske tiltak mot mobiloperatørers salg av lokasjonsdata.",
      "Artikkelen understreker viktigheten av kryptering, ansvarlighet, brukeropplæring om risiko og forbedrede personverntiltak, og introduserer \"AdInt\", et eksempel på overvåkningspraksis, for å kritisere teknologigigantene Meta og Google for deres rolle i adtech og for å tjene penger på salg av brukerdata.",
      "Den belyser også potensielle skadevirkninger av overvåking, misbruk av avansert teknologi, behovet for regulering av personopplysninger, eksplisitt brukersamtykke og samarbeid mellom teknologiselskaper og datameglere."
    ],
    "points": 237,
    "commentCount": 39,
    "retryCount": 0,
    "time": 1697912552
  },
  {
    "id": 37969387,
    "title": "Reddit-mods dumpet tokens timer før blokkjedeprogrammet ble avsluttet",
    "originLink": "https://cointelegraph.com/news/reddit-mods-dumped-tokens-hours-before-blockchain-program-termination",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37969387",
    "commentBody": "",
    "originSummary": [
      "Reddit har avviklet sitt blokkjede-baserte poengprogram på grunn av skalerbarhetsproblemer.",
      "Det er påstander om at rundt tre Reddit-moderatorer solgte tokens rett før kunngjøringen, muligens ved hjelp av innsideinformasjon.",
      "Til tross for en nedgang i kryptomarkedene har Tether, organisasjonen bak stablecoinen USDT, opplevd en vekst i eiendeler og utlån i 2023. De planlegger å begynne å dele reservedata i sanntid fra 2024."
    ],
    "commentSummary": [
      "Hovedfokuset i teksten er en samtale på Reddit om moderatorer som angivelig skal ha drevet innsidehandel ved å selge tokens, noe som utløste en debatt om reguleringen av verdipapirer i kryptovalutamarkedet.",
      "Teksten tar også opp andre problemstillinger knyttet til kryptovaluta, som svindel, tyveri og spørsmål om kryptovalutaens legitimitet som valuta.",
      "Den inneholder blant annet kritikk av ulike valutasystemer, diskusjoner om korrupsjon og omtale av Reddits forfall som plattform, samtidig som kongressmedlemmenes ulovlige handelsvirksomhet blir tatt opp."
    ],
    "points": 231,
    "commentCount": 138,
    "retryCount": 0,
    "time": 1697913525
  },
  {
    "id": 37966569,
    "title": "Tensor G3 i Pixel 8 Pro overfører alle generative AI-oppgaver til skyen.",
    "originLink": "https://www.notebookcheck.net/MrWhosetheboss-video-reveals-Google-s-Pixel-8-Pro-Tensor-G3-off-loads-all-generative-AI-tasks-to-the-cloud.760215.0.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37966569",
    "commentBody": "",
    "originSummary": [
      "YouTuber @Mrwhosetheboss kritiserer Tensor G3-prosessoren i Google Pixel 8 Pro og hevder at enheten, i motsetning til Googles markedsføring, krever en konstant internettforbindelse for visse AI-funksjoner, noe som innebærer at den overlater AI-oppgavene til skyen.",
      "YouTuberen påpeker at ytelsen til Tensor G3-brikken er langsommere enn forventet og kan sammenlignes med mellomklasseprosessorer, noe som setter spørsmålstegn ved Googles flaggskipspåstander.",
      "I tillegg kritiseres Google for å ha hindret anmelderne i å bruke referanseapper i løpet av embargoperioden, noe som kunne ha muliggjort en objektiv vurdering av ytelsen."
    ],
    "commentSummary": [
      "Den viktigste diskusjonen handler om beredskapen og mulighetene for generativ AI på mobile enheter, med særlig fokus på Googles Pixel 8 Pro og Tensor G3-brikken.",
      "Det hersker tvil om brikkens effektivitet, Googles påstander om ytelsen og bekymring for at overføring av AI-oppgaver til skyen vil påvirke brukernes personvern.",
      "Den nevner også Qualcomms avbrutte støtte for eldre brikkesett og begrensningene i enhetens AI-prosessering, samtidig som den kritiserer Google for ikke å holde det de har lovet, og krever mer åpenhet og langsiktig støtte."
    ],
    "points": 226,
    "commentCount": 124,
    "retryCount": 0,
    "time": 1697894055
  },
  {
    "id": 37970484,
    "title": "Canada har færre gründere i dag enn for 20 år siden.",
    "originLink": "https://www.cbc.ca/news/business/canada-entrepreneurs-shortage-solutions-1.7002171",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37970484",
    "commentBody": "",
    "originSummary": [
      "Rapporten fra Business Development Bank of Canada (BDC) viser en merkbar nedgang i entreprenørskap de siste 20 årene, med 100 000 færre entreprenører til tross for en voksende befolkning.",
      "BDC peker på nødvendigheten av å utvikle \"myke ferdigheter\" som markedsføring, økonomi og lederskap for å takle utfordringene ved å starte og drive en bedrift.",
      "Faktorer som bidrar til nedgangen er blant annet en synkende demografi av potensielle grundere, lav arbeidsledighet med høye lønninger og flere demotiverende faktorer i næringslivet. Blant forslagene for å snu den nedadgående trenden er stipendier for entreprenørskap og engasjement av eldre, erfarne gründere."
    ],
    "commentSummary": [
      "Diskusjonen dreier seg om nedgangen i entreprenørskap i Canada, som skyldes faktorer som begrenset forståelse og investeringsmuligheter, et undertrykkende forretningsmiljø og tendenser til risikoaversjon.",
      "Høye levekostnader, spesielt boligkostnader, blir sett på som et hinder for unge aspiranter, og ineffektivitet i offentlig sektor og dens innvirkning på produktiviteten blir diskutert.",
      "Temaer som økende vekst i offentlig sektor, Canadas image som et ideelt sted å bo og spørsmål om innvandring og beskatning tas opp, noe som peker mot et behov for statlig inngripen i bolig- og byggesaker."
    ],
    "points": 173,
    "commentCount": 237,
    "retryCount": 0,
    "time": 1697922755
  },
  {
    "id": 37967748,
    "title": "Myter og misforståelser om det humane mikrobiomet",
    "originLink": "https://www.nature.com/articles/s41564-023-01426-7",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37967748",
    "commentBody": "",
    "originSummary": [
      "Artikkelen retter søkelyset mot vanlige myter og misforståelser om forskning på menneskets mikrobiom, blant annet troen på at det er et nytt felt og feilaktige tall om bakterieceller i menneskelig avføring.",
      "Den diskuterer begrensninger i mikrobiomforskningen, utfordrer populære forestillinger om mikrobiomets rolle i sykdom og tar til orde for evidensbaserte påstander.",
      "Det endelige målet er å gi leserne et mer nøyaktig perspektiv på menneskets mikrobiom."
    ],
    "commentSummary": [
      "Artikkelen tar for seg misoppfatninger om menneskets mikrobiom og understreker den mangesidige rollen mikrobiomet spiller for å opprettholde helsen.",
      "Den fremhever viktigheten av videre forskning for å utforske mikrobiomets fulle potensial og tar opp kritikk av dagens mikrobiomforskning.",
      "De gunstige effektene fermentert mat har på mage- og tarmhelsen, for eksempel ved å redusere betennelser, understrekes og underbygges av personlige erfaringer med kostholdsendringer."
    ],
    "points": 173,
    "commentCount": 58,
    "retryCount": 0,
    "time": 1697903169
  },
  {
    "id": 37966485,
    "title": "Refaktorering har en pris, men ikke refaktorering har en kostnad",
    "originLink": "https://www.germanvelasco.com/blog/refactoring-is-a-habit",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37966485",
    "commentBody": "",
    "originSummary": [
      "Artikkelen understreker den viktige rollen som refaktorering spiller i utviklingsarbeidet, og viser at manglende refaktorering er forbundet med økte vedlikeholdskostnader.",
      "Det argumenteres for at mangel på kontinuerlig refaktorering fører til en forringet kodebase som er vanskelig å vedlikeholde, noe som gjør det risikabelt å legge til nye funksjoner på grunn av potensielle brudd.",
      "Artikkelen konkluderer med at det koster penger i begge tilfeller, enten man velger vanlig refaktorering eller tillater opphopning av råstoff - men at kostnaden ved en fullstendig omskriving er høyere."
    ],
    "commentSummary": [
      "Artikkelen legger vekt på konsekvensene av å ikke oppdatere utdatert teknologi, og understreker viktigheten av å håndtere teknologisk gjeld og toppledelsens rolle når det gjelder å forstå behovet for å prioritere slike oppdateringer.",
      "Det anbefales å involvere cybersikkerhetsteam for å håndtere sårbarheter, noe som tyder på at det er behov for en balanse mellom å levere nye forretningsfunksjoner og å fokusere på tekniske oppgaver.",
      "Diskusjonene dreier seg om verdien av design og refaktorering i programvareutvikling, inkludert perspektiver på bruk av eksterne verktøy som IDE, implikasjonene av å skrive om et system og det potensielle behovet for en formell teori om programorganisering."
    ],
    "points": 172,
    "commentCount": 151,
    "retryCount": 0,
    "time": 1697893334
  },
  {
    "id": 37970800,
    "title": "OpenRefine",
    "originLink": "https://openrefine.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37970800",
    "commentBody": "",
    "originSummary": [
      "OpenRefine er et gratis verktøy med åpen kildekode for rensing og omforming av uorganiserte data, med funksjoner som fasettering, klyngedannelse, avstemming og ubegrenset angre/gjenopprett.",
      "Verktøyet prioriterer personvern ved å rense data lokalt og tillater datautvidelse med nettjenester og andre eksterne kilder.",
      "Brukerne kan i tillegg bidra til Wikidata og få tilgang til ekstra ressurser og dokumenter, noe som øker nytteverdien og samarbeidskarakteren."
    ],
    "commentSummary": [
      "OpenRefine er et verktøy som har fått mye skryt for sin evne til å rense og konsolidere data, spesielt når det gjelder håndtering av ulike og løst strukturerte datakilder og sporing av prosessen.",
      "Brukerne diskuterer alternative verktøy som Exploratory.io og muligheten for å videreutvikle OpenRefine med andre teknologier.",
      "Utviklingen av OpenRefine er beskrevet, fra opprinnelsen som Freebase Gridworks, til Google Refine, og til slutt til dagens OpenRefine."
    ],
    "points": 162,
    "commentCount": 11,
    "retryCount": 0,
    "time": 1697925118
  },
  {
    "id": 37970572,
    "title": "Datamaskinens tilbakegang som generell teknologi (2021)",
    "originLink": "https://cacm.acm.org/magazines/2021/3/250710-the-decline-of-computers-as-a-general-purpose-technology/fulltext",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37970572",
    "commentBody": "",
    "originSummary": [
      "Artikkelen fremhever den langsomme utviklingen av generelle prosessorer, noe som fører til en overgang til spesialiserte prosessorer som GPU-er på grunn av ytelses- og energieffektivitetsfordeler.",
      "Dette skiftet har imidlertid ulemper som høyere kostnader, mer komplisert programmering og mulige hindringer for den generelle utviklingen innen databehandling og økonomien i produksjonen av universelle prosessorer.",
      "Videre undersøker artikkelen utfordringene og konsekvensene av denne trenden, inkludert økte kostnader, fragmentering, potensielle effekter på arbeidsmarkedet og konkurranse, og understreker behovet for en ny beregningsmodell."
    ],
    "commentSummary": [
      "Artikkelen diskuterer nedgangen i bruken av datamaskiner som universell teknologi, og viser til at programvare ikke klarer å skape effektive verktøy for dem som ikke har programmeringsferdigheter.",
      "Det fokuseres på den potensielle utviklingen i retning av automatisering, forbedret opplæring i skripting og dataanalyse, og den nye trenden med spesialiserte prosessorer i stedet for universelle CPU-er (Central Processing Units).",
      "I tillegg diskuteres programvarens komplekse natur, mulig fragmentering av dataplattformer og utfordringer knyttet til sysselsetting i en stadig mer automatisert industri."
    ],
    "points": 160,
    "commentCount": 100,
    "retryCount": 0,
    "time": 1697923447
  },
  {
    "id": 37967751,
    "title": "Keju, Kinas vanskeligste prøve for offentlig ansatte",
    "originLink": "https://aeon.co/essays/why-chinese-minds-still-bear-the-long-shadow-of-keju",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37967751",
    "commentBody": "",
    "originSummary": [
      "Artikkelen fokuserer på den historiske virkningen av Keju, Kinas embetsmannseksamen, og antyder at den fremmet autoritetstro og kollektivisme, og at avskaffelsen av den i 1905 førte til regionale opprør og Qing-dynastiets sammenbrudd.",
      "Forfatteren sammenligner Keju-systemet med embetsmannseksamener i Vesten og antyder at Kinas autokrati under president Xi Jinping er sterkere enn Russlands under Vladimir Putin.",
      "Det hevdes at Keju-systemet monopoliserte kandidatenes tid og energi, fremmet autokratiske verdier og undertrykte kreativitet. Artikkelen antar at det kinesiske autokratiets suksess delvis kan skyldes bruken av konfucianske tekster i Keju-systemet."
    ],
    "commentSummary": [
      "Artikkelen diskuterer hvilken innflytelse Kinas embetsmannsprøve, Keju, har hatt på sosial mobilitet og familieinvesteringer, og sammenligner med tilsvarende prøvesystemer i det gamle og det moderne Sør-Korea.",
      "Den belyser prestisjen og historien til indiske eksamener, deres likhet med det britiske utdanningssystemet, og diskuterer vanskelighetene med å komme inn på prestisjefylte institusjoner som Harvard.",
      "Artikkelen avsluttes med en debatt om viktigheten av college og fritidsaktiviteter i teknologibransjen, inkludert spørsmål om fordommer, nettverksbygging og ukonvensjonelle veier til suksess."
    ],
    "points": 136,
    "commentCount": 80,
    "retryCount": 0,
    "time": 1697903200
  },
  {
    "id": 37966367,
    "title": "Det kreves 12 personer for å bruke 18k Sphere-kameraet.",
    "originLink": "https://petapixel.com/2023/10/20/darren-aronofsky-says-it-takes-12-people-to-use-the-18k-sphere-camera/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37966367",
    "commentBody": "",
    "originSummary": [
      "Den anerkjente filmskaperen Darren Aronofsky brukte et 18K kinokamera, kalt \"Big Sky\", til sin nye film \"Postcard From Earth\". Kameraet, som krever ca. 12 operatører, har en oppløsning som er 40 ganger høyere enn vanlige 4K-kameraer.",
      "Filmen spilles av med 60 bilder i sekundet, dobbelt så raskt som vanlige kinofilmer, med en datahastighet på ca. 32 GB i sekundet og en total størrelse på en halv petabyte.",
      "\"Postcard From Earth\" skal vises eksklusivt på Sphere i Las Vegas i to år. Aronofsky forteller at han ble overrasket over publikums reaksjon på filmen på stedets formidable lerret."
    ],
    "commentSummary": [
      "Artikkelen fremhever de avanserte egenskapene til 18k Sphere-kameraet, som høy oppløsning, bildefrekvens, båndbredde og datastørrelse.",
      "Den utforsker hvordan dette kameraet kan revolusjonere filmproduksjon, virtuell virkelighet (VR) og filmopplevelser i hjemmet.",
      "Diskusjonene omfatter også kompleksiteten og kompromissene knyttet til konvertering mellom ulike bildefrekvenser."
    ],
    "points": 134,
    "commentCount": 59,
    "retryCount": 0,
    "time": 1697892312
  },
  {
    "id": 37966767,
    "title": "Sviktende salg av drivstoff i Norge viser dødsspiralen som kan sette en stopper for oljen.",
    "originLink": "https://electrek.co/2023/10/20/cratering-motor-fuel-sales-in-norway-show-the-death-spiral-that-can-end-oil/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37966767",
    "commentBody": "",
    "originSummary": [
      "Norges betydelige nedgang i drivstoffsalget skyldes det høye salget av elbiler, der over 90 % av nybilsalget er elektrisk.",
      "Nedgangen i oljeforbruket illustrerer en potensiell nedtur for oljeindustrien etter hvert som elbilsalget øker globalt, og kan gi miljøfordeler ved å avskrekke oljeselskapene fra å utforske nye utvinningsteknikker.",
      "Riktig oljeprising, slik som i Norge, kan oppmuntre forbrukerne til å ta mer økonomiske og miljøvennlige beslutninger, noe som kan føre til at oljeindustrien blir overflødig hvis markedet fortsetter å utvikle seg organisk."
    ],
    "commentSummary": [
      "Blant de viktigste punktene som ble diskutert, var økningen i bruken av elbiler i Norge, som fører til en nedgang i salg av drivstoff og nedleggelse av bensinstasjoner, noe som kan påvirke oljebransjen.",
      "Det ble debattert om elbiler til en overkommelig pris, tilgjengeligheten og gjennomførbarheten av ladestasjoner for elbiler, særlig på Manhattan og i Brooklyn, bærekraftige bymiljøer og fordelene ved å øke boligtettheten.",
      "Temaer som elbilens miljøeffekter, resirkuleringspotensial, sammenligning med forbrenningsmotorer og hvilken rolle subsidier og skatteinsentiver spiller for elbilens popularitet i Norge, blir også diskutert."
    ],
    "points": 121,
    "commentCount": 192,
    "retryCount": 0,
    "time": 1697896136
  },
  {
    "id": 37970325,
    "title": "Google skylder leder 1 million dollar etter å ha tapt søksmål om kjønnsdiskriminering",
    "originLink": "https://www.theverge.com/2023/10/21/23926501/google-cloud-lawsuit-ulku-rowe-verdict",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37970325",
    "commentBody": "",
    "originSummary": [
      "I et søksmål fra Ulku Rowe, en kvinnelig leder, har Google blitt funnet skyldig i seksuell diskriminering ved å ha favorisert mindre erfarne mannlige kolleger med høyere lønn og nektet henne forfremmelse fordi hun hadde klaget.",
      "Juryen tilkjente Rowe 1,1 millioner dollar i erstatning, og uttalte at dommen var en bekreftelse på anklagene om mishandling mot Google og et signal om at diskriminering og gjengjeldelse på arbeidsplassen ikke vil bli tolerert.",
      "Søksmålet kommer etter en masseprotest i 2018, da over 20 000 Google-ansatte gikk ut og krevde endringer i kjølvannet av anklager om seksuelle overgrep mot en leder."
    ],
    "commentSummary": [
      "Google ble pålagt å betale 1 million dollar til en tidligere kvinnelig leder som hevdet at hun ble forbigått ved forfremmelser.",
      "Søksmålet har ført til en diskusjon om kjønnsdiskriminering i arbeidslivet, muligheten for ledere til å utfordre forfremmelsesbeslutninger og vanskelighetene med å dokumentere skader i slike tilfeller.",
      "Debatten har også stilt spørsmål ved definisjonene av sexisme og rasisme, muligheten for at menn kan gå til søksmål, uttrykt bekymring for at personer som tar til orde for likestilling, blir stemplet som overfølsomme, og understreket nødvendigheten av objektive bevis i diskusjoner om ulikhet."
    ],
    "points": 120,
    "commentCount": 73,
    "retryCount": 0,
    "time": 1697921507
  }
]
