[
  {
    "title": "SK Government Plans 710 Billion Won Investment to Boost Hyundai Mipo Dockyard's Market Share.",
    "originLink": "https://www.chosun.com/economy/economy_general/2023/11/15/L2DDYB3ZYBGHXA5RQMHHECCTD4/",
    "originBody": "",
    "originSummary": [
      "The South Korean government will invest 710 billion won ($607 million) by 2028 to increase Hyundai Mipo Dockyard's market share in eco-friendly and smart shipbuilding from 56% to over 80%.",
      "The investment will focus on commercializing decarbonization fuel technologies like LNG, ammonia, and hydrogen, aiming for a 90-100% domesticization rate for ship parts and becoming a global leader in LNG and ammonia-powered ships by 2030.",
      "The government plans to support autonomous ships, digitalization of shipyards, export guarantees, and establish an eco-friendly ship fuel supply network, designating Ulsan Port as a key supply port. The increasing demand for eco-friendly ships is driven by the International Maritime Organization's commitment to zero greenhouse gas emissions in the shipping industry by 2050. However, China is rapidly catching up with a 44% market share in low-carbon ships."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700054291350
  },
  {
    "title": "'2023 친환경건설산업대상' 국토부 장관상에 현대건설…총 10개사 수상 영예 (Translation: \"Hyundai Construction receives the Ministry of Land, Infrastructure and Transport award at the '2023 Environmental Construction Industry Awards'; a total of 10 companies honored\")",
    "originLink": "https://economist.co.kr/article/view/ecn202311150048",
    "originBody": "",
    "originSummary": [
      "Hyundai Construction and LX Hausys were recognized at the 2023 Environmental Construction Industry Awards in Seoul for their efforts in eco-friendly construction and technology development.",
      "The awards ceremony acknowledges and promotes sustainable practices and innovation within the construction industry.",
      "This event highlights the growing importance of environmentally-friendly approaches in construction and the dedication of companies to making a positive impact on the environment."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700054291350
  },
  {
    "title": "전기차 배터리 소재 업체 거듭나는 고려아연… 친환경 ‘올인원 니켈 제련소’ 기공식 고려아연이 친환경적인 올인원 니켈 제련소 기공식을 진행했다. 이 제련소는 전기차 배터리 소재인 니켈을 효율적으로 제조하는데 사용될 예정이다. 해당 소재는 전기차 업계에서 중요한 역할을 한다. 고려아연은 전기차 시장 성장에 대비한 친환경적인 기술 개발에 힘을 쏟고 있으며, 전기차 분야에서 경쟁력을 갖추고자 한다. 이러한 성과로 고려아연은 미래 전기차 시장에서 큰 성공을 기대할 수 있다. 전기차 산업의 성장에 대응하여 배터리 제조 기술을 개선하는 것은 매우 중요한 일이다. 고려아연의 친환경적인 기술 개발은 전기차 산업의 미래를 좀 더 밝게 해주는 역할을 할 것이다.",
    "originLink": "https://www.donga.com/news/Economy/article/all/20231115/122195469/1",
    "originBody": "",
    "originSummary": [
      "몇몇 주요 출판사들이 IPFS 게이트웨이 운영자들에게 수 천 건의 DMCA 고지를 쏟아붓고 있습니다. 이들 출판사들은 이러한 운영자들이 콘텐츠에 대한 권한을 가지지 않고 삭제할 수 없다는 사실을 알고 있음에도 불구하고 계속해서 이들에게 고지를 보내고 있습니다.",
      "한 개의 게이트웨이 운영자가 이러한 압력으로 인해 서비스를 중단했습니다. 이는 IPFS가 검열에 대해 기술적으로 견고하지만 저작권 침해 불만으로 인한 자체 검열 가능성에 노출될 수 있다는 것을 보여줍니다.",
      "이 DMCA 고지는 콘텐츠와 아무런 관련이 없는 수 천 개의 URL의 삭제를 요구하며, 이는 직접적으로 이들 운영자들에게 보내지는 것이 아닌 게이트웨이의 호스트로 보내지고 있습니다."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700054291350
  },
  {
    "title": "세계 최초 '수소전기 트램' 테스트 운행 시작...친환경 대중교통으로 기대",
    "originLink": "https://www.ytn.co.kr/_ln/0115_202311151722146776",
    "originBody": "",
    "originSummary": [
      "The world's first hydrogen-powered tram has started testing in Korea, using electricity generated from a combination of hydrogen and oxygen.",
      "The tram is emission-free and does not require overhead power lines, making it an environmentally friendly mode of public transportation in Ulsan and Daejeon.",
      "The tram has features like low floor height for accessibility, large windows for an open feel, and a capacity of up to 200 passengers. It is planned to be introduced in the Ulsan urban railway system in 2029 and is being considered for other cities as well."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700054291350
  },
  {
    "title": "KRISO Develops Environmentally Friendly Small Ships with LNG Propulsion, Aims to Support Small Shipbuilders",
    "originLink": "https://www.etnews.com/20231115000403",
    "originBody": "",
    "originSummary": [
      "Korea Research Institute of Ships & Ocean Engineering (KRISO) has created three environmentally friendly small ships powered by LNG propulsion.",
      "These ships have received basic approval (AIP) from the Korea Register of Shipping, indicating their compliance with environmental standards.",
      "KRISO aims to assist small shipbuilders and design companies in the development of eco-friendly ships by providing technical resources and support."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700054291350
  },
  {
    "title": "광어 최대산지 제주, \"친환경 양식\" 연구",
    "originLink": "https://m.khan.co.kr/article/202311151455001",
    "originBody": "",
    "originSummary": [
      "Jeju Island, the largest producer of farmed yellow croaker in South Korea, aims to develop an environmentally friendly system for croaker farming.",
      "The Jeju Fisheries and Oceanography Research Institute is researching a recirculating filtration system that purifies and reuses water used for farming instead of releasing it into the sea.",
      "The current farming method involves pumping seawater for farming, which can have negative environmental impacts, while the new system allows for better control of the farming environment and does not release water back into the ocean. Jeju Island plans to implement this system by 2025."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700054291350
  },
  {
    "title": "[]",
    "originLink": "https://m.newspim.com/news/view/20231115000659",
    "originBody": "",
    "originSummary": [
      "NVIDIA H200 is a groundbreaking AI technology that achieves a significant milestone in the field.",
      "The H200 offers exceptional capabilities and advancements in AI, pushing the boundaries of what is possible.",
      "This new technology from NVIDIA is expected to revolutionize various industries and pave the way for exciting developments in AI."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700054291350
  },
  {
    "title": "SL공사, 폐열로 키운 친환경 채소 나눔",
    "originLink": "https://www.getnews.co.kr/news/articleView.html?idxno=649107",
    "originBody": "",
    "originSummary": [
      "기사의 정보는 2023년 11월 15일 11:14에 작성된 김승웅 기자의 글입니다.",
      "기사에는 어떤 댓글도 없습니다.",
      "추가적인 내용은 제공되지 않습니다."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700054291350
  }
]
