[
  {
    "id": 40368016,
    "title": "Εξερευνώντας το Adobe Photoshop 1.0.1 Πηγαίος κώδικας",
    "originLink": "https://computerhistory.org/blog/adobe-photoshop-source-code/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40368016",
    "commentBody": "",
    "originSummary": [
      "Το Μουσείο Ιστορίας Υπολογιστών διαθέτει εκθέματα, δημοσιεύσεις και εκδηλώσεις που αφορούν την ιστορία της τεχνολογίας των υπολογιστών.",
      "Ο πηγαίος κώδικας του Adobe Photoshop 1.0.1 του 1990, που δημιουργήθηκε από τους Thomas και John Knoll, είναι πλέον προσβάσιμος για μη εμπορική χρήση, αναδεικνύοντας τον εξελιγμένο σχεδιασμό του λογισμικού.",
      "Το μουσείο προσφέρει πολύτιμες προοπτικές από τον αρχιτέκτονα λογισμικού Grady Booch, παρουσιάζοντας μια ιδιαίτερη άποψη για την πρώιμη εξέλιξη του Photoshop."
    ],
    "commentSummary": [
      "Η συζήτηση διερευνά τη σημασία της διατήρησης του πηγαίου κώδικα για λογισμικό σχεδιασμού της Adobe, όπως το Photoshop, το Illustrator και το PostScript από τη δεκαετία του '90, τονίζοντας την ιστορική σημασία του.",
      "Συγκρίνει τα προϊόντα της Adobe με εναλλακτικές λύσεις ανοικτού κώδικα όπως το GIMP και το Krita, ενώ εξετάζει την εξέλιξη των διεπαφών χρήστη, τις προτιμήσεις λογισμικού και τις κατευθυντήριες γραμμές για τα εμπορικά σήματα.",
      "Τονίζονται οι προσπάθειες οργανισμών όπως η Software Heritage για τη διαφύλαξη του πηγαίου κώδικα ως πολιτιστικής κληρονομιάς για τις μελλοντικές γενιές."
    ],
    "points": 535,
    "commentCount": 198,
    "retryCount": 0,
    "time": 1715785935
  },
  {
    "id": 40367331,
    "title": "Η Apple εισάγει νέα χαρακτηριστικά προσβασιμότητας: Eye Tracking και άλλα",
    "originLink": "https://www.apple.com/newsroom/2024/05/apple-announces-new-accessibility-features-including-eye-tracking/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40367331",
    "commentBody": "",
    "originSummary": [
      "Η Apple παρουσιάζει νέες λειτουργίες προσβασιμότητας, όπως Eye Tracking και Music Haptics, για να βοηθήσει τους χρήστες με σωματικές αναπηρίες, κώφωση και ασθένεια κίνησης.",
      "Ο τεχνολογικός γίγαντας παραμένει αφοσιωμένος στη συμμετοχικότητα, ενημερώνοντας τις συσκευές του για να βελτιώσει την εμπειρία χρήσης για όλους τους πελάτες.",
      "Πρωτοβουλίες όπως οι δωρεάν συνεδρίες σε σημεία του Apple Store και η προώθηση εφαρμογών, παιχνιδιών και προπονήσεων δίνουν έμφαση στην προσβασιμότητα και τη συμπερίληψη, συμπίπτοντας με την Παγκόσμια Ημέρα Ενημέρωσης για την Προσβασιμότητα."
    ],
    "commentSummary": [
      "Η Apple εισάγει νέα χαρακτηριστικά προσβασιμότητας, όπως η παρακολούθηση των ματιών για τις συσκευές της, προκαλώντας συζητήσεις σχετικά με τη ναυτία της κίνησης, την πείνα, τους τύπους οχημάτων και τους συσχετισμούς με την προσβασιμότητα.",
      "Ο διάλογος εξετάζει θέματα όπως το VoiceOver για το iOS 17, η ηθική χρήση του eye tracking, η βελτίωση της προσβασιμότητας στην τεχνολογία και η ανταλλαγή συμβουλών για τη χρήση των λειτουργιών προσβασιμότητας της Apple με βάση τις προσωπικές προτιμήσεις.",
      "Οι χρήστες θίγουν επίσης τα νομικά πλαίσια για τα δικαιώματα των ατόμων με αναπηρία, τις προκλήσεις στην κύρια τεχνολογία για την προσβασιμότητα και τις πιθανές εξελίξεις στη μουσική και την τεχνολογική προσβασιμότητα, συζητώντας για το Touch ID, το Face ID και τα οφέλη, την οικονομική προσιτότητα και τις ανησυχίες για την προστασία της ιδιωτικής ζωής που σχετίζονται με την τεχνολογία ανίχνευσης των ματιών."
    ],
    "points": 400,
    "commentCount": 220,
    "retryCount": 0,
    "time": 1715782925
  },
  {
    "id": 40366962,
    "title": "Απογοήτευση του χρήστη: Broadcom",
    "originLink": "https://matduggan.com/the-worst-website-in-the-entire-world/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40366962",
    "commentBody": "",
    "originSummary": [
      "Ο συγγραφέας αφηγείται μια απογοητευτική συνάντηση με τον ιστότοπο της Broadcom κατά την προσπάθεια λήψης λογισμικού VMware, τονίζοντας τον κακό σχεδιασμό και τα μη φιλικά προς τον χρήστη χαρακτηριστικά του ιστότοπου.",
      "Εκφράζουν δυσπιστία για την έλλειψη φιλικότητας προς το χρήστη και προτείνουν στην Broadcom να εξετάσει το ενδεχόμενο να ανανεώσει την πλατφόρμα για μια πιο φιλική προς το χρήστη εμπειρία."
    ],
    "commentSummary": [
      "Η συζήτηση ασχολείται με τις προκλήσεις στον σχεδιασμό ιστοσελίδων και την εμπειρία του χρήστη, δίνοντας έμφαση σε θέματα όπως η πολύπλοκη πλοήγηση, οι περιορισμοί στις βασικές λειτουργίες και η απογοήτευση των χρηστών από κακοσχεδιασμένο λογισμικό επιχειρήσεων.",
      "Οι χρήστες είναι δυσαρεστημένοι με ιστότοπους όπως το Fix Central της IBM, το SAP Ariba και το Workday, επικαλούμενοι προβλήματα με τις απαιτήσεις κωδικού πρόσβασης και τις ηλεκτρονικές διαδικασίες.",
      "Τα θέματα περιλαμβάνουν την ασφάλεια του διαδικτύου, την κακή χρήση της τεχνολογίας και τις ανησυχίες σχετικά με την εκμετάλλευση των δεδομένων των χρηστών από τις εταιρείες, ρίχνοντας φως στις περιπλοκές και τις προκλήσεις της αλληλεπίδρασης με διαφορετικούς ιστότοπους και εταιρικό λογισμικό."
    ],
    "points": 362,
    "commentCount": 181,
    "retryCount": 0,
    "time": 1715781139
  },
  {
    "id": 40366204,
    "title": "Το πρόγραμμα N64Recomp βελτιώνει τα παιχνίδια Nintendo 64 στον υπολογιστή",
    "originLink": "https://www.tomshardware.com/video-games/nearly-all-nintendo-64-games-can-now-be-recompiled-into-native-pc-ports-to-add-proper-ray-tracing-ultrawide-high-fps-and-more",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40366204",
    "commentBody": "",
    "originSummary": [
      "Τα παιχνίδια N64 μπορούν τώρα να μετατραπούν σε εγγενείς εκδόσεις για PC με βελτιώσεις όπως ray tracing και υψηλά FPS χρησιμοποιώντας το έργο N64Recomp στο GitHub.",
      "Με επικεφαλής τον Mr-Wiseguy, το έργο στοχεύει στη διατήρηση της αρχικής εμπειρίας παιχνιδιού, ενώ παράλληλα βελτιώνει τα γραφικά και τις επιδόσεις, απευθυνόμενο σε συντηρητές και λάτρεις του N64.",
      "Η άνοδος των έργων ανοιχτού κώδικα, των homebrew παιχνιδιών και των εξελίξεων του N64 αναζωπυρώνει το ενδιαφέρον για τη βιβλιοθήκη παιχνιδιών της κονσόλας, προσφέροντας μια σύγχρονη εμπειρία παιχνιδιού για κλασικούς τίτλους."
    ],
    "commentSummary": [
      "Η συζήτηση περιστρέφεται γύρω από ένα εργαλείο που επιτρέπει την επανασύνταξη παιχνιδιών Nintendo 64 σε μεταφορές για PC, εγείροντας ανησυχίες σχετικά με τη σκοπιμότητα και τη νομιμότητα.",
      "Οι συζητήσεις καλύπτουν τις προκλήσεις που σχετίζονται με τη συμβατότητα, τις νομικές πτυχές και την ανάλυση των ROMs, εμβαθύνοντας στις τεχνικές λεπτομέρειες της εξομοίωσης, όπως η εκτέλεση παιχνιδιών 32-bit σε σύγχρονα συστήματα και οι περιορισμοί της εξομοίωσης του N64 σε διάφορες πλατφόρμες.",
      "Τα θέματα περιλαμβάνουν συγκρίσεις μεταξύ επίσημων και οπαδικών εξομοιώσεων, βελτιωμένη απόδοση της εξομοίωσης του N64, πιθανές βελτιώσεις όπως η εκ νέου μεταγλώττιση του Goldeneye, η αντίδραση της Nintendo στην πρόοδο της εξομοίωσης και η χρήση της Proton για τη μεταφορά παιχνιδιών εν μέσω συγκρούσεων σε τουρνουά."
    ],
    "points": 351,
    "commentCount": 159,
    "retryCount": 0,
    "time": 1715777299
  },
  {
    "id": 40366443,
    "title": "Οι πρωτεΐνες στο αίμα κρατούν το κλειδί για την έγκαιρη ανίχνευση του καρκίνου",
    "originLink": "https://www.theguardian.com/society/article/2024/may/15/proteins-blood-cancer-warning-seven-years-study",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40366443",
    "commentBody": "",
    "originSummary": [
      "Ερευνητές του Πανεπιστημίου της Οξφόρδης εντόπισαν 618 πρωτεΐνες του αίματος που συνδέονται με 19 τύπους καρκίνου, με 107 να σχετίζονται με καρκίνους που διαγνώστηκαν πάνω από επτά χρόνια αργότερα, υποδεικνύοντας μια δυνατότητα έγκαιρης ανίχνευσης του καρκίνου.",
      "Η τροποποίηση συγκεκριμένων πρωτεϊνών του αίματος θα μπορούσε να επηρεάσει τον κίνδυνο εμφάνισης εννέα τύπων καρκίνου, γεγονός που υπόσχεται να επηρεάσει την πρόληψη του καρκίνου και την έγκαιρη διάγνωση.",
      "Η ανακάλυψη αυτή σηματοδοτεί μια σημαντική πρόοδο στον εντοπισμό δεικτών αυξημένου κινδύνου καρκίνου και στην έγκαιρη ανίχνευση του καρκίνου, όπως αναγνωρίζεται από τους ειδικούς του τομέα."
    ],
    "commentSummary": [
      "Η έγκαιρη ανίχνευση στον προσυμπτωματικό έλεγχο του καρκίνου είναι ζωτικής σημασίας, ενώ συζητούνται τα οφέλη και οι κίνδυνοι των διαφόρων μεθόδων εξέτασης.",
      "Υπογραμμίζεται η σημασία των ενισχυμένων πόρων υγειονομικής περίθαλψης, των διαφανών διαδικασιών λήψης αποφάσεων και των αλλαγών στον τρόπο ζωής για την πρόληψη του καρκίνου.",
      "Εξετάζονται επίσης οι προκλήσεις για τη δημιουργία πρακτικών βιοδεικτών αίματος για την ανίχνευση του καρκίνου και οι νομικές εγγυήσεις κατά των γενετικών διακρίσεων στην ασφαλιστική κάλυψη."
    ],
    "points": 327,
    "commentCount": 121,
    "retryCount": 0,
    "time": 1715778668
  },
  {
    "id": 40371612,
    "title": "Νέες συναρτήσεις εκθέτη αυξάνουν την ταχύτητα των SiLU και SoftMax κατά 2x",
    "originLink": "https://github.com/ggerganov/llama.cpp/pull/7154",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40371612",
    "commentBody": "",
    "originSummary": [
      "Το αποθετήριο llama.cpp στο GitHub έχει 58,3k αστέρια και 8,3k διακλαδώσεις.",
      "Ο συνεργάτης jart βελτιώνει τις συναρτήσεις silu και softmax για τη CPU, ενσωματώνοντας τις εντολές AVX512 και AVX2 για υπολογισμούς εκθετικών τιμών, παρουσιάζοντας βελτιωμένη απόδοση σε συγκριτικές δοκιμές με σφάλμα ULP μικρότερο από 1.",
      "Ο συγγραφέας υπογραμμίζει τη χρήση του vpermi2pd για πίνακες αναζήτησης Float64/double και σημειώνει ότι υλικό όπως ο Zen4 ή ο icelake-client/tigerlake μπορεί να μην έχει τόσο μεγάλο όφελος, με τον περιορισμό ότι ο πίνακας πρέπει να χωράει σε δύο καταχωρητές."
    ],
    "commentSummary": [
      "Δημιουργούνται νέες συναρτήσεις εκθέτη για την επιτάχυνση των υπολογισμών SiLU και SoftMax, διατηρώντας παράλληλα την ακρίβεια, αντλώντας από την εμπειρία με έναν επεξεργαστή σήματος ραντάρ.",
      "Η υλοποίηση βελτιστοποιεί τους υπολογισμούς εκθετικοποίησης μέσω πινάκων αναζήτησης, αξιοποιώντας τη SIMD και τα ενδογενή χαρακτηριστικά υλικού σε C και C++.",
      "Η συζήτηση καλύπτει τις μη-χρονικές εντολές φόρτωσης/αποθήκευσης, τους περιορισμούς των πινάκων αναζήτησης, τις αποκλίσεις επιδόσεων στην επεξεργασία δεδομένων, τις βελτιώσεις επιδόσεων για το αρχείο llama.cpp, τις συγκρίσεις χρόνου εκτέλεσης ML, το TensorFlow Lite και το ONNX για την ανάπτυξη μοντέλων, τη ρομποτική, την κινούμενη εικόνα, τις επιπτώσεις των μοντέλων GPU, τις βελτιώσεις της ταχύτητας της CPU και τις εξελίξεις στην αρχιτεκτονική μνήμης, με σύσταση για συγκριτική αξιολόγηση για τον προσδιορισμό της πιο αποτελεσματικής προσέγγισης για συγκεκριμένες εργασίες."
    ],
    "points": 309,
    "commentCount": 58,
    "retryCount": 0,
    "time": 1715803021
  },
  {
    "id": 40369467,
    "title": "Τίτλος: 1.0.7075: \"Εξερευνώντας το Datomic Pro 1.0.7075: Dicomic: Ταυτόχρονη και συναλλακτική ορθότητα\"",
    "originLink": "https://jepsen.io/analyses/datomic-pro-1.0.7075",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40369467",
    "commentBody": "",
    "originSummary": [
      "Η Datomic είναι μια βάση δεδομένων γενικού σκοπού που χρησιμοποιεί τριπλέτες EAV και λογικές χρονοσφραγίδες, προσφέροντας Datomic Pro και Datomic Cloud με διαφορετικές αρχιτεκτονικές.",
      "Η βάση δεδομένων εξασφαλίζει διαχωρισμό ανάγνωσης-εγγραφής για λόγους απόδοσης και εγγυάται συναλλαγές ACID, αν και οι ταυτόχρονες συναλλαγές μπορεί να οδηγήσουν σε απροσδόκητα αποτελέσματα.",
      "Οι χρήστες πρέπει να χειρίζονται με προσοχή τις λειτουργίες συναλλαγών και τις προδιαγραφές οντοτήτων για να αποφύγουν ανωμαλίες, παρά τον απλό σχεδιασμό ταυτόχρονης λειτουργίας και την ορθότητα των συναλλαγών του Datomic."
    ],
    "commentSummary": [
      "Το άρθρο καλύπτει την κυκλοφορία του Datomic Pro 1.0.7075, δίνοντας έμφαση στις επιτυχείς δοκιμές Jepsen και στη σημασία της σαφούς τεκμηρίωσης και της επιβολής αναλλοίωτων.",
      "Συζητά τις προκλήσεις και τα πλεονεκτήματα της χρήσης του συστήματος βάσεων δεδομένων της Datomic, συμπεριλαμβανομένων των παγίδων, των συμβιβασμών, των ολοκληρωμένων δοκιμών, της επεκτασιμότητας, των ελέγχων συναλλαγών και των χαρακτηριστικών ασφαλείας.",
      "Αναφέρονται σπασμένοι σύνδεσμοι στον ιστότοπο της Datomic και εύστοχες ομιλίες στο συνέδριο από την aphyr."
    ],
    "points": 282,
    "commentCount": 55,
    "retryCount": 0,
    "time": 1715792250
  },
  {
    "id": 40365882,
    "title": "Πρωτοφανής άνοδος του CO2 σε 50 χιλιάδες χρόνια: Ανθρώπινη Δραστηριότητα Κύριος Παράγοντας",
    "originLink": "https://today.oregonstate.edu/news/researchers-identify-fastest-rate-natural-carbon-dioxide-rise-over-last-50000-years",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40365882",
    "commentBody": "",
    "originSummary": [
      "Ερευνητές του Πολιτειακού Πανεπιστημίου του Όρεγκον ανακάλυψαν την ταχύτερη φυσική αύξηση των επιπέδων διοξειδίου του άνθρακα τα τελευταία 50.000 χρόνια, μελετώντας τους αρχαίους πάγους της Ανταρκτικής.",
      "Ο σημερινός ρυθμός αύξησης του ατμοσφαιρικού CO2 είναι δέκα φορές ταχύτερος από οποιαδήποτε άλλη ιστορική περίοδο, κυρίως λόγω των ανθρώπινων δραστηριοτήτων, σύμφωνα με τη μελέτη που δημοσιεύθηκε στην επιθεώρηση Proceedings of the National Academy of Sciences (Πρακτικά της Εθνικής Ακαδημίας Επιστημών).",
      "Η έρευνα αυτή προσφέρει πολύτιμες πληροφορίες για τα ιστορικά γεγονότα της κλιματικής αλλαγής και τις πιθανές επιπτώσεις της σημερινής κλιματικής αλλαγής, δίνοντας έμφαση στα απαράμιλλα επίπεδα CO2 στην ατμόσφαιρα."
    ],
    "commentSummary": [
      "Το άρθρο ασχολείται με τις προκλήσεις της ταχύτερης φυσικής αύξησης του διοξειδίου του άνθρακα εδώ και 50.000 χρόνια, παράλληλα με τους κινδύνους της τεχνητής γενικής νοημοσύνης, των πυρηνικών συγκρούσεων και της κλιματικής αλλαγής.",
      "Επισημαίνει τον κρίσιμο ρόλο της ανθρώπινης εφευρετικότητας στην αντιμετώπιση αυτών των ζητημάτων και παραθέτει ιστορικές περιπτώσεις αποτροπής πυρηνικών καταστροφών.",
      "Οι συζητήσεις καλύπτουν την αύξηση των επιπέδων CO2, λύσεις όπως η έγχυση στρατοσφαιρικού αερολύματος και τις διαφορετικές απόψεις σχετικά με τον επείγοντα χαρακτήρα και τη σκοπιμότητα της μείωσης των εκπομπών για την καταπολέμηση της κλιματικής αλλαγής, ενώ θίγονται επίσης ο κοινωνικός αντίκτυπος της επιστημονικής φαντασίας και οι συζητήσεις γύρω από τους κινδύνους της ΑΓΙ."
    ],
    "points": 249,
    "commentCount": 451,
    "retryCount": 0,
    "time": 1715775238
  },
  {
    "id": 40365198,
    "title": "Η Oracle μεταβαίνει στο OpenTofu από το Terraform",
    "originLink": "https://www.thestack.technology/oracle-dumps-terraform-for-opentofu/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40365198",
    "commentBody": "",
    "originSummary": [
      "Η Oracle αντικατέστησε το Terraform με το εναλλακτικό OpenTofu ανοικτού κώδικα στο Oracle E-Business Suite Cloud Manager, απαιτώντας από τους πελάτες να μεταβούν μέχρι τις 30 Ιουνίου 2024, μετά από αλλαγές στην αδειοδότηση από τον δημιουργό του Terraform, την HashiCorp.",
      "Το OpenTofu θεωρείται ως μια πιο επιεικής και κατάλληλη για τις επιχειρήσεις λύση από το Terraform.",
      "Η HashiCorp, ο αρχικός προγραμματιστής της Terraform, εξαγοράζεται από την IBM έναντι 6,7 δισεκατομμυρίων δολαρίων, γεγονός που υποδηλώνει σημαντικές κινήσεις στον κλάδο."
    ],
    "commentSummary": [
      "Η Oracle μεταβαίνει από το Terraform στο OpenTofu 1.7, εισάγοντας χαρακτηριστικά όπως η κρυπτογράφηση κατάστασης από άκρο σε άκρο.",
      "Η τεχνολογική κοινότητα στρέφεται προς το OpenTofu, δίνοντας έμφαση στις συζητήσεις σχετικά με τους περιορισμούς του Terraform, τα εναλλακτικά εργαλεία και τις προκλήσεις διαχείρισης υποδομών.",
      "Οι συζητήσεις αφορούν την υποστήριξη της Oracle, τη χρήση του Oracle Linux για απόδοση, την εξωτερική ανάθεση εργασιών διαχείρισης πληροφορικής, το ρόλο της Oracle EBS και τις ανησυχίες σχετικά με τις συμφωνίες αδειοδότησης σε έργα ανοικτού κώδικα, υπογραμμίζοντας την ανάγκη για ποικιλομορφία και στρατηγική κατανομή των πόρων στον τομέα της τεχνολογίας."
    ],
    "points": 249,
    "commentCount": 173,
    "retryCount": 0,
    "time": 1715770233
  },
  {
    "id": 40367090,
    "title": "Quary: για μηχανικούς",
    "originLink": "https://github.com/quarylabs/quary",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40367090",
    "commentBody": "",
    "originSummary": [
      "Το Quary είναι ένα εργαλείο BI/αναλυτικής με επίκεντρο τον μηχανικό, το οποίο αντιμετωπίζει τα προβλήματα των μηχανικών με το αυτοεξυπηρετούμενο BI, ενσωματώνοντας τυποποιημένες πρακτικές λογισμικού.",
      "Ενσωματώνεται με βάσεις δεδομένων, εστιάζοντας ιδιαίτερα στην Supabase, και είναι πλέον διαθέσιμο ως ανοιχτός κώδικας υπό την άδεια Apache 2.0.",
      "Οι προγραμματισμένες ενημερώσεις περιλαμβάνουν μια διαδικτυακή πλατφόρμα για την ανταλλαγή μοντέλων δεδομένων και μια μηχανή ενορχήστρωσης, ενώ οι χρήστες καλούνται να δοκιμάσουν το Quary και να προσφέρουν πληροφορίες."
    ],
    "commentSummary": [
      "Η Quary Labs κυκλοφόρησε ένα εργαλείο BI και ανάλυσης ανοιχτού κώδικα, το Quary, το οποίο απευθύνεται σε μηχανικούς, δίνοντας έμφαση στους μετασχηματισμούς SQL, στη μοντελοποίηση δεδομένων και στα καλά δομημένα ταμπλό.",
      "Έχουν ληφθεί θετικά σχόλια, τα οποία υπονοούν επερχόμενα επί πληρωμή χαρακτηριστικά, αυξημένη επεκτασιμότητα και συγκρίσεις με τις dbt, Lightdash και Grafana, εστιάζοντας σε μια προσέγγιση που βασίζεται στον κώδικα και σε ξεκαθαρισμένους πίνακες οργάνων.",
      "Οι χρήστες έχουν δείξει ενδιαφέρον για τη χρήση του Quary για λευκή ετικέτα και ενσωμάτωση BI στα προϊόντα τους, κάνοντας παραλληλισμούς με εργαλεία όπως το BIRT και το Rill."
    ],
    "points": 234,
    "commentCount": 64,
    "retryCount": 0,
    "time": 1715781755
  },
  {
    "id": 40369119,
    "title": "Η χρήση του \"BEGIN PGP MESSAGE\" παρακάμπτει τα φίλτρα ηλεκτρονικού ταχυδρομείου",
    "originLink": "https://nondeterministic.computer/@martin/112444389342113780",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40369119",
    "commentBody": "",
    "originSummary": [
      "Το Nondeterministic.computer είναι ένα αποκεντρωμένο κοινωνικό δίκτυο που βασίζεται στο Mastodon, προσφέροντας επιλογές αναζήτησης για μέσα ενημέρωσης, δημοσκοπήσεις και ενσωματώσεις με φίλτρα για απαντήσεις και ευαίσθητη γλώσσα.",
      "Οι χρήστες μπορούν να εξερευνούν ζωντανές ροές, να ακολουθούν προφίλ και hashtags και να επικοινωνούν με άλλους από το λογαριασμό τους σε ξεχωριστό διακομιστή.",
      "Με τη διαχείριση των στατιστικών του διακομιστή, οι χρήστες μπορούν να εμβαθύνουν σε πληροφορίες τόσο για το nondeterministic.computer όσο και για το Mastodon."
    ],
    "commentSummary": [
      "Η συζήτηση εξετάζει την παράκαμψη των εταιρικών φίλτρων ηλεκτρονικού ταχυδρομείου, συμπεριλαμβανομένων των κρυπτογραφημένων zip και των υπογραφών PGP, υπογραμμίζοντας τις ανησυχίες σχετικά με την ασφάλεια του ηλεκτρονικού ταχυδρομείου και την αποτελεσματικότητα των φίλτρων.",
      "Οι χρήστες συζητούν τις εμπειρίες τους με τα μηνύματα spam, αμφισβητώντας την εξάρτηση από τα μοντέλα μηχανικής μάθησης, και αντιμετωπίζουν ζητήματα με τις πρακτικές επαναγραφής μηνυμάτων ηλεκτρονικού ταχυδρομείου και τις επικεφαλίδες DKIM."
    ],
    "points": 205,
    "commentCount": 59,
    "retryCount": 0,
    "time": 1715790728
  },
  {
    "id": 40366137,
    "title": "Προκαλώντας τους μαθητές της 7ης τάξης: Χρήση ναρκωτικών",
    "originLink": "https://www.experimental-history.com/p/how-to-get-7th-graders-to-smoke",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40366137",
    "commentBody": "",
    "originSummary": [
      "Τα προγράμματα πρόληψης αποτυγχάνουν να αντιμετωπίσουν τη χρήση ναρκωτικών μεταξύ των μαθητών της 7ης τάξης, αμφισβητώντας την ιδέα της εύκολης αλλαγής της ανθρώπινης συμπεριφοράς.",
      "Η εκπαίδευση σε θέματα δεοντολογίας και οι μέθοδοι προσωπικής βελτίωσης είναι αναποτελεσματικές στην αντιμετώπιση των σιωπηρών προκαταλήψεων, τονίζοντας την ανάγκη για κριτική σκέψη κατά τη λήψη αποφάσεων.",
      "Το άρθρο ασκεί κριτική στο καθολικό σύστημα αξιολόγησης από ομοτίμους πριν από τη δημοσίευση, προτείνοντας το ενημερωτικό δελτίο Πειραματικής Ιστορίας ως πηγή αναζήτησης και αξιοποίησης της αλήθειας."
    ],
    "commentSummary": [
      "Η συζήτηση αξιολογεί την αποτελεσματικότητα των προγραμμάτων εκπαίδευσης σε θέματα ναρκωτικών, όπως το D.A.R.E., αναδεικνύοντας τους κινδύνους των διαφόρων ουσιών και τις επιπτώσεις τους στα αποτελέσματα της υγείας.",
      "Εμβαθύνει στην ασφάλεια και τους κινδύνους που σχετίζονται με ναρκωτικά όπως η κάνναβη, το MDMA και το LSD, ενώ παράλληλα εξετάζει τις παρανοήσεις και την επιρροή των μέσων ενημέρωσης στις συνήθειες του καπνίσματος.",
      "Υποστηρίζει μια συμπονετική προσέγγιση της χρήσης ναρκωτικών και του εθισμού, δίνοντας έμφαση στη σημασία των πραγματικών πληροφοριών έναντι των τακτικών τρομοκράτησης και της χειραγώγησης."
    ],
    "points": 203,
    "commentCount": 239,
    "retryCount": 0,
    "time": 1715776884
  }
]
