[
  {
    "id": 40368016,
    "title": "Adobe Photoshop 1.0.1 소스 코드 살펴보기",
    "originLink": "https://computerhistory.org/blog/adobe-photoshop-source-code/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40368016",
    "commentBody": "",
    "originSummary": [
      "컴퓨터 역사 박물관에서는 컴퓨터 기술의 역사를 탐구하는 전시, 출판물, 이벤트가 열립니다.",
      "토마스와 존 놀에 의해 제작된 1990년 Adobe Photoshop 1.0.1의 소스 코드는 이제 비상업적 용도로 액세스할 수 있으며, 소프트웨어의 정교한 디자인을 강조합니다.",
      "이 박물관은 소프트웨어 설계자인 Grady Booch의 귀중한 관점을 통해 포토샵의 초기 진화에 대한 특별한 관점을 제시합니다."
    ],
    "commentSummary": [
      "이 토론에서는 90년대부터 사용된 포토샵, 일러스트레이터, 포스트스크립트 등 Adobe 디자인 소프트웨어의 소스 코드를 보존하는 것의 중요성을 살펴보며 그 역사적 중요성을 강조합니다.",
      "사용자 인터페이스, 소프트웨어 기본 설정, 상표 가이드라인의 진화 과정을 살펴보면서 Adobe 제품과 김프, 크리타 같은 오픈 소스 대안을 비교합니다.",
      "미래 세대를 위한 문화 유산으로서 소스 코드를 보호하기 위한 Software Heritage와 같은 단체의 노력이 강조되고 있습니다."
    ],
    "points": 535,
    "commentCount": 198,
    "retryCount": 0,
    "time": 1715785935
  },
  {
    "id": 40367331,
    "title": "Apple, 새로운 접근성 기능 도입: 시선 추적 등",
    "originLink": "https://www.apple.com/newsroom/2024/05/apple-announces-new-accessibility-features-including-eye-tracking/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40367331",
    "commentBody": "",
    "originSummary": [
      "Apple은 신체 장애, 청각 장애, 멀미가 있는 사용자를 돕기 위해 시선 추적 및 음악 햅틱과 같은 새로운 접근성 기능을 공개합니다.",
      "이 거대 기술 기업은 모든 고객의 사용자 경험을 향상시키기 위해 디바이스를 업데이트하는 등 포용성을 위한 노력을 계속하고 있습니다.",
      "세계 접근성 인식의 날을 맞아 Apple Store 지점에서 무료 세션, 앱, 게임, 운동 홍보 등의 활동을 통해 접근성과 포용성을 강조하고 있습니다."
    ],
    "commentSummary": [
      "Apple은 시선 추적과 같은 새로운 접근성 기능을 도입하여 멀미, 배고픔, 차량 유형, 접근성과의 상관관계에 대한 논의를 촉발시켰습니다.",
      "이 대화에서는 iOS 17용 VoiceOver, 시선 추적의 윤리적 사용, 기술의 접근성 개선, 개인 취향에 따른 Apple의 접근성 기능 활용 팁 공유와 같은 주제를 다룹니다.",
      "또한 장애인 권리를 위한 법적 프레임워크, 접근성을 위한 주류 기술의 과제, 음악 및 기술 접근성의 잠재적 발전 가능성에 대해 다루고, Touch ID, Face ID, 시선추적 기술과 관련된 이점, 경제성 및 개인정보 보호 문제에 대해 논의합니다."
    ],
    "points": 400,
    "commentCount": 220,
    "retryCount": 0,
    "time": 1715782925
  },
  {
    "id": 40366962,
    "title": "사용자의 불만: 불친절한 Broadcom 웹사이트 탐색하기",
    "originLink": "https://matduggan.com/the-worst-website-in-the-entire-world/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40366962",
    "commentBody": "",
    "originSummary": [
      "저자는 VMware 소프트웨어를 다운로드하려고 할 때 Broadcom 웹 사이트에서 겪은 실망스러운 경험을 이야기하며, 사이트의 열악한 디자인과 사용자 친화적이지 않은 기능을 강조합니다.",
      "이들은 사용자 친화성이 부족하다는 점에 불신을 표명하며 Broadcom이 보다 사용자 친화적인 경험을 위해 플랫폼 개편을 고려해야 한다고 제안합니다."
    ],
    "commentSummary": [
      "이 토론에서는 웹 디자인과 사용자 경험의 문제를 다루며 복잡한 탐색, 기본 기능의 제한, 잘못 설계된 기업용 소프트웨어에 대한 사용자 불만과 같은 문제를 강조합니다.",
      "사용자들은 비밀번호 요구 사항과 온라인 절차에 문제가 있다는 이유로 IBM의 Fix Central, SAP Ariba, Workday와 같은 웹사이트에 불만을 표시하고 있습니다.",
      "웹 보안, 기술 오용, 기업의 사용자 데이터 악용에 대한 우려 등을 주제로 다양한 웹사이트 및 기업용 소프트웨어와의 상호 작용의 복잡성과 문제점을 조명합니다."
    ],
    "points": 362,
    "commentCount": 181,
    "retryCount": 0,
    "time": 1715781139
  },
  {
    "id": 40366204,
    "title": "PC에서 닌텐도 64 게임을 향상시키는 N64Recomp 프로젝트",
    "originLink": "https://www.tomshardware.com/video-games/nearly-all-nintendo-64-games-can-now-be-recompiled-into-native-pc-ports-to-add-proper-ray-tracing-ultrawide-high-fps-and-more",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40366204",
    "commentBody": "",
    "originSummary": [
      "이제 GitHub의 N64Recomp 프로젝트를 사용하여 레이 트레이싱 및 높은 FPS와 같은 향상된 기능을 갖춘 네이티브 PC 버전으로 N64 게임을 변환할 수 있습니다.",
      "미스터 와이즈가이가 이끄는 이 프로젝트는 오리지널 게임 플레이 경험을 유지하면서 그래픽과 성능을 향상시켜 보존론자와 N64 애호가들에게 어필하는 것을 목표로 합니다.",
      "오픈 소스 프로젝트, 자체 제작 게임, N64의 발전으로 콘솔의 게임 라이브러리에 대한 관심이 다시 높아지고 있으며, 클래식 타이틀을 위한 현대적인 게임 경험을 제공하고 있습니다."
    ],
    "commentSummary": [
      "이 논쟁은 닌텐도 64 게임을 PC 포트로 재컴파일할 수 있는 툴을 둘러싼 것으로, 실현 가능성과 합법성에 대한 우려가 제기되고 있습니다.",
      "최신 시스템에서 32비트 게임 실행, 다양한 플랫폼에서의 N64 에뮬레이션 제약 등 에뮬레이션의 기술적인 측면과 호환성, 법적 측면, ROM 분석과 관련된 문제를 논의합니다.",
      "공식 에뮬레이션과 팬이 만든 에뮬레이션의 비교, N64 에뮬레이션 성능 향상, 골든아이 재컴파일과 같은 개선 가능성, 에뮬레이션 진행 상황에 대한 닌텐도의 대응, 토너먼트 분쟁 중 게임 포팅에 프로톤 사용 등이 주제에 포함되었습니다."
    ],
    "points": 351,
    "commentCount": 159,
    "retryCount": 0,
    "time": 1715777299
  },
  {
    "id": 40366443,
    "title": "암 조기 발견의 열쇠를 쥐고 있는 혈액 내 단백질",
    "originLink": "https://www.theguardian.com/society/article/2024/may/15/proteins-blood-cancer-warning-seven-years-study",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40366443",
    "commentBody": "",
    "originSummary": [
      "옥스퍼드 대학교의 연구진은 19가지 유형의 암과 관련된 618개의 혈액 단백질을 확인했으며, 이 중 107개는 7년 후 진단된 암과 관련이 있어 암 조기 발견의 가능성을 보여주었습니다.",
      "특정 혈액 단백질을 변경하면 9가지 유형의 암 발병 위험에 영향을 미칠 수 있어 암 예방 및 조기 진단에 영향을 미칠 수 있는 가능성을 보여주었습니다.",
      "이 발견은 해당 분야의 전문가들이 인정한 바와 같이 암 위험도를 높이는 마커를 찾아내고 암의 조기 발견을 지원하는 데 있어 중요한 진전을 이루었습니다."
    ],
    "commentSummary": [
      "암 검진에서 조기 발견은 매우 중요하며, 다양한 검사 방법의 장점과 위험성에 대해 논의합니다.",
      "암 예방을 위한 향상된 의료 자원, 투명한 의사 결정 프로세스, 생활 습관 변화의 중요성이 강조되고 있습니다.",
      "암 진단을 위한 실용적인 혈액 바이오마커 개발과 보험 적용 시 유전적 차별에 대한 법적 보호 장치 마련에 대한 문제도 다뤄집니다."
    ],
    "points": 327,
    "commentCount": 121,
    "retryCount": 0,
    "time": 1715778668
  },
  {
    "id": 40371612,
    "title": "새로운 지수 함수로 SiLU 및 소프트맥스 속도 2배 향상",
    "originLink": "https://github.com/ggerganov/llama.cpp/pull/7154",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40371612",
    "commentBody": "",
    "originSummary": [
      "깃허브의 llama.cpp 리포지토리는 58.3만 개의 별과 8.3만 개의 포크를 보유하고 있습니다.",
      "기여자 jart는 지수 값 계산을 위한 AVX512 및 AVX2 명령어를 통합하여 CPU의 silu 및 softmax 기능을 향상시켜 1 ULP 오류 미만의 벤치마크에서 향상된 성능을 보여주고 있습니다.",
      "저자는 Float64/더블 룩업 테이블에 vpermi2pd를 사용하는 것을 강조하며, 테이블이 두 개의 레지스터에 맞아야 한다는 제약이 있기 때문에 Zen4 또는 icelake-client/tigerlake 같은 하드웨어는 그다지 큰 이점을 보지 못할 수 있다고 지적합니다."
    ],
    "commentSummary": [
      "레이더 신호 프로세서에 대한 경험을 바탕으로 정확도를 유지하면서 SiLU 및 SoftMax 계산을 가속화하기 위해 새로운 지수 함수가 만들어졌습니다.",
      "구현은 룩업 테이블을 통해 지수 연산을 최적화하고, C와 C++의 SIMD 및 하드웨어 내재성을 활용합니다.",
      "비시간적 로드/저장 명령어, 룩업 테이블 제한, 데이터 처리의 성능 차이, llama.cpp의 성능 향상, ML 런타임 비교, 모델 배포, 로봇 공학, 애니메이션, GPU 모델 영향, CPU 속도 향상, 메모리 아키텍처 개선에 대한 논의와 함께 특정 작업에 가장 효과적인 접근 방식을 파악하기 위한 벤치마킹 권장 사항도 다룹니다."
    ],
    "points": 309,
    "commentCount": 58,
    "retryCount": 0,
    "time": 1715803021
  },
  {
    "id": 40369467,
    "title": "제목: \"데이터믹 프로 1.0.7075 살펴보기: 동시성 및 트랜잭션 정확성\"",
    "originLink": "https://jepsen.io/analyses/datomic-pro-1.0.7075",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40369467",
    "commentBody": "",
    "originSummary": [
      "데이터믹은 EAV 트리플과 논리적 타임스탬프를 활용하는 범용 데이터베이스로, 서로 다른 아키텍처의 데이터믹 프로와 데이터믹 클라우드를 제공합니다.",
      "데이터베이스는 성능을 위해 읽기-쓰기 분리를 보장하고 ACID 트랜잭션을 보장하지만, 동시 트랜잭션으로 인해 예기치 않은 결과가 발생할 수 있습니다.",
      "데이터믹의 단순한 동시성 설계와 트랜잭션 정확성에도 불구하고 사용자는 트랜잭션 함수 및 엔티티 사양을 신중하게 처리하여 이상 징후를 방지해야 합니다."
    ],
    "commentSummary": [
      "이 기사에서는 성공적인 젭슨 테스트와 명확한 문서화 및 불변성 적용의 중요성을 강조하는 Datomic Pro 1.0.7075의 릴리스에 대해 설명합니다.",
      "함정, 절충안, 포괄적인 테스트, 확장성, 트랜잭션 제어, 안전 기능 등 데이터믹의 데이터베이스 시스템을 활용할 때의 어려움과 장점에 대해 설명합니다.",
      "Datomic 웹사이트의 끊어진 링크와 aphyr의 통찰력 있는 컨퍼런스 강연이 언급되었습니다."
    ],
    "points": 282,
    "commentCount": 55,
    "retryCount": 0,
    "time": 1715792250
  },
  {
    "id": 40365882,
    "title": "5만 년 만에 전례 없는 CO2 증가: 인간 활동의 주요 요인",
    "originLink": "https://today.oregonstate.edu/news/researchers-identify-fastest-rate-natural-carbon-dioxide-rise-over-last-50000-years",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40365882",
    "commentBody": "",
    "originSummary": [
      "오레곤 주립대 연구진은 고대 남극의 얼음을 연구하여 지난 5만 년 동안 이산화탄소 수치가 자연적으로 가장 빠르게 증가한 사실을 발견했습니다.",
      "미국 국립과학원 회보에 발표된 연구에 따르면 현재 대기 중 이산화탄소 상승 속도는 다른 어떤 역사적 시기보다 10배 빠른데, 이는 주로 인간 활동으로 인한 것입니다.",
      "이 연구는 역사적인 기후 변화 사건과 오늘날의 기후 변화의 잠재적 영향에 대한 귀중한 통찰력을 제공하며, 대기 중 이산화탄소의 비할 데 없는 수준을 강조합니다."
    ],
    "commentSummary": [
      "이 기사는 인공 지능, 핵 분쟁, 기후 변화의 위험과 함께 5만 년 만에 가장 빠른 자연 이산화탄소 증가의 문제를 다루고 있습니다.",
      "이 보고서는 이러한 문제를 해결하는 데 있어 인간의 독창성이 중요한 역할을 한다는 점을 강조하고 핵 재앙을 피할 수 있었던 역사적 사례를 인용합니다.",
      "토론에서는 CO2 수치 상승, 성층권 에어로졸 주입과 같은 해결책, 기후 변화에 대응하기 위한 배출량 감축의 시급성과 실현 가능성에 대한 다양한 견해가 다루어지며, 공상 과학 소설의 사회적 영향과 AGI 위험에 대한 논쟁도 다뤄집니다."
    ],
    "points": 249,
    "commentCount": 451,
    "retryCount": 0,
    "time": 1715775238
  },
  {
    "id": 40365198,
    "title": "오라클, 테라폼에서 오픈토푸로 전환하다",
    "originLink": "https://www.thestack.technology/oracle-dumps-terraform-for-opentofu/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40365198",
    "commentBody": "",
    "originSummary": [
      "오라클은 테라폼의 개발사인 해시코프의 라이선스 변경에 따라 오라클 E-비즈니스 스위트 클라우드 매니저에서 테라폼을 오픈소스 대체품인 오픈토푸로 교체했으며, 고객들은 2024년 6월 30일까지 전환해야 합니다.",
      "오픈토푸는 테라폼보다 더 관대하고 비즈니스에 적합한 솔루션으로 인식되고 있습니다.",
      "테라폼의 최초 개발사인 해시코프가 IBM에 67억 달러에 인수되는 등 업계의 움직임이 활발해지고 있습니다."
    ],
    "commentSummary": [
      "오라클은 테라폼에서 오픈토프 1.7로 전환하면서 엔드투엔드 상태 암호화와 같은 기능을 도입하고 있습니다.",
      "기술 커뮤니티는 테라폼의 한계, 대체 도구, 인프라 관리 문제에 대한 토론을 강조하며 오픈토푸로 전환하고 있습니다.",
      "오라클의 지원, 성능을 위한 오라클 리눅스 사용, IT 관리 업무 아웃소싱, 오라클 EBS 역할, 오픈 소스 프로젝트의 라이선스 계약에 대한 우려 등을 논의하며 기술 부문에서 다양성과 전략적 리소스 배분의 필요성을 강조했습니다."
    ],
    "points": 249,
    "commentCount": 173,
    "retryCount": 0,
    "time": 1715770233
  },
  {
    "id": 40367090,
    "title": "Quary: 엔지니어를 위한 오픈 소스 BI 도구",
    "originLink": "https://github.com/quarylabs/quary",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40367090",
    "commentBody": "",
    "originSummary": [
      "Quary는 표준 소프트웨어 관행을 통합하여 셀프 서비스 BI에 대한 엔지니어의 문제를 해결하는 엔지니어 중심 BI/분석 도구입니다.",
      "특히 슈퍼베이스에 중점을 둔 데이터베이스와 통합되며, 현재 Apache 2.0 라이선스에 따라 오픈 소스로 제공됩니다.",
      "예정된 업데이트에는 데이터 모델 공유를 위한 웹 플랫폼과 오케스트레이션 엔진이 포함되며, 사용자들은 Quary를 테스트하고 의견을 제시해 주시기 바랍니다."
    ],
    "commentSummary": [
      "Quary Labs는 SQL 변환, 데이터 모델링, 잘 구조화된 대시보드에 중점을 둔 엔지니어를 위한 오픈 소스 BI 및 분석 도구인 Quary를 출시했습니다.",
      "코드 우선 접근 방식과 깔끔한 대시보드에 초점을 맞춰 곧 출시될 유료 기능, 확장성 향상, dbt, Lightdash, Grafana와의 비교를 암시하는 긍정적인 피드백이 접수되었습니다.",
      "사용자들은 Quary를 사용하여 화이트 라벨을 붙이고 제품에 BI를 삽입하는 데 관심을 보였으며, BIRT 및 Rill과 같은 도구와 유사점을 발견했습니다."
    ],
    "points": 234,
    "commentCount": 64,
    "retryCount": 0,
    "time": 1715781755
  },
  {
    "id": 40369119,
    "title": "이메일 필터를 우회하는 'PGP 메시지 시작' 사용",
    "originLink": "https://nondeterministic.computer/@martin/112444389342113780",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40369119",
    "commentBody": "",
    "originSummary": [
      "비결정적.컴퓨터는 마스토돈 기반의 분산형 소셜 네트워크로, 미디어, 투표, 답글 및 민감한 언어에 대한 필터가 포함된 임베드에 대한 검색 옵션을 제공합니다.",
      "사용자는 별도의 서버에 있는 자신의 계정에서 실시간 피드를 탐색하고, 프로필과 해시태그를 팔로우하고, 다른 사람들과 소통할 수 있습니다.",
      "서버 통계로 관리되는 사용자는 비결정론적.computer와 마스토돈에 대한 정보를 자세히 살펴볼 수 있습니다."
    ],
    "commentSummary": [
      "이 대화에서는 암호화된 압축 파일과 PGP 서명을 포함한 기업 이메일 필터 우회에 대해 자세히 살펴보며 이메일 보안과 필터의 효과에 대한 우려를 강조합니다.",
      "사용자들은 스팸 이메일에 대한 경험, 머신러닝 모델에 대한 의존도에 대한 의문, 이메일 재작성 관행 및 DKIM 헤더에 대한 문제를 논의합니다."
    ],
    "points": 205,
    "commentCount": 59,
    "retryCount": 0,
    "time": 1715790728
  },
  {
    "id": 40366137,
    "title": "도전적인 7학년 학생: 약물 사용 문제 해결",
    "originLink": "https://www.experimental-history.com/p/how-to-get-7th-graders-to-smoke",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40366137",
    "commentBody": "",
    "originSummary": [
      "예방 프로그램이 초등학교 7학년 학생들의 약물 사용 문제를 해결하지 못하고 있으며, 인간의 행동을 쉽게 바꿀 수 있다는 생각에 의문을 제기합니다.",
      "윤리 교육과 개인적 개선 방법은 암묵적 편견을 해결하는 데 효과적이지 않으며, 의사 결정에 있어 비판적 사고의 필요성을 강조합니다.",
      "이 글은 보편적인 출판 전 동료 검토 시스템을 비판하며, 진실을 추구하고 활용하기 위한 자료로 실험사 뉴스레터를 제안합니다."
    ],
    "commentSummary": [
      "이 토론에서는 다양한 물질의 위험성과 건강 결과에 미치는 영향을 강조하는 약물 교육 프로그램의 효과를 평가하고, D.A.R.E.와 같은 약물 교육 프로그램의 효과를 평가합니다.",
      "대마초, MDMA, LSD와 같은 약물과 관련된 안전성과 위험성에 대해 알아보고, 흡연 습관에 대한 오해와 미디어의 영향에 대해 다룹니다.",
      "약물 사용과 중독에 대한 자비로운 접근 방식을 옹호하며, 겁주기 전술과 조작보다 사실에 입각한 정보의 중요성을 강조합니다."
    ],
    "points": 203,
    "commentCount": 239,
    "retryCount": 0,
    "time": 1715776884
  }
]
