[
  {
    "id": 40368016,
    "title": "Adobe Photoshop 1.0.1 lähdekoodin tutkiminen",
    "originLink": "https://computerhistory.org/blog/adobe-photoshop-source-code/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40368016",
    "commentBody": "",
    "originSummary": [
      "Tietokonehistoriallisessa museossa on näyttelyitä, julkaisuja ja tapahtumia, joissa perehdytään tietotekniikan historiaan.",
      "Thomas ja John Knollin laatima Adobe Photoshop 1.0.1:n lähdekoodi vuodelta 1990 on nyt saatavilla ei-kaupalliseen käyttöön, mikä korostaa ohjelmiston hienostunutta suunnittelua.",
      "Museo tarjoaa arvokkaita näkökulmia ohjelmistoarkkitehti Grady Boochilta, joka esittelee erityisen näkymän Photoshopin varhaiseen kehitykseen."
    ],
    "commentSummary": [
      "Keskustelussa tarkastellaan Adoben suunnitteluohjelmistojen, kuten Photoshopin, Illustratorin ja PostScriptin, lähdekoodin säilyttämisen merkitystä 90-luvulla ja korostetaan sen historiallista merkitystä.",
      "Siinä verrataan Adoben tuotteita avoimen lähdekoodin vaihtoehtoihin, kuten GIMP:iin ja Kritaan, ja tarkastellaan samalla käyttöliittymien, ohjelmistosuositusten ja tavaramerkkien kehitystä.",
      "Ohjelmistoperinnön kaltaisten organisaatioiden ponnistelut lähdekoodin suojelemiseksi kulttuuriperintönä tuleville sukupolville korostuvat."
    ],
    "points": 535,
    "commentCount": 198,
    "retryCount": 0,
    "time": 1715785935
  },
  {
    "id": 40367331,
    "title": "Apple esittelee uusia saavutettavuusominaisuuksia: Silmäseuranta ja muuta",
    "originLink": "https://www.apple.com/newsroom/2024/05/apple-announces-new-accessibility-features-including-eye-tracking/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40367331",
    "commentBody": "",
    "originSummary": [
      "Apple esittelee uusia saavutettavuusominaisuuksia, kuten Eye Tracking ja Music Haptics, jotka auttavat käyttäjiä, joilla on fyysisiä vammoja, kuurous ja liikuntapahoinvointi.",
      "Teknologiajätti on edelleen omistautunut osallisuuden edistämiselle päivittämällä laitteitaan kaikkien asiakkaiden käyttökokemuksen parantamiseksi.",
      "Aloitteet, kuten ilmaiset istunnot Apple Storen toimipisteissä ja sovellusten, pelien ja harjoitusten edistäminen, korostavat saavutettavuutta ja osallisuutta samaan aikaan maailmanlaajuisen saavutettavuustietoisuuspäivän kanssa."
    ],
    "commentSummary": [
      "Apple esittelee uusia esteettömyysominaisuuksia, kuten silmäseurannan, laitteisiinsa, mikä herättää keskustelua liikuntapahoinvoinnista, nälästä, ajoneuvotyypeistä ja korrelaatioista esteettömyyden kanssa.",
      "Keskustelussa käsitellään muun muassa VoiceOver for iOS 17:ää, silmäseurannan eettistä käyttöä, teknologian esteettömyyden parantamista ja vinkkien jakamista Applen esteettömyysominaisuuksien hyödyntämisestä henkilökohtaisten mieltymysten mukaan.",
      "Käyttäjät käsittelevät myös vammaisten oikeuksia koskevia oikeudellisia puitteita, valtavirran tekniikan haasteita saavutettavuuden kannalta sekä mahdollisia edistysaskeleita musiikin ja tekniikan saavutettavuudessa. He keskustelevat Touch ID:stä, Face ID:stä sekä silmienseurantatekniikan hyödyistä, kohtuuhintaisuudesta ja yksityisyyden suojaan liittyvistä huolenaiheista."
    ],
    "points": 400,
    "commentCount": 220,
    "retryCount": 0,
    "time": 1715782925
  },
  {
    "id": 40366962,
    "title": "Käyttäjän turhautuminen: Broadcomin epäystävällisellä verkkosivustolla navigointi",
    "originLink": "https://matduggan.com/the-worst-website-in-the-entire-world/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40366962",
    "commentBody": "",
    "originSummary": [
      "Kirjoittaja kertoo turhauttavasta kohtaamisesta Broadcomin verkkosivuston kanssa, kun hän yritti ladata VMware-ohjelmistoa, ja korostaa sivuston huonoa suunnittelua ja käyttäjäystävällisiä ominaisuuksia.",
      "He ilmaisevat epäuskonsa käyttäjäystävällisyyden puutteeseen ja ehdottavat, että Broadcomin olisi harkittava alustan uudistamista käyttäjäystävällisemmäksi."
    ],
    "commentSummary": [
      "Keskustelussa käsitellään verkkosuunnittelun ja käyttäjäkokemuksen haasteita ja korostetaan muun muassa monimutkaista navigointia, perustoimintojen rajoituksia ja käyttäjien turhautumista huonosti suunniteltuihin yritysohjelmistoihin.",
      "Käyttäjät ovat tyytymättömiä esimerkiksi IBM:n Fix Centralin, SAP Ariban ja Workdayn kaltaisiin verkkosivustoihin ja vetoavat salasanavaatimuksiin ja verkkomenettelyihin liittyviin ongelmiin.",
      "Aiheita ovat muun muassa verkkoturvallisuus, teknologian väärinkäyttö ja huolenaiheet, jotka liittyvät käyttäjien tietojen hyödyntämiseen yritysten toimesta, sekä eri verkkosivustojen ja yritysohjelmistojen kanssa vuorovaikutuksessa ilmenevät ongelmat ja haasteet."
    ],
    "points": 362,
    "commentCount": 181,
    "retryCount": 0,
    "time": 1715781139
  },
  {
    "id": 40366204,
    "title": "N64Recomp-projekti parantaa Nintendo 64 -pelejä PC:llä",
    "originLink": "https://www.tomshardware.com/video-games/nearly-all-nintendo-64-games-can-now-be-recompiled-into-native-pc-ports-to-add-proper-ray-tracing-ultrawide-high-fps-and-more",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40366204",
    "commentBody": "",
    "originSummary": [
      "N64-pelit ovat nyt muunnettavissa PC-versioiksi, joissa on parannuksia, kuten säteenseuranta ja korkea FPS, GitHubin N64Recomp-projektin avulla.",
      "Mr-Wiseguyn johtaman projektin tavoitteena on säilyttää alkuperäinen pelikokemus ja parantaa samalla grafiikkaa ja suorituskykyä, jotta se vetoaisi pelien säilyttäjiin ja N64-harrastajiin.",
      "Avoimen lähdekoodin projektien, homebrew-pelien ja N64:n edistysaskeleiden lisääntyminen on herättänyt kiinnostuksen konsolin pelikirjastoa kohtaan, sillä ne tarjoavat modernin pelikokemuksen klassikkopeleille."
    ],
    "commentSummary": [
      "Keskustelu pyörii työkalun ympärillä, jonka avulla Nintendo 64:n pelit voidaan kääntää uudelleen PC-versioiksi, mikä herättää huolta toteutettavuudesta ja laillisuudesta.",
      "Keskusteluissa käsitellään yhteensopivuuteen liittyviä haasteita, oikeudellisia näkökohtia ja ROM-levyjen analysointia, emuloinnin teknisiä yksityiskohtia, kuten 32-bittisten pelien ajamista nykyaikaisilla järjestelmillä ja N64-emuloinnin rajoituksia eri alustoilla.",
      "Aiheita ovat muun muassa virallisten ja fanien tekemien emulaatioiden vertailu, N64-emulaation suorituskyvyn parantaminen, mahdolliset parannukset, kuten Goldeneyen uudelleenkääntäminen, Nintendon vastaus emulaation edistymiseen ja Protonin käyttö pelien siirtämiseen turnauskonfliktien keskellä."
    ],
    "points": 351,
    "commentCount": 159,
    "retryCount": 0,
    "time": 1715777299
  },
  {
    "id": 40366443,
    "title": "Veressä olevat proteiinit avaimet syövän varhaiseen havaitsemiseen",
    "originLink": "https://www.theguardian.com/society/article/2024/may/15/proteins-blood-cancer-warning-seven-years-study",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40366443",
    "commentBody": "",
    "originSummary": [
      "Oxfordin yliopiston tutkijat löysivät 618 veriproteiinia, jotka liittyvät 19 syöpätyyppiin, joista 107 liittyi yli seitsemän vuotta myöhemmin diagnosoituihin syöpiin, mikä viittaa mahdollisuuteen havaita syöpä varhaisessa vaiheessa.",
      "Tiettyjen veriproteiinien muuttaminen voi vaikuttaa yhdeksän syöpätyypin kehittymisen riskiin, mikä lupaa vaikuttaa syövän ehkäisyyn ja varhaiseen diagnosointiin.",
      "Tämä löytö on merkittävä edistysaskel kohonneen syöpäriskin merkkiaineiden määrittämisessä ja syövän varhaisessa havaitsemisessa, kuten alan asiantuntijat ovat todenneet."
    ],
    "commentSummary": [
      "Syövän varhainen toteaminen on ratkaisevan tärkeää, ja eri testausmenetelmien hyödyistä ja riskeistä keskustellaan.",
      "Parempien terveydenhuoltoresurssien, avoimien päätöksentekoprosessien ja elintapamuutosten merkitystä syövän ehkäisyssä korostetaan.",
      "Lisäksi käsitellään haasteita, jotka liittyvät käytännön biomarkkereiden luomiseen verestä syövän havaitsemista varten, ja oikeudellisia takeita geneettistä syrjintää vastaan vakuutusturvassa."
    ],
    "points": 327,
    "commentCount": 121,
    "retryCount": 0,
    "time": 1715778668
  },
  {
    "id": 40371612,
    "title": "Uudet eksponenttifunktiot lisäävät SiLU:n ja SoftMaxin nopeutta 2x",
    "originLink": "https://github.com/ggerganov/llama.cpp/pull/7154",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40371612",
    "commentBody": "",
    "originSummary": [
      "GitHubin llama.cpp-repositoriossa on 58,3k tähteä ja 8,3k haaraa.",
      "Contributor jart parantaa silu- ja softmax-funktioita suorittimelle ja sisällyttää niihin AVX512- ja AVX2-käskyjä eksponenttiarvojen laskentaa varten, mikä parantaa suorituskykyä vertailuarvoissa, joissa ULP-virhe on alle 1.",
      "Kirjoittaja korostaa vpermi2pd:n käyttöä Float64-/tuplahakutaulukoissa ja huomauttaa, että Zen4:n tai icelake-client/tigerlake-laitteiston kaltaiset laitteistot eivät ehkä hyödy siitä yhtä paljon, koska taulukon on mahduttava kahteen rekisteriin."
    ],
    "commentSummary": [
      "Uudet eksponenttifunktiot on luotu SiLU- ja SoftMax-laskentojen nopeuttamiseksi tarkkuuden säilyttäen tutkasignaaliprosessorista saatujen kokemusten perusteella.",
      "Toteutus optimoi eksponentiaalilaskennat hakutaulukoiden avulla hyödyntäen SIMD:tä ja C:n ja C++:n laitteisto-ominaisuuksia.",
      "Keskustelua käydään ei-ajankohtaisista lataus- ja varastointiohjeista, hakutaulukoiden rajoituksista, tietojenkäsittelyn suorituskyvyn vaihteluista, llama.cpp:n suorituskyvyn parannuksista, ML-ajoaikavertailuista, TensorFlow Liten ja ONNX:n käytöstä mallien käyttöönotossa, robotiikasta, animaatiosta, GPU-mallien vaikutuksista, suorittimen nopeuden parannuksista ja muistiarkkitehtuurin edistymisestä. Lisäksi suositellaan vertailuanalyysejä, joiden avulla voidaan määrittää tehokkain lähestymistapa tiettyihin tehtäviin."
    ],
    "points": 309,
    "commentCount": 58,
    "retryCount": 0,
    "time": 1715803021
  },
  {
    "id": 40369467,
    "title": "Otsikko: \"Datomic Pro 1.0.7075: Samanaikaisuus ja transaktionaalinen oikeellisuus\"",
    "originLink": "https://jepsen.io/analyses/datomic-pro-1.0.7075",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40369467",
    "commentBody": "",
    "originSummary": [
      "Datomic on yleiskäyttöinen tietokanta, joka hyödyntää EAV-kolmioita ja loogisia aikaleimoja ja tarjoaa Datomic Pro- ja Datomic Cloud -arkkitehtuurit.",
      "Tietokanta varmistaa suorituskyvyn vuoksi lukemisen ja kirjoittamisen erottelun ja takaa ACID-transaktiot, vaikka samanaikaiset transaktiot voivat johtaa odottamattomiin tuloksiin.",
      "Käyttäjien on käsiteltävä transaktiofunktioita ja entiteettispeksejä varovasti, jotta vältetään poikkeamat, vaikka Datomicin rinnakkaissuunnittelu ja transaktioiden oikeellisuus ovatkin yksinkertaisia."
    ],
    "commentSummary": [
      "Artikkelissa käsitellään Datomic Pro 1.0.7075:n julkaisua ja korostetaan onnistunutta Jepsen-testausta sekä selkeän dokumentaation ja invarianttien noudattamisen merkitystä.",
      "Siinä käsitellään Datomicin tietokantajärjestelmän käytön haasteita ja etuja, mukaan lukien sudenkuopat, kompromissit, kattava testaus, skaalautuvuus, tapahtumien valvonta ja turvaominaisuudet.",
      "Mainitaan rikkinäiset linkit Datomicin verkkosivustolla ja aphyrin oivaltavat konferenssipuheet."
    ],
    "points": 282,
    "commentCount": 55,
    "retryCount": 0,
    "time": 1715792250
  },
  {
    "id": 40365882,
    "title": "Ennennäkemätön hiilidioksidin nousu 50 000 vuodessa: Ihmisen toiminta johtava tekijä",
    "originLink": "https://today.oregonstate.edu/news/researchers-identify-fastest-rate-natural-carbon-dioxide-rise-over-last-50000-years",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40365882",
    "commentBody": "",
    "originSummary": [
      "Oregonin osavaltionyliopiston tutkijat ovat löytäneet nopeimman luonnollisen hiilidioksidipitoisuuden nousun viimeiseen 50 000 vuoteen tutkimalla muinaista Etelämantereen jäätä.",
      "Proceedings of the National Academy of Sciences -julkaisussa julkaistun tutkimuksen mukaan ilmakehän hiilidioksidipitoisuuden nykyinen nousuvauhti on kymmenen kertaa nopeampi kuin millään muulla historiallisella ajanjaksolla, mikä johtuu pääasiassa ihmisen toiminnasta.",
      "Tämä tutkimus tarjoaa arvokasta tietoa historiallisista ilmastonmuutostapahtumista ja nykypäivän ilmastonmuutoksen mahdollisista seurauksista, ja siinä korostetaan ilmakehän hiilidioksidipitoisuuksien ennennäkemätöntä korkeutta."
    ],
    "commentSummary": [
      "Artikkelissa käsitellään hiilidioksidin nopeimman luonnollisen nousun aiheuttamia haasteita 50 000 vuoteen, keinotekoisen yleisen älykkyyden riskejä, ydinkonflikteja ja ilmastonmuutosta.",
      "Siinä korostetaan inhimillisen kekseliäisyyden ratkaisevaa roolia näiden ongelmien ratkaisemisessa ja mainitaan historiallisia tapauksia, joissa ydinkatastrofit on voitu välttää.",
      "Keskusteluissa käsitellään hiilidioksidipitoisuuden nousua, stratosfäärin aerosoli-injektioiden kaltaisia ratkaisuja ja erilaisia näkemyksiä päästövähennysten kiireellisyydestä ja toteuttamiskelpoisuudesta ilmastonmuutoksen torjumiseksi, mutta myös tieteiskirjallisuuden yhteiskunnallista vaikutusta ja AGI-riskien ympärillä käytäviä keskusteluja."
    ],
    "points": 249,
    "commentCount": 451,
    "retryCount": 0,
    "time": 1715775238
  },
  {
    "id": 40365198,
    "title": "Oracle vaihtaa OpenTofun Terraformista OpenTofuun",
    "originLink": "https://www.thestack.technology/oracle-dumps-terraform-for-opentofu/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40365198",
    "commentBody": "",
    "originSummary": [
      "Oracle on vaihtanut Terraformin avoimen lähdekoodin vaihtoehtoon OpenTofu Oracle E-Business Suite Cloud Managerissa, mikä edellyttää, että asiakkaiden on siirryttävä 30. kesäkuuta 2024 mennessä Terraformin luojan, HashiCorpin, lisenssimuutosten jälkeen.",
      "OpenTofu koetaan Terraformia lempeämmäksi ja liiketoimintaan sopivammaksi ratkaisuksi.",
      "IBM ostaa Terraformin alkuperäisen kehittäjän HashiCorpin 6,7 miljardilla dollarilla, mikä on osoitus alan merkittävistä muutoksista."
    ],
    "commentSummary": [
      "Oracle on siirtymässä Terraformista OpenTofu 1.7:ään, jossa otetaan käyttöön ominaisuuksia, kuten päästä päähän -tilan salaus.",
      "Teknologiayhteisö on siirtymässä OpenTofun suuntaan, ja se korostaa keskusteluja Terraformin rajoituksista, vaihtoehtoisista työkaluista ja infrastruktuurin hallinnan haasteista.",
      "Keskusteluissa käsitellään Oraclen tukea, Oracle Linuxin käyttöä suorituskyvyn parantamiseksi, IT-hallintotyön ulkoistamista, Oraclen EBS-roolia ja avoimen lähdekoodin hankkeiden lisenssisopimuksiin liittyviä huolenaiheita, ja korostetaan monimuotoisuuden ja strategisen resurssien jakamisen tarvetta teknologia-alalla."
    ],
    "points": 249,
    "commentCount": 173,
    "retryCount": 0,
    "time": 1715770233
  },
  {
    "id": 40367090,
    "title": "Quary: BI-työkalu insinööreille",
    "originLink": "https://github.com/quarylabs/quary",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40367090",
    "commentBody": "",
    "originSummary": [
      "Quary on insinöörikeskeinen BI/analytiikkatyökalu, joka käsittelee insinöörien ongelmia itsepalvelu-BI:n kanssa sisällyttämällä siihen vakioidut ohjelmistokäytännöt.",
      "Se integroituu tietokantoihin, erityisesti Supabaseen, ja se on nyt saatavilla avoimena lähdekoodina Apache 2.0 -lisenssillä.",
      "Suunniteltuihin päivityksiin kuuluu verkkoalusta tietomallien jakamiseen ja orkestrointimoottori, ja käyttäjiä kehotetaan testaamaan Quarya ja antamaan panoksensa."
    ],
    "commentSummary": [
      "Quary Labs julkaisi avoimen lähdekoodin BI- ja analyysityökalun, Quaryn, joka on suunnattu insinööreille ja jossa korostetaan SQL-muunnoksia, tietojen mallintamista ja hyvin jäsenneltyjä kojelautoja.",
      "Myönteistä palautetta on saatu, ja siinä on vihjattu tulevista maksullisista ominaisuuksista, laajennettavuuden lisäämisestä ja vertailuista dbt:hen, Lightdashiin ja Grafanaan, joissa keskitytään koodi-ensimmäiseen lähestymistapaan ja selkeisiin kojelautoihin.",
      "Käyttäjät ovat osoittaneet kiinnostusta Quaryn käyttämiseen valkoisen merkinnän tekemiseen ja BI:n upottamiseen tuotteisiinsa, mikä on rinnastettavissa BIRTin ja Rillin kaltaisiin työkaluihin."
    ],
    "points": 234,
    "commentCount": 64,
    "retryCount": 0,
    "time": 1715781755
  },
  {
    "id": 40369119,
    "title": "Käyttämällä \"BEGIN PGP MESSAGE\" ohittaa sähköpostisuodattimet.",
    "originLink": "https://nondeterministic.computer/@martin/112444389342113780",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40369119",
    "commentBody": "",
    "originSummary": [
      "Nondeterministic.computer on Mastodoniin perustuva hajautettu sosiaalinen verkosto, joka tarjoaa hakuvaihtoehtoja medialle, gallupeille ja upotuksille sekä suodattimia vastauksia ja arkaluonteista kieltä varten.",
      "Käyttäjät voivat tutkia live-syötteitä, seurata profiileja ja hashtageja sekä olla yhteydessä muihin käyttäjiin omalta tililtään erillisellä palvelimella.",
      "Palvelintilastojen hallinnoimana käyttäjät voivat syventyä sekä nondeterministic.computerin että Mastodonin tietoihin."
    ],
    "commentSummary": [
      "Keskustelussa käsitellään yritysten sähköpostisuodattimien kiertämistä, mukaan lukien salattuja zip-siruja ja PGP-allekirjoituksia, ja tuodaan esiin huolenaiheita sähköpostin turvallisuudesta ja suodattimien tehokkuudesta.",
      "Käyttäjät keskustelevat kokemuksista roskapostiviesteistä, kyseenalaistavat koneoppimismalleihin turvautumisen ja käsittelevät sähköpostin uudelleenkirjoituskäytäntöihin ja DKIM-otsakkeisiin liittyviä kysymyksiä."
    ],
    "points": 205,
    "commentCount": 59,
    "retryCount": 0,
    "time": 1715790728
  },
  {
    "id": 40366137,
    "title": "Haastavat 7. luokkalaiset: Huumeidenkäyttöön puuttuminen",
    "originLink": "https://www.experimental-history.com/p/how-to-get-7th-graders-to-smoke",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40366137",
    "commentBody": "",
    "originSummary": [
      "Ennaltaehkäisyohjelmat eivät onnistu 7.-luokkalaisten huumeidenkäytön vähentämisessä, mikä kyseenalaistaa ajatuksen siitä, että ihmisten käyttäytymistä voidaan muuttaa helposti.",
      "Eettinen koulutus ja henkilökohtaiset parannusmenetelmät ovat tehottomia implisiittisten ennakkoluulojen käsittelemisessä, mikä korostaa kriittisen ajattelun tarvetta päätöksenteossa.",
      "Artikkelissa kritisoidaan julkaisua edeltävää yleistä vertaisarviointijärjestelmää ja ehdotetaan Experimental History -uutiskirjettä totuuden etsimisen ja hyödyntämisen resurssiksi."
    ],
    "commentSummary": [
      "Keskustelussa arvioidaan D.A.R.E.-ohjelman kaltaisten huumausainekasvatusohjelmien tehokkuutta ja tuodaan esiin eri aineiden riskejä ja niiden vaikutusta terveyteen.",
      "Siinä tarkastellaan kannabiksen, MDMA:n ja LSD:n kaltaisten huumeiden turvallisuutta ja riskejä sekä käsitellään väärinkäsityksiä ja median vaikutusta tupakointitottumuksiin.",
      "Kannattaa myötätuntoista lähestymistapaa huumeiden käyttöön ja riippuvuuteen ja korostaa tosiasioihin perustuvan tiedon merkitystä pelottelutaktiikan ja manipuloinnin sijaan."
    ],
    "points": 203,
    "commentCount": 239,
    "retryCount": 0,
    "time": 1715776884
  }
]
