[
  {
    "id": 40368016,
    "title": "استكشاف أدوبي فوتوشوب 1.0.1 شفرة المصدر",
    "originLink": "https://computerhistory.org/blog/adobe-photoshop-source-code/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40368016",
    "commentBody": "",
    "originSummary": [
      "يتميز متحف تاريخ الكمبيوتر بالمعارض والمنشورات والأحداث التي تتعمق في تاريخ تكنولوجيا الكمبيوتر.",
      "الكود المصدري ل Adobe Photoshop 1.0.1 لعام 1990 ، الذي صممه توماس وجون نول ، متاح الآن للاستخدام غير التجاري ، مما يسلط الضوء على التصميم المتطور للبرنامج.",
      "يقدم المتحف وجهات نظر قيمة من مهندس البرمجيات جرادي بوش ، حيث يقدم وجهة نظر خاصة حول التطور المبكر لبرنامج Photoshop."
    ],
    "commentSummary": [
      "تستكشف المناقشة أهمية الحفاظ على شفرة المصدر لبرامج تصميم Adobe مثل Photoshop و Illustrator و PostScript من 90s ، مع تسليط الضوء على أهميتها التاريخية.",
      "يقارن منتجات Adobe ببدائل مفتوحة المصدر مثل GIMP و Krita أثناء فحص تطور واجهات المستخدم وتفضيلات البرامج وإرشادات العلامات التجارية.",
      "يتم التأكيد على الجهود التي تبذلها منظمات مثل Software Heritage لحماية شفرة المصدر كتراث ثقافي للأجيال القادمة."
    ],
    "points": 535,
    "commentCount": 198,
    "retryCount": 0,
    "time": 1715785935
  },
  {
    "id": 40367331,
    "title": "تقدم Apple ميزات جديدة لإمكانية الوصول: تتبع العين والمزيد",
    "originLink": "https://www.apple.com/newsroom/2024/05/apple-announces-new-accessibility-features-including-eye-tracking/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40367331",
    "commentBody": "",
    "originSummary": [
      "تكشف Apple النقاب عن ميزات جديدة لإمكانية الوصول مثل Eye Tracking و Music Haptics لمساعدة المستخدمين الذين يعانون من إعاقات جسدية وصمم ودوار الحركة.",
      "لا تزال شركة التكنولوجيا العملاقة مكرسة للشمولية من خلال تحديث أجهزتها لتعزيز تجربة المستخدم لجميع العملاء.",
      "تؤكد مبادرات مثل الجلسات المجانية في مواقع Apple Store والترويج للتطبيقات والألعاب والتدريبات على إمكانية الوصول والشمول ، بالتزامن مع اليوم العالمي للتوعية بإمكانية الوصول."
    ],
    "commentSummary": [
      "تقدم Apple ميزات جديدة لإمكانية الوصول مثل تتبع العين لأجهزتها ، مما يثير مناقشات حول دوار الحركة والجوع وأنواع المركبات والارتباطات مع إمكانية الوصول.",
      "يتعمق الحوار في موضوعات مثل VoiceOver لنظام التشغيل iOS 17 ، والاستخدام الأخلاقي لتتبع العين ، وتحسين إمكانية الوصول في التكنولوجيا ، ومشاركة النصائح حول استخدام ميزات إمكانية الوصول من Apple بناء على التفضيلات الشخصية.",
      "يتطرق المستخدمون أيضا إلى الأطر القانونية لحقوق الإعاقة ، والتحديات في التكنولوجيا السائدة لإمكانية الوصول ، والتطورات المحتملة في إمكانية الوصول إلى الموسيقى والتكنولوجيا ، ومناقشة Touch ID و Face ID والفوائد والقدرة على تحمل التكاليف ومخاوف الخصوصية المتعلقة بتقنية تتبع العين."
    ],
    "points": 400,
    "commentCount": 220,
    "retryCount": 0,
    "time": 1715782925
  },
  {
    "id": 40366962,
    "title": "إحباط المستخدم: التنقل في موقع Broadcom غير الودي",
    "originLink": "https://matduggan.com/the-worst-website-in-the-entire-world/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40366962",
    "commentBody": "",
    "originSummary": [
      "يروي المؤلف مواجهة محبطة مع موقع Broadcom على الويب عند محاولة تنزيل برنامج VMware ، مع التركيز على التصميم السيئ للموقع والميزات غير الودية للمستخدم.",
      "يعربون عن عدم تصديقهم لعدم سهولة الاستخدام ويقترحون أن تفكر Broadcom في تجديد النظام الأساسي للحصول على تجربة أكثر سهولة في الاستخدام."
    ],
    "commentSummary": [
      "تتناول المناقشة التحديات في تصميم الويب وتجربة المستخدم ، مع التركيز على قضايا مثل التنقل المعقد ، والقيود المفروضة على الوظائف الأساسية ، وإحباط المستخدم من برامج المؤسسات سيئة التصميم.",
      "المستخدمون غير راضين عن مواقع الويب مثل Fix Central و SAP Ariba و Workday من IBM ، مشيرين إلى مشاكل في متطلبات كلمة المرور والإجراءات عبر الإنترنت.",
      "تشمل الموضوعات أمان الويب ، وإساءة استخدام التكنولوجيا ، والمخاوف المتعلقة باستغلال بيانات المستخدم من قبل الشركات ، وإلقاء الضوء على تعقيدات وتحديات التفاعل مع مواقع الويب المختلفة وبرامج المؤسسات."
    ],
    "points": 362,
    "commentCount": 181,
    "retryCount": 0,
    "time": 1715781139
  },
  {
    "id": 40366204,
    "title": "مشروع N64Recomp يعزز ألعاب نينتندو 64 على جهاز الكمبيوتر",
    "originLink": "https://www.tomshardware.com/video-games/nearly-all-nintendo-64-games-can-now-be-recompiled-into-native-pc-ports-to-add-proper-ray-tracing-ultrawide-high-fps-and-more",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40366204",
    "commentBody": "",
    "originSummary": [
      "أصبحت ألعاب N64 الآن قابلة للتحويل إلى إصدارات أصلية من أجهزة الكمبيوتر مع تحسينات مثل تتبع الأشعة و FPS العالي باستخدام مشروع N64Recomp على GitHub.",
      "بقيادة Mr-Wiseguy ، يهدف المشروع إلى الحفاظ على تجربة اللعب الأصلية مع تحسين الرسومات والأداء ، وجذب دعاة الحفاظ على البيئة وعشاق N64.",
      "يؤدي ظهور المشاريع مفتوحة المصدر وألعاب البيرة المنزلية وتطورات N64 إلى تنشيط الاهتمام بمكتبة ألعاب وحدة التحكم ، مما يوفر تجربة ألعاب حديثة للعناوين الكلاسيكية."
    ],
    "commentSummary": [
      "يدور النقاش حول أداة تمكن من إعادة تجميع ألعاب Nintendo 64 في منافذ الكمبيوتر الشخصي ، مما يثير مخاوف بشأن الجدوى والشرعية.",
      "تغطي المناقشات التحديات المتعلقة بالتوافق والجوانب القانونية وتشريح ذاكرة القراءة فقط ، والخوض في الجوانب الفنية للمحاكاة مثل تشغيل ألعاب 32 بت على الأنظمة المعاصرة وقيود محاكاة N64 على منصات متنوعة.",
      "تشمل الموضوعات مقارنات بين المحاكاة الرسمية ومن صنع المعجبين ، وتحسين أداء مضاهاة N64 ، والتحسينات المحتملة مثل إعادة تجميع Goldeneye ، واستجابة Nintendo لتقدم المحاكاة ، واستخدام Proton لنقل اللعبة وسط صراعات البطولة."
    ],
    "points": 351,
    "commentCount": 159,
    "retryCount": 0,
    "time": 1715777299
  },
  {
    "id": 40366443,
    "title": "البروتينات في الدم تحمل مفتاح الكشف المبكر عن السرطان",
    "originLink": "https://www.theguardian.com/society/article/2024/may/15/proteins-blood-cancer-warning-seven-years-study",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40366443",
    "commentBody": "",
    "originSummary": [
      "حدد الباحثون في جامعة أكسفورد 618 بروتينا في الدم مرتبطا ب 19 نوعا من السرطان ، مع 107 منها مرتبطة بالسرطانات التي تم تشخيصها بعد أكثر من سبع سنوات ، مما يشير إلى إمكانية الكشف المبكر عن السرطان.",
      "يمكن أن يؤثر تغيير بروتينات دم معينة على خطر الإصابة بتسعة أنواع من السرطان ، مما يبشر بالخير للتأثير على الوقاية من السرطان والتشخيص المبكر.",
      "يمثل هذا الاكتشاف تقدما كبيرا في تحديد علامات زيادة خطر الإصابة بالسرطان والمساعدة في الكشف المبكر عن السرطان ، على النحو المعترف به من قبل الخبراء في هذا المجال."
    ],
    "commentSummary": [
      "يعد الاكتشاف المبكر في فحص السرطان أمرا بالغ الأهمية ، حيث تتم مناقشة فوائد ومخاطر طرق الاختبار المختلفة.",
      "تم التأكيد على أهمية تعزيز موارد الرعاية الصحية وعمليات صنع القرار الشفافة وتغيير نمط الحياة للوقاية من السرطان.",
      "كما يتم تناول التحديات التي تواجه إنشاء مؤشرات حيوية عملية للدم للكشف عن السرطان والضمانات القانونية ضد التمييز الجيني في التغطية التأمينية."
    ],
    "points": 327,
    "commentCount": 121,
    "retryCount": 0,
    "time": 1715778668
  },
  {
    "id": 40371612,
    "title": "وظائف الأس الجديدة تعزز سرعة SiLU و SoftMax بمقدار 2x",
    "originLink": "https://github.com/ggerganov/llama.cpp/pull/7154",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40371612",
    "commentBody": "",
    "originSummary": [
      "يضم مستودع llama.cpp على GitHub 58.3 ألف نجمة و 8.3 ألف شوكة.",
      "يعمل المساهم جارت على تحسين وظائف silu و softmax لوحدة المعالجة المركزية ، ودمج تعليمات AVX512 و AVX2 لحسابات القيمة الأسية ، مما يدل على تحسين الأداء في المعايير مع أقل من 1 خطأ ULP.",
      "يسلط المؤلف الضوء على استخدام vpermi2pd لجداول البحث Float64 / المزدوجة ويلاحظ أن الأجهزة مثل Zen4 أو icelake-client / tigerlake قد لا ترى فائدة كبيرة ، مع وجود قيود على أن الجدول يجب أن يتناسب مع سجلين."
    ],
    "commentSummary": [
      "يتم إنشاء وظائف الأس الجديدة لتسريع حسابات SiLU و SoftMax مع الحفاظ على الدقة ، بالاعتماد على التجارب مع معالج إشارة الرادار.",
      "يعمل التنفيذ على تحسين حسابات الأس من خلال جداول البحث ، والاستفادة من SIMD والعناصر الجوهرية للأجهزة في C و C ++.",
      "تغطي المناقشة تعليمات التحميل / التخزين غير الزمنية ، وقيود جدول البحث ، وفروق الأداء في معالجة البيانات ، وتحسينات الأداء ل llama.cpp ، ومقارنات وقت تشغيل ML ، و TensorFlow Lite و ONNX لنشر النموذج ، والروبوتات ، والرسوم المتحركة ، وتأثيرات نموذج GPU ، وتحسينات سرعة وحدة المعالجة المركزية ، وتطورات بنية الذاكرة ، مع توصية لقياس الأداء لتحديد النهج الأكثر فعالية لمهام محددة."
    ],
    "points": 309,
    "commentCount": 58,
    "retryCount": 0,
    "time": 1715803021
  },
  {
    "id": 40369467,
    "title": "العنوان: \"استكشاف Datomic Pro 1.0.7075: التزامن وصحة المعاملات\"",
    "originLink": "https://jepsen.io/analyses/datomic-pro-1.0.7075",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40369467",
    "commentBody": "",
    "originSummary": [
      "Datomic هي قاعدة بيانات للأغراض العامة تستخدم ثلاثية EAV والطوابع الزمنية المنطقية ، وتقدم Datomic Pro و Datomic Cloud بمعماريات متميزة.",
      "تضمن قاعدة البيانات فصل القراءة والكتابة للأداء وتضمن معاملات ACID ، على الرغم من أن المعاملات المتزامنة قد تؤدي إلى نتائج غير متوقعة.",
      "يحتاج المستخدمون إلى التعامل مع وظائف المعاملات ومواصفات الكيان بحذر لتجنب الحالات الشاذة ، على الرغم من تصميم التزامن المباشر ل Statmic وصحة المعاملات."
    ],
    "commentSummary": [
      "يغطي المقال إصدار Datomic Pro 1.0.7075 ، مع التركيز على اختبار Jepsen الناجح وأهمية التوثيق الواضح وفرض الثوابت.",
      "يناقش تحديات ومزايا استخدام نظام قاعدة بيانات Datomic، بما في ذلك المزالق والمفاضلات والاختبار الشامل وقابلية التوسع وضوابط المعاملات وميزات السلامة.",
      "المذكورة هي الروابط المعطلة على موقع Datomic ومحادثات المؤتمر الثاقبة من قبل aphyr."
    ],
    "points": 282,
    "commentCount": 55,
    "retryCount": 0,
    "time": 1715792250
  },
  {
    "id": 40365882,
    "title": "ارتفاع غير مسبوق في CO2 في 50 ألف سنة: النشاط البشري العامل الرئيسي",
    "originLink": "https://today.oregonstate.edu/news/researchers-identify-fastest-rate-natural-carbon-dioxide-rise-over-last-50000-years",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40365882",
    "commentBody": "",
    "originSummary": [
      "اكتشف باحثو جامعة ولاية أوريغون أسرع زيادة طبيعية في مستويات ثاني أكسيد الكربون في السنوات ال 50,000 الماضية من خلال دراسة جليد أنتاركتيكا القديم.",
      "المعدل الحالي لارتفاع CO2 في الغلاف الجوي أسرع بعشر مرات من أي فترة تاريخية أخرى ، ويرجع ذلك أساسا إلى الأنشطة البشرية ، وفقا للدراسة المنشورة في وقائع الأكاديمية الوطنية للعلوم.",
      "يقدم هذا البحث رؤى قيمة حول أحداث تغير المناخ التاريخية والتداعيات المحتملة لتغير المناخ اليوم ، مع التركيز على مستويات لا مثيل لها من CO2 في الغلاف الجوي."
    ],
    "commentSummary": [
      "يتناول المقال تحديات أسرع ارتفاع في ثاني أكسيد الكربون الطبيعي منذ 50000 عام ، إلى جانب مخاطر الذكاء الاصطناعي العام والصراع النووي وتغير المناخ.",
      "ويسلط الضوء على الدور الحاسم للإبداع البشري في معالجة هذه القضايا ويستشهد بالحالات التاريخية لتجنب الكوارث النووية.",
      "تغطي المناقشات ارتفاع مستويات CO2 ، وحلول مثل حقن الهباء الجوي في الستراتوسفير ، ووجهات النظر المختلفة حول إلحاح وجدوى خفض الانبعاثات لمكافحة تغير المناخ ، مع التطرق أيضا إلى التأثير المجتمعي للخيال العلمي والمناقشات حول مخاطر AGI."
    ],
    "points": 249,
    "commentCount": 451,
    "retryCount": 0,
    "time": 1715775238
  },
  {
    "id": 40365198,
    "title": "أوراكل يتحول إلى OpenTofu من Terraform",
    "originLink": "https://www.thestack.technology/oracle-dumps-terraform-for-opentofu/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40365198",
    "commentBody": "",
    "originSummary": [
      "قامت Oracle بتبديل Terraform بالبديل مفتوح المصدر OpenTofu في Oracle E-Business Suite Cloud Manager ، مما يستلزم من العملاء الانتقال بحلول 30 يونيو 2024 ، بعد تعديلات الترخيص من قبل مبتكر Terraform ، HashiCorp.",
      "ينظر إلى OpenTofu على أنه حل أكثر تساهلا ومناسبا للأعمال من Terraform.",
      "تم الاستحواذ على HashiCorp ، المطور الأصلي ل Terraform ، من قبل IBM مقابل 6.7 مليار دولار ، مما يشير إلى تحركات كبيرة في الصناعة."
    ],
    "commentSummary": [
      "تنتقل Oracle من Terraform إلى OpenTofu 1.7 ، حيث تقدم ميزات مثل تشفير الحالة من طرف إلى طرف.",
      "يتحول مجتمع التكنولوجيا نحو OpenTofu ، مع التركيز على المناقشات حول قيود Terraform والأدوات البديلة وتحديات إدارة البنية التحتية.",
      "وتتضمن المناقشات دعم أوراكل، واستخدام أوراكل لينكس للأداء، والاستعانة بمصادر خارجية لعمل مسؤول تكنولوجيا المعلومات، ودور أوراكل إي بي إس، والمخاوف بشأن اتفاقيات الترخيص في المشاريع مفتوحة المصدر، مما يسلط الضوء على الحاجة إلى التنوع والتخصيص الاستراتيجي للموارد في قطاع التكنولوجيا."
    ],
    "points": 249,
    "commentCount": 173,
    "retryCount": 0,
    "time": 1715770233
  },
  {
    "id": 40367090,
    "title": "الاستعلام: أداة ذكاء الأعمال مفتوحة المصدر للمهندسين",
    "originLink": "https://github.com/quarylabs/quary",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40367090",
    "commentBody": "",
    "originSummary": [
      "Quary هي أداة ذكاء الأعمال / التحليلات التي تركز على المهندس والتي تعالج مشكلات المهندسين مع ذكاء الأعمال ذاتي الخدمة من خلال دمج ممارسات البرامج القياسية.",
      "يتكامل مع قواعد البيانات ، مع التركيز بشكل خاص على Supabase ، وهو متاح الآن كمصدر مفتوح بموجب ترخيص Apache 2.0.",
      "تتضمن التحديثات المخطط لها منصة ويب لمشاركة نماذج البيانات ومحرك تنسيق ، مع حث المستخدمين على اختبار Quary وتقديم المدخلات."
    ],
    "commentSummary": [
      "أصدرت Quary Labs أداة ذكاء الأعمال والتحليلات مفتوحة المصدر ، Quary ، تلبي احتياجات المهندسين ، مع التركيز على تحويلات SQL ونمذجة البيانات ولوحات المعلومات جيدة التنظيم.",
      "تم تلقي تعليقات إيجابية ، تلمح إلى الميزات المدفوعة القادمة ، وزيادة قابلية التوسعة ، والمقارنات مع dbt و Lightdash و Grafana ، مع التركيز على نهج الكود أولا ولوحات المعلومات المرتبة.",
      "أبدى المستخدمون اهتماما باستخدام Quary لوضع العلامات البيضاء وتضمين ذكاء الأعمال في منتجاتهم ، ورسم أوجه تشابه مع أدوات مثل BIRT و Rill."
    ],
    "points": 234,
    "commentCount": 64,
    "retryCount": 0,
    "time": 1715781755
  },
  {
    "id": 40369119,
    "title": "يؤدي استخدام \"بدء رسالة PGP\" إلى تجاوز عوامل تصفية البريد الإلكتروني",
    "originLink": "https://nondeterministic.computer/@martin/112444389342113780",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40369119",
    "commentBody": "",
    "originSummary": [
      "Nondeterministic.computer هي شبكة اجتماعية لامركزية تعتمد على Mastodon ، وتقدم خيارات بحث للوسائط واستطلاعات الرأي والتضمينات مع مرشحات للردود واللغة الحساسة.",
      "يمكن للمستخدمين استكشاف الخلاصات المباشرة ومتابعة الملفات الشخصية وعلامات التصنيف والتفاعل مع الآخرين من حساباتهم على خادم منفصل.",
      "تدار من خلال إحصائيات الخادم ، يمكن للمستخدمين الغوص بشكل أعمق في المعلومات حول كل من nondeterministic.computer و Mastodon."
    ],
    "commentSummary": [
      "تتعمق المحادثة في التحايل على فلاتر البريد الإلكتروني للشركات ، بما في ذلك السحابات المشفرة وتوقيعات PGP ، مما يسلط الضوء على المخاوف المتعلقة بأمان البريد الإلكتروني وفعالية المرشحات.",
      "يناقش المستخدمون تجارب رسائل البريد الإلكتروني غير المرغوب فيها ، ويتساءلون عن الاعتماد على نماذج التعلم الآلي ، ويعالجون المشكلات المتعلقة بممارسات إعادة كتابة البريد الإلكتروني ورؤوس DKIM."
    ],
    "points": 205,
    "commentCount": 59,
    "retryCount": 0,
    "time": 1715790728
  },
  {
    "id": 40366137,
    "title": "تحدي طلاب الصف 7: معالجة تعاطي المخدرات",
    "originLink": "https://www.experimental-history.com/p/how-to-get-7th-graders-to-smoke",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40366137",
    "commentBody": "",
    "originSummary": [
      "تفشل برامج الوقاية في معالجة تعاطي المخدرات بين طلاب الصف 7 ، وتتساءل عن فكرة تغيير السلوك البشري بسهولة.",
      "التدريب على الأخلاقيات وأساليب التحسين الشخصي غير فعالة في معالجة التحيزات الضمنية ، مع التأكيد على الحاجة إلى التفكير النقدي في صنع القرار.",
      "ينتقد المقال نظام مراجعة الأقران العالمي قبل النشر ، ويقترح النشرة الإخبارية للتاريخ التجريبي كمورد للبحث عن الحقيقة واستخدامها."
    ],
    "commentSummary": [
      "تقيم المناقشة فعالية برامج التثقيف الدوائي مثل D.A.R.E. ، مع تسليط الضوء على مخاطر المواد المختلفة وتأثيرها على النتائج الصحية.",
      "يتعمق في السلامة والمخاطر المرتبطة بالمخدرات مثل القنب و MDMA و LSD ، مع معالجة المفاهيم الخاطئة وتأثير وسائل الإعلام على عادات التدخين.",
      "يدعو إلى اتباع نهج رحيم لتعاطي المخدرات والإدمان ، مع التأكيد على أهمية المعلومات الواقعية على تكتيكات التخويف والتلاعب."
    ],
    "points": 203,
    "commentCount": 239,
    "retryCount": 0,
    "time": 1715776884
  }
]
