[
  {
    "id": 38309611,
    "title": "Sam Altmant leváltották az OpenAI vezérigazgatói posztjáról, Mira Murati ideiglenes vezető lett",
    "originLink": "https://openai.com/blog/openai-announces-leadership-transition",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38309611",
    "commentBody": "",
    "originSummary": [
      "Sam Altman lemond az OpenAI vezérigazgatói posztjáról, és Mira Muratit nevezték ki ideiglenes vezérigazgatónak.",
      "Altman távozását a következetlen kommunikációjának tulajdonítják.",
      "Az OpenAI igazgatótanácsa bízik Murati vezetői képességeiben, és folytatja az állandó vezérigazgató keresését, amíg ő vezeti a vállalatot az átmeneti időszakban."
    ],
    "commentSummary": [
      "Az összefoglaló különböző vitákat és témákat tárgyal az OpenAI-t, annak korábbi vezérigazgatóját, Sam Altmant és a szervezet irányvonalát illetően.",
      "Az OpenAI-n belüli feszültségekkel foglalkozik, különös tekintettel a kereskedelmi hasznosítás és a nonprofit küldetés közötti konfliktusra.",
      "Az összefoglaló megemlíti az OpenAI profitorientált leányvállalatát és annak következményeit övező spekulációkat, valamint a videohívó szoftverekről, a nyelvi modellek korlátairól, a döntéshozatali folyamatokkal kapcsolatos aggályokról, a nyílt forráskódú mesterséges intelligenciáról szóló vitákról, a személyzet távozásáról, az összeesküvés-elméletekről, a kritikákról, valamint a szerzői jogok megsértésével és a nyilvánosságra nem hozott forrásanyaggal kapcsolatos aggályokról is szól."
    ],
    "points": 4865,
    "commentCount": 2063,
    "retryCount": 0,
    "time": 1700252930
  },
  {
    "id": 38312704,
    "title": "Az OpenAI társalapítója, Greg Brockman lemond, üzenetet küld a csapatnak",
    "originLink": "https://twitter.com/gdb/status/1725667410387378559?s=20",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38312704",
    "commentBody": "",
    "originSummary": [
      "Greg Brockman, az OpenAI vezérigazgatója a mai hírekkel kapcsolatban üzenetet küldött az OpenAI csapatának.",
      "Az üzenet tartalma a megadott linken olvasható."
    ],
    "commentSummary": [
      "Az OpenAI-nál a közelmúltban történt távozások és vezetőváltások a kulcsfigurák közötti nézeteltérésekről és filozófiai különbségekről, valamint egy új vállalat alapításának lehetőségéről szóltak.",
      "Szóba kerül a vállalati nyilatkozatokban használt nyelvhasználat, a lehetséges jogi következmények és a jó hírnév sérülésével kapcsolatos aggodalmak.",
      "A beszélgetés kitér az AGI technológiára, a jelenlegi modellek korlátaira és az OpenAI nonprofit státuszának következményeire is. Az OpenAI kódjának kereskedelmi célú felhasználásának jogi és üzleti következményeiről is találgatások hangzottak el."
    ],
    "points": 1232,
    "commentCount": 596,
    "retryCount": 0,
    "time": 1700266221
  },
  {
    "id": 38304485,
    "title": "Az elektromos kerékpárok és mopedek növekvő népszerűsége jobban csökkenti az olajkeresletet, mint az elektromos autóké",
    "originLink": "https://theconversation.com/the-worlds-280-million-electric-bikes-and-mopeds-are-cutting-demand-for-oil-far-more-than-electric-cars-213870",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38304485",
    "commentBody": "",
    "originSummary": [
      "Az elektromos kerékpárok és mopedek egyre népszerűbbek, mint az elektromos autók, különösen az olyan országokban, mint Kína, és jelentősen csökkentik az olaj iránti keresletet.",
      "A több mint 280 millió elektromos kétkerekűvel az utakon máris mintegy 1%-kal csökkentették a globális olajkeresletet.",
      "Az elektromos kerékpárok és mopedek megfizethetőbbek és energiahatékonyabbak, mint az elektromos autók, így rövid utakra előnyben részesítik őket, és megoldják az \"utolsó kilométer problémáját\" a tömegközlekedési rendszerekben. A benzinárak emelkedésével és az akkumulátorok árának csökkenésével az olaj iránti kereslet várhatóan tovább csökken."
    ],
    "commentSummary": [
      "A vita a közlekedés különböző aspektusait vizsgálja, például az autóközpontú városok előnyeit és hátrányait, az alternatív közlekedési módok, például a kerékpározás és a gyaloglás előnyeit, a tömegközlekedés nehézségeit, a külvárosi életmód hatásait, valamint a jobb infrastruktúra és a fenntartható közlekedéspolitika fontosságát.",
      "A közlekedéshez kapcsolódó környezetvédelmi aggályok is szóba kerülnek, és a kormányzat szerepét is megvitatják e kérdések kezelésében.",
      "A cikk átfogó áttekintést nyújt a közlekedésről, kiegyensúlyozott képet nyújt a különböző témákról, és rávilágít az ágazatban szükséges fejlesztésekre."
    ],
    "points": 723,
    "commentCount": 670,
    "retryCount": 0,
    "time": 1700233346
  },
  {
    "id": 38307889,
    "title": "A Valve kiadja a Half-Life 25. évfordulós frissítését",
    "originLink": "https://www.half-life.com/en/halflife25/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38307889",
    "commentBody": "",
    "originSummary": [
      "A Valve elindította a Half-Life 25. évfordulós frissítését, amely számos frissítést, hibajavítást és új tartalmat tartalmaz.",
      "A frissítés bevezeti a Half-Life Uplinket, négy új többjátékos pályát, javított grafikai beállításokat, továbbfejlesztett kontroller- és Steam hálózati támogatást, valamint kompatibilitást a Steam Deckkel.",
      "A frissítés emellett visszaállítja a játék eredeti tartalmait a kezdeti kiadásokból, és több hibát is kijavít. A Valve ezt a frissítést tekinti a Half-Life végleges változatának, ami a Half-Life láthatóságának csökkenéséhez vezet: Source a Steam Store-ban."
    ],
    "commentSummary": [
      "A Valve a Half-Life 25. évfordulóját egy ingyenes frissítéssel, egy dokumentumfilmmel és a Half-Life 2 ideiglenes ingyenes hozzáférésével ünnepli.",
      "A felhasználók kompatibilitási problémákat fejtenek ki, alternatív játékmotorokat fedeznek fel, és a Steam CAPTCHA-jaival kapcsolatos csalódottságuknak adnak hangot.",
      "A Half-Life sorozat iránti nosztalgia, a Black Mesa iránti várakozás és a Valve játékfejlesztési erőfeszítéseiről szóló beszélgetések, valamint a Half-Life történetének kielégítő befejezéséhez fűzött remények és az egyedi játéktervezés és történetmesélés dicsérete dominálnak."
    ],
    "points": 504,
    "commentCount": 210,
    "retryCount": 0,
    "time": 1700246136
  },
  {
    "id": 38304405,
    "title": "Az elektromos járművek akkumulátorárai 2025-re várhatóan 40%-kal csökkennek",
    "originLink": "https://www.goldmansachs.com/intelligence/pages/electric-vehicle-battery-prices-falling.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38304405",
    "commentBody": "",
    "originSummary": [
      "A Goldman Sachs Research előrejelzése szerint 2025-re az elektromos járművek akkumulátorainak ára 40%-kal csökken, ami versenyképesebbé teszi őket a hagyományos autókkal szemben.",
      "Az árcsökkenés az olyan EV nyersanyagok, mint a lítium, a nikkel és a kobalt csökkenő költségeinek köszönhető.",
      "Az alacsonyabb akkumulátorárak az elektromos járművek és a belső égésű motorral hajtott járművek közötti költségparitáshoz vezethetnek, ami elősegíti az elektromos járművek fogyasztói elfogadását és csökkenti az állami támogatásra való utaltságot."
    ],
    "commentSummary": [
      "Az elektromos járművek akkumulátorainak ára az előrejelzéseknél gyorsabb ütemben csökken, ami az elektromos járműveket elérhetőbbé teszi a fogyasztók számára.",
      "A kínai vállalatok, mint például a BYD, jelentős versenytársakká válnak az elektromos autóiparban, és világszerte túlszárnyalják a Teslát.",
      "A nyugati autógyártóknak - a Tesla kivételével - fontolóra kell venniük az árak csökkentését és a méretezhetőségre kell összpontosítaniuk, hogy versenyképesek maradjanak. A megbeszélés kitér továbbá a kínai gyártók globális piacokra való belépésére, az elektromos járművek bevezetésének akadályaira, valamint a benzinkutak lehetséges hanyatlására az elektromos autók térnyerésével. Kitér az akkumulátor-technológia fejlődésére és annak az árakra gyakorolt hatására is."
    ],
    "points": 435,
    "commentCount": 275,
    "retryCount": 0,
    "time": 1700233036
  },
  {
    "id": 38316378,
    "title": "Három vezető kutató lemond az OpenAI-tól",
    "originLink": "https://news.ycombinator.com/item?id=38316378",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38316378",
    "commentBody": "",
    "originSummary": [
      "Az OpenAI három vezető kutatója, köztük Jakub Pachocki kutatási igazgató, Aleksander Madry, a mesterséges intelligencia kockázati csoport vezetője és Szymon Sidor, nem közölt okok miatt távozott a cégtől.",
      "E kutatók távozása az OpenAI-tól jelentős, figyelembe véve vezető szerepüket és szakértelmüket a területen.",
      "Távozásuk konkrét oka jelenleg nem ismert, és nem hozták nyilvánosságra."
    ],
    "commentSummary": [
      "Vezető kutatók, köztük a kutatási igazgató és a mesterséges intelligencia kockázati csoport vezetője, lemondtak az OpenAI-tól, aggodalmakat keltve a vállalat irányával kapcsolatban.",
      "Az OpenAI-n belüli belső megosztottságról is vannak találgatások, egyesek a Microsoft kiszolgálására összpontosítanak, míg mások potenciálisan monopolhelyzet kialakítására törekednek.",
      "Ezeknek a kutatóknak a távozása jelentős veszteség az OpenAI számára, és kérdéseket vet fel a vállalat jövőjével kapcsolatban.",
      "Vita folyik Greg Brockman munkamódszereiről, akit az OpenAI legszorgalmasabb munkatársának neveznek, és viták folynak a hosszú munkaidő jelentőségéről és esetleges eredménytelenségéről.",
      "Spekulációk övezik Sam Altman és Greg Brockman új vállalkozásának lehetséges sikerét és annak az OpenAI-ra gyakorolt hatását.",
      "Aggodalmak merültek fel a Microsoft mint partner megbízhatóságával kapcsolatban a Google-hoz képest, valamint a függőségek figyelembevételének és a tartalékterv fontosságával kapcsolatban.",
      "Sam Altman vezérigazgató kirúgása aggodalomra ad okot az OpenAI jövőjét és a mesterséges intelligencia biztonsága iránti elkötelezettségét illetően.",
      "A beszélgetés kiterjed a mesterséges intelligencia technológiájának hatásáról szóló vitákra és a lehetséges negatív hatásokkal kapcsolatos aggodalmakra.",
      "A beszélgetések a vezetésről, a mesterséges intelligencia technológiáról és egy Sam nevű személy kirúgásáról is szólnak, valamint a mesterséges intelligenciával kapcsolatos különböző témákról, beleértve annak korlátait, lehetőségeit és a nyilvánosság általi megítélését."
    ],
    "points": 416,
    "commentCount": 244,
    "retryCount": 0,
    "time": 1700291060
  },
  {
    "id": 38301801,
    "title": "Manifest V3: A Google megtévesztő változtatásai veszélyeztetik a Chrome-felhasználók adatvédelmét",
    "originLink": "https://www.eff.org/deeplinks/2021/12/chrome-users-beware-manifest-v3-deceitful-and-threatening",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38301801",
    "commentBody": "",
    "originSummary": [
      "A Manifest V3 a Google Chrome böngészőbővítményeinek módosításait tartalmazza, amelyek célja az adatvédelem, a biztonság és a teljesítmény javítása.",
      "A kritikusok szerint ezek a változások korlátozzák a kiterjesztések képességeit, különösen azokét, amelyek a nyomkövetők blokkolásával védik az adatvédelmet.",
      "Aggályok merülnek fel azzal kapcsolatban, hogy a Google mind a böngésző, mind a hirdetési hálózat felett ellenőrzést gyakorol, ami kérdéseket vet fel az összeférhetetlenséggel és a biztonság tényleges javulásával kapcsolatban."
    ],
    "commentSummary": [
      "A Google Chrome Manifest V3 frissítésének lehetséges negatív hatása a böngészőbővítményekre.",
      "Aggályok merülnek fel a felhasználók magánéletével és a hirdetésblokkolók hatékonyságával kapcsolatban.",
      "Szó esik a Google Chrome dominanciájáról a böngészők piacán, valamint a többi böngészővel, például a Firefoxszal és a Safarival kapcsolatos vitákról."
    ],
    "points": 415,
    "commentCount": 192,
    "retryCount": 0,
    "time": 1700217980
  },
  {
    "id": 38302283,
    "title": "Ethernet: A LAN-adatátvitel globális szabványa 50 éve.",
    "originLink": "https://spectrum.ieee.org/ethernet-ieee-milestone",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38302283",
    "commentBody": "",
    "originSummary": [
      "Az Ethernet széles körben használt technológia a helyi hálózatokban (LAN) történő nagysebességű adatátvitelre, és több mint 50 éve a szabvány.",
      "Az Ethernet koaxiális kábelen keresztül működik, ami gyors és megbízható adatátvitelt tesz lehetővé.",
      "A vezeték nélküli technológiák fejlődése ellenére az Ethernet stabilitása és következetes teljesítménye miatt sok szervezet számára továbbra is az Ethernet marad az előnyben részesített választás."
    ],
    "commentSummary": [
      "A fórumbeszélgetés a hálózatépítéssel kapcsolatos különböző témákat érint, többek között az Ethernet és a koaxiális kábelek előnyeit, a kábelek telepítésének nem hagyományos módszereit, valamint az épületekben a hálózati kábelek optimális fektetési módját.",
      "A cikk megvitatja az Ethernet és a Wi-Fi közötti vitát, valamint a vezetékes kapcsolat előnyeit a televíziózás esetében.",
      "A megbeszélés kitér továbbá olyan témákra is, mint a MoCA technológia használata az internetkapcsolathoz, a jumbo frame-ek az internetprotokollokban, valamint a nagysebességű internet elérhetősége és megfizethetősége."
    ],
    "points": 381,
    "commentCount": 365,
    "retryCount": 0,
    "time": 1700222031
  },
  {
    "id": 38302635,
    "title": "AI ChatGPT és a Bullshit kérdése: Neves AI-kutatók aggodalmukat fejezik ki",
    "originLink": "https://www.cst.cam.ac.uk/blog/afb21/oops-we-automated-bullshit",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38302635",
    "commentBody": "",
    "originSummary": [
      "Alan Blackwell az AI által generált \"bullshit\" kérdését vizsgálja, és összehasonlítja a bullshitting fogalmával.",
      "Kiemeli a neves AI-kutatók által kifejezett aggodalmakat a ChatGPT-hez hasonló AI-rendszerek meggyőző erejével és potenciális kockázataival kapcsolatban.",
      "Blackwell ezt a kérdést a \"bullshit jobs\" fogalmához kapcsolja, és azt sugallja, hogy a mesterséges intelligencia bizonyos munkaköröket irrelevánssá tehet.",
      "Ahelyett, hogy a mesterséges intelligencia szabályozására összpontosítana, azt javasolja, hogy foglalkozzunk a baromságok problémájával, és egy csúcstalálkozót javasol a különböző munkahelyek értékének és szükségességének értékelésére."
    ],
    "commentSummary": [
      "A vita középpontjában a GPT nyelvi modellek képességei és korlátai állnak a nyelv és a tudás megértésében és generálásában.",
      "A résztvevők arról vitatkoznak, hogy a nyelv képviseli-e a tudást, vagy a nyelvi modelleknek a nyelvi generálást kell-e előtérbe helyezniük.",
      "A tartalom megkülönböztetésének és a mesterséges intelligencia által generált válaszok integritásának biztosításával kapcsolatos kihívások, valamint a képzési adatok pontosságával és az elfogultságokkal kapcsolatos aggályok is hangsúlyt kapnak."
    ],
    "points": 348,
    "commentCount": 311,
    "retryCount": 0,
    "time": 1700224483
  },
  {
    "id": 38302780,
    "title": "Amerikán kívül szinte senki sem fizet 6%-os ingatlan jutalékot...",
    "originLink": "https://www.wsj.com/personal-finance/real-estate-buying-home-charts-6dc40caa",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38302780",
    "commentBody": "",
    "originSummary": [
      "Az Egyesült Államokban más nemzetekhez képest több az ingatlanügynökök száma, ami potenciálisan telített piacra utal.",
      "Az Egyesült Államokban a lakáseladások jutaléka általában 5-6% között van, ami magasabb, mint sok más országban, ami magasabb költségeket jelent a lakásvásárlók és -eladók számára.",
      "A jutalékok közötti eltérés számos tényezőnek tudható be, például a piaci dinamikának, a szabályozásoknak és az ügynököknek a lakásvásárlási folyamatban betöltött szerepének."
    ],
    "commentSummary": [
      "A vita résztvevői eltérő véleményeket fogalmaztak meg az ingatlanügynökök szerepéről és értékéről az ingatlanügyletekben.",
      "Egyesek azzal érvelnek, hogy az ügynökök csak korlátozott értéket nyújtanak a ház listázásán és a bemutatók koordinálásán túl, míg mások elismerik a helyi piaci ismereteiket és a tranzakciós segítséget.",
      "Aggályok merültek fel az ügynökök által felszámított magas jutalékok és az esetleges összeférhetetlenségek miatt.",
      "A vita olyan témákat is érint, mint az átalánydíjas lehetőségek, a technológia hatása az iparágra, az online platformok adatainak pontossága és a piaci átláthatóság hiánya.",
      "Vita folyik a vevőügynökök szükségességéről és méltányosságáról, valamint az ingatlanügynökök fizetésének megváltoztatásának lehetőségéről.",
      "Összességében a vita rávilágít az ingatlanügynökök ingatlanügyletekben való részvételét övező különböző nézőpontokra és összetettségre."
    ],
    "points": 322,
    "commentCount": 334,
    "retryCount": 0,
    "time": 1700225316
  },
  {
    "id": 38312649,
    "title": "Ergonomikus Magic Mouse: Hacked & Upgraded",
    "originLink": "https://uplab.pro/2023/11/i-hacked-the-magic-mouse/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38312649",
    "commentBody": "",
    "originSummary": [
      "A szerző sikeresen feltörte a Magic Mouse-t, hogy létrehozzon egy ergonomikus, USB-C töltéssel ellátott változatot.",
      "A folyamat során az egeret módosították és 3D-nyomtatták, és közben érdekes felfedezéseket tettek.",
      "A szerző bemutatja a töltési folyamatot és összeszereli a módosított egeret, megosztva a további funkciókat tartalmazó terveiket, amelyeket végül elvetettek."
    ],
    "commentSummary": [
      "A felhasználók megosztják tapasztalataikat az Apple Magic Mouse-zal kapcsolatban, kiemelve az ergonómiai problémákat és korlátokat, valamint a töltőport elhelyezését.",
      "Olyan megoldások javasoltak, mint a görgetőkerékként való használata vagy más egerekre, például függőleges egerekre vagy a Magic Trackpadre való átállás.",
      "Az ismétlődő megterheléses sérülések (RSI) elkerülése és a kényelem biztosítása szempontjából legjobb egérről eltérőek a vélemények, a felhasználók a vezeték nélküli töltési megoldásokról vitatkoznak, és vitatják annak szükségességét, miközben kritizálják a jelenlegi akkumulátor-üzemidőt is."
    ],
    "points": 269,
    "commentCount": 51,
    "retryCount": 0,
    "time": 1700265988
  },
  {
    "id": 38305787,
    "title": "A weboldal lehetővé teszi, hogy idegenek bámuljanak, pislogás-mentesen",
    "originLink": "https://stranger.video/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38305787",
    "commentBody": "",
    "originSummary": [
      "A weboldal lehetővé teszi, hogy idegenek webkamerákon keresztül, szöveges csevegés vagy hangkommunikáció nélkül nézzék egymás arcát.",
      "A webrtc és a mediapipe technológia segítségével a videótovábbítás leáll, amikor bármelyik személy pislog.",
      "Az alkotóval való kapcsolatfelvételhez egy e-mail címet adunk meg a kommunikációhoz."
    ],
    "commentSummary": [
      "A beszélgetés a stranger.video nevű weboldal/játék körül forog, amely lehetővé teszi a felhasználók számára, hogy videohívásokat kezdeményezzenek idegenekkel, és egymás szemébe nézzenek.",
      "Egyes felhasználók zavarónak találják az élményt, míg mások értékelik az egyediségét.",
      "A megbeszélések különböző témákat érintenek, például technikai kérdéseket, adatvédelmi aggályokat és fejlesztési javaslatokat, beleértve a verseny szempontjának hozzáadását is."
    ],
    "points": 250,
    "commentCount": 79,
    "retryCount": 0,
    "time": 1700238607
  }
]
