[
  {
    "id": 39119835,
    "title": "Zed குறியீடு எடிட்டர் திறந்த மூலத்திற்கு செல்கிறது, ஒத்துழைப்பை வலியுறுத்துகிறது",
    "originLink": "https://zed.dev/blog/zed-is-now-open-source",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39119835",
    "commentBody": "",
    "originSummary": [
      "Zed, ஒரு குறியீடு ஆசிரியர், தயாரிப்பை மேம்படுத்துவதற்கும் நிரலாக்க சமூகத்துடன் ஈடுபடுவதற்கும் ஒரு திறந்த மூல திட்டமாக மாறியுள்ளது.",
      "Zed இப்போது GitHub இல் copyleft மற்றும் Apache 2 உரிமங்களின் கீழ் கிடைக்கிறது, இது டெவலப்பர்கள் குறியீட்டை அணுகவும் மாற்றவும் அனுமதிக்கிறது.",
      "ஒருங்கிணைந்த சேவைகளை வழங்குவதன் மூலமும், குறிப்பிட்ட அம்சங்களின் தனிப்பட்ட பயன்பாட்டிற்கு கட்டணம் வசூலிப்பதன் மூலமும் ஒரு நிலையான வணிக மாதிரியை பராமரிக்கும் அதே வேளையில், நிகழ்நேர கூட்டு குறியீட்டு அம்சமான ஃபயர்சைட் ஹேக்ஸை அறிமுகப்படுத்த நிறுவனம் திட்டமிட்டுள்ளது. அவர்கள் சமூக பங்களிப்புகளை ஊக்குவிக்கிறார்கள் மற்றும் ஈடுபடுவதற்கான வழிகாட்டியை வழங்குகிறார்கள்."
    ],
    "commentSummary": [
      "விவாதம் Zed, Visual Studio Code (VSC), Emacs மற்றும் பிற மாற்றுகள் உட்பட பல்வேறு குறியீடு எடிட்டர்களை உள்ளடக்கியது.",
      "செயல்திறன், ஒத்துழைப்பு, சுய ஹோஸ்டிங் அரட்டை சேவையகங்கள், தொடக்க நேரம் மற்றும் தொகுப்பு மேலாண்மை ஆகியவற்றை மேம்படுத்துவதற்கான அனுபவங்களையும் பரிந்துரைகளையும் பயனர்கள் பகிர்ந்து கொள்கிறார்கள்.",
      "உரையாடல் உரிமம், வெவ்வேறு இயக்க முறைமைகளுடன் பொருந்தக்கூடிய தன்மை, கூட்டு எடிட்டிங் விருப்பங்களின் கிடைக்கும் தன்மை ஆகியவற்றைத் தொடுகிறது மற்றும் ஜோடி நிரலாக்கத்திற்கான நிகழ்நேர ஒத்துழைப்பு மற்றும் செயல்திறனின் முக்கியத்துவத்தை எடுத்துக்காட்டுகிறது."
    ],
    "points": 1208,
    "commentCount": 425,
    "retryCount": 0,
    "time": 1706116519
  },
  {
    "id": 39121521,
    "title": "முக்கிய ஆவணங்களை வெளியிடுவதாக அளித்த வாக்குறுதியில் OpenAI பின்வாங்குகிறது, கவலைகளை எழுப்புகிறது",
    "originLink": "https://www.wired.com/story/openai-scrapped-promise-disclose-key-documents/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39121521",
    "commentBody": "",
    "originSummary": [
      "OpenAI, ஒரு இலாப நோக்கற்ற AI ஆராய்ச்சி ஆய்வகம், முக்கிய ஆவணங்களை பொதுமக்களுக்கு வெளியிடுவதற்கான அதன் வாக்குறுதியை மீறியுள்ளது, அதன் வெளிப்படைத்தன்மை குறித்த கவலைகளை எழுப்பியுள்ளது.",
      "AI வளர்ச்சியில் சமூகத்தை ஈடுபடுத்தும் நோக்கத்துடன் நிறுவனம் நிறுவப்பட்டது, ஆனால் நிர்வாக ஆவணங்கள் மற்றும் நிதி அறிக்கைகளைக் கோரியபோது, OpenAI அவற்றை வழங்க மறுத்துவிட்டது.",
      "அதிகரித்த வெளிப்பாடு வாடிக்கையாளர் விசுவாசம் மற்றும் ஒழுங்குமுறை நம்பிக்கையை மேம்படுத்தக்கூடும் என்றும், இந்த ஆவணங்களுக்கான அணுகல் OpenAI இன் பாதிப்புகள், மைக்ரோசாப்ட் போன்ற பங்குதாரர்களுடனான அதன் உறவு மற்றும் அதன் கார்ப்பரேட் கட்டமைப்பை உறுதிப்படுத்த செய்யப்படும் திருத்தங்கள் பற்றிய நுண்ணறிவுகளை வழங்கக்கூடும் என்றும் விமர்சகர்கள் வாதிடுகின்றனர்."
    ],
    "commentSummary": [
      "OpenAI அதன் வெளிப்படைத்தன்மை இல்லாதது மற்றும் லாபத்தை நோக்கிய மாற்றம் ஆகியவற்றிற்காக விமர்சனங்களை எதிர்கொள்கிறது, இது மனிதகுலத்திற்கு பயனளிப்பதற்கான அதன் அர்ப்பணிப்பு குறித்து கவலைகளை எழுப்புகிறது.",
      "பங்கேற்பாளர்கள் OpenAI இன் செயல்கள் குறித்து ஏமாற்றத்தையும் சந்தேகத்தையும் வெளிப்படுத்துகின்றனர், அதன் ஒருமைப்பாட்டை கேள்விக்குள்ளாக்குகின்றனர்.",
      "இந்த உரையாடல் செயற்கை பொது நுண்ணறிவு (AGI) வளர்ச்சியின் தாக்கங்கள், தொழில்நுட்பத் துறையின் இலாப உந்துதல் கவனம் மற்றும் AI பற்றிய ஒழுங்குமுறை மற்றும் திறந்த விவாதங்களின் தேவை ஆகியவற்றை எடுத்துக்காட்டுகிறது."
    ],
    "points": 531,
    "commentCount": 209,
    "retryCount": 0,
    "time": 1706124071
  },
  {
    "id": 39120647,
    "title": "நவீன நிதி திரட்டலைப் புரிந்துகொள்வது: ஒரு திறந்த மூல தொடக்க நிதி சிமுலேட்டர் அறிமுகம்",
    "originLink": "https://www.fundingsimulator.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39120647",
    "commentBody": "",
    "originSummary": [
      "நவீன நிதி திரட்டுதல் மற்றும் அவர்கள் அனுபவிக்கும் சாத்தியமான நீர்த்துப்போதல் பற்றி நிறுவனர்கள் நன்கு புரிந்துகொள்ள உதவும் ஒரு திறந்த மூல கருவியை ஆசிரியர் உருவாக்கினார்.",
      "உரிமையின் தாக்கத்தைக் காண பயனர்கள் பிந்தைய பணப் பாதுகாப்புகள், விலை சுற்றுகள் மற்றும் பணியாளர் விருப்பங்களைச் சேர்க்க அனுமதிப்பதன் மூலம் தொடக்க நிதியைப் புரிந்துகொள்வதற்கான செயல்முறையை கருவி எளிதாக்குகிறது.",
      "பல்வேறு வகையான பாதுகாப்புகள், விருப்பங்கள் ஒதுக்கீடு, சார்பு விகித உரிமைகள் மற்றும் எம்.எஃப்.என் விதிகள் உள்ளிட்ட தொடக்க நிதியளிப்பில் உள்ள சிக்கல்களை ஆசிரியர் அங்கீகரிக்கிறார், மேலும் கருவியின் பயனர்களிடமிருந்து கருத்துக்களை வரவேற்கிறார்."
    ],
    "commentSummary": [
      "விவாதங்கள் Fundingsimulator.com சுற்றி வருகின்றன, இது நிதி திரட்டும் சிக்கல்கள் மற்றும் சாத்தியமான நீர்த்துப்போகச் செய்வதைப் புரிந்துகொள்வதில் நிறுவனர்களுக்கு உதவும் ஒரு கருவியாகும்.",
      "பயனர்கள் கருவியின் அம்சங்களைப் பற்றிய கருத்துக்களை வழங்குகிறார்கள் மற்றும் மேம்பாடுகளைப் பரிந்துரைக்கிறார்கள்.",
      "மற்ற விவாதங்களில் தொடக்க நிதியின் சவால்கள் மற்றும் நன்மைகள், வணிக வளர்ச்சியின் பல்வேறு கட்டங்களில் VC நிதியின் பொருத்தம் மற்றும் வெற்றிகரமான நிறுவனர்களிடமிருந்து திறன்கள் மற்றும் கற்றலின் முக்கியத்துவம் ஆகியவை அடங்கும். தொடக்கங்களின் உரிமை மற்றும் நிதி சிக்கல்கள் மற்றும் இணை நிறுவனர்களைக் கொண்டிருப்பதன் சாத்தியமான நன்மைகளும் ஆராயப்படுகின்றன."
    ],
    "points": 513,
    "commentCount": 134,
    "retryCount": 0,
    "time": 1706119915
  },
  {
    "id": 39115878,
    "title": "அலாஸ்கா ஏர்லைன்ஸ் தலைமை நிர்வாக அதிகாரி: 737 மேக்ஸ் விமானங்களில் தளர்வான போல்ட் கண்டுபிடிக்கப்பட்டது",
    "originLink": "https://www.nbcnews.com/business/business-news/alaska-airlines-found-more-loose-bolts-boeing-737-max-9-ceo-says-rcna135316",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39115878",
    "commentBody": "",
    "originSummary": [
      "அலாஸ்கா ஏர்லைன்ஸின் போயிங் 737 மேக்ஸ் 9 விமானங்களில் தளர்வான போல்ட் கண்டுபிடிக்கப்பட்டது.",
      "ஃபெடரல் ஏவியேஷன் நிர்வாகம் அனைத்து போயிங் மேக்ஸ் 9 விமானங்களையும் தரையிறக்கி, பாதுகாப்பு விசாரணையைத் தொடங்கியுள்ளது, இது அலாஸ்கா ஏர்லைன்ஸின் விமான ரத்து மற்றும் மறுசீரமைப்புக்கு வழிவகுத்தது.",
      "அலாஸ்கா ஏர்லைன்ஸ் தலைமை நிர்வாக அதிகாரி பென் மினிகுச்சி போயிங் அதன் தரக் கட்டுப்பாட்டு முறைகளை மேம்படுத்துவதற்கு பொறுப்பு என்று கூறுகிறார், மேலும் நிறுவனம் அதன் தணிக்கை ஊழியர்களை உற்பத்தி வரிசையில் விமானங்களை ஆய்வு செய்ய அனுப்புகிறது."
    ],
    "commentSummary": [
      "போயிங்கின் மேக்ஸ் விமானங்களின் தரக் கட்டுப்பாடு குறித்த கவலைகளை விசாரிக்க அலாஸ்கா ஏர்லைன்ஸ் தலைமை நிர்வாக அதிகாரி ஒரு தணிக்கைக் குழுவை அனுப்பியுள்ளார்.",
      "FAA போயிங்கின் தர செயல்முறையை ஆய்வு செய்கிறது, கதவு மற்றும் போல்ட்களில் ஒரு குறிப்பிட்ட கவனம் செலுத்துகிறது, அத்துடன் தர அமைப்பில் உள்ள பிற சாத்தியமான சிக்கல்கள்.",
      "போயிங் தொடர்பாக FAA இன் மரியாதைக்குரிய அணுகுமுறை, நிறுவனத்தை அரசாங்கம் கையகப்படுத்துவதற்கான சாத்தியக்கூறு, சுயாதீன தணிக்கைகள் மற்றும் தரக் கட்டுப்பாட்டின் முக்கியத்துவம், தலைமை நிர்வாக அதிகாரியாக ஒரு பொறியாளரின் பொருத்தம், பாதுகாப்பில் தொழிற்சங்கங்களின் பங்கு மற்றும் அலாஸ்கா ஏர்லைன்ஸ் மற்றும் பிற விமான நிறுவனங்கள் FAA மீது வைத்துள்ள நம்பிக்கை ஆகியவை குறித்து விவாதங்கள் உள்ளன."
    ],
    "points": 421,
    "commentCount": 380,
    "retryCount": 0,
    "time": 1706093583
  },
  {
    "id": 39121101,
    "title": "8kB அனிமேஷன் திரைப்படத்தை உருவாக்குதல்: தொழில்நுட்ப கட்டுப்பாடுகளுடன் கதைசொல்லல் மற்றும் அனிமேஷனை இணைத்தல்",
    "originLink": "https://www.ctrl-alt-test.fr/2024/how-we-made-an-animated-movie-in-8kb",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39121101",
    "commentBody": "",
    "originSummary": [
      "ஒரு குழு 8kB இன் கடுமையான அளவு கட்டுப்பாடுகளுக்குள் நிகழ்நேர அனிமேஷனை வெற்றிகரமாக உருவாக்கியது.",
      "காட்சிகள், இசை மற்றும் அனிமேஷனை உருவாக்க அவர்கள் GLSL ஷேடர்கள், ரேமார்ச்சிங் மற்றும் C++ குறியீட்டைப் பயன்படுத்தினர்.",
      "சிறிய விவரங்கள், கேமரா வேலை, எடிட்டிங் மற்றும் ஒத்திசைவு மூலம் உணர்ச்சிகள் மற்றும் கதைசொல்லலை வெளிப்படுத்துவதில் இந்த திட்டம் கவனம் செலுத்தியது."
    ],
    "commentSummary": [
      "கிரியேட்டிவ் காமன்ஸ் உரிமங்கள் மற்றும் 8kB வரம்பைப் பயன்படுத்தி அனிமேஷன் திரைப்படத்தை உருவாக்குவதில் விவாதம் கவனம் செலுத்துகிறது.",
      "உரையாடலில் ஒரு குறியீட்டு முறையின் நம்பகத்தன்மை குறித்த விவாதங்கள் மற்றும் உத்வேகத்திற்காக முந்தைய திரைப்படத்தை குறிப்பிடுவது ஆகியவை அடங்கும்.",
      "காலப் பயணம், AI மற்றும் 2D மற்றும் 3D காட்சிகளை சுருக்கி அனிமேஷன் செய்வதில் உள்ள சவால்கள் போன்ற தலைப்புகளும் விவாதிக்கப்படுகின்றன."
    ],
    "points": 412,
    "commentCount": 107,
    "retryCount": 0,
    "time": 1706121967
  },
  {
    "id": 39124497,
    "title": "காகி சமூகம் 20 ஆயிரம் செலுத்தும் உறுப்பினர்களை அடைகிறது, வணிக கடை திறப்பு திட்டம்",
    "originLink": "https://blog.kagi.com/celebrating-20k",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39124497",
    "commentBody": "",
    "originSummary": [
      "காகி சமூகம் 20,000 செலுத்தும் உறுப்பினர்களின் குறிப்பிடத்தக்க மைல்கல்லை எட்டியுள்ளது, உலகம் முழுவதிலுமிருந்து 1,500 குடும்பங்கள் உள்ளன.",
      "நன்றியைக் காட்டும் வகையில், காகி ஒரு வணிகக் கடையைத் தொடங்க திட்டமிட்டுள்ளது, மேலும் அவர்களின் முதல் 20,000 உறுப்பினர்களுக்கு இலவச காகி டி-ஷர்ட் மற்றும் ஸ்டிக்கர் பேக்கை வழங்கும்.",
      "டி-ஷர்ட்கள் தரத்திற்காக கவனமாக தயாரிக்கப்பட்டு செர்பியாவில் உள்ள ஒரு அச்சகத்தால் தயாரிக்கப்பட்டன. காகி இதை ஆரம்பகால தத்தெடுப்பாளர்களுக்கான முதலீடாகவும், நீண்ட காலத்திற்கு தங்கள் உறுப்பினர் சமூகத்தை ஆதரிப்பதற்கான அர்ப்பணிப்பாகவும் பார்க்கிறார்."
    ],
    "commentSummary": [
      "விவாதத்தின் கவனம் தேடுபொறி காகி மற்றும் அதன் பல்வேறு அம்சங்கள், நன்மைகள் மற்றும் எஸ்சிஓ கையாளுதலுக்கு சாத்தியமான பாதிப்புகள் ஆகியவற்றில் உள்ளது.",
      "காகி வழங்கிய முன்னுரிமை தேடல் முடிவுகள் மற்றும் தனிப்பயனாக்குதல் விருப்பங்களில் பயனர்கள் திருப்தி தெரிவிக்கின்றனர்.",
      "விளம்பரத்தின் ஒரு வடிவமாக பணம் செலுத்தும் உறுப்பினர்களுக்கு டி-ஷர்ட்களை வழங்குவதன் செயல்திறன் குறித்து விவாதம் எழுகிறது, அதன் தாக்கம் குறித்து மாறுபட்ட கருத்துக்களுடன்."
    ],
    "points": 318,
    "commentCount": 185,
    "retryCount": 0,
    "time": 1706141697
  },
  {
    "id": 39125477,
    "title": "ஒல்லாமா தடையற்ற ஒருங்கிணைப்புக்காக பைதான் மற்றும் ஜாவாஸ்கிரிப்ட் நூலகங்களை வெளியிடுகிறது",
    "originLink": "https://ollama.ai/blog/python-javascript-libraries",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39125477",
    "commentBody": "",
    "originSummary": [
      "Ollama Python மற்றும் JavaScript நூலகங்கள் வெளியிடப்பட்டுள்ளன, இது புதிய மற்றும் ஏற்கனவே உள்ள பயன்பாடுகளுடன் தடையற்ற ஒருங்கிணைப்பை செயல்படுத்துகிறது.",
      "இந்த நூலகங்கள் Ollama REST API இன் பல்வேறு அம்சங்களுக்கான அணுகலை வழங்குகின்றன, அதாவது ஸ்ட்ரீமிங், மல்டி-மாடல் திறன்கள், உரை நிறைவு, தனிப்பயன் மாதிரிகளை உருவாக்குதல் மற்றும் தனிப்பயன் கிளையண்டைப் பயன்படுத்துதல்.",
      "பல்வேறு நிரலாக்க மொழிகளுக்கு நூலகங்களை பங்களித்த சமூக உறுப்பினர்களுக்கு சிறப்பு அங்கீகாரம் வழங்கப்படுவதுடன், \"ஒல்லாமா\" என்ற அமைப்பின் கீழ் கிட்ஹப்பில் நூலகங்களைக் காணலாம்."
    ],
    "commentSummary": [
      "டெவலப்பர் தளமான ஒல்லாமா, பைதான் மற்றும் ஜாவாஸ்கிரிப்டுக்கான நூலகங்களை வெளியிட்டுள்ளது.",
      "தனிப்பயனாக்குதல் விருப்பங்கள் மற்றும் வெவ்வேறு மாடல்களின் பொருந்தக்கூடிய தன்மை மற்றும் செயல்திறன் உள்ளிட்ட பயனர்கள் ஒல்லாமாவுடனான தங்கள் அனுபவங்களைப் பற்றி விவாதிக்கின்றனர்.",
      "ஓலாமா என்பது கோவில் எழுதப்பட்ட ஒரு உள்ளூர் எல்.எல்.எம் சேவையகம், இது டெஸ்க்டாப் பயன்பாட்டிற்காக வடிவமைக்கப்பட்டுள்ளது, ஆனால் மல்டியூசர் காட்சிகளுக்கு பரிந்துரைக்கப்படவில்லை."
    ],
    "points": 308,
    "commentCount": 69,
    "retryCount": 0,
    "time": 1706149055
  },
  {
    "id": 39115837,
    "title": "ஹேக்கிங் Xiaomi ஏர் பியூரிஃபையர்: RFID சிப் ஹேக் மூலம் வடிகட்டி எச்சரிக்கையை மீட்டமை",
    "originLink": "https://unethical.info/2024/01/24/hacking-my-air-purifier/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39115837",
    "commentBody": "",
    "originSummary": [
      "நீக்க முடியாத மாற்று வடிகட்டி எச்சரிக்கையைக் கொண்டிருந்த Xiaomi காற்று சுத்திகரிப்பாளருடன் தங்கள் அனுபவத்தை ஆசிரியர் விவரிக்கிறார்.",
      "வடிகட்டியில் உள்ள RFID சிப்பை ஹேக் செய்து குறிச்சொல்லின் UID இலிருந்து உருவாக்கப்பட்ட கடவுச்சொல்லைப் பயன்படுத்தி அதை மீட்டமைக்கும் முறையை அவர்கள் கண்டுபிடித்தனர்.",
      "என்.எஃப்.சி-இயக்கப்பட்ட மொபைல் ஃபோனைப் பயன்படுத்தி வடிப்பானை எவ்வாறு மீட்டமைப்பது என்பதற்கான வழிமுறைகள் வழங்கப்படுகின்றன, இணக்கமான சாதனங்களின் பட்டியல் மற்றும் அதை முயற்சித்த வெற்றிகரமான வாசகர்களின் கருத்துகள்."
    ],
    "commentSummary": [
      "பயனர்கள் காற்று சுத்திகரிப்பாளர்களில் டி.ஆர்.எம் (டிஜிட்டல் உரிமைகள் மேலாண்மை) உடன் ஏமாற்றங்களைப் பற்றி விவாதிக்கிறார்கள் மற்றும் கட்டுப்பாடுகளைத் தவிர்ப்பதற்கு ஹேக்கிங் சாதனங்களின் அனுபவங்களைப் பகிர்ந்து கொள்கிறார்கள்.",
      "இந்த ஹேக் பிரபலமடைந்தால் கள்ள வடிப்பான்களின் சாத்தியமான அதிகரிப்பு குறித்து கவலைகள் எழுப்பப்படுகின்றன.",
      "DRM க்கு பதிலாக வேறுபட்ட அழுத்த சென்சாரைப் பயன்படுத்துவது போன்ற மாற்று தீர்வுகள் பரிந்துரைக்கப்படுகின்றன, மேலும் DMCA (டிஜிட்டல் மில்லினியம் பதிப்புரிமைச் சட்டம்) மற்றும் நுகர்வோருக்கான பழுதுபார்க்கும் உரிமையை ரத்து செய்ய ஒரு வேண்டுகோள் விடுக்கப்படுகிறது."
    ],
    "points": 243,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1706093137
  },
  {
    "id": 39119141,
    "title": "குறியீட்டில் ஓட்ட நிலையின் சக்தி",
    "originLink": "https://github.blog/2024-01-23-good-devex-increases-productivity/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39119141",
    "commentBody": "",
    "originSummary": [
      "ஓட்ட நிலை என்பது குறியீட்டு முறை போன்ற ஒரு பணியில் முழுமையான கவனம் மற்றும் மூழ்கும் மன நிலை.",
      "ஓட்ட நிலையில் இருப்பது உற்பத்தித்திறன், படைப்பாற்றல் மற்றும் குறியீட்டின் ஒட்டுமொத்த இன்பத்தை மேம்படுத்தும்.",
      "குறியீட்டு அமர்வுகளின் போது ஓட்ட நிலையை உள்ளிடுவதற்கும் பராமரிப்பதற்கும் கட்டுரை மூன்று நடைமுறை உதவிக்குறிப்புகளை வழங்குகிறது."
    ],
    "commentSummary": [
      "உற்பத்தித்திறனை மேம்படுத்துவதில் டெவலப்பர் அனுபவத்தின் (DevEx) முக்கியத்துவத்தை உரையாடல்கள் வலியுறுத்துகின்றன.",
      "DevEx ஐ அளவிடுவதற்கும் மேம்படுத்துவதற்கும் உள்ள சவால்கள் விவாதிக்கப்படுகின்றன, இதில் உற்பத்தித்திறனில் பயனற்ற DX இன் தாக்கம் மற்றும் கருவிகள் மற்றும் செயல்முறைகளுடன் ஏமாற்றங்கள் ஆகியவை அடங்கும்.",
      "டெவலப்பர்களுக்கு ஒரு ஒத்திசைவான மற்றும் திறமையான பணிச்சூழலை உருவாக்குவது DevEx க்கு இன்றியமையாததாக முன்னிலைப்படுத்தப்படுகிறது, புறநிலை நடவடிக்கைகளின் தேவையுடன்."
    ],
    "points": 219,
    "commentCount": 117,
    "retryCount": 0,
    "time": 1706113113
  },
  {
    "id": 39119668,
    "title": "IRS இலவச கோப்பு: நம்பகமான கூட்டாளர்களுடன் உங்கள் வரிகளை இலவசமாக தாக்கல் செய்யுங்கள்",
    "originLink": "https://www.irs.gov/newsroom/irs-free-file-is-now-available-for-the-2024-filing-season",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39119668",
    "commentBody": "",
    "originSummary": [
      "ஐஆர்எஸ் இலவச கோப்பு திட்டம் தகுதியான வரி செலுத்துவோருக்கு நம்பகமான ஐஆர்எஸ் கூட்டாளர்களால் வழங்கப்பட்ட மென்பொருளைப் பயன்படுத்தி தங்கள் கூட்டாட்சி வரி வருமானத்தை இலவசமாக தாக்கல் செய்வதற்கான வாய்ப்பை வழங்குகிறது.",
      "திட்டத்திற்கான தகுதி வயது, வருமானம் மற்றும் மாநில வதிவிடத்தால் தீர்மானிக்கப்படுகிறது, பெரும்பாலான வரி செலுத்துவோர் சரிசெய்யப்பட்ட மொத்த வருமான வரம்பு $79,000 ஆகும்.",
      "அதிக வருமான வரம்பைக் கொண்ட வரி செலுத்துவோர் நிரப்பக்கூடிய படிவங்களைப் பயன்படுத்தி இலவசமாக தாக்கல் செய்யலாம், இது திட்டத்தின் மூலம் கிடைக்கும் ஒரு விருப்பமாகும்.",
      "இந்த திட்டம் வரி செலுத்துவோர் தகவலின் பாதுகாப்பை உறுதி செய்கிறது, கூட்டாளர் நிறுவனங்கள் வரி தயாரிப்பைத் தவிர வேறு எந்த நோக்கங்களுக்காகவும் இதைப் பயன்படுத்த தடை விதிக்கப்பட்டுள்ளது.",
      "மொபைல் அணுகல் கிடைக்கிறது, வரி செலுத்துவோர் ஸ்மார்ட்போன்கள் அல்லது டேப்லெட்டுகளைப் பயன்படுத்தி தங்கள் வரிகளை தாக்கல் செய்ய உதவுகிறது."
    ],
    "commentSummary": [
      "கிடைக்கக்கூடிய விருப்பங்கள், அரசாங்க மென்பொருள் மற்றும் ஆன்லைன் தாக்கல் போன்ற வரி தாக்கல் செய்வதன் பல்வேறு அம்சங்களை இந்த விவாதம் ஆராய்கிறது.",
      "வரி தயாரிப்பு நிறுவனங்களின் பங்கு, நில உரிமையாளர்கள் மற்றும் மென்பொருள் பொறியாளர்களுக்கான விலக்குகள், வரி விலக்கு மற்றும் வரி-ஒத்திவைக்கப்பட்ட கணக்குகள் மற்றும் வரிக் குறியீட்டின் சிக்கலான தன்மை ஆகியவற்றையும் இது தொடுகிறது.",
      "இந்த உரையாடல் கல்வியின் அவசியத்தை வலியுறுத்துகிறது, மற்ற நாடுகளில் உள்ள வரி முறைகளை ஒப்பிடுகிறது, மேலும் எளிமையான மற்றும் திறமையான வரி தாக்கல் முறைக்கு வாதிடுகிறது."
    ],
    "points": 216,
    "commentCount": 156,
    "retryCount": 0,
    "time": 1706115692
  },
  {
    "id": 39118349,
    "title": "ZX ஸ்பெக்ட்ரமை புதுப்பித்தல்: GO TO அறிக்கைகளுடன் ஒரு ரெட்ரோ ரேட்ரேசர்",
    "originLink": "https://gabrielgambetta.com/zx-raytracer.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39118349",
    "commentBody": "",
    "originSummary": [
      "ஆசிரியர் ஒரு கட்டுரையால் ஈர்க்கப்பட்டார் மற்றும் 80 களில் இருந்து ஒரு பழைய கணினியான ZX ஸ்பெக்ட்ரமிற்கான ரேட்ரேசரை உருவாக்கினார்.",
      "குறியீட்டில் GO TO அறிக்கைகள் உள்ளன, இது சில வாசகர்களுக்கு கவலையாக இருக்கலாம்."
    ],
    "commentSummary": [
      "செயலிகள், நிரலாக்க மொழிகள், வண்ணத் தட்டுகள் மற்றும் கிராபிக்ஸ் ஏற்றுதல் செயல்முறைகள் உள்ளிட்ட இசட்எக்ஸ் ஸ்பெக்ட்ரம் மற்றும் ஆம்ஸ்ட்ராட் கணினிகளின் வரம்புகள் மற்றும் திறன்களைச் சுற்றி உரையாடல் சுழல்கிறது.",
      "குறியீடு மற்றும் ரெண்டரிங் நேரங்களை மேம்படுத்துவதற்கான பயனர்கள் தங்கள் அனுபவங்களையும் உதவிக்குறிப்புகளையும் பகிர்ந்து கொள்கிறார்கள்.",
      "மாற்று நிரலாக்க மொழிகள் மற்றும் கம்பைலர்கள் விவாதிக்கப்படுகின்றன, அசெம்பிளி மொழியில் பயிற்சிகளை மீண்டும் செய்வதன் மூலம் செயல்திறனை மேம்படுத்துவதற்கான சாத்தியக்கூறுகளுடன்."
    ],
    "points": 201,
    "commentCount": 64,
    "retryCount": 0,
    "time": 1706109612
  },
  {
    "id": 39120773,
    "title": "அமேசான் தொகுப்புகளை குறிவைத்து சரக்கு ரயில் கொள்ளைகள் அதிகரிப்பது கவலைகளை எழுப்புகிறது",
    "originLink": "https://www.nytimes.com/2024/01/23/magazine/train-robbery-amazon-packages.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39120773",
    "commentBody": "",
    "originSummary": [
      "இ-காமர்ஸின் எழுச்சியின் விளைவாக லாஸ் ஏஞ்சல்ஸ் படுகையில் சரக்கு ரயில்களில் இருந்து சரக்கு திருட்டு அதிகரித்துள்ளது.",
      "சரக்கு திருட்டு சம்பவங்கள் 2019 முதல் கிட்டத்தட்ட இரட்டிப்பாகியுள்ளன, குறிப்பிட்ட கார்களை குறிவைத்து திருடப்பட்ட பொருட்களை விரைவாக இறக்குவதற்கு ஒருங்கிணைக்கப்பட்டுள்ளன.",
      "சரக்கு திருட்டு குறிப்பிடத்தக்க வருடாந்திர இழப்புகளுக்கு வழிவகுக்கிறது அமெரிக்காவில் $ 15 பில்லியன் முதல் $ 35 பில்லியன் மற்றும் உலகளவில் சுமார் $ 50 பில்லியன்."
    ],
    "commentSummary": [
      "இந்த விவாதம் அமேசான் தொகுப்புகளை குறிவைக்கும் ரயில் கொள்ளைகள் தொடர்பான பரந்த அளவிலான தலைப்புகளை உள்ளடக்கியது, இதில் ஒழுங்கமைக்கப்பட்ட குழுக்கள் மற்றும் சந்தர்ப்பவாத திருடர்களின் பங்கு உட்பட.",
      "இது கண்டுபிடிக்கப்பட்ட சொத்துக்களை எடுத்துக்கொள்வதன் சட்டபூர்வமான தன்மை, வெகுமதிகள் மற்றும் தண்டனைகளின் செயல்திறன் மற்றும் சமூகத்தில் துப்பாக்கிகளைப் பயன்படுத்துவது ஆகியவற்றை ஆராய்கிறது.",
      "ரயில் அமைப்புகளில் பாதுகாப்பு நடவடிக்கைகள் இல்லாதது, குற்ற விகிதங்களில் வறுமை மற்றும் சமத்துவமின்மையின் தாக்கம் மற்றும் வீடற்ற தன்மைக்கும் திருட்டுக்கும் இடையிலான தொடர்பு ஆகியவற்றையும் இது ஆராய்கிறது."
    ],
    "points": 197,
    "commentCount": 288,
    "retryCount": 0,
    "time": 1706120548
  },
  {
    "id": 39118314,
    "title": "ஆய்லர் கணிதத்தில் எவ்வாறு புரட்சியை ஏற்படுத்தினார்",
    "originLink": "http://eulerarchive.maa.org/hedi/index.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39118314",
    "commentBody": "",
    "originSummary": [
      "\"ஆய்லர் அதை எப்படி செய்தார்\" என்பது எட் சாண்டிஃபரின் ஆன்லைன் பத்தியாகும், இது கணிதவியலாளர் லியோன்ஹார்ட் ஆய்லரின் படைப்புகள் மற்றும் யோசனைகளை ஆராய்கிறது.",
      "கட்டுரைகள் எண் கோட்பாடு, புவியியல் மற்றும் திரவ இயக்கவியல் போன்ற பல்வேறு தலைப்புகளை உள்ளடக்கியது.",
      "இந்த தொகுப்பு அமெரிக்காவின் கணித சங்கத்துடன் இணைந்து ஆய்லர் காப்பகத்தால் வழங்கப்படுகிறது மற்றும் இரண்டு தொகுதிகளாக கிடைக்கிறது."
    ],
    "commentSummary": [
      "உரையாடல் கணிதவியலாளர் ஆய்லரின் பங்களிப்புகள் மற்றும் செல்வாக்கை மையமாகக் கொண்டுள்ளது, இதில் பார்வை சிக்கல்களுடனான அவரது கூட்டாண்மைகள் மற்றும் சவால்கள் அடங்கும்.",
      "இது ஆய்லரை மற்ற கணிதவியலாளர்களுடன் ஒப்பிடுகிறது மற்றும் கணிதத்தின் அணுகல் மற்றும் புரிந்துகொள்ளும் தன்மையை விவாதிக்கிறது.",
      "உரையாடல் விதிவிலக்கான தனிநபர்களின் கருத்து மற்றும் பாரம்பரிய கல்வி முறைகளின் தடைகள், கல்வியில் AI இன் சாத்தியமான பங்கு மற்றும் AI பயிற்சியின் செயல்திறன் ஆகியவற்றை ஆராய்கிறது."
    ],
    "points": 180,
    "commentCount": 92,
    "retryCount": 0,
    "time": 1706109429
  },
  {
    "id": 39116387,
    "title": "ஆட்டோ இம்யூன் நோய் சிகிச்சைகளில் முன்னேற்றம் தீப்பொறி நம்பிக்கை",
    "originLink": "https://www.nature.com/articles/d41586-024-00169-7",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39116387",
    "commentBody": "",
    "originSummary": [
      "நீரிழிவு, லூபஸ் மற்றும் மல்டிபிள் ஸ்களீரோசிஸ் போன்ற தன்னுடல் தாக்க நோய்களுக்கான சிகிச்சையின் வளர்ச்சியில் விஞ்ஞானிகள் முன்னேற்றங்களை ஏற்படுத்தி வருகின்றனர்.",
      "முரட்டு உயிரணுக்களுக்கு ஆன்டிஜென்களை நிர்வகிப்பது, சிக்கலான செல்களைத் தேர்ந்தெடுத்து அகற்றுவது மற்றும் வடிவமைக்கப்பட்ட நோயெதிர்ப்பு செல்களை அறிமுகப்படுத்துவது ஆகியவை நம்பிக்கைக்குரிய அணுகுமுறைகளில் அடங்கும்.",
      "நேவாசிம்கள் மற்றும் கல்லீரல்-இலக்கு ஆன்டிஜென் சிகிச்சைகள் எனப்படும் நானோ துகள்கள் முறையே தன்னுடல் தாக்க மறுமொழிகளை அணைப்பதிலும், மல்டிபிள் ஸ்களீரோசிஸின் அறிகுறிகளை மாற்றியமைப்பதிலும் வாக்குறுதியைக் காட்டுகின்றன. கூடுதலாக, கைமெரிக் ஆட்டோஆன்டிபாடி ஏற்பி டி செல்கள் சம்பந்தப்பட்ட சிகிச்சைகள் லூபஸ் மற்றும் பிற கோளாறுகள் உள்ள நோயாளிகளில் குறிப்பிடத்தக்க முன்னேற்றத்தைக் காட்டியுள்ளன."
    ],
    "commentSummary": [
      "தன்னுடல் தாக்க நோய்களை குணப்படுத்தும் நம்பிக்கையில் முரட்டு செல்களை தாக்க பயிற்சி அளிக்க ஆன்டிஜென்களைப் பயன்படுத்துவதை விஞ்ஞானிகள் ஆராய்ந்து வருகின்றனர், ஆனால் செயல்திறன் குறித்த கவலைகள் அனைவருக்கும் உள்ளன.",
      "ஆட்டோ இம்யூன் நோய்கள் உள்ள சில நபர்கள் அதிக இலக்கு சிகிச்சைகள் கிடைக்கும் என்று நம்புகிறார்கள்.",
      "முடக்கு வாதம் மருந்துகளுடன் தொற்று மற்றும் புற்றுநோயின் அதிகரித்த ஆபத்து, பாதுகாப்பு சுயவிவரங்கள் மற்றும் சாத்தியமான பக்க விளைவுகளின் அடிப்படையில் சில மருந்துகளுக்கான விருப்பம், சாத்தியமான சிகிச்சையாக உண்ணாவிரதம், மாஸ்ட் செல் நோய்கள் மற்றும் ஒவ்வாமைக்கான பிற சிகிச்சைகள், தற்போதைய ஒவ்வாமை சிகிச்சையின் செயல்திறன் மற்றும் தன்னுடல் தாக்க நோய்களுக்கு சிகிச்சையளிப்பதில் உணவு தலையீடுகளின் செல்லுபடியாகும்."
    ],
    "points": 177,
    "commentCount": 48,
    "retryCount": 0,
    "time": 1706098598
  }
]
