[
  {
    "title": "박사과정 전문연구요원, 학위 취득 후 대학원 및 대기업 파견 근무 제한 계획",
    "originLink": "https://www.news1.kr/articles/?5225300",
    "originBody": "",
    "originSummary": [
      "대한민국은 박사 과정 학생들이 학위 취득 후 대학원이나 대기업에서 일하는 것을 막기 위해 법률을 개정할 계획입니다.",
      "이들 학생들은 전문 연구원으로 병역을 대체하며, 이는 기업 연구소에 대한 기여도를 늘리는 계획의 일부입니다.",
      "이 법률 개정안은 11월 15일까지 발표될 예정입니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "한국 정부는 박사 학생들이 학위 취득 후 대학원이나 대기업에 파견되는 것을 막기 위해 법을 개정할 계획입니다.",
      "이 변경사항은 기업 연구소에 대한 기여도를 높이기 위한 계획의 일부로, 이들 박사 학생들은 전문 연구원으로 병역을 대체하게 됩니다.",
      "개정안은 11월 15일까지 발표될 예정입니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699537889280
  },
  {
    "title": "국힘 혁신위, 청년과 미래에 중점을 둔 제 3차 혁신안 발표 예정",
    "originLink": "https://www.news1.kr/articles/?5225352",
    "originBody": "",
    "originSummary": [
      "2023년 11월 9일, 한국 당의 혁신위원회는 청소년과 미래를 중심으로 한 제3의 제안을 발표할 예정입니다.",
      "이번 계획은 외교적 대화와 정치적 희생에 관한 이전 전략에 이어 한국의 청소년을 위한 지원을 강화하기 위한 것입니다.",
      "이전 논의들은 청소년과 여성의 정치 참여를 강화하는 것에 초점을 맞추고 있었습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "2023년 11월 9일, 한국당의 혁신위원회는 청년과 미래를 중심으로 한 세 번째 제안을 공개할 예정입니다.",
      "이 다가오는 계획은 이전에 외교 소통과 정치적 희생에 대한 전략을 계승하면서 한국의 청년들에 대한 지원을 강화하는 것을 목표로 합니다.",
      "이전 논의에서는 청년과 여성의 정치 참여 강화에 대해 언급했습니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699537889280
  },
  {
    "title": "국회 예결위, 연구개발 예산 축소 및 기타 이슈에 대한 2일간 정책 질의 예정",
    "originLink": "https://www.news1.kr/articles/?5225333",
    "originBody": "",
    "originSummary": [
      "대한민국 예산특별위원회는 내년 예산안에 대한 정책질의를 진행하며, 연구 개발 예산 축소, 김포 통합을 위한 서울 예산, 지방통화 예산 감소, 새만금 사회 인프라에 대한 자금 조달 감소 등의 문제에 초점을 맞출 예정입니다.",
      "또한, 일본의 후쿠시마 오염수 방류 계획도 논의 대상입니다.",
      "이 과정은 11월 30일에 최종 예산 검토로 마무리될 예정입니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "다음년도 예산안에 대한 정책 쟁점들을 비중있게 다루기 위해, 한국의 예산특별위원회는 이틀간의 정책 재조사를 진행할 예정입니다.",
      "연구개발 예산 축소, 김포와 서울의 통합, 지방 화폐에 대한 예산 감소, 새만금 사회 인프라에 대한 자금 삭감, 그리고 일본의 후쿠시마 오염수 방류 계획 등이 주요 이슈로 집중될 것입니다.",
      "이 과정은 11월 30일에 최종 예산 검토로 끝나게 될 예정입니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699537889280
  },
  {
    "title": "'노란봉투법·방송3법' 개정안에 대한 여야의 격론 예상...필리버스터 전략 도입 가능성",
    "originLink": "https://www.news1.kr/articles/?5225404",
    "originBody": "",
    "originSummary": [
      "대한민국의 여당과 민주당은 '황색 봉투 법안' 및 '방송법' 변경에 대해 충돌할 가능성이 있습니다.",
      "국민의 힘은 이 법을 반대하기 위해 필리버스터 전술을 사용할 계획이며, 이는 논의 시간을 길게 하고 당간의 관계에 긴장을 늘릴 수 있습니다.",
      "특히 이 법안이 통과되면 더욱 그러할 수 있습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "한국의 정당인 국민의 힘과 더불어민주당이 '노란 봉투 입법' 및 '방송법 개정'에 대한 이견으로 분쟁을 벌일 가능성이 있습니다.",
      "국민의 힘은 필리버스터 전략을 사용하여 이 법에 반대할 계획이며, 이로 인해 논의가 길어질 수 있고 특히 법안이 통과하면 당 간의 관계에 긴장감이 높아질 수 있습니다.",
      "이러한 상황은 두 정당 간의 관계에 영향을 미칠 수 있으며, 정치적 표면에 변화를 가져올 수 있습니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699537889280
  }
]
