[
  {
    "id": 38815334,
    "title": "Autor Victor Eijkhout sa ponára do problematiky vysokovýkonných počítačov",
    "originLink": "https://theartofhpc.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38815334",
    "commentBody": "",
    "originSummary": [
      "Victor Eijkhout napísal sériu učebníc, ktoré sa zaoberajú rôznymi témami vysokovýkonnej výpočtovej techniky (HPC).",
      "Prvé dva zväzky poskytujú úvod do vedeckých výpočtov a paralelného programovania pomocou MPI a OpenMP.",
      "Tretí a štvrtý zväzok predstavujú C++17, Fortran2008 a ďalšie témy v ekosystéme vedeckých výpočtov."
    ],
    "commentSummary": [
      "Diskusia na portáli Hacker News sa zaoberá celým radom tém súvisiacich s vysokovýkonnou výpočtovou technikou (HPC) a dátovými centrami vrátane zvyšovania výpočtového výkonu, kvapalinového chladenia a požiadaviek na napájanie.",
      "Účastníci zdôrazňujú dôležitosť pochopenia architektúry počítača a optimalizácie kódu pre výkon v HPC.",
      "Diskutuje sa aj o systémoch riadenia pracovného zaťaženia a efektívnosti rôznych systémov HPC. Okrem toho sú tu navrhnuté zdroje na výučbu programovania v jazyku C++ pre HPC a zmienky o teórii radenia a reputácii UT Austin v oblasti HPC."
    ],
    "points": 539,
    "commentCount": 86,
    "retryCount": 0,
    "time": 1703944912
  },
  {
    "id": 38821248,
    "title": "Úpadok SEO: Hodnotenie vyhľadávačov a ChatGPT pre spoľahlivé výsledky",
    "originLink": "https://danluu.com/seo-spam/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38821248",
    "commentBody": "",
    "originSummary": [
      "Diskutuje sa o poklese optimalizácie pre vyhľadávače (SEO) a vzostupe obsahových fariem, pričom sa zdôrazňuje význam zlepšovania kvality výsledkov vyhľadávania.",
      "Článok skúma presnosť vyhľadávačov a ChatGPT pri poskytovaní dôveryhodných odpovedí a zároveň sa zaoberá otázkou zavádzajúceho obsahu a podvodných webových stránok.",
      "Vo vyhľadávačoch existuje tendencia k reklame a článok sa zasadzuje za vytvorenie transparentného a konkurencieschopného vyhľadávača.",
      "Skúmajú sa problémy s konkrétnymi požiadavkami, ako je sťahovanie videí z YouTube a hľadanie blokátora reklám, pričom sa odhaľujú podvodné webové stránky a klamlivé praktiky.",
      "Zdôrazňujú sa obmedzenia vyhľadávača Google a potenciálne výhody menších vyhľadávačov.",
      "Venuje sa aj problémom s blokátormi reklám a dezinformáciám z rôznych zdrojov, pričom sa zasadzuje za spoľahlivé informácie a informovanosť o podvodoch."
    ],
    "commentSummary": [
      "Tento článok porovnáva výsledky vyhľadávania z rôznych vyhľadávačov vrátane Google, Bing, Marginalia, Kagi, Mwmbl a ChatGPT.",
      "Autor chváli spoločnosť Google za jej dobré výsledky, ale spochybňuje presnosť prezentovaných zlých výsledkov.",
      "Používatelia vyjadrujú nespokojnosť s uprednostňovaním miestnych výsledkov v službách Bing a DuckDuckGo."
    ],
    "points": 437,
    "commentCount": 190,
    "retryCount": 0,
    "time": 1703989942
  },
  {
    "id": 38814093,
    "title": "Výzvy spojené s porušovaním autorských práv v generatívnej umelej inteligencii",
    "originLink": "https://garymarcus.substack.com/p/things-are-about-to-get-a-lot-worse",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38814093",
    "commentBody": "",
    "originSummary": [
      "Generatívna umelá inteligencia, ako napríklad chatboty a obrazový softvér OpenAI, predstavuje problém v súvislosti s porušovaním autorských práv, pretože dokáže reprodukovať text a obrázky takmer identicky.",
      "Nedostatočná transparentnosť a chýbajúca autorizácia v generatívnych systémoch umelej inteligencie vyvoláva obavy z potenciálnych právnych problémov spoločností, ako sú OpenAI a Microsoft.",
      "Sledovanie pôvodu generatívneho textu a obrázkov prostredníctvom novej architektúry môže byť v budúcnosti potrebné na riešenie porušovania autorských práv."
    ],
    "commentSummary": [
      "V tomto článku sa skúma diskusia o generatívnej umelej inteligencii a porušovaní autorských práv so zameraním na význam kultúrneho vyjadrenia a rozprávania príbehov, ako aj na obavy z porušovania ochranných známok.",
      "Prezentuje rôzne pohľady na vplyv autorských práv na kreatívny priemysel, pričom niektorí obhajujú menej prísne autorské práva a iní zdôrazňujú ich úlohu pri ochrane tvorcov.",
      "Článok sa zaoberá konkrétnymi právnymi prípadmi, navrhovanými aktualizáciami zákonov o autorských právach a potenciálnym vplyvom zákonov o autorských právach na spoločnosti ako Microsoft a OpenAI. Zaoberá sa aj obavami týkajúcimi sa integrity údajov a plagiátorstva v kontexte generatívnej umelej inteligencie."
    ],
    "points": 378,
    "commentCount": 709,
    "retryCount": 0,
    "time": 1703931430
  },
  {
    "id": 38818319,
    "title": "Tiché prepúšťanie v spoločnosti Amazon: Problém s akciami núti prepúšťať a vyvoláva obavy z prevádzkových postupov",
    "originLink": "https://justingarrison.com/blog/2023-12-30-amazons-silent-sacking/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38818319",
    "commentBody": "",
    "originSummary": [
      "Spoločnosť Amazon prepustila viac ako 27 000 zamestnancov, väčšinou v maloobchodnom sektore, aby znížila prevádzkové náklady.",
      "Mnohí zamestnanci, najmä tí na vyšších pozíciách, chcú odísť z dôvodu obáv o odmenu.",
      "Hodnota výdavkov na AWS spoločnosti Amazon klesá, pretože zákazníci znižujú náklady a spoločnosť zaostáva v oblasti umelej inteligencie.",
      "Spoločnosť Amazon rozdáva služby s vysokou maržou zadarmo a v nadchádzajúcom roku možno prejde na centralizovanejšiu organizačnú štruktúru.",
      "Predpovede naznačujú, že v roku 2024 môže dôjsť k veľkému výpadku AWS v dôsledku tichého prepúšťania zamestnancov.",
      "Zamestnanci, ktorí boli prepustení, nedostávajú odstupné a spoločnosť sa snaží udržať počet zamestnancov bez toho, aby oficiálne oznámila prepúšťanie.",
      "Táto prax môže pokračovať aj v roku 2024, keďže spoločnosti uprednostňujú krátkodobé zisky."
    ],
    "commentSummary": [
      "V podnikovom svete, najmä v Silicon Valley, dochádza k zmene, keď sa zamestnanci považujú skôr za výdavky než za investície.",
      "Vplyv na inovácie je otázny, pretože spoločnosti, ktoré uprednostňujú starostlivosť o zamestnancov, sú považované za menej rušivé.",
      "Diskutuje sa o význame etických obchodných postupov a viere v dobro a zlo v ľuďoch."
    ],
    "points": 344,
    "commentCount": 294,
    "retryCount": 0,
    "time": 1703965370
  },
  {
    "id": 38819262,
    "title": "Ugrep: Výkonný, rýchly a používateľsky prívetivý vyhľadávač vzorov súborov s pokročilými funkciami",
    "originLink": "https://ugrep.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38819262",
    "commentBody": "",
    "originSummary": [
      "Vyhľadávač vzorov súborov ugrep je robustná alternatíva príkazu grep, ktorá poskytuje výkonné funkcie a vlastnosti.",
      "Program ugrep dokáže prehľadávať vnorené archívy, hexdumpovať binárne súbory a prehľadávať súbory PDF a iné typy dokumentov.",
      "Ponúka rôzne režimy porovnávania, možnosti vyhľadávania a možnosti formátovania výstupu a podporuje štandardnú syntax vzorov POSIX ERE s pridanou podporou Unicode.",
      "ugrep je nástroj príkazového riadka, ktorý možno nainštalovať do rôznych operačných systémov.",
      "Na rýchlejšie vyhľadávanie vo veľkých súborových systémoch možno na indexovanie adresárov použiť nástroj ugrep-indexer."
    ],
    "commentSummary": [
      "Používatelia diskutujú a porovnávajú rôzne nástroje grep, konkrétne ugrep a ripgrep.",
      "Rozhovor sa zameriava na kompatibilitu, výkon a funkcie týchto nástrojov.",
      "Diskutuje sa aj o význame osobných preferencií pri výbere medzi nimi.",
      "Ďalšie témy zahŕňajú knižnice regexov, pagery a implementáciu príznakov ako --word-regexp.",
      "Diskutuje sa o potrebe tvrdiť, že nový nástroj grep je výkonnejší, mimoriadne rýchly, používateľsky prívetivejší a kompatibilnejší ako ostatné.",
      "Diskutuje sa aj o význame pojmu \"užívateľsky prívetivý\" v kontexte grepu."
    ],
    "points": 271,
    "commentCount": 83,
    "retryCount": 0,
    "time": 1703971076
  },
  {
    "id": 38816135,
    "title": "Skeptický a opatrný prístup k nízkokódovým riešeniam",
    "originLink": "https://nick.scialli.me/blog/why-im-skeptical-of-low-code/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38816135",
    "commentBody": "",
    "originSummary": [
      "Autor vyjadruje skepsu voči nízkokódovým riešeniam a zdôrazňuje obavy týkajúce sa ich schopnosti zvládnuť vlastné funkcie a závislosti od špecializovaných talentov.",
      "Ako potenciálne nevýhody nízkokódových riešení sa uvádzajú aj ťažkosti s aktualizáciami a neprehľadné základné databázy.",
      "Autor odporúča pristupovať k týmto nástrojom opatrne a skepticky, pričom si uvedomuje, že môžu mať svoje výhody, ale aj potenciálne nevýhody."
    ],
    "commentSummary": [
      "Diskusia sa zameriava na skepticizmus a obmedzenia nástrojov pre vývoj s nízkym kódom.",
      "Účastníci upozorňujú na problémy, ako je nedostatok dokumentácie, testovanie a kontrola verzií.",
      "Rozhovor sa zaoberá aj možnými výhodami a obmedzeniami nízkeho kódu v rôznych kontextoch, ako je softvérové inžinierstvo, dátové projekty a vývoj webových stránok."
    ],
    "points": 250,
    "commentCount": 176,
    "retryCount": 0,
    "time": 1703951499
  },
  {
    "id": 38816029,
    "title": "ScummVM: Hrajte klasické dobrodružné hry a RPG na Mac App Store",
    "originLink": "https://apps.apple.com/us/app/scummvm/id6446184412",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38816029",
    "commentBody": "",
    "originSummary": [
      "ScummVM je aplikácia v obchode Mac App Store, ktorá používateľom umožňuje hrať klasické grafické dobrodružné hry a RPG.",
      "Aby aplikácia fungovala, musia používatelia poskytnúť svoje vlastné súbory s hernými údajmi.",
      "Aplikácia má otvorený zdrojový kód a nezhromažďuje žiadne údaje používateľa. Najlepšie sa hrá s ovládačom."
    ],
    "commentSummary": [
      "Hry Monkey Island boli odstránené z obchodu Apple App Store, čo viedlo k frustrácii používateľov.",
      "Rozhovor sa týka tém, ako je spätná kompatibilita softvéru a používanie emulátora ScummVM.",
      "Diskutuje sa aj o distribúcii softvéru pod licenciou GPL spoločnosťou Apple a o možných porušeniach licencie.",
      "O príťažlivosti starších videohier sa vedú diskusie, pričom sa uvádzajú argumenty za aj proti ich čaru a hrateľnosti v modernej dobe."
    ],
    "points": 245,
    "commentCount": 172,
    "retryCount": 0,
    "time": 1703950657
  },
  {
    "id": 38815150,
    "title": "Používanie odstupov pre jednoduchšie používateľské rozhrania: Nový prístup k zobrazovaniu stromových zoznamov",
    "originLink": "https://ratfactor.com/cards/fake-trees",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38815150",
    "commentBody": "",
    "originSummary": [
      "Autor navrhuje použiť odstupňovanie namiesto štruktúry rodič-dieťa na zobrazenie stromových zoznamov v používateľskom rozhraní (UI).",
      "Tvrdia, že vizuálny vzhľad stromu je často dôležitejší ako skutočný vzťah medzi položkami.",
      "Autor uvádza príklady a pseudokód na pomoc pri implementácii tejto techniky, ale zároveň upozorňuje, že nemusí byť vhodná pre všetky scenáre, a navrhuje alternatívne metódy pre situácie, ktoré si vyžadujú skutočnú stromovú štruktúru."
    ],
    "commentSummary": [
      "Článok skúma rôzne metódy používateľského rozhrania na reprezentáciu stromov vrátane odsadenia.",
      "Diskutuje o výzve nájsť existujúce znalosti v procesoch riešenia problémov a navrhuje použiť ChatGPT na identifikáciu priemyselných termínov.",
      "Spomína sa frustrácia z vynájdenia nového kolesa, softvérové chyby a klesajúca popularita relačných databáz.",
      "Skúmajú sa výhody a nevýhody organizácie údajov vo forme stromov a používanie rekurzívnych CTE v dotazoch SQL.",
      "Preberá sa zodpovednosť za kvalitu kódu, manipulácia s DOM a rôzne prístupy k ukladaniu a manipulácii so stromovými údajmi.",
      "Predstavuje sa koncepcia \"falošných stromov\" a prípady ich použitia, pričom názory na ich dostatočnosť sa rôznia.",
      "Navrhujú sa alternatívne metódy ukladania hierarchických údajov, ako napríklad model MPTT/vložených množín a prepojené zoznamy.",
      "Zdôrazňuje sa dôležitosť zohľadnenia údajov a schémy pri výbere metódy ukladania.",
      "Niektorí pripomienkujúci vyjadrili skepsu k používaniu odsadenia v databáze pre stromovú štruktúru.",
      "Článok je kritizovaný za to, že je clickbaity a chýba mu hĺbka, pričom vlákno komentárov je opísané ako náhodné a nezmyselné."
    ],
    "points": 221,
    "commentCount": 110,
    "retryCount": 0,
    "time": 1703943335
  },
  {
    "id": 38817271,
    "title": "Tether spolupracuje s tajnou službou a FBI, čím preukazuje svoj záväzok k bezpečnosti",
    "originLink": "https://finance.yahoo.com/news/tether-reveals-partnerships-secret-fbi-053041589.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38817271",
    "commentBody": "",
    "originSummary": [
      "Spoločnosť Tether zverejnila svoju spoluprácu s tajnou službou a FBI v liste Senátu USA, v ktorom poukázala na svoje zameranie na bezpečnosť a spoluprácu s orgánmi činnými v trestnom konaní.",
      "Generálny riaditeľ Paolo Ardoino uviedol, že Tether pomohol pri zmrazení peňaženiek, v ktorých sa nachádza 435 miliónov tokenov USDT, a má pokračujúcu spoluprácu s FBI.",
      "Zverejnením týchto listov chce spoločnosť Tether zdôrazniť svoje odhodlanie chrániť stabilitu a dôveryhodnosť svojho stablecoinu."
    ],
    "commentSummary": [
      "Spoločnosť Tether, stablecoinová spoločnosť, čelila kritike v súvislosti so svojimi partnerstvami s orgánmi činnými v trestnom konaní, pričom kritici tvrdili, že tieto partnerstvá sú skôr o dodržiavaní predpisov než o skutočnej spolupráci.",
      "Objavili sa obavy o legitímnosť a transparentnosť spoločnosti Tether, ako aj obvinenia z jej zapojenia do prania špinavých peňazí.",
      "Diskusia sa zaoberá aj praxou čiastkových rezerv v odvetví kryptomien a vplyvom čínskych predpisov na nehnuteľnosti a ťažbu kryptomien."
    ],
    "points": 213,
    "commentCount": 97,
    "retryCount": 0,
    "time": 1703959817
  },
  {
    "id": 38814599,
    "title": "Odhalenie skrytých skvostov Moreutils: Execsnoop, Ts, Sponge, Vidir, Vipe a Pee",
    "originLink": "https://jpospisil.com/2023/12/19/the-hidden-gems-of-moreutils",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38814599",
    "commentBody": "",
    "originSummary": [
      "Článok upozorňuje na menej známe nástroje príkazového riadka nazývané moreutils vrátane nástrojov ako execsnoop, ts, sponge, vidir, vipe a pee.",
      "Execsnoop umožňuje sledovať volania programov pomocou časových značiek, zatiaľ čo ts dokáže konvertovať časové značky na relatívne časy.",
      "Medzi ďalšie spomenuté nástroje patria sponge na ukladanie úprav do súboru, vidir na úpravu súborov a adresárov, vipe na úpravu výstupu medzi potrubiami a pee na odovzdávanie údajov viacerým príkazom a zhromažďovanie ich výstupov."
    ],
    "commentSummary": [
      "V článku a komentároch sa skúmajú skryté funkcie balíka moreutils so zameraním na jeho možnosti manipulácie so súbormi a prenosu dát.",
      "Rozhovor sa zaoberá rôznymi nástrojmi a príkazmi na paralelizáciu príkazov v unixových systémoch, ako sú xargs a GNU parallel.",
      "Prebieha diskusia o účinnosti príkazu seq v skriptovaní shellu, pričom účastníci diskutujú o výhodách a nevýhodách.",
      "V diskusiách sa zdôrazňuje dôležitosť špecifikácie správania pomocou príznakov alebo premenných prostredia a obhajuje sa začlenenie viacutils do jadra distribúcií."
    ],
    "points": 198,
    "commentCount": 54,
    "retryCount": 0,
    "time": 1703937638
  },
  {
    "id": 38817128,
    "title": "Odvolací súd rozhodol, že múzeá v Spojenom kráľovstve nesmú vyberať poplatky za reprodukciu historických umeleckých diel",
    "originLink": "https://www.theartnewspaper.com/2023/12/29/court-of-appeal-ruling-will-prevent-uk-museums-from-charging-reproduction-feesat-last",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38817128",
    "commentBody": "",
    "originSummary": [
      "Odvolací súd v Spojenom kráľovstve rozhodol, že múzeá nemôžu vyberať poplatky za reprodukciu historických umeleckých diel, ak sa na pôvodné dielo nevzťahujú autorské práva.",
      "Múzeá využívali autorské práva na obmedzenie používania obrázkov a vyžadovali drahé licencie, ale toto rozhodnutie potvrdzuje, že tento postup je nesprávny.",
      "Podľa tohto rozhodnutia sú symboly autorských práv na webových stránkach a katalógoch múzeí v Spojenom kráľovstve irelevantné v prípade umeleckých diel, na ktoré sa nevzťahujú autorské práva."
    ],
    "commentSummary": [
      "Odvolací súd Spojeného kráľovstva vydal rozhodnutie, ktoré obmedzuje múzeá vo vyberaní poplatkov za reprodukciu obrazov umeleckých diel s odvolaním sa na autorské právo a význam slobody tvorby.",
      "Rozsudok má vplyv na jazykové modely a používanie obrázkov, na ktoré sa nevzťahuje autorské právo, v umeleckých transformáciách a vyvoláva otázky týkajúce sa autorských práv na koláže a zoznamy slov, potenciálnych medzier v zákonoch o autorských právach, smernice EÚ o databázach a vplyvu na umenie vytvorené umelou inteligenciou.",
      "Rozhodnutie tiež vyvoláva diskusiu o potrebe zákonov o autorských právach, hodnote kultúrnych artefaktov a trvaní ochrany autorských práv."
    ],
    "points": 186,
    "commentCount": 51,
    "retryCount": 0,
    "time": 1703959102
  },
  {
    "id": 38821372,
    "title": "Loď Maersk zasiahla raketa; americké námorníctvo úspešne zachytilo útočníkov",
    "originLink": "https://gcaptain.com/maersk-ship-hit-by-missile-in-the-red-sea/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38821372",
    "commentBody": "",
    "originSummary": [
      "Kontajnerová loď spoločnosti Maersk s názvom Maersk Hangzhou bola počas plavby južnou časťou Červeného mora zasiahnutá raketou.",
      "Loď okamžite nahlásila incident a požiadala o pomoc, na čo zareagovali lode USS Gravely a USS Laboon.",
      "USS Gravely úspešne zachytila a zničila dve protilodné balistické rakety vypálené z oblastí kontrolovaných húsíjmi v Jemene, čím zabezpečila bezpečnosť plavidla a posádky."
    ],
    "commentSummary": [
      "Text obsahuje diskusie a komentáre o raketových útokoch, vojnách, konfliktoch, medzinárodných vzťahoch, vojenských reakciách, jadrových zbraniach a ich dôsledkoch.",
      "Medzi konkrétne krajiny patria Rusko, Irán, Severná Kórea, Jemen, Ukrajina a USA.",
      "Rozhovory poukazujú na zložitosť a výzvy spojené s týmito konfliktami."
    ],
    "points": 162,
    "commentCount": 209,
    "retryCount": 0,
    "time": 1703991791
  },
  {
    "id": 38816429,
    "title": "Predstavujeme DRµGS: Zvyšovanie rozmanitosti výstupov pomocou hlbokého náhodného mikroglitchového vzorkovania",
    "originLink": "https://github.com/EGjoni/DRUGS",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38816429",
    "commentBody": "",
    "originSummary": [
      "DRµGS je úložisko, ktoré zavádza metódu nazvanú Deep Random Micro-Glitch Sampling (DRµGS) na vnášanie šumu do transformačných vrstiev počas odvodzovania, čím sa zvyšuje rozmanitosť výstupu pri zachovaní koherencie.",
      "Úložisko v súčasnosti podporuje modely LLaMA a mistral a poskytuje implementácie a experimentálne údaje pre štyri typy DRµG: Q, K, V a A.",
      "Potenciálne negatívne vedľajšie účinky systému DRµGS sa riešia pomocou funkcie \"cold_shower\", ktorá je súčasťou úložiska.",
      "K dispozícii sú vizualizácie, ktoré ukazujú účinky vnášania šumu do rôznych vrstiev modelu.",
      "Podporujú sa príspevky a experimentovanie s DRµGS."
    ],
    "commentSummary": [
      "DRµGS je projekt na GitHube, ktorého cieľom je zaviesť náhodnosť do generatívnych modelov umelej inteligencie.",
      "Diskusie medzi používateľmi sa točia okolo vplyvu tohto prístupu na výstup modelu a toho, či zvyšuje jeho výkonnosť.",
      "Rozhovor sa odkloní aj od nesúvisiacich tém, ako je povesť tvorcu projektu a užívanie drog softvérovými inžiniermi."
    ],
    "points": 162,
    "commentCount": 40,
    "retryCount": 0,
    "time": 1703953505
  },
  {
    "id": 38818578,
    "title": "Amazon obvinený z predaja poškodených kníh, čo vyvoláva právne obavy",
    "originLink": "https://twitter.com/joabaldwin/status/1741145625809559933",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38818578",
    "commentBody": "",
    "originSummary": [
      "Osoba je rozrušená a hľadá radu po zistení, že niekto kúpil jej vrátenú a poškodenú kópiu od spoločnosti Amazon.",
      "Obávajú sa zákonnosti tejto situácie a chcú vedieť, ako ju riešiť a zabrániť jej opakovaniu v budúcnosti.",
      "Nie je jasné, aké konkrétne činy alebo detaily viedli k hnevu a obavám tejto osoby."
    ],
    "commentSummary": [
      "Služba má v súčasnosti problémy a nie je schopná spracovať požiadavky používateľov.",
      "Používatelia sú vyzvaní na opätovné načítanie stránky, aby sa pokúsili o opätovný prístup k službe."
    ],
    "points": 160,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1703966835
  }
]
