[
  {
    "id": 40239164,
    "title": "\"ஷேப்அப்\" உருவாக்குதல்: C இல் ஒரு 3D மாடலர்",
    "originLink": "https://danielchasehooper.com/posts/shapeup/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40239164",
    "commentBody": "",
    "originSummary": [
      "டேனியல் ஹூப்பர் ஒரு வார கால நிரலாக்க நிகழ்வின் போது \"ஷேப்அப்\" என்ற 3 டி மாடலரை உருவாக்கினார்.",
      "அவர் நிலையான நினைவக ஒதுக்கீட்டுடன் வடிவங்களை நிர்வகித்தார் மற்றும் ஒரு பயனர் இடைமுகம், ஜி.எல்.எஸ்.எல் ஷேடர் ஜெனரேட்டர், சுட்டி தேர்வு மற்றும் அணிவகுப்பு க்யூப்ஸ் ஏற்றுமதி ஆகியவற்றை இணைத்தார்.",
      "ரேலிப் நூலகத்துடன் சவால்கள் இருந்தபோதிலும், ஹூப்பர் இந்த திட்டத்தை நிறைவு செய்தார், 2300 கோடுகள் சி மற்றும் 250 வரிகள் ஜிஎல்எஸ்எல் குறியீட்டைக் கொண்ட செயல்பாட்டு 3 டி மாடலரை உருவாக்கினார், இது ஆன்லைனில் பார்ப்பதற்கும் சோதனைக்கும் கிடைக்கிறது."
    ],
    "commentSummary": [
      "விளையாட்டு மேம்பாட்டிற்காக ரேலிப்பைப் பயன்படுத்துதல், முழுத்திரை சிக்கல்களைத் தொடுதல், திறன்களை வழங்குதல் மற்றும் ஷேடர்களைச் சேமிப்பதற்கான வரம்புகள், சவால்கள் மற்றும் நேர்மறைகளை இந்த இடுகை ஆராய்கிறது.",
      "பயனர்கள் உண்மையான முழுத்திரையுடன் ஒப்பிடும்போது எல்லையற்ற முழுத்திரை பயன்முறைக்கான தங்கள் விருப்பங்களை வெளிப்படுத்துகிறார்கள், அதே நேரத்தில் வெப்அசெம்பிளி மூலம் உலாவிகளில் 2 டி கிராபிக்ஸ் மென்மையான ஸ்க்ரோலிங் பற்றி விவாதிக்கிறார்கள்.",
      "சி / சி ++ இல் அளவுரு சரிபார்ப்பு, சி நிரலாக்கத்தில் தெளிவான ஆவண முக்கியத்துவம், மாடலிங் / ரெண்டரிங்கில் சி இன் நன்மைகள் மற்றும் கையொப்பமிடப்பட்ட தூர செயல்பாடுகளின் (எஸ்.டி.எஃப்) பயன்பாடு போன்ற பல்வேறு தலைப்புகளும் மேம்பட்ட சிஏடி கருவிகள், ஜாவாவில் நினைவக மேலாண்மை, வரவிருக்கும் விளையாட்டு தேவ் நிகழ்வுகள், சூரிய சாம்பலில் எஸ்.டி.எஃப் ரெண்டரிங் மற்றும் விளையாட்டு வளர்ச்சியில் சி / சி ++ ஐப் பயன்படுத்துவதன் நன்மைகள் போன்ற பல்வேறு தலைப்புகளும் உள்ளடக்கப்பட்டுள்ளன."
    ],
    "points": 494,
    "commentCount": 112,
    "retryCount": 0,
    "time": 1714672094
  },
  {
    "id": 40237745,
    "title": "மாஸ்டரிங் கிரிப்டோகிராஃபி: டான் போனேவின் ஆழமான பாடநெறியில் மூழ்குங்கள்",
    "originLink": "https://crypto.stanford.edu/~dabo/courses/OnlineCrypto/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40237745",
    "commentBody": "",
    "originSummary": [
      "ஸ்டான்ஃபோர்ட் பல்கலைக்கழகம் டான் போனேவின் ஆன்லைன் கிரிப்டோகிராஃபி படிப்பை வழங்குகிறது, இது ஸ்ட்ரீம் சைஃபர்கள், ப்ளாக் சைஃபர்கள், கீ எக்ஸ்சேஞ்ச் மற்றும் பலவற்றை உள்ளடக்கியது.",
      "பாடநெறி வீடியோ விரிவுரைகள், ஸ்லைடுகள் மற்றும் குறியாக்கவியல் தலைப்புகளைப் பற்றிய விரிவான புரிதலுக்கான இலவச பாடப்புத்தகம் ஆகியவற்றை வழங்குகிறது.",
      "ஒவ்வொரு வாரமும் ஆழமான விளக்கங்கள் மற்றும் நிஜ உலக பயன்பாடுகளுடன் செய்தி ஒருமைப்பாடு, டிஜிட்டல் கையொப்பங்கள் மற்றும் பொது-விசை குறியாக்கம் போன்ற தலைப்புகளை மாணவர்கள் ஆராயலாம்."
    ],
    "commentSummary": [
      "ஸ்டான்போர்ட் பல்கலைக்கழகம் டான் போனேவின் கிரிப்டோகிராஃபி படிப்பை வழங்குகிறது, நேர்மறையான மதிப்புரைகளைப் பெறுகிறது மற்றும் கூடுதல் ஆதாரங்களை பரிந்துரைக்கிறது.",
      "புரூஸ் ஷ்னியர் எழுதிய \"ரியல்-வேர்ல்ட் கிரிப்டோகிராஃபி\" மற்றும் \"அப்ளைடு கிரிப்டோகிராஃபி\" போன்ற புத்தகங்கள் கிரிப்டோகிராஃபியின் நடைமுறை மற்றும் தத்துவார்த்த நுண்ணறிவுகளுக்கு பரிந்துரைக்கப்படுகின்றன.",
      "போனேவின் போக்கின் சிரமம் குறித்த விவாதம் மற்றும் காலாவதியான உள்ளடக்கம் காரணமாக ஷ்னியரின் புத்தகத்தின் பொருத்தம் குறித்த விமர்சனங்கள் உள்ளன; இருப்பினும், கிரிப்டோகிராஃபி ஆர்வலர்களுக்கு போனேவின் பாடநெறி மிகவும் பரிந்துரைக்கப்படுகிறது."
    ],
    "points": 337,
    "commentCount": 56,
    "retryCount": 0,
    "time": 1714665643
  },
  {
    "id": 40243238,
    "title": "கார்டியோ உடற்பயிற்சி: சுகாதார அபாயங்களின் முக்கிய முன்கணிப்பு",
    "originLink": "https://bjsm.bmj.com/content/58/10/556",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40243238",
    "commentBody": "",
    "originSummary": [
      "கார்டியோஸ்பிரேட்டரி ஃபிட்னெஸ் (சி.ஆர்.எஃப்) இறப்பு, நாட்பட்ட நோய்கள் மற்றும் ஒட்டுமொத்த நல்வாழ்வை எவ்வாறு பாதிக்கிறது என்பதை ஆராயும் பல ஆய்வுகளை இந்த கட்டுரை மதிப்பிடுகிறது, இது நல்ல சி.ஆர்.எஃப் பராமரிப்பதில் வழக்கமான உடல் செயல்பாடுகளின் முக்கியத்துவத்தை அடிக்கோடிட்டுக் காட்டுகிறது.",
      "இது பல்வேறு உடல்நல விளைவுகளுக்கான CRF இன் வலுவான முன்கணிப்பு தன்மையை வலியுறுத்துகிறது, சுகாதார மதிப்பீடு மற்றும் தலையீடுகளுக்கான மருத்துவ அமைப்புகளில் CRF இன் வழக்கமான அளவீட்டை பரிந்துரைக்கிறது.",
      "இலக்கியத்தில் தற்போதுள்ள இடைவெளிகளை நிவர்த்தி செய்வதற்கும், சி.ஆர்.எஃப் மற்றும் சுகாதார முடிவுகளுக்கு இடையிலான காரண தொடர்பைத் தீர்மானிப்பதற்கும் கூடுதல் ஆராய்ச்சி அவசியம்."
    ],
    "commentSummary": [
      "ஒட்டுமொத்த ஆரோக்கியம் மற்றும் நீண்ட ஆயுளுக்கான கார்டியோ உடற்தகுதியின் முக்கியத்துவத்திற்கு முக்கியத்துவம் அளிக்கப்படுகிறது, ஏரோபிக் உடற்தகுதியை சீராக வளர்ப்பதற்கான மண்டலம் 2 பயிற்சியை பரிந்துரைக்கிறது.",
      "எளிதான வேகத்தில் நிலையான கார்டியோ காயத்தைத் தடுக்கலாம், சகிப்புத்தன்மையை மேம்படுத்தலாம் மற்றும் நன்மைகளை அதிகரிக்கலாம்; மாறுபட்ட நடைமுறைகள் மற்றும் ஒரே அமர்வுக்குள் தீவிர கலவையைத் தவிர்ப்பது முக்கியம்.",
      "சைக்கிள் ஓட்டும்போது ஹெல்மெட் அணிவதன் செயல்திறன், கட்டுப்படுத்தப்பட்ட சோதனைகள் மூலம் உடற்பயிற்சி, வைட்டமின் டி அளவு மற்றும் இறப்பு ஆகியவற்றுக்கு இடையேயான தொடர்பை ஆராய்ந்து, உடற்பயிற்சி மற்றும் ஆரோக்கியத்திற்கான விரிவான அணுகுமுறையின் அவசியத்தை அடிக்கோடிட்டுக் காட்டுகிறது."
    ],
    "points": 328,
    "commentCount": 357,
    "retryCount": 0,
    "time": 1714701501
  },
  {
    "id": 40240724,
    "title": "ஒரு புதுமையான ராக்கெட் இயந்திரத்தை வடிவமைத்தல்: E2 எஞ்சின் மேம்பாட்டின் பயணம்",
    "originLink": "https://blog.ablspacesystems.com/p/building-e2",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40240724",
    "commentBody": "",
    "originSummary": [
      "ABL ஆல் உருவாக்கப்பட்ட E2 இயந்திரம் ஜெட்-ஏ மற்றும் திரவ ஆக்ஸிஜனால் இயக்கப்படும் நீடித்த ராக்கெட் இயந்திரமாகும்.",
      "நேரடி உந்துவிசை அனுபவம் இல்லாத போதிலும், ரியான் குன் ஆர்வம், உள்ளுணர்வு மற்றும் நடைமுறை பொறியியல் தீர்வுகளுக்கு முன்னுரிமை அளிப்பதன் மூலம் திட்டத்தை திறம்பட வழிநடத்தினார்.",
      "கட்டுரை வடிவமைப்பு செயல்முறையை விவரிக்கிறது, எரிவாயு ஜெனரேட்டர் இயந்திர சுழற்சி, டர்போபம்ப் வடிவமைப்பு, எரிப்பு அறைகள் மற்றும் தூண்டுதல்கள் போன்ற இயந்திர கூறுகளை உருவாக்குவதில் எதிர்கொள்ளும் சவால்கள் மற்றும் AFRL இல் உள்ள குழு இயந்திர வளர்ச்சியில் குறிப்பிடத்தக்க முன்னேற்றத்தை ஏற்படுத்துகிறது."
    ],
    "commentSummary": [
      "abslacesystems.com பற்றிய விவாதம் ராக்கெட் இயந்திரத்தை உருவாக்குதல், தொழில்நுட்ப எழுத்து, சோவியத் பொறியியல் சாதனைகள், திட்ட பின்னூட்ட சுழல்கள், ஸ்பேஸ்எக்ஸ் சவால்கள், ராக்கெட் பாகங்களுக்கான 3 டி அச்சிடுதல் மற்றும் சிஏடி கருவிகளைப் பயன்படுத்தி உலோக பகுதி வடிவமைப்பு போன்ற பல்வேறு தலைப்புகளை ஆராய்கிறது.",
      "இது ராக்கெட் உந்துவிசைக்கான அழுத்த அறைகளை ஆராய்கிறது மற்றும் குறைந்த விலை ராக்கெட் வடிவமைப்பிற்கான அழுத்த தொட்டிகளைப் பயன்படுத்தி விமர்சனங்களை செய்கிறது.",
      "மென்பொருள் கருவிகள், உற்பத்தி நிறுவனங்கள் மற்றும் இந்த பகுதிகளில் தொடக்க உதவிக்குறிப்புகள் பற்றிய பரிந்துரைகளை உரையாடல் பகிர்ந்து கொள்கிறது."
    ],
    "points": 251,
    "commentCount": 50,
    "retryCount": 0,
    "time": 1714679688
  },
  {
    "id": 40243168,
    "title": "\"sqlite-vec\" ஐ உருவாக்குதல்: SQLite இல் ஒரு புதிய திசையன் தேடல் தீர்வு",
    "originLink": "https://alexgarcia.xyz/blog/2024/building-new-vector-search-sqlite/index.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40243168",
    "commentBody": "",
    "originSummary": [
      "அலெக்ஸ் கார்சியா sqlite-vec ஐ அறிமுகப்படுத்துகிறது, திசையன் தேடலுக்கான புதிய SQLite நீட்டிப்பு, sqlite-vss ஐ மாற்ற வடிவமைக்கப்பட்டுள்ளது, தனிப்பயன் SQL செயல்பாடுகள் மற்றும் மெய்நிகர் அட்டவணைகளை வழங்குகிறது.",
      "C இல் மட்டுமே எழுதப்பட்ட, sqlite-vec வேகம் மற்றும் உட்பொதித்தலை குறிவைக்கிறது, மேம்பட்ட நினைவக நிர்வாகத்துடன் WebAssembly மற்றும் மொபைல் சாதனங்களுக்கான குறுக்கு-தளம் ஆதரவைப் பெருமைப்படுத்துகிறது.",
      "தற்போது செயல்பாட்டில் உள்ள நீட்டிப்பு, வரவிருக்கும் ஆரம்ப வெளியீட்டிற்கு அமைக்கப்பட்டுள்ளது; டெவலப்பர் திட்டத்தை முன்னெடுக்க ஸ்பான்சர்ஷிப் வாய்ப்புகளை நாடுகிறார்."
    ],
    "commentSummary": [
      "ஆசிரியர் ஒரு புதிய திசையன் தேடல் SQLite நீட்டிப்பை உருவாக்கி வருகிறார், ஆரம்பத்தில் நேரியல் ஸ்கேன்களை வலியுறுத்துகிறார், மேம்பட்ட அட்டவணைப்படுத்தல், ஏராளமான திசையன்களின் விரைவான செயலாக்கம் மற்றும் விரைவான தேடல்களுக்கான குவாண்டமயமாக்கலை விசாரிப்பதற்கான எதிர்கால திட்டங்களுடன்.",
      "பயனர்கள் தொடர்புடைய திட்டங்கள் மற்றும் திசையன் சேமிப்பக தீர்வுகளுடன் அவர்களின் சந்திப்புகள் குறித்த எண்ணங்களைப் பரிமாறிக் கொள்கிறார்கள், அதே நேரத்தில் இடுகை பைனரி திசையன்கள், குவாண்டமயமாக்கல், இயந்திர கற்றல் மாதிரிகள் மற்றும் SQLite போன்ற தரவுத்தளங்களில் திசையன் தேடலின் நன்மைகள் ஆகியவற்றை உள்ளடக்கியது.",
      "திட்டம் பற்றிய கருத்து நம்பிக்கையுடன் உள்ளது, பயனர்கள் SQLite நீட்டிப்புகள் பற்றிய தங்கள் அறிவை பங்களிக்கவும் விரிவுபடுத்தவும் ஆர்வமாக உள்ளனர்."
    ],
    "points": 239,
    "commentCount": 43,
    "retryCount": 0,
    "time": 1714700670
  },
  {
    "id": 40240037,
    "title": "முக அங்கீகார செயற்கை நுண்ணறிவை பயன்படுத்த அமெரிக்க போலீசாருக்கு மைக்ரோசாப்ட் தடை",
    "originLink": "https://techcrunch.com/2024/05/02/microsoft-bans-u-s-police-departments-from-using-enterprise-ai-tool/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40240037",
    "commentBody": "",
    "originSummary": [
      "சட்ட அமலாக்க தொழில்நுட்பத்தில் பாரபட்சங்கள் மற்றும் அபாயங்கள் குறித்த கவலைகளை நிவர்த்தி செய்வதற்காக அஸூர் ஓபன்ஏஐ சேவையில் முக அங்கீகாரத்திற்காக ஜெனரேட்டிவ் AI ஐ பயன்படுத்துவதிலிருந்து அமெரிக்க காவல்துறையை மைக்ரோசாப்ட் தடைசெய்கிறது.",
      "இந்த தடை அமெரிக்க காவல்துறையினருக்கு மொபைல் கேமராக்களில் நிகழ்நேர முக அங்கீகாரத்தை உள்ளடக்கியது, ஆனால் சர்வதேச சட்ட அமலாக்க நிறுவனங்கள் அல்ல.",
      "இந்த கொள்கை மாற்றம் சட்ட அமலாக்கத்தில் AI ஐப் பயன்படுத்துவது குறித்த விமர்சனத்திலிருந்து உருவாகிறது மற்றும் பாதுகாப்புத் துறை போன்ற பல்வேறு அரசு நிறுவனங்களில் OpenAI உடனான மைக்ரோசாப்டின் ஒத்துழைப்பை எடுத்துக்காட்டுகிறது."
    ],
    "commentSummary": [
      "மைக்ரோசாப்ட் தங்கள் முக அங்கீகார AI ஐ அமெரிக்க காவல்துறையினரால் பயன்படுத்துவதை தடை செய்துள்ளது, இது கண்காணிப்பு, போதைப்பொருள் சட்டங்கள், குற்ற விகிதங்கள் மற்றும் தனியார் மற்றும் அரசு நிறுவனங்களால் தரவு சேகரிப்பு குறித்த விவாதங்களைத் தூண்டியுள்ளது.",
      "இராணுவப் பயன்பாடு குறித்த OpenAI இன் கொள்கை மாற்றம், தொழில்நுட்ப நிறுவனங்களை பொறுப்பேற்கச் செய்தல், போட்டி எதிர்ப்பு நடத்தைகள் மற்றும் முக அங்கீகார தொழில்நுட்பத்தை மேற்பார்வையிடுவதில் மைக்ரோசாப்டின் ஈடுபாடு வரை உரையாடல் நீண்டுள்ளது.",
      "முக்கிய கவலைகளில் பக்கச்சார்பான அங்கீகாரம், நெறிமுறை சிக்கல்கள் மற்றும் காவல் துறைகளால் AI பயன்பாட்டில் தரநிலைகள் இல்லாதது ஆகியவை அடங்கும்."
    ],
    "points": 233,
    "commentCount": 119,
    "retryCount": 0,
    "time": 1714675891
  },
  {
    "id": 40235968,
    "title": "Backblaze Q1 2024 டிரைவ் புள்ளிவிவரங்கள்: நம்பகமான 16TB மாடல்கள் பேக்கை வழிநடத்துகின்றன",
    "originLink": "https://www.backblaze.com/blog/backblaze-drive-stats-for-q1-2024/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40235968",
    "commentBody": "",
    "originSummary": [
      "Backblaze அவர்களின் Q1 2024 டிரைவ் புள்ளிவிவரங்கள் அறிக்கையை வெளியிட்டது, 279,572 ஹார்ட் டிரைவ்களை ஆராய்ந்து, ஒட்டுமொத்தமாக 1.41% வருடாந்திர தோல்வி விகிதத்தை வெளிப்படுத்தியது.",
      "இந்த அறிக்கை மூன்று டிரைவ் மாடல்களில் பூஜ்ஜிய தோல்விகளை எடுத்துக்காட்டுகிறது, டிரைவ் அளவுகள், உற்பத்தியாளர்கள் மற்றும் 6TB சீகேட் டிரைவ்களின் நம்பகத்தன்மை மற்றும் 4TB தோஷிபாவிலிருந்து 16TB மாடல்களுக்கு மாறுவது போன்ற குறிப்பிடத்தக்க கண்டுபிடிப்புகளைப் பற்றி விவாதிக்கிறது.",
      "பழைய டிரைவ் மாடல்கள் அவற்றின் ஆயுட்காலத்தில் தோல்வியுற்றதை நோக்கிய மாற்றத்தை இந்த ஆய்வு குறிக்கிறது, நம்பகத்தன்மைக்கு குறிப்பிட்ட டிரைவ் மாதிரிகளை பரிந்துரைக்கிறது மற்றும் டிரைவ் ஸ்டாட்ஸ் தரவுத்தொகுப்பை இலவச பதிவிறக்கத்திற்கு வழங்குகிறது, கிளவுட் ஸ்டோரேஜ் மற்றும் கணினி பாதுகாப்பு குறித்த ஆண்டி க்ளீனின் நுண்ணறிவுகளுடன்."
    ],
    "commentSummary": [
      "விவாதத்தில் புதுப்பிக்கப்பட்ட ஹார்ட் டிரைவ்களின் நம்பகத்தன்மை, பேக் பிளேஸின் பெரிய மற்றும் அதிக செலவு குறைந்த டிரைவ்களைப் பயன்படுத்துதல் மற்றும் டிரைவ் தோல்வியைக் கணிக்க ஸ்மார்ட் அளவீடுகளைக் கண்காணித்தல் போன்ற தலைப்புகள் அடங்கும்.",
      "புதுப்பிக்கப்பட்ட டிரைவ்களை வாங்குவதில் பயனர்கள் கலவையான பதில்களைப் பகிர்ந்து கொள்கிறார்கள், சாத்தியமான அபாயங்களைப் பற்றி எச்சரிக்கிறார்கள், அதே நேரத்தில் சிலர் தங்கள் கொள்முதல் முடிவுகளை வழிநடத்த பேக் பிளேஸின் டிரைவ் புள்ளிவிவரங்களை நம்பியுள்ளனர்.",
      "தரவு இழப்பைத் தடுக்க ஸ்மார்ட் அளவீடுகள் மற்றும் ஓய்வு பெறும் இயக்கிகளை முன்கூட்டியே கண்காணிப்பதன் முக்கியத்துவத்தை வலியுறுத்துகிறது."
    ],
    "points": 231,
    "commentCount": 89,
    "retryCount": 0,
    "time": 1714656344
  },
  {
    "id": 40240737,
    "title": "RISC OS 5.30: ராஸ்பெர்ரி பைக்கான வேறுபட்ட கணினி சகாப்தம்",
    "originLink": "https://www.theregister.com/2024/05/02/rool_530_is_here/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40240737",
    "commentBody": "",
    "originSummary": [
      "RISC OS 5.30 என்பது அசல் Arm OS இன் சமீபத்திய பதிப்பாகும், இது Raspberry Pi போன்ற Arm-அடிப்படையிலான இயங்குதளங்களுடன் இணக்கமானது, இதில் Wi-Fi ஆதரவு மற்றும் பல்வேறு பயன்பாடுகள் உள்ளன.",
      "RISC OS Open திட்டத்தைச் சேர்ந்த ஸ்டீவ் ரெவில் தலைமையிலான OS, அதன் தனித்துவமான GUI மற்றும் வரம்புகள் இருந்தபோதிலும், நவீன வன்பொருளுக்கான உற்பத்தித்திறன் பயன்பாடுகள் மற்றும் மேம்பாட்டு கருவிகளை வழங்கி, சரியான வெளியீட்டு செயல்பாட்டில் கவனம் செலுத்துகிறது.",
      "விண்டேஜ் பயன்பாட்டு முன்மாதிரியை ஆதரிக்காத, RISC OS, வேறுபட்ட கணினி சகாப்தத்திற்கு ஒரு த்ரோபேக்கை வழங்குகிறது, இது இலவசம், திறந்த மூலமாகும், மேலும் 4 அல்லது 400 வரை Raspberry Pi மாடல்களை வழங்குகிறது, இது சமகால இயக்க முறைமைகளிலிருந்து ஒரு தனித்துவமான பயனர் அனுபவத்தை வழங்குகிறது."
    ],
    "commentSummary": [
      "விவாதம் RISC OS இன் பயனர் அனுபவத்தில் கவனம் செலுத்துகிறது, அதன் பல பயனர் ஆதரவு இல்லாதது மற்றும் பாதுகாப்பு நடவடிக்கைகளை மேம்படுத்துவதற்கான திறனை எடுத்துக்காட்டுகிறது.",
      "பயனர்கள் RISC OS ஐ நவீனமயமாக்குவதில் ஏக்கம் மற்றும் ஆர்வத்தை வெளிப்படுத்துகின்றனர், Raspberry Pi இல் அதன் திறன்களைப் பாராட்டுகிறார்கள், AmigaOS போன்ற பிற இயக்க முறைமைகள் மற்றும் எலக்ட்ரான் போன்ற கருவிகளுடன் ஒப்பிடுகிறார்கள்.",
      "நினைவக வரைபட அணுகல் மற்றும் எதிர்கால சிப்செட் ஆதரவு பற்றிய கவலைகள், ஆர்ம் அசெம்பிளி குறியீடு மற்றும் திறந்த மூல திட்டங்களில் கை குறியீட்டிற்கான சாத்தியக்கூறுகள் போன்ற தொழில்நுட்ப சிக்கல்களும் தொடப்படுகின்றன."
    ],
    "points": 218,
    "commentCount": 122,
    "retryCount": 0,
    "time": 1714679759
  },
  {
    "id": 40241734,
    "title": "போயிங் விசில்ப்ளோவரின் மரணம் விசாரணையைத் தூண்டுகிறது",
    "originLink": "https://www.newshub.co.nz/home/world/2024/05/whistleblower-josh-dean-of-boeing-supplier-spirit-aerosystems-dies-of-sudden-illness.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40241734",
    "commentBody": "",
    "originSummary": [
      "போயிங் விமானங்களில் பாதுகாப்பு பிரச்சினைகளை அம்பலப்படுத்தியதற்காக அறியப்பட்ட விசில்ப்ளோவர் ஜோஷ் டீன், மற்றொரு விசில்ப்ளோவரின் சமீபத்திய மரணத்தைத் தொடர்ந்து, எதிர்பாராத நோயால் சோகமாக காலமானார்.",
      "போயிங் சப்ளையர் ஸ்பிரிட் ஏரோசிஸ்டம்ஸின் முன்னாள் தர தணிக்கையாளரான டீன், 737 மேக்ஸில் உற்பத்தி குறைபாடுகளை மூத்த நிர்வாகம் கவனிக்கவில்லை என்று குற்றம் சாட்டினார், அவரது சில கூற்றுக்கள் சக ஊழியர்களால் உறுதிப்படுத்தப்பட்டன.",
      "டீன் மற்றும் போயிங் முன்னாள் வீரரான ஜான் பார்னெட் இருவரின் மரணங்களும் அவர்களின் நெருக்கமான நேரம் மற்றும் சூழ்நிலைகள் காரணமாக கவலைகளைத் தூண்டியுள்ளன, இது போலீஸ் விசாரணைகளைத் தூண்டியுள்ளது."
    ],
    "commentSummary": [
      "போயிங் நிறுவனத்தின் இரண்டாவது விசில்ப்ளோவர் காலமானார், இது நிறுவனத்தின் பாதுகாப்பு நடைமுறைகள் மற்றும் பொறுப்புக்கூறல் குறித்த விவாதங்களைத் தூண்டியது, குறிப்பாக எத்தியோப்பியன் ஏர்லைன்ஸ் விமானம் 302 துயரத்திற்குப் பிறகு.",
      "தவறான விளையாட்டு மற்றும் படுகொலைக்கு எம்.ஆர்.எஸ்.ஏ இன் சாத்தியமான பயன்பாடு பற்றிய ஊகங்கள் பரவி வருகின்றன, இது போயிங்கின் பாத்திரம் மற்றும் விசில்ப்ளோயர்களின் மரணங்களுக்குப் பின்னால் உள்ள நோக்கங்கள் பற்றிய விவாதங்களுக்கு வழிவகுக்கிறது.",
      "உரையாடல்களில் விசில்ப்ளோயர்கள் உற்பத்தி குறைபாடுகள், MRSA இன் சாத்தியமான ஆயுதமயமாக்கல், தனியார் பிரேத பரிசோதனைகள் மற்றும் தவறான தகவல்களின் பெருக்கம் ஆகியவை அடங்கும், சில கருத்துக்கள் பின்னடைவு, இறப்பு மற்றும் சதி கோட்பாடுகளை உரையாற்றுகின்றன."
    ],
    "points": 211,
    "commentCount": 71,
    "retryCount": 0,
    "time": 1714686445
  },
  {
    "id": 40235916,
    "title": "இரண்டாவது போயிங் விசில்ப்ளோவர் திடீரென இறந்தார்",
    "originLink": "https://www.newsweek.com/boeing-whistleblower-joshua-dean-dies-sudden-illness-1896401",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40235916",
    "commentBody": "",
    "originSummary": [
      "மற்றொரு போயிங் விசில்ப்ளோவர் பரிதாபமாக இறந்துவிட்டார்.",
      "இந்த சம்பவம் மே 2, 2024 அன்று தெரிவிக்கப்பட்டது, தற்போதைய புதுப்பிப்புகள் வழங்கப்பட்டன.",
      "-"
    ],
    "commentSummary": [
      "போயிங் நிறுவனத்தைச் சேர்ந்த இரண்டாவது விசில்ப்ளோவர் திடீரென காலமானார் என்று நியூஸ்வீக் தெரிவித்துள்ளது.",
      "இந்த செய்தி ஹேக்கர் நியூஸில் ஒரு விவாதத்தைத் தூண்டியது, இது தலைப்பில் தொடர்புடைய நூலுக்கு வழிவகுத்தது.",
      "-"
    ],
    "points": 204,
    "commentCount": 3,
    "retryCount": 0,
    "time": 1714656025
  },
  {
    "id": 40239029,
    "title": "Piccolo: தனித்துவமான அம்சங்களுடன் துரு அடிப்படையிலான லுவா மொழிபெயர்ப்பாளர்",
    "originLink": "https://kyju.org/blog/piccolo-a-stackless-lua-interpreter/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40239029",
    "commentBody": "",
    "originSummary": [
      "கட்டுரை ரஸ்டில் உருவாக்கப்பட்ட ஒரு அடுக்கற்ற லுவா மொழிபெயர்ப்பாளரான பிக்கோலோவை ஆராய்கிறது, பாதுகாப்பான சாண்ட்பாக்ஸிங் மற்றும் பின்னடைவு ஆகியவற்றில் கவனம் செலுத்துகிறது.",
      "தனித்துவமான அம்சங்களில் சமச்சீர் கோரோட்டீன்கள் மற்றும் தனிப்பயன் திட்டமிடல் ஆகியவை அடங்கும், திறமையான குப்பை சேகரிப்பு மற்றும் இயங்கும் குறியீட்டை குறுக்கிடும் கவனத்தை ஈர்க்கிறது.",
      "ரஸ்ட் சுற்றுச்சூழல் அமைப்புடன் தடையின்றி ஒருங்கிணைத்தல் மற்றும் பல்வேறு அமைப்புகளுக்கான கட்டுப்பாடற்ற மொழிபெயர்ப்பாளர்களை உருவாக்குதல், நெறிப்படுத்தப்பட்ட ஒத்திசைவற்ற நிரலாக்கத்திற்காக லுவாவில் ரஸ்ட் கோரோட்டீன்களுக்கான சாத்தியக்கூறுகள்."
    ],
    "commentSummary": [
      "பிக்கோலோ, ஒரு அடுக்கு இல்லாத லுவா மொழிபெயர்ப்பாளர், சொந்த குறியீட்டில் செயல்படுத்தப்பட்ட லுவாவின் \"string.find()\" போன்ற செயல்பாடுகள் காரணமாக பைட்கோட் வழிமுறைகளுக்கு வரையறுக்கப்பட்ட மரணதண்டனை நேரத்தை உறுதிப்படுத்த போராடுகிறார்.",
      "சொந்த குறியீட்டில் மரணதண்டனை நேரத்தை கண்காணிப்பதன் முக்கியத்துவத்தை வலியுறுத்துகிறது மற்றும் ரஸ்ட் மற்றும் லுவா இடையே பொருந்தக்கூடிய பலங்களை எடுத்துக்காட்டுகிறது.",
      "கட்டுரையில் உள்ள கருத்துகள் பிக்கோலோவின் வடிவமைப்பு, சாத்தியமான பயன்பாடுகள் மற்றும் பிற தொழில்நுட்பங்களுடனான ஒப்பீடுகள் பற்றி விவாதிக்கின்றன, சிறந்த செயல்திறன் மற்றும் எழுத்துரு தெளிவுக்கான தேர்வுமுறை உதவிக்குறிப்புகளை வழங்குகின்றன."
    ],
    "points": 203,
    "commentCount": 22,
    "retryCount": 0,
    "time": 1714671481
  },
  {
    "id": 40237855,
    "title": "ஒராங்குட்டான் தாவரத்தைப் பயன்படுத்தி குணப்படுத்தும் நடத்தையை வெளிப்படுத்துகிறது",
    "originLink": "https://www.bbc.co.uk/news/science-environment-68942123",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40237855",
    "commentBody": "",
    "originSummary": [
      "ராகுஸ் என்ற சுமத்ரா ஒராங்குட்டான் தனது கன்னத்தில் ஏற்பட்ட காயத்தை குணப்படுத்த ஒரு தாவர பசையைப் பயன்படுத்தினார், இது ஒரு காட்டு விலங்கு சிகிச்சைக்காக ஒரு மருத்துவ தாவரத்தைப் பயன்படுத்துவதை முதன்முதலில் கவனித்ததைக் குறிக்கிறது.",
      "இந்த நடத்தை மனிதர்களுக்கும் பெரிய வாலில்லா குரங்குகளுக்கும் இடையிலான பகிரப்பட்ட பரிணாம வரலாற்றுடன் சாத்தியமான தொடர்பைக் குறிக்கிறது, இது மருத்துவ பயன்பாட்டில் ஒற்றுமைகளைக் காட்டுகிறது.",
      "தாவர பவுல்டிஸைப் பயன்படுத்திய சுமார் ஒரு மாதத்தில் ராகஸின் காயம் குணமடைந்தது, இது அவரது குழு உறுப்பினர்களிடமிருந்து கற்றுக்கொண்ட நடத்தையைக் குறிக்கிறது."
    ],
    "commentSummary": [
      "விவாதம் விலங்கு நுண்ணறிவு மற்றும் நடத்தையை ஆராய்கிறது, ஒராங்குட்டான்கள் மற்றும் நாய்கள் குணப்படுத்துவதற்காக தாவரங்களைப் பயன்படுத்துவதில் கவனம் செலுத்துகிறது, உயிரியல் பூங்காக்கள் மற்றும் தொழிற்சாலை பண்ணைகளில் நெறிமுறை கவலைகளைத் தொடுகிறது.",
      "இது இயற்கை மருந்துகளின் நன்மைகள் மற்றும் மருந்து காப்புரிமையில் உள்ள சவால்களை எடுத்துக்காட்டுகிறது, இது தாவர மருத்துவ பண்புகள் குறித்து மேலும் ஆராய்ச்சி செய்ய அழைப்பு விடுக்கிறது.",
      "உரையாடல் தற்போதைய மருந்துத் துறையின் வரம்புகளையும் உரையாற்றுகிறது, விலங்கு நடத்தை மற்றும் மருத்துவ திறன் பற்றிய ஆழமான புரிதலுக்கு வாதிடுகிறது."
    ],
    "points": 202,
    "commentCount": 110,
    "retryCount": 0,
    "time": 1714666145
  },
  {
    "id": 40238509,
    "title": "ஹேக்கர் தேடல்: ஹேக்கர் செய்திகளுக்கான சொற்பொருள் தேடுபொறி",
    "originLink": "https://hackersearch.net",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40238509",
    "commentBody": "",
    "originSummary": [
      "ஜொனாதன் ஹேக்கர் தேடலை உருவாக்கினார், இது ஹேக்கர் செய்திகளுக்கான சொற்பொருள் தேடுபொறியாகும், இது OpenAI இன் உட்பொதிக்கும் மாதிரிகள் மற்றும் ஸ்கிராப் செய்யப்பட்ட உள்ளடக்கத்திற்கான பாரம்பரிய குறியீடுகளைப் பயன்படுத்துகிறது.",
      "தேடுபொறி பயனர்கள் முக்கிய வார்த்தைகள் அல்லது விளக்கங்களை உள்ளிடுவதன் மூலம் சிறந்த இணைப்புகள் மற்றும் சுருக்கங்களை எளிதாகக் கண்டறிய உதவுகிறது, ஆர்வங்களின் அடிப்படையில் கதைகளை பரிந்துரைப்பதில் விரிவாக்கும் திட்டங்களுடன்.",
      "போட்டி இருந்தபோதிலும், ஹேக்கர் தேடல் முக்கிய சொல் / வாக்கியத் தேடல்களில் சிறப்பாக செயல்படுகிறது, ஹேக்கர் செய்தி உள்ளடக்கத்தை வழிநடத்தும்போது பயனர்களுக்கு சிறந்த அனுபவத்தை வழங்குகிறது."
    ],
    "commentSummary": [
      "OpenAI மாதிரிகள் மற்றும் பாரம்பரிய குறியீடுகளுடன் ஹேக்கர் செய்திகளுக்கான சொற்பொருள் தேடுபொறியை மேம்படுத்துவது விவாதத்தின் முதன்மை மையமாகும்.",
      "தலைப்புகளில் தரவு சுத்தம், ஆவண உட்பொதித்தல்கள் மற்றும் தேடல் துல்லியம் மற்றும் முடிவுகளை மேம்படுத்த ஹைட் போன்ற கருவிகள் அடங்கும்.",
      "சுருக்கங்களை உருவாக்குவதற்கும், பயனர் அனுபவத்தை மேம்படுத்துவதற்கும், குறியீட்டு தரவுத்தொகுப்பில் உள்ள வரம்புகளை நிவர்த்தி செய்வதற்கும் GPT மாதிரிகளைப் பயன்படுத்துவதற்கான திட்டங்கள் உள்ளன, எதிர்கால மேம்பாடுகளுக்கான கருத்துக்களுக்கு படைப்பாளர் திறந்திருக்கும்."
    ],
    "points": 198,
    "commentCount": 64,
    "retryCount": 0,
    "time": 1714669260
  },
  {
    "id": 40242410,
    "title": "புதுமையான CSS கலை: ஒரு ஒற்றை Div காட்சி பெட்டி",
    "originLink": "https://a.singlediv.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40242410",
    "commentBody": "",
    "originSummary": [
      "\"எ சிங்கிள் டிவ்\" என்பது 2014-2019 க்கு இடையில் கிட்ஹப்பில் வழங்கப்பட்ட லின் ஃபிஷரின் CSS வரைதல் திட்டமாகும், இது ஒரு HTML உறுப்பைப் பயன்படுத்தி வடிவமைக்கப்பட்ட பல்வேறு வடிவமைப்புகளைக் காட்டுகிறது.",
      "இந்த திட்டம் ஒரு காபி வாங்குவதன் மூலமும், கூடுதல் ஒற்றை டிவ் வடிவமைப்புகளை ஆராய்வதன் மூலமும் கலைஞரை ஆதரிப்பதற்கான வாய்ப்பை வழங்குகிறது."
    ],
    "commentSummary": [
      "ஒரு ஒற்றை டிவ்\" ஒரு HTML div இல் CSS உடன் மட்டுமே வடிவமைக்கப்பட்ட கிராபிக்ஸ் காட்டுகிறது, இது வலை அபிவிருத்தியில் CSS கலையின் தொழில்நுட்ப வலிமைக்கு பாராட்டைத் தூண்டுகிறது.",
      "பயனர்கள் CSS கலையைப் பற்றிய உரையாடல்களில் ஈடுபடுகிறார்கள், அதன் முக்கியத்துவத்தை முன்னிலைப்படுத்துகிறார்கள் மற்றும் CSS கலையை உருவாக்குவதற்கான வளங்களையும் கருவிகளையும் பகிர்ந்து கொள்கிறார்கள்.",
      "இந்த இடுகையில் CSS கலை தொடர்பான பிற திட்டங்கள் பற்றிய விவாதங்கள் அடங்கும், \"ஒரு ஒற்றை டிவிஷன்\" க்கு அப்பால் ஆய்வை விரிவுபடுத்துகிறது."
    ],
    "points": 195,
    "commentCount": 38,
    "retryCount": 0,
    "time": 1714691860
  },
  {
    "id": 40241525,
    "title": "ஸ்டார்ட்அப் ஆக்சிலரேட்டர் நியூசிப் மடிப்புகள்: நிறுவனர்கள் நிறுவனங்களை இழக்கிறார்கள்",
    "originLink": "https://techcrunch.com/2024/05/02/they-thought-they-were-joining-an-accelerator-instead-they-lost-their-startups/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40241525",
    "commentBody": "",
    "originSummary": [
      "தொடக்க முடுக்கியான நியூசிப், திவால்நிலையை அறிவித்தது, இது 1,000 க்கும் மேற்பட்ட தொடக்கங்களிலிருந்து வாரண்டுகளை ஏலம் விட வழிவகுத்தது, இதனால் டெக் எய்டின் லேசி ஹண்டர் போன்ற நிறுவனர்கள் தங்கள் நிறுவனங்களை இழக்க நேரிட்டது.",
      "தலைமை நிர்வாக அதிகாரி ஆண்ட்ரூ ரியான் தனது நிர்வாக பாணிக்காக விமர்சனங்களைப் பெற்றார், மேலும் 500 மில்லியன் டாலர் மதிப்புள்ள வாரண்டுகளை நிர்வகிப்பதில் வாய்ப்புகளை தவறவிட்டது, நிறுவனத்தின் நிதி நிலைமையை மோசமாக்கியது.",
      "டீல் சிண்டிகேட் கணிசமான எண்ணிக்கையிலான வாரண்டுகளைப் பெற்றது, மேலும் விரைவில் விற்கப்படும் என்று எதிர்பார்க்கப்படுகிறது, இது காரெட் டெம்பிள் போன்ற நிறுவனர்களின் அனுபவங்களின் மூலம் முடுக்கி திட்டங்களுடன் தொடர்புடைய அபாயங்களை எடுத்துக்காட்டுகிறது."
    ],
    "commentSummary": [
      "தொடக்கத் துறையில் உள்ள தொழில்முனைவோர் முடுக்கிகள், குறைந்தபட்ச தொகைகளுக்கு நிறுவனங்களை கையகப்படுத்துவது மற்றும் முடுக்கிகள் வழங்கும் மதிப்பைப் பற்றிய கவலைகள் போன்ற சவால்களை எதிர்கொள்கின்றனர்.",
      "தொடக்கங்களுக்கு நிதியளிப்பதில் துணிகர முதலீட்டாளர்களின் ஈடுபாடு குறித்து விவாதம் எழுகிறது, VC நிதியளிப்பின் அபாயங்கள் மற்றும் நன்மைகள் மற்றும் பூட்ஸ்ட்ராப் செய்யப்பட்ட நிறுவனங்களின் போராட்டங்களைப் பற்றி விவாதிக்கிறது.",
      "நேவல் ரவிகாந்த் போன்ற குறிப்பிடத்தக்க புள்ளிவிவரங்கள் செல்வாக்கு மிக்கவை, தொடக்க முதலீடுகளில் வாரண்ட் உரிமை முக்கியமானது, நிறுவனர்கள் மற்றும் முதலீட்டாளர்கள் இருவருக்கும் சாத்தியமான விளைவுகளை வலியுறுத்துகிறது."
    ],
    "points": 191,
    "commentCount": 119,
    "retryCount": 0,
    "time": 1714685082
  }
]
