[
  {
    "id": 39261861,
    "title": "Vesuvius चैलेंज 2023 विजेता मशीन लर्निंग का उपयोग करके 2000 साल पुरानी स्क्रॉल को समझें",
    "originLink": "https://scrollprize.org/grandprize",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39261861",
    "commentBody": "",
    "originSummary": [
      "वेसुवियस चैलेंज 2023 ग्रैंड पुरस्कार के विजेताओं की घोषणा कर दी गई है, और उन्होंने हरकुलेनियम पपीरी से 2000 साल पुरानी स्क्रॉल को सफलतापूर्वक पढ़ा है।",
      "स्क्रॉल संगीत, भोजन और आनंद जैसे विषयों पर चर्चा करता है, आगे के अध्ययन के लिए मूल्यवान अंतर्दृष्टि प्रदान करता है।",
      "विजेता टीम ने मशीन लर्निंग मॉडल और ऑटो-सेगमेंटेशन टूल का उपयोग किया, लेकिन उन्हें अभी भी उन पर सुधार करने की आवश्यकता है।",
      "अनुसंधान प्रक्रिया में पेपिरस स्क्रॉल का विश्लेषण करने के लिए एक्स-रे टोमोग्राफी और मशीन लर्निंग का उपयोग शामिल था।",
      "प्रतियोगिता ने सहयोग और सूचना साझाकरण को बढ़ावा दिया।",
      "अगली चुनौती, 2024 वेसुवियस चैलेंज की घोषणा की गई है, जिसका उद्देश्य शास्त्रीय जीवन और साहित्य की हमारी समझ को बढ़ाने के लिए दफन स्क्रॉल से अधिक ग्रंथों को अनलॉक करना है।",
      "चुनौती के विजेता गेटी विला संग्रहालय में जश्न मनाएंगे।"
    ],
    "commentSummary": [
      "वैज्ञानिकों ने डिजिटल अनरैपिंग और एआई एल्गोरिदम के माध्यम से प्राचीन स्क्रॉल को पढ़ने में प्रगति की है, जिससे पुरातत्व और प्रौद्योगिकी में संभावित प्रगति हुई है।",
      "मैनुअल विभाजन और अधिक स्क्रॉल की स्कैनिंग में चुनौतियां, साथ ही धन की आवश्यकता, इस क्षेत्र में आगे के विकास में बाधा डाल रही हैं।",
      "उत्साह खोई हुई पांडुलिपियों की संभावित खोज और स्क्रॉल में एपिकुरियन दर्शन की समझ को घेरता है, लेकिन सटीकता और सत्यापन के बारे में चिंताएं बनी रहती हैं।"
    ],
    "points": 1004,
    "commentCount": 152,
    "retryCount": 0,
    "time": 1707145202
  },
  {
    "id": 39266396,
    "title": "समायोज्य त्वरण: प्रकाश की 0.00% गति पर सापेक्ष अंतरिक्ष यान की खोज",
    "originLink": "https://dmytry.github.io/space/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39266396",
    "commentBody": "",
    "originSummary": [
      "पृष्ठ उपयोगकर्ताओं को एक सापेक्ष अंतरिक्ष यान के साथ बातचीत करने और इसके त्वरण को समायोजित करने की अनुमति देता है।",
      "उपयोगकर्ता पृष्ठ पर दूरी, डॉपलर कारक, जहाज का समय और विश्व समय जैसे विभिन्न माप देख सकते हैं।",
      "दिमित्री लावरोव द्वारा बनाए गए पृष्ठ में चमक और त्वरण के आसपास केंद्रित एक विषय है।"
    ],
    "commentSummary": [
      "चर्चा में अंतरिक्ष यात्रा और इससे जुड़ी चुनौतियों से संबंधित विभिन्न विषयों को शामिल किया गया है, जिसमें मिल्की वे के केंद्र का दौरा करने के लिए एक अंतरिक्ष यान को तेज करने की सीमाएं और इंटरस्टेलर कणों से संभावित नुकसान शामिल हैं।",
      "विषयों में ढाल के रूप में ईंधन का उपयोग, प्रणोदन के लिए गतिज ऊर्जा का उपयोग करने की व्यवहार्यता और अंतरिक्ष में परमाणुओं का घनत्व भी शामिल है।",
      "बातचीत एक हथियार के रूप में अंतरिक्ष की अवधारणा, उन्नत अंतरिक्ष ड्राइव की संभावित विनाशकारी शक्ति, समय यात्रा की अवधारणा, इंटरस्टेलर यात्रा की व्यवहार्यता, मानव शरीर पर त्वरण के प्रभाव और अंतरिक्ष में उच्च गति पर नेविगेट करने के संभावित जोखिमों और सीमाओं की पड़ताल करती है।"
    ],
    "points": 750,
    "commentCount": 344,
    "retryCount": 0,
    "time": 1707163667
  },
  {
    "id": 39263854,
    "title": "एटोपाइल: कोड के साथ सर्किट बोर्ड डिजाइन करना",
    "originLink": "https://news.ycombinator.com/item?id=39263854",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39263854",
    "commentBody": "",
    "originSummary": [
      "एटोपाइल के रचनाकारों ने कोड का उपयोग करके सर्किट का वर्णन करने के लिए एटोपाइल नामक एक ओपन-सोर्स भाषा और टूलचेन विकसित किया है।",
      "लक्ष्य इलेक्ट्रॉनिक्स को प्रभावी ढंग से अमूर्त करना और हार्डवेयर डिजाइन में सॉफ्टवेयर इंजीनियरों के वर्कफ़्लो से प्रेरित डिजाइनों के पुन: उपयोग को सक्षम करना है।",
      "एटोपाइल कंपाइलर नेटलिस्ट उत्पन्न करता है और सर्किट के लिए घटकों का चयन करता है, जिसमें कम से मध्यम जटिलता वाले पीसीबी को डिजाइन करने पर वर्तमान ध्यान केंद्रित किया जाता है।"
    ],
    "commentSummary": [
      "एटोपाइल एक उपकरण है जो स्वचालन, सहयोग और घटक चयन पर ध्यान देने के साथ कोड का उपयोग करके सर्किट बोर्ड डिजाइन की अनुमति देता है।",
      "लेख वर्तमान इलेक्ट्रॉनिक्स डिजाइन टूल की सीमाओं और दृश्य योजनाबद्ध को कोड में परिवर्तित करने की चुनौतियों की पड़ताल करता है।",
      "यह हार्डवेयर इंजीनियरिंग में एक सॉफ्टवेयर पारिस्थितिकी तंत्र की क्षमता पर चर्चा करता है, जिसमें घटक चयन का अनुकूलन, कोड-आधारित दृष्टिकोण के लाभ और ओपन-सोर्स समुदाय में संभावित वृद्धि शामिल है।"
    ],
    "points": 493,
    "commentCount": 251,
    "retryCount": 0,
    "time": 1707154250
  },
  {
    "id": 39269327,
    "title": "एसएमएस-आधारित प्रमाणीकरण: सिम-स्वैप हमलों के लिए दोषी कंपनियां",
    "originLink": "https://keydiscussions.com/2024/02/05/sim-swap-attacks-can-be-blamed-on-companies-embracing-sms-based-password-resets/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39269327",
    "commentBody": "",
    "originSummary": [
      "खाता लॉगिन और पासवर्ड रीसेट के लिए एसएमएस पर भरोसा करने वाली सुरक्षा कंपनियों को सिम-स्वैप हमलों के लिए जिम्मेदार ठहराया जाना चाहिए।",
      "सिम-स्वैप हमले तब होते हैं जब अपराधी वाहक को पीड़ित के फोन नंबर को अपने डिवाइस पर स्थानांतरित करने के लिए धोखा देते हैं, एसएमएस खाता लॉगिन विवरण और संवेदनशील जानकारी तक पहुंच प्रदान करते हैं।",
      "Apple, Google और PayPal जैसी हाई-प्रोफाइल कंपनियों ने अपनी ज्ञात सुरक्षा खामियों के बावजूद एसएमएस-आधारित प्रमाणीकरण को अपनाया है, और लेखक Authy या Google प्रमाणक जैसे अधिक सुरक्षित विकल्पों को अपनाने का तर्क देता है।"
    ],
    "commentSummary": [
      "बातचीत खाता प्रमाणीकरण और सुरक्षा उपायों के विभिन्न तरीकों की पड़ताल करती है, जैसे एसएमएस, यूबिकी, टीओटीपी ऐप और ईमेल।",
      "सिम स्वैपिंग हमलों के बारे में चिंताओं के कारण खाता से संबंधित उद्देश्यों के लिए एसएमएस का उपयोग करने की विश्वसनीयता और प्रभावशीलता के बारे में असहमति है।",
      "चर्चा विभिन्न प्रमाणीकरण विधियों की सीमाओं और कमजोरियों पर जोर देती है, सख्त नियमों और सुरक्षा और उपयोगकर्ता सुविधा के बीच संतुलन प्राप्त करने के लिए बहु-कारक प्रमाणीकरण के बेहतर कार्यान्वयन का आह्वान करती है।"
    ],
    "points": 391,
    "commentCount": 269,
    "retryCount": 0,
    "time": 1707180517
  },
  {
    "id": 39259602,
    "title": "कितने स्व-नियोजित व्यक्ति बाहरी फंडिंग के बिना अपने स्वयं के उद्यमों को बनाए रखते हैं?",
    "originLink": "https://news.ycombinator.com/item?id=39259602",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39259602",
    "commentBody": "",
    "originSummary": [
      "वक्ता स्व-नियोजित व्यक्तियों और उनके व्यवसायों की संख्या के बारे में उत्सुक है, विशेष रूप से वे जिन्होंने बाहरी वित्तीय सहायता के बिना अपने स्वयं के उद्यम शुरू किए हैं।",
      "वे यह समझने में रुचि रखते हैं कि ये व्यक्ति बाहरी धन के बिना खुद को कैसे बनाए रखने में सक्षम हैं।",
      "वक्ता उद्यमशीलता के परिदृश्य और स्व-नियोजित व्यक्तियों द्वारा अपने व्यवसायों को बनाए रखने के लिए नियोजित रणनीतियों में अंतर्दृष्टि की मांग कर रहा है।"
    ],
    "commentSummary": [
      "बातचीत में स्वरोजगार के विभिन्न पहलुओं को शामिल किया गया है, जैसे विभिन्न व्यवसायों की लाभप्रदता, कर निहितार्थ, चुनौतियां और पुरस्कार।",
      "पोलैंड में सॉफ्टवेयर उद्योग और इस क्षेत्र में फ्रीलांसिंग के फायदे और जोखिमों पर विशेष ध्यान दिया गया है।",
      "बातचीत में व्यवसाय के मालिक होने के लाभों पर प्रकाश डाला गया है, जिसमें वित्तीय सफलता और व्यक्तिगत पूर्ति की संभावना शामिल है।"
    ],
    "points": 328,
    "commentCount": 395,
    "retryCount": 0,
    "time": 1707129521
  },
  {
    "id": 39264383,
    "title": "वाशिंगटन हाउस बिल पुलिस को पूछताछ में झूठ बोलने से प्रतिबंधित करके झूठे कबूलनामे से निपटता है",
    "originLink": "https://www.seattletimes.com/seattle-news/politics/wa-house-would-make-it-illegal-for-police-to-lie-during-interrogations/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39264383",
    "commentBody": "",
    "originSummary": [
      "वाशिंगटन में एक प्रस्तावित विधेयक का उद्देश्य पुलिस अधिकारियों को पूछताछ के दौरान झूठ बोलने से प्रतिबंधित करना है ताकि झूठे कबूलनामे की चिंताओं को दूर किया जा सके और नैतिक कानून प्रवर्तन प्रथाओं को बढ़ावा दिया जा सके।",
      "बिल का लक्ष्य जवाबदेही बढ़ाना और आपराधिक न्याय प्रणाली की अखंडता को मजबूत करना है।",
      "यदि पारित हो जाता है, तो इस कानून में पुलिस पूछताछ की रणनीति और स्वीकारोक्ति की विश्वसनीयता के लिए महत्वपूर्ण प्रभाव हो सकते हैं।"
    ],
    "commentSummary": [
      "बातचीत पुलिस कदाचार के विभिन्न पहलुओं पर प्रकाश डालती है, जिसमें पूछताछ के दौरान धोखे और सार्वजनिक रक्षकों के सामने आने वाली चुनौतियाँ शामिल हैं।",
      "झूठे कबूलनामे, जबरदस्ती और पुलिस अधिकारियों के प्रति जवाबदेही की कमी के बारे में चिंता जताई जाती है।",
      "कानूनी प्रतिनिधित्व के महत्व और कानूनी सलाह के बिना पुलिस के साथ जुड़ने के जोखिमों पर जोर दिया जाता है, चर्चा के साथ कानून प्रवर्तन में दौड़ और विश्वास के मुद्दों पर भी चर्चा होती है।"
    ],
    "points": 280,
    "commentCount": 274,
    "retryCount": 0,
    "time": 1707156217
  },
  {
    "id": 39263664,
    "title": "आपने एलएलएम के साथ क्या बनाया है? - एलएलएम अनुप्रयोगों और तैनाती की खोज",
    "originLink": "https://news.ycombinator.com/item?id=39263664",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39263664",
    "commentBody": "",
    "originSummary": [
      "व्यक्ति एलएलएम (बड़े भाषा मॉडल) का उपयोग करके बनाई गई परियोजनाओं के बारे में उत्सुक है।",
      "वे यूट्यूब वीडियो में प्रायोजित अनुभागों को छोड़ने के लिए क्रोम एक्सटेंशन विकसित करने और विभिन्न प्रोग्रामिंग भाषाओं में फ़ंक्शन कॉल चेन को समझाने के लिए एलएलएम का उपयोग करने के साथ प्रयोग करने का उल्लेख करते हैं।",
      "व्यक्ति अपनी परियोजनाओं में दूसरों द्वारा उपयोग की जाने वाली प्रौद्योगिकी स्टैक और तैनाती विधियों के बारे में सीखने में भी रुचि रखता है।"
    ],
    "commentSummary": [
      "सारांश विभिन्न परियोजनाओं और पहलों पर प्रकाश डालता है जो GPT-3 और GPT-4 जैसे भाषा मॉडल का उपयोग करते हैं।",
      "परियोजनाओं में क्रोम एक्सटेंशन, बिक्री प्रशिक्षण के लिए एआई, चैटबॉट्स, ट्रांसक्रिप्शन और संगठन उपकरण, भाषा सीखने वाले ऐप और विभिन्न स्वचालन और एआई-संचालित उपकरण शामिल हैं।",
      "चर्चा में भाषा मॉडल में चुनौतियों, सीमाओं और सुधारों के साथ-साथ कोडिंग साक्षात्कार की तैयारी, सामग्री संक्षेपण, सेवा प्रलेखन और वित्तीय आय कॉल विश्लेषण में एआई की क्षमता का उल्लेख है।"
    ],
    "points": 256,
    "commentCount": 219,
    "retryCount": 0,
    "time": 1707153387
  },
  {
    "id": 39262650,
    "title": "वीववर्क्स बंद हो गया, जिससे उद्योग के पेशेवर निराश हो गए",
    "originLink": "https://www.linkedin.com/posts/richardsonalexis_hi-everyone-i-am-very-sad-to-announce-activity-7160295096825860096-ZS67",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39262650",
    "commentBody": "",
    "originSummary": [
      "क्लाउड नेटिव कंपनी वीववर्क्स मजबूत राजस्व और बढ़ते ग्राहक आधार के बावजूद अपने परिचालन को बंद कर रही है।",
      "बंद एक अस्थिर नकदी की स्थिति और एक असफल विलय और अधिग्रहण सौदे के कारण था।",
      "वीववर्क्स के ओपन-सोर्स सॉफ्टवेयर, विशेष रूप से सीएनसीएफ फ्लक्स के निरंतर विकास और रखरखाव को सुनिश्चित करने के प्रयास किए जा रहे हैं।",
      "उद्योग के पेशेवर इस खबर से निराश हैं, क्योंकि वीववर्क्स ने क्लाउड नेटिव इकोसिस्टम में महत्वपूर्ण योगदान दिया है।"
    ],
    "commentSummary": [
      "कुबेरनेट्स प्रबंधन उपकरणों पर केंद्रित एक स्टार्टअप वीववर्क्स महत्वपूर्ण राजस्व और वित्त पोषण के बावजूद बंद हो गया है।",
      "सीईओ के लिंक्डइन पोस्ट से पता चलता है कि वे अधिग्रहण के लिए अधिक आकर्षक दिखने का लक्ष्य रख रहे थे।",
      "यह निर्णय लेने और स्टार्टअप में प्रचलित \"शूट फॉर द मून\" मानसिकता के बारे में सवाल उठाता है, जहां विकास अक्सर लाभप्रदता पर प्राथमिकता लेता है।"
    ],
    "points": 244,
    "commentCount": 208,
    "retryCount": 0,
    "time": 1707149210
  },
  {
    "id": 39260760,
    "title": "एक यादृच्छिक दिन पर हैकर समाचार पर जाएँ",
    "originLink": "https://randomhackernews.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39260760",
    "commentBody": "",
    "originSummary": [
      "उपयोगकर्ता ने एक वेबसाइट विकसित की है जो उपयोगकर्ताओं को आज और 19 फरवरी, 2007 के बीच एक यादृच्छिक दिन से हैकर समाचार के सामने वाले पृष्ठ का पता लगाने देती है।",
      "वेबसाइट शुरू में व्यक्तिगत उपयोग के लिए बनाई गई थी, लेकिन अब इसे जनता के लिए उपलब्ध कराया गया है, क्योंकि निर्माता का मानना है कि यह दूसरों के लिए रुचिकर हो सकता है।",
      "उपयोगकर्ता इस वेबसाइट के माध्यम से अतीत में विभिन्न तिथियों से हैकर समाचार पर सुर्खियों, चर्चाओं और गतिविधि का अनुभव कर सकते हैं।"
    ],
    "commentSummary": [
      "अगस्त 2009 में हैकर समाचार चर्चा धागा ब्राउज़िंग वरीयताओं, लिंक व्यवहार के साथ कुंठा, और वेब इतिहास सुविधाओं के मूल्य सहित विषयों की एक श्रृंखला को शामिल किया गया.",
      "उपयोगकर्ता वेबसाइट पर लिंक सड़ांध के साथ असंतोष व्यक्त करते हैं और एर्लांग के बारे में समाचारों की व्यापकता पर चर्चा करते हैं।",
      "अन्य चर्चाओं में स्टैनफोर्ड स्टार्ट-अप स्कूल, डेटा के लिए हैकर समाचार संग्रह का विश्लेषण और YouTube की लाभप्रदता शामिल है। लिनक्स और विंडोज पर फ़ायरफ़ॉक्स के साथ तकनीकी समस्याएं भी बताई गई हैं।"
    ],
    "points": 240,
    "commentCount": 74,
    "retryCount": 0,
    "time": 1707137787
  },
  {
    "id": 39260614,
    "title": "UUID v7: होम कमिटफेस्ट 2024-03 समीक्षा प्रक्रिया और अनुलग्नकों का सारांश",
    "originLink": "https://commitfest.postgresql.org/47/4388/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39260614",
    "commentBody": "",
    "originSummary": [
      "2024-03 के लिए होम कमिटफेस्ट को इस सारांश में प्रलेखित किया गया है, जो समीक्षा प्रक्रिया और विभिन्न विषयों के लिए की गई प्रगति में अंतर्दृष्टि प्रदान करता है।",
      "UUID v7 विषय पर लेखकों, समीक्षकों और समीक्षा प्रक्रिया की वर्तमान स्थिति सहित चर्चा की जाती है।",
      "UUID v7 विषय से संबंधित अनुलग्नक और टिप्पणियाँ भी सारांश में शामिल हैं।"
    ],
    "commentSummary": [
      "बहस PostgreSQL डेटाबेस में UUIDs का उपयोग करने के फायदे और नुकसान के आसपास केंद्रित है।",
      "कुछ का तर्क है कि अधिकांश अनुप्रयोगों के लिए यूयूआईडी अनावश्यक हैं, जबकि अन्य मानते हैं कि वे स्केलेबिलिटी और प्रदर्शन को बढ़ाते हैं।",
      "चर्चाओं में यूयूआईडी के कार्यान्वयन, संस्करण, गोपनीयता संबंधी चिंताएं और सुरक्षा निहितार्थ के साथ-साथ छँटाई, विभाजन और डेटाबेस प्रदर्शन पर उनके प्रभाव को भी शामिल किया गया है।"
    ],
    "points": 219,
    "commentCount": 171,
    "retryCount": 0,
    "time": 1707136750
  },
  {
    "id": 39268106,
    "title": "वैज्ञानिकों ने तूफान स्केल में श्रेणी 6 जोड़ने का प्रस्ताव दिया",
    "originLink": "https://eos.org/articles/weve-already-seen-category-6-hurricanes-now-scientists-want-to-make-it-official",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39268106",
    "commentBody": "",
    "originSummary": [
      "एक हालिया अध्ययन में सैफिर-सिम्पसन तूफान विंड स्केल में एक नई श्रेणी, श्रेणी 6 को शामिल करने का प्रस्ताव है।",
      "यह नई श्रेणी जलवायु परिवर्तन के कारण उष्णकटिबंधीय चक्रवातों की तीव्र शक्ति और विनाशकारी क्षमताओं को संबोधित करेगी।",
      "अध्ययन ने श्रेणी 6 की आवश्यकता का समर्थन करने के लिए पिछले तूफानों, अधिकतम संभावित तीव्रता के विश्लेषण और जलवायु परिवर्तन मॉडल के डेटा का उपयोग किया।",
      "इस श्रेणी के अलावा जलवायु परिवर्तन से जुड़े जोखिमों का अधिक सटीक प्रतिनिधित्व प्रदान करेगा और जनता को तूफान से संबंधित जोखिमों को संप्रेषित करने पर बातचीत को प्रोत्साहित करेगा।"
    ],
    "commentSummary": [
      "वैज्ञानिकों ने बढ़ती तीव्रता के कारण एक नए तूफान श्रेणी 6 को जोड़ने का प्रस्ताव दिया है, लेकिन संशयवादी अनुसंधान पद्धति और डेटा हेरफेर की आलोचना करते हैं।",
      "वैज्ञानिक अनुसंधान में विश्वसनीय और सुसंगत डेटा महत्वपूर्ण है, खासकर जलवायु परिवर्तन जैसे राजनीतिक रूप से संवेदनशील विषयों के लिए।",
      "हवा की गति के आधार पर वर्तमान वर्गीकरण प्रणाली तूफान की लहरों और बाढ़ से संभावित नुकसान को व्यक्त करने में विफल हो सकती है, जो बेहतर रेटिंग सिस्टम की आवश्यकता पर प्रकाश डालती है जो बुनियादी ढांचे, तूफान की वृद्धि और बाढ़ के जोखिम जैसे कारकों पर विचार करती है।"
    ],
    "points": 186,
    "commentCount": 82,
    "retryCount": 0,
    "time": 1707172028
  }
]
