[
  {
    "id": 39132453,
    "title": "Apple introduceert wijzigingen in iOS, Safari en App Store in EU om te voldoen aan de wet op de digitale markten",
    "originLink": "https://www.apple.com/newsroom/2024/01/apple-announces-changes-to-ios-safari-and-the-app-store-in-the-european-union/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39132453",
    "commentBody": "",
    "originSummary": [
      "Apple heeft updates onthuld voor zijn iOS, Safari en App Store om deze aan te passen aan de Digital Markets Act in de EU.",
      "De updates omvatten verbeterde opties voor app-distributie en betalingsverwerking voor ontwikkelaars en verbeterde controles en openbaarmakingen voor gebruikers.",
      "De wijzigingen worden vanaf maart 2024 uitgerold naar gebruikers in de EU en ontwikkelaars kunnen de nieuwe functies verkennen en testen in de iOS 17.4 bèta. Apple zal hulpmiddelen aanbieden om EU-gebruikers te helpen de wijzigingen te begrijpen en zich eraan aan te passen."
    ],
    "commentSummary": [
      "De discussie draait om het feit dat Apple mogelijk de anti-omzeilingsbepalingen in de EU-wet op de digitale markten schendt door wijzigingen aan te brengen in iOS, Safari en de App Store.",
      "Er is discussie over de vraag of Apple angst tactieken gebruikt om zijn App Store monopolie te behouden of dat er legitieme zorgen zijn over de veiligheid.",
      "De discussie gaat over kritiek op de acties van Apple, waaronder het scannen van foto's en de reactie op de EU-regelgeving, en zorgen over beperkingen en restricties in de Apple app store."
    ],
    "points": 1699,
    "commentCount": 2023,
    "retryCount": 0,
    "time": 1706205806
  },
  {
    "id": 39128902,
    "title": "Schaakstukken herontworpen als geometrische aanvalsrichtingen",
    "originLink": "https://twitter.com/graycrawford/status/1750225562281632048",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39128902",
    "commentBody": "",
    "originSummary": [
      "Een Twitter-gebruiker heeft een manier gevonden om schaakstukken te herontwerpen door geometrische vormen te gebruiken om aanvalsrichtingen weer te geven.",
      "Deze ontdekking biedt een frisse en creatieve kijk op het traditionele ontwerp van schaakstukken.",
      "Door puur geometrische vormen te gebruiken, bieden de nieuwe schaakstukken een visueel interessante en intuïtieve manier om aanvalsrichtingen te begrijpen."
    ],
    "commentSummary": [
      "De discussies gaan over verschillende aspecten van schaken, zoals alternatieve ontwerpen voor schaakstukken, verschillende bewegingen voor het paard, de invloed van visuele hulpmiddelen op het leren van het spel, de betekenis van verschillende stukken en de mogelijkheid om nieuwe schaakvarianten te creëren.",
      "Deelnemers geven hun mening, stellen verbeteringen voor en analyseren de voor- en nadelen van verschillende concepten.",
      "Dit is een boeiend en gezamenlijk forum voor schaakliefhebbers om ideeën voor het verbeteren van het spel te verkennen en uit te wisselen."
    ],
    "points": 592,
    "commentCount": 192,
    "retryCount": 0,
    "time": 1706186184
  },
  {
    "id": 39134349,
    "title": "Missie van Ingenuity Mars helikopter eindigt door bladschade",
    "originLink": "https://www.nasa.gov/news-release/after-three-years-on-mars-nasas-ingenuity-helicopter-mission-ends/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39134349",
    "commentBody": "",
    "originSummary": [
      "NASA's Ingenuity Mars Helicopter heeft zijn missie succesvol afgerond nadat het zijn oorspronkelijke doel van vijf vluchten in 30 dagen had overtroffen door 72 vluchten te voltooien in bijna drie jaar.",
      "De helikopter heeft tijdens de laatste landing schade opgelopen aan de rotorbladen en kan niet meer vliegen.",
      "Ingenuity diende als technologiedemonstratie en luchtverkenner voor NASA's Perseverance rover en liet zien dat een aangedreven en gecontroleerde vlucht op Mars mogelijk is ondanks uitdagingen zoals stroomproblemen tijdens de Martiaanse winter. Het Ingenuity-team zal nu de laatste tests uitvoeren en de resterende gegevens downloaden om de missie officieel af te sluiten."
    ],
    "commentSummary": [
      "De Marshelikopter Ingenuity heeft schade opgelopen aan zijn rotorbladen en zal niet meer kunnen vliegen. Dit betekent het einde van zijn driejarige project na meer dan 70 vluchten.",
      "Ondanks deze tegenslag heeft Ingenuity de weg geëffend voor toekomstige Mars rotorcraft missies en is geprezen voor zijn innovatie en de waardevolle gegevens die het heeft opgeleverd.",
      "De discussies gaan over verschillende onderwerpen met betrekking tot ruimteverkenning, zoals de nauwkeurigheid van stofstormen op Mars, de duurzaamheid van monsterbuizen die op Mars zijn verzameld, het gebruik van geavanceerde technologie door NASA en het eigendom van het maangebied. Er wordt ook gedebatteerd over de ethische overwegingen om een menselijke kolonie op Mars te vestigen en over de mogelijkheden voor een service- of reparatiestation op de planeet."
    ],
    "points": 437,
    "commentCount": 174,
    "retryCount": 0,
    "time": 1706212689
  },
  {
    "id": 39129155,
    "title": "Faircamp: Een gratis en aanpasbaar alternatief platform voor muzikanten na de verkoop van Bandcamp",
    "originLink": "https://wedistribute.org/2023/11/introducing-faircamp/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39129155",
    "commentBody": "",
    "originSummary": [
      "Faircamp is een gratis alternatief platform voor muzikanten na de overname van Bandcamp door Songtradr.",
      "Het is een statische sitegenerator die muzikanten zelf kunnen hosten, met aanpassings- en betalingsopties voor albums en nummers.",
      "Faircamp heeft positieve feedback ontvangen van de muziekgemeenschap, met een aantal artiesten die de infrastructuur van RadioFreeFedi gebruiken om hun eigen Faircamp sites te hosten, waardoor het een veelbelovend alternatief is voor het ondersteunen van muzikanten in de Fediverse."
    ],
    "commentSummary": [
      "De discussie draait om verschillende aspecten van Bandcamp, zoals de sterke punten, de kenmerken van de gemeenschap en de culturele impact.",
      "Gebruikers geven hun mening over de overname van het platform door Epic Games, het belang van het ondersteunen van artiesten en alternatieve platforms voor het hosten en verkopen van muziek.",
      "Onderwerpen als betalingssystemen, inhoudsbeperkingen, vindbaarheid, eigendom, betrouwbaarheid en de invloed van bedrijven op online platforms komen ook aan bod, waarbij de nadruk ligt op het belang van een gemeenschap, curatie en het ondersteunen van onafhankelijke muzikanten."
    ],
    "points": 335,
    "commentCount": 169,
    "retryCount": 0,
    "time": 1706187882
  },
  {
    "id": 39129949,
    "title": "Microsoft schrapt 1.900 werknemers bij Activision Blizzard en Xbox",
    "originLink": "https://www.theverge.com/2024/1/25/24049050/microsoft-activision-blizzard-layoffs",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39129949",
    "commentBody": "",
    "originSummary": [
      "Microsoft schrapt 1.900 banen, ongeveer 8% van zijn gamedivisie, waaronder werknemers bij Activision Blizzard en Xbox, na de recente overname van Activision Blizzard.",
      "De ontslagen zullen gevolgen hebben voor Xbox- en ZeniMax-werknemers en Blizzard-president Mike Ybarra zal het bedrijf verlaten.",
      "Het schrappen van projecten, waaronder Blizzards overlevingsspel, maakt ook deel uit van de herstructurering. Andere gamebedrijven zijn ook bezig met soortgelijke bezuinigingen."
    ],
    "commentSummary": [
      "De discussie gaat over verschillende onderwerpen zoals ontslagen, werkloosheidsuitdagingen, het starten van een bedrijf en de effecten van overnames op bedrijven en werknemers.",
      "Ze praten ook over de game-industrie, de neergang van bepaalde bedrijven en de rol van AI in creatieve werken.",
      "Er wordt gediscussieerd over specifieke games, kwaliteitsproblemen, winstbejag in de game-industrie en de mogelijke toepassingen en implicaties van AI-technologie."
    ],
    "points": 323,
    "commentCount": 293,
    "retryCount": 0,
    "time": 1706193161
  },
  {
    "id": 39132300,
    "title": "Out-of-Bounds schrijfbeveiliging verholpen in rhboot / shim-software",
    "originLink": "https://github.com/rhboot/shim/commit/0226b56513b2b8bd5fd281bce77c40c9bf07c66d",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39132300",
    "commentBody": "",
    "originSummary": [
      "De samenvatting behandelt een codeprobleem in het softwareproject rhboot / shim.",
      "Het probleem ontstaat door onjuist vertrouwen in HTTP-headers tijdens het ophalen van bestanden, wat resulteert in een kwetsbaarheid voor out-of-bounds write.",
      "Er is een patch geïmplementeerd om te voorkomen dat de buffer de toegewezen grootte overschrijdt, waardoor de kwetsbaarheid is verholpen.",
      "Het probleem werd ontdekt door Bill Demirkapi van het Microsoft Security Response Center."
    ],
    "commentSummary": [
      "Er is een kritieke kwetsbaarheid (CVE-2023-40547) ontdekt in de shim EFI bootloader die door Linux distro's wordt gebruikt voor Secure Boot.",
      "Aanvallers kunnen de bug lokaal, vanaf een aangrenzend netwerk of op afstand via HTTP boot gebruiken om Secure Boot te omzeilen en ongeautoriseerde toegang te krijgen.",
      "Deze kwetsbaarheid heeft discussies aangewakkerd over de beperkingen van Secure Boot, de implementatie ervan door Microsoft, de compatibiliteit van de GPLv3 licentie, het gebruik van encryptie en handtekeningen en de potentiële risico's van HTTP boot. De bug legt beveiligingsproblemen bloot en doet vragen rijzen over de doeltreffendheid van Secure Boot."
    ],
    "points": 224,
    "commentCount": 96,
    "retryCount": 0,
    "time": 1706204954
  },
  {
    "id": 39138042,
    "title": "Gemakkelijk toegankelijke elektronische publicaties voor elk apparaat",
    "originLink": "https://willcrichton.net/notes/portable-epubs/#epub-content%2FEPUB%2Findex.xhtml$",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39138042",
    "commentBody": "",
    "originSummary": [
      "Draagbare EPUB's zijn elektronische publicaties die zijn ontworpen om gemakkelijk toegankelijk en draagbaar te zijn op verschillende apparaten.",
      "EPUB's zijn een veelgebruikte indeling voor digitale boeken en geschreven inhoud vanwege hun compatibiliteit met verschillende apparaten.",
      "EPUB's bieden functies zoals reflowable tekst en aanpasbare lettergroottes, wat de leeservaring voor gebruikers verbetert."
    ],
    "commentSummary": [
      "Het artikel onderzoekt de uitdagingen en beperkingen van EPUB- en PDF-indelingen en stelt mogelijke verbeteringen en alternatieven voor.",
      "Ideeën om de opmaak en weergave van EPUB te verbeteren zijn onder andere het verbeteren van typografietools en het vooraf berekenen van regeleinden.",
      "Er is bezorgdheid over het feit dat EPUB-lezers bepaalde functies niet ondersteunen en afhankelijk zijn van JavaScript, terwijl PDF de voorkeur geniet voor technische documentatie, ondanks de nadelen."
    ],
    "points": 219,
    "commentCount": 60,
    "retryCount": 0,
    "time": 1706233991
  },
  {
    "id": 39132901,
    "title": "OpenAI introduceert nieuwe inbedmodellen en API-updates",
    "originLink": "https://openai.com/blog/new-embedding-models-and-api-updates",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39132901",
    "commentBody": "",
    "originSummary": [
      "OpenAI heeft nieuwe embeddingmodellen gelanceerd, waaronder kleinere en grotere versies, en updates gemaakt voor de GPT-4 Turbo en GPT-3.5 Turbo modellen.",
      "De nieuwe modellen bieden verbeterde prestaties en een lagere prijs.",
      "OpenAI heeft verbeterd API-sleutelbeheer en inzicht in het gebruik geïntroduceerd, waardoor ontwikkelaars permissies kunnen toewijzen en het gebruik op sleutelniveau kunnen volgen. Ze hebben ook een bijgewerkt moderatiemodel uitgebracht voor het identificeren van schadelijke tekst."
    ],
    "commentSummary": [
      "OpenAI heeft nieuwe inbeddingsmodellen en API-updates uitgebracht, waardoor direct vanuit de API dimensiereductie mogelijk is.",
      "Gebruikers discussiëren over de prestaties van OpenAI's GPT-4 en GPT-4 Turbo modellen, waarbij enkele zorgen worden geuit over de kwaliteit van bepaalde tekstinbeddingen.",
      "De impact van dimensionaliteitsreductie op latentie en de uitdagingen van het wisselen tussen verschillende inbeddingsets worden ook besproken.",
      "Werknemers maken zich zorgen over de verplaatsing van hun baan en de mogelijke gevolgen daarvan voor de kwaliteit van de gegevens.",
      "De betaalbaarheid van OpenAI's nieuwe embeddingsmodel wordt belicht, samen met vergelijkingen met open-source modellen en discussies over concurrentie en prijzen in de AI-as-a-Service industrie.",
      "Er worden suggesties gedaan om het probleem van \"luiheid\" in de modellen aan te pakken.",
      "Moderatieacties worden ondernomen tegen gebruikers die de richtlijnen voor gevoelige discussies overtreden."
    ],
    "points": 206,
    "commentCount": 75,
    "retryCount": 0,
    "time": 1706207585
  },
  {
    "id": 39128977,
    "title": "Japanse precisie-maanlander raakt doel maar landt ondersteboven",
    "originLink": "https://phys.org/news/2024-01-japan-craft-successful-pin-moon.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39128977",
    "commentBody": "",
    "originSummary": [
      "De Japanse maanmissie SLIM landde met succes op het maanoppervlak, maar ondersteboven, met de zonnebatterijen in de verkeerde richting en niet in staat om energie op te wekken.",
      "Er is hoop dat de sonde kan opladen als de maan eenmaal overdag is.",
      "Deze missie markeert de intrede van Japan als vijfde land dat de maan heeft bereikt en wordt beschouwd als een belangrijke prestatie voor de Japanse ruimtevaarttechnologie."
    ],
    "commentSummary": [
      "De maanlander van Japan, de SLIM, is met succes op de maan geland maar lijkt ondersteboven te staan, wat zorgen en discussies oproept over de landingsprocedure en mogelijke faalwijzen.",
      "De lander liet twee rovers los die beelden terugstuurden naar de aarde, waarmee de mogelijkheid voor precisieverkenning werd aangetoond.",
      "Ondanks het landingsongeluk wordt de missie als baanbrekend beschouwd en baant ze de weg voor toekomstige missies, terwijl ze ook de aanzet gaf tot discussies over eerdere missies en de uitdagingen waar het Japanse ruimteagentschap voor staat."
    ],
    "points": 202,
    "commentCount": 141,
    "retryCount": 0,
    "time": 1706186754
  },
  {
    "id": 39129806,
    "title": "Trail of Bits en Python Cryptographic Authority geven X.509 Path Validation Algorithm Implementation uit voor Python-ontwikkelaars",
    "originLink": "https://blog.trailofbits.com/2024/01/25/we-build-x-509-chains-so-you-dont-have-to/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39129806",
    "commentBody": "",
    "originSummary": [
      "Trail of Bits en de Python Cryptographic Authority hebben cryptography-x509-verification ontwikkeld, een snelle en geheugenveilige implementatie van het X.509-padvalidatiealgoritme in Rust.",
      "Deze implementatie biedt een alternatief voor OpenSSL's X.509 API's voor certificaatverificatie in protocollen zoals TLS en is geïntegreerd in Cryptography's releaseserie voor gebruik door Python-ontwikkelaars.",
      "Trail of Bits heeft ook x509-limbo gecreëerd, een testvector en harness suite ontworpen om de conformiteit en het gedrag van verschillende X.509 padvalidatie implementaties te evalueren, met als doel de veiligheid van het Python ecosysteem te verbeteren en bij te dragen aan de open-source gemeenschap."
    ],
    "commentSummary": [
      "Het artikel bespreekt de ontwikkeling van X.509 ketens en het belang van goed ontwikkelde testsuites.",
      "Het onderzoekt de potentiële voordelen en uitdagingen van het gebruik van Rust in internetbeveiliging, met name in het voorkomen van denial-of-service-aanvallen.",
      "De implementatie van uitwisselbare Prolog-programma's als beleid in de pyca/cryptografie-bibliotheek wordt besproken, samen met de uitdagingen en beperkingen van certificaatintrekking.",
      "Mozilla's CRLite-oplossing en het gebruik van kortlopende certificaten worden genoemd als mogelijke alternatieven voor intrekking.",
      "Het gesprek gaat over verschillende onderwerpen, waaronder de implementatie van dynamische beperkingen, de 'webpki' crate, alternatieven voor X.509 certificaten en de interoperabiliteit van het Python ecosysteem met C."
    ],
    "points": 201,
    "commentCount": 79,
    "retryCount": 0,
    "time": 1706192428
  },
  {
    "id": 39133086,
    "title": "Onderzoek naar HPV-vaccin vindt geen gevallen van baarmoederhalskanker bij volledig gevaccineerde vrouwen jonger dan 14 jaar",
    "originLink": "https://www.statnews.com/2024/01/25/hpv-vaccine-prevent-cervical-cancer-cervarix-gardasil-study/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39133086",
    "commentBody": "",
    "originSummary": [
      "Een recent onderzoek in Schotland heeft aangetoond dat vrouwen die tussen 1988-1996 geboren zijn en op 12-13-jarige leeftijd volledig gevaccineerd waren tegen HPV, nul gevallen van baarmoederhalskanker hadden.",
      "Dit is het eerste nationale onderzoek dat een groep vrouwen over een lange periode volgt en geen gevallen van baarmoederhalskanker vindt, wat de effectiviteit van het HPV-vaccin aantoont.",
      "Het onderzoek benadrukt het belang van tijdige vaccinatie en suggereert dat zelfs het krijgen van het vaccin tussen de 14-22 jaar het risico op baarmoederhalskanker nog steeds aanzienlijk vermindert. Het is echter belangrijk op te merken dat andere HPV-stammen die niet door het vaccin worden gedekt nog steeds baarmoederhalskanker kunnen veroorzaken. Voortdurende screening voor vroegtijdige opsporing is cruciaal."
    ],
    "commentSummary": [
      "Het HPV-vaccin is effectief in het voorkomen van baarmoederhalskanker en andere HPV-gerelateerde ziekten.",
      "Er zijn problemen met de kosten en het gebrek aan verzekeringsdekking voor het vaccin.",
      "Er is discussie over de werkzaamheid van het vaccin voor personen boven de 45 jaar."
    ],
    "points": 199,
    "commentCount": 117,
    "retryCount": 0,
    "time": 1706208192
  },
  {
    "id": 39130711,
    "title": "Windows NT Sync Driver voorgesteld voor grote prestatieverbeteringen in Linux Gaming",
    "originLink": "https://www.gamingonlinux.com/2024/01/proposed-windows-nt-sync-driver-brings-big-wine-proton-performance-improvements/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39130711",
    "commentBody": "",
    "originSummary": [
      "Zeb Figura van CodeWeavers heeft een Windows NT synchronisatie primitief stuurprogramma voorgesteld om de prestaties te verbeteren van het draaien van Windows programma's en spellen op Linux met Wine/Proton.",
      "Het voorgestelde stuurprogramma zou de NT synchronisatieprimitieven direct implementeren in de Linux kernel, waardoor RPC niet meer nodig is en de prestaties verbeteren.",
      "De eerste tests laten veelbelovende prestatieverbeteringen zien in verschillende games, hoewel de specifieke verbeteringen kunnen variëren afhankelijk van de hardware- en software-instellingen.",
      "Als het stuurprogramma wordt goedgekeurd en geïmplementeerd, zou het de gameprestaties op Linux aanzienlijk kunnen verbeteren, inclusief op het aankomende Steam Deck met Wine en Proton."
    ],
    "commentSummary": [
      "Het artikel onderzoekt manieren om de prestaties van games op Linux te verbeteren, zoals voorgestelde Windows NT sync drivers, het integreren van OpenVZ in de Linux kernel en het implementeren van syscalls voor verbeterde compatibiliteit met Windows software.",
      "Verschillende GPU-opties worden besproken, samen met frustraties over propriëtaire stuurprogramma's en ervaringen met AMD GPU's op Linux.",
      "In het commentaargedeelte wordt ingegaan op de mogelijkheid om problemen op te lossen met het draaien van Windows software op Linux platforms en worden zorgen geuit over beveiliging en anti-cheatsystemen in gaming."
    ],
    "points": 199,
    "commentCount": 58,
    "retryCount": 0,
    "time": 1706197359
  },
  {
    "id": 39130945,
    "title": "Het verkennen van de variaties van Merkle CRDTs: DAG's en zoekbomen",
    "originLink": "https://interjectedfuture.com/crdts-turned-inside-out/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39130945",
    "commentBody": "",
    "originSummary": [
      "Het artikel onderzoekt twee soorten Merkle Conflictvrije Gerepliceerde Datatypes (CRDT's): Merkle-DAG CRDTs en Merkle Search Tree CRDTs.",
      "Merkle-DAG CRDT's gebruiken een gerichte acyclische grafiek om gelijktijdige updates op te slaan en de synchronisatiebandbreedte tussen replicas te minimaliseren.",
      "Merkle Search Tree CRDTs onderhouden een geordende set sleutels in een zelfbalancerende en unieke boomstructuur. Het artikel bespreekt ook de overeenkomsten tussen Merkle CRDTs en Git en het potentieel voor het implementeren van samenstelbare CRDTs."
    ],
    "commentSummary": [
      "Conflictvrij gerepliceerde datatypes (CRDT's) worden gebruikt en geïmplementeerd in gedecentraliseerde sociale netwerken en samenwerkingsapplicaties.",
      "Het Merkle Search Tree (MST) ontwerp wint aan erkenning en adoptie, met onafhankelijke implementaties in Go en Rust.",
      "Het artikel bespreekt de zelfbalancerende eigenschap van MST's, hun gebruik in AT Protocol's gegevensopslagstructuren en de optimalisatie van de Merkle DAG gegevensstructuur in Dolt."
    ],
    "points": 176,
    "commentCount": 28,
    "retryCount": 0,
    "time": 1706198452
  },
  {
    "id": 39129274,
    "title": "EFF en 110 NGO's waarschuwen dat VN-verdrag tegen cybercriminaliteit mensenrechten en privacy bedreigt",
    "originLink": "https://www.eff.org/deeplinks/2024/01/eff-and-more-100-ngos-set-non-negotiable-redlines-ahead-un-cybercrime-treaty",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39129274",
    "commentBody": "",
    "originSummary": [
      "De Electronic Frontier Foundation (EFF) heeft samen met 110 NGO's hun zorgen geuit over het ontwerp van het VN-verdrag inzake cybercriminaliteit.",
      "Ze zijn van mening dat de huidige versie van het verdrag onvoldoende bescherming biedt voor mensenrechten en is veranderd in een instrument voor surveillance.",
      "De EFF roept staten op om het verdrag te verwerpen tenzij er belangrijke wijzigingen worden aangebracht en zal aanwezig zijn bij de afsluitende sessie van 29 januari tot 10 februari."
    ],
    "commentSummary": [
      "Het voorgestelde VN-verdrag tegen cybercriminaliteit wordt als ontoereikend beschouwd om cybercriminaliteit aan te pakken vanwege de beperkingen op het gebied van jurisdictie en het gebrek aan toegang tot criminelen.",
      "Het opleggen van boetes en sancties aan landen die verantwoordelijk zijn voor cybercriminaliteit wordt voorgesteld, maar kan te maken krijgen met geopolitieke uitdagingen en publieke afkeuring.",
      "Het stoppen van cybercriminaliteit in derdewereldlanden is moeilijk vanwege financiële motieven en de complexiteit van het traceren van geld en datapakketten."
    ],
    "points": 166,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1706188867
  }
]
