[
  {
    "id": 39132453,
    "title": "Apple מציגה שינויים ב-iOS, Safari ו-App Store באיחוד האירופי כדי לציית לחוק השווקים הדיגיטליים",
    "originLink": "https://www.apple.com/newsroom/2024/01/apple-announces-changes-to-ios-safari-and-the-app-store-in-the-european-union/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39132453",
    "commentBody": "",
    "originSummary": [
      "אפל חשפה עדכונים ל-iOS, ספארי וחנות האפליקציות שלה כדי ליישר קו עם חוק השווקים הדיגיטליים באיחוד האירופי.",
      "העדכונים כוללים אפשרויות משופרות להפצת אפליקציות ועיבוד תשלומים עבור מפתחים ובקרות וחשיפות משופרות עבור משתמשים.",
      "השינויים יושקו למשתמשים באיחוד האירופי החל ממרץ 2024, ומפתחים יוכלו לחקור ולבדוק את התכונות החדשות בגרסת הבטא של iOS 17.4. אפל תציע משאבים שיסייעו למשתמשים באיחוד האירופי להבין ולהסתגל לשינויים."
    ],
    "commentSummary": [
      "הדיון סובב סביב האפשרות שאפל תפר באופן פוטנציאלי הוראות נגד עקיפה בחוק השווקים הדיגיטליים של האיחוד האירופי עם שינויים ב-iOS, ספארי וחנות האפליקציות שלה.",
      "יש ויכוח האם אפל משתמשת בטקטיקות פחד כדי לשמור על המונופול שלה בחנות האפליקציות או אם יש חששות אבטחה לגיטימיים.",
      "הדיון בוחן ביקורת על פעולותיה של אפל, כולל סריקת תמונות ותגובתה לתקנות האיחוד האירופי, וחששות לגבי מגבלות והגבלות בחנות האפליקציות של אפל."
    ],
    "points": 1699,
    "commentCount": 2023,
    "retryCount": 0,
    "time": 1706205806
  },
  {
    "id": 39128902,
    "title": "כלי שחמט שעוצבו מחדש ככיווני התקפה גיאומטריים",
    "originLink": "https://twitter.com/graycrawford/status/1750225562281632048",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39128902",
    "commentBody": "",
    "originSummary": [
      "משתמש טוויטר מצא דרך לעצב מחדש כלי שחמט באמצעות צורות גיאומטריות כדי לייצג כיווני תקיפה.",
      "תגלית זו מציעה מבט רענן ויצירתי על העיצוב המסורתי של כלי שחמט.",
      "על ידי שימוש בצורות גיאומטריות גרידא, כלי השחמט החדשים מספקים דרך מעניינת ויזואלית ואינטואיטיבית להבין את כיווני ההתקפה."
    ],
    "commentSummary": [
      "הדיונים מתמקדים בהיבטים שונים של השחמט, כגון עיצובים חלופיים לכלי שחמט, תנועות שונות לאביר, השפעת עזרים חזותיים על לימוד המשחק, משמעותם של חלקים שונים והאפשרות ליצור גרסאות שחמט חדשות.",
      "המשתתפים מביעים את דעתם, מציעים שיפורים ומנתחים את היתרונות והחסרונות של מושגים שונים.",
      "זהו פורום מרתק ושיתופי עבור חובבי שחמט לחקור ולהחליף רעיונות לשיפור המשחק."
    ],
    "points": 592,
    "commentCount": 192,
    "retryCount": 0,
    "time": 1706186184
  },
  {
    "id": 39134349,
    "title": "משימתו של מסוק מאדים מסתיימת עקב נזק ללהב",
    "originLink": "https://www.nasa.gov/news-release/after-three-years-on-mars-nasas-ingenuity-helicopter-mission-ends/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39134349",
    "commentBody": "",
    "originSummary": [
      "מסוק המאדים Ingenuity Mars של נאס\"א סיים בהצלחה את משימתו לאחר שעבר את היעד המקורי של חמש טיסות ב-30 יום על ידי השלמת 72 טיסות במשך כמעט שלוש שנים.",
      "המסוק ספג נזק ללהבי הרוטור שלו במהלך נחיתתו האחרונה ואינו מסוגל עוד לטוס.",
      "Ingenuity שימש כהדגמת טכנולוגיה וכסיירת אווירית עבור רכב החלל Perseverance של נאס\"א, והראה כי טיסה ממונעת ומבוקרת על מאדים אפשרית למרות אתגרים כמו בעיות כוח במהלך החורף במאדים. צוות Ingenuity יערוך כעת בדיקות סופיות ויוריד את הנתונים שנותרו כדי לסיים את המשימה באופן רשמי."
    ],
    "commentSummary": [
      "מסוק המאדים Ingenuity ספג נזק ללהבי הרוטור שלו ולא יוכל לטוס שוב, מה שמסמן את סיום הפרויקט בן שלוש השנים שלו לאחר יותר מ-70 טיסות.",
      "למרות עיכוב זה, Ingenuity סללה את הדרך למשימות עתידיות של חלליות מאדים וזכתה לשבחים על חדשנותה והנתונים יקרי הערך שהיא סיפקה.",
      "הדיונים נסובים סביב נושאים שונים הקשורים לחקר החלל, כגון דיוק סופות אבק על מאדים, עמידות צינורות הדגימה שנאספו על מאדים, השימוש של נאס\"א בטכנולוגיה מתקדמת והבעלות על שטח הירח. ישנם גם ויכוחים על השיקולים האתיים של הקמת מושבה אנושית על מאדים והפוטנציאל לתחנת שירות או תיקון על פני כדור הארץ."
    ],
    "points": 437,
    "commentCount": 174,
    "retryCount": 0,
    "time": 1706212689
  },
  {
    "id": 39129155,
    "title": "Faircamp: פלטפורמה אלטרנטיבית חינמית וניתנת להתאמה אישית למוזיקאים לאחר מכירת Bandcamp",
    "originLink": "https://wedistribute.org/2023/11/introducing-faircamp/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39129155",
    "commentBody": "",
    "originSummary": [
      "Faircamp היא פלטפורמה אלטרנטיבית חינמית למוזיקאים בעקבות רכישת Bandcamp על ידי Songtradr.",
      "זהו מחולל אתרים סטטי שמוזיקאים יכולים לארח בעצמם, ומספק אפשרויות התאמה אישית ותשלום עבור אלבומים ורצועות.",
      "פיירקאמפ קיבל משוב חיובי מקהילת המוזיקה, כאשר חלק מהאמנים השתמשו בתשתית של RadioFreeFedi כדי לארח אתרי פיירקאמפ משלהם, מה שהופך אותו לאלטרנטיבה מבטיחה לתמיכה במוזיקאים ב-Fediverse."
    ],
    "commentSummary": [
      "הדיון סובב סביב מספר היבטים של Bandcamp, כגון נקודות החוזק שלה, תכונות הקהילה וההשפעה התרבותית שלה.",
      "משתמשים מביעים את דעתם על רכישת הפלטפורמה על ידי Epic Games, החשיבות של תמיכה באמנים, ופלטפורמות אלטרנטיביות לאירוח ומכירת מוזיקה.",
      "נושאים כמו מערכות תשלומים, הגבלות תוכן, יכולת גילוי, בעלות, אמינות והשפעת תאגידים על פלטפורמות מקוונות מכוסים גם הם, תוך הדגשת המשמעות של קהילה, אוצרות ותמיכה במוזיקאים עצמאיים."
    ],
    "points": 335,
    "commentCount": 169,
    "retryCount": 0,
    "time": 1706187882
  },
  {
    "id": 39129949,
    "title": "מיקרוסופט מקצצת 1,900 עובדים ב-Activision Blizzard וב-Xbox",
    "originLink": "https://www.theverge.com/2024/1/25/24049050/microsoft-activision-blizzard-layoffs",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39129949",
    "commentBody": "",
    "originSummary": [
      "מיקרוסופט מקצצת 1,900 משרות, כ-8% מחטיבת המשחקים שלה, כולל עובדים באקטיוויז'ן בליזארד ובאקסבוקס, בעקבות הרכישה האחרונה של אקטיוויז'ן בליזארד.",
      "הפיטורים ישפיעו על עובדי Xbox ו-ZeniMax, ונשיא בליזארד מייק איבארה יעזוב את החברה.",
      "ביטול פרויקטים, כולל משחק ההישרדות של בליזארד, הוא גם חלק מהארגון מחדש. גם חברות גיימינג אחרות מבצעות קיצוצים דומים."
    ],
    "commentSummary": [
      "הדיון נוגע בנושאים שונים כמו פיטורי עובדים, אתגרי אבטלה, פתיחת עסק והשפעות רכישות על חברות ועובדים.",
      "הם מדברים גם על תעשיית המשחקים, על שקיעתן של חברות מסוימות ועל תפקידה של הבינה המלאכותית ביצירות יצירתיות.",
      "ישנם דיונים לגבי משחקים ספציפיים, חששות איכות, פרקטיקות מונעות רווח בתעשיית המשחקים, והשימושים וההשלכות האפשריים של טכנולוגיית AI."
    ],
    "points": 323,
    "commentCount": 293,
    "retryCount": 0,
    "time": 1706193161
  },
  {
    "id": 39132300,
    "title": "פגיעות כתיבה מחוץ לטווח תוקנה בתוכנת rhboot / shim",
    "originLink": "https://github.com/rhboot/shim/commit/0226b56513b2b8bd5fd281bce77c40c9bf07c66d",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39132300",
    "commentBody": "",
    "originSummary": [
      "הסיכום מטפל בבעיית קוד בפרויקט התוכנה rhboot / shim.",
      "הבעיה נובעת מאמון שגוי בכותרות HTTP במהלך אחזור קבצים, וכתוצאה מכך פגיעות כתיבה מחוץ לתחום.",
      "תיקון יושם כדי למנוע מהמאגר לחרוג מהגודל שהוקצה, ובכך לפתור את הפגיעות.",
      "הבעיה התגלתה על-ידי ביל דמירקאפי ממרכז תגובת האבטחה של Microsoft."
    ],
    "commentSummary": [
      "פגיעות קריטית (CVE-2023-40547) התגלתה במנהל האתחול shim EFI המשמש את Linux distros עבור אתחול מאובטח.",
      "תוקפים יכולים לנצל את הבאג באופן מקומי, מרשת סמוכה, או מרחוק באמצעות אתחול HTTP כדי לעקוף אתחול מאובטח ולקבל גישה לא מורשית.",
      "פגיעות זו עוררה דיונים על מגבלות האתחול המאובטח, היישום של Microsoft אותו, תאימות רישיון GPLv3, השימוש בהצפנה ובחתימות והסיכונים הפוטנציאליים הקשורים לאתחול HTTP. הבאג חושף פגיעויות אבטחה ומעלה חששות לגבי היעילות של אתחול מאובטח."
    ],
    "points": 224,
    "commentCount": 96,
    "retryCount": 0,
    "time": 1706204954
  },
  {
    "id": 39138042,
    "title": "פרסומים אלקטרוניים נגישים בקלות לכל מכשיר",
    "originLink": "https://willcrichton.net/notes/portable-epubs/#epub-content%2FEPUB%2Findex.xhtml$",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39138042",
    "commentBody": "",
    "originSummary": [
      "EPUBs ניידים הם פרסומים אלקטרוניים שנועדו להיות נגישים וניידים בקלות במכשירים שונים.",
      "EPUBs הם פורמט נפוץ עבור ספרים דיגיטליים ותוכן כתוב בשל התאימות שלהם עם מכשירים שונים.",
      "EPUBs מציעים תכונות כגון טקסט הניתן להזרמה מחדש וגדלי גופנים הניתנים לכוונון, המשפרים את חוויית הקריאה עבור המשתמשים."
    ],
    "commentSummary": [
      "המאמר בוחן את האתגרים והמגבלות של תבניות EPUB ו-PDF ומציע שיפורים וחלופות אפשריים.",
      "רעיונות לשיפור הפריסה והעיבוד של EPUB כוללים שיפור כלי טיפוגרפיה וחישוב מראש של מעברי שורה.",
      "מועלים חששות לגבי חוסר התמיכה של קוראי EPUB בתכונות מסוימות והסתמכות על JavaScript, בעוד PDF מועדף לתיעוד טכני למרות חסרונותיו."
    ],
    "points": 219,
    "commentCount": 60,
    "retryCount": 0,
    "time": 1706233991
  },
  {
    "id": 39132901,
    "title": "OpenAI מציגה מודלי הטבעה חדשים ועדכוני API",
    "originLink": "https://openai.com/blog/new-embedding-models-and-api-updates",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39132901",
    "commentBody": "",
    "originSummary": [
      "OpenAI השיקה דגמי הטמעה חדשים, כולל גרסאות קטנות וגדולות יותר, וביצעה עדכונים לדגמי GPT-4 Turbo ו-GPT-3.5 Turbo.",
      "הדגמים החדשים מציעים ביצועים משופרים ותמחור מופחת.",
      "OpenAI הציגה ניהול מפתחות API משופרים והבנת שימוש, המאפשרים למפתחים להקצות הרשאות ולעקוב אחר השימוש ברמת המפתח. הם גם פרסמו מודל פיקוח מעודכן לזיהוי טקסט מזיק."
    ],
    "commentSummary": [
      "OpenAI פרסמה מודלים חדשים להטמעה ועדכוני API, המאפשרים הפחתת ממדיות ישירות מה-API.",
      "משתמשים דנים בביצועים של דגמי GPT-4 ו-GPT-4 Turbo של OpenAI, עם כמה חששות שהועלו לגבי האיכות של הטבעות טקסט מסוימות.",
      "כמו כן נדונה ההשפעה של הפחתת ממדיות על ההשהיה והאתגרים של מעבר בין קבוצות הטבעה שונות.",
      "עובדים מביעים חרדה מפני עקירת מקומות עבודה והשפעתה הפוטנציאלית על איכות הנתונים.",
      "המחיר הזול של מודל ההטבעה החדש של OpenAI מודגש, יחד עם השוואות למודלים של קוד פתוח ודיונים על תחרות ותמחור בתעשיית הבינה המלאכותית כשירות.",
      "מועלות הצעות לטיפול בסוגיית ה\"עצלות\" במודלים.",
      "ננקטות פעולות פיקוח נגד משתמשים המפרים הנחיות בדיונים רגישים."
    ],
    "points": 206,
    "commentCount": 75,
    "retryCount": 0,
    "time": 1706207585
  },
  {
    "id": 39128977,
    "title": "הנחתת המדויקת של יפן על הירח פוגעת במטרה אך נוחתת הפוכה",
    "originLink": "https://phys.org/news/2024-01-japan-craft-successful-pin-moon.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39128977",
    "commentBody": "",
    "originSummary": [
      "משימת הירח של יפן, SLIM, נחתה בהצלחה על פני הירח אך הפוכה, כאשר הסוללות הסולריות שלה פונות לכיוון הלא נכון ולא מסוגלות לייצר חשמל.",
      "יש תקווה שהגשושית תוכל להיטען מחדש ברגע שהירח ייכנס לשעות היום שלו.",
      "משימה זו מסמנת את כניסתה של יפן כמדינה החמישית שמגיעה לירח, ונחשבת להישג משמעותי עבור טכנולוגיית החלל של יפן."
    ],
    "commentSummary": [
      "הנחתת היפנית על הירח, SLIM, נחתה בהצלחה על הירח אך נראה כי היא הפוכה, מה שעורר חששות ודיונים לגבי הליך הנחיתה ומצבי כשל אפשריים.",
      "הנחתת שחררה שני רוברים ששידרו תמונות חזרה לכדור הארץ, והציגו את היכולת לחקור בצורה מדויקת.",
      "למרות התקלה בנחיתה, המשימה נחשבת לפורצת דרך וסוללת את הדרך למשימות עתידיות, תוך שהיא מעוררת דיונים על משימות קודמות ואתגרים שעמדו בפני סוכנות החלל היפנית."
    ],
    "points": 202,
    "commentCount": 141,
    "retryCount": 0,
    "time": 1706186754
  },
  {
    "id": 39129806,
    "title": "Trail of Bits ו- Python Cryptographic Authority משחררים יישום אלגוריתם אימות נתיב X.509 עבור מפתחי Python",
    "originLink": "https://blog.trailofbits.com/2024/01/25/we-build-x-509-chains-so-you-dont-have-to/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39129806",
    "commentBody": "",
    "originSummary": [
      "Trail of Bits ורשות ההצפנה Python פיתחו אימות קריפטוגרפיה-x509, יישום מהיר ובטוח לזיכרון של אלגוריתם אימות נתיב X.509 ברוסט.",
      "יישום זה מספק חלופה לממשקי API X.509 של OpenSSL לאימות אישורים בפרוטוקולים כמו TLS ושולב בסדרת הגרסאות של קריפטוגרפיה לשימוש מפתחי Python.",
      "Trail of Bits יצרה גם את x509-limbo, וקטור בדיקה וחבילת רתמות שנועדה להעריך את התאימות וההתנהגות של יישומי אימות נתיב X.509 שונים, במטרה לשפר את האבטחה של המערכת האקולוגית של Python ולתרום לקהילת הקוד הפתוח."
    ],
    "commentSummary": [
      "המאמר דן בפיתוח שרשראות X.509 ובחשיבותן של חבילות בדיקה מפותחות.",
      "הוא בוחן את היתרונות והאתגרים הפוטנציאליים של שימוש ב-Rust באבטחת אינטרנט, במיוחד במניעת התקפות מניעת שירות.",
      "יישום תוכניות פרולוג מתחלפות כמדיניות בספריית פיקה / קריפטוגרפיה נדון, יחד עם האתגרים והמגבלות של ביטול אישורים.",
      "פתרון CRLite של מוזילה והשימוש בתעודות קצרות מועד מוזכרים כחלופות אפשריות לביטול.",
      "השיחה עוסקת בנושאים שונים, כולל יישום אילוצים דינמיים, ארגז 'webpki', חלופות לתעודות X.509 ויכולת הפעולה ההדדית של האקוסיסטם של Python עם C."
    ],
    "points": 201,
    "commentCount": 79,
    "retryCount": 0,
    "time": 1706192428
  },
  {
    "id": 39133086,
    "title": "מחקר חיסון HPV מצא אפס מקרים של סרטן צוואר הרחם אצל נשים מחוסנות לחלוטין מתחת לגיל 14",
    "originLink": "https://www.statnews.com/2024/01/25/hpv-vaccine-prevent-cervical-cancer-cervarix-gardasil-study/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39133086",
    "commentBody": "",
    "originSummary": [
      "מחקר שנערך לאחרונה בסקוטלנד הראה כי נשים שנולדו בין השנים 1988-1996 וחוסנו באופן מלא נגד HPV בגילאי 12-13 היו אפס מקרים של סרטן צוואר הרחם.",
      "זהו המחקר הלאומי הראשון שעוקב אחר קבוצת נשים לאורך תקופה ארוכה ולא מצא מקרים של סרטן צוואר הרחם, מה שמדגים את יעילות החיסון נגד HPV.",
      "המחקר מדגיש את חשיבות החיסון בזמן ומצביע על כך שגם קבלת החיסון בין הגילאים 14-22 עדיין מפחיתה משמעותית את הסיכון לסרטן צוואר הרחם. עם זאת, חשוב לציין כי זנים אחרים של HPV שאינם מכוסים על ידי החיסון עדיין יכולים לגרום לסרטן צוואר הרחם. המשך הבדיקות לגילוי מוקדם הוא קריטי."
    ],
    "commentSummary": [
      "חיסון HPV יעיל במניעת סרטן צוואר הרחם ומחלות אחרות הקשורות ל- HPV.",
      "ישנן בעיות לגבי העלות והיעדר כיסוי ביטוחי לחיסון.",
      "יש ויכוח על יעילות החיסון לאנשים מעל גיל 45."
    ],
    "points": 199,
    "commentCount": 117,
    "retryCount": 0,
    "time": 1706208192
  },
  {
    "id": 39130711,
    "title": "מנהל התקן הסינכרון של Windows NT מוצע עבור שיפורי ביצועים משמעותיים במשחקי Linux",
    "originLink": "https://www.gamingonlinux.com/2024/01/proposed-windows-nt-sync-driver-brings-big-wine-proton-performance-improvements/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39130711",
    "commentBody": "",
    "originSummary": [
      "זב פיגורה מ-CodeWeavers הציע מנהל התקן פרימיטיבי לסינכרון Windows NT כדי לשפר את הביצועים של הפעלת אפליקציות ומשחקים של Windows ב-Linux באמצעות Wine/Proton.",
      "מנהל ההתקן המוצע יטמיע ישירות את פרימיטיבים של סנכרון NT בליבת לינוקס, ויבטל את הצורך ב-RPC וישפר את הביצועים.",
      "בדיקות ראשוניות הראו שיפורי ביצועים מבטיחים במשחקים שונים, אם כי הרווחים הספציפיים עשויים להשתנות בהתאם להגדרת החומרה והתוכנה.",
      "אם מנהל ההתקן יאושר וייושם, הוא יוכל לשפר משמעותית את ביצועי המשחקים בלינוקס, כולל ב-Steam Deck הקרוב עם Wine ו-Proton."
    ],
    "commentSummary": [
      "המאמר בוחן דרכים לשיפור ביצועי המשחקים בלינוקס, כגון מנהלי התקנים מוצעים לסינכרון Windows NT, שילוב OpenVZ בליבת לינוקס ויישום syscalls לשיפור התאימות לתוכנת Windows.",
      "אפשרויות GPU שונות נדונות, יחד עם תסכולים לגבי מנהלי התקנים קנייניים וחוויות עם מעבדים גרפיים של AMD בלינוקס.",
      "סעיף ההערות מתייחס לפוטנציאל לפתרון בעיות בהפעלת תוכנת Windows על פלטפורמות לינוקס ומעלה חששות לגבי אבטחה ומערכות נגד רמאות במשחקים."
    ],
    "points": 199,
    "commentCount": 58,
    "retryCount": 0,
    "time": 1706197359
  },
  {
    "id": 39130945,
    "title": "חקירת הווריאציות של Merkle CRDTs: DAGs ועצי חיפוש",
    "originLink": "https://interjectedfuture.com/crdts-turned-inside-out/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39130945",
    "commentBody": "",
    "originSummary": [
      "המאמר בוחן שני סוגים של סוגי נתונים משוכפלים ללא התנגשויות (CRDT): Merkle-DAG CRDT ו- Merkle Search Tree CRDT.",
      "Merkle-DAG CRDT משתמשים בגרף אציקלי מכוון כדי לאחסן עדכונים בו-זמניים ולמזער את רוחב הפס של הסינכרון בין עותקים משוכפלים.",
      "Merkle Search Tree CRDT שומרים על סט מסודר של מפתחות במבנה עץ ייחודי ומאזן. המאמר דן גם בדמיון בין Merkle CRDT ו-Git ובפוטנציאל ליישום CRDT הניתנים להרכבה."
    ],
    "commentSummary": [
      "סוגי נתונים משוכפלים ללא התנגשויות (CRDT) נמצאים בשימוש ומיושמים ברשתות חברתיות מבוזרות וביישומים שיתופיים.",
      "העיצוב של Merkle Search Tree (MST) זוכה להכרה ואימוץ, עם יישומים עצמאיים ב-Go וב-Rust.",
      "המאמר דן בתכונת האיזון העצמי של MSTs, השימוש בהם במבני מאגר הנתונים של פרוטוקול AT, והאופטימיזציה של מבנה הנתונים Merkle DAG ב- Dolt."
    ],
    "points": 176,
    "commentCount": 28,
    "retryCount": 0,
    "time": 1706198452
  },
  {
    "id": 39129274,
    "title": "EFF ו-110 ארגונים לא ממשלתיים מזהירים כי אמנת פשעי הסייבר של האו\"ם מאיימת על זכויות אדם ופרטיות",
    "originLink": "https://www.eff.org/deeplinks/2024/01/eff-and-more-100-ngos-set-non-negotiable-redlines-ahead-un-cybercrime-treaty",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39129274",
    "commentBody": "",
    "originSummary": [
      "קרן החזית האלקטרונית (EFF) שיתפה פעולה עם 110 ארגונים לא ממשלתיים כדי להביע את דאגתם מטיוטת אמנת פשעי הסייבר של האו\"ם.",
      "הם מאמינים כי הגרסה הנוכחית של האמנה נעדרת הגנה מספקת על זכויות האדם והפכה לכלי מעקב.",
      "ה-EFF קורא למדינות לדחות את האמנה אלא אם יבוצעו שינויים משמעותיים ויהיה נוכח במושב המסכם בין ה-29 בינואר ל-10 בפברואר."
    ],
    "commentSummary": [
      "אמנת פשעי הסייבר המוצעת של האו\"ם נתפסת כבלתי מספקת בטיפול בפשיעת סייבר בשל אילוצי שיפוט והיעדר גישה לפושעים.",
      "הטלת קנסות וסנקציות על מדינות האחראיות לפשיעת סייבר מוצעת, אך עלולה להיתקל באתגרים גיאופוליטיים ובהתנגדות ציבורית.",
      "עצירת פשיעת סייבר במדינות עולם שלישי קשה בשל מניעים פיננסיים והמורכבות של מעקב אחר כסף וחבילות נתונים."
    ],
    "points": 166,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1706188867
  }
]
