[
  {
    "id": 39132453,
    "title": "Apple tekee muutoksia iOS:ään, Safariin ja App Storeen EU:ssa digitaalimarkkinoita koskevan lain noudattamiseksi",
    "originLink": "https://www.apple.com/newsroom/2024/01/apple-announces-changes-to-ios-safari-and-the-app-store-in-the-european-union/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39132453",
    "commentBody": "",
    "originSummary": [
      "Apple on julkistanut päivitykset iOS-, Safari- ja App Store -ohjelmiinsa EU:n digitaalisia markkinoita koskevan lain mukaisiksi.",
      "Päivitykset sisältävät parannettuja sovellusten jakelu- ja maksujenkäsittelyvaihtoehtoja kehittäjille sekä parannettuja valvontatoimia ja tietoja käyttäjille.",
      "Muutokset otetaan käyttöön EU:n käyttäjille maaliskuusta 2024 alkaen, ja kehittäjät voivat tutustua uusiin ominaisuuksiin ja testata niitä iOS 17.4:n beta-versiossa. Apple tarjoaa resursseja, jotka auttavat EU:n käyttäjiä ymmärtämään muutoksia ja sopeutumaan niihin."
    ],
    "commentSummary": [
      "Keskustelu pyörii sen ympärillä, että Apple rikkoo mahdollisesti EU:n digitaalimarkkinoita koskevan lain kiertämisen estäviä säännöksiä iOS:ään, Safariin ja App Storeen tehdyillä muutoksilla.",
      "Keskustelua käydään siitä, käyttääkö Apple pelkotaktiikkaa säilyttääkseen App Store -monopolinsa vai onko kyse perustelluista tietoturvaongelmista.",
      "Keskustelussa tarkastellaan Applen toimiin kohdistuvaa kritiikkiä, kuten valokuvien skannausta ja sen vastausta EU:n säännöksiin, sekä huolenaiheita Applen sovelluskaupan rajoituksista ja rajoituksista."
    ],
    "points": 1699,
    "commentCount": 2023,
    "retryCount": 0,
    "time": 1706205806
  },
  {
    "id": 39128902,
    "title": "Shakkinappulat uudelleen suunniteltu geometrisiksi hyökkäyssuunniksi",
    "originLink": "https://twitter.com/graycrawford/status/1750225562281632048",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39128902",
    "commentBody": "",
    "originSummary": [
      "Eräs Twitter-käyttäjä on keksinyt tavan suunnitella shakkinappulat uudelleen käyttämällä geometrisia muotoja hyökkäyssuuntausten esittämiseen.",
      "Tämä löytö tarjoaa tuoreen ja luovan otteen shakkinappuloiden perinteiseen muotoiluun.",
      "Käyttämällä puhtaasti geometrisia muotoja uudet shakkinappulat tarjoavat visuaalisesti mielenkiintoisen ja intuitiivisen tavan ymmärtää hyökkäyssuuntia."
    ],
    "commentSummary": [
      "Keskusteluissa keskitytään shakin eri näkökohtiin, kuten shakkinappuloiden vaihtoehtoisiin muotoiluihin, ratsun erilaisiin liikkeisiin, visuaalisten apuvälineiden vaikutukseen pelin oppimiseen, eri nappuloiden merkitykseen ja mahdollisuuteen luoda uusia shakkivaihtoehtoja.",
      "Osallistujat ilmaisevat mielipiteensä, ehdottavat parannuksia ja analysoivat eri konseptien hyviä ja huonoja puolia.",
      "Tämä on innostava ja yhteistyöhön perustuva foorumi, jossa shakin harrastajat voivat tutkia ja vaihtaa ideoita pelin kehittämiseksi."
    ],
    "points": 592,
    "commentCount": 192,
    "retryCount": 0,
    "time": 1706186184
  },
  {
    "id": 39134349,
    "title": "Ingenuity Mars -helikopterin operaatio päättyy lapojen vaurioitumisen vuoksi",
    "originLink": "https://www.nasa.gov/news-release/after-three-years-on-mars-nasas-ingenuity-helicopter-mission-ends/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39134349",
    "commentBody": "",
    "originSummary": [
      "NASAn Ingenuity Mars-helikopteri on saattanut tehtävänsä onnistuneesti päätökseen ylitettyään alkuperäisen tavoitteensa, joka oli viisi lentoa 30 päivässä, ja suoritettuaan 72 lentoa lähes kolmen vuoden aikana.",
      "Helikopterin roottorin lavat vaurioituivat viimeisimmässä laskeutumisessa, eikä se ole enää lentokelpoinen.",
      "Ingenuity toimi NASAn Perseverance-mönkijän teknologiaesittelynä ja ilmatiedustelijana ja osoitti, että moottoroitu ja hallittu lentäminen Marsissa on mahdollista huolimatta haasteista, kuten Marsin talven aikana ilmenevistä sähköongelmista. Ingenuity-tiimi suorittaa nyt viimeiset testit ja lataa jäljellä olevat tiedot, jotta tehtävä saadaan virallisesti päätökseen."
    ],
    "commentSummary": [
      "Mars-helikopteri Ingenuity on vaurioitunut roottorinsa lapoihin, eikä se pysty enää lentämään, mikä merkitsee sen kolmivuotisen projektin päättymistä yli 70 lennon jälkeen.",
      "Tästä takaiskusta huolimatta Ingenuity on viitoittanut tietä tuleville Marsin roottorilentokoneiden tehtäville, ja sitä on kiitelty sen innovaatiosta ja arvokkaista tiedoista, joita se on tuottanut.",
      "Keskusteluissa käsitellään erilaisia avaruustutkimukseen liittyviä aiheita, kuten Marsin pölymyrskyjen tarkkuutta, Marsista kerättyjen näyteputkien kestävyyttä, NASAn kehittyneen teknologian käyttöä ja Kuun alueen omistajuutta. Keskustelua käydään myös ihmissiirtokunnan perustamisen eettisistä näkökohdista Marsiin ja mahdollisuudesta perustaa huolto- tai korjausasema planeetalle."
    ],
    "points": 437,
    "commentCount": 174,
    "retryCount": 0,
    "time": 1706212689
  },
  {
    "id": 39129155,
    "title": "Faircamp: Bandcampin myynnin jälkeen ilmainen ja muokattavissa oleva vaihtoehtoinen alusta muusikoille: Ilmainen ja muokattavissa oleva vaihtoehtoinen alusta muusikoille Bandcampin myynnin jälkeen",
    "originLink": "https://wedistribute.org/2023/11/introducing-faircamp/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39129155",
    "commentBody": "",
    "originSummary": [
      "Faircamp on ilmainen vaihtoehtoinen alusta muusikoille sen jälkeen, kun Songtradr osti Bandcampin.",
      "Se on staattinen sivustogeneraattori, jota muusikot voivat itse isännöidä ja joka tarjoaa räätälöinti- ja maksuvaihtoehtoja albumeille ja kappaleille.",
      "Faircamp on saanut myönteistä palautetta musiikkiyhteisöltä, ja jotkut artistit käyttävät RadioFreeFedin infrastruktuuria omien Faircamp-sivustojensa isännöintiin, mikä tekee siitä lupaavan vaihtoehdon muusikoiden tukemiseen Fediversessä."
    ],
    "commentSummary": [
      "Keskustelu pyörii Bandcampin eri osa-alueiden, kuten sen vahvuuksien, yhteisöllisyyden ja kulttuurivaikutusten ympärillä.",
      "Käyttäjät ilmaisevat mielipiteensä Epic Gamesin ostamasta alustasta, taiteilijoiden tukemisen tärkeydestä ja vaihtoehtoisista alustoista musiikin isännöintiin ja myyntiin.",
      "Lisäksi käsitellään sellaisia aiheita kuin maksujärjestelmät, sisällön rajoitukset, löydettävyys, omistajuus, luotettavuus ja yritysten vaikutus verkkoalustoihin, ja korostetaan yhteisöllisyyden, kuratoinnin ja riippumattomien muusikoiden tukemisen merkitystä."
    ],
    "points": 335,
    "commentCount": 169,
    "retryCount": 0,
    "time": 1706187882
  },
  {
    "id": 39129949,
    "title": "Microsoft vähentää 1 900 työntekijää Activision Blizzardilta ja Xboxilta",
    "originLink": "https://www.theverge.com/2024/1/25/24049050/microsoft-activision-blizzard-layoffs",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39129949",
    "commentBody": "",
    "originSummary": [
      "Microsoft vähentää 1 900 työpaikkaa eli noin 8 prosenttia peliosastostaan, mukaan lukien Activision Blizzardin ja Xboxin työntekijät, Activision Blizzardin äskettäisen oston jälkeen.",
      "Irtisanomiset koskevat Xboxin ja ZeniMaxin työntekijöitä, ja Blizzardin pääjohtaja Mike Ybarra jättää yhtiön.",
      "Projektien, kuten Blizzardin selviytymispelin, peruuttaminen on myös osa rakenneuudistusta. Myös muut peliyhtiöt tekevät vastaavia leikkauksia."
    ],
    "commentSummary": [
      "Keskustelussa käsitellään erilaisia aiheita, kuten irtisanomisia, työttömyyden haasteita, yrityksen perustamista ja yrityskauppojen vaikutuksia yrityksiin ja työntekijöihin.",
      "He puhuvat myös peliteollisuudesta, tiettyjen yritysten taantumisesta ja tekoälyn roolista luovissa töissä.",
      "Keskustelua käydään tietyistä peleistä, laatuun liittyvistä huolenaiheista, pelialan voittoa tavoittelevista käytännöistä sekä tekoälyteknologian mahdollisista käyttömahdollisuuksista ja vaikutuksista."
    ],
    "points": 323,
    "commentCount": 293,
    "retryCount": 0,
    "time": 1706193161
  },
  {
    "id": 39132300,
    "title": "Out-of-Bounds-kirjoitushaavoittuvuus korjattu rhboot / shim-ohjelmistossa",
    "originLink": "https://github.com/rhboot/shim/commit/0226b56513b2b8bd5fd281bce77c40c9bf07c66d",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39132300",
    "commentBody": "",
    "originSummary": [
      "Yhteenveto käsittelee koodiongelmaa ohjelmistoprojektissa rhboot / shim.",
      "Ongelma johtuu virheellisestä luottamuksesta HTTP-otsakkeisiin tiedostojen haun aikana, mikä johtaa out-of-bounds-kirjoitushaavoittuvuuteen.",
      "Korjaus on toteutettu, jotta puskuri ei ylitä varattua kokoa, mikä korjaa haavoittuvuuden.",
      "Ongelman löysi Bill Demirkapi Microsoft Security Response Centeristä."
    ],
    "commentSummary": [
      "Kriittinen haavoittuvuus (CVE-2023-40547) on löydetty shim EFI-käynnistyslatausohjelmassa, jota Linux-jakelijat käyttävät Secure Boot -käynnistyskäytössä.",
      "Hyökkääjät voivat hyödyntää virhettä paikallisesti, lähiverkosta tai etänä HTTP-käynnistyksen kautta ohittaakseen Secure Bootin ja saadakseen luvattoman pääsyn.",
      "Tämä haavoittuvuus on herättänyt keskustelua Secure Bootin rajoituksista, Microsoftin toteutuksesta, GPLv3-lisenssin yhteensopivuudesta, salauksen ja allekirjoitusten käytöstä sekä HTTP-käynnistykseen liittyvistä mahdollisista riskeistä. Virhe paljastaa tietoturva-aukkoja ja herättää huolta Secure Bootin tehokkuudesta."
    ],
    "points": 224,
    "commentCount": 96,
    "retryCount": 0,
    "time": 1706204954
  },
  {
    "id": 39138042,
    "title": "Helposti saatavilla olevat sähköiset julkaisut kaikilla laitteilla",
    "originLink": "https://willcrichton.net/notes/portable-epubs/#epub-content%2FEPUB%2Findex.xhtml$",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39138042",
    "commentBody": "",
    "originSummary": [
      "Kannettavat EPUB-julkaisut ovat sähköisiä julkaisuja, jotka on suunniteltu siten, että ne ovat helposti saatavilla ja siirrettävissä eri laitteisiin.",
      "EPUB on yleisesti käytetty digitaalisten kirjojen ja kirjallisen sisällön muoto, koska se on yhteensopiva eri laitteiden kanssa.",
      "EPUB-julkaisut tarjoavat ominaisuuksia, kuten tekstin uudelleensulautuvuutta ja säädettäviä fonttikokoja, jotka parantavat käyttäjien lukukokemusta."
    ],
    "commentSummary": [
      "Artikkelissa tarkastellaan EPUB- ja PDF-formaattien haasteita ja rajoituksia ja ehdotetaan mahdollisia parannuksia ja vaihtoehtoja.",
      "EPUB:n ulkoasun ja renderöinnin parantamiseen liittyviä ideoita ovat muun muassa typografiatyökalujen parantaminen ja rivinvaihtojen esilaskenta.",
      "EPUB-lukulaitteiden puutteellinen tuki tietyille ominaisuuksille ja riippuvuus JavaScriptistä herättävät huolta, kun taas PDF-versiota suositaan teknisessä dokumentoinnissa sen haitoista huolimatta."
    ],
    "points": 219,
    "commentCount": 60,
    "retryCount": 0,
    "time": 1706233991
  },
  {
    "id": 39132901,
    "title": "OpenAI esittelee uusia upotusmalleja ja API-päivityksiä",
    "originLink": "https://openai.com/blog/new-embedding-models-and-api-updates",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39132901",
    "commentBody": "",
    "originSummary": [
      "OpenAI on tuonut markkinoille uusia upotusmalleja, mukaan lukien pienemmät ja suuremmat versiot, ja tehnyt päivityksiä GPT-4 Turbo ja GPT-3.5 Turbo -malleihin.",
      "Uudet mallit tarjoavat paremman suorituskyvyn ja alhaisemman hinnan.",
      "OpenAI on ottanut käyttöön parannetun API-avainten hallinnan ja käytön ymmärtämisen, minkä ansiosta kehittäjät voivat määrittää käyttöoikeuksia ja seurata käyttöä avaintasolla. He ovat myös julkaisseet päivitetyn moderointimallin haitallisen tekstin tunnistamiseksi."
    ],
    "commentSummary": [
      "OpenAI on julkaissut uusia upotusmalleja ja API-päivityksiä, jotka mahdollistavat dimensioiden vähentämisen suoraan API:sta.",
      "Käyttäjät keskustelevat OpenAI:n GPT-4- ja GPT-4 Turbo -mallien suorituskyvystä, ja jotkut ovat huolissaan tiettyjen tekstin upotusten laadusta.",
      "Lisäksi keskustellaan ulottuvuuden vähentämisen vaikutuksesta viiveeseen ja haasteista, jotka liittyvät siirtymiseen eri upotusjoukkojen välillä.",
      "Työntekijät ovat huolissaan työpaikkojen siirtymisestä ja sen mahdollisista vaikutuksista tietojen laatuun.",
      "OpenAI:n uuden sulautusmallin edullisuutta korostetaan, vertaillaan avoimen lähdekoodin malleihin ja keskustellaan kilpailusta ja hinnoittelusta AI-as-a-Service-alalla.",
      "Malleissa esiintyvän \"laiskuuden\" poistamiseksi tehdään ehdotuksia.",
      "Moderointitoimiin ryhdytään käyttäjiä vastaan, jotka rikkovat arkaluonteisia keskusteluja koskevia ohjeita."
    ],
    "points": 206,
    "commentCount": 75,
    "retryCount": 0,
    "time": 1706207585
  },
  {
    "id": 39128977,
    "title": "Japanin tarkkuuskuulaskeutuja osuu kohteeseen mutta laskeutuu ylösalaisin",
    "originLink": "https://phys.org/news/2024-01-japan-craft-successful-pin-moon.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39128977",
    "commentBody": "",
    "originSummary": [
      "Japanin SLIM-kuulento laskeutui onnistuneesti kuun pinnalle, mutta ylösalaisin, sillä sen aurinkoparistot olivat väärään suuntaan, eivätkä ne pystyneet tuottamaan sähköä.",
      "On toivoa, että luotain voi latautua, kun kuu tulee päiväsaikaansa.",
      "Tämä tehtävä merkitsee Japanin pääsyä viidentenä maana kuuhun, ja sitä pidetään merkittävänä saavutuksena Japanin avaruusteknologialle."
    ],
    "commentSummary": [
      "Japanin kuuhun laskeutuva SLIM-laskeutuja laskeutui onnistuneesti kuuhun, mutta näyttää olevan ylösalaisin, mikä on herättänyt huolta ja keskustelua laskeutumismenettelystä ja mahdollisista vikamuodoista.",
      "Laskeutumisalusta vapautti kaksi Roveria, jotka lähettivät kuvia takaisin Maahan, mikä osoitti, että avaruusalus pystyy tarkkuusmatkailuun.",
      "Laskeutumisonnettomuudesta huolimatta tehtävää pidetään uraauurtavana ja se tasoittaa tietä tuleville tehtäville, mutta se herättää myös keskustelua aiemmista tehtävistä ja Japanin avaruusjärjestön kohtaamista haasteista."
    ],
    "points": 202,
    "commentCount": 141,
    "retryCount": 0,
    "time": 1706186754
  },
  {
    "id": 39129806,
    "title": "Trail of Bits ja Python Cryptographic Authority julkaisevat X.509-polun validointialgoritmin toteutuksen Python-kehittäjille.",
    "originLink": "https://blog.trailofbits.com/2024/01/25/we-build-x-509-chains-so-you-dont-have-to/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39129806",
    "commentBody": "",
    "originSummary": [
      "Trail of Bits ja Python Cryptographic Authority ovat kehittäneet cryptography-x509-verificationin, joka on nopea ja muistiturvallinen toteutus X.509-polunvalvonta-algoritmista Rustissa.",
      "Tämä toteutus tarjoaa vaihtoehdon OpenSSL:n X.509 API:ille varmenteiden todentamiseen TLS:n kaltaisissa protokollissa, ja se on integroitu Cryptographyn julkaisusarjaan Python-kehittäjien käyttöön.",
      "Trail of Bits on myös luonut x509-limbon, testivektorin ja valjastussarjan, joka on suunniteltu arvioimaan erilaisten X.509-polun validointitoteutusten vaatimustenmukaisuutta ja käyttäytymistä. Tavoitteena on parantaa Python-ekosysteemin turvallisuutta ja edistää avoimen lähdekoodin yhteisöä."
    ],
    "commentSummary": [
      "Artikkelissa käsitellään X.509-ketjujen kehittämistä ja hyvin kehitettyjen testisarjojen merkitystä.",
      "Siinä tarkastellaan Rustin käytön mahdollisia hyötyjä ja haasteita internetin tietoturvassa, erityisesti palvelunestohyökkäysten estämisessä.",
      "Keskustellaan vaihdettavien Prolog-ohjelmien toteuttamisesta käytäntöinä pyca/cryptography-kirjastossa sekä varmenteiden peruuttamisen haasteista ja rajoituksista.",
      "Mozillan CRLite-ratkaisu ja lyhytaikaisten varmenteiden käyttö mainitaan mahdollisina vaihtoehtoina peruuttamiselle.",
      "Keskustelussa käsitellään eri aiheita, kuten dynaamisten rajoitteiden toteuttamista, webpki-luokitusta, vaihtoehtoja X.509-varmenteille ja Python-ekosysteemin yhteentoimivuutta C:n kanssa."
    ],
    "points": 201,
    "commentCount": 79,
    "retryCount": 0,
    "time": 1706192428
  },
  {
    "id": 39133086,
    "title": "HPV-rokotetutkimuksessa todettiin nolla kohdunkaulan syövän tapausta alle 14-vuotiailla rokotetuilla naisilla.",
    "originLink": "https://www.statnews.com/2024/01/25/hpv-vaccine-prevent-cervical-cancer-cervarix-gardasil-study/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39133086",
    "commentBody": "",
    "originSummary": [
      "Skotlannissa hiljattain tehty tutkimus osoitti, että vuosina 1988-1996 syntyneillä naisilla, jotka oli rokotettu HPV:tä vastaan täydellisesti 12-13-vuotiaina, ei ollut lainkaan kohdunkaulan syöpätapauksia.",
      "Tämä on ensimmäinen kansallinen tutkimus, jossa seurataan naisryhmää pitkän ajanjakson ajan ja jossa ei havaittu yhtään kohdunkaulan syövän tapausta, mikä osoittaa HPV-rokotteen tehokkuuden.",
      "Tutkimuksessa korostetaan oikea-aikaisen rokotuksen merkitystä ja esitetään, että jopa rokotteen saaminen 14-22-vuotiaana vähentää merkittävästi kohdunkaulan syövän riskiä. On kuitenkin tärkeää huomata, että muut HPV-kannat, joita rokote ei kata, voivat edelleen aiheuttaa kohdunkaulan syöpää. Jatkuva seulonta varhaista havaitsemista varten on ratkaisevan tärkeää."
    ],
    "commentSummary": [
      "HPV-rokote ehkäisee tehokkaasti kohdunkaulan syöpää ja muita HPV:hen liittyviä sairauksia.",
      "Rokotteen kustannuksiin ja vakuutusturvan puutteeseen liittyy ongelmia.",
      "Rokotteen tehosta yli 45-vuotiaiden osalta käydään keskustelua."
    ],
    "points": 199,
    "commentCount": 117,
    "retryCount": 0,
    "time": 1706208192
  },
  {
    "id": 39130711,
    "title": "Windows NT:n synkronointiohjainta ehdotetaan merkittäviksi suorituskyvyn parannuksiksi Linux-pelaamisessa",
    "originLink": "https://www.gamingonlinux.com/2024/01/proposed-windows-nt-sync-driver-brings-big-wine-proton-performance-improvements/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39130711",
    "commentBody": "",
    "originSummary": [
      "Zeb Figura CodeWeaversilta on ehdottanut Windows NT:n synkronoinnin primitiivistä ajuria, joka parantaa Windows-sovellusten ja -pelien suorituskykyä Linuxissa Wine/Protonin avulla.",
      "Ehdotettu ajuri toteuttaisi suoraan NT:n synkronointiprimitiivit Linux-ytimessä, mikä poistaisi RPC:n tarpeen ja parantaisi suorituskykyä.",
      "Ensimmäiset testit ovat osoittaneet lupaavia suorituskyvyn parannuksia useissa peleissä, vaikka konkreettiset parannukset voivat vaihdella laitteistosta ja ohjelmistoasetuksista riippuen.",
      "Jos ajuri hyväksytään ja otetaan käyttöön, se voi parantaa merkittävästi pelien suorituskykyä Linuxissa, myös tulevassa Steam Deckissä Winen ja Protonin kanssa."
    ],
    "commentSummary": [
      "Artikkelissa tarkastellaan tapoja parantaa pelien suorituskykyä Linuxissa, kuten ehdotettuja Windows NT:n synkronointiohjaimia, OpenVZ:n integroimista Linux-ytimeen ja syscall-käskyjen toteuttamista yhteensopivuuden parantamiseksi Windows-ohjelmistojen kanssa.",
      "Eri näytönohjainvaihtoehdoista keskustellaan, samoin kuin omista ajureista aiheutuvista turhautumisista ja kokemuksista AMD:n näytönohjaimista Linuxissa.",
      "Kommenttiosassa käsitellään mahdollisuuksia ratkaista ongelmia, jotka liittyvät Windows-ohjelmistojen käyttämiseen Linux-alustoilla, ja tuodaan esiin huolenaiheita tietoturvasta ja huijaustenestojärjestelmistä peleissä."
    ],
    "points": 199,
    "commentCount": 58,
    "retryCount": 0,
    "time": 1706197359
  },
  {
    "id": 39130945,
    "title": "Merkle CRDT:iden muunnelmien tutkiminen: DAG:t ja hakupuut",
    "originLink": "https://interjectedfuture.com/crdts-turned-inside-out/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39130945",
    "commentBody": "",
    "originSummary": [
      "Artikkelissa tarkastellaan kahta erityyppistä Merkle Conflict-free Replicated Data Types (CRDT) -tyyppiä: Merkle-DAG CRDT:t ja Merkle Search Tree CRDT:t.",
      "Merkle-DAG CRDT:t käyttävät suunnattua asyklistä graafia samanaikaisten päivitysten tallentamiseen ja minimoivat replikaatioiden välisen synkronointikaistanleveyden.",
      "Merkle-hakupuu CRDT-tietokannat säilyttävät avainten järjestetyn joukon itsetasapainottuvassa ja ainutlaatuisessa puurakenteessa. Artikkelissa käsitellään myös Merkle CRDT:n ja Gitin yhtäläisyyksiä ja mahdollisuuksia toteuttaa yhdistettäviä CRDT:itä."
    ],
    "commentSummary": [
      "CRDT-tietotyyppejä (Conflict-Free Replicated Data Types) käytetään ja toteutetaan hajautetuissa sosiaalisissa verkostoissa ja yhteistyösovelluksissa.",
      "Merkle Search Tree (MST) -suunnittelu on saamassa tunnustusta ja hyväksyntää, ja siitä on tehty itsenäisiä toteutuksia Go ja Rust -ohjelmilla.",
      "Artikkelissa käsitellään MST:ien itsetasapainottumisominaisuutta, niiden käyttöä AT Protocolin tietovarastorakenteissa ja Merkle DAG -tietorakenteen optimointia Doltissa."
    ],
    "points": 176,
    "commentCount": 28,
    "retryCount": 0,
    "time": 1706198452
  },
  {
    "id": 39129274,
    "title": "EFF ja 110 kansalaisjärjestöä varoittavat, että YK:n tietoverkkorikossopimus uhkaa ihmisoikeuksia ja yksityisyyttä",
    "originLink": "https://www.eff.org/deeplinks/2024/01/eff-and-more-100-ngos-set-non-negotiable-redlines-ahead-un-cybercrime-treaty",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39129274",
    "commentBody": "",
    "originSummary": [
      "Electronic Frontier Foundation (EFF) on yhdessä 110 kansalaisjärjestön kanssa ilmaissut huolensa YK:n tietoverkkorikollisuutta koskevasta sopimusluonnoksesta.",
      "He katsovat, että sopimuksen nykyisessä versiossa ei suojella riittävästi ihmisoikeuksia ja että siitä on tullut valvonnan väline.",
      "EFF kehottaa valtioita hylkäämään sopimuksen, ellei siihen tehdä merkittäviä muutoksia, ja on läsnä päätösistunnossa 29. tammikuuta-10. helmikuuta."
    ],
    "commentSummary": [
      "Ehdotetun YK:n tietoverkkorikollisuutta koskevan sopimuksen katsotaan olevan riittämätön tietoverkkorikollisuuden torjunnassa, koska se on oikeudellisesti rajallinen ja koska rikolliset eivät pääse tapaamaan rikollisia.",
      "Ehdotetaan sakkojen ja seuraamusten määräämistä tietoverkkorikollisuudesta vastuussa oleville maille, mutta se saattaa kohdata geopoliittisia haasteita ja yleistä paheksuntaa.",
      "Kolmannen maailman maissa tietoverkkorikollisuuden pysäyttäminen on vaikeaa taloudellisten motiivien sekä rahan ja datapakettien jäljittämisen monimutkaisuuden vuoksi."
    ],
    "points": 166,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1706188867
  }
]
