[
  {
    "id": 39132453,
    "title": "تقدم Apple تغييرات على iOS و Safari و App Store في الاتحاد الأوروبي للامتثال لقانون الأسواق الرقمية",
    "originLink": "https://www.apple.com/newsroom/2024/01/apple-announces-changes-to-ios-safari-and-the-app-store-in-the-european-union/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39132453",
    "commentBody": "",
    "originSummary": [
      "كشفت Apple عن تحديثات لنظام iOS و Safari و App Store لتتماشى مع قانون الأسواق الرقمية في الاتحاد الأوروبي.",
      "تتضمن التحديثات توزيعا محسنا للتطبيق وخيارات معالجة الدفع للمطورين وضوابط وإفصاحات محسنة للمستخدمين.",
      "سيتم طرح التغييرات لمستخدمي الاتحاد الأوروبي اعتبارا من مارس 2024 ، ويمكن للمطورين استكشاف واختبار الميزات الجديدة في الإصدار التجريبي من iOS 17.4. ستقدم Apple موارد لمساعدة مستخدمي الاتحاد الأوروبي في فهم التعديلات والتكيف معها."
    ],
    "commentSummary": [
      "يدور النقاش حول احتمال انتهاك Apple لأحكام مكافحة التحايل في قانون الأسواق الرقمية للاتحاد الأوروبي مع تغييرات في iOS و Safari و App Store.",
      "هناك جدل حول ما إذا كانت Apple تستخدم تكتيكات الخوف للحفاظ على احتكار متجر التطبيقات أو إذا كانت هناك مخاوف أمنية مشروعة.",
      "تستكشف المناقشة انتقادات تصرفات Apple ، بما في ذلك مسح الصور واستجابتها للوائح الاتحاد الأوروبي ، والمخاوف بشأن القيود والقيود في متجر تطبيقات Apple."
    ],
    "points": 1699,
    "commentCount": 2023,
    "retryCount": 0,
    "time": 1706205806
  },
  {
    "id": 39128902,
    "title": "إعادة تصميم قطع الشطرنج كاتجاهات هجوم هندسية",
    "originLink": "https://twitter.com/graycrawford/status/1750225562281632048",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39128902",
    "commentBody": "",
    "originSummary": [
      "وجد أحد مستخدمي Twitter طريقة لإعادة تصميم قطع الشطرنج باستخدام أشكال هندسية لتمثيل اتجاهات الهجوم.",
      "يقدم هذا الاكتشاف نظرة جديدة ومبتكرة على التصميم التقليدي لقطع الشطرنج.",
      "باستخدام أشكال هندسية بحتة ، توفر قطع الشطرنج الجديدة طريقة مثيرة للاهتمام بصريا وبديهية لفهم اتجاهات الهجوم."
    ],
    "commentSummary": [
      "تركز المناقشات على جوانب مختلفة من الشطرنج ، مثل التصاميم البديلة لقطع الشطرنج ، والحركات المختلفة للفارس ، وتأثير الوسائل البصرية على تعلم اللعبة ، وأهمية القطع المختلفة ، وإمكانية إنشاء متغيرات شطرنج جديدة.",
      "يعبر المشاركون عن آرائهم ويقترحون التحسينات ويحللون إيجابيات وسلبيات المفاهيم المختلفة.",
      "هذا منتدى جذاب وتعاوني لعشاق الشطرنج لاستكشاف وتبادل الأفكار لتحسين اللعبة."
    ],
    "points": 592,
    "commentCount": 192,
    "retryCount": 0,
    "time": 1706186184
  },
  {
    "id": 39134349,
    "title": "انتهاء مهمة مروحية إنجينيويتي مارس بسبب تلف الشفرة",
    "originLink": "https://www.nasa.gov/news-release/after-three-years-on-mars-nasas-ingenuity-helicopter-mission-ends/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39134349",
    "commentBody": "",
    "originSummary": [
      "أنهت مروحية المريخ Ingenuity Mars التابعة لناسا مهمتها بنجاح بعد أن تجاوزت هدفها الأصلي المتمثل في خمس رحلات في 30 يوما من خلال إكمال 72 رحلة على مدار ما يقرب من ثلاث سنوات.",
      "تعرضت المروحية لأضرار في شفرات دوارها خلال هبوطها الأخير ولم تعد قادرة على الطيران.",
      "كان Ingenuity بمثابة عرض تكنولوجي وكشاف جوي لمركبة Perseverance التابعة لناسا ، مما يدل على أن الطيران بالطاقة والتحكم على المريخ أمر ممكن على الرغم من التحديات مثل مشاكل الطاقة خلال فصل الشتاء المريخي. سيقوم فريق Ingenuity الآن بإجراء الاختبارات النهائية وتنزيل البيانات المتبقية لإنهاء المهمة رسميا."
    ],
    "commentSummary": [
      "تعرضت مروحية المريخ Ingenuity لأضرار في شفرات دوارها ولن تكون قادرة على الطيران مرة أخرى ، مما يمثل نهاية مشروعها الذي استمر ثلاث سنوات بعد أكثر من 70 رحلة.",
      "وعلى الرغم من هذه النكسة، مهدت إنجينويتي الطريق لبعثات الطائرات العمودية المستقبلية على المريخ وتمت الإشادة بابتكارها والبيانات القيمة التي قدمتها.",
      "تدور المناقشات حول مواضيع مختلفة تتعلق باستكشاف الفضاء ، مثل دقة العواصف الترابية على المريخ ، ومتانة أنابيب العينات التي تم جمعها على المريخ ، واستخدام ناسا للتكنولوجيا المتقدمة ، وملكية الأراضي القمرية. هناك أيضا مناقشات حول الاعتبارات الأخلاقية لإنشاء مستعمرة بشرية على المريخ وإمكانية وجود محطة خدمة أو إصلاح على هذا الكوكب."
    ],
    "points": 437,
    "commentCount": 174,
    "retryCount": 0,
    "time": 1706212689
  },
  {
    "id": 39129155,
    "title": "Faircamp: منصة بديلة مجانية وقابلة للتخصيص للموسيقيين بعد بيع Bandcamp",
    "originLink": "https://wedistribute.org/2023/11/introducing-faircamp/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39129155",
    "commentBody": "",
    "originSummary": [
      "Faircamp هي منصة بديلة مجانية للموسيقيين بعد استحواذ Songtradr على Bandcamp.",
      "إنه منشئ موقع ثابت يمكن للموسيقيين استضافته ذاتيا ، مما يوفر خيارات التخصيص والدفع للألبومات والمسارات.",
      "تلقى Faircamp ردود فعل إيجابية من مجتمع الموسيقى ، حيث يستخدم بعض الفنانين البنية التحتية ل RadioFreeFedi لاستضافة مواقع Faircamp الخاصة بهم ، مما يجعلها بديلا واعدا لدعم الموسيقيين في Fediverse."
    ],
    "commentSummary": [
      "تدور المناقشة حول عدة جوانب من Bandcamp ، مثل نقاط قوتها وميزاتها المجتمعية وتأثيرها الثقافي.",
      "يعبر المستخدمون عن آرائهم حول استحواذ Epic Games على المنصة ، وأهمية دعم الفنانين ، والمنصات البديلة لاستضافة الموسيقى وبيعها.",
      "كما يتم تغطية موضوعات مثل أنظمة الدفع ، وقيود المحتوى ، وقابلية الاكتشاف ، والملكية ، والموثوقية ، وتأثير الشركات على المنصات عبر الإنترنت ، مع التأكيد على أهمية المجتمع ، والتنظيم ، ودعم الموسيقيين المستقلين."
    ],
    "points": 335,
    "commentCount": 169,
    "retryCount": 0,
    "time": 1706187882
  },
  {
    "id": 39129949,
    "title": "مايكروسوفت تخفض 1,900 موظف في Activision Blizzard و Xbox",
    "originLink": "https://www.theverge.com/2024/1/25/24049050/microsoft-activision-blizzard-layoffs",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39129949",
    "commentBody": "",
    "originSummary": [
      "تقوم Microsoft بإلغاء 1,900 وظيفة ، أي حوالي 8٪ من قسم الألعاب ، بما في ذلك الموظفين في Activision Blizzard و Xbox ، بعد استحواذها الأخير على Activision Blizzard.",
      "ستؤثر عمليات التسريح على موظفي Xbox و ZeniMax ، وسيغادر رئيس Blizzard مايك يبارا الشركة.",
      "إلغاء المشاريع ، بما في ذلك لعبة البقاء على قيد الحياة في Blizzard ، هو أيضا جزء من إعادة الهيكلة. تقوم شركات الألعاب الأخرى أيضا بإجراء تخفيضات مماثلة."
    ],
    "commentSummary": [
      "تتطرق المناقشة إلى مواضيع مختلفة مثل تسريح العمال ، وتحديات البطالة ، وبدء عمل تجاري ، وآثار عمليات الاستحواذ على الشركات والموظفين.",
      "كما يتحدثون عن صناعة الألعاب ، وتراجع بعض الشركات ، ودور الذكاء الاصطناعي في الأعمال الإبداعية.",
      "هناك مناقشات بشأن ألعاب محددة ، ومخاوف الجودة ، والممارسات المدفوعة بالربح في صناعة الألعاب ، والاستخدامات والآثار المحتملة لتكنولوجيا الذكاء الاصطناعي."
    ],
    "points": 323,
    "commentCount": 293,
    "retryCount": 0,
    "time": 1706193161
  },
  {
    "id": 39132300,
    "title": "تم إصلاح ثغرة الكتابة خارج الحدود في برنامج rhboot / shim",
    "originLink": "https://github.com/rhboot/shim/commit/0226b56513b2b8bd5fd281bce77c40c9bf07c66d",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39132300",
    "commentBody": "",
    "originSummary": [
      "يعالج الملخص مشكلة في التعليمات البرمجية في مشروع البرنامج rhboot / shim.",
      "تنشأ المشكلة من الثقة غير الصحيحة في رؤوس HTTP أثناء استرداد الملفات ، مما يؤدي إلى ثغرة أمنية للكتابة خارج الحدود.",
      "تم تنفيذ تصحيح لمنع المخزن المؤقت من تجاوز الحجم المخصص ، وحل الثغرة الأمنية.",
      "تم اكتشاف المشكلة بواسطة بيل ديميركابي من مركز الاستجابة الأمنية ل Microsoft."
    ],
    "commentSummary": [
      "تم اكتشاف ثغرة أمنية حرجة (CVE-2023-40547) في محمل الإقلاع EFI المميز الذي تستخدمه توزيعات Linux للتمهيد الآمن.",
      "يمكن للمهاجمين استغلال الخطأ محليا أو من شبكة مجاورة أو عن بعد عبر تمهيد HTTP لتجاوز التمهيد الآمن والحصول على وصول غير مصرح به.",
      "أثارت هذه الثغرة الأمنية مناقشات حول قيود التمهيد الآمن ، وتنفيذ Microsoft له ، وتوافق ترخيص GPLv3 ، واستخدام التشفير والتوقيعات ، والمخاطر المحتملة المرتبطة بتمهيد HTTP. يكشف الخطأ عن ثغرات أمنية ويثير مخاوف بشأن فعالية التمهيد الآمن."
    ],
    "points": 224,
    "commentCount": 96,
    "retryCount": 0,
    "time": 1706204954
  },
  {
    "id": 39138042,
    "title": "منشورات إلكترونية يسهل الوصول إليها لأي جهاز",
    "originLink": "https://willcrichton.net/notes/portable-epubs/#epub-content%2FEPUB%2Findex.xhtml$",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39138042",
    "commentBody": "",
    "originSummary": [
      "EPUBs المحمولة هي منشورات إلكترونية مصممة بحيث يسهل الوصول إليها وحملها عبر أجهزة مختلفة.",
      "EPUBs هي تنسيق شائع الاستخدام للكتب الرقمية والمحتوى المكتوب نظرا لتوافقها مع الأجهزة المختلفة.",
      "توفر ملفات EPUB ميزات مثل النص القابل لإعادة التدفق وأحجام الخطوط القابلة للتعديل، مما يعزز تجربة القراءة للمستخدمين."
    ],
    "commentSummary": [
      "تستكشف المقالة تحديات وقيود تنسيقات EPUB وPDF وتقترح تحسينات وبدائل محتملة.",
      "تتضمن أفكار تحسين تخطيط EPUB وعرضه تحسين أدوات الطباعة وحساب فواصل الأسطر مسبقا.",
      "تثار مخاوف بشأن عدم دعم قراء EPUB لبعض الميزات والاعتماد على JavaScript ، بينما يفضل PDF للتوثيق الفني على الرغم من عيوبه."
    ],
    "points": 219,
    "commentCount": 60,
    "retryCount": 0,
    "time": 1706233991
  },
  {
    "id": 39132901,
    "title": "تقدم OpenAI نماذج تضمين جديدة وتحديثات API",
    "originLink": "https://openai.com/blog/new-embedding-models-and-api-updates",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39132901",
    "commentBody": "",
    "originSummary": [
      "أطلقت OpenAI نماذج تضمين جديدة ، بما في ذلك الإصدارات الأصغر والأكبر ، وأجرت تحديثات على طرازات GPT-4 Turbo و GPT-3.5 Turbo.",
      "توفر الطرازات الجديدة أداء محسنا وأسعارا مخفضة.",
      "قدمت OpenAI إدارة محسنة لمفاتيح واجهة برمجة التطبيقات وفهم الاستخدام ، مما يسمح للمطورين بتعيين الأذونات وتتبع الاستخدام على مستوى المفتاح. لقد أصدروا أيضا نموذج إشراف محدث لتحديد النص الضار."
    ],
    "commentSummary": [
      "أصدرت OpenAI نماذج تضمين جديدة وتحديثات واجهة برمجة التطبيقات ، مما يتيح تقليل الأبعاد مباشرة من واجهة برمجة التطبيقات.",
      "يناقش المستخدمون أداء نماذج GPT-4 و GPT-4 Turbo من OpenAI ، مع إثارة بعض المخاوف بشأن جودة بعض عمليات تضمين النص.",
      "كما تتم مناقشة تأثير تقليل الأبعاد على زمن الوصول وتحديات الانتقال بين مجموعات التضمين المختلفة.",
      "يعبر العمال عن قلقهم بشأن النزوح الوظيفي وتأثيره المحتمل على جودة البيانات.",
      "يتم تسليط الضوء على القدرة على تحمل تكاليف نموذج التضمين الجديد من OpenAI ، إلى جانب المقارنات مع النماذج مفتوحة المصدر والمناقشات حول المنافسة والتسعير في صناعة الذكاء الاصطناعي كخدمة.",
      "يتم تقديم اقتراحات لمعالجة مسألة \"الكسل\" في النماذج.",
      "يتم اتخاذ إجراءات الإشراف ضد المستخدمين الذين ينتهكون الإرشادات المتعلقة بالمناقشات الحساسة."
    ],
    "points": 206,
    "commentCount": 75,
    "retryCount": 0,
    "time": 1706207585
  },
  {
    "id": 39128977,
    "title": "مركبة الهبوط اليابانية الدقيقة على سطح القمر تصل إلى الهدف لكنها تهبط رأسا على عقب",
    "originLink": "https://phys.org/news/2024-01-japan-craft-successful-pin-moon.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39128977",
    "commentBody": "",
    "originSummary": [
      "هبطت المهمة القمرية اليابانية ، SLIM ، بنجاح على سطح القمر ولكن رأسا على عقب ، حيث تواجه بطارياتها الشمسية الاتجاه الخاطئ وغير قادرة على توليد الطاقة.",
      "هناك أمل في أن يتمكن المسبار من إعادة الشحن بمجرد دخول القمر نهاره.",
      "تمثل هذه المهمة دخول اليابان كخامس دولة تصل إلى القمر وتعتبر إنجازا مهما لتكنولوجيا الفضاء اليابانية."
    ],
    "commentSummary": [
      "ونجحت مركبة الهبوط اليابانية على سطح القمر، SLIM، في الهبوط على سطح القمر، ولكن يبدو أنها مقلوبة رأسا على عقب، مما أثار مخاوف ومناقشات حول إجراءات الهبوط وأنماط الفشل المحتملة.",
      "أطلقت مركبة الهبوط مركبتين متنقلتين تنقلان الصور إلى الأرض ، مما يدل على القدرة على الاستكشاف الدقيق.",
      "وعلى الرغم من حادث الهبوط، تعتبر المهمة رائدة وتمهد الطريق للبعثات المستقبلية، بينما تثير أيضا مناقشات حول البعثات السابقة والتحديات التي تواجهها وكالة الفضاء اليابانية."
    ],
    "points": 202,
    "commentCount": 141,
    "retryCount": 0,
    "time": 1706186754
  },
  {
    "id": 39129806,
    "title": "درب البتات وإصدار هيئة تشفير بايثون تنفيذ خوارزمية التحقق من صحة المسار X.509 لمطوري Python",
    "originLink": "https://blog.trailofbits.com/2024/01/25/we-build-x-509-chains-so-you-dont-have-to/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39129806",
    "commentBody": "",
    "originSummary": [
      "طورت Trail of Bits وهيئة تشفير Python Cryptography-x509-verification ، وهو تنفيذ سريع وآمن للذاكرة لخوارزمية التحقق من صحة مسار X.509 في Rust.",
      "يوفر هذا التطبيق بديلا لواجهات برمجة تطبيقات X.509 الخاصة ب OpenSSL للتحقق من الشهادات في بروتوكولات مثل TLS وقد تم دمجها في سلسلة إصدارات Cryptography لاستخدامها من قبل مطوري Python.",
      "أنشأت Trail of Bits أيضا x509-limbo ، وهي مجموعة متجه اختبار وتسخير مصممة لتقييم توافق وسلوك العديد من تطبيقات التحقق من صحة مسار X.509 ، بهدف تعزيز أمان نظام Python البيئي والمساهمة في مجتمع المصادر المفتوحة."
    ],
    "commentSummary": [
      "يناقش المقال تطوير سلاسل X.509 وأهمية مجموعات الاختبار المتطورة.",
      "يستكشف الفوائد والتحديات المحتملة لاستخدام Rust في أمن الإنترنت ، لا سيما في منع هجمات رفض الخدمة.",
      "تتم مناقشة تنفيذ برامج Prolog القابلة للتبديل كسياسات في مكتبة pyca / التشفير ، إلى جانب تحديات وقيود إلغاء الشهادة.",
      "تم ذكر حل CRLite من Mozilla واستخدام الشهادات قصيرة العمر كبدائل محتملة للإلغاء.",
      "تغطي المحادثة مواضيع مختلفة بما في ذلك تنفيذ القيود الديناميكية ، وصندوق \"webpki\" ، وبدائل شهادات X.509 ، وقابلية التشغيل البيني لنظام Python البيئي مع C."
    ],
    "points": 201,
    "commentCount": 79,
    "retryCount": 0,
    "time": 1706192428
  },
  {
    "id": 39133086,
    "title": "وجدت دراسة لقاح فيروس الورم الحليمي البشري عدم وجود حالات إصابة بسرطان عنق الرحم لدى النساء اللواتي تم تطعيمهن بالكامل دون سن 14 عاما",
    "originLink": "https://www.statnews.com/2024/01/25/hpv-vaccine-prevent-cervical-cancer-cervarix-gardasil-study/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39133086",
    "commentBody": "",
    "originSummary": [
      "أظهرت دراسة حديثة أجريت في اسكتلندا أن النساء المولودات بين 1988-1996 وتم تطعيمهن بالكامل ضد فيروس الورم الحليمي البشري في سن 12-13 لم يكن لديهن أي حالات من سرطان عنق الرحم.",
      "هذه هي أول دراسة وطنية لتتبع مجموعة من النساء على مدى فترة طويلة ولم تجد أي حالات من سرطان عنق الرحم ، مما يدل على فعالية لقاح فيروس الورم الحليمي البشري.",
      "تسلط الدراسة الضوء على أهمية التطعيم في الوقت المناسب وتشير إلى أنه حتى تلقي اللقاح بين سن 14-22 لا يزال يقلل بشكل كبير من خطر الإصابة بسرطان عنق الرحم. ومع ذلك ، من المهم ملاحظة أن سلالات فيروس الورم الحليمي البشري الأخرى التي لا يغطيها اللقاح يمكن أن تسبب سرطان عنق الرحم. استمرار الفحص للكشف المبكر أمر بالغ الأهمية."
    ],
    "commentSummary": [
      "لقاح فيروس الورم الحليمي البشري فعال في الوقاية من سرطان عنق الرحم والأمراض الأخرى المرتبطة بفيروس الورم الحليمي البشري.",
      "هناك مشكلات تتعلق بالتكلفة ونقص التغطية التأمينية للقاح.",
      "هناك جدل حول فعالية اللقاح للأفراد الذين تزيد أعمارهم عن 45 عاما."
    ],
    "points": 199,
    "commentCount": 117,
    "retryCount": 0,
    "time": 1706208192
  },
  {
    "id": 39130711,
    "title": "برنامج تشغيل مزامنة Windows NT المقترح لتحسينات الأداء الرئيسية في Linux Gaming",
    "originLink": "https://www.gamingonlinux.com/2024/01/proposed-windows-nt-sync-driver-brings-big-wine-proton-performance-improvements/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39130711",
    "commentBody": "",
    "originSummary": [
      "اقترح Zeb Figura من CodeWeavers برنامج تشغيل بدائي لمزامنة Windows NT لتحسين أداء تشغيل تطبيقات وألعاب Windows على Linux باستخدام Wine / Proton.",
      "سيقوم برنامج التشغيل المقترح بتنفيذ أوليات مزامنة NT مباشرة في نواة Linux ، مما يلغي الحاجة إلى RPC ويعزز الأداء.",
      "أظهرت الاختبارات الأولية تحسينات واعدة في الأداء في الألعاب المختلفة ، على الرغم من أن المكاسب المحددة قد تختلف اعتمادا على إعداد الأجهزة والبرامج.",
      "إذا تمت الموافقة على برنامج التشغيل وتنفيذه ، فقد يؤدي ذلك إلى تحسين أداء الألعاب بشكل كبير على Linux ، بما في ذلك Steam Deck القادم مع Wine و Proton."
    ],
    "commentSummary": [
      "تستكشف المقالة طرقا لتحسين أداء الألعاب على Linux ، مثل برامج تشغيل مزامنة Windows NT المقترحة ، ودمج OpenVZ في Linux kernel ، وتنفيذ syscalls لتحسين التوافق مع برامج Windows.",
      "تتم مناقشة خيارات GPU المختلفة ، إلى جانب الإحباطات المتعلقة ببرامج التشغيل والتجارب الخاصة مع وحدات معالجة الرسومات AMD على Linux.",
      "يتناول قسم التعليقات إمكانية حل المشكلات المتعلقة بتشغيل برامج Windows على أنظمة Linux الأساسية ويثير مخاوف بشأن أنظمة الأمان ومكافحة الغش في الألعاب."
    ],
    "points": 199,
    "commentCount": 58,
    "retryCount": 0,
    "time": 1706197359
  },
  {
    "id": 39130945,
    "title": "استكشاف الاختلافات في Merkle CRDTs: DAGs وأشجار البحث",
    "originLink": "https://interjectedfuture.com/crdts-turned-inside-out/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39130945",
    "commentBody": "",
    "originSummary": [
      "تستكشف المقالة نوعين من أنواع البيانات المنسوخة من النزاعات (CRDTs) من Merkle: Merkle-DAG CRDTs و Merkle Search Tree CRDTs.",
      "تستخدم Merkle-DAG CRDTs رسما بيانيا دوريا موجها لتخزين التحديثات المتزامنة وتقليل عرض النطاق الترددي للمزامنة بين النسخ المتماثلة.",
      "تحتفظ Merkle Search Tree CRDTs بمجموعة مرتبة من المفاتيح في بنية شجرة فريدة من نوعها ومتوازنة ذاتيا. يناقش المقال أيضا أوجه التشابه بين Merkle CRDTs و Git وإمكانية تنفيذ CRDTs القابلة للتركيب."
    ],
    "commentSummary": [
      "يتم استخدام أنواع البيانات المنسوخة الخالية من النزاعات (CRDTs) وتنفيذها في الشبكات الاجتماعية اللامركزية والتطبيقات التعاونية.",
      "يكتسب تصميم Merkle Search Tree (MST) اعترافا واعتمادا ، مع تطبيقات مستقلة في Go و Rust.",
      "تناقش المقالة ميزة التوازن الذاتي ل MSTs ، واستخدامها في هياكل مستودع بيانات بروتوكول AT ، وتحسين بنية بيانات Merkle DAG في Dolt."
    ],
    "points": 176,
    "commentCount": 28,
    "retryCount": 0,
    "time": 1706198452
  },
  {
    "id": 39129274,
    "title": "مؤسسة الحدود الإلكترونية و110 منظمات غير حكومية تحذر من أن معاهدة الأمم المتحدة بشأن الجرائم الإلكترونية تهدد حقوق الإنسان والخصوصية",
    "originLink": "https://www.eff.org/deeplinks/2024/01/eff-and-more-100-ngos-set-non-negotiable-redlines-ahead-un-cybercrime-treaty",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39129274",
    "commentBody": "",
    "originSummary": [
      "دخلت مؤسسة الحدود الإلكترونية (EFF) في شراكة مع 110 منظمات غير حكومية للتعبير عن مخاوفها بشأن مسودة معاهدة الأمم المتحدة للجرائم السيبرانية.",
      "وهم يعتقدون أن النسخة الحالية من المعاهدة تفتقر إلى الحماية الكافية لحقوق الإنسان وتحولت إلى أداة للمراقبة.",
      "وتدعو مؤسسة الحدود الإلكترونية الدول إلى رفض المعاهدة ما لم يتم إجراء تغييرات كبيرة، وستكون حاضرة في الجلسة الختامية من 29 يناير إلى 10 فبراير."
    ],
    "commentSummary": [
      "ينظر إلى معاهدة الأمم المتحدة المقترحة بشأن الجرائم الإلكترونية على أنها غير كافية في معالجة الجرائم الإلكترونية بسبب القيود القضائية وعدم الوصول إلى المجرمين.",
      "يقترح فرض غرامات وعقوبات على البلدان المسؤولة عن الجرائم الإلكترونية ولكنها قد تواجه تحديات جيوسياسية ورفضا عاما.",
      "من الصعب وقف الجريمة الإلكترونية في دول العالم الثالث بسبب الدوافع المالية وتعقيد تتبع الأموال وحزم البيانات."
    ],
    "points": 166,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1706188867
  }
]
