[
  {
    "id": 41510252,
    "title": "أنفقنا 20 دولارًا لتحقيق تنفيذ الأوامر عن بُعد (RCE) وأصبحنا عن طريق الخطأ مديري نطاق .mobi",
    "originLink": "https://labs.watchtowr.com/we-spent-20-to-achieve-rce-and-accidentally-became-the-admins-of-mobi/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41510252",
    "commentBody": "",
    "originSummary": [
      "استغل الباحثون الثغرات في عملاء WHOIS واكتشفوا أن نطاق خادم WHOIS القديم لنطاق المستوى الأعلى .MOBI كان متاحًا للشراء، مما أدى إلى سيطرة غير متوقعة على النطاق.",
      "تلقى خادمهم 2.5 مليون استفسار من جهات مختلفة، بما في ذلك الحكومة والجيش وشركات الأمن السيبراني وسلطات الشهادات (CAs)، مما كشف عن مخاطر أمنية كبيرة.",
      "تسلط الحادثة الضوء على نقاط الضعف في نظام WHOIS وعملية التحقق من الشهادات الرقمية، مما يؤكد الحاجة إلى اختبار أمني مستمر واليقظة ضد البنية التحتية القديمة للإنترنت."
    ],
    "commentSummary": [
      "أنفق الباحثون 20 دولارًا للحصول على تنفيذ التعليمات البرمجية عن بُعد (RCE) وأصبحوا عن طريق الخطأ مدراء نطاق المستوى الأعلى .mobi بسبب انتهاء صلاحية النطاق.",
      "الحادثة تؤكد على أهمية عدم السماح بانتهاء صلاحية النطاقات وتقترح ضرورة تنظيم احتكار شركة Verisign للنطاقات.",
      "تؤكد المقالة على هشاشة بروتوكول TLS/SSL والحاجة الملحة للحفاظ على ملكية النطاق لمنع الاختراقات الأمنية."
    ],
    "points": 870,
    "commentCount": 212,
    "retryCount": 0,
    "time": 1726053552
  },
  {
    "id": 41510103,
    "title": "لماذا يعتبر Pave قانونيًا؟",
    "originLink": "https://news.ycombinator.com/item?id=41510103",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41510103",
    "commentBody": "",
    "originSummary": [
      "تساعد شركة Pave، المدعومة من Y Combinator، الشركات الناشئة الأخرى في مجال التعويضات من خلال التكامل مع أنظمة الموارد البشرية والرواتب لتجميع البيانات وتقديم تحليلات لنطاقات التعويض.",
      "هناك مخاوف بشأن ما إذا كان يمكن اعتبار هذه الممارسة تثبيتًا للأجور بشكل غير تنافسي، مشابهة للحالة مع RealPage، مما يثير تساؤلات حول قانونية التواطؤ في الأجور.",
      "تخضع شرعية وآثار نموذج أعمال شركة Pave للتدقيق، حيث إن التواطؤ في الأجور يعد عمومًا غير قانوني."
    ],
    "commentSummary": [
      "تقوم شركة Pave، المدعومة من YC، بتجميع البيانات من أنظمة الموارد البشرية والرواتب لتوفير نطاقات التعويضات، مما يثير تساؤلات حول الممارسات المحتملة المناهضة للمنافسة.",
      "ينتقد النقاد خدمة Pave ويقارنونها بمشاكل تسعير الإيجارات لدى RealPage، بينما يجادل آخرون بأن مشاركة بيانات التعويضات ليست غير قانونية في غياب اتفاقيات صريحة لتثبيت الأجور.",
      "خدمات مماثلة، مثل خدمة \"The Work Number\" من إكويفاكس ورادفورد، موجودة منذ سنوات، لكن المخاوف بشأن الخصوصية وقمع الأجور لا تزال قائمة."
    ],
    "points": 731,
    "commentCount": 297,
    "retryCount": 0,
    "time": 1726051855
  },
  {
    "id": 41505009,
    "title": "مداهمة أخرى للشرطة في ألمانيا",
    "originLink": "https://forum.torproject.org/t/tor-relays-artikel-5-e-v-another-police-raid-in-germany-general-assembly-on-sep-21st-2024/14533",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41505009",
    "commentBody": "",
    "originSummary": [
      "في 16 أغسطس 2024، داهمت الشرطة الألمانية منزل ومكتب منظمة Artikel 5 e.V. بهدف كشف هوية مستخدمي تور، لكنها لم تصادر أي أجهزة.",
      "تخطط منظمة Artikel 5 e.V. للطعن قانونيًا في أمر التفتيش لمنع المداهمات المستقبلية، وتدعو لعقد جمعية عامة في 21 سبتمبر 2024 لمناقشة مستقبل المنظمة.",
      "ستدرس الجمعية خيارات مثل العثور على أعضاء مجلس إدارة جدد، إيقاف عقد الخروج، أو تصفية المنظمة، مع توفر التفاصيل على موقعهم الإلكتروني."
    ],
    "commentSummary": [
      "شارك مستخدم في منتدى مشروع تور تجربته في تشغيل عقد خروج تور لمدة خمس سنوات، حيث تلقى مزود الاستضافة الخاص به ثلاث مذكرات استدعاء من جهات إنفاذ القانون.",
      "كانت الاستدعاءات مرتبطة بحوادث خطيرة، بما في ذلك تهديد بقنبلة، ورسائل بريد إلكتروني تصيدية، وقراصنة من دولة قطر، مما دفع المستخدم إلى إغلاق نقاط الخروج الخاصة به بسبب التوتر من العواقب القانونية المحتملة.",
      "سلطت المناقشة الضوء على التداعيات الأخلاقية والتوازن بين الخصوصية ومنع الجريمة، مع الآمال في استئناف العمليات في المستقبل رغم التحديات من جهات إنفاذ القانون."
    ],
    "points": 485,
    "commentCount": 287,
    "retryCount": 0,
    "time": 1725999169
  },
  {
    "id": 41507879,
    "title": "سحر تحويل الجهد DC-DC (2023)",
    "originLink": "https://lcamtuf.substack.com/p/the-magic-of-dc-dc-voltage-conversion",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41507879",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "تستخدم محولات DC-DC المحاثات لإنشاء طفرات في الجهد، والتي تشحن المكثفات، بطريقة مشابهة لنظام الإشعال في السيارات.",
      "إنها فعالة ولكنها تتطلب تدابير أمان مثل محددات التيار أو الفيوزات لمنع الحرائق.",
      "تشمل الأنواع المحول الرافع، المحول الخافض، والمحول القائم على المحولات، حيث يوفر الأخير عزلًا بين المدخلات والمخرجات لأغراض السلامة؛ وتشمل الاستخدامات العملية تحويل USB 5V إلى 120V للأجهزة القديمة."
    ],
    "points": 322,
    "commentCount": 94,
    "retryCount": 0,
    "time": 1726026815
  },
  {
    "id": 41506157,
    "title": "شاي-1: فك شفرة التفاعلات الجزيئية للحياة",
    "originLink": "https://www.chaidiscovery.com/blog/introducing-chai-1",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41506157",
    "commentBody": "",
    "originSummary": [
      "Chai-1 هو نموذج أساسي متعدد الوسائط جديد لتوقع البنية الجزيئية، يتفوق في مهام اكتشاف الأدوية، وهو متاح مجانًا عبر واجهة ويب للاستخدام التجاري وكبرنامج مكتبي للاستخدام غير التجاري.",
      "يحقق معدل نجاح بنسبة 77% على معيار PoseBusters ويتفوق على AlphaFold-Multimer في طي الملتيمرات بدقة تبلغ 69.8%.",
      "يمكن لـ Chai-1 التنبؤ بهياكل الملتيمر باستخدام تسلسلات فردية ومضاعفة دقة التنبؤ بهيكل الجسم المضاد-المستضد مع تكييف الحاتمة."
    ],
    "commentSummary": [
      "تم إصدار Chai-1، وهو نموذج جديد لفك تشفير التفاعلات الجزيئية، مما أثار اهتمامًا كبيرًا في مجتمع التكنولوجيا.",
      "يدعي النموذج أنه يحسن من أداء AlphaFold، وهو أداة معروفة لتنبؤ هيكل البروتين، لكن التحسينات طفيفة، حيث تحقق زيادة بنسبة 1% فقط في أحد المقاييس.",
      "تم التعبير عن مخاوف بشأن الاستخدام المحتمل لهذه التكنولوجيا في إنشاء أسلحة بيولوجية، على الرغم من أن الخبراء يجادلون بأن تعقيد علم الأحياء الجزيئي يجعل ذلك غير مرجح."
    ],
    "points": 257,
    "commentCount": 62,
    "retryCount": 0,
    "time": 1726006410
  },
  {
    "id": 41507563,
    "title": "ما مدى اقتصادية مطعم تاكو بيل المحلي لديك؟",
    "originLink": "https://taconomical.com",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41507563",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "تدور المناقشة حول أسعار وميزات مواقع تاكو بيل المختلفة، مع تسليط الضوء على تاكو بيل الفريد في باسيفيكا الذي يحتوي على وسائل راحة مثل المدفأة والمارغريتا.",
      "يُعتبر متجر تاكو بيل/كنتاكي المشترك في منطقة كوين آن السفلى في سياتل أغلى متجر تاكو بيل في البلاد، حيث يشارك المستخدمون تجاربهم وإحباطاتهم مع تطبيق تاكو بيل على الهواتف المحمولة.",
      "تتعرض تطبيق تاكو بيل للانتقادات بسبب ممارسات جمع البيانات، حيث يناقش المستخدمون ضرورته مقارنة بطرق الطلب التقليدية، ودوره في التمييز السعري والتسويق المستهدف."
    ],
    "points": 233,
    "commentCount": 254,
    "retryCount": 0,
    "time": 1726022367
  },
  {
    "id": 41505389,
    "title": "لماذا لا تعليقات",
    "originLink": "https://buttondown.com/hillelwayne/archive/why-not-comments/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41505389",
    "commentBody": "",
    "originSummary": [
      "تم إصدار \"المنطق للمبرمجين v0.3\"، مع التركيز على تحسين تنسيق الكتاب.",
      "يؤكد الإصدار على أهمية التعليقات في الكود، خاصة لشرح \"لماذا\" القرارات والمقايضات، التي لا يمكن دائمًا توثيقها ذاتيًا من خلال أسماء الدوال أو المتغيرات.",
      "يتم تقديم مثال حيث يوضح تعليق اختيار طريقة غير فعالة لاستبدال الرموز الرياضية برموز يونيكود، مسلطًا الضوء على المقايضة وإمكانية التحسين في المستقبل."
    ],
    "commentSummary": [
      "يجب أن تركز التعليقات في الشيفرة على شرح \"لماذا\" و\"لماذا لا\" للمساعدة في الفهم المستقبلي، خاصة في قواعد الشيفرة الكبيرة والمعقدة.",
      "تُعتبر التعليقات الإلزامية للوظائف الواضحة مضيعة ويمكن أن تؤدي إلى تجاهل التعليقات تمامًا.",
      "بينما يفضل البعض الأسماء الطويلة للدوال أو رسائل الالتزام، يجد المؤلف أن التعليقات ضرورية للوضوح والصيانة وتوثيق القرارات والمفاضلات."
    ],
    "points": 225,
    "commentCount": 229,
    "retryCount": 0,
    "time": 1726001537
  },
  {
    "id": 41505670,
    "title": "حصل جهاز فليبر زيرو على تحديث رئيسي للبرامج الثابتة، يمكنه الآن التنصت على أجهزة الووكي توكي",
    "originLink": "https://www.pcmag.com/news/flipper-zero-gets-major-firmware-update",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41505670",
    "commentBody": "",
    "originSummary": [
      "أصدرت شركة Flipper تحديثًا رئيسيًا للبرامج الثابتة 1.0 لأداة Flipper Zero متعددة الاستخدامات، مما يعزز بشكل كبير من وظائفها وتجربة المستخدم.",
      "تشمل التحسينات الرئيسية مضاعفة سرعات نقل البيانات عبر البلوتوث من أجهزة الأندرويد، وزيادة سرعة تثبيت برامج البلوتوث الثابتة بنسبة 40%، ومحرك NFC مُجدَّد يدعم المزيد من أنواع البطاقات وقراءة البيانات بشكل أسرع.",
      "التحديث يقدم أيضًا ميزات جديدة مثل القدرة على التنصت على صوت أجهزة الووكي توكي التناظرية، فك تشفير 89 بروتوكولًا إذاعيًا، تشغيل التطبيقات مباشرة من بطاقات microSD، وإطالة عمر البطارية إلى شهر في وضع الطاقة المنخفضة."
    ],
    "commentSummary": [
      "جهاز فليبر زيرو، الذي تم تمويله عبر التمويل الجماعي، قد حصل على تحديث كبير للبرامج الثابتة يمكّنه من التنصت على أجهزة الووكي توكي، مما يفي بوعده بتقديم تحسينات مستمرة للبرامج.",
      "يتميز الجهاز بمرونته وواجهة المستخدم السهلة، مما يجعله مناسبًا لمهام الترددات الراديوية المختلفة، على عكس أجهزة الراديو المعرفة بالبرمجيات التقليدية (SDRs) التي تتطلب معالجات أكثر قوة.",
      "أثار التحديث اهتمامًا بسبب قدرة Flipper Zero على أداء وظائف متعددة تتجاوز التنصت، مما يجعله أداة شاملة لعشاق الترددات الراديوية والمحترفين."
    ],
    "points": 216,
    "commentCount": 46,
    "retryCount": 0,
    "time": 1726002945
  },
  {
    "id": 41504885,
    "title": "دليل تعليمي حول نماذج الانتشار للتصوير والرؤية",
    "originLink": "https://arxiv.org/abs/2403.18103",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41504885",
    "commentBody": "",
    "originSummary": [
      "يركز الدرس التعليمي الذي قدمه ستانلي هـ. تشان على نماذج الانتشار، التي تعتبر محورية في الأدوات التوليدية لتطبيقات تحويل النص إلى صورة والنص إلى فيديو.",
      "يستهدف طلاب البكالوريوس والدراسات العليا المهتمين بتعلم الآلة والرؤية الحاسوبية، حيث يوفر المعرفة الأساسية للبحث أو التطبيقات العملية.",
      "تم تحديث الدليل مرتين، مع تقديم النسخة الأحدث في 6 سبتمبر 2024، وهي متاحة على arXiv لمزيد من القراءة."
    ],
    "commentSummary": [
      "تم تسليط الضوء على درس تعليمي حول نماذج الانتشار للتصوير والرؤية، مما أثار اهتمام عشاق التكنولوجيا والباحثين.",
      "تُشارك موارد ومناقشات متنوعة، بما في ذلك دروس أندريه كارباتي على يوتيوب، وكتاب سيباستيان راشكا الجديد حول بناء نماذج اللغة الكبيرة، وسلسلة فيديوهات 3Blue1Brown عن المحولات.",
      "يركز الدرس التعليمي على الأساس الرياضي لنماذج الانتشار، مع تقديم اقتراحات لمصادر أكثر سهولة مثل دورة Hugging Face والمقالات التدوينية لفهم أفضل."
    ],
    "points": 208,
    "commentCount": 15,
    "retryCount": 0,
    "time": 1725998379
  },
  {
    "id": 41504832,
    "title": "Git Bash هو الصدفة المفضلة لدي على نظام ويندوز",
    "originLink": "https://www.ii.com/git-bash-is-my-preferred-windows-shell/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41504832",
    "commentBody": "",
    "originSummary": [
      "تم تسليط الضوء على Git Bash كقشرة مفضلة لنظام Windows، حيث توفر وظائف سطر الأوامر الشبيهة بنظام Unix داخل بيئة Windows.",
      "تشمل المزايا الرئيسية الألفة مع أوامر bash، وسهولة التثبيت، والبصمة الصغيرة، والتكامل مع مستكشف ملفات Windows.",
      "يدعم Git Bash العديد من الأوامر والنصوص البرمجية الشبيهة بنظام Unix، مما يجعله أداة متعددة الاستخدامات للمطورين الذين يعملون في بيئة Windows."
    ],
    "commentSummary": [
      "يفضل العديد من مستخدمي ويندوز استخدام Git Bash بسبب تشابهه مع أوامر يونكس، مما يجعله خيارًا مريحًا لأولئك الذين لديهم خبرة في لينكس.",
      "بينما يتم الإشادة بـ PowerShell لمعالجته المنظمة للبيانات وواجهة برمجة تطبيقات .NET، فإنه غالبًا ما يُنتقد بسبب الإسهاب ومشاكل الترميز.",
      "توجد بدائل مثل WSL وMSYS2 وBusybox لنظام التشغيل ويندوز، لكن Git Bash لا يزال شائعًا بسبب بساطته وسهولة استخدامه."
    ],
    "points": 193,
    "commentCount": 158,
    "retryCount": 0,
    "time": 1725998078
  },
  {
    "id": 41505266,
    "title": "بعضنا يحب مراجعة الكود باستخدام \"interdiff\"",
    "originLink": "https://gist.github.com/thoughtpolice/9c45287550a56b2047c6311fbadebed2",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41505266",
    "commentBody": "",
    "originSummary": [
      "مراجعة Gerrit Code Review هي أداة مفتوحة المصدر متوافقة مع مستودعات Git، تسهل كتابة التصحيحات وتقديمها وتلقي الملاحظات وإجراء الإصلاحات.",
      "يمكن أن تؤدي مراجعات الكود التقليدية على GitHub إلى \"حساء الفروق\"، مما يعقد سجلات الالتزام ويجعل الأدوات مثل git blame وgit bisect أقل فعالية.",
      "طريقة المراجعة \"interdiff\"، التي تنشر إصدارات جديدة من الالتزامات الأصلية، تحافظ على سجلات الالتزامات بشكل أنظف وتبسط عملية المراجعة باستخدام أدوات مثل git range-diff."
    ],
    "commentSummary": [
      "تسلط المناقشة الضوء على استخدام سير عمل مراجعة الكود \"interdiff\" على GitHub، والذي يسمح للمراجعين برؤية الفروقات مع تضمين الملاحظات دون كسر `git blame` و `git bisect`.",
      "يتضمن سير العمل استخدام `git commit --fixup`، `git rebase --interactive --autosquash`، و `git push --force-with-lease` لإدارة ودمج التغييرات بكفاءة.",
      "تؤكد المحادثة على محدوديات تجربة المستخدم في GitHub في التعامل مع الميزات المتقدمة لـ Git مثل إعادة التأسيس والدمج التلقائي، وتقترح أن الأدوات أو سير العمل الأفضل يمكن أن تحسن عملية مراجعة الكود."
    ],
    "points": 190,
    "commentCount": 132,
    "retryCount": 0,
    "time": 1726000791
  },
  {
    "id": 41505593,
    "title": "محاكي اليانصيب (2023)",
    "originLink": "https://perthirtysix.com/tool/lottery-simulator",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41505593",
    "commentBody": "",
    "originSummary": [
      "يتيح محاكي اليانصيب PerThirtySix للمستخدمين استكشاف احتمالات اليانصيب ومحاكاة آلاف التذاكر في ثوانٍ.",
      "يمكن للمستخدمين إعداد محاكاة لليانصيب الأمريكي الحالي مثل ميغا مليونز وباوربول أو إنشاء قواعد مخصصة، بما في ذلك تكلفة التذكرة واحتمالية التعادل.",
      "توفر الأداة تصورات للعوائد وتتضمن افتراضات مبسطة مثل وجود فائز واحد بالجائزة الكبرى وتجاهل الضرائب."
    ],
    "commentSummary": [
      "تم إنشاء أداة جديدة لمحاكاة اليانصيب، مما أثار اهتمامًا كبيرًا وردود فعل من المستخدمين على موقع Hacker News.",
      "يقترح المستخدمون تحسينات متنوعة، مثل خيار محاكاة أسرع، واختيار أرقام عشوائية لكل سحب، وتتبع عدد الأشخاص الذين فازوا بالجائزة الكبرى.",
      "تسلط الأداة الضوء على احتمالات العوائد الضعيفة في اليانصيب، حتى عند استخدام مجموعات أرقام مخصصة، وتحفز النقاشات حول الاحتمالات، والقيمة المتوقعة (EV)، وتأثير حجم الجائزة الكبرى على الأرباح."
    ],
    "points": 188,
    "commentCount": 87,
    "retryCount": 0,
    "time": 1726002544
  },
  {
    "id": 41508040,
    "title": "أتمنى لو لم أفوت الإنترنت في التسعينيات والألفينيات",
    "originLink": "https://rohan.ga/blog/early-internet/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41508040",
    "commentBody": "",
    "originSummary": [
      "يعبر شاب يبلغ من العمر 18 عامًا عن الحنين إلى الإنترنت في فترة التسعينيات والألفينيات، مقارنًا إياها بمشهد وسائل التواصل الاجتماعي الموجهة نحو الربح في الوقت الحالي.",
      "ينتقد المؤلف المنصات الحديثة مثل إنستغرام وتيك توك لترويجها للسطحية والشعور بالخوف من فوات الشيء (FOMO)، ويحن إلى الإبداع والفردية التي كانت تتميز بها المدونات الشخصية وMySpace.",
      "يذكرون مجتمعًا متخصصًا على Neocities يقدر الويب القديم، لكنهم يشيرون إلى أن معظم الأقران يجدون مثل هذه الاهتمامات غير عادية."
    ],
    "commentSummary": [
      "يتذكر المؤلف الإنترنت في فترة التسعينيات والألفينيات، مسلطًا الضوء على طاقته الهواة، وشبه المجهولية، والشعور المضاد للثقافة، والتي أثرت بشكل كبير على مسيرته المهنية في صناعة الألعاب.",
      "يعبرون عن الحنين إلى شعور الدهشة والمجتمع في الإنترنت المبكر، مقارنين إياه بالويب التجاري والموجه بالخوارزميات اليوم.",
      "على الرغم من التقدم التكنولوجي وزيادة الوصول، يشعر المؤلف وآخرون أن القيمة الأصلية للإنترنت قد تضاءلت بسبب انتشاره التجاري."
    ],
    "points": 183,
    "commentCount": 229,
    "retryCount": 0,
    "time": 1726029143
  },
  {
    "id": 41508752,
    "title": "مقياس التيار لساعة آبل",
    "originLink": "https://github.com/jp3141/AppleWatchAmmeter",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41508752",
    "commentBody": "",
    "originSummary": [
      "يمكن استخدام ساعة Apple Watch Series 5 والإصدارات الأحدث كأميتر لقياس التيارات المستمرة من خلال الاستفادة من مقياس المغناطيسية المدمج فيها.",
      "عن طريق لف ملف من السلك حول الساعة، يمكن اكتشاف وقياس المجال المغناطيسي الناتج عن التيارات القريبة، بحساسية تقارب 100 ميكروتسلا/أمبير.",
      "يمكن استخدام تطبيق مثل 'Sensor-App' للمعايرة وعرض التيار بالأمبير، مما يسمح بالكشف عن تغييرات التيار الصغيرة التي تصل إلى 10 مللي أمبير."
    ],
    "commentSummary": [
      "تدور المناقشة حول مفهوم استخدام الأجهزة الذكية، مثل ساعة آبل، لقياس التيار الكهربائي، مع الإشارة إلى تجارب البيوهكينج اليدوية والتجارب التاريخية التي تتضمن مغناطيسات الأرض النادرة.",
      "يذكر المشاركون طرقًا وأدوات متنوعة، مثل مستشعرات تأثير هول وتطبيقات الهواتف الذكية مثل Phyphox، لقياس التيار والجهد، مما يبرز الطبيعة الابتكارية ولكن الخطرة لهذه التجارب.",
      "تتضمن المحادثة تعليقات فكاهية وتكهنات حول مدى عملية وأمان مثل هذه التقنيات البيولوجية، مما يعكس مزيجًا من الفضول والتشكيك."
    ],
    "points": 172,
    "commentCount": 24,
    "retryCount": 0,
    "time": 1726038061
  },
  {
    "id": 41509713,
    "title": "Radicle 1.0 – بديل محلي أول، نظير إلى نظير لـ GitHub",
    "originLink": "https://radicle.xyz/2024/09/10/radicle-1.0.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41509713",
    "commentBody": "",
    "originSummary": [
      "تم إطلاق Radicle 1.0، وهي حزمة تعاون على الشيفرة تعتمد على نظير إلى نظير وتعمل محليًا، مبنية على Git، رسميًا بعد خمسة أشهر من الملاحظات و17 إصدارًا مرشحًا.",
      "تشمل الميزات الرئيسية بروتوكول الهمس والمزامنة من نظير إلى نظير، التفاعلات الاجتماعية (المشكلات، التصحيحات، مراجعات الكود)، المصادقة الآمنة، واجهة سطر أوامر وواجهة ويب بديهية، ميزات الخصوصية، والبناءات الموقعة القابلة لإعادة الإنتاج.",
      "تشمل الخطط المستقبلية لـ Radicle CI/CD الأصلي، وواجهة مستخدم طرفية، ومراجعة متقدمة للكود، والمزيد، مع تكاملات متزايدة للنظام البيئي مثل إضافات VS Code وJetBrains."
    ],
    "commentSummary": [
      "تم تقديم Radicle 1.0 كبديل محلي أول ونظير إلى نظير (P2P) لـ GitHub، مما أثار مناقشات حول تفاصيل التثبيت والمقارنات مع أدوات مثل Forgejo وHomebrew.",
      "يناقش المستخدمون عملية وفلسفة التعاون في كتابة الأكواد بشكل لامركزي عبر Radicle، حيث يفضل البعض إدارة المهام بشكل أبسط باستخدام مستودعات git على الآلات الافتراضية (VMs).",
      "تتناول المحادثة أيضًا تمويل Radicle، والتحسينات المحتملة، والتكامل مع أدوات مثل ForgeFed وNOSTR."
    ],
    "points": 168,
    "commentCount": 54,
    "retryCount": 0,
    "time": 1726047638
  }
]
