[
  {
    "id": 36920622,
    "title": "Jos haluamme siirtyä kävelyyn, meidän on asetettava ihmisarvo etusijalle.",
    "originLink": "https://streets.mn/2023/07/19/if-we-want-a-shift-to-walking-we-need-to-prioritize-dignity/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36920622",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [],
    "points": 516,
    "commentCount": 560,
    "retryCount": 0,
    "time": 1690640703
  },
  {
    "id": 36918655,
    "title": "IRC on ainoa käyttökelpoinen chat-protokolla (2022).",
    "originLink": "https://koshka.love/babel/irc-forever.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36918655",
    "commentBody": "",
    "originSummary": [
      "Kirjoittaja kehuu IRC:n hajautettua luonnetta ja yksityisyyttä Discordiin verrattuna.",
      "Discordia on kritisoitu sen omistus- ja valvontakäytännöistä.",
      "Kirjoittaja suosittelee sen sijaan IRC:n käyttöä ja mainostaa omaa IRC-verkkoaan.",
      "Keskustellaan IRC:n käytön eduista viestinnässä.",
      "Comic Chat -tapahtumasta ilmoitetaan.",
      "Vapaiden ja avointen protokollien käytön tärkeyttä vanhan internetin säilyttämiseksi korostetaan."
    ],
    "commentSummary": [
      "Keskustelussa verrataan IRC:tä ja Discordia ja korostetaan IRC:n rajoituksia ja haittoja.",
      "Keskustelualustojen kirjaamis- ja hakuominaisuuksien merkitystä korostetaan.",
      "Discordia kritisoidaan sen rajoituksista kirjautumis- ja hakutoiminnoissa.",
      "IRC:n ja Discordin etuja ja haittoja tarkastellaan, mukaan lukien yksinkertaisuus, haettavuus, yksityisyys ja yrityksen valvonta.",
      "Keskustellaan IRC-puskurien ja vaihtoehtoisten viestintävälineiden käytöstä.",
      "Discordin käytön riskejä arkaluonteisissa keskusteluissa käsitellään.",
      "IRC:tä ehdotetaan nykyaikaistettavaksi ja lisättäväksi ominaisuuksia.",
      "Muita viestintäalustoja ja -protokollia, kuten Matrix ja XMPP, mainitaan mahdollisina vaihtoehtoina."
    ],
    "points": 323,
    "commentCount": 388,
    "retryCount": 0,
    "time": 1690625538
  },
  {
    "id": 36920566,
    "title": "Kriittinen teoria radikalisoi lukiokeskustelun",
    "originLink": "https://www.slowboring.com/p/how-critical-theory-is-radicalizing",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36920566",
    "commentBody": "",
    "originSummary": [
      "Artikkelissa käsitellään kriittisen teorian, erityisesti kritiikin, lisääntyvää käyttöä lukioiden väittelymuodoissa.",
      "Tuomarit ja väittelijät suosivat näitä argumentteja, mikä vaikuttaa toimintaan.",
      "On esitetty huoli siitä, että radikaalien ideologioiden edistämisellä keskustelussa voi olla kielteisiä seurauksia.",
      "Lisäksi tarkastellaan näiden argumenttien vaikutusta opiskelijoiden poliittisiin näkemyksiin.",
      "Artikkelissa esitetään historiallinen näkökulma väittelymuotoihin, ja se sisältää entisten väittelijöiden henkilökohtaisia ajatuksia."
    ],
    "commentSummary": [
      "Artikkelissa tarkastellaan kriittisen teorian roolia lukion väittelyssä ja korostetaan retoriikan ja eri näkökulmien ymmärtämisen merkitystä.",
      "Siinä käsitellään väittelymuodon vaikutusta kriittisen ajattelun taitoihin ja korostetaan sen rajoituksia.",
      "Lisäksi tarkastellaan kriittisen teorian vaikutusta keskusteluun ja arvosteluprosessin puutteita.",
      "Keskustellaan väittelyn tehokkuudesta oppimisvälineenä ja erilaisten näkökulmien arvosta.",
      "Keskustelut antavat tasapainoisen kuvan lukion väittelyn hyödyistä ja haitoista sekä sen vaikutuksesta oppilaiden taitoihin ja tietoihin."
    ],
    "points": 287,
    "commentCount": 370,
    "retryCount": 0,
    "time": 1690640309
  },
  {
    "id": 36919659,
    "title": "Mitä Vivaldi Socialille tapahtui?",
    "originLink": "https://thomasp.vivaldi.net/2023/07/28/what-happened-to-vivaldi-social/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36919659",
    "commentBody": "",
    "originSummary": [
      "Vivaldi Social Mastodon -instanssissa ilmeni virhe tai mahdollinen hyökkäys, joka johti 198 käyttäjätilin poistamiseen.",
      "Tilit yhdistettiin yhdeksi tiliksi eri Mastodon-instanssissa tietokannan replikointiviiveen vuoksi.",
      "Vivaldin sisäinen tietoturvaryhmä tutki ongelmaa ja kehitti korjauksen ongelman korjaamiseksi.",
      "Verkkosivusto palautettiin, ja ongelma ratkaistiin kollegoiden ja Mastodonin kehittäjien avulla.",
      "Joitakin pieniä ongelmia oli edelleen, mutta korjauksia ja varoituksia annettiin vastaavien tapausten estämiseksi tulevaisuudessa.",
      "Artikkelissa käsitellään myös erilaisia verkkoteknologiaan liittyviä aiheita, kuten yksityisyyden suojaa, käytännesääntöjä, käyttöehtoja ja yhteisöä."
    ],
    "commentSummary": [
      "Keskustelut kattavat monenlaisia aiheita, kuten tietokannat, ohjelmointikäytännöt, järjestelmäsuunnittelu, kirjaaminen ja mittarit sekä hajautettu sosiaalisen median alusta Mastodon.",
      "Käsiteltäviä aiheita ovat muun muassa NULL-arvojen käyttö, virheenkäsittely, suorituskyvyn optimointi sekä lokien ja mittareiden merkitys virheiden etsinnässä ja vianmäärityksessä.",
      "Lisäksi keskustellaan Mastodonin vakaudesta ja suosiosta verrattuna Twitterin kaltaisiin keskitettyihin alustoihin."
    ],
    "points": 283,
    "commentCount": 76,
    "retryCount": 0,
    "time": 1690634059
  },
  {
    "id": 36925019,
    "title": "Big Tobacco tiesi savukkeiden sisältämän radioaktiivisen Po210:n aiheuttavan syöpäriskin, mutta vaikeni siitä.",
    "originLink": "https://www.uclahealth.org/news/big-tobacco-knew-radioactive-particles-in-cigarettes",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36925019",
    "commentBody": "",
    "originSummary": [
      "UCLA:n tutkijat havaitsivat, että tupakkayhtiöt olivat tietoisia radioaktiivisten hiukkasten esiintymisestä tupakansavussa vuodesta 1959 lähtien, mutta eivät halunneet paljastaa tätä tietoa yleisölle.",
      "Teollisuuden sisäiset asiakirjat osoittavat, että tupakkateollisuus tutki näiden hiukkasten syöpää aiheuttavia ominaisuuksia jo 1960-luvulla.",
      "Tutkimuksessa todettiin, että tupakkayhtiöt eivät ottaneet käyttöön tekniikkaa, jolla nämä hiukkaset olisi voitu poistaa savukkeista.",
      "Tutkijat suosittelevat, että FDA keskittyisi alfahiukkasten poistamiseen tupakkatuotteista kansanterveyden suojelemiseksi."
    ],
    "commentSummary": [
      "Keskusteluissa käsitellään tupakan käytön ja riippuvuuden terveysriskejä, eettisiä kysymyksiä ja yhteiskunnallisia vaikutuksia.",
      "Osallistujat keskustelevat tarpeesta ryhtyä toimiin tupakkayhtiöitä vastaan ja yritysten roolista yhteiskunnassa.",
      "Keskustelua käydään myös yksilöiden vastuusta boikotoida haitallisia tuotteita.",
      "Toinen keskustelunaihe on politiikan monimutkaisuuden selvittäminen tupakan käytön ja riippuvuuden torjunnassa.",
      "Keskustellaan tupakan riippuvuutta aiheuttavasta luonteesta ja sen vertailusta opioidiriippuvuuteen.",
      "Mielipiteet sääntelyn tasosta ja henkilökohtaisesta vastuusta näiden kysymysten käsittelyssä vaihtelevat."
    ],
    "points": 264,
    "commentCount": 254,
    "retryCount": 0,
    "time": 1690667265
  },
  {
    "id": 36926852,
    "title": "GNU Boot lähetti lopettamisvaatimuksen Librebootille.",
    "originLink": "https://libreboot.org/news/gnuboot.html#gnu-boot-cease-and-desist-email",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36926852",
    "commentBody": "",
    "originSummary": [
      "GNU Boot on GNU-projektin Libreboot-projektin haarautuma.",
      "Se luotiin erimielisyyden vuoksi Librebootin Binary Blob Reduction Policy -käytännön kanssa.",
      "Kirjoittaja ilmaisee tukensa GNU Bootille ja luo jopa epävirallisen julkaisun projektille.",
      "He kuitenkin kritisoivat GNU Bootia siitä, että se käyttää vanhentunutta koodia eikä sillä ole verkkosivustoa.",
      "Kirjoittaja sai GNU Bootilta sähköpostiviestin, jossa hän sai kieltävän viestin tavaramerkin loukkaamisesta, vaikka he yrittivät auttaa projektia.",
      "Kirjoittaja toteaa lopuksi olevansa valmis lähettämään korjauksia ja tukemaan GNU Bootia, vaikka ei itse käytä tai suosittele sitä."
    ],
    "commentSummary": [
      "GNU Boot- ja Libreboot-projektit kiistelevät Libreboot-nimen käytöstä.",
      "Osapuolten välistä viestintää on arvosteltu epäammattimaiseksi, ja niitä on syytetty nimien varastamisesta ja epäeettisestä käytöksestä.",
      "Kulttuuri- ja kielierot ovat osaltaan vaikuttaneet erimielisyyksien huonoon käsittelyyn.",
      "Keskustelu herättää kysymyksiä tavaramerkkien suojan merkityksestä ja termin \"epävirallinen\" käytöstä.",
      "Avoimen lähdekoodin yhteisö on turhautunut draamaan ja ristiriitoihin."
    ],
    "points": 242,
    "commentCount": 160,
    "retryCount": 0,
    "time": 1690681225
  },
  {
    "id": 36921446,
    "title": "Funktiot ovat vektoreita",
    "originLink": "https://thenumb.at/Functions-are-Vectors/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36921446",
    "commentBody": "",
    "originSummary": [
      "Funktiot voidaan esittää vektoreina ja analysoida lineaarialgebran työkaluilla.",
      "Artikkelissa tarkastellaan erilaisia vektorityyppejä, vektoriavaruuksia ja funktioiden standardipohjia.",
      "Ominaistoimintoja, diagonalisaatiota, sisäisiä tuotteita ja Laplaciaania käsitellään suhteessa funktioihin vektoreina.",
      "Näiden käsitteiden sovelluksia ovat muun muassa Fourier-sarjat, kuvien pakkaaminen, tietokonegrafiikka ja geometrian käsittely."
    ],
    "commentSummary": [
      "Matemaattisessa analyysissä ja ohjausteoriassa funktioita voidaan käsitellä vektoreina.",
      "Sisäisen tuotteen tarpeellisuudesta funktionaalisessa analyysissä on käyty historiallista kehitystä ja jatkuvaa keskustelua.",
      "Tällä alalla tarkastellaan erityyppisiä kartoituksia ja ominaisuuksia.",
      "Funktioilla on määritelty määritelmä ja ominaisuuksia, ja niillä voi olla useita arvoja.",
      "Vektoreiden avulla voidaan ilmaista funktioita ja niiden ominaisuuksia.",
      "Abstraktit vektoriavaruudet, bijektiiviset funktiot ja Fourier-muunnos ovat olennaisia käsitteitä.",
      "Toiminnoilla on sovelluksia myös big data -analyysissä.",
      "Käsitellään kilogrammojen ja joulejen vaihdettavuutta, pullo- ja pullo-periaatetta sekä toimintojen ja tietokoneohjelmoinnin välistä suhdetta.",
      "Matematiikan eri tieteenaloilla on erilaisia näkökulmia funktioiden luonteeseen ja niiden yhteyksiin vektoreihin."
    ],
    "points": 237,
    "commentCount": 80,
    "retryCount": 0,
    "time": 1690646091
  },
  {
    "id": 36921552,
    "title": "Gzip voittaa BERTin? Osa 2: tietokokonaisuuteen liittyvät ongelmat, nopeuden parantaminen ja tulokset",
    "originLink": "https://kenschutte.com/gzip-knn-paper2/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36921552",
    "commentBody": "",
    "originSummary": [
      "Artikkelissa päivitetään aiempi analyysi artikkelista, jossa ehdotetaan gzip- ja kNN-menetelmiä tekstiluokitteluun.",
      "Päivityksessä käsitellään tietokokonaisuuteen liittyviä kysymyksiä, nopeuden parannuksia ja esitetään uusia tuloksia.",
      "Edellinen analyysi osoitti, että asiakirjassa käytetty luokittelumenetelmä oli epäoikeudenmukainen.",
      "Kirjoittaja tutkii zlib-pakkauksen toteutusta Pythonissa ja ehdottaa tapoja parantaa suorituskykyä.",
      "Huolimatta alkuperäisen artikkelin tulosten tarkkuuteen liittyvistä huolenaiheista kirjoittaja tunnustaa tekstinpakkaustekniikoiden potentiaalin tekstin luokittelussa."
    ],
    "commentSummary": [
      "Artikkelissa arvostellaan artikkelia, jossa väitettiin virheellisesti, että gzip-pakkaus on tarkempi kuin BERT-kielimalli tekstiluokittelussa.",
      "Paperin toteutus kyseenalaistetaan ja sen harhaanjohtavaa lähestymistapaa puolustetaan.",
      "Vastuuvelvollisuuden puute ja julkaisupaineet akateemisessa maailmassa korostuvat.",
      "Pakkausalgoritmeja pidetään kiinnostavina tekstin luokittelussa, mutta ne eivät välttämättä sovellu monimutkaisiin NLP-tehtäviin.",
      "Verkkoalustan keskusteluketju kattaa monenlaisia kieli-, viestintä- ja koneoppimisen aiheita.",
      "Keskustelua käydään muun muassa runouden pakkaamisesta, tekstin ja samankaltaisuuden sulautuksista, tietojenkäsittelyn nopeuden parantamisesta, tutkimuksen eettisistä standardeista, tietokokonaisuuksien validoinnista ja HuggingFace-ohjelman roolista tietokokonaisuuksien arvioinnissa.",
      "ZSTD:tä ehdotetaan paremmaksi vaihtoehdoksi GZIP:lle ja bzip2:lle pakkaustarkoituksiin."
    ],
    "points": 229,
    "commentCount": 46,
    "retryCount": 0,
    "time": 1690646655
  },
  {
    "id": 36922517,
    "title": "Yhdysvaltain armeijan johtamisen käsikirja (1990) [pdf]",
    "originLink": "https://armyoe.files.wordpress.com/2018/03/1990-fm-22-100.pdf",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36922517",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [],
    "points": 201,
    "commentCount": 107,
    "retryCount": 0,
    "time": 1690651962
  },
  {
    "id": 36921808,
    "title": "Universaalit ja siirrettävät vastahyökkäykset yhdenmukaistettuja kielimalleja vastaan",
    "originLink": "https://llm-attacks.org/zou2023universal.pdf",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36921808",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [],
    "points": 196,
    "commentCount": 149,
    "retryCount": 0,
    "time": 1690648081
  }
]
