[
  {
    "id": 36920622,
    "title": "Ak chceme prejsť na chôdzu, musíme uprednostniť dôstojnosť",
    "originLink": "https://streets.mn/2023/07/19/if-we-want-a-shift-to-walking-we-need-to-prioritize-dignity/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36920622",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [],
    "points": 516,
    "commentCount": 560,
    "retryCount": 0,
    "time": 1690640703
  },
  {
    "id": 36918655,
    "title": "IRC je jediný použiteľný chatovací protokol (2022)",
    "originLink": "https://koshka.love/babel/irc-forever.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36918655",
    "commentBody": "",
    "originSummary": [
      "Autor chváli IRC pre jeho decentralizovaný charakter a súkromie v porovnaní s Discordom.",
      "Spoločnosť Discord je kritizovaná za svoje vlastnícke a sledovacie praktiky.",
      "Autor namiesto toho odporúča používať IRC a propaguje svoju vlastnú sieť IRC.",
      "Diskutuje sa o výhodách používania IRC na komunikáciu.",
      "Je vydané oznámenie o podujatí Comic Chat.",
      "Zdôrazňuje sa význam používania slobodných a otvorených protokolov na zachovanie starého internetu."
    ],
    "commentSummary": [
      "V diskusii sa porovnáva IRC a Discord a zdôrazňujú sa obmedzenia a nevýhody IRC.",
      "Zdôrazňuje sa dôležitosť možnosti zaznamenávania a vyhľadávania v chatovacích platformách.",
      "Služba Discord je kritizovaná pre svoje obmedzenia v oblasti protokolovania a vyhľadávania.",
      "Skúmajú sa výhody a nevýhody IRC a Discordu vrátane faktorov, ako je jednoduchosť, možnosť vyhľadávania, súkromie a kontrola spoločnosti.",
      "Diskutuje sa o používaní vyhadzovačov IRC a alternatívnych komunikačných nástrojov.",
      "Riešia sa riziká používania služby Discord na citlivé diskusie.",
      "Existuje návrh na modernizáciu a pridanie funkcií IRC.",
      "Ako potenciálne alternatívy sa uvádzajú iné komunikačné platformy a protokoly, napríklad Matrix a XMPP."
    ],
    "points": 323,
    "commentCount": 388,
    "retryCount": 0,
    "time": 1690625538
  },
  {
    "id": 36920566,
    "title": "Kritická teória radikalizuje stredoškolskú debatu",
    "originLink": "https://www.slowboring.com/p/how-critical-theory-is-radicalizing",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36920566",
    "commentBody": "",
    "originSummary": [
      "Článok pojednáva o čoraz častejšom využívaní kritickej teórie, konkrétne kritík, v debatných formátoch na stredných školách.",
      "Sudcovia a debatéri dávajú prednosť týmto argumentom, čo ovplyvňuje túto činnosť.",
      "Vyjadrujú sa obavy z možných negatívnych dôsledkov propagácie radikálnych ideológií v diskusiách.",
      "Skúma sa aj vplyv týchto argumentov na politické názory študentov.",
      "Článok poskytuje historický pohľad na formáty debát a obsahuje osobné úvahy bývalých debatérov."
    ],
    "commentSummary": [
      "Článok skúma úlohu kritickej teórie v stredoškolskej debate a zdôrazňuje význam rétoriky a pochopenia rôznych perspektív.",
      "Diskutuje sa v nej o vplyve formátu diskusie na zručnosti kritického myslenia a zdôrazňujú sa jeho obmedzenia.",
      "Skúma sa aj vplyv kritickej teórie na diskusiu a nedostatky v procese posudzovania.",
      "Diskutuje sa o účinnosti diskusie ako nástroja vzdelávania a o hodnote rôznych perspektív.",
      "Diskusie poskytujú vyvážený pohľad na výhody a nevýhody stredoškolskej debaty a jej vplyv na zručnosti a vedomosti študentov."
    ],
    "points": 287,
    "commentCount": 370,
    "retryCount": 0,
    "time": 1690640309
  },
  {
    "id": 36919659,
    "title": "Čo sa stalo so spoločnosťou Vivaldi Social?",
    "originLink": "https://thomasp.vivaldi.net/2023/07/28/what-happened-to-vivaldi-social/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36919659",
    "commentBody": "",
    "originSummary": [
      "V inštancii Vivaldi Social Mastodon sa vyskytla chyba alebo možný útok, ktorý viedol k vymazaniu 198 používateľských účtov.",
      "Účty boli zlúčené do jedného účtu v inej inštancii Mastodon z dôvodu oneskorenia replikácie v databáze.",
      "Interný bezpečnostný tím spoločnosti Vivaldi tento problém preskúmal a vyvinul opravu, ktorá ho rieši.",
      "Webová lokalita bola obnovená a problém bol vyriešený s pomocou kolegov a vývojárov spoločnosti Mastodon.",
      "Niektoré menšie problémy pretrvávali, ale boli poskytnuté opravy a upozornenia, aby sa podobným incidentom v budúcnosti predišlo.",
      "Článok sa zaoberá aj rôznymi témami súvisiacimi s webovými technológiami vrátane zásad ochrany osobných údajov, kódexu správania, podmienok používania a komunity."
    ],
    "commentSummary": [
      "Diskusie zahŕňajú celý rad tém vrátane databáz, programovacích postupov, návrhu systému, protokolovania a metrík a decentralizovanej platformy sociálnych médií Mastodon.",
      "Medzi konkrétne diskutované témy patrí používanie hodnôt NULL, spracovanie chýb, optimalizácia výkonu a význam protokolovania a metrík pre ladenie a riešenie problémov.",
      "Diskutuje sa aj o stabilite a popularite Mastodonu v porovnaní s centralizovanými platformami, ako je Twitter."
    ],
    "points": 283,
    "commentCount": 76,
    "retryCount": 0,
    "time": 1690634059
  },
  {
    "id": 36925019,
    "title": "Veľká tabaková spoločnosť vedela, že rádioaktívny Po210 v cigaretách predstavuje riziko rakoviny, ale mlčala",
    "originLink": "https://www.uclahealth.org/news/big-tobacco-knew-radioactive-particles-in-cigarettes",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36925019",
    "commentBody": "",
    "originSummary": [
      "Výskumníci z UCLA zistili, že tabakové spoločnosti vedeli o prítomnosti rádioaktívnych častíc v cigaretovom dyme už od roku 1959, ale rozhodli sa túto informáciu nezverejniť.",
      "Interné dokumenty tabakového priemyslu naznačujú, že tabakový priemysel už v 60. rokoch 20. storočia skúmal potenciál týchto častíc spôsobovať rakovinu.",
      "V štúdii sa zistilo, že tabakové spoločnosti sa rozhodli nezaviesť techniku, ktorá by mohla tieto častice z cigariet odstrániť.",
      "Vedci odporúčajú, aby sa FDA zameral na odstránenie alfa častíc z tabakových výrobkov s cieľom chrániť verejné zdravie."
    ],
    "commentSummary": [
      "Diskusie sa týkajú zdravotných rizík, etických otázok a spoločenských dôsledkov užívania tabaku a závislosti.",
      "Účastníci diskutujú o potrebe prijať opatrenia proti veľkým tabakovým firmám a o úlohe korporácií v spoločnosti.",
      "Diskutovanou témou je aj zodpovednosť jednotlivcov za bojkotovanie škodlivých výrobkov.",
      "Ďalším bodom diskusie je orientácia v zložitých politických otázkach pri riešení problému užívania tabaku a závislosti od neho.",
      "Diskutuje sa o návykovej povahe tabaku a jej porovnaní so závislosťou od opiátov.",
      "Názory na úroveň regulácie a osobnej zodpovednosti pri riešení týchto problémov sa líšia."
    ],
    "points": 264,
    "commentCount": 254,
    "retryCount": 0,
    "time": 1690667265
  },
  {
    "id": 36926852,
    "title": "GNU Boot poslal spoločnosti Libreboot výzvu na zastavenie činnosti",
    "originLink": "https://libreboot.org/news/gnuboot.html#gnu-boot-cease-and-desist-email",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36926852",
    "commentBody": "",
    "originSummary": [
      "GNU Boot je odnož projektu Libreboot od projektu GNU.",
      "Bol vytvorený kvôli nesúhlasu so zásadami redukcie binárnych blobov v systéme Libreboot.",
      "Autor vyjadruje podporu GNU Boot a dokonca vytvára neoficiálne vydanie projektu.",
      "Kritizujú však GNU Boot za to, že používa zastaraný kód a nemá webové stránky.",
      "Autor dostal od spoločnosti GNU Boot e-mail o zastavení a zastavení činnosti pre porušenie ochrannej známky, napriek ich snahe pomôcť projektu.",
      "Autor na záver vyjadruje ochotu posielať záplaty a podporovať GNU Boot napriek tomu, že ho osobne nepoužíva ani neodporúča."
    ],
    "commentSummary": [
      "Projekty GNU Boot a Libreboot vedú spor o používanie názvu Libreboot.",
      "Komunikácia medzi stranami bola kritizovaná ako neprofesionálna, s obvineniami z krádeže mena a neetického správania.",
      "Kultúrne a jazykové rozdiely prispeli k zlému riešeniu sporu.",
      "Diskusia vyvoláva otázky o význame ochrany ochranných známok a o používaní pojmu \"neoficiálny\".",
      "V komunite open-source dochádza k frustrácii z dramatických situácií a konfliktov."
    ],
    "points": 242,
    "commentCount": 160,
    "retryCount": 0,
    "time": 1690681225
  },
  {
    "id": 36921446,
    "title": "Funkcie sú vektory",
    "originLink": "https://thenumb.at/Functions-are-Vectors/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36921446",
    "commentBody": "",
    "originSummary": [
      "Funkcie možno reprezentovať ako vektory a analyzovať pomocou nástrojov lineárnej algebry.",
      "V článku sa skúmajú rôzne typy vektorov, vektorové priestory a štandardné bázy pre funkcie.",
      "Vlastné funkcie, diagonalizácia, vnútorné súčiny a Laplacián sa preberajú v súvislosti s funkciami ako vektormi.",
      "Medzi aplikácie týchto pojmov patria Fourierove rady, kompresia obrazu, počítačová grafika a spracovanie geometrie."
    ],
    "commentSummary": [
      "Funkcie možno v matematickej analýze a teórii riadenia považovať za vektory.",
      "Historický vývoj a prebiehajúca diskusia o potrebe vnútorného súčinu vo funkčnej analýze.",
      "V tejto oblasti sa uvažuje o rôznych typoch mapovania a vlastnostiach.",
      "Funkcie majú definovanú definíciu a vlastnosti a môžu mať viacero hodnôt.",
      "Vektory možno použiť na vyjadrenie funkcií a ich vlastností.",
      "Dôležitými pojmami sú abstraktné vektorové priestory, bijektívne funkcie a Fourierova transformácia.",
      "Funkcie sa uplatňujú aj pri analýze veľkých objemov údajov.",
      "Venuje sa zámene kilogramov a joulov, princípu holubej diery a vzťahu medzi funkciami a počítačovým programovaním.",
      "Rôzne matematické disciplíny majú rôzne pohľady na podstatu funkcií a ich prepojenie s vektormi."
    ],
    "points": 237,
    "commentCount": 80,
    "retryCount": 0,
    "time": 1690646091
  },
  {
    "id": 36921552,
    "title": "Gzip poráža BERT? Časť 2: problémy so súborom údajov, zvýšená rýchlosť a výsledky",
    "originLink": "https://kenschutte.com/gzip-knn-paper2/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36921552",
    "commentBody": "",
    "originSummary": [
      "Článok poskytuje aktualizáciu predchádzajúcej analýzy článku, v ktorom sa navrhuje gzip a kNN na klasifikáciu textu.",
      "V aktualizácii sa rozoberajú problémy so súborom údajov, zlepšenia rýchlosti a uvádzajú sa ďalšie výsledky.",
      "Predchádzajúca analýza odhalila, že metóda klasifikácie použitá v práci bola nespravodlivá.",
      "Autor skúma implementáciu kompresie zlib v jazyku Python a navrhuje spôsoby zvýšenia výkonu.",
      "Napriek obavám o presnosť zistení pôvodného článku autor uznáva potenciál techník kompresie textu na klasifikáciu textu."
    ],
    "commentSummary": [
      "V článku sa kritizuje článok, ktorý nepravdivo tvrdí, že kompresia gzip je presnejšia ako jazykový model BERT na klasifikáciu textu.",
      "Vykonávanie dokumentu je spochybnené a jeho klamlivý prístup je obhajovaný.",
      "Zdôrazňuje sa nedostatočná zodpovednosť a tlak na publikovanie v akademickom prostredí.",
      "Kompresné algoritmy sa považujú za zaujímavé pre klasifikáciu textu, ale nemusia byť vhodné pre komplexné úlohy NLP.",
      "Konverzačné vlákno na online platforme pokrýva celý rad tém z oblasti jazyka, komunikácie a strojového učenia.",
      "Diskusia zahŕňa kompresiu v poézii, vkladanie podobnosti textu, zlepšenie rýchlosti spracovania údajov, etické normy výskumu, validáciu súborov údajov a úlohu HuggingFace pri hodnotení súborov údajov.",
      "ZSTD sa navrhuje ako lepšia alternatíva ku GZIP a bzip2 na účely kompresie."
    ],
    "points": 229,
    "commentCount": 46,
    "retryCount": 0,
    "time": 1690646655
  },
  {
    "id": 36922517,
    "title": "Poľná príručka armády USA o vodcovstve (1990) [pdf]",
    "originLink": "https://armyoe.files.wordpress.com/2018/03/1990-fm-22-100.pdf",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36922517",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [],
    "points": 201,
    "commentCount": 107,
    "retryCount": 0,
    "time": 1690651962
  },
  {
    "id": 36921808,
    "title": "Univerzálne a prenosné útoky na zarovnané jazykové modely",
    "originLink": "https://llm-attacks.org/zou2023universal.pdf",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36921808",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [],
    "points": 196,
    "commentCount": 149,
    "retryCount": 0,
    "time": 1690648081
  }
]
