[
  {
    "id": 36920622,
    "title": "अगर हम चलने के लिए बदलाव चाहते हैं तो हमें गरिमा को प्राथमिकता देने की आवश्यकता है।",
    "originLink": "https://streets.mn/2023/07/19/if-we-want-a-shift-to-walking-we-need-to-prioritize-dignity/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36920622",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [],
    "points": 516,
    "commentCount": 560,
    "retryCount": 0,
    "time": 1690640703
  },
  {
    "id": 36918655,
    "title": "आईआरसी एकमात्र व्यवहार्य चैट प्रोटोकॉल (2022) है।",
    "originLink": "https://koshka.love/babel/irc-forever.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36918655",
    "commentBody": "",
    "originSummary": [
      "लेखक डिस्कॉर्ड की तुलना में अपनी विकेन्द्रीकृत प्रकृति और गोपनीयता के लिए आईआरसी की प्रशंसा करता है।",
      "कलह की आलोचना इसके मालिकाना और निगरानी प्रथाओं के लिए की जाती है।",
      "लेखक इसके बजाय आईआरसी का उपयोग करने की सिफारिश करता है और अपने स्वयं के आईआरसी नेटवर्क को बढ़ावा देता है।",
      "संचार के लिए आईआरसी का उपयोग करने के लाभों पर चर्चा की जाती है।",
      "एक कॉमिक चैट इवेंट के बारे में एक घोषणा की जाती है।",
      "पुराने इंटरनेट को संरक्षित करने के लिए मुफ्त और खुले प्रोटोकॉल का उपयोग करने के महत्व पर जोर दिया जाता है।"
    ],
    "commentSummary": [
      "चर्चा आईआरसी और डिस्कॉर्ड की तुलना करती है, आईआरसी की सीमाओं और कमियों को उजागर करती है।",
      "चैट प्लेटफ़ॉर्म में लॉगिंग और खोज क्षमताओं के महत्व पर जोर दिया जाता है।",
      "लॉगिंग और खोज कार्यक्षमता में इसकी सीमाओं के लिए डिस्कॉर्ड की आलोचना की जाती है।",
      "आईआरसी और डिस्कॉर्ड के फायदे और नुकसान का पता लगाया जाता है, जिसमें सादगी, खोजक्षमता, गोपनीयता और कंपनी नियंत्रण जैसे कारक शामिल हैं।",
      "आईआरसी बाउंसरों और वैकल्पिक संचार उपकरणों के उपयोग पर चर्चा की गई है।",
      "संवेदनशील चर्चाओं के लिए डिस्कॉर्ड का उपयोग करने के जोखिमों को संबोधित किया जाता है।",
      "आईआरसी के लिए सुविधाओं को आधुनिक बनाने और जोड़ने का सुझाव है।",
      "मैट्रिक्स और एक्सएमपीपी जैसे अन्य संचार प्लेटफार्मों और प्रोटोकॉल को संभावित विकल्पों के रूप में उल्लिखित किया गया है।"
    ],
    "points": 323,
    "commentCount": 388,
    "retryCount": 0,
    "time": 1690625538
  },
  {
    "id": 36920566,
    "title": "आलोचनात्मक सिद्धांत हाई स्कूल बहस को कट्टरपंथी बना रहा है",
    "originLink": "https://www.slowboring.com/p/how-critical-theory-is-radicalizing",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36920566",
    "commentBody": "",
    "originSummary": [
      "लेख हाई स्कूल बहस प्रारूपों में महत्वपूर्ण सिद्धांत, विशेष रूप से कृतिक के बढ़ते उपयोग पर चर्चा करता है।",
      "न्यायाधीश और बहसकर्ता इन तर्कों के लिए प्राथमिकता दिखा रहे हैं, जो गतिविधि को प्रभावित कर रहा है।",
      "बहस में कट्टरपंथी विचारधाराओं को बढ़ावा देने के संभावित नकारात्मक परिणामों के बारे में चिंताएं उठाई जाती हैं।",
      "छात्रों के राजनीतिक विचारों पर इन तर्कों के प्रभाव की भी जांच की जाती है।",
      "लेख बहस प्रारूपों पर एक ऐतिहासिक परिप्रेक्ष्य प्रदान करता है और इसमें पूर्व बहसकर्ताओं के व्यक्तिगत प्रतिबिंब शामिल हैं।"
    ],
    "commentSummary": [
      "लेख हाई स्कूल बहस में महत्वपूर्ण सिद्धांत की भूमिका की जांच करता है और बयानबाजी के महत्व और विभिन्न दृष्टिकोणों को समझने पर जोर देता है।",
      "यह महत्वपूर्ण सोच कौशल पर बहस प्रारूप के प्रभाव पर चर्चा करता है और इसकी सीमाओं पर प्रकाश डालता है।",
      "बहस पर महत्वपूर्ण सिद्धांत के प्रभाव और न्याय प्रक्रिया में खामियों का भी पता लगाया जाता है।",
      "सीखने के उपकरण के रूप में बहस की प्रभावशीलता और विविध दृष्टिकोणों के मूल्य पर बहस की जाती है।",
      "चर्चाएं हाई स्कूल बहस के लाभों और कमियों और छात्रों के कौशल और ज्ञान पर इसके प्रभाव का संतुलित दृष्टिकोण प्रदान करती हैं।"
    ],
    "points": 287,
    "commentCount": 370,
    "retryCount": 0,
    "time": 1690640309
  },
  {
    "id": 36919659,
    "title": "विवाल्डी सोशल के साथ क्या हुआ?",
    "originLink": "https://thomasp.vivaldi.net/2023/07/28/what-happened-to-vivaldi-social/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36919659",
    "commentBody": "",
    "originSummary": [
      "विवाल्डी सोशल मास्टोडॉन उदाहरण ने एक बग या संभावित हमले का अनुभव किया जिसके परिणामस्वरूप 198 उपयोगकर्ता खातों को हटा दिया गया।",
      "डेटाबेस में प्रतिकृति देरी के कारण खातों को एक अलग मास्टोडॉन इंस्टेंस पर एक खाते में विलय कर दिया गया था।",
      "विवाल्डी आंतरिक सुरक्षा टीम ने इस मुद्दे की जांच की और समस्या को हल करने के लिए एक पैच विकसित किया।",
      "वेबसाइट को बहाल कर दिया गया था, और सहकर्मियों और मास्टोडॉन डेवलपर्स की मदद से समस्या को हल किया गया था।",
      "कुछ मामूली मुद्दे बने रहे, लेकिन भविष्य में इसी तरह की घटनाओं को रोकने के लिए फिक्स और चेतावनियां प्रदान की गईं।",
      "लेख में गोपनीयता नीतियों, आचार संहिता, उपयोग की शर्तों और समुदाय सहित वेब प्रौद्योगिकियों से संबंधित विभिन्न विषयों को भी शामिल किया गया है।"
    ],
    "commentSummary": [
      "चर्चाओं में डेटाबेस, प्रोग्रामिंग प्रथाओं, सिस्टम डिजाइन, लॉगिंग और मैट्रिक्स और विकेन्द्रीकृत सोशल मीडिया प्लेटफॉर्म मास्टोडॉन सहित कई विषय शामिल हैं।",
      "चर्चा किए गए विशिष्ट विषयों में NULL मानों का उपयोग, त्रुटि हैंडलिंग, प्रदर्शन अनुकूलन, और डिबगिंग और समस्या निवारण के लिए लॉगिंग और मैट्रिक्स का महत्व शामिल है।",
      "ट्विटर जैसे केंद्रीकृत प्लेटफार्मों की तुलना में मास्टोडॉन की स्थिरता और लोकप्रियता पर भी चर्चा की जाती है।"
    ],
    "points": 283,
    "commentCount": 76,
    "retryCount": 0,
    "time": 1690634059
  },
  {
    "id": 36925019,
    "title": "बिग टोबैको जानता था कि सिगरेट में रेडियोधर्मी Po210 कैंसर का खतरा पैदा करता है, चुप रहा",
    "originLink": "https://www.uclahealth.org/news/big-tobacco-knew-radioactive-particles-in-cigarettes",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36925019",
    "commentBody": "",
    "originSummary": [
      "यूसीएलए शोधकर्ताओं ने पाया कि तंबाकू कंपनियों को 1959 से सिगरेट के धुएं में रेडियोधर्मी कणों की उपस्थिति के बारे में पता था, लेकिन उन्होंने इस जानकारी को जनता के सामने प्रकट नहीं करने का विकल्प चुना।",
      "आंतरिक उद्योग दस्तावेजों से संकेत मिलता है कि तंबाकू उद्योग ने 1960 के दशक की शुरुआत में इन कणों की कैंसर पैदा करने की क्षमता की जांच की थी।",
      "अध्ययन में पाया गया कि तंबाकू कंपनियों ने एक ऐसी तकनीक को लागू नहीं करने का विकल्प चुना जो सिगरेट से इन कणों को समाप्त कर सकती थी।",
      "शोधकर्ताओं का सुझाव है कि एफडीए सार्वजनिक स्वास्थ्य की रक्षा के लिए तंबाकू उत्पादों से अल्फा कणों को हटाने पर ध्यान केंद्रित करे।"
    ],
    "commentSummary": [
      "चर्चा में स्वास्थ्य जोखिम, नैतिक चिंताओं और तंबाकू के उपयोग और लत के सामाजिक निहितार्थ शामिल हैं।",
      "प्रतिभागी बिग टोबैको के खिलाफ कार्रवाई करने की आवश्यकता और समाज में निगमों की भूमिका पर बहस करते हैं।",
      "हानिकारक उत्पादों का बहिष्कार करने के लिए व्यक्तियों की जिम्मेदारी भी चर्चा का विषय है।",
      "तंबाकू के उपयोग और लत को संबोधित करने में राजनीति की जटिलताओं को नेविगेट करना बहस का एक और बिंदु है।",
      "तंबाकू की नशे की लत प्रकृति और ओपिओइड की लत से इसकी तुलना पर चर्चा की जाती है।",
      "इन मुद्दों को संबोधित करने में विनियमन और व्यक्तिगत जिम्मेदारी के स्तर पर राय भिन्न होती है।"
    ],
    "points": 264,
    "commentCount": 254,
    "retryCount": 0,
    "time": 1690667265
  },
  {
    "id": 36926852,
    "title": "जीएनयू बूट ने लिबरबूट को एक संघर्ष विराम भेजा",
    "originLink": "https://libreboot.org/news/gnuboot.html#gnu-boot-cease-and-desist-email",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36926852",
    "commentBody": "",
    "originSummary": [
      "जीएनयू बूट जीएनयू परियोजना द्वारा लिबरबूट परियोजना का एक कांटा है।",
      "यह लिबरबूट की बाइनरी ब्लॉब रिडक्शन पॉलिसी के साथ असहमति के कारण बनाया गया था।",
      "लेखक जीएनयू बूट के लिए समर्थन व्यक्त करता है और यहां तक कि परियोजना के लिए एक अनौपचारिक रिलीज भी बनाता है।",
      "हालांकि, वे पुराने कोड का उपयोग करने और वेबसाइट नहीं होने के लिए जीएनयू बूट की आलोचना करते हैं।",
      "लेखक को परियोजना की मदद करने के उनके प्रयासों के बावजूद, ट्रेडमार्क उल्लंघन के लिए जीएनयू बूट से एक संघर्ष विराम और निषेध ईमेल प्राप्त हुआ।",
      "लेखक व्यक्तिगत रूप से इसका उपयोग या सिफारिश नहीं करने के बावजूद, पैच भेजने और जीएनयू बूट का समर्थन करने की अपनी इच्छा व्यक्त करके निष्कर्ष निकालता है।"
    ],
    "commentSummary": [
      "जीएनयू बूट और लिबरबूट परियोजनाएं लिबरबूट नाम के उपयोग पर विवाद में हैं।",
      "पार्टियों के बीच संचार की आलोचना गैर-पेशेवर के रूप में की गई है, जिसमें नाम चोरी और अनैतिक व्यवहार के आरोप हैं।",
      "सांस्कृतिक और भाषा मतभेदों ने असहमति के खराब प्रबंधन में योगदान दिया है।",
      "चर्चा ट्रेडमार्क संरक्षण के महत्व और \"अनौपचारिक\" शब्द के उपयोग के बारे में सवाल उठाती है।",
      "ओपन-सोर्स समुदाय के भीतर नाटक और संघर्ष के साथ निराशा है।"
    ],
    "points": 242,
    "commentCount": 160,
    "retryCount": 0,
    "time": 1690681225
  },
  {
    "id": 36921446,
    "title": "कार्य वैक्टर हैं।",
    "originLink": "https://thenumb.at/Functions-are-Vectors/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36921446",
    "commentBody": "",
    "originSummary": [
      "कार्यों को वैक्टर के रूप में दर्शाया जा सकता है और रैखिक बीजगणित उपकरणों का उपयोग करके विश्लेषण किया जा सकता है।",
      "लेख में विभिन्न प्रकार के वैक्टर, वेक्टर रिक्त स्थान और कार्यों के लिए मानक आधार का पता लगाया गया है।",
      "वैक्टर के रूप में कार्यों के संबंध में आइगेनफ़ंक्शंस, विकर्णीकरण, आंतरिक उत्पादों और लैप्लाशियन पर चर्चा की जाती है।",
      "इन अवधारणाओं के अनुप्रयोगों में फूरियर श्रृंखला, छवि संपीड़न, कंप्यूटर ग्राफिक्स और ज्यामिति प्रसंस्करण शामिल हैं।"
    ],
    "commentSummary": [
      "कार्यों को गणितीय विश्लेषण और नियंत्रण सिद्धांत में वैक्टर के रूप में माना जा सकता है।",
      "कार्यात्मक विश्लेषण में एक आंतरिक उत्पाद की आवश्यकता के बारे में एक ऐतिहासिक विकास और चल रही बहस हुई है।",
      "इस क्षेत्र में विभिन्न प्रकार के मानचित्रण और गुणों पर विचार किया जाता है।",
      "फ़ंक्शंस की एक परिभाषित परिभाषा और गुण होते हैं, और उनके कई मान हो सकते हैं।",
      "वैक्टर का उपयोग कार्यों और उनके गुणों को व्यक्त करने के लिए किया जा सकता है।",
      "अमूर्त वेक्टर रिक्त स्थान, बिजेक्टिव फ़ंक्शंस और फूरियर ट्रांसफ़ॉर्मेशन प्रासंगिक अवधारणाएं हैं।",
      "फ़ंक्शंस में बड़े डेटा विश्लेषण में भी अनुप्रयोग हैं।",
      "किलोग्राम और जूल की इंटरचेंजेबिलिटी, पिजनहोल सिद्धांत, और कार्यों और कंप्यूटर प्रोग्रामिंग के बीच संबंध को छुआ जाता है।",
      "गणित के विभिन्न विषयों में कार्यों की प्रकृति और वैक्टर के साथ उनके कनेक्शन पर विभिन्न दृष्टिकोण हैं।"
    ],
    "points": 237,
    "commentCount": 80,
    "retryCount": 0,
    "time": 1690646091
  },
  {
    "id": 36921552,
    "title": "Gzip BERT को हरा देता है? भाग 2: डेटासेट समस्याएँ, बेहतर गति, और परिणाम",
    "originLink": "https://kenschutte.com/gzip-knn-paper2/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36921552",
    "commentBody": "",
    "originSummary": [
      "लेख पाठ वर्गीकरण के लिए gzip और kNN का प्रस्ताव करने वाले एक पेपर के पिछले विश्लेषण पर एक अद्यतन प्रदान करता है।",
      "अद्यतन डेटासेट समस्याओं, गति में सुधार, और अतिरिक्त परिणाम प्रस्तुत करता है।",
      "पिछले विश्लेषण से पता चला कि पेपर में इस्तेमाल की गई वर्गीकरण विधि अनुचित थी।",
      "लेखक पायथन में ज़्लिब संपीड़न के कार्यान्वयन की पड़ताल करता है और प्रदर्शन को बढ़ाने के तरीकों का सुझाव देता है।",
      "मूल पेपर के निष्कर्षों की सटीकता के बारे में चिंताओं के बावजूद, लेखक पाठ वर्गीकरण के लिए पाठ संपीड़न तकनीकों की क्षमता को पहचानता है।"
    ],
    "commentSummary": [
      "लेख एक पेपर की आलोचना करता है जिसने गलत तरीके से दावा किया है कि जीज़िप संपीड़न पाठ वर्गीकरण के लिए बर्ट भाषा मॉडल की तुलना में अधिक सटीक है।",
      "पेपर के कार्यान्वयन पर सवाल उठाया जाता है, और इसके भ्रामक दृष्टिकोण का बचाव किया जाता है।",
      "जवाबदेही की कमी और शिक्षा में प्रकाशित करने के दबाव पर प्रकाश डाला गया है।",
      "संपीड़न एल्गोरिदम को पाठ वर्गीकरण के लिए दिलचस्प माना जाता है लेकिन जटिल एनएलपी कार्यों के लिए उपयुक्त नहीं हो सकता है।",
      "एक ऑनलाइन प्लेटफ़ॉर्म पर एक वार्तालाप थ्रेड भाषा, संचार और मशीन लर्निंग विषयों की एक श्रृंखला को कवर करता है।",
      "चर्चा में कविता में संपीड़न, पाठ-समानता एम्बेडिंग, डेटा प्रोसेसिंग गति में सुधार, अनुसंधान नैतिक मानकों, डेटासेट सत्यापन और डेटासेट समीक्षाओं में हगिंगफेस की भूमिका शामिल है।",
      "जेडएसटीडी को संपीड़न उद्देश्यों के लिए जीज़िप और बीज़िप 2 के बेहतर विकल्प के रूप में प्रस्तावित किया गया है।"
    ],
    "points": 229,
    "commentCount": 46,
    "retryCount": 0,
    "time": 1690646655
  },
  {
    "id": 36922517,
    "title": "नेतृत्व पर अमेरिकी सेना फील्ड मैनुअल (1990) [पीडीएफ]",
    "originLink": "https://armyoe.files.wordpress.com/2018/03/1990-fm-22-100.pdf",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36922517",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [],
    "points": 201,
    "commentCount": 107,
    "retryCount": 0,
    "time": 1690651962
  },
  {
    "id": 36921808,
    "title": "संरेखित भाषा मॉडल पर सार्वभौमिक और हस्तांतरणीय प्रतिकूल हमले",
    "originLink": "https://llm-attacks.org/zou2023universal.pdf",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36921808",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [],
    "points": 196,
    "commentCount": 149,
    "retryCount": 0,
    "time": 1690648081
  }
]
