[
  {
    "id": 38061187,
    "title": "Anti-Adblock de YouTube y uBlock Origin",
    "originLink": "https://andadinosaur.com/youtube-s-anti-adblock-and-ublock-origin",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38061187",
    "commentBody": "",
    "originSummary": [
      "YouTube ha intensificado sus intentos de contrarrestar los adblockers, iniciando un tira y afloja entre ella misma y los desarrolladores de adblockers, incluso apuntando a otras extensiones de privacidad y configuraciones de protección del rastreo.",
      "Los usuarios de Reddit tienen dificultades para buscar información útil, y algunos recurren a compartir filtros perjudiciales que pueden provocar el bloqueo total de sus adblockers.",
      "La presión ejercida sobre los desarrolladores de adblockers ha provocado el desgaste de miembros del equipo y la eliminación de cuentas, lo que apunta a un posible futuro en el que los adblockers podrían ceder."
    ],
    "commentSummary": [
      "Los temas de Hacker News se centran en la aplicación de medidas antibloqueo por parte de YouTube y los consiguientes debates sobre las consideraciones éticas del bloqueo de anuncios.",
      "Algunos usuarios expresan su descontento con el servicio de suscripción sin publicidad de YouTube, los retos a los que se enfrentan los desarrolladores de software libre y debaten las distintas actitudes hacia el software de código abierto y los servicios gratuitos en línea.",
      "Preocupan las violaciones de la privacidad, la influencia del bloqueo de anuncios en YouTube, los problemas relacionados con el mantenimiento de proyectos de código abierto, los efectos sobre los creadores de contenidos y la eficacia de la verificación de los anuncios."
    ],
    "points": 683,
    "commentCount": 671,
    "retryCount": 0,
    "time": 1698603659
  },
  {
    "id": 38069710,
    "title": "Accidentalmente ahorré a mi empresa medio millón de dólares",
    "originLink": "https://ludic.mataroa.blog/blog/i-accidentally-saved-half-a-million-dollars/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38069710",
    "commentBody": "",
    "originSummary": [
      "El artículo recoge la experiencia del autor, que ahorró 500.000 dólares a su empresa optimizando una plataforma de análisis y abordando ineficiencias operativas.",
      "Subraya los obstáculos encontrados, entre ellos la deuda técnica, un proceso de presupuestación inadecuado y la resistencia de los departamentos, a pesar de lograr un importante ahorro de costes.",
      "El autor expresa su descontento por la falta de reconocimiento o recompensa a pesar de su importante contribución financiera a la empresa."
    ],
    "commentSummary": [
      "El artículo analiza los problemas que plantean los procesos empresariales enrevesados e ineficaces, sobre todo cuando se basan en métodos de desarrollo centrados en el currículum vitae o iterativos (StackOverflow), y sugiere que la simplificación podría conducir al éxito.",
      "La sección de comentarios se centra en los problemas en entornos basados en el cliente, la desilusión con los entornos de trabajo de las empresas FAANG (Facebook, Amazon, Apple, Netflix, Google) y la infravaloración de los empleados que generan beneficios.",
      "Concluye abogando por una cultura de trabajo que promueva la acción y la eficacia, al tiempo que critica el concepto de que la tecnología esté supeditada a los departamentos financieros."
    ],
    "points": 320,
    "commentCount": 151,
    "retryCount": 0,
    "time": 1698675307
  },
  {
    "id": 38063536,
    "title": "π en otros universos",
    "originLink": "https://azeemba.com/posts/pi-in-other-universes.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38063536",
    "commentBody": "",
    "originSummary": [
      "El artículo analiza la determinación del valor de pi, una constante matemática fundamental, y cómo influye en ella la definición de distancia.",
      "Introduce conceptos como las distancias euclídea y de Manhattan, métricas que influyen en el cálculo de pi.",
      "Se menciona que el valor más bajo posible de pi es 3,14159 en todas las métricas, pero en muchas otras métricas pi oscila entre 3 y 4. Esto sugiere que el valor de pi no es absoluto, sino que depende de factores como la métrica elegida. Esto sugiere que el valor de pi no es absoluto, sino que depende de factores como la métrica elegida."
    ],
    "commentSummary": [
      "El debate gira en torno a numerosos aspectos de las matemáticas, entre los que destacan su interpretación como juego lógico y su aplicabilidad y escalabilidad.",
      "La conversación arroja luz sobre los orígenes de las matemáticas y su entrelazada relación con la ciencia, así como sobre la navegación de conceptos matemáticos novedosos y esotéricos.",
      "El diálogo también reflexiona sobre el carácter discrecional de los axiomas matemáticos, las implicaciones de pi, la idea de diversas constantes del círculo y la consideración de leer un tratado completo sobre teoría de la medida."
    ],
    "points": 302,
    "commentCount": 91,
    "retryCount": 0,
    "time": 1698618924
  },
  {
    "id": 38062297,
    "title": "El océano azul de Apple",
    "originLink": "https://hypercritical.co/2023/10/29/apples-blue-ocean",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38062297",
    "commentBody": "",
    "originSummary": [
      "El autor presenta la estrategia del \"océano azul\", ilustrada a través del triunfo de Nintendo con la consola Wii. La estrategia del océano azul consiste en crear un nuevo espacio de mercado que haga irrelevante a la competencia.",
      "El autor sugiere que la próxima gran oportunidad o \"océano azul\" de Apple podría ser reintroducir en sus aparatos baterías extraíbles y accesibles para el usuario, debido a los avances tecnológicos y a la evolución de las necesidades de los consumidores.",
      "La idea propuesta presenta beneficios potenciales como una mayor duración de las baterías y una reducción de los residuos electrónicos, lo que hace que Apple, líder en diseño de electrónica de consumo, sea capaz de superar cualquier reto previsible ligado a esta iniciativa."
    ],
    "commentSummary": [
      "En la conversación se destacan las limitaciones e inconvenientes de los dispositivos Apple, como la RAM no ampliable y el almacenamiento soldado, y la falta de funciones como la compatibilidad con MST y las baterías extraíbles.",
      "Los usuarios debaten sobre la fiabilidad y la vida útil de las bombillas LED y las baterías, los pros y los contras de la carga inalámbrica y la posibilidad de que Apple desarrolle un teléfono superfino con una duración de batería reducida.",
      "El debate también gira en torno a las opciones de diseño de Apple, el concepto de baterías sustituibles por el usuario y la influencia de las preocupaciones por la sostenibilidad en la industria de los dispositivos."
    ],
    "points": 244,
    "commentCount": 216,
    "retryCount": 0,
    "time": 1698610641
  },
  {
    "id": 38064856,
    "title": "Sintetizador FM web hecho con HTML5",
    "originLink": "https://www.taktech.org/takm/WebFMSynth/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38064856",
    "commentBody": "",
    "originSummary": [
      "El texto analiza un sintetizador FM web construido con HTML5, que muestra los avances y las posibilidades de la tecnología musical basada en la web.",
      "También hace referencia a otras herramientas y recursos relacionados, poniendo de relieve la amplitud del apoyo y la disponibilidad en este campo.",
      "El texto aborda el sintetizador DXi FM creado para iPhone/iPad entre 2010-2014 por Takashi Mizuhiki y el estudio creativo CUE, revelando un precedente histórico en la tecnología musical móvil."
    ],
    "commentSummary": [
      "En Hacker News se ha presentado y compartido un sintetizador FM basado en web, creado con HTML5, que ha recibido comentarios predominantemente positivos.",
      "Algunos usuarios han experimentado artefactos de clic en sus navegadores al utilizar el sintetizador, lo que indica posibles problemas de compatibilidad.",
      "Hay un debate en curso sobre el estilo de formato de los lenguajes de programación Haskell y SQL, y muchos usuarios comparten proyectos y recursos relacionados con la síntesis de audio basada en navegador, lo que demuestra la participación de la comunidad."
    ],
    "points": 223,
    "commentCount": 43,
    "retryCount": 0,
    "time": 1698630809
  },
  {
    "id": 38062923,
    "title": "DIY IP-KVM basado en Raspberry Pi",
    "originLink": "https://github.com/pikvm/pikvm",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38062923",
    "commentBody": "",
    "originSummary": [
      "PiKVM es un sistema IP-KVM DIY de código abierto y rentable que utiliza Raspberry Pi para gestionar servidores o estaciones de trabajo de forma remota. Ayuda en la resolución de problemas, la configuración de la BIOS y la reinstalación del sistema operativo.",
      "El proyecto ofrece varias versiones del dispositivo, con orientación y asistencia accesibles a través de su sitio web y la comunidad Discord.",
      "PiKVM tiene requisitos específicos para ciertos modelos de Raspberry Pi y componentes extra necesarios para configuraciones particulares. La iniciativa acepta donaciones y ofrece personalización para uso comercial."
    ],
    "commentSummary": [
      "El tema central es el desarrollo de una versión asequible y simplificada de un dispositivo de acceso remoto conocido como Pi-KVM.",
      "En el hilo se debaten experiencias de usuarios, sugerencias de soluciones y alternativas, junto con las respuestas de un fundador de un proyecto similar sobre los retos de la venta de hardware.",
      "También se presentan opciones de bricolaje para construir o comprar hardware y se describen las funcionalidades que ofrece DASH para la gestión fuera de banda."
    ],
    "points": 208,
    "commentCount": 72,
    "retryCount": 0,
    "time": 1698614351
  },
  {
    "id": 38060912,
    "title": "Las reglas de Carl Sagan para acabar con las tonterías y el pensamiento crítico",
    "originLink": "https://www.themarginalian.org/2014/01/03/baloney-detection-kit-carl-sagan/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38060912",
    "commentBody": "",
    "originSummary": [
      "El autor de The Marginalian, un sitio web gratuito y sin publicidad, busca el apoyo de los lectores para mantener el sitio web.",
      "El autor analiza el libro de Carl Sagan que subraya la importancia del pensamiento crítico y ofrece métodos para distinguir la verdad de la falsedad.",
      "Para navegar por un mundo rebosante de propaganda y pseudociencia, el autor subraya la necesidad de evaluar críticamente las afirmaciones, evitar las falacias lógicas y utilizar herramientas como el \"kit de detección de tonterías\"."
    ],
    "commentSummary": [
      "El artículo aborda numerosos temas, como los principios de Carl Sagan para el pensamiento crítico, la importancia de la falsabilidad en la ciencia y los obstáculos para diferenciar la ciencia en una era posterior a la verdad.",
      "Plantea debates sobre los modelos de cambio climático, la existencia de Dios y las creencias religiosas, la teoría de la decisión, las pruebas estadísticas de hipótesis y la necesidad del pensamiento crítico en el periodismo.",
      "En última instancia, el artículo subraya la importancia del pensamiento racional, el debate ponderado y la información basada en pruebas sólidas en la sociedad."
    ],
    "points": 203,
    "commentCount": 184,
    "retryCount": 0,
    "time": 1698601640
  },
  {
    "id": 38068801,
    "title": "Raspberry Pi 5 no tiene codificación de vídeo por hardware y sólo decodificación HEVC",
    "originLink": "https://www.raspberrypi.com/news/introducing-raspberry-pi-5/#comment-1594055",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38068801",
    "commentBody": "",
    "originSummary": [
      "La Fundación Raspberry Pi está preparando el lanzamiento de la Raspberry Pi 5, que incluye un diseño propio y características mejoradas como una CPU Arm Cortex-A76 de 64 bits y cuatro núcleos a 2,4 GHz, GPU VideoCore VII y doble salida de pantalla HDMI 4Kp60.",
      "Hay pedidos anticipados disponibles para este nuevo modelo, con un precio de 60 dólares para la variante de 4 GB y de 80 dólares para la versión de 8 GB.",
      "El anuncio ha suscitado reacciones encontradas entre los usuarios; algunos están entusiasmados con las nuevas funciones y los posibles proyectos, mientras que otros se muestran preocupados por la disponibilidad del producto y las diferencias de coste. El equipo de Raspberry Pi está abordando estas cuestiones mediante una comunicación activa."
    ],
    "commentSummary": [
      "La Raspberry Pi 5 es criticada por su ausencia de codificación de vídeo por hardware, lo que la hace menos atractiva en comparación con alternativas como Banana Pi y Orange Pi 5.",
      "La insatisfacción de los usuarios se debe a que la Fundación Raspberry Pi se centra en el desarrollo de nuevos modelos en lugar de mejorar la asequibilidad y disponibilidad de los existentes, y a su dependencia de Broadcom, con un llamamiento a considerar Qualcomm en su lugar.",
      "La falta de instrucciones modernas y de soporte de 64 bits en la Pi Zero 2 W se suma a los inconvenientes, afectando al atractivo de mercado de la Raspberry Pi 5."
    ],
    "points": 190,
    "commentCount": 102,
    "retryCount": 0,
    "time": 1698670028
  },
  {
    "id": 38064287,
    "title": "¿Cuál es la profundidad del cerebro? La hipótesis del cerebro superficial",
    "originLink": "https://www.nature.com/articles/s41583-023-00756-z",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38064287",
    "commentBody": "",
    "originSummary": [
      "Los artículos abordan una amplia gama de temas relacionados con la función cerebral, como la organización de redes corticales, el procesamiento neuronal en diversas regiones del cerebro, la importancia de ciertas partes del cerebro en la cognición y la percepción, la adaptabilidad de los circuitos neuronales y el papel de los neurotransmisores en la actividad cerebral y el comportamiento.",
      "Los artículos cuestionan el punto de vista convencional del procesamiento jerárquico en el cerebro, subrayando la importancia de las regiones subcorticales y los bucles tálamo-corticales en el procesamiento neuronal.",
      "En los artículos también se analiza la utilización de métodos estadísticos y modelos computacionales para comprender la función cerebral."
    ],
    "commentSummary": [
      "El artículo y los debates posteriores se centran en la relación entre las redes neuronales artificiales y la complejidad del cerebro humano.",
      "Existe un debate en curso sobre el valor de estudiar el cerebro humano para mejorar el desarrollo y la comprensión de la tecnología de redes neuronales.",
      "El debate también subraya las diferencias de arquitectura entre cerebros y ordenadores, las limitaciones de la investigación neurocientífica actual y la aplicación de metáforas y analogías en neurociencia."
    ],
    "points": 182,
    "commentCount": 158,
    "retryCount": 0,
    "time": 1698625718
  },
  {
    "id": 38069197,
    "title": "El capital riesgo devora la economía estadounidense",
    "originLink": "https://www.theatlantic.com/ideas/archive/2023/10/private-equity-publicly-traded-companies/675788/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38069197",
    "commentBody": "",
    "originSummary": [
      "La rápida expansión del sector del capital riesgo, valorado actualmente en 12 billones de dólares, está suscitando preocupación por la transparencia, la rendición de cuentas y los posibles riesgos sistémicos, debido al aumento de la privatización de empresas que cotizan en bolsa.",
      "La práctica de privatizar empresas por parte de estas empresas las exime de las divulgaciones públicas obligatorias, lo que conlleva un menor escrutinio y la posibilidad de abusos como despidos de personal, evasiones normativas y quiebras de empresas, al tiempo que garantiza elevados pagos para los socios de las empresas.",
      "Aunque se han propuesto normativas gubernamentales para exigir más información a los fondos de capital riesgo/inversión, se necesitan medidas adicionales para abordar los problemas intrínsecos que aquejan al sector, con el fin de prevenir posibles crisis financieras desencadenadas por deudas e impagos inasumibles."
    ],
    "commentSummary": [
      "El auge de las empresas de capital riesgo en Estados Unidos y sus adquisiciones de pequeñas empresas están provocando la concentración de la riqueza, transformando a los propietarios de viviendas en inquilinos, agravando la desigualdad de ingresos y afectando a los planes de jubilación.",
      "El diálogo pone de manifiesto la necesidad de diversificar el ahorro para la jubilación más allá de los planes 401(k) y critica los planes de pensiones, abordando los retos que plantean los sistemas de jubilación.",
      "La consolidación de industrias, como la veterinaria, por parte de empresas de capital privado plantea retos a las empresas independientes, con posibles consecuencias adversas como la reducción de costes, la desinformación, el aumento de los precios y el deterioro del bienestar."
    ],
    "points": 175,
    "commentCount": 225,
    "retryCount": 0,
    "time": 1698672347
  },
  {
    "id": 38061096,
    "title": "¿Cuántos miles de millones de transistores hay en el procesador de un iPhone?",
    "originLink": "https://lemire.me/blog/2023/10/18/how-many-billions-of-transistors-in-your-iphone-processor/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38061096",
    "commentBody": "",
    "originSummary": [
      "El artículo examina la tendencia al aumento del número de transistores en los procesadores del iPhone de Apple a lo largo de los años, haciendo hincapié en su ritmo de crecimiento y en el tiempo de duplicación.",
      "Señala que, a pesar de la creciente complejidad de los chips, el precio de los iPhones se ha mantenido relativamente igual.",
      "El artículo termina con un comentario sobre la computación cuántica, sugiriendo que podría no cumplir las elevadas expectativas fijadas por los profesionales del marketing."
    ],
    "commentSummary": [
      "La discusión abarca una amplia gama de temas, entre ellos la complejidad de los chips informáticos, el actual debate entre priorizar las bases lunares y las misiones a Marte, y el papel crucial de la distribución de recursos en la exploración espacial.",
      "También explora la influencia de la tecnología en la felicidad general y compara las capacidades de varios modelos de iPhone.",
      "Además, se destaca el concepto de inmortalidad y la función crítica de los transistores en el diseño de chips."
    ],
    "points": 171,
    "commentCount": 184,
    "retryCount": 0,
    "time": 1698603013
  },
  {
    "id": 38063112,
    "title": "Alan Wake 2 es una inesperada maravilla visual incluso en GPU antiguas",
    "originLink": "https://www.xfire.com/alan-wake-2-performing-well-low-end-pcs/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38063112",
    "commentBody": "",
    "originSummary": [
      "El artículo documenta el satisfactorio rendimiento de Alan Wake 2 en PC, destacando su adaptabilidad a distintas configuraciones de hardware, incluidas las GPU de gama baja.",
      "A pesar de los temores iniciales sobre los elevados requisitos del sistema, el juego ha cosechado críticas positivas y ha sido elogiado por su notable atractivo visual y su rendimiento tanto en sistemas de gama alta como de gama baja.",
      "También reconoce fallos menores en el juego y anticipa próximas actualizaciones para subsanarlos."
    ],
    "commentSummary": [
      "El discurso abarca una serie de aspectos de los juegos, como el funcionamiento de \"Alan Wake 2\" en diversas GPU y la importancia de la resolución en los juegos.",
      "Ilustra los obstáculos de utilizar juegos actualizados en hardware anticuado y la fijación por los puntos de referencia.",
      "El resumen ofrece reseñas de \"Starfield\", comentarios sobre el uso del raytracing en \"Alan Wake 2\" y diversos puntos de vista sobre mejoras y actualizaciones del juego."
    ],
    "points": 170,
    "commentCount": 208,
    "retryCount": 0,
    "time": 1698615772
  },
  {
    "id": 38069915,
    "title": "Los costes de los microservicios (2020)",
    "originLink": "https://robertovitillo.com/costs-of-microservices/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38069915",
    "commentBody": "",
    "originSummary": [
      "El artículo explora las ventajas de una arquitectura de microservicios, como la mejora del ritmo de desarrollo, la reducción de los cuellos de botella en las comunicaciones, la escalabilidad y la posibilidad de experimentar con distintas tecnologías.",
      "Destaca los inconvenientes de dicha arquitectura, como el aumento de la complejidad, la necesidad de gestionar el aprovisionamiento de recursos, la articulación de los retos de comunicación y la necesidad de automatización.",
      "Hace hincapié en el papel crucial de la integración, las pruebas y la supervisión continuas en tales entornos, al tiempo que subraya los retos operativos y de depuración. El autor sugiere empezar con un enfoque monolítico y cambiar a microservicios cuando sea necesario y con la experiencia adecuada y una plataforma bien establecida."
    ],
    "commentSummary": [
      "La conversación se centra en las ventajas y desventajas de utilizar microservicios en comparación con una arquitectura monolítica, con factores que incluyen herramientas técnicas como la Integración Continua/Despliegue Continuo (CI/CD), posibles dificultades con las bases de datos y la necesidad de una planificación adecuada.",
      "Se comenta que, si bien los microservicios ofrecen ventajas como un mayor control para los equipos individuales y una velocidad de desarrollo de software más rápida, también pueden presentar retos que requieran una comprensión sustancial de las dependencias del sistema existente.",
      "El debate subraya que la decisión de adoptar una arquitectura de microservicios debe tomarse tras una evaluación exhaustiva y bajo un liderazgo sólido para gestionar eficazmente la complejidad que conlleva."
    ],
    "points": 162,
    "commentCount": 138,
    "retryCount": 0,
    "time": 1698676421
  },
  {
    "id": 38062269,
    "title": "Kubernetes lanza la herramienta ingress2gateway para la próxima AG de la API Gateway",
    "originLink": "https://kubernetes.io/blog/2023/10/25/introducing-ingress2gateway/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38062269",
    "commentBody": "",
    "originSummary": [
      "El blog de Kubernetes presentó \"ingress2gateway\", una herramienta que facilita la transición de Ingress a la API Gateway, más funcional y flexible, para gestionar el acceso a servicios externos en clústeres Kubernetes.",
      "El blog dispersó las ventajas de la API Gateway sobre Ingress: su estrategia orientada a roles, portabilidad, expresividad y expansibilidad.",
      "También ofrecía un tutorial sobre la instalación y utilización de ingress2gateway para la migración. El blog concluía reconociendo el desarrollo continuo de la API Gateway y la comunidad que la respalda."
    ],
    "commentSummary": [
      "Kubernetes ha presentado la herramienta ingress2gateway como parte de los preparativos para la Disponibilidad General (GA) de la API Gateway, destinada a facilitar el uso de la API a los profesionales de DevOps y SRE.",
      "La herramienta, desarrollada por Kong -un conocido proveedor de Ingress-, es compatible tanto con Ingress como con la API Gateway, lo que permite una transición fluida entre ambas.",
      "El cambio se debe a las limitaciones encontradas en la API Ingress para manejar funciones avanzadas como el enrutamiento de cadenas de consulta y el equilibrio de carga ponderado, que se cree que se solucionarán con la API Gateway."
    ],
    "points": 142,
    "commentCount": 31,
    "retryCount": 0,
    "time": 1698610474
  },
  {
    "id": 38062649,
    "title": "Migración de nuestro backend de Vercel a Fly.io",
    "originLink": "https://www.openstatus.dev/blog/migration-backend-from-vercel-to-fly",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38062649",
    "commentBody": "",
    "originSummary": [
      "El artículo relata la migración del backend de OpenStatus de Vercel a Fly.io, motivada por la necesidad de un servidor más ligero y la preocupación por los precios de Vercel.",
      "La transición se enfrentó a retos como la optimización de una imagen Docker en un monorepo, la gestión de los tiempos de espera de despliegue en Fly.io y la resolución de un error en el tiempo de ejecución de Bun.",
      "A pesar de estos obstáculos, la migración a Fly.io fue un éxito, y los autores mantienen su aprecio por el producto de Vercel."
    ],
    "commentSummary": [
      "El debate gira en torno a las experiencias y opiniones de los usuarios sobre la migración de su backend de Vercel a Fly.io, destacando los problemas con los despliegues poco fiables, la funcionalidad y los precios de Vercel.",
      "El impacto de Vercel en React, la rentabilidad de las funciones edge y lambda, y la estabilidad de la plataforma Fly.io son subtemas importantes dentro del discurso.",
      "En el debate también se mencionan plataformas alternativas como DigitalOcean, Render y Hetzner, y se habla de la disyuntiva entre ganancias a corto plazo y costes de mantenimiento a largo plazo en el despliegue de infraestructuras."
    ],
    "points": 139,
    "commentCount": 146,
    "retryCount": 0,
    "time": 1698612626
  }
]
