[
  {
    "title": "CFPB, 디지털 지갑 및 결제 앱을 제공하는 대형 기술 기업에 대한 규제 감독을 확대할 계획",
    "originLink": "https://www.consumerfinance.gov/about-us/newsroom/cfpb-proposes-new-federal-oversight-of-big-tech-companies-and-other-providers-of-digital-wallets-and-payment-apps/",
    "originBody": "",
    "originSummary": [
      "미국 소비자금융보호국(CFPB)은 디지털 지갑 및 결제 앱 제공업체와 같은 대형 비은행 기업에 대한 감독을 확대할 것을 제안하고 있습니다.",
      "연간 5백만 건 이상의 거래를 처리하는 기업은 소비자 보호법을 준수하고 공정한 경쟁을 촉진하고자 하는 CFPB에 따라 기존 은행 및 신용 조합과 동일한 규제 절차의 적용을 받을 수 있습니다.",
      "소비자 데이터 및 결제 시스템에 대한 기술 기업에 대한 CFPB의 과거 경고 이후 제안된 이 규칙은 2024년 1월 8일까지 확정 또는 기각될 예정입니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "The Consumer Financial Protection Bureau (CFPB) plan to extend its supervision to nonbank companies providing digital wallets and payment apps, if the companies handle over five million transactions annually.",
      "The proposed regulation aims to ensure these tech companies comply with consumer protection laws, promote fair competition with traditional banks and credit unions, and supervise the increase in firms entering the consumer finance market.",
      "The new regulation, which follows past warnings and data requests made by CFPB to tech firms about consumer data and payment systems, is set to be accepted or dismissed by January 8, 2024."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699449155731
  },
  {
    "title": "AI 기반 프로펠 홀딩스, 딜로이트가 선정한 북미에서 가장 빠르게 성장하는 500대 기업에 합류하다",
    "originLink": "https://finance.yahoo.com/news/propel-holdings-ranked-one-fastest-112100224.html",
    "originBody": "",
    "originSummary": [
      "Propel Holdings는 북미에서 빠르게 성장하는 기술 관련 기업을 소개하는 '2023 딜로이트 테크놀로지 패스트 500' 리스트에서 500위에 올랐습니다.",
      "기존 금융기관이 간과한 사람들에게 신용 접근성을 제공하는 Propel의 AI 플랫폼은 기술 혁신, 제품 품질, 지속 가능하고 수익성 있는 성장에 집중한 덕분에 매출이 234% 증가했습니다.",
      "딜로이트의 순위는 2019년부터 2022년까지 회계연도 매출 성장률을 기준으로 선정되며, 선정 조건은 기업이 상당한 독점 지적 재산 또는 기술을 보유하고, 이를 통해 대부분의 수익을 창출하며, 최소 4년 이상 운영되고, 북미에 기반을 두고 있어야 합니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "Propel Holdings has secured the 500th spot on the 2023 Deloitte Technology Fast 500, a list of the fastest-growing tech and associated companies in North America.",
      "Propel, known for its artificial intelligence-powered platform that enhances credit access for consumers neglected by traditional financial institutions, has witnessed a 234% growth in revenue.",
      "The ranking by Deloitte is influenced by fiscal year revenue growth from 2019 to 2022, and companies must hold proprietary intellectual property or technology which is integral to their products and revenue to qualify."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699449155731
  },
  {
    "title": "Paris: 마크롱의 75억 유로 이니셔티브에 힘입어 떠오르는 의료 기술 스타트업 허브",
    "originLink": "https://www.nature.com/articles/d41586-023-03490-9",
    "originBody": "",
    "originSummary": [
      "파리는 2030년까지 프랑스를 글로벌 헬스케어 혁신 리더로 만들겠다는 야심찬 목표를 가진 에마뉘엘 마크롱 프랑스 대통령의 75억 유로 이니셔티브에 힘입어 의료 기술 스타트업의 허브로 부상하고 있습니다.",
      "2020년부터 2022년까지 프랑스의 의료 기술 기업은 2,050개에서 2,640개로 증가했지만, 자금 조달과 관료적 장애물은 여전히 과제로 남아 있습니다.",
      "Resolve Stroke, DNA Script, Owkin과 같은 기업은 신경 모니터링 장치, 합성 DNA 가닥, 의료 진단을 위한 머신러닝 애플리케이션 등 혁신적인 기술을 개발하며 선두에 서 있습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "Paris is emerging as a hub for health-tech start-ups, fueled by a €7.5 billion initiative by French President Emmanuel Macron, who aims to place France as a global leader in healthcare innovation by 2030.",
      "The number of health-tech companies in France has grown from 2,050 in 2020 to 2,640 in 2022. Among them, Resolve Stroke, DNA Script, and Owkin are leading with their innovative technologies and methods.",
      "Despite this growth, challenges remain in terms of funding and bureaucratic obstacles, which could slow down the advancement and innovation pace."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699449155731
  },
  {
    "title": "메타, AI를 사용한 정치 광고에 대한 공개를 시행하고 민감한 산업에 대한 자체 도구를 금지합니다.",
    "originLink": "https://www.nytimes.com/2023/11/08/technology/meta-political-ads-artificial-intelligence.html",
    "originBody": "",
    "originSummary": [
      "메타(구 페이스북)는 정치 광고주가 타사 인공지능(AI) 소프트웨어를 활용하여 인물과 사건을 인위적으로 표현하는 경우 이를 공개하도록 의무화하는 정책을 시행하고 있습니다.",
      "트위터는 광고주가 정치 또는 사회적 이슈 광고는 물론 주택, 고용, 신용, 건강, 제약, 금융 서비스 관련 광고를 제작하는 데 자사의 AI 지원 소프트웨어를 사용하는 것을 금지하고 있습니다.",
      "이번 결정은 시각, 비디오 및 오디오 콘텐츠를 조작하기 위한 생성형 AI 도구의 사용이 증가함에 따라 잠재적 위험을 식별하고 민감하고 규제가 엄격한 산업에서 AI 사용에 대한 안전 조치를 구축하기 위해 내려졌습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "Meta, previously Facebook, is creating a policy to mandate political ad creators disclose when they use third-party AI tools to generate synthetic representations of individuals or events.",
      "The company plans to prohibit the use of its AI-assisted software for making political or social ads, as well as those related to housing, employment, credit, health, pharmaceuticals, and financial services.",
      "The initiative is a response to the growing use of generative AI tools known to manipulate multimedia content, aiming to assess potential risks and develop protective measures for AI use in sensitive and regulated sectors."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699449155731
  },
  {
    "title": "CFPB, 빅테크 디지털 결제 및 월렛 서비스에 대한 은행 수준의 규제 제안",
    "originLink": "https://www.reuters.com/technology/us-consumer-watchdog-proposes-rules-big-tech-payments-digital-wallets-2023-11-07/",
    "originBody": "",
    "originSummary": [
      "미국 소비자금융보호국(CFPB)은 알파벳, 애플, 페이팔, 블록의 캐시앱과 같은 주요 기업이 제공하는 디지털 결제 서비스에 대한 규제를 제안했습니다. 이는 소비자 안전장치의 필요성에 따른 것입니다.",
      "제안된 규정에 따라 이러한 기업들은 개인정보 보호, 경영진의 행동, 불공정하고 기만적인 관행에 대한 법률 준수와 관련하여 은행과 같은 감독을 받게 될 수 있습니다.",
      "이 법안이 통과되면 연간 130억 건 이상의 결제를 처리하는 17개 기업에 영향을 미치게 되며, 기술 및 금융 부문에서 동등한 감독을 보장하는 것을 목표로 합니다. 이 제안은 소비자 은행 협회와 전자 거래 협회로부터 호평을 받았습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "The Consumer Financial Protection Bureau (CFPB) has proposed regulation for large tech firms' digital payments and smartphone wallet services, calling for increased consumer safeguards.",
      "These regulations could subject companies, including Alphabet, Apple, PayPal, and Block’s CashApp, to bank-like oversight in areas such as privacy protections, conduct of executives, and compliance with laws against deceiving practices.",
      "The move is expected to affect 17 companies that handle over 13 billion payments annually, and has received support from the Consumer Bankers Association and the Electronic Transactions Association."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699449155731
  },
  {
    "title": "데이터뱅크, 234% 매출 증가를 기록하며 딜로이트의 2023년 테크놀로지 패스트 500 리스트에 선정되었습니다.",
    "originLink": "https://www.prnewswire.com/news-releases/databank-ranked-among-the-fastest-growing-companies-in-north-america-on-the-2023-deloitte-technology-fast-500-301980973.html",
    "originBody": "",
    "originSummary": [
      "데이터뱅크는 2023년 딜로이트 테크놀로지 패스트 500에 선정되어 북미에서 가장 빠르게 성장하는 기업 중 하나로 인정받았습니다.",
      "엔터프라이즈, 하이퍼스케일, AI 고객의 수요 증가와 전략적 토지 및 인프라 발전에 힘입어 234%라는 놀라운 매출 성장을 달성했습니다.",
      "데이터뱅크의 CEO인 라울 마르티넥은 27개 이상의 시장으로 성공적으로 확장하고 유연한 데이터홀 디자인을 개발한 것이 회사의 성장에 크게 기여했다고 주장합니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "DataBank is named as one of the fastest-growing companies in North America on the 2023 Deloitte Technology Fast 500, reporting a 234% revenue growth.",
      "The company attributes this success to increased demand from enterprise, hyperscale, and AI customers as well as strategic land investments and infrastructure innovations.",
      "CEO Raul Martynek attributes expansion into more than 27 markets and the development of a flexible data hall design as significant contributors to their success."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699449155731
  },
  {
    "title": "캐나다의 인재 기업 토스트, AI를 활용하여 기술 채용의 성별 편견에 맞서다",
    "originLink": "https://www.forbes.com/sites/meimeifox/2023/11/07/how-talent-company-toast-eliminates-gender-bias-in-tech-hiring/",
    "originBody": "",
    "originSummary": [
      "에이프릴 히크와 마리사 맥닐랜드가 공동 설립한 인재 개발 회사 토스트는 기술 기업에 여성을 배치하는 데 집중함으로써 STEM 채용의 성 편견을 해소하는 것을 목표로 합니다.",
      "캐나다의 이 조직은 지원자의 이름, 이전 직장, 학력 등의 정보를 익명화하여 성별 및 사회경제적 편견을 없애는 AI 기반 도구를 사용합니다.",
      "2022년에 이미 6,000명 이상의 여성과 70개 파트너 조직과 함께 출범한 토스트는 2024년에 미국으로 확장할 계획이며, 기술 분야 여성을 위한 멘토링과 성장 기회를 위한 멤버십 그룹을 운영합니다. ESG 보고에서 성별 다양성을 우선시하는 기업에 대한 연방 정부의 지원을 받고 있습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "Toast, a Canadian talent company co-founded by April Hicke and Marissa McNeelands, aims to tackle gender bias in STEM recruitments by focusing on placing women in tech roles.",
      "The company uses an AI-powered recruitment tool that eliminates gender and socioeconomic biases by anonymizing candidate profiles. Despite being founded only in 2022, it boasts over 6,000 women and 70 partner organizations.",
      "Toast receives backing from the federal government for organizations incorporating gender diversity in their ESG (Environmental, Social, and Governance) reporting in 2024 and plans to begin U.S. operations that year. It also operates a mentorship program for women in tech."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699449155731
  }
]
