[
  {
    "id": 40531100,
    "title": "Navrhovanie aplikácií pre extrémne výzvy v oblasti pripojenia: Poučenie z Antarktídy",
    "originLink": "https://brr.fyi/posts/engineering-for-slow-internet",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40531100",
    "commentBody": "",
    "originSummary": [
      "IT pracovník antarktického programu Spojených štátov sa podelí o skúsenosti s používaním internetu v prostredí s obmedzenou šírkou pásma, ako je McMurdo a Južný pól, od augusta 2022 do novembra 2023.",
      "Príspevok poukazuje na závažné problémy s pripojením vrátane vysokej latencie, nízkej rýchlosti a častých výpadkov, ktoré ovplyvňujú použiteľnosť moderných webových aplikácií.",
      "Autor kritizuje vývojárov aplikácií za to, že neumožňujú pomalé a prerušované spojenia, a navrhuje vylepšenia, ako sú flexibilné časové limity, postupné nahrávanie a robustní správcovia sťahovania, aby sa zlepšila použiteľnosť vo vzdialených oblastiach."
    ],
    "commentSummary": [
      "Diskusia poukazuje na problémy spojené s používaním internetu v oblastiach so slabým pripojením a vyzýva vývojárov, aby vytvárali efektívnejšie a prístupnejšie webové aplikácie.",
      "Používatelia kritizujú moderné webové aplikácie za to, že sú preplnené a neefektívne, a zdôrazňujú potrebu výkonných aplikácií pre všetkých používateľov, nielen pre tých s vysokorýchlostným internetom.",
      "V diskusii sa skúmajú riešenia, ako je vlastná obfuskácia VPN, moderné rámce JavaScriptu, vykresľovanie na strane servera a optimalizácia generátorov statických stránok na zlepšenie výkonu webu v premenlivých a nespoľahlivých podmienkach internetu."
    ],
    "points": 701,
    "commentCount": 276,
    "retryCount": 0,
    "time": 1717124765
  },
  {
    "id": 40530670,
    "title": "Japonsko vyčlenilo 10 miliárd jüanov na sprístupnenie všetkého výskumu financovaného z verejných zdrojov do roku 2025",
    "originLink": "https://www.nature.com/articles/d41586-024-01493-8",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40530670",
    "commentBody": "",
    "originSummary": [
      "Japonsko vyčleňuje 10 miliárd jüanov pre univerzity na vytvorenie inštitucionálnych repozitárov, aby sa do januára 2025 sprístupnil všetok výskum financovaný z verejných zdrojov.",
      "Výskumní pracovníci s vládnym financovaním musia svoje práce sprístupňovať voľne, pričom sa musia zamerať na \"zelenú OA\" (autorsky akceptované verzie) kvôli vysokým nákladom na \"zlatú OA\" (vydavateľská verzia).",
      "Cieľom tejto iniciatívy je zlepšiť sledovateľnosť výskumu, uľahčiť sekundárny výskum, podporiť spoluprácu a riešiť klesajúcu medzinárodnú pozíciu Japonska v oblasti výskumu v súlade s celosvetovými trendmi otvoreného prístupu."
    ],
    "commentSummary": [
      "Japonská snaha o otvorený prístup k výskumu (OA) vyvolala diskusiu o finančných a kvalitatívnych dôsledkoch publikovania OA, ktoré je často kritizované ako \"platenie za publikovanie\".",
      "V diskusii sa dáva do kontrastu \"zelená OA\" (samoarchivácia) a \"zlatá OA\" (platenie vydavateľom), pričom sa zdôrazňujú vysoké náklady na túto formu a navrhujú sa alternatívy, ako sú národné repozitáre a dobrovoľnícke recenzné konania.",
      "V diskusii sa zdôrazňuje potreba systémových zmien na demokratizáciu prístupu k výskumu, pričom sa vyjadrujú obavy o udržateľnosť a kvalitu modelov OA a výzvy na lepšie riadenie údajov a akademické stimuly na zdieľanie údajov."
    ],
    "points": 599,
    "commentCount": 91,
    "retryCount": 0,
    "time": 1717119960
  },
  {
    "id": 40531984,
    "title": "Majiteľ domu skrýva loď s realistickou nástennou maľbou na plote, je virálny",
    "originLink": "https://news.artnet.com/art-world/fence-boat-painting-artist-hanif-panni-2487875",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40531984",
    "commentBody": "",
    "originSummary": [
      "Majiteľ domu Etienne Constable v meste Seaside v Kalifornii reagoval na nariadenie mesta ukryť svoju loď tým, že si objednal nástennú maľbu lode na plote, ktorú namaľoval umelec Hanif Panni.",
      "Nástenná maľba, chválená pre svoj štýl trompe-l'oeil a umeleckú kvalitu, sa stala virálnou a pritiahla značnú pozornosť médií a sociálnych sietí.",
      "Kreatívne riešenie vyvolalo diskusie o verejnom umení a tvorivosti komunity, pričom Panni dostáva viac žiadostí o nástenné maľby vďaka pozitívnemu prijatiu."
    ],
    "commentSummary": [
      "Istý muž si namaľoval na plot svoju loď, aby dodržal pravidlo združenia vlastníkov bytov, čím rozpútal diskusiu o úlohe a vplyve združení vlastníkov bytov (HOA).",
      "Názory sa rozchádzajú: niektorí tvrdia, že spoločenstvá vlastníkov bytov a nebytových priestorov sú nevyhnutné na zachovanie hodnoty nehnuteľností a noriem komunity, zatiaľ čo iní ich kritizujú za nadmernú kontrolu a diskriminačné praktiky.",
      "Diskusia zdôrazňuje zložitosť rovnováhy medzi individuálnymi slobodami a kolektívnymi výhodami, výzvy na zabránenie vzniku domov vlastníkov bytov v nových projektoch a širšie témy slobody, vlastníckych práv a miestnej správy."
    ],
    "points": 422,
    "commentCount": 350,
    "retryCount": 0,
    "time": 1717135706
  },
  {
    "id": 40531699,
    "title": "Nástroj na simuláciu globálneho slnka vizualizuje tiene v reálnom čase",
    "originLink": "https://shademap.app",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40531699",
    "commentBody": "",
    "originSummary": [
      "MapLibre Open Menu PRO zavádza funkciu globálnej simulácie slnka, ktorá používateľom umožňuje vizualizovať zmeny tieňa počas dňa pomocou interakcie s časovou osou.",
      "Táto funkcia poskytuje podrobné údaje o polohe slnka, ako je nadmorská výška a azimut, čím zvyšuje presnosť simulácií tieňov.",
      "Tento nástroj je obzvlášť užitočný pri aplikáciách, ktoré si vyžadujú presnú analýzu slnečného svetla a tieňov, ako je napríklad mestské plánovanie a architektúra."
    ],
    "commentSummary": [
      "Bol vydaný nový nástroj s názvom shademap.app, ktorý simuluje tiene z hôr, budov a stromov na celom svete v danom čase.",
      "Tento nástroj si získava pozornosť pre svoju schopnosť poskytovať podrobné simulácie tieňov, ktoré môžu byť užitočné pre rôzne aplikácie, ako je napríklad mestské plánovanie a vonkajšie aktivity.",
      "Pôvodná diskusia o tomto nástroji na portáli Hacker News bola presunutá do iného vlákna, čo svedčí o značnom záujme a zapojení technologickej komunity."
    ],
    "points": 376,
    "commentCount": 1,
    "retryCount": 0,
    "time": 1717132164
  },
  {
    "id": 40531301,
    "title": "Pochopenie šifrovania AWS S3: Viac kontroly prístupu ako skutočné šifrovanie",
    "originLink": "https://blog.plerion.com/things-you-wish-you-didnt-need-to-know-about-s3/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40531301",
    "commentBody": "",
    "originSummary": [
      "V článku sa skúmajú rôzne metódy šifrovania pre vedrá AWS S3 a zdôrazňuje sa, že šifrovanie S3 funguje viac ako kontrola prístupu než bežné šifrovanie.",
      "Pochopenie tohto rozdielu je kľúčové pre pochopenie bezpečnostných dôsledkov a správne využívanie funkcií šifrovania S3."
    ],
    "commentSummary": [
      "Diskusia o súborovom systéme Amazon S3, ktorý rozlišuje veľké a malé písmená, odhaľuje rôzne názory na jeho užitočnosť a zložitosť, pričom niektorí ho považujú za užitočný na organizáciu a iní ho považujú za mätúci vzhľadom na systémy, ktoré nerozlišujú veľké a malé písmená, ako napríklad Windows.",
      "V diskusii sa poukazuje na problémy spojené so správou názvov súborov s rozlišovaním veľkých a malých písmen v rôznych prostrediach, pričom sa poukazuje na výhody pre terminály, ale menšiu intuitívnosť pre grafické používateľské rozhrania, a kritizuje sa zaobchádzanie s rozlišovaním veľkých a malých písmen v systémoch Windows a MacOS.",
      "Rozhovor sa zaoberá aj praktickými aspektmi služby AWS S3, ako je správa rozsiahlych vymazaní, náklady na neúplné viacdielne nahrávanie a osvedčené postupy optimalizácie služieb AWS, ako je CloudFront, na ukladanie do vyrovnávacej pamäte a zníženie latencie."
    ],
    "points": 286,
    "commentCount": 171,
    "retryCount": 0,
    "time": 1717127491
  },
  {
    "id": 40534868,
    "title": "Narušenie údajov Snowflake vystavuje 400 spoločností, hacker požaduje výkupné 20 miliónov dolárov",
    "originLink": "https://www.hudsonrock.com/blog/snowflake-massive-breach-access-through-infostealer-infection",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40534868",
    "commentBody": "",
    "originSummary": [
      "Dňa 31. mája 2024 spoločnosť Hudson Rock oznámila závažné porušenie ochrany údajov v spoločnosti Snowflake, ktorá je významným poskytovateľom cloudových úložísk, v dôsledku infekcie Infostealerom.",
      "Porušenie vzniklo odcudzením poverovacích údajov účtu ServiceNow zamestnanca spoločnosti Snowflake, čo viedlo k exfiltracii údajov z potenciálne 400 spoločností a pokusu o vydieranie vo výške 20 miliónov dolárov.",
      "Spoločnosť Hudson Rock potvrdila pravosť narušenia a zdôraznila, že sa mu dalo ľahko predísť, čím poukázala na rastúcu hrozbu infekcií Infostealer v rámci počítačovej kriminality."
    ],
    "commentSummary": [
      "Hacker získal prístup do demonštračného prostredia spoločnosti Snowflake pomocou ukradnutých poverení z kompromitovaného počítača obchodného inžiniera, pričom využil problém s procesom s nevypršaním platnosti zdieľaných poverení.",
      "Narušenie sa netýkalo skutočných zákazníckych účtov, čo je v rozpore s tvrdeniami o \"stovkách narušených zákazníkov\", a poukazuje na dôležitosť správnej správy poverení a zabezpečenia zariadení.",
      "Incident vyvolal diskusie o bezpečnostných postupoch spoločnosti Snowflake, dôveryhodnosti spravodajského zdroja Hudson Rock a širších dôsledkoch útokov založených na identite v technologickom odvetví."
    ],
    "points": 276,
    "commentCount": 88,
    "retryCount": 0,
    "time": 1717162088
  },
  {
    "id": 40529355,
    "title": "Energeticky efektívne jednobitové jazykové modely: Menšie, rýchlejšie a takmer rovnako presné",
    "originLink": "https://spectrum.ieee.org/1-bit-llm",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40529355",
    "commentBody": "",
    "originSummary": [
      "1-bitové jazykové modely (LLM) predstavujú sľubné riešenie vysokých energetických nárokov umelej inteligencie, pretože sú efektívnejšie.",
      "Tieto modely sú v porovnaní s tradičnými modelmi menšie a rýchlejšie, takže sú praktickejšie na rôzne aplikácie.",
      "Napriek zmenšenej veľkosti si 1-bitové LLM zachovávajú takmer rovnakú úroveň presnosti ako ich väčšie náprotivky."
    ],
    "commentSummary": [
      "Diskusia sa zameriava na výhody a výzvy používania kvantifikovaných jazykových modelov (LLM) na zvýšenie efektívnosti a zníženie požiadaviek na zdroje pri zachovaní presnosti.",
      "Pokročilé metódy, ako napríklad IQ2_XS, sú zdôraznené na zmiernenie straty kvality vo vysoko trénovaných modeloch, ako je Llama3, spôsobenej kvantizáciou.",
      "V rozhovore sa skúma aj budúcnosť systémov LLM, pričom sa navrhuje posun smerom k modulárnym systémom a zdôrazňuje sa potreba vyvážiť výpočtové náklady, kvalitu a environmentálne aspekty."
    ],
    "points": 262,
    "commentCount": 138,
    "retryCount": 0,
    "time": 1717107482
  },
  {
    "id": 40535895,
    "title": "Standard Ebooks oslavuje 1000. vydanie knihy Jamesa Joycea \"Ulysses\"",
    "originLink": "https://standardebooks.org/ebooks/james-joyce/ulysses",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40535895",
    "commentBody": "",
    "originSummary": [
      "\"Odysseus\" od Jamesa Joycea je zásadný román anglickej literatúry, ktorý opisuje jeden deň v Dubline 16. júna 1904 prostredníctvom života Stephena Dedalusa a Leopolda Blooma.",
      "Román je známy svojimi inovatívnymi rozprávačskými postupmi a štylistickou rozmanitosťou, pričom sa v ňom objavujú paralely s Homérovou Odyseou. Spočiatku čelil právnym námietkam pre obscénnosť, čo spôsobilo odklad jeho úplného vydania až do roku 1922.",
      "Toto vydanie Standard Ebooks vychádza z prvého vydania z roku 1922 s opravami errat z obdobia pred rokom 1929 a v USA je bez autorských práv, hoci v iných regiónoch môže byť stále obmedzené."
    ],
    "commentSummary": [
      "Spoločnosť Standard Ebooks vydala svoj 1000. titul, knihu \"Ulysses\" od Jamesa Joycea, ktorá na portáli Hacker News vyvolala diskusiu o jej skóre 74,9 Flesch Reading Ease, a to napriek zložitej próze.",
      "Používatelia diskutujú o vhodnosti algoritmov čitateľnosti pre modernistickú literatúru a navrhujú alternatívne metódy hodnotenia náročnosti kníh, pričom diskutujú aj o stratégiách čítania \"Odyssea\" a kvalite ponuky Standard Ebooks.",
      "Rozhovor zahŕňa problémy s technickým vybavením stránky, porovnanie s Gutenberg.org a subjektívnu povahu hodnotenia literatúry, najmä pre tých, pre ktorých angličtina nie je rodným jazykom."
    ],
    "points": 227,
    "commentCount": 85,
    "retryCount": 0,
    "time": 1717166755
  },
  {
    "id": 40527730,
    "title": "Mozilla vylepšuje Firefox o zoskupovanie kariet, vertikálne karty a funkcie umelej inteligencie v zariadení",
    "originLink": "https://blog.mozilla.org/en/mozilla/heres-what-were-working-on-in-firefox/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40527730",
    "commentBody": "",
    "originSummary": [
      "Spoločnosť Mozilla vylepšuje Firefox o funkcie, ktoré požadovali používatelia, ako napríklad zoskupovanie kariet, vertikálne karty, bočný panel a systém správy profilov na oddelenie rôznych činností pri prehliadaní.",
      "Medzi novinky patria prispôsobiteľné tapety nových kariet, zjednodušené nastavenia ochrany osobných údajov a vylepšenia výkonu, ktoré urýchľujú načítanie stránok, zvyšujú efektivitu batérie a zlepšujú kompatibilitu s rôznymi prehliadačmi.",
      "Vylepšenia ochrany osobných údajov sa zameriavajú na lokálne spracovanie zariadení pre úlohy, ako je preklad a úprava PDF, a Mozilla skúma umelú inteligenciu v zariadení pre funkcie, ako je alt-text pre PDF generovaný umelou inteligenciou."
    ],
    "commentSummary": [
      "Nedávne aktualizácie prehliadača Firefox zjednodušili ponuky, čo vyvolalo rozporuplné reakcie; niektorí používatelia tieto zmeny oceňujú, zatiaľ čo iní majú pocit, že sa tým znižuje prehľadnosť a funkčnosť pre náročných používateľov.",
      "Kritika presahuje rámec návrhu používateľského rozhrania a týka sa aj vedenia Mozilly a vonkajších tlakov, ako je vplyv spoločnosti Google, pričom sa diskutuje o prideľovaní zdrojov a rovnováhe medzi prispôsobením používateľom a bezpečnosťou.",
      "Napriek klesajúcemu podielu na trhu si Firefox udržiava vernú používateľskú základňu vďaka funkciám, ako je \"úžasná lišta\" a možnosti prispôsobenia, pričom návrhy na zlepšenie zahŕňajú lepšiu správu kariet, ovládanie rozšírení a zvýšenie výkonu."
    ],
    "points": 227,
    "commentCount": 237,
    "retryCount": 0,
    "time": 1717097525
  },
  {
    "id": 40533761,
    "title": "Upgrade CPU základnej dosky Intel Hack: Kaptonová páska a úpravy BIOSu umožňujú použitie novších procesorov",
    "originLink": "https://hackaday.com/2024/05/31/intels-anti-upgrade-tricks-defeated-with-kapton-tape/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40533761",
    "commentBody": "",
    "originSummary": [
      "Základné dosky Intel s čipovými sadami Z170 alebo Z270 oficiálne podporujú procesory Kaby Lake až do 7. generácie, ale používatelia môžu aktivovať procesory Coffee Lake 8. a 9. generácie prostredníctvom \"Coffee Mod\", ktorý zahŕňa opravy pásky Kapton a úpravy systému BIOS.",
      "Modifikácia \"Coffee Mod\" umožňuje zachovať kompatibilitu so staršími procesormi a ukazuje snahu komunity obísť obmedzujúce postupy spoločnosti Intel.",
      "Budúce bezpečnostné opatrenia spoločnosti Intel, ako napríklad BootGuard, môžu týmto úpravám brániť, čo je v rozpore so širšou podporou procesorov AMD."
    ],
    "commentSummary": [
      "Spoločnosť Intel je kritizovaná za obmedzenie kompatibility so soketmi CPU, čo sa považuje za stratégiu na zvýšenie zisku alebo za dohodu s výrobcami základných dosiek.",
      "Napriek minimálnym zmenám v procesoroch počas šiestich rokov spoločnosť Intel predávala každý z nich ako novú generáciu, pričom upravovala kompatibilitu, komplikovala aktualizácie a frustrovala používateľov.",
      "Porovnávajú sa s poctivejšími postupnými aktualizáciami v automobiloch a telefónoch, pričom sa diskutuje o technickom zdôvodnení, dynamike trhu a potenciálnej konkurencii zo strany RISC-V a ARM."
    ],
    "points": 218,
    "commentCount": 96,
    "retryCount": 0,
    "time": 1717155449
  },
  {
    "id": 40533484,
    "title": "Malenfant.net: Decentralizovaná sociálna sieť s ochranou súkromia a funkciami v reálnom čase",
    "originLink": "https://malenfant.net/@didier/112528487189999791",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40533484",
    "commentBody": "",
    "originSummary": [
      "Malenfant.net je decentralizovaná sociálna sieť poháňaná systémom Mastodon, ktorá umožňuje používateľom vytvárať účty, sledovať profily alebo hashtagy a komunikovať s príspevkami.",
      "Platforma ponúka funkcie, ako sú živé kanály, klávesové skratky, a poskytuje informácie o svojich zásadách ochrany osobných údajov a štatistikách serverov.",
      "Táto stránka je príkladom rastúceho trendu decentralizovaných sociálnych médií, ktoré kladú dôraz na kontrolu používateľov a ich súkromie."
    ],
    "commentSummary": [
      "Služba Discord je chválená pre svoje používateľsky prívetivé rozhranie, komunikáciu v reálnom čase a integrovaný hlasový a video chat, vďaka čomu je obľúbená pri hraní hier a sociálnych interakciách.",
      "Medzi kritické pripomienky k službe Discord patrí slabá organizácia, nedostatočná možnosť vyhľadávania a obavy o ochranu osobných údajov, čo ju robí menej ideálnou na uchovávanie znalostí a technickej dokumentácie.",
      "Alternatívy ako fóra, Discourse a IRC ponúkajú lepšie uchovávanie informácií, ale majú problémy s prijatím používateľmi kvôli zložitosti a nedostatku moderných funkcií, čo odráža generačný posun k pohodlnejším platformám."
    ],
    "points": 216,
    "commentCount": 216,
    "retryCount": 0,
    "time": 1717153211
  },
  {
    "id": 40528192,
    "title": "Miestne riešenia s umelou inteligenciou na efektívne vyhľadávanie v PDF na Macu",
    "originLink": "https://news.ycombinator.com/item?id=40528192",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40528192",
    "commentBody": "",
    "originSummary": [
      "Používateľ hľadá lokálne riešenie s umelou inteligenciou na správu a vyhľadávanie citlivých súborov PDF uložených v službe iCloud, ktoré sa zameriava na dotazy založené na obsahu bez manuálneho označovania.",
      "Riešenie by malo uprednostňovať odvolanie pred presnosťou a malo by byť kompatibilné so softvérom pre počítače Mac s dôrazom na moderné, hotové prístupy.",
      "Príklad dotazu: \"Ukáž mi všetky daňové doklady za august 2023.\""
    ],
    "commentSummary": [
      "Používateľ hľadá lokálne riešenie s umelou inteligenciou na vyhľadávanie citlivých súborov PDF na iCloude a uprednostňuje softvér pre Mac, ktorý nevyžaduje označovanie a uprednostňuje odvolanie pred presnosťou.",
      "Medzi návrhy patria vlastné nástroje využívajúce miestne veľké jazykové modely (LLM), RAG CLI od LlamaIndex a prevod PDF na markdown, pričom na OCR a QA sa spomínajú nástroje ako pypdf, mupdf a Phi-3-vision.",
      "V diskusii sa zdôrazňuje význam účinných procesov spracovania dokumentov, potenciál modelov umelej inteligencie pri zlepšovaní možností vyhľadávania a obavy týkajúce sa ochrany osobných údajov a užitočnosti rozsiahlych digitálnych archívov."
    ],
    "points": 215,
    "commentCount": 76,
    "retryCount": 0,
    "time": 1717100645
  },
  {
    "id": 40533622,
    "title": "Krita oslavuje 25 rokov vývoja a inovácií v digitálnom umení",
    "originLink": "https://krita.org/en/posts/2024/krita-25-years/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40533622",
    "commentBody": "",
    "originSummary": [
      "Krita, aplikácia na digitálne maľovanie, sa počas 25 rokov vyvíjala od KImageShopu až po svoju súčasnú podobu, pričom prekonala viacero reštartov a technických výziev.",
      "Medzi hlavné míľniky patrí prechod z Qt3 na Qt4, rozšírenie na Windows a MacOS a prekonanie finančných prekážok prostredníctvom fundraisingu a podpory komunity.",
      "Projekt sa teraz pripravuje na verziu Krita 6.0, ktorá zahŕňa port do Qt6, pričom posledné verzie sa zameriavajú na použiteľnosť a nové funkcie a pokračuje vývoj podporovaný darmi a zapojením komunity."
    ],
    "commentSummary": [
      "Krita, bezplatný softvér na digitálne maľovanie s otvoreným zdrojovým kódom, je chválený pre svoje animačné nástroje a jednoduché používanie, najmä pri úprave snímok GIF, ktoré niektorým komerčným alternatívam chýbajú.",
      "Napriek svojej 25-ročnej histórii získala Krita významné uznanie až v poslednom desaťročí a často sa odporúča na úlohy digitálneho maľovania namiesto GIMPu.",
      "V diskusiách sa zdôrazňujú problémy s používaním Fedory 40 pre digitálnych umelcov kvôli problémom so softvérom pre tablety a Krita nie je aplikáciou Wayland, pričom niektorí navrhujú ako lepšiu alternatívu OpenSUSE."
    ],
    "points": 202,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1717154331
  }
]
