[
  {
    "id": 40531100,
    "title": "Sovellusten suunnittelu äärimmäisiä yhteyshaasteita varten: Etelämantereella saadut kokemukset",
    "originLink": "https://brr.fyi/posts/engineering-for-slow-internet",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40531100",
    "commentBody": "",
    "originSummary": [
      "Yhdysvaltain Etelämanner-ohjelman IT-työntekijä kertoo kokemuksia Internetin käytöstä McMurdon ja etelänavan kaltaisissa kaistanleveysrajoitteisissa ympäristöissä elokuusta 2022 marraskuuhun 2023.",
      "Postauksessa korostetaan vakavia yhteyshaasteita, kuten suurta latenssia, hitaita nopeuksia ja toistuvia katkoksia, jotka vaikuttavat nykyaikaisten verkkosovellusten käytettävyyteen.",
      "Kirjoittaja kritisoi sovelluskehittäjiä siitä, että he eivät ole ottaneet huomioon hitaita ja katkonaisia linkkejä, ja ehdottaa parannuksia, kuten joustavia aikakatkaisuja, portaittaisia latauksia ja vankkoja lataushallintajärjestelmiä, joilla parannetaan käytettävyyttä syrjäseuduilla."
    ],
    "commentSummary": [
      "Keskustelussa korostetaan internetin käytön haasteita alueilla, joilla on huonot yhteydet, ja kehotetaan kehittäjiä luomaan tehokkaampia ja helppokäyttöisempiä verkkosovelluksia.",
      "Käyttäjät arvostelevat nykyaikaisia verkkosovelluksia paisuneiksi ja tehottomiksi ja korostavat, että suorituskykyisiä sovelluksia tarvitaan kaikille käyttäjille, ei vain niille, joilla on nopea internet.",
      "Keskustelussa tarkastellaan ratkaisuja, kuten mukautettua VPN-verkon peittämistä, nykyaikaisia JavaScript-kehyksiä, palvelinpuolen renderöintiä ja staattisten sivustogeneraattoreiden optimointia, joilla parannetaan verkkosuorituskykyä vaihtelevissa ja epäluotettavissa internet-olosuhteissa."
    ],
    "points": 701,
    "commentCount": 276,
    "retryCount": 0,
    "time": 1717124765
  },
  {
    "id": 40530670,
    "title": "Japani myöntää 10 miljardia jeniä kaiken julkisesti rahoitetun tutkimuksen saattamiseksi avoimeksi vuoteen 2025 mennessä.",
    "originLink": "https://www.nature.com/articles/d41586-024-01493-8",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40530670",
    "commentBody": "",
    "originSummary": [
      "Japani osoittaa 10 miljardia jeniä yliopistoille institutionaalisten arkistojen perustamiseksi, jotta kaikki julkisesti rahoitettu tutkimus olisi avointa tammikuuhun 2025 mennessä.",
      "Valtion rahoitusta saavien tutkijoiden on asetettava julkaisunsa vapaasti saataville ja keskityttävä \"vihreään avoimeen julkaisemiseen\" (tekijän hyväksymät versiot), koska \"kultainen avoimeen julkaisemiseen\" (kustantajan versio) liittyvät kustannukset ovat korkeat.",
      "Aloitteella pyritään parantamaan tutkimuksen jäljitettävyyttä, helpottamaan sekundaaritutkimusta, edistämään yhteistyötä ja puuttumaan Japanin heikentyneeseen kansainväliseen asemaan tutkimustoiminnassa sekä noudattamaan maailmanlaajuisia avoimen saatavuuden suuntauksia."
    ],
    "commentSummary": [
      "Japanin pyrkimys avoimen julkaisemisen (open access, OA) tutkimukseen on herättänyt keskustelua siitä, millaisia taloudellisia ja laadullisia vaikutuksia OA-julkaisemisella on, ja sitä kritisoidaan usein nimellä \"pay to publish\".",
      "Keskustelussa asetetaan vastakkain \"vihreä avoin julkaiseminen\" (itsearkistointi) ja \"kultainen avoin julkaiseminen\" (kustantajille maksaminen), korostetaan jälkimmäisen korkeita kustannuksia ja ehdotetaan vaihtoehtoja, kuten kansallisia arkistoja ja vapaaehtoisvoimin toteutettavia vertaisarviointiprosesseja.",
      "Keskustelussa korostuu tarve tehdä järjestelmällisiä muutoksia tutkimuksen saatavuuden demokratisoimiseksi, ja siinä ollaan huolissaan avoimen julkaisemisen mallien kestävyydestä ja laadusta sekä vaaditaan parempaa tiedonhallintaa ja akateemisia kannustimia tiedon jakamiseen."
    ],
    "points": 599,
    "commentCount": 91,
    "retryCount": 0,
    "time": 1717119960
  },
  {
    "id": 40531984,
    "title": "Asunnon omistaja piilottaa veneen aidan realistisella seinämaalauksella, menee nettiin",
    "originLink": "https://news.artnet.com/art-world/fence-boat-painting-artist-hanif-panni-2487875",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40531984",
    "commentBody": "",
    "originSummary": [
      "Kalifornian Seasidessa asuva Etienne Constable vastasi kaupungin määräykseen piilottaa veneensä tilaamalla taiteilija Hanif Pannin maalaaman seinämaalauksen veneestä aidan päälle.",
      "Maalausta, jota kehuttiin sen trompe-l'oeil-tyylistä ja taiteellisesta laadusta, levitettiin laajalti, ja se herätti paljon huomiota tiedotusvälineissä ja sosiaalisessa mediassa.",
      "Luova ratkaisu on herättänyt keskustelua julkisesta taiteesta ja yhteisöllisestä luovuudesta, ja Panni on saanut lisää seinämaalauspyyntöjä myönteisen vastaanoton ansiosta."
    ],
    "commentSummary": [
      "Mies maalasi veneensä aitaansa noudattaakseen HOA:n sääntöä, mikä herätti keskustelua omakotiyhdistysten (HOA) roolista ja vaikutuksesta.",
      "Mielipiteet jakautuvat: joidenkin mielestä HOA:t ovat välttämättömiä kiinteistöjen arvojen ja yhteisön normien ylläpitämiseksi, kun taas toiset kritisoivat niitä liiallisesta valvonnasta ja syrjivistä käytännöistä.",
      "Keskustelussa korostetaan yksilönvapauksien ja kollektiivisten hyötyjen tasapainottamisen monimutkaisuutta, haasteita, joita liittyy HOA:iden välttämiseen uusissa rakennuskohteissa, sekä vapauden, omistusoikeuksien ja paikallishallinnon laajempia teemoja."
    ],
    "points": 422,
    "commentCount": 350,
    "retryCount": 0,
    "time": 1717135706
  },
  {
    "id": 40531699,
    "title": "Globaali auringon simulointityökalu visualisoi varjot reaaliajassa",
    "originLink": "https://shademap.app",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40531699",
    "commentBody": "",
    "originSummary": [
      "MapLibre Open Menu PRO esittelee globaalin aurinkosimulaatio-ominaisuuden, jonka avulla käyttäjät voivat visualisoida varjojen muutoksia päivän aikana aikajanan avulla.",
      "Ominaisuus tarjoaa yksityiskohtaisia auringon sijaintitietoja, kuten korkeuden ja atsimuutin, mikä parantaa varjosimulaatioiden tarkkuutta.",
      "Tämä työkalu on erityisen hyödyllinen sovelluksissa, jotka edellyttävät tarkkaa auringonvalon ja varjon analysointia, kuten kaupunkisuunnittelussa ja arkkitehtuurissa."
    ],
    "commentSummary": [
      "Uusi työkalu nimeltä shademap.app on julkaistu, ja se simuloi vuorten, rakennusten ja puiden varjoja maailmanlaajuisesti millä tahansa hetkellä.",
      "Tämä työkalu on saanut huomiota, koska sen avulla voidaan tuottaa yksityiskohtaisia varjosimulaatioita, joista voi olla hyötyä erilaisissa sovelluksissa, kuten kaupunkisuunnittelussa ja ulkoilussa.",
      "Alkuperäinen keskustelu tästä työkalusta Hacker Newsissa on siirretty toiseen viestiketjuun, mikä osoittaa, että teknologiayhteisö on kiinnostunut ja sitoutunut siihen."
    ],
    "points": 376,
    "commentCount": 1,
    "retryCount": 0,
    "time": 1717132164
  },
  {
    "id": 40531301,
    "title": "AWS S3 -salauksen ymmärtäminen: Enemmän pääsynvalvontaa kuin todellista salausta",
    "originLink": "https://blog.plerion.com/things-you-wish-you-didnt-need-to-know-about-s3/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40531301",
    "commentBody": "",
    "originSummary": [
      "Artikkelissa tarkastellaan AWS S3 -kaukaloiden eri salausmenetelmiä ja korostetaan, että S3-salaus toimii enemmän pääsynvalvonnan kuin perinteisen salauksen tavoin.",
      "Tämän eron ymmärtäminen on ratkaisevan tärkeää, jotta voit ymmärtää turvallisuusvaikutukset ja käyttää S3:n salausominaisuuksia oikein."
    ],
    "commentSummary": [
      "Keskustelu Amazon S3:n case-sensitive-tiedostojärjestelmästä paljastaa eriäviä mielipiteitä sen hyödyllisyydestä ja monimutkaisuudesta: jotkut pitävät sitä hyödyllisenä organisoinnin kannalta ja toiset pitävät sitä hämmentävänä, koska se ei ole case-sensitive-järjestelmissä, kuten Windowsissa.",
      "Keskustelussa tuodaan esiin haasteet, joita liittyy isojen ja pienten kirjainten tiedostojen nimien hallintaan eri ympäristöissä, ja todetaan, että päätelaitteissa on hyötyä, mutta graafisissa käyttöliittymissä se on vähemmän intuitiivista, ja arvostellaan isojen ja pienten kirjainten herkkyyden käsittelyä Windowsissa ja MacOS:ssä.",
      "Keskustelussa käsitellään myös AWS S3:n käytännön näkökohtia, kuten laajamittaisten poistojen hallintaa, epätäydellisistä moniosaisista latauksista aiheutuvia kustannuksia ja parhaita käytäntöjä AWS-palvelujen, kuten CloudFrontin, optimoimiseksi välimuistitallennuksen ja viiveen vähentämiseksi."
    ],
    "points": 286,
    "commentCount": 171,
    "retryCount": 0,
    "time": 1717127491
  },
  {
    "id": 40534868,
    "title": "Snowflake-tietomurto paljastaa 400 yritystä, hakkeri vaatii 20 miljoonan dollarin lunnaita",
    "originLink": "https://www.hudsonrock.com/blog/snowflake-massive-breach-access-through-infostealer-infection",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40534868",
    "commentBody": "",
    "originSummary": [
      "Hudson Rock ilmoitti 31. toukokuuta 2024 merkittävästä tietomurrosta Snowflakessa, joka on merkittävä pilvitallennusyritys, Infostealer-tartunnan vuoksi.",
      "Tietomurto sai alkunsa Snowflake-työntekijän ServiceNow-tilin varastetuista tunnistetiedoista, mikä johti tietojen siirtymiseen mahdollisesti 400 yrityksestä ja 20 miljoonan dollarin kiristysyritykseen.",
      "Hudson Rock vahvisti tietomurron aitouden ja korosti, että se olisi voitu helposti estää, mikä korostaa Infostealer-tartuntojen kasvavaa uhkaa tietoverkkorikollisuudessa."
    ],
    "commentSummary": [
      "Hakkeri pääsi Snowflaken demoympäristöön käyttämällä varastettuja tunnistetietoja vaarantuneen myynti-insinöörin tietokoneelta ja hyödyntämällä prosessiongelmaa, jossa jaetut tunnistetiedot eivät vanhene.",
      "Murto ei koskenut varsinaisia asiakastilejä, mikä on vastoin väitteitä \"sadoista vahingoittuneista asiakkaista\", ja korostaa asianmukaisten valtakirjojen hallinnan ja laiteturvallisuuden merkitystä.",
      "Tapaus on herättänyt keskustelua Snowflaken turvallisuuskäytännöistä, Hudson Rockin raportointilähteen uskottavuudesta ja identiteettipohjaisten hyökkäysten laajemmista vaikutuksista teknologiateollisuudessa."
    ],
    "points": 276,
    "commentCount": 88,
    "retryCount": 0,
    "time": 1717162088
  },
  {
    "id": 40529355,
    "title": "Energiatehokkaat 1-bittiset kielimallit: Pienempiä, nopeampia ja lähes yhtä tarkkoja",
    "originLink": "https://spectrum.ieee.org/1-bit-llm",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40529355",
    "commentBody": "",
    "originSummary": [
      "1-bittiset kielimallit (LLM) ovat lupaava ratkaisu tekoälyn korkeaan energiantarpeeseen, koska ne ovat tehokkaampia.",
      "Nämä mallit ovat pienempiä ja nopeampia kuin perinteiset mallit, mikä tekee niistä käytännöllisempiä erilaisiin sovelluksiin.",
      "Pienemmästä koostaan huolimatta 1-bittiset LLM:t säilyttävät lähes saman tarkkuustason kuin suuremmat vastineensa."
    ],
    "commentSummary": [
      "Keskustelussa keskitytään kvantifioitujen kielimallien (LLM) käytön hyötyihin ja haasteisiin tehokkuuden lisäämiseksi ja resurssivaatimusten vähentämiseksi tarkkuuden säilyttäen.",
      "IQ2_XS:n kaltaisia kehittyneitä menetelmiä korostetaan, jotta voidaan lieventää kvantisoinnista johtuvaa laadun heikkenemistä hyvin koulutetuissa malleissa, kuten Llama3:ssa.",
      "Keskustelussa pohditaan myös elinikäisen oppimisen järjestelmien tulevaisuutta ja ehdotetaan siirtymistä kohti modulaarisia järjestelmiä ja korostetaan tarvetta tasapainottaa laskentakustannuksia, laatua ja ympäristönäkökohtia."
    ],
    "points": 262,
    "commentCount": 138,
    "retryCount": 0,
    "time": 1717107482
  },
  {
    "id": 40535895,
    "title": "Standard Ebooks juhlii 1000. julkaisua James Joycen \"Ulyssesin\" kanssa.",
    "originLink": "https://standardebooks.org/ebooks/james-joyce/ulysses",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40535895",
    "commentBody": "",
    "originSummary": [
      "James Joycen \"Ulysses\" on englantilaisen kirjallisuuden kannalta merkittävä romaani, joka kuvaa Stephen Dedaluksen ja Leopold Bloomin elämän kautta yhtä päivää Dublinissa 16. kesäkuuta 1904.",
      "Romaani on tunnettu innovatiivisista kerrontatekniikoistaan ja tyylillisestä monimuotoisuudestaan, ja se vetää yhtäläisyyksiä Homeroksen \"Odysseiaan\". Se joutui aluksi kohtaamaan oikeudellisia haasteita säädyttömyyden vuoksi, minkä vuoksi sen julkaiseminen viivästyi vuoteen 1922 asti.",
      "Tämä Standard Ebooksin painos perustuu vuoden 1922 ensimmäiseen painokseen, johon on tehty korjauksia vuotta 1929 edeltävistä virheistä, ja se on vapaa tekijänoikeuksista Yhdysvalloissa, vaikka se saattaa edelleen olla rajoitettu muilla alueilla."
    ],
    "commentSummary": [
      "Standard Ebooks on julkaissut 1 000. teoksensa, James Joycen \"Ulysses\", joka on herättänyt keskustelua Hacker Newsissa sen Flesch Reading Ease -pistemäärästä 74,9 huolimatta sen monimutkaisesta proosasta.",
      "Käyttäjät keskustelevat luettavuusalgoritmien soveltuvuudesta modernistiseen kirjallisuuteen ja ehdottavat vaihtoehtoisia menetelmiä kirjojen vaikeusasteen arvioimiseksi. Samalla he keskustelevat Ulyssesin lukustrategioista ja Standard Ebooksin tarjonnan laadusta.",
      "Keskustelussa käsitellään muun muassa sivuston tekniseen pinoamiseen liittyviä kysymyksiä, vertailuja Gutenberg.org-sivustoon ja kirjallisuuden arvostuksen subjektiivista luonnetta, erityisesti englantia äidinkielenään puhumattomien kohdalla."
    ],
    "points": 227,
    "commentCount": 85,
    "retryCount": 0,
    "time": 1717166755
  },
  {
    "id": 40527730,
    "title": "Mozilla parantaa Firefoxia välilehtien ryhmittelyllä, pystysuorilla välilehdillä ja laitteen tekoälyominaisuuksilla.",
    "originLink": "https://blog.mozilla.org/en/mozilla/heres-what-were-working-on-in-firefox/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40527730",
    "commentBody": "",
    "originSummary": [
      "Mozilla päivittää Firefoxia käyttäjien toivomilla ominaisuuksilla, kuten välilehtien ryhmittelyllä, pystysuorilla välilehdillä, sivupalkilla ja profiilinhallintajärjestelmällä, jolla voidaan erottaa toisistaan eri selaustoiminnot.",
      "Uusia lisäyksiä ovat muun muassa mukautettavat taustakuvat uusissa välilehdissä, yksinkertaistetut yksityisyysasetukset ja suorituskykyparannukset, jotka nopeuttavat sivulatauksia, parantavat akun tehoa ja parantavat selainten välistä yhteensopivuutta.",
      "Tietosuojan parannuksissa keskitytään paikalliseen laitekäsittelyyn esimerkiksi käännöksissä ja PDF-muokkauksessa, ja Mozilla tutkii laitteen tekoälyä sellaisten ominaisuuksien osalta kuin tekoälyn luoma alt-teksti PDF-tiedostoihin."
    ],
    "commentSummary": [
      "Viimeaikaiset Firefox-päivitykset ovat yksinkertaistaneet valikoita, mikä on aiheuttanut ristiriitaisia reaktioita; jotkut käyttäjät arvostavat muutoksia, kun taas toiset kokevat, että se heikentää löydettävyyttä ja toiminnallisuutta tehokäyttäjille.",
      "Kritiikki ulottuu käyttöliittymäsuunnittelun lisäksi Mozillan johtoon ja ulkoisiin paineisiin, kuten Googlen vaikutusvaltaan, sekä keskusteluihin resurssien jakamisesta ja tasapainosta käyttäjien räätälöinnin ja turvallisuuden välillä.",
      "Markkinaosuuden laskusta huolimatta Firefox säilyttää uskollisen käyttäjäkuntansa \"mahtavan palkin\" kaltaisten ominaisuuksien ja räätälöintivaihtoehtojen ansiosta, ja parannusehdotuksia ovat muun muassa parempi välilehtien hallinta, laajennusten hallinta ja suorituskyvyn parantaminen."
    ],
    "points": 227,
    "commentCount": 237,
    "retryCount": 0,
    "time": 1717097525
  },
  {
    "id": 40533761,
    "title": "Intel-emolevyn CPU-päivitys Hack: Kapton-nauha ja BIOS-modit mahdollistavat uudemmat suorittimet.",
    "originLink": "https://hackaday.com/2024/05/31/intels-anti-upgrade-tricks-defeated-with-kapton-tape/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40533761",
    "commentBody": "",
    "originSummary": [
      "Intel-emolevyt, joissa on Z170- tai Z270-piirisarja, tukevat virallisesti enintään 7. sukupolven Kaby Lake -suorittimia, mutta käyttäjät voivat ottaa käyttöön 8. ja 9. sukupolven Coffee Lake -suorittimet \"Coffee Modin\" avulla, johon kuuluu Kapton-nauhan korjauksia ja BIOS-muutoksia.",
      "\"Coffee Mod\" mahdollistaa jatkuvan yhteensopivuuden vanhempien suorittimien kanssa, mikä on osoitus yhteisön pyrkimyksistä ohittaa Intelin rajoittavat käytännöt.",
      "Intelin tulevat turvatoimet, kuten BootGuard, saattavat estää nämä muutokset, mikä on ristiriidassa AMD:n laajemman prosessorituen kanssa."
    ],
    "commentSummary": [
      "Inteliä on arvosteltu siitä, että se rajoittaa suorittimen kantayhteensopivuutta, mitä pidetään strategiana voittojen kasvattamiseksi tai emolevyvalmistajien kanssa tehtyjen sopimusten vuoksi.",
      "Vaikka suorittimet muuttuivat minimaalisesti kuuden vuoden aikana, Intel markkinoi kutakin uutta sukupolvea hienosäätämällä yhteensopivuutta, vaikeuttamalla päivityksiä ja turhauttamalla käyttäjiä.",
      "Vertailuja tehdään autojen ja puhelimien rehellisempiin lisäpäivityksiin, ja keskustellaan teknisistä perusteluista, markkinadynamiikasta sekä RISC-V:n ja ARM:n mahdollisesta kilpailusta."
    ],
    "points": 218,
    "commentCount": 96,
    "retryCount": 0,
    "time": 1717155449
  },
  {
    "id": 40533484,
    "title": "Malenfant.net: Malantfant: Hajautettu sosiaalinen verkosto, jossa on yksityisyys ja reaaliaikaiset ominaisuudet.",
    "originLink": "https://malenfant.net/@didier/112528487189999791",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40533484",
    "commentBody": "",
    "originSummary": [
      "Malenfant.net on Mastodonilla toimiva hajautettu sosiaalinen verkosto, jossa käyttäjät voivat luoda tilejä, seurata profiileja tai hashtageja ja olla vuorovaikutuksessa julkaisujen kanssa.",
      "Alusta tarjoaa ominaisuuksia, kuten live-syötteet, näppäimistön pikavalinnat, ja antaa tietoja yksityisyyskäytännöistään ja palvelintilastoista.",
      "Sivusto on esimerkki kasvavasta suuntauksesta kohti hajautettua sosiaalista mediaa, jossa korostetaan käyttäjien valvontaa ja yksityisyyttä."
    ],
    "commentSummary": [
      "Discordia kehutaan sen käyttäjäystävällisestä käyttöliittymästä, reaaliaikaisesta viestinnästä ja integroidusta ääni- ja videokeskustelusta, minkä ansiosta se on suosittu pelien ja sosiaalisen vuorovaikutuksen väline.",
      "Discordia arvostellaan muun muassa huonosta organisoinnista, hakukelpoisuuden puutteesta ja tietosuojaongelmista, minkä vuoksi se ei ole ihanteellinen tiedon säilyttämiseen ja tekniseen dokumentointiin.",
      "Vaihtoehdot, kuten foorumit, Discourse ja IRC, tarjoavat parempaa tiedon säilyttämistä, mutta niiden käyttö on vaikeaa monimutkaisuuden ja nykyaikaisten ominaisuuksien puutteen vuoksi, mikä heijastaa sukupolvenvaihdosta kohti helpompia alustoja."
    ],
    "points": 216,
    "commentCount": 216,
    "retryCount": 0,
    "time": 1717153211
  },
  {
    "id": 40528192,
    "title": "Paikalliset tekoälyratkaisut tehokkaaseen PDF-hakuun Macissa",
    "originLink": "https://news.ycombinator.com/item?id=40528192",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40528192",
    "commentBody": "",
    "originSummary": [
      "Käyttäjä etsii paikallista tekoälyratkaisua iCloudiin tallennettujen arkaluonteisten PDF-tiedostojen hallintaan ja hakuun keskittyen sisältöpohjaisiin kyselyihin ilman manuaalista merkintää.",
      "Ratkaisun tulisi asettaa recall tarkkuuden edelle ja olla yhteensopiva Mac-ohjelmistojen kanssa, ja siinä tulisi painottaa nykyaikaisia, valmiita lähestymistapoja.",
      "Esimerkkikysely: \"näytä minulle kaikki veroasiakirjat elokuulta 2023.\""
    ],
    "commentSummary": [
      "Käyttäjä etsii paikallista tekoälyratkaisua arkaluonteisten PDF-tiedostojen etsimiseen iCloudista ja pitää parempana Mac-ohjelmistoa, joka ei vaadi merkintöjä ja jossa muistaminen on tärkeämpää kuin tarkkuus.",
      "Ehdotuksia ovat muun muassa mukautetut työkalut, joissa käytetään paikallisia suuria kielimalleja (LLM), LlamaIndexin RAG CLI:tä ja PDF-tiedostojen muuntamista markdowniksi. OCR- ja QA-työkaluina mainitaan työkalut kuten pypdf, mupdf ja Phi-3-vision.",
      "Keskustelussa korostetaan tehokkaiden asiakirjojen käsittelyputkien merkitystä, tekoälymallien potentiaalia hakuominaisuuksien parantamisessa sekä tietosuojaan ja laajojen digitaalisten arkistojen hyödyllisyyteen liittyviä huolenaiheita."
    ],
    "points": 215,
    "commentCount": 76,
    "retryCount": 0,
    "time": 1717100645
  },
  {
    "id": 40533622,
    "title": "Krita juhlii 25 vuotta digitaalisen taiteen kehitystä ja innovaatioita",
    "originLink": "https://krita.org/en/posts/2024/krita-25-years/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40533622",
    "commentBody": "",
    "originSummary": [
      "Krita, digitaalinen maalaussovellus, on kehittynyt 25 vuoden aikana KImageShopista nykyiseen muotoonsa, ja se on selvinnyt useista uudelleenkäynnistyksistä ja teknisistä haasteista.",
      "Tärkeimpiä virstanpylväitä ovat siirtyminen Qt3:sta Qt4:ään, laajentuminen Windows- ja MacOS-käyttöjärjestelmiin sekä taloudellisten esteiden voittaminen varainkeruun ja yhteisön tuen avulla.",
      "Projekti valmistelee nyt Krita 6.0:aa, johon sisältyy siirto Qt6:een, ja viimeisimmissä versioissa keskitytään käytettävyyteen ja uusiin ominaisuuksiin, ja jatkuvaa kehitystä tuetaan lahjoituksilla ja yhteisön osallistumisella."
    ],
    "commentSummary": [
      "Krita on ilmainen ja avoimen lähdekoodin digitaalinen maalausohjelmisto, jota kehutaan sen animaatiotyökaluista ja helppokäyttöisyydestä, erityisesti kehyspohjaisesta GIF-muokkauksesta, joka puuttuu joistakin kaupallisista vaihtoehdoista.",
      "25-vuotisesta historiastaan huolimatta Krita on saanut merkittävää tunnustusta vasta viime vuosikymmenellä, ja sitä suositellaan usein GIMPin sijaan digitaaliseen maalaukseen.",
      "Keskusteluissa korostetaan Fedora 40:n käytön haasteita digitaalisille taiteilijoille, jotka johtuvat tablet-ohjelmistoihin liittyvistä ongelmista ja siitä, että Krita ei ole Wayland-sovellus, ja jotkut ehdottavat OpenSUSEa paremmaksi vaihtoehdoksi."
    ],
    "points": 202,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1717154331
  }
]
