[
  {
    "id": 40856030,
    "title": "لماذا تشيلي طويلة جدًا؟",
    "originLink": "https://unchartedterritories.tomaspueyo.com/p/why-is-chile-so-long",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40856030",
    "commentBody": "",
    "originSummary": [
      "يعود الطول الفريد لتشيلي إلى جبال الأنديز، مما يخلق شريطًا ضيقًا من الأرض بين الجبال والمحيط الهادئ.",
      "تتشكل جغرافية البلاد نتيجة تصادم الصفائح التكتونية لنازكا وأمريكا الجنوبية، مما يؤدي إلى تكوين جبال الأنديز.",
      "كانت حدود تشيلي محل نزاع تاريخيًا، لا سيما في حرب المحيط الهادئ، حيث اكتسبت أراضي غنية بالموارد."
    ],
    "commentSummary": [
      "لقد شكّلت الجغرافيا الفريدة لتشيلي، بوجود جبال الأنديز والمحيط الهادئ كحدود طبيعية، والعوامل التاريخية شكلها الطويل والضيق.",
      "تمتد البلاد عبر مناخات متنوعة، من صحراء أتاكاما في الشمال إلى المناطق الباردة في الجنوب، مما يؤثر على تركز سكانها في سانتياغو.",
      "تؤثر جغرافيا تشيلي المتنوعة أيضًا على لهجتها الإسبانية، مما يمنحها خصائص فريدة مقارنة بالمناطق الأخرى الناطقة بالإسبانية."
    ],
    "points": 617,
    "commentCount": 204,
    "retryCount": 0,
    "time": 1719923818
  },
  {
    "id": 40854836,
    "title": "مرحبًا بكم في Ladybird، متصفح ويب مستقل حقًا",
    "originLink": "https://ladybird.org/index.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40854836",
    "commentBody": "",
    "originSummary": [
      "ليديبيرد هو متصفح ويب ومحرك مستقل، كان في البداية عارض HTML لنظام SerenityOS، والآن يدعم نظام لينكس، macOS، وأنظمة يونكس الأخرى.",
      "تشمل الميزات الفريدة عدم وجود أي كود من متصفحات أخرى، والتركيز الوحيد على أن يكون متصفح ويب، وعدم تحقيق الربح من خلال الإعلانات أو بيانات المستخدم.",
      "من المخطط إصدار نسخة ألفا في صيف 2026، بتمويل من الرعايات والتبرعات، وفريق مكون من 4 مهندسين بدوام كامل."
    ],
    "commentSummary": [
      "ليديبيرد هو متصفح ويب مستقل، وموقعه الرسمي هو ladybird.org.",
      "تم نقل المناقشات والتعليقات حول Ladybird إلى موضوع محدد على موقع Hacker News، والذي يظهر حاليًا في الصفحة الرئيسية."
    ],
    "points": 530,
    "commentCount": 1,
    "retryCount": 0,
    "time": 1719911676
  },
  {
    "id": 40854319,
    "title": "Diff-pdf: أداة لمقارنة ملفي PDF بصريًا",
    "originLink": "https://github.com/vslavik/diff-pdf",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40854319",
    "commentBody": "",
    "originSummary": [
      "تتيح أداة `diff-pdf` للمستخدمين مقارنة ملفي PDF بصريًا، مع تمييز الفروقات إن وجدت.",
      "المستودع لا يتم تطويره بنشاط، ويُشجَّع المستخدمون على تقديم طلبات السحب للتحسينات ولكن لا ينبغي أن يتوقعوا دعمًا أو ميزات جديدة.",
      "تُقدَّم تعليمات التثبيت لأنظمة تشغيل مختلفة، بما في ذلك Windows وmacOS والعديد من توزيعات Linux، مع خطوات مفصلة لتجميع البرنامج من المصدر."
    ],
    "commentSummary": [
      "Diff-pdf هو أداة مصممة لمقارنة ملفين PDF بصريًا، حيث يناقش المستخدمون فائدتها والبدائل مثل ImageMagick وDelta Walker وBeyond Compare.",
      "يشارك المستخدمون النصوص البرمجية والتكوينات لدمج مقارنة ملفات PDF في سير العمل، بما في ذلك خطوط CI (التكامل المستمر) وgit، مع تسليط الضوء على التطبيقات العملية في تصميم الأجهزة ومقارنة الكتب الدراسية.",
      "تؤكد المناقشة على نقاط القوة والقيود في الأدوات المختلفة، مع تفضيلات منقسمة بين الخيارات مفتوحة المصدر والبرامج المملوكة بناءً على الميزات المحددة."
    ],
    "points": 356,
    "commentCount": 54,
    "retryCount": 0,
    "time": 1719905168
  },
  {
    "id": 40853770,
    "title": "تشغيل لينكس من جوجل درايف",
    "originLink": "https://ersei.net/en/blog/fuse-root",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40853770",
    "commentBody": "",
    "originSummary": [
      "تمكن مطور من تشغيل نظام لينكس بنجاح من Google Drive باستخدام FUSE و initramfs مخصص، مما يعرض نهجًا جديدًا للحوسبة السحابية الأصلية.",
      "تضمنت العملية استخدام google-drive-ocamlfuse لتركيب Google Drive ونقل Arch Linux، على الرغم من التحديات مثل الروابط الرمزية المكسورة والأداء البطيء.",
      "يبرز هذا الإثبات للمفهوم، الذي تم اختباره على أجهزة حقيقية، إمكانيات مستقبلية مثل تشغيل نظام لينكس من خلال SSH أو مستودع Git، مما يؤكد على الإمكانيات المحتملة للحلول المبتكرة المعتمدة على السحابة."
    ],
    "commentSummary": [
      "تم عرض طريقة جديدة لتشغيل نظام لينكس مباشرة من Google Drive، مما يذكرنا بتقنيات التمهيد الشبكي القديمة مثل wanboot الخاص بنظام Sun Solaris.",
      "تستفيد هذه الطريقة من قدرات UEFI (واجهة البرامج الثابتة القابلة للتوسيع الموحدة) الحديثة، التي يمكنها الإقلاع من HTTP، مما يجعل من الممكن تحميل كل من initramfs (نظام ملفات ذاكرة الوصول العشوائي الأولي) والنواة عبر الشبكة.",
      "تسلط المناقشة الضوء على إمكانية استخدام طرق مماثلة للأجهزة مثل Raspberry Pi، التي يمكنها بالفعل تنفيذ الإقلاع الشبكي باستخدام PXE (بيئة تنفيذ ما قبل الإقلاع) وبروتوكولات أخرى."
    ],
    "points": 318,
    "commentCount": 130,
    "retryCount": 0,
    "time": 1719897623
  },
  {
    "id": 40851919,
    "title": "تحقيق الرقم القياسي العالمي في لعبة هاتريس (2022)",
    "originLink": "https://hallofdreams.org/posts/hatetris/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40851919",
    "commentBody": "",
    "originSummary": [
      "هاتيتريس، نسخة صعبة من لعبة تيتريس أنشأها سام هيوز، تستخدم خوارزمية حتمية لتقديم أسوأ قطعة ممكنة للاعب دائمًا.",
      "تم دفع النتيجة العالية في HATETRIS إلى 86 نقطة باستخدام تحسينات Rust، والبحث الشعاعي الاستدلالي، وضبط المعلمات على AWS.",
      "تشمل الدروس الرئيسية أهمية التحليل الشخصي، الهياكل البيانية الفعالة، الأجهزة القوية لتعلم الآلة، ودمج الاستدلالات لتحقيق نتائج أفضل."
    ],
    "commentSummary": [
      "تتمحور المناقشة حول تحقيق رقم قياسي عالمي في لعبة هاتيتريس، وهي نسخة من تيتريس تقدم دائمًا أسوأ قطعة ممكنة، مما يبرز التحديات التقنية والمثابرة المطلوبة.",
      "يشارك المشاركون تجاربهم الشخصية، والمشاريع ذات الصلة، وتأملاتهم حول التعلم الآلي، والشبكات العصبية، والأساليب الأبسط مثل البحث الشعاعي في معالجة مثل هذه المشكلات المعقدة.",
      "تتناول المحادثة أيضًا الجاذبية المستمرة لتنوعات لعبة تتريس، والتحديات القانونية لإنشاء النسخ المقلدة، وتأثير ظاهرة تتريس على المطورين."
    ],
    "points": 237,
    "commentCount": 40,
    "retryCount": 0,
    "time": 1719876365
  },
  {
    "id": 40853845,
    "title": "ماكو – مجمع ويب سريع وعالي الجودة يعتمد على لغة Rust",
    "originLink": "https://makojs.dev/blog/mako-open-sourced",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40853845",
    "commentBody": "",
    "originSummary": [
      "ماكو، أداة بناء للواجهة الأمامية سريعة وذات جودة إنتاجية تعتمد على لغة Rust، أصبحت الآن مفتوحة المصدر ومتاحة على GitHub.",
      "تم تطوير Mako لمعالجة مشاكل سرعة البناء، وقد قلل بشكل كبير من أوقات البناء، على سبيل المثال، من 16 ثانية إلى 3.9 ثانية لـ Ant Design Pro.",
      "بدأ المشروع في مارس 2023، وتم إصداره داخليًا في مجموعة آنت في نوفمبر 2023 وتم فتح مصدره بحلول يونيو 2024."
    ],
    "commentSummary": [
      "ماكو هو مجمع ويب سريع وعالي الجودة تم تطويره بلغة Rust، مصمم لتحسين دورة التطوير من خلال تجميع تطبيقات الويب بكفاءة.",
      "يهدف إلى تقليل التنازل عن أوقات التحميل الأولية الأبطأ التي غالبًا ما ترتبط بالتجميع، ويخطط لدعم نظام unplugin لتحقيق توافق أفضل مع الأنظمة البيئية الحالية.",
      "تسلط المناقشة الضوء على فوائد المجمعات، مثل التخزين المؤقت الأمثل وتقسيم الشيفرة، وتقارن بين Mako وأدوات أخرى مثل esbuild وswc، مشيرة إلى التطور المستمر والمنافسة في مجال مجمعات الويب."
    ],
    "points": 208,
    "commentCount": 152,
    "retryCount": 0,
    "time": 1719898885
  },
  {
    "id": 40851895,
    "title": "مراجعات الشفرات تكتشف الأخطاء",
    "originLink": "https://two-wrongs.com/code-reviews-do-find-bugs.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40851895",
    "commentBody": "",
    "originSummary": [
      "تدعي دراسة مايكروسوفت لعام 2015 بعنوان \"المراجعات البرمجية لا تكتشف الأخطاء\" أن حوالي 15% فقط من تعليقات المراجعة البرمجية تشير إلى عيوب محتملة، لكن هذه الإحصائية مضللة.",
      "تشير الأبحاث السابقة إلى أن مراجعات الشفرات والبرمجة الزوجية يمكن أن تكتشف 60% إضافية من العيوب مع زيادة بنسبة 15% فقط في استثمار الوقت، وتكون فعالة بشكل خاص على أجزاء الشفرة الصغيرة.",
      "تتناقض أطروحة ورقة مايكروسوفت مع الأدلة التي تظهر فعالية مراجعات الشفرات في اكتشاف العيوب وتعلم قاعدة الشفرات، حيث تكمن المشكلة الحقيقية في متوسط وقت استجابة المراجعة البالغ 24 ساعة."
    ],
    "commentSummary": [
      "تعد مراجعات الشيفرة فعالة في تحديد الأخطاء التقنية والديون التقنية وروائح الشيفرة، مما يساهم في قاعدة شيفرة أكثر قابلية للصيانة.",
      "تسلط المناقشة الضوء على أهمية بناء ثقافة داعمة لمراجعة الشفرات، بما في ذلك ممارسات مثل استخدام أعلام الميزات، وتجزئة التغييرات إلى أجزاء أصغر، وتحديد توقعات واضحة.",
      "تشمل المناقشة وجهات نظر مختلفة حول كفاءة وضرورة مراجعات الشيفرة، حيث يدعو البعض إلى بدائل مثل البرمجة الزوجية والاختبار الآلي لتكملة أو استبدال المراجعات التقليدية."
    ],
    "points": 174,
    "commentCount": 130,
    "retryCount": 0,
    "time": 1719876193
  },
  {
    "id": 40856791,
    "title": "متصفح الويب Ladybird يصبح منظمة غير ربحية بدعم قدره مليون دولار من مؤسس GitHub",
    "originLink": "https://lunduke.locals.com/post/5812560/ladybird-web-browser-becomes-a-non-profit-with-1-million-from-github-founder",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40856791",
    "commentBody": "",
    "originSummary": [
      "تهدف مبادرة متصفح ليدي بيرد، وهي منظمة غير ربحية أسسها كريس وانسترات من GitHub وأندرياس كلينغ من SerenityOS، إلى تطوير متصفح ويب خالٍ من التأثيرات التجارية والإعلانية.",
      "بمبلغ مليون دولار من وانسترات وثمانية تمويل سابقة من شوبيفاي، تخطط ليدي بيرد لإصدار نسخة ألفا بحلول عام 2026، مع التركيز على خصوصية المستخدم والمعايير المفتوحة.",
      "لقد قامت المبادرة بالفعل بتوظيف عدة مطورين بدوام كامل وأحرزت تقدمًا كبيرًا، على الرغم من الشكوك، طامحة إلى تقديم تجربة تصفح مستقلة حقًا."
    ],
    "commentSummary": [
      "تحول متصفح الويب Ladybird إلى منظمة غير ربحية بتبرع قدره مليون دولار من مؤسس GitHub كريس وانسترات.",
      "تحدث المؤسس أندرياس كلينغ عن مستقبل المشروع، مشددًا على التفاؤل رغم الشكوك حول تطوير متصفح جديد دون تمويل كبير.",
      "يهدف الفريق إلى دعم معايير الويب المفتوحة، والحفاظ على فريق صغير لتحقيق الاستدامة المالية، والحفاظ على المشروع مفتوح المصدر تحت ترخيص متساهل مع استكشاف لغات البرمجة الآمنة من حيث الذاكرة للتطوير المستقبلي."
    ],
    "points": 153,
    "commentCount": 348,
    "retryCount": 0,
    "time": 1719928905
  },
  {
    "id": 40857041,
    "title": "مع القندس الخامس المشغول، يقترب الباحثون من حدود الحوسبة",
    "originLink": "https://www.quantamagazine.org/amateur-mathematicians-find-fifth-busy-beaver-turing-machine-20240702/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40857041",
    "commentBody": "",
    "originSummary": [
      "حدد الباحثون قيمة BB(5)، التي تمثل تعقيد برنامج حاسوبي بسيط يعرف باسم القندس المشغول الخامس، بعد عقود من الجهد.",
      "تم التحقق من القيمة باستخدام مساعد الإثبات Coq، مما يضمن الدقة الرياضية، ويتوقف القندس المشغول الخامس بعد 47,176,870 خطوة.",
      "شمل هذا الإنجاز فريقًا متنوعًا، بما في ذلك مساهمات من علماء رياضيات هواة وخبراء، وقد يكون آخر رقم من أرقام القندس المشغول يتم تحديده بسبب الصعوبة الهائلة لـ BB(6)."
    ],
    "commentSummary": [
      "يقترب الباحثون من الحدود الحسابية مع مشكلة القندس المشغول الخامسة، التي تحدد الحد الأقصى للخطوات التي يمكن أن تتخذها آلة تورينغ بعدد معين من الحالات قبل التوقف.",
      "تم تحقيق إنجاز كبير بإثبات باستخدام Coq، أداة التحقق الرسمي، مما يمثل تقدمًا في هذا المجال.",
      "تم إثبات أن الرقم الخامس من أرقام القندس المشغول، BB(5)، هو 47,176,870 خطوة، على الرغم من أن التحديات مثل آلة القواعد الستة غير القابلة للحل المتعلقة بحدسية كولاتز لا تزال قائمة."
    ],
    "points": 152,
    "commentCount": 33,
    "retryCount": 0,
    "time": 1719930451
  },
  {
    "id": 40857517,
    "title": "ميتا 3D جين",
    "originLink": "https://ai.meta.com/research/publications/meta-3d-gen/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40857517",
    "commentBody": "",
    "originSummary": [
      "ميتا 3D جين (3DGen) هي تقنية متقدمة تولد الأصول ثلاثية الأبعاد من النص في أقل من دقيقة، وتتميز بالدقة والجودة العالية في تنفيذ الأوامر.",
      "يدعم التصيير القائم على الفيزياء (PBR) وإعادة التكسية التوليدية، متفوقًا على معايير الصناعة في كل من السرعة والجودة البصرية.",
      "تدمج 3DGen بين Meta 3D AssetGen و Meta 3D TextureGen، مما يمثل الأجسام ثلاثية الأبعاد في مساحات العرض والحجم وUV."
    ],
    "commentSummary": [
      "تقوم شركة ميتا بتطوير أداة جديدة، Meta 3D Gen، تهدف إلى تحسين إنتاج المحتوى في الواقع الافتراضي، والذي يتطلب حاليًا الكثير من الجهد.",
      "الخدمات الحالية مثل Meshy وRodin وLuma Labs تفتقر إلى الجودة اللازمة لنماذج الواقع الافتراضي التفصيلية، مما يبرز الحاجة إلى حلول أفضل.",
      "المجتمع يأمل أن تحلّ حلول ميتا مشكلات مثل جودة النسيج الرديئة والطوبولوجيا غير الفعّالة في أدوات توليد النماذج ثلاثية الأبعاد الحالية."
    ],
    "points": 144,
    "commentCount": 45,
    "retryCount": 0,
    "time": 1719933565
  },
  {
    "id": 40857009,
    "title": "إضافة Mistral Codestral و GPT-4o إلى دفاتر Jupyter",
    "originLink": "https://github.com/pretzelai/pretzelai/blob/main/README.md",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40857009",
    "commentBody": "",
    "originSummary": [
      "بريتزل هو تفرع جديد من جوبتر لاب يدمج ميزات توليد الأكواد بالذكاء الاصطناعي، مما يعالج نقص هذه الامتدادات في جوبتر الأصلي.",
      "تشمل الميزات الرئيسية الإكمال التلقائي للعلامات المضمنة، وتوليد الأكواد على مستوى الخلية، ودردشة الشريط الجانبي، وكلها مصممة لتعزيز تجربة البرمجة بمساعدة الذكاء الاصطناعي السياقي.",
      "يهدف Pretzel إلى تحديث Jupyter بإضافة ميزات جديدة مثل التعاون في الوقت الفعلي، ودعم SQL، ومنشئ التحليل البصري، وواجهة مشابهة لـ VSCode، مما يجعله أداة شاملة لعلماء البيانات."
    ],
    "commentSummary": [
      "بريتزل هو نسخة مفتوحة المصدر ومجانية من جوبتر لاب، تضيف ميزات توليد الأكواد بالذكاء الاصطناعي لتوفير تجربة أكثر تكاملاً ووعيًا بالسياق.",
      "تشمل الميزات الرئيسية الإكمال التلقائي للعلامات باستخدام Mistral Codestral أو GPT-4o، وتوليد التعليمات البرمجية على مستوى الخلية، ودردشة الشريط الجانبي مع السياق من الخلية الحالية أو النص المحدد.",
      "يهدف Pretzel إلى تحديث Jupyter بميزات مثل التعاون في الوقت الفعلي، ودعم SQL، ومنشئ التحليل البصري، مما يميزه عن الأدوات الأخرى المدمجة بالذكاء الاصطناعي مثل Noteable وDeepnote وJupyter-ai وColab وCoCalc."
    ],
    "points": 129,
    "commentCount": 41,
    "retryCount": 0,
    "time": 1719930236
  },
  {
    "id": 40852084,
    "title": "سويسرا تفرض الكشف عن الشيفرة المصدرية للبرمجيات في القطاع العام",
    "originLink": "https://joinup.ec.europa.eu/collection/open-source-observatory-osor/news/new-open-source-law-switzerland",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40852084",
    "commentBody": "",
    "originSummary": [
      "سنّت سويسرا \"القانون الفيدرالي لاستخدام الوسائل الإلكترونية لتنفيذ المهام الحكومية\" (EMBAG)، الذي يفرض استخدام البرمجيات مفتوحة المصدر (OSS) في الهيئات العامة.",
      "يهدف القانون، بقيادة البروفيسور الدكتور ماتياس ستورمر، إلى تقليل الاعتماد على موردين محددين، وخفض تكاليف دافعي الضرائب، وتعزيز الخدمات من خلال زيادة المنافسة والابتكار.",
      "تعزز EMBAG الشفافية والكفاءة من خلال مطالبة الهيئات العامة بالكشف عن شفرة مصدر البرمجيات، ما لم تكن مقيدة بحقوق الطرف الثالث أو مخاوف أمنية، وتسمح لها بتقديم خدمات تكنولوجيا المعلومات الإضافية مقابل تعويض يغطي التكاليف."
    ],
    "commentSummary": [
      "قانون EMBAG في سويسرا يلزم الكشف عن شفرة مصدر البرمجيات في القطاع العام، مع استثناءات تتعلق بحقوق الأطراف الثالثة أو المخاوف الأمنية.",
      "يهدف القانون إلى تعزيز البرمجيات مفتوحة المصدر (OSS) ويسمح للهيئات العامة بتقديم الخدمات ذات الصلة بأسعار تغطي التكاليف، على الرغم من أن النقاد قلقون بشأن الثغرات المحتملة وعدم وضوح التنفيذ.",
      "يمكن أن تؤدي هذه المبادرة إلى تبني أوسع للبرمجيات مفتوحة المصدر في الخدمات العامة، على الرغم من التحديات في التدقيق والامتثال."
    ],
    "points": 124,
    "commentCount": 18,
    "retryCount": 0,
    "time": 1719877702
  },
  {
    "id": 40849840,
    "title": "عندما صنعت RAND السحر في سانتا مونيكا",
    "originLink": "https://asteriskmag.com/issues/06/when-rand-made-magic-in-santa-monica",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40849840",
    "commentBody": "",
    "originSummary": [
      "حقبة مؤسسة راند الذهبية، التي امتدت لعقدين من الزمن، أدت إلى تقدم كبير في استراتيجيات النووية، والأقمار الصناعية، وتحليل الأنظمة، والحوسبة المبكرة.",
      "في البداية كانت ذراعًا بحثية للقوات الجوية، وقد تحقق نجاح مؤسسة راند بفضل فريق موهوب ومستقل ومتعدد التخصصات، مما ساهم في مجالات مثل نظرية الألعاب والذكاء الاصطناعي وتبديل الحزم.",
      "مع مرور الوقت، تحول تركيز مؤسسة راند بسبب العلاقات المتوترة مع القوات الجوية والتنوع في أبحاث السياسة الاجتماعية، مما أدى إلى تراجع في العلوم المتقدمة والابتكار."
    ],
    "commentSummary": [
      "كانت مؤسسة راند ذات تأثير كبير خلال الحرب العالمية الثانية والحرب الباردة، مشابهة لفترات الذروة لشركة جوجل أو مختبرات بيل.",
      "كان مركزًا بارزًا لعلماء الكمبيوتر والرياضيات المرموقين، حيث ساهم بشكل كبير في المجال المعروف الآن بعلم البيانات، والذي كان يُطلق عليه في الأصل \"بحوث العمليات\".",
      "على الرغم من أهميته التاريخية وتصاميم المكاتب المبتكرة للتعاون، فقد تضاءل الاعتراف الحديث بمؤسسة راند، مع إرثها الذي يشمل كلًا من الأبحاث الرائدة والاستراتيجيات المثيرة للجدل مثل تلك التي كانت خلال حرب فيتنام."
    ],
    "points": 121,
    "commentCount": 45,
    "retryCount": 0,
    "time": 1719863300
  },
  {
    "id": 40849363,
    "title": "قصة Git: ليست ممتعة هذه المرة",
    "originLink": "https://blog.brachiosoft.com/en/posts/git/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40849363",
    "commentBody": "",
    "originSummary": [
      "أنشأ لينوس تورفالدس Git بدافع الضرورة في عام 2005 بعد إلغاء الترخيص المجاني لـ BitKeeper، وهو نظام تحكم في الإصدارات كان يُستخدم سابقًا.",
      "استُلهم تطوير Git من Monotone ولكنه كان يهدف إلى أن يكون أبسط وأسرع، وسرعان ما اكتسب مساهمين وشعبية، خاصة داخل مجتمع Ruby.",
      "أدى إطلاق GitHub في عام 2008 إلى تعزيز اعتماد Git بشكل كبير، مما أدى إلى هيمنته الحالية في سوق التحكم في الإصدارات بحصة تبلغ 94%."
    ],
    "commentSummary": [
      "تتناول المقالة تاريخ وتطور أنظمة التحكم في الإصدارات، مع التركيز بشكل خاص على Git وأسلافه مثل BitKeeper وMercurial.",
      "يسلط الضوء على هيمنة Git في السوق، بحصة تبلغ 94% وفقًا لاستطلاع Stack Overflow لعام 2022، ويناقش ما إذا كان بإمكان أي نظام مستقبلي أن يحل محله.",
      "تتضمن المحادثة حكايات شخصية وآراء حول أنظمة التحكم في الإصدارات المختلفة، مع التأكيد على الانتشار الواسع لاعتماد Git ودمجه في سير العمل الحديث للتطوير."
    ],
    "points": 121,
    "commentCount": 26,
    "retryCount": 0,
    "time": 1719861052
  },
  {
    "id": 40850313,
    "title": "فنزويلا هي أول دولة أنديزية تفقد جميع أنهارها الجليدية",
    "originLink": "https://www.nbcnews.com/news/latino/-great-sadness-venezuela-first-andean-country-lose-glaciers-rcna153784",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40850313",
    "commentBody": "",
    "originSummary": [
      "أصبحت فنزويلا أول دولة في جبال الأنديز تفقد جميع أنهارها الجليدية، حيث أصبح نهر همبولت الجليدي في سييرا نيفادا صغيرًا جدًا بحيث لا يمكن تصنيفه كنهر جليدي.",
      "أكدت مبادرة المناخ والغطاء الجليدي الدولية (ICCI) هذا الوضع، مشيرة إلى أن فنزويلا كانت تحتوي على ستة أنهار جليدية في سييرا نيفادا، ولكن لم يتبق سوى نهر همبولت الجليدي بحلول عام 2011.",
      "يعزو العلماء اختفاء الجليد إلى التغير المناخي وارتفاع درجات الحرارة العالمية، حيث توقعت دراسة أجريت في عام 2023 أن 83% من الأنهار الجليدية في العالم قد تختفي بحلول عام 2100 إذا استمرت درجات الحرارة في الارتفاع."
    ],
    "commentSummary": [
      "فنزويلا هي أول دولة أنديزية تفقد جميع أنهارها الجليدية، حيث تقلصت مساحة الجليد من 2.317 كيلومتر مربع في عام 1952 إلى 0.046 كيلومتر مربع فقط في عام 2019.",
      "يؤكد هذا التخفيض الجذري على التأثير الشديد لتغير المناخ على البيئة.",
      "لقد أثار هذا الفقدان مناقشات حول دقة هذه الأرقام والتداعيات العاطفية والبيئية الأوسع لانحسار الأنهار الجليدية."
    ],
    "points": 115,
    "commentCount": 40,
    "retryCount": 0,
    "time": 1719865850
  }
]
