[
  {
    "id": 40856030,
    "title": "चिली इतना लंबा क्यों है?",
    "originLink": "https://unchartedterritories.tomaspueyo.com/p/why-is-chile-so-long",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40856030",
    "commentBody": "",
    "originSummary": [
      "चिली की अनूठी लंबाई एंडीज पर्वतों के कारण है, जो पर्वतों और प्रशांत महासागर के बीच एक संकीर्ण पट्टी बनाते हैं।",
      "देश की भूगोल नाज़का और दक्षिण अमेरिकी टेक्टोनिक प्लेटों की टक्कर से आकार लेती है, जिससे एंडीज पर्वत श्रृंखला बनती है।",
      "चिली की सीमाओं को ऐतिहासिक रूप से विवादित माना गया था, विशेष रूप से प्रशांत युद्ध में, जहाँ इसे संसाधन-समृद्ध क्षेत्रों की प्राप्ति हुई।"
    ],
    "commentSummary": [
      "चिली की अनूठी भूगोल, जिसमें एंडीज पर्वत और प्रशांत महासागर प्राकृतिक सीमाओं के रूप में हैं, और ऐतिहासिक कारकों ने इसके लंबे और संकरे आकार को आकार दिया है।",
      "देश में विभिन्न जलवायु हैं, उत्तर में अटाकामा रेगिस्तान से लेकर दक्षिण के ठंडे क्षेत्रों तक, जो सैंटियागो में इसकी केंद्रीकृत जनसंख्या को प्रभावित करती हैं।",
      "चिली की विविध भौगोलिक स्थिति भी इसकी स्पेनिश बोली को प्रभावित करती है, जिससे इसे अन्य स्पेनिश-भाषी क्षेत्रों की तुलना में विशिष्ट विशेषताएँ मिलती हैं।"
    ],
    "points": 617,
    "commentCount": 204,
    "retryCount": 0,
    "time": 1719923818
  },
  {
    "id": 40854836,
    "title": "लेडीबर्ड में आपका स्वागत है, एक वास्तव में स्वतंत्र वेब ब्राउज़र",
    "originLink": "https://ladybird.org/index.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40854836",
    "commentBody": "",
    "originSummary": [
      "लेडीबर्ड एक स्वतंत्र वेब ब्राउज़र और इंजन है, जो प्रारंभ में SerenityOS के लिए एक HTML व्यूअर था, अब यह लिनक्स, मैकओएस और अन्य यूनिक्स-समतुल्य प्रणालियों का समर्थन करता है।",
      "विशिष्ट विशेषताओं में अन्य ब्राउज़रों से कोई कोड नहीं, एक वेब ब्राउज़र होने पर एकल ध्यान, और विज्ञापनों या उपयोगकर्ता डेटा के माध्यम से कोई मुद्रीकरण नहीं शामिल है।",
      "एक अल्फा रिलीज़ की योजना गर्मियों 2026 के लिए बनाई गई है, जिसमें विकास को प्रायोजन और दान द्वारा वित्त पोषित किया जाएगा, और 4 पूर्णकालिक इंजीनियरों की एक टीम होगी।"
    ],
    "commentSummary": [
      "लेडीबर्ड एक स्वतंत्र वेब ब्राउज़र है, और इसकी आधिकारिक वेबसाइट ladybird.org है।",
      "लेडीबर्ड के बारे में चर्चाएँ और टिप्पणियाँ हैकर न्यूज़ पर एक विशेष थ्रेड में स्थानांतरित कर दी गई हैं, जो वर्तमान में मुख्य पृष्ठ पर प्रदर्शित है।"
    ],
    "points": 530,
    "commentCount": 1,
    "retryCount": 0,
    "time": 1719911676
  },
  {
    "id": 40854319,
    "title": "Diff-pdf: दो पीडीएफ की दृश्य तुलना करने का उपकरण",
    "originLink": "https://github.com/vslavik/diff-pdf",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40854319",
    "commentBody": "",
    "originSummary": [
      "‘डिफ-पीडीएफ’ टूल उपयोगकर्ताओं को दो पीडीएफ फाइलों की दृश्य तुलना करने की अनुमति देता है, और यदि कोई अंतर हो तो उन्हें हाइलाइट करता है।",
      "इस भंडार का सक्रिय रूप से विकास नहीं किया जा रहा है, और उपयोगकर्ताओं को सुधारों के लिए पुल अनुरोध सबमिट करने के लिए प्रोत्साहित किया जाता है, लेकिन उन्हें समर्थन या नई सुविधाओं की उम्मीद नहीं करनी चाहिए।",
      "विभिन्न ऑपरेटिंग सिस्टमों के लिए इंस्टॉलेशन निर्देश प्रदान किए गए हैं, जिनमें Windows, macOS, और कई Linux वितरण शामिल हैं, साथ ही स्रोत से संकलन के लिए विस्तृत चरण भी दिए गए हैं।"
    ],
    "commentSummary": [
      "Diff-pdf एक उपकरण है जिसे दो PDF फाइलों की दृश्य तुलना के लिए डिज़ाइन किया गया है, जिसमें उपयोगकर्ता इसकी उपयोगिता और ImageMagick, Delta Walker, और Beyond Compare जैसे विकल्पों पर चर्चा करते हैं।",
      "उपयोगकर्ता स्क्रिप्ट और कॉन्फ़िगरेशन साझा करते हैं ताकि वर्कफ़्लो में पीडीएफ तुलना को एकीकृत किया जा सके, जिसमें सीआई (निरंतर एकीकरण) पाइपलाइनों और गिट शामिल हैं, जो हार्डवेयर डिज़ाइन और पाठ्यपुस्तक तुलना में व्यावहारिक अनुप्रयोगों को उजागर करते हैं।",
      "चर्चा विभिन्न उपकरणों की ताकतों और सीमाओं पर जोर देती है, जिसमें विशिष्ट विशेषताओं के आधार पर ओपन-सोर्स विकल्पों और स्वामित्व सॉफ़्टवेयर के बीच प्राथमिकताएँ विभाजित होती हैं।"
    ],
    "points": 356,
    "commentCount": 54,
    "retryCount": 0,
    "time": 1719905168
  },
  {
    "id": 40853770,
    "title": "गूगल ड्राइव से लिनक्स बूट करना",
    "originLink": "https://ersei.net/en/blog/fuse-root",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40853770",
    "commentBody": "",
    "originSummary": [
      "एक डेवलपर ने FUSE और कस्टम initramfs का उपयोग करके Google Drive से Linux को सफलतापूर्वक बूट किया, जो क्लाउड-नेटिव कंप्यूटिंग के लिए एक नया दृष्टिकोण प्रदर्शित करता है।",
      "इस प्रक्रिया में Google Drive को माउंट करने के लिए google-drive-ocamlfuse का उपयोग करना और टूटे हुए सिमलिंक और धीमी प्रदर्शन जैसी चुनौतियों के बावजूद Arch Linux को स्थानांतरित करना शामिल था।",
      "इस अवधारणा का प्रमाण, जिसे वास्तविक हार्डवेयर पर परीक्षण किया गया, भविष्य की संभावनाओं को उजागर करता है जैसे कि SSH या Git रिपॉजिटरी से लिनक्स को बूट करना, जो नवाचारी क्लाउड-नेटिव समाधानों की संभावनाओं पर जोर देता है।"
    ],
    "commentSummary": [
      "गूगल ड्राइव से सीधे लिनक्स बूट करने के लिए एक नई विधि का प्रदर्शन किया गया है, जो पुराने नेटवर्क बूटिंग तकनीकों जैसे सन सोलारिस के वानबूट की याद दिलाती है।",
      "यह दृष्टिकोण आधुनिक UEFI (यूनिफाइड एक्स्टेंसिबल फर्मवेयर इंटरफेस) क्षमताओं का उपयोग करता है, जो HTTP से बूट कर सकता है, जिससे नेटवर्क के माध्यम से दोनों initramfs (प्रारंभिक RAM फाइलसिस्टम) और कर्नेल को लोड करना संभव हो जाता है।",
      "चर्चा इस बात पर प्रकाश डालती है कि रास्पबेरी पाई जैसे उपकरणों के लिए समान विधियों का उपयोग करने की संभावना है, जो पहले से ही PXE (प्रीबूट निष्पादन वातावरण) और अन्य प्रोटोकॉल का उपयोग करके नेटवर्क बूटिंग कर सकते हैं।"
    ],
    "points": 318,
    "commentCount": 130,
    "retryCount": 0,
    "time": 1719897623
  },
  {
    "id": 40851919,
    "title": "हैटेट्रिस में विश्व रिकॉर्ड प्राप्त करना (2022)",
    "originLink": "https://hallofdreams.org/posts/hatetris/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40851919",
    "commentBody": "",
    "originSummary": [
      "हेटट्रिस, सैम ह्यूजेस द्वारा बनाई गई एक चुनौतीपूर्ण टेट्रिस संस्करण, एक निर्धारक एल्गोरिदम का उपयोग करता है जो हमेशा खिलाड़ी को सबसे खराब संभव टुकड़ा देता है।",
      "रस्ट अनुकूलन, ह्यूरिस्टिक बीम सर्च, और AWS पर पैरामीटर ट्यूनिंग का उपयोग करके HATETRIS में उच्च स्कोर को 86 अंकों तक बढ़ाया गया।",
      "मुख्य पाठों में प्रोफाइलिंग का महत्व, प्रभावी डेटा संरचनाएँ, मशीन लर्निंग के लिए पर्याप्त हार्डवेयर, और बेहतर परिणामों के लिए हीयुरिस्टिक्स को मिलाना शामिल है।"
    ],
    "commentSummary": [
      "चर्चा का केंद्र हेटेट्रिस में विश्व रिकॉर्ड हासिल करना है, जो एक टेट्रिस संस्करण है जो हमेशा सबसे खराब संभव टुकड़ा देता है, तकनीकी चुनौतियों और इसमें शामिल धैर्य को उजागर करते हुए।",
      "प्रतिभागी व्यक्तिगत अनुभव, संबंधित परियोजनाएँ, और मशीन लर्निंग, न्यूरल नेटवर्क, और बीम सर्च जैसी सरल विधियों का उपयोग करके ऐसे जटिल समस्याओं से निपटने पर विचार साझा करते हैं।",
      "बातचीत में टेट्रिस वेरिएशनों की स्थायी अपील, क्लोन बनाने की कानूनी चुनौतियाँ, और डेवलपर्स पर टेट्रिस इफेक्ट का प्रभाव भी शामिल है।"
    ],
    "points": 237,
    "commentCount": 40,
    "retryCount": 0,
    "time": 1719876365
  },
  {
    "id": 40853845,
    "title": "माको – तेज़, उत्पादन-ग्रेड वेब बंडलर जो रस्ट पर आधारित है",
    "originLink": "https://makojs.dev/blog/mako-open-sourced",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40853845",
    "commentBody": "",
    "originSummary": [
      "Mako, एक तेज़, उत्पादन-ग्रेड फ्रंट-एंड निर्माण उपकरण जो Rust पर आधारित है, अब ओपन सोर्स है और GitHub पर उपलब्ध है।",
      "बिल्ड गति समस्याओं को हल करने के लिए विकसित, माको ने बिल्ड समय को काफी हद तक कम कर दिया है, जैसे कि एंट डिज़ाइन प्रो के लिए 16 सेकंड से 3.9 सेकंड तक।",
      "यह परियोजना, जो मार्च 2023 में शुरू हुई थी, नवंबर 2023 में एंट ग्रुप में आंतरिक रूप से जारी की गई और जून 2024 तक ओपन-सोर्स कर दी गई।"
    ],
    "commentSummary": [
      "Mako एक तेज़, उत्पादन-ग्रेड वेब बंडलर है जिसे रस्ट में विकसित किया गया है, जो वेब अनुप्रयोगों को कुशलतापूर्वक बंडल करके विकास चक्र को बढ़ाने के लिए डिज़ाइन किया गया है।",
      "यह बंडलिंग के साथ अक्सर जुड़े धीमे प्रारंभिक लोड समय के व्यापार को कम करने का लक्ष्य रखता है, और मौजूदा पारिस्थितिक तंत्र के साथ बेहतर संगतता के लिए अनप्लगिन प्रणाली का समर्थन करने की योजना बनाता है।",
      "चर्चा में बंडलर्स के लाभों पर प्रकाश डाला गया है, जैसे कि अनुकूल कैशिंग और कोड स्प्लिटिंग, और Mako की तुलना अन्य उपकरणों जैसे esbuild और swc से की गई है, जिसमें वेब बंडलर क्षेत्र में चल रहे विकास और प्रतिस्पर्धा का उल्लेख किया गया है।"
    ],
    "points": 208,
    "commentCount": 152,
    "retryCount": 0,
    "time": 1719898885
  },
  {
    "id": 40851895,
    "title": "कोड समीक्षा बग ढूंढती है",
    "originLink": "https://two-wrongs.com/code-reviews-do-find-bugs.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40851895",
    "commentBody": "",
    "originSummary": [
      "2015 में माइक्रोसॉफ्ट द्वारा किए गए एक शोध जिसका शीर्षक था 'कोड रिव्यू बग्स नहीं ढूंढते' का दावा है कि कोड रिव्यू टिप्पणियों में से केवल लगभग 15% संभावित दोषों की ओर संकेत करती हैं, लेकिन यह आंकड़ा भ्रामक है।",
      "पिछले शोध से संकेत मिलता है कि कोड समीक्षाएं और जोड़ी प्रोग्रामिंग केवल 15% समय निवेश में वृद्धि के साथ अतिरिक्त 60% दोषों को खोज सकती हैं, विशेष रूप से छोटे कोड टुकड़ों पर प्रभावी होती हैं।",
      "माइक्रोसॉफ्ट पेपर के सिद्धांत का खंडन उन साक्ष्यों से होता है जो कोड समीक्षाओं की दोष पहचान और कोडबेस सीखने में प्रभावशीलता को दर्शाते हैं, जबकि वास्तविक समस्या 24 घंटे की औसत समीक्षा प्रतिक्रिया समय है।"
    ],
    "commentSummary": [
      "कोड समीक्षाएं बग्स, तकनीकी ऋण, और कोड की गंधों की पहचान करने में प्रभावी होती हैं, जिससे एक अधिक बनाए रखने योग्य कोडबेस में योगदान मिलता है।",
      "चर्चा में एक सहायक कोड समीक्षा संस्कृति बनाने के महत्व पर प्रकाश डाला गया है, जिसमें फीचर फ्लैग्स का उपयोग, परिवर्तनों को छोटे भागों में विभाजित करना, और स्पष्ट अपेक्षाएँ निर्धारित करना जैसी प्रथाएँ शामिल हैं।",
      "बहस में कोड समीक्षाओं की दक्षता और आवश्यकता पर विभिन्न दृष्टिकोण शामिल हैं, जिसमें कुछ लोग पारंपरिक समीक्षाओं को पूरक या प्रतिस्थापित करने के लिए जोड़ी प्रोग्रामिंग और स्वचालित परीक्षण जैसे विकल्पों की वकालत करते हैं।"
    ],
    "points": 174,
    "commentCount": 130,
    "retryCount": 0,
    "time": 1719876193
  },
  {
    "id": 40856791,
    "title": "लेडीबर्ड वेब ब्राउज़र $1M के साथ GitHub संस्थापक से गैर-लाभकारी बन गया",
    "originLink": "https://lunduke.locals.com/post/5812560/ladybird-web-browser-becomes-a-non-profit-with-1-million-from-github-founder",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40856791",
    "commentBody": "",
    "originSummary": [
      "लेडीबर्ड ब्राउज़र इनिशिएटिव, एक गैर-लाभकारी संगठन जिसे गिटहब के क्रिस वानस्ट्राथ और सेरेनिटीओएस के एंड्रियास क्लिंग द्वारा स्थापित किया गया है, का उद्देश्य एक ऐसा वेब ब्राउज़र विकसित करना है जो कॉर्पोरेट और विज्ञापन प्रभाव से मुक्त हो।",
      "वानस्ट्राथ से $1 मिलियन और शॉपिफाई से पहले की फंडिंग के साथ, लेडीबर्ड 2026 तक एक अल्फा संस्करण जारी करने की योजना बना रहा है, जो उपयोगकर्ता की गोपनीयता और खुले मानकों पर केंद्रित होगा।",
      "इस पहल ने पहले ही कई पूर्णकालिक डेवलपर्स को नियुक्त कर लिया है और महत्वपूर्ण प्रगति की है, संदेह के बावजूद, एक वास्तव में स्वतंत्र ब्राउज़िंग अनुभव प्रदान करने की आकांक्षा रखते हुए।"
    ],
    "commentSummary": [
      "लेडीबर्ड वेब ब्राउज़र ने गिटहब के संस्थापक क्रिस वानस्ट्राथ से $1M के दान के साथ एक गैर-लाभकारी संगठन में परिवर्तन किया है।",
      "संस्थापक एंड्रियास क्लिंग ने परियोजना के भविष्य पर बात की, महत्वपूर्ण वित्तीय सहायता के बिना एक नया ब्राउज़र विकसित करने के बारे में संदेह के बावजूद आशावाद पर जोर दिया।",
      "टीम का उद्देश्य खुले वेब मानकों का समर्थन करना, वित्तीय स्थिरता के लिए एक छोटी टीम बनाए रखना, और परियोजना को एक उदार लाइसेंस के तहत ओपन-सोर्स रखना है, साथ ही भविष्य के विकास के लिए मेमोरी-सुरक्षित भाषाओं का अन्वेषण करना है।"
    ],
    "points": 153,
    "commentCount": 348,
    "retryCount": 0,
    "time": 1719928905
  },
  {
    "id": 40857041,
    "title": "पांचवें व्यस्त बीवर के साथ, शोधकर्ता गणना की सीमाओं के करीब पहुंच रहे हैं",
    "originLink": "https://www.quantamagazine.org/amateur-mathematicians-find-fifth-busy-beaver-turing-machine-20240702/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40857041",
    "commentBody": "",
    "originSummary": [
      "शोधकर्ताओं ने दशकों के प्रयास के बाद, पांचवें व्यस्त बीवर के रूप में जाने जाने वाले एक साधारण कंप्यूटर प्रोग्राम की जटिलता को दर्शाने वाले BB(5) के मूल्य को निर्धारित किया है।",
      "मूल्य को Coq प्रूफ असिस्टेंट का उपयोग करके सत्यापित किया गया, जिससे गणितीय सटीकता सुनिश्चित हुई, और पाँचवाँ व्यस्त बीवर 47,176,870 चरणों के बाद रुकता है।",
      "इस उपलब्धि में एक विविध टीम शामिल थी, जिसमें शौकिया गणितज्ञों और विशेषज्ञों दोनों का योगदान था, और यह BB(6) की अत्यधिक कठिनाई के कारण अंतिम व्यस्त बीवर संख्या हो सकती है।"
    ],
    "commentSummary": [
      "शोधकर्ता पांचवें बिजी बीवर समस्या के साथ संगणकीय सीमाओं के करीब पहुंच रहे हैं, जो यह निर्धारित करती है कि एक ट्यूरिंग मशीन एक दिए गए संख्या के राज्यों के साथ रुकने से पहले अधिकतम कितने कदम उठा सकती है।",
      "कोक, एक औपचारिक सत्यापन उपकरण, का उपयोग करके एक महत्वपूर्ण मील का पत्थर हासिल किया गया है, जो इस क्षेत्र में प्रगति को दर्शाता है।",
      "पाँचवाँ व्यस्त बीवर संख्या, BB(5), को 47,176,870 चरणों के रूप में सिद्ध किया गया है, हालांकि कोलात्ज़ अनुमान से संबंधित छह-नियम मशीन जैसी चुनौतियाँ बनी हुई हैं।"
    ],
    "points": 152,
    "commentCount": 33,
    "retryCount": 0,
    "time": 1719930451
  },
  {
    "id": 40857517,
    "title": "मेटा 3डी जेन",
    "originLink": "https://ai.meta.com/research/publications/meta-3d-gen/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40857517",
    "commentBody": "",
    "originSummary": [
      "मेटा 3डी जेन (3DGen) एक अत्याधुनिक पाइपलाइन है जो एक मिनट से भी कम समय में टेक्स्ट से 3डी एसेट्स उत्पन्न करती है, और प्रॉम्प्ट की सटीकता और गुणवत्ता में उत्कृष्ट है।",
      "यह भौतिक-आधारित रेंडरिंग (PBR) और जनरेटिव रीटेक्सचरिंग का समर्थन करता है, गति और दृश्य गुणवत्ता दोनों में उद्योग मानकों से बेहतर प्रदर्शन करता है।",
      "3DGen मेटा 3D एसेटजेन और मेटा 3D टेक्सचरजेन को एकीकृत करता है, जो 3D वस्तुओं को दृश्य, वॉल्यूमेट्रिक, और यूवी स्थानों में प्रदर्शित करता है।"
    ],
    "commentSummary": [
      "मेटा एक नया उपकरण, मेटा 3डी जेन, विकसित कर रहा है, जिसका उद्देश्य वीआर सामग्री निर्माण को बेहतर बनाना है, जो वर्तमान में श्रम-सघन है।",
      "मौजूदा सेवाएं जैसे Meshy, Rodin, और Luma Labs विस्तृत वीआर मॉडल के लिए आवश्यक गुणवत्ता की कमी रखती हैं, जो बेहतर समाधानों की आवश्यकता को उजागर करती हैं।",
      "समुदाय को उम्मीद है कि मेटा का समाधान वर्तमान 3D मॉडल निर्माण उपकरणों में खराब बनावट गुणवत्ता और अक्षम टोपोलॉजी जैसी समस्याओं का समाधान करेगा।"
    ],
    "points": 144,
    "commentCount": 45,
    "retryCount": 0,
    "time": 1719933565
  },
  {
    "id": 40857009,
    "title": "जुपिटर नोटबुक्स में मिस्ट्रल कोडेस्ट्रल और GPT-4o जोड़ना",
    "originLink": "https://github.com/pretzelai/pretzelai/blob/main/README.md",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40857009",
    "commentBody": "",
    "originSummary": [
      "प्रेट्ज़ेल जुपिटर लैब का एक नया फोर्क है जो एआई कोड जनरेशन फीचर्स को एकीकृत करता है, जो मूल जुपिटर में ऐसी एक्सटेंशनों की कमी को दूर करता है।",
      "मुख्य विशेषताओं में इनलाइन टैब ऑटोकंप्लीट, सेल-स्तरीय कोड जनरेशन, और एक साइडबार चैट शामिल हैं, जो सभी संदर्भात्मक एआई सहायता के साथ कोडिंग अनुभव को बेहतर बनाने के लिए डिज़ाइन किए गए हैं।",
      "प्रेट्ज़ल का उद्देश्य जुपिटर को आधुनिक बनाना है, जिसमें रियल-टाइम सहयोग, SQL समर्थन, एक दृश्य विश्लेषण निर्माता, और एक VSCode जैसी इंटरफ़ेस जैसी अतिरिक्त सुविधाएँ शामिल हैं, जिससे यह डेटा वैज्ञानिकों के लिए एक व्यापक उपकरण बन जाता है।"
    ],
    "commentSummary": [
      "प्रेट्ज़ल एक मुफ्त, ओपन-सोर्स जुपिटर लैब का फोर्क है, जो एक अधिक एकीकृत और संदर्भ-सचेत अनुभव के लिए एआई कोड जनरेशन सुविधाएँ जोड़ता है।",
      "मुख्य विशेषताओं में मिस्त्रल कोडेस्ट्रल या GPT-4o का उपयोग करके इनलाइन टैब ऑटोकंप्लीट, सेल-स्तरीय कोड जनरेशन, और वर्तमान सेल या चयनित पाठ के संदर्भ के साथ एक साइडबार चैट शामिल हैं।",
      "प्रेट्ज़ल का उद्देश्य जुपिटर को आधुनिक बनाना है, जिसमें रियल-टाइम सहयोग, SQL समर्थन, और एक दृश्य विश्लेषण बिल्डर जैसी विशेषताएं शामिल हैं, जो इसे नोटेबल, डीपनोट, जुपिटर-एआई, कोलैब, और कोकैल्क जैसे अन्य एआई-समेकित उपकरणों से अलग करती हैं।"
    ],
    "points": 129,
    "commentCount": 41,
    "retryCount": 0,
    "time": 1719930236
  },
  {
    "id": 40852084,
    "title": "स्विट्ज़रलैंड सार्वजनिक क्षेत्र के लिए सॉफ़्टवेयर स्रोत कोड का खुलासा अनिवार्य करता है",
    "originLink": "https://joinup.ec.europa.eu/collection/open-source-observatory-osor/news/new-open-source-law-switzerland",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40852084",
    "commentBody": "",
    "originSummary": [
      "स्विट्जरलैंड ने \"सरकारी कार्यों की पूर्ति के लिए इलेक्ट्रॉनिक साधनों के उपयोग पर संघीय कानून\" (EMBAG) लागू किया है, जो सार्वजनिक क्षेत्र की संस्थाओं में ओपन सोर्स सॉफ्टवेयर (OSS) को अनिवार्य बनाता है।",
      "कानून, प्रोफेसर डॉ. मैटियास स्टर्मर के नेतृत्व में, विक्रेता लॉक-इन को कम करने, करदाताओं की लागत को कम करने और बढ़ी हुई प्रतिस्पर्धा और नवाचार के माध्यम से सेवाओं को बेहतर बनाने का लक्ष्य रखता है।",
      "EMBAG पारदर्शिता और दक्षता को बढ़ावा देता है, सार्वजनिक निकायों को सॉफ़्टवेयर स्रोत कोड का खुलासा करने की आवश्यकता होती है, जब तक कि तीसरे पक्ष के अधिकारों या सुरक्षा चिंताओं द्वारा प्रतिबंधित न हो, और उन्हें लागत-आवरण पारिश्रमिक पर अतिरिक्त आईटी सेवाएं प्रदान करने की अनुमति देता है।"
    ],
    "commentSummary": [
      "स्विट्ज़रलैंड का EMBAG कानून सार्वजनिक क्षेत्र के सॉफ़्टवेयर स्रोत कोड के प्रकटीकरण को अनिवार्य करता है, जिसमें तृतीय-पक्ष अधिकारों या सुरक्षा चिंताओं के लिए अपवाद शामिल हैं।",
      "कानून का उद्देश्य ओपन-सोर्स सॉफ़्टवेयर (OSS) को बढ़ावा देना है और सार्वजनिक निकायों को लागत-आवरण दरों पर संबंधित सेवाएं प्रदान करने की अनुमति देता है, हालांकि आलोचकों को संभावित खामियों और अस्पष्ट प्रवर्तन के बारे में चिंता है।",
      "यह पहल सार्वजनिक सेवाओं में व्यापक ओएसएस अपनाने की दिशा में ले जा सकती है, हालांकि ऑडिटिंग और अनुपालन में चुनौतियाँ हैं।"
    ],
    "points": 124,
    "commentCount": 18,
    "retryCount": 0,
    "time": 1719877702
  },
  {
    "id": 40849840,
    "title": "जब रैंड ने सांता मोनिका में जादू किया",
    "originLink": "https://asteriskmag.com/issues/06/when-rand-made-magic-in-santa-monica",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40849840",
    "commentBody": "",
    "originSummary": [
      "रैंड कॉर्पोरेशन का स्वर्ण युग, जो दो दशकों तक फैला, ने परमाणु रणनीति, उपग्रह, प्रणाली विश्लेषण और प्रारंभिक कंप्यूटिंग में प्रमुख प्रगति की।",
      "शुरुआत में वायु सेना का एक अनुसंधान शाखा, RAND की सफलता एक प्रतिभाशाली, स्वतंत्र, और अंतःविषय टीम द्वारा संचालित थी, जिसने गेम थ्योरी, एआई, और पैकेट स्विचिंग जैसे क्षेत्रों में योगदान दिया।",
      "समय के साथ, वायु सेना के साथ तनावपूर्ण संबंधों और सामाजिक नीति अनुसंधान में विविधीकरण के कारण RAND का ध्यान बदल गया, जिससे अत्याधुनिक विज्ञान और नवाचार में गिरावट आई।"
    ],
    "commentSummary": [
      "रैंड कॉर्पोरेशन द्वितीय विश्व युद्ध और शीत युद्ध के दौरान अत्यधिक प्रभावशाली थी, जैसे कि गूगल या बेल लैब्स के चरम समय में।",
      "यह प्रमुख कंप्यूटर वैज्ञानिकों और गणितज्ञों का एक केंद्र था, जिसने उस क्षेत्र में महत्वपूर्ण योगदान दिया जिसे अब डेटा विज्ञान के रूप में जाना जाता है, जिसे मूल रूप से 'ऑपरेशंस रिसर्च' कहा जाता था।",
      "अपने ऐतिहासिक महत्व और सहयोग के लिए नवाचारी कार्यालय डिजाइनों के बावजूद, RAND की आधुनिक पहचान कम हो गई है, जिसमें इसकी विरासत में महत्वपूर्ण शोध और वियतनाम युद्ध के दौरान की विवादास्पद रणनीतियाँ शामिल हैं।"
    ],
    "points": 121,
    "commentCount": 45,
    "retryCount": 0,
    "time": 1719863300
  },
  {
    "id": 40849363,
    "title": "एक गिट कहानी: इस बार इतना मजेदार नहीं",
    "originLink": "https://blog.brachiosoft.com/en/posts/git/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40849363",
    "commentBody": "",
    "originSummary": [
      "लिनुस टॉर्वाल्ड्स ने 2005 में Git को आवश्यकता के कारण बनाया, जब पहले उपयोग किए गए संस्करण नियंत्रण प्रणाली BitKeeper के मुफ्त लाइसेंस को रद्द कर दिया गया।",
      "गिट का विकास मोनोटोन से प्रेरित था लेकिन इसे सरल और तेज बनाने का लक्ष्य था, जिससे यह जल्दी ही योगदानकर्ताओं और लोकप्रियता प्राप्त करने लगा, विशेष रूप से रूबी समुदाय के भीतर।",
      "GitHub, जो 2008 में लॉन्च हुआ, ने Git के अपनाने में महत्वपूर्ण वृद्धि की, जिससे यह संस्करण नियंत्रण बाजार में 94% हिस्सेदारी के साथ वर्तमान में प्रमुख बन गया है।"
    ],
    "commentSummary": [
      "यह पोस्ट संस्करण नियंत्रण प्रणालियों के इतिहास और विकास पर चर्चा करती है, विशेष रूप से Git और इसके पूर्ववर्तियों जैसे BitKeeper और Mercurial पर ध्यान केंद्रित करती है।",
      "यह 2022 के स्टैक ओवरफ्लो सर्वेक्षण के अनुसार 94% हिस्सेदारी के साथ बाजार में गिट के प्रभुत्व को उजागर करता है, और इस पर बहस करता है कि क्या कोई भविष्य की प्रणाली इसे बदल सकती है।",
      "बातचीत में व्यक्तिगत किस्से और विभिन्न संस्करण नियंत्रण प्रणालियों पर राय शामिल हैं, जिसमें गिट के व्यापक अपनाने और आधुनिक विकास कार्यप्रवाहों में इसके एकीकरण पर जोर दिया गया है।"
    ],
    "points": 121,
    "commentCount": 26,
    "retryCount": 0,
    "time": 1719861052
  },
  {
    "id": 40850313,
    "title": "वेनेजुएला पहला एंडीज़ देश है जिसने अपनी सभी हिमनदों को खो दिया है",
    "originLink": "https://www.nbcnews.com/news/latino/-great-sadness-venezuela-first-andean-country-lose-glaciers-rcna153784",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40850313",
    "commentBody": "",
    "originSummary": [
      "वेनेजुएला पहला एंडियन देश बन गया है जिसने अपने सभी ग्लेशियर खो दिए हैं, क्योंकि सिएरा नेवादा में स्थित हंबोल्ट ग्लेशियर अब इतना छोटा हो गया है कि उसे ग्लेशियर के रूप में वर्गीकृत नहीं किया जा सकता।",
      "अंतर्राष्ट्रीय जलवायु और क्रायोस्फीयर पहल (ICCI) ने इस स्थिति की पुष्टि की, यह बताते हुए कि वेनेजुएला के सिएरा नेवादा में छह ग्लेशियर थे, लेकिन 2011 तक केवल हम्बोल्ट ग्लेशियर ही बचा था।",
      "वैज्ञानिक ग्लेशियर के गायब होने का कारण जलवायु परिवर्तन और बढ़ते वैश्विक तापमान को मानते हैं, और 2023 के एक अध्ययन के अनुसार, यदि तापमान बढ़ता रहा तो 2100 तक दुनिया के 83% ग्लेशियर गायब हो सकते हैं।"
    ],
    "commentSummary": [
      "वेनेजुएला पहला एंडियन देश है जिसने अपनी सभी हिमनदों को खो दिया है, जहाँ हिमनद सतह 1952 में 2.317 वर्ग किलोमीटर से घटकर 2019 में केवल 0.046 वर्ग किलोमीटर रह गई है।",
      "यह भारी कमी पर्यावरण पर जलवायु परिवर्तन के गंभीर प्रभाव को रेखांकित करती है।",
      "इस नुकसान ने इन आंकड़ों की सटीकता और ग्लेशियरों के पीछे हटने के व्यापक भावनात्मक और पर्यावरणीय प्रभावों पर चर्चाओं को प्रेरित किया है।"
    ],
    "points": 115,
    "commentCount": 40,
    "retryCount": 0,
    "time": 1719865850
  }
]
