[
  {
    "id": 40856030,
    "title": "Waarom is Chili zo lang?",
    "originLink": "https://unchartedterritories.tomaspueyo.com/p/why-is-chile-so-long",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40856030",
    "commentBody": "",
    "originSummary": [
      "De unieke lengte van Chili komt door de Andesgebergte, waardoor er een smalle strook land ontstaat tussen de bergen en de Stille Oceaan.",
      "De geografie van het land wordt gevormd door de botsing van de Nazca- en Zuid-Amerikaanse tektonische platen, waardoor de Andes ontstaan.",
      "De grenzen van Chili werden historisch betwist, met name in de Oorlog van de Stille Oceaan, waar het grondstofrijke gebieden verwierf."
    ],
    "commentSummary": [
      "Chili's unieke geografie, met de Andesgebergte en de Stille Oceaan als natuurlijke grenzen, en historische factoren hebben zijn lange en smalle vorm gevormd.",
      "Het land strekt zich uit over diverse klimaten, van de Atacama-woestijn in het noorden tot koude zuidelijke regio's, wat invloed heeft op de gecentraliseerde bevolking in Santiago.",
      "De diverse geografie van Chili beïnvloedt ook het dialect van het Spaans, waardoor het unieke kenmerken heeft in vergelijking met andere Spaanstalige regio's."
    ],
    "points": 617,
    "commentCount": 204,
    "retryCount": 0,
    "time": 1719923818
  },
  {
    "id": 40854836,
    "title": "Welkom bij Ladybird, een echt onafhankelijke webbrowser",
    "originLink": "https://ladybird.org/index.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40854836",
    "commentBody": "",
    "originSummary": [
      "Ladybird is een onafhankelijke webbrowser en engine, oorspronkelijk een HTML-viewer voor SerenityOS, die nu Linux, macOS en andere Unix-achtige systemen ondersteunt.",
      "Unieke kenmerken zijn onder andere geen code van andere browsers, een unieke focus op het zijn van een webbrowser, en geen monetisatie door advertenties of gebruikersgegevens.",
      "Een Alpha-release is gepland voor de zomer van 2026, met ontwikkeling gefinancierd door sponsoring en donaties, en een team van 4 fulltime ingenieurs."
    ],
    "commentSummary": [
      "Ladybird is een onafhankelijke webbrowser, en de officiële website is ladybird.org.",
      "Discussies en opmerkingen over Ladybird zijn verplaatst naar een specifieke thread op Hacker News, die momenteel op de voorpagina staat."
    ],
    "points": 530,
    "commentCount": 1,
    "retryCount": 0,
    "time": 1719911676
  },
  {
    "id": 40854319,
    "title": "Diff-pdf: hulpmiddel om twee PDF's visueel te vergelijken",
    "originLink": "https://github.com/vslavik/diff-pdf",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40854319",
    "commentBody": "",
    "originSummary": [
      "De tool `diff-pdf` stelt gebruikers in staat om twee PDF-bestanden visueel te vergelijken en markeert eventuele verschillen.",
      "De repository wordt niet actief ontwikkeld, en gebruikers worden aangemoedigd om pull requests in te dienen voor verbeteringen, maar moeten geen ondersteuning of nieuwe functies verwachten.",
      "Installatie-instructies worden verstrekt voor verschillende besturingssystemen, waaronder Windows, macOS en verschillende Linux-distributies, met gedetailleerde stappen voor het compileren vanuit de bron."
    ],
    "commentSummary": [
      "Diff-pdf is een tool ontworpen voor het visueel vergelijken van twee PDF-bestanden, waarbij gebruikers de bruikbaarheid en alternatieven zoals ImageMagick, Delta Walker en Beyond Compare bespreken.",
      "Gebruikers delen scripts en configuraties voor het integreren van PDF-vergelijking in workflows, inclusief CI (Continuous Integration) pipelines en git, waarbij praktische toepassingen in hardwareontwerp en leerboekvergelijkingen worden benadrukt.",
      "De discussie benadrukt de sterke punten en beperkingen van verschillende tools, waarbij de voorkeuren verdeeld zijn tussen open-source opties en propriëtaire software op basis van specifieke kenmerken."
    ],
    "points": 356,
    "commentCount": 54,
    "retryCount": 0,
    "time": 1719905168
  },
  {
    "id": 40853770,
    "title": "Linux opstarten vanaf Google Drive",
    "originLink": "https://ersei.net/en/blog/fuse-root",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40853770",
    "commentBody": "",
    "originSummary": [
      "Een ontwikkelaar heeft met succes Linux opgestart vanaf Google Drive met behulp van FUSE en een aangepaste initramfs, waarmee een nieuwe benadering van cloud-native computing wordt getoond.",
      "Het proces omvatte het gebruik van google-drive-ocamlfuse om Google Drive te koppelen en Arch Linux over te zetten, ondanks uitdagingen zoals gebroken symlinks en trage prestaties.",
      "Dit proof of concept, getest op echte hardware, benadrukt toekomstige mogelijkheden zoals het opstarten van Linux via SSH of een Git-repository, waarbij de nadruk ligt op het potentieel voor innovatieve cloud-native oplossingen."
    ],
    "commentSummary": [
      "Er is een nieuwe methode gedemonstreerd om Linux direct op te starten vanaf Google Drive, wat doet denken aan oudere netwerkopstarttechnieken zoals Sun Solaris' wanboot.",
      "Deze aanpak maakt gebruik van moderne UEFI (Unified Extensible Firmware Interface) mogelijkheden, die kunnen opstarten vanaf HTTP, waardoor het mogelijk is om zowel de initramfs (initial RAM filesystem) als de kernel over het netwerk te laden.",
      "De discussie benadrukt het potentieel voor het gebruik van vergelijkbare methoden voor apparaten zoals Raspberry Pi, die al netwerkbooting kunnen uitvoeren met behulp van PXE (Preboot Execution Environment) en andere protocollen."
    ],
    "points": 318,
    "commentCount": 130,
    "retryCount": 0,
    "time": 1719897623
  },
  {
    "id": 40851919,
    "title": "Het wereldrecord halen in Hatetris (2022)",
    "originLink": "https://hallofdreams.org/posts/hatetris/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40851919",
    "commentBody": "",
    "originSummary": [
      "HATETRIS, een uitdagende Tetris-variant gecreëerd door Sam Hughes, gebruikt een deterministisch algoritme om de speler altijd het slechtst mogelijke stuk te geven.",
      "De hoogste score in HATETRIS werd verhoogd naar 86 punten door gebruik van Rust-optimalisaties, heuristische straalzoektocht en parameterafstemming op AWS.",
      "Belangrijke lessen zijn onder andere het belang van profilering, effectieve datastructuren, substantiële hardware voor machine learning, en het combineren van heuristieken voor betere resultaten."
    ],
    "commentSummary": [
      "De discussie dreier seg om å oppnå en verdensrekord i Hatetris, en Tetris-variant som alltid gir den verst mulige brikken, og fremhever de tekniske utfordringene og utholdenheten som kreves.",
      "Deelnemers delen persoonlijke ervaringen, gerelateerde projecten en reflecties over machine learning, neurale netwerken en eenvoudigere methoden zoals beam search bij het aanpakken van dergelijke complexe problemen.",
      "Het gesprek gaat ook over de blijvende aantrekkingskracht van Tetris-variaties, juridische uitdagingen bij het maken van klonen, en de impact van het Tetris-effect op ontwikkelaars."
    ],
    "points": 237,
    "commentCount": 40,
    "retryCount": 0,
    "time": 1719876365
  },
  {
    "id": 40853845,
    "title": "Mako – snelle, productieklare webbundler gebaseerd op Rust",
    "originLink": "https://makojs.dev/blog/mako-open-sourced",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40853845",
    "commentBody": "",
    "originSummary": [
      "Mako, een snel, productie-waardig front-end build tool gebaseerd op Rust, is nu open source en beschikbaar op GitHub.",
      "Ontwikkeld om bouwsnelheidsproblemen aan te pakken, heeft Mako de bouwtijden aanzienlijk verkort, bijvoorbeeld van 16s tot 3.9s voor Ant Design Pro.",
      "Het project, gestart in maart 2023, werd intern uitgebracht bij Ant Group in november 2023 en open-source gemaakt in juni 2024."
    ],
    "commentSummary": [
      "Mako is een snelle, productieklare webbundelaar ontwikkeld in Rust, ontworpen om de ontwikkelingscyclus te verbeteren door webapplicaties efficiënt te bundelen.",
      "Het heeft als doel de afweging van langzamere initiële laadtijden, die vaak gepaard gaan met bundeling, te minimaliseren en is van plan het unplugin-systeem te ondersteunen voor betere compatibiliteit met bestaande ecosystemen.",
      "De discussie benadrukt de voordelen van bundelaars, zoals optimale caching en code splitting, en vergelijkt Mako met andere tools zoals esbuild en swc, waarbij de voortdurende evolutie en concurrentie in de webbundelaarruimte wordt opgemerkt."
    ],
    "points": 208,
    "commentCount": 152,
    "retryCount": 0,
    "time": 1719898885
  },
  {
    "id": 40851895,
    "title": "Codebeoordelingen vinden wel bugs",
    "originLink": "https://two-wrongs.com/code-reviews-do-find-bugs.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40851895",
    "commentBody": "",
    "originSummary": [
      "Het Microsoft-onderzoek uit 2015 getiteld 'Code Reviews Do Not Find Bugs' beweert dat slechts ongeveer 15% van de opmerkingen bij codebeoordelingen mogelijke defecten aangeven, maar deze statistiek is misleidend.",
      "Uit eerder onderzoek blijkt dat code reviews en pair programming tot 60% extra defecten kunnen opsporen met slechts een 15% toename in tijdsinvestering, vooral effectief bij kleine codefragmenten.",
      "De stelling i Microsoft-rapporten motsies av bevis som viser at kodegjennomganger er effektive for å oppdage feil og lære kodebasen, med det virkelige problemet som er den mediane gjennomgangstiden på 24 timer."
    ],
    "commentSummary": [
      "Codebeoordelingen zijn effectief in het identificeren van bugs, technische schuld en codegeuren, wat bijdraagt aan een beter onderhoudbare codebasis.",
      "De discussie benadrukt het belang van het opbouwen van een ondersteunende code review-cultuur, inclusief praktijken zoals het gebruik van feature flags, het opsplitsen van wijzigingen in kleinere delen en het stellen van duidelijke verwachtingen.",
      "Het debat omvat verschillende perspectieven op de efficiëntie en noodzaak van codebeoordelingen, waarbij sommigen pleiten voor alternatieven zoals pair programming en geautomatiseerd testen om traditionele beoordelingen aan te vullen of te vervangen."
    ],
    "points": 174,
    "commentCount": 130,
    "retryCount": 0,
    "time": 1719876193
  },
  {
    "id": 40856791,
    "title": "Ladybird Web Browser wordt een non-profitorganisatie met $1 miljoen van GitHub-oprichter",
    "originLink": "https://lunduke.locals.com/post/5812560/ladybird-web-browser-becomes-a-non-profit-with-1-million-from-github-founder",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40856791",
    "commentBody": "",
    "originSummary": [
      "Het Ladybird Browser Initiative, een non-profitorganisatie opgericht door Chris Wanstrath van GitHub en Andreas Kling van SerenityOS, heeft als doel een webbrowser te ontwikkelen die vrij is van bedrijfs- en reclame-invloed.",
      "Met $1 miljoen van Wanstrath en eerdere financiering van Shopify, is Ladybird van plan om een alfaversie uit te brengen tegen 2026, met de nadruk op gebruikersprivacy en open standaarden.",
      "Het initiatief heeft al verschillende fulltime ontwikkelaars ingehuurd en aanzienlijke vooruitgang geboekt, ondanks scepsis, met de ambitie om een echt onafhankelijke browse-ervaring te bieden."
    ],
    "commentSummary": [
      "Ladybird Web Browser is overgegaan naar een non-profitorganisatie met een donatie van $1 miljoen van GitHub-oprichter Chris Wanstrath.",
      "De oprichter Andreas Kling sprak over de toekomst van het project en benadrukte optimisme ondanks twijfels over het ontwikkelen van een nieuwe browser zonder aanzienlijke financiering.",
      "Het team streeft ernaar om open webstandaarden te ondersteunen, een klein team te behouden voor financiële duurzaamheid, en het project open-source te houden onder een permissieve licentie terwijl ze geheugenveilige talen verkennen voor toekomstige ontwikkeling."
    ],
    "points": 153,
    "commentCount": 348,
    "retryCount": 0,
    "time": 1719928905
  },
  {
    "id": 40857041,
    "title": "Met de vijfde drukke bever naderen onderzoekers de grenzen van de berekening",
    "originLink": "https://www.quantamagazine.org/amateur-mathematicians-find-fifth-busy-beaver-turing-machine-20240702/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40857041",
    "commentBody": "",
    "originSummary": [
      "Onderzoekers hebben de waarde van BB(5) bepaald, wat de complexiteit vertegenwoordigt van een eenvoudig computerprogramma dat bekend staat als de vijfde drukke bever, na decennia van inspanning.",
      "De waarde werd geverifieerd met behulp van de Coq-bewijsassistent, wat wiskundige nauwkeurigheid garandeert, en de vijfde drukke bever stopt na 47.176.870 stappen.",
      "Deze prestatie betrof een divers team, inclusief bijdragen van zowel amateurwiskundigen als experts, en kan het laatste busy beaver-getal zijn dat is bepaald vanwege de enorme moeilijkheid van BB(6)."
    ],
    "commentSummary": [
      "Onderzoekers naderen de computationele grenzen met het vijfde busy beaver-probleem, dat bepaalt hoeveel stappen een Turing-machine met een bepaald aantal toestanden kan nemen voordat hij stopt.",
      "Een belangrijke mijlpaal is bereikt met een bewijs met behulp van Coq, een formeel verificatie-instrument, wat vooruitgang markeert in het veld.",
      "Het vijfde drukke bevergetal, BB(5), is bewezen 47.176.870 stappen te zijn, hoewel uitdagingen zoals de onoplosbare zes-regel machine gerelateerd aan het Collatz-vermoeden blijven bestaan."
    ],
    "points": 152,
    "commentCount": 33,
    "retryCount": 0,
    "time": 1719930451
  },
  {
    "id": 40857517,
    "title": "Meta 3D Gen",
    "originLink": "https://ai.meta.com/research/publications/meta-3d-gen/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40857517",
    "commentBody": "",
    "originSummary": [
      "Meta 3D Gen (3DGen) is een geavanceerde pijplijn die 3D-assets genereert vanuit tekst in minder dan een minuut, uitblinkend in promptgetrouwheid en kwaliteit.",
      "Het ondersteunt fysiek gebaseerde rendering (PBR) en generatieve hertexturering, en overtreft de industrienormen zowel in snelheid als visuele kwaliteit.",
      "3DGen integreert Meta 3D AssetGen en Meta 3D TextureGen, en vertegenwoordigt 3D-objecten in aanzicht-, volumetrische en UV-ruimtes."
    ],
    "commentSummary": [
      "Meta ontwikkelt een nieuwe tool, Meta 3D Gen, gericht op het verbeteren van VR-inhoudgeneratie, die momenteel arbeidsintensief is.",
      "De bestaande diensten zoals Meshy, Rodin en Luma Labs missen de kwaliteit die nodig is voor gedetailleerde VR-modellen, wat de behoefte aan betere oplossingen benadrukt.",
      "De gemeenschap hoopt dat Meta's oplossing problemen zoals slechte textuurkwaliteit en inefficiënte topologie in de huidige 3D-modelgeneratietools zal aanpakken."
    ],
    "points": 144,
    "commentCount": 45,
    "retryCount": 0,
    "time": 1719933565
  },
  {
    "id": 40857009,
    "title": "Het toevoegen van Mistral Codestral en GPT-4o aan Jupyter Notebooks",
    "originLink": "https://github.com/pretzelai/pretzelai/blob/main/README.md",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40857009",
    "commentBody": "",
    "originSummary": [
      "Pretzel is een nieuwe fork van Jupyter Lab die AI-codegeneratiefuncties integreert, waarmee het gebrek aan dergelijke extensies in de originele Jupyter wordt aangepakt.",
      "Belangrijke functies zijn onder meer inline tab-aanvulling, codegeneratie op celniveau en een zijbalkchat, allemaal ontworpen om de codeerervaring te verbeteren met contextuele AI-assistentie.",
      "Pretzel wil Jupyter moderniseren met extra functies zoals realtime samenwerking, SQL-ondersteuning, een visuele analysebouwer en een interface die lijkt op VSCode, waardoor het een uitgebreid hulpmiddel voor datawetenschappers wordt."
    ],
    "commentSummary": [
      "Pretzel is een gratis, open-source fork van Jupyter Lab, met AI-codegeneratiefuncties voor een meer geïntegreerde en contextbewuste ervaring.",
      "Belangrijke kenmerken zijn onder andere inline Tab-autocompletie met behulp van Mistral Codestral of GPT-4o, codegeneratie op celniveau en een zijbalkchat met context van de huidige cel of geselecteerde tekst.",
      "Pretzel wil Jupyter moderniseren met functies zoals realtime samenwerking, SQL-ondersteuning en een visuele analysebouwer, waardoor het zich onderscheidt van andere AI-geïntegreerde tools zoals Noteable, Deepnote, Jupyter-ai, Colab en CoCalc."
    ],
    "points": 129,
    "commentCount": 41,
    "retryCount": 0,
    "time": 1719930236
  },
  {
    "id": 40852084,
    "title": "Zwitserland verplicht openbaarmaking van broncode voor software in de publieke sector",
    "originLink": "https://joinup.ec.europa.eu/collection/open-source-observatory-osor/news/new-open-source-law-switzerland",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40852084",
    "commentBody": "",
    "originSummary": [
      "Zwitserland heeft de \"Federale wet op het gebruik van elektronische middelen voor de vervulling van overheidstaken\" (EMBAG) ingevoerd, die open source software (OSS) verplicht stelt in overheidsinstanties.",
      "De wet, geleid door professor Dr. Matthias Stürmer, heeft als doel om vendor lock-in te verminderen, de kosten voor belastingbetalers te verlagen en de diensten te verbeteren door middel van verhoogde concurrentie en innovatie.",
      "EMBAG bevordert transparantie en efficiëntie door van overheidsinstanties te eisen dat zij de broncode van software openbaar maken, tenzij dit wordt beperkt door rechten van derden of veiligheidszorgen, en stelt hen in staat om aanvullende IT-diensten aan te bieden tegen kostendekkende vergoeding."
    ],
    "commentSummary": [
      "De EMBAG-wet in Zwitserland verplicht openbaarmaking van broncode voor software in de publieke sector, met uitzonderingen voor rechten van derden of beveiligingsproblemen.",
      "De wet heeft als doel om open-source software (OSS) te promoten en stelt overheidsinstanties in staat om gerelateerde diensten aan te bieden tegen kostendekkende tarieven, hoewel critici zich zorgen maken over mogelijke mazen in de wet en onduidelijke handhaving.",
      "Dit initiatief kan leiden tot bredere OSS-adoptie in openbare diensten, ondanks uitdagingen bij auditing en naleving."
    ],
    "points": 124,
    "commentCount": 18,
    "retryCount": 0,
    "time": 1719877702
  },
  {
    "id": 40849840,
    "title": "Toen RAND magie maakte in Santa Monica",
    "originLink": "https://asteriskmag.com/issues/06/when-rand-made-magic-in-santa-monica",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40849840",
    "commentBody": "",
    "originSummary": [
      "De gouden eeuw van de RAND Corporation, die twee decennia besloeg, leidde tot grote vooruitgangen in nucleaire strategie, satellieten, systeemanalyse en vroege computertechnologie.",
      "Aanvankelijk een onderzoeksafdeling van de luchtmacht, werd het succes van RAND gedreven door een getalenteerd, onafhankelijk en interdisciplinair team, dat bijdroeg aan velden zoals speltheorie, AI en pakketgeschakelde netwerken.",
      "Na verloop van tijd verschoof de focus van RAND door gespannen relaties met de luchtmacht en diversificatie naar sociaal beleidsonderzoek, wat leidde tot een afname van baanbrekende wetenschap en innovatie."
    ],
    "commentSummary": [
      "RAND Corporation was zeer invloedrijk tijdens de Tweede Wereldoorlog en de Koude Oorlog, vergelijkbaar met de hoogtijdagen van Google of Bell Labs.",
      "Het was een knooppunt voor prominente computerwetenschappers en wiskundigen, die aanzienlijk bijdroegen aan het vakgebied dat nu bekend staat als datawetenschap, oorspronkelijk aangeduid als 'Operations Research'.",
      "Ondanks de historische betekenis en innovatieve kantoorontwerpen voor samenwerking, is de moderne erkenning van RAND verminderd, met een nalatenschap die zowel baanbrekend onderzoek als controversiële strategieën zoals die tijdens de Vietnamoorlog omvat."
    ],
    "points": 121,
    "commentCount": 45,
    "retryCount": 0,
    "time": 1719863300
  },
  {
    "id": 40849363,
    "title": "Een Git-verhaal: Deze keer niet zo leuk",
    "originLink": "https://blog.brachiosoft.com/en/posts/git/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40849363",
    "commentBody": "",
    "originSummary": [
      "Linus Torvalds creëerde Git uit noodzaak in 2005 nadat de gratis licentie voor BitKeeper, een eerder gebruikt versiebeheersysteem, werd ingetrokken.",
      "Git's ontwikkeling werd geïnspireerd door Monotone, maar was bedoeld om eenvoudiger en sneller te zijn, en kreeg snel bijdragers en populariteit, vooral binnen de Ruby-gemeenschap.",
      "GitHub, gelanceerd in 2008, heeft de adoptie van Git aanzienlijk bevorderd, wat heeft geleid tot de huidige dominantie in de versiebeheermarkt met een marktaandeel van 94%."
    ],
    "commentSummary": [
      "De post bespreekt de geschiedenis en evolutie van versiesbeheersystemen, met een bijzondere focus op Git en zijn voorgangers zoals BitKeeper en Mercurial.",
      "Het benadrukt de dominantie van Git in de markt, met een marktaandeel van 94% volgens een Stack Overflow-enquête uit 2022, en bespreekt of een toekomstig systeem het zou kunnen vervangen.",
      "Het gesprek bevat persoonlijke anekdotes en meningen over verschillende versiesbeheersystemen, met de nadruk op de wijdverbreide adoptie van Git en de integratie ervan in moderne ontwikkelingsworkflows."
    ],
    "points": 121,
    "commentCount": 26,
    "retryCount": 0,
    "time": 1719861052
  },
  {
    "id": 40850313,
    "title": "Venezuela is het eerste Andesland dat al zijn gletsjers verliest",
    "originLink": "https://www.nbcnews.com/news/latino/-great-sadness-venezuela-first-andean-country-lose-glaciers-rcna153784",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40850313",
    "commentBody": "",
    "originSummary": [
      "Venezuela is het eerste Andesland geworden dat al zijn gletsjers heeft verloren, waarbij de Humboldt-gletsjer in de Sierra Nevada nu te klein is om als gletsjer te worden geclassificeerd.",
      "Het International Climate and Cryosphere Initiative (ICCI) bevestigde deze status en merkte op dat Venezuela zes gletsjers had in de Sierra Nevada, maar dat in 2011 alleen de Humboldt-gletsjer overbleef.",
      "Wetenschappers schrijven het verdwijnen van de gletsjer toe aan klimaatverandering en stijgende wereldwijde temperaturen, met een studie uit 2023 die voorspelt dat 83% van de gletsjers in de wereld tegen 2100 zou kunnen verdwijnen als de temperaturen blijven stijgen."
    ],
    "commentSummary": [
      "Venezuela is het eerste Andesland dat al zijn gletsjers verliest, waarbij het gletsjeroppervlak is gekrompen van 2.317 vierkante kilometer in 1952 tot slechts 0.046 vierkante kilometer in 2019.",
      "Deze drastische vermindering benadrukt de ernstige impact van klimaatverandering op het milieu.",
      "Het verlies heeft discussies op gang gebracht over de nauwkeurigheid van deze cijfers en de bredere emotionele en milieugevolgen van het terugtrekken van gletsjers."
    ],
    "points": 115,
    "commentCount": 40,
    "retryCount": 0,
    "time": 1719865850
  }
]
