[
  {
    "id": 41694044,
    "title": "״בופ ספוטר״",
    "originLink": "https://walzr.com/bop-spotter",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41694044",
    "commentBody": "",
    "originSummary": [
      "ריילי וולץ התקין טלפון אנדרואיד המופעל על ידי אנרגיה סולארית ברובע מישן של סן פרנסיסקו כדי ללכוד מוזיקה רחוב באמצעות שאזאם 24/7, בדומה למערכת זיהוי יריות של Shot Spotter אך עבור מוזיקה.",
      "\"מעקב התרבות\" הזה מתעד מגמות מוזיקה בזמן אמת ללא הסכמה, ומכיל מגוון רחב של ז'אנרים ואמנים, כולל שירים כמו \"You'd Better Believe It\" של The Manhattans ו-\"LALA\" של Myke Towers.",
      "המכשיר מספק זרם רציף של מוזיקה פופולרית, ומציע תובנות על הנוף המוזיקלי באזור."
    ],
    "commentSummary": [
      "בופ ספוטר הוא פרויקט שמקליט קטעי אודיו של 10 דקות במצב טיסה, מעלה אותם לשרת, ומחלק את האודיו לקטעים של 15 שניות כדי ש-API של שאזאם יזהה שירים.",
      "הפרויקט עורר דיונים על פרטיות, ג'נטריפיקציה וההשלכות התרבותיות של מוזיקה רועשת במרחבים ציבוריים.",
      "״ההתקנה חסכונית באנרגיה, כאשר סוללת הטלפון יורדת ל-70% עד הבוקר, והיא משתמשת באנרגיה סולארית כדי לקיים את עצמה.״"
    ],
    "points": 959,
    "commentCount": 194,
    "retryCount": 0,
    "time": 1727676593
  },
  {
    "id": 41693087,
    "title": "פודקאסטים שנוצרים אוטומטית על ידי NotebookLM הם יעילים באופן מפתיע",
    "originLink": "https://simonwillison.net/2024/Sep/29/notebooklm-audio-overview/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41693087",
    "commentBody": "",
    "originSummary": [
      "״Google’s NotebookLM הציגה תכונה חדשה בשם Audio Overview, אשר מייצרת פודקאסטים מותאמים אישית באמצעות מנחים מבוססי AI לדון בתוכן המסופק.״",
      "בהפעלת Gemini 1.5 Pro LLM ובשיפור של SoundStorm מבית Google Research, פודקאסטים אלו בני עשר דקות כוללים דיאלוגים טבעיים ושיחות אודיו משכנעות.",
      "״התכונה הודגמה בכנס Google I/O, ודמויות בולטות כמו תומאס וולף וג'יידן גלר חקרו את יכולותיה ואת המנגנונים הפנימיים שלה, וחשפו תובנות על הנדסת פקודות ויצירת סקריפטים.״"
    ],
    "commentSummary": [
      "פודקאסטים שנוצרו על ידי AI של NotebookLM מספקים דרך חדשנית לצרוך מידע, עם רמות טכניות מתכווננות כדי להתאים לבסיסי ידע שונים.",
      "מבקרים טוענים שהתוכן המיוצר על ידי בינה מלאכותית יכול להרגיש שטחי ותבניתי, וחסר את העומק והאישיות של פודקאסטים שנוצרו על ידי בני אדם.",
      "״למרות הביקורות, הטכנולוגיה מבטיחה לסכם חומרים מורכבים ולהפוך אותם לנגישים יותר, במיוחד עבור אלה שמעדיפים פורמטים של שמע.״"
    ],
    "points": 758,
    "commentCount": 389,
    "retryCount": 0,
    "time": 1727665082
  },
  {
    "id": 41690302,
    "title": "גאווין ניוסום מטיל וטו על SB 1047",
    "originLink": "https://www.gov.ca.gov/wp-content/uploads/2024/09/SB-1047-Veto-Message.pdf",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41690302",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "גאווין ניוסום, מושל קליפורניה, הטיל וטו על הצעת החוק SB 1047, שנועדה להסדיר מודלים גדולים של בינה מלאכותית, בשל חששות שהיא מתמקדת רק במודלים הגדולים והיקרים ביותר מבלי לטפל בפריסות בסיכון גבוה.",
      "מבקרים טוענים שהחוק עלול לדכא חדשנות ולפגוע באופן לא הוגן במודלים של קוד פתוח, בעוד ניוסום קורא לתקנות מבוססות ראיות וגמישות שמבטיחות בטיחות מבלי לעכב את ההתקדמות הטכנולוגית.",
      "״הווטו הצית ויכוח בין מנהיגי טכנולוגיה, תומכי בטיחות בינה מלאכותית ומחוקקים על הגישה האופטימלית לרגולציה של בינה מלאכותית.״"
    ],
    "points": 698,
    "commentCount": 409,
    "retryCount": 0,
    "time": 1727642612
  },
  {
    "id": 41697032,
    "title": "יוקומבינטור החליפה יוקרה בצמיחה",
    "originLink": "https://unfashionable.blog/p/yc/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41697032",
    "commentBody": "",
    "originSummary": [
      "״Y Combinator (YC), קרן הון סיכון ומאיץ בשלבים מוקדמים מוביל, שינתה את המיקוד שלה מאקסקלוסיביות לצמיחה, מה שהוביל לירידה ביוקרתה.״",
      "סאם אלטמן אסטרטגיה להרחיב את YC על ידי קבלת יותר חברות דיללה את המוניטין שלה, בדומה לאופן שבו הרווארד שומרת על מעמדה באמצעות בלעדיות.",
      "״דוגמאות אחרונות, כמו מימון PearAI, שיבוט של עורך קוד מבוסס בינה מלאכותית, מצביעות על כך ש-YC מתפשרת על בדיקת נאותות, מה שעלול להרתיע סטארטאפים חדשניים מלהגיש בקשה בעתיד.״"
    ],
    "commentSummary": [
      "י קומבינטור (YC) עברה ממעמד של מאיץ סטארטאפים ידוע להתמקדות רבה יותר בצמיחה, מה שמעורר חששות לגבי איכותה.",
      "״בוגר YC לשעבר ציין כי YC כיום דומה לחברת הון סיכון (VC), תוך הדגשת רעיונות עם פוטנציאל תשואה גבוה, כפי שניתן לראות במיילי דחייה המתמקדים באסטרטגיית מוצר ויכולת גידול.״",
      "הבוגר גם הצביע על המגמה של השקעות מונעות הייפ, שבה יצירת התלהבות יכולה להבטיח מימון משמעותי, אפילו לחברות עם תוכן מפוקפק, מה שמעורר ויכוחים על כך שהגישה החדשה של YC מערערת את המשימה המקורית שלה לתמוך במייסדים נלהבים."
    ],
    "points": 423,
    "commentCount": 201,
    "retryCount": 0,
    "time": 1727704083
  },
  {
    "id": 41691577,
    "title": "Visual Studio Code נועד להתפצל (2022)",
    "originLink": "https://ghuntley.com/fracture/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41691577",
    "commentBody": "",
    "originSummary": [
      "Visual Studio Code, למרות שהוא קוד פתוח, מכיל רכיבים קנייניים שמעמידים סיכונים משפטיים למשתמשים שסוטים מהשימוש המיועד של מיקרוסופט.",
      "פורקים בקוד פתוח כמו VSCodium ו-OpenVSCodeServer חסרים גישה לשוק של מיקרוסופט ומתמודדים עם אתגרים משפטיים, מה שמדגיש את הקשיים בהצעת שירותים דומים ללא השלכות משפטיות.",
      "האסטרטגיה של מיקרוסופט במעבר ממוצרים לשירותים, כפי שמודגם על ידי GitHub Codespaces, מובילה לאקוסיסטם סגור יותר, מה שמקשה על פרויקטים בקוד פתוח להתחרות."
    ],
    "commentSummary": [
      "Visual Studio Code (VSCode) מתמודד עם ביקורת על האקוסיסטם החלש שלו ועל בעיות אבטחה, כולל הרחבות שאינן מבודדות וגישה לא מאובטחת למאגרי קוד מרוחקים.",
      "משתמשים מביעים חששות לגבי ההרחבות הקנייניות של מיקרוסופט, שאינן תואמות להפצות צד שלישי של VSCode, מה שמגביל את השימוש בקוד פתוח.",
      "״למרות הבעיות הללו, משתמשים רבים עדיין מעריכים את התכונות של VSCode, אם כי הספקנות לגבי הכוונות ארוכות הטווח של מיקרוסופט נמשכת.״"
    ],
    "points": 358,
    "commentCount": 293,
    "retryCount": 0,
    "time": 1727650534
  },
  {
    "id": 41690087,
    "title": "״על מה אתה עובד (ספטמבר 2024)?״",
    "originLink": "https://news.ycombinator.com/item?id=41690087",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41690087",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "״משתמש שיתף את חווייתו בלימוד ריתוך ובניית מבנה פטרייה ענק לפסטיבל מוזיקה, תוך הדגשת תהליך היצירה והשמחה לראות אנשים מתקשרים איתו.״",
      "משתמש נוסף דן בתסכול שלו מהעלויות הגבוהות של DocuSign, מה שהוביל אותו לפתח פלטפורמה חלופית בשם GoodSign, אשר גובה תשלום עבור כל מסמך שנשלח במקום לדרוש מנוי.",
      "״זוג שיתף את מסעם בפתיחת חנות ספרים חדשה בקהילתם, תוך פירוט האתגרים וההתרגשות שבהקמת החנות וחיבורה למערכת נקודת המכירה שלהם.״"
    ],
    "points": 315,
    "commentCount": 876,
    "retryCount": 0,
    "time": 1727641000
  },
  {
    "id": 41691530,
    "title": "״קריס קריסטופרסון נפטר״",
    "originLink": "https://www.rollingstone.com/music/music-country/kris-kristofferson-dead-1107074/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41691530",
    "commentBody": "",
    "originSummary": [
      "״קריס קריסטופרסון, הפזמונאי והשחקן המשפיע, הלך לעולמו בגיל 88, ידוע בזכות להיטים כמו \"Help Me Make It Through the Night\" ו-\"Me and Bobby McGee\".״",
      "הוא היה דמות מרכזית בתנועת הקאנטרי \"הפורע חוק\" וגם הייתה לו קריירה קולנועית מצליחה, כולל תפקידים ב\"כוכב נולד\" ו\"פט גארט ובילי הנער\".",
      "״המורשת של קריסטופרסון כוללת את תרומותיו למוזיקה ולקולנוע, את הקמת הסופרגרופ ה\"היייווימן\", ואת השפעתו המתמשכת למרות המאבק במחלת ליים בשלב מאוחר יותר בחייו.״"
    ],
    "commentSummary": [
      "״קריס קריסטופרסון, שחקן זוכה פרס גלובוס הזהב, כותב שירים ואיש רנסאנס אמיתי, הלך לעולמו.״",
      "הוא היה ידוע בקריירה המגוונת שלו, שכללה להיות מתאגרף, חוקר רודס, סופר, ותיק צבא ארה\"ב, טייס, ולשעבר שרת בחברת תקליטים.",
      "״קריסטופרסון זכור בחיבה על כתיבת השיר האיקוני \"Me and Bobby McGee\" ותפקידיו הזכורים השונים.״"
    ],
    "points": 209,
    "commentCount": 48,
    "retryCount": 0,
    "time": 1727650166
  },
  {
    "id": 41694283,
    "title": "הצוות של Arch Linux עובד כעת ישירות עם Valve",
    "originLink": "https://www.tomshardware.com/software/linux/the-arch-linux-team-is-now-working-directly-with-valve-steamos-and-arch-should-both-benefit-greatly",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41694283",
    "commentBody": "",
    "originSummary": [
      "״צוות Arch Linux משתף פעולה עם Valve, שמשתמשת ב-Arch Linux עבור SteamOS 3 של ה-Steam Deck שלה, כדי לשפר הן את Arch והן את SteamOS.״",
      "Valve מספקת תשתית שירות בנייה ומתחם חתימה מאובטח, מה שמטפל באתגרים משמעותיים עבור Arch Linux ומשפר את הפצתה.",
      "״שיתוף פעולה זה מדגיש את מחויבותה של Valve לקהילת התוכנה החופשית והקוד הפתוח (FOSS), מה שעשוי להוביל לאבטחה טובה יותר, שחרורים מובנים יותר עבור Arch Linux, וביצועי משחק משופרים ב-SteamOS 3.״"
    ],
    "commentSummary": [
      "״צוות Arch Linux משתף פעולה עם Valve, ככל הנראה בשל אופיו הקליל של Arch ומודל השחרור המתגלגל שלו, אשר אידיאלי למשחקים עם מינימום עומס ביצועים.״",
      "Valve מעדיפה את Arch על פני הפצות אחרות כמו Debian, Ubuntu, או Fedora בגלל העדכונים המהירים של Arch, השינויים המינימליים והסטטוס הלא-רווחי שלה.",
      "שיתוף פעולה זה נועד לשפר את האבטחה וההפצות המובנות של Arch, תוך התאמה לצורך של Valve במערכת גמישה ומעודכנת עבור ה-Steam Deck, למרות החששות לגבי יציבות מודל ההפצה המתגלגלת עבור מערכות ייצור."
    ],
    "points": 169,
    "commentCount": 89,
    "retryCount": 0,
    "time": 1727679367
  },
  {
    "id": 41691943,
    "title": "האם חברות בינה מלאכותית עובדות?",
    "originLink": "https://benn.substack.com/p/do-ai-companies-work",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41691943",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "חברות בינה מלאכותית חוות פרץ של חדשנות, כאשר ההצלחה תלויה בשימור כישרונות, קשרים עסקיים ומימון.",
      "יחס ההחזר על ההשקעה (ROI) בהוצאות על בינה מלאכותית נמוך כרגע, כאשר יישומים נפוצים כמו צ'אטבוטים וכלי פיתוח אינם מניבים הכנסות משמעותיות.",
      "״שוק הבינה המלאכותית תחרותי מאוד, כאשר הן חברות גדולות והן חברות קטנות שואפות לשלוט בו, והרווחיות העתידית של הבינה המלאכותית נותרת בלתי ודאית.״"
    ],
    "points": 159,
    "commentCount": 153,
    "retryCount": 0,
    "time": 1727653497
  },
  {
    "id": 41698361,
    "title": "מודלים של מייקאפ נוזלי: סדרת המודלים הראשונה שלנו של בינה מלאכותית יוצרת",
    "originLink": "https://www.liquid.ai/liquid-foundation-models",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41698361",
    "commentBody": "",
    "originSummary": [
      "ליקוויד AI הציגה את דגמי היסוד הנוזליים (LFMs), דור חדש של דגמי AI גנרטיביים המציעים ביצועים מתקדמים עם טביעת זיכרון קטנה יותר והסקה יעילה יותר.",
      "״מודלים של LFM זמינים בקטגוריות של 1B, 3B, ו-40B פרמטרים, מותאמים לחומרה ויישומים שונים, כולל וידאו, אודיו, טקסט ונתוני סדרות זמן.״",
      "״מודלים אלה עולים בביצועיהם על מודלים בגודל דומה במבחנים, מתאימים לתעשיות מגוונות, ויהיו זמינים בפלטפורמות מרובות, עם אירוע השקת מוצר המתוכנן ל-23 באוקטובר 2024, ב-MIT Kresge, קיימברידג', מסצ'וסטס.״"
    ],
    "commentSummary": [
      "מודלים של Liquid Foundation שחררו את סדרת המודלים הראשונה שלהם של בינה מלאכותית גנרטיבית, מה שגרם לדיון משמעותי בקהילת הטכנולוגיה.",
      "מבקרים טוענים שהמודלים הם קוד סגור וזמינים רק דרך API, מה שמגביל את הפוטנציאל שלהם בהשוואה למודלים פתוחים כמו GPT-4 ו-Claude 3.5.",
      "״השחרור היה שנוי במחלוקת בשל תפיסת מדידת ביצועים סלקטיבית, שהחריגה דגמים תחרותיים כמו Qwen2.5, מה שהעלה חששות לגבי שקיפות והגינות.״"
    ],
    "points": 155,
    "commentCount": 121,
    "retryCount": 0,
    "time": 1727710410
  },
  {
    "id": 41690701,
    "title": "סינקטינג: סנכרון קבצים רציף בקוד פתוח עם דגש על פרטיות",
    "originLink": "https://github.com/syncthing/syncthing",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41690701",
    "commentBody": "",
    "originSummary": [
      "סינקטינג הוא תוכנית סינכרון קבצים רציפה שנועדה לסנכרן קבצים בין מחשבים מרובים, תוך מתן עדיפות לבטיחות הנתונים, אבטחה וידידותיות למשתמש.",
      "זה תומך בפלטפורמות שונות, כולל Windows, Mac, Linux ו-Docker, עם יישומי GUI זמינים לנוחות השימוש.",
      "מהגרסה 0.10.15, קבצי הבינארי של Syncthing חתומים ב-GPG, מה שמבטיח אותנטיות וביטחון, עם תיעוד מפורט וקוד מקור הזמינים תחת רישיון MPLv2."
    ],
    "commentSummary": [
      "סינקטינג הוא כלי קוד פתוח לסנכרון קבצים מתמשך שמעדיף פרטיות ואבטחה.",
      "״משתמשים דיווחו על בעיות עם קבצים מתנגשים וסנכרון מערכי נתונים גדולים, אך רבים מוצאים אותו אמין מאוד לשימוש כללי על פני פלטפורמות מרובות.״",
      "סינקטינג תומך בהעברות עמית לעמית ותיקיות מוצפנות, מה שהופך אותו לבחירה פופולרית בקרב חובבי טכנולוגיה לסנכרון קבצים מאובטח ויעיל."
    ],
    "points": 151,
    "commentCount": 59,
    "retryCount": 0,
    "time": 1727644683
  },
  {
    "id": 41695025,
    "title": "גרסה 7.1 של FFmpeg: המון קודקים",
    "originLink": "https://jbkempf.com/blog/2024/ffmpeg-7.1.0/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41695025",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "FFmpeg 7.1 שוחרר, והוא כולל מספר משמעותי של קודקים חדשים ויותר מ-2700 התחייבויות, מה שמעיד על בריאות פרויקט חזקה.",
      "משתמשים דנים במורכבות השימוש ב-FFmpeg, מדגישים את היתרונות והחסרונות של שימוש בכלים כמו ChatGPT ליצירת פקודות ואת החשיבות של הבנת האפשרויות של FFmpeg.",
      "ההוצאה כוללת דיונים על קידוד GPU לעומת CPU, היתרונות של Vulkan API לגישה לחומרה, וביצועי קודקים שונים כמו HEVC ו-AV1."
    ],
    "points": 148,
    "commentCount": 45,
    "retryCount": 0,
    "time": 1727687137
  },
  {
    "id": 41695840,
    "title": "Screenpipe: הקלטת מסך ומיקרופון מקומית 24/7 באמצעות AI",
    "originLink": "https://github.com/mediar-ai/screenpipe",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41695840",
    "commentBody": "",
    "originSummary": [
      "״סקרינפייפ שחררה את גרסה 0 של התיעוד שלה והציגה מערכת תוספים בשם \"פייפ\" ליצירה, שיתוף והתקנה של תוספים ישירות מממשק האפליקציה.״",
      "״תכונות חדשות כוללות קלט/פלט אודיו מושלם ב-Windows, Linux, ו-MacOS, לכידת מסכים מרובים, ותמיכה ב-Whisper Distil large v3 להמרת דיבור לטקסט (STT).״",
      "Screenpipe מציעה כעת OCR מקורי עבור Apple ו-Windows, אפליקציית שולחן עבודה ל-Linux, ותכונת הטמעת וידאו שבה AI מספק קישורים להקלטות וידאו בצ'אט."
    ],
    "commentSummary": [
      "Screenpipe הוא כלי קוד פתוח חדש להקלטת מסך ומיקרופון מקומיים 24/7, המעורר חששות משמעותיים לגבי פרטיות.",
      "משתמשים ופרשנים מדגישים את הפוטנציאל לדליפות מידע רגיש ואת הצורך בהסכמה, במיוחד במקומות עבודה ובאזורים עם חוקים מחמירים בנושא פרטיות.",
      "״הטבע העצמאי של הכלי ושליטת המשתמש נחשבים כיתרונות על פני פתרונות קנייניים דומים, אך ההשלכות האתיות והמשפטיות נותרות נושא לדיון סוער.״"
    ],
    "points": 135,
    "commentCount": 82,
    "retryCount": 0,
    "time": 1727694936
  },
  {
    "id": 41692922,
    "title": "החבילה האולטימטיבית של גופני מחשב ישנים",
    "originLink": "https://int10h.org/oldschool-pc-fonts/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41692922",
    "commentBody": "",
    "originSummary": [
      "״חבילת הפונטים האולטימטיבית למחשבי PC ישנים (גרסה 2.2) היא האוסף הגדול ביותר של פונטים קלאסיים במצב טקסט, מערכת וביוס ממחשבי IBM ותואמיהם מתקופת DOS.״",
      "״החבילה כוללת גרסאות מחודשות של TrueType (.ttf), bitmap (.fon), ו-web (.woff) עבור למעלה מ-200 מערכי תווים, עם שחזורים מדויקים ברמת הפיקסל ושיפורי Unicode רב-לשוניים.״",
      "האוסף חופשי תחת רישיון CC BY-SA 4.0, כאשר הגרסה האחרונה (v2.2) שוחררה ב-21 בנובמבר 2020."
    ],
    "commentSummary": [
      "״חבילת הפונטים האולטימטיבית למחשבים ישנים כוללת פונטים קלאסיים של קונסולות, כמו ה-GPLv2 Solarize 12x29 PSF מ-Sun SPARCstation, אשר שימשו בפיתוח המוקדם של לינוקס.״",
      "״החבילה תומכת במערכות תווים מרובות, כולל לטינית, יוונית, קירילית ופיניין, והמשתמשים נוסטלגיים לגבי הגופנים האהובים עליהם כמו קורונה.״",
      "״יש דיון על הרצון לפונטים אלה בפורמט .psf עבור קונסולות לינוקס, במיוחד עבור תצוגות 4K, ודיון על מצב זכויות היוצרים של פונטים ביטמפים לעומת פונטים וקטוריים.״"
    ],
    "points": 122,
    "commentCount": 15,
    "retryCount": 0,
    "time": 1727663206
  },
  {
    "id": 41696434,
    "title": "מחקר חדש על הרדמה ומיקרוטובולים מספק רמזים חדשים לגבי תודעה",
    "originLink": "https://www.sciencedaily.com/releases/2024/09/240905120923.htm",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41696434",
    "commentBody": "",
    "originSummary": [
      "מחקר חדש של פרופסור מייק וויסט מצוותו במכללת וולסלי מציע כי הרדמה פועלת על ידי קשירה למיקרוטובולים בתוך נוירונים, תומך במודל הקוונטי של התודעה.",
      "״מחקר זה עשוי לשפר את הבנתנו לגבי הרדמה, תודעה אצל חולים בתרדמת ובעלי חיים, והשפעות של תרופות ומחלות על המוח.״",
      "״המחקר, שנכתב במשותף על ידי מספר סטודנטים מוולסלי, פורסם ב-eNeuro ב-1 בספטמבר 2024.״"
    ],
    "commentSummary": [
      "מחקר חדש מצביע על קשר פוטנציאלי בין הרדמה, מיקרוטובולים ותודעה, התומך במודל הקוונטי של התודעה.",
      "״המחקר ציין כי חולדות שקיבלו תרופה הקושרת מיקרוטובולים לקח להן יותר זמן לאבד את ההכרה תחת הרדמה, מה שמרמז על מעורבות המיקרוטובולים בתודעה.״",
      "מבקרים טוענים שהממצאים הם ספקולטיביים ואינם שוללים באופן מוחלט מנגנונים אחרים, ומדגישים את היעדר הראיות החזקות לתיאוריית התודעה הקוונטית."
    ],
    "points": 116,
    "commentCount": 129,
    "retryCount": 0,
    "time": 1727699686
  }
]
