[
  {
    "id": 37905638,
    "title": "밴드캠프 직원의 약 절반이 해고되었습니다.",
    "originLink": "https://www.theverge.com/2023/10/16/23919551/bandcamp-layoffs-epic-songtradr",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37905638",
    "commentBody": "",
    "originSummary": [
      "인디 음악 플랫폼인 밴드캠프는 에픽게임즈에서 음악 저작권 마켓플레이스인 송트레이더를 인수한 후 직원의 절반 가량을 해고했습니다.",
      "이번 해고는 이전 소유주였던 에픽게임즈가 앞서 전체 직원의 16%를 해고한 데 이은 것으로, 회사 내 구조조정이 계속되고 있음을 시사합니다.",
      "송트레이드는 밴드캠프 직원의 50%에게 일자리를 제공했지만, 노조를 인정할지 여부는 아직 명확히 밝히지 않았습니다. 해고된 직원들은 퇴직금을 받을 수 있습니다."
    ],
    "commentSummary": [
      "음악 플랫폼인 밴드캠프가 전체 직원의 약 절반에 해당하는 대규모 해고를 발표했습니다. 이 결정의 원인은 아직 구체적으로 밝혀지지 않았으며, 재정적인 측면, 오래된 사용자 인터페이스, 독립 아티스트에 대한 홍보 부족 등이 잠재적인 요인으로 지목되고 있습니다.",
      "송트레이더의 회사 인수와 이번 인수가 밴드캠프의 미래에 어떤 영향을 미칠지 여부에 대해서도 논의 중입니다.",
      "또한 Spotify와 같은 스트리밍 플랫폼의 장단점, 특히 결제 구조와 대체 플랫폼 및 아티스트 지원 방법에 대한 옵션에 대해서도 설명합니다."
    ],
    "points": 541,
    "commentCount": 508,
    "retryCount": 0,
    "time": 1697486486
  },
  {
    "id": 37904518,
    "title": "LinkedIn은 거의 700명의 직원을 해고합니다.",
    "originLink": "https://www.npr.org/2023/10/16/1206158638/linkedin-layoffs",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37904518",
    "commentBody": "",
    "originSummary": [
      "Microsoft의 자회사인 LinkedIn은 전사적인 구조 조정의 일환으로 약 700명의 직원을 해고합니다.",
      "이번 결정은 지난 5월 매출 성장과 회원 수 증가에도 불구하고 716명을 해고한다는 발표에 이은 후속 조치입니다.",
      "이 회사는 이러한 해고가 고객 행동의 변화와 매출 성장 둔화 때문이라고 설명하며, 이는 Amazon, Google, Meta에서도 비슷한 규모의 감원을 단행한 기술 업계의 광범위한 추세를 반영한다고 밝혔습니다."
    ],
    "commentSummary": [
      "LinkedIn은 관련 없는 콘텐츠, 정치적 압력, 부적절한 댓글에 대한 우려로 사용자들로부터 비난을 받고 있으며, 이러한 문제에 대한 방향과 대처에 실망감을 안겨주고 있습니다.",
      "사용자들은 개인정보 보호 문제, 과도한 모집자 스팸, 콘텐츠 품질 저하에 대한 우려를 표명했습니다.",
      "비판에도 불구하고 일부 사람들은 여전히 구직 및 네트워킹과 같은 전문적인 목적을 위해 이 플랫폼이 유용하다고 생각합니다."
    ],
    "points": 355,
    "commentCount": 302,
    "retryCount": 0,
    "time": 1697482786
  },
  {
    "id": 37905251,
    "title": "라운드 업 제초제 성분이 유행성 만성 신장 질환과 관련이 있습니다.",
    "originLink": "https://phys.org/news/2023-10-roundup-herbicide-ingredient-epidemic-chronic.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37905251",
    "commentBody": "",
    "originSummary": [
      "듀크 대학교 연구진의 연구에 따르면 라운드업의 활성 성분인 글리포세이트가 스리랑카 농촌 지역의 만성 신장 질환과 상당한 관련이 있는 것으로 나타났습니다.",
      "이 연구에 따르면 글리포세이트는 경수에서 특정 미량 금속과 복합체를 형성하여 장기간 잔류할 수 있는 것으로 나타났습니다. 또한 지역사회의 식수에서 더 높은 수준의 유해한 불소와 바나듐이 발견되었습니다.",
      "이러한 결과는 글리포세이트의 잠재적인 심각한 건강 위험을 나타내며, 다른 오염 물질의 잠재적 영향에 대한 면밀한 조사의 필요성을 강조합니다."
    ],
    "commentSummary": [
      "이 대화에는 글리포세이트(라운드업 제초제의 주요 성분)의 잠재적인 건강 영향, 농업에 대한 기여도, 안전 및 관리에 대한 논쟁 등 다양한 측면이 포함되어 있습니다.",
      "유전자 변형 작물의 영향, 수질 오염에 대한 우려, 기업 이해관계의 영향, 아스트로터핑 또는 관점 조작 의혹 등이 부수적인 주제로 논의되었습니다.",
      "포괄적인 논의는 글리포세이트 사용을 둘러싼 복잡한 트레이드오프와 측면을 강조하며 연구 및 규제 강화의 필요성을 시사합니다."
    ],
    "points": 344,
    "commentCount": 245,
    "retryCount": 0,
    "time": 1697485268
  },
  {
    "id": 37901120,
    "title": ": 래디컬(YC W23) - 자율 고고도 태양광 항공기",
    "originLink": "https://news.ycombinator.com/item?id=37901120",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37901120",
    "commentBody": "",
    "originSummary": [
      "제임스와 시리엘이 공동 설립한 래디컬은 성층권에서 연속 비행이 가능한 태양광 자율 비행기를 개발했으며, 이미 24시간 이상 시제품을 테스트하고 있습니다.",
      "이 항공기는 배터리로 작동하며 날개에 부착된 태양 전지를 활용하고 이미징, 감지 및 통신과 같은 다양한 작업을 수행하도록 설계되었습니다. 구름과 항공 교통을 피하기 위해 높은 고도에서 운항합니다.",
      "래디컬은 쉽게 구할 수 있는 부품을 활용하고 설계 프로세스를 신속하게 반복함으로써 시장에서 비용 효율적인 솔루션을 제공하고자 합니다. 이들의 향후 목표는 내년에 본격적인 항공기 테스트를 하는 것입니다."
    ],
    "commentSummary": [
      "항공우주 공학 및 Amazon Prime Air 분야에서 경력을 쌓은 창업자들이 설립한 회사인 Radical은 성층권 비행을 위한 태양열 드론을 개발 중입니다.",
      "비용 효율성을 위해 기성 부품을 사용한 이 드론은 이미징, 감지 및 통신 목적으로 설계되었으며 24시간 논스톱 비행을 완료했습니다.",
      "이 회사는 현재 날개 길이 110피트의 본격적인 항공기 개발을 추진하고 있으며, 기술적 세부 사항, 잠재적 응용 분야, 감시와 관련된 윤리적 영향에 대한 논의를 촉발하고 있습니다."
    ],
    "points": 339,
    "commentCount": 189,
    "retryCount": 0,
    "time": 1697469837
  },
  {
    "id": 37908268,
    "title": "디트로이트는 토지 가치에 세금을 부과하는 최초의 미국 대도시가 되고자 합니다.",
    "originLink": "https://www.economist.com/united-states/2023/10/05/detroit-wants-to-be-the-first-big-american-city-to-tax-land-value",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37908268",
    "commentBody": "",
    "originSummary": [
      "디트로이트는 미국 주요 도시 중 최초로 토지 가치세를 도입하여 황폐화를 방지하고 개발을 촉진하는 것을 목표로 하고 있습니다.",
      "도심의 일부 회복에도 불구하고 디트로이트의 많은 지역은 여전히 공터와 버려진 건물로 몸살을 앓고 있습니다.",
      "제안된 토지 가치세는 토지 소유자가 자신의 부동산을 개발하거나 개발할 의향이 있는 사람에게 매각하도록 장려하여 잠재적으로 황폐화를 줄이고 도시에 대한 추가 투자를 촉진하는 것을 목표로 합니다."
    ],
    "commentSummary": [
      "이 대화는 토지 가치세(LVT)의 시행과 부동산 투기 억제 및 저개발 지역 개발 촉진과 같은 잠재적 효과에 초점을 맞추고 있습니다.",
      "회의론자들은 토지 가치 평가의 어려움과 정부 당국의 오용 가능성에 대해 우려를 표명합니다.",
      "토론의 추가 주제에는 재산세, 저렴한 주택, 도시 밀집화, 부동산 소유주에 대한 잠재적 영향 등이 포함됩니다."
    ],
    "points": 320,
    "commentCount": 570,
    "retryCount": 0,
    "time": 1697500284
  },
  {
    "id": 37901902,
    "title": "MemGPT - 무제한 컨텍스트를 위한 자체 편집 메모리를 갖춘 LLM",
    "originLink": "https://github.com/cpacker/MemGPT",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37901902",
    "commentBody": "",
    "originSummary": [
      "MemGPT는 확장된 컨텍스트를 위해 자체 편집 메모리를 사용하는 오픈 소스 챗봇으로, SQL 데이터베이스 및 로컬 파일과 상호 작용할 수 있습니다.",
      "고급 GPT-4 모델을 사용하며 Discord와 같은 플랫폼에서 설정하거나 로컬에서 실행하여 사용자가 데이터를 로드하고 쿼리할 수 있습니다.",
      "이 프로젝트는 적극적인 지원을 받고 있으며 사용자 피드백과 기여를 장려하여 반응적이고 발전적인 시스템을 제안하고 있습니다."
    ],
    "commentSummary": [
      "MemGPT의 저자들은 무제한 컨텍스트를 위한 자체 편집 메모리로 구현된 모델을 발표하고, Hacker News에서 토론에 참여하며 실험을 위한 Discord 봇과 오픈 소스 코드를 제공합니다.",
      "담론은 챗봇의 재귀적 요약, 언어 모델의 컨텍스트 창 한계, 메모리 관리 기술, 길이를 줄이기 위한 평균 벡터 사용, 연속 챗봇 생성의 미래 가능성 등을 중심으로 진행됩니다.",
      "명시적 메모리 관리와 암시적 메모리 관리, 외부 컨텍스트, 계층적 메모리 시스템, 여러 에이전트의 통합에 대한 논의가 이어졌으며, 저자들은 접근 방식의 컨텍스트 길이 제한을 극복하기 위한 피드백을 적극적으로 수용했습니다."
    ],
    "points": 309,
    "commentCount": 76,
    "retryCount": 0,
    "time": 1697472476
  },
  {
    "id": 37898999,
    "title": "Go 1.22에서 개선된 HTTP 서버 라우팅",
    "originLink": "https://eli.thegreenplace.net/2023/better-http-server-routing-in-go-122/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37898999",
    "commentBody": "",
    "originSummary": [
      "곧 출시될 Go 1.22 버전에서는 기본 HTTP 서빙 멀티플렉서에 상당한 개선 사항이 도입되어 고급 패턴 매칭 기능을 제공할 예정입니다.",
      "저자는 이 새로운 멀티플렉서를 어떻게 사용할 수 있는지 설명하면서 그 기능을 고릴라/mux와 같은 타사 라이브러리와 비교하여 잠재적으로 이를 대체할 수 있음을 암시합니다.",
      "Go 1.22의 향상된 기능은 라우터 패키지에 대한 추천에 영향을 미쳐 Go 프로그래밍 커뮤니티에 긍정적인 변화를 가져올 것으로 기대됩니다."
    ],
    "commentSummary": [
      "이 토론에서는 다중 경로 일치 적용을 위한 패닉 사용, 컴파일 오류와 패닉에 대한 대조적인 주장 등 Go 프로그래밍 언어에서 HTTP 서버 라우팅을 둘러싼 다양한 주제를 다룹니다.",
      "이 대화에서는 고릴라/mux와 같은 특정 프로젝트, 표준 라이브러리의 잠재적 수정 사항, 웹 프레임워크의 컨트롤러 및 라우트에 대한 디자인 선택에 대해 논의합니다.",
      "더 넓은 주제는 명확성, 예측 가능성, 장단점, 웹 개발에서 다양한 방법론과 기술을 활용할 때의 장단점에 관한 것입니다."
    ],
    "points": 307,
    "commentCount": 219,
    "retryCount": 0,
    "time": 1697459894
  },
  {
    "id": 37903890,
    "title": "트위터를 탈퇴해도 NPR의 트래픽에는 아무런 영향이 없었습니다.",
    "originLink": "https://pluralistic.net/2023/10/14/freedom-of-reach/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37903890",
    "commentBody": "",
    "originSummary": [
      "이 기사에서는 디지털 플랫폼의 '엔시트화' 문제에 대해 자세히 설명하며 사용자, 퍼블리셔, 광고주에게 미치는 악영향을 지적합니다.",
      "트위터에서 엘론 머스크의 행동을 예로 들며 이러한 문제를 관리하기 위한 규제 방법을 옹호합니다.",
      "이 글은 경쟁을 촉진하고 플랫폼의 과도한 권력 획득을 막기 위해 '퇴출권' 규제가 필요하다는 점을 강조합니다."
    ],
    "commentSummary": [
      "이 토론에서는 트위터가 NPR의 웹 트래픽에 미치는 영향과 그에 따른 트위터의 저널리스트에 대한 가치에 대해 집중적으로 논의했습니다. 또한 플랫폼의 에코 챔버와 허위 정보에 대한 우려도 다룹니다.",
      "트위터의 문화적 관련성 감소, 인증 시스템의 장단점, 엘론 머스크와 트위터의 연관성 등에 대한 논의가 이루어지고 있습니다.",
      "또한 NPR을 국영 미디어로 분류하는 것과 정부 후원으로 인해 발생할 수 있는 편향성에 대한 논쟁도 있습니다."
    ],
    "points": 304,
    "commentCount": 180,
    "retryCount": 0,
    "time": 1697480302
  },
  {
    "id": 37903172,
    "title": "\"오늘 Bandcamp의 절반 정도가 해고되었습니다.\"",
    "originLink": "https://twitter.com/modernistwitch/status/1713962311579234428",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37903172",
    "commentBody": "",
    "originSummary": [
      "이 회사는 최근 상당한 규모의 정리해고를 단행하여 수많은 직원에게 영향을 미쳤습니다.",
      "정리해고는 편집 및 지원 직원을 포함한 다양한 부서에 영향을 미쳤습니다.",
      "해고된 사람들 중에는 편집 동료 두 명과 지원 직원 대다수가 포함되어 있습니다."
    ],
    "commentSummary": [
      "밴드캠프 인력의 약 50%가 해고되었습니다."
    ],
    "points": 299,
    "commentCount": 1,
    "retryCount": 0,
    "time": 1697477133
  },
  {
    "id": 37897916,
    "title": "FreeTube - 비공개 YouTube 클라이언트",
    "originLink": "https://github.com/FreeTubeApp/FreeTube",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37897916",
    "commentBody": "",
    "originSummary": [
      "FreeTube는 광고를 차단하고 쿠키와 JavaScript를 통한 추적을 방지하며 구독 및 기록을 기기에 로컬로 저장하는 개인 정보 보호에 중점을 둔 오픈 소스 데스크톱 YouTube 플레이어입니다.",
      "여기에는 두 개의 추출기 API, 구독 관리, 테마 지원, 브라우저 확장 프로그램 호환성, 키보드 단축키와 같은 기능이 포함되어 있습니다. Windows, Mac, Linux 사용자가 액세스할 수 있습니다.",
      "FreeTube는 사용자 기여를 초대하고, 언어 현지화 지원, 기부 옵션을 제공하며, GNU Affero 일반 공중 사용 허가서에 따라 라이선스가 부여됩니다."
    ],
    "commentSummary": [
      "이 담론에서는 YouTube의 광고 차단과 이로 인한 콘텐츠 제작자의 피해에 대해 집중적으로 다루며, 광고 차단이 불법 복제의 한 형태인지 아니면 허용되는 관행인지에 대해 논의합니다.",
      "이 대화에서는 YouTube의 수익 창출 방식과 YouTube 프리미엄의 한계에 대한 불만을 전달합니다. 또한 광고의 침입성, 개인 정보 보호 문제를 살펴보고 광고 차단에 대한 윤리에 대해 토론합니다.",
      "범용 컴퓨팅에 대한 주제와 국가 헌법에 포함될 수 있는 가능성에 대해 논의합니다. 표현의 자유, 플랫폼에 대한 의존성, 광고 차단기 사용과 같은 측면이 논의되며, 암호화폐의 잠재적 문제를 포함한 수익화 및 대체 수익원도 논의됩니다."
    ],
    "points": 299,
    "commentCount": 388,
    "retryCount": 0,
    "time": 1697452817
  },
  {
    "id": 37903489,
    "title": "Stocketa - 제가 디자인하고 제작했지만 출시하지 않은 앱",
    "originLink": "https://paulstamatiou.com/stocketa/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37903489",
    "commentBody": "",
    "originSummary": [
      "저자는 사용자 지정 UI 구성 요소 사용, 주식 거래 추적과 같은 문제 관리 등 일반 투자자를 위한 포트폴리오 추적기인 Stocketa 앱을 설계하고 구축하는 과정을 공유합니다.",
      "이 앱은 디자이너와 코더로 활동한 저자의 기술을 효과적으로 활용하여 기능성과 디자인 면에서 호평을 받았습니다.",
      "결국 저자는 기술 개발에 필요한 유동성과 적응력을 고려하여 다른 프로젝트인 리와인드 AI로 방향을 전환하기로 결정했습니다."
    ],
    "commentSummary": [
      "이 글에서는 개인 프로젝트 개발, 특히 앱 개발에서 겪는 어려움에 대해 자세히 다루며 고객을 확보하는 데 겪는 어려움과 그 과정에서 겪는 좌절에 대해 언급합니다.",
      "이 책은 양보다 질에 초점을 맞춘 저자의 노력을 강조하며 개인정보 보호, 데이터 관리, 정확한 주식 시장 데이터 확보와 관련된 높은 비용에 대한 우려를 강조합니다.",
      "저자는 특히 베팅 시장 부문에서 이러한 문제를 해결하는 데 큰 관심을 보이고 있습니다."
    ],
    "points": 289,
    "commentCount": 65,
    "retryCount": 0,
    "time": 1697478404
  },
  {
    "id": 37897946,
    "title": "C는 저수준 언어가 아니다 (2018)",
    "originLink": "https://queue.acm.org/detail.cfm?id=3212479",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37897946",
    "commentBody": "",
    "originSummary": [
      "이 기사에서는 최신 프로세서를 위해 C 코드를 개선하는 과정에서 C 코드의 복잡성과 취약성이 부각되었다는 사실을 밝히며, C가 더 이상 저수준 언어가 아니라고 주장합니다.",
      "이 글에서는 효율성을 위해 C 코드를 최적화하는 데 따르는 어려움에 대해 논의하고 다양한 프로그래밍 모델과 프로세서 설계를 통해 속도를 가속화하고 캐시 일관성 프로토콜을 단순화할 수 있다고 제안합니다.",
      "C와 같은 언어로 병렬 프로그래밍을 하는 것은 어렵고 최신 하드웨어와 잘 맞지 않는다는 의견입니다."
    ],
    "commentSummary": [
      "해커 뉴스 토론에서는 메모리 관리 제어, 정수 연산 처리 안전성, 저수준 시스템 프로그래밍에서의 사용 등 C 프로그래밍 언어의 다양한 측면을 살펴봅니다.",
      "참가자들은 하드웨어 설계에서 C의 역할, 병렬 처리를 촉진하는 언어의 요구 사항, 최신 하드웨어를 효율적으로 사용할 수 있는 최신 언어의 기능에 대해 토론합니다.",
      "Rust와 같은 언어 사용, Lisp 매크로 활용, 어셈블리 언어와 상위 수준의 추상화를 결합하는 등 다양한 대안이 제안되고 있습니다. 그러나 저수준 시스템 프로그래밍에 가장 적합한 언어에 대한 만장일치의 합의는 아직 없습니다."
    ],
    "points": 287,
    "commentCount": 388,
    "retryCount": 0,
    "time": 1697453170
  },
  {
    "id": 37905601,
    "title": "실시간 다이내믹 씬 렌더링을 위한 4D 가우시안 스플래팅",
    "originLink": "https://guanjunwu.github.io/4dgs/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37905601",
    "commentBody": "",
    "originSummary": [
      "연구원들은 동적 장면의 실시간 렌더링을 위해 설계된 4D 가우시안 스플래팅(4D-GS)이라는 새로운 방법을 도입했습니다.",
      "4D-GS 방식은 효율적인 변형 필드를 사용하여 가우시안 모션과 모양 변형을 시뮬레이션하여 고해상도 실시간 렌더링을 촉진합니다.",
      "연구팀은 합성 데이터 세트를 통해 이 방법의 효율성을 입증하여 고품질의 결과를 유지했습니다."
    ],
    "commentSummary": [
      "이 문서에서는 가상 현실에서 실시간 동적 씬 렌더링에 4D 가우시안 스플래팅을 사용하는 방법에 대해 설명합니다.",
      "사용자들은 미디어 제작, 비디오 게임 등 다양한 분야에서 가우시안 스플래팅의 실질적인 의미와 렌더링 품질을 향상하는 기법에 대해 논의하고 있습니다.",
      "관련 없는 주제로 대화가 전환되기는 했지만, 중심 논의는 VR 기술에서 가우시안 스플래팅의 기술적 측면과 응용에 초점을 맞췄습니다."
    ],
    "points": 262,
    "commentCount": 58,
    "retryCount": 0,
    "time": 1697486375
  },
  {
    "id": 37907433,
    "title": "LinkedIn에서 최근 해고된 직원 중 20%가 관리자였습니다.",
    "originLink": "https://news.ycombinator.com/item?id=37907433",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37907433",
    "commentBody": "",
    "originSummary": [
      "정리해고된 직원 중 약 20%가 관리자였으며, 이는 일반적인 정리해고 비율보다 높은 수치입니다."
    ],
    "commentSummary": [
      "LinkedIn은 최근 인력의 20%를 감원하여 관리자 5명 중 1명을 감축하는 등 기술 업계의 인식에 대한 논의를 촉발시켰습니다.",
      "기술 업계에서 인도 직원의 업무 윤리와 관련된 고정관념에 대해 긍정적인 경험과 부정적인 경험, 커뮤니케이션 및 문화적 문제에 초점을 맞춘 논쟁이 계속되고 있습니다.",
      "이 외에도 회사의 평판, 중간 관리자가 겪는 어려움, 관리자 역할에 대한 기술적 전문성 부족, 과도한 회의에 대한 불만 등의 주제에 대해서도 논의했습니다."
    ],
    "points": 248,
    "commentCount": 222,
    "retryCount": 0,
    "time": 1697494601
  },
  {
    "id": 37900458,
    "title": "Invidious - YouTube의 오픈 소스 대체 프런트엔드",
    "originLink": "https://invidious.io/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37900458",
    "commentBody": "",
    "originSummary": [
      "Invidious는 사용자 개인 정보 보호를 강조하고 데이터 추적을 방지하는 YouTube의 오픈 소스 대안으로 사용됩니다.",
      "채널 구독, 재생 목록 만들기, 광고 없이 동영상 보기 등의 기능을 제공합니다.",
      "Invidious는 여러 언어를 지원하며 개발자 애플리케이션 프로그래밍 인터페이스(API)를 제공합니다."
    ],
    "commentSummary": [
      "이 토론은 광고와 알고리즘이 없는 동영상 시청을 허용하지만 높은 RAM 사용량과 시스템 충돌을 유발하는 것으로 알려진 YouTube의 오픈 소스 대안인 Invidious를 중심으로 이루어집니다.",
      "개인용 컴퓨터 기기에 대한 Google의 지배력과 우회 광고의 적법성에 대한 우려가 있습니다. 참가자들은 크리에이터를 위한 대체 수익 모델과 광고 수익에 의존하지 않고 크리에이터를 지원하는 방안에 대해서도 논의합니다.",
      "PeerTube와 같은 분산형 플랫폼은 YouTube 광고를 우회하는 대안으로 주목받고 있습니다."
    ],
    "points": 247,
    "commentCount": 123,
    "retryCount": 0,
    "time": 1697467116
  }
]
