[
  {
    "id": 37905638,
    "title": "Noin puolet Bandcampin työntekijöistä on irtisanottu",
    "originLink": "https://www.theverge.com/2023/10/16/23919551/bandcamp-layoffs-epic-songtradr",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37905638",
    "commentBody": "",
    "originSummary": [
      "Indie-musiikkialusta Bandcamp on irtisanonut noin puolet työntekijöistään sen jälkeen, kun musiikin oikeuksien markkinapaikka Songtradr on ostanut sen Epic Gamesilta.",
      "Irtisanominen tapahtuu sen jälkeen, kun Epic Games, edellinen omistaja, oli aiemmin irtisanonut 16 prosenttia työntekijöistään, mikä osoittaa, että yrityksissä tehdään jatkuvasti uudelleenjärjestelyjä.",
      "Vaikka Songtradr on tarjonnut työpaikkoja 50 prosentille Bandcampin työntekijöistä, se ei ole vielä selvittänyt, aikooko se tunnustaa heidän ammattiliittonsa. Irtisanotut työntekijät ovat oikeutettuja erorahaan."
    ],
    "commentSummary": [
      "Musiikkialusta Bandcamp on ilmoittanut merkittävistä irtisanomisista, jotka koskevat noin puolta sen työntekijöistä. Syytä tähän päätökseen ei ole vielä määritelty, ja mahdollisia tekijöitä ovat muun muassa taloudelliset näkökohdat, vanhentunut käyttöliittymä ja riippumattomien artistien riittämätön promootio.",
      "Keskustelua käydään myös siitä, että Songtradr on ottanut yhtiön haltuunsa ja siitä, miten tämä yritysosto voi vaikuttaa Bandcampin tulevaisuuteen.",
      "Teoksessa käsitellään myös Spotifyn kaltaisten suoratoistoalustojen hyviä ja huonoja puolia, erityisesti niiden maksurakennetta, sekä vaihtoehtoisia alustoja ja menetelmiä artistien tukemiseksi."
    ],
    "points": 541,
    "commentCount": 508,
    "retryCount": 0,
    "time": 1697486486
  },
  {
    "id": 37904518,
    "title": "LinkedIn irtisanoo lähes 700 työntekijää",
    "originLink": "https://www.npr.org/2023/10/16/1206158638/linkedin-layoffs",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37904518",
    "commentBody": "",
    "originSummary": [
      "Microsoftin tytäryhtiö LinkedIn irtisanoo lähes 700 työntekijää osana koko yrityksen laajuista rakenneuudistusta.",
      "Tämä päätös on seurausta aiemmasta, toukokuussa tehdystä ilmoituksesta, joka koski 716 työntekijän irtisanomista huolimatta tulojen kasvusta ja jäsenmäärän lisääntymisestä.",
      "Yhtiö selittää nämä irtisanomiset asiakaskäyttäytymisen muutoksilla ja hitaammalla tulojen kasvulla, mikä heijastaa laajempaa suuntausta teknologiateollisuudessa, jossa Amazon, Google ja Meta ovat vähentäneet henkilöstöä."
    ],
    "commentSummary": [
      "LinkedIn on joutunut käyttäjien tulituksen kohteeksi epäolennaisen sisällön, poliittisen painostuksen ja sopimattomien kommenttien vuoksi, mikä on aiheuttanut pettymyksen sen suuntaan ja näiden asioiden käsittelyyn.",
      "Käyttäjät ilmaisivat huolensa yksityisyyskysymyksistä, rekrytoijien liiallisesta roskapostista ja sisällön laadun heikkenemisestä.",
      "Kritiikistä huolimatta jotkut pitävät alustaa edelleen arvokkaana ammatillisiin tarkoituksiin, kuten työnhakuun ja verkostoitumiseen."
    ],
    "points": 355,
    "commentCount": 302,
    "retryCount": 0,
    "time": 1697482786
  },
  {
    "id": 37905251,
    "title": "Roundupin rikkakasvien torjunta-aineen ainesosa yhdistetty epidemiseen krooniseen munuaistautiin",
    "originLink": "https://phys.org/news/2023-10-roundup-herbicide-ingredient-epidemic-chronic.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37905251",
    "commentBody": "",
    "originSummary": [
      "Duken yliopiston tutkijoiden tekemä tutkimus yhdistää glyfosaatin, Roundupin vaikuttavan aineen, merkittäviin kroonisiin munuaissairauksiin Sri Lankan maaseutuyhteisöissä.",
      "Tutkimuksen mukaan glyfosaatti voi muodostaa komplekseja tiettyjen hivenmetallien kanssa kovassa vedessä, jolloin se voi säilyä pitkään. Lisäksi yhdyskuntien juomavedestä löytyi korkeampia pitoisuuksia haitallista fluoridia ja vanadiinia.",
      "Nämä havainnot osoittavat, että glyfosaatti saattaa aiheuttaa vakavan terveysriskin, ja korostavat tarvetta tutkia tarkkaan muiden epäpuhtauksien mahdollisia vaikutuksia."
    ],
    "commentSummary": [
      "Keskusteluissa käsitellään eri näkökohtia, kuten glyfosaatin (Roundup-herbisidin pääkomponentti) mahdollisia terveysvaikutuksia, sen vaikutusta maatalouteen sekä sen turvallisuudesta ja hallinnasta käytäviä keskusteluja.",
      "Muita keskustelunaiheita ovat muun muassa muuntogeenisten viljelykasvien vaikutus, huoli veden pilaantumisesta, yritysten etujen vaikutus ja epäilyt astroturfingista tai mielipiteiden manipuloinnista.",
      "Kattavat keskustelut korostavat glyfosaatin käyttöön liittyviä monimutkaisia kompromisseja ja näkökohtia, mikä osoittaa, että tutkimusta ja sääntelyä on tehostettava."
    ],
    "points": 344,
    "commentCount": 245,
    "retryCount": 0,
    "time": 1697485268
  },
  {
    "id": 37901120,
    "title": ": Radical (YC W23) - Autonominen korkealla lentävä aurinkolentokone.",
    "originLink": "https://news.ycombinator.com/item?id=37901120",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37901120",
    "commentBody": "",
    "originSummary": [
      "Jamesin ja Cyrielin yhdessä perustama Radical on luonut autonomisen, aurinkoenergialla toimivan lentokoneen, joka kykenee jatkuvaan lentoon stratosfäärissä, ja sen prototyyppiä on testattu jo yli 24 tuntia.",
      "Ilma-alus on akkusähköinen, käyttää siipiinsä kiinnitettyjä aurinkokennoja ja on suunniteltu erilaisiin tehtäviin, kuten kuvantamiseen, havainnointiin ja televiestintään. Se toimii suurissa korkeuksissa pilvien ja lentoliikenteen välttämiseksi.",
      "Radical pyrkii tarjoamaan kustannustehokkaan ratkaisun markkinoilla hyödyntämällä helposti saatavilla olevia komponentteja ja iteroimalla suunnitteluprosessiaan nopeasti. Heidän tuleva tavoitteensa on testata täysimittaista lentokonetta ensi vuonna."
    ],
    "commentSummary": [
      "Radical-yritys, jonka perustajilla on kokemusta ilmailu- ja avaruustekniikasta ja Amazon Prime Airista, kehittää aurinkoenergialla toimivaa lennokkia, joka lentää jatkuvasti stratosfäärissä.",
      "Lennokki, jossa käytetään kustannustehokkuuden vuoksi valmiita komponentteja, on suunniteltu kuvaus-, havainto- ja tietoliikennetarkoituksiin, ja se on lentänyt 24 tuntia tauotta.",
      "Yritys on nyt siirtymässä kohti täysimittaista lentokonetta, jonka siipiväli on 110 jalkaa, mikä on herättänyt keskustelua sen teknisistä yksityiskohdista, mahdollisista sovelluksista ja valvontaan liittyvistä eettisistä vaikutuksista."
    ],
    "points": 339,
    "commentCount": 189,
    "retryCount": 0,
    "time": 1697469837
  },
  {
    "id": 37908268,
    "title": "Detroit haluaa olla ensimmäinen amerikkalainen suurkaupunki, joka verottaa maan arvoa",
    "originLink": "https://www.economist.com/united-states/2023/10/05/detroit-wants-to-be-the-first-big-american-city-to-tax-land-value",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37908268",
    "commentBody": "",
    "originSummary": [
      "Detroit pyrkii olemaan ensimmäinen suuri yhdysvaltalainen kaupunki, joka ottaa käyttöön maanarvoveron torjuakseen huono-osaisuutta ja edistääkseen kehitystä.",
      "Suuria osia Detroitista vaivaavat edelleen tyhjät tontit ja ränsistyneet rakenteet, vaikka kaupungin keskusta onkin elpynyt jonkin verran.",
      "Ehdotetun maanarvoveron tarkoituksena on kannustaa maanomistajia joko kehittämään kiinteistöjään tai myymään ne niille, jotka haluavat, mikä saattaa vähentää kaupungin huonoa tilaa ja edistää lisäinvestointeja."
    ],
    "commentSummary": [
      "Keskustelussa keskitytään maa-arvoveron käyttöönottoon ja sen mahdollisiin vaikutuksiin, kuten kiinteistökeinottelun estämiseen ja kehityksen edistämiseen alikehittyneillä alueilla.",
      "Skeptikot ovat huolissaan maan arvon arvioinnin haasteista ja viranomaisten mahdollisesta väärinkäytöstä.",
      "Muita keskustelun aiheita ovat kiinteistöverot, kohtuuhintainen asuminen, kaupunkien tiivistäminen ja mahdolliset vaikutukset kiinteistönomistajiin."
    ],
    "points": 320,
    "commentCount": 570,
    "retryCount": 0,
    "time": 1697500284
  },
  {
    "id": 37901902,
    "title": "MemGPT - LLM:t, joissa on itsekorjautuva muisti rajoittamattomalle kontekstille",
    "originLink": "https://github.com/cpacker/MemGPT",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37901902",
    "commentBody": "",
    "originSummary": [
      "MemGPT on avoimen lähdekoodin chattirobotti, joka käyttää itse muokkautuvaa muistia laajennettua kontekstia varten, jolloin se voi olla vuorovaikutuksessa SQL-tietokantojen ja paikallisten tiedostojen kanssa.",
      "Se käyttää kehittynyttä GPT-4-mallia, ja se voidaan asentaa Discordin kaltaisille alustoille tai käyttää paikallisesti, jolloin käyttäjät voivat ladata ja kysyä tietoja.",
      "Hanketta tuetaan aktiivisesti, ja se rohkaisee käyttäjiä antamaan palautetta ja osallistumaan siihen, mikä viittaa siihen, että järjestelmä reagoi nopeasti ja kehittyy."
    ],
    "commentSummary": [
      "MemGPT:n kirjoittajat esittelevät mallinsa, joka on toteutettu itse muokkaamalla muistia rajattomaan kontekstiin, keskustelevat Hacker Newsissa ja tarjoavat Discord-botin ja avoimen lähdekoodin kokeiluja varten.",
      "Keskustelun aiheina ovat rekursiivinen tiivistäminen chat-roboteissa, konteksti-ikkunan rajoitukset kielimalleissa, muistinhallintatekniikat, keskiarvovektoreiden käyttö pituuden lyhentämiseksi ja jatkuvien chat-robottien luomisen tulevaisuuden mahdollisuudet.",
      "Keskustelu ulottuu eksplisiittiseen vs. implisiittiseen muistinhallintaan, ulkoiseen kontekstiin, hierarkkisiin muistijärjestelmiin, useiden agenttien integrointiin, ja kirjoittajat ottavat aktiivisesti vastaan palautetta, jolla he pyrkivät voittamaan kontekstin pituuden rajoitukset lähestymistavassaan."
    ],
    "points": 309,
    "commentCount": 76,
    "retryCount": 0,
    "time": 1697472476
  },
  {
    "id": 37898999,
    "title": "Parempi HTTP-palvelinreititys Go 1.22:ssa",
    "originLink": "https://eli.thegreenplace.net/2023/better-http-server-routing-in-go-122/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37898999",
    "commentBody": "",
    "originSummary": [
      "Tuleva Go 1.22 -versio tuo huomattavia parannuksia oletusarvoiseen HTTP-palvelun multiplekseriin, joka tarjoaa kehittyneet kuvionmääritysominaisuudet.",
      "Kirjoittaja selittää, miten tätä uutta multiplekseriä voidaan käyttää, ja vertaa sen toimintoja kolmannen osapuolen kirjastoihin, kuten gorilla/muxiin, ja antaa ymmärtää, että se voi mahdollisesti korvata ne.",
      "Go 1.22:n parannetun ominaisuuden odotetaan vaikuttavan reititinpaketteja koskeviin suosituksiin, mikä tuo positiivisen muutoksen Go ohjelmointiyhteisölle."
    ],
    "commentSummary": [
      "Keskustelussa käsitellään eri aiheita, jotka liittyvät HTTP-palvelimen reititykseen Go-kielessä, kuten paniikin käyttämistä useiden reititysosumien noudattamisen valvonnassa ja vastakkainasettelua kääntämisvirheiden ja paniikin välillä.",
      "Keskustelussa käsitellään erityisiä hankkeita, kuten gorilla/muxia, standardikirjaston mahdollisia muutoksia ja web-kehysten ohjainten ja reittien suunnitteluvalintoja.",
      "Laajempana teemana ovat selkeys, ennustettavuus, kompromissit sekä eri menetelmien ja tekniikoiden hyödyntämisen edut ja haitat web-kehityksessä."
    ],
    "points": 307,
    "commentCount": 219,
    "retryCount": 0,
    "time": 1697459894
  },
  {
    "id": 37903890,
    "title": "Twitteristä poistuminen ei vaikuttanut NPR:n liikenteeseen",
    "originLink": "https://pluralistic.net/2023/10/14/freedom-of-reach/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37903890",
    "commentBody": "",
    "originSummary": [
      "Artikkelissa käsitellään digitaalisten alustojen \"enshittification\"-ongelmaa ja tuodaan esiin sen haitalliset vaikutukset käyttäjiin, julkaisijoihin ja mainostajiin.",
      "Esimerkkinä tarkastellaan Elon Muskin toimintaa Twitterissä ja esitetään sääntelymenetelmiä tällaisten haasteiden hallitsemiseksi.",
      "Teoksessa korostetaan, että tarvitaan \"poistumisoikeutta\" koskevaa sääntelyä, jolla lisätään kilpailua ja estetään alustoja hankkimasta liiallista valtaa."
    ],
    "commentSummary": [
      "Keskustelun aiheena on Twitterin vaikutus NPR:n verkkoliikenteeseen ja Twitterin arvo toimittajille. Se käsittää myös huolenaiheet, jotka koskevat kaikukammioita ja disinformaatiota alustalla.",
      "Keskustelua käydään Twitterin kulttuurisen merkityksen vähenemisestä, sen verifiointijärjestelmän hyvistä ja huonoista puolista sekä Elon Muskin yhteydestä Twitteriin.",
      "Keskustelua käydään myös siitä, pitäisikö NPR:n luokitella valtion rahoittamaksi mediaksi, ja mahdollisista puolueellisuuksista, joita valtion sponsorointi voi aiheuttaa."
    ],
    "points": 304,
    "commentCount": 180,
    "retryCount": 0,
    "time": 1697480302
  },
  {
    "id": 37903172,
    "title": "\"Noin puolet Bandcampista irtisanottiin tänään\"",
    "originLink": "https://twitter.com/modernistwitch/status/1713962311579234428",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37903172",
    "commentBody": "",
    "originSummary": [
      "Yritys on hiljattain kokenut huomattavia irtisanomisia, jotka ovat koskeneet lukuisia työntekijöitä.",
      "Irtisanomiset ovat koskeneet eri osastoja, kuten toimitusta ja tukihenkilöstöä.",
      "Irtisanottujen joukossa oli kaksi päätoimittajakollegaa ja suurin osa tukihenkilöstöstä."
    ],
    "commentSummary": ["Noin 50 prosenttia Bandcampin työntekijöistä on irtisanottu."],
    "points": 299,
    "commentCount": 1,
    "retryCount": 0,
    "time": 1697477133
  },
  {
    "id": 37897916,
    "title": "FreeTube - Yksityinen YouTube-asiakas",
    "originLink": "https://github.com/FreeTubeApp/FreeTube",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37897916",
    "commentBody": "",
    "originSummary": [
      "FreeTube on avoimen lähdekoodin, yksityisyyden suojaan keskittyvä työpöydän YouTube-soitin, joka estää mainokset, välttää evästeiden ja JavaScriptin avulla tapahtuvan seurannan ja tallentaa tilaukset ja historian paikallisesti laitteellesi.",
      "Se sisältää ominaisuuksia, kuten kaksi uuttamisliittymää, tilausten hallinnan, teematuen, selainlaajennusten yhteensopivuuden ja pikanäppäimet. Se on käytettävissä Windows-, Mac- ja Linux-käyttäjille.",
      "FreeTube kutsuu käyttäjiä osallistumaan, tarjoaa kielilokalisointitukea, lahjoitusvaihtoehtoja ja on lisensoitu GNU Affero General Public License -lisenssillä."
    ],
    "commentSummary": [
      "Keskustelussa keskitytään mainosten estämiseen YouTubessa ja sen seurauksiin sisällöntuottajille sekä pohditaan, onko se piratismin muoto vai hyväksytty käytäntö.",
      "Keskustelusta käy ilmi tyytymättömyys YouTuben rahankäytön menetelmiin ja YouTube Premiumin rajoituksiin. Keskustelussa käsitellään myös mainosten tungettelevaa luonnetta, yksityisyyden suojaa koskevia huolenaiheita ja keskustellaan mainosten estämisen eettisyydestä.",
      "Keskustellaan yleiskäyttöisestä tietojenkäsittelystä ja sen mahdollisesta sisällyttämisestä maan perustuslakiin. Keskustellaan sananvapauden, alustariippuvuuden ja mainosten estolaitteiden käytön kaltaisista näkökohdista, ja keskusteluissa käsitellään myös rahanmuodostusta ja vaihtoehtoisia tulonlähteitä, mukaan lukien kryptovaluuttaan liittyvät mahdolliset kysymykset."
    ],
    "points": 299,
    "commentCount": 388,
    "retryCount": 0,
    "time": 1697452817
  },
  {
    "id": 37903489,
    "title": "Stocketa - Sovellus, jonka suunnittelin, rakensin ja jota en koskaan käynnistänyt",
    "originLink": "https://paulstamatiou.com/stocketa/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37903489",
    "commentBody": "",
    "originSummary": [
      "Kirjoittaja kertoo matkastaan Stocketa-sovelluksen, satunnaisille sijoittajille suunnatun salkunseurantaohjelman, suunnittelussa ja rakentamisessa, mukaan lukien mukautettujen käyttöliittymäkomponenttien käyttö ja osaketapahtumien seurannan kaltaisten asioiden hallinta.",
      "Sovellus sai kiitosta toiminnallisuudestaan ja suunnittelustaan, ja siinä on käytetty tehokkaasti tekijän yhdistettyjä taitoja suunnittelijana ja koodaajana.",
      "Lopulta tekijä päätti siirtyä toiseen hankkeeseen, Rewind AI:hen, mikä osoittaa, että teknologian kehittäminen vaatii joustavuutta ja sopeutumiskykyä."
    ],
    "commentSummary": [
      "Artikkelissa tarkastellaan henkilökohtaisen projektikehityksen ja erityisesti sovellusten luomisen yhteydessä koettuja vaikeuksia, asiakkaiden hankkimiseen liittyviä haasteita ja prosessiin liittyviä turhautumisia.",
      "Siinä korostetaan, että kirjoittajat keskittyvät laatuun määrän sijaan, ja korostetaan heidän huoliaan yksityisyydestä, tiedonhallinnasta ja tarkkojen pörssitietojen hankkimiseen liittyvistä korkeista kustannuksista.",
      "Kirjoittaja on erittäin kiinnostunut näiden kysymysten ratkaisemisesta erityisesti vedonlyöntimarkkinoilla."
    ],
    "points": 289,
    "commentCount": 65,
    "retryCount": 0,
    "time": 1697478404
  },
  {
    "id": 37897946,
    "title": "C ei ole matalan tason kieli (2018)",
    "originLink": "https://queue.acm.org/detail.cfm?id=3212479",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37897946",
    "commentBody": "",
    "originSummary": [
      "Artikkelissa paljastetaan, että C-koodin parantaminen nykyaikaisia prosessoreita varten on tuonut esiin sen monimutkaisuuden ja haavoittuvuudet, ja väitetään, että C ei ole enää matalan tason kieli.",
      "Teoksessa käsitellään C-koodin tehokkuusoptimointiin liittyviä haasteita ja ehdotetaan, että erilaisilla ohjelmointimalleilla ja prosessorimalleilla voitaisiin nopeuttaa nopeutta ja yksinkertaistaa välimuistien yhteenkuuluvuusprotokollia.",
      "Siinä todetaan, että rinnakkaisohjelmointi C:n kaltaisella kielellä on vaikeaa eikä sovi hyvin yhteen nykyaikaisen laitteiston kanssa."
    ],
    "commentSummary": [
      "Hacker Newsin keskustelussa tarkastellaan C-ohjelmointikielen eri puolia, kuten sen muistinhallinnan hallintaa, kokonaislukujen aritmeettisen käsittelyn turvallisuutta ja sen käyttöä matalan tason järjestelmäohjelmoinnissa.",
      "Osallistujat keskustelevat C:n roolista laitteistosuunnittelussa, rinnakkaisuutta edistävien kielten tarpeesta ja uudempien kielten kyvystä käyttää tehokkaasti nykyaikaisia laitteistoja.",
      "On ehdotettu erilaisia vaihtoehtoisia lähestymistapoja, kuten Rustin kaltaisten kielten käyttöä, Lisp-makrojen käyttöä tai kokoonpanokielen ja korkeamman tason abstraktioiden yhdistämistä. Ei ole kuitenkaan yksimielisyyttä siitä, mikä on paras kieli matalan tason järjestelmäohjelmointiin."
    ],
    "points": 287,
    "commentCount": 388,
    "retryCount": 0,
    "time": 1697453170
  },
  {
    "id": 37905601,
    "title": "4D Gaussian Splatting reaaliaikaista dynaamista näyttämön renderöintiä varten",
    "originLink": "https://guanjunwu.github.io/4dgs/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37905601",
    "commentBody": "",
    "originSummary": [
      "Tutkijat ovat esitelleet uuden 4D Gaussian Splatting (4D-GS) -menetelmän, joka on suunniteltu dynaamisten kohtausten reaaliaikaiseen renderöintiin.",
      "4D-GS-menetelmässä käytetään tehokasta muodonmuutoskenttää Gaussin liikkeiden ja muodonmuutosten simuloimiseksi, mikä edistää korkearesoluutioista, reaaliaikaista renderöintiä.",
      "Ryhmä osoitti menetelmän tehokkuuden synteettisillä tietokokonaisuuksilla, ja tulokset pysyivät korkealaatuisina."
    ],
    "commentSummary": [
      "Artikkelissa käsitellään 4D Gaussian Splattingin käyttöä reaaliaikaiseen dynaamiseen renderöintiin virtuaalitodellisuudessa.",
      "Käyttäjät keskustelevat Gaussin splattingin käytännön vaikutuksista eri aloilla, kuten mediatuotannossa ja videopeleissä, sekä tekniikoista, joilla renderöinnin laatua voidaan parantaa.",
      "Huolimatta siitä, että keskustelu harhautuu toisiinsa liittymättömiin aiheisiin, keskeisessä keskustelussa keskitytään Gaussin splattingin teknisiin näkökohtiin ja sovelluksiin VR-teknologiassa."
    ],
    "points": 262,
    "commentCount": 58,
    "retryCount": 0,
    "time": 1697486375
  },
  {
    "id": 37907433,
    "title": "20 % LinkedInin viimeaikaisista irtisanomisista oli johtajia.",
    "originLink": "https://news.ycombinator.com/item?id=37907433",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37907433",
    "commentBody": "",
    "originSummary": [
      "Noin 20 prosenttia irtisanotuista työntekijöistä oli johtajia, mikä saattaa olla suurempi kuin irtisanomisissa tyypillinen osuus."
    ],
    "commentSummary": [
      "LinkedIn vähensi hiljattain 20 prosenttia työvoimastaan, mikä johti 1 johtajan vähennykseen viidestä, ja herätti keskustelua teknologiateollisuuden käsityksistä.",
      "Teknologiateollisuuden intialaisten työntekijöiden työetiikkaan liittyvistä stereotypioista käydään jatkuvasti keskustelua, jossa keskitytään myönteisiin ja kielteisiin kokemuksiin, viestintään ja kulttuurisiin haasteisiin.",
      "Näiden lisäksi keskusteltiin myös sellaisista aiheista kuin yrityksen maine, keskijohdon kohtaamat vaikeudet, teknisen asiantuntemuksen puute johtotehtävissä ja turhautuminen liiallisiin kokouksiin."
    ],
    "points": 248,
    "commentCount": 222,
    "retryCount": 0,
    "time": 1697494601
  },
  {
    "id": 37900458,
    "title": "Invidious - Avoimen lähdekoodin vaihtoehtoinen etuosa YouTubelle",
    "originLink": "https://invidious.io/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37900458",
    "commentBody": "",
    "originSummary": [
      "Invidious toimii avoimen lähdekoodin vaihtoehtona YouTubelle, jossa korostetaan käyttäjien yksityisyyttä ja vältetään tietojen jäljittämistä.",
      "Se tarjoaa ominaisuuksia, kuten kanavien tilaamisen, soittolistojen luomisen ja videoiden katselun ilman mainoksia.",
      "Invidious tukee useita kieliä ja tarjoaa kehittäjille sovellusohjelmointirajapinnan (API)."
    ],
    "commentSummary": [
      "Keskustelu pyörii Invidiousin ympärillä, joka on avoimen lähdekoodin vaihtoehto YouTubelle ja joka mahdollistaa mainos- ja algoritmivapaan videon katselun, mutta jonka kerrotaan aiheuttavan suurta RAM-muistin käyttöä ja järjestelmän kaatumista.",
      "Huolestuttavaa on Googlen valta-asema henkilökohtaisissa tietotekniikkalaitteissa ja mainosten ohittamisen laillisuus. Osallistujat keskustelevat myös vaihtoehtoisista tulomalleista tekijöille ja niiden tukemisesta ilman mainostuloja.",
      "PeerTuben kaltaiset hajautetut alustat on todettu vaihtoehdoiksi YouTuben mainosten kiertämiseen."
    ],
    "points": 247,
    "commentCount": 123,
    "retryCount": 0,
    "time": 1697467116
  }
]
