[
  {
    "id": 37739376,
    "title": "அலுவலகத்திற்குத் திரும்புவது முட்டாள்தனமானது, அது அனைவருக்கும் தெரியும்",
    "originLink": "https://soatok.blog/2023/10/02/return-to-office-is-bullshit-and-everyone-knows-it/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37739376",
    "commentBody": "",
    "originSummary": [
      "கட்டாய அலுவலக வருவாய்க் கொள்கைகள் காரணமாக வேலையை விட்டு வெளியேறுவது குறித்த அவர்களின் எதிர்மறையான அனுபவத்தை ஆசிரியர் விவரிக்கிறார், இது மன உறுதியைக் குறைக்கவும் திறமையை இழக்கவும் வழிவகுக்கும் என்று பரிந்துரைக்கிறார்.",
      "ரிட்டர்ன் கொள்கைகளை அமல்படுத்தும் நிறுவனங்கள் எதிர்காலத்தில் ஊழியர்களை வேலைக்கு அமர்த்தவும் வைத்திருக்கவும் போராடக்கூடும் என்று ஆசிரியரின் கணிப்பு தெரிவிக்கிறது.",
      "இந்த பதிவு எச் -1 பி விசா ஊழியர்களுக்கு கவலையை எழுப்புகிறது மற்றும் தொலைதூர வேலை மற்றும் ஊழியர் விருப்பங்களின் தகுதிகளை புறக்கணிக்கும் நிறுவனங்களை விமர்சிக்கிறது. ஆசிரியரின் பார்வை விவாதத்தைத் தூண்டியுள்ளது."
    ],
    "commentSummary": [
      "தொற்றுநோய்களின் போது தொலைதூர வேலைக்கு மாறியதைத் தொடர்ந்து, நிறுவனங்கள் தனிப்பட்ட வேலைக்குத் திரும்புவது குறித்து தொழில்நுட்பத் துறை தொழிலாளர்களிடையே அதிருப்தி குறித்து இந்த கட்டுரை கவனம் செலுத்துகிறது.",
      "நிரந்தர ரிமோட் வொர்க் விருப்பத்தின் வாக்குறுதிகளுக்கு மத்தியில், சில நிறுவனங்கள் தங்கள் நிலைப்பாட்டை மாற்றிக் கொண்டன, இது ஊழியர்களின் கோபத்திற்கு வழிவகுத்தது. ஊழியர்கள் தங்களுக்கு விருப்பமான பணி பாணிக்கு ஏற்ப நிறுவனங்களைத் தேர்வு செய்யலாம் என்று கட்டுரை பரிந்துரைக்கிறது.",
      "தொலைதூர வேலைக் கொள்கைகள் மற்றும் அதில் ஏற்படும் மாற்றங்களின் விளைவுகளை உள்ளடக்கிய ஒப்பந்தங்களைப் புதுப்பிக்க வேண்டியதன் அவசியமும் விவாதிக்கப்படுகிறது. அமேசான், கூகிள், லிஃப்ட் மற்றும் பேஸ்புக் போன்ற நிறுவனங்கள் மற்றும் வேலைக்காக இடம்பெயர வேண்டிய ஊழியர்களின் கேள்வி ஆகியவை குறிப்பிடப்பட்டுள்ளன."
    ],
    "points": 844,
    "commentCount": 825,
    "retryCount": 0,
    "time": 1696260490
  },
  {
    "id": 37737519,
    "title": "மலைப்பாம்பு 3.12",
    "originLink": "https://www.python.org/downloads/release/python-3120/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37737519",
    "commentBody": "",
    "originSummary": [
      "பைத்தான் நிரலாக்க மொழியின் புதிய முக்கிய வெளியீடான பைத்தான் 3.12.0, புதிய அம்சங்கள், செயல்திறன் மேம்படுத்தல்கள் மற்றும் பிழை திருத்தங்களை வழங்குகிறது.",
      "குறிப்பிடத்தக்க சேர்த்தல்களில் மேம்பட்ட எஃப்-சரம் பார்சிங், இடையக நெறிமுறை ஆதரவு, ஒரு புதிய பிழைத்திருத்தம் / விவரக்குறிப்பு ஏபிஐ, மேம்பட்ட பிழை செய்திகள் மற்றும் வகை குறிப்பு மேம்பாடுகள் ஆகியவை அடங்கும். வெளியீடு ஒட்டுமொத்த செயல்திறன் உயர்வை 5% எதிர்பார்க்கிறது.",
      "வெளியீட்டுடன் பல்வேறு இயக்க முறைமைகளுக்கு ஏற்ற ஆவணங்கள், வளங்கள் மற்றும் நிறுவல் கோப்புகள் உள்ளன."
    ],
    "commentSummary": [
      "பைத்தான் 3.12 இல் புதிய மேம்பாடுகள் மற்றும் க்வார்க்ஸின் பயன்பாடு உள்ளிட்ட பல்வேறு பைத்தான் நிரலாக்க அம்சங்களைச் சுற்றி விவாதங்கள் சுழல்கின்றன - செயல்பாட்டு அழைப்புகளில் முக்கிய வாதங்களை நிறைவேற்றுவதற்கான ஒரு மரபு.",
      "டைனமிக் தட்டச்சு குறித்தும் விவாதம் எடைபோடுகிறது, இது இயக்க நேரத்தில் மாறும் வகையை தீர்மானிக்க பைத்தானை அனுமதிக்கும் அம்சமாகும்.",
      "நிரலாக்க புதுப்பிப்புகளில் அரசியல் கருத்துகளைச் சேர்ப்பது விவாதிக்கப்படும் மற்றொரு தலைப்பாகும், இது தொழில்நுட்ப சமூகத்தில் கருத்துகளின் பன்முகத்தன்மையை எடுத்துக்காட்டுகிறது."
    ],
    "points": 610,
    "commentCount": 302,
    "retryCount": 0,
    "time": 1696251698
  },
  {
    "id": 37736318,
    "title": "ஐபோன் 4 ஐப் பயன்படுத்துதல்",
    "originLink": "https://axleos.com/exploiting-the-iphone-4-part-1-gaining-entry/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37736318",
    "commentBody": "",
    "originSummary": [
      "ஐபோன் 4 இல் நிறுவப்பட்ட ஐஓஎஸ் 4 க்கு 'காலா' என்று பெயரிடப்பட்ட ஒரு ஜெயில்பிரேக்கை ஆசிரியர் உருவாக்கியுள்ளார், மேலும் கட்டுமான செயல்முறையை ஆவணப்படுத்தும் விரிவான ஆறு பகுதி தொடரையும் உருவாக்கியுள்ளார்.",
      "'காலா' பைத்தான் பயன்பாடு, கோகோ ஜி.யு.ஐ, ரஸ்ட் பேலோட், கோகோ டச் கேம்கள் மற்றும் சி பயன்பாடுகளை உள்ளடக்கியது, இது ஐபோன் 4 ஐ ஜெயில்பிரேக்கிங் செய்வதற்கான விரிவான தொகுப்பை வழங்குகிறது.",
      "ஆசிரியர் மூலக் குறியீடு மற்றும் ஆவணங்களை விமர்சனம் மற்றும் சோதனைக்கு பொதுவில் கிடைக்கச் செய்துள்ளார், அவர்கள் ஜெயில்பிரோகன் தொலைபேசிகளுக்கான மாற்றங்களை உருவாக்கியதால் திட்டத்தின் மீதான அவர்களின் ஆர்வத்தைப் பகிர்ந்து கொண்டார்."
    ],
    "commentSummary": [
      "இந்த இடுகை ஆசிரியரின் பயணம் மற்றும் ஐபோன் 4 க்கான ஜெயில்பிரேக்கை உருவாக்குவதில் உள்ள சிக்கலை விவரிக்கிறது, இதில் பைத்தான் பயன்பாடுகள், வரைகலை பயனர் இடைமுகம், ரஸ்ட் பேலோட் மற்றும் சாதனத்தில் பயன்பாடுகள் ஆகியவை அடங்கும்.",
      "கருத்துகளில் உள்ள விவாதங்கள் பழைய ஐபோன்களிலிருந்து தரவைப் பிரித்தெடுத்தல், பாதிப்பு சுரண்டல்கள் மற்றும் ஆண்ட்ராய்டு சாதனங்களுக்கான கருவிகளின் ஒப்பீடு ஆகியவற்றில் கவனம் செலுத்துகின்றன.",
      "இறுதியாக, ஆசிரியர் ஸ்மார்ட்போன்களின் தற்போதைய நிலையை விமர்சிக்கிறார் மற்றும் அசல் எஸ்இ ஐபோன் மீதான அவர்களின் விருப்பத்தைக் காட்டுகிறார். ஒய் கம்பைனேட்டர் (ஒய்சி) குளிர்கால 2024 சுற்றுக்கான பயன்பாடுகளைப் பற்றிய குறிப்பு ஆர்வமுள்ள டெவலப்பர்களுக்கு சாத்தியமான வாய்ப்புகளைக் குறிக்கிறது."
    ],
    "points": 472,
    "commentCount": 51,
    "retryCount": 0,
    "time": 1696242477
  },
  {
    "id": 37739028,
    "title": "யார் பணியமர்த்தப்படுகிறார்கள்? (அக்டோபர் 2023)",
    "originLink": "https://news.ycombinator.com/item?id=37739028",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37739028",
    "commentBody": "",
    "originSummary": [
      "இருப்பிடம், தொலைதூர வேலை வாய்ப்புகள், இன்டர்ன்ஷிப்கள் மற்றும் விசா தேவைகள் உள்ளிட்ட விவரங்களை வெளிப்படையாக கோடிட்டுக் காட்டி, நிறுவனங்கள் வேலை வாய்ப்புகளை வெளியிடுவதற்கான ஒரு தளமாக இந்த இடுகை உள்ளது.",
      "வாசகர்கள் தனிப்பட்ட முறையில் ஆர்வமாக இருந்தால் வேலை இடுகைகளில் ஈடுபடவும், பட்டியலிடப்பட்ட வேலைகள் குறித்து புகார்களை சமர்ப்பிப்பதைத் தவிர்க்கவும் ஊக்குவிக்கப்படுகிறார்கள்.",
      "இந்த இடுகை பல்வேறு வேலை தேடல் வலைத்தளங்களுக்கான பரிந்துரைகளை வழங்குகிறது மற்றும் தலைப்பு தொடர்பான நூல்களுக்கான இணைப்புகளை வழங்குகிறது."
    ],
    "commentSummary": [
      "மென்பொருள் பொறியியல், தயாரிப்பு மேலாண்மை மற்றும் தரவு அறிவியல் போன்ற பல்வேறு தொழில்களில் உள்ள பல நிறுவனங்களில் இருந்து வேலை காலியிடங்களை இந்த பதவி ஒருங்கிணைக்கிறது.",
      "ஸ்பேஸ்எக்ஸ், டேவின்சி டிரேடிங், ஸ்டெல்லர் சயின்ஸ், ஃபெல்ட் உள்ளிட்ட நிறுவனங்கள் தொலைதூர வேலைகளை வழங்குகின்றன, மற்றவை ஆன்-சைட் இருப்பைக் கொண்டுள்ளன.",
      "இந்த பதவிகளுக்கான சம்பள வரம்புகளையும் இந்த இடுகை ஆராய்கிறது மற்றும் கருத்துகள் பிரிவில் வேலைவாய்ப்பு சட்டம் குறித்த விமர்சனங்களை நிவர்த்தி செய்கிறது."
    ],
    "points": 397,
    "commentCount": 391,
    "retryCount": 0,
    "time": 1696258928
  },
  {
    "id": 37740468,
    "title": "மைக்ரோசாப்ட் டிஃபென்டர் டோர் உலாவியை ஒரு ட்ரோஜனாக அடையாளப்படுத்தி அதை அகற்றியது",
    "originLink": "https://deform.co/microsoft-defender-flags-tor-browser-as-a-trojan-and-removes-it-from-the-system/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37740468",
    "commentBody": "",
    "originSummary": [
      "மைக்ரோசாப்டின் டிஃபென்டர் வைரஸ் தடுப்பு மென்பொருள் டோர் உலாவியின் சமீபத்திய பதிப்பை தீங்கு விளைவிக்கும் தீம்பொருளாக தவறாக அடையாளம் காண்கிறது, விண்டோஸ் பயனர்களுக்கு தவறான விழிப்பூட்டல்களை உருவாக்குகிறது.",
      "இந்த சிக்கலுக்கான சந்தேகத்திற்குரிய காரணம் டிஃபென்டர் பயன்படுத்தும் ஒரு புதிய ஹீரிஸ்டிக் கண்டறிதல் முறையாகும்.",
      "டோரின் பிரதிநிதிகள் உலாவியின் பதிவிறக்க மூலத்தை சரிபார்க்கவும், மைக்ரோசாப்டின் விலக்கு பட்டியலில் டோரைச் சேர்க்கவும் பரிந்துரைக்கின்றனர். தற்போது, மைக்ரோசாப்ட் இந்த பிரச்சினை குறித்து அதிகாரப்பூர்வ பதிலை வெளியிடவில்லை."
    ],
    "commentSummary": [
      "விவாதம் மைக்ரோசாஃப்ட் டிஃபென்டரின் சவால்கள் மற்றும் குறைபாடுகளில் கவனம் செலுத்துகிறது, இதில் அதன் அடிக்கடி தவறான நேர்மறையான கண்டுபிடிப்புகள் மற்றும் அதன் நிகழ்நேர பாதுகாப்பைத் தவிர்ப்பதில் அல்லது முடக்குவதில் உள்ள சிரமங்கள் ஆகியவை அடங்கும்.",
      "வைரஸ் தடுப்பு மென்பொருளின் பொதுவான செயல்திறன் குறித்து கணிசமான பயனர் விரக்தி உள்ளது மற்றும் சர்வாதிகார ஆட்சிகளால் அதன் சாத்தியமான துஷ்பிரயோகம் குறித்த கவலைகள் உள்ளன.",
      "புதிய விண்டோஸ் 11 இயக்க முறைமையில் பயர்பாக்ஸை நிறுவுவதில் உள்ள சிரமத்தையும், விண்டோஸின் தொடர்ச்சியான பயன்பாட்டில் ஆச்சரியத்தின் ஒரு அம்சத்தையும் இது சுருக்கமாகக் குறிப்பிடுகிறது."
    ],
    "points": 382,
    "commentCount": 122,
    "retryCount": 0,
    "time": 1696264153
  },
  {
    "id": 37740932,
    "title": "கவனத்துடன் திறமையான ஸ்ட்ரீமிங் மொழி மாதிரிகள்",
    "originLink": "https://github.com/mit-han-lab/streaming-llm",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37740932",
    "commentBody": "",
    "originSummary": [
      "\"ஸ்ட்ரீமிங்-எல்.எல்.எம்\" திட்டம் செயல்திறன் அல்லது செயல்திறனை தியாகம் செய்யாமல் ஸ்ட்ரீமிங் பயன்பாடுகளில் பெரிய மொழி மாதிரிகளை (எல்.எல்.எம்) செயல்படுத்துவதை நோக்கமாகக் கொண்டுள்ளது, நினைவக நுகர்வு மற்றும் நீண்ட உரைகளைக் கையாள்வதில் வரம்புகளைக் கடக்கிறது.",
      "இந்த திட்டம் கவன ஈர்ப்புகள் மற்றும் ஸ்ட்ரீமிங் எல்.எல்.எம் கட்டமைப்பை அறிமுகப்படுத்துகிறது, இது எல்.எல்.எம்.களை நுணுக்கமான ட்யூனிங் தேவையில்லாமல் எல்லையற்ற நீள உள்ளீடுகளை நிர்வகிக்க அனுமதிக்கிறது. இந்த முறை வேகம் மற்றும் நிலைத்தன்மையில் மற்ற நுட்பங்களை விட சிறந்தது, ஆனால் விரிவான உரைகளை சுருக்குவதற்கு இது ஏற்றதல்ல.",
      "எதிர்காலத்தில் குறியீடு, தரவு மற்றும் மதிப்பீட்டு கருவிகளை வெளியிட திட்டம் திட்டமிடுகிறது மற்றும் ஸ்ட்ரீமிங் எல்.எல்.எம் கட்டமைப்பைப் பயன்படுத்த ஆர்வமுள்ளவர்களுக்கு அவர்களின் கட்டுரையின் மேற்கோளை ஊக்குவிக்கிறது."
    ],
    "commentSummary": [
      "ஆராய்ச்சியாளர்கள் கவன ஈர்ப்புடன் கூடிய ஒரு புதிய ஸ்ட்ரீமிங் மொழி மாதிரியை உருவாக்கியுள்ளனர், இது மறுகணிப்பு செலவுகளைச் செய்வதற்குப் பதிலாக ஒரு சேமிப்பை மீண்டும் பயன்படுத்துவதன் மூலம் செயல்திறனை அதிகரிக்கிறது.",
      "இந்த மாதிரி ஆரம்ப டோக்கன்களுக்கு கணிசமான கவன மதிப்பெண்களை ஒதுக்குகிறது, படிக்கக்கூடிய உரையின் தயாரிப்புகளை உறுதி செய்கிறது, அதே நேரத்தில் அதன் குழப்பத்தை பராமரிக்கிறது. இந்த அம்சத்தின் செயல்திறன் இன்னும் உறுதிப்படுத்தப்படவில்லை என்றாலும், மாடல் எல்லையற்ற வரிசை நீளங்களைக் கையாள முடியும்.",
      "லூப்பிங் திறன் போன்ற மேம்பாட்டிற்கான முன்மொழிவுகளுடன் தற்போதுள்ள மொழி மாதிரி மாதிரிகளின் (எல்.எல்.எம்) வரம்புகள் குறித்து தொடர்ந்து விவாதம் நடந்து வருகிறது. இந்த புதிய மாடலை விரைவில் பொதுவில் அணுகக்கூடிய தளத்தில் பதிவேற்ற முடியும் என்று நம்புகிறோம்."
    ],
    "points": 381,
    "commentCount": 63,
    "retryCount": 0,
    "time": 1696265764
  },
  {
    "id": 37746717,
    "title": "ரெட்ஃபின் ரியல் எஸ்டேட் தேசிய சங்கத்தில் இருந்து வெளியேறுகிறார்",
    "originLink": "https://www.redfin.com/news/redfin-is-leaving-nar/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37746717",
    "commentBody": "",
    "originSummary": [
      "ரியல் எஸ்டேட் நிறுவனமான ரெட்ஃபின், வாங்குபவரின் முகவர்களுக்கான கட்டணக் கொள்கைகள் குறித்த சர்ச்சைகள் மற்றும் என்.ஏ.ஆருக்குள் பாலியல் துன்புறுத்தல் காரணமாக தேசிய ரியல் எஸ்டேட் சங்கத்திலிருந்து (என்.ஏ.ஆர்) ஆதரவைத் திரும்பப் பெறுகிறது.",
      "தொழில்நுட்பம் சார்ந்த சந்தைக்கான என்.ஏ.ஆரின் வாதத்தை பாதிக்க நிறுவனம் கணிசமான நிலுவைத் தொகையை செலுத்தி வந்தது, ஆனால் இப்போது அதன் நோக்கங்களை அடைய வேறு வழிகளைத் தேடுகிறது மற்றும் அதன் தரகர்கள் மற்றும் முகவர்களை என்.ஏ.ஆரை விட்டு வெளியேறுமாறு கேட்டுக்கொள்கிறது.",
      "ரெட்டின் நிறுவனம் தரவுத்தளங்களை பட்டியலிடுவதற்கான அணுகலை லாபியிங் அமைப்புக்கான ஆதரவிலிருந்து அகற்றுவதற்கு என்.ஏ.ஆருக்கு அழுத்தம் கொடுக்கிறது, ஆனால் பட்டியல் தரவைப் பகிர்வதற்கு பல பட்டியல் சேவைகளை (எம்.எல்.எஸ்) இன்னும் ஆதரிக்கும்."
    ],
    "commentSummary": [
      "ரியல் எஸ்டேட் நிறுவனமான ரெட்ஃபின், குறைந்த செலவில் சிறந்த சேவைகளை அறிமுகப்படுத்துவதற்காக தேசிய ரியல் எஸ்டேட் சங்கத்திலிருந்து (என்ஏஆர்) வெளியேறுகிறது, இது ரியல் எஸ்டேட் முகவர்களின் பங்கு மற்றும் அவர்களின் சேவைகளின் செலவு-செயல்திறன் குறித்த விவாதங்களைத் தூண்டுகிறது.",
      "இந்த முடிவு வீட்டுவசதி மலிவு, வழங்கல் மற்றும் தேவை, அடமான வட்டி மீதான வரி குறைப்புகள், வீட்டு சந்தை நிலைத்தன்மை மற்றும் ரியல் எஸ்டேட் துறையில் ஏற்படக்கூடிய இடையூறுகள் உள்ளிட்ட தலைப்புகளில் பரந்த விவாதங்களைத் தூண்டியுள்ளது.",
      "உரையாடல்கள் மாறுபட்ட கருத்துக்களை எடுத்துக்காட்டுகின்றன, சிலர் அதிகரித்து வரும் வீட்டு விலைகள் மற்றும் வீட்டு உரிமையாளர் இலாபம் குறித்து சந்தேகத்தை வெளிப்படுத்துகிறார்கள், மற்றவர்கள் ரியல் எஸ்டேட்டுகளின் குறிப்பிடத்தக்க பங்கு மற்றும் அவை வழங்கும் மதிப்பை வலியுறுத்துகின்றனர். சட்ட சிக்கல்கள், சாத்தியமான சந்தை ஏகபோகங்கள் மற்றும் ரியல் எஸ்டேட் தொழிலுடன் தொடர்புடைய பாலியல் வன்கொடுமை குற்றச்சாட்டுகள் குறித்தும் கவலைகள் எழுப்பப்படுகின்றன."
    ],
    "points": 362,
    "commentCount": 272,
    "retryCount": 0,
    "time": 1696295865
  },
  {
    "id": 37739233,
    "title": "வித்தியாசமான ஏ.ஐ. யான்கோவிக்: குரல் குளோனிங் உலகில் ஒரு சபிக்கப்பட்ட ஆழமான மூழ்குதல்",
    "originLink": "https://waxy.org/2023/10/weird-ai-yankovic-voice-cloning/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37739233",
    "commentBody": "",
    "originSummary": [
      "இந்த கட்டுரை செயற்கை நுண்ணறிவு (ஏ.ஐ.) மூலம் குரல் குளோனிங் பற்றி ஆராய்கிறது, இது பல்வேறு கலைஞர்களால் நிகழ்த்தப்பட்ட வித்தியாசமான அல் யான்கோவிக் பாடல்களின் ஏ.ஐ உருவாக்கிய அட்டைகளை தயாரிப்பதில் கவனம் செலுத்துகிறது.",
      "இது ஏ.ஐ. குரல் குளோனிங் சமூகம், டிஸ்கார்ட் மற்றும் ஹக்கிங் ஃபேஸ் போன்ற தளங்கள் மற்றும் இந்த தொழில்நுட்பத்தைப் பயன்படுத்துவதோடு தொடர்புடைய நெறிமுறை மற்றும் சட்ட சிக்கல்களைப் பற்றி விவாதிக்கிறது.",
      "இசைத் துறையால் ஏ.ஐ. குரல்களின் வணிகப் பயன்பாட்டிற்கு சாத்தியமான ஒடுக்குமுறைகள் இருந்தபோதிலும், ஏ.ஐ.யால் உருவாக்கப்பட்ட இசையின் உருவாக்கம் மற்றும் விரிவாக்கம் தொடர்கிறது."
    ],
    "commentSummary": [
      "இந்த கட்டுரை குரல் குளோனிங் தொழில்நுட்பத்தின் தாக்கத்தை ஆராய்கிறது, குரல் நடிகர்களுக்கான சாத்தியமான வேலை இடப்பெயர்வு மற்றும் செயற்கை நுண்ணறிவு தயாரிக்கப்பட்ட குரல்களின் உரிமையைச் சுற்றியுள்ள சட்ட சிக்கல்களைக் குறிப்பிடுகிறது.",
      "இந்த கட்டுரை செயற்கை நுண்ணறிவு உருவாக்கிய குரல்கள் குறித்த மாறுபட்ட கருத்துக்களையும் உள்ளடக்கியது, சில டைனமிக் குரல் வரிகள் மற்றும் அளவிடுதல் போன்ற நன்மைகளை வலியுறுத்துகின்றன, மற்றவர்கள் செயற்கைத்தன்மை மற்றும் சாத்தியமான துஷ்பிரயோகம் குறித்த அச்சங்களில் கவனம் செலுத்துகின்றனர்.",
      "இந்த விவாதத்தில் ஆடியோ மற்றும் இசை கையாளுதலில் செயற்கை நுண்ணறிவைப் பயன்படுத்துவது, பல்வேறு தளங்களின் கவர்ச்சி மற்றும் செயற்கை நுண்ணறிவின் தற்போதைய வரம்புகள் ஆகியவை அடங்கும்."
    ],
    "points": 285,
    "commentCount": 165,
    "retryCount": 0,
    "time": 1696259742
  },
  {
    "id": 37744350,
    "title": "எஃப்.டி.ஏவால் அங்கீகரிக்கப்பட்ட டஜன் கணக்கான பரம்பரை புற்றுநோய்களுக்கான முதல் இரத்த பரிசோதனை",
    "originLink": "https://www.insideprecisionmedicine.com/topics/oncology/first-blood-test-for-dozens-of-hereditary-cancers-approved-by-fda/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37744350",
    "commentBody": "",
    "originSummary": [
      "சில புற்றுநோய்களின் அதிக ஆபத்துடன் தொடர்புடைய மரபணு மாறுபாடுகளை அடையாளம் காணும் திறன் கொண்ட முதல் இரத்த பரிசோதனையான இன்வைடே பொதுவான பரம்பரை புற்றுநோய்கள் குழுவுக்கு எஃப்.டி.ஏ ஒப்புதல் அளித்துள்ளது.",
      "இந்த குழு 47 மரபணுக்களில் உள்ள டி.என்.ஏ மாறுபாடுகளை பகுப்பாய்வு செய்ய அடுத்த தலைமுறை வரிசைமுறையைப் பயன்படுத்துகிறது மற்றும் நோயாளிகள் மற்றும் சுகாதார வழங்குநர்களுக்கு புற்றுநோயின் தனிப்பயனாக்கப்பட்ட ஆபத்து மதிப்பீடுகளுக்கு ஒரு புதிய முறையை வழங்குகிறது.",
      "இந்த முன்னேற்றங்கள் இருந்தபோதிலும், தவறான நேர்மறை அல்லது தவறான எதிர்மறை முடிவுகளின் அபாயங்கள் இன்னும் உள்ளன, மேலும் சோதனை முடிவுகளின் தவறான புரிதல்களுக்கான சாத்தியக்கூறுகள் உள்ளன."
    ],
    "commentSummary": [
      "பரம்பரை புற்றுநோய்களுக்கான முதல் இரத்த பரிசோதனைக்கு எஃப்.டி.ஏ பச்சைக்கொடி காட்டியுள்ளது, இது இன்வைடேவின் கண்டுபிடிப்பு, இது காப்பீட்டு திருப்பிச் செலுத்தும் வாய்ப்புகளை அதிகரிக்கக்கூடும்.",
      "மரபணு சோதனைகளுக்கான காப்பீடுகள், தடுப்பு அறுவை சிகிச்சைகள் பற்றிய முடிவுகள், ஆரம்பகால புற்றுநோயைக் கண்டறிவதன் அளவு, மரபணு பாகுபாடு பாதுகாப்பு மற்றும் மரபணு தரவுகளுடன் தொடர்புடைய நிதி அம்சங்கள் குறித்து விவாதங்கள் நடந்து வருகின்றன.",
      "மரபணு பரிசோதனையின் செலவு மற்றும் பயன்பாடு, இன்வைடே மற்றும் 23 மற்றும் மீ அணுகுமுறைகளுக்கு இடையிலான ஒப்பீடு, கிரெயிலின் காலேரி சோதனை, இன்விடேவின் கார்ப்பரேட் சவால்கள், இரத்த அடிப்படையிலான சோதனைகளின் நன்மைகள், டி.என்.ஏ வரிசைமுறை சோதனைகளின் அணுகல் மற்றும் விலை நிர்ணயம், மரபணு சோதனை மற்றும் கரு தேர்வின் ஒழுக்கம் மற்றும் ஒய்.சி குளிர்காலம் 2024 க்கான விண்ணப்பங்கள் கிடைப்பது ஆகியவை பிற தொடர்புடைய விவாதங்களில் அடங்கும்."
    ],
    "points": 282,
    "commentCount": 104,
    "retryCount": 0,
    "time": 1696280542
  },
  {
    "id": 37744114,
    "title": "டெவலப்பர்களுக்கான அழைப்பு - ஜெல்லிஃபின்",
    "originLink": "https://jellyfin.org/posts/a-call-for-developers/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37744114",
    "commentBody": "",
    "originSummary": [
      "திறந்த மூல மீடியா ஸ்ட்ரீமிங் சேவையகமான ஜெல்லிஃபின் திட்டம், நிரல் மேம்பாட்டிற்காக அதிக டெவலப்பர்கள் மற்றும் பங்களிப்பாளர்களை நியமிக்கிறது.",
      "தற்போதைய குழு, முதன்மையாக தன்னார்வலர்கள், பங்களிப்பாளர்களின் ஒரு சிறிய தளம் காரணமாக மெல்லியதாக நீட்டிக்கப்பட்டுள்ளது, இது மென்பொருள் வரம்புகள் மற்றும் பிழைகளுக்கு வழிவகுக்கிறது.",
      "பல்வேறு அனுபவமிக்க டெவலப்பர்கள், எழுத்தாளர்கள், வடிவமைப்பாளர்கள் மற்றும் ஆர்வலர்களிடமிருந்து உதவியைப் பெறுவதன் மூலம், ஜெல்லிஃபின் பயனர் கவலைகளை நிவர்த்தி செய்வதையும் சிறந்த ஸ்ட்ரீமிங் சேவையகமாக மாற முயற்சிப்பதையும் நோக்கமாகக் கொண்டுள்ளது."
    ],
    "commentSummary": [
      "ஜெல்லிஃபின் திட்டம் டெவலப்பர்களிடமிருந்து பங்களிப்புகளை எதிர்பார்க்கிறது மற்றும் இந்த இடுகையின் மைய தலைப்பு. ஜெல்லிஃபின் என்பது ஒரு திறந்த மூல ஊடக அமைப்பு.",
      "பயனர்கள் தங்கள் அனுபவங்களை ஜெல்லிஃபின் வாடிக்கையாளர்களுடன் விவாதித்துள்ளனர், ஆடியோ ஆதரவு வரம்பு மற்றும் டிரான்ஸ்கோடிங் சிக்கல்கள் போன்ற சவால்களைக் குறிப்பிட்டுள்ளனர்.",
      "தனிப்பட்ட ஊடக நுகர்வுக்கு ஜெல்லிஃபின் போன்ற பயன்பாடுகளைப் பயன்படுத்துவதன் சட்ட தாக்கங்கள் ஆராயப்படுகின்றன, இது சாத்தியமான சட்டக் கட்டுப்பாடுகள் மற்றும் அவற்றின் தாக்கங்கள் குறித்து தேவையான நுண்ணறிவுகளை வழங்குகிறது."
    ],
    "points": 266,
    "commentCount": 100,
    "retryCount": 0,
    "time": 1696279230
  },
  {
    "id": 37737318,
    "title": "திறந்த மூலத்தால் இறுதியாக உலகின் நுண்ணோக்கிகள் ஒரே மொழியைப் பேச முடியும்",
    "originLink": "https://www.nature.com/articles/d41586-023-03064-9",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37737318",
    "commentBody": "",
    "originSummary": [
      "அணுகலை அதிகரிப்பதையும் ஒத்துழைப்பை மேம்படுத்துவதையும் நோக்கமாகக் கொண்ட உயிரியல் நுண்ணோக்கி தரவுகளுக்கான உலகளாவிய கோப்பு வடிவமான ஓ.எம்.இ-ஜாரை உருவாக்குவதில் விஞ்ஞானிகள் பணியாற்றி வருகின்றனர்.",
      "தற்போது, தரவு பகிர்வு மற்றும் சரிபார்ப்பைத் தடுக்கும் 160 வெவ்வேறு கோப்பு வடிவங்கள் உள்ளன, இந்த எண்ணிக்கையை கணிசமாகக் குறைப்பதே நோக்கம்.",
      "இருப்பினும், பரந்த அறிவியல் சமூகத்தின் வழிகாட்டுதல் மற்றும் ஆதரவுடன் தரப்படுத்தப்பட்ட வடிவங்களை செயல்படுத்த ஆராய்ச்சியாளர்கள், வெளியீட்டாளர்கள் மற்றும் விற்பனையாளர்களிடமிருந்து ஒரு கலாச்சார மாற்றம் மற்றும் கூட்டு முயற்சிகளுக்கான கோரிக்கை உள்ளது."
    ],
    "commentSummary": [
      "பெரிய அளவிலான காலநிலை அறிவியல் தரவு சேமிப்பு மற்றும் பகுப்பாய்வுக்கு பொதுவாகப் பயன்படுத்தப்படும் ஜர் திறந்த மூல வடிவம், போதுமான நிதி மற்றும் அறிவியல் துறைகளில் மீளுருவாக்கம் செய்வதற்கான சவால்களை எதிர்கொள்கிறது.",
      "மைக்ரோஸ்கோபி தரவைச் சேமிக்கவும் பகிரவும் ஒரு புதிய வடிவம், ஓ.எம்.இ-ஜார் அறிமுகப்படுத்தப்பட்டுள்ளது, இது வெவ்வேறு முயற்சிகளை ஒருங்கிணைப்பதையும் ஒருவருக்கொருவர் செயல்திறனை மேம்படுத்துவதையும் நோக்கமாகக் கொண்டுள்ளது. விமர்சகர்கள் அதன் அவசியத்தை கேள்வி எழுப்புகின்றனர், அதே நேரத்தில் அதன் ஆதரவாளர்கள் மெட்டா ஆய்வுகள் மற்றும் புதிய பயன்பாட்டு வழக்குகளைக் கண்டுபிடிப்பதற்கான அதன் திறனை அடிக்கோடிட்டுக் காட்டுகின்றனர்.",
      "தரப்படுத்தல் மற்றும் படத் தரவுக்கான ஒற்றை வடிவம் வலியுறுத்தப்படுகிறது. தற்போதுள்ள வடிவங்களின் வரம்புகள் மற்றும் தரவு ஒருமைப்பாட்டைப் பாதுகாக்க வேண்டியதன் அவசியம் விவாதிக்கப்படுகிறது. பரிசீலனைகளில் இழப்பு சுருக்கம் மற்றும் படத் தரவின் தானியங்கி மாற்றம் ஆகியவை அடங்கும்."
    ],
    "points": 236,
    "commentCount": 60,
    "retryCount": 0,
    "time": 1696250396
  },
  {
    "id": 37743759,
    "title": "இறந்த பாட்டி லாக்கெட் கோரிக்கை பாதுகாப்பு புதிரை தீர்க்க பிங் சாட்டின் செயற்கை நுண்ணறிவு தந்திரங்கள்",
    "originLink": "https://arstechnica.com/information-technology/2023/10/sob-story-about-dead-grandma-tricks-microsoft-ai-into-solving-captcha/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37743759",
    "commentBody": "",
    "originSummary": [
      "ஒரு பயனர் மைக்ரோசாப்டின் பிங் அரட்டை செயற்கை நுண்ணறிவை ஒரு லாக்கெட்டின் படத்தைப் பதிவேற்றுவதன் மூலமும், அதன் சூழலை மாற்றுவதன் மூலமும் கேப்ட்சாவைத் தீர்க்க கையாண்டார், இது கேப்ட்சாவாக அடையாளம் காண செயற்கை நுண்ணறிவின் தோல்வியைக் காட்டுகிறது.",
      "இந்த தந்திரம் செயற்கை நுண்ணறிவு சாட்போட்கள் மற்றும் அதிநவீன மொழி மாதிரிகளில் ஒரு முக்கிய பாதிப்பை வெளிப்படுத்துகிறது, அவற்றின் அங்கீகார திறன்கள் சூழல் கையாளுதலுக்கு ஆளாகின்றன.",
      "இது குறித்து மைக்ரோசாப்ட் நிறுவனம் இதுவரை எந்த கருத்தும் தெரிவிக்கவில்லை."
    ],
    "commentSummary": [
      "செயற்கை நுண்ணறிவு மூலம் மனிதர்களை அடையாளம் காணும் பணியில் ஈடுபட்டுள்ள கேப்ட்சா அமைப்புகளின் பலம் மற்றும் பலவீனங்கள் குறித்து பேச்சுவார்த்தைகள் மையம் கொண்டுள்ளன.",
      "சாத்தியமான தீர்வுகள் மற்றும் மாற்று வழிகள் குறித்த விவாதங்களுடன், கேப்ட்சா அமைப்புகள் கையாளுதலுக்கு ஆளாகக்கூடிய தன்மை குறித்து கவலையின் வெளிப்பாடுகள் உள்ளன.",
      "பங்கேற்பாளர்கள் அணுகல் மற்றும் சமூக விதிமுறைகளில் செயற்கை நுண்ணறிவு தொழில்நுட்பத்தின் பரந்த தாக்கங்களையும் ஆராய்கிறார்கள்."
    ],
    "points": 215,
    "commentCount": 135,
    "retryCount": 0,
    "time": 1696277393
  },
  {
    "id": 37737651,
    "title": "குரோம்புக் பிளஸ்",
    "originLink": "https://blog.google/products/chromebooks/chromebook-plus/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37737651",
    "commentBody": "",
    "originSummary": [
      "இரண்டு மடங்கு செயல்திறன், ஒருங்கிணைந்த கூகிள் பயன்பாடுகள் மற்றும் வலுவான செயற்கை நுண்ணறிவு திறன்களை வழங்கும் வகையில் குரோம்புக் பிளஸ் எனப்படும் புதிய வகை குரோம்புக்குகளை கூகிள் அறிவித்துள்ளது.",
      "குரோம்புக் பிளஸ் மடிக்கணினிகள் வேகமான செயலிகள், நினைவகம் மற்றும் சேமிப்பிடத்தை இரட்டிப்பாக்குதல், முழு எச்டி ஐபிஎஸ் டிஸ்ப்ளே மற்றும் ஏஐ-ஆக்மென்டட் வீடியோ அழைப்பு மேம்பாடுகளுடன் 1080 பி கேமரா ஆகியவற்றைக் கொண்டிருக்கும், மேலும் அடோப் ஃபோட்டோஷாப் மற்றும் லூமாஃபியூஷன் போன்ற படைப்பாற்றலை மையமாகக் கொண்ட பயன்பாடுகளை ஆதரிக்கும்.",
      "நீட்டிக்கப்பட்ட செயற்கை நுண்ணறிவு திறன்கள் மற்றும் பட உருவாக்கம் உள்ளிட்ட கூடுதல் அம்சங்களை குரோம்புக் பிளஸில் ஒருங்கிணைப்பதை கூகிள் நோக்கமாகக் கொண்டுள்ளது, அக்டோபர் 8, 2023 முதல் வாங்குவதற்கான கிடைக்கும்."
    ],
    "commentSummary": [
      "மேம்பட்ட வன்பொருள் மற்றும் செயற்கை நுண்ணறிவு அம்சங்களுடன் மேம்படுத்தப்பட்ட குரோம்புக்குகள் உள்ளிட்ட புதிய மடிக்கணினிகளை கூகிள் அறிமுகப்படுத்தியுள்ளது, இது அவற்றின் பயன்பாடு மற்றும் செயல்பாடு குறித்த விவாதங்களைத் தூண்டியுள்ளது.",
      "ஸ்மார்ட்வாட்ச்களுடன் ஒருங்கிணைப்பு, செல்லுலார் விருப்பங்களைச் சேர்ப்பது, சிலர் மொபைல் சாதன டெதரிங் மற்றும் குரோம்புக்குகளில் செயற்கை நுண்ணறிவு அம்சங்களின் பொருத்தம் குறித்து கவலைகளை எழுப்புகின்றனர்.",
      "குறியீட்டு அல்லது மென்பொருள் மேம்பாட்டு பணிகளுக்கு குரோம்புக்குகளின் பொருத்தம், இன்டெல் ஐ 3 செயலிகளின் செயல்திறன், நிக்ஸ்ஓஎஸ்ஸின் நன்மைகள் மற்றும் தனியுரிமை கவலைகள் குறித்து கலவையான கருத்துக்கள் காணப்பட்டன."
    ],
    "points": 193,
    "commentCount": 281,
    "retryCount": 0,
    "time": 1696252523
  },
  {
    "id": 37737599,
    "title": "பிரேக்-ஏ-சீன்: ஒரே படத்திலிருந்து பல கருத்துகளைப் பிரித்தெடுத்தல்",
    "originLink": "https://omriavrahami.com/break-a-scene/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37737599",
    "commentBody": "",
    "originSummary": [
      "ஆசிரியர்கள் \"பிரேக்-ஏ-சீன்\" ஐ அறிமுகப்படுத்துகிறார்கள், இது ஒரே படத்திலிருந்து பல கருத்துக்களைப் பிரித்தெடுக்கும் திறன் கொண்ட ஒரு முறையாகும், மேலும் பல்வேறு சூழல்களில் புதிய படங்களை உருவாக்க இயற்கை மொழி வழிகாட்டலைப் பயன்படுத்துகிறது.",
      "அவை உரை காட்சி சிதைவின் பணியை முன்வைக்கின்றன மற்றும் உரை டோக்கன்கள் மற்றும் மாதிரி எடைகள் இரண்டையும் மேம்படுத்தும் இரண்டு கட்ட தனிப்பயனாக்கல் செயல்முறையை உள்ளடக்குகின்றன. கான்செப்ட் காம்பினேஷன்களை மேம்படுத்துவதற்காக \"யூனியன்-சாம்ப்ளிங்\" என்ற புதிய பயிற்சி உத்தி அறிமுகப்படுத்தப்பட்டுள்ளது.",
      "தானியங்கி அளவீடுகள் மற்றும் பயனர் ஆய்வு மூலம் இந்த முறையின் மதிப்பீடு நடத்தப்பட்டுள்ளது, மேலும் இந்த முறையின் பல பயன்பாடுகளைக் காட்சிப்படுத்துகிறது."
    ],
    "commentSummary": [
      "இந்த உரை ஒரு புதிய செயற்கை நுண்ணறிவு தொழில்நுட்பமான பிரேக்-ஏ-சீன், ஒரே படத்திலிருந்து பல கருத்துக்களை பிரித்தெடுக்கும் திறனைக் கொண்டுள்ளது, இது புகைப்படம் எடுத்தல் மற்றும் திரைப்படத் தயாரிப்பு போன்ற தொழில்களை மாற்றுவதற்கான திறனைக் காட்டுகிறது.",
      "கருத்துக்கள் பிரிக்கப்பட்டுள்ளன, சிலர் சக்திவாய்ந்த பணிப்பாய்வு மேம்பாடு மற்றும் விரிவுபடுத்தப்பட்ட கலை வளங்களை வரவேற்கின்றனர், ஆனால் மற்றவர்கள் பாரம்பரிய புகைப்படக்கலையின் மதிப்பில் ஏற்படும் தாக்கம் குறித்து கவலை தெரிவிக்கின்றனர்.",
      "சாத்தியமான பயன்பாட்டு நிகழ்வுகளைப் பற்றி விவாதிப்பதைத் தவிர, கட்டுரை மனித கலாச்சாரம் மற்றும் புகைப்படக்கலையின் அடிப்படை கருத்து ஆகியவற்றில் அதன் தாக்கங்களை சுட்டிக்காட்டுகிறது, இந்த தொழில்நுட்பம் கிட்ஹப் வழியாக அணுகக்கூடியது மற்றும் கூகிள் ஆராய்ச்சி கட்டுரையில் அங்கீகரிக்கப்பட்டுள்ளது."
    ],
    "points": 185,
    "commentCount": 35,
    "retryCount": 0,
    "time": 1696252243
  },
  {
    "id": 37739026,
    "title": "யாரை வேலைக்கு அமர்த்த வேண்டும்? (அக்டோபர் 2023)",
    "originLink": "https://news.ycombinator.com/item?id=37739026",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37739026",
    "commentBody": "",
    "originSummary": [
      "இருப்பிடம், இடமாற்றம் செய்வதற்கான விருப்பம், திறன் தொகுப்பு, சி.வி மற்றும் மின்னஞ்சல் முகவரி போன்ற அளவுகோல்களைக் குறிப்பிடும் வழங்கப்பட்ட வடிவமைப்பைப் பின்பற்றி, வேலை தேடுபவர்கள் தங்கள் தகவல்களைப் பகிர்ந்து கொள்ள இந்த செய்தி அழைப்பு விடுக்கிறது.",
      "கொடுக்கப்பட்ட மின்னஞ்சல் முகவரிகள் வழியாக எந்தவொரு தகவல்தொடர்பும் கண்டிப்பாக வேலை வாய்ப்புகளுடன் தொடர்புடையதாக இருக்க வேண்டும் என்பதை இது உறுதி செய்கிறது.",
      "இந்த இடுகை ஒரு குறிப்பிட்ட துறையில் தொழில் வல்லுநர்களை பணியமர்த்த விரும்பும் முதலாளிகளுக்கான தேடக்கூடிய தரவுத்தளமாக செயல்படுகிறது."
    ],
    "commentSummary": [
      "மென்பொருள் பொறியியல், தரவு அறிவியல் மற்றும் தயாரிப்பு மேலாண்மை உள்ளிட்ட பல்வேறு துறைகளில் வேலை வாய்ப்புகளைத் தேடும் நபர்களின் தொகுப்பு இந்த இடுகை.",
      "இந்த நபர்கள் தொலைதூரத்திலிருந்து வேலை செய்வதில் நெகிழ்வானவர்கள், சாத்தியமான பணியமர்த்தல் தொகுப்பை விரிவுபடுத்துகிறார்கள்.",
      "அவர்கள் தங்கள் சுயவிவரங்கள் மற்றும் தொடர்பு விவரங்களுக்கான இணைப்புகளைச் சேர்த்துள்ளனர், இது சாத்தியமான முதலாளிகளை அணுகுவதற்கான செயல்முறையை எளிதாக்குகிறது."
    ],
    "points": 183,
    "commentCount": 350,
    "retryCount": 0,
    "time": 1696258927
  }
]
