[
  {
    "id": 37739376,
    "title": "অফিসে ফিরে আসা বোকামি এবং সবাই এটা জানে",
    "originLink": "https://soatok.blog/2023/10/02/return-to-office-is-bullshit-and-everyone-knows-it/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37739376",
    "commentBody": "",
    "originSummary": [
      "লেখক জোরপূর্বক অফিস রিটার্ন নীতির কারণে তাদের চাকরি ছেড়ে দেওয়ার বিষয়ে তাদের নেতিবাচক অভিজ্ঞতার বিবরণ দিয়েছেন, পরামর্শ দিয়েছেন যে এটি মনোবল হ্রাস এবং প্রতিভা হারাতে পারে।",
      "লেখকের ভবিষ্যদ্বাণী অনুসারে, রিটার্ন নীতি প্রয়োগকারী সংস্থাগুলি ভবিষ্যতে কর্মীদের নিয়োগ এবং রাখার জন্য লড়াই করতে পারে।",
      "পোস্টটি এইচ-১বি ভিসা কর্মীদের জন্য উদ্বেগ প্রকাশ করে এবং দূরবর্তী কাজ এবং কর্মীদের পছন্দের গুণাবলী উপেক্ষা করার জন্য সংস্থাগুলির সমালোচনা করে। লেখকের দৃষ্টিভঙ্গি আলোচনার জন্ম দিয়েছে।"
    ],
    "commentSummary": [
      "এই নিবন্ধটি মহামারী চলাকালীন দূরবর্তী কাজে স্থানান্তরিত হওয়ার পরে সংস্থাগুলি ব্যক্তিগত কাজে ফিরে যাওয়ার বিষয়ে প্রযুক্তি শিল্পের কর্মীদের মধ্যে অসন্তোষের উপর দৃষ্টি নিবদ্ধ করে।",
      "একটি স্থায়ী দূরবর্তী কাজের বিকল্পের প্রতিশ্রুতির মধ্যে, কিছু সংস্থা তাদের অবস্থান পরিবর্তন করেছে, যার ফলে কর্মচারীদের বিরক্তি দেখা দিয়েছে। নিবন্ধটি সুপারিশ করে যে কর্মচারীরা তাদের পছন্দসই কাজের শৈলীর সাথে সামঞ্জস্যপূর্ণ সংস্থাগুলি বেছে নিতে পারে।",
      "এছাড়াও দূরবর্তী কাজের নীতি এবং এতে পরিবর্তনের পরিণতি অন্তর্ভুক্ত করার জন্য চুক্তিগুলি আপডেট করার প্রয়োজনীয়তা নিয়ে আলোচনা করা হয়েছে। অ্যামাজন, গুগল, লিফট এবং ফেসবুকের মতো সংস্থাগুলি এবং কর্মীদের সম্ভাব্য কাজের জন্য স্থানান্তরিত করার প্রয়োজন রয়েছে।"
    ],
    "points": 844,
    "commentCount": 825,
    "retryCount": 0,
    "time": 1696260490
  },
  {
    "id": 37737519,
    "title": "Python 3.12",
    "originLink": "https://www.python.org/downloads/release/python-3120/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37737519",
    "commentBody": "",
    "originSummary": [
      "পাইথন 3.12.0, পাইথন প্রোগ্রামিং ভাষার নতুন প্রধান রিলিজ, তাজা বৈশিষ্ট্য, পারফরম্যান্স অপ্টিমাইজেশন এবং বাগ ফিক্স উপস্থাপন করে।",
      "উল্লেখযোগ্য সংযোজনগুলির মধ্যে রয়েছে উন্নত এফ-স্ট্রিং পার্সিং, বাফার প্রোটোকল সমর্থন, একটি নতুন ডিবাগিং / প্রোফাইলিং এপিআই, উন্নত ত্রুটি বার্তা এবং টাইপ টীকা বৃদ্ধি। রিলিজটি সামগ্রিক পারফরম্যান্স 5% বৃদ্ধি আশা করে।",
      "রিলিজের সাথে বিভিন্ন অপারেটিং সিস্টেমের জন্য তৈরি ডকুমেন্টেশন, সংস্থান এবং ইনস্টলেশন ফাইল রয়েছে।"
    ],
    "commentSummary": [
      "আলোচনাগুলি পাইথন 3.12 এর নতুন উন্নতি এবং কোয়ার্গগুলির ব্যবহার সহ বিভিন্ন পাইথন প্রোগ্রামিং দিকগুলি ঘিরে আবর্তিত হয় - ফাংশন কলগুলিতে কীওয়ার্ড যুক্তি পাস করার জন্য একটি কনভেনশন।",
      "বিতর্কটি গতিশীল টাইপিংয়ের উপরও ওজন করে, এমন একটি বৈশিষ্ট্য যা পাইথনকে রানটাইমে পরিবর্তনশীল টাইপ নির্ধারণ করতে দেয়।",
      "প্রোগ্রামিং আপডেটে রাজনৈতিক মন্তব্যের অন্তর্ভুক্তি আরেকটি বিতর্কিত বিষয়, প্রযুক্তি সম্প্রদায়ের মতামতের বৈচিত্র্যকে তুলে ধরে।"
    ],
    "points": 610,
    "commentCount": 302,
    "retryCount": 0,
    "time": 1696251698
  },
  {
    "id": 37736318,
    "title": "আইফোন 4 ব্যবহার",
    "originLink": "https://axleos.com/exploiting-the-iphone-4-part-1-gaining-entry/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37736318",
    "commentBody": "",
    "originSummary": [
      "লেখক আইফোন 4 এ ইনস্টল করা আইওএস 4 এর জন্য 'গালা' নামে একটি জেলব্রেক তৈরি করেছেন এবং বিল্ড প্রক্রিয়াটি নথিভুক্ত করে একটি বিশদ ছয়-অংশের সিরিজও তৈরি করেছেন।",
      "'গালা' একটি পাইথন অ্যাপ্লিকেশন, কোকো জিইউআই, রাস্ট পেলোড, কোকো টাচ গেমস এবং সি ইউটিলিটিরয়েছে, যা আইফোন 4 এর জেলব্রেকিংয়ের জন্য একটি বিস্তৃত স্যুট সরবরাহ করে।",
      "লেখক সোর্স কোড এবং ডকুমেন্টেশনগুলি সমালোচনা এবং পরীক্ষার জন্য সর্বজনীনভাবে উপলব্ধ করেছেন, প্রকল্পের প্রতি তাদের উত্সাহ ভাগ করে নিয়েছেন যেহেতু তারা জেলব্রোকেন ফোনগুলির জন্য টুইক তৈরি করত।"
    ],
    "commentSummary": [
      "এই পোস্টটি পাইথন অ্যাপ্লিকেশন, গ্রাফিকাল ইউজার ইন্টারফেস, একটি রাস্ট পেলোড এবং ডিভাইসে ইউটিলিটিগুলির ব্যবহার সহ আইফোন 4 এর জন্য জেলব্রেক বিকাশের সাথে জড়িত লেখকের যাত্রা এবং জটিলতার বিশদ বিবরণ দেয়।",
      "মন্তব্যগুলিতে আলোচনাগুলি পুরানো আইফোনগুলি থেকে ডেটা নিষ্কাশন, দুর্বলতা শোষণ এবং অ্যান্ড্রয়েড ডিভাইসের জন্য সরঞ্জামগুলির তুলনার উপর দৃষ্টি নিবদ্ধ করে।",
      "অবশেষে, লেখক স্মার্টফোনের বর্তমান অবস্থার সমালোচনা করেছেন এবং মূল এসই আইফোনের প্রতি তাদের অনুরাগ দেখিয়েছেন। ওয়াই কম্বিনেটর (ওয়াইসি) উইন্টার 2024 রাউন্ডের জন্য অ্যাপ্লিকেশনগুলির উল্লেখ উচ্চাকাঙ্ক্ষী বিকাশকারীদের জন্য সম্ভাব্য সুযোগগুলি নির্দেশ করে।"
    ],
    "points": 472,
    "commentCount": 51,
    "retryCount": 0,
    "time": 1696242477
  },
  {
    "id": 37739028,
    "title": "কে নিয়োগ দিচ্ছে? (অক্টোবর ২০২৩)",
    "originLink": "https://news.ycombinator.com/item?id=37739028",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37739028",
    "commentBody": "",
    "originSummary": [
      "অবস্থান, দূরবর্তী কাজের সুযোগ, ইন্টার্নশিপ এবং ভিসা প্রয়োজনীয়তা সহ বিশদ বিবরণ স্পষ্টভাবে বর্ণনা করে এই পোস্টটি সংস্থাগুলির চাকরির উদ্বোধন প্রকাশকরার জন্য একটি প্ল্যাটফর্ম।",
      "পাঠকদের ব্যক্তিগতভাবে আগ্রহী হলে চাকরির পোস্টের সাথে জড়িত হতে এবং তালিকাভুক্ত চাকরিসম্পর্কে অভিযোগ জমা দেওয়া থেকে বিরত থাকতে উত্সাহিত করা হচ্ছে।",
      "পোস্টটি বিভিন্ন চাকরি অনুসন্ধান ওয়েবসাইটগুলির জন্য সুপারিশও সরবরাহ করে এবং বিষয় সম্পর্কিত থ্রেডগুলির লিঙ্ক সরবরাহ করে।"
    ],
    "commentSummary": [
      "এই পোস্টটি সফ্টওয়্যার ইঞ্জিনিয়ারিং, প্রোডাক্ট ম্যানেজমেন্ট এবং ডেটা সায়েন্সের মতো বিভিন্ন শিল্পে বিস্তৃত অসংখ্য সংস্থা থেকে চাকরির শূন্যপদগুলি একত্রিত করে।",
      "উল্লিখিত কোম্পানিগুলির মধ্যে রয়েছে স্পেসএক্স, ডেভিঞ্চি ট্রেডিং, স্টেলার সায়েন্স, ফেল্ট, কিছু রিমোট ওয়ার্ক সরবরাহ করে এবং অন্যদের সাইটে উপস্থিতি প্রয়োজন।",
      "পোস্টটি এই পদগুলির জন্য বেতন ের পরিসীমাগুলিও অনুসন্ধান করে এবং মন্তব্য বিভাগে কর্মসংস্থান আইন সম্পর্কে সমালোচনাগুলি সম্বোধন করে।"
    ],
    "points": 397,
    "commentCount": 391,
    "retryCount": 0,
    "time": 1696258928
  },
  {
    "id": 37740468,
    "title": "মাইক্রোসফ্ট ডিফেন্ডার টর ব্রাউজারকে ট্রোজান হিসাবে ফ্ল্যাগ করছিল এবং এটি সরিয়ে ফেলছিল",
    "originLink": "https://deform.co/microsoft-defender-flags-tor-browser-as-a-trojan-and-removes-it-from-the-system/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37740468",
    "commentBody": "",
    "originSummary": [
      "মাইক্রোসফটের ডিফেন্ডার অ্যান্টিভাইরাস সফটওয়্যার ভুল করে টর ব্রাউজারের সর্বশেষ সংস্করণকে ক্ষতিকর ম্যালওয়্যার হিসেবে চিহ্নিত করে উইন্ডোজ ব্যবহারকারীদের জন্য ভুয়া সতর্কতা তৈরি করছে।",
      "এই সমস্যার সন্দেহজনক কারণ হ'ল একটি নতুন হিউরিস্টিক সনাক্তকরণ পদ্ধতি যা ডিফেন্ডার ব্যবহার করে।",
      "টরের প্রতিনিধিরা ব্রাউজারের ডাউনলোড উত্স যাচাই করার এবং মাইক্রোসফ্টের বর্জন তালিকায় টর যুক্ত করার পরামর্শ দেন। বর্তমানে মাইক্রোসফট এ বিষয়ে আনুষ্ঠানিককোনো প্রতিক্রিয়া জানায়নি।"
    ],
    "commentSummary": [
      "আলোচনাটি মাইক্রোসফ্ট ডিফেন্ডারের চ্যালেঞ্জ এবং ত্রুটিগুলির উপর দৃষ্টি নিবদ্ধ করে, যার মধ্যে রয়েছে এর ঘন ঘন মিথ্যা ইতিবাচক সনাক্তকরণ এবং এর রিয়েল-টাইম সুরক্ষাকে বাইপাস বা অক্ষম করার অসুবিধা।",
      "অ্যান্টিভাইরাস সফ্টওয়্যারের সাধারণ কার্যকারিতা সম্পর্কে যথেষ্ট ব্যবহারকারীর হতাশা রয়েছে এবং কর্তৃত্ববাদী শাসকদের দ্বারা এর সম্ভাব্য অপব্যবহার সম্পর্কে উদ্বেগ রয়েছে।",
      "এটি সংক্ষেপে নতুন উইন্ডোজ 11 অপারেটিং সিস্টেমে ফায়ারফক্স ইনস্টল করার অসুবিধা এবং উইন্ডোজের অব্যাহত ব্যবহারে বিস্ময়ের একটি উপাদান উল্লেখ করে।"
    ],
    "points": 382,
    "commentCount": 122,
    "retryCount": 0,
    "time": 1696264153
  },
  {
    "id": 37740932,
    "title": "মনোযোগ সিঙ্ক সহ দক্ষ স্ট্রিমিং ভাষা মডেল",
    "originLink": "https://github.com/mit-han-lab/streaming-llm",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37740932",
    "commentBody": "",
    "originSummary": [
      "\"স্ট্রিমিং-এলএলএম\" প্রকল্পের লক্ষ্য হ'ল দক্ষতা বা কর্মক্ষমতা ত্যাগ না করে স্ট্রিমিং অ্যাপ্লিকেশনগুলিতে বৃহত ভাষা মডেল (এলএলএম) বাস্তবায়ন করা, মেমরি খরচ এবং দীর্ঘ পাঠ্য পরিচালনার সীমাবদ্ধতাগুলি অতিক্রম করা।",
      "এই প্রকল্পটি মনোযোগ সিঙ্ক এবং স্ট্রিমিংএলএলএম ফ্রেমওয়ার্কের ধারণাটি প্রবর্তন করে, যা এলএলএমগুলিকে ফাইন-টিউনিংয়ের প্রয়োজন ছাড়াই অসীম দৈর্ঘ্যের ইনপুটগুলি পরিচালনা করতে দেয়। এই পদ্ধতিটি গতি এবং স্থিতিশীলতায় অন্যান্য কৌশলগুলিকে ছাড়িয়ে যায়, তবে এটি বিস্তৃত পাঠ্যগুলির সংক্ষিপ্তসারের জন্য আদর্শ নয়।",
      "প্রকল্পটি ভবিষ্যতে কোড, ডেটা এবং মূল্যায়ন সরঞ্জামগুলি প্রকাশকরার পরিকল্পনা করে এবং স্ট্রিমিংএলএলএম ফ্রেমওয়ার্ক ব্যবহারকরতে আগ্রহীদের জন্য তাদের কাগজের উদ্ধৃতি উত্সাহিত করে।"
    ],
    "commentSummary": [
      "গবেষকরা মনোযোগ সিঙ্কগুলির সাথে সজ্জিত একটি নতুন স্ট্রিমিং ভাষা মডেল তৈরি করেছেন, যা পুনঃগণনা ব্যয়ের পরিবর্তে ক্যাশে পুনরায় ব্যবহার করে দক্ষতা বাড়ায়।",
      "এই মডেলটি প্রাথমিক টোকেনগুলিতে যথেষ্ট মনোযোগ স্কোর বরাদ্দ করে, এর বিভ্রান্তি বজায় রেখে পাঠযোগ্য পাঠ্যের উত্পাদন নিশ্চিত করে। মডেলটি সম্ভাব্যভাবে অসীম ক্রম দৈর্ঘ্য পরিচালনা করতে পারে, যদিও এই বৈশিষ্ট্যটির কার্যকারিতা এখনও নিশ্চিত করা হয়নি।",
      "লুপিং ক্ষমতার মতো উন্নতির প্রস্তাবগুলির সাথে বিদ্যমান ভাষা মডেল মডেলগুলির (এলএলএম) সীমাবদ্ধতা সম্পর্কে চলমান আলোচনা চলছে। আশা করা হচ্ছে শীঘ্রই এই নতুন মডেলটি সর্বজনীনভাবে অ্যাক্সেসযোগ্য প্ল্যাটফর্মে আপলোড করা হবে।"
    ],
    "points": 381,
    "commentCount": 63,
    "retryCount": 0,
    "time": 1696265764
  },
  {
    "id": 37746717,
    "title": "ন্যাশনাল অ্যাসোসিয়েশন অফ রিয়েলটারস ছাড়ছেন রেডফিন",
    "originLink": "https://www.redfin.com/news/redfin-is-leaving-nar/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37746717",
    "commentBody": "",
    "originSummary": [
      "ক্রেতার এজেন্টদের জন্য ফি নীতি নিয়ে বিরোধ এবং এনএআর-এর মধ্যে যৌন হয়রানির অভিযোগের কারণে রিয়েল এস্টেট ফার্ম রেডফিন ন্যাশনাল অ্যাসোসিয়েশন অফ রিয়েলটারস (এনএআর) থেকে সমর্থন প্রত্যাহার করছে।",
      "প্রযুক্তি-চালিত মার্কেটপ্লেসের জন্য এনএআর-এর অ্যাডভোকেসিকে প্রভাবিত করার জন্য সংস্থাটি যথেষ্ট পাওনা প্রদান করছিল, তবে এখন তার লক্ষ্য অর্জনের জন্য অন্যান্য উপায় খুঁজছে এবং তার ব্রোকার এবং এজেন্টদের এনএআর ছাড়তে বলছে।",
      "রেডফিন লবিং সংস্থার সমর্থন থেকে তালিকাভুক্ত ডাটাবেসগুলিতে অ্যাক্সেস বিচ্ছিন্ন করার জন্য এনএআরকে চাপ দিচ্ছে তবে তালিকাভুক্ত ডেটা ভাগ করে নেওয়ার জন্য এখনও মাল্টিপল লিস্টিং সার্ভিসেস (এমএলএস) সমর্থন করবে।"
    ],
    "commentSummary": [
      "রিয়েল এস্টেট কোম্পানি রেডফিন কম খরচে উন্নত সেবা চালু করতে ন্যাশনাল অ্যাসোসিয়েশন অব রিয়েলটারস (এনএআর) থেকে বেরিয়ে আসছে, যা রিয়েল এস্টেট এজেন্টদের ভূমিকা এবং তাদের সেবার ব্যয়-কার্যকারিতা সম্পর্কে বিতর্ককে উদ্দীপিত করে।",
      "এই সিদ্ধান্তটি আবাসন সাশ্রয়যোগ্যতা, সরবরাহ এবং চাহিদা, বন্ধক সুদের উপর কর হ্রাস, আবাসন বাজারের স্থায়িত্ব এবং রিয়েল এস্টেট শিল্পে সম্ভাব্য ব্যাঘাত সহ বিষয়গুলিতে বিস্তৃত আলোচনাকে প্রজ্বলিত করেছে।",
      "কথোপকথনে বিভিন্ন মতামত তুলে ধরা হয়েছে, কেউ কেউ বাড়ির দাম এবং বাড়ির মালিকানার মুনাফা বৃদ্ধি সম্পর্কে সন্দেহ প্রকাশ করেছেন, অন্যরা রিয়েলটারদের গুরুত্বপূর্ণ ভূমিকা এবং তাদের দেওয়া মূল্যের উপর জোর দিয়েছেন। আইনি সমস্যা, সম্ভাব্য বাজার একচেটিয়া এবং রিয়েল এস্টেট শিল্পের সাথে যুক্ত যৌন নিপীড়নের অভিযোগ সম্পর্কেও উদ্বেগ উত্থাপিত হয়।"
    ],
    "points": 362,
    "commentCount": 272,
    "retryCount": 0,
    "time": 1696295865
  },
  {
    "id": 37739233,
    "title": "অদ্ভুত এ.আই. ইয়ানকোভিচ: ভয়েস ক্লোনিংয়ের জগতে একটি অভিশপ্ত গভীর ডুব",
    "originLink": "https://waxy.org/2023/10/weird-ai-yankovic-voice-cloning/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37739233",
    "commentBody": "",
    "originSummary": [
      "নিবন্ধটি কৃত্রিম বুদ্ধিমত্তার (এআই) মাধ্যমে ভয়েস ক্লোনিংয়ের দিকে মনোনিবেশ করে, বিভিন্ন শিল্পীদের দ্বারা পরিবেশিত অদ্ভুত আল ইয়ানকোভিচ গানের এআই-উত্পাদিত কভারগুলির উত্পাদনের দিকে মনোনিবেশ করে।",
      "এটি এআই ভয়েস ক্লোনিং সম্প্রদায়, ডিসকর্ড এবং হাগিং ফেসের মতো প্ল্যাটফর্মগুলি এবং এই প্রযুক্তির ব্যবহারের সাথে যুক্ত নৈতিক এবং আইনী বিষয়গুলি নিয়ে আলোচনা করে।",
      "সঙ্গীত শিল্প দ্বারা এআই ভোকালগুলির বাণিজ্যিক ব্যবহারের উপর সম্ভাব্য দমন সত্ত্বেও, এআই-উত্পাদিত সংগীতের সৃষ্টি এবং সম্প্রসারণ অব্যাহত রয়েছে।"
    ],
    "commentSummary": [
      "নিবন্ধটি ভয়েস ক্লোনিং প্রযুক্তির প্রভাব অন্বেষণ করে, ভয়েস অভিনেতাদের জন্য সম্ভাব্য চাকরির স্থানচ্যুতি এবং এআই-উত্পাদিত ভয়েসের মালিকানার আশেপাশের আইনি সমস্যাগুলি উল্লেখ করে।",
      "এই নিবন্ধটি এআই-উত্পন্ন কণ্ঠস্বরসম্পর্কে বিভিন্ন মতামতও অন্তর্ভুক্ত করে, কিছু গতিশীল ভয়েস লাইন এবং স্কেলেবিলিটির মতো সুবিধার উপর জোর দেয়, অন্যরা কৃত্রিমতা এবং সম্ভাব্য অপব্যবহারের ভয়ের দিকে মনোনিবেশ করে।",
      "আলোচনায় অডিও ও মিউজিক ম্যানিপুলেশনে এআই ব্যবহার, বিভিন্ন প্ল্যাটফর্মের আকর্ষণ এবং কৃত্রিম বুদ্ধিমত্তার বর্তমান সীমাবদ্ধতা অন্তর্ভুক্ত রয়েছে।"
    ],
    "points": 285,
    "commentCount": 165,
    "retryCount": 0,
    "time": 1696259742
  },
  {
    "id": 37744350,
    "title": "এফডিএ কর্তৃক অনুমোদিত কয়েক ডজন বংশগত ক্যান্সারের জন্য প্রথম রক্ত পরীক্ষা",
    "originLink": "https://www.insideprecisionmedicine.com/topics/oncology/first-blood-test-for-dozens-of-hereditary-cancers-approved-by-fda/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37744350",
    "commentBody": "",
    "originSummary": [
      "এফডিএ প্রথম রক্ত পরীক্ষা, ইনভিটা সাধারণ বংশগত ক্যান্সার প্যানেলকে অনুমোদন দিয়েছে, যা নির্দিষ্ট ক্যান্সারের উচ্চ ঝুঁকির সাথে যুক্ত জিনগত রূপগুলি সনাক্ত করতে সক্ষম।",
      "প্যানেলটি 47 টি জিনের ডিএনএ রূপগুলি বিশ্লেষণ করতে পরবর্তী প্রজন্মের সিকোয়েন্সিং ব্যবহার করে এবং রোগী এবং স্বাস্থ্যসেবা সরবরাহকারীদের জন্য ক্যান্সারের ব্যক্তিগতকৃত ঝুঁকি মূল্যায়নের জন্য একটি নতুন পদ্ধতি সরবরাহ করে।",
      "এই অগ্রগতি সত্ত্বেও, এখনও মিথ্যা ইতিবাচক বা মিথ্যা নেতিবাচক ফলাফলের ঝুঁকি রয়েছে এবং পরীক্ষার ফলাফলগুলির ভুল বোঝাবুঝির সম্ভাবনা রয়ে গেছে।"
    ],
    "commentSummary": [
      "এফডিএ বংশগত ক্যান্সারের জন্য প্রথম রক্ত পরীক্ষার সবুজ সংকেত দিয়েছে, ইনভিটার একটি উদ্ভাবন, যা সম্ভাব্যভাবে বীমা প্রতিদানের সুযোগ বাড়িয়ে তুলতে পারে।",
      "জেনেটিক পরীক্ষার জন্য বীমা কভার, প্রতিরোধমূলক সার্জারি সম্পর্কে সিদ্ধান্ত, প্রাথমিক ক্যান্সার সনাক্তকরণের পরিমাণ, জিনগত বৈষম্য সুরক্ষা এবং জেনেটিক ডেটার সাথে যুক্ত আর্থিক দিকগুলি সম্পর্কিত চলমান বিতর্ক রয়েছে।",
      "অন্যান্য সম্পর্কিত আলোচনার মধ্যে রয়েছে জেনেটিক পরীক্ষার ব্যয় এবং প্রয়োগ, ইনভিটা এবং 23এন্ডএমই পদ্ধতির মধ্যে তুলনা, গ্রেইলের গ্যালেরি পরীক্ষা, ইনভিটের কর্পোরেট চ্যালেঞ্জ, রক্ত-ভিত্তিক পরীক্ষার যোগ্যতা, ডিএনএ সিকোয়েন্সিং পরীক্ষার অ্যাক্সেসযোগ্যতা এবং মূল্য নির্ধারণ, জেনেটিক পরীক্ষা এবং ভ্রূণ নির্বাচনের নৈতিকতা এবং ওয়াইসি উইন্টার 2024 এর জন্য অ্যাপ্লিকেশনগুলির প্রাপ্যতা।"
    ],
    "points": 282,
    "commentCount": 104,
    "retryCount": 0,
    "time": 1696280542
  },
  {
    "id": 37744114,
    "title": "ডেভেলপারদের জন্য একটি আহ্বান - জেলিফিন",
    "originLink": "https://jellyfin.org/posts/a-call-for-developers/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37744114",
    "commentBody": "",
    "originSummary": [
      "জেলিফিন প্রকল্প, একটি ওপেন সোর্স মিডিয়া স্ট্রিমিং সার্ভার, প্রোগ্রাম বিকাশের জন্য আরও ডেভেলপার এবং অবদানকারী নিয়োগ করছে।",
      "বর্তমান দলটি, প্রাথমিকভাবে স্বেচ্ছাসেবক, অবদানকারীদের একটি ছোট বেসের কারণে পাতলা প্রসারিত হয়েছে, যার ফলে সফ্টওয়্যার সীমাবদ্ধতা এবং বাগ রয়েছে।",
      "বিভিন্ন অভিজ্ঞ ডেভেলপার, লেখক, ডিজাইনার এবং উত্সাহীদের কাছ থেকে সহায়তা চাওয়ার মাধ্যমে, জেলিফিন ব্যবহারকারীর উদ্বেগগুলি সমাধান করতে এবং শীর্ষ স্ট্রিমিং সার্ভার হওয়ার চেষ্টা করার লক্ষ্য রাখে।"
    ],
    "commentSummary": [
      "জেলিফিন প্রকল্পটি ডেভেলপারদের কাছ থেকে অবদান চাইছে এবং এটি এই পোস্টের কেন্দ্রীয় বিষয়। জেলিফিন একটি ওপেন সোর্স মিডিয়া সিস্টেম।",
      "ব্যবহারকারীরা জেলিফিনের ক্লায়েন্টদের সাথে তাদের অভিজ্ঞতা নিয়ে আলোচনা করেছেন, অডিও সমর্থন সীমাবদ্ধতা এবং ট্রান্সকোডিং সমস্যার মতো চ্যালেঞ্জগুলি উল্লেখ করেছেন।",
      "ব্যক্তিগত মিডিয়া ব্যবহারের জন্য জেলিফিনের মতো অ্যাপ্লিকেশনগুলি ব্যবহারের আইনি প্রভাবগুলি অন্বেষণ করা হয়, সম্ভাব্য আইনি সীমাবদ্ধতা এবং তাদের প্রভাবগুলি সম্পর্কে প্রয়োজনীয় অন্তর্দৃষ্টি সরবরাহ করে।"
    ],
    "points": 266,
    "commentCount": 100,
    "retryCount": 0,
    "time": 1696279230
  },
  {
    "id": 37737318,
    "title": "ওপেন-সোর্স অবশেষে বিশ্বের মাইক্রোস্কোপগুলি একই ভাষায় কথা বলতে পারে",
    "originLink": "https://www.nature.com/articles/d41586-023-03064-9",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37737318",
    "commentBody": "",
    "originSummary": [
      "বিজ্ঞানীরা জৈবিক মাইক্রোস্কোপি ডেটার জন্য একটি সার্বজনীন ফাইল ফর্ম্যাট ওএমই-জার বিকাশে কাজ করছেন, যার লক্ষ্য অ্যাক্সেসযোগ্যতা বৃদ্ধি এবং সহযোগিতা উন্নত করা।",
      "বর্তমানে, 160 টি বিভিন্ন ফাইল ফর্ম্যাট রয়েছে যা ডেটা ভাগ করে নেওয়া এবং যাচাইকরণকে বাধা দেয়, উদ্দেশ্য এই সংখ্যাটি উল্লেখযোগ্যভাবে হ্রাস করা।",
      "যাইহোক, বৃহত্তর বৈজ্ঞানিক সম্প্রদায়ের দিকনির্দেশনা এবং সমর্থন সহ মানসম্মত ফর্ম্যাটগুলি বাস্তবায়নের জন্য গবেষক, প্রকাশক এবং বিক্রেতাদের কাছ থেকে সাংস্কৃতিক পরিবর্তন এবং যৌথ প্রচেষ্টার দাবি রয়েছে।"
    ],
    "commentSummary": [
      "জার ওপেন-সোর্স ফর্ম্যাট, সাধারণত বড় আকারের জলবায়ু বিজ্ঞান ডেটা স্টোরেজ এবং বিশ্লেষণের জন্য ব্যবহৃত হয়, বৈজ্ঞানিক ক্ষেত্রে অপর্যাপ্ত তহবিল এবং পুনরুত্পাদনের চ্যালেঞ্জগুলির উদ্বেগের মুখোমুখি হয়।",
      "মাইক্রোস্কোপি ডেটা সঞ্চয় এবং ভাগ করার জন্য একটি নতুন ফর্ম্যাট, ওএমই-জার, চালু করা হয়েছে, যার লক্ষ্য বিভিন্ন প্রচেষ্টা একত্রিত করা এবং আন্তঃক্রিয়তা বাড়ানো। সমালোচকরা এর প্রয়োজনীয়তা নিয়ে প্রশ্ন তোলেন, যখন এর সমর্থকরা মেটা-অধ্যয়ন এবং নতুন ব্যবহারের কেস আবিষ্কারের জন্য এর সম্ভাবনাকে তুলে ধরেন।",
      "চিত্র ডেটার জন্য স্ট্যান্ডার্ডাইজেশন এবং একটি একক বিন্যাসের উপর জোর দেওয়া হয়। বিদ্যমান ফর্ম্যাটগুলির সীমাবদ্ধতা এবং ডেটা অখণ্ডতা সুরক্ষিত করার প্রয়োজনীয়তা নিয়ে আলোচনা করা হয়েছে। বিবেচনার মধ্যে রয়েছে ক্ষতিগ্রস্থ সংকোচন গ্রহণ এবং চিত্র ডেটার স্বয়ংক্রিয় রূপান্তর।"
    ],
    "points": 236,
    "commentCount": 60,
    "retryCount": 0,
    "time": 1696250396
  },
  {
    "id": 37743759,
    "title": "মৃত দাদী লকেট নিরাপত্তা ধাঁধা সমাধানে বিং চ্যাটের এআই কে কৌশলী করার অনুরোধ করেছেন",
    "originLink": "https://arstechnica.com/information-technology/2023/10/sob-story-about-dead-grandma-tricks-microsoft-ai-into-solving-captcha/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37743759",
    "commentBody": "",
    "originSummary": [
      "একজন ব্যবহারকারী মাইক্রোসফ্টের বিং চ্যাট এআই ব্যবহার করে একটি লকেটের একটি চিত্র আপলোড করে এবং এর প্রেক্ষাপট পরিবর্তন করে ক্যাপচা সমাধান করে, এটি ক্যাপচা হিসাবে সনাক্ত করতে এআই য়ের ব্যর্থতা প্রদর্শন করে।",
      "এই কৌশলটি এআই চ্যাটবট এবং অত্যাধুনিক ভাষা মডেলগুলিতে একটি বিশিষ্ট দুর্বলতা প্রকাশ করে, তাদের স্বীকৃতি ক্ষমতাগুলি প্রসঙ্গ ম্যানিপুলেশনের জন্য সংবেদনশীল।",
      "এখন পর্যন্ত মাইক্রোসফট এ বিষয়ে কোনো মন্তব্য করেনি।"
    ],
    "commentSummary": [
      "আলোচনাটি ক্যাপচা সিস্টেমগুলির শক্তি এবং দুর্বলতাগুলি কেন্দ্র করে, যা এআই-এর মাধ্যমে মানুষকে সনাক্ত করার দায়িত্ব দেওয়া হয়েছে।",
      "সম্ভাব্য প্রতিকার এবং বিকল্পগুলি নিয়ে আলোচনাসহ ক্যাপচা সিস্টেমগুলির ম্যানিপুলেশনের সংবেদনশীলতা সম্পর্কে উদ্বেগের প্রকাশ রয়েছে।",
      "অংশগ্রহণকারীরা অ্যাক্সেসযোগ্যতা এবং সামাজিক নিয়মের উপর এআই প্রযুক্তির বিস্তৃত প্রভাবগুলিও অনুসন্ধান করে।"
    ],
    "points": 215,
    "commentCount": 135,
    "retryCount": 0,
    "time": 1696277393
  },
  {
    "id": 37737651,
    "title": "Chromebook Plus",
    "originLink": "https://blog.google/products/chromebooks/chromebook-plus/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37737651",
    "commentBody": "",
    "originSummary": [
      "গুগল ক্রোমবুক প্লাস নামে পরিচিত ক্রোমবুকগুলির একটি নতুন বিভাগ ঘোষণা করেছে, যা দ্বিগুণ পারফরম্যান্স, সমন্বিত গুগল অ্যাপ্লিকেশন এবং শক্তিশালী এআই ক্ষমতা সরবরাহ করবে।",
      "ক্রোমবুক প্লাস ল্যাপটপে দ্রুত প্রসেসর, দ্বিগুণ মেমরি এবং স্টোরেজ, একটি ফুল এইচডি আইপিএস ডিসপ্লে এবং এআই-অগমেন্টেড ভিডিও কল উন্নতিসহ একটি 1080 পি ক্যামেরা থাকবে এবং অ্যাডোব ফটোশপ এবং লুমাফিউশনের মতো সৃজনশীল-কেন্দ্রিক অ্যাপ্লিকেশনগুলিকে সমর্থন করবে।",
      "গুগল ক্রোমবুক প্লাসে আরও বৈশিষ্ট্য সংহত করার লক্ষ্য নিয়েছে, যার মধ্যে বর্ধিত কৃত্রিম বুদ্ধিমত্তা ক্ষমতা এবং চিত্র উত্পাদন অন্তর্ভুক্ত রয়েছে, যা 8 অক্টোবর, 2023 থেকে ক্রয়ের জন্য উপলব্ধ।"
    ],
    "commentSummary": [
      "উন্নত হার্ডওয়্যার এবং এআই বৈশিষ্ট্যযুক্ত আপগ্রেড ক্রোমবুক সহ গুগল নতুন ল্যাপটপ চালু করেছে, যা তাদের ব্যবহার এবং কার্যকারিতা সম্পর্কে বিতর্ক ের জন্ম দিয়েছে।",
      "ব্যবহারকারীরা স্মার্টওয়াচের সাথে ইন্টিগ্রেশন, সেলুলার বিকল্পগুলির কাঙ্ক্ষিত অন্তর্ভুক্তি সম্পর্কে উদ্বেগ প্রকাশ করে, কেউ কেউ মোবাইল ডিভাইস টিথারিংয়ের পক্ষে এবং ক্রোমবুকগুলিতে এআই বৈশিষ্ট্যগুলির প্রাসঙ্গিকতার পক্ষে।",
      "কোডিং বা সফ্টওয়্যার ডেভেলপমেন্ট কাজের জন্য ক্রোমবুকের উপযুক্ততা, ইন্টেল আই 3 প্রসেসরের কর্মক্ষমতা, নিক্সওএসের সুবিধা এবং গোপনীয়তা উদ্বেগ সম্পর্কে মিশ্র মতামত পাওয়া গেছে।"
    ],
    "points": 193,
    "commentCount": 281,
    "retryCount": 0,
    "time": 1696252523
  },
  {
    "id": 37737599,
    "title": "ব্রেক-এ-দৃশ্য: একক চিত্র থেকে একাধিক ধারণা বের করা",
    "originLink": "https://omriavrahami.com/break-a-scene/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37737599",
    "commentBody": "",
    "originSummary": [
      "লেখকরা \"ব্রেক-এ-সিন\" প্রবর্তন করেছেন, একটি পদ্ধতি যা একক চিত্র থেকে অসংখ্য ধারণা বের করতে এবং বিভিন্ন প্রেক্ষাপটে নতুন চিত্র তৈরি করতে প্রাকৃতিক ভাষা নির্দেশিকা ব্যবহার করতে সক্ষম।",
      "তারা পাঠ্য দৃশ্য পচনের কাজটি উপস্থাপন করে এবং পাঠ্য টোকেন এবং মডেল ওজন উভয়ই অপ্টিমাইজ করার জন্য একটি দ্বি-ফেজ কাস্টমাইজেশন প্রক্রিয়া জড়িত। ধারণা সংমিশ্রণের উন্নত প্রজন্মের জন্য একটি অভিনব প্রশিক্ষণ কৌশল, \"ইউনিয়ন-নমুনা\" চালু করা হয়েছে।",
      "পদ্ধতিটির বেশ কয়েকটি অ্যাপ্লিকেশন প্রদর্শনের পাশাপাশি স্বয়ংক্রিয় মেট্রিক্স এবং একটি ব্যবহারকারী অধ্যয়ন উভয়ের মাধ্যমে পদ্ধতির একটি মূল্যায়ন পরিচালিত হয়েছে।"
    ],
    "commentSummary": [
      "পাঠ্যটি একটি নতুন এআই প্রযুক্তি, ব্রেক-এ-সিনকে কভার করে, একক চিত্র থেকে একাধিক ধারণা বের করার ক্ষমতা সহ, ফটোগ্রাফি এবং ফিল্ম মেকিং এর মতো শিল্পের রূপান্তরের সম্ভাবনা দেখায়।",
      "মতামত বিভক্ত, কেউ কেউ শক্তিশালী ওয়ার্কফ্লো বৃদ্ধি এবং প্রসারিত শৈল্পিক সংস্থানগুলিকে স্বাগত জানায়, তবে অন্যরা ঐতিহ্যগত ফটোগ্রাফির মূল্যের উপর প্রভাব সম্পর্কে উদ্বেগ দেখায়।",
      "সম্ভাব্য ব্যবহারের ঘটনাগুলি নিয়ে আলোচনা করা ছাড়াও, নিবন্ধটি মানব সংস্কৃতি এবং ফটোগ্রাফির মৌলিক ধারণার উপর এর প্রভাবগুলি তুলে ধরেছে, উল্লেখ করেছে যে প্রযুক্তিটি গিটহাবের মাধ্যমে অ্যাক্সেসযোগ্য এবং গুগল গবেষণা পত্রে স্বীকৃত।"
    ],
    "points": 185,
    "commentCount": 35,
    "retryCount": 0,
    "time": 1696252243
  },
  {
    "id": 37739026,
    "title": "কে নিয়োগ পেতে চায়? (অক্টোবর ২০২৩)",
    "originLink": "https://news.ycombinator.com/item?id=37739026",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37739026",
    "commentBody": "",
    "originSummary": [
      "বার্তাটি চাকরি প্রার্থীদের তাদের তথ্য ভাগ করে নেওয়ার আহ্বান জানাচ্ছে, একটি প্রদত্ত ফর্ম্যাট অনুসরণ করে যেখানে অবস্থান, স্থানান্তরের ইচ্ছা, দক্ষতা সেট, সিভি এবং ইমেল ঠিকানার মতো মানদণ্ডউল্লেখ করা হয়েছে।",
      "এটি নিশ্চিত করে যে প্রদত্ত ইমেল ঠিকানাগুলির মাধ্যমে যে কোনও যোগাযোগ কঠোরভাবে কর্মসংস্থানের সুযোগগুলির সাথে সম্পর্কিত হওয়া উচিত।",
      "এই পোস্টটি একটি নির্দিষ্ট ক্ষেত্রে শিল্প পেশাদারদের নিয়োগ ের জন্য নিয়োগকর্তাদের জন্য একটি অনুসন্ধানযোগ্য ডাটাবেস হিসাবে কাজ করে।"
    ],
    "commentSummary": [
      "এই পোস্টটি সফ্টওয়্যার ইঞ্জিনিয়ারিং, ডেটা সায়েন্স এবং প্রোডাক্ট ম্যানেজমেন্ট সহ বিভিন্ন ডোমেনে চাকরির সুযোগ খুঁজছেন এমন ব্যক্তিদের একটি সংগ্রহ।",
      "এই ব্যক্তিরা দূরবর্তীভাবে কাজ করার সাথে নমনীয়, সম্ভাব্য নিয়োগ পুল প্রসারিত করে।",
      "তারা তাদের জীবনবৃত্তান্ত এবং যোগাযোগের বিবরণের লিঙ্ক গুলি অন্তর্ভুক্ত করেছে, সম্ভাব্য নিয়োগকর্তাদের কাছে পৌঁছানোর প্রক্রিয়াটি সহজ তর করেছে।"
    ],
    "points": 183,
    "commentCount": 350,
    "retryCount": 0,
    "time": 1696258927
  }
]
