[
  {
    "id": 37739376,
    "title": "العودة إلى المكتب هراء والجميع يعرف ذلك",
    "originLink": "https://soatok.blog/2023/10/02/return-to-office-is-bullshit-and-everyone-knows-it/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37739376",
    "commentBody": "",
    "originSummary": [
      "يفصل المؤلف تجربتهم السلبية فيما يتعلق بترك وظائفهم بسبب سياسات العودة القسرية للمكتب ، مما يشير إلى أنها قد تؤدي إلى انخفاض الروح المعنوية وفقدان المواهب.",
      "قد تكافح الشركات التي تفرض سياسات الإرجاع لتوظيف الموظفين والاحتفاظ بهم في المستقبل ، وفقا لتوقعات المؤلف.",
      "يثير المنشور أيضا القلق بشأن موظفي تأشيرة H-1B وينتقد الشركات لتجاهلها مزايا العمل عن بعد وتفضيلات الموظفين. أثار منظور المؤلف نقاشا."
    ],
    "commentSummary": [
      "يركز المقال على عدم الرضا بين العاملين في صناعة التكنولوجيا فيما يتعلق بعودة الشركات إلى العمل الشخصي ، بعد التحول إلى العمل عن بعد أثناء الوباء.",
      "وسط وعود بخيار دائم للعمل عن بعد ، غيرت بعض الشركات موقفها ، مما أدى إلى استياء الموظفين. توصي المقالة الموظفين باختيار الشركات التي تتماشى مع أسلوب العمل المفضل لديهم.",
      "كما تمت مناقشة الحاجة إلى تحديث العقود لتشمل سياسات العمل عن بعد وعواقب التغييرات فيها. تم ذكر شركات مثل Amazon و Google و Lyft و Facebook ، واستعلام الموظفين الذين يحتمل أن يحتاجوا إلى الانتقال للعمل."
    ],
    "points": 844,
    "commentCount": 825,
    "retryCount": 0,
    "time": 1696260490
  },
  {
    "id": 37737519,
    "title": "بايثون 3.12",
    "originLink": "https://www.python.org/downloads/release/python-3120/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37737519",
    "commentBody": "",
    "originSummary": [
      "تقدم Python 3.12.0 ، أحدث إصدار رئيسي من لغة برمجة Python ، ميزات جديدة وتحسينات في الأداء وإصلاحات للأخطاء.",
      "تشمل الإضافات المهمة تحليل f-string المحسن ، ودعم بروتوكول المخزن المؤقت ، وواجهة برمجة تطبيقات جديدة لتصحيح الأخطاء / التنميط ، ورسائل خطأ محسنة ، وتحسينات التعليقات التوضيحية للكتابة. يتوقع الإصدار أيضا زيادة الأداء العام بنسبة 5٪.",
      "يرافق الإصدار الوثائق والموارد وملفات التثبيت المصممة خصيصا لأنظمة التشغيل المختلفة."
    ],
    "commentSummary": [
      "تدور المناقشات حول جوانب برمجة Python المختلفة ، بما في ذلك التحسينات الجديدة في Python 3.12 واستخدام kwargs - وهو اصطلاح لتمرير وسيطات الكلمات الرئيسية في استدعاءات الوظائف.",
      "يؤثر النقاش أيضا على الكتابة الديناميكية ، وهي ميزة تسمح ل Python بتحديد نوع المتغير في وقت التشغيل.",
      "يعد إدراج التعليقات السياسية في تحديثات البرمجة موضوعا آخر تمت مناقشته ، مما يسلط الضوء على تنوع الآراء في مجتمع التكنولوجيا."
    ],
    "points": 610,
    "commentCount": 302,
    "retryCount": 0,
    "time": 1696251698
  },
  {
    "id": 37736318,
    "title": "استغلال الايفون 4",
    "originLink": "https://axleos.com/exploiting-the-iphone-4-part-1-gaining-entry/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37736318",
    "commentBody": "",
    "originSummary": [
      "قام المؤلف بإنشاء جيلبريك ، يسمى \"gala\" ، لنظام التشغيل iOS 4 المثبت على iPhone 4 ، كما طور سلسلة مفصلة من ستة أجزاء توثق عملية البناء.",
      "يشتمل \"Gala\" على تطبيق Python و Cocoa GUI و Rust Load وألعاب Cocoa Touch وأدوات C المساعدة ، مما يوفر مجموعة شاملة لكسر حماية iPhone 4.",
      "جعل المؤلف شفرة المصدر والوثائق متاحة للجمهور للنقد والاختبار ، وشارك حماسهم تجاه المشروع منذ أن اعتادوا على إنشاء تعديلات للهواتف مكسورة الحماية."
    ],
    "commentSummary": [
      "يوضح هذا المنشور رحلة المؤلف والتعقيد الذي ينطوي عليه تطوير كسر الحماية لجهاز iPhone 4 ، بما في ذلك استخدام تطبيقات Python وواجهة المستخدم الرسومية وحمولة Rust والأدوات المساعدة على الجهاز.",
      "تركز المناقشات في التعليقات على استخراج البيانات من أجهزة iPhone القديمة ، واستغلال الثغرات الأمنية ، ومقارنة الأدوات لأجهزة Android.",
      "أخيرا ، ينتقد المؤلف الوضع الحالي للهواتف الذكية ويظهر ولعهم بجهاز SE iPhone الأصلي. يشير ذكر تطبيقات جولة شتاء 2024 Y Combinator (YC) إلى الفرص المحتملة للمطورين الطموحين."
    ],
    "points": 472,
    "commentCount": 51,
    "retryCount": 0,
    "time": 1696242477
  },
  {
    "id": 37739028,
    "title": "من الذي يوظف؟ (أكتوبر 2023)",
    "originLink": "https://news.ycombinator.com/item?id=37739028",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37739028",
    "commentBody": "",
    "originSummary": [
      "هذا المنشور عبارة عن منصة للشركات لنشر فرص العمل ، وتحديد التفاصيل بوضوح بما في ذلك الموقع وفرص العمل عن بعد والتدريب الداخلي ومتطلبات التأشيرة.",
      "يتم تشجيع القراء على التعامل مع إعلانات الوظائف إذا كانوا مهتمين شخصيا والامتناع عن تقديم شكاوى حول الوظائف المدرجة.",
      "يقدم المنشور أيضا توصيات لمختلف مواقع البحث عن الوظائف ويوفر روابط لسلاسل الرسائل المتعلقة بالموضوع."
    ],
    "commentSummary": [
      "يجمع هذا المنشور الوظائف الشاغرة من العديد من الشركات التي تغطي مختلف الصناعات ، مثل هندسة البرمجيات وإدارة المنتجات وعلوم البيانات.",
      "تشمل الشركات المذكورة SpaceX و Davinci Trading و Stellar Science و Felt وغيرها ، حيث يقدم بعضها العمل عن بعد بينما يتطلب البعض الآخر التواجد في الموقع.",
      "يتعمق المنشور أيضا في نطاقات الرواتب لهذه المناصب ويتناول الانتقادات حول قانون العمل في قسم التعليقات."
    ],
    "points": 397,
    "commentCount": 391,
    "retryCount": 0,
    "time": 1696258928
  },
  {
    "id": 37740468,
    "title": "كان Microsoft Defender يضع علامة على متصفح Tor باعتباره حصان طروادة ويزيله",
    "originLink": "https://deform.co/microsoft-defender-flags-tor-browser-as-a-trojan-and-removes-it-from-the-system/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37740468",
    "commentBody": "",
    "originSummary": [
      "يقوم برنامج مكافحة الفيروسات Defender من Microsoft عن طريق الخطأ بتحديد أحدث إصدار من متصفح Tor على أنه برنامج ضار ، مما يؤدي إلى إنشاء تنبيهات خاطئة لمستخدمي Windows.",
      "السبب المشتبه به لهذه المشكلة هو طريقة الكشف عن مجريات الأمور الجديدة التي يستخدمها Defender.",
      "يقترح ممثلو Tor التحقق من مصدر تنزيل المتصفح وإضافة Tor إلى قائمة استبعاد Microsoft. حاليا ، لم تصدر Microsoft ردا رسميا على المشكلة."
    ],
    "commentSummary": [
      "تركز المناقشة على التحديات وأوجه القصور في Microsoft Defender ، بما في ذلك اكتشافاته الإيجابية الخاطئة المتكررة والصعوبات في تجاوز أو تعطيل الحماية في الوقت الفعلي.",
      "هناك إحباط كبير من المستخدمين بشأن الفعالية العامة لبرامج مكافحة الفيروسات ومخاوف بشأن إساءة استخدامها المحتملة من قبل الأنظمة الاستبدادية.",
      "يذكر بإيجاز صعوبة تثبيت Firefox على نظام التشغيل Windows 11 الجديد وعنصر مفاجأة على الاستخدام المستمر لنظام Windows."
    ],
    "points": 382,
    "commentCount": 122,
    "retryCount": 0,
    "time": 1696264153
  },
  {
    "id": 37740932,
    "title": "نماذج لغة بث فعالة مع أحواض الانتباه",
    "originLink": "https://github.com/mit-han-lab/streaming-llm",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37740932",
    "commentBody": "",
    "originSummary": [
      "يهدف مشروع \"streaming-llm\" إلى تنفيذ نماذج اللغة الكبيرة (LLMs) في تطبيقات البث دون التضحية بالكفاءة أو الأداء ، والتغلب على استهلاك الذاكرة والقيود في التعامل مع النصوص الأطول.",
      "يقدم هذا المشروع مفهوم أحواض الانتباه وإطار عمل StreamingLLM ، والذي يسمح ل LLMs بإدارة المدخلات ذات الطول اللانهائي دون الحاجة إلى الضبط الدقيق. تتفوق هذه الطريقة على التقنيات الأخرى في السرعة والاستقرار ، ولكنها ليست مثالية لتلخيص النصوص الشاملة.",
      "يخطط المشروع لإصدار التعليمات البرمجية والبيانات وأدوات التقييم في المستقبل ويشجع على الاستشهاد بورقتهم لأولئك الذين يحرصون على استخدام إطار عمل StreamingLLM."
    ],
    "commentSummary": [
      "طور الباحثون نموذجا جديدا للغة البث مزودا بأحواض الانتباه ، مما يعزز الكفاءة من خلال إعادة استخدام ذاكرة التخزين المؤقت بدلا من تكبد تكاليف إعادة الحساب.",
      "يخصص هذا النموذج درجات اهتمام كبيرة للرموز المميزة الأولية ، مما يضمن إنتاج نص قابل للقراءة مع الحفاظ على حيرته. يمكن للنموذج التعامل مع أطوال تسلسل لا نهائية ، على الرغم من أن فعالية هذه الميزة لم يتم تأكيدها بعد.",
      "هناك نقاش مستمر حول قيود نماذج نماذج اللغة الحالية (LLMs) مع مقترحات للتحسين مثل القدرة على التكرار. الأمل هو تحميل هذا النموذج الجديد على منصة متاحة للجمهور قريبا."
    ],
    "points": 381,
    "commentCount": 63,
    "retryCount": 0,
    "time": 1696265764
  },
  {
    "id": 37746717,
    "title": "Redfin يغادر الرابطة الوطنية للوسطاء العقاريين",
    "originLink": "https://www.redfin.com/news/redfin-is-leaving-nar/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37746717",
    "commentBody": "",
    "originSummary": [
      "تقوم شركة Redfin ، وهي شركة عقارية ، بسحب الدعم من الرابطة الوطنية للوسطاء العقاريين (NAR) بسبب النزاعات حول سياسات الرسوم لوكلاء المشتري والتحرش الجنسي المزعوم داخل NAR.",
      "كانت الشركة تدفع مستحقات كبيرة للتأثير على دعوة NAR لسوق يحركها التكنولوجيا ، لكنها تبحث الآن عن طرق أخرى لتحقيق أهدافها وتطلب من وسطاءها ووكلائها مغادرة NAR.",
      "تضغط Redfin من أجل NAR لإلغاء ربط الوصول إلى قواعد بيانات القوائم من دعم منظمة الضغط ولكنها ستظل تدعم خدمات القوائم المتعددة (MLSs) لمشاركة بيانات القوائم."
    ],
    "commentSummary": [
      "تخرج Redfin ، وهي شركة عقارية ، من الرابطة الوطنية للوسطاء العقاريين (NAR) لتقديم خدمات أفضل بتكلفة مخفضة ، مما يحفز المناقشات حول دور وكلاء العقارات وفعالية خدماتهم من حيث التكلفة.",
      "وقد أشعل هذا القرار مناقشات أوسع حول مواضيع تشمل القدرة على تحمل تكاليف الإسكان ، والعرض والطلب ، والتخفيضات الضريبية على فوائد الرهن العقاري ، واستدامة سوق الإسكان ، والاضطرابات المحتملة في صناعة العقارات.",
      "تسلط المحادثات الضوء على وجهات نظر مختلفة ، حيث أعرب البعض عن شكوكه بشأن ارتفاع أسعار المنازل وربحية ملكية المنازل بينما يشدد البعض الآخر على الدور الهام للوسطاء العقاريين والقيمة التي يقدمونها. كما تثار مخاوف بشأن القضايا القانونية ، واحتكارات السوق المحتملة ، ومزاعم الاعتداء الجنسي المرتبطة بصناعة العقارات."
    ],
    "points": 362,
    "commentCount": 272,
    "retryCount": 0,
    "time": 1696295865
  },
  {
    "id": 37739233,
    "title": "غريب A.I. يانكوفيتش: غوص عميق ملعون في عالم استنساخ الصوت",
    "originLink": "https://waxy.org/2023/10/weird-ai-yankovic-voice-cloning/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37739233",
    "commentBody": "",
    "originSummary": [
      "يتعمق المقال في استنساخ الصوت عبر الذكاء الاصطناعي (A.I.) ، مع التركيز على إنتاج أغلفة تم إنشاؤها بواسطة الذكاء الاصطناعي لأغاني Weird Al Yankovic التي يؤديها فنانون مختلفون.",
      "ويناقش مجتمع استنساخ الصوت بالذكاء الاصطناعي ، ومنصات مثل Discord و Hugging Face ، والقضايا الأخلاقية والقانونية المرتبطة باستخدام هذه التكنولوجيا.",
      "على الرغم من الحملات المحتملة على الاستخدام التجاري لغناء الذكاء الاصطناعي من قبل صناعة الموسيقى ، إلا أن إنشاء وتوسيع الموسيقى التي تم إنشاؤها بواسطة الذكاء الاصطناعي لا يزال قائما."
    ],
    "commentSummary": [
      "يستكشف المقال تأثير تكنولوجيا استنساخ الصوت ، مشيرا إلى النزوح المحتمل للوظائف للممثلين الصوتيين والقضايا القانونية المحيطة بملكية الأصوات المنتجة الذكاء الاصطناعي.",
      "تغطي المقالة أيضا آراء مختلفة حول الأصوات التي يتم إنشاؤها الذكاء الاصطناعي ، مع تأكيد بعضها على فوائد مثل خطوط الصوت الديناميكية وقابلية التوسع ، بينما يركز البعض الآخر على المخاوف من المصطنعة وإساءة الاستخدام المحتملة.",
      "تتضمن المناقشة استخدام الذكاء الاصطناعي في التلاعب بالصوت والموسيقى ، إلى جانب جاذبية المنصات المختلفة والقيود الحالية للذكاء الاصطناعي."
    ],
    "points": 285,
    "commentCount": 165,
    "retryCount": 0,
    "time": 1696259742
  },
  {
    "id": 37744350,
    "title": "أول فحص دم لعشرات السرطانات الوراثية المعتمدة من قبل إدارة الغذاء والدواء",
    "originLink": "https://www.insideprecisionmedicine.com/topics/oncology/first-blood-test-for-dozens-of-hereditary-cancers-approved-by-fda/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37744350",
    "commentBody": "",
    "originSummary": [
      "وافقت إدارة الغذاء والدواء الأمريكية على أول اختبار دم ، وهو لوحة Invitae Common Hereditary Cancers Panel ، القادرة على تحديد المتغيرات الجينية المرتبطة بزيادة خطر الإصابة ببعض أنواع السرطان.",
      "تستخدم اللجنة تسلسل الجيل التالي لتحليل متغيرات الحمض النووي في 47 جينا وتقدم طريقة جديدة لتقييم مخاطر السرطان الشخصية للمرضى ومقدمي الرعاية الصحية.",
      "على الرغم من هذه التطورات ، لا تزال هناك مخاطر من النتائج الإيجابية الخاطئة أو السلبية الخاطئة ، ولا يزال احتمال سوء فهم نتائج الاختبار قائما."
    ],
    "commentSummary": [
      "أعطت إدارة الغذاء والدواء الأمريكية الضوء الأخضر لأول اختبار دم للسرطانات الوراثية ، وهو ابتكار من قبل Invitae ، والذي يمكن أن يزيد من فرص سداد التأمين.",
      "هناك مناقشات مستمرة بشأن تغطية التأمين للاختبارات الجينية ، والقرارات المتعلقة بالعمليات الجراحية الوقائية ، ومدى الكشف المبكر عن السرطان ، والحماية من التمييز الجيني ، والجوانب المالية المرتبطة بالبيانات الجينية.",
      "تشمل المناقشات الأخرى ذات الصلة تكلفة وتطبيق الاختبارات الجينية ، والمقارنة بين نهج Invitae و 23andMe ، واختبار Grail's Galleri ، وتحديات شركة Invitae ، ومزايا الاختبارات القائمة على الدم ، وإمكانية الوصول إلى اختبارات تسلسل الحمض النووي وتسعيرها ، وأخلاقيات الاختبارات الجينية واختيار الأجنة ، وتوافر التطبيقات ل YC Winter 2024."
    ],
    "points": 282,
    "commentCount": 104,
    "retryCount": 0,
    "time": 1696280542
  },
  {
    "id": 37744114,
    "title": "دعوة للمطورين – Jellyfin",
    "originLink": "https://jellyfin.org/posts/a-call-for-developers/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37744114",
    "commentBody": "",
    "originSummary": [
      "يقوم مشروع Jellyfin ، وهو خادم بث وسائط مفتوح المصدر ، بتجنيد المزيد من المطورين والمساهمين لتطوير البرامج.",
      "الفريق الحالي ، في المقام الأول من المتطوعين ، قد تم استنفاده بسبب قاعدة صغيرة من المساهمين ، مما أدى إلى قيود البرامج والأخطاء.",
      "من خلال طلب المساعدة من مختلف المطورين والكتاب والمصممين والمتحمسين ذوي الخبرة ، تهدف Jellyfin إلى معالجة مخاوف المستخدم والسعي لتصبح أفضل خادم بث."
    ],
    "commentSummary": [
      "يسعى مشروع Jellyfin للحصول على مساهمات من المطورين وهو الموضوع الرئيسي لهذا المنشور. Jellyfin هو نظام وسائط مفتوح المصدر.",
      "ناقش المستخدمون تجاربهم مع عملاء Jellyfin ، مشيرين إلى تحديات مثل قيود دعم الصوت ومشكلات تحويل الشفرة.",
      "يتم استكشاف الآثار القانونية لاستخدام تطبيقات مثل Jellyfin لاستهلاك الوسائط الشخصية ، مما يوفر رؤى ضرورية حول القيود القانونية المحتملة وتأثيراتها."
    ],
    "points": 266,
    "commentCount": 100,
    "retryCount": 0,
    "time": 1696279230
  },
  {
    "id": 37737318,
    "title": "يمكن للمصدر المفتوح أخيرا أن يجعل المجاهر في العالم تتحدث نفس اللغة",
    "originLink": "https://www.nature.com/articles/d41586-023-03064-9",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37737318",
    "commentBody": "",
    "originSummary": [
      "يعمل العلماء على تطوير OME-Zarr ، وهو تنسيق ملف عالمي لبيانات الفحص المجهري البيولوجي ، يهدف إلى زيادة إمكانية الوصول وتحسين التعاون.",
      "في الوقت الحاضر ، هناك 160 تنسيقا مختلفا للملفات تعيق مشاركة البيانات والتحقق منها ، والهدف هو تقليل هذا العدد بشكل كبير.",
      "ومع ذلك ، هناك طلب على التغيير الثقافي والجهود المشتركة من الباحثين والناشرين والبائعين لتنفيذ تنسيقات موحدة ، مع توجيه ودعم المجتمع العلمي الأوسع."
    ],
    "commentSummary": [
      "يواجه تنسيق Zarr مفتوح المصدر ، الذي يشيع استخدامه لتخزين وتحليل بيانات علوم المناخ على نطاق واسع ، مخاوف من عدم كفاية التمويل وتحديات أمام قابلية التكاثر في المجالات العلمية.",
      "تم إدخال شكل جديد ، OME-Zarr ، لتخزين ومشاركة بيانات الفحص المجهري ، بهدف توحيد الجهود المختلفة وتعزيز قابلية التشغيل البيني. يشكك النقاد في ضرورتها ، بينما يؤكد المدافعون عنها على إمكاناتها للدراسات التلوية واكتشاف حالات استخدام جديدة.",
      "يتم التأكيد على التوحيد القياسي وتنسيق واحد لبيانات الصورة. وتناقش القيود المفروضة على الأشكال الحالية والحاجة إلى حماية سلامة البيانات. تشمل الاعتبارات اعتماد الضغط مع فقدان البيانات والتحويل التلقائي لبيانات الصورة."
    ],
    "points": 236,
    "commentCount": 60,
    "retryCount": 0,
    "time": 1696250396
  },
  {
    "id": 37743759,
    "title": "الجدة الميتة المنجد طلب الحيل الذكاء الاصطناعي Bing الدردشة في حل لغز الأمن",
    "originLink": "https://arstechnica.com/information-technology/2023/10/sob-story-about-dead-grandma-tricks-microsoft-ai-into-solving-captcha/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37743759",
    "commentBody": "",
    "originSummary": [
      "تلاعب أحد المستخدمين الذكاء الاصطناعي Bing Chat من Microsoft لحل اختبار CAPTCHA عن طريق تحميل صورة مدلاة وتغيير سياقها ، مما يدل على فشل الذكاء الاصطناعي في التعرف عليها على أنها CAPTCHA.",
      "تكشف هذه الخدعة عن ثغرة أمنية بارزة في روبوتات المحادثة الذكاء الاصطناعي ونماذج اللغة المتطورة ، مع قدرة التعرف عليها عرضة للتلاعب بالسياق.",
      "حتى الآن ، لم تقدم Microsoft أي تعليقات حول هذه المشكلة."
    ],
    "commentSummary": [
      "تركز المحادثات على نقاط القوة والضعف في أنظمة CAPTCHA ، المكلفة بتحديد البشر على مدار الذكاء الاصطناعي.",
      "هناك تعبيرات عن القلق بشأن قابلية أنظمة CAPTCHA للتلاعب ، مع مناقشات حول العلاجات والبدائل الممكنة.",
      "يتعمق المشاركون أيضا في التداعيات الأوسع لتكنولوجيا الذكاء الاصطناعي على إمكانية الوصول والأعراف المجتمعية."
    ],
    "points": 215,
    "commentCount": 135,
    "retryCount": 0,
    "time": 1696277393
  },
  {
    "id": 37737651,
    "title": "كروم بوك بلس",
    "originLink": "https://blog.google/products/chromebooks/chromebook-plus/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37737651",
    "commentBody": "",
    "originSummary": [
      "أعلنت Google عن فئة جديدة من أجهزة Chromebook تعرف باسم Chromebook Plus ، والتي من المقرر أن تقدم ضعف الأداء وتطبيقات Google المتكاملة وقدرات الذكاء الاصطناعي القوية.",
      "ستتميز أجهزة الكمبيوتر المحمولة Chromebook Plus بمعالجات أسرع ، ومضاعفة الذاكرة والتخزين ، وشاشة Full HD IPS ، وكاميرا بدقة 1080 بكسل مع تحسينات مكالمات الفيديو المعززة الذكاء الاصطناعي ، وستدعم التطبيقات التي تركز على الإبداع مثل Adobe Photoshop و LumaFusion.",
      "تهدف Google إلى دمج المزيد من الميزات في Chromebook Plus ، بما في ذلك إمكانات الذكاء الاصطناعي الموسعة وإنشاء الصور ، مع توفر للشراء يبدأ من 8 أكتوبر 2023."
    ],
    "commentSummary": [
      "قدمت Google أجهزة كمبيوتر محمولة جديدة ، بما في ذلك أجهزة Chromebook التي تمت ترقيتها مع أجهزة محسنة وميزات الذكاء الاصطناعي ، مما أثار مناقشات حول استخدامها ووظيفتها.",
      "يثير المستخدمون مخاوف بشأن التكامل مع الساعات الذكية ، والتضمين المرغوب فيه للخيارات الخلوية بينما يدافع البعض عن ربط الأجهزة المحمولة ، وأهمية ميزات الذكاء الاصطناعي على أجهزة Chromebook.",
      "تم العثور على آراء متباينة حول مدى ملاءمة أجهزة Chromebook لمهام الترميز أو تطوير البرامج ، وأداء معالجات Intel i3 ، وفوائد NixOS ، ومخاوف الخصوصية."
    ],
    "points": 193,
    "commentCount": 281,
    "retryCount": 0,
    "time": 1696252523
  },
  {
    "id": 37737599,
    "title": "كسر المشهد: استخراج مفاهيم متعددة من صورة واحدة",
    "originLink": "https://omriavrahami.com/break-a-scene/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37737599",
    "commentBody": "",
    "originSummary": [
      "يقدم المؤلفون \"Break-A-Scene\" ، وهي طريقة قادرة على استخراج العديد من المفاهيم من صورة واحدة واستخدام إرشادات اللغة الطبيعية لتوليد صور جديدة عبر سياقات متنوعة.",
      "يقدمون مهمة تحليل المشهد النصي وتتضمن عملية تخصيص على مرحلتين لتحسين كل من الرموز النصية وأوزان النموذج. تم إدخال استراتيجية تدريب جديدة ، \"أخذ العينات النقابية\" ، لتحسين توليد مجموعات المفاهيم.",
      "تم إجراء تقييم للطريقة ، من خلال المقاييس الآلية ودراسة المستخدم ، إلى جانب عرض العديد من تطبيقات الطريقة."
    ],
    "commentSummary": [
      "يغطي النص تقنية الذكاء الاصطناعي جديدة ، Break-a-Scene ، مع القدرة على استخراج مفاهيم متعددة من صورة واحدة ، مما يدل على إمكانية تحويل الصناعات مثل التصوير الفوتوغرافي وصناعة الأفلام.",
      "تنقسم الآراء ، حيث يرحب البعض بالتحسين القوي لسير العمل والموارد الفنية الموسعة ، لكن البعض الآخر يبدي قلقا بشأن التأثير على قيمة التصوير التقليدي.",
      "بصرف النظر عن مناقشة حالات الاستخدام المحتملة ، يشير المقال إلى آثاره على الثقافة البشرية والمفهوم الأساسي للتصوير الفوتوغرافي ، مشيرا إلى أن التكنولوجيا يمكن الوصول إليها عبر GitHub ومعترف بها في ورقة بحث Google."
    ],
    "points": 185,
    "commentCount": 35,
    "retryCount": 0,
    "time": 1696252243
  },
  {
    "id": 37739026,
    "title": "من يريد أن يتم توظيفه؟ (أكتوبر 2023)",
    "originLink": "https://news.ycombinator.com/item?id=37739026",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37739026",
    "commentBody": "",
    "originSummary": [
      "الرسالة عبارة عن دعوة للباحثين عن عمل لمشاركة معلوماتهم ، باتباع تنسيق مقدم يذكر معايير مثل الموقع والاستعداد للانتقال ومجموعة المهارات والسيرة الذاتية وعنوان البريد الإلكتروني.",
      "يضمن أن أي اتصال عبر عناوين البريد الإلكتروني المحددة يجب أن يتعلق بشكل صارم بفرص العمل.",
      "يعمل هذا المنشور كقاعدة بيانات قابلة للبحث لأصحاب العمل الذين يتطلعون إلى توظيف متخصصين في هذا المجال في مجال معين."
    ],
    "commentSummary": [
      "هذا المنشور عبارة عن مجموعة من الأفراد الذين يبحثون عن فرص عمل في مجالات متنوعة بما في ذلك هندسة البرمجيات وعلوم البيانات وإدارة المنتجات.",
      "يتمتع هؤلاء الأفراد بالمرونة في العمل عن بعد ، مما يؤدي إلى توسيع مجموعة التوظيف المحتملة.",
      "لقد قاموا بتضمين روابط لسيرهم الذاتية وتفاصيل الاتصال بهم ، مما يبسط العملية لأصحاب العمل المحتملين للتواصل."
    ],
    "points": 183,
    "commentCount": 350,
    "retryCount": 0,
    "time": 1696258927
  }
]
