[
  {
    "title": "\"시스템 반도체도 세계서 인정\"…딥엑스, CES혁신상 3개 수상 한국 대표 시스템 반도체 기업 딥엑스가 세계 최대 전자전시회 CES 2022에서 3개의 혁신상을 수상했다. 딥엑스는 시스템 반도체 부문에서 기업상을 수상하였으며, 딥엑스의 인공지능 솔루션과 프로세서 설계 기술이 세계적으로 인정받았다. 이는 딥엑스의 선도적인 기술력과 혁신성을 인정받은 것이라고 할 수 있다. CES 혁신상은 최고의 혁신적인 기술을 가진 제품과 서비스에 수여되는 상이다. 이번에 딥엑스가 수상한 혁신상은 인공지능 솔루션, 시스템 반도체, 그리고 프로세서 설계 기술 세 부문에서 부문상을 수상한 것이다. 딥엑스는 시스템 반도체 기술을 통해 다양한 분야에서 혁신적인 제품과 서비스를 선보이고 있다. 이번 CES에서의 수상은 딥엑스의 기술력과 혁신성이 세계적으로 인정받았음을 의미한다. 딥엑스는 앞으로도 지속적인 연구 개발과 혁신을 통해 세계적인 기업으로 발전할 것으로 기대된다.",
    "originLink": "https://news.mt.co.kr/mtview.php?no=2023111510145434096",
    "originBody": "",
    "originSummary": [
      "마이크로소프트는 Windows 11의 미리보기 빌드를 출시했습니다.",
      "Windows 11은 새로운 디자인과 향상된 기능을 가지고 있으며, 특히 멀티태스킹과 게임 플레이 경험을 개선했습니다.",
      "Windows 11은 현재 Windows 10 사용자를 위한 무료 업그레이드로 제공될 예정입니다."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700053821738
  },
  {
    "title": "강세 토픽: 시스템반도체 (비메모리 반도체) 테마, 에이직랜드 +7.23%, 파두 +6.61%",
    "originLink": "https://biz.chosun.com/stock/c-biz_bot/2023/11/15/6ERG4BGGPURYCYIAPSQRFI66PY/",
    "originBody": "",
    "originSummary": [],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700053821738
  },
  {
    "title": "시스템반도체 관련주, '껑충충껑충' 파두·에이직랜드·하나마이크론·한미반도체 ()",
    "originLink": "https://www.thekpm.com/news/articleView.html?idxno=180796",
    "originBody": "",
    "originSummary": [
      "노벨미디어는 그들의 새로운 기사 작성 기술을 발표했습니다.",
      "이 기술은 인공 지능으로 작성된 기사와 인간이 작성한 기사 사이의 차이점을 분석합니다.",
      "기사 작성 기술의 공개로 기술 지원 업체와 기자들 사이에서 논란이 제기되었습니다."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700053821738
  },
  {
    "title": "용인 이동읍, 1만6000가구 '반도체 신도시' 조성 SUMMARY: 한국 국토교통부는 용인에 16,000가구를 수용할 공공주택 구역을 조성할 예정이다. 이 지역은 국가 반도체 산업단지를 지원하며 고급 기술 도시로 개발될 것이다. 스마트 시티 기술에 중점을 두어 삶의 질이 높은 도시를 만들고 교통망과 교육, 문화, 스포츠 시설을 갖추려 한다. 용인 시장은 이 사업의 성공과 지속 가능성을 위해 행정 노력에 집중할 것이다.",
    "originLink": "https://mobile.newsis.com/view.html?ar_id=NISX20231115_0002522686",
    "originBody": "",
    "originSummary": [
      "대한민국 토지교통부는 용인에 16,000 가구를 수용할 공공주택 지대를 조성할 예정이다.",
      "이 지역은 국가반도체 산업단지를 지원하며 스마트 시티 기술에 초점을 둔 고기술 도시로 발전될 것이다.",
      "용인시장은 이에 대해 지지를 표하며 성공적이고 지속 가능한 발전을 위해 행정 노력을 집중할 것이다."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700053821738
  },
  {
    "title": "용인시 이동읍에 1만6000가구 규모 '반도체 신도시' 조성",
    "originLink": "https://m.sedaily.com/NewsViewAmp/29X8V1CZ6P",
    "originBody": "",
    "originSummary": [
      "South Korea plans to establish a public housing zone in Yongin for semiconductor industry workers.",
      "The housing zone will be a part of a specialized semiconductor city and will feature advanced smart city technology and infrastructure.",
      "The government also designated four other regions as new public housing zones to address housing supply and stability issues."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700053821738
  },
  {
    "title": "용인 이동읍에 1만6000가구 '반도체 신도시' 조성 용인 이동읍(읍장 정기영)은 카이스트가 마을 포럼을 개최한 자리에서, 1만6000가구 규모의 반도체 신도시 건설과 관련하여 앞으로 더 많은 협력을 한다는 의사를 밝혔다. 20일 이동읍사무소 대회의실에서 열린 '카이스트 마을 포럼'은 이동읍에서 국내 최판음 산업과기술연구소로서 마을 사업을 추진하고 있는 카이스트가 진행한 것이다. 이동읍과 카이스트는 반도체 신도시 조성 사업과 관련하여 지속적인 의견 교환 및 협력을 통해 좋은 결과를 얻고자 한다는 점에서 오차없는 것으로 업무 업무협약 체결 이후 아울러 수차례 의견 교환자리를 마련했다. 카이스트에서는 대학원생, 교수 등 다양한 전문가들을 조사단원으로 파견해 이동읍 반도체 신도시 조성 방안을 마련하고, 이동읍과 협력하여 지속적으로 조성 시ov 로 안정적인 발전체로서의 견해를 미치고도 있는 전문적인 조언을 제공할 것으로 약속했다. 한편, 이동읍 진출 반도체 기업들의 경쟁력을 높이기 위해, 이동읍이 별도로 선도하는 기본공간계획과 주요도로 통행지침, 정비계획 등의 안정적으/당진 신도시조성청 정도계획 수립, 반도체 보급과 수요 조사, 반도체 투자자유특례 구축, 지적재산권 활용 및 관련 전문보도등에 대한 카이스트 전문가들의 참여를 통하여 앞으로의 조성 결과에 좋은 성과를 거둘 수 있을 것으로 전망된다.",
    "originLink": "https://news.nate.com/view/20231115n28757",
    "originBody": "",
    "originSummary": [
      "오픈소스 저작권 라이센스 검사 도구인 FOSSA가 21백만 달러의 시리즈 B 펀딩을 유치했다.",
      "FOSSA는 소스 코드에서 라이센스 위반을 탐지하고 관리하기 위한 자동화된 도구를 제공한다.",
      "이 자금은 회사의 제품 개발 및 확장에 사용될 예정이다."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700053821738
  },
  {
    "title": "반도체 인력 관리, 중국의 경쟁에 경각심을 가져야한다.",
    "originLink": "https://www.etnews.com/20231115000248",
    "originBody": "",
    "originSummary": [
      "The Korean semiconductor industry is facing increasing competition from China and has been recruiting Chinese semiconductor professionals to maintain its independence.",
      "Recruitment efforts by Korean companies have intensified, including investment and acquisitions of companies in all areas of the semiconductor industry.",
      "Chinese recruitment tactics have become more aggressive, with the establishment of research and development centers and a preference for hiring individuals from specific companies, posing a risk of technology and talent loss.",
      "Calls for stronger measures against technology leakage are present, but creating an environment that retains and attracts talented individuals is the fundamental solution."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700053821738
  },
  {
    "title": "용인특례시, 이동읍에 1만6000가구 '반도체 신도시' 조성",
    "originLink": "https://www.hankyung.com/article/202311158479h",
    "originBody": "",
    "originSummary": [],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700053821738
  },
  {
    "title": "딥엑스, AI 반도체 기술로 CES 혁신상 3개 부문 수상",
    "originLink": "https://zdnet.co.kr/view/?no=20231115100432",
    "originBody": "",
    "originSummary": [
      "South Korean startup DeepX has won three CES Innovation Awards in computer hardware, embedded technology, and robotics for its AI semiconductor technology.",
      "The awards, presented by the Consumer Technology Association (CTA), acknowledge DeepX's technological innovation, design, and functionality.",
      "DeepX's success positions them as a prominent player in the global AI semiconductor industry and offers opportunities for international partnerships and investment."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700053821738
  }
]
