[
  {
    "id": 37166946,
    "title": "วิธีการสื่อสารเมื่อความไว้วางใจต่ําโดยไม่ต้องขุดตัวเองลงไปในหลุมลึก",
    "originLink": "https://charity.wtf/2023/08/17/how-to-communicate-when-trust-is-low-without-digging-yourself-into-a-deeper-hole/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37166946",
    "commentBody": "",
    "originSummary": [
      "การสื่อสารที่มีประสิทธิภาพเป็นสิ่งจําเป็นสําหรับการสร้างความไว้วางใจในความสัมพันธ์",
      "ผู้เขียนให้คําแนะนําต่าง ๆ สําหรับการสื่อสารที่มีประสิทธิภาพรวมถึงการยอมรับความยากลําบากของการสนทนาการเช็คอินในภายหลังและการพูดอย่างไม่แน่นอน",
      "เคล็ดลับอื่น ๆ ได้แก่ การใช้เทคนิคเช่น \"เรื่องราวในหัวของฉัน\" ปฏิสัมพันธ์เชิงบวกทางวิศวกรรมและการประเมินค่าความพยายามในการสื่อสาร"
    ],
    "commentSummary": [
      "บทความนี้เน้นความสําคัญของการสื่อสารที่มีประสิทธิภาพในสถานการณ์ที่มีความน่าเชื่อถือต่ํา",
      "มีการหารือถึงการเสียสละเพื่อสร้างความไว้วางใจใหม่ แต่ความท้าทายและความไม่แน่นอนที่เกี่ยวข้องจะถูกเน้น",
      "หัวข้อต่าง ๆ ที่เกี่ยวข้องกับการสื่อสารได้รับการสัมผัสเช่นการใช้ตัวเติมภาษาความแตกต่างทางวัฒนธรรมและการตีความผิดที่อาจเกิดขึ้นจากการสื่อสารที่เป็นลายลักษณ์อักษร",
      "หมายเหตุ: การกล่าวถึง CEO ที่เป็นที่ถกเถียงกัน CTO และการตัดอวัยวะเพศควรได้รับการพิจารณาว่าไม่เกี่ยวข้องและไม่ใช่ส่วนหนึ่งของการสนทนาหลัก"
    ],
    "points": 561,
    "commentCount": 228,
    "retryCount": 0,
    "time": 1692301487
  },
  {
    "id": 37169696,
    "title": "StarLite 12.5-นิ้วลินุกซ์แท็บเล็ต",
    "originLink": "https://us.starlabs.systems/pages/starlite",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37169696",
    "commentBody": "",
    "originSummary": [
      "Star Labs นําเสนอแล็ปท็อป StarLite ซึ่งเป็นอุปกรณ์ขนาดกะทัดรัดและทรงพลังที่ออกแบบมาเพื่อการพกพา",
      "แล็ปท็อปมีโปรเซสเซอร์ Intel Alder Lake N200, หน่วยความจํา 16GB, และหน้าจอสัมผัส 3k ขนาด 12.5 นิ้ว.",
      "มันขับเคลื่อนโดยเฟิร์มแวร์โอเพ่นซอร์สนําเสนอการไหลของการบูตที่ปลอดภัยและการปรับแต่งเฟิร์มแวร์ แล็ปท็อปยังมีคุณสมบัติเช่นแป้นพิมพ์เรืองแสงหน้าจอสัมผัสที่คมชัดเครื่องชาร์จขนาดเล็กพร้อมแบตเตอรี่ขนาดใหญ่และการอัปเดตเฟิร์มแวร์ที่ง่ายดาย",
      "แล็ปท็อปสามารถปรับแต่งได้สูงและมาพร้อมกับตัวเลือกการกระจายที่หลากหลาย",
      "ราคาเริ่มต้นคือ $ 498 และมีตัวเลือกการชําระเงิน"
    ],
    "commentSummary": [
      "การอภิปรายครอบคลุมหลายแง่มุมของอุปกรณ์ Linux รวมถึงความเข้ากันได้กับแท็บเล็ตเทคโนโลยี USB-C ความทนทานของสาย USB-C การตลาดของโทรศัพท์ Linux การสนับสนุนอุปกรณ์รุ่นเก่าการใช้พลังงานและแท็บเล็ต Linux ใหม่ที่เรียกว่า Star Lite Mk V",
      "ผู้ใช้มีความคิดเห็นที่หลากหลายในหัวข้อเหล่านี้ชี้ให้เห็นถึงความท้าทายและการปรับปรุงที่อาจเกิดขึ้นในตลาดลินุกซ์",
      "การอภิปรายอื่น ๆ สัมผัสกับคุณสมบัติของอุปกรณ์ความสามารถในการซ่อมแซมและโปรเซสเซอร์ทางเลือก"
    ],
    "points": 480,
    "commentCount": 241,
    "retryCount": 0,
    "time": 1692315058
  },
  {
    "id": 37166478,
    "title": "Job Corps: ฟรีการฝึกอบรมที่อยู่อาศัยและการศึกษาสําหรับคนหนุ่มสาวที่มีรายได้น้อย",
    "originLink": "https://www.jobcorps.gov/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37166478",
    "commentBody": "",
    "originSummary": [
      "Job Corps เป็นโปรแกรมฟรีที่ให้การฝึกอบรมและการศึกษาในกว่า 100 พื้นที่ใน 10 อุตสาหกรรมสําหรับคนหนุ่มสาวที่มีรายได้น้อย",
      "มีที่อยู่อาศัยอาหารการรักษาพยาบาลและค่าครองชีพฟรี",
      "โปรแกรมนี้ช่วยให้บุคคลจํานวนมากประสบความสําเร็จในสาขาต่างๆเช่นการผลิตขั้นสูงเทคโนโลยีสารสนเทศการดูแลสุขภาพการก่อสร้างและการบริการ"
    ],
    "commentSummary": [
      "การสนทนาครอบคลุมหัวข้อต่างๆเช่นโปรแกรม Job Corps การสนับสนุนสําหรับคนหนุ่มสาวการ จํากัด อายุและความช่วยเหลือทางการเงิน",
      "มีการอภิปรายเกี่ยวกับ NEETs (ไม่ได้อยู่ในการศึกษาการจ้างงานหรือการฝึกอบรม) และความต้องการโปรแกรมที่มีโครงสร้างเพื่อสนับสนุนพวกเขา",
      "การสนทนาสํารวจการขาดการสนับสนุนสําหรับผู้ว่างงานการจัดการพฤติกรรมทางทหารการศึกษาและความช่วยเหลือทางการเงินค่านิยมทางสังคมและการใช้จ่ายของรัฐบาลและการลดภาษี"
    ],
    "points": 354,
    "commentCount": 311,
    "retryCount": 0,
    "time": 1692299265
  },
  {
    "id": 37164155,
    "title": "เรียกคืนเครื่องลดความชื้น 1.56 ล้านเครื่องเนื่องจากไฟไหม้และอันตรายจากการเผาไหม้",
    "originLink": "https://www.theverge.com/2023/8/16/23835116/have-you-seen-these-dehumidifiers-stop-using-them-or-you-might-die",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37164155",
    "commentBody": "",
    "originSummary": [
      "คณะกรรมาธิการความปลอดภัยของสินค้าอุปโภคบริโภคของสหรัฐอเมริกาได้ออกการเรียกคืนเครื่องลดความชื้นที่ขายภายใต้ชื่อแบรนด์ต่างๆเช่น Frigidaire, GE และ Kenmore",
      "เครื่องลดความชื้นเหล่านี้เชื่อมโยงกับไฟไหม้ร้ายแรงกระตุ้นให้ผู้บริโภคดําเนินการอย่างเร่งด่วน",
      "ผู้บริโภคควรตรวจสอบภาพที่ให้ไว้และหากมีเครื่องลดความชื้นที่ตรงกันพวกเขาควรขอเงินคืนและนําออกจากบ้านทันที"
    ],
    "commentSummary": [
      "มีการเรียกคืนเครื่องลดความชื้นทั้งหมด 1.56 ล้านเครื่องเนื่องจากอันตรายจากไฟไหม้ โดยมีรายงานไฟไหม้ ความร้อนสูงเกินไป และความเสียหายต่อทรัพย์สิน",
      "การเรียกคืนใช้กับรุ่นที่ขายระหว่างปี 2011 ถึง 2014 กระตุ้นให้เกิดการอภิปรายเกี่ยวกับประสบการณ์ส่วนตัวและวิธีการลดความชื้นทางเลือก",
      "การสนทนายังเน้นย้ําถึงความกังวลเกี่ยวกับคอมเพรสเซอร์สารทําความเย็นไวไฟและความสําคัญของความโปร่งใสและความรับผิดชอบจากผู้ผลิต"
    ],
    "points": 307,
    "commentCount": 158,
    "retryCount": 0,
    "time": 1692289646
  },
  {
    "id": 37171187,
    "title": "Evergrande ยักษ์ใหญ่ด้านอสังหาริมทรัพย์ของจีนยื่นฟ้องล้มละลายในแมนฮัตตัน",
    "originLink": "https://www.cnbc.com/2023/08/18/china-property-developer-evergrande-files-for-bankruptcy-protection-in-us.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37171187",
    "commentBody": "",
    "originSummary": [
      "Evergrande Group ซึ่งเป็นบริษัทอสังหาริมทรัพย์รายใหญ่ของจีนได้ยื่นฟ้องล้มละลายบทที่ 15 ในศาลสหรัฐฯ",
      "บริษัท มีหนี้สินจํานวนมากและอยู่ระหว่างการปรับโครงสร้างในฮ่องกงหมู่เกาะเคย์แมนและหมู่เกาะบริติชเวอร์จิน",
      "หุ้นของ Evergrande ถูกระงับตั้งแต่เดือนมีนาคม 2022 และมีความกังวลว่าปัญหาในภาคอสังหาริมทรัพย์ของจีนอาจส่งผลกระทบทางเศรษฐกิจในวงกว้าง"
    ],
    "commentSummary": [
      "Evergrande ซึ่งเป็นบริษัทอสังหาริมทรัพย์รายใหญ่ของจีนได้ยื่นฟ้องล้มละลายในแมนฮัตตันทําให้เกิดความกังวลเกี่ยวกับเสถียรภาพของตลาดอสังหาริมทรัพย์ของจีน",
      "แนวทางของรัฐบาลจีนในความล้มเหลวของ บริษัท อสังหาริมทรัพย์เกี่ยวข้องกับการผิดนัดชําระหนี้ที่มีการควบคุมโดยผู้ให้กู้และธนาคารของรัฐแบกรับความสูญเสีย",
      "มีข้อกล่าวหาว่ากระทําผิดทางการเงินและรัฐบาลบังคับใช้คําสั่งห้ามออกและการกํากับดูแลอย่างเข้มงวด วิกฤตการณ์ที่กว้างขึ้นในภาคอสังหาริมทรัพย์ของจีนถูกมองว่าสามารถควบคุมได้เนื่องจากเครื่องมือและแผนของรัฐบาล แต่การทุจริตและการติดสินบนยังคงเป็นปัญหา"
    ],
    "points": 295,
    "commentCount": 297,
    "retryCount": 0,
    "time": 1692330216
  },
  {
    "id": 37163187,
    "title": "Turmoil กรอบการทํางานสําหรับการพัฒนาและทดสอบระบบกระจาย",
    "originLink": "https://tokio.rs/blog/2023-01-03-announcing-turmoil",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37163187",
    "commentBody": "",
    "originSummary": [
      "ความวุ่นวายเป็นกรอบการทํางานใหม่ที่ออกแบบมาเพื่อช่วยให้นักพัฒนาและผู้ทดสอบทํางานบนระบบกระจาย",
      "เฟรมเวิร์กช่วยให้สามารถจําลองโฮสต์เวลาและเครือข่ายในกระบวนการเดียวทําให้ง่ายต่อการทดสอบและพัฒนาระบบแบบกระจาย",
      "ด้วย Turmoil นักพัฒนาสามารถควบคุมเครือข่ายได้อย่างประณีตทําให้พวกเขาสามารถวางระงับหรือหน่วงเวลาข้อความระหว่างโฮสต์ได้",
      "โพสต์บล็อกให้คําแนะนําเกี่ยวกับวิธีการใช้ Turmoil และสนับสนุนให้ผู้ใช้ให้ข้อเสนอแนะสําหรับการพัฒนาและการปรับปรุงในอนาคต"
    ],
    "commentSummary": [
      "Turmoil เป็นเฟรมเวิร์กที่ใช้ Rust ซึ่งออกแบบมาสําหรับการพัฒนาและทดสอบระบบแบบกระจาย",
      "มันมีการดําเนินการที่กําหนดโดยการจําลองโฮสต์พร้อมกันหลายตัวในเธรดเดียวและแนะนํา \"ความยากลําบาก\" ผ่านการเปลี่ยนแปลงเครือข่ายจําลอง",
      "ในขณะที่ผู้ใช้บางคนชื่นชม Turmoil สําหรับการจัดหาสภาพแวดล้อมการทดสอบที่มีการควบคุม แต่คนอื่น ๆ ยืนยันว่ากรอบการทดสอบแบบกระจายที่ครอบคลุมควรรองรับภาษาที่แตกต่างกันน้ําหนักบรรทุกที่สมจริงและความล้มเหลวและให้การวินิจฉัยที่เป็นประโยชน์มากขึ้น"
    ],
    "points": 261,
    "commentCount": 25,
    "retryCount": 0,
    "time": 1692286119
  },
  {
    "id": 37166885,
    "title": "SUSE ไปส่วนตัว",
    "originLink": "https://www.suse.com/news/EQT-announces-voluntary-public-purchase-offer-and-intention-to-delist-SUSE/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37166885",
    "commentBody": "",
    "originSummary": [
      "EQT Private Equity ผู้ถือหุ้นรายใหญ่ของ SUSE Linux Enterprise วางแผนที่จะนํา บริษัท เป็นส่วนตัวโดยการเพิกถอนออกจากตลาดหลักทรัพย์แฟรงค์เฟิร์ต",
      "EQT จะทําการเสนอขายหุ้นต่อประชาชนทั่วไปโดยสมัครใจเพื่อซื้อหุ้นของผู้ถือหุ้น SUSE รายอื่นก่อนการเพิกถอนโดยเสนอขายหุ้นในราคา 16.00 ยูโรต่อหุ้นซึ่งเป็นเบี้ยประกันภัย 67 เปอร์เซ็นต์ของราคาปิดหุ้น XETRA",
      "คณะกรรมการบริหารและคณะกรรมการกํากับดูแลของ SUSE สนับสนุนการเพิกถอนเนื่องจากจะช่วยให้ บริษัท สามารถมุ่งเน้นไปที่ลําดับความสําคัญในการดําเนินงานและกลยุทธ์ระยะยาว เอกสารข้อเสนอจะเผยแพร่เร็ว ๆ นี้โดยคาดว่าจะมีการชําระบัญชีในเดือนตุลาคม 2023"
    ],
    "commentSummary": [
      "SUSE ซึ่งเป็น บริษัท จัดจําหน่าย Linux กําลังวางแผนที่จะเป็นส่วนตัวและถูกซื้อกิจการโดย บริษัท หุ้นเอกชน EQT",
      "การประกาศดังกล่าวได้จุดประกายการอภิปรายในหมู่ผู้ใช้และผู้ที่ชื่นชอบ Linux โดยบางคนแสดงแง่ดีต่อประสิทธิภาพและโครงการนวัตกรรมของ SUSE",
      "อย่างไรก็ตาม มีความกังวลเกี่ยวกับการกระจายตัวของ SUSE และผลกระทบที่อาจเกิดขึ้นจากการเป็นเจ้าของหุ้นเอกชนโดยเฉพาะอย่างยิ่งในช่วงที่มีการปรับโครงสร้าง"
    ],
    "points": 246,
    "commentCount": 213,
    "retryCount": 0,
    "time": 1692301241
  },
  {
    "id": 37162898,
    "title": "ฉันกลัวที่จะแจ้งให้คุณทราบว่าคุณได้สร้างคอมไพเลอร์ (2022)",
    "originLink": "https://rachit.pl/post/you-have-built-a-compiler/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37162898",
    "commentBody": "",
    "originSummary": [
      "ผู้เขียนอธิบายอย่างตลกขบขันนักพัฒนาที่สร้างคอมไพเลอร์โดยไม่ได้ตั้งใจแม้จะไม่เต็มใจในตอนแรก",
      "นักพัฒนาต้องเผชิญกับความท้าทายด้วยไลบรารีแผนผังไวยากรณ์นามธรรม (AST) และการจัดการโหนด AST ที่แตกต่างกัน",
      "พวกเขาประสบปัญหาในการสนับสนุนโครงสร้างโค้ดที่ซ้อนกันและจัดการกับปัญหาความเข้ากันได้สําหรับเครื่องรุ่นเก่า"
    ],
    "commentSummary": [
      "การอภิปรายครอบคลุมหัวข้อที่หลากหลายรวมถึงการเรียกเก็บเงินลูกค้าสําหรับโครงการที่มีประสิทธิภาพการสร้างภาษาและเครื่องมือการเขียนโปรแกรมที่กําหนดเองผลกระทบที่ไม่ได้ตั้งใจของการสร้างซอฟต์แวร์และข้อ จํากัด ของโปรโตคอลการขนส่งที่มีอยู่",
      "การสื่อสารที่ชัดเจนการแก้ปัญหาในทางปฏิบัติและการหลีกเลี่ยงความซับซ้อนที่ไม่จําเป็นถูกเน้นเป็นปัจจัยสําคัญในการอภิปรายเหล่านี้",
      "การอภิปรายให้ข้อมูลเชิงลึกที่มีค่าเกี่ยวกับความท้าทายและข้อควรพิจารณาที่เกี่ยวข้องกับการพัฒนาซอฟต์แวร์และการจัดการโครงการ"
    ],
    "points": 245,
    "commentCount": 87,
    "retryCount": 0,
    "time": 1692285050
  },
  {
    "id": 37169303,
    "title": "SUSE ไปส่วนตัว",
    "originLink": "https://opensourcewatch.beehiiv.com/p/suse-go-private",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37169303",
    "commentBody": "",
    "originSummary": [
      "SUSE ซึ่งเป็น บริษัท ซอฟต์แวร์โอเพ่นซอร์สของยุโรปถูกกําหนดให้เป็นส่วนตัวในฐานะเจ้าของส่วนใหญ่ Marcel LUX III SARL วางแผนที่จะรวม บริษัท เข้ากับนิติบุคคลลักเซมเบิร์กที่ไม่อยู่ในรายการ",
      "EQT Private Equity ซึ่งควบคุมโดยหน่วยงานกองทุน EQT VIII จะเปิดตัวข้อเสนอซื้อต่อสาธารณะให้กับผู้ถือหุ้นที่เหลือโดยเสนอเบี้ยประกันภัย 67% ของราคาหุ้นปิด",
      "คณะกรรมการบริหารและกํากับดูแลของ SUSE สนับสนุนการเพิกถอนเนื่องจากเชื่อว่าจะช่วยให้ บริษัท สามารถมุ่งเน้นไปที่กลยุทธ์ระยะยาวโดยไม่ต้องกดดันจากตลาดสาธารณะ ข้อเสนอนี้คาดว่าจะยุติลงในเดือนตุลาคม 2023"
    ],
    "commentSummary": [
      "SUSE ซึ่งเป็น บริษัท ซอฟต์แวร์โอเพ่นซอร์สกําลังดําเนินการส่วนตัวตามข้อเสนอการซื้อจาก บริษัท หุ้นเอกชน",
      "เจตนารมณ์เบื้องหลังการท าค าเสนอซื้อหลักทรัพย์คือการเพิกถอนบริษัท",
      "การไปเป็นส่วนตัวหมายความว่า SUSE จะไม่เป็น บริษัท ที่ซื้อขายในที่สาธารณะอีกต่อไป"
    ],
    "points": 235,
    "commentCount": 2,
    "retryCount": 0,
    "time": 1692312693
  },
  {
    "id": 37171294,
    "title": "micro – ทางเลือกที่ทันสมัยสําหรับนาโน",
    "originLink": "https://micro-editor.github.io/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37171294",
    "commentBody": "",
    "originSummary": [
      "Micro เป็นโปรแกรมแก้ไขข้อความที่ทันสมัยที่ใช้งานง่ายและติดตั้งได้ง่าย",
      "มีตัวเลือกการปรับแต่งผ่านรูปแบบ json ที่เรียบง่ายและการเขียนสคริปต์ Lua พร้อมกับคุณสมบัติต่างๆเช่นเคอร์เซอร์หลายตัวระบบปลั๊กอินและการสนับสนุนเมาส์",
      "ผู้ใช้ชื่นชม Micro สําหรับความเรียบง่ายและฟังก์ชันการทํางานและสามารถรายงานข้อบกพร่องบน GitHub หรือมีส่วนร่วมในการอภิปรายอย่างไม่เป็นทางการในการแชท Gitter"
    ],
    "commentSummary": [
      "บทความนี้ตรวจสอบโปรแกรมแก้ไขข้อความต่างๆเช่น nano, micro, vi และอื่น ๆ และผู้ใช้จะพูดคุยเกี่ยวกับประสบการณ์และความชอบของพวกเขา",
      "หัวข้อที่ครอบคลุม ได้แก่ การติดตั้งการเรียกใช้สคริปต์ที่มีสิทธิ์ sudo คุณสมบัติการใช้ทรัพยากรการเน้นไวยากรณ์และ keybindings",
      "ความคิดเห็นแตกต่างกันในโปรแกรมแก้ไขที่ดีที่สุดสําหรับงานที่แตกต่างกันโดยผู้ใช้บางคนชอบตัวเลือกที่ง่ายกว่าเช่นนาโนและคนอื่น ๆ ชอบบรรณาธิการที่มีประสิทธิภาพมากขึ้นเช่น vi / vim หรือ Emacs ทางเลือกของบรรณาธิการขึ้นอยู่กับความต้องการและความชอบของแต่ละบุคคล"
    ],
    "points": 229,
    "commentCount": 126,
    "retryCount": 0,
    "time": 1692331564
  }
]
