[
  {
    "title": "Apple TV 앱, Vision Pro에서 3D 영화 소개",
    "originLink": "https://mixed-news.com/en/apple-vision-pro-first-3d-movies-appear-on-apple-tv/",
    "originBody": "",
    "originSummary": [
      "Apple은 Apple TV 앱의 Vision Pro 플랫폼에서 사용할 수 있는 최초의 3D 영화 목록을 공개했습니다.",
      "새롭게 디자인된 앱은 이제 3D 영화를 지원하며 Apple Vision Pro의 모양을 닮은 3D 로고가 특징입니다.",
      "일부 블록버스터 영화가 포함되어 있지만 Vision Pro 출시에서 선보인 일부 타이틀은 아직 제공되지 않습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "Apple has added support for 3D movies on its Vision Pro on the Apple TV app.",
      "The app now displays a 3D logo, mirroring the design of the Apple Vision Pro.",
      "While some popular movies are available, not all titles showcased during the Vision Pro launch are currently included.",
      "The Apple Vision Pro will be launching in the US in early next year, with a price tag of approximately $3,500. International releases will follow."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699539219463
  },
  {
    "title": "애플 비전 프로 헤드셋, 3D 영화 라인업 공개했지만 의문점 남아있어",
    "originLink": "https://www.phonearena.com/ar-vr/news/apple-vision-pro-first-3d-movies_id152435",
    "originBody": "",
    "originSummary": [
      "곧 출시될 Apple의 비전 프로 헤드셋은 XR 업계에 기대감을 불러일으키고 있습니다.",
      "Apple TV 앱의 새로운 업데이트에서 쥬라기 월드와 같이 3D 기능을 지원하는 것으로 추정되는 영화가 포함된 3D 영화 카테고리가 공개되었습니다: 도미니언, 트롤, 워크래프트 등의 3D 영화 카테고리가 추가되었습니다.",
      "이 필름이 일반 소비자에게 공개될지 아니면 개발 키트가 있는 개발자만 이용할 수 있을지는 불분명하며, 필름의 해상도와 프레임 속도도 알려지지 않았습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "Apple's upcoming Vision Pro headset is creating buzz in the XR industry.",
      "The Apple TV app update has unveiled a 3D movie category, suggesting the headset will support 3D movies.",
      "It's unclear if these films will be accessible to consumers or limited to developers with devkits. The resolution and framerate details are also unknown."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699539219463
  },
  {
    "title": "Apple TV 앱, Vision Pro 출시에 앞서 3D 영화 추가",
    "originLink": "https://appleinsider.com/articles/23/11/09/apple-tv-app-adds-3d-movies-ahead-of-vision-pro-release",
    "originBody": "",
    "originSummary": [
      "Apple은 Apple TV 앱에서 3D 버전의 영화를 소개했는데, 이는 곧 출시될 Apple 비전 프로 헤드셋을 암시하는 것일 수 있습니다.",
      "tvOS 17.2 베타에는 헤드셋을 닮은 3D 로고가 있는 일부 영화가 포함되어 있습니다.",
      "Apple이 2024년에 출시될 것으로 예상되는 Vision Pro 헤드셋을 출시하기 전에 3D 영화를 앱에 추가한 이유는 현재로서는 명확하지 않습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "Apple has introduced 3D versions of movies on its Apple TV app.",
      "This move is seen as a possible preparation for the upcoming release of the Apple Vision Pro headset.",
      "It is unclear why Apple is adding 3D movies now, considering that the Vision Pro headset is not expected to be released until 2024."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699539219463
  },
  {
    "title": "애플 비전 프로 유출로 3D 영화 출시 가능성 공개",
    "originLink": "https://www.tomsguide.com/news/apple-vision-pro-leak-reveals-the-first-3d-movies-you-may-be-able-to-watch-heres-the-list",
    "originBody": "",
    "originSummary": [
      "유출된 정보에 따르면 애플은 곧 출시될 애플 비전 프로 헤드셋에 3D 영화를 도입할 계획일 수 있습니다.",
      "최근 발견된 tvOS 17.2 베타의 영화 목록은 다양한 장르를 제안하며 잠재적으로 3D TV에 대한 관심을 다시 불러일으킬 수 있습니다.",
      "Apple은 해상도나 프레임 속도에 대한 구체적인 세부 사항을 공개하지 않았지만, 이 영화에 스테레오스코픽 3D 기술이 적용될 것으로 예상되며, Apple TV+ 플랫폼에서 3D 콘텐츠가 제공될 가능성에 대한 추측이 나오고 있습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "Apple may be planning to introduce 3D movies on its upcoming Apple Vision Pro headset, according to a leaked list of movies found in the tvOS 17.2 beta.",
      "This move could potentially reignite interest in 3D TVs, as it suggests a wider adoption of 3D technology.",
      "There is speculation that Apple may also release 3D content on its Apple TV+ platform, although specific details about the resolution and frame rate are not yet available."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699539219463
  },
  {
    "title": "삼성과 구글, 애플의 비전 프로에 맞서기 위해 VR 헤드셋 출시 연기",
    "originLink": "https://www.zdnet.com/article/samsung-and-google-reboot-vr-headset-plans-to-challenge-vision-pro-now-targeting-end-of-2024-report/",
    "originBody": "",
    "originSummary": [
      "삼성, 구글, 퀄컴은 애플의 비전 프로와 경쟁하기 위해 혼합 현실 헤드셋을 개발하려는 계획을 수정하고 있습니다.",
      "삼성이 헤드셋용 고해상도 화면을 확보하는 데 집중하면서 프로젝트가 지연되고 있습니다.",
      "출시는 2024년 말에 이루어질 예정이며, 올해 생산 목표는 30,000대입니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "Samsung, Google, and Qualcomm are joining forces to develop a mixed reality headset to compete with Apple's Vision Pro.",
      "The project has experienced delays, as Samsung is working on improving the screen resolution for the headset.",
      "The launch of the headset is now anticipated to be at the end of 2024, with a target production of 30,000 units for the year."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699539219463
  },
  {
    "title": "삼성, 애플의 비전 프로에 대항할 '인피니트' 혼합 현실 헤드셋 개발: 보고서",
    "originLink": "https://www.livemint.com/technology/gadgets/samsung-dives-into-mixed-reality-headset-league-with-infinite-an-apple-vision-pro-competitor-report-11699523246121.html",
    "originBody": "",
    "originSummary": [
      "삼성은 애플의 비전 프로 헤드셋에 대항하기 위해 '인피니트'라는 혼합 현실 헤드셋을 개발 중입니다.",
      "이 프로젝트에는 삼성, 구글, 퀄컴이 협력하고 있습니다.",
      "'인피니트' 헤드셋의 출시일은 2024년 후반으로 예상됩니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "Samsung is developing a mixed-reality headset called 'Infinite' to rival Apple's Vision Pro headset.",
      "The project is a joint effort between Samsung, Google, and Qualcomm.",
      "The release date for the 'Infinite' headset is anticipated to be in late 2024."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699539219463
  },
  {
    "title": "애플 비전 프로의 첫 3D 영화가 곧 앱스토어에 공개될 예정입니다.",
    "originLink": "https://www.techradar.com/computing/virtual-reality-augmented-reality/the-apple-vision-pros-first-3d-movies-have-just-shown-up-in-the-app-store",
    "originBody": "",
    "originSummary": [
      "Apple TV 앱에서 여러 3D 영화가 발견되어 Apple Vision Pro 헤드셋이 곧 출시될 수 있음을 시사합니다.",
      "쥬라기 월드 도미네이션, 슈렉과 같은 인기 타이틀을 포함한 영화에는 3D 호환 아이콘이 표시됩니다.",
      "이 영화들이 이전에 3D 영화로 개봉된 적이 있기 때문에 Apple이 Vision Pro 헤드셋을 위한 새로운 파일 형식을 개발했을 수 있다는 추측이 제기되고 있습니다. 비전 프로는 몰입감 있고 편안한 스테레오스코픽 3D 경험을 제공하여 3D TV의 부활을 이끌 것으로 예상됩니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "The Apple TV app has recently added multiple 3D movies, potentially in preparation for the launch of the Apple Vision Pro headset.",
      "Titles like Jurassic World Dominion and Shrek are included, each with a 3D-compatible icon.",
      "The Vision Pro headset is expected to offer an immersive and comfortable experience with its use of stereoscopic 3D, and this support for 3D movies may lead to a resurgence of 3D TVs."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699539219463
  },
  {
    "title": "삼성, 애플의 비전 프로에 대항할 혼합 현실 헤드셋 개발 중",
    "originLink": "https://tech.hindustantimes.com/tech/news/apple-vision-pro-to-get-a-new-rival-as-samsung-looks-all-set-to-join-the-race-71699515429273.html",
    "originBody": "",
    "originSummary": [
      "삼성은 애플의 비전 프로 헤드셋과 경쟁하기 위해 혼합 현실 헤드셋을 개발 중인 것으로 알려져 있습니다.",
      "삼성의 XR 헤드셋 출시는 Apple의 발표로 인해 2024년 후반까지 연기될 수 있습니다.",
      "삼성 XR 헤드셋의 기능에 대한 소문에는 안드로이드와 스냅드래곤 칩셋, 삼성 디스플레이의 OLEDoS 디스플레이가 포함되어 있습니다. 그러나 이 정보는 추측에 불과하며 아직 공식적인 세부 정보는 없습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "Samsung is said to be working on a mixed-reality headset to compete with Apple's Vision Pro headset.",
      "The launch of Samsung's XR headset may be delayed until late 2024 due to Apple's announcement.",
      "Rumored features for Samsung's headset include running on Android, a Snapdragon chipset, and possibly using OLEDoS displays provided by Samsung Display. However, these details are speculative and no official information has been released. The competition between Apple and Samsung in terms of innovation and technology is expected to continue."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699539219463
  },
  {
    "title": "2024년 삼성 갤럭시 AR 헤드셋, 애플 비전 프로와 경쟁할 예정",
    "originLink": "https://www.tweaktown.com/news/94275/samsung-galaxy-ar-headset-teased-for-2024-competitor-to-apple-vision-pro/index.html",
    "originBody": "",
    "originSummary": [
      "삼성은 애플의 비전 프로 헤드셋에 대항하기 위해 코드명 '인피니트(무한)'이라는 AR 헤드셋을 개발 중인 것으로 알려졌습니다.",
      "삼성 헤드셋은 2024년 12월에 출시될 예정이지만, 애플 제품에 비해 수량이 제한되어 있습니다.",
      "삼성 헤드셋은 퀄컴의 2세대 XR 칩셋으로 구동되며 높은 가격표를 달고 나올 가능성이 높다는 소문이 있습니다.",
      "Apple은 2024년에 Vision Pro 헤드셋을 60만 대 이상 출하할 것으로 예상하고 있습니다.",
      "AR 헤드셋 시장에서 Apple과 삼성의 경쟁은 2025~2026년에 더욱 심화될 것으로 예상됩니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "Samsung is reportedly working on an AR headset, codenamed \"Infinite(muhan)\", to compete with Apple's Vision Pro headset.",
      "The Samsung headset is expected to be released in December 2024 but in limited quantities compared to Apple's product.",
      "Apple is projected to ship over 600,000 units of its Vision Pro headset in 2024, indicating a growing competition between Apple and Samsung in the AR headset market in the years to come."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699539219463
  }
]
