[
  {
    "id": 38531759,
    "title": "Beeper Mini: Android Uçtan Uca Şifrelemeli iMessage'a Kavuşuyor",
    "originLink": "https://www.beeper.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38531759",
    "commentBody": "",
    "originSummary": [
      "Beeper Mini, Android kullanıcılarının Mac sunucu aktarıcısı olmadan doğrudan Apple sunucularına uçtan uca şifrelenmiş mesajlar gönderip almalarını sağlayan Android için üçüncü taraf bir iMessage istemcisidir.",
      "Kullanıcılar iMessage grup sohbetlerine katılabilir, tüm sohbet özelliklerine erişebilir ve Beeper Mini'yi kullanarak Android telefon numaralarını iMessage'a kaydedebilirler.",
      "Geliştiriciler gelecekte SMS/RCS, WhatsApp ve Signal gibi diğer sohbet ağları için de destek eklemeyi planlıyor ve üçüncü taraf iMessage istemcilerinin iChat gibi çok protokollü sohbet uygulamalarıyla daha önce de var olduğunu belirtiyor."
    ],
    "commentSummary": [
      "Tartışmalar, mesajlaşma uygulamalarının farklı platformlarla uyumluluğu ve Apple'ın protokollerinin tersine mühendisliğinin yasallığı etrafında dönüyor.",
      "Mesajlaşma platformları arasındaki birlikte çalışabilirlik ve bunun spam ve kimlik avı üzerindeki etkisi de tartışılmaktadır.",
      "Apple'ın iMessage'ının sınırlamaları ve cihazlar arasında standardizasyon arzusu da tartışılıyor ve geliştiricilerin uyumluluk ve güvenlik sağlamada karşılaştıkları zorluklara ışık tutuluyor."
    ],
    "points": 1276,
    "commentCount": 760,
    "retryCount": 0,
    "time": 1701788781
  },
  {
    "id": 38531104,
    "title": "Firefox kullanımının azalması ABD devlet sitelerinin desteğini tehdit ediyor",
    "originLink": "https://www.brycewray.com/posts/2023/11/firefox-brink/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38531104",
    "commentBody": "",
    "originSummary": [
      "Mozilla Firefox tarayıcısı, düşük pazar payı nedeniyle ABD hükümet web sitelerinden aldığı destekte bir düşüşle karşı karşıya kalabilir.",
      "ABD Web Tasarım Sistemi yalnızca %2'nin üzerinde kullanıma sahip tarayıcıları desteklemektedir ve şu anda Firefox %2,2'lik bir paya sahiptir.",
      "Mobil cihazlarda Chrome ve Safari'nin yükselişi Firefox'un kullanımının azalmasına katkıda bulunuyor.",
      "Firefox %2'lik eşiğin altına düşerse, artık devlet siteleri tarafından desteklenmeyebilir ve bu da potansiyel olarak şirketlerin de desteğini kesmesiyle bir domino etkisine yol açabilir.",
      "Yazar, düşüşün devam etmesi halinde Firefox'un gelecekteki önemi konusunda endişelerini dile getiriyor."
    ],
    "commentSummary": [
      "Firefox'un potansiyel düşüşü ve bunun Mozilla üzerindeki etkisi konusunda endişeler var.",
      "Kullanım rakamları ve Firefox'un devlet teknolojisinde desteklenmesinin gerekliliği tartışma konusudur.",
      "Tartışma, kullanıcı gizliliği, devlet finansmanı, web standartları, kullanıcı aracı dizeleri ve Firefox'un performansı ve uyumluluğuna ilişkin hususları içermektedir."
    ],
    "points": 612,
    "commentCount": 730,
    "retryCount": 0,
    "time": 1701786292
  },
  {
    "id": 38532167,
    "title": "iMessage'ı Anlamak: Apple'ın Mesajlaşma Protokolünün İçinde",
    "originLink": "https://jjtech.dev/reverse-engineering/imessage-explained/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38532167",
    "commentBody": "",
    "originSummary": [
      "Bu blog yazısı, özellikle iki temel bileşene odaklanarak iMessage'ın iç işleyişi hakkında kapsamlı bir açıklama sunuyor: Apple Push Bildirim Hizmeti (APN'ler) ve Kimlik Hizmetleri (IDS).",
      "Apple Anlık Bildirim Hizmeti (APN'ler), iMessage'da anlık bildirimlerin gönderilmesini ve alınmasını kolaylaştırmaktan sorumludur.",
      "Kimlik Hizmetleri (IDS) şifreli konuşmalarda anahtar sunucusu olarak işlev görür ve açık anahtarların değişimine izin verir."
    ],
    "commentSummary": [
      "Özetler Apple'ın iMessage'ı ile ilgili çeşitli konuları kapsıyor: güvenlik, mesajlaşma uygulaması tercihleri, cihaz dayanıklılığı, şifreleme standartları, tersine mühendislik ve birlikte çalışabilirlik.",
      "Ortak temalar arasında iMessage'ın güvenlik açıklarıyla ilgili endişeler ve Signal gibi diğer mesajlaşma uygulamalarıyla karşılaştırmalar yer alıyor.",
      "Tartışmalar ayrıca Mac'lerin PC'lere kıyasla dayanıklılığı ve uzun ömürlülüğünün yanı sıra yazılım geliştirmede deneme ve prototip oluşturmanın önemi üzerine tartışmaları da içeriyor."
    ],
    "points": 548,
    "commentCount": 129,
    "retryCount": 0,
    "time": 1701790403
  },
  {
    "id": 38531428,
    "title": "Shazam'ın Algoritması Şarkıları Nasıl Tanımlıyor? Derinlemesine Bir İnceleme (2022)",
    "originLink": "https://www.cameronmacleod.com/blog/how-does-shazam-work",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38531428",
    "commentBody": "",
    "originSummary": [
      "Makale, Shazam'ın algoritmasını kullanarak şarkıları nasıl tanımladığına dair bir açıklama sunuyor.",
      "Ses örneğinin parmak izini oluşturma ve bunu bir veritabanındaki hash'lerle eşleştirme sürecini tartışır.",
      "Makalede ayrıca \"abrakadabra\" adı verilen yeni bir uygulamanın tanıtılmasından bahsediliyor ve şarkı tanımadaki zorluklara dikkat çekiliyor."
    ],
    "commentSummary": [
      "Tartışmada Shazam'ın teknolojisi, sınırlamaları, rekabeti ve kullanıcı deneyimleri gibi farklı yönleri ele alınıyor.",
      "Konular arasında şarkı tanımlama için hash kullanımı, sinir ağlarının potansiyel kullanımı ve benzersiz sanatçıları tanımlamanın zorlukları yer alıyor.",
      "Kullanıcılar ayrıca Shazam'ın geçmişini, tanıma teknolojisini, alternatif parmak izi tekniklerini, \"America's Got Talent\" gibi programların Shazam üzerindeki etkisini ve alternatif seçeneklerin eksikliğini tartışıyor."
    ],
    "points": 418,
    "commentCount": 119,
    "retryCount": 0,
    "time": 1701787479
  },
  {
    "id": 38530880,
    "title": "Yapay Zeka Destekli Kitlesel Casusluk: Mahremiyetin Aşınması",
    "originLink": "https://www.schneier.com/blog/archives/2023/12/the-internet-enabled-mass-surveillance-ai-will-enable-mass-spying.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38530880",
    "commentBody": "",
    "originSummary": [
      "Yapay zeka (AI), gözetim ve casuslukta devrim yaratarak faaliyetlerin izlenmesine ve konuşmaların daha önce görülmemiş bir ölçekte anlaşılmasına olanak tanıyor.",
      "Yapay zeka destekli sistemler artık toplantıları özetleyebiliyor ve milyonlarca konuşmayı organize edebiliyor, tüm verilerin büyük miktarlarda kaydedildiği, aranabilir ve anlaşılabilir olduğu kitlesel casusluğa olanak sağlıyor.",
      "Kitlesel casusluk, ilişkileri, ittifakları ve konuşmaları da dahil olmak üzere bireyler hakkında karmaşık ayrıntıları ortaya çıkarabilir ve Siri ve Alexa gibi her yerde bulunan mikrofonlar tarafından beslenir.",
      "Hükümetler, şirketler ve teknoloji tekelleri halihazırda kitlesel gözetleme yapmaktadır ve kitlesel gözetleme kişiselleştirilmiş reklamcılığı daha da kötüleştirecek ve mahremiyeti aşındıracaktır.",
      "Kitlesel gözetlemenin sınırlandırılması için sağlam veri gizliliği düzenlemeleri gerekecektir, ancak bugüne kadar kitlesel gözetlemeyi ele almak için çok az şey yapılmıştır."
    ],
    "commentSummary": [
      "Makale ve tartışma, kitlesel gözetimin siyasi sonuçları, yapay zekanın potansiyel olumsuz sonuçları ve mahremiyet ve veri toplama ile ilgili endişeler etrafında şekilleniyor.",
      "Ele alınan konular arasında devlet gözetimi, teknolojinin toplumsal etkisi, yapay zeka sistemlerindeki önyargılar ve yapay zeka ve gözetim kullanımında güvenlik önlemlerinin önemi yer alıyor.",
      "Konuşmada bu konuların karmaşıklığı ve üzerinde düşünülmesi ve düzenlenmesi gerekliliği vurgulanmaktadır."
    ],
    "points": 375,
    "commentCount": 304,
    "retryCount": 0,
    "time": 1701785384
  },
  {
    "id": 38533105,
    "title": "Magic the Gathering Draftları için Mistral 7B'ye ince ayar yapmak",
    "originLink": "https://generallyintelligent.substack.com/p/fine-tuning-mistral-7b-on-magic-the",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38533105",
    "commentBody": "",
    "originSummary": [
      "Yazar, Magic the Gathering taslaklarına odaklanarak dil modellerinde ince ayar kavramını inceliyor.",
      "Modelin performansını eğitmek ve değerlendirmek için 17 adadan elde edilen veriler kullanılmıştır.",
      "Magic the Gathering'deki taslak yapay zekanın başarılı performansının da gösterdiği gibi, yeni veriler üzerinde ince ayar yapmanın, önceden eğitilmiş daha büyük modeller kullanmaya kıyasla daha avantajlı ve uygun maliyetli olduğu görülmüştür."
    ],
    "commentSummary": [
      "Makale ve yorum dizisi, Magic: The Gathering taslağı gibi oyunlarda dil modellerine ince ayar yapmanın zorluklarını ve potansiyel kullanımlarını araştırıyor.",
      "Temel konular arasında oyuncuların değerlendirilmesi ve seçilmesi, modelin performansının iyileştirilmesi ve yapay zekanın etkili draft seçimleri yapabilmesi yer alıyor.",
      "Konuşmada ayrıca Mistral'in bir yapay zekayı eğitmek için başlangıç noktası olarak kullanımı, dil modellerinin taslak seçimlerini tahmin etmedeki etkinliği ve çeşitli amaçlar için dil modellerine ince ayar yapma olanakları da ele alındı."
    ],
    "points": 319,
    "commentCount": 88,
    "retryCount": 0,
    "time": 1701794038
  },
  {
    "id": 38540421,
    "title": "SQLite Daha Hızlı JSON İşleme için JSONB'yi Tanıttı",
    "originLink": "https://sqlite.org/forum/forumpost/fa6f64e3dc1a5d97",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38540421",
    "commentBody": "",
    "originSummary": [
      "SQLite, SQLite JSON işlevlerinin yeniden yazımı olan JSONB adlı yeni bir özellik sunmuştur.",
      "JSONB, kullanım modellerine bağlı olarak orijinal JSON işlevlerinden önemli ölçüde daha hızlı olabilir.",
      "JSONB, JSON'un dahili ikili gösterimini bitişik bir bayt dizisine dönüştürerek daha küçük hale getirir ve potansiyel olarak veritabanı boyutunu azaltır."
    ],
    "commentSummary": [
      "SQLite, ikili bir formatta saklanan JSON verileri üzerinde verimli işlemlere olanak tanıyan JSONB adlı yeni bir veri türü tanıttı.",
      "JSON ve JSONB arasındaki seçim, özel gereksinimlere ve kullanım durumlarına bağlıdır ve tartışma, JSON nesnelerindeki anahtarların sıralanmasını ve Postgres ve SQLite gibi veritabanlarında JSON ve JSONB arasındaki farkları kapsar.",
      "Yazar, belge tabanlı veritabanlarından hoşlanmadığını ifade ediyor ve verileri taşımanın zorluklarını tartışırken, gömülü SQLite veritabanlarını kayıt olarak kullanmanın avantajlarından ve dezavantajlarından da bahsediyor.",
      "Daha sonra odak noktası SQLite'ta ikili bir JSON formatının benimsenmesine kaymakta ve taşınabilirlik ve geriye dönük uyumluluğun önemini vurgulamaktadır. SQLite'ta JSONB'nin kararlılığı ve okunabilirliği için övgü ve projenin uzun vadeli sürdürülebilirliği hakkında endişeler var.",
      "Tartışma, SQLite yazılım projesindeki liderlik geçişine kısaca değinmekte ve JSON ve SQL enjeksiyonundaki güvenlik açıkları hakkındaki endişeleri dile getirmektedir."
    ],
    "points": 266,
    "commentCount": 80,
    "retryCount": 0,
    "time": 1701836197
  },
  {
    "id": 38530207,
    "title": "Baskı Altındaki Profesörler: Nicelikten Çok Nitelik",
    "originLink": "https://twitter.com/hbouammar/status/1731970658278469714",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38530207",
    "commentBody": "",
    "originSummary": [
      "Tweet'in yazarı, profesörler tarafından üretilen çalışmalarda nitelikten ziyade niceliğe vurgu yapılmasından endişe duyuyor.",
      "Bu baskının işin genel kalitesinde düşüşe yol açabileceğini savunuyorlar.",
      "Yazar, nicelikten ziyade niteliğe öncelik verilmesine odaklanılması gerektiğini savunmaktadır."
    ],
    "commentSummary": [
      "Tartışma, bilimsel araştırma, tekrarlanabilirlik, makalelerin değeri, hızlı mühendislik, karmaşık sistemler ve biyoloji ve yapay zeka modellerinin sınırlamaları ile ilgili çeşitli konuları kapsamaktadır.",
      "Katılımcılar farklı görüşlere sahiptir ve araştırma konularının ve uygulamalarının bilimsel geçerliliği, faydası ve kalitesi hakkında tartışmalara girerler.",
      "Akademik yayıncılık sistemine yönelik eleştiriler ve daha fazla şeffaflık ve açık araştırma talebi, yapay zeka ve ilgili alanlardaki bilimsel araştırmaların karmaşıklığının ve sürekli değişen doğasının altını çiziyor."
    ],
    "points": 264,
    "commentCount": 173,
    "retryCount": 0,
    "time": 1701781563
  },
  {
    "id": 38530466,
    "title": "Toksik Yorumlar Wikipedia'daki Gönüllü Etkinliğini Azaltıyor",
    "originLink": "https://academic.oup.com/pnasnexus/article/2/12/pgad385/7457939",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38530466",
    "commentBody": "",
    "originSummary": [
      "Bir çalışma, zehirli yorumların Wikipedia'daki gönüllü katılımı ve etkinliği üzerindeki etkilerini incelemiştir.",
      "Zehirli yorumların etkinliği azalttığı ve editörlerin projeden ayrılma olasılığını artırdığı tespit edilmiştir.",
      "Çalışma, zehirli yorumların neden olduğu kayıp aktif gün sayısını tahmin etmekte ve işbirliğine dayalı platformlarda zehirli söylemin ele alınması gerektiğini vurgulamaktadır."
    ],
    "commentSummary": [
      "Özet, Wikipedia ve Stack Overflow gibi platformlarda toksik davranış, azalan gönüllü faaliyeti ve içerik moderasyonu ile ilgili endişeleri ele alıyor.",
      "Bu platformlarda önyargı ve bilginin güvenilirliğine ilişkin zorlukların altını çizmektedir.",
      "Tartışılan potansiyel çözümler arasında çatışma çözüm süreçleri, güven ve iyi niyetin geliştirilmesi ve hesap verebilirlik ve şeffaflığın artırılması yer almaktadır."
    ],
    "points": 249,
    "commentCount": 302,
    "retryCount": 0,
    "time": 1701783210
  },
  {
    "id": 38538100,
    "title": "Android 14 AVF'yi Tanıtacak: Gelişmiş Yetenekler için Android İş Yüklerini Sanallaştırma",
    "originLink": "https://android-developers.googleblog.com/2023/12/virtual-machines-as-core-android-primitive.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38538100",
    "commentBody": "",
    "originSummary": [
      "Android Sanallaştırma Çerçevesi (AVF), platform geliştiricileri için yeni yetenekler sunarak Android 14 cihazlarında tanıtılacak.",
      "AVF, Android üzerinde sanallaştırma sağlayarak iş yüklerinin ve işletim sistemlerinin izole edilmesine olanak tanır.",
      "Geliştiriciler, Android'in sanal makineyi kontrol ettiği tek yönlü izolasyonu veya Android ile sanal makine arasında tam izolasyon sağlayan iki yönlü izolasyonu tercih edebilirler."
    ],
    "commentSummary": [
      "Google, uygulama güvenliğini ve izolasyonunu iyileştirmek için Android'de sanal makine teknolojisini kullanıma sunuyor.",
      "Tartışma, Android'de sanallaştırmanın potansiyel kullanımlarını, güvenlik açıklarını ve faydalarını araştırıyor.",
      "Ayrıca alternatif sanallaştırma seçeneklerini ve Android cihazlarda Android olmayan sanal makineleri çalıştırma becerisini de inceliyor.",
      "İşletim sistemi tarafından bilgi sızıntıları veya kötü niyetli davranışlar karşısında güven ve izolasyon vurgulanmaktadır.",
      "Konuşma, makine öğreniminde güvenilir bilgi işlem teknolojilerinin kullanımı, veri gizliliği endişeleri ve dijital kimlik kartları ile uzaktan doğrulamanın etkinliğine kadar uzanıyor.",
      "Hassas kimlik doğrulama amaçları için köklü telefonlar ve yalıtılmış uygulamalar tercih edilir.",
      "İşlem doğrulaması için banka aramalarına duyulan ihtiyaç sorgulanmaktadır.",
      "Tartışmada ayrıca akıllı telefon bağımlılığı, sanal makinelerde gizli bilgi işlem ve AB'nin bireylere cihazları üzerinde daha fazla kontrol sağlama çabaları da ele alınıyor.",
      "Yazar, kişinin cihazı ve satıcı seçimi üzerinde kontrol sahibi olmasının bir teknoloji aracının kullanışlılığını artırabileceğine inanmaktadır."
    ],
    "points": 194,
    "commentCount": 97,
    "retryCount": 0,
    "time": 1701816951
  }
]
