[
  {
    "id": 38427864,
    "title": "파일이 사라지고 2023년으로 되돌아가는 Google 드라이브 사용자에 대한 경고",
    "originLink": "https://support.google.com/drive/thread/245055606/google-drive-files-suddenly-disappeared-the-drive-literally-went-back-to-condition-in-may-2023?hl=en",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38427864",
    "commentBody": "",
    "originSummary": [
      "파일과 폴더 구조가 사라지고 2023년 5월로 되돌아가는 등 Google 드라이브에 심각한 문제가 발생하여 사용자들이 불편을 겪고 있습니다.",
      "Google의 복구 프로세스를 따랐음에도 불구하고 아직 해결책을 찾지 못해 사용자들의 불만과 우려가 커지고 있습니다.",
      "Google 지원팀에서 이 문제를 인지하고 제품 엔지니어와 협력하여 문제를 조사하고 해결하고 있지만 원인과 해결 일정은 아직 알려지지 않았습니다."
    ],
    "commentSummary": [
      "사용자들은 구글이나 마이크로소프트와 같은 기업의 열악한 고객 서비스에 대해 불만을 토로하고 있습니다.",
      "이 대화는 클라우드 스토리지 플랫폼에서의 데이터 손실과 백업의 필요성을 중심으로 이루어집니다.",
      "사용자들은 클라우드 스토리지에만 의존할 때의 한계와 백업 전략을 다양화할 때의 이점에 대해 논의합니다."
    ],
    "points": 481,
    "commentCount": 178,
    "retryCount": 0,
    "time": 1701057300
  },
  {
    "id": 38429370,
    "title": "더 강력한 개인 정보 보호 및 온라인 추적 방지를 위해 Firefox로 전환하기",
    "originLink": "https://tuta.com/blog/best-private-browsers",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38429370",
    "commentBody": "",
    "originSummary": [
      "개인 웹 브라우저를 사용하여 개인 정보를 보호하고 광고 대행사의 온라인 추적을 방지하는 것이 중요합니다.",
      "강력한 개인정보 보호 기능과 다양한 확장 기능으로 인해 Firefox는 주류 브라우저의 대안으로 권장됩니다.",
      "DuckDuckGo 및 Mullvad와 같은 다른 개인 정보 보호 지향 브라우저도 언급됩니다.",
      "토르 브라우저는 라우팅 프로세스로 인해 속도가 느려질 수 있지만, 최고 수준의 개인 정보 보호와 익명성을 제공하는 것으로 유명합니다.",
      "이 글에서는 광고 차단, VPN 서비스, 의심스러운 비즈니스 관행 등 다양한 브라우저의 다양한 기능과 우려 사항에 대해 설명합니다.",
      "인터넷 안전을 개선하기 위해 협업을 권장합니다.",
      "이 문서에서는 이메일 암호화 및 검열과 같은 주제에 대해서도 간략하게 다루고 있습니다."
    ],
    "commentSummary": [
      "이번 토론의 주요 초점은 웹 브라우저, 특히 Chrome과 Firefox, 그리고 Chrome에서 차단되는 uBlock의 문제입니다.",
      "사용자는 성능, 사용자 경험 및 광고 관행에 대한 우려로 인해 Firefox를 대안으로 제안합니다.",
      "기타 주제에는 추적 매개변수, 브라우저 프로필, 사용자 지정 시작 페이지, 브라우저와 광고 회사 간의 재정적 관계, Edge, 비발디, 브레이브와 같은 대체 브라우저 등이 있습니다."
    ],
    "points": 466,
    "commentCount": 289,
    "retryCount": 0,
    "time": 1701071840
  },
  {
    "id": 38423469,
    "title": "Darling: 번역 레이어를 사용하여 Linux에서 macOS 소프트웨어 실행하기",
    "originLink": "https://www.darlinghq.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38423469",
    "commentBody": "",
    "originSummary": [
      "Darling은 하드웨어 에뮬레이터 없이도 macOS 소프트웨어를 Linux에서 실행할 수 있는 소프트웨어 번역 계층입니다.",
      "GitHub에서 개발된 오픈소스 프로젝트이며 GNU GPL 라이선스에 따라 배포됩니다.",
      "Darling은 Wine이 Linux에서 Windows 소프트웨어를 실행할 수 있도록 하는 것과 유사하게 macOS 앱을 Linux 데스크톱 환경에 통합하는 것을 목표로 합니다."
    ],
    "commentSummary": [
      "Darling은 Linux에서 macOS 애플리케이션을 실행할 수 있는 소프트웨어이지만 제한 사항과 호환성 문제가 있습니다.",
      "특히 애플이 애플 실리콘으로 전환한 상황에서 달링이 ARM 아키텍처에서 실행될 수 있을지에 대해서는 불확실성이 있습니다.",
      "Apple 이외의 하드웨어에서 Apple 소프트웨어를 실행하면 법적 문제가 발생할 수 있으며, macOS가 아닌 시스템에서 macOS 애플리케이션을 실행하는 다양한 방법과 도구가 논의되고 있습니다. 그러나 모든 Cocoa와 그 프레임워크를 포팅하는 데에는 어려움이 있습니다."
    ],
    "points": 432,
    "commentCount": 117,
    "retryCount": 0,
    "time": 1701021166
  },
  {
    "id": 38423167,
    "title": "레딧의 블랙아웃에 대한 성찰: 결과에 대한 평가",
    "originLink": "https://news.ycombinator.com/item?id=38423167",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38423167",
    "commentBody": "",
    "originSummary": [
      "화자는 Reddit에서 정전 사태의 결과에 대한 정보를 찾고 있습니다.",
      "그들은 Reddit이 동의했는지, 타협했는지, 아니면 운동의 추진력을 잃었는지 알고 싶어합니다."
    ],
    "commentSummary": [
      "레딧 정전은 정책 변경으로 이어지지는 않았지만, 많은 콘텐츠 제작자가 레딧을 떠나고 주요 하위 레딧의 인기가 하락하는 결과를 초래했습니다.",
      "제한된 API 사용, 스팸, 품질 저하와 관련된 문제에도 불구하고 Reddit은 여전히 사용자와 트래픽 측면에서 성장하고 있습니다.",
      "서브레딧스탯츠닷컴의 정확성에 대한 논쟁과 가짜 계정 및 콘텐츠 조작의 존재에 대한 추측이 계속되고 있습니다."
    ],
    "points": 416,
    "commentCount": 358,
    "retryCount": 0,
    "time": 1701018769
  },
  {
    "id": 38424939,
    "title": "딥 러닝의 이해: 신경망, 훈련 모델, 윤리에 대한 종합 가이드",
    "originLink": "https://udlbook.github.io/udlbook/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38424939",
    "commentBody": "",
    "originSummary": [
      "사이먼 J.D. 프린스의 저서 '딥러닝의 이해'는 2023년 12월 5일에 MIT Press에서 출간될 예정입니다.",
      "이 책은 지도 및 비지도 학습, 신경망, 손실 함수, 훈련 모델, 성능 측정, 정규화, 컨볼루션 네트워크, 트랜스포머, 강화 학습, 윤리 등 딥 러닝의 광범위한 주제를 다룹니다.",
      "강사는 답안 책자와 시험용/책상용 책자를 요청할 수 있으며, 학생은 선택된 문제 답안과 Python 노트북에 액세스하여 실습 학습을 강화할 수 있습니다."
    ],
    "commentSummary": [
      "이 토론에서는 ML 엔지니어와 ML 과학자의 구분을 포함하여 딥 러닝과 딥 러닝의 다양한 측면에 초점을 맞춥니다.",
      "딥 러닝 기술을 이해하는 것의 중요성과 오래된 머신 러닝 알고리즘의 관련성에 대한 지속적인 논쟁을 강조합니다.",
      "이 대화에서는 OpenAI의 우위, 특정 알고리즘에 대한 전문 지식의 가치, 딥 러닝에서 LSTM과 트랜스포머의 중요성에 대해서도 다룹니다."
    ],
    "points": 313,
    "commentCount": 78,
    "retryCount": 0,
    "time": 1701032069
  },
  {
    "id": 38421044,
    "title": "데이터 표시의 진화: 테이블에서 목록으로",
    "originLink": "https://periodictableoftools.com/index.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38421044",
    "commentBody": "",
    "originSummary": [
      "테이블 보기, 확장된 테이블 보기, 그룹 보기, 목록 보기와 같은 다양한 보기를 사용하여 데이터를 다양한 형식으로 표시합니다.",
      "각 보기에는 고유한 정보 표시 방식이 있으므로 사용자는 필요에 따라 가장 적합한 형식을 선택할 수 있습니다.",
      "이러한 뷰는 유연성과 사용자 지정 옵션을 제공하여 사용자 환경을 개선하고 데이터를 더 쉽게 탐색하고 분석할 수 있도록 합니다."
    ],
    "commentSummary": [
      "이 글에서는 원소 주기율표와 유사하게 도구를 분류하는 웹사이트인 '도구 주기율표'를 중점적으로 다룹니다.",
      "제작자인 시어도어 그레이는 자신의 배열을 옹호하고 도구의 기능과 속성에 따라 도구를 분류하는 것이 얼마나 어려운지 설명합니다.",
      "웹사이트를 둘러싼 논쟁에는 대체 분류 방법과 주기율표의 구조를 다른 과목에도 적용해야 하는지에 대한 논의가 포함됩니다."
    ],
    "points": 310,
    "commentCount": 92,
    "retryCount": 0,
    "time": 1701000867
  },
  {
    "id": 38420554,
    "title": "VectorDB: Python 패키지를 통한 효율적인 텍스트 저장 및 검색",
    "originLink": "https://vectordb.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38420554",
    "commentBody": "",
    "originSummary": [
      "VectorDB는 청킹, 임베딩, 벡터 검색과 같은 기술을 사용하여 텍스트를 쉽게 저장하고 검색할 수 있는 Python 패키지입니다.",
      "메타데이터가 포함된 텍스트 데이터를 관리하기 위한 사용자 친화적인 인터페이스를 제공하며 지연 시간이 짧은 시나리오에 최적화되어 있습니다.",
      "벡터 검색과 임베딩은 방대한 데이터 세트에서 관련 정보를 효율적으로 검색할 수 있으므로 대규모 언어 모델 작업에 매우 중요합니다."
    ],
    "commentSummary": [
      "이 토론에서는 벡터 데이터베이스로서의 VectorDB, 저장 및 지속성을 위한 Kagi의 사용, 청킹 및 벡터 인코딩에 대한 피드백 등 다양한 주제를 다룹니다.",
      "벡터 데이터베이스와 질의응답 데이터베이스를 비교하는 토론과 다양한 데이터베이스 옵션의 성능과 효과에 대한 토론이 진행되고 있습니다.",
      "토론에서는 Python의 성능과 타이핑 시스템에 대해서도 다루고, Chroma, LanceDB, wallabag 등 다양한 데이터베이스를 비교하기도 합니다. 그러나 한 댓글 작성자는 벽라백을 자체 호스팅 솔루션으로 사용하자는 제안은 무의미하다고 일축합니다."
    ],
    "points": 299,
    "commentCount": 92,
    "retryCount": 0,
    "time": 1700994115
  },
  {
    "id": 38423908,
    "title": "어패류 껍질에 대한 녹 포트 진행 상황 업데이트",
    "originLink": "https://github.com/fish-shell/fish-shell/discussions/10123",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38423908",
    "commentBody": "",
    "originSummary": [
      "피쉬쉘 공개 알림 포크는 거의 완성 단계에 접어들었으며, 대부분의 번역 작업이 완료되었지만 리더 및 입력 시스템과 같은 일부 구성 요소는 여전히 번역이 필요한 상태입니다.",
      "C++ 코드는 포트에서 제거될 예정이며, Windows 포트에 대한 계획은 없습니다.",
      "팀은 완성된 포트의 성능에 대한 오해를 명확히 하고 불확실성을 인정하는 한편, 향후 릴리스 및 Windows와의 호환성 문제에 대해 논의합니다."
    ],
    "commentSummary": [
      "물고기 껍질과 그 특징, 그리고 잠재적인 단점에 대한 논의가 있습니다.",
      "현재 피쉬 셸은 C++에서 Rust로 재작성 중이며, 향후 Rust 버전도 출시할 계획입니다.",
      "사용자들은 Fish에 대한 긍정적인 경험을 공유하고 호환성 문제, 성능 고려 사항, C++보다 Rust를 사용할 때의 장점 등 Rust로 전환할 때의 장점과 과제에 대해 논의합니다."
    ],
    "points": 296,
    "commentCount": 129,
    "retryCount": 0,
    "time": 1701024534
  },
  {
    "id": 38420531,
    "title": "발신자를 인증하여 사용자를 사기로부터 보호하는 Monzo의 새로운 앱 기능",
    "originLink": "https://monzo.com/blog/2023/09/06/making-it-clear-when-were-on-a-call-with-you/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38420531",
    "commentBody": "",
    "originSummary": [
      "Monzo는 앱에 사용자가 Monzo라고 주장하는 발신자가 진짜인지 확인할 수 있는 새로운 기능을 추가했습니다.",
      "사용자는 개인정보 보호 및 보안 설정에서 \"Monzo 통화 상태\"를 확인하여 진짜 Monzo 팀원이 통화 중인지 확인할 수 있습니다.",
      "이 기능은 Monzo 직원을 사칭하여 사용자를 속여 송금하도록 유도하는 사기꾼으로부터 사용자를 보호하기 위해 고안되었습니다.",
      "이 기능이 출시된 이후 고객들은 이미 하루에 약 100회 정도 이 기능을 사용하여 잠재적인 사기를 신고하고 있습니다.",
      "Monzo는 향후 이 기능의 가시성과 접근성을 개선할 계획입니다."
    ],
    "commentSummary": [
      "이 대화에서는 여러 은행에 대한 경험, 전화 사기 및 피싱 시도에 대한 우려, 고객 서비스에 대한 불만 등 다양한 뱅킹 보안 주제를 다룹니다.",
      "참가자들은 전화나 이메일을 통해 개인 정보를 공유하지 않도록 주의를 기울이고 강력한 인증 방법을 사용하는 것이 중요하다고 강조합니다.",
      "특정 보안 조치를 구현하는 데 따르는 어려움과 잠재적 위험에 대한 논의가 진행 중입니다."
    ],
    "points": 295,
    "commentCount": 208,
    "retryCount": 0,
    "time": 1700993697
  },
  {
    "id": 38421452,
    "title": "개인 글꼴 만들기: 웹 퍼블리싱을 위한 손글씨에서 트루 타입(TTF)으로 전환하기",
    "originLink": "https://kokorobot.ca/site/making_a_font.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38421452",
    "commentBody": "",
    "originSummary": [
      "작가는 만화에 사용할 폰트를 직접 제작하는 프로젝트에 착수하여 디지털 손글씨와 스캔한 이미지를 기반으로 두 번의 반복 작업을 거쳤습니다.",
      "대문자와 소문자, 숫자, 기본 구두점을 강조하면서 서체의 다양한 구성 요소에 대해 배웠습니다.",
      "글자의 불완전한 부분을 정리하고, 글꼴을 만들고, 커닝을 사용하여 문자 간격을 조정하기 위해 Gimp 및 FontForge와 같은 도구를 활용했습니다. 글꼴을 테스트하고 내보내기 문제를 해결한 후 최종적으로 웹 퍼블리싱용 트루타입 글꼴(TTF)을 선택했습니다."
    ],
    "commentSummary": [
      "이 글에서 소개하는 폰트포지는 오픈소스 폰트 제작 소프트웨어입니다.",
      "이 글에서는 상용 경쟁업체와 비교하여 FontForge의 한계를 강조합니다.",
      "사용자들이 추천하는 글꼴 생성 옵션으로는 Glyphs, RoboFont, fontra.xyz, BirdFont 등이 있습니다."
    ],
    "points": 255,
    "commentCount": 24,
    "retryCount": 0,
    "time": 1701005499
  },
  {
    "id": 38424633,
    "title": "립그렙 14.0.0 릴리스: 새로운 기능, 성능 향상 및 버그 수정",
    "originLink": "https://github.com/BurntSushi/ripgrep/releases/tag/14.0.0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38424633",
    "commentBody": "",
    "originSummary": [
      "ripgrep 14.0.0 릴리스에는 새로운 기능, 성능 개선 및 버그 수정이 포함되어 있습니다.",
      "주요 기능으로는 하이퍼링크 지원, 재작성된 정규식 엔진, 인수 구문 분석 라이브러리 변경 등이 있습니다.",
      "또한 이번 릴리스에는 파일 유형 필터링, 추가 플래그, 셸 완성 및 매뉴얼 페이지에 대한 릴리스 프로세스 변경이 포함되어 있어 기능, 성능 및 사용자 환경이 개선되었습니다."
    ],
    "commentSummary": [
      "프로젝트 파일용 오픈소스 검색 도구인 Ripgrep 14가 출시되어 속도와 효율성에 대한 긍정적인 피드백을 받고 있습니다.",
      "사용자들은 sd, grep-ast, semgrep 등 여러 코드 검색 및 조작 도구를 추천합니다.",
      "이 대화에서는 하이퍼링크 지원과 같은 립그렙의 기능에 대해서도 논의하고, 싱글 코어 모드와 다른 도구와의 비교에 대한 우려도 제기합니다."
    ],
    "points": 247,
    "commentCount": 62,
    "retryCount": 0,
    "time": 1701030111
  },
  {
    "id": 38420892,
    "title": "여러 명의 간병인: 엄마와 아이의 웰빙을 위한 열쇠",
    "originLink": "https://phys.org/news/2023-11-hunter-gatherer-approach-childcare-key-mother.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38420892",
    "commentBody": "",
    "originSummary": [
      "최근 수렵 채집 사회를 대상으로 실시한 연구에 따르면 영유아는 여러 보호자의 높은 수준의 개인적 관심과 보살핌을 받는 것이 도움이 된다고 합니다.",
      "수렵 채집 영아는 하루에 약 9시간 동안 최대 15명의 다양한 간병인으로부터 세심한 보살핌과 신체적 접촉을 받습니다.",
      "이 연구는 서방 국가들이 단순한 감독을 넘어 엄마와 아이 모두의 복지를 강조하는 합리적인 가격의 고품질 보육 지원을 우선시해야 한다고 주장합니다. 또한, 나이가 많은 어린이와 청소년을 돌봄에 참여시키는 것도 도움이 될 수 있습니다.",
      "이 연구는 대규모 네트워크 내의 안정적인 핵심 보호자 집단이 아동의 정서 및 인지 발달에 중요한 역할을 한다고 제안합니다.",
      "저자들은 산모와 아이가 건강하게 성장하는 데 필요한 지원과 보살핌을 제공하는 데 있어 사회, 정책 입안자, 고용주, 의료 서비스 간의 협력이 중요하다고 강조합니다."
    ],
    "commentSummary": [
      "이 대화에서는 육아, 부모에 대한 사회적 지원, 공동 생활, 직장 내 역학관계, 인구 증가, 자본주의의 영향 등 다양한 주제를 다룹니다.",
      "참가자들은 개인적인 경험을 공유하고, 이론에 대해 토론하고, 해결책을 제안하며 이러한 문제에 대한 다양한 관점을 제시합니다.",
      "이 대담에서는 현대 부모들이 직면한 복잡성과 도전 과제, 그리고 사회 구조가 육아에 미치는 영향에 대해 조명합니다."
    ],
    "points": 221,
    "commentCount": 256,
    "retryCount": 0,
    "time": 1700999045
  },
  {
    "id": 38423860,
    "title": "PipeWire 1.0.0: 계정 제한이 강화된 '엘 프레지던트' 도입",
    "originLink": "https://gitlab.freedesktop.org/pipewire/pipewire/-/releases/1.0.0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38423860",
    "commentBody": "",
    "originSummary": [
      "현재 PipeWire의 버전은 1.0.0으로, 엘 프레지던트라는 별명을 가지고 있습니다.",
      "이 요약은 파이프와이어 및 다양한 프로젝트 구성 요소에 대한 GitLab 리포지토리에 대한 링크를 제공합니다.",
      "스팸의 유입으로 인해 신규 계정 생성에 제한이 있습니다."
    ],
    "commentSummary": [
      "Linux 오디오 서버인 PipeWire는 기능성과 사용자 친화적인 인터페이스로 인정을 받고 있습니다.",
      "사용자들은 MacOS에서 어려움을 겪는 작업을 처리할 수 있는 PipeWire의 기능과 고가의 앱 구매에 비해 비용 효율성이 뛰어나다는 점을 높이 평가합니다.",
      "일부 사용자가 기술적인 문제와 높은 CPU 사용량을 보고했지만, 전반적인 만족도와 향후 발전 가능성은 높은 편입니다."
    ],
    "points": 189,
    "commentCount": 72,
    "retryCount": 0,
    "time": 1701024214
  },
  {
    "id": 38423844,
    "title": "온라인 체스에서 광범위한 부정행위의 증거 없음",
    "originLink": "https://dorianquelle.github.io/blog/How-To-Catch-Smart-Cheaters/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38423844",
    "commentBody": "",
    "originSummary": [
      "저자는 온라인 체스 토너먼트에서 부정행위를 연구하는 방법론을 제시하고 광범위한 부정행위에 대한 주장을 반박합니다.",
      "차이점 분석을 사용하여 온라인과 오프라인 토너먼트에서 부정행위 발생률을 비교하고 부정행위의 지표로 Elo 등급을 제안합니다.",
      "체스닷컴의 화요일 게임 데이터에 따르면 부정행위의 증거는 발견되지 않았으며, 보고서에서는 체스닷컴과 FIDE 등급의 정확도를 비교하여 온라인 체스에서 부정행위가 만연해 있다는 주장은 근거가 없다고 결론지었습니다."
    ],
    "commentSummary": [
      "이번 토론은 특히 나카무라 히카루 선수가 연루된 체스 토너먼트 '화요일'의 부정행위 의혹을 중심으로 진행되었습니다.",
      "주제에는 그랜드마스터 레벨에서 감지되지 않는 부정행위의 가능성, 부정행위 방지 대책의 부재, 성적의 통계적 차이 등이 포함됩니다.",
      "이 밖에도 눈에 보이는 평가가 체스 실력에 미치는 영향, 토너먼트에서 헤드폰 착용 금지, 빠른 체스에서의 부정행위에 대한 의견 등 다양한 주제가 논의되었습니다."
    ],
    "points": 188,
    "commentCount": 115,
    "retryCount": 0,
    "time": 1701024125
  }
]
