[
  {
    "id": 38427864,
    "title": "Google Drive-gebruikers gealarmeerd nu bestanden verdwijnen en terugkeren naar 2023",
    "originLink": "https://support.google.com/drive/thread/245055606/google-drive-files-suddenly-disappeared-the-drive-literally-went-back-to-condition-in-may-2023?hl=en",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38427864",
    "commentBody": "",
    "originSummary": [
      "Gebruikers ondervinden een groot probleem met Google Drive, omdat hun bestanden en mappenstructuur zijn verdwenen en zijn teruggezet naar mei 2023.",
      "Ondanks het volgen van Google's herstelproces is er nog geen oplossing gevonden, wat leidt tot frustratie en bezorgdheid onder gebruikers.",
      "Google support is op de hoogte van het probleem en werkt samen met productengineers om het probleem te onderzoeken en op te lossen, maar de oorzaak en de tijdlijn voor een oplossing blijven onbekend."
    ],
    "commentSummary": [
      "Gebruikers klagen over de slechte klantenservice van bedrijven als Google en Microsoft.",
      "Het gesprek draait om gegevensverlies op cloudopslagplatforms en de noodzaak van back-ups.",
      "Gebruikers bespreken de beperkingen van het alleen vertrouwen op cloud-opslag en de voordelen van het diversifiëren van back-upstrategieën."
    ],
    "points": 481,
    "commentCount": 178,
    "retryCount": 0,
    "time": 1701057300
  },
  {
    "id": 38429370,
    "title": "Schakel over naar Firefox voor sterkere privacy en bescherming tegen online tracking",
    "originLink": "https://tuta.com/blog/best-private-browsers",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38429370",
    "commentBody": "",
    "originSummary": [
      "Het is belangrijk om privéwebbrowsers te gebruiken om persoonlijke privacy te beschermen en online tracking door reclamebureaus te voorkomen.",
      "Firefox wordt aanbevolen als een voorkeursalternatief voor mainstream browsers vanwege de sterke privacyfuncties en het brede scala aan extensies.",
      "Andere privacy-gerichte browsers zoals DuckDuckGo en Mullvad worden ook genoemd.",
      "De Tor Browser wordt genoemd als de browser met het hoogste niveau van privacy en anonimiteit, hoewel deze langzamer kan zijn vanwege routeringsprocessen.",
      "Het artikel bespreekt verschillende functies en problemen met verschillende browsers, waaronder ad-blocking, VPN-services en twijfelachtige zakelijke praktijken.",
      "Samenwerking wordt aangemoedigd om de veiligheid op internet te verbeteren.",
      "Het artikel gaat ook kort in op onderwerpen als e-mailversleuteling en censuur."
    ],
    "commentSummary": [
      "De belangrijkste focus van de discussie ligt op webbrowsers, met name Chrome en Firefox, en de problemen met uBlock die wordt geblokkeerd in Chrome.",
      "Gebruikers stellen Firefox voor als alternatief vanwege zorgen over prestaties, gebruikerservaring en advertentiepraktijken.",
      "Andere onderwerpen zijn trackingparameters, browserprofielen, aangepaste startpagina's, financiële relaties tussen browsers en advertentiebedrijven en alternatieve browsers zoals Edge, Vivaldi en Brave."
    ],
    "points": 466,
    "commentCount": 289,
    "retryCount": 0,
    "time": 1701071840
  },
  {
    "id": 38423469,
    "title": "Darling: MacOS-software draaien op Linux met een vertaallaag",
    "originLink": "https://www.darlinghq.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38423469",
    "commentBody": "",
    "originSummary": [
      "Darling is een softwarevertaallaag die het mogelijk maakt om macOS-software op Linux te draaien zonder dat er een hardware-emulator nodig is.",
      "Het is een open-source project ontwikkeld op GitHub en gedistribueerd onder de GNU GPL licentie.",
      "Darling is bedoeld om macOS-apps te integreren in de Linux-desktopervaring, net zoals Wine het mogelijk maakt om Windows-software op Linux te draaien."
    ],
    "commentSummary": [
      "Darling is software waarmee gebruikers macOS-toepassingen op Linux kunnen draaien, maar het heeft beperkingen en compatibiliteitsproblemen.",
      "Er is onzekerheid over het vermogen van Darling om op ARM-architectuur te draaien, vooral in het licht van Apple's overgang naar Apple Silicon.",
      "Het draaien van Apple software op niet-Apple hardware brengt juridische implicaties met zich mee, en verschillende methodes en tools om macOS applicaties te draaien op niet-Apple systemen worden besproken. Het porten van Cocoa en de bijbehorende frameworks brengt echter uitdagingen met zich mee."
    ],
    "points": 432,
    "commentCount": 117,
    "retryCount": 0,
    "time": 1701021166
  },
  {
    "id": 38423167,
    "title": "Reflecties op de Blackout van Reddit: Een beoordeling van het resultaat",
    "originLink": "https://news.ycombinator.com/item?id=38423167",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38423167",
    "commentBody": "",
    "originSummary": [
      "De spreker is op zoek naar informatie over de uitkomst van de black-outs op Reddit.",
      "Ze willen graag weten of Reddit akkoord ging, compromissen sloot of dat de beweging momentum verloor."
    ],
    "commentSummary": [
      "De black-out van Reddit leidde niet tot beleidswijzigingen, maar zorgde er wel voor dat veel contentmakers vertrokken, wat resulteerde in een afname van de populariteit van belangrijke subreddits.",
      "Ondanks problemen met beperkt API-gebruik, spam en afnemende kwaliteit, groeit Reddit nog steeds in termen van gebruikers en verkeer.",
      "Er is voortdurend discussie over de nauwkeurigheid van subredditstats.com en er wordt gespeculeerd over de aanwezigheid van nepaccounts en manipulatie van inhoud."
    ],
    "points": 416,
    "commentCount": 358,
    "retryCount": 0,
    "time": 1701018769
  },
  {
    "id": 38424939,
    "title": "Diep leren begrijpen: Een uitgebreide gids voor neurale netwerken, trainingsmodellen en ethiek",
    "originLink": "https://udlbook.github.io/udlbook/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38424939",
    "commentBody": "",
    "originSummary": [
      "Het boek van Simon J.D. Prince, \"Understanding Deep Learning\", wordt op 5 december 2023 uitgebracht door MIT Press.",
      "Het boek verkent een breed scala aan onderwerpen in deep learning, waaronder supervised en unsupervised learning, neurale netwerken, verliesfuncties, trainingsmodellen, prestatiemeting, regularisatie, convolutionaire netwerken, transformatoren, versterkingsleren en ethiek.",
      "Docenten kunnen een antwoordenboekje en een examen-/bureaukopie van het boek aanvragen, terwijl studenten toegang hebben tot geselecteerde vraagantwoorden en Python-notitieblokken om het leren in de praktijk te verbeteren."
    ],
    "commentSummary": [
      "De discussie richt zich op deep learning en de verschillende aspecten ervan, waaronder het onderscheid tussen ML-ingenieurs en ML-wetenschappers.",
      "Het benadrukt het belang van het begrijpen van deep learning-technieken en het voortdurende debat over de relevantie van oudere algoritmen voor machinaal leren.",
      "Het gesprek gaat ook over de dominantie van OpenAI, de waarde van expertise in specifieke algoritmen en het belang van LSTM en transformers in deep learning."
    ],
    "points": 313,
    "commentCount": 78,
    "retryCount": 0,
    "time": 1701032069
  },
  {
    "id": 38421044,
    "title": "De evolutie van gegevensweergave: Van tabellen naar lijsten",
    "originLink": "https://periodictableoftools.com/index.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38421044",
    "commentBody": "",
    "originSummary": [
      "Verschillende weergaven, zoals tabelweergave, uitgebreide tabelweergave, groepsweergave en lijstweergave, worden gebruikt om gegevens in verschillende formaten weer te geven.",
      "Elke weergave heeft zijn eigen unieke manier om informatie te presenteren, zodat gebruikers de meest geschikte indeling voor hun behoeften kunnen kiezen.",
      "Deze weergaven bieden flexibiliteit en aanpassingsopties, waardoor de gebruikerservaring wordt verbeterd en het eenvoudiger wordt om door gegevens te navigeren en deze te analyseren."
    ],
    "commentSummary": [
      "Het artikel richt zich op \"The Periodic Table of Tools\", een website die hulpmiddelen categoriseert vergelijkbaar met het periodiek systeem der elementen.",
      "De maker, Theodore Gray, verdedigt zijn indeling en legt uit hoe moeilijk het is om gereedschappen te categoriseren op basis van hun functies en eigenschappen.",
      "Het debat rond de website gaat over alternatieve categorisatiemethoden en over de vraag of de structuur van het periodiek systeem ook op andere onderwerpen moet worden toegepast."
    ],
    "points": 310,
    "commentCount": 92,
    "retryCount": 0,
    "time": 1701000867
  },
  {
    "id": 38420554,
    "title": "VectorDB: Efficiënt opslaan en ophalen van tekst met Python-pakket",
    "originLink": "https://vectordb.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38420554",
    "commentBody": "",
    "originSummary": [
      "VectorDB is een Python-pakket waarmee je eenvoudig tekst kunt opslaan en ophalen met technieken als chunking, embedding en vectorzoeken.",
      "Het biedt een gebruiksvriendelijke interface voor het beheren van tekstgegevens met metadata en is geoptimaliseerd voor scenario's met een lage latentie.",
      "Vectorzoeken en inbeddingen zijn cruciaal voor het werken met grote taalmodellen, omdat ze het mogelijk maken om relevante informatie efficiënt op te halen uit enorme datasets."
    ],
    "commentSummary": [
      "De discussie gaat over een reeks onderwerpen, waaronder VectorDB als vectordatabase, het gebruik van Kagi voor opslag en persistentie, en feedback over chunking en vectorcodering.",
      "Er zijn debatten waarin vectordatabases worden vergeleken met vraag-en-antwoorddatabases, evenals discussies over de prestaties en effectiviteit van verschillende databaseopties.",
      "De discussies gaan ook over de prestaties en het typsysteem van Python en vergelijken verschillende databases zoals Chroma, LanceDB en wallabag. Eén commentator doet de suggestie om wallabag te gebruiken als een zelf gehoste oplossing echter af als irrelevant."
    ],
    "points": 299,
    "commentCount": 92,
    "retryCount": 0,
    "time": 1700994115
  },
  {
    "id": 38423908,
    "title": "Update over voortgang roesthaven voor Fish-Shell",
    "originLink": "https://github.com/fish-shell/fish-shell/discussions/10123",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38423908",
    "commentBody": "",
    "originSummary": [
      "De fish-shell public notifications fork nadert de voltooiing van de rust port, waarbij het meeste vertaalwerk gedaan is, maar sommige onderdelen nog vertaald moeten worden, zoals de reader en het invoersysteem.",
      "De C++-code wordt verwijderd uit de port en er zijn geen plannen voor een Windows-port.",
      "Het team verduidelijkt misvattingen en erkent de onzekerheid over de prestaties van de voltooide port, terwijl toekomstige releases en compatibiliteitsproblemen met Windows worden besproken."
    ],
    "commentSummary": [
      "Er is een discussie over de Fish shell en zijn functies, maar ook over mogelijke tekortkomingen.",
      "De Fish shell wordt momenteel herschreven van C++ naar Rust, met plannen om in de toekomst een Rust-versie uit te brengen.",
      "Gebruikers delen hun positieve ervaringen met Fish en bespreken de voordelen en uitdagingen van de overgang naar Rust, inclusief compatibiliteitsproblemen, prestatieoverwegingen en de voordelen van het gebruik van Rust ten opzichte van C++."
    ],
    "points": 296,
    "commentCount": 129,
    "retryCount": 0,
    "time": 1701024534
  },
  {
    "id": 38420531,
    "title": "Nieuwe app-functie van Monzo verifieert bellers om gebruikers te beschermen tegen fraude",
    "originLink": "https://monzo.com/blog/2023/09/06/making-it-clear-when-were-on-a-call-with-you/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38420531",
    "commentBody": "",
    "originSummary": [
      "Monzo heeft een nieuwe functie toegevoegd aan zijn app waarmee gebruikers kunnen controleren of een beller die beweert van Monzo te zijn, authentiek is.",
      "Gebruikers kunnen de \"Monzo-gespreksstatus\" controleren in de privacy- en beveiligingsinstellingen om te bevestigen of er een echt Monzo-teamlid aan het gesprek deelneemt.",
      "Deze functie is ontworpen om gebruikers te beschermen tegen fraudeurs die zich voordoen als Monzo medewerkers om hen te misleiden om geld te sturen.",
      "Sinds de lancering hebben klanten deze functie al ongeveer 100 keer per dag gebruikt om mogelijke fraude te melden.",
      "Monzo is van plan om de zichtbaarheid en toegankelijkheid van deze functie in de toekomst te verbeteren."
    ],
    "commentSummary": [
      "De gesprekken gaan over een breed scala aan onderwerpen op het gebied van bankbeveiliging, waaronder ervaringen met verschillende banken, zorgen over telefoonoplichting en phishingpogingen en frustraties over de klantenservice.",
      "Deelnemers benadrukken het belang van voorzichtigheid en het niet delen van persoonlijke informatie via de telefoon of e-mail, evenals het gebruik van sterke verificatiemethoden.",
      "Er wordt gediscussieerd over de uitdagingen en potentiële risico's die gepaard gaan met het implementeren van bepaalde beveiligingsmaatregelen."
    ],
    "points": 295,
    "commentCount": 208,
    "retryCount": 0,
    "time": 1700993697
  },
  {
    "id": 38421452,
    "title": "Een persoonlijk lettertype maken: Van handschrift naar True Type (TTF) voor webpublicaties",
    "originLink": "https://kokorobot.ca/site/making_a_font.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38421452",
    "commentBody": "",
    "originSummary": [
      "De auteur begon aan een project om hun eigen lettertype te maken voor hun strip, wat resulteerde in twee iteraties op basis van digitaal handschrift en een gescande afbeelding.",
      "Ze leerden over de verschillende onderdelen van een lettertype, met de nadruk op hoofdletters en kleine letters, cijfers en basispunctie.",
      "Gereedschappen zoals Gimp en FontForge werden gebruikt om onvolkomenheden in de letters op te ruimen, het lettertype te creëren en de tekenafstand aan te passen met kerning. Het lettertype werd getest en problemen met exporteren werden uiteindelijk opgelost, met als uiteindelijke keuze een True Type Font (TTF) voor publicatie op het web."
    ],
    "commentSummary": [
      "FontForge is een open-source software voor het maken van lettertypes die in het artikel wordt besproken.",
      "Het artikel benadrukt de beperkingen van FontForge in vergelijking met commerciële concurrenten.",
      "Gebruikers raden andere opties aan om lettertypes te maken, zoals Glyphs, RoboFont, fontra.xyz en BirdFont."
    ],
    "points": 255,
    "commentCount": 24,
    "retryCount": 0,
    "time": 1701005499
  },
  {
    "id": 38424633,
    "title": "Uitgave Ripgrep 14.0.0: Nieuwe functies, prestatieverbeteringen en bugfixes",
    "originLink": "https://github.com/BurntSushi/ripgrep/releases/tag/14.0.0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38424633",
    "commentBody": "",
    "originSummary": [
      "De versie ripgrep 14.0.0 bevat nieuwe functies, prestatieverbeteringen en bugfixes.",
      "De belangrijkste functies zijn hyperlinkondersteuning, een herschreven regex engine en een wijziging in de bibliotheek voor het parsen van argumenten.",
      "De release bevat ook verbeteringen in het filteren van bestandstypes, extra vlaggen en wijzigingen in het release proces voor shell completies en man pagina's, wat resulteert in verbeterde functionaliteit, prestaties en gebruikerservaring."
    ],
    "commentSummary": [
      "Ripgrep 14, een open-source zoekprogramma voor projectbestanden, is uitgebracht en heeft positieve feedback ontvangen voor zijn snelheid en efficiëntie.",
      "Gebruikers raden verschillende gereedschappen aan voor het zoeken en manipuleren van code, waaronder sd, grep-ast en semgrep.",
      "Het gesprek bespreekt ook de functies van Ripgrep, zoals ondersteuning voor hyperlinks, en uit zorgen over de single-core modus en vergelijkingen met andere tools."
    ],
    "points": 247,
    "commentCount": 62,
    "retryCount": 0,
    "time": 1701030111
  },
  {
    "id": 38420892,
    "title": "Meerdere verzorgers: Sleutel tot welzijn voor moeders en kinderen",
    "originLink": "https://phys.org/news/2023-11-hunter-gatherer-approach-childcare-key-mother.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38420892",
    "commentBody": "",
    "originSummary": [
      "Een recent onderzoek in jager-verzamelaarsamenlevingen suggereert dat baby's en peuters baat hebben bij veel persoonlijke aandacht en zorg van meerdere verzorgers.",
      "Kinderen van jager-verzamelaars krijgen ongeveer negen uur per dag aandachtige zorg en lichamelijk contact van wel 15 verschillende verzorgers.",
      "De studie stelt dat Westerse landen prioriteit moeten geven aan betaalbare kinderopvang van hoge kwaliteit die verder gaat dan alleen toezicht en de nadruk legt op het welzijn van zowel moeders als kinderen. Bovendien kan het gunstig zijn om oudere kinderen en adolescenten bij de zorg te betrekken.",
      "Het onderzoek stelt dat stabiele sets van kernverzorgers binnen grotere netwerken een cruciale rol spelen in de emotionele en cognitieve ontwikkeling van kinderen.",
      "De auteurs benadrukken het belang van samenwerking tussen de maatschappij, beleidsmakers, werkgevers en gezondheidsdiensten bij het bieden van de nodige steun en zorg voor moeders en kinderen."
    ],
    "commentSummary": [
      "Het gesprek gaat over verschillende onderwerpen met betrekking tot ouderschap, maatschappelijke steun voor ouders, samenleven, dynamiek op de werkplek, bevolkingsgroei en de impact van het kapitalisme.",
      "Deelnemers delen hun persoonlijke ervaringen, discussiëren over theorieën en stellen oplossingen voor, waarbij ze verschillende perspectieven op deze kwesties bieden.",
      "Het gesprek werpt een licht op de complexiteit en uitdagingen waar moderne ouders mee te maken hebben en op de invloed van maatschappelijke structuren op het ouderschap."
    ],
    "points": 221,
    "commentCount": 256,
    "retryCount": 0,
    "time": 1700999045
  },
  {
    "id": 38423860,
    "title": "PipeWire 1.0.0: Introductie van 'El Presidente' met verbeterde accountbeperkingen",
    "originLink": "https://gitlab.freedesktop.org/pipewire/pipewire/-/releases/1.0.0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38423860",
    "commentBody": "",
    "originSummary": [
      "De huidige versie van PipeWire is 1.0.0, bijgenaamd El Presidente.",
      "De samenvatting bevat links naar de GitLab repository voor PipeWire en de verschillende projectonderdelen.",
      "Er zijn beperkingen op het aanmaken van nieuwe accounts vanwege een toevloed aan spam."
    ],
    "commentSummary": [
      "PipeWire, een Linux audioserver, krijgt steeds meer erkenning voor zijn functionaliteit en gebruiksvriendelijke interface.",
      "Gebruikers waarderen het vermogen van PipeWire om taken uit te voeren waar MacOS moeite mee heeft en de kosteneffectiviteit in vergelijking met de aanschaf van dure programma's.",
      "Hoewel sommige gebruikers technische problemen en hoog CPU-gebruik hebben gemeld, is de algemene tevredenheid over PipeWire en het potentieel voor toekomstige ontwikkeling hoog."
    ],
    "points": 189,
    "commentCount": 72,
    "retryCount": 0,
    "time": 1701024214
  },
  {
    "id": 38423844,
    "title": "Geen bewijs voor wijdverspreid valsspelen bij online schaken",
    "originLink": "https://dorianquelle.github.io/blog/How-To-Catch-Smart-Cheaters/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38423844",
    "commentBody": "",
    "originSummary": [
      "De auteur presenteert een methodologie voor het bestuderen van valsspelen in online schaaktoernooien en weerlegt beweringen over wijdverspreid valsspelen.",
      "Ze gebruiken een difference-in-difference analyse om valsspeelpercentages in online en offline toernooien te vergelijken en stellen Elo-ratings voor als een metriek voor valsspelen.",
      "Gegevens van getitelde dinsdagwedstrijden op Chess.com tonen geen bewijs van valsspelen, en het rapport vergelijkt ook de nauwkeurigheid van Chess.com en FIDE-ratings en concludeert dat beschuldigingen van wijdverspreid valsspelen bij online schaken ongegrond zijn."
    ],
    "commentSummary": [
      "De discussie gaat over beschuldigingen van valsspelen in het schaaktoernooi met de titel Tuesday, waarbij met name speler Hikaru Nakamura betrokken is.",
      "Onderwerpen zijn onder andere de mogelijkheid van ondetecteerbaar valsspelen op grootmeesterniveau, het gebrek aan maatregelen om valsspelen te voorkomen en statistische verschillen in prestaties.",
      "Andere gespreksonderwerpen zijn het effect van zichtbare evaluatie op schaakprestaties, het verbieden van koptelefoons in toernooien en meningen over valsspelen bij snelschaken."
    ],
    "points": 188,
    "commentCount": 115,
    "retryCount": 0,
    "time": 1701024125
  }
]
