[
  {
    "id": 38427864,
    "title": "Google Drive kullanıcıları dosyaların kaybolması ve 2023'e geri dönmesi nedeniyle alarma geçti",
    "originLink": "https://support.google.com/drive/thread/245055606/google-drive-files-suddenly-disappeared-the-drive-literally-went-back-to-condition-in-may-2023?hl=en",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38427864",
    "commentBody": "",
    "originSummary": [
      "Kullanıcılar, dosyaları ve klasör yapıları kaybolduğu ve Mayıs 2023'e geri döndüğü için Google Drive ile ilgili önemli bir sorun yaşıyor.",
      "Google'ın kurtarma sürecini takip etmesine rağmen henüz bir çözüm bulunamamış olması kullanıcılar arasında hayal kırıklığı ve endişeye yol açmıştır.",
      "Google destek ekibi sorunun farkındadır ve sorunu araştırmak ve çözmek için ürün mühendisleriyle birlikte çalışmaktadır, ancak çözümün nedeni ve zaman çizelgesi bilinmemektedir."
    ],
    "commentSummary": [
      "Kullanıcılar, Google ve Microsoft gibi şirketler tarafından sağlanan zayıf müşteri hizmetlerinden şikayetçi.",
      "Konuşma, bulut depolama platformlarındaki veri kaybı ve yedekleme ihtiyacı etrafında dönüyor.",
      "Kullanıcılar, yalnızca bulut depolamaya güvenmenin sınırlamalarını ve yedekleme stratejilerini çeşitlendirmenin faydalarını tartışıyor."
    ],
    "points": 481,
    "commentCount": 178,
    "retryCount": 0,
    "time": 1701057300
  },
  {
    "id": 38429370,
    "title": "Daha Güçlü Gizlilik ve Çevrimiçi İzlemeye Karşı Koruma için Firefox'a Geçin",
    "originLink": "https://tuta.com/blog/best-private-browsers",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38429370",
    "commentBody": "",
    "originSummary": [
      "Kişisel gizliliği korumak ve reklam ajansları tarafından çevrimiçi izlemeyi önlemek için özel web tarayıcıları kullanmak önemlidir.",
      "Firefox, güçlü gizlilik özellikleri ve geniş uzantı yelpazesi nedeniyle ana akım tarayıcılara tercih edilen bir alternatif olarak önerilmektedir.",
      "DuckDuckGo ve Mullvad gibi diğer gizlilik odaklı tarayıcılardan da bahsedilmektedir.",
      "Tor Browser, yönlendirme işlemleri nedeniyle daha yavaş olsa da, en yüksek düzeyde gizlilik ve anonimlik sağladığı vurgulanmaktadır.",
      "Makale, reklam engelleme, VPN hizmetleri ve şüpheli iş uygulamaları da dahil olmak üzere farklı tarayıcılarla ilgili çeşitli özellikleri ve endişeleri tartışıyor.",
      "İnternet güvenliğinin geliştirilmesi için işbirliği teşvik edilmektedir.",
      "Makale ayrıca e-posta şifreleme ve sansür gibi konulara da kısaca değiniyor."
    ],
    "commentSummary": [
      "Tartışmanın ana odağı web tarayıcıları, özellikle Chrome ve Firefox ve uBlock'un Chrome'da engellenmesiyle ilgili sorunlar.",
      "Kullanıcılar performans, kullanıcı deneyimi ve reklam uygulamaları konusundaki endişeleri nedeniyle Firefox'u alternatif olarak önermektedir.",
      "Diğer konular arasında izleme parametreleri, tarayıcı profilleri, özel başlangıç sayfaları, tarayıcılar ve reklam şirketleri arasındaki finansal ilişkiler ve Edge, Vivaldi ve Brave gibi alternatif tarayıcılar yer alıyor."
    ],
    "points": 466,
    "commentCount": 289,
    "retryCount": 0,
    "time": 1701071840
  },
  {
    "id": 38423469,
    "title": "Darling: Çeviri Katmanı ile Linux'ta macOS Yazılımını Çalıştırın",
    "originLink": "https://www.darlinghq.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38423469",
    "commentBody": "",
    "originSummary": [
      "Darling, macOS yazılımının bir donanım emülatörüne ihtiyaç duymadan Linux üzerinde çalışmasını sağlayan bir yazılım çeviri katmanıdır.",
      "GitHub üzerinde geliştirilen ve GNU GPL lisansı altında dağıtılan açık kaynaklı bir projedir.",
      "Darling, Wine'ın Windows yazılımlarını Linux üzerinde çalıştırmaya izin vermesine benzer şekilde macOS uygulamalarını Linux masaüstü deneyimine entegre etmeyi amaçlıyor."
    ],
    "commentSummary": [
      "Darling, kullanıcıların macOS uygulamalarını Linux üzerinde çalıştırmalarını sağlayan bir yazılımdır, ancak sınırlamaları ve uyumluluk sorunları vardır.",
      "Özellikle Apple'ın Apple Silicon'a geçişi ışığında Darling'in ARM mimarisi üzerinde çalışabilme kabiliyeti konusunda belirsizlik bulunmaktadır.",
      "Apple yazılımını Apple olmayan donanımlarda çalıştırmak yasal sonuçlar doğurur ve macOS uygulamalarını macOS olmayan sistemlerde çalıştırmak için farklı yöntemler ve araçlar tartışılır. Bununla birlikte, Cocoa'nın tamamını ve çerçevelerini taşımak zorluklar doğurmaktadır."
    ],
    "points": 432,
    "commentCount": 117,
    "retryCount": 0,
    "time": 1701021166
  },
  {
    "id": 38423167,
    "title": "Reddit'in Karartılması Üzerine Düşünceler: Sonuca İlişkin Bir Değerlendirme",
    "originLink": "https://news.ycombinator.com/item?id=38423167",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38423167",
    "commentBody": "",
    "originSummary": [
      "Konuşmacı, Reddit'teki kesintilerin sonucu hakkında bilgi arıyor.",
      "Reddit'in kabul edip etmediğini, uzlaşıp uzlaşmadığını ya da hareketin ivme kaybedip kaybetmediğini bilmek istiyorlar."
    ],
    "commentSummary": [
      "Reddit karartması politika değişikliklerine yol açmadı, ancak birçok içerik oluşturucunun ayrılmasına neden oldu ve bu da büyük alt dizinlerin popülaritesinin azalmasına neden oldu.",
      "Kısıtlı API kullanımı, spam ve düşen kalite ile ilgili sorunlara rağmen, Reddit hala kullanıcı ve trafik açısından büyüme yaşıyor.",
      "Subredditstats.com'un doğruluğu hakkında devam eden tartışmalar ve sahte hesapların varlığı ve içerik manipülasyonu hakkında spekülasyonlar var."
    ],
    "points": 416,
    "commentCount": 358,
    "retryCount": 0,
    "time": 1701018769
  },
  {
    "id": 38424939,
    "title": "Derin Öğrenmeyi Anlamak: Sinir Ağları, Eğitim Modelleri ve Etik Üzerine Kapsamlı Bir Kılavuz",
    "originLink": "https://udlbook.github.io/udlbook/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38424939",
    "commentBody": "",
    "originSummary": [
      "Simon J.D. Prince'in \"Understanding Deep Learning\" adlı kitabı 5 Aralık 2023 tarihinde MIT Press tarafından yayımlanacak.",
      "Kitap, denetimli ve denetimsiz öğrenme, sinir ağları, kayıp fonksiyonları, eğitim modelleri, performans ölçümü, düzenlileştirme, evrişimli ağlar, dönüştürücüler, takviyeli öğrenme ve etik dahil olmak üzere derin öğrenmede çok çeşitli konuları incelemektedir.",
      "Eğitmenler bir cevap kitapçığı ve kitabın bir sınav/masa kopyasını talep edebilirken, öğrenciler uygulamalı öğrenmeyi geliştirmek için seçilmiş soru cevaplarına ve Python defterlerine erişebilirler."
    ],
    "commentSummary": [
      "Tartışma, makine öğrenimi mühendisleri ve makine öğrenimi bilim insanları arasındaki ayrım da dahil olmak üzere derin öğrenme ve farklı yönlerine odaklanmaktadır.",
      "Derin öğrenme tekniklerini anlamanın önemini ve eski makine öğrenimi algoritmalarının uygunluğu hakkında devam eden tartışmaları vurgulamaktadır.",
      "Konuşmada ayrıca OpenAI'nin hakimiyeti, belirli algoritmalarda uzmanlığın değeri ve derin öğrenmede LSTM ve dönüştürücülerin önemine de değinildi."
    ],
    "points": 313,
    "commentCount": 78,
    "retryCount": 0,
    "time": 1701032069
  },
  {
    "id": 38421044,
    "title": "Veri Gösteriminin Evrimi: Tablolardan Listelere",
    "originLink": "https://periodictableoftools.com/index.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38421044",
    "commentBody": "",
    "originSummary": [
      "Verileri çeşitli biçimlerde görüntülemek için tablo görünümü, genişletilmiş tablo görünümü, gruplar görünümü ve liste görünümü gibi farklı görünümler kullanılır.",
      "Her görünümün kendine özgü bir bilgi sunma şekli vardır ve kullanıcıların ihtiyaçları için en uygun formatı seçmelerine olanak tanır.",
      "Bu görünümler esneklik ve özelleştirme seçenekleri sunarak kullanıcı deneyimini geliştirir ve verilerde gezinmeyi ve analiz etmeyi kolaylaştırır."
    ],
    "commentSummary": [
      "Makale, elementlerin periyodik tablosuna benzer şekilde araçları kategorize eden bir web sitesi olan \"Araçların Periyodik Tablosu\" üzerine odaklanıyor.",
      "Yaratıcı Theodore Gray, düzenlemesini savunuyor ve araçları işlevlerine ve özelliklerine göre sınıflandırmanın zorluklarını açıklıyor.",
      "Web sitesini çevreleyen tartışmalar, alternatif kategorizasyon yöntemlerini ve periyodik tablonun yapısının diğer konulara uygulanıp uygulanmayacağını içermektedir."
    ],
    "points": 310,
    "commentCount": 92,
    "retryCount": 0,
    "time": 1701000867
  },
  {
    "id": 38420554,
    "title": "VectorDB: Python Paketi ile Verimli Metin Depolama ve Alma",
    "originLink": "https://vectordb.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38420554",
    "commentBody": "",
    "originSummary": [
      "VectorDB, yığınlama, gömme ve vektör arama gibi teknikleri kullanarak metin depolamayı ve almayı kolaylaştıran bir Python paketidir.",
      "Metin verilerini meta verilerle yönetmek için kullanıcı dostu bir arayüz sunar ve düşük gecikmeli senaryolar için optimize edilmiştir.",
      "Vektör arama ve katıştırmalar, büyük veri kümelerinden ilgili bilgilerin verimli bir şekilde alınmasını sağladıkları için büyük dil modelleriyle çalışmak için çok önemlidir."
    ],
    "commentSummary": [
      "Tartışma, bir vektör veritabanı olarak VectorDB, depolama ve kalıcılık için Kagi kullanımı ve yığınlama ve vektör kodlaması hakkında geri bildirim dahil olmak üzere bir dizi konuyu kapsamaktadır.",
      "Vektör veri tabanları ile soru-cevap veri tabanlarını karşılaştıran tartışmaların yanı sıra çeşitli veri tabanı seçeneklerinin performansı ve etkinliği üzerine tartışmalar da bulunmaktadır.",
      "Tartışmalarda ayrıca Python'un performansına ve yazım sistemine değiniliyor ve Chroma, LanceDB ve wallabag gibi farklı veritabanları karşılaştırılıyor. Ancak, bir yorumcu wallabag'i kendi kendine barındırılan bir çözüm olarak kullanma önerisini ilgisiz olarak değerlendiriyor."
    ],
    "points": 299,
    "commentCount": 92,
    "retryCount": 0,
    "time": 1700994115
  },
  {
    "id": 38423908,
    "title": "Fish-Shell için Pas Limanı İlerlemesi Hakkında Güncelleme",
    "originLink": "https://github.com/fish-shell/fish-shell/discussions/10123",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38423908",
    "commentBody": "",
    "originSummary": [
      "Fish-shell genel bildirimler çatalı, çoğu çeviri işi tamamlanmış ancak okuyucu ve giriş sistemi gibi bazı bileşenlerin hala çevrilmesi gereken rust portunu tamamlamak üzeredir.",
      "C++ kodu porttan kaldırılacak ve Windows portu için herhangi bir plan yok.",
      "Ekip, gelecekteki sürümleri ve Windows ile uyumluluk sorunlarını tartışırken, yanlış anlamaları açıklığa kavuşturuyor ve bitmiş portun performansı hakkındaki belirsizliği kabul ediyor."
    ],
    "commentSummary": [
      "Balık kabuğu ve özelliklerinin yanı sıra potansiyel eksiklikleri hakkında bir tartışma var.",
      "Fish kabuğu şu anda C++'dan Rust'a yeniden yazılıyor ve gelecekte bir Rust sürümü yayınlanması planlanıyor.",
      "Kullanıcılar Fish ile ilgili olumlu deneyimlerini paylaşıyor ve uyumluluk sorunları, performans hususları ve C++ yerine Rust kullanmanın avantajları dahil olmak üzere Rust'a geçişin faydalarını ve zorluklarını tartışıyor."
    ],
    "points": 296,
    "commentCount": 129,
    "retryCount": 0,
    "time": 1701024534
  },
  {
    "id": 38420531,
    "title": "Monzo'nun Yeni Uygulama Özelliği Kullanıcıları Dolandırıcılıktan Korumak İçin Arayanları Doğruluyor",
    "originLink": "https://monzo.com/blog/2023/09/06/making-it-clear-when-were-on-a-call-with-you/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38420531",
    "commentBody": "",
    "originSummary": [
      "Monzo, uygulamasına kullanıcıların Monzo'dan olduğunu iddia eden bir arayanın gerçek olup olmadığını doğrulamalarını sağlayan yeni bir özellik ekledi.",
      "Kullanıcılar, aramada gerçek bir Monzo ekip üyesinin olup olmadığını doğrulamak için gizlilik ve güvenlik ayarlarından \"Monzo arama durumunu\" kontrol edebilirler.",
      "Bu özellik, kullanıcıları Monzo çalışanlarının kimliğine bürünerek onları kandırıp para göndermelerini sağlayan dolandırıcılardan korumak için tasarlanmıştır.",
      "Müşteriler, lansmanından bu yana potansiyel dolandırıcılığı bildirmek için bu özelliği günde yaklaşık 100 kez kullandılar.",
      "Monzo, gelecekte bu özelliğin görünürlüğünü ve erişilebilirliğini artırmayı amaçlamaktadır."
    ],
    "commentSummary": [
      "Konuşmalar, farklı bankalarla yaşanan deneyimler, telefon dolandırıcılığı ve kimlik avı girişimleriyle ilgili endişeler ve müşteri hizmetleriyle ilgili hayal kırıklıkları da dahil olmak üzere çok çeşitli bankacılık güvenliği konularını kapsıyor.",
      "Katılımcılar, temkinli olmanın ve kişisel bilgileri telefon veya e-posta yoluyla paylaşmamanın yanı sıra güçlü kimlik doğrulama yöntemleri kullanmanın önemini vurgulamaktadır.",
      "Belirli güvenlik önlemlerinin uygulanmasıyla ilgili zorluklar ve potansiyel riskler hakkında tartışmalar yapılmaktadır."
    ],
    "points": 295,
    "commentCount": 208,
    "retryCount": 0,
    "time": 1700993697
  },
  {
    "id": 38421452,
    "title": "Kişisel Yazı Tipi Oluşturma: Web Yayıncılığı için El Yazısından True Type'a (TTF)",
    "originLink": "https://kokorobot.ca/site/making_a_font.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38421452",
    "commentBody": "",
    "originSummary": [
      "Yazar, çizgi romanı için kendi yazı tipini oluşturmak üzere bir proje başlattı ve dijital el yazısı ve taranmış bir görüntüye dayanan iki yineleme ile sonuçlandı.",
      "Büyük ve küçük harfleri, sayıları ve temel noktalama işaretlerini vurgulayarak bir yazı karakterinin çeşitli bileşenlerini öğrendiler.",
      "Harflerdeki kusurları temizlemek, yazı tipini oluşturmak ve karakter aralığını karakter aralığı kullanarak ayarlamak için Gimp ve FontForge gibi araçlar kullanıldı. Yazı tipi test edildi ve dışa aktarma sorunları sonunda çözüldü, son seçim web yayıncılığı için bir True Type Yazı Tipi (TTF) oldu."
    ],
    "commentSummary": [
      "FontForge, makalede tartışılan açık kaynaklı bir yazı tipi oluşturma yazılımıdır.",
      "Makale, FontForge'un ticari rakiplerine kıyasla sınırlamalarını vurgulamaktadır.",
      "Kullanıcılar Glyphs, RoboFont, fontra.xyz ve BirdFont gibi diğer yazı tipi oluşturma seçeneklerini önermektedir."
    ],
    "points": 255,
    "commentCount": 24,
    "retryCount": 0,
    "time": 1701005499
  },
  {
    "id": 38424633,
    "title": "Ripgrep 14.0.0 Sürümü: Yeni Özellikler, Performans İyileştirmeleri ve Hata Düzeltmeleri",
    "originLink": "https://github.com/BurntSushi/ripgrep/releases/tag/14.0.0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38424633",
    "commentBody": "",
    "originSummary": [
      "ripgrep 14.0.0 sürümü yeni özellikler, performans iyileştirmeleri ve hata düzeltmeleri getiriyor.",
      "Ana özellikler arasında köprü desteği, yeniden yazılmış bir regex motoru ve argüman ayrıştırma kütüphanesindeki bir değişiklik bulunmaktadır.",
      "Sürüm ayrıca dosya türü filtrelemede geliştirmeler, ek bayraklar ve kabuk tamamlamaları ve man sayfaları için sürüm sürecindeki değişiklikleri de içeriyor ve bu da gelişmiş işlevsellik, performans ve kullanıcı deneyimi sağlıyor."
    ],
    "commentSummary": [
      "Proje dosyaları için açık kaynaklı bir arama aracı olan Ripgrep 14 piyasaya sürüldü ve hızı ve verimliliği konusunda olumlu geri bildirimler aldı.",
      "Kullanıcılar sd, grep-ast ve semgrep gibi çeşitli kod arama ve manipülasyon araçları önermektedir.",
      "Konuşmada ayrıca Ripgrep'in köprü desteği gibi özellikleri tartışılıyor ve tek çekirdek modu ve diğer araçlarla karşılaştırmaları hakkında endişeler dile getiriliyor."
    ],
    "points": 247,
    "commentCount": 62,
    "retryCount": 0,
    "time": 1701030111
  },
  {
    "id": 38420892,
    "title": "Çoklu Bakıcılar: Anneler ve Çocuklar için İyi Olmanın Anahtarı",
    "originLink": "https://phys.org/news/2023-11-hunter-gatherer-approach-childcare-key-mother.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38420892",
    "commentBody": "",
    "originSummary": [
      "Avcı-toplayıcı toplumlarda yapılan yeni bir araştırma, bebeklerin ve küçük çocukların birden fazla bakıcıdan yüksek düzeyde kişisel ilgi ve bakımdan faydalandığını göstermektedir.",
      "Avcı-toplayıcı bebekler, 15 farklı bakıcıdan günde yaklaşık dokuz saat özenli bakım ve fiziksel temas alırlar.",
      "Çalışma, Batı ülkelerinin sadece gözetimin ötesine geçen ve hem annelerin hem de çocukların refahını vurgulayan uygun fiyatlı, yüksek kaliteli çocuk bakım desteğine öncelik vermesi gerektiğini savunuyor. Ayrıca, daha büyük çocukların ve ergenlerin bakım işlerine dahil edilmesi de faydalı olabilir.",
      "Araştırma, daha geniş ağlar içindeki istikrarlı çekirdek bakıcı kümelerinin çocukların duygusal ve bilişsel gelişiminde çok önemli bir rol oynadığını öne sürüyor.",
      "Yazarlar, anne ve çocukların başarılı olabilmeleri için gerekli destek ve bakımın sağlanmasında toplum, politika yapıcılar, işverenler ve sağlık hizmetleri arasındaki işbirliğinin önemini vurgulamaktadır."
    ],
    "commentSummary": [
      "Söyleşide ebeveynlik, ebeveynler için toplumsal destek, ortak yaşam, işyeri dinamikleri, nüfus artışı ve kapitalizmin etkisi ile ilgili çeşitli konular ele alınıyor.",
      "Katılımcılar kişisel deneyimlerini paylaşmakta, teorileri tartışmakta ve çözüm önerileri sunarak bu konulara farklı bakış açıları getirmektedirler.",
      "Sohbet, modern ebeveynlerin karşılaştığı karmaşıklık ve zorlukların yanı sıra toplumsal yapıların ebeveynlik üzerindeki etkisine de ışık tutuyor."
    ],
    "points": 221,
    "commentCount": 256,
    "retryCount": 0,
    "time": 1700999045
  },
  {
    "id": 38423860,
    "title": "PipeWire 1.0.0: Geliştirilmiş Hesap Kısıtlamaları ile 'El Presidente' ile Tanışın",
    "originLink": "https://gitlab.freedesktop.org/pipewire/pipewire/-/releases/1.0.0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38423860",
    "commentBody": "",
    "originSummary": [
      "PipeWire'ın şu anki sürümü El Presidente olarak adlandırılan 1.0.0'dır.",
      "Özet, PipeWire ve farklı proje bileşenleri için GitLab deposuna bağlantılar sağlar.",
      "Spam akını nedeniyle yeni hesap oluşturma konusunda kısıtlamalar var."
    ],
    "commentSummary": [
      "Bir Linux ses sunucusu olan PipeWire, işlevselliği ve kullanıcı dostu arayüzü ile beğeni kazanıyor.",
      "Kullanıcılar PipeWire'ın MacOS'un zorlandığı görevleri yerine getirme becerisini ve pahalı uygulamalar satın almaya kıyasla maliyet etkinliğini takdir ediyor.",
      "Bazı kullanıcılar teknik sorunlar ve yüksek CPU kullanımı bildirmiş olsa da, PipeWire'dan genel memnuniyet ve gelecekteki gelişim potansiyeli yüksektir."
    ],
    "points": 189,
    "commentCount": 72,
    "retryCount": 0,
    "time": 1701024214
  },
  {
    "id": 38423844,
    "title": "Çevrimiçi Satrançta Yaygın Hile Yapıldığına Dair Kanıt Yok",
    "originLink": "https://dorianquelle.github.io/blog/How-To-Catch-Smart-Cheaters/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38423844",
    "commentBody": "",
    "originSummary": [
      "Yazar, çevrimiçi satranç turnuvalarında hileyi incelemek için bir metodoloji sunuyor ve yaygın hile iddialarını çürütüyor.",
      "Çevrimiçi ve çevrimdışı turnuvalardaki hile oranlarını karşılaştırmak için bir fark içinde fark analizi kullanıyorlar ve hile için bir ölçüt olarak Elo derecelendirmelerini öneriyorlar.",
      "Chess.com'daki Başlıklı Salı oyunlarından elde edilen veriler hile yapıldığına dair bir kanıt göstermiyor ve rapor ayrıca Chess.com ve FIDE derecelendirmelerinin doğruluğunu karşılaştırarak çevrimiçi satrançta yaygın hile iddialarının temelsiz olduğu sonucuna varıyor."
    ],
    "commentSummary": [
      "Tartışma, özellikle oyuncu Hikaru Nakamura'nın dahil olduğu Salı başlıklı satranç turnuvasındaki hile iddiaları etrafında dönüyor.",
      "Konular arasında Büyük Usta seviyesinde tespit edilemeyen hile olasılığı, hile önleme tedbirlerinin eksikliği ve performanstaki istatistiksel farklılıklar yer almaktadır.",
      "Diğer sohbet konuları arasında görünür değerlendirmenin satranç performansı üzerindeki etkisi, turnuvalarda kulaklık kullanımının yasaklanması ve hızlı satrançta hile yapılmasına ilişkin görüşler yer alıyor."
    ],
    "points": 188,
    "commentCount": 115,
    "retryCount": 0,
    "time": 1701024125
  }
]
