[
  {
    "id": 38427864,
    "title": "يشعر مستخدمو Google Drive بالقلق مع اختفاء الملفات والعودة إلى عام 2023",
    "originLink": "https://support.google.com/drive/thread/245055606/google-drive-files-suddenly-disappeared-the-drive-literally-went-back-to-condition-in-may-2023?hl=en",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38427864",
    "commentBody": "",
    "originSummary": [
      "يواجه المستخدمون مشكلة كبيرة في Google Drive ، حيث اختفت ملفاتهم وبنية مجلداتهم وعادت إلى مايو 2023.",
      "على الرغم من متابعة عملية استرداد Google ، لم يتم العثور على حل حتى الآن ، مما أدى إلى الإحباط والقلق بين المستخدمين.",
      "يدرك دعم Google المشكلة ويعمل مع مهندسي المنتجات للتحقيق في المشكلة وحلها ، لكن السبب والجدول الزمني للحل لا يزالان غير معروفين."
    ],
    "commentSummary": [
      "يشكو المستخدمون من سوء خدمة العملاء التي تقدمها شركات مثل Google و Microsoft.",
      "تدور المحادثة حول فقدان البيانات على منصات التخزين السحابية والحاجة إلى النسخ الاحتياطية.",
      "يناقش المستخدمون قيود الاعتماد فقط على التخزين السحابي وفوائد تنويع استراتيجيات النسخ الاحتياطي."
    ],
    "points": 481,
    "commentCount": 178,
    "retryCount": 0,
    "time": 1701057300
  },
  {
    "id": 38429370,
    "title": "قم بالتبديل إلى Firefox للحصول على خصوصية وحماية أقوى ضد التتبع عبر الإنترنت",
    "originLink": "https://tuta.com/blog/best-private-browsers",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38429370",
    "commentBody": "",
    "originSummary": [
      "من المهم استخدام متصفحات الويب الخاصة لحماية الخصوصية الشخصية ومنع التتبع عبر الإنترنت من قبل وكالات الإعلان.",
      "يوصى باستخدام Firefox كبديل مفضل للمتصفحات السائدة نظرا لميزات الخصوصية القوية ومجموعة واسعة من الإضافات.",
      "تم ذكر المتصفحات الأخرى الموجهة نحو الخصوصية مثل DuckDuckGo و Mullvad أيضا.",
      "تم تمييز متصفح Tor على أنه يوفر أعلى مستوى من الخصوصية وإخفاء الهوية ، على الرغم من أنه قد يكون أبطأ بسبب عمليات التوجيه.",
      "تناقش المقالة العديد من الميزات والمخاوف مع المتصفحات المختلفة ، بما في ذلك حظر الإعلانات وخدمات VPN والممارسات التجارية المشكوك فيها.",
      "يتم تشجيع التعاون لتحسين أمان الإنترنت.",
      "كما تتطرق المقالة بإيجاز إلى مواضيع مثل تشفير البريد الإلكتروني والرقابة."
    ],
    "commentSummary": [
      "ينصب التركيز الرئيسي للمناقشة على متصفحات الويب ، وخاصة Chrome و Firefox ، والمشكلات المتعلقة بحظر uBlock في Chrome.",
      "يقترح المستخدمون Firefox كبديل بسبب مخاوف بشأن الأداء وتجربة المستخدم والممارسات الإعلانية.",
      "تشمل الموضوعات الأخرى معلمات التتبع وملفات تعريف المتصفح وصفحات البدء المخصصة والعلاقات المالية بين المتصفحات وشركات الإعلان والمتصفحات البديلة مثل Edge و Vivaldi و Brave."
    ],
    "points": 466,
    "commentCount": 289,
    "retryCount": 0,
    "time": 1701071840
  },
  {
    "id": 38423469,
    "title": "حبيبي: قم بتشغيل برنامج macOS على Linux باستخدام طبقة ترجمة",
    "originLink": "https://www.darlinghq.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38423469",
    "commentBody": "",
    "originSummary": [
      "Darling هي طبقة ترجمة برامج تمكن برنامج macOS من العمل على Linux دون الحاجة إلى محاكي للأجهزة.",
      "إنه مشروع مفتوح المصدر تم تطويره على GitHub وتم توزيعه بموجب ترخيص GNU GPL.",
      "يهدف Darling إلى دمج تطبيقات macOS في تجربة سطح مكتب Linux ، على غرار الطريقة التي يسمح بها Wine بتشغيل برامج Windows على Linux."
    ],
    "commentSummary": [
      "Darling هو برنامج يمكن المستخدمين من تشغيل تطبيقات macOS على Linux ، ولكن به قيود ومشكلات توافق.",
      "هناك عدم يقين بشأن قدرة Darling على العمل على بنية ARM ، خاصة في ضوء انتقال Apple إلى Apple Silicon.",
      "يثير تشغيل برامج Apple على أجهزة غير تابعة لشركة Apple آثارا قانونية ، وتتم مناقشة طرق وأدوات مختلفة لتشغيل تطبيقات macOS على أنظمة غير macOS. ومع ذلك ، فإن نقل كل الكاكاو وأطرها يشكل تحديات."
    ],
    "points": 432,
    "commentCount": 117,
    "retryCount": 0,
    "time": 1701021166
  },
  {
    "id": 38423167,
    "title": "تأملات في تعتيم Reddit: تقييم النتيجة",
    "originLink": "https://news.ycombinator.com/item?id=38423167",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38423167",
    "commentBody": "",
    "originSummary": [
      "يسعى المتحدث للحصول على معلومات حول نتائج انقطاع التيار الكهربائي على Reddit.",
      "إنهم مهتمون بمعرفة ما إذا كان Reddit قد وافق أو تنازل أو إذا فقدت الحركة زخمها."
    ],
    "commentSummary": [
      "لم يؤد تعتيم Reddit إلى تغييرات في السياسة ، ولكنه تسبب في مغادرة العديد من منشئي المحتوى ، مما أدى إلى انخفاض شعبية subreddits الرئيسية.",
      "على الرغم من المشكلات المتعلقة بالاستخدام المقيد لواجهة برمجة التطبيقات والبريد العشوائي وانخفاض الجودة ، لا يزال Reddit يشهد نموا من حيث المستخدمين وحركة المرور.",
      "هناك جدل مستمر حول دقة subredditstats.com والتكهنات حول وجود حسابات مزيفة والتلاعب بالمحتوى."
    ],
    "points": 416,
    "commentCount": 358,
    "retryCount": 0,
    "time": 1701018769
  },
  {
    "id": 38424939,
    "title": "فهم التعلم العميق: دليل شامل للشبكات العصبية ونماذج التدريب والأخلاقيات",
    "originLink": "https://udlbook.github.io/udlbook/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38424939",
    "commentBody": "",
    "originSummary": [
      "كتاب سيمون جي دي برينس ، \"فهم التعلم العميق\" ، سيصدر عن مطبعة معهد ماساتشوستس للتكنولوجيا في 5 ديسمبر 2023.",
      "يستكشف الكتاب مجموعة واسعة من الموضوعات في التعلم العميق ، بما في ذلك التعلم الخاضع للإشراف وغير الخاضع للإشراف ، والشبكات العصبية ، ووظائف الخسارة ، ونماذج التدريب ، وقياس الأداء ، والتنظيم ، والشبكات التلافيفية ، والمحولات ، والتعلم المعزز ، والأخلاق.",
      "يمكن للمدرسين طلب كتيب إجابة ونسخة اختبار / مكتب من الكتاب ، بينما يمكن للطلاب الوصول إلى إجابات الأسئلة المحددة ودفاتر ملاحظات Python لتعزيز التعلم العملي."
    ],
    "commentSummary": [
      "تركز المناقشة على التعلم العميق وجوانبه المختلفة ، بما في ذلك التمييز بين مهندسي ML وعلماء ML.",
      "يسلط الضوء على أهمية فهم تقنيات التعلم العميق والنقاش المستمر حول أهمية خوارزميات التعلم الآلي القديمة.",
      "تتطرق المحادثة أيضا إلى هيمنة OpenAI ، وقيمة الخبرة في خوارزميات محددة ، وأهمية LSTM والمحولات في التعلم العميق."
    ],
    "points": 313,
    "commentCount": 78,
    "retryCount": 0,
    "time": 1701032069
  },
  {
    "id": 38421044,
    "title": "تطور عرض البيانات: من الجداول إلى القوائم",
    "originLink": "https://periodictableoftools.com/index.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38421044",
    "commentBody": "",
    "originSummary": [
      "يتم استخدام طرق عرض مختلفة، مثل طريقة عرض الجدول وطريقة عرض الجدول الموسعة وطريقة عرض المجموعات وطريقة عرض القائمة، لعرض البيانات بتنسيقات مختلفة.",
      "كل عرض له طريقته الفريدة في تقديم المعلومات ، مما يسمح للمستخدمين باختيار التنسيق الأنسب لاحتياجاتهم.",
      "توفر طرق العرض هذه خيارات المرونة والتخصيص، مما يعزز تجربة المستخدم ويسهل التنقل في البيانات وتحليلها."
    ],
    "commentSummary": [
      "تركز المقالة على \"الجدول الدوري للأدوات\" ، وهو موقع ويب يصنف الأدوات المشابهة للجدول الدوري للعناصر.",
      "يدافع المبدع ، ثيودور جراي ، عن ترتيبه ويشرح الصعوبات في تصنيف الأدوات بناء على وظائفها وخصائصها.",
      "يتضمن النقاش المحيط بالموقع طرقا بديلة للتصنيف وما إذا كان ينبغي تطبيق هيكل الجدول الدوري على مواضيع أخرى."
    ],
    "points": 310,
    "commentCount": 92,
    "retryCount": 0,
    "time": 1701000867
  },
  {
    "id": 38420554,
    "title": "VectorDB: كفاءة تخزين النصوص واسترجاعها باستخدام حزمة Python",
    "originLink": "https://vectordb.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38420554",
    "commentBody": "",
    "originSummary": [
      "VectorDB هي حزمة Python تجعل من السهل تخزين النص واسترداده باستخدام تقنيات مثل التقسيم والتضمين والبحث المتجه.",
      "يوفر واجهة سهلة الاستخدام لإدارة البيانات النصية باستخدام البيانات الوصفية ويتم تحسينه لسيناريوهات زمن الوصول المنخفض.",
      "يعد البحث عن المتجهات وتضمينها أمرا بالغ الأهمية للعمل مع نماذج اللغات الكبيرة لأنها تسمح بالاسترجاع الفعال للمعلومات ذات الصلة من مجموعات البيانات الضخمة."
    ],
    "commentSummary": [
      "تغطي المناقشة مجموعة من الموضوعات بما في ذلك VectorDB كقاعدة بيانات متجهة ، واستخدام Kagi للتخزين والمثابرة ، وردود الفعل على التقسيم وترميز المتجهات.",
      "هناك مناقشات تقارن قواعد بيانات المتجهات بقواعد بيانات الأسئلة والأجوبة ، بالإضافة إلى مناقشات حول أداء وفعالية خيارات قاعدة البيانات المختلفة.",
      "تتطرق المناقشات أيضا إلى أداء Python ونظام الكتابة ، وتقارن قواعد البيانات المختلفة مثل Chroma و LanceDB و wallabag. ومع ذلك ، يرفض أحد المعلقين اقتراح استخدام wallabag كحل مستضاف ذاتيا باعتباره غير ذي صلة."
    ],
    "points": 299,
    "commentCount": 92,
    "retryCount": 0,
    "time": 1700994115
  },
  {
    "id": 38423908,
    "title": "تحديث حول تقدم ميناء الصدأ لقذيفة السمكة",
    "originLink": "https://github.com/fish-shell/fish-shell/discussions/10123",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38423908",
    "commentBody": "",
    "originSummary": [
      "تقترب شوكة الإخطارات العامة من صدفة السمكة من الانتهاء من ميناء الصدأ ، حيث يتم إنجاز معظم أعمال الترجمة ولكن بعض المكونات لا تزال بحاجة إلى الترجمة ، مثل القارئ ونظام الإدخال.",
      "ستتم إزالة رمز C ++ من المنفذ ، ولا توجد خطط لمنفذ Windows.",
      "يوضح الفريق المفاهيم الخاطئة ويقر بعدم اليقين بشأن أداء المنفذ النهائي ، أثناء مناقشة الإصدارات المستقبلية ومشكلات التوافق مع Windows."
    ],
    "commentSummary": [
      "هناك نقاش حول قذيفة السمك وميزاته ، وكذلك أوجه القصور المحتملة.",
      "تتم حاليا إعادة كتابة قشرة السمكة من C ++ إلى Rust ، مع خطط لإصدار إصدار Rust في المستقبل.",
      "يشارك المستخدمون تجاربهم الإيجابية مع Fish ويناقشون فوائد وتحديات الانتقال إلى Rust ، بما في ذلك مشكلات التوافق واعتبارات الأداء ومزايا استخدام Rust عبر C ++."
    ],
    "points": 296,
    "commentCount": 129,
    "retryCount": 0,
    "time": 1701024534
  },
  {
    "id": 38420531,
    "title": "تتحقق ميزة تطبيق Monzo الجديدة من المتصلين لحماية المستخدمين من الاحتيال",
    "originLink": "https://monzo.com/blog/2023/09/06/making-it-clear-when-were-on-a-call-with-you/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38420531",
    "commentBody": "",
    "originSummary": [
      "أضافت Monzo ميزة جديدة إلى تطبيقها تمكن المستخدمين من التحقق مما إذا كان المتصل الذي يدعي أنه من Monzo أصليا.",
      "يمكن للمستخدمين التحقق من \"حالة مكالمة Monzo\" في إعدادات الخصوصية والأمان لتأكيد ما إذا كان أحد أعضاء فريق Monzo الحقيقي في المكالمة.",
      "تم تصميم هذه الميزة لحماية المستخدمين من المحتالين الذين ينتحلون شخصية موظفي Monzo لخداعهم لإرسال الأموال.",
      "استخدم العملاء بالفعل هذه الميزة حوالي 100 مرة يوميا للإبلاغ عن عمليات احتيال محتملة منذ إطلاقها.",
      "تعتزم Monzo تعزيز رؤية هذه الميزة وإمكانية الوصول إليها في المستقبل."
    ],
    "commentSummary": [
      "تغطي المحادثات مجموعة واسعة من موضوعات الأمن المصرفي ، بما في ذلك التجارب مع البنوك المختلفة ، والمخاوف بشأن عمليات الاحتيال عبر الهاتف ومحاولات التصيد الاحتيالي ، والإحباط من خدمة العملاء.",
      "يؤكد المشاركون على أهمية توخي الحذر وعدم مشاركة المعلومات الشخصية عبر الهاتف أو البريد الإلكتروني ، وكذلك استخدام طرق مصادقة قوية.",
      "هناك مناقشات حول التحديات والمخاطر المحتملة المرتبطة بتنفيذ تدابير أمنية معينة."
    ],
    "points": 295,
    "commentCount": 208,
    "retryCount": 0,
    "time": 1700993697
  },
  {
    "id": 38421452,
    "title": "إنشاء خط شخصي: من الكتابة اليدوية إلى الكتابة الحقيقية (TTF) للنشر على الويب",
    "originLink": "https://kokorobot.ca/site/making_a_font.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38421452",
    "commentBody": "",
    "originSummary": [
      "شرع المؤلف في مشروع لإنشاء خط خاص به لكتابه الهزلي ، مما أدى إلى تكرارين يعتمدان على الكتابة اليدوية الرقمية وصورة ممسوحة ضوئيا.",
      "تعلموا عن المكونات المختلفة للخط ، مع التركيز على الأحرف الكبيرة والصغيرة والأرقام وعلامات الترقيم الأساسية.",
      "تم استخدام أدوات مثل Gimp و FontForge لتنظيف العيوب في الحروف وإنشاء الخط وضبط تباعد الأحرف باستخدام تقنين الحروف. تم اختبار الخط وحل مشكلات التصدير في النهاية ، وكان الخيار النهائي هو True Type Font (TTF) للنشر على الويب."
    ],
    "commentSummary": [
      "FontForge هو برنامج إنشاء خطوط مفتوح المصدر تتم مناقشته في المقالة.",
      "يسلط المقال الضوء على قيود FontForge مقارنة بالمنافسين التجاريين.",
      "يوصي المستخدمون بخيارات إنشاء خطوط أخرى مثل Glyphs و RoboFont و fontra.xyz و BirdFont."
    ],
    "points": 255,
    "commentCount": 24,
    "retryCount": 0,
    "time": 1701005499
  },
  {
    "id": 38424633,
    "title": "إصدار Ripgrep 14.0.0: ميزات جديدة وتحسينات في الأداء وإصلاحات للأخطاء",
    "originLink": "https://github.com/BurntSushi/ripgrep/releases/tag/14.0.0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38424633",
    "commentBody": "",
    "originSummary": [
      "يوفر إصدار ripgrep 14.0.0 ميزات جديدة وتحسينات في الأداء وإصلاحات للأخطاء.",
      "تشمل الميزات الرئيسية دعم الارتباط التشعبي ، ومحرك regex المعاد كتابته ، وتغيير في مكتبة تحليل الوسيطة.",
      "يتضمن الإصدار أيضا تحسينات في تصفية نوع الملف ، وعلامات إضافية ، وتغييرات في عملية الإصدار لإكمالات shell وصفحات الدليل ، مما يؤدي إلى تحسين الوظائف والأداء وتجربة المستخدم."
    ],
    "commentSummary": [
      "تم إصدار Ripgrep 14 ، وهي أداة بحث مفتوحة المصدر لملفات المشروع ، وتلقت ردود فعل إيجابية لسرعتها وكفاءتها.",
      "يوصي المستخدمون بالعديد من أدوات البحث عن التعليمات البرمجية ومعالجتها ، بما في ذلك sd و grep-ast و semgrep.",
      "تناقش المحادثة أيضا ميزات Ripgrep ، مثل دعم الارتباط التشعبي ، وتثير مخاوف بشأن وضعها أحادي النواة والمقارنات بالأدوات الأخرى."
    ],
    "points": 247,
    "commentCount": 62,
    "retryCount": 0,
    "time": 1701030111
  },
  {
    "id": 38420892,
    "title": "تعدد مقدمي الرعاية: مفتاح رفاهية الأمهات والأطفال",
    "originLink": "https://phys.org/news/2023-11-hunter-gatherer-approach-childcare-key-mother.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38420892",
    "commentBody": "",
    "originSummary": [
      "تشير دراسة حديثة أجريت مع مجتمعات الصيادين وجامعي الثمار إلى أن الرضع والأطفال الصغار يستفيدون من مستويات عالية من الاهتمام الشخصي والرعاية من العديد من مقدمي الرعاية.",
      "يتلقى الرضع الذين يصطادون وجامعون ما يقرب من تسع ساعات يوميا من الرعاية اليقظة والاتصال الجسدي من ما يصل إلى 15 من مقدمي الرعاية المختلفين.",
      "تجادل الدراسة بأن الدول الغربية يجب أن تعطي الأولوية لدعم رعاية الأطفال عالي الجودة بأسعار معقولة يتجاوز مجرد الإشراف ويؤكد على رفاهية كل من الأمهات والأطفال. بالإضافة إلى ذلك ، يمكن أن يكون إشراك الأطفال الأكبر سنا والمراهقين في تقديم الرعاية مفيدا.",
      "يقترح البحث أن مجموعات مستقرة من مقدمي الرعاية الأساسيين داخل شبكات أكبر تلعب دورا حاسما في النمو العاطفي والمعرفي للأطفال.",
      "يؤكد المؤلفون على أهمية التعاون بين المجتمع وصانعي السياسات وأصحاب العمل وخدمات الرعاية الصحية في توفير الدعم والرعاية اللازمين للأمهات والأطفال لتزدهر."
    ],
    "commentSummary": [
      "تغطي المحادثة مواضيع مختلفة تتعلق بالأبوة والأمومة ، والدعم المجتمعي للآباء ، والحياة المجتمعية ، وديناميكيات مكان العمل ، والنمو السكاني ، وتأثير الرأسمالية.",
      "يشارك المشاركون تجاربهم الشخصية ، ويناقشون النظريات ، ويقترحون الحلول ، ويقدمون وجهات نظر مختلفة حول هذه القضايا.",
      "تسلط المحادثة الضوء على التعقيدات والتحديات التي يواجهها الآباء المعاصرون ، فضلا عن تأثير الهياكل المجتمعية على الأبوة والأمومة."
    ],
    "points": 221,
    "commentCount": 256,
    "retryCount": 0,
    "time": 1700999045
  },
  {
    "id": 38423860,
    "title": "PipeWire 1.0.0: تقديم \"El Presidente\" مع قيود محسنة على الحساب",
    "originLink": "https://gitlab.freedesktop.org/pipewire/pipewire/-/releases/1.0.0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38423860",
    "commentBody": "",
    "originSummary": [
      "الإصدار الحالي من PipeWire هو 1.0.0 ، الملقب ب El Presidente.",
      "يوفر الملخص ارتباطات إلى مستودع GitLab ل PipeWire ومكونات المشروع المختلفة.",
      "هناك قيود على إنشاء حساب جديد بسبب تدفق البريد العشوائي."
    ],
    "commentSummary": [
      "يكتسب PipeWire ، وهو خادم صوتي Linux ، اعترافا بوظائفه وواجهته سهلة الاستخدام.",
      "يقدر المستخدمون قدرة PipeWire على التعامل مع المهام التي يعاني منها MacOS وفعاليتها من حيث التكلفة مقارنة بشراء تطبيقات باهظة الثمن.",
      "بينما أبلغ بعض المستخدمين عن مشكلات فنية واستخدام مرتفع لوحدة المعالجة المركزية ، فإن الرضا العام عن PipeWire وإمكاناته للتطوير المستقبلي مرتفع."
    ],
    "points": 189,
    "commentCount": 72,
    "retryCount": 0,
    "time": 1701024214
  },
  {
    "id": 38423844,
    "title": "لا يوجد دليل على انتشار الغش في لعبة الشطرنج عبر الإنترنت",
    "originLink": "https://dorianquelle.github.io/blog/How-To-Catch-Smart-Cheaters/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38423844",
    "commentBody": "",
    "originSummary": [
      "يقدم المؤلف منهجية لدراسة الغش في بطولات الشطرنج عبر الإنترنت ويدحض ادعاءات الغش على نطاق واسع.",
      "يستخدمون تحليل الاختلاف في الاختلاف لمقارنة معدلات الغش في البطولات عبر الإنترنت وغير المتصلة بالإنترنت واقتراح تقييمات Elo كمقياس للغش.",
      "لا تظهر البيانات من ألعاب الثلاثاء المعنونة على Chess.com أي دليل على الغش ، ويقارن التقرير أيضا دقة تصنيفات Chess.com و FIDE ، ويخلص إلى أن مزاعم الغش على نطاق واسع في لعبة الشطرنج عبر الإنترنت لا أساس لها من الصحة."
    ],
    "commentSummary": [
      "يتمحور النقاش حول مزاعم الغش في بطولة الشطرنج بعنوان الثلاثاء ، خاصة فيما يتعلق باللاعب هيكارو ناكامورا.",
      "تشمل الموضوعات إمكانية الغش الذي لا يمكن اكتشافه على مستوى Grandmaster ، وعدم وجود تدابير لمنع الغش ، والاختلافات الإحصائية في الأداء.",
      "تشمل نقاط المحادثة الأخرى تأثير التقييم المرئي على أداء الشطرنج ، وحظر سماعات الرأس في البطولات ، والآراء حول الغش في لعبة الشطرنج السريع."
    ],
    "points": 188,
    "commentCount": 115,
    "retryCount": 0,
    "time": 1701024125
  }
]
