[
  {
    "id": 39670922,
    "title": "JSON Canvas: Sonsuz Tuval Veri Organizasyonunu Güçlendirme",
    "originLink": "https://jsoncanvas.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39670922",
    "commentBody": "",
    "originSummary": [
      "JSON Canvas, sonsuz kanvas verileri için tasarlanmış açık bir dosya formatıdır ve kullanıcıların gelişmiş organizasyon için bilgileri mekansal olarak görselleştirmesine ve düzenlemesine olanak tanır.",
      "Sonsuz kanvas uygulamaları kullanılarak oluşturulan veriler için .canvas uzantısını kullanarak uzun ömürlülük, okunabilirlik, birlikte çalışabilirlik ve genişletilebilirlik sunar ve çeşitli araçlara ve uygulamalara serbestçe entegre edilebilir.",
      "Başlangıçta Obsidian için geliştirilen JSON Canvas dosyaları, logo.svg ve readme.md gibi, MIT lisansı altında açık kaynaktır ve ek ayrıntılar için spec/1.0.md gibi gezinme bağlantıları vardır."
    ],
    "commentSummary": [
      "Obsidian, sonsuz kanvas verileri için açık bir dosya formatı olan JSON Canvas'ı tanıttı ve basit ilişkilerle belgeleri ve nesneleri düzenlemeyi basitleştirmeyi amaçlıyor.",
      "Kullanıcılar karışık tepkiler verirken, bazıları yayın öncesi istişare eksikliği konusunda endişelerini dile getirirken, diğerleri Obsidian'ın topluluk geri bildirimi toplama çabasını takdir ediyor.",
      "Tartışmalar, JSON Canvas ve Markdown arasındaki karşılaştırmaları vurgulamakta, açık dosya formatlarının, veri taşınabilirliğinin ve canvas uygulamalarında işbirliğine dayalı geliştirmenin önemini vurgulamaktadır."
    ],
    "points": 678,
    "commentCount": 136,
    "retryCount": 0,
    "time": 1710177742
  },
  {
    "id": 39673087,
    "title": "Webb ve Hubble evrenin genişleme hızı konusunda hemfikir",
    "originLink": "https://www.esa.int/Science_Exploration/Space_Science/Webb/Webb_Hubble_confirm_Universe_s_expansion_rate",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39673087",
    "commentBody": "",
    "originSummary": [
      "Evrenin genişleme hızını belirlemede çok önemli olan Hubble sabiti, çelişkili ölçümler nedeniyle tartışmalara yol açmıştır.",
      "James Webb Uzay Teleskobu'nun Hubble Uzay Teleskobu'nun ölçümlerini doğrulaması, genişleme hızı konusunda yeni perspektifler sunuyor.",
      "Bu doğrulama, genişleme hızını etkileyen gizli değişkenlerin araştırılmasına yol açarak, bilim insanlarını her iki teleskoptan elde edilen daha kesin verilerle araştırmalarını derinleştirmeye itiyor."
    ],
    "commentSummary": [
      "Tartışma, evrenin genişleme hızını ve göksel mesafeleri ölçmek için kullanılan tarihsel yöntemleri, tarihsel figürlere ve kozmolojik kavramlara atıfta bulunarak inceliyor.",
      "Evrenin genişlemesi, kırmızıya kayma fenomeni ve galaksi yaşları üzerine çeşitli teoriler tartışılmakta, fizik yasalarının ve evrenin karmaşıklığının sürekli keşfedilmesi vurgulanmaktadır.",
      "Mevcut kozmolojik modellerdeki sınırlamalar ve kozmolojinin daha da iyileştirilmesinin önemi de ele alınmaktadır."
    ],
    "points": 525,
    "commentCount": 202,
    "retryCount": 0,
    "time": 1710190175
  },
  {
    "id": 39670102,
    "title": "Python/Cpython GIL'i Devre Dışı Bırakmayı Sunuyor",
    "originLink": "https://github.com/python/cpython/pull/116338",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39670102",
    "commentBody": "",
    "originSummary": [
      "Python/Cpython'daki yeni bir özellik, PYTHON_GIL=0 ortam değişkeni veya -X gil=0 seçeneği aracılığıyla Küresel Yorumlayıcı Kilidi'nin (GIL) devre dışı bırakılmasını sağlar.",
      "Bu özelliğe serbest iş parçacıklı derlemelerde erişilebilir ve uyumsuz uzantılar yüklendiğinde GIL'i yeniden etkinleştirmek için ek çalışma gerektirir.",
      "Bu yeni kabiliyetin etkinliğini doğrulamak için test senaryoları uygulamaya konulmuştur."
    ],
    "commentSummary": [
      "GitHub tartışmaları, Global Interpreter Lock'un (GIL) olası devre dışı bırakılmasını tartışarak Python'un hızını artırmaya odaklanıyor.\"",
      "Python, Java ve C++ arasında karşılaştırmalar yapılıyor; Mojo, Pytorch ve Taichi gibi çeşitli araçlar tartışılıyor.\"",
      "Konuşmada dil karmaşıklığı, evrimi, öğrenme eğrileri, eşzamanlılık ve Go, Rust ve C# gibi alternatifler ele alınıyor ve bir programlama dili seçerken hız, kullanım kolaylığı ve performans arasındaki dengeler vurgulanıyor.\""
    ],
    "points": 433,
    "commentCount": 218,
    "retryCount": 0,
    "time": 1710174077
  },
  {
    "id": 39672450,
    "title": "Difüzyon Modelleri: Yeni Bir Teorik Perspektif",
    "originLink": "https://www.chenyang.co/diffusion.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39672450",
    "commentBody": "",
    "originSummary": [
      "Bu eğitim, teori, uygulama ve eğitim kodunu kapsayan, üretken modelleme için difüzyon modellerini, özellikle de çok modlu dağılımlardan örneklemeyi araştırmaktadır.",
      "Gürültü yönünü tahmin etmek için sinir ağlarının eğitimi, farklı gürültü programları ve veri manifold projeksiyonu için denoising teknikleri üzerinde durulmaktadır.",
      "Bu makale, gradyan tahmini kullanan verimli bir örnekleyici tanıtmakta, gelişmiş örnekleme kalitesi için DDIM örnekleyiciyi tartışmakta ve FashionMNIST veri kümesi üzerinde umut verici sonuçlar sergileyen görüntü difüzyon modelleri için eğitim kodu sağlamaktadır."
    ],
    "commentSummary": [
      "Blog yazısı yazarı ve difüzyon kütüphanesi yaratıcısı, difüzyon modellerine yeni bir teorik bakış açısı sunuyor ve bunu başkalarına tavsiye eden kullanıcılar tarafından anlaşılırlığı için övülüyor.",
      "Yazıdaki tartışmalar, yörüngeler, kod uygulaması, matematiksel notasyonlar, oyuncak modeller için eğitim süreleri ve difüzyon modelleri ile Langevin dinamikleri arasındaki ilişki dahil olmak üzere difüzyon modelleri kavramını kapsamaktadır.",
      "Kullanıcılar ayrıca görüntü oluşturmayla ilgili zorluklar, ihtiyaç duyulan önemli eğitim verileri hakkında yorum yapıyor ve makine öğrenimi modelinin doğası ve konvolüsyon denklemleri hakkında konuşmalara katılıyor."
    ],
    "points": 291,
    "commentCount": 36,
    "retryCount": 0,
    "time": 1710186212
  },
  {
    "id": 39666993,
    "title": "Glitter ile Merkezi Olmayan E-Kitap Arama Motoru Oluşturma",
    "originLink": "https://github.com/j2qk3b/ebook-demo/blob/main/tutorial.md",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39666993",
    "commentBody": "",
    "originSummary": [
      "Liber3'ten esinlenen açık kaynaklı merkezi olmayan bir e-kitap arama motoru, veritabanı hizmetleri için Glitter kullanılarak geliştiriliyor.",
      "Proje, kullanıcıların IPFS üzerinde e-kitap arama web sitelerini kurmalarına yardımcı olmayı ve merkezi olmayan bir platformla e-kitap kaynaklarına verimli erişim sağlamayı amaçlamaktadır.",
      "Makale, projeyi başlatma, Glitter ağına bağlanma, arama işlevini uygulama ve arama sonuçlarını ön uç arayüzünde görüntüleme adımlarını, referans için mevcut kaynak koduyla birlikte özetlemektedir."
    ],
    "commentSummary": [
      "Açık kaynak kodlu projelerde eşler arası veri paylaşımı ve tam metin arama yeteneklerine odaklanan açık kaynaklı merkezi olmayan bir e-kitap arama motoru GitHub'da geliştirilmektedir.",
      "OCR, e-kitaplar için semantik arama ve indeksleme süreci ile ilgili projelerden, yapay zeka ve üretici modeller için potansiyel çıkarımlarla birlikte bahsedilmektedir.",
      "Projeyle ilgili fikri mülkiyet korsanlığı konusundaki endişeler ve kafa karışıklığı, tartışma sırasında bazı kullanıcılar tarafından dile getirilmiştir."
    ],
    "points": 267,
    "commentCount": 34,
    "retryCount": 0,
    "time": 1710158205
  },
  {
    "id": 39671218,
    "title": "Kdenlive 24.02: Geliştirilmiş Performans ve Yeni Özellikler",
    "originLink": "https://kdenlive.org/en/2024/03/kdenlive-24-02-0-released/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39671218",
    "commentBody": "",
    "originSummary": [
      "Kdenlive'ın en son sürümü olan 24.02.0, önemli iyileştirmeler, farklı işletim sistemlerinde geliştirilmiş performans, paketleme değişiklikleri ve hata düzeltmeleriyle birlikte çıktı.",
      "Bu güncellemedeki yeni özellikler arasında çoklu altyazı desteği, anahtar kare kolaylaştırma enterpolasyon modları, grup klip efektleri ve çeşitli hata düzeltmeleri ve geliştirmeler yer alıyor.",
      "Geliştirme, hataları ele alan, performansı, kullanıcı deneyimini ve proje istikrarını iyileştiren taahhütlerin yanı sıra, kullanıcıların aktif bir ağ bağlantısı olmadan güncellemeleri kontrol etme yeteneği ile kalan sorunları stabilize etmeye odaklanıyor."
    ],
    "commentSummary": [
      "Açık kaynaklı bir video editörü olan Kdenlive 24.02'nin son sürümü, Lightworks ve Blender ile karşılaştırılarak kullanımı kolay arayüzü ve özellikleri nedeniyle övgüyle karşılandı.",
      "Profesyonel düzenleme için DaVinci Resolve önerilirken, Shotcut maliyetsiz ve kullanıcı merkezli bir alternatif sunuyor.",
      "Linux kullanıcıları Kdenlive'ı verimliliği ve açık kaynak ethosundan dolayı takdir ediyor, ancak bazıları kararlılık sorunlarını dile getirerek yazılımın uzun vadeli sürdürülebilirliğini değerlendirmenin önemini vurguluyor."
    ],
    "points": 258,
    "commentCount": 53,
    "retryCount": 0,
    "time": 1710179215
  },
  {
    "id": 39669167,
    "title": "Airbnb iç mekan güvenlik kameralarını yasaklayarak kiracı mahremiyetine öncelik veriyor",
    "originLink": "https://www.theverge.com/2024/3/11/24097107/airbnb-indoor-security-camera-ban",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39669167",
    "commentBody": "",
    "originSummary": [
      "Airbnb, kiracıların mahremiyetine öncelik vermek için 30 Nisan'dan itibaren iç mekan güvenlik kameralarını yasaklıyor.",
      "Ev sahipleri artık dış mekan güvenlik kameralarının ve gürültü desibel monitörlerinin kullanımını ve yerlerini açıklamak zorundadır.",
      "Güncelleme, misafirlerin gizli kameralar keşfettiği ve Airbnb'nin ev sahiplerinin kiraladıkları evlere kamera yerleştirmelerini kısıtlayarak gizliliği korumaya teşvik eden örneklerin ardından geldi."
    ],
    "commentSummary": [
      "Airbnb kullanıcıları platformdaki değişiklikler, artan ücretler, sınırlı listeleme ve güvenilirlik endişeleri gibi çeşitli konular hakkında tartışmalar yürütüyor.",
      "Tartışmalar arasında Paris gibi şehirlerdeki düzenleyici konular, Airbnb'nin kiralama piyasaları üzerindeki etkisi ve Airbnb ile oteller arasındaki avantaj ve dezavantaj karşılaştırmaları yer alıyor.",
      "Kullanıcılar ayrıca temizlik ücretleri, misafir yükümlülükleri, kamera gibi güvenlik önlemleri ve Airbnb ile normal otellerin farklı fiyatlandırma modelleri gibi konulara da değinerek gizli ücretler ve fiyatlandırma stratejilerinin yanı sıra ev sahipleri ve misafirlerin karşılaştığı zorluklarla ilgili endişelerini dile getiriyor."
    ],
    "points": 258,
    "commentCount": 427,
    "retryCount": 0,
    "time": 1710169705
  },
  {
    "id": 39666865,
    "title": "Teable: Postgres ve Airtable'ın Açık Kaynak Füzyonu",
    "originLink": "https://github.com/teableio/teable",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39666865",
    "commentBody": "",
    "originSummary": [
      "Yazılım, hücre düzenleme, formül desteği, veri sıralama, filtreleme, toplama işlevleri, veri biçimlendirme, gruplama ve içe/dışa aktarma yetenekleri gibi çeşitli özelliklere sahip elektronik tablo benzeri bir arayüz sağlar.",
      "Kullanıcılar verileri ızgara, form ve yakında tanıtılacak olan Kanban, Takvim, Galeri, Gantt ve Zaman Çizelgesi görünümleri gibi birden fazla formatta görüntüleyebilirler.",
      "Yazılım, hızlı yanıt hızı, yüksek veri kapasitesi sağlar, SQL işlemlerini destekler, gizliliğe öncelik verir ve sayfa yenileme gerektirmeden gerçek zamanlı işbirliği sağlar."
    ],
    "commentSummary": [
      "Teable, Postgres ve Airtable'ı birleştiren, elektronik tablo benzeri bir arayüz, formül desteği, veri işleme işlevleri ve tam SQL yetenekleri sunan açık kaynaklı, kodsuz bir veritabanıdır.",
      "Kullanıcılar Teable'ı nocodb, baserow ve grist gibi benzer seçeneklere karşı değerlendiriyor ve Postgres entegrasyonuna ve kullanılabilirliğine odaklanıyor.",
      "Tartışmalar arasında potansiyel geliştirmeler, fiyatlandırma, logo benzerliği gibi etik konular ve diğer araçlarla ayrıntılı karşılaştırmaların yanı sıra çeşitli tarayıcılardaki hatalar ve teknik sorunlarla ilgili endişeler de yer alıyor."
    ],
    "points": 242,
    "commentCount": 83,
    "retryCount": 0,
    "time": 1710157323
  },
  {
    "id": 39672111,
    "title": "Başkalarını Olumsuz Tanımlama Önyargısı Daha Sonraki Karşılaşmalarda Artıyor",
    "originLink": "https://suchscience.org/people-encountered-later-in-a-sequence-described-more-negatively/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39672111",
    "commentBody": "",
    "originSummary": [
      "Journal of Personality and Social Psychology'de yakın zamanda yapılan bir çalışma, bir sıralamada daha sonra değerlendirilen kişilere karşı bilinçsiz bir önyargı olduğunu ve bunun da iş görüşmeleri, reality şovlar veya flört bağlamları gibi çeşitli senaryolarda daha olumsuz algılara yol açtığını ortaya koyuyor.",
      "Araştırma, katılımcıların sırayla daha fazla insanla tanıştıkça giderek daha eleştirel tanımlamalar sergiledikleri ve potansiyel olarak sıralı değerlendirmeleri etkileyen bir \"seri pozisyon-negatiflik etkisi\" olduğunu göstermektedir.",
      "Gelecekteki araştırmalar, kişisel özelliklerin ve grup etkileşimlerinin bu önyargıyı nasıl şekillendirdiğini ve bu hızlı yargıların süresini araştıracaktır."
    ],
    "commentSummary": [
      "Adaylarla mülakatın ilerleyen aşamalarında görüşmek, yargısal çapalama nedeniyle daha olumsuz değerlendirmelere yol açabilir.",
      "Mülakatlar sırasında karar verme, kişisel özellikler, yorgunluk ve kullanılan dilden etkilenebilir ve değerlendirmelerdeki önyargıları yansıtabilir.",
      "İşe alım süreçlerindeki önyargıları azaltmak için stratejiler benimsenmelidir ve bu bulguları doğrulamak için ek araştırmalar gereklidir."
    ],
    "points": 241,
    "commentCount": 104,
    "retryCount": 0,
    "time": 1710183940
  },
  {
    "id": 39668962,
    "title": "Onedoc Labs Yenilikçi PDF Oluşturma Aracını Tanıttı",
    "originLink": "https://github.com/OnedocLabs/react-print-pdf",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39668962",
    "commentBody": "",
    "originSummary": [
      "Büyük şirketlerin eski çalışanları tarafından kurulan Onedoc Labs, otomatik PDF belgesi oluşturmak için react-print-pdf adlı açık kaynaklı bir kütüphane geliştirdi.",
      "Platform, bir API, Node.js SDK ve belge tasarımı için düzen kontrolünün yanı sıra analitik sağlar, belge üretimine ve toplu indirimlere dayalı fiyatlandırma sunar.",
      "Şirket, ürünü Hacker News topluluğu ile paylaşarak görüşlerini almak istediğinden, kullanıcılar aracı kayıt olmadan web sitesinde keşfedebilirler."
    ],
    "commentSummary": [
      "Konuşmada Onedoc, react-pdf ve DocRaptor gibi PDF oluşturma araçları ele alınıyor ve fiyatlandırma, düzen ve erişilebilirlik konularına değiniliyor.",
      "Kullanıcılar, modern ve kullanıcı dostu PDF çözümlerine duyulan ihtiyacı vurgulayarak form doldurma, meta veri, CSS stil ve XPS ile ilgili hususları keşfediyor.",
      "Bu tartışma, güvenilir PDF oluşturma araçlarına yönelik sürekli talebin ve PDF'lerin yaygın olarak kabul gören bir format olarak popülaritesinin altını çiziyor."
    ],
    "points": 229,
    "commentCount": 145,
    "retryCount": 0,
    "time": 1710168776
  },
  {
    "id": 39675807,
    "title": "Trangram: Ücretsiz Hareketli Grafikler ve SVG Animatörü",
    "originLink": "https://www.trangram.com",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39675807",
    "commentBody": "",
    "originSummary": [
      "Trangram, kullanıcıların Adobe Illustrator ve animasyon yazılımlarını andıran sağlam bir editör aracılığıyla hareketli grafikler ve SVG animasyonları tasarlamalarını ve dağıtmalarını sağlayan ücretsiz bir platformdur."
    ],
    "commentSummary": [
      "Hareketli grafikler ve SVG animasyonları oluşturmak için ücretsiz bir platform olan Trangram, alan adıyla ilgili yasal tehditler altında ve Flash'a benzerliği ve geliştirmeler için fikirler üzerine tartışmalara yol açıyor.",
      "Kullanıcılar Trangram'ı kullanıcı dostu arayüzü ve eğitim değeri nedeniyle beğeniyor, ancak eksik özellikler ve web tabanlı uygulamaların uzun vadede uygulanabilirliği konusunda endişelerini dile getiriyorlar."
    ],
    "points": 224,
    "commentCount": 59,
    "retryCount": 0,
    "time": 1710213351
  },
  {
    "id": 39670035,
    "title": "Speedometer 3.0: Web Uygulamalarının Duyarlılığı için Yeni Tarayıcı Karşılaştırması",
    "originLink": "https://browserbench.org/announcements/speedometer3/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39670035",
    "commentBody": "",
    "originSummary": [
      "Apple, Google, Microsoft ve Mozilla tarafından oluşturulan ortak bir tarayıcı kıyaslaması olan Speedometer 3.0, yeni kullanıcı etkileşimi simülasyonlarıyla web uygulamalarının yanıt verebilirliğini değerlendirmek için artık kullanılabilir.",
      "Yeni bir yönetişim yapısı altında geliştirilen bu sistem, tarayıcı görevlerinin ölçümünde doğruluğu artırmak için büyük tarayıcı motorlarının katkılarını içermekte ve performans optimizasyonları ile kullanıcılara potansiyel olarak fayda sağlamaktadır.",
      "Karşılaştırma ölçütü, kullanıcı deneyimini geliştirmek için çeşitli testler ve optimizasyon yolları sunarak çağdaş web ortamını yansıtmaya çalışmaktadır."
    ],
    "commentSummary": [
      "Tartışma, Speedometer 3 gibi tarayıcı performans kıyaslamalarına odaklanıyor ve gerçek dünyadaki web uygulamalarının yanıt verebilirliğini gösteriyor.",
      "Kullanıcılar tarayıcılar ve cihazlar arasında skorları analiz ederek tarayıcı hatalarını, ses uyumluluğunu ve tarayıcıya özgü hataları belirler.",
      "Artan puan iyileştirmeleri, geliştiricilerin farklı cihazlar ve tarayıcılar için uygulamaları optimize etmede karşılaştıkları zorluklar ve tarayıcı performansını etkileyen uzantılarla ilgili endişeler paylaşılarak tarama deneyimlerinin iyileştirilmesi konusundaki söylem zenginleştiriliyor."
    ],
    "points": 208,
    "commentCount": 146,
    "retryCount": 0,
    "time": 1710173838
  }
]
