[
  {
    "id": 40834349,
    "title": "Dentro de un sensor de movimiento por radar de $1",
    "originLink": "https://10maurycy10.github.io/projects/motion_sensor_hacking/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40834349",
    "commentBody": "",
    "originSummary": [
      "La RCWL-0516 es un sensor de movimiento por microondas de bajo costo, con un precio inferior a un dólar, diseñado para la detección de movimiento en un rango de aproximadamente 5 metros.",
      "Utiliza el chip BISS0001, típicamente para la detección de movimiento por infrarrojos, y opera mezclando señales transmitidas y recibidas para detectar movimiento a través de cambios a nivel de milivoltios.",
      "La actuación del sensor es variable, funcionando bien en interiores pero de manera inconsistente en exteriores, y puede ser modificada para mejorar el alcance y la consistencia utilizando un segundo módulo como receptor."
    ],
    "commentSummary": [
      "Un sensor de movimiento por radar de $1 puede detectar movimientos sutiles, como la respiración, utilizando placas ESP32 y funciona a través de las paredes.",
      "Para 2024, las laptops con IA/NPU y Wi-Fi 7 integrarán radar RF e inferencia en el dispositivo para identificar la actividad humana.",
      "Para proyectos de bricolaje, un chip ESP de $3 se puede combinar con estos sensores para soluciones rentables, con mínimas preocupaciones de seguridad debido al uso de ondas de radio no ionizantes."
    ],
    "points": 532,
    "commentCount": 81,
    "retryCount": 0,
    "time": 1719708246
  },
  {
    "id": 40832930,
    "title": "Overleaf: Un editor colaborativo de LaTeX en tiempo real y de código abierto en línea",
    "originLink": "https://github.com/overleaf/overleaf",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40832930",
    "commentBody": "",
    "originSummary": [
      "Overleaf es un editor de LaTeX colaborativo en tiempo real y de código abierto, disponible tanto como un servicio alojado como para implementación local.",
      "Overleaf Server Pro ofrece características mejoradas para laboratorios y lugares de trabajo, incluyendo seguridad (SSO con LDAP o SAML) y herramientas avanzadas de colaboración.",
      "La implementación del proyecto utiliza Docker, con instrucciones detalladas de construcción y contribuciones guiadas por la Licencia Pública General Affero de GNU, versión 3."
    ],
    "commentSummary": [
      "Overleaf es un editor de LaTeX colaborativo en tiempo real y de código abierto, ampliamente utilizado en el ámbito académico para la colaboración remota en artículos.",
      "Los usuarios aprecian su facilidad de uso, características como los comentarios y la sincronización de PDF, y la integración con Git, aunque algunos encuentran Git desafiante para el trabajo sincrónico.",
      "Hay solicitudes de características adicionales, como el soporte de Pandoc para Markdown, destacando áreas para posibles mejoras."
    ],
    "points": 226,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1719690380
  },
  {
    "id": 40834600,
    "title": "Chrome está añadiendo `window.ai`, un modelo de IA Gemini Nano directamente dentro del navegador",
    "originLink": "https://twitter.com/rauchg/status/1806385778064564622",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40834600",
    "commentBody": "",
    "originSummary": [
      "Chrome está integrando `window.ai`, un modelo de IA Gemini Nano, directamente en el navegador, mejorando sus capacidades de IA.",
      "Esta integración es compatible con el Kit de Desarrollo de Software (SDK) de IA, facilitando el desarrollo e implementación más sencilla de las características de IA.",
      "Esta actualización significa un paso significativo hacia funcionalidades de IA más avanzadas que se soportan de manera nativa en los navegadores web."
    ],
    "commentSummary": [
      "Chrome está integrando `window.ai`, un modelo de IA Gemini Nano, directamente en el navegador, enfatizando el procesamiento local en el dispositivo para mejorar la privacidad y la seguridad.",
      "La API es experimental y actualmente está detrás de una bandera, lo que ha generado debates sobre sus implicaciones para la privacidad, la seguridad y los futuros estándares web.",
      "Si bien algunos ven potencial para aplicaciones web mejoradas, otros están preocupados por la compatibilidad del navegador y el posible uso indebido, con algunos usuarios prefiriendo navegadores más simples."
    ],
    "points": 217,
    "commentCount": 166,
    "retryCount": 0,
    "time": 1719712601
  },
  {
    "id": 40837610,
    "title": "Reemplazo de SQS de inserción basado en SQLite",
    "originLink": "https://github.com/poundifdef/SmoothMQ",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40837610",
    "commentBody": "",
    "originSummary": [
      "Se ha creado un reemplazo de código abierto y compatible con la API para Amazon SQS (Simple Queue Service), escrito en Go y distribuido como un único binario utilizando SQLite para el almacenamiento.",
      "La solución ofrece funciones avanzadas como búsqueda, programación, observabilidad y limitación de tasa, y es compatible con las aplicaciones SQS existentes simplemente cambiando el punto final.",
      "Admite múltiples protocolos (AMQP, PubSub) y puede adaptarse a diferentes sistemas de almacenamiento (RocksDB, Postgres), con planes futuros para funcionalidad distribuida y de autoescalado, y tiene como objetivo ofrecer un sistema de colas alojado rentable."
    ],
    "commentSummary": [
      "Se ha desarrollado un reemplazo de código abierto y compatible con la API de Amazon SQS utilizando Go y SQLite, que ofrece características como búsqueda, programación, observabilidad y limitación de velocidad sin requerir reescrituras de aplicaciones.",
      "La solución es compatible con Celery, proporciona mejor visibilidad de mensajes que SQS y es conectable con posibles backends como RocksDB o Postgres, capaz de implementar múltiples protocolos.",
      "Es fácil de implementar como un único binario de Go, con planes futuros para funcionalidad distribuida y de autoescalado, y se anima a proporcionar comentarios."
    ],
    "points": 203,
    "commentCount": 60,
    "retryCount": 0,
    "time": 1719760268
  },
  {
    "id": 40835274,
    "title": "Proyectos de fin de semana: divirtiéndose con C",
    "originLink": "https://lcamtuf.substack.com/p/weekend-projects-getting-silly-with",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40835274",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "La discusión gira en torno al comportamiento indefinido (UB) en el lenguaje de programación C, particularmente la idea errónea de que el UB puede \"viajar en el tiempo\" o afectar la ejecución del código de manera retroactiva.",
      "La norma C23 incluye una nota al pie que aclara que UB no puede viajar en el tiempo, abordando la confusión causada por publicaciones de blog anteriores y comportamientos del compilador.",
      "La conversación también aborda diversas técnicas peculiares y avanzadas de programación en C, como usos no convencionales de las declaraciones switch y las implicaciones de la semántica de la palabra clave volatile."
    ],
    "points": 182,
    "commentCount": 70,
    "retryCount": 0,
    "time": 1719724073
  },
  {
    "id": 40833645,
    "title": "Trilobites muertos por ceniza volcánica",
    "originLink": "https://www.bristol.ac.uk/news/2024/june/prehistoric-pompeii.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40833645",
    "commentBody": "",
    "originSummary": [
      "Fósiles de trilobites excepcionalmente bien conservados del período Cámbrico fueron descubiertos en Marruecos, revelando detalles anatómicos previamente desconocidos.",
      "Los fósiles, preservados por ceniza volcánica hace más de 500 millones de años, muestran cuatro pares de apéndices en la cabeza en lugar de los tres que se pensaba anteriormente, proporcionando nuevas perspectivas sobre los mecanismos de alimentación de los trilobites.",
      "Se utilizó la microtomografía de rayos X de alta resolución (XRµCT) para crear modelos 3D detallados, destacando el potencial de los depósitos de ceniza volcánica para descubrir fósiles bien conservados."
    ],
    "commentSummary": [
      "Paleontólogos han identificado más de 20,000 especies de trilobites, con tamaños que van desde menos de dos milímetros hasta más de 90 centímetros.",
      "La página web trilobites.info es elogiada por su diseño simple y rico en información, que recuerda a los sitios de internet de los primeros tiempos, enfocándose en el contenido en lugar de las tendencias modernas de diseño web.",
      "La descubrimiento de trilobites 'Pompei' bien conservados, que no están aplastados ni deformados, proporciona importantes conocimientos sobre el pasado antiguo, mostrando cada pata dispuesta tal como estaba en vida."
    ],
    "points": 131,
    "commentCount": 21,
    "retryCount": 0,
    "time": 1719699242
  },
  {
    "id": 40835117,
    "title": "OpenDNS suspende el servicio en Francia debido a la orden de bloqueo por piratería de Canal+",
    "originLink": "https://torrentfreak.com/opendns-suspends-service-in-france-due-to-canal-piracy-blocking-order-240629/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40835117",
    "commentBody": "",
    "originSummary": [
      "Un tribunal francés ha ordenado a Google, Cloudflare y Cisco bloquear los registros DNS que eluden los bloqueos existentes de sitios piratas, tras una solicitud de Canal+.",
      "En respuesta, Cisco ha retirado su servicio OpenDNS de Francia, destacando el impacto de las acciones legales en los servicios de internet.",
      "Esta orden judicial es parte de la campaña más amplia de Canal+ contra la piratería, que anteriormente requería que los proveedores de servicios de Internet bloquearan más de 100 sitios de transmisión de deportes piratas, empujando a los usuarios a servidores DNS de terceros."
    ],
    "commentSummary": [
      "OpenDNS ha suspendido su servicio en Francia debido a una orden judicial que exige el bloqueo de sitios de piratería, lo que ha desatado un debate sobre la neutralidad del DNS y el cumplimiento legal.",
      "La conformidad de grandes empresas como Google con tales órdenes plantea preocupaciones sobre el establecimiento de un precedente para la manipulación de DNS y el posible exceso de poder gubernamental.",
      "Los usuarios pueden buscar proveedores de DNS alternativos o VPNs para eludir estas restricciones, lo que resalta los desafíos técnicos y las implicaciones de imponer bloqueos de DNS."
    ],
    "points": 112,
    "commentCount": 43,
    "retryCount": 0,
    "time": 1719721146
  },
  {
    "id": 40833327,
    "title": "La Serie de Juegos de Guerra Operacional: El mejor juego que no está en las tiendas ahora (2021)",
    "originLink": "https://nodicenoglory.com/2021/06/23/the-operational-wargame-series-the-best-game-not-in-stores-now/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40833327",
    "commentBody": "",
    "originSummary": [
      "La Serie de Juegos de Guerra Operacional (OWS) es un juego de mesa que simula combates desde 2025 hasta 2050, desarrollado por el Coronel Retirado Tim Barrick y el Laboratorio de Combate del Cuerpo de Marines de los Estados Unidos (USMCWL).",
      "OWS presenta dos módulos: Assassin’s Mace (teatro INDO-PACOM) y Zapad (teatro europeo), utilizando un sistema de hexágonos y fichas familiar para los jugadores aficionados.",
      "Actualmente, OWS solo está disponible a través de la Asociación del Cuerpo de Marines de los EE. UU. para oficinas del Departamento de Defensa, sin planes de lanzamiento comercial, a pesar de su posible atractivo para los jugadores aficionados."
    ],
    "commentSummary": [
      "La Serie de Juegos de Guerra Operacionales es conocida por su naturaleza detallada y que consume mucho tiempo, a menudo tomando días o semanas para completar turnos.",
      "Pese a los avances digitales, los juegos de guerra de mesa tradicionales siguen siendo populares por su enfoque táctil y práctico, con juegos como Command: Modern Operations y Rule the Waves recomendados para los entusiastas.",
      "Las organizaciones militares continúan utilizando los juegos de guerra manuales con fines de entrenamiento, destacando la importancia de comprender todas las variables en la planificación estratégica."
    ],
    "points": 105,
    "commentCount": 58,
    "retryCount": 0,
    "time": 1719694871
  },
  {
    "id": 40835793,
    "title": "Figma predetermina entrenar modelos de IA con datos personales",
    "originLink": "https://help.figma.com/hc/en-us/articles/17725942479127-Control-AI-features-and-content-training-settings",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40835793",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Figma predetermina el uso de datos personales para entrenar modelos de IA, lo que genera preocupaciones de privacidad entre los usuarios.",
      "Los comentarios del CEO de Microsoft sugieren que las organizaciones poderosas pueden acceder a datos de internet para el entrenamiento de IA, lo que plantea preguntas éticas y legales, especialmente bajo el GDPR.",
      "Se recomienda a los usuarios desactivar el interruptor de entrenamiento de contenido antes del 15 de agosto de 2024 para evitar que sus datos sean utilizados."
    ],
    "points": 98,
    "commentCount": 37,
    "retryCount": 0,
    "time": 1719735058
  },
  {
    "id": 40834345,
    "title": "Café ayudó a la Unión en la Guerra Civil",
    "originLink": "https://www.smithsonianmag.com/history/how-coffee-helped-the-union-caffeinate-their-way-victory-civil-war-180984502/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40834345",
    "commentBody": "",
    "originSummary": [
      "Durante la Guerra Civil, la Unión enfrentó una significativa escasez de café, crucial para la moral y la energía de los soldados, con las importaciones disminuyendo en un 40% para 1862.",
      "Liberia, bajo el presidente Stephen Allen Benson, comenzó a exportar café a la Unión, comenzando con un envío de 6,000 libras en agosto de 1862, ayudando a llenar el vacío causado por el bloqueo de los puertos del sur por parte de la Unión.",
      "La asociación entre los caficultores liberianos y los abolicionistas del norte, junto con el consejo del comerciante de Filadelfia Edward Morris, impulsó la producción de café, haciendo que el café liberiano fuera vital para el esfuerzo bélico de la Unión y contribuyendo a su éxito."
    ],
    "commentSummary": [
      "El café fue un estimulante crucial para los soldados de la Unión durante la Guerra Civil, impactando significativamente sus esfuerzos.",
      "La Confederación utilizaba otros estimulantes como el té, el tabaco y el yaupon, pero la influencia del café en la Unión fue particularmente notable.",
      "La discusión subraya la compleja relación que las personas tienen con la cafeína, equilibrando sus beneficios de productividad con la posible dependencia y las preocupaciones sobre el bienestar."
    ],
    "points": 95,
    "commentCount": 104,
    "retryCount": 0,
    "time": 1719708091
  },
  {
    "id": 40835588,
    "title": "Rodney Brooks sobre las limitaciones de la IA generativa",
    "originLink": "https://techcrunch.com/2024/06/29/mit-robotics-pioneer-rodney-brooks-thinks-people-are-vastly-overestimating-generative-ai/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40835588",
    "commentBody": "",
    "originSummary": [
      "Rodney Brooks, un renombrado pionero en robótica del MIT, cree que la IA generativa a menudo está sobrevalorada y no puede igualar las capacidades humanas.",
      "Brooks argumenta que la IA debería centrarse en problemas específicos y solucionables en lugar de intentar replicar las habilidades humanas, citando ineficiencias en el uso de la IA generativa para tareas como la robótica en almacenes.",
      "También señala que el crecimiento tecnológico no siempre es exponencial, utilizando la capacidad de almacenamiento del iPod como ejemplo, y sugiere que, si bien los Modelos de Lenguaje Grande (LLM) pueden ayudar con tareas como el cuidado de ancianos, no son una solución universal para todos los desafíos de la IA."
    ],
    "commentSummary": [
      "Rodney Brooks discute las limitaciones de la IA generativa, enfatizando que aunque puede realizar tareas específicas, no puede igualar la gama completa de capacidades humanas.",
      "Brooks sugiere limitar el alcance de las aplicaciones de IA e incorporar anulaciones manuales para situaciones inesperadas, prediciendo que el caso comercial para escalar exponencialmente los grandes modelos de lenguaje (LLMs) es débil.",
      "La discusión incluye analogías que comparan los LLM con el iPod, sugiriendo que, al igual que la evolución del iPod al iPhone, los futuros avances en IA pueden integrar funcionalidades más complejas en lugar de simplemente aumentar las capacidades existentes."
    ],
    "points": 93,
    "commentCount": 83,
    "retryCount": 0,
    "time": 1719730946
  },
  {
    "id": 40837791,
    "title": "El desarrollador rechaza la severidad de CVE, hace que su repositorio de GitHub sea de solo lectura",
    "originLink": "https://www.bleepingcomputer.com/news/security/dev-rejects-cve-severity-makes-his-github-repo-read-only/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40837791",
    "commentBody": "",
    "originSummary": [
      "Fedor Indutny ha hecho que su popular proyecto de código abierto, 'node-ip', sea de solo lectura en GitHub debido a un informe disputado de CVE (Common Vulnerabilities and Exposures).",
      "Este incidente subraya un problema creciente donde los desarrolladores de código abierto son bombardeados con informes de CVE cuestionables o falsos, causando pánico y frustración innecesarios.",
      "La mala utilización del sistema CVE, que está destinado a la notificación ética de vulnerabilidades, está complicando la vida de los desarrolladores y contribuyendo al agotamiento."
    ],
    "commentSummary": [
      "Un desarrollador hizo que su repositorio de GitHub fuera de solo lectura después de disputar la gravedad de un informe de Vulnerabilidades y Exposiciones Comunes (CVE).",
      "La incidencia enfatiza que la seguridad debe considerarse como una propiedad emergente de todo el sistema de software, no solo de componentes individuales.",
      "La situación también resalta los desafíos y el agotamiento que enfrentan los mantenedores de código abierto, quienes a menudo reciben poca recompensa material por sus esfuerzos."
    ],
    "points": 89,
    "commentCount": 85,
    "retryCount": 0,
    "time": 1719761821
  },
  {
    "id": 40834305,
    "title": "Patagonia dio a su personal 3 días para decidir si se trasladaban o renunciaban",
    "originLink": "https://www.businessinsider.com/patagonia-cx-staff-told-to-relocate-or-leave-california-2024-6",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40834305",
    "commentBody": "",
    "originSummary": [
      "Patagonia ha dado a 90 empleados de servicio al cliente tres días para decidir si se trasladan a una de las siete ubicaciones en EE. UU. o dejan la empresa, con el objetivo de mejorar la cultura del equipo y apoyar las necesidades del negocio.",
      "A los empleados afectados se les informó a través de una reunión general y se les ofreció $4,000 para gastos de reubicación y tiempo libre remunerado adicional, con una fecha límite del 30 de septiembre para aquellos que no estuvieran dispuestos a reubicarse.",
      "La decisión afecta a 90 de los 255 empleados de experiencia del cliente (CX) en los EE. UU., con algunos empleados expresando decepción por el aparente alejamiento de los valores centrados en los empleados de la empresa."
    ],
    "commentSummary": [
      "Patagonia ha dado a su personal tres días para decidir si se reubican o renuncian debido al exceso de personal, lo que ha generado un debate sobre la ética corporativa y el trato a los empleados.",
      "Los críticos argumentan que esto es un despido encubierto, señalando la generosa indemnización pero insuficiente paquete de reubicación de $4,000, y el corto plazo para tomar una decisión.",
      "La medida se considera potencialmente beneficiosa para los titulares de visas H1B, pero ha recibido reacciones mixtas por parte de empleados y observadores."
    ],
    "points": 82,
    "commentCount": 82,
    "retryCount": 0,
    "time": 1719707462
  },
  {
    "id": 40838290,
    "title": "Un ranking en vivo de aerolíneas según la cantidad de equipaje que están perdiendo",
    "originLink": "https://luggagelosers.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40838290",
    "commentBody": "",
    "originSummary": [
      "LuggageLosers.com ofrece un ranking en vivo de aerolíneas por equipaje perdido, actualizado cada hora utilizando menciones en redes sociales y datos históricos.",
      "El sitio rastrea todas las aerolíneas principales, ajustándose a las diferencias de tamaño, y tiene como objetivo ayudar a los viajeros a elegir aerolíneas con mejor manejo de equipaje.",
      "Las principales aerolíneas actuales en cuanto a pérdida de equipaje incluyen Aer Lingus, Air India y WestJet Airlines, con datos regionales y específicos por país también disponibles."
    ],
    "commentSummary": [
      "A live ranking of airlines by luggage loss reveals Aer Lingus has a 1 in 57 chance of losing luggage, Delta 1 in 497, and Air France 1 in 1,256.",
      "En el ámbito nacional, India tiene una probabilidad de 1 en 97, Estados Unidos de 1 en 497 y Japón de 1 en 7,734, con variaciones influenciadas por los aeropuertos de facturación, las políticas de las aerolíneas y las regulaciones nacionales.",
      "La información proviene de publicaciones en redes sociales, lo que genera preocupaciones sobre su precisión, mientras que el Departamento de Transporte de EE. UU. (DOT) proporciona datos más confiables sobre el equipaje mal manejado."
    ],
    "points": 81,
    "commentCount": 37,
    "retryCount": 0,
    "time": 1719766479
  },
  {
    "id": 40836183,
    "title": "Una red analógica de resistencias promete aprendizaje automático sin un procesador",
    "originLink": "https://www.hackster.io/news/an-analog-network-of-resistors-promises-machine-learning-without-a-processor-researchers-say-d9cb0655b7a0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40836183",
    "commentBody": "",
    "originSummary": [
      "Investigadores de la Universidad de Pensilvania han creado una red de aprendizaje automático analógica utilizando resistencias, con el objetivo de lograr una IA más eficiente en términos de energía.",
      "Este nuevo enfoque elimina la necesidad de un procesador tradicional, utilizando un metamaterial de aprendizaje no lineal basado en transistores para cálculos complejos.",
      "Aunque el prototipo actual consume más energía que los aceleradores digitales modernos, muestra potencial en tareas como la clasificación de imágenes y las operaciones XOR, con posibilidades de mejorar su eficiencia a medida que se escala."
    ],
    "commentSummary": [
      "Los investigadores están explorando una red analógica de transistores, limitada al régimen óhmico, para realizar tareas de aprendizaje automático sin procesadores tradicionales.",
      "Este enfoque podría ofrecer operaciones paralelas más eficientes en comparación con los sistemas digitales, aunque persisten desafíos de implementación práctica como mantener la carga en los condensadores de puerta.",
      "La idea está generando interés debido a su potencial para revolucionar los cálculos de redes neuronales mediante el uso de componentes analógicos, lo que podría llevar a avances significativos en la eficiencia energética y la velocidad de procesamiento."
    ],
    "points": 81,
    "commentCount": 31,
    "retryCount": 0,
    "time": 1719741502
  }
]
