[
  {
    "id": 40834349,
    "title": "בתוך חיישן תנועה רדאר ב-$1",
    "originLink": "https://10maurycy10.github.io/projects/motion_sensor_hacking/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40834349",
    "commentBody": "",
    "originSummary": [
      "מודול חיישן תנועה מיקרוגל RCWL-0516 הוא מודול רדאר בעלות נמוכה, במחיר של פחות מדולר, המיועד לזיהוי תנועה בטווח של כ-5 מטרים.",
      "״הוא משתמש בשבב BISS0001, בדרך כלל לזיהוי תנועה באמצעות אינפרא אדום, ופועל על ידי ערבוב אותות משודרים ומתקבלים כדי לזהות תנועה דרך שינויים ברמת המיליוולט.״",
      "״הביצועים של החיישן משתנים, הוא פועל היטב בתוך מבנים אך באופן לא עקבי בחוץ, וניתן לשפר את הטווח והעקביות שלו על ידי שימוש במודול שני כמקלט.״"
    ],
    "commentSummary": [
      "״חיישן תנועה רדאר בעלות של $1 יכול לזהות תנועות עדינות, כמו נשימה, באמצעות לוחות ESP32 ועובד דרך קירות.״",
      "עד 2024, מחשבים ניידים עם AI/NPU ו-Wi-Fi 7 ישלבו רדאר RF והסקת מסקנות במכשיר כדי לזהות פעילות אנושית.",
      "״לפרויקטים של עשה זאת בעצמך, שבב ESP בעלות של 3 דולר יכול להיות משולב עם חיישנים אלו לפתרונות חסכוניים, עם דאגות בטיחות מינימליות בשל השימוש בגלי רדיו לא מייננים.״"
    ],
    "points": 532,
    "commentCount": 81,
    "retryCount": 0,
    "time": 1719708246
  },
  {
    "id": 40832930,
    "title": "Overleaf: עורך LaTeX שיתופי בזמן אמת מקוון בקוד פתוח",
    "originLink": "https://github.com/overleaf/overleaf",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40832930",
    "commentBody": "",
    "originSummary": [
      "Overleaf הוא עורך LaTeX שיתופי בזמן אמת בקוד פתוח, הזמין הן כשירות מתארח והן לפריסה מקומית.",
      "Overleaf Server Pro מציע תכונות משופרות למעבדות ומקומות עבודה, כולל אבטחה (SSO עם LDAP או SAML) וכלי שיתוף פעולה מתקדמים.",
      "״הפרויקט משתמש ב-Docker לפריסה, עם הוראות בנייה מפורטות ותרומות המונחות על ידי רישיון הציבורי הכללי של GNU Affero, גרסה 3.״"
    ],
    "commentSummary": [
      "״Overleaf הוא עורך LaTeX שיתופי בזמן אמת בקוד פתוח, הנפוץ בשימוש באקדמיה לשיתוף פעולה מרחוק על מאמרים.״",
      "משתמשים מעריכים את קלות השימוש, תכונות כמו הוספת הערות וסנכרון PDF, ואינטגרציה עם Git, אם כי ישנם כאלה שמוצאים את Git מאתגר לעבודה סינכרונית.",
      "יש בקשות לתכונות נוספות כמו תמיכה ב-Pandoc עבור Markdown, מה שמדגיש אזורים לשיפור פוטנציאלי."
    ],
    "points": 226,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1719690380
  },
  {
    "id": 40834600,
    "title": "Chrome מוסיף `window.ai` – מודל AI מסוג Gemini Nano ישירות בתוך הדפדפן",
    "originLink": "https://twitter.com/rauchg/status/1806385778064564622",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40834600",
    "commentBody": "",
    "originSummary": [
      "כרום משלב את `window.ai`, מודל Gemini Nano AI, ישירות לתוך הדפדפן, ומשפר את יכולות ה-AI שלו.",
      "אינטגרציה זו תואמת לערכת הפיתוח של תוכנות בינה מלאכותית (SDK), ומקלה על פיתוח ויישום תכונות בינה מלאכותית.",
      "עדכון זה מסמל צעד משמעותי לקראת תמיכה מובנית בפונקציות AI מתקדמות יותר בדפדפני אינטרנט."
    ],
    "commentSummary": [
      "״כרום משלב את `window.ai`, מודל Gemini Nano AI, ישירות בדפדפן, תוך הדגשת עיבוד מקומי במכשיר לשיפור הפרטיות והאבטחה.״",
      "״ה-API הוא ניסיוני ונמצא כרגע מאחורי דגל, מה שמעורר דיונים על השלכותיו על פרטיות, אבטחה ותקני הרשת העתידיים.״",
      "בעוד שחלק רואים פוטנציאל לשיפור יישומי רשת, אחרים מודאגים מתאימות הדפדפנים ושימוש לרעה פוטנציאלי, כאשר חלק מהמשתמשים מעדיפים דפדפנים פשוטים יותר."
    ],
    "points": 217,
    "commentCount": 166,
    "retryCount": 0,
    "time": 1719712601
  },
  {
    "id": 40837610,
    "title": "תחליף SQS מבוסס SQLite שניתן להכניס",
    "originLink": "https://github.com/poundifdef/SmoothMQ",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40837610",
    "commentBody": "",
    "originSummary": [
      "״נוצר תחליף בקוד פתוח, תואם API, עבור Amazon SQS (Simple Queue Service), שנכתב ב-Go ומופץ כקובץ בינארי יחיד המשתמש ב-SQLite לאחסון.״",
      "״הפתרון מציע תכונות מתקדמות כמו חיפוש, תזמון, ניתור והגבלת קצב, והוא תואם ליישומי SQS קיימים על ידי שינוי פשוט של נקודת הקצה.״",
      "זה תומך בפרוטוקולים מרובים (AMQP, PubSub) וניתן להתאמה לאחסון אחורי שונה (RocksDB, Postgres), עם תוכניות עתידיות לפונקציונליות מבוזרת ואוטומטית, ושואף להציע מערכת תורים מתארחת חסכונית."
    ],
    "commentSummary": [
      "״תחליף קוד פתוח, תואם API לאמזון SQS פותח באמצעות Go ו-SQLite, ומציע תכונות כמו חיפוש, תזמון, ניתור והגבלת קצב ללא צורך בשכתוב אפליקציות.״",
      "״הפתרון תומך ב-Celery, מספק נראות הודעות טובה יותר מ-SQS, וניתן לחיבור עם מערכות אחסון פוטנציאליות כמו RocksDB או Postgres, המסוגלות ליישם פרוטוקולים מרובים.״",
      "״קל לפרוס אותו כקובץ בינארי יחיד של Go, עם תוכניות עתידיות לפונקציונליות מבוזרת ואוטומטית, ועידוד משוב.״"
    ],
    "points": 203,
    "commentCount": 60,
    "retryCount": 0,
    "time": 1719760268
  },
  {
    "id": 40835274,
    "title": "פרויקטים לסוף השבוע: להשתעשע עם C",
    "originLink": "https://lcamtuf.substack.com/p/weekend-projects-getting-silly-with",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40835274",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "הדיון סובב סביב התנהגות בלתי מוגדרת (UB) בשפת התכנות C, במיוחד התפיסה השגויה ש-UB יכול \"לנסוע בזמן\" או להשפיע על ביצוע הקוד באופן רטרואקטיבי.",
      "תקן C23 כולל הערת שוליים המבהירה ש-UB אינו יכול לנסוע בזמן, וזאת כדי לטפל בבלבול שנגרם על ידי פוסטים קודמים בבלוג והתנהגויות של מהדרים.",
      "״השיחה נוגעת גם בטכניקות תכנות C מתקדמות ומוזרות, כמו שימושים לא שגרתיים בפקודות switch והשלכות הסמנטיקה של מילת המפתח volatile.״"
    ],
    "points": 182,
    "commentCount": 70,
    "retryCount": 0,
    "time": 1719724073
  },
  {
    "id": 40833645,
    "title": "טרילוביטים נהרגו על ידי אפר וולקני",
    "originLink": "https://www.bristol.ac.uk/news/2024/june/prehistoric-pompeii.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40833645",
    "commentBody": "",
    "originSummary": [
      "מאובני טרילוביטים שמורים במיוחד מתקופת הקמבריום התגלו במרוקו, וחושפים פרטים אנטומיים שלא היו ידועים קודם לכן.",
      "מאובנים, שנשמרו על ידי אפר וולקני לפני יותר מ-500 מיליון שנה, מראים ארבעה זוגות של נספחים בראש במקום שלושה כפי שחשבו בעבר, ומספקים תובנות חדשות על מנגנוני ההזנה של הטרילוביטים.",
      "״מיקרו-טומוגרפיה ברזולוציה גבוהה באמצעות קרני רנטגן (XRµCT) שימשה ליצירת מודלים תלת-ממדיים מפורטים, המדגישים את הפוטנציאל של משקעי אפר וולקני לחשיפת מאובנים שמורים היטב.״"
    ],
    "commentSummary": [
      "פלאונטולוגים זיהו למעלה מ-20,000 מינים של טרילוביטים, עם גדלים הנעים מפחות משני מילימטרים ועד למעלה מ-90 סנטימטרים.",
      "״האתר trilobites.info זוכה לשבחים על עיצובו הפשוט והעשיר במידע, המזכיר את אתרי האינטרנט המוקדמים, ומתמקד בתוכן במקום במגמות עיצוב אתרים מודרניות.״",
      "התגלית של טרילוביטים 'פומפיי' שמורים היטב, שאינם שטוחים או מעוותים, מספקת תובנות משמעותיות על העבר הקדום, ומציגה כל רגל מסודרת כפי שהייתה בחיים."
    ],
    "points": 131,
    "commentCount": 21,
    "retryCount": 0,
    "time": 1719699242
  },
  {
    "id": 40835117,
    "title": "OpenDNS משעה את השירות בצרפת עקב צו חסימת פיראטיות של Canal+",
    "originLink": "https://torrentfreak.com/opendns-suspends-service-in-france-due-to-canal-piracy-blocking-order-240629/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40835117",
    "commentBody": "",
    "originSummary": [
      "״בית משפט צרפתי הורה לגוגל, Cloudflare, ו-Cisco לחסום רשומות DNS שעוקפות את חסימות האתרים הפיראטיים הקיימות, בעקבות בקשה של Canal+.״",
      "בתגובה, סיסקו הסירה את שירות OpenDNS שלה מצרפת, מה שמדגיש את ההשפעה של פעולות משפטיות על שירותי אינטרנט.",
      "״צו בית המשפט הזה הוא חלק מקמפיין רחב יותר של Canal+ נגד פיראטיות, אשר דרש בעבר מספקי האינטרנט לחסום מעל 100 אתרי סטרימינג פיראטיים של ספורט, מה שדחף משתמשים לשרתים של צד שלישי.״"
    ],
    "commentSummary": [
      "OpenDNS השעתה את שירותה בצרפת בעקבות צו בית משפט המחייב חסימת אתרי פיראטיות, מה שהצית דיון על ניטרליות DNS וציות לחוק.",
      "ציות של חברות גדולות כמו גוגל להוראות כאלה מעלה חששות לגבי יצירת תקדים למניפולציה של DNS ולפוטנציאל של התערבות ממשלתית מוגזמת.",
      "משתמשים עשויים לחפש ספקי DNS חלופיים או VPNs כדי לעקוף את ההגבלות הללו, מה שמדגיש את האתגרים הטכניים וההשלכות של אכיפת חסימות DNS."
    ],
    "points": 112,
    "commentCount": 43,
    "retryCount": 0,
    "time": 1719721146
  },
  {
    "id": 40833327,
    "title": "הסדרה של משחקי המלחמה האופרטיביים: המשחק הטוב ביותר שלא נמצא בחנויות עכשיו (2021)",
    "originLink": "https://nodicenoglory.com/2021/06/23/the-operational-wargame-series-the-best-game-not-in-stores-now/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40833327",
    "commentBody": "",
    "originSummary": [
      "הסדרה למשחקי מלחמה מבצעיים (OWS) היא משחק שולחני המדמה קרבות משנת 2025 עד 2050, שפותח על ידי קולונל בדימוס טים באריק ומעבדת הלחימה של חיל הנחתים של ארצות הברית (USMCWL).",
      "OWS כולל שני מודולים: Assassin’s Mace (תיאטרון INDO-PACOM) ו-Zapad (תיאטרון אירופאי), תוך שימוש במערכת משושים ומונים המוכרת לשחקני תחביב.",
      "נכון לעכשיו, OWS זמין רק דרך איגוד חיל הנחתים של ארה\"ב למשרדי משרד ההגנה, ללא תוכניות לשחרור מסחרי, למרות הפוטנציאל שלו למשוך גיימרים חובבים."
    ],
    "commentSummary": [
      "הסדרה Operational Wargame ידועה באופייה המפורט והזמן הרב שהיא דורשת, ולעיתים קרובות לוקח ימים או שבועות להשלים תורות.",
      "״למרות ההתקדמות הדיגיטלית, משחקי לוח מלחמה מסורתיים נשארים פופולריים בשל הגישה המוחשית והמעשית שלהם, עם משחקים כמו Command: Modern Operations ו-Rule the Waves המומלצים לחובבים.״",
      "ארגונים צבאיים ממשיכים להשתמש במשחקי מלחמה ידניים למטרות אימון, מה שמדגיש את החשיבות של הבנת כל המשתנים בתכנון אסטרטגי."
    ],
    "points": 105,
    "commentCount": 58,
    "retryCount": 0,
    "time": 1719694871
  },
  {
    "id": 40835793,
    "title": "ברירת המחדל של Figma היא לאמן מודלים של בינה מלאכותית על נתונים אישיים",
    "originLink": "https://help.figma.com/hc/en-us/articles/17725942479127-Control-AI-features-and-content-training-settings",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40835793",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "פיגמה משתמשת כברירת מחדל בנתונים אישיים לאימון מודלים של בינה מלאכותית, מה שמעורר חששות פרטיות בקרב המשתמשים.",
      "תגובות מנכ\"ל מיקרוסופט מרמזות שארגונים חזקים יכולים לגשת לנתוני אינטרנט לצורך אימון בינה מלאכותית, מה שמעלה שאלות אתיות ומשפטיות, במיוחד תחת תקנות ה-GDPR.",
      "משתמשים מתבקשים להשבית את מתג אימון התוכן עד ה-15 באוגוסט 2024, כדי למנוע את השימוש בנתוניהם."
    ],
    "points": 98,
    "commentCount": 37,
    "retryCount": 0,
    "time": 1719735058
  },
  {
    "id": 40834345,
    "title": "קפה עזר לאיחוד במלחמת האזרחים",
    "originLink": "https://www.smithsonianmag.com/history/how-coffee-helped-the-union-caffeinate-their-way-victory-civil-war-180984502/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40834345",
    "commentBody": "",
    "originSummary": [
      "במהלך מלחמת האזרחים, האיחוד התמודד עם מחסור משמעותי בקפה, שהיה חיוני למורל ולאנרגיה של החיילים, כאשר היבוא ירד ב-40% עד שנת 1862.",
      "ליבריה, תחת נשיאותו של סטיבן אלן בנסון, החלה לייצא קפה לאיחוד, החל ממשלוח של 6,000 פאונד באוגוסט 1862, ובכך סייעה למלא את הפער שנגרם על ידי המצור של האיחוד על נמלי הדרום.",
      "״השיתוף פעולה בין חקלאי הקפה הליבריים לבין מבטלי העבדות מהצפון, יחד עם עצות מהסוחר מפילדלפיה אדוארד מוריס, הגביר את ייצור הקפה, מה שהפך את הקפה הליברי לחיוני למאמץ המלחמתי של האיחוד ותרם להצלחתם.״"
    ],
    "commentSummary": [
      "לקפה היה תפקיד מכריע כמעורר עבור חיילי האיחוד במהלך מלחמת האזרחים, והשפיע באופן משמעותי על מאמציהם.",
      "״הדרום השתמש בממריצים אחרים כמו תה, טבק ויאופון, אך השפעת הקפה על האיחוד הייתה בולטת במיוחד.״",
      "דיון זה מדגיש את הקשר המורכב שיש לאנשים עם קפאין, תוך איזון בין היתרונות שלו לפרודוקטיביות לבין תלות פוטנציאלית ודאגות לרווחה."
    ],
    "points": 95,
    "commentCount": 104,
    "retryCount": 0,
    "time": 1719708091
  },
  {
    "id": 40835588,
    "title": "רודני ברוקס על מגבלות הבינה המלאכותית הגנרטיבית",
    "originLink": "https://techcrunch.com/2024/06/29/mit-robotics-pioneer-rodney-brooks-thinks-people-are-vastly-overestimating-generative-ai/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40835588",
    "commentBody": "",
    "originSummary": [
      "רודני ברוקס, חלוץ רובוטיקה ידוע מ-MIT, מאמין כי בינה מלאכותית גנרטיבית זוכה לעיתים להערכת יתר ואינה יכולה להשתוות ליכולות האנושיות.",
      "״ברוקס טוען כי על הבינה המלאכותית להתמקד בבעיות ספציפיות ופתירות במקום לנסות לשכפל את היכולות האנושיות, תוך שהוא מציין חוסר יעילות בשימוש בבינה מלאכותית גנרטיבית למשימות כמו רובוטיקה במחסנים.״",
      "״הוא גם מציין שצמיחה טכנולוגית אינה תמיד אקספוננציאלית, תוך שימוש בקיבולת האחסון של ה-iPod כדוגמה, ומציע שבעוד שמודלים גדולים של שפה (LLMs) יכולים לסייע במשימות כמו טיפול בקשישים, הם אינם פתרון אוניברסלי לכל אתגרי הבינה המלאכותית.״"
    ],
    "commentSummary": [
      "רודני ברוקס דן במגבלות של בינה מלאכותית גנרטיבית, ומדגיש שבעוד שהיא יכולה לבצע משימות ספציפיות, היא אינה יכולה להשתוות למלוא היכולות האנושיות.",
      "״ברוקס מציע להגביל את היקף היישומים של בינה מלאכותית ולשלב אפשרויות התערבות ידניות במצבים בלתי צפויים, תוך שהוא חוזה כי המקרה העסקי להרחבה אקספוננציאלית של מודלים לשוניים גדולים (LLMs) הוא חלש.״",
      "הדיון כולל אנלוגיות המשוות בין LLMs ל-iPod, ומציעות שכמו שה-iPod התפתח ל-iPhone, ייתכן שהתקדמויות עתידיות בבינה מלאכותית ישלבו פונקציות מורכבות יותר ולא רק יגדילו את היכולות הקיימות."
    ],
    "points": 93,
    "commentCount": 83,
    "retryCount": 0,
    "time": 1719730946
  },
  {
    "id": 40837791,
    "title": "מתכנת דוחה את חומרת ה-CVE, הופך את מאגר ה-GitHub שלו לקריאה בלבד",
    "originLink": "https://www.bleepingcomputer.com/news/security/dev-rejects-cve-severity-makes-his-github-repo-read-only/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40837791",
    "commentBody": "",
    "originSummary": [
      "פדור אינדוטני הפך את הפרויקט הפופולרי שלו בקוד פתוח, 'node-ip', לקריאה בלבד ב-GitHub עקב דיווח שנוי במחלוקת על CVE (פגיעויות וחשיפות נפוצות).",
      "״תקרית זו מדגישה בעיה הולכת וגוברת שבה מפתחים בקוד פתוח מוצפים בדיווחים מפוקפקים או מזויפים על CVE, מה שגורם לפאניקה ותסכול מיותרים.״",
      "״השימוש לרעה במערכת CVE, שמיועדת לדיווח אתי על פגיעויות, מסבך את חייהם של המפתחים ותורם לשחיקה.״"
    ],
    "commentSummary": [
      "מתכנת הפך את מאגר ה-GitHub שלו לקריאה בלבד לאחר שהתעמת עם חומרת דוח פגיעויות נפוצות וחשיפות (CVE).",
      "״התקרית מדגישה כי יש להתייחס לאבטחה כתכונה מתהווה של כל מערכת התוכנה, ולא רק של רכיבים בודדים.״",
      "המצב גם מדגיש את האתגרים והשחיקה שעומדים בפני מתחזקי קוד פתוח, אשר לעיתים קרובות מקבלים מעט תגמול חומרי על מאמציהם."
    ],
    "points": 89,
    "commentCount": 85,
    "retryCount": 0,
    "time": 1719761821
  },
  {
    "id": 40834305,
    "title": "פטגוניה נתנה לעובדיה 3 ימים להחליט אם לעבור דירה או להתפטר",
    "originLink": "https://www.businessinsider.com/patagonia-cx-staff-told-to-relocate-or-leave-california-2024-6",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40834305",
    "commentBody": "",
    "originSummary": [
      "פאטגוניה נתנה ל-90 עובדי שירות לקוחות שלושה ימים להחליט אם לעבור לאחד משבעה מיקומים בארה\"ב או לעזוב את החברה, במטרה לשפר את תרבות הצוות ולתמוך בצרכי העסק.",
      "צוות העובדים המושפע קיבל הודעה באמצעות פגישה כללית והוצע להם $4,000 לכיסוי עלויות מעבר וזמן חופשה נוסף בתשלום, עם מועד אחרון עד ה-30 בספטמבר עבור אלו שאינם מעוניינים לעבור.",
      "ההחלטה משפיעה על 90 מתוך 255 עובדי חוויית הלקוח (CX) בארה\"ב, כאשר חלק מהעובדים מביעים אכזבה מהתפיסה שהחברה מתרחקת מערכיה הממוקדים בעובדים."
    ],
    "commentSummary": [
      "פאטגוניה נתנה לעובדיה שלושה ימים להחליט אם לעבור מקום או להתפטר בשל עודף כוח אדם, מה שמעורר דיון על אתיקה תאגידית וטיפול בעובדים.",
      "מבקרים טוענים כי מדובר בפיטורים מוסווים, ומצביעים על חבילת הפיצויים הנדיבה אך על חבילת ההעברה הבלתי מספקת של 4,000 דולר, ועל חלון ההחלטה הקצר.",
      "מהלך זה נתפס כבעל פוטנציאל להועיל לבעלי ויזת H1B, אך קיבל תגובות מעורבות מצד עובדים ומשקיפים."
    ],
    "points": 82,
    "commentCount": 82,
    "retryCount": 0,
    "time": 1719707462
  },
  {
    "id": 40838290,
    "title": "דירוג חי של חברות תעופה לפי כמות המטען שהן מאבדות",
    "originLink": "https://luggagelosers.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40838290",
    "commentBody": "",
    "originSummary": [
      "לגג'לוסרס.קום מספק דירוג חי של חברות תעופה לפי כמות מזוודות שאבדו, המתעדכן מדי שעה באמצעות אזכורים ברשתות החברתיות ונתונים היסטוריים.",
      "אתר זה עוקב אחר כל חברות התעופה הגדולות, תוך התאמה להבדלי גודל, ומטרתו לעזור לנוסעים לבחור חברות תעופה עם טיפול טוב יותר במטען.",
      "״חברות התעופה המובילות כיום באובדן כבודה כוללות את אייר לינגוס, אייר אינדיה ו-ווסטג'ט איירליינס, עם נתונים אזוריים וארציים זמינים גם כן.״"
    ],
    "commentSummary": [
      "״דירוג חי של חברות תעופה לפי אובדן מזוודות מגלה כי לאייר לינגוס יש סיכוי של 1 ל-57 לאבד מזוודה, לדלתא 1 ל-497, ולאייר פראנס 1 ל-1,256.״",
      "ברמה הלאומית, בהודו יש סיכוי של 1 ל-97, בארה\"ב 1 ל-497, וביפן 1 ל-7,734, עם שינויים המושפעים משדות התעופה בהם נעשה הצ'ק-אין, מדיניות חברות התעופה והתקנות הלאומיות.",
      "״הנתונים מגיעים מפוסטים ברשתות החברתיות, מה שמעלה חששות לגבי הדיוק, בעוד שמשרד התחבורה של ארצות הברית (DOT) מספק נתונים אמינים יותר על מזוודות שטופלו בצורה לא נכונה.״"
    ],
    "points": 81,
    "commentCount": 37,
    "retryCount": 0,
    "time": 1719766479
  },
  {
    "id": 40836183,
    "title": "רשת אנלוגית של נגדים מבטיחה למידת מכונה ללא מעבד",
    "originLink": "https://www.hackster.io/news/an-analog-network-of-resistors-promises-machine-learning-without-a-processor-researchers-say-d9cb0655b7a0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40836183",
    "commentBody": "",
    "originSummary": [
      "חוקרים מאוניברסיטת פנסילבניה יצרו רשת למידת מכונה אנלוגית באמצעות נגדים, במטרה להשיג בינה מלאכותית חסכונית יותר באנרגיה.",
      "גישה חדשה זו מבטלת את הצורך במעבד מסורתי, תוך שימוש במטא-חומר למידה לא-לינארי המבוסס על טרנזיסטורים לחישובים מורכבים.",
      "על אף שהאב-טיפוס הנוכחי צורך יותר חשמל מאשר מאיצים דיגיטליים מודרניים, הוא מראה הבטחה במשימות כמו סיווג תמונות ופעולות XOR, עם פוטנציאל לשיפור היעילות ככל שהוא יגדל."
    ],
    "commentSummary": [
      "חוקרים בוחנים רשת אנלוגית של טרנזיסטורים, המוגבלת למשטר האומי, לביצוע משימות למידת מכונה ללא מעבדים מסורתיים.",
      "גישה זו עשויה להציע פעולות מקבילות ויעילות יותר בהשוואה למערכות דיגיטליות, אם כי אתגרי יישום מעשיים כמו שמירה על מטען בקבלים של השערים עדיין קיימים.",
      "״הרעיון מעורר עניין בשל הפוטנציאל שלו לחולל מהפכה בחישובי רשתות עצביות באמצעות רכיבים אנלוגיים, מה שיכול להוביל להתקדמות משמעותית ביעילות האנרגטית ובמהירות העיבוד.״"
    ],
    "points": 81,
    "commentCount": 31,
    "retryCount": 0,
    "time": 1719741502
  }
]
