[
  {
    "id": 40834349,
    "title": "1 dollarin tutkan liikeanturin sisällä",
    "originLink": "https://10maurycy10.github.io/projects/motion_sensor_hacking/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40834349",
    "commentBody": "",
    "originSummary": [
      "RCWL-0516 mikroaaltoliiketunnistin on edullinen tutkamoduuli, jonka hinta on alle dollarin ja joka on suunniteltu liikkeentunnistukseen noin 5 metrin etäisyydellä.",
      "Se käyttää BISS0001-sirua, tyypillisesti infrapuna-liikkeentunnistukseen, ja toimii sekoittamalla lähetettyjä ja vastaanotettuja signaaleja havaitakseen liikkeen millivolttitason muutosten kautta.",
      "Anturin suorituskyky on vaihteleva, toimien hyvin sisätiloissa mutta epäjohdonmukaisesti ulkona, ja sitä voidaan parantaa kantaman ja johdonmukaisuuden osalta käyttämällä toista moduulia vastaanottimena."
    ],
    "commentSummary": [
      "Yhden dollarin tutkan liikeanturi voi havaita hienovaraisia liikkeitä, kuten hengitystä, käyttämällä ESP32-kortteja ja toimii seinien läpi.",
      "Vuoteen 2024 mennessä AI/NPU-kannettavat, joissa on Wi-Fi 7, integroituvat RF-tutkan ja laitteessa tapahtuvan päättelyn avulla tunnistamaan ihmisen toimintaa.",
      "DIY-projekteihin voidaan yhdistää 3 dollarin ESP-siru näiden antureiden kanssa kustannustehokkaiden ratkaisujen saavuttamiseksi, ja turvallisuushuolia on vähän, koska käytössä ovat ionisoimattomat radioaallot."
    ],
    "points": 532,
    "commentCount": 81,
    "retryCount": 0,
    "time": 1719708246
  },
  {
    "id": 40832930,
    "title": "Overleaf: Avoimen lähdekoodin online reaaliaikainen yhteistyö LaTeX-editori",
    "originLink": "https://github.com/overleaf/overleaf",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40832930",
    "commentBody": "",
    "originSummary": [
      "Overleaf on avoimen lähdekoodin, reaaliaikainen yhteistyö LaTeX-editori, joka on saatavilla sekä isännöitynä palveluna että paikallisesti asennettavana.",
      "Overleaf Server Pro tarjoaa parannettuja ominaisuuksia laboratorioille ja työpaikoille, mukaan lukien turvallisuus (SSO LDAP- tai SAML-järjestelmällä) ja edistyneet yhteistyötyökalut.",
      "Projekti käyttää Dockeria käyttöönottoon, ja yksityiskohtaiset rakennusohjeet sekä kontribuutiot ohjataan GNU Affero General Public License, version 3, mukaisesti."
    ],
    "commentSummary": [
      "Overleaf on avoimen lähdekoodin, reaaliaikainen yhteistyö LaTeX-editori, jota käytetään laajasti akateemisessa maailmassa etäyhteistyöhön artikkeleiden parissa.",
      "Käyttäjät arvostavat sen helppokäyttöisyyttä, kommentointiominaisuuksia ja PDF-synkronointia sekä Git-integraatiota, vaikka jotkut pitävät Gitiä haastavana synkronoidussa työskentelyssä.",
      "On pyyntöjä lisäominaisuuksista, kuten Pandoc-tuesta Markdownille, mikä korostaa mahdollisia parannusalueita."
    ],
    "points": 226,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1719690380
  },
  {
    "id": 40834600,
    "title": "Chrome lisää `window.ai` – Gemini Nano AI -mallin suoraan selaimeen",
    "originLink": "https://twitter.com/rauchg/status/1806385778064564622",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40834600",
    "commentBody": "",
    "originSummary": [
      "Chrome integroi `window.ai`:n, Gemini Nano AI -mallin, suoraan selaimeen, parantaen sen tekoälyominaisuuksia.",
      "Tämä integraatio on yhteensopiva tekoälyn ohjelmistokehityspaketin (SDK) kanssa, mikä helpottaa tekoälyominaisuuksien kehittämistä ja käyttöönottoa.",
      "Tämä päivitys merkitsee merkittävää askelta kohti edistyneempien tekoälytoimintojen natiivia tukea verkkoselaimissa."
    ],
    "commentSummary": [
      "Chrome integroi `window.ai`-toiminnon, joka on Gemini Nano AI -malli, suoraan selaimeen, korostaen paikallista laitekohtaista käsittelyä parannetun yksityisyyden ja turvallisuuden takaamiseksi.",
      "API on kokeellinen ja tällä hetkellä lipun takana, mikä herättää keskusteluja sen vaikutuksista yksityisyyteen, turvallisuuteen ja tuleviin verkkostandardeihin.",
      "Vaikka jotkut näkevät mahdollisuuksia parannettuihin verkkosovelluksiin, toiset ovat huolissaan selainten yhteensopivuudesta ja mahdollisesta väärinkäytöstä, ja jotkut käyttäjät suosivat yksinkertaisempia selaimia."
    ],
    "points": 217,
    "commentCount": 166,
    "retryCount": 0,
    "time": 1719712601
  },
  {
    "id": 40837610,
    "title": "SQLite-pohjainen Drop-In SQS-korvaus",
    "originLink": "https://github.com/poundifdef/SmoothMQ",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40837610",
    "commentBody": "",
    "originSummary": [
      "Amazon SQS:lle (Simple Queue Service) on luotu avoimen lähdekoodin, API-yhteensopiva korvaaja, joka on kirjoitettu Go-kielellä ja jaettu yhtenä binäärinä käyttäen SQLitea tallennukseen.",
      "Ratkaisu tarjoaa edistyneitä ominaisuuksia, kuten hakutoiminnon, ajastuksen, havaittavuuden ja nopeusrajoituksen, ja se on yhteensopiva olemassa olevien SQS-sovellusten kanssa pelkästään vaihtamalla päätepistettä.",
      "Se tukee useita protokollia (AMQP, PubSub) ja voidaan mukauttaa erilaisiin tallennustaustoihin (RocksDB, Postgres), tulevaisuudessa suunnitelmissa on hajautettu ja automaattisesti skaalautuva toiminnallisuus, ja sen tavoitteena on tarjota kustannustehokas isännöity jonojärjestelmä."
    ],
    "commentSummary": [
      "Go- ja SQLite-teknologioilla on kehitetty avoimen lähdekoodin, Amazon SQS:n kanssa API-yhteensopiva korvaaja, joka tarjoaa ominaisuuksia kuten haku, ajastus, havaittavuus ja nopeuden rajoittaminen ilman, että sovelluksia tarvitsee kirjoittaa uudelleen.",
      "Ratkaisu tukee Celeryä, tarjoaa paremman viestien näkyvyyden kuin SQS ja on liitettävissä mahdollisiin taustajärjestelmiin, kuten RocksDB tai Postgres, jotka pystyvät toteuttamaan useita protokollia.",
      "Se on helppo ottaa käyttöön yhtenä Go-binaarina, ja tulevaisuudessa suunnitelmissa on hajautettu ja automaattisesti skaalautuva toiminnallisuus. Palautetta kannustetaan antamaan."
    ],
    "points": 203,
    "commentCount": 60,
    "retryCount": 0,
    "time": 1719760268
  },
  {
    "id": 40835274,
    "title": "Viikonlopun projektit: hulluttelua C:n kanssa",
    "originLink": "https://lcamtuf.substack.com/p/weekend-projects-getting-silly-with",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40835274",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Keskustelu pyörii määrittelemättömän toiminnan (UB) ympärillä C-ohjelmointikielessä, erityisesti väärinkäsityksen ympärillä, että UB voi \"aikamatkustaa\" tai vaikuttaa koodin suorittamiseen takautuvasti.",
      "C23-standardi sisältää alaviitteen, joka selventää, että UB ei voi aikamatkustaa, mikä poistaa aiempien blogikirjoitusten ja kääntäjien käyttäytymisen aiheuttamaa sekaannusta.",
      "Keskustelu käsittelee myös erilaisia omaperäisiä ja edistyneitä C-ohjelmointitekniikoita, kuten epätavallisia tapoja käyttää switch-lauseita ja volatile-avainsanan semantiikan vaikutuksia."
    ],
    "points": 182,
    "commentCount": 70,
    "retryCount": 0,
    "time": 1719724073
  },
  {
    "id": 40833645,
    "title": "Trilobiitit kuolivat tulivuoren tuhkaan",
    "originLink": "https://www.bristol.ac.uk/news/2024/june/prehistoric-pompeii.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40833645",
    "commentBody": "",
    "originSummary": [
      "Poikkeuksellisen hyvin säilyneitä trilobiittifossiileja Kambrian kaudelta löydettiin Marokosta, paljastaen aiemmin tuntemattomia anatomisia yksityiskohtia.",
      "Fossiilit, jotka ovat säilyneet vulkaanisen tuhkan ansiosta yli 500 miljoonaa vuotta sitten, osoittavat neljä paria pään ulokkeita aiemmin ajatellun kolmen sijaan, tarjoten uusia näkemyksiä trilobiittien ruokintamekanismeista.",
      "Korkean resoluution röntgenmikrotomografiaa (XRµCT) käytettiin luomaan yksityiskohtaisia 3D-malleja, korostaen vulkaanisten tuhkalaskeumien potentiaalia hyvin säilyneiden fossiilien paljastamisessa."
    ],
    "commentSummary": [
      "Paleontologit ovat tunnistaneet yli 20 000 trilobiittilajia, joiden koko vaihtelee alle kahdesta millimetristä yli 90 senttimetriin.",
      "Verkkosivusto trilobites.info saa kiitosta yksinkertaisesta, tietorikkaasta suunnittelustaan, joka muistuttaa varhaisia internet-sivustoja ja keskittyy sisältöön nykyaikaisten verkkosuunnittelutrendien sijaan.",
      "Löytö hyvin säilyneistä 'Pompei' trilobiiteista, jotka eivät ole litistyneet tai muotoutuneet, tarjoaa merkittäviä näkemyksiä muinaiseen menneisyyteen, esitellen jokaisen jalan järjestettynä kuten ne olivat eläessään."
    ],
    "points": 131,
    "commentCount": 21,
    "retryCount": 0,
    "time": 1719699242
  },
  {
    "id": 40835117,
    "title": "OpenDNS keskeyttää palvelunsa Ranskassa Canal+ -piratismin estomääräyksen vuoksi",
    "originLink": "https://torrentfreak.com/opendns-suspends-service-in-france-due-to-canal-piracy-blocking-order-240629/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40835117",
    "commentBody": "",
    "originSummary": [
      "Ranskalainen tuomioistuin on määrännyt Googlen, Cloudflaren ja Ciscon estämään DNS-tietueet, jotka kiertävät olemassa olevia piraattisivustojen estotoimia, Canal+:n pyynnöstä.",
      "Vastauksena tähän Cisco on vetänyt OpenDNS-palvelunsa pois Ranskasta, mikä korostaa oikeustoimien vaikutusta internetpalveluihin.",
      "Tämä oikeuden määräys on osa Canal+:n laajempaa piratismin vastaista kampanjaa, joka aiemmin vaati internet-palveluntarjoajia estämään yli 100 piraattiurheilun suoratoistosivustoa, mikä ajoi käyttäjät kolmannen osapuolen DNS-palvelimille."
    ],
    "commentSummary": [
      "OpenDNS on keskeyttänyt palvelunsa Ranskassa tuomioistuimen määräyksen vuoksi, joka velvoittaa estämään piratismisivustot, mikä on herättänyt keskustelua DNS-neutraaliudesta ja lainmukaisuudesta.",
      "Se, että suuret yritykset kuten Google noudattavat tällaisia määräyksiä, herättää huolta ennakkotapauksen luomisesta DNS-manipulaatiolle ja mahdollisesta hallituksen vallan väärinkäytöstä.",
      "Kayttäjät saattavat etsiä vaihtoehtoisia DNS-palveluntarjoajia tai VPN-yhteyksiä kiertääkseen nämä rajoitukset, mikä korostaa teknisiä haasteita ja DNS-estoihin liittyviä vaikutuksia."
    ],
    "points": 112,
    "commentCount": 43,
    "retryCount": 0,
    "time": 1719721146
  },
  {
    "id": 40833327,
    "title": "Operational Wargame Series: Paras peli, jota ei ole nyt kaupoissa (2021)",
    "originLink": "https://nodicenoglory.com/2021/06/23/the-operational-wargame-series-the-best-game-not-in-stores-now/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40833327",
    "commentBody": "",
    "originSummary": [
      "Operational Wargame Series (OWS) on lautapeli, joka simuloi taisteluita vuosina 2025–2050. Sen ovat kehittäneet eläkkeellä oleva eversti Tim Barrick ja Yhdysvaltain merijalkaväen sotataitotutkimuslaboratorio (USMCWL).",
      "OWS sisältää kaksi moduulia: Assassin’s Mace (INDO-PACOM-teatteri) ja Zapad (Euroopan teatteri), jotka käyttävät harrastajapelaajille tuttua heksapohjaista ja laskurijärjestelmää.",
      "Tällä hetkellä OWS on saatavilla vain Yhdysvaltain merijalkaväen yhdistyksen kautta DoD-toimistoille, eikä sitä ole suunniteltu kaupalliseen julkaisuun, huolimatta sen mahdollisesta vetovoimasta harrastepelaajien keskuudessa."
    ],
    "commentSummary": [
      "Operational Wargame Series tunnetaan yksityiskohtaisuudestaan ja aikaa vievästä luonteestaan, ja yhden vuoron suorittaminen voi usein kestää päiviä tai viikkoja.",
      "Huolimatta digitaalisista edistysaskeleista, perinteiset lautapelisotapelit ovat edelleen suosittuja niiden käsinkosketeltavan ja käytännönläheisen lähestymistavan vuoksi, ja pelejä kuten Command: Modern Operations ja Rule the Waves suositellaan harrastajille.",
      "Sotilasorganisaatiot käyttävät edelleen manuaalista sotapelaamista koulutustarkoituksiin, korostaen kaikkien muuttujien ymmärtämisen tärkeyttä strategisessa suunnittelussa."
    ],
    "points": 105,
    "commentCount": 58,
    "retryCount": 0,
    "time": 1719694871
  },
  {
    "id": 40835793,
    "title": "Figma käyttää oletuksena henkilökohtaisia tietoja AI-mallien kouluttamiseen",
    "originLink": "https://help.figma.com/hc/en-us/articles/17725942479127-Control-AI-features-and-content-training-settings",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40835793",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Figma käyttää oletuksena henkilötietoja tekoälymallien kouluttamiseen, mikä herättää käyttäjissä yksityisyyteen liittyviä huolia.",
      "Microsoftin toimitusjohtajan kommentit viittaavat siihen, että voimakkaat organisaatiot voivat käyttää internetin dataa tekoälyn kouluttamiseen, mikä herättää eettisiä ja oikeudellisia kysymyksiä, erityisesti GDPR:n alaisuudessa.",
      "Suosittelemme käyttäjiä poistamaan sisältökoulutuksen kytkimen käytöstä 15. elokuuta 2024 mennessä estääkseen tietojensa käytön."
    ],
    "points": 98,
    "commentCount": 37,
    "retryCount": 0,
    "time": 1719735058
  },
  {
    "id": 40834345,
    "title": "Kahvi auttoi Unionia sisällissodassa",
    "originLink": "https://www.smithsonianmag.com/history/how-coffee-helped-the-union-caffeinate-their-way-victory-civil-war-180984502/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40834345",
    "commentBody": "",
    "originSummary": [
      "Yhdysvaltain sisällissodan aikana unionilla oli merkittävä kahvipula, joka oli tärkeä sotilaiden moraalille ja energialle, sillä tuonti väheni 40 % vuoteen 1862 mennessä.",
      "Liberia, presidentti Stephen Allen Bensonin johdolla, alkoi viedä kahvia Unioniin, aloittaen 6 000 punnan lähetyksellä elokuussa 1862, auttaen täyttämään Etelän satamien saarron aiheuttamaa aukkoa.",
      "Yhteistyö liberialaisten kahvinviljelijöiden ja pohjoisten orjuuden vastustajien välillä sekä philadelphialaisen kauppiaan Edward Morrisin neuvot lisäsivät kahvintuotantoa, tehden liberialaisesta kahvista elintärkeää Unionin sotaponnisteluille ja myötävaikuttaen heidän menestykseensä."
    ],
    "commentSummary": [
      "Kahvi oli ratkaiseva piriste unionin sotilaille sisällissodan aikana, vaikuttaen merkittävästi heidän ponnisteluihinsa.",
      "Etelä käytti muita piristeitä, kuten teetä, tupakkaa ja yauponia, mutta kahvin vaikutus Unioniin oli erityisen merkittävä.",
      "Keskustelu korostaa ihmisten monimutkaista suhdetta kofeiiniin, tasapainottaen sen tuottavuushyödyt mahdollisen riippuvuuden ja hyvinvointihuolien kanssa."
    ],
    "points": 95,
    "commentCount": 104,
    "retryCount": 0,
    "time": 1719708091
  },
  {
    "id": 40835588,
    "title": "Rodney Brooks generatiivisen tekoälyn rajoituksista",
    "originLink": "https://techcrunch.com/2024/06/29/mit-robotics-pioneer-rodney-brooks-thinks-people-are-vastly-overestimating-generative-ai/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40835588",
    "commentBody": "",
    "originSummary": [
      "Rodney Brooks, tunnettu MIT:n robotiikan pioneeri, uskoo, että generatiivista tekoälyä usein liioitellaan eikä se pysty vastaamaan ihmisten kykyjä.",
      "Brooks väittää, että tekoälyn tulisi keskittyä tiettyihin, ratkaistavissa oleviin ongelmiin sen sijaan, että se yrittäisi jäljitellä ihmisen kykyjä, viitaten tehottomuuteen käyttää generatiivista tekoälyä tehtävissä, kuten varastorobotiikassa.",
      "Hän huomauttaa myös, että teknologinen kasvu ei ole aina eksponentiaalista, käyttäen esimerkkinä iPodin tallennuskapasiteettia, ja ehdottaa, että vaikka suuret kielimallit (LLM:t) voivat auttaa tehtävissä kuten vanhustenhoidossa, ne eivät ole universaali ratkaisu kaikkiin tekoälyhaasteisiin."
    ],
    "commentSummary": [
      "Rodney Brooks keskustelee generatiivisen tekoälyn rajoituksista korostaen, että vaikka se pystyy suorittamaan tiettyjä tehtäviä, se ei voi vastata ihmisen kykyjen koko kirjoa.",
      "Brooks ehdottaa rajoittamaan tekoälysovellusten laajuutta ja sisällyttämään manuaaliset ohitukset odottamattomien tilanteiden varalta, ennustaen, että liiketoimintaperuste eksponentiaalisesti laajeneville suurille kielimalleille (LLM) on heikko.",
      "Keskustelussa käytetään analogioita, joissa verrataan LLM:itä iPodiin, ja ehdotetaan, että kuten iPodin kehitys iPhoneksi, tulevat tekoälyn edistysaskeleet saattavat integroida monimutkaisempia toimintoja sen sijaan, että vain laajennettaisiin olemassa olevia kykyjä."
    ],
    "points": 93,
    "commentCount": 83,
    "retryCount": 0,
    "time": 1719730946
  },
  {
    "id": 40837791,
    "title": "Kehittäjä hylkää CVE-vakavuuden, tekee GitHub-repostaan vain luku -tilaan",
    "originLink": "https://www.bleepingcomputer.com/news/security/dev-rejects-cve-severity-makes-his-github-repo-read-only/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40837791",
    "commentBody": "",
    "originSummary": [
      "Fedor Indutny on tehnyt suositusta avoimen lähdekoodin projektistaan 'node-ip' vain luku -tilassa GitHubissa kiistanalaisen CVE (Common Vulnerabilities and Exposures) -raportin vuoksi.",
      "Tämä tapaus korostaa kasvavaa ongelmaa, jossa avoimen lähdekoodin kehittäjät joutuvat kyseenalaisten tai virheellisten CVE-raporttien pommituksen kohteeksi, aiheuttaen tarpeetonta paniikkia ja turhautumista.",
      "CVEn järjestelmän väärinkäyttö, joka on tarkoitettu eettiseen haavoittuvuuksien raportointiin, vaikeuttaa kehittäjien elämää ja edistää loppuunpalamista."
    ],
    "commentSummary": [
      "Kehittäjä muutti GitHub-repositorionsa vain luku -tilaan kiistettyään Common Vulnerabilities and Exposures (CVE) -raportin vakavuuden.",
      "Tapauksen myötä korostuu, että turvallisuus tulisi nähdä koko ohjelmistojärjestelmän emergenttinä ominaisuutena, ei vain yksittäisten komponenttien.",
      "Tilanne korostaa myös avoimen lähdekoodin ylläpitäjien kohtaamia haasteita ja loppuunpalamista, sillä he saavat usein vain vähän aineellista palkkiota ponnisteluistaan."
    ],
    "points": 89,
    "commentCount": 85,
    "retryCount": 0,
    "time": 1719761821
  },
  {
    "id": 40834305,
    "title": "Patagonia antoi henkilöstölleen 3 päivää aikaa päättää, muuttavatko he vai lopettavatko työnsä",
    "originLink": "https://www.businessinsider.com/patagonia-cx-staff-told-to-relocate-or-leave-california-2024-6",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40834305",
    "commentBody": "",
    "originSummary": [
      "Patagonia on antanut 90 asiakaspalvelutyöntekijälle kolme päivää aikaa päättää, muuttavatko he yhteen seitsemästä Yhdysvaltain toimipisteestä vai lähtevätkö yrityksestä, tavoitteenaan parantaa tiimikulttuuria ja tukea liiketoiminnan tarpeita.",
      "Vaikutuksen alaisille työntekijöille ilmoitettiin asiasta yleiskokouksessa ja heille tarjottiin 4 000 dollaria muuttoavustusta ja ylimääräisiä palkallisia vapaapäiviä, ja niiden, jotka eivät halua muuttaa, on ilmoitettava siitä syyskuun 30. päivään mennessä.",
      "Päätös vaikuttaa 90:een 255:stä asiakaskokemuksen (CX) työntekijästä Yhdysvalloissa, ja jotkut työntekijät ovat ilmaisseet pettymyksensä koetusta siirtymisestä pois yrityksen työntekijälähtöisistä arvoista."
    ],
    "commentSummary": [
      "Patagonia on antanut henkilöstölleen kolme päivää aikaa päättää, muuttavatko he vai irtisanoutuvatko ylikapasiteetin vuoksi, mikä on herättänyt keskustelua yritysetiikasta ja työntekijöiden kohtelusta.",
      "Kriitikot väittävät, että tämä on naamioitu irtisanominen, huomauttaen anteliaasta erorahasta mutta riittämättömästä 4 000 dollarin muuttopaketista ja lyhyestä päätöksentekoajasta.",
      "Siirtoa pidetään mahdollisesti hyödyllisenä H1B-viisumin haltijoille, mutta se on saanut vaihtelevia reaktioita työntekijöiltä ja tarkkailijoilta."
    ],
    "points": 82,
    "commentCount": 82,
    "retryCount": 0,
    "time": 1719707462
  },
  {
    "id": 40838290,
    "title": "Suora sijoitus lentoyhtiöistä sen mukaan, kuinka paljon matkatavaroita ne menettävät",
    "originLink": "https://luggagelosers.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40838290",
    "commentBody": "",
    "originSummary": [
      "MatkatavaratHukassa.com tarjoaa reaaliaikaisen rankingin lentoyhtiöistä kadonneiden matkatavaroiden perusteella, päivitettynä tunneittain sosiaalisen median mainintojen ja historiallisten tietojen avulla.",
      "Sivusto seuraa kaikkia suuria lentoyhtiöitä, huomioiden kokoerot, ja pyrkii auttamaan matkustajia valitsemaan lentoyhtiöitä, joilla on parempi matkatavaroiden käsittely.",
      "Nykyiset huippulentoyhtiöt kadonneiden matkatavaroiden osalta ovat Aer Lingus, Air India ja WestJet Airlines, ja alueellisia ja maakohtaisia tietoja on myös saatavilla."
    ],
    "commentSummary": [
      "Matkatavaroiden katoamisen perusteella tehty lentoyhtiöiden reaaliaikainen sijoitus paljastaa, että Aer Lingusilla on 1:57 mahdollisuus kadottaa matkatavarat, Deltalla 1:497 ja Air Francella 1:1,256.",
      "Kansallisesti Intiassa on 1:97 mahdollisuus, Yhdysvalloissa 1:497 ja Japanissa 1:7,734, ja vaihteluihin vaikuttavat lähtöselvitysasemat, lentoyhtiöiden käytännöt ja kansalliset säädökset.",
      "Data on peräisin sosiaalisen median julkaisuista, mikä herättää huolia tarkkuudesta, kun taas Yhdysvaltain liikenneministeriö (DOT) tarjoaa luotettavampaa tietoa väärin käsitellyistä matkatavaroista."
    ],
    "points": 81,
    "commentCount": 37,
    "retryCount": 0,
    "time": 1719766479
  },
  {
    "id": 40836183,
    "title": "Analoginen vastusverkko lupaa koneoppimista ilman prosessoria",
    "originLink": "https://www.hackster.io/news/an-analog-network-of-resistors-promises-machine-learning-without-a-processor-researchers-say-d9cb0655b7a0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40836183",
    "commentBody": "",
    "originSummary": [
      "Tutkijat Pennsylvanian yliopistossa ovat luoneet analogisen koneoppimisverkon käyttämällä vastuksia, tavoitteenaan energiatehokkaampi tekoäly.",
      "Tämä uusi lähestymistapa poistaa perinteisen prosessorin tarpeen, hyödyntäen transistoreihin perustuvaa epälineaarista oppimismetamateriaalia monimutkaisiin laskutoimituksiin.",
      "Vaikka nykyinen prototyyppi kuluttaa enemmän virtaa kuin nykyaikaiset digitaaliset kiihdyttimet, se osoittaa lupausta tehtävissä, kuten kuvien luokittelussa ja XOR-operaatioissa, ja sen tehokkuus voi parantua mittakaavan kasvaessa."
    ],
    "commentSummary": [
      "Tutkijat tutkivat transistoreista koostuvaa analogista verkkoa, joka on rajoitettu ohmiseen tilaan, suorittaakseen koneoppimistehtäviä ilman perinteisiä prosessoreita.",
      "Tämä lähestymistapa voisi mahdollisesti tarjota tehokkaampia, rinnakkaisia operaatioita verrattuna digitaalisiin järjestelmiin, vaikka käytännön toteutuksen haasteet, kuten varauksen ylläpitäminen porttikondensaattoreissa, säilyvät.",
      "Konsepti herättää kiinnostusta sen potentiaalin vuoksi mullistaa neuroverkkojen laskentaa hyödyntämällä analogisia komponentteja, mikä voisi johtaa merkittäviin edistysaskeliin energiatehokkuudessa ja käsittelynopeudessa."
    ],
    "points": 81,
    "commentCount": 31,
    "retryCount": 0,
    "time": 1719741502
  }
]
