[
  {
    "id": 41567573,
    "title": "장치 폭발로 인해 헤즈볼라 회원 수십 명이 중상을 입은 것으로 전해져",
    "originLink": "https://www.timesofisrael.com/liveblog_entry/dozens-of-hezbollah-members-said-serious-injured-in-beirut-as-devices-explode-in-alleged-israeli-op/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41567573",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "수정된 장치가 포함된 공급망 공격의 결과로 추정되는 폭발하는 호출기 때문에 수십 명의 헤즈볼라 회원들이 부상을 입었습니다.",
      "그 사건은 Stuxnet과 비교되며, 호출기가 조작되었는지 아니면 취약점이 악용되었는지에 대한 논쟁이 있다.",
      "논의는 공격의 정밀성, 잠재적인 민간인 사상자, 그리고 더 넓은 윤리적 함의에 초점을 맞추고 있다."
    ],
    "points": 672,
    "commentCount": 666,
    "retryCount": 0,
    "time": 1726580972
  },
  {
    "id": 41564003,
    "title": "Elgato HD60 S HDMI 캡처 장치를 Ghidra의 도움으로 수리하기",
    "originLink": "https://www.downtowndougbrown.com/2024/09/fixing-an-elgato-hd60-s-hdmi-capture-device-with-the-help-of-ghidra/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41564003",
    "commentBody": "",
    "originSummary": [
      "Doug Brown은 과열된 칩을 교체하고 SPI 플래시 메모리의 손상된 애니메이션 데이터를 수정하여 고장난 Elgato Game Capture HD60 S를 성공적으로 수리했습니다.",
      "LED 표시등 문제는 Elgato의 결함 있는 펌웨어 업데이트 과정에서 발생한 손상된 데이터로 추적되었습니다.",
      "Doug의 여정은 하드웨어 수리에서 인내심과 기술적 능력의 중요성을 강조하며, 유사한 문제에 직면한 다른 사람들에게 귀중한 통찰력을 제공합니다."
    ],
    "commentSummary": [
      "한 사용자가 Ghidra라는 소프트웨어 리버스 엔지니어링 도구를 사용하여 Elgato HD60 S HDMI 캡처 장치를 수리한 경험을 공유했습니다.",
      "이 논의는 HDMI 캡처 장치와 같은 임베디드 시스템에서도 현대 소프트웨어와 하드웨어의 복잡성과 과도한 추상화를 강조합니다.",
      "그 게시물은 수리 문화의 쇠퇴와 소비주의의 증가에 대한 더 넓은 대화를 촉발시켰으며, 많은 사용자들이 물건을 수리하고 재사용하는 것이 더 일반적이었던 과거를 회상했습니다."
    ],
    "points": 439,
    "commentCount": 81,
    "retryCount": 0,
    "time": 1726546010
  },
  {
    "id": 41559761,
    "title": "macOS 세쿼이아가 오늘 출시되었습니다",
    "originLink": "https://www.apple.com/newsroom/2024/09/macos-sequoia-is-available-today/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41559761",
    "commentBody": "",
    "originSummary": [
      "macOS Sequoia가 이제 무료 업데이트로 제공되며, iPhone 미러링, Safari 업데이트, 창 타일링 및 새로운 비밀번호 앱을 도입합니다.",
      "애플 인텔리전스는 고급 생성 모델과 개인 맞춤형 컨텍스트를 특징으로 하며, 다음 달에 M 시리즈 칩이 탑재된 맥에서 사용할 수 있게 됩니다.",
      "추가 기능으로는 메시지에서 예약된 메시지와 새로운 텍스트 효과, 노트에서 실시간 전사, 그리고 지도에서 맞춤형 하이킹 경로가 포함됩니다."
    ],
    "commentSummary": [
      "macOS Sequoia가 출시되어 창 스냅핑 및 iPhone 미러링과 같은 새로운 기능을 도입했지만, 후자는 규제 문제로 인해 EU에서는 사용할 수 없습니다.",
      "사용자들은 주간 화면 녹화 권한, 특정 sudo 명령어 제거, Gatekeeper 우회 방법 변경 등의 문제를 보고하여 일부 사용자가 업데이트를 지연시키고 있습니다.",
      "새로운 창 스냅 기능에는 키보드 단축키가 부족하므로, Rectangle 및 BetterTouchTool과 같은 서드파티 앱을 사용하여 창 관리를 향상시키는 것이 권장됩니다."
    ],
    "points": 374,
    "commentCount": 558,
    "retryCount": 0,
    "time": 1726515441
  },
  {
    "id": 41563958,
    "title": "Void, 오픈 소스 커서/깃허브 코파일럿 대안",
    "originLink": "https://github.com/voideditor/void",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41563958",
    "commentBody": "",
    "originSummary": [
      "Void의 창작자 중 한 명인 Andrew는 이를 커스터마이징 가능한 IDE(통합 개발 환경) 기능을 갖춘 오픈 소스 버전의 Cursor로 소개합니다.",
      "Void는 Visual Studio Code(vscode)의 포크로, AI 편집 기능과 파일 시스템 이해를 향상시키는 것을 목표로 하며, Microsoft의 폐쇄형 확장 마켓플레이스와 관련된 문제를 해결하고자 합니다.",
      "프로젝트는 초기 단계에 있으며 작동하는 프로토타입이 있습니다. 팀은 커뮤니티의 기여와 피드백을 적극적으로 구하고 있습니다."
    ],
    "commentSummary": [
      "Void는 코드 편집에서 AI 기능을 향상시키고 사용자 정의 가능한 IDE 기능을 제공하도록 설계된 Cursor/GitHub Copilot의 오픈 소스 대안입니다.",
      "VSCode의 포크로 만들어진 이 프로젝트는 UI 수정과 마이크로소프트의 폐쇄형 확장 마켓플레이스와 관련된 문제에 직면해 있지만, 커뮤니티의 기여와 피드백을 구하고 있습니다.",
      "이 프로젝트는 데이터 프라이버시를 보장하는 기업 온프레미스 호스팅을 통해 수익을 창출할 계획이며, 중개자 없이 LLM(대형 언어 모델) 제공업체를 직접 사용할 수 있도록 합니다."
    ],
    "points": 320,
    "commentCount": 138,
    "retryCount": 0,
    "time": 1726545509
  },
  {
    "id": 41563363,
    "title": "인디애나 경찰이 현금을 포함한 FedEx 소포를 압수하고 있다",
    "originLink": "https://www.indystar.com/story/news/local/2024/08/13/california-jewelry-business-sues-indiana-over-seized-cash-fedex-henry-minh-inc/74788610007/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41563363",
    "commentBody": "",
    "originSummary": [
      "4월에 인디애나폴리스 FedEx 배급 센터에서 경찰이 약 4만 3천 달러의 현금이 들어 있는 상자를 압수했으며, 이는 약 4개월 동안 아무런 형사 고발 없이 정부에 의해 보관되고 있습니다.",
      "캘리포니아의 보석 회사인 헨리 민 주식회사는 인디애나를 상대로 민사 몰수법에 따른 불법적인 소포 압류를 주장하며 정의 연구소의 도움을 받아 소송을 제기하고 있습니다.",
      "소송은 작년에 FedEx 시설에서 130개의 현금 소포가 압수되었음을 강조하며, 다음 심리는 이 사건이 집단 소송으로 진행될 수 있는지 여부를 결정하기 위해 9월 16일로 예정되어 있습니다."
    ],
    "commentSummary": [
      "인디애나 경찰이 현금을 포함한 FedEx 소포를 압수하면서 민사 자산 몰수에 대한 비판과 논의가 일고 있다.",
      "댓글 작성자들은 경찰의 권한 남용에 대해 우려하며 이를 도둑질에 비유하고, 마약 탐지견의 역할과 법적 복잡성에 대해 논의하고 있습니다.",
      "정의 연구소는 이러한 관행에 도전하며, 정부 권력, 시민 자유 및 헌법적 문제와 같은 더 넓은 문제들을 강조하고 있습니다."
    ],
    "points": 282,
    "commentCount": 220,
    "retryCount": 0,
    "time": 1726539410
  },
  {
    "id": 41560648,
    "title": "인텔은 소니 플레이스테이션 사업을 AMD에게 빼앗겼다",
    "originLink": "https://www.reuters.com/technology/how-intel-lost-sony-playstation-business-2024-09-16/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41560648",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "인텔은 AMD의 수익을 줄이고 소니에게 대안을 제시하려는 전략적 노력에도 불구하고 소니 플레이스테이션 사업 입찰에서 AMD에게 패배했다.",
      "하위 호환성은 소니와 닌텐도에게 매우 중요하며, 내부 라이브러리를 재구성하고 독점 그래픽 API와의 호환성을 유지해야 하기 때문에 공급업체를 변경하는 것은 비현실적입니다.",
      "AMD의 확립된 관계, 콘솔 세대 간 일관된 명령 타이밍, 그리고 고성능 APU에 대한 경험이 소니에게 선호되는 선택이 되게 했습니다."
    ],
    "points": 260,
    "commentCount": 171,
    "retryCount": 0,
    "time": 1726519432
  },
  {
    "id": 41562673,
    "title": "연쇄 사고는 트랜스포머가 본질적으로 순차적인 문제를 해결할 수 있도록 합니다",
    "originLink": "https://arxiv.org/abs/2402.12875",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41562673",
    "commentBody": "",
    "originSummary": [
      "이 연구는 중간 단계를 생성하여 산술 및 상징적 추론 작업에서 대형 언어 모델(LLM)의 정확성을 향상시키기 위해 '사고의 연쇄'(CoT) 개념을 도입합니다.",
      "CoT는 본질적으로 순차적인 문제를 해결하기 위해 일정한 깊이의 트랜스포머가 더 깊은 아키텍처를 필요로 하는 계산을 수행할 수 있도록 하여, 이러한 모델에게 일반적으로 어려운 문제를 해결할 수 있게 합니다.",
      "경험적 결과는 순열 그룹 구성 및 반복 제곱과 같이 병렬 계산에 어려운 작업에서 특히 저심도 변환기에 유익한 중요한 정확도 향상을 보여줍니다."
    ],
    "commentSummary": [
      "연쇄 사고는 트랜스포머가 순차적인 문제를 해결할 수 있게 하지만, 효율성 문제와 대부분의 문제가 형식 언어가 아니라는 특성 때문에 실제 응용은 제한적입니다.",
      "요아브 골드버그는 트랜스포머가 답을 제공하지 않고 무한히 계산할 수 있다는 점을 유머러스하게 지적하며 문제 해결의 예측 불가능성을 강조했습니다.",
      "트랜스포머는 이론적으로 충분한 중간 추론 토큰이 있으면 어떤 문제도 해결할 수 있지만, 실질적인 효율성과 실제 응용은 여전히 불확실합니다."
    ],
    "points": 244,
    "commentCount": 158,
    "retryCount": 0,
    "time": 1726532597
  },
  {
    "id": 41563626,
    "title": "책을 쓰지 말아야 하는 이유",
    "originLink": "https://gwern.net/book-writing",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41563626",
    "commentBody": "",
    "originSummary": [
      "저자는 책 쓰기에 따르는 높은 기회 비용과 위험을 이유로 Gwern.net을 책으로 만드는 것에 반대하고 있습니다.",
      "책을 쓰는 것은 종종 명망 있는 일로 여겨지지만, 팀 어반과 같은 작가들이 증명하듯이 우울증, 번아웃, 창의력 저하로 이어질 수 있습니다.",
      "저자는 모든 작가가 책을 써야 한다는 압박감을 느낄 필요는 없다고 생각하며, 그 과정이 보람보다는 더 지칠 수 있다고 믿는다."
    ],
    "commentSummary": [
      "블로그 게시물은 소설을 에일리언 프랜차이즈의 '페이스허거'에 비유하며, 작가들은 압도적인 충동을 느낄 때만 글을 써야 한다고 제안합니다.",
      "글쓰기에 대한 도전 과제, 체계적인 과정의 필요성, 교정 작업, 출판의 상업적 측면 이해 등을 논의합니다.",
      "댓글은 성공적인 글쓰기의 공식적인 성격, 시장에 맞춘 글쓰기의 중요성, 그리고 열정과 헌신의 필요성을 강조합니다."
    ],
    "points": 219,
    "commentCount": 179,
    "retryCount": 0,
    "time": 1726541915
  },
  {
    "id": 41567301,
    "title": "분해기를 가열하는 데 4초, 구글은 그것이 충분하지 않다고 내게 말했다",
    "originLink": "https://quoteinvestigator.com/2024/09/16/hot-sf/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41567301",
    "commentBody": "",
    "originSummary": [
      "1953년에 레이먼드 챈들러는 과학 소설을 패러디한 편지에서 '구글'이라는 용어를 사용하여 정보 출처를 언급했는데, 이는 회사의 존재를 앞선 것이었다.",
      "챈들러의 '구글' 사용은 크리켓 용어, 만화 캐릭터 바니 구글, 또는 수학 용어 '구골'에 영향을 받았을 수 있습니다.",
      "검색 엔진 이름 '구글'은 1997년에 '구골'에서 영감을 받아 선택되었으며, 이는 구글이 조직하려는 방대한 정보의 규모를 반영하기 위함이었다."
    ],
    "commentSummary": [
      "이 게시물은 챈들러의 공상 과학 소설에서 인용한 구절을 다루며, 황금기와 은기의 공상 과학 소설에서 흔히 볼 수 있는 난해하고 상상력이 풍부한 언어 사용을 강조하고 있습니다.",
      "대화는 평범한 행동에 대해 비정상적인 용어를 사용하는 전형적인 예인 '토끼를 '스머프'라고 부르기'와 문학에서 흥미로운 첫 문장을 쓰는 어려움에 대해 깊이 탐구합니다.",
      "그 인용문에서 언급된 '구글'은 기술 대기업을 지칭하기보다는 독특한 이름으로 사용되었다고 분석되며, 이는 공상 과학 소설의 장난스럽고 창의적인 특성을 반영한다고 추측하는 사람들이 있다."
    ],
    "points": 205,
    "commentCount": 79,
    "retryCount": 0,
    "time": 1726578961
  },
  {
    "id": 41566446,
    "title": "수학에서 어리석음의 중심성",
    "originLink": "https://mathforlove.com/2024/09/the-centrality-of-stupidity-in-mathematics/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41566446",
    "commentBody": "",
    "originSummary": [
      "마틴 슈워츠의 '과학 연구에서의 어리석음의 중요성' (2008)은 과학적 탐구에서 '어리석음'을 느끼는 것의 가치를 강조하며, 이는 진정한 노력과 학습에 필수적이라고 주장합니다.",
      "이 개념은 특히 수학에서 관련이 있는데, 학생들이 종종 어리석음의 감정을 경험하고 극복하면서 갑작스러운 이해의 도약과 새로운 정신 경로의 구축으로 이어지기 때문입니다.",
      "교사들은 학생들의 어려움에 공감하고, 수학을 배우는 과정에서 어리석게 느끼는 것이 자연스러운 일임을 확신시켜 주어야 하며, 이를 통해 학생들이 수학적 발견의 어려움과 기쁨을 받아들일 수 있도록 도와야 합니다."
    ],
    "commentSummary": [
      "논의는 학문 및 연구 환경, 특히 수학과 과학에서 '어리석음'이라는 감정에 중점을 두고 있으며, 이것이 학습 과정의 정상적인 부분임을 다루고 있습니다.",
      "이 게시물은 학생들과 연구자들 사이에서 불충분하거나 무지하다고 느끼는 것이 흔한 일이며, 이는 호기심과 더 깊은 이해를 위한 원동력이 될 수 있음을 강조합니다.",
      "대화는 교육 시스템이 이 감정을 어떻게 다루어야 하는지에 대한 다양한 관점을 포함하며, 호기심과 회복력을 키우는 것이 고난을 강조하는 전통적인 방법보다 더 효과적이라는 것을 시사합니다."
    ],
    "points": 168,
    "commentCount": 91,
    "retryCount": 0,
    "time": 1726571742
  },
  {
    "id": 41562981,
    "title": "Y Combinator는 낮은 자본금을 필요로 하는 스타트업을 기반으로 합니다",
    "originLink": "https://twitter.com/bradneuberg/status/1835680235049869495",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41562981",
    "commentBody": "",
    "originSummary": [
      "Y Combinator는 오픈 소스 소프트웨어, 스마트폰, 클라우드 서비스와 같은 기존 기술을 활용하여 최소한의 자본 투자가 필요한 스타트업을 대상으로 합니다.",
      "이 접근 방식은 2015년 이전에도 일관되게 유지되어 왔으며, 쉽게 이용할 수 있는 기술 자원을 활용하는 오랜 전략을 나타냅니다."
    ],
    "commentSummary": [
      "Y Combinator(YC)는 시리즈 A에 도달하기 전에 상당한 자금이 필요한 고자본 하드웨어 스타트업에게 덜 유리한 조건을 가지고 있다는 비판을 받고 있습니다.",
      "이 논쟁은 '개를 위한 에어비앤비'와 같은 저자본 지출(캡엑스) 스타트업에서 양자 컴퓨팅과 같은 고자본 지출 벤처로의 전환을 강조합니다.",
      "일부는 빠르고 저렴한 소프트웨어 솔루션을 선호하는 YC의 모델이 기술 발전으로 인해 더 많은 자본이 요구됨에 따라 구식일 수 있다고 주장하는 반면, 다른 사람들은 YC의 광범위한 자금 지원 접근 방식이 여전히 성공 가능성을 높인다고 믿습니다."
    ],
    "points": 168,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1726535711
  },
  {
    "id": 41563621,
    "title": "RTO 정책 때문에 퇴사를 고려하는 아마존 SDE들에게 가장 좋은 선택지는 무엇인가요?",
    "originLink": "https://news.ycombinator.com/item?id=41563621",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41563621",
    "commentBody": "",
    "originSummary": [
      "아마존의 5일 출근 정책(RTO) 때문에 퇴사를 고려하는 소프트웨어 개발 엔지니어(SDE)들은 더 나은 재택근무(WFH) 유연성을 제공하는 옵션을 찾고 있습니다.",
      "이상적인 대안은 특히 데이터베이스나 일반 시스템 프로그래밍에 중점을 둔 사람들에게 흥미로운 프로젝트, 우수한 동료, 경쟁력 있는 급여를 제공해야 합니다.",
      "질문자는 시애틀에 있는 SDE3(선임 소프트웨어 개발 엔지니어)로, 주 0-2일 출근이 필요한 역할에 열려 있습니다."
    ],
    "commentSummary": [
      "아마존 소프트웨어 개발 엔지니어(SDE)들은 새로운 5일 출근 정책(RTO) 때문에 회사를 떠나는 것을 고려하고 있으며, 재택근무(WFH) 유연성, 흥미로운 프로젝트, 그리고 경쟁력 있는 급여를 원하고 있습니다.",
      "일부 직원들은 구직 활동을 하면서 성과 개선 계획(PIP)을 받아 퇴직금을 받기 위해 일을 게을리하는 것을 고려하지만, 다른 직원들은 개인의 성실성을 유지하고 자신의 가치관에 맞는 직업을 찾는 것의 중요성을 강조합니다.",
      "대안으로는 스타트업에 합류하거나 Microsoft나 Google과 같은 다른 기술 대기업에 합류하는 것, 창업을 탐구하는 것, 네트워킹, 관리자와 유연한 근무 조건에 대해 논의하는 것, 또는 RTO 정책을 집단적으로 해결하기 위해 노조를 결성하는 것이 포함됩니다."
    ],
    "points": 165,
    "commentCount": 174,
    "retryCount": 0,
    "time": 1726541880
  },
  {
    "id": 41567262,
    "title": "Rga: Ripgrep, 하지만 PDF, 전자책, 오피스 문서, zip 등에서도 검색합니다.",
    "originLink": "https://github.com/phiresky/ripgrep-all",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41567262",
    "commentBody": "",
    "originSummary": [
      "rga는 PDF, 전자책, 오피스 문서 및 압축 파일과 같은 다양한 파일 유형 내에서 검색할 수 있는 라인 지향 검색 도구인 ripgrep의 확장 버전입니다.",
      "문서 변환을 위한 판독기, PDF 텍스트 추출을 위한 팝플러, 비디오 메타데이터를 위한 ffmpeg와 같은 여러 어댑터를 지원하여 다양한 파일 형식에 대해 다재다능합니다.",
      "설치는 Linux, macOS, Windows를 포함한 여러 플랫폼에서 가능하며, Homebrew, Chocolatey, Scoop과 같은 특정 패키지 관리자를 통해 간편한 설정 옵션을 제공합니다."
    ],
    "commentSummary": [
      "Rga (Ripgrep)는 PDF, 전자책, 오피스 문서 및 zip 파일을 포함한 검색 기능을 확장하여 일반 텍스트 파일을 넘어 그 유용성을 향상시키는 도구입니다.",
      "사용자들은 Rga가 다양한 응용 프로그램에서의 다재다능함을 높이 평가합니다. 예를 들어, zip 파일의 로그를 검색하거나 영화 자막을 검색하는 데 사용됩니다.",
      "문서를 읽는 것에 대한 보안 우려가 있으며, 이는 내장된 코드를 실행하지 않더라도 안전하지 않을 수 있음을 나타내며, 안전한 설계 관행의 필요성을 강조합니다."
    ],
    "points": 157,
    "commentCount": 11,
    "retryCount": 0,
    "time": 1726578691
  },
  {
    "id": 41563100,
    "title": "Rainfrog – Postgres용 데이터베이스 관리 TUI",
    "originLink": "https://github.com/achristmascarl/rainfrog",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41563100",
    "commentBody": "",
    "originSummary": [
      "Rainfrog는 현재 베타 버전으로 제공되는 터미널 기반의 Postgres 데이터베이스 관리 도구로, pgAdmin 및 DBeaver의 경량 대안으로 설계되었습니다.",
      "주요 기능으로는 vim과 유사한 키 바인딩, 키워드 하이라이팅이 있는 쿼리 편집기, 세션 기록, 그리고 크로스 플랫폼 지원(맥OS, 리눅스, 윈도우, Termux를 통한 안드로이드)이 포함됩니다.",
      "활발한 개발 중으로 잠재적인 호환성 문제가 발생할 수 있으므로 쓰기 접근이 있는 운영 데이터베이스에는 권장되지 않습니다."
    ],
    "commentSummary": [
      "Rainfrog는 Postgres 데이터베이스 관리를 위해 설계된 텍스트 사용자 인터페이스(TUI) 도구로, psql에 비해 더 쉬운 탐색 및 편집 기능을 제공합니다.",
      "Rainfrog의 저자는 MySQL 및 SQLite를 포함한 다른 데이터베이스에 대한 지원을 확장하여 그 활용성을 높일 계획입니다.",
      "사용자들은 Rainfrog을 Postico 및 DataGrip과 같은 다른 데이터베이스 관리 도구와 비교하며, 안전한 자격 증명 처리 및 코드에 대한 기술적 피드백을 논의합니다."
    ],
    "points": 156,
    "commentCount": 42,
    "retryCount": 0,
    "time": 1726536922
  },
  {
    "id": 41564009,
    "title": "47년 된 보이저 1호, 수십 년 동안 사용하지 않았던 추진기를 가동하다",
    "originLink": "https://www.cnn.com/2024/09/16/science/voyager-1-thruster-issue/index.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41564009",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "47년 된 우주선 보이저 1호가 최근 수십 년 동안 사용되지 않았던 추진기를 작동시켜 그 놀라운 수명과 공학적 성과를 보여주었습니다.",
      "해커 뉴스 사용자들은 보이저를 최고의 기술적 성과로 칭찬하며, 현대 기술과 비교했을 때 그 내구성과 설계의 단순함 및 신뢰성을 강조했습니다.",
      "논의는 또한 지구와 우주선 사이의 22시간 신호 지연을 포함하여 보이저와의 통신에서 발생하는 어려움을 강조했습니다."
    ],
    "points": 155,
    "commentCount": 75,
    "retryCount": 0,
    "time": 1726546134
  }
]
