[
  {
    "id": 38765627,
    "title": "स्टर्लिंग-पीडीएफ: स्थानीय उपयोग के लिए एक फीचर-पैक पीडीएफ मैनिपुलेशन टूल",
    "originLink": "https://github.com/Frooodle/Stirling-PDF",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38765627",
    "commentBody": "",
    "originSummary": [
      "स्टर्लिंग-पीडीएफ पीडीएफ फाइलों में हेरफेर करने के लिए एक स्थानीय रूप से होस्ट किया गया वेब-आधारित टूल है, जो विभाजन, विलय, रूपांतरण और बहुत कुछ जैसी सुविधाओं की पेशकश करता है।",
      "यह टूल ट्रैकिंग या रिकॉर्ड रखने के लिए आउटबाउंड कॉल किए बिना, फ़ाइलों की सुरक्षा और गोपनीयता सुनिश्चित करता है।",
      "यह स्प्रिंग बूट, थाइमलीफ, पीडीएफबॉक्स, लिबरऑफिस और अधिक जैसी तकनीकों का उपयोग करता है, और इसे होस्ट किए गए इंस्टेंस के माध्यम से एक्सेस किया जा सकता है या डॉकर या पॉडमैन का उपयोग करके स्थानीय रूप से चलाया जा सकता है।"
    ],
    "commentSummary": [
      "उपयोगकर्ता विभिन्न पीडीएफ संपादन उपकरणों पर चर्चा कर रहे हैं, जिसमें उनकी संगतता, सीमाएं और वैकल्पिक विकल्प शामिल हैं।",
      "वार्तालाप में ईमेल को पीडीएफ में परिवर्तित करने और पीडीएफ कॉलम व्यवस्थित करने जैसी स्वचालन प्रक्रियाएं शामिल हैं।",
      "उपयोगकर्ता विशिष्ट सॉफ़्टवेयर, सुविधाओं, मूल्य निर्धारण चिंताओं, एआई तकनीक के उपयोग, बग का सामना और वैकल्पिक पीडीएफ टूल के लिए सुझावों का उल्लेख करते हैं।"
    ],
    "points": 385,
    "commentCount": 161,
    "retryCount": 0,
    "time": 1703534528
  },
  {
    "id": 38768678,
    "title": "प्रोग्रामर के लिए चुनौतीपूर्ण परियोजनाएं: पाठ संपादक, खेल, कंपाइलर, ओएस, स्प्रेडशीट, एमुलेटर",
    "originLink": "https://austinhenley.com/blog/challengingprojects.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38768678",
    "commentBody": "",
    "originSummary": [
      "हेनले प्रोग्रामर के लिए प्रयास करने के लिए विभिन्न प्रकार की चुनौतीपूर्ण सॉफ्टवेयर परियोजनाओं का सुझाव देते हैं, जैसे कि टेक्स्ट एडिटर का निर्माण, स्पेस आक्रमणकारियों की तरह एक 2 डी गेम, एक टिनी बेसिक कंपाइलर, एक मिनी ऑपरेटिंग सिस्टम, एक स्प्रेडशीट और एक वीडियो गेम कंसोल एमुलेटर।",
      "इन परियोजनाओं के माध्यम से, प्रोग्रामर प्रमुख अवधारणाओं में मूल्यवान ज्ञान और कौशल प्राप्त कर सकते हैं।",
      "हेनले प्रत्येक परियोजना के लिए आगे पढ़ने की सिफारिशें प्रदान करता है और पाठकों से अतिरिक्त परियोजना विचारों की एक सूची शामिल करता है।"
    ],
    "commentSummary": [
      "लेख और टिप्पणी थ्रेड्स चुनौतीपूर्ण प्रोग्रामिंग परियोजनाओं की एक श्रृंखला और सॉफ्टवेयर इंजीनियरिंग में विभिन्न कौशल के महत्व को कवर करते हैं।",
      "कुछ कोडिंग कार्यों में एआई की सीमाओं और निम्न-स्तरीय प्रोग्रामिंग ज्ञान के मूल्य पर चर्चा की जाती है।",
      "सॉफ्टवेयर इंजीनियरिंग बनाम प्रोग्रामिंग पर बहस होती है और विभिन्न क्षेत्रों में सीखने की परियोजनाओं के लिए सुझाव होते हैं, जैसे कि गेम डेवलपमेंट, मशीन लर्निंग और फ्लूइड डायनामिक्स। इसके अतिरिक्त, चर्चा तकनीक में कैरियर और अन्य गैर-कंप्यूटर से संबंधित हितों का पीछा करने के बीच संतुलन खोजने पर छूती है।"
    ],
    "points": 334,
    "commentCount": 175,
    "retryCount": 0,
    "time": 1703561124
  },
  {
    "id": 38765176,
    "title": "2023 के शीर्ष सॉफ्टवेयर ब्लॉग पोस्ट: स्केलिंग सिस्टम, आर्किटेक्चर, प्रोग्रामिंग भाषाओं का अनुकूलन, और बहुत कुछ!",
    "originLink": "https://news.ycombinator.com/item?id=38765176",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38765176",
    "commentBody": "",
    "originSummary": [
      "व्यक्ति सिस्टम स्केलिंग, आर्किटेक्चर, ऑप्टिमाइज़ेशन, प्रोग्रामिंग भाषाओं और शांत सुविधाओं जैसे विषयों को कवर करने वाले सॉफ़्टवेयर इंजीनियरिंग ब्लॉग पोस्ट की तलाश कर रहा है।",
      "वे ओपन-सोर्स परियोजनाओं, कंपनियों या व्यक्तियों की सिफारिशों के लिए खुले हैं।",
      "वे छुट्टी की शुभकामनाएं भी देते हैं।"
    ],
    "commentSummary": [
      "फोरम पोस्ट 2023 से उपयोगकर्ताओं के पसंदीदा सॉफ्टवेयर इंजीनियरिंग ब्लॉग पोस्ट पर चर्चा करता है, जिसमें सिस्टम स्केलिंग, आर्किटेक्चर, ऑप्टिमाइज़ेशन, प्रोग्रामिंग भाषाओं और शांत सुविधाओं जैसे विषयों को शामिल किया गया है।",
      "चर्चा में प्रोग्रामिंग और सॉफ्टवेयर विकास पद्धतियों, विशेष रूप से एकीकरण परीक्षण बनाम यूनिट परीक्षणों पर बहस शामिल है।",
      "उपयोगकर्ता अपने पसंदीदा ब्लॉग पोस्ट और संसाधनों की सलाह देते हैं, जो प्रासंगिक और अद्यतित जानकारी मांगने वाले सॉफ्टवेयर इंजीनियरों के लिए मूल्यवान अंतर्दृष्टि प्रदान करते हैं।"
    ],
    "points": 270,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1703531369
  },
  {
    "id": 38767936,
    "title": "सेवानिवृत्त इंजीनियर ने राज्य बोर्ड के खिलाफ प्रथम संशोधन मामला जीता",
    "originLink": "https://www.wect.com/2023/12/20/federal-court-decides-favor-retired-engineer-told-by-state-not-talk-about-math-public/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38767936",
    "commentBody": "",
    "originSummary": [
      "उत्तरी कैरोलिना में एक सेवानिवृत्त इंजीनियर, वेन नट ने राज्य के बोर्ड ऑफ एग्जामिनर्स एंड सर्वेयर के खिलाफ पहला संशोधन मामला जीता है।",
      "नट को बोर्ड द्वारा राज्य लाइसेंस के बिना अपनी इंजीनियरिंग राय ऑनलाइन साझा करने से रोकने के लिए कहा गया था।",
      "अदालत ने नट के पक्ष में फैसला सुनाया, जिसमें कहा गया कि राज्य ने उनके पहले संशोधन अधिकारों का उल्लंघन किया, इसी तरह की स्थितियों में दूसरों के लिए एक महत्वपूर्ण मिसाल कायम की।"
    ],
    "commentSummary": [
      "यह चर्चा पेशेवर इंजीनियरिंग लाइसेंस के बिना विशेषज्ञ गवाही प्रदान करने के लिए सेवानिवृत्त इंजीनियरों की पात्रता पर अदालत के फैसले के इर्द-गिर्द घूमती है।",
      "विशेषज्ञ गवाहों की योग्यता और विश्वसनीयता के साथ-साथ ब्लॉकचेन और क्रिप्टोक्यूरेंसी उद्योग में प्रतिद्वंद्विता के बारे में बहस ें उत्पन्न होती हैं।",
      "लाइसेंसिंग आवश्यकताओं, अदालती मामलों में विशेषज्ञ गवाहों की भूमिका, इंजीनियरिंग जैसे व्यवसायों में प्रमाणन के मूल्य और इंजीनियरिंग में गणित के महत्व पर भी चर्चा की जाती है।"
    ],
    "points": 258,
    "commentCount": 77,
    "retryCount": 0,
    "time": 1703552511
  },
  {
    "id": 38762214,
    "title": "पासवर्ड प्रबंधक और Zsh रैपर के साथ SSH पासवर्ड प्रमाणीकरण में सुधार करना",
    "originLink": "https://vincent.bernat.ch/en/blog/2023-sshpass-without-sshpass",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38762214",
    "commentBody": "",
    "originSummary": [
      "लेख गैर-इंटरैक्टिव एसएसएच पासवर्ड प्रमाणीकरण की पड़ताल करता है और पासवर्ड प्रबंधक से पासवर्ड पुनर्प्राप्त करने के लिए एक जेडएसएच रैपर प्रदान करता है।",
      "यह एससीपी को कस्टम एसएसएच फ़ंक्शन का उपयोग करने के लिए एक विधि प्रस्तुत करता है।",
      "पोस्ट पासवर्ड के बजाय सार्वजनिक कुंजी का उपयोग करने के लाभों पर प्रकाश डालती है और प्रमाण पत्र-आधारित प्रमाणीकरण और अधिक बारीक प्राधिकरण विधियों से जुड़ी चुनौतियों पर चर्चा करती है।"
    ],
    "commentSummary": [
      "चर्चा एसएसएच पासवर्ड प्रमाणीकरण, विशेषाधिकार प्राप्त पहुंच प्रबंधन प्रणाली और प्रमाणीकरण विधियों के विभिन्न पहलुओं की पड़ताल करती है, जैसे कि कर्बेरोस और इसकी सीमाएं।",
      "इसमें सरलीकृत सेटअप के लिए फ्रीआईपीए का कार्यान्वयन, एसएसएच कुंजी प्रमाणीकरण और उनके समाधान के साथ चुनौतियां, और फ़ाइल स्थानांतरण के लिए एसएफटीपी, आरसिंक और स्शपास का उपयोग भी शामिल है।",
      "अन्य विषयों में शेल स्क्रिप्ट और एपीआई के साथ समस्याएं, एसएसएच कुंजियों को डिक्रिप्ट करना, पासवर्ड को स्थायी रूप से संग्रहीत करने के बारे में चिंताएं और बड़े पैमाने पर वातावरण में पासवर्ड प्रबंधित करना शामिल हैं।"
    ],
    "points": 239,
    "commentCount": 98,
    "retryCount": 0,
    "time": 1703508923
  },
  {
    "id": 38766178,
    "title": "सॉफ्टवेयर अपडेट ने वाहन को अक्षम बना दिया, मालिक को समर्थन से संपर्क करने की सलाह दी गई",
    "originLink": "https://twitter.com/danluu/status/1739387245034139692",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38766178",
    "commentBody": "",
    "originSummary": [
      "किसी वाहन का सॉफ़्टवेयर अपडेट विफल हो गया है, जिससे वाहन अनुपयोगी हो गया है।",
      "मालिक से सहायता के लिए ग्राहक सहायता तक पहुंचने का आग्रह किया जाता है।",
      "पोस्ट विशिष्ट मुद्दे के बारे में कोई और विवरण प्रदान नहीं करता है या इसे कैसे हल किया जा सकता है।"
    ],
    "commentSummary": [
      "चर्चा में विशेष रूप से स्मार्ट कार कार्यक्षमता को बढ़ाने के लिए वाहनों में सॉफ्टवेयर अपडेट और एकीकरण के महत्व पर प्रकाश डाला गया।",
      "कई घटकों को अद्यतन करने में चुनौतियों और असफल तंत्र की आवश्यकता को प्रमुख चिंताओं के रूप में पहचाना गया था।",
      "टेस्ला के सॉफ्टवेयर इंजीनियरिंग, सख्त नियमों की आवश्यकता, सॉफ्टवेयर विश्वसनीयता के बारे में चिंताओं और वाहनों में इंटरनेट कनेक्टिविटी की मांग पर भी चर्चा की गई।"
    ],
    "points": 235,
    "commentCount": 148,
    "retryCount": 0,
    "time": 1703538836
  },
  {
    "id": 38762065,
    "title": "55 कनेक्टेड उपकरणों के साथ भीड़ भरे नेटवर्क के कारण इनफ्लाइट वाईफाई गड़बड़",
    "originLink": "https://twitter.com/erratarob/status/1739132876732674539?s=46&t=FFxXRm_qmWG4nJwsccRUbA",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38762065",
    "commentBody": "",
    "originSummary": [
      "व्यक्ति को इनफ्लाइट वाईफाई के साथ समस्याओं का सामना करना पड़ा, जिसे डीएचसीपी पट्टे की कमी के लिए जिम्मेदार ठहराया गया था।",
      "मुद्दे के समय, वाईफाई नेटवर्क से जुड़े 55 डिवाइस थे।"
    ],
    "commentSummary": [
      "चर्चा में नेटवर्किंग विषयों की एक श्रृंखला शामिल है, जैसे वाईफाई कनेक्टिविटी मुद्दे, पुस्तक सुझाव, होम नेटवर्क सेटअप और कैप्टिव पोर्टल्स को दरकिनार करना।",
      "विशिष्ट नेटवर्किंग प्रौद्योगिकियों और वीएलएएन अलगाव और एक्सेस पॉइंट प्रबंधन जैसे तरीकों पर भी चर्चा की जाती है।",
      "अन्य विषयों में कैप्टिव पोर्टल, यात्रा राउटर उपयोग, सुरक्षा चिंताओं, \"इंटरनेट रीसेट\" की अवधारणा, आईटी प्रमाणपत्र और हवाई जहाज पर हैकिंग टूल का उपयोग करने के कानूनी निहितार्थ शामिल हैं।"
    ],
    "points": 221,
    "commentCount": 155,
    "retryCount": 0,
    "time": 1703507270
  },
  {
    "id": 38763566,
    "title": "प्रतियोगिता फैक्टरी ऑनलाइन प्रतियोगिता आयोजकों पर मुकदमा करने के लिए व्यापक सॉफ्टवेयर पेटेंट का उपयोग करती है, ईएफएफ द्वारा चुनौती दी जाती है",
    "originLink": "https://www.eff.org/deeplinks/2023/12/stupid-patent-month-selfie-contests",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38763566",
    "commentBody": "",
    "originSummary": [
      "कॉन्टेस्ट फैक्ट्री ने ऑनलाइन प्रतियोगिताओं का आयोजन करने वाली कंपनियों के खिलाफ कई मुकदमे दायर किए हैं, जिसमें कहा गया है कि उनके पेटेंट ऑनलाइन प्रतियोगिताओं की एक विस्तृत श्रृंखला को कवर करते हैं।",
      "इलेक्ट्रॉनिक फ्रंटियर फाउंडेशन (ईएफएफ) का तर्क है कि ये सॉफ्टवेयर पेटेंट लोगों के खुद को व्यक्त करने और ऑनलाइन संस्कृति में भाग लेने के अधिकार को नुकसान पहुंचाते हैं।",
      "ईएफएफ का मानना है कि इस तरह के पेटेंट नहीं दिए जाने चाहिए थे और इन पेटेंटों को चुनौती देने के लिए अधिक सुलभ प्रक्रिया की वकालत करता है।"
    ],
    "commentSummary": [
      "इलेक्ट्रॉनिक फ्रंटियर फाउंडेशन (ईएफएफ) ने \"सेल्फी प्रतियोगिताओं\" नामक एक पेटेंट के बारे में चिंता जताई है और तर्क दिया है कि रोजमर्रा की गतिविधि में \"कंप्यूटर पर\" शब्दों को जोड़ना पेटेंट योग्य नहीं होना चाहिए।",
      "चर्चा पूर्व कला, स्पष्टता, पेटेंट ट्रोलिंग और पेटेंट को अमान्य करने की प्रक्रिया जैसे मुद्दों पर केंद्रित है।",
      "विभिन्न सुझाव दिए जाते हैं, जिसमें वकीलों का उपयोग या अमान्यता का अनुरोध करने के लिए एक औपचारिक प्रक्रिया शामिल है, लेकिन इसमें शामिल जटिलता और लागत को स्वीकार किया जाता है। पूर्व कला और संदिग्ध पेटेंट अनुमोदन के उदाहरण ों का भी उल्लेख किया गया है।"
    ],
    "points": 171,
    "commentCount": 43,
    "retryCount": 0,
    "time": 1703519513
  },
  {
    "id": 38764353,
    "title": "TKey: सुरक्षित अनुप्रयोगों के लिए USB स्टिक कंप्यूटर",
    "originLink": "https://dev.tillitis.se/intro/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38764353",
    "commentBody": "",
    "originSummary": [
      "टिलिटिस टीकेई एक यूएसबी स्टिक कंप्यूटर है जो विशेष रूप से सुरक्षित एप्लिकेशन चलाने के लिए बनाया गया है जो एन्क्रिप्शन और टोकन जनरेशन जैसी विभिन्न सुरक्षा सुविधाओं की पेशकश करता है।",
      "यह 32-बिट आरआईएससी-वी सीपीयू, हार्डवेयर-असिस्टेड एड्रेस रैंडमाइजेशन और रैम स्क्रैम्बलिंग के साथ आता है, और कोई लगातार स्टोरेज नहीं है।",
      "डिवाइस एक अद्वितीय डिवाइस सीक्रेट (यूडीएस) और एक यौगिक डिवाइस पहचानकर्ता (सीडीआई) का उपयोग करके इसे मापकर लोड किए गए एप्लिकेशन की अखंडता सुनिश्चित करता है, और इसके सभी सॉफ्टवेयर और हार्डवेयर डिज़ाइन खुले स्रोत हैं।"
    ],
    "commentSummary": [
      "चर्चा TKey के आसपास केंद्रित है, जो USB-C मामले में RISC-V कंप्यूटर है जो सुरक्षा अनुप्रयोग चला सकता है।",
      "TKey स्टेटलेस है और प्रत्येक डिवाइस + एप्लिकेशन संयोजन के लिए अद्वितीय कुंजी सामग्री उत्पन्न करने के लिए एक महत्वपूर्ण व्युत्पत्ति फ़ंक्शन का उपयोग करता है।",
      "यह अन्य एप्लिकेशन, सत्यापित बूट नीतियों को लोड करने का समर्थन करता है, और पारदर्शिता लॉग के माध्यम से महत्वपूर्ण समझौता को संबोधित करता है।",
      "नोट: चर्चा में यह भी शामिल है:",
      "FIDO2, TOTP और GPG जैसे प्रमाणीकरण विधियों का उल्लेख.",
      "संगतता और हार्डवेयर सुरक्षा की चुनौतियां।",
      "ट्रस्ट मान्यताओं को वितरित करने के लिए परियोजना सिगसम।",
      "आपूर्ति श्रृंखला हमलों को कम करने के लिए एफपीजीए प्रौद्योगिकी का उपयोग।",
      "TKey की तुलना YubiKey और अग्रदूत जैसे अन्य उपकरणों से करें।",
      "हार्डवेयर सुरक्षा में छेड़छाड़ साक्ष्य और छेड़छाड़ प्रतिक्रिया का महत्व।",
      "एफआईपीएस प्रमाणन की चुनौतियां।",
      "स्क्रीन के बिना सुरक्षा उपकरणों का उपयोग करने के जोखिम और व्यावहारिकता।",
      "हल्के ऐप-विशिष्ट एचएसएम की इच्छा।",
      "आला इलेक्ट्रॉनिक्स के लिए प्रमाणन की लागत।",
      "व्यावसायीकरण में शामिल अतिरिक्त मार्कअप।"
    ],
    "points": 168,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1703525177
  },
  {
    "id": 38764452,
    "title": "एकल-थ्रेडेड निष्पादन को मजबूर करके गिट बैकअप में प्रजनन क्षमता प्राप्त करना",
    "originLink": "https://baecher.dev/stdout/reproducible-git-bundles/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38764452",
    "commentBody": "",
    "originSummary": [
      "गिट रिपॉजिटरी का बैकअप लेते समय लेखक को गैर-निर्धारक व्यवहार के साथ समस्याओं का सामना करना पड़ा।",
      "उन्होंने बंडलिंग प्रक्रिया को कारण के रूप में पहचाना और गिट में एकल-थ्रेडेड ऑपरेशन को लागू करके इसे हल किया।",
      "प्रदर्शन में ट्रेड-ऑफ के परिणामस्वरूप नियतात्मक आउटपुट हुआ, जिससे बैकअप में प्रजनन क्षमता सक्षम हुई।"
    ],
    "commentSummary": [
      "लोकप्रिय वेबसाइट हैकर न्यूज वर्तमान में समस्याओं का सामना कर रही है और समय पर अनुरोधों को संभालने में असमर्थ है।",
      "उपयोगकर्ताओं को हैकर समाचार पर सामग्री तक पहुंचने में देरी या कठिनाइयों का अनुभव हो सकता है।",
      "वेबसाइट के प्रदर्शन को प्रभावित करने वाले तकनीकी मुद्दों को वर्तमान में संबोधित किया जा रहा है।"
    ],
    "points": 156,
    "commentCount": 24,
    "retryCount": 0,
    "time": 1703526056
  },
  {
    "id": 38763165,
    "title": "जर्मन अदालतें उपयोगकर्ता स्वतंत्रता की पुष्टि करती हैं: विज्ञापन-ब्लॉकर्स और कॉपीराइट कानून",
    "originLink": "https://fsfe.org/news/2023/news-20231220-01.en.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38763165",
    "commentBody": "",
    "originSummary": [
      "जर्मनी में हाल के अदालती मामलों ने इंटरनेट उपयोगकर्ताओं के हस्तक्षेप वाले विज्ञापन से बचने के साधन के रूप में विज्ञापन-ब्लॉकर्स का उपयोग करने के अधिकार को बरकरार रखा है।",
      "अदालत के फैसले में कहा गया है कि विज्ञापन-ब्लॉकर्स का उपयोग कॉपीराइट कानूनों का उल्लंघन नहीं करता है, जिससे उपयोगकर्ताओं को कानूनी सुरक्षा मिलती है।",
      "हालांकि, अदालत ने यह भी फैसला सुनाया कि कंपनियां विज्ञापन-ब्लॉकर्स वाले उपयोगकर्ताओं को अपनी सामग्री तक पहुंचने से बाहर करने या भुगतान किए गए एक्सेस मॉडल को लागू करने का विकल्प चुन सकती हैं।"
    ],
    "commentSummary": [
      "लेख उपयोगकर्ता स्वतंत्रता और एडब्लॉकर्स से संबंधित विभिन्न विषयों पर चर्चा करता है, जिसमें मुक्त भाषण पर विज्ञापन का प्रभाव और विज्ञापन-ब्लॉकिंग की वैधता और नैतिकता शामिल है।",
      "यह मैलवेयर, अनधिकृत कंप्यूटर उपयोग और सामग्री रचनाकारों के लिए वैकल्पिक मुद्रीकरण विधियों के मुद्दों की पड़ताल करता है।",
      "विभिन्न दृष्टिकोण और सुझाव प्रस्तुत किए जाते हैं, जैसे विज्ञापन-मुक्त संस्करणों के लिए भुगतान करना या वेबसाइटों के लिए वैकल्पिक राजस्व मॉडल की खोज करना।"
    ],
    "points": 149,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1703516766
  },
  {
    "id": 38765196,
    "title": "अपनी खुद की नाइट क्लॉक प्रोजेक्टर बनाएं: आसान DIY गाइड (2018)",
    "originLink": "https://microengineer.eu/2018/05/01/diy-night-clock-projector/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38765196",
    "commentBody": "",
    "originSummary": [
      "DIY नाइट क्लॉक प्रोजेक्टर एक ऐसी परियोजना है जिसमें एक घड़ी प्रोजेक्टर का निर्माण शामिल है जो रात में छत पर समय प्रोजेक्ट कर सकता है।",
      "परियोजना एक छोटी नकारात्मक एलसीडी स्क्रीन का उपयोग करती है और फोकल लंबाई के आधार पर छवि आकार की गणना करती है।",
      "इसमें इलेक्ट्रॉनिक्स निर्माण के लिए डिज़ाइन किए गए दो पीसीबी शामिल हैं और विभिन्न केस विकल्प प्रदान करते हैं। इसके अतिरिक्त, योजनाबद्ध, लेआउट, सामग्री के बिल, और 3 डी एसटीएल फ़ाइलों के लिए डाउनलोड करने योग्य फाइलें प्रदान की जाती हैं।"
    ],
    "commentSummary": [
      "लेख माइक्रोविजन लेजर प्रोजेक्टर का उपयोग करके एक DIY नाइट क्लॉक प्रोजेक्टर प्रोजेक्ट की पड़ताल करता है।",
      "लेखक प्रोजेक्टर के साथ अपने व्यक्तिगत अनुभव साझा करता है और इसके लिए वीजीए केबलों की उपलब्धता को संबोधित करता है।",
      "उपयोगकर्ताओं की टिप्पणियां छोटे लेजर एमईएमएस प्रोजेक्टर के बंद होने, छवि की गुणवत्ता के बारे में चिंताओं और संभावित नींद की गुणवत्ता के मुद्दों को हल करने के लिए वैकल्पिक विकल्पों के सुझावों पर स्पर्श करती हैं।"
    ],
    "points": 147,
    "commentCount": 40,
    "retryCount": 0,
    "time": 1703531529
  },
  {
    "id": 38763933,
    "title": "किफायती कंप्यूटिंग का उदय: मेनफ्रेम से माइक्रो कंप्यूटर तक",
    "originLink": "https://www.theregister.com/2023/12/25/the_war_of_the_workstations/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38763933",
    "commentBody": "",
    "originSummary": [
      "यह लेख कंप्यूटिंग में प्रगति के विचार को चुनौती देता है और पूरे इतिहास में कंप्यूटर के सरल और सस्ते मॉडल के विकास पर प्रकाश डालता है।",
      "यह 1980 के दशक में मेनफ्रेम से माइक्रो कंप्यूटर तक कंप्यूटर के विकास और सादगी और सामर्थ्य के लिए किए गए ट्रेड-ऑफ की पड़ताल करता है।",
      "यह न्यूटन, लिस्प और स्मॉलटॉक मशीनों के साथ-साथ विभिन्न ऑपरेटिंग सिस्टम के विकास, क्षमताओं और गिरावट पर चर्चा करता है। यह कई प्रोग्रामिंग भाषाओं के उपयोग और समर्पित हार्डवेयर के फायदों के बारे में भी सवाल उठाता है।",
      "लेख सॉफ्टवेयर विकास में विभिन्न डिजाइन दृष्टिकोणों और सस्ती और विनिमेय सॉफ्टवेयर के पक्ष में लिस्प की गिरावट का उल्लेख करता है।",
      "यह विभिन्न सॉफ़्टवेयर, प्रौद्योगिकियों और उल्लिखित विषयों को सूचीबद्ध करके समाप्त होता है, जैसे कि माइक्रोसॉफ्ट ऑफिस, विजुअल स्टूडियो, ओपन सोर्स सॉफ़्टवेयर, प्रोग्रामिंग भाषाएं और शिक्षा।"
    ],
    "commentSummary": [
      "पाठ कंप्यूटिंग प्रौद्योगिकी और प्रोग्रामिंग भाषा विषयों की एक श्रृंखला पर टिप्पणियों, चर्चाओं और राय का संकलन है।",
      "इसमें कम लागत वाली तकनीक, ओपन-सोर्स सॉफ्टवेयर, कोड शेयरिंग चुनौतियां, पीसी प्रभुत्व, प्रोग्रामिंग भाषा इतिहास और कंप्यूटिंग प्रतिमान का उपयोग शामिल है।",
      "उल्लिखित विशिष्ट प्रौद्योगिकियों और परियोजनाओं में लिस्प मशीन, एसके 8, डायलन और जीएनयू परियोजना शामिल हैं।"
    ],
    "points": 145,
    "commentCount": 78,
    "retryCount": 0,
    "time": 1703522316
  }
]
