[
  {
    "id": 38765627,
    "title": "Stirling-PDF: أداة معالجة PDF مليئة بالميزات للاستخدام المحلي",
    "originLink": "https://github.com/Frooodle/Stirling-PDF",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38765627",
    "commentBody": "",
    "originSummary": [
      "Stirling-PDF هي أداة مستضافة محليا على شبكة الإنترنت لمعالجة ملفات PDF ، وتقدم ميزات مثل التقسيم والدمج والتحويل والمزيد.",
      "تضمن الأداة أمان وخصوصية الملفات ، دون إجراء مكالمات صادرة للتتبع أو حفظ السجلات.",
      "يستخدم تقنيات مثل Spring Boot و Thymeleaf و PDFBox و LibreOffice والمزيد ، ويمكن الوصول إليه من خلال مثيل مستضاف أو تشغيله محليا باستخدام Docker أو Podman."
    ],
    "commentSummary": [
      "يناقش المستخدمون أدوات تحرير PDF المختلفة ، بما في ذلك توافقها وقيودها وخياراتها البديلة.",
      "تشمل المحادثة عمليات الأتمتة مثل تحويل رسائل البريد الإلكتروني إلى ملفات PDF وتنظيم أعمدة PDF.",
      "يذكر المستخدمون برامج محددة ، وميزات ، ومخاوف بشأن التسعير ، واستخدام تقنية الذكاء الاصطناعي ، والأخطاء التي تمت مواجهتها ، واقتراحات لأدوات PDF البديلة."
    ],
    "points": 385,
    "commentCount": 161,
    "retryCount": 0,
    "time": 1703534528
  },
  {
    "id": 38768678,
    "title": "مشاريع صعبة للمبرمجين: محرر نصوص ، لعبة ، مترجم ، نظام تشغيل ، جدول بيانات ، محاكي",
    "originLink": "https://austinhenley.com/blog/challengingprojects.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38768678",
    "commentBody": "",
    "originSummary": [
      "يقترح أوستن زد هينلي مجموعة متنوعة من مشاريع البرامج الصعبة للمبرمجين لتجربتها ، مثل إنشاء محرر نصوص ، ولعبة 2D مثل Space Invaders ، ومترجم Tiny BASIC ، ونظام تشغيل صغير ، وجدول بيانات ، ومحاكي وحدة تحكم ألعاب الفيديو.",
      "من خلال هذه المشاريع ، يمكن للمبرمجين اكتساب المعرفة والمهارات القيمة في المفاهيم الأساسية.",
      "يقدم Henley المزيد من توصيات القراءة لكل مشروع ويتضمن قائمة بأفكار المشاريع الإضافية من القراء."
    ],
    "commentSummary": [
      "تغطي سلاسل المقالات والتعليقات مجموعة من مشاريع البرمجة الصعبة وأهمية المهارات المختلفة في هندسة البرمجيات.",
      "تتم مناقشة قيود الذكاء الاصطناعي في بعض مهام الترميز وقيمة المعرفة البرمجية منخفضة المستوى.",
      "هناك مناقشات حول هندسة البرمجيات مقابل البرمجة واقتراحات لمشاريع التعلم في مختلف المجالات ، مثل تطوير الألعاب والتعلم الآلي وديناميكيات السوائل. بالإضافة إلى ذلك ، تتطرق المناقشة إلى إيجاد توازن بين مهنة في مجال التكنولوجيا ومتابعة اهتمامات أخرى غير متعلقة بالكمبيوتر."
    ],
    "points": 334,
    "commentCount": 175,
    "retryCount": 0,
    "time": 1703561124
  },
  {
    "id": 38765176,
    "title": "أهم منشورات مدونة البرامج لعام 2023: توسيع نطاق الأنظمة وتحسين البنى ولغات البرمجة والمزيد!",
    "originLink": "https://news.ycombinator.com/item?id=38765176",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38765176",
    "commentBody": "",
    "originSummary": [
      "يبحث الشخص عن منشورات مدونة هندسة البرمجيات التي تغطي موضوعات مثل تحجيم النظام والبنى والتحسين ولغات البرمجة والميزات الرائعة.",
      "إنهم منفتحون على التوصيات من المشاريع مفتوحة المصدر أو الشركات أو الأفراد.",
      "كما يقدمون تحيات العيد."
    ],
    "commentSummary": [
      "يناقش منشور المنتدى منشورات مدونة هندسة البرمجيات المفضلة للمستخدمين اعتبارا من عام 2023 ، والتي تغطي موضوعات مثل تحجيم النظام ، والبنى ، والتحسين ، ولغات البرمجة ، والميزات الرائعة.",
      "تتضمن المناقشة مناقشات حول منهجيات البرمجة وتطوير البرمجيات ، وتحديدا اختبارات التكامل مقابل اختبارات الوحدة.",
      "يوصي المستخدمون بمشاركات وموارد المدونة المفضلة لديهم ، مما يوفر رؤى قيمة لمهندسي البرمجيات الذين يبحثون عن معلومات ذات صلة ومحدثة."
    ],
    "points": 270,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1703531369
  },
  {
    "id": 38767936,
    "title": "مهندس متقاعد يفوز بقضية التعديل الأول ضد مجلس الدولة",
    "originLink": "https://www.wect.com/2023/12/20/federal-court-decides-favor-retired-engineer-told-by-state-not-talk-about-math-public/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38767936",
    "commentBody": "",
    "originSummary": [
      "فاز مهندس متقاعد في ولاية كارولينا الشمالية ، واين نوت ، بقضية التعديل الأول ضد مجلس الممتحنين والمساحين بالولاية.",
      "طلب مجلس الإدارة من نوت التوقف عن مشاركة آرائه الهندسية عبر الإنترنت دون ترخيص من الدولة.",
      "حكمت المحكمة لصالح نوت ، مشيرة إلى أن الدولة انتهكت حقوقه في التعديل الأول ، مما شكل سابقة مهمة للآخرين في مواقف مماثلة."
    ],
    "commentSummary": [
      "يدور النقاش حول حكم المحكمة بشأن أحقية المهندسين المتقاعدين لتقديم شهادة خبير دون ترخيص هندسي مهني.",
      "تنشأ مناقشات بشأن مؤهلات ومصداقية الشهود الخبراء ، فضلا عن المنافسات في صناعة blockchain و cryptocurrency.",
      "كما تتم مناقشة متطلبات الترخيص ، ودور الشهود الخبراء في قضايا المحاكم ، وقيمة الشهادات في مهن مثل الهندسة ، وأهمية الرياضيات في الهندسة."
    ],
    "points": 258,
    "commentCount": 77,
    "retryCount": 0,
    "time": 1703552511
  },
  {
    "id": 38762214,
    "title": "تحسين مصادقة كلمة مرور SSH باستخدام مدير كلمات المرور وغلاف Zsh",
    "originLink": "https://vincent.bernat.ch/en/blog/2023-sshpass-without-sshpass",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38762214",
    "commentBody": "",
    "originSummary": [
      "تستكشف المقالة مصادقة كلمة مرور SSH غير التفاعلية وتقدم غلاف Zsh لاسترداد كلمات المرور من مدير كلمات المرور.",
      "يقدم طريقة لجعل scp يستخدم وظيفة ssh المخصصة.",
      "يسلط المنشور الضوء على فوائد استخدام المفاتيح العامة بدلا من كلمات المرور ويناقش التحديات المرتبطة بالمصادقة المستندة إلى الشهادة وطرق التفويض الأكثر دقة."
    ],
    "commentSummary": [
      "تستكشف المناقشة الجوانب المختلفة لمصادقة كلمة مرور SSH وأنظمة إدارة الوصول المميزة وطرق المصادقة ، مثل Kerberos وقيوده.",
      "كما يغطي تنفيذ FreeIPA للإعداد المبسط ، والتحديات المتعلقة بمصادقة مفتاح SSH وحلولها ، واستخدام SFTP و rsync و sshpass لنقل الملفات.",
      "تتضمن الموضوعات الأخرى مشكلات في البرامج النصية shell وواجهات برمجة التطبيقات ، وفك تشفير مفاتيح SSH ، والمخاوف بشأن تخزين كلمات المرور بشكل دائم ، وإدارة كلمات المرور في بيئات واسعة النطاق."
    ],
    "points": 239,
    "commentCount": 98,
    "retryCount": 0,
    "time": 1703508923
  },
  {
    "id": 38766178,
    "title": "تحديث البرنامج يجعل السيارة غير قابلة للقيادة ، ينصح المالك بالاتصال بالدعم",
    "originLink": "https://twitter.com/danluu/status/1739387245034139692",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38766178",
    "commentBody": "",
    "originSummary": [
      "فشل تحديث برنامج السيارة، مما تسبب في أن تكون السيارة غير صالحة للاستعمال.",
      "يتم حث المالك على التواصل مع دعم العملاء للحصول على المساعدة.",
      "لا يقدم المنشور أي تفاصيل أخرى بخصوص المشكلة المحددة أو كيف يمكن حلها."
    ],
    "commentSummary": [
      "وسلطت المناقشة الضوء على أهمية تحديث البرامج وتكاملها في المركبات، لا سيما لتعزيز وظائف السيارات الذكية.",
      "وتم تحديد التحديات التي تواجه تحديث المكونات المتعددة والحاجة إلى آليات آمنة من الأعطال كشواغل رئيسية.",
      "كما تمت مناقشة هندسة البرمجيات في تسلا ، والحاجة إلى لوائح أكثر صرامة ، والمخاوف بشأن موثوقية البرامج ، والطلب على الاتصال بالإنترنت في المركبات."
    ],
    "points": 235,
    "commentCount": 148,
    "retryCount": 0,
    "time": 1703538836
  },
  {
    "id": 38762065,
    "title": "خلل في شبكة WiFi على متن الطائرة ناتج عن ازدحام الشبكة مع 55 جهازا متصلا",
    "originLink": "https://twitter.com/erratarob/status/1739132876732674539?s=46&t=FFxXRm_qmWG4nJwsccRUbA",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38762065",
    "commentBody": "",
    "originSummary": [
      "واجه الفرد مشاكل مع شبكة wifi على متن الطائرة ، والتي تعزى إلى عدم وجود عقد إيجار DHCP.",
      "في وقت المشكلة ، كان هناك 55 جهازا متصلا بشبكة wifi."
    ],
    "commentSummary": [
      "تشمل المناقشة مجموعة من موضوعات الشبكات ، مثل مشكلات اتصال WiFi ، واقتراحات الكتب ، وإعداد الشبكة المنزلية ، وتجاوز البوابات المقيدة.",
      "كما تتم مناقشة تقنيات وأساليب الشبكات المحددة مثل فصل VLAN وإدارة نقطة الوصول.",
      "تشمل الموضوعات الأخرى الإحباط من البوابات الأسيرة ، واستخدام جهاز توجيه السفر ، والمخاوف الأمنية ، ومفهوم \"إعادة تعيين الإنترنت\" ، وشهادات تكنولوجيا المعلومات ، والآثار القانونية لاستخدام أدوات القرصنة على الطائرات."
    ],
    "points": 221,
    "commentCount": 155,
    "retryCount": 0,
    "time": 1703507270
  },
  {
    "id": 38763566,
    "title": "يستخدم مصنع المسابقة براءات اختراع برمجية واسعة لمقاضاة منظمي المسابقة عبر الإنترنت ، وتطعن فيها EFF",
    "originLink": "https://www.eff.org/deeplinks/2023/12/stupid-patent-month-selfie-contests",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38763566",
    "commentBody": "",
    "originSummary": [
      "رفعت Contest Factory دعاوى قضائية متعددة ضد الشركات التي تنظم مسابقات عبر الإنترنت ، مؤكدة أن براءات اختراعها تغطي مجموعة واسعة من المسابقات عبر الإنترنت.",
      "تجادل مؤسسة الحدود الإلكترونية (EFF) بأن براءات اختراع البرمجيات هذه تضر بحق الناس في التعبير عن أنفسهم والمشاركة في ثقافة الإنترنت.",
      "تعتقد EFF أنه لم يكن ينبغي منح مثل هذه البراءات وتدعو إلى عملية يسهل الوصول إليها للطعن في هذه البراءات."
    ],
    "commentSummary": [
      "أثارت مؤسسة الحدود الإلكترونية (EFF) مخاوف بشأن براءة اختراع تسمى \"مسابقات السيلفي\" وتجادل بأن مجرد إضافة عبارة \"على جهاز كمبيوتر\" إلى نشاط يومي لا ينبغي أن يكون قابلا للبراءة.",
      "وتركز المناقشة على قضايا مثل حالة التقنية الصناعية السابقة، والوضوح، والتصيد في البراءات، وعملية إبطال البراءات.",
      "يتم تقديم اقتراحات مختلفة ، بما في ذلك استخدام محامين أو عملية رسمية لطلب الإبطال ، ولكن يتم الاعتراف بالتعقيد والتكلفة التي ينطوي عليها. وترد أيضا أمثلة على حالة التقنية الصناعية السابقة والموافقات المشكوك فيها على البراءات."
    ],
    "points": 171,
    "commentCount": 43,
    "retryCount": 0,
    "time": 1703519513
  },
  {
    "id": 38764353,
    "title": "TKey: كمبيوتر USB Stick للتطبيقات الآمنة",
    "originLink": "https://dev.tillitis.se/intro/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38764353",
    "commentBody": "",
    "originSummary": [
      "Tillitis TKey هو كمبيوتر عصا USB مصمم خصيصا لتشغيل التطبيقات الآمنة التي توفر ميزات أمان متنوعة مثل التشفير وإنشاء الرمز المميز.",
      "يأتي مزودا بوحدة معالجة مركزية RISC-V 32 بت ، وعشوائية للعناوين بمساعدة الأجهزة وذاكرة الوصول العشوائي ، ولا يوجد تخزين دائم.",
      "يضمن الجهاز سلامة التطبيق المحمل عن طريق قياسه باستخدام سر الجهاز الفريد (UDS) ومعرف الجهاز المركب (CDI) ، وجميع تصميمات البرامج والأجهزة الخاصة به مفتوحة المصدر."
    ],
    "commentSummary": [
      "تتمحور المناقشة حول TKey ، وهو كمبيوتر RISC-V في علبة USB-C يمكنه تشغيل تطبيقات الأمان.",
      "TKey عديم الحالة ويستخدم وظيفة اشتقاق مفتاح لإنشاء مادة رئيسية فريدة لكل مجموعة أجهزة + تطبيقات.",
      "وهو يدعم تحميل التطبيقات الأخرى وسياسات التمهيد التي تم التحقق منها ومعالجة التسوية الرئيسية من خلال سجلات الشفافية.",
      "ملاحظة: تشمل المناقشة أيضا:",
      "ذكر طرق المصادقة مثل FIDO2 و TOTP و GPG.",
      "تحديات التوافق وأمن الأجهزة.",
      "مشروع Sigsum لتوزيع افتراضات الثقة.",
      "استخدام تقنية FPGA للتخفيف من هجمات سلسلة التوريد.",
      "مقارنة TKey بالأجهزة الأخرى مثل YubiKey والسلائف.",
      "أهمية دليل العبث واستجابة العبث في أمان الأجهزة.",
      "تحديات شهادة FIPS.",
      "المخاطر والتطبيق العملي لاستخدام الأجهزة الأمنية بدون شاشات.",
      "الرغبة في الحصول على HSMs خفيفة الوزن خاصة بالتطبيق.",
      "تكلفة إصدار الشهادات للإلكترونيات المتخصصة.",
      "ترميز إضافي يشارك في التسويق."
    ],
    "points": 168,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1703525177
  },
  {
    "id": 38764452,
    "title": "تحقيق قابلية التكرار في النسخ الاحتياطية ل Git عن طريق فرض تنفيذ أحادي الخيط",
    "originLink": "https://baecher.dev/stdout/reproducible-git-bundles/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38764452",
    "commentBody": "",
    "originSummary": [
      "واجه المؤلف مشكلات في السلوك غير الحتمي عند النسخ الاحتياطي لمستودعات git.",
      "حددوا عملية التجميع كسبب وحلها عن طريق فرض عملية أحادية الخيوط في git.",
      "أدت المفاضلة في الأداء إلى مخرجات حتمية ، مما يتيح إمكانية التكرار في النسخ الاحتياطية."
    ],
    "commentSummary": [
      "يواجه موقع Hacker News الشهير حاليا مشكلات وغير قادر على التعامل مع الطلبات في الوقت المناسب.",
      "قد يواجه المستخدمون تأخيرات أو صعوبات في الوصول إلى المحتوى على Hacker News.",
      "تتم حاليا معالجة المشكلات الفنية التي تؤثر على أداء الموقع."
    ],
    "points": 156,
    "commentCount": 24,
    "retryCount": 0,
    "time": 1703526056
  },
  {
    "id": 38763165,
    "title": "المحاكم الألمانية تؤكد على حرية المستخدم: حاصرات الإعلانات وقوانين حقوق النشر",
    "originLink": "https://fsfe.org/news/2023/news-20231220-01.en.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38763165",
    "commentBody": "",
    "originSummary": [
      "أيدت قضايا المحاكم الأخيرة في ألمانيا حق مستخدمي الإنترنت في استخدام أدوات حظر الإعلانات كوسيلة لتجنب الإعلانات المتطفلة.",
      "تنص أحكام المحكمة على أن استخدام أدوات حظر الإعلانات لا ينتهك قوانين حقوق الطبع والنشر ، مما يمنح المستخدمين الحماية القانونية.",
      "ومع ذلك ، قضت المحكمة أيضا بأنه يمكن للشركات اختيار استبعاد المستخدمين الذين لديهم أدوات حظر الإعلانات من الوصول إلى محتواهم أو تنفيذ نموذج الوصول المدفوع."
    ],
    "commentSummary": [
      "يناقش المقال مواضيع مختلفة تتعلق بحرية المستخدم وحظر الإعلانات ، بما في ذلك تأثير الإعلان على حرية التعبير وشرعية وأخلاقيات حظر الإعلانات.",
      "يستكشف مشكلات البرامج الضارة والاستخدام غير المصرح به للكمبيوتر وطرق تحقيق الدخل البديلة لمنشئي المحتوى.",
      "يتم تقديم وجهات نظر واقتراحات مختلفة ، مثل الدفع مقابل الإصدارات الخالية من الإعلانات أو استكشاف نماذج إيرادات بديلة لمواقع الويب."
    ],
    "points": 149,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1703516766
  },
  {
    "id": 38765196,
    "title": "قم ببناء جهاز عرض الساعة الليلية الخاص بك: دليل DIY السهل (2018)",
    "originLink": "https://microengineer.eu/2018/05/01/diy-night-clock-projector/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38765196",
    "commentBody": "",
    "originSummary": [
      "جهاز عرض الساعة الليلية DIY هو مشروع يتضمن بناء جهاز عرض على مدار الساعة يمكنه عرض الوقت على السقف ليلا.",
      "يستخدم المشروع شاشة LCD سلبية صغيرة ويحسب حجم الصورة بناء على البعد البؤري.",
      "يتضمن اثنين من ثنائي الفينيل متعدد الكلور مصممة لبناء الإلكترونيات ويوفر خيارات حالة مختلفة. بالإضافة إلى ذلك ، يتم توفير ملفات قابلة للتنزيل للمخططات والتخطيط وفاتورة المواد وملفات 3D STL."
    ],
    "commentSummary": [
      "يستكشف المقال مشروع جهاز عرض ساعة ليلية DIY باستخدام جهاز عرض ليزر MicroVision.",
      "يشارك المؤلف تجربته الشخصية مع جهاز العرض ويتناول توفر كابلات VGA له.",
      "تتطرق تعليقات المستخدمين إلى إيقاف أجهزة عرض MEMS الليزرية الصغيرة ، والمخاوف المتعلقة بجودة الصورة ، واقتراحات لخيارات بديلة لمعالجة مشكلات جودة النوم المحتملة."
    ],
    "points": 147,
    "commentCount": 40,
    "retryCount": 0,
    "time": 1703531529
  },
  {
    "id": 38763933,
    "title": "صعود الحوسبة بأسعار معقولة: من الحاسبات المركزية إلى الحواسيب الصغيرة",
    "originLink": "https://www.theregister.com/2023/12/25/the_war_of_the_workstations/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38763933",
    "commentBody": "",
    "originSummary": [
      "تتحدى هذه المقالة فكرة التقدم في الحوسبة وتسلط الضوء على تطوير نماذج أبسط وأرخص لأجهزة الكمبيوتر عبر التاريخ.",
      "يستكشف تطور أجهزة الكمبيوتر من أجهزة الكمبيوتر المركزية إلى الحواسيب الصغيرة في ثمانينيات القرن العشرين والمفاضلات المقدمة للبساطة والقدرة على تحمل التكاليف.",
      "يناقش تطوير وقدرات وتراجع أجهزة Newton و Lisp و Smalltalk ، بالإضافة إلى أنظمة التشغيل المختلفة. كما أنه يثير تساؤلات حول استخدام لغات برمجة متعددة ومزايا الأجهزة المخصصة.",
      "يذكر المقال أساليب تصميم مختلفة في تطوير البرمجيات وتراجع Lisp لصالح البرامج غير المكلفة والقابلة للتبديل.",
      "ويختتم بسرد العديد من البرامج والتقنيات والموضوعات المذكورة ، مثل Microsoft Office و Visual Studio والبرامج مفتوحة المصدر ولغات البرمجة والتعليم."
    ],
    "commentSummary": [
      "النص عبارة عن مجموعة من التعليقات والمناقشات والآراء حول مجموعة من موضوعات تكنولوجيا الحوسبة ولغة البرمجة.",
      "ويغطي استخدام التكنولوجيا منخفضة التكلفة ، والبرامج مفتوحة المصدر ، وتحديات مشاركة التعليمات البرمجية ، وهيمنة الكمبيوتر الشخصي ، وتاريخ لغة البرمجة ، ونماذج الحوسبة.",
      "تشمل التقنيات والمشاريع المحددة المذكورة آلات Lisp و Sk8 و Dylan ومشروع GNU."
    ],
    "points": 145,
    "commentCount": 78,
    "retryCount": 0,
    "time": 1703522316
  }
]
