[
  {
    "id": 37062422,
    "title": "எனக்கு 17 வயதாகிறது, சிபியூக்கள் நிரல்களை எவ்வாறு இயக்குகின்றன என்பது குறித்த இந்த வழிகாட்டியை எழுதினேன்",
    "originLink": "https://github.com/hackclub/putting-the-you-in-cpu",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37062422",
    "commentBody": "",
    "originSummary": [
      "\"சிபியுவில் 'நீங்கள்' வைப்பது\" என்பது ஒரு கணினி எவ்வாறு நிரல்களை இயக்குகிறது என்பதை ஆராயும் ஒரு தொழில்நுட்ப கட்டுரையாகும், இது சிஸ்கால்ஸ், நிரல் செயலாக்கம் மற்றும் பல்பணி போன்ற தலைப்புகளை உள்ளடக்கியது.",
      "@kognise மற்றும் @hackclub, ஆசிரியர்கள், ஆராய்ச்சி செய்து, தங்கள் கண்டுபிடிப்புகளை விரிவான முறையில் முன்வைத்தனர்.",
      "கட்டுரை அத்தியாயங்களாகப் பிரிக்கப்பட்டுள்ளது, அத்தியாயம் 3 ஏற்கனவே தலைப்பை அறிந்த வாசகர்களுக்கு பரிந்துரைக்கப்படுகிறது, இறுதியில் கணினிகள் எவ்வாறு செயல்படுகின்றன என்பது குறித்த உறுதியான புரிதலை வழங்குவதை நோக்கமாகக் கொண்டுள்ளன."
    ],
    "commentSummary": [
      "லெக்ஸி என்ற 17 வயது சிறுமி சிபியூக்கள் எவ்வாறு செயல்படுகின்றன என்பது குறித்த விரிவான வழிகாட்டியுடன் ஒரு வலைத்தளத்தை உருவாக்கினார்.",
      "வழிகாட்டி அதன் தெளிவு, துல்லியம் மற்றும் ஈர்க்கக்கூடிய தொனிக்காக நேர்மறையான கருத்துக்களைப் பெற்றுள்ளது.",
      "செயலிகள் மற்றும் இயக்க முறைமைகளைப் புரிந்துகொள்வதற்கு சிறந்த ஆன்லைன் வளங்களின் அவசியத்தை கட்டுரை எடுத்துக்காட்டுகிறது."
    ],
    "points": 1160,
    "commentCount": 283,
    "retryCount": 0,
    "time": 1691588039
  },
  {
    "id": 37066680,
    "title": "திறந்த மூல குரோம் நீட்டிப்பு டெவலப்பரின் சோதனைகள் (2021)",
    "originLink": "https://github.com/extesy/hoverzoom/discussions/670",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37066680",
    "commentBody": "",
    "originSummary": [
      "ஹோவர் ஜூம் + குரோம் நீட்டிப்பின் உரிமையாளர் நீட்டிப்பை பணமாக்க அல்லது வாங்க பல வணிக முன்மொழிவுகளைப் பெற்றுள்ளார்.",
      "நம்பிக்கை பற்றிய கவலைகள் மற்றும் நீட்டிப்பு டெவலப்பர்கள் மீதான அழுத்தம் ஆகியவை உரிமையாளர் இந்த சலுகைகளை நிராகரிக்க வழிவகுத்தன.",
      "கூட்டாண்மைகள் மூலம் வருவாயை அதிகரிப்பது, பயனர் தரவை பணமாக்குவது மற்றும் வணிக எஸ்.டி.கேக்களை ஒருங்கிணைப்பது ஆகியவை இந்த முன்மொழிவுகளில் அடங்கும்.",
      "உரிமையாளர் நிதி பாதுகாப்பிற்கு முன்னுரிமை அளிக்கிறார் மற்றும் இந்த சலுகைகளைத் தொடர வேண்டாம் என்று தேர்வு செய்துள்ளார்."
    ],
    "commentSummary": [
      "பயனர் தனியுரிமை, தரவு சேகரிப்பு மற்றும் இலக்கு விளம்பரப்படுத்தல் போன்ற சிக்கல்கள் உட்பட திறந்த மூல குரோம் நீட்டிப்புகளை பணமாக்குவதில் உள்ள சவால்கள் மற்றும் நெறிமுறை கவலைகளை பங்கேற்பாளர்கள் விவாதிக்கின்றனர்.",
      "உரையாடல்களைக் கேட்பதற்கும், ஆஃப்லைன் விளம்பரங்களைக் கண்காணிப்பதற்கும், விளம்பரங்கள் மூலம் உளவியல் கையாளுதலில் ஈடுபடுவதற்கும் நீட்டிப்புகளுக்கான சாத்தியம் விவாதிக்கப்படுகிறது.",
      "உலாவி நீட்டிப்புகளுக்கான சோதனை செயல்முறை மற்றும் பணமாக்கல், வெளிப்படைத்தன்மை மற்றும் தரவு மீதான பயனர் கட்டுப்பாடு ஆகியவற்றின் சாத்தியக்கூறு மற்றும் நெறிமுறைகள் விவாதிக்கப்படுகின்றன."
    ],
    "points": 931,
    "commentCount": 302,
    "retryCount": 0,
    "time": 1691605710
  },
  {
    "id": 37062650,
    "title": "ஊழியர்கள் அலுவலகத்திற்கு திரும்ப வேண்டுமா? பின்னர் ஒவ்வொருவருக்கும் ஒரு அலுவலகம் கொடுங்கள்",
    "originLink": "https://www.washingtonpost.com/opinions/2023/08/09/remote-work-offices-floorplan-privacy/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37062650",
    "commentBody": "",
    "originSummary": [
      "திறந்த அலுவலகங்கள் இரைச்சல் மற்றும் தனியுரிமை இல்லாமல் இருக்கலாம், இது உற்பத்தித்திறன் மற்றும் வேலை திருப்தி குறைவதற்கு வழிவகுக்கும்.",
      "தொழிலாளர்களுக்கு தனிப்பட்ட அலுவலகங்களை வழங்குவது அவர்கள் அலுவலகத்திற்குத் திரும்பவும் உற்பத்தித்திறனை மேம்படுத்தவும் ஊக்குவிக்கும்.",
      "தொலைதூர வேலை போக்குகளால் அலுவலக இடத்தின் செலவு குறைவதால் அலுவலகங்களை வழங்குவதற்கான செலவு ஈடுசெய்யப்படலாம்."
    ],
    "commentSummary": [
      "வீட்டிலிருந்து வேலை செய்யும்போது (டபிள்யூ.எஃப்.எச்) அல்லது அலுவலகத்திற்குத் திரும்பும்போது ஊழியர்களுக்கு வெவ்வேறு விருப்பங்கள் உள்ளன.",
      "சிலர் WFH இன் நெகிழ்வுத்தன்மையையும் செலவு சேமிப்பையும் அனுபவிக்கிறார்கள், மற்றவர்கள் அலுவலகத்தில் சமூக தொடர்பு மற்றும் காட்சிகளின் மாற்றத்தை மதிக்கிறார்கள்.",
      "நிர்வாகிகள் மற்றும் மற்ற பணியாளர்களுக்கு இடையிலான நெகிழ்வுத்தன்மையில் உள்ள வேறுபாடுகள் உட்பட வர்க்கம் மற்றும் படிநிலையின் பிரச்சினைகளையும் இந்த விவாதம் நிவர்த்தி செய்கிறது."
    ],
    "points": 735,
    "commentCount": 758,
    "retryCount": 0,
    "time": 1691589153
  },
  {
    "id": 37068464,
    "title": "சிஎன்இடி அதன் கூகிள் தேடல் தரவரிசையை மேம்படுத்த முயற்சிக்க பழைய கட்டுரைகளை நீக்குகிறது",
    "originLink": "https://www.theverge.com/2023/8/9/23826342/cnet-content-pruning-deleting-articles-google-seo",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37068464",
    "commentBody": "",
    "originSummary": [
      "கூகிள் தேடல் தரவரிசையை அதிகரிக்கும் முயற்சியின் ஒரு பகுதியாக சிஎன்இடி பழைய கட்டுரைகளை நீக்குகிறது.",
      "சிஎன்இடியின் தாய் நிறுவனமான ரெட் வென்ச்சர்ஸ், இதேபோன்ற எஸ்சிஓ மூலோபாயத்தை அதன் விற்பனை நிலையங்கள் முழுவதும் செயல்படுத்தியுள்ளது மற்றும் முன்பு கட்டுரைகளை உருவாக்க செயற்கை நுண்ணறிவு கருவிகளைப் பயன்படுத்தியுள்ளது.",
      "இந்த \"உள்ளடக்க கவாத்து\" செயல்முறை எதிர்காலத்தில் ஆண்டுக்கு ஒரு முறையாவது நடத்தப்படும்."
    ],
    "commentSummary": [
      "பழைய கட்டுரைகளை நீக்குவது மற்றும் கூகிளின் எஸ்சிஓ ஆலோசனையின் நம்பகத்தன்மை உள்ளிட்ட தேடல் முடிவுகளில் கூகிளின் தேடல் வழிமுறையின் தாக்கம் குறித்து விவாதங்கள் கவனம் செலுத்துகின்றன.",
      "கூகுளின் வருவாய் தாக்கங்கள் மற்றும் ஸ்பேம் தளங்களின் முன்னுரிமை ஆகியவையும் இந்த விவாதங்களில் பேசப்படுகின்றன.",
      "மற்ற தலைப்புகளில் பழைய கட்டுரைகளின் பார்வை, எஸ்சிஓவின் செயல்திறன் மற்றும் வரலாற்று உள்ளடக்கத்தைப் பாதுகாத்தல் ஆகியவை அடங்கும். இணைய காப்பகம், கட்டுரைகளில் தேதிகளை கையாளுதல், பட சுருக்க வழிமுறைகள் மற்றும் செயற்கை நுண்ணறிவு உருவாக்கிய உள்ளடக்கத்தின் பயன்பாடு தொடர்பான சிக்கல்கள் பற்றிய குறிப்புகளும் உள்ளன."
    ],
    "points": 560,
    "commentCount": 348,
    "retryCount": 0,
    "time": 1691615452
  },
  {
    "id": 37060654,
    "title": "உள்கட்டமைப்பு தணிக்கை முற்றிலும் திறந்த பாதுகாப்பு மூலம் முடிக்கப்பட்டது",
    "originLink": "https://mullvad.net/en/blog/2023/8/9/infrastructure-audit-completed-by-radically-open-security/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37060654",
    "commentBody": "",
    "originSummary": [
      "முல்வாட் வி.பி.என் அதன் வி.பி.என் உள்கட்டமைப்பில் கவனம் செலுத்தி, ராடிகல்லி ஓபன் செக்யூரிட்டியால் அதன் மூன்றாவது பாதுகாப்பு தணிக்கைக்கு உட்படுத்தப்பட்டுள்ளது.",
      "தணிக்கையில் வாடிக்கையாளர் தரவு கசிவு அல்லது உள்நுழைவு எதுவும் காணப்படவில்லை, ஆனால் சோதனை சேவையகங்களில் உற்பத்தி பயனர் போக்குவரத்தின் காட்சித்தன்மை போன்ற பல்வேறு சிக்கல்களை அடையாளம் கண்டது.",
      "அங்கீகரிக்கப்படாத உள்நுழைவுகளை தணிக்கை செய்வது மற்றும் எஸ்.எஸ்.எச் ஆதரவை அகற்றுவது போன்ற நடவடிக்கைகளை செயல்படுத்துவதன் மூலம் இந்த சிக்கல்களை தீர்க்க முல்வாட் வி.பி.என் திட்டமிட்டுள்ளது."
    ],
    "commentSummary": [
      "கட்டுரை மற்றும் கருத்துக்கள் முல்வாட் மற்றும் புரோட்டான்விபிஎன் உள்ளிட்ட VPN வழங்குநர்கள் மற்றும் அவர்களின் தனியுரிமை நடைமுறைகளில் கவனம் செலுத்துகின்றன, முல்வாட் அதன் போர்ட் ஃபார்வர்டிங் அம்சத்தை அகற்றுவதைப் பற்றிய ஒரு குறிப்பிட்ட குறிப்புடன்.",
      "விவாதிக்கப்பட்ட தலைப்புகளில் இணைய தனியுரிமை, அரசாங்க கண்காணிப்பு, ஆன்லைன் தணிக்கை, அமெரிக்க தடைகளின் தாக்கம் மற்றும் VPN களின் வரம்புகள் மற்றும் பாதிப்புகள் ஆகியவை அடங்கும்.",
      "தரவு சேகரிப்பு, VPN வழங்குநர்களின் நம்பகத்தன்மை மற்றும் ஆன்லைன் தனியுரிமையின் சிக்கல்கள் ஆகியவை எழுப்பப்பட்ட கவலைகளில் அடங்கும்."
    ],
    "points": 551,
    "commentCount": 264,
    "retryCount": 0,
    "time": 1691576326
  },
  {
    "id": 37063151,
    "title": "Arpchat – ஒரே ARP ஐப் பயன்படுத்தி ஒரே நெட்வொர்க்கில் உள்ள உங்கள் நண்பர்களுக்கு குறுஞ்செய்தி அனுப்பவும்",
    "originLink": "https://github.com/kognise/arpchat",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37063151",
    "commentBody": "",
    "originSummary": [
      "திட்டம் \"ஆர்ப்சாட்\" என்பது ஒரு திறந்த மூல அரட்டை பயன்பாடாகும், இது நெட்வொர்க் சாதனங்களுக்கு இடையில் செய்தி பரிமாற்றத்திற்கு முகவரி தீர்வு நெறிமுறையை (ஏஆர்பி) பயன்படுத்துகிறது.",
      "இது நீண்ட செய்திகளின் பரிமாற்றத்தை ஆதரிக்கிறது மற்றும் இருப்பு கண்டுபிடிப்பு மற்றும் இதயத் துடிப்பு அமைப்பு, அத்துடன் சுருக்க செயல்பாடு ஆகியவை அடங்கும்.",
      "இந்த திட்டம் ரஸ்டில் எழுதப்பட்டுள்ளது மற்றும் கிட்ஹப்பில் 1.8 ஆயிரம் நட்சத்திரங்களுடன் பிரபலமடைந்துள்ளது. விண்டோஸ் மற்றும் லினக்ஸிற்கான நிறுவல் வழிமுறைகள் கிடைக்கின்றன, மேலும் பயனர்கள் ஏதேனும் சிக்கல்களைப் புகாரளிக்க ஊக்குவிக்கப்படுகிறார்கள்."
    ],
    "commentSummary": [
      "ஆர்ப்சாட் என்பது ஒரு செய்தியிடல் பயன்பாடாகும், இது ஒரே நெட்வொர்க்கில் உள்ள பயனர்களிடையே தகவல்தொடர்புக்கு முகவரி தெளிவுத்திறன் நெறிமுறையை (ஏஆர்பி) பயன்படுத்துகிறது.",
      "ஆர்ப்சாட்டில் தாமதத்தை ஏற்படுத்தும் பிழை சரிசெய்யப்பட்டுள்ளது, ஆனால் புதுப்பிக்கப்பட்ட பதிப்பு இன்னும் வெளியிடப்படவில்லை.",
      "விடுபட்ட அனுமதிகள் காரணமாக லினக்ஸ் பயனர்கள் ஆர்ப்சாட்டில் சிக்கல்களை அனுபவிக்கலாம், ஆனால் தீர்வுகள் கிடைக்கின்றன.",
      "இந்த கட்டுரை நெட்வொர்க்கிங் ஏஆர்பியின் பயன்பாடு மற்றும் மேக் முகவரிகளை ஐபி முகவரிகளுடன் இணைப்பதில் அதன் பங்கை விளக்குகிறது.",
      "ஏஆர்பி பொதுவாக ஈத்தர்நெட் மற்றும் வைஃபை நெட்வொர்க்குகளில் பயன்படுத்தப்படுகிறது, மேலும் கட்டுரை இந்த நெட்வொர்க்குகளில் அதன் பயன்பாட்டை ஆராய்கிறது.",
      "வயர்லெஸ் திசைவிகள், சுவிட்சுகள் மற்றும் மோடம்களால் பயன்படுத்தப்படும் ஸ்போக்-அண்ட்-ஹப் மாதிரி விவாதிக்கப்படுகிறது, இது உள்ளூர் நெட்வொர்க்கில் கூட தரவு பொதுவாக திசைவி வழியாக எவ்வாறு செல்கிறது என்பதை விளக்குகிறது.",
      "நெட்வொர்க்கில் ஒளிபரப்பப்பட்ட செய்திகளை உருவாக்குவதற்கான ஏஆர்பியின் சாத்தியமான பாதிப்புகள் மற்றும் கையாளுதல் ஆய்வு செய்யப்படுகிறது.",
      "நெட்வொர்க் வரைபடங்களை உருவாக்குவதற்கான தொகுதி ஸ்கிரிப்ட்கள், இணையம் இல்லாத தகவல்தொடர்பு முறைகள் (பியர்-டு-பியர் அரட்டை, வயர்லெஸ் நெட்வொர்க்குகள்) மற்றும் இதேபோன்ற நெட்வொர்க்கிங் நெறிமுறைகளுடன் பயனர் அனுபவங்கள் போன்ற தலைப்புகளையும் கட்டுரை உள்ளடக்கியது.",
      "அரட்டை அமைப்புக்கு டி.என்.எஸ் பயன்படுத்துவதற்கான சாத்தியமும் விவாதிக்கப்படுகிறது."
    ],
    "points": 408,
    "commentCount": 60,
    "retryCount": 0,
    "time": 1691591096
  },
  {
    "id": 37063238,
    "title": "SQLedge: Replicate Postgres to SQLite on the Edge",
    "originLink": "https://github.com/zknill/sqledge",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37063238",
    "commentBody": "",
    "originSummary": [
      "SQLedge என்பது ஒரு திறந்த மூல கருவியாகும், இது போஸ்ட்கிரெஸ் தரவுத்தளத்திலிருந்து விளிம்பில் உள்ள உள்ளூர் SQLite தரவுத்தளத்திற்கு மாற்றங்களை மாற்ற போஸ்ட்கிரெஸ் தர்க்கரீதியான நகலெடுப்பைப் பயன்படுத்துகிறது.",
      "இது SQLite தரவுத்தளத்திலிருந்து படிக்கவும், அப்ஸ்ட்ரீம் போஸ்ட்கிரெஸ் சேவையகத்திற்கு எழுதவும் அனுமதிக்கிறது, தரவு நிலைத்தன்மையை உறுதி செய்கிறது.",
      "கருவியில் ஒரு SQL ஜெனரேட்டர், SQL பார்சர் மற்றும் போஸ்ட்கிரெஸ் கம்பி ப்ராக்ஸி ஆகியவை அடங்கும், மேலும் அனைத்து உள்ளமைவுகளும் சுற்றுச்சூழல் மாறிகளிலிருந்து பெறப்படுகின்றன."
    ],
    "commentSummary": [
      "SQLite தரவுத்தளங்கள் பரவலாகப் பயன்படுத்தப்படுகின்றன, மேலும் அவற்றின் செயல்பாட்டை மேம்படுத்த பல கருவிகள் மற்றும் திட்டங்கள் கிடைக்கின்றன.",
      "SQLedge மற்றும் SQLitePostgres போன்ற கருவிகள் தரவு நகலெடுத்தல், பதிப்பு கட்டுப்பாட்டு நன்மைகள், மல்டி-மாஸ்டர் நகலெடுத்தல் மற்றும் வினவல் பார்சிங் போன்ற அம்சங்களை வழங்குகின்றன.",
      "இந்த கருவிகள் SQLite தரவுத்தள கையாளுதல் தொடர்பான பல்வேறு செயல்பாடுகளுடன், உள்ளூர் தரவு கேச்சிங் மற்றும் வினவலுக்கான இலகுரக விருப்பங்களை வழங்குகின்றன. இருப்பினும், SQLite மற்றும் PostgreSQL போன்ற பிற தரவுத்தளங்களுக்கு இடையிலான SQL கிளைமொழிகளில் உள்ள வேறுபாடுகள் காரணமாக வரம்புகள் உள்ளன."
    ],
    "points": 325,
    "commentCount": 63,
    "retryCount": 0,
    "time": 1691591389
  },
  {
    "id": 37060974,
    "title": "செயற்கை நுண்ணறிவு பயம் ஒரு பயனுள்ள கருவியைக் கொன்றது",
    "originLink": "https://www.techdirt.com/2023/08/08/the-fear-of-ai-just-killed-a-very-useful-tool/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37060974",
    "commentBody": "",
    "originSummary": [
      "இந்த சுருக்கம் செயற்கை நுண்ணறிவு (ஏஐ), பதிப்புரிமை மீறல் மற்றும் படைப்புத் தொழில்களின் குறுக்கீடு பற்றி விவாதிக்கிறது.",
      "ஆசிரியர் கவலைகள் மற்றும் ஷாக்ஸ்பிர் கருவி மீதான விமர்சனம் காரணமாக புரோஸ்கிராஃப்ட் கருவி நிறுத்தப்பட்டதை இது எடுத்துக்காட்டுகிறது.",
      "செயற்கை நுண்ணறிவு உருவாக்கிய உள்ளடக்கத்தின் சட்டப்பூர்வத்தன்மை மற்றும் பயன்பாடு பற்றிய விவாதங்கள், பதிப்புரிமை மற்றும் நியாயமான பயன்பாடு குறித்த விவாதங்கள், கற்றல் மற்றும் படைப்பாற்றலில் செயற்கை நுண்ணறிவின் தாக்கம், தரவு தனியுரிமை பற்றிய கவலைகள் மற்றும் உள்ளடக்கம் கிடைப்பதில் ஸ்ட்ரீமிங் சேவைகளின் தாக்கம் ஆகியவை இந்த சுருக்கத்தில் அடங்கும்."
    ],
    "commentSummary": [
      "புத்தகங்களைப் பற்றிய புள்ளிவிவரங்கள் மற்றும் அளவீடுகளை உருவாக்கும் கருவியான prosecraft.io பயன்படுத்துவதைச் சுற்றி விவாதம் சுழல்கிறது.",
      "பதிப்புரிமை மீறல், நியாயமான பயன்பாடு மற்றும் ஆசிரியரின் ஒப்புதலின் அவசியம் ஆகியவை விவாத தலைப்புகளில் அடங்கும்.",
      "படைப்புத் தொழில்கள், வேலை இழப்பு, நெறிமுறைகள், நம்பகத்தன்மை மற்றும் மனித படைப்பாற்றல் ஆகியவற்றில் செயற்கை நுண்ணறிவு தொழில்நுட்பத்தின் தாக்கங்களும் விவாதிக்கப்படுகின்றன."
    ],
    "points": 287,
    "commentCount": 280,
    "retryCount": 0,
    "time": 1691579300
  },
  {
    "id": 37066522,
    "title": "எல்.எல்.எம் அனுமானத்திற்கு ஏ.எம்.டி ஜி.பி.யுக்களை போட்டியிடச் செய்தல்",
    "originLink": "https://blog.mlc.ai/2023/08/09/Making-AMD-GPUs-competitive-for-LLM-inference",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37066522",
    "commentBody": "",
    "originSummary": [
      "இந்த கட்டுரை எல்.எல்.எம் (பெரிய மொழி மாதிரி) அனுமானத்திற்கான ஏ.எம்.டி ஜி.பி.யுக்களின் செயல்திறனைப் பற்றி விவாதிக்கிறது, குறிப்பாக ரேடியான் ஆர்எக்ஸ் 7900 எக்ஸ்டிஎக்ஸ்.",
      "7900 எக்ஸ்டிஎக்ஸ் என்விடியாவின் ஜிபோர்ஸ் ஆர்டிஎக்ஸ் 4090 இன் 80% வேகத்திலும், லாமா 2-7 பி / 13 பி மாடல்களுக்கான ஆர்டிஎக்ஸ் 3090 டிஐயின் 94% வேகத்திலும் செயல்படுகிறது என்று ஆய்வு காட்டுகிறது.",
      "இயந்திர கற்றல் தொகுப்பு (எம்.எல்.சி) மற்றும் ஆர்.ஓ.சி.எம் ஸ்டாக் ஆகியவற்றின் பயன்பாடு ஏ.எம்.டி ஜி.பி.யுக்களில் செயல்திறனை மேம்படுத்துகிறது, இது வல்கன் மற்றும் வெப்ஜிபியுவுக்கு சாத்தியமான ஆதரவுடன். ஏ.எம்.டி ஜி.பி.யுக்கள் மற்றும் பிற தளங்களுக்கான எம்.எல்.சி தீர்வுகளை மேலும் மேம்படுத்தவும் உகந்ததாக்கவும் வேண்டியதன் அவசியத்தை இந்த ஆய்வு வலியுறுத்துகிறது."
    ],
    "commentSummary": [
      "மேம்படுத்தப்பட்ட மென்பொருள் அடுக்குகள் பெரிய மொழி மாதிரி அனுமானத்திற்கான ஏஎம்டி ஜிபியூக்களின் செயல்திறனை மேம்படுத்தலாம்.",
      "எம்.எல் தொகுப்பு நுட்பங்கள் மற்றும் டிவிஎம் ஒற்றுமை மென்பொருள் அடுக்கு ஆகியவை என்விடியா மற்றும் ஏஎம்டி ஜிபியு இரண்டிலும் உயர் செயல்திறனை அடைவதற்கான முறைகளாக விவாதிக்கப்படுகின்றன.",
      "இந்த கட்டுரை ஆர்ஓசிஎம் மற்றும் வல்கனுக்கு ஏஎம்டியின் ஆதரவை ஆராய்கிறது, ஆனால் ஆதரவின் ஆயுட்காலம் குறித்து கவலைகளை எழுப்புகிறது.",
      "செயற்கை நுண்ணறிவு, கடவுச்சொல் விரிசல், ஜிபியு சுரங்கம் மற்றும் விஎஃப்எக்ஸ் ரெண்டரிங் உள்ளிட்ட ஏஎம்டியின் ஆர்ஓசிஎம் தளத்தின் பல்வேறு பயன்பாட்டு வழக்குகள் விவாதிக்கப்படுகின்றன.",
      "இயந்திர கற்றல் வழிமுறைகளில் ரேம் திறன் மற்றும் அலைவரிசையின் வரம்புகளில் கவனம் செலுத்தி, ஏஎம்டி மற்றும் என்விடியா ஜிபியூக்களுக்கு இடையிலான ஒப்பீடு செய்யப்படுகிறது.",
      "மைக்ரோசாப்ட் தங்கள் திட்டத்தில் உள்ள சிக்கல் பிரச்சினைக்கு ஒரு தீர்வை முன்மொழிகிறது, அதே நேரத்தில் ஜியோஹோட்டின் பங்களிப்பு நேரடியாக ஆர்ஓசிஎம்-ஐ மேம்படுத்துவதில் கவனம் செலுத்துகிறது.",
      "ஒரு ஆர்எக்ஸ் 7900 க்கு பதிலாக பல ஆர்எக்ஸ் 6600 கார்டுகளைப் பயன்படுத்த கட்டுரை பரிந்துரைக்கிறது, ஆனால் என்விலிங்குக்கு சமமான ஏஎம்டி இல்லாமல் அவை எவ்வாறு இணைக்கப்படும் என்பது குறித்து கேள்விகள் உள்ளன.",
      "இந்த முன்னேற்றங்கள் ஏஎம்டியில் முதலீடு செய்வது குறித்த பரிசீலனைகளை எழுப்புகின்றன."
    ],
    "points": 286,
    "commentCount": 95,
    "retryCount": 0,
    "time": 1691604924
  },
  {
    "id": 37070398,
    "title": "கிக் தொழிலாளர்களை திடீர் 'செயலிழப்பிலிருந்து' பாதுகாப்பதில் அமெரிக்காவில் சியாட்டில் முதலிடம் வகிக்கிறது",
    "originLink": "https://kuow.org/stories/seattle-becomes-first-in-u-s-to-protect-gig-workers-from-sudden-deactivation",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37070398",
    "commentBody": "",
    "originSummary": [
      "இன்ஸ்டாகார்ட் மற்றும் தூர்டாஷ் போன்ற தளங்களில் கிக் தொழிலாளர்களை திடீரென செயலிழக்கச் செய்வதிலிருந்து பாதுகாக்க சியாட்டில் நகர கவுன்சில் ஒரு புதிய சட்டத்திற்கு ஒப்புதல் அளித்துள்ளது, இது அமெரிக்காவில் இதுபோன்ற முதல் சட்டத்தைக் குறிக்கிறது.",
      "இந்த அவசரச் சட்டம் செயலிழக்கச் செய்வதற்கான மிகவும் கடுமையான வழிகாட்டுதல்களை செயல்படுத்துகிறது மற்றும் நிறுவனங்கள் பணிநீக்கம் செய்யப்படுவதற்கு முன்பு 14 நாள் அறிவிப்பை வழங்க வேண்டும் என்று கட்டாயப்படுத்துகிறது.",
      "இந்த வளர்ச்சி சியாட்டிலில் ஒரு தொழிலாளர் சங்கத்தின் ஒரு பகுதியாக இல்லாத கிக் தொழிலாளர்களைப் பாதுகாப்பதை நோக்கமாகக் கொண்ட பெரிய முன்முயற்சிகளின் ஒரு பகுதியாகும், இதில் குறைந்தபட்ச ஊதியத்தை உயர்த்திய மற்றும் பயன்பாட்டு அடிப்படையிலான தொழிலாளர்களுக்கு நோய்வாய்ப்பட்ட நேரம் மற்றும் நன்மைகளை வழங்கிய சமீபத்திய சட்டங்களும் அடங்கும். இந்த சட்டத்தில் சியாட்டில் மேயர் புரூஸ் ஹாரெல் கையெழுத்திடுவார் என்று எதிர்பார்க்கப்படுகிறது."
    ],
    "commentSummary": [
      "கிக் வேலை குறித்த விவாதங்கள் தொழிலாளர் பாதுகாப்புகள், வகைப்பாடு, நன்மைகள், சவால்கள் மற்றும் டாக்ஸிகள் போன்ற பாரம்பரிய சேவைகளுடன் ஒப்பீடுகள் போன்ற பல்வேறு தலைப்புகளை உள்ளடக்கியது.",
      "விவாதத்தின் முக்கிய அம்சங்களில் கிக் வேலையின் நெகிழ்வுத்தன்மை, கிக் பொருளாதார தளங்களின் சுரண்டல் பற்றிய கவலைகள், ஒழுங்குமுறையின் தேவை மற்றும் வணிகங்கள் மற்றும் தொழிலாளர்கள் மீதான தாக்கம் ஆகியவை அடங்கும்.",
      "விவாதங்கள் கிக் வேலையைச் சுற்றியுள்ள சிக்கல்கள் மற்றும் மாறுபட்ட கருத்துக்கள் மற்றும் கிக் பொருளாதாரத்தில் தொழிலாளர் உரிமைகள் குறித்து நடந்து வரும் விவாதத்தை எடுத்துக்காட்டுகின்றன."
    ],
    "points": 275,
    "commentCount": 301,
    "retryCount": 0,
    "time": 1691628362
  }
]
