[
  {
    "id": 37062422,
    "title": "Je mi 17 rokov a napísal som túto príručku o tom, ako procesory spúšťajú programy",
    "originLink": "https://github.com/hackclub/putting-the-you-in-cpu",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37062422",
    "commentBody": "",
    "originSummary": [
      "\"Putting the 'You' in CPU\" je technický článok, ktorý sa zaoberá tým, ako počítač spúšťa programy, a zahŕňa témy ako syscall, vykonávanie programov a multitasking.",
      "Autori, @kognise a @hackclub, uskutočnili výskum a svoje zistenia prezentujú komplexným spôsobom.",
      "Článok je rozdelený do kapitol, pričom 3. kapitola je odporúčaná pre čitateľov, ktorí sa už s témou oboznámili, a jej cieľom je poskytnúť dôkladné pochopenie fungovania počítačov."
    ],
    "commentSummary": [
      "17-ročná Lexi vytvorila webovú stránku s komplexným sprievodcom o fungovaní procesorov.",
      "Príručka získala pozitívnu spätnú väzbu pre svoju zrozumiteľnosť, presnosť a pútavý tón.",
      "Článok zdôrazňuje potrebu lepších online zdrojov na pochopenie procesorov a operačných systémov."
    ],
    "points": 1160,
    "commentCount": 283,
    "retryCount": 0,
    "time": 1691588039
  },
  {
    "id": 37066680,
    "title": "Pokušenia vývojára rozšírení pre Chrome s otvoreným zdrojovým kódom (2021)",
    "originLink": "https://github.com/extesy/hoverzoom/discussions/670",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37066680",
    "commentBody": "",
    "originSummary": [
      "Vlastník rozšírenia Hover Zoom+ pre prehliadač Chrome dostal viacero obchodných ponúk na speňaženie alebo kúpu rozšírenia.",
      "Obavy o dôveru a tlak na vývojárov rozšírenia viedli majiteľa k odmietnutiu týchto ponúk.",
      "Návrhy zahŕňali zvýšenie príjmov prostredníctvom partnerstiev, monetizáciu údajov používateľov a integráciu obchodných SDK.",
      "Majiteľ uprednostňuje finančné zabezpečenie a rozhodol sa tieto ponuky nevyužiť."
    ],
    "commentSummary": [
      "Účastníci diskutujú o výzvach a etických otázkach týkajúcich sa monetizácie rozšírení prehliadača Chrome s otvoreným zdrojovým kódom vrátane otázok, ako je ochrana súkromia používateľov, zhromažďovanie údajov a cielená reklama.",
      "Diskutuje sa o možnostiach rozšírení počúvať konverzácie, sledovať offline reklamy a zapojiť sa do psychologickej manipulácie prostredníctvom reklamy.",
      "Diskutuje sa aj o procese overovania rozšírení prehliadača a o uskutočniteľnosti a etike monetizácie, transparentnosti a kontrole používateľov nad údajmi."
    ],
    "points": 931,
    "commentCount": 302,
    "retryCount": 0,
    "time": 1691605710
  },
  {
    "id": 37062650,
    "title": "Chcete, aby sa zamestnanci vrátili do kancelárie? Potom dajte každému z nich kanceláriu",
    "originLink": "https://www.washingtonpost.com/opinions/2023/08/09/remote-work-offices-floorplan-privacy/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37062650",
    "commentBody": "",
    "originSummary": [
      "Otvorené kancelárie môžu byť hlučné a bez súkromia, čo vedie k nižšej produktivite a spokojnosti s prácou.",
      "Poskytnutie individuálnych kancelárií pre pracovníkov ich môže podnietiť k návratu do kancelárie a zvýšiť produktivitu.",
      "Náklady na poskytovanie kancelárií môžu byť kompenzované klesajúcimi nákladmi na kancelárske priestory v dôsledku trendov práce na diaľku."
    ],
    "commentSummary": [
      "Zamestnanci majú rôzne preferencie, pokiaľ ide o prácu z domu (WFH) alebo návrat do kancelárie.",
      "Niektorí majú radi flexibilitu a úsporu nákladov, kým iní oceňujú sociálnu interakciu a zmenu prostredia v kancelárii.",
      "Diskusia sa zaoberá aj otázkami triedy a hierarchie vrátane rozdielov vo flexibilite medzi vedúcimi pracovníkmi a ostatnými zamestnancami."
    ],
    "points": 735,
    "commentCount": 758,
    "retryCount": 0,
    "time": 1691589153
  },
  {
    "id": 37068464,
    "title": "CNET odstraňuje staré články, aby sa pokúsil zlepšiť svoje umiestnenie vo vyhľadávaní Google",
    "originLink": "https://www.theverge.com/2023/8/9/23826342/cnet-content-pruning-deleting-articles-google-seo",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37068464",
    "commentBody": "",
    "originSummary": [
      "CNET odstraňuje staré články v rámci úsilia o zvýšenie svojej pozície vo vyhľadávaní Google.",
      "Materská spoločnosť CNETu, Red Ventures, zaviedla podobnú stratégiu SEO vo všetkých svojich prevádzkach a už predtým využívala nástroje AI na generovanie článkov.",
      "Tento proces \"orezávania obsahu\" sa bude v budúcnosti vykonávať aspoň raz ročne."
    ],
    "commentSummary": [
      "Diskusie sa zameriavajú na vplyv vyhľadávacieho algoritmu spoločnosti Google na výsledky vyhľadávania vrátane vymazávania starých článkov a dôveryhodnosti rád spoločnosti Google v oblasti SEO.",
      "V týchto diskusiách sa hovorí aj o dôsledkoch pre príjmy spoločnosti Google a o uprednostňovaní spamových stránok.",
      "Medzi ďalšie témy patrí viditeľnosť starších článkov, účinnosť SEO a zachovanie historického obsahu. Spomínajú sa aj otázky týkajúce sa internetového archívu, manipulácie s dátumami na článkoch, algoritmov kompresie obrázkov a používania obsahu generovaného umelou inteligenciou."
    ],
    "points": 560,
    "commentCount": 348,
    "retryCount": 0,
    "time": 1691615452
  },
  {
    "id": 37060654,
    "title": "Audit infraštruktúry dokončený spoločnosťou Radically Open Security",
    "originLink": "https://mullvad.net/en/blog/2023/8/9/infrastructure-audit-completed-by-radically-open-security/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37060654",
    "commentBody": "",
    "originSummary": [
      "Spoločnosť Mullvad VPN absolvovala tretí bezpečnostný audit od spoločnosti Radically Open Security, ktorý sa zameral na jej infraštruktúru VPN.",
      "Pri audite sa nezistil žiadny únik informácií ani zaznamenávanie údajov zákazníkov, ale zistili sa rôzne problémy, ako napríklad viditeľnosť prevádzky produkčných používateľov na testovacích serveroch.",
      "Spoločnosť Mullvad VPN plánuje tieto problémy riešiť zavedením opatrení, ako je auditovanie neoprávnených prihlásení a odstránenie podpory SSH."
    ],
    "commentSummary": [
      "Článok a komentáre sa zameriavajú na poskytovateľov VPN vrátane spoločností Mullvad a ProtonVPN a ich postupy ochrany osobných údajov, pričom sa konkrétne spomína, že spoločnosť Mullvad odstránila funkciu presmerovania portov.",
      "Medzi diskutované témy patrí ochrana súkromia na internete, vládny dohľad, cenzúra online, vplyv sankcií USA a obmedzenia a zraniteľnosti sietí VPN.",
      "Obavy sa týkajú zhromažďovania údajov, dôveryhodnosti poskytovateľov VPN a zložitosti ochrany súkromia online."
    ],
    "points": 551,
    "commentCount": 264,
    "retryCount": 0,
    "time": 1691576326
  },
  {
    "id": 37063151,
    "title": "Arpchat - posielajte textové správy priateľom v rovnakej sieti len pomocou ARP",
    "originLink": "https://github.com/kognise/arpchat",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37063151",
    "commentBody": "",
    "originSummary": [
      "Projekt \"arpchat\" je open-source chatovacia aplikácia, ktorá na prenos správ medzi sieťovými zariadeniami používa protokol ARP (Address Resolution Protocol).",
      "Podporuje prenos dlhých správ a obsahuje systém zisťovania prítomnosti a srdcového tepu, ako aj kompresné funkcie.",
      "Projekt je napísaný v jazyku Rust a na GitHube si získal popularitu s 1,8 tisíc hviezdičkami. Inštalačné pokyny sú k dispozícii pre systémy Windows a Linux a používatelia sú vyzývaní, aby nahlasovali akékoľvek problémy."
    ],
    "commentSummary": [
      "ArpChat je aplikácia na zasielanie správ, ktorá na komunikáciu medzi používateľmi v rovnakej sieti používa protokol ARP (Address Resolution Protocol).",
      "Chyba spôsobujúca oneskorenie v ArpChate bola opravená, ale aktualizovaná verzia zatiaľ nebola vydaná.",
      "Používatelia Linuxu môžu mať problémy s ArpChatom kvôli chýbajúcim oprávneniam, ale riešenia sú k dispozícii.",
      "Článok vysvetľuje užitočnosť ARP v sieťach a jeho úlohu pri pripájaní adries MAC k adresám IP.",
      "ARP sa bežne používa v sieťach Ethernet a WiFi a v článku sa skúma jeho použitie v týchto sieťach.",
      "Diskutuje sa o modeli spoke-and-hub, ktorý používajú bezdrôtové smerovače, prepínače a modemy, a vysvetľuje sa, ako údaje zvyčajne prechádzajú cez smerovač aj v miestnej sieti.",
      "Skúmajú sa potenciálne zraniteľnosti a manipulácia s ARP na vytváranie vysielaných správ v sieti.",
      "Článok sa zaoberá aj témami, ako sú dávkové skripty na vytváranie sieťových máp, metódy komunikácie bez internetu (peer-to-peer chat, bezdrôtové siete) a skúsenosti používateľov s podobnými sieťovými protokolmi.",
      "Diskutuje sa aj o možnosti využitia DNS pre chatovací systém."
    ],
    "points": 408,
    "commentCount": 60,
    "retryCount": 0,
    "time": 1691591096
  },
  {
    "id": 37063238,
    "title": "SQLedge: Replikovanie Postgresu do SQLite na hrane",
    "originLink": "https://github.com/zknill/sqledge",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37063238",
    "commentBody": "",
    "originSummary": [
      "SQLedge je open-source nástroj, ktorý využíva logickú replikáciu Postgresu na prenos zmien z databázy Postgres do lokálnej databázy SQLite na okraji.",
      "Umožňuje čítanie z databázy SQLite a zápis na server Postgres, čím sa zabezpečí konzistentnosť údajov.",
      "Nástroj obsahuje generátor SQL, analyzátor SQL a sprostredkovateľa Postgres a všetky konfigurácie sa získavajú z premenných prostredia."
    ],
    "commentSummary": [
      "Databázy SQLite sú široko používané a existuje niekoľko nástrojov a projektov na zlepšenie ich funkčnosti.",
      "Nástroje ako SQLedge a SQLitePostgres ponúkajú funkcie, ako je replikácia údajov, výhody kontroly verzií, replikácia viacerých správcov a rozbor dotazov.",
      "Tieto nástroje poskytujú nenáročné možnosti na lokálne ukladanie dát do vyrovnávacej pamäte a vyhľadávanie s rôznymi funkciami súvisiacimi so spracovaním databázy SQLite. Existujú však obmedzenia vyplývajúce z rozdielov v dialektoch jazyka SQL medzi databázou SQLite a inými databázami, ako je PostgreSQL."
    ],
    "points": 325,
    "commentCount": 63,
    "retryCount": 0,
    "time": 1691591389
  },
  {
    "id": 37060974,
    "title": "Strach z AI práve zabil užitočný nástroj",
    "originLink": "https://www.techdirt.com/2023/08/08/the-fear-of-ai-just-killed-a-very-useful-tool/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37060974",
    "commentBody": "",
    "originSummary": [
      "Zhrnutie sa zaoberá priesečníkom umelej inteligencie (AI), porušovania autorských práv a kreatívneho priemyslu.",
      "Upozorňuje na vypnutie nástroja Prosecraft z dôvodu obáv autora a kritiky nástroja Shaxpir.",
      "Zhrnutie zahŕňa aj diskusie o zákonnosti a používaní obsahu vytvoreného umelou inteligenciou, diskusie o autorských právach a spravodlivom používaní, vplyve umelej inteligencie na učenie a tvorivosť, obavy o ochranu osobných údajov a vplyv streamovacích služieb na dostupnosť obsahu."
    ],
    "commentSummary": [
      "Diskusia sa točí okolo používania nástroja prosecraft.io, ktorý generuje štatistiky a metriky o knihách.",
      "Témami diskusie sú porušenie autorských práv, spravodlivé použitie a potreba súhlasu autora.",
      "Diskutuje sa aj o dôsledkoch technológie umelej inteligencie na kreatívny priemysel, stratu pracovných miest, etiku, autenticitu a ľudskú tvorivosť."
    ],
    "points": 287,
    "commentCount": 280,
    "retryCount": 0,
    "time": 1691579300
  },
  {
    "id": 37066522,
    "title": "Konkurencieschopnosť grafických procesorov AMD pri odvodzovaní LLM",
    "originLink": "https://blog.mlc.ai/2023/08/09/Making-AMD-GPUs-competitive-for-LLM-inference",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37066522",
    "commentBody": "",
    "originSummary": [
      "Článok sa zaoberá výkonom grafických procesorov AMD, konkrétne Radeon RX 7900 XTX, pri odvodzovaní LLM (Large Language Model).",
      "Štúdia ukazuje, že 7900 XTX dosahuje 80 % rýchlosti grafickej karty NVIDIA GeForce RTX 4090 a 94 % rýchlosti RTX 3090 Ti pre modely Llama2-7B/13B.",
      "Použitie kompilácie strojového učenia (MLC) a zásobníka ROCm optimalizuje výkon na grafických procesoroch AMD s potenciálnou podporou Vulkan a WebGPU. Štúdia zdôrazňuje potrebu ďalšieho vývoja a optimalizácie riešení MLC pre grafické procesory AMD a iné platformy."
    ],
    "commentSummary": [
      "Optimalizované softvérové balíky môžu zvýšiť výkon grafických procesorov AMD pri odvodzovaní veľkých jazykových modelov.",
      "Ako metódy na dosiahnutie vysokého výkonu na grafických procesoroch NVIDIA aj AMD sa rozoberajú techniky kompilácie ML a softvérový zásobník TVM Unity.",
      "V článku sa skúma podpora ROCm a Vulkan od spoločnosti AMD, ale vznikajú obavy, či bude podpora trvať dlho.",
      "Diskutuje sa o rôznych prípadoch použitia platformy ROCm spoločnosti AMD vrátane umelej inteligencie, lámania hesiel, ťažby na GPU a vykresľovania VFX.",
      "Porovnávajú sa grafické procesory AMD a Nvidia so zameraním na obmedzenia kapacity pamäte RAM a šírky pásma v algoritmoch strojového učenia.",
      "Spoločnosť Microsoft vo svojom projekte navrhuje riešenie problému úzkych miest, zatiaľ čo príspevok spoločnosti Geohot sa zameriava priamo na zlepšenie ROCm.",
      "V článku sa navrhuje použitie viacerých kariet RX 6600 namiesto jednej RX 7900, ale otázkou zostáva, ako by boli prepojené bez ekvivalentu NVLink od spoločnosti AMD.",
      "Tento vývoj vyvoláva úvahy o investovaní do spoločnosti AMD."
    ],
    "points": 286,
    "commentCount": 95,
    "retryCount": 0,
    "time": 1691604924
  },
  {
    "id": 37070398,
    "title": "Seattle sa stal prvým mestom v USA, ktoré chráni zamestnancov pred náhlou deaktiváciou",
    "originLink": "https://kuow.org/stories/seattle-becomes-first-in-u-s-to-protect-gig-workers-from-sudden-deactivation",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37070398",
    "commentBody": "",
    "originSummary": [
      "Mestská rada v Seattli schválila nový zákon na ochranu gigových pracovníkov pred náhlou deaktiváciou na platformách, ako sú Instacart a DoorDash, čo predstavuje prvý takýto právny predpis v Spojených štátoch.",
      "Vyhláška zavádza prísnejšie usmernenia pre deaktiváciu a nariaďuje, aby spoločnosti pred ukončením poskytli 14-dňovú výpovednú lehotu.",
      "Tento vývoj je súčasťou väčších iniciatív v Seattli zameraných na ochranu gigových pracovníkov, ktorí nie sú súčasťou odborov, vrátane nedávnych zákonov, ktoré zvýšili minimálnu mzdu a poskytli pracovníkom pracujúcim s aplikáciami čas na nemocenské dávky a benefity. Očakáva sa, že zákon podpíše starosta Seattlu Bruce Harrell."
    ],
    "commentSummary": [
      "Diskusie o práci na dohodu sa týkajú rôznych tém, ako je ochrana pracovníkov, klasifikácia, výhody, výzvy a porovnanie s tradičnými službami, ako sú taxíky.",
      "Kľúčovými bodmi diskusie sú flexibilita gig práce, obavy z vykorisťovania zo strany platforiem gig ekonomiky, potreba regulácie a vplyv na podniky a pracovníkov.",
      "Diskusie poukazujú na zložitosť a rozdielne názory na prácu na dohodu a prebiehajúcu diskusiu o právach pracovníkov v ekonomike na dohodu."
    ],
    "points": 275,
    "commentCount": 301,
    "retryCount": 0,
    "time": 1691628362
  }
]
