[
  {
    "id": 37062422,
    "title": "मैं 17 साल का हूं और सीपीयू प्रोग्राम कैसे चलाते हैं, इस पर यह गाइड लिखा है।",
    "originLink": "https://github.com/hackclub/putting-the-you-in-cpu",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37062422",
    "commentBody": "",
    "originSummary": [
      "\"सीपीयू में 'आप' डालना\" एक तकनीकी लेख है जो इस बात की पड़ताल करता है कि कंप्यूटर प्रोग्राम कैसे चलाता है, जिसमें सिस्कॉल, प्रोग्राम निष्पादन और मल्टीटास्किंग जैसे विषय शामिल हैं।",
      "लेखकों, @kognise और @hackclub, ने अनुसंधान किया और अपने निष्कर्षों को व्यापक तरीके से प्रस्तुत किया।",
      "लेख को अध्यायों में विभाजित किया गया है, जिसमें अध्याय 3 को पहले से ही विषय से परिचित पाठकों के लिए अनुशंसित किया गया है, अंततः कंप्यूटर कैसे कार्य करते हैं, इसकी ठोस समझ प्रदान करने का लक्ष्य है।"
    ],
    "commentSummary": [
      "लेक्सी नाम के एक 17 वर्षीय ने सीपीयू कैसे काम करते हैं, इस पर एक व्यापक गाइड के साथ एक वेबसाइट बनाई।",
      "गाइड को इसकी स्पष्टता, सटीकता और आकर्षक टोन के लिए सकारात्मक प्रतिक्रिया मिली है।",
      "लेख प्रोसेसर और ऑपरेटिंग सिस्टम को समझने के लिए बेहतर ऑनलाइन संसाधनों की आवश्यकता पर प्रकाश डालता है।"
    ],
    "points": 1160,
    "commentCount": 283,
    "retryCount": 0,
    "time": 1691588039
  },
  {
    "id": 37066680,
    "title": "ओपन-सोर्स क्रोम एक्सटेंशन डेवलपर के प्रलोभन (2021)",
    "originLink": "https://github.com/extesy/hoverzoom/discussions/670",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37066680",
    "commentBody": "",
    "originSummary": [
      "होवर ज़ूम + क्रोम एक्सटेंशन के मालिक को एक्सटेंशन को मुद्रीकृत करने या खरीदने के लिए कई व्यावसायिक प्रस्ताव प्राप्त हुए हैं।",
      "एक्सटेंशन डेवलपर्स पर विश्वास और दबाव के बारे में चिंताओं ने मालिक को इन प्रस्तावों को अस्वीकार करने के लिए प्रेरित किया है।",
      "प्रस्तावों में साझेदारी के माध्यम से राजस्व बढ़ाना, उपयोगकर्ता डेटा का मुद्रीकरण करना और वाणिज्य एसडीके को एकीकृत करना शामिल था।",
      "मालिक वित्तीय सुरक्षा को प्राथमिकता देता है और इन प्रस्तावों को आगे नहीं बढ़ाने का विकल्प चुना है।"
    ],
    "commentSummary": [
      "प्रतिभागी ओपन-सोर्स क्रोम एक्सटेंशन के मुद्रीकरण की चुनौतियों और नैतिक चिंताओं पर चर्चा करते हैं, जिसमें उपयोगकर्ता की गोपनीयता, डेटा संग्रह और लक्षित विज्ञापन जैसे मुद्दे शामिल हैं।",
      "एक्सटेंशन के लिए वार्तालाप सुनने, ऑफ़लाइन विज्ञापनों को ट्रैक करने और विज्ञापन के माध्यम से मनोवैज्ञानिक हेरफेर में संलग्न होने की क्षमता पर बहस की जाती है।",
      "ब्राउज़र एक्सटेंशन के लिए जांच प्रक्रिया और डेटा पर मुद्रीकरण, पारदर्शिता और उपयोगकर्ता नियंत्रण की व्यवहार्यता और नैतिकता पर भी चर्चा की जाती है।"
    ],
    "points": 931,
    "commentCount": 302,
    "retryCount": 0,
    "time": 1691605710
  },
  {
    "id": 37062650,
    "title": "कर्मचारियों को कार्यालय में वापस जाना चाहते हैं? फिर हर एक को एक कार्यालय दें।",
    "originLink": "https://www.washingtonpost.com/opinions/2023/08/09/remote-work-offices-floorplan-privacy/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37062650",
    "commentBody": "",
    "originSummary": [
      "खुले कार्यालय शोर और गोपनीयता की कमी हो सकती है, जिससे उत्पादकता और नौकरी की संतुष्टि कम हो जाती है।",
      "श्रमिकों के लिए अलग-अलग कार्यालय प्रदान करने से उन्हें कार्यालय लौटने और उत्पादकता में सुधार करने के लिए प्रोत्साहित किया जा सकता है।",
      "दूरस्थ कार्य प्रवृत्तियों के कारण कार्यालय स्थान की घटती लागत से कार्यालय प्रदान करने की लागत की भरपाई की जा सकती है।"
    ],
    "commentSummary": [
      "जब घर से काम करने (डब्ल्यूएफएच) या कार्यालय लौटने की बात आती है तो कर्मचारियों की अलग-अलग प्राथमिकताएं होती हैं।",
      "कुछ डब्ल्यूएफएच के लचीलेपन और लागत बचत का आनंद लेते हैं, जबकि अन्य सामाजिक संपर्क और कार्यालय में दृश्यों के परिवर्तन को महत्व देते हैं।",
      "चर्चा वर्ग और पदानुक्रम के मुद्दों को भी संबोधित करती है, जिसमें अधिकारियों और बाकी कर्मचारियों के बीच लचीलेपन में अंतर शामिल है।"
    ],
    "points": 735,
    "commentCount": 758,
    "retryCount": 0,
    "time": 1691589153
  },
  {
    "id": 37068464,
    "title": "CNET अपनी Google खोज रैंकिंग में सुधार करने की कोशिश करने के लिए पुराने लेखों को हटा रहा है",
    "originLink": "https://www.theverge.com/2023/8/9/23826342/cnet-content-pruning-deleting-articles-google-seo",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37068464",
    "commentBody": "",
    "originSummary": [
      "सीएनईटी अपनी गूगल सर्च रैंकिंग को बढ़ावा देने के प्रयास के तहत पुराने लेखों को हटा रहा है।",
      "सीएनईटी की मूल कंपनी, रेड वेंचर्स ने अपने आउटलेट्स में एक समान एसईओ रणनीति लागू की है और पहले लेख उत्पन्न करने के लिए एआई टूल का उपयोग किया है।",
      "यह \"सामग्री छंटाई\" प्रक्रिया भविष्य में वर्ष में कम से कम एक बार आयोजित की जाएगी।"
    ],
    "commentSummary": [
      "चर्चा खोज परिणामों पर Google के खोज एल्गोरिथ्म के प्रभाव पर केंद्रित है, जिसमें पुराने लेखों को हटाना और Google की एसईओ सलाह की विश्वसनीयता शामिल है।",
      "इन चर्चाओं में गूगल के लिए राजस्व निहितार्थ और स्पैम साइटों की प्राथमिकता के बारे में भी बात की जा रही है।",
      "अन्य विषयों में पुराने लेखों की दृश्यता, एसईओ की प्रभावशीलता और ऐतिहासिक सामग्री का संरक्षण शामिल है। इंटरनेट संग्रह से संबंधित मुद्दों, लेखों पर तिथियों के हेरफेर, छवि संपीड़न एल्गोरिदम और एआई-जनित सामग्री के उपयोग का भी उल्लेख है।"
    ],
    "points": 560,
    "commentCount": 348,
    "retryCount": 0,
    "time": 1691615452
  },
  {
    "id": 37060654,
    "title": "मौलिक रूप से खुली सुरक्षा द्वारा पूरा किया गया बुनियादी ढांचा ऑडिट",
    "originLink": "https://mullvad.net/en/blog/2023/8/9/infrastructure-audit-completed-by-radically-open-security/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37060654",
    "commentBody": "",
    "originSummary": [
      "मुलवाड वीपीएन ने अपने वीपीएन बुनियादी ढांचे पर ध्यान केंद्रित करते हुए रैडिकलली ओपन सिक्योरिटी द्वारा अपना तीसरा सुरक्षा ऑडिट किया है.",
      "ऑडिट में कोई सूचना रिसाव या ग्राहक डेटा का लॉगिंग नहीं पाया गया, लेकिन परीक्षण सर्वर पर उत्पादन उपयोगकर्ता ट्रैफ़िक की दृश्यता जैसे विभिन्न मुद्दों की पहचान की गई।",
      "मुलवाड वीपीएन अनधिकृत लॉगिन का ऑडिट करने और एसएसएच समर्थन को हटाने जैसे उपायों को लागू करके इन मुद्दों को संबोधित करने की योजना बना रहा है।"
    ],
    "commentSummary": [
      "लेख और टिप्पणियां वीपीएन प्रदाताओं पर ध्यान केंद्रित करती हैं, जिनमें मुलवाड और प्रोटॉनवीपीएन शामिल हैं, और उनकी गोपनीयता प्रथाएं, जिसमें मुलवाड द्वारा अपनी पोर्ट अग्रेषण सुविधा को हटाने का विशिष्ट उल्लेख है।",
      "चर्चा किए गए विषयों में इंटरनेट गोपनीयता, सरकारी निगरानी, ऑनलाइन सेंसरशिप, अमेरिकी प्रतिबंधों का प्रभाव और वीपीएन की सीमाएं और कमजोरियां शामिल हैं।",
      "उठाई गई चिंताओं में डेटा संग्रह, वीपीएन प्रदाताओं की विश्वसनीयता और ऑनलाइन गोपनीयता की जटिलताएं शामिल हैं।"
    ],
    "points": 551,
    "commentCount": 264,
    "retryCount": 0,
    "time": 1691576326
  },
  {
    "id": 37063151,
    "title": "Arpchat - सिर्फ ARP का उपयोग करके एक ही नेटवर्क पर अपने दोस्तों को पाठ करें",
    "originLink": "https://github.com/kognise/arpchat",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37063151",
    "commentBody": "",
    "originSummary": [
      "परियोजना \"arpchat\" एक ओपन-सोर्स चैट एप्लिकेशन है जो नेटवर्क उपकरणों के बीच संदेश प्रसारण के लिए पता संकल्प प्रोटोकॉल (एआरपी) का उपयोग करता है।",
      "यह लंबे संदेशों के प्रसारण का समर्थन करता है और इसमें उपस्थिति खोज और दिल की धड़कन प्रणाली, साथ ही संपीड़न कार्यक्षमता शामिल है।",
      "परियोजना रस्ट में लिखी गई है और 1.8 हजार सितारों के साथ गिटहब पर लोकप्रियता हासिल की है। स्थापना निर्देश विंडोज और लिनक्स के लिए उपलब्ध हैं, और उपयोगकर्ताओं को किसी भी समस्या की रिपोर्ट करने के लिए प्रोत्साहित किया जाता है।"
    ],
    "commentSummary": [
      "ArpChat एक मैसेजिंग ऐप है जो एक ही नेटवर्क पर उपयोगकर्ताओं के बीच संचार के लिए एड्रेस रिज़ॉल्यूशन प्रोटोकॉल (एआरपी) का उपयोग करता है।",
      "ArpChat में विलंबता पैदा करने वाले एक बग को ठीक कर दिया गया है, लेकिन एक अद्यतन संस्करण अभी तक जारी नहीं किया गया है।",
      "लिनक्स उपयोगकर्ता ओं को अनुपलब्ध अनुमतियों के कारण ArpChat के साथ समस्याओं का अनुभव हो सकता है, लेकिन समाधान उपलब्ध हैं।",
      "लेख नेटवर्किंग में एआरपी की उपयोगिता और मैक पते को आईपी पते से जोड़ने में इसकी भूमिका की व्याख्या करता है।",
      "एआरपी आमतौर पर ईथरनेट और वाईफाई नेटवर्क में उपयोग किया जाता है, और लेख इन नेटवर्क में इसके उपयोग की पड़ताल करता है।",
      "वायरलेस राउटर, स्विच और मॉडेम द्वारा उपयोग किए जाने वाले स्पोक-एंड-हब मॉडल पर चर्चा की जाती है, यह बताते हुए कि डेटा आमतौर पर स्थानीय नेटवर्क पर भी राउटर के माध्यम से कैसे जाता है।",
      "नेटवर्क पर प्रसारित संदेश बनाने के लिए एआरपी की संभावित कमजोरियों और हेरफेर की जांच की जाती है।",
      "लेख में नेटवर्क मानचित्र बनाने के लिए बैच स्क्रिप्ट, इंटरनेट के बिना संचार विधियों (पीयर-टू-पीयर चैट, वायरलेस नेटवर्क), और समान नेटवर्किंग प्रोटोकॉल के साथ उपयोगकर्ता अनुभव जैसे विषयों को भी शामिल किया गया है।",
      "चैट सिस्टम के लिए डीएनएस का उपयोग करने की संभावना पर भी चर्चा की गई है।"
    ],
    "points": 408,
    "commentCount": 60,
    "retryCount": 0,
    "time": 1691591096
  },
  {
    "id": 37063238,
    "title": "SQLedge: किनारे पर SQLite के लिए Postgres दोहराएँ",
    "originLink": "https://github.com/zknill/sqledge",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37063238",
    "commentBody": "",
    "originSummary": [
      "SQLedge एक ओपन-सोर्स टूल है जो पोस्टग्रेस डेटाबेस से किनारे पर स्थानीय SQLite डेटाबेस में परिवर्तन ों को स्थानांतरित करने के लिए Postgres तार्किक प्रतिकृति का उपयोग करता है।",
      "यह SQLite डेटाबेस से पढ़ने और अपस्ट्रीम Postgres सर्वर पर लिखने की अनुमति देता है, जिससे डेटा स्थिरता सुनिश्चित होती है।",
      "उपकरण में एक एसक्यूएल जनरेटर, एसक्यूएल पार्सर और एक पोस्टग्रेस वायर प्रॉक्सी शामिल हैं, और सभी कॉन्फ़िगरेशन पर्यावरण चर से प्राप्त होते हैं।"
    ],
    "commentSummary": [
      "SQLite डेटाबेस का व्यापक रूप से उपयोग किया जाता है, और उनकी कार्यक्षमता को बढ़ाने के लिए कई उपकरण और परियोजनाएं उपलब्ध हैं।",
      "SQLedge और SQLitePostgres जैसे उपकरण डेटा प्रतिकृति, संस्करण नियंत्रण लाभ, मल्टी-मास्टर प्रतिकृति और क्वेरी पार्सिंग जैसी सुविधाएँ प्रदान करते हैं।",
      "ये उपकरण स्थानीय डेटा कैशिंग और क्वेरी के लिए हल्के विकल्प प्रदान करते हैं, जिसमें SQLite डेटाबेस हैंडलिंग से संबंधित विभिन्न कार्यक्षमताएं हैं। हालांकि, SQLite और PostgreSQL जैसे अन्य डेटाबेस के बीच SQL बोलियों में अंतर के कारण सीमाएं मौजूद हैं।"
    ],
    "points": 325,
    "commentCount": 63,
    "retryCount": 0,
    "time": 1691591389
  },
  {
    "id": 37060974,
    "title": "एआई के डर ने सिर्फ एक उपयोगी उपकरण को मार डाला",
    "originLink": "https://www.techdirt.com/2023/08/08/the-fear-of-ai-just-killed-a-very-useful-tool/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37060974",
    "commentBody": "",
    "originSummary": [
      "सारांश कृत्रिम बुद्धिमत्ता (एआई), कॉपीराइट उल्लंघन और रचनात्मक उद्योगों के चौराहे पर चर्चा करता है।",
      "यह लेखक की चिंताओं और उपकरण शक्सपीर की आलोचना के कारण टूल प्रोसेक्राफ्ट के बंद होने पर प्रकाश डालता है।",
      "सारांश में एआई-जनित सामग्री की वैधता और उपयोग, कॉपीराइट और उचित उपयोग पर चर्चा, सीखने और रचनात्मकता पर एआई के प्रभाव, डेटा गोपनीयता के बारे में चिंताएं और सामग्री उपलब्धता पर स्ट्रीमिंग सेवाओं के प्रभाव के बारे में बहस भी शामिल है।"
    ],
    "commentSummary": [
      "बहस prosecraft.io के उपयोग के आसपास घूमती है, एक उपकरण जो पुस्तकों के बारे में आंकड़े और मैट्रिक्स उत्पन्न करता है।",
      "चर्चा के विषयों में कॉपीराइट उल्लंघन, उचित उपयोग और लेखक की सहमति की आवश्यकता शामिल है।",
      "रचनात्मक उद्योगों, नौकरी के नुकसान, नैतिकता, प्रामाणिकता और मानव रचनात्मकता पर एआई प्रौद्योगिकी के निहितार्थ पर भी चर्चा की जाती है।"
    ],
    "points": 287,
    "commentCount": 280,
    "retryCount": 0,
    "time": 1691579300
  },
  {
    "id": 37066522,
    "title": "एलएलएम अनुमान के लिए एएमडी जीपीयू को प्रतिस्पर्धी बनाना",
    "originLink": "https://blog.mlc.ai/2023/08/09/Making-AMD-GPUs-competitive-for-LLM-inference",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37066522",
    "commentBody": "",
    "originSummary": [
      "लेख एलएलएम (बड़ी भाषा मॉडल) अनुमान के लिए एएमडी जीपीयू, विशेष रूप से रेडॉन आरएक्स 7900 एक्सटीएक्स के प्रदर्शन पर चर्चा करता है।",
      "अध्ययन से पता चलता है कि 7900 एक्सटीएक्स एनवीडिया के जीफोर्स आरटीएक्स 4090 की गति का 80% और लामा 2-7 बी / 13 बी मॉडल के लिए आरटीएक्स 3090 टीआई की गति का 94% प्रदर्शन करता है।",
      "मशीन लर्निंग संकलन (एमएलसी) और आरओसीएम स्टैक का उपयोग वल्कन और वेबजीपीयू के लिए संभावित समर्थन के साथ एएमडी जीपीयू पर प्रदर्शन का अनुकूलन करता है। अध्ययन में एएमडी जीपीयू और अन्य प्लेटफार्मों के लिए एमएलसी समाधानों के आगे विकास और अनुकूलन की आवश्यकता पर जोर दिया गया है।"
    ],
    "commentSummary": [
      "अनुकूलित सॉफ्टवेयर स्टैक बड़े भाषा मॉडल अनुमान के लिए एएमडी जीपीयू के प्रदर्शन में सुधार कर सकते हैं।",
      "एमएल संकलन तकनीक और टीवीएम यूनिटी सॉफ्टवेयर स्टैक पर एनवीडिया और एएमडी जीपीयू दोनों पर उच्च प्रदर्शन प्राप्त करने के तरीकों के रूप में चर्चा की जाती है।",
      "लेख आरओसीएम और वल्कन के लिए एएमडी के समर्थन की पड़ताल करता है, लेकिन समर्थन की दीर्घायु के बारे में चिंताओं को उठाता है।",
      "एआई, पासवर्ड क्रैकिंग, जीपीयू माइनिंग और वीएफएक्स रेंडरिंग सहित एएमडी के आरओसीएम प्लेटफॉर्म के विभिन्न उपयोग के मामलों पर चर्चा की गई है।",
      "मशीन लर्निंग एल्गोरिदम में रैम क्षमता और बैंडविड्थ की सीमाओं पर ध्यान देने के साथ एएमडी और एनवीडिया जीपीयू के बीच तुलना की जाती है।",
      "माइक्रोसॉफ्ट अपनी परियोजना में अड़चन के मुद्दे के समाधान का प्रस्ताव कर रहा है, जबकि जियोहॉट का योगदान सीधे आरओसीएम में सुधार करने पर केंद्रित है।",
      "लेख एक आरएक्स 7900 के बजाय कई आरएक्स 6600 कार्ड का उपयोग करने का सुझाव देता है, लेकिन सवाल बने हुए हैं कि उन्हें एनवीलिंक के एएमडी समकक्ष के बिना कैसे जोड़ा जाएगा।",
      "ये घटनाक्रम एएमडी में निवेश के बारे में विचार उठाते हैं।"
    ],
    "points": 286,
    "commentCount": 95,
    "retryCount": 0,
    "time": 1691604924
  },
  {
    "id": 37070398,
    "title": "सिएटल अमेरिका में गिग श्रमिकों को अचानक 'निष्क्रिय' होने से बचाने वाला पहला बन गया",
    "originLink": "https://kuow.org/stories/seattle-becomes-first-in-u-s-to-protect-gig-workers-from-sudden-deactivation",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37070398",
    "commentBody": "",
    "originSummary": [
      "सिएटल सिटी काउंसिल ने इंस्टाकार्ट और डोरडैश जैसे प्लेटफार्मों पर गिग श्रमिकों को अचानक निष्क्रिय होने से बचाने के लिए एक नए कानून को मंजूरी दे दी है, जो संयुक्त राज्य अमेरिका में इस तरह का पहला कानून है।",
      "अध्यादेश निष्क्रिय करने के लिए अधिक कड़े दिशानिर्देशों को लागू करता है और कंपनियों को समाप्ति से पहले 14 दिन का नोटिस देना अनिवार्य करता है।",
      "यह विकास सिएटल में बड़ी पहल का एक हिस्सा है जिसका उद्देश्य गिग श्रमिकों की रक्षा करना है जो श्रम संघ का हिस्सा नहीं हैं, जिसमें हाल के कानून शामिल हैं जिन्होंने न्यूनतम मजदूरी में वृद्धि की और ऐप-आधारित श्रमिकों को बीमार समय और लाभ प्रदान किए। इस कानून पर सिएटल के मेयर ब्रूस हैरेल के हस्ताक्षर होने की उम्मीद है।"
    ],
    "commentSummary": [
      "गिग वर्क पर चर्चा में श्रमिक संरक्षण, वर्गीकरण, लाभ, चुनौतियां और टैक्सियों जैसी पारंपरिक सेवाओं के साथ तुलना जैसे विभिन्न विषयों को शामिल किया गया है।",
      "बहस के प्रमुख बिंदुओं में गिग वर्क का लचीलापन, गिग इकोनॉमी प्लेटफार्मों द्वारा शोषण के बारे में चिंताएं, विनियमन की आवश्यकता और व्यवसायों और श्रमिकों पर प्रभाव शामिल हैं।",
      "चर्चा गिग वर्क के आसपास की जटिलताओं और अलग-अलग राय और गिग अर्थव्यवस्था में श्रमिक अधिकारों के बारे में चल रही बहस को उजागर करती है।"
    ],
    "points": 275,
    "commentCount": 301,
    "retryCount": 0,
    "time": 1691628362
  }
]
