[
  {
    "id": 37062422,
    "title": "17 éves vagyok, és ezt az útmutatót írtam arról, hogyan futtatják a CPU-k a programokat.",
    "originLink": "https://github.com/hackclub/putting-the-you-in-cpu",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37062422",
    "commentBody": "",
    "originSummary": [
      "A \"Putting the 'You' in CPU\" egy technikai cikk, amely azt vizsgálja, hogyan futtat egy számítógép programokat, olyan témákat érintve, mint a syscalls, a programvégrehajtás és a multitasking.",
      "A szerzők, @kognise és @hackclub, kutatást végeztek, és átfogó módon mutatják be eredményeiket.",
      "A cikk fejezetekre tagolódik, a 3. fejezetet a témában már jártas olvasóknak ajánljuk, és végső soron a számítógépek működésének megalapozott megértését célozza."
    ],
    "commentSummary": [
      "Egy Lexi nevű 17 éves lány létrehozott egy weboldalt, amely átfogó útmutatót tartalmaz a CPU-k működéséről.",
      "Az útmutató pozitív visszajelzéseket kapott egyértelműsége, pontossága és megnyerő hangvétele miatt.",
      "A cikk kiemeli, hogy a processzorok és operációs rendszerek megértéséhez jobb online forrásokra van szükség."
    ],
    "points": 1160,
    "commentCount": 283,
    "retryCount": 0,
    "time": 1691588039
  },
  {
    "id": 37066680,
    "title": "Egy nyílt forráskódú Chrome-bővítmény fejlesztőjének kísértései (2021)",
    "originLink": "https://github.com/extesy/hoverzoom/discussions/670",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37066680",
    "commentBody": "",
    "originSummary": [
      "A Hover Zoom+ Chrome bővítmény tulajdonosa több üzleti ajánlatot is kapott a bővítmény pénzzé tételére vagy megvásárlására.",
      "A bizalommal kapcsolatos aggodalmak és a bővítés fejlesztőire nehezedő nyomás miatt a tulajdonos elutasította ezeket az ajánlatokat.",
      "A javaslatok között szerepelt a bevételek növelése partnerségek révén, a felhasználói adatok pénzzé tétele és a kereskedelmi SDK-k integrálása.",
      "A tulajdonos a pénzügyi biztonságot helyezi előtérbe, és úgy döntött, hogy nem követi ezeket az ajánlatokat."
    ],
    "commentSummary": [
      "A résztvevők megvitatják a nyílt forráskódú Chrome-bővítmények pénzzé tételével kapcsolatos kihívásokat és etikai aggályokat, beleértve olyan kérdéseket, mint a felhasználói adatvédelem, az adatgyűjtés és a célzott hirdetések.",
      "Vitatott, hogy a kiterjesztéseknek lehetőségük van beszélgetések lehallgatására, offline hirdetések nyomon követésére és pszichológiai manipulációra a hirdetéseken keresztül.",
      "A böngészőbővítmények ellenőrzési folyamata, valamint a monetizáció, az átláthatóság és az adatok feletti felhasználói ellenőrzés megvalósíthatósága és etikája is szóba kerül."
    ],
    "points": 931,
    "commentCount": 302,
    "retryCount": 0,
    "time": 1691605710
  },
  {
    "id": 37062650,
    "title": "Szeretné, ha az alkalmazottak visszatérnének az irodába? Akkor adjon mindenkinek egy irodát",
    "originLink": "https://www.washingtonpost.com/opinions/2023/08/09/remote-work-offices-floorplan-privacy/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37062650",
    "commentBody": "",
    "originSummary": [
      "A nyitott irodák zajosak lehetnek, és hiányzik a magánélet, ami csökkenti a termelékenységet és a munkahelyi elégedettséget.",
      "Az egyéni irodák biztosítása a munkavállalók számára ösztönözheti őket arra, hogy visszatérjenek az irodába, és javíthatja a termelékenységet.",
      "Az irodák biztosításának költségeit ellensúlyozhatja a távmunka trendjei miatt csökkenő irodahelyiségek költsége."
    ],
    "commentSummary": [
      "A munkavállalók különböző preferenciákkal rendelkeznek az otthoni munkavégzés (WFH) vagy az irodába való visszatérés tekintetében.",
      "Egyesek élvezik a WFH rugalmasságát és költségmegtakarítását, míg mások a társas érintkezést és a környezetváltozás élményét értékelik az irodában.",
      "A vita az osztály és a hierarchia kérdéseivel is foglalkozik, beleértve a vezetők és a munkaerő többi része közötti rugalmasságbeli különbségeket."
    ],
    "points": 735,
    "commentCount": 758,
    "retryCount": 0,
    "time": 1691589153
  },
  {
    "id": 37068464,
    "title": "A CNET törli a régi cikkeket, hogy megpróbálja javítani a Google keresési rangsorát",
    "originLink": "https://www.theverge.com/2023/8/9/23826342/cnet-content-pruning-deleting-articles-google-seo",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37068464",
    "commentBody": "",
    "originSummary": [
      "A CNET törli a régi cikkeket, hogy növelje a Google keresési rangsorát.",
      "A CNET anyavállalata, a Red Ventures, hasonló SEO-stratégiát vezetett be az összes csatornáján, és korábban mesterséges intelligencia-eszközöket használt a cikkek generálásához.",
      "Ezt a \"tartalmi metszést\" a jövőben évente legalább egyszer el kell végezni."
    ],
    "commentSummary": [
      "A viták középpontjában a Google keresőalgoritmusának a keresési eredményekre gyakorolt hatása áll, beleértve a régi cikkek törlését és a Google SEO-tanácsadásainak hitelességét.",
      "A Google bevételeinek és a spam-oldalak rangsorolásának következményei is szóba kerülnek ezekben a vitákban.",
      "További témák közé tartozik a régebbi cikkek láthatósága, a SEO hatékonysága és a történelmi tartalmak megőrzése. Szó esik még az internetes archívummal kapcsolatos kérdésekről, a cikkek dátumának manipulálásáról, a képtömörítési algoritmusokról és a mesterséges intelligencia által generált tartalmak használatáról."
    ],
    "points": 560,
    "commentCount": 348,
    "retryCount": 0,
    "time": 1691615452
  },
  {
    "id": 37060654,
    "title": "A Radically Open Security által elvégzett infrastruktúra-ellenőrzés",
    "originLink": "https://mullvad.net/en/blog/2023/8/9/infrastructure-audit-completed-by-radically-open-security/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37060654",
    "commentBody": "",
    "originSummary": [
      "A Mullvad VPN átesett a Radically Open Security harmadik biztonsági auditján, amely a VPN-infrastruktúrára összpontosított.",
      "Az ellenőrzés nem talált információszivárgást vagy az ügyféladatok naplózását, de különböző problémákat azonosított, például a tesztkiszolgálókon a termelési felhasználói forgalom láthatóságát.",
      "A Mullvad VPN olyan intézkedések bevezetésével tervezi kezelni ezeket a problémákat, mint például a jogosulatlan bejelentkezések auditálása és az SSH-támogatás eltávolítása."
    ],
    "commentSummary": [
      "A cikk és a hozzászólások a VPN szolgáltatókra, köztük a Mullvadra és a ProtonVPN-re és azok adatvédelmi gyakorlatára összpontosítanak, külön megemlítve a Mullvad porttovábbítási funkciójának eltávolítását.",
      "A megvitatott témák között szerepel az internetes adatvédelem, a kormányzati felügyelet, az online cenzúra, az amerikai szankciók hatása, valamint a VPN-ek korlátai és sebezhetőségei.",
      "A felmerült aggályok közé tartozik az adatgyűjtés, a VPN-szolgáltatók megbízhatósága és az online adatvédelem összetettsége."
    ],
    "points": 551,
    "commentCount": 264,
    "retryCount": 0,
    "time": 1691576326
  },
  {
    "id": 37063151,
    "title": "Arpchat - Küldjön SMS-t barátainak ugyanazon a hálózaton, csak ARP használatával",
    "originLink": "https://github.com/kognise/arpchat",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37063151",
    "commentBody": "",
    "originSummary": [
      "Az \"arpchat\" projekt egy nyílt forráskódú csevegőalkalmazás, amely az ARP (Address Resolution Protocol) protokollt használja a hálózati eszközök közötti üzenetátvitelhez.",
      "Támogatja a hosszú üzenetek továbbítását, és tartalmaz egy jelenlétfelismerő és szívverés-rendszert, valamint tömörítési funkciókat.",
      "A projekt Rust nyelven íródott, és a GitHubon 1,8k csillaggal népszerűvé vált. A telepítési utasítások Windows és Linux rendszerekre is elérhetők, és a felhasználóknak bátorítjuk, hogy jelezzenek minden problémát."
    ],
    "commentSummary": [
      "Az ArpChat egy üzenetküldő alkalmazás, amely az azonos hálózaton lévő felhasználók közötti kommunikációhoz az ARP protokollt (Address Resolution Protocol) használja.",
      "Az ArpChatben egy késleltetést okozó hibát kijavítottunk, de a frissített verzió még nem jelent meg.",
      "A Linux-felhasználóknál előfordulhatnak problémák az ArpChat-tel a hiányzó engedélyek miatt, de erre is van megoldás.",
      "A cikk elmagyarázza az ARP hasznosságát a hálózatépítésben, valamint a MAC-címek IP-címekhez való kapcsolásában betöltött szerepét.",
      "Az ARP-t gyakran használják az Ethernet és a WiFi hálózatokban, és a cikk az ezekben a hálózatokban való használatát vizsgálja.",
      "A vezeték nélküli útválasztók, kapcsolók és modemek által használt spoke-and-hub modell kerül megvitatásra, amely elmagyarázza, hogy az adatok jellemzően hogyan haladnak át az útválasztón még a helyi hálózaton is.",
      "Az ARP lehetséges sebezhetőségeit és manipulációját vizsgálják a hálózaton sugárzott üzenetek létrehozására.",
      "A cikk olyan témákkal is foglalkozik, mint a hálózati térképek létrehozására szolgáló kötegelt szkriptek, az internet nélküli kommunikációs módszerek (peer-to-peer chat, vezeték nélküli hálózatok), valamint a hasonló hálózati protokollokkal kapcsolatos felhasználói tapasztalatok.",
      "A DNS csevegő rendszerben való használatának lehetőségét is megvitatjuk."
    ],
    "points": 408,
    "commentCount": 60,
    "retryCount": 0,
    "time": 1691591096
  },
  {
    "id": 37063238,
    "title": "SQLedge: A Postgres SQLite-ra történő replikálása az élen",
    "originLink": "https://github.com/zknill/sqledge",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37063238",
    "commentBody": "",
    "originSummary": [
      "Az SQLedge egy nyílt forráskódú eszköz, amely a Postgres logikai replikációját használja a változások átvitelére egy Postgres adatbázisból egy helyi SQLite adatbázisba.",
      "Lehetővé teszi az SQLite adatbázisból való olvasást és az upstream Postgres szerverre való írást, biztosítva az adatok konzisztenciáját.",
      "Az eszköz tartalmaz egy SQL-generátort, egy SQL-elemzőt és egy Postgres wire proxy-t, és minden konfiguráció a környezeti változókból kerül lekérésre."
    ],
    "commentSummary": [
      "Az SQLite adatbázisokat széles körben használják, és számos eszköz és projekt áll rendelkezésre a funkcionalitásuk bővítésére.",
      "Az olyan eszközök, mint az SQLedge és az SQLitePostgres olyan funkciókat kínálnak, mint az adatreplikáció, a verzióvezérlés előnyei, a többmesteres replikáció és a lekérdezések elemzése.",
      "Ezek az eszközök könnyű lehetőségeket biztosítanak a helyi adatlekérdezéshez és -lekérdezéshez, az SQLite adatbázisok kezeléséhez kapcsolódó különböző funkciókkal. Az SQLite és más adatbázisok, például a PostgreSQL közötti SQL-dialektusok közötti különbségek miatt azonban korlátozások vannak."
    ],
    "points": 325,
    "commentCount": 63,
    "retryCount": 0,
    "time": 1691591389
  },
  {
    "id": 37060974,
    "title": "A mesterséges intelligenciától való félelem épp most ölt meg egy hasznos eszközt",
    "originLink": "https://www.techdirt.com/2023/08/08/the-fear-of-ai-just-killed-a-very-useful-tool/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37060974",
    "commentBody": "",
    "originSummary": [
      "Az összefoglaló a mesterséges intelligencia (AI), a szerzői jogok megsértése és a kreatív iparágak kapcsolódási pontjait tárgyalja.",
      "Kiemeli a Prosecraft eszköz leállítását a Shaxpir eszközzel kapcsolatos szerzői aggályok és kritikák miatt.",
      "Az összefoglaló kitér a mesterséges intelligencia által generált tartalmak jogszerűségéről és felhasználásáról szóló vitákra, a szerzői joggal és a tisztességes felhasználással kapcsolatos vitákra, a mesterséges intelligencia tanulásra és kreativitásra gyakorolt hatására, az adatvédelemmel kapcsolatos aggályokra, valamint a streamingszolgáltatások tartalom elérhetőségére gyakorolt hatására is."
    ],
    "commentSummary": [
      "A vita a prosecraft.io, egy olyan eszköz használata körül forog, amely statisztikákat és mérőszámokat készít a könyvekről.",
      "A megbeszélés témái között szerepel a szerzői jogok megsértése, a tisztességes felhasználás és a szerzői hozzájárulás szükségessége.",
      "Az AI-technológia kreatív iparágakra gyakorolt hatásait, a munkahelyek megszűnését, az etikát, a hitelességet és az emberi kreativitást is megvitatják."
    ],
    "points": 287,
    "commentCount": 280,
    "retryCount": 0,
    "time": 1691579300
  },
  {
    "id": 37066522,
    "title": "Az AMD GPU-k versenyképessé tétele az LLM következtetésekhez",
    "originLink": "https://blog.mlc.ai/2023/08/09/Making-AMD-GPUs-competitive-for-LLM-inference",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37066522",
    "commentBody": "",
    "originSummary": [
      "A cikk az AMD GPU-k, konkrétan a Radeon RX 7900 XTX teljesítményét tárgyalja LLM (Large Language Model) következtetés esetén.",
      "A tanulmány szerint a 7900 XTX a Llama2-7B/13B modellek esetében az NVIDIA GeForce RTX 4090 sebességének 80%-át, az RTX 3090 Ti sebességének 94%-át éri el.",
      "A gépi tanulási fordítás (MLC) és a ROCm stack használata optimalizálja a teljesítményt az AMD GPU-kon, a Vulkan és a WebGPU potenciális támogatásával. A tanulmány hangsúlyozza az MLC megoldások további fejlesztésének és optimalizálásának szükségességét az AMD GPU-k és más platformok számára."
    ],
    "commentSummary": [
      "Az optimalizált szoftvercsomagok javíthatják az AMD GPU-k teljesítményét a nagyméretű nyelvi modellek következtetéséhez.",
      "Az ML fordítási technikák és a TVM Unity szoftvercsomag olyan módszerek, amelyekkel nagy teljesítményt lehet elérni mind az NVIDIA, mind az AMD GPU-kon.",
      "A cikk az AMD ROCm és a Vulkan támogatását vizsgálja, de aggodalmakat vet fel a támogatás hosszú élettartamával kapcsolatban.",
      "Az AMD ROCm platformjának különböző felhasználási esetei, köztük az AI, a jelszófeltörés, a GPU-bányászat és a VFX renderelés kerülnek megvitatásra.",
      "Összehasonlítjuk az AMD és az Nvidia GPU-kat, különös tekintettel a RAM-kapacitás és a sávszélesség korlátaira a gépi tanulási algoritmusokban.",
      "A Microsoft a projektjében megoldást javasol a szűk keresztmetszet problémájára, míg a Geohot hozzájárulása közvetlenül a ROCm javítására összpontosít.",
      "A cikk azt javasolja, hogy egy RX 7900 helyett több RX 6600-as kártyát használjanak, de kérdéses, hogy ezek hogyan kapcsolódnának össze az NVLink AMD megfelelője nélkül.",
      "Ezek a fejlemények felvetik az AMD-be való befektetéssel kapcsolatos megfontolásokat."
    ],
    "points": 286,
    "commentCount": 95,
    "retryCount": 0,
    "time": 1691604924
  },
  {
    "id": 37070398,
    "title": "Seattle az Egyesült Államokban elsőként védi a gigamunkásokat a hirtelen \"kikapcsolástól",
    "originLink": "https://kuow.org/stories/seattle-becomes-first-in-u-s-to-protect-gig-workers-from-sudden-deactivation",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37070398",
    "commentBody": "",
    "originSummary": [
      "A seattle-i városi tanács új törvényt fogadott el, amely megvédi a gigamunkásokat a hirtelen deaktiválástól az olyan platformokon, mint az Instacart és a DoorDash, és ezzel az első ilyen jellegű jogszabály az Egyesült Államokban.",
      "A rendelet szigorúbb irányelveket vezet be a deaktiválásra vonatkozóan, és előírja, hogy a vállalatoknak 14 napos felmondási határidőt kell biztosítaniuk.",
      "Ez a fejlemény része a nagyobb seattle-i kezdeményezéseknek, amelyek célja a szakszervezethez nem tartozó gigamunkások védelme, beleértve a közelmúltbeli törvényeket, amelyek megemelték a minimálbért, és betegszabadságot és juttatásokat biztosítottak az alkalmazásalapú munkavállalóknak. A törvényt várhatóan Bruce Harrell, Seattle polgármestere fogja aláírni."
    ],
    "commentSummary": [
      "A gigamunkáról szóló megbeszélések különböző témákat érintenek, például a munkavállalók védelmét, a besorolást, a juttatásokat, a kihívásokat és a hagyományos szolgáltatásokkal, például a taxikkal való összehasonlítást.",
      "A vita fő pontjai közé tartozik a gigamunka rugalmassága, a gigamunka platformok általi kizsákmányolással kapcsolatos aggodalmak, a szabályozás szükségessége, valamint a vállalkozásokra és a munkavállalókra gyakorolt hatás.",
      "A viták rávilágítanak a gigamunkával kapcsolatos összetett kérdésekre és eltérő véleményekre, valamint a giggazdaságban a munkavállalói jogokról folyó vitára."
    ],
    "points": 275,
    "commentCount": 301,
    "retryCount": 0,
    "time": 1691628362
  }
]
