[
  {
    "id": 37062422,
    "title": "17 yaşındayım ve CPU'ların programları nasıl çalıştırdığına dair bu kılavuzu yazdım",
    "originLink": "https://github.com/hackclub/putting-the-you-in-cpu",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37062422",
    "commentBody": "",
    "originSummary": [
      "\"Putting the 'You' in CPU\" bir bilgisayarın programları nasıl çalıştırdığını inceleyen, sistem çağrıları, program yürütme ve çoklu görev gibi konuları kapsayan teknik bir makaledir.",
      "Yazarlar, @kognise ve @hackclub, araştırma yapmış ve bulgularını kapsamlı bir şekilde sunmuşlardır.",
      "Makale bölümlere ayrılmış olup, 3. bölüm konuya zaten aşina olan okuyucular için tavsiye edilmekte ve sonuçta bilgisayarların nasıl çalıştığına dair sağlam bir anlayış sağlamayı amaçlamaktadır."
    ],
    "commentSummary": [
      "Lexi adlı 17 yaşındaki bir çocuk, CPU'ların nasıl çalıştığına dair kapsamlı bir rehber içeren bir web sitesi oluşturdu.",
      "Rehber, açıklığı, doğruluğu ve ilgi çekici üslubu nedeniyle olumlu geri bildirimler almıştır.",
      "Makale, işlemcileri ve işletim sistemlerini anlamak için daha iyi çevrimiçi kaynaklara duyulan ihtiyacı vurguluyor."
    ],
    "points": 1160,
    "commentCount": 283,
    "retryCount": 0,
    "time": 1691588039
  },
  {
    "id": 37066680,
    "title": "Açık kaynaklı bir Chrome uzantısı geliştiricisinin cazibesi (2021)",
    "originLink": "https://github.com/extesy/hoverzoom/discussions/670",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37066680",
    "commentBody": "",
    "originSummary": [
      "Hover Zoom+ Chrome uzantısının sahibi, uzantıdan para kazanmak veya uzantıyı satın almak için birden fazla iş teklifi aldı.",
      "Güvene ilişkin endişeler ve genişletme geliştiricileri üzerindeki baskı, mal sahibinin bu teklifleri reddetmesine neden oldu.",
      "Teklifler arasında ortaklıklar yoluyla gelirin artırılması, kullanıcı verilerinden para kazanılması ve ticaret SDK'larının entegre edilmesi yer alıyordu.",
      "Mal sahibi finansal güvenliğe öncelik vermekte ve bu teklifleri değerlendirmemeyi tercih etmektedir."
    ],
    "commentSummary": [
      "Katılımcılar, kullanıcı gizliliği, veri toplama ve hedefli reklamcılık gibi konular da dahil olmak üzere açık kaynaklı Chrome uzantılarından para kazanmanın zorluklarını ve etik kaygılarını tartışıyor.",
      "Uzantıların konuşmaları dinleme, çevrimdışı reklamları takip etme ve reklam yoluyla psikolojik manipülasyon yapma potansiyeli tartışılmaktadır.",
      "Tarayıcı uzantıları için inceleme süreci ve para kazanma, şeffaflık ve veriler üzerinde kullanıcı kontrolünün fizibilitesi ve etiği de tartışılmaktadır."
    ],
    "points": 931,
    "commentCount": 302,
    "retryCount": 0,
    "time": 1691605710
  },
  {
    "id": 37062650,
    "title": "Çalışanların ofise dönmesini mi istiyorsunuz? O zaman her birine bir ofis verin",
    "originLink": "https://www.washingtonpost.com/opinions/2023/08/09/remote-work-offices-floorplan-privacy/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37062650",
    "commentBody": "",
    "originSummary": [
      "Açık ofisler gürültülü olabilir ve mahremiyetten yoksun olabilir, bu da üretkenliğin ve iş memnuniyetinin azalmasına neden olur.",
      "Çalışanlar için ayrı ofisler sağlamak, onları ofise dönmeye teşvik edebilir ve üretkenliği artırabilir.",
      "Ofis sağlamanın maliyeti, uzaktan çalışma eğilimleri nedeniyle azalan ofis alanı maliyeti ile dengelenebilir."
    ],
    "commentSummary": [
      "Çalışanların evden çalışma (WFH) veya ofise dönme konusunda farklı tercihleri vardır.",
      "Bazıları WFH'nin esnekliğinden ve maliyet tasarrufundan yararlanırken, diğerleri sosyal etkileşime ve ofisteki manzara değişikliğine değer veriyor.",
      "Tartışmada ayrıca, yöneticiler ile işgücünün geri kalanı arasındaki esneklik farklılıkları da dahil olmak üzere sınıf ve hiyerarşi konuları da ele alınmaktadır."
    ],
    "points": 735,
    "commentCount": 758,
    "retryCount": 0,
    "time": 1691589153
  },
  {
    "id": 37068464,
    "title": "CNET, Google Arama sıralamasını yükseltmek için eski makaleleri siliyor",
    "originLink": "https://www.theverge.com/2023/8/9/23826342/cnet-content-pruning-deleting-articles-google-seo",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37068464",
    "commentBody": "",
    "originSummary": [
      "CNET, Google Arama sıralamasını yükseltme çabasının bir parçası olarak eski makaleleri siliyor.",
      "CNET'in ana şirketi Red Ventures, yayın organlarında benzer bir SEO stratejisi uyguladı ve daha önce makale oluşturmak için yapay zeka araçlarından yararlandı.",
      "Bu \"içerik budama\" işlemi gelecekte yılda en az bir kez yapılacaktır."
    ],
    "commentSummary": [
      "Tartışmalar, eski makalelerin silinmesi ve Google'ın SEO tavsiyelerinin güvenilirliği de dahil olmak üzere Google'ın arama algoritmasının arama sonuçları üzerindeki etkisine odaklanıyor.",
      "Bu tartışmalarda Google için gelir etkileri ve spam sitelerin önceliklendirilmesi de konuşuluyor.",
      "Diğer konular arasında eski makalelerin görünürlüğü, SEO'nun etkinliği ve tarihi içeriğin korunması yer alıyor. Ayrıca internet arşivi, makalelerdeki tarihlerin manipülasyonu, görüntü sıkıştırma algoritmaları ve yapay zeka tarafından oluşturulan içeriğin kullanımı ile ilgili konulardan da bahsedilmektedir."
    ],
    "points": 560,
    "commentCount": 348,
    "retryCount": 0,
    "time": 1691615452
  },
  {
    "id": 37060654,
    "title": "Radically Open Security tarafından tamamlanan altyapı denetimi",
    "originLink": "https://mullvad.net/en/blog/2023/8/9/infrastructure-audit-completed-by-radically-open-security/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37060654",
    "commentBody": "",
    "originSummary": [
      "Mullvad VPN, Radically Open Security tarafından VPN altyapısına odaklanan üçüncü güvenlik denetiminden geçti.",
      "Denetimde bilgi sızıntısı veya müşteri verilerinin günlüğe kaydedilmesi tespit edilmedi, ancak test sunucularında üretim kullanıcı trafiğinin görünürlüğü gibi çeşitli sorunlar belirlendi.",
      "Mullvad VPN, yetkisiz girişleri denetleme ve SSH desteğini kaldırma gibi önlemler alarak bu sorunları ele almayı planlıyor."
    ],
    "commentSummary": [
      "Makale ve yorumlar, Mullvad ve ProtonVPN de dahil olmak üzere VPN sağlayıcılarına ve gizlilik uygulamalarına odaklanıyor ve Mullvad'ın port yönlendirme özelliğini kaldırdığından özellikle bahsediyor.",
      "Tartışılan konular arasında internet gizliliği, devlet gözetimi, çevrimiçi sansür, ABD yaptırımlarının etkisi ve VPN'lerin sınırlamaları ve güvenlik açıkları yer alıyor.",
      "Ortaya çıkan endişeler arasında veri toplama, VPN sağlayıcılarının güvenilirliği ve çevrimiçi gizliliğin karmaşıklığı yer alıyor."
    ],
    "points": 551,
    "commentCount": 264,
    "retryCount": 0,
    "time": 1691576326
  },
  {
    "id": 37063151,
    "title": "Arpchat - Sadece ARP kullanarak aynı ağdaki arkadaşlarınıza mesaj gönderin",
    "originLink": "https://github.com/kognise/arpchat",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37063151",
    "commentBody": "",
    "originSummary": [
      "\"arpchat\" projesi, ağ cihazları arasında mesaj iletimi için Adres Çözümleme Protokolünü (ARP) kullanan açık kaynaklı bir sohbet uygulamasıdır.",
      "Uzun mesajların iletimini destekler ve sıkıştırma işlevinin yanı sıra bir varlık keşfi ve kalp atışı sistemi içerir.",
      "Proje Rust dilinde yazılmıştır ve GitHub'da 1,8 bin yıldızla popülerlik kazanmıştır. Kurulum talimatları Windows ve Linux için mevcuttur ve kullanıcılar herhangi bir sorunu bildirmeye teşvik edilir."
    ],
    "commentSummary": [
      "ArpChat, aynı ağdaki kullanıcılar arasında iletişim için Adres Çözümleme Protokolü (ARP) kullanan bir mesajlaşma uygulamasıdır.",
      "ArpChat'te gecikmeye neden olan bir hata düzeltildi, ancak güncellenmiş bir sürüm henüz yayınlanmadı.",
      "Linux kullanıcıları eksik izinler nedeniyle ArpChat ile ilgili sorunlar yaşayabilir, ancak çözümler mevcuttur.",
      "Makale, ağ oluşturmada ARP'nin kullanışlılığını ve MAC adreslerini IP adreslerine bağlamadaki rolünü açıklamaktadır.",
      "ARP, Ethernet ve WiFi ağlarında yaygın olarak kullanılır ve makale bu ağlardaki kullanımını araştırmaktadır.",
      "Kablosuz yönlendiriciler, anahtarlar ve modemler tarafından kullanılan spoke-and-hub modeli ele alınmakta ve yerel bir ağda bile verilerin tipik olarak yönlendiriciden nasıl geçtiği açıklanmaktadır.",
      "Bir ağ üzerinde yayınlanmış mesajlar oluşturmak için ARP'nin potansiyel güvenlik açıkları ve manipülasyonu incelenir.",
      "Makale ayrıca ağ haritaları oluşturmak için toplu komut dosyaları, internet olmadan iletişim yöntemleri (eşler arası sohbet, kablosuz ağlar) ve benzer ağ protokolleriyle kullanıcı deneyimleri gibi konuları da kapsamaktadır.",
      "Bir sohbet sistemi için DNS kullanma olasılığı da tartışılmaktadır."
    ],
    "points": 408,
    "commentCount": 60,
    "retryCount": 0,
    "time": 1691591096
  },
  {
    "id": 37063238,
    "title": "SQLedge: Postgres'i Edge'de SQLite'a Çoğaltın",
    "originLink": "https://github.com/zknill/sqledge",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37063238",
    "commentBody": "",
    "originSummary": [
      "SQLedge, değişiklikleri bir Postgres veritabanından uçtaki yerel bir SQLite veritabanına aktarmak için Postgres mantıksal çoğaltmayı kullanan açık kaynaklı bir araçtır.",
      "SQLite veritabanından okumaya ve yukarı akış Postgres sunucusuna yazmaya izin vererek veri tutarlılığını sağlar.",
      "Araç bir SQL oluşturucu, SQL ayrıştırıcı ve bir Postgres tel proxy içerir ve tüm yapılandırmalar ortam değişkenlerinden alınır."
    ],
    "commentSummary": [
      "SQLite veritabanları yaygın olarak kullanılmaktadır ve işlevselliklerini geliştirmek için çeşitli araçlar ve projeler mevcuttur.",
      "SQLedge ve SQLitePostgres gibi araçlar veri replikasyonu, sürüm kontrolü avantajları, çoklu ana replikasyon ve sorgu ayrıştırma gibi özellikler sunar.",
      "Bu araçlar, SQLite veritabanı işleme ile ilgili çeşitli işlevlerle birlikte yerel veri önbelleğe alma ve sorgulama için hafif seçenekler sunar. Ancak, SQLite ve PostgreSQL gibi diğer veritabanları arasındaki SQL lehçelerindeki farklılıklar nedeniyle sınırlamalar mevcuttur."
    ],
    "points": 325,
    "commentCount": 63,
    "retryCount": 0,
    "time": 1691591389
  },
  {
    "id": 37060974,
    "title": "Yapay zeka korkusu faydalı bir aracı öldürdü",
    "originLink": "https://www.techdirt.com/2023/08/08/the-fear-of-ai-just-killed-a-very-useful-tool/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37060974",
    "commentBody": "",
    "originSummary": [
      "Özet, yapay zeka (AI), telif hakkı ihlali ve yaratıcı endüstrilerin kesişimini tartışıyor.",
      "Yazarların endişeleri ve Shaxpir aracına yönelik eleştiriler nedeniyle Prosecraft aracının kapatılması vurgulanmaktadır.",
      "Özette ayrıca, YZ tarafından üretilen içeriğin yasallığı ve kullanımı, telif hakkı ve adil kullanım tartışmaları, YZ'nin öğrenme ve yaratıcılık üzerindeki etkisi, veri gizliliğine ilişkin endişeler ve yayın hizmetlerinin içerik kullanılabilirliği üzerindeki etkisi hakkındaki tartışmalar da ele alınmaktadır."
    ],
    "commentSummary": [
      "Tartışma, kitaplar hakkında istatistik ve ölçümler üreten bir araç olan prosecraft.io'nun kullanımı etrafında dönüyor.",
      "Tartışma konuları arasında telif hakkı ihlali, adil kullanım ve yazar onayının gerekliliği yer almaktadır.",
      "Yapay zeka teknolojisinin yaratıcı endüstriler, iş kaybı, etik, özgünlük ve insan yaratıcılığı üzerindeki etkileri de tartışılmaktadır."
    ],
    "points": 287,
    "commentCount": 280,
    "retryCount": 0,
    "time": 1691579300
  },
  {
    "id": 37066522,
    "title": "AMD GPU'ları LLM çıkarımı için rekabetçi hale getirme",
    "originLink": "https://blog.mlc.ai/2023/08/09/Making-AMD-GPUs-competitive-for-LLM-inference",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37066522",
    "commentBody": "",
    "originSummary": [
      "Makale, AMD GPU'larının, özellikle de Radeon RX 7900 XTX'in LLM (Büyük Dil Modeli) çıkarımı için performansını tartışıyor.",
      "Çalışma, 7900 XTX'in Llama2-7B/13B modelleri için NVIDIA'nın GeForce RTX 4090'ının hızının %80'inde ve RTX 3090 Ti'nin hızının %94'ünde performans gösterdiğini ortaya koyuyor.",
      "Makine öğrenimi derlemesi (MLC) ve ROCm yığınının kullanımı, Vulkan ve WebGPU için potansiyel destekle birlikte AMD GPU'larda performansı optimize etmektedir. Çalışma, AMD GPU'lar ve diğer platformlar için MLC çözümlerinin daha fazla geliştirilmesi ve optimize edilmesi gerektiğini vurgulamaktadır."
    ],
    "commentSummary": [
      "Optimize edilmiş yazılım yığınları, büyük dil modeli çıkarımı için AMD GPU'ların performansını artırabilir.",
      "ML derleme teknikleri ve TVM Unity yazılım yığını, hem NVIDIA hem de AMD GPU'larda yüksek performans elde etme yöntemleri olarak tartışılmaktadır.",
      "Makale AMD'nin ROCm ve Vulkan desteğini inceliyor, ancak desteğin uzun ömürlülüğü konusunda endişeleri dile getiriyor.",
      "AMD'nin ROCm platformunun yapay zeka, şifre kırma, GPU madenciliği ve VFX işleme gibi çeşitli kullanım alanları ele alınıyor.",
      "Makine öğrenimi algoritmalarında RAM kapasitesi ve bant genişliği sınırlamalarına odaklanılarak AMD ve Nvidia GPU'ları arasında bir karşılaştırma yapılmıştır.",
      "Microsoft kendi projesinde darboğaz sorununa bir çözüm önerirken, Geohot'un katkısı doğrudan ROCm'yi geliştirmeye odaklanıyor.",
      "Makalede bir RX 7900 yerine birden fazla RX 6600 kart kullanılması öneriliyor, ancak NVLink'in AMD eşdeğeri olmadan bunların nasıl bağlanacağı konusunda sorular devam ediyor.",
      "Bu gelişmeler, AMD'ye yatırım yapma konusunda dikkat edilmesi gereken hususları gündeme getirmektedir."
    ],
    "points": 286,
    "commentCount": 95,
    "retryCount": 0,
    "time": 1691604924
  },
  {
    "id": 37070398,
    "title": "Seattle, ABD'de gig çalışanlarını ani 'devre dışı bırakma'ya karşı koruyan ilk şehir oldu",
    "originLink": "https://kuow.org/stories/seattle-becomes-first-in-u-s-to-protect-gig-workers-from-sudden-deactivation",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37070398",
    "commentBody": "",
    "originSummary": [
      "Seattle Belediye Meclisi, Instacart ve DoorDash gibi platformlarda çalışan işçilerin aniden devre dışı bırakılmasını önleyecek yeni bir yasayı onaylayarak ABD'de bu türden ilk yasayı kabul etmiş oldu.",
      "Yönetmelik, devre dışı bırakma için daha katı kurallar getirmekte ve şirketlerin fesihten önce 14 gün önceden bildirimde bulunmasını zorunlu kılmaktadır.",
      "Bu gelişme, Seattle'da asgari ücreti artıran ve uygulama tabanlı çalışanlara hastalık süresi ve sosyal haklar tanıyan son yasalar da dahil olmak üzere, bir sendikanın parçası olmayan gig işçilerini korumayı amaçlayan daha büyük girişimlerin bir parçasıdır. Yasanın Seattle Belediye Başkanı Bruce Harrell tarafından imzalanması bekleniyor."
    ],
    "commentSummary": [
      "Esnek çalışma üzerine yapılan tartışmalar, çalışanların korunması, sınıflandırılması, sosyal haklar, zorluklar ve taksiler gibi geleneksel hizmetlerle karşılaştırmalar gibi çeşitli konuları kapsamaktadır.",
      "Tartışmanın kilit noktaları arasında gig işinin esnekliği, gig ekonomisi platformları tarafından sömürülmeye ilişkin endişeler, düzenleme ihtiyacı ve işletmeler ve çalışanlar üzerindeki etkisi yer alıyor.",
      "Tartışmalar, geçici iş ilişkisini çevreleyen karmaşıklıkları ve farklı görüşleri ve geçici iş ekonomisinde işçi hakları konusunda süregelen tartışmaları vurgulamaktadır."
    ],
    "points": 275,
    "commentCount": 301,
    "retryCount": 0,
    "time": 1691628362
  }
]
