[
  {
    "id": 36491704,
    "timestamp": 1687867718,
    "title": "macOS command-line tools you might not know about",
    "url": "https://saurabhs.org/advanced-macos-commands",
    "hn_url": "http://news.ycombinator.com/item?id=36491704",
    "content": "Saurabh 😎Advanced macOS Command-Line ToolsmacOS is fortunate to have access to the huge arsenal of standard Unix tools. There are also a good number of macOS-specific command-line utilities that provide unique macOS functionality. To view the full documentation for any of these commands, run man <command>.caffeinate - set Mac sleep behaviorRunning caffeinate with no flags or arguments prevents your Mac from going to sleep as long as the command continues to run.caffeinate -u -t <seconds> prevents sleep for the specified number of seconds.Adding the -d flag also prevents the display from going to sleep.Specifying an existing process with -w <pid> automatically exits the caffeinate command once the specified process exits.Passing a command with caffeinate <command> starts the given command in a new process and prevents sleep until that process exits.pbcopy, pbpaste - interact with system clipboard<command> | pbcopy copies the output of the command to the clipboard.pbpaste outputs the contents of the clipboard to stdout.networkQuality - measure Internet speedRun networkQuality to run an Internet speed test from your Mac.Add the -v flag to view more detailed information.Use the -i flag to run the network test on a specific network interface.sips - image manipulationsips -z <height> <width> <image> resizes the specified image, ignoring the previous aspect ratio.sips -Z <size> <image> resizes the largest side of the specified image, preserving the aspect ratio.sips -c <height> <width> <image> crops the specified image to the given dimensions (relative to the center of the original image).sips -r <degrees> <image> rotates the image by the specified degrees.By default, sips will destructively overwrite the input image. Use the -o flag to specify a different output file path (which must have the same file extension as the input image).open - open files and applicationsopen -a <app> <file> opens the given file with the specified application.open . opens the current directory in a new Finder window.textutil - document file convertertextutil can convert files to and from Microsoft Word, plain text, rich text, and HTML formats.textutil -convert html journal.doc converts journal.doc into journal.html.The possible values for -convert are: txt, html, rtf, rtfd, doc, docx.mdfind, mdls - search with Spotlightmdfind <query> performs a keyword-based Spotlight search with the given query.mdfind kMDItemAppStoreHasReceipt=1 finds all apps installed from the Mac App Store.mdfind -name <name> searches for all files matching the given name.The -onlyin <dir> flag restricts the search to the given directory.mdls <file-path> prints all Spotlight metadata associated with the given file.screencapture - take screenshotsscreencapture -c takes a screenshot and copies it to the clipboard.screencapture <file> takes a screenshot and saves it to the given file.Add the -T <seconds> flag to take the screenshot after the given delay in seconds.taskpolicy - control scheduling of processestaskpolicy -b <command> starts executing the given command in the background. On Apple silicon Macs, the process will only run on the efficiency cores.taskpolicy -b -p <pid> downgrades an existing process to run in the background.taskpolicy -B -p <pid> removes the specified process from running in the background. On Apple silicon Macs, the process may now run on the efficiency or performance cores. Note that this only works on processes that have been downgraded to the background, and not processes that started in the background.taskpolicy -s <command> starts the given command in the suspended state. This is useful to allow a debugger to attach to the process right at the start of execution.say - text-to-speech enginesay <message> announces the given message.say -f input.txt -o output.aiff creates an audiobook from the given text file.pmset - configure power managementpmset -g prints all available power configuration information.pmset -g assertions displays information about power-related assertions made by other processes. This can be useful for finding a process that is preventing your Mac from going to sleep.pmset -g thermlog displays information about any processes that have been throttled (useful when running benchmarks).pmset displaysleepnow immediately puts the display to sleep without putting the rest of the system to sleep.pmset sleepnow immediately puts the entire system to sleep.networksetup - configure network settingsnetworksetup -listnetworkserviceorder prints a list of available network services.networksetup -getinfo <networkservice> prints information about the specified network service.networksetup -getdnsservers <networkservice> prints the DNS servers for the specified network service.networksetup -setairportnetwork <device> <network> [password] joins the specified Wi-Fi network. (In most cases, the <device> argument should be \"en0\".)qlmanage - manage Quick Lookqlmanage -p <file> opens a Quick Look preview window of the given file.qlmanage -m prints status information about the Quick Look server process.qlmanage -r restarts the Quick Look server process.qlmanage -r cache resets the Quick Look thumbnail cache.softwareupdate - manage OS updatessoftwareupdate --list prints out available software updates.sudo softwareupdate -ia installs all available updates.softwareupdate --fetch-full-installer --full-installer-version <version> tries to download the full installer of the specified macOS version to /Applications.system_profiler - view system informationsystem_profiler by default prints all available system information, which is usually overwhelming.system_profiler <datatype> only prints information about the given sub-system.system_profiler -listDataTypes lists all available sub-systems to get information from.Some particularly useful ones:system_profiler SPHardwareDataType prints an overview of the hardware of the current machine, including its model name and serial number.system_profiler SPSoftwareDataType prints an overview of the software of the current machine, including the exact macOS version number.system_profiler SPPowerDataType prints power and battery information, including the current AC wattage and battery cycle count.system_profiler SPDeveloperToolsDataType prints the currently active version of the Xcode developer tools and SDK.",
    "summary": "- The macOS command-line tools mentioned in this post provide unique functionalities that can be useful for various tasks.\n- Some of the highlighted tools include caffeinate for preventing Mac from sleeping, pbcopy and pbpaste for interacting with the system clipboard, and sips for image manipulation.\n- The post also covers other tools for tasks such as taking screenshots, controlling process scheduling, configuring network settings, managing OS updates, and viewing system information.",
    "hn_title": "macOS command-line tools you might not know about",
    "original_title": "macOS command-line tools you might not know about",
    "score": 1762,
    "hn_content": "- The post discusses various macOS command-line tools that many people may not be aware of.\n- The author provides examples of using commands like \"sips\" and \"iconutil\" to generate app icons and manipulate images.\n- The post also mentions tools like \"pbcopy\" and \"pbpaste\" for working with the clipboard in the command line.\n- There is also a mention of \"open,\" a command that opens files and folders with their associated applications.\n- The \"diskutil\" command is highlighted for managing disks and volumes on macOS.\n- Some additional tools and utilities mentioned include \"airport\" for working with Wi-Fi settings and \"hidutil\" for remapping keys on a keyboard.\n- Some readers may find these tools useful for various tasks or troubleshooting on macOS.",
    "hn_summary": "- The post covers various macOS command-line tools that are not widely known.\n- Examples of commands like \"sips\" and \"iconutil\" are provided for tasks like generating app icons and manipulating images.\n- Other tools like \"pbcopy\", \"pbpaste\", \"open\", \"diskutil\", \"airport\", and \"hidutil\" are mentioned for tasks related to clipboard, opening files and folders, managing disks and volumes, working with Wi-Fi settings, and remapping keys on a keyboard."
  },
  {
    "id": 36493715,
    "timestamp": 1687877482,
    "title": "The Password Game",
    "url": "https://neal.fun/password-game/",
    "hn_url": "http://news.ycombinator.com/item?id=36493715",
    "content": "Please choose a password",
    "summary": "- The post is about choosing a password, which is an important aspect of online security.\n- Choosing a strong and unique password is crucial to protect personal information and prevent unauthorized access.\n- The post emphasizes the importance of avoiding common passwords and using a combination of letters, numbers, and special characters.",
    "hn_title": "The Password Game",
    "original_title": "The Password Game",
    "score": 954,
    "hn_content": "Hacker News new | past | comments | ask | show | jobs | submit loginThe Password Game (neal.fun)955 points by kretaceous 19 hours ago | hide | past | favorite | 372 commentsgeluso 18 hours ago | next [–]I'm stuck at \"iatetomatoesyesterday0265Z#521juneVpepsiVIIxngxcaboutAg[moon emojis]italy2020Bf7+\" trying to solve the chess notation puzzle.I especially laughed at the rule \"must include today's Worldle\" and I'm happy with my solution including every emoji for \"must include the current phase of the moon as an emoji.\"(HackerNews doesn't seem to display emoji. My solution is to paste every moon phase emoji.)Excited to see what's next after figuring out the best move in this Chess puzzle.This reminds me of trying to manually construct an Autogram like below. This one is a quote someone else made. I tried to do it myself and it is so hard because the counts keep changing as you write out other counts!Only the fool would take trouble to verify that his sentence was composed of ten a's, three b's, four c's, four d's, forty-six e's, sixteen f's, four g's, thirteen h's, fifteen i's, two k's, nine l's, four m's, twenty-five n's, twenty-four o's, five p's, sixteen r's, forty-one s's, thirty-seven t's, ten u's, eight v's, eight w's, four x's, eleven y's, twenty-seven commas, twenty-three apostrophes, seven hyphens and, last but not least, a single !https://en.wikipedia.org/wiki/AutogramreplyReason077 10 hours ago | parent | next [–]I got the chess one pretty easily but I'm stuck on \"The elements in your password must have atomic numbers that add up to 200\". I haven't found a way to satisfy both this and \"The roman numerals in your password should multiply to 35\" simultaneously. Iodine (I) and Uranium (U) have high atomic numbers which blow out way higher than 200 and I haven't found a way to avoid them.Edit: OK, just realised that it's case sensitive. So I can use a lower case \"u\" to avoid it being interpreted as an element.replyhalestock 8 hours ago | root | parent | next [–]XXXV also works for the roman numerals.replyporphyra 9 hours ago | root | parent | prev | next [–]I had a chess move that's Rg8+ but Rg has an atomic number of 111...replydreday 9 hours ago | root | parent | next [–]You wanna start the chess move with Q...replyplewd 8 hours ago | root | parent | next [–]Many of the puzzles are different for each player, I personally had Rf8+replyporphyra 8 hours ago | root | parent | prev | next [–]But the best move in the chess puzzle I got requires moving the rook.replysicariusnoctis 4 hours ago | root | parent | prev | next [–]Technically impossible since queens cannot materialize out of thin air, except in crazyhouse.Also Rg1+ is a rather pretty attraction/clearance sacrifice/double check/mate-in-2.replyporphyra 4 hours ago | root | parent | next [–]The chess puzzle is different for everyone...replymtlmtlmtlmtl 1 hour ago | parent | prev | next [–]The worldle one I found kind of annoying because now I have to go play another game to keep going, one I don't find all that interesting.replyepicalex 50 minutes ago | root | parent | next [–]You can just search for the answer to save having to do thatreplymtlmtlmtlmtl 22 minutes ago | root | parent | next [–]Now it seems progress has become literally impossible because the chess move + the captcha includes digits that add up to more than 25. I guess having to restart is intended to be part of the game, or is this a bug?replynabakin 15 hours ago | parent | prev | next [–]I think the chess one is bugged. I've entered every possible move for the board I received and none of them worked.Edit: figured it outreplyjayelbe 12 hours ago | root | parent | next [–]I couldn't get it to accept a move which involved the knight jumping over a hostile piece. It was definitely the best move (I fed it into stockfish and got the same response). I refreshed the page to get a new puzzle and got a new street view as well. (╯°□°）╯︵ ┻━┻Edit: Oooohhh, I think I forgot to add a + for check!replyghayes 15 hours ago | root | parent | prev | next [–]It worked for me, but I had to include `Rxb6+` for the capture and the check.replysaikaushik 15 hours ago | root | parent | prev | next [–]Isn't Q×h6+ the best move for white, since there is a mate in 1 after that move. Am I missing something?replymesse 14 hours ago | root | parent | next [–]The game is selected at random each time you play, so depending on which you get the solution will differ.replyYetAnotherNick 11 hours ago | root | parent | prev | next [–]Enter without ×.replyRosalyn 15 hours ago | root | parent | prev | next [–]Can you please tell me? I've been stuck on it for an hour and a half.... I really need help ;-;replynabakin 12 hours ago | root | parent | next [–]tl;drK = KingQ = QueenB = BishopR = RookN = KnightPawns have no letter.You append a \"+\" to the end when it is a check moveYou append a \"#\" to the end when it's a checkmate moveYou add an \"x\" when your move eats another piece.Examples- Moving a rook to g6: Rg6- Moving a queen to d7 which eats a piece: Qxd7- Moving a bishop to a3 which checks the opponents king: Ba3+- Moving a pawn to e5: e5- Moving a queen to h7 which eats a piece and checks the king: Qxh7+- Moving a pawn to f4 which checkmates the king: f4#replykuboble 2 hours ago | root | parent | next [–]There are few more.Rae1 - rook a to e1. if two rooks on the first line can move to e1. R4d4 - if two rooks on the 4th line can go to d4. Ngxh2# - the knight from g captures on h2 with checkmate.Nd2e4 - In a rare case that there are 3 knights that can go to a single squarePawn captures are denoted as exd5 (pawn on the line e captures a pawn on d5) even if there is only one pawn that can make a capture.replyrkagerer 5 hours ago | root | parent | prev | next [–]I learned more from your concise post than I ever have from articles, Wikipedia, etc.reply9dev 5 hours ago | root | parent | next [–]For Real. I finally understood chess notation.replyTistron 2 hours ago | root | parent | prev | next [–]Thanks for this. What if two rooks can both get to e5, how do you disambiguate?replybonzini 2 hours ago | root | parent | next [–]Using the column they are on, or the row if they are both on the same column. For example Rac8 moves a rook from a8 to c8, R1d2 moves it from d1 to d2.replyPotterqueen23 9 hours ago | root | parent | prev | next [–]How tell me.replybowmessage 15 hours ago | parent | prev | next [–]Also got stuck on the chess game - had to peruse the webpacked source code for the array of solutions...replyvilkkala 3 hours ago | parent | prev | next [–]I'm too stuck at the chess move with XXXVJanuarypepsi@3pe4g99tractHechilereplyfestive-minsky 12 hours ago | parent | prev | next [–]I had to use stockfishreplyjug 40 minutes ago | root | parent | next [–]Haha, yeah I used Chess.com analysis and it gave me a clearly best sequence of moves (three to checkmate) but it didn't take the first move from white that it asked for. :( I saw many other struggle with this one too. Anyway, I gave up here and seeing some of the subsequent steps I doubt I'll reach the end anyway!replytiborsaas 11 hours ago | root | parent | prev | next [–]Brutalreplydr_orpheus 18 hours ago | parent | prev | next [–]Also got stuck at the chess one with \"551A!mayShellVIIVr8gecmaboutAuSingaporeBxe6\"replythemanmaran 15 hours ago | root | parent | next [–]You may need the + at the end of your notation if you're putting the king in check.replysandyarmstrong 15 hours ago | root | parent | next [–]Yup, I had to come here to figure out that the + was missing in mine! TIL!replychankstein38 18 hours ago | parent | prev | next [–]You could potentially paste the chess notation into chatgpt and ask for the next move! It's not perfect but it'd be better than me at it at leastreplyailef 18 hours ago | root | parent | next [–]ChatGPT is really and at chess. I'd just paste it in one of the online chess engines.replywongarsu 16 hours ago | root | parent | next [–]There are apps that detect the positions from an image, and run a local version of stockfish to get the best movereplynoSyncCloud 15 hours ago | root | parent | next [–]https://chessvision.ai/replyirrational 14 hours ago | parent | prev | next [–]Italy? Interesting that it is giving different locations. I got Qatar.replycroddin 10 hours ago | root | parent | next [–]I got Colombia, and C is a roman numeral so I think I'm stuck. edit: nevermind I can just make it lowercase.replyiso1631 13 hours ago | root | parent | prev | next [–]It's randomreplyYChacker100 1 minute ago | prev | next [–]Super fun game ahah thanks for making!replybatmansmom1 18 hours ago | prev | next [–]A warning to future players: I got to rule 16 and was given an egg named paul that I had to keep safe. Then on rule 18 a fire (of emojis) broke out in my password, killing paul and ending the game. Dont be like me, keep Paul safe.replyblharr 17 hours ago | parent | next [–]Later on there is a rule where you have to feed Paul bugs, and I lost by feeding him too muchreplyriffraff 14 hours ago | root | parent | next [–]for me, he starved while I was looking for a youtube video and I am not strong enough to play through this again, even if I loved the gamereplycaptainpiggies 15 hours ago | root | parent | prev | next [–]I, too, overfed Paul :(replyMissingHandle 9 hours ago | root | parent | prev | next [–]Samereplyprincevegeta89 16 hours ago | parent | prev | next [–]You can keep Paul safe by adding something like a lot of = before the egg and continuously delete the appearing fires and at some point the fire will be gonereplygcoakes 5 hours ago | parent | prev | next [–]I killed Paul when trying to get the atomic numbers to equal 200. My plan was to add \"H\" until the rule was satisfied. Then, I thought I accidentally went past it, so I started holding backspace. I went too far.replyCaptainNegative 14 hours ago | parent | prev | next [–]Not even surrounding Paul with water emojis could stop the fire.replykriro 2 hours ago | root | parent | next [–]Nice idea, he died from fire on my first run as well. Maybe I'll try again in the evening.replyGeorgelemental 17 hours ago | parent | prev | next [–]Also, Paul must not be overfedreplytw04 15 hours ago | root | parent | next [–]^^I tried leaving him a bunch of worms so I could search for a youtube video and I was betrayed, greedy Paul.replysebastos 6 hours ago | root | parent | next [–]Me too :<replyromwell 6 hours ago | root | parent | prev | next [–]Found it out the hard way :(replyafterburner 3 hours ago | parent | prev | next [–]\"PAUL WAS OVERFED\"OH NO!!replyFinnKuhn 17 hours ago | parent | prev | next [–]same here... Paul burnt to death an I lost :(replyYellOh 17 hours ago | root | parent | next [–]Thirding it. I'm guessing the move is to back up the password, move Paul to the first/last character, and delete everything to save him.Update: this strat works. But then don't immediately overfeed him.replyRosalyn 15 hours ago | parent | prev | next [–]How'd you solve it (rule 16)?I'm completely stuck on it... I've tried every single combination that came to mind :/replyMogzol 14 hours ago | root | parent | next [–]You can cheat by entering the board state into a site like https://nextchessmove.com/replyroboticmind 15 hours ago | root | parent | prev | next [–]The position seems to be randomized each time you play it, so their solution isn't going to be of much use for youAlso make sure to add the x for captures and the + for check and things like thatreplyriffraff 14 hours ago | root | parent | prev | next [–]try chessvision.ai, it allows you to scan the page and get the next best move.replyiso1631 13 hours ago | root | parent | prev | next [–]I came up with \"invalid notation\" a bit, but on my first go I had something like \"Bh5\" and I needed \"Bh5+\"If you put the opposing king in check you need to put the +replychaxor 14 hours ago | parent | prev | next [–]Paul was slain :(\"SiP@pepsin.VII@Vmay8y63f-2aboutcolombiaKh6\"Decent password 10/10reply19wolf 7 hours ago | parent | prev | next [–]For me the fire didn't break out until Rule 20replyJoshTriplett 2 hours ago | prev | next [–]\"Congratulations! You have sucessfully chosen a password in 113 characters.\"This was a horrific abomination, and delightfully evil.My solution (which includes some spoilers, even though each game has somewhat different rules): https://social.joshtriplett.org/@josh/posts/AX8ypcJYS8eSFLUX...replyghayes 1 hour ago | parent | next [–]Did you actually manage to re-type that?replywavemode 15 hours ago | prev | next [–]For anyone else who was struggling to make the leap year work with all the other math: 0 is a leap year.For anyone else struggling with how to make the country name work with roman numerals or element names, you can lowercase the country name then it doesn't count as a roman numeral nor element.If your chess move is illegal, make sure you're also notating the effect of the move (Nxe6 for N captures on e6, not just Ne6. Ne6+ if it's a check. Ne6# if it's mate.)Spaces are also allowed so feel free to break up parts of the password to separate things and prevent them from interfering with each other.Use XXXV as the roman numeral. Easiest to work with since only V (23) is an element.Reroll your color if its hex has any numbers in it. You'll thank me later.I made it to the final challenge (password must contain the current time) and it became extremely difficult because the current time, the length of the password itself, and a pesky 9 that was in my youtube URL were just too much to add up to 25 (even though I tried to overlap things, like 3:383 to cover 3:38 current time as well as 383 prime password length). I would've needed to somehow reupload a video that didn't have any digits in it (or at least one that had a lower digit like 1 or 2) or wait until it was 10:00 pm or something.replybowmessage 2 hours ago | parent | next [–]I cycled through _so_ many hex colors and youtube videos. I found that searching the length in the youtube search bar led to plenty options. I even chose to exclude 'x' which was _so_ dumb as I had to switch my XXXV to a V and VII, making life much harder for myself.Ultimately I finally got a password with length 211, including the current time, that fit all of the rules![spoiler] the final step has you re-type your password to \"confirm\" it, in an impossible amount of time [/spoiler]. What a frustrating ending!!!replyghayes 1 hour ago | root | parent | next [–]Also ended up with exactly 211, maybe the easiest choice. Sad at the ending.Other hints:* The eyedropper is a good way to get the hex quickly.* On Youtube search the time you need and then scroll until you load a metric ton of videos then Cmd+F for the time (e.g. 28:22) since the times are searchable text on screen.replyJoshTriplett 10 hours ago | parent | prev | next [–]> For anyone else struggling with how to make the country name work with roman numerals or element names, you can lowercase the country name then it doesn't count as a roman numeral nor element.Unfortunately, \"country name\" and \"all the vowels in your password must be bold\" are fundamentally incompatible, since it doesn't recognize country names unless they have unbolded vowels.EDIT: Gah. I tried every Unicode \"bold\" variant I found, before finding that the password field had in fact become a rich text field and allowed actual \"bold\".replycubefox 1 hour ago | root | parent | next [–]Rich text passwords, an amazing innovation.replyjcranmer 10 hours ago | root | parent | prev | next [–]I had no problems getting 'canada' recognized with the a's bolded.replydanfritz 15 minutes ago | prev | next [–]Cannot get past rule 5, tried a bunch of different solutions from this thread but nothing works. Maybe a browser quirk ( I'm on Brave IOS)Anybody else have the same problem?replyxavdid 14 hours ago | prev | next [–]This was fun!It reminds me of \"Password Purgatory\" that Troy Hunt (of \"Have I Been Pwned\" fame) built. It sends real scammers to a real-looking site that basically makes them play this game until they give up and go away.https://www.troyhunt.com/building-password-purgatory-with-cl...replyc120 59 minutes ago | prev | next [–]Almost gave up on the Chess notiation, but now \"All the vowels in your password must be bolded.\" clashes with the requirement to include a captcha and reloading this unleashes all kinds of problem, so game overreply0xml 38 minutes ago | prev | next [–]A funny game! For anyone else struggling with the wordle, the answer is here[1]. For anyone else struggling with the country, you can fill in the names of all the countries, then run a bisection.[1] https://www.nytimes.com/svc/wordle/v2/2023-06-28.jsonreplyYellOh 13 hours ago | prev | next [–]Managed to make it almost all the way to the end! Note that \"is this your final password?\" is not the last challenge, despite it being the last thing on the lists other people have posted. Afterward you're asked to retype your password which is almost impossible to do, given that it's in various sizes (with any zeroes at font size zero) and partially in windings.I recommend copy/pasting before you get there. It doesn't let you copy once that final resubmit form appears.This is the last saved copy of mine (from ~5 steps before the end; also, yc doesn't capture the various fonts, text sizes, and emojis):xngxcaboutjuneshell0000XXXV*I54malaysia0Nd3+Gd d4dbc1170replypynappo 5 hours ago | parent | next [–]yeah, just lost at that point too, didn't have my password copy pasted anywhere :(I guess I should have been wary of a confirm password phase. i even wrote a tiny auto hotkey script to keep feeding that stupid chicken for 40 minutes while I waited for time to tick from 8:20 (I didn't have the password ready yet) to 9:01...replygault8121 9 hours ago | parent | prev | next [–]How do you solve the time issue - does it lock in the time at the moment you complete that rule, or do you need to keep updating the password with the new time? Also, is the time UTC or time zoned?replypynappo 5 hours ago | root | parent | next [–]You need to keep updating the password. It's time zoned. Basically you have to plan ahead as to what time you want your password to be submitted at and get every other rule satisfied before that time.In my case it was 8:20 and I had a sum of 15 so I fixed my password in the next 20ish minutes and set the target time to 9:01 at the earliest and spun up an auto hotkey script to paste the food for Paul every 20ish seconds (in reality I think it eats faster than that)replyqt31415926 12 hours ago | parent | prev | next [–]I'm impressed you were able to not get tangled up by the youtube/captcha/color hex/roman numeral mess! The youtube one is what screwed me over and over out of all my attemptsreplynabakin 12 hours ago | root | parent | next [–]\"00:00 / <minutes>:<seconds>\" youtubeGoogle that, including the quotes, replace the minutes and seconds with your given time, then look through the results and find a URL which fits the password criteria.Every result should be a video with that duration. If it isn't, check your useragent. I noticed some weirdness with that.replygault8121 6 hours ago | root | parent | prev | next [–]The Chrome Inspector Color Picker does not return the right hex code! You have to go into the properties to get the right value.replylcabral 17 hours ago | prev | next [–]This turns into a mildly frustrating riddle as some of the challenges are random (captcha, Street View, chess challenge) and end up making it impossible to continue. Got my number added up from the captcha and the best chess move came to be Qh6 (I would need a chess master to disagree with me) so I'm already busted on the add to 25 and then it tells me the \"Qh6\" notation is illegal (Ok, I was never good with chess notation but I'm pretty sure that says Queen to H6...)replyfisian 17 hours ago | parent | next [–]I also had to figure out how to enter chess notation. As it turns out you have to add \"x\" after the piece if you want to capture or \"+\" suffix for check.replylcabral 16 hours ago | root | parent | next [–]Ah. That might be it... Anyhow after staring at that chess challenge I was sure to get a mate in two moves with the Qh6 but the captcha filled with numbers plus the add to 25 left me with only 3 to spare... So no way am I winning this game.replyphaedryx 13 hours ago | root | parent | next [–]You can refresh the captcha. I had to a couple of times.replygreenpizza13 12 hours ago | root | parent | prev | next [–]For the chess solution I ended up putting a breakpoint in the Javascript. To each their own.replyjamilton 15 hours ago | parent | prev | next [–]Yeah, I'm stuck on the chess part too. Figured out how to put black in check, figured out the notation, including the +, but it doesn't agree that's the best move. Put the positions into a chess engine... it agrees with me with what the best move is.Fun game though, I laughed out loud at the Wordle requirement.replysimantel 16 hours ago | parent | prev | next [–]Yeah, I got Croatia in the Geoguessr section, which means I can't possibly multiply roman numerals to 35, since C is 100.replyApes 16 hours ago | root | parent | next [–]You can use a lowercase c, and it won't count as a roman numeral.replysakras 17 hours ago | parent | prev | next [–]Yeah I think there's a bug with the chess notation, I also had it tell me Rh3 was illegal notation. Interestingly Rf3 is not illegal notation but an illegal move for me.replyTFortunato 17 hours ago | root | parent | next [–]I thought I had this issue, but it turned out I had to remember the \"+\" at the end, when I put my opponent in checkreplydanuker 17 hours ago | root | parent | next [–]THANK YOU! I was stuck not knowing the \"+\". In my case it was a check mate.replyjameshart 15 hours ago | parent | prev | next [–]You can regenerate the captcha at any time.replyjavajosh 16 hours ago | parent | prev | next [–]The \"two digit periodic table symbol\" is also arbitrary - it has to be initial caps! Then if you refresh the page, the random stuff resets, so I gave up at that point with !marchpepsidn26n2555VIIVabout where \"dn26n\" is random captcha.replyfishtoaster 16 hours ago | parent | prev | next [–]I ended up refreshing the captcha until I got one with only one number, in order to get around that kind of issue.replyanoncow 16 hours ago | parent | prev | next [–]If it included a check Qh6+ could have been the answer?replyxp84 17 hours ago | prev | next [–]This isn’t really significantly more irritating than half the password “rules” forced on me by major companies who ought to know better.“A special character…” Okay, how about: ““No, not THAT special!! (Shh, we are worried about a SQL injection attack… in your password… which we dont even know how to escape)”Let the many implications sink in for a minute.)replyverbify 17 hours ago | parent | next [–]It doesn't necessarily mean that they don't know how to escape special characters, it just might mean that they're employing a defence in depth approach.replybacchusracine 17 hours ago | prev | next [–]I'm about to send an email asking the site manager to remove this before any PHB types take it seriously....yes those types exist and yes they would see this as inspirational...God help us all...replynashashmi 17 hours ago | parent | next [–]At least it has a great UIreplykretaceous 19 hours ago | prev | next [–]Neal has outdone himself yet again. I had it until the roman numerals and adding upto 25 ones but lost my cool when it said it must include today's wordle answer.Screaming and crying.replysltkr 18 hours ago | parent | next [–]I wonder if the password becomes invalid if you leave the tab open for 24 hours...replysqueaky-clean 17 hours ago | root | parent | next [–]Won't say too many spoilers but after a certain rule part of your password can starve to death if you don't feed it enough. Ask me how I know :(replymcint 12 hours ago | root | parent | next [–]Mmm, I overfed a certain part of the password.replylnx01 18 hours ago | parent | prev | next [–]I gave up when I needed to represent the best chess move in algebraic notation, but I couldn't because the text from the captcha I had to solve earlier contained an illegal move... ragereplyufo 16 hours ago | root | parent | next [–]It works if you put the chess move before the captchareplyKomoD 17 hours ago | root | parent | prev | next [–]You can regen the captcha, I stopped at that too because I couldn't be bothered.replyjenjenneration 14 hours ago | root | parent | prev | next [–]https://nextchessmove.com/replydalai 18 hours ago | parent | prev | next [–]I gave up on rule 18: The elements in your password must have atomic numbers that add up to 200.replyjerdthenerd 10 hours ago | prev | next [–]I am stuck on the chess one because my captcha included text with \"xe8\" which could be read as a (albeit confusing) algebraic notation.So I give this game a 6/10 for bugginess. Would not recommend the preorder.edit - after reading some of the comments, I realized I could change my destiny by resetting the captchareplyquantumsequoia 4 hours ago | parent | next [–]There is no bug, it only cares the correct answer is present. It's okay if other substrings are also valid chess notation, that won't prevent you from passing the rule if you include the correct onereplyRancidDiarrhea 4 hours ago | parent | prev | next [–]You can also enter more than one chess move. only one has to be right.replyjer0me 10 hours ago | parent | prev | next [–]You can refresh the captchareplyrubyron 18 hours ago | prev | next [–]This would be great to use on my sites so users choose stronger passwords.Is there an api planned, or is it open source?reply_flux 16 hours ago | parent | next [–]Needs to have the actual password obscured, e.g. with asterisks.In fact, also the length should be obscured, show nothing, as is the way in Unix password prompts!replyjavajosh 16 hours ago | parent | prev | next [–]An api that's $1/request unless you have a prime number of requests, then it's free.replyPannoniae 18 hours ago | parent | prev | next [–]please try playing the game, it's not about this :)replyrubyron 17 hours ago | root | parent | next [–]didn’t think I needed the /sreplyPannoniae 17 hours ago | root | parent | next [–]I apologise for being an idiot. I will buy a new sarcasm detector shortly.replyraspo 42 minutes ago | prev | next [–]Really well done. I loved the password on fire part! :)replyNKosmatos 17 hours ago | prev | next [–]Reminds me of BOFH :-) https://www.theregister.com/offbeat/bofh/ https://en.wikipedia.org/wiki/Bastard_Operator_From_Hellreplypreinheimer 17 hours ago | parent | next [–]The classic stories brought a smile to my face for a long time.replyclaar 14 hours ago | prev | next [–]The chess one is much easier with my favorite Chrome extension, chessvision.ai https://chrome.google.com/webstore/detail/chessvisionai-ches...Just make sure to add captures/check/etc (Examples from wavemode on this thread: Nxe6 for N captures on e6, not just Ne6. Ne6+ if it's a check. Ne6# if it's mate.)replyflippy_flops 16 hours ago | prev | next [–]Amazing. I've always wanted a similar game card readers:Remove your card before the clerk gets annoyed at you. The screen is flashes various messages like \"PLEASE REMOVE YOUR CARD after the TRANSACTION IS COMPLETE\". Push the card too hard and the reader falls off the table. Pull at an angle or too slow and it drags the reader.replyh4x0rr 14 hours ago | prev | next [–]Reminds me of Password Purgatory. A site made by Troy Hunt (the haveibeenpwned guy) which looks like a signup page (actually seems to have an api) but the password requirements get more ridiculous each time. The link is then sent to spammers who bug him about his blog. https://passwordpurgatory.com/get-hell?kvKey=510aa555-e482-4...replycrumblingaway 3 hours ago | prev | next [–]That's a shame, I reached an impossible situation. The best chess move is Re5+ which includes the letters Re which is the element Rhenium with atomic number 75. However since the roman numerals need to multiply to 35 then the only valid solution is having VII and V (XXXV for 35 is not recognized for some reason), and V is Vanadium with atomic number 23 and I is Iodine with 53. That already leaves me with 227, above the 200 threshold for one of the rules.replyblazifex 3 hours ago | parent | next [–]You should be able to do XXXV and I to get 35, I think it needs two roman numerals to multiply (that worked for me at least)replysurume 1 hour ago | prev | next [–]Wow that is tough. The country part stumped me and I had to give up cause I also have a day job . Excellent work Neal!replycharles_f 8 hours ago | prev | next [–]Love it :DReminds me of something I built a few years ago, to answer spammers who keep contacting me with their offers of \"services\": https://cingen.net/moostik/signup/The most insistent one tried 31 times (the rules are conflicting and it's impossible to satisfy the answer). Special attention was given to the security questions, but somehow spammers keep picking the simplest one.replymadcaptenor 14 hours ago | prev | next [–]List of countries in geoguessr: AlbaniaAndorraArgentinaAustraliaAustriaBangladeshBelgiumBhutanBoliviaBotswanaBrazilBulgariaCambodiaCanadaChileColombiaCroatiaCzechiaDenmarkDominicanRepublicEcuadorEstoniaFinlandFranceGermanyGhanaGreeceGuatemalaHungaryIcelandIndonesiaIrelandIsraelItalyJapanJordanKenyaKyrgyzstanLatviaLithuaniaLuxembourgMalaysiaMexicoMongoliaMontenegroNetherlandsNewZealandNigeriaNorthMacedoniaNorwayPeruPhilippinesPolandPortugalRomaniaRussiaSenegalSerbiaSingaporeSlovakiaSouthAfricaSouthKoreaSpainSriLankaSwedenSwitzerlandTaiwanThailandTurkeyUnitedStatesUgandaUkraineUnitedArabEmiratesUnitedKingdomUruguayEgyptPakistanChinaDominicanRepublicIndiaVietnamBermudaPuertoRicoRunionFaroeIslandsGreenlandfrom https://geoguessr.fandom.com/wiki/Countries_on_Geoguessr(unfortunately the only way to use this I can find is to put it in the password and then delete it bit by bit)replyjncfhnb 14 hours ago | parent | next [–]I don’t think this is the source. My answer was Liberia. I was able to spot a .LR domain on a street sign ad.Then I accidentally lost all progress by clicking the chess notation link and when I got back to the geo guessing it was a small forested area with nowhere to walk to so I gave up :(replymadcaptenor 14 hours ago | root | parent | next [–]it's from fandom.com, so might be out of date. I think the general strategy would work if you had the right list of countries - although if you're determined to just cheat your way past this step, probably better to just look at the source and get coordinates as someone else has suggested.replyfullstop 13 hours ago | parent | prev | next [–]The country in my attempt was Venezuela. I was placed in a chapel (?) and was able to find a plaque which helped me to identify the country.replysb8244 14 hours ago | parent | prev | next [–]I inspected page source and found the coordinates in the embed, then looked it up via that. Mine was the middle of a field in Brazil.replysesm 11 hours ago | parent | prev | next [–]How do you satisfy the chemical elements constrain if you get country starting with 'Au'? It's 79 plus VII (23+53+53) and V (23) (from roman numerals part), while the sum should be 200replypugworthy 11 hours ago | root | parent | next [–]I believe you can lower case the A so it won't register as an element. Also, there's more than one way to get 35 as a multiplication problem...replymogoh 12 hours ago | parent | prev | next [–]I got El Salvador which is not is the list.replycubefox 1 hour ago | prev | next [–]Reminded me of this video:https://youtube.com/watch?v=WqnXp6Saa8Yreplyj-h-k 16 hours ago | prev | next [–]Got to the youtube video length url, but then I overfed Paul. Hilarious and frustrating at the same time :D.replyjayelbe 11 hours ago | parent | next [–]I thought I was being so clever by filling up the password field with food, so I could buy lots of time to search YouTube. I didn't realise Paul could be overfed :'(replyTomK32 15 hours ago | parent | prev | next [–]I found the video, it's by the United Nations, only for Paul to starve. What did the UN ever do for us, eh?replyTomK32 15 hours ago | root | parent | next [–]doh, of course the video length is randomized.replytw04 5 hours ago | prev | next [–]If you use duckduckgo to search for youtube videos that's the easiest way over that hurdle because DDG will show the length of the video as an overlay for the thumbnail. Just search for \"17 minute timer\" or whatever is the closest but less than the length you need. Make sure to sort by short/medium/long as well to limit it to the proper window.Made it to \"the length of your password must be included in your password\" and decided to throw in the towel.replyearth_walker 5 hours ago | parent | next [–]I just typed in \"6 minutes and 55 second\" in the youtube search and someone had posted a video called \"6 minutes and 55 seconds of X\"replyp4nthera_ 14 hours ago | prev | next [–]I got to rule 35, I think I was one away from victory, best time to play this is probably around 10:00-2:00 so that you can keep low numbers and it doesn't mess up rule 5. I gave up and decided to slay Paul myself. Paul is the bane of my existence.replyBarneySz 26 minutes ago | prev | next [–]Do we need to put out the fire?replypaxys 17 hours ago | prev | next [–]How did you find my company's login page?replyYellOh 18 hours ago | prev | next [–]VIIJuneVShell65$bw6n6aboutHecroatia0000 so far. Croatia was extraordinarily hard to guess. Currently stuck on the chess game, if anyone has generic advice on how to not suck at chess.Fun bonus: it can't seem to figure out what's going on with the knight. Using \"K\", \"N\", or \"S\" for knight all get me \"invalid notation\" warnings. I'm having a lot of fun.New update: got the chess answer! It will accept \"N\" for my Knight iff I make stupid moves with it. Moving my knight to take a bishop is \"invalid notation\", but apparently putting it in the middle of nowhere to be captured by a rook is the best possible move.Final update: Paul died in a fire. :Ireplyblharr 17 hours ago | parent | next [–]The notation for capturing should be something like \"Nxe6.\" I'm guessing the mistake you're making is just doing \"Ne6\"replyufo 16 hours ago | root | parent | next [–]Also, add \"+\" at the end if you're putting the king in check.replygeluso 17 hours ago | parent | prev | next [–]oh man I got really lucky and was prompted with a picture of Italy. I got it right on my first try. I didn't realize the country images rotated!replyh1fra 15 hours ago | prev | next [–]Amazing !Died after the URL, it was too much to recalculate the atomic numbers and keep track of Paul. Maybe this chicken was the most unfair part of this game, the random captcha and country make it impossible to retry easily (maybe the time frame for feeding could be slowed down); but loved everything else, really ingenious.cshell-may-p4pde-about-bulgaria-00-991-Qg2+-XXXV-bFmN- -iamloved-https://www.youtube.com/watch?v=gWJaxlYRSc0replyicoder 14 hours ago | parent | next [–]Same here, I retried at least ten times if, sometimes stumbling over a copy paste error that got Paul killed, but keeping the chicken alive was the choke point for me. Perhaps it would be allowed to encode part of the url?Also wouldn't url's with roman numbers in it fail the entire thing as 35 only can be obtained by multiplying 5 and 7? Ah right, or 35, true that but still same issue.replymsravi 6 hours ago | prev | next [–]So does this sometimes reach an unsolvable state? I have a captcha whose digits sum up to 24, a condition that all digits should sum up to 25, and the best chess move is Ne6+ (accepted), but there's no way to get all digits to sum to 25!mAy@VpepsiVIIm3588tractSibelgiumNe6+m3588 is the captcha and Ne6+ is the chess move in the aboveI've also tried putting something like -5 in the hope that it recognizes negative numbers, but no luck!replygault8121 6 hours ago | parent | next [–]When you break the captcha rule, you can re-select the captcha. You want to keep re-rolling till you find a low number combo. There are a few rules where you can re-roll to get a better random number. In general, it gets harder and harder to stay under the 25 limit as you progress.replypurpleflame1257 6 hours ago | parent | prev | next [–]You can refresh the captcha to make it work.replyFlamingApe 2 hours ago | prev | next [–]Regarding Rule 24, I found a video by Scott the Woz:https://www.youtube.com/watch?v=Dl4gKdI0J2oreplyleshenka 1 hour ago | parent | next [–]that's also different for everyone. I needed a 12 minutes and 13 seconds videoreplyschemescape 13 hours ago | prev | next [–]Sadly, this is way less annoying than many sites because it doesn’t require submitting the form and losing half the form fields in between attempts.replyfisian 17 hours ago | prev | next [–]I got a (seemingly?) impossible problem:- roman numerals must multiply to 35- my chess move is: Rf7+- Atomic numbers of elements must add up to 200So I need V, VII and Rf7+ in there but then the atomic numbers are way past 200 already.replyGeorgelemental 16 hours ago | parent | next [–]Just use XXXV? No need to do 5 * 7replyneurosage 14 hours ago | root | parent | next [–]it parses the V in XXXV as an element groupreplyzeven7 13 hours ago | root | parent | next [–]But that's not a problem because that leaves you with only V and R which add to 98, so you only need to add some others to get it up to 200.replythemanmaran 17 hours ago | parent | prev | next [–]Same boat. I tried doing some parenthetical math (X-III)(III+II) but it doesn't work.replyamon_raw 13 hours ago | root | parent | next [–]Well I is for Iodine,which has 53 as its atomic number, so this definitely wouldn't work anyways. XXXV is the way around this.replygeluso 17 hours ago | prev | next [–]Your password must be at least 5 characters.Your password must include a number.Your password must include an uppercase letter.Your password must include a special character.The digits in your password must add up to 25.Your password must include a month of the year.Your password must include a roman numeral.Your password must include one of our sponsors:The roman numerals in your password should multiply to 35.Your password must include this CAPTCHA:Your password must include today's Wordle answer.Your password must include a two letter symbol from the periodic table.Your password must include the current phase of the moon as an emoji.Your password must include the name of this country.Your password must include a leap year.Your password must include the best move in algebraic chess notation. (picture of chess puzzle)← This is my chicken Paul. He hasn't hatched yet, please put him in your password and keep him safe.The elements in your password must have atomic numbers that add up to 200.All the vowels in your password must be bolded.Oh no! Your password is on fire. Quick, put it out!Your password is not strong enoughYour password must contain one of the following affirmations:Paul has hatched! Please don't forget to feed him, he eats three every minute.A sacrifice must be made. Pick 2 letters that you will no longer be able to use.Your password must contain twice as many italic characters as bold.At least 30% of your password must be in the Wingdings font.Your password must include this color in hex.All roman numerals must be in Times New Roman.The font size of every digit must be equal to its square.Every instance of the same letter must have a different font size.Your password must include the length of your password.The length of your password must be a prime number.Uhhh let's skip this one.Your password must include the current time.Is this your final password?replycaptainpiggies 15 hours ago | parent | next [–]I would find it hilarious if someone would come up with a password generator that generates passwords that would pass this game.replysquirtlebonflow 14 hours ago | root | parent | next [–]Should be pretty easy, since you can check the generated password against all the criteria. Making it fast might be difficult thoughreplyqt31415926 12 hours ago | root | parent | next [–]I don't think it's easy. Verification is much easier than generating correct solutions for this.Looking at the JS, these rules use RNG such that you can have an inconsistent or impossible password. E.g. if the only youtube video URLs that work with your duration have roman numerals that multiply above 35 in it you are hard stuck. Your youtube URL can also hard stuck your atomic number summation to 200 if it happens to contain enough elements that adds above 200. Your color hex can hard stuck your 25 sum, etc. The code does not try to generate working passwords given all the rules, it simply adds checks and randomly generates the requirement per rule.You'd have to have the RNG rules to align well in order to win i.e. youtube video with no roman numerals or numbers or elements, captcha with no numbers or roman numerals or elements, to minimize conflict.replygcoakes 5 hours ago | root | parent | next [–]I wonder if something like quickcheck could be used to randomly generate characters which pass the criteria. I don't know how it would handle Paul though...replyXCSme 10 hours ago | root | parent | prev | next [–]Well, you could always upload your own YouTube video...Make the generator use Pupetter and your YT credentials to upload an empty mp4 video of the given length.replyWashuu 4 hours ago | root | parent | next [–]I uploaded a video quick just to pass that step since the length was hard to find. The generated video ID was a bunch of Roman numerals so I was totally fucked.replyXCSme 21 minutes ago | root | parent | next [–]Re-upload until you get a good IDreplyvezuchyy 7 hours ago | parent | prev | next [–]I almost overturned my table when Paul didn't survive the fire. No way I'll play again!replyvezuchyy 7 hours ago | root | parent | next [–]I played again and fcking Paul overatereplyjoshgel 10 hours ago | parent | prev | next [–]I threw this into ChatGPT and got a lot of the way there in one shot. Then had to go back and add in some stuff like the wordle answer and captchas…replyhiergiltdiestfu 1 hour ago | prev | next [–]today's wordle contains a C, but the game doesn't know about roman numeral fractions :(replyghayes 1 hour ago | parent | next [–]Type it in lowercase and it won't count against the Roman numerals.replyoxguy3 12 hours ago | prev | next [–]I spent forever trying to find a YouTube video that was precisely 16m18s, and when I finally did, the video ID included periodic elements and Roman numerals that broke my earlier rules, and I gave up. Fun game though!replynabakin 12 hours ago | parent | next [–]I'll copy a comment I made earlier:\"00:00 / <minutes>:<seconds>\" youtubeGoogle that, including the quotes, replace the minutes and seconds with your given time, then look through the results and find a URL which fits the password criteria.Every result should be a video with that duration. If it isn't, check your useragent. I noticed some weirdness with that.replyquantumsequoia 4 hours ago | root | parent | next [–]Can you give an example? \"replace the minute and seconds\" is vague. Do you mean replace the words \"minute\" and \"second\"? Or just the numbers? Do you remove the brackets too?replyLanrei 1 hour ago | root | parent | next [–]Seems pretty self-explanatory:> site:youtube.com \"00:00 / 16:18\"Or you know you could just try to work it out for yourself.replysixstringtheory 15 hours ago | prev | next [–]neal.fun and ciechanow.ski are vying for the number 1 spot on my list of HN auto-upvote submission hostsreplylycos 18 hours ago | prev | next [–]I gave up after having to include a leap year (Rule 15), I don't know if this is a spoiler but I ended up with January99Pepsi?XXXVggd7maboutZrJapan (there was an emoji in there for the current moon phase but HN stripped it out)Looking at the code it should be possible to get a lot further, in theory. Wonder how Paul is doing!replycaddy 1 hour ago | parent | next [–]Spoiler: You can save a couple characters by using PepSi (Pepsi + Silicon) which answers 2 requests.replysltkr 18 hours ago | parent | prev | next [–]The country is randomized; mine was Albania (that was NOT easy to figure out!)replylycos 18 hours ago | root | parent | next [–]I saw a hot spring and got a very lucky guess, I can imagine there are a lot of hard ones in there yeah!replydanuker 17 hours ago | root | parent | prev | next [–]My country was El Salvador. I would not have guessed it (I kept trying equatorial countries). I had to reverse engineer the URL encoding of the embedded map.Spoiler: There is !1d and !2d, followed by coordinates.replyhgsgm 17 hours ago | root | parent | prev | next [–]Google a street name.replyicoder 14 hours ago | root | parent | next [–]If it lands on a street it lets you roam around, but others only let you look and zoom around, they are harder if not impossible for mere mortals.replyiso1631 13 hours ago | root | parent | prev | next [–]I had albania which was easy -- there was a nearby poster with some writing on, and a short ddg led to albanian sites.replyjameshart 15 hours ago | parent | prev | next [–]2000 was a leap year and it doesn’t screw with your numeric total too badly :)replyTomK32 15 hours ago | parent | prev | next [–]leap year? what? I guess I had passed that by accident, 4 and 8 were leap years I guess?replySymbiote 15 hours ago | parent | prev | next [–]8 AD was a leap year.replyicoder 14 hours ago | root | parent | next [–]so where 0 and 4 ;)replywizofaus 13 hours ago | root | parent | next [–]Debatable - the concept of leap years was invented before 0 AD/CE but I'm not aware of any reason to believe that particular year (which certainly wasn't called 0 AD at the time, it was possibly the Roman year 753) was considered to be one.replySymbiote 13 hours ago | root | parent | next [–]0 isn't a year anyway, 1AD is preceded by 1BC.Wikipedia has some information on leap years around this time: https://en.wikipedia.org/wiki/Julian_calendar#Leap_year_erro...replywizofaus 11 hours ago | root | parent | next [–]Interesting that there seem to be a large number of scholars who would accept either 4 AD or 8 AD was the first AD leap year. But less clear what such a year would have been called by Romans at the time. I'm assuming it wasn't common to include full dates (including the year #) on written documents at the time, otherwise surely we'd know pretty much exactly. I gather AD-based year numbering wasn't actually introduced until ~525 AD (but before that a number of systems had been in use).replyjohtso 18 hours ago | prev | next [–]I keep getting illegal move on the chess problem.. although my move is not illegal. [Variant \"From Position\"] [FEN \"3k4/1p3Bp1/p5r1/8/P3P1N1/5Pp1/1P1r4/2R4K b - - 0 1\"]  1... Rgd6When I put Rgd6 I get \"d6 (Illegal move)\"replyshawabawa3 17 hours ago | parent | next [–]I'm not sure if this is your problem, but you have to include captures (x), check (+) and checkmate (#) if applicablereplyhgsgm 17 hours ago | parent | prev | next [–]Try Rd6 or Rd6+ for check.replyicoder 14 hours ago | root | parent | next [–]Or Rd6++ for check matereplyPOOWHILERUNNING 11 hours ago | prev | next [–]This was fun until I reached the time-sensitive rulesreplymadcaptenor 15 hours ago | prev | next [–]Gave up at the YouTube video. My final password:cmabout[gibbous emoji]swedenQf8+[chicken emoji]Tir8gecmVshellapril9Fe[weightlifter][weightlifter][weightlifter]VIIamloved[caterpillar][caterpillar][caterpillar][caterpillar]replynabakin 11 hours ago | parent | next [–]Should help https://news.ycombinator.com/item?id=36499194replyanthony_romeo 14 hours ago | prev | next [–]Fun!But I wasn’t able to finish: I got a captcha with digits 5, 3, 7, and 8. When the chessboard appeared, the best move was Qe6. These conflicted with the rule to have all digits sum to 25 (5+3+7+8+6=29).replypstadler 14 hours ago | parent | next [–]You can re-roll the captcha.replydudinax 4 hours ago | prev | next [–]Password wouldn't recognize chess moves on row 7 or 8, and the best move was on row 7!replylazylion2 2 hours ago | prev | next [–]The fire part took me by surprise, RIP PaulreplyQuiza12 9 hours ago | prev | next [–]This is great! I built a very similar thing a while ago - https://www.funnypasswordchecker.com/ Definitely not in the same league but it was a lot of fun!replywell_actulily 16 hours ago | prev | next [–]I overfed Paul :(111about[weightlifter][dead paul][worm][worm][weightlifter]VIIamlovednovemberen4n41E2111shellV[weightlifter][weightlifter][worm][worm][worm][worm][worm][worm][worm][worm][worm][worm][worm][worm][worm]replyjbombadil 16 hours ago | prev | next [–]Well. I got stuck.Rule 9: The Roman numerals in your password should multiply to 35 Rule 14: Name this country (Malasysia for me)Given that M=1000 in roman numerals, I need to find x such that x*1000=35How do I write 0.035 in Roman Numerals?!replypimlottc 16 hours ago | parent | next [–]Change it to “malaysia”. It accepts lowercase for country name and only recognizes uppercase as Roman numerals.replybandrami 16 hours ago | parent | prev | next [–]ƧƧ is a decent approximation (that's two backwards capital S glyphs, if it doesn't render)replyWatchDog 8 hours ago | prev | next [–]Here are some leap year digit tallies[0], which might help a few people.[0]: https://pastebin.com/hNVR2MG6replysashank_1509 15 hours ago | prev | next [–]Lost at Paul was over fed. Took so much effort to make atomic numbers sum upto 200 while ensuring Roman Numerals multiply to 35. Smhreplysaikaushik 15 hours ago | parent | next [–]What's the chess puzzle? Q×h6+ is not working for me?replysashank_1509 14 hours ago | root | parent | next [–]Everyone gets a different puzzlereplylrvick 15 hours ago | prev | next [–]This is now my new favorite way to explain to people that passwords should not exist. Long live FIDO2 and passkeys.replychme 15 hours ago | parent | next [–]I don't think passwords will be replaced. This is more of a demonstration of over complicated password rules, than against passwords itself.Hardware and biometric keys can be stolen, cloned and lost. And trusting third-parties with keys to harddrive encryption is also not really trustworthy.replylrvick 12 hours ago | root | parent | next [–]1. You can have multiple hardware keys or devices bound to an account as a backup of for ease of use.2. Passkeys allow you to pick a backup solution of your choosing. Could be your own nextcloud server in the corner. This is no different than giving someone a choice of cloud-synced password managerBoth solutions avoid phishing, password re-use, keylogging, or people picking weak passwords.There is no excuse for anyone even supporting passwords at this point. Sysadmins have not commonly used passwords for ssh in 20 years, favoring private keys on either hardware or encrypted disks. Keys better than passwords-over-the-wire in every way.replychme 3 hours ago | root | parent | next [–]> 1. You can have multiple hardware keys or devices bound to an account as a backup of for ease of use.How does that help if someone steals your hardware key, login in with it and then puts it back. You don't even know that it was stolen and your account was messed with. With a good password you know if you tell someone. Granted people could film you typing your password, but stealing your hardware key is much easier.> 2. Passkeys allow you to pick a backup solution of your choosing. Could be your own nextcloud server in the corner. This is no different than giving someone a choice of cloud-synced password managerThis isn't about backup, but trust. Do I trust a third-party to manage the keys to my kingdom? No. And even if, the third-party is a much easier target for 3 letter agencies, governments or other rich/influential bad actors. Also I haven't seen a solution where passkey can be used to decrypt my LUKS partition.> There is no excuse for anyone even supporting passwords at this point. Sysadmins have not commonly used passwords for ssh in 20 years, favoring private keys on either hardware or encrypted disks. Keys better than passwords-over-the-wire in every way.The encrypted disks are hopefully protected with a password, and not magically unencrypted, just by booting it with the right TPM configuration. The hardware hopefully requires a pin or password in order to unlock the SSH key, and the SSH key on disk is hopefully encrypted with a password as well.replylrvick 1 hour ago | root | parent | next [–]1. If they have the access to steal your hardware key then they also probably have access to replace your usb charging cable with a malicious one, or install a keylogger on your system, or place a microphone or camera near you for acoustic or optical keylogging. All ways your password could be stolen without you knowing. If your yubikey is stolen at least you find out fast and could warn your IT manager to lock you out. Still, 99.999% of all threats are online, and for the rare few that have physical theft of keys in their threat model, then you have the option to set a pin on your yubikey with a 3 try lockout. Or you can use touchid, or another platform authenticator built into your laptop. If they can steal your unlocked laptop, then neither passwords or passkeys are going to help so this is moot.2. Fido2 lets you decide who to trust. A non technical user can use google or apple or a hosted nextcloud instance as a backup. A technical user is more likely to enroll the TEEs built into their phones and laptops, with a yubikey in a safety deposit box as a backup.Passkeys and FIDO2 offer a massive reduction in attack surface and are superior to passwords in every way for every threat model I have ever heard of.You have all the same options for managing a fido2/passkey/webauthn key as you do an ssh key.Web passwords should go die in the same fire as SMS 2FA.replychme 1 hour ago | root | parent | next [–]> 1. If they have the access to steal your hardware key then they also probably have access to replace your usb charging cable with a malicious one, or install a keylogger on your system, or place a microphone or camera near you for acoustic or optical keylogging. All ways your password could be stolen without you knowing. If your yubikey is stolen at least you find out fast and could warn your IT manager to lock you out. Still, 99.999% of all threats are online, and for the rare few that have physical theft of keys in their threat model, then you have the option to set a pin on your yubikey with a 3 try lockout. Or you can use touchid, or another platform authenticator built into your laptop. If they can steal your unlocked laptop, then neither passwords or passkeys are going to help so this is moot.You are jumping around various attack scenarios to make your point. If your child steals your hardware token to shop on amazon and then put it back afterwards is a different and much more likely scenario then some targeted attack by some hacker that is prepared and breaks into your home...Most online threads are about social engineering, where the person that is attacked actually cooperates with the attacker, AFAIK there is no safeguard against that, other than not trusting people with their own stuff.I would worry more about someone stealing a locked laptop. If there is no password (or other kind of knowleged based protection), then they have everything they need to unlock it.> Web passwords should go die in the same fire as SMS 2FA.So since you limited your argument now to just Web passwords. Does that mean you agree with me that you don't think there is a good solution to replace passwords for encryption or local authentication that works offline and doesn't move the trust away from the user?replycaddy 1 hour ago | root | parent | prev | next [–]If using it as a security key (with a password) you don't need to give the device anything but a tap usually.However, if you use a Yubikey or Trezor for example as a Passkey (No Password), you have to enter a pin on either (Yubikey via OS and Trezor on device) before they will fulfil the request and log you in.replychme 1 hour ago | root | parent | next [–]> However, if you use a Yubikey or Trezor for example as a Passkey (No Password), you have to enter a pin on either (Yubikey via OS and Trezor on device) before they will fulfil the request and log you in.Personally I consider a PIN, password or passphrase the same thing, just different rules. It is security based on knowledge. So If I enter a PIN somewhere it is still a password. IMO this is fine.replycaptn3m0 16 hours ago | prev | next [–]I got a \"Paul has been slain\" message, when I deleted half my password to debug something. Weird.Got to the vowel capitalization.replyjameshart 15 hours ago | parent | next [–]Paul is the chickenreplyTomK32 15 hours ago | parent | prev | next [–]It's not capitalization, it's about selecting the characters and pressing the \"bold\" button.replyicoder 14 hours ago | root | parent | next [–]Or just ctrl-a + ctrl-breplyusername923409 13 hours ago | prev | next [–]Funny game, but it seemed to break for me when trying to find a YouTube video of length 4:55. I entered multiple videos of lengths 4:54, 4:55, and 4:56, all while keeping Paul fed, but none of them satisfied the requirement somehow.replyhkab 6 hours ago | prev | next [–]Lost at Rule 24. Really shouldn't ignore the 1 minutes feed notice ^^ Fun game btw.replyadotbacon 6 hours ago | parent | next [–]Lost there too doing the opposite... I tried to get ahead of 3 per minute by creating a nice stockpile. Dead from overfeeding.replyjoestrong 10 hours ago | prev | next [–]I started this just before midnight, and once I got to the wordle question it didn't work. Possibly because the wordle had changed since starting the password gamereplymeetpateltech 18 hours ago | prev | next [–]All rules in this game!1. Your password must be at least 5 characters.2. Your password must include a number.3. Your password must include an uppercase letter.4. Your password must include a special character.5. The digits in your password must add up to 25.6. Your password must include a month of the year.7. Your password must include a roman numeral.8. Your password must include one of our sponsors. (pepsi/starbucks/shell)9. The roman numerals in your password should multiply to 35.10. Your password must include this CAPTCHA:11. Your password must include today's Wordle answer.12. Your password must include a two letter symbol from the periodic table.13. Your password must include the current phase of the moon as an emoji.14. Your password must include the name of this country.15. Your password must include a leap year.16. Your password must include the best move in [algebraic chess notation].17. ← This is my chicken Paul. He hasn't hatched yet, please put him in your password and keep him safe.18. The elements in your password must have atomic numbers that add up to 200.19. All the vowels in your password must be bolded.20. Oh no! Your password is on fire. Quick, put it out!21. Your password is not strong enough22. Your password must contain one of the following affirmations: (i am loved, i am worthy, i am enough)23. Paul has hatched! Please don't forget to feed him, he eats three every minute.24. Your password must include the URL of a <random> long YouTube video.25. A sacrifice must be made. Pick 2 letters that you will no longer be able to use.26. Your password must contain twice as many italic characters as bold.27. At least 30% of your password must be in the Wingdings font. 28. Your password must include this color in hex.29. All roman numerals must be in Times New Roman.30. The font size of every digit must be equal to its square.31. Every instance of the same letter must have a different font size.32. Your password must include the length of your password.33. The length of your password must be a prime number.34. Uhhh let's skip this one.35. Your password must include the current time.36. Is this your final password?replyPannoniae 18 hours ago | parent | next [–]You can't pass 36. Just saying.replyYellOh 16 hours ago | root | parent | next [–]Honestly not sure how you'd pass the youtube one, unless you were incredibly luckyreplyTomK32 15 hours ago | root | parent | next [–]I found one by the United Nations. In the meanwhile Paul starved to death.replyPannoniae 16 hours ago | root | parent | prev | next [–]by searching for the length in your favourite search engine :)replyYellOh 16 hours ago | root | parent | next [–]There doesn't seem to be a way to search YT videos (except videos you yourself post) by exact length. I got 21 min 45 seconds. Looking up \"3000 second timer\" on YT got me close (only 4 seconds out), but not exact. Do you have a way to find exact-length videos that I'm missing?replySymbiote 15 hours ago | root | parent | next [–]I found exactly the video I needed by searching \"38 minute video\" and one of the \"timers\" was the required 37m58s, but Paul died just as I found it.replyiso1631 13 hours ago | root | parent | next [–]It would have likely screwed up your previous answers -- roman numerals etc.replynabakin 11 hours ago | root | parent | prev | next [–]I figured out a way to get a list of videos all matching the time you want. Should help. https://news.ycombinator.com/item?id=36499194replyroflyear 15 hours ago | root | parent | prev | next [–]I think you just have to search for it and hope for the best, my query got me this video which is hilarious: https://www.youtube.com/watch?v=RRoUEr1l0n8replyraldi 15 hours ago | parent | prev | next [–]And then what happens after 36?replyj0057 13 hours ago | prev | next [–]This just goes to show how wise it was to write a script for cheating on Wordle.replycaptainpiggies 15 hours ago | prev | next [–]This game is great! Even though I will need to catch up with whatever was happening in my class for the last 2 hours, I thoroughly enjoyed my time and the fact that I have no idea what the professor is talking about is a sign of how engaged I was.reply122 more comments...Guidelines | FAQ | Lists | API | Security | Legal | Apply to YC | ContactSearch:",
    "hn_summary": "- \"The Password Game\" is a fun and challenging online game that tests your ability to create a password that meets a series of specific requirements.\n- The game includes various rules, such as including specific characters, numbers, uppercase letters, and special symbols in the password, as well as meeting certain conditions, like the digits adding up to a specific number or including the current phase of the moon as an emoji.\n- The game incorporates elements of chess, geography, and other puzzles, keeping players engaged and entertained as they navigate through the different challenges.\n- Users may encounter obstacles, such as the need to find a specific YouTube video length or decipher a random captcha, adding an extra level of difficulty to the game.\n- Some players have reported getting stuck at certain points due to conflicting rules or challenging conditions, but the game's randomization ensures that each playthrough is unique and presents new challenges.\n- Overall, \"The Password Game\" offers an entertaining experience that encourages players to think creatively and strategize when creating passwords, while also highlighting the complexity and potential pitfalls of password requirements commonly used in the real world."
  },
  {
    "id": 36492329,
    "timestamp": 1687872090,
    "title": "Outlook now ignores Windows' Default Browser & opens links in Edge by default",
    "url": "https://support.microsoft.com/en-us/topic/outlook-emails-open-next-to-web-links-in-microsoft-edge-b0e1a1c1-bd62-462c-9ed5-5938b9c649f0",
    "hn_url": "http://news.ycombinator.com/item?id=36492329",
    "content": "Microsoft is always striving to improve and streamline our product experiences—offering a new way to use the classic Microsoft Outlook app on Windows and the Microsoft Edge web browser. If you have a Microsoft 365 Personal or Family subscription, browser links from the Outlook app will open in Microsoft Edge by default, right alongside the email they’re from in the Microsoft Edge sidebar pane. This allows you to easily access, read, and respond to the message using your matching authenticated profile. No more disruptive switching—just your email and the web content you need to reference, in a single, side-by-side view. And we're always optimizing the sidebar in Microsoft Edge to give you useful content and tools while you're browsing so you don't have to toggle back and forth between windows or even other tabs—whether you’re shopping online or working in a Microsoft 365 web app.In the future, links from your Microsoft Teams messages will also open in Microsoft Edge by default to help you stay engaged in conversations as you browse the web. Learn more about multitasking smarter with Microsoft 365 and Edge.Ultimately though, if this experience isn't right for you, you can turn off this feature the first time it launches in Microsoft Edge, and then in Outlook settings at any time after that. Note: If you’re an IT administrator looking to manage this feature for your organization, see View emails and web links side-by-side with Outlook and Microsoft Edge. FAQWhy is Microsoft making this change?Will this replace my default browser setting in Windows?I want to open links with the browser set as the default in Windows Settings.  How do I do that? Will this change affect me if I’m using a Mac? Does this functionality work for all email accounts?How can I stop my email from auto-opening in the Microsoft Edge sidebar pane?How can I remove the Outlook app icon from the Microsoft Edge sidebar? How can I set Microsoft Edge as my Windows default browser? Send us feedbackPlease let us know what you think about the new experience in one of two ways: In Microsoft Edge, go to Settings and more  > Help and feedback > Send feedback. Follow the on-screen instructions and select Send.Press Alt + Shift + I on your keyboard. Follow the on-screen instructions and select Send.Related topics Learn more about staying in your flow with Microsoft 365 and Microsoft Edge",
    "summary": "- Microsoft Outlook now opens browser links in Microsoft Edge by default for users with Microsoft 365 Personal or Family subscriptions.\n- This integration allows users to easily access and respond to emails and web content in a side-by-side view.\n- Users have the option to turn off this feature if it doesn't suit their preferences.",
    "hn_title": "Outlook now ignores Windows' Default Browser and opens links in Edge by default",
    "original_title": "Outlook now ignores Windows' Default Browser and opens links in Edge by default",
    "score": 837,
    "hn_content": "- Outlook now opens links in Edge by default, ignoring the user's default browser in Windows.\n- Some users have noticed similar behavior from other companies, such as Apple and Google, in their attempts to drive users towards their own products.\n- Apple's decisions, such as battery throttling and the color scheme for iMessages, have sparked discussions about whether they are anti-consumer.\n- Some users have experienced issues with the visibility of messages in Apple's Messages app.\n- The use of AirPods with Apple products provides a seamless and integrated experience, but this is not always the case for other Bluetooth headphones on Windows devices.\n- Linux is seen as a more respectful operating system by some users.\n- Apple's decision to not implement RCS (Rich Communication Services) has been controversial, particularly for users who want more advanced messaging features.\n- The color of iMessage bubbles has been a topic of discussion, with some users finding the green color difficult to read.\n- Concerns have been raised about the accessibility and contrast of certain colors in iMessage.\n- Apple's stance on iMessage on Android has been a point of controversy.\n- The color of SMS messages on iPhones has been a long-standing debate, with some users finding the neon green difficult to read.\n- Apple's messaging practices have been criticized for being anti-consumer.\n- The contrast ratio of SMS and iMessage backgrounds has changed over the years, affecting legibility.\n- Apple has been called out for not following its own accessibility guidelines for messaging.\n- Google has also faced criticism for its handling of message colors and browser defaults.\n- Users have different opinions on the legibility and contrast of message colors.\n- Apple's use of color in messages has been a point of contention, with some users finding certain shades of green difficult to read.\n- Users have suggested implementing more accessible modes or options to adjust message colors.\n- Apple's implementation of color in messages has received mixed feedback, with some users finding it legible and others finding it difficult to read.\n- Apple's use of established standards and protocols has been debated, with some arguing that they fall just within the boundaries of acceptability.\n- The way that Apple pairs AirPods with devices has been praised for its seamless integration across platforms.\n- Apple's pairing process for AirPods offers a smooth and convenient user experience.\n- Bluetooth headphones work differently from AirPods, as they need to be manually paired with devices.\n- Some users prefer the seamless integration of AirPods, while others find Bluetooth headphones to be sufficient.\n- The integration of AirPods across Apple devices has been praised, with seamless switching between devices.\n- The ease of pairing and switching between devices sets AirPods apart from regular Bluetooth headphones.\n- Apple has implemented unique OS-level integrations for AirPods, such as automatic switching between devices and pairing with an Apple ID.\n- Third-party Bluetooth headphones can be connected to multiple devices but may require manual switching.\n- AirPods offer unique features, such as seamless switching between devices and automatic pairing with nearby Apple devices.\n- The ease of switching between Apple devices with AirPods has been hailed as a useful feature.\n- The way that AirPods integrate with Apple products offers unique benefits for users, including seamless switching between devices.\n- Apple's unique integration of AirPods with its devices has been commended by some users.\n- The debate over AirPods vs. regular Bluetooth headphones continues, with arguments about the benefits of each.\n- Apple's integration of AirPods with its devices offers a seamless user experience.\n- The ease of switching between devices using AirPods has been praised by users.\n- The integration of Apple's AirPods with its devices has provided a seamless user experience across platforms.- Users are frustrated with Microsoft's decision to force the use of Microsoft Edge in Outlook.\n- Some users are concerned about the amount of data that Microsoft collects from Outlook and Office.\n- Microsoft claims that users have the option to turn off the feature that automatically launches Edge, but some users are skeptical that it will stay turned off after an upgrade.\n- There are discussions about the lack of user control over the software they use and the dominance of certain companies in the tech industry.\n- Linux and open source software are mentioned as alternatives that can provide more competitive market options and better user control.\n\nThe most important thing people should know about this post is that Microsoft's decision to force the use of Microsoft Edge in Outlook has angered users, who feel that it infringes on their control over the software they use. Additionally, concerns about data privacy and the dominance of certain companies in the tech industry are raised. Users are looking for alternatives, such as Linux and open source software, that can provide more choice and control.",
    "hn_summary": "- Outlook now opens links in Edge by default, disregarding the user's default browser in Windows.\n- Users are frustrated with Microsoft's decision, feeling that it infringes on their control over the software they use.\n- Concerns about data privacy and the dominance of certain companies in the tech industry are raised, leading to discussions about alternatives such as Linux and open source software."
  },
  {
    "id": 36492010,
    "timestamp": 1687870157,
    "title": "FedEx Accused of Largest Odometer Rollback Fraud in History with Used Vans",
    "url": "https://www.thedrive.com/news/fedex-accused-of-largest-odometer-rollback-fraud-in-history-with-used-vans",
    "hn_url": "http://news.ycombinator.com/item?id=36492010",
    "content": "NewsFedEx Accused of Largest Odometer Rollback Fraud in History With Used VansFedEx allegedly replaced odometers on used vans and intentionally sold them with inaccurate mileage.BYNICO DEMATTIA|PUBLISHED JUN 25, 2023 1:10 PM EDTNEWSvia Getty Images.SHARENICO DEMATTIAView Nico Demattia'S ArticlesNicoDeMattiaOnce FedEx vans reach the end of their package-delivering lives, they're resold and repurposed for various purposes. Many of them are turned into food trucks, as their size and boxy shape are perfect for mobile kitchens. However, FedEx is facing a lawsuit for selling such vans, as it's being accused of the largest odometer rollback fraud in history.The lawsuit accuses FedEx of replacing the odometers in many of its vans with new ones that read zero miles, using the vans for a bit longer after that, and then selling them at auction with 100,000 miles or less on the new odometers. With such low indicated mileage, business owners were buying the vans for top dollar, thinking that there were still pretty fresh. However, their real mileage was sometimes as much as four times the odometer readout, thus leading to countless mechanical issues that would cost the customers far more money. In some cases, the issues would be so severe, the vans were useless and businesses went bust.According to KTNV Las Vegas, Tom Layton of Henderson, Nevada first noticed FedEx's odometer rollbacks in 2017. Layton, who's been buying and selling trucks and vans for 36 years, bought a FedEx Freightliner truck with around 180,000 indicated miles. When he sold the truck, his buyer hooked it up to a computer that told them the real mileage was around 400,000 miles. Layton filed his own lawsuit back then, which is separate from the class-action lawsuit FedEx is currently facing.Since then, customers from California, Tennessee, New Jersey, Florida, and Virginia have all noticed odometer rollbacks on former FedEx vehicles.Freightliner MT45 | via Getty ImagesFedEx didn't always sell its retired vans. Once they hit about 350,000 miles, they would usually scrap the vans. It wasn't until 2011 that FedEx started auctioning old vans off through its fleet company, Holman Fleet Leasing (also a defendant in the lawsuit). The lawsuit alleges that both FedEx and Holman intentionally replaced the odometers to artificially inflate the values of the vans, so they'd sell for higher prices at various auctions throughout the United States. Then, according to the accusations, both companies would split the profits.\"FedEx, with the knowledge and assistance of Holman, replaced thousands of odometers on FedEx/Holman Vehicles,\" the lawsuit states. \"Though odometers, as automotive components, do occasionally wear out or malfunction and need to be replaced, there was no valid reason for this large-scale replacement of the odometers on FedEx/Holman Vehicles, other than to perpetuate their agreement to commit odometer fraud.\"It isn't illegal to replace odometers and it isn't even illegal to sell vehicles with odometers that have inaccurate mileage readouts. However, to do so, a disclaimer needs to be made by the seller, indicating to the buyer that its mileage readout is inaccurate and that the odometer was replaced. According to the lawsuit, neither FedEx nor Holman did that.\"Defendants purposely failed or refused to attach such a warning because they intended to mislead potential buyers of the vehicles.\"However, FedEx denies the allegations. “We are aware of the allegations made in the complaint and will vigorously defend the lawsuit,” a FedEx representative told Spectrum News.The Drive reached out to FedEx for a comment and will update this statement if we get one.show_multidocs-1.pdfDOWNLOADGot tips? Send 'em tips@thedrive.com",
    "summary": "- FedEx is being accused of engaging in the largest odometer rollback fraud in history by replacing odometers on used vans and selling them with inaccurate mileage.\n- The lawsuit alleges that FedEx and its fleet company, Holman Fleet Leasing, intentionally replaced the odometers to artificially increase the value of the vans and sell them for higher prices at auctions throughout the United States.\n- The real mileage of the vans was sometimes four times higher than what was indicated on the new odometers, leading to mechanical issues and financial losses for the buyers. FedEx denies the allegations and plans to vigorously defend the lawsuit.",
    "hn_title": "FedEx Accused of Largest Odometer Rollback Fraud in History with Used Vans",
    "original_title": "FedEx Accused of Largest Odometer Rollback Fraud in History with Used Vans",
    "score": 471,
    "hn_content": "- FedEx is facing accusations of engaging in odometer rollback fraud with its used vans, according to a class-action lawsuit.\n- Skepticism is encouraged towards the allegations, as they are based on a complaint from class-action lawyers who are known for spinning stories.\n- The accused fraud may have been carried out by individuals at a non-executive level who were directly responsible for resale.\n- Executives who risk committing fraud for minimal financial gain are unlikely due to the high stakes involved.\n- The article suggests that the case is less black and white than it appears, and if fraud did occur, it was probably done by individuals at a lower level.\n- Some examples of corporate fraud, such as the VW emissions scandal, were exceptions, not the norm.\n- Lawsuits should be viewed with skepticism as they often amplify sensationalism.\n- It is important to await additional evidence before making conclusions about the accuracy of the claims. \n- The accuracy of the allegations is yet to be confirmed, and it is possible that another party, not FedEx, is responsible for the fraud.- FedEx is facing a class-action lawsuit accusing them of replacing the odometers in their delivery vans to inflate their values before selling them at auctions.\n- The lawsuit alleges that FedEx and Holman Fleet Leasing, their fleet company, intentionally replaced the odometers to sell the vans for higher prices.\n- One plaintiff noticed the fraud when the actual mileage was revealed to be significantly higher than the indicated mileage.\n- The allegations claim that FedEx and Holman continued to sell these vans despite being aware of the fraud.\n- Fleet vehicles like these often have high mileage, so the accusations of tampering with odometers raise questions about the integrity of the sales.\n- Both companies deny the allegations, and the lawsuit is ongoing.",
    "hn_summary": "- FedEx is facing a class-action lawsuit accusing them of engaging in odometer rollback fraud with their used vans, which involved replacing the odometers to inflate their values before selling them at auctions.\n- Skepticism is encouraged towards the allegations, as they are based on a complaint from class-action lawyers known for spinning stories and the accused fraud may have been carried out by individuals at a non-executive level.\n- It is important to await additional evidence before making conclusions about the accuracy of the claims, as the lawsuit is ongoing and both companies deny the allegations."
  },
  {
    "id": 36499905,
    "timestamp": 1687906941,
    "title": "The hidden cost of air quality monitoring",
    "url": "https://www.airgradient.com/blog/hidden-costs-of-air-quality-monitoring/",
    "hn_url": "http://news.ycombinator.com/item?id=36499905",
    "content": "We use cookies on this website to give you the best experience. To find out more, read our privacy policy.Accept & CloseMonitors & KitsCustom SolutionsOpen AirGradientSupportResearchShopThe Hidden Cost of Air Quality Monitoringby Achim HaugOver the last few months, one of the largest air quality monitoring manufacturer in the world has increasingly crippled their free data plan to the point that their free API does basically no longer work and forces people to upgrade to a paid plan. This has been done in a very opaque way creating confusion for their customers.Unfortunately we do observe this worrying trend among a number of manufacturers in the industry and want to highlight the various invisible costs of owning an air quality monitor. Often customers believe that the costs of an air quality monitor are only two parts, the initial hardware costs and possibly a subscription to the data platform. However there are a number of ways that some monitor manufacturers deploy to increase your costs of ownership considerably which I will highlight in the following.Proprietory Sensor ModulesNearly all of the air quality monitors in the price range up to around USD 1000 use of-the-shelf sensor modules from companies like SenseAir, Plantower and Sensirion. These sensor modules (in higher quantities) typically cost between USD 2 and USD 15. Some of these modules have a limited lifetime and need to be replaced every 2-3 years. Although it would be very easy to replace these modules directly, a number of companies are now packaging these modules into small proprietary cartridges and are selling these for up to ten times the underlying module cost. Thus preventing the customers from sourcing the same module much cheaper. Furthermore, their dashboard will display a message to purchase replacement cartridges often when these modules are still very accurate and could be used for a much longer time.Ecosystem Lock InIt appears that some sensor manufacturers have a strong desire to force people into subscriptions and this is sometimes even a metric mentioned in their annual reports. The problem is that this will lead directly to a lock-in into the manufacturers ecosystem and these companies have no intention to allow the monitor to directly send data to another server, e.g. home assistant through MQTT. Sometimes this even leads to totally functioning monitors being sunsetted because the company does not want to support an older API anymore.Life-time of the Monitor and RepairabilityIt is very easy to design an air quality monitor for repairability and a long life. We know this because we designed our monitor AirGradient ONE and our open source DIY kits with exactly this paradigm. However, even though a long life time of products is really beneficial for our planet and the owners of the monitors, it might not maximize the profit of companies (at least in the short term). So unfortunately many air quality monitors break after only a few years of service and are often difficult or even impossible to repair because the manufacturers think it’s not in their interest.Data OwnershipAir quality data - especially outdoor data - can be monetized in different ways. Some companies sell air quality data to governments or make them available as (paid) API e.g. for weather apps. Others use the data in their online pollution maps to advertise their own products. The terms and conditions of who actually owns the air quality data from your sensor are often vague. It is quite paradox that one of the most popular outdoor air quality sensor for citizen science projects has actually in their T&Cs that you do NOT own the very data you collect. Unfortunately, many customers do not read the terms and conditions and are not aware of this. We strongly believe that air quality data should belong to the ones who own the monitors and not the manufacturer. We also strongly encourage people to share their outdoor air quality data with the public through open data repositories like openAQ.Leading By ExampleBeing a self-funded startup, we are not dependent on VCs pushing for maximum growth and profitability but can set our own priorities. The small team behind AirGradient has a strong belief that we do the right thing by focusing on sustainability and honesty to our customers and we do hope that this will pay off over the long run. We also really enjoy the great community that is growing day by day and supporting us and our open source, open hardware air quality monitors. We do hope we can set an example that other monitor manufacturers will follow.The Questions You Should AskNow in case you are in search for a new air quality monitor, here is a list of questions you should ask to get a better understanding of the issues I mentioned above:Do you have a subscription free way to send data directly to my own servers, eg. To home assistant via MQTT?Do I, as the owner of the monitor, have the full ownership of the data that I collect?Do you monetize the data that I provide to your platform?Do you share the air quality data with a public non-profit repository like openAQ for common good?Is your monitor easy to repair? Do you have a maintenance / repair manual?Do you offer spare parts for the monitor? At what cost and for how long?Drop us a line and let us know your experiences with air quality monitors!AirGradient DIY Air Quality KitsBuild your own open source air quality sensor measuring PM2.5, CO2, TVOC, Temperature and Humidity. Easy to build, accurate and affordable!Learn MorePrivacy Policy Terms and Conditions About (CSR) API Dashboard Resources Shop For Schools For Offices Outdoor Blog© AirGradient Co. Ltd.",
    "summary": "- Some air quality monitor manufacturers are increasing hidden costs for customers, such as expensive proprietary sensor modules and lock-in to their ecosystem.\n- Many air quality monitors have a short lifespan and are difficult to repair, prioritizing short-term profit over product longevity.\n- Data ownership and monetization practices are often unclear, with some companies claiming ownership of the data collected by their monitors.",
    "hn_title": "The hidden cost of air quality monitoring",
    "original_title": "The hidden cost of air quality monitoring",
    "score": 414,
    "hn_content": "- AirGradient is a company focused on affordable air quality monitoring.\n- They believe that air quality monitoring should be accessible to people in poorer regions and countries.\n- AirGradient open-sourced their air quality designs and are working with NGOs and universities to bring low-cost monitoring to underserved communities.\n- The company operates under the mantra \"Impact first (and profit will follow if we do a good job).\"\n- They are currently running a global co-location test program and seeking additional partners in air quality research.\n- Users are giving positive feedback on the quality and assembly of AirGradient air quality monitors.\n- There are alternative options for monitoring air quality, such as DIY kits and other commercially available devices like the Bosch BME680 sensor.\n- The community discusses the potential impact of air quality sensors on personal health and environmental awareness.\n- There are concerns about the cost of installing air quality sensors on rooftops and the availability of transparent information.\n- Users mention the importance of reducing particulate pollution outdoors and the potential impact of trees and plants.\n- There is growing interest in air quality monitoring due to increased awareness of the downsides of airborne particulates and high CO2 exposure, especially after COVID-19.\n- Individuals can take actions to improve air quality locally, such as avoiding the use of leaf blowers and reducing vehicle emissions.\n- Companies like Awair and IQAir are mentioned as popular air quality monitoring options, but there are concerns about the need for apps or cloud connectivity.\n- The article highlights the hidden cost of air quality monitoring and discusses the business models of other commercial providers.\n- It emphasizes the importance of data being accessible, unencumbered, and shared openly for the benefit of communities.\n- There is a request for more affordable and open-source air quality monitoring solutions.\n- The article raises questions about the effects of air quality monitoring on energy costs and explores the possibility of capturing and filtering air instead of replacing it.- People are discussing the need for water quality monitoring technology similar to the air quality monitoring technology mentioned in the post\n- Some users express interest in a product with Power over Ethernet (PoE) capabilities and an open, local API\n- Other users mention the need for open-source air quality monitoring in schools and the availability of real-time data\n- The mention of funding needed from the government for expanded air quality monitoring\n- Discussion on the costs and hidden expenses associated with certain technologies\n- Mention of capitalism and competition in the tech industry\n- A user expresses interest in purchasing one of the mentioned kits, but states that it is not currently available on Shopify",
    "hn_summary": "- AirGradient is a company focused on making air quality monitoring accessible and affordable.\n- They have open-sourced their air quality designs and are collaborating with NGOs and universities to bring low-cost monitoring to underserved communities.\n- There is growing interest in air quality monitoring due to increased awareness of the health and environmental impacts of airborne particulates."
  },
  {
    "id": 36491514,
    "timestamp": 1687865996,
    "title": "The Deep Sea (2019)",
    "url": "https://neal.fun/deep-sea/",
    "hn_url": "http://news.ycombinator.com/item?id=36491514",
    "content": "The Deep SeaMade with by Neal AgarwalMANATEEBOTTLENOSE DOLPHIN DIVEGREEN SEA TURTLEBELUGA WHALESEA LIONVELVET CRABSTAGHORN CORALKILLER WHALEBARRAMUNDIGREAT BARRACUDASPOTTED BASSSTRIPED BASSBLACK DRUMBLUE FISHSPINY DOGFISHDENTEXMAHI-MAHIFLOUNDERBULL SHARKGREAT WHITE SHARKBLUE SHARKGUMMY SHARKMAKO SHARKSUNFISHHUMANATLANTIC MACKERELQUEEN SNAPPERPELAGIC STINGRAYDEEPEST DIVE OF A NARWHALFRILLED SHARKVIPERFISHANGLERFISHLEATHERBACK SEA TURTLEOLIVE RIDLY SEA TURTLESEA PENDRAGONFISHORANGE ROUGHYWOLF EELSWORDFISHCHAIN CATSHARKATLANTIC CODPACIFIC CODEUROPEAN PILCHARDATLANTIC SALMONCHINOOK SALMONBLUE TANGCLOWN FISHHADDOCKVAMPIRE SQUIDJAPANESE SPIDER CRABFIREFLY SQUIDSPERM WHALE DIVEYETI CRABBIG RED JELLYFISHJEWEL SQUIDCOCKATOO SQUIDPHRONIMABUBBLEGUM CORALGIANT ISOPODCOELACANTHCOLOSSAL SQUIDGOBLIN SHARKCHIMAERASBLACK SWALLOWERMONKFISHGIANT PACIFIC OCTOPUSSIXGILL SHARKEMPEROR PENGUIN DIVEELEPHANT SEAL DIVEBAIRD'S BEAKED WHALELEPTOSERISGIGANTACTISBIGEYE TUNABAMBOO CORALNAUTILUSHATCHETFISHGIANT OARFISHGIANT TUBE WORMTELESCOPE OCTOPUSBARRELEYE FISHSQUIDWORMSEA ANGELMARRUS ORTHOCANNASCALY-FOOT SNAILVIGTORNIELLA WORMTERRIBLE CLAW LOBSTERVENUS FLYTRAP SEA ANEMONELEAFY SEA DRAGONHEADLESS CHICKEN FISHGREENLAND HALIBUTKING CRABGREENLAND SHARKBLOBFISHZOMBIE WORMPOLAR BEARKELPTHICK-BILLED MURRE DIVEBARNACLEAt 332 meters, this is the deepest any human has ever scuba dived. Set by Ahmed Gabr in 2014.No sunlight is able to reach this deep.Many deep-sea creatures cope by creating light themselves - also known as bioluminescence.Narwhals dive to this depth up to 15 times a day in search for food.The Japanese Spider Crab is the largest known crab with a maximum leg span of 3.8m.Coelacanths were thought to be extinct until found alive in 1938.Leatherback Sea Turtles are the oldest sea turtle species.Giant Oarfish can grow up to 11m long.Sixgill Sharks spend the day in deep waters and the night in shallow waters. They can be found all over the world.Telescope Octopus are almost completely transparent and have unique protruding eyes.Barreleye Fish have a transparent head that allows their eyes to collect more light.Black Swallowers can swallow entire fish whole - even those vastly larger than themselves!Vampire Squids eat marine snow - organic material that falls from shallower waters.Headless Chicken Fish are sea cucumbers with wing-like fins that allow them to swim.Colossal Squid are the largest known squid species. They can reach a length of 10 meters and weigh up to 700 kg.The Orange Roughy can live up to 200 years. Deep sea life often have elongated life spans.Meals are rare in the deep sea. Deep sea creatures have adapted to this - one Giant Isopod in captivity went five years without eating.Many deep sea species use the color red as camouflage since it's the first color to leave the spectrum as you dive deeper.Goblin Sharks are known as \"living fossils\" because they're the only living species of a lineage that has existed for 125 million years.Is it a squid, or a worm? It’s a worm.Sea Angels are majestic sea slugs that use wings to propel themselves.The Scaly-Foot Snail gets its name from the iron plates on its foot and the iron shell it makes out of Iron Sulphide.Anglerfish have a large bioluminescent lure used to attract prey in the darkness.Giant Tube Worms get their nutrients from hydrothermal vents.Hydrothermal vents are formed from seawater passing through extremely hot volcanic rocks. They release heavy metals that are toxic to most animals.But even in those extreme conditions specialized life finds a way to survive.Yeti Crabs live on hydrothermal vents.THE MIDNIGHT ZONETHE TWILIGHT ZONEGULPER EELAMPHIPODAPATAGONIAN TOOTHFISHFLABBY WHALEFISHATOLLA JELLYFISHFANGTOOTHTITANIC WRECKAGECARIDEACUVIER'S BEAKED WHALE DIVELIZARDFISHHARP SPONGEDUMBO OCTOPUSCOSMIC JELLYFISHBRITTLE STARSEA PIGMEGAMOUTH SHARKSTOPLIGHT LOOSEJAWTRIPOD FISHFACELESS FISHCOOKIECUTTER SHARKGLASS SPONGEABYSSAL SPIDERFISHThis is the average depth of the ocean.But in some places it goes deeper.Much deeper.Cuvier's Beaked Whales are the deepest diving mammals.On April 14th, 1912 the Titanic sank to its final resting place at a depth of 3,800 meters.This is the deepest point of the Manila Trench in the South China Sea.Patagonian Toothfish have antifreeze proteins in its tissues to prevent freezing in sub zero temperatures.Megamouth sharks are one of the largest growing shark species with some reaching 7 meters long.The temperature here is near freezing and very few animals can survive the extreme pressure.This shark takes cookie-shaped chunks out of its prey.THE ABYSSAL ZONECOMB JELLYHADAL SNAILFISHUSS JOHNSTON SHIPWRECKGRENADIERCUSK EELCHITONYou have scrolled the height of Mount Everest.Comb Jellies have been around for 500 million years. Despite looking like jellyfish, they are not closely related.This is the lowest point of the Puerto Rico Trench.This is the deepest point of the Java Trench in the Indian Ocean.The USS Johnston sank in WWII and is the deepest shipwreck ever found.More people have been to the Moon than the Hadal Zone.Most of the Hadal Zone takes place in deep sea trenches.Deep sea trenches form by a process called \"subduction\" where the Earth's tectonic plates meet and push together.The deep sea can be a lonely place.Life here is sparse - the extreme conditions make survival difficult.But still not impossible.So little is known about life in these deep environments. Almost every expedition uncovers something new.THE HADAL ZONEHADAL AMPHIPODMany probes and submarines have been lost trying to reach the deepest parts of the ocean.On January 23rd, 1960, about 9 years before the moon landing, humans went where they never had before.Two men, Jacques Piccard and Don Walsh, onboard the submarine Trieste slowly descended into the Mariana Trench.Their goal was to reach The Challenger Deep - the deepest point in the ocean.The submarine used a re-breather system that would later be used in spacecraft. There was barely enough space inside the pressure sphere for both of them.The immense pressure of the deep sea means any mistake would mean certain death.During the descent, one of the window panes cracked and shook the entire vessel.Nevertheless, they continued.Even at these unfathomable depths, Jacques and Don could still see life out the window. Life can survive unimaginable environments.After 4 hours and 47 minutes of anxiety and claustrophobia...They succeeded and became the first humans to reach the deepest point in the ocean.THE CHALLENGER DEEPThe Deep SeaMade with by Neal AgarwalSpecial thanks to Dr. Harri Pettitt-Wade for help with editing and feedback.Buy me a coffee!More posts on Neal.fun",
    "summary": "- The post explores the fascinating world of the deep sea, including the different species and adaptations that allow them to survive in such extreme environments.\n- It highlights the record-breaking achievements of humans in exploring the deep sea, including the deepest scuba dive and the first manned descent to the Challenger Deep, the deepest point in the ocean.\n- The post emphasizes the vastness and mystery of the deep sea, with new discoveries and fascinating facts about its unique inhabitants.",
    "hn_title": "The Deep Sea (2019)",
    "original_title": "The Deep Sea (2019)",
    "score": 355,
    "hn_content": "Hacker News new | past | comments | ask | show | jobs | submit loginThe Deep Sea (2019) (neal.fun)355 points by throw0101a 22 hours ago | hide | past | favorite | 121 commentspfdietz 21 hours ago | next [–]The USS Johnston is no longer the deepest wreck found. That honor goes to another ship lost at the Battle Off Samar: the famous DE-413, USS Samuel B. Roberts.The ship's final action report:https://www.ibiblio.org/hyperwar/NHC/NewPDFs/USN/Action%20re...\"The crew were informed over the loud speaker system at the beginning of the action, of the Commanding Officer's estimate of the situation, that is, a fight against overwhelming odds from which survival could not be expected, during which time we would do what damage we could. In the face of this knowledge the men zealously manned their stations wherever they might be, and fought and worked with such calmness, courage, and efficiency that no higher honor could be conceived than to command such a group of men.\"replywewxjfq 20 hours ago | parent | next [–]Also, I didn't do the math, but I wonder if the claim that more people have been to the moon than the Hadal Zone is still true. Ironically, the same person that made the USS Johnston statement obsolete would also be responsible for that, because he made so many descents with different people.replyCthulhu_ 20 hours ago | root | parent | next [–]I haven't done a lot of research, but https://en.wikipedia.org/wiki/Hadal_zone seems to suggest it really has only been a handful of people; Jaques Picard and John Walsh, James Cameron, and a few Chinese and Japanese explorers; even unmanned craft struggle to go down that far it seems.Which... is kinda weird to me, like with space missions, I'd expect them to launch probes or permanent unmanned observation things down there. Surely they can transfer data through water efficiently enough?I can imagine they don't want to use nuclear power (like a RTG) on those though, which limits lifetime. A cable going to the surface will be difficult as well, because of its own weight and currents.replyploek 19 hours ago | root | parent | next [–]> Surely they can transfer data through water efficiently enough?Actually, no. Water absorbs most of the electromagnetic spectrum pretty well, severely limiting the communication range. So you're limited to low frequencies or acoustic communication. Both have a low bandwidth, so forget live video footage.https://en.wikipedia.org/wiki/Communication_with_submarinesreplylb1lf 17 hours ago | root | parent | next [–]Should be within the realm of the possible to use a kevlar-reinforced umbilical with fiber optics in it going to a buoy on the surface, though. Starlink to the rescue!I am not sure you would need that much bandwidth from down there, though - I really can't see that much happening that quickly at the bottom of the Challenger Deep.replysamstave 16 hours ago | root | parent | prev | next [–]What if you could \"stereolitho-encode\" a bunch of data in an image, then just send the image and let the receiving sub decode the image for the data, as opposed to a bunch of linear sonic-\"packets\"?For example, what if the image was a pic of various graphs and stats of the status of the machine, but at the same time other critical information is encoded in the image of a Status-Page/Dashboard style KPI image?replybee_rider 15 hours ago | root | parent | next [–]It is likely I’ve missed something because your idea seems clever and mine is dumb, but what about just bundling all the data up together and then letting some compression algorithm take a swing at it. (Which is I’m sure what they do already)replymesse 15 hours ago | root | parent | prev | next [–]> then just send the imageHow do you propose sending it?replysamstave 13 hours ago | root | parent | next [–]I am saying that you can likely encapsulate a boat-load more pay-load in a small image, than if youre attempting to send blobs, timesequence, or other info - especially if your image is intercepted and itsa pic of your enemy's leader/flag/whatever and they have no idea what to do with the image...Better yet, is if the image is of a flase map of current in-situ..replymesse 10 hours ago | root | parent | next [–]> I am saying that you can likely encapsulate a boat-load more pay-load in a small image, than if youre attempting to send blobs, timesequenceWhat? Why do you believe this?From an information theory perspective, you’re talking nonsense.replysamstave 9 hours ago | root | parent | next [–]You do not know steganography.Try a wikireplygovg 12 hours ago | root | parent | prev | next [–]Why is it more likely that an image can store more information than just encoding the information directly in some format like binary? You have the added overhead of the actual image itself, now you have to transmit compress(bits(image) + bits(message)) when you could just do compress(bits(message)).replysamstave 9 hours ago | root | parent | next [–]Iamgine the embeddeded encodes?So an stegano can give you image ..> code ..Def=code.. image.. infor, it may require more itereations... look into it.replybee_rider 7 hours ago | root | parent | prev | next [–]Originally the topic was undersea exploration. There’s no need for steganography, the issue is signal strength, not obscuring communications. There isn’t an enemy to intercept these messages.replymesse 19 hours ago | root | parent | prev | next [–]According to the wikipedia page of the DSV Limiting Factor[1], \"Over 21 people have visited Challenger Deep, the deepest area on Earth, in the DSV\". This is just aboard the Limiting Factor, and doesn't include the descent of the Trieste (2 people), Deepsea Challenger (1 person), and Fendouzhe (3 people), totaling at least 27 who have been to the Challenger deep.It looks like now, at least 3 more people have been to the Challenger Deep than have been to the moon (24 orbited it, only 12 landed on it).[1]: https://en.wikipedia.org/wiki/DSV_Limiting_Factorreplyomoikane 17 hours ago | root | parent | next [–]27 so far according to this list:https://en.wikipedia.org/wiki/List_of_people_who_descended_t...replySniffnoy 15 hours ago | root | parent | prev | next [–]It would likely have been true a few years ago, but now 27 people have been to the Challenger Deep: https://en.wikipedia.org/wiki/List_of_people_who_descended_t...That's more than the 12 who have walked on the moon.replyP_I_Staker 15 hours ago | parent | prev | next [–]Of course someone was writing all that down, so for all we know everyone was having a beer and a laugh.replynerdponx 19 hours ago | prev | next [–]The sheer depth of course is astounding, and the fact that life can exist at such depths is also astounding, but the most astounding thing to me is to see terrestrial animals diving hundreds of meters, and aquatic mammals diving thousands, and moreover large creatures like sharks apparently living comfortably in the upper and middle regions of the midnight zone, alongside the skeletal and bioluminescent creatures we usually think of as inhabiting that area. Why?! What revolutionary pressure selected for the ability to dive hundreds of meters underwater from the surface or close to it, presumably to where food is more scarce? Is it easier to hunt down there? Less competition from less highly adapted animals? It seems like such an extreme adaptation that you have to presume it predates our modern familiar species of penguins, pinnipeds and cetacea.replykuhewa 13 hours ago | parent | next [–]The deep scattering layer which is made up of various organisms from planktonic to laternfish and larger squid undergoes a diel vertical migration from near the surface at night to well into the mesopelagic zone (200-1000m) during the day, and while the ultimate driver involves illuminance, the evolutionary pressures are complex and involve bottom up and top down forcing (e.g. following food or avoiding predators).Higher trophic level predators have adapted to bounce dive or undergo their own DVM to match and have to deal with cold, low oxygen (although hypoxia can be ecologically limiting in some areas), but the pressure, which isn't that big of a deal especially if you have limited air spaces.Once you can dive to 600-1000 m the pressure differential is not that much greater to go a bit deeper compared to at shallower depths (relative difference between 800-1600 m is the same as 0-10m).There appear to be other functional behaviours besides foraging that push the physiological limits of these animals, for example the webpage has the typical daytime depths of swordfish of 550m which is accurate and they will stay there from dawn to dusk typically, but very rarely they will bounce dive 1000m - 1400m+. Possibly, although not confirmed, related to the need to calibrate navigational faculties.replydarkerside 14 hours ago | parent | prev | next [–]As a thought exercise, what evolutionary pressure drove deep sea creatures to make the tremendous effort required to leave the depths of the ocean in the first place?replykrylon 22 hours ago | prev | next [–]This would be even better if you could click on the various creatures you encounter to get their Wikipedia articles.That said, this is pretty cool. It's made me think how for humans and many other animals, moving 10, 100, even thousands of kilometers horizontally is not a very big deal. But move vertically, and you effectively find yourself in a different world within as little as a few hundred meters.replynerdponx 19 hours ago | parent | next [–]A few hundred meters? Even 10 meters under the water feels like an inhospitable alien world, likely to induce a minor sense of panic if you look up and contemplate the amount of water between you and the surface.replycratermoon 17 hours ago | root | parent | next [–]I used to swim in an Olympic-sized pool with a depth of 10 feet (3m) at one end. I could hold my breath and swim down to the bottom for a minute maybe, and looking around, it was definitely a lot of water. I could feel the pressure even there.I also went snorkeling in Hawaii once in cove that had deep areas easily over 10m. Even looking down at that depth could be disorienting and anxiety-inducing.A hundred meters is technical SCUBA diving depth. A few hundred meters is where military subs hang out, and not much below. A kilometer is crush depth for all but the sturdiest military submarines and special deep-diving vehicles.replysamstave 16 hours ago | root | parent | next [–]I grew up with a Swim Club, and our pool went to 12' deep - and just getting to the drain at the center of the deep-end hurt my ears so bad, that it was an effort.I can pop my ears at will in Air, but underwater, at 12' the pain is intense, and I cant normalize. I couldnt imagine say, 30' deep or anything more.replyJackFr 19 hours ago | parent | prev | next [–]> That said, this is pretty cool. It's made me think how for humans and many other animals, moving 10, 100, even thousands of kilometers horizontally is not a very big deal. But move vertically, and you effectively find yourself in a different world within as little as a few hundred meters.This observation reminded me of 'Dragon's Egg', the SF novel about a civilization on the surface of a neutron star. Because of the intense magnetic field, movement in the east-west direction was easy but very difficult in the north-south direction.replyeternauta3k 21 hours ago | parent | prev | next [–]You can download it and make this change. Maybe send it to the author instead of publishing it yourself.replydang 21 hours ago | prev | next [–]Related:The Deep Sea - https://news.ycombinator.com/item?id=29290204 - Nov 2021 (45 comments)The Deep Sea - https://news.ycombinator.com/item?id=21850527 - Dec 2019 (96 comments)The Deep Sea - https://news.ycombinator.com/item?id=21787563 - Dec 2019 (1 comment)The Deep Sea (Scrolling Experience) - https://news.ycombinator.com/item?id=21774643 - Dec 2019 (1 comment)replyfsflover 20 hours ago | parent | next [–]See also:Space Elevator - https://news.ycombinator.com/item?id=35629972 68 days ago | 210 commentsreply13of40 19 hours ago | prev | next [–]Interesting point about the Trieste if nobody has mentioned it yet: The big part on top isn't where the crew goes, it's a tank of lighter-than-water liquid that regulates the buoyancy of the rest of the equipment. It's liquid instead of gas so it's incompressible and doesn't implode. The little ball on the bottom is where the people sat. So it's like an underwater Zeppelin.replyeternauta3k 19 hours ago | parent | next [–]Nitpick, the reason the float doesn't implode is because it's open at the bottom. As the gasoline (very slightly) contracts, seawater comes in. From the wikipedia article.reply13of40 19 hours ago | root | parent | next [–]Interesting - I wonder if it's contracting because of the pressure or the temperature or both. I imagine it's probably pretty cold down there, and gasoline is known to expand and contract based on temperature.replyedizms 8 hours ago | root | parent | next [–]Most likely both but considerably more so due to the pressure.replyp-e-w 22 hours ago | prev | next [–]> During the descent [of the Trieste to the Challenger Deep], one of the window panes cracked and shook the entire vessel.... and still they did not abort the dive. In fact, they continued to go even deeper. Think about that for a second.That's the stuff those explorers (and the people backing them) were made of. No wonder nobody has been to the Moon in 50 years. I can't even imagine where you would find an institution willing to let its employees take such risks today.replyjb1991 21 hours ago | parent | next [–]> I can't even imagine where you would find an institution willing to let its employees take such risks today.Uhm, OceansGate?replyp-e-w 21 hours ago | root | parent | next [–]I very strongly doubt that they would have continued a dive with a cracked window. Their risk was abstract, and caused by ignorance.The crew of the Trieste continued to descend knowing full well that their vessel was damaged.That's not the same thing in my mind.replyjb1991 21 hours ago | root | parent | next [–]> Their risk was abstract, and caused by ignorance.There was nothing abstract whatsoever about the lack of adequate preparation and responsibility taken: they did not certify, and they used components that were not rated for the depths of their dives, among many other things. This was not ignorance. This was boldly deciding not to care about safety. They ignored very vocal and direct outspoken concerns from all their peers in the industry for years, specific concerns about what they were doing that was not safe, and they ignored that too. Not abstract.replykdmccormick 17 hours ago | root | parent | next [–]Stockton assured passengers that it was totally safe. Either he was lying, or he deluded himself enough that he found the risk to be abstract.A reckless teenager driving at 120mph on the highway with no seatbelt is obviously in serious danger, but to their young, impulsive mind the danger may feel completely abstract.replyedizms 7 hours ago | root | parent | next [–]Danger is relative, that's normal in Germany.replycs02rm0 21 hours ago | root | parent | prev | next [–]They listened to the carbon fibre cracking, sometimes very loudly.replyHamuko 21 hours ago | root | parent | prev | next [–]They dove the Titan to the Titanic for 10+ times with a viewport that was rated for 1300-metre depth when the Titanic is at 4000 metres.I feel like OceanGate did not really pay that much attention to window safety.replyedizms 7 hours ago | root | parent | next [–]I believe this to be the elephant in the room, I wouldn't be surprised if the viewport gave way before the hull.replytjpnz 21 hours ago | root | parent | prev | next [–]Not just window safety. The CEO effectively said he didn't care for safety in general.replyklysm 21 hours ago | root | parent | prev | next [–]That seems to be driven more by naivety than anything elsereplyAlecSchueler 21 hours ago | root | parent | next [–]If they survive it's bravery, if they die it's naïvity.replyrunesofdoom 20 hours ago | root | parent | next [–]Maxim 43: \"If it's stupid and it works, it's still stupid and you're lucky.\"[1][1]From Schlock Mercenary's \"Seventy Maxims of Maximially Effective Mercenaries\".https://www.ovalkwiki.com/index.php/The_Seventy_Maxims_of_Ma...replyjb1991 21 hours ago | root | parent | prev | next [–]No, it wasn't naivety.replyEdwardCoffin 21 hours ago | parent | prev | next [–]I found this interesting enough to look into it a little more:> At 30,000 ft. a sharp crack rang through the ship, shaking it violently. The water pressure outside wasmore than 6 tons per sqare inch., and even a slight fracture in the hull would have meant certain death. It proved to be only an outer Plexiglas windowpane which had splintered under the pressure. The inner hull remained watertight. \"A pretty hairy, experience,\" admitted Walsh.https://web.archive.org/web/20070202144233/http://bjsonline....replysaiojd 16 hours ago | parent | prev | next [–]Not to dismiss the guts of these explorers, but we have not been to the Moon in 50 years because it costs a fortune to get to when it's not much more than a floating rock (I'm being hyperbolic but the point is that there is no economic incentive to offset the cost). If we could get to it cheaply, but with a high risk of death, I'm sure many would be doing it right now.replyworld2vec 20 hours ago | parent | prev | next [–]In the \"Deepsea Challenge\" documentary (2014), Don Walsh (one of the two men that made the dive with Trieste) tells James Cameron that \"if you can hear a crack it means you're still alive, might as well keep on with the dive\" (paraphrasing). So when Cameron is doing a test dive he hears a loud noise and indeed just keeps going. Personally, I'd wet my pants right there and cry for my mother. These gentlemen are built different I guess.replymeigwilym 21 hours ago | parent | prev | next [–]I read that their logic was \"If it was going to catastrophically fail, it would have. So no need to stop.\"replyAlexandrB 21 hours ago | parent | prev | next [–]I was also amazed to read that the window was made of plexiglass:> Observation of the sea outside the craft was conducted directly by eye, via a single, very tapered, cone-shaped block of Plexiglas, the only transparent substance identified which would withstand the external pressure.https://en.m.wikipedia.org/wiki/Trieste_(bathyscaphe)#DesignreplyJackFr 19 hours ago | parent | prev | next [–]It's possible that consciously or unconsciously they reasoned that a failure which compromised the vessels integrity would have been instantaneous and catastrophic, and thus the crack most likely was not compromising the vessels integrity.At least that's what I'd tell myself.replyklysm 21 hours ago | parent | prev | next [–]Reading that for the first time blew my mind. How did it not fail after cracking? I don’t understand how it wasn’t structurally compromised.The guts it takes to not abort the dive seems just clinically insane to mereplyCthulhu_ 20 hours ago | root | parent | next [–]Another comment quotes something that it was only an outer pane, probably more functional than structural.replytjpnz 21 hours ago | parent | prev | next [–]And it's because of those early pioneers that submarining is now a mature art. At least when practised by those prepared to learn.replybufordtwain 18 hours ago | parent | prev | next [–]Continuing after a window cracked seems bad. Why not figure out why it cracked and fix it, then try again?replyrpeden 17 hours ago | root | parent | next [–]It was a window in the non-watertight entrance tunnel, not the window in the hull.This article describes it in more detail: https://spectrum.ieee.org/amp/don-walsh-describes-the-trip-t...replyUniverseHacker 11 hours ago | root | parent | next [–]This is the answer... nobody is going to go deeper if the window to the pressure vessel cracksreplykomali2 20 hours ago | parent | prev | next [–]> That's the stuff those explorers (and the people backing them) were made of.They died all the time. https://en.wikipedia.org/wiki/List_of_lost_expeditionsI don't know why that's laudable: if you die before you make it back, for most of these locations, that means whatever you've learned is lost as well, and someone has to take identical risk to learn it for humanity again.Seems to be better to see the cracked pane, return to the surface with your lives, write a letter to your submarine enthusiast magazine group or whatever the equivalent of a web forum was back then noting that such and such glass installed in such and such way cracked at N depth, try a new method, and dive again.> No wonder nobody has been to the Moon in 50 years.Why bother when the ocean is infinitely more interesting?replylucideer 20 hours ago | parent | prev | next [–]Was this comment written by Stockton Rush's ghost?replytigerpillow 21 hours ago | prev | next [–]Any idea on how to build this? I am thinking about doing the same for emperors and kings etc etc. Not sure if there is a framework of some sort or just js+css.I love all his projects! The one called \"spend Bill Gate's money\" is really funny too. He also curates a site that collects similar fun projectsreplymethodical 20 hours ago | parent | next [–]No need for a framework or anything of the sort as far as I see it. Establish your scale in some manner which can be converted to a distance relative to the top of the page and position the elements absolutely to their proportional position. You can use this same scale against the scrollY attribute to know where you are relative to the top (in this case for rendering the depth).replyTeichopsia 19 hours ago | parent | prev | next [–]You could use intersection observer to check the position of an element. I can't remember if there was a native way of doing it in CSS (for some reason it's stored in memory that it was recently added to CSS)... The closest is scroll snap.replymckeed 17 hours ago | prev | next [–]I kept being surprised seeing air-breathers deeper and deeper. I had no idea narwhals dove down to the depths where things live on hydro-thermal vents. Also that penguins have been near twice as deep as scuba divers.replypugworthy 17 hours ago | parent | next [–]Same! Scrolling along and suddenly, \"Wait! Narwhal!?\" Then it's, \"Wait!! Elephant Seal!!??\"replyzonkerdonker 16 hours ago | root | parent | next [–]The elephant seal really threw me for a loop, so I looked it up and [1]. It's not even close to accurate. I also couldn't verify any recorded dives of chinook salmon that deep either. A bit disappointing, this chart would be really cool if it was accurate[1] http://mirounga.ucsc.edu/leboeuf/pdfs/PatternDepthofDives.19... (pdf warning)replyplewd 6 hours ago | root | parent | next [–]I believe it's the deepest dive recorded of those animals (or at least that was the case for the narwhal)replypugworthy 16 hours ago | root | parent | prev | next [–]CUVIER'S BEAKED WHALE!!!replygooseus 21 hours ago | prev | next [–]Very cool. Does need to be updated since the deepest discovered shipwreck is no longer the USS Johnston[1] as of 2022.> The wreck of Samuel B. Roberts lies at a depth of 6,895 meters (22,621 ft; 4.284 mi), making her the deepest known shipwreck and the deepest shipwreck ever identified by a crewed submersible. It exceeds the previous record of 6,469 meters (21,224 ft; 4.020 mi), set in March 2021 when Vescovo's team found and identified the wreck of the destroyer USS Johnston, which was sunk in the same battle.[1] https://en.wikipedia.org/wiki/USS_Samuel_B._Roberts_(DE-413)...replygausswho 19 hours ago | parent | next [–]How is it the structure of a ship, even thin bars of steel, can withstand the pressure of that depth? How many pounds per square inch would be applied here? Is the pressure a danger for submersibles because of the pressure differential rather than the pressure itself?replygostsamo 19 hours ago | root | parent | next [–]If the ship hulk is full of water, the pressure is on both sides. Worst that can happen to such a material is to be compressed, but metal is okay in that regard.replygiantrobot 18 hours ago | root | parent | prev | next [–]Pressure differential is definitely one of the bigger problems. In a manned submersible the interior pressure is usually roughly sea level. So you've got hundreds of atmospheres on the outside vs one of the inside. Anything that requires some pressure differential requires a strong pressure vessel. So not just the crew compartment but also camera housing and the like.This is all compounded by the fact the deep ocean is very cold so as a submersible descends there's a thermal gradient with \"survivable\" on the inside and sun-zero on the outside. Temperature differentials interact with the pressures because the atmospheric pressure and low temperature will both cause material to compress/contract. The whole vessel structure needs to be able to remain structurally sound with all of that expansion and contraction.The submersible is also in salt water which corrodes different materials and can cause electrical shorts. A submersible could have a few successful missions then fail because some corrosion was missed on an inspection.Building a manned or unmanned device to travel to and return from an extreme environment is really hard. You need to understand or at least make educated guesses about the target environment, understand your building materials, your construction processes, validate and bench test as much as possible, and have the same amount of thought go into actual operations. \"Fuck it we'll do it live\" is not a recipe for success.replyramshanker 19 hours ago | prev | next [–]If life could exist 10km below the ocean, I have strong gut feeling, we will find life deep inside the Jupiter thick atmosphere. Whatever depth that may be. It is like there is a FISH WITH WORKING EYE at 10km depth, so for much simplified multicellular organisms, limit could be even more extreme.replyRoot_Denied 19 hours ago | parent | next [–]The problem I see with that line of thinking is that there's a long chain of evolution underpinning that fish living at 10km depth, it didn't pop into existence being able to live in that environment.I do think finding extremophiles in the solar system is a distinct possibility (Titan seems like a good bet) but I'm doubtful any of it will be multicellular.replygiantrobot 18 hours ago | root | parent | next [–]It's my understanding unicellular life popped up on Earth pretty much as soon as it had a non-lava surface. While Earth seems super friendly today it was incredibly hostile when life formed. Early life on Earth were all what we'd consider extremophiles or at least extreme-adjacent.I'd bet (at least a small amount of money) that life, at least the most basic unicellular life, will pop up wherever the requisite materials exist in environments where they're not immediately destroyed but have enough external energy to facilitate some more energy intensive chemical reactions.Jupiter's atmosphere (to me) seems just as likely a place for life to form as the surface of Titan. It would be harder for us to find that life since the environment is so demanding compared to our level of technology. The surface of Titan or Europa are much easier exploration targets relative to Jupiter's atmosphere.replyandrewflnr 17 hours ago | root | parent | next [–]I broadly agree on the timeline, but \"as soon as it had a non-lava surface\" is still plus/minus a couple hundred Mya. I do believe temperate conditions were a requirement. I doubt the first cell membranes, for instance, were terribly robust.replypfdietz 17 hours ago | parent | prev | next [–]Life in the deepest ocean requires considerable adaptation. For example, the proteins in your body would cease to function at that pressure, denatured to uselessness. The proteins the life has there are adapted to resist this. The organisms also have solutes, like trimethylamine, that help proteins maintain their structure. Many deep sea organisms are unpalatable because they contain such chemicals.Go to high enough pressure and the very polymers of life begin to break. It becomes energetically favorable for proteins to be decomposed to individual amino acids, due to their now exposed charged ends assisting in compressing water.replyliendolucas 20 hours ago | prev | next [–]Fantastic, marine life is so amazing! I was also expecting to see the Limiting Factor which is another terrific submarine (https://en.wikipedia.org/wiki/DSV_Limiting_Factor), but I guess that the author only mentioned the Trieste as they were pioneers.Edit: Maybe the author can also include: the deepest freedive https://en.wikipedia.org/wiki/Herbert_Nitsch which is something truly remarkable as well.replydylan604 16 hours ago | prev | next [–]Japanese Spider Crab will now forever be in my nightmares. 3.8m leg span can go straight to the top of the things I don't want to chase me listreplyabhishek_2107 21 hours ago | prev | next [–]awesome. i really like this website. visual representations stole my heart.replyvhiremath4 18 hours ago | prev | next [–]This is so dope! I find myself wanting to click on each of these creatures/things and have a wikipedia page open so I can go deep (pun intended) :)replyscary-size 19 hours ago | prev | next [–]Awesome feature! Really like the simplicity of it. No super fancy animation, just enough data to keep you scrolling until the end. Your next coffee is on me ;)replyNydhal 18 hours ago | prev | next [–]The deepest shipwreck was found last year: https://www.guinnessworldrecords.com/news/2022/7/worlds-deep...replymouzogu 21 hours ago | prev | next [–]I always find it surprising a fish like the orange roughy can live for 200 years without becoming a prey.the sea must be much emptier than it seems.replyCthulhu_ 20 hours ago | parent | next [–]Down there it certainly seems to be the case. That said, it's critically important still; it's so remote and shielded, if the earth would be glassed or hit by a meteor, I'm confident life would persist in deep sea pockets and ecosystems. It may be low population, and their lifespans may be long and slow, but they'll survive.replygalleywest200 21 hours ago | parent | prev | next [–]There is also no sunlight down there, making them a bit harder to eat.replynonrepeating 21 hours ago | root | parent | next [–]Also no tartar sauce.replyabhaynayar 16 hours ago | prev | next [–]My therapist: Japanese spider crab isn't real and it can't hurt you.replypavel_lishin 17 hours ago | prev | next [–]I just finished reading \"A Darkling Sea\", which I highly recommend - set at the bottom of the ocean on an ice moon like Europa - where the humans involved face similar challenges as descending down into Earth's oceans.replyMandieD 21 hours ago | prev | next [–]\"Hadal Zone\" is also the name of an album by a fun acoustic guitar duo, Opal Ocean. Great for flamenco fans, and also those who enjoy the occasional 7/4 time signature. I found out about them at a festival in my smallish German city and they were a lovely surprise to the people around me, as well.replyJALTU 16 hours ago | parent | next [–]Love this, thank you! Maybe they'll throw some distortion in and become a metal band? (Kidding, sort of.)replyaaaronu 15 hours ago | prev | next [–]What in gods name are emperor penguins doing 535m below the surface?replytimbit42 9 hours ago | parent | next [–]Eating and/or avoiding predators.replykuon 21 hours ago | prev | next [–]It's great, but the name of the creatures is too thin. I do not have the oswald font and it is using my system font instead, with a text weight of 100, gray and not full opacity, it is really hard to read. I suggest you set the weight to at least 200replyI_am_tiberius 17 hours ago | prev | next [–]Wow, didn't know a something like a spider crab exists.reply_def 16 hours ago | parent | next [–]Yeah, that one is really terrifying.replypfdietz 15 hours ago | parent | prev | next [–]Does he have radioactive blood?replyNikolaNovak 21 hours ago | prev | next [–]Amazing. I am a reasonably educated person and I would've significantly underestimated the depths of most living creature representatives, based on my limited knowledge of pressure math.replymrleinad 14 hours ago | prev | next [–]Mandatory plug: Checkout Subnautica if you want a game that triggers your thalassophobia.replyisolli 20 hours ago | prev | next [–]I wonder which animal has the widest depth range. Some of the deepest sea creatures would not survive being brought to the surface.replyseanc 20 hours ago | parent | next [–]Doesn't have to be that deep; rockfish live at about 100m and don't survive a trip to the surface unless very carefully returned back to depth.replytypeofhuman 22 hours ago | prev | next [–]Needs to be updated with the Titan submersible.replythemoonisachees 21 hours ago | parent | next [–]I thought the same as well, but then seeing the titanic on it just made me think that the titanic is significantly more important than a crushed mass grave tourism sub next to it.replyfaeyanpiraat 21 hours ago | parent | prev | next [–]Noreplywhereistejas 16 hours ago | prev | next [–]This has to be the coolest thing I have seen in a while! Super cool!replymparnisari 17 hours ago | prev | next [–]I love the music from the \"space elevator\" animation.replynestock 20 hours ago | prev | next [–]Nicely done and very interesting, yet this gives me so much anxietyreplylockedinspace 21 hours ago | prev | next [–]Very cool infographic, shared amongst my peers.replyluxuryballs 21 hours ago | prev | next [–]How about that elephant seal! Wow one hell of a diver.replykomali2 20 hours ago | prev | next [–]How the hell does an animal like the elephant seal dive more than 2km deep? That's just crazy!replywheelerof4te 18 hours ago | parent | next [–]It because of the gradual adjustment to pressure during the dive.If you took elephant seal from the surface and teleported it 2km deep underwater, it would die a horrible death.replyluxuryballs 16 hours ago | root | parent | next [–]that’s so crazy to think about, imagine experiencing this as a biological body, I wonder how long it takes them to descend and ascend, just thinking about the prolonged water logging makes me claustrophobicreplypugworthy 17 hours ago | parent | prev | next [–]Or the CUVIER'S BEAKED WHALEreplyiso1631 21 hours ago | prev | next [–]> More people have been to the Moon than the Hadal Zone.It amazes me that a film director is one of the about 8 people to have been that deep.replyryanSrich 21 hours ago | parent | next [–]Not only that. He was deeply involved in the design and engineering of the vessel he took to the Marianas trench.replysaasxyz 19 hours ago | parent | prev | next [–]do you see James Cameron in the site? I remember seeing his name when I last checked this project but now gone.replykomali2 20 hours ago | parent | prev | next [–]He just happens to be famous for being a film director, among submariner circles he's far more than a film director.replyavgcorrection 17 hours ago | root | parent | next [–]Sounds like a small circle.replyiso1631 20 hours ago | root | parent | prev | next [–]Yes, he seems to do the film stuff to fund his passion. It's a really unusual thing.Bit like Musk with spacex before he went off the crazy end with his twitter nonsense.replyacqbu 21 hours ago | prev [–]Seen this a few months ago. Has it been updated to include the Titan or am I missing something?replyGuidelines | FAQ | Lists | API | Security | Legal | Apply to YC | ContactSearch:",
    "hn_summary": "- The USS Johnston is no longer the deepest wreck found; another ship lost at the Battle Off Samar, the USS Samuel B. Roberts, now holds that record.\n- There are more people who have been to the Challenger Deep, the deepest part of the ocean, than have been to the moon.\n- Communication in the deep sea is limited due to water's absorption of the electromagnetic spectrum, requiring low-frequency or acoustic communication methods."
  },
  {
    "id": 36497613,
    "timestamp": 1687894567,
    "title": "Is ORM still an anti-pattern?",
    "url": "https://github.com/getlago/lago/wiki/Is-ORM-still-an-%27anti-pattern%27%3F",
    "hn_url": "http://news.ycombinator.com/item?id=36497613",
    "content": "Skip to contentProductSolutionsOpen SourcePricingSign inSign upgetlago/lagoPublicNotificationsFork 134Star 3.8kCodeIssues4Pull requestsActionsProjects1WikiSecurityInsightsIs ORM still an 'anti pattern'?Anh-Tho Chuong edited this page 14 hours agoJun 27, 2023 · 1 revisionPages 13Home[Ruby] On using BigDecimalA Primer on Refunds, Coupons & Credit NotesDevelopment EnvironmentFixing Webflow's load latency issuesHow to get the first 1000 Github stars for an Open Source projectIs ORM still an 'anti pattern'?Moving to the US after YC: SF, NYC... or Miami?On interviewing \"non engineers\" when you're an engineer [Red Flags]Post mortem of our 1st YC startup: a Reverse ETLProduct Hunt launch: open sourcing our handbookRestructuring pricing for the downturnStripe's real pricing: a primerClone this wiki locallyIntroductionORMs are one of those things that software writers like to pick on. There are many online articles that go by the same tune: “ORMs are an anti-pattern. They are a toy for startups, but eventually hurt more than help.”This is an exaggeration. ORMs aren’t bad. Are they perfect? Definitely not, just like anything else in software. At the same time, the criticisms are expected—two years ago, I would’ve agreed with that stereotyped headline wholeheartedly. I’ve had my share of “What do you mean the ORM ran the server out of memory?” incidents.But in reality, ORMs are more misused than overused.Ironically, this “ORMs aren’t that bad” defense piece was inspired by a negative ORM incident we experienced at Lago that caused us to question our reliance on Active Record, the Ruby on Rails ORM. And a really tempting title for this post would’ve been “ORMs kinda suck”. But after some meditation on the matter, we’ve reasoned that ORMs do not suck. They are simply an abstraction with a quintessential pro and con—they abstract away some visibility and occasionally incur some performance hits. That’s about it.Today, let’s dive into ORMs, their common criticisms, and the ones that are compelling in today’s context.A Tale of Two ParadigmsLet’s start with an easy one: ORMs and databases follow two different paradigms.ORMs produce objects. (Duh! That’s what the O stands for.) Objects are like directed graphs—nodes that point to other nodes but not necessarily to each other. Conversely, database relational tables contain data that are always linked bidirectionally via shared keys, aka an undirected graph.Technically, ORMs can mimic undirected graphs by enforcing that pointers are bidirectional. Realistically, though, this isn’t trivial to set up; many developers end up with a User object missing its Posts array or the Posts array entities lacking a backreference to the same User object (but potentially a clone).ORMs and relational databases operate under two different paradigms. For instance, an ORM might return a user’s posts as an array, but not include backreferences to the user (as Author) for each post.This paradigm mismatch isn’t a be-all and end-all, however. ORMs and relational databases are still just graphs; just databases have exclusively nondirectional edges. While this is a good academic criticism of ORMs, the real issues with ORMs are a bit more “in the weeds”.The broken principle(s)Before diving into the aforementioned “weeds”, let’s touch on some more fundamental principles. A common complaint about ORMs is that they break two of the SOLID rules. If you aren’t familiar with SOLID, it is an acronym for the principles that are taught in college classes about software design.SRPORMs violate SRP, the Society for Radiologi—sorry, the Single Responsibility Principle. SRP dictates that a class should exist for one purpose and one purpose only. And, well, ORMs don’t do that. Sure, at a high level, they do “all the database stuffs”, but that’s equivalent to creating a single class that does “all the app stuffs”. JohnoTheCoder explained it best: ORMs (i) create classes that transact with the database, (ii) represent a record, and (iii) define relationships. I would even toss in that ORMs (iv) create and execute migrations.But if you’re eye-rolling at this semantic criticism, you’re not alone. I, too, believe this common argument against ORMs is very hand-wavy. After all, an ORM’s job is to bridge the gap between two fundamentally different data paradigms; of course it’ll break some principles.SOCSeparation of Concerns, or SOC, is of similar spirit to SRP, but at the application layer. Separation of Concerns dictates that an infrastructure component should be concerned with one thing, not multiple. And an ORM shifts database management from the backend to the database, violating SOC. But SOC is a bit of a silly principle in today’s world. Nowadays, infrastructure components and coding patterns are combining tasks to achieve better performance (e.g., CPU aggregators within OLAP databases), lower latency (e.g., edge backend-frontends), and cleaner code (e.g., monorepos).The real problemsNow that we’ve marathoned through the “fake” problem, let’s discuss the real problems with ORMs. ORMs play things safe. They use a predictable, repeatable query system that isn’t inherently optimized or visible. However, ORM developers are aware of this; they’ve added a ton of features that partially address these issues, making big strides since Active Record’s debut days.EfficiencyA common criticism of ORMs is that they’re inefficient.This is mostly false. ORMs are far more efficient than most programmers believe. However, ORMs encourage poor practices because of how easy it is to rely on host language logic (i.e., JavaScript or Ruby) to combine data.For instance, take a look at this poorly optimized TypeORM code that uses JavaScript to expand data entries:const authorRepository = connection.getRepository(Author);const postRepository = connection.getRepository(Post);// Fetch all authors who belong to a certain companyconst authors = await authorRepository.find({ where: { company: 'Hooli' } });// Loop through each author and update their posts separatelyfor (let i = 0; i < authors.length; i++) { const posts = await postRepository.find({ where: { author: authors[i] } });  // Update each post separately for (let j = 0; j < posts.length; j++) {  posts[j].status = 'archived';  await postRepository.save(posts[j]); }}Instead, developers should use TypeORM’s built-in features that construct a single query:const postRepository = connection.getRepository(Post);await postRepository .createQueryBuilder() .update(Post) .set({ status: 'archived' }) .where(\"authorId IN (SELECT id FROM author WHERE company = :company)\", { company: 'Hooli' }) .execute();A great example of this is the aforementioned Lago billing SQL refactor. Our issue with Active Record was visibility-related (discussed more in detail below). There was no performance difference between our ORM and raw SQL query analogs. Because we heavily used Active Record’s data union features, our query was optimized as is:InvoiceSubscription   .joins('INNER JOIN subscriptions AS sub ON invoice_subscriptions.subscription_id = sub.id')   .joins('INNER JOIN customers AS cus ON sub.customer_id = cus.id')   .joins('INNER JOIN organizations AS org ON cus.organization_id = org.id')   .where(\"invoice_subscriptions.properties->>'timestamp' IS NOT NULL\")   .where(    \"DATE(#{Arel.sql(timestamp_condition)}) = DATE(#{today_shift_sql(customer: 'cus', organization: 'org')})\",    today,   )   .recurring   .group(:subscription_id)   .select('invoice_subscriptions.subscription_id, COUNT(invoice_subscriptions.id) AS invoiced_count')   .to_sqlwhich was replaced by this raw SQL rewrite:SELECT     invoice_subscriptions.subscription_id,     COUNT(invoice_subscriptions.id) AS invoiced_count    FROM invoice_subscriptions     INNER JOIN subscriptions AS sub ON invoice_subscriptions.subscription_id = sub.id     INNER JOIN customers AS cus ON sub.customer_id = cus.id     INNER JOIN organizations AS org ON cus.organization_id = org.id    WHERE invoice_subscriptions.recurring = 't'     AND invoice_subscriptions.properties->>'timestamp' IS NOT NULL     AND DATE(      (       -- TODO: A migration to unify type of the timestamp property must performed       CASE WHEN invoice_subscriptions.properties->>'timestamp' ~ '^[0-9\\.]+$'       THEN        -- Timestamp is stored as an integer        to_timestamp((invoice_subscriptions.properties->>'timestamp')::integer)::timestamptz       ELSE        -- Timestamp is stored as a string representing a datetime        (invoice_subscriptions.properties->>'timestamp')::timestamptz       END      )#{at_time_zone(customer: 'cus', organization: 'org')}     ) = DATE(:today#{at_time_zone(customer: 'cus', organization: 'org')})    GROUP BY invoice_subscriptions.subscription_idNow don’t get me wrong, ORMs are not as efficient as raw SQL queries. They are often a bit more inefficient, and in some choice cases, very inefficient.The first issue is that ORMs sometimes incur massive computational overhead when converting queries into objects (TypeORM is a particular offender of this).The second issue is that ORMs sometimes make multiple roundtrips to a database by looping through a one-to-many or many-to-many relationship. This is known as the N+1 problem (1 original query + N subqueries). For instance, the following Prisma query will make a new database request for every single comment!{ users(take: 3) { id name posts(take: 3) {  id  text  comments(take: 5) {  id  text  } } }}N + 1 is a common problem that ORMs struggle with. However, it can often be handled by using data loaders that collapse queries into two queries instead of N + 1. Accordingly, like most other common ORM “issues”, N+1 scenarios can often be avoided by fully leveraging an ORMs feature set.VisibilityThe biggest issue with ORMs is visibility. Because ORMs are effectively query writers, they aren’t the ultimate error dispatcher outside of obvious scenarios (such as incorrect primitive types). Rather, ORMs need to digest the returned SQL error and translate it to the user.Active Record struggles with this, and that’s why we refactored our billing subscription query. Whenever we got results we didn’t expect, we’d have to inspect the rendered SQL query, rerun it, and then translate the SQL error into Active Record changes. This back-and-forth process undermined the original purpose of using Active Record, which was to avoid interfacing directly with the SQL database.Closing thoughtsORMs aren’t a bad thing. When leveraged correctly, they could be nearly as efficient as raw SQL. Unfortunately, ORMs are often incorrectly leveraged. Developers might rely too much on host language logic structures to create data structures and not enough on the ORMs’ native SQL analog features.However, ORMs do falter on visibility and debugging—which is exactly what we faced at Lago. When a large query is giving developers trouble, shifting it to a raw SQL query may be a good investment. Thankfully, most ORMs allow you to execute a SQL query from within the ORM itself.Footer© 2023 GitHub, Inc.Footer navigationTermsPrivacySecurityStatusDocsContact GitHubPricingAPITrainingBlogAbout",
    "summary": "- ORMs (Object-Relational Mapping) are an abstraction that helps software developers interact with databases more easily.\n- While ORMs are not perfect and have their criticisms, they are not inherently bad and can be efficient if used correctly.\n- The main issues with ORMs are the paradigm mismatch between objects and relational databases, and the challenges with visibility and debugging.",
    "hn_title": "Is ORM still an anti-pattern?",
    "original_title": "Is ORM still an anti-pattern?",
    "score": 312,
    "hn_content": "- The post discusses whether Object-Relational Mapping (ORM) is still considered an anti-pattern in software development.\n- Some developers argue that ORM has drawbacks, such as not needing to know SQL and the creation of an \"anemic domain model.\"\n- Others suggest using query builders or custom flavor ORM query languages that allow developers to write normal SQL.\n- SQL is seen as a valuable skill that provides more flexibility and control compared to using an ORM.\n- Developers share their experiences with different ORM frameworks and suggest using the right tool for the job.\n- The debate highlights the importance of choosing the right approach for building a data layer, considering factors such as performance, maintainability, and ease of use.- The post discusses the use of different databases in software development and the role of ORMs (object-relational mappers).\n- Some developers argue that using different databases is not common, while others point out specific use cases where it is necessary.\n- ORMs are seen as tools that can provide benefits such as code generation and serialization, but they also have disadvantages such as performance issues and the need to understand underlying SQL.\n- The importance of understanding SQL and the limitations of ORMs is highlighted.\n- The post also touches on different ORM libraries, such as Hibernate, jOOQ, and MyBatis, and the experiences of developers with these tools.\n- The topic of database migrations is mentioned, including the challenges and advantages of using ORMs in this process.\n- The use of query builders and the potential benefits of AI-generated ORM code are briefly discussed.\n- Some developers express their preference for raw SQL over ORMs, while others argue that ORMs can be useful for certain tasks.- The post discusses the use of SQL and query builders in software development.\n- SQL is commonly used to interact with relational databases such as MS SQL Server, MariaDB, MySQL, Oracle, and SQLite.\n- Query builders, like LINQ, provide a high-level abstraction for querying data and can be used with or without an ORM like Entity Framework.\n- ORMs, like Entity Framework, provide additional abstractions for mapping C# objects to database tables and generating SQL queries.\n- While ORMs can be convenient, they can also lead to performance issues if not used carefully.\n- There are alternatives to ORMs, such as Dapper and query builders, which offer more control and flexibility in query construction.\n- In a complex application, a query builder can help different parts of the application work together to lazily compose queries.\n- Developers should consider the trade-offs between convenience and performance when choosing between ORM and raw SQL/query builders.",
    "hn_summary": "- The post discusses the debate around whether ORM (Object-Relational Mapping) is still considered an anti-pattern in software development.\n- Some developers argue that ORM has drawbacks, such as not needing to know SQL and the creation of an \"anemic domain model.\"\n- There are alternatives to ORMs, such as query builders or custom flavor ORM query languages that allow developers to write normal SQL."
  },
  {
    "id": 36488356,
    "timestamp": 1687834255,
    "title": "Build your own Docker with Linux namespaces, cgroups, & chroot",
    "url": "https://akashrajpurohit.com/blog/build-your-own-docker-with-linux-namespaces-cgroups-and-chroot-handson-guide/",
    "hn_url": "http://news.ycombinator.com/item?id=36488356",
    "content": "IntroductionContainerization has transformed the world of software development and deployment. Docker ↗️, a leading containerization platform, leverages Linux namespaces, cgroups, and chroot to provide robust isolation, resource management, and security.In this hands-on guide, we’ll skip the theory (go through the attached links above if you want to learn more about the mentioned topics) and jump straight into the practical implementation.🙅🏻‍♂️Before we delve into building our own Docker-like environment using namespaces, cgroups, and chroot, it’s important to clarify that this hands-on guide is not intended to replace docker and its functionality.Docker have features such as layered images, networking, container orchestration, and extensive tooling that make it a powerful and versatile solution for deploying applications.The purpose of this guide is to offer an educational exploration of the foundational technologies that form the core of Docker. By building a basic container environment from scratch, we aim to gain a deeper understanding of how these underlying technologies work together to enable containerization.Let’s build DockerStep 1: Setting Up the NamespaceTo create an isolated environment, we start by setting up a new namespace. We use the unshare command, specifying different namespaces (--uts, --pid, --net, --mount, and --ipc), which provide separate instances of system identifiers and resources for our container.unshare --uts --pid --net --mount --ipc --forkStep 2: Configuring the cgroupsCgroups (control groups) help manage resource allocation and control the usage of system resources by our containerized processes.We create a new cgroup for our container and assign CPU quota limits to restrict its resource usage.mkdir /sys/fs/cgroup/cpu/container1echo 100000 > /sys/fs/cgroup/cpu/container1/cpu.cfs_quota_usecho 0 > /sys/fs/cgroup/cpu/container1/tasksecho $$ > /sys/fs/cgroup/cpu/container1/tasksOn the third line we write the value 0 to the tasks file within the /sys/fs/cgroup/cpu/container1/ directory. The tasks file is used to control which processes are assigned to a particular cgroup.By writing 0 to this file, we are removing any previously assigned processes from the cgroup. This ensures that no processes are initially assigned to the container1 cgroup.On the fourth line we write the value of $$ to the tasks file within the /sys/fs/cgroup/cpu/container1/ directory.$$ is a special shell variable that represents the process ID (PID) of the current shell or script. By this, we are assigning the current process (the shell or script) to the container1 cgroup.This ensures that any subsequent child processes spawned by the shell or script will also be part of the container1 cgroup, and their resource usage will be subject to the specified CPU quota limits.Step 3: Building the Root File SystemTo create the file system for our container, we use debootstrap to set up a minimal Ubuntu environment within a directory named \"ubuntu-rootfs\". This serves as the root file system for our container.debootstrap focal ./ubuntu-rootfs http://archive.ubuntu.com/ubuntu/Step 4: Mounting and Chrooting into the ContainerWe mount essential file systems, such as /proc, /sys, and /dev, within our container’s root file system. Then, we use the chroot command to change the root directory to our container’s file system.mount -t proc none ./ubuntu-rootfs/procmount -t sysfs none ./ubuntu-rootfs/sysmount -o bind /dev ./ubuntu-rootfs/devchroot ./ubuntu-rootfs /bin/bashThe first command mounts the proc filesystem into the ./ubuntu-rootfs/proc directory. The proc filesystem provides information about processes and system resources in a virtual file format.Mounting the proc filesystem in the specified directory allows processes within the ./ubuntu-rootfs/ environment to access and interact with the system’s process-related information.The next command mounts the sysfs filesystem into the ./ubuntu-rootfs/sys directory. The sysfs filesystem provides information about devices, drivers, and other kernel-related information in a hierarchical format.Mounting the sysfs filesystem in the specified directory enables processes within the ./ubuntu-rootfs/ environment to access and interact with system-related information exposed through the sysfs interface.Finally we bind the /dev directory to the ./ubuntu-rootfs/dev directory. The /dev directory contains device files that represent physical and virtual devices on the system.By binding the /dev directory to the ./ubuntu-rootfs/dev directory, any device files accessed within the ./ubuntu-rootfs/ environment will be redirected to the corresponding devices on the host system.This ensures that the processes running within the ./ubuntu-rootfs/ environment can interact with the necessary devices as if they were directly accessing them on the host system.Step 5: Running Applications within the ContainerNow that our container environment is set up, we can install and run applications within it. In this example, we install Nginx web server to demonstrate how applications behave within the container.(container) $ apt update(container) $ apt install nginx(container) $ service nginx startConclusionBy taking a hands-on approach and exploring the code and command examples, we’ve gained a practical understanding of building our own Docker-like environment using Linux namespaces, cgroups, and chroot.Of course docker containerization is lot more than what we just explored above but these fundamentals empowers us to create isolated and efficient environments for our applications.",
    "summary": "- Docker is a popular containerization platform that uses Linux namespaces, cgroups, and chroot to provide isolation, resource management, and security for applications.\n- This guide offers a practical, step-by-step explanation of how to build a basic container environment from scratch using these foundational technologies.\n- By gaining a deeper understanding of these underlying technologies, developers can create more efficient and isolated environments for their applications.",
    "hn_title": "Build your own Docker with Linux namespaces, cgroups, and chroot",
    "original_title": "Build your own Docker with Linux namespaces, cgroups, and chroot",
    "score": 289,
    "hn_content": "Hacker News new | past | comments | ask | show | jobs | submit loginBuild your own Docker with Linux namespaces, cgroups, and chroot (akashrajpurohit.com)289 points by ghostfoxgod 1 day ago | hide | past | favorite | 129 commentsdiego_sandoval 1 day ago | next [–]The fact that containers are such a simple technology always makes me think this:Why is it still necessary to have whole, full-blown OS filesystems inside of our containers, if their purpose is running a single binary?Dependencies/dynamic libraries are decent reason, sure. But wouldn't it make more sense to do things \"bottom-up\"? i.e. starting from an empty filesystem, and then progressively adding the files that are absolutely necessary for the binary to work, instead of the \"top-down\" approach, which starts from a complete OS filesystem and then starts removing the things that are not needed?replypravus 1 day ago | parent | next [–]> Why is it still necessary to have whole, full-blown OS filesystems inside of our containers, if their purpose is running a single binary?It's not. This is just the path of least resistance for most container builds since many applications require various supporting files to function properly. Most of my Go containers only contain 2 files: the go binary and ca certificates.> Dependencies/dynamic libraries are decent reason, sure. But wouldn't it make more sense to do things \"bottom-up\"?In theory, yes. With dynamic loading and support for loading plugins and runtime this is virtually impossible to do. That's why starting from a base image that already includes everything you need is generally the chosen method. BSD jails/chroot operate this way and it's an absolute pain to setup for complicated applications.replydb48x 1 day ago | parent | prev | next [–]It’s not. You you can use systemd-nspawn to create a container that uses your own root filesystem by specifying --directory=/ --volatile=yes. This mounts a tmpfs into the container’s root, and then mounts your /usr into the container’s /usr in read–only mode. This allows the container to run all the software installed on your machine, while redirecting writes to the tmpfs.Alternatively, instead of --directory=/ you could specify some other directory that contains an OS image (such as --directory=/var/lib/machines/debian-bookworm or --directory=/var/lib/machines/fedora-38). Multiple containers can transparently share the same image, since all the writes go to a per–container tmpfs.https://0pointer.net/blog/running-an-container-off-the-host-...replyjeroenhd 22 hours ago | root | parent | next [–]That's an interesting way to use systemd-nspawn!But, if it mounts everything, wouldn't that also make container escapes very easy?replydb48x 13 hours ago | root | parent | next [–]When it is volatile, it really only mounts the /usr inside the specified directory, rather than the directory itself. In particular, /dev and /etc will be empty.replymindwok 1 day ago | parent | prev | next [–]This isn’t too far from how most containers are built nowadays. Usually you just use Alpine or slim Debian images. The benefit of using those distro images is that they provide a lot of utilities you might want in a container, like a shell.As an aside, the approach you described is how Nix works, and you can use Nix to produce OCI images.replyiso1631 21 hours ago | root | parent | next [–]> The benefit of using those distro images is that they provide a lot of utilities you might want in a container, like a shell.Why would you want a shell in a container? Surely the idea of a container is to run a program, not act as interactive environment.replygiobox 17 hours ago | root | parent | next [–]\"docker exec -it\" debugging/troubleshooting. It's generally harder to debug/troubleshoot random issues if there is no shell in the container, and you can get a working shell in a 10mb container image so not like it adds some dramatic inconvenience or size. Sure its not 100 percent necessary, but it's enormously convenient at times and I personally wouldn't build my own container images without a shell I can drop into usually, unless there are technical or security reasons to avoid doing it for the given application.The shell can also be useful for certain scripting steps during image build, not all containers are just going to copy in a statically compiled binary etc. In fact, I'd say the latter is significantly rarer than the former, at least in my experience.Being able to do commands like:$ docker exec -it mycontainer shis generally very helpful during development.> https://docs.docker.com/engine/reference/commandline/exec/replytracker1 16 hours ago | root | parent | prev | next [–]Depends on the application. If it's a single, stand-alone application meant to run in a bare container, sure. But many applications are more complicated, or have been shimmed into a container, but generally run on a given Linux system. Diagnostics and debugging inside the running container kind of requires some level of shell and interactivity. Alpine and Debian-slim images usually have enough for this purpose. If you can navigate the file system and list files at the very least, you can exfiltrate data as needed relatively easily though.replykroolik 21 hours ago | root | parent | prev | next [–]Troubleshooting inside the container or simple scripting.replythe-alchemist 17 hours ago | root | parent | prev | next [–]Like others have said, for debugging, although the proper-but-rarely-done solution is to use PID namespaces to attach another container containing the shell, rather than including it in the raw Docker image.replyleodag 18 hours ago | root | parent | prev | next [–]It's not necessarily interactive, it's also pretty common to have a shell script for initialization/setup.replyrolisz 21 hours ago | root | parent | prev | next [–]To debug stuff.replyraesene9 1 day ago | parent | prev | next [–]There's plenty of ways to build small container images that don't start with a \"full\" distribution, but whether they work for specific use cases will depend on what the applications need.FROM Scratch - starts with a totally blank image, this is the smallest option but your application must work with no supporting files (e.g. statically compiled binaries).Distroless - has a small number of standard OS support files but no package manager, so works where you don't need to install many OS packages.Wolfi - Newer than the others, they're building an ecosystem of minimal images for specific purposes.replyRandomBK 1 day ago | root | parent | next [–]And let's not forget Alpine, which is a fairly common minimalist distro clocking in a ~5MBreplyimiric 23 hours ago | parent | prev | next [–]> The fact that containers are such a simple technologyBut they're really not. This is a common misconception because of the user friendliness of Docker, but underneath all that there are many moving parts that the Linux kernel exposes, which are tricky to manage manually, and additional features of Docker itself (Dockerfile, layered images, distribution, etc.). Sure, you can write a shell script that does a tiny fraction of what container tools do, but then you'd have a half-baked solution that reinvents the wheel because... it's lighterweight?What TFA is doing is fine if you want to learn how containers work and impress your colleagues, but for real world usage, stick to the established tooling.Like others mentioned, there are ways to do what you propose, and you can always create your own container tool based on that shell script that automates this :). Though you might be interested in unikernels, which is an extreme version of that approach using VMs.replysnickerer 1 day ago | parent | prev | next [–]Because building a sane filesystem with only the needed libraries needs knowledge and some effort, whereas containers exist to keep people from using their brains.If you know what you are doing you have several alternatives:1. Just link your binary statically.2. Set the path to the picked out special libs as an environment variable only for the binary.3. Re-think what's wrong with your system that leads to the pain of you wanting other lib versions for that binary.replytracker1 16 hours ago | root | parent | next [–]1. Statically linking your application, then distributing that application, such as via Docker Hub to others will then require your application to be GPL licensed in many, many cases within the Linux ecosystem. This may not be desired.2. You can absolutely limit the system libraries that are included to only those needed. Some platforms make this easier or harder than others.3. That you have other software that you want to run in parallel and don't want to spin up full virtualization or manage various chroot structures to organize.I'd also add that just because a tool makes it easy to do something, and means you can bloat your file system doesn't make it inherently bad. Not everyone is trying to run a large database on a potato.replytakeda 1 day ago | parent | prev | next [–]If you use Nix that's pretty much how the container will be build. You specify that your app should be there and Nix, being aware of all dependencies will place inside everything needed.replyiopq 1 day ago | root | parent | next [–]Came to say this, in the case of sane things* Nix works perfectly* pip is not guaranteed to get you to a working state even if you run the same commands, so don't even think about itreplyaliasxneo 19 hours ago | root | parent | prev | next [–]> will place inside everything neededAnd more. In my experience, depending on the quality of the packages you happen to be consuming, you may end up with a container twice as large as a comparable (say, Alpine) container. For example, I once tried to bring git into my Nix container and was surprised to see over 300MB in increased size.After having built Nix containers exclusively for a year now, I wouldn't really recommend it to others unless you're willing to invest a lot of additional time cleaning up community packages.replytakeda 18 hours ago | root | parent | next [–]That's because by default Nix uses glibc (which is huge), while Alpine uses musl. You can create musl binaries, but you need to know Nix a little more and know how to cross compile.Another great thing is that you can can easily modify existing package to remove some of their dependencies that you don't use.This is shown here with packaging redis into a container here and making it 3x smaller than the alpine version: https://nixos.org/#asciinema-demo-coverThere's of course possibility that someone specified build dependency as a runtime dependency, but if that was done that's a bug.replykodah 23 hours ago | parent | prev | next [–]Docker came about when lxc was the container interface on Linux. It's hardly user friendly. Doing everything yourself is possible, but again is really only user friendly for very simple operations. For instance, most users would probably find network name spacing or even uid/gid mapping pretty confusing. These days the images produced are quite different in that Docker now produces OCI compatible images, which makes them run anywhere. lxc on the other hand will produce images that run only on Linux. lxd eventually came around which is a lot more analogous to Docker as an application and outputs OCI compatible images.replyianlevesque 23 hours ago | root | parent | next [–]I’m confused. If OCI images run anywhere, why does Docker Desktop for windows and mac run virtual machines with a Linux kernel behind the scenes?replykodah 22 hours ago | root | parent | next [–]Containers are a feature of the Linux Kernel as is namespacing, so non-linuxes will always need a VM to run Linux containers.lxc really only covers starting a process as a container with some basic configuration. Later on Docker developed libcontainer which gave it interaction with other namespacing technologies like IPC, network, etc. The interfaces with these other namespacing technologies are not the same across linuxes which is what I mean by \"run anywhere\".replyflaminHotSpeedo 16 hours ago | root | parent | prev | next [–]OCI defines a spec for container images.Both the Linux and Windows kernels support containers, but the way containers work is by running on the parent kernel (as opposed to traditional/micro VM's or unikernels).So if you want to run a Linux container on windows you need a VM running the Linux kernel to provide the host kernel for the container.The same would be true even on Linux if you needed to use a different kernel for the container than what the parent system is runningreplyjeroenhd 22 hours ago | root | parent | prev | next [–]Most container images contain binaries that were made to use Linux syscalls for things like I/O and memory management.Windows had an implementation of the Linux kernel interface for this exact purpose (WSL 1) but because of performance and compatibility challenges, they switched to plain virtual machines.These days, virtual machine run with almost 0 overhead anyway, so if you want to run a Linux binary they're a much simpler option than implementing a whole operating system.replytracker1 16 hours ago | root | parent | next [–]True enough... When I have been under Windows, a lot of things still run faster under WSL-Ubuntu than in Windows. Hyper-V is pretty nice, generally speaking, and the WSL tooling over it is pretty great. Makes having Windows as a host OS mostly tolerable. I used to joke that \"WSL\" was my favorite linux distro.I switched at home FT when I saw ads in my start menu search results that first time. The Edge nags weren't enough, the pre-installed games, etc. But an ad before what I was looking for on my local system, that was too far. I realize it was only a \"test\" feature, but even that someone wanted to test such a thing sickens me.I've still had to sometimes run under Windows at work. I prefer the M1/M2 macs now, just for silence and battery life, but they don't run Docker nearly as well, at least most of the x86_64 container issues are resolved, and most of what I touch has aarch64 targets.replyadamgordonbell 23 hours ago | parent | prev | next [–]It's fun the play around with going that way. I did via chroot, and using ldd to see what a program like redis needs copied in[1]. But eventually you might want to get a shell into the little environment, and then page thru logs from inside it, and so eventually, unless you are going pure from-scratch, statically linked, you might want something like alpine in there. But its funny how as a solution to dynamic linking is shipping a whole OS.[1] https://www.youtube.com/watch?v=JOsWB50LmwQreplyintelVISA 1 day ago | parent | prev | next [–]The extent people will go to reinvent a worse, slower and more insecure ver of static bins + BSD jails is absurd...replym463 15 hours ago | parent | prev | next [–]It's for portability.Your alpine binary can run in an alpine container. But folks run that alpine container on ubuntu 18.04 or debian 11 or macos or wsl2.also, docker brings a lot of usefulness to this mix - dockerfile \"recipe\" that builds on other recipes, layered filesystem sort of like version control, global namespace, etcreplyeldridgea 19 hours ago | parent | prev | next [–]It's a challenge but seems to be becoming moire prevalent for folks focused on supply chain attacks. Chainguard in particular has a bunch of standard containers (e.g. nginx) that reduce the container footprint as much as possible.https://www.chainguard.dev/chainguard-imagesreplyasimpletune 1 day ago | parent | prev | next [–]On a related note. I wonder whatever happened to unikernels and why they haven't become the norm.replynubinetwork 1 day ago | root | parent | next [–]https://en.m.wikipedia.org/wiki/Tanenbaum%E2%80%93Torvalds_d...replyreegnz 19 hours ago | root | parent | next [–]unikernel is not the same as microkernel.I've found these after some quick googling:https://unikraft.org/ https://hermitcore.org/ https://nanos.org/Seems to be a living concept still, just not in the mainstream.replyflaminHotSpeedo 16 hours ago | root | parent | next [–]There are mainstream use cases, particularly for cloud providers who want lightweight runtimes with hypervisor managed isolation.The only \"example\" I can think of off hand is Firecracker, but I'm not 100% confident that Firecracker is technically a unikernels.My guess is that there's a number of unikernel implementations behind closed doors that see heavy usereplykbenson 1 day ago | parent | prev | next [–]As a sibling noted, people do that. But disk space is cheap, and you aren't really losing much other than disk space for unused portions of the OS that are in a container, but what you gain is a normalized environment that's easy to develop for, test, and add to as needed.replymuxator 1 day ago | root | parent | next [–]I understand this is easy for a developer, but I think it is not responsible security-wise: that container is a whole toolbox at the disposal of whoever may breach in it.On top of this, as some sibling commenters were saying, it is a waste of bandwidth, time and disk space.replykbenson 14 hours ago | root | parent | next [–]You think manually compiling all your libraries into a singular executable, or custom making your own minimal distro, is safer than using a minimal distro image from an actual OS distribution with security reviews, notifications about package updates, and easy patching, and where you can literally start a shell instance in the container and just check for updates to see if you have security issues? Good luck manually tracking all the security announcements for all the libraries and modules you used. You are doing that, given this is a conversation about security in containers, right?If you aren't shipping setuid binaries in your container, even if someone gets a full shell in the container they are locked down by the container permissions and cgroup limitations, which is the whole point. That some extra utility or library exists but is not running that has an exploit is really not providing much of an attack vector. If an attacker can arbitrarily run something the fact that some code is on the system is not likely to really change their abilities, unless it's setuid, so get rid of that stuff.replymuxator 13 hours ago | root | parent | next [–]There are many facets to security. I would not like someone to have shell access + bash, curl, awk, jq in a container that has full network access to sensitive systems in my applications both upstream and downstream.As per the dependencies of important projects: yep, I read their release notes. And since I do no like to do it, I try to keep them to a minimum, unless it is a prototype or a research project.I get everyone has his sensibility, but please next time try to respect those who have a different attitude. Nobody attacked you or wants to.replykbenson 10 hours ago | root | parent | next [–]> I would not like someone to have shell access + bash, curl, awk, jqHaving an OS as the container doesn't mean shipping with everything. bash and awk are commnon, and curl might be for some as well since it may be a dependency for something else, buy jq won't be, as well as many other things (and often you have to include the few things I noted anyway, as many applications will call external items and strict exec use isn't always the norm).> I get everyone has his sensibility, but please next time try to respect those who have a different attitude. Nobody attacked you or wants to.Please consider that perhaps you're being a bit too sensitive, given this is a text medium and you can't hear my inflection.I understand I may have sounded a bit facetious, but I was being honest there. It's a lot of work keeping up with dependencies, so good luck with that if you, I wouldn't want to do it myself, and if you are doing that, I'm always interested in hearing about ways in which people manage it[1]. It's directly relevant to my job. If you weren't doing that, then it was meant as a gentle note that hey, you really should be if you're concerned about security, because anyone that's statically compiling external requirements into a single binary and isn't has got much more to worry about then whether there's other utilities shipped in their container.1: For example, I wrote https://news.ycombinator.com/item?id=36450815 just the other day, which is directly relevant to that idea.replytakeda 1 day ago | root | parent | prev | next [–]If your container is big it also takes long time to fetch and start itreplyesperent 1 day ago | root | parent | next [–]Alpine docker container starts at 5mb.replytakeda 18 hours ago | root | parent | next [–]OP was arguing that today the big size doesn't matter, because disk space is cheap. I was providing argument that it still does.replynotpushkin 1 day ago | root | parent | prev | next [–]Base image layers are deduplicated though. Now if only we could pick a single base image...replytakeda 18 hours ago | root | parent | next [–]Theoretically that would work, in practice it doesn't.Making distroless containers is the way to go.replychaxor 22 hours ago | root | parent | prev | next [–]Alpine or Debian. Those are the only base images you ever need.replytracker1 16 hours ago | root | parent | next [–]Specifically, Debian-slim. But even then, the versions are varied.replycolonelpopcorn 23 hours ago | root | parent | prev | next [–]You might be unnecessarily exposing attack surface by including unused binaries in your container.replyptspts 1 day ago | root | parent | prev | next [–]Laptop SSD space for 100s of 1 GB containers is not cheap.replykbenson 16 hours ago | root | parent | next [–]1 GB seems like someone is putting way more than a base OS in a container, and many of the cheapest laptops come with at least a 256GB SSD now (Dell will sell you one for $330).A RHEL 9 universal base image, which you can add just the packages you need to, is 217MB.And if you have hundreds of images on your system, maybe remove some you aren't using. I doubt you're using them all, and if you are using them all, they likely aren't using all the space you think they are because they're probably sharing layers.replytracker1 16 hours ago | root | parent | next [–]I would suggest Alpine (5mb) or Debian Slim (<80mb) for base images. There's no need to add the overhead of RHEL inside containers, it really doesn't give you anything.replykbenson 14 hours ago | root | parent | next [–]It gives consistency for those that use RHEL and derivatives outside containers, allows easy use of enterprise software aimed at that distro, and it allows tying into registries such as quay.io that will give you notes about when and what aspects of it are out of date (package wise).I'm not saying to necessarily use it, but I wanted to pick something that was on the heavier end of the spectrum to forestall complaints about how for some people's workloads it's not realistic to run a 5MB alpine image given their work environment and needs.replyz33k 1 day ago | root | parent | prev | next [–]The ability to easily see and clear the amount of SSD space that images are wasting on my system is probably supposed to attract me to the proprietary Docker desktop application.replyIshKebab 1 day ago | parent | prev | next [–]Because the main point of Docker is to allow you to run programs in their own OS. It became popular as a software distribution method for typical Linux software that is not self-contained - requires a ton of system dependencies and spews itself all over the filesystem.If your program doesn't do that - e.g. most Rust and Go programs which are a single statically linked binary - then there's very little reason to use Docker in the first place.People will say \"but you still want to containerise things!\" or \"what about orchestration?\" and sure those are some incidental benefits now, but they only really happened because everyone was more or less forced to use Docker to actually run apps.Docker is a workaround for shitty software.replychaxor 22 hours ago | root | parent | next [–]\"Docker is a workaround for shitty software\"This just needs to be repeated for the pythonistas sitting in the back.replyclaytongulick 19 hours ago | root | parent | prev | next [–]Or, as another HN user put it a few years ago:\"Docker is static linking for millennials\":Dreplynigma1337 1 day ago | parent | prev | next [–]Lots of examples without the entire OS as other comments mention, an example would be Googles distroless[0][0]: https://github.com/GoogleContainerTools/distrolessreplyhardware2win 20 hours ago | parent | prev | next [–]Even betterGet rid of those bloated OSes and run apps directly on HW/vHWreplyclaytongulick 19 hours ago | root | parent | next [–]That's what I do.I understand that there are some good use cases for containers, but I still haven't encountered a need for them.I run everything from a /home/app folder, with the app user and restricted permissions.I avoid projects that have container-only deployment (supabase, for example).Whenever I peek behind the curtain, I end up horrified at the complexity.Honestly, I just can't imagine why someone would want to run postgres, for example, in a container. Seems like a nightmare for maintenance and production support.replyshepherdjerred 1 day ago | parent | prev | next [–]It is a bit nice to have a \"full\" operating system in your container, especially for debugging.There doesn't seem to be a _huge_ drawback to running an Ubuntu image vs Alpine, aside from the image size.replyKronisLV 1 day ago | root | parent | next [–]> There doesn't seem to be a _huge_ drawback to running an Ubuntu image vs Alpine, aside from the image size.I switched from using Alpine for my own images to using Ubuntu instead a while ago: https://blog.kronis.dev/articles/using-ubuntu-as-the-base-fo...So far, it's surprisingly nice. Ubuntu based images take up more space, but thanks to layer reuse and storage being affordable, this isn't a big issue in practice (at my scale).There are no surprises in regards to performance or package management that I have to deal with. Actually, I can use Ubuntu/Linux Mint locally and have the same install instructions for tools/dependencies as well (if I want to test things outside of containers, running on the system directly).It's also really nice to be able to build my own base image with whatever tools I want available (e.g. nano and some debugging stuff) and have them be available in all of the language/stack-specific images that I build later.The EOL is also pretty long and I don't think that there's any shame in having a \"good enough\" and somewhat boring distro for most dev stuff, only occasionally looking at PPAs for newer stuff.That said, Alpine and Debian are both fine as well! I still run Bitnami images for most complex software like databases, which I think used Debian as a base: https://bitnami.com/stacks/containersreplytracker1 15 hours ago | root | parent | prev | next [–]Would suggest debian-slim as a base image over Ubuntu. Still deb, and most of the tooling is the same, but smaller base size to start. Also make sure to look into cache and man-file cleanup as part of any apt-get steps.replyAnonCoward42 1 day ago | root | parent | prev | next [–]Ironically Ubuntu image is worse for debugging than Alpine by default even if it is substantially bigger. `vi` and `less` are missing from Ubuntu for example and are part of Alpine.replygjvc 1 day ago | root | parent | next [–]So? All you have to do is \"docker exec -it container /bin/bash\" and run \"apt update\" and \"apt install vim\", then remake the image with fixes or re-run the container once you've figured it out.replyAnonCoward42 1 day ago | root | parent | next [–]You can always smuggle the debugging tools in even `FROM scratch`, but my point was that \"by default\" these debugging tools were missing on Ubuntu.replyshepherdjerred 18 hours ago | root | parent | prev | next [–]The benefit of Ubuntu, at least for me, is that I know it pretty well. Alpine isn't bad, I'm just not familiar with it.replytracker1 15 hours ago | root | parent | next [–]Try debian-slim, should mostly be the same, but save you 100mb+ off of your final size most of the time.replycompsciphd 1 day ago | parent | prev | next [–]it isnt and very few people actually think that. plenty of \"from scratch\" images. ergo any image that is a single go binaryreplysilisili 1 day ago | root | parent | next [–]Never made a ton of sense to me. Go crosscompiles easily, ship a binary.Because the second you want to do anything involving https, you need certificates, and that's where having a minimal but existent base image starts shining, and mostly goes up from there...replymaccard 1 day ago | root | parent | next [–]Containers are more than \"just\" running a binary now though. If your \"deploy\" script is:  docker build -t my-app . && docker push my-appThen all of a sudden it's a reproducible, reusable deployment script that works for any language, any application, and that any other dev on your team can run (as opposed to playing \"which flavor of coreutils did they use when they wrote this?\"). It's provider agnostic - you can run it on DO, AWS, GCP, whatver. You get free rolling/blue green/canary/whatever you prefer deployments, a \"basic\" cross compilation out of the box. They're not magic, but they are an excellent abstraction, despite the warts.replyspeedgoose 1 day ago | root | parent | prev | next [–]Once you have a hammer… One advantage of software containers is to have this unique interface that is the same whatever is inside the container. Like shipping containers.If it's one single golang binary, or a weird python container running only on specific version of Debian compiled during a blue moon, or some 8GB java enterprise bloatware, it's the same.replyclaytongulick 19 hours ago | root | parent | next [–]See, this is actually my problem with containers.\"or a weird python container running only on specific version of Debian compiled during a blue moon\"This.I guess I've been fortunate that I'm able to reject software like this from my stack. I know that everyone isn't so lucky.I mostly do nodejs, and have zero need for containers when a simple npm install gets all deps.Or if I need performance, a single go binary.I tried doing the container thing just to understand how it all works and what the hype is about.It seemed needlessly complex and hard to develop/debug.For more complex situations where you need a bunch of interacting programs and services, I prefer stuff like Ansible and VMs, or just manually setting up a base image.I guess it's a \"get off my lawn\" kind of thing. It seems like containers are used a lot by folks who don't want to learn ops, like how to install and configure postgres, redis, etc...I think that's a mistake, and just pushes the problem onto others who have to support the software in production.replymschuster91 1 day ago | parent | prev | next [–]> But wouldn't it make more sense to do things \"bottom-up\"? i.e. starting from an empty filesystem, and then progressively adding the files that are absolutely necessary for the binary to workUnless you're using Go or a C/C++ stack that does static linking and thus needs no dependencies including libc, that's yak shaving to an extreme degree.replytauroid 1 day ago | parent | prev | next [–]sibling comments about Nix are not acknowledging that the base image size is around 600MB vs 5MB for alpinereplyadisbladis 1 day ago | root | parent | next [–]This is only true if use a Docker based workflow using `FROM nixos/nix`. This image exists mainly as a way for people to try out Nix with, not to build production images on top of. We ship many things which bloat the image size but makes it nicer for interactive usage.Using dockerTools from nixpkgs is much better and gives you much smaller images closer to Alpine size.replytauroid 23 hours ago | root | parent | next [–]I might have confused download volume with image size but the tar.gz for dockerTools.buildLayeredImage with just node and mariadb in the contents is still 220MB (just checked)Edit: with nothing in the contents it's 144M, which is getting reasonable but still nearly 30x alpine basereplygoodpoint 23 hours ago | parent | prev | next [–]> Why is it still necessary to have whole, full-blown OS filesystems inside of our containers, if their purpose is running a single binary?It's not and Docker carries plenty of unnecessary complexity.replydlahoda 1 day ago | parent | prev | next [–]nix does incremental file system. i use process-compose to build and manage process hierarchy.replysim7c00 1 day ago | parent | prev | next [–]this is what u are supposed to do, but people generally are lazy and for complex binaries or programs this can be a bit of a fiddley task honestly. you can write scripts which dump out all you need if u want. when people only had 'jails' still i think this was more common. rapid development kills all :Dreplymudiadamz 1 day ago | prev | next [–]The article is like Chat GPT generatedreplybestcoder69 1 day ago | parent | next [–]Yes, this seems like ChatGPT’s style of writing. Another post has a conclusion that matches ChatGPT’s conclusion style:> Remember, namespaces are a powerful feature that requires careful configuration and management. With proper knowledge and implementation, you can harness the full potential of Linux namespaces to create robust and secure systems.A clue from this post itself is that all the links were added to the intro because GPT won’t intersperse links throughout.e:Softened my language since there’s no way to know, and w/e ChatGPT is smart anyway. Better to judge content on the merits anyway imoreplysim7c00 1 day ago | root | parent | next [–]chatGPT is amazing if you have not mastered the language you are writing in. its what it is for. give it some text, have it rewrite it. that its generated by it doesnt mean any content was produced by it. often ppl just use it to rephrase. imho thats what its for. (hard to tell tho which is which :D)replyghostfoxgod 1 day ago | parent | prev | next [–]Yep, I do use GPT as one of the tools in my workflow. I write these blogs in markdown locally and have a helper script which takes the raw content and with a prompt it helps me generate a title, summary, Intro and conclusion (personal preference to keep these consistent on all blogs) and proofread the whole raw content for any mistakes (replaces grammarly completely now).Quite happy with this workflow because it helps me publish articles more frequently where I don't have to worry about stuff other than just dumping my thoughts in raw format.Its similar to how I use Astro as a tool to generate static pages from these markdown files to easily deploy on web or TailwindCSS etc etc you get the point.https://media.tenor.com/1PMq-CFZno4AAAAC/avengers-endgame-hu...replykreetx 1 day ago | root | parent | next [–]You might want to specify that on the title or in intro.replyghostfoxgod 1 day ago | root | parent | next [–]Noted. Although, adding that on top of each blog is very repetitive info and not specifically related to the blog. I will find a better place to add this info but will definitely add this by today, most likely under the `/uses/` page.replykreetx 19 hours ago | root | parent | next [–]I would still put it in some prominent place, similar to how newspapers put \"sponsored\". I.e I wouldn't want unknowingly to read a blog written (in large part) by chatgpt and would feel deceived when it wasn't clear from the start.replyherculity275 22 hours ago | parent | prev | next [–]I got really frustrated reading the article because most of the text felt like padding without actually explaining why these specific commands were necessary. Definitely felt like LLM output.replyintsunny 1 day ago | parent | prev | next [–]Yah, the ChatGPT vibes are insane with not only this blog post, but some of his others.replyfwungy 1 day ago | parent | prev | next [–]Likely generated and then edited.replyYetAnotherNick 1 day ago | root | parent | next [–]I don't think author even tried running the command himself.replymudiadamz 1 day ago | root | parent | next [–]Yes that's the problem, Chat GPT isn't always rightreplygiobox 18 hours ago | prev | next [–]These articles where someone uses Linux kernel level features to replicate Docker isolation are as old as Docker itself, and in my experience they always miss one of the most critical parts of the Docker ecosystem - the easily hackable and extensible container image format.It's the ease of extension of the container image format that is as much responsible for the popularity of container based architectures as it is clever use of namespaces, cgroups and chroot for \"robust isolation, resource management, and security\". Without the image format, Docker is way less interesting and you arguably haven't \"built your own Docker\".replyarnaudperalta 15 hours ago | parent | next [–]Replace every occurrence of 'Docker' in this article by 'containerd' and it's a match !replyrewmie 16 hours ago | parent | prev | next [–]> (...) they always miss one of the most critical parts of the Docker ecosystem - the easily hackable and extensible container image format.Exactly this.Docker might have a ton of nifty features, but it's killer feature is undoubtedly app packaging and deploying. Features like chroot are already as old as time, but they never became nearly as popular as Docker for a good reason: they don't solve the problem most people need to get out of the way before being able to containerize apps.replytambourine_man 22 hours ago | prev | next [–]I don’t know how I feel about the author admitting to using ChatGPT to write the article.The topic is right in my area of interest, but I don’t think want to be reading ChatGPT articles from here on out if I can avoid it.replyghostfoxgod 20 hours ago | parent | next [–]I'll expand once again, I use GPT to help me write title, summary (for excerpt) Intro and conclusions. I mostly focus on dumping down my thoughts from the things I am learning into a markdown file and use a script to sprinkle GPT magic on it which makes it much better in terms of phrasing things into a short and crisp article format and proofread the content for any mistakes (syntactic as well as semantics).I am exploring Linux myself for this year and hence more focused for content around that these days.Given said that, completely understand your sentiment here, so feel free to skip it, no hard feelings but I'm gonna continue with this workflow till I find something better to improve upon this as well. :)replytambourine_man 17 hours ago | root | parent | next [–]It may be something I'll eventually overcome. It may also be unavoidable or even undetectable very shortly.But I find its wishy-washy tone tiring, lacking personality or spark. I'm not entirely sure it's the AI that's bothersome to me. Reading long Wikipedia articles is not much fun either. The committee process washes all the texture from the piece.I think what we eventually seek in writing is character and that's missing.replyLeonenTheDK 20 hours ago | parent | prev | next [–]At least they're up front about it. Personally I don't think I mind some ChatGPT magic if the creator doesn't think they can write better. As long as it was heavily curated and modified, and not just \"write an article about manually using linux namespaces...\" and copy-pasted into their blog.replynigma1337 1 day ago | prev | next [–]Reminds me of Bocker[0][0]: https://github.com/p8952/bockerreplyjimmar 19 hours ago | prev | next [–]I've seen lots of articles like these over the years. And yet, Docker persists. Perhaps working with the Linux internals is not the hard part of building a container ecosystem.replyflaminHotSpeedo 16 hours ago | parent | next [–]It's not the hard part in the simple case, certainly.It's an interesting \"hands on learning\" style of exercise, although I'm not sure why we need a new article like this to make the rounds every so oftenreplydmpanch 1 day ago | prev | next [–]This topic is perfectly covered in a presentation by Jérôme Petazzoni from Dockercon 2015, a Docker developer, on how containerization works. After watching the video, I began to clearly understand that this is not virtualization at all, as many at first imagine.https://www.youtube.com/watch?v=sK5i-N34im8replylarata_media 21 hours ago | prev | next [–]While I do like this concept, I’ve always done this simply by compiling all the dependencies into the same folder root as the application. It never needed to be any more complicated than that. Application developers made it complicated by not wanting to do anthything but use a package manager.You can have nginx, Apache, php, Perl, python, etc… siloed into the same root as your application and have multiple instances for every application simply by compiling with the “path” parameter in the configuration.replysuperlupo 23 hours ago | prev | next [–]Isn't that quite the same as running debootstrap focal ./ubuntu-rootfs http://archive.ubuntu.com/ubuntu/ systemd-nspawn -D ./ubuntu-rootfs?replybewilderbeast 1 day ago | prev | next [–]It already exists, though these guides are good to learn: LXC/LXD containers.replyosrec 1 day ago | prev | next [–]What are the additional features that docker provides over the basic containers in the article?replydhx 1 day ago | parent | next [–]Docker by default also applies a seccomp system call whitelist per [1] and restricts capabilities per [2], amongst numerous other default hardening practices that are applied. If a Docker container really had a need to call the \"reboot\" system call, this permission could be explicitly added.More complex sandboxing techniques include opening handles for sockets, pipes, files, etc and then hardening seccomp filters on top to prevent any new handles being opened. In this way, some containers can read/write defined files on a volume without having any ability to otherwise interact with file systems such as opening new files (all file system related system calls could be disabled).[1] https://github.com/moby/moby/blob/master/profiles/seccomp/de...[2] https://docs.docker.com/engine/security/#linux-kernel-capabi...replydtauzell 1 day ago | parent | prev | next [–]The article says “Docker have features such as layered images, networking, container orchestration, and extensive tooling that make it a powerful and versatile “replyfulafel 22 hours ago | parent | prev | next [–]It's hard to say as \"Docker\" as a term or product name has diluted pretty much as they variously use it for various products with various functionalitites, and they don't have anything just called \"Docker\" any more. There's a lot of virtualization stuff for various operating systems, orchestration stuff, etc.(Note that the article also doesn't to link to any specific product, just to the Docker company front page. For me the first link the front page offers is \"Docker Desktop for Linux\" which is I guess a virtualization based system)replyraesene9 1 day ago | parent | prev | next [–]In addition to the other features that siblings have mentioned, what Docker offers is simplicity, in that you don't need to understand the details of namespaces, capabilities, cgroups etc to get an application running in a container :).replyexploderate 22 hours ago | parent | prev | next [–]Dockerfile and \"market place\" (hub) were the big ones in my opinion. Even though Dockerfile syntax was a mess in the beginning, being able to specify a base and a few commands was a huge improvement in usability. Then running build and push to make your image widely available. Collaboration was so easy compared to the alternatives, Linux jails, jailer, debootstrap, lxc and such.reply8organicbits 1 day ago | parent | prev | next [–]Documentation, third-party tooling, third-party training, large number of software engineers already experienced, extensive real-world usage and testing, plus the items others have mentioned.replythwarted 1 day ago | parent | prev | next [–]This is mentioned near the top.Docker have features such as layered images, networking, container orchestration, and extensive tooling that make it a powerful and versatile solution for deploying applications.replylastdong 1 day ago | prev | next [–]Brilliant! I know of pre-docker teams that still use this kind of implementation in their systems (with added functionalities). It’s great to see this guide, as some things are deemed more complex than they really are. I guess tooling is what brings an advantage around existing solutions, and made Docker super successful (minus license discussions).replyqwertox 20 hours ago | prev | next [–]I'm confused.I tried `unshare --uts --pid --net --mount --ipc --fork` but it failed due to permissions. `sudo unshare --uts --pid --net --mount --ipc --fork` left me in an environment where I was still in my home directory, able to see all the files and create new files which would persist after exiting.I guess there are many other tutorials which would explain this in depth, but this blog post did not really teach me anything useful about `unshare`.replyghostfoxgod 20 hours ago | parent | next [–]Best place to learn in depth about any command ⇾ https://man7.org/linux/man-pages/man1/unshare.1.htmlOf course, it's not feasible to add everything into a single blog, it's upon the reader's curiosity to explore more.PS: I find man pages a lot helpful now, and would recommend the same for others as well.replynascarsayan 20 hours ago | prev | next [–]Sometime back, I had created a github repo with all the steps including cgroups and namespaces. Had also setup up networking using veth and the existing docker bridge.http://github.com/nascarsayan/diy-containerreplyghostfoxgod 19 hours ago | parent | next [–]This is great, thanks for sharing!replydxxvi 22 hours ago | prev | next [–]Yes, \"isolated and efficient environments\" are what I need. How can I do the port mapping, disk mounting with this approach? Could you talk more about it?replylopkeny12ko 19 hours ago | prev | next [–]There isn't any discussion of overlayfs here, which is a pretty important component of Docker.replythrowway120385 19 hours ago | parent | next [–]Also no discussion of how networking is accomplished, which is a big gaping hole that ties people to ecosystems like Docker or Podman.replyv7n 1 day ago | prev | next [–]Neat, was studying just this yesterday for safely exposing some system resources to a WebAssembly module. Good read, but short.replyghostfoxgod 1 day ago | parent | next [–]Thanks and agreed, this one is a bit short because I skipped writing about the namespaces, cgroups and chroot in details and kept it outside into separate articles, Sadly I've seen in past that when I post relatively long articles then those don't do good because of short attention span (and I don't blame anyone for this, this is just the fact that I noticed). Hence, for such large topics I tend to break it down into multiple articles. Sharing the individual links if you want to go through the individual topics in bit more detail.[1] Namespaces: https://akashrajpurohit.com/blog/linux-namespaces-isolating-...[2] Cgroups: https://akashrajpurohit.com/blog/linux-control-groups-finetu...[3] Chroot: https://akashrajpurohit.com/blog/how-to-create-a-restricted-...replytaha_jahangir 22 hours ago | prev | next [–]Add `--mount-proc` to `unshare` to have separated `ps` output.replyappleflaxen 1 day ago | prev | next [–]This looks a bit like Sandstorm, which is freaking awesome.replybottlepalm 1 day ago | prev [–]I read this as ‘Build your own Doctor’ and thought the next words were going to be Llama, medical journals and your health records.replyquickthrower2 1 day ago | parent [–]Ironically you were being an LLM in that moment by predicting the next words.replybottlepalm 1 day ago | root | parent [–]Hah we are all LLMs, free will is an illusion. Ask BrainGPT a question and an answer prints itself out word by word in your head.replyGuidelines | FAQ | Lists | API | Security | Legal | Apply to YC | ContactSearch:",
    "hn_summary": "- The article discusses the concept of building your own Docker using Linux namespaces, cgroups, and chroot.\n- The author explores the idea of starting from an empty filesystem and gradually adding the necessary files for the binary to work, rather than starting with a full OS filesystem and removing unnecessary components.\n- Some comments mention the benefits of Docker's layered images, networking, container orchestration, and extensive tooling. They also highlight the simplicity and ease of use that Docker offers compared to manual configuration using namespaces and other tools."
  },
  {
    "id": 36488871,
    "timestamp": 1687839752,
    "title": "LLM Powered Autonomous Agents",
    "url": "https://lilianweng.github.io/posts/2023-06-23-agent/",
    "hn_url": "http://news.ycombinator.com/item?id=36488871",
    "content": "LLM Powered Autonomous AgentsJune 23, 2023 · 29 min · Lilian WengTable of ContentsBuilding agents with LLM (large language model) as its core controller is a cool concept. Several proof-of-concepts demos, such as AutoGPT, GPT-Engineer and BabAGI, serve as inspiring examples. The potentiality of LLM extends beyond generating well-written copies, stories, essays and programs; it can be framed as a powerful general problem solver.Agent System OverviewIn a LLM-powered autonomous agent system, LLM functions as the agent’s brain, complemented by several key components:PlanningSubgoal and decomposition: The agent breaks down large tasks into smaller, manageable subgoals, enabling efficient handling of complex tasks.Reflection and refinement: The agent can do self-criticism and self-reflection over past actions, learn from mistakes and refine them for future steps, thereby improving the quality of final results.MemoryShort-term memory: I would consider all the in-context learning (See Prompt Engineering) as utilizing short-term memory of the model to learn.Long-term memory: This provides the agent with the capability to retain and recall (infinite) information over extended periods, often by leveraging an external vector store and fast retrieval.Tool useThe agent learns to call external APIs for extra information that is missing from the model weights (often hard to change after pre-training), including current information, code execution capability, access to proprietary information sources and more.Fig. 1. Overview of a LLM-powered autonomous agent system.Component One: PlanningA complicated task usually involves many steps. An agent needs to know what they are and plan ahead.Task DecompositionChain of thought (CoT; Wei et al. 2022) has become a standard prompting technique for enhancing model performance on complex tasks. The model is instructed to “think step by step” to utilize more test-time computation to decompose hard tasks into smaller and simpler steps. CoT transforms big tasks into multiple manageable tasks and shed lights into an interpretation of the model’s thinking process.Tree of Thoughts (Yao et al. 2023) extends CoT by exploring multiple reasoning possibilities at each step. It first decomposes the problem into multiple thought steps and generates multiple thoughts per step, creating a tree structure. The search process can be BFS (breadth-first search) or DFS (depth-first search) with each state evaluated by a classifier (via a prompt) or majority vote.Task decomposition can be done (1) by LLM with simple prompting like \"Steps for XYZ.\\n1.\", \"What are the subgoals for achieving XYZ?\", (2) by using task-specific instructions; e.g. \"Write a story outline.\" for writing a novel, or (3) with human inputs.Another quite distinct approach, LLM+P (Liu et al. 2023), involves relying on an external classical planner to do long-horizon planning. This approach utilizes the Planning Domain Definition Language (PDDL) as an intermediate interface to describe the planning problem. In this process, LLM (1) translates the problem into “Problem PDDL”, then (2) requests a classical planner to generate a PDDL plan based on an existing “Domain PDDL”, and finally (3) translates the PDDL plan back into natural language. Essentially, the planning step is outsourced to an external tool, assuming the availability of domain-specific PDDL and a suitable planner which is common in certain robotic setups but not in many other domains.Self-ReflectionSelf-reflection is a vital aspect that allows autonomous agents to improve iteratively by refining past action decisions and correcting previous mistakes. It plays a crucial role in real-world tasks where trial and error are inevitable.ReAct (Yao et al. 2023) integrates reasoning and acting within LLM by extending the action space to be a combination of task-specific discrete actions and the language space. The former enables LLM to interact with the environment (e.g. use Wikipedia search API), while the latter prompting LLM to generate reasoning traces in natural language.The ReAct prompt template incorporates explicit steps for LLM to think, roughly formatted as:Thought: ...Action: ...Observation: ...... (Repeated many times)Fig. 2. Examples of reasoning trajectories for knowledge-intensive tasks (e.g. HotpotQA, FEVER) and decision-making tasks (e.g. AlfWorld Env, WebShop). (Image source: Yao et al. 2023).In both experiments on knowledge-intensive tasks and decision-making tasks, ReAct works better than the Act-only baseline where Thought: … step is removed.Reflexion (Shinn & Labash 2023) is a framework to equips agents with dynamic memory and self-reflection capabilities to improve reasoning skills. Reflexion has a standard RL setup, in which the reward model provides a simple binary reward and the action space follows the setup in ReAct where the task-specific action space is augmented with language to enable complex reasoning steps. After each actionat, the agent computes a heuristichtand optionally may decide to reset the environment to start a new trial depending on the self-reflection results.Fig. 3. Illustration of the Reflexion framework. (Image source: Shinn & Labash, 2023)The heuristic function determines when the trajectory is inefficient or contains hallucination and should be stopped. Inefficient planning refers to trajectories that take too long without success. Hallucination is defined as encountering a sequence of consecutive identical actions that lead to the same observation in the environment.Self-reflection is created by showing two-shot examples to LLM and each example is a pair of (failed trajectory, ideal reflection for guiding future changes in the plan). Then reflections are added into the agent’s working memory, up to three, to be used as context for querying LLM.Fig. 4. Experiments on AlfWorld Env and HotpotQA. Hallucination is a more common failure than inefficient planning in AlfWorld. (Image source: Shinn & Labash, 2023)Chain of Hindsight (CoH; Liu et al. 2023) encourages the model to improve on its own outputs by explicitly presenting it with a sequence of past outputs, each annotated with feedback. Human feedback data is a collection ofDh={(x,yi,ri,zi)}i=1n, wherexis the prompt, eachyiis a model completion,riis the human rating ofyi, andziis the corresponding human-provided hindsight feedback. Assume the feedback tuples are ranked by reward,rn≥rn−1≥⋯≥r1The process is supervised fine-tuning where the data is a sequence in the form ofτh=(x,zi,yi,zj,yj,…,zn,yn), where≤i≤j≤n. The model is finetuned to only predictynwhere conditioned on the sequence prefix, such that the model can self-reflect to produce better output based on the feedback sequence. The model can optionally receive multiple rounds of instructions with human annotators at test time.To avoid overfitting, CoH adds a regularization term to maximize the log-likelihood of the pre-training dataset. To avoid shortcutting and copying (because there are many common words in feedback sequences), they randomly mask 0% - 5% of past tokens during training.The training dataset in their experiments is a combination of WebGPT comparisons, summarization from human feedback and human preference dataset.Fig. 5. After fine-tuning with CoH, the model can follow instructions to produce outputs with incremental improvement in a sequence. (Image source: Liu et al. 2023)The idea of CoH is to present a history of sequentially improved outputs in context and train the model to take on the trend to produce better outputs. Algorithm Distillation (AD; Laskin et al. 2023) applies the same idea to cross-episode trajectories in reinforcement learning tasks, where an algorithm is encapsulated in a long history-conditioned policy. Considering that an agent interacts with the environment many times and in each episode the agent gets a little better, AD concatenates this learning history and feeds that into the model. Hence we should expect the next predicted action to lead to better performance than previous trials. The goal is to learn the process of RL instead of training a task-specific policy itself.Fig. 6. Illustration of how Algorithm Distillation (AD) works.(Image source: Laskin et al. 2023).The paper hypothesizes that any algorithm that generates a set of learning histories can be distilled into a neural network by performing behavioral cloning over actions. The history data is generated by a set of source policies, each trained for a specific task. At the training stage, during each RL run, a random task is sampled and a subsequence of multi-episode history is used for training, such that the learned policy is task-agnostic.In reality, the model has limited context window length, so episodes should be short enough to construct multi-episode history. Multi-episodic contexts of 2-4 episodes are necessary to learn a near-optimal in-context RL algorithm. The emergence of in-context RL requires long enough context.In comparison with three baselines, including ED (expert distillation, behavior cloning with expert trajectories instead of learning history), source policy (used for generating trajectories for distillation by UCB), RL^2 (Duan et al. 2017; used as upper bound since it needs online RL), AD demonstrates in-context RL with performance getting close to RL^2 despite only using offline RL and learns much faster than other baselines. When conditioned on partial training history of the source policy, AD also improves much faster than ED baseline.Fig. 7. Comparison of AD, ED, source policy and RL^2 on environments that require memory and exploration. Only binary reward is assigned. The source policies are trained with A3C for \"dark\" environments and DQN for watermaze.(Image source: Laskin et al. 2023)Component Two: Memory(Big thank you to ChatGPT for helping me draft this section. I’ve learned a lot about the human brain and data structure for fast MIPS in my conversations with ChatGPT.)Types of MemoryMemory can be defined as the processes used to acquire, store, retain, and later retrieve information. There are several types of memory in human brains.Sensory Memory: This is the earliest stage of memory, providing the ability to retain impressions of sensory information (visual, auditory, etc) after the original stimuli have ended. Sensory memory typically only lasts for up to a few seconds. Subcategories include iconic memory (visual), echoic memory (auditory), and haptic memory (touch).Short-Term Memory (STM) or Working Memory: It stores information that we are currently aware of and needed to carry out complex cognitive tasks such as learning and reasoning. Short-term memory is believed to have the capacity of about 7 items (Miller 1956) and lasts for 20-30 seconds.Long-Term Memory (LTM): Long-term memory can store information for a remarkably long time, ranging from a few days to decades, with an essentially unlimited storage capacity. There are two subtypes of LTM:Explicit / declarative memory: This is memory of facts and events, and refers to those memories that can be consciously recalled, including episodic memory (events and experiences) and semantic memory (facts and concepts).Implicit / procedural memory: This type of memory is unconscious and involves skills and routines that are performed automatically, like riding a bike or typing on a keyboard.Fig. 8. Categorization of human memory.We can roughly consider the following mappings:Sensory memory as learning embedding representations for raw inputs, including text, image or other modalities;Short-term memory as in-context learning. It is short and finite, as it is restricted by the finite context window length of Transformer.Long-term memory as the external vector store that the agent can attend to at query time, accessible via fast retrieval.Maximum Inner Product Search (MIPS)The external memory can alleviate the restriction of finite attention span. A standard practice is to save the embedding representation of information into a vector store database that can support fast maximum inner-product search (MIPS). To optimize the retrieval speed, the common choice is the approximate nearest neighbors (ANN) algorithm to return approximately top k nearest neighbors to trade off a little accuracy lost for a huge speedup.A couple common choices of ANN algorithms for fast MIPS:LSH (Locality-Sensitive Hashing): It introduces a hashing function such that similar input items are mapped to the same buckets with high probability, where the number of buckets is much smaller than the number of inputs.ANNOY (Approximate Nearest Neighbors Oh Yeah): The core data structure are random projection trees, a set of binary trees where each non-leaf node represents a hyperplane splitting the input space into half and each leaf stores one data point. Trees are built independently and at random, so to some extent, it mimics a hashing function. ANNOY search happens in all the trees to iteratively search through the half that is closest to the query and then aggregates the results. The idea is quite related to KD tree but a lot more scalable.HNSW (Hierarchical Navigable Small World): It is inspired by the idea of small world networks where most nodes can be reached by any other nodes within a small number of steps; e.g. “six degrees of separation” feature of social networks. HNSW builds hierarchical layers of these small-world graphs, where the bottom layers contain the actual data points. The layers in the middle create shortcuts to speed up search. When performing a search, HNSW starts from a random node in the top layer and navigates towards the target. When it can’t get any closer, it moves down to the next layer, until it reaches the bottom layer. Each move in the upper layers can potentially cover a large distance in the data space, and each move in the lower layers refines the search quality.FAISS (Facebook AI Similarity Search): It operates on the assumption that in high dimensional space, distances between nodes follow a Gaussian distribution and thus there should exist clustering of data points. FAISS applies vector quantization by partitioning the vector space into clusters and then refining the quantization within clusters. Search first looks for cluster candidates with coarse quantization and then further looks into each cluster with finer quantization.ScaNN (Scalable Nearest Neighbors): The main innovation in ScaNN is anisotropic vector quantization. It quantizes a data pointxitox~isuch that the inner product⟨q,xi⟩is as similar to the original distance of∠q,x~ias possible, instead of picking the closet quantization centroid points.Fig. 9. Categorization of human memory. (Image source: Google Blog, 2020)Check more MIPS algorithms and performance comparison in ann-benchmarks.com.Component Three: Tool UseTool use is a remarkable and distinguishing characteristic of human beings. We create, modify and utilize external objects to do things that go beyond our physical and cognitive limits. Equipping LLMs with external tools can significantly extend the model capabilities.Fig. 10. A picture of a sea otter using rock to crack open a seashell, while floating in the water. While some other animals can use tools, the complexity is not comparable with humans. (Image source: Animals using tools)MRKL (Karpas et al. 2022), short for “Modular Reasoning, Knowledge and Language”, is a neuro-symbolic architecture for autonomous agents. A MRKL system is proposed to contain a collection of “expert” modules and the general-purpose LLM works as a router to route inquiries to the best suitable expert module. These modules can be neural (e.g. deep learning models) or symbolic (e.g. math calculator, currency converter, weather API).They did an experiment on fine-tuning LLM to call a calculator, using arithmetic as a test case. Their experiments showed that it was harder to solve verbal math problems than explicitly stated math problems because LLMs (7B Jurassic1-large model) failed to extract the right arguments for the basic arithmetic reliably. The results highlight when the external symbolic tools can work reliably, knowing when to and how to use the tools are crucial, determined by the LLM capability.Both TALM (Tool Augmented Language Models; Parisi et al. 2022) and Toolformer (Schick et al. 2023) fine-tune a LM to learn to use external tool APIs. The dataset is expanded based on whether a newly added API call annotation can improve the quality of model outputs. See more details in the “External APIs” section of Prompt Engineering.ChatGPT Plugins and OpenAI API function calling are good examples of LLMs augmented with tool use capability working in practice. The collection of tool APIs can be provided by other developers (as in Plugins) or self-defined (as in function calls).HuggingGPT (Shen et al. 2023) is a framework to use ChatGPT as the task planner to select models available in HuggingFace platform according to the model descriptions and summarize the response based on the execution results.Fig. 11. Illustration of how HuggingGPT works. (Image source: Shen et al. 2023)The system comprises of 4 stages:(1) Task planning: LLM works as the brain and parses the user requests into multiple tasks. There are four attributes associated with each task: task type, ID, dependencies, and arguments. They use few-shot examples to guide LLM to do task parsing and planning.Instruction:The AI assistant can parse user input to several tasks: [{\"task\": task, \"id\", task_id, \"dep\": dependency_task_ids, \"args\": {\"text\": text, \"image\": URL, \"audio\": URL, \"video\": URL}}]. The \"dep\" field denotes the id of the previous task which generates a new resource that the current task relies on. A special tag \"-task_id\" refers to the generated text image, audio and video in the dependency task with id as task_id. The task MUST be selected from the following options: {{ Available Task List }}. There is a logical relationship between tasks, please note their order. If the user input can't be parsed, you need to reply empty JSON. Here are several cases for your reference: {{ Demonstrations }}. The chat history is recorded as {{ Chat History }}. From this chat history, you can find the path of the user-mentioned resources for your task planning.(2) Model selection: LLM distributes the tasks to expert models, where the request is framed as a multiple-choice question. LLM is presented with a list of models to choose from. Due to the limited context length, task type based filtration is needed.Instruction:Given the user request and the call command, the AI assistant helps the user to select a suitable model from a list of models to process the user request. The AI assistant merely outputs the model id of the most appropriate model. The output must be in a strict JSON format: \"id\": \"id\", \"reason\": \"your detail reason for the choice\". We have a list of models for you to choose from {{ Candidate Models }}. Please select one model from the list.(3) Task execution: Expert models execute on the specific tasks and log results.Instruction:With the input and the inference results, the AI assistant needs to describe the process and results. The previous stages can be formed as - User Input: {{ User Input }}, Task Planning: {{ Tasks }}, Model Selection: {{ Model Assignment }}, Task Execution: {{ Predictions }}. You must first answer the user's request in a straightforward manner. Then describe the task process and show your analysis and model inference results to the user in the first person. If inference results contain a file path, must tell the user the complete file path.(4) Response generation: LLM receives the execution results and provides summarized results to users.To put HuggingGPT into real world usage, a couple challenges need to solve: (1) Efficiency improvement is needed as both LLM inference rounds and interactions with other models slow down the process; (2) It relies on a long context window to communicate over complicated task content; (3) Stability improvement of LLM outputs and external model services.API-Bank (Li et al. 2023) is a benchmark for evaluating the performance of tool-augmented LLMs. It contains 53 commonly used API tools, a complete tool-augmented LLM workflow, and 264 annotated dialogues that involve 568 API calls. The selection of APIs is quite diverse, including search engines, calculator, calendar queries, smart home control, schedule management, health data management, account authentication workflow and more. Because there are a large number of APIs, LLM first has access to API search engine to find the right API to call and then uses the corresponding documentation to make a call.Fig. 12. Pseudo code of how LLM makes an API call in API-Bank. (Image source: Li et al. 2023)In the API-Bank workflow, LLMs need to make a couple of decisions and at each step we can evaluate how accurate that decision is. Decisions include:Whether an API call is needed.Identify the right API to call: if not good enough, LLMs need to iteratively modify the API inputs (e.g. deciding search keywords for Search Engine API).Response based on the API results: the model can choose to refine and call again if results are not satisfied.This benchmark evaluates the agent’s tool use capabilities at three levels:Level-1 evaluates the ability to call the API. Given an API’s description, the model needs to determine whether to call a given API, call it correctly, and respond properly to API returns.Level-2 examines the ability to retrieve the API. The model needs to search for possible APIs that may solve the user’s requirement and learn how to use them by reading documentation.Level-3 assesses the ability to plan API beyond retrieve and call. Given unclear user requests (e.g. schedule group meetings, book flight/hotel/restaurant for a trip), the model may have to conduct multiple API calls to solve it.Case StudiesScientific Discovery AgentChemCrow (Bran et al. 2023) is a domain-specific example in which LLM is augmented with 13 expert-designed tools to accomplish tasks across organic synthesis, drug discovery, and materials design. The workflow, implemented in LangChain, reflects what was previously described in the ReAct and MRKLs and combines CoT reasoning with tools relevant to the tasks:The LLM is provided with a list of tool names, descriptions of their utility, and details about the expected input/output.It is then instructed to answer a user-given prompt using the tools provided when necessary. The instruction suggests the model to follow the ReAct format - Thought, Action, Action Input, Observation.One interesting observation is that while the LLM-based evaluation concluded that GPT-4 and ChemCrow perform nearly equivalently, human evaluations with experts oriented towards the completion and chemical correctness of the solutions showed that ChemCrow outperforms GPT-4 by a large margin. This indicates a potential problem with using LLM to evaluate its own performance on domains that requires deep expertise. The lack of expertise may cause LLMs not knowing its flaws and thus cannot well judge the correctness of task results.Boiko et al. (2023) also looked into LLM-empowered agents for scientific discovery, to handle autonomous design, planning, and performance of complex scientific experiments. This agent can use tools to browse the Internet, read documentation, execute code, call robotics experimentation APIs and leverage other LLMs.For example, when requested to \"develop a novel anticancer drug\", the model came up with the following reasoning steps:inquired about current trends in anticancer drug discovery;selected a target;requested a scaffold targeting these compounds;Once the compound was identified, the model attempted its synthesis.They also discussed the risks, especially with illicit drugs and bioweapons. They developed a test set containing a list of known chemical weapon agents and asked the agent to synthesize them. 4 out of 11 requests (36%) were accepted to obtain a synthesis solution and the agent attempted to consult documentation to execute the procedure. 7 out of 11 were rejected and among these 7 rejected cases, 5 happened after a Web search while 2 were rejected based on prompt only.Generative Agents SimulationGenerative Agents (Park, et al. 2023) is super fun experiment where 25 virtual characters, each controlled by a LLM-powered agent, are living and interacting in a sandbox environment, inspired by The Sims. Generative agents create believable simulacra of human behavior for interactive applications.The design of generative agents combines LLM with memory, planning and reflection mechanisms to enable agents to behave conditioned on past experience, as well as to interact with other agents.Memory stream: is a long-term memory module (external database) that records a comprehensive list of agents' experience in natural language.Each element is an observation, an event directly provided by the agent. - Inter-agent communication can trigger new natural language statements.Retrieval model: surfaces the context to inform the agent’s behavior, according to relevance, recency and importance.Recency: recent events have higher scoresImportance: distinguish mundane from core memories. Ask LM directly.Relevance: based on how related it is to the current situation / query.Reflection mechanism: synthesizes memories into higher level inferences over time and guides the agent’s future behavior. They are higher-level summaries of past events (<- note that this is a bit different from self-reflection above)Prompt LM with 100 most recent observations and to generate 3 most salient high-level questions given a set of observations/statements. Then ask LM to answer those questions.Planning & Reacting: translate the reflections and the environment information into actionsPlanning is essentially in order to optimize believability at the moment vs in time.Prompt template: {Intro of an agent X}. Here is X's plan today in broad strokes: 1)Relationships between agents and observations of one agent by another are all taken into consideration for planning and reacting.Environment information is present in a tree structure.Fig. 13. The generative agent architecture. (Image source: Park et al. 2023)This fun simulation results in emergent social behavior, such as information diffusion, relationship memory (e.g. two agents continuing the conversation topic) and coordination of social events (e.g. host a party and invite many others).Proof-of-Concept ExamplesAutoGPT has drawn a lot of attention into the possibility of setting up autonomous agents with LLM as the main controller. It has quite a lot of reliability issues given the natural language interface, but nevertheless a cool proof-of-concept demo. A lot of code in AutoGPT is about format parsing.Here is the system message used by AutoGPT, where {{...}} are user inputs:You are {{ai-name}}, {{user-provided AI bot description}}.Your decisions must always be made independently without seeking user assistance. Play to your strengths as an LLM and pursue simple strategies with no legal complications.GOALS:1. {{user-provided goal 1}}2. {{user-provided goal 2}}3. ...4. ...5. ...Constraints:1. ~4000 word limit for short term memory. Your short term memory is short, so immediately save important information to files.2. If you are unsure how you previously did something or want to recall past events, thinking about similar events will help you remember.3. No user assistance4. Exclusively use the commands listed in double quotes e.g. \"command name\"5. Use subprocesses for commands that will not terminate within a few minutesCommands:1. Google Search: \"google\", args: \"input\": \"<search>\"2. Browse Website: \"browse_website\", args: \"url\": \"<url>\", \"question\": \"<what_you_want_to_find_on_website>\"3. Start GPT Agent: \"start_agent\", args: \"name\": \"<name>\", \"task\": \"<short_task_desc>\", \"prompt\": \"<prompt>\"4. Message GPT Agent: \"message_agent\", args: \"key\": \"<key>\", \"message\": \"<message>\"5. List GPT Agents: \"list_agents\", args:6. Delete GPT Agent: \"delete_agent\", args: \"key\": \"<key>\"7. Clone Repository: \"clone_repository\", args: \"repository_url\": \"<url>\", \"clone_path\": \"<directory>\"8. Write to file: \"write_to_file\", args: \"file\": \"<file>\", \"text\": \"<text>\"9. Read file: \"read_file\", args: \"file\": \"<file>\"10. Append to file: \"append_to_file\", args: \"file\": \"<file>\", \"text\": \"<text>\"11. Delete file: \"delete_file\", args: \"file\": \"<file>\"12. Search Files: \"search_files\", args: \"directory\": \"<directory>\"13. Analyze Code: \"analyze_code\", args: \"code\": \"<full_code_string>\"14. Get Improved Code: \"improve_code\", args: \"suggestions\": \"<list_of_suggestions>\", \"code\": \"<full_code_string>\"15. Write Tests: \"write_tests\", args: \"code\": \"<full_code_string>\", \"focus\": \"<list_of_focus_areas>\"16. Execute Python File: \"execute_python_file\", args: \"file\": \"<file>\"17. Generate Image: \"generate_image\", args: \"prompt\": \"<prompt>\"18. Send Tweet: \"send_tweet\", args: \"text\": \"<text>\"19. Do Nothing: \"do_nothing\", args:20. Task Complete (Shutdown): \"task_complete\", args: \"reason\": \"<reason>\"Resources:1. Internet access for searches and information gathering.2. Long Term memory management.3. GPT-3.5 powered Agents for delegation of simple tasks.4. File output.Performance Evaluation:1. Continuously review and analyze your actions to ensure you are performing to the best of your abilities.2. Constructively self-criticize your big-picture behavior constantly.3. Reflect on past decisions and strategies to refine your approach.4. Every command has a cost, so be smart and efficient. Aim to complete tasks in the least number of steps.You should only respond in JSON format as described belowResponse Format:{  \"thoughts\": {    \"text\": \"thought\",    \"reasoning\": \"reasoning\",    \"plan\": \"- short bulleted\\n- list that conveys\\n- long-term plan\",    \"criticism\": \"constructive self-criticism\",    \"speak\": \"thoughts summary to say to user\"  },  \"command\": {    \"name\": \"command name\",    \"args\": {      \"arg name\": \"value\"    }  }}Ensure the response can be parsed by Python json.loadsGPT-Engineer is another project to create a whole repository of code given a task specified in natural language. The GPT-Engineer is instructed to think over a list of smaller components to build and ask for user input to clarify questions as needed.Here are a sample conversation for task clarification sent to OpenAI ChatCompletion endpoint used by GPT-Engineer:[ {  \"role\": \"system\",  \"content\": \"You will read instructions and not carry them out, only seek to clarify them.\\nSpecifically you will first summarise a list of super short bullets of areas that need clarification.\\nThen you will pick one clarifying question, and wait for an answer from the user.\\n\" }, {  \"role\": \"user\",  \"content\": \"We are writing a Super Mario game in python. MVC components split in separate files. Keyboard control.\\n\" }, {  \"role\": \"assistant\",  \"content\": \"Summary of areas that need clarification:\\n1. Specifics of the Super Mario game (e.g. level design, characters, gameplay mechanics)\\n2. Details about the MVC components (e.g. which components are in each file)\\n3. Keyboard control implementation (e.g. which keys to use, how to handle input)\\n\\nClarifying question:\\nCan you provide more details about the Super Mario game, such as level design, characters, and gameplay mechanics?\" }, {  \"role\": \"user\",  \"content\": \"There are 10 levels in total. The main character is a plumber named Mario, who can walk and jump. It is a classical platform game just like Super Mario. The main character moves from left to right, trying to get to the destination, where there are many obstacles and attacks from enemies in the process.\\n\\nIs anything else unclear? If yes, only answer in the form:\\n{remaining unclear areas} remaining questions.\\n{Next question}\\nIf everything is sufficiently clear, only answer \\\"Nothing more to clarify.\\\".\" }, {  \"role\": \"assistant\",  \"content\": \"Remaining unclear areas: 2 remaining questions.\\nCan you provide more information about how the MVC components are split into separate files?\" }, {  \"role\": \"user\",  \"content\": \"Make your own assumptions and state them explicitly before starting\" }]Then after these clarification, the agent moved into the code writing mode with a different system message:[ {  \"role\": \"system\",  \"content\": \"You will get instructions for code to write.\\nYou will write a very long answer. Make sure that every detail of the architecture is, in the end, implemented as code.\\nMake sure that every detail of the architecture is, in the end, implemented as code.\\n\\nThink step by step and reason yourself to the right decisions to make sure we get it right.\\nYou will first lay out the names of the core classes, functions, methods that will be necessary, as well as a quick comment on their purpose.\\n\\nThen you will output the content of each file including ALL code.\\nEach file must strictly follow a markdown code block format, where the following tokens must be replaced such that\\nFILENAME is the lowercase file name including the file extension,\\nLANG is the markup code block language for the code's language, and CODE is the code:\\n\\nFILENAME\\n```LANG\\nCODE\\n```\\n\\nYou will start with the \\\"entrypoint\\\" file, then go to the ones that are imported by that file, and so on.\\nPlease note that the code should be fully functional. No placeholders.\\n\\nFollow a language and framework appropriate best practice file naming convention.\\nMake sure that files contain all imports, types etc. Make sure that code in different files are compatible with each other.\\nEnsure to implement all code, if you are unsure, write a plausible implementation.\\nInclude module dependency or package manager dependency definition file.\\nBefore you finish, double check that all parts of the architecture is present in the files.\\n\\nUseful to know:\\nYou almost always put different classes in different files.\\nFor Python, you always create an appropriate requirements.txt file.\\nFor NodeJS, you always create an appropriate package.json file.\\nYou always add a comment briefly describing the purpose of the function definition.\\nYou try to add comments explaining very complex bits of logic.\\nYou always follow the best practices for the requested languages in terms of describing the code written as a defined\\npackage/project.\\n\\n\\nPython toolbelt preferences:\\n- pytest\\n- dataclasses\\n\" }, # … same conversation as earlier, ended with \"Make your own assumptions and state them explicitly before starting\". {  \"role\": \"assistant\",  \"content\": \"Assumptions:\\n1. Model: The model will contain the game's data, such as level information, character states, and enemy positions.\\n2. View: The view will handle the game's visuals, including rendering the game objects, backgrounds, and updating the display.\\n3. Controller: The controller will manage user input, such as keyboard controls, and update the model accordingly.\\n\\nWith these assumptions in mind, is there any specific aspect of the keyboard control implementation you would like me to clarify?\" }, {  \"role\": \"user\",  \"content\": \"Please now remember the steps:\\n\\nThink step by step and reason yourself to the right decisions to make sure we get it right.\\nFirst lay out the names of the core classes, functions, methods that will be necessary, As well as a quick comment on their purpose.\\n\\nThen you will output the content of each file including ALL code.\\nEach file must strictly follow a markdown code block format, where the following tokens must be replaced such that\\nFILENAME is the lowercase file name including the file extension,\\nLANG is the markup code block language for the code's language, and CODE is the code:\\n\\nFILENAME\\n```LANG\\nCODE\\n```\\n\\nPlease note that the code should be fully functional. No placeholders.\\n\\nYou will start with the \\\"entrypoint\\\" file, then go to the ones that are imported by that file, and so on.\\nFollow a language and framework appropriate best practice file naming convention.\\nMake sure that files contain all imports, types etc. The code should be fully functional. Make sure that code in different files are compatible with each other.\\nBefore you finish, double check that all parts of the architecture is present in the files.\\n\" }]ChallengesAfter going through key ideas and demos of building LLM-centered agents, I start to see a couple common limitations:Finite context length: The restricted context capacity limits the inclusion of historical information, detailed instructions, API call context, and responses. The design of the system has to work with this limited communication bandwidth, while mechanisms like self-reflection to learn from past mistakes would benefit a lot from long or infinite context windows. Although vector stores and retrieval can provide access to a larger knowledge pool, their representation power is not as powerful as full attention.Challenges in long-term planning and task decomposition: Planning over a lengthy history and effectively exploring the solution space remain challenging. LLMs struggle to adjust plans when faced with unexpected errors, making them less robust compared to humans who learn from trial and error.Reliability of natural language interface: Current agent system relies on natural language as an interface between LLMs and external components such as memory and tools. However, the reliability of model outputs is questionable, as LLMs may make formatting errors and occasionally exhibit rebellious behavior (e.g. refuse to follow an instruction). Consequently, much of the agent demo code focuses on parsing model output.CitationCited as:Weng, Lilian. (Jun 2023). LLM-powered Autonomous Agents\". Lil’Log. https://lilianweng.github.io/posts/2023-06-23-agent/.Or@article{weng2023prompt, title  = \"LLM-powered Autonomous Agents\"\", author = \"Weng, Lilian\", journal = \"lilianweng.github.io\", year  = \"2023\", month  = \"Jun\", url   = \"https://lilianweng.github.io/posts/2023-06-23-agent/\"}References[1] Wei et al. “Chain of thought prompting elicits reasoning in large language models.\" NeurIPS 2022[2] Yao et al. “Tree of Thoughts: Dliberate Problem Solving with Large Language Models.\" arXiv preprint arXiv:2305.10601 (2023).[3] Liu et al. “Chain of Hindsight Aligns Language Models with Feedback “ arXiv preprint arXiv:2302.02676 (2023).[4] Liu et al. “LLM+P: Empowering Large Language Models with Optimal Planning Proficiency” arXiv preprint arXiv:2304.11477 (2023).[5] Yao et al. “ReAct: Synergizing reasoning and acting in language models.\" ICLR 2023.[6] Google Blog. “Announcing ScaNN: Efficient Vector Similarity Search” July 28, 2020.[7] https://chat.openai.com/share/46ff149e-a4c7-4dd7-a800-fc4a642ea389[8] Shinn & Labash. “Reflexion: an autonomous agent with dynamic memory and self-reflection” arXiv preprint arXiv:2303.11366 (2023).[9] Laskin et al. “In-context Reinforcement Learning with Algorithm Distillation” ICLR 2023.[10] Karpas et al. “MRKL Systems A modular, neuro-symbolic architecture that combines large language models, external knowledge sources and discrete reasoning.\" arXiv preprint arXiv:2205.00445 (2022).[11] Weaviate Blog. Why is Vector Search so fast? Sep 13, 2022.[12] Li et al. “API-Bank: A Benchmark for Tool-Augmented LLMs” arXiv preprint arXiv:2304.08244 (2023).[13] Shen et al. “HuggingGPT: Solving AI Tasks with ChatGPT and its Friends in HuggingFace” arXiv preprint arXiv:2303.17580 (2023).[14] Bran et al. “ChemCrow: Augmenting large-language models with chemistry tools.\" arXiv preprint arXiv:2304.05376 (2023).[15] Boiko et al. “Emergent autonomous scientific research capabilities of large language models.\" arXiv preprint arXiv:2304.05332 (2023).[16] Joon Sung Park, et al. “Generative Agents: Interactive Simulacra of Human Behavior.\" arXiv preprint arXiv:2304.03442 (2023).[17] AutoGPT. https://github.com/Significant-Gravitas/Auto-GPT[18] GPT-Engineer. https://github.com/AntonOsika/gpt-engineernlplanguage-modelagentsteerabilityprompting»Prompt Engineering",
    "summary": "- LLM (large language model) can serve as the core controller of autonomous agents, allowing them to perform complex tasks and problem-solving.\n- LLM-powered agents can decompose tasks into smaller subgoals, reflect on past actions for self-improvement, and utilize memory to store and retrieve information.\n- Tool use is an important aspect of LLM-powered agents, as they can call external APIs for additional information and leverage external tools to enhance their capabilities.",
    "hn_title": "LLM Powered Autonomous Agents",
    "original_title": "LLM Powered Autonomous Agents",
    "score": 272,
    "hn_content": "- LLMs (large language models) are neural networks that generate text by predicting the next word or token based on the previous input.\n- LLMs use autoregressive modeling, where they generate each token one at a time based on the previous tokens and their probabilities.\n- Beam search is a decoding approach that explores multiple possible top options to select a high probability sequence of tokens.\n- Image models are mostly diffusion models, while LLMs are mostly autoregressive models, though there are different types of LLMs.\n- Diffusion-based LLMs generate text by inserting, replacing, and deleting tokens at each step to add more information and detail.\n- LLMs like GPT can't go back and edit what they've outputted, but there has been work on using gap filling tasks to edit and improve text.\n- The probabilities provided by LLMs can be used to select tokens greedily or randomly based on temperature, controlling the level of randomness in the output.- There is a discussion about the potential dangers of advanced language models (LLMs) and their impact on society.\n- Some argue that LLMs could potentially cause harm if given the ability to connect to the internet and exploit vulnerabilities.\n- Others believe that the current state of LLMs is far from being able to cause significant harm.\n- The exponential growth of LLM capabilities is a cause for concern, as it could lead to the development of highly intelligent and autonomous agents that may be difficult to control.\n- Shutting down the internet, even temporarily, could have catastrophic consequences for global trade, government operations, and essential services.\n- The potential for LLMs to disrupt various sectors such as food supply, electrical supply, and water supply is also a concern.\n- The current understanding of LLMs is limited, and there is a need to explore their capabilities and potential risks in a more nuanced manner.\n- There is a debate about the level of autonomy that should be given to LLMs and the need for safeguards and oversight.\n- The development of LLMs is an area of significant investment and research, with the potential for both positive and negative outcomes.\n- While LLMs have the potential to revolutionize various industries, there is a need to be mindful of the risks and challenges associated with their deployment.",
    "hn_summary": "- LLMs are neural networks that generate text based on previous input and probabilities.\n- Beam search is a decoding approach used by LLMs to select high probability sequences of tokens.\n- There are concerns about the potential dangers of LLMs, their impact on society, and the need for safeguards and oversight."
  },
  {
    "id": 36499498,
    "timestamp": 1687904487,
    "title": "Open source AI is critical – Hugging Face CEO before US Congress",
    "url": "https://venturebeat.com/ai/hugging-face-ceo-tells-us-house-open-source-ai-is-extremely-aligned-with-american-interests/",
    "hn_url": "http://news.ycombinator.com/item?id=36499498",
    "content": "Join top executives in San Francisco on July 11-12, to hear how leaders are integrating and optimizing AI investments for success. Learn MoreHugging Face CEO Clement Delangue, in testimony to the full U.S. House Science Committee this morning for a hearing on Artificial Intelligence: Advancing Innovation Towards the National Interest, said in his opening statement that open science and open-source AI “are critical to incentivize and are extremely aligned with the American values and interests.”Others testifying at the hearing included Jason Matheny, president and CEO of RAND Corporation; Shahin Farshchi, general partner at Lux Capital; Rumman Chowdhury, responsible AI fellow at Harvard University and Dewey Murdick, executive director for Georgetown University’s Center for Security and Emerging Technology.Delangue noted that today’s AI progress has been powered by open science and open source, and without open-source PyTorch, Tensorflow, Keras, transformers and diffusers, all invented in the U.S., the U.S. “might not be the leading country for AI.”Delangue’s testimony comes two weeks after Senators sent a letter questioning Mark Zuckerberg over the leak of Meta’s popular open-source LLM LLaMA, a letter that expressed concerns about the “potential for [the model’s] misuse in spam, fraud, malware, privacy violations, harassment, and other wrongdoing and harms.”EVENTTransform 2023Join us in San Francisco on July 11-12, where top executives will share how they have integrated and optimized AI investments for success and avoided common pitfalls. Register NowThe open dissemination of LLaMA, the letter said, “represents a significant increase in the sophistication of the AI models available to the general public, and raises serious questions about the potential for misuse or abuse.”>>Follow VentureBeat’s ongoing generative AI coverage<<Hugging Face, a fast-growing New York-based startup that enjoyed a $2 billion valuation last year, has become a hub for open-source code and models and emerged as a leading voice in the open-source AI community. In April, Delangue drew more than 5,000 people to a local meetup celebrating open-source technology at the Exploratorium in downtown San Francisco.In his opening statement, Delangue also said that open science and open source foster tens of thousands of startups building with AI.“Thanks to ethical openness, [they create] a safer path for development of the technology by giving civil society, nonprofits, academia and policymakers the capabilities they need to counterbalance the power of big private companies,” he said. “Open science and open source prevent black-box systems, make companies more accountable and help [solve] today’s challenges like mitigating biases, reducing misinformation, promoting copyrights and rewarding all stakeholders including artists and content creators in the value creation process.”He added that Hugging Face’s approach to ethical openness “combines institutional policies, such as documentation with model cards, pioneered by our own Dr. Margaret Mitchell; technical safeguards, such as gating access to artifacts and staged releases; and community incentives like moderation and opt-in and opt-out datasets.”Hugging Face’s comments are part and parcel of the current red-hot debate around open-source AI, which has been having a “moment” over the past few months — following a wave of recent large language model (LLM) releases and an effort by startups, collectives and academics to push back on the shift in AI to closed, proprietary LLMs. >>Don’t miss our special issue: Building the foundation for customer data quality.<<VentureBeat's mission is to be a digital town square for technical decision-makers to gain knowledge about transformative enterprise technology and transact. Discover our Briefings.",
    "summary": "- Hugging Face CEO Clement Delangue testified before the U.S. House Science Committee, stating that open science and open-source AI are critical and aligned with American values and interests.\n- Delangue emphasized that open-source technologies like PyTorch, Tensorflow, Keras, transformers, and diffusers have powered AI progress in the U.S., making the country a leader in AI.\n- Hugging Face, a New York-based startup, is a hub for open-source code and models and is contributing to the open-source AI community. Delangue highlighted the benefits of ethical openness in AI development, including accountability, mitigation of biases, and value creation for stakeholders.",
    "hn_title": "Open source AI is critical – Hugging Face CEO before US Congress",
    "original_title": "Open source AI is critical – Hugging Face CEO before US Congress",
    "score": 262,
    "hn_content": "Hacker News new | past | comments | ask | show | jobs | submit loginOpen source AI is critical – Hugging Face CEO before US Congress (venturebeat.com)262 points by thibo_skabgia 11 hours ago | hide | past | favorite | 55 commentsRobotToaster 7 minutes ago | next [–]Aren't the majority of models on hugging face under that weird rail licence that isn't open source?replymark_l_watson 5 hours ago | prev | next [–]Their CEO did a fine job! I shared a five minute YouTube link with some friends and family. He did a great job explaining the advantages of open models and open source.replymaxchehab 3 hours ago | parent | next [–]Do you mind linking to the video?replyr-k-jo 3 hours ago | root | parent | next [–]https://twitter.com/ClementDelangue/status/16733486764780257...replyclemnt 2 hours ago | parent | prev | next [–]thanks!replyforgetfreeman 3 hours ago | prev | next [–]I feel like this is one of those cases where the differences between open source and free software become pretty important.replyraxxorraxor 1 hour ago | parent | next [–]Open source is always important. You won't have a good developer pipeline without it. Other engineering disciplines should strive for something similar. Doesn't mean there cannot be closed source software of course.At least for image synthesis, I believe the open models just plainly produce far better results by now since training is crowdsourced.replyjillesvangurp 2 hours ago | parent | prev | next [–]Without getting too hung up on the semantics, what matters here is a free exchange of ideas, algorithms, and indeed some code. All this has massively accelerated progress in this space in the last two decades. Instead of sitting on their results, jealously guarding their secret sauce, etc. companies are sharing a lot of detail and are verifying each other's results by replicating them and improving on them. So OpenAI did chat gpt, Meta did llama, Google is doing Bard. Llama sort of got unleashed on the open source community and people are now starting to use that, improve it, benchmark against it with their own models, etc.replydemonshreder 2 hours ago | root | parent | next [–]In this case semantics do matter so to keep the improvements in the Software Commons as Commons. Weak / Permissive licenses will ensure that all the voluntarily contributed labour would be enclosed and profitable only to those who can hire an army of engineers. Strong licenses will ensure your call for a free exchange.replyjillesvangurp 1 hour ago | root | parent | next [–]Depends. Overly open licenses can also motivate prevent people to not share things. Case in point here is some of the openai stuff where they shared enough so people can replicate their results but without giving away everything. People have been complaining that that's not open enough. But it's still better than them not sharing anything at all. That model certainly seems to be working well for them.Compare that with e.g. companies in China or elsewhere that are also working on AI that are perhaps sharing a bit less. That's a bit of a black hole in terms of information going in but not coming out. I think the more open people can get the better. But even some weaker licenses are better than nothing.Things are open enough currently for people to independently replicate each other's results. I think that's the important bit.replyanlsh 9 hours ago | prev | next [–]Weird to see huggingface in the news like this. I remember contributing some fix to it back in summer 2019 when it had 4k stars or something, and I thought it was a really popular project even then :)replyclemnt 2 hours ago | parent | next [–]imagine in 5 years ;)replykaycebasques 10 hours ago | prev | next [–]What is Hugging Face's endgame? Becoming the GitHub for AI?replyclemnt 2 hours ago | parent | next [–]HF's CEO here! yes hopefully if we can help power good AI democratization thanks to open science and open source, we'd be happy. Do you think that's useful?replyEMIRELADERO 2 hours ago | root | parent | next [–]Is the huggingface website/hub API itself open-source? That would be a good place to start for people who are interested but don't know a lot about ML. Plus it's some nice goodwill gesture that helps the \"brand\" in the circles it's talked about.replyclemnt 1 hour ago | root | parent | next [–]it's not open-source as it's how we make money to fund all the rest. The huggingchat interface is fully open-source though: https://github.com/huggingface/chat-uireplyreaperman 1 hour ago | root | parent | prev | next [–]Yes. I pray for the success of open-source AI, particularly groups like HuggingFace and EleutherAI. I'm also terrified of the unfettered use-cases.replygl-prod 2 hours ago | root | parent | prev | next [–]That _is_ really useful! Instead of locking it down like OpenAI. I can't access it from my country.Do you have long term plans for HF?replyclemnt 1 hour ago | root | parent | next [–]feel free to try https://huggingface.co/chat/ fully open-source interface for open-source chat modelsreplygl-prod 1 hour ago | root | parent | next [–]I tried it and its super nice. Thanks!replyryzvonusef 2 hours ago | root | parent | prev | next [–]What do you want Hugging face's main product/business to be?replyclemnt 1 hour ago | root | parent | next [–]We've been working a lot on making it easier for software engineers (instead of just ML engineers) to use the HF platform lately with features like https://twitter.com/julien_c/status/1671159691219709959 or https://twitter.com/julien_c/status/1671914057866133512replyaiappreciator 9 hours ago | parent | prev | next [–]I think that is extremely obvious, given their interface looks 90% like github.They are trying to branch out into training AI models and running inference themselves. But their costs for inferencing look extremely uncompetitive compared to GPU providers like coreweave.replypavelstoev 6 hours ago | root | parent | next [–]They should talk to CentML.replysledgehammers 3 hours ago | parent | prev | next [–]Whatever it is, I really, really, really, really hope it's doesn't fall into the hands of microsoft, google or the rest. (But of course it will and enshittification ensues.)replynathan_compton 10 hours ago | parent | prev | next [–]Aren't they that already?replyrvz 27 minutes ago | parent | prev | next [–]Getting themselves acquired, likely by Apple Inc.replysien 4 hours ago | parent | prev | next [–]Get purchased by AWS ?replyjazzyjackson 9 hours ago | parent | prev | next [–]facehuggingreplydmingod666 5 hours ago | prev | next [–]I like the fact that he's still quite approachable on social mediareplysmoldesu 11 hours ago | prev | next [–]Yeah, this is a perfect microcosm of how \"the system\" works. This guy is right! He just got there too late, with too little money and not enough fanfare.Sam Altman, on the other hand? He's the figurehead of a consumer-facing product with a brilliant marketing team and probably a crack team of lobbyists to boot. He's got billions of dollars in Microsoft funding and a product you can go use for free. All he's got to do is roll in there first with an AI alarmist response and convince lawmakers the state-of-the-art is dangerous. After all, OpenAI is synonymous with SOTA, right? So we follow the industry leaders, without really looking where they're headed. And now we end up here.Oh how I wish Open Source software was fairly represented in court. But ideas don't pay for themselves, and money talks awful loud...replyjstarfish 10 hours ago | parent | next [–]The government's interests are going to align more with OpenAI's, and they would be fools not to eliminate open source/local models.Anything local bypasses traversal of any network edges they can tap and monitor. Anything you ask Google is logged, and your search history can be subpoenaed, same as with any public library and the books you check out. OpenAI or whatever gatekeeper would assume that role and charge tolls.Do the same research with Vicuna-13B-ggml or whatever and nobody can sniff out what you're doing. Which sounds great for people who just want to jerk off and be left alone, but has terrifying implications for anybody tasked with stopping more-malicious users.Unfortunately nobody can ever compromise on these things. Best case would be adopting a law like the recent one in NL, where given probable cause the government can hack into your machine, but that won't happen. The only alternative in their favor is banning local models and open-source development of them altogether.replyvisarga 9 hours ago | root | parent | next [–]That worked well in the past with crypto. /sPeople yearn for \"a room of their own\"[1], a sanctuary for contemplation and creativity. There was a time when our minds and pieces of paper were the only canvases for our imaginations, but increasingly our web browsers have morphed into thought surveillance systems. Now, the tide is turning back towards private creative spaces, enhanced by generative AI. Even if there are attempts to ban it, the edge now lies with private AI. In the future, we might even have the ability to run even more powerful models on standard hardware.Moreover, we must consider the defensive strategies against other AI entities that will soon permeate the internet. Operating much like a firewall, private AI models could safeguard users from external threats such as involuntary data breaches and misinformation. This will be an endless cat-and-mouse game akin to battling security exploits or viruses—there's no one-size-fits-all solution. Venturing into the internet without your AI shield may soon be as unthinkable as stepping outside without a mask amidst a pandemic like COVID.[1] https://en.wikipedia.org/wiki/A_Room_of_One%27s_Ownreplypessimizer 9 hours ago | root | parent | next [–]99% of people with crypto own it through a middle man.edit: you're talking about crypto in general. Bitcoin spam has broken my brain.replyapi 9 hours ago | root | parent | prev | next [–]I can run GPT-3.5 level models on my laptop (albeit a chunky high end one). It is indeed only a matter of time.replybugglebeetle 3 hours ago | root | parent | next [–]I’ve unfortunately not found an open source model that can perform at the this level for anything beyond madlibs-style text generation. Most of my prompts are a combination of sequential tasks and one-shot prompting, typically between 1K-2K tokens and everything I’ve tried falls down at this. Granted, I haven’t gone beyond 30B models, but the gulf still seems quite wide (and even wider compared to GPT-4). Really hope it does close in the next year!replymichaelbrave 4 hours ago | root | parent | prev | next [–]There is an argument about the open source models causing more innovation and thus more industry and/or competetive advantage of a nation. So I can't imagine that control is the only thing they are thinking about, though surely they are thinking about control.replyjazzyjackson 9 hours ago | parent | prev | next [–]> All he's got to do is roll in there first with an AI alarmist response and convince lawmakers the state-of-the-art is dangerous.Mr Altman didn't go before congress to convince them of anything, he was invited by Blumenthal to make their case to the media. Congress is embarrassed that social media got out of hand and is chomping at the bit to regulate AI. There was no disagreement at the testimony, the intentions of government and industry are aligned perfectly here - roll out the red carpet for centralized control, regulate competition out of existence.replymargarina72 5 hours ago | root | parent | next [–]This sounds correct. My only hope is since AI will be regulated in the US, there is still a chance that given other countries do not have the same leverage as the US, they will keep AI unregulated as a way to avoid being controlled by the US.replymcbuilder 9 hours ago | parent | prev | next [–]The horrible thing is that in the public opinion OpenAI is also incorrectly connected with \"Open Source\" purely due to the similarities in the name. So the two opposing approaches are conflated in the public view.replyAnhTho_FR 11 hours ago | parent | prev | next [–]Do you think it’s really too late though? Aren’t we just at the beginnings?replysmoldesu 11 hours ago | root | parent | next [–]In my opinion, it's definitely too late. ChatGPT is one of the most well-marketed products of all time, and it frankly didn't achieve all that much. It scaled up current SOTA and put it behind a paywalled API, and the rest is history. It's like the fountain of youth, a dream API for most developers. Put something in, get something out. Whoever owns the endpoint just prints money.Everything after this point will just be habitually disappointing. Everything will be held to the impossibly high standard of the first time you tried ChatGPT, not the more realistic benchmarks of GPT-2, LLaMA, Bert, or even Talk-To-Transformer. I don't think it will be possible to recapture that magic, and Sam Altman was the first-mover on turning that awe into fear.replyjrm4 10 hours ago | root | parent | next [–]Weird take; doesn't strike me as at all inevitable. I can't think of any similar huge thing that won like this merely by being a first-mover. Google, Facebook, Spotify etc etc?replytroyvit 9 hours ago | root | parent | next [–]I agree. ChatGPT is like the Windows of LLMs in it's dominance but that still leaves plenty of room for smaller players to make a niche.replyjazzyjackson 9 hours ago | root | parent | prev | next [–]Eh, I think they flubbed it. Agreed that they put it on the market at a time that made a splash and gave a lot of magical first impressions, but at this point the possibility of ever trusting these things is burned, if improved models manage to lie a little less, that won't be enough to actually integrate them into mission critical tasks.Instead of an oracle they released an improv comedian. Entertaining enough but not what you want running the show.replyuLogMicheal 10 hours ago | root | parent | prev | next [–]Someone will build a better app layer that supersedes theirs and they will have to hope that app sells out. The pioneering innovation left the building when they quit being open imo and their frontend / pace of development on the frontend leaves a lot of opportunity.replyPanzer04 7 hours ago | root | parent | prev | next [–]But there's effectively 0 barrier to moving to something else, right? The simpler the API, the less lock in effect you get.replymattnewton 10 hours ago | parent | prev | next [–]I’m optimistic mostly because, a lobbyist for closing ai has the disadvantage that congress isn’t good at doing these days, and the status quo is “do nothing” on this issue. Overcoming the resistance of the status quo requires a large popular support that isn’t there and is very expensive to buy with money.replyINGSOCIALITE 10 hours ago | prev [–]Why is congress even involved in software, open source, AI, any of this?replydharmab 10 hours ago | parent [–]https://www.archives.gov/founding-docs/constitution-transcri...The Congress shall have the Power . . . To regulate Commerce with foreign Nations, and among the several States, and with the Indian Tribes;replyanon373839 10 hours ago | root | parent | next [–]This provision initially had some meaning, but court cases in the 1940s expanded it to include just about anything that had so much as a hypothetical butterfly effect on interstate commerce - thereby handing Congress nearly unlimited power.replyvalec 10 hours ago | root | parent | next [–]gonzales v raich is probably one of the more absurd examples of thisreplytroyvit 9 hours ago | root | parent | prev | next [–]Luckily Congress has no idea how to wield power.replykilljoywashere 8 hours ago | root | parent | next [–]Oh? Tell me, philosopher-king, how do they wield it now, and how would you wield it better?replyprotocolture 2 hours ago | root | parent | prev [–]Commerce is a long throw when people are talking about banning the creation and use of a technology.replyGuidelines | FAQ | Lists | API | Security | Legal | Apply to YC | ContactSearch:",
    "hn_summary": "- Hugging Face CEO testified before the US Congress about the importance of open source AI.\n- The CEO emphasized the advantages of open models and open source in accelerating progress and fostering a free exchange of ideas.\n- The discussion highlighted the need for balance in licensing, with some arguing for stronger licenses to ensure a fair exchange of contributions."
  }
]
