[
  {
    "id": 37880818,
    "title": "أي شيء مضى منذ فترة أطول من الأمس يجب أن يقول التاريخ الفعلي",
    "originLink": "https://grumpy.website/1389",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37880818",
    "commentBody": "",
    "originSummary": [
      "يثير المؤلف مخاوف بشأن استخدام تسميات الوقت النسبية مثل \"أمس\" و \"قبل 2 أيام\" على مواقع الويب ، بحجة أنها تشوه الإدراك البشري للوقت.",
      "يسلطون الضوء على كيف يمكن أن تتسبب الطرق المختلفة التي يتم بها تنفيذ هذه الملصقات في حدوث ارتباك وعدم ثقة.",
      "واقترح الاستعاضة عن هذه المراجع الزمنية الغامضة بتواريخ محددة توخيا للوضوح."
    ],
    "commentSummary": [
      "والنقطة المحورية في المناقشة هي استخدام الطوابع الزمنية النسبية على المواقع الشبكية والتطبيقات والحاجة إلى معلومات أكثر دقة عن التاريخ والوقت.",
      "ينتقد المؤلف معالجة جافا سكريبت القياسية للتاريخ والوقت ويوصي باستخدام مكتبات مثل Moment أو Luxon أو date-fns لتحسين إدارة التاريخ والوقت.",
      "تغطي المحادثة أيضا استخدام تلميحات الأدوات وتفضيلات المستخدم ومساحة الشاشة والتصميم البسيط وموازنتها مع توفير المعلومات ذات الصلة. يميل التفضيل نحو وجود تواريخ نسبية ومطلقة لاحتياجات المستخدم المختلفة."
    ],
    "points": 674,
    "commentCount": 314,
    "retryCount": 0,
    "time": 1697294377
  },
  {
    "id": 37880635,
    "title": "تقويض الديمقراطية: حملة المفوضية الأوروبية المثيرة للجدل للمراقبة",
    "originLink": "https://dannymekic.com/202310/undermining-democracy-the-european-commissions-controversial-push-for-digital-surveillance",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37880635",
    "commentBody": "",
    "originSummary": [
      "تقترح المفوضية الأوروبية لائحة للمسح التلقائي لتطبيقات الاتصالات الرقمية بحثا عن نشاط إجرامي ، مما يثير مخاوف بشأن انتهاك الخصوصية والتنفيذ غير السليم.",
      "تنشأ ادعاءات تدعي أن اللجنة تستخدم إعلانات متلاعبة ومعلومات مضللة لحشد الدعم العام لهذه اللوائح.",
      "تسبب الضغط من أجل زيادة المراقبة الرقمية في إثارة الجدل ، مما أدى إلى تأجيل مجلس الاتحاد الأوروبي التصويت على هذه القضية."
    ],
    "commentSummary": [],
    "points": 620,
    "commentCount": 338,
    "retryCount": 0,
    "time": 1697293006
  },
  {
    "id": 37879706,
    "title": "أداء لينكس",
    "originLink": "https://www.brendangregg.com/linuxperf.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37879706",
    "commentBody": "",
    "originSummary": [
      "يعد موقع Brendan Gregg على الويب مصدرا شاملا لأداء الأنظمة وتحليل أداء Linux ، بما في ذلك منشورات المدونات والكتب وأدوات تحليل الأداء والضبط والقياس.",
      "يتميز الموقع بمحادثات جريج وعروضه التقديمية حول مواضيع مختلفة مثل تحليل أداء الحاوية وأدوات تتبع Linux وقوائم مراجعة أداء هندسة موثوقية الموقع (SRE).",
      "بالإضافة إلى محتواه الخاص ، يقترح موقع الويب أيضا موارد قيمة أخرى لفهم أعمق لأداء Linux."
    ],
    "commentSummary": [
      "تتعمق المقالة في أدوات وتقنيات ضبط أداء Linux ، مع التركيز على دورها المهم في تحسين أداء التطبيقات في الوقت الفعلي على خوادم Debian و Ubuntu الافتراضية الخاصة (VPSs).",
      "يسلط الكاتب الضوء على مساهمة بريندان جريج الكبيرة في هذا المجال ، ويوصي بكتابه كمورد أساسي ، ويؤكد على أهمية تحسين زمن الوصول.",
      "كما يدعو إلى التعلم أثناء العمل واتخاذ قرارات مستنيرة عند تكوين خوادم قواعد البيانات وضبطها ، مما يسلط الضوء على تعقيد ضبط أداء Linux وأهمية توثيق المعرفة."
    ],
    "points": 331,
    "commentCount": 58,
    "retryCount": 0,
    "time": 1697283136
  },
  {
    "id": 37879935,
    "title": "F-Droid إصدار KDEConnect إلغاء تثبيته بواسطة PlayProtect",
    "originLink": "https://discuss.kde.org/t/f-droid-version-of-kdeconnect-uninstalled-by-playprotect/5992",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37879935",
    "commentBody": "",
    "originSummary": [
      "قامت PlayProtect ، وهي ميزة أمان على أجهزة Android ، بإزالة إصدار F-Droid من KDEConnect بشكل غير صحيح ، وتصنيفه على أنه مزيف.",
      "واجه مستخدمو KDEConnect هذه المشكلة ويطلبون حاليا المساعدة من مجتمع KDE."
    ],
    "commentSummary": [],
    "points": 324,
    "commentCount": 173,
    "retryCount": 0,
    "time": 1697286335
  },
  {
    "id": 37884683,
    "title": "مرشح uBlock المضاد ل Adblocker للتخلص من رسالة YouTube المزعجة",
    "originLink": "https://twitter.com/endermanch/status/1713129854818742684",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37884683",
    "commentBody": "",
    "originSummary": [
      "تم دمج مرشح جديد في uBlock Origin ، والذي له وظيفة تعطيل ميزة JavaScript anti-adblock على YouTube.",
      "يوفر هذا الابتكار حلا للمستخدمين من خلال القضاء على المشكلة المتكررة لرسالة مزعجة.",
      "UBlock Origin هي أداة شائعة تمكن مستخدمي الإنترنت من التحكم في المحتوى المعروض على شاشاتهم."
    ],
    "commentSummary": [
      "تتطرق المناقشة إلى جوانب متعددة من YouTube ، بما في ذلك استخدام كتلة الإعلانات ، وجدارة YouTube Premium ، واستياء المستخدم من نموذج أعمال YouTube وخدماته ، وخيارات تجاوز الإعلانات.",
      "يوجد نقاش مستمر حول الآثار الأخلاقية لحظر الإعلانات ، يقابلها ضرورة أن تكسب الشركات إيرادات بينما يتوقع المستخدمون محتوى مجانيا.",
      "تختلف المواقف حول هذه الموضوعات ، بدءا من الإحباط بشأن مواضع الإعلانات وانتهاكات الخصوصية ، إلى مقترحات الاشتراك في الخدمات المتميزة أو قبول وجود الإعلانات كحقيقة من حقائق النظام الأساسي."
    ],
    "points": 322,
    "commentCount": 348,
    "retryCount": 0,
    "time": 1697321180
  },
  {
    "id": 37879715,
    "title": "مرشح كالمان من الألف إلى الياء",
    "originLink": "https://www.kalmanfilter.net/default.aspx",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37879715",
    "commentBody": "",
    "originSummary": [
      "يسلط هذا الملخص الضوء على برنامج تعليمي وكتاب مخصص لخوارزمية Kalman Filter ، وهي لغة فنية لطريقة تستخدم لتقدير حالات النظام والتنبؤ بها وسط حالة عدم اليقين.",
      "تهدف الموارد التعليمية إلى إزالة الغموض عن الموضوع المعقد من خلال تقديم أمثلة عملية وتفسيرات واضحة ، ومعالجة المفاهيم الأساسية في البرنامج التعليمي واستكشاف الموضوعات المتقدمة مثل المرشحات غير الخطية في الكتاب.",
      "تقدم المادة ، التي ألفها محترف متمرس يتمتع بخبرة 20 عاما ، تفسيرات بديهية وأمثلة توضيحية لفهم مرشح كالمان بشكل كامل ، وهي خوارزمية مهمة لتقدير الحالات المخفية والتنبؤ بالحالات المستقبلية ، على الرغم من عدم اليقين في القياس والعملية."
    ],
    "commentSummary": [
      "تدور المناقشة في المقام الأول حول الارتباك وعدم الرضا فيما يتعلق بالبرامج التعليمية التي تتجاهل التوضيحات المهمة أو تفترض المعرفة السابقة ، مع التركيز على تنفيذ مرشح كالمان.",
      "يقارن المساهمون في المناقشة استخدام مرشحات كالمان ونماذج التعلم الآلي ، متفقين على أن كلتا التقنيتين لهما مزاياهما وعيوبهما.",
      "يشير الموضوع إلى أن مرشحات كالمان تستخدم على نطاق واسع في العديد من الصناعات ولكنها تتطلب معرفة بحدودها ، حيث روى أحد المعلقين صعوبة تطبيقها في بيئة الإنتاج."
    ],
    "points": 299,
    "commentCount": 130,
    "retryCount": 0,
    "time": 1697283298
  },
  {
    "id": 37881656,
    "title": "فحص قوالب السيليكون لمعالج Intel 386",
    "originLink": "http://www.righto.com/2023/10/intel-386-die-versions.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37881656",
    "commentBody": "",
    "originSummary": [
      "يفصل منشور المدونة السياق التاريخي وميزات معالج Intel 386 ، مع التأكيد على دوره في التحول إلى بنية 32 بت.",
      "يسلط الضوء على الدور الحاسم لمعالج 386 في تأسيس هيمنة x86 وتحويل صناعة الكمبيوتر.",
      "كما يتم توفير معلومات إضافية حول جوانب مثل عدد الترانزستور ، وتحسين الأداء ، وخط الأنابيب ، والوحدات الوظيفية ، وتردد IBM في دعم 386."
    ],
    "commentSummary": [
      "يناقش هذا المنشور معالج Intel 386 ، مع التركيز على أهميته التاريخية ، والتحسينات الفريدة ، وكيف يتناقض مع المعالجات المعاصرة.",
      "إنه يعطي نظرة ثاقبة لدور الكود الصغير في المعالجات ويتعمق في عملية تصميم Intel.",
      "يؤكد على تأثير المعالج 386 على حوسبة 32 بت ويتضمن حكايات شخصية يشاركها أحد المعلقين فيما يتعلق بالشريحة."
    ],
    "points": 247,
    "commentCount": 52,
    "retryCount": 0,
    "time": 1697299960
  },
  {
    "id": 37881771,
    "title": "إضافة Firefox لفتح مقاطع فيديو YouTube في واجهات أمامية بديلة",
    "originLink": "https://github.com/d3vr/yt-siphon",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37881771",
    "commentBody": "",
    "originSummary": [
      "قام أحد المستخدمين بتطوير إضافة Firefox كرد فعل على حظره بواسطة YouTube لاستخدام مانع الإعلانات.",
      "تمكنهم هذه الوظيفة الإضافية من فتح مقاطع الفيديو باستخدام واجهات أمامية بديلة ، بما في ذلك piped.video.",
      "يسمح للمستخدمين بتخصيص الواجهة الأمامية الافتراضية وتشغيل روابط المفاتيح لفتح مقاطع الفيديو في الواجهة الأمامية التي تم تكوينها."
    ],
    "commentSummary": [
      "تم إنشاء وظيفة إضافية ل Firefox تمكن المستخدمين من فتح مقاطع فيديو YouTube على منصات بديلة بعد حظر YouTube للمستخدمين الذين لديهم أدوات حظر الإعلانات.",
      "يقترح المستخدمون استخدام الإضافات لإعادة توجيه عناوين URL على YouTube إلى منصات مثل Invidious أو Piped للحصول على تجربة تصفح أكثر خصوصية ، ولكن هذا يثير مخاوف بشأن التأثيرات على مرات ظهور الإعلانات وتمويل المتصفحات مثل Firefox.",
      "تناقش المحادثة ما إذا كان يجب أن تتضمن المتصفحات إمكانات مضمنة لتجاوز تدابير الحظر ، مع إدراك أهمية الإعلانات والاشتراكات لتعويض تكاليف التخزين والنطاق الترددي."
    ],
    "points": 235,
    "commentCount": 83,
    "retryCount": 0,
    "time": 1697300571
  },
  {
    "id": 37879893,
    "title": "الموجات الصوتية المدمرة للورم تحصل على موافقة إدارة الغذاء والدواء الأمريكية لعلاج الكبد في البشر",
    "originLink": "https://news.umich.edu/tumor-destroying-sound-waves-receive-fda-approval-for-liver-treatment-in-humans/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37879893",
    "commentBody": "",
    "originSummary": [
      "أيدت إدارة الغذاء والدواء الأمريكية (FDA) تطبيق الموجات الصوتية ، وهي تقنية تعرف باسم تفتيت الأنسجة ، لتدمير أورام الكبد في أجسام البشر.",
      "تم تطوير هذا الابتكار من قبل جامعة ميشيغان وتنفيذه بواسطة HistoSonics ، وهو يستخدم الموجات فوق الصوتية لتوليد فقاعات دقيقة في الأورام ، مما يؤدي إلى تجزئتها والقضاء عليها من قبل الجهاز المناعي.",
      "لا يوفر تفتيت الأنسجة بديلا غير جراحي لعلاجات السرطان التقليدية ، مثل الجراحة والعلاج الكيميائي والإشعاعي فحسب ، بل يظهر أيضا فوائد محتملة لجهاز المناعة والتكامل المستقبلي مع العلاج المناعي أو توصيل الدواء."
    ],
    "commentSummary": [
      "وافقت إدارة الغذاء والدواء (FDA) على استخدام الموجات الصوتية المدمرة للورم لعلاج الكبد لدى البشر.",
      "تعتبر هذه التقنية طريقة كبيرة لإنقاذ الحياة منخفضة الصدمات."
    ],
    "points": 222,
    "commentCount": 4,
    "retryCount": 0,
    "time": 1697285762
  },
  {
    "id": 37879723,
    "title": "التماس ضد مراقبة الدردشة في الاتحاد الأوروبي",
    "originLink": "https://stopscanningme.eu/en/index.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37879723",
    "commentBody": "",
    "originSummary": [
      "ونظمت مظاهرات وصور مثيرة ضد لائحة الاتحاد الأوروبي CSA ، وهي اقتراح مراقبة جماعية ، في ستوكهولم وبرلين لإثارة مخاوف الخصوصية.",
      "سيشعر معظم الشباب من 13 دولة عضو في الاتحاد الأوروبي بضبط النفس في أنشطتهم السياسية أو استكشافهم للجنس إذا كانت اتصالاتهم الرقمية قيد التدقيق ، بناء على الملخص.",
      "يشجع الملخص على الانضمام إلى المعارضة ضد الاقتراح ، والتي تتكون من أكثر من 11000 فرد و 133 منظمة غير حكومية ، والبقاء على اطلاع بحملة Stop Scanning Me."
    ],
    "commentSummary": [
      "وتركز المناقشة على عريضة ضد تدابير الاتحاد الأوروبي المقترحة للسيطرة على الدردشة، مما أثار جدلا حول سوء الاستخدام المحتمل الذي يمكن أن يؤدي إلى أنظمة قمعية وإساءة استخدام السلطة.",
      "يجادل بعض المشاركين من أجل تحقيق توازن بين الحفاظ على الخصوصية ومكافحة الجرائم عبر الإنترنت مثل إساءة معاملة الأطفال والإرهاب ، مما يعكس وجهات نظر مختلفة حول كيفية تنظيم الاتصالات عبر الإنترنت.",
      "تتضمن المحادثة اقتراحات للاستفادة من حلول البرامج والأجهزة مفتوحة المصدر لضمان الخصوصية ومنع المراقبة غير المبررة."
    ],
    "points": 195,
    "commentCount": 31,
    "retryCount": 0,
    "time": 1697283448
  },
  {
    "id": 37880033,
    "title": "أرشيف سنودن – وثائق سربها سنودن",
    "originLink": "https://github.com/iamcryptoki/snowden-archive",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37880033",
    "commentBody": "",
    "originSummary": [
      "يتكون المستودع من وثائق مسربة من إدوارد سنودن ، تكشف عن ممارسات وكالة الأمن القومي مثل المراقبة والأنشطة الاستخباراتية والتجسس على الحكومات الأجنبية واختراق أنظمة الكمبيوتر.",
      "تكشف الوثائق عن دور وكالة الأمن القومي في عمليات القتل المستهدف وعلاقتها بفضائح تجسس متعددة.",
      "ترسم هذه النظرة العامة صورة لمدى وعمق المراقبة العالمية لوكالة الأمن القومي والأنشطة السرية."
    ],
    "commentSummary": [
      "يعج منتدى على الإنترنت بالمناقشات حول وثائق إدوارد سنودن المسربة وآثارها المحتملة على أفراد قطاع الدفاع.",
      "ويعرب الأعضاء عن مزيج من المخاوف بشأن حساسية البيانات وتداعياتها الأمنية المحتملة، إلى جانب الإحباط من الأجزاء غير المعلنة من هذه الوثائق.",
      "تمتد المحادثة إلى جوانب الشفافية الحكومية والصحافة والأخلاقيات المحيطة بتسريب المعلومات السرية."
    ],
    "points": 192,
    "commentCount": 40,
    "retryCount": 0,
    "time": 1697287325
  },
  {
    "id": 37887562,
    "title": "أرسلت Google الإنترنت إلى \"دوامة التراجع\" ، كما يدعي المؤسس المشارك ل DeepMind",
    "originLink": "https://www.telegraph.co.uk/business/2023/10/14/google-internet-spiral-of-decline-deepmind-mustafa-suleyman/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37887562",
    "commentBody": "",
    "originSummary": [
      "يؤكد المؤسس المشارك لمختبر Google الذكاء الاصطناعي ، DeepMind ، أن جودة الإنترنت قد تضاءلت بسبب انتشار \"clickbait\" في نتائج بحث Google.",
      "يشير ادعاؤه إلى أن التركيز على توليد مشاركة سريعة وواسعة النطاق من المستخدمين ، غالبا من خلال المحتوى المثير أو العناوين المضللة ، قد أثر سلبا على تجارب المستخدمين عبر الإنترنت.",
      "يؤكد هذا النقد على الأسئلة الصعبة حول الآثار الواقعية لاستراتيجيات تحسين البحث وأضرارها المحتملة على مصداقية الإنترنت وجودته."
    ],
    "commentSummary": [
      "تهتم المقالة بالعديد من القضايا التي تساهم في التدهور الملحوظ لجودة الإنترنت ، بما في ذلك تداعيات خوارزميات تصنيف Google ، والإعلانات المزعجة ، وقضايا الخصوصية ، ومخاوف الاحتيال.",
      "إنه يثير قضايا حول هيمنة Google وقيود الذكاء الاصطناعي للبحث واسترجاع المعلومات ، فضلا عن الآثار الأخلاقية للمعتقدات الشخصية في النظام الرأسمالي.",
      "يتم اقتراح حلول مثل شبكة الويب المستدامة وتنظيم محرك البحث المحسن ، مع التركيز على تعقيدات وتحديات مشهد الإنترنت المتطور."
    ],
    "points": 153,
    "commentCount": 127,
    "retryCount": 0,
    "time": 1697353297
  },
  {
    "id": 37884749,
    "title": "حملت البعوضة البريطانية ذات مرة نيلز بور في حجرة القنابل",
    "originLink": "https://www.thedrive.com/the-war-zone/the-nuclear-scientist-and-the-warplane-that-became-britains-most-unlikely-airliner",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37884749",
    "commentBody": "",
    "originSummary": [
      "لعبت طائرة البعوض البريطانية دورا أساسيا خلال الحرب العالمية الثانية في نقل الإمدادات الحيوية بين اسكتلندا والسويد ، مما أدى إلى تعطيل قدرة الألمان على تأمين الموارد اللازمة.",
      "لعبت هذه الأنشطة دورا مهما في انتصار الحلفاء.",
      "إن براعة طائرة Mosquito وخبرتها في وظائف مختلفة جعلتها خصما قويا ضد Luftwaffe ، سلاح الجو الألماني."
    ],
    "commentSummary": [
      "تدور المناقشة الأولية حول قصة نقل نيلز بور في حجرة قنابل طائرة بريطانية من طراز Mosquito.",
      "تتضمن المحادثة عناصر مختلفة بما في ذلك الصور الخيالية ، والصور الثابتة للأفلام المشوهة ، والانتشار المستقر مفتوح المصدر ، وتحديات التصنيع للبعوض ، والحكايات الشخصية المتعلقة بالحرب.",
      "هناك مناقشات حول دقة القصة وإمكانية التحقق منها ، حيث يشكك بعض المشاركين في عناصر الترفيه المستخدمة في السرد ويستشهد آخرون بمصادر لدعم مصداقيتها التاريخية."
    ],
    "points": 150,
    "commentCount": 38,
    "retryCount": 0,
    "time": 1697321807
  },
  {
    "id": 37887071,
    "title": "انخفاض النشاط المستقل كسبب لتدهور الصحة العقلية للطفل",
    "originLink": "https://cdn2.psychologytoday.com/assets/2023-02/Children%27s%20Independence%20IN%20PRESS%20.pdf",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37887071",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "وتؤكد المناقشات على الآثار السلبية المحتملة على الصحة العقلية للأطفال بسبب تراجع نشاطهم المستقل، والاستهداف غير المتناسب للنساء الفقيرات السود والسمر من قبل سلطات رعاية الطفل.",
      "يقترحون تغييرات على القوانين المتعلقة بالإهمال والخطر ، وإنشاء أحياء يمكن المشي فيها ، وتعزيز المجتمعات الموثوقة ، وإعادة النظر في مخاطر مسارات الدراجات على طول الطرق الرئيسية في ثقافة تتمحور حول السيارات.",
      "تتناول المناقشات أيضا قضايا مجتمعية مثل الحماية المفرطة للأطفال ، والرقابة الأبوية المفرطة ، وتراجع استقلالية الأطفال ، وآثار انخفاض حضور الكنيسة والمشاركة النقابية على تفتيت المجتمع الأمريكي."
    ],
    "points": 137,
    "commentCount": 65,
    "retryCount": 0,
    "time": 1697346959
  },
  {
    "id": 37881767,
    "title": "قطارات ألمانيا الرهيبة ليست مزحة لأمة مبنية على الكفاءة",
    "originLink": "https://www.theguardian.com/business/2023/oct/14/its-the-same-daily-misery-germanys-terrible-trains-are-no-joke-for-a-nation-built-on-efficiency",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37881767",
    "commentBody": "",
    "originSummary": [
      "تواجه شركة دويتشه بان ، مشغل السكك الحديدية الوطني في ألمانيا ، انتقادات بسبب اضطرابات الخدمة التي تتميز بالتأخير والإلغاء والإغلاق المطول لأقسام المسار للترقيات.",
      "يتصاعد استياء الركاب ، مع تسجيل تأخيرات قياسية في عام 2022 ؛ يعزو النقاد هذه القضايا إلى نقص الاستثمار على المدى الطويل والهيكل الفريد لدويتشه بان ، كونه مملوكا فقط للحكومة الألمانية.",
      "على الرغم من أن الدولة الألمانية التزمت باستثمار 40 مليار يورو إضافية في السكك الحديدية ، إلا أن هناك شكوكا بشأن ما إذا كان هذا الاستثمار سيحل المشاكل الأساسية."
    ],
    "commentSummary": [
      "يتسبب عدم كفاية نظام القطارات الألماني في انقطاع الطرق الدولية ، مما يؤدي إلى رفض سويسرا دخول القطارات الألمانية.",
      "تتخلف ألمانيا في نقل البضائع بالقطار بينما تقوم سويسرا بتطوير نفق السكك الحديدية عبر أوروبا ، مما يثير مخاوف بشأن سمعة البنية التحتية العامة الفعالة لألمانيا.",
      "تحدد التعليقات المختلفة عوامل بما في ذلك عدم كفاية الاستثمار ، والتكنولوجيا القديمة ، والتحديات في تحديث البنية التحتية ، مما يؤدي إلى تأخيرات طويلة في القطارات. كما أنها تكشف عن قضايا مثل صعوبة الحصول على العمال المهرة ، وتأثير العقلية الألمانية التي تعيق تحسينات البنية التحتية ، وحالات الانتحار الكبيرة في القطارات التي تسبب التأخير."
    ],
    "points": 135,
    "commentCount": 115,
    "retryCount": 0,
    "time": 1697300550
  }
]
