[
  {
    "id": 37880818,
    "title": "Kaikissa eilistä pidempään tapahtuneissa asioissa on mainittava todellinen päivämäärä.",
    "originLink": "https://grumpy.website/1389",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37880818",
    "commentBody": "",
    "originSummary": [
      "Kirjoittaja on huolissaan suhteellisten aikamerkintöjen, kuten \"eilen\" ja \"kaksi päivää sitten\", käytöstä verkkosivustoilla, koska ne vääristävät ihmisen aikakäsitystä.",
      "Niissä korostetaan, että merkintöjen erilaiset käyttötavat voivat aiheuttaa sekaannusta ja epäluottamusta.",
      "Ehdotetaan, että nämä epämääräiset aikaviittaukset korvataan selvyyden vuoksi tarkoilla päivämäärillä."
    ],
    "commentSummary": [
      "Keskustelun keskeisenä aiheena on suhteellisten aikaleimojen käyttö verkkosivustoilla ja sovelluksissa sekä tarve tarkempiin päivämäärä- ja aikatietoihin.",
      "Kirjoittaja kritisoi tavallista JavaScriptin datetime-käsittelyä ja suosittelee Momentin, Luxonin tai date-fns:n kaltaisten kirjastojen käyttöä datetime-ajan parempaan hallintaan.",
      "Keskustelussa käsitellään myös työkaluvihjeiden käyttöä, käyttäjän mieltymyksiä, näyttötilaa, minimalistista suunnittelua ja sen tasapainottamista olennaisen tiedon tarjoamisen kanssa. Suositaan sekä suhteellisia että absoluuttisia päivämääriä eri käyttäjien tarpeisiin."
    ],
    "points": 674,
    "commentCount": 314,
    "retryCount": 0,
    "time": 1697294377
  },
  {
    "id": 37880635,
    "title": "Demokratian heikentäminen: EU:n komission kiistanalainen valvontapyrkimys.",
    "originLink": "https://dannymekic.com/202310/undermining-democracy-the-european-commissions-controversial-push-for-digital-surveillance",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37880635",
    "commentBody": "",
    "originSummary": [
      "Euroopan komissio ehdottaa asetusta digitaalisen viestinnän sovellusten automaattisesta skannaamisesta rikollisen toiminnan varalta, mikä herättää huolta yksityisyyden suojan loukkaamisesta ja epäasianmukaisesta täytäntöönpanosta.",
      "On esitetty väitteitä, joiden mukaan komissio käyttää manipuloivaa mainontaa ja väärää tietoa saadakseen yleisön tuen näille asetuksille.",
      "Digitaalisen valvonnan lisääminen on aiheuttanut kiistaa, minkä vuoksi EU:n neuvosto lykkäsi äänestystä asiasta."
    ],
    "commentSummary": [],
    "points": 620,
    "commentCount": 338,
    "retryCount": 0,
    "time": 1697293006
  },
  {
    "id": 37879706,
    "title": "Linuxin suorituskyky",
    "originLink": "https://www.brendangregg.com/linuxperf.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37879706",
    "commentBody": "",
    "originSummary": [
      "Brendan Greggin verkkosivusto on kattava lähde järjestelmien suorituskyvyn ja Linuxin suorituskykyanalyyseille, mukaan lukien blogikirjoitukset, kirjat ja työkalut suorituskyvyn analysointiin, virittämiseen ja vertailuanalyyseihin.",
      "Sivustolla on Greggin puheita ja esityksiä eri aiheista, kuten konttien suorituskyvyn analysoinnista, Linuxin jäljitystyökaluista ja Site Reliability Engineering (SRE) -suorituskyvyn tarkistuslistoista.",
      "Oman sisältönsä lisäksi sivusto tarjoaa myös muita arvokkaita resursseja Linuxin suorituskyvyn syvällisempään ymmärtämiseen."
    ],
    "commentSummary": [
      "Artikkelissa perehdytään Linuxin suorituskyvyn viritystyökaluihin ja -tekniikoihin ja korostetaan niiden merkittävää roolia reaaliaikaisten sovellusten suorituskyvyn optimoinnissa Debian- ja Ubuntu-virtuaalipalvelimilla (VPS).",
      "Kirjoittaja korostaa Brendan Greggin merkittävää panosta alalle, suosittelee hänen kirjaansa olennaisena resurssina ja korostaa viiveen optimoinnin merkitystä.",
      "Lisäksi siinä suositellaan työssä oppimista ja perusteltujen päätösten tekemistä tietokantapalvelimia konfiguroitaessa ja viritettäessä, ja korostetaan Linuxin suorituskyvyn virittämisen monimutkaisuutta ja osaamisdokumentaation merkitystä."
    ],
    "points": 331,
    "commentCount": 58,
    "retryCount": 0,
    "time": 1697283136
  },
  {
    "id": 37879935,
    "title": "PlayProtect poisti KDEConnectin F-Droid-version asennuksen käytöstä",
    "originLink": "https://discuss.kde.org/t/f-droid-version-of-kdeconnect-uninstalled-by-playprotect/5992",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37879935",
    "commentBody": "",
    "originSummary": [
      "PlayProtect, Android-laitteiden tietoturvaominaisuus, on virheellisesti poistanut KDEConnectin F-Droid-version ja luokitellut sen väärennökseksi.",
      "KDEConnectin käyttäjät ovat kohdanneet tämän ongelman ja etsivät parhaillaan apua KDE-yhteisöltä."
    ],
    "commentSummary": [],
    "points": 324,
    "commentCount": 173,
    "retryCount": 0,
    "time": 1697286335
  },
  {
    "id": 37884683,
    "title": "Anti-Anti-Adblocker uBlock-suodatin, jolla pääset eroon ärsyttävästä YouTube-viestistä.",
    "originLink": "https://twitter.com/endermanch/status/1713129854818742684",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37884683",
    "commentBody": "",
    "originSummary": [
      "uBlock Originiin on lisätty uusi suodatin, jonka tehtävänä on poistaa YouTuben JavaScript-estoilmoitusominaisuus käytöstä.",
      "Tämä innovaatio tarjoaa käyttäjille ratkaisun, sillä se poistaa ärsyttävän viestin toistuvan ongelman.",
      "UBlock Origin on suosittu työkalu, jonka avulla internetin käyttäjät voivat hallita näytöillään näkyvää sisältöä."
    ],
    "commentSummary": [
      "Keskustelussa käsitellään useita YouTuben näkökohtia, kuten mainosblokkien käyttöä, YouTube Premiumin hyödyllisyyttä, käyttäjien tyytymättömyyttä YouTuben liiketoimintamalliin ja palveluihin sekä vaihtoehtoja mainosten ohittamiseksi.",
      "Mainosten estämisen eettisistä vaikutuksista käydään jatkuvaa keskustelua, jonka vastapainona on yritysten tarve ansaita tuloja samalla kun käyttäjät odottavat ilmaista sisältöä.",
      "Kannat vaihtelevat mainosten sijoitteluun ja yksityisyyden loukkauksiin liittyvästä turhautumisesta ehdotuksiin tilata maksullisia palveluja tai hyväksyä mainosten läsnäolo alustan ominaisuutena."
    ],
    "points": 322,
    "commentCount": 348,
    "retryCount": 0,
    "time": 1697321180
  },
  {
    "id": 37879715,
    "title": "Kalman-suodatin alusta alkaen",
    "originLink": "https://www.kalmanfilter.net/default.aspx",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37879715",
    "commentBody": "",
    "originSummary": [
      "Tässä tiivistelmässä tuodaan esiin Kalmanin suodatinalgoritmia käsittelevä opetusohjelma ja kirja, joka on teknistä jargonia menetelmälle, jota käytetään järjestelmän tilojen arvioimiseen ja ennustamiseen epävarmuuden vallitessa.",
      "Oppimateriaalit pyrkivät selventämään monimutkaista aihetta tarjoamalla käytännön esimerkkejä ja selkeitä selityksiä, käsittelemällä peruskäsitteitä opetusohjelmassa ja tutkimalla edistyneempiä aiheita, kuten epälineaarisia suodattimia kirjassa.",
      "Materiaalin on kirjoittanut kokenut ammattilainen, jolla on 20 vuoden kokemus, ja se tarjoaa intuitiivisia selityksiä ja havainnollistavia esimerkkejä, joiden avulla Kalman-suodatin, kriittinen algoritmi piilotettujen tilojen arvioimiseksi ja tulevien tilojen ennustamiseksi mittaus- ja prosessiepävarmuustekijöistä huolimatta, voidaan ymmärtää täysin."
    ],
    "commentSummary": [
      "Keskustelu koskee pääasiassa hämmennystä ja tyytymättömyyttä opetusohjelmia kohtaan, joissa jätetään huomiotta merkittäviä selvennyksiä tai oletetaan aiempaa tietämystä, ja siinä keskitytään Kalman-suodattimen toteuttamiseen.",
      "Keskustelun osanottajat vertailevat Kalman-suodattimien ja koneoppimismallien käyttöä ja ovat yhtä mieltä siitä, että molemmilla tekniikoilla on hyvät ja huonot puolensa.",
      "Keskusteluketjussa todetaan, että Kalman-suodattimia käytetään laajalti monilla teollisuudenaloilla, mutta ne vaativat tietämystä niiden rajoituksista, ja eräs kommentoija kertoi vaikeuksista soveltaa niitä tuotantoympäristössä."
    ],
    "points": 299,
    "commentCount": 130,
    "retryCount": 0,
    "time": 1697283298
  },
  {
    "id": 37881656,
    "title": "Intelin 386-prosessorin piipesäkkeiden tutkiminen",
    "originLink": "http://www.righto.com/2023/10/intel-386-die-versions.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37881656",
    "commentBody": "",
    "originSummary": [
      "Blogikirjoituksessa kerrotaan yksityiskohtaisesti Intel 386 -prosessorin historiallisesta taustasta ja ominaisuuksista ja korostetaan sen roolia 32-bittiseen arkkitehtuuriin siirtymisessä.",
      "Siinä korostetaan 386-prosessorin ratkaisevaa roolia x86:n hallitsevan aseman vakiinnuttamisessa ja tietokoneteollisuuden muuttamisessa.",
      "Lisäksi annetaan lisätietoja muun muassa transistorien määrästä, suorituskyvyn parantamisesta, putkistosta, toiminnallisista yksiköistä ja IBM:n epäröinnistä tukea 386:aa."
    ],
    "commentSummary": [
      "Tässä kirjoituksessa käsitellään Intelin 386-prosessoria ja keskitytään sen historialliseen merkitykseen, ainutlaatuisiin optimointeihin ja siihen, miten se eroaa nykyajan prosessoreista.",
      "Se antaa käsityksen mikrokoodin roolista prosessoreissa ja syventyy Intelin suunnitteluprosessiin.",
      "Siinä korostetaan 386-prosessorin vaikutusta 32-bittiseen tietojenkäsittelyyn, ja se sisältää kommentoijan jakamia henkilökohtaisia anekdootteja siruun liittyen."
    ],
    "points": 247,
    "commentCount": 52,
    "retryCount": 0,
    "time": 1697299960
  },
  {
    "id": 37881771,
    "title": "Firefox-lisäosa avaa YouTube-videot vaihtoehtoisissa etuosissa",
    "originLink": "https://github.com/d3vr/yt-siphon",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37881771",
    "commentBody": "",
    "originSummary": [
      "Eräs käyttäjä on kehittänyt Firefox-lisäosan vastauksena siihen, että YouTube on estänyt häntä käyttämästä mainosten estoohjelmaa.",
      "Tämän lisäosan avulla he voivat avata videoita käyttämällä vaihtoehtoisia etusivuja, kuten piped.video.",
      "Sen avulla käyttäjät voivat mukauttaa oletusarvoista etusivua ja käyttää näppäinsidoksia videoiden avaamiseksi konfiguroidussa etusivussa."
    ],
    "commentSummary": [
      "Firefoxin lisäosa mahdollistaa YouTube-videoiden avaamisen vaihtoehtoisilla alustoilla sen jälkeen, kun YouTube on estänyt mainosten blokkaajia käyttävien käyttäjien käytön.",
      "Käyttäjät suosittelevat laajennuksia, joilla YouTuben URL-osoitteet voidaan ohjata Invidiousin tai Pipedin kaltaisille alustoille yksityisempään selailukokemukseen, mutta tämä herättää huolta vaikutuksista mainosnäytöksiin ja rahoitukseen Firefoxin kaltaisissa selaimissa.",
      "Keskustelussa pohditaan, pitäisikö selaimiin sisällyttää sisäänrakennettuja toimintoja estotoimenpiteiden ohittamiseksi, mutta samalla tunnustetaan mainosten ja tilausten merkitys tallennus- ja kaistanleveyskustannusten kompensoimiseksi."
    ],
    "points": 235,
    "commentCount": 83,
    "retryCount": 0,
    "time": 1697300571
  },
  {
    "id": 37879893,
    "title": "Kasvaimia tuhoavat ääniaallot saavat FDA:n hyväksynnän maksan hoitoon ihmisillä.",
    "originLink": "https://news.umich.edu/tumor-destroying-sound-waves-receive-fda-approval-for-liver-treatment-in-humans/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37879893",
    "commentBody": "",
    "originSummary": [
      "Yhdysvaltain elintarvike- ja lääkevirasto (FDA) on hyväksynyt ääniaaltojen käytön, histotripsia-nimisen tekniikan, maksakasvainten tuhoamiseksi ihmiskehossa.",
      "Michiganin yliopiston kehittämässä ja HistoSonicsin toteuttamassa innovaatiossa käytetään ultraääniaaltoja tuottamaan mikrokuplia kasvaimissa, mikä johtaa niiden pirstoutumiseen ja immuunijärjestelmän eliminoimiseen.",
      "Histotripsia tarjoaa ei-invasiivisen vaihtoehdon perinteisille syöpähoidoille, kuten leikkaukselle, kemoterapialle ja sädehoidolle, mutta se tarjoaa myös potentiaalisia etuja immuunijärjestelmälle ja tulevalle integroinnille immunoterapiaan tai lääkkeiden toimittamiseen."
    ],
    "commentSummary": [
      "Food and Drug Administration (FDA) on hyväksynyt kasvaimia tuhoavien ääniaaltojen käytön maksan hoidossa ihmisillä.",
      "Tätä tekniikkaa pidetään potentiaalisesti merkittävänä, vähän traumoja aiheuttavana hengenpelastusmenetelmänä."
    ],
    "points": 222,
    "commentCount": 4,
    "retryCount": 0,
    "time": 1697285762
  },
  {
    "id": 37879723,
    "title": "Vetoomus EU:n chat-valvontaa vastaan",
    "originLink": "https://stopscanningme.eu/en/index.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37879723",
    "commentBody": "",
    "originSummary": [
      "Tukholmassa ja Berliinissä järjestettiin mielenosoituksia ja valokuvatempauksia EU:n CSA-asetusta, massavalvontaehdotusta, vastaan, jotta yksityisyyden suojaa koskevat huolenaiheet saataisiin esiin.",
      "Yhteenvedon mukaan suurin osa 13 EU:n jäsenvaltion nuorista kokisi, että heidän poliittinen toimintansa tai seksuaalisuuden tutkiminen olisi rajoitettua, jos heidän digitaalista viestintäänsä valvottaisiin.",
      "Tiivistelmässä kehotetaan liittymään ehdotusta vastustavaan vastarintaan, johon kuuluu yli 11 000 yksityishenkilöä ja 133 kansalaisjärjestöä, ja pysymään ajan tasalla Stop Scanning Me -kampanjan avulla."
    ],
    "commentSummary": [
      "Keskustelussa keskitytään vetoomukseen EU:n ehdottamia chat-valvontatoimia vastaan, mikä herättää keskustelua mahdollisesta väärinkäytöstä, joka voi johtaa sortohallintoihin ja vallan väärinkäyttöön.",
      "Jotkut osallistujat vaativat tasapainoa yksityisyyden suojan säilyttämisen ja lasten hyväksikäytön ja terrorismin kaltaisten nettirikosten torjunnan välillä, mikä kuvastaa erilaisia näkemyksiä siitä, miten internetissä tapahtuvaa viestintää olisi säänneltävä.",
      "Keskustelu sisältää ehdotuksia avoimen lähdekoodin ohjelmisto- ja laiteratkaisujen hyödyntämiseksi yksityisyyden takaamiseksi ja perusteettoman valvonnan estämiseksi."
    ],
    "points": 195,
    "commentCount": 31,
    "retryCount": 0,
    "time": 1697283448
  },
  {
    "id": 37880033,
    "title": "Snowdenin arkisto - Snowdenin vuotamat asiakirjat",
    "originLink": "https://github.com/iamcryptoki/snowden-archive",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37880033",
    "commentBody": "",
    "originSummary": [
      "Arkisto koostuu Edward Snowdenin vuotamista asiakirjoista, joissa paljastetaan NSA:n käytäntöjä, kuten tarkkailua, tiedustelutoimintaa, ulkomaisten hallitusten vakoilua ja tietokonejärjestelmien hakkerointia.",
      "Asiakirjat paljastavat NSA:n roolin kohdennetuissa tappamisissa ja sen yhteyden useisiin vakoiluskandaaleihin.",
      "Tämä yleiskatsaus antaa kuvan NSA:n maailmanlaajuisen valvonnan ja salaisen toiminnan laajuudesta ja syvyydestä."
    ],
    "commentSummary": [
      "Verkkofoorumilla käydään vilkasta keskustelua Edward Snowdenin vuotamista asiakirjoista ja niiden mahdollisista vaikutuksista puolustusalan henkilöihin.",
      "Jäsenet ilmaisevat huolensa tietojen arkaluonteisuudesta ja niiden mahdollisista turvallisuusvaikutuksista sekä turhautumisensa asiakirjojen julkistamattomista osista.",
      "Keskustelu ulottuu myös hallinnon avoimuuteen, journalismiin ja luottamuksellisten tietojen vuotamiseen liittyviin eettisiin kysymyksiin."
    ],
    "points": 192,
    "commentCount": 40,
    "retryCount": 0,
    "time": 1697287325
  },
  {
    "id": 37887562,
    "title": "Google on lähettänyt internetin \"taantumuksen kierteeseen\", väittää DeepMindin toinen perustaja",
    "originLink": "https://www.telegraph.co.uk/business/2023/10/14/google-internet-spiral-of-decline-deepmind-mustafa-suleyman/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37887562",
    "commentBody": "",
    "originSummary": [
      "Googlen tekoälylaboratorion DeepMindin toinen perustaja väittää, että internetin laatu on heikentynyt \"clickbaitin\" leviämisen vuoksi Googlen hakutuloksissa.",
      "Hänen mukaansa keskittyminen nopeaan ja laajaan käyttäjien sitoutumiseen, usein sensaatiomaisen sisällön tai harhaanjohtavien otsikoiden avulla, on vaikuttanut kielteisesti käyttäjien verkkokokemuksiin.",
      "Tämä kritiikki korostaa haastavia kysymyksiä hakuoptimointistrategioiden todellisista vaikutuksista ja niiden mahdollisista haitoista Internetin uskottavuudelle ja laadulle."
    ],
    "commentSummary": [
      "Artikkelissa käsitellään erilaisia asioita, jotka vaikuttavat internetin laadun heikkenemiseen, kuten Googlen luokittelualgoritmien seurauksia, ärsyttäviä mainoksia, yksityisyyden suojaa koskevia kysymyksiä ja huijauspelkoja.",
      "Se herättää kysymyksiä Googlen valta-asemasta ja tekoälyn rajoituksista haku- ja tiedonhakutoiminnoissa sekä henkilökohtaisten uskomusten eettisistä vaikutuksista kapitalistisessa järjestelmässä.",
      "Ratkaisuja, kuten kestävää verkkoa ja parempaa hakukoneiden kuratointia, ehdotetaan, ja korostetaan kehittyvän Internet-maiseman monimutkaisuutta ja haasteita."
    ],
    "points": 153,
    "commentCount": 127,
    "retryCount": 0,
    "time": 1697353297
  },
  {
    "id": 37884749,
    "title": "Brittiläinen Mosquito kuljetti aikoinaan Niels Bohria pommikammiossaan...",
    "originLink": "https://www.thedrive.com/the-war-zone/the-nuclear-scientist-and-the-warplane-that-became-britains-most-unlikely-airliner",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37884749",
    "commentBody": "",
    "originSummary": [
      "Brittiläinen Mosquito-lentokone oli toisen maailmansodan aikana tärkeä väline tärkeiden tarvikkeiden kuljettamisessa Skotlannin ja Ruotsin välillä, mikä häiritsi saksalaisten kykyä hankkia tarvittavia resursseja.",
      "Näillä toimilla oli merkittävä osuus liittoutuneiden voittoon.",
      "Mosquito-lentokoneiden monipuolisuus ja osaaminen eri tehtävissä tekivät niistä tehokkaan vastustajan Luftwaffelle, Saksan ilmavoimille."
    ],
    "commentSummary": [
      "Ensisijainen keskustelu pyörii tarinan ympärillä, jossa Niels Bohria kuljetettiin brittiläisen Mosquito-koneen pommikammiossa.",
      "Keskustelussa on mukana erilaisia elementtejä, kuten mielikuvituksellisia kuvia, anamorfisia elokuvakuvia, avoimen lähdekoodin vakaata levittämistä, Mosquiton valmistukseen liittyviä haasteita ja henkilökohtaisia sotaan liittyviä anekdootteja.",
      "Tarinan paikkansapitävyydestä ja todennettavuudesta käydään keskustelua, ja jotkut osallistujat kyseenalaistavat kertomuksessa käytetyt viihde-elementit ja toiset taas viittaavat lähteisiin, jotka tukevat tarinan historiallista uskottavuutta."
    ],
    "points": 150,
    "commentCount": 38,
    "retryCount": 0,
    "time": 1697321807
  },
  {
    "id": 37887071,
    "title": "Itsenäisen toiminnan väheneminen lasten mielenterveyden heikkenemisen syynä",
    "originLink": "https://cdn2.psychologytoday.com/assets/2023-02/Children%27s%20Independence%20IN%20PRESS%20.pdf",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37887071",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Keskusteluissa korostetaan lasten mielenterveyteen mahdollisesti kohdistuvia kielteisiä vaikutuksia, jotka johtuvat heidän itsenäisen toimintakykynsä vähenemisestä, sekä sitä, että lastensuojeluviranomaiset kohdistavat toimintaansa suhteettomasti köyhiin mustiin ja ruskeisiin naisiin.",
      "He ehdottavat muutoksia laiminlyöntiä ja vaarantamista koskeviin lakeihin, kävelykelpoisten asuinalueiden luomista, luottamusta herättävien yhteisöjen edistämistä ja pääteiden varrella kulkevien pyöräteiden vaarojen uudelleenarviointia autokeskeisessä kulttuurissa.",
      "Keskusteluissa käsitellään myös yhteiskunnallisia kysymyksiä, kuten lasten ylisuojelua, vanhempien liiallista valvontaa, lasten autonomian vähenemistä sekä kirkossakäynnin ja ammattiyhdistystoimintaan osallistumisen vähenemisen vaikutuksia amerikkalaisen yhteiskunnan atomisoitumiseen."
    ],
    "points": 137,
    "commentCount": 65,
    "retryCount": 0,
    "time": 1697346959
  },
  {
    "id": 37881767,
    "title": "Saksan kauheat junat eivät ole vitsi tehokkuuteen perustuvalle kansakunnalle.",
    "originLink": "https://www.theguardian.com/business/2023/oct/14/its-the-same-daily-misery-germanys-terrible-trains-are-no-joke-for-a-nation-built-on-efficiency",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37881767",
    "commentBody": "",
    "originSummary": [
      "Deutsche Bahn, Saksan kansallinen rautatieoperaattori, joutuu kohtaamaan kritiikkiä liikennehäiriöiden vuoksi, jotka johtuvat viivästyksistä, peruutuksista ja rataosuuksien pitkäaikaisista sulkemisista kunnostustöiden vuoksi.",
      "Matkustajien tyytymättömyys lisääntyy, ja vuonna 2022 kirjattiin ennätyksellisiä myöhästymisiä; arvostelijat syyttävät näitä ongelmia pitkäaikaisesta ali-investoinnista ja Deutsche Bahnin ainutlaatuisesta rakenteesta, sillä se on Saksan valtion yksinomaisessa omistuksessa.",
      "Vaikka Saksan valtio on sitoutunut investoimaan rautateihin 40 miljardia euroa lisää, on epäilyksiä siitä, voidaanko tällä investoinnilla ratkaista perustavanlaatuiset ongelmat."
    ],
    "commentSummary": [
      "Saksan junajärjestelmän riittämättömyys aiheuttaa katkoksia kansainvälisillä reiteillä, mikä johtaa siihen, että Sveitsi kieltää pääsyn saksalaisilta junilta.",
      "Saksa on jäänyt jälkeen rahtikuljetuksissa junalla, kun taas Sveitsi kehittää Euroopan laajuista rautatietunnelia, mikä herättää huolta Saksan tehokkaan julkisen infrastruktuurin maineesta.",
      "Useissa kommenteissa mainitaan muun muassa riittämättömät investoinnit, vanhentunut teknologia ja infrastruktuurin parantamiseen liittyvät haasteet, jotka johtavat junien pitkittyneisiin myöhästymisiin. Niissä tuodaan esiin myös ongelmia, kuten vaikeudet ammattitaitoisen työvoiman hankkimisessa, saksalaisen mentaliteetin vaikutus infrastruktuurin parantamisen esteenä ja junien itsemurhat, jotka aiheuttavat myöhästymisiä."
    ],
    "points": 135,
    "commentCount": 115,
    "retryCount": 0,
    "time": 1697300550
  }
]
