[
  {
    "id": 36908309,
    "title": "Cap'n Proto 1.0",
    "originLink": "https://capnproto.org/news/2023-07-28-capnproto-1.0.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36908309",
    "commentBody": "",
    "originSummary": [
      "O Cap'n Proto, um protocolo de mensagens, lançou a versão 1.0 de sua implementação de referência em C++.",
      "O protocolo tem sido usado na produção há muitos anos, o que indica sua confiabilidade.",
      "A versão inclui otimizações para melhorar o desempenho.",
      "Foram feitas alterações para permitir o cancelamento de RPC.",
      "Os planos para a versão 2.0 incluem revisões da API C++ e da biblioteca do kit de ferramentas KJ C++ para aprimorar a experiência do desenvolvedor.",
      "Essas alterações exigirão um compilador com suporte ao C++20 e poderão tornar o KJ mais amigável às rotinas.",
      "Não serão feitas alterações incompatíveis com versões anteriores no formato de serialização ou no protocolo RPC.",
      "Uma versão 2.0 formal não é esperada por alguns anos."
    ],
    "commentSummary": [
      "Ian Denhardt, um dos principais colaboradores da implementação do Cap'n Proto em Go, faleceu, deixando as comunidades do Cap'n Proto e da Sandstorm de luto.",
      "O Cap'n Proto é um formato de serialização de dados de alto desempenho que está sendo usado na plataforma Workers da Cloudflare.",
      "Os benefícios do Cap'n Proto, incluindo sua serialização e desserialização eficientes, são discutidos.",
      "A discussão também inclui suporte a idiomas para o Cap'n Proto, com exemplos de implementações em vários idiomas.",
      "O potencial de desenvolvimento e aprimoramento do Cap'n Proto é explorado.",
      "A conversa aborda tópicos como campos obrigatórios e opcionais no desenvolvimento de software, tipagem estática e os desafios do design de protocolos.",
      "Outros formatos de serialização, como Avro, protobuf e flatbuffers, são comparados ao Cap'n Proto.",
      "As sugestões para outras bibliotecas e protocolos de serialização binária são mencionadas juntamente com o Cap'n Proto."
    ],
    "points": 621,
    "commentCount": 192,
    "retryCount": 0,
    "time": 1690558084
  },
  {
    "id": 36906022,
    "title": "Assista à TV dos anos 90 e anteriores",
    "originLink": "https://my90stv.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36906022",
    "commentBody": "",
    "originSummary": [
      "O resumo descreve uma lista de canais de TV e suas categorias.",
      "Ele menciona um botão para voltar à década de 1990.",
      "As informações foram atualizadas pela última vez em 23 de julho de 2023.",
      "O criador da lista é creditado.",
      "Há um pedido de doações para comprar um café."
    ],
    "commentSummary": [
      "O tópico de comentários discute a exibição de programas de TV de diferentes décadas, especialmente dos anos 60, 70, 80 e 90.",
      "Os usuários expressam nostalgia pela experiência de mudar de canal e criticam a falta de inovação nos serviços de streaming atuais.",
      "São sugeridas plataformas e métodos alternativos para acessar programas de TV mais antigos.",
      "Os desafios da digitalização de fitas VHS e as limitações das TVs analógicas são mencionados.",
      "Os usuários compartilham suas experiências e lembranças de assistir TV no passado.",
      "São discutidos canais, comerciais e programas específicos dos anos 90.",
      "As questões de direitos autorais e licenciamento são mencionadas no contexto de assistir a programas de TV mais antigos."
    ],
    "points": 540,
    "commentCount": 232,
    "retryCount": 0,
    "time": 1690548379
  },
  {
    "id": 36906435,
    "title": "Fundador do Sci-Hub recebe prêmio da EFF por fornecer acesso ao conhecimento científico",
    "originLink": "https://torrentfreak.com/sci-hubs-alexandra-elbakyan-receives-eff-award-for-providing-access-to-scientific-knowledge-230728/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36906435",
    "commentBody": "",
    "originSummary": [
      "Alexandra Elbakyan, fundadora do Sci-Hub, foi reconhecida pela Electronic Frontier Foundation (EFF) por seus esforços em fornecer acesso gratuito ao conhecimento científico.",
      "O Sci-Hub é um recurso valioso para estudantes e pesquisadores, elogiado por seu papel em salvar vidas.",
      "Elbakyan continua a defender a missão do Sci-Hub apesar dos desafios legais e dos milhões em indenizações devidas às principais editoras.",
      "A EFF reconhece o trabalho de Elbakyan em desafiar o atual sistema de publicação acadêmica e permitir o acesso de milhões de pessoas às informações científicas.",
      "Elbakyan receberá o prêmio diretamente em uma cerimônia em setembro."
    ],
    "commentSummary": [
      "Alexandra Elbakyan, fundadora do Sci-Hub, recebeu o Prêmio Pioneer da Electronic Frontier Foundation (EFF) por seus esforços para tornar o conhecimento científico acessível.",
      "Elbakyan expressou insatisfação ao aceitar o prêmio em nome do Sci-Hub em vez de pessoalmente, comparando-o a Linus Torvalds e ao Linux.",
      "A discussão enfatizou a importância do Sci-Hub na democratização do conhecimento e a disponibilidade de plataformas alternativas para o acesso a artigos científicos.",
      "No entanto, há preocupações de que esse prêmio possa ser usado para prejudicar a EFF em casos legais relacionados à violação de direitos autorais."
    ],
    "points": 472,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1690550754
  },
  {
    "id": 36907248,
    "title": "A Worldcoin não é tão ruim quanto parece: É pior",
    "originLink": "https://blockworks.co/news/worldcoin-privacy-concerns",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36907248",
    "commentBody": "",
    "originSummary": [
      "O Worldcoin é um novo sistema financeiro que coleta dados biométricos confidenciais e promete oferecer igualdade e justiça.",
      "O artigo levanta preocupações sobre os métodos questionáveis de coleta de dados usados pela Worldcoin e a possível criação de um mercado negro para credenciais verificadas.",
      "A eficácia das medidas de privacidade da Worldcoin e as consequências da vinculação de características biométricas imutáveis ao dinheiro também são questionadas.",
      "O plano de distribuição da Worldcoin, que envolve a alocação de um número significativo de tokens para insiders, é criticado.",
      "O artigo sugere que a Worldcoin pode não ser tão revolucionária ou igualitária quanto afirma ser."
    ],
    "commentSummary": [
      "A discussão abrange vários tópicos, incluindo criptomoeda, verificação de identidade e as limitações da tecnologia blockchain.",
      "A conversa gira principalmente em torno do projeto Worldcoin e suas possíveis falhas e implicações.",
      "Os participantes expressam ceticismo com relação à credibilidade do projeto Worldcoin.",
      "Há preocupações sobre o uso da biometria para identificação.",
      "Há dúvidas sobre a distribuição e a justiça da moeda Worldcoin.",
      "A discussão também explora questões como a confiança na criptomoeda, o papel do capitalismo no avanço tecnológico e os desafios da identidade e da privacidade on-line."
    ],
    "points": 456,
    "commentCount": 320,
    "retryCount": 0,
    "time": 1690554310
  },
  {
    "id": 36913268,
    "title": "O governo do Reino Unido está perto de erodir a criptografia em todo o mundo",
    "originLink": "https://www.eff.org/deeplinks/2023/07/uk-government-very-close-eroding-encryption-worldwide",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36913268",
    "commentBody": "",
    "originSummary": [
      "O governo do Reino Unido está próximo de aprovar a Lei de Segurança Online, que pode permitir a inserção de backdoors em serviços de mensagens e enfraquecer a criptografia de ponta a ponta.",
      "Grupos da sociedade civil, especialistas técnicos, organizações de direitos humanos e provedores de mensagens se opuseram ao projeto de lei, citando preocupações sobre seu impacto em escala global, privacidade e democracia.",
      "As afirmações do governo de que ele pode verificar as mensagens em busca de conteúdo ilegal e, ao mesmo tempo, proteger a privacidade, foram desmentidas.",
      "Os defensores estão pedindo aos legisladores do Reino Unido que protejam a criptografia e a privacidade incorporando uma emenda ao projeto de lei."
    ],
    "commentSummary": [
      "Os participantes discutem criptografia, vigilância governamental e o relacionamento da Apple com a China.",
      "A crítica é expressa em relação à tentativa do governo do Reino Unido de enfraquecer a criptografia.",
      "Há preocupações quanto ao fato de a Apple comprometer seus princípios.",
      "As possíveis consequências do controle governamental são debatidas.",
      "As discussões giram em torno das fronteiras da Internet e do impacto das regulamentações sobre o uso da Internet.",
      "A viabilidade e a eficácia das leis propostas são questionadas.",
      "Os temas comuns incluem a erosão da privacidade, preocupações com o excesso do governo e possíveis consequências negativas das ações governamentais."
    ],
    "points": 439,
    "commentCount": 268,
    "retryCount": 0,
    "time": 1690578101
  },
  {
    "id": 36910256,
    "title": "A privação de brincadeiras é uma das principais causas da crise de saúde mental dos adolescentes",
    "originLink": "https://jonathanhaidt.substack.com/p/the-play-deficit",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36910256",
    "commentBody": "",
    "originSummary": [
      "As brincadeiras sem supervisão entre as crianças estão em declínio e isso está tendo efeitos negativos sobre a saúde mental delas.",
      "O aumento das brincadeiras livres é visto como uma solução econômica para lidar com a crise de saúde mental entre os adolescentes.",
      "Os autores concordam que a privação de jogos é um fator contribuinte, mas têm opiniões diferentes sobre o papel dos smartphones e das mídias sociais.",
      "As pesquisas mostram que as atividades lúdicas e independentes atendem às necessidades psicológicas de autonomia, competência e relacionamento, levando a um melhor bem-estar mental.",
      "O artigo destaca o aumento das taxas de ansiedade, depressão e suicídio entre os jovens, o que está relacionado à diminuição da liberdade e da diversão.",
      "Priorizar a prevenção por meio de brincadeiras e exploração pode resultar em melhores resultados de saúde mental."
    ],
    "commentSummary": [
      "A discussão abrange vários tópicos relacionados a paternidade, desenvolvimento infantil, brincadeiras e educação.",
      "As brincadeiras não estruturadas são fundamentais para a saúde mental dos adolescentes.",
      "Diferentes abordagens parentais podem ajudar a evitar comportamentos de risco em crianças.",
      "O impacto dos carros sobre a segurança e a liberdade das crianças é discutido.",
      "É importante permitir que as crianças explorem e façam experimentos.",
      "A programação excessiva e o tempo de tela excessivo têm efeitos negativos sobre as crianças.",
      "As interações sociais e a dinâmica educacional estão mudando.",
      "Experiências de aprendizado prático, criatividade e independência são benéficas para o desenvolvimento das crianças."
    ],
    "points": 411,
    "commentCount": 348,
    "retryCount": 0,
    "time": 1690565321
  },
  {
    "id": 36908136,
    "title": "Califórnia tenta silenciar pesquisadores de Stanford que obtiveram dados para estudar educação",
    "originLink": "https://edsource.org/2023/california-moves-to-silence-stanford-researchers-who-got-state-data-to-study-education-issues/694920",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36908136",
    "commentBody": "",
    "originSummary": [
      "O Departamento de Educação da Califórnia está sendo criticado por uma cláusula em seus contratos de parceria de dados.",
      "A cláusula impede que os pesquisadores testemunhem contra o departamento em ações judiciais.",
      "A American Civil Liberties Union acredita que isso viola os direitos da Primeira Emenda dos pesquisadores.",
      "A disputa não envolve a divulgação de informações sobre os alunos.",
      "Esse caso é significativo, pois pode limitar a capacidade dos pesquisadores de abordar as desigualdades educacionais na Califórnia.",
      "O CDE argumenta que a disposição é necessária para proteger a privacidade do aluno."
    ],
    "commentSummary": [
      "A conversa discute a restrição à participação de pesquisadores em litígios imposta pelo Departamento de Educação da Califórnia.",
      "O papel da raça na determinação das habilidades é explorado na conversa.",
      "Os desafios relacionados à desidentificação de dados são discutidos.",
      "O equilíbrio entre transparência e privacidade na pesquisa educacional é examinado.",
      "Discute-se o uso de testemunhas especializadas em ações judiciais e seus honorários.",
      "São abordadas questões relacionadas a programas governamentais e privacidade de dados.",
      "A conversa enfatiza o significado da proteção da privacidade e, ao mesmo tempo, reconhece a importância da transparência e da responsabilidade."
    ],
    "points": 411,
    "commentCount": 250,
    "retryCount": 0,
    "time": 1690557598
  },
  {
    "id": 36909427,
    "title": "Por que o DNS ainda é difícil de aprender?",
    "originLink": "https://jvns.ca/blog/2023/07/28/why-is-dns-still-hard-to-learn/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36909427",
    "commentBody": "",
    "originSummary": [
      "O aprendizado e a solução de problemas do DNS podem ser desafiadores devido à natureza oculta do sistema.",
      "O cache do resolvedor e a conversa entre o resolvedor e os nameservers autoritativos geralmente ficam ocultos para os usuários.",
      "O autor sugere ensinar as pessoas sobre esses sistemas ocultos e fornecer mais visibilidade e informações de depuração no DNS.",
      "Ferramentas confusas e suas saídas representam desafios na solução de problemas de DNS, e o autor propõe melhorar a saída da ferramenta e criar ferramentas de linha de comando mais fáceis de usar.",
      "A dificuldade de documentar problemas comuns de DNS decorre das variações nas experiências individuais.",
      "A exposição pouco frequente e o medo de fazer experiências com o DNS contribuem para a dificuldade de aprender esse assunto."
    ],
    "commentSummary": [
      "O aprendizado do DNS (Sistema de Nomes de Domínios) apresenta desafios e complexidades.",
      "A depuração de problemas de DNS é um problema comum.",
      "As barreiras à compreensão do DNS precisam ser abordadas.",
      "São necessárias melhores documentações e ferramentas para aprimorar o aprendizado do DNS.",
      "Discute-se o aprimoramento da interface do usuário das principais ferramentas de software livre e de código aberto (FOSS).",
      "O uso de ponto e vírgula nas consultas de DNS é um tópico de debate.",
      "A facilidade de aprendizado do DNS é questionada.",
      "A compreensão da infraestrutura é considerada importante no aprendizado do DNS.",
      "O declínio das habilidades técnicas entre os desenvolvedores mais jovens é uma preocupação.",
      "Os protocolos DNS e os arquivos de zona são discutidos.",
      "São mencionadas opções alternativas de software de DNS.",
      "São compartilhadas experiências específicas com a solução de problemas de DNS.",
      "O DNS é usado para várias finalidades."
    ],
    "points": 409,
    "commentCount": 219,
    "retryCount": 0,
    "time": 1690562031
  },
  {
    "id": 36910146,
    "title": "\"Integridade do ambiente da Web\" é um ataque à Internet livre",
    "originLink": "https://www.fsf.org/blogs/community/web-environment-integrity-is-an-all-out-attack-on-the-free-internet",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36910146",
    "commentBody": "",
    "originSummary": [
      "A política \"Web Environment Integrity\" (WEI) do Google é discutida no artigo.",
      "A política permite que os desenvolvedores aprovem ou neguem determinadas configurações de navegador, restringindo potencialmente o acesso a sites para usuários de navegadores ou sistemas operacionais gratuitos.",
      "O artigo sugere que o WEI poderia ser explorado por governos e corporações para controlar e limitar o acesso à Internet.",
      "A Free Software Foundation está pedindo ao Google que reconsidere a política e enfatiza a importância de uma Internet livre e aberta."
    ],
    "commentSummary": [
      "A proposta \"Web Environment Integrity\" (WEI) do Google está sendo analisada por seu possível impacto na liberdade da Internet.",
      "Os usuários estão preocupados com o crescente controle do Google sobre a segurança do navegador, o bloqueio de anúncios e o acesso a sites.",
      "Há preocupações sobre a finalidade do sistema reCAPTCHA do Google e seu potencial para rastreamento e mineração de dados.",
      "Foram feitas comparações entre o WEI e os Privacy Access Tokens (PAT) da Apple, o que levou ao ceticismo e à oposição às ações do Google.",
      "A discussão inclui protocolos alternativos, a influência de grandes empresas de tecnologia e possíveis limitações no controle do usuário e no acesso à Internet."
    ],
    "points": 370,
    "commentCount": 75,
    "retryCount": 0,
    "time": 1690564855
  },
  {
    "id": 36914401,
    "title": "O modo No-GIL está chegando para o Python",
    "originLink": "https://lwn.net/Articles/939568/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36914401",
    "commentBody": "",
    "originSummary": [
      "O Conselho Diretor do Python está considerando uma proposta para tornar o Global Interpreter Lock (GIL) opcional no CPython.",
      "Isso permitiria um modo sem GIL no Python, melhorando potencialmente a simultaneidade.",
      "O conselho está tomando cuidado para garantir a compatibilidade com versões anteriores e evitar um cenário de divisão do Python 2 e 3.",
      "Eles estão discutindo os requisitos de compatibilidade ABI e abordando o impacto sobre a compatibilidade com versões anteriores.",
      "Alguns comentaristas expressaram preocupação com possíveis problemas de compatibilidade e recomendaram abordagens alternativas para aprimorar a simultaneidade no Python."
    ],
    "commentSummary": [
      "O Python está introduzindo um modo No-GIL (Global Interpreter Lock), conforme confirmado por uma postagem no lwn.net.",
      "O Global Interpreter Lock é um mecanismo do Python que permite que apenas um thread execute o bytecode do Python por vez.",
      "O modo No-GIL tem o objetivo de remover essa limitação e permitir que vários threads executem o bytecode Python simultaneamente.",
      "As informações sobre o modo No-GIL foram inicialmente compartilhadas no site ycombinator.com."
    ],
    "points": 341,
    "commentCount": 1,
    "retryCount": 0,
    "time": 1690584427
  }
]
