[
  {
    "id": 36908309,
    "title": "Cap'n Proto 1.0",
    "originLink": "https://capnproto.org/news/2023-07-28-capnproto-1.0.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36908309",
    "commentBody": "",
    "originSummary": [
      "Cap'n Proto, viestiprotokolla, on julkaissut version 1.0 C++-referenssitoteutuksestaan.",
      "Protokollaa on käytetty tuotannossa useita vuosia, mikä osoittaa sen luotettavuuden.",
      "Julkaisu sisältää optimointeja suorituskyvyn parantamiseksi.",
      "Muutoksia on tehty RPC-peruuttamisen mahdollistamiseksi.",
      "Version 2.0 suunnitelmissa on muun muassa C++ API:n ja KJ C++ -työkalupakettikirjaston tarkistuksia, joilla parannetaan kehittäjäkokemusta.",
      "Nämä muutokset edellyttävät C++20-tuella varustettua kääntäjää, ja ne saattavat tehdä KJ:stä korutiiniystävällisemmän.",
      "Sarjallistamisformaattiin tai RPC-protokollaan ei tehdä taaksepäin yhteensopivia muutoksia.",
      "Virallista 2.0-julkaisua ei odoteta muutamaan vuoteen."
    ],
    "commentSummary": [
      "Ian Denhardt, Cap'n Proton Go-toteutuksen johtava tekijä, on kuollut, jättäen Cap'n Proton ja Sandstormin yhteisöt suruun.",
      "Cap'n Proto on suorituskykyinen datan sarjallistamisformaatti, jota käytetään Cloudflaren Workers-alustassa.",
      "Keskustellaan Cap'n Proton eduista, kuten sen tehokkaasta sarjallistamisesta ja deserialisoinnista.",
      "Keskustelussa käsitellään myös Cap'n Proton kielitukea ja annetaan esimerkkejä toteutuksista eri kielillä.",
      "Tutkitaan Cap'n Proton jatkokehitys- ja parannusmahdollisuuksia.",
      "Keskustelussa käsitellään muun muassa vaadittavia ja valinnaisia kenttiä ohjelmistokehityksessä, staattista tyypitystä ja protokollasuunnittelun haasteita.",
      "Muita serialisointiformaatteja, kuten Avro, protobuf ja flatbuffer, verrataan Cap'n Proton formaatteihin.",
      "Cap'n Proton ohella mainitaan ehdotuksia muista binäärisarjakirjastoista ja -protokollista."
    ],
    "points": 621,
    "commentCount": 192,
    "retryCount": 0,
    "time": 1690558084
  },
  {
    "id": 36906022,
    "title": "Katso televisiota 90-luvulta ja sitä vanhemmilta vuosilta",
    "originLink": "https://my90stv.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36906022",
    "commentBody": "",
    "originSummary": [
      "Yhteenvedossa kuvataan luettelo televisiokanavista ja niiden luokista.",
      "Siinä mainitaan painike, jolla voi palata 1990-luvulle.",
      "Tiedot päivitettiin viimeksi 23. heinäkuuta 2023.",
      "Luettelon laatija mainitaan.",
      "Pyydetään lahjoituksia kahvin ostamista varten."
    ],
    "commentSummary": [
      "Kommenttiketjussa keskustellaan eri vuosikymmenten, erityisesti 60-, 70-, 80- ja 90-lukujen tv-ohjelmien katselusta.",
      "Käyttäjät nostalgisoivat kanavanvaihtokokemusta ja kritisoivat nykyisten suoratoistopalvelujen innovatiivisuuden puutetta.",
      "Ehdotetaan vaihtoehtoisia alustoja ja menetelmiä vanhempien tv-ohjelmien katseluun.",
      "VHS-kasettien digitointiin liittyvät haasteet ja analogisten televisioiden rajoitukset mainitaan.",
      "Käyttäjät jakavat kokemuksiaan ja muistojaan television katselusta menneisyydessä.",
      "Keskustellaan tietyistä kanavista, mainoksista ja 90-luvun ohjelmista.",
      "Tekijänoikeus- ja lisenssikysymykset mainitaan vanhempien tv-ohjelmien katselun yhteydessä."
    ],
    "points": 540,
    "commentCount": 232,
    "retryCount": 0,
    "time": 1690548379
  },
  {
    "id": 36906435,
    "title": "Sci-Hubin perustaja saa EFF:n palkinnon tieteellisen tiedon saatavuudesta",
    "originLink": "https://torrentfreak.com/sci-hubs-alexandra-elbakyan-receives-eff-award-for-providing-access-to-scientific-knowledge-230728/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36906435",
    "commentBody": "",
    "originSummary": [
      "Electronic Frontier Foundation (EFF) on myöntänyt Sci-Hubin perustajalle Alexandra Elbakyanille tunnustuksen hänen ponnisteluistaan tieteellisen tiedon vapaan saatavuuden takaamiseksi.",
      "Sci-Hub on arvokas resurssi opiskelijoille ja tutkijoille, ja sitä kiitetään sen roolista ihmishenkien pelastamisessa.",
      "Elbakyan puolustaa edelleen Sci-Hubin missiota huolimatta oikeudellisista haasteista ja suurille kustantajille maksettavista miljoonakorvauksista.",
      "EFF antaa tunnustusta Elbakyanin työstä, jolla hän on haastanut nykyisen akateemisen julkaisujärjestelmän ja mahdollistanut miljoonien ihmisten pääsyn tieteelliseen tietoon.",
      "Elbakyan saa palkinnon suoraan seremoniassa syyskuussa."
    ],
    "commentSummary": [
      "Sci-Hubin perustaja Alexandra Elbakyan on saanut Electronic Frontier Foundationin (EFF) pioneeripalkinnon ponnisteluistaan tieteellisen tiedon saatavuuden parantamiseksi.",
      "Elbakyan ilmaisi tyytymättömyytensä siihen, että hän otti palkinnon vastaan Sci-Hubin puolesta eikä henkilökohtaisesti, ja vertasi sitä Linus Torvaldsiin ja Linuxiin.",
      "Keskustelussa korostettiin Sci-Hubin merkitystä tiedon demokratisoinnissa ja vaihtoehtoisten alustojen saatavuutta tieteellisten julkaisujen saamiseksi.",
      "On kuitenkin pelättävissä, että tätä palkintoa voitaisiin mahdollisesti käyttää EFF:n heikentämiseen tekijänoikeusloukkauksiin liittyvissä oikeustapauksissa."
    ],
    "points": 472,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1690550754
  },
  {
    "id": 36907248,
    "title": "Worldcoin ei ole niin paha kuin miltä se kuulostaa: Se on pahempi",
    "originLink": "https://blockworks.co/news/worldcoin-privacy-concerns",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36907248",
    "commentBody": "",
    "originSummary": [
      "Worldcoin on uusi rahoitusjärjestelmä, joka kerää arkaluonteisia biometrisiä tietoja ja lupaa tarjota tasa-arvoa ja oikeudenmukaisuutta.",
      "Artikkeli herättää huolta Worldcoinin käyttämistä kyseenalaisista tiedonkeruumenetelmistä ja mahdollisesta mustan pörssin luomisesta varmennetuille tunnuksille.",
      "Worldcoinin yksityisyydensuojatoimenpiteiden tehokkuus ja seuraukset, joita aiheutuu muuttumattomien biometristen ominaisuuksien yhdistämisestä rahaan, on myös kyseenalaistettu.",
      "Worldcoinin jakelusuunnitelmaa, johon kuuluu merkittävän määrän tokenien jakaminen sisäpiiriläisille, arvostellaan.",
      "Artikkelin mukaan Worldcoin ei ehkä olekaan niin vallankumouksellinen tai tasa-arvoinen kuin se väittää olevansa."
    ],
    "commentSummary": [
      "Keskustelussa käsitellään useita aiheita, kuten kryptovaluuttaa, henkilöllisyyden todentamista ja lohkoketjuteknologian rajoituksia.",
      "Keskustelu keskittyy pääasiassa Worldcoin-hankkeeseen ja sen mahdollisiin puutteisiin ja vaikutuksiin.",
      "Osallistujat suhtautuvat epäilevästi Worldcoin-hankkeen uskottavuuteen.",
      "Biometristen tunnisteiden käyttöön tunnistamisessa suhtaudutaan huolestuneesti.",
      "Worldcoin-valuutan jakelua ja oikeudenmukaisuutta epäillään.",
      "Keskustelussa tarkastellaan myös kysymyksiä, kuten luottamusta kryptovaluuttaan, kapitalismin roolia teknologisessa kehityksessä sekä verkkoidentiteetin ja yksityisyyden haasteita."
    ],
    "points": 456,
    "commentCount": 320,
    "retryCount": 0,
    "time": 1690554310
  },
  {
    "id": 36913268,
    "title": "Britannian hallitus on lähellä salausjärjestelmän maailmanlaajuista purkamista.",
    "originLink": "https://www.eff.org/deeplinks/2023/07/uk-government-very-close-eroding-encryption-worldwide",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36913268",
    "commentBody": "",
    "originSummary": [
      "Ison-Britannian hallitus on lähellä hyväksyä verkkoturvallisuuslain, joka voisi mahdollistaa takaovien lisäämisen viestipalveluihin ja heikentää päästä päähän -salausta.",
      "Kansalaisyhteiskunnan ryhmät, tekniset asiantuntijat, ihmisoikeusjärjestöt ja viestipalvelujen tarjoajat ovat vastustaneet lakiehdotusta ja esittäneet huolenaiheita sen vaikutuksista maailmanlaajuiseen mittakaavaan, yksityisyyteen ja demokratiaan.",
      "Hallituksen väitteet siitä, että se voi skannata viestejä laittoman sisällön varalta ja samalla suojella yksityisyyttä, on kumottu.",
      "Asianajajat kehottavat Yhdistyneen kuningaskunnan lainsäätäjiä turvaamaan salauksen ja yksityisyyden lisäämällä lakiesitykseen muutoksen."
    ],
    "commentSummary": [
      "Osallistujat keskustelevat salauksesta, hallituksen valvonnasta ja Applen suhteesta Kiinaan.",
      "Yhdistyneen kuningaskunnan hallituksen yritystä heikentää salausta arvostellaan.",
      "On esitetty huoli siitä, että Apple vaarantaa periaatteensa.",
      "Hallituksen valvonnan mahdollisista seurauksista keskustellaan.",
      "Keskusteluissa käsitellään internetin rajoja ja sääntelyn vaikutusta internetin käyttöön.",
      "Lakiehdotusten toteutettavuus ja tehokkuus kyseenalaistetaan.",
      "Yhteisiä teemoja ovat yksityisyyden suojan heikkeneminen, huoli hallituksen liiallisesta toiminnasta ja hallituksen toimien mahdolliset kielteiset seuraukset."
    ],
    "points": 439,
    "commentCount": 268,
    "retryCount": 0,
    "time": 1690578101
  },
  {
    "id": 36910256,
    "title": "Leikkivaje on merkittävä syy teini-ikäisten mielenterveyskriisiin.",
    "originLink": "https://jonathanhaidt.substack.com/p/the-play-deficit",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36910256",
    "commentBody": "",
    "originSummary": [
      "Lasten valvomaton leikki on vähenemässä, ja sillä on kielteisiä vaikutuksia lasten mielenterveyteen.",
      "Vapaan leikin lisäämistä pidetään kustannustehokkaana ratkaisuna nuorten mielenterveyskriisiin.",
      "Kirjoittajat ovat yhtä mieltä siitä, että leikin puute on yksi tekijä, mutta älypuhelinten ja sosiaalisen median roolista he ovat eri mieltä.",
      "Tutkimukset osoittavat, että leikki ja itsenäinen toiminta täyttävät psykologisia tarpeita autonomian, pätevyyden ja suhteellisuuden suhteen, mikä johtaa parempaan henkiseen hyvinvointiin.",
      "Artikkelissa korostetaan nuorten ahdistuneisuuden, masennuksen ja itsemurhien lisääntymistä, mikä liittyy vapauden ja leikin vähenemiseen.",
      "Ennaltaehkäisyn asettaminen etusijalle leikin ja tutkimisen mahdollistamisen kautta voi parantaa mielenterveystuloksia."
    ],
    "commentSummary": [
      "Keskusteluissa käsitellään erilaisia vanhemmuuteen, lapsen kehitykseen, leikkiin ja kasvatukseen liittyviä aiheita.",
      "Strukturoimaton leikki on ratkaisevan tärkeää teini-ikäisten mielenterveyden kannalta.",
      "Erilaiset vanhemmuuden lähestymistavat voivat auttaa ehkäisemään lasten riskikäyttäytymistä.",
      "Keskustellaan autojen vaikutuksesta lasten turvallisuuteen ja vapauteen.",
      "Lasten tutkimisen ja kokeilemisen salliminen on arvokasta.",
      "Liiallisella aikataulutuksella ja liiallisella ruutuajalla on kielteisiä vaikutuksia lapsiin.",
      "Sosiaalinen vuorovaikutus ja koulutuksen dynamiikka muuttuvat.",
      "Käytännönläheiset oppimiskokemukset, luovuus ja itsenäisyys edistävät lasten kehitystä."
    ],
    "points": 411,
    "commentCount": 348,
    "retryCount": 0,
    "time": 1690565321
  },
  {
    "id": 36908136,
    "title": "Kalifornia yrittää vaientaa Stanfordin tutkijat, jotka saivat tietoja koulutuksen tutkimista varten.",
    "originLink": "https://edsource.org/2023/california-moves-to-silence-stanford-researchers-who-got-state-data-to-study-education-issues/694920",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36908136",
    "commentBody": "",
    "originSummary": [
      "Kalifornian opetusministeriötä arvostellaan sen datakumppanuussopimuksiin sisältyvästä lausekkeesta.",
      "Lauseke estää tutkijoita todistamasta osastoa vastaan oikeudenkäynneissä.",
      "American Civil Liberties Union katsoo, että tämä loukkaa tutkijoiden ensimmäistä lisäystä koskevia oikeuksia.",
      "Riita ei koske opiskelijoiden tietojen luovuttamista.",
      "Tämä tapaus on merkittävä, koska se voi rajoittaa tutkijoiden mahdollisuuksia puuttua Kalifornian koulutukselliseen epätasa-arvoon.",
      "CDE väittää, että säännös on välttämätön oppilaiden yksityisyyden suojaamiseksi."
    ],
    "commentSummary": [
      "Keskustelussa käsitellään Kalifornian opetusministeriön asettamaa rajoitusta, joka koskee tutkijoiden osallistumista oikeudenkäynteihin.",
      "Keskustelussa tarkastellaan rodun roolia kykyjen määrittelyssä.",
      "Tietojen tunnistamisen poistamiseen liittyviä haasteita käsitellään.",
      "Tutkitaan avoimuuden ja yksityisyyden välistä tasapainoa koulutustutkimuksessa.",
      "Asiantuntijatodistajien käyttöä oikeudenkäynneissä ja heidän palkkioitaan käsitellään.",
      "Hallitusohjelmiin ja tietosuojaan liittyviä kysymyksiä käsitellään.",
      "Keskustelussa korostetaan yksityisyyden suojan merkitystä ja tunnustetaan samalla avoimuuden ja vastuuvelvollisuuden merkitys."
    ],
    "points": 411,
    "commentCount": 250,
    "retryCount": 0,
    "time": 1690557598
  },
  {
    "id": 36909427,
    "title": "Miksi DNS:ää on edelleen vaikea oppia?",
    "originLink": "https://jvns.ca/blog/2023/07/28/why-is-dns-still-hard-to-learn/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36909427",
    "commentBody": "",
    "originSummary": [
      "DNS:n oppiminen ja vianmääritys voi olla haastavaa järjestelmän piilotetun luonteen vuoksi.",
      "Resolverin välimuisti sekä resolverin ja arvovaltaisten nimipalvelimien välinen keskustelu ovat usein käyttäjiltä piilossa.",
      "Kirjoittaja ehdottaa, että ihmisille opetetaan näitä piilotettuja järjestelmiä ja että DNS:ssä tarjotaan enemmän näkyvyyttä ja vianmääritystietoja.",
      "Hämmentävät työkalut ja niiden tuotokset aiheuttavat haasteita DNS-vianmäärityksessä, ja kirjoittaja ehdottaa työkalujen tuotosten parantamista ja käyttäjäystävällisempien komentorivityökalujen luomista.",
      "Yhteisten DNS-ongelmien dokumentoinnin vaikeus johtuu yksilöllisten kokemusten vaihtelusta.",
      "Harvinainen altistuminen ja pelko kokeilla DNS:ää vaikeuttavat osaltaan tämän aiheen oppimista."
    ],
    "commentSummary": [
      "DNS:n (verkkotunnusjärjestelmä) oppiminen on haastavaa ja monimutkaista.",
      "DNS-ongelmien vianmääritys on yleinen ongelma.",
      "DNS:n ymmärtämisen esteet on poistettava.",
      "DNS-oppimisen tehostamiseksi tarvitaan parempaa dokumentaatiota ja välineitä.",
      "Keskustellaan FOSS-työkalujen (vapaat ja avoimen lähdekoodin ohjelmistot) keskeisten käyttöliittymien parantamisesta.",
      "Puolipisteiden käyttö DNS-kyselyissä on keskustelun aihe.",
      "DNS:n oppimisen helppous on kyseenalaistettu.",
      "Infrastruktuurin ymmärtämistä pidetään tärkeänä DNS-oppimisessa.",
      "Nuorten kehittäjien teknisten taitojen heikkeneminen on huolestuttavaa.",
      "Keskustellaan DNS-protokollista ja vyöhyketiedostoista.",
      "Vaihtoehtoiset DNS-ohjelmistovaihtoehdot mainitaan.",
      "Jaetaan erityisiä kokemuksia DNS-vianmäärityksestä.",
      "DNS:ää käytetään eri tarkoituksiin."
    ],
    "points": 409,
    "commentCount": 219,
    "retryCount": 0,
    "time": 1690562031
  },
  {
    "id": 36910146,
    "title": "\"Web Environment Integrity\" on hyökkäys vapaata Internetiä vastaan.",
    "originLink": "https://www.fsf.org/blogs/community/web-environment-integrity-is-an-all-out-attack-on-the-free-internet",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36910146",
    "commentBody": "",
    "originSummary": [
      "Artikkelissa käsitellään Googlen \"Web Environment Integrity\" (WEI) -käytäntöä.",
      "Käytäntö antaa kehittäjille mahdollisuuden hyväksyä tai kieltää tietyt selainmääritykset, mikä saattaa rajoittaa ilmaisten selainten tai käyttöjärjestelmien käyttäjien pääsyä verkkosivustoille.",
      "Artikkelissa esitetään, että hallitukset ja yritykset voisivat käyttää WEI:tä hyväkseen hallitakseen ja rajoittaakseen internetin käyttöä.",
      "Free Software Foundation kehottaa Googlea harkitsemaan politiikkaa uudelleen ja korostaa vapaan ja avoimen internetin merkitystä."
    ],
    "commentSummary": [
      "Googlen \"Web Environment Integrity\" (WEI) -ehdotusta tarkastellaan sen mahdollisen vaikutuksen vuoksi internetin vapauteen.",
      "Käyttäjät ovat huolissaan Googlen kasvavasta valvonnasta selaimen tietoturvan, mainosten eston ja verkkosivustojen käytön suhteen.",
      "Googlen reCAPTCHA-järjestelmän tarkoituksesta ja sen mahdollisuudesta jäljittää ja louhia tietoja on esitetty huolenaiheita.",
      "WEI:tä verrataan Applen Privacy Access Tokeniin (PAT), mikä johtaa skeptisyyteen ja vastustukseen Googlen toimia kohtaan.",
      "Keskustelussa käsitellään muun muassa vaihtoehtoisia protokollia, suurten teknologiayhtiöiden vaikutusta sekä mahdollisia rajoituksia käyttäjien valvonnassa ja internetin käyttömahdollisuuksissa."
    ],
    "points": 370,
    "commentCount": 75,
    "retryCount": 0,
    "time": 1690564855
  },
  {
    "id": 36914401,
    "title": "No-GIL-tila tulossa Pythonille",
    "originLink": "https://lwn.net/Articles/939568/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36914401",
    "commentBody": "",
    "originSummary": [
      "Pythonin ohjausneuvosto harkitsee ehdotusta, jonka mukaan GIL (Global Interpreter Lock) olisi valinnainen CPythonissa.",
      "Tämä mahdollistaisi GIL-vapaan tilan Pythonissa, mikä mahdollisesti parantaisi samanaikaisuutta.",
      "Neuvosto on varovainen varmistaakseen taaksepäin yhteensopivuuden ja välttääkseen Python 2:n ja 3:n jakautumisen.",
      "He keskustelevat ABI-yhteensopivuusvaatimuksista ja käsittelevät vaikutuksia taaksepäin yhteensopivuuteen.",
      "Jotkut kommentoijat ovat ilmaisseet huolensa mahdollisista yhteensopivuusongelmista ja suosittelevat vaihtoehtoisia lähestymistapoja Pythonin rinnakkaisuuden parantamiseen."
    ],
    "commentSummary": [
      "Python on ottamassa käyttöön No-GIL (Global Interpreter Lock) -tilan, kuten lwn.net-sivustolla julkaistusta viestistä käy ilmi.",
      "Global Interpreter Lock on Pythonissa käytetty mekanismi, joka sallii vain yhden säikeen suorittaa Python-tekstikoodia kerrallaan.",
      "No-GIL-tilan tarkoituksena on poistaa tämä rajoitus ja sallia useiden säikeiden suorittaa Pythonin tavukoodia samanaikaisesti.",
      "Tieto No-GIL-tilasta jaettiin alun perin ycombinator.com-sivustolla."
    ],
    "points": 341,
    "commentCount": 1,
    "retryCount": 0,
    "time": 1690584427
  }
]
