[
  {
    "id": 36908309,
    "title": "Cap'n Proto 1.0",
    "originLink": "https://capnproto.org/news/2023-07-28-capnproto-1.0.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36908309",
    "commentBody": "",
    "originSummary": [
      "கேப்'என் புரோட்டோ, ஒரு செய்தியிடல் நெறிமுறை, அதன் சி ++ குறிப்பு செயலாக்கத்தின் பதிப்பு 1.0 ஐ வெளியிட்டுள்ளது.",
      "நெறிமுறை பல ஆண்டுகளாக உற்பத்தியில் பயன்படுத்தப்படுகிறது, இது அதன் நம்பகத்தன்மையைக் குறிக்கிறது.",
      "வெளியீட்டில் மேம்பட்ட செயல்திறனுக்கான தேர்வுமுறைகள் அடங்கும்.",
      "ஆர்.பி.சி ரத்து செய்ய அனுமதிக்கும் வகையில் மாற்றங்கள் செய்யப்பட்டுள்ளன.",
      "பதிப்பு 2.0 க்கான திட்டங்களில் டெவலப்பர் அனுபவத்தை மேம்படுத்த சி ++ ஏபிஐ மற்றும் கேஜே சி ++ கருவித்தொகுப்பு நூலகத்திற்கான திருத்தங்கள் அடங்கும்.",
      "இந்த மாற்றங்களுக்கு சி ++20 ஆதரவு கொண்ட ஒரு கம்பைலர் தேவைப்படும், மேலும் இது கே.ஜே.யை மிகவும் கோரோடைன்-நட்பாக மாற்றக்கூடும்.",
      "வரிசைப்படுத்தல் வடிவம் அல்லது ஆர்பிசி நெறிமுறையில் பின்னோக்கி பொருந்தாத மாற்றங்கள் செய்யப்படாது.",
      "2.0 படம் இன்னும் சில ஆண்டுகளாக வெளியாக வாய்ப்பில்லை."
    ],
    "commentSummary": [
      "கேப்'என் புரோட்டோவின் கோ அமலாக்கத்திற்கு முக்கிய பங்களிப்பாளரான இயான் டென்ஹார்ட் காலமானார், இது கேப்'என் புரோட்டோ மற்றும் சாண்ட்ஸ்டார்ம் சமூகங்களை சோகத்தில் ஆழ்த்தியுள்ளது.",
      "கேப்'என் புரோட்டோ என்பது கிளவுட்ஃப்ளேரின் தொழிலாளர் தளத்தில் பயன்படுத்தப்படும் உயர் செயல்திறன் தரவு வரிசைப்படுத்தல் வடிவமாகும்.",
      "கேப்ஸ் புரோட்டோவின் நன்மைகள், அதன் திறமையான வரிசைப்படுத்தல் மற்றும் டிசெரியலைசேஷன் உட்பட விவாதிக்கப்படுகின்றன.",
      "பல்வேறு மொழிகளில் செயல்படுத்தல்களின் எடுத்துக்காட்டுகளுடன், கேப்'என் புரோட்டோவுக்கான மொழி ஆதரவும் விவாதத்தில் அடங்கும்.",
      "Cap'n Proto இன் மேலும் மேம்பாடு மற்றும் மேம்பாட்டிற்கான சாத்தியக்கூறுகள் ஆராயப்படுகின்றன.",
      "மென்பொருள் மேம்பாட்டில் தேவையான மற்றும் விருப்பத் துறைகள், நிலையான தட்டச்சு மற்றும் நெறிமுறை வடிவமைப்பின் சவால்கள் போன்ற தலைப்புகளை உரையாடல் தொடுகிறது.",
      "அவ்ரோ, புரோட்டோபுஃப் மற்றும் பிளாட்பஃபர்ஸ் போன்ற பிற வரிசை வடிவங்கள் கேப்'என் புரோட்டோவுடன் ஒப்பிடப்படுகின்றன.",
      "பிற பைனரி வரிசை நூலகங்கள் மற்றும் நெறிமுறைகளுக்கான பரிந்துரைகள் கேப்'என் புரோட்டோவுடன் குறிப்பிடப்பட்டுள்ளன."
    ],
    "points": 621,
    "commentCount": 192,
    "retryCount": 0,
    "time": 1690558084
  },
  {
    "id": 36906022,
    "title": "90 கள் மற்றும் அதற்கு முந்தைய டிவியைப் பாருங்கள்",
    "originLink": "https://my90stv.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36906022",
    "commentBody": "",
    "originSummary": [
      "சுருக்கம் டிவி சேனல்களின் பட்டியலையும் அவற்றின் வகைகளையும் விவரிக்கிறது.",
      "இது 1990 களுக்கு மீண்டும் பயணிக்க ஒரு பொத்தானை குறிப்பிடுகிறது.",
      "இந்த தகவல் கடைசியாக ஜூலை 23, 2023 அன்று புதுப்பிக்கப்பட்டது.",
      "பட்டியலை உருவாக்கியவர் பெருமைக்குரியவர்.",
      "ஒரு காபி வாங்க நன்கொடைகள் கோரப்படுகிறது."
    ],
    "commentSummary": [
      "கருத்து நூல் பல்வேறு தசாப்தங்களிலிருந்து, குறிப்பாக 60கள், 70கள், 80கள் மற்றும் 90 களில் இருந்து தொலைக்காட்சி நிகழ்ச்சிகளைப் பார்ப்பதைப் பற்றி விவாதிக்கிறது.",
      "பயனர்கள் சேனல்-ஃபிளிப்பிங் அனுபவத்திற்கான ஏக்கத்தை வெளிப்படுத்துகிறார்கள் மற்றும் தற்போதைய ஸ்ட்ரீமிங் சேவைகளில் புதுமை இல்லாததை விமர்சிக்கின்றனர்.",
      "பழைய தொலைக்காட்சி நிகழ்ச்சிகளை அணுகுவதற்கான மாற்று தளங்கள் மற்றும் முறைகள் பரிந்துரைக்கப்படுகின்றன.",
      "வி.எச்.எஸ் நாடாக்களை டிஜிட்டல் மயமாக்குவதில் உள்ள சவால்கள் மற்றும் அனலாக் டிவிகளின் வரம்புகள் குறிப்பிடப்பட்டுள்ளன.",
      "பயனர்கள் கடந்த காலத்தில் டிவி பார்த்த அனுபவங்களையும் நினைவுகளையும் பகிர்ந்து கொள்கிறார்கள்.",
      "90 களின் குறிப்பிட்ட சேனல்கள், விளம்பரங்கள் மற்றும் நிகழ்ச்சிகள் விவாதிக்கப்படுகின்றன.",
      "பதிப்புரிமை மற்றும் உரிம சிக்கல்கள் பழைய தொலைக்காட்சி நிகழ்ச்சிகளைப் பார்க்கும் சூழலில் குறிப்பிடப்படுகின்றன."
    ],
    "points": 540,
    "commentCount": 232,
    "retryCount": 0,
    "time": 1690548379
  },
  {
    "id": 36906435,
    "title": "அறிவியல் அறிவை வழங்கியதற்காக Sci-Hub நிறுவனர் EFF விருதைப் பெறுகிறார்",
    "originLink": "https://torrentfreak.com/sci-hubs-alexandra-elbakyan-receives-eff-award-for-providing-access-to-scientific-knowledge-230728/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36906435",
    "commentBody": "",
    "originSummary": [
      "அறிவியல்-மையத்தின் நிறுவனர் அலெக்சாண்ட்ரா எல்பாக்யான், அறிவியல் அறிவை இலவசமாக அணுகுவதற்கான அவரது முயற்சிகளுக்காக மின்னணு எல்லைப்புற அறக்கட்டளையால் (எஃப்.எஃப்) அங்கீகரிக்கப்பட்டுள்ளார்.",
      "Sci-Hub என்பது மாணவர்கள் மற்றும் ஆராய்ச்சியாளர்களுக்கு ஒரு மதிப்புமிக்க வளமாகும், இது உயிர்களைக் காப்பாற்றுவதில் அதன் பங்கிற்காக பாராட்டப்படுகிறது.",
      "சட்ட சவால்கள் மற்றும் முக்கிய வெளியீட்டாளர்களுக்கு செலுத்த வேண்டிய மில்லியன் கணக்கான சேதங்கள் இருந்தபோதிலும் எல்பக்யான் தொடர்ந்து அறிவியல் மையத்தின் பணியைப் பாதுகாக்கிறார்.",
      "தற்போதைய கல்வி வெளியீட்டு முறையை சவால் செய்வதிலும் மில்லியன் கணக்கானவர்களுக்கு அறிவியல் தகவல்களை அணுக உதவுவதிலும் எல்பாக்யனின் பணியை ஈ.எஃப்.எஃப் அங்கீகரிக்கிறது.",
      "செப்டம்பரில் நடக்கும் விழாவில் எல்பக்யான் நேரடியாக விருதைப் பெறுகிறார்."
    ],
    "commentSummary": [
      "அறிவியல்-மையத்தின் நிறுவனர் அலெக்சாண்ட்ரா எல்பாக்யானுக்கு அறிவியல் அறிவை அணுகக்கூடியதாக மாற்றுவதற்கான முயற்சிகளுக்காக எலக்ட்ரானிக் ஃப்ரான்டியர் ஃபவுண்டேஷன் (எஃப்எஃப்) முன்னோடி விருது வழங்கப்பட்டுள்ளது.",
      "லினஸ் டோர்வால்ட்ஸ் மற்றும் லினக்ஸுடன் ஒப்பிட்டு, தனிப்பட்ட முறையில் விருதைப் பெறுவதை விட, சை-ஹப் சார்பாக ஏற்றுக்கொள்வதில் எல்பாக்கியன் அதிருப்தியை வெளிப்படுத்தினார்.",
      "அறிவை ஜனநாயகப்படுத்துவதில் அறிவியல் மையத்தின் முக்கியத்துவத்தையும், அறிவியல் கட்டுரைகளை அணுகுவதற்கான மாற்று தளங்கள் கிடைப்பதையும் இந்த விவாதம் வலியுறுத்தியது.",
      "எவ்வாறாயினும், பதிப்புரிமை மீறல் தொடர்பான சட்ட வழக்குகளில் ஈ.எஃப்.எஃப் ஐ பலவீனப்படுத்த இந்த விருது பயன்படுத்தப்படலாம் என்ற கவலைகள் உள்ளன."
    ],
    "points": 472,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1690550754
  },
  {
    "id": 36907248,
    "title": "வேர்ல்ட்காயின் நினைப்பது போல் மோசமாக இல்லை: இது மோசமானது",
    "originLink": "https://blockworks.co/news/worldcoin-privacy-concerns",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36907248",
    "commentBody": "",
    "originSummary": [
      "வேர்ல்ட்காயின் என்பது ஒரு புதிய நிதி அமைப்பாகும், இது முக்கியமான பயோமெட்ரிக் தரவை சேகரித்து சமத்துவம் மற்றும் நியாயத்தை வழங்குவதாக உறுதியளிக்கிறது.",
      "இந்த கட்டுரை வேர்ல்ட்காயின் பயன்படுத்தும் கேள்விக்குரிய தரவு சேகரிப்பு முறைகள் மற்றும் சரிபார்க்கப்பட்ட நற்சான்றிதழ்களுக்கு ஒரு கருப்பு சந்தையை உருவாக்குவதற்கான சாத்தியக்கூறுகள் குறித்து கவலைகளை எழுப்புகிறது.",
      "வேர்ல்ட்காயினின் தனியுரிமை நடவடிக்கைகளின் செயல்திறன் மற்றும் மாற்ற முடியாத பயோமெட்ரிக் பண்புகளை பணத்துடன் இணைப்பதன் விளைவுகளும் கேள்விக்குள்ளாக்கப்படுகின்றன.",
      "உள்ளிருப்பவர்களுக்கு கணிசமான எண்ணிக்கையிலான டோக்கன்களை ஒதுக்குவதை உள்ளடக்கிய வேர்ல்ட்காயினின் விநியோகத் திட்டம் விமர்சிக்கப்படுகிறது.",
      "வேர்ல்ட்காயின் அது கூறுவதைப் போல புரட்சிகரமாகவோ அல்லது சமத்துவமாகவோ இருக்காது என்று கட்டுரை தெரிவிக்கிறது."
    ],
    "commentSummary": [
      "இந்த விவாதம் கிரிப்டோகரன்சி, அடையாள சரிபார்ப்பு மற்றும் பிளாக்செயின் தொழில்நுட்பத்தின் வரம்புகள் உள்ளிட்ட பல தலைப்புகளை உள்ளடக்கியது.",
      "இந்த உரையாடல் முதன்மையாக வேர்ல்ட்காயின் திட்டம் மற்றும் அதன் சாத்தியமான குறைபாடுகள் மற்றும் தாக்கங்களை மையமாகக் கொண்டுள்ளது.",
      "பங்கேற்பாளர்கள் வேர்ல்ட்காயின் திட்டத்தின் நம்பகத்தன்மை குறித்து சந்தேகத்தை வெளிப்படுத்துகிறார்கள்.",
      "அடையாளம் காண பயோமெட்ரிக்ஸைப் பயன்படுத்துவது குறித்து கவலைகள் எழுப்பப்படுகின்றன.",
      "உலக நாணயத்தின் விநியோகம் மற்றும் நியாயம் குறித்து சந்தேகங்கள் எழுப்பப்படுகின்றன.",
      "கிரிப்டோகரன்சி மீதான நம்பிக்கை, தொழில்நுட்ப முன்னேற்றத்தில் முதலாளித்துவத்தின் பங்கு மற்றும் ஆன்லைன் அடையாளம் மற்றும் தனியுரிமையின் சவால்கள் போன்ற பிரச்சினைகளையும் இந்த விவாதம் ஆராய்கிறது."
    ],
    "points": 456,
    "commentCount": 320,
    "retryCount": 0,
    "time": 1690554310
  },
  {
    "id": 36913268,
    "title": "இங்கிலாந்து அரசாங்கம் உலகளவில் குறியாக்கத்தை அழிக்கும் நிலையில் உள்ளது",
    "originLink": "https://www.eff.org/deeplinks/2023/07/uk-government-very-close-eroding-encryption-worldwide",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36913268",
    "commentBody": "",
    "originSummary": [
      "இங்கிலாந்து அரசாங்கம் ஆன்லைன் பாதுகாப்பு மசோதாவை நிறைவேற்றுவதற்கு நெருக்கமாக உள்ளது, இது செய்தியிடல் சேவைகளில் பின்வாசல்களைச் செருகவும், எண்ட்-டு-எண்ட் குறியாக்கத்தை பலவீனப்படுத்தவும் உதவும்.",
      "சிவில் சமூக குழுக்கள், தொழில்நுட்ப வல்லுநர்கள், மனித உரிமை அமைப்புகள் மற்றும் செய்தி வழங்குநர்கள் இந்த மசோதாவை எதிர்த்துள்ளனர், இது உலகளாவிய அளவில், தனியுரிமை மற்றும் ஜனநாயகத்தில் அதன் தாக்கம் குறித்த கவலைகளை மேற்கோள் காட்டி.",
      "தனியுரிமையைப் பாதுகாக்கும் அதே வேளையில் சட்டவிரோத உள்ளடக்கத்திற்காக செய்திகளை ஸ்கேன் செய்யலாம் என்ற அரசாங்கத்தின் கூற்றுக்கள் முரணாக உள்ளன.",
      "இந்த மசோதாவில் திருத்தம் செய்வதன் மூலம் குறியாக்கம் மற்றும் தனியுரிமையைப் பாதுகாக்குமாறு இங்கிலாந்து நாடாளுமன்ற உறுப்பினர்களை வழக்கறிஞர்கள் வலியுறுத்தி வருகின்றனர்."
    ],
    "commentSummary": [
      "பங்கேற்பாளர்கள் குறியாக்கம், அரசாங்க கண்காணிப்பு மற்றும் சீனாவுடனான ஆப்பிளின் உறவு பற்றி விவாதிக்கின்றனர்.",
      "குறியாக்கத்தை குறைமதிப்பிற்கு உட்படுத்தும் இங்கிலாந்து அரசாங்கத்தின் முயற்சி குறித்து விமர்சனங்கள் வெளிப்படுத்தப்படுகின்றன.",
      "ஆப்பிள் தனது கொள்கைகளில் சமரசம் செய்துகொள்வது குறித்து கவலைகள் எழுப்பப்படுகின்றன.",
      "அரசாங்க கட்டுப்பாட்டின் சாத்தியமான விளைவுகள் விவாதிக்கப்படுகின்றன.",
      "விவாதங்கள் இணைய எல்லைகள் மற்றும் இணைய பயன்பாட்டில் விதிமுறைகளின் தாக்கம் ஆகியவற்றைச் சுற்றி வருகின்றன.",
      "முன்மொழியப்பட்ட சட்டங்களின் சாத்தியக்கூறு மற்றும் செயல்திறன் கேள்விக்குள்ளாக்கப்படுகிறது.",
      "பொதுவான கருப்பொருள்களில் தனியுரிமையின் அரிப்பு, அரசாங்க அத்துமீறல் பற்றிய கவலைகள் மற்றும் அரசாங்க நடவடிக்கைகளின் எதிர்மறையான விளைவுகள் ஆகியவை அடங்கும்."
    ],
    "points": 439,
    "commentCount": 268,
    "retryCount": 0,
    "time": 1690578101
  },
  {
    "id": 36910256,
    "title": "டீன் ஏஜ் மனநல நெருக்கடிக்கு விளையாட்டு பற்றாக்குறை ஒரு முக்கிய காரணம்",
    "originLink": "https://jonathanhaidt.substack.com/p/the-play-deficit",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36910256",
    "commentBody": "",
    "originSummary": [
      "குழந்தைகளிடையே மேற்பார்வையற்ற விளையாட்டு குறைந்து வருகிறது, மேலும் இது அவர்களின் மன ஆரோக்கியத்தில் எதிர்மறையான விளைவுகளை ஏற்படுத்துகிறது.",
      "இலவச விளையாட்டை அதிகரிப்பது பதின்ம வயதினரிடையே மனநல நெருக்கடியை நிவர்த்தி செய்வதற்கான செலவு குறைந்த தீர்வாக பார்க்கப்படுகிறது.",
      "விளையாட்டு பற்றாக்குறை ஒரு பங்களிக்கும் காரணி என்று ஆசிரியர்கள் ஒப்புக்கொள்கிறார்கள், ஆனால் ஸ்மார்ட்போன்கள் மற்றும் சமூக ஊடகங்களின் பங்கு குறித்து அவர்கள் மாறுபட்ட கருத்துக்களைக் கொண்டுள்ளனர்.",
      "விளையாட்டு மற்றும் சுயாதீன நடவடிக்கைகள் தன்னாட்சி, திறன் மற்றும் உறவுக்கான உளவியல் தேவைகளை பூர்த்தி செய்கின்றன, இது சிறந்த மன நல்வாழ்வுக்கு வழிவகுக்கிறது என்று ஆராய்ச்சி காட்டுகிறது.",
      "இந்த கட்டுரை இளைஞர்களில் பதட்டம், மனச்சோர்வு மற்றும் தற்கொலை விகிதங்களின் அதிகரிப்பை எடுத்துக்காட்டுகிறது, இது சுதந்திரம் மற்றும் விளையாட்டின் குறைவுடன் இணைக்கப்பட்டுள்ளது.",
      "விளையாட்டு மற்றும் ஆராய்ச்சி மூலம் தடுப்புக்கு முன்னுரிமை அளிப்பது மேம்பட்ட மனநல விளைவுகளுக்கு வழிவகுக்கும்."
    ],
    "commentSummary": [
      "இந்த கலந்துரையாடல் குழந்தை வளர்ப்பு, குழந்தை மேம்பாடு, விளையாட்டு மற்றும் கல்வி தொடர்பான பல்வேறு தலைப்புகளை உள்ளடக்கியது.",
      "கட்டமைக்கப்படாத விளையாட்டு பதின்ம வயதினரின் மன ஆரோக்கியத்திற்கு முக்கியமானது.",
      "வெவ்வேறு குழந்தை வளர்ப்பு அணுகுமுறைகள் குழந்தைகளில் ஆபத்தான நடத்தையைத் தடுக்க உதவும்.",
      "குழந்தைகளின் பாதுகாப்பு மற்றும் சுதந்திரத்தில் கார்களின் தாக்கம் குறித்து விவாதிக்கப்படுகிறது.",
      "குழந்தைகளை ஆராய்ந்து பரிசோதிக்க அனுமதிப்பது மதிப்புமிக்கது.",
      "அதிகப்படியான திட்டமிடல் மற்றும் அதிகப்படியான திரை நேரம் குழந்தைகளுக்கு எதிர்மறையான விளைவுகளை ஏற்படுத்துகின்றன.",
      "சமூக தொடர்புகள் மற்றும் கல்வி இயக்கவியல் மாறி வருகிறது.",
      "கற்றல் அனுபவங்கள், படைப்பாற்றல் மற்றும் சுதந்திரம் ஆகியவை குழந்தைகளின் வளர்ச்சிக்கு நன்மை பயக்கும்."
    ],
    "points": 411,
    "commentCount": 348,
    "retryCount": 0,
    "time": 1690565321
  },
  {
    "id": 36908136,
    "title": "கல்வியைப் படிக்க தரவுகளைப் பெற்ற ஸ்டான்போர்டு ஆராய்ச்சியாளர்களை அமைதிப்படுத்த கலிபோர்னியா நகர்கிறது",
    "originLink": "https://edsource.org/2023/california-moves-to-silence-stanford-researchers-who-got-state-data-to-study-education-issues/694920",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36908136",
    "commentBody": "",
    "originSummary": [
      "கலிபோர்னியா கல்வித் துறை அதன் தரவு-கூட்டாண்மை ஒப்பந்தங்களில் ஒரு பிரிவிற்காக விமர்சிக்கப்படுகிறது.",
      "வழக்குகளில் துறைக்கு எதிராக ஆராய்ச்சியாளர்கள் சாட்சியமளிப்பதை இந்த பிரிவு தடுக்கிறது.",
      "இது ஆராய்ச்சியாளர்களின் முதல் திருத்த உரிமைகளை மீறுவதாக அமெரிக்க சிவில் உரிமைகள் சங்கம் நம்புகிறது.",
      "மாணவர் அளவிலான தகவல்களை வெளியிடுவது இந்த சர்ச்சையில் அடங்காது.",
      "கலிபோர்னியாவில் கல்வி ஏற்றத்தாழ்வுகளை நிவர்த்தி செய்வதற்கான ஆராய்ச்சியாளர்களின் திறனைக் கட்டுப்படுத்தக்கூடும் என்பதால் இந்த வழக்கு முக்கியத்துவம் வாய்ந்தது.",
      "மாணவர்களின் தனியுரிமையைப் பாதுகாக்க இந்த ஏற்பாடு அவசியம் என்று சி.டி.இ வாதிடுகிறது."
    ],
    "commentSummary": [
      "கலிபோர்னியா கல்வித் துறையால் விதிக்கப்பட்ட வழக்குகளில் ஆராய்ச்சியாளர்கள் பங்கேற்பதற்கான கட்டுப்பாடு குறித்து உரையாடல் விவாதிக்கிறது.",
      "திறன்களைத் தீர்மானிப்பதில் இனத்தின் பங்கு உரையாடலில் ஆராயப்படுகிறது.",
      "தரவுகளை அடையாளம் காண்பது தொடர்பான சவால்கள் விவாதிக்கப்படுகின்றன.",
      "கல்வி ஆராய்ச்சியில் வெளிப்படைத்தன்மை மற்றும் தனியுரிமைக்கு இடையிலான சமநிலை ஆராயப்படுகிறது.",
      "வழக்குகளில் நிபுணத்துவ சாட்சிகளைப் பயன்படுத்துவது மற்றும் அவற்றின் கட்டணங்கள் விவாதிக்கப்படுகின்றன.",
      "அரசாங்க திட்டங்கள் மற்றும் தரவு தனியுரிமை தொடர்பான சிக்கல்கள் தீர்க்கப்படுகின்றன.",
      "இந்த உரையாடல் வெளிப்படைத்தன்மை மற்றும் பொறுப்புணர்வின் முக்கியத்துவத்தை அங்கீகரிக்கும் அதே நேரத்தில் தனியுரிமை பாதுகாப்பின் முக்கியத்துவத்தை வலியுறுத்துகிறது."
    ],
    "points": 411,
    "commentCount": 250,
    "retryCount": 0,
    "time": 1690557598
  },
  {
    "id": 36909427,
    "title": "டி.என்.எஸ் ஏன் இன்னும் கற்றுக்கொள்வது கடினம்?",
    "originLink": "https://jvns.ca/blog/2023/07/28/why-is-dns-still-hard-to-learn/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36909427",
    "commentBody": "",
    "originSummary": [
      "கணினியின் மறைக்கப்பட்ட தன்மை காரணமாக டி.என்.எஸ்ஸைக் கற்றுக்கொள்வதும் சரிசெய்வதும் சவாலானது.",
      "தீர்மானிப்பவரின் தற்காலிக சேமிப்பகம் மற்றும் தீர்வு காண்பவருக்கும் அதிகாரப்பூர்வ நேம்சர்வர்களுக்கும் இடையிலான உரையாடல் பெரும்பாலும் பயனர்களிடமிருந்து மறைக்கப்படுகிறது.",
      "இந்த மறைக்கப்பட்ட அமைப்புகளைப் பற்றி மக்களுக்கு கற்பிக்கவும், டி.என்.எஸ்ஸில் அதிக பார்வை மற்றும் பிழைத்திருத்த தகவல்களை வழங்கவும் ஆசிரியர் பரிந்துரைக்கிறார்.",
      "குழப்பமான கருவிகள் மற்றும் அவற்றின் வெளியீடு டி.என்.எஸ் சரிசெய்தலில் சவால்களை ஏற்படுத்துகின்றன, மேலும் ஆசிரியர் கருவி வெளியீட்டை மேம்படுத்துவதற்கும் அதிக பயனர் நட்பு கட்டளை வரி கருவிகளை உருவாக்குவதற்கும் முன்மொழிகிறார்.",
      "பொதுவான டி.என்.எஸ் சிக்கல்களை ஆவணப்படுத்துவதில் உள்ள சிரமம் தனிப்பட்ட அனுபவங்களின் மாறுபாடுகளிலிருந்து எழுகிறது.",
      "எப்போதாவது வெளிப்பாடு மற்றும் டி.என்.எஸ் உடன் பரிசோதனை செய்வதற்கான பயம் ஆகியவை இந்த பாடத்தைக் கற்றுக்கொள்வதில் சிரமத்திற்கு பங்களிக்கின்றன."
    ],
    "commentSummary": [
      "DNS (டொமைன் பெயர் அமைப்பு) கற்றல் சவால்கள் மற்றும் சிக்கல்களை ஏற்படுத்துகிறது.",
      "டி.என்.எஸ் சிக்கல்களைத் திருத்துவது ஒரு பொதுவான பிரச்சினை.",
      "டி.என்.எஸ்ஸைப் புரிந்துகொள்வதற்கான தடைகள் தீர்க்கப்பட வேண்டும்.",
      "டி.என்.எஸ் கற்றலை மேம்படுத்த சிறந்த ஆவணங்கள் மற்றும் கருவிகள் தேவை.",
      "கோர் FOSS (இலவச மற்றும் திறந்த மூல மென்பொருள்) கருவிகளின் பயனர் இடைமுகத்தை மேம்படுத்துவது விவாதிக்கப்படுகிறது.",
      "டி.என்.எஸ் கேள்விகளில் அரைக்காலன்களைப் பயன்படுத்துவது ஒரு விவாதப் பொருளாகும்.",
      "டி.என்.எஸ் கற்றுக்கொள்வதற்கான எளிமை கேள்விக்குள்ளாக்கப்படுகிறது.",
      "டி.என்.எஸ் கற்றலில் உள்கட்டமைப்பைப் புரிந்துகொள்வது முக்கியமானதாகக் கருதப்படுகிறது.",
      "இளம் டெவலப்பர்களிடையே தொழில்நுட்ப திறன்கள் குறைந்து வருவது கவலை அளிக்கிறது.",
      "DNS நெறிமுறைகள் மற்றும் மண்டல கோப்புகள் விவாதிக்கப்படுகின்றன.",
      "மாற்று டிஎன்எஸ் மென்பொருள் விருப்பங்கள் குறிப்பிடப்பட்டுள்ளன.",
      "டி.என்.எஸ் சரிசெய்தலுடன் குறிப்பிட்ட அனுபவங்கள் பகிர்ந்து கொள்ளப்படுகின்றன.",
      "டி.என்.எஸ் பல்வேறு நோக்கங்களுக்காகப் பயன்படுத்தப்படுகிறது."
    ],
    "points": 409,
    "commentCount": 219,
    "retryCount": 0,
    "time": 1690562031
  },
  {
    "id": 36910146,
    "title": "\"வலை சுற்றுச்சூழல் ஒருமைப்பாடு\" என்பது இலவச இணையத்தின் மீதான தாக்குதல்",
    "originLink": "https://www.fsf.org/blogs/community/web-environment-integrity-is-an-all-out-attack-on-the-free-internet",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36910146",
    "commentBody": "",
    "originSummary": [
      "கூகிளின் \"வலை சுற்றுச்சூழல் ஒருமைப்பாடு\" (WEI) கொள்கை கட்டுரையில் விவாதிக்கப்படுகிறது.",
      "இந்த கொள்கை டெவலப்பர்கள் சில உலாவி உள்ளமைவுகளை அங்கீகரிக்க அல்லது மறுக்க அனுமதிக்கிறது, இது இலவச உலாவிகள் அல்லது இயக்க முறைமைகளின் பயனர்களுக்கு வலைத்தளங்களுக்கான அணுகலைக் கட்டுப்படுத்துகிறது.",
      "இணைய அணுகலைக் கட்டுப்படுத்துவதற்கும் கட்டுப்படுத்துவதற்கும் அரசாங்கங்கள் மற்றும் பெருநிறுவனங்களால் WEI பயன்படுத்தப்படலாம் என்று கட்டுரை கூறுகிறது.",
      "கட்டற்ற மென்பொருள் அறக்கட்டளை இந்த கொள்கையை மறுபரிசீலனை செய்யுமாறு கூகிளை வலியுறுத்துகிறது மற்றும் இலவச மற்றும் திறந்த இணையத்தின் முக்கியத்துவத்தை வலியுறுத்துகிறது."
    ],
    "commentSummary": [
      "கூகுளின் \"வலை சுற்றுச்சூழல் ஒருமைப்பாடு\" (டபிள்யூ.இ.ஐ) முன்மொழிவு இணைய சுதந்திரத்தில் அதன் சாத்தியமான தாக்கத்திற்காக பரிசீலனையில் உள்ளது.",
      "உலாவி பாதுகாப்பு, விளம்பரத் தடுப்பு மற்றும் வலைத்தள அணுகல் ஆகியவற்றில் கூகிளின் வளர்ந்து வரும் கட்டுப்பாடு குறித்து பயனர்கள் கவலைப்படுகிறார்கள்.",
      "கூகிளின் ரீகாப்ட்சா அமைப்பின் நோக்கம் மற்றும் கண்காணிப்பு மற்றும் தரவு சுரங்கத்திற்கான அதன் திறன் குறித்து கவலைகள் எழுப்பப்படுகின்றன.",
      "WEI மற்றும் ஆப்பிளின் தனியுரிமை அணுகல் டோக்கன்கள் (பிஏடி) இடையே ஒப்பீடுகள் செய்யப்படுகின்றன, இது கூகிளின் நடவடிக்கைகள் குறித்த சந்தேகம் மற்றும் எதிர்ப்பிற்கு வழிவகுக்கிறது.",
      "விவாதத்தில் மாற்று நெறிமுறைகள், பெரிய தொழில்நுட்ப நிறுவனங்களின் செல்வாக்கு மற்றும் பயனர் கட்டுப்பாடு மற்றும் இணைய அணுகலில் சாத்தியமான வரம்புகள் ஆகியவை அடங்கும்."
    ],
    "points": 370,
    "commentCount": 75,
    "retryCount": 0,
    "time": 1690564855
  },
  {
    "id": 36914401,
    "title": "பைத்தானுக்கு வரும் நோ-ஜிஐஎல் பயன்முறை",
    "originLink": "https://lwn.net/Articles/939568/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36914401",
    "commentBody": "",
    "originSummary": [
      "பைத்தானில் குளோபல் இன்டர்பிரட்டர் பூட்டை (ஜிஐஎல்) விருப்பமாக மாற்றும் திட்டத்தை பைத்தான் வழிகாட்டுதல் கவுன்சில் பரிசீலித்து வருகிறது.",
      "இது பைத்தானில் ஜி.ஐ.எல்-லெஸ் பயன்முறையை செயல்படுத்தும், இது இணக்கத்தை மேம்படுத்தும்.",
      "பின்தங்கிய இணக்கத்தன்மையை உறுதிப்படுத்தவும், பைத்தான் 2 மற்றும் 3 பிளவு காட்சியைத் தவிர்க்கவும் கவுன்சில் எச்சரிக்கையாக உள்ளது.",
      "அவர்கள் ஏபிஐ பொருந்தக்கூடிய தன்மைக்கான தேவைகளைப் பற்றி விவாதிக்கிறார்கள் மற்றும் பின்தங்கிய பொருந்தக்கூடிய தன்மையின் தாக்கத்தை நிவர்த்தி செய்கிறார்கள்.",
      "சில விமர்சகர்கள் சாத்தியமான பொருந்தக்கூடிய சிக்கல்கள் குறித்து கவலைகளை வெளிப்படுத்தியுள்ளனர் மற்றும் பைத்தானில் இணக்கத்தை மேம்படுத்துவதற்கான மாற்று அணுகுமுறைகளை பரிந்துரைக்கின்றனர்."
    ],
    "commentSummary": [
      "பைத்தான் நோ-ஜிஐஎல் (குளோபல் இன்டர்பிரட்டர் லாக்) பயன்முறையை அறிமுகப்படுத்துகிறது, இது lwn.net ஒரு இடுகையால் உறுதிப்படுத்தப்பட்டுள்ளது.",
      "குளோபல் இன்டர்பிரட்டர் லாக் என்பது பைத்தானில் உள்ள ஒரு பொறிமுறையாகும், இது ஒரு நேரத்தில் பைத்தான் பைட்கோடை செயல்படுத்த ஒரு நூலை மட்டுமே அனுமதிக்கிறது.",
      "நோ-ஜிஐஎல் பயன்முறை இந்த வரம்பை அகற்றுவதை நோக்கமாகக் கொண்டுள்ளது மற்றும் ஒரே நேரத்தில் பைத்தான் பைட்கோடை இயக்க பல நூல்களை அனுமதிக்கிறது.",
      "நோ-ஜிஐஎல் பயன்முறை பற்றிய தகவல்கள் முதலில் ycombinator.com பகிரப்பட்டன."
    ],
    "points": 341,
    "commentCount": 1,
    "retryCount": 0,
    "time": 1690584427
  }
]
