[
  {
    "title": "重视价值优先，电商平台探索'拼多多'模式",
    "originLink": "https://www.sohu.com/a/734436719_378279",
    "originBody": "01 消费者，看透“双11”电商大战 最近，一张关于“全球大战”的网图传遍网络： 在世界其它地区发生战争的时候，中国也掀起了一场“大战”——每年的“双11”电商大战。 中国每年都有两场消费节“大战”，上半年是618，下半年是双11，这两场“大战”每一次开启，都要涉及数亿人甚至超10亿人，前前后后一个月的话题都将围绕着它们展开。 但是近两年，你会发现消费者变得不再期待双11，甚至大量的商家也不再期待双11。 为什么会这样？ 究其原因，主要是消费者和商家已经开始“疲劳”了。 在消费者端，一是促销不再稀缺，二是优惠不再给力，三是玩法依旧复杂。 有媒体更是进行了调研，在消费者看来： 部分人随着年龄增长，对价格不再那么敏感，认为双十一不过如此，“对成年人的诱惑度没有那么高了”； 部分人认为双十一原本出发点是省钱，但现在反而成了一种负担，为了凑所谓的优惠，结果花了原本几倍的钱。 事实上，在一个物质充裕的时代，参与一场规模宏大、规则复杂、需要极长等待期和做大量功课的大促本身可能就是一件极低性价比的事。 在商家端，也同样如此。 每年双11，很多商家都是被迫参与，亏钱赚吆喝，并且有些规则太复杂，消费者搞不懂，商家也头疼，需要花大量的时间和精力去跟消费者解释。 甚至有些大品牌，参与到双十一给消费者优惠的初心是好的，但因为一些操作的失误，或者宣传上弄出了误会，反而导致一件给优惠的事遭来了消费者的差评，不但影响销量，还影响品牌。 展开全文 可以说，真就大部分人对双十一不再抱有更多的新期待了。 02 不再期待的背后，生意的逻辑，变了 无论是消费者，还是商家，他们情绪发生变化的背后，实际上是生意的逻辑变了。 首先，我们要理解，商业的本质是什么？ 是人。 做事就是做人，回归商业的本质就是做好事、服务好人，通过简单、真诚、利他，让所有参与者都能受益，而不是一个加剧内卷的“零和博弈”。 我们也能看到很多平台开始做一些新尝试： 比如淘宝、京东重新呼吁”用户为先”，反复提及价格力，而拼多多早在2019年6月上线的“百亿补贴”，这个为了618大促准备的短期性活动，此后升级为助力消费者的长期战略，截至目前已经持续了1600多天，让消费者“天天11.11”，而不是集中在某一天或某个月，成为回归消费体验，实现消费普惠的常态化动作。 其实商业世界，说复杂很复杂，说简单其实也简单，它无非由两个要素构成： 一个是供给，一个是需求。 生意的逻辑也随着这两个要素的变化而不断变化，从双十一的发展变迁，我们也能看到这种这背后的联系。 2023年是双11推出的第15年，在15年，电商行业也经历了几个阶段的变化： 1.第一阶段——2015年以前 在2010年之后，商务部长期监测的主要消费品和主要生产资料中，一半以上的产品供过于求、库存增加，生产过剩严重。 彼时的中国，工业化进程步入后期阶段，制造业对于经济发展所形成的边际效用越来越低，反而是因为过度的竞争，导致制造业企业难以形成资本累积，规模扩张困难。 但与此同时，以淘宝为主流的电商平台们，正处于早期阶段，基于产品供过于求这一情况，迎来了一定的发展契机——通过打造一个流通更快，规模不断扩张，从而使得商品成本更低的互联网电商平台，进而消纳供给过剩的产品，实现了对市场的快速渗透，迎来了高速发展。 2.第二阶段——2016年~2020年 在2015年，国家高层首次提出了“供给侧改革”理念，通过鼓励企业创新、促进淘汰落后、化解过剩产能等方式，确保高质量发展。 消费升级、供给侧改革，构成了那个年代消费型制造业发展的主流趋势，电商平台们也更愿意去服务大牌企业，一二线城市的消费者也更愿意去消费品牌商品。 以京东、天猫为首主打品牌战略的电商平台，也在这一时期迎来了高速增长阶段。 但与此同时，另一条路径也埋下了草蛇灰线——2015年，拼多多成立。 经过了多年经济发展的渗透之后，下沉市场开始成为经济增长中的重要议题，在那些品牌商品之外的海量商品有了一个广阔的去处： 县镇乡村。 3.第三阶段——2020年-至今 成熟的电商和物流体系的下沉，将过剩的白牌商品制造和开始繁荣的下沉市场对接到了一起。 一系列的白牌商品成功销到下沉市场之后，品牌方的去库存需求也被吸引入局，越来越多的消费者也意识到白牌商品超高的性价比。 而这些性价比商品不仅满足了消费者已有的需求，甚至还创造出了更多基于性价比消费的新需求。 过去的以供给侧为主的逻辑，随着时间的推移、各大电商平台的发展和经济结构的变化，逐渐转变为真正的以需求端为主的商业逻辑。 并且到了今天，能够看到，在生产端，中国已是世界第二大经济体，是世界第一生产制造大国，是世界上唯一拥有全产业链要素的国家，中国在高端消费品仍然存在产能过剩的情况。 与此同时，在消费端，中国消费升级也同样有着足够大的空间和潜能。 为什么这么说？ 喜马拉雅资本董事长李录，也即芒格家族资产的管理人，就提到，中国在未来很长一段时间里，都会处在黄金发展的机遇期。中国现在人均GDP在一万美元左右，并且人均GDP过两万的有1亿人，他们主要分布在东南沿海城市。 这部分高收入人群已经在进行着这种消费，除去这部分人群，更多普通消费者应该做但尚未做的事情，也正是中国消费的增长潜能所在。 这意味着，在生产端和消费端存在一道鸿沟。谁能对接好高端消费品与消费者需求之间的桥梁，谁就能掌握商业的主动权。 而这恰恰是第三阶段，所有电商平台需要做的事情——降低价格，加上大幅补贴，缩短好产品与消费者之间的鸿沟。 也正是在这一背景下，无论是淘宝、还是京东都开始回归价格中心，全网“拼多多”化，进入一个更具高质低价特点的电商时代。 03 全网都在“拼多多”？ 可能大家不理解，虽然说逻辑已经变了，但为什么就全网“拼多多”化，天猫、京东它们不还卖着品牌商品吗？ 事实上，此处的“拼多多”不单指“拼多多”这一电商平台，更多是指一种趋势： 消费者选择一边进行消费升级，但同时又坚持理性消费；电商平台也放低姿态，不再搞一些花里胡哨的招式，而是回归消费体验初衷、价格初心。 那么又为什么要用“拼多多”化指代这一趋势？ 因为如果你主动一点去关注，就会发现拼多多干的事情引领了这种趋势。 1.那么，拼多多到底干了什么？ 以拼多多这1600多天来一直推进的“百亿补贴”为例，就是通过不玩猫腻，把实惠直接给到消费者，来对接真实需求。 时间回到2019年6月份，当时拼多多拿出100亿现金，针对全网热度最高的10000款商品进行大幅让利。 数据显示，6月1日启动当天需求就呈现井喷态势，第一个小时销售额比之前涨幅超10倍。其中苹果系列电子产品单日销售额达2.5亿元，母婴、食品类产品销售额同比增幅超过400％，水果生鲜在内的农产品日订单量突破500万单。 也正是活动效果显著、大受销售者欢迎，拼多多决定将其变成永久性的活动，到了今天，百亿补贴在拼多多APP首页“黄金区”依然拥有自己的独立入口。 并且值得注意的是，在拼多多“百亿补贴”页面，可不是随便什么产品都能上去的，相反必须是一些大牌或正品，比如茅台、波司登、华为、苹果等才能入驻。 甚至一度因为价格力度太大，消费者群体纷纷涌入“百亿补贴”类目抢购品牌标品，拼多多更是被诸多网友称作“价格屠夫”。 为什么这么称呼？因为你看到的补贴价=品牌自主降价-拼多多补贴。 而除去“百亿补贴”，值得分析的还有拼多多，另外两个举措。 一是“拼单”模式。 传统的零售模式，商家要用很大成本去寻找消费者，加上进行市场评估、做生产计划等等，充满大量不确定性，很难有效降低产品成本。 但“拼单”模式克服了“不确定”性。比如，同样一款商品，如果500个人选择拼单，那就意味着生产的确定性，就相当于C2M反向改造供应链，商家不需要耗费大量成本去推广，也节省了品牌费用，产品价格自然会降下来，由此也会带来推广、品牌等费用的顺势下降，商家也就愿意给出更多让利。 而这就相当于建立了一个正向的“飞轮循环”——拼单越多，生产确定性就越高，产品价格就越低，消费者就越实惠。而消费者越实惠，购买意愿就越强，拼单也就越多。 二是今年首次上线的“单件立减”玩法——在补贴的基础上叠加价格直降，提供双档满减优惠。 这个无疑一下就挠到了消费者的“痒点”，省去了消费者费尽心思抢优惠券，和凑单满减的时间和精力，截至目前，首批参加“单件立减”活动的品牌商品已超20000款。 而数据证明，这一系列打法下来，效果是显著的。 根据10月26日拼多多发布的11.11大促前三天战报显示，一线城市用户订单量同比增长113%，四五线城市下单金额同比增长167%。 从具体类目来看，海鲜、羊肉、水果、运动、美妆、小家电、电动车、学习机、茶饮料、进口零食、电脑硬件、高端乐器等20个类目实现翻倍增长。 2.拼多多：从“划算”电商到“价值电商” 还特别值得思考的一点是，拼多多在人们心中的观念转变。 过去，提起拼多多，人们想到的更多是:下沉市场、五环外、小镇青年、“便宜货”…… 大部分人对其的认知，还停留在对日常生活的基础性需求的满足上，比如购买衣服、购买生活用品，等等。 但其实，我们没有注意到的是，在时间的推移下，拼多多正不断迭代进化，为消费者提供“极致价格力+货品力”具备的产品，从过去的“划算电商”转变为“价值电商”。 如果说最初的拼多多是一颗种植在“五环外”超十亿人上的种子，不断扎根、成长、摸索； 那么到了今天，拼多多已逐渐走向成熟、开始开花结果，并反哺整个“五环外”群体，甚至所有的消费用户。 比如，拼多多从今年二季度起就率先与邮政等快递企业合作，开通了新疆包裹中转集运包邮业务，让新疆消费者不再因为过于偏僻，导致还得额外掏运费。 同样，以拼多多“助农”为例，过去，拼多多就是电商助农、电商扶贫的先行者，而到了双十一，这份助力也没有打丝毫折扣，在拼多多平台上面，农产品和其它工业品、电子消费品同样享有双十一前排资源位。 并且，除了从平台层面对接供求之外，拼多多还通过自己的数据，用科技、数字化的手段推动上游农业的高效管理和资源配置的优化提升，还举办了“多多农研科技大赛”等，从赋能三农和生态共赢的高度，去解决困扰中国农业农村发展的千年困局。 而这些卓绝的努力，也超越了单一的商业行为，是一个商业平台责任感与使命感逐步提升，深入探索商业价值边界之外的社会价值的过程。 就像一位网友评论到：“很多人，他们可能起初嘲讽拼多多、质疑拼多多，结果到现在，他们开始理解拼多多，最后又成为拼多多。”这样一个心态的转变颇值得细细品味。 04 结语：商业终局，回归简单 事实上，所有的商业衍化，到最后，都不是走向复杂，而是变得简单。 拿Costco、沃尔玛的山姆超市来说，其推行会员制，构建以品类为核心、以消费者洞察为驱动；打造供应链一体化，去掉中间商赚差价，将全球优质产品直接送到消费者手上。 不管是做企业，还是做商业，和做人是一个道理，少一点套路，多一些真诚。多在因上努力，缘上创造，果上反省。 就像先前提到的拼多多，还有其它电商平台的双十一玩法也不断做“减法”，都是从复杂走向简单。 而回归“简单”的背后，恰恰是回归商业的本质，回归性价比与用户体验这一初心。 就像《教父》所说：“一秒钟内看透本质的人，和花半辈子也看不清一件事本质的人，命运必然截然不同。” 只有回归“简单”，才能更好地看清本质，从而理解这个有着十四万万人口的复杂中国； 也只有回归“简单”，才能在复杂中抽丝剥茧，从而让这个让十四万万人口的复杂中国变得更好。 排版微澜 编辑正风 轮值主编夏昆返回搜狐，查看更多 责任编辑：",
    "originSummary": [
      "过去两年来，由于疲劳和缺乏强大的优惠和简易购买流程，消费者和卖家对中国的“双11”在线购物活动兴趣下滑。",
      "这也反映出业务逻辑的转变，消费者和卖家都更重视价值而不是价格。",
      "电商平台如阿里巴巴的淘宝和京东正在强调“以买家为主”的原则。"
    ],
    "commentBody": "",
    "commentSummary": [
      "近两年中国的\"双11\"网购活动在消费者和商家中的兴趣在下降，原因是感到疲劳，缺乏有利的购买过程和优惠政策。",
      "这反映了商业逻辑的转变，消费者和商家都开始将价值放在价格上。",
      "例如，阿里巴巴的淘宝和京东等电商平台正在强调'以买家为先'的原则。"
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699363348633
  },
  {
    "title": "拼多多年销售农产品增长110%，新中产与年轻人偏爱高端厨用油和家居产品",
    "originLink": "http://www.gd.chinanews.com.cn/2023/2023-11-07/431465.shtml",
    "originBody": "广 东 中 新 百 度 搜 索 首页 广东时政 科技广东 文化教育 社会粤象 港澳台 侨乡来风 汽车生活 图片频道 中新专区 高官 广东经济 岭南人物 岭南文化 CNSTV 直播 广府观澜 潮汕听涛 客家语浓 创新广东 本页位置：广东新闻网 > 正文 拼多多11.11持续走热，年轻人最爱囤国货，中老年人热购国潮黄金 http://www.gd.chinanews.com 2023年11月07日 17:30 来源：中新网广东 　　据悉，拼多多平台今年大促启动后，平台海鲜、水产、羊肉、水果等农产品的销量同比增长了110%，成为无数中小商家实现突破的关键节点，阳澄湖大闸蟹、漳州葡萄柚、宁夏羊肉、丹东板栗、云南褚橙、涌泉蜜橘、洛川苹果等应季农产品借此由田间地头直达消费者餐桌。 ▲大促开启后，入驻拼多多百亿补贴的农货、国货商家同比增长了2倍以上。文万周|摄 　　大促期间，拼多多百亿补贴用户规模突破6.2亿，一线城市用户订单量同比增长113%，四五线城市下单金额同比增长167%，新中产的消费观念更加看重性价比，买走了更多的水果、猫粮和轻奢产品，三线以下城市的用户买走了更多的高端食用油、婴儿手口湿巾、新锐国货、国际大牌等升级产品，悄然完成了消费升级。 　　莲花单品卖出12万包，高端食用油销量劲增 　　据介绍，莲花味精成为了在拼多多的又一个爆火出圈的国货品牌，店铺的销量随之翻了一倍，并一直持续至大促。大促至今，莲花味精的爆款单品已经累计卖出了12万包。 　　今年大促期间，鲁花花生油、菜籽油等多个品类都登上平台畅销榜第一名，品牌自营旗舰店实现超300%的增长。其中，鲁花5S压榨高油酸花生油等高端产品销量增长了近4倍。 　　从拼多多全站数据来看，鲁花、金龙鱼、福临门等食用油品牌的高端产品均增速明显，多个单品爆款的销售额在大促前三天就突破了200万。 ▲大促期间，德佑湿巾热销三四线城市。欧阳荟|摄 　　在洗护、清洁和家居等日用品领域，消费者的需求也不断升级。以德佑湿巾为例，自2017年底入驻平台以来，德佑湿巾的销量以每年300%的增速持续增长，今年大促同比增长了两倍以上，婴儿手口湿巾、湿厕纸在三四线城市的订单量增长了超过160%。 　　年轻人为父母升级老人鞋，国货运动品牌迎装备焕新潮 　　为了应对今年的11.11，国货老人鞋品牌足力健在广州电商中心搭建了40多人的客服团队，并调动了全国的物流供应链协同发货。 　　今年以来，足力健的销量开始在拼多多全面爆发。往年的一季度都是淡季，但今年2月份，足力健顺势推出“闰月鞋”，官旗实现了双倍的增长。 　　在足力健的线下门店，顾客大都是偏爱现场体验的老年人，而线上的用户则以城市白领、小镇青年等为主，很好地弥补了用户人群的短板。对于90后、95后等年轻群体来说，足力健成了给村里爸妈送礼的优质选择，一次都是买几双，复购率超过20%。 　　在让父母穿上更舒适的老人鞋后，城市中产、年轻白领和小镇青年对于自身的运动装备则愈加专业化，耐克、阿迪达斯等品牌的高端装备增长最为显著。 　　其中，国货运动品牌361度的销售额同比增长100%，旗下的碳板竞速跑鞋在四五线城市的订单量增长了5倍；彪马的订单量在95后群体中同比增长77%；安踏在新一线城市的用户人群同比增长了93%；美国运动品牌威尔胜篮球销量同比增长180%。 　　中老年人热购国潮黄金，全球好物涌入三四线城市 　　今年下半年，黄金消费的热度一直居高不下，也带动了中国黄金、中国珠宝、六桂福珠宝、潮宏基、和富隆等品牌在拼多多的销量持续攀升。 　　10月31日，国货品牌六桂福珠宝的订单量提前达到峰值，当日订单出货量超过了50000单。 　　大促期间，六桂福珠宝电商中心的备货量超过了10万件，拼多多则是其电商业务端的重点渠道之一。六桂福珠宝电商中心负责人表示，这得益于拼多多在两大消费人群的突出优势，一方面是年轻用户群体相比其他平台更年轻，带来了新增量；另一方面是中老年群体的消费力、黏性也相应更强。 　　数据显示，黄金消费在今年大促中有了新变化，年轻群体越来越看重投资属性，而中老年群体则更看重情感属性。六桂福珠宝旗下的福韵故宫、福韵敦煌等IP古法黄金系列饰品的销量同比增长了120%，中老年高净值用户的订单量增幅最为明显。 　　除了黄金珠宝，国内外一线品牌的销售表现也颇为亮眼。大促至今，波司登羽绒服同比增长超过200%，维达纸品同比增长101%，母婴高端品牌babycare同比增长167%，电动牙刷品牌usmile同比增长193%，珀莱雅品牌旗舰店单店销售额同比增长80%，国产箱包品牌90分同比增长966%，不莱玫同比增长186%，惠普笔记本电脑同比增长150%，联想笔记本电脑在学生群体的销量同比增长157%等等。 　　在拼多多全球购业务中，排名前100的品牌中有21个品牌实现同比300%以上的增长，单日销售额过百万的单品达到59个，并带动站内国际品牌及商品持续热销，迈克·高仕轻奢箱包同比增长超过200%，皇家美素佳儿同比增长480%，依视路同比增长543%，蔡司同比增长220%，戴森官旗及整体销量同比增长200%。 ▲目前，拼多多全球购业务已覆盖全国80个关税区近200个保税仓。欧阳荟|摄 　　这背后，新一线城市成为消费主力，新中产更加偏爱迈克·高仕、蔡司等国际轻奢品牌，以及波司登、不莱玫等国货品牌。在三线以下城市，国际箱包、腕表、美妆等奢侈品牌的订单快速攀升，订单占比普遍超过30%，部分单品的订单占比高达47%。 　　拼多多大促负责人表示，自成立以来，拼多多就致力于让消费者花更少的钱买到更好的东西，平台将继续发挥百亿补贴的资源优势，推动更多的国货品牌、全球好物入驻新电商，持续带来“天天真低价”的消费普惠。(完) [编辑：黄强] 分享到：31K 图片精选 图片奇趣 老照片 广州举行森林火灾应急预案 广州白云面向全国征集城市IP 1500多个IP齐聚东莞漫博会 穗启动拟上市企业“领头羊”评选 信宜警方侦破电缆被盗案 深铁公安夏季练兵正当时 深圳南山区第三届“骑手月” “广州20强及明日之星”评选启动 神秘湘西自驾游广州启动 推荐阅读 ·聚焦中国式现代化与全球城市治理 第三届新时代改革开放论坛举办 ·数字化赋能劳动教育 省内外专家齐聚佛山创生园 ·广铁2023年11月面向社会招聘20名专业人才 ·广东湛江市县反诈联动 及时保护民众“钱袋子”免受损 ·王老吉发布国际品牌标识 将加速开拓海外市场 ·“粤港澳大湾区青年创意设计(创意100)人才培训计划”在珠海开班 ·第六届新会陈皮文化节将于11月25日开幕 ·“濠江侧畔·光影之美”珠澳摄影作品展览在珠海开展 热点视频 视频推荐 英国潮流先锋品牌广州开秀 广交会助力“专精特新” 绿氢装备技术研发及制造基地 “为爱奔跑”青少年马拉松赛落幕 “小美放大展”走进北京路 广州传统老骑楼碰撞时尚艺术 共绘健康唱享敬老 冰花集市重阳节公益专场活动举行 小蛮腰上演粉色浪漫 粉红丝带公益盛典开启 2023年广东省信息通信服务职业技能竞赛圆满落幕 GNEC全球新经济大会澳门举行 业界大咖畅谈大健康产业创新之道 汕汕铁路汕头站新站房建设有序进行 社会粤象 中新调查 深圳启动“超充之城”建设 深圳燃气与西安图迹签约 惠州举办珠宝玉石文化展览会 “三棋”进中小学校 　• 粤港澳大湾区“羽”林高手齐聚江门恩平 　• 暨南大学举办海外汉学专题学术报告会 多位汉学家与会 　• 华南师范大学举行建校90周年发展大会 　• 提前谋划！广东部署2024年县镇村绿化工作 　• 16支队伍竞逐“燕口福”杯中山大学校友网球团体赛 　• 广东电信6000家“爱心翼站”全面开启公益服务 　• 全省1000多名爱好者清远参加户外体育节 　• 2023深圳光明半程马拉松鸣枪 万余跑友享受奔跑快乐 生活健康 传承东江纵队抗战精神 百位中国厨师同台竞艺 ·中外杂技马戏界交流互鉴 用杂技语言引发文化共鸣 ·广州市烧伤临床医学研究所揭牌 推进湾区内地城市烧伤救治一体化 ·“动感地带”校园篮球嘉年华羊城落幕 粤狮广工夺冠 ·2023粤港澳大湾区帆船赛(广州站)举行 ·提前谋划！广东部署2024年县镇村绿化工作 ·马斯克母亲携自传《人生由我》造访珠海 ·广州白云举行119消防宣传月启动仪式 ·东莞获授“中国藏茶之都”称号 黑榜单 红榜单 　·广州出现首例因吸食“依托咪酯”电子烟被送强制隔离戒毒案例 　·广东海洋大学原党委副书记、校长潘新祥被“双开” 　·深圳市原交通局货运管理分局局长钟庚赐被开除党籍 　·广东省监狱管理局党委书记、局长李景言被查 　·今年上半年广东查处违反中央八项规定精神问题1877起 娱乐图片 红色话剧《美湾木棉红》首演 《都市童话：被带偏的日子》广州首发 茂名乡村振兴驻镇帮镇扶村成果 深圳黄木岗交通枢纽下沉隧道通车 中国竹产业创新发展峰会 “虎门杯”国际设计大赛金奖 关于我们　| About us　|　联系我们　|　广告服务　|　供稿服务　|　法律声明　|　网站地图 本网站所刊载信息，不代表中新社和中新网观点。 刊用本网站稿件，务经书面授权。 未经授权禁止转载、摘编、复制及建立镜像，违者将依法追究法律责任。 [网上传播视听节目许可证(0106168)] [京ICP证040655号] [ 京公网安备 11000002003042号] [京ICP备05004340号-1] 总机：86-10-87826688",
    "originSummary": [
      "电商平台拼多多在一个促销活动后，农产品的年销售额增长了110%。其他受欢迎的商品包括高档食用油，婴儿湿巾，和家居用品。",
      "该平台的主要客户群体包括新兴的中产阶级消费者和年轻人，包括办公室职员和来自小城镇的人们。",
      "销售额增长的尖端品牌包括樱美内衣，维达纸巾，花花地饮具，和希望手霜。"
    ],
    "commentBody": "",
    "commentSummary": [
      "电商平台拼多多在促销活动后，农产品的年销售额增长了110%。其他受欢迎的商品包括高档食用油、婴儿湿巾和家居用品。",
      "该平台的主要客户群体包括新的中产阶级消费者和年轻人，包括办公室工作人员和来自小城镇的人们。",
      "销售额增长的知名品牌包括盈美内衣、维达纸品、花花地饮具和希望护手霜。"
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699363348633
  },
  {
    "title": "理想汽车涨超9%，斗鱼跌超5%：市场传言斗鱼CEO陈少杰失踪近三周，理想汽车或能年底前月销售量达到45000",
    "originLink": "https://www.hstong.com/news/detail/23110623033958802",
    "originBody": "简体 简体中文 繁体中文 × 首页 下载 行情 港美股资讯 关于 港美股问答 登录/注册 语言 简体中文 繁体中文 原创精选> 正文 聚焦中概理想汽车涨超9%，斗鱼跌超5% 2023-11-06 23:03 斗鱼(DOYU) 0 阿里巴巴(BABA) 0 拼多多(PDD) 0 华盛资讯11月6日消息，热门中概股多数走高，3倍做多富时中国ETF $YINN 涨超2%，2倍做多沪深中国互联网指数ETF $CWEB 涨超1%。 截至发稿，理想汽车涨超9%，小鹏汽车、陆金所涨超2%，微博、携程网涨超1%，阿里巴巴、拼多多小幅走高。斗鱼跌超5%，上周四收到传言，斗鱼CEO陈少杰被查，失联近3周，多方求证后属实。 相关资讯 斗鱼CEO陈少杰确认已失联 今日有多家媒体报道，斗鱼董事会主席兼CEO陈少杰已于近日失联，斗鱼方面也是证实了这一消息。 天风证券：理想汽车年底或有望冲刺4.5万的月销量 根据此前公布的数据显示，截至2023年9月30日，理想汽车第三季度累计交付量为10.51万辆，同比增长296.3%，全年累计交付量达24.42万辆。天风证券发表报告指出，持续看好理想汽车第四季冲刺4万辆月销，根据产能与订单情况判断，年底或有望冲刺4.5万的月销量。 风险提示: 投资涉及风险，证券价格可升亦可跌，更可变得毫无价值。投资未必一定能够赚取利润，反而可能会招致损失。过往业绩并不代表将来的表现。在作出任何投资决定之前，投资者须评估本身的财政状况、投资目标、经验、承受风险的能力及了解有关产品之性质及风险。个别投资产品的性质及风险详情，请细阅相关销售文件，以了解更多资料。倘有任何疑问，应征询独立的专业意见。 推荐文章 美股盘前丨Q3业绩大增！Alteryx盘前涨超15%，瑞银涨3% 今天 18:25 美股牛股又一只翻倍股诞生！公司获希尔顿15亿美元收购 今天 16:31 期权扫描丨Uber绩前期权成交量激增！多张异动PUT单唱空这家酒店巨头 今天 14:32 几乎人人追捧的超高收益率，却依旧不能打动巴菲特！ 今天 14:15 一图看懂搭乘中国产业链升级快车！Global X中国小巨人ETF今起认购，投资亮点一图纵览 今天 10:23 新股申购药明合联今起招股，一手入场费10403.88港元 今天 09:57 华盛早报中美关系再迎利好！万科回击看空，获深圳市国资委重磅发声力挺 今天 08:23 巴菲特也找不到好项目，旗下伯克希尔哈撒韦现金类资产“堆积如山” 11-06 19:49 风险及免责提示：以上内容仅代表作者的个人立场和观点，不代表华盛的任何立场，华盛亦无法证实上述内容的真实性、准确性和原创性。投资者在做出任何投资决定前，应结合自身情况，考虑投资产品的风险。必要时，请咨询专业投资顾问的意见。华盛不提供任何投资建议，对此亦不做任何承诺和保证。 问答大全 A B C D E F G H I J K L M N O P Q S T U V W X Y Z 0-9 关于我们 服务协议 意见反馈 在线客服 (工作日09：30 - 次日05：30) 客户端： 关注我们： © 2023 深圳市时代华盛网络科技有限公司版权所有 粤ICP备16068286号",
    "originSummary": [
      "中国概念股通常呈上升趋势，其中力合汽车的涨幅超过9%。",
      "然而，斗鱼下跌超过5%，有传闻称斗鱼的CEO陈少杰已经失踪近3周。",
      "另外，有报道表明，力合汽车可能会在年底前将月销量提高到45,000。"
    ],
    "commentBody": "",
    "commentSummary": [
      "中国概念股总体上趋势向好，其中理想汽车增长超过9%。",
      "然而，斗鱼股价下跌超过5%，有传言流传斗鱼的CEO陈少杰已经失联近3周。",
      "此外，有报道表明，理想汽车可能在年底之前将其月销量推高到45000辆。"
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699363348633
  },
  {
    "title": "雙11狂歡中，拼多多股價倚海外平台Temu取勝，與阿里、京東並駕齊驅",
    "originLink": "https://www.exmoo.com/article/227689.html",
    "originBody": "登入 搜尋 訂閱 繁體 简体 下載APP 首頁 即時新聞 今日力報 澳聞 百年偉業 國際 中國 產經 體育 娛樂 掌櫃灣區 生活 NEW 取閱點 力報重溫 澳門力報 今日力報 產經新聞 惟拼多多股價靠Temu取勝 內地雙11活動開跑 惟拼多多股價靠Temu取勝 07/11/2023 4541 收藏 分享 內地「雙11」購物節活動經已開跑，多間電商分別推出各項措施，刺激平台銷售表現。就股價方面，折扣電商拼多多(PDD.US)則明顯跑出，表現優於阿里(BABA.US)及京東(JD.US)兩大龍頭電商。 雖然拼多多亦受惠於經濟放緩下，內地消費者對折扣更為敏感的趨勢，但其股價仍更多反映，市場對其海外平台「Temu」的樂觀展望。據拼多多表示，該平台上線一周年之際，單日GMV(商品交易總額)已達至8,000萬美元，並預期今年可實現年度GMV達150億美元的目標。 Temu業務模式與另一間快時尚平台Shein相近，均採用內地生產直銷海外的方式經營，特點在於價格在歐美市場甚具競爭力，因此亦成功快速滲透市場。而Temu產品種類則更為全面，除了服裝以外亦包括其他消費性產品。 據大摩報告表示，拼多多旗下Temu的勢頭強勁，自去年9月在美國上線以來，至今業務已擴展至47個國家。其手機應用截至9月底的下載量已達2.33億次。該行指出，拼多多在擴展階段進行了大量投資，但預計Temu需要去到2026年才開始實現盈利，並成為該股新的增長動力。該行予「增持」評級，目標價140美元。 拼多多昨日盤前再走高3%至109美元水平，今年來累計升幅接近30%，大幅跑贏另外兩間內地電商同業。 Temu在海外市場取得佳績，連帶母企拼多多股價亦受到追捧。(網絡圖片) 評論 力報會員可享用評論功能 註冊 / 登錄 收藏 分享 上一篇 : 「提前還款」內地港澳大不同 下一篇 : 管理層積極目標未獲青睞 相關新聞 買得更盡興．螞蟻銀行(澳門) 推多項「雙11」優惠和金融服務 03/11/2023 19089 淘寶天貓雙11購物狂歡季啟動 澳門站推多項優惠增網購體驗 01/11/2023 31678 疑含惡意軟件 拼多多App遭谷歌下架 23/03/2023 26273 與拼多多全面開戰 京東下月擬推百億補貼活動 22/02/2023 9593 與拼多多全面開戰 京東下月擬推百億補貼活動 21/02/2023 11017 美「惡名市場」名單再點名微信淘寶 續批中國為主要假貨製造來源國 01/02/2023 77854 【雙11】交易規模與去年持平 阿里東京首度未公布成交總額 12/11/2022 34225 攜本地商戶推出線下限定店 雙11淘寶天貓中國澳門站多優惠 01/11/2022 110527 推薦新聞 超微AI業務後發追趕 市場對前景甚為樂觀 03/11/2023 18966 港鐵退出瑞典業務產生開支 大行繼續予以減持 03/11/2023 13851 普拉達首三季收入增17% 表現優於奢侈品同業 03/11/2023 13355 10月現成交高峰 升溫明顯 珠海樓市熱度有望持續 03/11/2023 9571 赴大灣區置業 港澳直貸或內地按揭需慎選 06/11/2023 9250 蘋果收入持續收縮 市場關注在華業務表現 06/11/2023 8762 珠海將增文旅商業新地標 料2025年12月全面竣工 03/11/2023 8371 珠海香洲再增一小學 須建36班 最快明年動工 03/11/2023 8047 即時新聞 明年財政年度預算案獲一般性通過 李偉農：民生福利開支總體不變 07/11/2023 543 立法會以緊急程序審議通過修改《禁毒法》 16物質納入規管 07/11/2023 2275 李芯駖首登大銀幕飾演人妻 陳湛文大展歌喉獲觀眾肯定 07/11/2023 2813 主動到警局驗毒初步呈陰性 G-Dragon帶挈限量眼鏡極速售罄 07/11/2023 4838 長者公寓申請者居於唐樓可加分 社工局：水電費單並非唯一憑證 07/11/2023 5397 海域智能監控助力打擊偷渡 海關破三偷渡案拘六人 07/11/2023 4562 App Store 及 Google Play 力報 Exmoo 微信 ID： exmoo_news 關於我們｜ 使用條款及免責聲明｜ 隱私政策｜ 廣告查詢 Copyright © 2023 exmoo.com 找不到相關內容 七日預報 微信 ID： exmoo_news ↑ × 分享到微信朋友圈 打開微信 App，掃描上方的二維碼。",
    "originSummary": [
      "\"双十一\"购物节已经开始，各大电商平台推出各种措施刺激销售。在股价上，打折在线商家拼多多超过了行业领导者阿里巴巴和京东。",
      "拼多多股价的增长反映了市场对其海外平台\"Temu\"的乐观展望。\"Temu\"的商业模式类似于快时尚平台Shein，因其在西方市场的竞争定价而迅速渗透市场。",
      "预计到2026年，\"Temu\"将开始盈利，并成为拼多多股票的新的增长驱动力。"
    ],
    "commentBody": "",
    "commentSummary": [
      "中国的\"双11\"购物节已经开始，多家电子商务平台推出各种措施刺激销售，折扣在线商家拼多多的股价超过了行业领导者阿里巴巴和京东。",
      "拼多多的股价反映了市场对其海外平台\"特木\"的乐观预期。特木上线一周年，平台已经实现了每日GMV(总商品交易)8000万美元，预计将实现年GMV150亿美元。",
      "特木的商业模式类似于快时尚平台Shein，因其在西方市场的有竞争力的定价而快速渗透市场。自去年9月推出以来，特木已将其业务扩展到47个国家，其应用程序至9月底已下载233百万次。然而，预计特木将在2026年开始盈利，并成为拼多多股票的新增长驱动力。"
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699363348633
  },
  {
    "title": "高盛公司将拼多多的目标价上调至155美元并给予'买入'评级",
    "originLink": "http://www.aastocks.com/tc/stocks/news/aafn-news/NOW.1305133/2",
    "originBody": "《大行報告》高盛上調拼多多(PDD.US)目標價至155美元 評級「買入」 關閉 AASTOCKS新聞 2023/11/07 01:53 GMT 1 1 1 沽空 股價 高盛發表報告指，拼多多(PDD.US) 將於11月底公布第三季業績，相信投資者或會將注意力轉向純利及Temu潛在虧損對其第三季業績的拖累。該行預期，集團第三季收入將勝於預期，惟Temu的虧損亦會高於市場預期。 該行表示，在基本情境下，將2024年平台總銷售額(GMV)預測由170億美元提升至340億美元，美股目標價由137美元上調至155美元，評級「買入」。(sl/da)(美股為即時串流報價； OTC市場股票除外，資料延遲最少15分鐘。) 相關內容美銀證券：迪士尼(DIS.US)旗下ESPN企業價值可達240億美元 AASTOCKS新聞 最HIT熱話(過去2小時) 1 3666 《大行報告》阿里巴巴(09988.HK)投資評級及目標價(表) AASTOCKS新聞 2 1987 據報人行持續加大推動「第二支箭」支持民營內房企業債券融資 AASTOCKS新聞 3 2019 《全日總結》恒指跌296點 內房及地產股軟 九倉置業下滑5% AASTOCKS新聞 今日大市分析 資金逐漸流入港股？科技股估值有望修復？ 4小時前 AASTOCKS.com LIMITED 版權所有，不得轉載 免責聲明",
    "originSummary": [
      "高盛已将拼多多的目标股价提高至$155，并将其评为“买入”。",
      "该金融公司预计拼多多将在11月底前公布强劲的第三季度盈利，但警告说，Temu公司可能会出现高于预期的亏损。",
      "高盛还预测，到2024年，拼多多的商品总交易额(GMV)将从170亿美元增加到340亿美元。"
    ],
    "commentBody": "",
    "commentSummary": [
      "高盛将拼多多的目标股价上调至155美元，并评定为“买入”级别。",
      "高盛预计拼多多将在11月底公布强劲的第三季度财报，但警告说，特木的损失可能高于预期。",
      "该机构还预测，到2024年，拼多多的GMV(总商品交易价值)将从170亿美元增长至340亿美元。"
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699363348633
  },
  {
    "title": "拼多多平台销售额逾一倍增长，农产品热销推动中小商户发展",
    "originLink": "https://www.sohu.com/a/734468959_120952561?scm=1102.xchannel:1435:110036.0.1.0~9010.8000.0.0.118?_f=index_businessnews_2_0&spm=smpc.home.business-news31.1.1699347603024A5oXoZw_1467",
    "originBody": "做了8年电商之后，司留留对于11.11早就习以为常，但今年有点特殊，这是他返乡创业的首个11.11。 返乡之前，司留留一直在浙江嘉兴从事电商运营，主要卖女装。去年结婚后，为了陪伴家人，司留留决定回到河南商丘老家，在拼多多上卖起了裙带菜。 从卖女装到卖农货，商品运营的思路不同，供应链模式更是大相径庭，对于司留留这种电商老兵来说也并不容易，连续尝试了几款农产品之后，最终把主营的品类锁定在裙带菜。 裙带菜是干货，价格适中，不易损耗，非常适合创业初期用来练手。但就是这款用来试错的单品，让他很快站稳了脚跟。参与了几次秒杀活动后，裙带菜的日销量很快突破了8000单，大促期间更是达到了两三万单。 “刚开店的时候，最好的打算是每天卖个几百单，能维持生活就好了。”司留留说，现在的销量完全不敢想，接下来打算再扩几个品，多做一些尝试。 ▲大促开启后，入驻拼多多百亿补贴的农货、国货商家同比增长了2倍以上。文万周|摄 在拼多多平台，像司留留这样的小商家还有很多。今年大促启动后，平台海鲜、水产、羊肉、水果等农产品的销量同比增长了110%，成为无数中小商家实现突破的关键节点，阳澄湖大闸蟹、漳州葡萄柚、宁夏羊肉、丹东板栗、云南褚橙、涌泉蜜橘、洛川苹果等应季农产品借此由田间地头直达消费者餐桌。 各地农货加速进城的同时，国货品牌以及全球好物也加速涌进千家万户。数据显示，大促期间，拼多多百亿补贴用户规模突破6.2亿，一线城市用户订单量同比增长113%，四五线城市下单金额同比增长167%，新中产的消费观念更加看重性价比，买走了更多的水果、猫粮和轻奢产品，三线以下城市的用户买走了更多的高端食用油、婴儿手口湿巾、新锐国货、国际大牌等升级产品，悄然完成了消费升级。 莲花单品卖出12万包，高端食用油销量劲增 与司留留相比，胡广升的11.11要来得更早一点。 作为莲花味精的拼多多官旗运营负责人，胡广升的忙碌是从9月份开始的。彼时，莲花味精成为又一个爆火出圈的国货品牌，店铺的销量随之翻了一倍，并一直持续至大促。大促至今，莲花味精的爆款单品已经累计卖出了12万包。 展开全文 这对于去年才成立电商中心的莲花团队挑战不小，胡广升时刻都在关注仓库的备货、发货情况，以便及时调整店铺大促的节奏。 “今年的大促，消费者更加关注调味品的健康升级，莲花松茸鲜、蘑菇鲜等中高端调味料同比增长了一倍以上。”胡广升说。 ▲大促至今，莲花味精的爆款单品已经累计卖出了12万包。(受访者供图) 在山东莱阳,鲁花食用油的拼多多运营负责人王彦军也关注到了这一趋势。 今年大促期间，鲁花花生油、菜籽油等多个品类都登上平台畅销榜第一名，品牌自营旗舰店实现超300%的增长。其中，鲁花5S压榨高油酸花生油等高端产品销量增长了近4倍。 为了筹备拼多多11.11，鲁花在山东莱阳、定陶和湖北襄阳等地的生产工厂早在10月初就启动了备货计划，并做了很多前置工作。爆款产品、专供产品的打包工作在大促开始前就完成了50%。据介绍，鲁花食用油的电商订单都是通过全国各地的工厂分仓直接发出，发货时效普遍维持在12个小时以内。 “从消费趋势来看，用户吃得更健康了，更加关注食用油的油酸含量。”王彦军表示，在高端食用油消费中，四五线城市的银发人群订单量增幅最大，一二线城市消费者对鲁花的橄榄油、亚麻籽油等小众健康品类油的需求也在持续增长。 从拼多多全站数据来看，鲁花、金龙鱼、福临门等食用油品牌的高端产品均增速明显，多个单品爆款的销售额在大促前三天就突破了200万。 “大促期间，鲁花在拼多多投入的资源比重非常高，也超前实现了花生油、菜籽油的业务目标。”王彦军说，鲁花对平台的预期不仅仅是当下的GMV，也有更长远的规划，将针对平台的消费人群继续深化新品、高端产品的开发和布局。 除了食用油，平台的减脂代餐、坚果轻食等健康食品也十分畅销，洽洽坚果在一二线城市的订单量同比增长翻倍，莜面食品、轻食鸡胸肉等品类同比增长了七成，云南水果玉米、东北糯玉米等代餐类食品也分别增长了500%和200%，果蔬汁、保健品、益生菌、进口零食以及燕窝人参等滋补品牌均实现同比100%以上的增长。 ▲大促期间，德佑湿巾热销三四线城市。欧阳荟|摄 在洗护、清洁和家居等日用品领域，消费者的需求也不断升级。以德佑湿巾为例，自2017年底入驻平台以来，德佑湿巾的销量以每年300%的增速持续增长，今年大促同比增长了两倍以上，婴儿手口湿巾、湿厕纸在三四线城市的订单量增长了超过160%。 年轻人为父母升级老人鞋，国货运动品牌迎装备焕新潮 为了应对今年的11.11，国货老人鞋品牌足力健在广州电商中心搭建了40多人的客服团队，并调动了全国的物流供应链协同发货。 2019年底，足力健入驻拼多多，次年开始正式运营。开店之初，足力健的策略原本也是往低价的方向走，但很快发现不对。 “在拆解官旗的消费人群后，我们发现拼多多的用户并非只在意价格，也更关注产品的价值，非常愿意为体验买单。”足力健官旗负责人彭姗介绍，足力健很快调整了策略，先后上线了多个客单价在399元、299元的专供款，效果很不错。 今年以来，足力健的销量开始在拼多多全面爆发。往年的一季度都是淡季，但今年2月份，足力健顺势推出“闰月鞋”，官旗实现了双倍的增长，这让彭姗对11.11有了更高的期待。 ▲大促开启后，足力健的仓库每天都在开足马力。文万周|摄 早在5月份，足力健就为大促提前筹备了两款秋季专供款、两款冬季专供款等。其中，冬季雪地靴采用的是澳洲绵羊毛，保暖性能好，客单价都在299元以上，仅9月份的单品销售就已突破100万元，并一直热销至大促，始终是官旗销量的前两名。 在足力健的线下门店，顾客大都是偏爱现场体验的老年人，而线上的用户则以城市白领、小镇青年等为主，很好地弥补了用户人群的短板。对于90后、95后等年轻群体来说，足力健成了给村里爸妈送礼的优质选择，一次都是买几双，复购率超过20%。 “截至9月底，我们就已经完成了去年一整年的业绩，而旺季才刚刚开始，今年的销售额预计将突破一个亿，这距离足力健开店不过仅仅三年的时间。”彭姗说。 在让父母穿上更舒适的老人鞋后，城市中产、年轻白领和小镇青年对于自身的运动装备则愈加专业化，耐克、阿迪达斯、安德玛、彪马、李宁、安踏、特步、匹克、361度、鸿星尔克等品牌的高端装备增长最为显著。 其中，国货运动品牌361度的销售额同比增长100%，旗下的碳板竞速跑鞋在四五线城市的订单量增长了5倍；彪马的订单量在95后群体中同比增长77%；安踏在新一线城市的用户人群同比增长了93%；美国运动品牌威尔胜篮球销量同比增长180%。 ▲国货运动品牌361度电商团队正在奋战11.11。(受访者供图) “今年以来，运动装备升级正在从一二线城市向三四线城市转移，尤其专业跑鞋的需求量大增。”361度品牌电商相关负责人表示，此次大促期间，361度专门升级了物流和售后服务系统，并增设了独立退货仓，采用正、逆向分流的方式，加速售后处理时效，致力于带给拼多多用户良好、舒适的购物体验。 中老年人热购国潮黄金，全球好物涌入三四线城市 今年下半年，黄金消费的热度一直居高不下，也带动了中国黄金、中国珠宝、六桂福珠宝、潮宏基、和富隆等品牌在拼多多的销量持续攀升。 10月31日，国货品牌六桂福珠宝的订单量提前达到峰值，当日订单出货量超过了50000单。为了保证消费者的购物体验，电商团队几乎忙了一个通宵，才在时效内完成了物流发货任务。 起源于东北的六桂福珠宝，最近几年的发展突飞猛进，先后在全国各地开设了上千家品牌连锁店，并在深圳成立了品牌总部。大促期间，六桂福珠宝电商中心的备货量超过了10万件，拼多多则是其电商业务端的重点渠道之一。 “截至今年10月中旬，六桂福在拼多多的销售额同比增长了450%。”六桂福珠宝电商中心负责人表示，这得益于拼多多在两大消费人群的突出优势，一方面是年轻用户群体相比其他平台更年轻，带来了新增量；另一方面是中老年群体的消费力、黏性也相应更强。 数据显示，黄金消费在今年大促中有了新变化，年轻群体越来越看重投资属性，而中老年群体则更看重情感属性。六桂福珠宝旗下的福韵故宫、福韵敦煌等IP古法黄金系列饰品的销量同比增长了120%，中老年高净值用户的订单量增幅最为明显。而在三四线城市的年轻群体中，1克的小金豆、5.2克的爱心金币、10克和20克的金条销售火热，年轻人在黄金饰品的消费决策中开始关注投资和储蓄的价值。 上述负责人表示，六桂福珠宝两年前才在平台开了第一家店，时间不长但增长迅猛，下一步集团总部会加快渠道建设，拓展店群，推出更多有竞争力、有差异化的优质产品，满足消费者送礼、婚嫁、悦己及投资等不同需求。 除了黄金珠宝，国内外一线品牌的销售表现也颇为亮眼。大促至今，波司登羽绒服同比增长超过200%，维达纸品同比增长101%，母婴高端品牌babycare同比增长167%，电动牙刷品牌usmile同比增长193%，珀莱雅品牌旗舰店单店销售额同比增长80%，国产箱包品牌90分同比增长966%，不莱玫同比增长186%，惠普笔记本电脑同比增长150%，联想笔记本电脑在学生群体的销量同比增长157%等等。 在拼多多全球购业务中，排名前100的品牌中有21个品牌实现同比300%以上的增长，单日销售额过百万的单品达到59个，并带动站内国际品牌及商品持续热销，迈克·高仕轻奢箱包同比增长超过200%，皇家美素佳儿同比增长480%，依视路同比增长543%，蔡司同比增长220%，戴森官旗及整体销量同比增长200%。 ▲目前，拼多多全球购业务已覆盖全国80个关税区近200个保税仓。欧阳荟|摄 这背后，新一线城市成为消费主力，新中产更加偏爱迈克·高仕、蔡司等国际轻奢品牌，以及波司登、不莱玫等国货品牌。在三线以下城市，国际箱包、腕表、美妆等奢侈品牌的订单快速攀升，订单占比普遍超过30%，部分单品的订单占比高达47%。 “从今年大促来看，‘不买最贵的，只买最好的’成为大家的普遍追求，很多消费者都理性地完成了消费升级。”拼多多大促负责人表示，自成立以来，拼多多就致力于让消费者花更少的钱买到更好的东西，平台将继续发挥百亿补贴的资源优势，推动更多的国货品牌、全球好物入驻新电商，持续带来“天天真低价”的消费普惠。 推广返回搜狐，查看更多 责任编辑：",
    "originSummary": [
      "经过8年的电子商务生涯，李翠俐将其业务从销售女装转向在拼多多平台上销售裙带菜。尽管进行了转型，但李的销售额很快稳定下来，最终在促销活动后每日订单量达到20,000-30,000。",
      "拼多多报告称，农产品销售年增长率超过100%，这对小型和中型商户有所益处。"
    ],
    "commentBody": "",
    "commentSummary": [
      "从女装转行到售卖裙带菜的 online 商家 Si Liuli，在 Pinduoduo 平台的销售稳定增长，每日订单在推广活动后达到20,000-30,000。",
      "Pinduoduo 平台报告农产品的年销售增长超过100%，对中小商家产生积极影响。"
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699363348633
  },
  {
    "title": "高盛预测：大多数中国互联网企业第三季度营收符合预期，净易和腾讯等表现突出",
    "originLink": "http://www.aastocks.com/tc/stocks/news/glh-news/GLH1286396L/1",
    "originBody": "高盛：大多數中國互聯網公司第三季度營收基本符合預期 關閉 格隆匯新聞 2023/11/07 02:24 GMT 3 12 7 沽空 股價 11月7日｜高盛預計，研究範圍內的大多數中國互聯網公司第三季度營收基本符合預期，網易和騰訊有上行空間。第三季度的主要潛在亮點包括電子商務廣告技術(阿里巴巴的客户管理收入，拼多多的在線營銷收入，快手的電子商務廣告和騰訊視頻賬户的廣告收入)、遊戲(網易和騰訊的國內遊戲收入)和出海(拼多多的Temu收入)。關於第四季度業績指引，市場將關注包括消費降級、拼多多和阿里巴巴出海在內的眾多主題。 新聞來源 (不包括新聞圖片): 格隆匯 免責聲明 : 以上資訊僅供參考。AASTOCKS.com Limited對以上資訊的內容不承擔任何責任，對其準確性，完整性，品質，及時性，或可靠性不作任何陳述或予以認可，並明確表示不對任何由本資訊的全部或部分內容引致之損失或損害承擔任何法律責任或為其引起的損失負責。以上資訊或反映了相關文章或專題作者的的個人意見和觀點，並不代表AASTOCKS.com Limited的立場。以上資訊的任何內容均不構成AASTOCKS為任何投資作出招攬、提出要約、意見或推薦，或對任何證劵或投資的收益或是否合適提供法律、稅務、會計、或投資意見或服務。投資者必須按其本身投資目標及財務狀況自行作出投資決定。 最HIT熱話(過去2小時) 1 3666 《大行報告》阿里巴巴(09988.HK)投資評級及目標價(表) AASTOCKS新聞 2 1987 據報人行持續加大推動「第二支箭」支持民營內房企業債券融資 AASTOCKS新聞 3 2019 《全日總結》恒指跌296點 內房及地產股軟 九倉置業下滑5% AASTOCKS新聞 今日大市分析 港股三連升後 半日回吐近300點 7小時前 AASTOCKS.com LIMITED 版權所有，不得轉載 免責聲明",
    "originSummary": [
      "高盛预测，大多数中国互联网公司都实现了第三季度的预期收入。表现突出的公司包括网易和腾讯，这些公司都有增长的潜力。",
      "在第三季度的重要亮点包括电子商务广告技术、游戏收入(如网易和腾讯的收入)以及海外扩张(如拼多多的特木收入)。",
      "预计第四季度，市场将关注包括消费降级在内的各种主题，以及拼多多和阿里巴巴的海外扩张。"
    ],
    "commentBody": "",
    "commentSummary": [
      "高盛预计，大多数中国互联网公司在第三季度实现了预期收入。表现突出的包括具有增长潜力的网易和腾讯。",
      "第三季度的关键亮点包括电商广告技术，游戏收入(如网易和腾讯)和海外扩张(如拼多多的特emu收入)。",
      "对于第四季度，市场预计将关注包括消费者降级，以及拼多多和阿里巴巴的海外扩张等各种主题。"
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699363348633
  },
  {
    "title": "拼多多500元现金大转盘活动揭秘",
    "originLink": "https://www.flyxg.com/yldt/202311/3698396.html",
    "originBody": "拼多多现金大转盘500元(拼多多现金大转盘500) 日期：2023-11-07 04:25:23 编辑：顾琳雪 导读 大家好,小体来为大家解答以上问题。拼多多现金大转盘500元，拼多多现金大转盘500这个很多人还不知道,现在让我们一起来看看吧！1、里面很多... 大家好,小体来为大家解答以上问题。拼多多现金大转盘500元，拼多多现金大转盘500这个很多人还不知道,现在让我们一起来看看吧！ 1、里面很多抽奖、买满多少返现之类的。 2、都是套路。 以上就是【拼多多现金大转盘500元，拼多多现金大转盘500】相关内容。 免责声明：本文由用户上传，如有侵权请联系删除！ 标签： 上一篇:路由器连接不上网络(路由器连接不上) 下一篇:最后一页 猜你喜欢 pp浏览器下载教程(pp浏览器下载) 苏联为何解体(苏联易购) rockstar games social club怎么注册(rockstar games social club) 河南省体育馆官网(河南省体育馆) 华平视频会议app(华平视频会议) 唐山租房网底商出租(唐山租房网) 最新文章 拼多多现金大转盘500元(拼多多现金大转盘500) 黄智勇希望能够在下周掀战的羽球超级500赛中闯进8强 伤感密码6个字(伤感密码6位数字) 淮北市烈山区城市管理行政执法局(关于淮北市烈山区城市管理行政执 se94se 诛仙奋斗任务怎么做(诛仙奋斗任务) 淮北市烈山区淮选学校少年宫(关于淮北市烈山区淮选学校少年宫的简 迷惘的青春小说(迷惘的反义词) 白百何的一指禅是什么意思？ vtion v33(vtion) 2016年6月30日农历(2016年6月30日) 淮北市相山区地方金融监督管理局(关于淮北市相山区地方金融监督管 路由器连接不上网络(路由器连接不上) 无锡松下冷机小时工活好干吗(无锡松下冷机) 淮北市矿业集团水泥有限责任公司(关于淮北市矿业集团水泥有限责任 怪物猎人rise雷神龙的龙玉(rise龙玉怎么出)",
    "originSummary": [
      "该文章讨论了许多人还不知道的拼多多现金大轮500元的功能。",
      "此功能涉及很多抽奖，消费一定金额后可以返现。",
      "然而，作者认为这都是噱头。"
    ],
    "commentBody": "",
    "commentSummary": [
      "文章讨论了许多人还不知道的拼多多现金大轮500元的功能。",
      "这个功能包括大量的抽奖和花费一定金额后的返现活动。",
      "然而，作者认为这些都是噱头。文章是用户上传的，主站对可能的版权侵权不承担任何责任。"
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699363348633
  },
  {
    "title": "拼多多概念股板块11月6日上涨3.3%，主力资金净流入达8.48亿元",
    "originLink": "https://www.sohu.com/a/734308176_115377?scm=1102.xchannel:1437:110036.0.1.0~9010.8000.0.5.73?_f=index_businessnews_3_3&spm=smpc.home.business-news41.4.1699308003034A5oXoZw_1467",
    "originBody": "证券之星消息，11月6日拼多多概念股板块较上一交易日上涨3.3%，引力传媒领涨。当日上证指数报收于3058.41，上涨0.91%。深证成指报收于10071.56，上涨2.21%。拼多多概念股板块个股涨跌见下表： 从资金流向上来看，当日拼多多概念股板块主力资金净流入8485.87万元，游资资金净流出5792.62万元，散户资金净流出2693.25万元。拼多多概念股板块个股资金流向见下表： 北向资金方面，当日拼多多概念股板块北向资金持股市值为4.73亿元，增持0.33亿元。其中增持最多的是值得买，增持了0.16亿元。减持持最多的是天音控股，减持了179.21万元。拼多多概念股板块北向资金持股变动明细见下表： 以上内容由证券之星根据公开信息整理，由算法生成，与本站立场无关。证券之星力求但不保证该信息(包括但不限于文字、视频、音频、数据及图表)全部或者部分内容的的准确性、完整性、有效性、及时性等，如存在问题请联系我们。本文为数据整理，不对您构成任何投资建议，投资有风险，请谨慎决策。 〖 证星概念日报 〗 本文不构成投资建议，股市有风险，投资需谨慎。返回搜狐，查看更多 责任编辑：",
    "originSummary": [
      "11月6日，拼多多概念股板块比前一个交易日上涨了3.3%，领涨的是Graviti Media。",
      "上海综合指数收盘为3058.41，上涨0.91%，深圳成分指数收盘为10071.56，上涨2.21%.",
      "拼多多概念股板块的主力资金当天记录了8.4858亿元的流入，北向持股价值4.73亿元，增加了3300万元。最多增加的是Judgemall，增加了1600万元。"
    ],
    "commentBody": "",
    "commentSummary": [
      "11月6日，拼多多概念股板块较前个交易日上涨3.3%，Graviti媒体领涨。",
      "上海综合指数收于3058.41，上涨0.91%，深圳成份指数收于10071.56，上涨2.21%。",
      "拼多多概念股板块当日主力资金流入达8.4858亿元，北向持股价值4.73亿元，增加3,300万元，其中最大的增持股票是Judgemall。"
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699363348633
  }
]
