[
  {
    "id": 38544729,
    "title": "A Google Gemini AI: A multimodális modell, amely újradefiniálja a teljesítményt és átalakítja a bemenetet kimenetté",
    "originLink": "https://deepmind.google/technologies/gemini/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38544729",
    "commentBody": "",
    "originSummary": [
      "A Gemini a Google által kifejlesztett mesterséges intelligencia modell, amely különböző médiaformátumokban, többek között szövegben, képekben, videóban, hangban és kódban is képes érvelni.",
      "A nyelvi megértési feladatokban felülmúlja a korábbi modelleket és még az emberi szakértőket is, és kiemelkedik az olvasásértés, a józan gondolkodás, a matematikai problémamegoldás, a kódgenerálás és a dokumentummegértés terén.",
      "A Gemini háromféle méretben - Ultra, Pro és Nano - kapható, amelyek különböző feladatokra és igényekre szabottak, és bármilyen típusú bemenetet bármilyen típusú kimenetté alakíthatnak.",
      "A Google a Geminit a biztosítékok és az inkluzivitás szem előtt tartásával építette, és az alkalmazásokba való integráció a Google AI Studio és a Google Cloud Vertex AI alkalmazásban lesz elérhető."
    ],
    "commentSummary": [
      "A vita a Google Gemini AI, az OpenAI ChatGPT, az EU szabályozása (például a GDPR és a digitális piaci törvény), a nyelvi modellek képességei és korlátai, valamint a félretájékoztatással és az online keresés megbízhatóságával kapcsolatos aggályok körül forog.",
      "A felhasználók megoszlanak a vélemények e modellek és szabályozások hatékonyságáról és elérhetőségéről, egyesek dicsérik előnyeiket, mások pedig aggodalmukat fejezik ki korlátaik és lehetséges negatív következményeik miatt.",
      "A Google és az OpenAI közötti verseny, a startupok előtt álló kihívások, valamint az adatvédelem és a felhasználói hozzájárulás jelentősége is hangsúlyos."
    ],
    "points": 1734,
    "commentCount": 1404,
    "retryCount": 0,
    "time": 1701875027
  },
  {
    "id": 38544746,
    "title": "A Google bemutatja a Gemini-t: a következő generációs mesterséges intelligencia modell fejlett szöveges, kódolási és multimodális feladatokhoz",
    "originLink": "https://blog.google/technology/ai/google-gemini-ai/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38544746",
    "commentBody": "",
    "originSummary": [
      "A Google kiadta a Gemini-t, a legfejlettebb mesterséges intelligenciamodelljét, amely különböző feladatokban, például szövegelemzésben, kódolásban és multimodális feladatokban is kiválóan teljesít.",
      "A Gemini felülmúlta a korábbi modelleket anélkül, hogy további szövegkiemelő rendszerekre lett volna szükség, és lenyűgöző következtetési képességeket mutatott be.",
      "Képes összetett témákat megérteni, kiváló minőségű kódot generálni, és megbízható, skálázható és hatékony. A Google kiemelten kezeli a felelős mesterséges intelligencia fejlesztését, és biztonsági értékeléseket és szakértői együttműködést hajtott végre a lehetséges kockázatok mérséklése érdekében.",
      "A Google a Gemini képességeit új nyelvekre és platformokra való kiterjesztésével tervezi továbbfejleszteni, mivel ez jelentős mérföldkő a mesterséges intelligencia kreativitásra, tudásra, tudományra és mindennapi életre gyakorolt hatásának előmozdításában."
    ],
    "commentSummary": [
      "A Gemini a Google által kifejlesztett, rendkívül fejlett mesterséges intelligenciamodell.",
      "Ez a Google legújabb áttörése a mesterséges intelligencia technológiában.",
      "A Gemini képességei és funkciói a Google által eddig létrehozott legkifinomultabb mesterséges intelligencia modelljévé teszik."
    ],
    "points": 770,
    "commentCount": 2,
    "retryCount": 0,
    "time": 1701875118
  },
  {
    "id": 38543587,
    "title": "Az Apple átláthatósági jelentést tervez a kormányzati megfigyelés kezelésére",
    "originLink": "https://www.macrumors.com/2023/12/06/apple-governments-surveil-push-notifications/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38543587",
    "commentBody": "",
    "originSummary": [
      "Ismeretlen kormányok push-értesítéseket használnak arra, hogy megfigyeljék az okostelefon-felhasználók Google és Apple szervereken tárolt adatait - jelentette ki Ron Wyden amerikai szenátor.",
      "Az Apple azt tervezi, hogy frissíti átláthatósági jelentését, miután korábban megtiltotta, hogy információkat közöljön erről a felügyeletről.",
      "A push-értesítéseken keresztül történő kormányzati megfigyelésről szóló információk forrása nem nyilvános, de úgy vélik, hogy \"az Egyesült Államokkal szövetséges demokráciákról\" van szó."
    ],
    "commentSummary": [
      "Az Apple elismerte, hogy a kormányok megfigyelési célokra használják a push-értesítéseket. Egy szenátor megkeresése arra késztette az Apple-t, hogy további információkat hozzon nyilvánosságra a push-értesítések kormányzati megfigyeléséről.",
      "A push-értesítések letiltása potenciálisan meghiúsíthatja a követési kísérleteket, de vannak alternatív lehetőségek is. Ezek közé tartozik az egységesített push használata a Nextcloud szervereken, vagy más alkalmazások kihasználása a push-értesítési funkciókhoz."
    ],
    "points": 549,
    "commentCount": 7,
    "retryCount": 0,
    "time": 1701869373
  },
  {
    "id": 38542764,
    "title": "A szervermentes kiszolgálás újragondolása: A FLAME minta bevezetése a granuláris rugalmas skálázáshoz",
    "originLink": "https://fly.io/blog/rethinking-serverless-with-flame/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38542764",
    "commentBody": "",
    "originSummary": [
      "A szerző tárgyalja a szerver nélküli számítástechnika alkalmazásainak automatikus skálázásával kapcsolatos kihívásokat és hátrányokat.",
      "A FLAME mintának nevezett javasolt megoldás lehetővé teszi az alkalmazáskód egyes részeinek igény szerinti, granuláris rugalmas skálázását újraírás vagy saját futtatóprogramok használata nélkül.",
      "Az Elixir nyelven megvalósított FLAME könyvtár bármilyen felhőplatformon használható, amely rendelkezik az alkalmazáskód futtatására szolgáló API-val, így alkalmas a párhuzamossági képességekkel rendelkező nyelvekhez, és olyan funkciókat kínál, mint a pool skálázási és skálázási logika, a forró vs. hideg indítás, a távoli futó felügyelete és a telepítés frissessége."
    ],
    "commentSummary": [
      "A beszélgetés a szervermentes architektúrákkal kapcsolatos számos témát érint, beleértve a FaaS szervermentes architektúrák használatának hátrányait és a job hopping következményeit.",
      "A résztvevők megvitatják a különböző felhőplatformok használatának előnyeit és kihívásait, valamint a FLAME keretrendszer előnyeit.",
      "A beszélgetés kitér a konténerek és monolitok használatára, a felügyelet és a megfigyelhetőség fontosságára, valamint a méretezés és az erőforrás-kezelés szempontjaira is."
    ],
    "points": 359,
    "commentCount": 136,
    "retryCount": 0,
    "time": 1701864219
  },
  {
    "id": 38543196,
    "title": "A PlayStation digitális tulajdonjogi dilemmája",
    "originLink": "https://www.theverge.com/2023/12/5/23989290/playstation-digital-ownership-sucks",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38543196",
    "commentBody": "",
    "originSummary": [
      "A Sony közelmúltbeli tartalomeltávolításai és a PlayStation-fiókok letiltása jól mutatja a digitális tulajdonjog sebezhetőségét.",
      "A felhasználók a licencmegállapodások miatt elvesztették a hozzáférést a megvásárolt Discovery-tartalmakhoz, egyesek pedig váratlanul letiltották PlayStation Network-fiókjukat, ami a digitálisan megvásárolt játékok elvesztését eredményezte.",
      "A Sony helyreállította az érintett felhasználók fiókhoz való hozzáférését, de nem adott magyarázatot vagy biztosítékot a jövőbeli tiltások ellen. Ezek az incidensek a digitális tulajdonjog törékenységét hangsúlyozzák, ami arra készteti a felhasználókat, hogy fontolóra vegyék a játékok és a média fizikai példányainak megvásárlását."
    ],
    "commentSummary": [
      "A Playstation rávilágít a digitális tulajdonlás hátrányaira, különösen a lízing vagy a licencelés tekintetében.",
      "A szerző azt állítja, hogy a fő probléma a hamis reklámozásban rejlik, mivel a felhasználókat félrevezetik, és azt hiszik, hogy a Playstationen vásárolnak valaminek a másolatát, miközben valójában a hozzáférés licencjogát szerzik meg.",
      "Ez aggályokat vet fel a fogyasztói elvárásokkal és a digitális tulajdonjog átláthatóságával kapcsolatban a platformon."
    ],
    "points": 330,
    "commentCount": 3,
    "retryCount": 0,
    "time": 1701867260
  },
  {
    "id": 38542330,
    "title": "Az afrikai Python-közösség által a PSF-hez intézett aggodalmak a DjangoCon Africa támogatásának késedelmével kapcsolatban, ami pénzügyi feszültséghez és negatív megítéléshez vezet. Felhívás a támogatások elosztásának egyértelműségére, inkluzivitására és felülvizsgálatára.",
    "originLink": "https://pythonafrica.blogspot.com/2023/12/an-open-letter-to-python-software_5.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38542330",
    "commentBody": "",
    "originSummary": [
      "A pánafrikai Python közösség aggodalmát fejezte ki a Python Software Foundation (PSF) felé a DjangoCon Africa támogatásának jóváhagyásával kapcsolatos késedelmek miatt.",
      "A konferencia szervezői pénzügyi kihívásokkal és negatív megítéléssel szembesültek, ami a költségvetésükre és a döntéshozatalra nézve megterhelő volt.",
      "Aggályok merültek fel a PSF válaszával, a szavazási rendszerrel és a szervezet LMBTQIA+ közösség biztonságával kapcsolatos álláspontjával kapcsolatban. A cikk egyértelműségre, befogadásra, valamint az irányelvek és az együttműködés felülvizsgálatára szólít fel."
    ],
    "commentSummary": [
      "Egy Python-konferencia szervezése miatt vita támad Tanzániában, ahol a homoszexualitás illegális, ami aggályokat vet fel az LMBTQ+ résztvevők biztonságával és befogadásával kapcsolatban.",
      "A vita a Python Software Foundation felelősségét is megkérdőjelezi a konferencia finanszírozásában és szervezésében, valamint a politikai nézetek és az emberi jogok közötti lehetséges összeütközést.",
      "Többféle nézőpontot vizsgálunk, érintve a kulturális normákat, a pluralizmust, valamint a szoftver és a politika metszéspontját."
    ],
    "points": 298,
    "commentCount": 338,
    "retryCount": 0,
    "time": 1701859555
  },
  {
    "id": 38548209,
    "title": "A Quad9 megnyerte a német bírósági pert a Sony Entertainment ellen",
    "originLink": "https://quad9.net/news/blog/quad9-turns-the-sony-case-around-in-dresden/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38548209",
    "commentBody": "",
    "originSummary": [
      "A drezdai német bíróság a Quad9 javára döntött, és kimondta, hogy a Quad9 nem felelős a szerzői jogok megsértéséért.",
      "A Sony Entertainment (Németország) több mint két évvel ezelőtt indított pert, hogy a Quad9-et arra kényszerítse, hogy ne oldjon fel több szerzői jogi jogsértéssel érintett domainnevet.",
      "A Quad9 azzal érvelt, hogy nincs kapcsolatuk a jogsértő felekkel, és hogy a Sony blokkolási kérelme hatástalan volt."
    ],
    "commentSummary": [
      "A Quad9 megnyerte a Sony elleni fellebbezést egy domain névvel kapcsolatos jogvitában, mivel a bíróság megállapította, hogy a Sony nem tett megfelelő jogi lépéseket a domain szolgáltatója ellen.",
      "Az ügy vitákhoz vezetett a szerzői jogi perek kihívásairól, a DNS-szolgáltatások fontosságáról és a PDF-szerkesztő szoftverek jobb szerkesztési eszközeinek szükségességéről.",
      "A beszélgetés rávilágít a szerzői jogvédelem fontosságára és annak elmulasztásának lehetséges következményeire is."
    ],
    "points": 293,
    "commentCount": 52,
    "retryCount": 0,
    "time": 1701889906
  },
  {
    "id": 38548130,
    "title": "Wikifunkciók: Egy új Wikimédia-projekt, amely egy globális függvénykönyvtárat hoz létre",
    "originLink": "https://wikimediafoundation.org/news/2023/12/05/introducing-wikifunctions-first-wikimedia-project-to-launch-in-a-decade-creates-new-forms-of-knowledge/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38548130",
    "commentBody": "",
    "originSummary": [
      "A Wikifunkciók egy új projekt, amelyet a Wikimédia Alapítvány fejlesztett ki azzal a céllal, hogy létrehozzon egy olyan funkciókönyvtárat, amelyhez a felhasználók világszerte hozzáférhetnek és hozzájárulhatnak.",
      "A projekt célja az önkéntesek munkájának egyszerűsítése azáltal, hogy bármilyen programozási nyelven elérhető funkciókat biztosít, és integrálja azokat a Wikipédiába és más Wikimédia-projektekbe.",
      "A Google.org, a Rockefeller Alapítvány és a Wikimédia Alapítvány támogatásával készült, és mostantól nyilvános használatra elérhető. A végső cél az, hogy megkönnyítse a különböző nyelveken átívelő tudás létrehozását, lehetővé téve a szerkesztők számára a szabad megosztást és fejlesztést világszerte."
    ],
    "commentSummary": [
      "A Wikimedia elindította a Wikifunctions projektet, amelynek célja egy kódfunkciókból álló könyvtár létrehozása különböző projektek, köztük a Wikimédia-projektek támogatására.",
      "A projekt az Absztrakt Wikipédia kezdeményezés része, és egy rugalmas rendszer létrehozására összpontosít a különböző programozási nyelvek számára.",
      "Folyamatos vita folyik a projekt lehetséges elfogultságairól, korlátairól, a visszaélésekkel kapcsolatos aggályokról és gyakorlatiasságáról, valamint a projekt lehetséges előnyeiről a befogadás és a Wikimédia képességeinek bővítése szempontjából a központosított szkriptfejlesztés révén."
    ],
    "points": 272,
    "commentCount": 128,
    "retryCount": 0,
    "time": 1701889468
  },
  {
    "id": 38551890,
    "title": "23andMe Faces Backlash a kötelező döntőbíráskodás megkövetelése miatt a TOS frissítésben",
    "originLink": "https://stackdiary.com/23andme-updates-tos-to-force-binding-arbitration/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38551890",
    "commentBody": "",
    "originSummary": [
      "A 23andMe genetikai teszteléssel foglalkozó vállalat megváltoztatja szolgáltatási feltételeit (TOS), és ahelyett, hogy a biztonsági intézkedések megerősítésére összpontosítana, a vitarendezéshez kötelező döntőbíróságot vesz igénybe.",
      "Ez a frissítés azt jelenti, hogy a felhasználóknak semleges harmadik fél választottbíró elé kell vinniük ügyeiket, akinek döntése végleges és jogilag kötelező érvényű lesz.",
      "A felhasználóknak 30 napjuk van arra, hogy lemondjanak az új feltételekről, de a változtatás kritikát váltott ki, mivel csökkenti a felhasználók jogait és védelmét a biztonság megsértése esetén."
    ],
    "commentSummary": [
      "A vita a 23andMe, egy genetikai tesztekkel foglalkozó vállalat, valamint a felhasználói jogokkal és a magánélet védelmével kapcsolatos aggályok körül forog.",
      "A témák között szerepelnek a kötelező döntőbíráskodással kapcsolatos kérdések a vállalat szolgáltatási feltételeiben, a fogyasztóvédelmi törvények fontossága és a szolgáltatási feltételek szabványosításával kapcsolatos kihívások.",
      "A beszélgetés kitér az olyan lehetséges kockázatokra is, mint a genetikai adatok megosztása, a biofegyverek lehetősége és a személyes adatok hackerekkel szembeni sebezhetősége. Hangsúlyozza, hogy a genetikai tesztelési iparágban egyértelműbb szabályozásra és védelemre van szükség."
    ],
    "points": 232,
    "commentCount": 126,
    "retryCount": 0,
    "time": 1701914046
  },
  {
    "id": 38550026,
    "title": "Az ESP32 leleplezése: nyílt forráskódú MAC réteg fejlesztése",
    "originLink": "https://zeus.ugent.be/blog/23-24/open-source-esp32-wifi-mac/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38550026",
    "commentBody": "",
    "originSummary": [
      "A szöveg rávilágít az ESP32 mikrokontroller zárt forráskódú Wi-Fi implementációjának korlátaira, és hangsúlyozza egy nyílt forráskódú alternatíva szükségességét.",
      "A szerző elmagyarázza a Wi-Fi hardver visszafejtéséhez alkalmazott megközelítést és az ehhez használt eszközöket.",
      "Az írás a Wi-Fi csomagok átvitelére vonatkozó koncepció bizonyításának fejlesztéséről ad tájékoztatást, és felvázolja a projekt jövőbeli terveit, valamint együttműködésre és pénzügyi támogatásra szólít fel."
    ],
    "commentSummary": [
      "A kínai eredetű ESP32 mikrokontroller biztonságával és ellenőrzésével kapcsolatban aggályok merültek fel, amelyek a zárt forráskódú firmware-nek és a KKP párttagok részvételének tulajdoníthatók.",
      "A felhasználók nyílt forráskódú alternatívák mellett érvelnek, és megvitatják a wi-fi és a GSM-modemek közötti biztonsági különbségeket.",
      "A cikk a témák széles skáláját vizsgálja, beleértve az online viták elterelését, a kormányzati felügyeletet, a kínai termékekkel szembeni bizalmatlanságot, a chipgyártókat, a dokumentáció hozzáférhetőségét, az eszközláncokat, az ESP32-C6 mikrokontrollert, a WiFi jelcsillapítást, a WiFi faraday-i ketreceket, az RF ketreceket, a tesztelési és hibakeresési lehetőségeket, a Python nyelven történő programozást, a webszerver létrehozását, a hálózati alkalmazásokat, a különböző programozási nyelvek használatát, a tanúsítási és átviteli teljesítménykövetelményeket, valamint az ESP32 Wi-Fi stack visszafejtését."
    ],
    "points": 228,
    "commentCount": 94,
    "retryCount": 0,
    "time": 1701899434
  },
  {
    "id": 38545022,
    "title": "A LogoFAIL támadás veszélyezteti a Windows/Linux firmware-t, de nem fedezhető fel",
    "originLink": "https://arstechnica.com/security/2023/12/just-about-every-windows-and-linux-device-vulnerable-to-new-logofail-firmware-attack/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38545022",
    "commentBody": "",
    "originSummary": [
      "A LogoFAIL támadás a Windows és Linux eszközök firmware-jét fertőzi meg és veszi át az irányítást a rendszerindítás során, így nehéz felderíteni és eltávolítani.",
      "A támadás a különböző gyártók különböző számítógép-modelleinek UEFI-rendszereiben található sebezhetőségeket használja ki, megkerülve a hagyományos végponti biztonsági intézkedéseket.",
      "A LogoFAIL manipulálja a boot logó képeket, hogy rosszindulatú kódot hajtson végre, így a támadó teljes irányítást kap az eszköz memóriája és lemeze felett. A Lenovo, Dell, HP, Intel, AMD és ARM készülékek sebezhetőek, és a biztonsági javítások kiadásra kerülnek a sebezhetőségek orvoslására."
    ],
    "commentSummary": [
      "Felfedeztek egy új, LogoFAIL nevű firmware-támadást, amely a Windows/Linux eszközöket kihasználhatóvá teszi.",
      "A támadás lényege, hogy a jogos logó képét a rendszerindítás során egy sebezhetőséget kihasználva egy rosszindulatúval helyettesítik.",
      "A LogoFAIL nehezen észlelhető, megkerüli a biztonságos rendszerindításhoz szükséges intézkedéseket, és még az operációs rendszer javítását és a sebezhetőségi vizsgálatot követően is fennmaradhat a rendszerben, felfedve a BIOS-gyártók által használt képelemző kód gyenge biztonsági intézkedéseit."
    ],
    "points": 210,
    "commentCount": 9,
    "retryCount": 0,
    "time": 1701876232
  }
]
