[
  {
    "title": "제주삼다수는 포장재 재질구조 개선을 통해 최우수기업 공모에 선정되었습니다.",
    "originLink": "https://www.dailian.co.kr/news/view/1296022",
    "originBody": "",
    "originSummary": [
      "일렉트론(Electron) 프레임워크의 13번의 마이너 업데이트와 한 번의 메이저 업데이트가 발표되었습니다.",
      "이 업데이트들로 인해 일렉트론 프레임워크 사용자들은 보안 및 안정성 개선, 성능 향상, 새로운 기능 추가 등 다양한 혜택을 누릴 수 있게 됩니다.",
      "일렉트론 프레임워크는 크로스 플랫폼 데스크탑 애플리케이션 개발 도구로, 웹 기술과 네이티브 기능을 결합하여 다양한 운영체제에서 동작하는 애플리케이션을 만들 수 있습니다."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700142034289
  },
  {
    "title": "제주삼다수, 플라스틱 사용량 감소를 위한 노력으로 포장재 개선 대회에서 최고상 수상",
    "originLink": "https://m.mk.co.kr/news/headline/view/2023/11/884124",
    "originBody": "",
    "originSummary": [
      "대한민국 최고의 생수 브랜드인 제주 삼다수가 플라스틱 사용량 저감을 위한 노력으로 2023년 포장 자재 구조 개선 경진대회 대상을 수상했습니다.",
      "환경 친화적인 포장재 개발과 경량 용기 등의 차원에서 제주 삼다수는 2570톤의 플라스틱을 절감했습니다.",
      "제주 삼다수는 향후에도 친환경 라벨 제품 생산 증가와 재활용 재료 활용을 확대하는 등 지속 가능한 경영을 추구할 예정입니다."
    ],
    "commentBody": "",
    "commentSummary": ["제공된 정보가 없습니다."],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700142034289
  },
  {
    "title": "제주개발공사, '2023 포장재 재질구조 개선 우수기업 공모전'에서 최우수상 수상",
    "originLink": "https://www.m-i.kr/news/articleView.html?idxno=1066928",
    "originBody": "",
    "originSummary": [
      "제주도개발공사가 \"2023 포장재 개선 우수 기업 대회\"에서 '무라벨' 제품의 플라스틱 사용량 확대 및 감소 노력으로 최우수상을 수상했습니다.",
      "지속적인 친환경 제품 라인업 확대 및 다양한 재활용 PET 소재 개발을 통해 지난 3년간 2570톤의 플라스틱 사용량을 줄였습니다.",
      "QR 코드 라벨 제품 제작 확장 및 환경 친화적 사업 활동을 촉진하는 계획이 있습니다."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700142034289
  },
  {
    "title": "에이치비페이퍼가 코엑스 푸드위크의 제18회 서울국제식품산업전에 참가한다.",
    "originLink": "https://news.nate.com/view/20231116n29582?mid=n1101",
    "originBody": "",
    "originSummary": [
      "RPG Maker MV 1.3.5 has been released, bringing new features and bug fixes to the popular game development software.",
      "The update includes an improved plugin management system, making it easier for developers to customize their games.",
      "The new version also brings support for the latest version of Adobe AIR, ensuring compatibility with the latest web and mobile platforms."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700142034289
  },
  {
    "title": "제주특별자치도개발공사, '2023 포장재 재질구조 개선 최우수 기업 경쟁'에서 최우수상 수상",
    "originLink": "https://mobile.newsis.com/view.html?ar_id=NISX20231116_0002523470&cID=&pID=00",
    "originBody": "",
    "originSummary": [
      "제주 특별 자치도 개발공사가 '2023년 포장재 구조 개선 우수기업 대회'에서 대상을 수상했다.",
      "기업은 환경지속성을 위한 노력을 인정받아 에코프렌드리한 포장 재료를 확대하고 경량 용기를 통한 플라스틱 사용량을 감소시키는데 참여했다.",
      "또한 기업은 지난 세 해 동안 플라스틱 사용량을 2,570톤 줄이는 것으로 자원 순환을 촉진하기 위한 노력을 기울였다. 앞으로도 기업은 QR 코드 라벨 제작 및 재생 자원 활용으로 환경 친화적인 실천을 확대할 계획이다. CEO는 기업의 지속 가능한 미래를 위한 환경 혁신 추구를 표명했다."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700142034289
  },
  {
    "title": "에이치비페이퍼, 코엑스 푸드위크 2023 참가... 친환경 종이 포장재를 소개",
    "originLink": "https://kr.aving.net/news/articleView.html?idxno=1786084",
    "originBody": "",
    "originSummary": [
      "H.B. Paper, a specialist in eco-friendly packaging materials, will participate in the Coex Food Week 2023 exhibition in Seoul.",
      "The exhibition is a large-scale international food exhibition that attracts domestic and international food companies, buyers, and consumers.",
      "H.B. Paper will showcase environmentally friendly paper-based packaging materials as alternatives to plastic, including water-based coatings, heat-sealable food paper, and sustainable packaging materials."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700142034289
  },
  {
    "title": "화학경제연구원, 친환경 포장재 개발 동향 및 리싸이클 패키징 전략에 대한 교육 행사 개최",
    "originLink": "https://www.jnnews.co.kr/news/view.php?idx=361579",
    "originBody": "",
    "originSummary": [
      "한국의 화학경제연구소에서 12월 14일부터 15일까지 환경 친화적인 포장재 및 재활용 전략에 대한 교육 행사를 개최한다.",
      "이 행사는 플라스틱을 대체할 대안 재료를 찾고 지속 가능한 포장 방법을 탐구하기 위한 목적을 가지고 있다.",
      "HP, SPC PACK 및 한솔 페이퍼와 같은 기업들이 이 행사에 발표자로 참여하며, 이는 플라스틱 폐기물 감소와 환경 문제에 대한 소비자 인식이 증가하는 글로벌 추세를 반영하고 있다."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700142034289
  }
]
