[
  {
    "id": 37313349,
    "title": "Poskytovatelé internetových služeb by neměli dohlížet na projevy online bez ohledu na to, jak jsou hrozné.",
    "originLink": "https://www.eff.org/deeplinks/2023/08/isps-should-not-police-online-speech-no-matter-how-awful-it",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37313349",
    "commentBody": "",
    "originSummary": [
      "Nadace Electronic Frontier Foundation (EFF) tvrdí, že poskytovatelé internetových služeb (ISP), zejména prvního stupně, by neměli působit jako regulátoři obsahu, protože by to mohlo vést k možnému zneužití pravomocí a cenzuře.",
      "EFF se odvolává na společnost Hurricane Electric, poskytovatele internetového připojení první úrovně, který částečně odepřel služby, aby narušil provoz kontroverzního fóra, a označuje to za precedens pro budoucí cenzurní zásahy, které mohou blokovat legální projevy.",
      "Místo toho, aby poskytovatelé internetových služeb dohlíželi na obsah, EFF prosazuje prosazování zákonů a opatření na ochranu soukromí prostřednictvím orgánů činných v trestním řízení a soudů a trvá na tom, že ochrana lidských práv by neměla záviset na tom, zda budou společnosti fungovat jako policie projevu."
    ],
    "commentSummary": [
      "Diskuse se točí kolem řady témat, včetně regulace projevů na internetu, role soukromých firem při kontrole diskurzu a vládních zásahů do regulace projevů.",
      "Rovněž byly zmíněny možné důsledky blokování přístupu na konkrétní webové stránky a přednost ochrany svobody projevu.",
      "Dalšími souvisejícími tématy jsou extremistický obsah, svoboda internetu a povinnosti poskytovatelů hostingu a internetových služeb (ISP), přičemž účastníci vyjadřují různé názory a diskutují o podstatě těchto otázek."
    ],
    "points": 941,
    "commentCount": 663,
    "retryCount": 0,
    "time": 1693340274
  },
  {
    "id": 37307708,
    "title": "Do ssh(1) přidána obfuskace časování stisků kláves",
    "originLink": "https://undeadly.org/cgi?action=article;sid=20230829051257",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37307708",
    "commentBody": "",
    "originSummary": [
      "Damien Miller zavedl do ssh(1) obfuskaci časování stisků kláves, jejímž cílem je maskovat časování mezi jednotlivými stisky kláves pravidelným odesíláním interaktivního provozu a odesíláním falešných stisků kláves.",
      "Tato nová funkce byla začleněna díky vylepšení protokolu SSH (Secure Shell) a očekává se, že bude brzy přijata do dalších systémů.",
      "Předpokládá se, že bude zahrnuta do příští verze OpenBSD, svobodného operačního systému s otevřeným zdrojovým kódem, který je známý svým důrazem na bezpečnostní funkce."
    ],
    "commentSummary": [
      "Článek zdůrazňuje různé aspekty zabezpečení hesel SSH a představuje obfuskaci časování stisku kláves jako novou strategii pro zvýšení bezpečnosti.",
      "Objasňuje různé způsoby maskování hesel a poskytování zpětné vazby uživateli, aniž by bylo ohroženo zabezpečení, a zdůrazňuje význam maskování hesel, manažerů a zastavení sdílení obrazovky během zadávání hesla.",
      "Zabývá se také alternativními metodami ověřování, jako jsou klíče SSH, omezeními některých zařízení, hostingovými službami a tématy souvisejícími se šifrováním a monitorováním sítě."
    ],
    "points": 545,
    "commentCount": 238,
    "retryCount": 0,
    "time": 1693316165
  },
  {
    "id": 37308747,
    "title": "Proč Python vyhrál?",
    "originLink": "https://news.ycombinator.com/item?id=37308747",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37308747",
    "commentBody": "",
    "originSummary": [
      "Autor začal svou cestu programování v roce 2013 s jazykem JavaScript, poté přešel k dalším jazykům, jako je Python, a nakonec se rozhodl pro jazyk Ruby.",
      "Autor si všiml změny v oblíbenosti jazyků a zjistil, že Ruby, který byl kdysi na stejné úrovni jako Python, zaznamenal pokles v používání.",
      "Autor se zajímá o příčiny tohoto trendu, který vede k menšímu používání a popularitě jazyka Ruby."
    ],
    "commentSummary": [
      "Diskuse zdůrazňuje rostoucí popularitu jazyka Python v posledním desetiletí, který předstihl jiné jazyky, jako je Ruby a Perl, především díky své atraktivitě pro akademickou obec, jednoduchosti a snadnému učení.",
      "Dalšími faktory, které přispívají k postavení jazyka Python, jsou jeho specializace, zejména v oblasti dat, a jeho pečující komunita.",
      "Kromě toho se diskutovalo o různých tématech, jako je typová kontrola, porovnávání jazyků, explicitní a implicitní chování jazyka Python a problémy se správou balíčků a závislostí, přičemž jako klíčové atributy popularity jazyka Python byla označena jeho všestrannost, bohaté knihovny a integrace napříč odvětvími."
    ],
    "points": 440,
    "commentCount": 707,
    "retryCount": 0,
    "time": 1693320500
  },
  {
    "id": 37313183,
    "title": "Griffin - Plně regulovaná banka řízená rozhraním API s jazykem Clojure",
    "originLink": "https://www.juxt.pro/blog/clojure-in-griffin/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37313183",
    "commentBody": "",
    "originSummary": [
      "Společnost Griffin je regulovaný podnik poskytující bankovní služby na bázi API a pro svou platformu používá jazyk Clojure, přičemž uvádí výhody, jako je neměnnost a auditní protokol.",
      "Jejich platforma funguje na platformě Kubernetes na AWS s databází FoundationDB. Používají model sourcingu událostí a asynchronní http handler Netty pro zpracování platebních odpovědí.",
      "Společnost klade důraz na nábor vzdálených programátorů jazyka Clojure a důsledné testování distribuovaných systémů, aby se předešlo závodním podmínkám a chybám. Pro lepší kontrolu chyb používají přístup k testování podobný generativnímu testování."
    ],
    "commentSummary": [
      "Dialog se týká použití programovacího jazyka Clojure v bankovním sektoru a rozšíření API bankovnictví ve Spojeném království.",
      "Diskutuje se také o skepsi vůči nové technologické platformě Griffin a o výhodách a nevýhodách kryptoměn.",
      "Rozhovor se zabývá významem soukromí a bezpečnosti ve finančních službách a hodnotí efektivitu typových systémů v programovacích jazycích."
    ],
    "points": 347,
    "commentCount": 156,
    "retryCount": 0,
    "time": 1693339571
  },
  {
    "id": 37315802,
    "title": "Intel ukazuje 8jádrový procesor s 528 vlákny a křemíkovou fotonikou",
    "originLink": "https://www.servethehome.com/intel-shows-8-core-528-thread-processor-with-silicon-photonics/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37315802",
    "commentBody": "",
    "originSummary": [
      "Společnost Intel na akci Hot Chips 2023 představila osmijádrový procesor s 528 vlákny, který využívá křemíkovou fotoniku. Tento procesor obsahuje přímou optickou strukturu mesh-to-mesh a je přizpůsoben pro zpracování hyperřídkých datových zátěží.",
      "Procesor je navržen s architekturou ISA (Reduced Instruction Set Computer), která optimalizuje jeho jednoduchost a energetickou účinnost.",
      "Produkt je sestaven do vícečipového pouzdra s vestavěným propojovacím můstkem EMIB (Embedded Multi-die Interconnect Bridge). Je stále ve vývoji a zatím nemá komerční název."
    ],
    "commentSummary": [
      "Společnost Intel představila nový osmijádrový procesor s 528 vlákny využívající křemíkovou fotoniku, který zvyšuje výpočetní efektivitu, podobně jako procesor Cell od společnosti Sony, ale s odlišnými konstrukčními specifikacemi.",
      "Po rozhodnutí vyvíjet vlastní čipy se Apple odklonil od procesorů Intel, aby získal větší kontrolu a konsolidoval své platformy.",
      "Probíhají diskuse o výkonnosti a bezpečnosti návrhů SMT (Simultaneous Multithreading), přičemž zvláštní pozornost je věnována technologii Zen SMT od společností Intel a AMD a tomu, zda by mohlo být nutné SMT zakázat."
    ],
    "points": 341,
    "commentCount": 130,
    "retryCount": 0,
    "time": 1693353365
  },
  {
    "id": 37307473,
    "title": "Přístupná paleta: přestat používat HSL pro barevné systémy (2021)",
    "originLink": "https://wildbit.com/blog/accessible-palette-stop-using-hsl-for-color-systems",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37307473",
    "commentBody": "",
    "originSummary": [
      "Společnost Postmark vyvinula nový nástroj Accessible Palette, který řeší nesrovnalosti v poměrech světlosti a kontrastu v předchozím systému barev.",
      "Nástroj používá barevné prostory CIELAB a LCh, které nabízejí přesnější reprezentaci toho, jak lidé vnímají barvy.",
      "Uživatelé mohou používat Accessible Palette k vytváření barevných palet s konzistentní světlostí a předvídatelným kontrastem, nicméně oblíbené návrhářské nástroje, jako je Figma, Sketch a Adobe XD, v současné době tyto barevné prostory nepodporují."
    ],
    "commentSummary": [
      "Témata se zaměřují na barevné systémy, zobrazení barev, přístupnost a designové aspekty a zdůrazňují omezení a výzvy při vytváření vizuálně přesvědčivých a přístupných návrhů.",
      "Diskutuje se o účinnosti různých barevných prostorů, algoritmů a zdrojů a o jejich souladu s pokyny pro přístupnost.",
      "Dalšími tématy jsou otázky týkající se kvality barev ve vysílání a streamovacích službách a problémy s přesným zobrazením barev v různých médiích."
    ],
    "points": 304,
    "commentCount": 101,
    "retryCount": 0,
    "time": 1693315294
  },
  {
    "id": 37311239,
    "title": "iFixit žádá vládu o právo hacknout zmrzlinový stroj McDonald's",
    "originLink": "https://www.404media.co/activists-petition-government-for-right-to-hack-mcdonalds-mcflurry-machines-to-repair-them/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37311239",
    "commentBody": "",
    "originSummary": [
      "Společnosti iFixit a Public Knowledge žádají knihovníka Kongresu, aby povolil hackování automatů McDonald's McFlurry pro účely oprav, a tvrdí, že tyto automaty jsou často nespolehlivé a povolení digitálního rozlomení zámku by usnadnilo diagnostiku a opravy.",
      "V současné době má společnost Taylor exkluzivní servisní smlouvy s franšízami společnosti McDonald's, ale navrhovaná výjimka ze zákona Digital Millennium Copyright Act (DMCA) by mohla franšízám umožnit, aby opravy prováděly samy.",
      "Tento krok přichází v souvislosti se soudním sporem mezi společností Taylor a společností Kytch, která vytvořila zařízení dekódující chybové kódy strojů, a usiluje o rozšíření výjimky pro opravy na komerční průmyslová zařízení."
    ],
    "commentSummary": [
      "Dialog se z velké části týká problémů se spolehlivostí zmrzlinových strojů společnosti McDonald's, etických důsledků v technologickém odvětví a možných finančních zisků, které stojí za exkluzivní smlouvou společnosti McDonald's s dodavatelem strojů, společností Taylor.",
      "Objevily se obavy ohledně používání některých dílů a dodavatelů, bezpečnostních rizik a zacházení s nízkopříjmovými pracovníky v restauračním průmyslu.",
      "Uživatelé vyjadřovali nespokojenost s výrobky společnosti Taylor a jejím monopolním postavením a navrhovali alternativy, například stroje od společnosti Carpigiani."
    ],
    "points": 293,
    "commentCount": 182,
    "retryCount": 0,
    "time": 1693330651
  },
  {
    "id": 37306427,
    "title": "Nová studie zjistila, že mikroplasty pronikají do všech tělesných systémů a mění chování.",
    "originLink": "https://www.sustainableplastics.com/news/microplastics-found-pass-blood-brain-barrier-even-though-ingested-drinking-water",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37306427",
    "commentBody": "",
    "originSummary": [
      "Profesor Jaime Ross z University of Rhode Island provedl studii, která ukazuje, že mikroplasty mohou pronikat do všech tělesných systémů, dokonce i do mozku, což vede ke změnám v chování savců.",
      "Výzkum na myších jako pokusných subjektech zjistil, že vystavení mikroplastům má za následek změny v chování i změny v imunitních markerech v játrech a mozkové tkáni.",
      "Studie ukazuje naléhavou potřebu dalšího výzkumu zdravotních důsledků expozice mikroplastům, zejména u savců."
    ],
    "commentSummary": [
      "Dialog se zabývá přítomností mikroplastů v lidském těle, jejich možným vlivem na zdravotní problémy, jako je obezita, snižování IQ a snižování porodnosti, a potřebou dalšího výzkumu.",
      "V rozhovoru se diskutuje o mnoha proměnných, které přispívají k obezitě, o možných řešeních a o úloze stravy. Je naznačena možná souvislost mezi plasty a obezitou. Diskuse se rozšiřuje také na dopady plastů používaných v obalech na potraviny.",
      "Debata poukazuje na dopady jednorázových plastů na životní prostředí, obtíže při jejich postupném odstraňování a význam individuálních rozhodnutí, kulturních názorů a politických a ekonomických vlivů. Je zdůrazněna naléhavost řešení škodlivých účinků mikroplastů a hledání udržitelných alternativ."
    ],
    "points": 277,
    "commentCount": 360,
    "retryCount": 0,
    "time": 1693310383
  },
  {
    "id": 37305800,
    "title": "Závažné chyby ve zpracování chyb protokolu BGP",
    "originLink": "https://blog.benjojo.co.uk/post/bgp-path-attributes-grave-error-handling",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37305800",
    "commentBody": "",
    "originSummary": [
      "V protokolu BGP (Border Gateway Protocol), který má zásadní význam pro směrování síťového provozu na internetu, byly zjištěny závažné nedostatky při zpracování chyb, které mohou způsobit narušení sítě a výpadky internetu.",
      "Autor, profesionální tester zranitelností protokolu BGP, objevil tyto problémy v systémech BGP několika dodavatelů a vyjádřil nespokojenost s jejich reakcemi na zabezpečení.",
      "Autor obhajuje potřebu větší odpovědnosti prodejců za řešení bezpečnostních problémů, například nabídkou odměn za chyby, a kritizuje neúčinnost hlášení bezpečnostních chyb přímo prodejcům a jako alternativu navrhuje oznámení zákazníkům."
    ],
    "commentSummary": [
      "Článek kritizuje chybné zpracování chyb v protokolu BGP (Border Gateway Protocol) a upozorňuje na kontroverzi výzkumníků, kteří tyto chyby objevili.",
      "Přibližuje dopad zranitelnosti log4j na zabezpečení sítě a diskutuje o odpovědnosti provozovatelů sítě a výzkumných pracovníků v oblasti bezpečnosti.",
      "Řešení chyb protokolu BGP je funkční, ale vyžaduje vylepšení v důsledku nedávné zranitelnosti, která způsobila výpadky na celém internetu."
    ],
    "points": 275,
    "commentCount": 114,
    "retryCount": 0,
    "time": 1693306291
  },
  {
    "id": 37316309,
    "title": "Fomos: Experimentální operační systém postavený na Rustu",
    "originLink": "https://github.com/Ruddle/Fomos",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37316309",
    "commentBody": "",
    "originSummary": [
      "Fomos je experimentální operační systém (OS) vytvořený s využitím Rustu, jehož cílem je zjednodušit vztah mezi aplikací a OS. Ve Fomosu je aplikace považována za pouhou funkci a s operačním systémem komunikuje prostřednictvím struktury Context.",
      "Fomos OS zahrnuje vlastnosti, jako je sandboxing, instrumentace, ladění a transparentní restartování aplikací. Pro práci se staršími verzemi aplikací vytváří operační systém nové funkce v rámci kontextu.",
      "Stále přetrvávají problémy, včetně bezpečnosti a způsobů plánování. Budoucí plány zahrnují rozšíření funkcí, jako je trvalé úložiště, podpora GPU, síťové připojení a abstraktní struktura pro komunikaci aplikací."
    ],
    "commentSummary": [
      "Diskuse se zaměřuje na Fomos, experimentální operační systém, který zpracovává aplikace jako funkce, s perspektivními aplikacemi ve vestavěných systémech a AWS (Amazon Web Services) Lambda runtime.",
      "Účastníci vyjadřují obavy ohledně bezpečnosti ve Fomosu; navrhují se možná řešení, jako je statická analýza - zkoumání programového kódu bez jeho spuštění - a časovače watchdog - systémový dozor, který provede akci, pokud něco selže.",
      "V rámci operačních systémů je diskutováno téma sandboxingu, zapouzdření programu za účelem omezení rozsahu jeho operací, a jsou zdůrazněny související problémy a výhody různých formátů spustitelných souborů."
    ],
    "points": 259,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1693357252
  }
]
