[
  {
    "id": 41949098,
    "title": "अब हम मैकडॉनल्ड्स की आइसक्रीम मशीनों को ठीक कर सकते हैं।",
    "originLink": "https://www.ifixit.com/News/102368/victory-is-sweet-we-can-now-fix-mcdonalds-ice-cream-machines",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41949098",
    "commentBody": "",
    "originSummary": [
      "यू.एस. कॉपीराइट कार्यालय ने यह निर्णय दिया है कि मैकडॉनल्ड्स की आइसक्रीम मशीनों की मरम्मत करना कानूनी है, जो राइट टू रिपेयर आंदोलन के लिए एक जीत है।- इस निर्णय से मालिकों को वाणिज्यिक खाद्य उपकरणों पर डिजिटल लॉक को बायपास करने की अनुमति मिलती है, जिससे महंगे सेवा कॉल की आवश्यकता को कम किया जा सकता है।- इस प्रगति के बावजूद, यह निर्णय मरम्मत उपकरणों के साझा करने या बेचने की अनुमति नहीं देता है, और औद्योगिक उपकरणों के लिए व्यापक छूट को अस्वीकार कर दिया गया, जो व्यापक मरम्मत अधिकारों के लिए आंदोलन में चल रही चुनौतियों को दर्शाता है।"
    ],
    "commentSummary": [
      "मैकडॉनल्ड्स की आइसक्रीम मशीनें अक्सर रखरखाव की समस्याओं और जटिल त्रुटि कोडों के कारण खराब हो जाती हैं, जिसके लिए निर्माता द्वारा अनुमोदित तकनीशियनों द्वारा महंगे मरम्मत की आवश्यकता होती है।",
      "मशीनों को स्वतंत्र रूप से मरम्मत करना जानबूझकर कठिन बनाया गया है, जिसमें डिजिटल लॉक्स DMCA द्वारा संरक्षित हैं, हालांकि हाल के कानूनी बदलावों ने मरम्मत के लिए इनका परिहार्यन की अनुमति दी है।",
      "यह स्थिति उपकरण रखरखाव पर अधिकार-से-मरम्मत कानूनों और कॉर्पोरेट नियंत्रण के संबंध में व्यापक चिंताओं को उजागर करती है।"
    ],
    "points": 982,
    "commentCount": 258,
    "retryCount": 0,
    "time": 1729886556
  },
  {
    "id": 41949297,
    "title": "जेफ बेजोस ने कमला हैरिस के समर्थन को वाशिंगटन पोस्ट से हटवा दिया।",
    "originLink": "https://www.cnbc.com/2024/10/25/jeff-bezos-killed-washington-post-endorsement-of-kamala-harris-.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41949297",
    "commentBody": "",
    "originSummary": [
      "वॉशिंगटन पोस्ट दशकों में पहली बार किसी राष्ट्रपति पद के उम्मीदवार का समर्थन नहीं करेगा, एक निर्णय जो कथित तौर पर मालिक जेफ बेजोस द्वारा प्रभावित है।",
      "यह निर्णय डेमोक्रेटिक उम्मीदवारों का समर्थन करने की अखबार की परंपरा से एक प्रस्थान को चिह्नित करता है और इसके कारण आलोचना और सदस्यता रद्द होने की घटनाएं हुई हैं।",
      "पोस्ट के प्रकाशक, विल लुईस, का दावा है कि यह कदम अखबार की स्वतंत्र जड़ों की ओर वापसी है, जो बेजोस और पूर्व राष्ट्रपति ट्रंप के बीच चल रहे तनाव के बीच हो रहा है।"
    ],
    "commentSummary": [
      "जेफ बेजोस ने कथित तौर पर द वाशिंगटन पोस्ट को कमला हैरिस का समर्थन करने से रोकने के लिए हस्तक्षेप किया, जिससे उनकी अन्य व्यावसायिक गतिविधियों, जैसे कि सरकारी अनुबंधों के कारण संभावित हितों के टकराव के बारे में चिंताएं उत्पन्न हुईं।",
      "आलोचकों का सुझाव है कि बेजोस का निर्णय राजनीतिक हस्तियों, विशेष रूप से ट्रम्प, से प्रतिक्रिया से बचने की इच्छा से प्रेरित हो सकता है, जिनका मीडिया आउटलेट्स को धमकी देने का इतिहास है।",
      "यह घटना व्यावसायिक हितों और पत्रकारिता की स्वतंत्रता के बीच चल रहे तनाव को उजागर करती है, जो अखबारों की समर्थन नीति के निष्पक्षता पर प्रभाव के बारे में सवाल उठाती है।"
    ],
    "points": 726,
    "commentCount": 837,
    "retryCount": 0,
    "time": 1729887772
  },
  {
    "id": 41951131,
    "title": "डोमेन नाम खरीदने से पहले, पहले यह जांच लें कि कहीं यह भूतिया तो नहीं है।",
    "originLink": "https://www.bryanbraun.com/2024/10/25/before-you-buy-a-domain-name-first-check-to-see-if-its-haunted/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41951131",
    "commentBody": "",
    "originSummary": [
      "लेखक ने डोमेन musicbox.fun खरीदा, जिसका इतिहास पायरेटेड संगीत की मेजबानी करने का था, जिससे इसकी सर्च इंजन प्रतिष्ठा पर नकारात्मक प्रभाव पड़ा।",
      "एक \"भूतिया\" डोमेन उस डोमेन को संदर्भित करता है जिसका नकारात्मक अतीत उसके खोज रैंकिंग को प्रभावित करता है; ऐसे डोमेन की पहचान करने में वेबैक मशीन और DMCA शिकायत खोज जैसे उपकरण मदद कर सकते हैं।",
      "एक प्रेतवाधित डोमेन को पुनः प्राप्त करने के लिए, सर्च इंजन से संपर्क करें, SEO की सर्वोत्तम प्रथाओं का पालन करें, और धैर्य रखें, क्योंकि यह प्रक्रिया लंबी हो सकती है।"
    ],
    "commentSummary": [
      "डोमेन खरीदने से पहले, यह सुनिश्चित करने के लिए इसके इतिहास की जांच करना महत्वपूर्ण है कि यह पिछले मुद्दों से \"प्रेतवाधित\" नहीं है, जैसे कि स्पैम या अनुचित सामग्री के लिए अवरुद्ध होना।",
      "एक क्लाइंट ने एक प्रमुख डोमेन के समान डोमेन पर स्विच करने के बाद क्रोम में चेतावनियों का अनुभव किया, जिसके कारण ट्रैफिक हानि को रोकने के लिए माइग्रेशन रद्द कर दिया गया।",
      "यह सुझाव दिया गया है कि रजिस्ट्रार को उन डोमेन की खरीद को रोकना चाहिए जो मौजूदा डोमेन से बहुत अधिक मिलते-जुलते हैं ताकि संभावित समस्याओं से बचा जा सके।"
    ],
    "points": 682,
    "commentCount": 144,
    "retryCount": 0,
    "time": 1729899821
  },
  {
    "id": 41950392,
    "title": "दिल्ली उच्च न्यायालय द्वारा विकिपीडिया लेख को विश्व स्तर पर अवरुद्ध किया गया",
    "originLink": "https://en.wikipedia.org/wiki/Asian_News_International_vs._Wikimedia_Foundation",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41950392",
    "commentBody": "",
    "originSummary": [
      "विकिमीडिया फाउंडेशन ने दिल्ली उच्च न्यायालय के आदेश के बाद एक विशेष पृष्ठ तक पहुंच को सीमित कर दिया है।",
      "वे वर्तमान में स्थिति को संबोधित करने के लिए कानूनी मार्गों पर विचार कर रहे हैं, जो ज्ञान की मुफ्त पहुंच बनाए रखने के प्रति उनकी प्रतिबद्धता को उजागर करता है।",
      "फाउंडेशन वादा करता है कि जैसे ही नई जानकारी सामने आएगी, वह जनता को अपडेट के साथ सूचित करता रहेगा।"
    ],
    "commentSummary": [
      "दिल्ली उच्च न्यायालय ने एएनआई, एक समाचार एजेंसी जिसे सरकार के प्रति पक्षपाती होने का आरोप है, द्वारा दायर मानहानि के मुकदमे के बाद एक विकिपीडिया लेख को वैश्विक स्तर पर ब्लॉक कर दिया है।",
      "अदालत ने विकिपीडिया से लेख के संपादकों की पहचान उजागर करने का अनुरोध किया है, और ऐसा न करने पर भारत में साइट को ब्लॉक करने की धमकी दी है, जिससे सेंसरशिप और सरकारी प्रभाव के बारे में चिंताएं बढ़ गई हैं।",
      "इस कार्रवाई ने स्ट्रीसैंड प्रभाव के बारे में बहसों को जन्म दिया है, जहां जानकारी को दबाने के प्रयास अनजाने में सार्वजनिक रुचि और जागरूकता को बढ़ा सकते हैं।"
    ],
    "points": 648,
    "commentCount": 388,
    "retryCount": 0,
    "time": 1729894677
  },
  {
    "id": 41948666,
    "title": "कंपनी जिसका नाम \"> LTD\" था, उसे इसे बदलने के लिए मजबूर किया गया (2020)",
    "originLink": "https://www.theguardian.com/uk-news/2020/nov/06/companies-house-forces-business-name-change-to-prevent-security-risk",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41948666",
    "commentBody": "",
    "originSummary": [
      "एक कंपनी को अपना नाम ““> LTD” से बदलना पड़ा क्योंकि इसे क्रॉस-साइट स्क्रिप्टिंग (XSS) कमजोरियों का शोषण करने की क्षमता के कारण सुरक्षा जोखिम के रूप में पहचाना गया था।",
      "निर्देशक, जो एक ब्रिटिश सॉफ्टवेयर इंजीनियर हैं, द्वारा \"मज़ेदार और चंचल\" होने के लिए रखा गया नाम अनजाने में सुरक्षा चिंताओं का कारण बन गया।",
      "कंपनी हाउस ने मूल नाम को हटा दिया है और इसी तरह की समस्याओं को रोकने के लिए उपाय लागू किए हैं, जिससे सेवाओं की निरंतर सुरक्षा सुनिश्चित हो सके।"
    ],
    "commentSummary": [
      "एक कंपनी जिसका मूल नाम \"> LTD\" था, को 2020 में अपना नाम बदलना पड़ा क्योंकि इसके नाम में HTML स्क्रिप्ट टैग्स से जुड़े सुरक्षा जोखिम थे, जिन्हें असुरक्षित सिस्टम द्वारा शोषित किया जा सकता था।",
      "यह स्थिति मजबूत डेटा प्रबंधन प्रथाओं की महत्वपूर्ण आवश्यकता और विभिन्न प्रणालियों में सुरक्षा बनाए रखने की चुनौतियों को रेखांकित करती है।",
      "कंपनी का अब नाम \"THAT COMPANY WHOSE NAME USED TO CONTAIN HTML SCRIPT TAGS LTD\" है, जो इसके पिछले नामकरण समस्या को दर्शाता है।"
    ],
    "points": 505,
    "commentCount": 228,
    "retryCount": 0,
    "time": 1729884021
  },
  {
    "id": 41949108,
    "title": "अमेरिका में, पुनर्योजी कृषि प्रथाओं के लिए पिछले सलाह को भूलना आवश्यक है।",
    "originLink": "https://investigatemidwest.org/2024/10/11/regenerative-farming-practices-require-unlearning-past-advice/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41949108",
    "commentBody": "",
    "originSummary": [
      "कॉनकॉर्डिया, मिसौरी के किसान जोश पायने ने एक हर्बिसाइड एलर्जी के कारण अपने पारंपरिक पारिवारिक खेत को पुनर्योजी कृषि में बदल दिया, जिसमें उन्होंने कवर फसलें, भेड़ों का चराई और एक बगीचा लगाना जैसी प्रथाओं को शामिल किया।",
      "पुनर्योजी कृषि मिट्टी के स्वास्थ्य को बहाल करने और जलवायु परिवर्तन के अनुकूल होने पर केंद्रित है, जो पारंपरिक रासायनिक-आधारित खेती के तरीकों से एक बदलाव का प्रतिनिधित्व करती है।",
      "पेन परिवार द्वारा सिल्वोपास्तर और गली फसल प्रणाली को अपनाना कृषि में स्थिरता और एक स्थायी कृषि अर्थव्यवस्था की ओर एक व्यापक प्रवृत्ति को दर्शाता है।"
    ],
    "commentSummary": [
      "संयुक्त राज्य अमेरिका में पुनर्योजी खेती को चुनौतियों का सामना करना पड़ता है, जैसे कि किसानों की हिचकिचाहट जो कम उपज के डर और जागरूकता की कमी के कारण होती है, इसके लाभों के बावजूद जैसे कि मिट्टी के स्वास्थ्य में सुधार और रासायनिक उपयोग में कमी। - बिना जुताई वाली खेती में परिवर्तन को किसानों की उम्र, पुराने उपकरण और आर्थिक दबाव जैसे कारकों द्वारा बाधित किया जाता है, जिससे यह ज्ञान की समस्या की बजाय एक आर्थिक मुद्दा बन जाता है। - सरकारी प्रोत्साहन, नीतिगत परिवर्तन, और स्थानीय खाद्य प्रणालियों के लिए उपभोक्ता समर्थन पुनर्योजी खेती प्रथाओं को अपनाने में तेजी ला सकते हैं।"
    ],
    "points": 240,
    "commentCount": 114,
    "retryCount": 0,
    "time": 1729886636
  },
  {
    "id": 41951408,
    "title": "यह 6 अक्ष वाला रोबोट 0.05 मिमी की स्थैतिक सटीकता कैसे प्राप्त कर सकता है? (2021) [वीडियो]",
    "originLink": "https://www.youtube.com/watch?v=SioCwvR_PYY",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41951408",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "एक 6-अक्षीय रोबोट 0.05 मिमी स्थैतिक सटीकता के साथ उच्च सटीकता प्राप्त करता है, जो सटीक स्थिति निर्धारण के लिए एक जड़त्वीय मापन इकाई (IMU) को GPS और एक कालमैन फिल्टर के साथ एकीकृत करके सेंसर फ्यूजन का उपयोग करता है।",
      "नवाचार मोटर के भीतर सेंसर को एकीकृत करने में निहित है, जो कॉम्पैक्टनेस और दक्षता को बढ़ाता है, जैसा कि हैकर न्यूज़ पर चर्चा की गई है।",
      "चर्चा में नियंत्रण एल्गोरिदम के उपयोग, समान परियोजनाओं के लिए रास्पबेरी पाई पिको 2, और औद्योगिक रोबोटों में द्वितीयक एन्कोडर्स के साथ-साथ पेटेंट मुद्दों और बोइंग की डिजाइन खामियों को भी शामिल किया गया है।"
    ],
    "points": 227,
    "commentCount": 66,
    "retryCount": 0,
    "time": 1729902026
  },
  {
    "id": 41952994,
    "title": "ब्लूस्काई विकेंद्रीकृत नहीं है",
    "originLink": "https://beige.party/@possibledog/113367977656537478",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41952994",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "ब्लूस्काई का विकेंद्रीकरण इसके केंद्रीकृत घटकों जैसे कि DID PLC रजिस्ट्री, जो ICANN के समान है, और एल्गोरिदम के उपयोग के कारण प्रश्नों के घेरे में है।",
      "मंच के विकेंद्रीकरण के दावों की जांच की जा रही है, विशेष रूप से केंद्रीकृत पहचान समाधान और निवेशक प्रभाव, जैसे कि ब्लॉकचेन कैपिटल से संबंधित।",
      "इन चिंताओं के बावजूद, उपयोगकर्ता ट्विटर के विकल्प के रूप में ब्लूस्काई की ओर आकर्षित हो रहे हैं, जो विकेंद्रीकरण के वादों की तुलना में उपयोगकर्ता अनुभव को प्राथमिकता दे रहे हैं।"
    ],
    "points": 194,
    "commentCount": 150,
    "retryCount": 0,
    "time": 1729924582
  },
  {
    "id": 41954825,
    "title": "नया विंडोज ड्राइवर सिग्नेचर बाईपास कर्नेल रूटकिट इंस्टॉल की अनुमति देता है",
    "originLink": "https://www.bleepingcomputer.com/news/security/new-windows-driver-signature-bypass-allows-kernel-rootkit-installs/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41954825",
    "commentBody": "",
    "originSummary": [
      "एक नई विंडोज़ भेद्यता हमलावरों को ड्राइवर सिग्नेचर प्रवर्तन को बायपास करने की अनुमति देती है, जिससे विंडोज़ कर्नेल घटकों को डाउनग्रेड करके पूरी तरह से पैच किए गए सिस्टम पर कर्नेल रूटकिट्स की स्थापना संभव हो जाती है।",
      "सुरक्षा शोधकर्ता अलोन लेविएव ने इस हमले का प्रदर्शन किया, जिसे \"इट्सनॉटएसेक्योरिटीबाउंड्री\" नाम दिया गया है, जो विंडोज की फाइल अपरिवर्तनीयता में एक खामी का फायदा उठाकर बिना हस्ताक्षरित ड्राइवरों को लोड करता है और सुरक्षा नियंत्रणों को निष्क्रिय करता है।",
      "माइक्रोसॉफ्ट ने अभी तक इस कमजोरी को ठीक नहीं किया है, जिससे यह स्पष्ट होता है कि सुरक्षा उल्लंघनों को रोकने के लिए डाउनग्रेड प्रक्रियाओं की बेहतर निगरानी की आवश्यकता है।"
    ],
    "commentSummary": [
      "एक नया विंडोज ड्राइवर सिग्नेचर बाईपास खोजा गया है, जो कर्नेल रूटकिट इंस्टॉलेशन को सक्षम करता है और महत्वपूर्ण सुरक्षा चिंताओं को बढ़ाता है।",
      "माइक्रोसॉफ्ट का तर्क है कि यह बाईपास सुरक्षा सीमा का उल्लंघन नहीं करता है, क्योंकि प्रशासनिक प्रक्रियाएं विश्वसनीय कंप्यूटिंग बेस के भीतर हैं, जिससे विंडोज की सुरक्षा मॉडल पर बहस छिड़ गई है।",
      "चर्चा में सुरक्षा को उपयोगिता और संगतता के साथ संतुलित करने की चुनौतियों पर जोर दिया गया है, यह बताते हुए कि अन्य ऑपरेटिंग सिस्टम में भी इसी तरह की समस्याएं मौजूद हैं और उपयोगकर्ता व्यवहार, जैसे कि आसानी से एडमिन विशेषाधिकार देना, कमजोरियों में योगदान देता है।"
    ],
    "points": 188,
    "commentCount": 113,
    "retryCount": 0,
    "time": 1729951960
  },
  {
    "id": 41952006,
    "title": "रनस्केप ग्रैंड एक्सचेंज पर एल्गोरिदमिक ट्रेडिंग में रोमांच",
    "originLink": "https://tristanrhodes.com/blog/Adventures-in-Algorithmic-Trading-on-the-Runescape-Grand-Exchange",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41952006",
    "commentBody": "",
    "originSummary": [
      "ब्लॉग में रनस्केप के ग्रैंड एक्सचेंज पर एल्गोरिदमिक ट्रेडिंग के लिए एक बॉट के विकास पर चर्चा की गई है, जो बाजार निर्माण रणनीतियों को बढ़ाने के लिए मशीन लर्निंग का उपयोग करता है।- बॉट रीयल-टाइम प्राइसिंग के लिए एक जावास्क्रिप्ट एपीआई, क्रियाओं को निष्पादित करने के लिए एक जावा क्लाइंट, और ऑफर लाभप्रदता को रैंक करने के लिए एक पायथन एपीआई का उपयोग करता है, जिसमें हर 5 मिनट और घंटे में डेटा एकत्र किया जाता है।- प्रयोग के परिणाम बताते हैं कि मशीन लर्निंग मॉडल, विशेष रूप से रैंडम फॉरेस्ट, प्रति घंटे लाभ के मामले में बेसलाइन विधि की तुलना में काफी बेहतर प्रदर्शन करते हैं।"
    ],
    "commentSummary": [
      "एक उपयोगकर्ता ने रनस्केप ग्रैंड एक्सचेंज पर एल्गोरिदमिक ट्रेडिंग के साथ अपने अनुभव का वर्णन किया, जिसमें उन्होंने एक गूगल शीट और गेम की एपीआई का उपयोग किया, और कम मुनाफे के बावजूद आनंद का उल्लेख किया।",
      "चर्चा का विस्तार हुआ और इसमें वर्ल्ड ऑफ वॉरक्राफ्ट और ईवीई ऑनलाइन जैसे खेलों में समान व्यापारिक अनुभवों को शामिल किया गया, जिसमें बाजार निर्माण रणनीतियों और व्यापार के आनंद पर ध्यान केंद्रित किया गया।",
      "प्रतिभागियों ने वास्तविक दुनिया के बाजारों में बाजार हेरफेर की नैतिकता और वैधता पर बहस की, इसकी तुलना इन-गेम ट्रेडिंग से की, और ऐतिहासिक डेटा से लाभदायक ट्रेडों की भविष्यवाणी करने के लिए मशीन लर्निंग मॉडल का उपयोग करने पर चर्चा की।"
    ],
    "points": 142,
    "commentCount": 29,
    "retryCount": 0,
    "time": 1729909427
  },
  {
    "id": 41951420,
    "title": "हम अमेरिकी पश्चिम को टेराफॉर्म कर सकते हैं",
    "originLink": "https://caseyhandmer.wordpress.com/2024/10/26/we-can-terraform-the-american-west/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41951420",
    "commentBody": "",
    "originSummary": [
      "अमेरिकी पश्चिम जल की कमी का सामना कर रहा है, जो इसकी विकास क्षमता को सीमित करता है, लेकिन सौर ऊर्जा से संचालित जल विलवणीकरण एक समाधान प्रदान करता है जो शुष्क क्षेत्रों को पानी उपलब्ध कराता है।",
      "कैलिफोर्निया और फ्लोरिडा में सफल उदाहरण दिखाते हैं कि कैसे बुनियादी ढांचा परियोजनाएं पानी को स्थानांतरित कर समृद्ध शहरों का निर्माण कर सकती हैं, जो नेवादा जैसे क्षेत्रों के लिए समान संभावनाओं का सुझाव देती हैं।",
      "सौर ऊर्जा और विलवणीकरण तकनीक का उपयोग करके सस्ती पानी का उत्पादन किया जा सकता है, जो आर्थिक विकास और भूमि मूल्य में वृद्धि को प्रोत्साहित करता है, जबकि प्राकृतिक परिदृश्यों को संरक्षित करता है, और रेगिस्तानों को उपजाऊ भूमि में बदलने के लिए वैश्विक अनुप्रयोगों की संभावनाएं प्रदान करता है।"
    ],
    "commentSummary": [
      "अमेरिकी पश्चिम को टेराफॉर्म करने की अवधारणा को अवास्तविक और आर्थिक रूप से अव्यवहारिक माना जाता है, जिसमें विलवणीकरण और जल परिवहन से संबंधित महत्वपूर्ण ऊर्जा मांगें और लागत शामिल हैं।",
      "आलोचक पारिस्थितिक परिणामों और मौजूदा जल प्रबंधन चुनौतियों पर जोर देते हैं, और बड़े पैमाने पर इंजीनियरिंग परियोजनाओं के खिलाफ तर्क देते हैं।",
      "यह बहस महत्वाकांक्षी इंजीनियरिंग प्रयासों और पर्यावरण संरक्षण के बीच के संघर्ष को उजागर करती है, जो प्राकृतिक परिदृश्यों को बदलने के बजाय स्थायी समाधानों की वकालत करती है।"
    ],
    "points": 137,
    "commentCount": 192,
    "retryCount": 0,
    "time": 1729902162
  },
  {
    "id": 41951421,
    "title": "ओएसआई विवादास्पद ओपन-सोर्स एआई परिभाषा तैयार कर रहा है",
    "originLink": "https://lwn.net/SubscriberLink/995159/a37fb9817a00ebcb/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41951421",
    "commentBody": "",
    "originSummary": [
      "ओपन सोर्स इनिशिएटिव (OSI) 27 अक्टूबर, 2024 को ओपन सोर्स एआई डेफिनिशन (OSAID) को अंतिम रूप देने और उस पर मतदान करने की तैयारी कर रहा है, जिसके अगले दिन प्रकाशन होगा, जिसका उद्देश्य यह परिभाषित करना है कि एक ओपन-सोर्स एआई सिस्टम के रूप में क्या योग्य है।",
      "परिभाषा ने ओपन-सोर्स समुदाय के भीतर बहस को जन्म दिया है, जिसमें आलोचकों का तर्क है कि यह प्रशिक्षण डेटा की रिलीज को अनिवार्य न करके कम पड़ती है, जिसे वे ओपन-सोर्स सिद्धांतों को बनाए रखने के लिए आवश्यक मानते हैं।",
      "ओएसआई के कार्यकारी निदेशक स्टेफानो माफुली परिभाषा का बचाव करते हैं, यह बताते हुए कि इसके विकास में विभिन्न हितधारकों की भागीदारी शामिल थी और इसका उद्देश्य पारदर्शिता को व्यावहारिक विचारों के साथ संतुलित करना है।"
    ],
    "commentSummary": [
      "ओपन सोर्स इनिशिएटिव (OSI) ओपन-सोर्स एआई के लिए एक विवादास्पद परिभाषा विकसित कर रहा है, जिससे इस बात पर बहस हो रही है कि एआई मॉडल को ओपन सोर्स माना जाने के लिए प्रशिक्षण डेटा को शामिल करना आवश्यक है या नहीं।",
      "कुछ लोग तर्क देते हैं कि प्रशिक्षण डेटा तक पहुंच के बिना एआई मॉडल को संशोधित करना संकलित सॉफ़्टवेयर को स्रोत कोड के बिना बदलने के समान है, जबकि अन्य एआई मॉडल के वज़न को संशोधनों के लिए \"स्रोत\" के रूप में देखते हैं।",
      "बहस एआई में ओपन सोर्स पर विभिन्न दृष्टिकोणों को उजागर करती है, जिसमें बौद्धिक संपदा संबंधी चिंताएं और ओपन सोर्स मानकों को स्थापित करने में ओएसआई की भूमिका शामिल है।"
    ],
    "points": 107,
    "commentCount": 115,
    "retryCount": 0,
    "time": 1729902184
  },
  {
    "id": 41951773,
    "title": "रूस ने अमेरिकियों को विभाजित करने के लिए तूफान से संबंधित गलत जानकारी को बढ़ावा दिया",
    "originLink": "https://abc7chicago.com/post/russia-amplified-hurricane-disinformation-drive-americans-apart-researchers-find/15463309/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41951773",
    "commentBody": "",
    "originSummary": [
      "अनुसंधान से पता चलता है कि रूस अमेरिकी तूफान प्रतिक्रियाओं के बारे में गलत जानकारी फैला रहा है ताकि राष्ट्रपति चुनाव से पहले राजनीतिक चर्चा को प्रभावित किया जा सके।- रूसी राज्य मीडिया और सोशल नेटवर्क नकली छवियों और दावों का उपयोग करके अमेरिकी नेताओं को अक्षम के रूप में चित्रित कर रहे हैं, जिसका उद्देश्य मौजूदा बहसों का फायदा उठाना और सरकार में विश्वास को कम करना है।- गलत जानकारी कमजोर रूप से मॉडरेटेड प्लेटफार्मों जैसे X (पूर्व में ट्विटर) पर फैलाई जा रही है, जिसमें कुछ अमेरिकी राजनेता, जैसे कि प्रतिनिधि पॉल गोसर, इन रूसी कथाओं को प्रतिध्वनित कर रहे हैं।"
    ],
    "commentSummary": [
      "रूस पर संयुक्त राज्य अमेरिका में असंतोष फैलाने के लिए तूफानों के बारे में गलत जानकारी फैलाने का आरोप लगाया गया है, जिससे विदेशी प्रभाव के बारे में चिंताएं बढ़ रही हैं।",
      "आलोचकों का तर्क है कि अमेरिकी सरकार और सोशल मीडिया प्लेटफॉर्म इन भ्रामक सूचनाओं के प्रयासों को पर्याप्त रूप से संबोधित नहीं कर रहे हैं।",
      "यह स्थिति इस बहस को उजागर करती है कि क्या अमेरिका को समान रणनीतियों के साथ प्रतिक्रिया देनी चाहिए या व्यक्तियों को उस जानकारी का समालोचनात्मक मूल्यांकन करने के लिए शिक्षित करने पर ध्यान केंद्रित करना चाहिए जो वे सामना करते हैं।"
    ],
    "points": 102,
    "commentCount": 61,
    "retryCount": 0,
    "time": 1729906391
  },
  {
    "id": 41952908,
    "title": "फेड्स: आपके पास रेट्रो वीडियो गेम्स को लाइब्रेरी की किताबों की तरह चेक आउट करने का अधिकार नहीं है।",
    "originLink": "https://gizmodo.com/feds-say-you-dont-have-a-right-to-check-out-retro-video-games-like-library-books-2000516767",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41952908",
    "commentBody": "",
    "originSummary": [
      "यू.एस. कॉपीराइट कार्यालय ने एक DMCA छूट को अस्वीकार कर दिया है जो गेमिंग इतिहासकारों को आउट-ऑफ-प्रिंट वीडियो गेम्स तक पहुंचने में सक्षम बनाती, जो कि बड़े पैमाने पर खरीद के लिए उपलब्ध नहीं हैं।",
      "संरक्षणकर्ताओं का उद्देश्य इन खेलों को पुस्तकालय की पुस्तकों की तरह सुलभ बनाना था, लेकिन निर्णय ने प्रतिबंधों को बनाए रखा, जिससे केवल एक व्यक्ति को एक समय में, व्यक्तिगत रूप से पहुंचने की अनुमति मिलती है।",
      "वीडियो गेम इतिहास फाउंडेशन ने इस निर्णय की आलोचना की, यह सुझाव देते हुए कि यह संरक्षण प्रयासों में बाधा डालता है और शोधकर्ताओं को पायरेसी का सहारा लेने के लिए मजबूर कर सकता है, जबकि उद्योग समूहों का तर्क है कि मुफ्त पहुंच से क्लासिक खेलों के बाजार पर नकारात्मक प्रभाव पड़ सकता है।"
    ],
    "commentSummary": [
      "लेख में पुस्तकालयों द्वारा रेट्रो वीडियो गेम उधार देने के बारे में एक भ्रामक शीर्षक को संबोधित किया गया है, यह स्पष्ट करते हुए कि जबकि भौतिक उधार की अनुमति है, दूरस्थ उधार के लिए डिजिटल प्रतियों को DMCA द्वारा प्रतिबंधित किया गया है।",
      "बहस में कॉपीराइट कानूनों की चुनौतियों को उजागर किया गया है, जो पुराने खेलों को संरक्षित और उन तक पहुंचने में आती हैं, जिसमें कुछ लोग गैर-व्यावसायिक रूप से उपलब्ध कार्यों के लिए सार्वजनिक पहुंच की अनुमति देने के लिए कानूनी बदलावों की वकालत कर रहे हैं।",
      "चर्चा डिजिटल मीडिया पर कॉपीराइट के व्यापक प्रभाव और सांस्कृतिक कलाकृतियों के संरक्षण तक फैली हुई है, जिसमें सुरक्षा और पहुंच के बीच संतुलन की आवश्यकता पर जोर दिया गया है।"
    ],
    "points": 96,
    "commentCount": 70,
    "retryCount": 0,
    "time": 1729922754
  },
  {
    "id": 41952779,
    "title": "एमडीएक्स - अपने मार्कडाउन कोड ब्लॉक्स को निष्पादित करें, अब गो में",
    "originLink": "https://github.com/dim0x69/mdx",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41952779",
    "commentBody": "",
    "originSummary": [
      "एक नया प्रोजेक्ट जिसे mdx कहा जाता है, makedown से प्रेरित होकर विकसित किया गया है ताकि Go प्रोग्रामिंग भाषा सीखने में मदद मिल सके।- mdx की मुख्य विशेषताओं में कमांड्स के बीच निर्भरता को परिभाषित करना, शेबैंग्स (एक स्क्रिप्ट निष्पादन निर्देश) का समर्थन करना, और कोड ब्लॉक्स को तर्क पास करना शामिल है।- डेवलपर इस प्रोजेक्ट पर समुदाय से प्रतिक्रिया मांग रहा है, जो GitHub पर उपलब्ध है।"
    ],
    "commentSummary": [
      "Mdx एक नया Go-आधारित उपकरण है जो Markdown कोड ब्लॉकों को निष्पादित करने के लिए बनाया गया है, जो makedown से प्रेरित है। यह निर्भरता परिभाषा, शेबैंग समर्थन, और तर्क पासिंग की सुविधा प्रदान करता है।",
      "यह परियोजना ओपन-सोर्स है, जो प्रतिक्रिया, सुझाव और योगदान आमंत्रित करती है, और इसे runme.dev, xc, और Obsidian के लिए Execute Code जैसे उपकरणों से तुलना की जा रही है।",
      "नाम \"mdx\" के साथ संभावित भ्रम है, क्योंकि यह पहले से ही एक जावास्क्रिप्ट फ्रेमवर्क तकनीक से जुड़ा हुआ है।"
    ],
    "points": 92,
    "commentCount": 42,
    "retryCount": 0,
    "time": 1729920860
  }
]
