[
  {
    "id": 41949098,
    "title": "يمكننا الآن إصلاح آلات الآيس كريم في ماكدونالدز",
    "originLink": "https://www.ifixit.com/News/102368/victory-is-sweet-we-can-now-fix-mcdonalds-ice-cream-machines",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41949098",
    "commentBody": "",
    "originSummary": [
      "قضت مكتب حقوق الطبع والنشر الأمريكي بأنه من القانوني إصلاح آلات الآيس كريم الخاصة بمكدونالدز، مما يمثل انتصارًا لحركة الحق في الإصلاح. - يتيح هذا القرار للمالكين تجاوز الأقفال الرقمية على معدات الطعام التجارية، مما قد يقلل من الحاجة إلى استدعاءات الخدمة المكلفة. - على الرغم من هذا التقدم، فإن الحكم لا يسمح بمشاركة أو بيع أدوات الإصلاح، وتم رفض إعفاءات أوسع للمعدات الصناعية، مما يشير إلى تحديات مستمرة في الحركة من أجل حقوق إصلاح أوسع."
    ],
    "commentSummary": [
      "تتعطل آلات الآيس كريم في ماكدونالدز بشكل متكرر بسبب مشاكل الصيانة والأكواد الخطأ المعقدة، مما يستلزم إصلاحات مكلفة من قبل فنيين معتمدين من الشركة المصنعة.",
      "تم تصميم الآلات بحيث يكون من الصعب إصلاحها بشكل مستقل، مع وجود أقفال رقمية محمية بموجب قانون حقوق النشر الرقمية (DMCA)، على الرغم من أن التغييرات القانونية الأخيرة تسمح بالتحايل لأغراض الإصلاح.",
      "تؤكد هذه الحالة على مخاوف أوسع تتعلق بقوانين الحق في الإصلاح والسيطرة المؤسسية على صيانة المعدات."
    ],
    "points": 982,
    "commentCount": 258,
    "retryCount": 0,
    "time": 1729886556
  },
  {
    "id": 41949297,
    "title": "جيف بيزوس أوقف تأييد صحيفة واشنطن بوست لكمالا هاريس",
    "originLink": "https://www.cnbc.com/2024/10/25/jeff-bezos-killed-washington-post-endorsement-of-kamala-harris-.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41949297",
    "commentBody": "",
    "originSummary": [
      "لن تؤيد صحيفة واشنطن بوست أي مرشح رئاسي لأول مرة منذ عقود، وهو قرار يُقال إنه تأثر بمالكها جيف بيزوس.",
      "يمثل هذا القرار خروجًا عن تقليد الصحيفة في تأييد المرشحين الديمقراطيين وقد أدى إلى انتقادات وإلغاء الاشتراكات.",
      "يدعي ناشر صحيفة \"ذا بوست\"، ويل لويس، أن هذه الخطوة هي عودة إلى جذور الصحيفة المستقلة، وسط التوترات المستمرة بين بيزوس والرئيس السابق ترامب."
    ],
    "commentSummary": [
      "يُزعم أن جيف بيزوس تدخل لمنع صحيفة واشنطن بوست من تأييد كامالا هاريس، مما أثار مخاوف بشأن تضارب المصالح المحتمل بسبب مشاريعه التجارية الأخرى، مثل العقود الحكومية.",
      "يشير النقاد إلى أن قرار بيزوس قد يكون مدفوعًا برغبة في تجنب ردود الفعل السلبية من الشخصيات السياسية، ولا سيما ترامب، الذي لديه تاريخ في تهديد وسائل الإعلام.",
      "يؤكد هذا الحادث على التوتر المستمر بين المصالح التجارية واستقلالية الصحافة، مما يثير تساؤلات حول تأثير تأييد الصحف على الحيادية."
    ],
    "points": 726,
    "commentCount": 837,
    "retryCount": 0,
    "time": 1729887772
  },
  {
    "id": 41951131,
    "title": "قبل أن تشتري اسم نطاق، تحقق أولاً مما إذا كان مسكونًا.",
    "originLink": "https://www.bryanbraun.com/2024/10/25/before-you-buy-a-domain-name-first-check-to-see-if-its-haunted/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41951131",
    "commentBody": "",
    "originSummary": [
      "اشترى المؤلف النطاق musicbox.fun، الذي كان له تاريخ في استضافة الموسيقى المقرصنة، مما أثر سلبًا على سمعته في محركات البحث.",
      "يشير مصطلح \"النطاق المسكون\" إلى النطاق الذي له ماضٍ سلبي يؤثر على ترتيبه في محركات البحث؛ يمكن لأدوات مثل آلة العودة الزمنية وبحث شكاوى DMCA المساعدة في تحديد مثل هذه النطاقات.",
      "لاستعادة نطاق مسكون، تواصل مع محركات البحث، التزم بأفضل ممارسات تحسين محركات البحث، وتحلى بالصبر، حيث يمكن أن تكون العملية طويلة."
    ],
    "commentSummary": [
      "قبل شراء نطاق، من المهم التحقيق في تاريخه للتأكد من أنه ليس \"مسكونًا\" بمشاكل سابقة، مثل حظره بسبب البريد العشوائي أو المحتوى غير المناسب.",
      "واجه عميل تحذيرات في متصفح كروم بعد التحول إلى نطاق مشابه لنطاق رئيسي، مما أدى إلى إلغاء عملية الانتقال لمنع فقدان حركة المرور.",
      "هناك اقتراح بأن يقوم المسجلون بمنع شراء النطاقات التي تشبه بشكل كبير النطاقات الموجودة بالفعل لتجنب المشاكل المحتملة."
    ],
    "points": 682,
    "commentCount": 144,
    "retryCount": 0,
    "time": 1729899821
  },
  {
    "id": 41950392,
    "title": "تم حجب مقالة ويكيبيديا عالميًا بقرار من المحكمة العليا في دلهي",
    "originLink": "https://en.wikipedia.org/wiki/Asian_News_International_vs._Wikimedia_Foundation",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41950392",
    "commentBody": "",
    "originSummary": [
      "قامت مؤسسة ويكيميديا بتقييد الوصول إلى صفحة معينة بناءً على أمر من محكمة دلهي العليا.",
      "هم حاليًا يدرسون السبل القانونية لمعالجة الوضع، مما يبرز التزامهم بالحفاظ على الوصول المجاني إلى المعرفة.",
      "تعد المؤسسة بإبقاء الجمهور على اطلاع بالتحديثات مع ظهور معلومات جديدة."
    ],
    "commentSummary": [
      "حظرت محكمة دلهي العليا عالميًا مقالة على ويكيبيديا بعد دعوى تشهير رفعتها وكالة الأنباء ANI، التي اتُهمت بالتحيز لصالح الحكومة.",
      "طلبت المحكمة من ويكيبيديا الكشف عن هويات محرري المقالة، مع تهديد بحجب الموقع في الهند، مما أثار مخاوف بشأن الرقابة وتأثير الحكومة.",
      "أدى هذا الإجراء إلى نقاشات حول تأثير سترايساند، حيث قد تؤدي الجهود المبذولة لقمع المعلومات إلى زيادة الاهتمام والوعي العام بشكل غير مقصود."
    ],
    "points": 648,
    "commentCount": 388,
    "retryCount": 0,
    "time": 1729894677
  },
  {
    "id": 41948666,
    "title": "شركة باسم \"> LTD\" أُجبرت على تغييره (2020)",
    "originLink": "https://www.theguardian.com/uk-news/2020/nov/06/companies-house-forces-business-name-change-to-prevent-security-risk",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41948666",
    "commentBody": "",
    "originSummary": [
      "اضطرت شركة إلى تغيير اسمها من ““> LTD” بعد أن تم تحديدها كخطر أمني بسبب قدرتها على استغلال ثغرات البرمجة عبر المواقع (XSS).",
      "الاسم، الذي كان من المفترض أن يكون \"ممتعًا ومرحًا\" من قبل المخرج، وهو مهندس برمجيات بريطاني، أثار عن غير قصد مخاوف أمنية.",
      "قامت شركة السجل التجاري بإزالة الاسم الأصلي ووضعت تدابير لمنع حدوث مشكلات مماثلة، مما يضمن استمرار أمان الخدمات."
    ],
    "commentSummary": [
      "اضطرت شركة كانت تُسمى في الأصل \"> LTD\" إلى تغيير اسمها في عام 2020 بسبب المخاطر الأمنية المرتبطة بعلامات سكريبت HTML في اسمها، والتي يمكن استغلالها من قبل الأنظمة غير الآمنة.",
      "تؤكد هذه الحالة على الحاجة الملحة لممارسات قوية في التعامل مع البيانات والتحديات في الحفاظ على الأمن عبر الأنظمة المختلفة.",
      "الشركة تُسمى الآن \"تلك الشركة التي كان اسمها يحتوي على علامات سكريبت HTML المحدودة\"، مما يعكس مشكلة التسمية السابقة."
    ],
    "points": 505,
    "commentCount": 228,
    "retryCount": 0,
    "time": 1729884021
  },
  {
    "id": 41949108,
    "title": "في الولايات المتحدة، تتطلب ممارسات الزراعة التجديدية نسيان النصائح السابقة.",
    "originLink": "https://investigatemidwest.org/2024/10/11/regenerative-farming-practices-require-unlearning-past-advice/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41949108",
    "commentBody": "",
    "originSummary": [
      "قام المزارع جوش باين في كونكورديا، ميزوري، بتحويل مزرعة عائلته من الزراعة التقليدية إلى الزراعة التجديدية بسبب حساسية من مبيدات الأعشاب، حيث دمج ممارسات مثل المحاصيل الغطائية، ورعي الأغنام، وزراعة بستان.",
      "تركز الزراعة التجديدية على استعادة صحة التربة والتكيف مع تغير المناخ، مما يمثل تحولًا عن أساليب الزراعة التقليدية المعتمدة على المواد الكيميائية.",
      "يعكس تبني عائلة باين لنظامي الزراعة الحراجية والرعي بين الصفوف اتجاهًا أوسع في الزراعة نحو الاستدامة واقتصاد المزارع المستدام."
    ],
    "commentSummary": [
      "تواجه الزراعة التجديدية في الولايات المتحدة تحديات مثل تردد المزارعين بسبب مخاوف من انخفاض المحاصيل ونقص الوعي، على الرغم من فوائدها مثل تحسين صحة التربة وتقليل استخدام المواد الكيميائية. - تعوق الانتقال إلى الزراعة بدون حرث عوامل مثل عمر المزارعين والمعدات القديمة والضغوط الاقتصادية، مما يجعلها قضية اقتصادية أكثر من كونها مشكلة معرفية. - يمكن أن تسرع الحوافز الحكومية وتغييرات السياسات ودعم المستهلكين لأنظمة الغذاء المحلية من تبني ممارسات الزراعة التجديدية."
    ],
    "points": 240,
    "commentCount": 114,
    "retryCount": 0,
    "time": 1729886636
  },
  {
    "id": 41951408,
    "title": "كيف يمكن لهذا الروبوت ذو الستة محاور أن يكون لديه دقة ثابتة تبلغ 0.05 مم؟ (2021) [فيديو]",
    "originLink": "https://www.youtube.com/watch?v=SioCwvR_PYY",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41951408",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "يحقق الروبوت ذو الستة محاور دقة عالية تبلغ 0.05 مم في الثبات من خلال دمج المستشعرات، حيث يدمج وحدة القياس بالقصور الذاتي (IMU) مع نظام تحديد المواقع العالمي (GPS) وفلتر كالمان لتحقيق تحديد المواقع بدقة.",
      "تكمن الابتكار في دمج المستشعر داخل المحرك، مما يعزز من الكفاءة والدمج، كما نوقش على Hacker News.",
      "تغطي المناقشة أيضًا استخدام خوارزميات التحكم، وRaspberry Pi Pico 2 للمشاريع المماثلة، والمشفرات الثانوية في الروبوتات الصناعية، إلى جانب قضايا براءات الاختراع وعيوب تصميم بوينغ."
    ],
    "points": 227,
    "commentCount": 66,
    "retryCount": 0,
    "time": 1729902026
  },
  {
    "id": 41952994,
    "title": "Bluesky ليست لامركزية",
    "originLink": "https://beige.party/@possibledog/113367977656537478",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41952994",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "يتم التشكيك في لامركزية Bluesky بسبب اعتمادها على مكونات مركزية مثل سجل DID PLC، المشابه لـ ICANN، واستخدامها للخوارزميات.",
      "تخضع ادعاءات المنصة بشأن اللامركزية للتدقيق، خاصة فيما يتعلق بحل الهوية المركزي وتأثير المستثمرين، مثل تأثير Blockchain Capital.",
      "على الرغم من هذه المخاوف، ينجذب المستخدمون إلى منصة Bluesky كبديل لتويتر، حيث يفضلون تجربة المستخدم على وعود اللامركزية."
    ],
    "points": 194,
    "commentCount": 150,
    "retryCount": 0,
    "time": 1729924582
  },
  {
    "id": 41954825,
    "title": "تجاوز توقيع برنامج تشغيل Windows الجديد يسمح بتثبيت جذر النواة",
    "originLink": "https://www.bleepingcomputer.com/news/security/new-windows-driver-signature-bypass-allows-kernel-rootkit-installs/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41954825",
    "commentBody": "",
    "originSummary": [
      "تسمح ثغرة جديدة في نظام ويندوز للمهاجمين بتجاوز فرض توقيع السائق، مما يمكنهم من تثبيت برامج الجذر الخبيثة على الأنظمة المحدثة بالكامل عن طريق تخفيض مكونات نواة ويندوز.",
      "قام الباحث الأمني ألون ليفييف بعرض هذا الهجوم، الذي أطلق عليه اسم \"ItsNotASecurityBoundary\"، والذي يستغل ثغرة في عدم قابلية ملفات ويندوز للتغيير لتحميل برامج تشغيل غير موقعة وتعطيل ضوابط الأمان.",
      "لم تقم مايكروسوفت بعد بإصلاح هذه الثغرة، مما يبرز الحاجة إلى تحسين مراقبة إجراءات التخفيض لمنع مثل هذه الاختراقات الأمنية."
    ],
    "commentSummary": [
      "تم اكتشاف تجاوز جديد لتوقيع برنامج تشغيل ويندوز، مما يتيح تثبيت برامج الجذر في النواة ويثير مخاوف أمنية كبيرة.",
      "تجادل مايكروسوفت بأن هذا التجاوز لا يخرق حاجز الأمان، حيث أن العمليات الإدارية تقع ضمن قاعدة الحوسبة الموثوقة، مما يثير الجدل حول نموذج الأمان في نظام ويندوز.",
      "تؤكد المناقشة على التحديات المتمثلة في تحقيق التوازن بين الأمان وسهولة الاستخدام والتوافق، مشيرة إلى أن مشكلات مماثلة توجد في أنظمة تشغيل أخرى وأن سلوك المستخدم، مثل منح صلاحيات المسؤول بسهولة، يساهم في الثغرات الأمنية."
    ],
    "points": 188,
    "commentCount": 113,
    "retryCount": 0,
    "time": 1729951960
  },
  {
    "id": 41952006,
    "title": "مغامرات في التداول الخوارزمي في بورصة جراند إكستشينج للعبة رن سكيب",
    "originLink": "https://tristanrhodes.com/blog/Adventures-in-Algorithmic-Trading-on-the-Runescape-Grand-Exchange",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41952006",
    "commentBody": "",
    "originSummary": [
      "يناقش المدونة تطوير بوت للتداول الخوارزمي في بورصة Runescape الكبرى، باستخدام التعلم الآلي لتعزيز استراتيجيات صنع السوق. يستخدم البوت واجهة برمجة تطبيقات JavaScript لتسعير الوقت الفعلي، وعميل Java لتنفيذ الإجراءات، وواجهة برمجة تطبيقات Python لتصنيف ربحية العروض، مع جمع البيانات كل 5 دقائق وساعة. تشير نتائج التجارب إلى أن نماذج التعلم الآلي، وخاصة الغابة العشوائية، تتفوق بشكل كبير على الطريقة الأساسية من حيث الربح لكل ساعة."
    ],
    "commentSummary": [
      "وصف مستخدم تجربته مع التداول الخوارزمي في بورصة Runescape الكبرى، مستخدمًا جدول بيانات Google وواجهة برمجة التطبيقات الخاصة باللعبة، مشيرًا إلى الاستمتاع بالتجربة رغم الأرباح المنخفضة.",
      "توسعت المناقشة لتشمل تجارب تداول مماثلة في ألعاب مثل وورلد أوف ووركرافت وإيف أونلاين، مع التركيز على استراتيجيات صنع السوق ومتعة التداول.",
      "ناقش المشاركون أخلاقيات وقانونية التلاعب في الأسواق الحقيقية، مقارنين ذلك بالتداول داخل الألعاب، وتحدثوا عن استخدام نماذج التعلم الآلي للتنبؤ بالتداولات المربحة من البيانات التاريخية."
    ],
    "points": 142,
    "commentCount": 29,
    "retryCount": 0,
    "time": 1729909427
  },
  {
    "id": 41951420,
    "title": "يمكننا تحويل الغرب الأمريكي",
    "originLink": "https://caseyhandmer.wordpress.com/2024/10/26/we-can-terraform-the-american-west/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41951420",
    "commentBody": "",
    "originSummary": [
      "يعاني الغرب الأمريكي من ندرة المياه، مما يحد من إمكانات نموه، لكن تحلية المياه بالطاقة الشمسية تقدم حلاً من خلال توفير المياه للمناطق الجافة.",
      "تظهر الأمثلة الناجحة في كاليفورنيا وفلوريدا كيف يمكن لمشاريع البنية التحتية نقل المياه لخلق مدن مزدهرة، مما يشير إلى إمكانية مماثلة لمناطق مثل نيفادا.",
      "يمكن لاستخدام الطاقة الشمسية وتقنية تحلية المياه إنتاج مياه بأسعار معقولة، مما يعزز النمو الاقتصادي وزيادة قيمة الأراضي مع الحفاظ على المناظر الطبيعية، مع وجود تطبيقات عالمية محتملة لتحويل الصحاري إلى أراضٍ خصبة."
    ],
    "commentSummary": [
      "يُعتبر مفهوم تحويل الأراضي في الغرب الأمريكي غير واقعي وغير عملي من الناحية الاقتصادية، نظرًا لمتطلبات الطاقة الكبيرة والتكاليف المرتبطة بتحلية المياه ونقلها.",
      "يشدد النقاد على العواقب البيئية وتحديات إدارة المياه الحالية، مجادلين ضد المشاريع الهندسية الجذرية.",
      "يؤكد النقاش على الصراع بين المساعي الهندسية الطموحة والحفاظ على البيئة، داعيًا إلى حلول مستدامة بدلاً من تغيير المناظر الطبيعية."
    ],
    "points": 137,
    "commentCount": 192,
    "retryCount": 0,
    "time": 1729902162
  },
  {
    "id": 41951421,
    "title": "تستعد OSI لتعريف مثير للجدل للذكاء الاصطناعي مفتوح المصدر",
    "originLink": "https://lwn.net/SubscriberLink/995159/a37fb9817a00ebcb/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41951421",
    "commentBody": "",
    "originSummary": [
      "تستعد مبادرة المصدر المفتوح (OSI) لوضع اللمسات الأخيرة والتصويت على تعريف الذكاء الاصطناعي مفتوح المصدر (OSAID) في 27 أكتوبر 2024، مع النشر في اليوم التالي، بهدف تحديد ما يؤهل كنظام ذكاء اصطناعي مفتوح المصدر.",
      "أثارت التعريفات جدلاً داخل مجتمع المصادر المفتوحة، حيث يجادل النقاد بأنها لا تفي بالغرض لعدم إلزامها بإصدار بيانات التدريب، والتي يرونها ضرورية للحفاظ على مبادئ المصادر المفتوحة.",
      "يدافع المدير التنفيذي لـ OSI ستيفانو مافولي عن التعريف، مشددًا على أن تطويره شمل مدخلات من أصحاب مصلحة متنوعين ويهدف إلى تحقيق التوازن بين الشفافية والاعتبارات العملية."
    ],
    "commentSummary": [
      "تقوم مبادرة المصدر المفتوح (OSI) بتطوير تعريف مثير للجدل للذكاء الاصطناعي المفتوح المصدر، مما يؤدي إلى نقاشات حول ضرورة تضمين بيانات التدريب لنماذج الذكاء الاصطناعي ليتم اعتبارها مفتوحة المصدر.",
      "يجادل البعض بأن تعديل نماذج الذكاء الاصطناعي بدون الوصول إلى بيانات التدريب يشبه تعديل البرامج المجمعة بدون شفرة المصدر، بينما يرى آخرون أن أوزان نماذج الذكاء الاصطناعي هي \"المصدر\" للتعديلات.",
      "يسلط النقاش الضوء على وجهات النظر المختلفة حول المصدر المفتوح في الذكاء الاصطناعي، بما في ذلك مخاوف الملكية الفكرية ودور منظمة مبادرة المصدر المفتوح في وضع معايير المصدر المفتوح."
    ],
    "points": 107,
    "commentCount": 115,
    "retryCount": 0,
    "time": 1729902184
  },
  {
    "id": 41951773,
    "title": "روسيا ضاعفت من نشر المعلومات المضللة حول الأعاصير لتفريق الأمريكيين",
    "originLink": "https://abc7chicago.com/post/russia-amplified-hurricane-disinformation-drive-americans-apart-researchers-find/15463309/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41951773",
    "commentBody": "",
    "originSummary": [
      "تشير الأبحاث إلى أن روسيا تنشر معلومات مضللة حول استجابات الولايات المتحدة للأعاصير للتأثير على الخطاب السياسي قبل الانتخابات الرئاسية. - تستخدم وسائل الإعلام الحكومية الروسية والشبكات الاجتماعية صورًا مزيفة وادعاءات لتصوير القادة الأمريكيين على أنهم غير كفؤين، بهدف استغلال النقاشات القائمة وتقويض الثقة في الحكومة. - يتم نشر المعلومات المضللة على منصات ضعيفة الإشراف مثل X (المعروفة سابقًا بتويتر)، حيث يردد بعض السياسيين الأمريكيين، مثل النائب بول غوسار، هذه الروايات الروسية."
    ],
    "commentSummary": [
      "تُتهم روسيا بنشر معلومات مضللة حول الأعاصير لزرع الفتنة في الولايات المتحدة، مما يثير القلق بشأن التأثير الأجنبي.",
      "يجادل النقاد بأن الحكومة الأمريكية ومنصات وسائل التواصل الاجتماعي لا تعالج بشكل كافٍ هذه الجهود المتعلقة بالمعلومات المضللة.",
      "تؤكد الحالة على الجدل حول ما إذا كان ينبغي على الولايات المتحدة الرد بتكتيكات مماثلة أو التركيز على تثقيف الأفراد لتقييم المعلومات التي يواجهونها بشكل نقدي."
    ],
    "points": 102,
    "commentCount": 61,
    "retryCount": 0,
    "time": 1729906391
  },
  {
    "id": 41952908,
    "title": "الحكومة الفيدرالية: ليس لديك الحق في استعارة ألعاب الفيديو القديمة مثل كتب المكتبة",
    "originLink": "https://gizmodo.com/feds-say-you-dont-have-a-right-to-check-out-retro-video-games-like-library-books-2000516767",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41952908",
    "commentBody": "",
    "originSummary": [
      "رفض مكتب حقوق الطبع والنشر الأمريكي إعفاءً من قانون الألفية للملكية الرقمية (DMCA) كان سيمكن مؤرخي الألعاب من الوصول إلى ألعاب الفيديو التي لم تعد تُطبع، والتي تكون غير متوفرة بشكل كبير للشراء.",
      "سعى المحافظون إلى جعل هذه الألعاب متاحة بشكل مشابه للكتب في المكتبات، لكن القرار يحافظ على القيود، مما يسمح بالوصول لشخص واحد فقط في كل مرة، وبشكل شخصي.",
      "انتقدت مؤسسة تاريخ ألعاب الفيديو القرار، مشيرة إلى أنه يعيق جهود الحفظ وقد يدفع الباحثين إلى اللجوء إلى القرصنة، بينما تجادل مجموعات الصناعة بأن الوصول المجاني قد يؤثر سلبًا على سوق الألعاب الكلاسيكية."
    ],
    "commentSummary": [
      "تتناول المقالة عنوانًا مضللًا يتعلق بإعارة المكتبات لألعاب الفيديو القديمة، موضحة أنه بينما يُسمح بالإعارة الفعلية، فإن النسخ الرقمية للإعارة عن بُعد مقيدة بموجب قانون حقوق النشر الرقمية (DMCA).",
      "تسلط المناقشة الضوء على تحديات قوانين حقوق الطبع والنشر في الحفاظ على الألعاب القديمة والوصول إليها، حيث يدعو البعض إلى تغييرات قانونية للسماح بالوصول العام إلى الأعمال غير المتاحة تجاريًا.",
      "تمتد المناقشة إلى التأثير الأوسع لحقوق الطبع والنشر على الوسائط الرقمية وحفظ القطع الأثرية الثقافية، مع التأكيد على الحاجة إلى تحقيق توازن بين الحماية وإمكانية الوصول."
    ],
    "points": 96,
    "commentCount": 70,
    "retryCount": 0,
    "time": 1729922754
  },
  {
    "id": 41952779,
    "title": "نفذ كتل التعليمات البرمجية الخاصة بك في Markdown، الآن بلغة Go",
    "originLink": "https://github.com/dim0x69/mdx",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41952779",
    "commentBody": "",
    "originSummary": [
      "تم تطوير مشروع جديد يسمى mdx، مستوحى من makedown، للمساعدة في تعلم لغة البرمجة Go. تشمل الميزات الرئيسية لـ mdx تعريف التبعيات بين الأوامر، ودعم shebangs (توجيه تنفيذ السكربت)، وتمرير المعطيات إلى كتل الشيفرة. يسعى المطور للحصول على ملاحظات من المجتمع حول هذا المشروع، المتاح على GitHub."
    ],
    "commentSummary": [
      "يعد Mdx أداة جديدة تعتمد على لغة Go لتنفيذ كتل الشيفرة في Markdown، مستوحاة من makedown، وتتيح تعريف التبعيات، ودعم shebang، وتمرير المعاملات.",
      "المشروع مفتوح المصدر، ويدعو إلى تقديم الملاحظات والاقتراحات والمساهمات، مع مقارنات مع أدوات مثل runme.dev وxc وExecute Code for Obsidian.",
      "هناك احتمال لحدوث ارتباك مع الاسم \"mdx\"، حيث إنه مرتبط بالفعل بتقنية إطار عمل JavaScript."
    ],
    "points": 92,
    "commentCount": 42,
    "retryCount": 0,
    "time": 1729920860
  }
]
