[
  {
    "id": 42022151,
    "title": "Unen säännöllisyys on vahvempi kuolleisuuden ennustaja kuin unen kesto (2023)",
    "originLink": "https://academic.oup.com/sleep/article/47/1/zsad253/7280269",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42022151",
    "commentBody": "",
    "originSummary": [
      "Lehdessä \"Sleep\" julkaistu tutkimus osoittaa, että unen säännöllisyys on merkittävämpi kuolleisuusriskin ennustaja kuin unen kesto. - Analyysi yli 60 000 UK Biobank -osallistujan tiedoista osoitti, että johdonmukaiset unikuviot vähensivät kaiken syyn kuolleisuusriskin 20-48 %. - Tutkimus haastaa perinteiset terveysohjeet, jotka korostavat unen kestoa, ja tuo esiin säännöllisten uni-valve-aikojen ylläpitämisen tärkeyden paremman terveyden saavuttamiseksi."
    ],
    "commentSummary": [
      "Eräässä tutkimuksessa, johon osallistui 60 977 henkilöä, havaittiin, että unen säännöllisyys on vahvempi kuolleisuuden ennustaja kuin unen kesto, mikä viittaa siihen, että epäsäännölliset unikuviot voivat viitata kroonisiin unihäiriöihin.",
      "Tutkimuksen lyhyt tiedonkeruujakso on johtanut kritiikkiin, ja asiantuntijat vaativat pidempiaikaisia tietoja unen säännöllisyyden ja kuolleisuuden välisen yhteyden paremmaksi selvittämiseksi.",
      "Huolimatta rajoituksistaan, tutkimus korostaa säännöllisen unirytmin ylläpitämisen tärkeyttä yleisen terveyden kannalta."
    ],
    "points": 360,
    "commentCount": 221,
    "retryCount": 0,
    "time": 1730499803
  },
  {
    "id": 42022282,
    "title": "Nvidia liittyy Dow Jones Industrial Average -indeksiin, korvaten Intelin",
    "originLink": "https://www.cnbc.com/2024/11/01/nvidia-to-join-dow-jones-industrial-average-replacing-intel.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42022282",
    "commentBody": "",
    "originSummary": [
      "Nvidia korvaa Intelin Dow Jonesin teollisuusindeksissä 8. marraskuuta, mikä osoittaa merkittävää muutosta puolijohdeteollisuudessa.",
      "Nvidian markkina-arvo on noussut 3,3 biljoonaan dollariin, kun sen osakkeet ovat nousseet 170 % tänä vuonna, mikä johtuu suurelta osin sen tekoäly-GPU:iden korkeasta kysynnästä.",
      "Intel kohtaa haasteita, kuten laskeva osakearvo, työpaikkojen leikkaukset ja lisääntynyt kilpailu, mikä on vastakohta Nvidian viimeaikaiselle kasvulle ja menestykselle."
    ],
    "commentSummary": [
      "Nvidia korvaa Intelin Dow Jonesin teollisuusindeksissä (DJIA), mikä korostaa Nvidian kasvua tekoälyn ja GPU:n kysynnässä sekä Intelin viimeaikaisia haasteita.",
      "Tämä muutos on herättänyt keskustelua DJIA:n merkityksestä, sillä kriitikot väittävät, että sen hintapainotteinen luonne suosii korkeasti hinnoiteltuja osakkeita, mikä tekee siitä vähemmän edustavan markkinoiden kannalta.",
      "Monet pitävät S&P 500 -indeksiä tarkempana markkinaindikaattorina ja kyseenalaistavat DJIA:n nykyisen käytännön hyödyn sen historiallisesta merkityksestä huolimatta."
    ],
    "points": 352,
    "commentCount": 195,
    "retryCount": 0,
    "time": 1730500995
  },
  {
    "id": 42023089,
    "title": "Minun aikani työskentely Stripe:llä",
    "originLink": "https://jondlm.github.io/website/blog/leaving_stripe/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42023089",
    "commentBody": "",
    "originSummary": [
      "Jon de la Motte jakaa henkilökohtaisen kokemuksensa siitä, kuinka hän jätti työnsä Stripellä ilman, että hänellä oli varmistettua uutta työpaikkaa, korostaen pelon ja jännityksen sekoitusta tällaisen päätöksen tekemisessä.",
      "Huolimatta menestyksekkäästä urasta Stripellä, Jon kohtasi masennukseen ja motivaatioon liittyviä haasteita, mikä johti hänet pitämään taukoa mielenterveyden vuoksi.",
      "Hän saa inspiraatiota runosta omaksuakseen muutoksen ja toivoo voivansa yhdistää muihin, jotka saattavat tuntea itsensä eristyneiksi kamppailuissaan."
    ],
    "commentSummary": [
      "Kirjoittaja jakaa kokemuksensa Striipellä, jossa haastava työympäristö ja vaativa esimies johtivat ahdistukseen ja loppuunpalamiseen.",
      "Tämä kokemus korostaa mielenterveyden merkitystä, rajojen asettamista ja yrityskulttuurin vaikutusta henkilökohtaiseen hyvinvointiin.",
      "Kirjoittaja puoltaa mielenterveyden asettamista etusijalle, terapian hakemista ja työ- ja yksityiselämän tasapainon ylläpitämistä työuupumuksen lievittämiseksi."
    ],
    "points": 321,
    "commentCount": 293,
    "retryCount": 0,
    "time": 1730508282
  },
  {
    "id": 42021237,
    "title": "Linux Apple Siliconilla Alyssa Rosenzweigin kanssa [ääni]",
    "originLink": "https://softwareengineeringdaily.com/2024/10/15/linux-apple-silicon-alyssa-rosenzweig/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42021237",
    "commentBody": "",
    "originSummary": [
      "SEDaily Podcastissa Alyssa Rosenzweig keskustelee ponnisteluista Linuxin siirtämiseksi Applen ARM-pohjaisille siruille, jotka tunnetaan nimellä Apple Silicon, Asahi Linux -projektin kautta.",
      "Alyssa Rosenzweig, grafiikkakehittäjä, tarjoaa näkemyksiä Apple M1 GPU:n käänteismallinnuksesta ja Linux-pelaamisen edistysaskeleista.",
      "Tehtävä on haastava, koska Apple Siliconista ei ole virallista dokumentaatiota, mikä tekee projektista merkittävän sen teknisen monimutkaisuuden ja mahdollisen vaikutuksen vuoksi Linux-käyttäjiin."
    ],
    "commentSummary": [
      "Linuxin ajaminen Apple Siliconilla on vaikeaa Applen patentoitujen laitteistojen vuoksi, joihin kuuluu ainutlaatuisia ominaisuuksia, kuten ohjelmistolla säädelty kaiuttimen lämpötila.",
      "Asahi Linux -tiimi edistyy näiden järjestelmien käänteismuotoilussa, mutta huoli laitteistovaurioista ja yhteensopivuuden säilyttämisestä Applen päivitysten kanssa jatkuu.",
      "Projektin tavoitteena on pidentää Applen laitteiston käyttöikää ja tarjota vaihtoehtoja macOS:lle, korostaen jännitettä Applen suljetun ekosysteemin ja avoimen lähdekoodin yhteisön tavoitteiden välillä."
    ],
    "points": 270,
    "commentCount": 215,
    "retryCount": 0,
    "time": 1730493013
  },
  {
    "id": 42024727,
    "title": "Weird leksikaalinen syntaksi",
    "originLink": "https://justine.lol/lex/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42024727",
    "commentBody": "",
    "originSummary": [
      "Kehittäjä oppi 42 ohjelmointikieltä luodakseen syntaksin korostustyökalun projektille nimeltä llamafile, mikä korostaa ohjelmointikielten monimutkaisuutta ja monimuotoisuutta.",
      "Synaksin korostin, joka on optimoitu C++:lla ja GNU gperf:llä, keskittyy merkkijonoihin, kommentteihin ja avainsanoihin, käyttäen äärellisiä tilakoneita tehokkuuden saavuttamiseksi.",
      "Mozilla-sponsoroima projekti kannustaa yhteisön osallistumista Mozilla AI:n ja Redbean Discord-palvelimien kautta jatkokeskusteluihin."
    ],
    "commentSummary": [
      "Artikkeli tutkii eri ohjelmointikielten ainutlaatuisia syntaksipiirteitä, keskittyen erityisesti merkkijonojen interpolointiin ja kommenttien käsittelyyn. Se käsittelee syntaksin korostamisen haasteita, mainiten työkaluja kuten Vim, ja monimutkaisuutta käsitellä sisäkkäisiä kommentteja kielissä kuten C ja Standard ML. Teksti tarkastelee syntaksin kehitystä kielissä kuten Java ja C#, Unicoden roolia ja mahdollisuutta käyttää suuria kielimalleja (LLM) syntaksin korostamiseen."
    ],
    "points": 256,
    "commentCount": 106,
    "retryCount": 0,
    "time": 1730533526
  },
  {
    "id": 42024246,
    "title": "Kirjoita se uudelleen Railsilla",
    "originLink": "https://dirkjonker.bearblog.dev/rewrite-it-in-rails/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42024246",
    "commentBody": "",
    "originSummary": [
      "Kehittäjä kokeili aluksi useita ohjelmointikieliä ja -kehyksiä, kuten .NET/F#, Go, Rust ja React, ennen kuin valitsi Ruby on Railsin sen tuttuuden ja kehitysnopeuden vuoksi.",
      "Yritettiin luoda sovelluksen \"versio 2\" käyttämällä Rustia ja SvelteKitiä, mutta se osoittautui epäkäytännölliseksi puuttuvien ominaisuuksien ja laajan asennustarpeen vuoksi, mikä johti palaamiseen Railsiin.",
      "Kokemus korosti kompromisseja web-sovelluskehityksessä, jossa Ruby on Rails tarjoaa kypsän ekosysteemin, joka mahdollistaa kehittäjien keskittyä tuotekehitykseen infrastruktuurikysymysten sijaan."
    ],
    "commentSummary": [
      "Rails, Django ja Laravel ovat erittäin arvostettuja tehokkuutensa ja kattavien ominaisuuksiensa vuoksi verkkosovellusten kehityksessä, mikä tekee niistä suosittuja valintoja kehittäjien keskuudessa.",
      "Huolimatta uudemmista teknologioista, kuten Meteor, Remix ja Next.js, jotkut kehittäjät suosivat perinteisiä kehyksiä niiden helppokäyttöisyyden ja tuttuuden vuoksi.",
      "Verkkokehityskehyksen valinta riippuu usein projektin erityisvaatimuksista ja henkilökohtaisesta tuttuudesta, ja vaihtoehdot kuten Spring Boot ja Ktor tarjoavat erilaisia etuja, kuten integrointimahdollisuuksia ja staattista tyypitystä."
    ],
    "points": 178,
    "commentCount": 179,
    "retryCount": 0,
    "time": 1730525140
  },
  {
    "id": 42022649,
    "title": "Direct Sockets API Chromessa 131",
    "originLink": "https://chromestatus.com/feature/6398297361088512",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42022649",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Chrome 131:n Direct Sockets API tuo selaimiin suorat TCP/UDP-yhteydet, parantaen yhteensopivuutta olemassa olevien sovellusten kanssa ja mahdollistaen uusia verkottumismahdollisuuksia.",
      "Vaikka se voisi yksinkertaistaa käyttötapauksia verrattuna WebRTC DataChanneliin, on olemassa turvallisuushuolia mahdollisista haavoittuvuuksista paikallisissa verkoissa.",
      "Osana \"eristetyt verkkosovellukset\" -ehdotusta, tämä API pyrkii antamaan verkkosovelluksille samanlaisia ominaisuuksia kuin alkuperäisillä sovelluksilla, mikä on herättänyt keskustelua selainten turvallisuudesta ja luotetusta koodin suorittamisesta."
    ],
    "points": 159,
    "commentCount": 127,
    "retryCount": 0,
    "time": 1730504137
  },
  {
    "id": 42022796,
    "title": "Okta – Käyttäjänimi Yli 52 Merkin Turvatiedote",
    "originLink": "https://trust.okta.com/security-advisories/okta-ad-ldap-delegated-authentication-username/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42022796",
    "commentBody": "",
    "originSummary": [
      "Haavoittuvuus Okta:n AD/LDAP Delegated Authentication -järjestelmässä löydettiin, mikä mahdollisti potentiaalisen todennuksen pelkällä käyttäjänimellä, jos se oli 52 merkkiä tai pidempi.",
      "Asia oli esillä 23. heinäkuuta 2024 alkaen ja ratkaistiin 30. lokakuuta 2024 muuttamalla algoritmi Bcryptistä PBKDF2:ksi.",
      "Okta neuvoo asiakkaitaan tarkistamaan järjestelmälokit mahdollisten ongelmien varalta kyseisen ajanjakson aikana."
    ],
    "commentSummary": [
      "Okta:n tietoturvailmoitus paljastaa haavoittuvuuden, jossa yli 52 merkin pituiset käyttäjänimet voivat aiheuttaa salasanan katkaisun bcryptin 72 tavun rajoituksen vuoksi.",
      "Asia johtuu siitä, että bcryptiä käytetään välimuistiavaimen luomiseen yhdistämällä userId, käyttäjänimi ja salasana, mikä ei ole sen tarkoitettu käyttötapa.",
      "Neuvonta suosittelee erottamaan salasanan tallennuksen välimuistin avainten generoinnista ja ehdottaa HMAC:n (Hash-based Message Authentication Code) tai KDF:n (Key Derivation Function) käyttöä välimuistin avaimille, samalla kun se kritisoi bcryptin suunnittelua syötteen pituusvirheiden hallinnan tehottomuudesta."
    ],
    "points": 129,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1730505389
  },
  {
    "id": 42021535,
    "title": "Edullinen, kannettava laite voi havaita paksusuoli- ja eturauhassyövän tunnissa",
    "originLink": "https://medicalxpress.com/news/2024-10-portable-device-colorectal-prostate-cancer.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42021535",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Uusi edullinen ja kannettava laite voi havaita paksusuolen ja eturauhassyövän tunnissa, mikä voi parantaa seulontamääriä tarjoamalla mukavamman vaihtoehdon kolonoskopiaan verrattuna.",
      "Laite hyödyntää mikrofluiditekniikkaa parantaakseen syöpämerkkien havaitsemista, mikä ratkaisee kotitestien rajoitukset, jotka usein tuottavat paljon vääriä positiivisia tuloksia ja havaitsevat syövän myöhemmissä vaiheissa.",
      "Huolimatta lupaavista ominaisuuksistaan, laite vaatii riippumatonta testausta sen tehokkuuden ja luotettavuuden vahvistamiseksi lääketieteellisessä diagnostiikassa."
    ],
    "points": 122,
    "commentCount": 36,
    "retryCount": 0,
    "time": 1730494966
  },
  {
    "id": 42024342,
    "title": "Korttipelin Solitaire ahtaminen Nintendo E-Reader -kortille",
    "originLink": "https://mattgreer.dev/blog/cramming-solitaire-onto-a-nintendo-ereader-card/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42024342",
    "commentBody": "",
    "originSummary": [
      "Kehittäjä loi täysimittaisen pasianssipelin Nintendo E-Readerille, joka on vuonna 2002 julkaistu Game Boy Advance -lisälaite, joka käyttää pistekoodikortteja pelien lataamiseen.",
      "Kehitystyö sisälsi z80-formaatin käytön sen kompaktin koon vuoksi sekä haasteiden voittamisen E-Readerin rajoitetun z80-emulaattorin ja virheenkorjauksen vaikeuksien kanssa.",
      "Kehittäjä käytti E-Readerin ERAPI-rajapintaa ja loi Visual Studio Codeen debuggerin kehityksen avuksi, onnistuen sovittamaan Pasianssi-pelin yhdelle kortille."
    ],
    "commentSummary": [],
    "points": 118,
    "commentCount": 2,
    "retryCount": 0,
    "time": 1730527497
  },
  {
    "id": 42024661,
    "title": "SmolLM2",
    "originLink": "https://simonwillison.net/2024/Nov/2/smollm2/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42024661",
    "commentBody": "",
    "originSummary": [
      "SmolLM2 on Hugging Facen uusi perhe kompakteja kielimalleja, jotka ovat saatavilla 135M, 360M ja 1.7B parametrin kokoisina, ja ne on suunniteltu toimimaan tehokkaasti laitteilla.",
      "Nämä mallit koulutettiin 11 biljoonalla tokenilla monipuolisista tietoaineistoista, ja niiden painot on julkaistu Apache 2 -lisenssillä, mikä mahdollistaa laajan käytön ja muokkauksen.",
      "Simon Willison jakaa positiivisia ensivaikutelmia ja antaa ohjeita mallien käyttämiseen llm-gguf-liitännäisen avulla, ja yksityiskohtainen blogikirjoitus SmolLM2:sta on odotettavissa pian."
    ],
    "commentSummary": [
      "On olemassa useita tapoja ajaa Hugging Face -malleja Docker-kontissa web-API:n kanssa, mukaan lukien FastAPI-kääreiden käyttö tai Ollaman sisäänrakennettu tuki gguf-malleille OpenAI-yhteensopivan HTTP-päätepisteen avulla.",
      "Hugging Face TGI tukee laajaa valikoimaa malleja ja API-rajapintoja, kun taas SmolLM2, joka tukee ensisijaisesti englantia, ylittää raporttien mukaan Metan mallit korkealaatuisen koulutusdatan ansiosta ja pystyy käsittelemään jopa 8192 tokenia.",
      "Kasvava kiinnostus pieniin malleihin selaimen käyttöön ja kuvasyötteisiin liittyy keskusteluihin itse julkaistujen arviointien luotettavuudesta ja LLM:ien houkuttelevuudesta niiden keinotekoisten päättelykykyjen vuoksi."
    ],
    "points": 108,
    "commentCount": 41,
    "retryCount": 0,
    "time": 1730532660
  },
  {
    "id": 42027564,
    "title": "Britannian sodanjälkeinen sokerihimo vahvistaa makeiden ruokavalioiden haitat varhaisessa iässä",
    "originLink": "https://www.science.org/content/article/britain-s-postwar-sugar-craze-confirms-harms-sweet-diets-early-life",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42027564",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Britannian sodanjälkeinen sokerihimo korostaa korkean sokerin kulutuksen mahdollisia kielteisiä vaikutuksia varhaisessa elämässä, yhdistäen ne terveysongelmiin kuten diabetekseen ja verenpainetautiin.",
      "Huolimatta sokerinkulutuksen vähenemisestä Yhdysvalloissa vuosina 2000-2020, tyypin 2 diabeteksen esiintyvyys on lisääntynyt, mikä on herättänyt keskustelua sokerin aineenvaihdunnallisista haitoista verrattuna muihin tekijöihin, kuten elämäntapaan ja elintarvikkeiden suunnitteluun.",
      "Tutkimukset osoittavat, että sokerin saannin rajoittaminen varhaisessa iässä saattaa vähentää diabeteksen ja verenpainetaudin kehittymisen riskiä, vaikka keskustelut jatkuvat muiden ruokavalion osatekijöiden, kuten omega-rasvahappojen ja kokonaiskalorimäärän, vaikutuksesta."
    ],
    "points": 104,
    "commentCount": 36,
    "retryCount": 0,
    "time": 1730566586
  }
]
