[
  {
    "id": 37926849,
    "title": "Kommersiellt tillgängliga stolar i Star Trek",
    "originLink": "https://www.ex-astris-scientia.org/database/chairs-trek.htm",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37926849",
    "commentBody": "",
    "originSummary": [
      "Artikeln innehåller en uttömmande lista över stolar som förekommer i Star Trek-serien och filmerna.",
      "Den beskriver också stolarnas utformning, deras tillverkare och deras förekomst i olika avsnitt och scener.",
      "Detta tillvägagångssätt ger en ovanlig vinkel på Star Trek-serien och fokuserar på en ofta förbisedd aspekt av scenografin."
    ],
    "commentSummary": [
      "Samtalet kretsar kring hur vardagsföremål och möbler återanvänds som futuristisk rekvisita i sci-fi-filmer och serier som Star Wars och Star Trek, en teknik som tittarna ofta inte märker av.",
      "I diskussionen undersöks den visuella stilen, scenografin och rekvisitan i den ursprungliga Star Trek-serien, gamla James Bond-filmer och designen i Deep Space Nine (DS9).",
      "Deltagarna i samtalet fördjupar sig i hur Stjärnflottan, diplomatiska relationer och komedi skildras i Star Trek-universumet och uttrycker sin kärlek till serien samtidigt som de noterar vissa besvärande aspekter."
    ],
    "points": 643,
    "commentCount": 201,
    "retryCount": 0,
    "time": 1697624891
  },
  {
    "id": 37927344,
    "title": "Vad är Demoscene? En intervju",
    "originLink": "https://onthearts.com/p/what-is-the-demoscene",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37927344",
    "commentBody": "",
    "originSummary": [
      "Demoscenen är en subkultur inom digital konst som fokuserar på att skapa och dela demos, som är audiovisuella presentationer. Denna gemenskap, som ursprungligen var kopplad till piratkopiering av spel, består nu av konstnärer, programmerare och ingenjörer över hela världen.",
      "Demoscene har uppnått status som ett immateriellt kulturarv, med \"demoparties\" som en viktig plats för skapare att visa upp och tävla med sina demos.",
      "För personer som är intresserade av denna kultur finns det många resurser tillgängliga, inklusive onlineplattformar, tävlingar, evenemang och communityplattformar som Discord-servrar. Guider, videor och podcasts finns också för att hjälpa nybörjare att förstå och delta i demoscene-kulturen."
    ],
    "commentSummary": [
      "Diskussionen kretsar kring demoscenen, en grupp teknikentusiaster som skapar audiovisuella demonstrationer, med tonvikt på personliga erfarenheter, demoscenens utveckling, dess inverkan på deltagarnas liv och branschen.",
      "Diskussionen berör även de tekniska och konstnärliga aspekterna av demos, delar med sig av sina favoriter och rekommenderar resurser för blivande medlemmar.",
      "I motsats till påståenden om dess undergång fortsätter demoscenen - betraktad som en konstform och ett bevis på programmeringskunskaper - att blomstra och utvecklas."
    ],
    "points": 512,
    "commentCount": 209,
    "retryCount": 0,
    "time": 1697629736
  },
  {
    "id": 37931383,
    "title": "Hackare läcker miljontals fler användaruppgifter från 23andMe på forum för cyberbrottslighet",
    "originLink": "https://techcrunch.com/2023/10/18/hacker-leaks-millions-more-23andme-user-records-on-cybercrime-forum/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37931383",
    "commentBody": "",
    "originSummary": [
      "En hackare, kallad Golem, har offentliggjort miljontals nya användaruppgifter från 23andMe, ett företag som utför genetiska tester, på ett forum för cyberbrottslighet.",
      "Hackaren påstår att datasetet innehåller information om användare främst från Storbritannien och rikare individer från USA och Västeuropa. 23andMe håller för närvarande på att granska legitimiteten hos de läckta uppgifterna.",
      "Detta läckage kommer efter att 23andMe tillkännagav ett dataintrång för två veckor sedan. Det är fortfarande osäkert hur mycket användardata som stulits och dess avsedda användning. Som svar har 23andMe uppmuntrat användare att uppdatera sina lösenord och implementera multifaktorautentisering."
    ],
    "commentSummary": [
      "Samtalet kretsar kring 23andMe:s integritetsproblem i samband med genetiska tester, där användarna ifrågasätter företagets förmåga att skydda data och potentiellt missbruk av genetisk information.",
      "Oro för potentiell diskriminering från arbetsgivare och missbruk av brottsbekämpande myndigheter på grund av delad genetisk information uttrycks, och de potentiella riskerna och konsekvenserna betonas.",
      "Användarnas perspektiv varierar, där vissa förespråkar starkare reglering och datasäkerhetsåtgärder för genetiska testföretag, medan andra minimerar riskerna och betonar individens ansvar för datasäkerheten. Detta visar på ett övergripande behov av förbättrat integritetsskydd för genetiska data."
    ],
    "points": 444,
    "commentCount": 339,
    "retryCount": 0,
    "time": 1697647978
  },
  {
    "id": 37931373,
    "title": "Reflect - Ramverk för webbappar för flera spelare med synkronisering av spelstil",
    "originLink": "https://rocicorp.dev/blog/ready-player-two",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37931373",
    "commentBody": "",
    "originSummary": [
      "Reflect är ett nytt ramverk för utveckling av webbappar för flera spelare, utvecklat från en tidigare teknik, Replicache. Den kombinerar spelliknande tillståndssynkronisering och Transactional Conflict Resolution för effektiv datasynkronisering mellan användare.",
      "Till skillnad från nuvarande CRDT-metoder (Conflict-free Replicated Data Type) ger Reflect ytterligare flexibilitet och enkelhet till funktioner som räknare, listoperationer och invarianthantering.",
      "Reflects hanterade server fungerar som en auktoritet som utför mutationer enligt sina regler och tillhandahåller schemavalidering och enkla migreringar. Serverns roll och funktioner belyser Reflects mål: att leverera en kraftfull, flexibel och intuitiv plattform för att skapa applikationer för flera spelare."
    ],
    "commentSummary": [
      "Reflect är ett ramverk för webbappar som möjliggör samarbete och synkronisering i realtid mellan flera användare, med konfliktlösning och pusselläggning.",
      "Ramverket använder Reflect/Replicache-systemet, som använder Relative Addressable Object Locator (RAOL) för att replikera lokala uppdateringar mellan enheter och hjälper till att övervinna utmaningar i realtidssamarbete.",
      "Reflect fungerar som en hostad tjänst som gör det enkelt att lägga till samarbete mellan flera spelare i webbapplikationer med hjälp av TCR-system (Test-Confirm-Reverse) istället för CRDT-system (Conflict-free Replicated Data Type)."
    ],
    "points": 364,
    "commentCount": 129,
    "retryCount": 0,
    "time": 1697647913
  },
  {
    "id": 37929338,
    "title": "Jämförelse USB-C mot USB-C",
    "originLink": "https://www.lumafield.com/article/usb-c-cable-charger-head-to-head-comparison-apple-thunderbolt-amazon-basics",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37929338",
    "commentBody": "",
    "originSummary": [
      "I artikeln jämförs olika USB-C-kablar, inklusive Apples Thunderbolt 4-kabel och billigare alternativ som Amazon Basics, NiceTQ och ATYFUER-kablar.",
      "Thunderbolt 4 beskrivs som en högkvalitativ kontakt med hölje i rostfritt stål, dragavlastning och flera stift för olika dataöverförings- och laddningsalternativ.",
      "Artikeln understryker behovet av att ta hänsyn till faktorer som data- och kraftöverföring, konstruktion, formfaktor och livslängd när man väljer kablar."
    ],
    "commentSummary": [
      "Diskussionen kretsar kring USB-C-kablar, deras tillverkningsprocesser och de vanligaste problemen, inklusive att alla 24 stift i kabeln inte är anslutna till varandra och ett krav på tydlig märkning och certifiering.",
      "Den belyser svårigheterna med att skilja mellan olika kabelegenskaper, problemet med förfalskade kablar, komplexiteten i USB-C-kabelns varumärke och frustrationen över vilseledande kablar som säljs på plattformar som Amazon.",
      "Andra viktiga punkter är användningen av repeaters eller retimers för att motverka signalförlust, överdesignen av kablar för höga dataöverföringshastigheter, Apples egenutvecklade kontakter och EU:s krav på standardisering för att minska elektronikavfallet."
    ],
    "points": 347,
    "commentCount": 198,
    "retryCount": 0,
    "time": 1697639903
  },
  {
    "id": 37939269,
    "title": "Jag är förbjuden på livstid att annonsera på Meta. För att jag undervisar i Python.",
    "originLink": "https://lerner.co.il/2023/10/19/im-banned-for-life-from-advertising-on-meta-because-i-teach-python/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37939269",
    "commentBody": "",
    "originSummary": [
      "Reuven, en Python- och Pandas-instruktör, har permanent förbjudits att annonsera på Meta-plattformen, tidigare känd som Facebook.",
      "Det spekuleras i att Metas AI-system felaktigt kan ha kopplat Reuvens Python- och Pandas-kurser till levande djur, vilket ledde till förbudet.",
      "Trots att han överklagade beslutet verkar det osannolikt att förbudet återkallas på grund av Metas policy för datalagring. Reuven har nu för avsikt att annonsera sina kurser på andra plattformar och kritiserar Metas beroende av AI för beslut utan mänsklig tillsyn."
    ],
    "commentSummary": [
      "I artikeln beskrivs problem med Facebook/Metas bannlysningssystem, särskilt brist på transparens, automatiseringsfel och avsaknad av mänsklig granskning.",
      "Författaren betonar behovet av bättre kundsupport, risken för missbruk i AI-drivna system och den överdrivna makt som utövas av slutna plattformar som Facebook och Google.",
      "Texten understryker behovet av ökad transparens, ansvarsskyldighet och en mer betydande mänsklig roll i beslutsprocesser över flera tekniska plattformar."
    ],
    "points": 251,
    "commentCount": 138,
    "retryCount": 0,
    "time": 1697697138
  },
  {
    "id": 37938183,
    "title": "Localsend: Alternativ till Airdrop med öppen källkod",
    "originLink": "https://github.com/localsend/localsend",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37938183",
    "commentBody": "",
    "originSummary": [
      "LocalSend, en gratis app med öppen källkod, möjliggör säker fil- och meddelandedelning mellan enheter i närheten utan internetanslutning. Den använder sig av ett REST API och HTTPS-kryptering.",
      "Appen är inte beroende av externa servrar och dess källkod, som är byggd med Flutter, kan laddas ner fritt. Den finns tillgänglig på olika plattformar.",
      "Med över 16 000 stjärnor på GitHub accepterar projektet bidrag som översättningar, buggfixar och förbättringar. Projektet sponsras av Tien Do Nam."
    ],
    "commentSummary": [
      "Diskussionen kretsar kring open source-ersättningar för Apples Airdrop, med fokus på plattformsoberoende fildelningslösningar som Localsend, Trebleshot, LocalShare, PairDrop, KDEConnect och Magic Wormhole.",
      "Deltagarna uttrycker missnöje med bristen på interoperabilitet mellan dessa plattformar och föreslår att de slås samman till en enda applikation.",
      "Samtalet handlar också om begränsningarna för Wi-Fi Direct och de kommersiella motiv som hindrar utvecklingen av plattformsoberoende fildelning."
    ],
    "points": 243,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1697687805
  },
  {
    "id": 37927734,
    "title": "Ett experiment från 1990 för att testa om vi kunde urskilja liv på jorden på distans",
    "originLink": "https://www.nature.com/articles/d41586-023-03230-z",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37927734",
    "commentBody": "",
    "originSummary": [
      "Carl Sagans studie från 1990 ledde till ett perspektivskifte i jakten på tecken på liv på andra planeter, då rymdfarkosten Galileo identifierade syre, metan, växtlighet och konstruerade radiosändningar på jorden.",
      "Hans studie utgör grunden för det nuvarande sökandet efter tecken på liv på andra planeter, en uppgift som blir särskilt viktig när rymdteleskopet James Webb utforskar exoplaneternas atmosfärer.",
      "Artikeln understryker hur komplicerat det är att hitta och bekräfta tecken på liv, och betonar behovet av flera lager av bevis och validering. Sökandet kan sträcka sig över år eller årtionden, vilket kräver noggranna undersökningar och debatter inom det vetenskapliga samfundet."
    ],
    "commentSummary": [
      "Avsnittet diskuterar svårigheterna och begränsningarna med nuvarande metoder för att upptäcka liv på andra planeter och utforskar möjligheten till icke-kolbaserade livsformer.",
      "Den betonar kolets roll i livets komplexitet och beaktar den potentiella upptäckten av komplexa molekyler och alternativ kemi under extrema förhållanden.",
      "Diskussionerna sträcker sig till möjligheten av olika livsformer bortom vår nuvarande förståelse och olika perspektiv på naturen, inklusive möjligheterna till utomjordisk intelligens. Ämnena täcker också tecken på liv på andra planeter, tekniska begränsningar och potentialen för främmande civilisationer som observerar jorden."
    ],
    "points": 231,
    "commentCount": 125,
    "retryCount": 0,
    "time": 1697632649
  },
  {
    "id": 37927357,
    "title": "GPT-4 vision snabb injektion",
    "originLink": "https://blog.roboflow.com/gpt-4-vision-prompt-injection/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37927357",
    "commentBody": "",
    "originSummary": [
      "Blogginlägget beskriver en cybersäkerhetssårbarhet som kallas \"Prompt Injection\", där skadlig data manipuleras till textmeddelanden som äventyrar systemsäkerheten.",
      "Den belyser en ny manifestation av denna sårbarhet, \"Visual Prompt Injection\", där direktiv kamoufleras i bilder så att en språkmodell, t.ex. GPT-4, kan följa dem.",
      "Både OpenAI och Microsoft forskar aktivt på försvar mot prompt injection, vilket visar hur viktigt detta problem är och understryker behovet av att ta hänsyn till det när man skapar språkmodellbaserade tjänster."
    ],
    "commentSummary": [
      "Artikeln belyser en allvarlig säkerhetsbrist, kallad \"prompt injection\", i stora språkmodeller som GPT-4. Denna sårbarhet innebär att en otillförlitlig prompt åsidosätter en betrodd prompt, vilket kan äventyra applikationens säkerhet.",
      "Den går in på komplexiteten i anpassningen av AI-system och begränsningarna i befintliga modeller, vilket understryker behovet av en försiktig användning av stora språkmodeller.",
      "Som ett resultat av dessa hot betonar artikeln nödvändigheten av lösningar och ökade säkerhetsåtgärder för att bekämpa sådana exploaterbara mottagligheter."
    ],
    "points": 231,
    "commentCount": 103,
    "retryCount": 0,
    "time": 1697629823
  },
  {
    "id": 37930266,
    "title": "Nytt piller gör att lukt- och smakförlusterna snabbt försvinner",
    "originLink": "https://www.nature.com/articles/d41586-023-03244-7",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37930266",
    "commentBody": "",
    "originSummary": [
      "Ensitrelvir, ett nytt antiviralt läkemedel, har visat sig ha potential att lindra smak- och luktförlust orsakad av covid-19, vilket skiljer det från andra behandlingsmetoder.",
      "Till skillnad från andra behandlingar är ensitrelvir tillgängligt för personer med milda till måttliga symtom, inte bara för högriskpersoner.",
      "Japan har beviljat akut godkännande för läkemedlet och det genomgår för närvarande ytterligare kliniska prövningar, efter uppmuntrande resultat från tidigare prövningar där det minskade andelen deltagare som upplevde lukt- och smakförlust jämfört med placebo."
    ],
    "commentSummary": [
      "Diskussionens huvudtema är förlust av smak och lukt som symtom på covid-19, och deltagarna delar med sig av sina erfarenheter av anosmi och möjliga behandlingar som capsaicin-nässpray och laktoferrinbaserade produkter.",
      "Samtalen fokuserar också på hur dessa symtom påverkar matglädjen, metoder för återhämtning och möjligheten att använda olika covidvarianter för specifika kroppsområden.",
      "Användningen av kosttillskott och antivirala läkemedel, inklusive Paxlovid som är känt för sin effektivitet när det gäller att hämma virusreplikation, och det nya läkemedlet ensitrelvir, diskuteras också flitigt, vilket återspeglar deras potentiella inverkan på att minska symtomens svårighetsgrad och frekvens."
    ],
    "points": 230,
    "commentCount": 129,
    "retryCount": 0,
    "time": 1697643606
  },
  {
    "id": 37927255,
    "title": "Sverige rapporterar skada på Östersjökabel med Estland",
    "originLink": "https://www.dw.com/en/sweden-reports-damage-to-baltic-sea-cable-with-estonia/a-67126637",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37927255",
    "commentBody": "",
    "originSummary": [
      "Sverige har rapporterat skador på sin undervattenskabel med Estland, vilket sammanfaller med skador på en gasledning och kabel mellan Finland och Estland.",
      "Sveriges och Finlands senaste strävan att gå med i Nato, efter Rysslands invasion av Ukraina, är en intressant bakgrund till dessa händelser.",
      "Även om orsaken till skadorna fortfarande är oklar har utredningar inletts. Denna händelse belyser den ökande oron över sårbarheten hos kritisk infrastruktur i Östersjöregionen."
    ],
    "commentSummary": [
      "Diskussionen betonar betydelsen av lokala servrar för finansinstitut efter att en Östersjökabel mellan Sverige och Estland skadats.",
      "Olika alternativa metoder för att erhålla tidssignaler beaktas, tillsammans med potentialen för sabotage av sjökablar och allmänna sårbarheter hos sjökablar.",
      "Satellitinternets begränsningar, konkurrensen mellan sjökablar och Starlink samt historiska händelser som involverar Ryssland tas också upp, liksom ljusets hastighet i rymden, fördelarna med satellitinternet och Starlinks kapacitet."
    ],
    "points": 225,
    "commentCount": 179,
    "retryCount": 0,
    "time": 1697628781
  },
  {
    "id": 37931424,
    "title": "Forskare upptäcker samband mellan Alzheimers sjukdom och tarmens mikrobiota",
    "originLink": "https://www.kcl.ac.uk/news/links-between-alzheimers-and-gut-microbiota",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37931424",
    "commentBody": "",
    "originSummary": [
      "I en nyligen genomförd studie upptäcktes ett samband mellan tarmbakterier, inflammation och förändringar i hjärnan i samband med Alzheimers sjukdom, vilket tyder på att symtomen kan överföras via tarmbakterier.",
      "Studien, som leddes av experter från University College Cork och King's College London, understryker betydelsen av tarmmikrobiota som ett potentiellt fokus för forskning och intervention vid Alzheimers sjukdom.",
      "Resultaten tyder på att utforskandet av tarmmikrobernas roll i de inledande stadierna av demens skulle kunna bana väg för nya behandlingsmetoder för Alzheimers, den vanligaste orsaken till demens."
    ],
    "commentSummary": [
      "Forskare har identifierat en preliminär koppling mellan Alzheimers sjukdom och tarmens mikrobiota, vilket tyder på att den kan spela en bidragande roll i sjukdomen.",
      "Möjliga förebyggande åtgärder inkluderar ökat intag av omega-3-fettsyror och vissa vitaminer, en tarmvänlig kost samt eventuella fördelar med GLP-1-agonister, samtidigt som försiktighet bör iakttas på grund av Alzheimers komplexa natur.",
      "Ytterligare forskning krävs för att till fullo förstå omfattningen och arten av den roll som tarmmikrobiotan spelar vid Alzheimers sjukdom. I studien diskuterades också potentiella behandlingar som antibiotika och fekala transplantationer."
    ],
    "points": 224,
    "commentCount": 73,
    "retryCount": 0,
    "time": 1697648165
  },
  {
    "id": 37927480,
    "title": "Varför är texten om stämningsansökan grå i låg kontrast på HN?",
    "originLink": "https://news.ycombinator.com/item?id=37927480",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37927480",
    "commentBody": "",
    "originSummary": [
      "Texten i fokus är svår att läsa och orsakar ansträngda ögon, vilket väcker frågor om dess utformning.",
      "Detta problem har gett upphov till spekulationer om det var ett genomtänkt designval eller ett oönskat fel."
    ],
    "commentSummary": [],
    "points": 220,
    "commentCount": 122,
    "retryCount": 0,
    "time": 1697630766
  },
  {
    "id": 37930634,
    "title": "Bluffen med den falska uppdateringen av webbläsaren får en makeover",
    "originLink": "https://krebsonsecurity.com/2023/10/the-fake-browser-update-scam-gets-a-makeover/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37930634",
    "commentBody": "",
    "originSummary": [
      "Bedrägeriet med webbläsaruppdateringar, där användare luras att ladda ner skadlig kod under sken av en webbläsaruppdatering, har återuppstått genom att hackare nu hostar skadliga filer på en decentraliserad blockkedja för kryptovalutor.",
      "Angriparna använder Binance Smart Chain, en teknik som möjliggör lagring av deras skadliga filer som kryptovalutatransaktioner, vilket gör det svårare för säkerhetsexperter att spåra och eliminera den skadliga programvaran.",
      "Guardio Labs, ett cybersäkerhetsföretag, har upptäckt minst fyra grupper av hotaktörer som utnyttjar dessa vilseledande webbläsaruppdateringar för att sprida skadlig kod."
    ],
    "commentSummary": [
      "Ett nytt bedrägeri med skadlig kod använder blockkedjeteknik (Binance Smart Chain) för att undvika att tas bort av tjänster som Cloudflare. BSC har svarat med att svartlista inblandade adresser.",
      "Unika problem med blockkedjeteknik diskuteras, bland annat missbruk av BSC:s värdtjänster, dess konsekvenser för integritet och spårbarhet, oönskat innehåll och behovet av att nodoperatörer hanterar dessa frågor på ett ansvarsfullt sätt.",
      "Man pekar på ökningen av bedrägerier med fullscreen takeover, JavaScript:s inverkan på webbsäkerhet och användarupplevelse, betydande sårbarheter i populära plattformar som WordPress och centraliserad kontroll i blockkedjesystem."
    ],
    "points": 209,
    "commentCount": 150,
    "retryCount": 0,
    "time": 1697644961
  },
  {
    "id": 37938636,
    "title": "Bandcamps hela fackliga förhandlingsteam avskedades",
    "originLink": "https://www.404media.co/bandcamps-entire-union-bargaining-team-was-laid-off/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37938636",
    "commentBody": "",
    "originSummary": [
      "Musiklicensieringsföretaget Songtradr sade upp hela Bandcamps fackliga förhandlingsteam när de förvärvade plattformen från Epic Games.",
      "Songtradr hävdade att uppsägningarna inte var kopplade till fackliga aktiviteter eftersom de inte hade tillgång till information om fackliga medlemmar, men facket hävdar att de hade ett möte med Songtradrs VD.",
      "Personalförändringarna ledde till en halvering av Bandcamps redaktionella team och uppsägningar av 12 av 13 fackligt anslutna supportmedarbetare."
    ],
    "commentSummary": [
      "Bandcamps fackliga förhandlingsteam har sagts upp, vilket har lett till tvivel om eventuell diskriminering och utmaningar när det gäller lagligheten och rättvisan i en sådan åtgärd.",
      "Inlägget går in på de bredare konsekvenserna av uppsägningar - deras inverkan på individer, ekonomin och fördelarna med fackföreningar - samt Bandcamps nedgång efter förvärvet.",
      "Samtalet sträcker sig till att jämföra fackföreningar i USA och Europa och diskuterar begrepp som individualism, producent- och konsumentöverskott, prisdiskriminering och värdet av arbete."
    ],
    "points": 204,
    "commentCount": 120,
    "retryCount": 0,
    "time": 1697691443
  }
]
