[
  {
    "title": "Apple Improves iMessage Security With Contact Key Verification",
    "originLink": "https://www.securityweek.com/apple-improves-imessage-security-with-contact-key-verification/",
    "originBody": "This website stores cookies on your computer. These cookies are used to improve your website experience and provide more personalized services to you, both on this website and through other media. To find out more about the cookies we use, see our Privacy Policy. We won't track your information when you visit our site. But in order to comply with your preferences, we'll have to use just one tiny cookie so that you're not asked to make this choice again. Accept Decline CONFERENCE 2023 ICS Cybersecurity Conference - Watch On Demand SECURITYWEEK NETWORK: Cybersecurity News Webcasts Virtual Events ICS Cybersecurity Conference Malware & Threats Security Operations Security Architecture Risk Management CISO Strategy ICS/OT Funding/M&A Cybersecurity News Webcasts Virtual Events ICS Cybersecurity Conference CONNECT WITH US Hi, what are you looking for? Malware & Threats Cyberwarfare Cybercrime Data Breaches Fraud & Identity Theft Nation-State Ransomware Vulnerabilities Security Operations Threat Intelligence Incident Response Tracking & Law Enforcement Security Architecture Application Security Cloud Security Endpoint Security Identity & Access IoT Security Mobile & Wireless Network Security Risk Management Cyber Insurance Data Protection Privacy & Compliance Supply Chain Security CISO Strategy Cyber Insurance CISO Conversations CISO Forum ICS/OT Industrial Cybersecurity ICS Cybersecurity Conference Funding/M&A Cybersecurity Funding M&A Tracker DATA PROTECTION Apple Improves iMessage Security With Contact Key Verification New capability detects attacks on iMessage servers and allows users to verify a conversation partner’s identity. By Ionut Arghire October 30, 2023 Flipboard Reddit Pinterest Whatsapp Email Apple on Friday introduced contact key verification, a new capability meant to improve the security of its iMessage service. To ensure the privacy of conversations, iMessage offers end-to-end encryption, so that only the sender and receiver can read a message, and relies on sets of encryption keys, where public keys are stored on a key directory service, while private keys rest on the device and never leave it. Key directory services, like Apple’s identity directory service, represent a single point of failure, where a powerful adversary may be able to compromise the service to intercept or monitor encrypted messages. To address the shortcoming, iMessage contact key verification, Apple explains, relies on key transparency, a mechanism that uses a verifiable log-backed map data structure to deliver cryptographic proofs of inclusion, ensuring user privacy and allowing audits. “iMessage contact key verification advances the state of the art of key transparency deployments by having user devices themselves verify consistency proofs and ensure consistency of the KT system across all user devices for an account,” Apple says. This mechanism, the tech giant notes, is meant to protect against both key directory and transparency service compromises, allowing changes to the log-backed map while making device keys immediately verifiable. iMessage contact key verification, Apple explains, uses an account-level elliptic curve digital signature algorithm (ECDSA) signing key that is generated on the device, stored in iCloud keychain, and available to the user on their trusted devices only. ADVERTISEMENT. SCROLL TO CONTINUE READING. “Each device uses the synchronized account key to sign its iMessage public keys. The account keys and signatures are included in the IDS service database along with the existing data,” Apple notes. When the user enables iMessage contact key verification, their devices verify that the key transparency map includes the data presented by the identity directory service, and notifies the user if a validation error occurs. Users’ devices will periodically query the service for account information, verify the response against the key transparency mechanism, and flag inconsistencies. “[The user’s] devices will additionally compare the KT data for identifiers, device records, and opt-in state against records stored in an end-to-end encrypted CloudKit container. This database is maintained by [the user’s] devices and is not readable or modifiable by Apple,” the tech giant explains. Additionally, iMessage contact key verification allows users to perform manual contact verification code comparisons using the Vaudenay SAS protocol. Upon successful verification, the hash of the peer’s account key is saved to an end-to-end encrypted CloudKit container and linked to the peer’s card. “Because the contact card is linked, all conversations with the peer’s identifiers — phone number and email address — are marked as verified. Group chats with peers that have been independently verified one-to-one are also automatically marked as verified,” Apple explains. iMessage contact key verification is now available in the developer previews of iOS 17.2, macOS 14.2, and watchOS 10.2. Related: Stealth Techniques Used in ‘Operation Triangulation’ iOS Attack Dissected Related: Apple Patches Actively Exploited iOS, macOS Zero-Days Related: NSO Group Used at Least 3 iOS Zero-Click Exploits in 2022: Citizen Lab WRITTEN BY Ionut Arghire Ionut Arghire is an international correspondent for SecurityWeek. More from Ionut Arghire Chrome 119 Patches 15 Vulnerabilities Malicious NuGet Packages Abuse MSBuild Integrations for Code Execution SIEM and Log Management Provider Graylog Raises $39 Million Atlassian CISO Urges Quick Action to Protect Confluence Instances From Critical Vulnerability IAM Credentials in Public GitHub Repositories Harvested in Minutes Attackers Exploiting Critical F5 BIG-IP Vulnerability Florida SIM Swapper Sentenced to Prison for Cryptocurrency Theft Boeing Investigating Ransomware Attack Claims Latest News Chrome 119 Patches 15 Vulnerabilities MITRE Releases ATT&CK v14 With Improvements to Detections, ICS, Mobile DPI: Still Effective for the Modern SOC? Malicious NuGet Packages Abuse MSBuild Integrations for Code Execution Cutting-Edge AI Raises Fears About Risks to Humanity. Are Tech and Political Leaders Doing Enough? SIEM and Log Management Provider Graylog Raises $39 Million Former British Cyberespionage Agency Employee Gets Life in Prison for Stabbing an American Spy Cybersecurity Leaders Spooked by SEC Lawsuit Against SolarWinds CISO TRENDING Cisco Finds Second Zero-Day as Number of Hacked Devices Apparently Drops SEC Charges SolarWinds and Its CISO With Fraud and Cybersecurity Failures Boeing Investigating Ransomware Attack Claims Attackers Can Use Modified Wikipedia Pages to Mount Redirection Attacks on Slack Cybersecurity Leaders Spooked by SEC Lawsuit Against SolarWinds CISO Canada Bans WeChat and Kaspersky on Government Phones Biden Wants to Move Fast on AI Safeguards and Will Sign an Executive Order to Address His Concerns VMware vCenter Flaw So Critical, Patches Released for End-of-Life Products Daily Briefing Newsletter Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts. Webinar Beyond VPN Replacement: Other ZTNA superpowers CISOs Should Know Tuesday, August 22, 2023 Join security experts as they discuss ZTNA’s untapped potential to both reduce cyber risk and empower the business. Register Webinar: Scaling Software Supply Chain Security: Driving Actionable SBOM Management with the OpenSSF S2C2F OSS Specification Thursday, September 7, 2023 Join Microsoft and Finite State for a webinar that will introduce a new strategy for securing the software supply chain. Register EXPERT INSIGHTS DPI: Still Effective for the Modern SOC? There has been an ongoing debate in the security industry over the last decade or so about whether or not deep packet inspection (DPI) is dead. (Matt Wilson) Extending ZTNA to Protect Against Insider Threats One of the main reasons why ZTNA fails is that most ZTNA implementations tend to focus entirely on securing remote access. (Etay Maor) Key Learnings from “Big Game” Ransomware Campaigns There are key steps every organization should take to leverage threat and event data across the lifecycle of a cyber incident. (Marc Solomon) The Cybersecurity Resilience Quotient: Measuring Security Effectiveness The Cybersecurity Resilience Quotient empowers organizations to assess their security posture comprehensively, considering asset exposure, vulnerabilities, and criticality alongside process and network architecture and disaster recovery plans. (Rik Ferguson) Lost and Stolen Devices: A Gateway to Data Breaches and Leaks By implementing strong security practices,, organizations can significantly reduce the risks associated with lost and stolen computers and safeguard their sensitive information. (Torsten George) Flipboard Reddit Pinterest Whatsapp Email Related Content Source Code Security Firm Cycode Launches With $4.6 Million in Funding Eduard Kovacs Cyber Insights 2023Quantum Computing and the Coming Cryptopocalypse Kevin Townsend AI Helps Crack NIST-Recommended Post-Quantum Encryption Algorithm Kevin Townsend Cyber Insights 2023Regulations Kevin Townsend Fortinet Ships Emergency Patch for Already-Exploited VPN Flaw Ryan Naraine ChatGPT, the AI Revolution, and the Security, Privacy and Ethical Implications Kevin Townsend VMware Patches VM Escape Flaw Exploited at Geekpwn Event Ryan Naraine Credential Leakage Fueling Rise in API Breaches Kevin Townsend Popular Topics Cybersecurity News Industrial Cybersecurity Security Community Virtual Cybersecurity Events Webcast Library CISO Forum ICS Cybersecurity Conference Cybersecurity Newsletters Stay Intouch Cyber Weapon Discussion Group RSS Feed Security Intelligence Group Follow SecurityWeek on LinkedIn About SecurityWeek Advertising Event Sponsorships Writing Opportunities Feedback/Contact Us News Tips Got a confidential news tip? We want to hear from you. Submit Tip Advertising Reach a large audience of enterprise cybersecurity professionals Contact Us Daily Briefing Newsletter Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox. Privacy Policy Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. Close",
    "originSummary": [
      "Apple has launched a new security feature for iMessage, known as contact key verification, enhancing privacy via end-to-end encryption courtesy of an elliptic curve digital signature algorithm (ECDSA) signing key.",
      "This feature protects against potential compromises to key directory and transparency services, and also enables manual contact verification code comparisons by users.",
      "The new security function is now available in developer previews of iOS 17.2, macOS 14.2, and watchOS 10.2."
    ],
    "commentBody": "",
    "commentSummary": [
      "Environmentalists are advocating for stricter regulations on fossil fuels and other energy sources that contribute to global warming.",
      "They propose that the United States could substantially cut CO2 emissions by implementing a carbon fee and other methods to encourage consumers and industries to minimize their carbon footprints.",
      "The dual goal of these measures is to not only lower emissions but also stimulate economic growth."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1698843976143
  },
  {
    "title": "iMessage Contact Key Verification Added in iOS 17.2 and ...",
    "originLink": "https://www.macrumors.com/2023/10/26/ios-17-2-imessage-contact-key-verification/",
    "originBody": "Skip to Content Got a tip for us?Let us know Front Page Roundups Guides How Tos Reviews Buyer's Guide Forums iPhone 15iOS 17iPhone 15 ProApple Vision PromacOS SonomavisionOSwatchOS 10MacBook Pro 14 & 16\"HomePodiPhone 14Apple TViPad ProApple Watch Ultra 2iPadAirPods 3Apple CarApple Pro Display XDRHomePod miniMac ProMacBook AirMacBook Pro 13\"iPhone 13AirPods MaxAirPods ProApple DealsApple Studio DisplayApple Watch SEMac StudioiMaciPad AiriPad miniiPhone SEMac miniApple Watch Series 9iPhone 16CarPlayiPadOS 17Apple PayApple Black Friday All > iMessage Contact Key Verification Added in iOS 17.2 and macOS Sonoma 14.2 Betas Thursday October 26, 2023 10:56 am PDT by Juli Clover In addition to the new Journal app, the iOS 17.2 and macOS 14.2 updates add support for iMessage Contact Key Verification, a feature that Apple first previewed in December of last year. Designed for those who face \"extraordinary digital threats,\" such as journalists, human rights activists, and government officials, iMessage Contact Key Verification allows people to verify the identify of the person they're corresponding with. It is available today in the iOS 17.2, iPadOS 17.2, macOS Sonoma 14.2, and watchOS 10.2 betas. iPhone, iPad, or Mac users who have iMessage Contact Key Verification enabled will be notified if a malicious entity somehow succeeds in breaching cloud data servers and is able to eavesdrop on a conversation. The feature also includes a Contact Verification Code that can be used in person or on FaceTime. With iMessage Contact Key Verification, users can choose to further verify that they are messaging only with the people they intend. Contact Key Verification uses Key Transparency to enable automatic verification that the iMessage key distribution service returns device keys that have been logged to a verifiable and auditable map. When a user enables Contact Key Verification, they will be notified about any validation errors directly in the Messages conversation transcript and Apple ID Settings. For even higher security, iMessage contact key verification users can compare a Contact Verification Code in person, on FaceTime, or through another secure call. They can also choose to create or edit a contact and save a public key to turn on CKV with that person. To use iMessage Contact Key Verification, all devices signed into an iCloud account must have the iOS 17.2 beta, macOS 17.2 beta, and/or watchOS 10.2 beta. [ 24 comments ] Related Stories Get weekly top MacRumors stories in your inbox. Top Rated Comments fwmireault 6 days ago at 11:36 am I can’t imagine who would use this useless feature. Idk I'm always puzzled by this kind of comment. It's not because it's a niche feature or that you personally don't have any need for it that it makes it useless. Especially if it's an optional feature. Just don't use it, some people will be happy to have this option. A great example of me, myself and I Score: 14 Votes (LikeDisagree) itrends 6 days ago at 12:04 pm This is fantastic. With AI / impersonation on a rampant rise for scamming, being able to know if you’re really hearing from your family member etc will become critical. I can see this being extended to customer care / business purposes as well. As we enter an age where trust will be eroded, having these tools is welcome news. Score: 7 Votes (LikeDisagree) Gathomblipoob 6 days ago at 11:50 am I can’t imagine who would use this useless feature. Idk It's a useless feature if you don't need it. If you do... Score: 6 Votes (LikeDisagree) btrach144 6 days ago at 11:22 am I can’t imagine who would use this useless feature. Idk Jeff Bezos needs it. His what’s app was hacked by Saudi Arabia and they gained access to his phone and were able to discover he was cheating on his wife. This then was leaked to the press. She filed for divorce and his net worth dropped by nearly half. Whoops!? I plan to try it out with my wife. Need it? No. Interested to learn more about security? Yes. Score: 5 Votes (LikeDisagree) USAvalos 6 days ago at 11:24 am I wonder what a typical day is like for people who legitimately need this? I wonder if it is more mundane than I’d think, or I wonder if it would be like a spy movie where you sneak secrets on an sd card in a Rubik’s cube or hide razor blades to cut free from zip ties in the leather back pocket patch of Levi’s. Actually there is a lot of people who would benefit from this in the real world, in particular people in places where being a jounalist is just plain dangerous by having your phone intercept by some malicious entities without knowing. Score: 5 Votes (LikeDisagree) tonywalker23 6 days ago at 11:13 am I wonder what a typical day is like for people who legitimately need this? I wonder if it is more mundane than I’d think, or I wonder if it would be like a spy movie where you sneak secrets on an sd card in a Rubik’s cube or hide razor blades to cut free from zip ties in the leather back pocket patch of Levi’s. Score: 2 Votes (LikeDisagree) Read All Comments Popular Stories Brazilian Electronics Company Revives Long-Running iPhone Trademark Dispute Tuesday May 19, 2020 1:06 pm PDT by Juli Clover Apple has been involved in a long-running iPhone trademark dispute in Brazil, which was revived today by IGB Electronica, a Brazilian consumer electronics company that originally registered the \"iPhone\" name in 2000. IGB Electronica fought a multi-year battle with Apple in an attempt to get exclusive rights to the \"iPhone\" trademark, but ultimately lost, and now the case has been brought to... Read Full Article • 71 comments Here's How Apple's New iPhone to iPhone Data Migration Feature Works in iOS 12.4 Tuesday July 23, 2019 1:20 pm PDT by Juli Clover Apple this week released iOS 12.4, the newest version of iOS 12 available for iPhones and iPads. One of the new features in iOS 12.4 is an updated data migration option that uses device to device transfers rather than relying on iCloud. Apple didn't provide much information on the new data migration feature, so we thought we'd check it out in our latest YouTube video. Subscribe to the ... Read Full Article • 124 comments Next Article iOS 17.2 Beta Introduces Journal App Guides iOS 17 Features Our comprehensive guide highlighting every major new addition in iOS 17, plus how-tos that walk you through using the new features. iOS 17.1 Features AirDrop over the internet, Apple Music favorites and playlist art, StandBy mode and Action button tweaks, and more. iPhone 15 and iPhone 15 Pro: How to Use All the New Features Get the most out your iPhone 15 with our complete guide to all the new features. 50 New macOS Sonoma Features A deep dive into new features in macOS Sonoma, big and small. • macOS Sonoma Features to Check Out First • iPhone 15 vs. iPhone 15 Pro • 22 Hidden Features in watchOS 10 • Apple Watch Series 9 vs. Apple Watch Ultra 2 • 12 Time-Saving iPhone Tips • 10 macOS Tips to Make Your Life Easier • 14\" MacBook Pro vs. 16\" MacBook Pro • Apple M2 Chip • AirPods 3 vs. AirPods Pro 2 • One AirPod Not Working? See more guides Upcoming 14\" & 16\" MacBook Pro Order Now, Launches Nov 7 Updated with M3, M3 Pro, and M3 Max chip options, new Space Black color option on higher configurations, and more. iMac Order Now, Launches Nov 7 The new 24-inch iMac includes an M3 chip and supports Wi-Fi 6E, Bluetooth 5.3, and up to 24GB of memory. Apple Vision Pro Early 2024 The Apple Vision Pro AR/VR headset is set to launch in early 2024. It features dual 4K displays, gesture tracking, an M2 chip, and a $3,499 price tag. MacBook Air Early 2024? M3 models in 13.6\" and 15.3\" sizes. • iPad Pro See full product calendar Other Stories How to Cancel Your Apple Subscriptions 2 days ago by Tim Hardwick How to Check Your Mac's Warranty and AppleCare+ Status 2 days ago by Tim Hardwick These 3 Apple Accessories Expected to Switch to USB-C Next Week 5 days ago by Joe Rossignol Apple Watch Double Tap: What It Does and How to Get It 6 days ago by Tim Hardwick iOS 17.1: How to Shuffle a Photo Album on Your Lock Screen 1 week ago by Tim Hardwick MacRumors attracts a broad audience of both consumers and professionals interested in the latest technologies and products. We also boast an active community focused on purchasing decisions and technical aspects of the iPhone, iPod, iPad, and Mac platforms. About MacRumors.com Advertise on MacRumors Our Staff Arnold Kim Editorial Director Email • Twitter Eric Slivka Editor in Chief Email • Twitter Juli Clover Managing Editor Email • Twitter Joe Rossignol Senior Reporter Email • Twitter Mitchel Broussard Deals Editor Email • Twitter Tim Hardwick Senior Editor Email • Twitter Hartley Charlton Senior Editor Email • Twitter Marianne Schultz Project Manager Email • Twitter Dan Barbera Video Content Producer Email • Twitter Ryan Barrieau Graphic Designer Email •Twitter Steve Moser Contributing Writer Email • Twitter Marko Zivkovic Contributing Writer Email • Twitter Related Links Touch Arcade ‘Mr Traffic’ Version 2.2 Update Brings In the Spooky Collection With Zombie Traffic, New Missions, Achievements, and More ‘Super Mario Run’ Is Celebrating ‘Super Mario Bros. Wonder’ With Daily Free Stage Unlocks Until November 30th Adventure Game ‘Refind Self: The Personality Test Game’ Releases on November 14th for iOS, Android, and Steam ‘Monster Hunter Now’ November 2023 Events Detailed: Jyuratodus, Legiana, Carpenterbugs and Monster Bone+ Quests, and More ‘Dead Cells: Netflix Edition’ Arrives for Netflix Subscribers, Includes All Updates and DLC Halloween Invades ‘Vampire Survivors’ Thanks to a “Secret” Cheat Code New ‘Resident Evil Village’ iPhone 15 Pro Technical Analysis Video Covers Graphics Settings, Frame Rate, and More Roguelike Hack and Slash Game ‘Ultra Blade’ Will Get a Big Halloween Update This Thursday Bringing In New Game Modes, Levels, Enemies, and More YouTube ‘Scary Fast’ Apple Event: Everything You Need to Know! Apple's 'Scary Fast' October Mac Event: Everything You Can Expect to See! Let's Talk Apple's 'Scary Fast' October Mac Event (The MacRumors Show S02E42) Apple's NEW Journal App - Full Walkthrough in iOS 17.2 iOS 17.1 - Everything New! Copyright © 2000-2023 MacRumors.com, LLC. Privacy / DMCA contact / Affiliate and FTC Disclosure Accessibility Statement [ Featured On/Off ] [ Full Articles On/Off ] [ FluidFluid HD ] [ AutoLightDark ] Information from your device can be used to personalize your ad experience. Do not sell or share my personal information.",
    "originSummary": [
      "Apple's latest updates, iOS 17.2 and macOS Sonoma 14.2, have introduced a new feature titled iMessage Contact Key Verification aimed at users at risk of high-level digital threats.",
      "iMessage Contact Key Verification allows users to verify the identity of the person they're communicating with, increasing security for those such as journalists, activists, and government officials.",
      "Users are alerted in case of a security breach and can utilize a verification code in person or via FaceTime. This feature is currently accessible in the beta versions of iOS, iPadOS, macOS, and watchOS."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1698843976143
  },
  {
    "title": "iMessage Contact Key Verification tech details",
    "originLink": "https://9to5mac.com/2023/10/27/apple-technical-details-contact-key-verification/",
    "originBody": "Skip to main content Go to the 9to5Mac home page Switch site Toggle social menu Toggle dark mode Toggle search form Exclusives Store Podcasts Vision iPhone Mac Watch iPad Music and TV Guides IMESSAGE SECURITY IOS 17.2 Apple reveals technical details behind how iMessage Contact Key Verification works Michael PotuckOct 27 2023 - 12:38 pm PT 1 Comment Apple launched a new iMessage security feature yesterday in beta called Contact Key Verification. We learned the basics of how it works yesterday but now Apple has published technical details of how the next-level iMessage security feature operates – including a unique solution to a problem that other messaging services face. The new iMessage security feature protects against a threat that hasn’t been seen in the wild yet, but Apple has built a robust defense to help make sure it stays that way. When enabled, the opt-in Contact Key Verification gives automatic alerts if the iMessage key distribution services return device keys that have not been verified (e.g. if an unrecognized device has been added to an iMessage account). And even more security is available by using CKV in person, on FaceTime, or via another secure method like another phone call. Related: How to turn on Contact Key Verification in iOS 17.2 Now Apple has shared in-depth details on how the new iMessage security feature works on its Security Research blog. Here’s a brief history of the security features Apple has implemented with iMessage over the years: Apple’s iMessage was the first widely available messaging service to provide secure end-to-end encryption by default, starting from when it launched in 2011. As security threats have evolved, we’ve continued to strengthen iMessage by upgrading the protocol with stronger cryptographic primitives and adding more robust key management that takes advantage of hardware protections offered by the Secure Enclave. In iOS 14, we added BlastDoor, an advanced sandboxing mechanism that makes it vastly more difficult to attack the device with malicious content in the Messages app. And in iOS 16 we introduced Lockdown Mode, a groundbreaking protection for the very small number of users who face grave, targeted threats to their digital security — and which includes powerful additional security hardening in the Messages app when enabled. Today, we’d like to share an overview of our next significant advance in iMessage security: Contact Key Verification, a new feature that’s designed to detect sophisticated attacks against iMessage servers and allow users to verify that they’re messaging only with whom they intend. Going into Contact Key Verification, here’s what’s happening: iMessage uses end-to-end encryption to ensure that only the sender and recipient of a message can read it. To achieve this strong security property, each device in a user’s iMessage account generates its own set of encryption keys, and the private keys are never exported to any external system. Typically, the provider of an end-to-end encrypted messaging service operates a key directory service, which maps a user’s identifier — such as an email address or phone number — to public keys for each of their registered devices. When Alice wants to send Bob a message, Alice’s device contacts the key directory service and requests the list of public keys for Bob’s devices. Alice’s device can then start an encrypted conversation using the encryption keys it received for Bob and send him a message using the transport specified by the protocol. While a key directory service like Apple’s Identity Directory Service (IDS) addresses key discovery, it is a single point of failure in the security model. If a powerful adversary were to compromise a key directory service, the service could start returning compromised keys — public keys for which the adversary controls the private keys — which would allow the adversary to intercept or passively monitor encrypted messages. Some messaging systems try to address this issue with an out-of-band, peer-to-peer verification step, where two users can verify each other’s encryption keys using long verification numbers or QR codes. This solution is useful to confirm that the key directory service returned the correct public keys for a user’s specific set of devices at a particular point in time. However, since every device generates and stores its own keys, signing in to a messaging service on a new device generates a brand new key; users who rely on manual key verification would then have to re-verify keys in every conversation to confirm their conversations are secure, which is a challenging user experience that doesn’t scale. The Signal messaging service, for example, includes the ability to transfer an account to a new device in a way that avoids the need for manual key re-verification, but if Alice signs in to a new device without using this mechanism, the participants in all of her conversations are warned that their “safety number with Alice has changed,” even if they had never manually verified that safety number with Alice. Aiming to “both secure the key discovery protocol and provide a great user experience in iMessage” Apple built Contact Key Discovery around six requirements: Secure a source of truth for key material and metadata in a way that cannot be altered by unauthorized entities, including the key directory service operator. Automatically verify the key material and metadata presented by the key directory service against this source of truth. Synchronize the source of truth across all current and future devices authorized by a user for their account. Detect split views between what the key directory service presents for a user’s own identifiers and what it presents to peers (other conversation participants) for that user. Scale to billions of users and all of their conversations, including one-to-one discussions and group chats. Notify users only when an unexpected security condition occurs. Warnings must be rare and accurate, rather than the system relying on the user to notice ongoing positive indicators of security. For more in-depth details on Key Transparency, Automatic verification, and more, check out Apple’s full post on the topic. The company also highlights a “complete technical walkthrough” for the feature will be published “soon.” Add 9to5Mac to your Google News feed. FTC: We use income earning auto affiliate links. More. You’re reading 9to5Mac — experts who break news about Apple and its surrounding ecosystem, day after day. Be sure to check out our homepage for all the latest news, and follow 9to5Mac on Twitter, Facebook, and LinkedIn to stay in the loop. Don’t know where to start? Check out our exclusive stories, reviews, how-tos, and subscribe to our YouTube channel Featured from 9to5Mac slide 1 to 2 of 4 M3 MacBook Pro vs M2: What’s different? Michael Potuck Oct 31 2023 Everything Apple announced at Scary Fast – and the things it didn’t Ben Lovejoy Oct 31 2023 Here’s how Apple shot the entire ‘Scary fast’ event on iPhone 15 Pro (even the drone footage) Chance Miller Oct 31 2023 First M3 MacBook Pro hands-on videos show off new Space Black color Chance Miller Oct 30 2023 Check out 9to5Mac on YouTube for more Apple news: Comments EXPAND COMMENTS Guides iMessage iMessage is a free, secure messaging platform fo… Security iOS 17.2 Author Michael Potuck michaelpotuck Michael is an editor for 9to5Mac. Since joining in 2016 he has written more than 3,000 articles including breaking news, reviews, and detailed comparisons and tutorials. Michael Potuck's Favorite Gear Satechi USB-C Charger (4 ports) Really useful USB-C + USB-A charger for home/work and travel. Apple Leather MagSafe Wallet My slim wallet of choice for iPhone 12",
    "originSummary": [
      "Apple has disclosed technical specifics of its new iMessage security feature, Contact Key Verification (CKV), currently in beta testing.",
      "CKV warns users if unverified device keys are presented by the iMessage key distribution service, increasing protection against potential threats.",
      "Aimed at advanced threats against iMessage servers, CKV verifies that users communicate only with their intended contacts. Further feature details are available on Apple's Security Research blog."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1698843976143
  },
  {
    "title": "Hackers Launch a Chain of Exploits Via Malicious iMessage Attachments",
    "originLink": "https://cybersecuritynews.com/exploits-via-imessage-attachments/",
    "originBody": "Home Threats Cyber Attack Vulnerability Zero-Day Data Breaches Cyber AI what is Top 10 Home About Us Contact US Privacy Policy Cyber Security News Home Threats Cyber Attack Vulnerability Zero-Day Data Breaches Cyber AI What Is Top 10 Home Cyber Security News Hackers Launch a Chain of Exploits Via Malicious iMessage Attachments Cyber Security News Hackers Launch a Chain of Exploits Via Malicious iMessage Attachments By Eswar - October 26, 2023 In June, a new campaign targeting iPhone and iPad devices was named “TriangleDB.” This malware infection chain consists of a malicious iMessage attachment, which launches a chain of exploits on the affected devices. Moreover, several modules were found in this malware, which could also execute additional modules. Excluding the infection chain, there were two validators: “JavaScript validator” and “Binary Validator.” These validators collect multiple information from the targeted devices and transfer them to a C2 server, later used by threat actors to access the compromised devices and detect if the device was a test device or a victim device. JavaScript Validator In addition to this, this malware is a zero-click exploit that is executed through invisible iMessage attachments. The main purpose of this JS validator is to stealthily open a unique URL to the domain backuprabbit[.]com. This website contains an obfuscated JavaScript code of the NaCl cryptography library and an encrypted payload. This JS code performs a Canvas Fingerprinting technique by drawing a yellow triangle on a pink background with WebGL and calculating its checksum. It finally encrypts and transfers the collected data to the same to receive the next stage of the infection chain. Binary Validator This validator is launched before the installation of the TriangleDB implant. The Binary validator is responsible for crash log removal, ids-pub-id.db or knowledge.db removal, turning on personalized ad tracking, and much more. After collecting all this information, it sends encrypted data (list of processes, user information, etc.) to the C2 server. Additionally, this malware can record microphones, Keychain exfiltration, steal SQLite, and monitor location. Log Trace After the implant establishes communication with its C2, it receives multiple CRXShowTables and CRXFetchRecord commands, which are associated with log retrieving and show traces of the infection. The logs contain Crash log files, Database files, and others. Microphone Recording This module is named as “msu3h” and is one of the most invading modules of this malware. However, this module performs more actions only when the charge of the affected device is higher than 10%. In addition to this, it also contains more parameters like suspendOnDeviceInUse (stop recording remotely) and syslogRelayOverride (if audio should be recorded if system logs are captured). Keychain Exfiltration This module was entirely based on the code from the iphone-dataprotection.keychainviewer project, but the information on why the threat actor has implemented this module even in the presence of similar modules is already unknown. SQLite stealing Internal data of many iOS apps use SQLite database, so the threat actor has implemented several modules for SQLite DB stealing. All the SQLite DB stealing modules have the same codebase and encrypted configuration. A complete report about this malware has been published by SecureList, which provides detailed information about this TriangleDB implant. Protect yourself from vulnerabilities using Patch Manager Plus to patch over 850 third-party applications quickly. Try a free trial to ensure 100% security. TAGS cyber security cyber security news iMessage Linkedin Twitter ReddIt Facebook Telegram Eswar https://cybersecuritynews.com/ Eswar is a Cyber security reporter with a passion for creating captivating and informative content. With years of experience under his belt in Cyber Security, he is reporting data breach, Privacy and APT Threats. Unified Endpoint Management Managed WAF Find us On Google News Latest News Palo Alto Networks to Acquire Cloud Security Start-up Dig Dhivya - November 1, 2023 Over 700 Zero-Day Vulnerabilities Identified in Q3 2023: Mitigation Methods on WAAP October 31, 2023 Hackers Exploit Roundcube Zero-day to Attack Government Email Servers October 26, 2023 BIG-IP Vulnerability Allows Attackers to Execute Remote Code October 28, 2023 iLeakage – New Attack Let Hackers Steal Emails, Passwords On Apple Safari October 30, 2023 ABOUT US Cyber Security News Is a Dedicated News Channel For Hackers And Security Professionals. Get Latest Hacker News & Cyber Security Newsletters update Daily. FOLLOW US Home About Us Contact US Privacy Policy © Copyright 2023 - Cyber Security News",
    "originSummary": [
      "In June 2023, a cyber-attack campaign titled \"TriangleDB\" utilized malicious exploit chains via iMessage attachments to target iPhone and iPad devices.",
      "\"TriangleDB\" constituted of two validators: a \"JavaScript validator\" and a \"Binary Validator,\" each extracting data from infected devices and transferring it to a C2 server used by the hackers.",
      "The malware facilitates recording of microphones, Keychain exfiltration, SQLite theft, location monitoring, and serves as a zero-click exploit executed via obscured iMessage attachments. Further information is outlined in a report by SecureList."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1698843976143
  },
  {
    "title": "How to use iMessage on any ANDROID device (with one tiny drawback)",
    "originLink": "https://www.dailymail.co.uk/sciencetech/article-12676087/How-use-iMessage-ANDROID-device-one-tiny-drawback.html",
    "originBody": "Home News Royals U.S. Sport TV&Showbiz Femail Health Science Money Travel Best Buys Discounts Latest Headlines Blue Origin SpaceX NASA Apple Google Twitter Microsoft Login Privacy Policy Feedback Wednesday, Nov 1st 2023 12PM 12°C 3PM 11°C 5-Day Forecast ADVERTISEMENT How to use iMessage on any ANDROID device (with one tiny drawback) Several apps let you use iMessage on PCs or Androids There tend to be drawbacks (from waiting lists to needing a Mac) READ MORE: Five iOS 17 upgrades which will change your life By ROB WAUGH TECH CORRESPONDENT FOR DAILYMAIL.COM PUBLISHED: 15:57, 27 October 2023UPDATED: 15:57, 27 October 2023 e-mail 6 shares 20 View comments With 1.3 billion iPhone users worldwide, iMessage reigns as the supreme messaging app - and Android users are not invited to the party. Thankfully, there are several ways to get Apple’s ubiquitous messaging app to work on Android handsets. Android users can download several apps to access iMessage, which also comes with the iconic 'blue bubbles.' Below are some best ways to get iMessage working on your Android. +4 View gallery You can get iMessage working on any device (at a price) (Getty) TRENDING MailOnline's complete guide to the MOON 590 viewing now Pro-Palestine vandals smash windows of a Starbucks in Yorkshire 10.6k viewing now Moment resident takes an angle grinder to 'neighbour from hell's' gate 14.4k viewing now AirMessage AirMessage offers a simple way to get iMessage running on your Android - with one slight drawback. To make it work, you’ll need a Mac, a phone, and AirMessage installed on both (and you’ll also need to ensure the Mac stays on). First, on your Mac, install AirMessage Server. +4 View gallery Airmessage lets you use iMessage on any Android (AirMessage) Then click Connect an account: use a Google account to register your computer with AirMessage. When prompted, allow Airmessage automation access, and then go to Under System Preferences > Security & Privacy > Privacy > Full Disk Access and add AirMessage. Five hidden apps on your iPhone that you SHOULD be using A number of extremely useful, pre-installed apps on iPhones are flying under the radar ADVERTISEMENT AirMessage means your Mac works as a server, so you’ll need to disable sleep settings: go to System Preferences > Energy Saver and ensure your Mac doesn’t sleep or switch off. Once the app is set up (it doesn’t read anything bar your iMessages), you can then access AirMessage both in a browser on a PC at https://web.airmessage.org/ or via the Android app. To use it, just log in via the Google account you used to set up AirMessage on your Mac. Blue Bubbles Blue Bubbles is similar to AirMessage but open source and available via the project’s page on the programming site GitHub. Drag the DMG file to your Mac, open it, and follow the steps in the installation guide (as with AirMessage, you’ll need to enable accessibility and full disk access). Follow the steps in the software to set up (use your Google account and opt for Cloudflare). +4 View gallery Blue Bubbles is an open-source app to run iMessage on Android or PC (Blue Bubbles) Then, you download either the Android or PC client from Blue Bubbles. Enter your Google account, sync your messages, and you should be good to go. Beeper Anyone who’s ever felt overwhelmed by the sheer number of messaging apps on their device will admire the idea behind Beeper - all your messages in one place. Even better, you don’t need an Apple device: you can set up an iMessage account with just your email. +4 View gallery You can run many messaging apps inside Beeper (Beeper) Beeper aggregates up to 15 different messaging services into one app. There are just two hiccups: there’s a ‘warm up’ period where you’ll be unable to message via your new iMessage account for 48 hours, and there is also a waiting list for the Beeper app at present. To join the waiting list, download the app or go to the Beeper website and join the waiting list with your email. Android iPhone Google Apple Share or comment on this article: How to use iMessage on any ANDROID device (with one tiny drawback) e-mail 6 shares Bing Site Web Enter search term: Search ADVERTISEMENT Download our iPhone app Download our Android app Today's headlines Most Read What your favourite horror classics would look like as modern monsters this Halloween, according to AI -... Disney+ raises its prices in the UK by up to £36/YEAR today - and you'll have to endure adverts if you want... Rise of the robots: 'AI' is crowned Word of the Year - closely followed by 'greedflation', 'nepo baby' and... Elon Musk says AI safety is 'vital to the future of civilization' - and claims technology could pose an... The AI will see you now! Artificial intelligence 'is TWICE as good at diagnosing severity of cancers as... Could your PHONE be making you infertile? Alarming study on plunging sperm counts sparks warning for men to... Michelin STAR dining! Space tourism company will take diners to the edge of space for a meal on board a huge... Scientists claim they've uncovered the TRUE 'origin story' behind how the Great Sphinx was built 4,500 years... China's spy agency claims 'gene weapons' that target specific races are being developed by 'certain'... 'Godfather' of AI is among hundreds of experts calling for urgent action to prevent the 'potentially... Cats have nearly 300 facial expressions, including a 'play face' they share with humans, study finds Revealed: The best and worst locations in the UK to buy Glastonbury tickets - so, how does your town stack... Revealed: The most popular Halloween costumes of 2023, according to Google Searches Food swaps you can make to slash carbon footprint by 35% - including swapping cheeseburgers for chicken... 'Ghostly cosmic hand' is captured in space: NASA's new telescope captures eerie remnants of a supernova... MORE HEADLINES TOP STORIES Pro-Palestine vandals smash windows of Starbucks and release stick insects and mice inside four McDonald's in spree of attacks in Yorkshire and Birmingham after... Moment resident takes an angle grinder to metal gate built by 'neighbour from hell' who blocked off public alleyway and claimed the land belonged to him Storm Ciaran UK weather tracker and map shows where Brits will be hit with strong winds and rain TODAY - check your area Meghan Markle and Prince Harry take Prince Archie and Princess Lilibet trick-or-treating in Montecito Lil Nas X is SLAMMED for distasteful Halloween outfit after dressing up in VERY bizarre costume 'Go back to what your mother taught you': TV presenter Susannah Constantine on the six money-saving hacks that helped her cut energy use on laundry by a THIRD! AD FEATURE ADVERTISEMENT Passenger from hell who yelled 'white children are easy to rape because white men are p******' is jailed for hurling drunken abuse at white women on two holiday... Sharon Osbourne, 71, strips off to copy Bianca Censori's topless cushion look for Halloween... and Ozzy transforms into Kanye West Bobby Brazier and Strictly professional dance partner Dianne Buswell share a kiss after surviving another week of gruelling rehearsals 'It's put a spring back in my step'. Losing your hair can be emotionally devastating but there is a solution... AD FEATURE Big Brother icon Helen Adams pictured 22 years after her ditsy antics and romance with Paul Clarke shot her to fame on the reality show Sir Bobby Charlton's cause of death revealed after class of '66 football legend died aged 86 Pub landlord accuses 'dine and dash' family of 12 of enjoying a slap up lunch worth £260 - including steak and 10 pints of Stella Artois - before leaving withou... Couple's £1.2million grade II listed home is ransacked by children who use chainsaws, hammers and axes to leave property 'looking like a warzone' How do you explain bad news to your child? A psychotherapist reveals his 5 tips for helping them understand (and what to NEVER say) AD FEATURE Storm Ciaran sparks red warning in Channel Islands as residents brace for 100mph winds with ferries, flights and lessons axed as 'weather bomb' edges closer to ... EXCLUSIVE: British expats are hit with enormous water bills of up to £64,000 EACH and told they MUST pay up by Spanish authorities - despite suspicions their wa... Premium Bond holder scoops £1m with a £5,050 holding from May 2000 - how does that compare to all of the 2023 jackpot winners so far? What men truly like doing in bed! After women gave Tracey Cox their honest confessions, men reveal what raunchy acts really get them going (and the ones they se... Could this vegan collagen supplement be the secret to your best skin ever? These real women are loving the results - so could it work for you? AD FEATURE Jonathan Ross' hotly-anticipated Halloween party RETURNS to his home for the first time in three years... but with a twist ADVERTISEMENT Storm Ciaran latest: Live updates as UK braces for flooding and strong winds with red weather warning issued and Londoners urged to 'not take risks' Coco Austin, 44, displays her famous curves in cropped shirt as she and her husband Ice-T, 65, nail a gangster inspired look for Heidi Klum's Halloween party Life is sweets! Jamie Laing says building his Candy Kittens brand has brought his boyhood dreams to life - and that making them 100 per cent vegan was a 'no-brainer' AD FEATURE Five members of Rochdale grooming gang who repeatedly attacked two young girls 'like pieces of meat' in child sex abuse lair dubbed 'The Butcher's flat' two dec... Shani Louk's brother reveals 'our whole family crashed' when they saw her being paraded by Hamas 'spitting on her like she was nothing' after Israel terror atta... Robert De Niro denies his girlfriend Tiffany Chen gave the actor an 'ultimatum' to fire his assistant as couple's email exchanges are revealed Woman reduced from 'voluptuous size 16' to 'skin and bone' as she was enslaved, tortured and left to die in a locked cupboard did not need an ambulance, alleged... A nation of wheeler dealers: Half who sold a car online did so to an online buying service... and three-quarters were HAPPY with the experience! AD FEATURE Astonishing moment Britain's bravest mother pushed pram carrying her baby girl to safety before she was mown down by maniac drunk driver in shocking hit-and-run Inside Chloe Madeley's post split glow-up: Star swaps her gymwear for racy boots after James Haskell accused her of 'never dressing sexily for him' ADVERTISEMENT Harper Beckham dresses as a chipmunk for Halloween with horn-clad David while Rebekah Vardy and Charlotte Dawson sizzle as Catwoman and Wonder Woman Meet Sophie Turner's VERY eligible new squeeze: Aristocrat Peregrine Pearson who had raunchy kiss with Game of Thrones star has a family worth more than £224million Pictured: NHS ward manager accused of manslaughter after failing to remove bin bags that Alice Figueiredo, 22, used to kill herself at mental health hospital King Charles sweetly refers to his 'beloved daughter-in-law' Kate as he shares details of Prince William's proposal to the princess Bed bugs aplenty, out-of-place angels and the ghost of Wilko past: How Halloween revellers scared off the evil spirits with some frightfully good costumes Maya Jama slips into a skintight jumpsuit as X-Men's Storm as she joins Paloma Faith and vampy Jourdan Dunn at the Love Island host's Halloween bash The Great Storm of 1987: How deadly weather killed 18, flattened 15million trees and left a £1.5billion repair bill after weatherman Michael Fish told nation no... I replaced coffee cream with my own breast milk to catch out my thieving colleagues: 'Don't steal next time' Alex Scott and 'girlfriend' Jess Glynne wow in sexy Halloween costumes as they hold hands at Haunted House bash before leaving together in a cab Heidi Klum spreads her wings! Queen of Halloween dresses up as a PEACOCK with 10-person entourage while her husband rolls up as an EGG... at model's annual bash Claudia Schiffer's daughter Clementine, 18, is the spitting image of her supermodel mum in Instagram snaps MailOnline's complete guide to the MOON: 9 astonishing facts about our lunar satellite that will leave you staring at the sky in awe Tatt's amazing! The ugly inkings that have been transformed with a skilful cover up Antiques dealer is hauled into court accused of deceiving elderly couple after buying an African mask from them for £130 - then selling it for £3.6million James Haskell shocks theatre audience with 9/11 'joke' about rugby coach' in first public appearance since split from Chloe Madeley ADVERTISEMENT Eight-month pregnant Indian TV star Dr Priya dies from heart attack aged 35 - but doctors save her baby It's a scream! Halloween night partygoers brave the cold with some outrageous outfits in Newcastle, Leeds and Portsmouth Netanyahu promises 'victory' against Hamas despite IDF's 'painful losses' since entering Gaza - as Israel's air force chief accuses the terrorist group of 'usin... I'm a psychologist - the subtle red flags someone you love has an eating disorder Matthew Perry is seen dining out with a female friend at the Hotel Bel-Air the day BEFORE he was found dead in his hot tub at home Ashanti wows in a racy bodysuit as she coordinates costumes with beau Nelly at his Halloween 'G.I. Moe' birthday celebration Kate Beckinsale flaunts her toned abs in a white sports bra as she shows off her impressive flexibility during yoga session EXCLUSIVE: Baby boomers tell Gen Z how hospitality SHOULD be done: 'Silver servers' share tips on how to treat customers and pour the perfect pint as more than ... Early retirement is increasingly the preserve of the rich, IFS study shows Disgraced ex King Juan Carlos of Spain attends his granddaughter Princess Leonor's 18th birthday party after returning from Dubai ADVERTISEMENT Pregnant Emily Andre baffles fans as she shows off her VERY understated Halloween look while daughter Amelia and son Theo go trick-or-treating Big Brother confirms HUGE twist in major shake-up for live eviction LIVE Matthew Perry death LATEST: Outrage as ex-SNL writer mocks Friends star's death and asks 'Am I trending yet?' JLS fans go wild as boyband announces new tour dates for summer 2024: 'This just gave me goosebumps!' . Richard E Grant pays tribute to his late wife Joan Washington on their would be 37th wedding anniversary - two years after her death from cancer Mariah Carey shows off her hourglass curves in a skintight Mrs. Claus outfit as she shares hilarious video being 'defrosted' by Halloween ghouls Tan France went from working at his grandparents' Bury denim factory to the A-list after Queer Eye propelled him to fame Lily Allen dresses up as a Chucky doll as she hosts Halloween party - but husband David Harbour is nowhere to be seen amid split rumours Paris Fury reveals nanny REFUSED to work with her after meeting the 'wild' seven children she shares with Tyson Chrishell Stause sports a prosthetic male torso as she and her partner G Flip recreate Troye Sivan's new drag music video for Halloween ADVERTISEMENT As Heidi Klum proves she is the Queen of Halloween with a peacock costume... a look back at the star's most bizarre outfits Queen Camilla wears Queen Elizabeth II's £30,000 glittering Shell Brooch and a necklace with her grandchildren's initials on it during Kenya tour Diddy transforms into Batman as he arrives at Halloween party in a Batmobile while Chloe Bailey channels Mrs. Incredible in a PVC one-piece Big Brother: Dylan accuses Noky and Trish of 'black on black crime' after they nominated him in FURIOUS row as house deals with fall out from the eviction Unwrap the magic of beauty! Charlotte Tilbury has EVERYTHING you need for Christmas gifting - from Pillow Talk lip kits to luxury advent calendars (starting at just £25) SHOPPING David Beckham inspires an array of Halloween costumes with fans and celebs dressing up as the footballer and wife Victoria Time viewers call the BBC drama 'one of the hardest watches in recent times' as fans break down in tears at the ending after binge watching second series Tyler Christopher's Charmed co-star Alyssa Milano and fellow General Hospital actor Bryan Craig lead tributes to the star after his death at 50 James Haskell is seen for the first time since Chloe Madeley split while she sports racy boots for outing with daughter Bodhi Robert De Niro yells at his former personal assistant as he ADMITS asking her to scratch his back - but only twice - and calling her a 'f***ing spoiled brat' ADVERTISEMENT Davina McCall admits her relationship with Kylie Minogue 'is complicated' after 'phone snub' despite once starring in singer's music video BBC defends 'racist' Little Britain sketch where David Walliams says Asian character 'smells of soy sauce' Dwayne Johnson dresses up as David Beckham for Halloween, as WWE legend sports blonde wig and a Man United top Rosie Huntington-Whiteley cuts a chic figure in a £6,000 YSL leather jacket as she steps out in Mayfair REVEALED: The 'super comfortable' power leggings from Sweaty Betty that gym goers can't get enough of This £24 ICONIC London primer with hundreds of five-star reviews will keep makeup in place ALL day and blur imperfections SHOPPING Damian Lewis wears a quirky ensemble as he cosies up to girlfriend Alison Mosshart at Haunted House Halloween bash Princess Maria-Olympia of Greece is spotted looking glum amid split from 'Britain's most eligible bachelor' Peregrine Pearson Kate Hudson transforms into a gothic vampire in a black Victorian dress and hat as she and mum Goldie Hawn take her daughter Rani trick-or-treating Katy Perry sizzles in a bra made out of beer cans before dressing as a red latex mushroom for the Halloween special of her $168m Las Vegas residency ADVERTISEMENT April Love Geary, 28, dresses as a firefighter as she and Robin Thicke, 46, take their three young children trick or treating for Halloween Sophie Turner spotted with prestige bachelor Peregrine Pearson hours after the pair shared a raunchy kiss Revealed: Initial tests 'indicate Matthew Perry's death was not the result of a fentanyl or meth overdose with neither drug found in his system' Jade Thirlwall is unrecognisable as she transforms into Mr Bean while boyfriend Jordan Stephens wears a Teddy suit for Halloween bash Jason Momoa is 'beyond happy' that his stepdaughter Zoe Kravitz is engaged to his 'best friend' Channing Tatum Sir Paul McCartney, 81, cheerfully greets fans from his car as he arrives in Brisbane... after two spectacular sold-out shows in Sydney Liam Hemsworth's stunning girlfriend Gabriella Brooks looks chic as she leads arrivals alongside Isabel Lucas at Aje's 15th Anniversary party Matthew Perry's ex Molly Hurwitz 'wishes' Friends star had not 'thrown away' their relationship by messaging a 19-YEAR-OLD girl on Raya Tyler Christopher dead at 50: Ex-husband of Eva Longoria and actor passes away following 'a cardiac event in his San Diego apartment' Kendall Jenner's Halloween costume receives Wonder Woman Lynda Carter's approval as A-list stars share incredible looks on Instagram ADVERTISEMENT King Charles nearly takes a tumble as he trips on artificial grass (before keeping calm and putting on his sunglasses) during visit to Kenya with Camilla Sophie Turner 'shares a raunchy kiss with prestige bachelor Peregrine Pearson' just weeks after split from Joe Jonas - as he takes their children trick-or-treating on Halloween French Montana reveals his private plane was STOPPED in Colombia as local authorities searched for drugs before he was allowed to leave country M&S Christmas advert 2023: Hannah Waddingham, Sophie Ellis-Bextor and Zawe Ashton join Queer Eye's Tan France in a very star-studded ad Robbie Williams, 49, claims he's going through 'manopause' as he battles 'thinning hair' and a 'reduced sex drive' due to 'years of partying' Camila Cabello rocks sunglasses and headphones with a mini dress in tribute to Anne Hathaway's Princess Diaries role at Heidi Klum's Halloween party The Voice: Niall Horan presses steal button with his head to snatch Claudia B. for his team as Knockouts continue Real Housewives Of Salt Lake City: Mary Cosby tells Whitney Rose to 'grow up' and calls her a 'bobblehead' before storming out of restaurant Michelle Williams and her youngest child are Halloween bunnies as they go trick-or-treating in Brooklyn, New York PICTURED: Maya Jama and Stormzy seen having heated argument in an alleyway during trip to LA after rekindling romance - as she breaks her silence ADVERTISEMENT MAFS UK viewers urge Paul to 'run' from 'toxic' Tasha as she offers 'fake' apology for their heated row - as fans query why the argument wasn't aired Lottie Moss puts on a racy display as she slips into a VERY revealing risqué costume to attend the Haunted House of Friends party Hugh Jackman cuts a dash in a dark suit as he leaves a dinner party in NYC with mystery woman - after his shock split from wife Deborra-Lee Furness Tyler Christopher's tragic life: General Hospital star who was married to Eva Longoria admitted he 'flatlined' three times in the grips of alcohol addiction... before his death at 50 Ariana Grande is mobbed by fans as she arrives to watch her boyfriend Ethan Slater in Spamalot before leaving with friend wearing paper crown Hailey Bieber jokes about her 'Mean Girl' reputation with Halloween costume that hits back at her haters Britney Spears flashes under-boob cleavage in sheer black dress and models three other flirty frocks on Halloween Heidi Klum's daughter Leni, 19, puts on a leggy and busty show as Strawberry Shortcake for her famous mother's 22nd Annual Halloween Party Kerry becomes the fourth contestant to leave Big Brother 2023: NHS Manager is EVICTED after Noky and Trish's nominations were revealed Former I'm A Celeb star Lembit Opik claims Nigel Farage will WIN the show as he prepares to join the lineup in a lucrative deal ADVERTISEMENT Bradley Cooper and ex Irina Shayk dress up like Rocket Raccoon as their daughter Lea opts for Taylor Swift costume while trick-or-treating in NYC Alec Baldwin looks downcast as he steps out for coffee in NYC... after vowing to fight in court if he is charged with involuntary manslaughter over fatal Rust shooting Nicole Kidman's 1998 cult classic Practical Magic was 'cursed' by a witch consultant on the film says director Ramona Singer REMOVED from the BravoCon lineup after a report claiming she used 'racial hostility' to a Black crew member on the Real Housewives of New York set Tina Knowles reveals daughter Beyonce can get 'mean' during quick costume changes: 'I am really happy that I don't have to be back there anymore' Jonathan Ross begins preparations for his lavish celebrity Halloween party - after revealing heartbreaking reason why it was cancelled for two years Emilia Clarke reveals what her true fears were after suffering a brain haemorrhage: 'I wasn't afraid of dying. I was afraid of being fired!' Gisele Bundchen gets into the spooky spirit as she hangs a giant fake spider outside her Miami home... before getting a visit from rumored beau Joaquim Valente Matthew Perry was sober and had been very active in Alcoholics Anonymous program in the lead up to his death, source reveals Strictly's Janette Manrara and Alijaz Skorjanec reveal their plans for baby number two as they pose for sweet snaps with daughter Lyra Rose ADVERTISEMENT Caprice feels 'vindicated for the backlash she received at the time' after Dominic Cummings' Covid evidence saying her border call was right Great British Bake Off 2023: Sixth contestant to leave is announced after screwing up Technical challenge Victoria Beckham reveals her fashion empire is FINALLY making a profit - 15 years after it launched - as she poses for Vogue France cover shoot Hannah Waddingham looks glamorous in a glitzy black co-ord as she joins Vogue Williams at the screening of M&S' Christmas advert Sam Smith wows the crowd as they hit the stage in Melbourne in waist-cinching corset and gold trousers during Gloria tour . Olivia Rodrigo is dating British actor Louis Partridge after meeting 'through mutual friends' and hitting it off after a number of nights out in London Viewers say graphic violence on post-watershed TV is now the 'norm'... but portrayal of sex has become fairer to women Matthew Perry claimed he 'didn't remember' after he proposed to former fiancée Molly Hurwitz when he was 'high as a kite' in rehab facility Diddy responds to rumours he wanted to fight Will Smith over threesome proposition with Jada Pinkett Smith and his ex Jennifer Lopez Banged Up review: This prison 'experiment' is just a shabby excuse to torment celebs, writes CHRISTOPHER STEVENS ADVERTISEMENT David Schwimmer is spotted walking somberly to his NYC apartment after paying tribute to Friends co-star Matthew Perry Why Margot Robbie is getting slammed for her Halloween costume as she breaks one important rule: 'She's treading a thin line' Follow Daily Mail Subscribe Daily Mail Follow @DailyMail Follow Daily Mail Follow @dailymailtech Follow Daily Mail TECH NEWS & REVIEWS Wordle has a hidden 'hard mode' - but players claim it might actually make the game EASIER While an estimated 300,000 people play Wordle daily, many are unaware of a secret 'hard mode', which can be found within the game's settings. 353 comments 1 video Apple could start selling iPhones and iPads as part of a SUBSCRIPTION service from 2023, report claims A new report from Bloomberg claims that Apple is working on selling iPhones and iPads as part of a hardware subscription service. 93 comments YouTube adds thousands of FREE TV shows and movies to its service including The Sandlot, Legally blonde and There Will Be Blood as company moves to compete with streaming giants This is the latest move from the Google-owned social video giant, as it tries to compete in an increasingly crowded, and competitive market. 68 comments Project Skyway: World's largest network of 'drone superhighways' could be built in ENGLAND - connecting the Midlands with the Southeast over 165 miles If approved, Project Skyway will connect the airspace above cities including Reading, Oxford, Milton Keynes, Cambridge, Coventry, and Rugby. 58 comments 2 videos About time! Instagram FINALLY brings back the chronological feed - six years after it was ditched in favour of a curated feed Instagram is launching two new ways for users to catch up with their feed - Following and Favourites - which will show posts in chronological order. 6 comments 1 video Smart BRA with built-in ultrasound technology can detect early signs of breast cancer The smart bra features small ultrasound sensors in the lining, and was developed by Nextwear Technology, a wearables firm based in Abuja, Nigeria. 8 comments 2 videos Smartwatches are less effective at tracking the health of people with dark skin, study finds The research by University of Alberta is the first to pool figures from multiple studies to specifically examine how skin tone may affect the accuracy of heart data in wearables 40 comments World's THINNEST mechanical watch is unveiled: Bulgari's Octo Finissimo Ultra is thinner than a 10p coin - and has an eye-watering £332,700 price tag Rome-based Bulgari spent three years developing the watch, which is crafted from sandblasted titanium as measures just 0.07 inches (1.8mm) thick. 308 comments 1 video Smart ring that constantly measures your temperature could provide an early warning of Covid-19 infection - even if your symptoms are subtle Experts from the University of California and MIT Lincoln Lab studied data on 50 people who owned sensor rings and had had Covid-19 before the study. 196 comments Suzuki could launch a FLYING CAR by 2025 after joining forces with Japanese startup SkyDrive Suzuki has announced that it's joining forces with Tokyo-based flying car firm SkyDrive to develop an electric, vertical takeoff and landing aircraft. 79 comments 4 videos You could soon feel PAIN in the metaverse: Creepy armband uses electrical stimulation to mimic uncomfortable sensations such as a bird pecking at your skin H2L, a Sony-backed company based in Tokyo, has developed an armband that uses electrical stimulation to deliver physical pain. 35 comments 2 videos Engineers develop a bizarre 'magnetic tentacle robot' that can move around the narrow tubes of the lungs to take tissue samples Like something from a horror film, the new robot's 'magnetic tentacle' would slowly creep into the mouth of a patient under under general anesthesia, University of Leeds scientists show. 6 comments 1 video ADVERTORIAL FEATURES Madonna keeps her health up with Barcelona bike ride... ONE WEEK after revealing she felt UNWELL onstage following health crisis Karlie Kloss looks effortlessly chic in high-slit skirt and black leather boots alongside husband Joshua Kushner for coffee run in the Big Apple Drag queen Courtney Act reveals the reason she was 'so grumpy' behind the scenes on The Masked Singer Australia: 'It takes all the fun out of it' Emily Ratajkowski the doting mom carries toddler son Sly on her shoulders while trick-or-treating... amid new romance with Stephane Bak Next story Move over, Mediterranean diet: New 'portfolio diet' is the silver bullet for health, America's top cardiologists say - here are the foods you should invest in 929 comments Back to top Home News Royals U.S. Sport TV&Showbiz Femail Health Science Money Travel Best Buys Discounts Sitemap Archive Video Archive Authors Topics Index Mobile Apps Screensaver RSS Text-based site Reader Prints Our Papers Top of page Daily Mail Mail on Sunday This is Money Metro Jobsite Mail Travel Zoopla.co.uk Prime Location Published by Associated Newspapers Ltd Part of the Daily Mail, The Mail on Sunday & Metro Media Group dmg media Contact us How to complain Leadership Team Advertise with us Contributors Terms Do not sell or share my personal information About MailOnline Privacy policy & cookies DMG Media and its partners process, store and/or access information on a device. We and our partners process, store and/or access data such as IP address, unique ID and browsing data based on your consent to display personalised ads and content, ad and content measurement, audience insights and product development, use precise geolocation data, and actively scan device characteristics for identification. Sometimes we and/or our partners don’t rely on your consent but rely on legitimate interest to process your data. Click Cookie Settings below to see our partners, why they rely on legitimate interest and how you can object. Control how your data is used and view more info at any time via the Cookie Settings link in the Privacy Policy. Cookie SettingsGot it",
    "originSummary": [
      "Android users have different apps such as AirMessage, Blue Bubbles, and Beeper available to provide access to Apple's proprietary messaging service, iMessage.",
      "There were several newsworthy incidents across the UK comprising public disputes, celebrity news, extreme weather, and high-profile criminal cases.",
      "Significant advances in technology were noted, including the development of a smart bra for early breast cancer detection and plans for a flying car."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1698843976143
  },
  {
    "title": "Goodbye Green Bubbles: The Android User's Survival Guide ...",
    "originLink": "https://www.wsj.com/tech/personal-tech/in-an-iphone-world-android-users-can-now-fit-in-1b272527",
    "originBody": "SKIP TO MAIN CONTENT SKIP TO SEARCH Skip to... Select DJIA Futures33082.00 points with a 0.16%▼ S&P 500 F4208.75 points with a 0.08%▼ Stoxx 600435.94 points with a 0.53%▲ U.S. 10 Yr26/32 with a 4.879%▲ Crude Oil82.98 points with a 2.42%▲ Euro1.0536 points with a 0.39%▼ Limited Offer: $1/Week Sign In SPECIAL OFFER English Edition Print Edition Video Audio Latest Headlines More World Business U.S. Politics Economy Tech Finance Opinion Arts & Culture Lifestyle Real Estate Personal Finance Health Science Style Sports TECHNOLOGY PERSONAL TECHNOLOGY PERSONAL TECHNOLOGY Goodbye Green Bubbles: The Android User’s Survival Guide in an Apple World Missing out on iMessage group chats and other Apple perks, Android users are finding workarounds like chat service Sunbird PHOTO ILLUSTRATION BY RACHEL MENDELSON/THE WALL STREET JOURNAL, ISTOCK By Dalvin Brown Updated Oct. 28, 2023 2:45 pm ET Share Resize 34 It is hard being the green-bubble guy. Timofey Galyukov has often felt digital exclusion since he got his first smartphone in 2016—an Android-powered Google Pixel. His close-knit group of iPhone-wielding friends plan their basketball games and weekend outings using Apple’s AAPL 0.28% increase; green up pointing triangle iMessage. They would leave Galyukov out because they didn’t want his Android phone turning their chat bubbles green. Copyright ©2023 Dow Jones & Company, Inc. All Rights Reserved. 87990cbe856818d5eddac44c7b1cdeb8 Already a WSJ subscriber? Sign in To continue reading, choose an option below Create Your Free Account Register now to read this article for free. Register Now or Unlimited Access Subscribe to WSJ Today Just $1/Week for 1 year Unlimited access to world-class journalism Daily puzzles and crosswords Exclusive podcasts and newsletters You can cancel any time. Subscribe Now Already a subscriber? Sign In What to Read Next SPONSORED OFFERS AT&T: Get the iPhone 15 Pro with titanium with up to $1,500 discount WALMART: 20% off your next online order - Walmart coupon code BEST BUY: Save $1000 discount on iPhone 15 Pro and Pro Max - Best Buy coupon TARGET: Take 20% Off Your Entire Order - Target promo Code ZALES: Enjoy orders up to 25% Off with the Buy More, Save More Sale. MOST POPULAR NEWS Jury Finds Realtors Conspired to Keep Commissions High The Left Is Tearing Itself Apart Over Israel Israeli Airstrike Hits Crowded Refugee Camp in Northern Gaza This Year’s Hottest Investment Could End Up Costing You The Money Has Stopped Flowing in Commercial Real Estate MOST POPULAR OPINION Opinion: The Global War on the Jews Opinion: Benjamin Netanyahu: The Battle of Civilization Opinion: Black Lives Matter and the World’s Oldest Hatred Opinion: More on the Stifled Hunter Biden Probe Opinion: The Return of Taxachusetts RECOMMENDED VIDEOS The Wall Street Journal English Edition Subscribe NowSign In BACK TO TOP« WSJ Membership Buy Side Exclusives Subscription Options Why Subscribe? Corporate Subscriptions WSJ Higher Education Program WSJ High School Program Public Library Program WSJ Live Commercial Partnerships Customer Service Customer Center Contact Us Cancel My Subscription Tools & Features Newsletters & Alerts Guides Topics My News RSS Feeds Video Center Watchlist Podcasts Visual Stories Ads Advertise Commercial Real Estate Ads Place a Classified Ad Sell Your Business Sell Your Home Recruitment & Career Ads Coupons Digital Self Service More About Us Content Partnerships Corrections Jobs at WSJ News Archive Register for Free Reprints & Licensing Buy Issues WSJ Shop Facebook Twitter Instagram YouTube Podcasts Snapchat Google Play App Store Dow Jones Products Barron'sBigChartsDow Jones NewswiresFactivaFinancial NewsMansion GlobalMarketWatchRisk & ComplianceBuy Side from WSJWSJ ProWSJ VideoWSJ Wine Privacy NoticeCookie NoticeCopyright PolicyData PolicySubscriber Agreement & Terms of UseYour Ad ChoicesAccessibility Copyright ©2023 Dow Jones & Company, Inc. All Rights Reserved.",
    "originSummary": [
      "Android phone users often experience digital exclusion due to Apple's dominating iMessage system, as reported by the Wall Street Journal.",
      "Compatibility issues, such as being left out of group chats or plans made via iMessage, escalate this problem for Android users.",
      "Minor details like changes in chat bubble color can also contribute to this sense of exclusion."
    ],
    "commentBody": "",
    "commentSummary": [
      "The former Tesla executive, Peter Carlsson, plans to compete against Tesla with his own electric vehicle battery company, Northvolt, based in Sweden.",
      "Northvolt collaborates with Siemens to produce cost-efficient batteries, utilizing \"digital twin\" technology. This tech uses machine learning to create continuous digital updates of the production process which advances the speed to market the product.",
      "Northvolt aims for sustainability by seeking to recycle 50% of the raw materials used in battery production by 2030."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1698843976143
  },
  {
    "title": "How to know if you're blocked on iMessage",
    "originLink": "https://www.laptopmag.com/phones/how-to-know-if-youre-blocked-on-imessage",
    "originBody": "Skip to main content Search Subscribe RSS US Edition Laptops Software Phones Gaming Tablets Headphones More Forums TRENDING Early Black Friday deals Best laptops Best business laptops Best laptop backpacks When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Phones How to know if you're blocked on iMessage How-to By Sarah Chaney published 3 days ago Their phone could be off or in Focus mode... or you could be blocked (Image credit: Future) If someone isn't responding to your iMessage, there's a chance you could be blocked. That said, there's also a chance that you're simply texting a phone that's been turned off or is out of service. When someone else's Focus mode is set to Do Not Disturb, you won't be able to get a hold of them, but you'll see a clear sign that they're using this mode. To see if someone has blocked you on iMessage, check out these telltale signs. Look at your iMessage conversation The first place to check for signs that you've been blocked on iMessage is in your iMessage thread with the person you think might've blocked you. Sponsored Links Simple Japanese Trick for Nail Infection Healthy Guru Watch Now Look below the last text you sent to see if it says Delivered, Read, or nothing underneath it. If your last text says Read, you're definitely not blocked. If there's nothing underneath your last text, that's a clear sign you've been blocked, but this indicator went away with the iOS 16.5 update. RECOMMENDED VIDEOS FOR YOU... On iPhones running iOS 16.5 or later, the space below your last text will say Delivered whether you're blocked or not on iMessages. If your phone is running iOS 16.4 or earlier and you see Delivered beneath your last text, you're not blocked. (Image credit: Apple) Seeing a Not Delivered message below your last text is not a sign you've been blocked. If you spot this message, it only means there was an error in sending your message. Tap the exclamation mark next to this text, and select Try Again to resend the text. You'll also want to pay attention to the bubble colors in your text thread. If you've been using iMessage with another iPhone user, your text bubbles are blue. If someone blocks you through iMessage, your texts will appear as green—the same bubble color you'll see in a thread with a non-iPhone user. Check your text thread to see if your messages went from blue to green recently. Unless the other person recently switched from iPhone to an Android device, this is a sign you've probably been blocked on iMessage. Seeing the moon icon doesn't mean you've been blocked In your iMessage conversation, if you see a moon icon next to \"[recipient] has notifications silenced,\" this is an indication that Focus mode's Do Not Disturb setting is turned on. This doesn't mean you've been blocked. Instead, the other person is trying to focus for some reason and has temporarily blocked all messages and calls—not just yours. An iPhone running anything earlier than iOS 15 won't display Focus mode notifications within an iMessage thread. Without this moon icon and message, there's no way to know if someone's using Do Not Disturb on iOS versions prior to iOS 15. Try calling the person you think blocked you For a more direct approach, try calling the person you think might have blocked you. Calling someone who's blocked you will make the call go straight to voicemail with barely one ring. If you leave a voicemail when you've been blocked, it'll appear in a separate voicemail section on the recipient's phone, and they'd have to go searching for it to listen to it. It's important to note that your call going straight to voicemail isn't always a sign you've been blocked. The person's phone could be off, out of service, or currently in Focus mode's Do Not Disturb setting. You can always hide your caller ID by using *67 before dialing or use someone else's phone to call, but this should only be used in case of emergency, like if you think an elderly parent might have blocked you by accident. If the call doesn't go straight to voicemail, but instead starts ringing, you've been blocked. That said, once you know you've been blocked, you shouldn't use *67 to invade someone's privacy. If you think someone blocked you on iMessage, they might have also blocked you on third-party apps. You can check to see if someone blocked you on Instagram, X (Twitter), WhatsApp, and other third-party apps. Best MacBook deals Apple M2 MacBook Air (2022) $1,199 $1,049 VIEW DEAL See all prices Apple Macbook Pro 13 (2022) $1,049 VIEW DEAL See all prices Apple MacBook Pro 14-inch (2023) $1,999 $1,799 VIEW DEAL See all prices Apple MacBook Pro 16-inch M2 (2023) $1,939.93 VIEW DEAL See all prices Apple Macbook Air (M1 2020) $999.99 $749.99 VIEW DEAL See all prices Apple MacBook Pro 14-inch (2021) $2,499 $2,299 VIEW DEAL See all prices Apple MacBook Pro 16-inch 2021 $2,499 $1,998.99 VIEW DEAL See all prices We check over 250 million products every day for the best prices Stay in the know with Laptop Mag Get our in-depth reviews, helpful tips, great deals, and the biggest news stories delivered to your inbox. Contact me with news and offers from other Future brands Receive email from us on behalf of our trusted partners or sponsors By submitting your information you agree to the Terms & Conditions and Privacy Policy and are aged 16 or over. Sarah Chaney MORE ABOUT PHONES How to create custom highlight reels in Google Photos Get a free $100 gift card with your Galaxy S23 FE purchase LATEST Walmart Black Friday deals 2023 — 23 best early discounts SEE MORE LATEST ► The best free VPN of 2023 We help you pick the best free VPN service in 2023, explaining the pros, cons, and risks. Avoid VPN scams and get a free VPN for streaming Netflix. Simple Japanese Trick for Nail Infection Healthy GuruSponsored Watch Now McAfee License Renewal Notice McAfee.comSponsored Install Now Most Windows Users Didn’t Know They Can Block Ads Smart Security TipsSponsored Learn More MOST POPULAR How to stop Instagram from tracking your web activity By Sarah ChaneyOctober 20, 2023 How to screen record on Mac By Rami TabariOctober 19, 2023 How to create generative AI images from Google Search By Sarah ChaneyOctober 15, 2023 How to bypass Windows 11 hardware requirements By Sarah ChaneyOctober 13, 2023 How to change background on Teams By Rael HornbyOctober 10, 2023 How to add widgets to the desktop of MacOS Sonoma By Momo TabariOctober 07, 2023 How to sort in Excel: From A to Z to small to large By Rami TabariOctober 06, 2023 How to make a graph in Excel By Rami TabariOctober 05, 2023 iPhone 15 Pro’s Action Button can do more than one thing — how to set it up By Jason EnglandSeptember 29, 2023 Windows 11's Copilot and AI upgrade lands today! Here's how to download the latest update By Rael HornbySeptember 26, 2023 How to update to macOS 14 Sonoma: Prepare for and install today’s upgrade! By Rael HornbySeptember 26, 2023 Advertisement Advertisement MORE FROM LAPTOP MAG... 1 XREAL Air 2 AR glasses review — An augmented reality check 2 Lenovo Yoga AIO 9i review: Excellent performance, low cost 3 Onyx Boox Palma E-Reader review: A Kindle that fits in your pocket 4 How to turn off notifications in Google Chrome 5 How to know if you're blocked on iMessage Advertisement Laptop Mag is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. Terms and conditions Contact Future's experts Privacy policy Cookies policy Accessibility Statement About us Archive Careers Do not sell or share my personal information © Future US, Inc. Full 7th Floor, 130 West 42nd Street, New York, NY 10036. Subscribe to our notifications for the latest news and updates. You can disable anytime. Subscribe Later",
    "originSummary": [
      "The article provides a guide for determining if you've been blocked on iMessage, with indications being a lack of updates under your last text, and messages changing color from blue to green.",
      "Other suggested methods to verify include attempting a call, noticing if it goes directly to voicemail, but it cautions that this could also imply that the receiver's phone is turned off, out of service, or in Do Not Disturb mode.",
      "While offering these tips, the article emphasizes respecting users' privacy and discourages employing invasive techniques to ascertain the block status."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1698843976143
  },
  {
    "title": "Everything New in iOS 17.2 Beta 1: Journal App, Translate ...",
    "originLink": "https://www.macrumors.com/2023/10/26/ios-17-2-beta-1-features/",
    "originBody": "Skip to Content Got a tip for us?Let us know Front Page Roundups Guides How Tos Reviews Buyer's Guide Forums iPhone 15iOS 17iPhone 15 ProApple Vision PromacOS SonomavisionOSwatchOS 10MacBook Pro 14 & 16\"HomePodiPhone 14Apple TViPad ProApple Watch Ultra 2iPadAirPods 3Apple CarApple Pro Display XDRHomePod miniMac ProMacBook AirMacBook Pro 13\"iPhone 13AirPods MaxAirPods ProApple DealsApple Studio DisplayApple Watch SEMac StudioiMaciPad AiriPad miniiPhone SEMac miniApple Watch Series 9iPhone 16CarPlayiPadOS 17Apple PayApple Black Friday All > Everything New in iOS 17.2 Beta 1: Journal App, Translate Action, iMessage Sticker Reactions and More Thursday October 26, 2023 2:28 pm PDT by Juli Clover Apple today released the first beta of an upcoming iOS 17.2 update, and it adds a whole slew of features. You can now access the Journal app that Apple has been working on, and share playlists with friends so they can add songs. iOS 17.2 is limited to developers right now, but it should soon be coming to public beta testers. We're expecting to see iOS 17.2 released to the public around November or December. Journal App iOS 17.2 includes the Journal app that Apple announced as part of iOS 17. With the Journal app, users can record their daily activities and thoughts, with Apple providing optional prompts that can be used as inspiration. A Journal entry can be added by tapping on the \"+\" button in the Journal app, and from there, users can choose a suggestion as the basis for their writing or just opt for \"New Entry\" to write anything at all. Entries are automatically tagged with a date for organizational purposes, but there are options for bookmarking, too. Journal entries can include images, voice recordings, and location tags. Messages App Sticker Tapback Reactions You can now long press on any chat bubble in the Messages app to add a sticker response that serves as an alternative to a tapback reaction. Tapping on \"Add Sticker\" lets you choose either a sticker or an emoji to apply to the corner of an iMessage. There was already an option to drag a sticker or an emoji onto any message bubble, but this is a much quicker method of quickly responding to an incoming message with a quick graphic that is more expressive than a tapback reaction. Collaborative Apple Music Playlists There is now an option to create a playlist in Apple Music that multiple people can add to. In a playlist you have made, tap on the three dot icon in top right of the app. From there, select the Collaborate option and choose \"Start Collaboration.\" You'll be able to create a link to the playlist, and anyone who has access to that link can add to it. You can also invite people to join via QR code, and if you want, you can approve each person that asks to join. Favorites Apple Music Playlist Songs that you have favorited in the Apple Music app are now aggregated into a Favorites playlist. Apple Music Listening History Focus Filter There is a Focus Filter for the Apple Music Listening History feature, so if you want to let someone else use your device to listen to music, you can activate this to turn off the Listening History so their song choices won't affect your recommendations. Action Button Translate iPhone 15 Pro and iPhone 15 Pro Max users can now choose a new Translate option for the Action Button. When the Action Button is set as Translate, pressing to hold causes the iPhone to pop up a Translate window that listens for spoken text. It is able to translate from one set language to another, using the languages that you have previously set up in the Translate app. iMessage Contact Key Verification First previewed in December 2022, iMessage Contact Key Verification is a feature designed for those who face \"extraordinary digital threats,\" such as journalists, human rights activists, and government officials. Users can ensure that there is no \"man in the middle\" snooping on iMessage conversations, and there is a Contact Verification Code so that iMessage users can verify that they're speaking to the correct individual during in-person meetings or on FaceTime calls. Messages in iCloud Syncing The \"Messages\" section in iCloud in the Settings app has been renamed to \"Messages in iCloud.\" It shows the total amount of storage that messages are taking up, the number of messages synced to iCloud, and the time of the last sync. There's also a \"Sync Now\" option to force an update. Apple previously said that additional settings would be synced through Messages in iCloud in iOS 17, like Text Message Forwarding, Send & Receive accounts, and SMS filters across devices, so this may see those additional settings syncing. Apple TV App Apple has removed the separate tabs for Movies and TV shows in the Store section of the Apple TV app on the iPhone and the iPad. Bloomberg's Mark Gurman has said that Apple also plans to remove the option to purchase TV shows and movies from the iTunes app as part of a TV app redesign, but that has not yet happened. Emergency Alerts Local Awareness Under Notifications > Emergency Alerts in the Settings app, there is a new \"Local Awareness\" option that can be turned on. Apple says that Local Awareness uses your approximate location to improve the timeliness, accuracy, and reliability of emergency alerts. Weather Widgets There are new Details, Daily Forecast, and Sunrise/Sunset widgets. Detail shows information like precipitation chance, UV index, wind speed, and air quality, while Daily Forecast offers the weather for the next few days in a small widget size. Sunrise/Sunset shows the sunrise and sunset times for each day. Digital Clock Widget There is a new Digital Clock widget that can be added to the Home Screen or Lock Screen. Contact Posters You can now select a rainbow-colored text for your name when setting up a Contact Poster in the Contacts app. Books Page Turning Animation There's a new \"Fast Fade\" option for the page turning animation in the Books app. Apple has also removed the icon that you could turn on to scroll through content quickly. AirPlay There's a new \"AirPlay Receiver\" setting that will allow the upcoming Apple Vision Pro headset to stream or share content to an iPhone. It also looks like the AirPlay feature for hotels that Apple announced earlier this year is live or will be live soon. It is designed to let you AirPlay content from your iPhone or iPad to an AirPlay-equipped smart TV. Memoji Apple added a \"Body\" section for Memoji where users can customize waist, bust, shoulders, and arms. News App The News app now supports Live Activities for following news-related events such as elections. More iOS 17.2 Beta 1 Features Know of a feature that we left out in this list? Let us know in the comments below. Related Roundups: iOS 17, iPadOS 17 Related Forums: iOS 17, iPadOS 17 [ 53 comments ] Related Stories Get weekly top MacRumors stories in your inbox. Top Rated Comments groove-agent 6 days ago at 04:12 pm Why isn't Journal released on MacOS? Journaling requires typing and MacOS is the best platform for typing. iOS is not. I must be missing something. Score: 16 Votes (LikeDisagree) gaximus 6 days ago at 03:58 pm This feel like a bigger update than iOS 17 Score: 15 Votes (LikeDisagree) rti92391 6 days ago at 03:14 pm Who the heck has 33GB of iMessages? What are you getting sent 4K movies? Wow! That person seriously needs to delete their attachments! ? Bruh Score: 14 Votes (LikeDisagree) jimmyponi 6 days ago at 05:21 pm Who the heck has 33GB of iMessages? What are you getting sent 4K movies? Wow! That person seriously needs to delete their attachments! ? Take a breath before you see this ?? Score: 6 Votes (LikeDisagree) McWetty 6 days ago at 03:06 pm Who the heck has 33GB of iMessages? What are you getting sent 4K movies? Wow! That person seriously needs to delete their attachments! ? I have 18.4Gb. And I delete a lot of stuff I don’t want/need. Photos (from newer iPhones especially) take up a bunch of space. Score: 5 Votes (LikeDisagree) eastpointvet 5 days ago at 02:10 am Who the heck has 33GB of iMessages? What are you getting sent 4K movies? Wow! That person seriously needs to delete their attachments! ? Let me tuck mine then Score: 4 Votes (LikeDisagree) Read All Comments Popular Stories Brazilian Electronics Company Revives Long-Running iPhone Trademark Dispute Tuesday May 19, 2020 1:06 pm PDT by Juli Clover Apple has been involved in a long-running iPhone trademark dispute in Brazil, which was revived today by IGB Electronica, a Brazilian consumer electronics company that originally registered the \"iPhone\" name in 2000. IGB Electronica fought a multi-year battle with Apple in an attempt to get exclusive rights to the \"iPhone\" trademark, but ultimately lost, and now the case has been brought to... Read Full Article • 71 comments Here's How Apple's New iPhone to iPhone Data Migration Feature Works in iOS 12.4 Tuesday July 23, 2019 1:20 pm PDT by Juli Clover Apple this week released iOS 12.4, the newest version of iOS 12 available for iPhones and iPads. One of the new features in iOS 12.4 is an updated data migration option that uses device to device transfers rather than relying on iCloud. Apple didn't provide much information on the new data migration feature, so we thought we'd check it out in our latest YouTube video. Subscribe to the ... Read Full Article • 124 comments Next Article Hands-On With the New Journal App in the iOS 17.2 Beta Guides iOS 17 Features Our comprehensive guide highlighting every major new addition in iOS 17, plus how-tos that walk you through using the new features. iOS 17.1 Features AirDrop over the internet, Apple Music favorites and playlist art, StandBy mode and Action button tweaks, and more. iPhone 15 and iPhone 15 Pro: How to Use All the New Features Get the most out your iPhone 15 with our complete guide to all the new features. 50 New macOS Sonoma Features A deep dive into new features in macOS Sonoma, big and small. • macOS Sonoma Features to Check Out First • iPhone 15 vs. iPhone 15 Pro • 22 Hidden Features in watchOS 10 • Apple Watch Series 9 vs. Apple Watch Ultra 2 • 12 Time-Saving iPhone Tips • 10 macOS Tips to Make Your Life Easier • 14\" MacBook Pro vs. 16\" MacBook Pro • Apple M2 Chip • AirPods 3 vs. AirPods Pro 2 • One AirPod Not Working? See more guides Upcoming 14\" & 16\" MacBook Pro Order Now, Launches Nov 7 Updated with M3, M3 Pro, and M3 Max chip options, new Space Black color option on higher configurations, and more. iMac Order Now, Launches Nov 7 The new 24-inch iMac includes an M3 chip and supports Wi-Fi 6E, Bluetooth 5.3, and up to 24GB of memory. Apple Vision Pro Early 2024 The Apple Vision Pro AR/VR headset is set to launch in early 2024. It features dual 4K displays, gesture tracking, an M2 chip, and a $3,499 price tag. MacBook Air Early 2024? M3 models in 13.6\" and 15.3\" sizes. • iPad Pro See full product calendar Other Stories How to Cancel Your Apple Subscriptions 2 days ago by Tim Hardwick How to Check Your Mac's Warranty and AppleCare+ Status 2 days ago by Tim Hardwick These 3 Apple Accessories Expected to Switch to USB-C Next Week 5 days ago by Joe Rossignol Apple Watch Double Tap: What It Does and How to Get It 6 days ago by Tim Hardwick iOS 17.1: How to Shuffle a Photo Album on Your Lock Screen 1 week ago by Tim Hardwick MacRumors attracts a broad audience of both consumers and professionals interested in the latest technologies and products. We also boast an active community focused on purchasing decisions and technical aspects of the iPhone, iPod, iPad, and Mac platforms. About MacRumors.com Advertise on MacRumors Our Staff Arnold Kim Editorial Director Email • Twitter Eric Slivka Editor in Chief Email • Twitter Juli Clover Managing Editor Email • Twitter Joe Rossignol Senior Reporter Email • Twitter Mitchel Broussard Deals Editor Email • Twitter Tim Hardwick Senior Editor Email • Twitter Hartley Charlton Senior Editor Email • Twitter Marianne Schultz Project Manager Email • Twitter Dan Barbera Video Content Producer Email • Twitter Ryan Barrieau Graphic Designer Email •Twitter Steve Moser Contributing Writer Email • Twitter Marko Zivkovic Contributing Writer Email • Twitter Related Links Touch Arcade ‘Mr Traffic’ Version 2.2 Update Brings In the Spooky Collection With Zombie Traffic, New Missions, Achievements, and More ‘Super Mario Run’ Is Celebrating ‘Super Mario Bros. Wonder’ With Daily Free Stage Unlocks Until November 30th Adventure Game ‘Refind Self: The Personality Test Game’ Releases on November 14th for iOS, Android, and Steam ‘Monster Hunter Now’ November 2023 Events Detailed: Jyuratodus, Legiana, Carpenterbugs and Monster Bone+ Quests, and More ‘Dead Cells: Netflix Edition’ Arrives for Netflix Subscribers, Includes All Updates and DLC Halloween Invades ‘Vampire Survivors’ Thanks to a “Secret” Cheat Code New ‘Resident Evil Village’ iPhone 15 Pro Technical Analysis Video Covers Graphics Settings, Frame Rate, and More Roguelike Hack and Slash Game ‘Ultra Blade’ Will Get a Big Halloween Update This Thursday Bringing In New Game Modes, Levels, Enemies, and More YouTube ‘Scary Fast’ Apple Event: Everything You Need to Know! Apple's 'Scary Fast' October Mac Event: Everything You Can Expect to See! Let's Talk Apple's 'Scary Fast' October Mac Event (The MacRumors Show S02E42) Apple's NEW Journal App - Full Walkthrough in iOS 17.2 iOS 17.1 - Everything New! Copyright © 2000-2023 MacRumors.com, LLC. Privacy / DMCA contact / Affiliate and FTC Disclosure Accessibility Statement [ Featured On/Off ] [ Full Articles On/Off ] [ FluidFluid HD ] [ AutoLightDark ] Information from your device can be used to personalize your ad experience. Do not sell or share my personal information.",
    "originSummary": [
      "Apple has launched the first beta of iOS 17.2, introducing features including a Journal app, sticker responses in Messages, collaborative playlists in Apple Music, a new Focus Filter, and a translate feature on iPhone 15 Pro models.",
      "The update includes improvements to iCloud sync, revisions to the Apple TV Store section, and introduces an \"AirPlay Receiver\" for streaming to Apple Vision Pro headset, alongside live AirPlay for hotels.",
      "The full release is anticipated around November or December and touches upon video game updates and videos about Apple's recent events and iOS advancements."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1698843976143
  },
  {
    "title": "Omg, Nooo! Girl Whose Texts I'm Reading in Front of Me Tells ...",
    "originLink": "https://www.underthebutton.com/article/2023/10/imessage-for-all-and-for-all-a-good-night",
    "originBody": "under the button penn's only intentionally satirical publication NEWS OPINION IN PRINT VIDEO PROJECTS ABOUT NEWSLETTERS Omg, Nooo! Girl Whose Texts I’m Reading in Front of Me Tells Friend This Class Is Boring, Friend Agrees Photo by Maya Kreger Credit: Maya Kreger BY MAYA KREGER OCTOBER 30, 2023 AT 10:31 AM I want to walk a 5K for you. I’ll give you my organs. The blood that runs through my veins. The food off my plate. Anything. Everything for you, girl. You are so bored and I know how much you hate that. I’m glad your friend relates to you, there is strength in numbers. When I peered towards your laptop screen, seeing you bare your soul via iMessage to your close confidant, my faith in humanity was restored. With your brutal honesty about your emotional and mental state of ennui, I felt like you heard me, and listened. You look at me and see me. I like that. Boredom is the ailment that festers in our bones, aching with each breath. They used to say education was a blessing. They would shout that classes are the source of all inspiration. All the students and all the townspeople loved it so. They had you. They had us. No. You are bored. The American Education system, built on nepotism and a false sense of social mobility, has failed to entertain you. I bleed for you. I have a friend who agrees, too. Echoes of compliance are so nice in the morning with some cereal. Have you ever been alone, girl? Lacking a community to foster understanding and goodwill for all? Me neither. I’m glad there’s always someone around to agree. At the end of class, when you packed up your laptop and my entertainment, I felt certain that you were leaving your boredom behind, for good. I’ve never been so sure of something, but I know that you’re going places, huge places. Interesting people and activities and hope and peace and love and regular exercise at the gym (3 days a week). This is nothing new. I hope you find it. PennConnects under the button ABOUT CONTACT NEWSLETTERS JOIN PROJECTS THE DP 34TH STREET Copyright © 2023 The Daily Pennsylvanian, Inc. All Rights Reserved. Powered by Solutions by The State News.",
    "originSummary": [
      "The author humorously shares his experience of witnessing a girl's text exchange in class, expressing both sympathy and admiration for her genuine boredom and dismissiveness towards the class.",
      "This encounter prompts the author to critique the American Education system, implying that it may not be sufficiently engaging or stimulating for some students.",
      "The author ends by expressing hope that this girl finds more captivating and inspiring experiences beyond the confines of her present class."
    ],
    "commentBody": "",
    "commentSummary": [
      "Alteryx, a predictive analytics software provider, is now widening its user base to include coders alongside individuals with a data analytics degree.",
      "With the introduction of a new SDK package, Alteryx aims to democratize data analytics, facilitating easier access to pencil-erasable data workflows.",
      "Alteryx envisions itself as playing an essential role in heralding the \"age of self-service data analytics\" by creating a solution that enhances transparency of data fabrics."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1698843976144
  },
  {
    "title": "How to Sync Your Messages From iPhone to Mac",
    "originLink": "https://www.makeuseof.com/sync-messages-iphone-mac/",
    "originBody": "Newsletter Log in Trending Google Pixel iOS 17 Foldable Phones ChatGPT PS5 Scams Windows 11 Emojis Explained PC & MOBILE INTERNET PRODUCTIVITY LIFESTYLE TECH EXPLAINED MORE Join Our Team Newsletter Advertise With Us Log In Write For Us Home Contact Us Terms Privacy Copyright About Us Fact Checking Policy Corrections Policy Ethics Policy Ownership Policy Partnership Disclaimer Official Giveaway Rules Copyright © 2023 www.makeuseof.com AD AD AD AD AD AD HOME MAC How to Sync Your Messages From iPhone to Mac BY RACHEL MELEGRITO PUBLISHED 6 DAYS AGO Want to make sure you receive iPhone messages on your Mac as well? Here's what you need to do. Readers like you help support MUO. When you make a purchase using links on our site, we may earn an affiliate commission. Read More. Have you ever wondered if you can access your iPhone messages on your Mac? Thanks to the Apple ecosystem, syncing Messages between your iPhone and Mac is a piece of cake. This clever trick not only lets you view your messages but also allows you to send them directly from your Mac. So, let's jump right in and see how you can start getting your iPhone messages on your Mac. What You Need to Sync iPhone Messages to a Mac You can use an iPhone and a Mac together using Apple's Continuity feature in many ways. The hardware and software requirements vary depending on the Continuity feature you want to use. To sync the Messages app on your iPhone to your Mac, make sure both devices are signed into the same Apple ID first. Then, check if Wi-Fi and Bluetooth are enabled on your iPhone and Mac. You should also ensure that all the email addresses and phone numbers you use to send and receive messages are enabled on both devices (more on this below) so your messages can sync. Configure iMessage Settings on Your iPhone to Sync Texts To begin syncing iPhone messages to your Mac, you have to configure your Messages app's settings. Go to Settings > Messages and make sure iMessage is activated. If not, toggle it on and wait a few minutes for it to activate. Tap Send & Receive right below it. Under You can receive iMessages to and reply from, select your phone number, Apple ID, and any other email address you want to use for iMessage. Under Start new conversations from, selecting your mobile number should suffice unless you want to send new messages using an email address on iMessage. Look at the Apple ID at the bottom and ensure that you're using the same Apple ID on your Mac. 3 Images The above step only syncs iMessage across your devices. If you want to send and receive regular SMS text messages and MMS sent to your iPhone on your Mac, you must enable Text Message Forwarding. To do this, go to Settings Messages > Text Message Forwarding. Toggle the switch next to your Mac to allow it to send and receive iPhone messages. 3 Images Aside from syncing the Messages app across your iPhone and Mac, you may also want to save your iPhone messages to iCloud. Doing so keeps your conversations safe on iCloud. Before doing so, make sure you have enough iCloud storage. Configure iMessage Settings on Your Mac to Sync Texts Now that you're done setting up your iPhone, do the same on your Mac to begin getting iPhone messages on your Mac: Launch the Messages app on Mac. If it's your first time using it, you'll be prompted to log in with your Apple ID. Use the same Apple ID you use on your iPhone. Click Messages in the menu bar and select Settings from the dropdown. Head to the iMessage tab. Check the Enable Messages in iCloud option. Make sure you select the email address and phone number you selected on your iPhone. This ensures you receive all the iPhone messages on your Mac. For the Start new conversations from option at the bottom, select the same phone number or email you chose on your iPhone. Quit the Messages app and go back in. You should be able to view all the SMS, MMS, and iMessage texts and send and receive messages right on your Mac. If iMessage still isn't working on both your iPhone and Mac, check out some troubleshooting tips to fix iMessage on your device. Send and Receive Messages Anywhere When you sync iMessage across your devices, you can effortlessly view, send, and receive messages on both your iPhone and Mac. This streamlines your workflow and ensures you won't miss any crucial messages, regardless of the device you're using. Upgrade Your Tech IQ With Our Free Newsletters By subscribing, you agree to our Privacy Policy and may receive occasional deal communications; you can unsubscribe anytime. Comments Share Tweet Share Share Share Copy Email Link copied to clipboard RELATED TOPICS IPHONE MAC IMESSAGE IPHONE TIPS MAC TIPS INSTANT MESSAGING ABOUT THE AUTHOR Rachel Melegrito (171 Articles Published) Rachel Melegrito is a dedicated health and technology writer with a passion for continuous learning. She thrives on educating both herself and others about topics that can enhance overall well-being, boost productivity, and streamline workflows. ARTIFICIAL INTELLIGENCE WHATSAPP Exploring AI Apps, AI Crypto Trading Bots, and Useful Websites You Might Have Missed [Podcast] 18 hours ago The 6 Best Large Language Models in 2023 2 days ago 5 AI Tools to Help You Create Simple Comics 4 days ago See More TRENDING NOW The Top 14 Android Secret Security Codes You Need to Know How to Fix Windows Signing You In With a Temporary Profile The 7 Best Windows 11 Widgets for Productivity ✕ WATCH NEXT Play Video",
    "originSummary": [
      "The article provides a tutorial for syncing messages from an iPhone to a Mac using Apple's Continuity feature.",
      "Both devices must be logged into the same Apple ID, with Wi-Fi and Bluetooth enabled, for successful syncing.",
      "The process requires the configuration of iMessage settings on both the iPhone and Mac, allowing users to send, receive, and view messages on both devices."
    ],
    "commentBody": "",
    "commentSummary": [
      "IAG Insurance has introduced Artis, a machine learning-powered platform aimed at enhancing their claims process.",
      "The AI technology within Artis has the ability to recognize and catalogue images, which officials believe will lessen both the time and expenses involved in claim processing."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1698843976144
  }
]
