[
  {
    "id": 36891642,
    "title": "टेस्ला ने हजारों ड्राइविंग रेंज शिकायतों को दबाने के लिए बनाई गुप्त टीम",
    "originLink": "https://www.reuters.com/investigates/special-report/tesla-batteries-range/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36891642",
    "commentBody": "",
    "originSummary": [
      "टेस्ला पर आरोप लगाया गया है कि उसने अपनी इलेक्ट्रिक कारों में डैशबोर्ड रीडआउट में हेरफेर किया ताकि अतिरंजित ड्राइविंग रेंज अनुमान दिखाए जा सकें।",
      "कंपनी को वास्तविक ड्राइविंग रेंज के बारे में मालिकों से शिकायतें मिलीं जो अपेक्षाओं को पूरा नहीं करती हैं।",
      "टेस्ला ने रेंज से संबंधित मुद्दों के लिए सेवा नियुक्तियों को रद्द करने के लिए एक गुप्त टीम बनाई, जिसे \"डायवर्जन टीम\" के रूप में जाना जाता है।",
      "एक अध्ययन में पाया गया कि टेस्ला की रेंज का अनुमान है कि अन्य वाहन निर्माताओं की तुलना में कार कितनी दूरी तय कर सकती है।",
      "टेस्ला को ड्राइविंग रेंज का झूठा विज्ञापन करने के लिए जुर्माना का सामना करना पड़ा है, क्योंकि उन पर अधिक अनुकूल अनुमान उत्पन्न करने के लिए खामियों का फायदा उठाने का आरोप है।",
      "हाल ही में, टेस्ला ने रेंज शिकायतों को संभालने का काम वर्चुअल सर्विस एडवाइजर्स को स्थानांतरित कर दिया है।",
      "टेस्ला द्वारा जिस तरह से उनकी रेंज शिकायतों को संभाला गया है, उससे ग्राहकों ने निराशा व्यक्त की है।"
    ],
    "commentSummary": [
      "ऐसे आरोप हैं कि टेस्ला ड्राइविंग रेंज के मुद्दों के बारे में शिकायतों को दबा रहा है।",
      "ड्राइवरों ने गलत बैटरी रेंज संकेतकों के कारण फंसे होने की सूचना दी है।",
      "उपयोगकर्ता इस मुद्दे पर टेस्ला की प्रतिक्रिया से संतुष्ट नहीं हैं।",
      "आंतरिक दहन इंजन की तुलना में इलेक्ट्रिक इंजन की दक्षता चर्चा का विषय है।",
      "इलेक्ट्रिक वाहनों में न्यूट्रल मोड की जरूरत पर भी बहस चल रही है।",
      "रेंज बढ़ाने और रेंज अनुमानों में सुधार के लिए संभावित समाधानों पर चर्चा की जा रही है।",
      "यूजर्स टेस्ला की गाड़ियों के साथ अपने अनुभव शेयर कर रहे हैं।",
      "ईवी चार्जिंग इंफ्रास्ट्रक्चर के साथ चुनौतियों पर चर्चा की जा रही है।",
      "टेस्ला कारों के साथ समग्र संतुष्टि भी बातचीत का विषय है।"
    ],
    "points": 738,
    "commentCount": 661,
    "retryCount": 0,
    "time": 1690454657
  },
  {
    "id": 36896034,
    "title": "ब्लेज़िंगएमक्यू: उच्च प्रदर्शन ओपन सोर्स संदेश कतार प्रणाली",
    "originLink": "https://bloomberg.github.io/blazingmq/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36896034",
    "commentBody": "",
    "originSummary": [
      "ब्लेज़िंगएमक्यू एक ओपन-सोर्स संदेश पंक्तिबद्ध प्रणाली है जो किसी भी बाहरी निर्भरता के बिना सी ++ में लिखी गई है।",
      "यह दक्षता, विश्वसनीयता और आधुनिक वर्कफ़्लो को प्राथमिकता देता है।",
      "सिस्टम कम विलंबता प्रदान करता है और उच्च फैन-आउट वर्कफ़्लो के लिए नेटवर्क बैंडविड्थ और विलंबता को कम करने के लिए एक अद्वितीय मल्टी-हॉप नेटवर्क टोपोलॉजी का उपयोग करता है।",
      "ब्लेज़िंगएमक्यू जटिल प्रसंस्करण पाइपलाइनों के लिए क्लस्टरिंग, प्रतिकृति और संदेश रूटिंग रणनीतिप्रदान करता है।"
    ],
    "commentSummary": [
      "ओपन-सोर्स मैसेजिंग प्लेटफॉर्म ब्लेजिंगएमक्यू को ब्लूमबर्ग ने जारी किया है।",
      "यह फैन-आउट कार्यक्षमता और वितरित संदेश क्षमताओं जैसी सुविधाओं के साथ उच्च प्रदर्शन संदेश कतार प्रदान करता है।",
      "सिस्टम को भारी कम्प्यूटेशन के लिए डिज़ाइन किया गया है और इसमें वैन ट्रैफ़िक को कम करने और लागत दक्षता में सुधार करने के लिए एक मल्टी-हॉप नेटवर्क टोपोलॉजी शामिल है।",
      "ब्लेज़िंगएमक्यू के बारे में चर्चा में एनीमेशन टूल, सुरक्षा विचार और प्रदर्शन तुलना जैसे विषय शामिल हैं।",
      "उपयोगकर्ता ब्लेज़िंगएमक्यू के प्रलेखन की प्रशंसा करते हैं और अतिरिक्त सुविधाओं और ग्राहकों में रुचि व्यक्त करते हैं।"
    ],
    "points": 508,
    "commentCount": 184,
    "retryCount": 0,
    "time": 1690475254
  },
  {
    "id": 36892970,
    "title": "लहरदार दीवारें एक सीधी दीवार (2020) की तुलना में कम ईंटों का उपयोग करती हैं।",
    "originLink": "https://twistedsifter.com/2020/06/how-wavy-crinkle-crankle-walls-use-less-bricks-than-straight-walls/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36892970",
    "commentBody": "",
    "originSummary": [
      "लहरदार दीवारें, इंग्लैंड में लोकप्रिय, एक वास्तुशिल्प डिजाइन है जो सीधी दीवारों की तुलना में कम ईंटों का उपयोग करती है।",
      "ये दीवारें पार्श्व बलों के लिए स्थिरता और प्रतिरोध प्रदान करती हैं, जिससे वे हवा के लिए अधिक प्रतिरोधी हो जाते हैं।",
      "लहरदार दीवारों के उदाहरण सफोल्क और वर्जीनिया विश्वविद्यालय में पाए जा सकते हैं।",
      "डिजाइन थॉमस जेफरसन के लिए अद्वितीय नहीं है; यह एक स्थापित अंग्रेजी निर्माण शैली का अनुकूलन है।",
      "दीवारों में लहरदार लहरें लॉनघास काटने वालों के लिए नेविगेट करना मुश्किल बना सकती हैं।"
    ],
    "commentSummary": [
      "मंच चर्चा लहरदार दीवारों या ज़िगज़ैग बाड़ के उपयोग पर केंद्रित है।",
      "लहरदार दीवारों को कम सामग्री की आवश्यकता होती है और सीधी दीवारों की तुलना में अधिक स्थिर होती हैं।",
      "वे निर्माण और रखरखाव के लिए आसान हैं, खासकर ठंडी जलवायु में।",
      "टिप्पणीकार लहरदार दीवारों के फायदों पर चर्चा करते हैं, जिसमें लागत बचत, सौंदर्य अपील और गर्म माइक्रॉक्लाइमेट बनाने की क्षमता शामिल है।",
      "चर्चा इस प्रकार की बाड़ लगाने के लिए उत्पत्ति और विभिन्न नामों की भी पड़ताल करती है।",
      "सर्पाकार दीवारों के बारे में चर्चा है, जो ईंटों से बनी लहरदार दीवारें हैं और पार्श्व बलों के लिए बेहतर प्रतिरोध प्रदान करती हैं।",
      "बातचीत पारंपरिक सीधी दीवारों की तुलना में लहरदार दीवारों की व्यावहारिकता और सौंदर्यशास्त्र पर बहस करती है।"
    ],
    "points": 504,
    "commentCount": 229,
    "retryCount": 0,
    "time": 1690463801
  },
  {
    "id": 36888954,
    "title": "टारस्नैप आउटेज पोस्टमॉर्टम",
    "originLink": "https://mail.tarsnap.com/tarsnap-announce/msg00050.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36888954",
    "commentBody": "",
    "originSummary": [
      "टारस्नैप सेवा ने 2 जुलाई से 3 जुलाई, 2023 तक एक महत्वपूर्ण आउटेज का अनुभव किया।",
      "अमेजन के ईसी2 यूएस-ईस्ट-1 क्षेत्र में होस्ट किए गए सेंट्रल सर्वर पर सिस्टम स्टेटस चेक विफल होने के कारण यह आउटेज हुआ।",
      "सर्वर को एक नए EC2 इंस्टेंस पर पुनरारंभ किया गया था, लेकिन फ़ाइल सिस्टम भ्रष्टाचार का पता चला था।",
      "पुनर्प्राप्त करने के लिए, मेटाडेटा हेडर को अमेज़ॅन एस 3 से पढ़ा गया था और संचालन को स्थानीय रूप से फिर से खेला गया था, लेकिन 2014 में लिखे गए कोड के कारण समस्याएं उत्पन्न हुईं जो मशीन के पुन: स्वामित्व के लिए जिम्मेदार नहीं थीं।",
      "डिस्क थ्रूपुट सीमाओं के कारण राज्य पुनर्निर्माण प्रक्रिया अपेक्षा से धीमी थी।",
      "सर्वर को लगभग 26 घंटे और 16 मिनट के बाद ऑनलाइन वापस लाया गया था।",
      "आउटेज की भरपाई के लिए, उपयोगकर्ताओं के टारस्नैप खातों को एक महीने की भंडारण लागत का 50% क्रेडिट किया गया था।"
    ],
    "commentSummary": [
      "उपयोगकर्ता एक बैकअप सेवा, Tarsnap पर हाल ही में आउटेज पर चर्चा करते हैं।",
      "Tarsnap के संस्थापक को उनके तकनीकी कौशल के लिए प्रशंसा की जाती है।",
      "बैकअप योजनाओं और डेटा बैकअप के महत्व के बारे में चिंताओं को उठाया जाता है।",
      "विचार-विमर्श एसएलए (सेवा स्तरीय समझौते) और आपदा वसूली के लिए परीक्षण के इर्द-गिर्द घूमता है।",
      "उपयोगकर्ता अन्य बैकअप सेवाओं की तुलना में टारस्नैप के मूल्य निर्धारण और मूल्य पर बहस करते हैं।",
      "एन्क्रिप्शन, डिडुप्लीकेशन और विभिन्न प्रणालियों के साथ संगतता जैसी सुविधाओं का उल्लेख किया गया है।",
      "Tarsnap की तुलना अन्य बैकअप सेवाओं और S3 जैसे क्लाउड स्टोरेज समाधानों से की जाती है।",
      "चर्चा टारस्नैप के संबंध में पोस्टग्रेस, MySQL और S3 जैसे विभिन्न स्टोरेज सिस्टम के उपयोग पर भी स्पर्श करती है।"
    ],
    "points": 486,
    "commentCount": 283,
    "retryCount": 0,
    "time": 1690432436
  },
  {
    "id": 36894932,
    "title": "एस 3 नामक एक बहुत बड़ी भंडारण प्रणाली का निर्माण और संचालन",
    "originLink": "https://www.allthingsdistributed.com/2023/07/building-and-operating-a-pretty-big-storage-system.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36894932",
    "commentBody": "",
    "originSummary": [
      "एंडी वॉरफील्ड, एस 3 में एक वीपी और प्रतिष्ठित इंजीनियर, अमेज़ॅन के भंडारण प्रणाली, एस 3 के निर्माण और संचालन में अंतर्दृष्टि साझा करते हैं।",
      "लेख एक वैश्विक भंडारण सेवा के प्रबंधन में सॉफ्टवेयर, हार्डवेयर और लोगों पर विचार करने के महत्व पर जोर देता है।",
      "गर्मी और लोड वितरण के प्रबंधन में चुनौतियों पर चर्चा की जाती है।",
      "डेटा प्लेसमेंट और स्थायित्व सुनिश्चित करने के लिए प्रतिकृति और एराश्योर कोडिंग का उपयोग किया जाता है।",
      "शार्डस्टोर नामक एक नई भंडारण परत के कार्यान्वयन पर प्रकाश डाला गया है।",
      "सॉफ्टवेयर विकास में स्वामित्व के महत्व को रेखांकित किया गया है।",
      "लेखक सिस्टम, संचालन और संगठनात्मक चुनौतियों को समझने में अमेज़ॅन में अपना अनुभव साझा करता है।"
    ],
    "commentSummary": [
      "चर्चा अमेज़ॅन एस 3 जैसे बड़े पैमाने पर भंडारण प्रणाली के निर्माण और संचालन की चुनौतियों और विचारों पर केंद्रित है।",
      "ओपन सोर्स लाइब्रेरी, चेकसमिंग, और संभावित टकराव के साथ मुद्दों को बातचीत में संबोधित किया जाता है।",
      "क्लाउड स्टोरेज के लाभ और समांतरता के महत्व पर प्रकाश डाला गया है।",
      "रिमोट स्टोरेज सिस्टम और स्थानीय एसएसडी के बीच व्यापार-बंद पर चर्चा की जाती है।",
      "प्रारंभिक डेटा भंडारण उपकरणों और डेटा संप्रभुता समाधानों का उल्लेख किया गया है।",
      "अमेज़ॅन ग्लेशियर में उपयोग किए जाने वाले भंडारण माध्यम के बारे में अटकलें प्रस्तुत की जाती हैं।",
      "अमेज़ॅन एस 3 के तकनीकी डिजाइन, जिसमें ब्लूरे डिस्क का उपयोग, लोड वितरण और सेवाओं के प्रबंधन में स्वामित्व शामिल है, का पता लगाया गया है।",
      "अमेज़ॅन एस 3 को इसके प्रभावशाली प्रदर्शन और इसकी वास्तुकला में माइक्रोसर्विसेज के उपयोग के लिए सराहा जाता है।"
    ],
    "points": 363,
    "commentCount": 83,
    "retryCount": 0,
    "time": 1690471235
  },
  {
    "id": 36899656,
    "title": "कोई भी आपके चैटबॉट से बात नहीं करना चाहता है",
    "originLink": "https://lucas-mcgregor.medium.com/no-one-wants-to-talk-to-your-chatbot-9d8bb1a70266",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36899656",
    "commentBody": "",
    "originSummary": [
      "लेख उपयोगकर्ताओं के लिए प्राथमिक इंटरफ़ेस के रूप में वेबसाइटों से खोज इंजन में संक्रमण पर चर्चा करता है।",
      "जानकारी तक पहुंचने के लिए पसंदीदा उपकरण के रूप में मोबाइल ऐप और वर्चुअल पर्सनल असिस्टेंट में वृद्धि हुई है।",
      "आभासी व्यक्तिगत सहायकों को बेहतर बनाने के लिए भाषा कौशल महत्वपूर्ण हैं।",
      "व्यक्तिगत सहायक उपयोगकर्ताओं के लिए शुरुआती बिंदु बन सकते हैं, जिससे विभिन्न चैटबॉट और ऑनलाइन सहायकों के साथ बातचीत करने की आवश्यकता समाप्त हो सकती है।",
      "लेख का निष्कर्ष है कि मनुष्य चैटबॉट के साथ बातचीत करने में रुचि नहीं रखते हैं और विशेष रूप से व्यक्तिगत आभासी सहायकों के लिए चैटबॉट डिजाइन करने का सुझाव देते हैं।"
    ],
    "commentSummary": [
      "चैटबॉट्स को वेबसाइटों पर भ्रामक और विज्ञापन से भरे उपयोगकर्ता इंटरफेस के लिए संभावित प्रतिस्थापन के रूप में माना जा रहा है।",
      "कुछ उपयोगकर्ता चैटबॉट्स को विज्ञापन प्लेटफार्मों के रूप में उपयोग किए जाने और उपयोगकर्ता विकल्पों में हेरफेर करने के बारे में चिंतित हैं।",
      "दूसरों का तर्क है कि चैटबॉट अधिक सुव्यवस्थित और व्यक्तिगत उपयोगकर्ता अनुभव प्रदान कर सकते हैं।",
      "चैटबॉट्स की प्रतिक्रियाओं और विश्वास और पारदर्शिता के मुद्दों में विज्ञापन को एकीकृत करने के बारे में चर्चा है।",
      "वेब पर मुफ्त जानकारी का मुद्रीकरण भी चर्चा का विषय है।",
      "चैटबॉट्स पर राय अलग-अलग होती है, कुछ उन्हें उपयोगी पाते हैं और अन्य मानव संपर्क पसंद करते हैं।",
      "चैटबॉट्स को एक केंद्रीकृत ऐप में एकीकृत करने के विचार का उल्लेख किया गया है।",
      "टिप्पणीकार चैटबॉट के उपयोग के बारे में सकारात्मक अनुभव और संदेह दोनों साझा करते हैं।"
    ],
    "points": 362,
    "commentCount": 176,
    "retryCount": 0,
    "time": 1690489582
  },
  {
    "id": 36896343,
    "title": "€ 600k MRR के लिए बूटट्रैपिंग और Shopify द्वारा मारा जा रहा है: चेकआउट एक्स",
    "originLink": "https://www.leteyski.com/bootstrapping-to-600k-mrr-and-getting-killed-by-shopify-the-story-of-checkout-x",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36896343",
    "commentBody": "",
    "originSummary": [
      "चेकआउट एक्स एक ऐसी कंपनी है जिसने पोस्ट-परचेज अपसेल के साथ एक-पेज का Shopify चेकआउट बनाया है।",
      "उन्हें भुगतान प्रदाताओं के साथ चुनौतियों का सामना करना पड़ा और चेकआउट फ़ंक्शन पर Shopify के नियंत्रण के कारण कठिनाइयों का सामना करना पड़ा।",
      "कंपनी ने साझेदारी, वायरलिटी और एक प्रभावी सहबद्ध कार्यक्रम के माध्यम से ग्राहकों का अधिग्रहण किया।",
      "लेखक ने WooCommerce में माइग्रेट करने, धन उगाहने, अधिग्रहण या Shopify पर मुकदमा करने जैसे विकल्पों पर विचार किया।",
      "Shopify से कोई खरीद प्रस्ताव प्राप्त नहीं हुआ था।",
      "चुनौतियों के बावजूद, लेखक भविष्य में अपने स्टार्टअप अनुभवों को साझा करना जारी रखने की योजना बना रहा है।"
    ],
    "commentSummary": [
      "चर्चा एक उदाहरण के रूप में चेकआउट एक्स के मामले और Shopify के साथ इसके संबंधों का उपयोग करते हुए, तीसरे पक्ष के मंच पर व्यवसाय बनाने की चुनौतियों और जोखिमों पर केंद्रित है।",
      "प्रतिभागियों की स्थिति पर अलग-अलग राय है, कुछ इसे सफलता मानते हैं और अन्य इसे विफलता मानते हैं।",
      "बातचीत में छोटे व्यवसायों और बड़े प्लेटफार्मों के बीच अविश्वास चिंताओं और शक्ति की गतिशीलता को संबोधित किया जाता है।",
      "इस बात पर जोर दिया जाता है कि उद्यमियों के पास एक निकास रणनीति होनी चाहिए और पूरी तरह से एक मंच पर निर्भर होने के जोखिम को कम करने के लिए वैकल्पिक प्लेटफार्मों पर विचार करना चाहिए।",
      "कानूनी कार्रवाई की क्षमता और मंच के नियमों और शर्तों का पालन नहीं करने के परिणामों पर भी चर्चा की जाती है।"
    ],
    "points": 315,
    "commentCount": 173,
    "retryCount": 0,
    "time": 1690476400
  },
  {
    "id": 36894613,
    "title": "कमरे का तापमान, परिवेश दबाव सुपरकंडक्टिविटी - इस बार वास्तविक के लिए?",
    "originLink": "https://scanalyst.fourmilab.ch/t/room-temperature-ambient-pressure-superconductivity-this-time-for-real/3512",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36894613",
    "commentBody": "",
    "originSummary": [
      "कोरिया के शोधकर्ताओं ने कथित तौर पर एलके -99 नामक एक सामग्री बनाई है जो कमरे के तापमान और परिवेश के दबाव पर सुपरकंडक्टिविटी दिखाती है।",
      "सामग्री में 400 K (127 °C) का महत्वपूर्ण तापमान है और शून्य-प्रतिरोध जैसे गुणों को प्रदर्शित करता है।",
      "सुपरकंडक्टिविटी को वॉल्यूम संकोचन के परिणामस्वरूप एक संरचनात्मक विकृति के लिए जिम्मेदार ठहराया जाता है।",
      "हालांकि परिणाम प्रकाशित नहीं किए गए हैं, अनुसंधान से संबंधित पेटेंट फाइलिंग की खोज की गई है।",
      "यदि मान्य है, तो इस खोज का पावर ट्रांसमिशन और क्वांटम कंप्यूटिंग जैसे क्षेत्रों में महत्वपूर्ण तकनीकी प्रभाव हो सकता है।",
      "हालांकि, क्षेत्र में झूठे दावों के पिछले उदाहरणों के कारण संदेह मौजूद है।"
    ],
    "commentSummary": [
      "चर्चा धागे का संग्रह सुपरकंडक्टिविटी से संबंधित विभिन्न विषयों की पड़ताल करता है, जिसमें कमरे के तापमान सुपरकंडक्टिविटी को प्राप्त करने का हालिया दावा भी शामिल है।",
      "चर्चाओं में संदेह स्पष्ट है, प्रतिभागियों ने प्रतिकृति और पूरी तरह से समीक्षा के महत्व पर जोर दिया।",
      "कमरे के तापमान सुपरकंडक्टिविटी के संभावित अनुप्रयोगों पर चर्चा की जाती है, जिससे क्षेत्र में संभावित सफलताओं के लिए प्रत्याशा पैदा होती है।",
      "दावे की वैधता के बारे में चिंताओं को उठाया जाता है, संदेह और कठोर जांच की आवश्यकता पर प्रकाश डाला जाता है।",
      "धागे सुपरकंडक्टिविटी में प्रगति के आसपास राय, अटकलों और उत्साह का मिश्रण प्रदान करते हैं।"
    ],
    "points": 296,
    "commentCount": 326,
    "retryCount": 0,
    "time": 1690469974
  },
  {
    "id": 36895300,
    "title": "LLaMA2 चैट 70B ने ChatGPT को पछाड़ा",
    "originLink": "https://tatsu-lab.github.io/alpaca_eval/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36895300",
    "commentBody": "",
    "originSummary": [
      "AlpacaEvalLeaderboard एक स्वचालित मूल्यांकनकर्ता है जो निर्देश-निम्नलिखित भाषा मॉडल का आकलन करता है।",
      "यह निर्देशों का पालन करने में विभिन्न मॉडलों के प्रदर्शन की तुलना करता है और जीत दर के आधार पर रैंकिंग उत्पन्न करता है।",
      "मूल्यांकन अल्पाकाफार्म मूल्यांकन सेट का उपयोग करके आयोजित किया जाता है और जीपीटी -4, क्लाउड या चैटजीपीटी जैसे ऑटो-एनोटेटर का उपयोग करता है।",
      "हालांकि, अल्पाका एवल की सीमाएं हैं, जिसमें लंबे आउटपुट और सरल निर्देशों के प्रति पूर्वाग्रह शामिल है।",
      "यह मॉडल की सुरक्षा का मूल्यांकन नहीं करता है।",
      "समुदाय को नए मॉडल, मूल्यांकनकर्ताओं और अधिक जटिल मूल्यांकन सेटों में योगदान करने के लिए प्रोत्साहित किया जाता है।"
    ],
    "commentSummary": [
      "प्रतिभागी LLAMA2 और ChatGPT जैसे AI मॉडल के प्रदर्शन, सीमाओं और संभावित अनुप्रयोगों पर चर्चा करते हैं।",
      "मॉडल गुणवत्ता के मूल्यांकन में मानव वरीयताओं को शामिल करने के महत्व का उल्लेख किया गया है।",
      "एआई मॉडल में जटिल दार्शनिक अवधारणाओं को पकड़ने की चुनौतियों पर प्रकाश डाला गया है।",
      "विभिन्न प्राकृतिक भाषा प्रसंस्करण मॉडल और कोडिंग कार्यों पर चर्चा की जाती है।",
      "प्रशिक्षण डेटा के संभावित संदूषण के बारे में चिंताएं उठाई जाती हैं।",
      "GPT-4 और LLAMA2 के लाभ और क्षमताओं का उल्लेख किया गया है।",
      "डेटा सुरक्षा और मॉडल स्थिरता के बारे में चिंताओं पर चर्चा की जाती है।",
      "अन्य एआई मॉडल और उनकी विशेषताओं पर भी चर्चा की जाती है।",
      "भाषा की उपलब्धता और हार्डवेयर आवश्यकताओं पर विचार किया जाता है।"
    ],
    "points": 295,
    "commentCount": 123,
    "retryCount": 0,
    "time": 1690472650
  },
  {
    "id": 36893654,
    "title": "बहादुर एक कांटा है, क्रोमियम रिस्किन नहीं।",
    "originLink": "https://twitter.com/BrendanEich/status/1684561924191842304",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36893654",
    "commentBody": "",
    "originSummary": [
      "ब्राउजर ब्रेव के संस्थापक ब्रेंडन ईच ने स्पष्ट किया कि यह ब्राउजर गूगल के क्रोमियम का एक कांटा है, न कि सिर्फ एक रीस्किन ्ड वर्जन।",
      "ब्रेव डब्ल्यूईआई (वेबएक्सटेंशन एपीआई) समर्थन को लागू नहीं करेगा।",
      "ब्राउज़र अन्य अवांछित सुविधाओं को भी अक्षम कर देगा जो Google के क्रोमियम में मौजूद हैं।"
    ],
    "commentSummary": [
      "चर्चा ब्रेव ब्राउज़र, क्रोमियम के उपयोग और अपस्ट्रीम से विचलित होने की इसकी क्षमता पर केंद्रित है।",
      "वैकल्पिक ब्राउज़र इंजन, गोपनीयता संबंधी चिंताएं और वाणिज्यिक हित चर्चा के विषय हैं।",
      "उपयोगकर्ता ब्रेव के प्रदर्शन, अनुकूलन विकल्पों और विश्वसनीयता पर अपनी राय साझा करते हैं।",
      "तकनीकी उद्योग में विश्वास, गोपनीयता और नैतिक प्रथाएं बातचीत में महत्वपूर्ण विषय हैं।",
      "ब्रेव की विशेषताओं, मुद्रीकरण मॉडल और ब्रेव और Google की विश्वसनीयता पर विचार विभाजित हैं।",
      "चर्चाएं ब्रेव और इसके चल रहे विकास के बारे में राय और चिंताओं की एक विस्तृत श्रृंखला प्रदान करती हैं।"
    ],
    "points": 272,
    "commentCount": 334,
    "retryCount": 0,
    "time": 1690466468
  }
]
