[
  {
    "title": "Goldman Sachs and BNP Paribas lead new funding for Fnality blockchain payments firm",
    "originLink": "https://www.reuters.com/technology/goldman-leads-new-funding-fnality-blockchain-payments-firm-2023-11-14/",
    "originBody": "Future of Money Goldman leads new funding for Fnality blockchain payments firm By Huw Jones November 14, 202312:43 AM UTCUpdated 13 hours ago People walk in the Goldman Sachs global headquarters in Manhattan, New York, U.S., November 15, 2021. REUTERS/Andrew Kelly/File Photo Acquire Licensing Rights LONDON, Nov 14 (Reuters) - Fnality, a blockchain-based wholesale payments firm, said on Tuesday it has raised 77.7 million pounds ($95.09 million) in a second round of funding backed by Goldman Sachs and other blue chip financial firms as it awaits Bank of England approval to start operations. UK-based Fnality seeks to bridge the gap between mainstream and digital finance to cut the time and cost of settling, managing collateral and making payments for financial market transactions. Advertisement · Scroll to continue Fnality said the round was led by Goldman Sachs and BNP Paribas, with participation from settlement houses DTCC and Euroclear, as well as Nomura and WisdomTree. The cash will be used for setting up a \"world-first\" round-the-clock global liquidity management network for new digital payment models in both wholesale financial markets and emerging tokenised asset markets, the company said. \"Fnality’s application of blockchain technology offers a resilient way for institutions to use central bank funds across a wide set of potential use cases, including instantaneous, cross-border, cross-currency payments, collateral mobility and security transactions,\" said Mathew McDermott, Goldman's global head of digital assets. Advertisement · Scroll to continue There was also additional investment from initial round backers Banco Santander, BNY Mellon, Barclays, CIBC, Commerzbank, ING, Lloyds Banking Group, Nasdaq Ventures, State Street, Sumitomo Mitsui Banking Corporation, and UBS. Finality raised 55 million pounds in its first whip round in June 2019. \"The culmination of this latest round brings Fnality's total capital raised to 132.7 million pounds as it readies for the commencement of initial Sterling Fnality Payment System operations in 2023, subject to regulatory approval,\" the company said in a statement. Advertisement · Scroll to continue The Bank of England in 2021 gave the green light to a new type of account at the central bank to cater for a wider range of anticipated payments systems, including those based on blockchain or distributed ledger technology that underpins cryptocurrencies. ($1 = 0.8171 pounds) (This story has been refiled to change photo) Reporting by Huw Jones; Editing by Susan Fenton Our Standards: The Thomson Reuters Trust Principles. Acquire Licensing Rights , opens new tab Read Next Future of Money category Cryptoverse: Bitcoin miners get stuck in a bear pit Spare a thought for the beleaguered bitcoin miner. Future of Money category Cryptoverse: Ether snaps at bitcoin's heels in race for crypto crown For years, ether could barely dream of challenging its big brother bitcoin. Now, its ambitions may be becoming more realistic. Future of Money category Cryptoverse: Blockchain bridges fall into troubled waters Another day, another hack - and another blockchain bridge burned. Future of Money category Cryptoverse: What crisis? Venture capitalists bet big on crypto It's not all doom and gloom. Future of Money category How crypto giant Binance became a hub for hackers, fraudsters and drug traffickers For five years, the world’s largest cryptocurrency exchange Binance served as a conduit for the laundering of at least $2.35 billion in illicit funds, a Reuters investigation has found. Future of Money category Crypto giant Binance kept weak money-laundering checks even as it promised tougher compliance, documents show",
    "originSummary": [
      "Fnality, a blockchain-based wholesale payments firm, has raised £77.7 million ($95.09 million) in a funding round led by Goldman Sachs and BNP Paribas.",
      "The funds will be used to create a global liquidity management network to support new digital payment models and reduce settlement time and costs in financial market transactions.",
      "Fnality is currently seeking approval from the Bank of England to commence its operations and aims to bridge the gap between traditional and digital finance."
    ],
    "commentBody": "",
    "commentSummary": ["-"],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699969737489
  },
  {
    "title": "Fnality Raises $95M in Series B Funding with Goldman Sachs and BNP Paribas",
    "originLink": "https://www.coindesk.com/markets/2023/11/14/first-mover-americas-goldman-leads-blockchain-firm-fnality-raise-of-95m/",
    "originBody": "Markets First Mover Americas: Goldman Leads Blockchain Firm Fnality Raise of $95M The latest price moves in crypto markets in context for Nov. 14, 2023. By Lyllah Ledesma Nov 14, 2023 at 1:01 p.m. UTC (Pepi Stojanovski/Unsplash) 10 Years of Decentralizing the Future May 29-31, 2024 - Austin, Texas The biggest and most established global hub for everything crypto, blockchain and Web3. Register Now This article originally appeared in First Mover, CoinDesk’s daily newsletter putting the latest moves in crypto markets in context. Subscribe to get it in your inbox every day. Latest Prices Top Stories Fnality, a fintech firm building tokenized versions of major currencies collateralized by cash held at central banks, has raised $95 million in Series B funding led by Goldman Sachs and BNP Paribas. DTCC, Euroclear, Nomura and WisdomTree participated in the round, which also saw further commitment from a number of institutions that backed Fnality’s $63 million fundraise back in 2019: Banco Santander, BNY Mellon, Barclays, CIBC, Commerzbank, ING, Lloyds Banking Group, Nasdaq Ventures, State Street, Sumitomo Mitsui Banking Corp. and UBS. Traders invested in XRP futures lost some $7.26 million in the past 24 hours as prices moved wildly following false rumors of a BlackRock (BLK) exchange-traded fund (ETF) filing. XRP prices jumped to 73 cents from 65 cents in 25 minutes after a tweet that suggested the financial behemoth had filed for an XRP ETF in the U.S. state of Delaware. Some crypto news firms reported on the filing as fact, which also helped amplify prices. Blackrock (BLK) confirmed it is not attempting to launch an XRP ETF. Blackrock has previously filed with the U.S. Securities and Exchange Commission (SEC) to launch spot bitcoin and ether ETFs. Prior to those SEC filings, were filings for a Delaware entity to act as the corporate vehicle for the product. Paperwork submitted Monday mimicked those forms, but was not in fact filed by the asset management giant. A U.S. judge ordered the end of an automatic stay on proceedings between bankrupt crypto firms FTX and BlockFi, meaning the two can start negotiating a claims settlement. BlockFi, a lender, filed for bankruptcy in late November last year, in part because of the ripple effects of the sudden collapse of FTX earlier that month. That triggered the automatic stay, halting proceedings between the two. BlockFi had an estimated $355 million frozen on the crypto exchange's platform and was owed a further $671 million by FTX's sister company, Alameda Research. The stay has been modified to allow FTX debtors to make \"arguments, defenses, counterclaims, setoffs, or otherwise ... with respect to the BlockFi claims in the FTX bankruptcy proceeding,\" according to a Nov. 13 court order by U.S. bankruptcy judge Michael Kaplan. Trending Posts UK Cabinet Reshuffle Gives Bim Afolami Responsibility for Crypto, CBDC, Replacing Griffith CPI Report Tuesday Could Provide Next Bitcoin Catalyst FTX Linked Wallets Shift $13.5M SOL as Solana Rally Takes a Breather Edited by Sheldon Reback. A D V E R T I S E M E N T A D V E R T I S E M E N T DISCLOSURE Please note that our privacy policy, terms of use, cookies, and do not sell my personal information has been updated. The leader in news and information on cryptocurrency, digital assets and the future of money, CoinDesk is a media outlet that strives for the highest journalistic standards and abides by a strict set of editorial policies. CoinDesk is an independent operating subsidiary of Digital Currency Group, which invests in cryptocurrencies and blockchain startups. As part of their compensation, certain CoinDesk employees, including editorial employees, may receive exposure to DCG equity in the form of stock appreciation rights, which vest over a multi-year period. CoinDesk journalists are not allowed to purchase stock outright in DCG. Lyllah Ledesma Lyllah Ledesma is a CoinDesk Markets reporter currently based in Europe. She holds bitcoin, ether and small amounts of other crypto assets. Follow @LedesmaLyllah on Twitter Learn more about Consensus 2024, CoinDesk’s longest-running and most influential event that brings together all sides of crypto, blockchain and Web3. Head to consensus.coindesk.com to register and buy your pass now. Read more about First Mover Markets Bitcoin",
    "originSummary": [
      "Fnality, a fintech firm, has raised $95 million in Series B funding led by Goldman Sachs and BNP Paribas.",
      "Traders invested in XRP futures suffered a loss of $7.26 million due to false rumors of a BlackRock exchange-traded fund (ETF) filing.",
      "A US judge has lifted the automatic stay on proceedings between bankrupt crypto firms FTX and BlockFi, enabling them to negotiate a claims settlement."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699969737489
  },
  {
    "title": "Web3 Marketing: Prioritizing Emotional Connection Over Technical Features",
    "originLink": "https://cointelegraph.com/innovation-circle/if-blockchain-projects-sold-cars-facts-vs-feelings-in-web3-marketing",
    "originBody": "GERMAN RAMIREZ 49 MINUTES AGO If blockchain projects sold cars: Facts vs. feelings in Web3 marketing But the masses — your main audience — don’t care about how it works. They care about how it meets their needs. 119 Total views Listen to article 0:00 INNOVATION CIRCLE Join us on social networks If you look closely enough at the Web3 sector through a marketer’s lens, you begin to see a fundamental mismatch between how blockchain and crypto projects market themselves and how effective brands do it in the real world. Let’s take a look at the car industry as an example to see what I mean. When carmakers reach out to their audiences, what are they projecting? Here are a few examples of the first words that jump out from the main web pages of household name car firms. Volvo: Freedom, sustainability and safety BMW: Design, luxury and sustainable mobility Peugeot: Irresistible, fun and elegant The visuals we see in car ads are similarly conceptual and yet highly evocative. Open roads and big skies show freedom. Green landscapes denote sustainability. Bright colors shout fun and youthful irreverence. Smooth lines and glossy surfaces speak to design, luxury and timeless elegance. How car marketing isn’t done Here are some messages that aren’t ever featured in car branding or that you’ll typically see anywhere in the main marketing touchpoints: The many applications of the car, such as how you can use it in daily life to get to work or do your shopping The locks, security and the track record of car thefts for this model How the car manufacturer organizes and governs itself, who owns shares in it or how those shares are distributed The relative merits of cars when compared to horses, bicycles or any other inferior/preceding method of transportation The fact that the car can move around on the same roads as other cars and (this is the kicker) as a passenger, you can easily get out of one car and into another seamlessly — without friction The market for fuel and how volatile it is How your fuel costs are calculated and who benefits from the fuel transactions How easy it is for mechanics to repair it and get parts for it, or for third parties to build add-ons like a new sound system or roof box. I’ve chosen cars here, but we could analyze virtually any segment and the results would be the same. A stark contrast On the one hand, we have an industry that understands the inherent symbiosis between offering and branding, and the industry knows how to leverage that symbiosis for maximum psychological effect. The very design of the product (in this case, the car) reflects the brand that the company is trying to convey for that model, and the brand messages are consistent throughout each touchpoint. It’s all engineered to invoke the same emotional response and meet the same set of human needs through clear positioning. Every time — no matter where you encounter the brand. On the other hand, we have an emerging (and — let’s be honest — often struggling to be heard) Web3 industry that’s trying too hard to push obscure selling points that nobody is buying. The emotional response to a brand isn’t an optional extra that can be navigated around using arguments about superior tech or governance — no matter how rational those arguments may be. People need to care, and they need to care enough in that tiny split second it takes to decide whether to say “yes” or “no.” In that tiny moment, only a few people care about the technical superiority, the transactions per second, the robust governance model or the high-security consensus. But, those factors aren’t enough for the vast majority of people to become emotionally invested. Finding the emotional levers: Responding to human needs So how do you know what people are buying? What’s driving them to make that emotional leap? What needs are they seeking to satisfy when they come looking for your offering? Well, you could ask them. We live in a world awash with data and the easy ability to collect as much of it as we wish. Market research is simply a matter of going out and asking the right questions. If you already have a live product or a service, find out from your existing customers why they’re a fan of your product. What is it exactly that they love? A slick user interface? Excellent value for the money? Time-saving capabilities? World-class, white-glove customer service? Similarly, if you’re looking to launch, find ways to get answers to these questions about a hypothetical product. Carry out polls and create tests. Use bogus landing pages to see what people click on. But, the real answers you seek will lie a layer deeper. What’s behind those decisions? How do people respond to your brand, and why do they like it? How does it make them feel? Rich? Safe? Generous? Included? Frivolous? Like a winner? And which of their needs are these feelings satisfying? Simplicity or sophistication? Safety or disruption? Figure out the emotional payback and you’ve worked out how to connect with your audience. So, my key message for Web3 operators is to keep the tech focus behind the scenes where it belongs. Just like in the world of cars, there will be a niche audience of hardcore fans who care about it enough to peek behind the curtain. But the masses — your main audience — don’t care about how it works. They care about how it meets their needs. So, focus on how you’re able to meet those needs by delivering a familiar, reliable emotional response with your unerring brand consistency. People might tell you they deal with facts rather than feelings, but don’t be fooled. The carmakers aren’t. German is co-founder and chief relevance officer of THE RELEVANCE HOUSE, a branding and marketing agency focused on blockchain and Web3. This article was published through Cointelegraph Innovation Circle, a vetted organization of senior executives and experts in the blockchain technology industry who are building the future through the power of connections, collaboration and thought leadership. Opinions expressed do not necessarily reflect those of Cointelegraph.",
    "originSummary": [
      "The article analyzes the marketing strategies of blockchain and crypto projects in the Web3 sector, drawing comparisons to successful branding techniques used in the car industry.",
      "The author highlights the significance of meeting the needs and emotions of the target audience, rather than solely focusing on technical features.",
      "They suggest conducting market research to identify the emotional payoffs that drive consumers' purchasing decisions, and prioritize delivering a familiar and reliable emotional response to connect with the audience."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699969737489
  },
  {
    "title": "Standard Chartered Launches Blockchain Unit in Singapore, Partners with FundBridge Capital for Tokenized Bond Fund",
    "originLink": "https://asia.nikkei.com/Business/Finance/StanChart-launches-blockchain-unit-eyes-Singapore-bond-fund",
    "originBody": "Your Account Account details Newsletters Group subscription Log out Log In Subscribe World China Japan India South Korea Indonesia Taiwan Thailand U.S. East Asia China Hong Kong Macao Taiwan Mongolia Japan South Korea North Korea Southeast Asia Indonesia Thailand Malaysia Singapore Philippines Vietnam Myanmar Cambodia Laos Brunei East Timor South Asia India Pakistan Afghanistan Bangladesh Sri Lanka Nepal Bhutan Maldives Central Asia Kazakhstan Uzbekistan Turkmenistan Tajikistan Kyrgyzstan Oceania Australia New Zealand Papua New Guinea Pacific Islands Rest of the World Middle East Russia & Caucasus North America Latin America Europe Africa Trending Israel-Hamas war China debt crunch Inflation Supply Chain Asia's Age of Hydropolitics Ukraine war Taiwan tensions Explainer Business Business Semiconductors Automobiles Energy Transportation Retail Travel & Leisure Media & Entertainment Food & Beverage Finance Electronics Startups Markets Markets Market Spotlight Currencies Commodities Property IPO Bonds Wealth Management Tech Tech #techAsia China tech Startups 5G networks Cryptocurrencies DealStreetAsia 36Kr/KrASIA Politics Politics China Japan India South Korea Indonesia Taiwan Thailand U.S. East Asia China Hong Kong Macao Taiwan Mongolia Japan South Korea North Korea Southeast Asia Indonesia Thailand Malaysia Singapore Philippines Vietnam Myanmar Cambodia Laos Brunei East Timor South Asia India Pakistan Afghanistan Bangladesh Sri Lanka Nepal Bhutan Maldives Central Asia Kazakhstan Uzbekistan Turkmenistan Tajikistan Kyrgyzstan Oceania Australia New Zealand Papua New Guinea Pacific Islands Rest of the World Middle East Russia & Caucasus North America Latin America Europe Africa Economy Economy China Japan India South Korea Indonesia Taiwan Thailand U.S. East Asia China Hong Kong Macao Taiwan Mongolia Japan South Korea North Korea Southeast Asia Indonesia Thailand Malaysia Singapore Philippines Vietnam Myanmar Cambodia Laos Brunei East Timor South Asia India Pakistan Afghanistan Bangladesh Sri Lanka Nepal Bhutan Maldives Central Asia Kazakhstan Uzbekistan Turkmenistan Tajikistan Kyrgyzstan Oceania Australia New Zealand Papua New Guinea Pacific Islands Rest of the World Middle East Russia & Caucasus North America Latin America Europe Africa Features The Big Story Asia Insight Business Spotlight China up close Market Spotlight Datawatch Special Reports Infographics Opinion Opinion The Nikkei View Life & Arts Life & Arts Life Arts Tea Leaves Obituaries Books Podcast Subscribe Account details Newsletters Group subscription Log out Log In Your Account Account details Newsletters Group subscription Log out Log In Subscribe Finance StanChart launches blockchain unit, eyes Singapore bond fund Bank's wholly-owned 'Libeara' platform comes on heels of Asian crypto push Standard Chartered's new blockchain unit Libeara is partnering with fund platform solutions player FundBridge Capital to create the first tokenized Singapore-Dollar Government Bond Fund for professional investors. © Reuters DYLAN LOH, Nikkei staff writerNovember 14, 2023 19:15 JSTSingapore CopyCopied SINGAPORE -- International bank Standard Chartered's venture arm on Tuesday launched a new blockchain unit that aims to help tokenize traditional financial instruments, moving rapidly to stake out a bigger presence in the Asian digital assets space. Called \"Libeara\", the platform is a technology service provider that was set up to assist institutions in digitalizing financial instruments on blockchains -- the infrastructure underpinning cryptocurrencies, with the goal of reducing the need for intermediaries typically involved with trading such instruments. This theoretically raises the efficiency and lowers the cost of buying and selling the assets. Read Next Cryptocurrencies StanChart muscles into Asian crypto space as established banking player Finance JPMorgan, DBS, Temasek bet big on Asia's blockchain race Cryptocurrencies Hong Kong greenlights tokenized securities in further digital push Startups Japan to let startups sell digital tokens to venture capital funds Opinion ASEAN and Japan have lessons for each other in digital change Cryptocurrencies Japan's megabank Mizuho joins MUFG's stablecoin platform Latest On Finance Finance Tencent-backed online broker sets its sights on Japan market Finance Cambodia's microfinance sector hit by predatory lending claims Finance Japan's Mizuho to invest $600m more in Rakuten Securities Sponsored Content About Sponsored Content This content was commissioned by Nikkei's Global Business Bureau. Discover the all new Nikkei Asia app Get Insights on Asia in your inbox Register for our newsletters Connect With Us About us Contact us Sitemap Help Terms of use Copyright Privacy & cookie policy Information Transmission Advertising Nikkei Inc. No reproduction without permission. Nikkei Asian Review, now known as Nikkei Asia, will be the voice of the Asian Century. Celebrate our next chapter Free access for everyone - Sep. 30 Find out more",
    "originSummary": [
      "Standard Chartered's venture arm, Libeara, has launched a new blockchain unit in Singapore.",
      "The platform aims to help institutions digitize financial instruments on blockchains, reducing the reliance on intermediaries and potentially decreasing costs.",
      "Libeara's initial project will involve creating a tokenized Singapore-Dollar Government Bond Fund in collaboration with FundBridge Capital."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699969737489
  },
  {
    "title": "Boyaa Interactive Ventures into Cryptocurrency with $100 Million Investment Plan",
    "originLink": "https://blockchain.news/news/boyaa-interactive-advances-into-cryptocurrency-with-a-100-million-acquisition-mandate",
    "originBody": "Boyaa Interactive International Limited, a distinguished online card and board game developer based in Hong Kong, is advancing into the cryptocurrency realm. Since its founding in 2004 and subsequent listing on the Hong Kong Stock Exchange in 2013, Boyaa has established a robust presence in the gaming industry, offering popular titles like Texas Hold’em and Chinese Chess. In a significant strategic pivot, Boyaa Interactive plans to invest up to $100 million in cryptocurrencies. This decision is part of the company's broader strategy to integrate its business model with the evolving Web3 landscape. Emphasizing the importance of digital asset management, Boyaa's Board views this move as a pivotal step towards future growth and innovation in the digital economy. The Board has proposed an Acquisition Mandate, pending shareholder approval, to facilitate cryptocurrency acquisitions over the next 12 months. The focus will primarily be on acquiring mainstream cryptocurrencies such as Bitcoin (BTC) and Ether (ETH), along with a certain allocation for stablecoins like Tether USD (USDT) and USD Coin (USDC). This approach is designed to align with the company’s asset allocation strategy and its push into Web3 technologies. Boyaa's financial trajectory, as evidenced by its positive annual results in both 2020 and 2022, positions it well for this venture. The company has shown a considerable increase in net profit, indicating a stable financial base to support its cryptocurrency endeavors. Despite the potential benefits, the Board acknowledges the risks associated with the volatile cryptocurrency market. Investments will be executed on regulated platforms, and the company has established a specialized supervisory team to ensure compliance and manage risks. Boyaa Interactive’s move into cryptocurrency underscores a strategic alignment with current digital asset trends and the growing influence of Web3 in the gaming sector. While navigating the inherent risks of the cryptocurrency market, Boyaa’s well-established financial foundation and strategic approach suggest a calculated and promising venture into the digital asset space. Image source: Shutterstock",
    "originSummary": [
      "Hong Kong game developer Boyaa Interactive intends to invest up to $100 million in cryptocurrencies as part of its strategy to integrate with the Web3 landscape.",
      "The company plans to acquire mainstream cryptocurrencies and stablecoins, with a focus on Bitcoin and Ether.",
      "Boyaa has positioned itself well for this venture due to its positive financial performance in recent years, but acknowledges the risks associated with the volatile cryptocurrency market."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699969737489
  },
  {
    "title": "Argo Blockchain Reports Strong Q3 2023 Results with Increased Mining Margin and Reduced Debt",
    "originLink": "https://finance.yahoo.com/news/argo-blockchain-plc-announces-q3-070000594.html",
    "originBody": "ACCESSWIRE Argo Blockchain PLC Announces Q3 2023 Results Read full article Argo Blockchain PLC Tue, November 14, 2023 at 2:00 AM EST·10 min read Argo Blockchain PLC Q3 2023 Results LONDON, UK / ACCESSWIRE / November 14, 2023 / Argo Blockchain plc (\"Argo\" or \"the Company\"), a global leader in cryptocurrency mining (LSE:ARB)(NASDAQ:ARBK), is pleased to announce its results for the quarter ended 30 September 2023. Financial Highlights ($USD) Accrued $4.4 million in power credits from economic curtailment at Helios during periods of high electricity prices, which led to an increase in mining margin from 36% in Q2 2023 to 58% in Q3 2023 Decreased average direct cost per Bitcoin mined by 33% from $17,566 per Bitcoin in Q2 2023 to $11,736 per Bitcoin in Q3 2023 Reduced recurring non-mining operating expenses by 11% in Q3 2023 compared to the prior quarter Achieved a positive Adjusted EBITDA of $3.1 million for the quarter (Adjusted EBITDA of $5.4 million for the nine month period ending 30 September 2023) Mined a total of 370 Bitcoin and Bitcoin Equivalents (together, \"BTC\") during the quarter and generated $10.4 million of revenue Reduced debt owed to Galaxy Digital from $32 million to $27 million and ended the quarter with $70 million of debt outstanding Recorded a one-time non-cash charge of $1.2 million related to prior period sales taxes owed to the Canadian tax authorities based on new tax regulations Net loss was $9.9 million for Q3 2023 The Company ended September 2023 with $8.0 million of cash and 32 BTC on its balance sheet. Operating Highlights During the quarter, the Company completed the deployment of its BlockMiner machines, representing approximately 0.3 EH/s in aggregate across its two Quebec facilities The deployment of the BlockMiner machines increased the Company's total hashrate capacity to 2.8 EH/s The Company is involved in advanced discussions to sell certain non-core assets, and it continues to evaluate options for further reducing debt Management Commentary Argo's interim Chief Executive Officer, Seif El-Bakly, said, \"I am pleased with Argo's operating and financial performance during the third quarter. The ability of our mining machines to curtail operations at Helios during periods of high electricity prices allowed us to generate significant power credits. These power credits enabled us to achieve a fleet-wide all-in direct cost of 3.5 - 4 cents per kilowatt hour for the quarter, which contributed to a higher mining margin and higher Adjusted EBITDA compared to the prior quarter.\" Story continues Q3 Results Management Call Argo will host a conference call to discuss its results at 10:00 ET / 15:00 GMT on Tuesday, 14 November 2023. The conference call is open to all existing and potential shareholders, and the live webcast of the call can be accessed via the Investor Meet Company platform. Questions can be submitted via the Investor Meet Company dashboard during the live presentation. Investors can sign up to Investor Meet Company and add Argo Blockchain via the following link: https://www.investormeetcompany.com/argo-blockchain-plc/register-investor CONDENSED CONSOLIDATED STATEMENT OF COMPREHENSIVE LOSS (UNAUDITED) Three months ended 30 Sept 2023 (unaudited) Three months ended 30 Sept 2022 (unaudited) Nine months ended 30 Sept 2023 (unaudited) Nine months ended 30 Sept 2022 (unaudited) $USD $'000 $'000 $'000 $'000 Revenues10,40713,09734,40347,741 Direct costs(8,770 ) (7,852 ) (23,863 ) (18,055 ) Power credits4,4261185,710118 Mining margin6,0635,36316,25029,804 Depreciation of mining equipment(6,181 ) (763 ) (18,228 ) (14,844 ) Change in fair value of digital currencies(635 ) (2,491 ) (146 ) (57,502 ) Gross margin(753 ) 2,109(2,124 ) (42,542 ) Operating costs and expenses(3,079 ) (11,541 ) (10,942 ) (23,195 ) Restructuring and one-time items(1,526 ) -(2,925 ) - Foreign exchange(144 ) 2,2321,25915,551 Depreciation and amortisation(528 ) (4,729 ) (1,179 ) (5,852 ) Share based payment(920 ) (2,754 ) (2,809 ) (6,408 ) Operating loss(6,950 ) (14,683 ) (18,720 ) (62,446 ) Finance cost(2,763 ) (2,560 ) (9,100 ) (7,071 ) Other income75(798 ) 75(994 ) Equity accounted loss from associate(259 ) -(717 ) (636 ) Revalue of contingent consideration---5,239 Loss before taxation(9,897 ) (18,041 ) (28,462 ) (65,908 ) Tax recovery--2,3218,286 Net loss(9,897 ) (18,041 ) (26,141 ) (57,622 ) Currency translation reserve699(30,792 ) (863 ) (36,518 ) Equity accounted OCI from associate-173-(10,620 ) Fair value loss on intangible digital assets-537-- Total other comprehensive income (loss)699(30,082 ) (863 ) (47,138 ) Total comprehensive loss(9,198 ) (48,123 ) (27,004 ) (104,760 ) Weighted Average Shares outstanding '000523,450477,825493,201472,174 Basic earnings per share* $ (0.02 )$ (0.04 )$ (0.05 )$ (0.12 ) CONDENSED CONSOLIDATED STATEMENT OF FINANCIAL POSITION (UNAUDITED)As at As at30 September 2023 (unaudited) 31 December 2022 (unaudited) $USD$'000 $'000 ASSETSNon-current assetsInvestments at fair value through income and loss 426414 Investments accounted for using the equity method 2,1982,863 Intangible assets 7852,103 Property, plant and equipment 63,92376,992 Right of use assets 526525 Total non-current assets 67,85882,897 Current assetsTrade and other receivables 8,0336,802 Digital assets 139443 Cash and cash equivalents 7,98720,092 Total current assets 16,15927,337Total assets 84,017110,234 EQUITY AND LIABILITIESEquityShare capital 710634 Share premium 209,545202,103 Share based payment reserve 11,3218,528 Foreign currency translation reserve (29,758 ) (28,895 ) Accumulated surplus (deficit) (194,764 ) (168,623 ) Total equity (2,946 ) 13,747 Current liabilitiesTrade and other payables 9,80210,028 Loans and borrowings 13,73511,605 Deferred tax 3,8202,648 Total current liabilities 27,35724,281 Non - current liabilitiesDeferred tax 4,8067,941 Issued debt - bond 38,07737,809 Loans and borrowings 16,18025,916 Lease liability 543540 Total non-current liabilities 59,60672,206Total equity and liabilities 84,017110,234 CONDENSED CONSOLIDATED STATEMENT OF CASH FLOWS (UNAUDITED) Nine months ended 30 September 2023 (unaudited) $USD $'000 Cash flows from operating activities Loss before tax(28,462 ) Adjustments for: Depreciation and amortisation19,407 Foreign exchange movements(1,259 ) Finance cost9,100 Fair value change in digital assets635 Realised loss in digital assets(489 ) Share of equity accounted loss from associate717 Share based payment expense2,809 Working capital changes: Increase in trade and other receivables(4,532 ) Decrease in trade and other payables(117 ) Decrease in digital assets306 Net cash flow (used in)/from operating activities(1,885 ) Investing activities Proceeds from sale of intangibles/investments989 Purchase of tangible fixed assets(1,590 ) Net cash used in investing activities(601 ) Financing activities Proceeds from borrowings811 Loan repayments(8,417 ) Interest paid(8,015 ) Proceeds from shares issued7,518 Net cash from (used in)/from financing activities(8,103 ) Net decrease in cash and cash equivalents(10,589 ) Effect of foreign exchange changes in cash(1,516 ) Cash and cash equivalents, beginning of period20,092 Cash and cash equivalents, end of period7,987 Non-IFRS Measures The following table shows a reconciliation of mining margin percentage to gross margin, the most directly comparable IFRS measure, for the periods ended 30 September 2023 and 30 September 2022. Three months endedThree months endedNine months endedNine months ended 30 September 202330 September 202230 September 202330 September 2022 (unaudited)(unaudited)(unaudited)(unaudited) $USD $'000$'000$'000$'000Gross margin (753)2,109(2,124)(42,542) Gross margin percentage (7%)16%(6%)(89%) Depreciation of mining equipment 6,18176318,22814,844 Change in fair value of digital currencies 6352,49114657,502 Mining margin 6,0635,36316,25029,804 Mining margin percentage 58%41%47%62% The following table shows a reconciliation of Adjusted EBITDA to net (loss) / income, the most directly comparable IFRS measure, for the periods ended 30 September 2023 and 30 September 2022. Three months endedThree months endedNine months endedNine months ended 30 September 202330 September 202230 September 202330 September 2022 (unaudited)(unaudited)(unaudited)(unaudited) $USD $'000$'000$'000$'000 Net loss (9,897)(18,041)(26,141)(57,622) Interest expense 2,7632,5609,1007,071 Depreciation and amortisation 6,7095,49219,40720,696 Income tax --(2,321)(8,286) Restructuring and one-time items 1,526-2,925- Foreign exchange 144(2,232)(1,259)(15,551) Share based payment 9202,7542,8096,408 Change in fair value of digital currencies 6352,49114657,502 Equity accounting loss from associate 259-717636 Adjusted EBITDA 3,059(6,976)5,38310,854 Inside Information and Forward-Looking Statements This announcement contains inside information and includes forward-looking statements which reflect the Company's current views, interpretations, beliefs or expectations with respect to the Company's financial performance, business strategy and plans and objectives of management for future operations. These statements include forward-looking statements both with respect to the Company and the sector and industry in which the Company operates. Statements which include the words \"remains confident\", \"expects\", \"intends\", \"plans\", \"believes\", \"projects\", \"anticipates\", \"will\", \"targets\", \"aims\", \"may\", \"would\", \"could\", \"continue\", \"estimate\", \"future\", \"opportunity\", \"potential\" or, in each case, their negatives, and similar statements of a future or forward-looking nature identify forward-looking statements. All forward-looking statements address matters that involve risks and uncertainties because they relate to events that may or may not occur in the future, including the risk that the Company may receive the benefits contemplated by its transactions with Galaxy, the Company may be unable to secure sufficient additional financing to meet its operating needs, and the Company may not generate sufficient working capital to fund its operations for the next twelve months as contemplated. Forward-looking statements are not guarantees of future performance. Accordingly, there are or will be important factors that could cause the Company's actual results, prospects and performance to differ materially from those indicated in these statements. In addition, even if the Company's actual results, prospects and performance are consistent with the forward-looking statements contained in this document, those results may not be indicative of results in subsequent periods. These forward-looking statements speak only as of the date of this announcement. Subject to any obligations under the Prospectus Regulation Rules, the Market Abuse Regulation, the Listing Rules and the Disclosure and Transparency Rules and except as required by the FCA, the London Stock Exchange, the City Code or applicable law and regulations, the Company undertakes no obligation publicly to update or review any forward-looking statement, whether as a result of new information, future developments or otherwise. For a more complete discussion of factors that could cause our actual results to differ from those described in this announcement, please refer to the filings that Company makes from time to time with the United States Securities and Exchange Commission and the United Kingdom Financial Conduct Authority, including the section entitled \"Risk Factors\" in the Company's Annual Report on Form 20-F. For further information please contact: Argo Blockchain Investor Relations ir@argoblockchain.com Tennyson Securities Corporate Broker Peter Krens +44 207 186 9030 Fortified Securities Joint Broker Guy Wheatley, CFA +44 7493 989014 guy.wheatley@fortifiedsecurities.com Tancredi Intelligent Communication UK & Europe Media Relations argoblock@tancredigroup.com About Argo: Argo Blockchain plc is a dual-listed (LSE: ARB; NASDAQ: ARBK) blockchain technology company focused on large-scale cryptocurrency mining. With mining facilities in Quebec, mining operations in Texas, and offices in the US, Canada, and the UK, Argo's global, sustainable operations are predominantly powered by renewable energy. In 2021, Argo became the first climate positive cryptocurrency mining company, and a signatory to the Crypto Climate Accord. For more information, visit www.argoblockchain.com. This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact rns@lseg.com or visit www.rns.com. SOURCE: Argo Blockchain PLC View source version on accesswire.com: https://www.accesswire.com/803017/argo-blockchain-plc-announces-q3-2023-results Related Quotes Symbol Last Price Change % Change ARBK Argo Blockchain plc1.0900 -0.0600 -5.22% ARBKF Argo Blockchain plc0.1100 +0.0023 +2.11% TRENDING 1. Freeport LNG plant in Texas on track to resume service after Monday shutdown 2. Saudia pushes for order of 150-plus planes 3. US consumer prices unchanged in October 4. Analysis-Europe's problems are far bigger than a shallow recession 5. UPDATE 1-German budget sees more cash for Ukraine, green buildings, industry",
    "originSummary": [
      "Argo Blockchain, a cryptocurrency mining company, has released its Q3 2023 results, showing a notable rise in mining margin and a decrease in costs, leading to a reduction in debt.",
      "During the quarter, Argo mined 370 Bitcoin and generated $10.4 million in revenue.",
      "To achieve sustainability, the company is considering selling non-core assets and utilizing renewable energy for its mining operations."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699969737489
  },
  {
    "title": "Animoca Brands Joins Chiliz Blockchain Network to Enhance Sports Engagement on the Web3 Platform",
    "originLink": "https://www.cointrust.com/market-news/animoca-brands-joins-chiliz-blockchain-network-elevating-web3-sports-engagement",
    "originBody": "Market NewsNovember 14, 2023 by Kelly Cromley Animoca Brands Joins Chiliz Blockchain Network, Elevating Web3 Sports Engagement In a notable development within the gaming and blockchain sector, Animoca Brands has recently become a validator on the Chiliz blockchain network. This strategic move signifies a significant progression in the governance structure of the Chiliz Chain, further diversifying Animoca Brands’ involvement in the sports sector. Diversifying Engagement in Sports: Animoca Brands, renowned for its pioneering contributions to blockchain innovation in gaming and digital entertainment, has extended its influence by integrating into the Chiliz Chain network. This move is a deliberate step towards broadening its footprint in the sports domain. As a node validator, Animoca Brands is expected to play a crucial role in shaping the Chiliz SportFi ecosystem, leveraging its extensive experience in NFTs and gaming. Co-founder’s Perspective on Collaboration: Yat Siu, co-founder of Animoca Brands, highlighted the significance of this collaboration, emphasizing that becoming a participant in the Chiliz Chain is an opportunity to merge their NFT and gaming expertise with Chiliz’s robust sports and entertainment ecosystem. Chiliz Chain’s Focus on Web3-Ready Sports Projects: Chiliz Chain has established itself as a platform dedicated to web3-ready projects, with a primary focus on engaging sports fans through blockchain technology. The platform has successfully facilitated the creation of over 80 Fan Tokens associated with major sports clubs, playing a fundamental role in reshaping the sports industry. CEO’s Perspective on Accelerated Journey: Alexandre Dreyfus, CEO of Chiliz, underscored the importance of Animoca Brands joining as a validator, describing it as an acceleration in their journey to becoming the definitive blockchain for sports and Web3 convergence. This collaboration exemplifies the commitment to advancing the intersection of blockchain technology and sports engagement. Investment in ‘Mocaverse’ Project Reinforces Commitment: In a related development, Animoca Brands secured a substantial $20 million investment for its ‘Mocaverse’ project, reinforcing its dedication to the metaverse sector. This funding reaffirms the company’s position as a key player in the evolving landscape of digital experiences. Industry Perspectives on the Metaverse Concept: The secured investment comes at a time when attitudes within the industry toward the metaverse concept vary. While some companies continue to invest heavily, there is a degree of skepticism from entities such as Disney. The diverse perspectives within the industry underscore the ongoing discussions and considerations surrounding the metaverse. Sports and Blockchain Collaboration Trend: The partnership between Chiliz and Animoca Brands signifies a broader trend of collaboration between blockchain technology and the sports sector. This collaboration not only reflects the evolving landscape where SportFi, GameFi, and DeFi intersect but also opens new avenues for fan engagement and innovation within the sports industry. Blockchain’s Growing Role in Sports and Entertainment: The alliance between Chiliz and Animoca Brands underscores the expanding role of blockchain technology in the realms of sports and entertainment. It serves as a testament to the diverse applications and the continuous evolution of blockchain technology across various sectors, indicating its transformative impact on the way industries operate.",
    "originSummary": [
      "Animoca Brands has become a validator on the Chiliz blockchain network, expanding its presence in the sports industry.",
      "This integration allows Animoca Brands to shape the Chiliz SportFi ecosystem and contribute to the convergence of sports and Web3.",
      "Animoca Brands secured a $20 million investment for its 'Mocaverse' project, demonstrating its commitment to the metaverse sector and highlighting the increasing collaboration between blockchain and the sports industry."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699969737489
  }
]
