[
  {
    "id": 40447431,
    "title": "ফাঁস হওয়া নথিগুলি প্রাক্তন কর্মীদের বিরুদ্ধে ওপেনএআইয়ের আক্রমণাত্মক কৌশলগুলি প্রকাশ করে",
    "originLink": "https://www.vox.com/future-perfect/351132/openai-vested-equity-nda-sam-altman-documents-employees",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40447431",
    "commentBody": "",
    "originSummary": [
      "ফাঁস হওয়া নথিতে দেখা যায়, সিইও স্যাম অল্টম্যানের নেতৃত্বে ওপেনএআই সাবেক কর্মীদের কোম্পানির সমালোচনা করা থেকে বিরত রাখতে আক্রমণাত্মক কৌশল ব্যবহার করেছিল যাতে তারা সীমাবদ্ধ প্রস্থান চুক্তিতে স্বাক্ষর না করলে তাদের ন্যস্ত ইক্যুইটি বাতিল করার হুমকি দেয়।",
      "অল্টম্যানের প্রকাশ্যে ক্ষমা চাওয়া এবং অজ্ঞতার দাবি সত্ত্বেও, তার এবং অন্যান্য নির্বাহীদের স্বাক্ষর সহ অভ্যন্তরীণ নথিগুলি পরামর্শ দেয় যে তারা এই বিধানগুলি সম্পর্কে সচেতন ছিল, ওপেনএআইয়ের স্বচ্ছতা এবং বিশ্বাসযোগ্যতা সম্পর্কে উদ্বেগ উত্থাপন করে।",
      "ওপেনএআই এখন প্রাক্তন কর্মীদের জন্য ন্যস্ত ইক্যুইটি নিশ্চিত করতে এবং ননডিসপ্যারেজমেন্ট ক্লজগুলি অপসারণের জন্য তার প্রস্থান প্রক্রিয়াটি আপডেট করছে, যদিও উদ্বেগগুলি সমাধান করার জন্য আরও কাজ বাকি রয়েছে।"
    ],
    "commentSummary": [
      "ফাঁস হওয়া নথিতে দেখা গেছে যে ওপেনএআই প্রাক্তন কর্মীদের ন্যস্ত ইক্যুইটিকে হুমকি দিয়ে অ-বৈষম্য চুক্তি কার্যকর করতে আক্রমণাত্মক কৌশল ব্যবহার করেছিল, যার ফলে ওপেনএআই থেকে প্রতিক্রিয়া এবং পরবর্তী আশ্বাসের দিকে পরিচালিত হয়েছিল।",
      "পরিস্থিতি চুক্তি আলোচনা, ইক্যুইটি ক্ষতিপূরণ এবং অ-প্রতিযোগিতামূলক ধারাগুলি নিয়ে আলোচনার সূত্রপাত করেছে, প্রয়োগযোগ্যতার ক্ষেত্রে জটিলতা এবং আঞ্চলিক পার্থক্য তুলে ধরেছে।",
      "সমালোচকরা যুক্তি দেখান যে ওপেনএআইয়ের পদক্ষেপগুলি শিল্পের প্রবণতা, নৈতিক উদ্বেগ এবং স্যাম আল্টম্যানের মতো বিশিষ্ট ব্যক্তিত্বের প্রভাবের জন্য বিস্তৃত প্রভাব সহ বিশ্বাস এবং স্বচ্ছতার গভীর বিষয়গুলি প্রকাশ করে।"
    ],
    "points": 1713,
    "commentCount": 499,
    "retryCount": 0,
    "time": 1716416550
  },
  {
    "id": 40448045,
    "title": "চ্যাটজিপিটির জন্য স্কারলেট জোহানসনের কণ্ঠস্বর ক্লোন করেনি ওপেনএআই, রেকর্ড নিশ্চিত করেছে",
    "originLink": "https://www.washingtonpost.com/technology/2024/05/22/openai-scarlett-johansson-chatgpt-ai-voice/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40448045",
    "commentBody": "",
    "originSummary": [
      "স্কারলেট জোহানসনের অভিযোগ, সিইও স্যাম অল্টম্যানের লাইসেন্স দেওয়ার অনুরোধ প্রত্যাখ্যান করার পরে ওপেনএআই তার সম্মতি ছাড়াই তার কণ্ঠস্বর প্রতিলিপি করেছিল।",
      "ওপেনএআই চ্যাটজিপিটিকে মানবিক করার জন্য একটি গোপন প্রকল্পের জন্য উষ্ণ, আকর্ষক কণ্ঠস্বর সহ নন-ইউনিয়ন অভিনেতাদের চেয়েছিল, তবে ওয়াশিংটন পোস্টের পর্যালোচনা করা উত্স এবং নথি অনুসারে জোহানসনের কণ্ঠস্বর ক্লোন করার স্পষ্টভাবে লক্ষ্য ছিল না।"
    ],
    "commentSummary": [
      "চ্যাটজিপিটির জন্য স্কারলেট জোহানসনের মতো শোনাচ্ছে এমন একজন ভয়েস অভিনেতাকে তার সম্মতি ছাড়াই ব্যবহার করার অভিযোগে ওপেনএআই তদন্তের আওতায় রয়েছে, যা আইনি এবং নৈতিক উদ্বেগ উত্থাপন করেছে।",
      "বিতর্কটি ভয়েস নকল আইনগুলির জটিলতা তুলে ধরে, মিডলার ভি। ফোর্ড এবং টম ওয়েটস বনাম ফ্রিটো-লে, এবং আপডেট আইনি কাঠামোর প্রয়োজনীয়তার উপর জোর দেয়।",
      "বিতর্কটি এআই, ভয়েস অভিনেতাদের জন্য বিস্তৃত প্রভাব এবং সুস্পষ্ট সম্মতি ছাড়াই অনুরূপ-সাউন্ডিং ভয়েস ব্যবহারের নৈতিক বিবেচনার দিকে দৃষ্টি আকর্ষণ করে।"
    ],
    "points": 489,
    "commentCount": 944,
    "retryCount": 0,
    "time": 1716419812
  },
  {
    "id": 40449767,
    "title": "WinDirStat: উইন্ডোজের জন্য ওপেন সোর্স ডিস্ক ব্যবহার ভিউয়ার এবং ক্লিনআপ টুল",
    "originLink": "https://windirstat.net/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40449767",
    "commentBody": "",
    "originSummary": [
      "উইনডিরস্ট্যাট মাইক্রোসফ্ট উইন্ডোজে ডিস্ক ব্যবহার দেখার এবং পরিষ্কার করার জন্য একটি ওপেন সোর্স সরঞ্জাম, একটি ডিরেক্টরি তালিকা, ট্রিম্যাপ এবং এক্সটেনশন তালিকা সরবরাহ করে।",
      "লিনাক্সের বিকল্পগুলির মধ্যে কেডিরস্ট্যাট এবং কিউডিরস্ট্যাট অন্তর্ভুক্ত রয়েছে, যখন ম্যাকোস এক্স ব্যবহারকারীরা ডিস্ক ইনভেন্টরি এক্স বা গ্র্যান্ডপারস্পেকটিভ ব্যবহার করতে পারেন।",
      "সফ্টওয়্যারটি GPLv2 এর অধীনে লাইসেন্সকৃত, এটি নিশ্চিত করে যে এটি বিনামূল্যে এবং ওপেন সোর্স থাকে।"
    ],
    "commentSummary": [
      "আলোচনাটি বিভিন্ন ডিস্ক ব্যবহার বিশ্লেষণ সরঞ্জামগুলির তুলনা করে, বিভিন্ন অপারেটিং সিস্টেম জুড়ে বৈশিষ্ট্য, কর্মক্ষমতা এবং ব্যবহারযোগ্যতার উপর দৃষ্টি নিবদ্ধ করে।",
      "উইনডিরস্ট্যাট জনপ্রিয় এবং ওপেন সোর্স তবে ধীর হওয়ার জন্য সমালোচিত, যখন উইজট্রি দ্রুত তবে সুরক্ষা উদ্বেগ রয়েছে এবং এটি ওপেন সোর্স নয়।",
      "ব্যবহারকারীরা গতি, সুরক্ষা এবং ব্যবহারযোগ্যতার মধ্যে ট্রেড-অফগুলি হাইলাইট করে এবং আরও ভাল ফাইল পরিচালনার বৈশিষ্ট্য এবং ট্রিম্যাপ এবং সানবার্স্টের মতো উন্নত ভিজ্যুয়ালাইজেশন পদ্ধতির প্রয়োজনীয়তা প্রকাশ করে।"
    ],
    "points": 317,
    "commentCount": 156,
    "retryCount": 0,
    "time": 1716431654
  },
  {
    "id": 40453077,
    "title": "মাইক্রোসফট বিভ্রাটে বিং, কোপাইলট, চ্যাটজিপিটি ও ডাকডাকগো সেবা ব্যাহত",
    "originLink": "https://www.bleepingcomputer.com/news/microsoft/microsoft-outage-affects-bing-copilot-duckduckgo-and-chatgpt-internet-search/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40453077",
    "commentBody": "",
    "originSummary": [
      "২০২৪ সালের ২৩ মে মাইক্রোসফটের একটি বড় ধরনের বিভ্রাটের কারণে বিং, কোপাইলট, চ্যাটজিপিটি ইন্টারনেট সার্চ এবং ডাকডাকগোসহ বেশ কয়েকটি সেবা বিঘ্নিত হয়, যা মূলত এশিয়া ও ইউরোপের ব্যবহারকারীদের প্রভাবিত করে।",
      "বিংয়ের হোমপেজ এবং কোপাইলট পরিষেবাগুলি উল্লেখযোগ্য সমস্যার সম্মুখীন হয়েছিল, যখন ডাকডাকগো ত্রুটি বার্তা প্রদর্শন করেছিল তবে পরে স্বাভাবিক ক্রিয়াকলাপ পুনরায় শুরু করেছিল।",
      "ওপেনএআই এবং মাইক্রোসফ্ট বিং এবং কোপাইলটের সম্পূর্ণ কার্যকারিতা পুনরুদ্ধারের চলমান প্রচেষ্টার সাথে সমস্যাগুলি স্বীকার করেছে।"
    ],
    "commentSummary": [
      "মাইক্রোসফট বিভ্রাটের কারণে বিং, কোপাইলট, ডাকডাকগো এবং চ্যাটজিপিটির মতো একাধিক ইন্টারনেট পরিষেবা ক্ষতিগ্রস্ত হয়েছে।",
      "এই ঘটনাটি অনলাইন পরিষেবাগুলির আন্তঃসংযুক্ত প্রকৃতি এবং মাইক্রোসফ্টের অবকাঠামোর উপর তাদের নির্ভরতা তুলে ধরে।",
      "আরও বিস্তারিত আলোচনার জন্য, ব্যবহারকারীদের হ্যাকার নিউজের একটি নির্দিষ্ট থ্রেডে পরিচালিত করা হয়েছে।"
    ],
    "points": 267,
    "commentCount": 1,
    "retryCount": 0,
    "time": 1716461600
  },
  {
    "id": 40455758,
    "title": "সিয়েরার স্পেস কোয়েস্ট দ্বিতীয় ফ্লপি ডিস্ক ত্রুটি এজিআই সোর্স কোড প্রকাশ করে",
    "originLink": "https://lanceewing.github.io/blog/sierra/agi/sq2/2024/05/22/do-you-own-this-space-quest-2-disk.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40455758",
    "commentBody": "",
    "originSummary": [
      "2024 সালে, এটি পাওয়া গেছে যে সিয়েরা অন-লাইনের স্পেস কোয়েস্ট দ্বিতীয় এর কয়েকটি সংস্করণে অনুপযুক্ত বিন্যাসের কারণে তাদের 720 কেবি ফ্লপি ডিস্কে সি সোর্স কোডের অবশিষ্টাংশ ছিল।",
      "এই ভুলটি সিয়েরার এজিআই ইন্টারপ্রেটার সোর্স কোডের প্রায় 70% প্রকাশ করেছে, যার মধ্যে 75 সি উত্স ফাইল এবং 16 টি সমাবেশ ফাইল রয়েছে, যা 2016 অবধি নজরে আসেনি।",
      "সোর্স কোডটি এখন গিটহাবে উপলব্ধ, সিয়েরার উন্নয়ন প্রক্রিয়াগুলিতে মূল্যবান অন্তর্দৃষ্টি সরবরাহ করে এবং এজিইল ওয়েব-ভিত্তিক দোভাষীর মতো প্রকল্পগুলিকে সহায়তা করে।"
    ],
    "commentSummary": [
      "আলোচনাটি সফ্টওয়্যার বিতরণে ঐতিহাসিক ত্রুটিগুলি তুলে ধরে, যেমন চূড়ান্ত পণ্য প্রকাশে সংবেদনশীল বা অনিচ্ছাকৃত ডেটা অন্তর্ভুক্তি, 1989 ডস গেম \"ডাবল ড্রাগন দ্বিতীয়: প্রতিশোধ\" দ্বারা উদাহরণ।",
      "এটি ফ্লপি ডিস্কগুলির জন্য জলদস্যুতা বিরোধী ব্যবস্থা, ভোক্তা-স্তরের ডিস্ক কপিয়ারগুলির সীমাবদ্ধতা এবং চৌম্বকীয়-স্তরের ডেটা পড়ার জন্য গ্রিজওয়েজলের মতো আধুনিক সরঞ্জামগুলি পরীক্ষা করে।",
      "অংশগ্রহণকারীরা পুরানো গেমগুলির সাথে নস্টালজিক অভিজ্ঞতা ভাগ করে নেয়, সোর্স কোড ফাঁসের প্রভাব নিয়ে আলোচনা করে এবং সংরক্ষণাগারটির জন্য সেক্টর-স্তরের ইমেজিংয়ের গুরুত্বের উপর জোর দেয়।"
    ],
    "points": 234,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1716477380
  },
  {
    "id": 40449278,
    "title": "মাস্টার ড্রোন ফ্লাইং: এফপিভিএসআইএম সহ ইন্টারেক্টিভ শিক্ষানবিস টিউটোরিয়াল",
    "originLink": "https://fpvsim.com/drone-flying-101",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40449278",
    "commentBody": "",
    "originSummary": [
      "এফপিভিএসআইএম নতুনদের জন্য একটি বিশদ ড্রোন উড়ন্ত টিউটোরিয়াল সরবরাহ করে, হোভারিং, টার্নিং, ব্যাংকিং এবং সমন্বিত টার্নগুলির মতো মূল ধারণাগুলি কভার করে।",
      "টিউটোরিয়ালটি ড্রোন এবং গাড়ি নেভিগেশনের মধ্যে পার্থক্যগুলি তুলে ধরে, রোল, ইয়াও এবং পিচের মাধ্যমে 3 ডি চলাচলের উপর দৃষ্টি নিবদ্ধ করে এবং একটি ওয়েব-ভিত্তিক সিমুলেটরের মাধ্যমে ব্যবহারিক পাঠ সরবরাহ করে।",
      "ব্যবহারকারীরা ম্যানুয়াল, পারফরম্যান্স টিপস এবং উন্নত কনফিগারেশনের মতো অতিরিক্ত সংস্থানগুলি অ্যাক্সেস করতে পারেন এবং উন্নত শেখার এবং বাস্তবসম্মত গ্রাফিক্সের জন্য এফপিভিএসআইএমের ওয়েব বা ডেস্কটপ সিমুলেটরগুলিতে অনুশীলন চালিয়ে যেতে পারেন।"
    ],
    "commentSummary": [
      "\"ড্রোন ফ্লাইং 101 - নতুনদের জন্য একটি ইন্টারেক্টিভ টিউটোরিয়াল\" এফপিভি (ফার্স্ট-পারসন ভিউ) এবং নন-এফপিভি (সিনেমাটিক) ড্রোনগুলির মূল বিষয়গুলি কভার করে, জিপিএস স্থিতিশীলতার কারণে ডিজেআই ম্যাভিকের মতো নন-এফপিভি ড্রোনগুলির ব্যবহারকারী-বন্ধুত্বকে হাইলাইট করে।",
      "টিউটোরিয়ালটি রেডিওমাস্টার এবং টিবিএস ট্যাঙ্গো 2 সহ জনপ্রিয় ট্রান্সমিটারগুলির সাথে ওপেনটিএক্স বা এজটিএক্স সফ্টওয়্যার এবং আরও ভাল পারফরম্যান্সের জন্য এক্সপ্রেসএলআরএস প্রোটোকলের সুপারিশ করে সঠিক ট্রান্সমিটার বেছে নেওয়ার গুরুত্বের উপর জোর দেয়।",
      "আলোচনায় আধুনিক যুদ্ধে, বিশেষত ইউক্রেনে ড্রোনের বিবর্তিত ব্যবহার অন্বেষণ করা হয়েছে এবং স্বায়ত্তশাসিত ড্রোন, পাইলট প্রশিক্ষণ এবং পাল্টা পদক্ষেপের সম্ভাব্য ভবিষ্যতের উপর স্পর্শ করা হয়েছে।"
    ],
    "points": 207,
    "commentCount": 112,
    "retryCount": 0,
    "time": 1716427535
  },
  {
    "id": 40447998,
    "title": "ইম্যাকস ইজি ড্র: অর্গ-মোডের সাথে সমন্বিত বিজোড় অঙ্কন সরঞ্জাম",
    "originLink": "https://github.com/misohena/el-easydraw",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40447998",
    "commentBody": "",
    "originSummary": [
      "ইম্যাকস ইজি ড্র একটি অঙ্কন সরঞ্জাম যা ইম্যাকসের মধ্যে কাজ করে, যার জন্য ইম্যাকস 27.2, চিত্র এবং এসভিজি সমর্থন, জিজিপ / গানজিপ এবং লিবএক্সএমএল প্রয়োজন।",
      "এটি অর্গ-মোডের সাথে সংহত করে, ব্যবহারকারীদের সরাসরি নথিতে অঙ্কন তৈরি এবং সম্পাদনা করতে দেয় এবং এইচটিএমএল বা ল্যাটেক্স হিসাবে রফতানি সমর্থন করে।",
      "সরঞ্জামটি এসভিজি স্পেসিফিকেশনের একটি উপসেট ব্যবহার করে, সিএসএস এবং এইচটিএমএল সম্পাদনার জন্য একটি রঙিন পিকার লাইব্রেরি অন্তর্ভুক্ত করে এবং জিপিএলভি 3 এর অধীনে লাইসেন্সযুক্ত, সম্প্রদায়ের অবদানকে উত্সাহিত করে।"
    ],
    "commentSummary": [
      "ইম্যাকস ইজিড্র ইম্যাকসের জন্য তৈরি একটি অঙ্কন সরঞ্জাম, যা সাধারণ লিনাক্স পরিবেশের পরিবর্তে উইন্ডোজে অনন্যভাবে তৈরি করা হয়েছে।",
      "ব্যবহারকারীরা ছোট অঙ্কন এবং অর্গ-রোমের মতো ওয়ার্কফ্লোগুলির সাথে সম্ভাব্য সংহতকরণের জন্য এটি দরকারী বলে মনে করেন, যদিও বর্তমানে এটিতে হস্তাক্ষর ক্ষমতা এবং সহযোগিতার বৈশিষ্ট্যগুলির অভাব রয়েছে।",
      "অ্যালগরিদম উন্নতির সাথে, কেউ কেউ বিশ্বাস করেন যে এটি ইনস্কেপের সাথে প্রতিযোগিতা করতে পারে এবং এটিতে একটি সহজ রঙ বাছাই রয়েছে, এটি অনেক অনলাইন সরঞ্জামগুলির চেয়ে উচ্চতর করে তোলে।"
    ],
    "points": 198,
    "commentCount": 12,
    "retryCount": 0,
    "time": 1716419630
  },
  {
    "id": 40452655,
    "title": "টম ওয়েটস ভয়েস অপব্যবহারের জন্য ফ্রিটো-লেয়ের বিরুদ্ধে $ 2.6 মিলিয়ন মামলা জিতেছে",
    "originLink": "http://tomwaitslibrary.info/biography/copyright/frito-lay/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40452655",
    "commentBody": "",
    "originSummary": [
      "টম ওয়েটস মামলা করেছিলেন ফ্রিটো-লে ইনক 1988 সালে একটি ডরিটোস বিজ্ঞাপনে তার গানের \"স্টেপ রাইট আপ\" এর সাউন্ড-অ্যালাইক ছদ্মবেশ ব্যবহার করার জন্য, মিথ্যা অনুমোদন এবং ভয়েস অপব্যবহারের দাবি করে।",
      "জুরি ওয়েটসকে ২.6 মিলিয়ন ডলার পুরষ্কার দিয়েছে, আপিলে রায় বহাল রেখেছে, ল্যানহাম আইন এবং ক্যালিফোর্নিয়া আইনের অধীনে ভয়েস অপব্যবহারের আইনী নজির স্থাপন করেছে।",
      "ওয়েটস এমন শিল্পীদের সমালোচনা করেছিলেন যারা বিজ্ঞাপনগুলিতে তাদের সংগীতকে অনুমতি দেয়, যুক্তি দিয়েছিলেন যে এটি শৈল্পিক অখণ্ডতাকে ক্ষুণ্ন করে এবং তার মামলাটি শৈল্পিক খ্যাতি রক্ষার গুরুত্বকে তুলে ধরে।"
    ],
    "commentSummary": [
      "আলোচনাটি সাউন্ড-অ্যালাইক ভয়েস অভিনেতাদের ব্যবহারের আইনী এবং নৈতিক বিষয়গুলি অন্বেষণ করে, ফ্রিটো-লে এবং স্কারলেট জোহানসনের বিরুদ্ধে টম ওয়েটসের মামলা উল্লেখ করে ওপেনএআইয়ের সাথে বিতর্ক।",
      "এটি ভয়েস অনুকরণের জটিলতা, \"বিক্রি হয়ে যাওয়ার\" ধারণা এবং শিল্পীদের তাদের কাজের লাইসেন্স দেওয়ার ধারণাগুলি বিকশিত করে, সম্মতি ছাড়াই জোহানসনের অনুরূপ ভয়েস ব্যবহারের আইনী প্রভাব সহ।",
      "কথোপকথনটি কর্পোরেট অনুশীলনগুলি, বিশেষত ওপেনএআইয়ের সমালোচনা করে এবং বৌদ্ধিক সম্পত্তি এবং শৈল্পিক অখণ্ডতাকে প্রভাবিত করে এমন এআই-উত্পন্ন কণ্ঠস্বর সম্পর্কে বিস্তৃত উদ্বেগকে সম্বোধন করে।"
    ],
    "points": 186,
    "commentCount": 135,
    "retryCount": 0,
    "time": 1716457938
  },
  {
    "id": 40450128,
    "title": "টাইপিং অ্যানিমেশন ইউআই লাইব্রেরি: ডিজাইন ইঞ্জিনিয়ারদের জন্য বিনামূল্যে, কাস্টমাইজযোগ্য উপাদান",
    "originLink": "https://magicui.design/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40450128",
    "commentBody": "",
    "originSummary": [
      "ডিজাইন ইঞ্জিনিয়ারদের জন্য টাইপিং অ্যানিমেশন ইউআই লাইব্রেরি প্রতিক্রিয়া, টাইপস্ক্রিপ্ট, টেলউইন্ড সিএসএস এবং ফ্রেমার মোশন দিয়ে নির্মিত 20 টিরও বেশি ফ্রি এবং ওপেন সোর্স অ্যানিমেটেড উপাদান সরবরাহ করে।",
      "লাইব্রেরিতে ফাইল সংরক্ষণ, পূর্ণ-পাঠ্য অনুসন্ধান, বহুভাষিক সমর্থন এবং ক্যালেন্ডার ফিল্টারিংয়ের মতো বৈশিষ্ট্য অন্তর্ভুক্ত রয়েছে, বাস্তব উপাদান ডেমো উপলব্ধ।",
      "ব্যবহারকারীরা টুইটারে লাইব্রেরিটির নকশা এবং কার্যকারিতার জন্য প্রশংসা করেছেন এবং ম্যাজিক ইউআই প্রো আরও কাস্টমাইজেশনের জন্য আরও উন্নত টেম্পলেট সরবরাহ করে।"
    ],
    "commentSummary": [
      "ডিজাইন ইঞ্জিনিয়ারদের জন্য একটি ইউআই লাইব্রেরি ম্যাজিক ইউআই মিশ্র পর্যালোচনা পেয়েছে, কেউ কেউ এর নান্দনিক আবেদনের প্রশংসা করেছেন এবং অন্যরা এটিকে দৃশ্যত বিভ্রান্তিকর এবং ডেরাইভেটিভ বলে সমালোচনা করেছেন।",
      "প্রধান সমালোচনার মধ্যে রয়েছে মন্থর পারফরম্যান্স, উচ্চ সংস্থান খরচ, ফায়ারফক্সে ব্যবহারযোগ্যতার সমস্যা এবং শ্যাডসিএন / ইউআইয়ের ছিনতাই হওয়ার অভিযোগ।",
      "আলোচনায় ওয়েব ডেভেলপমেন্টে রিঅ্যাক্টের আধিপত্য, ফিগমা উপাদান রক্ষণাবেক্ষণের উপযোগিতা এবং ডেমো সাইটে চরম সিপিইউ ব্যবহার এবং ব্রাউজার ক্র্যাশের মতো পারফরম্যান্সের বিষয়টিও তুলে ধরা হয়।"
    ],
    "points": 176,
    "commentCount": 77,
    "retryCount": 0,
    "time": 1716434634
  },
  {
    "id": 40446010,
    "title": "এনভিডিয়া বিশ্বব্যাপী কোয়ান্টাম কম্পিউটিং সেন্টারগুলিকে উত্সাহিত করার জন্য সিইউডিএ-কিউ প্ল্যাটফর্ম চালু করেছে",
    "originLink": "https://nvidianews.nvidia.com/news/nvidia-announces-financial-results-for-first-quarter-fiscal-2025",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40446010",
    "commentBody": "",
    "originSummary": [
      "এনভিডিয়া বিশ্বব্যাপী কোয়ান্টাম কম্পিউটিং সেন্টারগুলিকে এগিয়ে নেওয়ার লক্ষ্যে সিইউডিএ-কিউ প্ল্যাটফর্ম চালু করেছে।",
      "কোয়ান্টাম কম্পিউটিং প্রযুক্তিতে একটি উল্লেখযোগ্য পদক্ষেপ হিসেবে ২০২৪ সালের ১২ মে এই ঘোষণা দেওয়া হয়।",
      "এই উৎক্ষেপণ কোয়ান্টাম কম্পিউটিং ক্ষেত্রে গবেষণা ও উন্নয়ন ত্বরান্বিত করবে বলে আশা করা হচ্ছে।"
    ],
    "commentSummary": [
      "এনভিডিয়ার ২০২৫ অর্থবছরের প্রথম প্রান্তিকের ফলাফলে শক্তিশালী এইচ১০০ জিপিইউ বিক্রয় দেখা গেছে তবে সম্ভাব্য সরবরাহ চেইনের ঝুঁকি সম্পর্কে সতর্কতা অবলম্বন করা হয়েছে, যা সিসকোর মতো ঐতিহাসিক মামলার সাথে তুলনা করে।",
      "আলোচনায় বিনিয়োগ কৌশল যেমন বৈচিত্র্যকরণ, ঝুঁকি ভারসাম্য এবং বাজারের গতিশীলতা বোঝার গুরুত্বের উপর জোর দেওয়া হয়, যা উচ্চতর সফ্টওয়্যার ইকোসিস্টেমের কারণে এআইতে এনভিডিয়ার শীর্ষস্থানীয় অবস্থানকে তুলে ধরে।",
      "এআই হাইপের মধ্যে এনভিডিয়ার প্রবৃদ্ধির স্থায়িত্ব, মেটা এবং মাইক্রোসফ্ট / ওপেনএআইয়ের মতো ক্লায়েন্টদের নিজস্ব চিপ তৈরির সম্ভাব্য প্রতিযোগিতা এবং টিএসএমসি এবং স্যামসাংয়ের উত্পাদন সীমাবদ্ধতার মধ্যে এনভিডিয়ার বৃদ্ধির স্থায়িত্ব সম্পর্কে উদ্বেগ উত্থাপিত হয়েছে।"
    ],
    "points": 175,
    "commentCount": 345,
    "retryCount": 0,
    "time": 1716409561
  },
  {
    "id": 40445093,
    "title": "ওয়ারেন্ট ছাড়াই পুলিশের সঙ্গে চালকের তথ্য শেয়ার করার কথা স্বীকার করেছে গাড়ি নির্মাতারা, সতর্ক সিনেটরদের",
    "originLink": "https://www.thedrive.com/news/automakers-will-give-your-location-to-police-without-a-warrant-senators-say",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40445093",
    "commentBody": "",
    "originSummary": [
      "টয়োটা, সুবারু এবং বিএমডাব্লু সহ আটটি গাড়ি নির্মাতারা কংগ্রেসের কাছে স্বীকার করেছে যে তারা আদালতের আদেশ ছাড়াই পুলিশকে ড্রাইভার ডেটা সরবরাহ করবে, ভোক্তাদের গোপনীয়তা রক্ষার জন্য তাদের পূর্ববর্তী প্রতিশ্রুতির বিরোধিতা করে।",
      "সিনেটর রন ওয়াইডেন এবং এড মার্কি গ্রাহকদের বিভ্রান্ত করার জন্য অটোমেকারদের সমালোচনা করেছেন এবং আইনি ব্যবস্থা দ্বারা অবস্থানের ডেটার সম্ভাব্য অপব্যবহার সম্পর্কে উদ্বেগ প্রকাশ করেছেন।",
      "গোপনীয়তার বিষয়ে অটো শিল্পের অসঙ্গতিপূর্ণ অবস্থান, যেমন ভোক্তাদের ডেটার সাথে আপস করার সময় রাইট-টু-রিপেয়ার বিলের বিরোধিতা করা, সংযুক্ত গাড়ি প্রযুক্তি সম্পর্কিত সতর্কতার প্রয়োজনীয়তা তুলে ধরে।"
    ],
    "commentSummary": [
      "সিনেটররা গাড়ি নির্মাতারা ওয়ারেন্ট ছাড়াই পুলিশকে গাড়ির অবস্থানের ডেটা সরবরাহ করা, গোপনীয়তা এবং আধুনিক যানবাহনগুলিতে ট্র্যাকিংয়ের সমস্যাগুলি উত্থাপন করার বিষয়ে উদ্বিগ্ন।",
      "ব্যবহারকারীরা অনস্টারের মতো ট্র্যাকিং পরিষেবাদি অক্ষম করার জটিলতা, এই জাতীয় ক্রিয়াকলাপের বৈধতা এবং গাড়ির কার্যকারিতা এবং ওয়্যারেন্টিগুলির উপর প্রভাব নিয়ে আলোচনা করেন।",
      "বিতর্কটি জননিরাপত্তা এবং গোপনীয়তার মধ্যে ভারসাম্য, বীমা সংস্থাগুলির ভূমিকা এবং শক্তিশালী ভোক্তা অধিকার এবং ডেটা গোপনীয়তা বিধিমালার প্রয়োজনীয়তা তুলে ধরে।"
    ],
    "points": 173,
    "commentCount": 171,
    "retryCount": 0,
    "time": 1716405713
  },
  {
    "id": 40447117,
    "title": "পাঁচ মাসের বিরতির পর ফের শুরু হল ভয়েজার ১",
    "originLink": "https://blogs.nasa.gov/voyager/2024/05/22/voyager-1-resumes-sending-science-data-from-two-instruments/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40447117",
    "commentBody": "",
    "originSummary": [
      "২০২৩ সালের নভেম্বরে কম্পিউটার সমস্যার পর ভয়েজার ১ তার চারটি যন্ত্রের মধ্যে দুটি থেকে বৈজ্ঞানিক তথ্য পাঠানো পুনরায় শুরু করেছে।",
      "মিশন দলটি বাকি দুটি যন্ত্র পুনর্বিবেচনা করছে, প্লাজমা ওয়েভ সাবসিস্টেম এবং ম্যাগনেটোমিটার এখন চালু রয়েছে।",
      "সমস্যাটি ফ্লাইট ডেটা সাবসিস্টেমে দূষিত মেমরিতে সনাক্ত করা হয়েছিল; ১৯৭৭ সালে উৎক্ষেপণ করা ভয়েজার ১ পৃথিবী থেকে ১৫ বিলিয়ন মাইলেরও বেশি দূরে অবস্থিত এবং এটি নাসার দীর্ঘতম অপারেটিং মহাকাশযানগুলির মধ্যে একটি।"
    ],
    "commentSummary": [
      "ভয়েজার ১ পুনরায় ডেটা ট্রান্সমিশন শুরু করার বিষয়ে নাসার নিবন্ধে বিতর্কটি ভয়েজার মিশনগুলি মানবতার সর্বশ্রেষ্ঠ বৈজ্ঞানিক অর্জন কিনা তা নিয়ে দৃষ্টি নিবদ্ধ করে।",
      "অংশগ্রহণকারীরা ভয়েজারের দীর্ঘায়ু এবং সাধারণ নকশাকে লার্জ হ্যাড্রন কোলাইডার এবং জিনোম সিকোয়েন্সিংয়ের মতো জটিল প্রকল্পগুলির সাথে তুলনা করে, মাধ্যাকর্ষণ সহায়তা এবং অনন্য গ্রহের প্রান্তিককরণের গুরুত্ব তুলে ধরে।",
      "আলোচনায় গুটিবসন্ত নির্মূল এবং ছাপাখানার বিকাশের মতো অন্যান্য স্মরণীয় অর্জনের কথাও উল্লেখ করা হয়েছে, তাদের উল্লেখযোগ্য প্রভাবের কারণে এই অর্জনগুলির র্যাঙ্কিংয়ে চ্যালেঞ্জের উপর জোর দেওয়া হয়েছে।"
    ],
    "points": 171,
    "commentCount": 42,
    "retryCount": 0,
    "time": 1716414700
  },
  {
    "id": 40453221,
    "title": "নতুন টুরিং মেশিন ব্রেকথ্রু অ্যাকারম্যান-লেভেল ফাংশন গণনা করে",
    "originLink": "https://www.sligocki.com//2024/05/22/bb-3-4-a14.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40453221",
    "commentBody": "",
    "originSummary": [
      "পাভেল ক্রোপিটজ একটি 3-রাষ্ট্র, 4-প্রতীক টুরিং মেশিন (টিএম) আবিষ্কার করেছিলেন যা অ্যাকারম্যান-স্তরের ফাংশন গণনা করতে সক্ষম, টেপটিতে ঠিক \\( (2 \\ উপরো^{15} 5) + 14 \\) অ-শূন্য চিহ্ন দিয়ে থামছে।",
      "25 এপ্রিল, 2024-এ পাওয়া এই টিএমটি এই জাতীয় জটিল ফাংশনটি অনুকরণ করার জন্য প্রথম পরিচিত, এর আচরণটি প্রমাণ করার জন্য ডাবল আনয়ন প্রয়োজন।",
      "আবিষ্কারটি একটি \"ইন্ডাকটিভ প্রুফ\" বৈধকারীর জন্য একটি টেস্ট কেস হিসাবেও কাজ করেছিল, যার লক্ষ্য এই জাতীয় প্রমাণগুলিকে মানক এবং যাচাই করা।"
    ],
    "commentSummary": [
      "পাঠ্যটি টুরিং মেশিনের জটিলতার মধ্যে ডুবে যায়, ব্যস্ত বিভার সমস্যা এবং একটি নতুন টুরিং মেশিন প্রোগ্রাম, বিবি (3, 4) এর উপর দৃষ্টি নিবদ্ধ করে, যা জটিলতায় অ্যাকারম্যানের ফাংশনকে ছাড়িয়ে যায়।",
      "এটি প্রোগ্রামটির মডুলার কাঠামো, দীর্ঘকাল ধরে চলমান টুরিং মেশিনগুলির বৈশিষ্ট্য এবং কলমোগরভ জটিলতার প্রভাবগুলি নিয়ে আলোচনা করে, এই মেশিনগুলি বিশ্লেষণের চ্যালেঞ্জগুলি তুলে ধরে।",
      "কথোপকথনটি পিয়ার রিভিউ সিস্টেম, ডিজিটাল তথ্য উত্সগুলির নির্ভরযোগ্যতাও সমালোচনা করে এবং বৈজ্ঞানিক গবেষণায় যথাযথ সংরক্ষণাগার এবং উদ্ধৃতি অনুশীলনের গুরুত্বের উপর জোর দেয়।"
    ],
    "points": 167,
    "commentCount": 63,
    "retryCount": 0,
    "time": 1716462808
  },
  {
    "id": 40452260,
    "title": "ব্যাপক মূল্যবৃদ্ধির মধ্যে কম্পিউটারশেয়ার নিউটানিক্স এএইচভির জন্য ভিএমওয়্যার ত্যাগ করেছে",
    "originLink": "https://www.theregister.com/2024/05/22/computershare_vm_migration_project/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40452260",
    "commentBody": "",
    "originSummary": [
      "ব্রডকমের ভিএমওয়্যার অধিগ্রহণের পর উল্লেখযোগ্য মূল্যবৃদ্ধির কারণে বৈশ্বিক স্টক-মার্কেট শেয়ার রেজিস্ট্রি অপারেটর কম্পিউটারশেয়ার ভিএমওয়্যার ত্যাগ করছে।",
      "ভিএমওয়্যার হাইপারভাইজারের ব্যয় 10 থেকে 15 গুণ বেড়েছে, কম্পিউটারশেয়ারকে নিউটানিক্স এএইচভিতে স্যুইচ করতে প্ররোচিত করেছে, এক বছরের মধ্যে 24,000 ভিএম মাইগ্রেশন সম্পন্ন হবে বলে আশা করা হচ্ছে।",
      "এই পদক্ষেপটি ব্রডকমের জন্য সম্ভাব্য সমস্যাগুলিকে আন্ডারস্কোর করে, কারণ অন্যান্য বড় গ্রাহকরাও তার উচ্চ-রাজস্ব, উচ্চ-মার্জিন মূল্য কৌশলগুলির কারণে বিকল্পগুলি চাইতে পারে।"
    ],
    "commentSummary": [
      "ব্রডকমের মালিকানাধীন ভিএমওয়্যার উল্লেখযোগ্য মূল্য বৃদ্ধির কারণে 24,000 ভার্চুয়াল মেশিনের সাথে একটি প্রধান গ্রাহক হারিয়েছে, যা উচ্চ-রাজস্ব, উচ্চ-মার্জিন ব্যবসায়ের দিকে মনোনিবেশ করার কৌশল প্রতিফলিত করে।",
      "সমালোচকরা যুক্তি দেখান যে এই পদ্ধতিটি গ্রাহকদের নিউটানিক্স বা ওপেন-সোর্স সমাধানগুলির মতো প্রতিযোগীদের দিকে চালিত করার ঝুঁকি নেয়, বড় আইটি সিস্টেমগুলি স্থানান্তরিত করার চ্যালেঞ্জ এবং গ্রাহকের আস্থা বজায় রাখার গুরুত্বকে তুলে ধরে।",
      "আলোচনাটি বিক্রেতার লক-ইনের ঝুঁকিগুলিকেও জোর দেয় এবং একক হাইপারভাইজার বিক্রেতার উপর নির্ভরতা হ্রাস করার জন্য হাইব্রিড বা মাল্টি-ক্লাউড পদ্ধতির পরামর্শ দেয়।"
    ],
    "points": 167,
    "commentCount": 131,
    "retryCount": 0,
    "time": 1716454505
  }
]
