[
  {
    "id": 40447431,
    "title": "Uitgelekte documenten onthullen OpenAI's agressieve tactieken tegen voormalige werknemers",
    "originLink": "https://www.vox.com/future-perfect/351132/openai-vested-equity-nda-sam-altman-documents-employees",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40447431",
    "commentBody": "",
    "originSummary": [
      "Uitgelekte documenten tonen aan dat OpenAI, onder leiding van CEO Sam Altman, agressieve tactieken gebruikte om te voorkomen dat voormalige werknemers kritiek zouden uiten op het bedrijf door te dreigen hun verworven aandelen in te trekken tenzij ze beperkende exit-overeenkomsten tekenden.",
      "Ondanks Altman's publieke verontschuldigingen en beweringen van onwetendheid, suggereren interne documenten met zijn en andere handtekeningen dat ze op de hoogte waren van deze bepalingen, wat vragen oproept over OpenAI's transparantie en betrouwbaarheid.",
      "OpenAI is nu bezig met het bijwerken van het vertrekproces om ervoor te zorgen dat voormalige werknemers een gelijke behandeling krijgen en om niet-afscheidende clausules te schrappen, hoewel er nog meer werk moet worden verricht om de zorgen weg te nemen."
    ],
    "commentSummary": [
      "Uitgelekte documenten tonen aan dat OpenAI agressieve tactieken gebruikte om niet-afscheidende overeenkomsten af te dwingen door het verworven eigen vermogen van voormalige werknemers te bedreigen, wat leidde tot verzet en daaropvolgende toezeggingen van OpenAI.",
      "De situatie heeft discussies aangewakkerd over contractonderhandelingen, aandelencompensatie en niet-concurrentiebedingen, waarbij de complexiteit en regionale verschillen in afdwingbaarheid naar voren kwamen.",
      "Critici beweren dat de acties van OpenAI diepere kwesties van vertrouwen en transparantie onthullen, met bredere implicaties voor trends in de industrie, ethische zorgen en de invloed van prominente figuren zoals Sam Altman."
    ],
    "points": 1713,
    "commentCount": 499,
    "retryCount": 0,
    "time": 1716416550
  },
  {
    "id": 40448045,
    "title": "OpenAI heeft de stem van Scarlett Johansson niet gekloond voor ChatGPT, bevestigen de gegevens",
    "originLink": "https://www.washingtonpost.com/technology/2024/05/22/openai-scarlett-johansson-chatgpt-ai-voice/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40448045",
    "commentBody": "",
    "originSummary": [
      "Scarlett Johansson beweerde dat OpenAI haar stem zonder haar toestemming had nagemaakt nadat ze CEO Sam Altman's verzoek om een licentie te verlenen had geweigerd.",
      "OpenAI was op zoek naar niet-vakbondsacteurs met warme, innemende stemmen voor een geheim project om ChatGPT menselijker te maken, maar had niet expliciet als doel om Johansson's stem te klonen, volgens bronnen en documenten die door The Washington Post zijn bekeken."
    ],
    "commentSummary": [
      "OpenAI ligt onder vuur omdat het een stemacteur die klinkt als Scarlett Johansson zou hebben gebruikt voor ChatGPT zonder haar toestemming, wat juridische en ethische bezwaren oproept.",
      "Het debat belicht de complexiteit van de wetten op stemimitatie, verwijst naar zaken als Midler vs. Ford en Tom Waits vs. Frito-Lay en onderstreept de behoefte aan bijgewerkte wettelijke kaders.",
      "De controverse vestigt de aandacht op bredere implicaties voor AI, stemacteurs en de ethische overwegingen van het gebruik van stemmen met dezelfde klank zonder expliciete toestemming."
    ],
    "points": 489,
    "commentCount": 944,
    "retryCount": 0,
    "time": 1716419812
  },
  {
    "id": 40449767,
    "title": "WinDirStat: Open bron voor het bekijken en opschonen van schijfgebruik voor Windows",
    "originLink": "https://windirstat.net/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40449767",
    "commentBody": "",
    "originSummary": [
      "WinDirStat is een open-source hulpprogramma voor het bekijken en opschonen van schijfgebruik onder Microsoft Windows en biedt een mappenlijst, treemap en extensielijst.",
      "Alternatieven voor Linux zijn onder andere KDirStat en QDirStat, terwijl MacOS X gebruikers Disk Inventory X of GrandPerspective kunnen gebruiken.",
      "De software is gelicenseerd onder GPLv2, waardoor het vrij en open-source blijft."
    ],
    "commentSummary": [
      "De discussie vergelijkt verschillende hulpprogramma's voor het analyseren van schijfgebruik, met de nadruk op functies, prestaties en bruikbaarheid op verschillende besturingssystemen.",
      "WinDirStat is populair en open-source maar wordt bekritiseerd omdat het traag is, terwijl WizTree sneller is maar beveiligingsproblemen heeft en niet open-source is.",
      "Gebruikers benadrukken de afweging tussen snelheid, veiligheid en bruikbaarheid en geven aan behoefte te hebben aan betere functies voor bestandsbeheer en verbeterde visualisatiemethoden zoals treemaps en sunbursts."
    ],
    "points": 317,
    "commentCount": 156,
    "retryCount": 0,
    "time": 1716431654
  },
  {
    "id": 40453077,
    "title": "Microsoft-storing verstoort Bing-, Copilot-, ChatGPT- en DuckDuckGo-diensten",
    "originLink": "https://www.bleepingcomputer.com/news/microsoft/microsoft-outage-affects-bing-copilot-duckduckgo-and-chatgpt-internet-search/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40453077",
    "commentBody": "",
    "originSummary": [
      "Een grote uitval van Microsoft op 23 mei 2024 verstoorde verschillende diensten, waaronder Bing, Copilot, ChatGPT internet search en DuckDuckGo, en trof vooral gebruikers in Azië en Europa.",
      "De startpagina van Bing en de Copilot-diensten ondervonden aanzienlijke problemen, terwijl DuckDuckGo foutmeldingen liet zien, maar later de normale werking hervatte.",
      "OpenAI en Microsoft hebben de problemen erkend en blijven zich inspannen om de volledige functionaliteit van Bing en Copilot te herstellen."
    ],
    "commentSummary": [
      "Een storing bij Microsoft trof meerdere internetdiensten zoals Bing, Copilot, DuckDuckGo en ChatGPT.",
      "Het incident benadrukt de onderlinge verbondenheid van online diensten en hun afhankelijkheid van Microsofts infrastructuur.",
      "Voor meer gedetailleerde discussies zijn gebruikers doorverwezen naar een specifieke thread op Hacker News."
    ],
    "points": 267,
    "commentCount": 1,
    "retryCount": 0,
    "time": 1716461600
  },
  {
    "id": 40455758,
    "title": "Sierra's Space Quest II diskettefout legt AGI broncode bloot",
    "originLink": "https://lanceewing.github.io/blog/sierra/agi/sq2/2024/05/22/do-you-own-this-space-quest-2-disk.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40455758",
    "commentBody": "",
    "originSummary": [
      "In 2024 werd ontdekt dat bepaalde versies van Sierra On-Line's Space Quest II overblijfselen van C broncode op hun 720KB floppydisks hadden door onjuiste formattering.",
      "Deze fout legde ongeveer 70% van de broncode van Sierra's AGI-interpreter bloot, waaronder 75 C-bronbestanden en 16 assemblagebestanden, die tot 2016 onopgemerkt bleven.",
      "De broncode is nu beschikbaar op GitHub, wat waardevolle inzichten geeft in Sierra's ontwikkelingsprocessen en projecten zoals de AGILE webgebaseerde interpreter helpt."
    ],
    "commentSummary": [
      "De discussie belicht historische fouten in softwaredistributie, zoals het opnemen van gevoelige of onbedoelde gegevens in eindproductreleases, zoals in 1989 in het DOS-spel \"Double Dragon II: The Revenge\".",
      "Het onderzoekt antipiraterij maatregelen voor diskettes, de beperkingen van kopieerapparaten voor consumenten en moderne hulpmiddelen zoals Greaseweazle voor het lezen van gegevens op magnetisch niveau.",
      "Deelnemers delen nostalgische ervaringen met oude games, bespreken de impact van het lekken van broncode en benadrukken het belang van beeldvorming op sectorniveau voor archivering."
    ],
    "points": 234,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1716477380
  },
  {
    "id": 40449278,
    "title": "Leer vliegen met een drone: Interactieve beginnerscursus met FPVSIM",
    "originLink": "https://fpvsim.com/drone-flying-101",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40449278",
    "commentBody": "",
    "originSummary": [
      "FPVSIM biedt een gedetailleerde tutorial over het vliegen met een drone voor beginners, waarin de belangrijkste concepten zoals zweven, draaien, banking en gecoördineerde bochten aan bod komen.",
      "De tutorial belicht de verschillen tussen drone- en autonavigatie, met de nadruk op 3D-bewegingen door middel van rollen, gieren en pitch, en biedt praktische lessen via een webgebaseerde simulator.",
      "Gebruikers hebben toegang tot extra bronnen zoals handleidingen, prestatietips en geavanceerde configuraties, en kunnen blijven oefenen op de web- of desktopsimulators van FPVSIM voor een beter leerproces en realistische beelden."
    ],
    "commentSummary": [
      "\"Drone Flying 101 - An Interactive Tutorial for Beginners\" behandelt de basisprincipes van FPV (First-Person View) en niet-FPV (cinematic) drones en benadrukt de gebruiksvriendelijkheid van niet-FPV drones zoals de DJI Mavic dankzij de GPS-stabilisatie.",
      "De tutorial benadrukt het belang van het kiezen van de juiste zender en raadt OpenTX of EdgeTX software en het ExpressLRS protocol aan voor betere prestaties, met populaire zenders zoals Radiomaster en TBS Tango 2.",
      "De discussie gaat over het veranderende gebruik van drones in moderne oorlogsvoering, met name in Oekraïne, en gaat in op de mogelijke toekomst van autonome drones, de training van piloten en tegenmaatregelen."
    ],
    "points": 207,
    "commentCount": 112,
    "retryCount": 0,
    "time": 1716427535
  },
  {
    "id": 40447998,
    "title": "Emacs Gemakkelijk tekenen: Naadloos tekengereedschap geïntegreerd met Org-Mode",
    "originLink": "https://github.com/misohena/el-easydraw",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40447998",
    "commentBody": "",
    "originSummary": [
      "Emacs Easy Draw is een tekenprogramma dat binnen Emacs werkt. Het vereist Emacs 27.2, ondersteuning voor afbeeldingen en SVG, gzip/gunzip en libxml.",
      "Het integreert met Org-Mode, waardoor gebruikers tekeningen direct in documenten kunnen maken en bewerken, en het exporteren als HTML of LaTeX ondersteunt.",
      "De tool gebruikt een subset van de SVG-specificatie, bevat een kleurenkiezerbibliotheek voor CSS- en HTML-bewerking en heeft een GPLv3-licentie, waardoor bijdragen vanuit de gemeenschap worden aangemoedigd."
    ],
    "commentSummary": [
      "Emacs Easydraw is een tekenprogramma ontwikkeld voor Emacs, uniek gemaakt op Windows in plaats van de typische Linux-omgeving.",
      "Gebruikers vinden het handig voor kleine tekeningen en mogelijke integratie met workflows zoals org-roam, hoewel het momenteel handschriftmogelijkheden en samenwerkingsfuncties mist.",
      "Met algoritmeverbeteringen denken sommigen dat het zou kunnen concurreren met Inkscape, en het heeft een handige kleurkiezer, waardoor het superieur is aan veel online tools."
    ],
    "points": 198,
    "commentCount": 12,
    "retryCount": 0,
    "time": 1716419630
  },
  {
    "id": 40452655,
    "title": "Tom Waits wint 2,6 miljoen dollar rechtszaak tegen Frito-Lay wegens verduistering van stemrecht",
    "originLink": "http://tomwaitslibrary.info/biography/copyright/frito-lay/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40452655",
    "commentBody": "",
    "originSummary": [
      "Tom Waits klaagde Frito-Lay Inc. in 1988 aan voor het gebruik van een imitatie van zijn lied \"Step Right Up\" in een Doritos-reclame, waarbij hij aanvoerde dat er sprake was van valse goedkeuring en verduistering van zijn stem.",
      "De jury kende Waits 2,6 miljoen dollar toe, een vonnis dat in hoger beroep werd bevestigd. Hiermee werd een juridisch precedent geschapen voor verduistering van stemmen onder de Lanham Act en de Californische wet.",
      "Waits bekritiseerde artiesten die hun muziek toelaten in advertenties met het argument dat dit de artistieke integriteit ondermijnt, en zijn zaak benadrukt het belang van het beschermen van artistieke reputatie."
    ],
    "commentSummary": [
      "De discussie gaat over juridische en ethische problemen bij het gebruik van stemacteurs die op geluid lijken, waarbij wordt verwezen naar de rechtszaak van Tom Waits tegen Frito-Lay en de controverse van Scarlett Johansson met OpenAI.",
      "Het onderzoekt de complexiteit van stemimitatie, het concept van \"uitverkoop\" en de veranderende perceptie van artiesten die licenties geven op hun werk, inclusief de juridische implicaties van het gebruik van een stem die lijkt op die van Johansson zonder toestemming.",
      "Het gesprek bekritiseert bedrijfspraktijken, in het bijzonder die van OpenAI, en richt zich op bredere zorgen over AI-gegenereerde stemmen die invloed hebben op intellectueel eigendom en artistieke integriteit."
    ],
    "points": 186,
    "commentCount": 135,
    "retryCount": 0,
    "time": 1716457938
  },
  {
    "id": 40450128,
    "title": "UI-bibliotheek voor typeranimatie: Gratis, aanpasbare componenten voor ontwerpers",
    "originLink": "https://magicui.design/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40450128",
    "commentBody": "",
    "originSummary": [
      "De Typing Animation UI-bibliotheek voor ontwerpingenieurs biedt meer dan 20 gratis en open-source geanimeerde componenten, gebouwd met React, Typescript, Tailwind CSS en Framer Motion.",
      "De bibliotheek bevat functies zoals bestandsopslag, zoeken in volledige tekst, meertalige ondersteuning en kalenderfiltering, en er zijn echte componentdemo's beschikbaar.",
      "Gebruikers hebben de bibliotheek op Twitter geprezen om het ontwerp en de functionaliteit, en Magic UI Pro biedt meer geavanceerde sjablonen voor verdere aanpassing."
    ],
    "commentSummary": [
      "Magic UI, een UI-bibliotheek voor ontwerptechnici, heeft gemengde kritieken ontvangen. Sommigen roemen de esthetische aantrekkingskracht en anderen bekritiseren het omdat het visueel afleidend en afgeleid zou zijn.",
      "Belangrijke punten van kritiek zijn de trage prestaties, het hoge verbruik van bronnen, problemen met de bruikbaarheid op Firefox en beschuldigingen dat het een rip-off is van ShadCN/UI.",
      "De discussie belicht ook de dominantie van React in webontwikkeling, het nut van het onderhouden van Figma-componenten en prestatieproblemen zoals extreem CPU-gebruik en browser crashes op de demosite."
    ],
    "points": 176,
    "commentCount": 77,
    "retryCount": 0,
    "time": 1716434634
  },
  {
    "id": 40446010,
    "title": "NVIDIA lanceert CUDA-Q platform voor wereldwijde kwantum rekencentra",
    "originLink": "https://nvidianews.nvidia.com/news/nvidia-announces-financial-results-for-first-quarter-fiscal-2025",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40446010",
    "commentBody": "",
    "originSummary": [
      "NVIDIA heeft het CUDA-Q platform geïntroduceerd dat gericht is op het wereldwijd bevorderen van kwantumcomputingcentra.",
      "De aankondiging werd gedaan op 12 mei 2024 en markeert een belangrijke stap in de kwantumcomputertechnologie.",
      "Deze lancering zal naar verwachting het onderzoek en de ontwikkeling op het gebied van kwantumcomputing versnellen."
    ],
    "commentSummary": [
      "De resultaten van Nvidia voor het eerste kwartaal van boekjaar 2025 laten een sterke verkoop van H100 GPU's zien, maar waarschuwen voor mogelijke risico's in de toeleveringsketen, waarbij parallellen worden getrokken met historische gevallen zoals Cisco.",
      "De discussie benadrukt het belang van beleggingsstrategieën zoals diversificatie, risicobalancering en het begrijpen van de marktdynamiek, en benadrukt de leidende positie van Nvidia in AI dankzij zijn superieure software-ecosysteem.",
      "Er is bezorgdheid over de duurzaamheid van de groei van Nvidia te midden van de AI-hype, potentiële concurrentie van klanten zoals Meta en Microsoft/OpenAI die hun eigen chips maken, en productiebeperkingen van TSMC en Samsung."
    ],
    "points": 175,
    "commentCount": 345,
    "retryCount": 0,
    "time": 1716409561
  },
  {
    "id": 40445093,
    "title": "Senatoren waarschuwen dat autofabrikanten gegevens van bestuurders zonder bevelschrift met de politie delen",
    "originLink": "https://www.thedrive.com/news/automakers-will-give-your-location-to-police-without-a-warrant-senators-say",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40445093",
    "commentBody": "",
    "originSummary": [
      "Acht autofabrikanten, waaronder Toyota, Subaru en BMW, hebben aan het Congres toegegeven dat ze gegevens van bestuurders aan de politie zullen verstrekken zonder gerechtelijk bevel, wat in tegenspraak is met hun eerdere beloften om de privacy van consumenten te beschermen.",
      "Senatoren Ron Wyden en Ed Markey bekritiseerden de autofabrikanten voor het misleiden van consumenten en uitten hun bezorgdheid over het mogelijke misbruik van locatiegegevens door het rechtssysteem.",
      "De inconsistente houding van de auto-industrie op het gebied van privacy, zoals het verzet tegen wetsvoorstellen over het recht op reparatie en het compromitteren van consumentengegevens, benadrukt de noodzaak om waakzaam te zijn met betrekking tot de technologie van verbonden auto's."
    ],
    "commentSummary": [
      "Senatoren maken zich zorgen over autofabrikanten die locatiegegevens van voertuigen zonder bevelschrift aan de politie verstrekken, waardoor privacy- en volgproblemen in moderne voertuigen ontstaan.",
      "Gebruikers bespreken de complexiteit van het uitschakelen van volgdiensten zoals OnStar, de legaliteit van dergelijke acties en de impact op de functionaliteit van voertuigen en garanties.",
      "Het debat belicht de balans tussen openbare veiligheid en privacy, de rol van verzekeringsmaatschappijen en de behoefte aan robuuste regelgeving op het gebied van consumentenrechten en gegevensprivacy."
    ],
    "points": 173,
    "commentCount": 171,
    "retryCount": 0,
    "time": 1716405713
  },
  {
    "id": 40447117,
    "title": "Voyager 1 hervat verzending van wetenschappelijke gegevens na onderbreking van vijf maanden",
    "originLink": "https://blogs.nasa.gov/voyager/2024/05/22/voyager-1-resumes-sending-science-data-from-two-instruments/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40447117",
    "commentBody": "",
    "originSummary": [
      "Voyager 1 heeft het verzenden van wetenschappelijke gegevens van twee van zijn vier instrumenten hervat na een computerprobleem in november 2023.",
      "Het missieteam is bezig met het herkalibreren van de resterende twee instrumenten, waarbij het subsysteem voor plasmagolven en de magnetometer nu operationeel zijn.",
      "Het probleem werd getraceerd naar een beschadigd geheugen in het vluchtgegevenssubsysteem; Voyager 1, gelanceerd in 1977, is meer dan 15 miljard mijl van de aarde verwijderd en is een van de langst werkende ruimtevaartuigen van NASA."
    ],
    "commentSummary": [
      "Het debat over het NASA-artikel over de hervatting van de gegevensoverdracht van Voyager 1 richt zich op de vraag of de Voyager-missies de grootste wetenschappelijke prestaties van de mensheid zijn.",
      "Deelnemers vergelijken de lange levensduur en het eenvoudige ontwerp van Voyager met complexe projecten zoals de Large Hadron Collider en genoomsequentiebepaling, en benadrukken het belang van zwaartekrachtondersteuning en de unieke planetaire uitlijning.",
      "In de discussie worden ook andere monumentale prestaties genoemd, zoals de uitroeiing van de pokken en de ontwikkeling van de boekdrukkunst, waarbij de nadruk wordt gelegd op de uitdaging om deze prestaties te rangschikken vanwege hun grote impact."
    ],
    "points": 171,
    "commentCount": 42,
    "retryCount": 0,
    "time": 1716414700
  },
  {
    "id": 40453221,
    "title": "Nieuwe doorbraak in Turing Machine berekent functie op Ackermann-niveau",
    "originLink": "https://www.sligocki.com//2024/05/22/bb-3-4-a14.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40453221",
    "commentBody": "",
    "originSummary": [
      "Pavel Kropitz ontdekte een Turing Machine (TM) met 3 toestanden en 4 symbolen die een functie op Ackermann-niveau kan berekenen en stopt met precies (2 \\uparrow^{15} 5) + 14 \\) niet-nul-symbolen op de band.",
      "Deze TM, gevonden op 25 april 2024, is de eerste bekende die zo'n complexe functie simuleert, waarbij het gedrag dubbele inductie vereist om te bewijzen.",
      "De ontdekking diende ook als testcase voor een \"inductief bewijs\" validator, gericht op het standaardiseren en verifiëren van zulke bewijzen."
    ],
    "commentSummary": [
      "De tekst gaat in op de complexiteit van Turing machines, met de nadruk op het Busy Beaver probleem en een nieuw Turing machine programma, BB(3, 4), dat de functie van Ackermann overtreft in complexiteit.",
      "Het bespreekt de modulaire structuur van het programma, de eigenschappen van langlopende Turing-machines en de implicaties van Kolmogorov-complexiteit en benadrukt de uitdagingen bij het analyseren van deze machines.",
      "Het gesprek bekritiseert ook het systeem van peer review, de betrouwbaarheid van digitale informatiebronnen en benadrukt het belang van goede archiverings- en citeerpraktijken in wetenschappelijk onderzoek."
    ],
    "points": 167,
    "commentCount": 63,
    "retryCount": 0,
    "time": 1716462808
  },
  {
    "id": 40452260,
    "title": "Computershare dumpt VMware voor Nutanix AHV te midden van enorme prijsstijgingen",
    "originLink": "https://www.theregister.com/2024/05/22/computershare_vm_migration_project/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40452260",
    "commentBody": "",
    "originSummary": [
      "Computershare, een wereldwijde beheerder van aandelenregisters, stapt uit VMware vanwege de aanzienlijke prijsstijgingen na de overname van VMware door Broadcom.",
      "De kosten voor VMware hypervisor stegen met 10 tot 15 keer, waardoor Computershare overstapte op Nutanix AHV, met een migratie van 24.000 VM's die naar verwachting binnen een jaar voltooid zal zijn.",
      "Deze stap onderstreept potentiële problemen voor Broadcom, aangezien andere grote klanten ook alternatieven zouden kunnen zoeken vanwege de prijsstrategieën met hoge inkomsten en hoge marges."
    ],
    "commentSummary": [
      "VMware, dat nu eigendom is van Broadcom, heeft een grote klant met 24.000 virtuele machines verloren door aanzienlijke prijsverhogingen, als gevolg van een strategie om zich te richten op activiteiten met hoge inkomsten en hoge marges.",
      "Critici beweren dat deze aanpak klanten dreigt te sturen naar concurrenten zoals Nutanix of open-source oplossingen, en benadrukken de uitdagingen van het migreren van grote IT-systemen en het belang van het behoud van het vertrouwen van de klant.",
      "De discussie benadrukt ook de risico's van vendor lock-in en stelt hybride of multi-cloud benaderingen voor om de afhankelijkheid van één hypervisorleverancier te beperken."
    ],
    "points": 167,
    "commentCount": 131,
    "retryCount": 0,
    "time": 1716454505
  }
]
