[
  {
    "id": 37408196,
    "title": "ब्रिटेन ने निजी मैसेजिंग को लेकर बिग टेक के साथ टकराव से हाथ पीछे खींचा",
    "originLink": "https://www.ft.com/content/770e58b1-a299-4b7b-a129-bded8649a43b",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37408196",
    "commentBody": "",
    "originSummary": [
      "ब्रिटेन की सरकार ने निजी मैसेजिंग तक पहुंच को लेकर बिग टेक कंपनियों के साथ अपने टकराव से पीछे हटने का फैसला किया है।",
      "यह निर्णय बच्चों को हानिकारक ऑनलाइन सामग्री से बचाने के लिए उनके प्रस्तावित नियमों का पालन करता है, जो सुरक्षा और गोपनीयता चिंताओं के बीच संभावित टकराव को उजागर करता है।",
      "सरकार का पीछे हटना एंड-टू-एंड एन्क्रिप्शन और संदेश गोपनीयता पर संभावित प्रभावों के बारे में चिंताओं को दर्शाता है।"
    ],
    "commentSummary": [
      "एन्क्रिप्टेड संदेशों तक पहुंचने पर अपने रुख को कथित तौर पर गलत तरीके से प्रस्तुत करने के लिए यूके सरकार की आलोचना की गई है, आलोचकों का तर्क है कि प्रस्तावित ऑनलाइन सुरक्षा विधेयक एन्क्रिप्शन को कमजोर करता है। यह कुछ सुरक्षित मैसेजिंग प्लेटफार्मों को अपने सुरक्षा उपायों को संरक्षित करने के लिए यूके छोड़ने पर विचार करने का प्रस्ताव दे रहा है।",
      "सरकार एन्क्रिप्शन विवाद में पीछे हटने से इनकार करती है, जोर देकर कहती है कि यह बाल सुरक्षा के लिए समर्पित है। हालांकि, इसने क्लाइंट-साइड स्कैनिंग, गोपनीयता निहितार्थ, डेटा माइनिंग, एंड-टू-एंड एन्क्रिप्शन और बैकडोर एक्सेस पर बहस छेड़ दी है।",
      "हानिकारक सामग्री के लिए मैसेजिंग एप्लिकेशन की स्कैनिंग में देरी करने की सरकार की योजना जब तक कि यह तकनीकी रूप से व्यवहार्य नहीं हो जाती, तब तक आलोचना का सामना करना पड़ता है। एन्क्रिप्शन पर क्वांटम कंप्यूटिंग का संभावित प्रभाव, और विभिन्न एन्क्रिप्शन विधियों की कमजोरियां, जनता के बीच विवादास्पद विषय भी हैं।"
    ],
    "points": 713,
    "commentCount": 283,
    "retryCount": 0,
    "time": 1694021305
  },
  {
    "id": 37408150,
    "title": "URL में किसी वेबसाइट को होस्ट करें",
    "originLink": "https://smolsite.zip/UEsDBBQAAgAIAMYVIVfaTMb/VQIAANwDAAAKAAAAaW5kZXguaHRtbHVTUW+bMBB+Lr/ilq1i0wo4BGghJA/t9lBpk6Zpm6Y91cEOeAPMbCeEbv3vO0OjZdIK4mTuvvt8+vw5r0xTr5284pStc22Gmq+djWQD/HI2tPhRKrlrmVfIWqoMnm/HZ3laEg0teQY7Vb+cMWpoNiYCvS9fH5r64nxxg0voBTPVyp2HLlRclJXBdeLCXvD+Wh5WLgEC8xBsDrtavXIrY7osCPq+9/uFL1UZhIQQy+ueL94ibUdNBWzlvo/AT9MbjFEUQ4QxQrIYSOHHcWh5sRLbmKb7yCfhTQIxluIxJoB/kBTeBPbmHoJtTNMv+N03CVwVBKtRYpltHsbqE+QFAYv1LBhz3lj5H/mVZXdhK+p65Z6HC3bJYkanhCc7WggzoC5+9JhSu5qvXL7nrWTMDSYNrBy4mr1aOlvZGm9LG1EPGWjaak9zJfCsGqpK0WYo71V3WDoPTsFbwxUe8FlHGRNteVLrFLeFv+eLhx4S+y6ds6MLLol9lyf9IbHtZ4YfzNErU+rByYPJVXkweszJrbus4+brW+NqoKAbWWth+DOEzNeOk3frT5XQ0Fey5mArqIDRIFotGAdTcfj88R2iu0ewhEpqA4PcKY1O1BOmkE1D0aC1aNGf3c4AiqcGU+HEyIUbf7v9YLXlF3BNsSmJgLeFxC2EuQBsBYMy4A/QrRVsZi2p0ZPHgf170QWz7DiIwqvzAjAH3puv33+moGXDjzjckfGDb68bNEMtS+l3bYl4XlTyCeq7gpp/SX7DBifFQT2vV7QDcjdDgced82ASFhfTnXb+AFBLAQIeAxQAAgAIAMYVIVfaTMb/VQIAANwDAAAKAAAAAAAAAAEAAACkgQAAAABpbmRleC5odG1sUEsFBgAAAAABAAEAOAAAAH0CAAAAAA==",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37408150",
    "commentBody": "",
    "originSummary": [
      "लेखक ने हाल ही में अपने वेब सर्वर लाइब्रेरी के लिए एक प्रौद्योगिकी प्रदर्शन विकसित किया है - जिसे आमतौर पर 'टेक डेमो' के रूप में जाना जाता है, जिसे मनोरंजक लेकिन कार्यात्मक रूप से व्यर्थ के रूप में वर्णित किया गया है।"
    ],
    "commentSummary": [
      "चर्चा में वेबसाइट होस्टिंग और यूआरएल के माध्यम से सामग्री साझा करने के लिए विभिन्न परियोजनाएं और विचार शामिल हैं, जिनमें वेब सर्वर लाइब्रेरी, टाइनीयूआरएल, डेटा यूआरआई, जीज़िप संपीड़न, बेस 64 एन्कोडिंग और ज़िप फाइलें शामिल हैं।",
      "यह इन विधियों के पेशेवरों और विपक्षों को छूता है, व्यावसायीकरण, सुरक्षा जोखिम, फ़ाइल आकार सीमा और साझा सामग्री के लिए देयता जैसे मुद्दों को संबोधित करता है।",
      "कई तकनीकें और उदाहरण इन विधियों की अभिनव क्षमता को चित्रित करते हैं, टिप्पणी अनुभाग में उन लोगों से साझा अंतर्दृष्टि को उजागर करते हैं।"
    ],
    "points": 519,
    "commentCount": 163,
    "retryCount": 0,
    "time": 1694021041
  },
  {
    "id": 37412698,
    "title": "jq 1.7",
    "originLink": "https://github.com/jqlang/jq/releases/tag/jq-1.7",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37412698",
    "commentBody": "",
    "originSummary": [
      "ओपन सोर्स सॉफ्टवेयर टूल, जेक्यू 1.7, जारी किया गया है, जो पांच साल के विराम और नए व्यवस्थापकों और रखरखावकर्ताओं की शुरूआत के बाद परियोजना के पुनरुद्धार को चिह्नित करता है।",
      "1.7 रिलीज बेहतर प्रलेखन, प्लेटफ़ॉर्म संगतता, कमांड लाइन इंटरफ़ेस (सीएलआई) में परिवर्तन और भाषा संवर्द्धन सहित अपडेट और संवर्द्धन की एक श्रृंखला लाता है।",
      "पोस्ट परियोजना के योगदानकर्ताओं को स्वीकार करता है और चेंजलॉग के माध्यम से इस अद्यतन में किए गए परिवर्तनों की पूर्ण समीक्षा के लिए एक लिंक प्रदान करता है।"
    ],
    "commentSummary": [
      "लेख JSON फ़ाइलों को पार्स करने में प्रोग्रामिंग भाषा JQ की प्रभावकारिता पर विविध विचारों को शामिल करता है।",
      "कुछ उपयोगकर्ता जेक्यू की सराहना करते हैं जबकि अन्य इसके क्वेरी सिंटैक्स को सहज नहीं मानते हैं, इसके बजाय पायथन जैसे समाधानों का पक्ष लेते हैं।",
      "जबकि जेक्यू के मूल्य को मान्यता प्राप्त है, इसकी उपयोगिता के बारे में राय भिन्न होती है, कुछ उपयोगकर्ता जेएसओएन डेटा के प्रबंधन के लिए विकल्प सुझाते हैं।"
    ],
    "points": 383,
    "commentCount": 184,
    "retryCount": 0,
    "time": 1694042165
  },
  {
    "id": 37408776,
    "title": "स्टॉर्म -0558 प्रमुख अधिग्रहण के लिए तकनीकी जांच के परिणाम",
    "originLink": "https://msrc.microsoft.com/blog/2023/09/results-of-major-technical-investigations-for-storm-0558-key-acquisition/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37408776",
    "commentBody": "",
    "originSummary": [
      "माइक्रोसॉफ्ट ने स्टॉर्म-0558 अभिनेता की जांच के परिणामों को साझा किया है, जिसने ओडब्ल्यूए और Outlook.com का उल्लंघन करने के लिए उपभोक्ता कुंजी का इस्तेमाल किया था।",
      "निष्कर्षों से पता चलता है कि अप्रैल 2021 में एक क्रैश डंप में साइनिंग कुंजी थी, जिसे बाद में कॉर्पोरेट नेटवर्क के भीतर डिबगिंग वातावरण में स्थानांतरित कर दिया गया। इसके बाद, इस कुंजी को हासिल करने के लिए अभिनेता द्वारा एक माइक्रोसॉफ्ट इंजीनियर के कॉर्पोरेट खाते से छेड़छाड़ की गई थी।",
      "माइक्रोसॉफ्ट ने एक लाइब्रेरी त्रुटि की भी खोज की जो मेल सिस्टम को उपभोक्ता कुंजी के साथ हस्ताक्षरित एंटरप्राइज़ ईमेल अनुरोधों को स्वीकार करने देती है, जिसे कंपनी ने तब से ठीक कर दिया है।"
    ],
    "commentSummary": [
      "इस पाठ में Microsoft में सुरक्षा उल्लंघनों और कमजोरियों को संक्षेप में प्रस्तुत किया गया है, जिसमें छेड़छाड़ किए गए क्रेडेंशियल्स, संवेदनशील डेटा तक अनधिकृत पहुंच, प्रमुख सामग्री का गलत प्रबंधन और प्रमाणीकरण प्रणाली में संभावित कमजोर स्थान शामिल हैं.",
      "इन घटनाओं ने माइक्रोसॉफ्ट के सुरक्षा उपायों और संरचनात्मक मुद्दों के आसपास बहस छेड़ दी है, साइबर हमलों के संभावित जोखिमों और परिणामों पर सवाल उठाया है।",
      "प्रबलित इंजीनियरिंग प्रणालियों, डेटा सुरक्षा, लॉग प्रतिधारण नीतियों और तृतीय-पक्ष जांचकर्ताओं की आवश्यकता पर जोर देते हुए, चर्चा इन घटनाओं के Microsoft के प्रबंधन की आलोचना करती है।"
    ],
    "points": 371,
    "commentCount": 173,
    "retryCount": 0,
    "time": 1694023641
  },
  {
    "id": 37413908,
    "title": "मेरा पसंदीदा एरलांग कार्यक्रम (2013)",
    "originLink": "https://joearms.github.io/#2013-11-21%20My%20favorite%20Erlang%20Program",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37413908",
    "commentBody": "",
    "originSummary": [
      "लेखक ने एरलांग भाषा में \"यूनिवर्सल सर्वर\" नामक एक प्रोग्राम विकसित किया, जो इसकी बहुमुखी प्रतिभा का प्रदर्शन करता है क्योंकि इसे किसी भी विशिष्ट सर्वर बनने के लिए कॉन्फ़िगर किया जा सकता है।",
      "उन्होंने एक फैक्टोरियल सर्वर बनाकर और इन सर्वरों को एक परीक्षण कार्यक्रम में जोड़कर इसे बढ़ाया, एरलांग की प्रभावकारिता का और उदाहरण दिया।",
      "प्लैनेट लैब अनुसंधान नेटवर्क का उपयोग करते हुए, लेखक ने एक गपशप एल्गोरिथ्म लागू किया, जिससे नेटवर्क को विभिन्न सर्वरों में बदलने की अनुमति मिली, जो एरलांग भाषा की गतिशील प्रकृति और नेटवर्क अनुप्रयोगों में इसकी उपयोगिता को दर्शाता है।"
    ],
    "commentSummary": [
      "चर्चा एरलांग प्रोग्रामिंग भाषा, इसके कॉन्करेंसी मॉडल और हॉट-रीलोडिंग क्षमताओं पर केंद्रित है।",
      "गो जैसी अन्य भाषाओं पर एरलांग चुनने के लाभों पर प्रकाश डाला गया है।",
      "सुरक्षा मुद्दे, अन्य वितरित प्रणालियों के साथ एरलांग की तुलना, और एक कैननिकल उदाहरण कार्यक्रम की आवश्यकता अन्य विषयों पर चर्चा की गई है।"
    ],
    "points": 293,
    "commentCount": 113,
    "retryCount": 0,
    "time": 1694052822
  },
  {
    "id": 37412772,
    "title": "भोजन चुराने के लिए बीटल ने पीठ पर 'दीमक' उगाई",
    "originLink": "https://www.science.org/content/article/beetle-grows-termite-back-steal-food",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37412772",
    "commentBody": "",
    "originSummary": [
      "वैज्ञानिकों ने रोव बीटल की एक नई प्रजाति की खोज की है जो दीमक की शारीरिक बनावट की नकल करती है और उन्हें भोजन प्रदान करने में धोखा देती है।",
      "भृंग दीमक के शरीर के खंडों और विशेषताओं से मिलता-जुलता है, जिससे यह दीमक के घोंसले के भीतर पहचान से बचने में सक्षम होता है।",
      "दीमक के अंडे या लार्वा का सेवन करने के बजाय, बीटल संभवतः उनके व्यवहार की नकल करता है, भोजन के लिए \"भीख\" मांगता है और इस प्रकार खुद को जीविका का एक निरंतर स्रोत सुरक्षित करता है।"
    ],
    "commentSummary": [
      "एक ऑस्ट्रेलियाई बीटल भोजन चोरी के लिए दीमक की नकल करने के लिए विकसित हुआ है, जिससे दो प्रजातियों के बीच एक चल रही विकासवादी हथियारों की दौड़ पैदा हो गई है।",
      "अधिकांश वार्तालाप विकासवादी सिद्धांतों की वैधता से संबंधित है, जिसमें \"बस-सो कहानियों\" की सटीकता के बारे में बहस और मिमिक्री के पीछे के कारणों पर अटकलें शामिल हैं।",
      "पोस्ट में जीन चोरी, बीटल की मिमिक्री की प्रभावशीलता और विभिन्न प्रजातियों की नकल करने के लिए विकसित होने वाले अन्य जीवों की संभावनाओं पर चर्चा शामिल है।"
    ],
    "points": 256,
    "commentCount": 142,
    "retryCount": 0,
    "time": 1694042799
  },
  {
    "id": 37407331,
    "title": "समाजवाद क्यों? (1949)",
    "originLink": "https://monthlyreview.org/2009/05/01/why-socialism/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37407331",
    "commentBody": "",
    "originSummary": [
      "अल्बर्ट आइंस्टीन सामाजिक संकटों के समाधान के रूप में समाजवाद की वकालत करते हैं, संभावित संघर्ष को कम करने के लिए एक सुपरनेशनल संगठन के महत्व पर जोर देते हैं।",
      "वह मनुष्यों और जानवरों के सामाजिक व्यवहार के बीच एक चिह्नित अंतर को दर्शाता है, यह तर्क देते हुए कि हमारी वर्तमान आर्थिक प्रणाली स्व-हित और असमानता को बढ़ावा देती है।",
      "आइंस्टीन का सुझाव है कि समाजवाद, सामाजिक उद्देश्यों पर केंद्रित एक शिक्षा संरचना के साथ मिलकर, सामाजिक मुद्दों को संबोधित कर सकता है, हालांकि वह इसकी अंतर्निहित चुनौतियों को पहचानता है और इन मामलों पर स्वतंत्र और खुली चर्चा के महत्व पर जोर देता है।"
    ],
    "commentSummary": [
      "चर्चा में व्यापक आर्थिक विषयों, अर्थात् समाजवाद, पूंजीवाद, श्रम और बेरोजगारी शामिल हैं, जो समाजवाद और मार्क्स के मूल्य सिद्धांत को लागू करने की चुनौतियों को छूते हैं।",
      "संवाद में श्रम और पूंजी के बीच बातचीत, पूंजीवाद पर बेरोजगारी का प्रभाव और अलग-अलग आर्थिक प्रणालियों की आलोचना शामिल है।",
      "इसके अतिरिक्त, बातचीत आर्थिक सिद्धांतों के भीतर अंतर्निहित जटिलताओं, एक प्रभावी मूल्य माप प्रणाली की चुनौतियों और संभावित समाधानों के प्रति अलग-अलग दृष्टिकोण को स्वीकार करती है।"
    ],
    "points": 256,
    "commentCount": 572,
    "retryCount": 0,
    "time": 1694017262
  },
  {
    "id": 37408929,
    "title": "37सिग्नल \"एक बार\" पेश करता है - एक बार सॉफ्टवेयर खरीदें",
    "originLink": "https://once.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37408929",
    "commentBody": "",
    "originSummary": [
      "लेखक व्यवसाय सॉफ्टवेयर मॉडल में बदलाव को इंगित करता है, जो सॉफ्टवेयर के मालिक से सॉफ्टवेयर के रूप में एक सेवा (एसएएएस) मॉडल के तहत सदस्यता लेने के लिए संक्रमण करता है।",
      "उनका तर्क है कि जबकि एसएएएस सॉफ्टवेयर विक्रेताओं के लिए वित्तीय रूप से फायदेमंद रहा है, यह प्रवृत्ति स्व-होस्टिंग तकनीक की वृद्धि और संगठनों की अधिक नियंत्रण की इच्छा के साथ कम हो रही है।",
      "लेखक ने \"वन्स\" पेश किया है, जो सॉफ्टवेयर टूल की एक आगामी श्रृंखला है जिसे एक ही भुगतान के साथ अनिश्चित काल तक स्वामित्व में रखा जा सकता है, जो संभावित पोस्ट-एसएएएस युग को दर्शाता है और 2023 के अंत में अनावरण करने की योजना है।"
    ],
    "commentSummary": [
      "सदस्यता मूल्य निर्धारण मॉडल और सॉफ्टवेयर के लिए एक बार के भुगतान के बीच एक बहस चल रही है, जो कठिन रद्दीकरण, संचयी लागत और अपडेट की निरंतर आवश्यकता पर चिंताओं से प्रेरित है।",
      "37सिग्नल द्वारा \"वन्स\" मूल्य निर्धारण मॉडल की घोषणा मिश्रित प्रतिक्रियाओं को उकसाती है, कुछ उपयोगकर्ता एक बार के भुगतान विकल्प की सराहना करते हैं, जबकि अन्य संदेह व्यक्त करते हैं और घोषणा में उपयोग की जाने वाली भाषा की आलोचना करते हैं।",
      "चर्चाओं में दीर्घकालिक सॉफ़्टवेयर समर्थन, संगतता, SaaS (एक सेवा के रूप में सॉफ्टवेयर) मॉडल की सीमाओं और स्व-होस्टिंग के लाभों के बारे में चिंताएं भी शामिल हैं।"
    ],
    "points": 240,
    "commentCount": 205,
    "retryCount": 0,
    "time": 1694024235
  },
  {
    "id": 37410630,
    "title": "यह पृष्ठ केवल तभी मौजूद होता है जब कोई इसे देख रहा हो।",
    "originLink": "http://ephemeralp2p.durazo.us/2bbbf21959178ef2f935e90fc60e5b6e368d27514fe305ca7dcecc32c0134838",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37410630",
    "commentBody": "",
    "originSummary": [
      "अल्पकालिक पी 2 पी एक पीयर-टू-पीयर कंटेंट शेयरिंग प्लेटफॉर्म है; उपयोगकर्ता उस सामग्री के हैश को पंजीकृत करते हैं जिसे वे साझा करना चाहते हैं, और यह सामग्री पुनर्प्राप्त की जाती है और एक सर्वर द्वारा पारित की जाती है जब अन्य लोग संबंधित लिंक पर जाते हैं।",
      "एलिक्सिर और फीनिक्स फ्रेमवर्क का उपयोग करके प्लेटफॉर्म, ब्राउज़र वेबसॉकेट के माध्यम से पीयर-टू-पीयर लेनदेन की क्षमता और सामग्री-संबोधित वेब की अवधारणा की पड़ताल करता है।",
      "यह एप्लिकेशन साझा HTML सामग्री को साफ नहीं करता है; हालांकि, एक्सचेंज में कोई निजी जानकारी शामिल नहीं है।"
    ],
    "commentSummary": [
      "चर्चा एलिक्सिर, फीनिक्स और वेबसॉकेट के लिए एक सीखने-आधारित खिलौना ऐप पर केंद्रित है, जिसने वास्तव में वितरित नेटवर्क के लिए ब्राउज़र की पीयर-टू-पीयर क्षमताओं की क्षमता को लाया।",
      "प्रतिभागियों ने वेब पर अल्पकालिक पीयर-टू-पीयर सामग्री साझा करने के गुणों और चुनौतियों पर बहस की, जिसमें अनुकूलन योग्य ओपन-सोर्स क्लाइंट, वेबआरटीसी की क्षमता और वर्तमान में प्रचलित केंद्रीकृत प्लेटफॉर्म शामिल हैं।",
      "सर्वर कैशिंग एन्हांसमेंट, गैर-जेएस सक्षम ग्राहकों के लिए पृष्ठों को देखने के लिए प्रावधान, नेटवर्क ग्लिच को संभालने, और वेब होस्टिंग में इस तकनीक का उपयोग करने की क्षमता के लिए विचारों पर भी बहस हुई, जिसमें सीमाओं और लाभों दोनों पर प्रकाश डाला गया।"
    ],
    "points": 227,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1694031062
  },
  {
    "id": 37416430,
    "title": "Exa की निंदा की जाती है",
    "originLink": "https://github.com/ogham/exa",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37416430",
    "commentBody": "",
    "originSummary": [
      "एक्सा प्रोजेक्ट एक ओपन-सोर्स टूल है जिसे \"एलएस\" कमांड के समकालीन विकल्प के रूप में डिज़ाइन किया गया है, जो अतिरिक्त सुविधाओं और बेहतर डिफ़ॉल्ट की पेशकश करता है।",
      "यह उपकरण फ़ाइल प्रकारों को अलग करने के लिए रंग कोडिंग का उपयोग करता है और सिमलिंक (प्रतीकात्मक लिंक), विस्तारित विशेषताओं और गिट, एक वितरित संस्करण नियंत्रण प्रणाली के बारे में अच्छी तरह से सूचित है।",
      "एक्सा टूल को इसके छोटे आकार, उच्च गति और मैकओएस और लिनक्स सिस्टम के साथ संगतता की विशेषता है; पोस्ट में पोर्टेबल वर्चुअल सॉफ्टवेयर विकास वातावरण के निर्माण और रखरखाव के लिए एक उपकरण, वाग्रांट का उपयोग करके उपकरण को विकसित करने और परीक्षण करने की स्थापना प्रक्रियाओं और विधियों के बारे में जानकारी शामिल है।"
    ],
    "commentSummary": [
      "उपयोगकर्ता विभिन्न कमांड-लाइन उपयोगिताओं के बारे में बातचीत कर रहे हैं, मुख्य रूप से \"एलएस\" कमांड और इसके विकल्पों जैसे \"एक्सा\" और \"एलएसडी\" पर ध्यान केंद्रित कर रहे हैं, उनकी ताकत और कमजोरियों पर बहस कर रहे हैं।",
      "बातचीत अपनी स्थिति को व्यक्त करने, फोर्क्स के लिए संभावनाओं की खोज करने और सॉफ्टवेयर में फिर से लिखने में ओपन-सोर्स डेवलपर्स के महत्व की ओर भी बढ़ती है।",
      "वे सॉफ्टवेयर विकास में स्थिरता और नवाचार के बीच संतुलन में भी शामिल हैं, जो इसमें शामिल ट्रेड-ऑफ को दर्शाते हैं।"
    ],
    "points": 214,
    "commentCount": 178,
    "retryCount": 0,
    "time": 1694077580
  }
]
