[
  {
    "id": 39304736,
    "title": "FCC Robocall'larda Yapay Zeka Seslerini Yasakladı",
    "originLink": "https://www.fcc.gov/document/fcc-makes-ai-generated-voices-robocalls-illegal",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39304736",
    "commentBody": "",
    "originSummary": [
      "FCC, robocall'larda yapay zeka tarafından üretilen seslerin kullanılmasının TCPA kapsamında yasa dışı olduğunu ilan etti.",
      "Bu karar, FCC tarafından robocall ve dolandırıcılık mesajlarında kullanılan derin sahte ses ve video teknolojisini ele almak üzere oybirliğiyle kabul edildi.",
      "Karar, tüketicileri dolandırıcılık faaliyetlerinden korumak amacıyla yapay seslerin kullanımıyla mücadele etmeyi amaçlıyor."
    ],
    "commentSummary": [
      "Robocall'larda yapay zeka tarafından üretilen seslerin yasallığı, düzenleme lehinde ve aleyhinde argümanlarla tartışılıyor.",
      "Chevron Deference ilkesi, robocall'lardaki yapay zeka sesleri ile ilgili olarak inceleme altındadır.",
      "Daha geniş kapsamlı tartışma, idari kurumlar ile yasama organı arasındaki güç dengesini, yeni teknolojilerin düzenlenmesinde karşılaşılan zorlukları ve tartışmalı konularda fikir birliği sağlanamamasını içermektedir."
    ],
    "points": 1013,
    "commentCount": 594,
    "retryCount": 0,
    "time": 1707413084
  },
  {
    "id": 39302744,
    "title": "Mozilla Veri Gizliliğine Yönelirken Yeni CEO'sunu Atadı",
    "originLink": "https://fortune.com/2024/02/08/mozilla-firefox-ceo-laura-chambers-mitchell-baker-leadership-transition/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39302744",
    "commentBody": "",
    "originSummary": [
      "Mozilla Corp. CEO Mitchell Baker'ın yapay zeka ve internet güvenliğine odaklanmak üzere görevinden ayrılmasıyla birlikte liderlikte bir değişiklik olduğunu duyurdu.",
      "Airbnb ve PayPal gibi şirketlerde deneyimi olan Mozilla yönetim kurulu üyesi Laura Chambers, geçici CEO olarak görev yapacak.",
      "Bu hamle, Mozilla'nın büyük teknoloji ve yapay zekanın ortaya çıkardığı gizlilik endişelerini ve zorluklarını ele almayı hedeflediği ve aynı zamanda kullanıcı verilerinin kontrolüne öncelik veren ve mevcut iş modellerine alternatifler sunan ürünler ve politikalar geliştirmeye odaklandığı bir dönemde geldi."
    ],
    "commentSummary": [
      "Mozilla, veri gizliliğine odaklanan yeni bir CEO atayarak liderlik ve şirketin daralan pazar payı hakkında tartışmalara yol açtı.",
      "Eski CEO'nun yüksek maaşı ve Mozilla'nın Google Chrome ile rekabette karşılaştığı zorluklarla ilgili tartışmalar var.",
      "Tartışılan diğer konular arasında yönetici tazminatı, FirefoxOS'un başarısızlığı ve kullanıcıları Firefox tarayıcısına çekme stratejileri yer alıyor."
    ],
    "points": 729,
    "commentCount": 600,
    "retryCount": 0,
    "time": 1707404807
  },
  {
    "id": 39301495,
    "title": "Gemini Kodlama ve Yaratıcılık için Mobil Uygulama ve Gelişmiş Yapay Zeka Modelini Piyasaya Sürüyor",
    "originLink": "https://blog.google/products/gemini/bard-gemini-advanced-app/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39301495",
    "commentBody": "",
    "originSummary": [
      "Daha önce Bard olarak bilinen Gemini, bir mobil uygulama ve Gemini Advanced with Ultra 1.0'ı yayınladı.",
      "Gemini Advanced, kullanıcılara kodlama, mantıksal akıl yürütme ve yaratıcı projeler gibi görevler için gelişmiş yapay zeka modeli Ultra 1.0'a erişim sağlar.",
      "Gemini Advanced deneyimi 150'den fazla ülkede kullanılabilir ve gelecekte daha fazla dil ve konum eklenecektir. Google One AI Premium Planının bir parçası olan ve aylık 19,99 ABD doları fiyatla sunulan Gemini Advanced, kişiselleştirilmiş özel ders, kodlama yardımı ve içerik üretimi sunuyor. Kullanıcılar Android ve iOS cihazlarında işbirliği yapabilir ve yardım isteyebilir."
    ],
    "commentSummary": [
      "Google, dil modeli \"Bard \"ı \"Gemini\" olarak yeniden adlandırdı ve bir mobil uygulama ile Gemini Advanced'i piyasaya sürdü.",
      "İsim değişikliği kararı karışık tepkilere yol açtı; bazı kullanıcılar Bard'ın konuşmayla ilişkilendirilmesini tercih ederken, diğerleri Gemini'yi uzay araştırmalarıyla olan bağlantıları nedeniyle daha uygun buldu.",
      "Tartışmada ayrıca ürün adlarının önemi, kullanıcı algıları, Gemini'nin yetenekleri, olası yanlış yorumlama veya kafa karışıklığına ilişkin endişeler, Google'ın yapay zeka yarışındaki konumu, yeteneklerin elde tutulması ve yapay zeka modellerinin dili anlama ve doğru yanıtlar verme konusundaki sınırlamaları da ele alındı."
    ],
    "points": 541,
    "commentCount": 982,
    "retryCount": 0,
    "time": 1707397657
  },
  {
    "id": 39300317,
    "title": "VirtualBox, Cyberus Technology'nin açık kaynak sürümüyle artık KVM hipervizörünü destekliyor",
    "originLink": "https://cyberus-technology.de/articles/vbox-kvm-public-release",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39300317",
    "commentBody": "",
    "originSummary": [
      "Cyberus Technology, VirtualBox için açık kaynaklı bir KVM arka ucu geliştirerek sanal makine monitörünün tescilli çekirdek modülü yerine Linux KVM hipervizörü üzerinde çalışmasını sağladı.",
      "Bu sürüm, kullanıcılara VirtualBox'ı KVM hiper yöneticisi üzerinde çalıştırmak için alternatif bir seçenek sunarak performansı ve uyumluluğu potansiyel olarak artırır.",
      "Arka ucun açık kaynak niteliği, geliştiricilerin VirtualBox'ın KVM ile entegrasyonuna katkıda bulunmaları, geliştirmeleri ve özelleştirmeleri için fırsatlar sunar."
    ],
    "commentSummary": [
      "Konuşmada VirtualBox için açık kaynaklı bir KVM arka ucunun piyasaya sürülmesi ve sanallaştırma yazılımı seçeneklerinin artırılması ele alınıyor.",
      "Kullanıcılar VirtualBox'ı performans, kullanım kolaylığı ve uyumluluk gibi faktörleri göz önünde bulundurarak diğer sanal makine seçenekleriyle karşılaştırmaktadır.",
      "Konular arasında sanallaştırma için GUI seçenekleriyle ilgili hayal kırıklıkları, GPU geçişi, virt-manager ve UML ve KVM gibi farklı sanallaştırma teknolojileri hakkında tartışmaların yanı sıra güvenlik özellikleri, lisans sorunları ve gelecekteki potansiyel gelişmelerden bahsediliyor."
    ],
    "points": 496,
    "commentCount": 188,
    "retryCount": 0,
    "time": 1707387625
  },
  {
    "id": 39307330,
    "title": "Ollama OpenAI Sohbet Tamamlama API'si ile Uyumluluk Ekliyor, Daha Fazla Aracın Yerel Kullanımını Sağlıyor",
    "originLink": "https://ollama.ai/blog/openai-compatibility",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39307330",
    "commentBody": "",
    "originSummary": [
      "Ollama platformu artık OpenAI Sohbet Tamamlama API'si ile uyumludur ve yerel olarak daha fazla araç ve uygulama ile çalışmak için yeteneklerini genişletmektedir.",
      "Kullanıcılar platformu indirip bir model çekerek Ollama'yı kurabilir, ardından cURL veya OpenAI Python veya JavaScript kütüphaneleri aracılığıyla API'ye erişebilirler.",
      "Entegrasyon örnekleri, Ollama'nın Vercel AI SDK ve Autogen dahil olmak üzere diğer kütüphanelerle nasıl kullanılabileceğini gösteriyor ve OpenAI uyumluluğu için gelecekteki geliştirmelerden bahsediyor."
    ],
    "commentSummary": [
      "Tartışma, Ollama, Deepseek Coder 33B ve Gemini Pro ve Ultra gibi modeller de dahil olmak üzere OpenAI dil modelleri etrafında dönüyor.",
      "Kullanıcılar bu modellerin performansı, uyumluluğu, kullanım kolaylığı ve güvenliği ile ilgili deneyimlerini, endişelerini ve tercihlerini paylaşmaktadır.",
      "Konuşmada ayrıca OpenAI API, daha net spesifikasyon ve dokümantasyon ihtiyacı, ortak bir API standardı, Langchain ve huggingface transformers gibi araç ve kütüphaneler ile yazılım dağıtımı, fiyatlandırma ve dağıtım çerçeveleri hakkındaki tartışmalar gibi konulara da değinildi."
    ],
    "points": 478,
    "commentCount": 140,
    "retryCount": 0,
    "time": 1707424568
  },
  {
    "id": 39300679,
    "title": "Google Kullanıcılar için Kullanışlı Oturum Açma Seçenekleri ve Dil Seçenekleri Sunuyor",
    "originLink": "https://one.google.com/explore-plan/gemini-advanced",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39300679",
    "commentBody": "",
    "originSummary": [
      "Metin, mevcut bir Google Hesabında oturum açmak ve yeni bir hesap oluşturmak için seçenekler sunar.",
      "Kullanıcıların aralarından seçim yapabileceği bir dil seçenekleri listesi sunar.",
      "Google'ın politikaları ve yönergeleri hakkında destek ve bilgilere erişim sağlayan yardım, gizlilik ve şartlar için bağlantılar mevcuttur."
    ],
    "commentSummary": [
      "Gemini Ultra'nın piyasaya sürülmesi teknoloji meraklıları arasında önemli miktarda tartışma yarattı.",
      "Kullanıcılar, Gemini Ultra hakkındaki sohbete katılmak için verilen bağlantıyı ziyaret etmeye teşvik edilmektedir.",
      "Kullanıcıların Gemini ve ChatGPT'yi aynı anda kullanmalarına olanak tanıyan ve benzersiz bir deneyim sunan bir web sitesinden bahsediliyor.",
      "Gemini Ultra'nın markalaşmasına ilişkin bir yorum yapılmış, ancak daha fazla ayrıntı verilmemiştir."
    ],
    "points": 421,
    "commentCount": 4,
    "retryCount": 0,
    "time": 1707391264
  },
  {
    "id": 39305994,
    "title": "Yanlışlıkla Yapılan Blender VSE Optimizasyonu Büyük İyileştirmelere Yol Açtı",
    "originLink": "https://aras-p.info/blog/2024/02/06/I-accidentally-Blender-VSE/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39305994",
    "commentBody": "",
    "originSummary": [
      "Yazar istemeden Blender'ın Video Sekans Düzenleyicisi (VSE) üzerinde çalıştı ve bir sonraki sürüme dahil edilecek çok sayıda performans iyileştirmesi yaptı.",
      "Görüntü düzenleyici vektör kapsamı tasarımını geliştirdiler, RGB↔YUV dönüşümü için çoklu iş parçacığı uyguladılar ve ses yeniden örnekleme ile ilgili sorunları çözdüler.",
      "Ayrıca, görüntü ölçeklendirme için yeni filtreleme seçenekleri eklediler ve VSE'deki çeşitli efektleri optimize ettiler. Alana ve kod tabanına yabancı olmalarına rağmen, geliştirici sadece iki aylık yarı zamanlı çalışmada önemli ilerleme kaydetti ve gelecekte Blender'a katkıda bulunmaya devam etmeyi planlıyorlar."
    ],
    "commentSummary": [
      "Yazar, ücretsiz projelerde ücretli projelere kıyasla daha üretken olma deneyimlerini paylaşarak, ücret ve kârın iş için tek motivasyon olduğu inancını sorguluyor.",
      "Çalışma kavramı ve keyif almanın işten veya oyundan ayrılması tartışılmakta, kişinin işinde motivasyon bulmasının önemi vurgulanmaktadır.",
      "Yazılım geliştirmenin etkisi, ücretli iş ile etkili iş arasındaki seçim ve iOS için daha iyi bir müzik çalar uygulaması oluşturmada yapay zeka yardımı potansiyelinden de bahsediliyor."
    ],
    "points": 385,
    "commentCount": 56,
    "retryCount": 0,
    "time": 1707418624
  },
  {
    "id": 39305452,
    "title": "Microsoft, Windows 11 Insider Önizleme Derlemesinde Windows için Sudo'yu Tanıttı",
    "originLink": "https://devblogs.microsoft.com/commandline/introducing-sudo-for-windows/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39305452",
    "commentBody": "",
    "originSummary": [
      "Microsoft, Windows 11 Insider Preview Build 26052'de Windows için Sudo'yu tanıtarak kullanıcıların yükseltilmemiş bir konsol oturumundan yükseltilmiş komutları çalıştırmasına olanak tanıdı.",
      "Windows için Sudo, GitHub'da açık kaynaklı bir projedir ve yeni bir yükseltilmiş konsol açmadan bir komutu yükseltmek isteyen kullanıcılar için ergonomik bir çözüm sunar.",
      "Windows için Sudo'nun mevcut sürümü üç yapılandırma seçeneğini destekler ve yükseltme için bir UAC iletişim kutusu aracılığıyla kullanıcı onayı gerektirir. Microsoft gelecekte belgeleri genişletmeyi ve projenin güvenlik etkileri ve açık kaynak planları hakkında daha fazla bilgi paylaşmayı planlıyor."
    ],
    "commentSummary": [
      "Tartışma, Windows için Sudo'nun tanıtımı ve etkili çözümler için ekiplerin entegrasyonu gibi Windows ile ilgili çeşitli konulara değiniyor.",
      "\"sudo\" adının kullanımı ve karışıklık yaratma potansiyeli konusunda endişeler dile getirilmektedir.",
      "GUI geliştirme için PowerShell'in yetenekleri, Windows geliştirici deneyimi ile ilgili hayal kırıklıkları ve güvenlik önlemleri ve yazılım dağıtımı ile ilgili zorluklar da tartışılmaktadır."
    ],
    "points": 374,
    "commentCount": 300,
    "retryCount": 0,
    "time": 1707416165
  },
  {
    "id": 39308679,
    "title": "Sony Funimation'ın Abonelerin Dijital Kütüphanelerini Silmesi Hayal Kırıklığı Yarattı",
    "originLink": "https://arstechnica.com/culture/2024/02/funimation-dvds-included-forever-available-digital-copies-forever-ends-april-2/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39308679",
    "commentBody": "",
    "originSummary": [
      "Sony'nin sahibi olduğu anime yayın hizmeti Funimation, Crunchyroll ile birleşmesi nedeniyle 2 Nisan'dan sonra abonelerin dijital kütüphanelerine erişimi durduracak.",
      "Abonelere başlangıçta satın aldıkları film ve dizileri süresiz olarak izlemeye devam edebilecekleri söylenmişti, ancak birleşme bu dijital kopyalar için desteğin kaybedilmesiyle sonuçlandı.",
      "Müşteriler, yayın erişiminin kaybedileceğini bilselerdi satın almayacakları DVD veya Blu-ray gibi fiziksel kopyalar için geri ödemeden söz edilmediği için hayal kırıklığına uğradılar."
    ],
    "commentSummary": [
      "Sony'nin dijital kütüphaneleri silmesi tepki çekerken, bu durum tüketici korumaları, DRM ve dijital içerik sağlayıcıların sorumlulukları ile ilgili bir tartışmanın fitilini ateşledi.",
      "Kullanıcılar asgari satın alma süreleri, sigorta veya emanet sistemleri uygulamak ve erişimi telif hakkı korumasına bağlamak gibi çözümler önermektedir.",
      "Tartışmada ayrıca yanıltıcı reklam, dijital medya sahipliği, fiziksel ve dijital medya arasındaki dayanıklılık karşılaştırması ve akış hizmetlerinden medya kopyalamanın veya indirmenin yasallığı gibi konular da ele alınıyor.",
      "Korsanlığın etkisi ve etiği ile ilgili tartışmaların yanı sıra şirketlerin ticari işlemler yoluyla verdikleri sözleri tutmamaları ve yükümlülüklerini devretmelerine ilişkin endişeler de devam etmektedir.",
      "Genel olarak, konuşma DRM kısıtlamaları, yayın hizmetlerinin sınırlamaları ve daha güçlü tüketici koruma önlemlerine duyulan ihtiyaçla ilgili hayal kırıklıklarına ışık tutuyor."
    ],
    "points": 369,
    "commentCount": 211,
    "retryCount": 0,
    "time": 1707431402
  },
  {
    "id": 39303160,
    "title": "Dağıtık Sistemler: Teori, Modeller ve Hata Tespitini Kapsayan Kapsamlı Bir Okuma Listesi",
    "originLink": "https://ferd.ca/a-distributed-systems-reading-list.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39303160",
    "commentBody": "",
    "originSummary": [
      "Bu belge, konuyla ilgili arka plan bilgisi ve kaynaklar sağlayan bir dağıtık sistemler okuma listesidir.",
      "Temel teoriyi, dağıtık sistem teorisinde kullanılan farklı modelleri ve teorik hata modlarını kapsar.",
      "Dağıtık sistemlerde hata tespitinin önemi, CAP teoremi, mesaj geçişi, sıralama ve farklı tutarlılık modelleri tartışılmaktadır."
    ],
    "commentSummary": [
      "Katılımcılar, Roberto Vitillo, Martin Kleppmann ve Leslie Lamport'un çalışmaları da dahil olmak üzere dağıtık sistemlerle uygulamalı deneyim kazanmak için önerilen kitapları ve kaynakları tartışırlar.",
      "Projeler tasarlamak, sanal makineler veya eski donanımları kullanmak ve çerçeveleri ve uygulamaları keşfetmek gibi önerilerle pratik deneyimin önemli olduğu vurgulanmaktadır.",
      "Daha fazla bilgi için MIT'nin Dağıtık Sistemler kursu ve diğer kaynaklar önerilmektedir, ancak dağıtık işlemler hakkında özel bir kitap önerisi bulunmamaktadır."
    ],
    "points": 299,
    "commentCount": 56,
    "retryCount": 0,
    "time": 1707406698
  },
  {
    "id": 39301830,
    "title": "Hollanda Polisi istihbarat servisleri, gizlilik yasalarını ihlal ederek topluluk gruplarını hukuka aykırı bir şekilde gözetledi",
    "originLink": "https://nltimes.nl/2024/02/08/police-intelligence-services-unlawfully-spied-whole-population-groups",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39301830",
    "commentBody": "",
    "originSummary": [
      "Hollanda'daki İstihbarat ve Güvenlik Hizmetleri Denetleme Komitesi (CTIVD), polis istihbarat servislerinin üç olayda tüm toplum gruplarını yasadışı olarak izlediğini tespit etmiştir.",
      "Soruşturmalar, mahremiyetin ihlal edilmesi nedeniyle Hollanda yasalarını ihlal etmiş ve istihbarat servisleri bu kadar geniş kapsamlı soruşturmalara duyulan ihtiyacı gerektiği gibi gerekçelendirmemiştir.",
      "Hedef alınan topluluklar belirtilmemiştir, ancak etnik köken, dini inanç veya meslek grubu gibi faktörlere dayanıyor olabilirler. Parlamento üyeleri tarafından istihbarat ve güvenlik servislerinin daha iyi denetlenmesi için çağrılar yapılmıştır."
    ],
    "commentSummary": [
      "Tartışma, polis gözetimi, faşizm, yolsuzluk ve belirli toplulukların gözetimi gibi bir dizi konuyu kapsamaktadır.",
      "Katılımcılar protestolar, tarımsal sübvansiyonlar ve gizlilik ile güvenlik arasındaki denge ile ilgili konuları tartışıyor.",
      "Konuşmada doğru bilginin önemi, medyanın rolü ve merkezi veri depolamanın potansiyel riskleri vurgulanıyor."
    ],
    "points": 278,
    "commentCount": 220,
    "retryCount": 0,
    "time": 1707399942
  },
  {
    "id": 39308731,
    "title": "Kanada Hükümeti Cihaz Yasağı ile Oto Hırsızlığı ile Mücadeleye Yatırım Yapıyor",
    "originLink": "https://www.canada.ca/en/public-safety-canada/news/2024/02/federal-action-on-combatting-auto-theft.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39308731",
    "commentBody": "",
    "originSummary": [
      "Kanada Hükümeti, otomobil hırsızlığını ele almak ve sınır güvenliğini artırmak için federal düzeyde harekete geçiyor.",
      "Kanada Sınır Hizmetleri Ajansı (CBSA), oto hırsızlığını araştırma ve bununla mücadele etme kapasitesini geliştirmek için 28 milyon dolar yatırım yapacak.",
      "Kanada Kraliyet Atlı Polisi (RCMP), Kanada Adalet Bakanlığı, Kanada Ulaştırma Bakanlığı ve Kanada İnovasyon, Bilim ve Ekonomik Kalkınma (ISED) dahil olmak üzere çeşitli devlet daireleri, yasal çerçeveyi güçlendirmek, araç güvenlik standartlarını modernize etmek ve oto hırsızlığını önlemeye yönelik çözümler geliştirmek için işbirliği yapmaktadır."
    ],
    "commentSummary": [
      "Söyleşide Flipper Zero cihazının Kanada'da yasaklanması, doğrudan demokrasinin etkinliği ve araç anahtarı şifrelemesindeki güvenlik açıkları gibi çeşitli konular ele alınıyor.",
      "Belirli cihazların yasaklanması ve bunun araç hırsızlığı ve suç üzerindeki potansiyel etkisi konusunda farklı görüşler bulunmaktadır.",
      "Sohbet aynı zamanda hükümet düzenlemeleri, ekonomi ve göç gibi ilgisiz konulara da değinmekte ve genel olarak düzenlemelerin etkinliği, hükümetin rolü ve bunların bireyler ve toplum üzerindeki etkilerine odaklanmaktadır."
    ],
    "points": 231,
    "commentCount": 209,
    "retryCount": 0,
    "time": 1707431700
  },
  {
    "id": 39307677,
    "title": "Kapı Aralığı Etkisi: Mekanlar Arasında Hareket Etmek Nasıl Hafıza Kaybına Neden Olur?",
    "originLink": "https://en.wikipedia.org/wiki/Doorway_effect",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39307677",
    "commentBody": "",
    "originSummary": [
      "\"Kapı aralığı etkisi\", mekanlar arasında geçiş yaparken veya kapı aralıklarından geçerken hafıza kaybının meydana geldiği psikolojik bir olgudur.",
      "Beynin farklı ortamlar için ayrı hafıza modelleri oluşturmasından kaynaklanır.",
      "Kapı aralıkları olay sınırları olarak hareket eder ve hafızada tutmayı etkileyerek yanlış anıların artmasına yol açar, ancak unutma üzerinde hiçbir etkisi yoktur."
    ],
    "commentSummary": [
      "Kapı Aralığı Etkisi, insanların yeni bir odaya girdiklerinde sıklıkla amaçlarını unuttukları bir olgudur ve Reddit'te kişisel deneyimler ve değişen ortamların neden olduğu dikkat dağınıklığının üstesinden gelme stratejileri hakkında tartışmalara yol açmıştır.",
      "Reddit'teki sohbet, bağlama bağlı hafıza hatırlama, mekânsal mevcudiyet, hafıza ilişkilendirmeleri ve görme engelli bireylerin deneyimleri gibi ilgili konuları kapsıyor.",
      "Bazı yorumlar, psikolojik çalışmaların geçerliliğine ilişkin kuşkuları dile getirmekte ve titiz deneysel tasarım ve tekrarlamanın önemini vurgulamaktadır."
    ],
    "points": 205,
    "commentCount": 87,
    "retryCount": 0,
    "time": 1707426299
  }
]
