[
  {
    "title": "Apple's Project Alaska: A Look at the Next-Gen Vision Pro Headset",
    "originLink": "https://www.macrumors.com/2023/11/10/project-alaska-second-generation-vision-pro/",
    "originBody": "",
    "originSummary": [
      "Apple is developing a next-generation AR/VR headset called Project Alaska, resembling the first-generation Vision Pro, but with changes in speaker placement and rear straps.",
      "Rumors suggest the headset may include additional features like an audio accessory and an external battery pack.",
      "The hardware will feature micro-OLED displays, cameras, sensors, and multiple connectivity options. The product validation testing is scheduled for 2025, with a potential release in late 2025 or early 2026, although these details are subject to change."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699709331364
  },
  {
    "title": "Apple Introduces Spatial Video Camera on iPhone 15 Pro, Offers Immersive 3D Experience with Vision Pro Headset",
    "originLink": "https://www.cnet.com/tech/mobile/apple-iphone-spatial-video-arrives-in-beta-and-looks-amazing-on-vision-pro/",
    "originBody": "",
    "originSummary": [
      "Apple has introduced a new spatial video camera feature on the iPhone 15 Pro that allows users to record 3D videos.",
      "The videos can be watched in 3D on the Vision Pro headset, providing an immersive experience.",
      "However, the feature requires both the iPhone 15 Pro and the Vision Pro headset, making it inaccessible to most people."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699709331364
  },
  {
    "title": "Apple Introduces Spatial Video Recording with iOS 17.2 Beta 2",
    "originLink": "https://www.gsmarena.com/apple_enables_spatial_video_recording_with_ios_172_beta_2_-news-60553.php",
    "originBody": "",
    "originSummary": [
      "Apple has launched iOS 17.2 beta 2, incorporating spatial video recording capability for the iPhone 15 Pro and 15 Pro Max.",
      "This feature permits users to capture spatial videos that can be viewed on the forthcoming Apple Vision Pro headset.",
      "While the recorded videos are in 1080p resolution at 30 fps and can be accessed through the camera settings, there are concerns about potential performance issues on older devices."
    ],
    "commentBody": "",
    "commentSummary": [
      "The information needed to complete the summary is missing"
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699709331364
  },
  {
    "title": "Apple's Vision Pro headset gains killer app with new Spatial Video feature",
    "originLink": "https://www.laptopmag.com/gaming/vr/apples-vision-pro-headset-just-found-its-killer-app",
    "originBody": "",
    "originSummary": [
      "Apple's Vision Pro spatial computer, priced at $3,500, has introduced a new feature called Spatial Video in its iOS 17.2 public beta.",
      "Spatial Video allows users to capture 3D video using the iPhone 15 Pro or Pro Max, which is then stitched together using computational algorithms.",
      "Lance Ulanoff, TechRadar's U.S. Editor in Chief, praised the results of the demo and believes spatial video could make the Vision Pro headset stand out from other VR headsets on the market.",
      "However, the high price of the Vision Pro and the need to purchase an iPhone 15 Pro or Pro Max may deter some potential buyers."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699709331364
  },
  {
    "title": "How to Shoot and View 3D Videos on Apple Vision Pro with iPhone 15 Pro and 15 Pro Max",
    "originLink": "https://lifehacker.com/you-can-already-record-apple-vision-pro-videos-on-your-1851011585",
    "originBody": "",
    "originSummary": [
      "Apple's upcoming mixed reality headset, the Vision Pro, is expected to launch in early 2024.",
      "iPhone 15 Pro and 15 Pro Max users running iOS 17.2 beta can already shoot three-dimensional videos specifically designed for the Vision Pro headset.",
      "These spatial videos combine the Ultra Wide and main cameras of the iPhone to record 3D content, viewable only on the Vision Pro headset."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699709331364
  },
  {
    "title": "Apple Demonstrates Spatial Video on iPhone for Apple Vision Pro, Set for Early 2024 Release",
    "originLink": "https://appleinsider.com/articles/23/11/10/spatial-video-shot-on-iphone-for-apple-vision-pro-previewed-for-a-select-few",
    "originBody": "",
    "originSummary": [
      "Apple has unveiled its Apple Vision Pro video features, including Spatial Video recording on iPhone.",
      "Users who tested out the feature were impressed with the 3D videos but desired higher resolution and editing options.",
      "TechRadar speculates that Spatial Video could be the standout feature for the upcoming Vision Pro headset, set to be released in early 2024."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699709331364
  },
  {
    "title": "Apple's new spatial video feature on the iPhone 15 Pro is a game-changer for 3D video shooting and viewing. However, limited accessibility due to the high cost of the upcoming Vision Pro mixed reality headset may hinder its widespread use.",
    "originLink": "https://www.techradar.com/computing/virtual-reality-augmented-reality/i-tried-the-iphone-15s-new-spatial-video-feature-and-it-will-be-the-vision-pros-killer-app",
    "originBody": "",
    "originSummary": [
      "The iPhone 15 Pro now has a spatial video feature that lets users shoot and watch 3D videos, which are compatible with Apple's upcoming Vision Pro mixed reality headset.",
      "These videos can be viewed on the iPhone's Photos app and create a sense of depth with a 3D effect.",
      "The high cost of the Vision Pro headset might make it less accessible for some users to fully enjoy these spatial videos."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699709331364
  },
  {
    "title": "Impressive Review of Apple Vision Pro Spatial Video on iPhone 15 Pro and Future Headset Release",
    "originLink": "https://www.thestreet.com/deals/apple-vision-pro-spatial-video-first-look-iphone-15-pro",
    "originBody": "",
    "originSummary": [
      "The article discusses the author's experience with Apple Vision Pro Spatial Video on the iPhone 15 Pro, which enables users to capture immersive videos.",
      "It mentions the upcoming release of the Apple Vision Pro headset in 2024 and highlights that the Spatial Video feature is included on the iPhone 15 Pro without additional charges.",
      "The article also provides information about ad units and bidding parameters on different advertising platforms."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699709331364
  },
  {
    "title": "Apple Releases iOS 17.2 Beta Allowing iPhone 15 Pro Users to Capture Spatial Videos for Apple Vision Pro",
    "originLink": "https://www.inverse.com/tech/spatial-video-recording-iphone-15-pro-hands-on-vision-pro",
    "originBody": "",
    "originSummary": [
      "Apple has released a beta version of iOS 17.2, introducing spatial video capture for iPhone 15 Pro and 15 Pro Max users.",
      "Spatial videos can be viewed using the upcoming Apple Vision Pro, offering a 3D viewing experience.",
      "The feature is exclusive to the iPhone 15 Pro models due to the alignment of their lenses, but limitations include a 1080p resolution and locked zoom. Users are urged to start recording spatial videos in preparation for the release of the Apple Vision Pro."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699709331364
  }
]
