[
  {
    "id": 37661446,
    "title": "FTC žaluje Amazon za nezákonné udržování monopolního postavení",
    "originLink": "https://www.ftc.gov/news-events/news/press-releases/2023/09/ftc-sues-amazon-illegally-maintaining-monopoly-power",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37661446",
    "commentBody": "",
    "originSummary": [
      "Federální obchodní komise (FTC) a 17 státních zastupitelství podalo žalobu na společnost Amazon s tím, že si nezákonně udržuje monopolní postavení.",
      "Společnost Amazon je obviňována z vylučovacího chování, které potlačuje hospodářskou soutěž, zvyšuje ceny, snižuje kvalitu a brání inovacím, což je považováno za škodlivé pro spotřebitele i podniky.",
      "FTC a její státní partneři usilují o vydání trvalého soudního příkazu, který by zastavil údajné nezákonné aktivity společnosti Amazon a obnovil hospodářskou soutěž na trhu."
    ],
    "commentSummary": [
      "Federální komise pro obchod (FTC) zažalovala společnost Amazon s tím, že má nelegální monopolní postavení, které brání malým podnikům a omezuje jejich možnosti prodávat na jiných platformách.",
      "Kritika vznesená vůči Amazonu se týká zvyšování cen pro prodejce služby Fulfilment by Amazon (FBA), nucení prodejců k využívání reklamních služeb a nedostatečných opatření proti padělaným výrobkům.",
      "Žaloba vyvolala debaty o důsledcích dvojí role Amazonu jako platformy a konkurenta na trhu, o problémech, kterým čelí podniky využívající Amazon, a o vlivu změn společnosti Apple v oblasti ochrany osobních údajů na reklamu."
    ],
    "points": 1086,
    "commentCount": 805,
    "retryCount": 0,
    "time": 1695744640
  },
  {
    "id": 37667266,
    "title": "Ekosystém Philips Hue se hroutí",
    "originLink": "https://rachelbythebay.com/w/2023/09/26/hue/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37667266",
    "commentBody": "",
    "originSummary": [
      "Autor předkládá obavy týkající se ekosystému Philips Hue a zaměřuje se na nedávná rozhodnutí vedení společnosti, která zvýšila nespokojenost uživatelů.",
      "Společnost Philips prosadila novou licenční smlouvu s koncovým uživatelem a nyní vyžaduje přihlášení uživatelů, kteří potřebují integraci s cloudem, což by mohlo potenciálně zhoršit funkčnost systému.",
      "Jako možné řešení je zmíněno použití rozbočovače Ikea Dirigera, i když se neuvádí jako bezpečné řešení. Autor doufá, že v budoucnu bude vyvinuta lepší alternativa."
    ],
    "commentSummary": [
      "Příspěvek se zaměřuje na smíšené názory na ekosystém Philips Hue a širší domácí automatizaci a zdůrazňuje frustraci uživatelů ze změn systému, vnímání nedostatku loajality ze strany výrobců a povinného vytváření účtů.",
      "Jsou nastoleny otázky jasu, spolehlivosti, kompatibility a dohod s uživateli. Někteří uživatelé se obracejí k alternativním chytrým žárovkám a rozbočovačům nebo si budují vlastní domácí infrastrukturu, aby tyto problémy překonali.",
      "Dotýká se také pozitivnějších aspektů domácí automatizace, jako jsou výhody automatického osvětlení a přizpůsobení. Autor se dělí o své zkušenosti s používáním protokolu Zigbee2MQTT a vyvrací tvrzení, že je Home Assistant nezabezpečený. Je zde obecně uznán potenciál i problémy této technologické oblasti."
    ],
    "points": 882,
    "commentCount": 661,
    "retryCount": 0,
    "time": 1695770535
  },
  {
    "id": 37663270,
    "title": "Editor her podobný Unity běžící v čistém WASMu",
    "originLink": "https://raverie-us.github.io/raverie-engine/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37663270",
    "commentBody": "",
    "originSummary": [
      "Engine Raverie je vyvíjen jako alternativa ke hře Unity a využívá návrh založený na komponentách podobně jako Unity, ale s jedinečnými funkcemi, jako jsou samostatné světy/úrovně a konfigurovatelné osvětlení a vykreslovací engine.",
      "Engine je vytvořen pro WebAssembly bez použití Emscriptenu, což usnadňuje budoucí portování na jiné platformy.",
      "Tvůrci mají plán, který zahrnuje integraci zvukového enginu s WebAudio, vylepšení debuggeru skriptů a přidání síťových funkcí pomocí WebRTC a WebSockets s cílem vytvořit online centrum pro sdílení a remixování her."
    ],
    "commentSummary": [
      "Engine Raverie, vytvořený Technologickým institutem DigiPen, je inovativní herní editor, který funguje na WebAssembly a obsahuje diskrétní světy/úrovně, skriptovatelný osvětlovací a vykreslovací engine a fyzikální mechanismus.",
      "Autor vyjadřuje obavy z přílišné závislosti na snadno dostupných herních enginech a vychází přitom ze svých zkušeností ze společnosti DigiPen.",
      "Uživatelé si pochvalují editační schopnosti enginu Raverie, ale vyjadřují obavy z problémů s výkonem, což vede k diskusím o použití WebAssembly a možných vylepšeních."
    ],
    "points": 610,
    "commentCount": 136,
    "retryCount": 0,
    "time": 1695751127
  },
  {
    "id": 37663725,
    "title": "EU nařizuje společnosti Apple, aby vše zpřístupnila svým konkurentům",
    "originLink": "https://appleinsider.com/articles/23/09/26/eu-tells-apple-to-open-everything-up-to-its-rivals",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37663725",
    "commentBody": "",
    "originSummary": [
      "Evropská unie (EU) tlačí na Apple, aby zpřístupnil svůj hardwarový a softwarový ekosystém konkurenčním společnostem.",
      "Komisař EU Thierry Breton vybízí společnost Apple, aby v souladu se zákonem o digitálních trzích umožnila konkurenci nabízet na iPhonech služby, jako jsou elektronické peněženky, prohlížeče a obchody s aplikacemi.",
      "Cílem zákona je zajistit rovné podmínky pro všechny technologické společnosti. Generální ředitel společnosti Apple Tim Cook se s Bretonem setkal, ale k situaci se zatím nevyjádřil."
    ],
    "commentSummary": [
      "Evropská unie naléhá na společnost Apple, aby zvýšila konkurenci ve svém operačním systému a obchodě s aplikacemi, protože má obavy z kontroly společnosti Apple nad svým ekosystémem a z omezených alternativ pro uživatele.",
      "Diskutuje se o dominantním postavení společnosti Google na trhu s prohlížeči Chrome a o potenciálním monopolu společností, jako je Meta.",
      "Argumenty se točí kolem potřeby svobody uživatelů versus bezpečnosti uzavřených ekosystémů a probíhající debaty o ochraně uživatelů, svobodě a roli vládní regulace v technologickém průmyslu."
    ],
    "points": 507,
    "commentCount": 1121,
    "retryCount": 0,
    "time": 1695752900
  },
  {
    "id": 37671991,
    "title": "Byl jsem okraden o svůj první příspěvek do jádra",
    "originLink": "https://ariel-miculas.github.io/How-I-got-robbed-of-my-first-kernel-contribution/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37671991",
    "commentBody": "",
    "originSummary": [
      "Ariel Miculas, softwarový inženýr ve společnosti Cisco, zažil nepříjemnou zkušenost, kdy měl pocit, že mu bylo odepřeno uznání za jeho první příspěvek k jádru Linuxu.",
      "Vytvořil opravu chyby, která ovlivňovala možnosti ladění v projektu, ale správce PowerPC místo toho, aby jeho opravu přijal, vytvořil vlastní opravu.",
      "Správce připsal Arielovi pouze to, že problém nahlásil, nikoliv jeho práci na vytvoření opravy, což vedlo k tomu, že se Ariel cítil nedoceněný a sklíčený."
    ],
    "commentSummary": [
      "Tato diskuse zdůrazňuje význam náležitého uznání a ocenění příspěvků k jádru Linuxu, významnému projektu s otevřeným zdrojovým kódem.",
      "Existují různé názory na plagiátorství, roli správců (osob, které spravují a dohlížejí na oblasti vývoje) a motivaci přispěvatelů do těchto projektů.",
      "Tato událost podtrhuje mimořádný význam efektivní komunikace, spolupráce a spravedlivého přiznávání autorství v komunitě open-source."
    ],
    "points": 439,
    "commentCount": 406,
    "retryCount": 0,
    "time": 1695805084
  },
  {
    "id": 37662510,
    "title": "macOS Sonoma je k dispozici ode dneška",
    "originLink": "https://www.apple.com/newsroom/2023/09/macos-sonoma-is-available-today/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37662510",
    "commentBody": "",
    "originSummary": [
      "Apple spustil bezplatnou aktualizaci softwaru macOS Sonoma, která uživatelům Maců přináší řadu nových funkcí.",
      "Mezi klíčové funkce patří přizpůsobitelné widgety na ploše, nové spořiče obrazovky, vylepšené videokonference a prohlížení webu se samostatnými profily, vylepšené hraní her s herním režimem a aktualizace různých aplikací, jako jsou mimo jiné Poznámky, Hesla a Zprávy.",
      "Aktualizace byla vydána celosvětově, její dostupnost se však může lišit v závislosti na regionu, jazyce a používaném zařízení."
    ],
    "commentSummary": [
      "Diskuse zahrnuje témata, jako je přibalování aktualizací společnosti Apple, problémy se Siri a Apple Music a střety s instalací a kompatibilitou balíčků.",
      "Uživatelé projevují různé preference vůči operačním systémům a správcům balíčků a diskutují také o Homebrew a jeho tvůrci Maxi Howellovi.",
      "Rozhovory se týkají konvencí pro pojmenování verzí operačních systémů a ukazují směs spokojenosti, frustrace a preferencí různých softwarových a hardwarových možností."
    ],
    "points": 408,
    "commentCount": 604,
    "retryCount": 0,
    "time": 1695748337
  },
  {
    "id": 37663820,
    "title": "Prorok: Automatický postup předpovídání",
    "originLink": "https://github.com/facebook/prophet",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37663820",
    "commentBody": "",
    "originSummary": [
      "Prophet je open-source software od týmu Core Data Science společnosti Facebook, který je navržen tak, aby pomáhal předpovídat časové řady dat pomocí aditivního modelu, který zohledňuje nelineární trendy a sezónní a prázdninové efekty.",
      "Software je odolný vůči chybějícím datům a odlehlým hodnotám a je navržen tak, aby vynikl u časových řad s robustními sezónními vlivy a dostatečným množstvím historických dat.",
      "Prophet lze nainstalovat pomocí R nebo Pythonu a je k dispozici ke stažení na CRAN a PyPI. Je pod licencí MIT a obsahuje experimentální backend označovaný jako cmdstanr."
    ],
    "commentSummary": [
      "Společnost Facebook ukončila používání automatického postupu předpovídání Prophet a navrhuje uživatelům, aby zvážili jiné nástroje, jako je NeuralProphet, statsforecast nebo Darts pro předpovídání časových řad.",
      "Proti Prophetovi se objevilo několik kritických připomínek k navrhovaným alternativním implementacím využívajícím torch a numpy+scipy.optimize. Byly zdůrazněny problémy s knihovnou STAN, kterou Prophet používá.",
      "V diskusi bylo zdůrazněno, že vyhodnocování prognóz a porozumění datovým strukturám je zásadní, a byly propagovány klasické bayesovské modely, zobecněné lineární modely (GLM) a grafové neuronové sítě (GNN) pro účely prognózování časových řad."
    ],
    "points": 283,
    "commentCount": 81,
    "retryCount": 0,
    "time": 1695753304
  },
  {
    "id": 37663194,
    "title": "ROCm je prioritou společnosti AMD, říká její ředitel",
    "originLink": "https://www.eetimes.com/rocm-is-amds-no-1-priority-exec-says/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37663194",
    "commentBody": "",
    "originSummary": [
      "Společnost AMD se prioritně zaměřuje na sjednocení různých softwarových balíčků, jako jsou ROCm, Vitis AI a ZenDNN, aby zvýšila výkon napříč různou škálou svých hardwarových produktů pro umělou inteligenci.",
      "Společnost označila ROCm za svůj hlavní problém a investuje do vývoje softwaru a získávání talentů, aby splnila své cíle v oblasti sjednocení.",
      "Společnost AMD podporuje programovací jazyk Triton s otevřeným zdrojovým kódem jako alternativu k CUDA společnosti Nvidia a podporuje účast komunity na urychleném vývoji svého softwarového zásobníku."
    ],
    "commentSummary": [
      "Rozhovor se točí kolem softwarového balíčku ROCm společnosti AMD a jeho soupeření s CUDA společnosti NVIDIA, konkrétně v oblastech umělé inteligence a her.",
      "Uživatelé vyjádřili obavy ohledně podpory a spolehlivosti společnosti AMD a zdůraznili potřebu lepší dokumentace a systémů podpory pro grafické procesory AMD.",
      "Bylo také poukázáno na to, že je velmi obtížné konkurovat zavedenému ekosystému CUDA, a byl uznán potenciál vytvoření životaschopné alternativy."
    ],
    "points": 279,
    "commentCount": 143,
    "retryCount": 0,
    "time": 1695750882
  },
  {
    "id": 37661767,
    "title": "Magentic - Použití LLM jako jednoduchých funkcí Pythonu",
    "originLink": "https://github.com/jackmpcollins/magentic",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37661767",
    "commentBody": "",
    "originSummary": [
      "Balíček Python usnadňuje začlenění dotazů LLM do běžného kódu tím, že umožňuje zápis signatur funkcí.",
      "Tento balíček zjednodušuje parsování výstupů LLM pomocí anotace návratového typu funkce, a to i pro složité návratové typy.",
      "Hlavním cílem tohoto balíčku je ukázat flexibilní použití LLM s běžným kódem a zjednodušit integraci a vyzvat externí přispěvatele."
    ],
    "commentSummary": [
      "Magentic je balíček pro Python, který vylepšuje použití jazykových modelů v kódu a je oceňován pro svůj zjednodušený design API.",
      "Uživatelé navrhli, aby se pro formáty modelů místo JSON používal yaml, a zároveň vyjádřili obavy ohledně složitých návratových typů.",
      "Komunitní konverzace zahrnuje výhody používání dekorátorů v jazyce Python při měření metrik výkonu, použití \"...\" v jazyce Python, různé jazykové modely a návrh funkcí pro objekt odpovědi."
    ],
    "points": 263,
    "commentCount": 59,
    "retryCount": 0,
    "time": 1695745876
  },
  {
    "id": 37661609,
    "title": "9. soudní dvůr zamítl tvrzení TSA o beztrestnosti pracovníků kontrolního stanoviště, kteří znásilnili cestujícího",
    "originLink": "https://papersplease.org/wp/2023/06/26/9th-circuit-rejects-tsa-claim-of-impunity-for-checkpoint-staff-who-rape-travelers/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37661609",
    "commentBody": "",
    "originSummary": [
      "Odvolací soud 9. obvodu zamítl žádost Úřadu pro bezpečnost dopravy (TSA) o imunitu v souvislosti s pracovníky kontrolních stanovišť, kteří se podíleli na incidentech sexuálního napadení.",
      "Soud stanovil, že proti TSA lze podat žalobu podle federálního zákona o nárocích z protiprávního jednání, takže správa je odpovědná za škody, které způsobí její zaměstnanci.",
      "Toto rozhodnutí představuje precedens v 9. obvodu, který se týká států západního pobřeží, a případ se nyní vrací zpět k okresnímu soudu USA k dalšímu posouzení."
    ],
    "commentSummary": [
      "Devátý soudní obvod rozhodl, že TSA (Transportation Security Administration) může být žalována za pochybení zaměstnanců, čímž vyvrátil tvrzení agentury o její imunitě.",
      "Tento rozsudek znamená posun směrem k odpovědnosti státních orgánů za jednání jejich zaměstnanců.",
      "Probíhá řada diskusí, které se zabývají účinností TSA, zpochybňují potřebu její přítomnosti, zvažují alternativní bezpečnostní přístupy a zpochybňují schopnost postupů TSA zabránit krádežím a zneužití."
    ],
    "points": 247,
    "commentCount": 137,
    "retryCount": 0,
    "time": 1695745290
  },
  {
    "id": 37662655,
    "title": "Zkoumání časového prostoru příkazového řádku systému Linux",
    "originLink": "https://fabiensanglard.net/st/index.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37662655",
    "commentBody": "",
    "originSummary": [
      "Článek pojednává o vytvoření nástroje s názvem \"st\", který nabízí údaje o době běhu programu, využití paměti a vytvořených procesech/vláknech.",
      "Výkon tohoto nástroje je porovnáván s překladači gcc a clang a na pozadí samostatného programu je analyzován i výkon překladače C++ clang++.",
      "Autor se při používání netlinku pro sledování procesů potýkal s problémy, ale překonal je díky cenným poznatkům z blogu Natana Yellina."
    ],
    "commentSummary": [
      "Článek se zabývá využitím příkazového řádku systému Linux pro sledování prostoru a času, zejména se zaměřením na měření času provádění příkazů pomocí příkazu 'time'.",
      "Probírá využití paměti v programech v jazyce C a další koncepty práce s příkazovým řádkem, přičemž toto téma pokrývá do hloubky.",
      "Článek si od čtenářů vysloužil pochvalu za jasná a srozumitelná vysvětlení, která jsou cenná pro zájemce o práci s příkazovým řádkem systému Linux."
    ],
    "points": 240,
    "commentCount": 35,
    "retryCount": 0,
    "time": 1695748872
  },
  {
    "id": 37671419,
    "title": "Esence: Operační systém pro stolní počítače vytvořený od základu pro ovládání a jednoduchost.",
    "originLink": "https://nakst.gitlab.io/essence",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37671419",
    "commentBody": "",
    "originSummary": [
      "Essence je nový desktopový operační systém vytvořený od základu, který se zaměřuje na uživatelské ovládání, jednoduchost a respekt k uživateli.",
      "Přestože je Essence ve fázi vývoje, vykazuje efektivní správu zdrojů a působivý výkon, a to i na málo výkonném hardwaru.",
      "Má otevřenou kódovou základnu a vektorové uživatelské rozhraní. Zájemci se mohou připojit k serveru Discord, kde získají aktualizace, a podpořit jeho vývoj na Patreonu."
    ],
    "commentSummary": [
      "Operační systém Essence je zdůrazňován jako atraktivní alternativa pro uživatele, kteří nepotřebují zpětnou kompatibilitu nebo serverové funkce, a nabízí ovládání, jednoduchost a přizpůsobené rozhraní.",
      "Diskutuje se také o zlepšení doby spouštění systému, optimalizaci procesu spouštění a vytváření nových projektů operačního systému a webových prohlížečů.",
      "Vývoj operačního systému Essence OS je celkově pozitivně hodnocen a dále jsou zmiňovány podobné projekty využívající jazyky bezpečné pro paměť."
    ],
    "points": 230,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1695800677
  },
  {
    "id": 37664682,
    "title": "Přehodnocení ludditů",
    "originLink": "https://www.newyorker.com/books/page-turner/rethinking-the-luddites-in-the-age-of-ai",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37664682",
    "commentBody": "",
    "originSummary": [
      "Kniha \"Blood in the Machine\" Briana Merchanta zpochybňuje běžné vnímání ludditů a tvrdí, že jejich odpor nebyl proti technologiím, ale za práva pracujících tváří v tvář automatizaci.",
      "Autor nachází paralely mezi historickým hnutím ludditů a moderním odporem k technologickému pokroku, zejména v éře umělé inteligence. Upozorňuje na možné důsledky přesunu pracovních míst způsobeného umělou inteligencí a neetických pracovních praktik.",
      "Navzdory neúspěšným snahám ludditů zastavit industrializaci autor zdůrazňuje nutnost společenských reakcí a regulací, které zajistí, že z automatizace budou mít prospěch všichni."
    ],
    "commentSummary": [
      "Článek zkoumá historický revizionismus luddistického hnutí, které se stavělo proti technologiím kvůli nepříznivým pracovním podmínkám a bezpečnostním problémům, a nachází paralely mezi těmito obavami a současným dopadem automatizace na pracovníky.",
      "Významným bodem diskuse jsou různé pohledy na dopady technologií a automatizace na pracovní místa, které zahrnují potenciální ztrátu pracovních míst, koncentraci moci a nutnost sebeorganizace pracovníků.",
      "V komentářích se také objevují obavy z toho, jak by umělá inteligence (AI) mohla negativně ovlivnit pracovní místa, z možného poklesu blahobytu lidí v důsledku AI a automatizace a z nutnosti vzájemného respektu a důvěry v technologie."
    ],
    "points": 219,
    "commentCount": 473,
    "retryCount": 0,
    "time": 1695756700
  },
  {
    "id": 37670740,
    "title": "Tipy a triky pro alokaci arény",
    "originLink": "https://nullprogram.com/blog/2023/09/27/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37670740",
    "commentBody": "",
    "originSummary": [
      "Text zdůrazňuje výhody používání arén při programování pro přidělování a správu paměti namísto jednotlivých alokací paměti.",
      "Zmiňuje se o použití maker a atributů pro optimalizaci přidělování paměti a o strategiích pro určení velikosti arény a řešení nárůstu paměti.",
      "Příspěvek také naznačuje budoucí obsah o implementaci kontejnerových datových struktur s využitím arén."
    ],
    "commentSummary": [
      "Článek zdůrazňuje výhody a strategie arénových alokátorů v programování, včetně vyššího výkonu, menší fragmentace a optimalizované alokace.",
      "Pojednává o tom, jak řešit situace s omezenou pamětí, jak se vyhnout přerušení, jak dodržovat přísná pravidla aliasingu a jak používat pole znaků pro alokaci paměti.",
      "V textu je dále zmíněn projekt \"CollectionMicrobench\" na GitHubu, který umožňuje kontrolu nad velikostí bloků při alokaci arény, což naznačuje praktické využití těchto technik."
    ],
    "points": 215,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1695794395
  },
  {
    "id": 37674139,
    "title": "Nejkopírovanější úryvek StackOverflow všech dob je chybný",
    "originLink": "https://programming.guide/worlds-most-copied-so-snippet.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37674139",
    "commentBody": "",
    "originSummary": [
      "Článek pojednává o populární odpovědi na serveru Stack Overflow, která byla hojně kopírována díky své funkci převodu velikosti bajtů do lidsky čitelného formátu, ale později se ukázalo, že je chybná.",
      "Autor identifikuje problémy v tomto úryvku, které se týkají především omezení přesnosti a problémů spojených s aritmetikou s plovoucí desetinnou čárkou použitou v kódu.",
      "Článek končí poučením: upřednostňováním krátkých, přímočarých smyček před složitými matematickými řešeními a autor navrhuje zlepšení, která by odstranila stávající nedostatky v kódu."
    ],
    "commentSummary": [
      "Diskuse a články zkoumají nedostatky často replikovaného úryvku kódu na Stack Overflow a zvyk vývojářů kopírovat kód, aniž by mu plně rozuměli.",
      "Zabývají se potenciálními riziky, která vyplývají ze závislosti na zkopírovaném kódu, a poukazují na naléhavou potřebu kódovacích postupů odolných proti chybám.",
      "Konverzace zdůrazňuje význam ověřování certifikátů v implementacích TLS (Transport Layer Security) a poskytuje podrobnou analýzu fragmentů kódu Stack Overflow nalezených v projektech GitHub."
    ],
    "points": 213,
    "commentCount": 107,
    "retryCount": 0,
    "time": 1695820203
  },
  {
    "id": 37670938,
    "title": "Psaní ladicího programu od nuly: Body přerušení",
    "originLink": "https://www.timdbg.com/posts/writing-a-debugger-from-scratch-part-5/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37670938",
    "commentBody": "",
    "originSummary": [
      "Článek vysvětluje, jak implementovat body přerušení ve vlastním debuggeru známém jako DbgRs, a podrobně popisuje úpravy kódu provedené za tímto účelem.",
      "Zavádí koncept hardwarových bodů přerušení jako dalšího postupu, řízeného ladicími registry. Dále ukazuje, jak spravovat body přerušení, zpracovávat výjimky a pokračovat v procesu provádění.",
      "Článek však upozorňuje na omezení - v poskytnutém kódu chybí funkce pro zobrazení zásobníku volání."
    ],
    "commentSummary": [
      "Článek poskytuje vhled do procesu vytváření ladicího programu od nuly s anekdotami zkušených vývojářů.",
      "Pro IDE je navrženo použití nástroje Tree-sitter, který slouží k vytváření rychlých, inkrementálních parserů.",
      "Jsou probrány různé strategie pro nastavení bodů přerušení a uvedeny další zdroje pro další vzdělávání v oblasti vývoje ladicích programů."
    ],
    "points": 208,
    "commentCount": 32,
    "retryCount": 0,
    "time": 1695796285
  },
  {
    "id": 37662281,
    "title": "Proč Američané nejedí skopové?",
    "originLink": "https://modernfarmer.com/2023/09/digging-in-mutton/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37662281",
    "commentBody": "",
    "originSummary": [
      "Skopové maso, maso ze zralých ovcí, není v USA běžně dostupné a obvykle ho najdete pouze ve specializovaných řeznictvích nebo na etnických trzích.",
      "Spotřeba skopového masa od 20. století klesá v důsledku nahrazení vlny syntetickými vlákny v chovu ovcí a delší doby přípravy.",
      "Přestože má skopové maso jedinečnou a výraznou chuť, kterou si někteří lidé oblíbili, je v současné americké společnosti vnímáno vesměs negativně."
    ],
    "commentSummary": [
      "Diskuse se týkají široké škály témat, včetně toho, jak se v různých zemích upřednostňují různé druhy masa, jako je jehněčí, skopové a kozí.",
      "V rozhovorech se také probírají různé způsoby přípravy těchto druhů masa, vliv používání mýdla na litinové pánve a dopad pastvy ovcí na životní prostředí.",
      "Mezi další témata, která se probírají, patří snižování rozmanitosti globálního trhu, vliv marketingu na výběr potravin a dostupnost různých druhů masa v supermarketech."
    ],
    "points": 203,
    "commentCount": 464,
    "retryCount": 0,
    "time": 1695747560
  },
  {
    "id": 37663159,
    "title": "Útok na krádež pixelů postranním kanálem funguje v Chromu na všech moderních GPU",
    "originLink": "https://arstechnica.com/security/2023/09/gpus-from-all-major-suppliers-are-vulnerable-to-new-pixel-stealing-attack/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37663159",
    "commentBody": "",
    "originSummary": [
      "Výzkumníci odhalili nový křížový útok nazvaný \"GPU.zip\", který odhaluje uživatelská jména, hesla a další citlivé vizuální údaje zobrazované na webových stránkách využívajících grafické procesory od hlavních dodavatelů.",
      "Útok umožňuje škodlivým webům číst a rekonstruovat pixely z jiné domény za účelem zobrazení obsahu cílového webu, čímž se obchází zásada stejného původu, základní bezpečnostní princip, který odděluje obsah z různých domén webových stránek.",
      "GPU.zip využívá kompresi dat používanou interními a diskrétními grafickými procesory ke zneužití postranního kanálu a krádeži pixelů. Zranitelnost byla prokázána na grafických procesorech společností Apple, Intel, AMD, Qualcomm, Arm a Nvidia."
    ],
    "commentSummary": [
      "V prohlížečích založených na platformě Chromium byl identifikován útok na krádež pixelů pomocí postranních kanálů, který využívá filtry SVG k určení barvy každého pixelu na cílových stránkách.",
      "Navrhovaným řešením je zpracování iframe v konstantním čase, které je však považováno za těžkopádné. Pozoruhodné je, že prohlížeče Safari a Firefox nejsou na tento útok náchylné.",
      "Diskuse se dále zabývá otázkami spouštění nedůvěryhodného kódu, důsledky akcelerace CSS na cross-origin iframe, časovými útoky ve webových technologiích a debatami o konceptu \"krádeže\" a jeho dopadu na bezpečnostní nástroje, jako je uMatrix."
    ],
    "points": 200,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1695750765
  },
  {
    "id": 37663601,
    "title": "GPU.zip: útok postranním kanálem, který odhaluje vizuální data zpracovávaná na GPU.",
    "originLink": "https://www.hertzbleed.com/gpu.zip/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37663601",
    "commentBody": "",
    "originSummary": [
      "GPU.zip je nedávno objevená zranitelnost postranního kanálu v moderních grafických procesorech (GPU), která využívá komprese grafických dat k úniku vizuálních dat.",
      "Zranitelnost mohou zneužít škodlivé webové stránky ke krádeži pixelů z jiných webových stránek, čímž naruší bezpečnostní modely prohlížeče. Postihuje grafické procesory různých výrobců a zanechává některé citlivé webové stránky zranitelné.",
      "Výrobci grafických procesorů a společnost Google v současné době řeší, zda zranitelnost opravit. Zatímco prohlížeč Google Chrome je vůči tomuto útoku náchylný, prohlížeče Firefox a Safari náchylné nejsou. Zdrojový kód GPU.zip je nyní veřejně dostupný."
    ],
    "commentSummary": [
      "Výzkumníci identifikovali útok postranním kanálem s názvem \"GPU.zip\", který odhaluje vizuální data zpracovávaná na GPU.",
      "Tento útok se provádí měřením časování GPU za účelem pomalého extrahování dat pixelů.",
      "Problém vychází z využití komprese dat, kterou využívají ovladače GPU, a může ovlivnit i další procesy, nejen GPU."
    ],
    "points": 199,
    "commentCount": 27,
    "retryCount": 0,
    "time": 1695752380
  },
  {
    "id": 37662937,
    "title": "Tipy pro soloprůmyslníky?",
    "originLink": "https://news.ycombinator.com/item?id=37662937",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37662937",
    "commentBody": "",
    "originSummary": [
      "Vyvinul návrhové nástroje pro řešení běžných problémů a na základě pozitivní zpětné vazby z konferencí uvažuje o jejich komerčním využití.",
      "Tváří v tvář výzvám, které s sebou přináší role jediného zakladatele, zvažuje aspekty, jako je stanovení milníků, zeměpisná poloha a marketingové strategie pro produkty.",
      "Zájem o pochopení rozdílu mezi získáváním finančních prostředků a založením společnosti také naznačuje, že zvažují různé možnosti finanční podpory a rozvoje podnikání."
    ],
    "commentSummary": [
      "Příspěvek se zabývá složitostmi a riziky soloprůmyslu, který se pokouší zpeněžit návrhářské nástroje, zajištěním velkých zakázek a potřebou diverzifikace zákazníků.",
      "Zdůrazňuje výzvy, které přináší samostatné působení v týmu, výhody zaměření na konkrétní klientelu, rozšiřování pomocí marketingových strategií a roli emoční inteligence (znalosti a schopnosti vnímat, chápat a řídit emoce) v prodeji.",
      "Mezi klíčové body patří také začlenění výměny PubExchange s vydavateli, důležitost osobních schůzek, využití zpětné vazby od uživatelů, pochopení problémů zákazníků a stanovení priorit při vývoji produktů pro udržitelný úspěch."
    ],
    "points": 196,
    "commentCount": 78,
    "retryCount": 0,
    "time": 1695749991
  }
]
