[
  {
    "id": 37445401,
    "title": "60 எல்.எல்.எம்.களில் 20 கேள்விகளின் தொகுப்பைக் கேட்பது",
    "originLink": "https://benchmarks.llmonitor.com",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37445401",
    "commentBody": "",
    "originSummary": [
      "60 க்கும் மேற்பட்ட மாதிரிகளின் அடிப்படை பகுத்தறிவு, அறிவுறுத்தல் பின்தொடர்தல் மற்றும் படைப்பாற்றலை சோதிக்க வடிவமைக்கப்பட்ட ஸ்கிரிப்டை அந்த நபர் உருவாக்கினார்.",
      "பதில்கள் SQLite தரவுத்தளத்தில் சேமிக்கப்பட்டன, மதிப்பாய்வுக்கு செயலாக்கப்படாத முடிவுகளை வழங்குகின்றன.",
      "இந்த திட்டம் உண்மையான, நிஜ உலக பணிப்பாய்வுகளில் இந்த மாதிரிகளின் செயல்திறனை மதிப்பிடுவதை நோக்கமாகக் கொண்டுள்ளது."
    ],
    "commentSummary": [
      "விவாதம் செயற்கை நுண்ணறிவு மொழி மாதிரிகளின் பல்வேறு அம்சங்களைச் சுற்றி சுழல்கிறது, அவற்றின் செயல்திறன், வரம்புகள் மற்றும் மேம்பாட்டிற்கான வாய்ப்பு ஆகியவற்றில் கவனம் செலுத்துகிறது.",
      "உறுப்பினர்கள் வெவ்வேறு சூழ்நிலைகளில் இந்த மாதிரிகளின் துல்லியம், நிலைத்தன்மை மற்றும் பயன்பாடு குறித்த தனிப்பட்ட அனுபவங்களையும் கருத்துக்களையும் பரிமாறிக்கொள்கிறார்கள், மேலும் வெளிப்படைத்தன்மை மற்றும் சார்பு சிக்கல்களைப் பற்றி விவாதிக்கின்றனர்.",
      "பல்வேறு களங்களில் செயற்கை நுண்ணறிவு மொழி மாதிரிகளை ஏற்றுக்கொள்வதில் உள்ள ஆழமான சிக்கல்கள், சவால்கள் மற்றும் சாத்தியமான நன்மைகளை இந்த சொற்பொழிவு பரிந்துரைக்கிறது."
    ],
    "points": 605,
    "commentCount": 305,
    "retryCount": 0,
    "time": 1694267493
  },
  {
    "id": 37450915,
    "title": "அமெரிக்க எரிமலையில் லித்தியம் கண்டுபிடிப்பு இதுவரை கண்டுபிடிக்கப்பட்ட மிகப்பெரிய வைப்பு",
    "originLink": "https://www.chemistryworld.com/news/lithium-discovery-in-us-volcano-could-be-biggest-deposit-ever-found/4018032.article",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37450915",
    "commentBody": "",
    "originSummary": [
      "நெவாடா-ஓரிகான் எல்லையில் உலகின் மிகப்பெரிய லித்தியம் படிவு கண்டுபிடிக்கப்பட்டுள்ளது, இது லித்தியத்தின் உலகளாவிய விநியோகத்திற்கு கணிசமாக பங்களிக்கக்கூடும்.",
      "எரிமலை பள்ளத்தில் அசாதாரண களிமண் கல்லில் வைக்கப்பட்டுள்ள இந்த படிவத்தில் 20 முதல் 40 மில்லியன் டன் லித்தியம் இருப்பதாக மதிப்பிடப்பட்டுள்ளது, இது லித்தியம் நிறைந்த தாதுக்களில் காணப்படுவதை விட கிட்டத்தட்ட இரு மடங்காகும்.",
      "இந்த கண்டுபிடிப்பு, திறமையாகப் பயன்படுத்தப்பட்டால், உலகளாவிய லித்தியம் சந்தையில் பொருளியல் ரீதியாக தாக்கத்தை ஏற்படுத்தும்- விலைகளை மாற்றுதல், வழங்கல் பாதுகாப்பை உறுதி செய்தல் மற்றும் புவிசார் அரசியல் இயக்கவியலில் செல்வாக்கு செலுத்துதல்."
    ],
    "commentSummary": [
      "இந்த விவாதம் லித்தியம் உற்பத்தி அம்சங்களை வலியுறுத்துகிறது, இதில் கிடைக்கும் தன்மை, சுத்திகரிப்பு மற்றும் மறுசுழற்சி சவால்கள் மற்றும் சுற்றுச்சூழல் தாக்கம் ஆகியவை அடங்கும், திறமையான பேட்டரி உற்பத்திக்கு குறிப்பிட்ட திறன்கள் மற்றும் நடைமுறைகளின் அவசியத்தை எடுத்துக்காட்டுகிறது.",
      "லித்தியம் சுத்திகரிப்பில் சீனா தற்போது முன்னணியில் உள்ளது, அமெரிக்காவில் குறிப்பிடத்தக்க சாத்தியமான லித்தியம் நிறுவனங்கள் உள்ளன. உரையாடல் அலுமினியத்தை மறுசுழற்சி செய்வது தொடர்பான சிக்கல்கள் மற்றும் சவால்களைக் குறிப்பிடுகிறது மற்றும் லித்தியத்திற்கான மேம்பட்ட மறுசுழற்சி விகிதங்களுக்கு அழைப்பு விடுக்கிறது.",
      "லித்தியம் சுரங்கத்தின் சுற்றுச்சூழல் தடம் குறித்த கவலை, புவிசார் அரசியல் தாக்கங்களுடன், மின்மயமாக்கல் மற்றும் காலநிலை மாற்றத்தை எதிர்த்துப் போராடுவதில் அதன் முக்கிய பங்கால் எதிர்க்கப்படுகிறது. சுற்றுச்சூழலுக்கு உகந்த பிரித்தெடுத்தல் குறித்த கூடுதல் ஆராய்ச்சிக்கான அழைப்புகள் நெவாடாவில் முன்மொழியப்பட்ட லித்தியம் சுரங்கத்திற்கான எதிர்ப்புடன் இணைக்கப்பட்டுள்ளன."
    ],
    "points": 498,
    "commentCount": 232,
    "retryCount": 0,
    "time": 1694298436
  },
  {
    "id": 37444268,
    "title": "லெகோ பயன்படுத்தும் ஒவ்வொரு வகை பிளாஸ்டிக் (2022)",
    "originLink": "https://bricknerd.com/home/every-type-of-plastic-used-by-lego-5-20-22",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37444268",
    "commentBody": "",
    "originSummary": [
      "இந்த கட்டுரை லெகோ பயன்படுத்தும் பல்வேறு பிளாஸ்டிக்குகளை கோடிட்டுக் காட்டுகிறது, அவற்றின் பண்புகள் மற்றும் பயன்பாடுகளை ஆராய்கிறது.",
      "லெகோவின் பிளாஸ்டிக் கலவைகள் வர்த்தக ரகசியங்களாகும், இது சுற்றுச்சூழலுக்கு உகந்த பொருட்களை உருவாக்குவதற்கான நிறுவனத்தின் முயற்சிகளை அடிக்கோடிட்டுக் காட்டுகிறது.",
      "லெகோ செங்கற்களுக்கான சாத்தியமான எதிர்கால பொருட்கள் குறித்து இந்த கட்டுரை ஊகிக்கிறது, இது இந்த துறையில் தொடர்ச்சியான கண்டுபிடிப்புகளை நிரூபிக்கிறது."
    ],
    "commentSummary": [
      "இந்த கட்டுரை லெகோ பயன்படுத்தும் பிளாஸ்டிக் வகைகளைப் பற்றிய நுண்ணறிவை வழங்குகிறது, இதில் சேமிப்பு, பாதுகாப்பு, வயதான மற்றும் உடையக்கூடிய தன்மை பற்றிய விவாதங்கள் அடங்கும்.",
      "நிறுவனத்தின் நிலைத்தன்மை நோக்கங்கள் இருந்தபோதிலும், லெகோவின் பிளாஸ்டிக் பயன்பாடு மற்றும் சாத்தியமான பசுமை கழுவுதல் ஆகியவற்றின் சுற்றுச்சூழல் விளைவுகள் குறித்து இது கேள்விகளை எழுப்புகிறது.",
      "மைக்ரோபிளாஸ்டிக்ஸின் சாத்தியமான ஆபத்து மற்றும் லெகோ லஞ்ச்பாக்ஸ் தொடர்பாக உணவு பாதுகாப்பு குறித்த கவலைகள் நிவர்த்தி செய்யப்படுகின்றன, வழக்கமான பிரித்தல் மற்றும் கழுவுவதற்கான பரிந்துரைகளுடன்."
    ],
    "points": 350,
    "commentCount": 107,
    "retryCount": 0,
    "time": 1694259839
  },
  {
    "id": 37451518,
    "title": "பழைய லேன் கட்சிகளின் நினைவுகள்",
    "originLink": "https://thomask.sdf.org/blog/2023/09/09/memories-from-old-lan-parties.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37451518",
    "commentBody": "",
    "originSummary": [
      "விண்டோஸ் இயக்க முறைமைகள், வன்பொருள் மாற்றங்கள் மற்றும் கேமிங் நடைமுறைகளுடனான அனுபவங்களை முன்னிலைப்படுத்தி, 2000 களில் இருந்து லேன் கட்சிகளைப் பற்றிய நாஸ்டால்ஜிக் நுண்ணறிவை ஆசிரியர் கொண்டு வருகிறார்.",
      "விண்டோஸை மீண்டும் நிறுவ வேண்டியதன் அவசியம், ஹார்ட் டிரைவ் திருட்டு, திருட்டு விளையாட்டுகளுக்கு விரிசல்களைப் பயன்படுத்துதல் மற்றும் காலப்போக்கில் லேன் தொழில்நுட்பத்தின் வளர்ச்சி போன்ற தனித்துவமான நிகழ்வுகளை கதை நினைவூட்டுகிறது.",
      "இந்த கட்டுரை முந்தைய லேன் கேமிங் அனுபவங்களின் சிக்கல்கள் மற்றும் தனித்துவங்களை நோக்கி நகைச்சுவையான மற்றும் பின்னோக்கிய லென்ஸை எடுக்கிறது."
    ],
    "commentSummary": [
      "இந்த விவாதம் 90 கள் மற்றும் 2000 களின் முற்பகுதியில் லேன் (லோக்கல் ஏரியா நெட்வொர்க்) கட்சிகளுடன் தொடர்புடைய ஏக்கம் மற்றும் அன்பான நினைவுகளைப் பிரதிபலிக்கிறது.",
      "பங்கேற்பாளர்கள் கேம்களை விளையாடுவது, கணினிகளை உள்ளமைப்பது மற்றும் லேன் கேமிங்கின் சிலிர்ப்பு மற்றும் சவால்களைப் பற்றி தங்கள் அனுபவங்களை நினைவு கூர்கிறார்கள்.",
      "இந்த உரையாடல் லான் கட்சிகள் வளர்த்த தோழமை, போட்டி மற்றும் மகிழ்ச்சியின் கூறுகளை அடிக்கோடிட்டுக் காட்டுகிறது."
    ],
    "points": 272,
    "commentCount": 143,
    "retryCount": 0,
    "time": 1694303669
  },
  {
    "id": 37448659,
    "title": "SmartKnob – மென்பொருள் வரையறுக்கப்பட்ட எண்ட்டாப்கள் மற்றும் மெய்நிகர் டெடென்ட்களுடன் ஹாப்டிக் உள்ளீட்டு கைப்பிடி",
    "originLink": "https://github.com/scottbez1/smartknob",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37448659",
    "commentBody": "",
    "originSummary": [
      "SmartKnob என்பது ஒரு திறந்த மூல உள்ளீட்டு சாதனமாகும், இது துல்லியமான கட்டுப்பாட்டிற்காக தூரிகை இல்லாத ஜிம்பல் மோட்டார் மற்றும் காந்த என்கோடரைப் பயன்படுத்துகிறது, இது டெடென்ட்கள் மற்றும் எண்ஸ்டாப்புகளுக்கு தனிப்பயனாக்கத்தை வழங்குகிறது.",
      "இந்த திட்டத்தின் வளர்ச்சி இன்னும் நடந்து கொண்டிருக்கிறது மற்றும் மேம்பட்ட சோல்டரிங் திறன்கள் தேவைப்படுகின்றன.",
      "ஸ்பார்க்ஃபன் எலக்ட்ரானிக்ஸ் பரிந்துரைக்கப்பட்ட மோட்டார்களை தயாரித்து வழங்குகிறது, மேலும் பயனர்கள் தங்கள் கட்டமைப்புகளைப் பற்றி உரையாட ஒரு டிஸ்கார்ட் சமூகம் உள்ளது."
    ],
    "commentSummary": [
      "SmartKnob என்பது ஒரு திறந்த மூல வன்பொருள் திட்டமாகும், இது மென்பொருள் வரையறுக்கப்பட்ட எண்ஸ்டாப்கள் மற்றும் மெய்நிகர் டெடென்ட்களுடன் ஒரு ஹாப்டிக் உள்ளீட்டு நாப்பை உருவாக்கியுள்ளது, இது இசை கருவிகள், கண்ட்ரோல் பேனல்கள் மற்றும் சிமுலேட்டர்கள் போன்ற பகுதிகளில் அதன் திறனுக்காக பாராட்டப்படுகிறது.",
      "உற்சாகம் இருந்தபோதிலும், கைப்பிடியின் பயனரின் சுழற்சியால் உருவாகும் மின்னழுத்தத்திற்கு எதிரான பாதுகாப்பு குறித்து சிலர் கவலைகளை வெளிப்படுத்தி வருகின்றனர்.",
      "இந்த திட்டம் மெருகூட்டப்பட்ட வடிவமைப்புடன் நன்கு ஆவணப்படுத்தப்பட்டுள்ளது, மேலும் படைப்பாளி முன்னேற்றத்திற்கான பின்னூட்டங்கள் மற்றும் பங்களிப்புகளுக்கு திறந்திருக்கிறார், இது பயனர் தேவைகளுக்கு பதிலளிக்கும் வகையில் நடந்து வரும் பரிணாமத்தைக் குறிக்கிறது."
    ],
    "points": 232,
    "commentCount": 33,
    "retryCount": 0,
    "time": 1694284239
  },
  {
    "id": 37445284,
    "title": "மொராக்கோ நிலநடுக்கம்: 1,000 பேர் பலி",
    "originLink": "https://www.nbcnews.com/news/world/live-blog/morocco-earthquake-kills-600-devastates-historic-sites-live-updates-rcna104208",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37445284",
    "commentBody": "",
    "originSummary": [
      "மொராக்கோவில் அடுத்தடுத்து ஏற்பட்ட பயங்கர நிலநடுக்கத்தால் கணிசமான உயிர்சேதமும், உள்கட்டமைப்பு சேதமும் ஏற்பட்டது.",
      "மொராக்கோ மன்னர் தேடுதல் மற்றும் மீட்புக் குழுக்களை அமைத்துள்ளார், மேலும் அமெரிக்கா மற்றும் போப் பிரான்சிஸ் உள்ளிட்ட சர்வதேச சமூகம் ஆதரவையும் இரங்கலையும் தெரிவித்துள்ளது.",
      "உயிர் பிழைத்தவர்களைத் தேடும் மற்றும் சேதத்தின் அளவை மதிப்பிடும் செயல்முறை தொடர்வதால், மனிதாபிமான குழுக்கள் மற்றும் பல நாடுகள் உதவி மற்றும் உதவிகளை வழங்கி வருகின்றன."
    ],
    "commentSummary": [
      "மொராக்கோவில் ஏற்பட்ட பயங்கர பூகம்பம் பூகம்ப தயார்நிலை, அமெரிக்க புலம்பெயர்ந்த நிபுணர்களுக்கான விசா கொள்கைகள் மற்றும் பூகம்பத்தால் பாதிக்கப்படும் பகுதிகளில் வீட்டு உள்கட்டமைப்பு கவலைகளை மையமாகக் கொண்ட ஒரு விரிவான விவாதத்தைத் தூண்டியுள்ளது.",
      "விவாதங்களுக்குள் ஒரு சர்ச்சைக்குரிய தலைப்பு என்னவென்றால், கிரகங்களின் தாக்கங்களின் அடிப்படையில் பூகம்பங்களை கணிக்க முடியும் என்று நம்பும் ஒரு ஆராய்ச்சியாளரின் கூற்று, போதுமான ஆதரவு அறிவியல் சான்றுகள் இல்லாததால் சந்தேகத்தை ஏற்படுத்துகிறது.",
      "பாதிக்கப்பட்ட சமூகங்களில் சுற்றுலாவின் தாக்கங்கள் மற்றும் எல்லைகள் மற்றும் குடியேற்ற உரிமைகளைச் சுற்றியுள்ள சர்ச்சைகள் குறித்தும் இந்த விவாதம் செல்கிறது."
    ],
    "points": 231,
    "commentCount": 132,
    "retryCount": 0,
    "time": 1694266815
  },
  {
    "id": 37444386,
    "title": "கூகிள், மெட்டா, அமேசான் ஆகியவை அமெரிக்க பணிநீக்கங்களுக்குப் பிறகு குறைந்த ஊதியம் பெறும் எச் 1 பி ஊழியர்களை வேலைக்கு அமர்த்துகின்றன",
    "originLink": "https://www.moneycontrol.com/europe/?url=https://www.moneycontrol.com/news/trends/layoffs-google-microsoft-meta-amazon-hiring-low-paid-h1b-workers-after-us-layoffs-report-10605301.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37444386",
    "commentBody": "",
    "originSummary": [
      "கூகிள், மெட்டா, அமேசான், மைக்ரோசாப்ட், ஜூம், சேல்ஸ்ஃபோர்ஸ் மற்றும் பாலந்திர் போன்ற முன்னணி தொழில்நுட்ப நிறுவனங்கள் இந்த ஆண்டு ஆயிரக்கணக்கான எச் 1 பி ஊழியர் விசாக்களுக்கு விண்ணப்பித்து வருகின்றன.",
      "ஊழியர்களை பணிநீக்கம் செய்த போதிலும், இந்த நிறுவனங்கள் மென்பொருள் பொறியாளர்கள் மற்றும் ஆராய்ச்சியாளர்கள் போன்றவர்களை பணியமர்த்துவதை நோக்கமாகக் கொண்டு எச் 1 பி விசாக்களுக்கு விண்ணப்பங்களை தாக்கல் செய்தன, இது வெளிநாட்டிலிருந்து குறைந்த ஊதியம் பெறும் தொழில்நுட்ப ஊழியர்களை மையமாகக் கொண்டதாக கூறப்படுகிறது.",
      "இந்த பணிநீக்கங்கள் இந்தியா உட்பட எச் 1 பி விசாக்களில் உள்ள பல தற்போதைய தொழிலாளர்களை பாதித்துள்ளன, வெளிநாட்டு திறமையாளர்களை வேலைக்கு அமர்த்த முயற்சிக்கும்போது ஊழியர்களைக் குறைப்பதற்கான முரண்பாடான மூலோபாயத்தை எடுத்துக்காட்டுகிறது."
    ],
    "commentSummary": [
      "கூகிள், மெட்டா மற்றும் அமேசான் உள்ளிட்ட பெரிய தொழில்நுட்ப நிறுவனங்கள், உள்ளூர் அமெரிக்க ஊழியர்களை பணிநீக்கம் செய்த பின்னர் குறைந்த ஊதியம் பெறும் எச் 1 பி ஊழியர்களை வேலைக்கு அமர்த்தியதாக குற்றம் சாட்டப்படுவதைச் சுற்றி இந்த விவாதம் சுழல்கிறது.",
      "மொழித் தடைகள் தொடர்பான சவால்கள், பணியமர்த்தல் செயல்முறையில் உணரப்பட்ட பாரபட்சம் மற்றும் அவர்களின் ஒட்டுமொத்த சிகிச்சை குறித்த கவலைகள் போன்ற எச் 1 பி தொழிலாளர்கள் எதிர்கொள்ளும் பிரச்சினைகள் குறித்து இந்த உரையாடல் வெளிச்சம் போட்டுக் காட்டுகிறது, இது சீர்திருத்தத்திற்கான அழைப்புகளுக்கு வழிவகுக்கிறது.",
      "இந்த விவாதத்தின் நீட்சியானது பணியமர்த்தல் நடைமுறைகளில் குடிமக்களின் முன்னுரிமை, அமெரிக்க உயிர்களின் மதிப்பு மற்றும் தேசிய எல்லைகளின் பங்கு ஆகியவற்றைச் சுற்றியுள்ள பரந்த விவாதங்களுக்கு வழிவகுக்கிறது."
    ],
    "points": 221,
    "commentCount": 443,
    "retryCount": 0,
    "time": 1694261208
  },
  {
    "id": 37446083,
    "title": "அமெரிக்காவில் பொது ஓய்வறைகளைக் கண்டுபிடிப்பது கடினம்",
    "originLink": "https://www.washingtonpost.com/wellness/2023/09/08/public-restrooms-hard-find-comic/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37446083",
    "commentBody": "",
    "originSummary": [
      "இந்த கட்டுரை அமெரிக்காவில் பொது ஓய்வறைகளைக் கண்டுபிடிப்பதற்கான சவாலை எடுத்துக்காட்டுகிறது, இது குறிப்பாக மருத்துவ நிலைமைகள் உள்ளவர்களை பாதிக்கிறது.",
      "பொது கழிவறை பற்றாக்குறை குடல் நிலைமைகளைக் கொண்ட நபர்கள், வீடற்றவர்கள், வயதானவர்கள் மற்றும் கர்ப்பிணி நபர்கள் உட்பட பல்வேறு குழுக்களை பாதிக்கிறது.",
      "அவசரமாக தேவைப்படும் மக்களுக்கு அணுகக்கூடிய ஓய்வறைகளின் அவசியத்தை இந்த கட்டுரை அடிக்கோடிட்டுக் காட்டுகிறது."
    ],
    "commentSummary": [
      "இந்த விவாதத்தின் முக்கிய கவனம் அமெரிக்காவின் நகர்ப்புறங்களில் பொது ஓய்வறைகள் கிடைப்பது மற்றும் அணுகுவது ஆகும், வீடற்ற தன்மை, போதைப்பொருள் பயன்பாடு மற்றும் நாசவேலை போன்ற பிரச்சினைகள் குறித்து குறிப்பாக குறிப்பிடப்பட்டுள்ளது.",
      "சமத்துவமின்மை, குடிமைப் பொறுப்பு மற்றும் பொது வசதிகளை வழங்குவதில் வணிகங்கள் வகிக்கும் பங்கு உள்ளிட்ட பரந்த சமூக-பொருளாதார காரணிகள் குறித்து ஒரு விவாதம் உள்ளது.",
      "இந்த உரையாடல் ஒரு ஒப்பீட்டு கோணத்தை எடுக்கிறது, ஐரோப்பிய நாடுகளைக் குறிப்பிடுகிறது மற்றும் மனநல பராமரிப்பு மற்றும் பயங்கரவாதம் பொது கழிவறை வசதிகளை எவ்வாறு பாதிக்கிறது என்பதை விவாதிக்கிறது."
    ],
    "points": 212,
    "commentCount": 455,
    "retryCount": 0,
    "time": 1694271140
  },
  {
    "id": 37446790,
    "title": "அமெரிக்க வீட்டுவசதி சந்தை எதிர் கனேடிய வீட்டுவசதி சந்தை",
    "originLink": "https://awealthofcommonsense.com/2023/09/the-u-s-housing-market-vs-the-canadian-housing-market/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37446790",
    "commentBody": "",
    "originSummary": [
      "இந்த கட்டுரை அமெரிக்காவிற்கும் கனேடிய வீட்டுச் சந்தைகளுக்கும் இடையிலான குறிப்பிடத்தக்க வேறுபாட்டை ஆராய்கிறது, 2005 முதல் கனேடிய வீட்டு விலைகளில் 142% உண்மையான அதிகரிப்புடன், அதே காலகட்டத்தில் அமெரிக்காவின் 26% எழுச்சியுடன் ஒப்பிடும்போது.",
      "செலவழிக்கக்கூடிய வருமானத்தில் இந்த வேறுபாடு மேலும் கவனிக்கத்தக்கது, அங்கு அமெரிக்க வருமானங்கள் அதிகரித்து வரும் வீட்டுச் செலவுகளுடன் தொடர்ந்து உள்ளன, இருப்பினும் கனேடிய வருமானம் பின்தங்கியுள்ளது.",
      "வீட்டுச் சந்தையில் மலிவு, அமெரிக்காவில் சிக்கலானதாக இருந்தாலும், கனடாவில் மிகவும் மோசமாக உள்ளது என்பது முக்கிய வாதம்."
    ],
    "commentSummary": [
      "கனேடிய வீட்டு விலைகளில் குறிப்பிடத்தக்க அதிகரிப்பு ஏற்பட்டுள்ளது, இது இளைஞர்களுக்கும் உழைக்கும் தனிநபர்களுக்கும் வீட்டு உரிமையாளர்களை மேலும் மேலும் சவாலாக ஆக்கியுள்ளது.",
      "அரசாங்கக் கொள்கைகள், முதலீட்டாளர்களின் தாக்கம், தேக்கமான ஊதியங்கள் மற்றும் குடியேற்றம் போன்ற கூறுகள் இந்த வீட்டுவசதி மலிவு நெருக்கடிக்கு பங்களிக்கும் காரணிகளாக அறிவிக்கப்படுகின்றன.",
      "விரைவான வளர்ச்சி, அதிகரித்த சமூக வீட்டுவசதி நிதி, வரி சீர்திருத்தங்கள் மற்றும் சீரான குடியேற்றக் கொள்கைகள் உள்ளிட்ட பல்வேறு தீர்வுகள் முன்மொழியப்பட்டுள்ளன, இருப்பினும் பயனுள்ள தீர்வுகள் இல்லாதது மற்றும் அரசியல் முட்டுக்கட்டை ஆகியவை விமர்சிக்கப்படுகின்றன."
    ],
    "points": 202,
    "commentCount": 480,
    "retryCount": 0,
    "time": 1694274855
  },
  {
    "id": 37444477,
    "title": "சி.ஆர்.ஐ.எஸ்.பி.ஆர் புற்றுநோய் செல்களை ஆய்வகத்தில் ஆரோக்கியமான தசையாக 'மறுதொடக்கம்' செய்யப் பயன்படுகிறது",
    "originLink": "https://www.livescience.com/health/cancer/crispr-used-to-reprogram-cancer-cells-into-healthy-muscle-in-the-lab",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37444477",
    "commentBody": "",
    "originSummary": [
      "புற்றுநோய் செல்களை ஆரோக்கியமான தசை செல்களாக மாற்ற விஞ்ஞானிகள் சி.ஆர்.ஐ.எஸ்.பி.ஆர் தொழில்நுட்பத்தை வெற்றிகரமாகப் பயன்படுத்தியுள்ளனர்.",
      "இந்த முன்னேற்றம் புற்றுநோய் சிகிச்சைக்கான மரபணு எடிட்டிங் சிகிச்சைகளில் புதிய சாத்தியங்களுக்கு வழிவகுக்கும்.",
      "CRISPR, அல்லது கிளஸ்டர்டு ரெகுலரி இன்டர்ஸ்பேஸ்டு ஷார்ட் பாலிண்ட்ரோமிக் ரிபீட்ஸ், ஒரு மரபணு எடிட்டிங் கருவியாகும், இது ஆராய்ச்சியாளர்களை டி.என்.ஏ வரிசைகளை துல்லியமாக மாற்றவும் மரபணு செயல்பாட்டை மாற்றவும் அனுமதிக்கிறது."
    ],
    "commentSummary": [
      "ஆய்வக அமைப்பில் புற்றுநோய் செல்களை ஆரோக்கியமான தசை செல்களாக மாற்ற விஞ்ஞானிகள் சி.ஆர்.ஐ.எஸ்.பி.ஆர் மரபணு எடிட்டிங் தொழில்நுட்பத்தைப் பயன்படுத்தியுள்ளனர்.",
      "இந்த முறை தசை சிதைவு நோய்களுக்கான புதிய சிகிச்சைகளுக்கு வழிவகுக்கும்.",
      "இருப்பினும், சமாளிக்க இன்னும் தடைகள் உள்ளன, முதன்மையாக தொழில்நுட்பம் ஆரோக்கியமான திசுக்களுக்கு தீங்கு விளைவிக்காது என்பதைப் பாதுகாக்கிறது."
    ],
    "points": 190,
    "commentCount": 29,
    "retryCount": 0,
    "time": 1694262020
  }
]
