[
  {
    "id": 37445401,
    "title": "60 LLM'e 20 sorudan oluşan bir set sormak",
    "originLink": "https://benchmarks.llmonitor.com",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37445401",
    "commentBody": "",
    "originSummary": [
      "Kişi, 60'tan fazla modelin temel muhakeme, talimat takibi ve yaratıcılığını test etmek için tasarlanmış bir senaryo geliştirdi.",
      "Yanıtlar bir SQLite veritabanında saklanmış ve incelenmek üzere işlenmemiş sonuçlar sunulmuştur.",
      "Bu proje, bu modellerin gerçek dünyadaki iş akışlarındaki performansını değerlendirmeyi amaçlamaktadır."
    ],
    "commentSummary": [
      "Tartışma, yapay zeka dil modellerinin performanslarına, sınırlamalarına ve iyileştirme kapsamlarına odaklanarak çeşitli yönleri etrafında dönmektedir.",
      "Üyeler, bu modellerin doğruluğu, tutarlılığı ve farklı senaryolarda uygulanabilirliği hakkında kişisel deneyimlerini ve görüşlerini paylaşmakta, ayrıca şeffaflık ve önyargı konularını tartışmaktadır.",
      "Bu söylem, yapay zeka dil modellerinin çeşitli alanlarda benimsenmesinde yer alan derin karmaşıklıkları, zorlukları ve potansiyel faydaları ortaya koymaktadır."
    ],
    "points": 605,
    "commentCount": 305,
    "retryCount": 0,
    "time": 1694267493
  },
  {
    "id": 37450915,
    "title": "ABD yanardağındaki lityum keşfi şimdiye kadar bulunan en büyük yatak olabilir",
    "originLink": "https://www.chemistryworld.com/news/lithium-discovery-in-us-volcano-could-be-biggest-deposit-ever-found/4018032.article",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37450915",
    "commentBody": "",
    "originSummary": [
      "Nevada-Oregon sınırında, küresel lityum arzına önemli ölçüde katkıda bulunabilecek, potansiyel olarak dünyanın en büyüğü olan müthiş bir lityum yatağı keşfedildi.",
      "Volkanik bir kraterdeki alışılmadık bir kiltaşı içinde yer alan yatak, tahmini olarak 20 ila 40 milyon ton lityum içeriyor ve bu miktar lityum zengini minerallerde bulunan miktarın neredeyse iki katı.",
      "Bu keşif, verimli bir şekilde kullanılması halinde dünya lityum piyasasını önemli ölçüde etkileyebilir; fiyatları değiştirebilir, arz güvenliğini sağlayabilir ve jeopolitik dinamikleri etkileyebilir."
    ],
    "commentSummary": [
      "Tartışma; kullanılabilirlik, rafine etme ve geri dönüşüm zorlukları ve çevresel etki dahil olmak üzere lityum üretimine ilişkin hususları vurgulamakta ve verimli pil üretimi için özel beceri ve prosedürlere duyulan ihtiyacı ortaya koymaktadır.",
      "Çin şu anda lityum rafinasyonunda lider konumdadır ve ABD'de de uygun lityum şirketleri bulunmaktadır. Görüşmede alüminyumun geri dönüşümüyle ilgili karmaşıklık ve zorluklardan bahsediliyor ve lityum için geri dönüşüm oranlarının iyileştirilmesi çağrısında bulunuluyor.",
      "Lityum madenciliğinin çevresel ayak izine ilişkin kaygılar, lityumun elektrifikasyon ve iklim değişikliği ile mücadeledeki hayati rolü ve jeopolitik etkileri ile karşılanmaktadır. Çevre dostu madencilik konusunda daha fazla araştırma yapılması için yapılan çağrılar, Nevada'da önerilen bir lityum madenine yönelik muhalefetle bağlantılıdır."
    ],
    "points": 498,
    "commentCount": 232,
    "retryCount": 0,
    "time": 1694298436
  },
  {
    "id": 37444268,
    "title": "LEGO tarafından kullanılan her tür plastik (2022)",
    "originLink": "https://bricknerd.com/home/every-type-of-plastic-used-by-lego-5-20-22",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37444268",
    "commentBody": "",
    "originSummary": [
      "Bu makale, LEGO'nun kullandığı çeşitli plastikleri, özelliklerini ve uygulamalarını inceleyerek özetlemektedir.",
      "LEGO'nun plastik bileşimleri ticari sır niteliğindedir ve firmanın çevre dostu malzemeler yaratma çabalarının altını çizmektedir.",
      "Parça, LEGO yapım parçalarının gelecekteki potansiyel malzemeleri üzerine spekülasyonlar yapıyor ve bu alandaki sürekli yeniliği gösteriyor."
    ],
    "commentSummary": [
      "Makale, LEGO tarafından kullanılan plastik türleri hakkında bilgi vermekte ve saklama, koruma, eskime ve kırılganlık konularını ele almaktadır.",
      "Şirketin sürdürülebilirlik hedeflerine rağmen LEGO'nun plastik kullanımının çevresel sonuçları ve potansiyel yeşil göz boyama hakkında soru işaretleri uyandırıyor.",
      "Mikroplastiklerin potansiyel riski ve LEGO beslenme çantalarıyla ilgili gıda güvenliği endişeleri, düzenli sökme ve yıkama önerileriyle birlikte ele alınmaktadır."
    ],
    "points": 350,
    "commentCount": 107,
    "retryCount": 0,
    "time": 1694259839
  },
  {
    "id": 37451518,
    "title": "Eski LAN partilerinden anılar",
    "originLink": "https://thomask.sdf.org/blog/2023/09/09/memories-from-old-lan-parties.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37451518",
    "commentBody": "",
    "originSummary": [
      "Yazar, 2000'li yılların LAN partilerine nostaljik bir bakış açısı getirerek Windows işletim sistemleri, donanım modifikasyonları ve oyun uygulamaları ile ilgili deneyimlerin altını çiziyor.",
      "Anlatı, Windows'u yeniden yükleme zorunluluğu, sabit disk hırsızlığı, korsan oyunlar için crack kullanımı ve LAN teknolojisinin zaman içindeki gelişimi gibi benzersiz olayları hatırlatıyor.",
      "Makale, önceki LAN oyun deneyimlerinin karmaşıklıklarına ve özelliklerine mizahi ve geçmişe dönük bir bakış açısı getiriyor."
    ],
    "commentSummary": [
      "Tartışma, 90'lar ve 2000'lerin başındaki LAN (Yerel Alan Ağı) partileriyle ilgili nostalji ve güzel anıları yansıtıyor.",
      "Katılımcılar oyun oynama, bilgisayarları yapılandırma ve LAN oyunlarının heyecan ve zorluklarıyla ilgili deneyimlerini anımsıyor.",
      "Sohbet, LAN partilerinin teşvik ettiği dostluk, rekabet ve keyif unsurlarının altını çiziyor."
    ],
    "points": 272,
    "commentCount": 143,
    "retryCount": 0,
    "time": 1694303669
  },
  {
    "id": 37448659,
    "title": "SmartKnob - Yazılım tanımlı uç noktalara ve sanal kilitlere sahip dokunsal giriş düğmesi",
    "originLink": "https://github.com/scottbez1/smartknob",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37448659",
    "commentBody": "",
    "originSummary": [
      "SmartKnob, hassas kontrol için fırçasız bir gimbal motor ve manyetik kodlayıcı kullanan, detantlar ve son durdurucular için özelleştirme sunan açık kaynaklı bir giriş cihazıdır.",
      "Bu projenin geliştirilmesi halen devam etmektedir ve gelişmiş lehimleme yetenekleri gerektirmektedir.",
      "SparkFun Electronics önerilen motorları üretmekte ve sağlamaktadır ve kullanıcıların yapıları hakkında sohbet edebilecekleri bir Discord topluluğu mevcuttur."
    ],
    "commentSummary": [
      "SmartKnob, müzik aletleri, kontrol panelleri ve simülatörler gibi alanlardaki potansiyeli nedeniyle övülen, yazılım tanımlı uç noktalara ve sanal kilitlere sahip dokunsal bir giriş düğmesi oluşturan açık kaynaklı bir donanım projesidir.",
      "Heyecana rağmen, bazıları kullanıcının düğmeyi çevirmesiyle oluşan voltaja karşı koruma konusunda endişelerini dile getiriyor.",
      "Parlak bir tasarıma sahip olan proje iyi belgelenmiştir ve yaratıcı, kullanıcı ihtiyaçlarına yanıt olarak devam eden bir evrime işaret ederek iyileştirme için geri bildirim ve katkılara açıktır."
    ],
    "points": 232,
    "commentCount": 33,
    "retryCount": 0,
    "time": 1694284239
  },
  {
    "id": 37445284,
    "title": "Fas'ta meydana gelen depremde 1,000'den fazla kişi öldü",
    "originLink": "https://www.nbcnews.com/news/world/live-blog/morocco-earthquake-kills-600-devastates-historic-sites-live-updates-rcna104208",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37445284",
    "commentBody": "",
    "originSummary": [
      "Fas'ta meydana gelen bir dizi yıkıcı deprem, önemli ölçüde can kaybına ve altyapı hasarına yol açmıştır.",
      "Fas Kralı arama kurtarma ekiplerini harekete geçirdi ve ABD ve Papa Francis de dahil olmak üzere uluslararası toplum destek ve taziyelerini sundu.",
      "Hayatta kalanları arama ve hasar seviyesini değerlendirme süreci devam ederken, insani yardım grupları ve çok sayıda ülke yardım ve destek sağlıyor."
    ],
    "commentSummary": [
      "Fas'ta meydana gelen ölümcül deprem, depreme hazırlık, ABD'li göçmen profesyonellere yönelik vize politikaları ve deprem riski taşıyan bölgelerdeki konut altyapısına ilişkin kaygılara odaklanan kapsamlı bir tartışma başlattı.",
      "Tartışmalarda yer alan tartışmalı konulardan biri de, gezegensel etkilere dayanarak depremleri önceden tahmin edebileceklerine inanan bir araştırmacının ortaya attığı ve bilimsel kanıtların yetersizliği nedeniyle şüpheyle karşılanan iddiadır.",
      "Tartışma aynı zamanda turizmin etkilenen topluluklar üzerindeki etkileri ile sınırlar ve göçmen hakları konusundaki çekişmelere de uzanıyor."
    ],
    "points": 231,
    "commentCount": 132,
    "retryCount": 0,
    "time": 1694266815
  },
  {
    "id": 37444386,
    "title": "Google, Meta, Amazon ABD'deki işten çıkarmaların ardından düşük ücretli H1B işçileri işe alıyor",
    "originLink": "https://www.moneycontrol.com/europe/?url=https://www.moneycontrol.com/news/trends/layoffs-google-microsoft-meta-amazon-hiring-low-paid-h1b-workers-after-us-layoffs-report-10605301.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37444386",
    "commentBody": "",
    "originSummary": [
      "Google, Meta, Amazon, Microsoft, Zoom, Salesforce ve Palantir gibi önde gelen teknoloji şirketleri, toplu işten çıkarmalar yaparken bile bu yıl binlerce H1B işçi vizesi için başvuruda bulundu.",
      "Bu şirketler, çalışanlarını işten çıkarmalarına rağmen, yazılım mühendisleri ve araştırmacılar gibi pozisyonlarda istihdam edilmek üzere H1B vizesi başvurusunda bulunmuş ve denizaşırı ülkelerden gelen düşük ücretli teknoloji çalışanlarına odaklandıkları bildirilmiştir.",
      "İşten çıkarmalar, Hindistan'dan gelenler de dahil olmak üzere H1B vizesine sahip pek çok mevcut çalışanı etkiledi ve bir yandan yabancı yetenekleri işe almaya çalışırken diğer yandan personel azaltmaya yönelik çelişkili bir stratejinin altını çizdi."
    ],
    "commentSummary": [
      "Tartışma, Google, Meta ve Amazon'un da aralarında bulunduğu büyük teknoloji şirketlerinin, ABD'deki yerel çalışanları işten çıkardıktan sonra düşük ücretli H1B işçilerini işe aldıkları ve bunun da maaşları düşürmek için bir strateji olabileceği iddiasıyla mercek altına alınması etrafında dönüyor.",
      "Konuşma, H1B çalışanlarının karşılaştığı dil engelleri, işe alım sürecinde algılanan önyargılar ve genel muameleye ilişkin endişeler gibi sorunlara ışık tutuyor ve reform çağrılarına yol açıyor.",
      "Tartışmanın bir uzantısı, işe alım uygulamalarında vatandaşlara öncelik verilmesi, Amerikan yaşamlarının değeri ve ulusal sınırların rolü gibi daha geniş tartışmalara uzanıyor."
    ],
    "points": 221,
    "commentCount": 443,
    "retryCount": 0,
    "time": 1694261208
  },
  {
    "id": 37446083,
    "title": "Amerika'da umumi tuvalet bulmak zor",
    "originLink": "https://www.washingtonpost.com/wellness/2023/09/08/public-restrooms-hard-find-comic/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37446083",
    "commentBody": "",
    "originSummary": [
      "Makale, özellikle sağlık sorunları olan kişileri etkileyen bir durum olarak, Amerika'da umumi tuvaletleri bulmanın zorluğuna dikkat çekiyor.",
      "Umumi tuvalet sıkıntısı, bağırsak rahatsızlığı olan bireyler, evsizler, yaşlı yetişkinler ve hamile bireyler de dahil olmak üzere çeşitli grupları etkilemektedir.",
      "Makale, acilen ihtiyaç duyan insanlar için erişilebilir tuvaletlerin gerekliliğinin altını çiziyor."
    ],
    "commentSummary": [
      "Tartışmanın ana odağı, Amerika Birleşik Devletleri'nin kentsel bölgelerindeki umumi tuvaletlerin mevcudiyeti ve erişilebilirliği olup, evsizlik, uyuşturucu kullanımı ve vandalizm gibi konulara özel olarak değinilmektedir.",
      "Eşitsizlik, yurttaşlık sorumluluğu ve işletmelerin kamu tesislerinin sağlanmasında oynadıkları rol gibi daha geniş sosyo-ekonomik faktörlere ilişkin bir tartışma söz konusudur.",
      "Konuşma, Avrupa ülkelerine atıfta bulunarak ve ruh sağlığı hizmetleri ile terörizmin umumi tuvalet tesislerini nasıl etkilediğini tartışarak karşılaştırmalı bir bakış açısına sahip."
    ],
    "points": 212,
    "commentCount": 455,
    "retryCount": 0,
    "time": 1694271140
  },
  {
    "id": 37446790,
    "title": "ABD konut piyasası ile Kanada konut piyasası",
    "originLink": "https://awealthofcommonsense.com/2023/09/the-u-s-housing-market-vs-the-canadian-housing-market/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37446790",
    "commentBody": "",
    "originSummary": [
      "Makale, ABD ve Kanada konut piyasaları arasındaki önemli farkı inceliyor. 2005 yılından bu yana Kanada'da konut fiyatları %142 oranında reel artış gösterirken, aynı dönemde ABD'de bu oran %26'dır.",
      "ABD gelirlerinin artan konut maliyetlerine ayak uydurduğu, ancak Kanada gelirlerinin geride kaldığı harcanabilir gelir hesaba katıldığında bu farklılık daha da belirginleşmektedir.",
      "Temel argüman, ABD'de sorunlu olan konut piyasasındaki satın alınabilirliğin Kanada'da son derece kötü olduğudur."
    ],
    "commentSummary": [
      "Kanada'da konut fiyatlarında kayda değer bir artış yaşanmış olup, bu durum gençler ve çalışan bireyler için ev sahibi olmayı giderek zorlaştırmaktadır.",
      "Hükümet politikaları, yatırımcı etkisi, durgun ücretler ve göç gibi unsurlar, bu konut satın alınabilirliği krizine katkıda bulunan faktörler olarak bildirilmektedir.",
      "Hızlı kalkınma, sosyal konut fonlarının artırılması, vergi reformları ve dengeli göç politikaları gibi çeşitli çözümler önerilse de etkili çözümlerin bulunmaması ve siyasi çıkmaz eleştirilmektedir."
    ],
    "points": 202,
    "commentCount": 480,
    "retryCount": 0,
    "time": 1694274855
  },
  {
    "id": 37444477,
    "title": "CRISPR, kanser hücrelerini laboratuvarda sağlıklı kaslara 'yeniden programlamak' için kullanıldı",
    "originLink": "https://www.livescience.com/health/cancer/crispr-used-to-reprogram-cancer-cells-into-healthy-muscle-in-the-lab",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37444477",
    "commentBody": "",
    "originSummary": [
      "Bilim insanları, kanser hücrelerini sağlıklı kas hücrelerine dönüştürmek için CRISPR teknolojisinden başarıyla yararlandı.",
      "Bu buluş, kanser tedavisi için gen düzenleme terapilerinde yeni olasılıkların önünü açabilir.",
      "CRISPR veya Kümelenmiş Düzenli Aralıklı Kısa Palindromik Tekrarlar, araştırmacıların DNA dizilerini hassas bir şekilde değiştirmelerine ve gen işlevini değiştirmelerine olanak tanıyan bir gen düzenleme aracıdır."
    ],
    "commentSummary": [
      "Bilim insanları, laboratuvar ortamında kanser hücrelerini sağlıklı kas hücrelerine dönüştürmek için CRISPR gen düzenleme teknolojisini kullandılar.",
      "Bu yöntem potansiyel olarak kas dejenerasyonuna yol açan hastalıklar için yeni tedavilerin önünü açabilir.",
      "Bununla birlikte, teknolojinin sağlıklı dokulara yanlışlıkla zarar vermemesini sağlamak başta olmak üzere aşılması gereken engeller var."
    ],
    "points": 190,
    "commentCount": 29,
    "retryCount": 0,
    "time": 1694262020
  }
]
