[
  {
    "id": 39918245,
    "title": "Lavender AI soulève des questions éthiques dans le cadre de la campagne de bombardement israélienne",
    "originLink": "https://www.972mag.com/lavender-ai-israeli-army-gaza/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39918245",
    "commentBody": "",
    "originSummary": [
      "L'armée israélienne a déployé le programme d'intelligence artificielle \"Lavender\" pour désigner des cibles à Gaza, ce qui a entraîné un grand nombre de victimes civiles, notamment des femmes et des enfants, en raison du taux d'erreur élevé du système et de l'absence de surveillance humaine.",
      "Malgré les préoccupations éthiques, l'armée a continué à utiliser l'IA pour le ciblage, provoquant des destructions considérables et la perte de vies innocentes, notamment en utilisant des \"bombes muettes\" et en abandonnant l'évaluation des dommages causés par les bombes, ce qui soulève l'incertitude quant aux pertes civiles.",
      "Les critiques affirment que les stratégies de ciblage d'Israël sont contre-productives, risquant de renforcer le soutien du Hamas, alors que le gouvernement d'extrême droite intensifie les attaques contre les Palestiniens, fait taire les dissidents et renforce les mesures de maintien de l'ordre, ce qui incite à soutenir des plateformes comme +972 Magazine pour la couverture des événements."
    ],
    "commentSummary": [
      "Le débat sur l'utilisation de l'IA pour guider les frappes israéliennes à Gaza soulève des inquiétudes quant au ciblage d'individus liés à des terroristes et à la violation du droit humanitaire international.",
      "Les discussions portent sur le soutien historique des États-Unis à l'eugénisme et aux idées nazies, sur le rôle du Hamas, sur l'éthique du ciblage des civils en temps de guerre, sur les différends concernant le nombre de victimes et sur les difficultés à distinguer les combattants des civils.",
      "Des réflexions sont menées sur le conflit israélo-palestinien, l'éthique des actions militaires, l'utilisation de la propagande par les deux parties et la dynamique complexe de Gaza, en mettant l'accent sur le droit international, les aspects éthiques de l'IA dans la guerre et les complexités de la zone de conflit."
    ],
    "points": 1205,
    "commentCount": 1089,
    "retryCount": 0,
    "time": 1712155830
  },
  {
    "id": 39919401,
    "title": "Conseils et outils pour découvrir les propriétaires de sociétés fictives",
    "originLink": "https://gijn.org/stories/tracking-shell-companies-secret-owners/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39919401",
    "commentBody": "",
    "originSummary": [
      "Les journalistes d'investigation utilisent les outils de réseaux tels que l'ICIJ et l'OCCRP pour révéler les liens entre les sociétés écrans et leurs propriétaires secrets grâce à des techniques telles que le suivi des virements bancaires et l'utilisation de ressources telles que OpenCorporates.",
      "Les agents de formation jouent un rôle essentiel dans la création de sociétés écrans pour des clients fortunés en fournissant des services tels que des comptes bancaires et des noms de directeurs contre rémunération, tandis que les journalistes découvrent des actifs cachés et des liens criminels potentiels en utilisant des bases de données telles que ICIJ Offshore Leaks.",
      "Ils enquêtent sur le blanchiment d'argent, le crime organisé et la corruption, en particulier dans des pays comme la Russie et le Belarus, en suivant la piste de l'argent et en utilisant divers outils et conseils de signalement."
    ],
    "commentSummary": [
      "La discussion de gijn.org porte sur les défis et les avantages de l'utilisation de sociétés écrans pour la confidentialité financière, l'évasion fiscale et la protection juridique.",
      "Les participants débattent de sujets tels que la transparence de la propriété, l'impact des politiques fiscales et les implications éthiques des structures d'entreprise complexes.",
      "Les principaux points abordés sont le rôle des sociétés écrans dans les acquisitions, le respect de la législation, les stratégies fiscales, la protection du patrimoine et l'impact de la surveillance gouvernementale et des inégalités sociétales dans les affaires financières."
    ],
    "points": 954,
    "commentCount": 425,
    "retryCount": 0,
    "time": 1712161332
  },
  {
    "id": 39923404,
    "title": "Un clone de Local Perplexity fonctionnant sur un GPU de jeu affiche des performances impressionnantes",
    "originLink": "https://github.com/nilsherzig/LLocalSearch",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39923404",
    "commentBody": "",
    "originSummary": [
      "Une vidéo de démonstration montre un modèle 7b fonctionnant sur un GPU de jeu, offrant d'excellentes performances malgré les contraintes matérielles."
    ],
    "commentSummary": [
      "Les utilisateurs explorent le développement et les capacités du métamoteur de recherche local, searxng, sur GitHub, en se concentrant sur l'optimisation du matériel, la gestion des sites web et l'équilibre des performances et des ressources avec des modèles de génération de texte spécialisés.",
      "Des comparaisons sont établies entre searxng et d'autres plateformes d'IA telles que Perplexity, C.ai et Pi, et des recommandations sont formulées concernant les efforts de collaboration et l'attraction d'investissements en capital-risque."
    ],
    "points": 449,
    "commentCount": 86,
    "retryCount": 0,
    "time": 1712179666
  },
  {
    "id": 39917509,
    "title": "Fonctionnalités d'analyse statique améliorées dans GCC 14",
    "originLink": "https://developers.redhat.com/articles/2024/04/03/improvements-static-analysis-gcc-14-compiler",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39917509",
    "commentBody": "",
    "originSummary": [
      "L'article se penche sur les améliorations apportées à l'analyse statique dans le compilateur GCC 14, en mettant l'accent sur la passe d'analyse statique -fanalyzer, en présentant de nouvelles capacités telles que l'identification des boucles infinies et en s'attaquant aux faiblesses de sécurité grâce à l'analyse des faiblesses.",
      "Il se concentre sur les améliorations techniques plutôt que sur la promotion des produits Red Hat, mentionnant Compiler Explorer et les prochaines versions de GCC.",
      "La conclusion fournit des liens vers le blog et la boutique de Red Hat, qui traitent de sujets liés à la diversité, à l'équité et à l'inclusion."
    ],
    "commentSummary": [
      "Une discussion sur l'amélioration de l'analyse statique dans GCC sur redhat.com se penche sur la comparaison des messages d'erreur entre des langages tels que C, Rust et NixOS, et met en évidence les problèmes et les suggestions d'amélioration.",
      "L'importance de messages d'erreur précis, la précision des avertissements, les recommandations relatives aux outils et les préoccupations concernant les modèles de langue sont explorées dans le débat, qui met l'accent sur la correction des vulnérabilités et le renforcement des normes de codage.",
      "La conversation examine également les inconvénients de l'utilisation de fonctions telles que strcpy et strlcpy en C, ainsi que l'utilisation des instructions \"goto\" et du contrôle de flux dans les anciens langages de programmation, en préconisant de tirer parti des caractéristiques des langages modernes pour améliorer la qualité du code."
    ],
    "points": 319,
    "commentCount": 102,
    "retryCount": 0,
    "time": 1712152468
  },
  {
    "id": 39922006,
    "title": "La percée de Terraform : Production de gaz naturel sans émission de carbone",
    "originLink": "https://terraformindustries.wordpress.com/2024/04/01/terraform-makes-carbon-neutral-natural-gas/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39922006",
    "commentBody": "",
    "originSummary": [
      "Terraform a créé un système produisant du gaz naturel synthétique à partir de la lumière du soleil et de l'air, le rendant neutre en carbone grâce à l'électrolyse de l'hydrogène, à la capture de l'air et aux technologies de méthanisation.",
      "Ce développement est une étape cruciale dans l'offre d'un gaz naturel rentable et sans fossile, qui atténue considérablement l'impact sur l'environnement.",
      "Cette technologie adapte les processus industriels aux énergies renouvelables, permettant une production efficace d'hydrogène vert et le piégeage du CO2, les réservations de systèmes de production étant désormais accessibles au public."
    ],
    "commentSummary": [
      "Terraform Industries est un pionnier de la production de gaz naturel neutre en carbone grâce à l'énergie solaire, qui s'attaque aux problèmes de stockage et de transport de l'énergie dans le secteur du gaz naturel.",
      "Les discussions analysent les compromis entre les sources d'énergie telles que le méthane et l'hydrogène, les technologies telles que le piégeage du carbone, et le passage à des options énergétiques durables dans différentes industries.",
      "Les conversations portent sur les fuites de méthane, l'efficacité du stockage de l'énergie à long terme et leur relation avec le réchauffement climatique et les émissions de gaz à effet de serre."
    ],
    "points": 314,
    "commentCount": 264,
    "retryCount": 0,
    "time": 1712172900
  },
  {
    "id": 39920644,
    "title": "Google présente Jpegli : une bibliothèque de codage JPEG plus rapide et plus efficace",
    "originLink": "https://opensource.googleblog.com/2024/04/introducing-jpegli-new-jpeg-coding-library.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39920644",
    "commentBody": "",
    "originSummary": [
      "Google a lancé une nouvelle bibliothèque de codage JPEG appelée Jpegli, qui permet d'améliorer de 35 % le taux de compression avec des paramètres de haute qualité.",
      "Jpegli est conçu pour être plus rapide, plus efficace et plus esthétique que le JPEG standard, en incorporant une heuristique de quantification adaptative et une sélection améliorée de la matrice de quantification.",
      "Les tests indiquent que Jpegli peut compresser des images de haute qualité plus efficacement que les codecs JPEG traditionnels, ce qui pourrait se traduire par une expérience Internet plus rapide et visuellement étonnante."
    ],
    "commentSummary": [
      "Google Zürich présente Jpegli, une nouvelle bibliothèque de codage JPEG, qui vise à améliorer la qualité des images et l'efficacité de la compression en utilisant les conventions de dénomination suisses allemandes.",
      "Les discussions portent notamment sur la comparaison de la qualité d'image avec différents codecs, l'évaluation de formats tels que AVIF et JPEG XL, ainsi que sur le choix de Google de ne pas inclure JPEG XL dans Chrome.",
      "Les utilisateurs envisagent d'intégrer Jpegli à WebAssembly pour élargir son utilisation, en mettant l'accent sur l'optimisation des formats actuels plutôt que sur la création d'un nouveau format, et en prenant en charge l'encodage à grande profondeur de bits."
    ],
    "points": 307,
    "commentCount": 200,
    "retryCount": 0,
    "time": 1712166696
  },
  {
    "id": 39915594,
    "title": "PyTorch's ipex-llm : Bibliothèque LLM compatible avec Intel",
    "originLink": "https://github.com/intel-analytics/ipex-llm",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39915594",
    "commentBody": "",
    "originSummary": [
      "Le projet bigdl-llm a été remplacé par ipex-llm, une bibliothèque PyTorch conçue pour exécuter LLM sur les processeurs Intel et les GPU avec une latence minimale.",
      "ipex-llm, basé sur Intel Extension for PyTorch, apporte une intégration transparente avec divers outils et modèles, offrant des optimisations et des options de réglage fin pour les modèles LLM sur le matériel Intel.",
      "Plus de 50 modèles sont optimisés sur ipex-llm, prenant en charge l'inférence à faible bit, le décodage auto-spéculatif et la compatibilité avec les bibliothèques communautaires, détaillées dans la documentation avec des repères, des échantillons de code et des guides d'installation ; les performances peuvent varier en fonction de l'utilisation et des configurations, en particulier sur les appareils non-Intel."
    ],
    "commentSummary": [
      "Les discussions sur GitHub soulignent le potentiel des CPU et des GPU d'Intel sur le marché des GPU par rapport à AMD et Nvidia, en mettant l'accent sur une capacité VRAM plus élevée à des prix compétitifs pour les charges de travail d'IA.",
      "La conversation suggère qu'Intel devrait se concentrer sur l'augmentation de la capacité VRAM dans ses lancements de GPU, l'optimisation des performances de la mémoire et la satisfaction de la demande des consommateurs pour une capacité de mémoire vive élevée à des prix abordables.",
      "Les participants se montrent optimistes quant au support logiciel et à la proposition de valeur d'Intel, prévoyant un avenir prometteur pour les GPU Intel par rapport à d'autres concurrents."
    ],
    "points": 290,
    "commentCount": 91,
    "retryCount": 0,
    "time": 1712140105
  },
  {
    "id": 39916144,
    "title": "Améliorer le développement avec LiveView et Svelte",
    "originLink": "https://blog.sequin.io/liveview-is-best-with-svelte/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39916144",
    "commentBody": "",
    "originSummary": [
      "L'article explore l'utilisation de LiveView avec Svelte dans le développement web, en montrant comment il permet un rendu côté serveur avec des composants avec état similaires aux SPAs sans avoir besoin d'un microservice frontal séparé à Sequin.",
      "L'équipe de Sequin a trouvé que LiveView était à la fois efficace et frustrant, ce qui l'a amenée à découvrir LiveSvelte comme une bibliothèque complémentaire pour un processus de développement plus fluide.",
      "LiveSvelte combine l'état et les transitions d'état dans le frontend de manière transparente, en fournissant une séparation claire entre le frontend et le backend, en exploitant le cadre léger et rapide du frontend de Svelte, idéal pour les utilisateurs de LiveView."
    ],
    "commentSummary": [
      "La discussion porte sur l'utilisation de LiveView et de Svelte pour les jeux vidéo multijoueurs, couvrant le code client prédictif et les concepts de synchronisation du serveur.",
      "Il explore les défis, les avantages et les améliorations de la conception des jeux, tout en discutant des performances d'Elixir pour la logique des jeux et de l'impact des environnements d'exécution sur les applications web.",
      "La conversation mentionne également des outils et des cadres pour la gestion des états, montrant le potentiel et la complexité de l'utilisation de LiveView et de Svelte dans le développement web."
    ],
    "points": 274,
    "commentCount": 137,
    "retryCount": 0,
    "time": 1712144477
  },
  {
    "id": 39917547,
    "title": "Projet de cartographie des fonds marins : 25% de réalisation, il reste 6 ans",
    "originLink": "https://eos.org/articles/new-seafloor-map-only-25-done-with-6-years-to-go",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39917547",
    "commentBody": "",
    "originSummary": [
      "Seabed 2030 est un projet dont la mission est de cartographier complètement les fonds marins d'ici à 2030. À l'heure actuelle, seuls 25 % des cartes ont été réalisées.",
      "Le projet utilise les données fournies et les collaborations pour faire de nouvelles découvertes, comme les grands monts sous-marins, en tirant parti des données satellitaires et des technologies de pointe.",
      "Pour accélérer le processus de cartographie, Seabed 2030 intègre des véhicules autonomes et l'intelligence artificielle, dans le but de soutenir les objectifs de développement durable et de renforcer la sensibilisation aux défis marins."
    ],
    "commentSummary": [
      "La discussion porte sur la cartographie des fonds marins, l'utilisation militaire, les aspects historiques et les dilemmes éthiques de l'exploitation minière en eaux profondes.",
      "Il explore l'importance de la cryptographie de précision, les effets de la gravité sur la précision des missiles et les impacts environnementaux de l'exploitation minière des fonds marins.",
      "Il aborde également les prouesses cartographiques de la marine américaine, le secret des sous-marins et les défis posés par la précision de la cartographie des fonds marins."
    ],
    "points": 238,
    "commentCount": 130,
    "retryCount": 0,
    "time": 1712152626
  },
  {
    "id": 39918500,
    "title": "Plandex : Moteur de codage d'IA à code source ouvert",
    "originLink": "https://github.com/plandex-ai/plandex",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39918500",
    "commentBody": "",
    "originSummary": [
      "Plandex est un moteur de codage d'IA open-source conçu pour les tâches complexes, avec une intégration transparente avec l'API OpenAI, le contrôle des versions, le sandboxing et l'examen des différences.",
      "Écrit en Go, il simplifie le chargement de fichiers, l'exécution de tâches et la soumission d'invites dans le terminal grâce à une option d'installation rapide en une ligne.",
      "Les utilisateurs peuvent s'engager en donnant leur avis, en contribuant via Discord ou en soumettant des demandes de retrait pour le projet."
    ],
    "commentSummary": [
      "Plandex est un moteur de codage IA open-source pour les tâches complexes, qui met l'accent sur la gestion des cas limites et des échecs, écrit en Go en tant qu'outil CLI.",
      "Les utilisateurs peuvent exécuter des tâches en arrière-plan, gérer les tâches en cours et se connecter pour la diffusion en continu, avec l'intégration de git, le contrôle de version, les mises à jour en bac à sable et une interface d'examen des différences.",
      "Les discussions portent sur l'utilisation de Plandex pour l'édition de code et les tests automatisés, mentionnent le projet Sweep en tant que modèle de langage similaire à GH Copilot, et partagent des expériences avec divers modèles et outils pour les tâches de codage."
    ],
    "points": 234,
    "commentCount": 77,
    "retryCount": 0,
    "time": 1712157011
  },
  {
    "id": 39916102,
    "title": "La Maison Blanche propose un horaire lunaire coordonné pour les missions sur la Lune",
    "originLink": "https://www.bbc.co.uk/news/science-environment-68722032",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39916102",
    "commentBody": "",
    "originSummary": [
      "La Maison Blanche a chargé la NASA de développer un nouveau fuseau horaire, le Coordinated Lunar Time (LTC), pour la Lune, en raison de la différence de champ gravitationnel qui fait que le temps y passe plus vite.",
      "LTC vise à synchroniser les missions des engins spatiaux sur la Lune, car les horloges atomiques de la Terre tournent plus vite sur la Lune, ce qui pose un problème de synchronisation pour les missions.",
      "Plusieurs pays et organisations collaborent à la mise en place de LTC d'ici 2026 pour la mission lunaire habitée des États-Unis, cruciale pour une communication et une navigation efficaces dans l'espace."
    ],
    "commentSummary": [
      "La Maison Blanche envisage l'introduction d'un fuseau horaire unique, le Coordinated Lunar Time (CLT), pour la Lune afin de réduire la dépendance à l'égard des horloges terrestres, en utilisant éventuellement des horloges atomiques pour l'enregistrement des événements célestes.",
      "Des discussions sont en cours pour renommer le temps universel coordonné (UTC) et établir une norme de temps universelle, explorer la dilatation du temps dans le cadre de la relativité restreinte et de la relativité générale, et avoir un impact sur les voyages spatiaux et les interactions gravitationnelles.",
      "Les défis posés par la normalisation du temps dans différents cadres de référence, l'ajustement des constantes physiques et la nécessité d'un chronométrage précis des activités lunaires sont des éléments clés pour comprendre les concepts complexes de la dilatation du temps, de la gravité et de la vitesse de la lumière."
    ],
    "points": 211,
    "commentCount": 238,
    "retryCount": 0,
    "time": 1712144206
  },
  {
    "id": 39917551,
    "title": "Un \"mini-foie\" révolutionnaire cultivé dans un ganglion lymphatique pourrait offrir un espoir pour l'insuffisance hépatique",
    "originLink": "https://www.nature.com/articles/d41586-024-00975-z",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39917551",
    "commentBody": "",
    "originSummary": [
      "LyGenesis a injecté des cellules hépatiques dans le ganglion lymphatique d'une personne, dans le but de développer un \"mini-foie\" pour aider les patients souffrant d'insuffisance hépatique, offrant ainsi une solution temporaire aux patients transplantés.",
      "Cette technique innovante, qui a fait ses preuves chez l'animal, cible les personnes qui ne peuvent bénéficier d'une greffe de foie standard, et prévoit de s'étendre aux cellules du rein et du pancréas présentes dans les ganglions lymphatiques, ce qui pourrait éliminer la nécessité de recourir à des médicaments immunosuppresseurs.",
      "Cette méthode pionnière pourrait révolutionner la thérapie cellulaire en produisant des cellules personnalisées reflétant la diversité du foie, ce qui constituerait une alternative prometteuse à la transplantation conventionnelle."
    ],
    "commentSummary": [
      "Un nouvel essai consiste à injecter des cellules hépatiques saines dans le ganglion lymphatique d'une personne afin de développer un \"mini-foie\" pour traiter l'insuffisance hépatique.",
      "Des recherches sont en cours sur l'utilisation de cellules souches pour créer des cellules hépatiques personnalisées en vue d'une transplantation, mais elles se heurtent à des difficultés pour garantir le bon type de cellules et répondre aux préoccupations en matière de sécurité.",
      "L'utilisation des ganglions lymphatiques pour des transplantations décentralisées d'organes et la création de mini-organes pour des fonctions de secours suscitent de plus en plus d'intérêt dans le domaine médical."
    ],
    "points": 194,
    "commentCount": 47,
    "retryCount": 0,
    "time": 1712152642
  },
  {
    "id": 39915473,
    "title": "Redis Fork Redict 7.3.0 : Une alternative stable, pilotée par la communauté",
    "originLink": "https://redict.io/posts/2024-04-03-redict-7.3.0-released/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39915473",
    "commentBody": "",
    "originSummary": [
      "Redict 7.3.0 est maintenant disponible, offrant une version stable d'un copyleft fork de Redis® OSS 7.2.4.1, mettant l'accent sur la stabilité et le développement par la communauté.",
      "Protégé par la Lesser GNU General Public License, Redict vise à prévenir l'exploitation et à promouvoir les solutions de logiciels libres dans l'infrastructure.",
      "Les mises à jour prévues comprennent la modernisation du système de construction, le forçage de l'écosystème, l'amélioration de la documentation et l'accueil des contributions de la communauté afin de s'établir comme une alternative fiable à Redis®."
    ],
    "commentSummary": [
      "Redict 7.3.0, une version copyleft de Redis, suscite des discussions au sein de la communauté sur la stabilité et la maintenance à long terme.",
      "Les débats portent sur les pratiques en matière de licences, les préoccupations de Redis Labs en matière de commercialisation, les licences LGPL, les marques déposées, les droits des contributeurs et l'équilibre entre les principes de l'open source et les préoccupations commerciales.",
      "Les comparaisons entre les projets de logiciels libres, les conditions de licence et l'évolution du paysage des logiciels libres font partie de la conversation."
    ],
    "points": 191,
    "commentCount": 165,
    "retryCount": 0,
    "time": 1712139001
  },
  {
    "id": 39921964,
    "title": "MOnSter 6502 : Réplique à l'échelle du transistor du MOS 6502",
    "originLink": "https://monster6502.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39921964",
    "commentBody": "",
    "originSummary": [
      "Le projet MOnSter 6502 vise à reproduire le microprocesseur MOS 6502, célèbre pour son rôle dans d'importants systèmes informatiques.",
      "Composée de 4769 éléments, dont 3218 transistors et 1019 résistances, la réplique fonctionne à une vitesse réduite par rapport à la puce originale et comporte de nouveaux éléments tels que des diodes électroluminescentes.",
      "Bien qu'il ne soit pas encore commercialisable, le projet, en cours depuis environ 8 ans, se prépare à faire ses débuts publics en 2023, en proposant des démonstrations aux Evil Mad Scientist Laboratories à Sunnyvale, en Californie."
    ],
    "commentSummary": [
      "Le MOnSter 6502 est une réplique fonctionnelle à l'échelle du transistor du microprocesseur MOS 6502, fonctionnant plus lentement en raison d'une capacité accrue, mettant en évidence une technologie informatique plus ancienne et l'utilisation de transistors dans les premiers processeurs.",
      "Les conversations tournent autour de l'intégration de la puce 6502 dans les ordinateurs classiques tels que l'Apple ][, en se concentrant sur le dépassement des obstacles liés à la mémoire et à la sortie vidéo, avec des discussions sur le réglage des vitesses d'horloge, l'affichage et l'émulation du processeur.",
      "Ce projet est considéré comme un mélange d'art et de progrès technologique historique, présentant une combinaison unique de créativité et d'importance historique."
    ],
    "points": 181,
    "commentCount": 70,
    "retryCount": 0,
    "time": 1712172698
  }
]
