[
  {
    "id": 37297304,
    "title": "ChatGPT Enterprise",
    "originLink": "https://openai.com/blog/introducing-chatgpt-enterprise",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37297304",
    "commentBody": "",
    "originSummary": [
      "OpenAI চ্যাটজিপিটি এন্টারপ্রাইজ চালু করেছে, একটি নতুন প্ল্যাটফর্ম যা উন্নত নিরাপত্তা, গোপনীয়তা, দ্রুত প্রক্রিয়াকরণ, দীর্ঘ প্রসঙ্গ উইন্ডো এবং ডেটা বিশ্লেষণ ক্ষমতা সরবরাহ করে।",
      "প্ল্যাটফর্মটি, যা ফরচুন 500 সংস্থার 80% এরও বেশি দ্বারা অনুকূলভাবে গৃহীত হয়, জিপিটি -4 (একটি উন্নত এআই মডেল) এর সম্পূর্ণ অ্যাক্সেস সরবরাহ করে এবং সংস্থাগুলিকে ডেটা গোপনীয়তার সাথে আপস না করে কাস্টম এআই সহকারী মোতায়েন করার ক্ষমতা দেয়।",
      "ওপেনএআই ডেটা গোপনীয়তাকে মূল্য দেয়, সংকেত দেয় যে চ্যাটজিপিটি এন্টারপ্রাইজ এসওসি 2 অনুগত এবং এনক্রিপ্টেড কথোপকথন সরবরাহ করে, ভবিষ্যতে অতিরিক্ত বৈশিষ্ট্য গুলি চালু করার পরিকল্পনা করে।"
    ],
    "commentSummary": [
      "চলমান সংলাপ ব্যবসায়িক সেটিংসে ওপেনএআই-এর চ্যাটজিপিটি ব্যবহারের চারপাশে ঘোরে, ডেটা গোপনীয়তা, সম্ভাব্য বৌদ্ধিক সম্পত্তি লঙ্ঘন এবং সরঞ্জামের কার্যকারিতা সম্পর্কে উল্লেখযোগ্য উদ্বেগ সহ।",
      "ওপেনএআই কিছু সমস্যা সমাধানের জন্য চ্যাটজিপিটির একটি এন্টারপ্রাইজ সংস্করণ চালু করেছে, তবে সন্দেহ রয়ে গেছে এবং এআই-উত্পাদিত সামগ্রীর আইনী পরিণতি এবং সম্ভাব্য বাণিজ্যিক অ্যাপ্লিকেশনগুলির মতো চ্যালেঞ্জগুলিও আলোচনা করা হচ্ছে।",
      "ওপেনএআই এবং মাইক্রোসফ্টের মধ্যে সম্পর্ক সম্পর্কে ক্রমবর্ধমান জল্পনা রয়েছে, উভয়ই ব্যবসায়ের জন্য এআই সরঞ্জাম সরবরাহ করে এবং মেশিন লার্নিং-জেনারেটেড আউটপুটের কপিরাইটযোগ্যতার প্রশ্নটিও চ্যাটজিপিটির মতো এআই মডেলগুলির চারপাশের অস্পষ্টতায় অবদান রাখে।"
    ],
    "points": 752,
    "commentCount": 416,
    "retryCount": 0,
    "time": 1693242587
  },
  {
    "id": 37297823,
    "title": "যখন আপনার সহপাঠীরা আপনাকে অপরাধমূলক অভিযোগ ের হুমকি দেয়",
    "originLink": "https://miles.land/posts/classmates-legal-threat-fizz-defcon/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37297823",
    "commentBody": "",
    "originSummary": [
      "লেখক একটি সামাজিক মিডিয়া অ্যাপ, ফিজ-এ একটি নিরাপত্তা ত্রুটি আবিষ্কার করেছেন এবং দায়িত্বশীলভাবে এটি প্রকাশ করেছেন, কেবল আইনী হুমকির মুখোমুখি হওয়ার জন্য।",
      "তারা আইনী প্রতিনিধিত্ব চেয়ে সন্তোষজনকভাবে পরিস্থিতি সমাধান করতে সক্ষম হয়েছিল।",
      "লেখক তুলনামূলক উদাহরণগুলির জন্য তিনটি অপরিহার্য পাঠ সরবরাহ করেছেন: গবেষণাটি সম্পূর্ণরূপে নথিভুক্ত করা, হুমকির অধীনে থাকা এবং প্রয়োজনে আইনী সহায়তা সংগ্রহ করা।"
    ],
    "commentSummary": [
      "অনুচ্ছেদটি অনুমোদিত নিরাপত্তা গবেষণা, অনুপ্রবেশ পরীক্ষা, কর্মসংস্থান চুক্তি এবং আইনি হুমকির বৈধতা এবং নৈতিকতা সম্পর্কিত বিতর্ক এবং বিতর্ককে তুলে ধরেছে।",
      "কম্পিউটার জালিয়াতি এবং অপব্যবহার আইন (সিএফএএ), উদ্দেশ্যের ধারণা, উপকারী সুরক্ষা গবেষণা, ইলেকট্রনিক ফ্রন্টিয়ার ফাউন্ডেশন (ইএফএফ) এর অবদান এবং এই ক্ষেত্রে দ্ব্যর্থহীন আইনি কাঠামো এবং নিয়ন্ত্রণের প্রয়োজনীয়তার উপর যথেষ্ট ফোকাস রাখা হয়েছে।",
      "এই বিষয়গুলিতে মিশ্র দৃষ্টিভঙ্গি এবং নৈতিক আচরণ এবং অননুমোদিত অনুশীলনের মধ্যে অস্পষ্ট সীমানা তুলে ধরা হয়েছে।"
    ],
    "points": 438,
    "commentCount": 297,
    "retryCount": 0,
    "time": 1693244792
  },
  {
    "id": 37292041,
    "title": "কমিউনিটি নোট সম্পর্কে আমি কি ভাবছি?",
    "originLink": "https://vitalik.ca/general/2023/08/16/communitynotes.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37292041",
    "commentBody": "",
    "originSummary": [
      "টুইটারের কমিউনিটি নোটস বৈশিষ্ট্যটি একটি ফ্যাক্ট-চেকিং সরঞ্জাম যা একটি ওপেন-সোর্স অ্যালগরিদমের মাধ্যমে পরিচালিত ভুল তথ্যের বিরুদ্ধে লড়াই করার জন্য টুইটগুলিতে প্রসঙ্গ নোট সংযুক্ত করে যা এই নিবন্ধে বিস্তারিতভাবে আলোচনা করা হয়েছে।",
      "নিবন্ধটি এই অ্যালগরিদমের মেকানিক্সে প্রবেশ করে, যা বিভিন্ন ব্যবহারকারীর দৃষ্টিকোণ থেকে ইতিবাচক রেটিংসহ নোটগুলিকে অগ্রাধিকার দেয়, নোটের কার্যকারিতা নির্ধারণে \"মেরুতা\" মানগুলির ধারণার চারপাশে ঘোরে।",
      "এই নিবন্ধটি কেন্দ্রীভূত ম্যানিপুলেশন সম্পর্কে উদ্বেগগুলিও সম্বোধন করে, কমিউনিটি নোটগুলির শিক্ষাগত মূল্যের উপর জোর দেয় এবং সম্পূর্ণ বিকেন্দ্রীকরণের অভাব স্বীকার করা সত্ত্বেও এর সম্ভাব্য বৃদ্ধি এবং বিকাশের পক্ষে সমর্থন করে।"
    ],
    "commentSummary": [
      "টুইটারের কমিউনিটি নোট সিস্টেম, অনলাইন ভোটিং মেকানিজম, রাজনৈতিক মেরুকরণ, দক্ষতা ও বিশ্বাস, সোশ্যাল মিডিয়া প্ল্যাটফর্মের উপর সেন্সরশিপ এবং ক্ষতিকারক অনলাইন কনটেন্টের উপর মন্তব্যের প্রাথমিক ফোকাস।",
      "এই আলোচনাগুলি ব্যাপকভাবে বিপরীত মতামতকে প্রতিফলিত করে এবং এই বিষয়গুলির বহুমুখী এবং চ্যালেঞ্জিং প্রকৃতিকে তুলে ধরে অসংখ্য উদ্বেগ উপস্থাপন করে।",
      "এই দিকগুলি নিয়ে আলোচনা করে, ভাষ্যকাররা সমসাময়িক অনলাইন সমস্যাগুলি উপলব্ধি এবং সমাধান করার চেষ্টা করছেন।"
    ],
    "points": 374,
    "commentCount": 199,
    "retryCount": 0,
    "time": 1693218449
  },
  {
    "id": 37296401,
    "title": "আমাজন ফিগ কিনে নিয়েছে",
    "originLink": "https://fig.io/blog/post/fig-joins-aws",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37296401",
    "commentBody": "",
    "originSummary": [
      "ডেভেলপারদের জন্য সরঞ্জাম তৈরির একটি সংস্থা ফিগ, ক্লাউড কম্পিউটিং পরিষেবা সরবরাহকারী অ্যামাজনের একটি সহায়ক সংস্থা অ্যামাজন ওয়েব সার্ভিসেস (এডাব্লুএস) দ্বারা অধিগ্রহণ করা হয়েছে।",
      "Fig-এর বর্তমান ব্যবহারকারীরা সমর্থন পেতে থাকবে, এবং প্রদত্ত দলের বৈশিষ্ট্যগুলি বিনামূল্যে উপলব্ধ হবে।",
      "এই অধিগ্রহণের তাত্ক্ষণিক প্রভাব হিসাবে, ফিগের পণ্যগুলির জন্য নতুন ব্যবহারকারী নিবন্ধনগুলি স্থগিত করা হয়েছে কারণ সংস্থাটি বর্তমান ক্লায়েন্টদের জন্য তার পণ্যগুলি অপ্টিমাইজ করতে এবং এডাব্লুএসের সাথে তার সংহতকরণ পরিচালনা করার লক্ষ্য রাখে।"
    ],
    "commentSummary": [
      "অ্যামাজন ফিগকে অধিগ্রহণ করেছে, এমন একটি সরঞ্জাম যা কমান্ড লাইন ইন্টারফেসের জন্য স্বয়ংক্রিয় সরবরাহ করে, যা পণ্যটির ভবিষ্যত সম্পর্কে বিতর্ক ের সূত্রপাত করে।",
      "অধিগ্রহণের পর থেকে ব্যবহারকারীরা ফিগের সাবস্ক্রিপশন মডেল এবং ডেটা গোপনীয়তা নিয়ে প্রশ্ন তুলছেন এবং ওপেন সোর্স বিকল্পগুলির প্রয়োজনীয়তার দিকে মনোযোগ আকর্ষণ করছেন।",
      "অধিগ্রহণনিয়ে সম্প্রদায়টি বিভক্ত, কেউ কেউ সম্ভাব্য উন্নতির পূর্বাভাস দিয়েছে, অন্যরা ফিগের ভবিষ্যত সম্পর্কে সন্দেহ এবং উদ্বেগ প্রকাশ করেছে।"
    ],
    "points": 355,
    "commentCount": 170,
    "retryCount": 0,
    "time": 1693239227
  },
  {
    "id": 37295097,
    "title": "২০২৩ সালে ওপেনটেলিমেট্রি",
    "originLink": "https://bit.kevinslin.com/p/opentelemetry-in-2023",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37295097",
    "commentBody": "",
    "originSummary": [
      "ওপেনটেলিমেট্রি (ওটিইএল) ২০১৯ সালে দুটি ওপেন-সোর্স ট্রেসিং প্রকল্পের একীকরণ হিসাবে প্রতিষ্ঠিত হয়েছিল, যার লক্ষ্য সংস্থাগুলির জন্য শীর্ষ স্থানীয় টেলিমেট্রি সরবরাহ করা।",
      "ক্লাউড নেটিভ কম্পিউটিং ফাউন্ডেশনে (সিএনসিএফ) দ্বিতীয় সর্বাধিক সক্রিয় ওটিইএল-এর অবজারভেবিলিটি সরবরাহকারীদের মধ্যে ব্যাপক গ্রহণযোগ্যতা রয়েছে এবং মেট্রিক্স, লগ, ট্রেস এবং এজেন্ট ম্যানেজমেন্টের জন্য স্পেসিফিকেশন এবং বাস্তবায়ন রয়েছে।",
      "বিস্তৃত এবং ব্যাপকভাবে ব্যবহৃত, এটি জনপ্রিয় ভাষাগুলিতে ইনস্ট্রুমেন্টিং কোডের জন্য একটি এসডিকে সরবরাহ করে এবং ভবিষ্যতের সম্প্রসারণ এবং উন্নতির পরিকল্পনাসহ টেলিমেট্রি গ্রহণ এবং রফতানির জন্য একটি সংগ্রাহক সরবরাহ করে।"
    ],
    "commentSummary": [
      "আলোচনাটি ওপেনটেলিমেট্রি সম্পর্কিত, অ্যাপ্লিকেশনগুলির অবজারভেবিলিটি বাড়ানোর জন্য একটি সফ্টওয়্যার সরঞ্জাম, ব্যয়-কার্যকারিতা এবং বৃহত ডেটা পরিচালনার মতো এর উপকারিতা এবং জটিলতা এবং অস্পষ্ট সংজ্ঞার মতো অসুবিধাগুলি তুলে ধরে।",
      "আলোচিত মূল বিষয়গুলির মধ্যে রয়েছে ট্রেস দেখা, রুট স্প্যান, নমুনা, ত্রুটি ট্রেসিং, সিস্টেম ওভারলোড, এসকিউএল ব্যবহার এবং স্ব-হোস্টেড সমাধান, সরঞ্জামের ব্যবহারযোগ্যতা এবং দক্ষতার বিভিন্ন দৃষ্টিভঙ্গি চিত্রিত করে।",
      "অংশগ্রহণকারীরা ওপেনটেলিমেট্রির বিকল্পগুলিও অন্বেষণ করে, ইভেন্ট ট্রেসিং, লগ এবং বিভিন্ন সরঞ্জাম এবং প্রযুক্তির সুবিধা এবং অসুবিধাগুলি নিয়ে আলোচনা করে।"
    ],
    "points": 320,
    "commentCount": 220,
    "retryCount": 0,
    "time": 1693234689
  },
  {
    "id": 37292321,
    "title": "নতুন ছবি ও ভিডিও নিশ্চিত করেছে যে অস্টিনের তৈরি টেসলা মডেল ওয়াই সামনের কাস্টিংয়ে ফাটল ধরেছে",
    "originLink": "https://www.autoevolution.com/news/new-images-and-video-confirm-austin-made-tesla-model-y-has-cracked-front-casting-220165.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37292321",
    "commentBody": "",
    "originSummary": [
      "অস্টিনে নির্মিত টেসলা মডেল ওয়াই-এর একজন মালিক ডেলিভারির দুই মাস পরে একটি ক্র্যাকড ফ্রন্ট কাস্টিং সমস্যা আবিষ্কার করেছিলেন, যা মান নিয়ন্ত্রণের বিষয়গুলিতে মনোযোগ আকর্ষণ করেছিল।",
      "একই মালিক তাদের গাড়িতে একটি অনুপস্থিত ব্রেক ফ্লুইড জলাধার ক্যাপও খুঁজে পেয়েছেন, যা একটি উল্লেখযোগ্য সুরক্ষা উদ্বেগ হতে পারে।",
      "মালিক, যিনি এই বিষয়ে টেসলার কাছ থেকে যথাযথ প্রতিক্রিয়া পাননি, তিনি অন্যান্য মডেল ওয়াই মালিকদের তাদের গাড়িগুলি পরিদর্শন করার জন্য অনুরোধ করেছেন এবং টেসলাকে সমাধানের ডকুমেন্টেশন সরবরাহ করার জন্য অনুরোধ করেছেন।"
    ],
    "commentSummary": [
      "অস্টিনে নির্মিত টেসলা মডেল ওয়াই গাড়ির নির্ভরযোগ্যতা নিয়ে উদ্বেগ রয়েছে, চিত্র এবং ভিডিওগুলি ক্র্যাকফ্রন্ট কাস্টিং প্রকাশ করে।",
      "আলোচনায় টেসলার গ্রাহক পরিষেবা, ত্রুটিগুলির প্রতি কোম্পানির প্রতিক্রিয়া এবং আমেরিকান এবং ইউরোপীয় গাড়ি নির্মাতাদের মধ্যে বিল্ড কোয়ালিটির অনুভূত পার্থক্য অন্তর্ভুক্ত রয়েছে।",
      "এই বিষয়গুলি ঘিরে বিস্তৃত প্রভাবগুলি টেসলার ব্র্যান্ডখ্যাতিকে বাধা দেয়, অন্যান্য বিলাসবহুল অটো ব্র্যান্ডের তুলনায় তাদের গুণমান নিয়ন্ত্রণ, উত্পাদন পদ্ধতি এবং উচ্চতর ত্রুটির হার সম্পর্কিত উদ্বেগের সাথে।"
    ],
    "points": 317,
    "commentCount": 275,
    "retryCount": 0,
    "time": 1693221045
  },
  {
    "id": 37294793,
    "title": "একটি অপ্রত্যাশিত আবিষ্কার যা 20 গিগাবাইট অব্যবহৃত ইনডেক্স স্পেস মুক্ত করেছে (2021)",
    "originLink": "https://hakibenita.com/postgresql-unused-index-size",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37294793",
    "commentBody": "",
    "originSummary": [
      "নিবন্ধটি পোস্টগ্রেএসকিউএল ডাটাবেস অপ্টিমাইজেশান কৌশলগুলির উপর দৃষ্টি নিবদ্ধ করে যেমন ইনডেক্স ডিডুপ্লিকেশন, টেবিল পুনর্নির্মাণ, আংশিক সূচক ব্যবহার করা এবং বিদেশী কীগুলিতে অপ্রয়োজনীয় সূচক তৈরি রোধ করা।",
      "লেখক তাদের ব্যক্তিগত অভিজ্ঞতা ভাগ করেছেন, যেখানে এই পদ্ধতিগুলি প্রায় 70 গিগাবাইট অতিরিক্ত স্থান মুক্ত করতে সহায়তা করেছে।",
      "আংশিক সূচকগুলিতে বিশেষ ফোকাস দেওয়া হয়, কেবল তাদের কর্মক্ষমতা বাড়ানোর ক্ষমতার জন্য নয়, স্টোরেজ স্পেস সংরক্ষণে তাদের ভূমিকার জন্যও; জাঙ্গো ওআরএম ব্যবহার করে বাস্তবায়ন প্রক্রিয়াটিও কভার করা হয়েছে।"
    ],
    "commentSummary": [
      "নিবন্ধটি পোস্টগ্রেএসকিউএল-এ অব্যবহৃত ইনডেক্স স্পেসের বিষয়টি অনুসন্ধান করে, অতিরিক্ত স্টোরেজ ক্রয় বা বর্তমান সূচকের আকার অপ্টিমাইজ করার উপকারিতা এবং অসুবিধাগুলি নিয়ে বিতর্ক করে।",
      "শিল্প পেশাদাররা হার্ডওয়্যার বিনিয়োগ এবং দক্ষতার মধ্যে ট্রেড-অফকে সম্বোধন করার সময় ব্যয় সাশ্রয় এবং বর্ধিত কর্মক্ষমতা সহ ইনডেক্সিং এবং অপ্টিমাইজেশনের সম্ভাব্য সুবিধাগুলি সম্পর্কে অন্তর্দৃষ্টি ভাগ করে নেন।",
      "উল্লিখিত বিষয়গুলির মধ্যে রয়েছে ইনডেক্সিং দক্ষতাকে প্রভাবিত করে এমন কারণগুলি, যেমন ওভারহেড এবং ডিস্ক আই / ও অপেক্ষার সময়গুলি লক করা এবং অপ্রয়োজনীয় সূচকগুলি সনাক্ত করণ এবং হ্রাস করার জন্য বিভিন্ন সরঞ্জাম এবং পদ্ধতি।"
    ],
    "points": 277,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1693233724
  },
  {
    "id": 37293002,
    "title": "আমার মা ধীরে ধীরে দৃষ্টিশক্তি হারাচ্ছেন, কীভাবে প্রস্তুতি নেবেন?",
    "originLink": "https://news.ycombinator.com/item?id=37293002",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37293002",
    "commentBody": "",
    "originSummary": [
      "একজন ব্যবহারকারী তাদের বড় মাকে সহায়তা করার জন্য ব্যবহারকারী-বান্ধব এবং অ-প্রযুক্তিগত পদ্ধতিগুলি সন্ধান করেন, যিনি ডিজেনারেটিভ চোখের সমস্যায় ভুগছেন তবে আরও স্বাচ্ছন্দ্যে পড়ার জন্য উত্সাহী পাঠক হিসাবে রয়েছেন।",
      "ব্যবহারকারী তার ই-রিডারে ফন্টের আকার বাড়ানোর উপায়গুলিতে আগ্রহী, যা তার পক্ষে পড়া সহজ করে তোলে।",
      "ব্যবহারকারী তার দৃষ্টি প্রতিবন্ধকতা সত্ত্বেও অনলাইন সাহিত্য কুইজের অব্যাহত উপভোগকে সহজতর করার উপায়গুলিও সন্ধান করে।"
    ],
    "commentSummary": [
      "আলোচনাটি দৃষ্টিপ্রতিবন্ধী ব্যক্তিদের জন্য বিভিন্ন সহায়তা এবং সমাধানযেমন অডিও সমাধান, ভয়েস-নিয়ন্ত্রিত ডিভাইস, স্পর্শকাতর প্রতিক্রিয়া এবং এনএফসি / আরএফআইডি স্টিকার এবং ম্যাগনিফাইং লেন্সগুলির মতো সহায়ক প্রযুক্তির উপর দৃষ্টি নিবদ্ধ করে।",
      "ব্রেইল শেখার গুরুত্ব, অডিওবুক ব্যবহার, পুনর্বাসন কেন্দ্রগুলি অন্বেষণ, আমেরিকান কাউন্সিল ফর দ্য ব্লাইন্ডের মতো সংস্থার কাছ থেকে সমর্থন চাওয়া এবং ইতিবাচক মনোভাব এবং ধৈর্য বজায় রাখার গুরুত্ব তুলে ধরা হয়েছে।",
      "পোস্টটি নির্দিষ্ট চোখের অবস্থা এবং চিকিত্সা, নতুন ডিভাইসে রূপান্তরের চ্যালেঞ্জ, অ্যাক্সেসযোগ্যতা সেটিংসের জটিলতা এবং ব্যক্তিগত প্রশিক্ষণ, বিকল্প ডিভাইস, ডায়েট এবং কাস্টম অনুশীলনের পরামর্শ দেয়।"
    ],
    "points": 235,
    "commentCount": 123,
    "retryCount": 0,
    "time": 1693225881
  },
  {
    "id": 37298506,
    "title": "অ্যাপল এম 1 / এম 2 এর জন্য সিরিয়াল অ্যাডাপ্টার / রিবুট কন্ট্রোলার",
    "originLink": "https://www.tindie.com/products/aaafnraa/serial-adapter-reboot-controller-for-apple-m1m2/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37298506",
    "commentBody": "",
    "originSummary": [
      "সেন্ট্রাল স্কুইটারিং একটি সিরিয়াল অ্যাডাপ্টার এবং রিবুট কন্ট্রোলার যা বিশেষত অ্যাপল এম 1 / এম 2 মেশিনের জন্য ডিজাইন করা হয়েছে, ডেভেলপারদের একটি নিম্ন-স্তরের ডিবাগিং পোর্ট সরবরাহ করে।",
      "এতে এম 1 এন 1 বুটলোডার ব্যবহার করে বুট করার জন্য একটি ইউএসবি 2.0 পাস-থ্রু অন্তর্ভুক্ত রয়েছে এবং পরিচালনাকরার জন্য একটি সোল্ডারড-অন রাস্পবেরি-পাই পিকো প্রয়োজন।",
      "এই ডিভাইসের হার্ডওয়্যার এবং সফ্টওয়্যার ওপেন-সোর্স, এবং এটি বিভিন্ন শিপিং বিকল্পগুলির সাথে অনুরোধে একটি পিকো দিয়ে একত্রিত করা যেতে পারে।"
    ],
    "commentSummary": [
      "নিবন্ধটি অ্যাপল এম 1 / এম 2 ডিভাইসের জন্য বিশেষভাবে ডিজাইন করা একটি অভিনব সিরিয়াল অ্যাডাপ্টার / রিবুট কন্ট্রোলার সম্পর্কে বিশদভাবে বর্ণনা করে।",
      "অ্যাডাপ্টারটি 20 ডলার খরচ করে, ইউএসবি-সি সংযোগকারীতে সাধারণত ফোন-এক্সক্লুসিভ সিরিয়াল পোর্টে অ্যাক্সেসের অনুমতি দেয়, এটি নিম্ন-স্তরের বুটলোডারের কাজ এবং অ্যাপল এম-চিপ ইকোসিস্টেমের আরও বিকাশের জন্য একটি শক্তিশালী সরঞ্জাম করে তোলে।",
      "অ্যাডাপ্টারের সম্ভাব্য অ্যাপ্লিকেশনগুলির মধ্যে নির্দিষ্ট দেশে শিপিং সম্পর্কিত উল্লিখিত চ্যালেঞ্জ গুলি সত্ত্বেও শাটডাউন ডিভাইসগুলির পাওয়ারিং অন্তর্ভুক্ত রয়েছে।"
    ],
    "points": 225,
    "commentCount": 30,
    "retryCount": 0,
    "time": 1693247367
  },
  {
    "id": 37297751,
    "title": "ত্রুটিযুক্ত ইয়ারপ্লাগের জন্য 300 হাজার মামলা নিষ্পত্তি করতে 3 এম $ 5.5 বিলিয়ন প্রদান করছে",
    "originLink": "https://qz.com/3m-is-paying-5-5-billion-to-resolve-300-000-lawsuits-o-1850780085",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37297751",
    "commentBody": "",
    "originSummary": [
      "মার্কিন সামরিক বাহিনীর কাছে ত্রুটিপূর্ণ যুদ্ধবিমান বিক্রির অভিযোগে প্রায় তিন লাখ মামলা নিষ্পত্তির জন্য ৫৫০ কোটি ডলার ের বেশি অর্থ দেবে বিখ্যাত সরঞ্জাম নির্মাতা প্রতিষ্ঠান থ্রিএম।",
      "মামলায় অভিযোগ করা হয়েছে যে থ্রিএম জানত যে তাদের ইয়ারপ্লাগগুলি পর্যাপ্ত সুরক্ষা প্রদানের জন্য খুব ছোট ছিল তবে সরকার বা ব্যবহারকারীদের এটি সম্পর্কে অবহিত করেনি।",
      "নিষ্পত্তি না হলে থ্রিএমের সম্ভাব্য দায় ৯.৫ বিলিয়ন ডলার ছাড়িয়ে যেতে পারত। \"চিরকালের রাসায়নিকের\" উপর দাবি নিষ্পত্তি করার জন্য জুনমাসে থ্রিএম কর্তৃক 10.3 বিলিয়ন ডলার প্রদান ের পরে এটি করা হয়েছিল।"
    ],
    "commentSummary": [
      "ক্ষতিকারক শব্দের বিরুদ্ধে অপর্যাপ্ত সুরক্ষা প্রদানের অভিযোগে ত্রুটিপূর্ণ কমব্যাট ইয়ারপ্লাগ সম্পর্কিত 300,000 মামলার জবাবে থ্রিএম 5.5 বিলিয়ন ডলারের নিষ্পত্তিতে সম্মত হয়েছে।",
      "একটি লিখিত চুক্তির অনুপস্থিতির কারণে সরকার-ঠিকাদার প্রতিরক্ষার কোম্পানির দাবি প্রত্যাখ্যান করা হয়েছিল, তবে ত্রুটি এবং জবাবদিহিতা সম্পর্কে বিশদ অস্পষ্ট রয়ে গেছে।",
      "পোস্টটি বিভিন্ন পরিস্থিতিতে কান সুরক্ষার কার্যকারিতা এবং থ্রিএম-এর বিরুদ্ধে মামলা সম্পর্কে বিতর্ক ের সূত্রপাত করেছে, বিশেষত নিষ্পত্তির পরিমাণ এবং কোম্পানির আর্থিক স্বাস্থ্যের উপর এর প্রভাবের উপর দৃষ্টি নিবদ্ধ করেছে।"
    ],
    "points": 221,
    "commentCount": 153,
    "retryCount": 0,
    "time": 1693244459
  }
]
