[
  {
    "id": 37000562,
    "title": "(další Rich)",
    "originLink": "https://clojure.org/news/2023/08/04/next-rich",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37000562",
    "commentBody": "",
    "originSummary": [
      "Rich Hickey, tvůrce jazyka Clojure, oznámil svůj odchod z vývoje komerčního softwaru.",
      "Hickey bude i nadále pokračovat ve vývoji jazyka Clojure jako nezávislý vývojář s podporou Alexe, Stua, Foguse a dalších.",
      "Společnosti Nubank bylo poděkováno za podporu a sponzorování základního týmu a Hickey vyjádřil uznání svým kolegům ze společnosti Cognitect.",
      "Hickey se také zmínil o nové volné dostupnosti Datomicu, čímž zdůraznil svůj návrat ke svobodě a nezávislosti, kterou měl při původním vývoji Clojure."
    ],
    "commentSummary": [
      "Rich Hickey, tvůrce programovacího jazyka Clojure, odchází do důchodu, což vyvolalo diskuse o dopadu jeho práce.",
      "Mnoho uživatelů vyjadřuje vděčnost za Hickeyho přínos a pozitivní vliv, který měl na jejich kariéru.",
      "Článek zmiňuje výhody a nevýhody jazyka Clojure a upozorňuje na Hickeyho přednášky a myšlenky o vývoji softwaru."
    ],
    "points": 957,
    "commentCount": 138,
    "retryCount": 0,
    "time": 1691159329
  },
  {
    "id": 37001369,
    "title": "Společnosti Comcast a CenturyLink nedokážou zničit gigabitovou optickou síť ve vlastnictví obce Utah",
    "originLink": "https://www.techdirt.com/2023/08/04/comcast-centurylink-fail-to-derail-community-owned-gigabit-fiber-network-in-bountiful-utah/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37001369",
    "commentBody": "",
    "originSummary": [
      "Regionální telekomunikační monopoly ve městě Bountiful ve státě Utah se brání širokopásmovým sítím vlastněným komunitou, což způsobuje odpor a potenciální překážky pro tyto iniciativy.",
      "Používání sítí VPN pro přístup ke streamovacím službám ze zahraničí vyvolává obavy z ohrožení soukromí.",
      "V současné době probíhá debata o tom, zda by měl projekt obecního širokopásmového připojení podléhat veřejnému hlasování, což vede k diskusím o vládním výzkumu, financování optických sítí, infrastrukturních projektech a komunitním širokopásmovém připojení. Kromě toho probíhají diskuse na různá témata na Twitteru a objevily se problémy se zpracováním plateb na Patreonu, změny API a pozitivní ohlasy na rozšíření ochrany osobních údajů."
    ],
    "commentSummary": [
      "Účastníci diskutují o výhodách optických sítí ve vlastnictví obcí a obecního širokopásmového připojení a zdůrazňují rychlejší a levnější možnosti připojení k internetu.",
      "Zdůrazňuje se potřeba konkurence na trhu a vyjadřuje se nespokojenost se současnými internetovými službami.",
      "Jako nevýhody současného systému jsou uváděny korupce, kontrola trhu a lobbování ze strany velkých poskytovatelů internetových služeb."
    ],
    "points": 752,
    "commentCount": 241,
    "retryCount": 0,
    "time": 1691162981
  },
  {
    "id": 37006082,
    "title": "Nejvíce propagované a blokované domény mezi uživateli služby Kagi Search",
    "originLink": "https://kagi.com/stats",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37006082",
    "commentBody": "",
    "originSummary": [
      "Uživatelé Kagi vytvářejí personalizace pro oblíbené domény, jako je Pinterest, Facebook, Instagram a Twitter.",
      "Zpravodajské weby jako Fox News, CNN a The New York Times jsou také oblíbenými doménami uživatelů Kagi.",
      "Kagi je univerzální shrnovací nástroj, jehož cílem je humanizovat web poskytováním personalizovaných shrnutí pro tyto domény."
    ],
    "commentSummary": [
      "Kagi Search nabízí přizpůsobitelné výsledky vyhledávání tím, že umožňuje uživatelům podporovat a blokovat domény.",
      "Článek srovnává Kagi se společností Google a zdůrazňuje výhody personalizovaných výsledků vyhledávání.",
      "Dochází k závěru, že tato funkce je sice cenná pro specializované vyhledávače, jako je Kagi, ale nemusí být nutná pro vyhledávače se zavedenějším postavením."
    ],
    "points": 644,
    "commentCount": 322,
    "retryCount": 0,
    "time": 1691184202
  },
  {
    "id": 36997821,
    "title": "Andrew McCalip předvádí syntézu LK99",
    "originLink": "https://twitter.com/andrewmccalip/status/1687405505604734978",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36997821",
    "commentBody": "",
    "originSummary": [
      "Andrew McCalip vytvořil skály v rámci dne 8.5 a zaměřil se na Meissnerův efekt.",
      "Meissnerův jev je jev, při kterém supravodič při přechodu do supravodivého stavu vypudí ze svého nitra všechna magnetická pole.",
      "Tento McCalipův výtvor podtrhuje význam Meissnerova jevu v oblasti supravodivosti."
    ],
    "commentSummary": [
      "Diskuse zahrnují celou řadu témat, včetně replikace a důvěryhodnosti supravodivého materiálu LK99, významu času a přísného ověřování ve vědeckém výzkumu a debat o ochraně a otevřeném přístupu k informacím.",
      "Diskutuje se také o názorech na nedávné tvrzení o supravodivosti při pokojové teplotě a o rozdílných přístupech amerických a čínských laboratoří.",
      "Součástí rozhovoru jsou také otázky týkající se akademické obce a financování vědy, skepse vůči tvrzením na Twitteru, potenciální důsledky supravodičů o pokojové teplotě a frustrace z platforem, jako je Twitter, a placeného obsahu."
    ],
    "points": 527,
    "commentCount": 337,
    "retryCount": 0,
    "time": 1691143840
  },
  {
    "id": 37006705,
    "title": "Nevěnujte pozornost portu USB za nálepkou \"bez USB\".",
    "originLink": "https://www.theverge.com/2023/8/4/23820710/pay-no-attention-to-the-usb-port-behind-the-no-usb-sticker",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37006705",
    "commentBody": "",
    "originSummary": [
      "Článek se zabývá použitím samolepek na portech USB tiskáren HP k propagaci bezdrátového tisku.",
      "Autor považuje za zábavné pozorovat lidi, kteří odstraňují nálepky a připojují své tiskárny přes USB.",
      "Účelem samolepek je povzbudit uživatele, aby využívali funkce bezdrátového tisku na tiskárnách HP."
    ],
    "commentSummary": [
      "Diskuse na serveru Hacker News se zabývá řadou témat včetně soukromých společností v oblasti regulace, kvality potravinářských výrobků, vlivu společností, prodeje čokolády Hershey's v Německu, problémů s tiskárnami a frustrace z tiskáren.",
      "Uživatelé se podělí o své zkušenosti, názory a obavy a zdůrazní význam vládní regulace, dopad spotřebitelské volby a výzvy spojené s tiskárnami s otevřeným zdrojovým kódem.",
      "Diskuse se zaměřuje především na kvalitu, spolehlivost, klamavé praktiky a vysoké náklady spojené s některými spotřebitelskými značkami."
    ],
    "points": 403,
    "commentCount": 216,
    "retryCount": 0,
    "time": 1691187886
  },
  {
    "id": 37001837,
    "title": "LK-99 je online senzace, ale snahy o replikaci jsou nedostatečné",
    "originLink": "https://www.nature.com/articles/d41586-023-02481-0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37001837",
    "commentBody": "",
    "originSummary": [
      "Korejský tým tvrdí, že objevil supravodič o pokojové teplotě s názvem LK-99, kterému se dostalo značné pozornosti.",
      "Pokusy o replikaci výsledků však byly zatím neúspěšné, což zpochybňuje platnost těchto tvrzení.",
      "Několikanásobné pokusy o replikaci nepozorovaly u LK-99 žádné známky supravodivosti, což vedlo vědce k tomu, že zůstali skeptičtí k jeho existenci jako supravodiče za okolních podmínek."
    ],
    "commentSummary": [
      "Diskutuje se o potenciálním supravodiči pro pokojovou teplotu s názvem LK-99.",
      "Někteří jsou touto možností nadšeni, zatímco skeptici kritizují nedostatek důkazů a pokusů o replikaci.",
      "Zdůrazňují se důsledky a aplikace supravodiče o pokojové teplotě, ale nabádá se k opatrnosti a dalšímu výzkumu."
    ],
    "points": 313,
    "commentCount": 360,
    "retryCount": 0,
    "time": 1691164960
  },
  {
    "id": 37000981,
    "title": "Práce na dálku vyžaduje častější, ale méně častou komunikaci.",
    "originLink": "https://ben.balter.com/2023/08/04/remote-work-communicate-more-with-less/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37000981",
    "commentBody": "",
    "originSummary": [
      "Práce na dálku vyžaduje častou a bohatou komunikaci se zaměřením na asynchronní metody, jako je psaní a videa pro reflexi a syntézu.",
      "Efektivní komunikace při práci na dálku zahrnuje výběr vhodného média, srozumitelné psaní a poutavá videa.",
      "Podporuje se proaktivní, pravidelná a asynchronní komunikace, zatímco synchronní komunikace je vyhrazena pro naléhavé nebo složité záležitosti."
    ],
    "commentSummary": [
      "Účastníci diskutují o výzvách a výhodách práce na dálku se zaměřením na komunikaci, socializaci, mentoring a produktivitu.",
      "V souvislosti s prací na dálku se zkoumá účinnost různých komunikačních metod a význam sociální interakce.",
      "Zkoumá se dopad práce na dálku na spolupráci a řešení problémů, jakož i výzvy, kterým čelí mladší zaměstnanci, a hodnota mentoringu. Důraz je kladen také na vytváření podpůrné týmové kultury a přizpůsobivost v prostředí práce na dálku."
    ],
    "points": 309,
    "commentCount": 303,
    "retryCount": 0,
    "time": 1691161328
  },
  {
    "id": 37006224,
    "title": "Nedeterminismus v GPT-4 je způsoben Sparse MoE",
    "originLink": "https://152334H.github.io/blog/non-determinism-in-gpt-4/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37006224",
    "commentBody": "",
    "originSummary": [
      "Autor zkoumá nedeterministické chování GPT-4 a přičítá ho tomu, že architektura Sparse MoE nedokáže prosadit determinismus na sekvenci.",
      "Na podporu této hypotézy jsou uvedeny výsledky experimentů a srovnání s jinými modely.",
      "Zkoumají se také důsledky těchto zjištění pro GPT-3.5-Turbo, který může mít podobnou architekturu."
    ],
    "commentSummary": [
      "Diskuse se zaměřuje na determinismus v modelech UI, zejména GPT-3 a GPT-4, a na to, jak může použití řídkého MoE vést k nedeterministickému chování.",
      "Objevují se obavy z možných útoků postranními kanály a z dopadu na spolehlivost a přijetí modelů umělé inteligence.",
      "Vedou se diskuse o tom, zda je nedeterministické chování chybou nebo záměrnou volbou návrhu, přičemž někteří tvrdí, že obětování determinismu ve prospěch výkonu je přijatelné. Jako důležité postupy v oblasti umělé inteligence a strojového učení jsou zdůrazněny čtení vědeckých článků, pochopení souvislostí a zaměření se na konkrétní zájmy."
    ],
    "points": 302,
    "commentCount": 150,
    "retryCount": 0,
    "time": 1691185029
  },
  {
    "id": 37008034,
    "title": "Snížení emisí síry z lodí může být příčinou zvyšování teploty moří.",
    "originLink": "https://twitter.com/hankgreen/status/1687535525169930241",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37008034",
    "commentBody": "",
    "originSummary": [
      "Předpokládá se, že k alarmujícímu nárůstu přispělo náhodné geoinženýrství, ke kterému dochází již desítky let.",
      "Náhodné geoinženýrství však nyní ustalo, což by mohlo znamenat pokles výkyvu.",
      "Tento vědecký příběh byl kvůli současným událostem přehlížen, ale osvětluje možnou příčinu nárůstu."
    ],
    "commentSummary": [
      "Diskuse se soustředí na výzvy a možná řešení v oblasti změny klimatu.",
      "O účinnosti a rizicích geoinženýrství, včetně snižování emisí síry a atmosférického vstřikování SO2, se vedou diskuse.",
      "Účastníci zdůrazňují potřebu změny životního stylu, technologického pokroku a globální změny myšlení v boji proti změně klimatu.",
      "Objevují se obavy ohledně naléhavosti klimatické krize a účinnosti současných opatření.",
      "Diskutuje se o klimatických modelech, politických a ekonomických systémech a možných důsledcích podcenění nárůstu teploty.",
      "Dotýká se témat, jako jsou přistěhovalci, manipulace s masami a knihy týkající se změny klimatu.",
      "Debata se týká také výstavby nových jaderných elektráren a dekarbonizace elektrických sítí.",
      "Zmíněna jsou řešení jako zachycování uhlíku, solární a bateriové technologie a snižování počtu obyvatel planety, přičemž se liší názory na jejich proveditelnost a účinnost."
    ],
    "points": 291,
    "commentCount": 315,
    "retryCount": 0,
    "time": 1691198818
  },
  {
    "id": 36997834,
    "title": "Překonání rekordu tepla v oceánu",
    "originLink": "https://www.bbc.com/news/science-environment-66387537",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36997834",
    "commentBody": "",
    "originSummary": [
      "Oceány dosáhly nejvyšší zaznamenané teploty a překonaly dosavadní rekord s průměrnou denní globální teplotou povrchu moře 20,96C (69,73F).",
      "Teplejší oceány přispívají k vyšší hladině skleníkových plynů, protože mají sníženou schopnost absorbovat oxid uhličitý.",
      "Zvyšující se teplota oceánů má negativní dopady, například narušuje mořské druhy, ovlivňuje populace ryb, urychluje tání ledovců a způsobuje zvyšování hladiny moří."
    ],
    "commentSummary": [
      "Diskuse na serveru Hacker News se věnuje různým tématům, jako je kapitalismus, technologický pokrok, konzumerismus, změna klimatu a růst populace.",
      "Účastníci vyjadřují obavy z negativních dopadů chamtivosti a honby za ziskem na společnost a životní prostředí.",
      "Jsou navržena alternativní řešení pro řešení nerovnosti v bohatství a klimatické krize se zaměřením na globální vedení a okamžité kroky v boji proti změně klimatu."
    ],
    "points": 251,
    "commentCount": 272,
    "retryCount": 0,
    "time": 1691143913
  }
]
