[
  {
    "id": 37000562,
    "title": "(sonraki Zengin)",
    "originLink": "https://clojure.org/news/2023/08/04/next-rich",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37000562",
    "commentBody": "",
    "originSummary": [
      "Clojure'un yaratıcısı Rich Hickey, ticari yazılım geliştirmeden emekli olduğunu açıkladı.",
      "Hickey, Alex, Stu, Fogus ve diğerlerinin desteğiyle birlikte bağımsız bir geliştirici olarak Clojure'un devam eden gelişimine liderlik etmeye devam edecek.",
      "Nubank'a çekirdek ekibe verdiği destek ve sponsorluk için teşekkür eden Hickey, Cognitect'teki çalışma arkadaşlarına da minnettarlığını ifade etti.",
      "Hickey ayrıca Datomic'in yeni ücretsiz sürümünden de bahsederek, Clojure'u geliştirirken sahip olduğu özgürlük ve bağımsızlığa geri döndüğünü vurguladı."
    ],
    "commentSummary": [
      "Clojure programlama dilinin yaratıcısı Rich Hickey'in emekliye ayrılması, çalışmalarının etkisi konusunda tartışmalara yol açtı.",
      "Birçok kullanıcı Hickey'in katkıları ve kariyerleri üzerindeki olumlu etkisi için minnettarlıklarını ifade ediyor.",
      "Makalede Clojure'un faydaları ve dezavantajlarından bahsediliyor ve Hickey'in yazılım geliştirme konusundaki konuşmaları ve fikirleri vurgulanıyor."
    ],
    "points": 957,
    "commentCount": 138,
    "retryCount": 0,
    "time": 1691159329
  },
  {
    "id": 37001369,
    "title": "Comcast ve CenturyLink, Utah toplumuna ait gigabit fiber ağını raydan çıkarmayı başaramadı",
    "originLink": "https://www.techdirt.com/2023/08/04/comcast-centurylink-fail-to-derail-community-owned-gigabit-fiber-network-in-bountiful-utah/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37001369",
    "commentBody": "",
    "originSummary": [
      "Utah, Bountiful'daki bölgesel telekom tekelleri, topluma ait geniş bant ağlarına direnerek bu girişimlerin geri tepmesine ve potansiyel engellere neden oluyor.",
      "Yurt dışından yayın hizmetlerine erişmek için VPN kullanımı, gizlilik riskleri konusunda endişelere yol açmaktadır.",
      "Bir belediye genişbant projesinin halk oylamasına tabi olup olmaması gerektiği konusunda devam eden bir tartışma var, bu da hükümet araştırmaları, fiber ağlar için finansman, altyapı projeleri ve topluluk genişbantı üzerine tartışmalara yol açıyor. Ayrıca, Twitter'da çeşitli konularda tartışmalar yapılıyor ve Patreon'un ödeme işlemleri, API değişiklikleri ve gizlilik uzantısına ilişkin olumlu geri bildirimlerle ilgili sorunlar yaşanıyor."
    ],
    "commentSummary": [
      "Katılımcılar, daha hızlı ve daha ucuz internet seçeneklerini vurgulayarak, topluma ait fiber ağların ve belediye genişbantının faydalarını tartışıyor.",
      "Piyasada rekabete duyulan ihtiyaç vurgulanırken, mevcut internet hizmetiyle ilgili hayal kırıklıkları dile getirildi.",
      "Yolsuzluk, piyasa kontrolü ve büyük İSS'lerin lobicilik faaliyetleri mevcut sistemin dezavantajları olarak belirtilmektedir."
    ],
    "points": 752,
    "commentCount": 241,
    "retryCount": 0,
    "time": 1691162981
  },
  {
    "id": 37006082,
    "title": "Kagi Search kullanıcıları arasında en çok tanıtılan ve engellenen alan adları",
    "originLink": "https://kagi.com/stats",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37006082",
    "commentBody": "",
    "originSummary": [
      "Kagi kullanıcıları Pinterest, Facebook, Instagram ve Twitter gibi popüler alan adları için kişiselleştirmeler oluşturuyor.",
      "Fox News, CNN ve The New York Times gibi haber siteleri de Kagi kullanıcıları için popüler alan adlarıdır.",
      "Kagi, bu alanlar için kişiselleştirilmiş özetler sağlayarak web'i insanileştirmeyi amaçlayan evrensel bir özetleme aracıdır."
    ],
    "commentSummary": [
      "Kagi Search, kullanıcıların alan adlarını tanıtmasına ve engellemesine izin vererek özelleştirilebilir arama sonuçları sunar.",
      "Makale Kagi'yi Google ile karşılaştırıyor ve kişiselleştirilmiş arama sonuçlarının faydalarını vurguluyor.",
      "Bu özellik Kagi gibi niş arama motorları için değerli olsa da, daha köklü olanlar için gerekli olmayabileceği sonucuna varıyor."
    ],
    "points": 644,
    "commentCount": 322,
    "retryCount": 0,
    "time": 1691184202
  },
  {
    "id": 36997821,
    "title": "Andrew McCalip LK99 sentezini gösteriyor",
    "originLink": "https://twitter.com/andrewmccalip/status/1687405505604734978",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36997821",
    "commentBody": "",
    "originSummary": [
      "Andrew McCalip, 8.5. Günde Meissner etkisine odaklanarak kayalar oluşturdu.",
      "Meissner etkisi, bir süper iletkenin süper iletken duruma geçtiğinde tüm manyetik alanları içinden dışarı attığı bir olgudur.",
      "McCalip'in bu buluşu, Meissner etkisinin süperiletkenlik alanındaki önemini vurgulamaktadır."
    ],
    "commentSummary": [
      "Tartışmalar, süper iletken malzeme LK99'un kopyalanması ve güvenilirliği, bilimsel araştırmalarda zamanın ve titiz doğrulamanın önemi ve kapı tutma ve bilgiye açık erişim tartışmaları da dahil olmak üzere bir dizi konuyu kapsamaktadır.",
      "Oda sıcaklığında süperiletkenlik konusundaki son iddialar ve ABD ve Çin laboratuvarlarının farklı yaklaşımları hakkındaki görüşler de tartışılıyor.",
      "Akademi ve bilimsel finansmanla ilgili konular, Twitter'da ortaya atılan iddialara yönelik şüphecilik, oda sıcaklığındaki süper iletkenlerin potansiyel etkileri ve Twitter gibi platformlar ve ödeme duvarlı içerikle ilgili hayal kırıklıkları da konuşmanın bir parçası."
    ],
    "points": 527,
    "commentCount": 337,
    "retryCount": 0,
    "time": 1691143840
  },
  {
    "id": 37006705,
    "title": "\"USB yok\" etiketinin arkasındaki USB bağlantı noktasına dikkat etmeyin",
    "originLink": "https://www.theverge.com/2023/8/4/23820710/pay-no-attention-to-the-usb-port-behind-the-no-usb-sticker",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37006705",
    "commentBody": "",
    "originSummary": [
      "Makale, kablosuz yazdırmayı teşvik etmek için HP yazıcıların USB bağlantı noktalarında çıkartma kullanımını araştırıyor.",
      "Yazar, insanların çıkartmaları çıkarıp yazıcılarını USB üzerinden bağladıklarını gözlemlemeyi eğlenceli buluyor.",
      "Çıkartmaların amacı, kullanıcıları HP yazıcıların kablosuz yazdırma işlevinden yararlanmaya teşvik etmektir."
    ],
    "commentSummary": [
      "Hacker News'in tartışması, özel şirketlerin düzenlenmesi, gıda ürün kalitesi, kurumsal etki, Hershey's çikolatasının Almanya'da satılması, yazıcı sorunları ve yazıcı şirketleriyle ilgili hayal kırıklıkları gibi bir dizi konuyu kapsıyor.",
      "Kullanıcılar, hükümet düzenlemelerinin önemini, tüketici tercihinin etkisini ve açık kaynaklı yazıcıların zorluklarını vurgulayarak deneyimlerini, görüşlerini ve endişelerini paylaşıyor.",
      "Tartışma öncelikle kalite, güvenilirlik, aldatıcı uygulamalar ve belirli tüketici markalarıyla ilişkili yüksek maliyetlere odaklanmaktadır."
    ],
    "points": 403,
    "commentCount": 216,
    "retryCount": 0,
    "time": 1691187886
  },
  {
    "id": 37001837,
    "title": "LK-99 çevrimiçi bir sansasyon ama çoğaltma çabaları yetersiz kalıyor",
    "originLink": "https://www.nature.com/articles/d41586-023-02481-0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37001837",
    "commentBody": "",
    "originSummary": [
      "Koreli bir ekip, büyük ilgi gören LK-99 adlı oda sıcaklığında çalışan bir süper iletken keşfettiklerini iddia etti.",
      "Ancak, sonuçları tekrarlama girişimleri şimdiye kadar başarısız oldu ve iddiaların geçerliliği konusunda şüphe uyandırdı.",
      "Çoklu çoğaltma çabaları LK-99'da herhangi bir süper iletkenlik belirtisi gözlemlememiş, bu da bilim insanlarının ortam koşullarında süper iletken olarak varlığına şüpheyle yaklaşmalarına yol açmıştır."
    ],
    "commentSummary": [
      "LK-99 adı verilen potansiyel bir oda sıcaklığı süper iletkeniyle ilgili bir tartışma var.",
      "Bazıları bu olasılıktan heyecan duyarken, şüpheciler kanıt ve replikasyon girişimlerinin eksikliğini eleştiriyor.",
      "Oda sıcaklığında süper iletkenin etkileri ve uygulamaları vurgulanmakta, ancak dikkatli olunması ve daha fazla araştırma yapılması tavsiye edilmektedir."
    ],
    "points": 313,
    "commentCount": 360,
    "retryCount": 0,
    "time": 1691164960
  },
  {
    "id": 37000981,
    "title": "Uzaktan çalışma daha fazla, ancak daha az sıklıkla iletişim kurmayı gerektirir",
    "originLink": "https://ben.balter.com/2023/08/04/remote-work-communicate-more-with-less/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37000981",
    "commentBody": "",
    "originSummary": [
      "Uzaktan çalışma, yansıtma ve sentez için yazma ve videolar gibi eşzamansız yöntemlere odaklanarak sık ve zengin iletişim gerektirir.",
      "Uzaktan çalışmada etkili iletişim, uygun ortamın seçilmesini, net yazımı ve ilgi çekici videoları içerir.",
      "Proaktif, düzenli ve eşzamansız iletişim teşvik edilirken, eşzamanlı iletişim acil veya karmaşık konular için ayrılmıştır."
    ],
    "commentSummary": [
      "Katılımcılar iletişim, sosyalleşme, mentorluk ve üretkenlik konularına odaklanarak uzaktan çalışmanın zorluklarını ve faydalarını tartışıyor.",
      "Uzaktan çalışma ile ilgili olarak farklı iletişim yöntemlerinin etkinliği ve sosyal etkileşimin önemi incelenmektedir.",
      "Uzaktan çalışmanın işbirliği ve sorun çözme üzerindeki etkisinin yanı sıra, kıdemsiz çalışanların karşılaştığı zorluklar ve mentorluğun değeri de incelenmektedir. Uzaktan çalışma ortamlarında destekleyici bir ekip kültürü oluşturmak ve uyum sağlayabilir olmak da vurgulanmaktadır."
    ],
    "points": 309,
    "commentCount": 303,
    "retryCount": 0,
    "time": 1691161328
  },
  {
    "id": 37006224,
    "title": "GPT-4'teki belirsizlik Seyrek MoE'den kaynaklanmaktadır",
    "originLink": "https://152334H.github.io/blog/non-determinism-in-gpt-4/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37006224",
    "commentBody": "",
    "originSummary": [
      "Yazar, GPT-4'ün deterministik olmayan davranışını inceliyor ve bunu Sparse MoE mimarisinin dizi başına determinizmi zorlamamasına bağlıyor.",
      "Bu hipotezi desteklemek için deneysel sonuçlar ve diğer modellerle karşılaştırmalar sağlanmıştır.",
      "Bu bulguların benzer bir mimariye sahip olabilecek GPT-3.5-Turbo üzerindeki etkileri de araştırılmıştır."
    ],
    "commentSummary": [
      "Tartışma, YZ modellerinde, özellikle GPT-3 ve GPT-4'te determinizm ve seyrek MoE kullanımının deterministik olmayan davranışa nasıl yol açabileceği üzerine odaklanmaktadır.",
      "Potansiyel yan kanal saldırıları ve YZ modellerinin güvenilirliği ve benimsenmesi üzerindeki etkisi hakkında endişeler dile getirilmektedir.",
      "Deterministik olmayan davranışın bir hata mı yoksa kasıtlı bir tasarım tercihi mi olduğu konusunda bir tartışma vardır ve bazıları performans için determinizmden ödün vermenin kabul edilebilir olduğunu savunmaktadır. Bilimsel makaleleri okumak, bağlamı anlamak ve belirli ilgi alanlarına odaklanmak, yapay zeka ve makine öğrenimi alanında önemli uygulamalar olarak vurgulanmaktadır."
    ],
    "points": 302,
    "commentCount": 150,
    "retryCount": 0,
    "time": 1691185029
  },
  {
    "id": 37008034,
    "title": "Gemilerden kaynaklanan sülfür emisyonlarının azaltılması deniz sıcaklıklarının yükselmesine neden olabilir",
    "originLink": "https://twitter.com/hankgreen/status/1687535525169930241",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37008034",
    "commentBody": "",
    "originSummary": [
      "On yıllardır meydana gelen kazara jeomühendisliğin endişe verici artışa katkıda bulunduğuna inanılıyor.",
      "Ancak, kazara yapılan jeomühendislik artık sona ermiştir ve bu da potansiyel olarak ani yükselişte bir düşüşe işaret etmektedir.",
      "Bu bilim öyküsü, güncel olaylar nedeniyle göz ardı edilmiş olsa da, artışın olası bir nedenine ışık tutuyor."
    ],
    "commentSummary": [
      "Tartışmalar, iklim değişikliğinin ele alınmasına yönelik zorluklar ve potansiyel çözümler etrafında yoğunlaşmaktadır.",
      "Sülfür emisyonlarının azaltılması ve atmosferik SO2 enjeksiyonu da dahil olmak üzere jeomühendisliğin etkinliği ve riskleri konusunda tartışmalar bulunmaktadır.",
      "Katılımcılar, iklim değişikliğiyle mücadele için yaşam tarzı değişikliklerine, teknolojik ilerlemelere ve küresel bir zihniyet değişimine duyulan ihtiyacın altını çiziyor.",
      "İklim krizinin aciliyeti ve mevcut önlemlerin etkinliği konusunda endişeler dile getirilmektedir.",
      "İklim modelleri, siyasi ve ekonomik sistemler ve sıcaklık artışının hafife alınmasının olası sonuçları tartışılmaktadır.",
      "Göçmenler, kitlelerin manipülasyonu ve iklim değişikliği ile ilgili kitaplar gibi konulara değiniliyor.",
      "Tartışma yeni nükleer enerji santrallerinin inşası ve elektrik şebekelerinin karbonsuzlaştırılması konularını da kapsamaktadır.",
      "Karbon yakalama, güneş ve batarya teknolojileri ve küresel nüfusun azaltılması gibi çözümlerden bahsedilmekte ve bunların uygulanabilirliği ve etkinliği konusunda farklı bakış açıları bulunmaktadır."
    ],
    "points": 291,
    "commentCount": 315,
    "retryCount": 0,
    "time": 1691198818
  },
  {
    "id": 36997834,
    "title": "Okyanus Sıcaklığı Rekoru Kırıldı",
    "originLink": "https://www.bbc.com/news/science-environment-66387537",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36997834",
    "commentBody": "",
    "originSummary": [
      "Okyanuslar, günlük ortalama 20.96C (69.73F) küresel deniz yüzeyi sıcaklığı ile bir önceki rekoru geride bırakarak kaydedilen en yüksek sıcaklığa ulaştı.",
      "Daha sıcak okyanuslar, karbondioksiti emme kabiliyetleri azaldığı için daha yüksek sera gazı seviyelerine katkıda bulunur.",
      "Artan okyanus sıcaklıklarının deniz canlılarını bozmak, balık stoklarını etkilemek, buzul erimesini hızlandırmak ve deniz seviyesinin yükselmesine neden olmak gibi olumsuz etkileri vardır."
    ],
    "commentSummary": [
      "Hacker News'deki tartışma kapitalizm, teknolojik ilerleme, tüketimcilik, iklim değişikliği ve nüfus artışı gibi çeşitli konuları kapsıyor.",
      "Katılımcılar, açgözlülük ve kâr amacı güden davranışların toplum ve çevre üzerindeki olumsuz etkilerine ilişkin endişelerini dile getirmektedir.",
      "Küresel liderliğe ve iklim değişikliğiyle mücadele için acil eyleme odaklanarak, servet eşitsizliğini ve iklim krizini ele almak için alternatif çözümler önerilmektedir."
    ],
    "points": 251,
    "commentCount": 272,
    "retryCount": 0,
    "time": 1691143913
  }
]
