[
  {
    "id": 37000562,
    "title": "(ريتش التالي)",
    "originLink": "https://clojure.org/news/2023/08/04/next-rich",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37000562",
    "commentBody": "",
    "originSummary": [
      "أعلن ريتش هيكي ، مبتكر Clojure ، تقاعده من تطوير البرمجيات التجارية.",
      "سيستمر Hickey في قيادة التطوير المستمر ل Clojure كمطور مستقل ، إلى جانب دعم Alex و Stu و Fogus وغيرهم.",
      "تم شكر نوبانك على دعمهم ورعايتهم للفريق الأساسي، وأعرب هيكي عن تقديره لزملائه في كوغنيتيكت.",
      "ذكر هيكي أيضا التوافر المجاني الجديد ل Datomic ، مسلطا الضوء على عودته إلى الحرية والاستقلال الذي كان يتمتع به عند تطوير Clojure في الأصل."
    ],
    "commentSummary": [
      "ريتش هيكي ، مبتكر لغة البرمجة Clojure ، يتقاعد ، مما أثار مناقشات حول تأثير عمله.",
      "يعبر العديد من المستخدمين عن امتنانهم لمساهمات هيكي والتأثير الإيجابي الذي أحدثه على حياتهم المهنية.",
      "يذكر المقال فوائد وعيوب Clojure ويسلط الضوء على محادثات وأفكار هيكي حول تطوير البرمجيات."
    ],
    "points": 957,
    "commentCount": 138,
    "retryCount": 0,
    "time": 1691159329
  },
  {
    "id": 37001369,
    "title": "كومكاست ، CenturyLink تفشل في عرقلة شبكة ألياف جيجابت المملوكة لمجتمع يوتا",
    "originLink": "https://www.techdirt.com/2023/08/04/comcast-centurylink-fail-to-derail-community-owned-gigabit-fiber-network-in-bountiful-utah/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37001369",
    "commentBody": "",
    "originSummary": [
      "تقاوم احتكارات الاتصالات الإقليمية في باونتيفول بولاية يوتا شبكات النطاق العريض المملوكة للمجتمع ، مما يتسبب في تراجع وحواجز محتملة أمام هذه المبادرات.",
      "يثير استخدام شبكات VPN للوصول إلى خدمات البث من الخارج مخاوف بشأن مخاطر الخصوصية.",
      "هناك نقاش مستمر حول ما إذا كان ينبغي أن يخضع مشروع النطاق العريض البلدي لتصويت عام ، مما يؤدي إلى مناقشات حول الأبحاث الحكومية ، وتمويل شبكات الألياف ، ومشاريع البنية التحتية ، والنطاق العريض المجتمعي. بالإضافة إلى ذلك ، تجري مناقشات حول مواضيع مختلفة على Twitter ، وكانت هناك مشكلات في معالجة الدفع الخاصة ب Patreon ، وتغييرات واجهة برمجة التطبيقات ، وردود الفعل الإيجابية على امتداد الخصوصية."
    ],
    "commentSummary": [
      "يناقش المشاركون فوائد شبكات الألياف المملوكة للمجتمع والنطاق العريض البلدي ، مع تسليط الضوء على خيارات الإنترنت الأسرع والأرخص.",
      "يتم التأكيد على الحاجة إلى المنافسة في السوق ، مع التعبير عن الإحباط بشأن خدمة الإنترنت الحالية.",
      "تم ذكر الفساد والسيطرة على السوق والضغط من قبل كبار مزودي خدمات الإنترنت كعيوب للنظام الحالي."
    ],
    "points": 752,
    "commentCount": 241,
    "retryCount": 0,
    "time": 1691162981
  },
  {
    "id": 37006082,
    "title": "معظم النطاقات التي تم الترويج لها وحظرها بين مستخدمي Kagi Search",
    "originLink": "https://kagi.com/stats",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37006082",
    "commentBody": "",
    "originSummary": [
      "ينشئ مستخدمو Kagi تخصيصات للنطاقات الشائعة مثل Pinterest و Facebook و Instagram و Twitter.",
      "المواقع الإخبارية مثل Fox News و CNN و The New York Times هي أيضا نطاقات شائعة لمستخدمي Kagi.",
      "Kagi هي أداة تلخيص عالمية تهدف إلى إضفاء الطابع الإنساني على الويب من خلال توفير ملخصات مخصصة لهذه المجالات."
    ],
    "commentSummary": [
      "يقدم Kagi Search نتائج بحث قابلة للتخصيص من خلال السماح للمستخدمين بالترويج للنطاقات وحظرها.",
      "تقارن المقالة Kagi ب Google وتؤكد على فوائد نتائج البحث المخصصة.",
      "ويخلص إلى أنه على الرغم من أن هذه الميزة ذات قيمة لمحركات البحث المتخصصة مثل Kagi ، إلا أنها قد لا تكون ضرورية لمحركات البحث الأكثر رسوخا."
    ],
    "points": 644,
    "commentCount": 322,
    "retryCount": 0,
    "time": 1691184202
  },
  {
    "id": 36997821,
    "title": "أندرو ماكاليب يوضح توليف LK99",
    "originLink": "https://twitter.com/andrewmccalip/status/1687405505604734978",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36997821",
    "commentBody": "",
    "originSummary": [
      "أنشأ أندرو ماكاليب الصخور في اليوم 8.5 ، مع التركيز على تأثير ميسنر.",
      "تأثير مايسنر هو ظاهرة يطرد فيها الموصل الفائق جميع المجالات المغناطيسية من داخله عندما ينتقل إلى حالة الموصلية الفائقة.",
      "يسلط هذا الإنشاء بواسطة McCalip الضوء على أهمية تأثير Meissner في مجال الموصلية الفائقة."
    ],
    "commentSummary": [
      "تشمل المناقشات مجموعة من الموضوعات ، بما في ذلك تكرار ومصداقية مادة الموصل الفائق LK99 ، وأهمية الوقت والتحقق الدقيق في البحث العلمي ، والمناقشات حول حراسة البوابة والوصول المفتوح إلى المعلومات.",
      "كما تتم مناقشة الآراء حول الادعاء الأخير بالموصلية الفائقة في درجة حرارة الغرفة والأساليب المختلفة للمختبرات الأمريكية والصينية.",
      "القضايا المتعلقة بالأوساط الأكاديمية والتمويل العلمي ، والشكوك تجاه الادعاءات المقدمة على Twitter ، والآثار المحتملة للموصلات الفائقة في درجة حرارة الغرفة ، والإحباط من منصات مثل Twitter والمحتوى غير المدفوع هي أيضا جزء من المحادثة."
    ],
    "points": 527,
    "commentCount": 337,
    "retryCount": 0,
    "time": 1691143840
  },
  {
    "id": 37006705,
    "title": "لا تولي اهتماما لمنفذ USB خلف ملصق \"no USB\"",
    "originLink": "https://www.theverge.com/2023/8/4/23820710/pay-no-attention-to-the-usb-port-behind-the-no-usb-sticker",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37006705",
    "commentBody": "",
    "originSummary": [
      "تستكشف المقالة استخدام الملصقات على منافذ USB لطابعات HP لتعزيز الطباعة اللاسلكية.",
      "يجد المؤلف أنه من الممتع ملاحظة الأشخاص الذين يزيلون الملصقات ويربطون طابعاتهم عبر USB.",
      "الغرض من الملصقات هو تشجيع المستخدمين على استخدام وظيفة الطباعة اللاسلكية لطابعات HP."
    ],
    "commentSummary": [
      "تغطي مناقشة Hacker News مجموعة من الموضوعات بما في ذلك الشركات الخاصة في التنظيم ، وجودة المنتجات الغذائية ، وتأثير الشركات ، وبيع شوكولاتة هيرشي في ألمانيا ، وقضايا الطابعة ، والإحباط من شركات الطابعات.",
      "يشارك المستخدمون تجاربهم وآرائهم واهتماماتهم ، مع التأكيد على أهمية التنظيم الحكومي ، وتأثير اختيار المستهلك ، وتحديات الطابعات مفتوحة المصدر.",
      "تركز المناقشة بشكل أساسي على الجودة والموثوقية والممارسات الخادعة والتكاليف المرتفعة المرتبطة ببعض العلامات التجارية الاستهلاكية."
    ],
    "points": 403,
    "commentCount": 216,
    "retryCount": 0,
    "time": 1691187886
  },
  {
    "id": 37001837,
    "title": "LK-99 هو ضجة كبيرة على الإنترنت ولكن جهود النسخ المتماثل تقصر",
    "originLink": "https://www.nature.com/articles/d41586-023-02481-0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37001837",
    "commentBody": "",
    "originSummary": [
      "ادعى فريق كوري اكتشاف موصل فائق لدرجة حرارة الغرفة يدعى LK-99 ، والذي حظي باهتمام كبير.",
      "ومع ذلك، لم تنجح محاولات تكرار النتائج حتى الآن، مما يلقي بظلال من الشك على صحة الادعاءات.",
      "لم تلاحظ جهود النسخ المتماثل المتعددة أي علامات على الموصلية الفائقة في LK-99 ، مما دفع العلماء إلى البقاء متشككين في وجودها كموصل فائق في الظروف المحيطة."
    ],
    "commentSummary": [
      "هناك نقاش حول موصل فائق محتمل لدرجة حرارة الغرفة يسمى LK-99.",
      "البعض متحمس لهذا الاحتمال ، بينما ينتقد المتشككون نقص الأدلة ومحاولات التكرار.",
      "يتم تسليط الضوء على الآثار المترتبة على وتطبيقات الموصل الفائق لدرجة حرارة الغرفة ، ولكن يتم الحث على توخي الحذر وإجراء مزيد من البحث."
    ],
    "points": 313,
    "commentCount": 360,
    "retryCount": 0,
    "time": 1691164960
  },
  {
    "id": 37000981,
    "title": "يتطلب العمل عن بعد التواصل بشكل أكبر ، ولكن بشكل أقل تكرارا",
    "originLink": "https://ben.balter.com/2023/08/04/remote-work-communicate-more-with-less/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37000981",
    "commentBody": "",
    "originSummary": [
      "يتطلب العمل عن بعد اتصالا متكررا وغنيا ، مع التركيز على الأساليب غير المتزامنة مثل الكتابة ومقاطع الفيديو للتفكير والتوليف.",
      "يتضمن التواصل الفعال في العمل عن بعد اختيار الوسيلة المناسبة والكتابة الواضحة ومقاطع الفيديو الجذابة.",
      "يتم تشجيع التواصل الاستباقي والمنتظم وغير المتزامن ، بينما يتم حجز الاتصال المتزامن للمسائل العاجلة أو المعقدة."
    ],
    "commentSummary": [
      "يناقش المشاركون تحديات وفوائد العمل عن بعد ، مع التركيز على التواصل والتنشئة الاجتماعية والإرشاد والإنتاجية.",
      "يتم فحص فعالية طرق الاتصال المختلفة وأهمية التفاعل الاجتماعي فيما يتعلق بالعمل عن بعد.",
      "يتم استكشاف تأثير العمل عن بعد على التعاون وحل المشكلات ، بالإضافة إلى التحديات التي يواجهها الموظفون المبتدئون وقيمة الإرشاد. كما يتم التأكيد على خلق ثقافة فريق داعمة والقدرة على التكيف في بيئات العمل عن بعد."
    ],
    "points": 309,
    "commentCount": 303,
    "retryCount": 0,
    "time": 1691161328
  },
  {
    "id": 37006224,
    "title": "يحدث عدم الحتمية في GPT-4 بسبب وزارة التربية والتعليم المتفرقة",
    "originLink": "https://152334H.github.io/blog/non-determinism-in-gpt-4/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37006224",
    "commentBody": "",
    "originSummary": [
      "يفحص المؤلف السلوك غير الحتمي ل GPT-4 ويعزوه إلى فشل بنية Sparse MoE في فرض الحتمية لكل تسلسل.",
      "يتم توفير النتائج التجريبية والمقارنات مع النماذج الأخرى لدعم هذه الفرضية.",
      "كما يتم استكشاف الآثار المترتبة على هذه النتائج على GPT-3.5-Turbo ، والتي قد يكون لها بنية مماثلة."
    ],
    "commentSummary": [
      "تركز المناقشة على الحتمية في نماذج الذكاء الاصطناعي ، وخاصة GPT-3 و GPT-4 ، وكيف يمكن أن يؤدي استخدام MoE المتناثر إلى سلوك غير حتمي.",
      "وتثار مخاوف بشأن الهجمات المحتملة على القنوات الجانبية وتأثيرها على موثوقية النماذج الذكاء الاصطناعي واعتمادها.",
      "هناك جدل حول ما إذا كان السلوك غير الحتمي هو خطأ أو اختيار تصميم متعمد ، حيث يجادل البعض بأن التضحية بالحتمية من أجل الأداء أمر مقبول. يتم تسليط الضوء على قراءة الأوراق العلمية وفهم السياق وشحذ اهتمامات محددة كممارسات مهمة في مجال الذكاء الاصطناعي والتعلم الآلي."
    ],
    "points": 302,
    "commentCount": 150,
    "retryCount": 0,
    "time": 1691185029
  },
  {
    "id": 37008034,
    "title": "قد يتسبب الحد من انبعاثات الكبريت من السفن في ارتفاع درجات حرارة البحر",
    "originLink": "https://twitter.com/hankgreen/status/1687535525169930241",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37008034",
    "commentBody": "",
    "originSummary": [
      "يعتقد أن الهندسة الجيولوجية العرضية ، التي تحدث منذ عقود ، قد ساهمت في ارتفاع ينذر بالخطر.",
      "ومع ذلك ، فقد توقفت الهندسة الجيولوجية العرضية الآن ، مما قد يشير إلى انخفاض في الارتفاع.",
      "تم التغاضي عن هذه القصة العلمية بسبب الأحداث الجارية ، لكنها تلقي الضوء على سبب محتمل لهذا الارتفاع."
    ],
    "commentSummary": [
      "تتمحور المناقشات حول التحديات والحلول المحتملة للتصدي لتغير المناخ.",
      "هناك جدل حول فعالية ومخاطر الهندسة الجيولوجية ، بما في ذلك الحد من انبعاثات الكبريت وحقن SO2 في الغلاف الجوي.",
      "يسلط المشاركون الضوء على الحاجة إلى تغييرات في نمط الحياة ، والتقدم التكنولوجي ، والتحول العالمي في العقلية لمكافحة تغير المناخ.",
      "تثار مخاوف بشأن إلحاح أزمة المناخ وفعالية التدابير الحالية.",
      "وتناقش النماذج المناخية والنظم السياسية والاقتصادية والعواقب المحتملة للتقليل من ارتفاع درجة الحرارة.",
      "يتم التطرق إلى مواضيع مثل المهاجرين والتلاعب بالجماهير والكتب المتعلقة بتغير المناخ.",
      "ويمتد النقاش أيضا إلى بناء محطات جديدة للطاقة النووية وإزالة الكربون من شبكات الكهرباء.",
      "تم ذكر حلول مثل احتجاز الكربون وتقنيات الطاقة الشمسية والبطاريات وتقليل عدد سكان العالم ، مع وجهات نظر مختلفة حول جدواها وفعاليتها."
    ],
    "points": 291,
    "commentCount": 315,
    "retryCount": 0,
    "time": 1691198818
  },
  {
    "id": 36997834,
    "title": "كسر سجل حرارة المحيط",
    "originLink": "https://www.bbc.com/news/science-environment-66387537",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36997834",
    "commentBody": "",
    "originSummary": [
      "وصلت المحيطات إلى أعلى درجة حرارة مسجلة ، متجاوزة الرقم القياسي السابق بمتوسط درجة حرارة سطح البحر العالمية اليومية البالغة 20.96 درجة مئوية (69.73 فهرنهايت).",
      "تساهم المحيطات الأكثر دفئا في ارتفاع مستويات غازات الدفيئة لأنها تقلل من القدرة على امتصاص ثاني أكسيد الكربون.",
      "ارتفاع درجات حرارة المحيطات له آثار سلبية مثل تعطيل الأنواع البحرية ، والتأثير على الأرصدة السمكية ، وتسريع ذوبان الأنهار الجليدية ، والتسبب في ارتفاع مستوى سطح البحر."
    ],
    "commentSummary": [
      "تغطي المناقشة حول Hacker News مواضيع مختلفة مثل الرأسمالية والتقدم التكنولوجي والنزعة الاستهلاكية وتغير المناخ والنمو السكاني.",
      "يعرب المشاركون عن مخاوفهم بشأن الآثار السلبية للجشع وسلوك البحث عن الربح على المجتمع والبيئة.",
      "تم اقتراح حلول بديلة لمعالجة عدم المساواة في الثروة وأزمة المناخ ، مع التركيز على القيادة العالمية والعمل الفوري لمكافحة تغير المناخ."
    ],
    "points": 251,
    "commentCount": 272,
    "retryCount": 0,
    "time": 1691143913
  }
]
