[
  {
    "id": 38724665,
    "title": "ArXiv zlepšuje prístupnosť výskumných prác vo formáte HTML",
    "originLink": "https://blog.arxiv.org/2023/12/21/accessibility-update-arxiv-now-offers-papers-in-html-format/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38724665",
    "commentBody": "",
    "originSummary": [
      "ArXiv teraz generuje HTML verzie výskumných prác predložených v TeXe/LaTeXe, aby sa zlepšila prístupnosť pre používateľov so zdravotným postihnutím.",
      "Formát HTML je kompatibilný s čítačkami obrazovky a inými asistenčnými technológiami, ktoré používajú výskumníci s poruchami čítania.",
      "Konverzia do HTML je ešte stále v experimentálnej fáze a nemusí presne konvertovať každý článok, ale autorov vyzývame, aby skontrolovali a zlepšili vykresľovanie."
    ],
    "commentSummary": [
      "ArXiv zaviedol formát HTML pre vedecké články, čím ich sprístupnil na mobilných zariadeniach a získal pozitívne ohlasy na tmavý režim a príjemné formátovanie.",
      "Diskutuje sa o tom, či by autori mali mať možnosť nahrávať svoje vlastné verzie HTML kvôli obavám o bezpečnosť a konzistenciu.",
      "Diskutuje sa o potrebe zlepšenia funkcií prístupnosti, ako sú priame odkazy na citácie a diskusné fóra, ako aj o riešeniach pre nevidiacich a o matematickom písaní Braillovým písmom."
    ],
    "points": 909,
    "commentCount": 252,
    "retryCount": 0,
    "time": 1703183693
  },
  {
    "id": 38725015,
    "title": "Hrdinovia podpory: Pozdrav tým, ktorí pracujú nepretržite, aby udržali systémy v chode",
    "originLink": "https://news.ycombinator.com/item?id=38725015",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38725015",
    "commentBody": "",
    "originSummary": [
      "Autor vyjadruje vďaku za úsilie, ktoré vynaložili na udržanie dostupnosti a bezpečnosti systémov.",
      "Autor opisuje osobnú skúsenosť, keď musel počas sviatkov cestovať do dátového centra v New Jersey, aby vyriešil naliehavú výrobnú chybu.",
      "To poukazuje na obetavosť a odhodlanie, ktoré sú potrebné na zabezpečenie bezproblémovej prevádzky kritických systémov aj v náročných podmienkach."
    ],
    "commentSummary": [
      "Diskusia zahŕňa širokú škálu tém, ako napríklad dôležitosť priznania si chýb, kultúrne rozdiely vo vyjadrovaní ospravedlnenia a výzvy v oblasti technickej podpory a služieb zákazníkom.",
      "Diskutuje sa aj o ťažkostiach, ktoré sa vyskytli počas dovolenkovej sezóny, a o vplyve aktualizácií a zavádzania softvéru.",
      "Medzi ďalšie body patrí skúsenosť s pracovnou pohotovosťou a význam stability, vďačnosti a riešenia problémov v rôznych odvetviach."
    ],
    "points": 783,
    "commentCount": 147,
    "retryCount": 0,
    "time": 1703184887
  },
  {
    "id": 38720656,
    "title": "Rozhranie API HotspotHelper spoločnosti Apple umožňuje sledovanie polohy bez súhlasu používateľa už takmer desať rokov",
    "originLink": "https://wingu.se/2023/11/30/only-apple-can-do-allow-apps-tracking-users-location-without-consensus.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38720656",
    "commentBody": "",
    "originSummary": [
      "Spoločnosť Apple už takmer desať rokov umožňuje aplikáciám sledovať polohu používateľov bez ich súhlasu alebo vedomia prostredníctvom rozhrania API HotspotHelper, čo vyvoláva obavy o ochranu súkromia.",
      "Veľké aplikácie, ako napríklad WeChat a Alipay, už túto možnosť zaviedli, čím ešte viac zintenzívnili vplyv sledovania polohy bez súhlasu.",
      "Odporúča sa, aby spoločnosť Apple poskytla používateľom možnosť vypnúť túto funkciu a vyžadovala výslovné povolenie na sledovanie polohy, pričom zostáva otázkou, či spoločnosť Apple dokáže vyvážiť ochranu súkromia a riešiť tieto obavy."
    ],
    "commentSummary": [
      "Diskusia sa zaoberá viacerými témami vrátane povolení aplikácií, používania mobilných zariadení v Ázii a obáv týkajúcich sa ochrany súkromia a kontroly v centralizovaných superaplikáciách.",
      "Používatelia vyjadrujú obavy z povolení na sledovanie polohy v aplikáciách pre iOS, ako sú WeChat a Alipay.",
      "V rozhovore sa skúma rozšírenosť mobilných super-aplikácií na čínskom trhu, pričom názory na pripojenie a dôsledky na súkromie sa líšia."
    ],
    "points": 747,
    "commentCount": 284,
    "retryCount": 0,
    "time": 1703168326
  },
  {
    "id": 38722246,
    "title": "Beeper spochybňuje zásahy spoločnosti Apple do ich aplikácie",
    "originLink": "https://blog.beeper.com/p/beeper-moving-forward",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38722246",
    "commentBody": "",
    "originSummary": [
      "Spoločnosť Apple údajne zasahuje do funkcie Beeper Mini, čo ju núti, aby svoj softvér na pripojenie k iMessage spravila open source a zamerala sa na vytvorenie najlepšej chatovacej aplikácie.",
      "Beeper tvrdí, že jeho aplikácia je bezpečná a v skutočnosti zvyšuje bezpečnosť konverzácií medzi používateľmi iPhonu a Androidu implementovaním koncového šifrovania.",
      "Spoločnosť Beeper kritizuje tvrdenia spoločnosti Apple a naznačuje, že Apple blokuje Beeper Mini na úkor svojich vlastných zákazníkov, pričom spochybňuje svoje plány na podporu RCS a vyjadruje obavy z kontroly spoločnosti Apple nad iMessage vzhľadom na jej dominantné postavenie na trhu."
    ],
    "commentSummary": [
      "Spoločnosť Beeper zverejnila svoj konektor iMessage ako projekt s otvoreným zdrojovým kódom, čo môže mať vplyv na náklady na testovanie hesiel.",
      "Samsung a Google môžu využiť kód Beepera na spochybnenie uzavretého ekosystému spoločnosti Apple, čo povedie k diskusiám o interoperabilite siete, ochrane súkromia a bezpečnosti.",
      "Spor sa točí okolo legálnosti aplikácie Beeper, jej potenciálu vyvolať žalobu zo strany spoločnosti Apple a dôsledkov nútenej interoperability na alternatívy aplikácií na zasielanie správ a platformu iMessage spoločnosti Apple."
    ],
    "points": 443,
    "commentCount": 706,
    "retryCount": 0,
    "time": 1703174718
  },
  {
    "id": 38720412,
    "title": "Vytvárajte autentické fantasy mapy so sadami štetcov zadarmo z #NoBadMaps",
    "originLink": "https://kmalexander.com/free-stuff/fantasy-map-brushes/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38720412",
    "commentBody": "",
    "originSummary": [
      "Projekt #NoBadMaps poskytuje bezplatné štetce a nástroje na vytváranie fantasy máp s historickou presnosťou.",
      "Sady štetcov sú inšpirované rôznymi časovými obdobiami a estetikou a ponúkajú jedinečné prvky a štýly na vytváranie odlišných máp.",
      "Všetky štetce sú voľne dostupné na použitie a sú vydané pod licenciou CC0, pričom podpora sa získava prostredníctvom nákupov, darov a príspevkov na Patreon."
    ],
    "commentSummary": [
      "Používatelia diskutujú o používaní sád štetcov na kreslenie fantasy máp a zdieľajú rôzne nástroje a techniky vrátane webovej stránky Fantasy Map Brushes.",
      "Tvorca hry Here Dragons Abound má súvisiaci blog a open source projekt o mapovaní a budovaní sveta.",
      "Medzi používateľmi existuje túžba po webovom nástroji na kreslenie máp s rôznymi funkciami a jedným z uvedených nástrojov je Inkarnate, ktorý ponúka používateľsky prívetivé rozhranie a bezplatnú verziu. Používanie sád štetcov v aplikácii Inkarnate pomáha šetriť čas a zachovať konzistentný estetický štýl pri vypĺňaní opakujúcich sa tvarov na mape."
    ],
    "points": 407,
    "commentCount": 40,
    "retryCount": 0,
    "time": 1703167010
  },
  {
    "id": 38720544,
    "title": "Google OAuth: Odhalenie jeho čiastočného rozdelenia",
    "originLink": "https://trufflesecurity.com/blog/google-oauth-is-broken-sort-of/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38720544",
    "commentBody": "",
    "originSummary": [
      "Blog sa zaoberá obavami týkajúcimi sa služby Google OAuth a upozorňuje, že je čiastočne nefunkčná.",
      "V texte sa neuvádza, ako je to konkrétne.",
      "Blog slúži ako prostriedok na upozornenie na problémy a potenciálne obmedzenia služby Google OAuth."
    ],
    "commentSummary": [
      "Diskusia sa točí okolo problémov a zraniteľností spojených so systémami Google OAuth, OpenID Connect a autentifikačnými systémami, ktoré používajú e-mailové adresy ako identifikátory používateľov.",
      "Obavy vzbudzuje zložitosť, bezpečnosť a overovacie procesy týchto systémov.",
      "Uvádzajú sa návrhy na zlepšenie bezpečnosti a používateľského komfortu, ako napríklad zavedenie potvrdzovacích e-mailov, preskúmanie alternatívnych metód autentifikácie (napríklad U2F alebo passkeys) a zváženie stabilných identifikátorov, napríklad GUID."
    ],
    "points": 334,
    "commentCount": 174,
    "retryCount": 0,
    "time": 1703167724
  },
  {
    "id": 38726389,
    "title": "Nemecký súd potvrdil právo používateľa používať blokovače reklamy",
    "originLink": "https://fsfe.org/news/2023/news-20231220-01.sl.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38726389",
    "commentBody": "",
    "originSummary": [
      "Dva nedávne súdne prípady v Nemecku sa zamerali na boj o kontrolu používateľov nad technológiami, konkrétne v súvislosti s blokátormi reklamy.",
      "Spoločnosť Axel Springer SE, významná vydavateľská spoločnosť, zažalovala spoločnosť Eyeo GmbH, tvorcu aplikácie Adblock Plus, za blokovanie ich reklám.",
      "Súd rozhodol v prospech spoločnosti Eyeo a potvrdil, že používatelia majú právo rozhodnúť sa, či budú používať blokovače reklám, a že neporušujú autorské práva. Spoločnosť Axel Springer však mohla používateľov s adblockermi vylúčiť z prístupu k svojmu obsahu a prípadne zaviesť platený model.",
      "Tieto prípady vytvárajú dôležité právne precedensy týkajúce sa slobody používateľov a práva na individuálne rozhodnutia pri používaní internetu."
    ],
    "commentSummary": [
      "Diskusia sa zameriava na používanie blokovačov reklám a na to, či by používatelia mali mať právo blokovať reklamy a kontrolovať svoj online zážitok.",
      "Poskytovatelia obsahu obhajujú svoje právo kontrolovať prístup k svojmu obsahu a určovať spôsob jeho zobrazovania.",
      "V rozhovore sa uvažuje aj o možnosti internetu bez reklám, o vplyve na webové stránky a tvorcov obsahu a o alternatívnych obchodných modeloch, ako je predplatné. Ďalšími problémami sú ochrana súkromia, škodlivý softvér a moc internetových gigantov."
    ],
    "points": 283,
    "commentCount": 241,
    "retryCount": 0,
    "time": 1703190399
  },
  {
    "id": 38720248,
    "title": "Výskum farmaceutov odhalil neúčinnosť perorálneho fenylefrínu a podnietil FDA k prijatiu opatrení",
    "originLink": "https://www.scientificamerican.com/article/how-two-pharmacists-figured-out-that-decongestants-dont-work/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38720248",
    "commentBody": "",
    "originSummary": [
      "Predpisy FDA obsahovali medzeru, ktorá umožňovala schvaľovanie a predaj neúčinných voľnopredajných dekongestívnych liekov spotrebiteľom.",
      "Trvalo viac ako desať rokov, kým sa FDA stotožnila so zisteniami dvoch lekárnikov, ktorí uskutočnili výskum a podali petíciu za stiahnutie výrobkov obsahujúcich perorálny fenylefrín z pultov.",
      "Tento prípad poukazuje na potrebu prehodnotiť regulačný proces pre voľnopredajné lieky schválené pred rokom 1962 a vyčleniť dodatočné finančné prostriedky na nezávislý výskum týchto výrobkov. Spotrebiteľom sa tiež odporúča, aby sa radili s lekárnikmi a zasadzovali sa za moderné vedecké preskúmanie starších voľnopredajných výrobkov."
    ],
    "commentSummary": [
      "Diskusia sa sústreďuje na účinnosť a kontroverzie týkajúce sa liekov ako fenylefrín a pseudoefedrín.",
      "Účastníci vyjadrujú frustráciu z dostupnosti liekov a obmedzení, pričom zdôrazňujú význam vedeckých dôkazov a individuálnych skúseností.",
      "Rozhovor poukazuje na zložitosť a rôzne pohľady na účinnosť liekov a zdôrazňuje potrebu ďalšieho výskumu a regulácie."
    ],
    "points": 268,
    "commentCount": 301,
    "retryCount": 0,
    "time": 1703166017
  },
  {
    "id": 38725264,
    "title": "Nástroj spoločnosti ProPublica na kontrolu domovov dôchodcov odhaľuje podrobnosti o vlastníctve v súvislosti so zodpovednosťou za kvalitu starostlivosti",
    "originLink": "https://www.propublica.org/article/find-nursing-home-ownership-information",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38725264",
    "commentBody": "",
    "originSummary": [
      "Nástroj ProPublica Nursing Home Inspect teraz obsahuje podrobné informácie o vlastníkoch, ktoré pomáhajú identifikovať osoby zodpovedné za kvalitu starostlivosti v domovoch dôchodcov.",
      "Nástroj využíva údaje z Centers for Medicare & Medicaid Services a poskytuje údaje o vlastníctve, riadiacej kontrole a sledovaní výkonnosti pridružených subjektov vo viacerých domovoch dôchodcov.",
      "Používatelia môžu využívať rozšírené možnosti vyhľadávania na identifikáciu subjektov, ktoré v minulosti vykazovali nedostatky alebo problémy s dodržiavaním predpisov.",
      "ProPublica plánuje tento nástroj v budúcnosti ďalej zlepšovať pridávaním nových údajov a funkcií."
    ],
    "commentSummary": [
      "V súčasnosti prebieha diskusia o miere zapojenia vlády do činnosti opatrovateľských domovov.",
      "Účastníci vyjadrujú obavy z nedostatočného personálu, nadmerného účtovania, nedostatočného dohľadu a potreby lepšej regulácie v oblasti starostlivosti o starších ľudí.",
      "Diskusia poukazuje na problémy pri hodnotení výkonnosti domovov dôchodcov a hľadaní spoľahlivých možností."
    ],
    "points": 259,
    "commentCount": 60,
    "retryCount": 0,
    "time": 1703186016
  },
  {
    "id": 38719918,
    "title": "Lekárne odovzdávajú lekárske záznamy bez príkazu, Kongres to vyšetruje",
    "originLink": "https://arstechnica.com/science/2023/12/cvs-rite-aid-walgreens-hand-out-medical-records-to-cops-without-warrants/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38719918",
    "commentBody": "",
    "originSummary": [
      "Najväčšie siete lekární v USA vrátane CVS, Rite Aid a Walgreens poskytujú orgánom činným v trestnom konaní citlivé lekárske záznamy bez súdneho príkazu alebo právneho preskúmania.",
      "Zákonodarcovia vyzývajú ministerstvo zdravotníctva a sociálnych služieb (HHS), aby revidovalo zákony o ochrane súkromia v zdravotníctve a vyžadovalo príkazy na vydanie zdravotných záznamov.",
      "Vyšetrovanie Kongresu zistilo, že spoločnosti CVS, The Kroger Company a Rite Aid Corporation sa pred zdieľaním lekárskych záznamov nekonzultujú s právnikmi a zákonodarcovia naliehajú na lekárne, aby prijali podobné postupy ako technologické spoločnosti, ako napríklad vyžadovanie príkazov a zverejňovanie výročných správ o transparentnosti s cieľom chrániť súkromie zákazníkov."
    ],
    "commentSummary": [
      "Polícia získava lekárske záznamy bez súdneho príkazu, čo predstavuje pre personál lekární problém pri plnení týchto požiadaviek alebo pri odolávaní im.",
      "Zdravotné sestry a lekárnici čelia tlaku, aby vykonávali zákroky bez riadneho povolenia, čo poukazuje na nedostatočnú zodpovednosť orgánov činných v trestnom konaní.",
      "Diskutuje sa o význame intervencie lekárnika, obavách o súkromie a potrebe úctivého dialógu o sporných otázkach, ako je napríklad interrupcia. Okrem toho sa diskutuje o účinnosti niektorých liekov, obmedzeniach ich dostupnosti a ťažkostiach pri získavaní receptov.",
      "Rozhovor zdôrazňuje dôležitosť zodpovednosti polície, zákonov o digitálnom súkromí a reforiem v systémoch zdravotnej starostlivosti a policajných systémoch."
    ],
    "points": 239,
    "commentCount": 246,
    "retryCount": 0,
    "time": 1703163902
  },
  {
    "id": 38721039,
    "title": "Rust napreduje smerom k umožneniu `async fn` v črtách s nadchádzajúcou verziou 1.75",
    "originLink": "https://blog.rust-lang.org/2023/12/21/async-fn-rpit-in-traits.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38721039",
    "commentBody": "",
    "originSummary": [
      "Pracovná skupina Rust Async dosiahla pokrok v umožnení používania `async fn` v traitoch.",
      "Nadchádzajúca verzia Rust 1.75 bude obsahovať podporu pre zápis `-> impl Trait` a `async fn` v traitoch.",
      "Pri používaní `-> impl Trait` vo verejných traitoch stále existujú obmedzenia, pretože do návratového typu nemožno pridať ďalšie ohraničenia."
    ],
    "commentSummary": [
      "Programovací jazyk Rust urobil významný pokrok v stabilizácii funkcií súvisiacich s asynchrónnym programovaním.",
      "V diskusii sa zdôrazňuje potreba zjednodušiť použiteľnosť týchto funkcií a štandardizovať rozhrania IO/čas.",
      "Vyskytli sa obavy týkajúce sa plytvania, implicitných alokácií, alokácií bez haldy a používania knižníc tretích strán.",
      "Atribút #[async_trait] je zdôraznený ako užitočný nástroj pre dynamické odosielanie v jazyku Rust."
    ],
    "points": 217,
    "commentCount": 38,
    "retryCount": 0,
    "time": 1703170054
  },
  {
    "id": 38728278,
    "title": "Pieskovisko ochrany osobných údajov spoločnosti Google v prehliadači Chrome: Ako zakázať sledovanie reklám",
    "originLink": "https://www.eff.org/deeplinks/2023/09/how-turn-googles-privacy-sandbox-ad-tracking-and-why-you-should",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38728278",
    "commentBody": "",
    "originSummary": [
      "Spoločnosť Google spustila v prehliadači Chrome funkciu \"Privacy Sandbox\", ktorá nahradí súbory cookie tretích strán \"Topics\" na sledovanie internetovej aktivity používateľov.",
      "Témy vytvárajú reklamné kategórie na základe navštívených webových stránok, čím spoločnosť Google získava kontrolu nad reklamným ekosystémom.",
      "Hoci spoločnosť Google tvrdí, že sa tým zvyšuje ochrana súkromia, návyky pri prehliadaní sú stále sledované na účely cielených reklám. Privacy Sandbox sa bude testovať do roku 2024, takže súbory cookie tretích strán budú dovtedy zhromažďovať a zdieľať údaje. Ovládacie prvky ochrany súkromia v prehliadači Chrome umožňujú používateľom vypnúť Privacy Sandbox. Firefox a Safari poskytujú viac možností ochrany súkromia."
    ],
    "commentSummary": [
      "V článku a diskusii sa zdôrazňujú obavy týkajúce sa ochrany súkromia v súvislosti s postupmi sledovania reklám spoločnosťou Google a ako riešenie sa odporúča používať alternatívne prehliadače, napríklad Firefox.",
      "Diskutuje sa o kontrole spoločnosti Google nad webom a o možných nevýhodách spoliehania sa na jedinú spoločnosť.",
      "Diskutuje sa aj o témach, ako je udržateľnosť reklamy bez sledovania, používanie rôznych prehliadačov na osobné a pracovné účely a obavy týkajúce sa postupov spoločnosti Google pri zdieľaní údajov. Dôraz sa kladie na ochranu súkromia, výber prehliadača a vplyv cielených reklám na skúsenosti používateľov."
    ],
    "points": 213,
    "commentCount": 166,
    "retryCount": 0,
    "time": 1703199435
  },
  {
    "id": 38725167,
    "title": "Apple sa snaží zvýšiť efektivitu umelej inteligencie v smartfónoch, potenciálny konkurent konkurencie",
    "originLink": "https://arstechnica.com/apple/2023/12/apple-wants-ai-to-run-directly-on-its-hardware-instead-of-in-the-cloud/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38725167",
    "commentBody": "",
    "originSummary": [
      "Spoločnosť Apple vydala výskumný dokument s názvom \"LLM in a Flash\", v ktorom opisuje svoje úsilie o spustenie veľkých jazykových modelov (LLM) v smartfónoch namiesto v cloude.",
      "Cieľom tohto prístupu je prekonať výpočtové obmedzenia smartfónov a umožniť rýchlejšie a offline reakcie asistentov AI, ako je napríklad Siri.",
      "Uprednostnením umelej inteligencie v zariadení by spoločnosť Apple mohla potenciálne posilniť ochranu súkromia a konkurovať ostatným technologickým gigantom v odvetví umelej inteligencie. Integráciu AI skúmajú aj ďalší výrobcovia smartfónov vrátane spoločnosti Samsung, aby oživili upadajúci trh so smartfónmi."
    ],
    "commentSummary": [
      "Spoločnosť Apple sa zaviazala priniesť funkcie umelej inteligencie (AI) priamo do svojho hardvéru, aby uprednostnila súkromie používateľov a poskytla im personalizovaný zážitok s AI.",
      "Používatelia sú vo všeobecnosti spokojní s funkciami popisu a vyhľadávania obrázkov v aplikácii Fotografie od spoločnosti Apple, ale v prípade iných ako latinských abecied existujú obmedzenia.",
      "Diskusia zahŕňa debaty o prístupe spoločnosti Apple zameranom na ochranu súkromia, potenciálnych nevýhodách jazykových modelov s umelou inteligenciou, ktoré nahrádzajú vyhľadávanie, technických výzvach strojového učenia v zariadeniach Apple a obmedzeniach aplikácie Siri."
    ],
    "points": 213,
    "commentCount": 190,
    "retryCount": 0,
    "time": 1703185598
  },
  {
    "id": 38722911,
    "title": "New York podáva žalobu na spoločnosť SiriusXM kvôli procesu zrušenia",
    "originLink": "https://www.theverge.com/2023/12/21/24010975/siriusxm-lawsuit-new-york-tish-james-cancel",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38722911",
    "commentBody": "",
    "originSummary": [
      "Spoločnosť SiriusXM čelí žalobe, ktorú podal štát New York v súvislosti s obvineniami, že predplatiteľom sťažuje zrušenie ich plánov.",
      "V žalobe sa uvádza, že spoločnosť zámerne vytvára zdĺhavý a frustrujúci proces pre zákazníkov.",
      "Newyorský generálny prokurátor žiada odškodnenie dotknutých zákazníkov a pokuty za každé porušenie.",
      "Spoločnosť SiriusXM reagovala a uviedla, že obvinenia skresľujú jej postupy a plánuje sa dôrazne brániť.",
      "Spoločnosť sa zameriava na podcasting a nedávno spustila aktualizovanú aplikáciu."
    ],
    "commentSummary": [
      "Súhrnný text zahŕňa diskusie na rôzne témy vrátane zrušenia predplatného, ťažkostí v procese zrušenia a frustrácie z poskytovateľov služieb.",
      "V súvislosti so skúsenosťami zákazníkov sa spomínajú konkrétne spoločnosti ako SiriusXM a LA Fitness.",
      "Diskutuje sa aj o širších témach, ako je ochrana osobných údajov, legislatíva a odmeňovanie zákazníkov, ako aj o otázkach súvisiacich s duálnymi grafickými kartami v prenosných počítačoch a vplyvom kapitalistických firemných politík na zamestnancov."
    ],
    "points": 206,
    "commentCount": 153,
    "retryCount": 0,
    "time": 1703177263
  },
  {
    "id": 38727987,
    "title": "Pašovanie SMTP: Posielanie podvrhnutých e-mailov po celom svete",
    "originLink": "https://sec-consult.com/blog/detail/smtp-smuggling-spoofing-e-mails-worldwide/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38727987",
    "commentBody": "",
    "originSummary": [
      "Výskumníci objavili techniku útoku nazývanú pašovanie SMTP, ktorá umožňuje aktérom hrozieb odosielať falošné e-maily z akejkoľvek e-mailovej adresy pomocou zraniteľných serverov SMTP.",
      "Zraniteľnosti v systémoch Microsoft a GMX boli opravené, ale spoločnostiam, ktoré používajú Cisco Secure Email, sa odporúča, aby manuálne aktualizovali svoju predvolenú konfiguráciu.",
      "Zraniteľnosť ovplyvňuje viacerých poskytovateľov e-mailových služieb na celom svete a výskumníci vytvorili analytický nástroj na kontrolu zraniteľnosti."
    ],
    "commentSummary": [
      "Pašovanie SMTP je metóda, ktorú útočníci používajú na manipuláciu so servermi SMTP a falšovanie e-mailov.",
      "V článku sa kritizuje dôraz na úspešné útoky namiesto zabezpečenia softvéru s otvoreným zdrojovým kódom a poukazuje sa na riziká pre bezpečnosť e-mailových systémov.",
      "V článku sa vyjadrujú obavy týkajúce sa predvolených nastavení spoločnosti Cisco a navrhuje sa použitie reštriktívnej politiky DMARC a SPF na zmiernenie rizík.",
      "Diskutuje sa o zraniteľnostiach e-mailového servera Postfix a o kontroverzii súvisiacej so zverejnením útoku na falšovanie e-mailov.",
      "CERT/CC povolil zverejnenie informácií o pašovaní SMTP, pretože ho považuje skôr za vlastnosť ako za chybu."
    ],
    "points": 204,
    "commentCount": 42,
    "retryCount": 0,
    "time": 1703197706
  }
]
