[
  {
    "id": 38724665,
    "title": "ArXiv ஆராய்ச்சிக் கட்டுரைகளுக்கான HTML பதிப்புகளுடன் அணுகலை மேம்படுத்துகிறது",
    "originLink": "https://blog.arxiv.org/2023/12/21/accessibility-update-arxiv-now-offers-papers-in-html-format/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38724665",
    "commentBody": "",
    "originSummary": [
      "குறைபாடுகள் உள்ள பயனர்களுக்கான அணுகலை மேம்படுத்துவதற்காக ArXiv இப்போது TeX / LaTeX இல் சமர்ப்பிக்கப்பட்ட ஆராய்ச்சி கட்டுரைகளின் HTML பதிப்புகளை உருவாக்குகிறது.",
      "எச்.டி.எம்.எல் வடிவம் ஸ்கிரீன் ரீடர்கள் மற்றும் வாசிப்பு குறைபாடுகள் உள்ள ஆராய்ச்சியாளர்களால் பயன்படுத்தப்படும் பிற உதவி தொழில்நுட்பங்களுடன் இணக்கமானது.",
      "எச்.டி.எம்.எல் மாற்றம் இன்னும் சோதனை கட்டத்தில் உள்ளது மற்றும் ஒவ்வொரு தாளையும் துல்லியமாக மாற்றாது, ஆனால் ஆசிரியர்கள் ரெண்டரிங்கை மதிப்பாய்வு செய்து மேம்படுத்த ஊக்குவிக்கப்படுகிறார்கள்."
    ],
    "commentSummary": [
      "ArXiv அறிவியல் கட்டுரைகளுக்கான HTML வடிவமைப்பை அறிமுகப்படுத்தியுள்ளது, அவை மொபைல் சாதனங்களில் மிகவும் அணுகக்கூடியதாக ஆக்குகின்றன மற்றும் அதன் இருண்ட பயன்முறை மற்றும் இனிமையான வடிவமைப்பிற்காக நேர்மறையான கருத்துக்களைப் பெறுகின்றன.",
      "பாதுகாப்பு மற்றும் நிலைத்தன்மை குறித்த கவலைகள் காரணமாக ஆசிரியர்கள் தங்கள் சொந்த எச்.டி.எம்.எல் பதிப்புகளைப் பதிவேற்ற அனுமதிக்கப்பட வேண்டுமா என்பது குறித்து ஒரு விவாதம் உள்ளது.",
      "நேரடி மேற்கோள் இணைப்புகள் மற்றும் கலந்துரையாடல் பலகைகள் போன்ற மேம்பட்ட அணுகல் அம்சங்களின் தேவை, அத்துடன் பார்வையற்றவர்களுக்கான தீர்வுகள் மற்றும் கணித பிரெய்லி தட்டச்சு ஆகியவை குறித்து விவாதங்கள் நடத்தப்படுகின்றன."
    ],
    "points": 909,
    "commentCount": 252,
    "retryCount": 0,
    "time": 1703183693
  },
  {
    "id": 38725015,
    "title": "ஆதரவு ஹீரோக்கள்: கணினிகளை இயக்க 24 மணி நேரமும் வேலை செய்பவர்களுக்கு வணக்கம்",
    "originLink": "https://news.ycombinator.com/item?id=38725015",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38725015",
    "commentBody": "",
    "originSummary": [
      "அமைப்புகளின் கிடைக்கும் தன்மையையும் பாதுகாப்பையும் பராமரிப்பதில் யாரோ ஒருவர் மேற்கொண்ட முயற்சிகளுக்கு ஆசிரியர் நன்றி தெரிவிக்கிறார்.",
      "ஒரு அவசர உற்பத்தி பிழையை நிவர்த்தி செய்வதற்காக விடுமுறையின் போது நியூ ஜெர்சியில் உள்ள ஒரு தரவு மையத்திற்கு அவர்கள் பயணிக்க வேண்டிய ஒரு தனிப்பட்ட அனுபவத்தை ஆசிரியர் விவரிக்கிறார்.",
      "இது சவாலான சூழ்நிலைகளில் கூட, முக்கியமான அமைப்புகளின் சீரான செயல்பாட்டை உறுதி செய்ய தேவையான அர்ப்பணிப்பு மற்றும் அர்ப்பணிப்பை எடுத்துக்காட்டுகிறது."
    ],
    "commentSummary": [
      "இந்த விவாதம் தவறுகளை சொந்தமாக்குவதன் முக்கியத்துவம், மன்னிப்புகளை வெளிப்படுத்துவதில் கலாச்சார வேறுபாடுகள் மற்றும் தொழில்நுட்ப ஆதரவு மற்றும் வாடிக்கையாளர் சேவையின் சவால்கள் போன்ற பரந்த அளவிலான தலைப்புகளை உள்ளடக்கியது.",
      "விடுமுறை காலங்களில் எதிர்கொள்ளும் சிரமங்கள் மற்றும் மென்பொருள் புதுப்பிப்புகள் மற்றும் வெளியீடுகளின் தாக்கம் குறித்தும் விவாதிக்கப்படுகிறது.",
      "மற்ற புள்ளிகளில் வேலைக்கு அழைப்பில் இருக்கும் அனுபவம் மற்றும் பல்வேறு தொழில்களில் ஸ்திரத்தன்மை, நன்றியுணர்வு மற்றும் சிக்கலைத் தீர்ப்பதன் முக்கியத்துவம் ஆகியவை அடங்கும்."
    ],
    "points": 783,
    "commentCount": 147,
    "retryCount": 0,
    "time": 1703184887
  },
  {
    "id": 38720656,
    "title": "ஆப்பிளின் ஹாட்ஸ்பாட்ஹெல்பர் ஏபிஐ கிட்டத்தட்ட ஒரு தசாப்தத்திற்கு பயனர் ஒப்புதல் இல்லாமல் இருப்பிட கண்காணிப்பை செயல்படுத்துகிறது",
    "originLink": "https://wingu.se/2023/11/30/only-apple-can-do-allow-apps-tracking-users-location-without-consensus.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38720656",
    "commentBody": "",
    "originSummary": [
      "ஹாட்ஸ்பாட்ஹெல்பர் ஏபிஐ மூலம் கிட்டத்தட்ட ஒரு தசாப்தமாக பயனர் இருப்பிடங்களை அவர்களின் ஒப்புதல் அல்லது அறிவு இல்லாமல் கண்காணிக்க ஆப்பிள் பயன்பாடுகளை அனுமதித்துள்ளது, இது தனியுரிமை கவலைகளை எழுப்புகிறது.",
      "வீசாட் மற்றும் அலிபே போன்ற முக்கிய பயன்பாடுகள் ஏற்கனவே இந்த திறனை செயல்படுத்தியுள்ளன, இது ஒப்புதல் இல்லாமல் இருப்பிட கண்காணிப்பின் தாக்கத்தை தீவிரப்படுத்துகிறது.",
      "இந்த அம்சத்தை முடக்குவதற்கான விருப்பத்தை ஆப்பிள் பயனர்களுக்கு வழங்க பரிந்துரைக்கப்படுகிறது மற்றும் இருப்பிட கண்காணிப்புக்கு வெளிப்படையான அனுமதி தேவைப்படுகிறது, அதே நேரத்தில் ஆப்பிள் தனியுரிமையை சமநிலைப்படுத்த முடியுமா மற்றும் இந்த கவலைகளை நிவர்த்தி செய்ய முடியுமா என்ற கேள்வி உள்ளது."
    ],
    "commentSummary": [
      "பயன்பாட்டு அனுமதிகள், ஆசியாவில் மொபைல் பயன்பாடு மற்றும் மையப்படுத்தப்பட்ட சூப்பர் பயன்பாடுகளில் தனியுரிமை மற்றும் கட்டுப்பாடு குறித்த கவலைகள் உள்ளிட்ட பல தலைப்புகளில் விவாதம் உரையாற்றுகிறது.",
      "வீசாட் மற்றும் அலிபே போன்ற ஐஓஎஸ் பயன்பாடுகளில் இருப்பிட கண்காணிப்பு அனுமதிகள் குறித்து பயனர்கள் கவலைகளை வெளிப்படுத்துகிறார்கள்.",
      "இந்த உரையாடல் சீன சந்தையில் மொபைல் சூப்பர் பயன்பாடுகளின் பரவலை ஆராய்கிறது, இணைப்பு மற்றும் தனியுரிமை தாக்கங்கள் குறித்து மாறுபட்ட கருத்துக்கள் உள்ளன."
    ],
    "points": 747,
    "commentCount": 284,
    "retryCount": 0,
    "time": 1703168326
  },
  {
    "id": 38722246,
    "title": "பீப்பர் தங்கள் பயன்பாட்டில் ஆப்பிளின் குறுக்கீட்டை எதிர்க்கிறது",
    "originLink": "https://blog.beeper.com/p/beeper-moving-forward",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38722246",
    "commentBody": "",
    "originSummary": [
      "ஆப்பிள் பீப்பரின் பீப்பர் மினி அம்சத்தில் தலையிடுவதாகக் கூறப்படுகிறது, இது பீப்பரை அவர்களின் ஐமெசேஜ் இணைப்பு மென்பொருளை திறந்த மூலமாக்கவும், சிறந்த அரட்டை பயன்பாட்டை உருவாக்குவதில் கவனம் செலுத்தவும் தூண்டுகிறது.",
      "பீப்பர் அதன் பயன்பாடு பாதுகாப்பானது மற்றும் எண்ட்-டு-எண்ட் குறியாக்கத்தை செயல்படுத்துவதன் மூலம் ஐபோன் மற்றும் ஆண்ட்ராய்டு பயனர்களுக்கு இடையிலான அரட்டைகளின் பாதுகாப்பை மேம்படுத்துகிறது என்று கூறுகிறது.",
      "பீப்பர் ஆப்பிளின் கூற்றுக்களை விமர்சிக்கிறார் மற்றும் ஆப்பிள் தங்கள் சொந்த வாடிக்கையாளர்களுக்கு தீங்கு விளைவிக்கும் வகையில் பீப்பர் மினியைத் தடுக்கிறது என்று பரிந்துரைக்கிறார், அதே நேரத்தில் ஆர்.சி.எஸ்ஸை ஆதரிப்பதற்கான அவர்களின் திட்டங்களை கேள்வி எழுப்புகிறார் மற்றும் அதன் மேலாதிக்க சந்தை நிலை காரணமாக ஐமெசேஜ் மீதான ஆப்பிளின் கட்டுப்பாடு குறித்த கவலைகளை வெளிப்படுத்துகிறார்."
    ],
    "commentSummary": [
      "பீப்பர் அதன் ஐமெசேஜ் இணைப்பை திறந்த மூல திட்டமாக வெளியிட்டுள்ளது, இது கடவுச்சொல் சோதனையின் செலவை பாதிக்கும்.",
      "சாம்சங் மற்றும் கூகிள் ஆப்பிளின் மூடிய சுற்றுச்சூழல் அமைப்புக்கு சவால் விட பீப்பரின் குறியீட்டைப் பயன்படுத்தக்கூடும், இது நெட்வொர்க் பரஸ்பர செயல்பாடு, தனியுரிமை மற்றும் பாதுகாப்பு குறித்த விவாதங்களுக்கு வழிவகுக்கும்.",
      "இந்த சர்ச்சை பீப்பரின் சட்டப்பூர்வத்தன்மை, ஆப்பிளிடமிருந்து ஒரு வழக்கைத் தூண்டும் திறன் மற்றும் செய்தியிடல் பயன்பாட்டு மாற்றுகள் மற்றும் ஆப்பிளின் ஐமெசேஜ் இயங்குதளத்தில் கட்டாய பரஸ்பர செயல்பாட்டின் தாக்கங்களைச் சுற்றி வருகிறது."
    ],
    "points": 443,
    "commentCount": 706,
    "retryCount": 0,
    "time": 1703174718
  },
  {
    "id": 38720412,
    "title": "#NoBadMaps இலவச தூரிகை தொகுப்புகளுடன் உண்மையான கற்பனை வரைபடங்களை உருவாக்கவும்",
    "originLink": "https://kmalexander.com/free-stuff/fantasy-map-brushes/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38720412",
    "commentBody": "",
    "originSummary": [
      "#NoBadMaps திட்டம் வரலாற்று துல்லியத்துடன் கற்பனை வரைபடங்களை உருவாக்குவதற்கான இலவச தூரிகைகள் மற்றும் கருவிகளை வழங்குகிறது.",
      "தூரிகைத் தொகுப்புகள் வெவ்வேறு காலகட்டங்கள் மற்றும் அழகியலால் ஈர்க்கப்பட்டு, தனித்துவமான வரைபடங்களை உருவாக்குவதற்கான தனித்துவமான கூறுகள் மற்றும் பாணிகளை வழங்குகின்றன.",
      "அனைத்து தூரிகைகளும் பயன்படுத்த இலவசமாகக் கிடைக்கின்றன மற்றும் கொள்முதல், நன்கொடைகள் மற்றும் பேட்ரியன் பங்களிப்புகள் மூலம் உருவாக்கப்பட்ட ஆதரவுடன் சிசி 0 உரிமத்தின் கீழ் வெளியிடப்படுகின்றன."
    ],
    "commentSummary": [
      "பயனர்கள் கற்பனை வரைபடங்களை வரைவதற்கும், வலைத்தளம் ஃபேண்டஸி மேப் தூரிகைகள் உட்பட பல்வேறு கருவிகள் மற்றும் நுட்பங்களைப் பகிர்வதற்கும் தூரிகை செட்களைப் பயன்படுத்துவது குறித்து விவாதிக்கின்றனர்.",
      "ஹியர் டிராகன்ஸ் அபவுண்டின் படைப்பாளி மேப்பிங் மற்றும் உலக கட்டுமானம் குறித்த தொடர்புடைய வலைப்பதிவு மற்றும் திறந்த மூல திட்டத்தைக் கொண்டுள்ளார்.",
      "வெவ்வேறு அம்சங்களைக் கொண்ட வலை அடிப்படையிலான வரைபட வரைதல் கருவிக்கான விருப்பம் பயனர்களிடையே உள்ளது, மேலும் குறிப்பிடப்பட்ட ஒரு கருவி இன்கார்னேட் ஆகும், இது பயனர் நட்பு இடைமுகம் மற்றும் இலவச பதிப்பை வழங்குகிறது. இன்கார்னேட்டில் தூரிகை செட்களைப் பயன்படுத்துவது நேரத்தை மிச்சப்படுத்தவும், வரைபடத்தில் மீண்டும் மீண்டும் வடிவங்களை நிரப்பும்போது நிலையான அழகியல் பாணியை பராமரிக்கவும் உதவுகிறது."
    ],
    "points": 407,
    "commentCount": 40,
    "retryCount": 0,
    "time": 1703167010
  },
  {
    "id": 38720544,
    "title": "கூகிள் ஓஆத்: அதன் பகுதி முறிவை வெளிப்படுத்துகிறது",
    "originLink": "https://trufflesecurity.com/blog/google-oauth-is-broken-sort-of/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38720544",
    "commentBody": "",
    "originSummary": [
      "வலைப்பதிவு கூகிள் ஓஆத் பற்றிய கவலைகளை நிவர்த்தி செய்கிறது மற்றும் அது ஓரளவு உடைந்துள்ளது என்பதை சுட்டிக்காட்டுகிறது.",
      "அது எவ்வாறு உடைக்கப்படுகிறது என்பதற்கான விவரங்கள் உரையில் குறிப்பிடப்படவில்லை.",
      "கூகிள் ஓஆத்தின் சிக்கல்கள் மற்றும் சாத்தியமான வரம்புகளுக்கு கவனத்தை ஈர்ப்பதற்கான ஒரு வழிமுறையாக வலைப்பதிவு செயல்படுகிறது."
    ],
    "commentSummary": [
      "மின்னஞ்சல் முகவரிகளை பயனர் அடையாளங்காட்டிகளாகப் பயன்படுத்தும் கூகிள் ஓஆத், ஓபன்ஐடி கனெக்ட் மற்றும் அங்கீகார அமைப்புகளுடன் தொடர்புடைய சிக்கல்கள் மற்றும் பாதிப்புகளைச் சுற்றி விவாதம் சுழல்கிறது.",
      "இந்த அமைப்புகளின் சிக்கலான தன்மை, பாதுகாப்பு மற்றும் சரிபார்ப்பு செயல்முறைகள் குறித்து கவலைகள் எழுப்பப்படுகின்றன.",
      "உறுதிப்படுத்தல் மின்னஞ்சல்களை செயல்படுத்துதல், மாற்று அங்கீகார முறைகளை ஆராய்தல் (யு 2 எஃப் அல்லது பாஸ்கிகள் போன்றவை) மற்றும் GUIDகள் போன்ற நிலையான அடையாளங்காட்டிகளைக் கருத்தில் கொள்வது போன்ற பாதுகாப்பு மற்றும் பயனர் அனுபவத்தை மேம்படுத்த பரிந்துரைகள் செய்யப்படுகின்றன."
    ],
    "points": 334,
    "commentCount": 174,
    "retryCount": 0,
    "time": 1703167724
  },
  {
    "id": 38726389,
    "title": "Adblockers பயன்படுத்தும் பயனரின் உரிமையை ஜேர்மன் நீதிமன்றம் உறுதி செய்தது",
    "originLink": "https://fsfe.org/news/2023/news-20231220-01.sl.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38726389",
    "commentBody": "",
    "originSummary": [
      "ஜேர்மனியில் சமீபத்திய இரண்டு நீதிமன்ற வழக்குகள் தொழில்நுட்பத்தின் மீதான பயனர் கட்டுப்பாட்டிற்கான போரில் கவனம் செலுத்தியுள்ளன, குறிப்பாக ஆட்பிளாக்கர்கள் தொடர்பாக.",
      "ஆக்செல் ஸ்பிரிங்கர் எஸ்.இ என்ற ஒரு பெரிய வெளியீட்டு நிறுவனம், ஆட்பிளாக் பிளஸின் படைப்பாளி ஐயோ ஜி.எம்.பி.எச் மீது தங்கள் விளம்பரங்களைத் தடுத்ததற்காக வழக்குத் தொடர்ந்தது.",
      "நீதிமன்றம் ஐயோவுக்கு ஆதரவாக தீர்ப்பளித்தது, ஆட்பிளாக்கர்களைப் பயன்படுத்தலாமா வேண்டாமா என்பதை தீர்மானிக்க பயனர்களுக்கு உரிமை உண்டு என்றும் அது பதிப்புரிமை சட்டங்களை மீறவில்லை என்றும் உறுதிப்படுத்தியது. இருப்பினும், ஆட்பிளாக்கர்களைக் கொண்ட பயனர்களை அவர்களின் உள்ளடக்கத்தை அணுகுவதிலிருந்து விலக்கவும் கட்டண மாதிரியை செயல்படுத்தவும் ஆக்செல் ஸ்பிரிங்கர் அனுமதிக்கப்பட்டார்.",
      "இந்த வழக்குகள் பயனர் சுதந்திரம் மற்றும் இணையத்தைப் பயன்படுத்தும் போது தனிப்பட்ட தேர்வுகளைச் செய்வதற்கான உரிமை தொடர்பான முக்கியமான சட்ட முன்னுதாரணங்களை நிறுவுகின்றன."
    ],
    "commentSummary": [
      "விவாதம் விளம்பர தடுப்பான்களைப் பயன்படுத்துவது மற்றும் விளம்பரங்களைத் தடுக்கவும், அவர்களின் ஆன்லைன் அனுபவத்தைக் கட்டுப்படுத்தவும் பயனர்களுக்கு உரிமை இருக்க வேண்டுமா என்பதில் கவனம் செலுத்துகிறது.",
      "உள்ளடக்க வழங்குநர்கள் தங்கள் உள்ளடக்கத்திற்கான அணுகலைக் கட்டுப்படுத்துவதற்கும் அது எவ்வாறு காண்பிக்கப்படுகிறது என்பதைத் தீர்மானிப்பதற்கும் தங்கள் உரிமைக்காக வாதிடுகின்றனர்.",
      "இந்த உரையாடல் விளம்பரம் இல்லாத இணையத்தின் சாத்தியம், வலைத்தளங்கள் மற்றும் உள்ளடக்க உருவாக்குநர்கள் மீதான தாக்கம் மற்றும் சந்தாக்கள் போன்ற மாற்று வணிக மாதிரிகளையும் கருத்தில் கொள்கிறது. தனியுரிமை, தீம்பொருள் மற்றும் இணைய ஜாம்பவான்களின் சக்தி ஆகியவை கூடுதல் கவலைகள்."
    ],
    "points": 283,
    "commentCount": 241,
    "retryCount": 0,
    "time": 1703190399
  },
  {
    "id": 38720248,
    "title": "மருந்தாளுநர்களின் ஆராய்ச்சி வாய்வழி ஃபைனிலெஃப்ரைனின் பயனற்ற தன்மையை அம்பலப்படுத்துகிறது, எஃப்.டி.ஏ நடவடிக்கையைத் தூண்டுகிறது",
    "originLink": "https://www.scientificamerican.com/article/how-two-pharmacists-figured-out-that-decongestants-dont-work/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38720248",
    "commentBody": "",
    "originSummary": [
      "எஃப்.டி.ஏ விதிமுறைகளில் ஒரு ஓட்டை இருந்தது, இது பயனற்ற ஓடிசி டிகோங்கஸ்டன்ட் மருந்துகளை அங்கீகரிக்கவும் நுகர்வோருக்கு விற்கவும் அனுமதித்தது.",
      "இரண்டு மருந்தாளுநர்களின் கண்டுபிடிப்புகளுடன் உடன்படுவதற்கு எஃப்.டி.ஏவுக்கு பத்து ஆண்டுகளுக்கும் மேலாக ஆனது, அவர்கள் ஆராய்ச்சி செய்து அலமாரிகளிலிருந்து வாய்வழி ஃபைனிலெஃப்ரின் கொண்ட தயாரிப்புகளை அகற்றுமாறு மனு அளித்தனர்.",
      "இந்த வழக்கு 1962 க்கு முந்தைய அங்கீகரிக்கப்பட்ட ஓடிசி மருந்துகளுக்கான ஒழுங்குமுறை செயல்முறையை மறுமதிப்பீடு செய்வதன் அவசியத்தை எடுத்துக்காட்டுகிறது மற்றும் இந்த தயாரிப்புகள் மீதான சுயாதீன ஆராய்ச்சிக்கு கூடுதல் நிதியை ஒதுக்குகிறது. நுகர்வோர் மருந்தாளுநர்களுடன் கலந்தாலோசிக்கவும், பழைய ஓடிசி தயாரிப்புகளின் நவீன அறிவியல் மதிப்புரைகளை ஆதரிக்கவும் ஊக்குவிக்கப்படுகிறார்கள்."
    ],
    "commentSummary": [
      "விவாதம் ஃபைனிலெஃப்ரின் மற்றும் சூடோபீட்ரின் போன்ற மருந்துகளைச் சுற்றியுள்ள செயல்திறன் மற்றும் சர்ச்சைகளை மையமாகக் கொண்டுள்ளது.",
      "பங்கேற்பாளர்கள் மருந்து கிடைக்கும் தன்மை மற்றும் கட்டுப்பாடுகள் குறித்து விரக்தியை வெளிப்படுத்துகிறார்கள், அறிவியல் சான்றுகள் மற்றும் தனிப்பட்ட அனுபவங்களின் முக்கியத்துவத்தை வலியுறுத்துகிறார்கள்.",
      "இந்த உரையாடல் மருந்து செயல்திறன் தொடர்பான சிக்கல்கள் மற்றும் மாறுபட்ட கண்ணோட்டங்களை எடுத்துக்காட்டுகிறது, கூடுதல் ஆராய்ச்சி மற்றும் ஒழுங்குமுறையின் அவசியத்தை அடிக்கோடிட்டுக் காட்டுகிறது."
    ],
    "points": 268,
    "commentCount": 301,
    "retryCount": 0,
    "time": 1703166017
  },
  {
    "id": 38725264,
    "title": "ProPublica இன் நர்சிங் ஹோம் ஆய்வு கருவி பராமரிப்பு பொறுப்பின் தரத்திற்கான உரிமையாளர் விவரங்களை வெளிப்படுத்துகிறது",
    "originLink": "https://www.propublica.org/article/find-nursing-home-ownership-information",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38725264",
    "commentBody": "",
    "originSummary": [
      "ProPublica இன் நர்சிங் ஹோம் இன்ஸ்பெக்ட் கருவி இப்போது நர்சிங் ஹோம் பராமரிப்பு தரத்திற்கு பொறுப்பானவர்களை அடையாளம் காண உதவும் விரிவான உரிமையாளர் தகவல்களை உள்ளடக்கியது.",
      "இந்த கருவி மெடிகேர் & மெடிகேர் சேவைகளுக்கான மையங்களின் தரவைப் பயன்படுத்துகிறது, உரிமை விவரங்கள், மேலாண்மை கட்டுப்பாடு மற்றும் பல நர்சிங் ஹோம்களில் இணைக்கப்பட்ட நிறுவனங்களின் செயல்திறன் கண்காணிப்பு ஆகியவற்றை வழங்குகிறது.",
      "கடந்தகால குறைபாடுகள் அல்லது இணக்க சிக்கல்களைக் கொண்ட நிறுவனங்களை அடையாளம் காண பயனர்கள் மேம்பட்ட தேடல் திறன்களைப் பயன்படுத்தலாம்.",
      "எதிர்காலத்தில் புதிய தரவு மற்றும் அம்சங்களைச் சேர்ப்பதன் மூலம் கருவியை மேலும் மேம்படுத்த புரோபப்ளிகா திட்டமிட்டுள்ளது."
    ],
    "commentSummary": [
      "நர்சிங் ஹோம் துறையில் அரசாங்கத்தின் ஈடுபாட்டின் அளவு குறித்து ஒரு விவாதம் நடந்து வருகிறது.",
      "பங்கேற்பாளர்கள் மோசமான ஊழியர்கள், அதிகப்படியான கட்டணம், மேற்பார்வையின்மை மற்றும் முதியோர் பராமரிப்பில் சிறந்த ஒழுங்குமுறையின் தேவை குறித்து கவலைகளை வெளிப்படுத்துகிறார்கள்.",
      "நர்சிங் ஹோம் செயல்திறனை மதிப்பீடு செய்வது மற்றும் நம்பகமான விருப்பங்களைக் கண்டுபிடிப்பதற்கான சவால்களை விவாதம் எடுத்துக்காட்டுகிறது."
    ],
    "points": 259,
    "commentCount": 60,
    "retryCount": 0,
    "time": 1703186016
  },
  {
    "id": 38719918,
    "title": "வாரண்ட் இல்லாமல் மருத்துவ ஆவணங்களை ஒப்படைக்கும் மருந்தகங்கள்: காங்கிரஸ் விசாரணை",
    "originLink": "https://arstechnica.com/science/2023/12/cvs-rite-aid-walgreens-hand-out-medical-records-to-cops-without-warrants/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38719918",
    "commentBody": "",
    "originSummary": [
      "சி.வி.எஸ், ரைட் எய்ட் மற்றும் வால்கிரீன்ஸ் உள்ளிட்ட அமெரிக்காவின் முக்கிய மருந்தக சங்கிலிகள், சட்ட அமலாக்க முகமைகளுக்கு வாரண்ட் அல்லது சட்ட மறுஆய்வு இல்லாமல் முக்கியமான மருத்துவ பதிவுகளை வழங்குகின்றன.",
      "மருத்துவ பதிவுகளை வெளியிடுவதற்கான உத்தரவாதங்களைக் கோருவதற்கு சுகாதார தனியுரிமை சட்டங்களை திருத்துமாறு சுகாதார மற்றும் மனித சேவைகள் துறைக்கு (எச்.எச்.எஸ்) சட்டமன்ற உறுப்பினர்கள் அழைப்பு விடுக்கின்றனர்.",
      "சி.வி.எஸ், தி க்ரோகர் நிறுவனம் மற்றும் ரைட் எய்ட் கார்ப்பரேஷன் ஆகியவை மருத்துவ பதிவுகளைப் பகிர்வதற்கு முன்பு சட்ட வல்லுநர்களுடன் கலந்தாலோசிக்கவில்லை என்று காங்கிரஸ் விசாரணையில் கண்டறியப்பட்டுள்ளது, மேலும் வாடிக்கையாளர் தனியுரிமையைப் பாதுகாக்க வாரண்ட்கள் கோருவது மற்றும் வருடாந்திர வெளிப்படைத்தன்மை அறிக்கைகளை வெளியிடுவது போன்ற தொழில்நுட்ப நிறுவனங்களைப் போன்ற நடைமுறைகளைப் பின்பற்றுமாறு சட்டமியற்றுபவர்கள் மருந்தகங்களை வலியுறுத்துகின்றனர்."
    ],
    "commentSummary": [
      "இந்த கோரிக்கைகளுக்கு இணங்குவதில் அல்லது எதிர்ப்பதில் மருந்தக ஊழியர்களுக்கு சவால்களை ஏற்படுத்தும் வகையில், போலீசார் வாரண்ட் இல்லாமல் மருத்துவ பதிவுகளைப் பெறுகிறார்கள்.",
      "செவிலியர்கள் மற்றும் மருந்தாளுநர்கள் முறையான அங்கீகாரம் இல்லாமல் நடைமுறைகளைச் செய்ய அழுத்தத்தை எதிர்கொள்கின்றனர், இது சட்ட அமலாக்கத்திற்கான பொறுப்பின்மையை எடுத்துக்காட்டுகிறது.",
      "மருந்தாளுநர் தலையீட்டின் முக்கியத்துவம், தனியுரிமை கவலைகள் மற்றும் கருக்கலைப்பு போன்ற சர்ச்சைக்குரிய விஷயங்களில் மரியாதைக்குரிய உரையாடலின் அவசியம் ஆகியவை விவாதிக்கப்படுகின்றன. கூடுதலாக, சில மருந்துகளின் செயல்திறன், அவற்றின் கிடைப்பதில் உள்ள வரம்புகள் மற்றும் மருந்துகளைப் பெறுவதில் உள்ள சிரமங்கள் ஆகியவை விவாதிக்கப்படுகின்றன.",
      "இந்த உரையாடல் காவல்துறை பொறுப்புடைமை, டிஜிட்டல் தனியுரிமை சட்டங்கள் மற்றும் சுகாதாரம் மற்றும் காவல் அமைப்புகளில் சீர்திருத்தங்களின் முக்கியத்துவத்தை அடிக்கோடிட்டுக் காட்டுகிறது."
    ],
    "points": 239,
    "commentCount": 246,
    "retryCount": 0,
    "time": 1703163902
  },
  {
    "id": 38721039,
    "title": "வரவிருக்கும் வெளியீடு 1.75 உடன் 'அசிங்க் எஃப்.என்' அம்சங்களை செயல்படுத்துவதை நோக்கி ரஸ்ட் முன்னேறுகிறது",
    "originLink": "https://blog.rust-lang.org/2023/12/21/async-fn-rpit-in-traits.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38721039",
    "commentBody": "",
    "originSummary": [
      "ரஸ்ட் அசிங்க் பணிக்குழு பண்புகளில் 'அசிங்க் எஃப்.என்' பயன்பாட்டை செயல்படுத்துவதில் முன்னேற்றம் கண்டுள்ளது.",
      "வரவிருக்கும் ரஸ்ட் 1.75 வெளியீட்டில் '-> ஐ.எம்.பி.எல் டிரைட்' குறியீட்டுக்கான ஆதரவு மற்றும் பண்புகளில் 'அசிங்க் எஃப்.என்' ஆகியவை அடங்கும்.",
      "பொதுப் பண்புகளில் '-> ஐ.எம்.எல் பண்பு' பயன்படுத்துவதில் வரம்புகள் இன்னும் உள்ளன, ஏனெனில் வருவாய் வகைக்கு கூடுதல் வரம்புகளைச் சேர்க்க முடியாது."
    ],
    "commentSummary": [
      "ரஸ்ட் நிரலாக்க மொழி அசிங்க் நிரலாக்கத்துடன் தொடர்புடைய அம்சங்களை உறுதிப்படுத்துவதில் குறிப்பிடத்தக்க முன்னேற்றம் கண்டுள்ளது.",
      "இந்த அம்சங்களின் பயன்பாட்டை எளிதாக்குவதற்கும் ஐஓ / நேர இடைமுகங்களை தரப்படுத்துவதற்கும் இந்த விவாதம் வலியுறுத்துகிறது.",
      "வீண் விரயம், மறைமுக ஒதுக்கீடுகள், குவியல் இல்லாத ஒதுக்கீடு மற்றும் மூன்றாம் தரப்பு நூலகங்களின் பயன்பாடு குறித்து கவலைகள் எழுப்பப்பட்டுள்ளன.",
      "#[async_trait] பண்புக்கூறு ரஸ்டில் டைனமிக் அனுப்புதலுக்கு ஒரு பயனுள்ள கருவியாக முன்னிலைப்படுத்தப்படுகிறது."
    ],
    "points": 217,
    "commentCount": 38,
    "retryCount": 0,
    "time": 1703170054
  },
  {
    "id": 38728278,
    "title": "குரோம் இல் கூகிளின் \"தனியுரிமை சாண்ட்பாக்ஸ்\" : விளம்பர கண்காணிப்பை முடக்குவது எப்படி",
    "originLink": "https://www.eff.org/deeplinks/2023/09/how-turn-googles-privacy-sandbox-ad-tracking-and-why-you-should",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38728278",
    "commentBody": "",
    "originSummary": [
      "பயனர்களின் இணைய செயல்பாட்டைக் கண்காணிக்க மூன்றாம் தரப்பு குக்கீகளுக்கு பதிலாக \"தலைப்புகள்\" என்று மாற்ற க்ரோமில் \"தனியுரிமை சாண்ட்பாக்ஸ்\" ஐ கூகிள் அறிமுகப்படுத்தியுள்ளது.",
      "பார்வையிடப்பட்ட வலைத்தளங்களின் அடிப்படையில் தலைப்புகள் விளம்பர வகைகளை உருவாக்குகின்றன, இது விளம்பர சுற்றுச்சூழல் அமைப்பின் மீது Google கட்டுப்பாட்டை வழங்குகிறது.",
      "இது தனியுரிமையை மேம்படுத்துகிறது என்று கூகிள் கூறினாலும், இலக்கு விளம்பரங்களுக்காக உலாவல் பழக்கங்கள் இன்னும் கண்காணிக்கப்படுகின்றன. தனியுரிமை சாண்ட்பாக்ஸ் 2024 வரை சோதிக்கப்படும், எனவே மூன்றாம் தரப்பு குக்கீகள் இதற்கிடையில் தரவைச் சேகரித்துப் பகிரும். Chrome இன் விளம்பர தனியுரிமை கட்டுப்பாடுகள் பயனர்கள் தனியுரிமை சாண்ட்பாக்ஸை முடக்க அனுமதிக்கின்றன. பயர்பாக்ஸ் மற்றும் சஃபாரி கூடுதல் தனியுரிமை விருப்பங்களை வழங்குகின்றன."
    ],
    "commentSummary": [
      "கட்டுரை மற்றும் விவாதம் கூகிளின் விளம்பர கண்காணிப்பு நடைமுறைகள் குறித்த தனியுரிமை கவலைகளை எடுத்துக்காட்டுகிறது மற்றும் பயர்பாக்ஸ் போன்ற மாற்று உலாவிகளைப் பயன்படுத்த பரிந்துரைக்கிறது.",
      "இணையத்தின் மீதான கூகிளின் கட்டுப்பாடு மற்றும் ஒரே நிறுவனத்தை நம்புவதன் சாத்தியமான குறைபாடுகள் குறித்து ஒரு விவாதம் உள்ளது.",
      "கண்காணிக்காமல் விளம்பரத்தின் நிலைத்தன்மை, தனிப்பட்ட மற்றும் பணி நோக்கங்களுக்காக வெவ்வேறு உலாவிகளைப் பயன்படுத்துதல் மற்றும் கூகிளின் தரவு பகிர்வு நடைமுறைகள் பற்றிய கவலைகள் போன்ற தலைப்புகளும் விவாதிக்கப்படுகின்றன. தனியுரிமை, உலாவி தேர்வு மற்றும் பயனர் அனுபவத்தில் இலக்கு விளம்பரங்களின் தாக்கம் ஆகியவற்றில் கவனம் செலுத்தப்படுகிறது."
    ],
    "points": 213,
    "commentCount": 166,
    "retryCount": 0,
    "time": 1703199435
  },
  {
    "id": 38725167,
    "title": "போட்டியாளர்களுக்கு போட்டியாக ஸ்மார்ட்போன்களில் செயற்கை நுண்ணறிவு செயல்திறனை அதிகரிப்பதை நோக்கமாகக் கொண்டுள்ளது ஆப்பிள்",
    "originLink": "https://arstechnica.com/apple/2023/12/apple-wants-ai-to-run-directly-on-its-hardware-instead-of-in-the-cloud/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38725167",
    "commentBody": "",
    "originSummary": [
      "பெரிய மொழி மாதிரிகளை (எல்.எல்.எம்) கிளவுட்டில் இயக்குவதை விட ஸ்மார்ட்போன்களில் இயக்குவதற்கான முயற்சிகளை கோடிட்டுக் காட்டும் \"எல்.எல்.எம் இன் எ ஃப்ளாஷ்\" என்ற ஆராய்ச்சிக் கட்டுரையை ஆப்பிள் வெளியிட்டுள்ளது.",
      "இந்த அணுகுமுறை ஸ்மார்ட்போன்களின் கணக்கீட்டு வரம்புகளை கடப்பதையும், சிரி போன்ற செயற்கை நுண்ணறிவு உதவியாளர்களிடமிருந்து விரைவான மற்றும் ஆஃப்லைன் பதில்களை செயல்படுத்துவதையும் நோக்கமாகக் கொண்டுள்ளது.",
      "ஆன்-டிவைஸ் செயற்கை நுண்ணறிவுக்கு முன்னுரிமை அளிப்பதன் மூலம், ஆப்பிள் தனியுரிமையை மேம்படுத்தலாம் மற்றும் செயற்கை நுண்ணறிவு துறையில் உள்ள பிற தொழில்நுட்ப ஜாம்பவான்களுடன் போட்டியிட முடியும். சாம்சங் உள்ளிட்ட பிற ஸ்மார்ட்போன் உற்பத்தியாளர்களும் சரிந்து வரும் ஸ்மார்ட்போன் சந்தைக்கு புத்துயிர் அளிக்க செயற்கை நுண்ணறிவு ஒருங்கிணைப்பை ஆராய்ந்து வருகின்றனர்."
    ],
    "commentSummary": [
      "பயனர் தனியுரிமைக்கு முன்னுரிமை அளிக்கவும், தனிப்பயனாக்கப்பட்ட செயற்கை நுண்ணறிவு அனுபவத்தை வழங்கவும் செயற்கை நுண்ணறிவு (ஏஐ) திறன்களை நேரடியாக அதன் வன்பொருளுக்கு கொண்டு வர ஆப்பிள் உறுதிபூண்டுள்ளது.",
      "ஆப்பிளின் புகைப்படங்கள் பயன்பாட்டில் சாதன பட விளக்கம் மற்றும் தேடல் அம்சங்களில் பயனர்கள் பொதுவாக மகிழ்ச்சியடைகிறார்கள், ஆனால் லத்தீன் அல்லாத எழுத்துக்களுடன் வரம்புகள் உள்ளன.",
      "ஆப்பிளின் தனியுரிமையை மையமாகக் கொண்ட அணுகுமுறை, தேடலை மாற்றும் செயற்கை நுண்ணறிவு மொழி மாதிரிகளின் சாத்தியமான குறைபாடுகள், ஆப்பிள் சாதனங்களில் இயந்திர கற்றலை இயக்குவதற்கான தொழில்நுட்ப சவால்கள் மற்றும் சிரியின் வரம்புகள் பற்றிய விவாதங்கள் இந்த விவாதத்தில் அடங்கும்."
    ],
    "points": 213,
    "commentCount": 190,
    "retryCount": 0,
    "time": 1703185598
  },
  {
    "id": 38722911,
    "title": "ரத்து நடவடிக்கை தொடர்பாக சிரியஸ்எக்ஸ்எம் மீது நியூயார்க் வழக்கு",
    "originLink": "https://www.theverge.com/2023/12/21/24010975/siriusxm-lawsuit-new-york-tish-james-cancel",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38722911",
    "commentBody": "",
    "originSummary": [
      "சந்தாதாரர்கள் தங்கள் திட்டங்களை ரத்து செய்வது சவாலானது என்ற குற்றச்சாட்டுகள் தொடர்பாக சிரியஸ்எக்ஸ்எம் நியூயார்க் மாநிலத்தால் தொடரப்பட்ட வழக்கை எதிர்கொள்கிறது.",
      "நிறுவனம் வேண்டுமென்றே வாடிக்கையாளர்களுக்கு ஒரு நீண்ட மற்றும் வெறுப்பூட்டும் செயல்முறையை உருவாக்குகிறது என்று வழக்கு கூறுகிறது.",
      "நியூயார்க்கின் அட்டர்னி ஜெனரல் பாதிக்கப்பட்ட வாடிக்கையாளர்களுக்கு இழப்பீடு மற்றும் ஒவ்வொரு மீறலுக்கும் அபராதம் கோருகிறார்.",
      "இதற்கு பதிலளித்த சிரியஸ்எக்ஸ்எம், குற்றச்சாட்டுகள் தங்கள் நடைமுறைகளை தவறாக சித்தரிப்பதாகவும், அவர்கள் தங்களை தீவிரமாக தற்காத்துக் கொள்ள திட்டமிட்டுள்ளதாகவும் கூறியுள்ளது.",
      "நிறுவனம் போட்காஸ்டிங்கில் கவனம் செலுத்தி வருகிறது மற்றும் சமீபத்தில் புதுப்பிக்கப்பட்ட பயன்பாட்டை அறிமுகப்படுத்தியது."
    ],
    "commentSummary": [
      "சுருக்கப்பட்ட உரை சந்தா ரத்து, ரத்து செயல்பாட்டில் சிரமங்கள் மற்றும் சேவை வழங்குநர்களுடனான விரக்திகள் உள்ளிட்ட பல்வேறு தலைப்புகளில் விவாதங்களை உள்ளடக்கியது.",
      "சிரியஸ்எக்ஸ்எம் மற்றும் எல்ஏ ஃபிட்னஸ் போன்ற குறிப்பிட்ட நிறுவனங்கள் வாடிக்கையாளர் அனுபவங்கள் தொடர்பாக குறிப்பிடப்பட்டுள்ளன.",
      "மடிக்கணினிகளில் இரட்டை வீடியோ அட்டைகள் மற்றும் ஊழியர்கள் மீதான முதலாளித்துவ நிறுவன கொள்கைகளின் செல்வாக்கு தொடர்பான பிரச்சினைகளுடன் தனியுரிமை, சட்டம் மற்றும் வாடிக்கையாளர் இழப்பீடு போன்ற பரந்த தலைப்புகளும் விவாதிக்கப்படுகின்றன."
    ],
    "points": 206,
    "commentCount": 153,
    "retryCount": 0,
    "time": 1703177263
  },
  {
    "id": 38727987,
    "title": "எஸ்.எம்.டி.பி கடத்தல்: உலகளவில் போலி மின்னஞ்சல்களை அனுப்புதல்",
    "originLink": "https://sec-consult.com/blog/detail/smtp-smuggling-spoofing-e-mails-worldwide/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38727987",
    "commentBody": "",
    "originSummary": [
      "பாதிக்கப்படக்கூடிய எஸ்.எம்.டி.பி சேவையகங்களைப் பயன்படுத்தி எந்தவொரு மின்னஞ்சல் முகவரியிலிருந்தும் போலி மின்னஞ்சல்களை அனுப்ப அச்சுறுத்தல் நடிகர்களை அனுமதிக்கும் எஸ்.எம்.டி.பி கடத்தல் என்ற தாக்குதல் நுட்பத்தை ஆராய்ச்சியாளர்கள் கண்டறிந்துள்ளனர்.",
      "மைக்ரோசாப்ட் மற்றும் ஜிஎம்எக்ஸில் உள்ள குறைபாடுகள் இணைக்கப்பட்டுள்ளன, ஆனால் சிஸ்கோ செக்யூர் மின்னஞ்சலைப் பயன்படுத்தும் நிறுவனங்கள் தங்கள் இயல்புநிலை உள்ளமைவை கைமுறையாக புதுப்பிக்க அறிவுறுத்தப்படுகின்றன.",
      "இந்த பாதிப்பு உலகளவில் பல மின்னஞ்சல் வழங்குநர்களை பாதிக்கிறது, மேலும் ஆராய்ச்சியாளர்கள் பாதிப்பை சரிபார்க்க ஒரு பகுப்பாய்வு கருவியை உருவாக்கியுள்ளனர்."
    ],
    "commentSummary": [
      "எஸ்.எம்.டி.பி கடத்தல் என்பது எஸ்.எம்.டி.பி சேவையகங்கள் மற்றும் ஸ்பூஃப் மின்னஞ்சல்களைக் கையாள தாக்குதல் நடத்துபவர்களால் பயன்படுத்தப்படும் ஒரு முறையாகும்.",
      "திறந்த மூல மென்பொருளைப் பாதுகாப்பதற்குப் பதிலாக வெற்றிகரமான தாக்குதல்களுக்கு முக்கியத்துவம் கொடுப்பதை கட்டுரை விமர்சிக்கிறது, மின்னஞ்சல் கணினி பாதுகாப்பிற்கான அபாயங்களை எடுத்துக்காட்டுகிறது.",
      "சிஸ்கோவின் இயல்புநிலை அமைப்புகள் குறித்து கவலைகள் எழுப்பப்படுகின்றன, மேலும் அபாயங்களைக் குறைக்க கட்டுப்படுத்தப்பட்ட டி.எம்.ஏ.ஆர்.சி கொள்கை மற்றும் எஸ்.பி.எஃப் ஆகியவற்றைப் பயன்படுத்த கட்டுரை பரிந்துரைக்கிறது.",
      "போஸ்ட்ஃபிக்ஸ் மின்னஞ்சல் சேவையகத்தில் உள்ள பாதிப்புகள் மற்றும் மின்னஞ்சல் ஸ்பூஃபிங் தாக்குதலை வெளிப்படுத்துவதைச் சுற்றியுள்ள சர்ச்சை விவாதிக்கப்படுகிறது.",
      "சி.இ.ஆர்.டி / சி.சி எஸ்.எம்.டி.பி கடத்தல் பற்றிய தகவல்களை பகிரங்கமாக வெளியிட அனுமதித்துள்ளது, இது ஒரு பிழையை விட ஒரு அம்சமாகக் கருதப்படுகிறது."
    ],
    "points": 204,
    "commentCount": 42,
    "retryCount": 0,
    "time": 1703197706
  }
]
