[
  {
    "id": 38724665,
    "title": "ArXiv forbedrer tilgængeligheden med HTML-versioner af forskningsartikler",
    "originLink": "https://blog.arxiv.org/2023/12/21/accessibility-update-arxiv-now-offers-papers-in-html-format/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38724665",
    "commentBody": "",
    "originSummary": [
      "ArXiv genererer nu HTML-versioner af forskningsartikler indsendt i TeX/LaTeX for at forbedre tilgængeligheden for brugere med handicap.",
      "HTML-formatet er kompatibelt med skærmlæsere og andre hjælpeteknologier, der bruges af forskere med læsevanskeligheder.",
      "HTML-konverteringen er stadig i den eksperimentelle fase og konverterer måske ikke alle artikler korrekt, men forfatterne opfordres til at gennemgå og forbedre gengivelsen."
    ],
    "commentSummary": [
      "ArXiv har introduceret HTML-format til videnskabelige artikler, hvilket gør dem mere tilgængelige på mobile enheder og får positiv feedback for sin mørke tilstand og behagelige formatering.",
      "Der er en debat om, hvorvidt forfattere skal have lov til at uploade deres egne HTML-versioner på grund af bekymringer om sikkerhed og konsistens.",
      "Der er diskussioner om behovet for forbedrede tilgængelighedsfunktioner som direkte citationslinks og diskussionsfora, samt løsninger til blinde og matematisk punktskrift."
    ],
    "points": 909,
    "commentCount": 252,
    "retryCount": 0,
    "time": 1703183693
  },
  {
    "id": 38725015,
    "title": "Supporthelte: En hyldest til dem, der arbejder døgnet rundt for at holde systemerne kørende",
    "originLink": "https://news.ycombinator.com/item?id=38725015",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38725015",
    "commentBody": "",
    "originSummary": [
      "Forfatteren udtrykker taknemmelighed over for nogen for deres indsats for at opretholde tilgængeligheden og sikkerheden af systemer.",
      "Forfatteren fortæller om en personlig oplevelse, hvor de var nødt til at rejse til et datacenter i New Jersey på en helligdag for at løse en presserende produktionsfejl.",
      "Det understreger den dedikation og det engagement, der kræves for at sikre en problemfri drift af kritiske systemer, selv under udfordrende omstændigheder."
    ],
    "commentSummary": [
      "Diskussionen omfatter en bred vifte af emner, såsom vigtigheden af at indrømme fejl, kulturelle variationer i at udtrykke undskyldninger og udfordringerne ved teknisk support og kundeservice.",
      "De vanskeligheder, man støder på i feriesæsonen, og virkningen af softwareopdateringer og udrulninger diskuteres også.",
      "Andre punkter omfatter oplevelsen af at være på tilkaldevagt og betydningen af stabilitet, taknemmelighed og problemløsning på tværs af forskellige brancher."
    ],
    "points": 783,
    "commentCount": 147,
    "retryCount": 0,
    "time": 1703184887
  },
  {
    "id": 38720656,
    "title": "Apples HotspotHelper API har muliggjort lokationssporing uden brugerens samtykke i næsten et årti",
    "originLink": "https://wingu.se/2023/11/30/only-apple-can-do-allow-apps-tracking-users-location-without-consensus.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38720656",
    "commentBody": "",
    "originSummary": [
      "Apple har tilladt apps at spore brugernes placering uden deres samtykke eller viden i næsten et årti gennem HotspotHelper API, hvilket har givet anledning til bekymringer om privatlivets fred.",
      "Store apps som WeChat og Alipay har allerede implementeret denne mulighed, hvilket intensiverer virkningen af lokationssporing uden samtykke.",
      "Det anbefales, at Apple giver brugerne mulighed for at deaktivere denne funktion og kræver udtrykkelig tilladelse til lokationssporing, mens spørgsmålet stadig er, om Apple kan balancere privatlivets fred og imødekomme disse bekymringer."
    ],
    "commentSummary": [
      "Diskussionen omhandler flere emner, herunder app-tilladelser, mobilbrug i Asien og bekymringer om privatliv og kontrol i centraliserede superapps.",
      "Brugere udtrykker bekymring over tilladelser til lokationssporing i iOS-apps som WeChat og Alipay.",
      "Samtalen udforsker udbredelsen af mobile super-apps på det kinesiske marked, med forskellige meninger om tilslutningsmuligheder og konsekvenser for privatlivets fred."
    ],
    "points": 747,
    "commentCount": 284,
    "retryCount": 0,
    "time": 1703168326
  },
  {
    "id": 38722246,
    "title": "Beeper udfordrer Apples indblanding i deres app",
    "originLink": "https://blog.beeper.com/p/beeper-moving-forward",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38722246",
    "commentBody": "",
    "originSummary": [
      "Apple blander sig angiveligt i Beepers Beeper Mini-funktion, hvilket får Beeper til at gøre deres iMessage-forbindelsessoftware til open source og fokusere på at bygge den bedste chat-app.",
      "Beeper hævder, at deres app er sikker og faktisk forbedrer sikkerheden for chats mellem iPhone- og Android-brugere ved at implementere end-to-end-kryptering.",
      "Beeper kritiserer Apples påstande og antyder, at Apple blokerer Beeper Mini til skade for deres egne kunder, mens de sætter spørgsmålstegn ved deres planer om at understøtte RCS og udtrykker bekymring over Apples kontrol over iMessage på grund af deres dominerende markedsposition."
    ],
    "commentSummary": [
      "Beeper har frigivet sin iMessage-connector som et open source-projekt, hvilket potentielt kan påvirke omkostningerne ved password-test.",
      "Samsung og Google kan udnytte Beepers kode til at udfordre Apples lukkede økosystem, hvilket fører til debatter om netværksinteroperabilitet, privatliv og sikkerhed.",
      "Kontroversen drejer sig om Beepers lovlighed, dens potentiale til at fremprovokere et sagsanlæg fra Apple og konsekvenserne af tvungen interoperabilitet for alternative messaging-apps og Apples iMessage-platform."
    ],
    "points": 443,
    "commentCount": 706,
    "retryCount": 0,
    "time": 1703174718
  },
  {
    "id": 38720412,
    "title": "Skab autentiske fantasikort med gratis penselsæt fra #NoBadMaps",
    "originLink": "https://kmalexander.com/free-stuff/fantasy-map-brushes/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38720412",
    "commentBody": "",
    "originSummary": [
      "Projektet #NoBadMaps giver gratis pensler og værktøjer til at skabe fantasikort med historisk nøjagtighed.",
      "Penselsættene er inspireret af forskellige tidsperioder og æstetik og tilbyder unikke elementer og stilarter til at skabe forskellige kort.",
      "Alle pensler er frit tilgængelige til brug og udgives under en CC0-licens, med støtte genereret gennem køb, donationer og Patreon-bidrag."
    ],
    "commentSummary": [
      "Brugere diskuterer brugen af penselsæt til at tegne fantasikort og deler forskellige værktøjer og teknikker, herunder hjemmesiden Fantasy Map Brushes.",
      "Skaberen af Here Dragons Abound har en relateret blog og et open source-projekt om kortlægning og verdensopbygning.",
      "Der er et ønske blandt brugerne om et webbaseret korttegningsværktøj med forskellige funktioner, og et nævnt værktøj er Inkarnate, som tilbyder en brugervenlig grænseflade og en gratis version. Brugen af penselsæt i Inkarnate hjælper med at spare tid og opretholde en konsekvent æstetisk stil, når man udfylder gentagne former på et kort."
    ],
    "points": 407,
    "commentCount": 40,
    "retryCount": 0,
    "time": 1703167010
  },
  {
    "id": 38720544,
    "title": "Google OAuth: Afdækning af dens delvise sammenbrud",
    "originLink": "https://trufflesecurity.com/blog/google-oauth-is-broken-sort-of/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38720544",
    "commentBody": "",
    "originSummary": [
      "Bloggen adresserer bekymringer vedrørende Google OAuth og påpeger, at det er delvist ødelagt.",
      "De nærmere detaljer om, hvordan den brydes, er ikke nævnt i teksten.",
      "Bloggen fungerer som et middel til at gøre opmærksom på problemerne og de potentielle begrænsninger ved Google OAuth."
    ],
    "commentSummary": [
      "Diskussionen drejer sig om de problemer og sårbarheder, der er forbundet med Google OAuth, OpenID Connect og autentificeringssystemer, der bruger e-mailadresser som brugeridentifikatorer.",
      "Der er bekymring for kompleksiteten, sikkerheden og verifikationsprocesserne i disse systemer.",
      "Der er forslag til at forbedre sikkerheden og brugeroplevelsen, såsom at implementere bekræftelsesmails, udforske alternative autentificeringsmetoder (som U2F eller passkeys) og overveje stabile identifikatorer som GUID'er."
    ],
    "points": 334,
    "commentCount": 174,
    "retryCount": 0,
    "time": 1703167724
  },
  {
    "id": 38726389,
    "title": "Tysk domstol stadfæster brugeres ret til at bruge adblockere",
    "originLink": "https://fsfe.org/news/2023/news-20231220-01.sl.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38726389",
    "commentBody": "",
    "originSummary": [
      "To nylige retssager i Tyskland har fokuseret på kampen for brugerkontrol over teknologi, især i forhold til adblockere.",
      "Axel Springer SE, et stort forlag, sagsøgte Eyeo GmbH, skaberen af Adblock Plus, for at blokere deres reklamer.",
      "Retten dømte til fordel for Eyeo og bekræftede, at brugerne har ret til at beslutte, om de vil bruge adblockere eller ej, og at det ikke er i strid med ophavsretsloven. Axel Springer fik dog lov til at udelukke brugere med adblockere fra at få adgang til deres indhold og potentielt implementere en betalingsmodel.",
      "Disse sager skaber vigtig juridisk præcedens for brugerfrihed og retten til at træffe individuelle valg, når man bruger internettet."
    ],
    "commentSummary": [
      "Diskussionen fokuserer på brugen af annonceblokkere, og om brugerne skal have ret til at blokere annoncer og kontrollere deres onlineoplevelse.",
      "Indholdsudbydere argumenterer for deres ret til at kontrollere adgangen til deres indhold og bestemme, hvordan det skal vises.",
      "Samtalen handler også om muligheden for et reklamefrit internet, indvirkningen på hjemmesider og indholdsskabere og alternative forretningsmodeller som abonnementer. Privatliv, malware og internetgiganternes magt er yderligere bekymringer."
    ],
    "points": 283,
    "commentCount": 241,
    "retryCount": 0,
    "time": 1703190399
  },
  {
    "id": 38720248,
    "title": "Farmaceuters forskning afslører ineffektivitet ved oral phenylephrin og får FDA til at gribe ind",
    "originLink": "https://www.scientificamerican.com/article/how-two-pharmacists-figured-out-that-decongestants-dont-work/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38720248",
    "commentBody": "",
    "originSummary": [
      "FDA's regler indeholdt et smuthul, der gjorde det muligt at godkende og sælge virkningsløse håndkøbsmedicin til forbrugerne.",
      "Det tog mere end ti år for FDA at acceptere resultaterne fra to farmaceuter, der udførte forskning og anmodede om fjernelse af produkter, der indeholdt oral phenylephrin, fra hylderne.",
      "Denne sag understreger nødvendigheden af at revurdere den regulatoriske proces for håndkøbsmedicin, der er godkendt før 1962, og afsætte yderligere midler til uafhængig forskning i disse produkter. Forbrugere opfordres også til at rådføre sig med apotekere og advokere for moderne videnskabelige gennemgange af ældre håndkøbsmedicin."
    ],
    "commentSummary": [
      "Diskussionen drejer sig om effektiviteten og kontroverserne omkring medicin som phenylephrin og pseudoephedrin.",
      "Deltagerne udtrykker frustration over medicinens tilgængelighed og restriktioner og understreger vigtigheden af videnskabelig evidens og individuelle erfaringer.",
      "Samtalen fremhæver kompleksiteten og de forskellige perspektiver i forhold til medicins effektivitet og understreger behovet for yderligere forskning og regulering."
    ],
    "points": 268,
    "commentCount": 301,
    "retryCount": 0,
    "time": 1703166017
  },
  {
    "id": 38725264,
    "title": "ProPublicas værktøj til plejehjemsinspektion afslører ejerskabsoplysninger for ansvar for plejekvalitet",
    "originLink": "https://www.propublica.org/article/find-nursing-home-ownership-information",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38725264",
    "commentBody": "",
    "originSummary": [
      "ProPublicas værktøj Nursing Home Inspect indeholder nu detaljerede oplysninger om ejerskab for at hjælpe med at identificere dem, der er ansvarlige for plejehjemmenes kvalitet.",
      "Værktøjet bruger data fra Centers for Medicare & Medicaid Services og giver oplysninger om ejerskab, ledelsesmæssig kontrol og præstationssporing af tilknyttede enheder på tværs af flere plejehjem.",
      "Brugere kan bruge avancerede søgefunktioner til at identificere enheder med tidligere mangler eller compliance-problemer.",
      "ProPublica har planer om at forbedre værktøjet yderligere ved at tilføje nye data og funktioner i fremtiden."
    ],
    "commentSummary": [
      "Der er en løbende debat om, hvor meget staten skal blande sig i plejehjemsbranchen.",
      "Deltagerne udtrykker bekymring over dårlig bemanding, overfakturering, manglende tilsyn og behovet for bedre regulering i ældreplejen.",
      "Diskussionen fremhæver udfordringerne ved at evaluere plejehjems præstationer og finde pålidelige løsninger."
    ],
    "points": 259,
    "commentCount": 60,
    "retryCount": 0,
    "time": 1703186016
  },
  {
    "id": 38719918,
    "title": "Apoteker udleverer journaler uden dommerkendelse - Kongressen undersøger sagen",
    "originLink": "https://arstechnica.com/science/2023/12/cvs-rite-aid-walgreens-hand-out-medical-records-to-cops-without-warrants/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38719918",
    "commentBody": "",
    "originSummary": [
      "Store apotekskæder i USA, herunder CVS, Rite Aid og Walgreens, giver de retshåndhævende myndigheder adgang til følsomme lægejournaler uden dommerkendelse eller juridisk gennemgang.",
      "Lovgivere opfordrer Department of Health and Human Services (HHS) til at revidere lovgivningen om privatlivets fred på sundhedsområdet, så der kræves dommerkendelser for udlevering af lægejournaler.",
      "Kongressens undersøgelse viste, at CVS, The Kroger Company og Rite Aid Corporation ikke rådfører sig med jurister, før de deler lægejournaler, og lovgiverne opfordrer apotekerne til at indføre praksisser, der ligner teknologivirksomhedernes, såsom at kræve dommerkendelser og offentliggøre årlige gennemsigtighedsrapporter for at beskytte kundernes privatliv."
    ],
    "commentSummary": [
      "Politiet indhenter lægejournaler uden dommerkendelse, hvilket giver apotekspersonalet udfordringer med at efterkomme eller modsætte sig disse anmodninger.",
      "Sygeplejersker og farmaceuter udsættes for pres for at udføre procedurer uden korrekt autorisation, hvilket understreger den manglende ansvarlighed for retshåndhævelse.",
      "Vigtigheden af farmaceutens indgriben, privatlivets fred og behovet for en respektfuld dialog om kontroversielle emner som abort diskuteres. Derudover diskuteres effektiviteten af visse medikamenter, begrænsninger i deres tilgængelighed og vanskeligheder med at få recepter.",
      "Samtalen understreger vigtigheden af politiets ansvarlighed, love om digitalt privatliv og reformer i sundheds- og politisystemerne."
    ],
    "points": 239,
    "commentCount": 246,
    "retryCount": 0,
    "time": 1703163902
  },
  {
    "id": 38721039,
    "title": "Rust gør fremskridt mod at muliggøre `async fn` i traits med den kommende version 1.75",
    "originLink": "https://blog.rust-lang.org/2023/12/21/async-fn-rpit-in-traits.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38721039",
    "commentBody": "",
    "originSummary": [
      "Rust Async Working Group har gjort fremskridt med at muliggøre brugen af `async fn` i traits.",
      "Den kommende Rust 1.75-udgivelse vil indeholde understøttelse af `-> impl Trait`-notation og `async fn` i traits.",
      "Der er stadig begrænsninger ved at bruge `-> impl Trait` i offentlige træk, da der ikke kan tilføjes yderligere grænser til returtypen."
    ],
    "commentSummary": [
      "Rust programmeringssprog har gjort betydelige fremskridt med at stabilisere funktioner relateret til asynkron programmering.",
      "Diskussionen understreger behovet for at forenkle brugervenligheden af disse funktioner og standardisere IO/time-grænseflader.",
      "Der er blevet rejst bekymringer om spild, implicitte allokeringer, ikke-heap-allokering og brugen af tredjepartsbiblioteker.",
      "Attributten #[async_trait] fremhæves som et nyttigt værktøj til dynamisk ekspedition i Rust."
    ],
    "points": 217,
    "commentCount": 38,
    "retryCount": 0,
    "time": 1703170054
  },
  {
    "id": 38728278,
    "title": "Googles \"Privacy Sandbox\" i Chrome: Sådan deaktiverer du annoncesporing",
    "originLink": "https://www.eff.org/deeplinks/2023/09/how-turn-googles-privacy-sandbox-ad-tracking-and-why-you-should",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38728278",
    "commentBody": "",
    "originSummary": [
      "Google har lanceret \"Privacy Sandbox\" i Chrome for at erstatte tredjepartscookies med \"Topics\" til sporing af brugernes internetaktivitet.",
      "Emner genererer reklamekategorier baseret på besøgte hjemmesider, hvilket giver Google kontrol over reklameøkosystemet.",
      "Selvom Google hævder, at dette forbedrer privatlivets fred, spores browsingvaner stadig til målrettede annoncer. Privacy Sandbox vil blive testet indtil 2024, så tredjepartscookies vil indsamle og dele data i mellemtiden. Chromes privatlivsindstillinger for annoncer giver brugerne mulighed for at deaktivere Privacy Sandbox. Firefox og Safari giver flere privatlivsindstillinger."
    ],
    "commentSummary": [
      "Artiklen og diskussionen fremhæver bekymringer om privatlivets fred i forbindelse med Googles annoncesporingspraksis og anbefaler at bruge alternative browsere som Firefox som en løsning.",
      "Der er en debat om Googles kontrol over internettet og de potentielle ulemper ved at forlade sig på en enkelt virksomhed.",
      "Emner som bæredygtigheden af reklamer uden sporing, brug af forskellige browsere til personlige og arbejdsmæssige formål og bekymringer om Googles datadelingspraksis diskuteres også. Fokus er på privatlivets fred, browservalg og målrettede annoncers indvirkning på brugeroplevelsen."
    ],
    "points": 213,
    "commentCount": 166,
    "retryCount": 0,
    "time": 1703199435
  },
  {
    "id": 38725167,
    "title": "Apple sigter mod at øge AI-effektiviteten på smartphones, potentiel rival til konkurrenterne",
    "originLink": "https://arstechnica.com/apple/2023/12/apple-wants-ai-to-run-directly-on-its-hardware-instead-of-in-the-cloud/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38725167",
    "commentBody": "",
    "originSummary": [
      "Apple har udgivet et forskningspapir kaldet \"LLM in a Flash\", der beskriver deres bestræbelser på at køre store sprogmodeller (LLM'er) på smartphones i stedet for i skyen.",
      "Denne tilgang sigter mod at overvinde de beregningsmæssige begrænsninger i smartphones og muliggøre hurtigere og offline svar fra AI-assistenter som Siri.",
      "Ved at prioritere on-device AI kan Apple potentielt forbedre privatlivets fred og konkurrere med andre tech-giganter i AI-branchen. Andre smartphone-producenter, herunder Samsung, udforsker også AI-integration for at revitalisere det faldende smartphone-marked."
    ],
    "commentSummary": [
      "Apple har forpligtet sig til at bringe kunstig intelligens (AI) direkte til sin hardware for at prioritere brugernes privatliv og levere en personlig AI-oplevelse.",
      "Brugerne er generelt glade for billedbeskrivelses- og søgefunktionerne i Apples Fotos-app, men der er begrænsninger med ikke-latinske alfabeter.",
      "Diskussionen omfatter debatter om Apples privatlivsfokuserede tilgang, de potentielle ulemper ved AI-sprogmodeller, der erstatter søgning, tekniske udfordringer ved at køre maskinlæring på Apple-enheder og begrænsningerne ved Siri."
    ],
    "points": 213,
    "commentCount": 190,
    "retryCount": 0,
    "time": 1703185598
  },
  {
    "id": 38722911,
    "title": "New York lægger sag an mod SiriusXM på grund af opsigelsesproces",
    "originLink": "https://www.theverge.com/2023/12/21/24010975/siriusxm-lawsuit-new-york-tish-james-cancel",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38722911",
    "commentBody": "",
    "originSummary": [
      "SiriusXM er blevet sagsøgt af staten New York på grund af beskyldninger om at gøre det vanskeligt for abonnenter at opsige deres abonnementer.",
      "Sagsanlægget hævder, at virksomheden med vilje skaber en langvarig og frustrerende proces for kunderne.",
      "New Yorks statsadvokat kræver erstatning for de berørte kunder og bøder for hver overtrædelse.",
      "SiriusXM har svaret, at beskyldningerne giver et forkert billede af deres praksis, og at de har tænkt sig at forsvare sig kraftigt.",
      "Virksomheden har fokuseret på podcasting og har for nylig lanceret en opdateret app."
    ],
    "commentSummary": [
      "Den sammenfattede tekst dækker diskussioner om forskellige emner, herunder opsigelser af abonnementer, vanskeligheder i opsigelsesprocessen og frustrationer over tjenesteudbydere.",
      "Specifikke virksomheder som SiriusXM og LA Fitness nævnes i forbindelse med kundeoplevelser.",
      "Bredere emner som privatliv, lovgivning og kundekompensation diskuteres også sammen med spørgsmål relateret til dobbelte grafikkort på bærbare computere og indflydelsen af kapitalistiske virksomhedspolitikker på medarbejderne."
    ],
    "points": 206,
    "commentCount": 153,
    "retryCount": 0,
    "time": 1703177263
  },
  {
    "id": 38727987,
    "title": "SMTP-smugling: Afsendelse af forfalskede e-mails globalt",
    "originLink": "https://sec-consult.com/blog/detail/smtp-smuggling-spoofing-e-mails-worldwide/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38727987",
    "commentBody": "",
    "originSummary": [
      "Forskere har opdaget en angrebsteknik kaldet SMTP-smugling, der gør det muligt for trusselsaktører at sende falske e-mails fra enhver e-mailadresse ved hjælp af sårbare SMTP-servere.",
      "Sårbarheder i Microsoft og GMX er blevet lappet, men virksomheder, der bruger Cisco Secure Email, rådes til manuelt at opdatere deres standardkonfiguration.",
      "Sårbarheden påvirker flere e-mailudbydere globalt, og forskerne har lavet et analyseværktøj til at tjekke for sårbarheden."
    ],
    "commentSummary": [
      "SMTP-smugling er en metode, der bruges af angribere til at manipulere SMTP-servere og forfalske e-mails.",
      "Artiklen kritiserer vægten på vellykkede angreb i stedet for at sikre open source-software og fremhæver risikoen for e-mailsystemers sikkerhed.",
      "Der udtrykkes bekymring over standardindstillingerne i Cisco, og artiklen foreslår, at man bruger en restriktiv DMARC-politik og SPF for at mindske risikoen.",
      "Sårbarhederne i e-mail-serveren Postfix og kontroversen omkring afsløringen af et e-mail-spoofing-angreb diskuteres.",
      "CERT/CC har tilladt offentliggørelse af oplysninger om SMTP-smugling og betragter det som en funktion snarere end en fejl."
    ],
    "points": 204,
    "commentCount": 42,
    "retryCount": 0,
    "time": 1703197706
  }
]
