[
  {
    "id": 40870357,
    "title": "Les origines de DS_store (2006)",
    "originLink": "https://www.arno.org/on-the-origins-of-ds-store",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40870357",
    "commentBody": "",
    "originSummary": [
      "« Les fichiers .DS_Store, couramment observés lors du transfert de fichiers de Mac vers Windows, signifient \"Desktop Services Store\" et proviennent d'une réécriture en 1999 du Finder de Mac OS X. »",
      "« Le Finder a été divisé en une interface utilisateur (Finder_FE) et une fonctionnalité de base (Finder_BE), avec des plans pour faire du backend une API publique appelée Desktop Services, bien qu'elle n'ait jamais été entièrement publiée. »",
      "Un bug provoque la création excessive de fichiers .DS_Store, même sans ajustements de l'utilisateur, ce qui en fait un problème persistant pour les utilisateurs de Mac."
    ],
    "commentSummary": [
      "« La discussion porte sur le contexte historique et les détails techniques du fichier DS_store et le concept de \"fork\" dans les systèmes de fichiers Mac, qui inclut à la fois des composants de ressources et de données. »",
      "« La fourche de ressources dans les premières versions de MacOS stockait diverses données d'application comme des icônes, des menus et du code exécutable, ce qui posait des défis lors du transfert de fichiers vers des systèmes non-Mac. »",
      "« La transition de MacOS à MacOS X a impliqué des changements significatifs, y compris la suppression des fourches de ressources, ce qui a suscité des réactions mitigées de la part de la communauté des utilisateurs. »"
    ],
    "points": 375,
    "commentCount": 200,
    "retryCount": 0,
    "time": 1720043713
  },
  {
    "id": 40869877,
    "title": "« Xcapture-BPF – comme Linux top, mais avec une vision aux rayons X »",
    "originLink": "https://0x.tools/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40869877",
    "commentBody": "",
    "originSummary": [
      "« 0x.tools est un ensemble d'utilitaires open-source conçus pour analyser les performances des applications sur Linux, en mettant l'accent sur la simplicité et les dépendances minimales. »",
      "« Les caractéristiques clés incluent la mesure de l'activité au niveau des threads individuels et la fourniture d'outils basés sur eBPF pour l'analyse de l'activité des threads au niveau du système et de manière détaillée. »",
      "« Il est conçu pour une utilisation sûre dans des environnements de production avec une surcharge très faible et ne nécessite pas de mises à niveau du système d'exploitation ni de cadres de surveillance lourds. »"
    ],
    "commentSummary": [
      "« Xcapture-BPF est un nouvel outil comparé à la commande top de Linux mais avec des capacités améliorées, souvent décrit comme ayant une \"vision aux rayons X\" pour les diagnostics système. »",
      "Les utilisateurs ont partagé leurs expériences d'utilisation des outils eBPF (extended Berkeley Packet Filter) et BCC (BPF Compiler Collection) pour déboguer des problèmes complexes en production, soulignant leur efficacité à résoudre les goulets d'étranglement de performance et les fuites de mémoire.",
      "« La discussion inclut des exemples pratiques de dépannage, tels que la résolution des problèmes de haute iowait et de cache de pages dans des environnements conteneurisés en activant l'IO direct et en faisant correspondre les tailles de secteur sur les dispositifs de bouclage. »"
    ],
    "points": 353,
    "commentCount": 35,
    "retryCount": 0,
    "time": 1720039957
  },
  {
    "id": 40869461,
    "title": "« La question à 600 milliards de dollars de l'IA »",
    "originLink": "https://www.sequoiacap.com/article/ais-600b-question/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40869461",
    "commentBody": "",
    "originSummary": [
      "« L'écart de revenus de l'IA est passé de 200 milliards de dollars à 600 milliards de dollars, soulevant des questions sur les attentes de croissance de l'industrie. »",
      "Les développements clés incluent l'assouplissement de la pénurie de GPU, l'augmentation des revenus des centres de données de Nvidia et la croissance significative des revenus d'OpenAI à 3,4 milliards de dollars.",
      "« Les défis tels que le manque de pouvoir de fixation des prix, les risques d'investissement et la dépréciation rapide des puces plus anciennes persistent, mais des coûts de GPU plus bas pourraient bénéficier aux startups et à l'innovation. »"
    ],
    "commentSummary": [
      "Former de grands modèles d'IA comme GPT-4 nécessite des ressources informatiques considérables, avec des estimations suggérant 8 000 GPU H100 fonctionnant pendant 90 jours.",
      "Les investissements substantiels de Meta dans les GPU pourraient leur permettre de former plusieurs modèles à l'échelle de GPT-4 chaque année, ce qui pourrait commodifier les modèles d'IA de base et impacter les marges bénéficiaires des entreprises d'IA.",
      "« La véritable valeur de l'IA pourrait se déplacer vers les données propriétaires pour l'entraînement, soulevant des problèmes juridiques potentiels et soulignant l'importance de la propriété des données. »"
    ],
    "points": 331,
    "commentCount": 496,
    "retryCount": 0,
    "time": 1720036541
  },
  {
    "id": 40870345,
    "title": "« Battre la multiplication de matrices NumPy en 150 lignes de C »",
    "originLink": "https://salykova.github.io/matmul-cpu",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40870345",
    "commentBody": "",
    "originSummary": [
      "« Une implémentation de multiplication de matrices haute performance en C, suivant la conception BLIS, surpasse NumPy (OpenBLAS) sur un AMD Ryzen 7700, atteignant plus de 1 TFLOPS. »",
      "« Le code est simple, portable et évolutif, utilisant seulement 3 lignes de directives OpenMP pour la parallélisation, et cible les processeurs Intel Core et AMD Zen avec des instructions FMA3 et AVX. »",
      "Cette mise en œuvre démontre qu'une multiplication de matrices efficace peut être réalisée en C sans code assembleur ou Fortran approfondi, avec des performances comparables aux bibliothèques BLAS établies lorsqu'elle est optimisée pour un matériel spécifique."
    ],
    "commentSummary": [
      "Un article de blog démontre comment surpasser la multiplication de matrices NumPy en utilisant 150 lignes de code C, en se concentrant sur les améliorations de performance.",
      "« Les améliorations clés incluent la sélection des algorithmes, la minimisation des allers-retours du noyau, la vectorisation, l'efficacité du cache et les optimisations spécifiques au matériel. »",
      "« Les discussions dans les commentaires abordent l'équité de la comparaison du code C avec NumPy, suggérant des comparaisons avec d'autres bibliothèques BLAS (Basic Linear Algebra Subprograms) et soulignant la nécessité de tests de performance approfondis et de réglages des hyperparamètres pour des CPU spécifiques. »"
    ],
    "points": 298,
    "commentCount": 51,
    "retryCount": 0,
    "time": 1720043575
  },
  {
    "id": 40870280,
    "title": "« La joie de lire des livres que vous ne comprenez pas »",
    "originLink": "https://reactormag.com/the-joy-of-reading-books-you-dont-entirely-understand/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40870280",
    "commentBody": "",
    "originSummary": [
      "« L'article souligne la joie et la valeur de lire des livres qui ne sont pas entièrement compris, suggérant qu'il est acceptable d'apprécier un livre sans le saisir complètement. »",
      "« L'auteur, Molly Templeton, partage des expériences personnelles avec des livres complexes comme *Baroque Cycle* de Neal Stephenson et des titres récents tels que *The Library of Broken Worlds* d'Alaya Dawn Johnson et *Jonathan Abernathy You Are Kind* de Molly McGhee. »",
      "Templeton soutient que l'acceptation de l'incertitude dans la lecture peut être libératrice et enrichir l'expérience de lecture, en encourageant les lecteurs à explorer des récits stimulants."
    ],
    "commentSummary": [
      "Le post discute de la valeur de la lecture de livres qui défient et provoquent une réflexion profonde, en faisant référence à la croyance de Kafka selon laquelle les livres percutants devraient « mordre et piquer » plutôt que simplement divertir.",
      "« Cela met en lumière différentes perspectives sur la lecture de livres difficiles ou complexes, certains lecteurs prônant l'immersion sans prise de notes pour améliorer la compréhension et le plaisir. »",
      "« La conversation inclut des anecdotes personnelles et des recommandations de livres qui ont laissé une impression durable, en soulignant la joie de découvrir de nouvelles perspectives à travers la relecture et l'engagement avec des matériaux stimulants. »"
    ],
    "points": 298,
    "commentCount": 185,
    "retryCount": 0,
    "time": 1720043087
  },
  {
    "id": 40874341,
    "title": "« Twilio confirme une violation de données après que des hackers ont divulgué les numéros de téléphone de 33 millions d'utilisateurs d'Authy »",
    "originLink": "https://www.securityweek.com/twilio-confirms-data-breach-after-hackers-leak-33m-authy-user-phone-numbers/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40874341",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Twilio a confirmé une violation de données qui a exposé les numéros de téléphone de 33 millions d'utilisateurs d'Authy, entraînant une augmentation des appels indésirables et des préoccupations concernant la fiabilité des réseaux téléphoniques traditionnels.",
      "Les utilisateurs envisagent des méthodes de communication alternatives telles que FaceTime et Zoom, tout en soulignant également le rôle crucial des appels téléphoniques dans les services essentiels comme les soins de santé et les services sociaux.",
      "« La violation souligne la nécessité d'une protection des données plus robuste, d'une meilleure application des mesures anti-spam et de recommandations pour des applications alternatives d'authentification à deux facteurs (2FA) comme Aegis, Bitwarden et Yubikey. »"
    ],
    "points": 260,
    "commentCount": 148,
    "retryCount": 0,
    "time": 1720095999
  },
  {
    "id": 40872182,
    "title": "« L'histoire la plus triste de \"Just Ship It\" (2020) »",
    "originLink": "https://www.kitze.io/posts/saddest-just-ship-it-story-ever",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40872182",
    "commentBody": "",
    "originSummary": [
      "L'auteur partage un parcours personnel de développement d'une application, commencé en 2018, mais retardé sa sortie en raison d'ajouts continus de fonctionnalités et de l'apprentissage de nouvelles technologies comme React Native.",
      "« Malgré l'abandon du projet après deux ans, l'auteur a découvert plus tard une application similaire qui a réussi malgré ses imperfections, ce qui a suscité des émotions mitigées. »",
      "« En 2022, l'auteur a finalement lancé une application de productivité combinant diverses fonctionnalités telles que les tâches, les habitudes, le planificateur et les objectifs, et invite les lecteurs à rejoindre la communauté sur Benji - The Life OS. »"
    ],
    "commentSummary": [
      "« La discussion tourne autour de la mentalité \"just ship it\" dans le développement de logiciels, en soulignant que se précipiter pour respecter les délais peut compromettre la qualité du logiciel et entraîner l'épuisement des développeurs. »",
      "« Il y a un débat sur la question de savoir si les développeurs doivent donner la priorité à la rentabilité de l'entreprise ou se concentrer sur la création de logiciels de haute qualité, certains affirmant que les développeurs ne sont pas suffisamment rémunérés pour des efforts extraordinaires à moins qu'ils n'aient une participation significative dans l'entreprise. »",
      "« La conversation met en lumière des perspectives divergentes sur la satisfaction au travail, la rémunération et l'équilibre entre l'intégrité professionnelle et les exigences de l'entreprise, reflétant des préoccupations plus larges de l'industrie concernant l'équilibre entre vie professionnelle et vie privée ainsi que la reconnaissance. »"
    ],
    "points": 217,
    "commentCount": 263,
    "retryCount": 0,
    "time": 1720065035
  },
  {
    "id": 40874013,
    "title": "Jeffrey Snover et la création de PowerShell",
    "originLink": "https://corecursive.com/building-powershell-with-jeffrey-snover/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40874013",
    "commentBody": "",
    "originSummary": [
      "Jeffrey Snover, l'architecte derrière PowerShell, partage son parcours de création d'un outil de commande qui a révolutionné l'administration des systèmes Windows, affrontant initialement la résistance d'une entreprise favorisant les interfaces graphiques.",
      "« Les principaux défis comprenaient la gestion des restructurations de l'entreprise, la résistance culturelle et la constitution d'une équipe dédiée, avec une influence significative de l'impulsion de Bill Gates pour .NET. »",
      "« Le développement de PowerShell, guidé par le Manifeste Monad, a transformé l'administration de Windows Server et a permis à Microsoft de se tourner vers le cloud, démontrant l'impact de la persévérance et de la vision dans la conduite du changement technologique. »"
    ],
    "commentSummary": [
      "« Jeffrey Snover, le créateur de PowerShell, a fait face à une opposition significative et a été rétrogradé chez Microsoft pour avoir poursuivi son développement. »",
      "PowerShell a été conçu pour aider à l'administration des serveurs sous Windows en appelant diverses API, mais il a rencontré des conflits internes et certaines fonctionnalités ont été perdues dans les versions plus récentes.",
      "« Malgré son approche orientée objet et son intégration .NET, PowerShell est perçu comme verbeux et difficile par rapport à d'autres langages de script comme Python, limitant son adoption en dehors de l'écosystème Windows. »"
    ],
    "points": 200,
    "commentCount": 182,
    "retryCount": 0,
    "time": 1720092392
  },
  {
    "id": 40872020,
    "title": "« Sans-IO : Le secret pour un Rust efficace dans les services réseau »",
    "originLink": "https://www.firezone.dev/blog/sans-io",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40872020",
    "commentBody": "",
    "originSummary": [
      "« Firezone utilise Rust et une conception sans E/S pour sa bibliothèque de connectivité principale, connlib, afin de gérer les connexions réseau et les tunnels WireGuard, offrant des tests rapides, une personnalisation approfondie et une grande fiabilité. »",
      "« La conception sans-IO sépare la politique de l'implémentation en utilisant des abstractions comme `Transmit`, permettant aux machines à états purs de gérer les protocoles réseau sans IO direct, rendant le code plus flexible et plus facile à tester. »",
      "« Bien que sans-IO nécessite des boucles d'événements et des machines d'état personnalisées, il offre des avantages significatifs tels que la composition facile, des API flexibles et une meilleure gestion des erreurs, malgré le fait qu'il ne soit pas encore largement adopté dans la communauté Rust. »"
    ],
    "commentSummary": [
      "« Le post discute du concept de Sans-IO en Rust, qui sépare les opérations d'entrée/sortie (IO) de la logique principale, rendant le code plus testable et composable. »",
      "« Cette approche est particulièrement bénéfique pour les cas d'utilisation orientés paquets comme QUIC, WebRTC et IP, où la gestion de l'état peut devenir complexe. »",
      "« La discussion souligne que bien que cette méthode ne soit pas nouvelle, elle offre des avantages significatifs en Rust en simplifiant les tests et en évitant les écueils des modèles traditionnels async/await. »"
    ],
    "points": 179,
    "commentCount": 59,
    "retryCount": 0,
    "time": 1720062336
  },
  {
    "id": 40872332,
    "title": "« Construire un utilitaire de compression de données en Haskell en utilisant les codes de Huffman »",
    "originLink": "https://lazamar.github.io/haskell-data-compression-with-huffman-codes/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40872332",
    "commentBody": "",
    "originSummary": [
      "« Le post décrit la création d'un programme de compression de données en Haskell utilisant le codage de Huffman, qui gère des fichiers binaires arbitraires avec une mémoire constante pour le codage et le décodage. »",
      "« Cela explique les codes de Huffman, les codes sans préfixe et le processus de construction d'un arbre binaire pour un encodage efficace, suivi de la mise en œuvre des fonctions d'encodage et de décodage. »",
      "« Le post aborde également la gestion des fichiers binaires, la sérialisation/désérialisation des données, et des améliorations potentielles comme le multithreading et la création de code plus rapide, mettant en avant un utilitaire de compression de données pratique et efficace en Haskell. »"
    ],
    "commentSummary": [
      "« Une discussion sur la création d'un utilitaire de compression de données en Haskell en utilisant les codes de Huffman, mettant en avant l'efficacité des algorithmes en place basés sur des tableaux pour les grands ensembles de données. »",
      "« Références à des travaux significatifs, y compris l'article de Moffat et Katajainen de 1995 et la norme JPEG ITU T.81 (1992), qui décrivent le codage de Huffman basé sur des tableaux. »",
      "« Des aperçus sur les performances de Haskell, avec des comparaisons avec d'autres langages comme C, C++ et Rust, et les compromis entre la simplicité de l'implémentation et la clarté du code par rapport aux performances brutes. »"
    ],
    "points": 164,
    "commentCount": 69,
    "retryCount": 0,
    "time": 1720067352
  },
  {
    "id": 40869421,
    "title": "« Isolateur de Voix : Éliminez le bruit de fond pour la production de films, podcasts, interviews »",
    "originLink": "https://elevenlabs.io/voice-isolator",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40869421",
    "commentBody": "",
    "originSummary": [
      "« Le générateur de voix IA prend désormais en charge 29 langues, élargissant ainsi son accessibilité et son utilité pour un public mondial. »",
      "« Il offre des milliers d'options de voix, fournissant aux utilisateurs un large éventail de choix pour différentes applications et préférences. »"
    ],
    "commentSummary": [
      "Le Voice Isolator d'Elevenlabs vise à éliminer les bruits de fond pour la production de films, de podcasts et d'interviews, mais son modèle de tarification basé sur les \"caractères\" en déroute de nombreux utilisateurs.",
      "« Les utilisateurs discutent de diverses alternatives pour les solutions de reconnaissance vocale (STT) et de synthèse vocale (TTS), y compris des options open-source comme Whisper et des services commerciaux comme Deepgram Nova 2. »",
      "« Il y a un intérêt notable pour les solutions locales et open-source de nettoyage audio et de transcription, car beaucoup trouvent les offres commerciales actuelles soit trop chères, soit pas assez efficaces. »"
    ],
    "points": 158,
    "commentCount": 126,
    "retryCount": 0,
    "time": 1720036303
  },
  {
    "id": 40872102,
    "title": "Propriétaires de Vision Pro, l'utilisez-vous encore ?",
    "originLink": "https://news.ycombinator.com/item?id=40872102",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40872102",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Les utilisateurs de Vision Pro ont des expériences mitigées, certains louant ses capacités médiatiques et professionnelles, tandis que d'autres critiquent son coût élevé et sa fonctionnalité limitée.",
      "Les caractéristiques clés appréciées incluent la taille de l'écran, le passthrough, les fonctionnalités de vision et le support amélioré des périphériques Bluetooth, mais des problèmes tels que l'inconfort visuel et l'intégration logicielle limitée sont notés.",
      "« Le prix élevé de l'appareil (3500 $) et sa sortie limitée (450 000 unités) ont conduit à un marché restreint, de nombreux utilisateurs attendant des révisions futures ou optant pour des alternatives moins chères comme le Quest 3. »"
    ],
    "points": 141,
    "commentCount": 77,
    "retryCount": 0,
    "time": 1720063824
  },
  {
    "id": 40871783,
    "title": "« Forçage de diffusion : la prédiction du prochain jeton rencontre la diffusion de séquence complète »",
    "originLink": "https://boyuan.space/diffusion-forcing/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40871783",
    "commentBody": "",
    "originSummary": [
      "Le Forçage de Diffusion est un nouveau paradigme d'entraînement qui combine la prédiction du prochain token et les modèles de diffusion de séquence complète, offrant une génération flexible et une guidance au niveau de la séquence.",
      "« Il réalise des améliorations significatives des performances dans des applications telles que la prédiction vidéo, la stabilisation des déploiements infinis, la planification par diffusion et l'apprentissage par imitation à long terme. »",
      "« Cette méthode permet des prédictions vidéo stables et cohérentes, des déploiements plus longs sans fenêtres glissantes, et une gestion robuste des tâches non markoviennes nécessitant une mémoire à long terme. »"
    ],
    "commentSummary": [
      "« L'article combine le masquage de séquence, essentiel pour les grands modèles de langage (LLM), avec des modèles de diffusion en suivant un niveau d'« incertitude » par pixel, traité comme du « bruit » pour le modèle de diffusion. »",
      "« Cette méthode est bénéfique pour des tâches comme la résolution de labyrinthes et le contrôle d'un bras robotique, car elle permet de consolider des parties d'une image plus tôt. »",
      "« L'approche modélise l'incertitude dans la planification et la recherche, améliorant la capacité des agents à réagir et à généraliser, mais l'article manque de détails sur la mise en œuvre et l'accès au code source. »"
    ],
    "points": 133,
    "commentCount": 6,
    "retryCount": 0,
    "time": 1720058960
  },
  {
    "id": 40872438,
    "title": "« Trouver des quasi-doublons avec la similarité de Jaccard et MinHash »",
    "originLink": "https://blog.nelhage.com/post/fuzzy-dedup/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40872438",
    "commentBody": "",
    "originSummary": [
      "« La similarité de Jaccard et MinHash sont utilisés pour identifier des documents approximativement similaires dans de grandes collections de textes, comme celles utilisées dans la préparation des ensembles de données GPT-3. »",
      "« MinHash approxime la similarité de Jaccard en hachant les caractéristiques des documents et en utilisant la valeur de hachage minimale comme signature, permettant ainsi une comparaison efficace de grands corpus. »",
      "« Cette méthode est évolutive et peut être combinée avec d'autres techniques comme HyperLogLog, ce qui la rend adaptée aux applications de traitement de texte à grande échelle. »"
    ],
    "commentSummary": [
      "« Le post discute de l'utilisation de la similarité de Jaccard et de MinHash pour trouver des données quasi-duplicata, en mettant en avant leur application dans divers domaines tels que la segmentation d'images médicales et la déduplication de bases de données. »",
      "« Plusieurs outils et bibliothèques sont mentionnés pour les tâches de déduplication, y compris datasketch, rensa, Splink et gaoya, avec des informations sur leurs performances et cas d'utilisation. »",
      "« Le modèle Fellegi Sunter est reconnu pour son efficacité à dédupliquer les personnes en attribuant des poids aux correspondances floues et aux non-correspondances, améliorant ainsi la précision dans les grands ensembles de données. »"
    ],
    "points": 127,
    "commentCount": 16,
    "retryCount": 0,
    "time": 1720069449
  },
  {
    "id": 40873001,
    "title": "« Tarification des machines spécifiques à la région »",
    "originLink": "https://community.fly.io/t/fresh-produce-region-specific-machines-pricing/20690",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40873001",
    "commentBody": "",
    "originSummary": [
      "« À partir du 1er juillet, une tarification spécifique à chaque région pour les Machines, y compris la RAM supplémentaire, sera introduite en raison des coûts d'infrastructure variables selon les régions. »",
      "Le rajustement des prix sera échelonné sur quatre mois, les prix finaux étant fixés d'ici novembre ; les factures initiales afficheront des articles spécifiques à la région sans changement de prix.",
      "« Une correction de bug pour l'utilisation de Machines Shared CPU 1x non couverte par le crédit de l'Allocation de Machines Gratuites a été mise en œuvre, et des crédits sont en cours de réémission. »"
    ],
    "commentSummary": [
      "« La tarification spécifique à la région de Fly.io a suscité des discussions, certains utilisateurs la trouvant coûteuse par rapport à des alternatives comme Hetzner, surtout pour une haute disponibilité. »",
      "Fly.io défend sa tarification en soulignant l'insoutenabilité des tarifs globaux uniformes en raison des coûts opérationnels élevés dans certaines régions, comme le Brésil.",
      "« Malgré la suppression du plan hobby et certaines préoccupations concernant la fiabilité, de nombreux utilisateurs apprécient les fonctionnalités de Fly.io telles que le routage dynamique des requêtes et les déploiements \"sans ops\", qu'ils estiment justifier les coûts plus élevés. »"
    ],
    "points": 94,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1720077454
  }
]
