[
  {
    "id": 39156444,
    "title": "Disney Meluncurkan Lantai HoloTile untuk Pengalaman VR Bersama yang Mulus",
    "originLink": "https://www.ign.com/articles/disney-unveils-the-holotile-floor-inching-us-closer-to-a-real-life-holodeck",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39156444",
    "commentBody": "",
    "originSummary": [
      "Disney telah mengembangkan teknologi yang disebut lantai HoloTile, yang merupakan lantai treadmill omni-directional multi-orang untuk meningkatkan pengalaman VR.",
      "Lantai HoloTile memungkinkan beberapa orang untuk memiliki pengalaman VR bersama dan berjalan ke segala arah tanpa bertabrakan.",
      "Teknologi ini memiliki aplikasi potensial di luar VR, termasuk panggung teater, dan menawarkan sekilas tentang masa depan hiburan yang imersif."
    ],
    "commentSummary": [
      "Disney telah memperkenalkan lantai HoloTile, sebuah teknologi baru yang menggunakan ubin ultrasonik untuk mengatur gesekan dan gerakan.",
      "Lantai HoloTile memungkinkan arah pergerakan yang terkendali, meskipun ada beberapa kekhawatiran tentang keamanan dan daya tahannya.",
      "Muncul spekulasi di antara para pemirsa bahwa ubin dapat berputar, bukannya berputar, sehingga menimbulkan pertanyaan mengenai keandalan teknologi ini.",
      "Meskipun lantai HoloTile menghadirkan pendekatan inovatif untuk kontrol gesekan, ada diskusi yang sedang berlangsung mengenai kepraktisan, efektivitas, dan potensi keterbatasannya dalam aplikasi realitas virtual."
    ],
    "points": 684,
    "commentCount": 264,
    "retryCount": 0,
    "time": 1706370086
  },
  {
    "id": 39156778,
    "title": "Membuat Model Bahasa seperti ChatGPT Anda Sendiri: Panduan Langkah-demi-Langkah",
    "originLink": "https://github.com/rasbt/LLMs-from-scratch",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39156778",
    "commentBody": "",
    "originSummary": [
      "\"Build a Large Language Model (From Scratch)\" adalah sebuah buku yang menyediakan panduan langkah demi langkah untuk membuat model bahasa Anda sendiri.",
      "Buku ini mencakup penjelasan yang jelas, diagram, dan contoh untuk membantu pembaca memahami setiap tahap proses.",
      "Ini mengikuti pendekatan yang sama untuk membangun model seperti ChatGPT.",
      "Kode yang menyertai dan materi tambahan dapat diakses di repositori GitHub.",
      "Topik-topik yang tercakup dalam buku ini termasuk memahami model bahasa besar, bekerja dengan data teks, mekanisme perhatian pengkodean, mengimplementasikan model GPT, prapelatihan pada data yang tidak berlabel, melakukan finetuning untuk klasifikasi teks, melakukan finetuning dengan umpan balik dari manusia, menggunakan model bahasa besar dalam praktiknya, dan pengenalan PyTorch."
    ],
    "commentSummary": [
      "Penulis sedang menulis panduan dan buku yang komprehensif untuk membangun Model Bahasa seperti ChatGPT (LLM) dari awal, yang bertujuan untuk mendidik dan mengungkap LLM sambil memberikan bantuan praktis untuk mengimplementasikan model yang disesuaikan.",
      "Meskipun melatih LLM dari awal mungkin tidak layak secara finansial bagi sebagian besar orang, penulis merekomendasikan penggunaan kerangka kerja seperti HF transformer atau axolotl. Namun, sebuah perusahaan yang memiliki dana yang cukup telah menunjukkan bahwa pelatihan dari awal adalah mungkin.",
      "Buku ini mencakup prapelatihan, penyempurnaan, dan pemuatan bobot prapelatihan, dan pembaca akan tertarik dengan saran pembelajaran penguatan. Pembahasan juga mencakup rekomendasi untuk RL, jaringan saraf, dan sumber daya transformator.",
      "Penulis mempertahankan harga buku ini, menyebutkan kupon yang tersedia, dan menerima umpan balik melalui Forum Manning atau GitHub.",
      "Buku ini diperkirakan memiliki panjang 400-500 halaman, dan terdapat video tutorial untuk pengenalan yang lebih singkat. Kesesuaian video tutorial untuk pemula masih diperdebatkan, tetapi penciptanya memastikan bahwa lebih banyak bab sedang dalam proses."
    ],
    "points": 552,
    "commentCount": 80,
    "retryCount": 0,
    "time": 1706372382
  },
  {
    "id": 39157797,
    "title": "Pesawat Rusak Tidak Menciptakan Perdagangan Orang Dalam: Pengguna Bursa Tumpukan Hukum Mendiskusikan Put Boeing",
    "originLink": "https://law.stackexchange.com/questions/98706/is-it-insider-trading-if-i-bought-boeing-puts-while-i-am-inside-the-wrecked-airp",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39157797",
    "commentBody": "",
    "originSummary": [
      "Para pengguna di platform Law Stack Exchange mendiskusikan apakah membeli opsi put Boeing saat terjadi kecelakaan pesawat akan dianggap sebagai perdagangan orang dalam.",
      "Percakapan ini membahas definisi perdagangan orang dalam dan potensi keterlibatan SEC.",
      "Pada akhirnya, disimpulkan bahwa berada di dalam pesawat yang jatuh tidak memenuhi syarat sebagai informasi orang dalam, dan oleh karena itu undang-undang perdagangan orang dalam tidak akan berlaku. Mencari nasihat hukum dan aspek edukasi dari platform ini menjadi sorotan."
    ],
    "commentSummary": [
      "Diskusi ini berfokus pada definisi dan legalitas perdagangan orang dalam, khususnya mengenai perdagangan saham yang menggunakan informasi non-publik.",
      "Para peserta memperdebatkan apakah tindakan tertentu, seperti mengamati masalah produk atau mengalami kegagalan perangkat lunak, harus dianggap sebagai perdagangan orang dalam.",
      "Pembicaraan ini juga mencakup kewajiban kerahasiaan, hubungan fidusia, dan peraturan yang berbeda di berbagai negara, yang menyoroti kompleksitas dan sifat subyektif dalam mendefinisikan perdagangan orang dalam."
    ],
    "points": 456,
    "commentCount": 198,
    "retryCount": 0,
    "time": 1706377318
  },
  {
    "id": 39161339,
    "title": "Akhir dari Kotak Centang Persegi: Evolusi dan Masa Depan Kontrol Pengguna",
    "originLink": "https://tonsky.me/blog/checkbox/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39161339",
    "commentBody": "",
    "originSummary": [
      "Kotak centang di berbagai sistem operasi biasanya berbentuk persegi, sedangkan tombol radio berbentuk bulat.",
      "Dengan web dan CSS, ada kecenderungan untuk menciptakan kembali dan mendesain ulang kontrol ini, yang mengarah pada penggunaan kotak centang bulat dan kotak centang dengan tanda centang.",
      "Apple baru-baru ini memperkenalkan kotak centang bulat di visionOS baru mereka, menyimpang dari konvensi persegi tradisional. Penulis berspekulasi bahwa kotak centang persegi mungkin akan digantikan oleh tombol pada tahun 2024."
    ],
    "commentSummary": [
      "Diskusi ini mengeksplorasi berbagai aspek desain antarmuka pengguna, seperti penggunaan kotak centang bulat dan kebingungan yang disebabkan oleh tombol beralih yang tidak jelas.",
      "Ini menyoroti pengaruh pilihan desain Apple dan tantangan yang dihadapi oleh individu yang lebih tua dalam menavigasi desain UI modern.",
      "Perdebatan antara tombol radio dan kotak centang dibahas, bersama dengan potensi inovasi dalam desain UI sambil tetap mengikuti konvensi yang sudah ada."
    ],
    "points": 395,
    "commentCount": 91,
    "retryCount": 0,
    "time": 1706402179
  },
  {
    "id": 39155103,
    "title": "Sxmo: Lingkungan Linux Minimalis untuk Perangkat Seluler dengan Dukungan Sentuhan dan SSH",
    "originLink": "https://sxmo.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39155103",
    "commentBody": "",
    "originSummary": [
      "Sxmo adalah lingkungan minimalis untuk perangkat seluler Linux dengan antarmuka berbasis menu yang ramah pengguna dan dukungan untuk kontrol sentuh dan gerakan.",
      "Pengguna dapat melakukan SSH ke ponsel mereka dan menggunakannya seperti mesin Alpine Linux lainnya, sehingga nyaman untuk penggunaan jarak jauh.",
      "Platform ini sangat mudah disesuaikan dan dapat dibuat skripnya, memungkinkan pengguna meluncurkan skrip untuk berbagai tindakan dan mengikatnya ke gerakan atau tombol fisik. Platform ini berjalan pada distribusi Linux tradisional dan mendukung aplikasi FOSS."
    ],
    "commentSummary": [
      "Sistem operasi SXMO sedang dibahas, dengan fokus pada desain, fungsionalitas, dan kompatibilitasnya dengan PinePhone.",
      "Para pengguna telah berbagi pengalaman dan pendapat mereka, mengekspresikan pandangan positif dan negatif tentang SXMO.",
      "Diskusi mencakup topik-topik seperti kekurangan desain, bug, fitur, opsi penyesuaian, ROM alternatif, solusi aplikasi perbankan, kegunaan manajer jendela ubin pada ponsel, acara yang akan datang, pengembangan Python dan Qt, dan ketiadaan opsi pin/kata sandi untuk membuka perangkat."
    ],
    "points": 315,
    "commentCount": 44,
    "retryCount": 0,
    "time": 1706359777
  },
  {
    "id": 39159002,
    "title": "Instansi GitLab yang Rentan Mengekspos 5,3K Server ke Pengambilalihan Akun",
    "originLink": "https://www.scmagazine.com/news/gitlab-password-reset-bug-leaves-more-than-5-3k-servers-up-for-grabs",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39159002",
    "commentBody": "",
    "originSummary": [
      "Lebih dari 5.300 server belum menerapkan patch penting di GitLab, membuat akun pengembang rentan terhadap pengambilalihan jarak jauh.",
      "Sebuah bug di GitLab memungkinkan penyerang untuk mengatur ulang kata sandi dan menerima tautan pengaturan ulang di email mereka sendiri tanpa interaksi pengguna.",
      "Pembaruan keamanan telah dirilis, tetapi sejumlah besar instans GitLab masih rentan terhadap kerentanan ini. Pengguna disarankan untuk memeriksa tanda-tanda eksploitasi dalam log mereka dan mengaktifkan autentikasi dua faktor."
    ],
    "commentSummary": [
      "Bug pengaturan ulang kata sandi di GitLab telah membuat lebih dari 5,3 ribu server rentan, sehingga menimbulkan kekhawatiran tentang keamanan akun dan akses yang tidak sah",
      "Pilihan bahasa pemrograman dan praktik terbaik sedang didiskusikan untuk meminimalkan bug dan kerentanan pada proyek-proyek mendatang",
      "Kritik yang dilontarkan terkait tim keamanan dan penanganan fitur keamanan akun, serta diskusi tentang budaya rekayasa dan penggunaan parameter yang kuat dalam Ruby on Rails"
    ],
    "points": 224,
    "commentCount": 106,
    "retryCount": 0,
    "time": 1706384067
  },
  {
    "id": 39157888,
    "title": "Peretas membobol jaringan Microsoft menggunakan akun uji coba dengan hak istimewa admin",
    "originLink": "https://arstechnica.com/security/2024/01/in-major-gaffe-hacked-microsoft-test-account-was-assigned-admin-privileges/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39157888",
    "commentBody": "",
    "originSummary": [
      "Peretas menyusup ke jaringan Microsoft dan mengakses akun email para eksekutif puncak dengan mengeksploitasi akun uji coba lama dengan hak istimewa admin.",
      "Para penyerang menggunakan teknik yang disebut penyemprotan kata sandi untuk mengambil keuntungan dari kredensial yang lemah untuk masuk ke akun pengujian.",
      "Mereka selanjutnya memanipulasi protokol otorisasi OAuth untuk membuat aplikasi berbahaya dan memberikannya akses ke semua alamat email di layanan email Microsoft Office 365, mengekspos kesalahan konfigurasi yang signifikan."
    ],
    "commentSummary": [
      "Artikel dan diskusi menyoroti risiko keamanan dan masalah yang terkait dengan hak akses dan izin di lingkungan pengujian dan produksi Microsoft.",
      "Isolasi yang lebih baik, langkah-langkah kontrol akses, audit keamanan, dan pelatihan karyawan direkomendasikan untuk mencegah akses yang tidak sah dan potensi pelanggaran keamanan.",
      "Penekanan diberikan pada pentingnya menerapkan langkah-langkah keamanan yang kuat untuk melindungi data sensitif."
    ],
    "points": 213,
    "commentCount": 45,
    "retryCount": 0,
    "time": 1706377828
  },
  {
    "id": 39159263,
    "title": "Dan Pashman dari The Sporkful Menciptakan Pasta Cascatelli untuk Saus yang Optimal dan Mudah Disantap",
    "originLink": "https://kottke.org/21/03/the-invention-of-a-new-pasta-shape",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39159263",
    "commentBody": "",
    "originSummary": [
      "Dan Pashman, pembawa acara podcast The Sporkful, telah mengembangkan bentuk pasta baru yang disebut cascatelli, yang dirancang untuk meningkatkan daya rekat saus dan pengalaman makan.",
      "Bentuknya sekarang tersedia untuk dibeli dari Sfoglini.",
      "Pasta ini telah mendapatkan popularitas dan saat ini telah terjual habis, hanya menyisakan stok dalam kemasan besar seberat 5 pon."
    ],
    "commentSummary": [
      "Bentuk pasta baru telah ditemukan pada tahun 2021, tetapi telah menerima ulasan yang beragam.",
      "Para kritikus mengatakan bahwa pasta membutuhkan waktu terlalu lama untuk dimasak, ada bagian yang kurang matang, dan patah di bagian sambungannya.",
      "Ada kecurigaan bahwa ulasan positif di situs web penemu mungkin dipilih atau dipalsukan."
    ],
    "points": 168,
    "commentCount": 108,
    "retryCount": 0,
    "time": 1706385808
  },
  {
    "id": 39156987,
    "title": "Pekerjaan Jarak Jauh Tetap Berlaku: Jangan Terkecoh",
    "originLink": "https://www.hottakes.space/p/remote-work-won-dont-let-anyone-gaslight",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39156987",
    "commentBody": "",
    "originSummary": [
      "Kerja jarak jauh telah menjadi norma baru dan akan terus menjadi hal yang lazim, meskipun ada beberapa orang yang menolak perubahan tersebut.",
      "Data menunjukkan bahwa sejumlah besar karyawan di AS saat ini bekerja dari jarak jauh dan lebih memilih untuk terus melakukannya.",
      "Perusahaan dan manajer yang memberlakukan mandat kembali ke kantor dikritik karena menghambat kepuasan dan produktivitas karyawan.",
      "Argumen yang dibuat oleh pemilik real estat komersial yang menentang kerja jarak jauh ditepis, karena penulis percaya bahwa pandemi telah mempercepat masa depan kerja jarak jauh yang tak terelakkan.",
      "Penulis memperingatkan adanya potensi PHK yang disamarkan sebagai inisiatif kembali ke kantor dan menyarankan kehati-hatian bagi para investor, karyawan, dan pelanggan.",
      "Kerja jarak jauh ditegaskan sebagai model kemenangan, dan pembaca didorong untuk mewaspadai upaya-upaya gaslighting untuk meyakinkan mereka."
    ],
    "commentSummary": [
      "Percakapan tersebut menyoroti keuntungan dari kerja jarak jauh, seperti penghematan waktu dan fleksibilitas, tetapi juga mengakui tantangannya, termasuk isolasi dan peluang pertumbuhan yang terbatas.",
      "Dampak kerja jarak jauh terhadap interaksi sosial, hubungan dengan kolega, dan budaya perusahaan dibahas, menimbulkan pertanyaan tentang efek jangka panjang pada angkatan 2020-2022 dan masa depan real estat komersial.",
      "Percakapan ini mengeksplorasi manfaat dan kekurangan kerja jarak jauh untuk bisnis dan menyentuh kekhawatiran tentang bias dalam diskusi media serta dampak kerja jarak jauh terhadap produktivitas dan kinerja karyawan. Pendapat mengenai efektivitas dan masa depan kerja jarak jauh bervariasi."
    ],
    "points": 147,
    "commentCount": 142,
    "retryCount": 0,
    "time": 1706373538
  },
  {
    "id": 39156463,
    "title": "Peneliti MIT mengembangkan pencetakan logam cair cepat untuk komponen aluminium berskala besar",
    "originLink": "https://news.mit.edu/2024/researchers-demonstrate-rapid-3d-printing-liquid-metal-0125",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39156463",
    "commentBody": "",
    "originSummary": [
      "Para peneliti MIT telah mengembangkan pencetakan logam cair (LMP), sebuah teknik yang memungkinkan produksi cepat komponen aluminium berskala besar, termasuk furnitur.",
      "LMP melibatkan penyimpanan aluminium cair ke atas lapisan manik-manik kaca kecil, sehingga menghasilkan pengerasan yang cepat ke dalam struktur 3D. Proses ini setidaknya 10 kali lebih cepat daripada proses manufaktur aditif logam lainnya.",
      "LMP memprioritaskan kecepatan dan skala daripada resolusi. Teknik ini memiliki aplikasi potensial dalam arsitektur, konstruksi, desain industri, pembuatan prototipe cepat dengan logam daur ulang, dan dapat dikombinasikan dengan proses dan bahan resolusi tinggi lainnya untuk menciptakan furnitur fungsional."
    ],
    "commentSummary": [
      "Para peneliti MIT telah menunjukkan bahwa logam cair dapat dicetak 3D dengan cepat, memberikan aplikasi potensial dalam pembuatan prototipe dan desain non-struktural.",
      "Meskipun komponen yang dibuat menggunakan metode ini mungkin masih memerlukan penggilingan dan pemesinan, namun kemampuan untuk mencetak dengan logam cair membuka kemungkinan untuk fasilitas fabrikasi yang lebih cepat dan lebih efisien.",
      "Proses ini melibatkan pencetakan logam cair di dalam manik-manik kaca untuk mencapai bentuk yang diinginkan, yang menampilkan kemajuan dalam teknologi pencetakan 3D."
    ],
    "points": 122,
    "commentCount": 37,
    "retryCount": 0,
    "time": 1706370231
  },
  {
    "id": 39156388,
    "title": "Mantan Kepala Pentagon: Teori Konspirasi Pemerintah Mendorong Pemborosan Pengeluaran",
    "originLink": "https://www.theguardian.com/world/2024/jan/27/sean-kirkpatrick-pentagon-ufo-conspiracy-theory-myths",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39156388",
    "commentBody": "",
    "originSummary": [
      "Mantan kepala penyelidik Pentagon, Sean Kirkpatrick, menuduh para penganut teori konspirasi di dalam pemerintahan AS menyebarkan mitos tentang UFO dan membuang-buang sumber daya untuk melakukan penyelidikan.",
      "Kirkpatrick mengklaim bahwa sekelompok pekerja pemerintah mempromosikan cerita-cerita yang tidak berdasar dan mempengaruhi anggota parlemen untuk mendukung program penelitian rahasia UFO.",
      "Dia mengungkapkan keprihatinannya tentang para pembuat undang-undang yang membuat keputusan berdasarkan pemikiran konspirasi dan sensasionalisme, dengan menyatakan bahwa banyak penampakan UFO yang memiliki penjelasan logis namun beberapa orang menolak untuk menerima penjelasan ilmiah karena kepercayaan mereka terhadap alien."
    ],
    "commentSummary": [
      "Ringkasan ini mencakup berbagai topik termasuk UFO, pertemuan dengan alien, teori konspirasi, dan keterlibatan pemerintah.",
      "Disebutkan bahwa ada pengaruh dari para ahli teori konspirasi di dalam pemerintahan terhadap pengeluaran yang berkaitan dengan investigasi UFO.",
      "Diskusi mengeksplorasi sifat mitologi UFO yang berskala manusia, potensi inspirasi penampakan dari pesawat eksperimental, dan kemungkinan hominid tingkat lanjut di Bumi yang berpura-pura menjadi makhluk luar angkasa.",
      "Kelayakan pengiriman probe robotik untuk menjelajahi ruang angkasa juga dibahas.",
      "Skeptisisme dan perdebatan seputar keberadaan alien, kredibilitas saksi, dan kurangnya bukti konkret.",
      "Kerahasiaan pemerintah, transparansi, dan peran organisasi seperti AATIP dalam membentuk narasi tentang UFO dan keberadaan makhluk luar angkasa juga diperiksa."
    ],
    "points": 121,
    "commentCount": 208,
    "retryCount": 0,
    "time": 1706369707
  },
  {
    "id": 39160291,
    "title": "Implementasi Ulang CPU 65C02 dalam FPGA: Proyek 100MHz 65F02 Ditunda",
    "originLink": "https://www.e-basteln.de/computing/65f02/65f02/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39160291",
    "commentBody": "",
    "originSummary": [
      "65F02 adalah implementasi ulang CPU 65C02 yang dikembangkan oleh penulis dan diimplementasikan dalam FPGA.",
      "Papan FPGA dapat dicolokkan ke soket CPU komputer berbasis 6502 dan 65C02, menyediakan kecepatan clock 100 MHz dan menyimpan hingga 16 peta memori yang berbeda.",
      "65F02 telah berhasil diuji di komputer catur Mephisto, Apple II, dan komputer Commodore PET/CBM, tetapi proyek ini saat ini sedang ditangguhkan karena hambatan pasokan elektronik global."
    ],
    "commentSummary": [
      "Artikel ini membahas tantangan dan peluang untuk menambahkan cache ke sistem, mengeksplorasi berbagai jenis bank memori.",
      "Ini mengeksplorasi potensi menciptakan sistem komputer yang meniru tampilan 80 kolom dengan memanfaatkan konfigurasi memori yang lebih tinggi.",
      "Manfaat menggunakan mikroprosesor 8-bit untuk tugas-tugas waktu nyata dan potensi untuk mengoptimalkan operasi komputer dibahas, bersama dengan teknik untuk mengurangi konsumsi daya. Artikel ini juga menyinggung tentang nostalgia untuk komputer lama dan kegembiraan prosesor yang lebih cepat. Selain itu, teknik peningkatan kinerja untuk sistem tertentu, seperti Applesoft dan demo Quad Core, juga disebutkan."
    ],
    "points": 119,
    "commentCount": 39,
    "retryCount": 0,
    "time": 1706392726
  }
]
