[
  {
    "id": 39156444,
    "title": "Disney представляет HoloTile Floor для бесшовного совместного просмотра VR-изображений",
    "originLink": "https://www.ign.com/articles/disney-unveils-the-holotile-floor-inching-us-closer-to-a-real-life-holodeck",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39156444",
    "commentBody": "",
    "originSummary": [
      "Компания Disney разработала технологию под названием HoloTile floor, которая представляет собой всенаправленную беговую дорожку, рассчитанную на несколько человек и предназначенную для усиления VR-ощущений.",
      "Пол HoloTile позволяет нескольким людям получить общий VR-опыт и ходить в любом направлении, не сталкиваясь друг с другом.",
      "Эта технология имеет потенциальное применение не только в VR, но и на театральных сценах, и позволяет заглянуть в будущее иммерсивных развлечений."
    ],
    "commentSummary": [
      "Компания Disney представила пол HoloTile - новую технологию, которая использует ультразвуковые плитки для регулирования трения и движения.",
      "Пол HoloTile позволяет контролировать направление движения, хотя есть сомнения в его безопасности и долговечности.",
      "Среди зрителей возникают предположения, что плитки могут не вращаться, а крутиться, что ставит под сомнение надежность технологии.",
      "Хотя пол HoloTile представляет собой инновационный подход к управлению трением, ведутся дискуссии о его практичности, эффективности и потенциальных ограничениях при использовании в виртуальной реальности."
    ],
    "points": 684,
    "commentCount": 264,
    "retryCount": 0,
    "time": 1706370086
  },
  {
    "id": 39156778,
    "title": "Создание собственной модели языка, подобной ChatGPT: Пошаговое руководство",
    "originLink": "https://github.com/rasbt/LLMs-from-scratch",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39156778",
    "commentBody": "",
    "originSummary": [
      "Книга \"Build a Large Language Model (From Scratch)\" представляет собой пошаговое руководство по созданию собственной языковой модели.",
      "Книга содержит четкие объяснения, диаграммы и примеры, которые помогут читателю понять каждый этап процесса.",
      "Он использует аналогичный подход к построению таких моделей, как ChatGPT.",
      "Сопроводительный код и дополнительные материалы доступны на репозитории GitHub.",
      "В книге рассматриваются такие темы, как понимание больших языковых моделей, работа с текстовыми данными, кодирование механизмов внимания, реализация GPT-модели, предварительное обучение на немеченых данных, тонкая настройка для классификации текстов, тонкая настройка с помощью обратной связи от человека, использование больших языковых моделей на практике, а также введение в PyTorch."
    ],
    "commentSummary": [
      "Автор пишет исчерпывающее руководство и книгу о построении модели языка (LLM), подобной ChatGPT, с нуля, с целью просветить и разъяснить суть LLM, а также предоставить практическую помощь в реализации специализированных моделей.",
      "Хотя обучение LLM с нуля может оказаться для большинства финансово невыполнимым, автор рекомендует использовать такие фреймворки, как HF-трансформеры или axolotl. Однако одна хорошо финансируемая компания продемонстрировала, что обучение с нуля возможно.",
      "В книге рассматриваются вопросы предварительного обучения, тонкой настройки и загрузки предварительно обученных весов, а также читатели интересуются советами по обучению с подкреплением. Также обсуждаются рекомендации по RL, нейронным сетям и ресурсам трансформаторов.",
      "Автор защищает стоимость книги, упоминает о доступных купонах и приветствует отзывы через форум Manning или GitHub.",
      "Предполагается, что объем книги составит 400-500 страниц, а для более короткого знакомства с ней есть видеоурок. Пригодность видеоучебника для новичков обсуждается, но создатель уверяет, что в разработке находятся дополнительные главы."
    ],
    "points": 552,
    "commentCount": 80,
    "retryCount": 0,
    "time": 1706372382
  },
  {
    "id": 39157797,
    "title": "Разбитый самолет не создает инсайдерской торговли: Пользователи юридической биржи Stack Exchange обсуждают путы Boeing",
    "originLink": "https://law.stackexchange.com/questions/98706/is-it-insider-trading-if-i-bought-boeing-puts-while-i-am-inside-the-wrecked-airp",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39157797",
    "commentBody": "",
    "originSummary": [
      "Пользователи платформы Law Stack Exchange обсуждают, будет ли покупка опционов на продажу акций Boeing во время авиакатастрофы считаться инсайдерской торговлей.",
      "В беседе рассматривается определение инсайдерской торговли и потенциальное участие SEC.",
      "В итоге делается вывод, что нахождение внутри разбившегося самолета не считается инсайдерской информацией, а значит, законы об инсайдерской торговле к нему неприменимы. Обращение за юридической консультацией и образовательный аспект платформы подчеркиваются."
    ],
    "commentSummary": [
      "В центре обсуждения - определение и законность инсайдерской торговли, в частности, торговля акциями с использованием непубличной информации.",
      "Участники дискуссии обсуждают, следует ли считать инсайдерской торговлей определенные действия, например, наблюдение за проблемами с продукцией или сбоями в работе программного обеспечения.",
      "В беседе также затрагиваются вопросы обязательств по соблюдению конфиденциальности, фидуциарных отношений и различий в нормативных актах разных стран, что подчеркивает сложность и субъективный характер определения понятия \"инсайдерская торговля\"."
    ],
    "points": 456,
    "commentCount": 198,
    "retryCount": 0,
    "time": 1706377318
  },
  {
    "id": 39161339,
    "title": "Конец квадратных флажков: Эволюция и будущее пользовательских элементов управления",
    "originLink": "https://tonsky.me/blog/checkbox/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39161339",
    "commentBody": "",
    "originSummary": [
      "Флажки в различных операционных системах традиционно имеют квадратную форму, а радиокнопки - круглую.",
      "С появлением Интернета и CSS возникла тенденция к переосмыслению и изменению дизайна этих элементов управления, что привело к использованию круглых флажков и флажков с галочками.",
      "Недавно компания Apple ввела круглые флажки в своей новой visionOS, отступив от традиционных квадратных. Автор предполагает, что квадратные флажки могут быть заменены на переключения в 2024 году."
    ],
    "commentSummary": [
      "В ходе обсуждения рассматриваются различные аспекты дизайна пользовательского интерфейса, такие как использование круглых флажков и путаница, вызванная непонятными кнопками переключения.",
      "В ней рассказывается о влиянии дизайнерских решений Apple и о проблемах, с которыми сталкиваются пожилые люди при навигации по современным пользовательским интерфейсам.",
      "Обсуждаются споры между радиокнопками и чекбоксами, а также потенциал для инноваций в дизайне пользовательского интерфейса при соблюдении устоявшихся традиций."
    ],
    "points": 395,
    "commentCount": 91,
    "retryCount": 0,
    "time": 1706402179
  },
  {
    "id": 39155103,
    "title": "Sxmo: Минималистичная среда Linux для мобильных устройств с поддержкой сенсорного ввода и SSH",
    "originLink": "https://sxmo.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39155103",
    "commentBody": "",
    "originSummary": [
      "Sxmo - это минималистичная среда для мобильных устройств на базе Linux с удобным интерфейсом, управляемым с помощью меню, и поддержкой сенсорного и жестового управления.",
      "Пользователи могут подключаться к телефону по SSH и использовать его как любую другую машину Alpine Linux, что делает его удобным для удаленного использования.",
      "Платформа очень настраиваемая и скриптовая, что позволяет пользователям запускать скрипты для различных действий и привязывать их к жестам или физическим кнопкам. Она работает на традиционных дистрибутивах Linux и поддерживает FOSS-приложения."
    ],
    "commentSummary": [
      "Обсуждается операционная система SXMO с акцентом на ее дизайн, функциональность и совместимость с PinePhone.",
      "Пользователи делятся своим опытом и мнениями, высказывая как положительные, так и отрицательные отзывы о SXMO.",
      "Обсуждаются такие темы, как недостатки дизайна, ошибки, функции, возможности настройки, альтернативные ПЗУ, обходные пути для банковских приложений, польза плиточного оконного менеджера на телефоне, предстоящие события, разработка на Python и Qt, а также отсутствие возможности разблокировки устройства с помощью пин-кода/пароля."
    ],
    "points": 315,
    "commentCount": 44,
    "retryCount": 0,
    "time": 1706359777
  },
  {
    "id": 39159002,
    "title": "Уязвимые экземпляры GitLab открывают 5,3 тыс. серверов для захвата учетных записей",
    "originLink": "https://www.scmagazine.com/news/gitlab-password-reset-bug-leaves-more-than-5-3k-servers-up-for-grabs",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39159002",
    "commentBody": "",
    "originSummary": [
      "Более 5300 серверов не применили критически важный патч для GitLab, что делает аккаунты разработчиков уязвимыми для удаленного захвата.",
      "Ошибка в GitLab позволяет злоумышленникам сбрасывать пароли и получать ссылку на сброс на свой собственный email без участия пользователя.",
      "Были выпущены обновления безопасности, но значительное количество экземпляров GitLab все еще подвержено этой уязвимости. Пользователям рекомендуется проверять журналы на наличие признаков эксплуатации и включить двухфакторную аутентификацию."
    ],
    "commentSummary": [
      "Ошибка сброса пароля в GitLab сделала уязвимыми более 5,3 тыс. серверов, вызвав опасения по поводу безопасности учетных записей и несанкционированного доступа",
      "Обсуждается выбор языков программирования и лучшие практики для минимизации ошибок и уязвимостей в будущих проектах",
      "Критика касается команды безопасности и работы с функциями защиты аккаунтов, а также обсуждений инженерной культуры и использования сильных параметров в Ruby on Rails"
    ],
    "points": 224,
    "commentCount": 106,
    "retryCount": 0,
    "time": 1706384067
  },
  {
    "id": 39157888,
    "title": "Хакеры взломали сеть Microsoft, используя тестовую учетную запись с правами администратора",
    "originLink": "https://arstechnica.com/security/2024/01/in-major-gaffe-hacked-microsoft-test-account-was-assigned-admin-privileges/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39157888",
    "commentBody": "",
    "originSummary": [
      "Хакеры проникли в сеть Microsoft и получили доступ к учетным записям электронной почты руководителей высшего звена, используя старую тестовую учетную запись с правами администратора.",
      "Злоумышленники использовали технику, называемую распылением паролей, чтобы воспользоваться слабыми учетными данными для входа в тестовую учетную запись.",
      "Далее они манипулировали протоколом авторизации OAuth, чтобы создать вредоносное приложение и предоставить ему доступ ко всем адресам электронной почты в почтовом сервисе Microsoft Office 365, раскрыв существенную ошибку в конфигурации."
    ],
    "commentSummary": [
      "В статьях и обсуждениях освещаются риски и проблемы безопасности, связанные с привилегиями и разрешениями доступа в тестовых и производственных средах Microsoft.",
      "Для предотвращения несанкционированного доступа и потенциальных нарушений безопасности рекомендуется использовать более надежную изоляцию, меры контроля доступа, аудит безопасности и обучение сотрудников.",
      "Особое внимание уделяется важности применения надежных мер безопасности для защиты конфиденциальных данных."
    ],
    "points": 213,
    "commentCount": 45,
    "retryCount": 0,
    "time": 1706377828
  },
  {
    "id": 39159263,
    "title": "Дэн Пашман из The Sporkful изобрел макароны каскателли для оптимального сцепления соуса с вилкой",
    "originLink": "https://kottke.org/21/03/the-invention-of-a-new-pasta-shape",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39159263",
    "commentBody": "",
    "originSummary": [
      "Дэн Пашман, ведущий подкаста The Sporkful, разработал новую форму макарон под названием каскателли, призванную улучшить прилипание соуса и вкусовые качества блюда.",
      "Теперь эта форма доступна для покупки в Sfoglini.",
      "Паста завоевала популярность и в настоящее время распродана, в наличии остались только 5-фунтовые мешки."
    ],
    "commentSummary": [
      "В 2021 году была изобретена новая форма макарон, но она получила неоднозначные отзывы.",
      "Критики утверждают, что макароны готовятся слишком долго, имеют недоваренные участки и разрываются на стыках.",
      "Есть подозрения, что положительные отзывы на сайте изобретателя могут быть вишневыми или поддельными."
    ],
    "points": 168,
    "commentCount": 108,
    "retryCount": 0,
    "time": 1706385808
  },
  {
    "id": 39156987,
    "title": "Удаленная работа преобладает: Не поддавайтесь на уговоры",
    "originLink": "https://www.hottakes.space/p/remote-work-won-dont-let-anyone-gaslight",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39156987",
    "commentBody": "",
    "originSummary": [
      "Удаленная работа стала новой нормой и будет продолжать преобладать, несмотря на то, что некоторые люди сопротивляются переменам.",
      "Данные показывают, что значительное число сотрудников в США в настоящее время работают удаленно и предпочитают продолжать это делать.",
      "Компании и руководители, которые вводят требования о возвращении на работу, подвергаются критике за то, что они препятствуют удовлетворенности и продуктивности сотрудников.",
      "Аргументы владельцев коммерческой недвижимости против удаленной работы отвергаются, поскольку, по мнению автора, пандемия ускорила неизбежное будущее удаленной работы.",
      "Автор предупреждает о возможных увольнениях, замаскированных под инициативы по возвращению в офис, и советует быть осторожными инвесторам, сотрудникам и клиентам.",
      "Удаленная работа утверждается в качестве победоносной модели, а читателям предлагается обратить внимание на попытки газового освещения, чтобы убедить их в обратном."
    ],
    "commentSummary": [
      "В беседе подчеркиваются преимущества удаленной работы, такие как экономия времени и гибкость, но также признаются и ее проблемы, включая изолированность и ограниченные возможности роста.",
      "Обсуждается влияние удаленной работы на социальное взаимодействие, отношения с коллегами и культуру компании, поднимаются вопросы о долгосрочных последствиях для класса 2020-2022 годов и будущего коммерческой недвижимости.",
      "В беседе рассматриваются преимущества и недостатки удаленной работы для бизнеса, а также затрагиваются вопросы предвзятости в обсуждениях в СМИ и влияния удаленной работы на производительность и эффективность сотрудников. Мнения об эффективности и будущем удаленной работы различны."
    ],
    "points": 147,
    "commentCount": 142,
    "retryCount": 0,
    "time": 1706373538
  },
  {
    "id": 39156463,
    "title": "Исследователи Массачусетского технологического института разработали технологию быстрой печати жидким металлом для изготовления крупногабаритных алюминиевых деталей",
    "originLink": "https://news.mit.edu/2024/researchers-demonstrate-rapid-3d-printing-liquid-metal-0125",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39156463",
    "commentBody": "",
    "originSummary": [
      "Исследователи Массачусетского технологического института разработали технологию печати жидким металлом (LMP), которая позволяет быстро изготавливать крупные алюминиевые детали, в том числе мебель.",
      "LMP предполагает нанесение расплавленного алюминия на слой мелких стеклянных шариков, что приводит к быстрому затвердеванию 3D-структуры. Этот процесс по крайней мере в 10 раз быстрее, чем другие процессы аддитивного производства металлов.",
      "В LMP приоритет отдается скорости и масштабу, а не разрешению. Эта техника имеет потенциальное применение в архитектуре, строительстве, промышленном дизайне, быстром прототипировании из переработанного металла, а также может быть объединена с другими процессами и материалами высокого разрешения для создания функциональной мебели."
    ],
    "commentSummary": [
      "Исследователи Массачусетского технологического института показали, что жидкий металл можно печатать в 3D-формате с высокой скоростью, что дает возможность использовать его для создания прототипов и неструктурных конструкций.",
      "Хотя детали, изготовленные таким способом, все еще нуждаются во фрезеровке и механической обработке, возможность печати жидким металлом открывает возможности для более быстрого и эффективного производства.",
      "Процесс включает в себя печать расплавленного металла внутри стеклянных шариков для достижения желаемой формы, демонстрируя достижения в технологии 3D-печати."
    ],
    "points": 122,
    "commentCount": 37,
    "retryCount": 0,
    "time": 1706370231
  },
  {
    "id": 39156388,
    "title": "Бывший начальник УФО Пентагона: Теоретики правительственного заговора стимулируют расточительное расходование средств",
    "originLink": "https://www.theguardian.com/world/2024/jan/27/sean-kirkpatrick-pentagon-ufo-conspiracy-theory-myths",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39156388",
    "commentBody": "",
    "originSummary": [
      "Бывший главный следователь Пентагона Шон Киркпатрик обвиняет теоретиков заговора в правительстве США в распространении мифов об НЛО и пустой трате ресурсов на расследования.",
      "Киркпатрик утверждает, что группа правительственных работников продвигает бездоказательные истории и влияет на законодателей, чтобы те поддержали секретные программы по изучению НЛО.",
      "Он выражает обеспокоенность тем, что законодатели принимают решения, основанные на конспирологическом мышлении и сенсациях, заявляя, что многие случаи наблюдения НЛО имеют логическое объяснение, но некоторые люди отказываются принимать научные объяснения из-за своей веры в инопланетян."
    ],
    "commentSummary": [
      "Резюме охватывает целый ряд тем, включая НЛО, встречи с инопланетянами, теории заговора и участие правительства.",
      "В нем говорится о влиянии теоретиков заговора в правительстве на расходы, связанные с расследованиями НЛО.",
      "Обсуждается человеческий масштаб мифологии НЛО, потенциальное вдохновение наблюдений экспериментальными самолетами и возможность того, что продвинутые гоминиды на Земле выдают себя за внеземных существ.",
      "Также обсуждается возможность отправки роботов-зондов для исследования космоса.",
      "Скептицизм и споры вокруг существования инопланетян, достоверность свидетелей и отсутствие конкретных доказательств.",
      "Также рассматриваются правительственная секретность, прозрачность и роль таких организаций, как AATIP, в формировании представлений об НЛО и внеземном существовании."
    ],
    "points": 121,
    "commentCount": 208,
    "retryCount": 0,
    "time": 1706369707
  },
  {
    "id": 39160291,
    "title": "Повторная реализация процессора 65C02 в ПЛИС: 100 МГц 65F02 Проект приостановлен",
    "originLink": "https://www.e-basteln.de/computing/65f02/65f02/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39160291",
    "commentBody": "",
    "originSummary": [
      "65F02 является повторной реализацией процессора 65C02, разработанного автором и реализованного в ПЛИС.",
      "Плата FPGA может быть подключена к процессорному разъему компьютеров на базе 6502 и 65C02, обеспечивая тактовую частоту 100 МГц и сохраняя до 16 различных карт памяти.",
      "65F02 был успешно протестирован в шахматных компьютерах Mephisto, Apple II и Commodore PET/CBM, но в настоящее время проект приостановлен из-за проблем с поставками электроники по всему миру."
    ],
    "commentSummary": [
      "В статье рассматриваются проблемы и возможности добавления кэша в систему, изучаются различные типы банков памяти.",
      "В ней рассматривается возможность создания компьютерной системы, имитирующей 80-колоночный дисплей, за счет использования более высокой конфигурации памяти.",
      "Обсуждаются преимущества использования 8-разрядных микропроцессоров для задач реального времени и возможности оптимизации работы компьютера, а также методы снижения энергопотребления. В статье также затрагиваются вопросы ностальгии по старым компьютерам и волнений по поводу более быстрых процессоров. Кроме того, упоминаются методы повышения производительности для конкретных систем, таких как Applesoft и демонстрационная версия Quad Core."
    ],
    "points": 119,
    "commentCount": 39,
    "retryCount": 0,
    "time": 1706392726
  }
]
