[
  {
    "id": 37091983,
    "title": "Elinizdeki sistemi sonuna kadar kullanın",
    "originLink": "https://blog.danslimmon.com/2023/08/11/squeeze-the-hell-out-of-the-system-you-have/#like-2777",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37091983",
    "commentBody": "",
    "originSummary": [
      "Yazar, sharding veya mikro hizmetler gibi karmaşık çözümler uygulamak yerine sorguları optimize ederek ve ayarları düzenleyerek veritabanı performansını artırma deneyimlerini paylaşıyor.",
      "Ek karmaşıklık getirmeden önce mevcut sistemlerin verimliliğini en üst düzeye çıkarmanın önemini vurgulamaktadırlar.",
      "Çabalarının sonucu CPU kullanımında gözle görülür bir azalma ve gelecekteki genişleme için daha fazla alan oldu. Yazar, eninde sonunda gerekli olabileceğini kabul ederek karmaşıklığı mümkün olduğunca uzun süre ertelemeyi öneriyor."
    ],
    "commentSummary": [
      "Veritabanı sorgularını ve dizinlemeyi optimize etmek, sistem performansını artırmak için çok önemlidir.",
      "Makale, veritabanı tasarımında birleştirmelerin kullanımını, uzun ve geniş sistemler arasındaki dengeleri ve geniş uygulamalar oluşturmadaki zorlukları araştırmaktadır.",
      "Ayrıca bir şirket olarak Grab, veritabanı tasarımında denormalizasyonun faydaları ve endişeleri ve monolitik sistemlerin ölçeklendirilmesi ve bölünmesindeki zorluklar da tartışılmaktadır."
    ],
    "points": 597,
    "commentCount": 283,
    "retryCount": 0,
    "time": 1691777882
  },
  {
    "id": 37092861,
    "title": "Yargıç, Sam Bankman-Fried'ı tanık değiştirme suçundan hapse gönderdi",
    "originLink": "https://www.cnbc.com/2023/08/11/judge-to-revoke-bail-for-ftx-founder-sam-bankman-fried-over-witness-tampering.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37092861",
    "commentBody": "",
    "originSummary": [
      "FTX'in kurucusu Sam Bankman-Fried, tanıkları yanılttığı iddiasıyla ABD'li bir yargıç tarafından hapse gönderildi.",
      "Bankman-Fried'in temyize kadar tutukluluğunun ertelenmesi talebi reddedildi ve Ekim ayındaki ceza duruşmasına kadar gözaltında kalması bekleniyor.",
      "Hükümet, Bankman-Fried'in medyaya e-posta göndererek, basın mensuplarıyla telefon görüşmeleri yaparak ve New York Times'a özel günlük kayıtlarını sızdırarak kefalet koşullarından kaçtığını ve tanıklarla oynadığını iddia ediyor."
    ],
    "commentSummary": [
      "FTX kripto para borsasının CEO'su Sam Bankman-Fried, bir tanığın gözünü korkutmak için basınla materyal paylaştığı iddiasıyla tanık değiştirme suçundan hapse atıldı.",
      "Dava, medyanın önyargısı, gazetecilerin rolü, SBF'nin serveti ve etkisi ile ruhsal durumu üzerine tartışmalara ve Elon Musk gibi figürlerle karşılaştırmalara yol açtı.",
      "Diğer konular arasında kefalet şartlarını ihlal etmenin sonuçları, Bankman-Fried'in davranışının rasyonelliği, Washington'daki potansiyel yolsuzluk, şiddet içermeyen suçlar için ceza yönergeleri, zenginliğin akıl sağlığı üzerindeki etkisi, özgürlükçülük gibi siyasi ideolojiler ve devletin rolü yer alıyor."
    ],
    "points": 512,
    "commentCount": 544,
    "retryCount": 0,
    "time": 1691782126
  },
  {
    "id": 37092212,
    "title": "Wendelstein 7-X: Sekiz dakika boyunca üretilen Gigajoule enerji cirosu",
    "originLink": "https://www.ipp.mpg.de/5322229/01_23",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37092212",
    "commentBody": "",
    "originSummary": [
      "Almanya'daki Wendelstein 7-X nükleer füzyon deneyi, sekiz dakika boyunca gigajoule enerji devrine sahip bir güç plazması üreterek önemli bir kilometre taşına ulaştı.",
      "Bu, hedeflenen 1 gigajoule enerji cirosunu aşıyor ve deşarj süresi için yeni bir rekor oluşturuyor.",
      "Deney, hidrojen plazmasını bir vakum odasında hapsetmek için manyetik alanları kullanarak iklim dostu ve sürdürülebilir bir enerji santrali geliştirme hedefiyle enerji devrini 18 gigajul'e çıkarmayı ve plazma kararlılığını yarım saat boyunca korumayı amaçlıyor."
    ],
    "commentSummary": [
      "Wendelstein 7-X stellerator reaktörü, sekiz dakika boyunca gigajoule enerji üretmek için tokamak reaktörüne umut verici bir alternatiftir.",
      "Füzyon reaktörleri, füzyon reaksiyonunu içerecek uygun bir kap bulma ve tercih edilen yakıt kaynaklarını belirleme gibi zorluklarla karşı karşıyadır.",
      "Stellaratörler ve tokamakların tasarımı ve işlevselliği, farklılıkları ve mühendislik zorlukları vurgulanarak tartışılmaktadır.",
      "Stelleratörler füzyon reaktörü geliştirme potansiyeline sahiptir, ancak üretim ve simülasyon karmaşıklıklarının ele alınması gerekmektedir.",
      "Füzyon enerjisinin kullanılabilir elektriğe dönüştürülmesi önemli bir araştırma alanıdır.",
      "Finansman kaynakları, güvenlik hususları ve füzyon teknolojisinin uygulanabilirliği incelenmiştir.",
      "Füzyonun bir enerji kaynağı olarak pratikte uygulanması ve küresel ısınma üzerindeki etkisi tartışılmaktadır.",
      "Füzyon teknolojisinin sınırlamaları ve faydaları ele alınmaktadır."
    ],
    "points": 445,
    "commentCount": 241,
    "retryCount": 0,
    "time": 1691779002
  },
  {
    "id": 37089545,
    "title": "Barındırma Sağlayıcısı Mahkeme Kararıyla Getirilen Yasağı Uygulayınca YouTube-Dl Sitesi Çevrimdışı Kaldı",
    "originLink": "https://torrentfreak.com/youtube-dl-site-goes-offline-as-hosting-provider-enforces-court-ordered-ban-230809/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37089545",
    "commentBody": "",
    "originSummary": [
      "Popüler bir YouTube kopyalama yazılımı olan youtube-dl'nin web sitesi, bir telif hakkı ihlali davasında mahkeme kararının ardından barındırma sağlayıcısı Uberspace tarafından kaldırıldı.",
      "Sony, Warner ve Universal, yazılımın kullanıcıların YouTube'un telif hakkı koruma önlemlerini atlatmasına izin verdiğini iddia ederek dava açtı.",
      "Uberspace başlangıçta karara itiraz etti ancak müzik şirketlerinin teminat yatırmasının ardından web sitesini kaldırmak zorunda kaldı, ancak kararı bozma umuduyla yasal mücadeleye devam etmeyi planlıyorlar."
    ],
    "commentSummary": [
      "Tartışma, telif hakkı ihlali ve fikri mülkiyet yasaları da dahil olmak üzere YouTube ve diğer yayın platformlarından video indirmenin yasal ve etik hususlarına odaklanmaktadır.",
      "Platformların telif haklarının uygulanmasındaki rolünü ve içerik oluşturucular üzerindeki potansiyel etkisini araştırıyor.",
      "Alternatif platformlar, arşivleme ve yaratıcı remikslemenin önemi ve içerik indirme ve arşivleme konusundaki kısıtlamalarla ilgili endişeler de tartışılmaktadır."
    ],
    "points": 411,
    "commentCount": 212,
    "retryCount": 0,
    "time": 1691766453
  },
  {
    "id": 37089739,
    "title": "Tailscale vs. Narrowlink",
    "originLink": "https://narrowlink.com/docs/comparisons/tailscale",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37089739",
    "commentBody": "",
    "originSummary": [
      "Narrowlink ve Tailscale, ağlar arasında güvenli uzaktan erişim ve bağlantı için açık kaynaklı çözümlerdir.",
      "Tailscale, eşler arası ağ mimarisine sahip WireGuard protokolünü kullanarak sıfır yapılandırmalı bir VPN sağlayan bir Hizmet Olarak Yazılım (SaaS) platformudur.",
      "Narrowlink, isteğe bağlı uçtan uca şifrelemenin yanı sıra esneklik, şeffaflık ve güvenlik sunan bir istemci-aracı-ağ geçidi modeline sahip, kendi kendine barındırılan bir platformdur.",
      "Narrowlink granüler erişim kontrolünü destekler, bir CDN arkasında konuşlandırılabilir ve web hizmetlerini yayınlamak için Tailscale'den daha fazla seçenek sunar.",
      "Tailscale cihaz bağlantısı, kullanım kolaylığı ve ham verim performansına odaklanırken, Narrowlink kendi kendine barındırılan bir çözüm aracılığıyla özelleştirmeye, erişim kontrolüne ve güvenliğe öncelik veriyor.",
      "Narrowlink, ikili boyut, bellek kullanımı ve CPU kullanımı açısından Tailscale'den daha verimlidir."
    ],
    "commentSummary": [
      "Tartışma, uzaktan erişim ve bağlantı için iki açık kaynak çözümü olan Tailscale ve Narrowlink'i karşılaştırıyor.",
      "Headscale adında açık kaynaklı bir uygulama mevcut olmasına rağmen, kapalı sunucusu nedeniyle Tailscale'in açık kaynak niteliği konusunda bir tartışma vardır.",
      "Tailscale, kullanıcı dostu web arayüzü, değer önerisi ve MagicDNS ve SSH anahtar yönetimi gibi ek özellikleriyle övgü topluyor."
    ],
    "points": 330,
    "commentCount": 137,
    "retryCount": 0,
    "time": 1691767468
  },
  {
    "id": 37093854,
    "title": "Patronların %80'i daha önceki işe dönüş planlarından pişman olduklarını söylüyor",
    "originLink": "https://www.cnbc.com/2023/08/11/80percent-of-bosses-say-they-regret-earlier-return-to-office-plans.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37093854",
    "commentBody": "",
    "originSummary": [
      "Patronların %80'i göreve dönüş planlarına ilişkin ilk kararlarından pişmanlık duyuyor ve yalnızca yöneticilerin görüşlerine güvenmek yerine çalışanların tercihlerini dikkate almaları gerektiğini fark ediyor.",
      "Disney, Starbucks ve BlackRock gibi şirketler daha fazla yüz yüze çalışmayı zorunlu kılarken Zoom, çalışanların hibrit, yüz yüze veya uzaktan çalışma arasında seçim yapmasına izin vermek için politikasını tersine çevirdi.",
      "Çalışanları karar alma sürecine dahil eden şirketler ofise geri dönüş konusunda daha başarılı olurken, çalışan girdisi olmadan katı politikalar uygulayanlar işten ayrılma sorunları yaşıyor. Ernst & Young gibi şirketler, işe gidip gelme ve çocuk bakımı masrafları için geri ödemeler uyguladıktan sonra çalışanlardan olumlu tepkiler aldı. Şirketlerin hem çalışanlar hem de patronlar için içerikli bir ofis rutini oluşturması bir ya da iki yıl daha alabilir."
    ],
    "commentSummary": [
      "İşverenler, çalışanlarını ofise geri getirme planlarından pişmanlık duyduklarını ifade ediyor.",
      "Evden çalışma (WFH) verimliliğine ilişkin yanlış inanışlar tartışılıyor.",
      "Çalışanlar uzaktan çalışmayı tercih ettiklerini dile getiriyorlar.",
      "İşverenlerin ofise dönüşü zorlamak için gayrimenkul yatırımları ve fiziksel bir varlık arzusu da dahil olmak üzere çeşitli nedenleri vardır.",
      "Ofise kıyasla uzaktan çalışmada verimlilik ve etkinlik; yönetim, zorluklar ve motivasyonlar gibi faktörler göz önünde bulundurularak tartışılmaktadır.",
      "Ekip uyumunun önemine vurgu yapılarak uzaktan çalışmanın sınırlamaları kabul edilmektedir.",
      "Uzaktan çalışmanın ilişkiler ve iş tatmini üzerindeki etkisinin yanı sıra açık ofis planlarının sakıncalarına ilişkin tartışmalar yapılıyor.",
      "Verimliliğe odaklanılarak uzaktan çalışma ve ofis içi çalışmanın hem avantajları hem de dezavantajları araştırılıyor.",
      "Uzaktan çalışmada denetim ve düşük performansla ilgili endişeler, önerilen çözümlerle birlikte tartışılmaktadır.",
      "Uzaktan çalışmaya ilişkin yönetici kararları ve sermaye ile emek arasındaki güç dinamikleri de ele alınmaktadır.",
      "Tercihler, faydalar ve zorluklarla ilgili tartışmalarla birlikte uzaktan çalışma ve ofis ortamları hakkında karışık görüşler vardır.",
      "Ekip toplantıları sırasında uzaktan çalışanların dışlanma deneyimleri gündeme gelmekte ve yönetimsel eksikliklerin altı çizilmektedir."
    ],
    "points": 329,
    "commentCount": 284,
    "retryCount": 0,
    "time": 1691787127
  },
  {
    "id": 37090632,
    "title": "Llama-2'nin İnce Ayarı: Özel Modellerin Uyarlanması için Kapsamlı Bir Örnek Çalışma",
    "originLink": "https://www.anyscale.com/blog/fine-tuning-llama-2-a-comprehensive-case-study-for-tailoring-models-to-unique-applications",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37090632",
    "commentBody": "",
    "originSummary": [
      "Doğal dil işlemede belirli görevler için Llama-2 modellerine ince ayar yapmak, belirli görevlerde GPT-4'e kıyasla üstün performans sunar.",
      "Ray ve Anyscale platformlarının kullanımı, daha hızlı ve daha yönetilebilir ince ayar süreçleri sağlar.",
      "Özellikle veri tabloları ve matematik muhakeme görevlerinde doğruluk ve performansta umut verici gelişmeler gösteren ince ayar, komut istemi mühendisliği ve az sayıda komut istemi potansiyelinin zorlukları ve sınırlamaları incelenmiştir."
    ],
    "commentSummary": [
      "Bu makale, Llama-2 modeline özel olarak odaklanarak özel modellere ince ayar yapma konusunu incelemektedir.",
      "Konuşma, RAG yaklaşımı ile ince ayar arasındaki farkların yanı sıra ince ayar modellerinin bölümlere ayrılması ve kod üretiminde gereksiz metinlerin hariç tutulmasının etkisi üzerine tartışmaları da içeriyor.",
      "Ayrıca simülasyon yöntemlerini kullanarak büyük dil modellerini optimize etme ve kod bloklarını birleştirme üzerine bir tartışma da bulunmaktadır.",
      "Makale, farklı boyutlardaki modellerin eğitimiyle ilgili maliyetten ve NER görevleri için ince ayarlı BERT modellerinin potansiyel kullanımından bahsetmektedir.",
      "Ayrıca Colab Pro'nun Llama-v2-7b'ye ince ayar yapmak için kullanılıp kullanılamayacağı konusunda bir soru ortaya çıkarmaktadır."
    ],
    "points": 275,
    "commentCount": 55,
    "retryCount": 0,
    "time": 1691771688
  },
  {
    "id": 37090754,
    "title": "Infisical - açık kaynaklı HashiCorp Vault alternatifi",
    "originLink": "https://github.com/Infisical/infisical",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37090754",
    "commentBody": "",
    "originSummary": [
      "Infisical, uçtan uca şifreleme ile sırları yönetmek için açık kaynaklı bir platformdur.",
      "Kullanıcı dostu bir gösterge paneli, istemci SDK'ları ve GitHub gibi platformlarla yerel entegrasyonlar sunar.",
      "Özellikler arasında gizli sürüm oluşturma, erişim kontrolleri, gizli tarama ve şirket içinde dağıtma veya yönetilen Infisical Cloud hizmetini kullanma seçeneği bulunmaktadır.",
      "Kullanıcılar projeye katkıda bulunabilir ve güvenlik açıklarını bildirebilir."
    ],
    "commentSummary": [
      "HashiCorp Vault'a açık kaynaklı bir alternatif olan Infisical'ın piyasaya sürülmesi, açık kaynaklı yazılımların sürdürülebilirliği ve para kazanma konusunda tartışmalara yol açtı.",
      "Infisical, Vault'a kıyasla ek araçlar ve özellikler sunuyor, ancak uygulanabilirliği ve bazı eksik işlevleri konusunda endişeler var.",
      "Infisical ekibi, yakın gelecekte yeni özellikler yayınlamayı, kullanıcıların endişelerini gidermeyi ve gelecekteki gelişim için önerileri memnuniyetle karşılamayı planlıyor. HashiCorp Vault ile ilgili olarak CyberArk Conjur ve Fortanix DSM gibi alternatiflerden de bahsedilmektedir."
    ],
    "points": 254,
    "commentCount": 95,
    "retryCount": 0,
    "time": 1691772258
  },
  {
    "id": 37091989,
    "title": "RFC 9446 Snowden İfşaatlarının Üzerinden Geçen On Yıl Üzerine Düşünceler",
    "originLink": "https://www.rfc-editor.org/rfc/rfc9446.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37091989",
    "commentBody": "",
    "originSummary": [
      "Bu RFC, Edward Snowden'ın 2013 yılında NSA bilgilerini ifşa etmesinin sonuçları üzerine düşünmekte ve bunun güvenlik, mahremiyet ve insan hakları üzerindeki etkisini tartışmaktadır.",
      "Çeşitli kişilerin bakış açılarına yer veren kitap, IETF tarafından internet protokollerini geliştirmek ve kullanıcı gizliliğini korumak için gösterilen çabaları inceliyor.",
      "Belge, mahremiyet koruyucu protokollerin uygulanmasındaki zorlukları kabul etmekte ve bu alanda daha fazla araştırma ve savunuculuğun önemini vurgulamaktadır. Ayrıca şifrelemenin tarihsel geçmişine ve mahremiyet ile devlet gözetimi arasında süregelen çatışmaya da değinmektedir."
    ],
    "commentSummary": [
      "Tartışmalar Edward Snowden ve Julian Assange gibi muhbirler, hükümet gözetimi, gücün kötüye kullanılması, medya etkisi ve güvenlik ile bireysel mahremiyet arasındaki denge konularına odaklanmaktadır.",
      "Karakter suikastı, hükümet müdahalesi, medya tasviri ve demokratik gözetim ve hesap verebilirliğin önemi ile ilgili endişeleri dile getiren çeşitli bakış açıları paylaşılmaktadır.",
      "ABD hükümetinin Amerikan yerlilerine kötü muamelesi gibi tarihsel ihlaller ile veri ihlalleri ve bilgilerin kötüye kullanımı gibi potansiyel riskler de tartışmalarda ele alınmaktadır."
    ],
    "points": 244,
    "commentCount": 165,
    "retryCount": 0,
    "time": 1691777914
  },
  {
    "id": 37093163,
    "title": "Sam Bankman-Fried Eski Sevgilisinin Günlüğünü Sızdırdıktan Sonra Tekrar Hapse Gönderildi",
    "originLink": "https://themessenger.com/business/sbf-thrown-in-jail-for-tampering-with-star-witness-in-upcoming-fraud-trial",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37093163",
    "commentBody": "",
    "originSummary": [
      "FTX'in kurucusu Sam Bankman-Fried, eski kız arkadaşı ve Alameda Research'ün eski CEO'su Caroline Ellison'ın kişisel günlük kayıtlarını New York Times'a sızdırdığı için tekrar hapse gönderildi.",
      "Federal bir yargıç bu durumu tanık korkutma ve jüriyi yanıltma olarak değerlendirdi ve Bankman-Fried'in daha önce dolandırıcılık suçlamasıyla kefaletle serbest bırakılmış olmasına rağmen hapse atılmasına yol açtı.",
      "FTX'in çöküşüyle ilgili suçlamaları kabul eden Ellison, ceza indirimi karşılığında Bankman-Fried aleyhine tanıklık edecek."
    ],
    "commentSummary": [
      "FTX'in kurucusu Sam Bankman-Fried, eski sevgilisinin günlüğünü sızdırdığı iddiasıyla tekrar hapse gönderildi.",
      "Bu, daha önceki tanık değiştirme suçlamalarının üzerine eklenmiştir."
    ],
    "points": 243,
    "commentCount": 2,
    "retryCount": 0,
    "time": 1691783442
  }
]
