[
  {
    "id": 38858012,
    "title": "பிரபல புரோகிராமிங் முன்னோடி நிக்லாஸ் விர்த் காலமானார்",
    "originLink": "https://twitter.com/Bertrand_Meyer/status/1742613897675178347",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38858012",
    "commentBody": "",
    "originSummary": [
      "நிரலாக்க மொழிகள், மென்பொருள் பொறியியல் மற்றும் வன்பொருள் வடிவமைப்பு ஆகியவற்றில் புகழ்பெற்ற நபரான நிக்லாஸ் விர்த் ஜனவரி 1 அன்று காலமானார்.",
      "பெர்ட்ரண்ட் மேயர் விர்த்தின் இழப்பிற்கு இரங்கல் தெரிவிக்கிறார் மற்றும் ஒரு முன்னோடியாகவும் வழிகாட்டியாகவும் அவரது பங்களிப்புகளை அங்கீகரிக்கிறார்.",
      "விர்த்தின் பாரம்பரியத்தில் பாஸ்கல் மற்றும் மொடுலா போன்ற நிரலாக்க மொழிகளில் அவரது பணிகளும், மென்பொருள் முறை மற்றும் வன்பொருள் வடிவமைப்பில் அவரது செல்வாக்கும் அடங்கும்."
    ],
    "commentSummary": [
      "மொழி வடிவமைப்பில் செல்வாக்கு மிக்க பங்களிப்புகளுக்காக அறியப்பட்ட கணினி விஞ்ஞானி நிக்லாஸ் விர்த் காலமானார்.",
      "கணினி அறிவியலில், குறிப்பாக பாஸ்கல் மற்றும் ஓபரான் போன்ற மொழிகளின் வளர்ச்சியில் விர்த்தின் தாக்கம் மற்றும் செல்வாக்கு நினைவுகூரப்படுகிறது மற்றும் பாராட்டப்படுகிறது.",
      "நிரலாக்கத்தில் எளிமை மற்றும் தெளிவுக்கான அவரது வலியுறுத்தல் பயனர்களால் அங்கீகரிக்கப்பட்டு பாராட்டப்படுகிறது, அவர்கள் தங்கள் கல்வி மற்றும் தொழில்களில் அவரது தாக்கத்திற்கு நன்றி தெரிவிக்கிறார்கள்."
    ],
    "points": 1703,
    "commentCount": 309,
    "retryCount": 0,
    "time": 1704307812
  },
  {
    "id": 38853706,
    "title": "அறை வெப்பநிலையில் மீஸ்னர் விளைவு? தாமிர மாற்று ஈய அபேடைட்டில் சாத்தியக்கூறு இருப்பதாக ஆய்வு கண்டறிந்துள்ளது",
    "originLink": "https://arxiv.org/abs/2401.00999",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38853706",
    "commentBody": "",
    "originSummary": [
      "தாமிர மாற்று ஈய அபாடைட்டில் அறை வெப்பநிலையில் மீஸ்னர் விளைவு ஏற்படுவதை இந்த ஆய்வு ஆராய்கிறது.",
      "ஒரு காந்தப்புலத்தின் கீழ் இருகாந்த டிசி காந்தமயமாக்கல் காணப்படுகிறது, மேலும் ஹிஸ்டரெசிஸ் வளையங்கள் கண்டறியப்படுகின்றன, இது 250 K க்கும் குறைவான அதிகடத்துத்திறனைக் குறிக்கிறது.",
      "அறை வெப்பநிலையில் மெய்ஸ்னர் விளைவு இந்த பொருளில் இருக்கலாம் என்று கண்டுபிடிப்புகள் தெரிவிக்கின்றன, இது அதிக வெப்பநிலையில் அதிகடத்துத்திறனின் சாத்தியமான பயன்பாடுகள் குறித்த நுண்ணறிவுகளை வழங்குகிறது."
    ],
    "commentSummary": [
      "சீன ஆராய்ச்சிக் குழுக்கள் தாமிர மாற்று ஈய அபேடைட்டில் அறை வெப்பநிலைக்கு அருகில் ஒரு சாத்தியமான மீஸ்னர் விளைவைக் கண்டறிந்துள்ளன, குறிப்பாக 250 K இல். 300 K இல் விளைவு குறித்து நிச்சயமற்ற தன்மை நீடிக்கிறது.",
      "கண்டுபிடிப்பு குறிப்பிடத்தக்க தாக்கங்களைக் கொண்டுள்ளது, ஆனால் சோதனை மீளுருவாக்கம் மற்றும் கண்டுபிடிப்புகளின் செல்லுபடியாகும் தன்மை குறித்து கேள்விகள் எழுகின்றன.",
      "இந்த விவாதத்தில் பொருள் நடத்தையை உருவகப்படுத்துவதில் உள்ள சவால்கள், அதிகடத்திறனில் முன்னேற்றங்களின் சாத்தியம் மற்றும் உலகளாவிய வர்த்தகம் மற்றும் அமெரிக்க-சீனா போட்டியின் தாக்கம் குறித்த விவாதம் ஆகியவை அடங்கும். அதிகடத்துத்திறன் தொழில்நுட்பத்தின் வளர்ச்சி ஆராய்ச்சி மற்றும் சர்வதேச போட்டியின் ஒரு புதிய சகாப்தத்திற்கு வழிவகுக்கும்."
    ],
    "points": 675,
    "commentCount": 286,
    "retryCount": 0,
    "time": 1704287976
  },
  {
    "id": 38855337,
    "title": "FrameOS: ஒற்றை-செயல்பாடு ஸ்மார்ட் பிரேம்களுக்கான ஒரு ஓஎஸ்",
    "originLink": "https://frameos.net/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38855337",
    "commentBody": "",
    "originSummary": [
      "ஃபிரேம்ஓஎஸ் என்பது ஸ்மார்ட் ஹோம் காலெண்டர்கள் மற்றும் பொது விளம்பர திரைகள் போன்ற ஒற்றை செயல்பாட்டு ஸ்மார்ட் பிரேம்களுக்காக வடிவமைக்கப்பட்ட ஒரு இயக்க முறைமையாகும்.",
      "இது ராஸ்பெர்ரி பையில் இயங்கலாம் மற்றும் மின்-மை மற்றும் பாரம்பரிய காட்சிகள் இரண்டையும் ஆதரிக்கிறது.",
      "FrameOS இன் சில குறிப்பிடத்தக்க அம்சங்களில் மையப்படுத்தப்பட்ட பணியமர்த்தல், திறமையான தொகுப்பு, டிராக் அண்ட் டிராப் வரைபட எடிட்டர், ஜிபிடி 4 ஆதரவு மற்றும் வன்பொருள் வழிகாட்டிகள் ஆகியவை அடங்கும். இருப்பினும், ஃபிரேம்ஓஎஸ் இன்னும் ஆரம்ப வளர்ச்சியில் உள்ளது மற்றும் இன்னும் நிலையான வெளியீட்டைக் கொண்டிருக்கவில்லை என்பதைக் கவனத்தில் கொள்ள வேண்டியது அவசியம்."
    ],
    "commentSummary": [
      "இந்த விவாதம் தகவல்களைக் காண்பிப்பதற்கான மென்பொருள் மற்றும் வன்பொருளைச் சுற்றியுள்ள பரந்த அளவிலான தலைப்புகளை உள்ளடக்கியது.",
      "ஸ்மார்ட் பிரேம்களுக்கான ஃப்ரேம்ஓஎஸ் பயன்பாடு, தனியுரிமைக் கொள்கைகள் பற்றிய கவலைகள் மற்றும் பயன்பாடுகளில் இயற்கை மொழி உள்ளீட்டின் ஒருங்கிணைப்பு ஆகியவை இதில் அடங்கும்.",
      "பிற தலைப்புகளில் தகவல்களைக் காண்பிப்பதற்கான மாற்று சாதனங்கள், ஆடியோ இயக்கிகளுக்கு அமேசான் ஃபயர் டேப்லெட்டுகளின் பயன்பாடு, மின்-மை காட்சிகளைப் பயன்படுத்துவதற்கான சவால்கள் மற்றும் விருப்பங்கள் மற்றும் மோஷன்ஐஇ ஓஎஸ்ஸின் சாத்தியமான பயன்பாடுகள் ஆகியவை அடங்கும்."
    ],
    "points": 409,
    "commentCount": 98,
    "retryCount": 0,
    "time": 1704296542
  },
  {
    "id": 38859976,
    "title": "டிரான்ஸ்பார்மர்களுக்குப் பின்னால் உள்ள கணிதத்தை வரையறுத்தல்: ஒரு விரிவான கண்ணோட்டம் மற்றும் செயலாக்க வழிகாட்டி",
    "originLink": "https://osanseviero.github.io/hackerllama/blog/posts/random_transformer/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38859976",
    "commentBody": "",
    "originSummary": [
      "உரை டிரான்ஸ்பார்மர் மாதிரி, அதன் கூறுகள் மற்றும் குறியீடு எடுத்துக்காட்டுகள் மூலம் அதன் செயலாக்கம் பற்றிய முழுமையான விளக்கத்தை வழங்குகிறது.",
      "இது டோக்கனைசேஷன், உட்பொதித்தல், நிலையான குறியாக்கம், கவன வழிமுறைகள், எஞ்சிய இணைப்புகள் மற்றும் அடுக்கு இயல்பாக்கம் ஆகியவற்றை உள்ளடக்கியது.",
      "டிரான்ஸ்பார்மர் மாதிரியைப் பயன்படுத்தி வெளியீட்டு வரிசைகளை உருவாக்குவதோடு, பயிற்சியில் முகமூடி சுய-கவனம் மற்றும் என்கோடர்-டிகோடர் கவனத்தின் முக்கியத்துவம் வலியுறுத்தப்படுகிறது."
    ],
    "commentSummary": [
      "விவாதத்தில் பங்கேற்பாளர்கள் செயற்கை நுண்ணறிவு வளர்ச்சியில் டிரான்ஸ்பார்மர்கள் தொடர்பான பல்வேறு தலைப்புகளை ஆராய்கின்றனர், இதில் டிரான்ஸ்பார்மர்களுக்குப் பின்னால் உள்ள கணிதம் மற்றும் என்.ஏ.என்கள் மற்றும் தரவு பகுப்பாய்வில் டிரான்ஸ்பார்மர்களின் தனித்துவம் போன்ற சிக்கல்கள் ஆகியவை அடங்கும்.",
      "செயற்கை நுண்ணறிவில் முன்னேற்றத்திற்கான கற்றல் அளவுருவாக கணினி வரைபடத்தை மாற்ற வேண்டியதன் அவசியம் விவாதிக்கப்படுகிறது, அத்துடன் தகவல் சுருக்கம் மற்றும் சிக்கலைத் தீர்ப்பதில் மொழி கற்றல் மாதிரிகளின் செயல்திறன் மற்றும் செயல்திறன்.",
      "திசையன் குறியாக்கம், அறியப்படாத சொற்கள் அல்லது துணைச்சொற்களைக் கையாளுதல், நிலை உட்பொதித்தல் மற்றும் நரம்பியல் நெட்வொர்க்குகளில் நியூரான்களின் தன்மை மற்றும் டோக்கன் எடையிடல் போன்ற தலைப்புகளுடன் பைனரி எடைகளின் வரம்புகள், அனலாக் கம்ப்யூட்டிங், சாய்வு இறக்கம் மற்றும் மரபணு வழிமுறைகளின் பயன்பாடு ஆகியவை விவாதிக்கப்படுகின்றன. சில பயனர்கள் டிரான்ஸ்பார்மர்களைப் புரிந்துகொள்வதற்கான மாற்று வழிகளை பரிந்துரைக்கின்றனர், மற்றவர்கள் புலத்தைப் புரிந்துகொள்வதில் நேரத்தை முதலீடு செய்வதன் முக்கியத்துவத்தை வலியுறுத்துகின்றனர்."
    ],
    "points": 374,
    "commentCount": 89,
    "retryCount": 0,
    "time": 1704316235
  },
  {
    "id": 38854596,
    "title": "சிறிய விளையாட்டுகளை செய்வதன் வேடிக்கை மற்றும் நன்மைகளை அனுபவிக்கவும்",
    "originLink": "https://abagames.github.io/joys-of-small-game-development-en/fun_to_make_small_games.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38854596",
    "commentBody": "",
    "originSummary": [
      "இந்த கட்டுரை 10 நிமிடங்களுக்குள் முடிக்கப்பட்டு உலாவிகளில் விளையாடக்கூடிய சிறிய விளையாட்டுகளை உருவாக்குவதன் நன்மைகள் மற்றும் மகிழ்ச்சியை ஆராய்கிறது.",
      "ஆசிரியர் 350 க்கும் மேற்பட்ட சிறிய விளையாட்டுகளை உருவாக்கிய தங்கள் அனுபவத்தைப் பகிர்ந்து கொள்கிறார், மேலும் அத்தகைய விளையாட்டுகளுக்குத் தேவையான குறுகிய வளர்ச்சி நேரத்தை எடுத்துக்காட்டுகிறார்.",
      "இது சிறிய விளையாட்டுகளின் வசீகரம் மற்றும் தனித்துவமான குணங்களை வலியுறுத்துகிறது மற்றும் வாக்குறுதிகளை நிறைவேற்றுவது, வாய்ப்பைக் குறைப்பது மற்றும் தனிப்பட்ட பாணியைச் சேர்ப்பது உள்ளிட்ட நல்ல சிறிய விளையாட்டுகளை உருவாக்குவதற்கான பன்னிரண்டு எண்ணங்களை வழங்குகிறது.",
      "சிறிய விளையாட்டுகளை உருவாக்குவது விளையாட்டு மேம்பாட்டு திறன்களை மேம்படுத்துவதற்கான ஒரு வழியாக மட்டுமல்லாமல், பலனளிக்கும் மற்றும் சுவாரஸ்யமான அனுபவமாகும்."
    ],
    "commentSummary": [
      "விவாதம் விளையாட்டு வடிவமைப்பு மற்றும் மேம்பாட்டில் கவனம் செலுத்துகிறது, காகித புரோட்டோடைப்பிங், மெக்கானிக்ஸ்-முதல் வடிவமைப்பு, விளையாட்டு வடிவமைப்பில் நம்பிக்கை கட்டமைப்பு மற்றும் விளையாட்டு திட்டங்களை முடிப்பதன் மதிப்பு போன்ற தலைப்புகளை உள்ளடக்கியது.",
      "விளையாட்டு மேம்பாட்டில் ஈடுபட்டுள்ள பல்வேறு நபர்கள் தங்கள் தனிப்பட்ட அனுபவங்களையும் பரிந்துரைகளையும் பகிர்ந்து கொள்கிறார்கள்.",
      "சில பயனர்கள் கட்டுரை அதன் எழுத்து பாணி காரணமாக செயற்கை நுண்ணறிவால் உருவாக்கப்பட்டதா என்று ஊகிக்கின்றனர்."
    ],
    "points": 369,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1704292942
  },
  {
    "id": 38858075,
    "title": "வெளியீட்டுக்குப் பிந்தைய பாதையில் செல்லுதல்: குற்றவாளிகளுக்கான தொழில்நுட்ப தொழில் வாய்ப்புகள்",
    "originLink": "https://news.ycombinator.com/item?id=38858075",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38858075",
    "commentBody": "",
    "originSummary": [
      "தாக்குதலுக்கான தண்டனை காரணமாக வேலை தேடுவதில் சிரமங்களை எதிர்கொண்ட பின்னர் தனிநபர் தொழில்நுட்ப / தொடக்கத் துறையில் மீண்டும் நுழைவதற்கான ஆலோசனைகளையும் வாய்ப்புகளையும் நாடுகிறார்.",
      "கணினி / நிதி / மோசடி / போதைப்பொருள் விற்பனை / உடல் ரீதியான வன்முறை ஆகியவற்றுடன் தொடர்புடையதாக இல்லாவிட்டாலும், அவர்களுக்கு வாய்ப்பு வழங்க தயாராக இருக்கும் நிறுவனங்களை அவர்கள் தேடுகிறார்கள்.",
      "அவர்களின் பின்னணி மற்றும் தகுதிகள் பற்றிய கூடுதல் தகவலுக்கு அவர்கள் லிங்க்ட்இன் சுயவிவரத்தை வழங்கியுள்ளனர்."
    ],
    "commentSummary": [
      "ஹேக்கர் நியூஸ் விவாதம் தொழில்நுட்பத் துறையில் வேலை தேடும் குற்றப் பதிவுகளைக் கொண்ட நபர்களை மையமாகக் கொண்டுள்ளது.",
      "பங்கேற்பாளர்கள் வேலையைக் கண்டுபிடிப்பதில் தங்கள் சவால்களைப் பற்றி விவாதிக்கிறார்கள் மற்றும் ஒருவருக்கொருவர் ஆலோசனைகளையும் வளங்களையும் வழங்குகிறார்கள்.",
      "உரையாடலில் கடந்தகால செயல்களின் ஒழுக்கம், நம்பகத்தன்மையின் முக்கியத்துவம், பின்னணி சோதனைகள் மற்றும் வேலை வாய்ப்புகளில் குற்றவியல் பதிவுகளின் சாத்தியமான தாக்கம் போன்ற தலைப்புகள் அடங்கும்."
    ],
    "points": 307,
    "commentCount": 302,
    "retryCount": 0,
    "time": 1704308037
  },
  {
    "id": 38853058,
    "title": "பிட்வர்டனின் விண்டோஸ் ஹலோவில் உள்ள பாதிப்பு தொலைநிலை நற்சான்றிதழ் திருட்டுக்கு வழிவகுக்கிறது",
    "originLink": "https://blog.redteam-pentesting.de/2024/bitwarden-heist/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38853058",
    "commentBody": "",
    "originSummary": [
      "பிட்வர்டனின் விண்டோஸ் ஹலோ செயலாக்கத்தில் உள்ள ஒரு குறைபாடு நற்சான்றிதழ்களை தொலைவிலிருந்து திருட அனுமதித்தது, ஆனால் அது சரிசெய்யப்பட்டுள்ளது.",
      "டிபிஏபிஐ காப்பு விசைகளைப் பயன்படுத்தியும், பிட்வர்டன் தரவு கோப்புகள் மற்றும் நற்சான்றிதழ்களை மறைகுறியாக்கம் செய்வதையும் இந்த கட்டுரை விளக்குகிறது.",
      "மைக்ரோசாப்ட் ஈடுபட்டது, மேலும் பிட்வர்டன் தற்போதைய பதிப்பில் மாற்றங்கள் மற்றும் பாதிப்பு சோதனைக்கு இம்பாக்கட்டைப் பயன்படுத்துவது உள்ளிட்ட சிக்கலை நிவர்த்தி செய்ய மாற்றங்களைச் செய்தார்."
    ],
    "commentSummary": [
      "கடவுச்சொல் பெட்டகங்களில் உள்ள பாதிப்புகள், விண்டோஸ் பதிவேடு சிக்கல்கள், பயனர் தரவைப் பாதுகாத்தல் மற்றும் குறியாக்கம் மற்றும் இரண்டு காரணி அங்கீகாரத்தை செயல்படுத்துதல் உள்ளிட்ட பல்வேறு கணினி பாதுகாப்பு தலைப்புகளை உரையாடல் உள்ளடக்கியது.",
      "இது கடவுச்சொற்களை நிர்வகிப்பதில் உள்ள சவால்கள், முக்கியமான தகவல்களை சேமிப்பதில் உள்ள அபாயங்கள் மற்றும் பயோமெட்ரிக் அங்கீகாரத்தின் பாதுகாப்பு குறித்த கவலைகளை வலியுறுத்துகிறது.",
      "கணினி பாதுகாப்பை மேம்படுத்துவதற்கான தற்போதைய முயற்சியில் சிறந்த பாதுகாப்பு நடைமுறைகள், பயனர் கல்வி மற்றும் விழிப்புணர்வின் அவசியத்தை இந்த விவாதம் அடிக்கோடிட்டுக் காட்டுகிறது."
    ],
    "points": 285,
    "commentCount": 166,
    "retryCount": 0,
    "time": 1704282792
  },
  {
    "id": 38856999,
    "title": "இலவச, நோ-நொன்சென்ஸ் அம்பிபோன் பயன்பாடு: சுற்றுப்புற இசை மற்றும் வெள்ளை நாய்",
    "originLink": "https://ambiph.one?hn",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38856999",
    "commentBody": "",
    "originSummary": [
      "தனிநபர் ஒரு இலவச வெள்ளை இரைச்சல் பயன்பாட்டை உருவாக்கினார், இது பயனர் நட்பு மற்றும் உள்நுழைவு தேவையில்லை, விளம்பரங்களைக் கொண்டிருக்கவில்லை அல்லது பயன்பாட்டில் வாங்குதல்களை வழங்கவில்லை.",
      "தி எகனாமிஸ்ட் பாட்காஸ்டில் இந்த பயன்பாடு இடம்பெற்றது, அங்கு படைப்பாளி தங்கள் பயன்பாடு மற்றும் ஆம்பியன்ட் ஸ்காட்ரெயில் பீட்ஸ் என்ற மற்றொரு திட்டத்தைப் பற்றி விவாதித்தார்.",
      "படைப்பாளி புதிய இசை மற்றும் ஒலிகளுடன் பயன்பாட்டை தவறாமல் புதுப்பித்து வருகிறார் மற்றும் மேலும் மேம்பாட்டிற்கான பயனர் பரிந்துரைகளை ஊக்குவிக்கிறார்."
    ],
    "commentSummary": [
      "தனிநபர் எளிய இடைமுகம், விளம்பரங்கள் அல்லது பயன்பாட்டில் வாங்குதல்களுடன் அம்பிபோன் எனப்படும் இலவச வெள்ளை இரைச்சல் பயன்பாட்டை உருவாக்கியுள்ளார்.",
      "பயனர்கள் ஆஃப்லைன் பயன்முறையைச் சேர்க்கவும், சத்தங்களை ப்ரீலோட் செய்து சேமிக்கும் திறனையும் பரிந்துரைத்துள்ளனர், இது அத்தகைய பயன்பாடுகளுக்கான சந்தா மாதிரிகள் பற்றிய விவாதத்தைத் தூண்டுகிறது.",
      "பயன்பாட்டு டெவலப்பர் பின்னூட்டத்திற்கு திறந்திருக்கிறார் மற்றும் ஏற்கனவே மேம்பாடுகளைச் சோதித்து வருகிறார், இதில் ஒரு அம்சத்தைச் சேர்ப்பது மற்றும் தொகுதி ஸ்லைடர்களை மேம்படுத்துவது ஆகியவை அடங்கும்."
    ],
    "points": 277,
    "commentCount": 108,
    "retryCount": 0,
    "time": 1704303689
  },
  {
    "id": 38862106,
    "title": "மஸ்க்கை விமர்சித்த தொழிலாளர்களை சட்டவிரோதமாக பணிநீக்கம் செய்ததாக ஸ்பேஸ்எக்ஸ் மீது குற்றம் சாட்டப்பட்டது: என்.எல்.ஆர்.பி.",
    "originLink": "https://www.nytimes.com/2024/01/03/business/spacex-elon-musk-nlrb-workers.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38862106",
    "commentBody": "",
    "originSummary": [
      "எலான் மஸ்க்கை விமர்சித்ததற்காக ஸ்பேஸ்எக்ஸ் நிறுவனம் சட்டவிரோதமாக 8 ஊழியர்களை பணிநீக்கம் செய்ததாக தேசிய தொழிலாளர் உறவுகள் வாரியம் குற்றம் சாட்டியுள்ளது.",
      "மஸ்க்கின் சர்ச்சைக்குரிய சமூக ஊடக கருத்துகளிலிருந்து விலகி இருக்குமாறும், அதன் துன்புறுத்தல் கொள்கைகளை தெளிவுபடுத்தி செயல்படுத்துமாறும் ஊழியர்கள் ஒரு கடிதத்தைப் பகிர்ந்து கொண்டனர்.",
      "ஸ்பேஸ்எக்ஸின் தலைவர் மற்றும் பிற நிர்வாகிகள் தொழிலாளர் விதிமுறைகளை மீறி கடிதத்தின் புழக்கத்தை கட்டுப்படுத்தியதாக தொழிலாளர் வாரிய புகாரில் குற்றம் சாட்டப்பட்டுள்ளது.",
      "தீர்வு எட்டப்படாவிட்டால், மார்ச் மாதம் இந்த வழக்கு நிர்வாக நீதிபதியிடம் சமர்ப்பிக்கப்படும்.",
      "பாதிக்கப்பட்ட ஊழியர்களுக்கு மீண்டும் பணி நியமனம், மீண்டும் ஊதியம் வழங்குதல் போன்ற தீர்வுகளை தொழிலாளர் வாரியம் கோருகிறது.",
      "இந்த குற்றச்சாட்டு ஸ்பேஸ் எக்ஸ் மற்றும் மஸ்க் தலைமையிலான பிற நிறுவனங்கள் எதிர்கொள்ளும் தொடர்ச்சியான தொழிலாளர் மற்றும் பாகுபாடு தொடர்பான சட்ட சிக்கல்களை சேர்க்கிறது."
    ],
    "commentSummary": [
      "ஸ்பேஸ் எக்ஸ் மற்றும் அதன் தலைமை நிர்வாக அதிகாரி எலான் மஸ்க்கைச் சுற்றியுள்ள விவாதங்கள், மஸ்க்கை விமர்சிக்கும் தொழிலாளர்களை சட்டவிரோதமாக பணிநீக்கம் செய்த குற்றச்சாட்டுகள், நிறுவனத்திற்குள் அதிகார இயக்கவியல் மற்றும் கார்ப்பரேட் தலைமை மற்றும் ஊழியர் உரிமைகள் குறித்த விவாதங்கள் உள்ளிட்ட பல தலைப்புகளைத் தொட்டுள்ளன.",
      "சாத்தியமான சட்ட நடவடிக்கைகள் தொடர்பாக தேசிய தொழிலாளர் உறவுகள் வாரியம் (என்.எல்.ஆர்.பி) குறிப்பிடப்பட்டுள்ளது.",
      "எலான் மஸ்க்கின் பொது அறிக்கைகள் மற்றும் அவரது நிறுவனங்களின் அரசாங்க ஒப்பந்தங்களைச் சுற்றியுள்ள சர்ச்சைகளும் விவாதப் பொருளாக உள்ளன. இந்த விவாதங்கள் பொறுப்புக்கூறல், தொழிலாளர் பாதுகாப்புகள், பேச்சு சுதந்திரம் மற்றும் ஊழியர்களின் அதிருப்தியை நிர்வகிப்பதில் தலைமை நிர்வாக அதிகாரிகளின் பங்கு போன்ற பிரச்சினைகளை எடுத்துக்காட்டுகின்றன."
    ],
    "points": 269,
    "commentCount": 233,
    "retryCount": 0,
    "time": 1704332537
  },
  {
    "id": 38857396,
    "title": "பேக்பிளேஸ் டிரைவ் தோல்வி விகிதங்களில் வயது தொடர்பான தொடர்பு எதுவும் காணப்படவில்லை",
    "originLink": "https://www.backblaze.com/blog/the-drive-stats-of-backblaze-storage-pods/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38857396",
    "commentBody": "",
    "originSummary": [
      "பேக்பிளேஸ் என்ற தரவு சேமிப்பு நிறுவனம், பேக்பிளேஸ் வால்ட்ஸ் எனப்படும் அதன் சேமிப்பக சேவையகங்களில் டிரைவ் செயலிழப்பு விகிதங்களின் பகுப்பாய்வை நடத்தியுள்ளது.",
      "டிரைவ்களின் வயது மற்றும் வெவ்வேறு வால்ட் குழுக்களிடையே தோல்வி விகிதங்களுக்கு இடையே எந்த தொடர்பும் இல்லை என்பதை பகுப்பாய்வு வெளிப்படுத்துகிறது.",
      "குறிப்பிட்ட டிரைவ் மாடல்கள் வெவ்வேறு வால்ட் குழுக்களில் சிறந்த செயல்திறனை வெளிப்படுத்துகின்றனவா என்பதை தீர்மானிக்க கூடுதல் ஆராய்ச்சி செய்ய பேக்பிளேஸ் விரும்புகிறது."
    ],
    "commentSummary": [
      "பயனர்கள் பேக்பிளேஸ், ஆர்க்ளோன் மற்றும் கிளவுட்ஃப்ளேர் போன்ற பல்வேறு கிளவுட் ஸ்டோரேஜ் வழங்குநர்கள் மற்றும் காப்பு விருப்பங்களைப் பற்றிய தங்கள் அனுபவங்களையும் கவலைகளையும் விவாதிக்கின்றனர்.",
      "குறியாக்க முறைகள், சேவையக நம்பகத்தன்மை மற்றும் மாற்று காப்பு கருவிகள் உள்ளிட்ட பல்வேறு தலைப்புகள் உள்ளடக்கப்பட்டுள்ளன.",
      "வணிக ரீதியாக கிடைக்கக்கூடிய விருப்பங்களைப் பயன்படுத்துவதற்கு எதிராக தனிப்பயன் சேவையகங்களை உருவாக்குவதற்கான செலவுகள் மற்றும் நன்மைகள், அத்துடன் தரவு மைய இடமாற்றங்கள், இயக்கக தோல்வி விகிதங்கள் மற்றும் செலவு குறைந்த வெளிப்புற சேமிப்பக விருப்பங்களுக்கான பரிந்துரைகள் ஆகியவற்றையும் பயனர்கள் விவாதிக்கின்றனர்."
    ],
    "points": 237,
    "commentCount": 126,
    "retryCount": 0,
    "time": 1704305278
  },
  {
    "id": 38853877,
    "title": "லினக்ஸின் டெஸ்க்டாப் பயனர் பகிர்வு கிட்டத்தட்ட 4% ஐ எட்டியது, மேகோஸை முந்தியது",
    "originLink": "https://www.gamingonlinux.com/2024/01/linux-hits-nearly-4-desktop-user-share-on-statcounter/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38853877",
    "commentBody": "",
    "originSummary": [
      "லினக்ஸின் டெஸ்க்டாப் பயனர் பங்கு டிசம்பர் 2023 இல் கிட்டத்தட்ட 4% ஐ எட்டியது, இது சமீபத்திய ஆண்டுகளில் குறிப்பிடத்தக்க மேல்நோக்கிய போக்கைக் குறிக்கிறது.",
      "லினக்ஸில் கட்டமைக்கப்பட்ட குரோம்ஓஎஸ்ஸைக் கருத்தில் கொள்ளும்போது, ஒட்டுமொத்த லினக்ஸ் பயனர் பகிர்வு 6.24% ஆகும்.",
      "மேகோஸ் பயனர்களில் 5% சரிவை சந்தித்தது, அதே நேரத்தில் விண்டோஸ் 3% அதிகரிப்பைக் கண்டது. ChromeOS மற்றும் பிற லினக்ஸ் விநியோகங்களுக்கு இடையே பொருந்தக்கூடிய தன்மையை செயல்படுத்துவதற்கான முயற்சிகள் மேற்கொள்ளப்பட்டு வருகின்றன, இதில் நீராவி மற்றும் நீராவி கேம்களை ChromeOS க்கு கொண்டு வரும் திட்டங்களும் அடங்கும். இந்த கண்டுபிடிப்புகள் டெஸ்க்டாப் இயக்க முறைமையாக லினக்ஸின் அதிகரித்து வரும் பிரபலத்தை எடுத்துக்காட்டுகின்றன."
    ],
    "commentSummary": [
      "இந்த விவாதம் டெஸ்க்டாப் ஓஎஸ் ஆக லினக்ஸின் அதிகரித்து வரும் புகழ் மற்றும் மைக்ரோசாப்ட் விதித்த வரம்புகள் மற்றும் கட்டுப்பாடுகள் உட்பட விண்டோஸ் 11 உடனான விரக்திகளை ஆராய்கிறது.",
      "இது விண்டோஸ் மற்றும் லினக்ஸுக்கு இடையிலான பயன்பாட்டின் எளிமையை ஒப்பிடுகிறது, லினக்ஸில் வன்பொருள் ஆதரவு மற்றும் தனிப்பயனாக்கம் பற்றிய கவலைகளை நிவர்த்தி செய்கிறது, மேலும் கேமிங்கில் வெவ்வேறு இயக்க முறைமைகளின் தாக்கத்தைத் தொடுகிறது.",
      "குறிப்பிட்ட தொழில்களில் விண்டோஸின் ஆதிக்கம், மொபைல் சாதனங்களின் எழுச்சி மற்றும் மைக்ரோசாப்ட், ஆப்பிள் மற்றும் லினக்ஸுக்கு இடையிலான போட்டி ஆகியவற்றையும் உரையாடல் குறிப்பிடுகிறது. இது தனியுரிமை கவலைகள், பயனர் விருப்பத்தேர்வுகள் மற்றும் தொழில்நுட்பத் துறையில் போட்டியின் முக்கியத்துவத்தை வலியுறுத்துகிறது."
    ],
    "points": 233,
    "commentCount": 322,
    "retryCount": 0,
    "time": 1704289031
  },
  {
    "id": 38856412,
    "title": "தரவு மீறல் குற்றம் சாட்டும் விளையாட்டில் 23 மற்றும் மீ பின்னடைவை எதிர்கொள்கிறது",
    "originLink": "https://techcrunch.com/2024/01/03/23andme-tells-victims-its-their-fault-that-their-data-was-breached/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38856412",
    "commentBody": "",
    "originSummary": [
      "மரபணு சோதனை நிறுவனமான 23 அண்ட் மீ 6.9 மில்லியன் பயனர்களின் மரபணு மற்றும் வம்சாவளி தரவை அம்பலப்படுத்திய தரவு மீறலுக்கு வாடிக்கையாளர்களை குற்றம் சாட்டுகிறது, கடவுச்சொற்களைப் புதுப்பிக்காததற்கும் மறுசுழற்சி செய்வதற்கும் வாடிக்கையாளர்கள் தவறு செய்ததாகக் கூறுகிறது.",
      "வாடிக்கையாளர் தரவைப் பாதுகாக்க 23 மற்றும் மீ வலுவான பாதுகாப்பு நடவடிக்கைகளை செயல்படுத்தியிருக்க வேண்டும் என்று பாதிக்கப்பட்டவர்களுக்கான சட்டப் பிரதிநிதிகள் வாதிடுகின்றனர்.",
      "பாதிக்கப்பட்ட பயனர்களிடமிருந்து 30 க்கும் மேற்பட்ட வழக்குகளை எதிர்கொள்கிறது மற்றும் பாதிக்கப்பட்டவர்கள் நிறுவனத்திற்கு எதிராக சட்ட உரிமைகோரல்களை தாக்கல் செய்வதை மிகவும் கடினமாக்கும் வகையில் அதன் சேவை விதிமுறைகளை மாற்றியுள்ளது."
    ],
    "commentSummary": [
      "மரபணு சோதனை நிறுவனமான 23 மற்றும் மீ இல் தரவு மீறல் 14,000 பயனர்களின் தனிப்பட்ட தகவல்களை சமரசம் செய்தது, இது நிறுவனத்தின் பாதுகாப்பு நடவடிக்கைகள் குறித்த விமர்சனங்களைத் தூண்டியது.",
      "பல காரணி அங்கீகாரம் மற்றும் சமரசம் செய்யப்பட்ட கடவுச்சொற்களுக்கான செயலூக்கமான எச்சரிக்கை அமைப்புகள் உள்ளிட்ட வலுவான பாதுகாப்பு நடவடிக்கைகளை 23 மற்றும் மீ செயல்படுத்தியிருக்க வேண்டும் என்று விமர்சகர்கள் வாதிடுகின்றனர்.",
      "மீறப்பட்ட தரவிலிருந்து பயனர் இருப்பிடத்தைத் தீர்மானிப்பது, மீறல்களில் போட்நெட்களைப் பயன்படுத்துவது மற்றும் தனிப்பட்ட தகவல்களைப் பாதுகாப்பதில் வலைத்தளங்களின் பொறுப்பு குறித்து மீறல் கவலைகளை எழுப்புகிறது. டி.என்.ஏ தரவைப் பாதுகாப்பதில் வலுவான பாதுகாப்பு நடவடிக்கைகளின் அவசியத்தையும் கடவுச்சொல் பாதுகாப்பின் முக்கியத்துவத்தையும் இது எடுத்துக்காட்டுகிறது."
    ],
    "points": 227,
    "commentCount": 293,
    "retryCount": 0,
    "time": 1704301198
  },
  {
    "id": 38856559,
    "title": "கொள்கலன்களை WASM ஆக மாற்றவும், Container2wasm",
    "originLink": "https://github.com/ktock/container2wasm",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38856559",
    "commentBody": "",
    "originSummary": [
      "கொள்கலன் 2வாஸ்ம் என்பது ஒரு சோதனை மென்பொருளாகும், இது கொள்கலன் படங்களை WASI இயக்க நேரம் அல்லது உலாவியில் இயங்குவதற்காக வெப்அசெம்ப்ளி (WASM) படங்களாக மாற்றுகிறது.",
      "இது x86_64 மற்றும் ரிஸ்க்வி 64 கொள்கலன்களை ஆதரிக்கிறது மற்றும் நெட்வொர்க்கிங் திறன்கள் மற்றும் ஹோஸ்ட் இயந்திரத்திலிருந்து வரைபடப்படுத்தப்பட்ட கோப்பகங்களுக்கான அணுகல் ஆகியவற்றுடன் பிற தளங்களுக்கு எமுலேஷனை வழங்குகிறது.",
      "மற்றொரு திட்டமான கன்டெய்னர் 2வாசி, WASM இல் RISC-V CPU களைப் பின்பற்றுவதில் கவனம் செலுத்துகிறது மற்றும் கோப்பக வரைபடம், நெட்வொர்க்கிங் மற்றும் பாதுகாப்பு அம்சங்களை வழங்குகிறது."
    ],
    "commentSummary": [
      "கொள்கலன் 2வாஸ்ம் என்பது வலை உலாவிகளில் இயங்குவதற்காக கொள்கலன்களை வெப்அசெம்ப்ளி (WASM) ப்ளாப்களாக மாற்ற அனுமதிக்கும் ஒரு திட்டமாகும்.",
      "இந்த விவாதத்தில் கொள்கலன் மாற்றம் தொடர்பான பிற திட்டங்கள் மற்றும் GUI கட்டமைப்புகள் அடங்கும், மேலும் உடனடி பயன்முறை GUI களில் கவனம் செலுத்தி, பயனர் இடைமுகங்களை உருவாக்குவதற்கான பல்வேறு கட்டமைப்புகளின் நன்மை தீமைகளை எடுத்துக்காட்டுகிறது.",
      "இந்த உரையாடல் சமூகத்தால் தேர்ந்தெடுக்கப்பட்ட தலைவரின் பற்றாக்குறை மற்றும் வெப்அசெம்ப்ளியின் சாத்தியமான எதிர்காலம், அத்துடன் செலவு சேமிப்பு மற்றும் கல்வி சூழல்கள் போன்ற கொள்கலன் 200 இன் நன்மைகள் மற்றும் பயன்பாட்டு வழக்குகள் பற்றிய கருத்துகளையும் தொடுகிறது. கூடுதலாக, வெப்அசெம்பிளியின் உற்பத்தித்திறன் மற்றும் அணுகல் வலியுறுத்தப்படுகிறது."
    ],
    "points": 213,
    "commentCount": 59,
    "retryCount": 0,
    "time": 1704301838
  },
  {
    "id": 38855427,
    "title": "அமெரிக்க நகரங்கள் பார்க்கிங் இல்லாத எதிர்காலத்தை தழுவுகின்றன",
    "originLink": "https://www.npr.org/2024/01/02/1221366173/u-s-cities-drop-parking-space-minimums-development",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38855427",
    "commentBody": "",
    "originSummary": [
      "யுனைடெட் ஸ்டேட்ஸில் உள்ள நகரங்கள் மாற்று போக்குவரத்தை ஊக்குவிப்பதற்கும் வீட்டு மலிவு விலையை அதிகரிப்பதற்கும் ஆஃப்-ஸ்ட்ரீட் பார்க்கிங் குறைந்தபட்சங்களை நீக்குகின்றன.",
      "தன்னிச்சையான விதிகள் மற்றும் வீட்டு செலவுகள் மற்றும் நெரிசலில் பார்க்கிங்கின் எதிர்மறையான தாக்கத்தை மேற்கோள் காட்டி, 50 க்கும் மேற்பட்ட நகரங்கள் மற்றும் நகரங்கள் ஏற்கனவே பார்க்கிங் தேவைகளை நீக்கியுள்ளன.",
      "பார்க்கிங் கட்டளைகளை அகற்றுவதற்கான நடவடிக்கை போக்குவரத்தை ஊக்குவிப்பதையும் பரவலைக் குறைப்பதையும் நோக்கமாகக் கொண்டுள்ளது, நியூயார்க், மில்வாக்கி மற்றும் டல்லாஸ் உள்ளிட்ட பல நகரங்கள் இதைப் பின்பற்றுவதைக் கருத்தில் கொண்டுள்ளன."
    ],
    "commentSummary": [
      "இந்த சுருக்கம் அமெரிக்க நகரங்களில் பார்க்கிங் தேவைகளுக்கும் அதிக வீட்டு செலவுகளுக்கும் இடையிலான தொடர்பையும், வீட்டுவசதி நெருக்கடியில் குடியேற்றத்தின் பங்கையும் ஆராய்கிறது.",
      "இது கார் மைய நகரங்களின் தாக்கம் மற்றும் வீட்டு நெருக்கடியை நிவர்த்தி செய்ய மாற்று போக்குவரத்திற்கு ஆதரவாக கார் பயன்பாட்டைக் குறைப்பதன் முக்கியத்துவத்தை ஆராய்கிறது.",
      "இந்த விவாதம் அதிக அடர்த்தி கொண்ட பகுதிகளில் வாழ்வதன் நன்மைகள் மற்றும் தீமைகள் மற்றும் கார் இல்லாமல் வாழ்வதன் சவால்கள் ஆகியவற்றைக் கருத்தில் கொண்டு, கார் உரிமையின் செலவுகள் மற்றும் பொது போக்குவரத்தின் முக்கியத்துவத்தை எடுத்துக்காட்டுகிறது."
    ],
    "points": 191,
    "commentCount": 383,
    "retryCount": 0,
    "time": 1704296958
  },
  {
    "id": 38859749,
    "title": "திறமையான மல்டிமோடல் பெரிய மொழி மாதிரி: டைனிஜிபிடி-வி கண்ணோட்டம்",
    "originLink": "https://github.com/DLYuanGod/TinyGPT-V",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38859749",
    "commentBody": "",
    "originSummary": [
      "குறியீடு தயாரிப்பு, எடை பதிவிறக்கம் மற்றும் மாதிரி சோதனைச் சாவடி வெளியீடு குறித்த விரிவான வழிமுறைகளை வழங்குவதன் மூலம் ஒரு பெரிய மொழி மாதிரியான டைனிஜிபிடி-வி ஐ எவ்வாறு பயன்படுத்துவது என்பதை சுருக்கம் விளக்குகிறது.",
      "இது எடை சரிசெய்தல், பயிற்சி மற்றும் மதிப்பீடு பற்றிய தகவல்களை உள்ளடக்கியது, இது பயனர்கள் மாதிரியைத் தனிப்பயனாக்கவும் மேம்படுத்தவும் அனுமதிக்கிறது.",
      "மூலக் குறியீடு பயனர்கள் அணுகவும் பயன்படுத்தவும் பிஎஸ்டி 3-க்ளாஸ் உரிமத்தின் கீழ் இலவசமாகக் கிடைக்கிறது."
    ],
    "commentSummary": [
      "டைனிஜிபிடி-வி என்பது குறைந்த கணக்கீட்டு சக்தியுடன் திறமையான பயிற்சி மற்றும் அனுமானத்திற்காக வடிவமைக்கப்பட்ட ஒரு மல்டிமோடல் மொழி மாதிரியாகும்.",
      "இது முன் பயிற்சி பெற்ற பார்வை தொகுதிகளை உள்ளடக்கியது மற்றும் பை -2 எனப்படும் சிறிய முதுகெலும்பு மாதிரியைப் பயன்படுத்துகிறது.",
      "வரையறுக்கப்பட்ட நினைவகம் கொண்ட சாதனங்களில் நிலைநிறுத்தவும், உள்ளூர் பயன்பாட்டை ஊக்குவிக்கவும், கிளவுட் அடிப்படையிலான ஏபிஐக்களை சார்ந்திருப்பதைக் குறைக்கவும் இந்த மாதிரி வடிவமைக்கப்பட்டுள்ளது.",
      "யுஃபார்ம்-ஜென் மற்றும் மொபைல்விஎல்எம் போன்ற ஒத்த மாடல்களும் விவாதத்தில் குறிப்பிடப்பட்டுள்ளன.",
      "ஃபி -2 போன்ற மாடல்களில் சாத்தியமான தரவு மாசுபாடு குறித்து கவலைகள் எழுப்பப்பட்டுள்ளன, இது அளவுகோல்களில் அவற்றின் செயல்திறனை பாதிக்கும்."
    ],
    "points": 182,
    "commentCount": 22,
    "retryCount": 0,
    "time": 1704315230
  }
]
