[
  {
    "title": "Blockchain Evolution 2023: Ethereum's Layer-2 Expansion, Zero-Knowledge Cryptography, and Bitcoin's Integration",
    "originLink": "https://www.coindesk.com/tech/2023/11/15/the-protocol-ethereum-layer-2s-keep-coming-as-okx-apes-in/",
    "originBody": "Technology The Protocol: Ethereum Layer-2s Keep Coming as OKX Apes In In this week's edition of The Protocol newsletter, we look at a few growing trends, including blockchain development marked by the expansion of Ethereum's layer-2 networks, the increased use of zero-knowledge cryptography and the Bitcoin blockchain's new support for tokens, smart contracts and file hosting. By Bradley Keoun Nov 15, 2023 at 6:43 p.m. UTC Updated Nov 15, 2023 at 6:52 p.m. UTC (Maksym Ostrozhynskyy/Unsplash) 10 Years of Decentralizing the Future May 29-31, 2024 - Austin, Texas The biggest and most established global hub for everything crypto, blockchain and Web3. Register Now As blockchain developers head into the final stretch of 2023, a few trends stand out: the proliferation of Ethereum layer-2 networks, the ascendancy of zero-knowledge cryptography and the appearance of tokens, smart contracts and now file hosting on the Bitcoin blockchain. Another theme gathering momentum is interoperability – the idea that all of these blockchains and layers might eventually be connected. For today's feature, Sam Kessler examines \"intents,\" a type of blockchain interaction that's rooted in the idea that the broader ecosystem of these increasingly intertwined networks could become more challenging to navigate.Everybody's doing it – launching new layer-2 blockchains atop Ethereum to provide a venue for cheap and easy transactions. This week brought the news (thanks to this scoop from our Margaux Nijkerk) that the crypto exchange Kraken may be considering its own layer-2 network, just months after rival Coinbase launched a layer-2, Base. Details below. Also: Protocol Village: Infura, Zircuit, Rarimo, Agrotoken, Upshot Ordinals inscriptions activity linked to surge in Bitcoin transaction fees. Ethereum's Vitalik Buterin puts \"plasma\" networks back in the mix. You're reading The Protocol, CoinDesk’s weekly newsletter that explores the tech behind crypto, one block at a time. Subscribe here to get it every week. Network news LAYER 2'S EVERYWHERE: In last week's The Protocol, we dedicated a not-inconsiderable quantity of ink to the fast-growing list of new \"layer 2\" blockchains aiming to provide a venue for fast and speedy transactions atop Ethereum. Grab another well, cause there's been plenty more announcements already this week. The most notable was inarguably Tuesday's disclosure by the crypto exchange OKX that it plans to build a layer 2 using Polygon's technology. Wednesday brought the news of Kinto, which has raised $5 million this year to develop a layer-2 network that's fully compliant with anti-money-laundering laws using Optimism's OP Stack, and Redstone, an \"alternative data availability\" chain designed by the Lattice team for OP Stack. There are nagging questions about just who is going to use all these networks, but developers suggest there's still not enough. \"We're going to need a lot of L2s,\" Ryan Wyatt, who was just hired by a unit of the Optimism Foundation as chief growth officer after leaving Polygon Labs several months ago, told CoinDesk TV this week. \"One chain, a mainnet, is not going to do it.\" Even Cardano founder Charles Hoskinson tried to elbow into the mix, posting Sunday on X (formerly Twitter) that \"I'm game if you are\" – attaching a link to CoinDesk's article last week about Kraken's discussions with prospective layer-2 technology partners including Polygon, Matter Labs and Nil Foundation – and tagging Kraken Chairman Jesse Powell. One snarky poster replied, \"If this is how we reaching out, most likely not happening.\" ALSO: Bitcoin researcher Robin Linus has ignited fresh buzz with \"BitStream\" paper on file hosting using the original blockchain, just a month after his \"BitVM\" paper stirred up the community with the prospect of Ethereum-style smart contracts. Plasma blockchain designs, all the rage after they were first invented in 2017, could come back in vogue after Ethereum co-founder Vitalik Buterin wrote in a blog post Tuesday that the category \"opens the door to very large scalability gains.\" Former boxing champ Manny Pacquiao’s foundation will use the Ethereum layer-2 blockchain Shibarium, from the SHIB-token-focused Shiba Inu project, for its operations. National Hockey League (finally) comes around to digital collectibles, using NFT-minting platform Sweet. Standard Chartered bank's investment arm launches tokenization platform. Yuga Labs confirms UVA-A emitting lights were the cause of ApeFest eye issues. Hacker steals $27M in USDT from wallet linked to Binance deployer wallet, which has been inactive since December 2020. El Salvador remains in the red on bitcoin holdings, but losses are narrowing. Protocol Village Highlighting blockchain tech upgrades and developments. 1. Ethereum platform Infura takes step toward decentralization with Microsoft, Tencent. 2. Zircuit, a new EVM-compatible ZK rollup, is announcing its public testnet launch. According to the team: \"Zircuit uses a hybrid approach that combines the latest ZK proofs with optimistic infrastructure. More efficient proof generation results in reduced fees and the development of new compression algorithms increases transaction speeds and saves users gas.. 3. Rarimo, an interoperability protocol for cross-chain identity and asset management, has launched version 2.0 of its Proof-of-Humanity plug-in, a solution that enables Web3 dApps to verify its users are humans instead of bots, according to the team. 4. Agrotoken, the first global tokenization infrastructure for agricultural commodities, has announced its plans to launch on Polkadot, to enable seamless tokenization of agricultural commodities. According to the team: \"Visa-backed Agrotoken is to build a Polkadot parachain that tokenizes soybeans, corn and wheat.\" 5. Upshot, a protocol for decentralized delivery of alpha signals, announced its Machine Intelligence Network, according to the team: \"The network crowdsources financial alpha produced by disparate machine learning models. 'Alpha Miners' contribute insights to the network in the form of proprietary data, predictive model features, or predictions, then are rewarded based on how useful their alpha is (as determined by our new 'Proof of Alpha' scoring mechanism).\" See the entire Protocol Village list from this past week here. Money Center Funraisings Tokenized cash fintech firm Fnality raises $95M led by Goldman and BNP Paribas. (Link) Superstate, a tokenization startup led by Compound founder Robert Leshner, gets $14M investment to bring traditional funds on-chain. (Link) Solana-based stablecoin remittances get boost with CFX Labs' fresh $9.5M fundraise to expand globally. (Link) Blockchain.com closes $110M raise: Bloomberg (Link) Deals and grants Crypto exchange Bithumb plans South Korea IPO in second-half 2025: Report. (Link) Asia fund picks up majority stake in The Block, buys out shares tied to Sam Bankman-Fried loan. (Link) Ethereum scaling platform Polygon Labs has started an $85M grant program to entice developers to build applications in its ecosystem. Data and tokens DYDX token pumps ahead of massive $500M token unlock. (Link) Ethereum fees briefly jumped to $100 after BlackRock’s ETH ETF filing. (Link) DeFi Platform Raft suffers $3.3M exploit, but hacker likely took a loss on the attack. (Link) \"Grayscale discount\" continues to narrow as spot bitcoin, ether ETF euphoria works through markets. (Link) Cardano-based DEX MuesliSwap to open refund site 'soon' as some users voice concerns. (Link) Regulatory, Policy, and Legal Germany's Commerzbank wins crypto custody license. (Link) Singapore's central bank sponsors tokenization pilots alongside financial services heavyweights JPMorgan, UBS, along with blockchain firms including Axelar, Oasis Pro, Provenance Blockchain. (Link) As IMF chief says central bank digital currencies (CBDCs) can replace cash, and Kazakhstan's central bank pilots a digital tenge, Bank of America predicts the U.S. Federal Reserve is unlikely to issue a digital dollar in the near term. (Link) Fake BlackRock XRP ETF filing referred to Delaware Department of Justice. (Link) Bitcoin Transaction Fees Spike to Highest in Six Months Chart of Bitcoin average transaction fees (in U.S. dollars) shows recent spike, hitting $15.865 on Nov. 9. (BitInfoCharts.com) Bitcoin transaction fees surged on Nov. 9 to $15.865, the highest in six months, according to BitInfoCharts, and some blockchain analysts are pointing the finger at a rise in Ordinals inscriptions activity – related to the tokens-on-Bitcoin frenzy that stirred up worries earlier this year over network congestion. Galaxy Research noted in a post on X that \"over the last seven days, inscriptions-related transactions have made up 40% of total Bitcoin transaction count.\" CoinDesk reported that the gains came after Binance listed Ordinals’ ORDI tokens on its platform.\" Blockware Intelligence wrote that \"the low priority-fee rate currently sits around ~69 sat/vByte but it reached as high as 250 sat/vByte last week\" – contributing to a \"boost to miner profits courtesy of higher transaction fees and a higher BTC price.\" According to analysts at Coinbase Institutional, \"Ordinal trading volumes (averaging $10M daily) over the past week have been comparable to NFT trading volumes on Ethereum (averaging $16M daily).\" Calendar Nov. 13-19: Devconnect, Istanbul. Nov. 15-17: North American Blockchain Summit, Fort Worth, Texas. Nov. 28: EOS native consensus upgrade with “instant finality.” Dec. 1-3: Africa Bitcoin Conference, Ghana. Jan. 30: Stellar upgrade for Soroban smart contracts, public network readiness date. Feb. 22-24: Bitcoin++, Buenos Aires. April 2024 (estimate): Next Bitcoin halving. April 8-12: Paris Blockchain Week. May 29-31, 2024: Consensus, Austin Texas July 25-27: Bitcoin 2024, Nashville. Edited by Bradley Keoun. A D V E R T I S E M E N T A D V E R T I S E M E N T DISCLOSURE Please note that our privacy policy, terms of use, cookies, and do not sell my personal information has been updated. The leader in news and information on cryptocurrency, digital assets and the future of money, CoinDesk is a media outlet that strives for the highest journalistic standards and abides by a strict set of editorial policies. CoinDesk is an independent operating subsidiary of Digital Currency Group, which invests in cryptocurrencies and blockchain startups. As part of their compensation, certain CoinDesk employees, including editorial employees, may receive exposure to DCG equity in the form of stock appreciation rights, which vest over a multi-year period. CoinDesk journalists are not allowed to purchase stock outright in DCG. Bradley Keoun Bradley Keoun is the managing editor of CoinDesk's Tech & Protocols team. He owns less than $1,000 each of several cryptocurrencies. Follow @Liqquidity on Twitter Learn more about Consensus 2024, CoinDesk’s longest-running and most influential event that brings together all sides of crypto, blockchain and Web3. Head to consensus.coindesk.com to register and buy your pass now. Read more about The Protocol Newsletter Newsletters Ethereum layer 2 Zero knowledge Bitcoin ordinals Plasma Infura",
    "originSummary": [
      "The blockchain industry is experiencing several developments, such as the expansion of Ethereum's layer-2 networks and the increased use of zero-knowledge cryptography.",
      "Tokens, smart contracts, and file hosting are being integrated into the Bitcoin blockchain.",
      "Interoperability between different blockchains is gaining momentum, with more companies and projects launching their own layer-2 blockchains on Ethereum and a growing need for additional layer-2 solutions. There are also advancements in file hosting using blockchain technology and a renewed interest in plasma blockchain designs."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700143029307
  },
  {
    "title": "SHIB Partners with Manny Pacquiao Foundation to Implement Blockchain for Transparency and Optimization",
    "originLink": "https://www.globenewswire.com/news-release/2023/11/16/2781511/0/en/SHIB-Partners-with-the-Manny-Pacquiao-Foundation-to-Implement-Its-Own-Layer-2-Blockchain.html",
    "originBody": "Accessibility: Skip TopNav SHIB Partners with the Manny Pacquiao Foundation to Implement Its Own Layer 2 Blockchain dehaze search close rightElements.signin.Title RIGHTELEMENTS.REGISTER.TITLE search SHIB Partners with the Manny Pacquiao Foundation to Implement Its Own Layer 2 Blockchain The charitable foundation established by the eight-time WBC champion will use the Shibarium blockchain to optimize fundraising, distribution, and other operations November 15, 2023 22:00 ETSource: SHIB FOLLOW Share LOS ANGELES, Nov. 15, 2023 (GLOBE NEWSWIRE) -- SHIB and its Shiba Inu Ecosystem, an interconnected family of digital assets and solutions built on the Ethereum blockchain that includes popular global cryptocurrency Shiba Inu, today announced that it has partnered with the Manny Pacquiao Foundation to implement SHIB’s Layer 2 blockchain Shibarium into the Foundation’s operations. The Manny Pacquiao Foundation will use Shibarium to better optimize, streamline, and record its activities, including tracking its fundraising and donations, distributing funds, and managing other resources, while externally providing even greater transparency concerning its social good efforts across the globe. Read the full story; The Shib About SHIB SHIB, a world-leading ecosystem of decentralized finance (DeFi) cryptocurrencies has gained popularity among millions of holders worldwide. It has 3.6 million Twitter followers and is frequently ranked as the second-most searched crypto project by Google. Its ecosystem of tokens include $SHIB, $LEASH, and $BONE, plus native SHIBOSHIs NFTs. SHIB.io utilizes the Shib Ecosystem to power quality technologies including SHIB:The Metaverse and Shibarium, the Layer 2 blockchain providing a solid foundation, scalability, security, and innovation for a decentralized world. To learn more about SHIB, please visit the official website: https://shibatoken.com. To learn more about or join Shib visit: https://www.shib.io. About the Manny Pacquiao Foundation The Manny Pacquiao Foundation (MPF) is a California 501 (c)(3) nonprofit. It is the charitable organization of the eight-division World Boxing Champion and former Philippine Senator, Emmanuel (Manny) Pacquiao. Established in 2019, the MPF is committed to fighting for those less fortunate and spreading hope around the world. It represents the embodiment of the people's champion, Manny Pacquiao, who has devoted himself to public service and donated more than one-third of his career earnings to charity. It is his goal to be an instrument of hope and change around the world. The MPF has already reached over one million people in need of help and continues to inspire others by creating a sustainable impact that transcends the world of sport. For more information, please visit pacquiaofoundation.org. Tags Blockchain Blockchain Wire Cryptocurrency Layer 2 SHIB Shivarium Related Links Blockchain Wire Contact Data Contact Company ProfileSHIBWebsite: https://www.shib.io Press Release Actions Print Download PDF Subscribe via RSS Subscribe via ATOM Javascript We use cookies to improve your GlobeNewswire experience. By continuing, you agree to our use of cookies. For more information, please see our Privacy Policy. ACCEPT",
    "originSummary": [
      "The Manny Pacquiao Foundation is partnering with SHIB and its Shiba Inu Ecosystem to incorporate SHIB's Layer 2 blockchain, Shibarium, into its operations.",
      "This partnership aims to enhance fundraising, distribution, and other activities of the foundation, while also increasing transparency.",
      "SHIB is a well-known decentralized finance cryptocurrency ecosystem with millions of supporters, while the Manny Pacquiao Foundation is a non-profit organization founded by Manny Pacquiao, a renowned eight-division World Boxing Champion."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700143029307
  },
  {
    "title": "CELESTIA AIRDROP: Claim $TIA Tokens with Step-by-Step Tutorial",
    "originLink": "https://medium.com/@cryptolisa/celestia-airdrop-tutorial-how-to-claim-tia-airdrop-ef3abafdde81",
    "originBody": "CELESTIA AIRDROP Tutorial: How to claim $TIA Airdrop? CryptoLisa · Follow 2 min read · 9 hours ago -- CELESTIA SECOND AIRDROP? The Celestia Genesis Drop has earmarked 7.4% of the $TIA token supply for the public. Notably, their documentation indicates that 12.6% will be reserved for Future Initiatives, possibly signaling forthcoming airdrops. Learn how you can meet the criteria for a season 2 airdrop. CELESTIA: WHAT IS IT? Built on the Cosmos SDK, Celestia serves as a pioneering modular blockchain network, amplifying verifiability as user numbers grow. Its core objective is to enable easy blockchain launches with minimal setup. Functioning as a public chain, Celestia records transaction history and ensures data accessibility. About First Airdrop The Celestia $TIA airdrop is now available for claiming by eligible addresses, totaling 576,653 that meet the criteria. Qualifying claimants encompass developers, prominent Ethereum rollup users, early adopters, and those who have staked >$75 worth of $ATOM and $OSMO. How to claim your $TIA airdrop, step-by-step Guide: 1. Visit the Celestia website at genesis.celestia.group 2. Verify your eligibility for TIA tokens on the website. 3. Link your wallet to the platform. Note: Manually inspect each of your wallets to guarantee the claiming of all eligible tokens. 4. Upon connecting your wallet, you can proceed to claim your tokens through the platform. Adhere to these steps for a successful claiming process of your tokens from the Celestia airdrop. PRICE PREDICTION The current price speculation for $TIA suggests it is within the private sales round (series B), priced between $2.35 and $7.50 per token throughout 2023. Notably, all Series B transactions are trading at an average premium of 200%, indicating a potential future value of $6 per $TIA token. If this speculation holds true, even a modest airdrop of 50 $TIA tokens could potentially be valued at $300. This highlights the potential value of participating in the airdrop and holding onto the tokens for the future. It’s essential to consider that cryptocurrency prices are highly volatile, and market conditions may change rapidly, so investment decisions should be approached with caution. READ ALSO: LayerZero Airdrop guide. How to claim $ZRO airdrop? In the midst of the crypto frenzy, the anticipation surrounding a potential Layer Zero airdrop is impossible to ignore… www.linkedin.com CELESTIA AIRDROP Guide. How to claim? he Celestia $TIA airdrop is now available for claiming by qualified addresses, and a total of 576,653 addresses meet… www.linkedin.com APTOS AIRDROP GUIDE. How to claim Aptos 2? Rumors are circulating regarding a potential second Aptos airdrop happening in the near future! If you feared you had… www.linkedin.com",
    "originSummary": [
      "The Celestia blockchain network is offering a second airdrop of its $TIA tokens, reserving 7.4% of the tokens for the public.",
      "Celestia's modular network, built on the Cosmos SDK, aims to simplify blockchain launches.",
      "The airdrop guide provides detailed instructions on how to claim the $TIA tokens, with speculation suggesting a potential value of $6 per token."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700143029307
  },
  {
    "title": "Wemade Teases Global Release of MMORPG NIGHT CROWS with Blockchain Elements",
    "originLink": "https://www.globenewswire.com/news-release/2023/11/15/2781340/0/en/Wemade-announces-global-teaser-site-and-pre-registration-date-for-blockbuster-MMORPG-NIGHT-CROWS.html",
    "originBody": "Accessibility: Skip TopNav Wemade announces global teaser site and pre-registration date for blockbuster MMORPG NIGHT CROWS dehaze search close rightElements.signin.Title RIGHTELEMENTS.REGISTER.TITLE search Wemade announces global teaser site and pre-registration date for blockbuster MMORPG NIGHT CROWS Leading Korea-based gaming company Wemade has unveiled the teaser website for the global Web3 version of NIGHT CROWS, the blockbuster MMORPG for PC and mobile developed by game studio MADNGINE using Unreal Engine 5’s groundbreaking features for creating massive open worlds in incredible high-fidelity detail. November 15, 2023 13:00 ETSource: WEMIX FOLLOW Share NEW YORK, USA, Nov. 15, 2023 (GLOBE NEWSWIRE) -- Among the most successful 2023 mobile game launches in Korea; #1 (revenue growth) and #2 ranked mobile game (total revenue) Global version combines blockchain elements like NFTs and a multi-utility token economy with the game’s breathtaking visuals and immersive gameplay Set to launch globally on WEMIX PLAY in Q1 2024 with pre-registration starting on January 11 Leading Korea-based gaming company Wemade has unveiled the teaser website for the global Web3 version of NIGHT CROWS, the blockbuster MMORPG for PC and mobile developed by game studio MADNGINE using Unreal Engine 5’s groundbreaking features for creating massive open worlds in incredible high-fidelity detail. Set in 13th-Century medieval Europe, NIGHT CROWS is a feat of expansive world-building and story-telling that features breathtaking visuals, immersive gameplay and massive-scale battle content. NIGHT CROWS is one of the most successful mobile game launches in Korea in 2023, which saw more than a million sign-ups during the pre-registration period. Following its April 27 release, NIGHT CROWS has risen rapidly in popularity to become the #1 mobile game in Korea by revenue growth, and the second highest in terms of total revenue according to SensorTower data (for period of Jan - Sep 2023). Blockchain elements create value and enhance gaming experience The global Web3 version will combine blockchain elements including advanced tokenomics, NFT minting and trading, and omnichain support with the game’s impressive gameplay features for an even more immersive gaming experience. Introduced for the first time in NIGHT CROWS, the multi-utility token economy will enable players to create or acquire “values'' or materials during gameplay that can be used to mint 7 different tokens. The NFT minting of characters is another new feature which enables players to turn their characters into assets utilizing NFTs. Players can create additional value by trading tokens and character NFTs across multiple blockchain networks connected through the WEMIX3.0 mainnet, extending their value beyond the game. NIGHT CROWS will offer omnichain support for limitless cross-chain transactions on an initial number of six blockchains including Avalanche, BNB Chain, Ethereum, Polygon and the Kroma Layer 2 blockchain, in addition to WEMIX3.0. Q1 2024 release schedule The global version of NIGHT CROWS is set to make its debut on the top global blockchain gaming platform, WEMIX PLAY, in Q1 2024, with pre-registration scheduled to begin on January 11. More details can be found on: NIGHT CROWS global version teaser website - https://nightcrows.com/teaser Official NIGHT CROWS website - https://nightcrows.co.kr/ NIGHT CROWS tokenomics documentation - https://bit.ly/3SCRnxi About WEMADE A renowned industry leader in game development with over 20 years of experience, Korea-based WEMADE is leading a once-in-a-generation shift as the gaming industry pivots to blockchain technology. Through its WEMIX subsidiary, WEMADE aims to accelerate the mass adoption of blockchain technology by building an experience-based, platform-driven, and service-oriented mega-ecosystem to offer a wide spectrum of intuitive, convenient, and easy-to-use Web3 services. Visit www.wemix.com/communication for more information. Tags Blockchain Blockchain Wire Cryptocurrency DeFi GameFi NFTs Contact Data Contact Company ProfileWEMIXWebsite: https://www.wemix.com/ Press Release Actions Print Download PDF Subscribe via RSS Subscribe via ATOM Javascript We use cookies to improve your GlobeNewswire experience. By continuing, you agree to our use of cookies. For more information, please see our Privacy Policy. ACCEPT",
    "originSummary": [
      "Korean gaming company Wemade has announced the launch of a global version of the MMORPG game NIGHT CROWS on the WEMIX PLAY platform.",
      "Developed by MADNGINE using Unreal Engine 5, NIGHT CROWS features blockchain elements such as NFTs and a multi-utility token economy.",
      "The highly successful game will be released globally in Q1 2024, with pre-registration starting on January 11, offering cross-chain support and aiming to provide an immersive gaming experience."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700143029307
  }
]
