[
  {
    "title": "'더블 일레븐' 쇼핑 페스티벌: 이질적인 핀둬둬가 단체 구매 모델과 억 단위 보조금 전략을 사용하여 소비자를 유치하는 방법은?",
    "originLink": "https://www.sohu.com/a/735017782_121255906",
    "originBody": "",
    "originSummary": [
      "'더블 일레븐' 쇼핑 페스티벌은 알리바바의 독주에서 벗어나 티몰, 징둥, 그리고 현재 핀둬둬의 경쟁으로 변화하고 있습니다.",
      "핀둬둬가 중국 소비자를 끌어들이는 데 성공한 이유는 '단체 구매' 모델과 10억 달러 규모의 보조금 정책을 통해 경쟁력 있는 가격 전략을 펼쳤기 때문입니다.",
      "이 플랫폼은 이제 비표준 농산물을 위한 중요한 판매처로 자리 잡았으며, 주로 국내 전통 브랜드에 상당한 지원을 제공하고 있습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "\"双十一\"购物节已从阿里巴巴主导转变为包括天猫，京东和现在的拼多多的竞争。",
      "拼多多成功吸引中国消费者的原因是其竞争性的定价策略，通过\"团购\"模式和十亿美元的补贴政策实现。",
      "这个平台现在是非标准农产品的重要出口，为许多传统的，主要是国内的品牌提供了大量的支持。"
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699535903855
  },
  {
    "title": "핀둬둬 왕지안 수석 부사장: 크로스보더 이커머스는 1분기 중국 대외 무역 발전의 새로운 하이라이트가 되었으며, 중소기업이 글로벌 시장과 직접 연결될 수 있도록 지원했습니다.",
    "originLink": "http://cn.chinadaily.com.cn/a/202311/09/WS654ca6c6a310d5acd876e270.html",
    "originBody": "",
    "originSummary": [
      "지난 11월 9일, 핀둬둬의 왕지안 수석 부사장은 신흥 이커머스 포럼에서 중국 관세총국의 데이터에 따르면 중국의 국경 간 이커머스 수출입이 1분기 동안 14.4% 성장하여 총 1조 7,000억 위안에 달했다고 발표했습니다.",
      "이러한 성장으로 인해 크로스보더 이커머스는 중국 대외 무역 발전의 새로운 성장 포인트가 되었습니다. 파운드 랜드는 2022 년 9 월에 크로스보더 비즈니스를 시작했으며 중소기업의 비용과 장벽을 성공적으로 줄였습니다. 지난 한 해 동안 북미, 호주, 유럽, 아시아 40여 개국에 제품을 소개했습니다.",
      "지안 왕은 또한 중국 제조업체의 글로벌 시장 진출을 돕기 위한 핀둬둬의 노력에 대해서도 언급했습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "拼多多高级副总裁王健在11月9日的新电商新发展论坛上发言并指出，根据中国海关总署的数据，今年前三个季度，中国的跨境电商进出口增长了14.4%，总额达到1.7万亿元，因此跨境电商已成为中国外贸发展的新增长点。",
      "拼多多在2022年9月启动了其跨境业务，成功为中小企业降低了成本和壁垒。过去的一年里，产品已经入驻北美，澳大利亚，欧洲和亚洲的40多个国家。",
      "王健还表示，拼多多致力于帮助中国的制造商进军全球市场。"
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699535903855
  },
  {
    "title": "\"파운드 랜드 공동 CEO 자오 지아젠: 고품질 성장과 더 나은 소비자 서비스가 우리의 최우선 과제입니다.\"",
    "originLink": "https://interface.sina.cn/pc_to_wap.d.html?ref=https%3A%2F%2Ffinance.sina.com.cn%2Fchanjing%2Fgsnews%2F2023-11-09%2Fdoc-imztyyas4502290.shtml",
    "originBody": "",
    "originSummary": [
      "2023년 11월 8일부터 10일까지 열린 세계 인터넷 컨퍼런스 기조연설에서 파운드 랜드의 공동 CEO인 자오 지아젠은 소비자에게 더 나은 서비스를 제공해야 할 필요성을 강조했습니다.",
      "자오 지아젠은 핀둬둬가 8년 전 농산물 소매 플랫폼으로 시작하여 브랜드 인지도와 품질 관리 등 다양한 도전에 직면하게 된 과정을 자세히 설명하고, '농업 클라우드 핀둬둬' 모델, '10억 농업 연구' 프로그램, 브랜드 농산물 지원 등 핀둬둬의 솔루션에 대해 자세히 설명했습니다. 프로그램, 브랜드 농산물 지원 등 핀둬둬의 솔루션을 자세히 소개했습니다.",
      "그는 인터넷 개발의 새로운 단계에서 파운드 랜드의 우선 순위는 플랫폼 거버넌스, 판매자 생태, 고품질 공급망, 고품질 개발을 위한 고품질 소비라고 강조했습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "拼多多联合首席执行官赵佳臻在2023年11月8日至10日在乌镇举行的世界互联网大会上的主题演讲中表示，为消费者提供更好的服务是必要的需求。",
      "他强调了拼多多作为一个八年前的农业零售平台，如何面临品牌认知和质量控制等各种挑战，以及拼多多的解决方案，如“农业云拼多多”模型、“十亿农业研究”计划，支持品牌农产品。",
      "在互联网发展的新阶段，他强调拼多多的优先事宜是平台治理、商户生态、高质量供应链和高质量消费的高质量发展。"
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699535903855
  },
  {
    "title": "세계 인터넷 컨퍼런스: 디지털 거버넌스가 어떻게 젊은이들을 위한 일자리를 창출할 수 있는지에 대한 핀둬둬 부사장의 발표",
    "originLink": "https://www.sohu.com/a/735022319_255783",
    "originBody": "",
    "originSummary": [
      "2023년 11월 9일 세계 인터넷 컨퍼런스 우전 서밋에서 핀둬둬의 수석 부사장인 주정은 인터넷과 디지털 기술의 급속한 발전이 이커머스 산업과 디지털 거버넌스의 역할에 큰 영향을 미쳤다고 말했습니다.",
      "중국 최대 소셜 이커머스 플랫폼인 핀둬둬는 디지털 거버넌스에서 괄목할 만한 성공을 거두었습니다. 주정은 핀둬둬의 성공 요인으로 혁신적인 농업 소매 모델, 농업 기술 발전, 일자리 창출, 디지털 경제와 전통 경제의 통합 추진을 꼽았습니다.",
      "그는 또한 디지털 경제에서 국제 협력을 촉진하기 위한 파운드 랜드의 노력을 강조했습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "在2023年世界互联网大会乌镇峰会上，拼多多高级副总裁朱铮表示，互联网和数字技术的快速发展对电子商务行业和数字治理的作用产生了巨大影响。",
      "作为中国最大的社交电商平台，拼多多在数字治理方面取得了显著成功。朱铮提到他们创新的农业零售模式、推进农业技术进步、创造就业机会和推动数字经济与传统经济的融合都是他们成功的因素。",
      "他还强调了拼多多在推动数字经济的国际合作方面做出的努力。"
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699535903855
  },
  {
    "title": "글로벌 인터넷 컨퍼런스 우전 서밋: 디지털 시대의 미래 비전에 집중하고 중국 인터넷 발전 보고서 2023 발표",
    "originLink": "https://news.voc.com.cn/article/202311/20231109075253480011.html",
    "originBody": "",
    "originSummary": [
      "세계 인터넷 컨퍼런스 우전 서밋은 2023년 11월 8일에 공식 출범하여 10주년을 맞이했습니다.",
      "이번 서밋에서 알리바바, 핀둬둬 등 거대 인터넷 기업들은 디지털 시대에 대한 미래 비전과 목표를 공개했습니다.",
      "또한 정상회의에서는 2023 세계 인터넷 발전 보고서와 2023 중국 인터넷 발전 보고서를 발표하고 베이징을 혁신과 디지털 경제 발전 측면에서 중국 내 최고 순위 도시로 선정했습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "2023年的世界互联网大会乌镇峰会于11月8日正式开幕，标志着大会的第十年。",
      "此次峰会上，包括阿里巴巴和拼多多在内的互联网巨头公布了他们在数字时代的未来愿景和目标。",
      "峰会还发布了2023年世界互联网发展报告和2023年中国互联网发展报告，并将北京在创新和数字经济发展方面排名中国第一。"
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699535903855
  },
  {
    "title": "2023 세계 인터넷 컨퍼런스 우전 서밋, 저장성에서 개막, 기업가들이 인터넷 발전 논의 및 청서 발간",
    "originLink": "https://m.yicai.com/news/101899659.html",
    "originBody": "",
    "originSummary": [
      "저장성에서 열린 세계 인터넷 컨퍼런스 2023 및 우전 서밋은 48개국, 580개 이상의 기업에서 온-오프라인으로 많은 참가자가 모인 가운데 개최되었습니다.",
      "올해 컨퍼런스의 주제는 \"포용적이고 공평하며 탄력적인 디지털 세상 구축 - 함께 사이버 공간에서 공유된 미래 커뮤니티를 구축하자\"였습니다. 컨퍼런스 기간 동안 알리바바, 레노버, 핀둬둬 등 중국 기업 대표들이 인터넷 발전에 대한 각자의 관점을 설명하는 연설을 진행했습니다.",
      "또한, 행사 기간 동안 '중국 인터넷 발전 보고서 2023'과 '세계 인터넷 발전 보고서 2023'이라는 청사진이 발표되었습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "2023年世界互联网大会和乌镇峰会在浙江省举行，吸引了来自48个国家和580多家公司的线上线下参与者。",
      "今年的主题是“建设包容、公平、韧性的数字世界 - 共同构建网络空间命运共同体”。在峰会期间，来自阿里巴巴、联想和拼多多等中国公司的代表发表了演讲，讨论了他们对互联网发展的看法。",
      "同时，《2023年中国互联网发展报告》和《2023年世界互联网发展报告》蓝皮书在活动期间发布。"
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699535903855
  },
  {
    "title": "유명 온라인 리테일러들은 '더블 11'에 대한 소비자들의 열기가 식으면서 판매 전략을 조정하고 더 낮은 가격을 제시합니다.",
    "originLink": "https://www.sohu.com/a/734945751_115958",
    "originBody": "",
    "originSummary": [
      "중국의 연례 쇼핑 축제인 광군제에 대한 소비자의 관심은 2022년에 감소했습니다.",
      "그 결과 타오바오, 징동, 셰이크올로지, 핀둬둬 등 주요 온라인 리테일러들은 더 낮은 가격과 더 나은 판매 경험을 제공하기 위해 판매 전략을 간소화하고 있습니다.",
      "파운드 랜드는 또한 매일 저렴한 가격과 강력한 할인을 약속합니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "2022年，中国一年一度的“双十一”购物节受到消费者兴趣下降的影响。",
      "作为回应，主要的在线零售商如淘宝，京东，抖音和拼多多正在简化他们的销售策略，提供更低的价格，更好的销售体验。",
      "拼多多还承诺提供每日低价和强大的折扣。"
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699535903855
  },
  {
    "title": "역대 최대 규모의 박람회, 티몰 및 징동 크로스보더 이커머스 데이터 공개, 해외 신상품 거래 2배 증가",
    "originLink": "https://www.sohu.com/a/734908762_120491808",
    "originBody": "",
    "originSummary": [
      "제6회 중국 국제 수입 박람회(CIIE)는 154개국에서 3,400개 이상의 전시업체와 게스트가 참가하여 그 어느 때보다 큰 규모로 개최됩니다.",
      "이 행사를 통해 알리바바와 징둥은 처음으로 크로스보더 이커머스 데이터를 공개했으며, 새로운 해외 상품 거래가 두 배로 증가했습니다.",
      "CIIE는 중국 시장 진출의 중요한 플랫폼으로 글로벌 브랜드들에게 점점 더 인기를 얻고 있습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "第六届中国国际进口博览会(CIIE)规模比以往任何一次都大，吸引了来自154个国家的3400多家展商和客人。",
      "此次活动中阿里巴巴和京东公布了首批跨境电商数据，几种新的海外产品的交易量翻倍。",
      "国际品牌似乎越来越趋向通过CIIE进入中国市场。"
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699535903855
  },
  {
    "title": "더블 11의 변화: AI 기반 마케팅 전략, 이커머스 플랫폼의 부상, 브랜드가 재구매율과 정밀 마케팅에 집중하는 모습",
    "originLink": "https://www.sohu.com/a/734876676_116132",
    "originBody": "",
    "originSummary": [
      "올해로 15회째를 맞이한 더블 11 행사는 2009년 처음 시작했을 때와 비교해 큰 변화를 겪었으며, 2022년 매출은 111조 5,400억 위안에 달할 것으로 예상됩니다.",
      "주요 변화로는 새로운 저비용 AI 기반 마케팅 전략, 새로운 이커머스 플랫폼의 부상, 총 상품 수량에서 고객 재구매율 및 정밀 마케팅 운영으로 브랜드 초점이 전환되는 것 등이 있습니다.",
      "브랜드 프로모터와 이커머스 플랫폼은 운영 최적화 및 콘텐츠 제작을 위해 AI 도구를 점점 더 많이 사용하고 있으며, 브랜드는 판매 캠페인을 넘어 장기적인 마케팅 전략을 모색하고 있습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "第15届双十一活动与2009年的初启相比，发展明显，至2022年销售额已达111.54万亿元。关键改变包括新的、价格更低的、AI推动的营销策略，新兴电商平台的崛起，以及品牌从总商品量转向客户复购率和精准营销运营的关注。",
      "品牌营销商和电商平台越来越多地使用AI工具进行运营优化和内容创造。",
      "品牌还追求在销售事件之外的长期营销策略。"
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699535903855
  },
  {
    "title": "우전에서 열린 세계 인터넷 컨퍼런스, AI 발전 전망에 집중: 많은 대표 기업 수장들이 미래 청사진 논의",
    "originLink": "https://www.stcn.com/article/detail/1030617.html",
    "originBody": "",
    "originSummary": [],
    "commentBody": "",
    "commentSummary": [
      "在中国乌镇举行的2023年世界互联网大会上，人们关注了AI发展的机会、挑战与未来计划。讨论显示，AI对社会和互联网行业的影响力正在增强。",
      "中国在5G领域也是一个重要的玩家，具备319万个5G基站和7.37亿5G用户。",
      "阿里巴巴的CEO吴永明预测 AI将在未来理解人类的语言和逻辑，直接满足客户需求，中小企业有望从中获益巨大。"
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699535903855
  }
]
