[
  {
    "title": "Apple Vision Pro: An In-depth Look at the Highly Anticipated Headset's Features and Interface",
    "originLink": "https://mashable.com/article/apple-vision-pro-onboarding-videos",
    "originBody": "",
    "originSummary": [
      "Apple's Vision Pro headset is scheduled to release in early 2024, and a software beta is currently active.",
      "Leaked onboarding videos offer a glimpse into the device's functionality, showcasing features like eye tracking, hand inputs, and creating a digital avatar.",
      "The Vision Pro is anticipated to be quite pricey, with a cost of $3,499."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700143108475
  },
  {
    "title": "The Apple Vision Pro's EyeSight Feature Goes Beyond Just Displaying Your Eyes",
    "originLink": "https://www.inverse.com/tech/video-shows-how-essential-the-vision-pros-goofy-eyesight-display-is",
    "originBody": "",
    "originSummary": [
      "Apple's upcoming VR headset, the Apple Vision Pro, includes the EyeSight feature that broadcasts your eyes on the front of the device.",
      "The front-facing cameras are essential for setting up your virtual avatar and were demonstrated in a recent demo of the Persona Enrollment feature.",
      "Rumors suggest that Apple may release a cheaper version of the Vision Pro without the EyeSight capabilities, potentially using an iPhone chip instead, but the setup process for this version is unknown."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700143108475
  },
  {
    "title": "Apple Vision Pro onboarding videos offer easy setup and customization",
    "originLink": "https://macdailynews.com/2023/11/15/check-out-these-apple-vision-pro-onboarding-videos/",
    "originBody": "",
    "originSummary": [
      "User @M1Astra has posted multiple onboarding videos for Apple Vision Pro, a feature in visionOS beta 6.",
      "The videos guide users on how to set up hands, align eyes, and pair prescription lenses.",
      "Higher quality videos showcasing different environments are also accessible."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700143108475
  },
  {
    "title": "Telegram Founder Teases Translucent App for Apple Vision Pro",
    "originLink": "https://www.moneycontrol.com/news/technology/telegram-founder-teases-app-with-translucent-design-for-apple-vision-pro-11755721.html",
    "originBody": "",
    "originSummary": [
      "Telegram founder Pavel Durov has announced a new app designed for Apple's Vision Pro headset.",
      "The app will have a translucent interface, allowing users to access chats and dictate messages.",
      "It will support various media formats and include a section for viewing stories.",
      "The app is expected to be compatible with Apple's upcoming Reality Pro headset, set to launch next year."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700143108475
  },
  {
    "title": "VisionDevCamp to Accelerate Development of Apple Vision Pro Apps in 2024",
    "originLink": "https://www.uploadvr.com/visiondevcamp-vision-pro-developer-event-2024/",
    "originBody": "",
    "originSummary": [
      "VisionDevCamp, organized by AR developer Raven Zachary, aims to jumpstart spatial computing apps for the upcoming Apple Vision Pro headset.",
      "The camp will be held in San Francisco after the US launch of the Vision Pro in early 2024.",
      "Developers are encouraged to build native visionOS, Unity PolySpatial, and web applications for the Vision Pro and visionOS."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700143108475
  },
  {
    "title": "Apple Enables Spatial Video Recording on iPhone 15 Pro for Interaction with Vision Pro Headset",
    "originLink": "https://www.tomsguide.com/how-to/record-spatial-video-on-iphone",
    "originBody": "",
    "originSummary": [
      "Apple's new iPhone 15 Pro now supports spatial video recording, which is compatible with their upcoming Vision Pro headset.",
      "The guide explains how to enable and capture spatial video on the iPhone 15 Pro, including the necessary settings and orientation for recording.",
      "However, it's important to note that spatial videos can only be fully experienced with the Vision Pro headset and have limited editing options on the iPhone itself."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700143108475
  },
  {
    "title": "Apple's Vision Pro Headset to Use External Display Beyond Eye Visualization",
    "originLink": "https://www.roadtovr.com/apple-vision-pro-external-display-eyesight-face-scanning-process/",
    "originBody": "",
    "originSummary": [
      "Apple's Vision Pro headset will include an external display called EyeSight that shows the wearer's eyes.",
      "The display will have multiple uses, like displaying incoming calls or low battery notifications.",
      "It will also be used during avatar creation, where users can scan their faces using the headset's cameras."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700143108475
  },
  {
    "title": "Leaked Apple Videos Provide Sneak Peek of $3500 Vision Pro VR and AR Headset",
    "originLink": "https://themessenger.com/tech/apple-vision-pro-visionos-beta-6-videos-virtual-reality-vr-ar-headset",
    "originBody": "",
    "originSummary": [
      "Apple has launched the sixth beta version of its Vision Pro VR and AR headset, which is expected to be released to the public in early 2022.",
      "Leaked videos demonstrate how to set up and navigate the headset, showcasing features like eye movement and hand gesture recognition.",
      "Reports suggest that Apple is also exploring health-related applications for the mixed reality headset."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700143108475
  }
]
