[
  {
    "id": 37199495,
    "title": "Kris Nóva hayatını kaybetti",
    "originLink": "https://nivenly.org/blog/2023/08/19/an-announcement-regarding-kris-n%C3%B3va/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37199495",
    "commentBody": "",
    "originSummary": [
      "Nivenly'nin etkili lideri ve akıl hocası Kris Nóva, ardında profesyonellik ve vizyon mirası bırakarak üzücü bir şekilde aramızdan ayrıldı.",
      "Nivenly topluluğu Kris Nóva'nın kaybının yasını tutuyor ve gelecek için atılacak adımları değerlendiriyor.",
      "Nivenly topluluğunun Kris Nóva'nın rehberliği ve uzmanlığı olmadan ileriye dönük olarak nasıl bir yol izleyeceği şu an için belirsizdir."
    ],
    "commentSummary": [
      "Açık kaynak endüstrisinin önemli isimlerinden Kris Nóva, geçirdiği bir tırmanış kazası nedeniyle ne yazık ki hayatını kaybetti.",
      "Teknoloji sektörüne yaptığı katkılar ve ilham verici çalışmalarıyla tanınıyor.",
      "Ölümünü çevreleyen söylem, dağcılık gibi faaliyetlerin içerdiği riskler ve bunların ortaya çıkardığı toplumsal zorluklar üzerine tartışmalar içermektedir.",
      "Otizmli bireylerin sosyal becerileri ve açık kapsayıcılık yönergelerinin önemi üzerine bir tartışma var.",
      "Yazar, otizmli bireylerin sosyal becerileri öğrenemeyeceği inancına karşı çıkmakta ve sosyal etkileşim için çaba gösterilmesi ve farklı bir bakış açısı geliştirilmesi gerektiğini vurgulamaktadır.",
      "Yazar ayrıca web sitesinde belirli bir hikayeye yeterince ilgi gösterilmemesini de sorguluyor."
    ],
    "points": 803,
    "commentCount": 113,
    "retryCount": 0,
    "time": 1692541831
  },
  {
    "id": 37198954,
    "title": "Uzaktaki nesnelerin büyütülmüş görünmesi gerekmez mi?",
    "originLink": "https://astronomy.stackexchange.com/questions/54499/shouldnt-very-very-distant-objects-appear-magnified",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37198954",
    "commentBody": "",
    "originSummary": [
      "Astronomi Yığın Değişimi, gökbilimcilerin ve astrofizikçilerin soru-cevap yapabilecekleri bir platformdur.",
      "Bir kullanıcı, çok uzaktaki nesnelerin neden büyütülmüş görünmediği hakkında bir soru soruyor.",
      "Başka bir kullanıcı, uzayın genişlemesinin büyütmeye neden olduğunu, ancak bunun belirli bir mesafede fark edilebilir hale geldiğini açıklıyor."
    ],
    "commentSummary": [
      "Genişleyen evren ve sınırlı ışık hızı, uzaktaki nesnelerin büyütülmüş görünmesine katkıda bulunur.",
      "Görelilik ve kuantum mekaniği gibi fizik kavramları bu olgunun anlaşılmasında rol oynamaktadır.",
      "Işık hızı, nedenselliğin ya da uzayda seyahat eden herhangi bir şeyin maksimum hızı olarak tartışılmaktadır.",
      "Kozmik Mikrodalga Arka Planı ışığın sınırını işaret eder ve ötesindeki nesnelerin henüz görünür olmadığını gösterir.",
      "Tartışmada ayrıca evrenin genişlediğine dair kanıtlara ve uzaktaki nesneleri gözlemlemenin sınırlarına da değiniliyor."
    ],
    "points": 515,
    "commentCount": 135,
    "retryCount": 0,
    "time": 1692538191
  },
  {
    "id": 37200615,
    "title": "Demek fizik öğrenmek istiyorsunuz (2021)",
    "originLink": "https://www.susanrigetti.com/physics",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37200615",
    "commentBody": "",
    "originSummary": [
      "Susan Rigetti, okuyucuların geri bildirimlerini dikkate alarak ve iyileştirmeler yaparak, kendi kendine fizik öğrenme kılavuzunun ikinci baskısını yayınladı.",
      "Kılavuz, kalkülüs ile başlayıp uzmanlık alanlarına doğru ilerleyerek fizikte çeşitli konularda çalışılmasını önermektedir.",
      "Ayrıca, lisans ve lisansüstü fizik ders kitaplarının yanı sıra genel görelilik ve kuantum alan teorisi gibi ileri düzey konular da dahil olmak üzere daha geniş perspektifler için popüler fizik kitapları önermektedir."
    ],
    "commentSummary": [
      "Tartışmalar, süreklilik mekaniğinin ihmal edilmesi ve hidrolik ve kozmolojik modeller gibi fenomenlerin anlaşılmasının önemi de dahil olmak üzere fizik eğitimindeki çeşitli konuları kapsamaktadır.",
      "Kuantum dışı fizik kitapları için tavsiyeler ve fizik ile mühendislik arasındaki sınırlar üzerine tartışmalar yer almaktadır.",
      "Matematiğin, özellikle de kalkülüsün fizik öğrenimindeki önemi ve kendi kendine çalışmanın örgün eğitime karşı etkinliği tartışılmaktadır."
    ],
    "points": 421,
    "commentCount": 144,
    "retryCount": 0,
    "time": 1692548893
  },
  {
    "id": 37202727,
    "title": "Jazz² Diriliş: Açık kaynaklı Jazz Jackrabbit 2 yeniden uygulaması",
    "originLink": "http://deat.tk/jazz2/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37202727",
    "commentBody": "",
    "originSummary": [
      "Jazz² Resurrection, Jazz Jackrabbit 2 oyununun açık kaynaklı bir yeniden uygulamasıdır ve oyuncuların klasik oyunu modern platformlarda deneyimlemelerine olanak tanır.",
      "Oyun Windows, Linux, macOS, Android, Nintendo Switch ve web tarayıcıları dahil olmak üzere çeşitli platformlarda indirilebilir ve oynanabilir.",
      "Proje, GNU Genel Kamu Lisansı v3.0 altında lisanslanmıştır ve çok yönlü ve özelleştirilebilir bir oyun deneyimi sağlayan değiştirilmiş nCine oyun motorunu kullanmaktadır."
    ],
    "commentSummary": [
      "Kullanıcılar Jazz Jackrabbit 2 ve açık kaynak kodlu yeniden uygulaması hakkında bir tartışmaya girerek oyunu oynama deneyimlerini ve anılarını paylaşıyor.",
      "Katılımcılar tarafından benzer platform oyunları için tavsiyelerde bulunulmakta ve benzer retro oyunları keşfetmeye olan ilgileri gösterilmektedir.",
      "Sohbet, oyun geliştirmeyi, özellikle de çok oyunculu desteği uygulamanın zorluklarını tartışmak için kapsamını genişletiyor ve abandonware kavramına ve oyunun çeşitli platformlarda kullanılabilirliğine değiniyor."
    ],
    "points": 376,
    "commentCount": 78,
    "retryCount": 0,
    "time": 1692563879
  },
  {
    "id": 37205731,
    "title": "Hepimiz Sadece Geçici Olarak Yetenekliyiz",
    "originLink": "https://blog.jim-nielsen.com/2023/temporarily-abled/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37205731",
    "commentBody": "",
    "originSummary": [
      "Yazar, tatil sırasında dizini incitir ve fiziksel yeteneğin geçici doğası üzerine düşünür.",
      "İyileşme sürecinde kendilerine yardımcı olan erişilebilirlik yardımları için minnettarlıklarını ifade etmektedirler.",
      "Yazar, iyileşmek için gerekli izni almasına izin veren bir işi olduğu için ayrıcalıklı olduğunu kabul ediyor."
    ],
    "commentSummary": [
      "Makale, Starting Strength gibi kuvvet antrenmanı programlarının faydalarını ve potansiyel risklerini araştırıyor.",
      "Yoğun kuvvet antrenmanlarında kişinin vücudunu dinlemesinin, bireysel hedefler belirlemesinin ve uzun vadeli sağlık ve sakatlıkların önlenmesine öncelik vermesinin önemini vurgulamaktadır.",
      "Sohbet, powerlifting ve vücut geliştirmede sakatlanma riski, serbest ağırlıklara karşı makine kullanımı ve doğru form ve iyi koçluğun önemi gibi konuları kapsıyor."
    ],
    "points": 282,
    "commentCount": 174,
    "retryCount": 0,
    "time": 1692594963
  },
  {
    "id": 37197903,
    "title": "Elektrik Haritaları",
    "originLink": "https://app.electricitymaps.com",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37197903",
    "commentBody": "",
    "originSummary": [
      "Liste, ülkeleri ve bölgeleri elektrik tüketimlerinin karbon yoğunluğuna göre sıralayarak enerji kullanımlarının çevresel etkisini göstermektedir.",
      "Sıralama için kullanılan veriler, elektriğin iklim üzerindeki etkisini görselleştiren açık kaynaklı bir platform olan Electricity Maps'ten alınmıştır.",
      "Uygulama sadece bilgi sağlamakla kalmıyor, aynı zamanda kullanıcıların kendi bölgelerini veya ülkelerini listeye ekleyerek katkıda bulunmalarına da olanak tanıyor. Ayrıca, geçmiş verileri sunmakta ve kullanıcıların farklı zaman dilimlerindeki karbon yoğunluğu seviyelerini görüntülemelerine olanak sağlamaktadır."
    ],
    "commentSummary": [
      "Elektrik kullanımı, hava durumu, uçuş ve uydu takibi, demiryolları, ışık kirliliği ve doğal afetler hakkında canlı veri sağlayan çeşitli web siteleri mevcuttur.",
      "Bu web sitelerinde kullanılan verilerin ve kaynakların doğruluğu önemli bir tartışma konusudur.",
      "Almanya'nın yenilenebilir enerjiye geçişi, yenilenebilir enerjinin ölçeklendirilmesindeki zorluklar ve sınırlamalar, kömüre ve ithal elektriğe bağımlılık ve beklendiği kadar başarılı olmadığı algısı ile vurgulanmaktadır."
    ],
    "points": 224,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1692528523
  },
  {
    "id": 37205053,
    "title": "FreeBSD, SYSINT'lerde bubblesort'u mergesort ile değiştirir",
    "originLink": "https://twitter.com/cperciva/status/1693127769901969772",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37205053",
    "commentBody": "",
    "originSummary": [
      "FreeBSD (HEAD), SYSINIT'lerinde bubblesort algoritmasının yerini almak üzere mergesort algoritmasını uygulamaya koymuştur.",
      "Bu değişiklik hızda kayda değer bir iyileşme sağladı.",
      "Mergesort algoritmasının benimsenmesi, FreeBSD'nin sistemlerinde performans ve verimliliği artırma konusundaki kararlılığını göstermektedir."
    ],
    "commentSummary": [
      "FreeBSD, sanal makineler için çekirdek önyükleme hızını artırmak amacıyla bubblesort algoritmasını mergesort ile değiştirmiştir.",
      "Bir geliştirici, bubblesort'u mergesort ile değiştirerek FreeBSD'nin açılış süresinde 100 kat hızlanma elde etti.",
      "Bazıları bubblesort ile orijinal uygulamanın yeterince iyi olduğunu savunurken, diğerleri daha iyi performans için ekleme sıralamasının kullanılmasını önermektedir."
    ],
    "points": 223,
    "commentCount": 145,
    "retryCount": 0,
    "time": 1692587360
  },
  {
    "id": 37197986,
    "title": "Bir tanrıya inanmadan, ama asla bir şeytana inanmadan",
    "originLink": "https://www.robkhenderson.com/p/without-belief-in-a-god-but-never",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37197986",
    "commentBody": "",
    "originSummary": [
      "Makale, Eric Hoffer'ın \"Gerçek İnanan\" adlı kitabını ve bu kitabın kitlesel hareketlerin ardındaki motivasyonları anlamadaki önemini incelemektedir.",
      "Hoffer, hayal kırıklığının, üyeleri arasındaki bu hayal kırıklığını kasıtlı olarak kullanan kitle hareketlerinin yönlendirilmesinde çok önemli bir rol oynadığını savunmaktadır.",
      "Makale, kutuplaşmış siyasetin ve eşitlik arayışının hayal kırıklığına ve toplumsal hareketlerin ortaya çıkmasına nasıl katkıda bulunduğunu vurgulamaktadır.",
      "Hoffer ayrıca kitlesel hareketlerin tatminsiz bireylere bir amaç ve kimlik duygusu sunduğunu öne sürmektedir.",
      "Makalede ayrıca Hoffer'ın nefretin kitle hareketlerinde genellikle birleştirici bir güç olarak kullanıldığına dair gözleminden bahsedilmektedir.",
      "Genel olarak makale, kitlesel hareketlerin tehlikelerinin ve bireysel hayal kırıklıklarını manipüle etme ve bunlardan faydalanma kabiliyetlerinin altını çiziyor."
    ],
    "commentSummary": [
      "Tartışma, kitle hareketlerinde net hedeflerin ve düşmanların varlığının etkisini incelemektedir.",
      "Katılımcılar, sosyal ağlar ve medyanın neden olduğu kutuplaşma ile ideoloji ve dinin etkisini tartışıyor.",
      "Şiddet, eğitim ve inanç sistemleri arasındaki bağlantı, eğitim ve endoktrinasyon arasındaki ayrımla birlikte incelenmektedir."
    ],
    "points": 217,
    "commentCount": 207,
    "retryCount": 0,
    "time": 1692529355
  },
  {
    "id": 37205029,
    "title": "Endişeli beyinler duygu düzenlemesini yeniden yönlendirir",
    "originLink": "https://www.nature.com/articles/s41467-023-40666-3",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37205029",
    "commentBody": "",
    "originSummary": [
      "Endişeli bireyler frontopolar kortekste (FPl) aşırı uyarılabilirlik gösterir ve duygu kontrolü için diğer frontal korteks bölgelerine güvenirler.",
      "Endişeli bireylerde amigdala ve FPl arasında daha güçlü bağlantılar bulunur.",
      "Çalışma ayrıca kaygılı bireylerin FPl'sinde GABA'nın glutamata oranının daha yüksek olduğunu ortaya koyarak kaygı bozuklukları için potansiyel müdahaleler öneriyor."
    ],
    "commentSummary": [
      "Bu konuşma kaygı, korku ve beynin bunlara verdiği tepki arasındaki bağlantıyı inceliyor.",
      "Anksiyeteye ilişkin çeşitli bakış açıları ve ilaç, terapi ve transkraniyal manyetik stimülasyon gibi potansiyel tedavi seçenekleri incelenmektedir.",
      "Farkındalık ve öz farkındalık, korku ve kaygıyı yönetmek için değerli teknikler olarak kabul edilirken, korkularla kademeli olarak yüzleşmek ve kaygıyı azaltmak için proaktif adımlar atmak vurgulanmaktadır."
    ],
    "points": 208,
    "commentCount": 78,
    "retryCount": 0,
    "time": 1692587091
  },
  {
    "id": 37202415,
    "title": "San Francisco'da Kodachrome slaytlarıyla dolu terk edilmiş bir dolap",
    "originLink": "https://petapixel.com/2023/08/16/the-mystery-of-an-abandoned-cabinet-full-of-kodachrome-slides-in-san-francisco/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37202415",
    "commentBody": "",
    "originSummary": [
      "1960'larda San Francisco'nun büyüleyici fotoğraflarını içeren bir Kodachrome slayt dolabı bir kaldırımda bulundu.",
      "Slaytlar, Bay Area Rapid Transit sisteminin inşasını ve şehirdeki günlük yaşamı gözler önüne seriyor.",
      "Fotoğrafçı James Martin, San Francisco'ya tutkuyla bağlı bir öğretmendi.",
      "İki dolap dolusu slayt daha şu anda kayıptır."
    ],
    "commentSummary": [
      "San Francisco'daki tarihi bir havuzda yüzenleri gösteren unutulmuş bir Kodachrome slayt koleksiyonu nostalji ve merak uyandırıyor.",
      "Sohbet, internet üzerinden ürün satmanın veya hediye etmenin zorluklarına odaklanıyor ve alternatif platformlar için önerilerde bulunuyor.",
      "Kişisel koleksiyonlar için doğru alıcıyı bulmanın önemi ve Kodak'ın bir şirket olarak çöküşü, Kodachrome slaytları ile ilgili kişisel anekdotlar ve koruma ve tarama ile ilgili tavsiyelerle birlikte inceleniyor."
    ],
    "points": 208,
    "commentCount": 80,
    "retryCount": 0,
    "time": 1692561244
  }
]
