[
  {
    "id": 37199495,
    "title": "क्रिस नोवा की मृत्यु हो गई है",
    "originLink": "https://nivenly.org/blog/2023/08/19/an-announcement-regarding-kris-n%C3%B3va/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37199495",
    "commentBody": "",
    "originSummary": [
      "निवेनली के प्रभावशाली नेता और संरक्षक क्रिस नोवा का दुखद रूप से निधन हो गया है, जो व्यावसायिकता और दृष्टि की विरासत को पीछे छोड़ गया है।",
      "निवेनली समुदाय क्रिस नोवा के नुकसान का शोक मना रहा है और भविष्य के लिए अगले कदमों से जूझ रहा है।",
      "इस समय यह स्पष्ट नहीं है कि क्रिस नोवा के मार्गदर्शन और विशेषज्ञता के बिना निवेनली समुदाय आगे के रास्ते पर कैसे नेविगेट करेगा।"
    ],
    "commentSummary": [
      "ओपन-सोर्स उद्योग में एक उल्लेखनीय व्यक्ति क्रिस नोवा का एक चढ़ाई दुर्घटना के कारण दुखद रूप से निधन हो गया है।",
      "उन्हें तकनीकी उद्योग में उनके योगदान और उनके प्रेरणादायक काम के लिए पहचाना जाता है।",
      "उनकी मृत्यु के आसपास के प्रवचन में पर्वतारोहण जैसी गतिविधियों में शामिल जोखिमों और उनके द्वारा प्रस्तुत सामाजिक चुनौतियों पर चर्चा शामिल है।",
      "ऑटिज़्म वाले व्यक्तियों के सामाजिक कौशल और स्पष्ट समावेशिता दिशानिर्देशों के महत्व पर बहस चल रही है।",
      "लेखक इस विश्वास का विरोध करता है कि ऑटिज़्म वाले लोग सामाजिक कौशल नहीं सीख सकते हैं और प्रयास की आवश्यकता और सामाजिक संपर्क पर एक अलग परिप्रेक्ष्य पर जोर देते हैं।",
      "लेखक वेबसाइट पर एक विशिष्ट कहानी पर दिए गए अपर्याप्त ध्यान पर भी सवाल उठाता है।"
    ],
    "points": 803,
    "commentCount": 113,
    "retryCount": 0,
    "time": 1692541831
  },
  {
    "id": 37198954,
    "title": "क्या दूर की वस्तुओं को आवर्धित नहीं दिखाना चाहिए?",
    "originLink": "https://astronomy.stackexchange.com/questions/54499/shouldnt-very-very-distant-objects-appear-magnified",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37198954",
    "commentBody": "",
    "originSummary": [
      "एस्ट्रोनॉमी स्टैक एक्सचेंज खगोलविदों और खगोल भौतिकीविदों के लिए प्रश्नोत्तर में संलग्न होने के लिए एक मंच है।",
      "एक उपयोगकर्ता इस बारे में सवाल उठाता है कि बहुत दूर की वस्तुएं आवर्धित क्यों नहीं दिखाई देती हैं।",
      "एक अन्य उपयोगकर्ता स्पष्ट करता है कि अंतरिक्ष का विस्तार आवर्धन का कारण बनता है, हालांकि यह एक विशिष्ट दूरी पर ध्यान देने योग्य हो जाता है।"
    ],
    "commentSummary": [
      "विस्तारित ब्रह्मांड और प्रकाश की परिमित गति दूर की वस्तुओं को आवर्धित दिखाने में योगदान करती है।",
      "सापेक्षता और क्वांटम यांत्रिकी जैसी भौतिकी अवधारणाएं इस घटना को समझने में भूमिका निभाती हैं।",
      "प्रकाश की गति को कार्य-कारण की अधिकतम गति या अंतरिक्ष के माध्यम से यात्रा करने वाली किसी भी चीज़ के लिए बहस की जाती है।",
      "कॉस्मिक माइक्रोवेव पृष्ठभूमि प्रकाश की सीमा को चिह्नित करती है और सुझाव देती है कि इससे परे वस्तुएं अभी तक दिखाई नहीं दे रही हैं।",
      "चर्चा ब्रह्मांड के विस्तार और दूर की वस्तुओं को देखने की सीमाओं के सबूतों को भी छूती है।"
    ],
    "points": 515,
    "commentCount": 135,
    "retryCount": 0,
    "time": 1692538191
  },
  {
    "id": 37200615,
    "title": "तो आप भौतिकी सीखना चाहते हैं (2021)",
    "originLink": "https://www.susanrigetti.com/physics",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37200615",
    "commentBody": "",
    "originSummary": [
      "सुसान रिगेटी ने अपने दम पर भौतिकी सीखने के लिए अपनी मार्गदर्शिका का दूसरा संस्करण जारी किया है, जिसमें पाठक प्रतिक्रिया शामिल है और सुधार किया गया है।",
      "गाइड भौतिकी में विभिन्न विषयों का अध्ययन करने की सलाह देता है, कैलकुलस से शुरू होता है और विशेष क्षेत्रों में प्रगति करता है।",
      "यह व्यापक दृष्टिकोण के लिए लोकप्रिय भौतिकी पुस्तकों का भी सुझाव देता है, जिसमें स्नातक और स्नातक स्तर की भौतिकी पर पाठ्यपुस्तकें, साथ ही सामान्य सापेक्षता और क्वांटम क्षेत्र सिद्धांत जैसे उन्नत विषय शामिल हैं।"
    ],
    "commentSummary": [
      "चर्चाओं में भौतिकी शिक्षा में विभिन्न विषयों को शामिल किया गया है, जिसमें निरंतरता यांत्रिकी की चूक और हाइड्रोलिक्स और ब्रह्मांड संबंधी मॉडल जैसी घटनाओं को समझने का महत्व शामिल है।",
      "गैर-क्वांटम भौतिकी पुस्तकों के लिए सिफारिशें और भौतिकी और इंजीनियरिंग के बीच की सीमाओं पर चर्चा शामिल हैं।",
      "भौतिकी का अध्ययन करने में गणित, विशेष रूप से कैलकुलस के महत्व के साथ-साथ औपचारिक शिक्षा बनाम स्व-अध्ययन की प्रभावशीलता पर बहस की जाती है।"
    ],
    "points": 421,
    "commentCount": 144,
    "retryCount": 0,
    "time": 1692548893
  },
  {
    "id": 37202727,
    "title": "जैज़² पुनरुत्थान: ओपन-सोर्स जैज़ जैकरैबिट 2 पुन: कार्यान्वयन",
    "originLink": "http://deat.tk/jazz2/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37202727",
    "commentBody": "",
    "originSummary": [
      "Jazz² पुनरुत्थान खेल जैज़ जैकरैबिट 2 का एक ओपन-सोर्स पुन: कार्यान्वयन है, जिससे खिलाड़ियों को आधुनिक प्लेटफार्मों पर क्लासिक गेम का अनुभव करने की अनुमति मिलती है।",
      "गेम को विंडोज, लिनक्स, मैकओएस, एंड्रॉइड, निंटेंडो स्विच और वेब ब्राउज़र सहित विभिन्न प्लेटफार्मों पर डाउनलोड और खेला जा सकता है।",
      "परियोजना को जीएनयू जनरल पब्लिक लाइसेंस वी 3.0 के तहत लाइसेंस प्राप्त है और संशोधित एनसिने गेम इंजन का उपयोग करता है, जो एक बहुमुखी और अनुकूलन योग्य गेमिंग अनुभव प्रदान करता है।"
    ],
    "commentSummary": [
      "उपयोगकर्ता जैज़ जैकरैबिट 2 और इसके ओपन-सोर्स पुन: कार्यान्वयन के बारे में चर्चा में संलग्न होते हैं, अपने अनुभवों और गेम खेलने की यादों को साझा करते हैं।",
      "प्रतिभागियों द्वारा समान प्लेटफॉर्मर्स के लिए सिफारिशें की जाती हैं, जो समान रेट्रो गेम की खोज में उनकी रुचि का प्रदर्शन करती हैं।",
      "बातचीत गेम के विकास पर चर्चा करने के लिए अपने दायरे का विस्तार करती है, विशेष रूप से मल्टीप्लेयर समर्थन को लागू करने की चुनौतियां, और परित्याग वेयर की अवधारणा और विभिन्न प्लेटफार्मों पर गेम की उपलब्धता को छूती है।"
    ],
    "points": 376,
    "commentCount": 78,
    "retryCount": 0,
    "time": 1692563879
  },
  {
    "id": 37205731,
    "title": "हम सभी बस अस्थायी रूप से अक्षम हैं",
    "originLink": "https://blog.jim-nielsen.com/2023/temporarily-abled/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37205731",
    "commentBody": "",
    "originSummary": [
      "लेखक अपनी छुट्टी के दौरान उनके घुटने को घायल करता है और शारीरिक क्षमता की क्षणभंगुर प्रकृति पर विचार करता है।",
      "वे उन अभिगम्यता सहायता के लिए प्रशंसा व्यक्त करते हैं जो उनकी वसूली के दौरान उनकी सहायता करते हैं।",
      "लेखक एक नौकरी करने में उनके विशेषाधिकार को स्वीकार करता है जो उन्हें उपचार के लिए आवश्यक समय निकालने की अनुमति देता है।"
    ],
    "commentSummary": [
      "लेख शुरुआती ताकत जैसे शक्ति प्रशिक्षण कार्यक्रमों के लाभों और संभावित जोखिमों की पड़ताल करता है।",
      "यह किसी के शरीर को सुनने, व्यक्तिगत लक्ष्यों को निर्धारित करने और गहन शक्ति प्रशिक्षण में दीर्घकालिक स्वास्थ्य और चोट की रोकथाम को प्राथमिकता देने के महत्व पर प्रकाश डालता है।",
      "बातचीत में पावरलिफ्टिंग और बॉडीबिल्डिंग में चोटों का जोखिम, मशीनों का उपयोग बनाम मुक्त वजन और उचित रूप और अच्छी कोचिंग के महत्व जैसे विषयों को शामिल किया गया है।"
    ],
    "points": 282,
    "commentCount": 174,
    "retryCount": 0,
    "time": 1692594963
  },
  {
    "id": 37197903,
    "title": "बिजली के नक्शे",
    "originLink": "https://app.electricitymaps.com",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37197903",
    "commentBody": "",
    "originSummary": [
      "सूची देशों और क्षेत्रों को उनकी बिजली की खपत की कार्बन तीव्रता के आधार पर रैंक करती है, जो उनके ऊर्जा उपयोग के पर्यावरणीय प्रभाव को दर्शाती है।",
      "रैंकिंग के लिए उपयोग किया जाने वाला डेटा इलेक्ट्रिसिटी मैप्स से लिया गया है, जो एक ओपन-सोर्स प्लेटफॉर्म है जो बिजली के जलवायु प्रभाव की कल्पना करता है।",
      "ऐप न केवल जानकारी प्रदान करता है, बल्कि उपयोगकर्ताओं को सूची में अपने स्वयं के क्षेत्रों या देशों को जोड़कर योगदान करने की अनुमति देता है। इसके अतिरिक्त, यह ऐतिहासिक डेटा प्रदान करता है और उपयोगकर्ताओं को विभिन्न समय अवधि में कार्बन तीव्रता के स्तर को देखने में सक्षम बनाता है।"
    ],
    "commentSummary": [
      "विभिन्न वेबसाइटें उपलब्ध हैं जो बिजली के उपयोग, मौसम, उड़ान और उपग्रह ट्रैकिंग, रेलवे, प्रकाश प्रदूषण और प्राकृतिक आपदाओं पर लाइव डेटा प्रदान करती हैं।",
      "इन वेबसाइटों पर उपयोग किए जाने वाले डेटा और स्रोतों की सटीकता चर्चा का एक महत्वपूर्ण बिंदु है।",
      "नवीकरणीय ऊर्जा के लिए जर्मनी के संक्रमण पर प्रकाश डाला गया है, जिसमें नवीकरणीय ऊर्जा को बढ़ाने में चुनौतियां और सीमाएं, कोयले और आयातित बिजली पर निर्भरता, और यह धारणा है कि यह उतना सफल नहीं हुआ है जितना कि अनुमान लगाया गया था।"
    ],
    "points": 224,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1692528523
  },
  {
    "id": 37205053,
    "title": "FreeBSD ने SYSINTs पर मर्जसॉर्ट के साथ बबलसॉर्ट को बदल दिया",
    "originLink": "https://twitter.com/cperciva/status/1693127769901969772",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37205053",
    "commentBody": "",
    "originSummary": [
      "FreeBSD (HEAD) ने अपने SYSINITs में बबलसॉर्ट एल्गोरिदम को बदलने के लिए मर्जसॉर्ट एल्गोरिदम लागू किया है।",
      "इस परिवर्तन के परिणामस्वरूप गति में उल्लेखनीय सुधार हुआ है।",
      "मर्जसॉर्ट एल्गोरिथ्म को अपनाना अपने सिस्टम में प्रदर्शन और दक्षता बढ़ाने के लिए फ्रीबीएसडी की प्रतिबद्धता को दर्शाता है।"
    ],
    "commentSummary": [
      "फ्रीबीएसडी ने वर्चुअल मशीनों के लिए कर्नेल बूटिंग गति को बढ़ाने के लिए बबलसॉर्ट एल्गोरिदम को मर्जसॉर्ट के साथ बदल दिया है।",
      "एक डेवलपर ने बबलसॉर्ट को मर्जसॉर्ट से बदलकर फ्रीबीएसडी के बूट टाइम में 100 गुना स्पीडअप हासिल किया है।",
      "कुछ का तर्क है कि बबलसॉर्ट के साथ मूल कार्यान्वयन काफी अच्छा था, जबकि अन्य बेहतर प्रदर्शन के लिए सम्मिलन प्रकार का उपयोग करने का सुझाव देते हैं।"
    ],
    "points": 223,
    "commentCount": 145,
    "retryCount": 0,
    "time": 1692587360
  },
  {
    "id": 37197986,
    "title": "एक देवता में विश्वास के बिना, लेकिन एक शैतान में विश्वास के बिना कभी नहीं",
    "originLink": "https://www.robkhenderson.com/p/without-belief-in-a-god-but-never",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37197986",
    "commentBody": "",
    "originSummary": [
      "लेख एरिक होफर की पुस्तक \"द ट्रू बिलीवर\" और जन आंदोलनों के पीछे प्रेरणाओं को समझने में इसकी प्रासंगिकता की पड़ताल करता है।",
      "हॉफर का तर्क है कि हताशा जन आंदोलनों को चलाने में महत्वपूर्ण भूमिका निभाती है, जो जानबूझकर अपने सदस्यों के बीच इस निराशा का फायदा उठाते हैं।",
      "लेख इस बात पर प्रकाश डालता है कि कैसे ध्रुवीकृत राजनीति और समानता की खोज निराशा और सामाजिक आंदोलनों के उद्भव में योगदान करती है।",
      "हॉफर यह भी सुझाव देते हैं कि जन आंदोलन असंतुष्ट व्यक्तियों को उद्देश्य और पहचान की भावना प्रदान करते हैं।",
      "लेख में आगे होफर के अवलोकन का उल्लेख किया गया है कि घृणा को अक्सर जन आंदोलनों में एकजुट करने वाली शक्ति के रूप में उपयोग किया जाता है।",
      "कुल मिलाकर, लेख जन आंदोलनों के खतरों और व्यक्तिगत निराशाओं में हेरफेर करने और उनका लाभ उठाने की उनकी क्षमता को रेखांकित करता है।"
    ],
    "commentSummary": [
      "चर्चा स्पष्ट लक्ष्यों के प्रभाव और जन आंदोलनों में दुश्मनों की उपस्थिति की पड़ताल करती है।",
      "प्रतिभागी सामाजिक नेटवर्क और मीडिया के कारण ध्रुवीकरण और विचारधारा और धर्म के प्रभाव पर बहस करते हैं।",
      "हिंसा, शिक्षा और विश्वास प्रणालियों के बीच संबंध का भी पता लगाया जाता है, साथ ही शिक्षा और शिक्षा के बीच अंतर भी।"
    ],
    "points": 217,
    "commentCount": 207,
    "retryCount": 0,
    "time": 1692529355
  },
  {
    "id": 37205029,
    "title": "चिंतित दिमाग भावना विनियमन को पुनर्निर्देशित करते हैं।",
    "originLink": "https://www.nature.com/articles/s41467-023-40666-3",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37205029",
    "commentBody": "",
    "originSummary": [
      "चिंतित व्यक्ति फ्रंटोपोलर कॉर्टेक्स (एफपीएल) में अतिउत्तेजना दिखाते हैं और भावना नियंत्रण के लिए अन्य फ्रंटल कॉर्टेक्स क्षेत्रों पर भरोसा करते हैं।",
      "चिंतित व्यक्तियों में एमिग्डाला और एफपीएल के बीच मजबूत संबंध पाए जाते हैं।",
      "अध्ययन से चिंतित व्यक्तियों के एफपीएल में जीएबीए और ग्लूटामेट के उच्च अनुपात का भी पता चलता है, जो चिंता विकारों के लिए संभावित हस्तक्षेप का सुझाव देता है।"
    ],
    "commentSummary": [
      "यह बातचीत चिंता, भय और उनके प्रति मस्तिष्क की प्रतिक्रिया के बीच संबंध में उतरती है।",
      "चिंता और संभावित उपचार विकल्पों पर विभिन्न दृष्टिकोण, जैसे दवा, चिकित्सा और ट्रांसक्रैनियल चुंबकीय उत्तेजना, का पता लगाया जाता है।",
      "माइंडफुलनेस और आत्म-जागरूकता को भय और चिंता के प्रबंधन के लिए मूल्यवान तकनीकों के रूप में स्वीकार किया जाता है, जबकि धीरे-धीरे भय का सामना करने और चिंता को कम करने के लिए सक्रिय कदम उठाने पर जोर दिया जाता है।"
    ],
    "points": 208,
    "commentCount": 78,
    "retryCount": 0,
    "time": 1692587091
  },
  {
    "id": 37202415,
    "title": "सैन फ्रांसिस्को में कोडाक्रोम स्लाइड से भरा एक परित्यक्त कैबिनेट",
    "originLink": "https://petapixel.com/2023/08/16/the-mystery-of-an-abandoned-cabinet-full-of-kodachrome-slides-in-san-francisco/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37202415",
    "commentBody": "",
    "originSummary": [
      "1960 के दशक में सैन फ्रांसिस्को की मनोरम तस्वीरों वाले कोडाक्रोम स्लाइड्स का एक कैबिनेट एक फुटपाथ पर खोजा गया था।",
      "स्लाइड्स में बे एरिया रैपिड ट्रांजिट सिस्टम के निर्माण और शहर में रोजमर्रा की जिंदगी को दिखाया गया है।",
      "फोटोग्राफर, जेम्स मार्टिन, एक स्कूली शिक्षक था, जिसे सैन फ्रांसिस्को के लिए जुनून था।",
      "स्लाइड ्स के दो अतिरिक्त अलमारियाँ वर्तमान में बेहिसाब हैं।"
    ],
    "commentSummary": [
      "सैन फ्रांसिस्को के एक ऐतिहासिक पूल में तैराकों की विशेषता वाले कोडाक्रोम स्लाइड्स का एक भूला हुआ संग्रह पुरानी यादों और जिज्ञासा को लाता है।",
      "बातचीत ऑनलाइन वस्तुओं को बेचने या देने की कठिनाइयों पर केंद्रित है, जो वैकल्पिक प्लेटफार्मों के लिए सिफारिशों को प्रेरित करती है।",
      "व्यक्तिगत संग्रह के लिए सही प्राप्तकर्ता खोजने और एक कंपनी के रूप में कोडक के पतन के महत्व का पता लगाया गया है, साथ ही कोडाक्रोम स्लाइड के बारे में व्यक्तिगत उपाख्यानों और संरक्षण और स्कैनिंग पर सलाह दी गई है।"
    ],
    "points": 208,
    "commentCount": 80,
    "retryCount": 0,
    "time": 1692561244
  }
]
