[
  {
    "id": 37326870,
    "title": "لقد قمت بأتمتة نصف كتابتي",
    "originLink": "https://github.com/eschluntz/compress",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37326870",
    "commentBody": "",
    "originSummary": [
      "يستخدم المستخدم أداة تحلل رسائل Slack الخاصة به وتنشئ اختصارات لوحة المفاتيح للعبارات شائعة الاستخدام خلال العام الماضي.",
      "تعمل الأداة عن طريق تحليل رسائل Slack للتعرف على العبارات المتكررة بشكل متكرر.",
      "توفر هذه الأداة للمستخدمين الكفاءة والراحة من خلال تحويل العبارات الروتينية إلى اختصارات لوحة مفاتيح يسهل الوصول إليها."
    ],
    "commentSummary": [
      "ينصب التركيز الأساسي للنص على تعزيز كفاءة الكتابة والإنتاجية من خلال أدوات الأتمتة والاختصارات والاختصارات.",
      "هناك نقاش مستمر حول أهمية سرعة الكتابة في ترميز الإنتاجية ، وتحقيق التوازن بين الكفاءة والاسترخاء في كل من العمل والحياة.",
      "يتم استكشاف طرق مختلفة مثل اختصارات لوحة المفاتيح ، وإعدادات لوحة المفاتيح البديلة ، وأدوات توسيع النص ، وأنظمة الإملاء ، مع مناقشة فوائدها وعيوبها المحتملة."
    ],
    "points": 624,
    "commentCount": 236,
    "retryCount": 0,
    "time": 1693420852
  },
  {
    "id": 37323760,
    "title": "طبقتي",
    "originLink": "https://www.cs.toronto.edu/~meel/opinions/caste.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37323760",
    "commentBody": "",
    "originSummary": [
      "يعرف مؤلف المنشور بأنه عضو في الطبقات المتخلفة الأخرى (OBC) ، وهي مجموعة محرومة اجتماعيا واقتصاديا في الهند.",
      "يسلطون الضوء على قضية التمثيل الناقص في الأوساط الأكاديمية ، مشيرين على وجه التحديد إلى ندرة أعضاء هيئة التدريس في OBC داخل المؤسسات الهندية من الدرجة الأولى.",
      "الهدف العام من هذا المنشور هو زيادة الوعي وتقديم التشجيع لأفراد OBC الذين يسعون للتقدم في التعليم العالي أو تأمين مناصب أعضاء هيئة التدريس."
    ],
    "commentSummary": [
      "تناقش السلسلة النظام الطبقي والتمييز الطبقي في الهند ، مع التركيز على تأثيره على المجتمعات وانتشاره عبر القطاعات المجتمعية مثل التعليم والتوظيف.",
      "تتوسع المحادثة في مسائل معقدة مثل العمل الإيجابي والتأثيرات الثقافية وتعقد مقارنات مع العنصرية لتوفير منظور متعمق.",
      "ويسلط الضوء على الممارسات المتحيزة المحتملة في شركات التكنولوجيا واستخدام البيانات الطبقية على منصات المواعدة والزواج ، مما يشير إلى الآثار واسعة النطاق للتمييز الطبقي."
    ],
    "points": 508,
    "commentCount": 370,
    "retryCount": 0,
    "time": 1693409716
  },
  {
    "id": 37321028,
    "title": "\"البنكرياس الإلكتروني\" DIY يغير رعاية مرضى السكري",
    "originLink": "https://www.nature.com/articles/d41586-023-02648-9",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37321028",
    "commentBody": "",
    "originSummary": [
      "طور مجتمع من الأفراد الذين يديرون مرض السكري من النوع 1 برنامجا مفتوح المصدر DIY لأتمتة إدارة مستوى الجلوكوز في الدم ، مع التأكيد على أهمية التخصيص على الأنظمة التجارية.",
      "يضغط المدافعون من أجل الحصول على تصريح من إدارة الغذاء والدواء الأمريكية لخوارزمية مفتوحة المصدر لزيادة إمكانية الوصول إلى أجهزة DIY هذه ، ولكن التعاون بين الشركات المصنعة للأجهزة ضروري للتشغيل البيني.",
      "تسلط الفوائد المبلغ عنها لخوارزميات الذكاء الاصطناعي مفتوحة المصدر هذه في إدارة مرض السكري الضوء على قيمة اختيار المستخدم والتقدم داخل مجتمع المصادر المفتوحة."
    ],
    "commentSummary": [
      "تتضمن المناقشة العديد من جوانب إدارة مرض السكري مثل استخدام تقنية افعلها بنفسك (DIY) ، وأنظمة الحلقة المغلقة ، والتحديات التي تنطوي على استخدام مضخة الأنسولين ، وضرورة تحسين أجهزة المراقبة ، وتأثير العادات الغذائية ، وتأثير مجتمع DIY في قيادة التقدم.",
      "هناك تفكير حول المزايا والعيوب المحتملة لاستراتيجيات الإدارة المختلفة ، مما يبرز أهمية البحث المستمر والدعم للأشخاص الذين يعانون من مرض السكري.",
      "ينصب التركيز الشامل على اكتشاف حلول محسنة للتحكم في مستويات السكر في الدم وتقليل المخاطر المرتبطة بمرض السكري."
    ],
    "points": 434,
    "commentCount": 156,
    "retryCount": 0,
    "time": 1693398725
  },
  {
    "id": 37321002,
    "title": "تستخدم Microsoft النوافذ المنبثقة الشبيهة بالبرامج الضارة في Win11 لجعل الأشخاص يتخلصون من Chrome",
    "originLink": "https://www.theverge.com/2023/8/30/23851902/microsoft-bing-popups-windows-11-malware",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37321002",
    "commentBody": "",
    "originSummary": [
      "تطالب Microsoft مستخدمي Windows 11 برسائل منبثقة تقترح تبديل محرك البحث الافتراضي من Google إلى Bing ، حتى عندما يستخدمون Chrome.",
      "تتسبب هذه التكتيكات في إحباط المستخدم ، لأنهم يعتبرون مثل هذه النوافذ المنبثقة تدخلية ويعتقدون أنه لا ينبغي إخضاعهم للإعلانات داخل نظام التشغيل الذي اشتروه.",
      "لقد أدركت Microsoft رد الفعل العنيف وأوقفت هذه الإشعارات مؤقتا أثناء محاولتها حل المشكلة."
    ],
    "commentSummary": [
      "تركز المناقشات على إحباطات المستخدمين مع Windows ، وتحديدا Windows 11 ، مما يدفع البعض إلى التفكير في بدائل مثل Mac أو Linux بسبب مشكلات في النوافذ المنبثقة وحسابات المستخدمين ورؤية البرنامج.",
      "من بين خيارات النظام ، تم الإشادة بنظام Linux لسهولة الاستخدام والوظائف ولكنه لاحظ عيوبا لتشغيل ألعاب معينة. تشمل المجالات الأخرى التي تمت مناقشتها تفضيلات الأجهزة وتوافق البرامج وقيود نظام Windows الفرعي لنظام Linux (WSL).",
      "هناك شعور سائد بعدم الرضا عن الانقطاعات والإعلانات في المنتجات التقنية ، مع المناقشات حول قيود النظام الأساسي ، ومستقبل Windows ، وسلوك Microsoft ، والإجراءات القانونية أو التنظيمية المحتملة. تشير بعض الإحباطات من تطبيقات iPhone ل Gmail وخرائط Google أيضا إلى استياء محتمل من منتجات Google."
    ],
    "points": 408,
    "commentCount": 334,
    "retryCount": 0,
    "time": 1693398549
  },
  {
    "id": 37320786,
    "title": "تستخدم مكونات نظام Windows 11 المتصفح الافتراضي لفتح الروابط في أوروبا",
    "originLink": "https://blogs.windows.com/windows-insider/2023/08/25/announcing-windows-11-insider-preview-build-23531-dev-channel/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37320786",
    "commentBody": "",
    "originSummary": [
      "طرحت Microsoft Insider Preview Build 23531 لنظام التشغيل Windows 11 إلى قناة Dev ، المليئة بالتحديثات مثل إصلاحات الوضع الآمن ومستكشف الملفات وخلفيات HDR وإدارة المهام.",
      "تستمر بعض المشكلات المعروفة في الاستمرار مع قائمة ابدأ ووظائف البحث على شريط المهام. يتم تشجيع المطورين على تنزيل أحدث حزم Windows Insider SDK و NuGet لمواكبة التحديثات.",
      "بعد إعادة التشغيل ، تتلقى قناة Dev Channel الآن 23000 سلسلة إصدارات ، ومن هنا جاءت العلامة المائية لسطح المكتب ، وهي ميزة منتظمة لإصدارات ما قبل الإصدار."
    ],
    "commentSummary": [
      "تركز المناقشة على انتقادات Microsoft Windows 11 في المنطقة الاقتصادية الأوروبية (EEA) لتحيزها تجاه متصفح Edge ، متجاهلة تفضيل المستخدم.",
      "كما يناقش المشاركون سلوك شركات التكنولوجيا الأخرى مثل أبل، ملمحا إلى الحاجة الأوسع إلى لوائح صارمة لمنع الممارسات الاحتكارية التي تحد من اختيار المستخدم وخصوصيته.",
      "تشمل الموضوعات الأخرى الإحباط من تنزيل Chrome على Edge ، وعدم الاحترام الملحوظ من Microsoft لمستخدميها ، والتجارب الإيجابية مع الخيارات البديلة مثل Linux Mint."
    ],
    "points": 403,
    "commentCount": 336,
    "retryCount": 0,
    "time": 1693397259
  },
  {
    "id": 37320975,
    "title": "مئات الآلاف تم الاتجار بهم للعمل كمحتالين عبر الإنترنت في جنوب شرق آسيا ، حسب الأمم المتحدة",
    "originLink": "https://www.ohchr.org/en/press-releases/2023/08/hundreds-thousands-trafficked-work-online-scammers-se-asia-says-un-report",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37320975",
    "commentBody": "",
    "originSummary": [
      "يكشف تقرير صادر عن مفوضية الأمم المتحدة لحقوق الإنسان أن العصابات الإجرامية المنظمة تجبر مئات الآلاف من مواطني جنوب شرق آسيا على القيام بأنشطة إجرامية عبر الإنترنت مثل عمليات الاحتيال في الاستثمار الرومانسي والاحتيال في العملات المشفرة والمقامرة غير المشروعة.",
      "تعرض هذه المنظمات الإجرامية ضحاياها لانتهاكات حقوق الإنسان مثل التهديدات والتعذيب والعنف الجنسي والعمل القسري والاحتجاز التعسفي. من الصعب تقدير حجم هذا الاتجار بالاحتيال عبر الإنترنت بسبب طبيعته السرية.",
      "ويدعو التقرير الدول المتضررة إلى تعزيز حقوق الإنسان، وتعزيز الحوكمة، وإنفاذ سيادة القانون، والتصدي للفساد كجزء من استجابتها لهذه الحيل التي تصاعدت خلال جائحة كوفيد-19."
    ],
    "commentSummary": [
      "تتضمن المحادثة عبر الإنترنت تقارير عن الاتجار بالبشر في جنوب شرق آسيا ، حيث يجبر الضحايا على القيام بأنشطة احتيال عبر الإنترنت ، يحتمل أن تشمل إنفاذ القانون المحلي والشبكات السياسية.",
      "يمتد النقاش إلى ممارسات العدالة الجنائية القائمة، مع التركيز على التحسينات المنهجية لمنع الجريمة، وإعادة تأهيل المجرمين، ومعالجة معاملة السجناء في الولايات المتحدة.",
      "يتم التدقيق في دور الذكاء الاصطناعي في عمليات الاحتيال ، بينما هناك أيضا نقاش حول مسؤولية منصات التواصل الاجتماعي مثل Tinder و LinkedIn للتخفيف من أنشطة الاحتيال هذه."
    ],
    "points": 348,
    "commentCount": 180,
    "retryCount": 0,
    "time": 1693398431
  },
  {
    "id": 37326806,
    "title": "لجنة الاتصالات الفيدرالية ترفض إلغاء القاعدة التي تتطلب من مزودي خدمات الإنترنت إدراج كل رسوم شهرية",
    "originLink": "https://arstechnica.com/tech-policy/2023/08/fcc-says-too-bad-to-isps-complaining-that-listing-every-fee-is-too-hard/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37326806",
    "commentBody": "",
    "originSummary": [
      "رفضت لجنة الاتصالات الفيدرالية (FCC) مناشدات من Comcast ومقدمي خدمات الإنترنت الآخرين لإزالة قاعدة تلزمهم بالكشف عن جميع الرسوم الشهرية.",
      "جادل مزودو خدمات الإنترنت بأن هذا الشرط يطرح تحديات إدارية وتعقيدا لا مبرر له ، لكن لجنة الاتصالات الفيدرالية شددت على الحاجة إلى الشفافية للمستهلكين عند اختيار خدمة الإنترنت الخاصة بهم.",
      "بموجب التشريع ، ستقوم لجنة الاتصالات الفيدرالية بإنفاذ هذه القواعد ، مما يستلزم من مزودي خدمة الإنترنت تضمين جميع الرسوم التي تفرضها الحكومة على ملصق النطاق العريض."
    ],
    "commentSummary": [
      "أيدت لجنة الاتصالات الفيدرالية (FCC) قاعدة تلزم مزودي خدمة الإنترنت (ISPs) بالكشف عن جميع الرسوم الشهرية للعملاء في محاولة لتعزيز الشفافية وتسهيل المقارنة بين مقدمي الخدمات.",
      "يجادل المؤيدون بأن هذه القاعدة ستكشف التهم الخفية ، وتحفز المنافسة بين مزودي خدمات الإنترنت ، وتحاسبهم. وتثير المناقشة أيضا مسألة ما إذا كان ينبغي اعتبار رسوم المرور التي تفرضها الحكومات المحلية ضرائب وما إذا كان ينبغي لمقدمي خدمات الإنترنت نقلها إلى العملاء.",
      "بالإضافة إلى ذلك ، قضت لجنة الاتصالات الفيدرالية (FCC) بأنه يجب على مزودي خدمة الإنترنت الكشف عن جميع الرسوم والتكاليف مقدما في إعلاناتهم لتقديم مزيد من الشفافية ، مما يعكس المشاعر العامة للصدق في التسعير وضد الرسوم الخفية."
    ],
    "points": 339,
    "commentCount": 214,
    "retryCount": 0,
    "time": 1693420655
  },
  {
    "id": 37324683,
    "title": "يعيش \"GPU الفقراء\" - منح الذكاء الاصطناعي مفتوحة المصدر",
    "originLink": "https://a16z.com/2023/08/30/supporting-the-open-source-ai-community/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37324683",
    "commentBody": "",
    "originSummary": [
      "تتزايد المشاريع مفتوحة المصدر في الذكاء الاصطناعي ، لكن المطورين غالبا ما يفتقرون إلى الموارد اللازمة للحفاظ على عملهم على المدى الطويل.",
      "بدأت AH Capital Management برنامج منحة الذكاء الاصطناعي مفتوح المصدر a16z لتقديم الدعم المالي لهؤلاء المطورين ، مما يخفف الضغط لتوليد الأرباح.",
      "تم الكشف عن المجموعة الأولية من المستفيدين من المنح والمشاريع الممولة."
    ],
    "commentSummary": [
      "بدأت شركة رأس المال الاستثماري ، a16z ، صندوقا بقيمة 100 مليون دولار لمنح المساعدات لمشاريع الذكاء الاصطناعي مفتوحة المصدر ، بهدف تعزيز تطبيقات الذكاء الاصطناعي الواقعية والقضاء على الرقابة على نماذج اللغة.",
      "وقد أثار التمويل، الذي يكتنفه الشك، نقاشا حول الدوافع الحقيقية وراء المبادرة. توضح A16Z أن المنح لا تتطلب أي حقوق ملكية وتهدف إلى دعم مطوري البرامج مفتوحة المصدر ، وتشجيع نظام بيئي مزدهر.",
      "يركز الخطاب أيضا على القيود المالية التي تثقل كاهل المطورين بسبب الاستثمار في وحدات معالجة الرسومات (GPUs) لتطوير الذكاء الاصطناعي ، وهو مصدر قلق يعتقد البعض أنه يجب على الصندوق معالجته بسبب غموضه الافتراضي."
    ],
    "points": 312,
    "commentCount": 106,
    "retryCount": 0,
    "time": 1693413443
  },
  {
    "id": 37331778,
    "title": "نجاح سخيف",
    "originLink": "https://www.marginalia.nu/log/87_absurd_success/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37331778",
    "commentBody": "",
    "originSummary": [
      "يفصل المؤلف التطورات الأخيرة في تحسين محرك البحث ، مثل تقليل متطلبات ذاكرة الوصول العشوائي ، وإزالة الحاجة إلى التوقف عن العمل أثناء الترقيات ، وزيادة سعة فهرسة المستندات.",
      "تم الكشف عن خطة لتحسين قاعدة بيانات URL وبناء الفهرس العكسي ، وهي الجهود التي أدت بالفعل إلى تقليل استخدام ذاكرة الوصول العشوائي ، والنسخ الاحتياطية المبسطة ، وبناء الفهرس السريع.",
      "يعبر سرد المؤلف عن رضاه عن التعديلات التي تم إجراؤها ويطلب تبرعات للتحسين المستمر."
    ],
    "commentSummary": [
      "تركز المحادثة على Hacker News على منشور مدونة حول Marginalia ، وهو مشروع محرك بحث عالي الكفاءة ، يغطي مجالات مثل مزايا التحسين ، والقيود التي تعزز الإبداع ، والنظر في الأجهزة المتنوعة وتجارب المستخدم.",
      "يسلط المشاركون الضوء على إمكانات الشركات الصغيرة التي توفر تجارب عملاء متفوقة ، وأهمية القيود في تحفيز الابتكار ، والغرض من المشاريع الشخصية في مختلف المجالات.",
      "يتضمن الموضوع الذي نوقش بشدة خلال هذه المناقشة أيضا كفاءة الفرق الكبيرة مقابل الفرق الصغيرة في إنتاج عمل جيد."
    ],
    "points": 311,
    "commentCount": 86,
    "retryCount": 0,
    "time": 1693448846
  },
  {
    "id": 37323604,
    "title": "اختراق EDID لشاشة LG",
    "originLink": "https://gist.github.com/kj800x/be3001c07c49fdb36970633b0bc6defb",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37323604",
    "commentBody": "",
    "originSummary": [
      "تتناول المقالة مشكلة في شاشة LG ULTRAGEAR لا تعمل بشكل صحيح على نظام التشغيل Linux.",
      "يتم التحقيق في المشكلة من خلال استكشاف ملف بيانات تعريف العرض الموسعة (EDID) وتعديله باستخدام محرر سداسي عشري.",
      "يبدو أن المشكلة مرتبطة ببرامج تشغيل بطاقة الرسومات على Linux بدلا من الشاشة نفسها ، مما يشير إلى وسيلة محتملة لحل مشكلات مماثلة."
    ],
    "commentSummary": [
      "تتعمق المقالة في التحديات والقضايا المتعلقة بتوافق الشاشة ومعالجة بيانات تعريف العرض الموسعة (EDID) على أنظمة التشغيل مثل Linux و macOS و Windows.",
      "يسلط الضوء على تجارب المستخدم فيما يتعلق بتجاوزات EDID ، و Dolby Vision ذات الكمون المنخفض ، وتعديلات السطوع ، وأخطاء ساعة البكسل ، والأجهزة غير المنشورة ، ويشير إلى تعقيد وقيود التعامل مع بيانات EDID.",
      "تسلط المناقشة الضوء أيضا على مشكلات توافق الأجهزة على Linux والفروق الدقيقة في استكشاف الأخطاء وإصلاحها على النظام الأساسي. ويؤكد على وجه التحديد على مشاكل EDIDs لشاشات LG والتعايش بين معايير مختلفة على جهاز واحد."
    ],
    "points": 284,
    "commentCount": 121,
    "retryCount": 0,
    "time": 1693409048
  }
]
