[
  {
    "id": 40793465,
    "title": "كرة: كرة تعيش في رصيفك",
    "originLink": "https://github.com/nate-parrott/ball",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40793465",
    "commentBody": "",
    "originSummary": [
      "\"الكرة\" هي كرة حمراء صغيرة تفاعلية يمكن سحبها ورميها وجعلها ترتد على شاشتك، مما يوفر ترفيهًا بسيطًا.",
      "مستوحى من أداة لوحة التحكم OS X الخاصة بـ Nate Heagy، تتضمن هذه النسخة رسومات متحركة تسمح للكرة بالخروج من المرسى، بفضل توجيهات Wessley Roche.",
      "يقدم التطبيق تجربة ممتعة، تتيح للمستخدمين معرفة عدد المرات التي يمكن أن ترتد فيها الكرة أو تصطدم بالجدار."
    ],
    "commentSummary": [
      "مشروع GitHub يسمى \"Ball\" يقدم كرة ترتد في شريط الأدوات الخاص بك، مما يذكرك بألعاب سطح المكتب القديمة.",
      "تجارب المستخدمين متباينة؛ فبعضهم يجدها مسلية، بينما يواجه آخرون مشكلات في الاستخدام الإنتاجي ودعم المطورين.",
      "لقد أثار المشروع الحنين إلى أدوات سطح المكتب المرحة من الماضي، مثل نيكو، بونزي بادي، وشاشات التوقف المختلفة، مما يبرز الرغبة في عناصر سطح مكتب أكثر مرحًا في الحوسبة الحديثة."
    ],
    "points": 948,
    "commentCount": 275,
    "retryCount": 0,
    "time": 1719348772
  },
  {
    "id": 40793924,
    "title": "محاكي HyperCard",
    "originLink": "https://hcsimulator.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40793924",
    "commentBody": "",
    "originSummary": [
      "يتيح محاكي HyperCard للمستخدمين استيراد وتشغيل حزم HyperCard الكلاسيكية، وهو برنامج شائع من أواخر الثمانينيات وأوائل التسعينيات.",
      "يتأثر المشروع بموقع hypercard.org، وMerveilles HyperJam، وأرشيف الإنترنت، مما يشير إلى وجود اهتمام قوي من المجتمع والتاريخ.",
      "تم تطويره بواسطة Hypervariety Custom Software، يهدف المحاكي إلى الحفاظ على محاكاة وظائف حزم HyperCard الأصلية."
    ],
    "commentSummary": [
      "لقد أشعل محاكي HyperCard الحنين، مذكراً المستخدمين بسهولة الوصول والإبداع في HyperCard مقارنة بالأدوات الحديثة مثل Flash وGamemaker وPico-8.",
      "اقترح المستخدمون بدائل مثل P5js وProcessing وLiveCode، لكنهم لاحظوا أنها تفتقر إلى السحر والبساطة الفريدة لـ HyperCard.",
      "لا يزال تأثير HyperCard الكبير على البرمجة المبكرة وإنشاء الوسائط المتعددة لا يُضاهى على الرغم من التقدمات الحديثة."
    ],
    "points": 276,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1719351280
  },
  {
    "id": 40792740,
    "title": "إصلاح QuickLook (2023)",
    "originLink": "https://foon.uk/fixing-quicklook/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40792740",
    "commentBody": "",
    "originSummary": [
      "بعد الترقية من Mojave إلى Ventura، أصبح QuickLook الآن يقوم بتدوير زوايا الصور، مما يشكل مشكلة للصور وأصول الألعاب وعناصر واجهة المستخدم.",
      "استخدم المؤلف أدوات تصحيح الأخطاء والبرامج النصية لتحديد وتعطيل الإعدادات المسؤولة عن الزوايا المستديرة والحدود في QuickLook.",
      "تم إنشاء نص برمجي لتطبيق هذه التصحيحات على جميع عمليات QuickLook الجارية، مما يعيد الوظائف الأصلية؛ النص الكامل متاح في مستودع مرتبط."
    ],
    "commentSummary": [
      "تناقش المقالة المشكلات المتعلقة بميزة QuickLook في نظام macOS، وتحديدًا كيف تؤثر على دقة العناصر بإضافة حدود وزوايا مستديرة، وهو ما يجده بعض المستخدمين غير ضروري وضار.",
      "تكشف التحقيقات أن رموز macOS لا تزال موجودة في النسخ الإنتاجية، مما يجعلها قابلة للتعديل بسهولة، وتقترح أن تعيد Apple التغييرات التي أجرتها على QuickLook.",
      "تتضمن المناقشة آراء متنوعة حول تغييرات تصميم macOS، حيث يعبر بعض المستخدمين عن عدم رضاهم عن الاتجاه الذي اتخذته شركة Apple منذ إصدار Big Sur، خاصة فيما يتعلق بتناسق واجهة المستخدم وسهولة الوصول."
    ],
    "points": 220,
    "commentCount": 38,
    "retryCount": 0,
    "time": 1719344708
  },
  {
    "id": 40794786,
    "title": "مقدمة موجزة في الحساب الفاصلي",
    "originLink": "https://buttondown.email/hillelwayne/archive/a-brief-introduction-to-interval-arithmetic/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40794786",
    "commentBody": "",
    "originSummary": [
      "تعالج الحسابات الفاصلة عدم دقة القياسات من خلال تمثيل القيم كمدى، مما يوفر حدودًا للرقم الصحيح بدلاً من قيمة عائمة واحدة غير دقيقة.",
      "بينما يمكن أن توفر الحسابات الفاصلة نتائج أكثر دقة، إلا أنها قد تؤدي أيضًا إلى حدود كبيرة جدًا، مما يجعلها أقل عملية، كما أشار ويليام كاهان، مبتكر معيار IEEE-754.",
      "الأرقام العالمية لجون غوستافسون هي تطور حديث في هذا المجال، على الرغم من أنه من غير المؤكد ما إذا كانت نسخته من الأرقام الموجبة تتضمن الفواصل الزمنية؛ فإن منافسته مع كاهان تضيف ديناميكية مثيرة للاهتمام إلى النقاش."
    ],
    "commentSummary": [
      "يُستخدم الحساب الفاصلي في الآلة الحاسبة البيانية للتعامل مع الصيغ دون حلها من أجل y، من خلال إعادة ترتيب المعادلات وحساب فواصل النتائج لنطاقات x و y.",
      "تتضمن الطريقة تقسيم النطاقات بشكل متكرر وإجراء عمليات بحث ثنائية للعثور على فواصل زمنية صغيرة تحتوي على حلول، والتي يتم رسمها بعد ذلك كنقاط على الرسم البياني.",
      "يتم تسليط الضوء على هذا النهج لتطبيقه في مجالات مختلفة، بما في ذلك تحليل الفهرس في قواعد البيانات مثل ClickHouse، وإمكانيته لإجراء الحسابات العددية الدقيقة."
    ],
    "points": 196,
    "commentCount": 79,
    "retryCount": 0,
    "time": 1719357302
  },
  {
    "id": 40800869,
    "title": "مليون مربعات اختيار",
    "originLink": "https://onemillioncheckboxes.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40800869",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "مشروع \"مليون مربعات اختيار\" هو مشروع ويب حيث يمكن للمستخدمين بشكل تعاوني تحديد وإلغاء تحديد مليون مربع اختيار، مما اكتسب شعبية كبيرة بشكل غير متوقع وتسبب في مشاكل في الخادم.",
      "يستخدم المشروع خادم Flask، وRedis لتخزين bitset، وWebSockets للتحديثات، وReact-Window للعرض، مما يعرض مزيجًا من التقنيات للتعامل مع التفاعلات في الوقت الفعلي.",
      "الطبيعة الفوضوية والتعاونية للمشروع قد أثارت مجموعة متنوعة من التفاعلات بين المستخدمين، بدءًا من المنافسة المرحة وصولاً إلى المناقشات التقنية حول تحسين الأداء والتعامل مع اتصالات WebSocket."
    ],
    "points": 194,
    "commentCount": 75,
    "retryCount": 0,
    "time": 1719414158
  },
  {
    "id": 40792684,
    "title": "خرق بيانات الأرنب: يمكن تنزيل جميع الردود r1 التي تم تقديمها على الإطلاق",
    "originLink": "https://rabbitu.de/articles/security-disclosure-1",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40792684",
    "commentBody": "",
    "originSummary": [
      "في 16 مايو 2024، اكتشف فريق Rabbitude مفاتيح API مدمجة بشكل حرج في قاعدة كود Rabbit، مما يشكل مخاطر أمنية كبيرة.",
      "تسمح هذه المفاتيح بالوصول غير المصرح به إلى المعلومات الشخصية، وإمكانية تعطيل أجهزة R1، وتغيير الردود، واستبدال الأصوات، مما يؤثر على خدمات مثل ElevenLabs وAzure وYelp وGoogle Maps.",
      "على الرغم من إدراكهم للمشكلة، لم يقم فريق Rabbit بإبطال المفاتيح، مما يبرز مخاوف أمنية خطيرة لمستخدمي R1."
    ],
    "commentSummary": [
      "تعرضت شركة Rabbit الناشئة في مجال الذكاء الاصطناعي لاختراق بيانات حيث يمكن تنزيل جميع استجابات R1، مما أثار مخاوف بشأن ممارسات تكنولوجيا المعلومات وإجراءات الأمان الخاصة بهم.",
      "ألغت الشركة المفتاح بعد الاختراق، مما أدى إلى تعطل R1s بسبب عدم تحديث مفتاح الخادم، مما يبرز الإهمال المحتمل في التعامل مع مفاتيح API.",
      "أثار الحادث مناقشات حول موثوقية الشركات الناشئة في مجال الذكاء الاصطناعي، وأهمية التعامل الآمن مع البيانات، والتداعيات الأوسع لانتهاكات البيانات في خدمات الذكاء الاصطناعي."
    ],
    "points": 171,
    "commentCount": 32,
    "retryCount": 0,
    "time": 1719344397
  },
  {
    "id": 40795227,
    "title": "غلاف الألبوم لفيل هارتمان (2022)",
    "originLink": "https://www.conorherbert.com/music/the-album-art-of-phil-hartmann",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40795227",
    "commentBody": "",
    "originSummary": [
      "قبل أن يكتسب شهرة كممثل، كان فيل هارتمان، الذي كان اسمه الأصلي فيل هارتمان، يصمم أغلفة الألبومات لفرق الروك في الساحل الغربي.",
      "درس هارتمان الفن في كلية مدينة سانتا مونيكا وجامعة ولاية كاليفورنيا، وابتكر أغلفة بارزة لفرق مثل بوكو وأمريكا حتى عام 1984.",
      "انتهت مسيرته في تصميم الجرافيك عندما انضم إلى برنامج \"Saturday Night Live\" في عام 1986، مما شكل انتقالًا من الفن إلى الكوميديا والتمثيل."
    ],
    "commentSummary": [
      "كان فيل هارتمان مشهورًا بموهبته المتعددة، لا سيما تجسيده لرونالد ريغان في برنامج SNL ومساهمته في \"Newsradio\" و\"Kiki’s Delivery Service\".",
      "لقد كانت له مسيرة مهنية متنوعة، شملت ارتباطات مع بي-وي هيرمان وتصميم أغلفة ألبومات لفرق موسيقية شهيرة.",
      "إرث هارتمان يستمر من خلال أدواره التي لا تُنسى والتأثير الدائم لأدائه."
    ],
    "points": 156,
    "commentCount": 32,
    "retryCount": 0,
    "time": 1719361669
  },
  {
    "id": 40795404,
    "title": "المحكمة العليا في البرازيل تلغي تجريم الماريجوانا",
    "originLink": "https://www.bloomberg.com/news/articles/2024-06-25/brazil-supreme-court-decriminalizes-marijuana-for-personal-use",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40795404",
    "commentBody": "",
    "originSummary": [
      "قامت المحكمة العليا في البرازيل بإلغاء تجريم حيازة الماريجوانا للاستخدام الشخصي بأغلبية الأصوات، مما أزال العقوبات الجنائية دون تقنينها.",
      "لقد تسبب القرار في توتر مع الكونغرس، الذي قد تكون له آراء مختلفة بشأن المسألة.",
      "لم تقم المحكمة بعد بتحديد الكمية المحددة التي تميز الاستخدام الشخصي عن الاتجار."
    ],
    "commentSummary": [
      "قامت المحكمة العليا في البرازيل بإلغاء تجريم الماريجوانا، موضحة القانون الغامض لعام 2006 بشأن الكمية التي تشكل جريمة.",
      "نشأت القرار من قضية أدين فيها رجل بحيازة 3 جرامات من الماريجوانا، مما أبرز التناقضات في أحكام المحاكم الأدنى.",
      "سمح قانون عام 2006 بتصنيف الأدوية من قبل أنفيسا، وهي إدارة الغذاء والدواء البرازيلية، مما يشير إلى أن الرئيس يمكنه التأثير على سياسة الأدوية من خلال تعيين مسؤولين ليبراليين في أنفيسا."
    ],
    "points": 146,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1719363657
  },
  {
    "id": 40799038,
    "title": "نصف العمال حول العالم يعانون من الإرهاق الوظيفي",
    "originLink": "https://www.bcg.com/press/11june2024-half-of-workers-around-the-world-struggling-with-burnout",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40799038",
    "commentBody": "",
    "originSummary": [
      "تكشف دراسة لمجموعة بوسطن الاستشارية (BCG) أن 48% من العمال في ثماني دول يعانون من الإرهاق، بناءً على استطلاع شمل 11,000 عامل.",
      "تُبرز الدراسة أن الشعور بالاندماج في العمل يمكن أن يقلل من احتمالية الاحتراق الوظيفي إلى النصف، مع كون العوامل الرئيسية هي الوصول إلى الموارد، الدعم الإداري، الأمان النفسي، والفرص العادلة.",
      "معدلات الإرهاق أعلى بين النساء، والأفراد من مجتمع الميم، والأشخاص ذوي الإعاقة، والعاملين بدون مكاتب، الذين يبلغون أيضًا عن مستويات أقل من الشمول."
    ],
    "commentSummary": [
      "تشير دراسة استقصائية حديثة إلى أن نصف القوى العاملة العالمية تعاني من الإرهاق، على الرغم من أن مصطلح \"الإرهاق\" يُستخدم غالبًا بشكل فضفاض لوصف مجموعة واسعة من الإحباطات المتعلقة بالعمل والتعب المتقطع.",
      "المسح الذي أجرته مجموعة بوسطن الاستشارية (BCG) هو مسح ذاتي الإبلاغ، مما قد يزيد من عدد الأشخاص الذين يدعون الإرهاق بسبب التفسير الواسع للمصطلح.",
      "تسلط المناقشة الضوء على الفرق بين الشكاوى العادية من الإرهاق والحالات الشديدة التي تتطلب وقتًا طويلاً للتعافي، مما يؤكد الحاجة إلى تعريف أوضح وفهم أفضل للإرهاق في مكان العمل."
    ],
    "points": 137,
    "commentCount": 170,
    "retryCount": 0,
    "time": 1719403805
  },
  {
    "id": 40799791,
    "title": "R2R V2 – محرك RAG مفتوح المصدر مع ميزات إنتاجية",
    "originLink": "https://github.com/SciPhi-AI/R2R",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40799791",
    "commentBody": "",
    "originSummary": [
      "أصدر R2R، وهو محرك إجابات مفتوح المصدر يعتمد على تقنية RAG (توليد معزز بالاسترجاع)، تحديثًا رئيسيًا يركز على استيعاب البيانات متعددة الوسائط، والبحث الهجين، وتقنيات RAG المتقدمة، وبناء الرسوم البيانية المعرفية تلقائيًا.",
      "يُعالج التحديث التحديات التي يواجهها المطورون مع حلول RAG الحالية، حيث يقدم تحسينات في المراقبة، وإمكانية التخصيص، وواجهة برمجة تطبيقات RESTful لتسهيل النشر والتعديل.",
      "تشمل المشاريع الحالية تحسين تقسيم النصوص الدلالية، وتدريب نموذج مخصص لبناء الرسوم البيانية المعرفية، وتحسين الأذونات التحليلية الدقيقة والتحليلات، مع توفر دليل بدء سريع للتثبيت السهل."
    ],
    "commentSummary": [
      "R2R V2 هو محرك RAG (توليد معزز بالاسترجاع) مفتوح المصدر مبني على Postgres وNeo4j، يركز على ميزات الإنتاج بناءً على ملاحظات المطورين.",
      "تشمل الميزات الرئيسية استيعاب البيانات متعددة الوسائط، البحث الهجين، تقنيات RAG المتقدمة، بناء تلقائي لرسوم المعرفة البيانية، والمراقبة والتخصيص المدمجين.",
      "يُعالج التحديث التحديات المتعلقة بالأدوات الحالية مثل Langchain، حيث يقدم تجربة محسنة للمطورين، ونشر سريع، وضبط، مع تطبيقات تتراوح من توليد العملاء المحتملين بين الشركات إلى مساعدي البحث."
    ],
    "points": 136,
    "commentCount": 40,
    "retryCount": 0,
    "time": 1719408434
  },
  {
    "id": 40800734,
    "title": "إذا كنت تستخدم كود Polyfill.io على موقعك – قم بإزالته فورًا",
    "originLink": "https://www.theregister.com/2024/06/25/polyfillio_china_crisis/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40800734",
    "commentBody": "",
    "originSummary": [
      "Polyfill.io، الذي كان يُستخدم سابقًا لتوفير polyfills لجافا سكريبت، يوزع الآن برامج ضارة بعد أن تم الاستحواذ عليه من قبل منظمة صينية، مما يؤثر على أكثر من 100,000 موقع ويب.",
      "جوجل تحظر الإعلانات على المواقع المتضررة وقد نبهت أصحاب المواقع، بينما تحذر شركات الأمن من الشيفرة الخبيثة التي يتم تقديمها.",
      "قام مزودو شبكات توصيل المحتوى (CDN) الشهيرون مثل Fastly وCloudflare بإنشاء مرايا لمساعدة المواقع في الانتقال بعيدًا عن النطاق المخترق."
    ],
    "commentSummary": [
      "كان نطاق Polyfill.io يقوم بحقن البرمجيات الخبيثة في الأجهزة المحمولة منذ فبراير، مما أثر على العديد من المواقع الإلكترونية.",
      "تشمل المواقع البارزة المتأثرة JSTOR وIntuit والمنتدى الاقتصادي العالمي.",
      "يُنصح المستخدمون بإزالة كود Polyfill.io من مواقعهم على الفور لمنع حدوث مشاكل إضافية."
    ],
    "points": 126,
    "commentCount": 7,
    "retryCount": 0,
    "time": 1719413332
  },
  {
    "id": 40797130,
    "title": "جوجل تتخلى عن التمرير المستمر في نتائج البحث",
    "originLink": "https://searchengineland.com/google-dropping-continuous-scroll-in-search-results-443529",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40797130",
    "commentBody": "",
    "originSummary": [
      "جوجل ستتوقف عن استخدام التمرير المستمر في نتائج البحث، وستعود إلى شريط الترقيم الكلاسيكي، بدءًا من 25 يونيو 2024 لأجهزة الكمبيوتر المكتبية ولاحقًا للأجهزة المحمولة.",
      "تم تقديم التمرير المستمر لأول مرة في البحث على الهواتف المحمولة في أكتوبر 2021 وعلى أجهزة الكمبيوتر المكتبية في ديسمبر 2022، لكنه لم يزد من رضا المستخدمين بشكل كبير.",
      "قد يؤثر هذا التغيير على نقرات الموقع وبيانات Search Console، كما أشار باري شوارتز، المحرر المساهم في موقع Search Engine Land."
    ],
    "commentSummary": [
      "تتوقف جوجل عن استخدام التمرير المستمر في نتائج البحث، على الأرجح لأن معظم الاستفسارات تعود بأقل من 40 نتيجة ذات صلة.",
      "واجه التمرير المستمر انتقادات بسبب التنفيذ السيء، بما في ذلك مشاكل في التنقل للخلف وصعوبة في العثور على نتائج محددة.",
      "عدم رضا المستخدمين عن جودة البحث في جوجل دفع البعض إلى التحول إلى محركات بحث بديلة مثل DuckDuckGo."
    ],
    "points": 122,
    "commentCount": 106,
    "retryCount": 0,
    "time": 1719385018
  },
  {
    "id": 40799090,
    "title": "أشباح في متحف أونتاريو الملكي (2012)",
    "originLink": "https://www.nycresistor.com/2012/08/21/ghosts-in-the-rom/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40799090",
    "commentBody": "",
    "originSummary": [
      "اكتشف الباحثون الذين يفحصون صور ذاكرة القراءة فقط (ROM) لجهاز Apple Mac SE بيانات صورة مخفية، تكشف عن صورة مشوهة لأشخاص ورسالة من 20 نوفمبر 1986.",
      "تم استرجاع ذاكرة القراءة فقط (ROM) من جهاز Macintosh SE مهمل وتحليلها باستخدام جهاز PROMdate، مما أكد وجود صور سرية في عنوان ذاكرة محدد.",
      "تم فك تشفير الصور المخفية عن طريق تحويل التفريغ الثنائي إلى ملف ELF وتفكيكه، مما كشف عن عملية رسم الصورة النقطية على الشاشة من خلال فخ التعليمات غير القانونية وأدوات ماكنتوش."
    ],
    "commentSummary": [
      "تتناول المقالة بيض عيد الفصح الذي يثير الحنين والمخبأ في ذاكرة القراءة فقط (ROM) لأجهزة الكمبيوتر القديمة، مع مساهمات من المهندسين الأصليين مثل تيري أ. ديفيس.",
      "يشارك المستخدمون ذكرياتهم الشخصية عن اكتشاف هذه البيضات المفاجئة على أجهزة مختلفة، مثل Apple IIci وCommodore Amiga وأجهزة Radio Shack.",
      "تُقدَّم روابط إلى وثائق مفصلة ومناقشات حول هذه البيضات المفاجئة، مما يبرز الثقافة المرحة والإبداعية للهندسة الحاسوبية المبكرة."
    ],
    "points": 114,
    "commentCount": 13,
    "retryCount": 0,
    "time": 1719404146
  },
  {
    "id": 40797217,
    "title": "FICO وكارتل مكاتب الائتمان",
    "originLink": "https://www.thebignewsletter.com/p/inside-fico-and-the-credit-bureau",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40797217",
    "commentBody": "",
    "originSummary": [
      "يواجه مقرضو الرهن العقاري تكاليف متزايدة واحتمالات الإغلاق بسبب احتكار من قبل شركات Experian وTransUnion وEquifax وFICO.",
      "روهيت شوبرا، مدير مكتب الحماية المالية للمستهلكين (CFPB)، يدعو إلى اتخاذ تدابير تنظيمية لتحديد الأسعار وزيادة المنافسة في صناعة تقارير الائتمان.",
      "يسعى مكتب الحماية المالية للمستهلك للحصول على مدخلات من الجمهور وهناك دعوات لإجراء تحقيقات في مكافحة الاحتكار واتخاذ إجراءات تشريعية لمعالجة هذه الممارسات الاحتكارية."
    ],
    "commentSummary": [
      "منذ عشرين عامًا، ساعدت شركتا Experian وFair Isaac، بتمويل من الوكالة الأمريكية للتنمية الدولية (USAID)، في إنشاء نظام مكتب الائتمان في كازاخستان، والذي يُعتبر الآن أكثر عدالة وكفاءة من النظام الأمريكي.",
      "ترخص حكومة كازاخستان مكاتب الائتمان وتدير مكتبها الخاص، مما يعزز التسعير التنافسي والابتكار، حيث تقوم البنوك بالإبلاغ إلى جميع المكاتب المرخصة وتقديم البيانات الخام لحساب الدرجات.",
      "تُقارن المقالة ذلك بنظام الولايات المتحدة الذي يعتمد على درجات FICO، مسلطةً الضوء على عدم الكفاءة والممارسات الاحتكارية، ومقترحةً أن الاستيلاء التنظيمي والممارسات القديمة تعيق التقدم."
    ],
    "points": 113,
    "commentCount": 102,
    "retryCount": 0,
    "time": 1719386088
  },
  {
    "id": 40796459,
    "title": "التمارين الرياضية المكثفة، التدهور المعرفي، وارتفاع ضغط الدم",
    "originLink": "https://alz-journals.onlinelibrary.wiley.com/doi/full/10.1002/alz.13887",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40796459",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "يحقق أصحاب المصلحة في صناعة الرعاية الصحية أرباحًا أكبر من معالجة المشكلات الصحية بدلاً من الوقاية منها، مما يؤدي إلى استثمارات أعلى في الأدوية والعلاجات بدلاً من التدابير الوقائية.",
      "يمكن أن تشجع الحلول القائمة على السوق، مثل الإعفاءات الضريبية لصالات الألعاب الرياضية وتحسين سياسات النقل، على أنماط حياة أكثر صحة، لكن السياسات العامة غالبًا ما تستهدف السكان بدلاً من الأفراد، مما يؤثر على فعاليتها.",
      "التغييرات النظامية مثل التخطيط الحضري الأفضل والدعم المالي للأنشطة البدنية، إلى جانب التحفيز الفردي، ضرورية لتحسين النتائج الصحية، حيث يواجه العديد من الأشخاص صعوبة في الحفاظ على العادات الصحية بسبب قيود مختلفة."
    ],
    "points": 105,
    "commentCount": 126,
    "retryCount": 0,
    "time": 1719377120
  }
]
