[
  {
    "id": 40793465,
    "title": "Μπάλα: Μια μπάλα που ζει στην αποβάθρα σας",
    "originLink": "https://github.com/nate-parrott/ball",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40793465",
    "commentBody": "",
    "originSummary": [
      "Η \"Μπάλα\" είναι μια μικρή, διαδραστική κόκκινη μπάλα που μπορεί να σύρεται, να πετιέται και να αναπηδά στην οθόνη σας, προσφέροντας απλή διασκέδαση.",
      "Εμπνευσμένο από το widget του Nate Heagy για το OS X Dashboard, αυτή η έκδοση περιλαμβάνει κινούμενα σχέδια που επιτρέπουν στη μπάλα να βγαίνει από το dock, χάρη στην καθοδήγηση του Wessley Roche.",
      "Η εφαρμογή προσφέρει μια παιχνιδιάρικη εμπειρία, επιτρέποντας στους χρήστες να δουν πόσες φορές μπορεί η μπάλα να αναπηδήσει ή να χτυπήσει τον τοίχο."
    ],
    "commentSummary": [
      "Ένα έργο στο GitHub με το όνομα \"Ball\" εισάγει μια αναπηδούσα μπάλα στη γραμμή εργαλείων σας, θυμίζοντας νοσταλγικά παιχνίδια επιφάνειας εργασίας.",
      "Οι εμπειρίες των χρηστών είναι ανάμεικτες· κάποιοι το βρίσκουν διασκεδαστικό, ενώ άλλοι αντιμετωπίζουν προβλήματα με τη χρήση στην παραγωγή και την υποστήριξη από τους προγραμματιστές.",
      "Το έργο έχει προκαλέσει νοσταλγία για παιχνιδιάρικα βοηθητικά προγράμματα επιφάνειας εργασίας από το παρελθόν, όπως το Neko, το Bonzi Buddy και διάφορα screensavers, υπογραμμίζοντας την επιθυμία για πιο φανταστικά στοιχεία επιφάνειας εργασίας στη σύγχρονη πληροφορική."
    ],
    "points": 948,
    "commentCount": 275,
    "retryCount": 0,
    "time": 1719348772
  },
  {
    "id": 40793924,
    "title": "Προσομοιωτής HyperCard",
    "originLink": "https://hcsimulator.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40793924",
    "commentBody": "",
    "originSummary": [
      "Το HyperCard Simulator επιτρέπει στους χρήστες να εισάγουν και να εκτελούν κλασικές στοίβες HyperCard, ένα δημοφιλές λογισμικό από τα τέλη της δεκαετίας του 1980 και τις αρχές της δεκαετίας του 1990.",
      "Το έργο επηρεάζεται από το hypercard.org, το Merveilles HyperJam και το Internet Archive, υποδεικνύοντας ένα ισχυρό ενδιαφέρον της κοινότητας και της ιστορίας.",
      "Αναπτύχθηκε από την Hypervariety Custom Software, ο προσομοιωτής στοχεύει στη διατήρηση και προσομοίωση της λειτουργικότητας των αρχικών HyperCard στοίβων."
    ],
    "commentSummary": [
      "«Ο προσομοιωτής HyperCard έχει αναζωπυρώσει τη νοσταλγία, υπενθυμίζοντας στους χρήστες την προσβασιμότητα και τη δημιουργικότητα του HyperCard σε σύγκριση με σύγχρονα εργαλεία όπως το Flash, το Gamemaker και το Pico-8.»",
      "Οι χρήστες πρότειναν εναλλακτικές όπως το P5js, το Processing και το LiveCode, αλλά σημείωσαν ότι τους λείπει η μοναδική γοητεία και απλότητα του HyperCard.",
      "Η σημαντική επιρροή του HyperCard στον πρώιμο προγραμματισμό και τη δημιουργία πολυμέσων παραμένει αξεπέραστη παρά τις σύγχρονες εξελίξεις."
    ],
    "points": 276,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1719351280
  },
  {
    "id": 40792740,
    "title": "Διόρθωση QuickLook (2023)",
    "originLink": "https://foon.uk/fixing-quicklook/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40792740",
    "commentBody": "",
    "originSummary": [
      "Μετά την αναβάθμιση από Mojave σε Ventura, το QuickLook τώρα στρογγυλεύει τις γωνίες των εικόνων, κάτι που είναι προβληματικό για φωτογραφίες, στοιχεία παιχνιδιών και στοιχεία διεπαφής χρήστη.",
      "Ο συγγραφέας χρησιμοποίησε εργαλεία αποσφαλμάτωσης και σενάρια για να εντοπίσει και να απενεργοποιήσει τις ρυθμίσεις που ευθύνονται για τις στρογγυλεμένες γωνίες και το περίγραμμα στο QuickLook.",
      "Δημιουργήθηκε ένα σενάριο για την εφαρμογή αυτών των επιδιορθώσεων σε όλες τις τρέχουσες διεργασίες QuickLook, αποκαθιστώντας την αρχική λειτουργικότητα· το πλήρες σενάριο είναι διαθέσιμο σε ένα συνδεδεμένο αποθετήριο."
    ],
    "commentSummary": [
      "Το άρθρο συζητά τα προβλήματα με το QuickLook στο macOS, συγκεκριμένα πώς αλλάζει την ακρίβεια των αντικειμένων προσθέτοντας περιγράμματα και στρογγυλεμένες γωνίες, κάτι που ορισμένοι χρήστες θεωρούν περιττό και επιζήμιο.",
      "Η έρευνα αποκαλύπτει ότι τα σύμβολα του macOS εξακολουθούν να υπάρχουν στις εκδόσεις παραγωγής, καθιστώντας τα εύκολα τροποποιήσιμα, και προτείνει ότι η Apple θα πρέπει να επαναφέρει τις αλλαγές στο QuickLook.",
      "Η συζήτηση περιλαμβάνει διάφορες απόψεις σχετικά με τις αλλαγές στο σχεδιασμό του macOS, με ορισμένους χρήστες να εκφράζουν δυσαρέσκεια για την κατεύθυνση που έχει πάρει η Apple από την έκδοση Big Sur, ιδιαίτερα όσον αφορά τη συνέπεια του UI και την προσβασιμότητα."
    ],
    "points": 220,
    "commentCount": 38,
    "retryCount": 0,
    "time": 1719344708
  },
  {
    "id": 40794786,
    "title": "Μια σύντομη εισαγωγή στην αριθμητική διαστημάτων",
    "originLink": "https://buttondown.email/hillelwayne/archive/a-brief-introduction-to-interval-arithmetic/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40794786",
    "commentBody": "",
    "originSummary": [
      "Η αριθμητική διαστημάτων αντιμετωπίζει τις ανακρίβειες μέτρησης αντιπροσωπεύοντας τις τιμές ως διαστήματα, παρέχοντας όρια για τον σωστό αριθμό αντί για μία και μόνο ασαφή τιμή κινητής υποδιαστολής.",
      "Ενώ η αριθμητική διαστημάτων μπορεί να προσφέρει πιο ακριβή αποτελέσματα, μπορεί επίσης να οδηγήσει σε υπερβολικά μεγάλα όρια, καθιστώντας την λιγότερο πρακτική, όπως σημείωσε ο William Kahan, ο δημιουργός του προτύπου IEEE-754.",
      "Οι καθολικοί αριθμοί του John Gustafson είναι μια πρόσφατη εξέλιξη σε αυτόν τον τομέα, αν και είναι αβέβαιο αν η εκδοχή του με posit περιλαμβάνει διαστήματα. Η αντιπαλότητά του με τον Kahan προσθέτει μια ενδιαφέρουσα δυναμική στη συζήτηση."
    ],
    "commentSummary": [
      "Η αριθμητική διαστημάτων χρησιμοποιείται σε μια γραφική αριθμομηχανή για να χειρίζεται τύπους χωρίς να επιλύει για το y, αναδιατάσσοντας εξισώσεις και υπολογίζοντας διαστήματα αποτελεσμάτων για τις περιοχές x και y.",
      "Η μέθοδος περιλαμβάνει την αναδρομική διαίρεση των διαστημάτων και την εκτέλεση δυαδικών αναζητήσεων για να βρεθούν μικρά διαστήματα με λύσεις, οι οποίες στη συνέχεια σχεδιάζονται ως σημεία στο γράφημα.",
      "Αυτή η προσέγγιση επισημαίνεται για την εφαρμογή της σε διάφορους τομείς, συμπεριλαμβανομένης της ανάλυσης δεικτών σε βάσεις δεδομένων όπως το ClickHouse, και το δυναμικό της για αυστηρούς αριθμητικούς υπολογισμούς."
    ],
    "points": 196,
    "commentCount": 79,
    "retryCount": 0,
    "time": 1719357302
  },
  {
    "id": 40800869,
    "title": "Ένα Εκατομμύριο Πλαίσια Ελέγχου",
    "originLink": "https://onemillioncheckboxes.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40800869",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Το \"Ένα Εκατομμύριο Κουτάκια Επιλογής\" είναι ένα διαδικτυακό έργο όπου οι χρήστες μπορούν να επιλέγουν και να αποεπιλέγουν ένα εκατομμύριο κουτάκια επιλογής συνεργατικά, αποκτώντας απροσδόκητα μεγάλη δημοτικότητα και προκαλώντας προβλήματα στον διακομιστή.",
      "Το έργο χρησιμοποιεί έναν διακομιστή Flask, το Redis για αποθήκευση bitset, WebSockets για ενημερώσεις και το React-Window για απόδοση, παρουσιάζοντας έναν συνδυασμό τεχνολογιών για τη διαχείριση αλληλεπιδράσεων σε πραγματικό χρόνο.",
      "Η χαοτική και συνεργατική φύση του έργου έχει προκαλέσει μια ποικιλία αλληλεπιδράσεων χρηστών, από παιχνιδιάρικους ανταγωνισμούς μέχρι τεχνικές συζητήσεις για τη βελτιστοποίηση της απόδοσης και τη διαχείριση των συνδέσεων WebSocket."
    ],
    "points": 194,
    "commentCount": 75,
    "retryCount": 0,
    "time": 1719414158
  },
  {
    "id": 40792684,
    "title": "Παραβίαση δεδομένων Rabbit: όλες οι απαντήσεις r1 που έχουν δοθεί ποτέ μπορούν να ληφθούν",
    "originLink": "https://rabbitu.de/articles/security-disclosure-1",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40792684",
    "commentBody": "",
    "originSummary": [
      "Στις 16 Μαΐου 2024, η ομάδα Rabbitude ανακάλυψε κρίσιμα σκληροκωδικοποιημένα κλειδιά API στον κώδικα του Rabbit, που αποτελούν σημαντικούς κινδύνους για την ασφάλεια.",
      "Αυτά τα κλειδιά επιτρέπουν μη εξουσιοδοτημένη πρόσβαση σε προσωπικές πληροφορίες, τη δυνατότητα απενεργοποίησης συσκευών R1, την αλλαγή απαντήσεων και την αντικατάσταση φωνών, επηρεάζοντας υπηρεσίες όπως το ElevenLabs, το Azure, το Yelp και το Google Maps.",
      "Παρά το γεγονός ότι είναι ενήμερη για το πρόβλημα, η ομάδα του Rabbit δεν έχει ακυρώσει τα κλειδιά, επισημαίνοντας σοβαρές ανησυχίες για την ασφάλεια των χρηστών του R1."
    ],
    "commentSummary": [
      "Η Rabbit, μια startup τεχνητής νοημοσύνης, υπέστη παραβίαση δεδομένων όπου όλες οι απαντήσεις R1 μπορούσαν να ληφθούν, προκαλώντας ανησυχίες σχετικά με τις πρακτικές πληροφορικής και τα μέτρα ασφαλείας τους.",
      "Η εταιρεία ανακάλεσε το κλειδί μετά την παραβίαση, γεγονός που προκάλεσε προβλήματα στα R1s λόγω μη ενημέρωσης του κλειδιού του διακομιστή, υπογραμμίζοντας πιθανή αμέλεια στη διαχείριση των κλειδιών API.",
      "Το περιστατικό έχει προκαλέσει συζητήσεις σχετικά με την αξιοπιστία των νεοφυών επιχειρήσεων τεχνητής νοημοσύνης, τη σημασία της ασφαλούς διαχείρισης δεδομένων και τις ευρύτερες επιπτώσεις των παραβιάσεων δεδομένων στις υπηρεσίες τεχνητής νοημοσύνης."
    ],
    "points": 171,
    "commentCount": 32,
    "retryCount": 0,
    "time": 1719344397
  },
  {
    "id": 40795227,
    "title": "Το εξώφυλλο του άλμπουμ του Phil Hartmann (2022)",
    "originLink": "https://www.conorherbert.com/music/the-album-art-of-phil-hartmann",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40795227",
    "commentBody": "",
    "originSummary": [
      "Πριν αποκτήσει φήμη ως ηθοποιός, ο Phil Hartman, αρχικά Phil Hartmann, σχεδίαζε εξώφυλλα άλμπουμ για ροκ συγκροτήματα της Δυτικής Ακτής.",
      "Ο Χάρτμαν σπούδασε τέχνη στο Santa Monica City College και στο California State University, δημιουργώντας αξιοσημείωτα εξώφυλλα για συγκροτήματα όπως οι Poco και οι America μέχρι το 1984.",
      "Η καριέρα του στη γραφιστική τελείωσε όταν εντάχθηκε στο \"Saturday Night Live\" το 1986, σηματοδοτώντας μια μετάβαση από την τέχνη στην κωμωδία και την υποκριτική."
    ],
    "commentSummary": [
      "Ο Phil Hartman ήταν γνωστός για το πολυδιάστατο ταλέντο του, ιδιαίτερα για την απεικόνιση του Ronald Reagan στο SNL και τη συμβολή του στο \"Newsradio\" και το \"Kiki’s Delivery Service.\"",
      "Είχε μια ποικιλόμορφη καριέρα, συμπεριλαμβανομένων συνδέσεων με τον Pee-Wee Herman και τη δημιουργία εξωφύλλων άλμπουμ για διάσημα συγκροτήματα.",
      "Η κληρονομιά του Hartman διαρκεί μέσα από τους αξέχαστους ρόλους του και τη διαρκή επίδραση των ερμηνειών του."
    ],
    "points": 156,
    "commentCount": 32,
    "retryCount": 0,
    "time": 1719361669
  },
  {
    "id": 40795404,
    "title": "Το Ανώτατο Δικαστήριο της Βραζιλίας αποποινικοποιεί τη μαριχουάνα",
    "originLink": "https://www.bloomberg.com/news/articles/2024-06-25/brazil-supreme-court-decriminalizes-marijuana-for-personal-use",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40795404",
    "commentBody": "",
    "originSummary": [
      "Το Ανώτατο Δικαστήριο της Βραζιλίας αποποινικοποίησε την κατοχή μαριχουάνας για προσωπική χρήση με πλειοψηφική ψήφο, αφαιρώντας τις ποινικές κυρώσεις αλλά χωρίς να την νομιμοποιήσει.",
      "Η απόφαση έχει προκαλέσει ένταση με το Κογκρέσο, το οποίο μπορεί να έχει διαφορετικές απόψεις για το θέμα.",
      "Το Δικαστήριο δεν έχει ακόμη καθορίσει την συγκεκριμένη ποσότητα που διαχωρίζει την προσωπική χρήση από την εμπορία."
    ],
    "commentSummary": [
      "Το Ανώτατο Δικαστήριο της Βραζιλίας έχει αποποινικοποιήσει τη μαριχουάνα, διευκρινίζοντας τον προηγουμένως ασαφή νόμο του 2006 σχετικά με την ποσότητα που συνιστά έγκλημα.",
      "Η απόφαση προήλθε από μια υπόθεση όπου ένας άνδρας καταδικάστηκε για κατοχή 3 γραμμαρίων μαριχουάνας, αναδεικνύοντας ασυνέπειες στις αποφάσεις των κατώτερων δικαστηρίων.",
      "Ο νόμος του 2006 επέτρεψε την ταξινόμηση των ναρκωτικών από την Anvisa, την FDA της Βραζιλίας, υποδεικνύοντας ότι ένας πρόεδρος θα μπορούσε να επηρεάσει την πολιτική για τα ναρκωτικά διορίζοντας φιλελεύθερους αξιωματούχους στην Anvisa."
    ],
    "points": 146,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1719363657
  },
  {
    "id": 40799038,
    "title": "Οι μισοί εργαζόμενοι σε όλο τον κόσμο παλεύουν με την εξουθένωση",
    "originLink": "https://www.bcg.com/press/11june2024-half-of-workers-around-the-world-struggling-with-burnout",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40799038",
    "commentBody": "",
    "originSummary": [
      "Μια μελέτη της Boston Consulting Group (BCG) αποκαλύπτει ότι το 48% των εργαζομένων σε οκτώ χώρες βιώνουν εξουθένωση, βάσει μιας έρευνας σε 11.000 εργαζόμενους.",
      "Η μελέτη επισημαίνει ότι το αίσθημα ένταξης στον χώρο εργασίας μπορεί να μειώσει στο μισό την πιθανότητα εξουθένωσης, με βασικούς παράγοντες την πρόσβαση σε πόρους, την υποστήριξη από τη διοίκηση, την ψυχολογική ασφάλεια και τις δίκαιες ευκαιρίες.",
      "Τα ποσοστά επαγγελματικής εξουθένωσης είναι υψηλότερα μεταξύ των γυναικών, των ατόμων LGBTQ+, των ατόμων με αναπηρίες και των εργαζομένων χωρίς γραφείο, οι οποίοι επίσης αναφέρουν χαμηλότερα επίπεδα ένταξης."
    ],
    "commentSummary": [
      "Μια πρόσφατη έρευνα δείχνει ότι το ήμισυ του παγκόσμιου εργατικού δυναμικού βιώνει εξουθένωση, αν και ο όρος \"εξουθένωση\" χρησιμοποιείται συχνά χαλαρά για να περιγράψει ένα ευρύ φάσμα επαγγελματικών απογοητεύσεων και διαλείπουσας κόπωσης.",
      "Η έρευνα, που διεξήχθη από την Boston Consulting Group (BCG), βασίζεται σε αυτοαναφορές, γεγονός που μπορεί να αυξήσει τον αριθμό των ατόμων που δηλώνουν εξάντληση λόγω της ευρείας ερμηνείας του όρου.",
      "Η συζήτηση αναδεικνύει τη διαφορά μεταξύ περιστασιακών παραπόνων για εξάντληση και σοβαρών περιπτώσεων που απαιτούν σημαντικό χρόνο ανάρρωσης, τονίζοντας την ανάγκη για μια σαφέστερη ορισμό και κατανόηση της εξάντλησης στον εργασιακό χώρο."
    ],
    "points": 137,
    "commentCount": 170,
    "retryCount": 0,
    "time": 1719403805
  },
  {
    "id": 40799791,
    "title": "R2R V2 – Μια ανοιχτού κώδικα μηχανή RAG με χαρακτηριστικά παραγωγής",
    "originLink": "https://github.com/SciPhi-AI/R2R",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40799791",
    "commentBody": "",
    "originSummary": [
      "Το R2R, μια ανοιχτού κώδικα μηχανή απαντήσεων RAG (Ανάκτηση-Ενισχυμένη Γενεά), έχει κυκλοφορήσει μια σημαντική ενημέρωση που επικεντρώνεται στην πολυτροπική εισαγωγή δεδομένων, την υβριδική αναζήτηση, τις προηγμένες τεχνικές RAG και την αυτόματη κατασκευή γραφήματος γνώσης.",
      "Η ενημέρωση αντιμετωπίζει τις προκλήσεις των προγραμματιστών με τις υπάρχουσες λύσεις RAG, προσφέροντας βελτιωμένη παρατηρησιμότητα, προσαρμοστικότητα και ένα RESTful API για εύκολη ανάπτυξη και ρύθμιση.",
      "Τα τρέχοντα έργα περιλαμβάνουν την ενίσχυση της σημασιολογικής κατάτμησης, την εκπαίδευση ενός προσαρμοσμένου μοντέλου για την κατασκευή γραφημάτων γνώσης και τη βελτίωση των λεπτομερών αδειών και αναλύσεων, με έναν οδηγό γρήγορης εκκίνησης διαθέσιμο για εύκολη εγκατάσταση."
    ],
    "commentSummary": [
      "Το R2R V2 είναι μια μηχανή RAG (Ανάκτηση-Ενισχυμένη Γενεά) ανοιχτού κώδικα, βασισμένη σε Postgres και Neo4j, που επικεντρώνεται σε χαρακτηριστικά παραγωγής με βάση τα σχόλια των προγραμματιστών.",
      "Τα κύρια χαρακτηριστικά περιλαμβάνουν την πολυτροπική εισαγωγή δεδομένων, την υβριδική αναζήτηση, τις προηγμένες τεχνικές RAG, την αυτόματη κατασκευή γραφήματος γνώσης, καθώς και την ενσωματωμένη παρατηρησιμότητα και προσαρμοστικότητα.",
      "Η ενημέρωση αντιμετωπίζει προκλήσεις με τα υπάρχοντα εργαλεία όπως το Langchain, προσφέροντας βελτιωμένη εμπειρία προγραμματιστή, γρήγορη ανάπτυξη και ρύθμιση, με εφαρμογές που κυμαίνονται από τη δημιουργία B2B leads έως τους ερευνητικούς βοηθούς."
    ],
    "points": 136,
    "commentCount": 40,
    "retryCount": 0,
    "time": 1719408434
  },
  {
    "id": 40800734,
    "title": "Αν χρησιμοποιείτε κώδικα Polyfill.io στον ιστότοπό σας – αφαιρέστε τον αμέσως",
    "originLink": "https://www.theregister.com/2024/06/25/polyfillio_china_crisis/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40800734",
    "commentBody": "",
    "originSummary": [
      "«Το Polyfill.io, που χρησιμοποιούνταν προηγουμένως για JavaScript polyfills, διανέμει τώρα κακόβουλο λογισμικό μετά την εξαγορά του από μια κινεζική οργάνωση, επηρεάζοντας πάνω από 100.000 ιστοσελίδες.»",
      "Η Google μπλοκάρει διαφημίσεις σε επηρεαζόμενες ιστοσελίδες και έχει ειδοποιήσει τους ιδιοκτήτες των ιστοσελίδων, ενώ οι εταιρείες ασφαλείας προειδοποιούν για τον κακόβουλο κώδικα που διανέμεται.",
      "Δημοφιλείς πάροχοι CDN όπως οι Fastly και Cloudflare έχουν δημιουργήσει καθρέφτες για να βοηθήσουν τις ιστοσελίδες στη μετάβαση από τον παραβιασμένο τομέα."
    ],
    "commentSummary": [
      "Το domain του Polyfill.io έχει εισάγει κακόβουλο λογισμικό σε κινητές συσκευές από τον Φεβρουάριο, επηρεάζοντας πολυάριθμες ιστοσελίδες.",
      "Εξέχοντες ιστότοποι που επηρεάστηκαν περιλαμβάνουν το JSTOR, την Intuit και το Παγκόσμιο Οικονομικό Φόρουμ.",
      "Συνιστάται στους χρήστες να αφαιρέσουν τον κώδικα Polyfill.io από τις ιστοσελίδες τους άμεσα για να αποτρέψουν περαιτέρω προβλήματα."
    ],
    "points": 126,
    "commentCount": 7,
    "retryCount": 0,
    "time": 1719413332
  },
  {
    "id": 40797130,
    "title": "Η Google καταργεί τη συνεχή κύλιση στα αποτελέσματα αναζήτησης",
    "originLink": "https://searchengineland.com/google-dropping-continuous-scroll-in-search-results-443529",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40797130",
    "commentBody": "",
    "originSummary": [
      "Η Google διακόπτει τη συνεχή κύλιση στα αποτελέσματα αναζήτησης, επιστρέφοντας στην κλασική μπάρα σελιδοποίησης, ξεκινώντας από τις 25 Ιουνίου 2024 για επιτραπέζιους υπολογιστές και αργότερα για κινητά.",
      "Η συνεχής κύλιση εισήχθη αρχικά στην αναζήτηση για κινητά τον Οκτώβριο του 2021 και στην επιφάνεια εργασίας τον Δεκέμβριο του 2022, αλλά δεν αύξησε σημαντικά την ικανοποίηση των χρηστών.",
      "Αυτή η αλλαγή μπορεί να επηρεάσει τα κλικ στον ιστότοπο και τα δεδομένα του Search Console, όπως σημειώνει ο Barry Schwartz, συνεισφέρων συντάκτης στο Search Engine Land."
    ],
    "commentSummary": [
      "Η Google διακόπτει τη συνεχή κύλιση στα αποτελέσματα αναζήτησης, πιθανότατα επειδή οι περισσότερες αναζητήσεις επιστρέφουν λιγότερα από 40 σχετικά αποτελέσματα.",
      "Η συνεχής κύλιση αντιμετώπισε κριτική για κακή υλοποίηση, συμπεριλαμβανομένων προβλημάτων με την επιστροφή στην προηγούμενη σελίδα και δυσκολία στην εύρεση συγκεκριμένων αποτελεσμάτων.",
      "Η δυσαρέσκεια των χρηστών με την ποιότητα αναζήτησης της Google έχει οδηγήσει ορισμένους να στραφούν σε εναλλακτικές μηχανές αναζήτησης όπως το DuckDuckGo."
    ],
    "points": 122,
    "commentCount": 106,
    "retryCount": 0,
    "time": 1719385018
  },
  {
    "id": 40799090,
    "title": "Φαντάσματα στο ROM (2012)",
    "originLink": "https://www.nycresistor.com/2012/08/21/ghosts-in-the-rom/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40799090",
    "commentBody": "",
    "originSummary": [
      "Ερευνητές που εξέταζαν εικόνες ROM του Apple Mac SE ανακάλυψαν κρυφά δεδομένα εικόνας, αποκαλύπτοντας μια παραμορφωμένη εικόνα ανθρώπων και ένα μήνυμα από τις 20 Νοεμβρίου 1986.",
      "Η ROM ανακτήθηκε από έναν απορριφθέντα Macintosh SE και αναλύθηκε χρησιμοποιώντας μια συσκευή PROMdate, επιβεβαιώνοντας μυστικές εικόνες σε μια συγκεκριμένη διεύθυνση μνήμης.",
      "Οι κρυμμένες εικόνες αποκωδικοποιήθηκαν μετατρέποντας το δυαδικό απόθεμα σε αρχείο ELF και αποσυναρμολογώντας το, αποκαλύπτοντας τη διαδικασία σχεδίασης του bitmap στην οθόνη μέσω μιας παγίδας παράνομης εντολής και του Macintosh Toolbox."
    ],
    "commentSummary": [
      "Η ανάρτηση συζητά νοσταλγικά κρυμμένα Easter eggs στη ROM (Μνήμη Μόνο για Ανάγνωση) παλαιότερων υπολογιστών, με συνεισφορές από αρχικούς μηχανικούς όπως ο Terry A Davis.",
      "Οι χρήστες μοιράζονται προσωπικές αναμνήσεις από την ανακάλυψη αυτών των πασχαλινών αυγών σε διάφορες συσκευές, όπως το Apple IIci, το Commodore Amiga και τους υπολογιστές της Radio Shack.",
      "Παρέχονται σύνδεσμοι προς λεπτομερή τεκμηρίωση και συζητήσεις σχετικά με αυτά τα πασχαλινά αυγά, αναδεικνύοντας την παιχνιδιάρικη και δημιουργική κουλτούρα της πρώιμης μηχανικής υπολογιστών."
    ],
    "points": 114,
    "commentCount": 13,
    "retryCount": 0,
    "time": 1719404146
  },
  {
    "id": 40797217,
    "title": "FICO και το Καρτέλ των Πιστωτικών Γραφείων",
    "originLink": "https://www.thebignewsletter.com/p/inside-fico-and-the-credit-bureau",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40797217",
    "commentBody": "",
    "originSummary": [
      "Οι δανειστές υποθηκών αντιμετωπίζουν αυξημένα κόστη και πιθανές κλεισίματα λόγω μονοπωλίου από τις Experian, TransUnion, Equifax και FICO.",
      "Ο Rohit Chopra, διευθυντής του CFPB, υποστηρίζει τη λήψη ρυθμιστικών μέτρων για τον περιορισμό των τιμών και την αύξηση του ανταγωνισμού στη βιομηχανία πιστωτικής αναφοράς.",
      "Το CFPB ζητά τη γνώμη του κοινού και υπάρχουν εκκλήσεις για έρευνες αντιμονοπωλιακής φύσης και νομοθετική δράση για την αντιμετώπιση αυτών των μονοπωλιακών πρακτικών."
    ],
    "commentSummary": [
      "Πριν από είκοσι χρόνια, η Experian και η Fair Isaac, χρηματοδοτούμενες από την USAID, βοήθησαν στην ίδρυση του συστήματος πιστωτικών γραφείων του Καζακστάν, το οποίο τώρα θεωρείται δικαιότερο και πιο αποτελεσματικό από το σύστημα των ΗΠΑ.",
      "Η κυβέρνηση του Καζακστάν αδειοδοτεί τα πιστωτικά γραφεία και λειτουργεί το δικό της, προωθώντας ανταγωνιστικές τιμές και καινοτομία, με τις τράπεζες να αναφέρουν σε όλα τα αδειοδοτημένα γραφεία και να παρέχουν ακατέργαστα δεδομένα για τον υπολογισμό των βαθμολογιών.",
      "Το άρθρο αντιπαραβάλλει αυτό με την εξάρτηση του συστήματος των ΗΠΑ από τα FICO scores, επισημαίνοντας τις αναποτελεσματικότητες και τις μονοπωλιακές πρακτικές, και προτείνοντας ότι η ρυθμιστική σύλληψη και οι ξεπερασμένες πρακτικές εμποδίζουν την πρόοδο."
    ],
    "points": 113,
    "commentCount": 102,
    "retryCount": 0,
    "time": 1719386088
  },
  {
    "id": 40796459,
    "title": "Έντονη Άσκηση, Γνωστική Εξασθένηση και Υψηλή Αρτηριακή Πίεση",
    "originLink": "https://alz-journals.onlinelibrary.wiley.com/doi/full/10.1002/alz.13887",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40796459",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Οι ενδιαφερόμενοι στον τομέα της υγειονομικής περίθαλψης κερδίζουν περισσότερα από τη θεραπεία των προβλημάτων υγείας παρά από την πρόληψή τους, οδηγώντας σε υψηλότερες επενδύσεις στα φαρμακευτικά προϊόντα και τις θεραπείες παρά στα προληπτικά μέτρα.",
      "Λύσεις βασισμένες στην αγορά, όπως φορολογικές ελαφρύνσεις για γυμναστήρια και βελτιωμένες πολιτικές μεταφορών, θα μπορούσαν να ενθαρρύνουν πιο υγιεινούς τρόπους ζωής, αλλά οι δημόσιες πολιτικές συχνά στοχεύουν πληθυσμούς αντί για άτομα, επηρεάζοντας την αποτελεσματικότητά τους.",
      "Συστημικές αλλαγές όπως ο καλύτερος αστικός σχεδιασμός και οι επιδοτήσεις για φυσικές δραστηριότητες, μαζί με την ατομική κινητοποίηση, είναι απαραίτητες για τη βελτίωση των αποτελεσμάτων υγείας, καθώς πολλοί άνθρωποι δυσκολεύονται να διατηρήσουν υγιεινές συνήθειες λόγω διαφόρων περιορισμών."
    ],
    "points": 105,
    "commentCount": 126,
    "retryCount": 0,
    "time": 1719377120
  }
]
