[
  {
    "id": 40793465,
    "title": "Top: Dock'unuzda yaşayan bir top",
    "originLink": "https://github.com/nate-parrott/ball",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40793465",
    "commentBody": "",
    "originSummary": [
      "\"Ball\", ekranınızda sürüklenebilen, fırlatılabilen ve zıplatılabilen küçük, etkileşimli kırmızı bir top olup, basit bir eğlence sunar.",
      "Bu versiyon, Nate Heagy'nin OS X Dashboard widget'ından ilham alınarak, Wessley Roche'un rehberliği sayesinde topun dock'tan çıkmasına olanak tanıyan animasyonlar içeriyor.",
      "Uygulama, kullanıcıların topun kaç kez zıplayabileceğini veya duvara çarpabileceğini görmelerine olanak tanıyan eğlenceli bir deneyim sunuyor."
    ],
    "commentSummary": [
      "GitHub'da \"Ball\" adlı bir proje, nostaljik masaüstü oyuncaklarını anımsatan bir zıplayan topu dock'unuza getiriyor.",
      "Kullanıcı deneyimleri karışıktır; bazıları eğlenceli bulurken, diğerleri üretim kullanımı ve geliştirici desteği ile ilgili sorunlarla karşılaşmaktadır.",
      "Proje, geçmişteki Neko, Bonzi Buddy ve çeşitli ekran koruyucular gibi eğlenceli masaüstü araçlarına duyulan nostaljiyi ateşledi ve modern bilgisayarlarda daha eğlenceli masaüstü unsurlarına olan arzuyu vurguladı."
    ],
    "points": 948,
    "commentCount": 275,
    "retryCount": 0,
    "time": 1719348772
  },
  {
    "id": 40793924,
    "title": "HyperCard Simülatörü",
    "originLink": "https://hcsimulator.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40793924",
    "commentBody": "",
    "originSummary": [
      "HyperCard Simülatörü, kullanıcıların 1980'lerin sonları ve 1990'ların başlarında popüler olan klasik HyperCard yığınlarını içe aktarmalarına ve çalıştırmalarına olanak tanır.",
      "Proje, hypercard.org, Merveilles HyperJam ve Internet Archive tarafından etkilenmiş olup, güçlü bir topluluk ve tarihsel ilgiye işaret etmektedir.",
      "Hypervariety Custom Software tarafından geliştirilen simülatör, orijinal HyperCard yığınlarının işlevselliğini korumayı ve simüle etmeyi amaçlamaktadır."
    ],
    "commentSummary": [
      "HyperCard Simülatörü, kullanıcılara HyperCard'ın Flash, Gamemaker ve Pico-8 gibi modern araçlara kıyasla erişilebilirliği ve yaratıcılığını hatırlatarak nostalji uyandırdı.",
      "Kullanıcılar P5js, Processing ve LiveCode gibi alternatifler önerdiler ancak bunların HyperCard'ın benzersiz çekiciliği ve sadeliğinden yoksun olduğunu belirttiler.",
      "HyperCard'ın erken dönem programlama ve multimedya yaratımı üzerindeki önemli etkisi, modern ilerlemelere rağmen hala eşsizdir."
    ],
    "points": 276,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1719351280
  },
  {
    "id": 40792740,
    "title": "QuickLook'u Düzeltme (2023)",
    "originLink": "https://foon.uk/fixing-quicklook/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40792740",
    "commentBody": "",
    "originSummary": [
      "Fotoğraflar, oyun varlıkları ve kullanıcı arayüzü öğeleri için sorun teşkil eden QuickLook, Mojave'den Ventura'ya yükselttikten sonra artık görüntülerin köşelerini yuvarlatıyor.",
      "Yazar, QuickLook'taki yuvarlak köşeler ve kenarlıkla ilgili ayarları belirlemek ve devre dışı bırakmak için hata ayıklama araçları ve betikler kullandı.",
      "Bu yamaları çalışan tüm QuickLook süreçlerine uygulamak ve orijinal işlevselliği geri yüklemek için bir betik oluşturuldu; tam betik bağlantılı bir depoda mevcuttur."
    ],
    "commentSummary": [
      "Makale, macOS'taki QuickLook ile ilgili sorunları tartışıyor, özellikle bazı kullanıcıların gereksiz ve zararlı bulduğu kenarlıklar ve yuvarlatılmış köşeler ekleyerek öğe doğruluğunu nasıl değiştirdiğini ele alıyor.",
      "Yapılan araştırma, macOS sembollerinin üretim sürümlerinde hala mevcut olduğunu, bu nedenle kolayca değiştirilebileceğini ortaya koyuyor ve Apple'ın QuickLook'taki değişiklikleri geri alması gerektiğini öneriyor.",
      "Bu tartışma, bazı kullanıcıların özellikle UI tutarlılığı ve erişilebilirlik açısından Big Sur'dan bu yana Apple'ın izlediği yönden memnuniyetsizliklerini dile getirdiği çeşitli macOS tasarım değişiklikleri hakkındaki görüşleri içermektedir."
    ],
    "points": 220,
    "commentCount": 38,
    "retryCount": 0,
    "time": 1719344708
  },
  {
    "id": 40794786,
    "title": "Aralık aritmetiğine kısa bir giriş",
    "originLink": "https://buttondown.email/hillelwayne/archive/a-brief-introduction-to-interval-arithmetic/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40794786",
    "commentBody": "",
    "originSummary": [
      "Aralık aritmetiği, ölçüm hatalarını değerleri aralıklar olarak temsil ederek ele alır ve tek bir kesin olmayan kayan nokta değeri yerine doğru sayının sınırlarını sağlar.",
      "Aralık aritmetiği daha doğru sonuçlar sunabilse de, aşırı büyük sınırlarla sonuçlanabilir ve bu da onu daha az pratik hale getirebilir, IEEE-754 standardının yaratıcısı William Kahan tarafından belirtildiği gibi.",
      "John Gustafson'un evrensel sayıları bu alandaki son gelişmelerden biridir, ancak onun posit versiyonunun aralıkları içerip içermediği belirsizdir; Kahan ile olan rekabeti tartışmaya ilginç bir dinamik katıyor."
    ],
    "commentSummary": [
      "Aralık aritmetiği, y'yi çözmeden formülleri ele almak için bir grafik hesap makinesinde kullanılır, denklemleri yeniden düzenleyerek ve x ve y aralıkları için sonuç aralıklarını hesaplayarak.",
      "Yöntem, aralıkları özyinelemeli olarak bölmeyi ve çözümleri içeren küçük aralıkları bulmak için ikili aramalar yapmayı içerir, bu aralıklar daha sonra grafikte noktalar olarak çizilir.",
      "Bu yaklaşım, ClickHouse gibi veritabanlarında indeks analizi ve titiz sayısal hesaplamalar için potansiyeli de dahil olmak üzere çeşitli alanlardaki uygulamalarıyla öne çıkmaktadır."
    ],
    "points": 196,
    "commentCount": 79,
    "retryCount": 0,
    "time": 1719357302
  },
  {
    "id": 40800869,
    "title": "Bir Milyon Onay Kutusu",
    "originLink": "https://onemillioncheckboxes.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40800869",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "\"Bir Milyon Onay Kutusu\", kullanıcıların işbirliği içinde bir milyon onay kutusunu işaretleyip işaretlerini kaldırabilecekleri bir web projesidir. Beklenmedik bir şekilde büyük popülerlik kazanmış ve sunucu sorunlarına yol açmıştır.",
      "Proje, gerçek zamanlı etkileşimleri yönetmek için teknolojilerin bir karışımını sergileyerek, bitset depolama için Redis, güncellemeler için WebSockets ve render işlemleri için React-Window kullanarak bir Flask sunucusu kullanıyor.",
      "Projenin kaotik ve işbirlikçi doğası, kullanıcı etkileşimlerinin çeşitliliğini tetikledi; bu etkileşimler, eğlenceli rekabetten performans optimizasyonu ve WebSocket bağlantılarının yönetimi üzerine teknik tartışmalara kadar uzanıyor."
    ],
    "points": 194,
    "commentCount": 75,
    "retryCount": 0,
    "time": 1719414158
  },
  {
    "id": 40792684,
    "title": "Tavşan veri ihlali: şimdiye kadar verilen tüm r1 yanıtları indirilebilir",
    "originLink": "https://rabbitu.de/articles/security-disclosure-1",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40792684",
    "commentBody": "",
    "originSummary": [
      "16 Mayıs 2024'te, Rabbitude ekibi, Rabbit kod tabanında önemli güvenlik riskleri oluşturan kritik hardcoded API anahtarlarını keşfetti.",
      "Bu anahtarlar, kişisel bilgilere yetkisiz erişim, R1 cihazlarını devre dışı bırakma, yanıtları değiştirme ve sesleri değiştirme yeteneği sağlayarak ElevenLabs, Azure, Yelp ve Google Maps gibi hizmetleri etkiler.",
      "Konunun farkında olmalarına rağmen, Rabbit ekibi anahtarları geçersiz kılmamış, bu da R1 kullanıcıları için ciddi güvenlik endişelerini vurgulamaktadır."
    ],
    "commentSummary": [
      "Tavşan, bir yapay zeka girişimi, tüm R1 yanıtlarının indirilebildiği bir veri ihlali yaşadı ve bu durum, BT uygulamaları ve güvenlik önlemleri hakkında endişelere yol açtı.",
      "Şirket, ihlalden sonra anahtarı iptal etti, bu da sunucu anahtarını güncellememekten dolayı R1'lerin bozulmasına neden oldu ve API anahtarlarının yönetiminde potansiyel ihmali vurguladı.",
      "Olay, yapay zeka girişimlerinin güvenilirliği, güvenli veri işleme önemi ve yapay zeka hizmetlerindeki veri ihlallerinin daha geniş etkileri hakkında tartışmalara yol açtı."
    ],
    "points": 171,
    "commentCount": 32,
    "retryCount": 0,
    "time": 1719344397
  },
  {
    "id": 40795227,
    "title": "Phil Hartmann'ın albüm kapağı (2022)",
    "originLink": "https://www.conorherbert.com/music/the-album-art-of-phil-hartmann",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40795227",
    "commentBody": "",
    "originSummary": [
      "Phil Hartman, asıl adıyla Phil Hartmann, aktör olarak ün kazanmadan önce Batı Yakası rock grupları için albüm kapakları tasarlıyordu.",
      "Hartman, 1984 yılına kadar Poco ve America gibi gruplar için dikkate değer kapaklar yaratarak Santa Monica City College ve California State University'de sanat eğitimi aldı.",
      "Grafik tasarım kariyeri, 1986'da \"Saturday Night Live\" programına katıldığında sona erdi ve bu, sanattan komedi ve oyunculuğa geçişini işaret etti."
    ],
    "commentSummary": [
      "Phil Hartman, özellikle SNL'de Ronald Reagan'ı canlandırması ve \"Newsradio\" ile \"Kiki’s Delivery Service\"e katkılarıyla tanınan çok yönlü yeteneğiyle kutlandı.",
      "O, Pee-Wee Herman ile bağlantılar ve ünlü gruplar için albüm kapağı tasarımı da dahil olmak üzere çeşitli bir kariyere sahipti.",
      "Hartman'ın mirası, unutulmaz rolleri ve performanslarının kalıcı etkisiyle devam ediyor."
    ],
    "points": 156,
    "commentCount": 32,
    "retryCount": 0,
    "time": 1719361669
  },
  {
    "id": 40795404,
    "title": "Brezilya Yüksek Mahkemesi marihuanayı suç olmaktan çıkarıyor",
    "originLink": "https://www.bloomberg.com/news/articles/2024-06-25/brazil-supreme-court-decriminalizes-marijuana-for-personal-use",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40795404",
    "commentBody": "",
    "originSummary": [
      "Brezilya Yüksek Mahkemesi, çoğunluk oyu ile kişisel kullanım için marihuana bulundurmayı suç olmaktan çıkardı, cezai yaptırımları kaldırdı ancak yasallaştırmadı.",
      "Karar, konu hakkında farklı görüşlere sahip olabilecek Kongre ile gerginliğe neden oldu.",
      "Mahkeme, kişisel kullanım ile ticaret arasındaki farkı belirleyen belirli miktarı henüz belirlememiştir."
    ],
    "commentSummary": [
      "Brezilya Yüksek Mahkemesi, bir suçu oluşturan miktarı belirleyen 2006 tarihli belirsiz yasayı netleştirerek marihuanayı suç olmaktan çıkardı.",
      "Karar, bir adamın 3 gram esrar bulundurmaktan mahkum edildiği bir davadan kaynaklandı ve alt mahkeme kararlarındaki tutarsızlıkları vurguladı.",
      "2006 yasası, Brezilya'nın FDA'sı olan Anvisa tarafından ilaç sınıflandırmasına izin verdi ve bir başkanın, Anvisa'ya liberal yetkililer atayarak ilaç politikasını etkileyebileceğini öne sürdü."
    ],
    "points": 146,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1719363657
  },
  {
    "id": 40799038,
    "title": "Çalışanların Yarısı Dünyanın Her Yerinde Tükenmişlikle Mücadele Ediyor",
    "originLink": "https://www.bcg.com/press/11june2024-half-of-workers-around-the-world-struggling-with-burnout",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40799038",
    "commentBody": "",
    "originSummary": [
      "Boston Consulting Group (BCG) tarafından yapılan bir çalışma, sekiz ülkedeki çalışanların %48'inin tükenmişlik yaşadığını ortaya koyuyor. Bu sonuç, 11.000 çalışanla yapılan bir anketin verilerine dayanıyor.",
      "Çalışma, iş yerinde kendini dahil hissetmenin tükenmişlik olasılığını yarıya indirebileceğini vurguluyor; bunun anahtar faktörleri ise kaynaklara erişim, yönetsel destek, psikolojik güvenlik ve adil fırsatlar olarak belirtiliyor.",
      "Tükenmişlik oranları kadınlar, LGBTQ+ bireyler, engelli insanlar ve masa başı çalışmayan işçiler arasında daha yüksektir ve bu gruplar aynı zamanda daha düşük düzeyde kapsayıcılık bildirmektedir."
    ],
    "commentSummary": [
      "Son yapılan bir anket, küresel iş gücünün yarısının tükenmişlik yaşadığını gösteriyor, ancak \"tükenmişlik\" terimi genellikle iş ile ilgili geniş bir yelpazedeki hayal kırıklıklarını ve aralıklı yorgunlukları tanımlamak için gevşek bir şekilde kullanılıyor.",
      "Boston Consulting Group (BCG) tarafından gerçekleştirilen anket, öz bildirime dayalıdır, bu da terimin geniş yorumlanması nedeniyle tükenmişlik yaşadığını iddia eden kişi sayısını artırabilir.",
      "Bu tartışma, tükenmişlik ile ilgili sıradan şikayetler ile önemli iyileşme süresi gerektiren ciddi vakalar arasındaki farkı vurgulamakta ve iş yerinde tükenmişliğin daha net bir tanımına ve anlaşılmasına duyulan ihtiyacı öne çıkarmaktadır."
    ],
    "points": 137,
    "commentCount": 170,
    "retryCount": 0,
    "time": 1719403805
  },
  {
    "id": 40799791,
    "title": "R2R V2 – Üretim özelliklerine sahip açık kaynaklı bir RAG motoru",
    "originLink": "https://github.com/SciPhi-AI/R2R",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40799791",
    "commentBody": "",
    "originSummary": [
      "R2R, açık kaynaklı bir RAG (Retrieval-Augmented Generation) yanıt motoru, çok modlu veri alımı, hibrit arama, gelişmiş RAG teknikleri ve otomatik bilgi grafiği oluşturma üzerine odaklanan büyük bir güncelleme yayınladı.",
      "Güncelleme, mevcut RAG çözümleriyle ilgili geliştirici zorluklarını ele alarak, geliştirilmiş gözlemlenebilirlik, özelleştirilebilirlik ve kolay dağıtım ve ayar için bir RESTful API sunuyor.",
      "Mevcut projeler arasında anlamsal parçalamayı geliştirme, bilgi grafiği oluşturma için özel bir model eğitme ve ayrıntılı izinler ve analizleri iyileştirme yer alıyor, kolay kurulum için hızlı başlangıç kılavuzu mevcuttur."
    ],
    "commentSummary": [
      "R2R V2, geliştirici geri bildirimlerine dayalı üretim özelliklerine odaklanan, Postgres ve Neo4j üzerine inşa edilmiş açık kaynaklı bir RAG (Retrieval-Augmented Generation) motorudur.",
      "Temel özellikler arasında çok modlu veri alımı, hibrit arama, gelişmiş RAG teknikleri, otomatik bilgi grafiği oluşturma ve yerleşik gözlemlenebilirlik ve özelleştirilebilirlik bulunmaktadır.",
      "Bu güncelleme, Langchain gibi mevcut araçlarla ilgili zorlukları ele alarak, geliştirici deneyimini iyileştirir, hızlı dağıtım ve ayarlama imkanı sunar ve B2B müşteri adayı oluşturma ile araştırma asistanlarına kadar çeşitli uygulamalara sahiptir."
    ],
    "points": 136,
    "commentCount": 40,
    "retryCount": 0,
    "time": 1719408434
  },
  {
    "id": 40800734,
    "title": "Eğer sitenizde Polyfill.io kodu kullanıyorsanız – derhal kaldırın",
    "originLink": "https://www.theregister.com/2024/06/25/polyfillio_china_crisis/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40800734",
    "commentBody": "",
    "originSummary": [
      "Polyfill.io, daha önce JavaScript polyfill'leri için kullanılan, bir Çinli organizasyon tarafından satın alındıktan sonra şimdi kötü amaçlı yazılım dağıtıyor ve 100,000'den fazla web sitesini etkiliyor.",
      "Google, etkilenen sitelerdeki reklamları engelliyor ve site sahiplerini uyarıyor, güvenlik firmaları ise sunulan kötü amaçlı kod konusunda uyarıda bulunuyor.",
      "Fastly ve Cloudflare gibi popüler CDN sağlayıcıları, sitelerin tehlikeye atılmış alan adından uzaklaşmasına yardımcı olmak için aynalar oluşturdu."
    ],
    "commentSummary": [
      "Polyfill.io'nun alan adı, Şubat ayından beri mobil cihazlara kötü amaçlı yazılım enjekte ediyor ve birçok web sitesini etkiliyor.",
      "Öne çıkan etkilenen siteler arasında JSTOR, Intuit ve Dünya Ekonomik Forumu bulunmaktadır.",
      "Kullanıcılara, daha fazla sorunu önlemek için sitelerinden Polyfill.io kodunu derhal kaldırmaları tavsiye edilir."
    ],
    "points": 126,
    "commentCount": 7,
    "retryCount": 0,
    "time": 1719413332
  },
  {
    "id": 40797130,
    "title": "Google, arama sonuçlarında sürekli kaydırmayı kaldırıyor",
    "originLink": "https://searchengineland.com/google-dropping-continuous-scroll-in-search-results-443529",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40797130",
    "commentBody": "",
    "originSummary": [
      "Google, 25 Haziran 2024'ten itibaren masaüstü için ve daha sonra mobil için arama sonuçlarında sürekli kaydırmayı durdurarak klasik sayfalama çubuğuna geri dönüyor.",
      "Sürekli kaydırma, ilk olarak Ekim 2021'de mobil aramada ve Aralık 2022'de masaüstünde tanıtıldı, ancak kullanıcı memnuniyetini önemli ölçüde artırmadı.",
      "Bu değişiklik, Search Engine Land'de katkıda bulunan editör Barry Schwartz'ın belirttiği gibi, web sitesi tıklamaları ve Arama Konsolu verilerini etkileyebilir."
    ],
    "commentSummary": [
      "Google, arama sonuçlarında sürekli kaydırmayı durduruyor, muhtemelen çoğu sorgunun 40'tan az ilgili sonuç döndürmesi nedeniyle.",
      "Sürekli kaydırma, geri gezinme sorunları ve belirli sonuçları bulma zorluğu gibi kötü uygulama nedeniyle eleştirilerle karşılaştı.",
      "Kullanıcıların Google'ın arama kalitesinden memnuniyetsizliği, bazılarını DuckDuckGo gibi alternatif arama motorlarına yönlendirdi."
    ],
    "points": 122,
    "commentCount": 106,
    "retryCount": 0,
    "time": 1719385018
  },
  {
    "id": 40799090,
    "title": "HAYALET ROM (2012)",
    "originLink": "https://www.nycresistor.com/2012/08/21/ghosts-in-the-rom/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40799090",
    "commentBody": "",
    "originSummary": [
      "Apple Mac SE ROM görüntülerini inceleyen araştırmacılar, bozulmuş bir insan resmi ve 20 Kasım 1986 tarihli bir mesaj içeren gizli görüntü verilerini ortaya çıkardı.",
      "ROM, atılmış bir Macintosh SE'den alındı ve belirli bir bellek adresinde gizli görüntüleri doğrulayan bir PROMdate cihazı kullanılarak analiz edildi.",
      "Gizli görüntüler, ikili dökümü bir ELF dosyasına dönüştürüp ayrıştırarak çözüldü ve bu, yasa dışı bir talimat tuzağı ve Macintosh Araç Kutusu aracılığıyla bit eşlem görüntüsünün ekrana çizilme sürecini ortaya çıkardı."
    ],
    "commentSummary": [
      "Yazı, Terry A Davis gibi orijinal mühendislerin katkılarıyla, eski bilgisayarların ROM'unda (Salt Okunur Bellek) gizlenmiş nostaljik Paskalya yumurtalarını tartışıyor.",
      "Kullanıcılar, Apple IIci, Commodore Amiga ve Radio Shack bilgisayarlar gibi çeşitli cihazlarda bu Paskalya yumurtalarını keşfetme anılarına dair kişisel anılarını paylaşıyor.",
      "Bu Paskalya yumurtaları hakkında ayrıntılı belgeler ve tartışmalara bağlantılar sağlanarak, erken bilgisayar mühendisliğinin eğlenceli ve yaratıcı kültürü vurgulanmaktadır."
    ],
    "points": 114,
    "commentCount": 13,
    "retryCount": 0,
    "time": 1719404146
  },
  {
    "id": 40797217,
    "title": "FICO ve Kredi Bürosu Karteli",
    "originLink": "https://www.thebignewsletter.com/p/inside-fico-and-the-credit-bureau",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40797217",
    "commentBody": "",
    "originSummary": [
      "Mortgage kredi verenleri, Experian, TransUnion, Equifax ve FICO'nun tekelinden dolayı artan maliyetler ve olası kapanmalarla karşı karşıya kalıyor.",
      "CFPB'nin direktörü Rohit Chopra, kredi raporlama endüstrisinde fiyatları sınırlamak ve rekabeti artırmak için düzenleyici önlemler alınmasını savunuyor.",
      "CFPB, kamuoyunun görüşlerini arıyor ve bu tekelci uygulamaları ele almak için antitröst soruşturmaları ve yasal düzenlemeler yapılması çağrıları var."
    ],
    "commentSummary": [
      "Yirmi yıl önce, Experian ve Fair Isaac, USAID tarafından finanse edilerek Kazakistan'ın kredi bürosu sistemini kurmaya yardımcı oldular, bu sistem şimdi ABD sisteminden daha adil ve daha verimli olarak kabul ediliyor.",
      "Kazakistan hükümeti, kredi bürolarını lisanslar ve kendi bürosunu işletir, rekabetçi fiyatlandırmayı ve yeniliği teşvik eder, bankalar tüm lisanslı bürolara rapor verir ve puan hesaplaması için ham veri sağlar.",
      "Makale, ABD sisteminin FICO puanlarına olan bağımlılığını karşılaştırarak, verimsizlikleri ve tekelci uygulamaları vurgulamakta ve düzenleyici yakalanma ile eski uygulamaların ilerlemeyi engellediğini öne sürmektedir."
    ],
    "points": 113,
    "commentCount": 102,
    "retryCount": 0,
    "time": 1719386088
  },
  {
    "id": 40796459,
    "title": "Yoğun Egzersiz, Bilişsel Gerileme ve Yüksek Tansiyon",
    "originLink": "https://alz-journals.onlinelibrary.wiley.com/doi/full/10.1002/alz.13887",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40796459",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Sağlık sektöründeki paydaşlar, sağlık sorunlarını önlemekten ziyade tedavi etmekten daha fazla kar elde ediyorlar, bu da önleyici tedbirler yerine ilaçlar ve tedavilere daha yüksek yatırımlar yapılmasına yol açıyor.",
      "Pazar temelli çözümler, spor salonları için vergi indirimleri ve iyileştirilmiş ulaşım politikaları gibi, daha sağlıklı yaşam tarzlarını teşvik edebilir, ancak kamu politikaları genellikle bireyler yerine toplulukları hedef alır ve bu da onların etkinliğini etkiler.",
      "Sistemik değişiklikler, daha iyi kentsel planlama ve fiziksel aktiviteler için sübvansiyonlar gibi, bireysel motivasyonla birlikte, sağlık sonuçlarını iyileştirmek için gereklidir, çünkü birçok insan çeşitli kısıtlamalar nedeniyle sağlıklı alışkanlıkları sürdürmekte zorlanmaktadır."
    ],
    "points": 105,
    "commentCount": 126,
    "retryCount": 0,
    "time": 1719377120
  }
]
