[
  {
    "id": 40793465,
    "title": "Pelota: Una pelota que vive en tu muelle",
    "originLink": "https://github.com/nate-parrott/ball",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40793465",
    "commentBody": "",
    "originSummary": [
      "\"Ball\" es una pequeña bola roja interactiva que se puede arrastrar, lanzar y hacer rebotar en tu pantalla, proporcionando entretenimiento sencillo.",
      "Inspirado por el widget del Dashboard de OS X de Nate Heagy, esta versión incluye animaciones que permiten que la bola se mueva fuera del dock, gracias a la guía de Wessley Roche.",
      "La aplicación ofrece una experiencia lúdica, permitiendo a los usuarios ver cuántas veces puede rebotar la pelota o golpear la pared."
    ],
    "commentSummary": [
      "Un proyecto de GitHub llamado \"Ball\" introduce una pelota rebotando en tu dock, que recuerda a los juguetes de escritorio nostálgicos.",
      "Las experiencias de los usuarios son mixtas; algunos lo encuentran entretenido, mientras que otros encuentran problemas con el uso en producción y el soporte para desarrolladores.",
      "La nostalgia por las utilidades de escritorio lúdicas del pasado, como Neko, Bonzi Buddy y varios salvapantallas, ha sido despertada por el proyecto, destacando un deseo por elementos de escritorio más caprichosos en la informática moderna."
    ],
    "points": 948,
    "commentCount": 275,
    "retryCount": 0,
    "time": 1719348772
  },
  {
    "id": 40793924,
    "title": "Simulador de HyperCard",
    "originLink": "https://hcsimulator.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40793924",
    "commentBody": "",
    "originSummary": [
      "HyperCard Simulator permite a los usuarios importar y ejecutar pilas clásicas de HyperCard, un software popular de finales de los años 80 y principios de los 90.",
      "La influencia del proyecto proviene de hypercard.org, Merveilles HyperJam y el Internet Archive, lo que indica un fuerte interés comunitario e histórico.",
      "Desarrollado por Hypervariety Custom Software, el simulador tiene como objetivo preservar y simular la funcionalidad de las pilas originales de HyperCard."
    ],
    "commentSummary": [
      "HyperCard Simulator ha despertado la nostalgia, recordando a los usuarios la accesibilidad y creatividad de HyperCard en comparación con herramientas modernas como Flash, Gamemaker y Pico-8.",
      "Los usuarios sugirieron alternativas como P5js, Processing y LiveCode, pero señalaron que carecen del encanto y la simplicidad únicos de HyperCard.",
      "El impacto significativo de HyperCard en la programación temprana y la creación multimedia sigue siendo inigualable a pesar de los avances modernos."
    ],
    "points": 276,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1719351280
  },
  {
    "id": 40792740,
    "title": "Arreglando QuickLook (2023)",
    "originLink": "https://foon.uk/fixing-quicklook/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40792740",
    "commentBody": "",
    "originSummary": [
      "Después de actualizar de Mojave a Ventura, QuickLook ahora redondea las esquinas de las imágenes, lo cual es problemático para fotos, recursos de juegos y elementos de la interfaz de usuario.",
      "El autor utilizó herramientas de depuración y scripts para identificar y desactivar las configuraciones responsables de las esquinas redondeadas y el borde en QuickLook.",
      "Se creó un script para aplicar estos parches a todos los procesos de QuickLook en ejecución, restaurando la funcionalidad original; el script completo está disponible en un repositorio vinculado."
    ],
    "commentSummary": [
      "La artículo discute problemas con QuickLook en macOS, específicamente cómo altera la precisión de los elementos al agregar bordes y esquinas redondeadas, lo cual algunos usuarios consideran innecesario y perjudicial.",
      "La investigación revela que los símbolos de macOS aún están presentes en las versiones de producción, lo que los hace fácilmente modificables, y sugiere que Apple debería revertir los cambios en QuickLook.",
      "La discusión incluye varias opiniones sobre los cambios de diseño de macOS, con algunos usuarios expresando su descontento con la dirección que Apple ha tomado desde Big Sur, particularmente en términos de consistencia de la interfaz de usuario y accesibilidad."
    ],
    "points": 220,
    "commentCount": 38,
    "retryCount": 0,
    "time": 1719344708
  },
  {
    "id": 40794786,
    "title": "Una breve introducción a la aritmética de intervalos",
    "originLink": "https://buttondown.email/hillelwayne/archive/a-brief-introduction-to-interval-arithmetic/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40794786",
    "commentBody": "",
    "originSummary": [
      "El cálculo con intervalos aborda las inexactitudes de medición al representar valores como rangos, proporcionando límites para el número correcto en lugar de un único valor de punto flotante impreciso.",
      "Si bien la aritmética de intervalos puede ofrecer resultados más precisos, también puede llevar a límites excesivamente grandes, lo que la hace menos práctica, como señaló William Kahan, el creador del estándar IEEE-754.",
      "Los números universales de John Gustafson son un desarrollo reciente en este campo, aunque no está claro si su versión posit incorpora intervalos; su rivalidad con Kahan añade una dinámica interesante a la discusión."
    ],
    "commentSummary": [
      "Se utiliza la aritmética de intervalos en una calculadora gráfica para manejar fórmulas sin resolver para y, reorganizando ecuaciones y calculando intervalos de resultados para los rangos de x e y.",
      "La metodología implica dividir recursivamente los rangos y realizar búsquedas binarias para encontrar pequeños intervalos con soluciones, que luego se dibujan como puntos en el gráfico.",
      "Este enfoque se destaca por su aplicación en varios campos, incluyendo el análisis de índices en bases de datos como ClickHouse, y su potencial para cálculos numéricos rigurosos."
    ],
    "points": 196,
    "commentCount": 79,
    "retryCount": 0,
    "time": 1719357302
  },
  {
    "id": 40800869,
    "title": "Un millón de casillas de verificación",
    "originLink": "https://onemillioncheckboxes.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40800869",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "\"Un millón de casillas de verificación\" es un proyecto web donde los usuarios pueden marcar y desmarcar colaborativamente un millón de casillas de verificación, ganando inesperadamente una popularidad significativa y causando problemas en el servidor.",
      "La aplicación utiliza un servidor Flask, Redis para el almacenamiento de bitsets, WebSockets para actualizaciones y React-Window para la renderización, mostrando una combinación de tecnologías para manejar interacciones en tiempo real.",
      "La naturaleza caótica y colaborativa del proyecto ha generado una variedad de interacciones entre los usuarios, desde competencias lúdicas hasta discusiones técnicas sobre la optimización del rendimiento y el manejo de conexiones WebSocket."
    ],
    "points": 194,
    "commentCount": 75,
    "retryCount": 0,
    "time": 1719414158
  },
  {
    "id": 40792684,
    "title": "Violación de datos de Rabbit: todas las respuestas r1 dadas alguna vez se pueden descargar",
    "originLink": "https://rabbitu.de/articles/security-disclosure-1",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40792684",
    "commentBody": "",
    "originSummary": [
      "El 16 de mayo de 2024, el equipo de Rabbitude descubrió claves API críticas codificadas en el código base de Rabbit, lo que representa riesgos de seguridad significativos.",
      "Estas claves permiten el acceso no autorizado a información personal, la capacidad de deshabilitar dispositivos R1, alterar respuestas y reemplazar voces, afectando servicios como ElevenLabs, Azure, Yelp y Google Maps.",
      "A pesar de ser conscientes del problema, el equipo de Rabbit no ha invalidado las claves, lo que resalta serias preocupaciones de seguridad para los usuarios de R1."
    ],
    "commentSummary": [
      "Rabbit, una startup de IA, experimentó una violación de datos donde se podían descargar todas las respuestas R1, lo que generó preocupaciones sobre sus prácticas de TI y medidas de seguridad.",
      "La empresa revocó la clave después de la violación, lo que rompió los R1 debido a no actualizar la clave del servidor, destacando una posible negligencia en el manejo de las claves API.",
      "La incidencia ha generado debates sobre la confiabilidad de las startups de IA, la importancia del manejo seguro de datos y las implicaciones más amplias de las brechas de datos en los servicios de IA."
    ],
    "points": 171,
    "commentCount": 32,
    "retryCount": 0,
    "time": 1719344397
  },
  {
    "id": 40795227,
    "title": "La carátula del álbum de Phil Hartmann (2022)",
    "originLink": "https://www.conorherbert.com/music/the-album-art-of-phil-hartmann",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40795227",
    "commentBody": "",
    "originSummary": [
      "Antes de ganar fama como actor, Phil Hartman, originalmente Phil Hartmann, diseñaba portadas de álbumes para bandas de rock de la Costa Oeste.",
      "Hartman estudió arte en el Santa Monica City College y en la Universidad Estatal de California, creando portadas notables para bandas como Poco y America hasta 1984.",
      "Su carrera en el diseño gráfico terminó cuando se unió a \"Saturday Night Live\" en 1986, marcando una transición del arte a la comedia y la actuación."
    ],
    "commentSummary": [
      "Phil Hartman fue celebrado por su talento versátil, destacándose por interpretar a Ronald Reagan en SNL y contribuir a \"Newsradio\" y \"Kiki’s Delivery Service\".",
      "Tuvo una carrera diversa, incluyendo conexiones con Pee-Wee Herman y la creación de portadas de álbumes para bandas famosas.",
      "Hartman deja un legado perdurable a través de sus papeles memorables y el impacto duradero de sus actuaciones."
    ],
    "points": 156,
    "commentCount": 32,
    "retryCount": 0,
    "time": 1719361669
  },
  {
    "id": 40795404,
    "title": "El Tribunal Supremo de Brasil despenaliza la marihuana",
    "originLink": "https://www.bloomberg.com/news/articles/2024-06-25/brazil-supreme-court-decriminalizes-marijuana-for-personal-use",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40795404",
    "commentBody": "",
    "originSummary": [
      "El Tribunal Supremo de Brasil ha despenalizado la posesión de marihuana para uso personal por mayoría de votos, eliminando las sanciones penales pero sin legalizarla.",
      "La decisión ha causado tensión con el Congreso, que puede tener opiniones diferentes sobre el asunto.",
      "La Corte aún no ha establecido la cantidad específica que diferencia el uso personal del tráfico."
    ],
    "commentSummary": [
      "El Tribunal Supremo de Brasil ha despenalizado la marihuana, aclarando la ley de 2006 previamente vaga sobre la cantidad que constituye un delito.",
      "La decisión se originó a partir de un caso en el que un hombre fue condenado por poseer 3 gramos de marihuana, destacando inconsistencias en los fallos de los tribunales inferiores.",
      "La ley de 2006 permitió la clasificación de medicamentos por parte de Anvisa, la FDA de Brasil, sugiriendo que un presidente podría influir en la política de drogas al nombrar a funcionarios liberales en Anvisa."
    ],
    "points": 146,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1719363657
  },
  {
    "id": 40799038,
    "title": "Mitad de los trabajadores en todo el mundo están luchando contra el agotamiento",
    "originLink": "https://www.bcg.com/press/11june2024-half-of-workers-around-the-world-struggling-with-burnout",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40799038",
    "commentBody": "",
    "originSummary": [
      "Un estudio del Boston Consulting Group (BCG) revela que el 48% de los trabajadores en ocho países están experimentando agotamiento, según una encuesta realizada a 11,000 trabajadores.",
      "La investigación destaca que sentirse incluido en el trabajo puede reducir a la mitad la probabilidad de agotamiento, siendo factores clave el acceso a recursos, el apoyo gerencial, la seguridad psicológica y las oportunidades justas.",
      "Las tasas de agotamiento son más altas entre las mujeres, las personas LGBTQ+, las personas con discapacidades y los trabajadores sin escritorio, quienes también informan niveles más bajos de inclusión."
    ],
    "commentSummary": [
      "Una encuesta reciente indica que la mitad de la fuerza laboral global está experimentando agotamiento, aunque el término \"agotamiento\" a menudo se usa de manera imprecisa para describir una amplia gama de frustraciones relacionadas con el trabajo y cansancio intermitente.",
      "La encuesta, realizada por Boston Consulting Group (BCG), es autoinformada, lo que puede inflar el número de personas que afirman estar agotadas debido a la amplia interpretación del término.",
      "La discusión destaca la diferencia entre las quejas casuales de agotamiento y los casos graves que requieren un tiempo de recuperación significativo, enfatizando la necesidad de una definición y comprensión más clara del agotamiento en el lugar de trabajo."
    ],
    "points": 137,
    "commentCount": 170,
    "retryCount": 0,
    "time": 1719403805
  },
  {
    "id": 40799791,
    "title": "R2R V2 – Un motor RAG de código abierto con características de producción",
    "originLink": "https://github.com/SciPhi-AI/R2R",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40799791",
    "commentBody": "",
    "originSummary": [
      "R2R, un motor de respuestas RAG (Generación Aumentada por Recuperación) de código abierto, ha lanzado una actualización importante centrada en la ingesta de datos multimodales, búsqueda híbrida, técnicas avanzadas de RAG y construcción automática de gráficos de conocimiento.",
      "La actualización aborda los desafíos de los desarrolladores con las soluciones RAG existentes, ofreciendo una mejor observabilidad, personalización y una API RESTful para una fácil implementación y ajuste.",
      "Los proyectos actuales incluyen mejorar la segmentación semántica, entrenar un modelo personalizado para la construcción de gráficos de conocimiento y mejorar los permisos granulares y la analítica, con una guía de inicio rápido disponible para una fácil instalación."
    ],
    "commentSummary": [
      "R2R V2 es un motor RAG (Generación Aumentada por Recuperación) de código abierto construido sobre Postgres y Neo4j, centrado en características de producción basadas en la retroalimentación de los desarrolladores.",
      "Las características clave incluyen la ingesta de datos multimodal, búsqueda híbrida, técnicas avanzadas de RAG, construcción automática de gráficos de conocimiento y observabilidad y personalización integradas.",
      "La actualización aborda desafíos con herramientas existentes como Langchain, ofreciendo una mejor experiencia para desarrolladores, despliegue rápido y ajuste, con aplicaciones que van desde la generación de leads B2B hasta asistentes de investigación."
    ],
    "points": 136,
    "commentCount": 40,
    "retryCount": 0,
    "time": 1719408434
  },
  {
    "id": 40800734,
    "title": "Si estás utilizando el código de Polyfill.io en tu sitio, elimínalo de inmediato",
    "originLink": "https://www.theregister.com/2024/06/25/polyfillio_china_crisis/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40800734",
    "commentBody": "",
    "originSummary": [
      "Polyfill.io, anteriormente utilizado para polyfills de JavaScript, ahora está distribuyendo malware después de ser adquirido por una organización china, afectando a más de 100,000 sitios web.",
      "Google está bloqueando anuncios en los sitios afectados y ha alertado a los propietarios de los sitios, mientras que las firmas de seguridad advierten sobre el código malicioso que se está distribuyendo.",
      "Proveedores de CDN populares como Fastly y Cloudflare han creado espejos para ayudar a los sitios a transitar desde el dominio comprometido."
    ],
    "commentSummary": [
      "El dominio de Polyfill.io ha estado inyectando malware en dispositivos móviles desde febrero, afectando a numerosos sitios web.",
      "Los sitios prominentes afectados incluyen JSTOR, Intuit y el Foro Económico Mundial.",
      "Se aconseja a los usuarios que eliminen el código de Polyfill.io de sus sitios de inmediato para prevenir problemas adicionales."
    ],
    "points": 126,
    "commentCount": 7,
    "retryCount": 0,
    "time": 1719413332
  },
  {
    "id": 40797130,
    "title": "Google elimina el desplazamiento continuo en los resultados de búsqueda",
    "originLink": "https://searchengineland.com/google-dropping-continuous-scroll-in-search-results-443529",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40797130",
    "commentBody": "",
    "originSummary": [
      "Google dejará de usar el desplazamiento continuo en los resultados de búsqueda, volviendo a la barra de paginación clásica, a partir del 25 de junio de 2024 para escritorio y más tarde para móviles.",
      "El desplazamiento continuo se introdujo inicialmente en la búsqueda móvil en octubre de 2021 y en el escritorio en diciembre de 2022, pero no aumentó significativamente la satisfacción del usuario.",
      "Este cambio puede afectar los clics en el sitio web y los datos de la Consola de Búsqueda, como lo señaló Barry Schwartz, editor colaborador en Search Engine Land."
    ],
    "commentSummary": [
      "Google está descontinuando el desplazamiento continuo en los resultados de búsqueda, probablemente porque la mayoría de las consultas devuelven menos de 40 resultados relevantes.",
      "El desplazamiento continuo enfrentó críticas por una implementación deficiente, incluyendo problemas con la navegación hacia atrás y la dificultad para encontrar resultados específicos.",
      "El descontento de los usuarios con la calidad de búsqueda de Google ha llevado a algunos a cambiar a motores de búsqueda alternativos como DuckDuckGo."
    ],
    "points": 122,
    "commentCount": 106,
    "retryCount": 0,
    "time": 1719385018
  },
  {
    "id": 40799090,
    "title": "Fantasmas en el ROM (2012)",
    "originLink": "https://www.nycresistor.com/2012/08/21/ghosts-in-the-rom/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40799090",
    "commentBody": "",
    "originSummary": [
      "Investigadores que examinaron imágenes de la ROM del Apple Mac SE descubrieron datos de imagen ocultos, revelando una imagen distorsionada de personas y un mensaje del 20 de noviembre de 1986.",
      "La ROM fue recuperada de un Macintosh SE desechado y analizada utilizando un dispositivo PROMdate, confirmando imágenes secretas en una dirección de memoria específica.",
      "Las imágenes ocultas fueron decodificadas convirtiendo el volcado binario en un archivo ELF y desensamblándolo, revelando el proceso de dibujar el mapa de bits en la pantalla a través de una trampa de instrucción ilegal y el Macintosh Toolbox."
    ],
    "commentSummary": [
      "La publicación discute huevos de Pascua nostálgicos ocultos en la ROM (Memoria de Solo Lectura) de computadoras antiguas, con contribuciones de ingenieros originales como Terry A Davis.",
      "Los usuarios comparten recuerdos personales de descubrir estos huevos de Pascua en varios dispositivos, como el Apple IIci, Commodore Amiga y las computadoras de Radio Shack.",
      "Se proporcionan enlaces a documentación detallada y discusiones sobre estos huevos de Pascua, destacando la cultura lúdica y creativa de la ingeniería informática temprana."
    ],
    "points": 114,
    "commentCount": 13,
    "retryCount": 0,
    "time": 1719404146
  },
  {
    "id": 40797217,
    "title": "FICO y el Cartel de las Oficinas de Crédito",
    "originLink": "https://www.thebignewsletter.com/p/inside-fico-and-the-credit-bureau",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40797217",
    "commentBody": "",
    "originSummary": [
      "Los prestamistas hipotecarios están enfrentando costos incrementados y posibles cierres debido a un monopolio por parte de Experian, TransUnion, Equifax y FICO.",
      "Rohit Chopra, director del CFPB, está abogando por medidas regulatorias para limitar los precios y aumentar la competencia en la industria de informes crediticios.",
      "La CFPB está buscando la opinión pública y hay llamados para investigaciones antimonopolio y acciones legislativas para abordar estas prácticas monopolísticas."
    ],
    "commentSummary": [
      "Hace veinte años, Experian y Fair Isaac, financiados por USAID, ayudaron a establecer el sistema de buró de crédito de Kazajistán, que ahora se considera más justo y eficiente que el sistema de EE. UU.",
      "Kazajistán licencia a las agencias de crédito y opera su propia agencia, promoviendo precios competitivos e innovación, con los bancos reportando a todas las agencias licenciadas y proporcionando datos en bruto para el cálculo de puntajes.",
      "La artículo contrasta esto con la dependencia del sistema estadounidense en los puntajes FICO, destacando ineficiencias y prácticas monopolísticas, y sugiriendo que la captura regulatoria y las prácticas obsoletas obstaculizan el progreso."
    ],
    "points": 113,
    "commentCount": 102,
    "retryCount": 0,
    "time": 1719386088
  },
  {
    "id": 40796459,
    "title": "Ejercicio vigoroso, deterioro cognitivo y presión arterial alta",
    "originLink": "https://alz-journals.onlinelibrary.wiley.com/doi/full/10.1002/alz.13887",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40796459",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Los interesados en la industria de la salud obtienen más beneficios al tratar problemas de salud que al prevenirlos, lo que lleva a mayores inversiones en productos farmacéuticos y tratamientos en lugar de medidas preventivas.",
      "Las soluciones basadas en el mercado, como las exenciones fiscales para los gimnasios y las políticas de transporte mejoradas, podrían fomentar estilos de vida más saludables, pero las políticas públicas a menudo se dirigen a poblaciones en lugar de a individuos, lo que afecta su efectividad.",
      "Los cambios sistémicos como una mejor planificación urbana y subsidios para actividades físicas, junto con la motivación individual, son necesarios para mejorar los resultados de salud, ya que muchas personas luchan por mantener hábitos saludables debido a diversas limitaciones."
    ],
    "points": 105,
    "commentCount": 126,
    "retryCount": 0,
    "time": 1719377120
  }
]
