[
  {
    "id": 41171060,
    "title": "Penghentian produksi Chromecast",
    "originLink": "https://blog.google/products/google-nest/chromecast-history/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41171060",
    "commentBody": "",
    "originSummary": [
      "Chromecast, sebuah perangkat streaming yang populer, akan menghentikan produksi setelah 11 tahun dan lebih dari 100 juta unit terjual.",
      "Google memperkenalkan Google TV Streamer, sebuah perangkat premium yang ditujukan untuk hiburan modern dan integrasi rumah pintar, menandai transisi dari Chromecast.",
      "Warisan Chromecast mencakup peluncurannya pada tahun 2013 dan pengenalan Chromecast dengan Google TV pada tahun 2020, yang menyoroti dampaknya pada teknologi streaming TV."
    ],
    "commentSummary": [
      "Google menghentikan Chromecast dan menggantinya dengan nama \"Google TV Streamer,\" dengan tujuan memberikan pengalaman yang lebih mirip dengan Apple TV.",
      "Perangkat baru ini akan lebih mahal dan kurang bergantung pada ponsel, menimbulkan kekhawatiran tentang privasi dan potensi hilangnya fungsi casting yang sederhana.",
      "Kegiatan rebranding ini sejalan dengan strategi Google untuk menyatukan nama-nama produknya di bawah merek Google."
    ],
    "points": 505,
    "commentCount": 493,
    "retryCount": 0,
    "time": 1722953741
  },
  {
    "id": 41167467,
    "title": "Tidak Ada Garam",
    "originLink": "https://jakeseliger.com/2024/08/05/no-salt/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41167467",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Postingan blog Jake Seliger tentang perjuangan kanker saudaranya menekankan pentingnya uji klinis untuk vaksin tumor mRNA dan menyarankan perbaikan untuk proses uji klinis.",
      "Postingan tersebut telah menarik perhatian yang cukup besar, dengan bagian komentar dipenuhi dengan cerita pribadi, pesan dukungan, dan diskusi tentang cara menghadapi kesedihan.",
      "Beberapa komentator juga mengeksplorasi peran budaya dari makanan dan memasak, menyoroti berbagai cara orang menemukan kenyamanan selama masa-masa sulit."
    ],
    "points": 473,
    "commentCount": 149,
    "retryCount": 0,
    "time": 1722913411
  },
  {
    "id": 41168904,
    "title": "Pendiri OpenAI John Schulman mengatakan dia akan meninggalkan dan bergabung dengan pesaing Anthropic",
    "originLink": "https://www.cnbc.com/2024/08/06/openai-co-founder-john-schulman-says-he-will-join-rival-anthropic.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41168904",
    "commentBody": "",
    "originSummary": [
      "Pendiri OpenAI, John Schulman, meninggalkan perusahaan untuk bergabung dengan Anthropic, sebuah startup AI yang didanai oleh Amazon, untuk fokus pada penyelarasan AI.",
      "Schulman, yang memainkan peran kunci dalam menyempurnakan model untuk ChatGPT OpenAI, menekankan bahwa kepergiannya bukan karena kurangnya dukungan di OpenAI.",
      "Langkah ini merupakan bagian dari tren yang lebih luas di mana tokoh-tokoh kunci meninggalkan OpenAI, termasuk keluarnya sementara salah satu pendiri Greg Brockman, di tengah perubahan signifikan di perusahaan tersebut."
    ],
    "commentSummary": [
      "Pendiri OpenAI, John Schulman, akan meninggalkan perusahaan untuk bergabung dengan perusahaan AI pesaing, Anthropic, yang menimbulkan kekhawatiran tentang masa depan OpenAI dan pengembangan ChatGPT 5.",
      "Kepergian Schulman, bersama dengan keluarnya tokoh-tokoh penting lainnya, menunjukkan potensi ketidakstabilan dan tantangan di dalam OpenAI, termasuk tingkat pembakaran dana yang tinggi dan masalah penggalangan dana.",
      "Anthropic dipersepsikan lebih berkomitmen terhadap keselamatan AI dan pertimbangan etis, sejalan dengan tujuan awal pengembangan AI."
    ],
    "points": 352,
    "commentCount": 245,
    "retryCount": 0,
    "time": 1722933595
  },
  {
    "id": 41165273,
    "title": "Bisakah kita menghentikan penurunan jumlah kupu-kupu raja dan penyerbuk lainnya?",
    "originLink": "https://www.wisfarmer.com/story/news/2024/08/05/can-we-stop-the-decline-of-monarch-butterflies-and-other-pollinators/74638545007/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41165273",
    "commentBody": "",
    "originSummary": [
      "Kupu-kupu raja dan penyerbuk lainnya di Wisconsin mengalami penurunan yang signifikan, seperti yang diamati oleh para konservasionis dan peneliti.",
      "Faktor-faktor yang berkontribusi terhadap penurunan ini meliputi cuaca ekstrem, hilangnya habitat, predator, kekeringan, perubahan iklim, dan insektisida, dengan sebuah studi dari Michigan State University yang menekankan dampak insektisida.",
      "U.S. Fish and Wildlife Service merekomendasikan menanam bunga asli, mengurangi penggunaan pestisida, dan menciptakan lingkungan yang ramah penyerbuk untuk mendukung spesies penting ini."
    ],
    "commentSummary": [
      "Diskusi berpusat pada upaya untuk menghentikan penurunan populasi kupu-kupu raja dan penyerbuk lainnya, dengan menekankan pentingnya menanam milkweed asli dan menghindari spesies invasif seperti milkweed tropis dan semak kupu-kupu.",
      "Kontributor berbagi pengalaman pribadi dan saran praktis tentang menciptakan lingkungan yang ramah penyerbuk, seperti menggunakan penutup jaring untuk melindungi ulat dan menanam berbagai tanaman asli.",
      "Percakapan tersebut menyoroti kekhawatiran lingkungan yang lebih luas, termasuk dampak praktik pertanian, penggunaan pestisida, dan hilangnya habitat terhadap populasi penyerbuk."
    ],
    "points": 271,
    "commentCount": 216,
    "retryCount": 0,
    "time": 1722889801
  },
  {
    "id": 41167615,
    "title": "Jiwa Memelihara Mesin Baru",
    "originLink": "https://books.worksinprogress.co/book/maintenance-of-everything/communities-of-practice/the-soul-of-maintaining-a-new-machine/1",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41167615",
    "commentBody": "",
    "originSummary": [
      "Dalam tahun 1980-an, teknisi Xerox mengandalkan interaksi sosial dan bercerita untuk merawat mesin fotokopi yang kompleks, karena dokumentasi formal tidak memadai.",
      "Studi antropolog Julian Orr mengarah pada proyek Eureka, sebuah basis data untuk berbagi tips di antara teknisi, yang meningkatkan efisiensi layanan dan mendorong terbentuknya komunitas praktik.",
      "Meskipun Eureka sukses di Prancis dan Kanada, Xerox kesulitan mengintegrasikan pengetahuan informal ini ke dalam praktik perusahaan yang lebih luas, sehingga kehilangan kesempatan untuk berorientasi pada layanan."
    ],
    "commentSummary": [
      "Artikel tersebut menyoroti dampak signifikan dari studi antropologi dan sosiologi dalam meningkatkan mesin fotokopi Xerox, yang mengarah pada perubahan desain dan pengurangan biaya perawatan.",
      "Itu menekankan pentingnya memahami konteks sosial penggunaan teknologi, dengan membandingkan produk sukses seperti Gmail dengan kegagalan akibat fokus internal, seperti banyak produk Google lainnya.",
      "Kajian ini mencakup refleksi tentang evolusi sikap terhadap masalah pengguna dan nilai teknisi perbaikan, yang menggambarkan bagaimana wawasan ini dapat mengarah pada pengembangan produk yang lebih baik dan kesuksesan perusahaan."
    ],
    "points": 232,
    "commentCount": 24,
    "retryCount": 0,
    "time": 1722916160
  },
  {
    "id": 41164885,
    "title": "Debugging sebuah segfault rustc di Illumos",
    "originLink": "https://sunshowers.io/posts/rustc-segfault-illumos/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41164885",
    "commentBody": "",
    "originSummary": [
      "Oxide menggunakan Helios, sebuah OS berbasis illumos, untuk komputer awan mereka, dan baru-baru ini memperbaiki kesalahan segmentasi di kompilator Rust pada illumos.",
      "Kecelakaan terjadi selama proses build tahap 0 dari pustaka standar Rust, khususnya pada komponen cranelift-codegen, karena ketidakmampuan pustaka stacker untuk mendeteksi ukuran tumpukan pada illumos.",
      "Hal-hal penting yang perlu diperhatikan termasuk kebutuhan untuk deteksi ukuran tumpukan yang lebih baik di stacker pada illumos, peningkatan pelaporan kesalahan, dan upaya kolaboratif dalam debugging menggunakan alat illumos seperti coreadm dan mdb."
    ],
    "commentSummary": [
      "Postingan tersebut membahas tentang debugging kesalahan segmentasi pada kompilator Rust (rustc) di sistem operasi Illumos, dengan menyoroti penggunaan alat-alat khusus Illumos dan teknik bootstrapping kompilator.",
      "The issue is not unique to Illumos and affects other platforms, but Illumos' tooling and APIs provide unique insights and solutions.",
      "Percakapan tersebut mencakup berbagai detail teknis, seperti penanganan core dump, pertumbuhan stack, dan penggunaan alat seperti DTrace dan truss, menjadikannya bacaan yang berharga bagi mereka yang tertarik pada debugging tingkat rendah dan internal sistem."
    ],
    "points": 220,
    "commentCount": 56,
    "retryCount": 0,
    "time": 1722887685
  },
  {
    "id": 41168889,
    "title": "X menutup kantor pusat di San Francisco dan memindahkan staf ke San Jose",
    "originLink": "https://fortune.com/2024/08/05/x-closing-san-francisco-hq-relocating-staffers-san-jose-palo-alto-shared-space-with-x-ai-linda-yaccarino-leaked-email/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41168889",
    "commentBody": "",
    "originSummary": [
      "X, yang sebelumnya dikenal sebagai Twitter, akan menutup kantor pusatnya di San Francisco dan memindahkan staf ke San Jose serta ruang bersama dengan x.AI di Palo Alto, sesuai dengan email yang bocor dari CEO Linda Yaccarino.",
      "Markas besar global Twitter di San Francisco, yang telah beroperasi sejak 2012, akan ditutup dalam beberapa minggu mendatang, sejalan dengan petunjuk sebelumnya dari Elon Musk tentang kemungkinan pindah ke Texas.",
      "Relokasi ini merupakan bagian dari strategi yang lebih luas untuk mendirikan lokasi utama baru di Bay Area, di tengah tantangan San Francisco yang sedang berlangsung untuk meremajakan pusat kota dan pasar real estat komersialnya."
    ],
    "commentSummary": [
      "X menutup kantor pusatnya di San Francisco dan memindahkan karyawannya ke San Jose.",
      "Kepindahan ini menandai perubahan signifikan bagi perusahaan, yang berpotensi mempengaruhi tenaga kerja dan operasinya.",
      "Kepindahan tersebut bisa didorong oleh berbagai faktor, termasuk penghematan biaya dan keputusan bisnis strategis."
    ],
    "points": 187,
    "commentCount": 2,
    "retryCount": 0,
    "time": 1722933451
  },
  {
    "id": 41167060,
    "title": "Rqlite 9.0: Mengurangi Penggunaan Disk Hingga Setengah",
    "originLink": "https://www.philipotoole.com/building-rqlite-9-0-cutting-disk-usage-by-half/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41167060",
    "commentBody": "",
    "originSummary": [
      "rqlite 9.0, sebuah basis data relasional terdistribusi sumber terbuka, bertujuan untuk mengurangi penggunaan disk sebesar 50% melalui perombakan desain tingkat tinggi.",
      "Desain baru, yang disebut Referential Snapshotting, menghilangkan kebutuhan untuk menyimpan salinan snapshot dari database SQLite yang sedang bekerja, mengurangi penggunaan disk dan meningkatkan efisiensi.",
      "Pembaruan ini juga akan membawa waktu snapshotting dan restart node yang lebih cepat, dengan rincian lebih lanjut tentang manajemen SQLite Write-Ahead Log (WAL) dan peningkatan yang mulus akan menyusul."
    ],
    "commentSummary": [
      "rqlite 9.0 telah dirilis, secara signifikan mengurangi penggunaan disk hingga setengahnya.",
      "rqlite adalah sistem manajemen basis data relasional terdistribusi (RDBMS) yang dibangun di atas SQLite dan algoritma konsensus Raft, dikenal karena kemudahan dalam penerapan dan operasinya.",
      "Meskipun throughput penulisan yang lebih rendah dibandingkan dengan database terdistribusi lainnya seperti CockroachDB dan TiDB, versi baru rqlite memperkenalkan peningkatan kinerja seperti Penulisan Antrian."
    ],
    "points": 165,
    "commentCount": 29,
    "retryCount": 0,
    "time": 1722907222
  },
  {
    "id": 41173223,
    "title": "Memperkenalkan Output Terstruktur dalam API",
    "originLink": "https://openai.com/index/introducing-structured-outputs-in-the-api/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41173223",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "OpenAI telah memperkenalkan keluaran terstruktur dalam API mereka, memungkinkan model untuk menghasilkan format keluaran spesifik, yang meningkatkan keandalan dan mengurangi biaya.",
      "Pembaharuan ini mendukung hingga 16k token keluaran dan mencakup penurunan harga untuk menangani input gambar, membuat AI lebih praktis dan mudah diakses.",
      "Walaupun beberapa pengguna khawatir tentang biaya komputasi yang tinggi dan potensi penyalahgunaan, penerimaan secara keseluruhan menyoroti pentingnya dan dampak dari kemajuan ini."
    ],
    "points": 137,
    "commentCount": 46,
    "retryCount": 0,
    "time": 1722966101
  },
  {
    "id": 41169195,
    "title": "KataStar 7, versi DOS terakhir yang pernah ada, dirilis ulang secara gratis",
    "originLink": "https://www.theregister.com/2024/08/06/wordstar_7_the_last_ever/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41169195",
    "commentBody": "",
    "originSummary": [
      "KataStar 7, versi terakhir dari pengolah kata untuk DOS, telah dirilis ulang secara gratis oleh penulis fiksi ilmiah Kanada Robert J Sawyer.",
      "Versi ini, yang digunakan oleh penulis terkenal seperti Arthur C Clarke dan George R R Martin, mencakup emulator DOS (DOSbox-X dan vDosPlus) untuk kompatibilitas dengan sistem Windows modern.",
      "Meskipun terakhir diperbarui pada tahun 1992 dan dianggap sebagai perangkat lunak yang ditinggalkan, WordStar tetap populer di kalangan penulis karena kesederhanaan dan fungsionalitasnya."
    ],
    "commentSummary": [
      "WordStar 7, versi DOS terakhir, telah dirilis ulang secara gratis oleh seorang penggemar, yaitu penulis Robert J. Sawyer, bukan oleh pemilik resmi.",
      "Kepemilikan properti intelektual WordStar tidak jelas, dengan pemilik potensial adalah Houghton Mifflin Harcourt atau Software MacKiev.",
      "Rilis ulang ini telah memicu diskusi tentang manfaat WordStar, seperti pengeditan blok yang fleksibel, dan perbandingan dengan alat modern seperti Vim dan LaTeX, serta percakapan tentang kloning perangkat lunak, masalah hak cipta, dan evolusi editor teks."
    ],
    "points": 137,
    "commentCount": 41,
    "retryCount": 0,
    "time": 1722937637
  },
  {
    "id": 41167561,
    "title": "Twitter menutup kantor pusatnya di San Francisco, akan pindah ke South Bay",
    "originLink": "https://sfstandard.com/2024/08/05/x-officially-kills-its-san-francisco-headquarters-will-relocate-workers-to-south-bay/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41167561",
    "commentBody": "",
    "originSummary": [
      "Bisnis X menutup kantor pusatnya di San Francisco dan merelokasi karyawan ke South Bay, dengan staf teknik pindah ke Palo Alto dan karyawan lainnya ke Santana Row di San Jose.",
      "Keputusan ini mengikuti akuisisi Elon Musk pada tahun 2022, yang mengakibatkan pemutusan hubungan kerja massal dan peralihan ke kerja penuh waktu di kantor.",
      "Perusahaan juga menyewakan kembali kantor-kantor Mid-Market-nya, menandai berakhirnya era bagi area tersebut yang telah mendapatkan insentif pajak khusus untuk menarik perusahaan teknologi."
    ],
    "commentSummary": [
      "Twitter memindahkan kantor pusatnya dari San Francisco ke South Bay, memicu diskusi tentang alasan keuangan, perjalanan karyawan, dan kondisi kota.",
      "Kepindahan tersebut diduga didorong oleh penghematan biaya, akses ke kumpulan bakat yang berbeda, dan lingkungan jalan yang menantang di sekitar kantor saat ini.",
      "Langkah ini merupakan bagian dari perubahan yang lebih luas di bawah kepemimpinan Elon Musk, termasuk pengurangan tenaga kerja yang signifikan dan perubahan kebijakan perusahaan."
    ],
    "points": 124,
    "commentCount": 440,
    "retryCount": 0,
    "time": 1722915050
  },
  {
    "id": 41172399,
    "title": "Karyawan Dell yang diberhentikan mencapai 12.500 orang",
    "originLink": "https://www.theregister.com/2024/08/06/dell_layoffs/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41172399",
    "commentBody": "",
    "originSummary": [
      "Dell telah memulai pemutusan hubungan kerja yang signifikan, mempengaruhi sekitar 12.500 karyawan, mengurangi jumlah tenaga kerjanya dari 120.000 menjadi di bawah 100.000.",
      "Perusahaan menyatakan bahwa pemutusan hubungan kerja adalah bagian dari reorganisasi untuk menjadi lebih ramping dan fokus pada TI modern dan AI, dengan banyak posisi yang dipangkas dari divisi penjualan.",
      "Pesangon termasuk gaji dua bulan ditambah satu minggu per tahun masa kerja, dan beberapa karyawan mencurigai bahwa mandat kembali ke kantor adalah pemutusan hubungan kerja terselubung."
    ],
    "commentSummary": [
      "Dell telah mengumumkan pemutusan hubungan kerja yang mempengaruhi 12.500 karyawan, mengurangi jumlah tenaga kerjanya dari 120.000 menjadi di bawah 100.000.",
      "Kompensasi pemutusan hubungan kerja mencakup gaji dua bulan ditambah satu minggu tambahan per tahun masa kerja, dengan batas maksimal 26 minggu.",
      "Spekulasi menunjukkan bahwa pemutusan hubungan kerja disebabkan oleh faktor-faktor seperti AI, inflasi, perekrutan berlebihan, dan masalah rantai pasokan, daripada kesalahan manajemen."
    ],
    "points": 111,
    "commentCount": 83,
    "retryCount": 0,
    "time": 1722961701
  },
  {
    "id": 41165117,
    "title": "Mengganti Logam Cair pada CPU Asus Zephyrus G15",
    "originLink": "https://flemesre.github.io/posts/liquid-metal-replacement/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41165117",
    "commentBody": "",
    "originSummary": [
      "Asus ROG Zephyrus G15, sebuah laptop gaming, menggunakan bahan antarmuka termal (TIM) untuk pendinginan, dengan model terbaru yang menggabungkan TIM logam cair untuk kinerja yang lebih baik.",
      "TIM logam cair, meskipun efektif, bersifat konduktif secara elektrik dan dapat bergerak, menimbulkan risiko; Asus mengatasinya dengan segel silikon dan penghalang busa.",
      "Mengganti TIM logam cair dengan PTM7950 phase-change TIM dari Honeywell, yang berbentuk padat pada suhu ruangan dan mencair pada suhu operasi, menyelesaikan masalah thermal throttling dan meningkatkan kinerja pendinginan."
    ],
    "commentSummary": [
      "Postingan tersebut membahas penggantian logam cair pada CPU Asus Zephyrus G15, menyoroti kekhawatiran dan pengalaman dengan antarmuka termal logam cair.",
      "Pengguna memperdebatkan terminologi dan keamanan penggunaan logam cair, dengan beberapa menyarankan alternatif seperti bantalan termal PTM7950 untuk keandalan yang lebih baik.",
      "Percakapan tersebut mencakup saran praktis tentang menangani logam cair, potensi risiko kebocoran, dan dampaknya terhadap kinerja serta umur panjang laptop."
    ],
    "points": 108,
    "commentCount": 76,
    "retryCount": 0,
    "time": 1722888921
  },
  {
    "id": 41170925,
    "title": "Saya membuat alat sederhana dan sumber terbuka untuk mengelola server dan kunci SSH",
    "originLink": "https://github.com/d3witt/viking",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41170925",
    "commentBody": "",
    "originSummary": [
      "Viking adalah alat yang dirancang untuk manajemen mesin jarak jauh yang sederhana, khususnya untuk server bare metal, menawarkan kontrol penuh dan kebebasan.",
      "Fitur utama termasuk mengelola kunci SSH, mengeksekusi perintah shell, dan menangani konfigurasi mesin, semuanya melalui antarmuka baris perintah.",
      "Alat ini tersedia untuk diinstal pada sistem Unix dan Windows, dan mendukung direktori konfigurasi kustom serta manajemen kunci SSH."
    ],
    "commentSummary": [
      "Alat sumber terbuka untuk mengelola server dan kunci SSH telah dikembangkan, menyederhanakan manajemen server dengan menghilangkan kebutuhan untuk mengingat IP server dan memberikan gambaran umum dengan perintah sederhana.",
      "Alat ini memiliki API modern dan telah memicu diskusi tentang keseimbangan antara metode tradisional (seperti mengedit file ~/.ssh/config) dan solusi yang lebih efisien serta ramah pengguna.",
      "Meskipun ada beberapa umpan balik negatif, pengembang menghargai dukungan dan saran untuk perbaikan, menyoroti pentingnya keamanan dalam manajemen SSH."
    ],
    "points": 106,
    "commentCount": 69,
    "retryCount": 0,
    "time": 1722952704
  },
  {
    "id": 41168033,
    "title": "Menulis server ubin dalam Python",
    "originLink": "https://www.grulic.org.ar/~mdione/glob/posts/writing-a-tile-server-in-python/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41168033",
    "commentBody": "",
    "originSummary": [
      "Telah mengembangkan satu set ubin berdasarkan data OpenStreetMap, dioptimalkan untuk rendering batch menggunakan skrip \"generate_tiles\" yang dimodifikasi.",
      "Diimplementasikan sebuah thread Master dan thread rendering untuk mengelola tugas rendering, antrian, dan penggunaan cache secara efisien.",
      "Dibuat loop non-blocking menggunakan API selector Python untuk menangani koneksi klien dan pekerjaan rendering, mendukung banyak klien dan rendering yang efisien."
    ],
    "commentSummary": [
      "Diskusi berpusat pada pembuatan server ubin di Python, dengan fokus pada konversi MBTiles vektor menjadi ubin raster dengan stylesheet tertentu.",
      "Berbagai pendekatan dan alat disebutkan, termasuk MapLibre Native, Mapnik, dan program C++ kustom, yang menyoroti kebutuhan akan solusi lintas platform dan rendering yang efisien pada perangkat dengan internet terbatas.",
      "Kami juga membahas tentang penanganan penutupan koneksi klien di Flask, dengan saran untuk meningkatkan penanganan acara di sisi server dan proses pembersihan."
    ],
    "points": 103,
    "commentCount": 16,
    "retryCount": 0,
    "time": 1722921945
  }
]
