[
  {
    "id": 40843867,
    "title": "Я создал альтернативу After Effects",
    "originLink": "https://pikimov.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40843867",
    "commentBody": "",
    "originSummary": [
      "Пикимов — это недавно запущенный веб-редактор для создания анимации и видео, вдохновленный Photopea, и служит бесплатной альтернативой After Effects.",
      "«Это не требует регистрации, сохраняет файлы на компьютере пользователя и гарантирует, что проекты не используются для обучения ИИ.»",
      "Создатель имеет опыт разработки программного обеспечения для VJ для таких платформ, как Game Boy Advance, Playstation 2 и Raspberry Pi."
    ],
    "commentSummary": [
      "«Pikimov — это новый бесплатный веб-редактор для создания анимации и видео, разработанный как альтернатива Adobe After Effects, не требующий регистрации или загрузки в облако.»",
      "Инструмент получил положительные отзывы за его потенциал бросить вызов доминированию Adobe, при этом пользователи предлагают улучшения в ограничениях частоты кадров, отчетах об ошибках и обработке ключевых кадров.",
      "В настоящее время Pikimov поддерживает только Chrome и Edge из-за специфических веб-API, с планами на будущее добавить функции сообщества и, возможно, монетизировать приложение."
    ],
    "points": 597,
    "commentCount": 166,
    "retryCount": 0,
    "time": 1719824246
  },
  {
    "id": 40843778,
    "title": "RegreSSHion: удаленное выполнение кода (RCE) в сервере OpenSSH на системах Linux, основанных на glibc",
    "originLink": "https://www.qualys.com/2024/07/01/cve-2024-6387/regresshion.txt",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40843778",
    "commentBody": "",
    "originSummary": [
      "Критическая уязвимость (CVE-2024-6387) в сервере OpenSSH на системах Linux, основанных на glibc, позволяет удаленное выполнение кода (RCE) из-за состояния гонки в обработчике сигналов.",
      "«Проблема, регрессия CVE-2006-5051, затрагивает версии OpenSSH 3.4p1, 4.2p1 и 9.2p1 и включает в себя использование обработчика SIGALRM для вызова повреждения кучи и выполнения произвольного кода.»",
      "«Смягчение включает в себя применение патчей, которые перемещают небезопасный для асинхронных сигналов код из обработчика SIGALRM, или установку `LoginGraceTime` на 0, хотя последнее может вызвать отказ в обслуживании.»"
    ],
    "commentSummary": [
      "Уязвимость удаленного выполнения кода (RCE) была обнаружена в сервере OpenSSH на системах Linux, основанных на glibc, что потенциально позволяет злоумышленникам получить удаленный доступ с правами root.",
      "Исправление этой уязвимости было реализовано путем перемещения небезопасного кода из обработчика сигналов в процесс слушателя, что затрудняет его обратное портирование.",
      "Проблема в основном затрагивает 32-битные системы, при этом эксплуатация на 64-битных системах считается возможной, но пока не продемонстрированной; различные дистрибутивы уже выпустили патчи."
    ],
    "points": 542,
    "commentCount": 211,
    "retryCount": 0,
    "time": 1719823254
  },
  {
    "id": 40841980,
    "title": "Пайпс: духовный преемник Yahoo Pipes",
    "originLink": "https://www.pipes.digital/docs",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40841980",
    "commentBody": "",
    "originSummary": [
      "Пайпс — это визуальный редактор программирования для фидов, позволяющий пользователям получать, создавать и манипулировать фидами с помощью блоков, аналогично Yahoo! Pipes.",
      "Он поддерживает различные форматы ввода, включая RSS, Atom, JSON, HTML и текстовые файлы, и предлагает ряд блоков для различных операций с лентами, таких как фильтрация, объединение и извлечение контента.",
      "Платформа Pipes CE является бесплатным программным обеспечением с открытым исходным кодом (FOSS) под лицензией AGPL, доступным на Github, и поддерживает интеграции с популярными сайтами, такими как Twitter, YouTube и Vimeo."
    ],
    "commentSummary": [
      "Проект Pipes, вдохновленный Yahoo Pipes, недавно прошел обновления для улучшения стабильности, включая переход от текста к объектам RSS для передачи данных между блоками.",
      "Были выполнены обновления сервера и перенастройка потоков и рабочих процессов Puma для устранения проблем и узких мест.",
      "Рассматривается предложение пользователя добавить блок для AI-сгенерированных резюме или изображений через POST-запросы, при этом некоторые основные блоки уже установлены."
    ],
    "points": 382,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1719799417
  },
  {
    "id": 40843848,
    "title": "Мои доработанные модели превосходят GPT-4 от OpenAI",
    "originLink": "https://mlops.systems/posts/2024-07-01-full-finetuned-model-evaluation.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40843848",
    "commentBody": "",
    "originSummary": [
      "Пост обсуждает метрики оценки для оценки производительности дообученных языковых моделей (LLMs) в извлечении структурированных данных из пресс-релизов, с акцентом на точность.",
      "Модели с тонкой настройкой, включая TinyLlama, Mistral и Solar LLM, в целом превзошли GPT-4 и GPT-4 Turbo от OpenAI по точности, несмотря на сложность и медленный темп оценок.",
      "Оценки подчеркнули необходимость улучшения системы для управления сложностью и обслуживанием, с будущими шагами, включающими тесты, не связанные с точностью, и исследование обслуживания моделей."
    ],
    "commentSummary": [
      "Специализированные модели могут превосходить общие модели, такие как GPT-4 от OpenAI, в конкретных задачах, таких как извлечение данных, креативное резюмирование, ответы на вопросы и классификация.",
      "Успех моделей с тонкой настройкой зависит от высококачественных данных для обучения, что делает их эффективными для извлечения нишевой информации и доступными для техноэнтузиастов.",
      "Тонкая настройка меньших моделей, таких как Llama 3 8B, может быть более эффективной и экономичной, но использование ответов модели для обучения новых моделей может нарушать условия обслуживания крупных поставщиков LLM."
    ],
    "points": 300,
    "commentCount": 77,
    "retryCount": 0,
    "time": 1719823984
  },
  {
    "id": 40843720,
    "title": "Городам нужно больше деревьев",
    "originLink": "https://herman.bearblog.dev/cities-need-more-trees/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40843720",
    "commentBody": "",
    "originSummary": [
      "Йоханнесбург, когда-то пустынный, превратился в «самый зелёный город в мире» после посадки миллионов деревьев для борьбы с пылью от добычи золота.",
      "Посадка деревьев в Йоханнесбурге была неравномерно распределена из-за апартеида, что подчеркивает социально-экономические различия.",
      "Городские деревья приносят значительные преимущества, включая снижение эффекта \"теплового острова\", выступление в качестве звуковых барьеров, улучшение эстетики, увеличение биоразнообразия и стимулирование активного отдыха на свежем воздухе."
    ],
    "commentSummary": [
      "Города все чаще сажают деревья и продвигают зеленые крыши, чтобы бороться с тепловым стрессом и улучшать условия жизни в городах.",
      "Утрехт, Нидерланды, и Цюрих, Швейцария, являются ведущими примерами, в то время как такие города США, как Портленд, штат Орегон, имеют зеленые мандаты, а Солт-Лейк-Сити исследует ксерискейпинг.",
      "Деревья предлагают значительные преимущества, такие как охлаждение городских районов, улучшение качества воздуха и повышение общей пригодности для жизни, несмотря на такие проблемы, как застройка частной собственности, приводящая к вырубке деревьев."
    ],
    "points": 273,
    "commentCount": 139,
    "retryCount": 0,
    "time": 1719822718
  },
  {
    "id": 40845951,
    "title": "Добро пожаловать в Ladybird",
    "originLink": "https://ladybird.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40845951",
    "commentBody": "",
    "originSummary": [
      "Ladybird — это независимый веб-браузер, разработанный некоммерческой организацией, с акцентом на производительность, стабильность и безопасность, с запланированным альфа-релизом на 2026 год.",
      "Изначально HTML-просмотрщик для SerenityOS, теперь он поддерживает Linux, macOS и другие Unix-подобные системы, и полностью построен с нуля без использования кода из других браузеров.",
      "Проект финансируется за счет спонсорства и пожертвований, без рекламы или монетизации пользователей, и в настоящее время разрабатывается командой из четырех штатных инженеров."
    ],
    "commentSummary": [
      "«Ladybird, изначально HTML-рендерер для SerenityOS, теперь превращается в кроссплатформенный проект браузера.»",
      "Проект получил значительное пожертвование в размере 1 000 000 долларов от соучредителя GitHub Криса Ванстрат, что свидетельствует о сильной финансовой поддержке.",
      "Команда планирует выпустить альфа-версию к 2026 году, делая акцент на модульности и соблюдении современных веб-стандартов."
    ],
    "points": 246,
    "commentCount": 62,
    "retryCount": 0,
    "time": 1719842693
  },
  {
    "id": 40839418,
    "title": "Почтовый код",
    "originLink": "https://en.wikipedia.org/wiki/Postzegelcode",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40839418",
    "commentBody": "",
    "originSummary": [
      "Почтовый код — это девятизначный код, используемый в Нидерландах в качестве рукописной альтернативы почтовым маркам, приобретаемый онлайн у PostNL.",
      "Введенный в 2013 году, код должен быть написан на почте в течение пяти дней и имеет 78,8 триллиона возможных комбинаций, что делает его защищенным от угадывания.",
      "«По состоянию на декабрь 2020 года 590 000 человек использовали почтовые коды, которые теперь стоят столько же, сколько и традиционные марки.»"
    ],
    "commentSummary": [
      "Обсуждение касается использования цифровых почтовых кодов, известных как «postzegelcode», которые можно писать на конвертах вместо традиционных марок.",
      "Различные страны, включая Германию, Данию, Норвегию и Швецию, внедрили аналогичные системы, позволяющие пользователям приобретать почтовые марки онлайн и писать код на своей почте.",
      "«Система хвалится за удобство, особенно для тех, кто не часто отправляет физическую почту, так как она устраняет необходимость в физических марках и адаптируется к изменяющимся почтовым тарифам.»"
    ],
    "points": 228,
    "commentCount": 95,
    "retryCount": 0,
    "time": 1719775062
  },
  {
    "id": 40847963,
    "title": "Верховный суд постановил, что бывшие президенты имеют иммунитет за официальные действия",
    "originLink": "https://apnews.com/article/supreme-court-trump-capitol-riot-immunity-2dc0d1c2368d404adc0054151490f542",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40847963",
    "commentBody": "",
    "originSummary": [
      "Верховный суд продлил задержку в уголовном деле Дональда Трампа по поводу выборов 2020 года, что уменьшает вероятность проведения суда до ноябрьских выборов.",
      "В решении 6 против 3, консервативное большинство суда предоставило бывшим президентам широкую неприкосновенность от уголовного преследования за официальные действия, что усложняет дело обвинения и требует дальнейшего анализа на уровне суда первой инстанции.",
      "Решение подчеркивает значительное влияние суда на предстоящие выборы, при этом главный судья Джон Робертс подчеркивает иммунитет для официальных действий, а судья Соня Сотомайор выражает несогласие, утверждая, что это подрывает принцип, согласно которому никто не выше закона."
    ],
    "commentSummary": [
      "Верховный суд постановил, что бывшие президенты имеют иммунитет за официальные действия, что вызвало дебаты о возможных злоупотреблениях властью и необходимости защиты президента.",
      "Решение уточняет, что иммунитет распространяется на действия в рамках конституционных полномочий, но не на неофициальные акты, вызывая обеспокоенность по поводу ответственности за серьезные преступления.",
      "Критики, включая судью Сотомайор, обеспокоены тем, что это решение может повлиять на текущие и будущие судебные дела, связанные с бывшими президентами."
    ],
    "points": 226,
    "commentCount": 325,
    "retryCount": 0,
    "time": 1719854392
  },
  {
    "id": 40840396,
    "title": "Свёртки, быстрое преобразование Фурье и многочлены (2022)",
    "originLink": "https://www.alvarorevuelta.com/posts/fft-polynomials",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40840396",
    "commentBody": "",
    "originSummary": [
      "Традиционное умножение многочленов имеет сложность \\(O(n^2)\\), что делает его неэффективным для больших многочленов.",
      "Быстрое преобразование Фурье (БПФ) снижает сложность умножения многочленов до \\(O(n \\log n)\\), преобразуя задачу в частотную область.",
      "Метод на основе БПФ включает преобразование многочленов в частотную область, их умножение и обратное преобразование результата, что значительно повышает эффективность для многочленов высокой степени."
    ],
    "commentSummary": [
      "«Обсуждение сосредоточено на использовании быстрого преобразования Фурье (БПФ) для умножения многочленов, подчеркивая его эффективность по сравнению с наивными методами.»",
      "Ключевые выводы включают важность числовой точности в расчетах БПФ и исторический контекст разработки БПФ для умножения многочленов.",
      "Разговор также касается практических приложений, таких как исправление ошибок, обработка сигналов и криптография с нулевым разглашением, где методы, основанные на БПФ, особенно полезны."
    ],
    "points": 211,
    "commentCount": 53,
    "retryCount": 0,
    "time": 1719781723
  },
  {
    "id": 40845304,
    "title": "Мой код на Python - это нейронная сеть",
    "originLink": "https://blog.gabornyeki.com/2024-07-my-python-code-is-a-neural-network/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40845304",
    "commentBody": "",
    "originSummary": [
      "Пост обсуждает встраивание программ в рекуррентные нейронные сети (RNN) и то, как обученные RNN могут превосходить написанные вручную алгоритмы.",
      "Он предоставляет подробный пример обнаружения программного кода в сообщениях, сравнивая простые правила принятия решений, написанный вручную алгоритм и подход на основе RNN.",
      "Пост подчеркивает преимущества RNN, такие как кодирование конечных автоматов, использование обучаемых активационных функций и выполнение сложных задач с дисциплиной, основанной на данных."
    ],
    "commentSummary": [
      "«В статье обсуждается создание нейронной сети с использованием Python, но отсутствуют подробности о тестировании и получении обучающих данных, что является важным для обеспечения обобщения модели на невидимые входные данные.»",
      "«Обсуждение подчеркивает Теорему универсального приближения, которая утверждает, что нейронные сети могут представлять любую функцию с желаемым уровнем точности, но подчеркивает, что обучение этим приближениям не гарантировано.»",
      "Существует дискуссия о том, заменяются ли рекуррентные нейронные сети (RNN) трансформерами, при этом некоторые утверждают, что у RNN все еще есть уникальные преимущества, такие как постоянное использование памяти, чего не хватает трансформерам."
    ],
    "points": 193,
    "commentCount": 43,
    "retryCount": 0,
    "time": 1719838058
  },
  {
    "id": 40846428,
    "title": "Кто нанимает? (Июль 2024)",
    "originLink": "https://news.ycombinator.com/item?id=40846428",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40846428",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Различные компании нанимают сотрудников на множество ролей, включая удаленные, офисные и гибридные позиции, в различных местах и отраслях.",
      "Известные компании включают Apple, Figma, Charge Robotics и SmileID, предлагающие должности, такие как старший инженер-программист, старший/ведущий инженер по безопасности и старший фронтенд-инженер.",
      "Возможности охватывают весь мир, некоторые компании предлагают спонсорство виз и роли в развивающихся технологиях, таких как ИИ, машинное обучение и full-stack разработка."
    ],
    "points": 191,
    "commentCount": 171,
    "retryCount": 0,
    "time": 1719846109
  },
  {
    "id": 40842867,
    "title": "«Программисты не должны доверять никому, даже самим себе»",
    "originLink": "https://carbon-steel.github.io/jekyll/update/2024/06/19/abstractions.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40842867",
    "commentBody": "",
    "originSummary": [
      "Программисты должны сохранять здоровый уровень скептицизма, так как написание и проверка правильности кода по своей сути являются сложными и часто невозможными задачами.",
      "Абстракции, упрощая сложные системы, могут давать сбои и приводить к таким проблемам, как снижение производительности или неопределенное поведение, как это подчеркивается Законом протекающих абстракций Джоэла Спольски.",
      "Чтобы смягчить неизвестные проблемы, программисты должны проверять информацию, тестировать убеждения и измерять влияние изменений в коде, при этом постоянно изучая новые платформы, языки, инструменты и технологии."
    ],
    "commentSummary": [
      "Обсуждение сосредоточено на важности формальной верификации в программировании, подчеркивая, что программисты не должны доверять никому, включая самих себя, без доказательств.",
      "«Формальная верификация, хотя и сложная и дорогостоящая, обеспечивает более сильные гарантии правильности по сравнению с модульными тестами, которые охватывают только конкретные примеры.»",
      "Дебаты подчеркивают компромиссы между строгостью формальной верификации и практичностью модульных тестов, предполагая, что выбор зависит от требований и ресурсов проекта."
    ],
    "points": 172,
    "commentCount": 139,
    "retryCount": 0,
    "time": 1719812397
  },
  {
    "id": 40840315,
    "title": "Унификация в Elixir",
    "originLink": "https://www.ericpfahl.com/from-pattern-matching-to-unification/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40840315",
    "commentBody": "",
    "originSummary": [
      "Унификация в Elixir расширяет сопоставление с образцом, позволяя использовать переменные по обе стороны уравнения, решая символические уравнения и создавая отображения подстановок.",
      "«В отличие от сопоставления с образцом, унификация может обрабатывать частично известные значения, что делает её мощным инструментом для логического программирования в Elixir.»",
      "«Алгоритм унификации включает в себя обход терминов, проверку эквивалентности, обработку переменных и рекурсивную унификацию элементов списка, упрощая присваивание переменных через подстановку.»"
    ],
    "commentSummary": [
      "Статья сравнивает эффективность алгоритмов унификации в выводе типов, сосредотачиваясь на алгоритме W и алгоритме J.",
      "«Алгоритм W, используемый в выводе типов Хиндли-Милнера, менее эффективен и более подвержен ошибкам из-за необходимости составления подстановок.»",
      "Алгоритм J, который использует структуру данных объединения-поиска для деструктивного объединения, является более простым и эффективным, с дополнительными сведениями об объединении в сопоставлении с образцом и компилированном сопоставлении с образцом с использованием деревьев решений."
    ],
    "points": 155,
    "commentCount": 26,
    "retryCount": 0,
    "time": 1719781112
  },
  {
    "id": 40840699,
    "title": "«Сайт Google Arts and Culture, о существовании которого я не знал»",
    "originLink": "https://artsandculture.google.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40840699",
    "commentBody": "",
    "originSummary": [
      "«Google Arts & Culture предлагает широкий выбор виртуальных туров и интерактивных впечатлений, позволяя пользователям исследовать искусство, историю и культуру со всего мира.»",
      "«Основные моменты включают виртуальные туры по знаменитым музеям, впечатления с дополненной реальностью (AR) и интерактивные игры, которые делают изучение искусства и культуры увлекательным и доступным.»",
      "Особенности включают возможность исследовать библиотеку Ван Гога, совершить 3D-тур по картинам Вермеера и принять участие в танцевальном челлендже K-Pop в сотрудничестве с Музеем Виктории и Альберта."
    ],
    "commentSummary": [
      "«Google Arts and Culture — это менее известный, но значимый проект Google, предлагающий курируемый культурный контент со всего мира.»",
      "Пользователи ценят его изображения высокого разрешения и уникальные функции, такие как возможность приближать произведения искусства и исследовать различные культурные проекты.",
      "Платформа активна с 2011 года и продолжает оставаться ценным ресурсом для любителей искусства и культуры, несмотря на опасения по поводу долговечности проектов Google."
    ],
    "points": 154,
    "commentCount": 42,
    "retryCount": 0,
    "time": 1719784504
  },
  {
    "id": 40839830,
    "title": "Newswire: крупномасштабная структурированная база данных вековой исторической новостной информации",
    "originLink": "https://arxiv.org/abs/2406.09490",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40839830",
    "commentBody": "",
    "originSummary": [
      "Исследователи создали обширный архив новостных материалов США за период с 1878 по 1977 год, используя конвейер глубокого обучения для обработки изображений сканов из местных газет.",
      "Набор данных включает 2,7 миллиона уникальных статей из общественного достояния, геопривязанных, помеченных по темам и связанных с Википедией, предоставляя ценную информацию для исследований в области компьютерной лингвистики, социальных наук и цифровых гуманитарных наук.",
      "Проект включал транскрибирование 138 миллионов структурированных текстов статей и использование нейронной модели би-энкодера для удаления дубликатов статей, обеспечивая включение только контента, находящегося в общественном достоянии."
    ],
    "commentSummary": [
      "Создана обширная база данных исторических новостей до 1978 года, отражающая изменения в законах об авторском праве, и она доступна на GitHub, хотя в настоящее время пуста.",
      "Пользователи выявили ошибки OCR (оптического распознавания символов) в данных, подчеркивая постоянные трудности в оцифровке исторических текстов.",
      "Проект, несмотря на его проблемы, высоко оценивается за его научную ценность, а необработанные сканы доступны через цифровую коллекцию Библиотеки Конгресса."
    ],
    "points": 150,
    "commentCount": 32,
    "retryCount": 0,
    "time": 1719777526
  }
]
