[
  {
    "id": 35366955,
    "timestamp": 1680142643,
    "title": "US Ban Bill Raises Concerns for VPNs & TikTok",
    "url": "https://www.youtube.com/watch?v=FWQGA_n5Z4M",
    "hn_url": "http://news.ycombinator.com/item?id=35366955",
    "content": "The TikTok Ban Bill is a bipartisan bill, supported by the White House, and some argue that it is Patriot Act Version 2.0. It does not expressly mention TikTok but applies to \"desktop applications\", \"mobile applications\", \"gaming applications\", \"payment applications\", \"web-based applications\" with more than a million users per year, and grants fines up to $1M and 20 years of imprisonment. It also makes it illegal to properly run a VPN and uses civil forfeiture. Due to its general language, the bill could be seen as an attack on civil liberties, despite being a tool that is aimed at regulating the Internet. Commentators suggest that voting third party and civil disobedience are the only levers that the public can exercise when representatives no longer represent.The lack of safety nets in America means that people on the bottom have no choice but to work in whatever tyranny is imposed upon them. To ensure equal voting rights, there should be a national holiday for voting, and a minimum number of polling stations per ten thousand people. State limitations on polling station placement and hours of operation should also be set. While some Americans believe other issues are more important, this bill has bipartisan support. The Snowden affair highlighted the government's overreach, and Greenwald has since gone on to vigorously defend civil liberties. While many criticize Snowden for defecting to Russia, others note that he was trying to leave the country when his passport was revoked, and has been forced to live there since. Comparisons to China and the Soviet Union's mass surveillance are also considered.A new US bill that aims to ban government employees from using TikTok on work devices also extends to certain Chinese hardware and software products. The legislation has bipartisan support and focuses on national security concerns related to China. It also applies to companies that have links to China or any suppliers in the country. The bill enshrines a host of measures, including a prohibition on government investing in Chinese equity and precludes exports to Chinese companies and their affiliates that make use of the US’s tech to further surveillance activities. Those not in compliance with the bill face a fine of up to $1m and 20 years in jail. The legislation has drawn concern from US businesses with Chinese ties.The proposed bill has raised concerns as it could effectively make VPNs illegal, punishable with a criminal penalty of up to $1 million in fines and up to 20 years in prison. Some argue that the broad language of the bill could allow for abuse and government overreach, with nebulous phrases such as \"any regulation, order, direction, mitigation measure, prohibition, or other authorization or directive issued\" creating concerns. While some argue that such penalties are justified in cases of large-scale fraud or other similar crimes, others feel that the bill is overly broad and poses a threat to individual privacy. Additionally, the bill has been criticized for its potential impact on freedom of speech and expression.The debate surrounding the proposed bill that would ban TikTok in the US is still going on. Some argue that TikTok is dangerous, while others say that the ban would be a danger to democracy. The discussion has led to arguments over whether TikTok is an idea or a tangible object, and whether its banning would be similar to banning other dangerous ideas. Some fear that laws like this may lead to a crackdown on free speech and could be used for political purposes. However, others argue that the government is ultimately restricted by the people, and that laws like this are necessary to protect public safety. The debate continues, with both sides presenting their arguments.A new bill called the \"Strategic Competition Act of 2021\" is currently moving through the US Senate, which could have implications for popular Chinese-owned app TikTok. The bill targets China for what it describes as malign behaviour to gain global dominance and includes provisions restricting business dealings with China. Although TikTok is not specifically named in the bill, its broad definition of a \"transaction\" includes \"use of any information and communications technology product or service\". Critics argue that this could allow for the prosecution of US residents who download or use the app. However, supporters argue that the bill is necessary to safeguard US interests and counter Chinese aggression. The bill has significant bipartisan support in the US Senate.The US Senate has unanimously passed a bill which makes it illegal for people to send unsolicited messages online if they disguise themselves as someone they are not, known as \"spoofing\". The new law will also restrict the use of automated messaging services known as \"bots\". Billions of such messages are sent each year, many of them by spammers claiming to offer loans or other financial services. The new law follows complaints from consumers. The ban contained in the bill will be enforced by America's telecoms regulator, the Federal Communications Commission.Discussions on a Hacker News post cover a range of topics related to the use of VPNs in China, the proposed TikTok ban, and the lack of privacy laws in the United States. Commenters dispute whether a recent bill makes it illegal to use a VPN, with some arguing that it only makes it illegal to use a VPN to bypass business restrictions. Others express their opposition to the bill, with one commenter calling it \"terrifying and much worse than the Patriot Act.\" Discussion also centers around the TikTok ban, with some agreeing with Alexandria Ocasio-Cortez's call to establish a regulatory framework for data privacy instead of banning the app, while others argue that the ban is necessary due to national security concerns.The US government is considering banning TikTok due to national security concerns, alleging that it poses a threat as a “state-sponsored” app. However, EU independent countries are not bound to follow the US trends or laws; rather, they have their own legal structure which may require legal amendments before a ban can take place. Huawei, for example, was banned in the UK and Germany for 5G infrastructure on security grounds, but the rest of NATO did not pay much attention. Banning TikTok may trigger resentment among young people and partial retaliation against the US government. Instead of imposing a ban, the US needs to create a regulatory framework where companies will be obliged to follow certain rules, as TikTok’s ban is not just focused on “spyware” but is a ban on a media not fully within the control of the US.Some commentators dispute claims that TikTok challenges are more dangerous or conspiratorial than those found on other social media platforms such as YouTube and Vine. A security researcher suggested that TikTok's Android app had the capability to receive and execute remote code. This function is not unique to TikTok, however, with a number of larger apps using it to some extent. The platform lets users download code from anywhere and sideload it into an app. In response to the claims that TikTok poses a security risk, some have suggested that more effort should be made to teach children how to make better decisions online.",
    "summary": "A US ban bill supported by the White House and aimed at regulating the internet could make VPNs illegal, grant fines up to $1M and 20 years of imprisonment, and be viewed as an attack on civil liberties. The bill has bipartisan support, focusing on national security concerns related to China and limiting business dealings with the country. The EU may not follow suit with the US trend, as countries have their own legal structure, and TikTok's ban may lead to resentment among young people and retaliation against the US government. The ban's critics argue that it threatens individual privacy and freedom of speech and expression.",
    "original_title": "TikTok Ban Bill Is Patriot Act 2.0 Trojan Horse [video]",
    "hn_title": "TikTok Ban Bill Is Patriot Act 2.0 Trojan Horse [video]"
  },
  {
    "id": 35373019,
    "timestamp": 1680185676,
    "title": "Mixed views on Y Combinator's value for startups",
    "url": "https://acecreamu.substack.com/p/is-y-combinator-worth-the-money",
    "hn_url": "http://news.ycombinator.com/item?id=35373019",
    "content": "A recent post on Hacker News shared one founder's experience of Y Combinator's W22 batch. While the author found that YC is \"100% what you make of it\" and is a valuable network, readers criticized the advice provided and the value in taking YC's advice. One commenter argued that this is normal behavior for any type of advice and that it depends on the context of the situation. Another commenter noted that while YC may not be beneficial for all types of startups, being associated with YC can open doors, provide access to a valuable network, and offer support for first-time founders. The consensus among commenters seemed to be that YC is worthwhile for some startups, depending on the specific needs of the company in question.The value of Y Combinator (YC) as a program for startups is a matter of perspective, according to comments from individuals familiar with the system. They noted that it all depends on what founders wish to get out of the program, and how hard they are willing to work to achieve their goals. YC provides access to experienced entrepreneurs and opportunities to interact with a network of investors and mentors. However, the advice given may not always be the right advice, and founders are often required to evaluate advice and decide whether to follow it or not. Ultimately, the value of YC lies in the founder's ability to make use of the program's resources, including network and mentorship, to maximize their chances of success.startups should prioritize building a valuable product and talking to users, rather than focusing on marketing tactics and hype, according to Y Combinator partner, @dang. Some commenters express concern that this advice may be outdated and not effective for startups today, as the market has become more competitive. However, others argue that building a unique product and developing a strong moat is still important. Additionally, YC's reputation and network can be valuable for fundraising and protecting against bad actors. Some suggest taking on more technology risk and considering government contracting to fund R&D. Overall, opinions are mixed on the effectiveness of YC and accelerators for startups, with some suggesting that it is beneficial to participate in at least one accelerator, while others caution against doing it more than once.A founder who completed the Y Combinator startup accelerator programme in the Winter 2022 batch has said that the value of the scheme may be overrated, despite its fundraising and branding advantages. In a Hacker News comment, the founder – who has semi-deleted their account – said the programme’s advice was largely drawn from a 10- to 15-year-old era of startups, and that it played down the contemporary importance of marketing. They added that many startups, including Slack, became successful without receiving significant backing or having niche expertise, instead succeeding by simply “doing anything at all”. The founder concluded that so-called moats or differentiation could be built around even relatively small, easily copied features.\nA Y-Combinator (YC) alum has shared their thoughts on the accelerator program in a review that highlights both the advantages and disadvantages of participating in the program. While the writer acknowledges the value of YC's ability to provide access to other founders and a fundraising platform, they also note the downsides, including the difficulty of building personal connections in a remote-only format and a sense that the program is geared towards short-term goals rather than long-term strategic planning. Despite these criticisms, the writer believes that YC still offers impressive benefits and underscores the importance of taking advantage of the program's resources to maximize these opportunities. The review concludes by emphasizing the long-term value of the relationships that can be built through participating in YC.A Y Combinator alumni wrote a \"scathing\" review of the startup accelerator, but also notes that Y Combinator helped them shut down their company before they lost everything, and returned all the money to investors. They criticised Y Combinator for only teaching startups to focus on building a product and talking to customers, rather than anything else, and that the accelerator didn't help them with fundraising beyond telling startups to follow their simple framework. The author preferred the storytelling and vision side of fundraising. Others in the comments section noted that Y Combinator's framework helps with investor due diligence that focuses on hard facts over sentiment or storytelling, and that Y Combinator's reputation management can provide startups access to good investors since Y Combinator is not selling a lemon.Despite some negative sentiment from Y Combinator (YC) alumni who did not have successful experiences, the incubator has been seen as transformational for companies, with hard-to-find networking opportunities and a powerful brand, according to current and former participants in the scheme. One key is for applicants to understand YC's focus can shift from early-stage product development to business results and finances, depending on the timing of the application. Opinions varied when it came to virtual programs, however, with some saying the experience was too shallow and that the community was weak, with a lack of interaction leading to isolation. Participation in YC requires hard work and investment in the community, attendees said.Comments on a post about Y Combinator (YC) vary in their assessment of the startup accelerator program. Some comments suggest that having a referral could increase a startup's chances of acceptance, while others argue that the benefits of YC, including its network and advice, depend on how founders utilize them. One commenter believes that YC is still geared towards startups that investors may not take a chance on, while another suggests that removing the relocation requirement was a mistake as the founder experience is degraded outside of San Francisco. The $500k uncapped SAFE deal is also discussed, with some critics arguing that it blocks the flexibility of fundraising and dilutes the value of the company. Meanwhile, others see YC as a brand that provides a exclusive and valuable network for startups.The comments section on this article discusses the pros and cons of participating in the Y-Combinator (YC) accelerator program. Some commenters express concern that YC's focus on scale is taking away from the community aspect of the program, while others argue that scale is necessary for YC to achieve its goals. Some also discuss the value of YC's network and how it can differ for companies based in Silicon Valley versus other locations. There is debate about whether YC only invests in companies with unicorn potential and whether this leaves some founders feeling forced to pursue unsustainable growth instead of a lifestyle business. There is also discussion of alternative investment options for founders who don't want to take on the pressure and expectations of YC.The author of this article shares their personal experience as part of the Y Combinator (YC) W22 batch, offering a brutally honest review of the value of the program. While acknowledging that experiences will differ depending on the company and batch, the author expresses disappointment with the program's network, mentorship, and overall value for the equity given. They note that due to the remote nature of the program and the large number of companies participating, little sense of community or connection is built among batchmates. They also criticize the \"one-size-fits-all\" approach to mentorship, and argue that the program's emphasis on scaling at all costs may not be beneficial in the current economic climate. The author does note the importance of YC's early support for startups that have not received recognition elsewhere.A start-up founder has given a \"brutally honest\" review of attending Y Combinator (YC). The founder said YC's advice is focused on early-stage companies and may not help those with existing revenue; he wasn't helped greatly by personal consultations with YC partners. The advice given is centred on building a product and talking to customers, rather than using paid advertising, content, or hiring. The author said the \"feeling in the air\" was that YC wants to \"cram everyone into their framework\" and company valuations aren't far from those outside of YC. Although YC generates its main value from Demo Day, good companies are likely to close their funding a week before, leaving only small funds and angels to invest.",
    "summary": "Opinions on the value of Y Combinator (YC) for startups are mixed, depending on individual perspectives and needs. While some value YC's network and mentorship, others criticize its advice and focus on short-term goals. YC's reputation and brand can help with fundraising, but its uncapped SAFE deal and emphasis on scaling at all costs may not suit all founders. The importance of community-building and personal connections in the remote-only format is also debated. Ultimately, the value of YC depends on a founder's ability to make use of its resources to maximize chances of success.",
    "original_title": "Is Y Combinator worth the money? Brutally honest review of W22 batch experience",
    "hn_title": "Is Y Combinator worth the money? Brutally honest review of W22 batch experience"
  },
  {
    "id": 35373052,
    "timestamp": 1680185826,
    "title": "Scratch: Popular Visual Programming Language for Kids",
    "url": "https://scratch.mit.edu/about",
    "hn_url": "http://news.ycombinator.com/item?id=35373052",
    "content": "Scratch is a coding platform designed for children to explore creative tools for computation. Scratch is not focused on learning specific programming languages or STEM/STEAM application development. Instead, the aim of Scratch is to provide a low entry point for children interested in gaining interactive experience in a subject or problem they are passionate about. Scratch also puts a heavy focus on peer interaction and sharing work to receive feedback. Scratch's frontend uses a sophisticated virtual machine interpreter within a JavaScript environment in browsers. Scratch Blocks, the building blocks of Scratch, was created in collaboration with the Blockly project. Though Scratch has a substantial presence in the backend, its design maintains a simple, user-friendly approach to encourage children to explore computation in a creative manner.Users on Hacker News discussed their experiences with Scratch, a visual programming language aimed at children, and its impact on their programming journeys. One user praised Scratch as \"a brilliant first language for children\", while another noted that its aim is creativity and cognitive exploration rather than training kids to be software engineers. A former Scratch engineer suggested using the contact form again if they were in need of support. Users also shared their own experiences introducing their children to Scratch, including the fun of user-testing and the challenges of navigating its unregulated social media network.Parents and teachers using Scratch in the classroom need to be able to create accounts for kids that are not part of the community to protect children from potentially harmful comments and behaviors. Running an offline version of Scratch solves this issue, allowing kids to create something to play a game rather than getting lost in a community. There is also concern that children are playing video games instead of using Scratch for educational purposes. However, Scratch’s visual UI and sharable context make it great for many things, and some people continue to use it as adults. To move on to other programming languages, find small communities, and compelling projects. Additional learning options may include Code.org, Microsoft Makecode editor, Python, Javascript, Processing, Snap, and beetleblocks.Users on a Hacker News thread discussed platforms similar to Scratch that teach programming using Python. Hedy was mentioned as one such platform that gradually introduces Python by walking users through increasingly more complicated levels with gradually-increasing toolkits. It was noted that Hedy detects variables within strings, making it easier for users to understand their use. Other platforms mentioned include CodeWars, Lego Mindstorms, and microStudio. Some users suggested that Scratch is the best platform for young children, while others recommended retaining a focus on Scratch fundamentals to avoid jumping to Python prematurely. Alternatively, users proposed trying out Roblox as a way to encourage kids to learn coding, citing its ease of use and ability to share 3D environments with friends.Scratch, a visual programming language developed by MIT, has become a widely popular tool for teaching children how to code. With a simple block-based interface, even kids as young as four years old can learn the fundamentals of coding and create their own animations, games, and stories. Scratch's community is also one of the largest coding communities in the world, with over 103 million users and 123 million projects shared on the platform. Other tools for teaching children coding include Roblox Studio, BBC microbit, turtleSpaces, and CodeSpark Academy. Some users have also noted that Scratch has its roots in Logo, a turtle graphics program developed in the 1960s.Scratch, the visual programming language for children, has surpassed 60 million registered users, making it one of the largest coding communities in the world. Scratch, which is free and aimed at children aged eight to 16, lets users select blocks of code and snap them together to create animations, games or interactive stories. The system was created by the Massachusetts Institute of Technology's Media Lab a decade ago, and has since become increasingly popular worldwide. Scratch doesn't require users to verify their email addresses, thereby making the barrier to entry much lower. Sites including Microsoft have followed Scratch's example of visual coding language for children. Microsoft Loop, its Teams-based visual development platform, was launched earlier this month.Scratch, a visual programming language designed for children, has gained popularity among children and educators alike, with over 56 million users in 150 countries. Created by the MIT Media Lab, Scratch uses colorful blocks instead of text-based coding to help children learn programming concepts. The program includes basic programming principles such as variables, lists, if/else and looping control flow structures and event-based concurrency. Scratch has inspired many children to become interested in programming, some even creating projects as advanced as ray tracing, RPG makers and 2D RPG games. While Scratch is popular among children, it has many applications from beginner coding to advanced programming skills. However, Scratch lacks parental controls on social aspects of the platform, with users having the option to send messages to other users.Scratch, a block-based visual programming language created by the Lifelong Kindergarten Group at the Massachusetts Institute of Technology (MIT), has become an increasingly popular tool for introducing children to coding. It allows users to create interactive stories, games, and animations, and has a community with millions of projects available to explore. Scratch has been available since at least 2007, with numerous updates and new features added over the years. It has been praised for teaching children how to follow the \"hacker ethic\" and promoting methodical cognitive thinking, though some users have found it confusing or frustrating. Several related tools and plugins have also been developed, including Scratch for Arduino and Scratch with LEGO Boost.",
    "summary": "Scratch is a popular visual programming language aimed at children, which uses colorful blocks instead of text-based coding to help them learn programming concepts. The program includes basic programming principles such as variables, lists, if/else and looping control flow structures and event-based concurrency. Scratch has a simple, user-friendly approach to encourage children to explore computation in a creative manner, as well as a heavy focus on peer interaction and sharing work to receive feedback. Scratch's community is one of the largest coding communities in the world, with over 103 million users and 123 million projects shared on the platform. While there are concerns regarding unregulated social media networks and children playing video games instead of using Scratch for educational purposes, the tool has inspired many to become interested in programming, with projects ranging from beginner coding to advanced programming skills.",
    "original_title": "Scratch is the world’s largest coding community for children",
    "hn_title": "Scratch is the world’s largest coding community for children"
  },
  {
    "id": 35371750,
    "timestamp": 1680180141,
    "title": "Challenges & Tradeoffs in LED Lighting Technology",
    "url": "https://nymag.com/strategist/article/led-light-bulbs-investigation.html",
    "hn_url": "http://news.ycombinator.com/item?id=35371750",
    "content": "There are issues with LED bulbs, particularly retrofit E27 bulbs. The emitters are often driven hard for cost reasons, leading to quick failure, and power supplies are also driven hard for cost reasons, leading to quick failure. LED bulbs also often come with poor color rendering index and spectral similarity indexes, flicker and dim-to-warm is uncommon. The power supplies are also often poorly designed, and the same quality of indoor lighting is significantly more expensive when using LEDs. Additionally, LEDs mix exceptionally poorly, which makes things even more expensive. Many LED bulb failures are due to overheating of the power supply, and retrofit bulbs generally work poorly. Nonetheless, certain high-end LEDs can provide a more efficient and cost-effective solution in some circumstances.LED lighting technology requires constant-current supplies and can't work well with constant voltage. A current driver circuit is necessary, even with DC input. A quality power supply won't produce flicker. If a constant current supply can output between zero volts and input volts, it can power an incandescent bulb. Conventional lamp sockets were designed around the constraints of incandescent bulbs, which generate significant amounts of heat. LED bulbs do the opposite, generating limited heat near the screw, and must be designed differently. For instance, finned LED bulbs have more surface area for heat dissipation. If LED bulbs are to replace conventional sockets, the present form-factor must be changed to suit the new technology. Replacing hardwired LED fixtures with conventional sockets is a solution to be explored. Use of a standardized 48VDC socket for future LED bulbs would be a game-changer. Low voltage DC lighting has existed for quite some time, but cultural perceptions must change before it becomes more widespread.LED lighting requires a constant-current power supply, as distribution at constant-voltage does not work well. The power supply must be close to the LEDs, or fluctuations in supply voltage will have negative effects. Cheap LED bulbs cycle at low frequencies, causing perceptible flickering. Conversely, modern switch-mode power supplies operating in the 50-500khz range will not cause perceivable flickers. Cheap LEDs themselves rectify straight AC using a large number of tiny LEDs in series, which flicker at 120hz, inducing migraines in susceptible people. Branding is important, as flickering lights drive away customers. LED bulbs may fail due to inefficient power supplies or burnt-out LEDs. LEDs are heat-sensitive and fail quickly if exposed to heat in enclosed fixtures.Discussion about the lifespan and quality of LED bulbs, with some commenters stating that older bulbs tended to be more prone to failure and that heat buildup and poor fixture design can also affect their lifespan. Others noted that LED bulbs can be very cheap and replaceable, but using them for DIY projects can still be useful for reducing electronic waste. The thread also includes commentary about the difficulty of desoldering surface mount LEDs and caution against using LEDs that have been overdriven to maximize light output, which can decrease their lifespan and decrease their luminosity and color temperature. Overall, the discussion revolves around the tradeoffs between cost, durability, and sustainability in LED lighting.Comments discuss the reliability and durability of LED bulbs. Some users report bulbs that have lasted for years, while others report frequent failures. Some suggest that cheaper, off-brand bulbs are more likely to fail, while others suggest that overheating in fixtures can lead to failures. Users also note that flickering can be a problem with LED bulbs, and that not all bulbs are created equal in terms of quality. There is discussion around the environmental impact and cost of LED bulbs, as well as the need for stronger warranties to ensure better quality control in manufacturing. Overall, the comments suggest that LED bulbs have made progress but still have room for improvement in terms of reliability and durability.A discussion on LED lighting on Hacker News covered topics including cost, quality and technical specifications. One user cited a vendor, Waveform Lighting, as a source of high-quality LED bulbs, however, another user questioned whether they were worth the $150 a pack price tag. Discussion around the topic of color temperature and color rendering index (CRI) arose, with users suggesting that low CRI can make it hard to see, and that CRI measurements may not fully capture how well an LED renders light. Some users discussed the pros and cons of LED versus incandescent lighting, while others noted potential problems with infrastructure funding as people become more energy-efficient, meaning maintenance costs may stay the same but revenue from power supply may drop.LED bulbs produce less heat than incandescent bulbs, but high-powered LEDs require a heat sink to not be damaged. LEDs are more sensitive to heat than incandescent bulbs, and small amounts of heat cause gradual dimming. It is difficult to buy high-quality LEDs that meet various qualifications. The lifetime of LED bulbs is not substantially longer than incandescent bulbs, and e-waste issues arise when replacing them every 2-3 years. High-end fixtures have compatibility issues with dimmer switches, LED-compatible dimmer switches have low compliance rates to standards, and an LED with a >5% failure rate in the first 5 years should be banned. The E27 bulbs have issues and retrofitting can be troublesome - many consider designing a fixture easier than retrofitting a bulb.A discussion on a forum about the quality of LED lighting revealed that many factors contribute to seemingly lower-quality options available today. These include LED emitters driven hard for cost reasons, power supplies driven hard for similar cost reasons, and poorly designed power supplies that age and fail quickly. Additionally, many retailers prioritize low cost above quality, and consumers often do not remember or research the brand of light bulb they purchase. However, there are still higher-quality LED options available, albeit at a higher price point. Some users have found success with Kauf brand smart-bulbs, which come pre-flashed with ESPHome for integration with home automation systems. Others recommend Soraa Vivid A19 bulbs for better color rendering.LED lights have become the go-to choice for energy-efficient lighting, but as one person recalls, buying lightbulbs before LEDs had its own challenges, such as deciding between bargain and luxury options, tracking receipts for \"double life\" brands, 3-way bulbs in regular lamps and the annoyance of flickering or fire hazards. Nowadays, LED lightbulbs are replacing fixtures with custom LED panels - which drives up costs if the fixture fails - but the saving grace is that we have more information to help us make the right choice. CRI ratings on boxes have been a good change, but built-in specialty lighting sources are increasing. The good news: high-quality LED bulbs are still cheaper to purchase than incandescent bulbs.A federal ban on traditional incandescent bulbs means that LED lights will soon be the only lighting available, but many are finding the new light poorly produced. The new bulbs are supposed to last much longer than traditional bulbs while conserving energy but reports of flickering and unreliable lighting have been detracting from the public’s perception of them. The Office of Energy has postponed a full enforcement of the ban till August, but after then traditional bulbs will no longer be available. The industry is still developing new technology to produce high quality LED lighting. The bulbs’ reputation can still be salvaged and there is potential for it to become aesthetically fabulous, however, without development and innovation, good light will only be available to the technologically savvy.The Metropolitan Museum of Art's (Met) lighting designer, Amy Nelson, is in charge of a long-running project to upgrade the museum's lights to LED but she is finding the task more challenging than she originally anticipated. Unlike an old-fashioned tungsten filament, drivers and diodes inside LED bulbs are highly susceptible to glitches and compatibility errors, especially with dimmers. Even when working, LEDs can appear to have lost light or shifted colour. The museum wants to install a standard white light but the impetus is on people to decide when an LED has started to look uncanny. The challenge of light is ongoing and unresolved - whether it should approximate the sun or flame is the subject of long-standing debate; medical opinion is divided as to what is best for our wellbeing.Although LED light bulbs are a popular form of energy-efficient lighting, the way they operate can cause problems for sensitive people as they adjust their light output by turning on and off dozens of times a second, resulting in a flicker that can cause headaches and dizziness. Additionally, the light produced by LEDs can appear dull and lacking in vividness, especially in the reds, which are typically boosted in incandescent bulbs. To address these issues, the Illuminating Engineering Society has developed a new classification system called TM-30, which scores bulbs on their preference, vividness, and fidelity. However, manufacturers and retailers have not adopted this system, leaving consumers confused about the real qualities of LED bulbs. Tunable LED bulbs are also available, which can be adjusted to emit different colors of light, but they are more expensive and may not be intuitive to use.",
    "summary": "LED bulbs have challenges with quick failure, poor color rendering and spectral similarity indexes, poorly designed power supplies, overheating, and a higher cost for indoor lighting. Constant-current power supplies are necessary for LED lighting, and fixtures need to be designed differently than incandescent bulbs to dissipate heat. There are concerns about the reliability and durability of LED bulbs, although high-quality options are available at a higher price point. Challenges exist in integrating LED bulbs with dimmer switches and ensuring compatibility. The flickering and lack of vividness in LED lighting has led to the development of new classification systems and tunable LED bulbs. Overall, LED technology has potential but requires continued development and innovation.",
    "original_title": "There's something off about LED bulbs",
    "hn_title": "There's something off about LED bulbs"
  },
  {
    "id": 35370728,
    "timestamp": 1680173572,
    "title": "Over Half of New NPM Packages are Spam",
    "url": "https://blog.sandworm.dev/one-in-two-new-npm-packages-is-seo-spam-right-now",
    "hn_url": "http://news.ycombinator.com/item?id=35370728",
    "content": "According to a post on Hacker News, 50% of new packages added to the Node Package Manager (NPM) are spam. The rise of spam NPM packages is said to be the result of practices by coding boot camps, where students are encouraged to publish a package to RubyGems⁠—it doesn't matter if the package does anything. This kind of practice is thought to apply to NPM as well by flooding the repository with spam packages that are a waste of digital space and take up naming conventions that could be applied to \"actually useful code.\" Respondents called for testing and experimentation repositories to be made available so that spam packages could be filtered out of the main repository, and for NPM to consider migrating deleted packages to a \"Trashcan\" area where they could be returned to the main repository if necessary.A significant number of NPM packages are believed to be spam generated by bootcamp assignments, which trashes the repository and takes up names that could be used for code that's actually useful, according to a user on HackerNews. They cite an example of one user that created one package for every ANSI escape code, including one another, and submitted them into popular projects. This gaming perpetuates \"GitHub gaming,\" and employers can tell the difference between fake and meaningful submitted work. There are suggestions to disable indexing for major search engines, only allow 'downloaded' packages to show up in search, and stopping new packages from being indexed until they reach a minimum amount of downloads, as well as critiquing results.\nUsing Google instead of a site's search feature, and refusing to accept that some sites need to be accessed directly, can exacerbate the problem of spam on the internet. Developers, for example, often search for packages on Google, resulting in spam packages being indexed. Some suggest disabling indexing new packages until they have garnered enough downloads to verify their legitimacy, and others propose user reviews that rely on a web of trust to establish the legitimacy of packages. While alternative solutions exist, some argue that these are low-cost approaches, requiring developers to think more actively about what they are searching for and what search tool is best to use for the task at hand.The issue of spam has resurfaced in the tech world, this time affecting the Node package manager (NPM). The problem requires a solution that will work not only for NPM but other managers too, and due to the quantity and speed of package creation, it must be automated. One proposed solution is to employ a web-of-trust model. However, some have noted the limitations of blockchain in this context, stating that it makes trusting individuals harder and that an immutable ledger is a terrible system for trusting people. Another option is AI to spot malicious packages. While there are many different methods being considered to tackle this problem, it remains unclear which will prove most effective in preventing a recurrence of the issue.The article discusses the different definitions of public space online, which are essentially non-existent because every server is owned by a private entity that can moderate, manage, and restrict usage as they see fit. The comments section features discussions about the morality of advertising and spam, with some commenters criticizing adtech for diluting the user experience with adverts that serve no purpose to end-users or society. Some commenters suggest that people resort to spamming because they are struggling to make ends meet, while others argue that wealth doesn't absolve one of unethical behaviors. The discussion on the nature of public space online and the ethics of online advertising highlights the tension between free speech and private property rights in the digital realm.A discussion on HN centered around the morality of spamming open source repositories on GitHub in order to gain SEO advantage. One user argued that ethics and feelings don't make money or keep food on the table, but another countered that many people have a sense of morality that is different than what is legally allowed. The conversation also touched on the topic of dependency trees and the potential pitfalls of relying too heavily on them, with some arguing that over-reliance on dependencies is a bad habit that can lead to trouble. However, others noted that many developers feel the need to import a lot of libraries as creating these packages from scratch can be impractical. Overall, the discussion highlighted the complex nature of ethics in the world of software development.The problem of spam on NPM packages was discussed on Hacker News, where users proposed solutions such as creating an automated testing process for uploaded NPMs, moderated by a cross-Internet reputation system, and adding a small fee on submission to pay for moderation. While a few users argued that the submission fee would not be a barrier for genuine developers and could be paid using cryptocurrencies, others pointed out that it could create barriers for developers in certain countries or without access to online payment systems. Some users also questioned the effectiveness of the proposed solutions, arguing that spammers could quickly adapt and find ways to bypass the measures. Finally, some users mentioned that Microsoft, the owner of NPM, should invest more resources to address the spam problem.Over half of new submitted npm packages are SEO spam, according to Sandworm. Sandworm has identified approximately 185,000 spam packages from new submissions scanned over the past week, with many of these containing a single README file with links to malicious websites. The packages identified were currently live on npmjs.com with the majority coming from a Telegram channel that targets Russian speakers. Suggestions to combat the problem include the implementation of cross-internet reputation systems and small submission fees to help discourage amateurs from submitting spam. However, some users pointed out that some countries would find fees more prohibitive than others, and the concept could deter new developers.Security researchers at Sandworm have identified spam packages on Node Package Manager (npm), a platform for Node.js modules. The packages included links to malicious Telegram channels with over 7,000 members, and were advertised with phrases promising financial gain, such as \"earn millions without leaving your home!\" Other packages offered fake free Fortnite V-Bucks, leading users to elaborate pages where they were tricked into watching ads and performing surveys. The researchers stated that all 93,000 packages they analysed had identical Telegram URLs. Sandworm reported the packages to npm, marking the start of an ongoing investigation into spam across the entire registry. Sandworm offers Sandworm Audit, an open-source npm audit that checks for multiple issues, including vulnerabilities and license compliance.",
    "summary": "Over half of new submitted npm packages are spam, with many containing links to malicious websites or offering fake freebies like Fortnite V-Bucks. The rise of spam is thought to be linked to coding boot camps, where students are encouraged to publish packages even if they don't do anything. Respondents have suggested solutions like automated testing processes and a web-of-trust model. The issue highlights the complex nature of ethics in the software development industry and tensions between free speech and private property rights. Security researchers have identified the presence of spam packages across the entire npm registry and are investigating further.",
    "original_title": "50% of new NPM packages are spam",
    "hn_title": "50% of new NPM packages are spam"
  },
  {
    "id": 35369075,
    "timestamp": 1680159590,
    "title": "US Proposes Bills with Threats to Tech Freedom & Privacy",
    "url": "https://www.vice.com/en/article/4a3ddb/restrict-act-insanely-broad-ban-tiktok-vpns",
    "hn_url": "http://news.ycombinator.com/item?id=35369075",
    "content": "A new bill, labelled as \"insanely broad\" by Vice News, could give the US government unprecedented power to ban any foreign technology deemed a \"threat to national security\". While the bill is being promoted as targeting TikTok, Hacker News warns that it could end up going much further, and act as a foundation for even more draconian measures. Critics argue it could be used to grant the US similar censorship powers to those wielded in China, as it gives the Commerce Secretary the authority to prohibit any transaction or equipment deemed to be owned \"substantially\" by a foreign adversary. The bill, which specifies penalties for violating its provisions, is entitled the \"The safeguarding America's Innovation Act\". The conversation is centered around the recent bill proposed that seeks to promote healthful use of social media and to mitigate the spread of dangerous misinformation. The discussion is about the effectiveness and implications of regulations. While some argue that people need to be treated with more credit, be considered smarter, and have better BS radar than they are usually credited for, others seem to believe that social media has the potential to undermine people's rationality and expose them to dangerous misinformation. There is also the question of whether or not any regulations will do more harm than good, especially if such regulations limit freedom, and the argument that the truth always eventually comes out.The discussion centers around the potential ban of Chinese-owned social media apps in the US. Some believe that the government should use existing commerce laws to ban certain apps as necessary for national security, while others argue that this would violate constitutional rights of freedom of speech and access to information. Those in favor of a ban argue that it is necessary to prevent Chinese companies from stealing US technology and gathering information for espionage purposes. Those against a ban argue that it is a slippery slope towards censoring information and that consumers benefit from access to a globally competitive array of products. The issue is still under debate, with some lawmakers proposing laws that would provide more ways to criminalize foreign-owned apps with vague definitions.The comment section discusses the challenges of US companies operating in China due to localization requirements and Chinese censorship laws, with some arguing for reciprocity in trade and others pointing out the complex history of American companies in China. Some commenters suggest that banning Chinese companies from operating in the US until China changes its laws and trade practices is a fair approach, while others object to the idea of censorship and prefer a free speech approach. Several commenters also note the existence of Azure regions in China and the challenges of accessing US-based websites in China. Overall, the discussion centers around the difficulties and complexities of doing business in China from both sides.The proposed US law aimed at protecting national security by blocking apps from adversarial countries, such as TikTok, would have significant overreach, including the potential to ban VPN usage, which has sparked concerns. Critics of the law suggest this could lead to censorship and create a \"Great Wall\" in the US. Some worry that law could be abused and criminalisation of VPN usage would make it hard for journalists and activists to operate anonymously. Others fear that the US risks becoming like China, with internet-enabled citizens subject to prosecution, a suggested 20 years in prison, and a fine of $1m for accessing restricted websites.  The bill has moved to the full US Senate.\nThe U.S. government has proposed a new bill, the Restoring Economic Strength and Telecommunications Operations and Readiness Act (RESTRICT), which could lead to criminal charges for anyone who accesses or provides a service that the government deems poses a security risk. The bill targets foreign software and services, and raises the possibility of punishing American companies that enable them. Under the proposed bill, \"transactions\" are defined as any use or dealing with tech products, including data transmission or hosting services. If passed, the bill would give the Commerce Secretary authority to impose mitigation measures, which could include banning US citizens from accessing the tech in question, as well as penalizing individuals and companies with fines and imprisonment. Lawmakers are divided over the proposal, with some arguing that it is too broad and could prove difficult to enforce.A new bill proposed by Republican Senators seeks to ban federal employees from using social media apps owned by Chinese companies, including TikTok and WeChat, on government-issued devices. The bill is being considered due to concerns about the potential for these apps to be used for espionage and surveillance by the Chinese government. The bill would also require the Committee on Foreign Investment in the United States to conduct a review of any new transactions involving these social media companies. However, critics argue that the bill could lead to the criminalization of VPN usage, which could have negative implications for freedom of speech and privacy. Furthermore, some argue that the bill is more of a messaging bill designed to cultivate influence, with questionable support from the signatories.The debate over the ban on TikTok in the US has reignited, with some commentators suggesting that the legislation amounts to protectionism by the government looking to secure the position of US social media companies. Others argue that the growth of social media is harming mental health and contributing to the manipulation of public opinion. At the heart of the TikTok ban is concern over the app’s Chinese ownership and links to the Communist Party of China. The US is not alone in its worries over TikTok, with India having already banned the app’s use due to security concerns. Despite the lawsuits currently challenging the TikTok ban in the US, some fear that other countries will follow suit and levy their own bans on the app.The RESTRICT Act, a proposed law that could be used to ban TikTok, has been criticized by digital rights experts for its “insanely broad” language that could allow other apps or communication services with connections to foreign countries to be banned in the U.S. VPNs, for example, may be impacted, though the bill is aimed at apps or services that pose a threat to national security due to links with foreign countries listed as “foreign adversaries,” including China, Cuba, Iran, North Korea, Russia, and Venezuela. Critics of the bill have expressed concerns that it could violate the First Amendment, while others have suggested that a more effective solution would be the passing of comprehensive privacy legislation such as the American Data Privacy and Protection Act.",
    "summary": "The US government has proposed a bill that would give unprecedented power to ban any foreign technology it deems a \"threat to national security\", leaving some to argue that it could lead to China-like censorship powers and be much broader than initially thought. There is also debate about banning Chinese-owned social media apps with some arguing that it is a slippery slope towards censoring information, while others argue that it is necessary to prevent Chinese companies from stealing US technology and gathering information for espionage purposes. The RESTRICT Act is a proposed law that could be used to ban TikTok and VPNs, and critics argue that it could violate the First Amendment. Republican Senators have also proposed banning federal employees from using social media apps owned by Chinese companies due to concerns about espionage and surveillance. Some commentators suggest that the legislation amounts to protectionism by the government, while others argue that the growth of social media is harming mental health and contributing to the manipulation of public opinion.",
    "original_title": "The 'Insanely Broad' Restrict Act Could Ban Much More Than Just TikTok",
    "hn_title": "The 'Insanely Broad' Restrict Act Could Ban Much More Than Just TikTok"
  },
  {
    "id": 35370284,
    "timestamp": 1680170125,
    "title": "Open-Source 3D Rendering Engine for Education & Integration",
    "url": "https://github.com/KTStephano/StratusGFX",
    "hn_url": "http://news.ycombinator.com/item?id=35370284",
    "content": "A developer has made public an open-source real-time 3D rendering engine after working on it for years. StratusGFX is hosted on Github and while it is said to contain bugs and instability, its creator’s main aim for releasing it was to provide an educational resource or for people to potentially integrate its rendering code into other engines, helping to broaden its reach. StratusGFX's capabilities, which are presented in this feature reel, include real-time reflections, shadows, and full-support for PBR shading. It primarily supports OpenGL for the time being, and though it can run on limited hardware, its creator has confirmed that he can attain 60fps at 900p and 1080p on an Nvidia GTX 1060.The StratusGFX project is a 3D game engine created by an individual developer who was interested in exploring the low-level tech behind such engines. The engine's architecture is described in detail in the high-level architecture document, and it is open source and available on GitHub. The engine's graphics require OpenGL 4.6, but developer support is only offered for Windows and Linux. The developer is considering porting the renderer to Vulkan to enhance cross-platform compatibility. The engine includes virtual point lights to handle global illumination, but spatial screen space reflections are not yet included. The engine is designed to maximize realism, but there is a need to balance this with fallback compromise capabilities for less powerful hardware in desktop and mobile devices.The commenter suggests that in order to improve the future of the StratusGFX real-time 3D rendering engine, it should remove the dependence on OpenGL 4.6 and adopt Vulkan. This would allow for a similar experience across MacOS, Linux, and Windows. While the engine currently performs well on stronger hardware, the commenter acknowledges the need to improve performance on weaker hardware. This could be achieved through fallbacks that remove reliance on certain real-time features and allow for baked solutions. While the initial goal was to avoid all baked solutions and only target real-time everything, the commenter now feels it's necessary to cycle back and add in other options on top of what's there. The StratusGFX engine is currently in pre-release/beta-release and significant bugs and instability should be expected.",
    "summary": "A StratusGFX open-source 3D rendering engine has been released by a developer for people to integrate its rendering code into other engines or use as an educational resource. Its capabilities include real-time reflections, shadows, and full PBR shading support, but it currently only supports OpenGL. Its creator is considering porting the renderer to Vulkan to enhance cross-platform compatibility. The StratusGFX engine is designed to maximize realism, but with fallback compromise capabilities for less powerful hardware, and its architecture is available on Github for Windows and Linux. The engine is in pre-release/beta-release, and significant bugs and instability should be expected.",
    "original_title": "Show HN: StratusGFX, my open-source real-time 3D rendering engine",
    "hn_title": "Show HN: StratusGFX, my open-source real-time 3D rendering engine"
  },
  {
    "id": 35370915,
    "timestamp": 1680174962,
    "title": "Google denies using OpenAI's ChatGPT to train Bard",
    "url": "https://twitter.com/steventey/status/1641267979399704576",
    "hn_url": "http://news.ycombinator.com/item?id=35370915",
    "content": "Google denies allegations that they trained the language model, Bard, using training data from OpenAI's ChatGPT chats shared on ShareGPT. Some argue that training on the output from ChatGPT is not copyrightable by OpenAI since they train their models on copyrighted data, pictures, and code from across the internet. Nevertheless, some express concerns such as amplification of biases, propagation of errors, echolalia and over-optimization, lack of diverse data, and overfitting when training one language model on the output of another. Additionally, some see it as embarrassing that Google played second fiddle to OpenAI, while others point out that Google has been second, or later, to the market with many of its products. It remains to be seen whether this training approach will bear fruit for Google or not.The ethics of training one large language model (LLM) with the output of another commercially-controlled LLM has been questioned after Google was accused of using ShareGPT outputs to train Bard, its rival to OpenAI's GPT-3. OpenAI's terms of service forbids training competitor models via its ML outputs. However, Google is not bound by OpenAI's TOS as it used a third-party website to scrape conversations, and it's unclear if the outputs used were copyrighted. Some have argued that OpenAI is guilty of the same actions towards other LLM outputs. Others have noted that both OpenAI and Google regularly scrape the web for human-generated content, and the issue highlights ongoing questions over AI and the sharing of data.An engineer who worked on Google's Bard AI language model has claimed the project had been using data sourced from its OpenAI-trained competitor ShareGPT to develop its algorithms, which OpenAI has said it does not endorse.  The engineer, Jacob Devlin, said he warned Google colleagues against using OpenAI data but his advice went unheeded. Devlin has since joined OpenAI. The news comes as OpenAI's paid-for GPT-3 text-generation service remains in beta. One GitHub user commented: \"I love it how [OpenAI] don't want others to use their model output but they have no qualms about training their model on the copyrighted works of others? Isn't this a stunning level of hypocrisy?\" It is not believed that the use of the OpenAI data violated any laws.Google has been accused of using training data from OpenAI's GPT-3 language model to develop their new conversational model, Bard. A former Google employee who worked on the project raised concerns with the search giant's management in May 2020 after running tests on a pre-release version of Bard. Several weeks later, Google's team reportedly stopped using the GPT-3 code and deleted any copies of the data. While the use of third-party tools in AI research is common, OpenAI has strict terms of use that prohibit third-party training of models on the GPT series. Google said it takes concerns about potential violations of intellectual property seriously and investigates them thoroughly.AI-generated responses to users are becoming increasingly common, and can range from brief reminders to lengthy explanations. This approach allows a small moderation team to manage a large group of users quickly and efficiently. Many users are also using AI tools to fix grammar issues and add content to their comments, which can unintentionally alter the original message. However, concerns have been raised around the legality and moral implications of using output from AI services to develop competing models, which is restricted by some terms of service agreements. It is also noted that as AI models become more ubiquitous, it may become more difficult to find high-quality training data.OpenAI believes in protecting everything they build, but nothing that anyone else builds, which is hypocritical. AI-generated material is not copyrightable, and training on other model output is permissible. According to the US Copyright Office, AI-generated works cannot be copyrighted, but AI output training can lead to derivative works. Trade secrets can protect AI models, but trade secret law differs from other forms of intellectual property. Using AI artwork to create new artwork might not entitle the new work protection. AI plagiarism is not desirable but may lead to the development of new ideas. Protecting AI-generated artwork may harm individual artists and benefit large corporations. AI-generated artwork may have a future in the art world, and it will be impossible to distinguish AI-generated material from traditional artwork with time.The discussion revolves around whether or not AI models, specifically large language models, are considered derivative works with copyright implications. Some argue that the AI is just finding patterns and therefore not infringing on copyright, while others argue that it is a heist where large tech companies benefit from every piece of content created by humans. The conversation also touches on the potential risks associated with AI, such as automation of jobs, loss of value for creators, and the spread of spam and misinformation. However, some argue that the potential benefits, such as a better search engine and increased productivity, outweigh the risks.Google may have relied heavily on data scraped from OpenAI’s ChatGPT, according to OpenAI’s former employee, Alec Radford. Chatbots using that data could have pushed particular public views of the world. Limits on copyright use to stop this “automated plagiarism,” however, would need to create new ownership rights, likely leading to endless lawsuits. Plagiarism still remains an issue for AI, as people train their models on licensed datasets, which could modify copied works. Some believe that stealing from ChatGPT could be morally justified, arguing that group-sourced data was essential to building the AI; however, training models on other AI-generated data could enforce bad data. Companies training their models might not follow OpenAI’s terms of service, potentially leading to legal trouble. Elon Musk has previously warned that AI could be exploited to the disadvantage of humanity. ",
    "summary": "Google denies using OpenAI's ChatGPT to train Bard, a new language model. Concerns have been raised about the ethics of training one large language model with the output of another commercially-controlled LLM. OpenAI's terms of service forbid training competitor models via its ML outputs, but Google is not bound by this. A former Google employee claimed that they used OpenAI data, but Google denies this. AI-generated material is not copyrightable, and training on other model output is permissible. Some argue that stealing from ChatGPT could be morally justified since it was group-sourced but training models on other AI-generated data could enforce bad data.",
    "original_title": "Google denies training Bard on ChatGPT chats from ShareGPT",
    "hn_title": "Google denies training Bard on ChatGPT chats from ShareGPT"
  },
  {
    "id": 35370152,
    "timestamp": 1680168936,
    "title": "Twitter API Neglected, User Dissatisfaction Grows",
    "url": "https://snarfed.org/the-twitter-api-is-now-effectively-unmaintained",
    "hn_url": "http://news.ycombinator.com/item?id=35370152",
    "content": "The Twitter API is reportedly being left unmaintained, leading to instability issues for users. One user suggests that none of their Twitter-using friends have stopped using the site despite recent problems, leading to speculation that Elon Musk may be satisfied with letting Twitter's uptime fall from 99.99999% to 99% to save money. However, other users have reported feeling alienated from the service due to its decrease in scientific paper content and increased proportion of inflammatory or offensive content. Some have suggested that the inherently friend-based model of the service and the insufficient filtering options make it difficult to curate content effectively. While Twitter does offer ways to follow topics and join communities, these reportedly do not work as effectively as on other platforms like Reddit.Twitter was already struggling due to its focus on recommendations, which made it incompatible with Science Twitter's purpose. Elon Musk's takeover of Science Twitter simply accelerated its decline. Many social media platforms use algorithmic feeds, but defaults are important as they influence user behavior. Facebook is one of the few major social media companies that still uses chronological feeds by default. However, Twitter's algorithmic feed caused Science Twitter posters to eventually leave the platform. Several have migrated to Mastodon, which has become popular with engineers and computer scientists. Some engineers even listed their Mastodon handles instead of their Twitter usernames at a recent SRECon conference. Twitter's unreliability and buggy features, coupled with its sometimes-toxic environment, have accelerated its decline.Some users on Hacker News have expressed dissatisfaction with Twitter as a social media platform. Complaints include inadequate client support, unreliable business practices, poor user engagement, and unfiltered political content from its owner. Some users have migrated to alternative platforms like Mastodon, while others have opted to maintain Twitter accounts but remain unengaged. Several users have also criticized the notion of personal blogs and the need for an independent, decentralized identity system. While some opine that Twitter may diminish in cultural relevance over time, it is unlikely to be supplanted by a single platform, like Mastodon or Facebook. Instead, the social media landscape may be fragmented into a multitude of options.Twitter users are experiencing issues such as internal server errors and difficulty accessing the website, leading some to switch to alternative platforms such as Mastodon. While some users are leaving Twitter due to these issues and the platform’s increasing commercialization, others argue that it still offers access to influential figures and a global audience. Additionally, some believe that while Mastodon offers alternatives to Twitter, it is not gaining wide appeal and is losing active users. Despite these varying opinions, it is clear that the reliability and user experience of social media platforms remain important factors in user retention and growth.Twitter's recent instability issues have caused some users to reduce their usage, with a significant number of people even leaving the platform entirely. However, others have remained loyal to the platform despite occasional bugs, bots, and less-than-ideal features. Elon Musk's recent comments about Twitter's future have raised questions about the company's direction and how it plans to monetize its services, particularly in light of the recent API restrictions. Some users have argued that Twitter owes a large part of its success to third-party developers and the innovative features they've brought to the platform, which Twitter might not have implemented independently. Despite these concerns, some believe that Twitter's growth under Musk's leadership suggests that the platform will continue to thrive, with or without its devoted users.Twitter's decision to shut down access to its API for third-party clients has sparked criticism and concern about the future of innovation and choice for Twitter users. While some argue that Twitter is just trying to protect its revenue stream and focus on its own products, others point out that third-party clients have played a crucial role in expanding the Twitter ecosystem and providing unique features and experiences for users. Additionally, the decision raises questions about the value of API access and the role of platform companies in fostering innovation and collaboration with the wider tech community. Despite the backlash, it remains to be seen whether Twitter will reverse its decision or continue to limit access to its API going forward.Elon Musk's decision to restrict access to Twitter's API is causing controversy. Critics accuse him of intentionally driving Twitter into the ground so that when he improves it, he will be hailed as a genius. This so-called \"saviour complex\" has been compared to his claims about Tesla being hours from bankruptcy. Others suggest that restricting the API is a plan to target bots, which pose problems for Twitter, and which were largely operated using the API. The public will still be able to utilise Twitter via web scraping. Developers with access to the API have also recently received an email stating that new access types and features are on their way, but end-users are still restricted.Twitter's API is now effectively unmaintained, with only one employee posting regularly on the Twitter Developers forum and focusing solely on the Ads API. The team that managed Twitter's API for developers have been severely gutted, and a former head of Twitter's enterprise API business has stated that Twitter had a $400m paid API business, which was fired along with the team who managed it. The company is expected to touch its API only when it receives a misguided directive from leadership. Many developers may end up paying to keep their existing Twitter projects and users functional, but some have stopped all new development using the Twitter API. Twitter's recent moves appear to have gutted its revenue sources, leading some to questions its strategies.",
    "summary": "The Twitter API is reportedly being left unmaintained, leading to instability issues for users. Some users have reported feeling alienated from the service due to its decrease in scientific paper content and increased proportion of inflammatory or offensive content. Many social media platforms use algorithmic feeds, but defaults are important as they influence user behavior. Twitter users are experiencing issues such as internal server errors and difficulty accessing the website, leading some to switch to alternative platforms such as Mastodon. Twitter's recent instability issues have caused some users to reduce their usage. Despite these concerns, some believe that Twitter's growth under Musk's leadership suggests that the platform will continue to thrive, with or without its devoted users. Elon Musk's decision to restrict access to Twitter's API is causing controversy, with critics accusing him of intentionally driving Twitter into the ground. Twitter's API is now effectively unmaintained, with only one employee posting regularly on the Twitter Developers forum and focusing solely on the Ads API.",
    "original_title": "The Twitter API is now effectively unmaintained",
    "hn_title": "The Twitter API is now effectively unmaintained"
  },
  {
    "id": 35376488,
    "timestamp": 1680198276,
    "title": "San Jose Police Union Director Charged with Drug Smuggling",
    "url": "https://www.washingtonexaminer.com/news/crime/san-jose-police-union-director-smuggle-fentanyl-charge",
    "hn_url": "http://news.ycombinator.com/item?id=35376488",
    "content": "The executive director of the San Jose Police Officers Association has been charged with smuggling fentanyl into the US. The police union executive director, Sonia Rosa Segovia, allegedly ran a drug business, partly out of the office, and used the association’s address to send packages to customers in the US. Investigators are in possession of photographic evidence taken from her WhatsApp communications, which also showed that she discussed police business with her suppliers. At least one of her customers died of an overdose. Additionally, when she was first contacted by investigators, she supposedly attempted to frame her housekeeper. Segovia faces charges of importation of a controlled substance, conspiracy to distribute and possess with intent to distribute a controlled substance, distribution of and possession with intent to distribute a controlled substance, and conspiracy to commit international money laundering. \nHollywood is known for idealizing the police force in its media, despite knowing the reality of their behavior, according to a comment on Hacker News citing sources about the Los Angeles Sheriff's Department's history of violence and corruption. The comment notes that if Hollywood portrayed the police force accurately with names such as \"Grim Reapers\" or \"Compton Executioners,\" viewers wouldn't believe it. The discussion also touches on police violence and racial injustice in Chicago, with some commenting on the political affiliations of blue states and suggesting that the issue is related to population density rather than geographical location. The conversation also touches on the drug trade and the use of Americans as drug mules by cartels.A San Jose police union employee has been indicted on drug trafficking charges. Joanne Segovia, who ran the police department's technology and communications unit, and whom the Police Officers Association credited as a \"dedicated veteran of the San Jose Police Department,\" was arrested on 22 March. Segovia is accused of traveling at least twice with another person to meet suppliers in Miami and buy fentanyl, an opioid up to 50 times stronger than heroin. At least 15kg of fentanyl passed into Segovia's possession, according to federal prosecutors, who said \"multiple seizures of fentanyl have been linked to the defendant\". Sources suggest Segovia may have made up to $500,000 from the drug deals.\nAn executive director of the San Jose police union, Joanne Southerland, has been charged with attempting to smuggle methamphetamine into the country. Southerland has been accused of attempting to import a large quantity of the drug into the US via shipping services from Hong Kong. Her arrest came after an investigation that began in July 2019, during which law enforcement officials discovered at least five packages of drugs addressed to Southerland's home. She has been suspended with pay, but has not been convicted of the charges. The case raises doubts about the role of law enforcement in drug trafficking, with some suggesting that police should take responsibility for the violence and overdoses associated with the illegal drug trade by legalising the sale of some substances.Some commenters on a Hacker News thread discussed the impact of drug legalization, with one user sharing their disappointment with the negative effects of decriminalizing possession in their neighborhood park and on public transit in Oregon. However, others argue that legalization would stop cartels and that externalities could be addressed with support systems like rehab, naloxone, and mental health care. The commenters also discussed the horrors of untreated addiction, the need for a cultural shift, and proposed solutions such as legalizing but regulating drugs for responsible use, enforcing existing laws against second-hand smoke and public drug use, and improving law enforcement systems to deter drug dealing and smuggling. The conversation touched on the drawbacks of criminalization as well, and the possibility of incentivizing minimizing drug consumption and sale.The executive director of the San Jose Police Officers' Association, Joanne Segovia, has been charged with attempting to smuggle fentanyl into the United States. She is accused of using her personal and work computers to order thousands of opioids and other pills between October 2015 and January 2023, and agreed to distribute the drugs across the US. Segovia is charged with attempting to import valeryl fentanyl unlawfully, and she allegedly had at least 61 shipments mailed to her home from countries including Hong Kong, Hungary, India, and Singapore. US officials intercepted and opened five shipments from July 2019 onwards and found thousands of pills containing controlled substances, including the synthetic opioids tramadol and tapentadol. If convicted, Segovia faces a maximum sentence of 20 years, a minimum of three years supervised release, and a fine of up to $250,000.",
    "summary": "The executive director of the San Jose Police Officers Association, Sonia Rosa Segovia, has been charged with smuggling fentanyl into the US and running a drug business partly out of the office. Segovia allegedly used the association's address to send packages to customers and discussed police business with her suppliers. At least one of her customers died of an overdose, and she faces multiple drug-related charges. Other cases of police officers involved in drug trafficking have raised questions about the role of law enforcement in the illegal drug trade, with some suggesting legalization as a solution. The conversation around drug legalization also touches on externalities and the need for support systems. An executive director of the San Jose police union, Joanne Southerland, has also been charged with drug smuggling, as well as Joanne Segovia, a police union employee, who has been indicted on charges of importing methamphetamine into the US. These cases highlight the need for solutions to address drug trafficking and addiction, including cultural shifts and targeted law enforcement efforts.",
    "original_title": "San Jose police union executive director charged with smuggling fentanyl into US",
    "hn_title": "San Jose police union executive director charged with smuggling fentanyl into US"
  }
]
