[
  {
    "id": 36169954,
    "timestamp": 1685735396,
    "title": "Brute.Fail: Watch brute force attacks fail in real time",
    "url": "https://brute.fail/",
    "hn_url": "http://news.ycombinator.com/item?id=36169954",
    "content": "Brute.FailThese are real time attempts to break into my servers by attackers trying to guess usernames and passwords. No legitimate services are offered on the addresses receiving these attempts, so there is no chance of a real user accidently submitting their credentials. (Yes things other than SSH occasionally show up)Waiting for WebSocket | Brute.Fail is a Mike Damm jam.Source Protocol Username Password",
    "summary": "- Brute.Fail showcases real-time examples of attackers trying to break into servers by guessing usernames and passwords. \n- The website assures that there are no legitimate services being offered on the attempted addresses and therefore, no chance of real users accidentally submitting their credentials.\n- Brute.Fail is created by Mike Damm, and it is still waiting for WebSocket.",
    "hn_title": "Brute.Fail: Watch brute force attacks fail in real time",
    "original_title": "Brute.Fail: Watch brute force attacks fail in real time",
    "score": 474,
    "hn_content": "The post discusses various techniques for defending against brute-force attacks and other hacking attempts. Some contributors share their own experiences of defending against attacks on their servers, while others offer advice on how to minimize the risk of attack in the first place. Topics discussed include using fail2ban, disabling password authentication, running SSH on a non-standard port, and sending redirects to large files to overload attackers. There is also some discussion of using tarpits like endlessh to discourage attackers. The post is aimed at entry-level software engineers and others who are new to the field and would benefit from learning more about basic security measures.The article is a discussion among users on a tech forum about the risks of allowing password-based login on SSH servers. Some users suggest disabling password authentication altogether and using only SSH public keys, while others suggest adding additional security measures like fail2ban or using firewalls to block traffic from certain regions or IP addresses. Other users propose more elaborate solutions, such as using SSH agent forwarding, wireguard interfaces, or port-knocking. While the discussion is light-hearted and sometimes sarcastic, it underscores the importance of using robust security measures to protect against brute-force attacks on SSH servers.A website displays a live feed of attempted logins to common internet services to raise awareness of the prevalence of brute force attacks. The website only displays attempts from known malicious sources and logs no legitimate traffic. The attack targets are HTTP/HTTPS basic auth, FTP/FTPS, LDAP, SSH, and a few other protocols and anyone involved in security work or wanting to verify how common such unsophisticated attacks are might find the feed of interest. While the website has caused controversy, it is a valuable resource for those interested in security and keeping up to date with the latest threats. Other developers are utilizing similar solutions such as IPBan.- Fail2ban may not actually prevent brute force attacks, but it can conserve server resources by stopping responses to such attacks.\n- Using cryptographic keys instead of passwords and implementing Role-Based Access Control are better alternatives to prevent attacks.\n- Real-time honeypots and open-source tools such as IPython Notebook can be used to monitor and protect servers.\n- The website \"brute.fail\" streams live data showing attempts to log into three SSH-enabled servers. It does not reveal the server's IP address or count failed attempts.\n- The website can be easily vandalized, so users should exercise caution before attempting to interact with it.\n- One user suggests trying all 2^32 IPv4 addresses with a specific password to find the location of the server. \n- The website's purpose is to illustrate how brute force attacks work, rather than to report actual failed login attempts. \n- The website may potentially be used as a chat service and has gained attention from the Hacker News community.",
    "hn_summary": "- Using fail2ban can conserve server resources by stopping responses to brute force attacks but may not prevent them.\n- Cryptographic keys and Role-Based Access Control are better alternatives to prevent attacks than passwords.\n- Real-time honeypots and open-source tools can be used to monitor and protect servers.\n- The website \"brute.fail\" streams live data showing attempts to log into SSH-enabled servers and is a valuable resource for those interested in security.\n- Users should exercise caution before attempting to interact with the website as it can be easily vandalized.\n- The website's purpose is to illustrate how brute force attacks work, rather than to report actual failed login attempts."
  },
  {
    "id": 36162154,
    "timestamp": 1685690827,
    "title": "California spent $17B on homelessness – it's not working",
    "url": "https://www.wsj.com/articles/california-homeless-population-oakland-wood-street-encampment-78d42cc3",
    "hn_url": "http://news.ycombinator.com/item?id=36162154",
    "content": "By Christine Mai-DucFollowand Jim CarltonFollow| Photographs by Brian L. Frank for The Wall Street JournalJune 2, 2023 12:01 am ETSHARETEXT1791 RESPONSESListen to articleLengthExplore Audio CenterOAKLAND, Calif.—City firefighters arrived midmorning at a homeless camp on Wood Street to quell a fire spreading across a tinderbox landscape of discarded furniture, debris, abandoned cars and dwellings fashioned from tents, tarps and plywood. Already a subscriber? Sign In",
    "summary": "- California has spent $17 billion on homelessness, but the problem persists.\n- Despite the influx of funds, homelessness has increased in California over the years.\n- There is no clear solution, and officials are still working to address the crisis.",
    "hn_title": "California spent $17B on homelessness – it’s not working",
    "original_title": "California spent $17B on homelessness – it’s not working",
    "score": 425,
    "hn_content": "California spent $17 billion on homelessness, but it's not working. The \"housing first\" strategy has been proven to work in Finland, but it has been implemented poorly in San Francisco. Housing is expensive, and California has more homeless people than Finland ever did. The homeless-industrial complex of non-profits in SF is huge but using a lottery system is not a real solution. Resettlement somewhere cheaper is the sensible thing to do, but it requires relocation, which doesn't scale. Homelessness is not just a financial problem; it's multifaceted and also includes mental health and addiction issues. A housing-first program would work, but it's politically infeasible and some people believe homeless people should not be given free housing.The issue of homelessness in high-cost areas like San Francisco is politically fraught. There are voluntary programs to transport homeless people to cheaper areas, but forcibly relocating them is considered inhumane. Ensuring relocated individuals’ needs are met and providing clean, well-maintained housing is a challenge. Homelessness is often linked to drug addiction and mental health issues. There’s resistance to forcing people into psychiatric care or drug treatment, but it shouldn't be a requirement for receiving housing. Making homelessness illegal could be a solution, provided a good alternative is provided for every person affected. The problem isn't just one of rising rents - addiction and mental illness often play roles. Focusing only on helping violent law-breaking, drug-addicted homeless people and ignoring apparently less obvious forms of homelessness will not help.There is no meaningful content for a tech-savvy audience in this post.Discussed the causes of homelessness in the US, including lack of affordable housing, mental illness, addiction, and medical expenses. Debate around whether wage growth or lack of affordable housing is a bigger issue. Various ideas proposed for solutions, including housing first with support, job programs, mandatory treatment in prison, and changing zoning laws. Debate around rent control and its effectiveness in solving homelessness. Mention of a Finnish program offering permanent housing with a live-in social worker. Some disagreement about whether moving out of expensive cities is a viable solution for everyone. Point made that simply making more housing available, without considering the demographics and diversity of the housing, is not enough. Discussion around the challenges of prosecuting petty crimes as a solution to homelessness.Comments on a thread discussing homelessness and how to solve the problem. \n\n- Homelessness is not just a problem in SF or LA, but in many cities across the country.\n- Jailing homeless people is not a solution as it creates a revolving door.\n- Trying to solve a national problem on a state level is bound to fail.\n- The opioid epidemic is a significant contributor to the homeless crisis.\n- People in the rust belt have as many issues with drugs and crime, but they have homes.\n- When a city becomes too dense or expensive, homelessness starts becoming a problem.\n- Providing housing is the cheapest solution to homelessness.\n- People who are homeless due to disabilities should not be required to work in exchange for housing.\n- The idea of worrying about who gets what for free before solving the problem is hindering progress.\n- Homeowners already benefit from massive government subsidies and handouts, such as capital gains tax exemptions and mortgage interest deductions.A discussion thread on housing and homelessness on an unspecified platform includes various arguments and opinions. Some mention the benefits of \"housing first\" programs, such as the success it has had in Finland and how it can mitigate problems like substance abuse, violent crime, and healthcare costs. Others argue about the potential negative effects, such as the fear of public housing projects being detrimental to society. The discussion also touches on why people do not take advantage of purchasing affordable mobile homes and the issue of \"free housing\" being taken advantage of. Further discussions include the need for the federal government to get involved to solve the issue, the impact of mental illness and drug addiction on homelessness, and criticisms on the lack of affordable housing and housing assistance programs.The post discusses the relationship between accepting refugees/immigrants and providing public welfare/healthcare programs. The US accepted about 22,645 refugees in 2022, and Finland accepted about 1,282. Canada is mentioned as having a higher percentage of its population being immigrants and a more comprehensive welfare state than the US. The discussion turns to the issue of homelessness, with varying opinions on whether or not free housing should be provided to those struggling with housing insecurity, including drug addicts. The post argues that it is not sustainable to have a welfare state and a liberal immigration policy simultaneously, with some disagreeing on this claim. Finally, Canada's immigration policy and housing crisis are discussed, with differing opinions on the effectiveness and replicability of Canada's policies.A discussion on homelessness in San Francisco reveals differing views on the root causes of the issue, with some advocating for a direct approach targeting addiction while others insist that more affordable housing is the key solution. Critics of the housing-first approach argue that such a strategy misses the fact that homelessness is itself a symptom of larger problems of societal neglect and a lack of government accountability. Meanwhile, proponents of a more interventionist approach may argue that incentivizing homelessness only encourages an influx of transients to the area, exacerbating the problem. Ultimately, there appears to be no easy answer to the issue, and the debate surrounding it has deep political and philosophical implications.While homeless populations don't tend to move to different cities specifically for homelessness, people in unstable living situations may be lured by a job or housing offer in a new city, such as Vancouver. However, stability in such cities is difficult to maintain without significant earning power as they have a high cost of living. Those without highly valued job skills may be better off moving to smaller, less expensive towns in BC. There is a discrepancy in the data and anecdotal beliefs about where some homeless people come from, with some municipalities being unwilling to provide resources for relocation. Homelessness is less visible in colder climates, and while forced detox and compulsory treatment methods may not be effective, providing housing can help address the problem. However, mentally unstable people may struggle to maintain supportive housing.The post discusses the complex issue of addressing homelessness and mental illness. There are varying opinions on how to solve this problem, including incarceration in mental institutions or drug rehab facilities. However, past attempts at these solutions have often failed. Giving unconditional cash grants is also debated, as some argue that the money may be spent on drugs or exacerbate the problem. The root issue is the high cost of housing in California. However, the article is specifically focused on one encampment and does not provide a comprehensive overview of the broader issue or the allocation of the $17B budget for homelessness in California.The post contains comments and discussions on the issue of homelessness and addiction in the US. Some comments suggest that giving drug addicts money might not be the best solution to address the root cause of addiction. There are concerns that homeless people with addiction issues might use the money to fuel their habits. There are also discussions about the demographics of the homeless population and the need for supportive services to help them get back on track. Some comments suggest that more resources should be allocated to help people without substance abuse problems as they respond better to support programs. It is crucial to have separate programs for each group.- 1 in 9 homeless people in California are out-of-staters\n- Homeless people tend to gravitate towards areas where sleeping rough is easier\n- There is no good solution for people with mental health issues in homelessness\n- Giving money to people trapped in the cycle of addiction won't necessarily break that cycle, they need treatment and integration programs\n- The current system benefits people making money from it \n- Society does not necessarily want to hug homeless people or hire them",
    "hn_summary": "- California spent $17 billion on homelessness, but it's not working, with the \"housing first\" strategy not being implemented effectively in San Francisco, despite its success in Finland.\n- Homelessness is multifaceted, involving mental health and addiction issues, making the provision of clean, well-maintained housing a challenge.\n- Debate centers around whether to provide free housing, with concerns about fear of public housing and \"free housing\" being taken advantage of, and also whether to focus on affordable housing or addiction intervention as a solution."
  },
  {
    "id": 36162235,
    "timestamp": 1685691465,
    "title": "Third-party Reddit apps are being crushed by price increases",
    "url": "https://kotaku.com/reddit-third-party-3rd-apps-pricing-crush-ios-android-1850493992",
    "hn_url": "http://news.ycombinator.com/item?id=36162235",
    "content": "THE A.V. CLUBDEADSPINGIZMODOJALOPNIKJEZEBELKOTAKUQUARTZTHE ROOTTHE TAKEOUTTHE ONIONTHE INVENTORYGaming Reviews, News, Tips and More.HOMELATESTNEWSTIPS & GUIDESREVIEWSTHE BESTSCULTUREREPORTOPINIONANIMEWe may earn a commission from links on this pageNEWSReddit Is Killing The Best Way To Read The SiteThird-party apps like Apollo are being crushed by ridiculous price increasesByLuke PlunkettPublishedWednesday 8:30PMComments (146)AlertsImage: RedditReddit is one of the biggest and most important websites on the planet, especially since it’s one of the last places human beings can get questions answered by actual human beings. It’s also a colossally active hub for the discussion of video games, a place where millions of gamers gather every day in communities devoted to everything from retro classics to The Legend of Zelda: Tears of the Kingdom. So it sucks to see that the company is about to crush many of the best ways to actually experience the whole thing.For anyone using the site on a desktop computer the Reddit experience is fine, I guess (“Old Reddit” is better), but on phones, that all changes. Reddit’s official app sucks, and is absolutely loaded with intrusive ads, meaning a lot of people rely on the work of third-party apps—like the incredibly popular Apollo on iOS and my own favourite, Infinity on Android—to browse and comment.Or they did. Those third-party apps only existed because Reddit allowed them to access their API (essentially their backend); today, the site announced specific changes to that arrangement (first broadly announced last month), implementing charges for the data—similar to those introduced by another platform with popular third-party apps, Twitter—that are so astronomical they’re going to price every third-party app out of the market.The creator of Apollo has done the math, and says:I’ll cut to the chase: 50 million requests costs $12,000, a figure far more than I ever could have imagined.Apollo made 7 billion requests last month, which would put it at about 1.7 million dollars per month, or 20 million US dollars per year. Even if I only kept subscription users, the average Apollo user uses 344 requests per day, which would cost $2.50 per month, which is over double what the subscription currently costs, so I’d be in the red every month.Meanwhile one of the developers of RIF, another popular Android app, says that they are not only also being priced out (if Apollo can’t afford it nobody can), but that Reddit is also implementing a change where third-party apps would lose access to NSFW subreddits, while the official site would not:Removal of sexually explicit material from third-party apps while keeping said content in the official app. Some people have speculated that NSFW is going to leave Reddit entirely, but then why would Reddit Inc have recently expanded NSFW upload support on their desktop site?It’s obvious that the steep pricing, which goes far beyond what these developers were expecting or could ever afford, is not there to make money. Not when it was clear nobody was ever going to be able to pay it. It’s being brought in to crush third-party alternatives, driving every mobile user to the official app where they’ll either have to watch ads or pay for Reddit Premium.Or, you know, stop going to Reddit.Show all 146 comments",
    "summary": "- Third-party apps like Apollo and Infinity are being priced out of the market due to new charges implemented by Reddit for accessing its API.\n- The charges are so high that popular third-party apps like Apollo would have to pay millions of dollars a year.\n- There are also concerns that third-party apps will no longer have access to NSFW subreddits, while the official app would still retain access.",
    "hn_title": "Third-party Reddit apps are being crushed by price increases",
    "original_title": "Third-party Reddit apps are being crushed by price increases",
    "score": 381,
    "hn_content": "Third-party Reddit apps are being impacted by price increases for API access, causing concern over the symbiotic relationship between Reddit and its users. Users provide the content, and mods maintain it, while Reddit provides the infrastructure. Reddit's move has been interpreted by some as a bid to control the narrative and increase ad revenue. Some users suggest they may limit their use of the Reddit platform due to increasing toxicity. Reddits charm has been its ease of use, and varied, niche communities. Nevertheless, the erosion of the platform's user experience and governance have led some to speculate on the need for a new social media platform.There is a discussion on Reddit's current state, its problems, and possible solutions proposed by users. Users note that Reddit's corporate interests often conflict with users' interests, and companies always want more profits. Additionally, the age of casual browsing and users' low investment in the site might make it hard for small communities to thrive, and incentives for engagement reward quantity over quality. Some suggest that Reddit needs a massive overhaul, possibly involving better UX, mobile apps, and PR, while others suggest that moderation is the key to Reddit's success. However, most agree that potential competitors to Reddit face similar issues, such as moderation and bot spam. Some point out Discord as a community platform that could potentially replace Reddit.Users discuss the difficulty of creating a Reddit competitor due to high infrastructure costs and the challenge of gaining user traction. Some suggest targeting a specific, tight-knit community or using alternative features such as real-time chat instead of comments. Others suggest that companies need ad money to monetize their platforms, which is difficult to balance with user experience. Some users express frustration with the official Reddit app and recommend alternatives like Apollo or RiF. Some suggest that Reddit's small, topically-focused communities may have a difficult time finding new homes in the event of Reddit's downfall, and others express skepticism towards the relevance of Usenet.Reddit is making changes that limit customization and force users to the official app, either watching ads or paying for Reddit Premium. Additionally, third-party apps will lose access to NSFW subreddits while the official site will not. This move is driven by pressure from investors to make money. Companies are sacrificing long-term reputation for short-term gains. However, the company's management of social media platforms has become socially destructive and is negatively impacting brand equity. Many users find the original Reddit experience better. Some of these are flocking to open source Reddit alternatives, but none achieved the same level of popularity as Mastodon. Scrappers continue to be used as a possible solution for the limitations imposed by Reddit.Reddit's plan to charge third-party developers for API access has sparked debates among users. Some suggest that Reddit should offer subscriptions instead of ads, while others suggest that API clients would be able to identify ads in the feed and not show them. One commentator warns that if Reddit goes the way of Digg v4, developers should start looking for other platforms to move their userbase to. A Reddit user backlash also criticizes the website for what it has done to its moderators amid suspicions that they work for free. Finally, there’s speculation that Reddit is targeting the video-upload craze that relied on third-party API clients to connect Reddit's upvoted videos with a variety of social media app networks.Reddit is removing support for third-party apps that use their APIs, which could lead to the shutdown of popular third-party Reddit clients. Reddit users are discussing the potential impact on their browsing experience and the lack of alternatives to the site. Some users criticize Reddit's UI, and others highlight moderation issues and hate speech. The conversation also touches on the challenges of maintaining free social media services and the \"cost\" of using such platforms, such as being served ads or trading personal data. Some users suggest alternatives to Reddit, including Mastodon and Offline Reader.People are discussing the new design of Reddit and how it compares to the old one. Some users criticize the lack of link colors and reduction in information density. Others argue that the redesign was successful in attracting a wider audience. There are comments on the design process, such as how the person in charge of the redesign was not a Reddit user before working on it. There's also speculation on the \"enshittification\" process of other platforms, such as Discord, and the potential forking of open-source chat programs. Overall, the discussion revolves around Reddit's purpose, target demographic, and monetization strategy.Users discuss the difference in standards and UI preferences between those who grew up with mobile interfaces like TikTok and Instagram versus those who prefer text-based, minimal UIs for insightful conversations. Reddit's UI is criticized for favoring visual content and enabling deceptive advertising. Some users suggest alternatives like Apollo and Relay for Reddit. Discussion also touches on the monetization of social media platforms, the impact of AI models on content creation, and the potential consequences of sacrificing usability for profit.Reddit's UI and user experience is criticized as terrible. Some suggest that smaller players will die off while established players will continue to play. Apollo is regarded as the best client. HN, despite its flaws, has a far superior user experience compared to Reddit. HN lacks pagination, notification on a reply, and a way to keep up with new comments on a post. HN's UX could be improved on mobile devices. Deep threads become unreadable due to shifting right with no end as replies come in. Code blocks are unreadable on mobile since they cannot be scrolled.",
    "hn_summary": "- Reddit’s third-party apps are experiencing price increases for API access, causing concern over the relationship between Reddit and its users.\n- There is a discussion on Reddit’s current state, its problems, and possible solutions proposed by users.\n- Reddit is making changes that limit customization and force users to the official app while third-party apps lose access to NSFW subreddits."
  },
  {
    "id": 36162164,
    "timestamp": 1685690929,
    "title": "Radiation-hardened Quine (2014)",
    "url": "https://github.com/mame/radiation-hardened-quine",
    "hn_url": "http://news.ycombinator.com/item?id=36162164",
    "content": "Radiation-hardened QuineThis is a robust self-printing program written in Ruby. It works even if you delete one character anywhere from the code.How to playNormal usageJust run rquine.rb and check if the output is equal to the original code:$ ruby rquine.rb > rquine2.rb$ diff rquine.rb rquine2.rbAbnormal usagePrepare a script that deletes one character randomly:$ cat mutate.rbsrc = ARGF.readsrc[rand(src.size), 1] = \"\"print srcGenerate a broken program by deleting one character from rquine.rb:$ ruby mutate.rb rquine.rb > broken.rbRun the broken program:$ ruby broken.rb > rquine2.rbYou will see the output exactly equal to the original code:$ diff rquine.rb rquine2.rbHistoryold-rquine.rb is the first version based on a trivial redundancy approach (having two copies of the main code).flagitious.rb is the smarter version that repairs itself instead of redundancy. It was created by Darren Smith aka. flagitious. Thank you flagitious! (Note that this version only works with 1.8.7.)rquine.rb is the latest \"ascii-art\" version based on flagitious's approach. It works with 1.9 or later.See alsoPerl version (attributed to Shinichiro Hamaji)LicenseCopyright (c) 2014 Yusuke Endoh (@mametter), @hirekokeMIT LicensePermission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.",
    "summary": "- Radiation-hardened Quine is a self-printing program written in Ruby that works even if you delete a character from the code.\n- The program can be run normally or with a script that randomly deletes a character to generate a broken program that still outputs the original code.\n- There are different versions of Quine, and the latest version is rquine.rb, which is based on flagitious's approach and works with 1.9 or later.",
    "hn_title": "Radiation-hardened Quine (2014)",
    "original_title": "Radiation-hardened Quine (2014)",
    "score": 349,
    "hn_content": "A hacker on Hacker News shared an impressive radiation-hardened quine. The quine prints its own source code while also tolerating one character deletion – meaning the final program is still executable despite the damage. Additionally, people discuss the process that goes into radiation hardening, from hardware to software, and suggest the use of triple redundancy and the pooling of computational power to address potential hitches along the way. People also mention some of the International Obfuscated C Code Contest's notable problem sets.The post discusses a quine, which is a computer program that generates its own source code. The discussed quine is radiation-hardened, which means it can still generate its source code even if some of its characters are deleted due to radiation. There is a debate in the comments section about whether DNA can be considered a radiation-hardened quine. The post is notable for the impressive feats of programming it discusses. Readers interested in programming, particularly those new to the field, may find the post and comments section fascinating.",
    "hn_summary": "- A radiation-hardened quine that can tolerate deletion of one character without affecting its executability is shared by a hacker on Hacker News.\n- People discuss the process of radiation hardening and suggest the use of triple redundancy and pooling of computational power to address potential issues during the process.\n- There is a debate in the comments about whether DNA can be considered a radiation-hardened quine; the post is notable for its impressive programming feats and may intrigue readers new to programming."
  },
  {
    "id": 36159864,
    "timestamp": 1685670357,
    "title": "How to make fancy road trip maps with R & OpenStreetMap",
    "url": "https://www.andrewheiss.com/blog/2023/06/01/geocoding-routing-openstreetmap-r/",
    "hn_url": "http://news.ycombinator.com/item?id=36159864",
    "content": "Andrew Heiss, who runs a blog and is a data visualization expert, details how to use OpenStreetMap, R, `sf` and `ggplot2` to create route maps for road trips by geocoding and plotting stops for the trip and routing through Open Source Routing Machine (OSRM) API, as an alternative to Google Maps API. He provides a code with packages and functions in R that he uses to automate the process, make maps, and modify them for the journal, adding day-wise itinerary and summary statistics.",
    "summary": "- Andrew Heiss explains how he used OpenStreetMap, R, `sf`, and `ggplot2` to create road trip maps.\n- He uses geocoding and routing through Open Source Routing Machine (OSRM) API as an alternative to Google Maps.\n- He provides R code to automate the process and make maps, including adding itinerary and summary statistics.",
    "hn_title": "How to make fancy road trip maps with R and OpenStreetMap",
    "original_title": "How to make fancy road trip maps with R and OpenStreetMap",
    "score": 336,
    "hn_content": "A blog post on creating road trip maps with R and OpenStreetMap has garnered attention on DIY parenting, with commenters praising the parenting choices of the author. One commenter also shared their map tracing a minimum Republican county road trip from San Francisco to New York City. Political discussion ensued, with some arguing that \"everything is political\" and others believing that certain topics are too political to bring up in certain places. Some commenters also engaged in name-calling and personal attacks. However, a few commenters managed to stay on topic and discuss interesting historical and geological information about the regions in question.The post contains a mix of comments, ranging from a discussion on the underground railroad, to recommendations for trip planning tools, to a debate on the use of R versus Python for making maps. Some commenters share their own experiences with trip planning, while others suggest tools or libraries for creating maps. There is no clear central argument or new release in this post.- Before GPS phones, routes had to be labeled with turns and other road changes\n- Roads were often drawn in a chicken scratch-like manner\n- A specific mapping service called Linedrive was mentioned in the discussion\n- A comment mentions a tool being plug and play if R is already installed\n- YC Summer 2023 applications are currently open, which is unrelated to the discussion on mapping routes.",
    "hn_summary": "- Commenters discuss historical and geological information about regions along the road trip route\n- Debate on the use of R versus Python for making maps\n- Some commenters share their own experiences with trip planning and suggest tools or libraries for creating maps"
  },
  {
    "id": 36162265,
    "timestamp": 1685691660,
    "title": "27 years later & the Psion 3a is still wonderful (2020)",
    "url": "https://mcgst.com/2020/12/01/27-years-later-and-the-psion-3a-is-still-wonderful/",
    "hn_url": "http://news.ycombinator.com/item?id=36162265",
    "content": "27 years later and the Psion 3a is still wonderfulBY SHAUN on DECEMBER 1, 2020 • ( 6 )My daughter found my Psion 3a the other day, tucked at the back of a cupboard she was clearing out for me. It looked fine and is still in excellent aesthetic condition, and fortunately I had left no batteries inside it so they didn’t have time to go off and destroy the device. There was also a backup battery installed which had fortunately not leaked any nasty stuff.I inserted 2 AA batteries and to life it jumped in an instant. Those 2 batteries will give me 30 days of use by the way which is unheard of today and I will obviously need to source a backup battery to that any data inputted is not lost when the batteries need to be swapped out.The reassuring snap as it is opens is just the start of the process. A bit like unboxing an Apple product except you get to experience it every single time and that hinge mechanism is a mechanical masterpiece in 2020 yet alone back in 1993.The keyboard is surprisingly easy to use and so is the form factor. This was markedly improved with the brilliant Psion 5 keyboard, but at the time the Psion 3a keyboard sufficed perfectly well. Perhaps more remarkable is the sheer speed and consistently smooth performance offered on a 480 x 160 pixel screen, a 7.68 MHz processor and 1 or 2MB of RAM. These numbers are crazily low, but you also got a voice recording microphone and an I/O port for a modem and PC sync.At no point in my years of Psion usage did any device ever crash on me. It worked, it always worked and it never stopped working. Everything was instant and there were so many clever design touches that were way ahead of their time. I would argue that the Psion was the most Apple-like PDA of all and it was way ahead of the Newton. I owned a Newton for a month and it was a huge monstrosity of a device.From the clever hinge mechanism to the shortcut keys above the keyboard to the card slots either side. It was a superb set of hardware features housed in a hard to damage case powered by software that never strained the hardware. It just worked!I read my first eBook on a Psion 3mx, I played my first mobile games on a Psion 3 and I wrote my first web articles on a Psion 5. To this day the Psion range remain above all others in my mind as to what a PDA should have been.Psion died and I moved to Palm. At no point did I ever believe that Palm was a proper mobile system and it never came close to any Psion for me. It felt immature and just didn’t work the way my mind wanted it to work although I admit that it was efficient and had that natural sense about it. The occasional Windows PDA was bought, shouted at and then sold and I continued with Palm until the BlackBerry and then finally the iPhone.It is, Psion, however, that will always be the best PDA hardware and software combination of all to me. And it is remarkable that the Psion 3a when used today still feels modern in many ways. It was way ahead of its time in 1993 and it is definitely not 27 years behind the times in 2020.‹ Somryst: losing sleep? You will now.The Montblanc 1858 ›Categories: Articles, Retro, Thoughts",
    "summary": "- Psion 3a, a PDA released in 1993, is still functional after 27 years and has many innovative features.\n- The keyboard, hinge mechanism, and card slots of Psion 3a are remarkable and ahead of their time.\n- Psion 3a hardware and software combination is the best PDA for the writer, surpassing Palm and Windows PDAs.",
    "hn_title": "27 years later and the Psion 3a is still wonderful (2020)",
    "original_title": "27 years later and the Psion 3a is still wonderful (2020)",
    "score": 298,
    "hn_content": "Users on Hacker News are discussing the old Psion 3a and reminiscing about the times when computers were less powerful, with some expressing a desire to do more with less. Comments mention the nostalgia for old hardware, discussion on how modern hardware may not be used to its full potential, and the potential for running efficient software on constrained environments. Users also share their experiences with Raspberry Pis, low-end SBCs, and other hardware for experimental and educational purposes. Some users recommend various alternatives to the Psion 3a and offer their opinions on different models and vendors.A group of individuals reminisce the glory days of the Psion 3 PDA, sharing fond memories of programming with the OPL language on the device, as well as appreciating the hardware's robust build, efficient power usage, and user-friendly interface. The conversation touches on the advantages and disadvantages of contemporary technology, such as the overconsumption of power and the optimization of code for modern hardware. While some express nostalgia for such compact and capable electronics, many note that there are modern alternatives. However, they acknowledge that current options may lack the same level of simplicity and elegance of the Psion 3. Overall, the conversation serves as a tribute to the legacy of the Psion 3 and its enduring impact on personal computing across generations.No meaningful content for a tech news summary in this text.Tech enthusiasts are discussing the appeal of devices with physical keyboards. Some argue that they were popular in the past and would still be attractive to business users who need to type quickly or want a more tactile typing experience. However, others point out the potential drawbacks, such as added cost, increased thickness, and compatibility issues with current software. Additionally, many consumers prefer the convenience and versatility of smartphones and tablets for everyday use. While some niche devices with physical keyboards exist, mass-market devices have largely moved away from this form factor in favor of other features and designs.Tech enthusiasts discuss handheld devices for digital literacy, with some praising the uConsole from ClockworkPI for its physical keyboard, and others suggesting Android e-ink tablets like the Boox Note. The conversation also reminisces about classic PDAs like the Psion, with users sharing their experiences using them for programming and office work. Some commenters discuss buying and collecting vintage PDAs, with some expressing surprise about the high prices they can fetch on eBay. Others mull over the possibility of a new handheld device with a Psion-like keyboard, suitable for tasks like word processing and email, with long battery life and modern connectivity options.- Tech enthusiasts discuss their experiences with the Psion, an early digital tool.\n- Some praise its robustness and architecture while others express nostalgia for its form factor and integrated operating system.\n- One user has developed an agenda app inspired by the Psion's calendar app.\n- There is also discussion of alternative devices with similar features being in development or on the market.\n- Some commenters express a desire for a personal encyclopedia-like device with built-in search capabilities.\n- Overall, the post offers a window into the history and evolution of digital tools in the tech industry.",
    "hn_summary": "- Tech enthusiasts discuss the Psion 3a and express nostalgia for its form factor and user-friendly interface.\n- Some praise the device's architecture and efficient power usage.\n- There is also discussion of alternative devices with similar features being in development or on the market."
  },
  {
    "id": 36164340,
    "timestamp": 1685709939,
    "title": "Scan iPhone backups for traces of compromise by \"Operation Triangulation\"",
    "url": "https://github.com/KasperskyLab/triangle_check",
    "hn_url": "http://news.ycombinator.com/item?id=36164340",
    "content": "Triangle Check: scan iTunes backups for traces of compromise by Operation TriangulationThis script allows to scan iTunes backups for indicator of compromise by Operation Triangulation.For more information, please read SecurelistContact: triangulation@kaspersky.comPrerequisitesThe script depends on: colorama (for pretty printing), pycryptodomeInstallationThe triangle_check utility can be installed from PyPI (recommended):python -m pip install triangle_checkThe script can be run as-is (the subdirectory triangle_check is required):python -m pip install -r requirements.txtpython triangle_check.py It can also be built into a pip package:git clone https://github.com/KasperskyLab/triangle_checkcd triangle_checkpython -m buildpython -m pip install dist/triangle_check-1.0-py3-none-any.whlFor Windows or Linux, alternatively use the binary builds of the triangle_check utility.UsageUsage: python -m triangle_check /path/to/iTunes_backup [backup_password]iTunes backup locationLocate the backup directory created by iTunes. The exact location depends on the OS and is described here. The directory you are looking for should contain many subdirectories, and should include 'Manifest.db', 'Manifest.plist'. The backup may be encrypted with a password, if set up in iTunes. That password is required to decrypt password-protected backups.Advanced: create backup with libimobiledeviceYou can use the tool idevicebackup2 that is a part of the open-source package named libimobiledevice. Popular Linux distributions, macports and homebrew allow to install it out of the box, and the package can be built from the source code for Linux or OSX.Scanning the backupRun the tool against the backup directory. If there are any traces of suspicious activity, the script will print out SUSPICION or DETECTED lines with more information and detected IOCs, and that would mean that the device was most likely compromised.Example output:==== IDENTIFIED TRACES OF COMPROMISE (Operation Triangulation) ====2022-*-* SUSPICION Suspicious combination of events: * file modification: Library/SMS/Attachments/ab/11 * file attribute change: Library/SMS/Attachments/ab/11 * location service stopped: com.apple.locationd.bundle-/System/Library/LocationBundles/WRMLinkSelection.bundle * file modification: Library/Preferences/com.apple.ImageIO.plist * file attribute change: Library/Preferences/com.apple.ImageIO.plist * file birth: Library/Preferences/com.apple.ImageIO.plist * file modification: Library/Preferences/com.apple.locationd.StatusBarIconManager.plist * file attribute change: Library/Preferences/com.apple.locationd.StatusBarIconManager.plist * file birth: Library/Preferences/com.apple.locationd.StatusBarIconManager.plist2022-*-* DETECTED Exact match by NetUsage : BackupAgent2022-*-* DETECTED Exact match by NetTimestamp : BackupAgentWhat's next?The research on the Operation Triangulation is ongoing. For more updates, please check Securelist",
    "summary": "- A new script called Triangle Check can scan iTunes backups for indicators of compromise by \"Operation Triangulation\".\n- The script requires installation of a dependency called colorama and can be installed from PyPI or built into a pip package.\n- If there are any traces of suspicious activity found by the script, it will print out more information and detected IOCs, which could mean the device was compromised.",
    "hn_title": "Scan iPhone backups for traces of compromise by “Operation Triangulation”",
    "original_title": "Scan iPhone backups for traces of compromise by “Operation Triangulation”",
    "score": 279,
    "hn_content": "Kaspersky Lab has released a new tool, known as \"Operation Triangulation,\" that can scan iPhone backups for traces of compromise. The tool is designed to improve cybersecurity measures and identify any data breaches or penetrations of iPhone backups. The tool aims to address concerns over the security of Apple's iOS mobile operating system, and whether it can be hacked by cybercriminals or foreign intelligence agencies. The tool can help ensure that iPhone users' data is protected from intrusions and unauthorized access. The tool is the latest development in Kaspersky's ongoing work on cybersecurity and data protection.The discussion covers various topics related to software vulnerabilities, encryption, surveillance, and cybersecurity. Some points mentioned include: \n\n- Conducting end-to-end encrypted calls with perfect forward secrecy may not be reliable due to the possibility of device compromise. \n- Open-source alternatives exist for VoIP apps, which can provide E2EE. \n- Both basic phones and smartphones can potentially spy on users. \n- A Mobile Verification Toolkit was released by the Amnesty International Security Lab to help identify potential compromises of Android and iOS devices. \n- The reliability of Kaspersky software is questioned due to allegations of ties to the Russian state. \n- Zero-day exploits are likely plentiful and used by intelligence agencies, criminal organizations, and other groups.Unknown mobile APT campaign targeting iOS devices discovered through monitoring network traffic on corporate Wi-Fi using Kaspersky Unified Monitoring and Analysis Platform (KUMA). The iOS jailbreak community is waiting for a root-privilege exploit to be released. A tool to detect Pegasus and Graphite now available in iMazing. Concerns raised about high-level hacking by state actors, and the viability of end-to-end encryption (E2EE). Encrypted local backups advised, but may not be useful once the device is infected. No information provided about the specific quantity of 'too many' vulnerabilities. iCloud backups are not end-to-end encrypted by default. iCloud backup download possible for scanning purposes. Kaspersky criticized for its alleged connections with the Russian government. Use of Lockdown Mode recommended for 'important' individuals. Encouragement to use anonymous phone and data-only SIM cards. Snowden leaks showed NSA hacked ordinary broadband providers administrators. FSB response to Pegasus and Graphite detection.",
    "hn_summary": "- Kaspersky Lab has released \"Operation Triangulation,\" a tool that can scan iPhone backups for compromise.\n- End-to-end encrypted calls may not be reliable due to device compromise, but open-source VoIP apps with E2EE alternatives exist.\n- Other tools, such as the Mobile Verification Toolkit and the iMazing tool to detect Pegasus and Graphite, have been released to identify potential device compromises."
  },
  {
    "id": 36159443,
    "timestamp": 1685667069,
    "title": "It's not wrong that \"🤦🏼‍♂️\".length == 7 (2019)",
    "url": "https://hsivonen.fi/string-length/",
    "hn_url": "http://news.ycombinator.com/item?id=36159443",
    "content": "In this article, the author discusses the different ways that programming languages define and measure string length, particularly when it comes to Unicode and emojis. The article goes over the different definitions and lengths used by Python, JavaScript, Rust, and Swift, and argues that there's no one \"correct\" way to measure string length. Instead, the choice of which length method to use depends on the needs of the program or project. Additionally, the article delves into the question of whether string lengths should be computed eagerly or lazily, and suggests that this decision depends on the programming language and the needs of the project.The post discusses the storage and encoding of strings in programming languages with a focus on UTF-8. It argues that UTF-8 is the most practical encoding form due to its superior input/output handling and the fact that it nudges developers towards writing correct code. The post also addresses the issue of extended grapheme clusters and argues that while they are important for some tasks, introducing them into operations that don't require them can lead to failure modes arising from Unicode version dependency. Finally, the post discusses the approach taken by different programming languages in dealing with these issues, such as C++, JavaScript, and Rust.The article discusses the importance of measure-length in different contexts, such as display space and quota limits. The concept of East Asian Width is explained, whereby certain scripts take up more display space than others. The article also presents data on the length of translations of the Universal Declaration of Human Rights in different languages, showing that while UTF-8 and UTF-16 may differ in the number of bytes per character, when accounting for information conveyed, CJK languages are not unfairly disadvantaged. The article concludes that the notion of fairness in measuring string length across all languages is difficult given variations in scripts, and different measures such as UTF-32 or extended grapheme clusters may be more or less appropriate in different contexts.Twitter does not have a straightforward method for measuring the length of a tweet, as different languages require different amounts of space. The Unicode database and East Asian Width don't provide a fair standard for measuring the amount of information conveyed in a language. Counting scalar values is the most fair standard for measuring length, but it still leads to significant disparities in how much information can be conveyed depending on the language. Giving each script a per-script weight also wouldn't work well for the Latin script, which has significant variability in length across languages. The table at the end of the article shows the difference in length for various languages using different measures.",
    "summary": "- The article explores the different ways programming languages define and measure string length, specifically when it comes to Unicode and emojis.\n- The choice of which length method to use depends on the needs of the program or project, and the decision to compute string lengths eagerly or lazily depends on the programming language and project needs.\n- Measuring the length of a tweet on Twitter is complicated due to discrepancies in how different languages require different amounts of space, and scalar values provide the most fair standard for measuring length, but significant disparities still exist depending on the language.",
    "hn_title": "It’s not wrong that \"🤦🏼‍♂️\".length == 7 (2019)",
    "original_title": "It’s not wrong that \"🤦🏼‍♂️\".length == 7 (2019)",
    "score": 272,
    "hn_content": "The article discusses the ambiguity of the \"length\" attribute for strings and argues that it should be replaced with more precise descriptors. The author suggests that strings should be viewed as an opaque data type with views into it depending on what you're trying to do and goes on to describe the differences between UTF-8 byte count, parsing code points, editing grapheme clusters, and display bounding box in points. The comments section includes a discussion about the best approach for dealing with strings in Unicode code points, bytes, or graphemes clusters, with some disagreement about which approach is best. The debate includes opinions on programming string algorithms, collaborative text editing, and dealing with strings in different languages and systems.Some argue that relying on Unicode codepoints as a measure of a string is impractical since it cannot be used to determine the number of displayed characters or length in bytes, among other limitations. Instead, people suggest separate types for programming symbols and human displayable text with distinct APIs that answer specific questions, such as the length of human-recognizable characters. However, some disagree, saying separating ASCII and Unicode would be more of a regression. Different languages might have varying definitions of the same term. Grapheme clusters might not be consistent across operating systems and time. Finally, Unicode advocates Han Unification.The post discusses the complexities of Unicode and how it affects string manipulation. Different fonts can show the same character in different ways, and there are separate Unicode points for traditional and simplified Chinese characters, as well as for Japanese and Korean characters. Counting grapheme clusters can also be problematic since it depends on the font used and can lead to errors. The author argues that relying on code points alone is not sufficient for handling strings and proposes viewing strings as opaque data types with different views depending on the task. Python 3's use of UTF-32 and code points is criticized for being unnecessary and expensive.A discussion on the usefulness of different ways to represent string length in Unicode, including grapheme clusters, code points, and code units in various encodings. Different programming languages have different conventions and methods for iterating over strings at these various levels of abstraction. The conversation includes debate about the merits and drawbacks of UTF-16 and UTF-32 as encoding schemes for Unicode strings, and the challenges of dealing with ill-formed strings in these formats. Many participants also discuss the difficulties of dealing with non-ASCII characters in their code, especially when working with external APIs orSeveral programming languages, including Windows, Java, C#, and JavaScript, use UTF-16, an encoding that was adopted at a time when it was believed that 64K code points would suffice. Despite its limitations, the languages still use the encoding today because of backward compatibility.UTF-16 string length should be deprecated because the number of \"length bars\" you get is misleading, as some characters may be represented by multiple code units and so may have multiple length bars. The Python 3 approach of using a sequence of scalar value code points is considered the most correct. However, some argue that it is not very practical and that Unicode defines text as a series of encoded character codes, which are represented by numbers from 0 to 10FFFF_16. This definition implicitly acknowledges the history of how Unicode support was added to different platforms.The comments section discusses how to count the length of strings and the challenges that arise with Unicode characters and grapheme clusters. There is a debate about the practicality of different approaches, including using code points, grapheme clusters, or byte counts. Some programming languages like Swift and Python use different methods for different types of strings, while others like Ruby and JavaScript have built-in functions for different measurements. There are also references to tools and libraries that can help with text manipulation, such as Harfbuzz and Unicode X-Ray. The comments touch on the complexities of Unicode and the potential for errors in counting text length.A discussion thread on Hacker News explores the character count of emojis in different Unicode encodings. In GSM-7, emojis can take up to 16 bits per character, reducing the message capacity to 70 characters, as opposed to the standard 160 characters. Python programming language was also mentioned as a tool for manipulating emojis. The thread delves into the complexities of Unicode and the challenges associated with character counts in various contexts. Readers found the discussion informative and engaging, prompting a range of responses regarding the benefits and drawbacks of using emojis, as well as digging into the history and reasoning behind Unicode's choices.",
    "hn_summary": "- The article discusses the ambiguity of the \"length\" attribute for strings and suggests that it be replaced with more precise descriptors.\n- The comments section debates the best approach for dealing with strings in Unicode code points, bytes, or graphemes clusters, with some disagreement about which approach is best.\n- The discussion covers the practicality of different methods, including using code points, grapheme clusters, or byte counts, with references to tools and libraries that can help with text manipulation."
  },
  {
    "id": 36168068,
    "timestamp": 1685726598,
    "title": "He made linear algebra fun",
    "url": "https://news.mit.edu/2023/gilbert-strang-made-linear-algebra-fun-0531",
    "hn_url": "http://news.ycombinator.com/item?id=36168068",
    "content": "A series of numbers describes the career of Professor Gil Strang as he retires from MIT after six highly influential decades on the faculty.Watch VideoSandi Miller | Department of MathematicsPublication DateMay 31, 2023PRESS INQUIRIES“Teaching has been a wonderful life,” says Gil Strang. “And I am so grateful to everyone who likes linear algebra and sees its importance. So many universities (and even high schools) now appreciate how beautiful it is and how valuable it is. That movement will continue because it is right.”Photo courtesy of Gil Strang.Previous imageNext imageThe following series of numbers might help to summarize the MIT career of MathWorks Professor of Mathematics Gilbert “Gil” Strang ’55, who taught his last class on May 15.3+2+61=66, or 75% of his lifeStrang has spent 66 of his 88 years at MIT — as a student, an instructor, and a faculty member.“There were about eight math majors then,” says Strang, a William Barton Rogers Scholar who took just three years to graduate from MIT with a BS, in 1955. “And now there are hundreds.”Strang received a BA and MA in 1957 as a Rhodes Scholar at Balliol College in Oxford, England, and a PhD in 1959 from the University of California at Los Angeles, where he was advised by Peter Henrici. His dissertation was \"Difference Methods for Mixed Boundary Value Problems.”A CLE Moore instructor from 1959 to 1961, he joined the MIT faculty in 1962. A full professor in 1970, Strang focuses his research on mathematical analysis, linear algebra, and partial differential equations.“He has had a tremendous impact on the teaching of mathematics to tens of thousands of students at MIT through his lectures, to countless students at other academic institutions through his textbooks, and to millions of people all over the globe through his online lectures and digital media,” says Professor Michel Goemans, head of the Department of Mathematics.Play video1934Year in which Strang was born, in Chicago.His parents William and Mary Catherine Strang emigrated to the United States from Scotland. Strang and his sister Vivian grew up in Washington and Cincinnati, Ohio, and attended the Principia School in St. Louis, Missouri. He and his wife Jillian have three sons, David, John, and Robert, and 10 grandchildren.15,000Number of students he has taught at MIT since he was a CLE Moore instructor.Strang has taught calculus, analysis, and computational science and engineering (18.085). But it’s his linear algebra class that evolved into a course eventually taken by a third of the MIT student body.Strang began teaching linear algebra in the 1970s, during a time when engineers and scientists wrote large software packages using the finite element method to solve structural problems in mechanics. But he saw the need to restructure the class so he could teach linear algebra in a constructive way, to show that it was related to everything from pure math to the internet. “We needed to explain the ideas in concrete language that students could follow and understand and use,” he explains.17Number of awards and recognitions he has received for his research, service, and teaching.These include the 1976 Chauvenet Prize; the Society for Industrial and Applied Mathematics’ (SIAM’s) 2003 Award for Distinguished Service; and the 2020 Irwin Sizer Award for the Most Significant Improvement to MIT Education.Strang also won the Graduate School Teaching Award in 2003; the Von Neumann Prize Medal of the U.S. Association for Computational Mechanics in 2005; the Mathematical Association of America’s Lester Ford Prize in 2005 and the Haimo Prize in 2006; and the Henrici and Su Buchin Prizes of the International Congress of Industrial & Applied Mathematics in 2007.He is a member of the National Academy of Sciences, a fellow of the American Academy of Arts and Sciences, and an honorary fellow of Balliol College, Oxford. In 2019, he was elected as a foreign member of the Russian Academy of Sciences, in the section of Applied Mathematics and Computer Science. His service to the academic community includes serving as president of SIAM, chair of the Joint Policy Board for Mathematics, chair of the U.S. National Committee on Mathematics, member of the Abel Prize Committee, and chair of the math department’s Pure Mathematics Committee.20Number of books Strang has written so far.Strang recently released “Introduction to Linear Algebra,” the sixth edition of the book he first published over 40 years ago. In 2019 he released \"Linear Algebra and Learning from Data.\"In his retirement he will continue running Wellesley-Cambridge Press, which has published his books since 1986. Its newest outlet is Wellesley Publishers in India; “Introduction to Linear Algebra” has been translated into French, German, Greek, Japanese, Portuguese, and Chinese.His textbooks are celebrated for their simple methods to teach complex subjects.“The good abstractions from the deeper classes are in Gil’s texts — but yet they are made accessible the Gil Strang way,” says MIT Professor Alan Edelman. “You can still find vector spaces, subspaces, dimensions … and linear transformations. All those ideas from pure linear algebra are not lost, just made more relevant. I love watching how he weaves these deeper ideas into the flow of the class. Gil sneaks in the real spirit of this beautiful mathematical subject, and it’s for everybody.”“Undergraduate mathematics textbooks are not what they used to be, and Gilbert Strang's superb new edition of ‘Introduction to Linear Algebra’ is an example of everything that a modern textbook could possibly be, and more,” says book reviewer Douglas Farenick of the University of Regina. The book “keeps one eye on the theory, the other on applications, and has the stated goal of ‘opening linear algebra to the world.’” He called the writing “engaging and personal … rarely does an undergraduate mathematics text feel so alive as this one.”2001Year in which Strang first uploaded his classes to MIT OpenCourseWare, the same year of its launch. “OCW transformed my life,” he says. “It was my good fortune to be teaching when President [Charles] Vest approved the creation of OpenCourseWare, opening the way for lectures to reach far beyond MIT.”Play video20 million — and countingNumber of views for Strang's OCW courses, making him one of the most recognized mathematicians in the world.Strang was one of the first faculty members at MIT to share his course materials on OCW, for class 18.06 (Linear Algebra), and he continued until his last lecture, on May 15. Strang was “a YouTube star even before there was such a thing,” says Edelman.“The OCW team and learners around the world will continue to be grateful for and benefit from his generosity and wisdom for years to come,” says OCW Senior Publication Manager Elizabeth DeRienzo.Strang’s classes became a valuable and free resource to help educators and students around the world. Strang’s lessons are “clear, interesting, and nonthreatening,” commented one high school teacher. “I watch his linear algebra lessons and wish I could tell him how terrific he is.”Other educators admit to watching him just for entertainment. “This teacher would be fun to sit down with and have a cup of coffee and conversation,” said one commenter.460Record number of students who took his last class, 18.06 (Linear Algebra), this spring.This doesn’t count the standing-room-only gathering of family members, friends, and colleagues in the back of 26-100. Math instructor Andrew Horning assisted him “in a beautiful way,” says Strang.6,000 and 352,000 — and countingAudience for Strang's final lecture, held at MIT on May 15.The lecture, which had a full house of students on hand in person at MIT, is posted on MIT OCW’s YouTube channel. Online attendees surpassed 6,000, and more than 352,000 have viewed the video over the week that followed.IncalculableOver the years, this friendly math professor learned to deftly, clearly, and humanely explain linear algebra, computational science, finite elements, wavelets, GPS, and calculus to countless students, first in the classroom, and then online.In one of his newer classes, 18.065 (Matrix Methods in Data Analysis, Signal Processing, and Machine Learning), he expanded his linear algebra teachings into the area of deep learning.“Professor Strang structures the class so that ideas seem to flow from the students into proofs,” says a former student of the class, Jesse Michel. “Every class includes a cool math trick or joke that keeps the class laughing. Professor Strang’s energy and emphasis on the exciting points keeps the class on the edge of their seats.”Strang’s easy smile, energetic lessons, and unflagging encouragement make for interactive classes. What’s his secret to effective teaching?“I like students, and I want to help,” he said in a 2019 interview. “Maybe the key point is to think with them, not to just say, ‘OK, here it is, listen up.’ I think through the question all over again as they do. And you have to give it time. You can’t zip through a proof.”His former students and colleagues recall how easy it was to work with him.“When you’re in Gil’s presence, you’re just in a better, more beautiful world,” said his doctoral student Pavel Grinfeld PhD ’03, at Strang’s last lecture. “I think that’s why I chose to pursue the same line of studies as Gil … My life especially has been touched by you.”Former teaching assistant D. Andrew Brown, now a Clemson University statistics professor, recalls him as “kind, elegant, and engaging.”Edelman says that Strang teaches with “dignity and humility” and recognizes “in everyone the thirst for knowledge.”“Whether a student was struggling or at the top of the class, Gil knew just what to say. Whether you are a colleague right next door or a stranger that landed in the hallways, one feels that Gil is your old or new best friend.”“So, what makes Gil’s lectures so very special? I love his words, his tone, his pace, and the very way that the answer seems like a surprise when we all know, he understood it from the beginning.”Chat comments from around the worldEdelman and Grinfeld led a team intent on publicizing Gil’s last lecture, including creating a web page with an online countdown to the May 15 event. In response, countless Strang fans posted their well-wishes and thanks via online comments on social media and in the video’s chat stream.“Gil, Best wishes for a great final lecture, from your #1 fan in Ithaca!” posted Cornell University math professor and former MIT math instructor Steven Strogatz, in the final lecture chat stream. When a fellow chat member called him “a fan boi,” Strogatz responded, “You bet I'm fan-boying! I had the honor of teaching Gil's 18.085 course many times at MIT and loved learning from Gil and working with him. He's as wonderful as he seems online.”And from others:“A legend! Helped me get into robotics in my mid-30s.”“Teaching math in a way that instills a love for the subject is a challenging task, much harder than solving complex equations. But your teaching style effortlessly achieves this.”“The best teacher I never had. But thanks to MIT for sharing his linear algebra lectures. He has been a blessing for thousands of his students.”“I can’t believe this legend is retiring. At least his former lectures will be available for future students.”“Your 18.06 course was my first-ever experience with a superb quality math professor who taught me a new subject in an intuitive way & made me appreciate the abstract beauty!”“Your teaching was my only source of quality education growing up in India.”“That was a very emotional hour for so many people around the world! Prof. Strang made the world a better place in his own personal way!”“Gil Strang made linear algebra accessible to the masses. I often ask myself when teaching, ‘Am I being as clear and approachable as Strang?’ I'm still working on it.”“Gil’s lecture was probably the first time I realized the difference between MIT and other universities.”“Your amazing lectures on OCW helped me not only snag an A+ for linear algebra but also lend a hand to a bunch of other students who were struggling.”“Prof. Strang's 18.06 MIT OCW series was the first lecture series I watched while waiting to study university math. … To this day, I still remember and use his column picture and row picture of matrix multiplication (each column of AB is a linear combination of columns of A) — this is seldom taught elsewhere but it really helped.”Linear momentsStrang hopes that, among other parts of his legacy, he has left behind a good road map to keep stoking a love of linear algebra.“Teaching has been a wonderful life,” says Strang. “And I am so grateful to everyone who likes linear algebra and sees its importance. So many universities (and even high schools) now appreciate how beautiful it is and how valuable it is. That movement will continue because it is right.”PRESS MENTIONSUSA TodayProf. Gilbert Strang received a standing ovation after delivering his last lecture after over 60 years of teaching at MIT, reports Saleen Martin for USA Today. “Teaching has been a wonderful life,” wrote Strang in the comments section of his last lecture on YouTube. “I am so grateful to everyone who likes linear algebra and sees its importance. So many universities (and even high schools) now appreciate how beautiful it is and how valuable it is. That movement will continue because it is right.”Full story via USA Today →Boston.comBoston.com reporter Eli Curwin spotlights how after 63 years of teaching and over 10 million views of his online lectures, MIT Prof. Gilbert Strang received a standing ovation after delivering his last lecture. Prof. Michel X. Goemans, head of the Department of Mathematics, notes that Strang “has had a tremendous impact on the teaching of mathematics to tens of thousands of students at MIT through his lectures, to countless of students at other academic institutions through his textbooks, and to millions of people all over the globe.”Full story via Boston.com →RELATED LINKSGilbert StrangArticle: \"Math Fans Join Live Sendoff for Gil Strang\"Chalk Radio Podcast: \"Making Deep Learning Human with Prof. Gilbert Strang\"MIT OpenCourseWareDepartment of MathematicsSchool of ScienceRELATED TOPICSFacultyMathematicsRetirementOpenCourseWareEducation, teaching, academicsClasses and programsAlumni/aeCommunitySchool of ScienceRELATED ARTICLESGil Strang is still going strong, online and in printMost popular MITx MOOC reaches 1.2 million enrollmentsMIT-created programming language Julia 1.0 debutsStrang receives national, international teaching prizes",
    "summary": "- Professor Gil Strang has retired from MIT after spending 66 of his 88 years at the institution. He taught linear algebra to thousands of students at MIT, which eventually evolved into a course for a third of the Institute's student body, and shared his course materials on MIT OCW.\n- Strang is an award-winning mathematician, has written over 20 books and published influential research on mathematical analysis, linear algebra, and partial differential equations.\n- Strang's legacy includes his simple methods for teaching complex subjects and making linear algebra accessible to the masses, with millions of students benefiting from his online lectures, and the movement to appreciate the subject continuing.",
    "hn_title": "He made linear algebra fun",
    "original_title": "He made linear algebra fun",
    "score": 269,
    "hn_content": "Hacker News new | past | comments | ask | show | jobs | submit loginHe made linear algebra fun (news.mit.edu)269 points by bikenaga 13 hours ago | hide | past | favorite | 38 commentsmachineering 7 hours ago | next [–]A fun anecdote: I taught him some machine learning for an afternoon! He used to spend a few months per year in Oxford, and he had gotten in touch with my PhD advisor to ask some ML questions, as at the time he was writing his new book about linear algebra and learning from data. My advisor couldn't make it to their meeting so he sent me at the last minute instead. So bewildered me, a PhD student, met with Gilbert Strang to explain him some basic machine learning concepts! Interestingly, whenever I'd asked if he was already familiar with some concept, he'd always say no, which I suspect was a strategy to hear it explained in new words.Anyway, Gil is a very polite and kind person, his encounter will stay a great memory.replyrottencupcakes 7 hours ago | prev | next [–]I started taking Gilbert Strang's \"new\" course, \"Matrix Methods In Data Analysis, Signal Processing, And Machine Learning\" (18.065), in my free time after hearing about his retirement news.https://ocw.mit.edu/courses/18-065-matrix-methods-in-data-an...It's been 17 years since I took 18.06 with Professor Strang and I've always been disappointed with my grasp of Linear Algebra, especially as it's become more and more of an important and applicable topic. It very much stopped then and I've never felt terribly confident in it.The course is great because it starts with a 6 lecture refresher that brings you back up to speed on the basics of Linear Algebra before diving into the meat of the course.To avoid being completely 100% on the Strang bandwagon, his lectures are a little off the cuff and could probably benefit from some visual aids or interactive tools outside of white boards to help students visualize what's really going on with these matrices, but the current version of the course (https://github.com/mitmath/18065/tree/main/psets) has a bunch of Julia IJupyter Notebook assignments that help you get down and dirty with what you're really trying to learn - the application of Linear Algebra.replyiamcreasy 7 hours ago | parent | next [–]Is this course related to his most recent book, Linear Algebra and Learning from Data[1]?[1] https://math.mit.edu/~gs/learningfromdata/replyrottencupcakes 4 hours ago | root | parent | next [–]précisémentreplysgift 11 hours ago | prev | next [–]That brings me back. Strang probably saved my computer science degree. That professor I had in linear algebra and me really couldn't communicate and without Strangs lectures (to his credit, my professor recommended them) I wouldn't have stood a chance.Thanks, professor. And enjoy your well-earned retirement.replystrikelaserclaw 9 hours ago | parent | next [–]i aced linear algebra even though i didn't attend many classes because i always watched strang's lectures.replymarginalia_nu 8 hours ago | root | parent | next [–]I aced lin algebra because I realized early the potential and ran home after every lecture and worked on a 3d engine incorporating most concepts.replyjessekv 27 minutes ago | root | parent | next [–]Love this. Why can't all education be this way?replyauggierose 5 minutes ago | prev | next [–]This headline sounds like somebody died.replysatiric 3 hours ago | prev | next [–]My linear algebra professor put a lot of effort into showing us the processes; how to do things, how and why they worked. Unfortunately they spent no time showing us how this stuff was actually used in the real world, and so for me it all went in one ear and out the other. A buddy of mine said that his professor spent about half an hour discussing some applications of linear algebra, and just that half hour lecture made the subject much more palatable.Then a few years later, I took a computer graphics class for my CS degree, and we were learning how to render a 3D object on a 2D monitor. And of course we used linear algebra, and then it made perfect sense. I figure all the people in the math department that cared about practical applications had left to join the CS department, or EE, or Physics or whatever. So the math department, at least at my university, had only the people who just cared about the theory, which just didn't work for my brain.replykatzgrau 7 hours ago | prev | next [–]I had very intelligent linear algebra professor in college but he was, in my opinion, a very poor communicator. I paid attention to lectures and stared at the text, but couldn't really understand the material. For the first part of a linear algebra course, students who don't mind blindly following mechanical processes for solving problems can do very well. Unfortunately I'm one of those people who tends to reject the process until I understand why it works.If it wasn't for Strang's thoughtful and sometimes even entertaining lectures via OCW, I probably would have failed the course. Instead, as the material became considerably more abstract and actually required understanding, I had my strongest exam scores. I didn't even pay attention in class. I finished with an A. Although my first exam was a 70/100, below the class average, the fact that I got an A overall suggests how poorly the rest of the class must have done on the latter material, where I felt my strongest thanks to the videos.So anyway, thank you Gilbert Strang.replybkartal 8 hours ago | prev | next [–]Gil needs to be remembered as one of the key people that helped AI developments behind the scenes by having students master linear algebra! I hope you enjoy your retirement in health and peace!replysva_ 6 hours ago | prev | next [–]A small note, to those who like Podcasts: Gilbert Strang has been on Lex's Podcast in 2019 (damn, time flies nowadays):https://m.youtube.com/watch?v=lEZPfmGCEk0replytomjakubowski 5 hours ago | prev | next [–]I took a combination linear algebra/series course in college and barely remembered anything from it. Years later, when I was learning 3D graphics, almost any time I did matrix-matrix or matrix-vector multiplication, I had to look up a formula or painfully work through remembering how it worked. My attempts to memorize the simple algorithm all failed.Then I bought Strang's book, watched the OCW lectures, and did the homework. Now any time I have to do or think about a matrix multiplication, Strang's voice echoes in my head, \"combinations of columns.\" There is something special about his words, his tone of voice, and his repetition, which all together make it click for me.replylinster 9 hours ago | prev | next [–]I know this article is about Strang from the context of his retirement a few weeks ago, but the title is clickbait.replyb33j0r 8 hours ago | parent | next [–]Given other trending headlines, I thought he’d died. The past tense thing. Glad it was just a celebration!replymb7733 9 hours ago | parent | prev | next [–]I guessed this was about Strang just from the title! I hadn't heard about his retirement.replystavros 8 hours ago | root | parent | next [–]I saw the title, and thought \"the only person I can think of that this applies to is Gilbert Strang\". Imagine my surprise when it was actually him, when I haven't thought of him or linear algebra for fifteen years.replyhexo 7 hours ago | prev | next [–]Thanks to Him I've learned how to solve a linear algebra problem even when I had no clue what to do. He was/is absolute champion in that. At the exam, I've used his methods to approach the problem and my solutions were real different from what my examiner expected - so much that he marked my solutions as wrong(! :D), I had to point out that \"wait; don't!, it IS correct\" so the test correcting person had to actualy go though my solutions and proofs and really check them. I was right and passed the test.Thank you so much Sir! OCW rullz!replyperihelions 11 hours ago | prev | next [–]51 more comments herehttps://news.ycombinator.com/item?id=36038635replydang 10 hours ago | parent | next [–]Thanks! Macroexpanded:Students give Gilbert Strang a standing ovation after his last lecture - https://news.ycombinator.com/item?id=36038635 - May 2023 (51 comments)A thank you to Gilbert Strang, retiring after his 61-year long teaching career - https://news.ycombinator.com/item?id=35981340 - May 2023 (1 comment)Gilbert Strang's final lecture at MIT: May 15, 11:00am - https://news.ycombinator.com/item?id=35921538 - May 2023 (56 comments)Gilbert Strang Teaches Linear Algebra - https://news.ycombinator.com/item?id=22382337 - Feb 2020 (91 comments)Gilbert Strang's New Course on Linear Algebra+ for ML Now Online - https://news.ycombinator.com/item?id=19939030 - May 2019 (23 comments)Matrix Methods in Data Analysis, Signal Processing, and Machine Learning - https://news.ycombinator.com/item?id=19933274 - May 2019 (21 comments)Strang's “Linear Algebra and Learning from Data” is printed and available - https://news.ycombinator.com/item?id=18862719 - Jan 2019 (22 comments)A conversation with Gilbert Strang [video] - https://news.ycombinator.com/item?id=18048316 - Sept 2018 (19 comments)Too Much Calculus – Gilbert Strang (2001) [pdf] - https://news.ycombinator.com/item?id=9189553 - March 2015 (134 comments)Calculus by Gilbert Strang - https://news.ycombinator.com/item?id=343332 - Oct 2008 (3 comments)replyzgs 4 hours ago | prev | next [–]Linear algebra was one of my favourite series of subjects during my mathematics degrees. It has always been fun.There was only one rocky moment I can recollect, in first year after a three lecture proof which the lecturer finished with words along the lines of: \"I won't go through this again because you wouldn't understand it the second time either.\" Quite possibly true, although I understood the steps of the proof the theorem itself wasn't at all obvious. In later years it became so.replybluenose69 8 hours ago | prev | next [–]I really appreciated the sentence following the title, because I was thinking this would be an obituary. And, to make things better, there's an informative and very sweet video interview with him at the end of the article. Even in that, he takes a didactic approach, teaching other teachers how to teach.Whether one likes or dislikes mathematics, it's hard to argue that he was anything but captivating in the classroom.replyimbusy111 8 hours ago | prev | next [–]I remember watching his lectures 17 years ago online when I was a teenager. That was the first online course I've done and it was on MIT OpenCourseWare.Then, when I was actually getting a math degree years later in Manchester, UK, I got the highest score on the linear algebra exam out of all the classes I did. I doubt I would have done so well without Strang.replyfnordpiglet 11 hours ago | prev | next [–]Never took his courses but used his book. My linear algebra teacher was awesome. The two changed my life.replykiechu 10 hours ago | prev | next [–]Strang course is available on YT as part of MIT OCW. Amazing lecturer.reply8bitsrule 2 hours ago | prev | next [–]I tried a linear algebra course once; guess I got the wrong teacher, checked out in 3 weeks.A few teachers have the juice, most have the pulp.replyneodypsis 5 hours ago | prev | next [–]I struggled with a very deficient linear algebra course from my local university in 2009-2010. Fortunately I discovered Gilbert Strang's book and OCW lectures, which gave me the motivation to continue. I still own that copy.replyrevskill 1 hour ago | prev | next [–]There's no shortcut to Linear Algebra understanding. Most of reasoning is boring, lack of creativity, dry as hell.replybeyonddream 10 hours ago | prev | next [–]I have listened to his lectures but found it hard to follow his train of thoughts and pace and I am sure I am in the minority :). What worked somewhat is listening to 2x speed.replyinfocollector 11 hours ago | prev | next [–]He is a legend in linear algebra, and probably will be for a long time. His video lectures have proven invaluable, benefiting millions.replyomgmajk 8 hours ago | prev | next [–]I just watched that video in the article of his last lecture and it was indeed fun!replyPartiallyTyped 8 hours ago | prev | next [–]MIT's profs Strang and the late professor Winston have positively changed my life. I knew it was him from the title and was worried he ... yeah.replythe__alchemist 11 hours ago | prev | next [–]This dude taught the Lin alg courses that went on MitX. Super good!replylevzettelin 10 hours ago | prev [5 more]Applications are open for YC Summer 2023Guidelines | FAQ | Lists | API | Security | Legal | Apply to YC | ContactSearch:",
    "hn_summary": "- Gilbert Strang, a famous mathematician and linear algebra expert, retired after a 61-year teaching career.\n- Many people credit Strang's teaching style with helping them understand and appreciate linear algebra, even if they previously struggled with it.\n- Strang's lectures and resources, including his book and videos, are highly recommended for anyone looking to learn linear algebra."
  },
  {
    "id": 36161175,
    "timestamp": 1685681442,
    "title": "Parachute use to prevent death, trauma when jumping from aircraft (2018) [pdf]",
    "url": "https://www.bmj.com/content/bmj/363/bmj.k5094.full.pdf",
    "hn_url": "http://news.ycombinator.com/item?id=36161175",
    "content": "Hacker News new | past | comments | ask | show | jobs | submit loginHe made linear algebra fun (news.mit.edu)269 points by bikenaga 13 hours ago | hide | past | favorite | 38 commentsmachineering 7 hours ago | next [–]A fun anecdote: I taught him some machine learning for an afternoon! He used to spend a few months per year in Oxford, and he had gotten in touch with my PhD advisor to ask some ML questions, as at the time he was writing his new book about linear algebra and learning from data. My advisor couldn't make it to their meeting so he sent me at the last minute instead. So bewildered me, a PhD student, met with Gilbert Strang to explain him some basic machine learning concepts! Interestingly, whenever I'd asked if he was already familiar with some concept, he'd always say no, which I suspect was a strategy to hear it explained in new words.Anyway, Gil is a very polite and kind person, his encounter will stay a great memory.replyrottencupcakes 7 hours ago | prev | next [–]I started taking Gilbert Strang's \"new\" course, \"Matrix Methods In Data Analysis, Signal Processing, And Machine Learning\" (18.065), in my free time after hearing about his retirement news.https://ocw.mit.edu/courses/18-065-matrix-methods-in-data-an...It's been 17 years since I took 18.06 with Professor Strang and I've always been disappointed with my grasp of Linear Algebra, especially as it's become more and more of an important and applicable topic. It very much stopped then and I've never felt terribly confident in it.The course is great because it starts with a 6 lecture refresher that brings you back up to speed on the basics of Linear Algebra before diving into the meat of the course.To avoid being completely 100% on the Strang bandwagon, his lectures are a little off the cuff and could probably benefit from some visual aids or interactive tools outside of white boards to help students visualize what's really going on with these matrices, but the current version of the course (https://github.com/mitmath/18065/tree/main/psets) has a bunch of Julia IJupyter Notebook assignments that help you get down and dirty with what you're really trying to learn - the application of Linear Algebra.replyiamcreasy 7 hours ago | parent | next [–]Is this course related to his most recent book, Linear Algebra and Learning from Data[1]?[1] https://math.mit.edu/~gs/learningfromdata/replyrottencupcakes 4 hours ago | root | parent | next [–]précisémentreplysgift 11 hours ago | prev | next [–]That brings me back. Strang probably saved my computer science degree. That professor I had in linear algebra and me really couldn't communicate and without Strangs lectures (to his credit, my professor recommended them) I wouldn't have stood a chance.Thanks, professor. And enjoy your well-earned retirement.replystrikelaserclaw 9 hours ago | parent | next [–]i aced linear algebra even though i didn't attend many classes because i always watched strang's lectures.replymarginalia_nu 8 hours ago | root | parent | next [–]I aced lin algebra because I realized early the potential and ran home after every lecture and worked on a 3d engine incorporating most concepts.replyjessekv 27 minutes ago | root | parent | next [–]Love this. Why can't all education be this way?replyauggierose 5 minutes ago | prev | next [–]This headline sounds like somebody died.replysatiric 3 hours ago | prev | next [–]My linear algebra professor put a lot of effort into showing us the processes; how to do things, how and why they worked. Unfortunately they spent no time showing us how this stuff was actually used in the real world, and so for me it all went in one ear and out the other. A buddy of mine said that his professor spent about half an hour discussing some applications of linear algebra, and just that half hour lecture made the subject much more palatable.Then a few years later, I took a computer graphics class for my CS degree, and we were learning how to render a 3D object on a 2D monitor. And of course we used linear algebra, and then it made perfect sense. I figure all the people in the math department that cared about practical applications had left to join the CS department, or EE, or Physics or whatever. So the math department, at least at my university, had only the people who just cared about the theory, which just didn't work for my brain.replykatzgrau 7 hours ago | prev | next [–]I had very intelligent linear algebra professor in college but he was, in my opinion, a very poor communicator. I paid attention to lectures and stared at the text, but couldn't really understand the material. For the first part of a linear algebra course, students who don't mind blindly following mechanical processes for solving problems can do very well. Unfortunately I'm one of those people who tends to reject the process until I understand why it works.If it wasn't for Strang's thoughtful and sometimes even entertaining lectures via OCW, I probably would have failed the course. Instead, as the material became considerably more abstract and actually required understanding, I had my strongest exam scores. I didn't even pay attention in class. I finished with an A. Although my first exam was a 70/100, below the class average, the fact that I got an A overall suggests how poorly the rest of the class must have done on the latter material, where I felt my strongest thanks to the videos.So anyway, thank you Gilbert Strang.replybkartal 8 hours ago | prev | next [–]Gil needs to be remembered as one of the key people that helped AI developments behind the scenes by having students master linear algebra! I hope you enjoy your retirement in health and peace!replysva_ 6 hours ago | prev | next [–]A small note, to those who like Podcasts: Gilbert Strang has been on Lex's Podcast in 2019 (damn, time flies nowadays):https://m.youtube.com/watch?v=lEZPfmGCEk0replytomjakubowski 5 hours ago | prev | next [–]I took a combination linear algebra/series course in college and barely remembered anything from it. Years later, when I was learning 3D graphics, almost any time I did matrix-matrix or matrix-vector multiplication, I had to look up a formula or painfully work through remembering how it worked. My attempts to memorize the simple algorithm all failed.Then I bought Strang's book, watched the OCW lectures, and did the homework. Now any time I have to do or think about a matrix multiplication, Strang's voice echoes in my head, \"combinations of columns.\" There is something special about his words, his tone of voice, and his repetition, which all together make it click for me.replylinster 9 hours ago | prev | next [–]I know this article is about Strang from the context of his retirement a few weeks ago, but the title is clickbait.replyb33j0r 8 hours ago | parent | next [–]Given other trending headlines, I thought he’d died. The past tense thing. Glad it was just a celebration!replymb7733 9 hours ago | parent | prev | next [–]I guessed this was about Strang just from the title! I hadn't heard about his retirement.replystavros 8 hours ago | root | parent | next [–]I saw the title, and thought \"the only person I can think of that this applies to is Gilbert Strang\". Imagine my surprise when it was actually him, when I haven't thought of him or linear algebra for fifteen years.replyhexo 7 hours ago | prev | next [–]Thanks to Him I've learned how to solve a linear algebra problem even when I had no clue what to do. He was/is absolute champion in that. At the exam, I've used his methods to approach the problem and my solutions were real different from what my examiner expected - so much that he marked my solutions as wrong(! :D), I had to point out that \"wait; don't!, it IS correct\" so the test correcting person had to actualy go though my solutions and proofs and really check them. I was right and passed the test.Thank you so much Sir! OCW rullz!replyperihelions 11 hours ago | prev | next [–]51 more comments herehttps://news.ycombinator.com/item?id=36038635replydang 10 hours ago | parent | next [–]Thanks! Macroexpanded:Students give Gilbert Strang a standing ovation after his last lecture - https://news.ycombinator.com/item?id=36038635 - May 2023 (51 comments)A thank you to Gilbert Strang, retiring after his 61-year long teaching career - https://news.ycombinator.com/item?id=35981340 - May 2023 (1 comment)Gilbert Strang's final lecture at MIT: May 15, 11:00am - https://news.ycombinator.com/item?id=35921538 - May 2023 (56 comments)Gilbert Strang Teaches Linear Algebra - https://news.ycombinator.com/item?id=22382337 - Feb 2020 (91 comments)Gilbert Strang's New Course on Linear Algebra+ for ML Now Online - https://news.ycombinator.com/item?id=19939030 - May 2019 (23 comments)Matrix Methods in Data Analysis, Signal Processing, and Machine Learning - https://news.ycombinator.com/item?id=19933274 - May 2019 (21 comments)Strang's “Linear Algebra and Learning from Data” is printed and available - https://news.ycombinator.com/item?id=18862719 - Jan 2019 (22 comments)A conversation with Gilbert Strang [video] - https://news.ycombinator.com/item?id=18048316 - Sept 2018 (19 comments)Too Much Calculus – Gilbert Strang (2001) [pdf] - https://news.ycombinator.com/item?id=9189553 - March 2015 (134 comments)Calculus by Gilbert Strang - https://news.ycombinator.com/item?id=343332 - Oct 2008 (3 comments)replyzgs 4 hours ago | prev | next [–]Linear algebra was one of my favourite series of subjects during my mathematics degrees. It has always been fun.There was only one rocky moment I can recollect, in first year after a three lecture proof which the lecturer finished with words along the lines of: \"I won't go through this again because you wouldn't understand it the second time either.\" Quite possibly true, although I understood the steps of the proof the theorem itself wasn't at all obvious. In later years it became so.replybluenose69 8 hours ago | prev | next [–]I really appreciated the sentence following the title, because I was thinking this would be an obituary. And, to make things better, there's an informative and very sweet video interview with him at the end of the article. Even in that, he takes a didactic approach, teaching other teachers how to teach.Whether one likes or dislikes mathematics, it's hard to argue that he was anything but captivating in the classroom.replyimbusy111 8 hours ago | prev | next [–]I remember watching his lectures 17 years ago online when I was a teenager. That was the first online course I've done and it was on MIT OpenCourseWare.Then, when I was actually getting a math degree years later in Manchester, UK, I got the highest score on the linear algebra exam out of all the classes I did. I doubt I would have done so well without Strang.replyfnordpiglet 11 hours ago | prev | next [–]Never took his courses but used his book. My linear algebra teacher was awesome. The two changed my life.replykiechu 10 hours ago | prev | next [–]Strang course is available on YT as part of MIT OCW. Amazing lecturer.reply8bitsrule 2 hours ago | prev | next [–]I tried a linear algebra course once; guess I got the wrong teacher, checked out in 3 weeks.A few teachers have the juice, most have the pulp.replyneodypsis 5 hours ago | prev | next [–]I struggled with a very deficient linear algebra course from my local university in 2009-2010. Fortunately I discovered Gilbert Strang's book and OCW lectures, which gave me the motivation to continue. I still own that copy.replyrevskill 1 hour ago | prev | next [–]There's no shortcut to Linear Algebra understanding. Most of reasoning is boring, lack of creativity, dry as hell.replybeyonddream 10 hours ago | prev | next [–]I have listened to his lectures but found it hard to follow his train of thoughts and pace and I am sure I am in the minority :). What worked somewhat is listening to 2x speed.replyinfocollector 11 hours ago | prev | next [–]He is a legend in linear algebra, and probably will be for a long time. His video lectures have proven invaluable, benefiting millions.replyomgmajk 8 hours ago | prev | next [–]I just watched that video in the article of his last lecture and it was indeed fun!replyPartiallyTyped 8 hours ago | prev | next [–]MIT's profs Strang and the late professor Winston have positively changed my life. I knew it was him from the title and was worried he ... yeah.replythe__alchemist 11 hours ago | prev | next [–]This dude taught the Lin alg courses that went on MitX. Super good!replylevzettelin 10 hours ago | prev [5 more]Applications are open for YC Summer 2023Guidelines | FAQ | Lists | API | Security | Legal | Apply to YC | ContactSearch:",
    "summary": "",
    "hn_title": "Parachute use to prevent death, trauma when jumping from aircraft (2018) [pdf]",
    "original_title": "Parachute use to prevent death, trauma when jumping from aircraft (2018) [pdf]",
    "score": 264,
    "hn_content": "A humorous thread on Hacker News ensues after a study published in the British Medical Journal about parachute use to prevent death and trauma when jumping from aircraft. The thread includes discussions on the terminal velocity of mice and whether they need a parachute, whether shrews could survive a fall from a thousand-yard mine shaft, and if squirrels can survive falls. There was also a discussion on rodents being released at altitude and surviving. The post reminded readers that correlation is not causation and cautioned against making conclusions from the study's results. Overall, the thread provided entertainment and humor surrounding a potentially serious topic.Advocates of evidence-based medicine emphasize the importance of randomized controlled trials (RCTs) in obtaining high-quality evidence. However, many clinical practice guidelines are based on weak evidence, such as expert opinion or observational studies. The goal of evidence-based medicine is not to dismiss these sources of evidence, but to prioritize obtaining the highest quality evidence possible. The \"Parachute Study\" is an example of a randomized controlled trial that demonstrated no difference in survival rates between those who used a parachute when jumping from a plane and those who did not. The study highlights the importance of considering the nuances of research rather than relying solely on statistical significance. In general, statistical significance only indicates that the effect did not come from sampling error, not that the result is necessarily true.A satirical response to the critique of Evidence-Based Medicine (EBM), presented as a randomized controlled trial on the use of parachutes, highlights the limitations of such trials and their interpretation. Despite being satire, the authors still maintain that such trials remain the gold standard for evaluating most new treatments. The study does bring attention to the flawed philosophy of only relying on RCT studies to make decisions about the importance of a paper. The study also calls attention to selection bias and how it affects RCTs in particular.",
    "hn_summary": "- A humorous discussion on Hacker News arises after a study about the effectiveness of using parachutes when jumping from aircraft is published.\n- Readers caution against drawing conclusions from the study's results and remind that correlation does not equal causation.\n- The study highlights the importance of considering the nuances of research and not relying solely on statistical significance, as well as the limitations and potential flaws with evidence-based medicine and randomized controlled trials."
  }
]
