[
  {
    "id": 41792500,
    "title": "أرشيف الإنترنت: تنبيه اختراق أمني",
    "originLink": "https://www.theverge.com/2024/10/9/24266419/internet-archive-ddos-attack-pop-up-message",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41792500",
    "commentBody": "",
    "originSummary": [
      "تعرض أرشيف الإنترنت لاختراق أمني، مما أدى إلى تسريب معلومات تخص 31 مليون حساب، بما في ذلك عناوين البريد الإلكتروني وبيانات أخرى.",
      "تم تأكيد الاختراق من قبل موقع \"هل تم اختراقي؟\" (HIBP)، حيث كانت 54% من الحسابات المتأثرة موجودة بالفعل في قاعدة بياناته من حوادث سابقة.",
      "بالإضافة إلى الاختراق، واجه أرشيف الإنترنت هجوم حجب الخدمة الموزع (DDoS)، مما أدى إلى تعطيل الخدمات، ويعمل الآن على ترقية تدابير الأمان الخاصة به."
    ],
    "commentSummary": [
      "تعرض أرشيف الإنترنت لخرق أمني، مما أدى إلى كشف 31 مليون سجل، بما في ذلك عناوين البريد الإلكتروني للمستخدمين، التي كانت علنية دون علم في البيانات الوصفية. يسلط هذا الحادث الضوء على المخاوف المتعلقة بخصوصية البريد الإلكتروني، مع مناقشات حول ما إذا كان يجب التعامل مع عناوين البريد الإلكتروني كمعلومات خاصة مثل أرقام الهواتف أو عناوين المنازل. تم إدراج الخرق الآن في قاعدة بيانات \"هل تعرضت للاختراق\"، وينصح المستخدمون باستخدام عناوين بريد إلكتروني فريدة لكل خدمة والنظر في استخدام أسماء مستعارة للبريد الإلكتروني لتعزيز الخصوصية وتقليل البريد العشوائي."
    ],
    "points": 1009,
    "commentCount": 545,
    "retryCount": 0,
    "time": 1728507266
  },
  {
    "id": 41797719,
    "title": "مساعدة الويكيات على الانتقال بعيدًا عن فاندوم",
    "originLink": "https://weirdgloop.org/blog/why-were-helping-more-wikis-move-away-from-fandom",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41797719",
    "commentBody": "",
    "originSummary": [
      "تستضيف الآن Weird Gloop الويكي الرسمي للعبة League of Legends، حيث يتم نقله من Fandom لتعزيز الويكيات التي يقودها المجتمع وتكون صديقة للمطورين.",
      "تتطرق هذه الخطوة إلى مشكلات مع فاندوم، مثل الاحتفاظ بإصدارات الويكي القديمة، وتستفيد من الدعم المتزايد من جوجل للويكيات المستقلة، مما يساعد في استعادة حركة المرور.",
      "يمكن أن يؤدي الانتقال إلى مضاعفة عدد المساهمين والسماح بمشاريع تقنية مخصصة، مع تقديم Weird Gloop الإرشادات لأولئك المهتمين بنقل ويكياتهم من Fandom."
    ],
    "commentSummary": [
      "تساعد Weird Gloop الويكيات في الانتقال بعيدًا عن Fandom، الذي يتعرض للانتقاد بسبب الإعلانات المزعجة وتجربة المستخدم السيئة. - انتقال ويكي ماينكرافت إلى Weird Gloop يمثل مثالًا ناجحًا على الانتقال إلى منصة أكثر فعالية من حيث التكلفة وملائمة للمستخدم. - يعكس هذا التحول اتجاهًا أوسع للمجتمعات التي تبحث عن بدائل لـ Fandom، الذي يُنظر إليه على أنه يفضل الربح على تجربة المستخدم."
    ],
    "points": 675,
    "commentCount": 314,
    "retryCount": 0,
    "time": 1728559313
  },
  {
    "id": 41793597,
    "title": "لماذا لا يستخدم مكون \"الخروج من هذه الصفحة\" في موقع Gov.uk مفتاح الهروب",
    "originLink": "https://beeps.website/blog/2024-10-09-why-govuk-exit-this-page-doesnt-use-escape/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41793597",
    "commentBody": "",
    "originSummary": [
      "يتجنب مكون \"الخروج من هذه الصفحة\" في GOV.UK استخدام مفتاح الهروب بسبب احتمالية إيقاف تحميل الصفحة واستخدامه في وظائف أخرى لنظام التشغيل. - يتم استخدام مفتاح Shift بدلاً من ذلك لإعادة التوجيه عبر JavaScript، حيث يوفر وظيفة أكثر اتساقًا رغم محدودياته. - يقوم المكون بإعادة توجيه المستخدمين إلى موقع BBC Weather لضمان صفحة محايدة وغنية بالمحتوى، مما يساعد المستخدمين على مغادرة الصفحة بسرعة في مواقف قد تكون خطيرة، مثل العنف المنزلي."
    ],
    "commentSummary": [
      "تجنب ميزة \"الخروج من هذه الصفحة\" في موقع Gov.uk استخدام مفتاح الهروب لمنع توقف تحميل الصفحة، وتختار بدلاً من ذلك الضغط على مفتاح Shift ثلاث مرات.",
      "يجادل النقاد بأن الميزة مبالغ في تصميمها وليست سهلة الاستخدام، مقترحين بدائل أبسط مثل تعليم المستخدمين إغلاق علامات التبويب باستخدام اختصارات لوحة المفاتيح.",
      "الميزة مصممة للمواقف ذات الضغط العالي، مثل العنف المنزلي، لإخفاء نشاط التصفح بسرعة، لكن فعاليتها وإمكانية اكتشافها تخضع للتدقيق."
    ],
    "points": 356,
    "commentCount": 215,
    "retryCount": 0,
    "time": 1728513926
  },
  {
    "id": 41795218,
    "title": "رجل الأعمال والصناعي والمحسن الهندي، راتان تاتا، توفي عن عمر يناهز 86 عامًا",
    "originLink": "https://en.wikipedia.org/wiki/Ratan_Tata",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41795218",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [],
    "points": 346,
    "commentCount": 118,
    "retryCount": 0,
    "time": 1728530957
  },
  {
    "id": 41795561,
    "title": "WASM هو CGI الجديد",
    "originLink": "https://roborooter.com/post/wasm-is-the-new-cgi/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41795561",
    "commentBody": "",
    "originSummary": [
      "يُحدث WebAssembly (Wasm) ثورة في تطبيقات الويب من خلال تقديم مواقع تفاعلية عالية الأداء وسهلة الصيانة، متفوقة على النموذج التقليدي لـ CGI.",
      "تمكن Wasm من تنفيذ التعليمات البرمجية في كل من المتصفحات والخوادم، مما يوفر نموذج عزل خفيف الوزن للشفرة غير الموثوق بها ويدعم لغات برمجة متعددة.",
      "على الرغم من بعض التنازلات، مثل الخيوط المحدودة والتجميع في الوقت المناسب (JIT)، فإن مزايا الأداء والأمان لـ Wasm تجعلها تقنية واعدة لتطوير الويب في المستقبل، مما قد يحول قيود تطوير الويب ويفتح إمكانيات جديدة."
    ],
    "commentSummary": [
      "يتم مقارنة WebAssembly (WASM) بالتقنيات القديمة مثل Java Applets وFlash، ولكنه يقدم أمانًا وكفاءة محسّنة ويعمل كمعيار مفتوح. - على عكس أسلافه، يعمل WASM داخل صندوق الرمل الخاص بالمتصفح، مما يسمح له بتنفيذ التعليمات البرمجية بلغات مختلفة بأمان وكفاءة، وليس مقتصرًا على JavaScript. - تجعل مرونة وأمان WASM منه تقنية واعدة لتطبيقات العميل والخادم على حد سواء، مع إمكانية للتطبيقات المحلية التي تقلل من الاعتماد على الخادم من خلال العمل بشكل أساسي في متصفح المستخدم."
    ],
    "points": 231,
    "commentCount": 270,
    "retryCount": 0,
    "time": 1728535138
  },
  {
    "id": 41793658,
    "title": "أنت لا تعرف شيئًا عن عرض النطاق الترددي",
    "originLink": "https://cacm.acm.org/practice/you-dont-know-jack-about-bandwidth/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41793658",
    "commentBody": "",
    "originSummary": [
      "يمكن لمزودي خدمات الإنترنت (ISPs) الذين يواجهون عدم رضا العملاء بسبب ضعف أداء الإنترنت معالجة مشكلة التأخير العالي، الذي غالبًا ما يكون ناتجًا عن برامج التوجيه القديمة، بدلاً من نقص النطاق الترددي. تُعرف المشكلة باسم \"التضخم المؤقت\" ويمكن التخفيف منها باستخدام حلول برمجية حديثة مثل LibreQoS، التي طورها مبتكرو fq_codel وCAKE، والتي تعزز تدفق البيانات وتقلل من التأخيرات. يتيح تنفيذ مثل هذه البرامج لمزودي خدمات الإنترنت تحسين البنية التحتية الحالية، مما يحسن جودة الخدمة ورضا العملاء دون الحاجة إلى استثمار إضافي في النطاق الترددي."
    ],
    "commentSummary": [
      "توضح المناقشة على ACM.org الالتباس الشائع بين عرض النطاق الترددي والكمون، خاصة في العمل عن بُعد، حيث تُعزى مشاكل مكالمات الفيديو غالبًا بشكل خاطئ إلى انخفاض عرض النطاق الترددي.",
      "تتطلب المنصات مثل Zoom نطاقًا تردديًا ضئيلًا (مثل 3 ميجابت في الثانية للفيديو بدقة 1080p)، لكن الكمون هو العامل الحقيقي الذي يؤثر على جودة الاتصال، كما يشارك المستخدمون الذين يعانون من مشاكل في أداء الإنترنت.",
      "تستكشف المحادثة أيضًا التحديات التي تواجهها مزودو خدمات الإنترنت (ISPs) في معالجة مشكلات التأخير وتقترح حلولًا محتملة مثل OpenWrt وLibreQoS لإدارة ازدحام الشبكة وتحسين تجربة المستخدم."
    ],
    "points": 203,
    "commentCount": 100,
    "retryCount": 0,
    "time": 1728514315
  },
  {
    "id": 41792055,
    "title": "خريطة حرارة رواتب مهندسي البرمجيات عبر الولايات المتحدة",
    "originLink": "https://levels.fyi/heatmap",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41792055",
    "commentBody": "",
    "originSummary": [
      "تتوفر خريطة حرارية تفاعلية تعرض نطاقات رواتب مهندسي البرمجيات في جميع أنحاء الولايات المتحدة، مصنفة حسب مناطق السوق المحددة (DMA).",
      "توفر خريطة الحرارة رؤى حول النسب المئوية للرواتب، وتفاصيل التعويضات الإجمالية، وتسلط الضوء على الشركات ذات الأجور الأعلى، حيث تتراوح الرواتب من 50,000 دولار إلى أكثر من 300,000 دولار.",
      "يُشجَّع المستخدمون على تقديم ملاحظاتهم حول الميزات الإضافية أو البيانات التي يرغبون في رؤيتها مضمنة في خريطة الحرارة."
    ],
    "commentSummary": [
      "تكشف خريطة حرارة رواتب مهندسي البرمجيات أن الرواتب في مدينة نيويورك أقل بشكل ملحوظ مقارنة بواشنطن الغربية ومنطقة خليج سان فرانسيسكو، مما يثير نقاشات حول التفاوتات الإقليمية في الرواتب.",
      "تظهر الانتقادات بشأن الخشونة في تفاصيل الخريطة، التي تجمع بين مناطق متنوعة، ودقة مجموعة البيانات بسبب محدودية البيانات والتحيزات المحتملة.",
      "تشمل الاقتراحات للتحسين استبعاد شركات FAANG (فيسبوك، أمازون، أبل، نتفليكس، جوجل) ودمج تعديلات تكلفة المعيشة للحصول على تمثيل أكثر دقة."
    ],
    "points": 202,
    "commentCount": 141,
    "retryCount": 0,
    "time": 1728504278
  },
  {
    "id": 41798477,
    "title": "تينو – ماركداون وجافا سكريبت = مزيج من وورد وإكسل",
    "originLink": "https://tenno.app",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41798477",
    "commentBody": "",
    "originSummary": [
      "Tenno هو تطبيق ويب مصمم لإنشاء مستندات Markdown مع خلايا حسابية، يجمع بين ميزات Word وExcel لبرمجة \"لترية\".",
      "التطبيق في مراحله الأولى ويسعى للحصول على ملاحظات المستخدمين حول الميزات المحتملة، مع توفر صفحة مستندات وأمثلة لعرض قدراته.",
      "تهدف Tenno إلى تبسيط تحليل البيانات وتصورها، مما يسمح بتعريف الوظائف، ورسم الأبعاد المتعددة، وإنشاء لوحات التحكم من خلال دمج البيانات من واجهات برمجة التطبيقات."
    ],
    "commentSummary": [
      "Tenno هو تطبيق ويب يدمج بين Markdown وJavaScript، مما يتيح للمستخدمين إنشاء مستندات تحتوي على خلايا حسابية، مشابهة لمزيج من Word وExcel. يستهدف التطبيق \"البرمجة الأدبية\" لتبسيط تحليل البيانات المعقدة والتصور، وهو حاليًا في مرحلة التطوير المبكرة، ويسعى للحصول على ملاحظات المستخدمين لتحسينه. يُقارن التطبيق بـ Jupyter وOrg mode، مع التركيز على سهولة الاستخدام والقدرة على المشاركة مع المستخدمين غير التقنيين، مع تحسينات محتملة في وظائف WYSIWYG، ودعم الجداول، والتنفيذ المحلي."
    ],
    "points": 185,
    "commentCount": 97,
    "retryCount": 0,
    "time": 1728566138
  },
  {
    "id": 41791773,
    "title": "آرائي السلبية حول لغة روست (2023)",
    "originLink": "https://chrisdone.com/posts/rust/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41791773",
    "commentBody": "",
    "originSummary": [
      "يعترف المؤلف بنقاط قوة لغة Rust، مثل الماكرو، وفئات الأنواع، ومطابقة الأنماط، لكنه يعبر عن مخاوفه بشأن تعقيدها وبعض الميزات مثل \"unsafe\" و\"panic\" التي يمكن أن تؤدي إلى أخطاء تجميع مربكة.",
      "يُبرز التركيز على تمثيل الذاكرة بكفاءة في لغة Rust وغياب بيئة تشغيل غير متزامنة مدمجة كعقبات، حيث يبدي المؤلف شكوكه حول استخدامها كلغة للأغراض العامة.",
      "على الرغم من الأدوات الممتازة التي يوفرها لغة Rust، فإن الكاتب حذر بشأن الاستثمار فيها للمشاريع الشخصية، على الرغم من أنهم قد يفكرون في استخدامها كبديل للغة C في التطبيقات ذات الخيط الواحد."
    ],
    "commentSummary": [
      "تتمحور المناقشة حول تعقيد لغة Rust، حيث يقارنها البعض بلغة C++ بينما يركز آخرون على ميزاتها في الاستقرار والأمان. تشمل المخاوف الرئيسية التعامل مع الذعر في Rust، وتحديات البرمجة غير المتزامنة، واستخدام الكود \"غير الآمن\" الذي يمكن أن يتجاوز ضمانات الأمان في Rust. على الرغم من الانتقادات، تُقدر Rust لأمان الذاكرة وتعتبر مفيدة بشكل خاص في تطبيقات مثل تطوير الألعاب، على الرغم من أنها معروفة بمنحنى تعلم حاد."
    ],
    "points": 181,
    "commentCount": 256,
    "retryCount": 0,
    "time": 1728502452
  },
  {
    "id": 41800602,
    "title": "DeskPad – شاشة افتراضية لمشاركة الشاشة",
    "originLink": "https://github.com/Stengo/DeskPad",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41800602",
    "commentBody": "",
    "originSummary": [
      "DeskPad هو تطبيق شاشة افتراضية مصمم لمشاركة الشاشة بشكل سلس في وضع ملء الشاشة، حيث يخلق عرضًا مرآتيًا داخل نافذة التطبيق لتسهيل المشاركة.",
      "تشمل خيارات التثبيت تنزيل الإصدار الأحدث أو استخدام Homebrew، وهو مدير حزم لنظام macOS، باستخدام الأمر 'brew install deskpad'.",
      "يعمل DeskPad مثل شاشة مادية، مما يسمح للمستخدمين بضبط دقة العرض في تفضيلات النظام، ويبرز شريط العنوان الخاص به باللون الأزرق عندما يتحرك المؤشر إلى العرض الافتراضي."
    ],
    "commentSummary": [
      "DeskPad هو أداة شاشة افتراضية لنظام MacOS X تسهل مشاركة الشاشة من خلال السماح للمستخدمين بمشاركة مناطق محددة من شاشتهم، وهو مفيد بشكل خاص للشاشات الكبيرة أو العريضة للغاية.",
      "يُشاد به لراحته، خاصة للمستخدمين الذين يحتاجون إلى مشاركة الشاشات أثناء السفر أو استخدام إعداد شاشة واحدة.",
      "بينما اقترح بعض المستخدمين إضافة مؤشرات لتسجيل الشاشة، يُعتبر الأداة بشكل عام حلاً قيمًا لاحتياجات مشاركة الشاشة."
    ],
    "points": 178,
    "commentCount": 24,
    "retryCount": 0,
    "time": 1728578214
  },
  {
    "id": 41796030,
    "title": "موزيلا تصلح ثغرة يوم الصفر في فايرفوكس التي تُستغل بنشاط في الهجمات",
    "originLink": "https://www.bleepingcomputer.com/news/security/mozilla-fixes-firefox-zero-day-actively-exploited-in-attacks/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41796030",
    "commentBody": "",
    "originSummary": [
      "أصدرت موزيلا تحديثًا طارئًا لمتصفح فايرفوكس لمعالجة ثغرة خطيرة من نوع استخدام بعد التحرير، تم تحديدها كـ CVE-2024-9680، والتي يتم استغلالها حاليًا. تقع الثغرة في جداول زمنية للرسوم المتحركة وتسمح للمهاجمين بتنفيذ تعليمات برمجية باستخدام ذاكرة محررة، مما يشكل خطرًا أمنيًا كبيرًا. يُنصح المستخدمون بشدة بتحديث المتصفح إلى فايرفوكس 131.0.2، فايرفوكس ESR 115.16.1، أو فايرفوكس ESR 128.3.1 للحماية من الهجمات المحتملة."
    ],
    "commentSummary": [
      "قامت موزيلا بمعالجة ثغرة يوم الصفر في فايرفوكس التي كانت تُستغل بنشاط، مما سمح للمهاجمين بتنفيذ التعليمات البرمجية من خلال خلل استخدام بعد التحرير في جداول زمنية للرسوم المتحركة. أثرت الثغرة على أحدث إصدارات فايرفوكس، بما في ذلك إصدارات الدعم الممتد (ESR)، مما دفع المستخدمين إلى التحديث إلى أحدث إصدار للحماية. يبرز هذا التصحيح أهمية تحديث البرامج بانتظام للحماية من التهديدات الأمنية المحتملة."
    ],
    "points": 174,
    "commentCount": 106,
    "retryCount": 0,
    "time": 1728540678
  },
  {
    "id": 41794566,
    "title": "كيف تجعل المنتج يهتم باقتراحك المعماري",
    "originLink": "https://gieseanw.wordpress.com/2024/10/09/how-to-make-product-give-a-shit-about-your-architecture-proposal/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41794566",
    "commentBody": "",
    "originSummary": [
      "عند اقتراح تغييرات في الهندسة المعمارية، قدمها كحزمة \"بلاتينية\" شاملة لمساعدة فرق المنتجات على فهم التعقيد والتفاوض بشأن النطاق والوقت.",
      "ركز على العائد على الاستثمار (ROI) والمخاطر المحتملة عند اقتراح أفكار جديدة، مع ضمان التوافق مع أهداف وأولويات الفريق.",
      "استخدم الوقت المتاح للعمل على تحسينات تعزز الجودة وتقدم حلولاً قيمة، مع التأكيد على التفاوض الفعال وتحديد الأولويات."
    ],
    "commentSummary": [],
    "points": 153,
    "commentCount": 136,
    "retryCount": 0,
    "time": 1728522789
  },
  {
    "id": 41792179,
    "title": "جيفري هينتون يقول إنه فخور بأن إيليا سوتسكيفر 'أقال سام ألتمان'",
    "originLink": "https://techcrunch.com/2024/10/09/after-winning-nobel-for-foundational-ai-work-geoffrey-hinton-says-hes-proud-ilya-sutskever-fired-sam-altman/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41792179",
    "commentBody": "",
    "originSummary": [
      "حصل جيفري هينتون، وهو شخصية بارزة في مجال الذكاء الاصطناعي، على جائزة نوبل لمساهماته في الشبكات العصبية الاصطناعية.",
      "في خطاب قبوله، أقر هينتون بإيليا سوتسكيفر، طالبه السابق، لتأثيره في إقالة الرئيس التنفيذي لشركة أوبن إيه آي، سام ألتمان، في عام 2023، وهو ما اعتبره انتصارًا لسلامة الذكاء الاصطناعي.",
      "على الرغم من الإقالة الأولية، استعاد سام ألتمان في النهاية المزيد من السيطرة على شركة أوبن إيه آي، مما يشير إلى الديناميكيات المستمرة في قيادة منظمات الذكاء الاصطناعي."
    ],
    "commentSummary": [
      "تعليق جيفري هينتون حول إقالة إيليا سوتسكيفر لسام ألتمان خلال خطابه لقبول جائزة نوبل أثار جدلاً على موقع Hacker News بشأن أهمية الخبر وطريقة تقديمه.",
      "تعكس المناقشة آراء متباينة، حيث يصف بعض المستخدمين المقالة بأنها مثيرة، بينما يقدر آخرون الرؤية المقدمة حول تعقيدات تنظيم المواضيع المثيرة للجدل."
    ],
    "points": 148,
    "commentCount": 7,
    "retryCount": 0,
    "time": 1728505128
  },
  {
    "id": 41791692,
    "title": "مؤتمر صحفي: البروفيسور جيفري هينتون، جائزة نوبل في الفيزياء 2024 [فيديو]",
    "originLink": "https://www.youtube.com/watch?v=H7DgMFqrON0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41791692",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "تمت مشاركة فيديو لمؤتمر صحفي للبروفيسور جيفري هينتون، الحائز على جائزة نوبل في الفيزياء لعام 2024، على يوتيوب، مما أدى إلى مناقشات حول التوازن بين الإثارة والمحتوى الجوهري.",
      "تم تعديل عنوان المقالة لتقليل الإثارة، مما أثار نقاشًا حول الفضول الفكري مقابل الرقابة.",
      "تضمنت المحادثات أيضًا مساهمات هينتون في الشبكات العصبية وتأثير قادة التكنولوجيا مثل سام ألتمان وإيلون ماسك."
    ],
    "points": 143,
    "commentCount": 17,
    "retryCount": 0,
    "time": 1728501966
  },
  {
    "id": 41791708,
    "title": "أدوات سطر الأوامر التي أحبها (2022)",
    "originLink": "https://rwblickhan.org/newsletters/command-line-tools-i-like-2022/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41791708",
    "commentBody": "",
    "originSummary": [
      "تسلط المشاركة الضوء على أدوات سطر الأوامر الحديثة، التي كُتبت العديد منها بلغة Rust، والتي تعزز الكفاءة وسهولة الاستخدام للمطورين، وخصوصًا لمطوري iOS.",
      "تشمل الأدوات المميزة Neovim لتحرير النصوص المتقدم، وfzf للبحث الغامض، وbat لعرض الملفات مع تمييز الصيغة، وexa لعرض الدلائل بالألوان.",
      "تشمل الأدوات البارزة الأخرى ripgrep للبحث السريع في محتوى الملفات، وfd للبحث عن أسماء الملفات، وdelta لتحسين عرض اختلافات git، وtldr للمساعدة المختصرة في الأوامر، وzoxide للتنقل الذكي بين الدلائل، وHTTPie لطلبات HTTP سهلة الاستخدام."
    ],
    "commentSummary": [
      "يوفر Terminal Trove مجموعة من أدوات سطر الأوامر مع أدلة تثبيت بسيطة، تلبي احتياجات المستخدمين المختلفة. تشمل الأدوات الشهيرة التي تم مناقشتها Pillager لفحوصات الأمان، وEternal Terminal للاتصالات المستقرة، وjq لاستعلامات JSON، مع ذكر بدائل مثل jless وeza. أعرب المستخدمون عن مخاوفهم بشأن تبعيات التثبيت والعملية العملية لاستخدام أدوات واجهة سطر الأوامر غير القياسية عبر الأنظمة المختلفة."
    ],
    "points": 136,
    "commentCount": 64,
    "retryCount": 0,
    "time": 1728502051
  }
]
