[
  {
    "id": 41792500,
    "title": "Internet Archive: Alerta de violação de segurança",
    "originLink": "https://www.theverge.com/2024/10/9/24266419/internet-archive-ddos-attack-pop-up-message",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41792500",
    "commentBody": "",
    "originSummary": [
      "O Internet Archive sofreu uma violação de segurança, comprometendo informações de 31 milhões de contas, incluindo endereços de e-mail e outros dados.",
      "O vazamento foi confirmado pelo Have I Been Pwned? (HIBP), com 54% das contas afetadas já presentes em seu banco de dados de incidentes anteriores.",
      "Além da violação, o Internet Archive enfrentou um ataque de Negação de Serviço Distribuída (DDoS), levando a interrupções de serviço, e agora está trabalhando na atualização de suas medidas de segurança."
    ],
    "commentSummary": [
      "O Internet Archive sofreu uma violação de segurança, expondo 31 milhões de registros, incluindo endereços de e-mail dos usuários, que estavam publicamente disponíveis nos metadados sem o conhecimento dos mesmos. Este incidente destaca preocupações sobre a privacidade dos e-mails, com discussões sobre se os endereços de e-mail devem ser tratados como informações privadas, assim como números de telefone ou endereços residenciais. A violação agora está listada no banco de dados Have I Been Pwned, e os usuários são aconselhados a usar endereços de e-mail exclusivos para cada serviço e considerar o uso de alias de e-mail para maior privacidade e redução de spam."
    ],
    "points": 1009,
    "commentCount": 545,
    "retryCount": 0,
    "time": 1728507266
  },
  {
    "id": 41797719,
    "title": "Ajuda para wikis se afastarem do Fandom",
    "originLink": "https://weirdgloop.org/blog/why-were-helping-more-wikis-move-away-from-fandom",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41797719",
    "commentBody": "",
    "originSummary": [
      "Weird Gloop está agora hospedando o Wiki oficial de League of Legends, fazendo a transição do Fandom para promover wikis mais voltadas para a comunidade e amigáveis aos desenvolvedores.",
      "Esta medida aborda problemas com o Fandom, como a retenção de versões desatualizadas de wikis, e se beneficia do aumento do suporte do Google para wikis independentes, o que ajuda a recuperar o tráfego.",
      "A transição pode potencialmente dobrar o número de colaboradores e permitir projetos técnicos personalizados, com a Weird Gloop fornecendo orientação para aqueles interessados em mover suas wikis do Fandom."
    ],
    "commentSummary": [
      "Weird Gloop está ajudando wikis a se afastarem do Fandom, que é criticado por anúncios intrusivos e uma experiência de usuário ruim. A mudança do Minecraft Wiki para o Weird Gloop exemplifica uma transição bem-sucedida para uma plataforma mais econômica e amigável. Essa mudança reflete uma tendência mais ampla de comunidades buscando alternativas ao Fandom, que é visto como priorizando o lucro em detrimento da experiência do usuário."
    ],
    "points": 675,
    "commentCount": 314,
    "retryCount": 0,
    "time": 1728559313
  },
  {
    "id": 41793597,
    "title": "Por que o componente 'Exit this Page' do Gov.uk não usa a tecla Escape",
    "originLink": "https://beeps.website/blog/2024-10-09-why-govuk-exit-this-page-doesnt-use-escape/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41793597",
    "commentBody": "",
    "originSummary": [
      "GOV.UK's \"Exit this Page\" component evita o uso da tecla Escape devido ao seu potencial de interromper o carregamento da página e seu uso em outras funções do sistema operacional. A tecla Shift é usada em vez disso para redirecionamento em JavaScript, pois oferece uma funcionalidade mais consistente, apesar de suas limitações. O componente redireciona os usuários para o BBC Weather para garantir uma página neutra e rica em conteúdo, ajudando os usuários a sair rapidamente de uma página em situações potencialmente perigosas, como abuso doméstico."
    ],
    "commentSummary": [
      "Para evitar interromper o carregamento da página, o recurso 'Sair desta Página' do Gov.uk evita o uso da tecla Escape, optando por pressionar a tecla Shift três vezes.",
      "Críticos argumentam que o recurso é excessivamente complexo e não é amigável ao usuário, sugerindo alternativas mais simples, como ensinar os usuários a fechar abas com atalhos de teclado.",
      "A funcionalidade é destinada a situações de alto estresse, como abuso doméstico, para ocultar rapidamente a atividade de navegação, mas sua eficácia e capacidade de ser descoberta estão sob escrutínio."
    ],
    "points": 356,
    "commentCount": 215,
    "retryCount": 0,
    "time": 1728513926
  },
  {
    "id": 41795218,
    "title": "Empresário, industrial e filantropo indiano, Ratan Tata, morre aos 86 anos",
    "originLink": "https://en.wikipedia.org/wiki/Ratan_Tata",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41795218",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [],
    "points": 346,
    "commentCount": 118,
    "retryCount": 0,
    "time": 1728530957
  },
  {
    "id": 41795561,
    "title": "WASM é o novo CGI",
    "originLink": "https://roborooter.com/post/wasm-is-the-new-cgi/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41795561",
    "commentBody": "",
    "originSummary": [
      "WebAssembly (Wasm) está revolucionando as aplicações web ao oferecer sites interativos de alto desempenho e de fácil manutenção, superando o modelo tradicional de CGI.",
      "Wasm permite a execução de código tanto em navegadores quanto em servidores, oferecendo um modelo de isolamento leve para código não confiável e suportando várias linguagens de programação.",
      "Apesar de algumas compensações, como encadeamento limitado e compilação JIT (Just-In-Time), as vantagens de desempenho e segurança do Wasm fazem dele uma tecnologia promissora para o futuro do desenvolvimento web, potencialmente transformando as restrições do desenvolvimento web e possibilitando novas oportunidades."
    ],
    "commentSummary": [
      "WebAssembly (WASM) está sendo comparado a tecnologias mais antigas como Java Applets e Flash, mas oferece segurança aprimorada, eficiência e opera como um padrão aberto. Ao contrário de seus predecessores, o WASM roda dentro do sandbox do navegador, permitindo que execute código em várias linguagens de forma segura e eficiente, não se limitando ao JavaScript. A versatilidade e segurança do WASM fazem dele uma tecnologia promissora tanto para aplicações do lado do cliente quanto do servidor, com potencial para aplicações locais que reduzem a dependência do servidor ao rodar principalmente no navegador do usuário."
    ],
    "points": 231,
    "commentCount": 270,
    "retryCount": 0,
    "time": 1728535138
  },
  {
    "id": 41793658,
    "title": "Você não sabe nada sobre largura de banda",
    "originLink": "https://cacm.acm.org/practice/you-dont-know-jack-about-bandwidth/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41793658",
    "commentBody": "",
    "originSummary": [
      "Os provedores de serviços de Internet (ISPs) que enfrentam insatisfação dos clientes devido ao fraco desempenho da Internet podem resolver o problema de alta latência, muitas vezes causado por software de roteador desatualizado, em vez de largura de banda insuficiente. O problema, conhecido como bufferbloat, pode ser mitigado usando soluções de software modernas como o LibreQoS, desenvolvido pelos criadores do fq_codel e CAKE, que melhoram o fluxo de dados e reduzem atrasos. Implementar esse tipo de software permite que os ISPs otimizem sua infraestrutura atual, melhorando a qualidade do serviço e a satisfação do cliente sem a necessidade de investimento adicional em largura de banda."
    ],
    "commentSummary": [
      "A discussão no ACM.org esclarece a confusão comum entre largura de banda e latência, especialmente no trabalho remoto, onde problemas em chamadas de vídeo são frequentemente atribuídos erroneamente à baixa largura de banda.",
      "Plataformas como o Zoom requerem largura de banda mínima (por exemplo, 3 Mbps para vídeo em 1080p), mas a latência é o verdadeiro fator que afeta a qualidade da conexão, conforme compartilhado por usuários que enfrentam problemas de desempenho na internet.",
      "A conversa também explora os desafios enfrentados pelos Provedores de Serviços de Internet (ISPs) ao lidar com problemas de latência e sugere soluções potenciais como OpenWrt e LibreQoS para gerenciar a congestão da rede e melhorar a experiência do usuário."
    ],
    "points": 203,
    "commentCount": 100,
    "retryCount": 0,
    "time": 1728514315
  },
  {
    "id": 41792055,
    "title": "Mapa de Calor de Salários de Engenheiros de Software nos EUA",
    "originLink": "https://levels.fyi/heatmap",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41792055",
    "commentBody": "",
    "originSummary": [
      "Um mapa de calor interativo está disponível, mostrando as faixas salariais de engenheiros de software nos EUA, categorizadas por regiões de Área de Mercado Designada (DMA).",
      "A matriz de calor fornece insights sobre percentis salariais, detalhes de compensação total e destaca as empresas que pagam melhor, com salários variando de $50.000 a mais de $300.000.",
      "Os usuários são incentivados a fornecer feedback sobre recursos adicionais ou dados que gostariam de ver incluídos no mapa de calor."
    ],
    "commentSummary": [
      "A análise de salários de engenheiros de software revela que os salários em Nova York são notavelmente mais baixos em comparação com o Oeste de Washington e a Área da Baía, gerando discussões sobre disparidades salariais regionais.",
      "Críticas surgem em relação à granularidade grosseira do mapa, que agrupa áreas diversas, e à precisão do conjunto de dados devido a dados limitados e possíveis vieses.",
      "Algumas sugestões de melhoria incluem excluir as empresas FAANG (Facebook, Amazon, Apple, Netflix, Google) e incorporar ajustes no custo de vida para uma representação mais precisa."
    ],
    "points": 202,
    "commentCount": 141,
    "retryCount": 0,
    "time": 1728504278
  },
  {
    "id": 41798477,
    "title": "Tenno – Markdown e JavaScript = um híbrido de Word e Excel",
    "originLink": "https://tenno.app",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41798477",
    "commentBody": "",
    "originSummary": [
      "Tenno é uma aplicação web projetada para criar documentos em Markdown com células computacionais, combinando recursos do Word e do Excel para 'programação literária'.",
      "A aplicação está em seus estágios iniciais e está buscando feedback dos usuários sobre possíveis funcionalidades, com uma página de Documentos e exemplos disponível para demonstrar suas capacidades.",
      "Tenno visa simplificar a análise e visualização de dados, permitindo definições de funções, plotagem multidimensional e criação de painéis ao integrar dados de APIs."
    ],
    "commentSummary": [
      "Tenno é uma aplicação web que integra Markdown e JavaScript, permitindo aos usuários criar documentos com células computacionais, semelhante a uma mistura de Word e Excel. Ela tem como alvo a \"programação literária\" para simplificar a análise e visualização de dados complexos, e está atualmente em sua fase inicial de desenvolvimento, buscando feedback dos usuários para melhorias. O aplicativo é comparado ao Jupyter e ao modo Org, enfatizando a facilidade de uso e a capacidade de compartilhamento com usuários não técnicos, com potenciais melhorias na funcionalidade WYSIWYG, suporte a tabelas e execução local."
    ],
    "points": 185,
    "commentCount": 97,
    "retryCount": 0,
    "time": 1728566138
  },
  {
    "id": 41791773,
    "title": "Minhas opiniões negativas sobre Rust (2023)",
    "originLink": "https://chrisdone.com/posts/rust/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41791773",
    "commentBody": "",
    "originSummary": [
      "O autor reconhece as forças do Rust, como macros, classes de tipo e correspondência de padrões, mas expressa preocupações sobre sua complexidade e certos recursos como 'unsafe' e 'panic' que podem levar a erros de compilação confusos.",
      "Rust é destacado por seu foco na representação eficiente de memória e pela ausência de um runtime assíncrono embutido como desafios, com o autor cético quanto ao seu uso como uma linguagem de propósito geral.",
      "Apesar das excelentes ferramentas do Rust, o autor está cauteloso em investir nele para projetos pessoais, embora possa considerá-lo para substituições de C em thread único."
    ],
    "commentSummary": [
      "O debate gira em torno da complexidade do Rust, com alguns comparando-o ao C++ e outros destacando suas características de estabilidade e segurança. - As principais preocupações incluem o tratamento de pânico do Rust, desafios de programação assíncrona e o uso de código 'unsafe', que pode contornar as garantias de segurança do Rust. - Apesar das críticas, o Rust é valorizado por sua segurança de memória e é particularmente benéfico em aplicações como desenvolvimento de jogos, embora seja notado por ter uma curva de aprendizado acentuada."
    ],
    "points": 181,
    "commentCount": 256,
    "retryCount": 0,
    "time": 1728502452
  },
  {
    "id": 41800602,
    "title": "DeskPad – Um monitor virtual para compartilhamento de tela",
    "originLink": "https://github.com/Stengo/DeskPad",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41800602",
    "commentBody": "",
    "originSummary": [
      "DeskPad é um aplicativo de monitor virtual projetado para compartilhamento de tela em tela cheia de forma contínua, criando uma exibição espelhada dentro de sua janela de aplicativo para fácil compartilhamento.",
      "Opções de instalação incluem baixar a versão mais recente ou usar o Homebrew, um gerenciador de pacotes para macOS, com o comando 'brew install deskpad'.",
      "DeskPad opera como um monitor físico, permitindo que os usuários ajustem a resolução da tela nas preferências do sistema, e destaca sua barra de título em azul quando o cursor se move para a tela virtual."
    ],
    "commentSummary": [
      "DeskPad é uma ferramenta de monitor virtual para MacOS X que facilita o compartilhamento de tela, permitindo que os usuários compartilhem áreas específicas de sua tela, sendo particularmente benéfico para monitores grandes ou ultrawide.",
      "É elogiado por sua conveniência, especialmente para usuários que precisam compartilhar telas enquanto viajam ou usam uma configuração de monitor único.",
      "Embora alguns usuários tenham sugerido a adição de indicadores de gravação de tela, a ferramenta é geralmente considerada uma solução valiosa para necessidades de compartilhamento de tela."
    ],
    "points": 178,
    "commentCount": 24,
    "retryCount": 0,
    "time": 1728578214
  },
  {
    "id": 41796030,
    "title": "Mozilla corrige falha zero-day no Firefox ativamente explorada em ataques",
    "originLink": "https://www.bleepingcomputer.com/news/security/mozilla-fixes-firefox-zero-day-actively-exploited-in-attacks/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41796030",
    "commentBody": "",
    "originSummary": [
      "Mozila emitiu uma atualização de emergência para o Firefox para resolver uma vulnerabilidade crítica de uso após liberação, identificada como CVE-2024-9680, que está sendo explorada atualmente. A vulnerabilidade está localizada nas linhas do tempo de Animação e permite que atacantes executem código usando memória liberada, representando um risco significativo de segurança. Recomenda-se fortemente que os usuários atualizem para o Firefox 131.0.2, Firefox ESR 115.16.1 ou Firefox ESR 128.3.1 para se protegerem contra possíveis ataques."
    ],
    "commentSummary": [
      "Mozilla resolveu uma vulnerabilidade de dia zero no Firefox que estava sendo explorada ativamente, permitindo que atacantes executassem código através de uma falha de uso após liberação em cronogramas de Animação. A vulnerabilidade afetou as versões mais recentes do Firefox, incluindo as versões de suporte estendido (ESR), levando os usuários a atualizarem para a versão mais recente para proteção. Este patch destaca a importância de atualizar regularmente o software para se proteger contra potenciais ameaças de segurança."
    ],
    "points": 174,
    "commentCount": 106,
    "retryCount": 0,
    "time": 1728540678
  },
  {
    "id": 41794566,
    "title": "Como fazer o Produto se importar com sua proposta de arquitetura",
    "originLink": "https://gieseanw.wordpress.com/2024/10/09/how-to-make-product-give-a-shit-about-your-architecture-proposal/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41794566",
    "commentBody": "",
    "originSummary": [
      "Quando propor mudanças na arquitetura, apresente-as como um abrangente 'pacote platina' para ajudar as equipes de produto a entender a complexidade e negociar o escopo e o tempo.",
      "Concentre-se no Retorno sobre o Investimento (ROI) e nos riscos potenciais ao sugerir novas ideias, garantindo o alinhamento com as metas e prioridades da equipe.",
      "Use o tempo disponível para trabalhar em melhorias que aumentem a qualidade e entreguem soluções valiosas, enfatizando a negociação eficaz e a priorização."
    ],
    "commentSummary": [],
    "points": 153,
    "commentCount": 136,
    "retryCount": 0,
    "time": 1728522789
  },
  {
    "id": 41792179,
    "title": "Geoffrey Hinton diz que está orgulhoso de Ilya Sutskever por 'demitir Sam Altman'",
    "originLink": "https://techcrunch.com/2024/10/09/after-winning-nobel-for-foundational-ai-work-geoffrey-hinton-says-hes-proud-ilya-sutskever-fired-sam-altman/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41792179",
    "commentBody": "",
    "originSummary": [
      "Geoffrey Hinton, uma figura proeminente na inteligência artificial, foi agraciado com o Prêmio Nobel por suas contribuições às redes neurais artificiais.",
      "Em seu discurso de aceitação, Hinton reconheceu Ilya Sutskever, seu ex-aluno, por influenciar a demissão do CEO da OpenAI, Sam Altman, em 2023, o que ele considerou uma vitória para a segurança da IA.",
      "Apesar da demissão inicial, Sam Altman eventualmente recuperou mais controle sobre a OpenAI, indicando dinâmicas contínuas na liderança das organizações de IA."
    ],
    "commentSummary": [
      "Comentário de Geoffrey Hinton sobre Ilya Sutskever demitindo Sam Altman durante seu discurso de aceitação do Nobel gerou debate no Hacker News sobre a relevância e apresentação da notícia.",
      "A discussão reflete opiniões divergentes, com alguns usuários rotulando o artigo como sensacionalista, enquanto outros valorizam a percepção sobre as complexidades de moderar tópicos controversos."
    ],
    "points": 148,
    "commentCount": 7,
    "retryCount": 0,
    "time": 1728505128
  },
  {
    "id": 41791692,
    "title": "Conferência de Imprensa: Professor Geoffrey Hinton, Prêmio Nobel de Física 2024 [vídeo]",
    "originLink": "https://www.youtube.com/watch?v=H7DgMFqrON0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41791692",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "A gravação de uma coletiva de imprensa do Professor Geoffrey Hinton, vencedor do Prêmio Nobel de Física de 2024, foi compartilhada no YouTube, levando a discussões sobre o equilíbrio entre sensacionalismo e conteúdo substancial.",
      "O título do artigo foi alterado para reduzir o sensacionalismo, provocando um debate sobre curiosidade intelectual versus censura.",
      "Conversas também incluíram as contribuições de Hinton para redes neurais e a influência de líderes de tecnologia como Sam Altman e Elon Musk."
    ],
    "points": 143,
    "commentCount": 17,
    "retryCount": 0,
    "time": 1728501966
  },
  {
    "id": 41791708,
    "title": "Ferramentas de Linha de Comando que Eu Gosto (2022)",
    "originLink": "https://rwblickhan.org/newsletters/command-line-tools-i-like-2022/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41791708",
    "commentBody": "",
    "originSummary": [
      "O post destaca ferramentas modernas de linha de comando, muitas escritas em Rust, que aumentam a eficiência e a usabilidade para desenvolvedores, especialmente desenvolvedores iOS.",
      "Ferramentas em destaque incluem Neovim para edição avançada de texto, fzf para busca aproximada, bat para visualização de arquivos com destaque de sintaxe e exa para listagem de diretórios colorida.",
      "Outras ferramentas notáveis são ripgrep para busca rápida de conteúdo de arquivos, fd para busca de nomes de arquivos, delta para visualização aprimorada de diferenças no git, tldr para ajuda concisa de comandos, zoxide para navegação mais inteligente em diretórios e HTTPie para requisições HTTP amigáveis ao usuário."
    ],
    "commentSummary": [
      "Terminal Trove oferece uma coleção de ferramentas de linha de comando com guias de instalação simples, atendendo a várias necessidades dos usuários. - As ferramentas populares discutidas incluem Pillager para verificações de segurança, Eternal Terminal para conexões estáveis e jq para consultas JSON, com alternativas como jless e eza também mencionadas. - Os usuários expressaram preocupações sobre dependências de instalação e a praticidade de usar ferramentas de interface de linha de comando (CLI) não padrão em diferentes sistemas."
    ],
    "points": 136,
    "commentCount": 64,
    "retryCount": 0,
    "time": 1728502051
  }
]
