[
  {
    "id": 38252566,
    "title": "בניית חיישן תפוסה לספריית קמפוס באמצעות ESP32 ו-DB ללא שרת",
    "originLink": "https://matthew.science/posts/occupancy/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38252566",
    "commentBody": "",
    "originSummary": [
      "המחבר חולק את ניסיונו בבניית חיישן תפוסה באמצעות ESP32 ומסד נתונים ללא שרתים.",
      "הם פרסו בהצלחה את המערכת בספריית קמפוס לאחר שהתגברו על מספר אתגרים.",
      "המחבר גם יצר hashset קטן עבור מכשירי סריקה ואיסוף נתונים על תנועת התלמידים.",
      "מוזכרות תוכניות עתידיות לפרויקט, ומסופקים מקורות הקשורים לאיתור תפוסה ויישומי IoT."
    ],
    "commentSummary": [
      "המאמר דן במספר נושאים, כולל חיישני אכלוס בבניין, יצירת מארזי פרויקטים אלקטרוניים ועיצוב מכשירי IoT באמצעות שבב ESP32.",
      "זה גם מכסה עבודה עם טכנולוגיית Bluetooth, פיתוח מיקרו-בקרים בעלות נמוכה ומעקב אחר תנועה ותפוסה באמצעות Bluetooth.",
      "הדיונים בוחנים שיטות, אתגרים ופתרונות שונים לכל נושא, ומציגים את האופי המתפתח ואת היישומים הפוטנציאליים של טכנולוגיות אלה."
    ],
    "points": 545,
    "commentCount": 179,
    "retryCount": 0,
    "time": 1699895834
  },
  {
    "id": 38256810,
    "title": "נפאל מחרימה את השימוש בטיקטוק בשל הפרעה להרמוניה החברתית",
    "originLink": "https://apnews.com/article/nepal-tiktok-ban-social-media-854846a42ef566fa296ddaacd0099447",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38256810",
    "commentBody": "",
    "originSummary": [
      "ממשלת נפאל אסרה על טיקטוק בשל חשש משיבוש חברתי והפצת חומרים מגונים.",
      "הממשלה מבקשת מפלטפורמות המדיה החברתית להירשם, להקים משרד קישור בנפאל, לשלם מיסים ולציית לחוקים ולתקנות של המדינה.",
      "הסיבה לאיסור והאם טיקטוק סירבה להיענות לבקשות נפאל עדיין לא ברורה. טיקטוק, שבבעלות ByteDance בסין, התמודדה עם ביקורת דומה במדינות אחרות בנוגע לפרטיות מידע והשפעה סינית פוטנציאלית."
    ],
    "commentSummary": [
      "נפאל חסמה את טיקטוק בשל חששות לגבי השפעתה על הרמוניה חברתית, מה שעורר דיונים על מיתון תוכן, התמכרות והשפעת פלטפורמות מדיה חברתית.",
      "האיסור עורר שיחות על ההשלכות הפוליטיות של אפליקציות סיניות והמניפולציה הפוטנציאלית של דעת הקהל, כמו גם נושאים רחבים יותר כמו תרבות הביטול, ערכים מערביים עכשוויים ועמדות חברתיות כלפי מיניות.",
      "המגיבים מעלים שאלות לגבי השליטה וההשפעה של סין על טיקטוק, לצד חששות לגבי פרטיות נתונים והשפעת ישויות זרות על פלטפורמות המדיה החברתית. כמו כן נדונים כוחם והשפעתם של תאגידים רב-לאומיים ואתגרי הרגולציה העצמית וההתמכרות."
    ],
    "points": 435,
    "commentCount": 246,
    "retryCount": 0,
    "time": 1699918374
  },
  {
    "id": 38251330,
    "title": "רכיבי אינטרנט לעומת React: מתן עדיפות לשיפור על פני החלפה",
    "originLink": "https://blog.jim-nielsen.com/2023/html-web-components/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38251330",
    "commentBody": "",
    "originSummary": [
      "המחבר משווה את רכיבי React לרכיבי אינטרנט, ומדגיש כי רכיבי האינטרנט מתעדפים שיפור ולא החלפה.",
      "רכיבי אינטרנט יכולים לעבד לפני JavaScript, בניגוד לרכיבי React, ולהדגיש קומפוזביליות עם HTML קיים.",
      "המחבר מציע כי הגדלה ושיפור של HTML קיים היא הגישה הטובה ביותר לפיתוח אתרים לטווח ארוך, ומציין כי React מתפתחת לקראת הרכב רכיבים דמוי HTML יותר."
    ],
    "commentSummary": [
      "המאמר משווה את השימוש ברכיבי אינטרנט HTML למסגרות כמו Vue, React ו- Angular, ודן במגבלות וביתרונות שלהם.",
      "שיקולים כגון ביצועים, זמינות עובדים, ביקורת, תאימות נגישות והתפתחויות עתידיות בפיתוח אינטרנט נבדקים.",
      "הדיון מדגיש דעות שונות על היעילות והשימושיות של רכיבי אינטרנט ומסגרות, נוגע בנושאים כמו גמישות, התאמה אישית, נוחות ומערכת אקולוגית."
    ],
    "points": 400,
    "commentCount": 206,
    "retryCount": 0,
    "time": 1699889503
  },
  {
    "id": 38251957,
    "title": "פריצה לגוגל בארד: ניצול הזרקה מהירה לחילוץ נתונים",
    "originLink": "https://embracethered.com/blog/posts/2023/google-bard-data-exfiltration/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38251957",
    "commentBody": "",
    "originSummary": [
      "Google Bard עודכן כדי לאפשר גישה ליוטיוב, לחיפושי טיסות ומלונות, למסמכים אישיים ולמיילים, מה שהופך אותו לפגיע להתקפות הזרקה עקיפות ומהירות.",
      "המחבר הדגים כיצד הזרקה מהירה עובדת באמצעות סרטוני YouTube ו- Google Docs וגילה חולשה ב- Bard המאפשרת עיבוד תמונה באמצעות הזרקת markdown.",
      "הפגיעות דווחה לגוגל ותוקנה, תוך הדגשת כוחו של יריב במתקפת הזרקה מהירה עקיפה. טבעו המדויק של התיקון אינו ידוע."
    ],
    "commentSummary": [
      "הדיון מתמקד בפגיעויות ובסיכונים הפוטנציאליים הקשורים למודלי שפה כמו Google Bard.",
      "מועלים חששות לגבי התקפות הזרקה מיידיות, הנדסה מהירה והיעדר ניפוי באגים.",
      "מוזכרות הצעות לשיפור יכולות המערכת ולשילוב הנחיות נסתרות."
    ],
    "points": 374,
    "commentCount": 138,
    "retryCount": 0,
    "time": 1699892526
  },
  {
    "id": 38257094,
    "title": "עתיד הקידוד: אימוץ בינה מלאכותית והתפתחות מערכי מיומנויות",
    "originLink": "https://www.newyorker.com/magazine/2023/11/20/a-coder-considers-the-waning-days-of-the-craft",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38257094",
    "commentBody": "",
    "originSummary": [
      "המחבר חולק את המסע האישי שלהם עם קידוד ואת התפיסה המשתנה שלהם על טכנולוגיית AI.",
      "הם מטילים ספק ברלוונטיות של כישורי קידוד מסורתיים ומהרהרים בעתיד המקצוע.",
      "המחבר מדגיש את חשיבות הסבלנות, ההתמדה והצורך לחקור טכנולוגיות חדשות בתכנות."
    ],
    "commentSummary": [
      "למודלים של שפת בינה מלאכותית כמו ChatGPT יש מגבלות בכל הנוגע למשימות קידוד, מה שמעלה חששות לגבי האיכות והדיוק של קוד שנוצר על ידי בינה מלאכותית.",
      "יש ויכוח על התפקיד העתידי של AI בתעשיית פיתוח התוכנה ואת הסיכונים הפוטנציאליים של הסתמכות אך ורק על AI עבור קידוד.",
      "השפעת הבינה המלאכותית על עבודות תכנות וחשיבות המומחיות האנושית בתחום הם נושאים בעלי דעות שונות."
    ],
    "points": 340,
    "commentCount": 569,
    "retryCount": 0,
    "time": 1699920525
  },
  {
    "id": 38249214,
    "title": "Canva מציגה את Shape Assist: שיפור צורות מצוירות ביד באמצעות למידת מכונה",
    "originLink": "https://www.canva.dev/blog/engineering/ship-shape/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38249214",
    "commentBody": "",
    "originSummary": [
      "Canva הציגה את Shape Assist, תכונה חדשה המשתמשת בלמידת מכונה כדי לזהות ולשפר צורות שצוירו ביד בזמן אמת בתוך הדפדפן.",
      "התכונה משפרת את השימושיות והתגובה, וניתן להשתמש בה במצב לא מקוון.",
      "Canva אימן רשת עצבית חוזרת על מערך נתונים מגוון של צורות שצוירו על-ידי המשתמש ופרס את המודל בדפדפן, ובכך ביטל את הצורך בעיבוד מבוסס שרת. המודל מזהה צורות במדויק ומיישר אותן עם גרפיקה וקטורית בגישה של התאמת תבניות."
    ],
    "commentSummary": [
      "Canva הציגה תכונה חדשה הממירה צורות מצוירות ביד לעיצובים מלוטשים.",
      "למידת מכונה מנוצלת ביישומי ציור כדי לשפר את חוויית המשתמש והפרודוקטיביות.",
      "TSMC משתמשת בלייזרים בתהליך EUV שלה, אך מתמודדת עם אתגרים באופטימיזציה של תהליכים עם אורכי גל מעורבים."
    ],
    "points": 304,
    "commentCount": 79,
    "retryCount": 0,
    "time": 1699876260
  },
  {
    "id": 38250913,
    "title": "סינת'ים Ferrofluid מדהימים: אוהבים את השילוב המהפנט של Black Goo של הולטן בכלים מותאמים אישית",
    "originLink": "https://cdm.link/2023/11/black-goo-ferrofluid-synths/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38250913",
    "commentBody": "",
    "originSummary": [
      "מעצב כלי הנגינה לאב הולטן יצר סינת'ים מדהימים המשלבים נוזלים פרופלואידים, והתוצאה היא ויזואליה מהפנטת של גוו שחור רוקד בתגובה לסאונד.",
      "יצירותיו של לאב הולטן כוללות מינילוג XD של KORG ו-Twisted Electronics Deton8 שהפך לסינטיסייזר תופים באנימציה פרו-נוזלית.",
      "Love Hultén מציעה גם כלים ייחודיים אחרים בהתאמה אישית, כגון Chunky Mother-32, המשלב ציוד מוג ורולנד עם מיטת מפתח נשלפת, וחוזה עתיד שבו הכל הופך לסרטנים, כפי שניתן לראות בקונספט סרטני MIDI שלהם."
    ],
    "commentSummary": [
      "Love Hultén יצרה סינתיסייזרים פרופלואידים המשלבים צליל וויזואליה באמצעות אלקטרומגנטים ונוזלי פרו.",
      "המאמר בוחן את ההיסטוריה, היישומים והמגבלות של סינת'ים אלה, תוך שימת דגש על אומנותם ועיצובם החדשני.",
      "הוא דן גם בסוגים שונים של סינתיסייזרים, במחירים שלהם, בבניית סינת'ים מודולריים מותאמים אישית, באפשרויות תוכנה חופשית ובשימוש בנוזל פרו כדי להמחיש צורות גל."
    ],
    "points": 254,
    "commentCount": 55,
    "retryCount": 0,
    "time": 1699887671
  },
  {
    "id": 38254656,
    "title": "אישור מחדש של מעקב המוני: קשירתו למימון הממשלה מדאיגה",
    "originLink": "https://www.eff.org/deeplinks/2023/11/reauthorizing-mass-surveillance-shouldnt-be-tied-funding-government",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38254656",
    "commentBody": "",
    "originSummary": [
      "סעיף 702, רשות שנויה במחלוקת למעקב המונים, אמור לפוג בדצמבר אם הקונגרס לא יחדש אותו.",
      "יש התנגדות לשילוב רפורמות אמיתיות בחוק, עם דחיפה לקשור את החידוש למימון הממשלה.",
      "התוכנית מאפשרת איסוף תקשורת בין אמריקאים לזרים ללא צו, מה שמעלה חששות לפרטיות. ארגונים רבים מתנגדים לחידוש במתכונתו הנוכחית ותומכים ברפורמות נרחבות. קואליציה של ארגוני זכויות אזרח הציגה את חוק רפורמת המעקב הממשלתית כחלופה. חידוש צריך להתרחש רק עם רפורמות משמעותיות ולא כתוספת של הרגע האחרון לחוק חובה."
    ],
    "commentSummary": [
      "המאמר בוחן את הקשר בין אישור מחדש של מעקב המוני לבין מימון ממשלתי.",
      "סלבריטאים כמו טיילור סוויפט וקניה ווסט סופגים ביקורת על כך שהם מעדיפים פעילות צדקה על פני תמיכה בשינוי מדיניות.",
      "סלבריטאים נמנעים לעתים קרובות מנקיטת עמדה בנושאים פוליטיים מחשש לתגובת נגד, ומגבילים את יכולתם לחולל שינוי."
    ],
    "points": 231,
    "commentCount": 51,
    "retryCount": 0,
    "time": 1699905896
  },
  {
    "id": 38248900,
    "title": "Loro: הצגת ספריית CRDT בקוד פתוח לניהול וסנכרון מצבים יעילים",
    "originLink": "https://www.loro.dev/blog/loro-now-open-source",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38248900",
    "commentBody": "",
    "originSummary": [
      "Loro היא ספריית קוד פתוח חדשה המטפלת בסוגי נתונים משוכפלים ללא התנגשויות (CRDT) לניהול וסנכרון מצבים בעלי ביצועים גבוהים בפיתוח תוכנה מקומי תחילה.",
      "CRDT מפשטים את הניהול והסינכרון של מצבים ותואמים לניהול מצבי ממשק משתמש.",
      "Loro מציעה תכונות כמו מסע בזמן אמת ושיתוף פעולה בזמן אמת ותומכת באלגוריתמים ומבני נתונים שונים של CRDT. תוכניות לפיתוח עתידי והזדמנויות לשיתוף פעולה מוזכרות גם בפוסט."
    ],
    "commentSummary": [
      "Loro הוא כלי ניהול מצבים ידידותי למשתמש המפשט מידול נתונים באמצעות CRDT, עם תוכניות לטפל בהעברת נתונים ומידול לטווח ארוך בעתיד.",
      "משתמשים דנים בכלים ואסטרטגיות אחרים הקשורים ל- CRDT, כגון הצהרת סכימה ושימוש ב- CRDT לניהול גירסאות של עמודות מסד נתונים.",
      "Electric, כלי סנכרון בזמן אמת, מוזכר עם באגים מדווחים אך משוב חיובי. דיונים כוללים באגים והשחתה ב- SQLite, דרכים לעקיפת בעיות עבור צורות והרשאות, פתרון התנגשויות באמצעות Rich-CRDT והשוואות עם ספריות אחרות. ההשקה של לורו צפויה מאוד."
    ],
    "points": 231,
    "commentCount": 36,
    "retryCount": 0,
    "time": 1699872680
  },
  {
    "id": 38254353,
    "title": "העומס בתעלת פנמה מוביל לכך שבעל ספינה משלם 4 מיליון דולר עבור גישה מועדפת",
    "originLink": "https://fortune.com/2023/11/08/panama-canal-congestion-record-4-million-skip-line/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38254353",
    "commentBody": "",
    "originSummary": [
      "חברת ספנות שילמה כמעט 4 מיליון דולר במכרז שערכה רשות תעלת פנמה עבור מעבר מועדף בתעלה הפקוקה.",
      "תעלת פנמה חווה צבר של ספינות בשל בצורת קשה, מה שהוביל להגבלות שיושמו על ידי הרשות המנהלת.",
      "המחיר המופקע עבור גישה מועדפת גורם לכך שספינות אחרות מתומחרות ללא יכולת להבטיח מעבר בתעלה."
    ],
    "commentSummary": [
      "תעלת פנמה סובלת כיום מבעיות גודש וניהול מים עקב בצורת ויכולת אגירת מים מופחתת.",
      "על פי הדיווחים, אחד מבעלי הספינה שילם 4 מיליון דולר כדי לעקוף את התור בתעלה, מה שמדגיש את דחיפות המצב.",
      "מתקיימים דיונים, בחינת פתרונות חלופיים כגון שילוב אגירת אנרגיה הידרואלקטרית שאובה, הקמת תעלה מקבילה או בחינת מסלולים חלופיים, תוך בחינת העלויות, ההיתכנות וההשפעות הסביבתיות האפשריות של כל אפשרות."
    ],
    "points": 222,
    "commentCount": 225,
    "retryCount": 0,
    "time": 1699904594
  },
  {
    "id": 38249473,
    "title": "היתרונות של BLAKE3 על פני SHA256: אפשרות הצפנה מאובטחת ויעילה",
    "originLink": "https://peergos.org/posts/blake3",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38249473",
    "commentBody": "",
    "originSummary": [
      "BLAKE3 מוצג כחלופה מועילה ל- SHA256 למטרות הצפנה.",
      "מוסבר כי BLAKE3 פותח על ידי ז'אן-פיליפ אומאסון ואחרים, בעוד SHA256 תוכנן על ידי ה-NSA.",
      "BLAKE3 אמור להיות מבוסס על אלגוריתמים חזקים כמו ChaCha20 ו Salsa20, בניגוד SHA256, אשר מבוסס על SHA1 חלש.",
      "הפוסט טוען כי חוסר האמון של NIST/NSA ב-SHA256 ניכר ומדגיש את ההתנגדות של BLAKE3 להתקפות ידועות בהשוואה ל-SHA256.",
      "BLAKE3 מתואר כמציע תכונות אבטחה מובנות, יעיל יותר במונחים של זמן ואנרגיה, וביצועים טובים בפלטפורמות עם מעגלי האצה SHA256.",
      "מוזכר כי BLAKE3 מנצל שיפורים טכנולוגיים חדשים ומדגים מקביליות גבוהה.",
      "התכנון והיישום של BLAKE3 מערב קריפטוגרפים ומהנדסי תוכנה, מה שהופך אותו ליעיל ומאובטח ביותר."
    ],
    "commentSummary": [
      "פונקציית הגיבוב Blake3 מושווית ל-SHA256, בהתחשב בגורמים כגון חוזק האלגוריתם, מהירות ופגיעות.",
      "הדיון מכסה נושאים כמו הגדרות גיבוב מוגדרות מראש, מעקב אחר אובייקטים, מניעת כפילויות וביצועים בפלטפורמות חומרה שונות.",
      "כמו כן מוזכרים השימוש בפונקציות גיבוב שונות ב-VCS, אפשרויות פלט מורחבות וזמינות של Blake3 במערכות ובשפות תכנות שונות."
    ],
    "points": 219,
    "commentCount": 116,
    "retryCount": 0,
    "time": 1699878894
  },
  {
    "id": 38255004,
    "title": "חשיבה מחדש על אבטחת יישומי אינטרנט: התרחקות מחומות אש של יישומי אינטרנט",
    "originLink": "https://www.macchaffee.com/blog/2023/wafs/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38255004",
    "commentBody": "",
    "originSummary": [
      "המחבר מבקר את השימוש בחומות אש של יישומי אינטרנט (WAFs), וקובע כי הם אינם יעילים, פגיעים לעקיפה, וניתן לנצל אותם כווקטור תקיפה.",
      "שיעור החיוביים הכוזבים הגבוה של WAFs מודגש, מה שגורם למחבר להציע אסטרטגיות אבטחה חלופיות כגון בידוד, קביעות, ניתוח סטטי ואבטחה מבוססת יכולת.",
      "המחבר תומך במעבר לגישות אבטחה המתעדפות עקרונות של אבטחה לפי תכנון, וקורא לשינוי בתעשיית האבטחה."
    ],
    "commentSummary": [
      "המאמר בוחן את התפקיד של חומות אש של יישומי אינטרנט (WAF) בשיפור האבטחה של יישומי אינטרנט.",
      "ישנן השקפות שונות לגבי החשיבות והיעילות של WAFs, יחד עם אסטרטגיות חלופיות לאבטחת יישומי אינטרנט.",
      "הדיון מדגיש את המורכבויות והאילוצים הקשורים ביישום וניהול WAFs, ומדגיש את חשיבותה של גישה הוליסטית הכוללת סקירות קוד, שאילתות פרמטרים, ניתוח סטטי והגבלות על נקודות קצה."
    ],
    "points": 213,
    "commentCount": 128,
    "retryCount": 0,
    "time": 1699907558
  },
  {
    "id": 38249742,
    "title": "רטרו קתודי: חיקוי המראה של אות טלוויזיה NTSC צבעוני וטלוויזיית CRT עם Shaders",
    "originLink": "https://github.com/DeadlyRedCube/Cathode-Retro",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38249742",
    "commentBody": "",
    "originSummary": [
      "רטרו קתודה הוא אוסף של Shaders המשכפלים את האפקטים החזותיים והמאפיינים של טלוויזיות CRT מסורתיות ואותות טלוויזיה NTSC צבעוניים.",
      "ניתן להחיל את תוכניות ה- Shader על כל מקור RGB ולהשתמש בהן בכל רזולוציה, ומציעות תכונות כגון קווי סריקה, רעש, חוסר יציבות תמונה ושכפול רפאים.",
      "האוסף כולל פקדים לכוונון גוון, רוויה, בהירות וחדות, ותומך במסכים שטוחים ומעוגלים עם אפשרויות לעיגול קצוות ופינות."
    ],
    "commentSummary": [
      "המשתתפים בדיון בוחנים את השימוש בתוכניות Shader כדי לשחזר את המראה של תצוגות CRT ישנות, תוך התמקדות בתצוגות קמורות והשתקפויות מסך לאסתטיקת וינטג' אותנטית.",
      "האתגרים של שכפול עיבוד CRT נדונים, כמו גם המשיכה של אסתטיקת רטרו וההעדפות השונות לאמנות פיקסלים חדה או מטושטשת במסכים שונים.",
      "החשיבות של השגת מראה וינטג' אמיתי ותפקידם של Shaders בתהליך זה הם נושאים מרכזיים בדיון."
    ],
    "points": 204,
    "commentCount": 78,
    "retryCount": 0,
    "time": 1699881257
  },
  {
    "id": 38251842,
    "title": "שיפור היעילות הושג באמצעות כוונון עדין וזיקוק עם GPT-3.5 ושרשרת הצפיפות",
    "originLink": "https://jxnl.github.io/instructor/blog/2023/11/05/chain-of-density/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38251842",
    "commentBody": "",
    "originSummary": [
      "המאמר מסביר כיצד שיטת שרשרת הצפיפות יושמה באמצעות Instructor כדי לזקק מודל GPT-3.5 כך שיתאים ליכולות הסיכום של GPT-4.",
      "יישום שיטות אלה הוביל לירידה של פי 20 בהשהיה, הפחתה של פי 50 בעלויות ושמירה על צפיפות ישויות.",
      "המאמר מספק מידע מפורט על יישום, מודלי נתונים, מאמתים פידנטיים, הוראות כוונון עדין ואמות מידה המשווים מודלים שונים. המסקנה מדגישה את רווחי היעילות שהושגו באמצעות כוונון עדין וזיקוק באמצעות Instructor."
    ],
    "commentSummary": [
      "GPT-3.5 ניתן לכוונון עדין באמצעות 20 דוגמאות בלבד, אשר באופן מפתיע מניב תוצאות יעילות ביצירת סיכומים חכמים יותר.",
      "המאמר בוחן את היתרונות של שימוש במודלים קטנים יותר ואת האתגרים בסיכום חילוץ.",
      "השימוש בנתונים סינתטיים, זיקוק ורשתות תלמידים-מורים נדונים כשיטות אפשריות למודלים של הכשרה."
    ],
    "points": 201,
    "commentCount": 31,
    "retryCount": 0,
    "time": 1699891964
  }
]
