[
  {
    "id": 38252566,
    "title": "بناء مستشعر إشغال لمكتبة الحرم الجامعي باستخدام ESP32 وقاعدة بيانات بدون خادم",
    "originLink": "https://matthew.science/posts/occupancy/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38252566",
    "commentBody": "",
    "originSummary": [
      "يشارك المؤلف تجربتهم في بناء مستشعر الإشغال باستخدام ESP32 وقاعدة بيانات بدون خادم.",
      "لقد نجحوا في نشر النظام في مكتبة الحرم الجامعي بعد التغلب على العديد من التحديات.",
      "أنشأ المؤلف أيضا مجموعة تجزئة صغيرة لمسح الأجهزة وجمع البيانات حول حركة الطلاب.",
      "يتم ذكر الخطط المستقبلية للمشروع ، ويتم توفير المصادر المتعلقة باكتشاف الإشغال وتطبيقات إنترنت الأشياء."
    ],
    "commentSummary": [
      "يناقش المقال العديد من الموضوعات ، بما في ذلك بناء أجهزة استشعار الإشغال ، وإنشاء حاويات إلكترونية للمشروع ، وتصميم أجهزة إنترنت الأشياء باستخدام شريحة ESP32.",
      "كما يغطي العمل مع تقنية Bluetooth ، وتطوير وحدات تحكم دقيقة منخفضة التكلفة ، وتتبع الحركة والإشغال باستخدام Bluetooth.",
      "تستكشف المناقشات الأساليب والتحديات والحلول المختلفة لكل موضوع ، وتعرض الطبيعة المتطورة والتطبيقات المحتملة لهذه التقنيات."
    ],
    "points": 545,
    "commentCount": 179,
    "retryCount": 0,
    "time": 1699895834
  },
  {
    "id": 38256810,
    "title": "نيبال تحظر TikTok بسبب اضطراب الانسجام الاجتماعي",
    "originLink": "https://apnews.com/article/nepal-tiktok-ban-social-media-854846a42ef566fa296ddaacd0099447",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38256810",
    "commentBody": "",
    "originSummary": [
      "حظرت حكومة نيبال TikTok بسبب مخاوف من الاضطراب الاجتماعي وتداول المواد غير اللائقة.",
      "تطلب الحكومة من منصات التواصل الاجتماعي التسجيل وإنشاء مكتب اتصال في نيبال ودفع الضرائب والالتزام بقوانين ولوائح البلاد.",
      "لا يزال سبب الحظر وما إذا كان TikTok قد رفض الامتثال لطلبات نيبال غير واضح. واجهت TikTok ، المملوكة لشركة ByteDance في الصين ، تدقيقا مماثلا في بلدان أخرى فيما يتعلق بخصوصية البيانات والتأثير الصيني المحتمل."
    ],
    "commentSummary": [
      "حظرت نيبال TikTok بسبب مخاوف بشأن تأثيرها على الانسجام الاجتماعي ، مما أثار مناقشات حول الإشراف على المحتوى والإدمان وتأثير منصات التواصل الاجتماعي.",
      "أثار الحظر محادثات حول الآثار السياسية للتطبيقات الصينية والتلاعب المحتمل بالرأي العام ، بالإضافة إلى موضوعات أوسع مثل ثقافة الإلغاء والقيم الغربية المعاصرة والمواقف المجتمعية تجاه الجنس.",
      "يثير المعلقون تساؤلات حول سيطرة الصين ونفوذها على TikTok ، إلى جانب مخاوف بشأن خصوصية البيانات وتأثير الكيانات الأجنبية على منصات التواصل الاجتماعي. كما تجري مناقشة قوة ونفوذ الشركات متعددة الجنسيات وتحديات التنظيم الذاتي والإدمان."
    ],
    "points": 435,
    "commentCount": 246,
    "retryCount": 0,
    "time": 1699918374
  },
  {
    "id": 38251330,
    "title": "مكونات الويب مقابل React: إعطاء الأولوية للتحسين على الاستبدال",
    "originLink": "https://blog.jim-nielsen.com/2023/html-web-components/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38251330",
    "commentBody": "",
    "originSummary": [
      "يقارن المؤلف مكونات React بمكونات الويب ، مع تسليط الضوء على أن مكونات الويب تعطي الأولوية للتحسين بدلا من الاستبدال.",
      "يمكن عرض مكونات الويب قبل JavaScript ، على عكس مكونات React ، والتأكيد على قابلية التركيب مع HTML الموجود.",
      "يقترح المؤلف أن زيادة وتحسين HTML الحالي هو أفضل نهج لتطوير الويب على المدى الطويل ، ويلاحظ أن React يتطور نحو تكوين مكون أكثر شبها ب HTML."
    ],
    "commentSummary": [
      "تقارن المقالة استخدام مكونات الويب HTML بأطر عمل مثل Vue و React و Angular ، وتناقش قيودها وفوائدها.",
      "يتم استكشاف اعتبارات مثل الأداء ، وتوافر التوظيف ، والتدقيق ، والامتثال لإمكانية الوصول ، والتطورات المستقبلية في تطوير الويب.",
      "يسلط النقاش الضوء على آراء مختلفة حول فعالية وسهولة استخدام مكونات وأطر الويب ، ويتطرق إلى موضوعات مثل المرونة والتخصيص والراحة والنظام البيئي."
    ],
    "points": 400,
    "commentCount": 206,
    "retryCount": 0,
    "time": 1699889503
  },
  {
    "id": 38251957,
    "title": "اختراق Google Bard: استغلال الحقن الفوري لاستخراج البيانات",
    "originLink": "https://embracethered.com/blog/posts/2023/google-bard-data-exfiltration/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38251957",
    "commentBody": "",
    "originSummary": [
      "تم تحديث Google Bard للسماح بالوصول إلى YouTube وعمليات البحث عن الرحلات الجوية والفنادق والمستندات الشخصية ورسائل البريد الإلكتروني ، مما يجعله عرضة لهجمات الحقن الفوري غير المباشرة.",
      "أوضح المؤلف كيفية عمل الحقن الفوري باستخدام مقاطع فيديو YouTube ومحرر مستندات Google واكتشف ثغرة أمنية في Bard تسمح بعرض الصور من خلال حقن تخفيض السعر.",
      "تم الإبلاغ عن الثغرة الأمنية إلى Google وإصلاحها ، مما يسلط الضوء على قوة الخصم في هجوم الحقن الفوري غير المباشر. الطبيعة الدقيقة للإصلاح غير معروفة."
    ],
    "commentSummary": [
      "تركز المناقشة على نقاط الضعف والمخاطر المحتملة المرتبطة بنماذج اللغة مثل Google Bard.",
      "تثار مخاوف بشأن هجمات الحقن الفوري ، والهندسة السريعة ، وعدم إمكانية التصحيح.",
      "تم ذكر اقتراحات لتحسين قدرات النظام ودمج المطالبات المخفية."
    ],
    "points": 374,
    "commentCount": 138,
    "retryCount": 0,
    "time": 1699892526
  },
  {
    "id": 38257094,
    "title": "مستقبل البرمجة: احتضان مجموعات المهارات الذكاء الاصطناعي والمتطورة",
    "originLink": "https://www.newyorker.com/magazine/2023/11/20/a-coder-considers-the-waning-days-of-the-craft",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38257094",
    "commentBody": "",
    "originSummary": [
      "يشارك المؤلف رحلتهم الشخصية مع الترميز وتصورهم المتغير لتكنولوجيا الذكاء الاصطناعي.",
      "إنهم يشككون في أهمية مهارات الترميز التقليدية ويفكرون في مستقبل المهنة.",
      "يؤكد المؤلف على أهمية الصبر والمثابرة والحاجة إلى استكشاف تقنيات جديدة في البرمجة."
    ],
    "commentSummary": [
      "الذكاء الاصطناعي نماذج اللغة مثل ChatGPT لها قيود عندما يتعلق الأمر بمهام الترميز ، مما يثير مخاوف بشأن جودة ودقة التعليمات البرمجية التي يتم إنشاؤها الذكاء الاصطناعي.",
      "هناك جدل حول الدور المستقبلي الذكاء الاصطناعي في صناعة تطوير البرمجيات والمخاطر المحتملة للاعتماد فقط على الذكاء الاصطناعي للترميز.",
      "تأثير الذكاء الاصطناعي على وظائف البرمجة وأهمية الخبرة البشرية في هذا المجال هي مواضيع ذات آراء متباينة."
    ],
    "points": 340,
    "commentCount": 569,
    "retryCount": 0,
    "time": 1699920525
  },
  {
    "id": 38249214,
    "title": "تقدم Canva مساعد الشكل: تحسين الأشكال المرسومة يدويا باستخدام التعلم الآلي",
    "originLink": "https://www.canva.dev/blog/engineering/ship-shape/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38249214",
    "commentBody": "",
    "originSummary": [
      "قدمت Canva Shape Assist ، وهي ميزة جديدة تستخدم التعلم الآلي للتعرف على الأشكال المرسومة يدويا وتحسينها في الوقت الفعلي داخل المتصفح.",
      "تعمل الميزة على تحسين قابلية الاستخدام والاستجابة ، ويمكن استخدامها في وضع عدم الاتصال.",
      "دربت Canva شبكة عصبية متكررة على مجموعة بيانات متنوعة من الأشكال التي يرسمها المستخدم ونشرت النموذج في المستعرض، مما يلغي الحاجة إلى المعالجة المستندة إلى الخادم. يحدد النموذج الأشكال بدقة ويحاذيها مع الرسومات المتجهة باستخدام نهج مطابقة القوالب."
    ],
    "commentSummary": [
      "قدمت Canva ميزة جديدة تحول الأشكال المرسومة يدويا إلى تصميمات مصقولة.",
      "يتم استخدام التعلم الآلي في تطبيقات الرسم لتحسين تجربة المستخدم والإنتاجية.",
      "تستخدم TSMC الليزر في عملية EUV الخاصة بها ، ولكنها تواجه تحديات في تحسين العمليات ذات الأطوال الموجية المختلطة."
    ],
    "points": 304,
    "commentCount": 79,
    "retryCount": 0,
    "time": 1699876260
  },
  {
    "id": 38250913,
    "title": "سينثس السوائل الحديدية المذهلة: دمج Love Hultén الساحر ل Black Goo في الأدوات المخصصة",
    "originLink": "https://cdm.link/2023/11/black-goo-ferrofluid-synths/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38250913",
    "commentBody": "",
    "originSummary": [
      "ابتكر مصمم الآلات المخصصة Love Hultén تركيبات مذهلة تتضمن السوائل الحديدية ، مما أدى إلى صور ساحرة للرقص الأسود goo استجابة للصوت.",
      "تشمل إبداعات Love Hultén KORG minilogue xd و Twisted Electronics Deton8 التي تم تحويلها إلى توليفة طبل متحركة بالسوائل الحديدية.",
      "تقدم Love Hultén أيضا أدوات مخصصة فريدة أخرى ، مثل Chunky Mother-32 ، التي تجمع بين معدات Moog و Roland مع سرير مفاتيح قابل للسحب ، وتتصور مستقبلا يتحول فيه كل شيء إلى سرطان البحر ، كما هو موضح في مفهوم سلطعون MIDI."
    ],
    "commentSummary": [
      "ابتكر Love Hultén أجهزة مزج السوائل الحديدية التي تجمع بين الصوت والمرئيات باستخدام المغناطيس الكهربائي والسوائل الحديدية.",
      "يستكشف المقال تاريخ هذه التوليفات وتطبيقاتها وقيودها ، مع التركيز على حرفيتها وتصميمها المبتكر.",
      "كما يناقش أنواعا مختلفة من أجهزة المزج ، وأسعارها ، وبناء موالف معيارية مخصصة ، وخيارات البرامج المجانية ، واستخدام السوائل الحديدية لتصور الأشكال الموجية."
    ],
    "points": 254,
    "commentCount": 55,
    "retryCount": 0,
    "time": 1699887671
  },
  {
    "id": 38254656,
    "title": "إعادة تفويض المراقبة الجماعية: ربطها بتمويل الحكومة أمر مثير للقلق",
    "originLink": "https://www.eff.org/deeplinks/2023/11/reauthorizing-mass-surveillance-shouldnt-be-tied-funding-government",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38254656",
    "commentBody": "",
    "originSummary": [
      "ومن المقرر أن تنتهي صلاحية المادة 702، وهي سلطة مراقبة جماعية مثيرة للجدل، في ديسمبر إذا لم يجددها الكونغرس.",
      "هناك مقاومة لدمج إصلاحات حقيقية في القانون، مع الضغط لربط التجديد بتمويل الحكومة.",
      "يسمح البرنامج بجمع الاتصالات بين الأمريكيين والأجانب دون أمر قضائي ، مما يثير مخاوف تتعلق بالخصوصية. تعارض منظمات متعددة التجديد في شكله الحالي وتدعو إلى إصلاحات واسعة النطاق. قدم ائتلاف من جماعات الحقوق المدنية قانون إصلاح المراقبة الحكومية كبديل. يجب أن يحدث التجديد فقط مع إصلاحات كبيرة وليس كإضافة في اللحظة الأخيرة إلى مشروع قانون يجب تمريره."
    ],
    "commentSummary": [
      "يدرس المقال العلاقة بين إعادة التصريح بالمراقبة الجماعية والتمويل الحكومي.",
      "يتم انتقاد مشاهير مثل تايلور سويفت وكاني ويست لإعطاء الأولوية للعمل الخيري على الدعوة إلى تغيير السياسة.",
      "غالبا ما يتجنب المشاهير اتخاذ موقف بشأن القضايا السياسية بسبب المخاوف من رد الفعل العنيف ، مما يحد من قدرتهم على إحداث التغيير."
    ],
    "points": 231,
    "commentCount": 51,
    "retryCount": 0,
    "time": 1699905896
  },
  {
    "id": 38248900,
    "title": "Loro: تقديم مكتبة CRDTs مفتوحة المصدر لإدارة الحالة والمزامنة بكفاءة",
    "originLink": "https://www.loro.dev/blog/loro-now-open-source",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38248900",
    "commentBody": "",
    "originSummary": [
      "Loro هي مكتبة جديدة مفتوحة المصدر تتعامل مع أنواع البيانات المنسوخة خالية من النزاعات (CRDTs) لإدارة الحالة عالية الأداء والمزامنة في تطوير البرامج المحلية أولا.",
      "تعمل CRDTs على تبسيط إدارة الحالة والمزامنة وتتوافق مع إدارة حالة واجهة المستخدم.",
      "يقدم Loro ميزات مثل السفر عبر الزمن والتعاون في الوقت الفعلي ويدعم العديد من خوارزميات CRDT وهياكل البيانات. كما تم ذكر خطط التطوير المستقبلي وفرص التعاون في المنشور."
    ],
    "commentSummary": [
      "Loro هي أداة إدارة حالة سهلة الاستخدام تبسط نمذجة البيانات باستخدام CRDTs ، مع خطط لمعالجة ترحيل البيانات والنمذجة طويلة الأجل في المستقبل.",
      "يناقش المستخدمون الأدوات والاستراتيجيات الأخرى المتعلقة ب CRDT ، مثل إعلان المخطط واستخدام CRDTs لتعيين إصدارات أعمدة قاعدة البيانات.",
      "تم ذكر Electric ، وهي أداة مزامنة في الوقت الفعلي ، مع الأخطاء المبلغ عنها ولكن ردود الفعل الإيجابية. تتضمن المناقشات الأخطاء والفساد في SQLite ، والحلول البديلة للأشكال والأذونات ، وحل التعارضات باستخدام Rich-CRDTs ، والمقارنات مع المكتبات الأخرى. إطلاق Loro متوقع للغاية."
    ],
    "points": 231,
    "commentCount": 36,
    "retryCount": 0,
    "time": 1699872680
  },
  {
    "id": 38254353,
    "title": "يؤدي ازدحام قناة بنما إلى دفع مالك السفينة 4 ملايين دولار للحصول على أولوية الوصول",
    "originLink": "https://fortune.com/2023/11/08/panama-canal-congestion-record-4-million-skip-line/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38254353",
    "commentBody": "",
    "originSummary": [
      "دفع شاحن ما يقرب من 4 ملايين دولار في مزاد أقامته هيئة قناة بنما لأولوية المرور عبر القناة المزدحمة.",
      "تعاني قناة بنما من تراكم السفن بسبب الجفاف الشديد ، مما أدى إلى قيود تنفذها السلطة الإدارية.",
      "ويتسبب الثمن الباهظ لأولوية الوصول إلى السفن الأخرى في تسعير السفن الأخرى وعدم قدرتها على تأمين المرور عبر القناة."
    ],
    "commentSummary": [
      "تعاني قناة بنما حاليا من مشاكل الازدحام وإدارة المياه بسبب الجفاف وانخفاض سعة تخزين المياه.",
      "وبحسب ما ورد دفع أحد مالكي السفن 4 ملايين دولار لتجاوز قائمة الانتظار في القناة ، مما يسلط الضوء على إلحاح الوضع.",
      "المناقشات جارية ، والنظر في حلول بديلة مثل دمج تخزين الطاقة الكهرومائية التي يتم ضخها ، أو بناء قناة موازية ، أو استكشاف طرق بديلة ، مع النظر أيضا في التكاليف والجدوى والآثار البيئية المحتملة لكل خيار."
    ],
    "points": 222,
    "commentCount": 225,
    "retryCount": 0,
    "time": 1699904594
  },
  {
    "id": 38249473,
    "title": "مزايا BLAKE3 على SHA256: خيار تشفير آمن وفعال",
    "originLink": "https://peergos.org/posts/blake3",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38249473",
    "commentBody": "",
    "originSummary": [
      "يتم تقديم BLAKE3 كبديل مفيد ل SHA256 لأغراض التشفير.",
      "يوضح أن BLAKE3 تم تطويره بواسطة Jean-Philippe Aumasson وآخرين ، بينما تم تصميم SHA256 من قبل وكالة الأمن القومي.",
      "يذكر أن BLAKE3 يعتمد على خوارزميات قوية مثل ChaCha20 و Salsa20 ، على عكس SHA256 ، الذي يعتمد على SHA1 الضعيف.",
      "يجادل المنشور بأن عدم ثقة NIST / NSA في SHA256 واضح ويسلط الضوء على مقاومة BLAKE3 للهجمات المعروفة مقارنة ب SHA256.",
      "يوصف BLAKE3 بأنه يقدم ميزات أمان مدمجة ، كونه أكثر كفاءة من حيث الوقت والطاقة ، ويعمل بشكل جيد على المنصات ذات دوائر تسريع SHA256.",
      "يذكر أن BLAKE3 يستفيد من التحسينات التقنية الجديدة ويظهر قابلية توازي عالية.",
      "يتضمن تصميم وتنفيذ BLAKE3 كلا من مصممي التشفير ومهندسي البرمجيات ، مما يجعله عالي الكفاءة وآمنا."
    ],
    "commentSummary": [
      "تتم مقارنة دالة تجزئة Blake3 ب SHA256 ، مع مراعاة عوامل مثل قوة الخوارزمية والسرعة والضعف.",
      "تغطي المناقشة موضوعات مثل الإعدادات المسبقة للتجزئة وتتبع الكائنات وإلغاء البيانات المكررة والأداء على منصات الأجهزة المختلفة.",
      "كما تم ذكر استخدام وظائف التجزئة المختلفة في VCS وخيارات الإخراج الموسعة وتوافر Blake3 في أنظمة ولغات برمجة مختلفة."
    ],
    "points": 219,
    "commentCount": 116,
    "retryCount": 0,
    "time": 1699878894
  },
  {
    "id": 38255004,
    "title": "إعادة التفكير في أمان تطبيقات الويب: الابتعاد عن جدران حماية تطبيقات الويب",
    "originLink": "https://www.macchaffee.com/blog/2023/wafs/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38255004",
    "commentBody": "",
    "originSummary": [
      "ينتقد المؤلف استخدام جدران حماية تطبيقات الويب (WAFs) ، مشيرا إلى أنها غير فعالة ، وعرضة للتجاوز ، ويمكن استغلالها كناقل للهجوم.",
      "يتم التأكيد على المعدل الإيجابي الخاطئ المرتفع ل WAFs ، مما يدفع المؤلف إلى اقتراح استراتيجيات أمنية بديلة مثل العزلة والثبات والتحليل الثابت والأمن القائم على القدرة.",
      "يدعو المؤلف إلى التحرك نحو مناهج أمنية تعطي الأولوية لمبادئ الأمان حسب التصميم ، داعيا إلى حدوث تحول في صناعة الأمن."
    ],
    "commentSummary": [
      "تستكشف المقالة دور جدران حماية تطبيقات الويب (WAFs) في تعزيز أمان تطبيقات الويب.",
      "هناك وجهات نظر مختلفة حول أهمية وفعالية WAFs ، إلى جانب الاستراتيجيات البديلة لأمن تطبيقات الويب.",
      "تسلط المناقشة الضوء على التعقيدات والقيود المرتبطة بتنفيذ وإدارة WAFs ، مع التأكيد على أهمية اتباع نهج شامل يشمل مراجعات التعليمات البرمجية ، والاستعلامات ذات المعلمات ، والتحليل الثابت ، وقيود نقطة النهاية."
    ],
    "points": 213,
    "commentCount": 128,
    "retryCount": 0,
    "time": 1699907558
  },
  {
    "id": 38249742,
    "title": "الكاثود الرجعية: محاكاة مظهر إشارة تلفزيون NTSC الملونة وتلفزيون CRT مع تظليل",
    "originLink": "https://github.com/DeadlyRedCube/Cathode-Retro",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38249742",
    "commentBody": "",
    "originSummary": [
      "Cathode Retro عبارة عن مجموعة من التظليل التي تكرر التأثيرات والخصائص المرئية لأجهزة تلفزيون CRT التقليدية وإشارات NTSC التلفزيونية الملونة.",
      "يمكن تطبيق التظليل على أي مصدر RGB واستخدامه بأي دقة ، مما يوفر ميزات مثل خطوط المسح الضوئي والضوضاء وعدم استقرار الصورة والظلال.",
      "تتضمن المجموعة عناصر تحكم لضبط الصبغة والتشبع والسطوع والحدة ، وتدعم كلا من الشاشات المسطحة والمنحنية مع خيارات لتقريب الحافة والزاوية."
    ],
    "commentSummary": [
      "يستكشف المشاركون في المناقشة استخدام التظليل لإعادة إنشاء مظهر شاشات CRT القديمة ، مع التركيز على الشاشات المنحنية وانعكاسات الشاشة للحصول على جمالية عتيقة أصيلة.",
      "تتم مناقشة تحديات تكرار عرض CRT ، بالإضافة إلى جاذبية الجماليات الرجعية والتفضيلات المختلفة لفن البكسل الواضح أو الغامض على شاشات مختلفة.",
      "تعد أهمية تحقيق مظهر عتيق حقيقي ودور التظليل في هذه العملية من الموضوعات الرئيسية للمناقشة."
    ],
    "points": 204,
    "commentCount": 78,
    "retryCount": 0,
    "time": 1699881257
  },
  {
    "id": 38251842,
    "title": "مكاسب الكفاءة التي تحققت من خلال الضبط الدقيق والتقطير باستخدام GPT-3.5 وسلسلة الكثافة",
    "originLink": "https://jxnl.github.io/instructor/blog/2023/11/05/chain-of-density/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38251842",
    "commentBody": "",
    "originSummary": [
      "تشرح المقالة كيفية تنفيذ طريقة سلسلة الكثافة باستخدام Instructor لاستخلاص نموذج GPT-3.5 لمطابقة قدرات التلخيص ل GPT-4.",
      "أدى تنفيذ هذه الأساليب إلى انخفاض 20 ضعفا في زمن الوصول ، وانخفاض التكاليف بمقدار 50 ضعفا ، والحفاظ على كثافة الكيان.",
      "توفر المقالة معلومات مفصلة حول التنفيذ ونماذج البيانات ومدققي pydantic وتعليمات الضبط الدقيق والمعايير التي تقارن النماذج المختلفة. يؤكد الاستنتاج على مكاسب الكفاءة التي تحققت من خلال الضبط الدقيق والتقطير باستخدام المدرب."
    ],
    "commentSummary": [
      "يمكن ضبط GPT-3.5 باستخدام 20 مثالا فقط ، مما يؤدي بشكل مدهش إلى نتائج فعالة في إنشاء ملخصات أكثر ذكاء.",
      "يستكشف المقال مزايا استخدام نماذج أصغر والتحديات في التلخيص الاستخراجي.",
      "تتم مناقشة استخدام البيانات التركيبية والتقطير وشبكات الطلاب والمعلمين كطرق محتملة لنماذج التدريب."
    ],
    "points": 201,
    "commentCount": 31,
    "retryCount": 0,
    "time": 1699891964
  }
]
