[
  {
    "id": 38252566,
    "title": "Membangun Sensor Okupansi untuk Perpustakaan Kampus Menggunakan ESP32 dan DB Tanpa Server",
    "originLink": "https://matthew.science/posts/occupancy/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38252566",
    "commentBody": "",
    "originSummary": [
      "Penulis berbagi pengalaman mereka dalam membangun sensor okupansi menggunakan ESP32 dan database tanpa server.",
      "Mereka berhasil menerapkan sistem ini di perpustakaan kampus setelah mengatasi beberapa tantangan.",
      "Penulis juga membuat sebuah hashset kecil untuk memindai perangkat dan mengumpulkan data pergerakan siswa.",
      "Rencana masa depan untuk proyek ini disebutkan, dan sumber-sumber yang terkait dengan deteksi hunian dan aplikasi IoT disediakan."
    ],
    "commentSummary": [
      "Artikel ini membahas beberapa topik, termasuk sensor hunian gedung, membuat penutup proyek elektronik, dan merancang perangkat IoT menggunakan chip ESP32.",
      "Hal ini juga mencakup bekerja dengan teknologi Bluetooth, mengembangkan mikrokontroler berbiaya rendah, dan melacak pergerakan dan tingkat hunian menggunakan Bluetooth.",
      "Diskusi ini mengeksplorasi berbagai metode, tantangan, dan solusi untuk setiap topik, menampilkan sifat yang terus berkembang dan potensi aplikasi dari teknologi ini."
    ],
    "points": 545,
    "commentCount": 179,
    "retryCount": 0,
    "time": 1699895834
  },
  {
    "id": 38256810,
    "title": "Nepal Melarang TikTok Karena Mengganggu Keharmonisan Sosial",
    "originLink": "https://apnews.com/article/nepal-tiktok-ban-social-media-854846a42ef566fa296ddaacd0099447",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38256810",
    "commentBody": "",
    "originSummary": [
      "Pemerintah Nepal telah melarang TikTok karena kekhawatiran akan gangguan sosial dan peredaran materi yang tidak senonoh.",
      "Pemerintah meminta platform media sosial untuk mendaftar, mendirikan kantor penghubung di Nepal, membayar pajak, dan mematuhi hukum dan peraturan negara.",
      "Alasan pelarangan tersebut dan apakah TikTok menolak untuk memenuhi permintaan Nepal masih belum jelas. TikTok, yang dimiliki oleh ByteDance di Cina, telah menghadapi pengawasan serupa di negara-negara lain terkait privasi data dan potensi pengaruh Cina."
    ],
    "commentSummary": [
      "Nepal telah melarang TikTok karena kekhawatiran akan dampaknya terhadap keharmonisan sosial, yang memicu diskusi tentang moderasi konten, kecanduan, dan pengaruh platform media sosial.",
      "Larangan tersebut telah mendorong percakapan tentang implikasi politik dari aplikasi-aplikasi Tiongkok dan potensi manipulasi opini publik, serta topik-topik yang lebih luas seperti budaya batal, nilai-nilai barat kontemporer, dan sikap masyarakat terhadap seksualitas.",
      "Para komentator mengajukan pertanyaan tentang kontrol dan pengaruh Cina terhadap TikTok, bersama dengan kekhawatiran tentang privasi data dan pengaruh entitas asing pada platform media sosial. Kekuatan dan pengaruh perusahaan multinasional serta tantangan pengaturan diri dan kecanduan juga sedang dibahas."
    ],
    "points": 435,
    "commentCount": 246,
    "retryCount": 0,
    "time": 1699918374
  },
  {
    "id": 38251330,
    "title": "Komponen Web vs React: Memprioritaskan Peningkatan daripada Penggantian",
    "originLink": "https://blog.jim-nielsen.com/2023/html-web-components/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38251330",
    "commentBody": "",
    "originSummary": [
      "Penulis membandingkan komponen React dengan komponen web, menyoroti bahwa komponen web lebih memprioritaskan peningkatan daripada penggantian.",
      "Komponen web dapat di-render sebelum JavaScript, tidak seperti komponen React, dan menekankan kompabilitas dengan HTML yang sudah ada.",
      "Penulis menyarankan bahwa menambah dan meningkatkan HTML yang sudah ada adalah pendekatan terbaik untuk pengembangan web jangka panjang, dan mencatat bahwa React berevolusi ke arah komposisi komponen yang lebih mirip HTML."
    ],
    "commentSummary": [
      "Artikel ini membandingkan penggunaan komponen web HTML dengan framework seperti Vue, React, dan Angular, serta mendiskusikan keterbatasan dan manfaatnya.",
      "Pertimbangan seperti kinerja, ketersediaan perekrutan, audit, kepatuhan aksesibilitas, dan perkembangan masa depan dalam pengembangan web dieksplorasi.",
      "Perdebatan ini menyoroti berbagai pendapat yang berbeda tentang efektivitas dan kegunaan komponen dan kerangka kerja web, menyentuh topik-topik seperti fleksibilitas, penyesuaian, kenyamanan, dan ekosistem."
    ],
    "points": 400,
    "commentCount": 206,
    "retryCount": 0,
    "time": 1699889503
  },
  {
    "id": 38251957,
    "title": "Meretas Google Bard: Memanfaatkan Injeksi Prompt untuk Eksfiltrasi Data",
    "originLink": "https://embracethered.com/blog/posts/2023/google-bard-data-exfiltration/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38251957",
    "commentBody": "",
    "originSummary": [
      "Google Bard telah diperbarui untuk memungkinkan akses ke YouTube, pencarian penerbangan dan hotel, serta dokumen dan email pribadi, sehingga rentan terhadap serangan injeksi tidak langsung.",
      "Penulis mendemonstrasikan cara kerja injeksi cepat menggunakan video YouTube dan Google Docs dan menemukan kerentanan di Bard yang memungkinkan rendering gambar melalui injeksi markdown.",
      "Kerentanan tersebut telah dilaporkan ke Google dan telah diperbaiki, menyoroti kekuatan musuh dalam serangan injeksi tidak langsung. Sifat pasti dari perbaikan tersebut tidak diketahui."
    ],
    "commentSummary": [
      "Diskusi ini berfokus pada kerentanan dan potensi risiko yang terkait dengan model bahasa seperti Google Bard.",
      "Kekhawatiran muncul tentang serangan injeksi yang cepat, rekayasa yang cepat, dan kurangnya kemampuan debug.",
      "Saran untuk meningkatkan kemampuan sistem dan menyatukan petunjuk tersembunyi disebutkan."
    ],
    "points": 374,
    "commentCount": 138,
    "retryCount": 0,
    "time": 1699892526
  },
  {
    "id": 38257094,
    "title": "Masa Depan Pengkodean: Merangkul AI dan Mengembangkan Perangkat Keterampilan",
    "originLink": "https://www.newyorker.com/magazine/2023/11/20/a-coder-considers-the-waning-days-of-the-craft",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38257094",
    "commentBody": "",
    "originSummary": [
      "Penulis berbagi perjalanan pribadi mereka dengan coding dan perubahan persepsi mereka tentang teknologi AI.",
      "Mereka mempertanyakan relevansi keterampilan pengkodean tradisional dan merenungkan masa depan profesi ini.",
      "Penulis menekankan pentingnya kesabaran, ketekunan, dan kebutuhan untuk mengeksplorasi teknologi baru dalam pemrograman."
    ],
    "commentSummary": [
      "Model bahasa AI seperti ChatGPT memiliki keterbatasan dalam hal tugas pengkodean, sehingga menimbulkan kekhawatiran tentang kualitas dan keakuratan kode yang dihasilkan AI.",
      "Ada perdebatan tentang peran AI di masa depan dalam industri pengembangan perangkat lunak dan potensi risiko jika hanya mengandalkan AI untuk pengkodean.",
      "Dampak AI pada pekerjaan pemrograman dan pentingnya keahlian manusia di bidang ini adalah subjek dari berbagai pendapat."
    ],
    "points": 340,
    "commentCount": 569,
    "retryCount": 0,
    "time": 1699920525
  },
  {
    "id": 38249214,
    "title": "Canva Memperkenalkan Bantuan Bentuk: Menyempurnakan Bentuk yang Digambar Tangan dengan Pembelajaran Mesin",
    "originLink": "https://www.canva.dev/blog/engineering/ship-shape/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38249214",
    "commentBody": "",
    "originSummary": [
      "Canva telah memperkenalkan Shape Assist, fitur baru yang memanfaatkan pembelajaran mesin untuk mengenali dan menyempurnakan bentuk yang digambar dengan tangan secara real-time di dalam browser.",
      "Fitur ini meningkatkan kegunaan dan daya tanggap, dan dapat digunakan secara offline.",
      "Canva melatih Jaringan Syaraf Tiruan pada kumpulan data beragam bentuk yang digambar pengguna dan menerapkan model di browser, sehingga tidak perlu lagi menggunakan pemrosesan berbasis server. Model ini secara akurat mengidentifikasi bentuk dan menyelaraskannya dengan grafik vektor menggunakan pendekatan pencocokan templat."
    ],
    "commentSummary": [
      "Canva telah memperkenalkan fitur baru yang mengubah bentuk yang digambar dengan tangan menjadi desain yang dipoles.",
      "Pembelajaran mesin digunakan dalam aplikasi menggambar untuk meningkatkan pengalaman dan produktivitas pengguna.",
      "TSMC memanfaatkan laser dalam proses EUV mereka, tetapi menghadapi tantangan dalam mengoptimalkan proses dengan panjang gelombang campuran."
    ],
    "points": 304,
    "commentCount": 79,
    "retryCount": 0,
    "time": 1699876260
  },
  {
    "id": 38250913,
    "title": "Sintesis Ferrofluida yang Menakjubkan: Penggabungan Black Goo yang Memukau dari Love Hultén ke dalam Instrumen Kustom",
    "originLink": "https://cdm.link/2023/11/black-goo-ferrofluid-synths/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38250913",
    "commentBody": "",
    "originSummary": [
      "Perancang instrumen khusus, Love Hultén telah menciptakan instrumen sintetis yang memukau dengan menggunakan ferrofluida, menghasilkan visual yang memukau berupa tarian goo hitam yang menari sebagai respons terhadap suara.",
      "Kreasi Love Hultén meliputi minilog KORG xd dan Twisted Electronics Deton8 yang diubah menjadi synth drum beranimasi ferrofluid.",
      "Love Hultén juga menawarkan instrumen kustom unik lainnya, seperti Chunky Mother-32, yang menggabungkan peralatan Moog dan Roland dengan tuts yang dapat ditarik, dan membayangkan masa depan di mana segala sesuatu berubah menjadi kepiting, seperti yang terlihat pada konsep kepiting MIDI mereka."
    ],
    "commentSummary": [
      "Love Hultén telah menciptakan sintesis ferrofluida yang menggabungkan suara dan visual dengan menggunakan elektromagnet dan ferrofluida.",
      "Artikel ini mengeksplorasi sejarah, aplikasi, dan keterbatasan sintesis ini, dengan menekankan pada keahlian dan desain inovatifnya.",
      "Ini juga membahas berbagai jenis synthesizer, harganya, membangun synth modular khusus, opsi perangkat lunak gratis, dan penggunaan ferrofluid untuk memvisualisasikan bentuk gelombang."
    ],
    "points": 254,
    "commentCount": 55,
    "retryCount": 0,
    "time": 1699887671
  },
  {
    "id": 38254656,
    "title": "Mengesahkan kembali pengawasan massal: Mengaitkannya dengan pendanaan pemerintah adalah hal yang mengkhawatirkan",
    "originLink": "https://www.eff.org/deeplinks/2023/11/reauthorizing-mass-surveillance-shouldnt-be-tied-funding-government",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38254656",
    "commentBody": "",
    "originSummary": [
      "Pasal 702, otoritas pengawasan massal yang kontroversial, akan berakhir pada bulan Desember jika Kongres tidak memperbaruinya.",
      "Ada penolakan untuk memasukkan reformasi nyata ke dalam undang-undang, dengan adanya dorongan untuk mengaitkan pembaruan dengan pendanaan pemerintah.",
      "Program ini memungkinkan pengumpulan komunikasi antara orang Amerika dan orang asing tanpa surat perintah, sehingga menimbulkan masalah privasi. Beberapa organisasi menentang pembaruan dalam bentuknya yang sekarang dan mengadvokasi reformasi yang luas. Sebuah koalisi kelompok hak-hak sipil telah memperkenalkan Undang-Undang Reformasi Pengawasan Pemerintah sebagai alternatif. Pembaruan seharusnya hanya terjadi dengan reformasi yang signifikan dan bukan sebagai tambahan di menit-menit terakhir pada RUU yang harus diloloskan."
    ],
    "commentSummary": [
      "Artikel ini membahas hubungan antara mengesahkan kembali pengawasan massal dan pendanaan pemerintah.",
      "Selebriti seperti Taylor Swift dan Kanye West dikritik karena memprioritaskan kegiatan amal daripada mengadvokasi perubahan kebijakan.",
      "Selebriti sering kali menghindari mengambil sikap dalam isu-isu politik karena takut akan serangan balik, sehingga membatasi kemampuan mereka untuk membawa perubahan."
    ],
    "points": 231,
    "commentCount": 51,
    "retryCount": 0,
    "time": 1699905896
  },
  {
    "id": 38248900,
    "title": "Loro: Memperkenalkan Perpustakaan CRDT Sumber Terbuka untuk Manajemen dan Sinkronisasi Status yang Efisien",
    "originLink": "https://www.loro.dev/blog/loro-now-open-source",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38248900",
    "commentBody": "",
    "originSummary": [
      "Loro adalah pustaka sumber terbuka baru yang menangani Conflict-free Replicated Data Types (CRDTs) untuk manajemen status dan sinkronisasi berkinerja tinggi dalam pengembangan perangkat lunak yang mengutamakan lokal.",
      "CRDT menyederhanakan manajemen status dan sinkronisasi dan kompatibel dengan manajemen status UI.",
      "Loro menawarkan fitur-fitur seperti perjalanan waktu dan kolaborasi waktu nyata serta mendukung berbagai algoritma CRDT dan struktur data. Rencana untuk pengembangan masa depan dan peluang kolaborasi juga disebutkan dalam postingan tersebut."
    ],
    "commentSummary": [
      "Loro adalah alat manajemen status yang mudah digunakan yang menyederhanakan pemodelan data menggunakan CRDT, dengan rencana untuk menangani migrasi data dan pemodelan jangka panjang di masa depan.",
      "Pengguna mendiskusikan alat bantu dan strategi terkait CRDT lainnya, seperti deklarasi skema dan menggunakan CRDT untuk membuat versi kolom basis data.",
      "Electric, alat sinkronisasi waktu nyata, disebutkan dengan bug yang dilaporkan tetapi umpan baliknya positif. Pembahasannya meliputi bug dan kerusakan pada SQLite, solusi untuk bentuk dan perizinan, resolusi konflik menggunakan Rich-CRDT, dan perbandingan dengan pustaka lain. Peluncuran Loro sangat dinantikan."
    ],
    "points": 231,
    "commentCount": 36,
    "retryCount": 0,
    "time": 1699872680
  },
  {
    "id": 38254353,
    "title": "Kemacetan di Terusan Panama membuat pemilik kapal harus membayar 4 juta dolar AS untuk mendapatkan akses prioritas",
    "originLink": "https://fortune.com/2023/11/08/panama-canal-congestion-record-4-million-skip-line/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38254353",
    "commentBody": "",
    "originSummary": [
      "Seorang pengirim barang telah membayar hampir $4 juta dalam lelang yang diadakan oleh Otoritas Terusan Panama untuk mendapatkan prioritas melewati terusan yang padat tersebut.",
      "Terusan Panama telah mengalami penumpukan kapal karena kekeringan yang parah, yang menyebabkan pembatasan yang diterapkan oleh otoritas pengelola.",
      "Harga yang terlalu tinggi untuk akses prioritas menyebabkan kapal-kapal lain tidak bisa mendapatkan akses dan tidak bisa melewati kanal tersebut."
    ],
    "commentSummary": [
      "Terusan Panama saat ini sedang mengalami kemacetan dan masalah pengelolaan air karena kekeringan dan berkurangnya kapasitas penyimpanan air.",
      "Seorang pemilik kapal dilaporkan membayar 4 juta dolar AS untuk memotong antrian di kanal, yang menyoroti urgensi dari situasi ini.",
      "Diskusi sedang berlangsung, dengan mempertimbangkan solusi alternatif seperti mengintegrasikan penyimpanan energi hidroelektrik yang dipompa, membangun kanal paralel, atau mengeksplorasi rute alternatif, sambil juga mempertimbangkan biaya, kelayakan, dan potensi dampak lingkungan dari setiap opsi."
    ],
    "points": 222,
    "commentCount": 225,
    "retryCount": 0,
    "time": 1699904594
  },
  {
    "id": 38249473,
    "title": "Keunggulan BLAKE3 dibandingkan SHA256: Opsi Kriptografi yang Aman dan Efisien",
    "originLink": "https://peergos.org/posts/blake3",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38249473",
    "commentBody": "",
    "originSummary": [
      "BLAKE3 disajikan sebagai alternatif yang menguntungkan untuk SHA256 untuk tujuan kriptografi.",
      "Dijelaskan bahwa BLAKE3 dikembangkan oleh Jean-Philippe Aumasson dan yang lainnya, sedangkan SHA256 dirancang oleh NSA.",
      "BLAKE3 dinyatakan didasarkan pada algoritma yang kuat seperti ChaCha20 dan Salsa20, berbeda dengan SHA256, yang didasarkan pada SHA1 yang lemah.",
      "Postingan tersebut menyatakan bahwa kurangnya kepercayaan NIST/NSA terhadap SHA256 terbukti dan menyoroti resistensi BLAKE3 terhadap serangan yang diketahui dibandingkan dengan SHA256.",
      "BLAKE3 dideskripsikan menawarkan fitur keamanan built-in, lebih efisien dalam hal waktu dan energi, serta berkinerja baik pada platform dengan sirkuit akselerasi SHA256.",
      "Disebutkan bahwa BLAKE3 memanfaatkan peningkatan teknologi baru dan menunjukkan kemampuan paralelisasi yang tinggi.",
      "Desain dan implementasi BLAKE3 melibatkan kriptografer dan insinyur perangkat lunak, membuatnya sangat efisien dan aman."
    ],
    "commentSummary": [
      "Fungsi hash Blake3 dibandingkan dengan SHA256, dengan mempertimbangkan faktor-faktor seperti kekuatan algoritme, kecepatan, dan kerentanan.",
      "Diskusi ini mencakup topik-topik seperti preset hash, pelacakan objek, deduplikasi, dan kinerja pada platform perangkat keras yang berbeda.",
      "Penggunaan fungsi hash yang berbeda dalam VCS, opsi output yang diperluas, dan ketersediaan Blake3 dalam sistem dan bahasa pemrograman yang berbeda juga disebutkan."
    ],
    "points": 219,
    "commentCount": 116,
    "retryCount": 0,
    "time": 1699878894
  },
  {
    "id": 38255004,
    "title": "Memikirkan Kembali Keamanan Aplikasi Web: Menjauh dari Firewall Aplikasi Web",
    "originLink": "https://www.macchaffee.com/blog/2023/wafs/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38255004",
    "commentBody": "",
    "originSummary": [
      "Penulis mengkritik penggunaan Web Application Firewalls (WAF), menyatakan bahwa mereka tidak efektif, rentan untuk dilewati, dan dapat dieksploitasi sebagai vektor serangan.",
      "Tingginya tingkat positif palsu dari WAF yang ditekankan, mendorong penulis untuk menyarankan strategi keamanan alternatif seperti isolasi, kekekalan, analisis statis, dan keamanan berbasis kemampuan.",
      "Penulis menganjurkan untuk bergerak ke arah pendekatan keamanan yang memprioritaskan prinsip-prinsip aman menurut desain, dan menyerukan pergeseran dalam industri keamanan."
    ],
    "commentSummary": [
      "Artikel ini mengeksplorasi peran firewall aplikasi web (WAF) dalam meningkatkan keamanan aplikasi web.",
      "Ada beberapa pandangan yang berbeda tentang pentingnya dan keampuhan WAF, bersama dengan strategi alternatif untuk keamanan aplikasi web.",
      "Diskusi ini menyoroti kompleksitas dan kendala yang terkait dengan penerapan dan pengelolaan WAF, dengan menekankan pentingnya pendekatan holistik yang mencakup tinjauan kode, kueri yang diparameterisasi, analisis statis, dan pembatasan titik akhir."
    ],
    "points": 213,
    "commentCount": 128,
    "retryCount": 0,
    "time": 1699907558
  },
  {
    "id": 38249742,
    "title": "Cathode Retro: Meniru Tampilan Sinyal TV NTSC Berwarna dan TV CRT dengan Shader",
    "originLink": "https://github.com/DeadlyRedCube/Cathode-Retro",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38249742",
    "commentBody": "",
    "originSummary": [
      "Cathode Retro adalah kumpulan shader yang mereplikasi efek visual dan karakteristik TV CRT tradisional dan sinyal TV NTSC berwarna.",
      "Shader dapat diterapkan ke sumber RGB apa pun dan digunakan pada resolusi apa pun, menawarkan berbagai fitur seperti garis pindai, noise, ketidakstabilan gambar, dan ghosting.",
      "Koleksinya mencakup kontrol untuk menyesuaikan rona warna, saturasi, kecerahan, dan ketajaman, serta mendukung layar datar dan lengkung dengan opsi pembulatan tepi dan sudut."
    ],
    "commentSummary": [
      "Para peserta dalam diskusi menjelajahi penggunaan shader untuk menciptakan kembali tampilan tampilan CRT lama, dengan fokus pada tampilan melengkung dan pantulan layar untuk mendapatkan estetika vintage yang otentik.",
      "Tantangan mereplikasi rendering CRT dibahas, serta daya tarik estetika retro dan preferensi yang berbeda-beda untuk seni piksel yang jernih atau kabur pada layar yang berbeda.",
      "Pentingnya mencapai penampilan vintage yang asli dan peran shader dalam proses ini adalah topik utama diskusi."
    ],
    "points": 204,
    "commentCount": 78,
    "retryCount": 0,
    "time": 1699881257
  },
  {
    "id": 38251842,
    "title": "Peningkatan efisiensi yang dicapai melalui penyempurnaan dan penyulingan dengan GPT-3.5 dan Chain of Density",
    "originLink": "https://jxnl.github.io/instructor/blog/2023/11/05/chain-of-density/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38251842",
    "commentBody": "",
    "originSummary": [
      "Artikel ini menjelaskan bagaimana metode Chain of Density diimplementasikan dengan menggunakan Instructor untuk menyaring model GPT-3.5 agar sesuai dengan kemampuan ringkasan GPT-4.",
      "Menerapkan metode ini menghasilkan penurunan latensi 20x lipat, pengurangan biaya 50x lipat, dan kepadatan entitas yang terjaga.",
      "Artikel ini memberikan informasi rinci tentang implementasi, model data, validator pydantic, instruksi fine-tuning, dan tolok ukur yang membandingkan model yang berbeda. Kesimpulannya menekankan pada keuntungan efisiensi yang dicapai melalui fine-tuning dan distilasi menggunakan Instructor."
    ],
    "commentSummary": [
      "GPT-3.5 dapat disetel dengan baik hanya dengan menggunakan 20 contoh, yang secara mengejutkan memberikan hasil yang efektif dalam menghasilkan ringkasan yang lebih cerdas.",
      "Artikel ini mengeksplorasi keuntungan menggunakan model yang lebih kecil dan tantangan dalam peringkasan ekstraktif.",
      "Penggunaan data sintetis, distilasi, dan jaringan siswa-guru dibahas sebagai metode potensial untuk model pelatihan."
    ],
    "points": 201,
    "commentCount": 31,
    "retryCount": 0,
    "time": 1699891964
  }
]
