[
  {
    "id": 37498979,
    "title": "Un error en macOS 14 Sonoma impide que nuestra aplicación funcione",
    "originLink": "https://mullvad.net/en/blog/2023/9/13/bug-in-macos-14-sonoma-prevents-our-app-from-working/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37498979",
    "commentBody": "",
    "originSummary": [
      "La aplicación Mullvad VPN experimenta actualmente problemas de compatibilidad con macOS 14 Sonoma debido a un error del cortafuegos que interrumpe el filtrado adecuado del tráfico.",
      "Este fallo puede provocar filtraciones en determinadas configuraciones, lo que supone un riesgo potencial para la seguridad de los usuarios.",
      "Aunque el problema ha sido reportado a Apple, aún no hay remedio disponible; por lo tanto, se recomienda a los usuarios permanecer en macOS 13 Ventura hasta que se presente una solución."
    ],
    "commentSummary": [
      "Los usuarios están encontrando problemas con las funcionalidades de red de la versión beta de macOS 14 Sonoma, posiblemente debido a un error en el cortafuegos de macOS.",
      "Hay un debate en torno a posibles soluciones y servicios VPN alternativos para rectificar el problema, lo que indica insatisfacción con la estabilidad y usabilidad de macOS, y el enfoque cerrado de Apple.",
      "Los usuarios cuestionan la utilidad de informar de errores a Apple, indicando problemas con el conjunto de pruebas y la gestión de los comentarios de los usuarios."
    ],
    "points": 919,
    "commentCount": 208,
    "retryCount": 0,
    "time": 1694624744
  },
  {
    "id": 37496589,
    "title": "El teléfono del cofundador de Meduza infectado con Pegasus",
    "originLink": "https://meduza.io/en/feature/2023/09/13/the-million-dollar-reporter",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37496589",
    "commentBody": "",
    "originSummary": [
      "Galina Timchenko, cofundadora y editora del medio de comunicación ruso Meduza, se ha convertido en la primera periodista rusa infectada por el programa espía Pegasus, desarrollado por NSO Group.",
      "La administración Biden incluyó a NSO Group en su lista negra en 2021, prohibiéndole el acceso a las tecnologías estadounidenses por motivos de uso indebido y supervisión reglamentaria.",
      "Meduza, Access Now y Citizen Lab investigaron juntos el incidente, sacando a la luz el uso indebido generalizado de Pegasus y reforzando la preocupación por la vigilancia gubernamental y la persecución de periodistas, opositores y activistas."
    ],
    "commentSummary": [
      "Los temas de debate abarcan la utilización del programa espía Pegasus contra periodistas, las vulnerabilidades de diversos sistemas operativos, la preocupación por la piratería informática patrocinada por el Estado y la dificultad para encontrar fuentes de noticias imparciales.",
      "Se debate sobre la eficacia de las medidas de seguridad y los distintos enfoques del consumo de noticias, junto con críticas dirigidas a los medios de comunicación por su parcialidad y falta de responsabilidad.",
      "Las referencias a situaciones geopolíticas, incluido el papel de los Estados occidentales en el conflicto ucraniano, ponen de relieve el contexto más amplio y las implicaciones para los sectores de la tecnología y la información."
    ],
    "points": 393,
    "commentCount": 240,
    "retryCount": 0,
    "time": 1694612357
  },
  {
    "id": 37501231,
    "title": "No te metas con un genio (2010)",
    "originLink": "https://shreevatsa.wordpress.com/2010/06/04/dont-mess-with-a-genius/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37501231",
    "commentBody": "",
    "originSummary": [
      "El texto destaca el mandato de Isaac Newton como Alcaide de la Casa de la Moneda en Inglaterra, donde persiguió activamente a los falsificadores.",
      "Destaca sus exitosos esfuerzos por atrapar a muchos falsificadores, con especial énfasis en su archienemigo, William Chaloner.",
      "La importante contribución de Newton a la Gran Recoinciación significa su notable contribución al mantenimiento de la integridad de la moneda."
    ],
    "commentSummary": [
      "El hilo de debate de Hacker News ofrece diversas perspectivas sobre la vida de Isaac Newton, que abarcan sus conflictos, su asociación con la alquimia, sus cruzadas contra los falsificadores y sus contribuciones al cálculo.",
      "Los participantes en el hilo debaten sobre el carácter individual y las contribuciones científicas de Newton, con algunos mostrándose escépticos y otros defendiendo su reputación.",
      "El artículo también desvela el aspecto humano de Newton, destacando nuestros sesgos cognitivos que pueden llevar incluso a personas muy inteligentes a ser presa de estafas y manipulaciones."
    ],
    "points": 344,
    "commentCount": 87,
    "retryCount": 0,
    "time": 1694636490
  },
  {
    "id": 37498142,
    "title": "Espectrómetro de infrarrojo cercano de bricolaje",
    "originLink": "https://caoyuan.scripts.mit.edu/ir_spec.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37498142",
    "commentBody": "",
    "originSummary": [
      "Yuan Cao ha desarrollado un espectrómetro de infrarrojo cercano (IR cercano) económico y con una resolución de 6 nm.",
      "El espectrómetro funciona mediante una rejilla de difracción y fotodiodos, entre otros componentes; mide la resolución espectral y la longitud de onda de la luz.",
      "Además de hablar de los retos relacionados con la reducción del ruido y las interferencias, Cao también habla de la calibración, el rango dinámico del espectrómetro y la medición de los espectros de transmisión. Es posible que en el futuro revelen más espectros."
    ],
    "commentSummary": [
      "Un individuo ha desarrollado un espectrómetro de infrarrojo cercano de fabricación propia y bajo coste, con posibles usos en diversos sectores.",
      "El creador quiere fabricar espectrómetros asequibles para países del tercer mundo, con el fin de ayudar a identificar medicamentos falsos.",
      "El texto hace hincapié en los retos que plantea la calibración y certificación de estos instrumentos, y destaca la falta de artículos sólidos en plataformas como Hacker News."
    ],
    "points": 339,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1694619208
  },
  {
    "id": 37500895,
    "title": "Cuando la AMF no es AMF, o cómo nos hicieron phishing",
    "originLink": "https://retool.com/blog/mfa-isnt-mfa/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37500895",
    "commentBody": "",
    "originSummary": [
      "Retool, una plataforma para crear herramientas internas, se enfrentó a un ataque de spear phishing que provocó el acceso no autorizado a 27 cuentas de clientes en la nube, lo que reveló la vulnerabilidad del sistema a los ataques de ingeniería social.",
      "El ataque se produjo cuando un empleado sucumbió a un ataque de phishing basado en SMS y proporcionó códigos de autenticación multifactor (MFA), que posteriormente comprometieron la VPN de la empresa y los sistemas de administración interna.",
      "Retool recomienda mejorar la seguridad, como evitar el almacenamiento de códigos MFA en la nube, promover la formación de los empleados y el uso de claves de seguridad de hardware para MFA, y adoptar estrategias de defensa en profundidad. La empresa colabora ahora con las fuerzas de seguridad y una empresa forense para investigar el incidente."
    ],
    "commentSummary": [
      "El debate de Hacker News abarca aspectos como la precaución ante llamadas o mensajes que solicitan información personal, la necesidad de validar la identidad de quien llama y la necesidad de sistemas estándar de autenticación inversa.",
      "Los participantes debaten los puntos fuertes y los límites de las distintas medidas de seguridad, como el cifrado de contraseñas, la autenticación multifactorial y la biometría, y comparten casos de mala gestión de problemas de fraude.",
      "También se detallan cuestiones como el uso de la tecnología deepfake en las violaciones de la seguridad, la protección de los activos digitales y el acuerdo general sobre la necesidad de soluciones de seguridad sólidas y fáciles de usar."
    ],
    "points": 324,
    "commentCount": 232,
    "retryCount": 0,
    "time": 1694634512
  },
  {
    "id": 37502258,
    "title": "No utilices Discord como foro de preguntas y respuestas",
    "originLink": "https://kraktoos.com/posts/dont-use-discord-as-forum/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37502258",
    "commentBody": "",
    "originSummary": [
      "El autor desaconseja el uso de Discord como foro de preguntas y respuestas (Q&A) para proyectos, citando su naturaleza caótica, sus deficientes funciones de búsqueda y descubrimiento, y su potencial riesgo de discontinuidad.",
      "El texto sugiere alternativas mejores, como foros comunitarios dedicados, sitios web reputados como Stack Overflow o Reddit, y sistemas de seguimiento de incidencias basados en Git.",
      "El autor subraya la importancia de seleccionar meticulosamente una plataforma para las preguntas y respuestas, reconociendo su impacto en el progreso del proyecto y la interacción con la comunidad."
    ],
    "commentSummary": [
      "El debate se centra principalmente en el uso de Discord como foro de preguntas y respuestas, con opiniones diversas sobre su eficacia frente a plataformas como GitHub issues, foros dedicados y listas de correo.",
      "Se alaban la informalidad y la facilidad de uso de Discord, pero se destacan sus limitaciones en cuanto a capacidad de búsqueda y organización. La elección de la plataforma depende de las necesidades individuales, como el control, el coste, la facilidad de configuración y las tendencias demográficas.",
      "También se habló de la posible obsolescencia de los foros y listas de correo tradicionales, y de la posibilidad de una plataforma más completa con motores de búsqueda indexados, respuestas anidadas y funciones de voz."
    ],
    "points": 322,
    "commentCount": 198,
    "retryCount": 0,
    "time": 1694642089
  },
  {
    "id": 37497345,
    "title": "Omita la API y envíe su base de datos",
    "originLink": "https://fly.io/blog/skip-the-api/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37497345",
    "commentBody": "",
    "originSummary": [
      "LiteFS es una base de datos SQLite distribuida globalmente, diseñada originalmente para distribuir datos geográficamente, garantizando tiempos de respuesta rápidos.",
      "Se descubrió el novedoso uso de LiteFS, que permite sustituir las capas API entre servicios. Esto se consigue distribuyendo la base de datos completa en el lado del cliente, lo que permite realizar consultas SQL y unir datos según los requisitos del cliente.",
      "Las réplicas son de sólo lectura, por lo que se necesita una API para actualizar los datos. Aunque tiene algunas limitaciones, esta técnica puede ser beneficiosa en situaciones en las que las API convencionales son inadecuadas."
    ],
    "commentSummary": [
      "El artículo explora el concepto de utilización de bases de datos como API, esbozando los posibles retos y obstáculos de este método.",
      "El discurso recomienda utilizar contratos de API y herramientas como vistas y procedimientos almacenados para gestionar los cambios en los sistemas de software. También aborda temas como la viabilidad de descargar bases de datos enteras durante la carga inicial de la página, las dificultades de implantar un modelo de base de datos por usuario y la cuestión de la falta de honradez de los proveedores en la informática sin servidor.",
      "Se hace hincapié en las ventajas e inconvenientes de utilizar bases de datos como API, incluida la práctica de utilizar vistas y renombrar tablas en PostgreSQL para modificar esquemas."
    ],
    "points": 234,
    "commentCount": 162,
    "retryCount": 0,
    "time": 1694615875
  },
  {
    "id": 37499106,
    "title": "La inutilidad de la fenilefrina (2022)",
    "originLink": "https://www.science.org/content/blog-post/uselessness-phenylephrine",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37499106",
    "commentBody": "",
    "originSummary": [
      "El autor afirma que la fenilefrina es un descongestionante menos eficaz que la pseudoefedrina, dado su amplio metabolismo en el organismo.",
      "La fenilefrina se vende supuestamente como alternativa a la pseudoefedrina, debido a las restricciones impuestas a la pseudoefedrina por su posible uso en la producción ilegal de metanfetamina.",
      "El artículo concluye con una recomendación para que la FDA reconsidere la venta de fenilefrina, sugiriendo que no justifica su inclusión actual en la lista."
    ],
    "commentSummary": [
      "El debate explora temas como la regulación de las drogas, la adicción, la producción de metanfetamina y la eficacia de distintos medicamentos, incluidos los descongestionantes.",
      "También se debaten cuestiones como el impacto de la normativa en la disponibilidad de fármacos, el papel de las fuerzas del orden, las intervenciones sociales, los problemas de privacidad y las limitaciones de las drogas farmacéuticas.",
      "Se destacan factores como el efecto placebo, los cambios en el estilo de vida y las respuestas individuales a la medicación, mostrando las complejidades y retos asociados a la regulación de los fármacos y su potencia."
    ],
    "points": 221,
    "commentCount": 320,
    "retryCount": 0,
    "time": 1694625447
  },
  {
    "id": 37497131,
    "title": "¿Por qué hinojo?",
    "originLink": "https://fennel-lang.org/rationale",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37497131",
    "commentBody": "",
    "originSummary": [
      "Fennel es un lenguaje de programación basado en el tiempo de ejecución de Lua, cuyo objetivo es ofrecer una sintaxis más simple y concisa eliminando las complejidades que se encuentran en Lua.",
      "Este lenguaje mejora elementos como la gestión de variables globales, tablas, bucles y funciones, e introduce características como la concordancia de patrones y la desestructuración de estructuras de datos.",
      "Fennel es compatible con las bibliotecas y herramientas Lua existentes, e incorpora un sistema de macros para ampliar el lenguaje con nuevas formas sintácticas."
    ],
    "commentSummary": [
      "El post se centra en el uso de Fennel, un lenguaje de programación, en las configuraciones Neovim y Hammerspoon, apreciado por su brevedad y ergonomía superior a Lua.",
      "Se hacen comparaciones entre Lua y otros lenguajes que compilan a Lua como Moonscript y Yuescript, acentuando los beneficios de las comprobaciones de aridad de Fennel de las que carece Lua.",
      "Aborda el tema de la sangría frente a los lenguajes basados en delimitadores y el uso práctico de Lua en diferentes contextos, e incluye referencias a una página web de Fennel y a la disponibilidad actual de solicitudes para el YC Winter 2024."
    ],
    "points": 218,
    "commentCount": 88,
    "retryCount": 0,
    "time": 1694614905
  },
  {
    "id": 37498473,
    "title": "Un tribunal de apelación confirma el derecho a publicar leyes públicas en Internet",
    "originLink": "https://www.eff.org/press/releases/appeals-court-upholds-publicresourceorgs-right-post-public-laws-and-regulations",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37498473",
    "commentBody": "",
    "originSummary": [
      "Un tribunal federal de apelaciones dictaminó que las normas técnicas incorporadas al derecho público pueden compartirse sin riesgo de infringir los derechos de autor, lo que refleja la opinión de que las leyes pertenecen a todos y deben ser accesibles gratuitamente y sin registro.",
      "El caso fue iniciado por la organización sin ánimo de lucro Public.Resource.org, representada por la Electronic Frontier Foundation, contra organismos privados que crean códigos y normas.",
      "El tribunal falló a favor de Public.Resource.org, marcándolo como un triunfo para el acceso público a las leyes, principalmente debido a la naturaleza educativa y sin ánimo de lucro de su uso de las normas."
    ],
    "commentSummary": [
      "Un tribunal de apelación ha determinado que publicar leyes públicas en línea no infringe los derechos de autor y se considera uso legítimo.",
      "Este caso sensibiliza sobre la inaccesibilidad de la legislación y cuestiona la protección de los derechos de autor, poniendo de relieve casos de leyes de derechos de autor que exigen el pago por el acceso.",
      "El discurso también se refiere a la incorporación de normas privadas a las leyes sin compensación, y pone de relieve las diferentes prácticas de los distintos países en cuanto a la disponibilidad de textos jurídicos y normas."
    ],
    "points": 192,
    "commentCount": 58,
    "retryCount": 0,
    "time": 1694620798
  },
  {
    "id": 37497956,
    "title": "Motor Bitty: Un motor de juego pequeñito",
    "originLink": "https://paladin-t.github.io/bitty/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37497956",
    "commentBody": "",
    "originSummary": [
      "Bitty Engine es un motor de juegos multiplataforma con editores incorporados, que permite programar en Lua de forma sencilla, acompañado de funciones como un depurador, documentación de la API y varias herramientas de edición.",
      "Capaz de crear binarios independientes, el motor puede utilizarse con fines tanto comerciales como no comerciales. Está disponible para plataformas como Windows 7, MacOS 10.7 o Ubuntu 14, con bajos requisitos de sistema.",
      "El motor Bitty, distribuido en Steam e Itch, es idéntico en cuanto a características en ambas plataformas, y en Steam hay disponible una versión de prueba."
    ],
    "commentSummary": [
      "El artículo pone de relieve el entusiasmo suscitado por el reciente lanzamiento del motor Bitty, con un debate centrado en consejos para el desarrollo de juegos y motores y la aplicación de JavaScript/TypeScript en motores de juegos.",
      "También se habla del potencial de los juegos físicos con ordenadores integrados y de la creciente popularidad de Lua en el desarrollo de juegos.",
      "Se subrayan las principales ventajas de Lua, como su fácil incorporación a bases de código, su sencillez de aprendizaje, su compatibilidad con motores C y C++, junto con la alternativa de alto rendimiento LuaJIT. Las \"consolas de fantasía\" también son tema de conversación."
    ],
    "points": 188,
    "commentCount": 45,
    "retryCount": 0,
    "time": 1694618401
  },
  {
    "id": 37500752,
    "title": "La Tierra supera seis de los nueve límites planetarios",
    "originLink": "https://www.science.org/doi/10.1126/sciadv.adh2458",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37500752",
    "commentBody": "",
    "originSummary": [
      "La actualización del marco de los límites planetarios revela que se han superado seis de los nueve límites, lo que sugiere que la Tierra se encuentra actualmente fuera del rango de seguridad para el funcionamiento humano.",
      "El texto introduce un concepto denominado \"entidades novedosas\" que podría alterar los límites centrales, y hace hincapié en la necesidad de transformaciones para mejorar los impactos de la producción y regular la demanda.",
      "Destaca el impacto de las actividades humanas en los ecosistemas oceánicos y terrestres, incluido el efecto de la deforestación y el cambio climático en las reservas de carbono y la temperatura global de la tierra, y subraya la necesidad urgente de actuar para evitar daños medioambientales irreversibles."
    ],
    "commentSummary": [
      "El pasaje debate el delicado equilibrio entre las preocupaciones medioambientales y los intereses económicos o de seguridad nacional, especialmente en el tema del cambio climático.",
      "Se discute el impacto del consumo de carne en el cambio climático, haciendo hincapié en la necesidad de una producción sostenible de alimentos y de adoptar dietas basadas en plantas.",
      "Las soluciones tecnológicas, el uso de fuentes de energía renovables y los efectos de las temperaturas extremas en las tasas de supervivencia también se abordan como posibles problemas y remedios en la gestión del medio ambiente."
    ],
    "points": 178,
    "commentCount": 147,
    "retryCount": 0,
    "time": 1694633765
  },
  {
    "id": 37502329,
    "title": "Premio Hutter a la compresión del conocimiento humano",
    "originLink": "http://prize.hutter1.net/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37502329",
    "commentBody": "",
    "originSummary": [
      "El Premio Hutter es un concurso que recompensa a los participantes por crear programas informáticos capaces de comprimir grandes archivos a tamaños más pequeños, con el objetivo de hacer avanzar la tecnología de compresión de datos.",
      "Los participantes deben enviar tanto sus archivos finales comprimidos como el código fuente para su evaluación, fomentando así la transparencia en el procesamiento.",
      "El artículo menciona a Alexander Rhatushnyak, ingeniero de software, que ha contribuido sustancialmente a los concursos de compresión de datos, mostrando a participantes de éxito para inspirar y guiar a los nuevos participantes."
    ],
    "commentSummary": [
      "El debate principal se centra en el papel de la compresión en la inteligencia general artificial (AGI), destacando el valor, las limitaciones y la correlación de la compresión con y sin pérdidas con la inteligencia.",
      "Se menciona el crecimiento y las implicaciones de la accesibilidad de la GPU en la investigación de la AGI, junto con algunas perspectivas históricas.",
      "La conversación termina con una referencia al proceso de solicitud del programa Winter 2024 de Y Combinator, un plan de financiación para empresas de nueva creación."
    ],
    "points": 175,
    "commentCount": 143,
    "retryCount": 0,
    "time": 1694642636
  },
  {
    "id": 37499375,
    "title": "Lantern: una base de datos vectorial PostgreSQL para crear aplicaciones de inteligencia artificial",
    "originLink": "https://docs.lantern.dev/blog/2023/09/13/hello-world",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37499375",
    "commentBody": "",
    "originSummary": [
      "Lantern es una extensión de base de datos vectorial para PostgreSQL destinada a apoyar el desarrollo de aplicaciones de IA, con capacidades como la generación de incrustaciones y la creación de índices paralelos.",
      "El proyecto se posiciona como una solución empresarial desarrollada sobre PostgreSQL, explotando su amplia base de usuarios y funcionalidades de almacenamiento de datos, y afirma superar a extensiones similares en métricas clave de rendimiento.",
      "Lantern es de código abierto y cuenta con una hoja de ruta de futuras funciones, como una variante basada en la nube, plantillas específicas del sector, control de versiones y soporte vectorial mejorado. El proyecto invita a la participación y las contribuciones de la comunidad."
    ],
    "commentSummary": [
      "Se ha lanzado Lantern, una nueva extensión de la base de datos vectorial PostgreSQL; cuenta con características avanzadas y métricas de rendimiento que superan las de extensiones similares.",
      "La extensión pretende mejorar el desarrollo de aplicaciones de IA y fomenta las contribuciones colaborativas. Los usuarios han expresado su preocupación por el rendimiento y las actualizaciones de los índices, lo que ha llevado a Lantern a planificar futuras optimizaciones.",
      "A pesar de ser ligeramente más rápido que pgvector y de mejorar el desarrollo de aplicaciones y la experiencia del usuario, Lantern ha suscitado preocupación por el uso intensivo de recursos. Lantern Cloud, su propia solución alojada, está prevista, aunque actualmente existe incompatibilidad con Supabase."
    ],
    "points": 171,
    "commentCount": 40,
    "retryCount": 0,
    "time": 1694626918
  },
  {
    "id": 37498830,
    "title": "SpaceX ya no acepta pérdidas para producir antenas de satélite Starlink",
    "originLink": "https://www.cnbc.com/2023/09/13/spacex-no-longer-taking-losses-to-produce-starlink-satellite-antennas.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37498830",
    "commentBody": "",
    "originSummary": [
      "SpaceX dejará de asumir el coste de las antenas Starlink vendidas con su servicio de Internet por satélite, como parte de una medida para mejorar la rentabilidad de la empresa.",
      "Las antenas Starlink para consumidores se venden a 599 dólares cada una, mientras que los precios para clientes de alta demanda pueden variar entre 2.500 y 150.000 dólares cada una.",
      "El éxito de SpaceX ha estado ligado a la reducción de los costes de producción de los terminales, cuya fabricación cuesta ahora menos de 600 dólares cada uno."
    ],
    "commentSummary": [
      "SpaceX ha conseguido reducir los costes de producción de las antenas de su satélite Starlink, lo que permite una expansión más rápida y unos servicios más asequibles tanto en zonas rurales como en regiones densamente pobladas.",
      "Aunque los ingresos de Starlink en 2022 no alcanzaron las previsiones, la empresa ha demostrado importantes avances en rendimiento y crecimiento, y se sigue debatiendo sobre los beneficios en densidad de la constelación Starlink y su posible expansión a los países en desarrollo.",
      "La reciente venta del hardware de Internet por satélite de la empresa a las zonas rurales canadienses y los avances previstos en el diseño de chips de radiofrecuencia, que podrían reducir aún más los costes de los sistemas de antena, apuntan a la posible mercantilización de la tecnología phased array."
    ],
    "points": 165,
    "commentCount": 173,
    "retryCount": 0,
    "time": 1694623727
  },
  {
    "id": 37495873,
    "title": "Contra el maximalismo del LLM",
    "originLink": "https://explosion.ai/blog/against-llm-maximalism/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37495873",
    "commentBody": "",
    "originSummary": [
      "El artículo aborda las dificultades que plantea la utilización eficiente de modelos lingüísticos de gran tamaño (LLM) en tareas de Procesamiento del Lenguaje Natural (PLN) y sugiere dividir la cuestión en componentes modulares con los LLM como uno de ellos.",
      "Se recomienda el uso del aprendizaje supervisado para determinadas tareas, y se reconoce que herramientas como spaCy y HF Transformers son beneficiosas para etiquetar datos y entrenar modelos de PNL.",
      "El autor también señala la utilidad de Prodigy, una herramienta de anotación, para los flujos de trabajo asistidos por modelos y concluye subrayando la importancia de las políticas específicas por encima de las amplias capacidades de razonamiento o los conocimientos previos para las tareas prácticas."
    ],
    "commentSummary": [
      "El artículo hace hincapié en la integración de grandes modelos lingüísticos (LLM) con tareas de procesamiento del lenguaje natural (PLN) para la creación o el aumento de conjuntos de datos con el fin de potenciar los modelos supervisados, en lugar de depender únicamente de los LLM.",
      "Detalla las limitaciones de la infraestructura actual de la PNL y las ventajas prospectivas de emplear LLM para tareas eficaces de representación y clasificación de textos. El aprendizaje por transferencia y los modelos más pequeños pueden mejorar la precisión y mitigar el retraso.",
      "El debate se extiende a la importancia de evaluar los componentes del aprendizaje automático, la dificultad asociada al mismo y las posibles implicaciones y contras de la IA y las tecnologías Web3."
    ],
    "points": 163,
    "commentCount": 62,
    "retryCount": 0,
    "time": 1694608342
  },
  {
    "id": 37498820,
    "title": "Soporte WASI en Go",
    "originLink": "https://go.dev/blog/wasi",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37498820",
    "commentBody": "",
    "originSummary": [
      "Go 1.21 ha introducido un nuevo puerto para la API syscall WebAssembly System Interface (WASI) a través del nuevo valor GOOS, wasip1. Esto permite a los desarrolladores ejecutar código Go compilado en WebAssembly directamente, sin necesidad de un entorno de ejecución JavaScript.",
      "A pesar de los avances, existen limitaciones, como la ausencia de soporte para sockets de red en la API wasip1. Sin embargo, se pueden utilizar extensiones de hosts como Wasmer y WasmEdge y una biblioteca de terceros, stealthrocket/net, para la funcionalidad de red.",
      "En el futuro, Go podrá exportar funciones Go a WebAssembly y será compatible con la API WASI, en constante evolución. Para ello, los desarrolladores disponen de canales como Gophers Slack y Go issue tracker."
    ],
    "commentSummary": [
      "La conversación de GoHacker News gira en torno a la introducción de la compatibilidad con WASI en el lenguaje de programación Go, abordando obstáculos como la exportación de funciones WebAssembly, el rendimiento y el tamaño binario.",
      "Los participantes en el debate sugieren mejoras para el rendimiento de WebAssembly de Go, estableciendo comparaciones con Rust y .NET, al tiempo que subrayan las ventajas de utilizar WebAssembly y WASI para optimizar las aplicaciones Go.",
      "A pesar de la preocupación por las vulnerabilidades de seguridad al utilizar WebAssembly para plugins y aplicaciones de escritorio, los participantes perciben en general WebAssembly (WASM) como una herramienta para facilitar la interoperabilidad del código y minimizar la dependencia del hardware y los sistemas operativos."
    ],
    "points": 162,
    "commentCount": 45,
    "retryCount": 0,
    "time": 1694622430
  },
  {
    "id": 37499731,
    "title": "Unity eliminó silenciosamente la cláusula que le permitía utilizar el TOS de la versión con la que venía",
    "originLink": "https://old.reddit.com/r/gamedev/comments/16hnibp/unity_silently_removed_their_github_repo_to_track/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37499731",
    "commentBody": "",
    "originSummary": [
      "Unity, una plataforma de desarrollo de juegos muy utilizada, se enfrentó a críticas por eliminar discretamente un repositorio de GitHub que supervisaba los cambios en sus condiciones de servicio.",
      "Los usuarios expresan su preocupación por la transparencia de la plataforma, temiendo aumentos encubiertos de las tarifas, lo que genera dudas sobre la fiabilidad de Unity y posibles ramificaciones legales.",
      "Hay debates en curso sobre los problemas de gestión de Unity, su posible colapso, el impacto en los usuarios y la comunidad de jugadores, y el descontento con las alteraciones de las licencias y las tarifas."
    ],
    "commentSummary": [
      "Unity, una plataforma de desarrollo de juegos, ha alterado sutilmente sus condiciones de servicio, lo que lleva a cobrar a los usuarios por la instalación de productos y nuevas cuotas, incluso si dejan de utilizar Unity para futuros proyectos.",
      "Estos cambios han generado malestar y desconfianza entre los usuarios, que los consideran injustos y mal concebidos, y preocupación por las tarifas de instalación múltiple y los cargos retroactivos.",
      "El debate se extiende a los retos de los productos abiertos y gratuitos respaldados por empresas comerciales, la lucha de Unity por generar ingresos y las dudas sobre la transparencia y la situación financiera de su modelo de negocio."
    ],
    "points": 143,
    "commentCount": 54,
    "retryCount": 0,
    "time": 1694628583
  },
  {
    "id": 37503351,
    "title": "Desarrollo de juegos después de la Unidad",
    "originLink": "https://www.computerenhance.com/p/game-development-post-unity",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37503351",
    "commentBody": "",
    "originSummary": [
      "Unity, un motor de desarrollo de juegos muy utilizado, está revisando sus condiciones de licencia para aplicar un notable canon por unidad, lo que suscita preocupación en la comunidad de desarrolladores.",
      "Este cambio en las condiciones de licencia de Unity está llevando a algunos desarrolladores a plantearse la transición a otros motores, como Godot, Unreal, Defold y RayLib, cada uno de los cuales ofrece distintas características, facilidad de uso y compatibilidad con lenguajes de scripting.",
      "Casey Muratori está recabando la opinión de los desarrolladores sobre sus experiencias con estos motores alternativos para facilitar la toma de decisiones con conocimiento de causa."
    ],
    "commentSummary": [
      "El debate en los círculos de desarrollo de juegos gira en torno a motores como Unity, Unreal Engine, Godot y Blender. El giro de Unity hacia la generación de ingresos a través de la publicidad es criticado por problemas de estabilidad y dependencia de los desarrolladores.",
      "Godot se destaca como una alternativa potencial, pero lucha por competir con el sólido ecosistema de Unity. La comparación y el debate se extienden a la popularidad y los modelos de precios de Unity, Unreal Engine y el uso de Blender en la industria de los juegos independientes.",
      "También se habla del declive del motor de juegos Blender, del uso de Python en el desarrollo de juegos y de la preocupación por la estructura de derechos de Unity. También se explora la defensa de un modelo de reparto de ingresos similar al de Unreal."
    ],
    "points": 134,
    "commentCount": 127,
    "retryCount": 0,
    "time": 1694650747
  },
  {
    "id": 37502892,
    "title": "Los artistas de efectos visuales de Marvel votan unánimemente a favor del sindicato",
    "originLink": "https://www.cnbc.com/2023/09/13/marvel-vfx-artists-unanimously-vote-to-unionize.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37502892",
    "commentBody": "",
    "originSummary": [
      "Los artistas de efectos visuales (VFX) de Marvel Studios han votado unánimemente a favor de sindicarse con la International Alliance of Theatrical Stage Employees (IATSE), una primicia para un equipo centrado exclusivamente en los VFX.",
      "Este movimiento hacia la sindicalización surge en medio de dos huelgas laborales de guionistas y actores de Hollywood. Los artistas esperan negociar un salario justo, prestaciones sanitarias y un entorno laboral seguro en respuesta al aumento de la carga de trabajo y los estrictos plazos de entrega.",
      "Una vez ratificada la sindicación, los trabajadores de VFX iniciarán negociaciones colectivas con Marvel Studios, aunque las negociaciones en curso con otros grupos sindicales pueden retrasarlas."
    ],
    "commentSummary": [
      "Los artistas de efectos visuales que trabajan para Marvel han decidido por unanimidad formar un sindicato.",
      "Esta noticia ha suscitado conversaciones en Hacker News, un sitio web de noticias sociales centrado en la tecnología y el espíritu empresarial."
    ],
    "points": 133,
    "commentCount": 3,
    "retryCount": 0,
    "time": 1694646843
  }
]
