[
  {
    "id": 37498979,
    "title": "Το σφάλμα στο macOS 14 Sonoma εμποδίζει την εφαρμογή μας να λειτουργήσει",
    "originLink": "https://mullvad.net/en/blog/2023/9/13/bug-in-macos-14-sonoma-prevents-our-app-from-working/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37498979",
    "commentBody": "",
    "originSummary": [
      "Η εφαρμογή Mullvad VPN αντιμετωπίζει επί του παρόντος προβλήματα συμβατότητας με το macOS 14 Sonoma λόγω ενός σφάλματος τείχους προστασίας που διαταράσσει το σωστό φιλτράρισμα της κυκλοφορίας.",
      "Αυτό το σφάλμα μπορεί να οδηγήσει σε διαρροές κάτω από συγκεκριμένες ρυθμίσεις, αποτελώντας πιθανό κίνδυνο για την ασφάλεια των χρηστών.",
      "Παρόλο που το πρόβλημα έχει αναφερθεί στην Apple, δεν υπάρχει ακόμη λύση.Ως εκ τούτου, συνιστάται στους χρήστες να παραμείνουν στο macOS 13 Ventura μέχρι να παρουσιαστεί η λύση."
    ],
    "commentSummary": [
      "Οι χρήστες αντιμετωπίζουν προβλήματα με τις λειτουργίες δικτύωσης της έκδοσης macOS 14 Sonoma beta, πιθανώς λόγω ενός σφάλματος στο τείχος προστασίας του macOS.",
      "Υπάρχει μια συζήτηση γύρω από πιθανές διορθωτικές λύσεις και εναλλακτικές υπηρεσίες VPN για την αποκατάσταση του προβλήματος, που δείχνει τη δυσαρέσκεια με τη σταθερότητα και τη χρηστικότητα του macOS και την κλειστή προσέγγιση της Apple.",
      "Οι χρήστες αμφισβητούν τη χρησιμότητα της αναφοράς σφαλμάτων στην Apple, υποδεικνύοντας ζητήματα με τη σουίτα δοκιμών και τον χειρισμό των ανατροφοδοτήσεων των χρηστών."
    ],
    "points": 919,
    "commentCount": 208,
    "retryCount": 0,
    "time": 1694624744
  },
  {
    "id": 37496589,
    "title": "Το τηλέφωνο του συνιδρυτή της Meduza μολύνθηκε με το Pegasus",
    "originLink": "https://meduza.io/en/feature/2023/09/13/the-million-dollar-reporter",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37496589",
    "commentBody": "",
    "originSummary": [
      "Η Galina Timchenko, συνιδρύτρια και εκδότρια του ρωσικού ειδησεογραφικού πρακτορείου Meduza, έγινε η πρώτη Ρωσίδα δημοσιογράφος που αναφέρθηκε ότι μολύνθηκε από το spyware Pegasus, το οποίο αναπτύχθηκε από την NSO Group.",
      "Η κυβέρνηση Μπάιντεν έβαλε τον όμιλο NSO στη μαύρη λίστα το 2021, αποκλείοντάς του την πρόσβαση σε αμερικανικές τεχνολογίες λόγω ανησυχιών σχετικά με την κατάχρηση και τη ρυθμιστική εποπτεία.",
      "Η Meduza, η Access Now και το Citizen Lab διερεύνησαν από κοινού το περιστατικό, αποκαλύπτοντας την εκτεταμένη κατάχρηση του Pegasus και ενισχύοντας τις ανησυχίες σχετικά με την κυβερνητική επιτήρηση και τη στοχοποίηση δημοσιογράφων, αντιπάλων και ακτιβιστών."
    ],
    "commentSummary": [
      "Τα θέματα της συζήτησης περιλαμβάνουν τη χρήση του κατασκοπευτικού λογισμικού Pegasus εναντίον δημοσιογράφων, τα τρωτά σημεία διαφόρων λειτουργικών συστημάτων, τις ανησυχίες για κρατικές ενέργειες hacking και τη δυσκολία εύρεσης αμερόληπτων πηγών ειδήσεων.",
      "Γίνεται συζήτηση σχετικά με την αποτελεσματικότητα των μέτρων ασφαλείας και τις διαφορετικές προσεγγίσεις στην κατανάλωση ειδήσεων, παράλληλα με επικρίσεις προς τα μέσα ενημέρωσης για μεροληψία και έλλειψη λογοδοσίας.",
      "Οι αναφορές σε γεωπολιτικές καταστάσεις, συμπεριλαμβανομένου του ρόλου των δυτικών κρατών στην ουκρανική σύγκρουση, αναδεικνύουν το ευρύτερο πλαίσιο και τις επιπτώσεις για τους τομείς της τεχνολογίας και της πληροφορικής."
    ],
    "points": 393,
    "commentCount": 240,
    "retryCount": 0,
    "time": 1694612357
  },
  {
    "id": 37501231,
    "title": "Μην τα βάζεις με μια ιδιοφυΐα (2010)",
    "originLink": "https://shreevatsa.wordpress.com/2010/06/04/dont-mess-with-a-genius/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37501231",
    "commentBody": "",
    "originSummary": [
      "Το κείμενο υπογραμμίζει τη θητεία του Ισαάκ Νεύτωνα ως Διευθυντή του Νομισματοκοπείου στην Αγγλία, όπου καταδίωξε ενεργά τους παραχαράκτες.",
      "Δίνει έμφαση στις επιτυχημένες προσπάθειές του να συλλάβει πολλούς παραχαράκτες, με ιδιαίτερη έμφαση στην αρχέγονη εχθρό του, τον William Chaloner.",
      "Η σημαντική συμβολή του Νεύτωνα στη Μεγάλη Ανακοστολόγηση σηματοδοτεί την αξιοσημείωτη συμβολή του στη διατήρηση της ακεραιότητας του νομίσματος."
    ],
    "commentSummary": [
      "Το νήμα συζήτησης του Hacker News παρέχει ποικίλες προοπτικές για τη ζωή του Ισαάκ Νεύτωνα, περιλαμβάνοντας τις συγκρούσεις του, τη σχέση του με την αλχημεία, τις σταυροφορίες κατά των παραχαράξεων και τη συμβολή του στον λογισμό.",
      "Οι συμμετέχοντες στο νήμα συζητούν για τον προσωπικό χαρακτήρα και την επιστημονική συνεισφορά του Νεύτωνα, με ορισμένους να επιδεικνύουν σκεπτικισμό και άλλους να υπερασπίζονται τη φήμη του.",
      "Το άρθρο αποκαλύπτει επίσης την ανθρώπινη πτυχή του Νεύτωνα, τονίζοντας τις γνωστικές μας προκαταλήψεις που μπορούν να οδηγήσουν ακόμη και πολύ έξυπνους ανθρώπους να πέσουν θύματα απάτης και χειραγώγησης."
    ],
    "points": 344,
    "commentCount": 87,
    "retryCount": 0,
    "time": 1694636490
  },
  {
    "id": 37498142,
    "title": "Ένα DIY φασματόμετρο εγγύς υπέρυθρης ακτινοβολίας",
    "originLink": "https://caoyuan.scripts.mit.edu/ir_spec.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37498142",
    "commentBody": "",
    "originSummary": [
      "Ο Yuan Cao ανέπτυξε ένα φιλικό προς τον προϋπολογισμό do-it-yourself (DIY) φασματόμετρο εγγύς υπέρυθρης ακτινοβολίας (near-IR) με ανάλυση 6 nm.",
      "Το φασματόμετρο λειτουργεί χρησιμοποιώντας ένα πλέγμα περίθλασης και φωτοδιόδους μεταξύ άλλων εξαρτημάτων- μετρά τη φασματική ανάλυση και το μήκος κύματος του φωτός.",
      "Εκτός από τις προκλήσεις που σχετίζονται με τη μείωση του θορύβου και τις παρεμβολές, ο Cao μιλάει επίσης για τη βαθμονόμηση, το δυναμικό εύρος του φασματόμετρου και τη μέτρηση των φασμάτων μετάδοσης. Μπορεί να αποκαλύψουν περισσότερα φάσματα στο μέλλον."
    ],
    "commentSummary": [
      "Ένα άτομο ανέπτυξε ένα χαμηλού κόστους αυτοσχέδιο φασματόμετρο εγγύς υπέρυθρου, με πιθανή χρήση σε διάφορους τομείς.",
      "Ο δημιουργός επιθυμεί να κατασκευάσει οικονομικά προσιτά φασματόμετρα για τις χώρες του τρίτου κόσμου, με στόχο να βοηθήσει στον εντοπισμό πλαστών φαρμάκων.",
      "Το κείμενο υπογραμμίζει τις προκλήσεις στη βαθμονόμηση και την πιστοποίηση αυτών των οργάνων και υπογραμμίζει την έλλειψη αξιόπιστων άρθρων σε πλατφόρμες όπως το Hacker News."
    ],
    "points": 339,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1694619208
  },
  {
    "id": 37500895,
    "title": "Όταν η MFA δεν είναι MFA, ή πώς μας έπιασαν phished",
    "originLink": "https://retool.com/blog/mfa-isnt-mfa/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37500895",
    "commentBody": "",
    "originSummary": [
      "Η Retool, μια πλατφόρμα για τη δημιουργία εσωτερικών εργαλείων, αντιμετώπισε μια επίθεση spear phishing που οδήγησε σε μη εξουσιοδοτημένη πρόσβαση σε 27 λογαριασμούς πελατών cloud, αποκαλύπτοντας την ευπάθεια του συστήματος σε επιθέσεις κοινωνικής μηχανικής.",
      "Η επίθεση έλαβε χώρα όταν ένας υπάλληλος υπέκυψε σε μια επίθεση ηλεκτρονικού \"ψαρέματος\" μέσω SMS και παρείχε κωδικούς ελέγχου ταυτότητας πολλαπλών παραγόντων (MFA), οι οποίοι στη συνέχεια έθεσαν σε κίνδυνο το VPN και τα εσωτερικά συστήματα διαχείρισης της εταιρείας.",
      "Η Retool συνιστά τη βελτίωση της ασφάλειας, όπως η αποφυγή της αποθήκευσης των κωδικών MFA στο cloud, η προώθηση της εκπαίδευσης των εργαζομένων και η χρήση κλειδιών ασφαλείας υλικού για MFA, καθώς και η υιοθέτηση στρατηγικών άμυνας σε βάθος. Η εταιρεία συνεργάζεται τώρα με τις αρχές επιβολής του νόμου και μια εταιρεία εγκληματολογικών ερευνών για να διερευνήσει το περιστατικό."
    ],
    "commentSummary": [
      "Η συζήτηση στο Hacker News περιλαμβάνει πτυχές όπως η προσοχή στις κλήσεις/μηνύματα που ζητούν προσωπικές πληροφορίες, η ανάγκη επικύρωσης της ταυτότητας του καλούντος και η ανάγκη για τυποποιημένα συστήματα αντίστροφης πιστοποίησης.",
      "Οι συμμετέχοντες συζητούν τα πλεονεκτήματα και τα όρια των διαφόρων μέτρων ασφαλείας, όπως η κρυπτογράφηση κωδικού πρόσβασης, ο έλεγχος ταυτότητας πολλαπλών παραγόντων και τα βιομετρικά στοιχεία, και μοιράζονται περιπτώσεις κακού χειρισμού θεμάτων απάτης.",
      "Θέματα όπως η χρήση της τεχνολογίας deepfake σε παραβιάσεις της ασφάλειας, η προστασία των ψηφιακών περιουσιακών στοιχείων και η γενική συμφωνία σχετικά με την απαίτηση για φιλικές προς τον χρήστη, ισχυρές λύσεις ασφάλειας αναλύονται επίσης λεπτομερώς."
    ],
    "points": 324,
    "commentCount": 232,
    "retryCount": 0,
    "time": 1694634512
  },
  {
    "id": 37502258,
    "title": "Μην χρησιμοποιείτε το Discord ως φόρουμ ερωτήσεων και απαντήσεων",
    "originLink": "https://kraktoos.com/posts/dont-use-discord-as-forum/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37502258",
    "commentBody": "",
    "originSummary": [
      "Ο συγγραφέας αποθαρρύνει τη χρήση του Discord ως φόρουμ ερωτήσεων και απαντήσεων (Q&A) για έργα, επικαλούμενος τη χαοτική φύση του, τις υποβαθμισμένες δυνατότητες αναζήτησης και ανακάλυψης και τον πιθανό κίνδυνο ασυνέχειας.",
      "Το κείμενο προτείνει καλύτερες εναλλακτικές λύσεις, όπως ειδικά κοινοτικά φόρουμ, αξιόπιστες ιστοσελίδες όπως το Stack Overflow ή το Reddit, και συστήματα παρακολούθησης ζητημάτων που βασίζονται στο Git.",
      "Ο συγγραφέας τονίζει τη σημασία της προσεκτικής επιλογής μιας πλατφόρμας για τους σκοπούς των ερωτήσεων και απαντήσεων, αναγνωρίζοντας τον αντίκτυπό της στην πρόοδο του έργου και την αλληλεπίδραση της κοινότητας."
    ],
    "commentSummary": [
      "Το κύριο επίκεντρο της συζήτησης είναι γύρω από τη χρήση του Discord ως φόρουμ ερωτήσεων και απαντήσεων, με τις απόψεις να διαφέρουν ως προς την αποτελεσματικότητά του σε σχέση με πλατφόρμες όπως το GitHub issues, τα ειδικά φόρουμ και οι λίστες αλληλογραφίας.",
      "Το Discord επαινείται για την ανεπίσημη και εύκολη χρήση του, αλλά επισημαίνονται οι περιορισμοί στη δυνατότητα αναζήτησης και οργάνωσης. Η επιλογή της πλατφόρμας εξαρτάται από τις ατομικές ανάγκες, όπως ο έλεγχος, το κόστος, η ευκολία εγκατάστασης και οι δημογραφικές τάσεις.",
      "Αναφέρθηκαν επίσης οι συζητήσεις σχετικά με την πιθανή απαξίωση των παραδοσιακών φόρουμ και των λιστών αλληλογραφίας και η δυνατότητα μιας πιο ολοκληρωμένης πλατφόρμας με μηχανές αναζήτησης με ευρετήριο, εμφωλευμένες απαντήσεις και φωνητική λειτουργία."
    ],
    "points": 322,
    "commentCount": 198,
    "retryCount": 0,
    "time": 1694642089
  },
  {
    "id": 37497345,
    "title": "Παραλείψτε το API, στείλτε τη βάση δεδομένων σας",
    "originLink": "https://fly.io/blog/skip-the-api/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37497345",
    "commentBody": "",
    "originSummary": [
      "Το LiteFS είναι μια παγκόσμια κατανεμημένη βάση δεδομένων SQLite, η οποία σχεδιάστηκε αρχικά για τη γεωγραφική κατανομή δεδομένων, εξασφαλίζοντας γρήγορους χρόνους απόκρισης.",
      "Ανακαλύφθηκε η νέα χρήση του LiteFS, που του επιτρέπει να αντικαταστήσει τα επίπεδα API μεταξύ των υπηρεσιών. Αυτό επιτυγχάνεται με τη διανομή της πλήρους βάσης δεδομένων στην πλευρά του πελάτη, επιτρέποντας την υποβολή ερωτημάτων SQL και την ένωση δεδομένων σύμφωνα με τις απαιτήσεις του πελάτη.",
      "Τα αντίγραφα είναι μόνο για ανάγνωση, καθιστώντας αναγκαία μια εφαρμογή API για ενημερώσεις δεδομένων. Αν και έχει ορισμένους περιορισμούς, αυτή η τεχνική μπορεί να είναι επωφελής σε περιπτώσεις όπου τα συμβατικά API είναι ανεπαρκή."
    ],
    "commentSummary": [
      "Το άρθρο διερευνά την έννοια της χρήσης των βάσεων δεδομένων ως API, περιγράφοντας τις πιθανές προκλήσεις και τα εμπόδια αυτής της μεθόδου.",
      "Η συζήτηση συνιστά τη χρήση συμβολαίων API και εργαλείων όπως οι προβολές και οι αποθηκευμένες διαδικασίες για τη διαχείριση αλλαγών σε συστήματα λογισμικού. Εξετάζονται επίσης θέματα όπως η βιωσιμότητα της λήψης ολόκληρων βάσεων δεδομένων κατά την αρχική φόρτωση της σελίδας, οι δυσκολίες στην εφαρμογή ενός μοντέλου βάσεων δεδομένων ανά χρήστη και το ζήτημα της ανεντιμότητας των προμηθευτών στο serverless computing.",
      "Έμφαση δίνεται στα πλεονεκτήματα και τα μειονεκτήματα της χρήσης βάσεων δεδομένων ως API, συμπεριλαμβανομένης της πρακτικής της χρήσης προβολών και μετονομασίας πινάκων στην PostgreSQL για τροποποιήσεις σχήματος."
    ],
    "points": 234,
    "commentCount": 162,
    "retryCount": 0,
    "time": 1694615875
  },
  {
    "id": 37499106,
    "title": "Η αχρηστία της φαινυλεφρίνης (2022)",
    "originLink": "https://www.science.org/content/blog-post/uselessness-phenylephrine",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37499106",
    "commentBody": "",
    "originSummary": [
      "Ο συγγραφέας αναφέρει ότι η φαινυλεφρίνη είναι λιγότερο αποτελεσματικό αποσυμφορητικό σε σύγκριση με την ψευδοεφεδρίνη, δεδομένου του εκτεταμένου μεταβολισμού της στο σώμα.",
      "Η φαινυλεφρίνη φέρεται να πωλείται ως εναλλακτική λύση στην ψευδοεφεδρίνη, λόγω των περιορισμών που έχουν επιβληθεί στην ψευδοεφεδρίνη για την πιθανή χρήση της στην παράνομη παραγωγή μεθαμφεταμίνης.",
      "Το άρθρο καταλήγει με μια σύσταση προς τον FDA να επανεξετάσει την πώληση της φαινυλεφρίνης, υποδεικνύοντας ότι δεν δικαιολογεί την τρέχουσα καταχώρισή της."
    ],
    "commentSummary": [
      "Η συζήτηση διερευνά θέματα όπως η ρύθμιση των ναρκωτικών, ο εθισμός, η παραγωγή μεθαμφεταμίνης και η αποτελεσματικότητα των διαφόρων φαρμάκων, συμπεριλαμβανομένων των αποσυμφορητικών.",
      "Συζητούνται επίσης θέματα όπως ο αντίκτυπος των κανονισμών στη διαθεσιμότητα των φαρμάκων, ο ρόλος της επιβολής του νόμου, οι κοινωνικές παρεμβάσεις, οι ανησυχίες για την προστασία της ιδιωτικής ζωής και οι περιορισμοί των φαρμακευτικών φαρμάκων.",
      "Επισημαίνονται παράγοντες όπως το φαινόμενο placebo, οι αλλαγές στον τρόπο ζωής και οι ατομικές αντιδράσεις στη φαρμακευτική αγωγή, οι οποίες αναδεικνύουν την πολυπλοκότητα και τις προκλήσεις που σχετίζονται με τη ρύθμιση των φαρμάκων και τη δραστικότητα των φαρμάκων."
    ],
    "points": 221,
    "commentCount": 320,
    "retryCount": 0,
    "time": 1694625447
  },
  {
    "id": 37497131,
    "title": "Γιατί μάραθο;",
    "originLink": "https://fennel-lang.org/rationale",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37497131",
    "commentBody": "",
    "originSummary": [
      "Η Fennel είναι μια γλώσσα προγραμματισμού βασισμένη στο περιβάλλον εκτέλεσης της Lua, με στόχο να προσφέρει ένα απλούστερο και πιο συνοπτικό συντακτικό, αφαιρώντας τις πολυπλοκότητες που υπάρχουν στη Lua.",
      "Η γλώσσα αυτή βελτιώνει στοιχεία όπως η διαχείριση παγκόσμιων μεταβλητών, οι πίνακες, οι βρόχοι, οι συναρτήσεις και εισάγει χαρακτηριστικά όπως η αντιστοίχιση προτύπων και η αποδόμηση δομών δεδομένων.",
      "Η Fennel είναι συμβατή με τις υπάρχουσες βιβλιοθήκες και εργαλεία Lua και ενσωματώνει ένα σύστημα μακροεντολών για την επέκταση της γλώσσας με νέες συντακτικές μορφές."
    ],
    "commentSummary": [
      "Η δημοσίευση επικεντρώνεται στη χρήση της Fennel, μιας γλώσσας προγραμματισμού, στις διαμορφώσεις Neovim και Hammerspoon, η οποία εκτιμάται για τη συντομία και την ανώτερη εργονομία της σε σχέση με τη Lua.",
      "Γίνονται συγκρίσεις μεταξύ της Lua και άλλων γλωσσών που μεταγλωττίζονται σε Lua, όπως η Moonscript και η Yuescript, τονίζοντας τα πλεονεκτήματα των ελέγχων αρτιότητας της Fennel που δεν διαθέτει η Lua.",
      "Θίγει το θέμα της εσοχής έναντι των γλωσσών που βασίζονται σε διαχωριστικά και την πρακτική χρήση της Lua σε διάφορα πλαίσια, και περιλαμβάνει αναφορές στον ιστότοπο του Fennel και την τρέχουσα διαθεσιμότητα αιτήσεων για το YC Winter 2024."
    ],
    "points": 218,
    "commentCount": 88,
    "retryCount": 0,
    "time": 1694614905
  },
  {
    "id": 37498473,
    "title": "Το εφετείο υποστηρίζει το δικαίωμα ανάρτησης δημόσιων νόμων στο διαδίκτυο",
    "originLink": "https://www.eff.org/press/releases/appeals-court-upholds-publicresourceorgs-right-post-public-laws-and-regulations",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37498473",
    "commentBody": "",
    "originSummary": [
      "Ένα ομοσπονδιακό εφετείο έκρινε ότι τα τεχνικά πρότυπα που ενσωματώνονται στο δημόσιο δίκαιο μπορούν να κοινοποιούνται χωρίς να υπάρχει κίνδυνος παραβίασης πνευματικών δικαιωμάτων, αντικατοπτρίζοντας την άποψη ότι οι νόμοι ανήκουν σε όλους και πρέπει να είναι προσβάσιμοι δωρεάν και χωρίς εγγραφή.",
      "Η υπόθεση κινήθηκε από τη μη κερδοσκοπική οργάνωση Public.Resource.org, η οποία εκπροσωπείται από το Electronic Frontier Foundation, κατά ιδιωτικών φορέων που δημιουργούν κώδικες και πρότυπα.",
      "Το δικαστήριο αποφάνθηκε υπέρ του Public.Resource.org, χαρακτηρίζοντάς το ως θρίαμβο για τη δημόσια πρόσβαση στους νόμους, κυρίως λόγω του μη κερδοσκοπικού, εκπαιδευτικού χαρακτήρα της χρήσης των προτύπων."
    ],
    "commentSummary": [
      "Εφετείο αποφάσισε ότι η δημοσίευση δημόσιων νόμων στο διαδίκτυο δεν παραβιάζει τα πνευματικά δικαιώματα και θεωρείται θεμιτή χρήση.",
      "Η υπόθεση αυτή ευαισθητοποιεί σχετικά με την απρόσιτη νομοθεσία και τα ερωτήματα σχετικά με την προστασία των πνευματικών δικαιωμάτων, προβάλλοντας περιπτώσεις νόμων περί πνευματικών δικαιωμάτων που απαιτούν πληρωμή για την πρόσβαση.",
      "Η συζήτηση περιλαμβάνει επίσης την ενσωμάτωση ιδιωτικών προτύπων στους νόμους χωρίς αποζημίωση και υπογραμμίζει τις διαφορετικές πρακτικές των διαφόρων χωρών όσον αφορά τη διαθεσιμότητα νομικών κειμένων και προτύπων."
    ],
    "points": 192,
    "commentCount": 58,
    "retryCount": 0,
    "time": 1694620798
  },
  {
    "id": 37497956,
    "title": "Bitty Engine: Μια μικρή μηχανή παιχνιδιού",
    "originLink": "https://paladin-t.github.io/bitty/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37497956",
    "commentBody": "",
    "originSummary": [
      "Το Bitty Engine είναι μια μηχανή παιχνιδιών πολλαπλών πλατφορμών με ενσωματωμένους επεξεργαστές, που επιτρέπει φιλικό προς το χρήστη προγραμματισμό σε Lua, συνοδευόμενο από χαρακτηριστικά όπως έναν αποσφαλματωτή, τεκμηρίωση API και διάφορα εργαλεία επεξεργασίας.",
      "Με δυνατότητα δημιουργίας αυτόνομων δυαδικών αρχείων, η μηχανή μπορεί να χρησιμοποιηθεί τόσο για μη εμπορικούς όσο και για εμπορικούς σκοπούς. Είναι διαθέσιμη για πλατφόρμες όπως Windows 7, MacOS 10.7 ή Ubuntu 14, με χαμηλές απαιτήσεις συστήματος.",
      "Η Bitty Engine, που διανέμεται στο Steam και το Itch, είναι πανομοιότυπη όσον αφορά τα χαρακτηριστικά και στις δύο πλατφόρμες, ενώ μια δοκιμαστική έκδοση είναι διαθέσιμη στο Steam."
    ],
    "commentSummary": [
      "Το άρθρο υπογραμμίζει τον ενθουσιασμό γύρω από την πρόσφατη κυκλοφορία της Bitty Engine, με τη συζήτηση να επικεντρώνεται σε συμβουλές για την ανάπτυξη παιχνιδιών και μηχανών και την εφαρμογή της JavaScript/TypeScript σε μηχανές παιχνιδιών.",
      "Συζητούνται επίσης οι δυνατότητες των φυσικών παιχνιδιών με ενσωματωμένους υπολογιστές και η αυξανόμενη δημοτικότητα της Lua στην ανάπτυξη παιχνιδιών.",
      "Υπογραμμίζονται τα βασικά πλεονεκτήματα της Lua, όπως η εύκολη ενσωμάτωση σε βάσεις κώδικα, η απλότητα εκμάθησης, η συμβατότητα με τις μηχανές C και C++, καθώς και η εναλλακτική λύση LuaJIT υψηλής απόδοσης. Οι \"κονσόλες φαντασίας\" είναι επίσης ένα θέμα συζήτησης."
    ],
    "points": 188,
    "commentCount": 45,
    "retryCount": 0,
    "time": 1694618401
  },
  {
    "id": 37500752,
    "title": "Η Γη πέρα από τα έξι από τα εννέα πλανητικά όρια",
    "originLink": "https://www.science.org/doi/10.1126/sciadv.adh2458",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37500752",
    "commentBody": "",
    "originSummary": [
      "Η επικαιροποίηση του πλαισίου των πλανητικών ορίων αποκαλύπτει ότι έξι από τα εννέα όρια έχουν ξεπεραστεί, γεγονός που υποδηλώνει ότι η Γη βρίσκεται σήμερα εκτός της ασφαλούς περιοχής για την ανθρώπινη λειτουργία.",
      "Το κείμενο εισάγει μια έννοια που ονομάζεται \"νέες οντότητες\", οι οποίες θα μπορούσαν δυνητικά να διαταράξουν τα βασικά όρια, και τονίζει την ανάγκη μετασχηματισμών για την ενίσχυση των επιπτώσεων της παραγωγής και τη ρύθμιση της ζήτησης.",
      "Επισημαίνει τις επιπτώσεις των ανθρώπινων δραστηριοτήτων στα ωκεάνια και τα χερσαία οικοσυστήματα, συμπεριλαμβανομένων των επιπτώσεων της αποψίλωσης των δασών και της κλιματικής αλλαγής στα αποθέματα άνθρακα και στη θερμοκρασία του πλανήτη, και υπογραμμίζει την επείγουσα ανάγκη για ανάληψη δράσης για την πρόληψη μη αναστρέψιμων περιβαλλοντικών ζημιών."
    ],
    "commentSummary": [
      "Το κείμενο συζητά τη λεπτή ισορροπία μεταξύ των περιβαλλοντικών ανησυχιών και των οικονομικών συμφερόντων ή των συμφερόντων εθνικής ασφάλειας, ιδίως στο θέμα της κλιματικής αλλαγής.",
      "Συζητείται ο αντίκτυπος της κατανάλωσης κρέατος στην κλιματική αλλαγή, τονίζοντας την ανάγκη για βιώσιμη παραγωγή τροφίμων και υιοθέτηση φυτικής διατροφής.",
      "Οι τεχνολογικές λύσεις, η χρήση ανανεώσιμων πηγών ενέργειας και οι επιπτώσεις των ακραίων θερμοκρασιών στα ποσοστά επιβίωσης καλύπτονται επίσης ως πιθανά ζητήματα και διορθωτικά μέτρα στη διαχείριση του περιβάλλοντος."
    ],
    "points": 178,
    "commentCount": 147,
    "retryCount": 0,
    "time": 1694633765
  },
  {
    "id": 37502329,
    "title": "Βραβείο Hutter για τη συμπίεση της ανθρώπινης γνώσης",
    "originLink": "http://prize.hutter1.net/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37502329",
    "commentBody": "",
    "originSummary": [
      "Το βραβείο Hutter είναι ένας διαγωνισμός που επιβραβεύει τους συμμετέχοντες για τη δημιουργία λογισμικού που μπορεί να συμπιέσει μεγάλα αρχεία σε μικρότερα μεγέθη, με στόχο την προώθηση της τεχνολογίας συμπίεσης δεδομένων.",
      "Οι συμμετέχοντες υποχρεούνται να υποβάλουν τόσο τα τελικά συμπιεσμένα αρχεία όσο και τον πηγαίο κώδικα για αξιολόγηση, προωθώντας τη διαφάνεια στην επεξεργασία.",
      "Το άρθρο αναφέρει τον Alexander Rhatushnyak, μηχανικό λογισμικού, ο οποίος έχει συμβάλει ουσιαστικά στους διαγωνισμούς συμπίεσης δεδομένων, παρουσιάζοντας επιτυχημένους συμμετέχοντες για να εμπνεύσει και να καθοδηγήσει τους νέους συμμετέχοντες."
    ],
    "commentSummary": [
      "Η κύρια συζήτηση επικεντρώνεται στο ρόλο της συμπίεσης στην τεχνητή γενική νοημοσύνη (AGI), τονίζοντας την αξία, τους περιορισμούς και τη συσχέτιση της συμπίεσης χωρίς απώλειες και με απώλειες με τη νοημοσύνη.",
      "Υπάρχει αναφορά στην ανάπτυξη και τις επιπτώσεις της προσβασιμότητας των GPU στην έρευνα AGI, μαζί με κάποιες ιστορικές προοπτικές.",
      "Η συζήτηση ολοκληρώνεται με μια αναφορά στη διαδικασία υποβολής αιτήσεων για το πρόγραμμα Winter 2024 του Y Combinator, ένα πρόγραμμα χρηματοδότησης για νεοφυείς επιχειρήσεις."
    ],
    "points": 175,
    "commentCount": 143,
    "retryCount": 0,
    "time": 1694642636
  },
  {
    "id": 37499375,
    "title": "Lantern - μια διανυσματική βάση δεδομένων PostgreSQL για τη δημιουργία εφαρμογών τεχνητής νοημοσύνης",
    "originLink": "https://docs.lantern.dev/blog/2023/09/13/hello-world",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37499375",
    "commentBody": "",
    "originSummary": [
      "Το Lantern είναι μια επέκταση διανυσματικής βάσης δεδομένων για την PostgreSQL που στοχεύει στην υποστήριξη της ανάπτυξης εφαρμογών τεχνητής νοημοσύνης, με δυνατότητες όπως η δημιουργία ενσωματώσεων και η παράλληλη δημιουργία ευρετηρίων.",
      "Το έργο αυτοτοποθετείται ως μια επιχειρησιακή λύση που αναπτύσσεται πάνω στην PostgreSQL, αξιοποιώντας την εκτεταμένη βάση χρηστών και τις λειτουργίες αποθήκευσης δεδομένων της, και ισχυρίζεται ότι ξεπερνά παρόμοιες επεκτάσεις σε βασικές μετρήσεις επιδόσεων.",
      "Το Lantern είναι ανοικτού κώδικα με χάρτη πορείας μελλοντικών χαρακτηριστικών που περιλαμβάνουν μια παραλλαγή βασισμένη στο σύννεφο, πρότυπα ειδικά για τη βιομηχανία, έλεγχο εκδόσεων και βελτιωμένη υποστήριξη διανυσμάτων. Το έργο προσκαλεί τη συμμετοχή και τις συνεισφορές της κοινότητας."
    ],
    "commentSummary": [
      "Το Lantern, μια νέα επέκταση της διανυσματικής βάσης δεδομένων PostgreSQL, έχει κυκλοφορήσει.Διαθέτει προηγμένα χαρακτηριστικά και μετρήσεις επιδόσεων που ξεπερνούν εκείνες παρόμοιων επεκτάσεων.",
      "Η επέκταση αποσκοπεί στη βελτίωση της ανάπτυξης εφαρμογών τεχνητής νοημοσύνης και ενθαρρύνει τις συνεργατικές συνεισφορές. Οι χρήστες έχουν εκφράσει ανησυχίες σχετικά με τις επιδόσεις και τις ενημερώσεις ευρετηρίων, οδηγώντας το Lantern να σχεδιάσει μελλοντικές βελτιστοποιήσεις.",
      "Παρά το γεγονός ότι είναι ελαφρώς ταχύτερο από το pgvector και βελτιώνει την ανάπτυξη εφαρμογών και την εμπειρία του χρήστη, το Lantern έχει προκαλέσει ανησυχίες σχετικά με την εντατική χρήση πόρων. Το Lantern Cloud, η δική τους φιλοξενούμενη λύση, έχει προγραμματιστεί, παρόλο που επί του παρόντος υπάρχει ασυμβατότητα με το Supabase."
    ],
    "points": 171,
    "commentCount": 40,
    "retryCount": 0,
    "time": 1694626918
  },
  {
    "id": 37498830,
    "title": "Η SpaceX δεν δέχεται πλέον απώλειες για την παραγωγή δορυφορικών κεραιών Starlink",
    "originLink": "https://www.cnbc.com/2023/09/13/spacex-no-longer-taking-losses-to-produce-starlink-satellite-antennas.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37498830",
    "commentBody": "",
    "originSummary": [
      "Η SpaceX δεν θα επιβαρύνεται πλέον με το κόστος των κεραιών Starlink που πωλούνται με την υπηρεσία δορυφορικού Internet, στο πλαίσιο μιας κίνησης για την ενίσχυση της κερδοφορίας της εταιρείας.",
      "Οι καταναλωτικές κεραίες Starlink πωλούνται προς 599 δολάρια η καθεμία, ενώ οι τιμές για πελάτες υψηλής ζήτησης μπορεί να κυμαίνονται από 2.500 έως 150.000 δολάρια η καθεμία.",
      "Η επιτυχία της SpaceX συνδέεται με το μειωμένο κόστος παραγωγής των τερματικών, η κατασκευή των οποίων κοστίζει πλέον λιγότερο από 600 δολάρια το καθένα."
    ],
    "commentSummary": [
      "Η SpaceX κατάφερε να μειώσει το κόστος παραγωγής των δορυφορικών κεραιών Starlink, επιτρέποντας ταχύτερη επέκταση και πιο προσιτές υπηρεσίες τόσο σε αγροτικές όσο και σε πυκνοκατοικημένες περιοχές.",
      "Ενώ τα έσοδα της Starlink για το 2022 υπολείπονται των προβλέψεων, η εταιρεία έχει επιδείξει σημαντική πρόοδο στις επιδόσεις και την ανάπτυξη, και υπάρχει συνεχής συζήτηση σχετικά με τα οφέλη της πυκνότητας του αστερισμού Starlink και την πιθανή επέκτασή του σε αναπτυσσόμενες χώρες.",
      "Η πρόσφατη πώληση του υλικού δορυφορικού διαδικτύου της εταιρείας σε αγροτικούς Καναδούς και οι αναμενόμενες εξελίξεις στο σχεδιασμό τσιπ RF, που θα μπορούσαν να μειώσουν περαιτέρω το κόστος των κεραιοσυστημάτων, υποδηλώνουν την πιθανή εμπορευματοποίηση της τεχνολογίας φασικών συστοιχιών."
    ],
    "points": 165,
    "commentCount": 173,
    "retryCount": 0,
    "time": 1694623727
  },
  {
    "id": 37495873,
    "title": "Ενάντια στον μαξιμαλισμό LLM",
    "originLink": "https://explosion.ai/blog/against-llm-maximalism/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37495873",
    "commentBody": "",
    "originSummary": [
      "Το άρθρο ασχολείται με τις δυσκολίες της αποτελεσματικής αξιοποίησης των μεγάλων γλωσσικών μοντέλων (LLM) σε εργασίες επεξεργασίας φυσικής γλώσσας (NLP) και προτείνει τη διαίρεση του ζητήματος σε αρθρωτές συνιστώσες με τα LLM ως μία συνιστώσα.",
      "Η χρήση της μάθησης με επίβλεψη συνιστάται για συγκεκριμένες εργασίες και εργαλεία όπως το spaCy και το HF Transformers αναγνωρίζονται ως ευεργετικά για την επισήμανση δεδομένων και την εκπαίδευση μοντέλων NLP.",
      "Ο συγγραφέας σημειώνει επίσης τη χρησιμότητα του Prodigy, ενός εργαλείου σχολιασμού, για ροές εργασίας με τη βοήθεια μοντέλων και καταλήγει τονίζοντας τη σημασία των συγκεκριμένων πολιτικών έναντι των ευρέων συλλογιστικών ικανοτήτων ή της γνώσης υποβάθρου για πρακτικές εργασίες."
    ],
    "commentSummary": [
      "Το άρθρο δίνει έμφαση στην ενσωμάτωση των μεγάλων γλωσσικών μοντέλων (LLM) με εργασίες επεξεργασίας φυσικής γλώσσας (NLP) για τη δημιουργία συνόλων δεδομένων ή την ενίσχυση των εποπτευόμενων μοντέλων, αντί να βασίζεται αποκλειστικά σε LLM.",
      "Περιγράφει λεπτομερώς τους περιορισμούς της τρέχουσας υποδομής NLP και τα μελλοντικά πλεονεκτήματα της χρήσης των LLMs για την αποτελεσματική αναπαράσταση κειμένου και εργασίες ταξινόμησης. Η εκμάθηση μεταφοράς και τα μικρότερα μοντέλα μπορούν να ενισχύσουν την ακρίβεια και να μετριάσουν την καθυστέρηση.",
      "Η συζήτηση επεκτείνεται στη σημασία της αξιολόγησης των στοιχείων μηχανικής μάθησης, στις δυσκολίες που συνδέονται με αυτήν, καθώς και στις πιθανές επιπτώσεις και μειονεκτήματα της τεχνητής νοημοσύνης και των τεχνολογιών Web3."
    ],
    "points": 163,
    "commentCount": 62,
    "retryCount": 0,
    "time": 1694608342
  },
  {
    "id": 37498820,
    "title": "Υποστήριξη WASI στο Go",
    "originLink": "https://go.dev/blog/wasi",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37498820",
    "commentBody": "",
    "originSummary": [
      "Το Go 1.21 εισήγαγε μια νέα θύρα για το WebAssembly System Interface (WASI) syscall API μέσω της νέας τιμής GOOS, wasip1. Αυτό επιτρέπει στους προγραμματιστές να εκτελούν κώδικα Go που έχει μεταγλωττιστεί σε WebAssembly απευθείας, παρακάμπτοντας την ανάγκη για ένα περιβάλλον εκτέλεσης JavaScript.",
      "Παρά την πρόοδο, υπάρχουν περιορισμοί, όπως η απουσία υποστήριξης για υποδοχές δικτύου στο API του wasip1. Ωστόσο, οι επεκτάσεις από κεντρικούς υπολογιστές όπως οι Wasmer και WasmEdge και μια βιβλιοθήκη τρίτου μέρους, η stealthrocket/net, θα μπορούσαν να χρησιμοποιηθούν για τη λειτουργικότητα δικτύου.",
      "Οι μελλοντικές κατευθύνσεις για το Go περιλαμβάνουν την εξαγωγή συναρτήσεων Go στο WebAssembly και τη συμβατότητα με το εξελισσόμενο API WASI, ενώ οι προγραμματιστές έχουν κανάλια όπως το Gophers Slack και το Go issue tracker για να συνεισφέρουν."
    ],
    "commentSummary": [
      "Η συζήτηση στο GoHacker News περιστρέφεται γύρω από την εισαγωγή της υποστήριξης WASI στη γλώσσα προγραμματισμού Go, θίγοντας εμπόδια όπως η εξαγωγή συναρτήσεων WebAssembly, η απόδοση και το μέγεθος του δυαδικού αρχείου.",
      "Οι συμμετέχοντες στη συζήτηση προτείνουν βελτιώσεις για την απόδοση του WebAssembly της Go, κάνοντας συγκρίσεις με το Rust και το .NET, ενώ υπογραμμίζουν τα πλεονεκτήματα της χρήσης του WebAssembly και του WASI για τη βελτιστοποίηση των εφαρμογών Go.",
      "Παρά τις ανησυχίες σχετικά με τα τρωτά σημεία ασφαλείας κατά τη χρήση του WebAssembly για πρόσθετα και εφαρμογές επιφάνειας εργασίας, οι συμμετέχοντες αντιλαμβάνονται γενικά το WebAssembly (WASM) ως ένα εργαλείο για τη διευκόλυνση της διαλειτουργικότητας του κώδικα και την ελαχιστοποίηση της εξάρτησης από το υλικό και τα λειτουργικά συστήματα."
    ],
    "points": 162,
    "commentCount": 45,
    "retryCount": 0,
    "time": 1694622430
  },
  {
    "id": 37499731,
    "title": "Η Unity αφαίρεσε σιωπηλά τη ρήτρα που σας επέτρεπε να χρησιμοποιήσετε το TOS από την έκδοση που παραλάβατε με",
    "originLink": "https://old.reddit.com/r/gamedev/comments/16hnibp/unity_silently_removed_their_github_repo_to_track/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37499731",
    "commentBody": "",
    "originSummary": [
      "Η Unity, μια ευρέως χρησιμοποιούμενη πλατφόρμα ανάπτυξης παιχνιδιών, αντιμετώπισε επικρίσεις για την αθόρυβη κατάργηση ενός αποθετηρίου στο GitHub που παρακολουθούσε τις αλλαγές στους όρους χρήσης της.",
      "Οι χρήστες εκφράζουν την ανησυχία τους για τη διαφάνεια της πλατφόρμας, φοβούμενοι κρυφές αυξήσεις τελών, με αποτέλεσμα να αμφιβάλλουν για την αξιοπιστία της Unity και τις πιθανές νομικές συνέπειες.",
      "Υπάρχουν συνεχείς συζητήσεις σχετικά με τα ζητήματα διαχείρισης της Unity, την πιθανή κατάρρευσή της, τον αντίκτυπο στους χρήστες και την κοινότητα των παιχνιδιών και τη δυσαρέσκεια για τις αλλαγές στις άδειες και τα τέλη."
    ],
    "commentSummary": [
      "Η Unity, μια πλατφόρμα ανάπτυξης παιχνιδιών, άλλαξε διακριτικά τους όρους παροχής υπηρεσιών της, οδηγώντας τους χρήστες σε χρεώσεις για εγκαταστάσεις προϊόντων και νέες χρεώσεις - ακόμη και αν σταματήσουν να χρησιμοποιούν την Unity για μελλοντικά έργα.",
      "Οι αλλαγές αυτές έχουν προκαλέσει αναταραχή και δυσπιστία στους χρήστες, λόγω της αντίληψης ότι η αλλαγή είναι άδικη και κακοσχεδιασμένη, καθώς και ανησυχίες σχετικά με τις χρεώσεις για πολλαπλές εγκαταστάσεις και τις αναδρομικές χρεώσεις.",
      "Η συζήτηση επεκτείνεται στις προκλήσεις των ανοικτών και ελεύθερων προϊόντων που υποστηρίζονται από εμπορικές εταιρείες, στον αγώνα της Unity να δημιουργήσει έσοδα και στις αμφιβολίες σχετικά με τη διαφάνεια και την οικονομική κατάσταση του επιχειρηματικού της μοντέλου."
    ],
    "points": 143,
    "commentCount": 54,
    "retryCount": 0,
    "time": 1694628583
  },
  {
    "id": 37503351,
    "title": "Ανάπτυξη παιχνιδιών μετά το Unity",
    "originLink": "https://www.computerenhance.com/p/game-development-post-unity",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37503351",
    "commentBody": "",
    "originSummary": [
      "Η Unity, μια ευρέως χρησιμοποιούμενη μηχανή ανάπτυξης παιχνιδιών, αναθεωρεί τους όρους αδειοδότησής της για να εφαρμόσει μια αξιοσημείωτη αμοιβή ανά μονάδα, προκαλώντας ανησυχίες στην κοινότητα των προγραμματιστών.",
      "Αυτή η αλλαγή στους όρους αδειοδότησης της Unity ωθεί ορισμένους προγραμματιστές να σκεφτούν τη μετάβαση σε διαφορετικές μηχανές, όπως η Godot, η Unreal, η Defold και η RayLib, που η καθεμία προσφέρει διαφορετικά χαρακτηριστικά, φιλικότητα προς το χρήστη και υποστήριξη γλωσσών σεναρίων.",
      "Ο Casey Muratori ζητάει πληροφορίες από τους προγραμματιστές σχετικά με τις εμπειρίες τους με αυτές τις εναλλακτικές μηχανές, ώστε να διευκολύνει τη λήψη τεκμηριωμένων αποφάσεων."
    ],
    "commentSummary": [
      "Η συζήτηση στους κύκλους ανάπτυξης παιχνιδιών περιστρέφεται γύρω από μηχανές όπως η Unity, η Unreal Engine, η Godot και το Blender. Η στροφή της Unity προς τη δημιουργία εσόδων μέσω διαφημίσεων επικρίνεται λόγω ανησυχιών για τη σταθερότητα και την εξάρτηση από τους προγραμματιστές.",
      "Η Godot αναδεικνύεται ως μια πιθανή εναλλακτική λύση, αλλά δυσκολεύεται να ανταγωνιστεί το ισχυρό οικοσύστημα της Unity. Η σύγκριση και η συζήτηση επεκτείνονται στη δημοτικότητα και τα μοντέλα τιμολόγησης της Unity, της Unreal Engine και της χρήσης του Blender στη βιομηχανία ανεξάρτητων παιχνιδιών.",
      "Η συζήτηση περιλαμβάνει επίσης την παρακμή της μηχανής παιχνιδιών Blender, τη χρήση της Python στην ανάπτυξη παιχνιδιών και τις ανησυχίες σχετικά με τη δομή των δικαιωμάτων της Unity. Διερευνάται επίσης η συνηγορία για ένα μοντέλο διαμοιρασμού των εσόδων παρόμοιο με αυτό της Unreal."
    ],
    "points": 134,
    "commentCount": 127,
    "retryCount": 0,
    "time": 1694650747
  },
  {
    "id": 37502892,
    "title": "Οι καλλιτέχνες οπτικών εφέ της Marvel ψηφίζουν ομόφωνα υπέρ της συνδικαλιστικής οργάνωσης",
    "originLink": "https://www.cnbc.com/2023/09/13/marvel-vfx-artists-unanimously-vote-to-unionize.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37502892",
    "commentBody": "",
    "originSummary": [
      "Οι καλλιτέχνες οπτικών εφέ (VFX) των Marvel Studios ψήφισαν ομόφωνα υπέρ της συνδικαλιστικής οργάνωσης με τη Διεθνή Συμμαχία Εργαζομένων Θεατρικών Σκηνών (IATSE), κάτι που συμβαίνει για πρώτη φορά για μια ομάδα που επικεντρώνεται αποκλειστικά στα VFX.",
      "Αυτή η κίνηση προς τη συνδικαλιστική οργάνωση προκύπτει εν μέσω διπλών απεργιών των συγγραφέων και των ηθοποιών του Χόλιγουντ. Οι καλλιτέχνες ελπίζουν να διαπραγματευτούν για δίκαιες αμοιβές, παροχές υγείας και ένα ασφαλές εργασιακό περιβάλλον ως απάντηση στον αυξημένο φόρτο εργασίας και τις αυστηρές προθεσμίες.",
      "Με την επικύρωση της ψηφοφορίας για τη συνδικαλιστική οργάνωση, οι εργαζόμενοι VFX θα ξεκινήσουν συλλογικές διαπραγματεύσεις με τα Marvel Studios, αν και οι εν εξελίξει διαπραγματεύσεις με άλλες εργατικές ομάδες ενδέχεται να καθυστερήσουν αυτές τις συζητήσεις."
    ],
    "commentSummary": [
      "Οι καλλιτέχνες οπτικών εφέ που εργάζονται για τη Marvel αποφάσισαν ομόφωνα να ιδρύσουν εργατικό σωματείο.",
      "Η είδηση αυτή προκάλεσε συζητήσεις στο Hacker News, έναν ιστότοπο κοινωνικών ειδήσεων που επικεντρώνεται στην τεχνολογία και την επιχειρηματικότητα."
    ],
    "points": 133,
    "commentCount": 3,
    "retryCount": 0,
    "time": 1694646843
  }
]
