[
  {
    "id": 40767459,
    "title": "Saya menggunakan AI untuk menjatuhkan topi di luar jendela saya kepada orang-orang New York",
    "originLink": "https://dropofahat.zone/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40767459",
    "commentBody": "",
    "originSummary": [
      "Seorang penduduk Midwest di NYC menggunakan AI untuk menjatuhkan topi pada pejalan kaki dari jendela mereka, dengan memanfaatkan Raspberry Pi, motor stepper Adafruit, dan Roboflow AI untuk deteksi.",
      "Proyek ini, yang dapat diakses melalui DropofaHat.zone, memungkinkan pengguna untuk memesan slot selama 5 menit untuk menerima topi dalam hitungan detik, menampilkan penggunaan baru AI dan otomatisasi.",
      "Kreator membayangkan masa depan di mana jendela kota dapat menjatuhkan barang-barang pada orang-orang yang lewat, menciptakan istilah 'Window Shopping.'"
    ],
    "commentSummary": [
      "Proyek yang digerakkan oleh AI bernama \"Window Shopping\" melibatkan menjatuhkan topi dari jendela ke orang-orang New York menggunakan Raspberry Pi, motor stepper Adafruit, benang, dan Roboflow untuk AI.",
      "Kegiatan ini telah memicu diskusi tentang pendapatan universal, aplikasi AI, dan masalah hukum, dengan saran untuk penggunaan yang menyenangkan dan praktis, seperti pengiriman barang atau peningkatan analitik olahraga.",
      "Reaksi terhadap proyek ini beragam, mulai dari kekaguman hingga kekhawatiran tentang potensi penyalahgunaan."
    ],
    "points": 512,
    "commentCount": 154,
    "retryCount": 0,
    "time": 1719150570
  },
  {
    "id": 40763640,
    "title": "Ruby: Bahasa yang hebat untuk skrip shell",
    "originLink": "https://lucasoshiro.github.io/posts-en/2024-06-17-ruby-shellscript/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40763640",
    "commentBody": "",
    "originSummary": [
      "Ruby, yang sering kali tertutupi oleh kerangka kerjanya Rails, disorot sebagai bahasa yang sangat baik untuk menulis skrip shell yang kompleks, menawarkan lebih banyak fitur daripada Bash.",
      "Fitur utama meliputi pemanggilan perintah eksternal, penanganan kode status, pengetikan berorientasi objek, konstruksi fungsional, pencocokan regex bawaan, threading yang mudah, dan operasi file serta direktori yang komprehensif.",
      "Postingan tersebut mendorong untuk mempertimbangkan Ruby dibandingkan bahasa skrip lainnya seperti Python, Perl, dan JavaScript untuk tugas skrip shell yang kompleks."
    ],
    "commentSummary": [
      "Ruby menawarkan sintaks yang mudah dibaca, variabel yang masuk akal, dan pertumbuhan kompleksitas yang halus, menjadikannya pilihan yang kuat untuk skrip shell.",
      "Meskipun memiliki keunggulan, Ruby tidak banyak digunakan untuk shell scripting karena tidak terpasang secara default di banyak sistem, berbeda dengan Bash atau Python.",
      "Kepopuleran Go untuk tooling disebabkan oleh kemampuannya menciptakan biner statis tunggal, meskipun tidak ideal untuk manipulasi OS."
    ],
    "points": 396,
    "commentCount": 278,
    "retryCount": 0,
    "time": 1719103586
  },
  {
    "id": 40765183,
    "title": "Saya telah berhenti menggunakan plot kotak (2021)",
    "originLink": "https://nightingaledvs.com/ive-stopped-using-box-plots-should-you/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40765183",
    "commentBody": "",
    "originSummary": [
      "Penelitian menunjukkan bahwa pilihan grafik yang umum dapat secara tidak sengaja memicu bias sosial dan memperkuat rasisme sistemik.",
      "Memvisualisasikan ketidaksetaraan sosial melalui grafik tertentu mungkin memperburuk masalah daripada membantu mengatasinya.",
      "Kajian tersebut menyarankan perlunya pertimbangan yang lebih cermat dalam desain dan penyajian visualisasi data untuk menghindari perpetuasi bias."
    ],
    "commentSummary": [
      "Kotak plot dapat menyesatkan karena sering membuat distribusi tampak seperti Gaussian (berbentuk lonceng), yang tidak selalu akurat.",
      "Alternatif seperti histogram, plot strip jittered, dan plot violin dapat lebih baik merepresentasikan distribusi data yang sebenarnya.",
      "Walaupun plot kotak berguna untuk membandingkan median dan distribusi, mereka memerlukan pemahaman yang kuat tentang statistik untuk interpretasi yang benar."
    ],
    "points": 257,
    "commentCount": 168,
    "retryCount": 0,
    "time": 1719123982
  },
  {
    "id": 40766791,
    "title": "Llama.ttf: Sebuah font yang juga merupakan LLM",
    "originLink": "https://fuglede.github.io/llama.ttf/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40766791",
    "commentBody": "",
    "originSummary": [
      "llama.ttf adalah file font unik yang juga berfungsi sebagai model bahasa besar (LLM) dan mesin inferensinya, memanfaatkan mesin pembentukan font Harfbuzz dan dukungan WebAssembly (Wasm).",
      "Ini inovasi memungkinkan pembuatan teks dalam aplikasi berbasis Harfbuzz, seperti editor teks atau klien email, tanpa memerlukan pembaruan dari vendor.",
      "Pengguna dapat mengunduh file llama.ttf sebesar 60 MB dan menggunakannya seperti font lainnya dalam aplikasi yang didukung Harfbuzz dengan Wasm diaktifkan, memungkinkan eksekusi LLM lokal."
    ],
    "commentSummary": [
      "Llama.ttf adalah sebuah font unik yang menggabungkan Model Bahasa Besar (LLM) dan mesin inferensi, memungkinkan pengguna untuk berinteraksi dengannya seolah-olah sedang mengobrol.",
      "File font tersebut sangat besar, sekitar 280GB, sehingga tidak praktis untuk penggunaan luas, tetapi ini menunjukkan perpaduan inovatif antara tipografi dan AI.",
      "Masalah keamanan muncul terkait penyematan kode yang dapat dieksekusi dalam font, menyoroti potensi risiko dan kompleksitas dalam rendering font dan dukungan peramban."
    ],
    "points": 238,
    "commentCount": 69,
    "retryCount": 0,
    "time": 1719144105
  },
  {
    "id": 40761713,
    "title": "HH70, Tokamak superkonduktor suhu tinggi pertama, mencapai plasma pertama",
    "originLink": "https://www.energysingularity.cn/en/hh70-the-worlds-first-high-temperature-superconducting-tokamak-achieves-first-plasma/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40761713",
    "commentBody": "",
    "originSummary": [
      "Energy Singularity telah mengembangkan perangkat Tokamak superkonduktor suhu tinggi pertama di dunia, \"HH70,\" yang telah berhasil mencapai plasma pertama.",
      "HH70 terkenal karena penggunaan 26 magnet superkonduktor suhu tinggi dan mencapai beberapa pencapaian pertama di dunia, termasuk menjadi perangkat pertama yang dibangun oleh perusahaan komersial.",
      "Tonggak ini menempatkan Tiongkok sebagai pemimpin dalam fusi pengurungan magnetik superkonduktor suhu tinggi, dengan rencana untuk Tokamak generasi berikutnya, HH170, yang bertujuan untuk pencapaian energi yang signifikan."
    ],
    "commentSummary": [
      "HH70, Tokamak superkonduktor suhu tinggi pertama, mencapai plasma pertamanya, menandai tonggak penting dalam teknologi fusi nuklir.",
      "Didanai oleh perusahaan game Tiongkok MiHoYo, proyek ini diselesaikan dalam 2 tahun dengan investasi sebesar $65 juta.",
      "Prestasi ini menyoroti potensi dampak energi fusi dan mengundang perbandingan dengan proyek fusi lainnya."
    ],
    "points": 220,
    "commentCount": 250,
    "retryCount": 0,
    "time": 1719086501
  },
  {
    "id": 40763117,
    "title": "SSH sebagai Pengganti Sudo",
    "originLink": "https://whynothugo.nl/journal/2024/06/13/ssh-as-a-sudo-replacement/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40763117",
    "commentBody": "",
    "originSummary": [
      "Alat tradisional seperti sudo dan doas menggunakan biner setuid dan eskalasi hak istimewa, yang memiliki keterbatasan dalam namespace pengguna yang terbatas dan memerlukan seluruh sesi pengguna untuk mempertahankan kemampuan.",
      "Pendekatan alternatif menggunakan s6-sudod membagi program menjadi server yang memiliki hak istimewa dan klien yang tidak memiliki hak istimewa, dengan tujuan menjalankan perintah sebagai root tanpa eskalasi hak istimewa.",
      "Penulis bereksperimen dengan menggunakan SSH lokal untuk eksekusi perintah root, mengonfigurasi kunci SSH khusus, mengikat sshd ke soket domain Unix, dan menggunakan ProxyUseFdpass untuk menangani deskriptor file soket, meningkatkan keamanan dan mendukung berbagai metode otentikasi."
    ],
    "commentSummary": [
      "Menggunakan SSH sebagai pengganti sudo memperkenalkan kompleksitas dengan mengharuskan biner root berkomunikasi melalui soket UNIX dan kriptografi asimetris.",
      "Pembatasan akses sudo ke grup wheel dan memastikan hanya pengguna yang berwenang yang dapat membaca atau mengeksekusinya dapat memberikan keamanan serupa dengan kompleksitas yang lebih rendah.",
      "Alat seperti etckeeper, Ansible, dan Chezmoi dapat membantu mengelola dan melacak perubahan konfigurasi secara efektif, menawarkan alternatif untuk penggunaan sudo tradisional."
    ],
    "points": 201,
    "commentCount": 102,
    "retryCount": 0,
    "time": 1719098099
  },
  {
    "id": 40762433,
    "title": "Script sederhana untuk melumpuhkan penargetan personalisasi dari Facebook",
    "originLink": "https://gist.github.com/HyperCrowd/edc9b461ec23cf2454ea4d1e910fd1c6",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40762433",
    "commentBody": "",
    "originSummary": [
      "Metode untuk mengganggu penargetan iklan Facebook melibatkan penggunaan skrip yang dijalankan di konsol peramban untuk berhenti berlangganan dari pengiklan.",
      "Teks ini mengotomatisasi proses mengklik pengaturan iklan Facebook untuk mencegah pengiklan menargetkan pengguna berdasarkan daftar yang diunggah.",
      "Pengguna disarankan untuk tidak berinteraksi dengan peramban selama eksekusi skrip dan mungkin perlu memulai ulang proses secara manual jika mereka memiliki banyak pengiklan."
    ],
    "commentSummary": [
      "Script buatan pengguna untuk menonaktifkan penargetan personalisasi Facebook telah menarik perhatian signifikan karena mengotomatisasi proses keluar.",
      "Pengguna membahas tantangan dalam menonaktifkan iklan tertarget secara manual, berbagi pengalaman, dan menyarankan perbaikan skrip, menyoroti kekhawatiran privasi dan potensi masalah hukum.",
      "Pembuat skrip memperbaruinya berdasarkan umpan balik pengguna untuk meningkatkan fungsionalitasnya."
    ],
    "points": 198,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1719092298
  },
  {
    "id": 40763133,
    "title": "Menelusuri penggunaan ChatGPT dalam penulisan akademik melalui kosakata yang berlebihan",
    "originLink": "https://arxiv.org/abs/2406.07016",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40763133",
    "commentBody": "",
    "originSummary": [
      "Model bahasa besar (LLM) terbaru seperti ChatGPT semakin banyak digunakan dalam penulisan akademik, meskipun memiliki keterbatasan seperti menghasilkan informasi yang tidak akurat dan memperkuat bias.",
      "Analisis terhadap 14 juta abstrak PubMed dari tahun 2010-2024 mengungkapkan bahwa setidaknya 10% dari abstrak tahun 2024 diproses dengan LLM, dengan beberapa sub-korpus mencapai hingga 30%.",
      "Pengaruh asisten penulisan berbasis LLM terhadap literatur ilmiah tidak pernah terjadi sebelumnya, melampaui peristiwa besar seperti pandemi Covid dalam hal pengaruh."
    ],
    "commentSummary": [
      "Pengaruh ChatGPT terhadap penulisan akademis masih diperdebatkan, dengan beberapa orang melihatnya sebagai sesuatu yang belum pernah terjadi sebelumnya dan yang lain mengaitkan perubahan tersebut dengan penularan sosial atau pergeseran bahasa tradisional.",
      "Banyak akademisi, terutama yang bukan penutur asli bahasa Inggris, sekarang menggunakan ChatGPT untuk menulis, meskipun ada kritik bahwa alat ini dapat memperkenalkan bahasa yang bertele-tele.",
      "Diskusi tersebut mencakup pertimbangan etis dan norma yang berkembang seputar penggunaan AI dalam penulisan, menyoroti potensinya untuk meningkatkan kejelasan dan aksesibilitas."
    ],
    "points": 151,
    "commentCount": 90,
    "retryCount": 0,
    "time": 1719098309
  },
  {
    "id": 40765800,
    "title": "Kenapa otak Anda 3 juta kali lebih efisien daripada GPT-4",
    "originLink": "https://grski.pl/vdb",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40765800",
    "commentBody": "",
    "originSummary": [
      "Basis Data Vektor semakin populer karena kemampuannya menangani data berdimensi tinggi secara efisien, terutama dalam konteks Model Bahasa Besar (LLM).",
      "Teknik seperti Pencarian Tetangga Terdekat Mendekati (ANNS) dan Dunia Kecil yang Dapat Dinavigasi Secara Hierarkis (HNSW) membantu mengelola tantangan komputasi dari ruang vektor berdimensi tinggi.",
      "Qdrant diidentifikasi sebagai Database Vektor terbaik karena kinerjanya, skalabilitasnya, dan dukungan komunitasnya, menyoroti pentingnya database ini dalam aplikasi AI modern."
    ],
    "commentSummary": [
      "Perbandingan antara otak manusia dan efisiensi GPT-4 cacat karena perbedaan dalam penggunaan energi selama pelatihan dan inferensi.",
      "Perhitungan yang dikoreksi menunjukkan bahwa otak manusia 1,44 kali lebih efisien selama pelatihan tetapi 8 kali kurang efisien selama inferensi dibandingkan dengan GPT-4.",
      "Kajian ini menyoroti kompleksitas dalam membandingkan kecerdasan biologis dan kecerdasan buatan, dengan mempertimbangkan faktor-faktor seperti pra-pelatihan evolusioner dan berbagai modalitas pembelajaran (citra vs. bahasa)."
    ],
    "points": 148,
    "commentCount": 187,
    "retryCount": 0,
    "time": 1719132627
  },
  {
    "id": 40761837,
    "title": "Solar menghasilkan seperlima dari listrik global pada puncak tengah hari titik balik matahari musim panas",
    "originLink": "https://ember-climate.org/insights/in-brief/the-global-solar-revolution/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40761837",
    "commentBody": "",
    "originSummary": [
      "Selama puncak tengah hari pada titik balik matahari musim panas, tenaga surya diharapkan menghasilkan sekitar 20% dari listrik global, menunjukkan pertumbuhannya yang cepat.",
      "Pada bulan Juni, energi surya diperkirakan akan menyediakan 8,2% dari listrik global, dengan China memimpin, setelah meningkatkan kapasitas suryanya sebesar 152% pada tahun 2023.",
      "Tenaga surya adalah sumber listrik yang paling cepat berkembang, memenuhi 49% pertumbuhan permintaan listrik global pada tahun 2023, dan mengubah sektor tenaga menuju energi terbarukan."
    ],
    "commentSummary": [
      "Tenaga surya menghasilkan 20% listrik global pada puncak tengah hari saat titik balik matahari musim panas, menunjukkan pentingnya yang semakin meningkat dalam sektor energi.",
      "Pada tahun 2030-an, tenaga surya diproyeksikan menjadi sumber listrik terbesar, dan pada tahun 2040-an, menjadi sumber energi terbesar, dengan biaya untuk tenaga surya dan baterai diperkirakan lebih rendah daripada alternatif lainnya.",
      "Sebuat laporan dari Rocky Mountain Institute menekankan pertumbuhan eksponensial energi surya dan angin, menyoroti meningkatnya kelayakan dan adopsi luas sumber energi terbarukan."
    ],
    "points": 144,
    "commentCount": 151,
    "retryCount": 0,
    "time": 1719087503
  },
  {
    "id": 40763540,
    "title": "ChatGPT memiliki bias terhadap resume dengan kredensial yang mengindikasikan disabilitas",
    "originLink": "https://www.washington.edu/news/2024/06/21/chatgpt-ai-bias-ableism-disability-resume-cv/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40763540",
    "commentBody": "",
    "originSummary": [
      "Peneliti dari UW menemukan bahwa ChatGPT memberi peringkat lebih rendah pada resume dengan penghargaan terkait disabilitas dibandingkan dengan yang tidak, menunjukkan adanya ableisme eksplisit dan implisit.",
      "Menyesuaikan ChatGPT dengan instruksi khusus untuk menghindari ableisme mengurangi bias untuk sebagian besar disabilitas yang diuji, tetapi tidak secara konsisten di semua disabilitas.",
      "Studi yang dipimpin oleh mahasiswa pascasarjana Kate Glazko ini dipresentasikan pada Konferensi ACM tentang Keadilan, Akuntabilitas, dan Transparansi tahun 2024, menyoroti kebutuhan akan lebih banyak penelitian untuk mengatasi bias AI dalam perekrutan."
    ],
    "commentSummary": [
      "ChatGPT menunjukkan bias terhadap resume yang menunjukkan disabilitas, mencerminkan data bias yang dipelajarinya, yang mencakup praktik perekrutan yang diskriminatif.",
      "Kekurangan basis data perekrutan yang etis mempersulit pelatihan model AI yang tidak bias, memicu perdebatan tentang apakah AI mencerminkan bias manusia atau justru mengoreksi secara berlebihan, menciptakan bias baru.",
      "Diskusi menekankan perlunya transparansi dan akuntabilitas AI, serta menyoroti tantangan yang lebih luas dalam mengembangkan sistem perekrutan yang adil dan tidak bias."
    ],
    "points": 138,
    "commentCount": 124,
    "retryCount": 0,
    "time": 1719102650
  },
  {
    "id": 40764579,
    "title": "TinyLetter Ditutup oleh Mailchimp, Jadi Saya Membangun LetterDrop",
    "originLink": "https://github.com/i365dev/LetterDrop",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40764579",
    "commentBody": "",
    "originSummary": [
      "LetterDrop adalah layanan manajemen buletin yang baru, aman, dan efisien yang dibangun menggunakan Cloudflare Workers, dibuat sebagai tanggapan atas penutupan TinyLetter oleh Mailchimp.",
      "Fitur utama termasuk pembuatan buletin yang mudah, distribusi, manajemen langganan, dan penanganan email yang gagal menggunakan rangkaian alat Cloudflare seperti Workers, KV, R2, dan Queues.",
      "Perbaikan di masa depan yang direncanakan untuk LetterDrop mencakup penambahan unit test, template email, pelacakan tingkat pembukaan email, dukungan untuk lebih banyak layanan email pihak ketiga, dan pengenalan fitur multi-tenant."
    ],
    "commentSummary": [
      "Penutupan TinyLetter oleh Mailchimp mendorong seorang pengguna untuk mengembangkan LetterDrop menggunakan GPT-4 untuk pembuatan kode, memicu diskusi tentang kualitas dan keamanan kode yang dihasilkan oleh AI.",
      "Pengguna memperdebatkan keandalan dan pemeliharaan kode yang dihasilkan oleh AI, serta implikasi yang lebih luas untuk pengembangan perangkat lunak dan kekhawatiran hak cipta.",
      "Percakapan tersebut juga mengeksplorasi alternatif untuk TinyLetter dan tantangan yang terkait dengan ketergantungan pada AI dan layanan cloud."
    ],
    "points": 137,
    "commentCount": 92,
    "retryCount": 0,
    "time": 1719113684
  },
  {
    "id": 40766117,
    "title": "Hewan Pertama yang Ditemukan Tidak Membutuhkan Oksigen untuk Bertahan Hidup",
    "originLink": "https://www.sciencealert.com/this-is-the-first-animal-ever-found-that-doesnt-need-oxygen-to-survive",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40766117",
    "commentBody": "",
    "originSummary": [
      "Para ilmuwan telah menemukan Henneguya salminicola, organisme multiseluler pertama yang dapat bertahan hidup tanpa oksigen, yang menantang pemahaman kita tentang kehidupan di Bumi.",
      "Kutu parasit mirip ubur-ubur ini, yang ditemukan pada salmon, tidak memiliki genom mitokondria dan telah mengembangkan organel terkait mitokondria yang unik, menunjukkan transisi dari metabolisme aerobik ke anaerobik.",
      "Penemuan ini, yang diterbitkan di PNAS pada Februari 2020, dapat mempengaruhi pencarian kehidupan ekstraterestrial dengan memperluas kriteria untuk apa yang dianggap sebagai organisme hidup."
    ],
    "commentSummary": [
      "Para ilmuwan telah menemukan hewan pertama yang diketahui tidak memerlukan oksigen untuk bertahan hidup, menantang asumsi lama tentang kebutuhan untuk kehidupan multiseluler.",
      "Organisme tersebut, sejenis parasit cnidaria, tidak memiliki DNA mitokondria, yang biasanya penting untuk respirasi berbasis oksigen pada hewan.",
      "Penemuan ini, yang awalnya dipublikasikan pada tahun 2020, telah mendapatkan perhatian baru, menyoroti kemampuan beradaptasi dan keragaman bentuk kehidupan di lingkungan ekstrem."
    ],
    "points": 128,
    "commentCount": 51,
    "retryCount": 0,
    "time": 1719136221
  },
  {
    "id": 40766079,
    "title": "Kamu Jangan Pernah* Menggunakan Datagram",
    "originLink": "https://quic.video/blog/never-use-datagrams/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40766079",
    "commentBody": "",
    "originSummary": [
      "Ketika membangun aplikasi internet, TCP lebih disukai untuk pengiriman yang andal, sedangkan UDP digunakan untuk ketepatan waktu, terutama dalam protokol video langsung.",
      "Menggunakan UDP secara langsung berisiko karena perlu mengimplementasikan fitur-fitur seperti retransmisi dan pengendalian kemacetan; sebagai gantinya, pengembang sebaiknya menggunakan perpustakaan QUIC.",
      "Kedua QUIC dan Media over QUIC (MoQ) mendukung datagram, tetapi pengembang disarankan untuk fokus menggunakan aliran QUIC untuk menghindari jebakan yang terkait dengan datagram."
    ],
    "commentSummary": [
      "Diskusi berpusat pada penggunaan UDP (User Datagram Protocol) versus TCP (Transmission Control Protocol) untuk transmisi data, menyoroti kelebihan dan kekurangan masing-masing.",
      "UDP sering disebut \"tidak dapat diandalkan\" atau \"usaha terbaik,\" yang berarti tidak menjamin pengiriman, urutan, atau pemeriksaan kesalahan, berbeda dengan TCP yang memastikan pengiriman yang andal, terurut, dan diperiksa kesalahannya.",
      "Kami membahas contoh-contoh penggunaan UDP, seperti data sensor frekuensi tinggi dan sistem seni media, serta memperdebatkan terminologi dan implikasi praktis penggunaan UDP dibandingkan TCP."
    ],
    "points": 124,
    "commentCount": 139,
    "retryCount": 0,
    "time": 1719135634
  },
  {
    "id": 40769362,
    "title": "Mulailah semua perintah Anda dengan tanda koma",
    "originLink": "https://rhodesmill.org/brandon/2009/commands-with-comma/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40769362",
    "commentBody": "",
    "originSummary": [
      "Pengguna Unix sering membuat direktori ~/bin/ di direktori rumah mereka untuk menyimpan skrip kustom, tetapi ini dapat menyebabkan bentrokan nama dengan perintah sistem.",
      "Untuk menghindari tabrakan ini, penulis menyarankan untuk menambahkan awalan pada nama perintah khusus dengan tanda koma, yang diperlakukan sebagai karakter normal dalam nama file dan menghindari konflik.",
      "Teknik ini, dikombinasikan dengan penyelesaian otomatis, memungkinkan penjelajahan perintah khusus dengan mudah dan telah terbukti menjadi solusi yang tangguh selama lebih dari satu dekade."
    ],
    "commentSummary": [
      "Seorang pengguna membagikan metode untuk menjalankan skrip Python di Windows dengan mengatur python.exe sebagai default untuk file `.py` dan menambahkan `.py` ke `%pathext%`.",
      "Mereka mencari fungsionalitas serupa di Linux tetapi menghadapi tantangan karena kurangnya konsep 'program terkait', dengan saran termasuk menggunakan shebang (`#!/usr/bin/env python3`), mengganti nama skrip, membuat alias, atau menggunakan alat seperti `update-alternatives`.",
      "Diskusi juga mencakup pengelolaan konfigurasi lokal dengan git, menggunakan alias, menangani tabrakan namespace, dan mengatur skrip serta konfigurasi dengan alat seperti `chezmoi` atau ansible."
    ],
    "points": 118,
    "commentCount": 42,
    "retryCount": 0,
    "time": 1719166322
  }
]
