[
  {
    "id": 40767459,
    "title": "ฉันกำลังใช้ AI เพื่อปล่อยหมวกออกนอกหน้าต่างลงไปยังชาวนิวยอร์ก",
    "originLink": "https://dropofahat.zone/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40767459",
    "commentBody": "",
    "originSummary": [
      "ชาวมิดเวสต์ในนิวยอร์กซิตี้กำลังใช้ AI เพื่อปล่อยหมวกลงบนคนเดินถนนจากหน้าต่างของพวกเขา โดยใช้ Raspberry Pi, มอเตอร์สเต็ปเปอร์ของ Adafruit และ Roboflow AI สำหรับการตรวจจับ",
      "โครงการนี้สามารถเข้าถึงได้ผ่านทาง DropofaHat.zone ให้ผู้ใช้จองช่วงเวลา 5 นาทีเพื่อรับหมวกภายในไม่กี่วินาที แสดงให้เห็นถึงการใช้ AI และระบบอัตโนมัติในรูปแบบใหม่",
      "ผู้สร้างมองเห็นอนาคตที่หน้าต่างในเมืองสามารถปล่อยสิ่งของลงบนผู้คนขณะที่พวกเขาเดินผ่าน โดยตั้งชื่อว่า 'การช้อปปิ้งหน้าต่าง'"
    ],
    "commentSummary": [
      "โครงการที่ขับเคลื่อนด้วย AI ชื่อว่า \"Window Shopping\" เกี่ยวข้องกับการปล่อยหมวกจากหน้าต่างลงบนชาวนิวยอร์ก โดยใช้ Raspberry Pi, มอเตอร์สเต็ปเปอร์ของ Adafruit, เส้นด้าย และ Roboflow สำหรับ AI",
      "โครงการนี้ได้จุดประกายการสนทนาเกี่ยวกับรายได้พื้นฐานสากล การประยุกต์ใช้ AI และข้อกังวลทางกฎหมาย พร้อมกับข้อเสนอแนะสำหรับการใช้งานที่สนุกสนานและเป็นประโยชน์ เช่น การส่งของหรือการเพิ่มประสิทธิภาพการวิเคราะห์กีฬา",
      "ปฏิกิริยาต่อโครงการนี้มีความหลากหลาย ตั้งแต่การชื่นชมไปจนถึงความกังวลเกี่ยวกับการใช้งานที่อาจไม่เหมาะสม"
    ],
    "points": 512,
    "commentCount": 154,
    "retryCount": 0,
    "time": 1719150570
  },
  {
    "id": 40763640,
    "title": "Ruby: ภาษาที่ยอดเยี่ยมสำหรับสคริปต์เชลล์",
    "originLink": "https://lucasoshiro.github.io/posts-en/2024-06-17-ruby-shellscript/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40763640",
    "commentBody": "",
    "originSummary": [
      "Ruby, มักถูกบดบังด้วยเฟรมเวิร์ก Rails ของมัน, ถูกเน้นว่าเป็นภาษาที่ยอดเยี่ยมสำหรับการเขียนสคริปต์เชลล์ที่ซับซ้อน, โดยมีฟีเจอร์มากกว่า Bash.",
      "คุณสมบัติหลักประกอบด้วยการเรียกคำสั่งภายนอก, การจัดการรหัสสถานะ, การพิมพ์เชิงวัตถุ, การก่อสร้างเชิงฟังก์ชัน, การจับคู่ regex ในตัว, การทำงานแบบเธรดที่ง่าย, และการดำเนินการไฟล์และไดเรกทอรีที่ครอบคลุม",
      "โพสต์นี้สนับสนุนให้พิจารณาใช้ Ruby แทนภาษาสคริปต์อื่น ๆ เช่น Python, Perl และ JavaScript สำหรับงานสคริปต์เชลล์ที่ซับซ้อน"
    ],
    "commentSummary": [
      "Ruby มีไวยากรณ์ที่อ่านง่าย ตัวแปรที่เข้าใจได้ และการเติบโตของความซับซ้อนที่ราบรื่น ทำให้เป็นตัวเลือกที่ดีสำหรับสคริปต์เชลล์",
      "แม้จะมีข้อดีหลายประการ แต่ Ruby ไม่ได้ถูกใช้อย่างแพร่หลายสำหรับการเขียนสคริปต์เชลล์ เนื่องจากไม่ได้ถูกติดตั้งล่วงหน้าในหลายระบบเหมือนกับ Bash หรือ Python",
      "Go เป็นที่นิยมสำหรับการสร้างเครื่องมือเนื่องจากความสามารถในการสร้างไบนารีแบบสแตติกเดียว แม้ว่ามันจะไม่เหมาะสำหรับการจัดการระบบปฏิบัติการก็ตาม"
    ],
    "points": 396,
    "commentCount": 278,
    "retryCount": 0,
    "time": 1719103586
  },
  {
    "id": 40765183,
    "title": "ฉันเลิกใช้กราฟกล่องแล้ว (2021)",
    "originLink": "https://nightingaledvs.com/ive-stopped-using-box-plots-should-you/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40765183",
    "commentBody": "",
    "originSummary": [
      "งานวิจัยระบุว่าการเลือกใช้แผนภูมิทั่วไปสามารถกระตุ้นอคติทางสังคมโดยไม่ตั้งใจและเสริมสร้างการเหยียดเชื้อชาติในระบบ",
      "การแสดงภาพความไม่เท่าเทียมทางสังคมผ่านแผนภูมิอาจทำให้ปัญหาแย่ลงแทนที่จะช่วยแก้ไข",
      "การศึกษานี้ชี้ให้เห็นถึงความจำเป็นในการพิจารณาอย่างรอบคอบมากขึ้นในการออกแบบและนำเสนอการแสดงข้อมูลเพื่อหลีกเลี่ยงการสืบทอดอคติ"
    ],
    "commentSummary": [
      "แผนภาพกล่องสามารถทำให้เข้าใจผิดได้เนื่องจากมักทำให้การแจกแจงดูเหมือนเป็นแบบเกาส์เซียน (รูประฆัง) ซึ่งไม่ถูกต้องเสมอไป",
      "ทางเลือกอื่น ๆ เช่น ฮิสโตแกรม แผนภูมิแถบกระจายแบบสั่น และแผนภูมิไวโอลิน สามารถแสดงการกระจายของข้อมูลได้ดีกว่า",
      "แม้ว่าแผนภาพกล่องจะมีประโยชน์ในการเปรียบเทียบค่ามัธยฐานและการกระจายข้อมูล แต่ก็ต้องการความเข้าใจที่ดีในสถิติสำหรับการตีความที่ถูกต้อง"
    ],
    "points": 257,
    "commentCount": 168,
    "retryCount": 0,
    "time": 1719123982
  },
  {
    "id": 40766791,
    "title": "ฟอนต์ Llama.ttf: ฟอนต์ที่เป็น LLM ด้วย",
    "originLink": "https://fuglede.github.io/llama.ttf/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40766791",
    "commentBody": "",
    "originSummary": [
      "llama.ttf เป็นไฟล์ฟอนต์ที่ไม่เหมือนใครซึ่งยังทำหน้าที่เป็นโมเดลภาษาขนาดใหญ่ (LLM) และเครื่องมือการอนุมาน โดยใช้ประโยชน์จากเครื่องมือจัดรูปแบบฟอนต์ Harfbuzz และการสนับสนุน WebAssembly (Wasm)",
      "นวัตกรรมนี้ช่วยให้สามารถสร้างข้อความภายในแอปพลิเคชันที่ใช้ Harfbuzz ได้ เช่น โปรแกรมแก้ไขข้อความหรือไคลเอนต์อีเมล โดยไม่ต้องอัปเดตจากผู้จำหน่าย",
      "ผู้ใช้สามารถดาวน์โหลดไฟล์ llama.ttf ขนาด 60 MB และใช้งานเหมือนฟอนต์อื่น ๆ ในแอปพลิเคชันที่รองรับ Harfbuzz โดยเปิดใช้งาน Wasm ซึ่งจะช่วยให้สามารถรัน LLM ในเครื่องได้"
    ],
    "commentSummary": [
      "Llama.ttf เป็นฟอนต์ที่มีเอกลักษณ์ซึ่งผสมผสานโมเดลภาษาขนาดใหญ่ (LLM) และเครื่องมืออนุมาน ทำให้ผู้ใช้สามารถโต้ตอบกับมันได้เหมือนการแชท",
      "ไฟล์ฟอนต์มีขนาดใหญ่มาก ประมาณ 280GB ทำให้ไม่สะดวกสำหรับการใช้งานทั่วไป แต่แสดงให้เห็นถึงการผสมผสานที่นวัตกรรมระหว่างการพิมพ์และ AI",
      "มีการยกประเด็นความกังวลด้านความปลอดภัยเกี่ยวกับการฝังโค้ดที่สามารถรันได้ในฟอนต์ ซึ่งเน้นถึงความเสี่ยงและความซับซ้อนที่อาจเกิดขึ้นในการแสดงผลฟอนต์และการสนับสนุนของเบราว์เซอร์"
    ],
    "points": 238,
    "commentCount": 69,
    "retryCount": 0,
    "time": 1719144105
  },
  {
    "id": 40761713,
    "title": "HH70, โทคาแมคตัวแรกที่ใช้ตัวนำยวดยิ่งที่อุณหภูมิสูง ประสบความสำเร็จในการสร้างพลาสมาครั้งแรก",
    "originLink": "https://www.energysingularity.cn/en/hh70-the-worlds-first-high-temperature-superconducting-tokamak-achieves-first-plasma/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40761713",
    "commentBody": "",
    "originSummary": [
      "Energy Singularity ได้พัฒนาอุปกรณ์ Tokamak ที่มีการนำไฟฟ้ายิ่งยวดที่อุณหภูมิสูงเต็มรูปแบบเป็นครั้งแรกของโลก ชื่อว่า \"HH70\" ซึ่งประสบความสำเร็จในการสร้างพลาสมาครั้งแรก",
      "HH70 มีความโดดเด่นในการใช้แม่เหล็กตัวนำยิ่งยวดที่อุณหภูมิสูงจำนวน 26 ตัว และการบรรลุความสำเร็จระดับโลกหลายประการ รวมถึงการเป็นอุปกรณ์แรกที่สร้างโดยบริษัทเอกชน",
      "ความสำเร็จนี้ทำให้จีนเป็นผู้นำในด้านการกักเก็บพลังงานด้วยแม่เหล็กที่มีอุณหภูมิสูง โดยมีแผนสำหรับโทคาแมครุ่นถัดไป HH170 ที่มุ่งหวังให้ได้พลังงานที่เพิ่มขึ้นอย่างมีนัยสำคัญ"
    ],
    "commentSummary": [
      "HH70, โทคาแมคตัวแรกที่ใช้ตัวนำยวดยิ่งที่อุณหภูมิสูง ได้สร้างพลาสมาครั้งแรก ซึ่งเป็นก้าวสำคัญในเทคโนโลยีฟิวชันนิวเคลียร์",
      "ได้รับทุนจากบริษัทเกมจีน MiHoYo โครงการนี้เสร็จสมบูรณ์ในเวลา 2 ปี ด้วยการลงทุนมูลค่า 65 ล้านดอลลาร์",
      "ความสำเร็จนี้เน้นให้เห็นถึงผลกระทบที่เป็นไปได้ของพลังงานฟิวชันและเชิญชวนให้เปรียบเทียบกับโครงการฟิวชันอื่น ๆ"
    ],
    "points": 220,
    "commentCount": 250,
    "retryCount": 0,
    "time": 1719086501
  },
  {
    "id": 40763117,
    "title": "SSH เป็นตัวแทนของ Sudo",
    "originLink": "https://whynothugo.nl/journal/2024/06/13/ssh-as-a-sudo-replacement/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40763117",
    "commentBody": "",
    "originSummary": [
      "เครื่องมือแบบดั้งเดิมเช่น sudo และ doas ใช้ไบนารี setuid และการยกระดับสิทธิ์ ซึ่งมีข้อจำกัดในเนมสเปซผู้ใช้ที่ถูกจำกัดและต้องการให้เซสชันผู้ใช้ทั้งหมดรักษาความสามารถไว้",
      "วิธีการทางเลือกโดยใช้ s6-sudod แบ่งโปรแกรมออกเป็นเซิร์ฟเวอร์ที่มีสิทธิพิเศษและไคลเอนต์ที่ไม่มีสิทธิพิเศษ โดยมีเป้าหมายเพื่อรันคำสั่งในฐานะ root โดยไม่ต้องเพิ่มสิทธิพิเศษ",
      "ผู้เขียนได้ทดลองใช้ SSH ในเครื่องสำหรับการรันคำสั่ง root โดยการกำหนดค่า SSH key เฉพาะ, ผูก sshd กับ Unix domain socket, และใช้ ProxyUseFdpass เพื่อจัดการกับ socket file descriptors ซึ่งช่วยเพิ่มความปลอดภัยและรองรับวิธีการยืนยันตัวตนต่างๆ"
    ],
    "commentSummary": [
      "การใช้ SSH แทน sudo เพิ่มความซับซ้อนโดยการต้องให้ไบนารีของ root สื่อสารผ่าน UNIX sockets และการเข้ารหัสแบบอสมมาตร",
      "การจำกัดการเข้าถึง sudo ให้กับกลุ่ม wheel และการรับรองว่ามีเพียงผู้ใช้ที่ได้รับอนุญาตเท่านั้นที่สามารถอ่านหรือใช้งานได้ สามารถให้ความปลอดภัยที่คล้ายคลึงกันด้วยความซับซ้อนที่น้อยลง",
      "เครื่องมืออย่าง etckeeper, Ansible, และ Chezmoi สามารถช่วยจัดการและติดตามการเปลี่ยนแปลงการตั้งค่าได้อย่างมีประสิทธิภาพ โดยเป็นทางเลือกแทนการใช้ sudo แบบดั้งเดิม"
    ],
    "points": 201,
    "commentCount": 102,
    "retryCount": 0,
    "time": 1719098099
  },
  {
    "id": 40762433,
    "title": "สคริปต์ง่าย ๆ เพื่อหยุดการกำหนดเป้าหมายส่วนบุคคลจาก Facebook",
    "originLink": "https://gist.github.com/HyperCrowd/edc9b461ec23cf2454ea4d1e910fd1c6",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40762433",
    "commentBody": "",
    "originSummary": [
      "วิธีการรบกวนการกำหนดเป้าหมายโฆษณาของ Facebook คือการใช้สคริปต์ที่ดำเนินการในคอนโซลของเบราว์เซอร์เพื่อยกเลิกการสมัครจากผู้โฆษณา",
      "สคริปต์นี้ทำให้กระบวนการคลิกผ่านการตั้งค่าโฆษณาของ Facebook เป็นอัตโนมัติเพื่อป้องกันไม่ให้นักโฆษณากำหนดเป้าหมายผู้ใช้ตามรายการที่อัปโหลด",
      "แนะนำให้ผู้ใช้ไม่โต้ตอบกับเบราว์เซอร์ในระหว่างการทำงานของสคริปต์ และอาจจำเป็นต้องเริ่มกระบวนการใหม่ด้วยตนเองหากมีผู้โฆษณาจำนวนมาก"
    ],
    "commentSummary": [
      "สคริปต์ที่ผู้ใช้สร้างขึ้นเพื่อปิดการกำหนดเป้าหมายส่วนบุคคลของ Facebook ได้รับความสนใจอย่างมากในการทำให้กระบวนการยกเลิกเป็นอัตโนมัติ",
      "ผู้ใช้ได้พูดคุยถึงความท้าทายในการปิดโฆษณาเป้าหมายด้วยตนเอง แบ่งปันประสบการณ์ และเสนอการปรับปรุงสคริปต์ โดยเน้นถึงความกังวลเรื่องความเป็นส่วนตัวและปัญหาทางกฎหมายที่อาจเกิดขึ้น",
      "ผู้สร้างสคริปต์ได้อัปเดตมันตามความคิดเห็นของผู้ใช้เพื่อเพิ่มประสิทธิภาพการทำงาน"
    ],
    "points": 198,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1719092298
  },
  {
    "id": 40763133,
    "title": "การเจาะลึกการใช้งาน ChatGPT ในการเขียนเชิงวิชาการผ่านคำศัพท์ที่มากเกินไป",
    "originLink": "https://arxiv.org/abs/2406.07016",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40763133",
    "commentBody": "",
    "originSummary": [
      "โมเดลภาษาขนาดใหญ่ล่าสุด (LLMs) เช่น ChatGPT ถูกนำมาใช้ในการเขียนเชิงวิชาการมากขึ้น แม้ว่าจะมีข้อจำกัดเช่นการผลิตข้อมูลที่ไม่ถูกต้องและการเสริมสร้างอคติก็ตาม",
      "การวิเคราะห์บทคัดย่อของ PubMed จำนวน 14 ล้านฉบับตั้งแต่ปี 2010-2024 เผยให้เห็นว่าอย่างน้อย 10% ของบทคัดย่อในปี 2024 ได้รับการประมวลผลด้วย LLMs โดยบางกลุ่มย่อยมีสัดส่วนสูงถึง 30%.",
      "ผลกระทบของผู้ช่วยเขียนที่ใช้ LLM ต่อวรรณกรรมวิทยาศาสตร์นั้นไม่เคยมีมาก่อน เกินกว่ากิจกรรมสำคัญอย่างการระบาดของโควิดในแง่ของอิทธิพล"
    ],
    "commentSummary": [
      "ผลกระทบของ ChatGPT ต่อการเขียนเชิงวิชาการยังคงเป็นที่ถกเถียงกันอยู่ บางคนมองว่ามันเป็นสิ่งที่ไม่เคยเกิดขึ้นมาก่อน ในขณะที่คนอื่นๆ มองว่าการเปลี่ยนแปลงนี้เกิดจากการแพร่กระจายทางสังคมหรือการเปลี่ยนแปลงทางภาษาตามปกติ",
      "นักวิชาการหลายคน โดยเฉพาะผู้ที่ไม่ใช่เจ้าของภาษาอังกฤษ กำลังใช้ ChatGPT ในการเขียน แม้ว่าจะมีการวิจารณ์ว่ามันอาจทำให้ภาษายืดยาวเกินไป",
      "การอภิปรายรวมถึงการพิจารณาด้านจริยธรรมและบรรทัดฐานที่เปลี่ยนแปลงเกี่ยวกับการใช้ AI ในการเขียน โดยเน้นถึงศักยภาพในการปรับปรุงความชัดเจนและการเข้าถึง"
    ],
    "points": 151,
    "commentCount": 90,
    "retryCount": 0,
    "time": 1719098309
  },
  {
    "id": 40765800,
    "title": "ทำไมสมองของคุณถึงมีประสิทธิภาพมากกว่า GPT-4 ถึง 3 ล้านเท่า",
    "originLink": "https://grski.pl/vdb",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40765800",
    "commentBody": "",
    "originSummary": [
      "ฐานข้อมูลเวกเตอร์กำลังได้รับความนิยมเนื่องจากความสามารถในการจัดการข้อมูลที่มีมิติสูงได้อย่างมีประสิทธิภาพ โดยเฉพาะในบริบทของโมเดลภาษาขนาดใหญ่ (LLMs)",
      "เทคนิคต่างๆ เช่น การค้นหาเพื่อนบ้านที่ใกล้เคียงที่สุดโดยประมาณ (ANNS) และโลกขนาดเล็กที่สามารถนำทางได้แบบลำดับชั้น (HNSW) ช่วยจัดการกับความท้าทายทางคอมพิวเตอร์ของพื้นที่เวกเตอร์มิติสูง",
      "Qdrant ได้รับการยกย่องว่าเป็นฐานข้อมูลเวกเตอร์ที่ดีที่สุดเนื่องจากประสิทธิภาพ ความสามารถในการขยายตัว และการสนับสนุนจากชุมชน ซึ่งเน้นย้ำถึงความสำคัญของฐานข้อมูลเหล่านี้ในแอปพลิเคชัน AI สมัยใหม่"
    ],
    "commentSummary": [
      "การเปรียบเทียบระหว่างสมองมนุษย์กับประสิทธิภาพของ GPT-4 นั้นมีข้อบกพร่องเนื่องจากความแตกต่างในการใช้พลังงานระหว่างการฝึกอบรมและการอนุมาน",
      "การคำนวณที่แก้ไขแล้วระบุว่า สมองมนุษย์มีประสิทธิภาพมากกว่า 1.44 เท่าในระหว่างการฝึกฝน แต่มีประสิทธิภาพน้อยกว่า 8 เท่าในระหว่างการอนุมานเมื่อเทียบกับ GPT-4",
      "การอภิปรายเน้นถึงความซับซ้อนของการเปรียบเทียบปัญญาชีวภาพและปัญญาประดิษฐ์ โดยพิจารณาปัจจัยต่างๆ เช่น การฝึกฝนล่วงหน้าทางวิวัฒนาการและรูปแบบการเรียนรู้ที่แตกต่างกัน (ภาพกับภาษา)"
    ],
    "points": 148,
    "commentCount": 187,
    "retryCount": 0,
    "time": 1719132627
  },
  {
    "id": 40761837,
    "title": "พลังงานแสงอาทิตย์ผลิตไฟฟ้าหนึ่งในห้าของโลกในช่วงเที่ยงของวันครีษมายัน",
    "originLink": "https://ember-climate.org/insights/in-brief/the-global-solar-revolution/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40761837",
    "commentBody": "",
    "originSummary": [
      "ในช่วงกลางวันของวันครีษมายัน พลังงานแสงอาทิตย์คาดว่าจะผลิตไฟฟ้าได้ประมาณ 20% ของไฟฟ้าทั่วโลก แสดงให้เห็นถึงการเติบโตอย่างรวดเร็วของพลังงานแสงอาทิตย์",
      "ในเดือนมิถุนายน พลังงานแสงอาทิตย์คาดว่าจะให้พลังงานไฟฟ้าทั่วโลกถึง 8.2% โดยมีจีนเป็นผู้นำ ซึ่งได้เพิ่มความสามารถในการผลิตพลังงานแสงอาทิตย์ขึ้นถึง 152% ในปี 2023",
      "พลังงานแสงอาทิตย์เป็นแหล่งผลิตไฟฟ้าที่เติบโตเร็วที่สุด โดยตอบสนองความต้องการไฟฟ้าทั่วโลกที่เพิ่มขึ้นถึง 49% ในปี 2023 และเปลี่ยนแปลงภาคพลังงานไปสู่พลังงานหมุนเวียน"
    ],
    "commentSummary": [
      "พลังงานแสงอาทิตย์ผลิตไฟฟ้าได้ 20% ของไฟฟ้าทั่วโลกในช่วงกลางวันสูงสุดของวันครีษมายัน ซึ่งบ่งบอกถึงความสำคัญที่เพิ่มขึ้นในภาคพลังงาน",
      "ภายในทศวรรษที่ 2030 พลังงานแสงอาทิตย์คาดว่าจะกลายเป็นแหล่งไฟฟ้าที่ใหญ่ที่สุด และภายในทศวรรษที่ 2040 จะกลายเป็นแหล่งพลังงานที่ใหญ่ที่สุด โดยมีต้นทุนสำหรับพลังงานแสงอาทิตย์และแบตเตอรี่คาดว่าจะต่ำกว่าทางเลือกอื่น ๆ",
      "รายงานจากสถาบัน Rocky Mountain เน้นย้ำถึงการเติบโตแบบทวีคูณของพลังงานแสงอาทิตย์และพลังงานลม โดยชี้ให้เห็นถึงความเป็นไปได้ที่เพิ่มขึ้นและการนำแหล่งพลังงานหมุนเวียนมาใช้กันอย่างแพร่หลาย"
    ],
    "points": 144,
    "commentCount": 151,
    "retryCount": 0,
    "time": 1719087503
  },
  {
    "id": 40763540,
    "title": "ChatGPT มีอคติต่อประวัติย่อที่มีข้อมูลที่บ่งบอกถึงความพิการ",
    "originLink": "https://www.washington.edu/news/2024/06/21/chatgpt-ai-bias-ableism-disability-resume-cv/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40763540",
    "commentBody": "",
    "originSummary": [
      "นักวิจัยจากมหาวิทยาลัยวอชิงตันพบว่า ChatGPT จัดอันดับประวัติย่อที่มีเกียรติยศที่เกี่ยวข้องกับความพิการต่ำกว่าประวัติย่อที่ไม่มี ซึ่งบ่งชี้ถึงการเลือกปฏิบัติทั้งที่ชัดเจนและแฝงอยู่ต่อผู้พิการ",
      "การปรับแต่ง ChatGPT ด้วยคำแนะนำเฉพาะเพื่อหลีกเลี่ยงการเหยียดหยามผู้พิการช่วยลดอคติสำหรับความพิการส่วนใหญ่ที่ทดสอบ แต่ไม่สม่ำเสมอในทุกประเภทของความพิการ",
      "การศึกษานี้ นำโดยนักศึกษาปริญญาโท Kate Glazko ถูกนำเสนอที่การประชุม ACM Conference on Fairness, Accountability, and Transparency ปี 2024 โดยเน้นย้ำถึงความจำเป็นในการวิจัยเพิ่มเติมเพื่อแก้ไขอคติของ AI ในการจ้างงาน"
    ],
    "commentSummary": [
      "ChatGPT แสดงอคติต่อประวัติย่อที่ระบุถึงความพิการ สะท้อนถึงข้อมูลที่มีอคติที่มันเรียนรู้จาก ซึ่งรวมถึงการปฏิบัติในการจ้างงานที่มีการเลือกปฏิบัติ",
      "การขาดแคลนฐานข้อมูลการจ้างงานที่มีจริยธรรมทำให้การฝึกอบรมโมเดล AI ที่ไม่มีอคติมีความซับซ้อนมากขึ้น ก่อให้เกิดการถกเถียงว่า AI สะท้อนอคติของมนุษย์หรือแก้ไขเกินไปจนสร้างอคติใหม่ขึ้นมา",
      "การอภิปรายเน้นย้ำถึงความจำเป็นในการมีความโปร่งใสและความรับผิดชอบของปัญญาประดิษฐ์ โดยชี้ให้เห็นถึงความท้าทายที่กว้างขึ้นในการพัฒนาระบบการจ้างงานที่ยุติธรรมและไม่มีอคติ"
    ],
    "points": 138,
    "commentCount": 124,
    "retryCount": 0,
    "time": 1719102650
  },
  {
    "id": 40764579,
    "title": "Mailchimp ปิดตัว TinyLetter ดังนั้นฉันจึงสร้าง LetterDrop ขึ้นมา",
    "originLink": "https://github.com/i365dev/LetterDrop",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40764579",
    "commentBody": "",
    "originSummary": [
      "LetterDrop เป็นบริการจัดการจดหมายข่าวใหม่ที่มีความปลอดภัยและมีประสิทธิภาพ สร้างขึ้นโดยใช้ Cloudflare Workers ซึ่งถูกสร้างขึ้นเพื่อตอบสนองต่อการที่ Mailchimp ปิดตัว TinyLetter",
      "คุณสมบัติหลักประกอบด้วยการสร้างจดหมายข่าวที่ง่ายดาย การแจกจ่าย การจัดการการสมัครสมาชิก และการจัดการอีเมลที่ล้มเหลวโดยใช้ชุดเครื่องมือของ Cloudflare เช่น Workers, KV, R2 และ Queues",
      "การปรับปรุงในอนาคตที่วางแผนไว้สำหรับ LetterDrop รวมถึงการเพิ่มการทดสอบหน่วย, แม่แบบอีเมล, การติดตามอัตราการเปิดอีเมล, การสนับสนุนบริการอีเมลของบุคคลที่สามเพิ่มเติม, และการแนะนำฟีเจอร์หลายผู้เช่า"
    ],
    "commentSummary": [
      "การปิดตัวของ TinyLetter โดย Mailchimp ทำให้ผู้ใช้คนหนึ่งพัฒนา LetterDrop โดยใช้ GPT-4 สำหรับการสร้างโค้ด ซึ่งจุดประกายการถกเถียงเกี่ยวกับคุณภาพและความปลอดภัยของโค้ดที่สร้างโดย AI",
      "ผู้ใช้ได้ถกเถียงกันถึงความน่าเชื่อถือและการบำรุงรักษาของโค้ดที่สร้างโดย AI รวมถึงผลกระทบที่กว้างขึ้นต่อการพัฒนาซอฟต์แวร์และข้อกังวลเรื่องลิขสิทธิ์",
      "การสนทนายังได้สำรวจทางเลือกอื่น ๆ นอกเหนือจาก TinyLetter และความท้าทายที่เกี่ยวข้องกับการพึ่งพา AI และบริการคลาวด์"
    ],
    "points": 137,
    "commentCount": 92,
    "retryCount": 0,
    "time": 1719113684
  },
  {
    "id": 40766117,
    "title": "สัตว์ตัวแรกที่ถูกค้นพบที่ไม่ต้องการออกซิเจนในการดำรงชีวิต",
    "originLink": "https://www.sciencealert.com/this-is-the-first-animal-ever-found-that-doesnt-need-oxygen-to-survive",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40766117",
    "commentBody": "",
    "originSummary": [
      "นักวิทยาศาสตร์ได้ค้นพบ Henneguya salminicola ซึ่งเป็นสิ่งมีชีวิตหลายเซลล์ชนิดแรกที่สามารถอยู่รอดได้โดยไม่ต้องใช้ออกซิเจน ท้าทายความเข้าใจของเราเกี่ยวกับชีวิตบนโลก",
      "ปรสิตที่มีลักษณะคล้ายแมงกะพรุนนี้พบในปลาแซลมอน ไม่มีจีโนมของไมโทคอนเดรียและได้พัฒนาออร์แกเนลล์ที่เกี่ยวข้องกับไมโทคอนเดรียที่เป็นเอกลักษณ์ ซึ่งบ่งชี้ถึงการเปลี่ยนแปลงจากการเผาผลาญแบบใช้ออกซิเจนไปเป็นแบบไม่ใช้ออกซิเจน",
      "การค้นพบนี้ ซึ่งตีพิมพ์ในวารสาร PNAS ในเดือนกุมภาพันธ์ 2020 อาจมีผลต่อการค้นหาชีวิตนอกโลกโดยการขยายเกณฑ์สำหรับสิ่งที่ถือว่าเป็นสิ่งมีชีวิต"
    ],
    "commentSummary": [
      "นักวิทยาศาสตร์ได้ค้นพบสัตว์ชนิดแรกที่ไม่ต้องการออกซิเจนในการดำรงชีวิต ซึ่งเป็นการท้าทายสมมติฐานที่ยึดถือกันมานานเกี่ยวกับความจำเป็นสำหรับสิ่งมีชีวิตหลายเซลล์",
      "สิ่งมีชีวิตชนิดนี้ ซึ่งเป็นปรสิตในกลุ่มไนดาเรีย ไม่มีดีเอ็นเอของไมโทคอนเดรีย ซึ่งโดยปกติแล้วจำเป็นสำหรับการหายใจที่ใช้ออกซิเจนในสัตว์",
      "การค้นพบนี้ ซึ่งตีพิมพ์ครั้งแรกในปี 2020 ได้รับความสนใจอีกครั้ง โดยเน้นให้เห็นถึงความสามารถในการปรับตัวและความหลากหลายของสิ่งมีชีวิตในสภาพแวดล้อมที่รุนแรง"
    ],
    "points": 128,
    "commentCount": 51,
    "retryCount": 0,
    "time": 1719136221
  },
  {
    "id": 40766079,
    "title": "ห้าม* ใช้ดาต้าแกรม",
    "originLink": "https://quic.video/blog/never-use-datagrams/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40766079",
    "commentBody": "",
    "originSummary": [
      "เมื่อสร้างแอปพลิเคชันอินเทอร์เน็ต TCP จะถูกเลือกใช้สำหรับการส่งข้อมูลที่เชื่อถือได้ ในขณะที่ UDP จะถูกใช้สำหรับความรวดเร็ว โดยเฉพาะในโปรโตคอลวิดีโอสด",
      "การใช้ UDP โดยตรงมีความเสี่ยงเนื่องจากต้องมีการพัฒนาฟีเจอร์ต่างๆ เช่น การส่งข้อมูลซ้ำและการควบคุมความแออัด; ดังนั้น นักพัฒนาควรใช้ไลบรารี QUIC แทน",
      "QUIC และ Media over QUIC (MoQ) รองรับ datagrams แต่แนะนำให้นักพัฒนามุ่งเน้นการใช้ QUIC streams เพื่อหลีกเลี่ยงปัญหาที่เกี่ยวข้องกับ datagrams"
    ],
    "commentSummary": [
      "การอภิปรายมุ่งเน้นไปที่การใช้ UDP (User Datagram Protocol) เทียบกับ TCP (Transmission Control Protocol) สำหรับการส่งข้อมูล โดยเน้นถึงข้อดีและข้อเสียของแต่ละแบบ",
      "UDP มักถูกเรียกว่า \"ไม่เชื่อถือได้\" หรือ \"พยายามดีที่สุด\" ซึ่งหมายความว่ามันไม่รับประกันการส่งข้อมูล การเรียงลำดับ หรือการตรวจสอบข้อผิดพลาด แตกต่างจาก TCP ที่รับประกันการส่งข้อมูลที่เชื่อถือได้ มีการเรียงลำดับ และตรวจสอบข้อผิดพลาด",
      "การสนทนารวมถึงตัวอย่างการใช้งาน UDP เช่น ข้อมูลเซ็นเซอร์ความถี่สูงและระบบศิลปะสื่อ และอภิปรายเกี่ยวกับคำศัพท์และผลกระทบทางปฏิบัติของการใช้ UDP แทน TCP"
    ],
    "points": 124,
    "commentCount": 139,
    "retryCount": 0,
    "time": 1719135634
  },
  {
    "id": 40769362,
    "title": "เริ่มคำสั่งทั้งหมดของคุณด้วยเครื่องหมายจุลภาค",
    "originLink": "https://rhodesmill.org/brandon/2009/commands-with-comma/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40769362",
    "commentBody": "",
    "originSummary": [
      "ผู้ใช้ Unix มักจะสร้างไดเรกทอรี ~/bin/ ในไดเรกทอรีบ้านของพวกเขาเพื่อเก็บสคริปต์ที่กำหนดเอง แต่สิ่งนี้อาจนำไปสู่การชนกันของชื่อกับคำสั่งระบบ",
      "เพื่อหลีกเลี่ยงการชนกันเหล่านี้ ผู้เขียนแนะนำให้ใส่คำนำหน้าชื่อคำสั่งที่กำหนดเองด้วยเครื่องหมายจุลภาค ซึ่งจะถูกปฏิบัติเป็นอักขระปกติในชื่อไฟล์และหลีกเลี่ยงความขัดแย้ง",
      "เทคนิคนี้ เมื่อรวมกับการเติมคำอัตโนมัติ ทำให้การเรียกดูคำสั่งที่กำหนดเองเป็นเรื่องง่ายและได้พิสูจน์แล้วว่าเป็นวิธีการที่มีประสิทธิภาพมากว่า 10 ปี"
    ],
    "commentSummary": [
      "ผู้ใช้คนหนึ่งได้แชร์วิธีการรันสคริปต์ Python บน Windows โดยการตั้งค่า python.exe เป็นค่าเริ่มต้นสำหรับไฟล์ `.py` และเพิ่ม `.py` เข้าไปใน `%pathext%`",
      "พวกเขาต้องการฟังก์ชันการทำงานที่คล้ายกันบน Linux แต่เผชิญกับความท้าทายเนื่องจากขาดแนวคิด \"โปรแกรมที่เกี่ยวข้อง\" โดยมีข้อเสนอแนะรวมถึงการใช้ shebang (`#!/usr/bin/env python3`), การเปลี่ยนชื่อสคริปต์, การสร้างนามแฝง, หรือการใช้เครื่องมือเช่น `update-alternatives`.",
      "การอภิปรายยังครอบคลุมถึงการจัดการการกำหนดค่าท้องถิ่นด้วย git, การใช้ชื่อย่อ, การจัดการการชนกันของเนมสเปซ, และการจัดระเบียบสคริปต์และการกำหนดค่าด้วยเครื่องมือเช่น `chezmoi` หรือ ansible."
    ],
    "points": 118,
    "commentCount": 42,
    "retryCount": 0,
    "time": 1719166322
  }
]
