[
  {
    "id": 41350530,
    "title": "টেলিগ্রাম কি সত্যিই একটি এনক্রিপ্টেড মেসেজিং অ্যাপ?",
    "originLink": "https://blog.cryptographyengineering.com/2024/08/25/telegram-is-not-really-an-encrypted-messaging-app/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41350530",
    "commentBody": "",
    "originSummary": [
      "টেলিগ্রামের সিইও পাভেল দুরভ সম্প্রতি ফরাসি কর্তৃপক্ষের দ্বারা অপর্যাপ্ত কন্টেন্ট মডারেশনের জন্য গ্রেপ্তার হয়েছেন, যা প্ল্যাটফর্মটির নিরাপত্তা প্র্যাকটিস সম্পর্কে উদ্বেগ উত্থাপন করেছে।",
      "টেলিগ্রামকে প্রায়ই একটি \"এনক্রিপ্টেড মেসেজিং অ্যাপ\" হিসাবে চিহ্নিত করা হয়, তবে এটি ডিফল্টভাবে এন্ড-টু-এন্ড এনক্রিপশন প্রদান করে না, ব্যবহারকারীদের ব্যক্তিগত কথোপকথনের জন্য \"সিক্রেট চ্যাটস\" ম্যানুয়ালি সক্রিয় করতে হয়, যা গ্রুপ চ্যাটের জন্য উপলব্ধ নয়।",
      "যদিও টেলিগ্রামের বৃদ্ধি ঘটেছে, এটি এর এনক্রিপশন ব্যবহারের সুবিধা উন্নত করেনি, এবং এটি একটি নিরাপদ মেসেঞ্জার হিসাবে এর বিপণন বিভ্রান্তিকর, যা ব্যবহারকারীদের জন্য ঝুঁকি সৃষ্টি করে যারা বিশ্বাস করেন যে তাদের কথোপকথন ব্যক্তিগত।"
    ],
    "commentSummary": [
      "আলোচনাটি টেলিগ্রাম সত্যিই একটি এনক্রিপ্টেড মেসেজিং অ্যাপ কিনা তা নিয়ে প্রশ্ন তোলে, এর এন্ড-টু-এন্ড এনক্রিপশন (E2EE) ক্ষমতার উপর গুরুত্বারোপ করে।",
      "‘কাদার গর্ত পরীক্ষা’ উল্লেখ করা হয়েছে, যা প্রস্তাব করে যে আপনি যদি একটি নতুন ডিভাইসে পুরানো বার্তাগুলি পুনরুদ্ধার করতে পারেন, তবে আইন প্রয়োগকারী সংস্থাগুলিও সেগুলিতে প্রবেশ করতে পারে, যা সম্ভাব্য নিরাপত্তা ত্রুটির ইঙ্গিত দেয়।",
      "টেলিগ্রামের গোপনীয়তা নীতিমালা এবং আইন প্রয়োগকারী সংস্থার অনুরোধ মেনে চলার ক্ষমতা নিয়ে বিতর্ক রয়েছে, কিছু লোক যুক্তি দেয় যে এটি একটি বিশ্বাসভিত্তিক অ্যাপ্লিকেশন বরং একটি ক্রিপ্টোগ্রাফিকভাবে সুরক্ষিত নয়।"
    ],
    "points": 554,
    "commentCount": 532,
    "retryCount": 0,
    "time": 1724614493
  },
  {
    "id": 41352681,
    "title": "অস্ট্রেলিয়ান কর্মচারীরা এখন কাজের সময়ের পরে ইমেল, কল উপেক্ষা করার অধিকার পেয়েছেন",
    "originLink": "https://www.reuters.com/world/asia-pacific/australian-employees-now-have-right-ignore-work-emails-calls-after-hours-2024-08-25/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41352681",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "অস্ট্রেলিয়ান কর্মচারীরা এখন আইনি অধিকার পেয়েছেন কাজের সময়ের বাইরে ইমেল এবং কল উপেক্ষা করার, যা তাদের কাজের সময়ের বাইরে সাড়া দেওয়ার চাপ থেকে রক্ষা করার উদ্দেশ্যে।",
      "আইন কর্মচারীদের জন্য একটি আইনি ভিত্তি প্রদান করে যাতে তারা কাজের সময়ের পর যোগাযোগ প্রত্যাখ্যান করতে পারে কোনো প্রতিক্রিয়ার ভয় ছাড়াই, যা ভালো কাজ-জীবনের ভারসাম্য প্রচার করে।",
      "এই পরিবর্তনটি কর্মচারী শোষণ প্রতিরোধ এবং স্বাস্থ্যকর কর্মপরিবেশ নিশ্চিত করার দিকে একটি পদক্ষেপ হিসাবে দেখা হয়।"
    ],
    "points": 443,
    "commentCount": 349,
    "retryCount": 0,
    "time": 1724630887
  },
  {
    "id": 41353328,
    "title": "জিনিসপত্র সরানো কখনোই স্পষ্ট নয় তবে প্রায়শই ভালো হয়",
    "originLink": "https://www.gkogan.co/removing-stuff/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41353328",
    "commentBody": "",
    "originSummary": [
      "পাইনকোনের গ্রেগ কোগান একটি গল্প শেয়ার করেছেন যেখানে তাদের ওয়েবসাইটে একটি ব্যবহার-ভিত্তিক মূল্য নির্ধারণ ক্যালকুলেটর বিভ্রান্তিকর এবং অতিরঞ্জিত খরচ অনুমানের কারণে সম্ভাব্য ব্যবহারকারীদের নিরুৎসাহিত করেছিল।",
      "অনেকবার ব্যর্থ প্রচেষ্টার পর ক্যালকুলেটরটি ঠিক করার জন্য, একটি A/B পরীক্ষা দেখিয়েছে যে এটি সরিয়ে ফেললে সাইন-আপ ১৬% এবং অনুসন্ধান ৯০% বৃদ্ধি পেয়েছে, এবং সহায়তা টিকিটের কোনো বৃদ্ধি হয়নি।",
      "এই ঘটনাটি অপ্রয়োজনীয় উপাদানগুলি সরিয়ে সরলীকরণের মূল্যকে তুলে ধরে, যা দেখায় যে সরলীকরণ আরও ভাল সম্পৃক্ততা, আরও নির্ভরযোগ্য সিস্টেম এবং দ্রুত বৃদ্ধি আনতে পারে।"
    ],
    "commentSummary": [
      "জটিল বৈশিষ্ট্যগুলি, যেমন একটি বিভ্রান্তিকর মূল্য নির্ধারণ ক্যালকুলেটর সরিয়ে ফেলা, ব্যবহারকারীর সাইন-আপ বৃদ্ধি এবং সহায়তা টিকিট হ্রাস করতে পারে।",
      "সহজতা, স্বচ্ছতা এবং ব্যবহারযোগ্যতার মধ্যে ভারসাম্য বজায় রাখা অত্যন্ত গুরুত্বপূর্ণ, বিশেষ করে মূল্য নির্ধারণ মডেলগুলিতে, এবং এ/বি টেস্টিং এই ধরনের পরিবর্তনের প্রভাব মূল্যায়নে সহায়ক হতে পারে।",
      "সিস্টেমগুলি সরলীকরণ এবং মূল কার্যকারিতাগুলির উপর মনোযোগ কেন্দ্রীভূত করা আরও দক্ষ এবং ব্যবহারকারী-বান্ধব পণ্য তৈরি করতে পারে।"
    ],
    "points": 421,
    "commentCount": 179,
    "retryCount": 0,
    "time": 1724637553
  },
  {
    "id": 41351446,
    "title": "সি ভাষায় একটি রাস্ট কম্পাইলার লেখা",
    "originLink": "https://notgull.net/announcing-dozer/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41351446",
    "commentBody": "",
    "originSummary": [
      "জন নানলি একটি সম্পূর্ণ সি-তে লেখা রাস্ট কম্পাইলার, ডোজার, তৈরি করছেন, যা রাস্টের প্রধান কম্পাইলার, রাস্টসি, যা রাস্টে লেখা, তার বুটস্ট্র্যাপিং চ্যালেঞ্জ মোকাবেলা করার জন্য।",
      "প্রকল্পটির লক্ষ্য হল একটি রাস্ট কম্পাইলার তৈরি করা যা সি থেকে বুটস্ট্র্যাপ করা হবে, প্রাথমিকভাবে টিনি সিসি-এর মতো ন্যূনতম সরঞ্জামগুলি দিয়ে শুরু করে এবং ধীরে ধীরে libc, libcore এবং শেষ পর্যন্ত rustc-এর Cranelift ব্যাকএন্ডের মতো প্রয়োজনীয় উপাদানগুলি কম্পাইল করা।",
      "নানলি লেক্সার এবং আংশিক পার্সার সম্পন্ন করেছেন, মৌলিক টাইপচেকিং এবং কোড জেনারেশন সহ, এবং একটি কার্গো সমতুল্য তৈরি করার এবং রুস্টসি এবং কার্গো কম্পাইল করার প্রক্রিয়া স্থাপনের পরিকল্পনা করছেন।"
    ],
    "commentSummary": [
      "সি-তে একটি রাস্ট কম্পাইলার লেখার বিষয়ে আলোচনা, একটি সম্পূর্ণ রাস্ট কম্পাইলার বুটস্ট্র্যাপ করার জন্য সি-তে একটি সরলীকৃত 'প্রোটো-রাস্ট' তৈরির ধারণা অন্বেষণ করা।",
      "আলোচনাটি বিদ্যমান প্রচেষ্টাগুলিকে তুলে ধরে যেমন mrustc, একটি নন-রাস্ট রাস্ট কম্পাইলার, যা একটি বোরো চেকার নেই কিন্তু প্রধান রাস্ট কম্পাইলার rustc কম্পাইল করতে ব্যবহৃত হয়।",
      "বিতর্কটি বিভিন্ন দৃষ্টিভঙ্গি অন্তর্ভুক্ত করে যা বিভিন্ন ভাষায় কম্পাইলার লেখার জটিলতা এবং বাস্তবতার উপর আলোকপাত করে, সরলতা এবং বৈশিষ্ট্য সম্পূর্ণতার মধ্যে আপসের উপর জোর দেয়।"
    ],
    "points": 370,
    "commentCount": 195,
    "retryCount": 0,
    "time": 1724620086
  },
  {
    "id": 41355303,
    "title": "প্রথমবারের মতো অবদানকারী হিসেবে গুগল ক্রোমে একটি বাগ ঠিক করা",
    "originLink": "https://cprimozic.net/blog/fixing-a-bug-in-google-chrome/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41355303",
    "commentBody": "",
    "originSummary": [
      "Chromium/Google Chrome Devtools-এ একটি বাগ, যা ওয়ার্কলেট দ্বারা করা নেটওয়ার্ক অনুরোধ এবং \"ক্যাশ অক্ষম করুন\" বিকল্পটি উপেক্ষা করেছিল, বছরের পর বছর ধরে এর সীমিত প্রভাবের কারণে স্থায়ী হওয়ার পর ঠিক করা হয়েছে।",
      "সমাধানটি কাজের লক্ষ্যগুলির জন্য একটি InspectorNetworkAgent তৈরি করা, Chromium-এর বিস্তৃত কোডবেসে নেভিগেট করা এবং Chromium-এর Gerrit সিস্টেম ব্যবহার করে একটি সম্পূর্ণ পরীক্ষার এবং কোড পর্যালোচনা প্রক্রিয়ার মধ্য দিয়ে যাওয়া জড়িত ছিল।",
      "সমাধানটি দ্রুত ক্রোম ক্যানারিতে সংহত করা হয়েছিল এবং ক্রোম ১৩০-এ অন্তর্ভুক্ত করা হবে, যা একটি বৃহৎ পরিসরের ওপেন-সোর্স প্রকল্পে অবদানকারীর প্রথম গুরুত্বপূর্ণ সাফল্যকে চিহ্নিত করে।"
    ],
    "commentSummary": [
      "একজন প্রথমবারের অবদানকারী সফলভাবে গুগল ক্রোমে একটি বাগ ঠিক করেছেন, যা ক্রোমিয়াম কোডবেস নিয়ে কাজ করার সময় সম্মুখীন হওয়া চ্যালেঞ্জ এবং শেখার অভিজ্ঞতাগুলিকে তুলে ধরেছে।",
      "পোস্টটি ক্রোমিয়াম নেভিগেট এবং নির্মাণের জটিলতা নিয়ে আলোচনা করে, যার মধ্যে VS কোড এবং সাবলাইম টেক্সটের মতো আইডিই (ইন্টিগ্রেটেড ডেভেলপমেন্ট এনভায়রনমেন্ট) সম্পর্কিত সমস্যা এবং শক্তিশালী হার্ডওয়্যারের প্রয়োজনীয়তা অন্তর্ভুক্ত।",
      "আলোচনাটি ক্রোমিয়াম ফর্ক বজায় রাখার সমস্যাগুলিও স্পর্শ করে, যেমন হার্ড-কোডেড ব্রাউজারের নাম এবং চলমান রক্ষণাবেক্ষণ ও নিরাপত্তা আপডেটের জন্য প্রয়োজনীয় উল্লেখযোগ্য সম্পদ।"
    ],
    "points": 364,
    "commentCount": 100,
    "retryCount": 0,
    "time": 1724663456
  },
  {
    "id": 41350225,
    "title": "আজ শিখলাম: UUID এর বিভিন্ন সংস্করণ এবং কখন সেগুলি ব্যবহার করতে হয়",
    "originLink": "https://ntietz.com/blog/til-uses-for-the-different-uuid-versions/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41350225",
    "commentBody": "",
    "originSummary": [
      "UUIDs (ইউনিভার্সালি ইউনিক আইডেন্টিফায়ার) ৮টি সংস্করণে আসে, প্রতিটি নির্দিষ্ট ব্যবহারের ক্ষেত্রে উপযোগী।",
      "সাধারণত ব্যবহৃত সংস্করণগুলির মধ্যে রয়েছে UUID v4 র্যান্ডম আইডির জন্য এবং UUID v7 সাজানো আইডির জন্য, যেমন ডাটাবেস কী।",
      "নতুন সংস্করণগুলি যেমন UUID v5 এবং v8 নির্দিষ্ট ডেটা অন্তর্ভুক্ত করার অনুমতি দেয়, যখন পুরানো সংস্করণগুলি যেমন v1 এবং v6 সাধারণত v7 দ্বারা প্রতিস্থাপিত হয়।"
    ],
    "commentSummary": [
      "পোস্টটি বিভিন্ন সংস্করণের UUID (সর্বজনীনভাবে অনন্য শনাক্তকারী) এবং তাদের নির্দিষ্ট ব্যবহার ক্ষেত্রে আলোচনা করে, যেখানে প্রায়শই উপেক্ষিত UUID সংস্করণ ২ (v2) এবং এর বিবরণ তুলে ধরা হয়েছে।",
      "উল্লেখযোগ্য একটি হলো UUID সংস্করণ ৭ (v7), যা একটি টাইমস্ট্যাম্প অন্তর্ভুক্ত করে, এটি সময়-ভিত্তিক শ্রেণীবিন্যাসের প্রয়োজনীয় অপারেশনগুলির জন্য সুবিধাজনক, যেমন AWS S3-তে মেটাডেটা ফাইলের অবস্থান।",
      "আলোচনায় আরও উল্লেখ করা হয়েছে যে, ছোট এবং আরও মানব-পাঠযোগ্য UUID বিকল্পগুলির প্রয়োজনীয়তা রয়েছে, যেমন ULID (Universally Unique Lexicographically Sortable Identifier) এবং কাস্টম বেস64-এনকোডেড UUIDs।"
    ],
    "points": 295,
    "commentCount": 108,
    "retryCount": 0,
    "time": 1724612720
  },
  {
    "id": 41358020,
    "title": "ডক্কু: আমার প্রিয় ব্যক্তিগত সার্ভারলেস প্ল্যাটফর্ম",
    "originLink": "https://hamel.dev/blog/posts/dokku/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41358020",
    "commentBody": "",
    "originSummary": [
      "ডক্কু একটি ওপেন-সোর্স প্ল্যাটফর্ম অ্যাজ আ সার্ভিস (PaaS) যা একটি একক সার্ভারে স্ব-হোস্টিং করার অনুমতি দেয়, হেরোকুর মতো, তবে আরও সাশ্রয়ী।",
      "মূল বৈশিষ্ট্যগুলির মধ্যে রয়েছে ব্যবহারের সহজতা, Let’s Encrypt এর মাধ্যমে স্বয়ংক্রিয় SSL, মৌলিক প্রমাণীকরণ সমর্থন, সহজ স্কেলিং, এবং বিভিন্ন অ্যাপ্লিকেশনের জন্য নমনীয়তা।",
      "পোস্টটি ডক্কু ব্যবহার করে অ্যাপ্লিকেশন এবং স্ট্যাটিক সাইট স্থাপনের জন্য ব্যবহারিক উদাহরণ প্রদান করে, যার মধ্যে ডকারফাইল সেটআপ, এসএসএইচ অ্যাক্সেস এবং গিটহাব অ্যাকশনস ইন্টিগ্রেশন অন্তর্ভুক্ত রয়েছে।"
    ],
    "commentSummary": [
      "ডক্কু তার সরলতা এবং ন্যূনতম কনফিগারেশনের জন্য একটি পছন্দের স্ব-হোস্টেড প্ল্যাটফর্ম হিসাবে হাইলাইট করা হয়েছে, যা প্রায়শই হেরোকুর সাথে তুলনা করা হয়।",
      "ব্যবহারকারীরা বিভিন্ন সুবিধা এবং অসুবিধা নিয়ে আলোচনা করেন, যার মধ্যে Let's Encrypt দিয়ে HTTPS সেটআপের সহজতা এবং ডিপ্লয়মেন্টের জন্য Docker/Compose ব্যবহারের ক্ষমতা অন্তর্ভুক্ত।",
      "পোস্টটিতে Kubernetes (K8s) এবং Docker Swarm এর মতো অন্যান্য প্রযুক্তির সাথে তুলনা অন্তর্ভুক্ত রয়েছে, যেখানে ছোট, একক-সার্ভার ডিপ্লয়মেন্টের জন্য Dokku এর উপযুক্ততা উল্লেখ করা হয়েছে।"
    ],
    "points": 294,
    "commentCount": 106,
    "retryCount": 0,
    "time": 1724685716
  },
  {
    "id": 41355021,
    "title": "ডাচ ডিপিএ উবারকে €২৯০ মিলিয়ন জরিমানা করেছে কারণ চালকদের ডেটা মার্কিন যুক্তরাষ্ট্রে স্থানান্তর করা হয়েছে",
    "originLink": "https://www.autoriteitpersoonsgegevens.nl/en/current/dutch-dpa-imposes-a-fine-of-290-million-euro-on-uber-because-of-transfers-of-drivers-data-to-the-us",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41355021",
    "commentBody": "",
    "originSummary": [
      "ডাচ ডেটা প্রোটেকশন অথরিটি (ডিপিএ) ইউরোপীয় ট্যাক্সি চালকদের ডেটা যথাযথ সুরক্ষা ছাড়াই যুক্তরাষ্ট্রে স্থানান্তর করার জন্য উবারকে ২৯০ মিলিয়ন ইউরো জরিমানা করেছে, যা জিডিপিআর লঙ্ঘন করেছে।",
      "স্থানান্তরিত ডেটার মধ্যে সংবেদনশীল তথ্য যেমন অ্যাকাউন্টের বিবরণ, অবস্থান ডেটা, এবং অপরাধমূলক ও চিকিৎসা রেকর্ড অন্তর্ভুক্ত ছিল, যা সঠিক সুরক্ষা ছাড়াই ছিল।",
      "এই সমস্যা ২০২০ সালে ইইউ-ইউএস প্রাইভেসি শিল্ড বাতিল হওয়ার পর এবং আগস্ট ২০২১ থেকে উবারের স্ট্যান্ডার্ড কন্ট্রাকচুয়াল ক্লজ ব্যবহার করতে ব্যর্থ হওয়ার পর উদ্ভূত হয়েছিল; উবার জরিমানার বিরুদ্ধে আপত্তি করার পরিকল্পনা করছে।"
    ],
    "commentSummary": [
      "ডাচ ডেটা প্রোটেকশন অথরিটি (ডিপিএ) ফরাসি চালকদের অভিযোগের পর, চালকদের ডেটা যুক্তরাষ্ট্রে স্থানান্তর করার জন্য উবারকে €২৯০ মিলিয়ন জরিমানা করেছে।",
      "এই ঘটনা ডেটা গোপনীয়তা আইনগুলির জটিলতা এবং চ্যালেঞ্জগুলি তুলে ধরে, বিশেষত ইউরোপীয় ইউনিয়নের তুলনায় যুক্তরাষ্ট্রে কঠোর নিয়মাবলী প্রয়োগের ক্ষেত্রে।",
      "এই মামলাটি ব্যক্তিগত ডেটার বৈশ্বিক তৃতীয় পক্ষের প্রবেশাধিকার রোধ করতে মার্কিন যুক্তরাষ্ট্রে আরও শক্তিশালী ডেটা সুরক্ষা আইনের প্রয়োজনীয়তার উপর জোর দেয়।"
    ],
    "points": 286,
    "commentCount": 365,
    "retryCount": 0,
    "time": 1724660155
  },
  {
    "id": 41356528,
    "title": "এনএসএ ১৯৮২ সালের গ্রেস হপার লেকচার প্রকাশ করেছে",
    "originLink": "https://www.nsa.gov/helpful-links/nsa-foia/declassification-transparency-initiatives/historical-releases/view/article/3880193/capt-grace-hopper-on-future-possibilities-data-hardware-software-and-people-1982/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41356528",
    "commentBody": "",
    "originSummary": [
      "এনএসএ ২৬ আগস্ট, ২০২৪-এ রিয়ার অ্যাডমিরাল গ্রেস হপার-এর ১৯৮২ সালের একটি বক্তৃতার ডিজিটাল কপি প্রকাশ করেছে, যা প্রযুক্তিগত নীতিমালা, নেতৃত্ব এবং কম্পিউটার বিজ্ঞান ও গণিতের চ্যালেঞ্জগুলির উপর কেন্দ্রীভূত।",
      "এই প্রকাশনা হপার-এর স্থায়ী উত্তরাধিকার এবং বিজ্ঞান, প্রযুক্তি, প্রকৌশল এবং গণিত (STEM) ক্ষেত্রে নারীদের অনুপ্রাণিত করার ক্ষেত্রে তার ভূমিকা তুলে ধরে।"
    ],
    "commentSummary": [
      "এনএসএ ১৯৮২ সালে গ্রেস হপার দ্বারা প্রদত্ত একটি বক্তৃতা প্রকাশ করেছে, যা পুরানো অ্যাম্পেক্স টেপ থেকে ডিজিটাইজ করা হয়েছে জাতীয় আর্কাইভের সহায়তায়।",
      "বক্তৃতাটি সাইবার নিরাপত্তা, প্রোগ্রামিং ভাষার মানকরণ এবং হপার-এর বিখ্যাত ন্যানোসেকেন্ড/মাইক্রোসেকেন্ড ডায়োরামাগুলির মতো বিষয়গুলি অন্তর্ভুক্ত করে।",
      "এই প্রকাশনাটি কম্পিউটিং ইতিহাসের একটি গুরুত্বপূর্ণ সংরক্ষণ হিসেবে বিবেচিত হয়, যা হপার-এর ক্ষেত্রের অবদানের উপর আলোকপাত করে।"
    ],
    "points": 284,
    "commentCount": 45,
    "retryCount": 0,
    "time": 1724675852
  },
  {
    "id": 41351219,
    "title": "ডাটাবেস “শার্ডিং” এসেছে আলটিমা অনলাইন থেকে? (২০০৯)",
    "originLink": "https://www.raphkoster.com/2009/01/08/database-sharding-came-from-uo/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41351219",
    "commentBody": "",
    "originSummary": [
      "ডাটাবেস স্কেলেবিলিটিতে 'শার্ডিং' শব্দটি, যা সমান্তরাল ডাটাবেস চালানোর সাথে সম্পর্কিত, MMO Ultima Online (UO) থেকে উদ্ভূত হতে পারে।",
      "ইউও-তে, \"শার্ডস\" সমান্তরাল সার্ভারগুলিকে নির্দেশ করত, একটি ধারণা যা গেমের লোরের উপর ভিত্তি করে গেম বিশ্বের একাধিক কপির যৌক্তিকতা ব্যাখ্যা করার জন্য বিকশিত হয়েছিল।",
      "ইউও-এর \"শার্ডস\" এবং ডাটাবেস \"শার্ডিং\"-এর মধ্যে সংযোগটি এখনও অনুমানসাপেক্ষ, তবে এটি গেমিং পরিভাষা এবং ডাটাবেস প্রযুক্তির মধ্যে একটি আকর্ষণীয় সংযোগকে তুলে ধরে।"
    ],
    "commentSummary": [
      "ডাটাবেস প্রেক্ষাপটে 'শার্ডিং' শব্দটি সম্ভবত গেম আলটিমা অনলাইন থেকে উদ্ভূত হয়েছে, যা তার একাধিক গেম জগতকে বর্ণনা করতে 'শার্ড' ব্যবহার করত।",
      "ব্যবহারকারীরা গেমিংয়ের প্রযুক্তিগত উদ্ভাবনের উপর প্রভাব নিয়ে আলোচনা করেছেন, প্রাথমিক MMO (ম্যাসিভলি মাল্টিপ্লেয়ার অনলাইন) প্রযুক্তি এবং আধুনিক অ্যাপ্লিকেশন যেমন ফ্লিকার এবং স্ল্যাকের উপর এর প্রভাব সম্পর্কে গল্প শেয়ার করেছেন।",
      "আলোচনায় শার্ডিং এবং অনুভূমিক বিভাজনের মধ্যে পার্থক্যগুলি, পাশাপাশি শার্ডিং কৌশলের স্কেলেবিলিটি সুবিধাগুলিও অন্তর্ভুক্ত ছিল।"
    ],
    "points": 277,
    "commentCount": 116,
    "retryCount": 0,
    "time": 1724618522
  },
  {
    "id": 41353835,
    "title": "Avante.nvim: আপনার Neovim ব্যবহার করুন যেমন আপনি Cursor AI IDE ব্যবহার করছেন",
    "originLink": "https://github.com/yetone/avante.nvim",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41353835",
    "commentBody": "",
    "originSummary": [
      "**avante.nvim** হল একটি Neovim প্লাগইন যা Cursor AI IDE-এর অনুকরণ করে, AI-চালিত কোড সুপারিশ এবং এই সুপারিশগুলি সহজে প্রয়োগ করার সুবিধা প্রদান করে।",
      "প্রকল্পটি দ্রুত বিকশিত হচ্ছে, নতুন বৈশিষ্ট্যগুলি প্রায়ই যোগ করা হচ্ছে, যা এটি ডেভেলপারদের জন্য একটি গতিশীল সরঞ্জাম করে তুলেছে।",
      "মূল বৈশিষ্ট্যগুলির মধ্যে রয়েছে এআই-চালিত কোড সহায়তা এবং এআই প্রস্তাবনার এক-ক্লিক প্রয়োগ, যা কোডিং দক্ষতা এবং উৎপাদনশীলতা বাড়ায়।"
    ],
    "commentSummary": [
      "Avante.nvim একটি নতুন Neovim প্লাগইন যা AI-চালিত বৈশিষ্ট্যগুলি অফার করার জন্য ডিজাইন করা হয়েছে, যা Cursor, একটি এমবেডেড AI ক্ষমতাসম্পন্ন VSCode ফর্কের অনুরূপ।",
      "আলোচনাটি মালিকানাধীন এআই সরঞ্জামগুলির বিকল্প হিসাবে ওপেন-সোর্স বিকল্পগুলির প্রতি ক্রমবর্ধমান আগ্রহকে তুলে ধরে, যেখানে বেশ কয়েকজন ব্যবহারকারী dingllm.nvim এবং codecompanion.nvim এর মতো অন্যান্য প্লাগইনগুলির উল্লেখ করেছেন।",
      "কোড এডিটরগুলিতে এআই মডেলের কার্যকারিতা এবং সংহতকরণ নিয়ে একটি বিতর্ক রয়েছে, যেখানে কিছু ব্যবহারকারী স্থানীয় ভাষা সার্ভার প্রোটোকল (এলএসপি) এর আরও ভাল সংহতকরণের প্রয়োজনীয়তার উপর জোর দিচ্ছেন যাতে অবৈধ কোড তৈরি এড়ানো যায়।"
    ],
    "points": 208,
    "commentCount": 64,
    "retryCount": 0,
    "time": 1724643888
  },
  {
    "id": 41351993,
    "title": "পুলিশ প্রধান বলেছেন, পুলিশদের দেহ ক্যামেরা বন্ধ রাখার জন্য ৫ম সংশোধনী অধিকার রয়েছে",
    "originLink": "https://reason.com/2024/08/23/albuquerques-police-chief-thinks-cops-have-a-5th-amendment-right-to-leave-their-body-cameras-off/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41351993",
    "commentBody": "",
    "originSummary": [
      "আলবুকার্কি পুলিশ প্রধান হ্যারল্ড মেদিনা একটি গাড়ি দুর্ঘটনার অভ্যন্তরীণ তদন্তের সময় তার দেহ ক্যামেরা ব্যবহার না করার জন্য ৫ম সংশোধনী অধিকার দাবি করেছেন।",
      "আলবুকার্কি পুলিশ বিভাগের ফ্লিট ক্র্যাশ রিভিউ বোর্ড প্রমাণ থাকা সত্ত্বেও দুর্ঘটনাটিকে 'অপ্রতিরোধযোগ্য' বলে মনে করেছে, যা অভ্যন্তরীণ বিষয়ক বিভাগের অনুসন্ধানের বিপরীত।",
      "মেদিনা নীতিমালা লঙ্ঘনের জন্য তিরস্কার পেয়েছেন, যখন অনুরূপ পরিস্থিতিতে অন্যান্য কর্মকর্তারা বরখাস্ত হয়েছেন, যা শাস্তিমূলক পদক্ষেপে সম্ভাব্য অসঙ্গতি নির্দেশ করে।"
    ],
    "commentSummary": [
      "একজন পুলিশ প্রধান দাবি করেছেন যে, ৫ম সংশোধনীর অধীনে, যা আত্ম-অভিযোগ থেকে সুরক্ষা দেয়, কর্মকর্তারা বডি ক্যামেরা বন্ধ করতে পারেন, যদিও আদালত সাধারণত এই সুরক্ষাটি সাক্ষ্যপ্রমাণের জন্য সীমাবদ্ধ রাখে, ভিডিও রেকর্ডিংয়ের জন্য নয়।",
      "সমালোচকরা যুক্তি দেন যে এই অবস্থান জবাবদিহিতাকে ক্ষুণ্ণ করে, কারণ দেহ ক্যামেরার ফুটেজকে সাক্ষ্যপ্রমাণ হিসেবে বিবেচনা করা হয় না।",
      "বিতর্কটি পুলিশ জবাবদিহিতা এবং ব্যক্তিগত অধিকারগুলির মধ্যে চলমান উত্তেজনাকে তুলে ধরে।"
    ],
    "points": 207,
    "commentCount": 128,
    "retryCount": 0,
    "time": 1724624282
  },
  {
    "id": 41353284,
    "title": "স্ব-হোস্টিংয়ের জন্য সার্ভার সেটআপের মৌলিক বিষয়গুলি",
    "originLink": "https://becomesovran.com/blog/server-setup-basics.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41353284",
    "commentBody": "",
    "originSummary": [
      "গাইডটি স্ব-হোস্টিংয়ের জন্য একটি সার্ভার সেটআপ করার প্রয়োজনীয় ধাপগুলি প্রদান করে, এতে SSH লগইন, ব্যবহারকারী ব্যবস্থাপনা, NGINX সেটআপ, লগ ব্যবস্থাপনা, নেটওয়ার্ক নিরাপত্তা এবং দরকারী সরঞ্জামগুলি অন্তর্ভুক্ত রয়েছে।",
      "মূল নিরাপত্তা অনুশীলনগুলির মধ্যে রয়েছে SSH কী ব্যবহার করা, রুট লগইন নিষ্ক্রিয় করা এবং নেটওয়ার্ক নিরাপত্তা বাড়ানোর জন্য UFW এবং Fail2Ban এর মতো সরঞ্জাম কনফিগার করা।",
      "গাইডটি লগ ব্যবস্থাপনা, ব্যাকআপ এবং সার্ভার সম্পদগুলি কার্যকরভাবে পর্যবেক্ষণ ও পরিচালনা করার জন্য মানসম্মত সরঞ্জাম ব্যবহারের গুরুত্বও তুলে ধরে।"
    ],
    "commentSummary": [
      "শুরুতে, কমান্ডে দীর্ঘ-ফর্ম ফ্ল্যাগ ব্যবহার করা (যেমন, `sudo usermod --append --groups sudo newuser`) সংক্ষিপ্ত-ফর্ম ফ্ল্যাগের তুলনায় স্পষ্টতার জন্য সুপারিশ করা হয়।",
      "ক্যাডি (Nginx এবং Certbot প্রতিস্থাপন করে), টেইলস্কেল (SSH অ্যাক্সেস সুরক্ষিত করে), এবং ইউজারিফাই (SSH কী পরিচালনা করে) এর মতো সরঞ্জামগুলি সার্ভার সেটআপ এবং ব্যবস্থাপনাকে সহজ করার জন্য সুপারিশ করা হয়।",
      "নিরাপত্তা টিপসগুলির মধ্যে রয়েছে পাসওয়ার্ড প্রমাণীকরণ নিষ্ক্রিয় করা, লগইন নিয়ন্ত্রণের জন্য `AllowGroups` ব্যবহার করা এবং প্রতিপক্ষের দ্বারা পার্শ্বীয় গতি প্রতিরোধ করতে এজেন্ট বা X11 ফরওয়ার্ডিং এড়ানো।"
    ],
    "points": 161,
    "commentCount": 69,
    "retryCount": 0,
    "time": 1724637043
  },
  {
    "id": 41357557,
    "title": "ডিওজে রিয়েলপেজের বিরুদ্ধে অ্যান্টিট্রাস্ট মামলা দায়ের করেছে",
    "originLink": "https://www.propublica.org/article/realpage-lawsuit-doj-antitrustdoj-files-antitrust-suit-against-maker-of-rent-setting-algorithm",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41357557",
    "commentBody": "",
    "originSummary": [
      "ন্যায়বিচার বিভাগ (DOJ) এবং আটটি রাজ্য টেক্সাসের প্রযুক্তি কোম্পানি রিয়েলপেজের বিরুদ্ধে অভিযোগ করেছে যে তারা অবৈধ মূল্য নির্ধারণের মাধ্যমে বাড়িওয়ালাদের মধ্যে প্রতিযোগিতা কমিয়ে ভাড়া এবং মুনাফা বাড়িয়েছে।",
      "মামলাটি একটি প্রো-পাবলিকা তদন্ত এবং প্রায় দুই বছরের ডিওজে তদন্তের পর আসে, যা প্রকাশ করে যে রিয়েলপেজের ভাড়া নির্ধারণের সফটওয়্যারটি বাড়িওয়ালাদের গোপনীয় তথ্য শেয়ার করতে এবং একই ধরনের ভাড়া নির্ধারণ করতে দেয়, যা বাজারকে একচেটিয়া করে তোলে।",
      "এই মামলাটি বাইডেন প্রশাসনের অধীনে ডিওজির বিস্তৃত অ্যান্টিট্রাস্ট প্রয়াসের অংশ এবং আধুনিক প্রযুক্তির ক্ষেত্রে শেরম্যান অ্যান্টিট্রাস্ট অ্যাক্ট প্রয়োগের চ্যালেঞ্জগুলি তুলে ধরে।"
    ],
    "commentSummary": [
      "বিচার বিভাগ (DOJ) রিয়েলপেজের বিরুদ্ধে একটি অ্যান্টিট্রাস্ট মামলা দায়ের করেছে, অভিযোগ করে যে কোম্পানির অ্যালগরিদমিক মূল্য নির্ধারণ প্রকল্প ভাড়াটিয়াদের ক্ষতি করছে।",
      "মামলাটি দাবি করে যে রিয়েলপেজের মূল্য নির্ধারণের অ্যালগরিদমগুলি কৃত্রিমভাবে ভাড়ার দাম বাড়িয়ে দেয়, যা ভাড়াটিয়াদের জন্য সাশ্রয়ী মূল্যের উপর নেতিবাচক প্রভাব ফেলে।",
      "এই আইনি পদক্ষেপটি বাড়ির বাজারে মূল্য নির্ধারণে অ্যালগরিদম ব্যবহারের এবং এর সম্ভাব্য প্রতিযোগিতা-বিরোধী প্রভাবের বিষয়ে ক্রমবর্ধমান উদ্বেগকে তুলে ধরে।"
    ],
    "points": 156,
    "commentCount": 3,
    "retryCount": 0,
    "time": 1724682990
  },
  {
    "id": 41353079,
    "title": "আমরা আমাদের আবেদনপত্রের স্তূপে উত্তর কোরিয়ার প্রকৌশলীদের খুঁজে পেয়েছি",
    "originLink": "https://www.cinder.co/blog-posts/north-korean-engineers-in-our-application-pile",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41353079",
    "commentBody": "",
    "originSummary": [
      "সিন্ডার, একটি মার্কিন ভিত্তিক প্রযুক্তি কোম্পানি, তাদের আবেদনকারীদের মধ্যে উত্তর কোরিয়ার প্রকৌশলীদের সনাক্ত করেছে, যাদের সন্দেহ করা হচ্ছে উত্তর কোরিয়ার সরকারে অর্থ পাঠানোর জন্য।",
      "সহ-প্রতিষ্ঠাতারা, যাদের সিআইএ পটভূমি ছিল, অস্বাভাবিক প্রবণতা যেমন মিথ্যা চাকরির ইতিহাস, অনলাইন উপস্থিতির অভাব, এবং স্ক্রিপ্টেড সাক্ষাৎকারের প্রতিক্রিয়া লক্ষ্য করেছিলেন।",
      "সিন্ডার তাদের অনুসন্ধানগুলি নিরাপত্তা অংশীদারদের সাথে শেয়ার করেছে এবং অন্যান্য কোম্পানিগুলিকে অনুরূপ সমস্যার জন্য টিপস এবং প্রতিরোধ কৌশলগুলি অনুসন্ধান করার জন্য উৎসাহিত করেছে।"
    ],
    "commentSummary": [
      "উত্তর কোরিয়ার প্রকৌশলীরা Cinder.co-তে একটি চাকরির জন্য আবেদন পুলে পাওয়া গেছে, যা কর্মসংস্থান প্রতারণার সন্দেহ উত্থাপন করেছে।",
      "কর্মজীবনের ইতিহাসে অসঙ্গতি, লিঙ্কডইন প্রোফাইলের অভাব, এবং নামের অমিল সাক্ষাৎকার প্রক্রিয়ার সময় সতর্ক সংকেত ছিল।",
      "লেখক সন্দেহ করেন যে আবেদনকারীরা প্রকৃতপক্ষে উত্তর কোরিয়ার ছিল, যা ইঙ্গিত দেয় যে কর্মসংস্থান জালিয়াতি একটি বিস্তৃত সমস্যা যা কোনো একক জাতীয়তার মধ্যে সীমাবদ্ধ নয়।"
    ],
    "points": 152,
    "commentCount": 120,
    "retryCount": 0,
    "time": 1724635134
  }
]
