[
  {
    "title": "Lunit Partners with Chung Shan Medical University and Gleneagles Hospital for AI Cancer Solutions",
    "originLink": "https://www.biospace.com/article/releases/lunit-expands-ai-medical-imaging-solutions-in-east-and-southeast-asia-partners-with-chung-shan-medical-university-and-gleneagles-hospital-singapore/?s=61",
    "originBody": "Lunit Expands AI Medical Imaging Solutions in East & Southeast Asia: Partners with Chung Shan Medical University and Gleneagles Hospital Singapore Published: Mar 11, 2024 AI-powered Lunit INSIGHT CXR and Lunit INSIGHT MMG to enhance lung and breast cancer detection in Taiwan and Singapore SEOUL, South Korea, March 11, 2024 /PRNewswire/ -- Lunit (KRX:328130.KQ), a leading provider of AI-powered solutions for cancer diagnostics and therapeutics, today announced two supply contracts that mark its strategic expansion into the East and Southeast Asian region. Lunit will supply its Lunit INSIGHT CXR for chest abnormality detection and Lunit INSIGHT MMG for mammography analysis to the Chung Shan Medical University in Taiwan and Gleneagles Hospital in Singapore, respectively. Chung Shan Medical University to Pioneer AI in Lung Cancer Detection Under the newly inked supply contract, Lunit will collaborate with the prestigious Chung Shan Medical University (CSMU), Taiwan's leading medical university. This collaboration holds the potential to revolutionize Taiwan's national lung cancer screening program. Compared to Taiwan's current screening program, which relies on low‐dose computed tomography (LDCT) for screening high-risk individuals such as smokers or those with a family history of lung cancer, CSMU aims to validate Lunit INSIGHT CXR for potential integration into the national cancer screening program. The goal is to assess its ability to detect individuals more accurately and efficiently, potentially expanding the screening to a broader group beyond high-risk individuals. This approach could significantly advance Taiwan's efforts to enhance early detection and improve outcomes in lung cancer screening. Gleneagles Hospital Singapore Chooses Lunit for Enhanced Breast Cancer Screening In a parallel move, Lunit is set to deliver its AI-powered mammography analysis solution, Lunit INSIGHT MMG, to Gleneagles Hospital in Singapore, a prominent private healthcare facility within the IHH group. Gleneagles plans to enhance screening accuracy and operational efficiency by seamlessly integrating Lunit's cutting-edge technology into its breast screening workflow. Gleneagles Hospital, part of Southeast Asia's largest medical group, IHH, is a leading private healthcare provider in the region. Recognized with the Singapore Quality Class certification, the hospital offers extensive clinical facilities with 221 beds, emphasizing its commitment to exceptional standards in healthcare. \"As demand for cutting-edge medical services continues to rise across East and Southeast Asia, Lunit is proud to spearhead the advancement of AI-powered solutions for cancer diagnostics in the region,\" said Brandon Suh, CEO of Lunit. \"Our strategic partnerships with Chung Shan Medical University and Gleneagles Hospital Singapore strengthen our presence and open new opportunities across the market. We believe that these contracts will pave the way for innovative approaches to cancer detection, ultimately improving patient outcomes in areas where they are most crucial.\" About Lunit Founded in 2013, Lunit is a deep learning-based medical AI company on a mission to conquer cancer. We are committed to harnessing AI to ensure accurate diagnosis and optimal treatment for each cancer patient using AI-powered medical image analytics and AI biomarkers. As a medical AI company grounded on clinical evidence, our findings are presented in major peer-reviewed journals, such as the Journal of Clinical Oncology and the Lancet Digital Health, and global conferences, including ASCO and RSNA. After receiving FDA clearance and the CE Mark, our flagship Lunit INSIGHT suite is clinically used in approximately 3,000+ hospitals and medical institutions across 40+ countries. Lunit is headquartered in Seoul, South Korea, with offices and representatives worldwide. For more information, please visit lunit.io. View original content to download multimedia:https://www.prnewswire.com/news-releases/lunit-expands-ai-medical-imaging-solutions-in-east--southeast-asia-partners-with-chung-shan-medical-university-and-gleneagles-hospital-singapore-302083835.html SOURCE Lunit Company Codes: Korea:328130 Email this Facebook Twitter LinkedIn Pinterest Reddit Back to news",
    "originSummary": [
      "Lunit, a top provider of AI-driven solutions for cancer diagnostics, has broadened its reach in East and Southeast Asia through partnerships with Chung Shan Medical University in Taiwan and Gleneagles Hospital in Singapore.",
      "The collaboration will bring Lunit's AI solutions for lung and breast cancer detection to improve screening precision and efficiency in the respective countries.",
      "This expansion highlights Lunit's dedication to enhancing AI-based cancer diagnostic solutions in the region, with a focus on improving patient outcomes, leveraging their expertise since 2013 and already widespread product adoption globally."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1710248866850
  },
  {
    "title": "Lunit Lands Imaging AI Contracts in East and Southeast Asia",
    "originLink": "https://www.auntminnie.com/imaging-informatics/artificial-intelligence/article/15666065/lunit-secures-two-east-and-southeast-asia-contracts",
    "originBody": "IMAGING INFORMATICS ARTIFICIAL INTELLIGENCE Lunit secures two East and Southeast Asia contracts AuntMinnie.com staff writers Mar 11, 2024 Lunit has secured two East and Southeast Asia supply contracts. The company will provide its Insight CXR to Chung Shan Medical University in Taiwan and its Insight MMG to Gleneagles Hospital in Singapore. Chung Shan Medical University plans to integrate Insight CXR into its national lung cancer screening program, while Gleneagles Hospital plans to use Insight MMG to streamline breast cancer screening workflow, it said. Latest in Artificial Intelligence Study calls for improvement of commercial AI algorithms MARCH 8, 2024 ECR: Radiographers optimistic about AI's role in future work MARCH 5, 2024 ECR: AI boosts junior radiologists' breast cancer detection metrics MARCH 4, 2024 ECR: Who's winning the race to implement radiology AI? FEBRUARY 29, 2024 Related Stories Artificial Intelligence Lunit to present studies at ECR 2024 Digital X-Ray Lunit enters supply contract with Samsung Electronics Artificial Intelligence Lunit bids for Volpara Health Womens Imaging Lunit completes stage II of Australian breast cancer screening project",
    "originSummary": [
      "Lunit has obtained supply agreements in East and Southeast Asia for its AI solutions, Insight CXR and Insight MMG, with Chung Shan Medical University in Taiwan and Gleneagles Hospital in Singapore.",
      "Chung Shan Medical University will incorporate Insight CXR into its lung cancer screening initiative, and Gleneagles Hospital will apply Insight MMG to enhance the efficiency of breast cancer screening procedures.",
      "Lunit's active participation in AI radiology studies and collaborations underlines the significance and promise of artificial intelligence in the radiology domain."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1710248866850
  },
  {
    "title": "Lunit Boosts AI Medical Imaging Solutions in Asia",
    "originLink": "https://www.biospectrumasia.com/news/55/23911/lunit-expands-ai-medical-imaging-solutions-in-east-southeast-asia.html",
    "originBody": "Tuesday, 12 March 2024 Subscribe Newsletter Webinars Editorial Calendar 2024 Media Kit Toggle navigation HOME Pharma Generics Drug Discovery CMC & Manufacturing Clinical Trials New Drug Applications BioTech Biologics Stem Cells Vaccines Therapeutics MedTech Medical Devices Medical Diagnostic BioServices Contract Research Clinical Research Contract Manufacturing Pre Clinical Development Clinical Trial Phase Healthcare Digital Health COVID19 Artificial Intelligence Bio LAB Lab Products Lab Safety Lab Management Lab Design HER Health Cell & Gene Specials Bio interaction Premium Article Biopreneurs Industry Insights Bio Money Bio Informatics Bio Jobs Infomercial Partner Content BioSpectrum Asia Awards 2022 Country Australia China India Japan Korea Malaysia New Zealand Singapore Taiwan Thailand Indonesia Vietnam North America World Middle East countries Europe SAARC Country Taiwan Lunit expands AI medical imaging solutions in East & Southeast Asia Lunit expands AI medical imaging solutions in East & Southeast Asia 11 March 2024News Partners with Chung Shan Medical University in Taiwan and Gleneagles Hospital Singapore image credit- shutterstock Lunit, a leading provider of artificial intelligence (AI)-powered solutions for cancer diagnostics and therapeutics, has announced two supply contracts that mark its strategic expansion into the East and Southeast Asian region. South Korean startup Lunit will supply its Lunit INSIGHT CXR for chest abnormality detection and Lunit INSIGHT MMG for mammography analysis to the Chung Shan Medical University (CSMU) in Taiwan and Gleneagles Hospital in Singapore, respectively. Gleneagles plans to enhance screening accuracy and operational efficiency by seamlessly integrating Lunit's cutting-edge technology into its breast screening workflow. Compared to Taiwan's current screening programme, which relies on low‐dose computed tomography (LDCT) for screening high-risk individuals such as smokers or those with a family history of lung cancer, CSMU aims to validate Lunit INSIGHT CXR for potential integration into the national cancer screening programme. The goal is to assess its ability to detect individuals more accurately and efficiently, potentially expanding the screening to a broader group beyond high-risk individuals. This approach could significantly advance Taiwan's efforts to enhance early detection and improve outcomes in lung cancer screening. Sign up for the editor pick and get articles like this delivered right to your inbox. Name * Email * Country * Organisation * Contact Number * +Country Code-Phone Number(xxx-xxxxxxx) Submit Comments Comment Log In To Comment New User? Create Account Podcast Editors Picks Engendering Inclusivity & D... Can Shorter Regimens Elimin... Why Singapore is Deep Tech ... \"One example of success is ... Premium Article How pharma is finally researching i 3 Practical Ways to Encourage Women Most read Biocytogen Pharma Beijing and Gilea Researchers in Asia develop tool to Japan's Nanophoton strengthens Bruk China Medical University Hospital i Survey Box Is APAC region engendering inclusivity & diversity in life sciences? Yes No May be Vote View poll results More polls Subscribe to BioSpectrum Asia Subscribe Now! Enquiry Name Email Phone Message Send message Contact Us 1 North Bridge Road, #08-08 High Street Centre, Singapore 179094 Email : communications@biospectrumasia.com +65 90150305 Visit Our Digital Magazine BioSpectrum India NuFFooDS Spectrum Privacy Policy Sitemap © 2024 MM Activ Sci-Tech Communications. All rights reservedDisclaimer Web Interface Conceived and Powered By : SCI Knowledge Interlinks Have an Account? Login Create Account Forgot Password Login Email id Password Sign In Create Account City First Name Last Name Email ID Password Confirm Password Newsletter E-magazine Biospectrum Infomercial Bio Resource I accept the terms & condition & Privacy policy Sign Up Forgot Password Email id Submit Close × Subscribe To Our Newsletter Email ID I accept the terms & condition & Privacy policy SUBSCRIBE! Close",
    "originSummary": [
      "Lunit, a South Korean startup, secured supply contracts with Chung Shan Medical University in Taiwan and Gleneagles Hospital in Singapore for their AI-driven medical imaging solutions for cancer diagnosis.",
      "The agreements involve deploying Lunit's technology for detecting chest abnormalities and analyzing mammograms, intending to enhance screening precision and effectiveness in East and Southeast Asia.",
      "Taiwan's initiative to incorporate Lunit's AI tech into its national cancer screening program demonstrates a commitment to improving early detection and outcomes in lung cancer screening."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1710248866850
  },
  {
    "title": "Upstage Teams Up with Law & Company to Launch AI Legal Adviser \"Solar-Legal\"",
    "originLink": "https://www.ajudaily.com/view/20240312173932973",
    "originBody": "이미지 확대 [Courtesy of Upstage] SEOUL -- South Korean artificial intelligence technology developer Upstage will work with domestic legal tech firm Law & Company to create an AI-driven legal advisor that can analyze complicated legal precedents. Upstage's large language model-based solution called \"Solar\" be upgraded into the AI legal assistant after studying 160,000 legal cases provided by Law & Company. Solar is a deep-learning-based AI platform capable of understanding and generating content. In August of last year, the solution secured the top position on an international large language model scoreboard run by Hugging Face, a New York City-based AI company. Solar has competed with some 500 models including GPT-3, a Chat GPT-based service. Upstage partnered with Law & Company to enable Solar to acquire expertise in legal matters. Despite Solar's exceptional ability in learning spoken language, mastering legal expertise could pose a significant challenge due to the complexity of professional terminologies. Law & Company will offer its accumulated legal data to develop the new legal solution called \"Solar-Legal.\" Solar-Legal is set to be released in June 2024. It will be utilized in Law & Company's business-to-business solution \"Super Lawyer,\" which provides legal research, document summarization, and Q&A services. \"We will continue to enhance AI models specializing in legal issues targeting the domestic and international legal service markets based on our world-class language model Solar,\" Upstage CEO Kim Sung-hoon said in a statement on March 12. Kim Joo-heon jhkim123@ajunews.com © Aju Business Daily & www.ajunews.com Copyright: All materials on this site may not be reproduced, distributed, transmitted, displayed, published or broadcast without the authorization from the Aju News Corporation.",
    "originSummary": [
      "Upstage, a South Korean AI technology developer, partners with legal tech firm Law & Company to develop Solar-Legal, an AI legal advisor.",
      "Solar-Legal, based on a vast language model AI platform, will analyze legal precedents after examining 160,000 legal cases.",
      "Scheduled for release in June 2024, Solar-Legal will integrate into Law & Company's \"Super Lawyer,\" offering solutions for legal research and document summarization."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1710248866850
  }
]
