[
  {
    "id": 41090304,
    "title": "फेसबुक ने अपने प्रतिस्पर्धी के एन्क्रिप्टेड मोबाइल ऐप ट्रैफिक को कैसे इंटरसेप्ट किया?",
    "originLink": "https://doubleagent.net/onavo-facebook-ssl-mitm-technical-analysis/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41090304",
    "commentBody": "",
    "originSummary": [
      "मेटा के खिलाफ एक सामूहिक मुकदमे में खुलासा हुआ कि फेसबुक ने प्रतिस्पर्धात्मक जानकारी प्राप्त करने के लिए ओनावो प्रोटेक्ट ऐप चलाने वाले उपयोगकर्ताओं के उपकरणों से एन्क्रिप्टेड ट्रैफिक को इंटरसेप्ट किया।",
      "फेसबुक ने कथित तौर पर एक MITM (मैन-इन-द-मिडल) हमले का उपयोग किया, जिसे \"ssl बंप\" कहा जाता है, ताकि स्नैपचैट, यूट्यूब और अमेज़न जैसे डोमेन से ट्रैफिक को डिक्रिप्ट किया जा सके।",
      "ओनावो प्रोटेक्ट ऐप ने विस्तृत ऐप उपयोग सांख्यिकी और संवेदनशील डेटा एकत्र किया, जिससे महत्वपूर्ण कानूनी और नैतिक चिंताएँ उत्पन्न हुईं।"
    ],
    "commentSummary": [
      "फेसबुक ने उपयोगकर्ताओं को 'बाजार अनुसंधान' के नाम पर एक प्रॉक्सी स्थापित करने के लिए भुगतान किया, जिससे उन्हें प्रतिस्पर्धियों के एन्क्रिप्टेड मोबाइल ऐप ट्रैफिक को इंटरसेप्ट और डिक्रिप्ट करने की अनुमति मिली।",
      "ऐप, ओनावो, जिसे एक वीपीएन के रूप में विपणन किया गया था, का उपयोग प्रतिस्पर्धियों पर डेटा एकत्र करने के लिए किया गया, जिससे कानूनी और नैतिक चिंताएं उत्पन्न हुईं, जिसमें संभावित वायरटैपिंग कानून उल्लंघन शामिल हैं।",
      "हालांकि उपयोगकर्ताओं ने निगरानी के लिए सहमति दी, लेकिन डेटा संग्रह की सीमा की उनकी समझ की स्पष्टता संदिग्ध बनी हुई है।"
    ],
    "points": 427,
    "commentCount": 174,
    "retryCount": 0,
    "time": 1722125301
  },
  {
    "id": 41090658,
    "title": "अपने बैटरी डिज़ाइन को डिबग कैसे करें",
    "originLink": "https://github.com/ionworks/how-to-debug-your-battery",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41090658",
    "commentBody": "",
    "originSummary": [
      "PyBaMM एक ओपन-सोर्स पायथन टूल है जिसे बैटरी भौतिकी का अनुकरण करने के लिए डिज़ाइन किया गया है, जिससे यह बैटरी अनुसंधान और विकास (R&D) के लिए एक मूल्यवान संसाधन बन जाता है।",
      "यह उपकरण बैटरी अनुसंधान और विकास में एक सामान्य चुनौती, आयामों की अभिशाप, को जटिल सिमुलेशनों को सरल बनाकर संबोधित करने में मदद करता है।",
      "PyBaMM विशेष रूप से उन शोधकर्ताओं और इंजीनियरों के लिए उपयोगी है जो बैटरी के व्यवहार को अधिक कुशलता से मॉडल और समझना चाहते हैं।"
    ],
    "commentSummary": [
      "एक-कारक-पर-एक-समय परीक्षण बैटरी डिजाइन के लिए अक्षम है; आधुनिक प्रायोगिक डिजाइन विधियाँ कम परीक्षणों के साथ अनुकूलन कर सकती हैं।",
      "PyBaMM (पायथन बैटरी गणितीय मॉडलिंग) सभी अनुकूलनों को सीधे शामिल नहीं करता है, जिससे बड़े डिज़ाइन स्पेस के लिए अधिक परिष्कृत तरीकों की आवश्यकता होती है।",
      "बैटरी परियोजनाओं में ऊर्जा प्रोफाइलिंग और वर्तमान मापन के लिए नॉर्डिक सेमीकंडक्टर के PPK II, हॉल इफेक्ट सेंसर, और शंट रेजिस्टर्स जैसे उपकरणों की सिफारिश की जाती है।"
    ],
    "points": 232,
    "commentCount": 71,
    "retryCount": 0,
    "time": 1722130746
  },
  {
    "id": 41089558,
    "title": "एप्पल ने मैरीलैंड में स्टोर कर्मचारियों के साथ अपना पहला संघ अनुबंध किया है",
    "originLink": "https://apnews.com/article/apple-union-contract-maryland-store-f9884d978bf3129c37726dd7978392a5",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41089558",
    "commentBody": "",
    "originSummary": [
      "इंटरनेशनल एसोसिएशन ऑफ मशीनिस्ट्स एंड एयरोस्पेस वर्कर्स के ऑर्गनाइज्ड रिटेल एम्प्लॉइज कोएलिशन ने मैरीलैंड के एक स्टोर के कर्मचारियों के लिए एप्पल के साथ तीन साल के समझौते की घोषणा की, जिसमें वेतन में औसतन 10% की वृद्धि और अन्य लाभ शामिल हैं।",
      "समझौते को लगभग 85 कर्मचारियों द्वारा अनुमोदन लंबित है, और इसे 6 अगस्त को मतदान के लिए रखा जाएगा, मई में असंतोषजनक वार्ताओं के कारण हड़ताल प्राधिकरण के बाद।",
      "यह मैरीलैंड स्टोर अमेरिका में केवल दो यूनियनाइज्ड एप्पल स्थानों में से एक है, जिसमें दूसरा ओक्लाहोमा सिटी में है, जो अभी भी बिना अनुबंध के है।"
    ],
    "commentSummary": [
      "एप्पल ने मैरीलैंड में स्टोर कर्मचारियों के साथ अपना पहला यूनियन अनुबंध साइन किया है, जो कंपनी के लिए श्रम संबंधों में एक महत्वपूर्ण मील का पत्थर है।",
      "ऐसी अटकलें हैं कि Apple ने संघर्ष से बचने के लिए अनुबंध पर सहमति जताई हो सकती है, कुछ का सुझाव है कि अगर यूनियन बनने से समस्याएं उत्पन्न होती हैं तो कंपनी स्टोर बंद कर सकती है, हालांकि केवल यूनियन बनने के कारण स्टोर बंद करना अवैध है और इसे साबित करना कठिन है।",
      "यूनियनों के प्रभाव और आवश्यकता पर बहस जारी है, जिसमें श्रमिकों के अधिकारों की रक्षा के पक्ष में और व्यवसायों को संभावित नुकसान के खिलाफ तर्क दिए जा रहे हैं।"
    ],
    "points": 169,
    "commentCount": 147,
    "retryCount": 0,
    "time": 1722116811
  },
  {
    "id": 41091803,
    "title": "अतार्किक भूखे न्यायाधीश प्रभाव पुनः परीक्षण (2023)",
    "originLink": "https://www.cambridge.org/core/journals/judgment-and-decision-making/article/irrational-hungry-judge-effect-revisited-simulations-reveal-that-the-magnitude-of-the-effect-is-overestimated/61CE825D4DC137675BB9CAD04571AE58",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41091803",
    "commentBody": "",
    "originSummary": [
      "तकनीकी समस्याओं के कारण 10 जुलाई 2024 से ऑनलाइन ऑर्डरिंग वर्तमान में उपलब्ध नहीं है; उपयोगकर्ताओं को सलाह दी जाती है कि वे अपडेट के लिए वेबसाइट की जांच करें।",
      "डानज़िगर, लेवाव, और अवनाइम-पेसो (2011) द्वारा किए गए एक अध्ययन में पाया गया कि इजरायली न्यायाधीशों के अनुकूल पैरोल निर्णय एक सत्र के भीतर काफी हद तक कम हो गए, लेकिन एक ब्रेक के बाद प्रारंभिक स्तरों पर वापस आ गए, जो मानसिक थकावट का संकेत देता है।",
      "सिमुलेशन संकेत देते हैं कि इस प्रभाव को अधिक आंका जा सकता है और यह सांख्यिकीय कलाकृतियों के कारण हो सकता है, जैसे कि लंबे समय तक अनुकूल निर्णय और न्यायाधीशों द्वारा तर्कसंगत समय प्रबंधन, जिसके लिए आगे के शोध की आवश्यकता है।"
    ],
    "commentSummary": [
      "‘अतार्किक भूखे न्यायाधीश प्रभाव’ अध्ययन, जिसमें दावा किया गया था कि न्यायाधीश दोपहर के भोजन के बाद अधिक उदार होते हैं, को पुनः जांचा गया है और इसमें महत्वपूर्ण खामियां पाई गई हैं।",
      "मूल शोध ने मामलों के गैर-यादृच्छिक क्रम को ध्यान में नहीं रखा, जिसमें पहले कम गंभीर मामलों को देखा गया और बाद में अधिक गंभीर मामलों को देखा गया, जिससे परिणाम प्रभावित हुए।",
      "आलोचकों का सुझाव है कि मामलों के क्रम को यादृच्छिक बनाने से अधिक कुशल और न्यायसंगत न्यायिक निर्णय हो सकते हैं, जिससे निर्णय लेने पर भूख के प्रभाव और मनोवैज्ञानिक अध्ययनों की विश्वसनीयता के बारे में व्यापक प्रश्न उठते हैं।"
    ],
    "points": 160,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1722152111
  },
  {
    "id": 41092861,
    "title": "प्रक्रियात्मक गेमडेव के लिए मेरे पसंदीदा उपकरण और तकनीकें",
    "originLink": "https://cprimozic.net/blog/tools-and-techniques-for-procedural-gamedev/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41092861",
    "commentBody": "",
    "originSummary": [
      "ट्रिप्लानर मैपिंग यूवी मैप्स के बिना टेक्सचरिंग को सरल बनाता है, जिससे यह प्रक्रियात्मक भूभाग के लिए आदर्श बन जाता है, बेहतर ब्लेंडिंग और प्रदर्शन के लिए सुधारों के साथ।",
      "एआई-संचालित पीबीआर (भौतिक आधारित रेंडरिंग) टेक्सचर सिंथेसिस कृत्रिम बुद्धिमत्ता का उपयोग करके उच्च-गुणवत्ता वाली टेक्सचर उत्पन्न करता है, जिससे दृश्य निष्ठा में सुधार होता है।",
      "भविष्य के कार्यों में उन्नत जाल हेरफेर के लिए निर्माणात्मक ठोस ज्यामिति (CSG) को लागू करना शामिल है, जैसे कि क्षति का अनुकरण करने के लिए जालों को मिलाना और काटना।"
    ],
    "commentSummary": [
      "यह पोस्ट प्रक्रियात्मक गेम विकास के लिए विभिन्न उपकरणों और तकनीकों पर चर्चा करती है, जिसमें शामिल चुनौतियों और जटिलताओं को उजागर किया गया है।",
      "उपयोगकर्ता अपने अनुभव और कठिनाइयों को साझा करते हैं, जैसे कि ज्यामिति को जोड़ना और यथार्थवादी भू-भाग उत्पन्न करना।",
      "लेख को प्रक्रियात्मक तकनीकों में अंतर्दृष्टि के लिए सराहा गया है, कुछ उपयोगकर्ताओं ने इस क्षेत्र में आवश्यक विशिष्ट कौशल पर ध्यान दिया है।"
    ],
    "points": 159,
    "commentCount": 12,
    "retryCount": 0,
    "time": 1722171392
  },
  {
    "id": 41088895,
    "title": "ट्राइटोन प्रतिस्थापन",
    "originLink": "https://johncarlosbaez.wordpress.com/2024/07/27/tritone-substitutions/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41088895",
    "commentBody": "",
    "originSummary": [
      "एक ट्राइटोन सब्स्टीट्यूशन एक संगीत तकनीक है जो एक प्रमुख सप्तक कॉर्ड को एक अन्य कॉर्ड से बदल देती है जिसका मूल एक ट्राइटोन की दूरी पर होता है, जिससे संगीत में परिष्कार जुड़ता है।",
      "सी की कुंजी में, प्रमुख सप्तक कॉर्ड G-B-D-F को C♯-F-G♯-B से बदला जा सकता है, जो मूल कॉर्ड के कुछ नोट्स को बनाए रखते हुए एक अनोखा मोड़ जोड़ता है।",
      "डेविड बेनेट और माइकल कीथसन वीडियो व्याख्याएं और उदाहरण प्रदान करते हैं, जिसमें बेनेट लोकप्रिय गीतों पर ध्यान केंद्रित करते हैं और कीथसन एक अधिक विश्लेषणात्मक दृष्टिकोण प्रस्तुत करते हैं, जिसमें प्रमुख कॉर्ड्स पर पाठ शामिल हैं।"
    ],
    "commentSummary": [
      "जैज़ में ट्राइटोन प्रतिस्थापन का मतलब है एक प्रमुख सप्तक (V7) को एक अन्य प्रमुख सप्तक से बदलना जो ट्राइटोन की दूरी पर होता है (II♭7), जिससे एक क्रोमैटिक अवरोही बासलाइन बनती है।",
      "इस तकनीक का उपयोग हार्मोनिक रुचि जोड़ने के लिए किया जाता है और यह जैज़ में आम है, साथ ही लोकप्रिय संगीत जैसे सिम्पसन्स थीम और बीटल्स के 'आई एम द वालरस' में भी।",
      "चर्चा संगीत सिद्धांत की अवधारणाओं जैसे गाइड टोन (तीसरे और सातवें नोट) और हार्मोनिक विश्लेषण के ऐतिहासिक संदर्भ को समझने के महत्व को उजागर करती है।"
    ],
    "points": 157,
    "commentCount": 102,
    "retryCount": 0,
    "time": 1722109954
  },
  {
    "id": 41092460,
    "title": "कैल्कजीपीटी",
    "originLink": "https://calcgpt.io/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41092460",
    "commentBody": "",
    "originSummary": [
      "कैल्कजीपीटी, कैल्विन लियांग द्वारा विकसित, एक व्यंग्यात्मक कैलकुलेटर है जो जीपीटी-3 भाषा मॉडल का उपयोग करता है और आधुनिक एआई के प्रति जुनून की आलोचना करता है।",
      "यह एक गणनात्मक उपकरण और सामाजिक टिप्पणी दोनों के रूप में कार्य करता है, जीवन के सभी पहलुओं में एआई की आवश्यकता पर सवाल उठाता है।",
      "जानबूझकर धीमा और त्रुटिपूर्ण होने के कारण, CalcGPT पारंपरिक तरीकों और नवाचार के बीच संतुलन पर विचार करने के लिए प्रेरित करता है।"
    ],
    "commentSummary": [
      "CalcGPT, एक हास्यपूर्ण एआई एप्लिकेशन, अपनी व्यंग्यात्मक दृष्टिकोण के लिए रुचि उत्पन्न कर रहा है, विशेष रूप से बुनियादी अंकगणितीय संचालन करने में एआई क्षमताओं पर।",
      "एप्लिकेशन एक पुराना GPT-3 मॉडल (बेबेज-002) का उपयोग करता है, जो जानबूझकर गलत और मनोरंजक परिणाम देता है, जिससे पुराने और नए एआई मॉडलों जैसे GPT-4 के बीच के अंतर को उजागर किया जाता है।",
      "इसके हास्यपूर्ण स्वभाव के बावजूद, CalcGPT एआई प्रचार की आलोचना के रूप में कार्य करता है, जो पहले के मॉडलों की सीमाओं को दर्शाता है और एआई प्रौद्योगिकी में प्रगति पर चर्चाओं को प्रज्वलित करता है।"
    ],
    "points": 152,
    "commentCount": 41,
    "retryCount": 0,
    "time": 1722164931
  },
  {
    "id": 41090222,
    "title": "प्लान 9 एक विशिष्ट रूप से संपूर्ण ऑपरेटिंग सिस्टम है",
    "originLink": "https://posixcafe.org/blogs/2024/07/27/0/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41090222",
    "commentBody": "",
    "originSummary": [
      "प्लान 9 एक व्यापक ऑपरेटिंग सिस्टम है जिसमें बेस इंस्टॉल में सभी आवश्यक सॉफ़्टवेयर शामिल होते हैं, जैसे कि कंपाइलर, ग्राफिकल वातावरण, और टेक्स्ट एडिटर।",
      "लिनक्स और बीएसडी सिस्टम के विपरीत, प्लान 9 का एकल डिजाइन सुसंगतता सुनिश्चित करता है और सॉफ्टवेयर विकास को सरल बनाता है क्योंकि इसे कई कॉन्फ़िगरेशन के खिलाफ परीक्षण करने की आवश्यकता नहीं होती है।",
      "हालांकि प्लान 9 में मुख्यधारा के सिस्टमों की तुलना में कुछ विशेषताओं की कमी हो सकती है, यह ऑपरेटिंग सिस्टम के प्रयोग और सीखने के लिए एक उत्कृष्ट संसाधन और सैंडबॉक्स के रूप में कार्य करता है।"
    ],
    "commentSummary": [
      "प्लान 9 एक ऑपरेटिंग सिस्टम है जो 9P2000.L फाइलसिस्टम प्रोटोकॉल का उपयोग करके विंडोज और विंडोज सबसिस्टम फॉर लिनक्स (WSL) पर C ड्राइव तक क्रॉस-प्लेटफॉर्म एक्सेस को सक्षम बनाता है।",
      "Microsoft ने इसकी सरलता और मौजूदा सर्वर कोड के कारण Plan 9 को Samba के ऊपर चुना, जिसमें \\\\wsl$\\ पथ को Windows में MUP द्वारा प्रबंधित किया जाता है और संचार एक Unix सॉकेट के माध्यम से होता है।",
      "प्लान 9 संयोज्य सॉफ़्टवेयर पर केंद्रित है, जो छोटे, केंद्रित कार्यक्रमों के यूनिक्स दर्शन का पालन करता है, लेकिन आधुनिक सुविधाओं और एकीकरण की कमी के कारण यह एक सीमित रुचि बना हुआ है।"
    ],
    "points": 144,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1722124352
  },
  {
    "id": 41089911,
    "title": "इंटेल N100 राडक्सा X4 प्रथम विचार",
    "originLink": "https://bret.dk/intel-n100-radxa-x4-first-thoughts/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41089911",
    "commentBody": "",
    "originSummary": [
      "Radxa ने Intel N100-आधारित Radxa x4 सिंगल बोर्ड कंप्यूटर (SBC) की घोषणा की, जो आकार में Raspberry Pi 5 के समान है और इसमें x86 Intel N100 प्रोसेसर है।",
      "रैडक्सा x4 विंडोज 11 और डेबियन 12 का समर्थन करता है, जिसमें सुचारू इंस्टॉलेशन होते हैं लेकिन प्रारंभ में नेटवर्क ड्राइवरों की कमी होती है।",
      "मुख्य विशेषताओं में 2.5Gबिट ईथरनेट, M.2 NVMe समर्थन, और एक व्यापक BIOS शामिल हैं, हालांकि इसे बेहतर दस्तावेज़ीकरण और शीतलन समाधान की आवश्यकता है।"
    ],
    "commentSummary": [
      "इंटेल N100 Radxa X4 एक नया सिंगल-बोर्ड कंप्यूटर (SBC) है जिसकी कीमत $60 है, जो x86 आर्किटेक्चर, हार्डवेयर ट्रांसकोडिंग प्रदान करता है और बताया जा रहा है कि यह रास्पबेरी पाई 5 से तीन गुना अधिक शक्तिशाली है।",
      "मुख्य विशेषताओं में 2.5G NIC (नेटवर्क इंटरफेस कार्ड) शामिल है जिसमें PoE (पावर ओवर ईथरनेट) समर्थन और एक m.2 स्लॉट है, जो Raspberry Pi की तुलना में महत्वपूर्ण मूल्य जोड़ता है।",
      "बोर्ड ने अपनी प्रतिस्पर्धी कीमत, उन्नत प्रदर्शन, और मौजूदा रास्पबेरी पाई केसों में फिट होने की क्षमता के कारण रुचि उत्पन्न की है, जिससे यह शौकिया और पेशेवर दोनों के लिए एक आकर्षक विकल्प बन गया है।"
    ],
    "points": 143,
    "commentCount": 126,
    "retryCount": 0,
    "time": 1722120717
  },
  {
    "id": 41088592,
    "title": "मैनागार्म: प्रैगमैटिक माइक्रोकर्नेल-आधारित ऑपरेटिंग सिस्टम जिसमें असिंक्रोनस I/O है",
    "originLink": "https://github.com/managarm/managarm",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41088592",
    "commentBody": "",
    "originSummary": [
      "मैनागार्म एक माइक्रोकर्नेल-आधारित ऑपरेटिंग सिस्टम है, जो लिनक्स और विंडोज से भिन्न है, और इसमें I/O के लिए एक पूरी तरह से असिंक्रोनस API और अच्छी लिनक्स उपयोगकर्ता स्थान संगतता है।",
      "यह एक लिनक्स वितरण नहीं है लेकिन कई लिनक्स एपीआई का समर्थन करता है, जिसमें 64-बिट समर्थन, आधुनिक हार्डवेयर संगतता, और POSIX अनुपालन जैसी विशेषताएं शामिल हैं।",
      "उपयोगकर्ता मैनागार्म को आज़माने के लिए एक नाइटली इमेज डाउनलोड कर सकते हैं और इसे विशिष्ट क्यूईएमयू फ्लैग्स के साथ चला सकते हैं, जो वेस्टन और जीएनयू कोरयूटिल्स जैसे सॉफ़्टवेयर और यूएसबी कंट्रोलर्स और विभिन्न ग्राफिक्स कार्ड जैसे हार्डवेयर का समर्थन करता है।"
    ],
    "commentSummary": [
      "मैनागार्म एक माइक्रोकर्नेल-आधारित ऑपरेटिंग सिस्टम है जिसमें असिंक्रोनस I/O है, जिसे मुख्य रूप से QEMU, एक लोकप्रिय ओपन-सोर्स एमुलेटर, पर परीक्षण किया गया है।",
      "इस परियोजना ने आधुनिक ड्राइवर समर्थन, जिसमें USB शामिल है, और वास्तविक हार्डवेयर पर चलने की संभावनाओं के कारण रुचि प्राप्त की है, हालांकि इसे निम्न-स्तरीय घटकों पर चुनौतियों का सामना करना पड़ता है।",
      "हाल के अपडेट में एक आधुनिक वेब ब्राउज़र चलाने की क्षमता शामिल है, जो महत्वपूर्ण प्रगति और कार्यक्षमता में सुधार को दर्शाता है।"
    ],
    "points": 136,
    "commentCount": 53,
    "retryCount": 0,
    "time": 1722107174
  },
  {
    "id": 41089161,
    "title": "2024 में अमीगा के लिए विकास पर Roguecraft डेवलपर्स",
    "originLink": "https://www.timeextension.com/features/interview-its-easy-to-get-a-bit-over-ambitious-roguecraft-devs-on-developing-for-amiga-in-2024",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41089161",
    "commentBody": "",
    "originSummary": [
      "रोगक्राफ्ट, जिसे बैजर पंच गेम्स द्वारा विकसित किया गया है, एक अत्यधिक प्रत्याशित अमीगा गेम है जो सितंबर 2024 में रिलीज़ के लिए निर्धारित है, रोग 64 की सफलता के बाद।",
      "विकास, जिसे प्रारंभ में 6 महीने के लिए योजना बनाई गई थी, अमीगा के हार्डवेयर के साथ काम करने की जटिलताओं के कारण 2 साल तक बढ़ गया, इसके बावजूद कि इसमें गति और समर्पित कोप्रोसेसर जैसे फायदे थे।",
      "इस खेल में आइसोमेट्रिक ग्राफिक्स, 100 से अधिक कमरे के विविधताएँ शामिल हैं, और यह थालामस डिजिटल के माध्यम से प्री-ऑर्डर के लिए उपलब्ध है, जिसे समुदाय से सकारात्मक प्रतिक्रिया मिली है।"
    ],
    "commentSummary": [
      "रोगक्राफ्ट डेवलपर्स 2024 में अमीगा प्लेटफॉर्म पर विकास के लिए चुनौतियों और कार्यप्रवाहों पर चर्चा करते हैं, जिसमें एमुलेटर और आधुनिक सिस्टम जैसे मैकओएस से क्रॉस-कंपाइलेशन के उपयोग को उजागर किया गया है।",
      "विभिन्न उपकरण और प्लगइन्स की सिफारिश की जाती है, जैसे कि अमीगा डिबगिंग के लिए वीएस स्टूडियो कोड प्लगइन और आधुनिक सी और सी++ विकास के लिए क्रॉस-कम्पाइलिंग उपकरण।",
      "यह बातचीत अमीगा के अनोखे ग्राफिक्स और रंग प्रणाली के प्रति एक उदासीन सराहना को दर्शाती है, जो इसे आईबीएम/डीओएस ग्राफिक्स की तेज, ठंडी भावना के साथ विपरीत करती है।"
    ],
    "points": 118,
    "commentCount": 15,
    "retryCount": 0,
    "time": 1722112540
  },
  {
    "id": 41092928,
    "title": "मेरा ओब्सीडियन नोट-लेने का कार्यप्रवाह",
    "originLink": "https://www.ssp.sh/blog/obsidian-note-taking-workflow/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41092928",
    "commentBody": "",
    "originSummary": [
      "लेखक नोट्स लेने, जर्नलिंग करने और अंतर्दृष्टियों को जोड़ने के लिए ओब्सीडियन का उपयोग करते हैं, इसके खुले फाइल फॉर्मेट और मार्कडाउन समर्थन पर जोर देते हुए ताकि नोट्स भविष्य में भी सुरक्षित रहें।",
      "डेटाव्यू, एक्सकैलिब्रेन, ऑब्सीडियन एडमोनिशन, और टेम्पलेटर जैसे प्रमुख प्लगइन्स उनके वर्कफ़्लो की कार्यक्षमता और एकीकरण को बढ़ाते हैं।",
      "क्वार्ट्ज के माध्यम से नोट्स को सार्वजनिक रूप से साझा करना मूल्यवान प्रतिक्रिया और संबंधों को बढ़ावा देता है, जो निरंतर सीखने और सुधार में योगदान देता है।"
    ],
    "commentSummary": [
      "चर्चा नोट-लेने वाले ऐप ओब्सीडियन के इर्द-गिर्द घूमती है, जिसमें इसकी विशेषताओं और उपयोगकर्ता अनुभवों को प्रमुखता से बताया गया है।",
      "उपयोगकर्ता ओब्सीडियन की लचीलापन, मार्कडाउन फाइलों के उपयोग और मजबूत प्लगइन इकोसिस्टम के लिए प्रशंसा करते हैं, और इसकी तुलना अन्य उपकरणों जैसे Emacs और Notion से करते हैं।",
      "कुछ उपयोगकर्ता सिंकिंग समाधान और संभावित समस्याओं का उल्लेख करते हैं, जैसे धीमी iCloud सिंक और Git-आधारित सिंकिंग प्लगइन्स की उपलब्धता।"
    ],
    "points": 86,
    "commentCount": 62,
    "retryCount": 0,
    "time": 1722172476
  },
  {
    "id": 41091163,
    "title": "स्ट्रीमपॉट: फ्लुएंट-एफएफएमपीईजी संगतता, कतारें और एस3 के साथ एपीआई के रूप में एफएफएमपीईजी चलाएं",
    "originLink": "https://github.com/StreamPot/StreamPot",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41091163",
    "commentBody": "",
    "originSummary": [
      "StreamPot एक प्रारंभिक चरण का उपकरण है जिसे मीडिया परिवर्तन कार्यों जैसे वीडियो को ट्रिम करना, ऑडियो को हटाना और ट्रांसकोडिंग के लिए डिज़ाइन किया गया है, जो डेवलपर्स के लिए बिना किसी सेटअप के समाधान प्रदान करता है।",
      "उपयोगकर्ता या तो इंस्टॉलेशन निर्देशों का पालन करके सर्वर को स्वयं होस्ट कर सकते हैं या इसे आज़माने के लिए होस्टेड संस्करण के लिए साइन अप कर सकते हैं।",
      "यह परियोजना ffmpeg और fluent-ffmpeg टीमों के कार्य का लाभ उठाती है, और प्रतिक्रिया ईमेल या निर्धारित कॉल के माध्यम से प्रदान की जा सकती है।"
    ],
    "commentSummary": [
      "StreamPot FFmpeg को एक API के रूप में चलाने की अनुमति देता है जिसमें fluent-FFmpeg संगतता, जॉब कतारें, और S3 एकीकरण शामिल हैं।",
      "उपयोगकर्ता सुधारों पर चर्चा कर रहे हैं, जैसे कि असिंक ऑपरेशनों के लिए सुविधा विधियों को जोड़ना और इवेंटसोर्स या सर्वर-सेंट इवेंट्स (SSE) के माध्यम से संकेत देना।",
      "डेवलपर्स दस्तावेज़ीकरण को अपडेट करने और बेहतर दक्षता के लिए `runAndWait` और लंबी पोलिंग जैसी सुविधाएँ जोड़ने पर विचार कर रहे हैं।"
    ],
    "points": 84,
    "commentCount": 3,
    "retryCount": 0,
    "time": 1722139744
  },
  {
    "id": 41093916,
    "title": "समानांतर मल्टीथ्रेडिंग पर्दे के पीछे कैसे काम करता है",
    "originLink": "https://blog.codingconfessions.com/p/simultaneous-multithreading",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41093916",
    "commentBody": "",
    "originSummary": [
      "समानांतर मल्टीथ्रेडिंग (SMT) एक CPU को दो थ्रेड्स से निर्देशों को एक साथ संभालने की अनुमति देता है, जिससे संसाधनों का उपयोग बेहतर होता है लेकिन संभवतः एकल-थ्रेड प्रदर्शन में कमी आ सकती है।",
      "इंटेल का हाइपर-थ्रेडिंग एसएमटी का एक रूप है, जो प्रोसेसर आर्किटेक्चर की स्थिति को डुप्लिकेट करता है ताकि एक भौतिक प्रोसेसर ऑपरेटिंग सिस्टम को दो तार्किक प्रोसेसर के रूप में दिखाई दे।",
      "हालांकि SMT सिस्टम थ्रूपुट को बढ़ा सकता है, यह सुरक्षा कमजोरियों और कैश संघर्षों को भी जन्म दे सकता है, जिसके कारण विशेषज्ञ सुरक्षा-महत्वपूर्ण प्रणालियों के लिए इसे अक्षम करने की सलाह देते हैं।"
    ],
    "commentSummary": [
      "इंटेल के आगामी एरो लेक सीपीयू हाइपरथ्रेडिंग (समानांतर मल्टीथ्रेडिंग, एसएमटी) को समाप्त कर देंगे क्योंकि इसके प्रदर्शन लाभ अनुप्रयोग-निर्भर होते हैं।",
      "सीपीयू डिज़ाइन को सरल बनाने का कदम लाभकारी हो सकता है, विशेष रूप से जब इंटेल के पी/ई (प्रदर्शन/दक्षता) कोर एकल या कम-थ्रेडेड वर्कलोड के लिए एक विकल्प प्रदान करते हैं।",
      "SMT की प्रासंगिकता पर बहस जारी है, जिसमें AMD समान कोर और SMT के उपयोग को बनाए रखता है, जबकि Intel विभिन्न रणनीतियों का अन्वेषण कर रहा है।"
    ],
    "points": 80,
    "commentCount": 14,
    "retryCount": 0,
    "time": 1722180914
  },
  {
    "id": 41090459,
    "title": "एलन मस्क ने हेरफेर किया हुआ हैरिस वीडियो साझा किया, जो X की नीतियों का उल्लंघन प्रतीत होता है",
    "originLink": "https://www.nytimes.com/2024/07/27/us/politics/elon-musk-kamala-harris-deepfake.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41090459",
    "commentBody": "",
    "originSummary": [
      "एलोन मस्क ने उपराष्ट्रपति कमला हैरिस के एक डिजिटल रूप से परिवर्तित अभियान वीडियो को पुनः पोस्ट किया, जो X की भ्रामक मीडिया के खिलाफ नीतियों का उल्लंघन करता प्रतीत होता है।",
      "छेड़छाड़ किए गए वीडियो, जिसे 98 मिलियन बार देखा गया, में कोई अस्वीकरण नहीं था और इसमें भ्रामक सामग्री शामिल थी, जिससे लोकतंत्र के लिए डीपफेक्स के खतरे के बारे में चिंताएं बढ़ गईं।",
      "आलोचकों और हैरिस अभियान ने वीडियो की निंदा की, यह बताते हुए कि X की नीतियों के प्रवर्तन में असंगति है, विशेष रूप से अन्य प्लेटफार्मों जैसे मेटा और गूगल की तुलना में।"
    ],
    "commentSummary": [
      "एलोन मस्क ने कमला हैरिस का एक संशोधित वीडियो साझा किया, जिससे संभवतः X की नीतियों का उल्लंघन हुआ और सख्त एआई नियमों पर चर्चाएं शुरू हो गईं।",
      "इस घटना ने डीपफेक्स से निपटने के लिए सामग्री सत्यापन के लिए कीऑक्साइड का उपयोग करने के सुझाव दिए हैं।",
      "उपयोगकर्ता ट्विटर की गिरावट, बढ़ी हुई बॉट गतिविधि, और एल्गोरिदम में बदलाव जो दक्षिणपंथी सामग्री को प्राथमिकता देते हैं, से निराश हैं, जिससे प्लेटफ़ॉर्म की उपयोगिता और सामग्री नीतियों के बारे में चिंताएँ बढ़ रही हैं।"
    ],
    "points": 77,
    "commentCount": 19,
    "retryCount": 0,
    "time": 1722127941
  }
]
