[
  {
    "id": 41090304,
    "title": "Facebook đã chặn lưu lượng ứng dụng di động được mã hóa của đối thủ như thế nào?",
    "originLink": "https://doubleagent.net/onavo-facebook-ssl-mitm-technical-analysis/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41090304",
    "commentBody": "",
    "originSummary": [
      "Vụ kiện tập thể chống lại Meta đã tiết lộ rằng Facebook đã chặn lưu lượng mã hóa từ các thiết bị của người dùng chạy ứng dụng Onavo Protect để thu thập thông tin cạnh tranh.",
      "Facebook bị cáo buộc đã sử dụng một cuộc tấn công MITM (Man-In-The-Middle), được gọi là \"ssl bump,\" để giải mã lưu lượng từ các tên miền như Snapchat, YouTube và Amazon.",
      "Ứng dụng Onavo Protect thu thập các số liệu thống kê chi tiết về việc sử dụng ứng dụng và dữ liệu nhạy cảm, gây ra những lo ngại đáng kể về pháp lý và đạo đức."
    ],
    "commentSummary": [
      "Facebook đã trả tiền cho người dùng để cài đặt một proxy dưới danh nghĩa \"nghiên cứu thị trường,\" cho phép họ chặn và giải mã lưu lượng ứng dụng di động được mã hóa của các đối thủ cạnh tranh.",
      "Ứng dụng Onavo, được tiếp thị như một VPN, đã được sử dụng để thu thập dữ liệu về các đối thủ cạnh tranh, gây ra những lo ngại về pháp lý và đạo đức, bao gồm cả khả năng vi phạm luật nghe lén.",
      "Mặc dù người dùng đã đồng ý với việc giám sát, nhưng mức độ hiểu biết rõ ràng của họ về phạm vi thu thập dữ liệu vẫn còn đáng ngờ."
    ],
    "points": 427,
    "commentCount": 174,
    "retryCount": 0,
    "time": 1722125301
  },
  {
    "id": 41090658,
    "title": "Phương pháp gỡ lỗi thiết kế pin của bạn",
    "originLink": "https://github.com/ionworks/how-to-debug-your-battery",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41090658",
    "commentBody": "",
    "originSummary": [
      "PyBaMM là một công cụ mã nguồn mở bằng Python được thiết kế để mô phỏng vật lý pin, làm cho nó trở thành một tài nguyên quý giá cho nghiên cứu và phát triển (R&D) pin.",
      "Công cụ này giúp giải quyết lời nguyền của tính chiều, một thách thức phổ biến trong nghiên cứu và phát triển pin, bằng cách đơn giản hóa các mô phỏng phức tạp.",
      "PyBaMM đặc biệt hữu ích cho các nhà nghiên cứu và kỹ sư muốn mô hình hóa và hiểu rõ hơn về hành vi của pin một cách hiệu quả hơn."
    ],
    "commentSummary": [
      "Một yếu tố tại một thời điểm thử nghiệm là không hiệu quả cho thiết kế pin; các phương pháp thiết kế thí nghiệm hiện đại có thể tối ưu hóa với ít lần chạy hơn.",
      "PyBaMM (Python Battery Mathematical Modeling) không bao gồm tất cả các tối ưu hóa ngay từ đầu, đòi hỏi các phương pháp tinh vi hơn cho các không gian thiết kế lớn hơn.",
      "Những công cụ như PPK II của Nordic Semiconductor, cảm biến hiệu ứng Hall, và điện trở shunt được khuyến nghị cho việc lập hồ sơ năng lượng và đo dòng điện trong các dự án pin."
    ],
    "points": 232,
    "commentCount": 71,
    "retryCount": 0,
    "time": 1722130746
  },
  {
    "id": 41089558,
    "title": "Apple đã đạt được hợp đồng công đoàn đầu tiên với nhân viên cửa hàng tại Maryland",
    "originLink": "https://apnews.com/article/apple-union-contract-maryland-store-f9884d978bf3129c37726dd7978392a5",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41089558",
    "commentBody": "",
    "originSummary": [
      "Hiệp hội Quốc tế của Công nhân Cơ khí và Hàng không Vũ trụ, Liên minh của Nhân viên Bán lẻ có Tổ chức, đã công bố một thỏa thuận ba năm với Apple cho nhân viên tại một cửa hàng ở Maryland, tăng lương trung bình 10% và cung cấp các lợi ích khác.",
      "Thỏa thuận, đang chờ phê duyệt bởi khoảng 85 nhân viên, sẽ được bỏ phiếu vào ngày 6 tháng 8, sau khi có sự ủy quyền đình công vào tháng 5 do các cuộc đàm phán không đạt yêu cầu.",
      "Đây là một trong hai cửa hàng Apple tại Maryland đã thành lập công đoàn ở Mỹ, với cửa hàng thứ hai tại Oklahoma City vẫn chưa có hợp đồng."
    ],
    "commentSummary": [
      "Apple đã ký hợp đồng công đoàn đầu tiên với nhân viên cửa hàng ở Maryland, đánh dấu một cột mốc quan trọng trong quan hệ lao động của công ty.",
      "Hiện có suy đoán rằng Apple có thể đã đồng ý với hợp đồng để tránh xung đột, với một số người cho rằng công ty có thể đóng cửa cửa hàng nếu việc công đoàn hóa dẫn đến vấn đề, mặc dù việc đóng cửa cửa hàng chỉ vì công đoàn hóa là bất hợp pháp và khó chứng minh.",
      "Cuộc tranh luận về tác động và sự cần thiết của các công đoàn vẫn tiếp diễn, với các lập luận ủng hộ việc bảo vệ quyền lợi của người lao động và phản đối những tác động tiêu cực tiềm tàng đối với doanh nghiệp."
    ],
    "points": 169,
    "commentCount": 147,
    "retryCount": 0,
    "time": 1722116811
  },
  {
    "id": 41091803,
    "title": "Hiệu ứng thẩm phán đói vô lý được xem xét lại (2023)",
    "originLink": "https://www.cambridge.org/core/journals/judgment-and-decision-making/article/irrational-hungry-judge-effect-revisited-simulations-reveal-that-the-magnitude-of-the-effect-is-overestimated/61CE825D4DC137675BB9CAD04571AE58",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41091803",
    "commentBody": "",
    "originSummary": [
      "Hiện tại, việc đặt hàng trực tuyến không khả dụng do các vấn đề kỹ thuật kể từ ngày 10 tháng 7 năm 2024; người dùng được khuyên nên kiểm tra trang web để cập nhật thông tin.",
      "Trong một nghiên cứu của Danziger, Levav và Avnaim-Pesso (2011), các quyết định ân xá có lợi của các thẩm phán Israel giảm đáng kể trong một phiên làm việc nhưng trở lại mức ban đầu sau khi nghỉ giải lao, gợi ý sự suy giảm tinh thần.",
      "Những mô phỏng cho thấy hiệu ứng này có thể bị đánh giá quá cao và có thể do các hiện tượng thống kê, chẳng hạn như các phán quyết thuận lợi kéo dài hơn và quản lý thời gian hợp lý của các thẩm phán, đòi hỏi cần có nghiên cứu thêm."
    ],
    "commentSummary": [
      "Hiệu ứng 'thẩm phán đói phi lý', nghiên cứu cho rằng các thẩm phán khoan dung hơn sau bữa trưa, đã được xem xét lại và phát hiện có những sai sót đáng kể.",
      "Trong nghiên cứu ban đầu, không tính đến việc sắp xếp các trường hợp không ngẫu nhiên, với các trường hợp ít nghiêm trọng hơn được xem xét trước và các trường hợp nghiêm trọng hơn sau, ảnh hưởng đến kết quả.",
      "Những người phê bình cho rằng việc ngẫu nhiên hóa thứ tự các vụ án có thể dẫn đến các quyết định tư pháp hiệu quả và công bằng hơn, đặt ra những câu hỏi rộng hơn về tác động của đói bụng đến việc ra quyết định và độ tin cậy của các nghiên cứu tâm lý học."
    ],
    "points": 160,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1722152111
  },
  {
    "id": 41092861,
    "title": "Những công cụ và kỹ thuật yêu thích của tôi cho phát triển game theo quy trình",
    "originLink": "https://cprimozic.net/blog/tools-and-techniques-for-procedural-gamedev/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41092861",
    "commentBody": "",
    "originSummary": [
      "Ánh xạ ba mặt phẳng đơn giản hóa việc tạo kết cấu mà không cần bản đồ UV, làm cho nó trở nên lý tưởng cho địa hình thủ tục, với các cải tiến để pha trộn và hiệu suất tốt hơn.",
      "Việc tổng hợp kết cấu PBR (Kết xuất dựa trên vật lý) được hỗ trợ bởi AI sử dụng trí tuệ nhân tạo để tạo ra các kết cấu chất lượng cao, cải thiện độ trung thực hình ảnh.",
      "Những công việc trong tương lai bao gồm việc triển khai Hình học Rắn Xây dựng (CSG) để thao tác lưới nâng cao, chẳng hạn như hợp nhất và cắt lưới để mô phỏng hư hại."
    ],
    "commentSummary": [
      "Đoạn bài viết thảo luận về các công cụ và kỹ thuật khác nhau cho phát triển trò chơi theo quy trình, nêu bật những thách thức và phức tạp liên quan.",
      "Người dùng chia sẻ kinh nghiệm và khó khăn của họ với việc tạo nội dung theo quy trình, chẳng hạn như kết nối hình học và tạo địa hình thực tế.",
      "Được khen ngợi vì những hiểu biết sâu sắc về các kỹ thuật thủ tục, bài viết này được một số người dùng nhận xét là đòi hỏi các kỹ năng chuyên môn trong lĩnh vực này."
    ],
    "points": 159,
    "commentCount": 12,
    "retryCount": 0,
    "time": 1722171392
  },
  {
    "id": 41088895,
    "title": "Tritone Substitutions",
    "originLink": "https://johncarlosbaez.wordpress.com/2024/07/27/tritone-substitutions/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41088895",
    "commentBody": "",
    "originSummary": [
      "Thay thế quãng ba cung là một kỹ thuật âm nhạc thay thế hợp âm bảy át bằng một hợp âm khác có gốc cách nhau một quãng ba cung, tạo thêm sự tinh tế cho âm nhạc.",
      "Trong giọng C, hợp âm bảy át G-B-D-F có thể được thay thế bằng C♯-F-G♯-B, giữ lại một số nốt từ hợp âm gốc nhưng thêm vào một sự biến tấu độc đáo.",
      "David Bennett và Michael Keithson cung cấp các video giải thích và ví dụ, với Bennett tập trung vào các bài hát phổ biến và Keithson đưa ra một cách tiếp cận phân tích hơn, bao gồm các bài học về hợp âm chủ."
    ],
    "commentSummary": [
      "Thay thế quãng ba trong nhạc jazz liên quan đến việc thay thế một hợp âm chủ (V7) bằng một hợp âm chủ khác cách đó một quãng ba (II♭7), tạo ra một đường bass giảm dần theo nửa cung.",
      "Phương pháp này được sử dụng để thêm sự thú vị về hòa âm và thường thấy trong nhạc jazz, cũng như trong nhạc phổ biến như nhạc nền của The Simpsons và bài \"I Am the Walrus\" của The Beatles.",
      "Cuộc thảo luận nhấn mạnh tầm quan trọng của việc hiểu các khái niệm lý thuyết âm nhạc như các nốt dẫn (nốt thứ 3 và thứ 7) và bối cảnh lịch sử của phân tích hòa âm."
    ],
    "points": 157,
    "commentCount": 102,
    "retryCount": 0,
    "time": 1722109954
  },
  {
    "id": 41092460,
    "title": "CalcGPT",
    "originLink": "https://calcgpt.io/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41092460",
    "commentBody": "",
    "originSummary": [
      "CalcGPT, được phát triển bởi Calvin Liang, là một máy tính châm biếm sử dụng mô hình ngôn ngữ GPT-3, phê phán sự ám ảnh hiện đại với AI.",
      "Đó vừa là một công cụ tính toán vừa là một bình luận xã hội, đặt câu hỏi về sự cần thiết của AI trong mọi khía cạnh của cuộc sống.",
      "Với việc cố tình chậm chạp và dễ mắc lỗi, CalcGPT khuyến khích sự suy ngẫm về sự cân bằng giữa các phương pháp truyền thống và đổi mới."
    ],
    "commentSummary": [
      "CalcGPT, một ứng dụng AI hài hước, đang thu hút sự quan tâm nhờ cách tiếp cận châm biếm về khả năng của AI, đặc biệt là trong việc thực hiện các phép toán cơ bản.",
      "Ứng dụng sử dụng một mô hình GPT-3 lỗi thời (babbage-002), dẫn đến các kết quả cố ý sai và hài hước, làm nổi bật khoảng cách giữa các mô hình AI cũ và mới như GPT-4.",
      "Mặc dù mang tính hài hước, CalcGPT đóng vai trò như một lời phê bình về sự cường điệu của AI, cho thấy những hạn chế của các mô hình trước đó và khơi dậy các cuộc thảo luận về những tiến bộ trong công nghệ AI."
    ],
    "points": 152,
    "commentCount": 41,
    "retryCount": 0,
    "time": 1722164931
  },
  {
    "id": 41090222,
    "title": "Plan 9 là một hệ điều hành hoàn chỉnh độc đáo",
    "originLink": "https://posixcafe.org/blogs/2024/07/27/0/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41090222",
    "commentBody": "",
    "originSummary": [
      "Plan 9 là một hệ điều hành toàn diện bao gồm tất cả phần mềm cần thiết trong cài đặt cơ bản của nó, chẳng hạn như trình biên dịch, môi trường đồ họa và trình soạn thảo văn bản.",
      "Không giống như các hệ thống Linux và BSD, thiết kế nguyên khối của Plan 9 đảm bảo tính nhất quán và đơn giản hóa việc phát triển phần mềm bằng cách loại bỏ nhu cầu kiểm tra đối với nhiều cấu hình khác nhau.",
      "Trong khi Plan 9 có thể thiếu một số tính năng so với các hệ thống chính thống, nó lại là một nguồn tài liệu học tập tuyệt vời và môi trường thử nghiệm cho việc nghiên cứu hệ điều hành."
    ],
    "commentSummary": [
      "Plan 9 là một hệ điều hành cho phép truy cập đa nền tảng vào ổ C trên Windows và Windows Subsystem for Linux (WSL) bằng cách sử dụng giao thức hệ thống tệp 9P2000.L.",
      "Microsoft đã chọn Plan 9 thay vì Samba vì tính đơn giản và mã máy chủ hiện có của nó, với đường dẫn \\\\wsl$\\ được quản lý bởi MUP trong Windows và giao tiếp thông qua một socket Unix.",
      "Plan 9 tập trung vào phần mềm có thể kết hợp, tuân theo triết lý Unix về các chương trình nhỏ, tập trung, nhưng vẫn là một mối quan tâm nhỏ do thiếu các tính năng hiện đại và tích hợp."
    ],
    "points": 144,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1722124352
  },
  {
    "id": 41089911,
    "title": "Những Suy Nghĩ Đầu Tiên Về Intel N100 Radxa X4",
    "originLink": "https://bret.dk/intel-n100-radxa-x4-first-thoughts/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41089911",
    "commentBody": "",
    "originSummary": [
      "Radxa đã công bố máy tính bo mạch đơn (SBC) Radxa x4 dựa trên Intel N100, có hình dạng tương tự như Raspberry Pi 5, với bộ vi xử lý x86 Intel N100.",
      "Radxa x4 hỗ trợ Windows 11 và Debian 12, với quá trình cài đặt mượt mà nhưng ban đầu thiếu trình điều khiển mạng.",
      "Những tính năng chính bao gồm Ethernet 2.5Gbit, hỗ trợ M.2 NVMe, và BIOS toàn diện, mặc dù cần có tài liệu hướng dẫn và giải pháp làm mát tốt hơn."
    ],
    "commentSummary": [
      "Intel N100 Radxa X4 là một máy tính bảng đơn (SBC) mới có giá 60 đô la, cung cấp kiến trúc x86, mã hóa phần cứng và được cho là mạnh hơn ba lần so với Raspberry Pi 5.",
      "Những tính năng chính bao gồm một NIC (Card Giao Diện Mạng) 2.5G với hỗ trợ PoE (Cấp nguồn qua Ethernet) và một khe m.2, điều này mang lại giá trị đáng kể so với Raspberry Pi.",
      "Bo mạch này đã thu hút sự quan tâm nhờ vào giá cả cạnh tranh, hiệu suất nâng cao và khả năng lắp vừa vào các vỏ Raspberry Pi hiện có, khiến nó trở thành một lựa chọn hấp dẫn cho cả những người đam mê và các chuyên gia."
    ],
    "points": 143,
    "commentCount": 126,
    "retryCount": 0,
    "time": 1722120717
  },
  {
    "id": 41088592,
    "title": "Managarm: Hệ điều hành dựa trên microkernel thực dụng với I/O không đồng bộ",
    "originLink": "https://github.com/managarm/managarm",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41088592",
    "commentBody": "",
    "originSummary": [
      "managarm là một hệ điều hành dựa trên microkernel, khác biệt so với Linux và Windows, có API hoàn toàn không đồng bộ cho I/O và khả năng tương thích tốt với không gian người dùng Linux.",
      "Đây không phải là một bản phân phối Linux nhưng hỗ trợ nhiều API của Linux, cung cấp các tính năng như hỗ trợ 64-bit, tương thích với phần cứng hiện đại và tuân thủ POSIX.",
      "Người dùng có thể thử managarm bằng cách tải xuống một hình ảnh nightly và chạy nó với các cờ qemu cụ thể, hỗ trợ phần mềm như Weston và GNU Coreutils, và phần cứng như bộ điều khiển USB và các card đồ họa khác nhau."
    ],
    "commentSummary": [
      "Managarm là một hệ điều hành dựa trên microkernel với I/O không đồng bộ, chủ yếu được kiểm tra trên QEMU, một trình giả lập mã nguồn mở phổ biến.",
      "Đề án đã thu hút sự quan tâm nhờ vào hỗ trợ trình điều khiển hiện đại, bao gồm cả USB, và tiềm năng chạy trên phần cứng thực, mặc dù nó đang đối mặt với những thách thức ở các thành phần cấp thấp.",
      "Những cập nhật gần đây bao gồm khả năng chạy một trình duyệt web hiện đại, cho thấy sự tiến bộ đáng kể và cải thiện về chức năng."
    ],
    "points": 136,
    "commentCount": 53,
    "retryCount": 0,
    "time": 1722107174
  },
  {
    "id": 41089161,
    "title": "Nhà phát triển Roguecraft về việc phát triển cho Amiga vào năm 2024",
    "originLink": "https://www.timeextension.com/features/interview-its-easy-to-get-a-bit-over-ambitious-roguecraft-devs-on-developing-for-amiga-in-2024",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41089161",
    "commentBody": "",
    "originSummary": [
      "Roguecraft, được phát triển bởi Badger Punch Games, là một trò chơi Amiga rất được mong đợi dự kiến ra mắt vào tháng 9 năm 2024, sau thành công của Rogue 64.",
      "Việc phát triển, ban đầu dự kiến kéo dài 6 tháng, đã kéo dài đến 2 năm do những phức tạp khi làm việc với phần cứng của Amiga, mặc dù nó có những ưu điểm như tốc độ và các bộ đồng xử lý chuyên dụng.",
      "Trò chơi có đồ họa isometric, hơn 100 biến thể phòng, và hiện có sẵn để đặt hàng trước qua Thalamus Digital, nhận được phản hồi tích cực từ cộng đồng."
    ],
    "commentSummary": [
      "Nhà phát triển Roguecraft thảo luận về những thách thức và quy trình làm việc khi phát triển trên nền tảng Amiga vào năm 2024, nhấn mạnh việc sử dụng các trình giả lập và biên dịch chéo từ các hệ thống hiện đại như macOS.",
      "Đề xuất sử dụng các công cụ và plugin khác nhau, chẳng hạn như Plugin VS Studio Code cho việc gỡ lỗi Amiga và các công cụ biên dịch chéo cho phát triển C và C++ hiện đại.",
      "Cuộc trò chuyện phản ánh sự trân trọng hoài niệm đối với hệ thống đồ họa và màu sắc độc đáo của Amiga, đối lập với cảm giác sắc nét, lạnh lẽo của đồ họa IBM/DOS."
    ],
    "points": 118,
    "commentCount": 15,
    "retryCount": 0,
    "time": 1722112540
  },
  {
    "id": 41092928,
    "title": "Quy trình ghi chú bằng Obsidian của tôi",
    "originLink": "https://www.ssp.sh/blog/obsidian-note-taking-workflow/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41092928",
    "commentBody": "",
    "originSummary": [
      "Người tác giả sử dụng Obsidian để ghi chú, viết nhật ký và kết nối các hiểu biết, nhấn mạnh định dạng tệp mở và hỗ trợ Markdown của nó để đảm bảo tính bền vững cho các ghi chú trong tương lai.",
      "Những plugin quan trọng như Dataview, Excalibrain, Obsidian Admonition và Templater nâng cao tính năng và tích hợp của quy trình làm việc của họ.",
      "Chia sẻ ghi chú công khai qua Quartz thúc đẩy phản hồi và kết nối quý giá, góp phần vào việc học hỏi và cải thiện liên tục."
    ],
    "commentSummary": [
      "Cuộc thảo luận xoay quanh ứng dụng ghi chú Obsidian, nhấn mạnh các tính năng và trải nghiệm của người dùng.",
      "Người dùng khen ngợi Obsidian vì tính linh hoạt, việc sử dụng các tệp Markdown và hệ sinh thái plugin mạnh mẽ của nó, so sánh nó một cách tích cực với các công cụ khác như Emacs và Notion.",
      "Một số người dùng đề cập đến các giải pháp đồng bộ hóa và các vấn đề tiềm ẩn, chẳng hạn như đồng bộ iCloud chậm và sự sẵn có của các plugin đồng bộ hóa dựa trên Git."
    ],
    "points": 86,
    "commentCount": 62,
    "retryCount": 0,
    "time": 1722172476
  },
  {
    "id": 41091163,
    "title": "StreamPot: Chạy FFmpeg như một API với khả năng tương thích fluent-FFmpeg, hàng đợi và S3",
    "originLink": "https://github.com/StreamPot/StreamPot",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41091163",
    "commentBody": "",
    "originSummary": [
      "StreamPot là một công cụ giai đoạn đầu được thiết kế cho các nhiệm vụ chuyển đổi phương tiện như cắt video, tách âm thanh và chuyển mã, cung cấp giải pháp không cần cài đặt cho các nhà phát triển.",
      "Người dùng có thể tự lưu trữ máy chủ bằng cách làm theo hướng dẫn cài đặt hoặc đăng ký phiên bản được lưu trữ để thử nghiệm.",
      "Đề án tận dụng công việc của các nhóm ffmpeg và fluent-ffmpeg, và phản hồi có thể được cung cấp qua email hoặc các cuộc gọi đã lên lịch."
    ],
    "commentSummary": [
      "StreamPot cho phép chạy FFmpeg như một API với khả năng tương thích fluent-FFmpeg, hàng đợi công việc và tích hợp S3.",
      "Người dùng đang thảo luận về các cải tiến, chẳng hạn như thêm các phương thức tiện lợi cho các hoạt động không đồng bộ và tín hiệu thông qua eventsource hoặc Sự kiện Gửi từ Máy chủ (SSE).",
      "Bên phát triển đang xem xét cập nhật tài liệu và thêm các tính năng như `runAndWait` và long polling để tăng hiệu quả."
    ],
    "points": 84,
    "commentCount": 3,
    "retryCount": 0,
    "time": 1722139744
  },
  {
    "id": 41093916,
    "title": "Hoạt động của đa luồng đồng thời dưới lớp vỏ",
    "originLink": "https://blog.codingconfessions.com/p/simultaneous-multithreading",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41093916",
    "commentBody": "",
    "originSummary": [
      "Siêu phân luồng (SMT) cho phép CPU xử lý các lệnh từ hai luồng cùng một lúc, cải thiện việc sử dụng tài nguyên nhưng có thể làm giảm hiệu suất của một luồng đơn.",
      "Hyper-threading của Intel là một dạng của SMT, nhân đôi trạng thái kiến trúc bộ xử lý để làm cho một bộ xử lý vật lý xuất hiện như hai bộ xử lý logic đối với hệ điều hành.",
      "Trong khi SMT có thể tăng thông lượng hệ thống, nó có thể giới thiệu các lỗ hổng bảo mật và xung đột bộ nhớ đệm, dẫn đến việc các chuyên gia khuyến nghị vô hiệu hóa nó cho các hệ thống quan trọng về bảo mật."
    ],
    "commentSummary": [
      "CPU Arrow Lake sắp ra mắt của Intel sẽ loại bỏ hyperthreading (Đa luồng đồng thời, SMT) do hiệu suất tăng phụ thuộc vào ứng dụng của nó.",
      "Việc đơn giản hóa thiết kế CPU có thể mang lại lợi ích, đặc biệt khi các lõi P/E (Hiệu suất/Hiệu quả) của Intel cung cấp một giải pháp thay thế cho các tác vụ đơn luồng hoặc ít luồng.",
      "Cuộc tranh luận về sự liên quan của SMT vẫn tiếp tục, với AMD duy trì việc sử dụng các lõi đồng nhất và SMT, trong khi Intel khám phá các chiến lược khác nhau."
    ],
    "points": 80,
    "commentCount": 14,
    "retryCount": 0,
    "time": 1722180914
  },
  {
    "id": 41090459,
    "title": "Elon Musk chia sẻ video bị chỉnh sửa của Harris, dường như vi phạm chính sách của X",
    "originLink": "https://www.nytimes.com/2024/07/27/us/politics/elon-musk-kamala-harris-deepfake.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41090459",
    "commentBody": "",
    "originSummary": [
      "Elon Musk đã đăng lại một video chiến dịch của Phó Tổng thống Kamala Harris đã được chỉnh sửa kỹ thuật số, điều này dường như vi phạm các chính sách của X về truyền thông lừa đảo.",
      "Video bị chỉnh sửa, được xem 98 triệu lần, thiếu cảnh báo và bao gồm nội dung gây hiểu lầm, làm dấy lên lo ngại về mối đe dọa của deepfake đối với nền dân chủ.",
      "Những nhà phê bình và chiến dịch của Harris đã lên án video này, nhấn mạnh sự không nhất quán trong việc thực thi chính sách của X so với các nền tảng khác như Meta và Google."
    ],
    "commentSummary": [
      "Elon Musk đã chia sẻ một video bị chỉnh sửa của Kamala Harris, có khả năng vi phạm các chính sách của X và gây ra các cuộc thảo luận về việc thắt chặt các quy định về AI.",
      "Vụ việc đã dẫn đến các đề xuất sử dụng Keyoxide để xác minh nội dung nhằm chống lại deepfake.",
      "Người dùng cảm thấy thất vọng với sự suy giảm của Twitter, sự gia tăng hoạt động của bot và các thay đổi thuật toán ủng hộ nội dung cánh hữu, làm dấy lên lo ngại về khả năng sử dụng và chính sách nội dung của nền tảng này."
    ],
    "points": 77,
    "commentCount": 19,
    "retryCount": 0,
    "time": 1722127941
  }
]
