[
  {
    "id": 41090304,
    "title": "كيف اعترض فيسبوك حركة مرور تطبيق الهاتف المحمول المشفر الخاص بمنافسهم؟",
    "originLink": "https://doubleagent.net/onavo-facebook-ssl-mitm-technical-analysis/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41090304",
    "commentBody": "",
    "originSummary": [
      "كشفت دعوى قضائية جماعية ضد شركة ميتا أن فيسبوك اعترضت حركة المرور المشفرة من أجهزة المستخدمين التي تعمل بتطبيق Onavo Protect للحصول على رؤى تنافسية.",
      "يُزعم أن فيسبوك استخدم هجوم MITM (الرجل في المنتصف)، الذي يُطلق عليه \"ssl bump\"، لفك تشفير حركة المرور من نطاقات مثل سناب شات، يوتيوب، وأمازون.",
      "جمعت تطبيق Onavo Protect إحصاءات مفصلة عن استخدام التطبيقات وبيانات حساسة، مما أثار مخاوف قانونية وأخلاقية كبيرة."
    ],
    "commentSummary": [
      "دفعت فيسبوك للمستخدمين لتثبيت وكيل تحت ستار \"بحث السوق\"، مما سمح لهم باعتراض وفك تشفير حركة المرور المشفرة لتطبيقات الهواتف المحمولة الخاصة بالمنافسين.",
      "تم استخدام التطبيق، أونافو، الذي تم تسويقه كشبكة VPN، لجمع البيانات عن المنافسين، مما أثار مخاوف قانونية وأخلاقية، بما في ذلك احتمال انتهاك قوانين التنصت.",
      "على الرغم من أن المستخدمين وافقوا على المراقبة، إلا أن وضوح فهمهم لمدى جمع البيانات لا يزال موضع تساؤل."
    ],
    "points": 427,
    "commentCount": 174,
    "retryCount": 0,
    "time": 1722125301
  },
  {
    "id": 41090658,
    "title": "كيفية تصحيح تصميم البطارية",
    "originLink": "https://github.com/ionworks/how-to-debug-your-battery",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41090658",
    "commentBody": "",
    "originSummary": [
      "PyBaMM هو أداة مفتوحة المصدر بلغة بايثون مصممة لمحاكاة فيزياء البطاريات، مما يجعلها موردًا قيمًا لأبحاث وتطوير البطاريات.",
      "تساعد الأداة في معالجة لعنة الأبعاد، وهي تحدٍ شائع في أبحاث وتطوير البطاريات، من خلال تبسيط المحاكاة المعقدة.",
      "يعد PyBaMM مفيدًا بشكل خاص للباحثين والمهندسين الذين يسعون لنمذجة وفهم سلوك البطاريات بشكل أكثر كفاءة."
    ],
    "commentSummary": [
      "اختبار عامل واحد في كل مرة غير فعال لتصميم البطاريات؛ يمكن لطرق التصميم التجريبي الحديثة أن تحقق الأمثلية بعدد أقل من التجارب.",
      "لا يغطي PyBaMM (النمذجة الرياضية للبطاريات باستخدام بايثون) جميع التحسينات بشكل افتراضي، مما يستلزم استخدام طرق أكثر تطورًا للمساحات التصميمية الأكبر.",
      "تُوصى باستخدام أدوات مثل PPK II من شركة Nordic Semiconductor، وأجهزة استشعار تأثير هول، والمقاومات الشنتية لملف الطاقة وقياس التيار في مشاريع البطاريات."
    ],
    "points": 232,
    "commentCount": 71,
    "retryCount": 0,
    "time": 1722130746
  },
  {
    "id": 41089558,
    "title": "أبل تتوصل إلى أول عقد نقابي لها على الإطلاق مع موظفي المتجر في ولاية ماريلاند",
    "originLink": "https://apnews.com/article/apple-union-contract-maryland-store-f9884d978bf3129c37726dd7978392a5",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41089558",
    "commentBody": "",
    "originSummary": [
      "أعلنت رابطة الميكانيكيين والعاملين في مجال الطيران الدولية وائتلاف موظفي التجزئة المنظمين عن اتفاقية لمدة ثلاث سنوات مع شركة آبل لموظفي متجر في ولاية ماريلاند، تتضمن زيادة في الأجور بنسبة 10% في المتوسط وتقديم مزايا أخرى.",
      "الاتفاق، الذي ينتظر موافقة حوالي 85 موظفًا، سيتم التصويت عليه في 6 أغسطس، بعد تفويض بالإضراب في مايو بسبب مفاوضات غير مرضية.",
      "هذا المتجر في ماريلاند هو واحد من موقعين فقط تابعين لشركة آبل في الولايات المتحدة تم اتحادهما، حيث لا يزال الموقع الثاني في مدينة أوكلاهوما بدون عقد."
    ],
    "commentSummary": [
      "وقعت شركة آبل أول عقد نقابي لها مع موظفي المتجر في ولاية ماريلاند، مما يمثل علامة فارقة هامة في علاقات العمل للشركة.",
      "هناك تكهنات بأن شركة آبل قد تكون وافقت على العقد لتجنب الصراع، مع اقتراح البعض أن الشركة قد تغلق المتجر إذا أدى الاتحاد إلى مشاكل، على الرغم من أن إغلاق متجر لمجرد الاتحاد غير قانوني ومن الصعب إثباته.",
      "لا يزال الجدل حول تأثير وأهمية النقابات مستمرًا، مع وجود حجج تدعم حماية حقوق العمال وأخرى تعارضها بسبب الأضرار المحتملة على الشركات."
    ],
    "points": 169,
    "commentCount": 147,
    "retryCount": 0,
    "time": 1722116811
  },
  {
    "id": 41091803,
    "title": "تأثير القاضي الجائع غير العقلاني معاد النظر فيه (2023)",
    "originLink": "https://www.cambridge.org/core/journals/judgment-and-decision-making/article/irrational-hungry-judge-effect-revisited-simulations-reveal-that-the-magnitude-of-the-effect-is-overestimated/61CE825D4DC137675BB9CAD04571AE58",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41091803",
    "commentBody": "",
    "originSummary": [
      "الطلب عبر الإنترنت غير متاح حاليًا بسبب مشاكل تقنية اعتبارًا من 10 يوليو 2024؛ يُنصح المستخدمون بالتحقق من الموقع للحصول على التحديثات.",
      "وجدت دراسة أجراها دانزيجر، ليفاف، وأفنايم-بسو (2011) أن قرارات الإفراج المشروط الإيجابية للقضاة الإسرائيليين انخفضت بشكل كبير خلال الجلسة، لكنها عادت إلى مستوياتها الأولية بعد استراحة، مما يشير إلى استنزاف ذهني.",
      "تشير المحاكاة إلى أن هذا التأثير قد يكون مبالغًا فيه وقد يكون ناتجًا عن شوائب إحصائية، مثل الأحكام المواتية الأطول وإدارة الوقت العقلانية من قبل القضاة، مما يستدعي إجراء المزيد من الأبحاث."
    ],
    "commentSummary": [
      "تمت إعادة دراسة تأثير \"القاضي الجائع غير العقلاني\"، التي ادعت أن القضاة يكونون أكثر تساهلاً بعد الغداء، ووجدت أن بها عيوبًا كبيرة.",
      "لم تأخذ الأبحاث الأصلية في الاعتبار الترتيب غير العشوائي للحالات، حيث تم رؤية الحالات الأقل حدة أولاً والحالات الأكثر حدة لاحقًا، مما أثر على النتائج.",
      "يشير النقاد إلى أن عشوائية ترتيب القضايا قد تؤدي إلى قرارات قضائية أكثر كفاءة وعدلاً، مما يثير تساؤلات أوسع حول تأثير الجوع على اتخاذ القرارات وموثوقية الدراسات النفسية."
    ],
    "points": 160,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1722152111
  },
  {
    "id": 41092861,
    "title": "أدواتي وتقنياتي المفضلة لتطوير الألعاب الإجرائية",
    "originLink": "https://cprimozic.net/blog/tools-and-techniques-for-procedural-gamedev/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41092861",
    "commentBody": "",
    "originSummary": [
      "تُبسط تقنية التكسية ثلاثية المحاور عملية التكسية دون الحاجة إلى خرائط UV، مما يجعلها مثالية للتضاريس الإجرائية، مع تحسينات لتحقيق مزج أفضل وأداء أعلى.",
      "توليد القوام باستخدام الذكاء الاصطناعي في التصيير القائم على الفيزياء (PBR) يستخدم الذكاء الاصطناعي لإنشاء قوام عالية الجودة، مما يحسن الدقة البصرية.",
      "تشمل الأعمال المستقبلية تنفيذ الهندسة الصلبة البنائية (CSG) للتلاعب المتقدم بالشبكات، مثل دمج وقطع الشبكات لمحاكاة الأضرار."
    ],
    "commentSummary": [
      "تتناول المقالة مختلف الأدوات والتقنيات لتطوير الألعاب الإجرائية، مسلطة الضوء على التحديات والتعقيدات المتضمنة.",
      "يشارك المستخدمون تجاربهم وصعوباتهم مع التوليد الإجرائي، مثل ربط الهندسة وتوليد التضاريس الواقعية.",
      "تمت الإشادة بالمقالة لما تقدمه من رؤى حول التقنيات الإجرائية، مع ملاحظة بعض المستخدمين للمهارات المتخصصة المطلوبة في هذا المجال."
    ],
    "points": 159,
    "commentCount": 12,
    "retryCount": 0,
    "time": 1722171392
  },
  {
    "id": 41088895,
    "title": "بدائل التريتون",
    "originLink": "https://johncarlosbaez.wordpress.com/2024/07/27/tritone-substitutions/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41088895",
    "commentBody": "",
    "originSummary": [
      "الاستبدال بالتريتون هو تقنية موسيقية تستبدل الوتر السابع المسيطر بوتر آخر تكون جذره على بعد تريتون، مما يضيف تعقيدًا إلى الموسيقى.",
      "في مقام دو، يمكن استبدال الوتر السابع المسيطر G-B-D-F بالوتر C♯-F-G♯-B، مع الاحتفاظ ببعض النغمات من الوتر الأصلي ولكن بإضافة لمسة فريدة.",
      "يقدم ديفيد بينيت ومايكل كيثسون شروحات بالفيديو وأمثلة، حيث يركز بينيت على الأغاني الشعبية بينما يقدم كيثسون نهجًا أكثر تحليلاً، بما في ذلك دروس عن الأوتار المسيطرة."
    ],
    "commentSummary": [
      "تتضمن استبدالات التريتون في موسيقى الجاز استبدال الوتر السائد (V7) بوتر سائد آخر يبعد عنه بمقدار تريتون (II♭7)، مما يخلق خطًا لحنيًا هابطًا كروماتيكيًا.",
      "تُستخدم هذه التقنية لإضافة اهتمام هارموني وهي شائعة في موسيقى الجاز، وكذلك في الموسيقى الشعبية مثل شارة مسلسل السيمبسون وأغنية \"أنا الفظ\" لفرقة البيتلز.",
      "تسلط المناقشة الضوء على أهمية فهم مفاهيم نظرية الموسيقى مثل النغمات الإرشادية (النغمتين الثالثة والسابعة) والسياق التاريخي لتحليل التآلف."
    ],
    "points": 157,
    "commentCount": 102,
    "retryCount": 0,
    "time": 1722109954
  },
  {
    "id": 41092460,
    "title": "CalcGPT",
    "originLink": "https://calcgpt.io/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41092460",
    "commentBody": "",
    "originSummary": [
      "CalcGPT، الذي طوره كالفن ليانغ، هو آلة حاسبة ساخرة تستخدم نموذج اللغة GPT-3، ينتقد الهوس الحديث بالذكاء الاصطناعي.",
      "إنه يعمل كأداة حسابية وتعليق اجتماعي في الوقت نفسه، متسائلًا عن ضرورة الذكاء الاصطناعي في جميع جوانب الحياة.",
      "من خلال التعمد في البطء وارتكاب الأخطاء، يشجع CalcGPT على التفكير في التوازن بين الأساليب التقليدية والابتكار."
    ],
    "commentSummary": [
      "CalcGPT، تطبيق ذكاء اصطناعي فكاهي، يثير الاهتمام بنهجه الساخر تجاه قدرات الذكاء الاصطناعي، خاصة في تنفيذ العمليات الحسابية الأساسية.",
      "يستخدم التطبيق نموذج GPT-3 قديم (babbage-002)، مما يؤدي إلى نتائج غير صحيحة ومضحكة عن قصد، مما يبرز الفجوة بين النماذج القديمة والنماذج الأحدث مثل GPT-4.",
      "على الرغم من طبيعته الفكاهية، فإن CalcGPT يعمل كنوع من النقد للضجة المحيطة بالذكاء الاصطناعي، حيث يوضح حدود النماذج السابقة ويثير النقاشات حول التقدم في تكنولوجيا الذكاء الاصطناعي."
    ],
    "points": 152,
    "commentCount": 41,
    "retryCount": 0,
    "time": 1722164931
  },
  {
    "id": 41090222,
    "title": "بلان 9 هو نظام تشغيل متكامل بشكل فريد",
    "originLink": "https://posixcafe.org/blogs/2024/07/27/0/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41090222",
    "commentBody": "",
    "originSummary": [
      "بلان 9 هو نظام تشغيل شامل يتضمن جميع البرامج الضرورية في تثبيته الأساسي، مثل المترجمات، البيئات الرسومية، ومحررات النصوص.",
      "على عكس أنظمة Linux وBSD، يضمن التصميم الأحادي لنظام Plan 9 الاتساق ويبسّط تطوير البرمجيات من خلال القضاء على الحاجة لاختبارها ضد تكوينات متعددة.",
      "بينما قد يفتقر نظام Plan 9 إلى بعض الميزات مقارنة بالأنظمة الرئيسية، فإنه يعد مصدرًا ممتازًا للتعلم وبيئة تجريبية لتجارب أنظمة التشغيل."
    ],
    "commentSummary": [
      "نظام Plan 9 هو نظام تشغيل يتيح الوصول عبر الأنظمة الأساسية إلى محرك الأقراص C على نظام Windows ونظام Windows Subsystem for Linux (WSL) باستخدام بروتوكول نظام الملفات 9P2000.L.",
      "اختارت مايكروسوفت Plan 9 بدلاً من Samba لبساطته ولوجود كود الخادم الحالي، مع إدارة المسار \\\\wsl$\\ بواسطة MUP في ويندوز والتواصل عبر مقبس يونكس.",
      "يركز نظام Plan 9 على البرمجيات القابلة للتكوين، ملتزمًا بفلسفة يونكس التي تعتمد على البرامج الصغيرة والمركزة، لكنه يظل اهتمامًا محدودًا بسبب افتقاره إلى الميزات الحديثة والتكامل."
    ],
    "points": 144,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1722124352
  },
  {
    "id": 41089911,
    "title": "أفكار أولية حول Intel N100 Radxa X4",
    "originLink": "https://bret.dk/intel-n100-radxa-x4-first-thoughts/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41089911",
    "commentBody": "",
    "originSummary": [
      "أعلنت شركة Radxa عن الكمبيوتر اللوحي Radxa x4 المعتمد على معالج Intel N100، والذي يشبه في شكله جهاز Raspberry Pi 5، ويتميز بمعالج x86 Intel N100.",
      "يدعم Radxa x4 نظامي Windows 11 وDebian 12، مع عمليات تثبيت سلسة ولكن مع نقص في برامج تشغيل الشبكة في البداية.",
      "تشمل الميزات الرئيسية إيثرنت بسرعة 2.5 جيجابت، ودعم M.2 NVMe، وواجهة BIOS شاملة، على الرغم من أنها تحتاج إلى توثيق أفضل وحلول تبريد."
    ],
    "commentSummary": [
      "يعد Intel N100 Radxa X4 حاسوبًا أحادي اللوحة جديدًا (SBC) بسعر 60 دولارًا، ويقدم بنية x86، وترميزًا للأجهزة، ويقال إنه أقوى بثلاث مرات من Raspberry Pi 5.",
      "تشمل الميزات الرئيسية بطاقة شبكة 2.5G (NIC) مع دعم الطاقة عبر الإيثرنت (PoE) وفتحة m.2، مما يضيف قيمة كبيرة مقارنةً بـ Raspberry Pi.",
      "لقد أثار اللوح اهتمامًا بسبب تسعيره التنافسي، وأدائه المحسن، وإمكانية توافقه مع حاويات Raspberry Pi الحالية، مما يجعله خيارًا جذابًا للهواة والمحترفين على حد سواء."
    ],
    "points": 143,
    "commentCount": 126,
    "retryCount": 0,
    "time": 1722120717
  },
  {
    "id": 41088592,
    "title": "ماناغارم: نظام تشغيل قائم على النواة الدقيقة البراغماتية مع إدخال/إخراج غير متزامن",
    "originLink": "https://github.com/managarm/managarm",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41088592",
    "commentBody": "",
    "originSummary": [
      "ماناغارم هو نظام تشغيل قائم على النواة الدقيقة، يختلف عن لينكس وويندوز، ويتميز بواجهة برمجة تطبيقات غير متزامنة بالكامل لإدخال/إخراج وبتوافق جيد مع مساحة المستخدم في لينكس.",
      "إنه ليس توزيعة لينكس ولكنه يدعم العديد من واجهات برمجة تطبيقات لينكس، ويقدم ميزات مثل دعم 64-بت، والتوافق مع الأجهزة الحديثة، والامتثال لمعايير POSIX.",
      "يمكن للمستخدمين تجربة ماناغارم عن طريق تنزيل صورة ليلية وتشغيلها باستخدام أعلام qemu محددة، ودعم برامج مثل Weston وGNU Coreutils، وأجهزة مثل وحدات تحكم USB وبطاقات الرسومات المختلفة."
    ],
    "commentSummary": [
      "ماناغارم هو نظام تشغيل يعتمد على النواة الدقيقة ويستخدم الإدخال/الإخراج غير المتزامن، ويتم اختباره بشكل أساسي على QEMU، وهو محاكي مفتوح المصدر شهير.",
      "لقد حظي المشروع بالاهتمام بسبب دعمه الحديث للسائقين، بما في ذلك USB، وإمكانية تشغيله على أجهزة حقيقية، رغم أنه يواجه تحديات في المكونات ذات المستوى المنخفض.",
      "تشمل التحديثات الأخيرة القدرة على تشغيل متصفح ويب حديث، مما يشير إلى تقدم كبير وتحسينات في الوظائف."
    ],
    "points": 136,
    "commentCount": 53,
    "retryCount": 0,
    "time": 1722107174
  },
  {
    "id": 41089161,
    "title": "مطورو Roguecraft حول التطوير لمنصة Amiga في عام 2024",
    "originLink": "https://www.timeextension.com/features/interview-its-easy-to-get-a-bit-over-ambitious-roguecraft-devs-on-developing-for-amiga-in-2024",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41089161",
    "commentBody": "",
    "originSummary": [
      "Roguecraft، الذي تم تطويره بواسطة Badger Punch Games، هو لعبة أميغا مرتقبة بشدة من المقرر إصدارها في سبتمبر 2024، بعد نجاح لعبة Rogue 64.",
      "تطوير المشروع، الذي كان مخططًا له في البداية لمدة 6 أشهر، امتد إلى سنتين بسبب تعقيدات العمل مع أجهزة أميغا، على الرغم من مزاياها مثل السرعة والمعالجات المساعدة المخصصة.",
      "تتميز اللعبة برسومات متساوية القياس، وأكثر من 100 تنوع في الغرف، وهي متاحة للطلب المسبق عبر Thalamus Digital، مع ردود فعل إيجابية من المجتمع."
    ],
    "commentSummary": [
      "يناقش مطورو Roguecraft التحديات وسير العمل لتطوير الألعاب على منصة Amiga في عام 2024، مع تسليط الضوء على استخدام المحاكيات والتجميع المتقاطع من الأنظمة الحديثة مثل macOS.",
      "توصى باستخدام أدوات وإضافات متنوعة، مثل إضافة VS Studio Code لتصحيح أخطاء Amiga وأدوات التجميع المتقاطع لتطوير C وC++ الحديث.",
      "تعكس المحادثة تقديرًا نوستالجيًا لنظام الرسومات والألوان الفريد لجهاز أميغا، مقارنته بالشعور الأكثر حدة وبرودة لرسومات IBM/DOS."
    ],
    "points": 118,
    "commentCount": 15,
    "retryCount": 0,
    "time": 1722112540
  },
  {
    "id": 41092928,
    "title": "سير عمل تدوين الملاحظات باستخدام Obsidian",
    "originLink": "https://www.ssp.sh/blog/obsidian-note-taking-workflow/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41092928",
    "commentBody": "",
    "originSummary": [
      "يستخدم المؤلف برنامج Obsidian لتدوين الملاحظات وكتابة اليوميات وربط الأفكار، مشددًا على تنسيق الملفات المفتوحة ودعم Markdown لضمان استدامة الملاحظات في المستقبل.",
      "تعمل الإضافات الرئيسية مثل Dataview وExcalibrain وObsidian Admonition وTemplater على تعزيز وظائف وتكامل سير العمل الخاص بهم.",
      "مشاركة الملاحظات علنًا عبر Quartz تعزز التغذية الراجعة القيمة والاتصالات، مما يساهم في التعلم المستمر والتحسين."
    ],
    "commentSummary": [
      "تتمحور المناقشة حول تطبيق تدوين الملاحظات Obsidian، مسلطة الضوء على ميزاته وتجارب المستخدمين.",
      "يمدح المستخدمون برنامج Obsidian لمرونته واستخدامه لملفات Markdown ونظام الإضافات القوي، ويقارنونه بشكل إيجابي بأدوات أخرى مثل Emacs وNotion.",
      "يذكر بعض المستخدمين حلول المزامنة والمشكلات المحتملة، مثل المزامنة البطيئة عبر iCloud وتوفر إضافات المزامنة المعتمدة على Git."
    ],
    "points": 86,
    "commentCount": 62,
    "retryCount": 0,
    "time": 1722172476
  },
  {
    "id": 41091163,
    "title": "StreamPot: تشغيل FFmpeg كواجهة برمجة تطبيقات مع توافق fluent-FFmpeg، قوائم الانتظار وS3",
    "originLink": "https://github.com/StreamPot/StreamPot",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41091163",
    "commentBody": "",
    "originSummary": [
      "StreamPot هو أداة في مرحلة مبكرة مصممة لمهام تحويل الوسائط مثل تقليم الفيديوهات، إزالة الصوت، وتحويل الترميز، وتقدم حلاً بدون إعداد للمطورين.",
      "يمكن للمستخدمين إما استضافة الخادم بأنفسهم باتباع تعليمات التثبيت أو التسجيل في النسخة المستضافة لتجربتها.",
      "يستفيد المشروع من عمل فرق ffmpeg وfluent-ffmpeg، ويمكن تقديم الملاحظات عبر البريد الإلكتروني أو المكالمات المجدولة."
    ],
    "commentSummary": [
      "يتيح StreamPot تشغيل FFmpeg كواجهة برمجة تطبيقات مع توافق fluent-FFmpeg، وقوائم انتظار المهام، وتكامل S3.",
      "يناقش المستخدمون تحسينات، مثل إضافة طرق ملائمة للعمليات غير المتزامنة والإشارة عبر eventsource أو الأحداث المرسلة من الخادم (SSE).",
      "يفكر المطورون في تحديث الوثائق وإضافة ميزات مثل `runAndWait` والاستطلاع الطويل لتحسين الكفاءة."
    ],
    "points": 84,
    "commentCount": 3,
    "retryCount": 0,
    "time": 1722139744
  },
  {
    "id": 41093916,
    "title": "كيف تعمل المعالجة المتعددة المتزامنة خلف الكواليس",
    "originLink": "https://blog.codingconfessions.com/p/simultaneous-multithreading",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41093916",
    "commentBody": "",
    "originSummary": [
      "تعدد الخيوط المتزامن (SMT) يسمح لوحدة المعالجة المركزية بمعالجة التعليمات من خيطين في وقت واحد، مما يحسن استخدام الموارد ولكنه قد يقلل من أداء الخيط الواحد.",
      "تعدد مؤشرات الترابط الفائق من إنتل هو شكل من أشكال المعالجة المتعددة المتزامنة (SMT)، حيث يتم تكرار حالة بنية المعالج لجعل معالج فيزيائي واحد يظهر كنظامين منطقيين لنظام التشغيل.",
      "في حين أن تقنية المعالجة المتعددة المتزامنة (SMT) يمكن أن تعزز إنتاجية النظام، إلا أنها قد تُدخل ثغرات أمنية وتسبب تعارضات في الذاكرة المؤقتة، مما يدفع الخبراء إلى التوصية بتعطيلها في الأنظمة الحساسة للأمان."
    ],
    "commentSummary": [
      "ستقوم معالجات Arrow Lake القادمة من إنتل بإلغاء تقنية المعالجة المتعددة المتزامنة (SMT) نظرًا لأدائها المعتمد على التطبيقات.",
      "قد تكون خطوة تبسيط تصميم وحدة المعالجة المركزية مفيدة، خاصةً مع توفير نوى الأداء/الكفاءة (P/E) من إنتل بديلاً للأعمال ذات الخيوط الفردية أو المنخفضة.",
      "يستمر الجدل حول أهمية تقنية SMT، حيث تواصل AMD استخدام النوى المتجانسة وتقنية SMT، بينما تستكشف Intel استراتيجيات مختلفة."
    ],
    "points": 80,
    "commentCount": 14,
    "retryCount": 0,
    "time": 1722180914
  },
  {
    "id": 41090459,
    "title": "إيلون ماسك يشارك فيديو معدلاً لهاريس، في انتهاك واضح لسياسات X",
    "originLink": "https://www.nytimes.com/2024/07/27/us/politics/elon-musk-kamala-harris-deepfake.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41090459",
    "commentBody": "",
    "originSummary": [
      "أعاد إيلون ماسك نشر فيديو حملة معدّل رقميًا لنائبة الرئيس كامالا هاريس، والذي يبدو أنه ينتهك سياسات X ضد الوسائط الخادعة.",
      "الفيديو المُعدَّل، الذي تمت مشاهدته 98 مليون مرة، لم يتضمن إخلاء مسؤولية واحتوى على محتوى مضلل، مما أثار مخاوف بشأن تهديد التزييف العميق للديمقراطية.",
      "انتقد النقاد وحملة هاريس الفيديو، مشيرين إلى التناقض في تطبيق X لسياساته مقارنة بمنصات أخرى مثل ميتا وجوجل."
    ],
    "commentSummary": [
      "شارك إيلون ماسك مقطع فيديو مُعدَّل لكمالا هاريس، مما قد ينتهك سياسات X ويثير مناقشات حول تشديد اللوائح المتعلقة بالذكاء الاصطناعي.",
      "أدى الحادث إلى اقتراحات باستخدام Keyoxide للتحقق من المحتوى لمكافحة التزييف العميق.",
      "يشعر المستخدمون بالإحباط من تراجع تويتر، وزيادة نشاط الروبوتات، وتغييرات الخوارزمية التي تفضل المحتوى اليميني، مما يثير القلق بشأن قابلية استخدام المنصة وسياساتها المتعلقة بالمحتوى."
    ],
    "points": 77,
    "commentCount": 19,
    "retryCount": 0,
    "time": 1722127941
  }
]
