[
  {
    "id": 41090304,
    "title": "Bagaimana Facebook mencegat lalu lintas aplikasi seluler terenkripsi milik pesaing mereka?",
    "originLink": "https://doubleagent.net/onavo-facebook-ssl-mitm-technical-analysis/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41090304",
    "commentBody": "",
    "originSummary": [
      "Kelas gugatan terhadap Meta mengungkapkan bahwa Facebook mencegat lalu lintas terenkripsi dari perangkat pengguna yang menjalankan aplikasi Onavo Protect untuk mendapatkan wawasan kompetitif.",
      "Facebook diduga menggunakan serangan MITM (Man-In-The-Middle), yang disebut \"ssl bump,\" untuk mendekripsi lalu lintas dari domain seperti Snapchat, YouTube, dan Amazon.",
      "Kami mengumpulkan statistik penggunaan aplikasi yang terperinci dan data sensitif, yang menimbulkan kekhawatiran hukum dan etika yang signifikan."
    ],
    "commentSummary": [
      "Facebook membayar pengguna untuk menginstal proxy dengan dalih 'penelitian pasar,' memungkinkan mereka untuk mencegat dan mendekripsi lalu lintas aplikasi seluler terenkripsi milik pesaing.",
      "App Onavo, yang dipasarkan sebagai VPN, digunakan untuk mengumpulkan data tentang pesaing, menimbulkan kekhawatiran hukum dan etika, termasuk potensi pelanggaran undang-undang penyadapan.",
      "Meskipun pengguna telah menyetujui pemantauan, kejelasan pemahaman mereka tentang sejauh mana pengumpulan data tetap dipertanyakan."
    ],
    "points": 427,
    "commentCount": 174,
    "retryCount": 0,
    "time": 1722125301
  },
  {
    "id": 41090658,
    "title": "Bagaimana cara debug desain baterai Anda",
    "originLink": "https://github.com/ionworks/how-to-debug-your-battery",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41090658",
    "commentBody": "",
    "originSummary": [
      "PyBaMM adalah alat Python sumber terbuka yang dirancang untuk mensimulasikan fisika baterai, menjadikannya sumber daya yang berharga untuk penelitian dan pengembangan (R&D) baterai.",
      "Alat ini membantu mengatasi kutukan dimensi, sebuah tantangan umum dalam R&D baterai, dengan menyederhanakan simulasi yang kompleks.",
      "PyBaMM sangat berguna bagi para peneliti dan insinyur yang ingin memodelkan dan memahami perilaku baterai dengan lebih efisien."
    ],
    "commentSummary": [
      "Satu faktor pada satu waktu dalam pengujian tidak efisien untuk desain baterai; metode desain eksperimental modern dapat mengoptimalkan dengan lebih sedikit percobaan.",
      "PyBaMM (Python Battery Mathematical Modeling) tidak mencakup semua optimasi secara langsung, sehingga memerlukan metode yang lebih canggih untuk ruang desain yang lebih besar.",
      "Alat seperti PPK II dari Nordic Semiconductor, sensor efek Hall, dan resistor shunt direkomendasikan untuk pemprofilan energi dan pengukuran arus dalam proyek baterai."
    ],
    "points": 232,
    "commentCount": 71,
    "retryCount": 0,
    "time": 1722130746
  },
  {
    "id": 41089558,
    "title": "Apple telah mencapai kontrak serikat pekerja pertamanya dengan karyawan toko di Maryland",
    "originLink": "https://apnews.com/article/apple-union-contract-maryland-store-f9884d978bf3129c37726dd7978392a5",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41089558",
    "commentBody": "",
    "originSummary": [
      "Koalisi Pekerja Ritel Terorganisir dari Asosiasi Internasional Pekerja Mesin dan Dirgantara mengumumkan kesepakatan tiga tahun dengan Apple untuk karyawan di sebuah toko di Maryland, meningkatkan gaji rata-rata sebesar 10% dan menawarkan manfaat lainnya.",
      "Kesepakatan tersebut, yang menunggu persetujuan dari sekitar 85 karyawan, akan diputuskan pada 6 Agustus, setelah otorisasi pemogokan pada bulan Mei karena negosiasi yang tidak memuaskan.",
      "Tokoh Maryland ini adalah salah satu dari hanya dua lokasi Apple yang berserikat di AS, dengan yang kedua di Oklahoma City masih belum memiliki kontrak."
    ],
    "commentSummary": [
      "Apple telah menandatangani kontrak serikat pekerja pertamanya dengan karyawan toko di Maryland, menandai tonggak penting dalam hubungan perburuhan bagi perusahaan tersebut.",
      "Kabarnya Apple mungkin telah menyetujui kontrak tersebut untuk menghindari konflik, dengan beberapa pihak yang menyarankan bahwa perusahaan mungkin akan menutup toko jika serikat pekerja menyebabkan masalah, meskipun menutup toko semata-mata karena serikat pekerja adalah ilegal dan sulit dibuktikan.",
      "Perdebatan tentang dampak dan kebutuhan serikat pekerja terus berlanjut, dengan argumen baik untuk melindungi hak-hak pekerja maupun terhadap potensi kerugian bagi bisnis."
    ],
    "points": 169,
    "commentCount": 147,
    "retryCount": 0,
    "time": 1722116811
  },
  {
    "id": 41091803,
    "title": "Efek hakim lapar yang irasional ditinjau kembali (2023)",
    "originLink": "https://www.cambridge.org/core/journals/judgment-and-decision-making/article/irrational-hungry-judge-effect-revisited-simulations-reveal-that-the-magnitude-of-the-effect-is-overestimated/61CE825D4DC137675BB9CAD04571AE58",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41091803",
    "commentBody": "",
    "originSummary": [
      "Pemesanan online saat ini tidak tersedia karena masalah teknis per 10 Juli 2024; pengguna disarankan untuk memeriksa situs web untuk pembaruan.",
      "Kajian oleh Danziger, Levav, dan Avnaim-Pesso (2011) menemukan bahwa keputusan pembebasan bersyarat yang menguntungkan oleh hakim Israel menurun secara signifikan dalam satu sesi tetapi kembali ke tingkat awal setelah istirahat, menunjukkan kelelahan mental.",
      "Simulasi menunjukkan bahwa efek ini mungkin dilebih-lebihkan dan bisa disebabkan oleh artefak statistik, seperti putusan yang lebih lama menguntungkan dan manajemen waktu yang rasional oleh hakim, sehingga memerlukan penelitian lebih lanjut."
    ],
    "commentSummary": [
      "Studi 'efek hakim lapar yang irasional', yang mengklaim bahwa hakim lebih lunak setelah makan siang, telah ditinjau kembali dan ditemukan memiliki kekurangan yang signifikan.",
      "Kajian asli tidak memperhitungkan urutan kasus yang tidak acak, dengan kasus yang kurang parah dilihat terlebih dahulu dan yang lebih parah kemudian, yang mempengaruhi hasilnya.",
      "Kritikus menyarankan bahwa pengacakan urutan kasus dapat menghasilkan keputusan yudisial yang lebih efisien dan adil, yang menimbulkan pertanyaan lebih luas tentang dampak kelaparan pada pengambilan keputusan dan keandalan studi psikologis."
    ],
    "points": 160,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1722152111
  },
  {
    "id": 41092861,
    "title": "Kegemaran saya terhadap alat dan teknik untuk pengembangan game prosedural",
    "originLink": "https://cprimozic.net/blog/tools-and-techniques-for-procedural-gamedev/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41092861",
    "commentBody": "",
    "originSummary": [
      "Triplanar Mapping menyederhanakan tekstur tanpa peta UV, menjadikannya ideal untuk medan prosedural, dengan peningkatan untuk pencampuran dan kinerja yang lebih baik.",
      "Teknologi Sintesis Tekstur PBR (Physically Based Rendering) yang Didukung AI menggunakan kecerdasan buatan untuk menghasilkan tekstur berkualitas tinggi, meningkatkan kesetiaan visual.",
      "Kerja di masa depan mencakup penerapan Geometri Padat Konstruktif (CSG) untuk manipulasi mesh tingkat lanjut, seperti menggabungkan dan memotong mesh untuk mensimulasikan kerusakan."
    ],
    "commentSummary": [
      "Postingan tersebut membahas berbagai alat dan teknik untuk pengembangan game prosedural, menyoroti tantangan dan kompleksitas yang terlibat.",
      "Pengguna berbagi pengalaman dan kesulitan mereka dengan generasi prosedural, seperti menghubungkan geometri dan menghasilkan medan yang realistis.",
      "Artikel tersebut dipuji karena wawasannya tentang teknik prosedural, dengan beberapa pengguna mencatat keterampilan khusus yang diperlukan dalam bidang ini."
    ],
    "points": 159,
    "commentCount": 12,
    "retryCount": 0,
    "time": 1722171392
  },
  {
    "id": 41088895,
    "title": "Tritone Substitutions",
    "originLink": "https://johncarlosbaez.wordpress.com/2024/07/27/tritone-substitutions/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41088895",
    "commentBody": "",
    "originSummary": [
      "Kombinasi triton adalah teknik musik yang menggantikan akor dominan ketujuh dengan akor lain yang akarnya berjarak triton, menambahkan kecanggihan pada musik.",
      "Dalam kunci C, akor dominan ketujuh G-B-D-F dapat digantikan dengan C♯-F-G♯-B, mempertahankan beberapa nada dari akor asli tetapi menambahkan sentuhan unik.",
      "David Bennett dan Michael Keithson menyediakan penjelasan video dan contoh-contoh, dengan Bennett berfokus pada lagu-lagu populer dan Keithson menawarkan pendekatan yang lebih analitis, termasuk pelajaran tentang akor dominan."
    ],
    "commentSummary": [
      "Tritone substitusi dalam jazz melibatkan penggantian akor dominan (V7) dengan akor dominan lain yang berjarak triton (II♭7), menciptakan garis bass turun kromatik.",
      "Teknik ini digunakan untuk menambah minat harmonis dan umum dalam jazz, serta dalam musik populer seperti tema Simpsons dan lagu Beatles 'I Am the Walrus.'",
      "Diskusi ini menyoroti pentingnya memahami konsep teori musik seperti nada panduan (nada ke-3 dan ke-7) dan konteks historis dari analisis harmonik."
    ],
    "points": 157,
    "commentCount": 102,
    "retryCount": 0,
    "time": 1722109954
  },
  {
    "id": 41092460,
    "title": "CalcGPT",
    "originLink": "https://calcgpt.io/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41092460",
    "commentBody": "",
    "originSummary": [
      "CalcGPT, dikembangkan oleh Calvin Liang, adalah kalkulator satir yang menggunakan model bahasa GPT-3, mengkritik obsesi modern terhadap AI.",
      "Itu berfungsi sebagai alat komputasi sekaligus komentar sosial, mempertanyakan kebutuhan AI dalam semua aspek kehidupan.",
      "Dengan sengaja menjadi lambat dan rentan terhadap kesalahan, CalcGPT mendorong refleksi tentang keseimbangan antara metode tradisional dan inovasi."
    ],
    "commentSummary": [
      "CalcGPT, sebuah aplikasi AI yang humoris, sedang menarik minat karena pendekatan satirnya terhadap kemampuan AI, terutama dalam melakukan operasi aritmatika dasar.",
      "Kegunaan aplikasi ini menggunakan model GPT-3 yang sudah usang (babbage-002), yang menghasilkan hasil yang sengaja salah dan menghibur, menyoroti kesenjangan antara model AI lama dan baru seperti GPT-4.",
      "Meskipun bersifat humoris, CalcGPT berfungsi sebagai kritik terhadap hype AI, menunjukkan keterbatasan model-model sebelumnya dan memicu diskusi tentang kemajuan dalam teknologi AI."
    ],
    "points": 152,
    "commentCount": 41,
    "retryCount": 0,
    "time": 1722164931
  },
  {
    "id": 41090222,
    "title": "Plan 9 adalah sistem operasi yang unik dan lengkap",
    "originLink": "https://posixcafe.org/blogs/2024/07/27/0/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41090222",
    "commentBody": "",
    "originSummary": [
      "Plan 9 adalah sistem operasi yang komprehensif yang mencakup semua perangkat lunak yang diperlukan dalam instalasi dasarnya, seperti kompiler, lingkungan grafis, dan editor teks.",
      "Berbeda dengan sistem Linux dan BSD, desain monolitik Plan 9 memastikan konsistensi dan menyederhanakan pengembangan perangkat lunak dengan menghilangkan kebutuhan untuk menguji terhadap berbagai konfigurasi.",
      "Walaupun Plan 9 mungkin kekurangan beberapa fitur dibandingkan dengan sistem arus utama, ia berfungsi sebagai sumber belajar yang sangat baik dan tempat uji coba untuk eksperimen sistem operasi."
    ],
    "commentSummary": [
      "Plan 9 adalah sistem operasi yang memungkinkan akses lintas platform ke drive C pada Windows dan Windows Subsystem for Linux (WSL) menggunakan protokol filesystem 9P2000.L.",
      "Microsoft memilih Plan 9 daripada Samba karena kesederhanaannya dan kode server yang sudah ada, dengan jalur \\\\wsl$\\ dikelola oleh MUP di Windows dan komunikasi melalui soket Unix.",
      "Plan 9 berfokus pada perangkat lunak yang dapat dikomposisi, mengikuti filosofi Unix tentang program kecil dan terfokus, tetapi tetap menjadi minat khusus karena kurangnya fitur modern dan integrasi."
    ],
    "points": 144,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1722124352
  },
  {
    "id": 41089911,
    "title": "Pemikiran Pertama tentang Intel N100 Radxa X4",
    "originLink": "https://bret.dk/intel-n100-radxa-x4-first-thoughts/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41089911",
    "commentBody": "",
    "originSummary": [
      "Radxa mengumumkan Radxa x4 Single Board Computer (SBC) berbasis Intel N100, yang serupa dalam bentuk dengan Raspberry Pi 5, dengan prosesor x86 Intel N100.",
      "Radxa x4 mendukung Windows 11 dan Debian 12, dengan instalasi yang lancar tetapi awalnya tidak memiliki driver jaringan.",
      "Fitur utama termasuk Ethernet 2.5Gbit, dukungan M.2 NVMe, dan BIOS yang komprehensif, meskipun membutuhkan dokumentasi dan solusi pendinginan yang lebih baik."
    ],
    "commentSummary": [
      "The Intel N100 Radxa X4 adalah komputer papan tunggal (SBC) baru yang dihargai $60, menawarkan arsitektur x86, transcoding perangkat keras, dan dilaporkan tiga kali lebih kuat daripada Raspberry Pi 5.",
      "Fitur utama termasuk NIC (Network Interface Card) 2.5G dengan dukungan PoE (Power over Ethernet) dan slot m.2, yang menambah nilai signifikan dibandingkan dengan Raspberry Pi.",
      "Board ini telah menarik minat karena harganya yang kompetitif, kinerja yang ditingkatkan, dan potensinya untuk masuk ke dalam casing Raspberry Pi yang ada, menjadikannya pilihan menarik bagi para hobiis dan profesional."
    ],
    "points": 143,
    "commentCount": 126,
    "retryCount": 0,
    "time": 1722120717
  },
  {
    "id": 41088592,
    "title": "Managarm: OS berbasis microkernel pragmatis dengan I/O asinkron",
    "originLink": "https://github.com/managarm/managarm",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41088592",
    "commentBody": "",
    "originSummary": [
      "managarm adalah sistem operasi berbasis mikrokernel, berbeda dari Linux dan Windows, yang menampilkan API asinkron sepenuhnya untuk I/O dan kompatibilitas ruang pengguna Linux yang baik.",
      "Itu bukan distribusi Linux tetapi mendukung banyak API Linux, menawarkan fitur seperti dukungan 64-bit, kompatibilitas perangkat keras modern, dan kepatuhan POSIX.",
      "Pengguna dapat mencoba managarm dengan mengunduh gambar nightly dan menjalankannya dengan bendera qemu tertentu, mendukung perangkat lunak seperti Weston dan GNU Coreutils, serta perangkat keras seperti pengendali USB dan berbagai kartu grafis."
    ],
    "commentSummary": [
      "Managarm adalah sistem operasi berbasis mikrokernel dengan I/O asinkron, yang terutama diuji pada QEMU, sebuah emulator sumber terbuka yang populer.",
      "Kegiatan ini telah menarik minat karena dukungan driver modernnya, termasuk USB, dan potensinya untuk berjalan pada perangkat keras nyata, meskipun menghadapi tantangan pada komponen tingkat rendah.",
      "Pembaruan terbaru mencakup kemampuan untuk menjalankan peramban web modern, yang menunjukkan kemajuan signifikan dan peningkatan fungsionalitas."
    ],
    "points": 136,
    "commentCount": 53,
    "retryCount": 0,
    "time": 1722107174
  },
  {
    "id": 41089161,
    "title": "Pengembang Roguecraft tentang Mengembangkan untuk Amiga pada tahun 2024",
    "originLink": "https://www.timeextension.com/features/interview-its-easy-to-get-a-bit-over-ambitious-roguecraft-devs-on-developing-for-amiga-in-2024",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41089161",
    "commentBody": "",
    "originSummary": [
      "Roguecraft, yang dikembangkan oleh Badger Punch Games, adalah game Amiga yang sangat dinantikan dan dijadwalkan rilis pada September 2024, setelah kesuksesan Rogue 64.",
      "Pengembangan, yang awalnya direncanakan selama 6 bulan, diperpanjang menjadi 2 tahun karena kompleksitas bekerja dengan perangkat keras Amiga, meskipun memiliki keunggulan seperti kecepatan dan koprosesor khusus.",
      "Kami menampilkan grafis isometrik, lebih dari 100 variasi ruangan, dan tersedia untuk pre-order melalui Thalamus Digital, dengan umpan balik positif dari komunitas."
    ],
    "commentSummary": [
      "Kreator Roguecraft membahas tantangan dan alur kerja untuk pengembangan di platform Amiga pada tahun 2024, menyoroti penggunaan emulator dan kompilasi silang dari sistem modern seperti macOS.",
      "Berbagai alat dan plugin direkomendasikan, seperti Plugin VS Studio Code untuk debugging Amiga dan alat cross-compiling untuk pengembangan C dan C++ modern.",
      "Percakapan tersebut mencerminkan apresiasi nostalgia terhadap sistem grafis dan warna unik Amiga, yang kontras dengan tampilan grafis IBM/DOS yang lebih tajam dan dingin."
    ],
    "points": 118,
    "commentCount": 15,
    "retryCount": 0,
    "time": 1722112540
  },
  {
    "id": 41092928,
    "title": "Kegiatan mencatat saya menggunakan Obsidian",
    "originLink": "https://www.ssp.sh/blog/obsidian-note-taking-workflow/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41092928",
    "commentBody": "",
    "originSummary": [
      "Penulis menggunakan Obsidian untuk mencatat, membuat jurnal, dan menghubungkan wawasan, menekankan format file terbuka dan dukungan Markdown-nya untuk menjamin catatan di masa depan.",
      "Plugin utama seperti Dataview, Excalibrain, Obsidian Admonition, dan Templater meningkatkan fungsionalitas dan integrasi alur kerja mereka.",
      "Berbagi catatan secara publik melalui Quartz mendorong umpan balik dan koneksi yang berharga, berkontribusi pada pembelajaran dan perbaikan yang berkelanjutan."
    ],
    "commentSummary": [
      "Diskusi berpusat pada aplikasi pencatatan Obsidian, menyoroti fitur-fiturnya dan pengalaman pengguna.",
      "Pengguna memuji Obsidian karena fleksibilitasnya, penggunaan file Markdown, dan ekosistem plugin yang kuat, membandingkannya secara positif dengan alat lain seperti Emacs dan Notion.",
      "Beberapa pengguna menyebutkan solusi sinkronisasi dan potensi masalah, seperti sinkronisasi iCloud yang lambat dan ketersediaan plugin sinkronisasi berbasis Git."
    ],
    "points": 86,
    "commentCount": 62,
    "retryCount": 0,
    "time": 1722172476
  },
  {
    "id": 41091163,
    "title": "StreamPot: Jalankan FFmpeg sebagai API dengan kompatibilitas fluent-FFmpeg, antrian, dan S3",
    "originLink": "https://github.com/StreamPot/StreamPot",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41091163",
    "commentBody": "",
    "originSummary": [
      "StreamPot adalah alat tahap awal yang dirancang untuk tugas transformasi media seperti memotong video, menghapus audio, dan mentranskode, menawarkan solusi tanpa pengaturan untuk pengembang.",
      "Pengguna dapat meng-host server sendiri dengan mengikuti petunjuk instalasi atau mendaftar untuk versi yang di-host untuk mencobanya.",
      "Proyek ini memanfaatkan kerja tim ffmpeg dan fluent-ffmpeg, dan umpan balik dapat diberikan melalui email atau panggilan terjadwal."
    ],
    "commentSummary": [
      "StreamPot memungkinkan menjalankan FFmpeg sebagai API dengan kompatibilitas fluent-FFmpeg, antrian pekerjaan, dan integrasi S3.",
      "Pengguna sedang mendiskusikan perbaikan, seperti menambahkan metode kenyamanan untuk operasi asinkron dan pemberian sinyal melalui eventsource atau Server-Sent Events (SSE).",
      "Para pengembang sedang mempertimbangkan untuk memperbarui dokumentasi dan menambahkan fitur seperti `runAndWait` dan long polling untuk efisiensi yang lebih baik."
    ],
    "points": 84,
    "commentCount": 3,
    "retryCount": 0,
    "time": 1722139744
  },
  {
    "id": 41093916,
    "title": "Bagaimana multithreading simultan bekerja di balik layar",
    "originLink": "https://blog.codingconfessions.com/p/simultaneous-multithreading",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41093916",
    "commentBody": "",
    "originSummary": [
      "Simultaneous Multithreading (SMT) memungkinkan sebuah CPU untuk menangani instruksi dari dua thread secara bersamaan, meningkatkan pemanfaatan sumber daya tetapi berpotensi mengurangi kinerja single-thread.",
      "Hyper-threading Intel adalah bentuk SMT, menggandakan status arsitektur prosesor untuk membuat satu prosesor fisik terlihat sebagai dua prosesor logis bagi sistem operasi.",
      "Walaupun SMT dapat meningkatkan throughput sistem, hal ini mungkin memperkenalkan kerentanan keamanan dan konflik cache, sehingga para ahli merekomendasikan untuk menonaktifkannya pada sistem yang kritis terhadap keamanan."
    ],
    "commentSummary": [
      "CPU Arrow Lake yang akan datang dari Intel akan menghilangkan hyperthreading (Simultaneous Multithreading, SMT) karena peningkatan kinerjanya yang bergantung pada aplikasi.",
      "Kebijakan untuk menyederhanakan desain CPU mungkin bermanfaat, terutama karena inti P/E (Performa/Efisiensi) dari Intel menyediakan alternatif untuk beban kerja tunggal atau dengan utas rendah.",
      "Perdebatan tentang relevansi SMT terus berlanjut, dengan AMD mempertahankan penggunaan inti homogen dan SMT, sementara Intel mengeksplorasi strategi yang berbeda."
    ],
    "points": 80,
    "commentCount": 14,
    "retryCount": 0,
    "time": 1722180914
  },
  {
    "id": 41090459,
    "title": "Elon Musk Membagikan Video Harris yang Dimanipulasi, Tampaknya Melanggar Kebijakan X",
    "originLink": "https://www.nytimes.com/2024/07/27/us/politics/elon-musk-kamala-harris-deepfake.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41090459",
    "commentBody": "",
    "originSummary": [
      "Elon Musk memposting ulang video kampanye Wakil Presiden Kamala Harris yang telah diubah secara digital, yang tampaknya melanggar kebijakan X terhadap media yang menipu.",
      "Klip video yang dimanipulasi, ditonton sebanyak 98 juta kali, tidak memiliki penafian dan menyertakan konten yang menyesatkan, menimbulkan kekhawatiran tentang ancaman deepfake terhadap demokrasi.",
      "Kritikus dan kampanye Harris mengutuk video tersebut, menyoroti ketidakkonsistenan dalam penegakan kebijakan X dibandingkan dengan platform lain seperti Meta dan Google."
    ],
    "commentSummary": [
      "Elon Musk membagikan video manipulasi Kamala Harris, yang berpotensi melanggar kebijakan X dan memicu diskusi tentang regulasi AI yang lebih ketat.",
      "Insiden tersebut telah memunculkan saran untuk menggunakan Keyoxide untuk verifikasi konten guna melawan deepfake.",
      "Pengguna merasa frustrasi dengan penurunan kualitas Twitter, peningkatan aktivitas bot, dan perubahan algoritma yang lebih menguntungkan konten sayap kanan, yang menimbulkan kekhawatiran tentang kegunaan platform dan kebijakan kontennya."
    ],
    "points": 77,
    "commentCount": 19,
    "retryCount": 0,
    "time": 1722127941
  }
]
