[
  {
    "id": 41090304,
    "title": "Facebook, rakiplerinin şifrelenmiş mobil uygulama trafiğini nasıl ele geçirdi?",
    "originLink": "https://doubleagent.net/onavo-facebook-ssl-mitm-technical-analysis/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41090304",
    "commentBody": "",
    "originSummary": [
      "Meta'ya karşı açılan toplu dava, Facebook'un rekabetçi içgörüler elde etmek için Onavo Protect uygulamasını çalıştıran kullanıcıların cihazlarından şifreli trafiği engellediğini ortaya çıkardı.",
      "Facebook'un, Snapchat, YouTube ve Amazon gibi alan adlarından gelen trafiği şifrelerini çözmek için \"ssl bump\" olarak adlandırılan bir MITM (Ortadaki Adam) saldırısı kullandığı iddia ediliyor.",
      "Onavo Protect uygulaması, ayrıntılı uygulama kullanım istatistikleri ve hassas veriler topladı, bu da önemli yasal ve etik kaygılar yarattı."
    ],
    "commentSummary": [
      "Facebook, kullanıcıların rakiplerinin şifrelenmiş mobil uygulama trafiğini yakalayıp çözmelerine olanak tanıyan bir vekil sunucuyu \"pazar araştırması\" kisvesi altında yüklemeleri için ödeme yaptı.",
      "Uygulama, Onavo, bir VPN olarak pazarlanmıştı, rakipler hakkında veri toplamak için kullanıldı ve bu durum, potansiyel telekulak yasası ihlalleri de dahil olmak üzere yasal ve etik kaygılar yarattı.",
      "Her ne kadar kullanıcılar izlemeye rıza göstermiş olsa da, veri toplamanın kapsamını ne kadar anladıkları belirsizliğini koruyor."
    ],
    "points": 427,
    "commentCount": 174,
    "retryCount": 0,
    "time": 1722125301
  },
  {
    "id": 41090658,
    "title": "Pil tasarımınızı nasıl hata ayıklayabilirsiniz",
    "originLink": "https://github.com/ionworks/how-to-debug-your-battery",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41090658",
    "commentBody": "",
    "originSummary": [
      "PyBaMM, pil fiziğini simüle etmek için tasarlanmış açık kaynaklı bir Python aracıdır ve bu da onu pil araştırma ve geliştirme (Ar-Ge) için değerli bir kaynak haline getirir.",
      "Bu araç, karmaşık simülasyonları basitleştirerek, batarya Ar-Ge'sinde yaygın bir zorluk olan boyutsallık lanetini ele almaya yardımcı olur.",
      "PyBaMM, batarya davranışını daha verimli bir şekilde modellemek ve anlamak isteyen araştırmacılar ve mühendisler için özellikle faydalıdır."
    ],
    "commentSummary": [
      "Tek faktörlü testler, pil tasarımı için verimsizdir; modern deney tasarımı yöntemleri, daha az deneme ile optimize edebilir.",
      "PyBaMM (Python Batarya Matematiksel Modelleme) tüm optimizasyonları kutudan çıktığı gibi kapsamaz, bu da daha büyük tasarım alanları için daha sofistike yöntemler gerektirir.",
      "Nordic Semiconductor'ın PPK II, Hall etkisi sensörleri ve şönt dirençleri gibi araçlar, pil projelerinde enerji profilleme ve akım ölçümü için önerilmektedir."
    ],
    "points": 232,
    "commentCount": 71,
    "retryCount": 0,
    "time": 1722130746
  },
  {
    "id": 41089558,
    "title": "Apple, Maryland'deki mağaza çalışanlarıyla ilk sendika sözleşmesine ulaştı",
    "originLink": "https://apnews.com/article/apple-union-contract-maryland-store-f9884d978bf3129c37726dd7978392a5",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41089558",
    "commentBody": "",
    "originSummary": [
      "Uluslararası Makineciler ve Havacılık İşçileri Birliği'nin Organize Perakende Çalışanları Koalisyonu, Maryland'deki bir Apple mağazasındaki çalışanlar için maaşları ortalama %10 artıran ve diğer faydalar sunan üç yıllık bir anlaşma duyurdu.",
      "Anlaşma, yaklaşık 85 çalışan tarafından onay beklerken, Mayıs ayında yapılan yetersiz müzakereler nedeniyle grev yetkisi verilmesinin ardından 6 Ağustos'ta oylanacak.",
      "Bu Maryland mağazası, ABD'deki yalnızca iki sendikalı Apple lokasyonundan biridir ve ikincisi Oklahoma City'de olup hâlâ bir sözleşmesi yoktur."
    ],
    "commentSummary": [
      "Apple, Maryland'deki mağaza çalışanlarıyla ilk sendika sözleşmesini imzalayarak şirketin işçi ilişkilerinde önemli bir dönüm noktasına ulaştı.",
      "Apple'ın, çatışmadan kaçınmak için sözleşmeyi kabul etmiş olabileceği yönünde spekülasyonlar var. Bazıları, sendikalaşmanın sorunlara yol açması durumunda şirketin mağazayı kapatabileceğini öne sürüyor, ancak yalnızca sendikalaşma nedeniyle bir mağazayı kapatmak yasa dışıdır ve kanıtlanması zordur.",
      "Sendikaların etkisi ve gerekliliği konusundaki tartışma, hem işçilerin haklarını koruma lehine hem de işletmelere potansiyel zarar verme aleyhine argümanlarla devam ediyor."
    ],
    "points": 169,
    "commentCount": 147,
    "retryCount": 0,
    "time": 1722116811
  },
  {
    "id": 41091803,
    "title": "İrrasyonel aç yargıç etkisi yeniden incelendi (2023)",
    "originLink": "https://www.cambridge.org/core/journals/judgment-and-decision-making/article/irrational-hungry-judge-effect-revisited-simulations-reveal-that-the-magnitude-of-the-effect-is-overestimated/61CE825D4DC137675BB9CAD04571AE58",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41091803",
    "commentBody": "",
    "originSummary": [
      "10 Temmuz 2024 itibarıyla teknik sorunlar nedeniyle çevrimiçi sipariş verme şu anda kullanılamamaktadır; kullanıcıların güncellemeler için web sitesini kontrol etmeleri tavsiye edilir.",
      "Danziger, Levav ve Avnaim-Pesso (2011) tarafından yapılan bir çalışma, İsrailli yargıçların olumlu şartlı tahliye kararlarının bir oturum içinde önemli ölçüde düştüğünü, ancak bir aradan sonra başlangıç seviyelerine geri döndüğünü ve bunun zihinsel tükenmeyi işaret ettiğini buldu.",
      "Simülasyonlar, bu etkinin abartılmış olabileceğini ve daha uzun süreli lehte kararlar ve hakimlerin rasyonel zaman yönetimi gibi istatistiksel yanılgılardan kaynaklanabileceğini göstermektedir, bu da daha fazla araştırma gerektirmektedir."
    ],
    "commentSummary": [
      "Öğle yemeğinden sonra hakimlerin daha hoşgörülü olduğunu iddia eden \"irrasyonel aç hakim etkisi\" çalışması yeniden incelendi ve önemli kusurlar bulundu.",
      "Orijinal araştırma, daha az şiddetli vakaların önce ve daha şiddetli vakaların daha sonra görülmesiyle sonuçları etkileyen rastgele olmayan vaka sıralamasını dikkate almadı.",
      "Eleştirmenler, dava sırasının rastgeleleştirilmesinin daha verimli ve adil yargı kararlarına yol açabileceğini öne sürerek, açlığın karar verme üzerindeki etkisi ve psikolojik çalışmaların güvenilirliği hakkında daha geniş sorular gündeme getiriyor."
    ],
    "points": 160,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1722152111
  },
  {
    "id": 41092861,
    "title": "Prosedürel oyun geliştirme için en sevdiğim araçlar ve teknikler",
    "originLink": "https://cprimozic.net/blog/tools-and-techniques-for-procedural-gamedev/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41092861",
    "commentBody": "",
    "originSummary": [
      "Triplanar Haritalama, UV haritaları olmadan dokulandırmayı basitleştirir, bu da onu prosedürel arazi için ideal hale getirir ve daha iyi harmanlama ve performans için iyileştirmeler sunar.",
      "Yapay Zeka Destekli PBR (Fiziksel Tabanlı Görselleştirme) Doku Sentezi, yüksek kaliteli dokular oluşturmak için yapay zekayı kullanarak görsel doğruluğu artırır.",
      "İleriye dönük çalışmalar, hasarı simüle etmek için ağları birleştirme ve kesme gibi gelişmiş ağ manipülasyonu için Yapıcı Katı Geometri (CSG) uygulamasını içermektedir."
    ],
    "commentSummary": [
      "Yazı, prosedürel oyun geliştirme için çeşitli araçlar ve teknikleri tartışarak, bu süreçte karşılaşılan zorluklar ve karmaşıklıkları vurguluyor.",
      "Kullanıcılar, geometriyi bağlama ve gerçekçi arazi oluşturma gibi prosedürel üretimle ilgili deneyimlerini ve zorluklarını paylaşıyor.",
      "Makale, prosedürel tekniklere dair içgörülerinden dolayı övülüyor ve bazı kullanıcılar bu alanda gerekli olan özel becerilere dikkat çekiyor."
    ],
    "points": 159,
    "commentCount": 12,
    "retryCount": 0,
    "time": 1722171392
  },
  {
    "id": 41088895,
    "title": "Tritone İkame",
    "originLink": "https://johncarlosbaez.wordpress.com/2024/07/27/tritone-substitutions/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41088895",
    "commentBody": "",
    "originSummary": [
      "Triton yerine koyma, müziğe sofistike bir hava katmak için bir dominant yedili akorunu, kökü bir triton uzaklıkta olan başka bir akorla değiştiren bir müzikal tekniktir.",
      "Do majör tonunda, G-B-D-F dominant yedili akoru, orijinal akorun bazı notalarını koruyarak ancak benzersiz bir dokunuş ekleyerek C♯-F-G♯-B ile değiştirilebilir.",
      "David Bennett ve Michael Keithson video açıklamaları ve örnekler sunar; Bennett popüler şarkılara odaklanırken, Keithson daha analitik bir yaklaşım sunar ve dominant akorlar üzerine dersler içerir."
    ],
    "commentSummary": [
      "Triton yerine koyma, cazda bir dominant akorun (V7) başka bir dominant akorla, bir triton uzaklıkta olan (II♭7) değiştirilmesini içerir ve bu, kromatik olarak alçalan bir bas hattı oluşturur.",
      "Bu teknik, armonik ilgi eklemek için kullanılır ve cazda yaygın olduğu gibi, Simpsons teması ve Beatles'ın \"I Am the Walrus\" gibi popüler müziklerde de yaygındır.",
      "Bu tartışma, rehber tonlar (3. ve 7. notalar) gibi müzik teorisi kavramlarını ve armonik analizinin tarihsel bağlamını anlamanın önemini vurgulamaktadır."
    ],
    "points": 157,
    "commentCount": 102,
    "retryCount": 0,
    "time": 1722109954
  },
  {
    "id": 41092460,
    "title": "CalcGPT",
    "originLink": "https://calcgpt.io/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41092460",
    "commentBody": "",
    "originSummary": [
      "CalcGPT, Calvin Liang tarafından geliştirilen, modern yapay zeka takıntısını eleştiren, GPT-3 dil modelini kullanan hicivli bir hesap makinesidir.",
      "Bu, hem bir hesaplama aracı hem de sosyal bir yorum olarak hizmet eder, hayatın her alanında yapay zekanın gerekliliğini sorgular.",
      "Kasıtlı olarak yavaş ve hataya açık olan CalcGPT, geleneksel yöntemler ile yenilik arasındaki denge üzerine düşünmeyi teşvik eder."
    ],
    "commentSummary": [
      "CalcGPT, esprili bir yapay zeka uygulaması, özellikle temel aritmetik işlemleri gerçekleştirme konusundaki hicivli yaklaşımıyla ilgi çekiyor.",
      "Uygulama, kasıtlı olarak yanlış ve eğlenceli sonuçlara yol açan eski bir GPT-3 modeli (babbage-002) kullanıyor ve bu durum, eski ve yeni yapay zeka modelleri arasındaki farkı vurguluyor, örneğin GPT-4 gibi.",
      "Esprili doğasına rağmen, CalcGPT, AI abartısının bir eleştirisi olarak hizmet eder, önceki modellerin sınırlamalarını gösterir ve AI teknolojisindeki ilerlemeler hakkında tartışmalar başlatır."
    ],
    "points": 152,
    "commentCount": 41,
    "retryCount": 0,
    "time": 1722164931
  },
  {
    "id": 41090222,
    "title": "Plan 9, benzersiz bir şekilde eksiksiz bir işletim sistemidir",
    "originLink": "https://posixcafe.org/blogs/2024/07/27/0/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41090222",
    "commentBody": "",
    "originSummary": [
      "Plan 9, derleyiciler, grafik ortamlar ve metin düzenleyiciler gibi tüm gerekli yazılımları temel kurulumunda içeren kapsamlı bir işletim sistemidir.",
      "Linux ve BSD sistemlerinin aksine, Plan 9'un tek parça tasarımı tutarlılığı sağlar ve yazılım geliştirmeyi, birden fazla yapılandırmaya karşı test etme gerekliliğini ortadan kaldırarak basitleştirir.",
      "Plan 9, ana akım sistemlere kıyasla bazı özelliklerden yoksun olabilir, ancak işletim sistemi denemeleri için mükemmel bir öğrenme kaynağı ve oyun alanı olarak hizmet eder."
    ],
    "commentSummary": [
      "Plan 9, 9P2000.L dosya sistemi protokolünü kullanarak Windows ve Windows Subsystem for Linux (WSL) üzerinde C sürücüsüne çapraz platform erişimi sağlayan bir işletim sistemidir.",
      "Microsoft, basitliği ve mevcut sunucu kodu nedeniyle Samba yerine Plan 9'u seçti; \\\\wsl$\\ yolu Windows'taki MUP tarafından yönetilir ve iletişim bir Unix soketi aracılığıyla sağlanır.",
      "Plan 9, küçük ve odaklanmış programlar felsefesine bağlı kalarak birleştirilebilir yazılıma odaklanır, ancak modern özellikler ve entegrasyon eksikliği nedeniyle niş bir ilgi alanı olarak kalır."
    ],
    "points": 144,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1722124352
  },
  {
    "id": 41089911,
    "title": "Intel N100 Radxa X4 İlk Düşünceler",
    "originLink": "https://bret.dk/intel-n100-radxa-x4-first-thoughts/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41089911",
    "commentBody": "",
    "originSummary": [
      "Radxa, x86 Intel N100 işlemciye sahip, form olarak Raspberry Pi 5'e benzeyen Intel N100 tabanlı Radxa x4 Tek Kart Bilgisayarı'nı (SBC) duyurdu.",
      "Radxa x4, Windows 11 ve Debian 12'yi destekler, sorunsuz kurulumlar sağlar ancak başlangıçta ağ sürücüleri eksiktir.",
      "Temel özellikler arasında 2.5Gbit Ethernet, M.2 NVMe desteği ve kapsamlı bir BIOS bulunur, ancak daha iyi belgeler ve soğutma çözümlerine ihtiyaç duyar."
    ],
    "commentSummary": [
      "Intel N100 Radxa X4, 60 dolarlık fiyatıyla yeni bir tek kartlı bilgisayardır (SBC). x86 mimarisi, donanım kod dönüştürme özellikleri sunar ve iddialara göre Raspberry Pi 5'ten üç kat daha güçlüdür.",
      "Temel özellikler arasında PoE (Ethernet Üzerinden Güç) desteğine sahip 2.5G NIC (Ağ Arayüz Kartı) ve Raspberry Pi'ye kıyasla önemli bir değer katan bir m.2 yuvası bulunur.",
      "Kurul, rekabetçi fiyatlandırması, geliştirilmiş performansı ve mevcut Raspberry Pi kasalarına uyum sağlama potansiyeli nedeniyle hem hobi meraklıları hem de profesyoneller için çekici bir seçenek haline gelmiştir."
    ],
    "points": 143,
    "commentCount": 126,
    "retryCount": 0,
    "time": 1722120717
  },
  {
    "id": 41088592,
    "title": "Managarm: Asenkron G/Ç ile pragmatik mikro çekirdek tabanlı işletim sistemi",
    "originLink": "https://github.com/managarm/managarm",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41088592",
    "commentBody": "",
    "originSummary": [
      "managarm, Linux ve Windows'tan farklı olarak mikro çekirdek tabanlı bir işletim sistemidir ve I/O için tamamen asenkron bir API ile iyi bir Linux kullanıcı alanı uyumluluğu sunar.",
      "Bu bir Linux dağıtımı değildir ancak birçok Linux API'sini destekler, 64-bit desteği, modern donanım uyumluluğu ve POSIX uyumluluğu gibi özellikler sunar.",
      "Kullanıcılar, bir nightly imaj indirip belirli qemu bayraklarıyla çalıştırarak managarm'ı deneyebilirler. Weston ve GNU Coreutils gibi yazılımları ve USB denetleyicileri ile çeşitli grafik kartları gibi donanımları destekler."
    ],
    "commentSummary": [
      "Managarm, asenkron G/Ç ile mikro çekirdek tabanlı bir işletim sistemidir ve öncelikle popüler açık kaynaklı bir emülatör olan QEMU üzerinde test edilmiştir.",
      "Proje, USB dahil modern sürücü desteği ve gerçek donanımda çalışabilme potansiyeli nedeniyle ilgi topladı, ancak düşük seviyeli bileşenlerde zorluklarla karşılaşıyor.",
      "Son güncellemeler, modern bir web tarayıcısını çalıştırma yeteneğini içeriyor ve bu da önemli ilerlemeler ve işlevsellik iyileştirmeleri olduğunu gösteriyor."
    ],
    "points": 136,
    "commentCount": 53,
    "retryCount": 0,
    "time": 1722107174
  },
  {
    "id": 41089161,
    "title": "Roguecraft Geliştiricileri 2024'te Amiga İçin Geliştirme Üzerine",
    "originLink": "https://www.timeextension.com/features/interview-its-easy-to-get-a-bit-over-ambitious-roguecraft-devs-on-developing-for-amiga-in-2024",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41089161",
    "commentBody": "",
    "originSummary": [
      "Roguecraft, Badger Punch Games tarafından geliştirilen ve Rogue 64'ün başarısının ardından Eylül 2024'te piyasaya sürülmesi beklenen, büyük bir merakla beklenen bir Amiga oyunudur.",
      "Başlangıçta 6 ay olarak planlanan geliştirme, Amiga'nın donanımıyla çalışmanın karmaşıklıkları nedeniyle, hız ve özel yardımcı işlemciler gibi avantajlarına rağmen 2 yıla uzadı.",
      "Oyun, izometrik grafikler, 100'den fazla oda varyasyonu içeriyor ve Thalamus Digital aracılığıyla ön siparişe sunulmuş durumda, topluluktan olumlu geri bildirimler alıyor."
    ],
    "commentSummary": [
      "Roguecraft geliştiricileri, 2024 yılında Amiga platformunda geliştirme yapmanın zorluklarını ve iş akışlarını tartışarak, emülatörlerin ve macOS gibi modern sistemlerden çapraz derlemenin kullanımını vurguluyor.",
      "Çeşitli araçlar ve eklentiler önerilmektedir, örneğin Amiga hata ayıklama için VS Studio Code Eklentisi ve modern C ve C++ geliştirme için çapraz derleme araçları.",
      "Konuşma, Amiga'nın benzersiz grafik ve renk sistemine duyulan nostaljik bir takdiri yansıtıyor ve bunu IBM/DOS grafiklerinin daha keskin, soğuk hissiyle karşılaştırıyor."
    ],
    "points": 118,
    "commentCount": 15,
    "retryCount": 0,
    "time": 1722112540
  },
  {
    "id": 41092928,
    "title": "Obsidian not alma iş akışım",
    "originLink": "https://www.ssp.sh/blog/obsidian-note-taking-workflow/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41092928",
    "commentBody": "",
    "originSummary": [
      "Yazar, not alma, günlük tutma ve içgörüleri bağlama için Obsidian kullanıyor, notların geleceğe yönelik korunması için açık dosya formatı ve Markdown desteğini vurguluyor.",
      "Dataview, Excalibrain, Obsidian Admonition ve Templater gibi önemli eklentiler, iş akışlarının işlevselliğini ve entegrasyonunu artırır.",
      "Notları Quartz aracılığıyla herkese açık olarak paylaşmak, değerli geri bildirimler ve bağlantılar sağlar, sürekli öğrenme ve gelişime katkıda bulunur."
    ],
    "commentSummary": [
      "Bu tartışma, özellikleri ve kullanıcı deneyimlerini vurgulayarak not alma uygulaması Obsidian etrafında dönüyor.",
      "Kullanıcılar, Obsidian'ı esnekliği, Markdown dosyalarını kullanması ve sağlam eklenti ekosistemi nedeniyle övüyor ve onu Emacs ve Notion gibi diğer araçlarla karşılaştırarak olumlu bir şekilde değerlendiriyor.",
      "Bazı kullanıcılar, yavaş iCloud senkronizasyonu ve Git tabanlı senkronizasyon eklentilerinin kullanılabilirliği gibi senkronizasyon çözümleri ve potansiyel sorunlardan bahsediyor."
    ],
    "points": 86,
    "commentCount": 62,
    "retryCount": 0,
    "time": 1722172476
  },
  {
    "id": 41091163,
    "title": "StreamPot: fluent-FFmpeg uyumluluğu, kuyruklar ve S3 ile bir API olarak FFmpeg çalıştırın",
    "originLink": "https://github.com/StreamPot/StreamPot",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41091163",
    "commentBody": "",
    "originSummary": [
      "StreamPot, geliştiriciler için kurulum gerektirmeyen bir çözüm sunarak videoları kırpma, sesleri çıkarma ve kod dönüştürme gibi medya dönüştürme görevleri için tasarlanmış erken aşama bir araçtır.",
      "Kullanıcılar, kurulum talimatlarını izleyerek sunucuyu kendileri barındırabilir veya denemek için barındırılan sürüme kaydolabilirler.",
      "Proje, ffmpeg ve fluent-ffmpeg ekiplerinin çalışmalarından yararlanmaktadır ve geri bildirimler e-posta veya planlanmış görüşmeler yoluyla sağlanabilir."
    ],
    "commentSummary": [
      "StreamPot, FFmpeg'i API olarak çalıştırmaya, fluent-FFmpeg uyumluluğuna, iş kuyruklarına ve S3 entegrasyonuna olanak tanır.",
      "Kullanıcılar, async işlemler için kolaylık yöntemleri eklemek ve eventsource veya Sunucu Tarafından Gönderilen Olaylar (SSE) aracılığıyla sinyal verme gibi iyileştirmeleri tartışıyor.",
      "Yazılımcılar, belgeleri güncellemeyi ve daha iyi verimlilik için `runAndWait` ve uzun yoklama gibi özellikler eklemeyi düşünüyorlar."
    ],
    "points": 84,
    "commentCount": 3,
    "retryCount": 0,
    "time": 1722139744
  },
  {
    "id": 41093916,
    "title": "Eşzamanlı çoklu iş parçacığı nasıl çalışır?",
    "originLink": "https://blog.codingconfessions.com/p/simultaneous-multithreading",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41093916",
    "commentBody": "",
    "originSummary": [
      "Eşzamanlı Çoklu İş Parçacığı (SMT), bir CPU'nun iki iş parçacığından gelen talimatları aynı anda işlemesine olanak tanır, kaynak kullanımını iyileştirir ancak tek iş parçacığı performansını potansiyel olarak azaltabilir.",
      "Intel'in hiper iş parçacığı, bir tür SMT'dir ve bir fiziksel işlemciyi işletim sistemine iki mantıksal işlemci olarak göstermek için işlemci mimarisi durumunu çoğaltır.",
      "SMT sistem verimliliğini artırabilse de, güvenlik açıkları ve önbellek çatışmaları yaratabilir, bu da uzmanların güvenlik açısından kritik sistemler için SMT'yi devre dışı bırakmayı önermesine yol açar."
    ],
    "commentSummary": [
      "Intel'in yakında çıkacak olan Arrow Lake işlemcileri, uygulamaya bağlı performans kazançları nedeniyle hiper iş parçacığını (Eşzamanlı Çoklu İş Parçacığı, SMT) ortadan kaldıracak.",
      "CPU tasarımını basitleştirme hamlesi faydalı olabilir, özellikle Intel'in P/E (Performans/Verimlilik) çekirdekleri tek veya düşük iş parçacıklı iş yükleri için bir alternatif sunduğunda.",
      "SMT'nin önemi hakkındaki tartışma devam ediyor, AMD homojen çekirdekler ve SMT kullanımını sürdürürken, Intel farklı stratejiler araştırıyor."
    ],
    "points": 80,
    "commentCount": 14,
    "retryCount": 0,
    "time": 1722180914
  },
  {
    "id": 41090459,
    "title": "Elon Musk, X'in politikalarını ihlal eder gibi görünen manipüle edilmiş bir Harris videosu paylaştı",
    "originLink": "https://www.nytimes.com/2024/07/27/us/politics/elon-musk-kamala-harris-deepfake.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41090459",
    "commentBody": "",
    "originSummary": [
      "Elon Musk, X'in yanıltıcı medya politikalarını ihlal ediyor gibi görünen, dijital olarak değiştirilmiş bir Başkan Yardımcısı Kamala Harris kampanya videosunu yeniden paylaştı.",
      "Manipüle edilmiş video, 98 milyon kez izlendi, bir uyarı içermiyordu ve yanıltıcı içerik barındırıyordu, bu da deepfake'lerin demokrasiye tehdit oluşturduğu konusunda endişeleri artırdı.",
      "Eleştirmenler ve Harris kampanyası, videoyu kınayarak X'in politikalarının uygulanmasındaki tutarsızlığı Meta ve Google gibi diğer platformlarla karşılaştırarak vurguladı."
    ],
    "commentSummary": [
      "Elon Musk, Kamala Harris'in manipüle edilmiş bir videosunu paylaştı, bu da X'in politikalarını potansiyel olarak ihlal ederek daha sıkı yapay zeka düzenlemeleri üzerine tartışmaları ateşledi.",
      "Bu olay, deepfake'lerle mücadele etmek için içerik doğrulaması amacıyla Keyoxide kullanılması önerilerine yol açtı.",
      "Kullanıcılar, Twitter'ın düşüşü, artan bot etkinliği ve sağcı içerikleri tercih eden algoritma değişiklikleri nedeniyle hayal kırıklığına uğruyor, bu da platformun kullanılabilirliği ve içerik politikaları hakkında endişeleri artırıyor."
    ],
    "points": 77,
    "commentCount": 19,
    "retryCount": 0,
    "time": 1722127941
  }
]
