[
  {
    "title": "Stocks Wobble but Head for Weekly Win Amid Economic Concerns and Retail Updates",
    "originLink": "https://finance.yahoo.com/news/stock-market-news-today-stocks-wobble-but-still-head-for-a-weekly-win-113959921.html",
    "originBody": "Yahoo Finance Stock market news today: Stocks close little changed to notch weekly win Read full article 258 Hamza Shaban and Karen Friar Fri, November 17, 2023 at 2:06 PM MST·1 min read Stocks eked out a victory Friday as the major indexes recorded their third-straight win for the week as Wall Street digested retail updates and oil's losses amid signals of a slowing economy. The S&P 500 (^GSPC) edged higher by 0.13%, while the Dow Jones Industrial Average (^DJI) finished just above the flatline. The tech-heavy Nasdaq Composite (^IXIC) rose by about 0.08%. All three US indexes carried momentum from a roaring midweek rally, which came as the market grew convinced the Federal Reserve could ease back on interest rate hikes. Cooler inflation and softer jobs data were taken as signs the central bank's tightening is finally squeezing the US economy. Some investors see similar signals in retailer updates. Gap (GPS) gave a bleak forecast for holiday sales in its earnings late Thursday, joining Walmart and Target in warning that a falloff in consumer spending will hit the all-important shopping season. Oil prices also hinted at a slowdown by sinking into a bear market ahead of the OPEC+ meeting later in November. West Texas Intermediate crude (CL=F) and Brent crude (BZ=F) advanced nearly 4% on Friday, but lost for the overall week loss after touching their lowest level in nearly four months. Meanwhile, Alibaba's (BABA) decision to abandon the spin-off of its cloud unit drew attention to struggles at the Chinese e-commerce giant, whose shares sank in New York to erase more than $20 billion in market value. The decision, which Alibaba said was fueled by Washington's chip curbs, also highlighted that US-China ties are still frayed after a meeting between the country's presidents failed to make a splash. Live coverage is over H 16 hours ago Hamza Shaban Stocks win for third-straight week Stocks just barely notched a win Friday after initially slipping earlier in the day. The major indexes recorded their third-straight win for the week. The S&P 500 (^GSPC) edged higher by 0.13%, while the Dow Jones Industrial Average (^DJI) finished just above the flatline. The tech-heavy Nasdaq Composite (^IXIC) rose by about 0.08%. H 16 hours ago Hamza Shaban A look at the week ahead Wall Street's AI darling Nvidia (NVDA) is among the major names to report earnings next week. The supplier of AI tech will offer investors fresh data on the state of the industry, steering the case for or against the much-hyped AI tech boom that has elevated many of Big Tech's largest players. Retail market observers will also get new information and forecasts from large chains including Lowe's (LOW), Dick's (DKS) and Best Buy (BBY). The trio follows a significant week of retail earnings where the major theme was a more discerning, weakened consumer. Investors will also get further insight into the thinking and deliberation of US central bankers with the release of the Fed's policy meeting minutes. The meeting summary will arrive about three weeks ahead of the next Federal Open Market Committee huddle, where investors and the broader public will learn if 2023 has seen the end of the Fed's rate hikes. Yahoo Finance's Brent Sanchez has a graphical breakdown of what to watch next week: H 17 hours ago Hamza Shaban Hopes of a 'soft landing' come with risks Hopes of a \"soft landing,\" in which the Fed is able to pull inflation back to its 2% target without triggering a recession are rekindling. But investors have reasons to worry, too, reports Yahoo Finance's Josh Schafer. The stock market appears to be increasingly pricing in the possibility of that the Fed will execute a \"soft landing.\" And unlike prior instances earlier this year, when optimists soured on the idea of a near-perfectly executed tightening cycle, there's been nearly a year's worth of data since then. What's more, there's growing consensus that inflation is cooling, that the jobs market is no longer running unsustainably hot, and that the Fed is done hiking interest rates. The question remains if those trends can continue. Goldman Sachs chief economist Jan Hatzius says they will, noting that the path of disinflation is set to continue and that consumer spending should hold up despite excess savings getting depleted. But there's still an argument that financial conditions could tighten significantly, as the Fed's \"higher for longer\" interest rate campaign is expected to slow business activity. That sluggishness could lead to job cuts, snowballing into industry-wide layoffs, eventually creating a vicious cycle that leads to a recession that many have been warning about. \"I don't think we should be celebrating accomplishing that soft landing until we actually see inflation back close to that 2% target, and the economy is still moving forward,\" EY chief economist Gregory Daco told Yahoo Finance in an interview on Thursday . \"That's really the open question for 2024.\" As long as that debate remains open, it will be a key question for investors in 2024, too. H 18 hours ago Hamza Shaban The Big Tech rally to come The tech-heavy Nasdaq Composite (^IXIC) is up roughly 10% so far this month, and some analysts believe there's still room to grow, heading into an end-of-year rally. As Wall Street embraces a newfound optimism that the Fed's hiking campaign has come to an end, bullish investors see tech titans like Apple (AAPL), Microsoft (MSFT) and Google (GOOG, GOOGL) leading portfolios higher. \"Heading into 2024 we believe the tech sector is set up for an acceleration of spending around cloud and AI spending that we believe is being significantly underestimated by the Street,\" said Dan Ives and several colleagues at Webush, in a research note Friday. Ives, along with his co-authors, nodded to the potential of what he describes as the transformational technology of AI, and points to the monetization that has already had an impact on stocks like Microsoft and Datadog (DDOG). \"We believe the new tech bull market has now begun and tech stocks are set up for a strong 2024 as the AI spending tidal wave hits the shores of the broader tech sector,\" the analysts said. Still, what others see as overstretched valuations and an AI hype-cycle that is bound to disappoint expectations are reasons to stay cautious. Nvidia's (NVDA) earnings next week will offer the latest set of data points for the case in favor of big tech and AI. H 19 hours ago Hamza Shaban Stocks trending in afternoon trading Here are some of the stocks leading Yahoo Finance’s trending tickers page during afternoon trading on Friday: ChargePoint (CHPT): The EV charging company fell by more than 30% on Friday after it released preliminary third quarter results showing revenue will fall as low as $108 million, well below the expected lower range of $150 million. In addition, the company announced its CEO and CFO were exiting. COO Rick WIlmer will become the new CEO while the company searches for a permanent CFO. Ross (ROST): Shares rose nearly 8% Friday afternoon after the discount retailer posted better than expected quarterly results and raised its outlook as consumers looked to navigate high inflation by hunting for bargains. Gap (GPS): The clothing retailer surged 30% after the retailer reported third quarter earnings that blew away expectations. The strong market reaction comes after a big week of earnings from major retailers including Target (TGT), Walmart (WMT), and Home Depot (HD), which also beat expectations but offered cautious outlooks. BJ's Wholesale Club (BJ): The warehouse club chain sank 3% Friday after reporting weaker than expected quarterly sales and, like many other retailers, forecast slower holiday season traffic. H 20 hours ago Hamza Shaban Stocks slip in afternoon trading Stocks wavered in afternoon trading on Friday, with all the major indexes slipping under the flat line, while still clinging to overall gains for the week. The S&P 500 (^GSPC) edged lower by about 0.03%, while the Dow Jones Industrial Average (^DJI) fell by .05% or roughly 20 points. The tech-heavy Nasdaq Composite (^IXIC) fell by 0.1%. H 20 hours ago Hamza Shaban Resilience gives way to more discerning consumers Consumers stayed strong after quarter upon quarter of inflation. But finally, the steadfast swipe-the-card resilience is giving way to discretion. These days, shoppers at big box retailers are moderating their spending, becoming more selective, avoiding big-ticket items, and delaying purchases. In earnings calls this week, executives sketched portraits of a more discerning American consumer, worn down by higher costs and coping with the anxieties of mounting credit card debt and dwindling savings. Major retailers including Target (TGT), Walmart (WMT), and Home Depot (HD), beat expectations but offered cautious outlooks for the months ahead, as consumers moderate pull back. Retail sales fell 0.1% in October from the prior month, according to new data from the Commerce Department, notching the first monthly decline since March. \"While it is somewhat encouraging to see that spending did not fall off a cliff in October, the pause is likely a sign of further weakness to come,” said Thomas Simons, an economist at Jefferies, in a research note after the retail sales report. A weakened consumer can still be strong enough for corporate earnings, especially if companies can beat lowered expectations. But selective shopping and budget stretching can only take the economy so far. H 21 hours ago Hamza Shaban Business leaders applaud stopgap spending law President Joe Biden has signed into law a temporary \"two-step\" solution to Washington’s spending fights and will give Congress and the country a temporary reprieve from shutdown fights at least for the holiday season. The business community breathed a sigh of relief that a stoppage, and the economic effects that would have come with it, was averted, reports Yahoo Finance's Ben Werschkul. Business Roundtable CEO Joshua Bolten offered thanks in a statement to “members of Congress for working together,” while adding that he hoped the cooperation could be repeated next year when the spending debates resume. The 32-page law sidestepped yet another self-inflicted Washington crisis and averted a government shutdown that, among many other impacts, had threatened to cut off the paychecks of TSA workers just ahead of the busy Thanksgiving travel week. The deal's two steps include funds for some areas of the federal government — places like the Agriculture and Transportation departments — until Jan. 19, 2024. Authorization for the remainder of Washington's bureaucracy is set to expire just two weeks later on Feb. 2. H yesterday Hamza Shaban Stocks trending in morning trading Here are some of the stocks leading Yahoo Finance’s trending tickers page during morning trading on Friday: Applied Materials (AMAT): Shares of one of the largest chipmakers in the US fell more than 4% following a report that the company faces a criminal probe for allegedly violating export restrictions to China. The Justice Department will investigate the company's dealings with China’s biggest chipmaker Semiconductor Manufacturing International Corp. (0981.HK), looking at whether Applied Materials sold hundreds of millions of dollars of equipment without the proper licenses. Gap (GPS): The clothing retailer surged nearly 30% Friday morning after the retailer reported third quarter earnings that blew away expectations. The strong market reaction comes after a big week of earnings from major retailers including Target (TGT), Walmart (WMT), and Home Depot (HD), which also beat expectations but offered cautious outlooks. BJ's Wholesale Club (BJ): The warehouse club chain sank 3% Friday after reporting weaker than expected quarterly sales and, like other retailers, forecast slower holiday season traffic. Alibaba (BABA): Shares slid nearly 3% after the company's listing in Hong Kong saw $20 billion of its market cap evaporate following a decision to no longer spin off its cloud computing business. H yesterday Hamza Shaban Stocks head for weekly win after mixed open Stocks were little changed at the start of the trading session Friday, setting Wall Street up for a weekly win, even as the indexes were dipping slightly into the red. The S&P 500 (^GSPC) edged lower by about 0.04%, while the Dow Jones Industrial Average (^DJI) was just over the flatline. The tech-heavy Nasdaq Composite (^IXIC) fell by 0.1%. Show more Related Quotes Symbol Last Price Change % Change ^DJI Dow Jones Industrial Average34,947.28 +1.81 +0.01% ^GSPC S&P 5004,514.02 +5.78 +0.13% ^IXIC NASDAQ Composite14,125.48 +11.81 +0.08% TRENDING 1. Here's why Americans with $1 million don't think they’re wealthy 2. UPDATE 1-Russia places former central banker Aleksashenko on wanted list - state news agencies 3. Israel Latest: EU Staff Family Members Starting to Leave Gaza 4. Russia says it heavily bombed Ukrainian forces around the River Dnipro 5. Nvidia earnings: What one analyst is concerned about",
    "originSummary": [
      "Stock market closed with little change on Friday, but still achieved a weekly win.",
      "Nasdaq Composite saw a slight increase, while S&P 500 and Dow Jones Industrial Average barely moved.",
      "Market reacted to retail updates, concerns about a slowing economy, and struggles at Alibaba."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700312875276
  },
  {
    "title": "Temu under scrutiny: Weapons and age-restricted items sold without verification",
    "originLink": "https://www.standard.co.uk/news/tech/temu-chinese-bargain-shopping-app-ecommerce-b1082134.html",
    "originBody": "NEWSTECH Who owns Temu? Weapons banned in UK apparently found on shopping app The Chinese e-commerce site has come under pressure to enhance its verification procedure, get rid of hazardous products, and make independent sellers accountable when security breaches are discovered TEMU IS THE NUMBER ONE FREE APP IN APPLE’S APP STORE FLORENCE LO / TEMU / REUTERS SEREN MORRIS|TAMARA DAVISON 1 DAY AGO An investigation by Which? has discovered that knives and axes that ought to be age-restricted, along with what appear to be illegal weapons, are being sold on the Chinese internet marketplace Temu. The UK consumer advocate claims to have seen listings on the website for folding knives and batons that looked like things that were illegal in the country. According to its analysts, they were also able to purchase age-restricted goods like axes and knives without having their age verified. A few items were quite inexpensive, with prices as low as £4.48. Which? demands that Temu enhance its verification procedure, get rid of hazardous products, and make independent sellers accountable when security flaws are discovered. Meanwhile, the Chinese shopping app has been on the rise after being launched in the UK in April, keeping its grip on the number-one spot among shopping apps downloaded in the UK in the past six months. Some reports suggest that the discount e-commerce site's growth could even crack Amazon's dominance in the online retail space. However, the platform's growth hasn't been without controversy. Temu is currently embroiled in a US-based legal battle with its rival Shein. What's more, the US government said that there is an “extremely high risk” that products sold on Chinese bargain shopping site Temu were produced using forced labour. With items costing just pennies, sceptical customers are wondering: is Temu too good to be true? What is the Temu app? Temu is a Chinese ultra-low-cost shopping app that launched in the US last September and has expanded into the UK. It has been compared to other discount e-commerce sites, like AliExpress and Wish, which also sell a wide range of items at incredibly low prices. The platform sells a range of products directly from Chinese sellers, such as clothing, jewellery, beauty products, and homeware, at ultra-low prices. Temu’s prices are made even lower with its “lightning deals” and various sales, including deals promising up to 99 per cent off. For example, at the time of writing, Temu’s “lightning deals” included a ring for 77p and a bracelet for 89p. According to a report by the US-China Economic and Security Review Commission (USCC), Temu placed more than 8,000 ads across Meta platforms in 2023, and spent around $14 million (£11.2 m) on two adverts during the Super Bowl. The app also relies on influencer marketing, rewarding its affiliates with shopping perks and rewards, and encourages users to share the app with friends for deals in return. TEMU SELLS A WIDE RANGE OF PRODUCTS AT ULTRA-LOW PRICES FLORENCE LO / TEMU / REUTERS Where is Temu available? Temu was previously only available in the US, Canada, Australia, and New Zealand. As of April 2023, Temu also became available in the UK as well as a number of other European countries, including France, Spain, Germany, Italy, and the Netherlands, as reported by Reuters. It then entered the market in Japan and South Korea. At the start of September, Temu also rolled out in the Phillippines, marking the app's wider expansion in Southeast Asia. Mobile intelligence firm Sensor Tower reported that Temu was downloaded 19 million times in the first quarter of 2022, and was the most downloaded app on the Apple and Google Play stores in the US. Who owns Temu? Temu says it's headquartered in Boston. It's actually owned by the multinational commerce group PDD Holdings, which was founded by Chinese billionaire Colin Huang. It’s the sister site of the Chinese e-commerce platform Pinduoduo, which was valued at $200 billion(£160 bn) in 2021, according to the Financial Times. In March 2021, Huang stepped down from his executive roles at Pinduoduo and turned over the voting rights for his 29 per cent stake in the company. In 2020, Huang was briefly ranked the second-richest person in China thanks to a surge in sales at Pinduoduo, as reported by the BBC. Why is the US government concerned about Temu? The US government published a report over the summer saying there is an “extremely high risk” that Temu uses an online shipping loophole to avoid requirements of forced labour screenings. The report, published by the US Select Committee on the Chinese Communist Party (USCC), raises “serious concerns about the continued presence of products made with forced labour contaminating American imports”. “Temu does not have any system to ensure compliance with the Uyghur Forced Labor Prevention Act (UFLPA). This all but guarantees that shipments from Temu containing products made with forced labor are entering the United States on a regular basis,” it continued. The claims are part of an ongoing investigation into compliance with a 2021 US law that bars the import of goods made using forced Uyghur labour. Nike, Adidas and Chinese ultra-fast fashion brand Shein are also being investigated. The US government also accused Temu, alongside Shein, of “data risks, sourcing violations, and trade loopholes,” in a report published by the USCC in April. The report also raises concerns about quality and copyright: “Like Shein, Temu’s success raises flags about its business practices.” Temu has 3.3 stars on Trustpilot, with 33 per cent of reviews rating the platform one star. Negative reviews complain about the quality of the products and the number of notifications the app sends. The USCC report also says that PDD Holdings has been accused by China’s Labour Watch of forcing employees to work “extreme overtime”, and that CNN reported that sophisticated malware was found on the Pinduoduo sister app (though Temu itself was not implicated in either accusation). A report by CNN Business also raised concerns about Temu’s sustainability, with the company telling CNN that it offsets emissions for every order with “carbon credits which support wildlife conservation efforts” in the US. MORE ABOUT E-COMMERCE APP CHINESE JEWELLERY HOMEWARE Have your say... VIEW COMMENTS MOST READ 1 LIFESTYLE Six of the most disturbing claims brought against P Diddy 2 TVFILM Doctor Who Children in Need 2023: How to watch and what to expect 3 FORMULA ONE F1 Las Vegas Grand Prix 2023: Start time UK, full schedule, weather and how to watch on TV 4 FOOTBALL England ratings vs Malta: Trent Alexander-Arnold stakes claim on poor night for Jordan Henderson Voucher Codes £50 off 2024 bookings over £800 with this TUI discount code 15% off all orders over £100 using this ASOS discount code 5% off all bookings with this Travelodge discount code 20% off everything with The Body Shop discount code 15% of all orders with The Perfume Shop birthday discount",
    "originSummary": [
      "Chinese e-commerce site Temu is selling weapons and age-restricted items without proper verification, according to an investigation by Which?",
      "UK consumer advocate, Which?, has called for Temu to improve its verification process and remove hazardous products.",
      "Despite controversy, Temu has become the top shopping app in the UK, challenging Amazon's dominance."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700312875276
  },
  {
    "title": "Children able to buy illegal weapons on popular marketplace app Temu, investigation finds",
    "originLink": "https://news.stv.tv/world/children-able-to-buy-illegal-weapons-on-temu-app-which-says",
    "originBody": "News / UK & International Children able to buy illegal weapons on Temu app, Which? says Weapons such as knives and axes are being sold on Chinese market place app Temu, without age checks taking place, a consumer group has found. Weapons are being sold on shopping app Temu with no age checks, according to consumer group Which? / Which?/Temu ITV News 24 hours ago Share this story Facebook X / Twitter Copy Link Posted in Business Weapons such as knives and axes are being sold on Chinese marketplace app Temu, without age checks taking place, a consumer group has found. Illegal weapons such as knives disguised as keyrings, folding knives and batons were also discovered in an investigation by Which?. The consumer group found some weapons were being sold for as little as £4.48. Researchers believe the lack of controls to prevent those who are underage purchasing age-restricted and even illegal items are even more concerning given how widely advertised the marketplace is on social media. The consumer group found a number of items, including keyring knives, were available on Temu. / Credit: Which? Ad In total, the investigation identified six weapons they believed to be illegal and were able to purchase seven age-restricted products, two axes and five knives, without age checks. One of the axes Which? was able to purchase arrived with a physical label on it saying it was a ‘knife for preparing vegetables’, despite it clearly being an axe. They also said they saw dozens of listed items that could potentially cause harm. What is Temu? Temu was only launched in September 2022, but it has quickly become one of the most popular online marketplaces in the UK and beyond. It recorded close to 38.8 million downloads worldwide in August 2023, and was the most downloaded app in the UK for the year to August. Which? is now calling for Temu to carry out better checks and monitoring, and remove dangerous items on its site to stop them ending up in the hands of consumers, particularly those under 18. Ad Anyone caught with some of the items could face arrest and a prison sentence. Government guidance on the law states it is ‘an offence for any person to manufacture, sell or hire, offer for sale or hire, expose or have in his possession for the purpose of sale or hire’ any banned weapon. The weapons Which? were able to uncover only demonstrate a snapshot of the scale of the issue of illegal items for sale on Temu. The six ‘age-restricted’ products had been sold over 21,000 times between them. Alongside illegal items, Which? were able to find a number of age-restricted weapons that could be purchased without proof of age. / Credit: Which? Sue Davies, Which? Head of Consumer Protection Policy, said: “Temu has had a surge in popularity in the last 12 months but our research shows that it appears to be allowing illegal weapons, including folding knives and batons, and age-restricted products to be made easily available to shoppers using its platform. “Problems with dangerous products are only going to get worse if new tech giants like Temu continue to be held to weaker standards than high-street retailers. “The online marketplace needs to improve its checks, monitoring and takedown processes, and ensure third-party sellers cannot list these dangerous items – particularly to young people under the age of 18.” Ad A Temu spokesperson said: “Temu is committed to complying fully with relevant rules and regulations in all of the markets that we operate in, and we take all reports of violations very seriously. “After receiving a complaint of a person under 18 purchasing a bladed article from our platform, we immediately removed all related product listings. We also initiated a comprehensive investigation and review of our processes to further strengthen our safeguards and prevent similar cases from occurring again.” STV News is now on WhatsApp Get all the latest news from around the country Follow STV News Follow STV News on WhatsApp Scan the QR code on your mobile device for all the latest news from around the country Posted in Business",
    "originSummary": [
      "Consumer group Which? has discovered that illegal weapons, including knives and axes, are being sold on the Chinese marketplace app Temu without any age verification in place.",
      "The investigation also uncovered that weapons disguised as keyrings and batons are available on the app, with prices starting as low as £4.48.",
      "With almost 38.8 million downloads globally in August 2023, Temu is now being urged by Which? to implement stricter checks and monitoring to ensure the safety of consumers, especially those under the age of 18."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700312875276
  }
]
