[
  {
    "id": 40104774,
    "title": "Weltkarte mit geringer Bandbreite für Leaflet: 10.000 bevölkerungsreiche Städte",
    "originLink": "https://github.com/tinyworldmap/tiny-world-map",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40104774",
    "commentBody": "",
    "originSummary": [
      "Tinyworldmap ist eine Offline-Weltkarte mit geringer Bandbreite, die mit Leaflet kompatibel ist und die 10.000 bevölkerungsreichsten Städte aus OpenStreetMap in allen Zoomstufen zeigt.",
      "Sie wurde für einfache Mobiltelefone entwickelt und bietet Anpassungsmöglichkeiten, kleinere Versionen ohne Grenzen oder Stadtbeschriftungen und kann als Basiskarte oder Offline-Backup dienen.",
      "Nutzer können personalisierte Karten oder Hilfe bei der Integration von Offline-Funktionen suchen, wobei die korrekte Nennung von OpenStreetMap und tinyworldmap bei der Nutzung der Karte obligatorisch ist."
    ],
    "commentSummary": [
      "Das Projekt Tiny World Map auf Github konzentriert sich auf die Verbesserung der Ladegeschwindigkeit von Karten, indem es detaillierte Küstenlinien und besiedelte Gebiete für die Nutzer hervorhebt.",
      "Die Nutzer schlagen vor, die Details von Inseln, Seen und Flüssen zu verbessern, die Genauigkeit von Städten und Küstenlinien zu erhöhen und Diskussionen über geopolitische Feinheiten und die Optimierung von Karten für verschiedene Geräte zu führen.",
      "Das Projekt greift aktiv auf das Feedback und die Vorschläge der Nutzer zurück, um die Weltkarte noch detaillierter und genauer zu gestalten."
    ],
    "points": 437,
    "commentCount": 82,
    "retryCount": 0,
    "time": 1713698473
  },
  {
    "id": 40105773,
    "title": "Karrierewechsel: Lkw-Fahrer wird mit 38 Jahren zum Ruby on Rails-Entwickler",
    "originLink": "https://www.writesoftwarewell.com/lorry-driver-to-rails-developer-at-38/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40105773",
    "commentBody": "",
    "originSummary": [
      "Pedro David Garcia Lopez wurde mit 38 Jahren vom LKW-Fahrer zum Ruby on Rails-Entwickler und zeigt damit, dass es nie zu spät ist, seinen Träumen zu folgen.",
      "Er betont die Bedeutung von Leidenschaft, Mentorenschaft und der Beherrschung von Ruby und Rails und unterstreicht die Notwendigkeit des kontinuierlichen Lernens beim Programmieren.",
      "Der Blog enthält ein Interview mit Miles Woodroffe, dem ehemaligen Global CTO von Cookpad, das von Akshay Khot geführt wurde, und wirbt für Feedback und Abonnements für kommende Artikel zur Ruby-Softwareentwicklung."
    ],
    "commentSummary": [
      "Die Diskussion befasst sich mit verschiedenen Themen wie Karriereübergängen, Gehaltsunterschieden zwischen Entwicklern und Arbeitern, dem Mangel an LKW-Fahrern im Vereinigten Königreich, den Gehältern von leitenden Entwicklern in der EU und dem Einfluss der Gewerkschaften auf die Vergütung.",
      "Außerdem werden die Unterschiede zwischen den Lebenshaltungskosten in den einzelnen Ländern, die technischen Gehälter in den USA und Europa sowie die Vor- und Nachteile der verschiedenen Berufe untersucht. Außerdem geht es um den Komfort und die körperlichen Auswirkungen des Fahrens im Vergleich zur Arbeit am Schreibtisch sowie um den anhaltenden Fahrermangel im Vereinigten Königreich.",
      "Außerdem werden Einblicke in Programmiersprachen, funktionale Programmierung, Ruby on Rails-Entwicklung, Einstellungsnormen und altersbedingte Vorurteile im Technologiesektor vermittelt."
    ],
    "points": 265,
    "commentCount": 172,
    "retryCount": 0,
    "time": 1713707299
  },
  {
    "id": 40105121,
    "title": "Auf der Suche nach sinnvoller Innovation: Die Frustrationen der Programmindustrie überwinden",
    "originLink": "https://www.deathbyabstraction.com/I-love-programming-but-I-hate-the-programming-industry",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40105121",
    "commentBody": "",
    "originSummary": [
      "Der Autor beklagt, dass in der Programmierbranche der Schwerpunkt auf dem Programmieren liegt und nicht auf kritischem Denken und sinnvoller Arbeit in der Softwareentwicklung.",
      "kritisiert die Bevorzugung von Trends gegenüber echter Innovation in der Technik und betont die Notwendigkeit eines zielgerichteteren Ansatzes.",
      "Äußert den Wunsch, mit Gleichgesinnten zusammenzuarbeiten, um gesellschaftliche Bedürfnisse und Werte anzusprechen, und strebt eine wirkungsvollere Programmperspektive an."
    ],
    "commentSummary": [
      "Die Diskussion auf deathbyabstraction.com befasst sich mit den Herausforderungen, mit denen Programmierer in der Unternehmenswelt konfrontiert sind, wenn es darum geht, den Spagat zwischen der Geschwindigkeit der Funktionsbereitstellung und der Codequalität und -verarbeitung zu schaffen.",
      "Er untersucht Programmierpraktiken, Work-Life-Balance und persönliche Erfüllung in der Softwarebranche und betont die Bedeutung einer sinnvollen Arbeit und die Übereinstimmung von persönlichen Werten mit den Unternehmenszielen.",
      "Das Gespräch befasst sich auch mit den Auswirkungen des Branchenwachstums auf die Software-Praktiken und setzt sich für eine Arbeit ein, die den gesellschaftlichen Bedürfnissen entspricht und einen echten Mehrwert bietet, und zeigt die Kompromisse auf, die bei der Verfolgung einer lohnenden Programmierkarriere eingegangen werden müssen."
    ],
    "points": 258,
    "commentCount": 187,
    "retryCount": 0,
    "time": 1713702020
  },
  {
    "id": 40106336,
    "title": "Fritz!Box-Modems gekapert, was DNS-Probleme verursacht",
    "originLink": "https://crapts.org/2024/04/21/all-fritz-box-modems-have-been-hijacked/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40106336",
    "commentBody": "",
    "originSummary": [
      "Bestimmte Fritz!Box-Modems werden gekapert und verursachen DNS-Probleme für Benutzer mit benutzerdefinierten DNS-Diensten wie Pihole oder Adguard, was zu Sicherheitslücken führen kann, insbesondere für Windows-Benutzer.",
      "Der unbekannte Besitzer der fritz.box-Domain gibt Anlass zur Sorge über Datenschutz und Phishing-Risiken. Die Reaktion von AVM auf das Problem ist spärlich und bietet keinen klaren Zeitplan für eine Lösung.",
      "Um das Problem zu beheben, wird den Benutzern empfohlen, das DNS-Suffix zu deaktivieren oder andere Schutzmaßnahmen zu ergreifen, um die damit verbundenen Risiken zu verringern."
    ],
    "commentSummary": [
      "Fritz!Box-Modems werden auf potenzielle Sicherheitsrisiken im Zusammenhang mit dem Hijacking von Domain-Namen unter Verwendung der Top-Level-Domain (TLD) \".box\" untersucht, wobei der Schwerpunkt auf DNS-Auflösungen, Suffixen und der Domain-Kontrolle durch Benutzer liegt.",
      "Es wird empfohlen, Open-Source-Firmware und benutzerdefinierte DNS-Server zu verwenden und bei der Konfiguration von Domänen vorsichtig zu sein, um diese Risiken zu verringern.",
      "Der Diskurs befasst sich mit DNS-Schwachstellen, deutschen ISP-Richtlinien und dem Trend zu herstellerverwaltetem DNS. Dabei werden Anekdoten über Linux-Router und maßgeschneiderte Netzwerkarrangements ausgetauscht und die Bedeutung robuster Sicherheitspraktiken bei Router-Setups betont."
    ],
    "points": 232,
    "commentCount": 124,
    "retryCount": 0,
    "time": 1713712125
  },
  {
    "id": 40107007,
    "title": "Penzai: Visualisierung und Manipulation neuronaler Netze mit JAX Toolkit",
    "originLink": "https://github.com/google-deepmind/penzai",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40107007",
    "commentBody": "",
    "originSummary": [
      "Penzai ist eine JAX-Bibliothek, die von der alten chinesischen Kunst der Miniaturbäume inspiriert ist und für die Erstellung und Verwaltung funktionaler pytree-Datenstrukturen in neuronalen Netzen konzipiert wurde.",
      "Es bietet Werkzeuge zur Visualisierung, Modifikation und Analyse von Modellen, die Aufgaben wie Debugging und Reverse-Engineering erfüllen.",
      "Benutzer sollten JAX und anschließend Penzai installieren und für die interaktive Verwendung in Colab- oder IPython-Notebooks konfigurieren, um neuronale Netze zu initialisieren, Aktivierungen zu erfassen und auf Tutorials für die Modellbildung zuzugreifen."
    ],
    "commentSummary": [
      "Penzai auf Github zielt darauf ab, die Entwicklung neuronaler Netze mit JAX zu rationalisieren und die Herausforderungen der Fragmentierung und Interoperabilität im Ökosystem zu bewältigen.",
      "Das Toolkit führt eine universelle pytree-Bibliothek für ML-Module ein, vergleicht Kompromisse zwischen Jax und PyTorch und betont dabei die Kompatibilität mit Equinox und Diffrax.",
      "Diskutiert werden u. a. die Erweiterung von Huawei MindSpore, die Erfolgsfaktoren, die akademische Nutzung von Jax für die Übersetzung von Mathematik in Code sowie Vergleiche zwischen den Fähigkeiten von PyTorch und Jax und den Präferenzen der Nutzer."
    ],
    "points": 221,
    "commentCount": 44,
    "retryCount": 0,
    "time": 1713716929
  },
  {
    "id": 40104641,
    "title": "YouTube-Videos in Schritt-für-Schritt-Anleitungen umwandeln",
    "originLink": "https://stepify.tech/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40104641",
    "commentBody": "",
    "originSummary": [
      "Ein neues Tool generiert Schritt-für-Schritt-Anleitungen für YouTube-Videos, die sich in erster Linie auf Tutorial-Inhalte konzentrieren, aber auch an andere Arten von Videos angepasst werden können, ohne dass KI zum Einsatz kommt, sondern ausschließlich auf Transkripte angewiesen ist.",
      "Der Ersteller freut sich über Rückmeldungen, Vorschläge und Fehlerberichte. Dies ist sein erstes Projekt als aufstrebender Ersteller, der über die Beschränkungen des Tutorials hinausgehen möchte.",
      "Das Tool zielt darauf ab, den Zuschauern zu helfen, den Videos effizient zu folgen und die Bedürfnisse der Ersteller zu erfüllen, wenn sie sich aus der Abhängigkeit von Tutorials lösen."
    ],
    "commentSummary": [
      "Ein Nutzer namens aka_sh entwickelte stepify.tech, eine Plattform, die YouTube-Videos in Schritt-für-Schritt-Anleitungen umwandelt, und suchte nach Anregungen für eine mögliche Vermarktung des Projekts.",
      "Diskutiert werden der Einsatz von Whisper für eine effizientere Transkription, die Vorliebe der Nutzer für schriftliche Leitlinien, Fragen der Genauigkeit von KI-generierten Inhalten und die Verbesserung der Nutzererfahrung.",
      "Zu den Gesprächen gehören auch die Nutzung von SOP-Aufzeichnungen mit ChatGPT zur Erstellung von Anleitungen, positives Feedback und Verbesserungsvorschläge."
    ],
    "points": 214,
    "commentCount": 62,
    "retryCount": 0,
    "time": 1713696745
  },
  {
    "id": 40106639,
    "title": "Ex-Beamter des Weißen Hauses: Microsofts Regierungskontrolle bedroht die nationale Sicherheit",
    "originLink": "https://www.theregister.com/2024/04/21/microsoft_national_security_risk/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40106639",
    "commentBody": "",
    "originSummary": [
      "AJ Grotto, ehemaliger Direktor für Cyberpolitik im Weißen Haus, warnt davor, dass Microsofts Monopol über die IT-Systeme der US-Regierung aufgrund der jüngsten Sicherheitsverletzungen ein nationales Sicherheitsrisiko darstellt.",
      "Grotto hebt den mangelnden Wettbewerb auf Regierungsebene als einen Faktor hervor, der zu Microsofts geringer Motivation zur Verbesserung der Systemsicherheit beiträgt.",
      "Grotto betont die Notwendigkeit von mehr Wettbewerb und öffentlicher Kontrolle und plädiert für eine verstärkte Kontrolle von Microsoft, um stärkere Sicherheitsprotokolle zu fördern."
    ],
    "commentSummary": [
      "Der Artikel erörtert die nationalen Sicherheitsbedenken im Zusammenhang mit der Abhängigkeit der Regierung von Microsoft, einschließlich Sicherheitsverletzungen und Verhandlungsproblemen.",
      "Es werden Probleme mit den staatlichen Cybersicherheitspraktiken, der Anwerbung von qualifiziertem Personal, ineffiziente Ausgaben und Beschränkungen bei der Bezahlung hervorgehoben.",
      "Es werden Vorschläge zur Verbesserung der Sicherheit, zur Bewertung technischer Lösungen und zur Umstellung auf Open-Source-Software bei Regierungsprojekten gemacht, um die Transparenz zu verbessern und die Sicherheitsrisiken bei kritischen Infrastrukturen und militärischen Systemen zu verringern."
    ],
    "points": 207,
    "commentCount": 202,
    "retryCount": 0,
    "time": 1713714250
  },
  {
    "id": 40106157,
    "title": "Entwicklung eines persönlichen Texteditors mit verbesserten Debugging- und LSP-Funktionen",
    "originLink": "https://bold-edit.com/wrote-my-own.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40106157",
    "commentBody": "",
    "originSummary": [
      "Nachdem der Autor beim Debuggen mit Fehlern und Leistungsproblemen in vscode konfrontiert wurde, entwickelte er seinen Texteditor mit Schwerpunkt auf besserer GDB-Unterstützung, schnellerem Rendering und DAP-Unterstützung.",
      "Der neue Editor bietet partielle Dateinamenssuche, Typensprung und Variablenumbenennung durch LSP-Implementierung, befindet sich aber noch in der frühen Entwicklungsphase, so dass einige Funktionen noch fehlen.",
      "Feedback zum neuen Editor ist erwünscht, da er sich ständig weiterentwickelt und verbessert."
    ],
    "commentSummary": [
      "Die Benutzer diskutieren über ihre Frustration mit Code-Editoren wie VSCode und betonen die Wichtigkeit von einwandfreier Funktionalität und Leistung.",
      "Verschiedene Editoren wie Vim, Neovim und Bold Edit werden im Hinblick auf ihre Fähigkeiten, Einschränkungen, Zugänglichkeitsfunktionen und Debugging-Werkzeuge verglichen.",
      "Zu den Themen gehören die Erstellung neuer Software, Sicherheits- und Zuverlässigkeitsaspekte und die Verwendung von Tools von Drittanbietern bei der Entwicklung, was ein umfassendes Gespräch über Codierungspraktiken und Tools widerspiegelt."
    ],
    "points": 198,
    "commentCount": 164,
    "retryCount": 0,
    "time": 1713710868
  },
  {
    "id": 40104823,
    "title": "Moderne Assembler navigieren: Top-Ressourcen für LLVM, JIT und x86-Grundlagen",
    "originLink": "https://news.ycombinator.com/item?id=40104823",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40104823",
    "commentBody": "",
    "originSummary": [
      "Ziel ist es, Assembler für die Arbeit mit LLVM und JIT zu erlernen, leistungsstarken Low-Level-Code zu schreiben und das Verständnis der x86-Grundlagen zu vertiefen.",
      "Sie sind auf der Suche nach Empfehlungen für Ressourcen und Bücher, um ihre Kenntnisse in Assembler aufzufrischen."
    ],
    "commentSummary": [
      "Das Erlernen moderner Assembler für LLVM und JIT umfasst Ressourcen wie Online-Spiele für ARM-Assembler, x86-Befehlssatzreferenzen und Compiler mit Inline-Assembler-Unterstützung.",
      "Der Schwerpunkt liegt auf der praktischen Anwendung, dem Verständnis von Codegenerierung, Optimierung und Intel-Prozessorarchitekturen.",
      "Die Ressourcen umfassen ARM-, RISC-V- und x86-Architekturen, Tools, Projekte, Bücher, Handbücher, IBM Z-Assembler und ELF-Dateien für vertieftes Lernen."
    ],
    "points": 195,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1713699020
  },
  {
    "id": 40104475,
    "title": "Dramatischer Klippensprung von Pinguinküken mit Drohne gefilmt",
    "originLink": "https://petapixel.com/2024/04/17/baby-penguins-jump-off-50-foot-cliff-in-first-of-its-kind-drone-footage/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40104475",
    "commentBody": "",
    "originSummary": [
      "Der Tierfotograf Bertie Gregory hat mit einer Drohne Hunderte von Kaiserpinguinküken gefilmt, die in der Antarktis von einer 50 Fuß hohen Klippe springen, um zum ersten Mal zu schwimmen - ein Verhalten, das man als Flüggewerden im Alter von etwa fünf Monaten bezeichnet.",
      "Die atemberaubenden Aufnahmen, die für einen kommenden Dokumentarfilm von National Geographic gedreht wurden, sind das erste Mal, dass ein so hoher Klippensprung aufgezeichnet wurde, ohne dass die Pinguine dabei gestört wurden.",
      "Dieses einzigartige Ereignis stellt einen bedeutenden Moment im Leben der Pinguine dar und wird in der kommenden Dokumentation zu sehen sein."
    ],
    "commentSummary": [
      "Eine Drohne nahm Pinguine auf, die von einer Klippe sprangen, und löste damit eine Debatte über die Authentizität des Geräuschs und die Verwendung von Geräuschkulissen in Naturdokumentationen aus.",
      "Die Diskussion befasst sich mit dem Überlebensmechanismus der Pinguine bei hohen Stürzen, der auf das Quadrat-Würfel-Gesetz zurückgeführt wird, was zu Debatten über die Bedeutung von Filmaufnahmen von Naturereignissen führt.",
      "Sie hebt auch die Verschmelzung von Natur, Wissenschaft und Technologie im künstlerischen Schaffen hervor und betont die Konvergenz dieser Bereiche zur Inspiration."
    ],
    "points": 192,
    "commentCount": 83,
    "retryCount": 0,
    "time": 1713694257
  },
  {
    "id": 40104492,
    "title": "Lunatik: Skripting des Linux-Kernels mit Lua",
    "originLink": "https://github.com/luainkernel/lunatik",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40104492",
    "commentBody": "",
    "originSummary": [
      "Lunatik ist ein Framework, das es ermöglicht, den Linux-Kernel mit Lua zu skripten. Es bietet einen angepassten Lua-Interpreter, einen Gerätetreiber, eine C-API für die Umgebungsverwaltung und Lua-APIs für die Anbindung an Kernel-Funktionen.",
      "Es unterstützt nicht alle Lua-Bibliotheken oder Bezeichner, und es hat die Standard-Lua-Funktionen geändert. Es bietet Funktionen für die Erstellung der Laufzeitumgebung, die Handhabung von Treibern, die Vernetzung, die Verwaltung von Fehlercodes, die Steuerung des Taskstatus und verschiedene Systemfunktionsbibliotheken.",
      "Das Framework enthält auch Beispiele für Kernel-Skripte zur Überwachung von Systemaufrufen, zur Entwicklung von Keyloggern, Netzwerk-Sniffern und Key-Value-Stores."
    ],
    "commentSummary": [
      "Lunatik ist ein Framework, das die Skripterstellung im Linux-Kernel mit Lua ermöglicht und Skripting-Funktionen für Netzwerke, CPU-Frequenzskalierung, Debugging und Anwendungs-Sandboxing bietet.",
      "Es stützt sich nicht auf eBPF, kann aber mit ihm zusammenarbeiten. Es wurde 2008 gestartet und ist von MS Singularity OS und MIT Exokernel inspiriert.",
      "Lua wurde für Lunatik aufgrund seiner Einfachheit bei der Erweiterung und Einbettung, seiner geringen Größe und seiner Funktionalitäten wie automatische Speicherverwaltung und isolierte Ausführungszustände ausgewählt."
    ],
    "points": 174,
    "commentCount": 30,
    "retryCount": 0,
    "time": 1713694482
  },
  {
    "id": 40111274,
    "title": "Enthüllung der Super Nintendo Cartridge-Technologie",
    "originLink": "https://fabiensanglard.net/snes_carts/index.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40111274",
    "commentBody": "",
    "originSummary": [
      "Die Website von Fabien Sanglard bietet detaillierte Einblicke in die Super Nintendo Cartridges und beleuchtet Komponenten wie den CIC-Chip, SRAM und die Erweiterungsprozessoren.",
      "Auf der Website wird erläutert, wie Erweiterungsprozessoren wie der SA-1-Chip SNES-Spiele beeinflusst haben, und es wird gezeigt, wie verschiedene Chips zur Verbesserung von Grafik und Gameplay eingesetzt wurden.",
      "Außerdem werden die einzigartigen Eigenschaften verschiedener Chips wie des DSP-Chips und des OBC-1-Chips behandelt und Projekte wie das Project Super FX erwähnt, wobei auch auf Emulationsschwierigkeiten und die Initiativen der Community zur Verbesserung der Retro-Spiele auf der Super Nintendo-Konsole eingegangen wird."
    ],
    "commentSummary": [
      "Der Artikel befasst sich mit Super Nintendo-Kassetten und beschreibt ihre Entwicklung, versteckte Funktionen und die Verwendung von IR-Kassetten in Spielen wie Pokemon Soulsilver.",
      "Es geht um die Leistungsfähigkeit von Spielekassetten, wenn sie an einen seriellen Anschluss angeschlossen sind, um die Dateigrößen von Klassikern wie Super Mario World, um kundenspezifische Hardware und um die Einschränkungen älterer Konsolen-CPUs.",
      "Außerdem werden die technischen Errungenschaften der Entwickler mit Farbkassetten für ältere Konsolen und die Optimierungs- und Komprimierungstechniken alter Videospielsysteme im Vergleich zu modernen Spielen vorgestellt."
    ],
    "points": 168,
    "commentCount": 33,
    "retryCount": 0,
    "time": 1713757908
  },
  {
    "id": 40107456,
    "title": "Simon Tatham's Puzzle-Sammlung: Plattformübergreifender Spielspaß",
    "originLink": "https://www.chiark.greenend.org.uk/~sgtatham/puzzles/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40107456",
    "commentBody": "",
    "originSummary": [
      "Simon Tathams Portable Puzzle Collection bietet Puzzlespiele für einen Spieler, die auf Unix, Windows und im Web über Java- oder Javascript-Applets gespielt werden können.",
      "Die Sammlung enthält Neuimplementierungen bekannter Spielkonzepte und kann als ausführbare Windows-Dateien heruntergeladen werden, mit Zugang zum Quellcode für die Kompilierung unter Unix mit GTK-Unterstützung.",
      "Benutzer können dem Entwickler Feedback und Fehlerberichte schicken, und es sind auch Versionen von Drittanbietern für verschiedene mobile Geräte verfügbar."
    ],
    "commentSummary": [
      "Die Benutzer diskutieren über Rätseloberflächen, Mechanismen, Lieblingsspiele und Erfahrungen, wobei sie mathematische Aspekte im Zusammenhang mit den ZFC-Axiomen ansprechen und Tipps zum schnellen Lösen von Rätseln austauschen.",
      "Einige Benutzer haben ihre eigenen Online-Puzzles entwickelt und suchen nach Vorschlägen für vergleichbare Spiele, während die Gespräche eine Reihe von Puzzle-Spielen auf verschiedenen Plattformen und Verbesserungsvorschläge für aktuelle Spiele umfassen."
    ],
    "points": 168,
    "commentCount": 44,
    "retryCount": 0,
    "time": 1713720332
  }
]
