[
  {
    "id": 41975047,
    "title": "우리는 Flutter를 포크하고 있습니다",
    "originLink": "https://flutterfoundation.dev/blog/posts/we-are-forking-flutter-this-is-why/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41975047",
    "commentBody": "",
    "originSummary": [
      "노동력 부족 문제를 해결하고 개발 속도를 높이기 위해 Flutter를 포크하여 개발 중인 새로운 프로젝트가 Flock이라고 불립니다.",
      "Flock은 원래 Flutter 팀이 구현하지 않은 버그 수정 및 기능을 추가하면서 Flutter와 함께 최신 상태를 유지하는 것을 목표로 합니다.",
      "이 이니셔티브는 Flutter의 기능을 향상시키기 위해 테스트, 검토 및 주도 분야에서 커뮤니티 참여를 장려합니다."
    ],
    "commentSummary": [
      "플러터를 포크하여 개발 중인 새로운 프로젝트 'Flock'은 데스크톱 및 웹 애플리케이션의 개발 프로세스를 개선하는 것을 목표로 하고 있습니다.",
      "Flock은 커뮤니티 분열에 대한 우려를 해결하기 위해 Flutter 업데이트와 동기화 상태를 유지하는 것을 목표로 합니다.",
      "이 이니셔티브는 크로스 플랫폼 프레임워크에 대한 논쟁을 촉발했으며, 일부 사용자는 Flutter 앱에서 성능 및 디자인의 한계가 있다고 인식하여 네이티브 UI 개발을 선호하고 있습니다."
    ],
    "points": 784,
    "commentCount": 651,
    "retryCount": 0,
    "time": 1730143459
  },
  {
    "id": 41976311,
    "title": "읽고 쓰는 법을 배워 손으로 쓴 노트로 돌아가기",
    "originLink": "https://research.google/blog/a-return-to-hand-written-notes-by-learning-to-read-write/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41976311",
    "commentBody": "",
    "originSummary": [
      "Google 리서치 엔지니어들은 필기된 사진을 디지털 잉크로 변환하여 특수 장비 없이 펜 스트로크를 캡처하는 모델을 개발했으며, 이 과정을 디렌더링이라고 합니다.",
      "이 방법은 필기체의 스타일과 역동성을 보존하여 손으로 쓴 메모의 편집 가능하고 현실적인 디지털 표현을 가능하게 함으로써 광학 문자 인식(OCR)과는 다릅니다.",
      "이 모델은 멀티 태스크 훈련 설정, 비전-언어 모델, 데이터 증강을 사용하여 견고하고 확장 가능하며 효과적입니다. 이는 짝지어진 훈련 데이터가 필요하지 않으며, 성능은 인간이 생성한 디지털 잉크와 비교할 만합니다."
    ],
    "commentSummary": [
      "한 사용자가 냉장고 화이트보드와 아이폰을 사용하여 손글씨 메모를 효율적으로 디지털화하는 방법을 설명하며, 이 방법의 자연스러운 느낌을 강조했습니다.",
      "토론에는 블록체자나 만년필을 사용하는 것과 같은 필기 향상 팁이 포함되었으며, 손으로 쓴 수식을 LaTeX로 변환하는 Mathpix와 같은 도구도 언급되었습니다.",
      "대화에서는 기술로 인해 필기 능력이 저하되는 문제도 다루었으며, 일부 참가자들은 개인적 및 교육적 이점을 위해 이러한 능력을 보존해야 한다고 주장했습니다."
    ],
    "points": 532,
    "commentCount": 173,
    "retryCount": 0,
    "time": 1730149696
  },
  {
    "id": 41979203,
    "title": "Cursor를 사용하여 코드를 작성하는 방법",
    "originLink": "https://www.arguingwithalgorithms.com/posts/cursor-review.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41979203",
    "commentBody": "",
    "originSummary": [
      "Cursor는 Visual Studio Code의 포크로, 대형 언어 모델(LLM) 기능을 통합하여 무료 및 구독 등급을 제공합니다. 주요 기능으로는 탭 완성, 인라인 편집, 채팅 사이드바, 코드베이스 간 리팩토링을 위한 작곡가가 있습니다. 탭 완성은 반복 작업과 리팩토링을 자동화하는 데 도움을 주지만, 때때로 잘못된 완성을 제안할 수 있습니다. 인라인 편집 및 채팅 기능은 코드 수정에 도움을 줍니다. .cursorrules 파일은 코딩 표준으로 LLM을 안내할 수 있으며, Cursor는 외부 라이브러리에 대한 의존도를 줄이고 익숙하지 않은 언어 사용을 장려함으로써 워크플로우를 변경했습니다."
    ],
    "commentSummary": [
      "논의는 코딩에서 Cursor와 같은 AI 도구의 사용에 중점을 두고 있으며, 그 이점과 단점에 대한 의견이 분분하다.",
      "지지자들은 AI가 반복적인 작업을 자동화하고 생산성을 높이며 새로운 프레임워크 학습을 돕는다고 주장합니다.",
      "비평가들은 AI가 복잡한 코드베이스를 이해하는 데 한계가 있으며, 과도한 의존의 위험과 결함 있는 코드를 생성할 가능성을 경고하며, 효율성과 기술 유지 간의 균형을 맞출 필요성을 강조합니다."
    ],
    "points": 361,
    "commentCount": 328,
    "retryCount": 0,
    "time": 1730173823
  },
  {
    "id": 41984519,
    "title": "새로운 M4 탑재 맥 미니",
    "originLink": "https://www.apple.com/newsroom/2024/10/apples-new-mac-mini-is-more-mighty-more-mini-and-built-for-apple-intelligence/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41984519",
    "commentBody": "",
    "originSummary": [
      "애플은 M4 및 M4 Pro 칩이 장착된 새로운 맥 미니를 출시했으며, M1 모델에 비해 최대 1.8배 빠른 CPU와 2.2배 빠른 GPU를 제공하여 성능이 크게 향상되었습니다.",
      "Mac mini는 최초의 탄소 중립 Mac으로, 온실가스 배출을 80% 이상 줄였으며, 50% 이상의 재활용 소재로 제작되고 제조 과정에서 100% 재생 에너지를 사용합니다.",
      "향상된 데이터 전송을 위한 Thunderbolt 5를 특징으로 하며, 사용자 프라이버시와 생산성을 높이는 Apple Intelligence를 지원합니다. 시작 가격은 $599이며, 11월 8일부터 배송되는 사전 주문이 가능합니다."
    ],
    "commentSummary": [
      "새로운 M4 칩이 탑재된 Mac Mini는 교육 할인으로 500달러에 경쟁력 있는 가격으로 제공되며, 16GB의 RAM을 특징으로 하여 비슷한 가격대의 데스크톱 PC에 대한 강력한 대안으로 자리 잡고 있습니다.",
      "Mac Mini는 컴팩트한 디자인과 성능으로 칭찬받고 있지만, 사용자는 macOS에서 4K 이하 모니터와의 잠재적인 디스플레이 문제 및 제한된 내부 저장 공간에 주의해야 합니다.",
      "이 장치는 효율성과 가정용 서버로서의 잠재적 사용 가능성으로 주목받고 있지만, SSD와 같은 업그레이드 불가능한 부품에 대한 우려가 지속되고 있습니다."
    ],
    "points": 359,
    "commentCount": 529,
    "retryCount": 0,
    "time": 1730214021
  },
  {
    "id": 41976754,
    "title": "스티브 발머는 과소평가된 CEO였다",
    "originLink": "https://danluu.com/ballmer/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41976754",
    "commentBody": "",
    "originSummary": [
      "마이크로소프트가 스티브 발머 아래에서 실패하고 사티아 나델라에 의해 구원받았다는 이야기는 지나치게 단순화된 것입니다. 발머의 재임 기간 동안 강력한 재무 성과와 전략적 투자가 포함되어 있었습니다. 발머 시대의 중요한 성과로는 Azure와 Office 365의 출시, 강력한 기업 판매 부서 구축 등이 있으며, 이는 현재 마이크로소프트의 성공에 기여했습니다. 발머는 Bing과 Windows Phone과 같은 프로젝트로 비판을 받았지만, 이러한 프로젝트는 나델라의 리더십 하에서 미래 성과의 기초를 마련한 더 넓은 전략의 일부였습니다."
    ],
    "commentSummary": [
      "스티브 발머, 전 마이크로소프트 CEO는 기업 클라우드와 소비자 기기 간의 내부 경쟁과 우유부단함을 조장했다는 비판을 받았다. 비판에도 불구하고, 발머는 현재 마이크로소프트의 주요 수익원인 Azure와 Office 365와 같은 성공적인 사업의 기초를 마련했다. 그의 리더십 덕분에 마이크로소프트는 같은 시기에 다른 기업들이 겪었던 쇠퇴를 피하고 주요 기술 산업의 플레이어로 남을 수 있었다."
    ],
    "points": 331,
    "commentCount": 625,
    "retryCount": 0,
    "time": 1730152107
  },
  {
    "id": 41976529,
    "title": "HTML 양식 유효성 검사는 충분히 사용되지 않는다",
    "originLink": "https://expressionstatement.com/html-form-validation-is-heavily-underused",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41976529",
    "commentBody": "",
    "originSummary": [
      "HTML 양식 유효성 검사는 \"required\", \"email\", \"number\", \"pattern\"과 같은 속성을 통해 강력한 기능을 제공함에도 불구하고 종종 충분히 활용되지 않습니다.",
      "setCustomValidity 메서드는 복잡한 유효성 검사 로직을 허용하지만, 번거로운 특성과 속성에 해당하는 것이 없기 때문에 덜 채택됩니다.",
      "customValidity 속성을 사용한 제안된 선언적 접근 방식은 복잡한 유효성 검사를 단순화할 수 있으며, 이는 HTML 사양의 향후 업데이트에 영향을 미칠 가능성이 있습니다."
    ],
    "commentSummary": [
      "HTML 양식 유효성 검사는 Chrome 및 Firefox와 같은 브라우저가 유효성 검사 메시지의 사용자 지정 스타일을 제한하여 디자인 불일치를 초래하기 때문에 자주 사용되지 않습니다. 기본 유효성 검사는 필드당 여러 오류를 표시하거나 양식 전체의 오류를 관리하는 등의 유연성이 부족하여 개발자가 일관성을 위해 사용자 지정 유효성 검사를 사용하도록 합니다. 그 한계에도 불구하고, 기본 유효성 검사는 사용자 혼란과 접근성 문제를 방지하기 위해 신중하게 구현된다면 유리할 수 있습니다."
    ],
    "points": 331,
    "commentCount": 287,
    "retryCount": 0,
    "time": 1730150909
  },
  {
    "id": 41985915,
    "title": "GitHub, Google 및 Anthropic과 AI 계약 체결",
    "originLink": "https://www.bloomberg.com/news/articles/2024-10-29/microsoft-s-github-unit-cuts-ai-deals-with-google-anthropic",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41985915",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "GitHub는 Google 및 Anthropic과 AI 파트너십을 체결하여 커뮤니티로부터 다양한 반응을 얻고 있습니다.",
      "이 거래들은 마이크로소프트가 AI 협력을 확장하고 잠재적으로 OpenAI에서 초점을 옮기려는 전략으로 인식되고 있다.",
      "논의에는 AI 모델의 성능이 포함되며, 일부 사용자는 OpenAI보다 Claude를 선호하고, 오픈 소스 소프트웨어에 대한 영향과 잠재적인 반독점 문제에 대한 우려가 포함됩니다."
    ],
    "points": 312,
    "commentCount": 164,
    "retryCount": 0,
    "time": 1730218817
  },
  {
    "id": 41982698,
    "title": "전 세계 사람들이 당신의 가장 친한 친구에게 학대 신고를 보내도록 하는 방법",
    "originLink": "https://delroth.net/posts/spoofed-mass-scan-abuse/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41982698",
    "commentBody": "",
    "originSummary": [
      "Hetzner는 서버의 IP에 악성코드가 관련된 잠재적 보안 문제에 대한 경고를 보냈지만, 조사 결과 악성코드는 발견되지 않았습니다.",
      "문제는 무작위 기계에서 온 TCP 리셋 패킷으로 추적되었으며, 이는 가짜 연결 요청을 보내고 남용 불만을 유발하는 전술인 IP 스푸핑을 나타냅니다.",
      "이번 공격은 Tor 릴레이를 목표로 하여, 필터링되지 않은 IP 스푸핑과 같은 지속적인 인터넷 보안 문제와 BCP38 필터링과 같은 보안 관행의 강화된 시행 필요성을 강조했습니다."
    ],
    "commentSummary": [
      "사용자가 스푸핑된 TCP 패킷을 차단하기 위해 방화벽 규칙을 구현한 후 Google 및 Microsoft와 같은 합법적인 서비스에서 문제를 경험했으며, 이는 IP 스푸핑의 지속적인 문제를 강조합니다.",
      "BCP38과 같은 IP 스푸핑 방지를 목표로 하는 지침에도 불구하고, 많은 네트워크가 필요한 필터를 구현하지 않아 공격자가 가짜 소스 IP로 패킷을 보낼 수 있게 합니다.",
      "이 논의는 또한 여러 ISP와 IP 주소를 관리하는 데 있어 어려움과 남용 불만에 직면했을 때 무죄를 입증하는 데 있어 어려움을 강조하며, 인터넷의 유연성과 오용 가능성을 반영합니다."
    ],
    "points": 241,
    "commentCount": 50,
    "retryCount": 0,
    "time": 1730200677
  },
  {
    "id": 41975993,
    "title": "왜 매트 레빈이 이렇게 적을까?",
    "originLink": "https://gwern.net/matt-levine",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41975993",
    "commentBody": "",
    "originSummary": [
      "매트 레빈의 '머니 스터프' 뉴스레터는 유머와 복잡한 주제에 대한 명확한 설명을 결합하여 금융 분야에서 두드러지며, 빠르게 해결되는 실제 사례를 사용합니다.",
      "레빈의 성공을 다른 분야에서 복제하는 것은 대부분의 분야가 신속하고 명확한 예시와 필요한 전문성, 집착, 끈기를 가진 개인이 부족하기 때문에 어렵다.",
      "Levine과 같은 교육 뉴스레터 작가의 희소성은 대부분의 분야의 특성과 자신의 분야에서 직접 일하는 것보다 글쓰기를 선호하는 개인의 희귀성에 기인합니다."
    ],
    "commentSummary": [
      "이 논의는 금융에 대한 통찰력 있고 유머러스한 논평을 제공하여 복잡한 주제를 이해하기 쉽게 만드는 Matt Levine과 같은 작가의 희소성을 강조합니다.",
      "비슷한 작가들이 화학 분야의 데릭 로우나 역사 분야의 브렛 데버로와 같이 다른 분야에도 존재하지만, 이들은 종종 시간과 재정적 제약으로 인해 원래의 직업을 떠나 글쓰기에 집중하게 된다.",
      "레빈의 매력은 부분적으로 독자들이 다른 분야에서는 흔치 않은 재정적 통찰력을 얻을 수 있는 가능성과 그의 매력적인 글쓰기 스타일에 기인합니다."
    ],
    "points": 236,
    "commentCount": 131,
    "retryCount": 0,
    "time": 1730147862
  },
  {
    "id": 41978197,
    "title": "POSIX 2024의 새로운 점",
    "originLink": "https://blog.toast.cafe/posix2024-xcu",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41978197",
    "commentBody": "",
    "originSummary": [
      "1950년대에는 컴퓨터 간의 상호 운용성이 부족했고, 주된 통신 수단은 벨 시스템의 전화망을 통한 것이었다.",
      "벨에 대한 반독점 소송은 유닉스의 탄생으로 이어졌고, 이는 1980년대에 범용 운영 체제가 되었다.",
      "POSIX 2024는 현대 C 표준, 향상된 메이크파일 호환성, timeout(1p)과 같은 새로운 유틸리티를 도입하여 상호 운용성을 향상시키고 POSIX 사양을 현대화하는 것을 목표로 업데이트를 도입합니다."
    ],
    "commentSummary": [
      "POSIX 2024는 스크립트 오류를 방지하기 위해 경로명에 줄 바꿈을 사용하지 않도록 권장하고, 파이프라인에서의 오류 처리를 개선하기 위해 `set -o pipefail`을 추가하는 등의 업데이트를 도입합니다.",
      "업데이트는 C17 준수를 요구하며, POSIX를 현대화하면서도 하위 호환성을 보장하는 것을 목표로 하고 있습니다. 그러나 일부 사용자는 스크립트가 깨질 수 있는 잠재적인 변화에 대해 우려하고 있습니다.",
      "기능과 사용성을 개선하기 위한 노력의 일환으로 `find`, `xargs`, `rm`, `make`와 같은 유틸리티가 향상되었습니다."
    ],
    "points": 203,
    "commentCount": 192,
    "retryCount": 0,
    "time": 1730162546
  },
  {
    "id": 41983622,
    "title": "그림으로 쓰기: 리처드 스캐리와 아동 문학의 예술",
    "originLink": "https://yalereview.org/article/chris-ware-richard-scarry",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41983622",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "리처드 스캐리의 어린이 책, 예를 들어 '자동차와 트럭과 움직이는 것들'은 기발한 삽화와 매력적인 이야기로 유명하며, 세상의 이상적인 모습을 제공합니다.",
      "어른들은 종종 책에서 묘사된 보람 있는 일과 만족스럽고 보수가 좋은 직업을 찾는 현실의 도전 사이의 대조를 지적합니다.",
      "시간이 지나면서 성 역할의 변화 등을 포함한 몇 가지 업데이트가 있었음에도 불구하고, 스캐리의 책들은 여전히 어린이들에게 기쁨과 창의력을 불어넣으며 소중한 어린 시절의 일부로 남아 있습니다."
    ],
    "points": 161,
    "commentCount": 72,
    "retryCount": 0,
    "time": 1730208295
  },
  {
    "id": 41974882,
    "title": "자동차 연결 표준화",
    "originLink": "https://www.tesla.com/en_CA/blog/standardizing-automotive-connectivity",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41974882",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "테슬라는 자동차 연결성을 간소화하고 효율성을 향상시키기 위해 내부 차량 배선에 새로운 48V 커넥터를 도입하고 있습니다.",
      "차량 수리 중 잘못된 연결로 이어질 수 있는 비키드 커넥터의 사용에 대한 우려가 제기되고 있으며, 이는 전통적인 고유 커넥터와 대조됩니다.",
      "이 이니셔티브는 또한 차량에서 CAN 버스 시스템을 대체할 수 있는 이더넷의 잠재력에 대해 논의하며, 더 높은 데이터 전송 속도와 간소화된 배선을 제공하지만, 테슬라의 48V 아키텍처는 아직 공식 표준이 아닙니다."
    ],
    "points": 149,
    "commentCount": 165,
    "retryCount": 0,
    "time": 1730142562
  },
  {
    "id": 41975741,
    "title": "Xwayland 창 크기 조정 개선",
    "originLink": "https://blog.vladzahorodnii.com/2024/10/28/improving-xwayland-window-resizing/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41975741",
    "commentBody": "",
    "originSummary": [
      "Plasma Wayland 6.3은 Xwayland 창 크기 조정을 개선하여 X11 창의 즉각적인 크기 조정으로 인한 시각적 결함을 수정하는 것을 목표로 합니다.",
      "X11 프레임 동기화 프로토콜은 크기 조정 중 창 다시 그리기를 조정하지만, KWin과 같은 Wayland 컴포지터는 다른 방법을 사용하여 잠재적인 불일치를 초래할 수 있습니다.",
      "KWin은 이제 Xwayland 개발자의 기여로 Wayland에서 X11 창의 프레임 동기화를 효과적으로 관리하지만, 일부 GTK 및 Qt 애플리케이션은 여전히 글리치가 발생할 수 있습니다."
    ],
    "commentSummary": [
      "Xwayland 창 크기 조정은 다시 그리기 문제와 느리거나 응답하지 않는 애플리케이션 처리 문제로 인해 어려움을 겪고 있으며, Wayland는 컴포지터가 크기 조정 및 장식을 관리하도록 하여 이를 해결하려고 합니다. Wayland는 화면 찢김 현상을 제거하는 등 X11에 비해 개선된 점을 도입하지만, 스크린샷 및 화면 녹화와 같은 기능에 대해 다른 구현이 필요하다는 새로운 과제도 제시합니다. Wayland에 대한 논의에는 다국어 입력, 창 배치, 보안과 같은 주제가 포함되며, 이러한 도전 과제에도 불구하고 점차 지원을 얻고 Linux 데스크톱 경험을 향상시키고 있습니다."
    ],
    "points": 140,
    "commentCount": 155,
    "retryCount": 0,
    "time": 1730146712
  },
  {
    "id": 41980986,
    "title": "급성 정신병을 앓고 있는 사람들이 머릿속의 목소리와 마주할 때 어떤 일이 발생합니까?",
    "originLink": "https://www.theguardian.com/news/2024/oct/29/acute-psychosis-inner-voices-avatar-therapy-psychiatry",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41980986",
    "commentBody": "",
    "originSummary": [
      "줄리안 레프 교수에 의해 개발된 아바타 치료는 디지털 아바타를 사용하여 환자들이 듣는 목소리와 상호작용하고 이를 통제할 수 있도록 도와주며, 정신병 치료에 유망한 결과를 보여주고 있습니다. 이 치료는 항정신병 약물과 인지 행동 치료(CBT)와 같은 전통적인 치료에 반응하지 않았던 조와 같은 개인들에게 효과적인 것으로 입증되었습니다. 실험 결과 아바타 치료는 기존 치료보다 더 빠르고 비용 효율적이며, NHS에서의 광범위한 적용 가능성과 다른 정신 건강 상태에 대한 AI 기반 아바타의 미래 탐색 가능성을 가지고 있습니다."
    ],
    "commentSummary": [],
    "points": 136,
    "commentCount": 137,
    "retryCount": 0,
    "time": 1730191439
  },
  {
    "id": 41978246,
    "title": "한 인디 스튜디오가 스타니슬라프 렘의 소설을 기반으로 게임을 만들었다",
    "originLink": "https://invinciblethegame.com/?hn",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41978246",
    "commentBody": "",
    "originSummary": [
      "스타니스와프 렘의 고전 SF 소설에서 영감을 받은 새로운 게임이 이제 PC와 콘솔에서 이용 가능하며, 플레이어는 야스나라는 과학자로서 신비로운 행성을 탐험하는 스토리를 특징으로 합니다.",
      "이 게임은 레트로 퓨처리즘과 아톰펑크 아트 스타일을 선보이며, 브루논 루바스의 음악을 포함하여 독특한 시각적 및 청각적 경험을 제공합니다.",
      "11 bit studios S.A.에서 개발한 이 게임은 플레이어가 Regis III 행성의 비밀을 밝혀내도록 초대하며, 흥미로운 배경과 디자인으로 이야기를 더욱 풍부하게 만듭니다."
    ],
    "commentSummary": [
      "한 인디 스튜디오가 스태니슬라프 렘의 소설 '무적함'의 프리퀄로 게임을 개발했으며, 주로 내러티브 선택이 있는 워킹 시뮬레이터로 기능합니다.",
      "그 게임은 소설의 레트로퓨처리즘적 배경을 효과적으로 묘사하고 있지만, 레므의 원작에 대한 충실성에 대해서는 의견이 분분하다.",
      "스포일러, 시스템 성능, 그리고 게임의 반복적인 게시물이 진정한 관심인지 자기 홍보인지에 대한 논의가 등장했습니다."
    ],
    "points": 128,
    "commentCount": 56,
    "retryCount": 0,
    "time": 1730163146
  }
]
