[
  {
    "id": 41050055,
    "title": "Hidrotermal patlama Yellowstone Ulusal Parkı'nda",
    "originLink": "https://www.jhnewsandguide.com/the_hole_scroll/video-biscuit-basin-geyser-explodes-sending-yellowstone-tourists-packing/article_6862fda2-4923-11ef-b5c4-abdc9bc8cd83.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41050055",
    "commentBody": "",
    "originSummary": [
      "Orman Hizmeti, Mike Harris patika sisteminin bazı bölümlerini kapatmak için çalışıyor.",
      "MD Fidanlığı, bir adamın hendekte ölümü nedeniyle 28.000 dolardan fazla para cezasına çarptırıldı.",
      "Yellowstone'daki Biscuit Basin'de meydana gelen bir hidrotermal patlama turistlerin kaçmasına neden oldu."
    ],
    "commentSummary": [
      "Yellowstone Ulusal Parkı'ndaki Biscuit Basin termal alanında bir hidrotermal patlama meydana geldi, yürüyüş yoluna zarar verdi ancak yaralanmaya neden olmadı.",
      "Patlama, Black Diamond Havuzu yakınlarında meydana geldi ve ziyaretçiler tarafından kaydedildi, bu da güvenlik nedeniyle bölgenin geçici olarak kapatılmasına yol açtı.",
      "Uzmanlar, bu tür yerel hidrotermal olayların daha büyük Yellowstone Kalderası (süpervolkan) içindeki faaliyetlerin göstergesi olmadığını vurguluyor."
    ],
    "points": 513,
    "commentCount": 273,
    "retryCount": 0,
    "time": 1721764184
  },
  {
    "id": 41058107,
    "title": "Büyük Yeterlilik – Mistral AI",
    "originLink": "https://mistral.ai/news/mistral-large-2407/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41058107",
    "commentBody": "",
    "originSummary": [
      "Mistral AI, 128k bağlam penceresi ve 80'den fazla kodlama dili desteği sunan, 123 milyar parametre ile tek düğümlü çıkarım için optimize edilmiş Mistral Large 2 modelini piyasaya sürdü.",
      "Model, MMLU'da %84.0 doğruluk oranına ulaşarak önceki modelleri ve GPT-4o ile Llama 3 405B gibi rakipleri geride bırakıyor, \"halüsinasyonları\" en aza indirme ve akıl yürütmeyi geliştirme yetenekleriyle.",
      "Mistral Large 2, ticari olmayan ve ticari kullanım için farklı lisanslar altında mevcuttur ve ağırlıkları HuggingFace'te barındırılmakta olup, Google Cloud Platform ve Azure AI Studio gibi genişletilmiş bulut hizmeti ortaklıklarını içermektedir."
    ],
    "commentSummary": [
      "Mistral AI'nin yeni modeli Large 2 ve Meta'nın Llama 3.1 405B test edildi ve aralarında belirgin bir kazanan bulunamadı.",
      "Kullanıcılar, Claude'un güçlü bir seçenek olarak kaldığını vurguladı ancak daha akıllı yanıtlar, daha uzun bağlam pencereleri ve daha hızlı yanıtlar gibi iyileştirmeler istediklerini belirttiler.",
      "Tokenizasyon sorunları nedeniyle bazı modellerin basit görevlerde zorlanmasına rağmen, yapay zeka modellerindeki hızlı gelişim ve rekabet heyecan verici olmaya devam ediyor. Birçok kullanıcı, kodlama ve diğer görevlerde daha iyi performans için Claude Sonnet 3.5 gibi modellere geçiş yapıyor."
    ],
    "points": 385,
    "commentCount": 281,
    "retryCount": 0,
    "time": 1721835141
  },
  {
    "id": 41052365,
    "title": "Şeker hastalığı tedavimi kendi ellerime almak",
    "originLink": "https://martin.janiczek.cz/2024/07/23/taking-my-diabetes-treatment-into-my-own-hands.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41052365",
    "commentBody": "",
    "originSummary": [
      "Tip 1 diyabet hastası, insülin ve karbonhidrat alımını daha iyi görselleştirmek ve yönetmek için OxyPlot grafiklerine sahip bir Windows Forms uygulaması geliştirdi.",
      "Bu kişi, insülin dozajlarını optimize etmek için bir genetik algoritma kütüphanesi olan GeneticSharp'ı kullandı ve glikoz seviyelerini başarıyla dengeledi.",
      "Yaklaşım, kişiselleştirilmiş diyabet yönetimi için umut vaat ediyor, ancak uzun etkili insülin için daha fazla simülasyon ve ayarlama gerekiyor."
    ],
    "commentSummary": [
      "Bireyler, diyabetle ilgili kişisel deneyimlerini ve durumlarını yönetme stratejilerini paylaşıyor, öz izleme ve veri kaydının önemini vurguluyorlar.",
      "Çeşitli yöntemler arasında diyet değişiklikleri, sürekli glikoz izleme (CGM) ve yiyecek ve egzersizin kan şekeri seviyeleri üzerindeki etkilerinin kişiselleştirilmiş takibi yer almaktadır.",
      "Konuşma, sağlık sisteminin diyabet yönetimindeki yetersizlikleri nedeniyle yaygın bir öz güven duygusunu vurgulamaktadır."
    ],
    "points": 292,
    "commentCount": 200,
    "retryCount": 0,
    "time": 1721779619
  },
  {
    "id": 41057033,
    "title": "Google, AI anlaşması sayesinde artık Reddit'te çalışan tek arama motoru",
    "originLink": "https://www.404media.co/google-is-the-only-search-engine-that-works-on-reddit-now-thanks-to-ai-deal/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41057033",
    "commentBody": "",
    "originSummary": [
      "Google artık Reddit'in son sonuçlarını gösterebilen tek arama motoru, bu da Reddit içeriğini Google'a özel kılıyor.",
      "Diğer arama motorları olan Bing, DuckDuckGo ve Qwant, Reddit'in son sonuçlarını gösteremezken, DuckDuckGo sınırlı bağlantılar sunmakta ancak açıklamalar vermemektedir.",
      "Bu durum, Google'ın arama üzerindeki neredeyse tekelini vurguluyor, rekabeti etkiliyor ve arama kalitesi konusunda eleştiriler alıyor, Google'ın Reddit'ten yapay zeka eğitimi için veri toplamasına izin veren milyonlarca dolarlık bir anlaşma spekülasyonlarına yol açıyor."
    ],
    "commentSummary": [
      "Google, Reddit'in yeni bir yapay zeka anlaşması nedeniyle tek arama motoru haline geldi ve Reddit'in robots.txt dosyası diğer arama motorlarının içeriğini dizine eklemesini engelliyor.",
      "Bu karar, arama motoru rekabeti ve açık internet ilkeleri üzerindeki etkileri hakkında tartışmaları ateşledi.",
      "Anlaşmanın rekabete aykırı doğası ve kullanıcı deneyimi ile içerik erişilebilirliği üzerindeki olası olumsuz etkileri hakkında endişeler dile getirildi."
    ],
    "points": 272,
    "commentCount": 213,
    "retryCount": 0,
    "time": 1721828482
  },
  {
    "id": 41051327,
    "title": "Yüz taramalarından havaalanında vazgeçebilirsiniz",
    "originLink": "https://www.vox.com/future-perfect/360952/summer-travel-airport-facial-recognition-scan",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41051327",
    "commentBody": "",
    "originSummary": [
      "Yolcular, kameradan uzak durarak, kimliklerini göstererek ve “Biyometriklerden vazgeçiyorum” diyerek havaalanı yüz tanıma sisteminden vazgeçebilirler.",
      "Algoritmik Adalet Ligi'nin “Özgürlük Uçuşları” kampanyası, özellikle TSA'nın yüz tanımayı tüm ABD havaalanlarına genişletmeyi planladığı bir dönemde, bu hakkın farkındalığını artırmayı amaçlıyor.",
      "Yüz tanıma, veri ihlalleri, yanlış tanımlama, yapay zeka yanlılığı ve gözetimin normalleşmesi gibi riskler taşır ve biyometrik verilerin saklanması ve kullanımı konusunda önemli gizlilik endişeleri doğurur."
    ],
    "commentSummary": [
      "Yüz taramalarını reddetme deneyimleri büyük ölçüde değişiklik göstermektedir; bazı kullanıcılar dirençle karşılaşırken, diğerleri hiçbir sorunla karşılaşmamaktadır.",
      "İleri düzey kameralar havaalanlarında yüksek yüz tanıma doğruluğu için 3D görüntüler yakalıyor, bu da yüz verilerinin saklanması ve yaygın gözetim hakkında endişeleri artırıyor.",
      "Bu tür teknolojilerin yaygınlığı nedeniyle gözetim uygulamalarının normalleşmesine karşı koymak için vazgeçmenin gerekli olup olmadığı ya da bunun boşuna olup olmadığı konusundaki tartışma devam ediyor."
    ],
    "points": 258,
    "commentCount": 232,
    "retryCount": 0,
    "time": 1721771409
  },
  {
    "id": 41058261,
    "title": "Kullanıcılarına kesinti için özür dilemek amacıyla CrowdStrike 10 dolarlık bir hediye kartı sunuyor",
    "originLink": "https://techcrunch.com/2024/07/24/crowdstrike-offers-a-10-apology-gift-card-to-say-sorry-for-outage/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41058261",
    "commentBody": "",
    "originSummary": [
      "CrowdStrike, bir siber güvenlik firması, 19 Temmuz'da hatalı bir güncelleme nedeniyle küresel bir kesintiye neden oldu, milyonlarca bilgisayarı etkiledi ve havaalanı gecikmeleri ve durdurulan ameliyatlar gibi önemli aksaklıklara yol açtı.",
      "Bir özür olarak, şirket ortaklarına 10 dolarlık Uber Eats hediye kartları teklif etti, ancak bazı alıcılar kuponların geçersiz olduğunu bildirdi.",
      "CrowdStrike'ın CEO'su ve baş güvenlik görevlisi, olayın ciddiyetini kabul ederek kamuoyuna özür diledi ve şeffaflık ile gelecekteki önleme tedbirlerine bağlılık sözü verdi."
    ],
    "commentSummary": [
      "KitleStrike, bir kesinti için özür dilemek amacıyla $10 değerinde Uber Eats hediye kartları dağıttı, ancak birçok kullanıcı bu kuponların geçersiz olduğunu fark etti ve bu durum şirketin yetkinliği hakkında eleştirilere ve spekülasyonlara yol açtı.",
      "Bazı kullanıcılar hediye kartı sorununun bir kimlik avı girişimi veya bir hack olabileceğinden şüphelendi, bu da CrowdStrike'ın itibarını daha da zedeledi.",
      "Bu jest, özellikle havayolları ve hastaneler gibi kritik hizmetler üzerindeki kesintinin önemli etkisi göz önüne alındığında, yetersiz ve aşağılayıcı olarak algılandı ve olası yasal sorumluluklar hakkında tartışmalara yol açtı."
    ],
    "points": 237,
    "commentCount": 128,
    "retryCount": 0,
    "time": 1721836179
  },
  {
    "id": 41053329,
    "title": "DEA ve TSA için \"rıza\" nasıl görünür",
    "originLink": "https://papersplease.org/wp/2024/07/23/what-consent-really-looks-like-for-the-dea-and-tsa/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41053329",
    "commentBody": "",
    "originSummary": [
      "TSA ve DEA, muhbirler ve TSA kontrol noktalarını kullanarak büyük miktarda nakit taşıyan yolcuları hedef alarak, bu kişilerin paralarını ele geçirmek için iş birliği yapıyor ve bu kişilerin aramalara 'rıza gösterdiğini' iddia ediyor.",
      "ABD Gümrük ve Sınır Koruma'nın yardımıyla Amtrak trenlerine kadar uzanan bu uygulama, yolcuların rızasını reddetmesini sık sık göz ardı ederek, para el koymanın bir türü olan 'sivil müsadere'yi içerir.",
      "Devam eden bir toplu dava, bu yasa dışı aramaların sıklığını vurguluyor ve davacılar, kayıtların hacminin sistematik bir soruna işaret ettiğini savunuyor, DEA ve TSA'nın bu kayıtları açıklamaya direnmesine rağmen."
    ],
    "commentSummary": [
      "Düğün, ani bir sel baskınıyla kesintiye uğradı ve bir kurtarma operasyonu gerektirdi, ancak ciddi bir yaralanma olmadı.",
      "Polis, katılımcıları uyuşturucu arama köpekleriyle otobüslerde gözaltına aldıktan sonra onları bir lise sığınağına taşıyarak sıkıntılarını artırdı.",
      "Olay, kolluk kuvvetlerinin yetkiyi kötüye kullanması, sivil varlıkların müsaderesi ve uyuşturucuyla mücadele konularında bir tartışma başlatarak reform ihtiyacını ve bunun kamu güveni ve güvenliği üzerindeki etkisini vurguladı."
    ],
    "points": 216,
    "commentCount": 175,
    "retryCount": 0,
    "time": 1721790975
  },
  {
    "id": 41053201,
    "title": "Llama 3.1 C'de",
    "originLink": "https://github.com/trholding/llama2.c/blob/master/runq.c",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41053201",
    "commentBody": "",
    "originSummary": [
      "Yeni bir C tabanlı uygulama, Llama 2 ve Llama 3/3.1 Transformer modelleri üzerinde çıkarım yapmak için yayınlandı ve int8 kuantize edilmiş ileri geçiş özelliğine sahip.",
      "Bu kod, Linux Çekirdeği, Unikraft Unikernel ve Zip Arşivi aracılığıyla gömülü modeller gibi çeşitli ortamlar için destek içerir.",
      "Kullanıcılar, farklı kullanım durumları için esnekliği artırarak sıcaklık, top-p örnekleme ve model sürümü gibi parametreleri komut satırı argümanları aracılığıyla özelleştirebilirler."
    ],
    "commentSummary": [
      "Meta'nın Llama 3.1 modelleri çok dilli metin üretebilir, ancak mevcut C dilindeki uygulama hala hatalı ve daha fazla iyileştirme gerektiriyor.",
      "Proje, modelin 8-bit'e kuantize edilmesini içeriyor, bu da çıktı kalitesini düşürebilir ve esprili bir şekilde \"beyin hasarı\" olarak adlandırılır.",
      "Topluluk, optimal kuantizasyon yöntemleri ve yeni ölçekleme teknikleri kullanarak bağlam uzunluğunu genişletme konusundaki tartışmalarla uygulamanın iyileştirilmesine aktif olarak katkıda bulunuyor."
    ],
    "points": 179,
    "commentCount": 29,
    "retryCount": 0,
    "time": 1721789384
  },
  {
    "id": 41052593,
    "title": "Emacs'ın Kökeni 1976'da",
    "originLink": "https://onlisp.co.uk/On-the-Origin-of-Emacs-in-1976.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41052593",
    "commentBody": "",
    "originSummary": [
      "EMACS, bir metin düzenleyici, 1976 yılında MIT AI Laboratuvarı'nda geliştirildi ve yılın sonunda Richard Stallman (RMS) ana geliştirici oldu.",
      "RMS, \"E\" ve \"EMACS\" adını verdi ve Guy Steele, David Moon ve John Kulp'un başlangıçtaki yardımlarıyla TECO makrolarını güçlü bir editöre dönüştürmede önemli bir rol oynadı.",
      "Erken kullanıcı topluluğu, Moon da dahil olmak üzere, EMACS'ın gelişiminin işbirlikçi ve topluluk odaklı doğasını vurgulayarak, anahtar bağlamalarına ve komut adlarına katkıda bulundu."
    ],
    "commentSummary": [
      "1976'da, DNS (Alan Adı Sistemi) olmadığı için MIT-AI, e-posta adreslerinde @ sembolü yerine \"at\" kullandı.",
      "Erken dönem bilgisayar bilimcileri, \"gg AAA yy\" gibi net tarih formatlarını tercih ettiler ve MLDEV ve SUPDUP gibi erken dönem ağ dosya sistemleri ve protokollerini tartıştılar.",
      "Emacs, başlangıçta TECO'da yazılmış bir metin editörüdür, 1981'de Unix versiyonunu oluşturan James Gosling gibi geliştiricilerin katkılarıyla evrim geçirdi."
    ],
    "points": 176,
    "commentCount": 76,
    "retryCount": 0,
    "time": 1721782166
  },
  {
    "id": 41052371,
    "title": "Scrapscript: İşlevsel, içerik adreslenebilir bir programlama dili",
    "originLink": "https://github.com/tekknolagi/scrapscript",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41052371",
    "commentBody": "",
    "originSummary": [
      "Scrapscript, Python 3.8+ ve Cosmopolitan için mevcut bir yorumlayıcıya sahip bir programlama dilidir ve konteynerleştirilmiş yürütme için Docker'ı destekler.",
      "Scrapscript'in sözdizimi yakında güncellenecek ve kullanıcılar dili anlamak için `scrapscript.py` ve testlerine başvurabilirler.",
      "Deneysel bir derleyici mevcuttur ve her biri için belirli komutlar sağlanarak ELF, Cosmopolitan ve Wasm formatlarında çıktılar üretebilmektedir."
    ],
    "commentSummary": [
      "Scrapscript, JSON benzeri türler, fonksiyonlar ve hash referansları kullanarak yazılım paylaşılabilirliği sorunlarını çözmek için tasarlanmış yeni bir fonksiyonel, içerik adreslenebilir programlama dilidir.",
      "Unison'un git tabanlı bir paradigma kullanmasının aksine, Scrapscript daha iddialıdır ve kod tanımlama ve serileştirme için IPFS'ye (InterPlanetary File System) odaklanır.",
      "Dil, kamuya açık gelişimi ve yaratıcısının projede çalışırken alkolizmi yenmesiyle dikkat çekti."
    ],
    "points": 176,
    "commentCount": 32,
    "retryCount": 0,
    "time": 1721779701
  },
  {
    "id": 41056387,
    "title": "Null bir sonuç aldınız. Bunu kimse yayınlar mı?",
    "originLink": "https://www.nature.com/articles/d41586-024-02383-9",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41056387",
    "commentBody": "",
    "originSummary": [
      "Araştırmacılar, değişkenler arasında önemli bir ilişki göstermeyen null sonuçları yayınlama konusunda zorluklarla karşılaşıyorlar, bu da olumlu bulguları tercih eden bir yanlılığa yol açıyor.",
      "Bu yayın yanlılığı, evrimsel biyolog Natalie Pilakouta'nın İzlanda'nın kaplıcalarındaki balık tercihleri üzerine yaptığı sonuçsuz çalışmada görüldüğü gibi, bilimsel kaydı çarpıtır ve kaynakları boşa harcar.",
      "Bu sorunu ele alma çabaları arasında dergilerin ön kayıtlı raporları teşvik etmesi yer alıyor, ancak yavaş benimseme ve null sonuçların hatalı araştırmayı gösterdiği algısı önemli engeller olarak kalmaya devam ediyor."
    ],
    "commentSummary": [
      "Bu tartışma, bilimsel araştırmalarda null sonuçların yayınlanmasındaki zorlukları ve teşvik eksikliğini, potansiyel değerlerine rağmen vurgulamaktadır.",
      "Bilim insanlarının önemli bir kısmı null sonuçları yayınlamaya istekli, ancak sistemik engeller ve üst düzey dergilerden gelen talep eksikliği nedeniyle bunu yapabilen çok az kişi var.",
      "Öneriler arasında, null sonuçlar için özel dergiler oluşturulması, null sonuçların ana yayınlara ek olarak eklenmesi ve yöntemlerin ön kayıtlarını içerecek şekilde hakem değerlendirme sürecinin iyileştirilmesi yer almaktadır."
    ],
    "points": 166,
    "commentCount": 99,
    "retryCount": 0,
    "time": 1721824500
  },
  {
    "id": 41052934,
    "title": "glhf.chat'i yaptık – 405B dahil olmak üzere neredeyse her açık kaynaklı LLM'yi çalıştırın",
    "originLink": "https://glhf.chat/landing/home",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41052934",
    "commentBody": "",
    "originSummary": [
      "Yeni bir web sitesi olan https://glhf.chat/, kullanıcıların fiyat belirleme aşamasında neredeyse her türlü açık kaynaklı LLM'yi (Büyük Dil Modeli) otomatik ölçeklenen GPU kümelerinde ücretsiz olarak çalıştırmalarına olanak tanıyor.",
      "Hizmet, açık kaynaklı vLLM projesiyle uyumlu herhangi bir modeli destekler, yaklaşık 640GB VRAM sunar ve modelleri çok kiracılı çalıştırarak diğer GPU hizmetlerinden daha maliyet etkin olmayı hedefler.",
      "Platform, Llama-3.1-405B Lansman Günü'nde başlatıldı ve Llama-3-70b finetunes gibi verimli modelleri destekliyor, daha büyük modeller için desteği geliştirme ve mevcut sınırlamaları ele alma planlarıyla."
    ],
    "commentSummary": [
      "glhf.chat, kullanıcıların neredeyse her türlü açık kaynaklı LLM'yi (Büyük Dil Modeli) otomatik ölçeklenen GPU kümelerinde çalıştırmasına olanak tanır, şu anda fiyatlandırmayı belirlerken ücretsizdir.",
      "Bu hizmet, NVLink sorunları nedeniyle bazı sınırlamalarla birlikte, Llama-3-70b finetunes gibi popüler modeller de dahil olmak üzere, açık kaynaklı vLLM projesiyle uyumlu herhangi bir modeli desteklemektedir.",
      "Llama-3.1-405B Lansman Günü'nde başlatılan platform, modelleri çok kiracılı bir ortamda çalıştırarak maliyet etkin olmayı hedefliyor ve kullanıcı geri bildirimlerini memnuniyetle karşılıyor."
    ],
    "points": 152,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1721785929
  },
  {
    "id": 41052446,
    "title": "Pnut: Güvenebileceğiniz bir C'den POSIX kabuk derleyicisi",
    "originLink": "https://pnut.sh",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41052446",
    "commentBody": "",
    "originSummary": [
      "Pnut, C programlarını insan tarafından okunabilir kabuk betiklerine dönüştüren ve POSIX uyumlu kabuklar arasında yüksek taşınabilirlik sağlayan bir C'den POSIX kabuğuna çevirici bir araçtır.",
      "Bu, geliştiricilerin yeni bir dil öğrenmelerine gerek kalmadan C dilinde betikler yazmalarına olanak tanır ve çıktıyı incelemek, hata ayıklamak ve bakımını yapmak kolaydır.",
      "Pnut, Linux, macOS ve Windows dahil olmak üzere tüm büyük işletim sistemlerinde çalışır ve BSD-2 Maddeli Lisans altında lisanslanmıştır."
    ],
    "commentSummary": [
      "Pnut, kaynak dosyalardan tekrarlanabilir derlemeler sağlayan, insan tarafından okunabilir bir kabuk betiği olarak dağıtılabilen bir C'den POSIX kabuğuna derleyicidir.",
      "Tiny C Derleyicisi (TCC) ile birlikte kendini derleyebilir ve çaba ile GNU Derleyici Koleksiyonu'nu (GCC) başlatabilir, böylece tam bir derleme araç zinciri oluşturabilir.",
      "Pnut, yenilikçiliğiyle övülse de, ikili G/Ç ve bazı C yapıları gibi pratik sınırlamalarla ilgili eleştirilerle karşı karşıya kalıyor ve güvenilirliği ve bütünlüğü konusunda farklı görüşler mevcut."
    ],
    "points": 150,
    "commentCount": 94,
    "retryCount": 0,
    "time": 1721780524
  },
  {
    "id": 41053383,
    "title": "MPPP – İlk 'tasarım uyuşturucu' felaketi (2023)",
    "originLink": "https://www.chm.bris.ac.uk/motm/mppp/mppph.htm",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41053383",
    "commentBody": "",
    "originSummary": [
      "MPPP (1-metil-4-fenil-4-propionoksipiperidin), ilk olarak 1947'de bildirilen ve ağrı kesici olarak tasarlanan bir tasarım ilacıdır, ancak mevcut seçeneklerden daha iyi olmadığı bulunmuştur.",
      "1976 yılında Barry Kidston, MPPP'yi sentezledi ve motor kontrol için hayati olan hücreleri seçici olarak öldüren bir safsızlık olan MPTP nedeniyle Parkinson benzeri semptomlar geliştirdi.",
      "1982'de MPTP ile kontamine olmuş sentetik eroinle bağlantılı olarak ortaya çıkan Parkinson belirtileri, Parkinson hastalığına dair önemli bilimsel bulgulara yol açtı ve amatör uyuşturucu sentezinin tehlikelerini vurguladı."
    ],
    "commentSummary": [
      "Tartışma, özellikle MPPP ve yan ürünü MPTP'nin kullanıcılarında Parkinson benzeri semptomlarla ilişkilendirildiği tasarımcı uyuşturucuların tehlikelerine odaklanıyor.",
      "Sentetik ilaçlarla ilişkili riskler, ilaç saflığının önemi ve güvenliği sağlamak için ilaçların yasallaştırılması ve düzenlenmesinin potansiyel faydaları üzerinde durulmaktadır.",
      "Kullanıcılar kişisel deneyimlerini paylaşır ve dikkatli olma ve uygun test yapma gerekliliğini vurgular, aynı zamanda uyuşturucu yasağının daha geniş etkilerini ve güvenli tüketimi sağlamanın zorluklarını ele alır."
    ],
    "points": 139,
    "commentCount": 165,
    "retryCount": 0,
    "time": 1721791960
  },
  {
    "id": 41055230,
    "title": "Micromouse",
    "originLink": "https://en.wikipedia.org/wiki/Micromouse",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41055230",
    "commentBody": "",
    "originSummary": [
      "Micromouse, küçük otonom robotların 16×16 boyutlarındaki bir labirenti çözdüğü bir robotik yarışmasıdır. 1970'lerin sonlarında ortaya çıkmış olup, Birleşik Krallık, ABD ve Japonya gibi çeşitli ülkelerde popülerdir.",
      "Robotlar, Bellman flood-fill, Dijkstra ve A* gibi algoritmaları kullanarak gezinirler ve en yüksek hızları saniyede üç metreyi aşar; mevcut dünya rekoru Ng Beng Kiat tarafından 3.921 saniyedir.",
      "Son gelişmeler arasında, 2.5g'nin üzerinde ivmelenmelere olanak tanıyan ek yere basma kuvveti için fanların kullanılması ve daha küçük boyutlara sahip 32×32 labirent kullanan Half-Size Micromouse adlı bir varyant bulunmaktadır."
    ],
    "commentSummary": [
      "Micromouse, küçük robotların bir labirentte gezinmesini içeren bir robotik yarışmasıdır ve Veritasium'un yakın tarihli bir videosu bu konuyu vurgulamaktadır.",
      "Yarışma, labirenti haritalamak için bir keşif aşamasını içerir ve duvar takibi ve labirent haritalama gibi farklı stratejiler kullanılır.",
      "Etkinlik, gençleri programlama ve mühendislik alanlarında meşgul ediyor; LEGO robotları ve daha gelişmiş robotlar gibi kategorilerle, teknolojinin onlarca yıl içindeki evrimini gösteriyor."
    ],
    "points": 132,
    "commentCount": 37,
    "retryCount": 0,
    "time": 1721813804
  }
]
