[
  {
    "id": 41050055,
    "title": "Explosión hidrotermal en el Parque Nacional de Yellowstone",
    "originLink": "https://www.jhnewsandguide.com/the_hole_scroll/video-biscuit-basin-geyser-explodes-sending-yellowstone-tourists-packing/article_6862fda2-4923-11ef-b5c4-abdc9bc8cd83.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41050055",
    "commentBody": "",
    "originSummary": [
      "La Agencia Forestal está trabajando para cerrar partes del sistema de senderos Mike Harris.",
      "MD Nursery ha sido multado con más de $28,000 debido a la muerte de un hombre en una zanja.",
      "Una explosión hidrotermal en Biscuit Basin en Yellowstone hizo que los turistas huyeran."
    ],
    "commentSummary": [
      "Una explosión hidrotermal ocurrió en el Parque Nacional de Yellowstone en el área termal de Biscuit Basin, dañando la pasarela pero sin causar lesiones.",
      "La explosión se originó cerca de Black Diamond Pool y fue grabada por los visitantes, lo que llevó a cierres temporales en la zona por seguridad.",
      "Los expertos enfatizan que tales eventos hidrotermales locales no son indicativos de actividad en la Caldera de Yellowstone (supervolcán) más grande."
    ],
    "points": 513,
    "commentCount": 273,
    "retryCount": 0,
    "time": 1721764184
  },
  {
    "id": 41058107,
    "title": "Lo suficientemente grande – Mistral AI",
    "originLink": "https://mistral.ai/news/mistral-large-2407/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41058107",
    "commentBody": "",
    "originSummary": [
      "Mistral AI ha lanzado el modelo Mistral Large 2, que cuenta con una ventana de contexto de 128k y soporte para más de 80 lenguajes de programación, optimizado para inferencia en un solo nodo con 123 mil millones de parámetros.",
      "La modelo alcanza una precisión del 84.0% en MMLU, superando a modelos anteriores y rivales como GPT-4o y Llama 3 405B, con capacidades mejoradas para minimizar las \"alucinaciones\" y mejorar el razonamiento.",
      "Mistral Large 2 está disponible bajo diferentes licencias para uso no comercial y comercial, con pesos alojados en HuggingFace y asociaciones ampliadas de servicios en la nube, incluyendo Google Cloud Platform y Azure AI Studio."
    ],
    "commentSummary": [
      "Mistral AI's new model, Large 2, y el Llama 3.1 405B de Meta fueron probados y se encontró que eran comparables, sin un claro ganador.",
      "Los usuarios destacaron que Claude sigue siendo una opción sólida, pero expresaron el deseo de mejoras como respuestas más inteligentes, ventanas de contexto más largas y respuestas más rápidas.",
      "A pesar de que algunos modelos tienen dificultades con tareas simples debido a problemas de tokenización, el rápido desarrollo y la competencia en los modelos de IA siguen siendo emocionantes, con muchos usuarios cambiando a modelos como Claude Sonnet 3.5 para un mejor rendimiento en la programación y otras tareas."
    ],
    "points": 385,
    "commentCount": 281,
    "retryCount": 0,
    "time": 1721835141
  },
  {
    "id": 41052365,
    "title": "Tomando el tratamiento de mi diabetes en mis propias manos",
    "originLink": "https://martin.janiczek.cz/2024/07/23/taking-my-diabetes-treatment-into-my-own-hands.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41052365",
    "commentBody": "",
    "originSummary": [
      "Un diabético tipo 1 desarrolló una aplicación de Windows Forms con gráficos de OxyPlot para visualizar y gestionar mejor la ingesta de insulina y carbohidratos.",
      "La persona utilizó GeneticSharp, una biblioteca de algoritmos genéticos, para optimizar las dosis de insulina, estabilizando con éxito los niveles de glucosa.",
      "La aproximación muestra promesa para la gestión personalizada de la diabetes, aunque se necesitan más simulaciones y ajustes para la insulina de acción prolongada."
    ],
    "commentSummary": [
      "Las personas con diabetes están compartiendo experiencias personales y estrategias para manejar su condición, enfatizando la importancia del automonitoreo y el registro de datos.",
      "Varios métodos discutidos incluyen cambios en la dieta, monitoreo continuo de glucosa (MCG) y seguimiento personalizado de los impactos de los alimentos y el ejercicio en los niveles de azúcar en la sangre.",
      "La conversación resalta un sentimiento común de autosuficiencia debido a las percepciones de deficiencias en la gestión de la diabetes por parte del sistema de salud."
    ],
    "points": 292,
    "commentCount": 200,
    "retryCount": 0,
    "time": 1721779619
  },
  {
    "id": 41057033,
    "title": "Google es el único motor de búsqueda que funciona en Reddit ahora, gracias a un acuerdo de IA",
    "originLink": "https://www.404media.co/google-is-the-only-search-engine-that-works-on-reddit-now-thanks-to-ai-deal/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41057033",
    "commentBody": "",
    "originSummary": [
      "Google es ahora el único motor de búsqueda que puede mostrar resultados recientes de Reddit, haciendo que el contenido de Reddit sea exclusivo de Google.",
      "Otros motores de búsqueda como Bing, DuckDuckGo y Qwant no pueden mostrar resultados recientes de Reddit, y DuckDuckGo proporciona enlaces limitados sin descripciones.",
      "Esta situación subraya el casi monopolio de Google en las búsquedas, afectando la competencia y generando críticas sobre la calidad de las búsquedas, con especulaciones sobre un acuerdo multimillonario que permitiría a Google extraer datos de Reddit para el entrenamiento de IA."
    ],
    "commentSummary": [
      "Google se ha convertido en el motor de búsqueda exclusivo para Reddit debido a un nuevo acuerdo de IA, con el archivo robots.txt de Reddit bloqueando a otros motores de búsqueda para que no indexen su contenido.",
      "Esta decisión ha encendido debates sobre sus efectos en la competencia de los motores de búsqueda y los principios de una internet abierta.",
      "Se han planteado preocupaciones sobre la naturaleza anticompetitiva del acuerdo y su posible impacto adverso en la experiencia del usuario y la accesibilidad del contenido."
    ],
    "points": 272,
    "commentCount": 213,
    "retryCount": 0,
    "time": 1721828482
  },
  {
    "id": 41051327,
    "title": "Puedes optar por no participar en los escaneos faciales del aeropuerto",
    "originLink": "https://www.vox.com/future-perfect/360952/summer-travel-airport-facial-recognition-scan",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41051327",
    "commentBody": "",
    "originSummary": [
      "Los viajeros pueden optar por no utilizar el reconocimiento facial en el aeropuerto alejándose de la cámara, presentando su identificación y diciendo: 'No acepto el uso de biometría.'",
      "La campaña “Freedom Flyers” de la Liga de Justicia Algorítmica tiene como objetivo concienciar sobre este derecho, especialmente ahora que la TSA planea expandir el reconocimiento facial a todos los aeropuertos de EE. UU.",
      "El reconocimiento facial plantea riesgos como violaciones de datos, identificación errónea, sesgo de IA y la normalización de la vigilancia, con importantes preocupaciones de privacidad sobre la retención y el uso de datos biométricos."
    ],
    "commentSummary": [
      "Las experiencias al optar por no someterse a los escaneos faciales en los aeropuertos varían significativamente, con algunos usuarios enfrentando resistencia y otros sin encontrar problemas.",
      "Las cámaras avanzadas en los aeropuertos capturan imágenes en 3D para una alta precisión en el reconocimiento facial, lo que genera preocupaciones sobre la retención de datos faciales y la vigilancia generalizada.",
      "La discusión continúa sobre si optar por no participar es esencial para resistir la normalización de las prácticas de vigilancia o si es inútil debido a la ubicuidad de dichas tecnologías."
    ],
    "points": 258,
    "commentCount": 232,
    "retryCount": 0,
    "time": 1721771409
  },
  {
    "id": 41058261,
    "title": "CrowdStrike ofrece una tarjeta de regalo de $10 como disculpa por la interrupción",
    "originLink": "https://techcrunch.com/2024/07/24/crowdstrike-offers-a-10-apology-gift-card-to-say-sorry-for-outage/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41058261",
    "commentBody": "",
    "originSummary": [
      "CrowdStrike, una empresa de ciberseguridad, causó una interrupción global el 19 de julio debido a una actualización defectuosa, afectando a millones de computadoras y provocando interrupciones significativas como retrasos en aeropuertos y cirugías detenidas.",
      "Como disculpa, la empresa ofreció tarjetas de regalo de Uber Eats de $10 a sus socios, pero algunos destinatarios informaron que los vales eran inválidos.",
      "CrowdStrike's CEO y el director de seguridad emitieron disculpas públicas, reconociendo la gravedad del incidente y comprometiéndose a la transparencia y a medidas de prevención futuras."
    ],
    "commentSummary": [
      "CrowdStrike emitió tarjetas de regalo de $10 de Uber Eats para disculparse por una interrupción, pero muchos usuarios encontraron los vales inválidos, lo que llevó a críticas y especulaciones sobre la competencia de la empresa.",
      "Algunos usuarios sospechaban que el problema de la tarjeta de regalo podría ser un intento de phishing o un hackeo, lo que dañaba aún más la reputación de CrowdStrike.",
      "La acción fue percibida como inadecuada e insultante, especialmente dado el impacto significativo del corte en servicios críticos como aerolíneas y hospitales, lo que provocó debates sobre posibles responsabilidades legales."
    ],
    "points": 237,
    "commentCount": 128,
    "retryCount": 0,
    "time": 1721836179
  },
  {
    "id": 41053329,
    "title": "Cómo se ve el \"consentimiento\" para la DEA y la TSA",
    "originLink": "https://papersplease.org/wp/2024/07/23/what-consent-really-looks-like-for-the-dea-and-tsa/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41053329",
    "commentBody": "",
    "originSummary": [
      "La DEA y la TSA han estado colaborando para incautar el dinero de los viajeros al apuntar a aquellos que llevan grandes cantidades de efectivo, utilizando informantes y puntos de control de la TSA para identificar a las personas y alegando que estas \"consienten\" los registros.",
      "Esta práctica, que se extiende a los trenes de Amtrak con la ayuda de la Oficina de Aduanas y Protección Fronteriza de EE. UU., implica la \"incautación civil\" donde se confisca dinero sin una orden judicial, a menudo ignorando la negativa de los pasajeros a dar su consentimiento.",
      "Una demanda colectiva en curso destaca la frecuencia de estas búsquedas ilegales, con los demandantes argumentando que el volumen de registros indica un problema sistémico, a pesar de la resistencia de la DEA y la TSA a divulgar estos registros."
    ],
    "commentSummary": [
      "Una boda fue interrumpida por una inundación repentina, lo que requirió una operación de rescate, aunque no hubo lesiones graves.",
      "Antes de trasladarlos a un refugio en una escuela secundaria, la policía detuvo a los asistentes en autobuses con perros detectores de drogas, lo que aumentó su angustia.",
      "La incidencia provocó un debate sobre el abuso de poder por parte de las fuerzas del orden, la incautación de bienes civiles y la guerra contra las drogas, destacando la necesidad de reformas y su impacto en la confianza y seguridad pública."
    ],
    "points": 216,
    "commentCount": 175,
    "retryCount": 0,
    "time": 1721790975
  },
  {
    "id": 41053201,
    "title": "Llama 3.1 en C",
    "originLink": "https://github.com/trholding/llama2.c/blob/master/runq.c",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41053201",
    "commentBody": "",
    "originSummary": [
      "Se ha lanzado una nueva implementación en C para la inferencia en los modelos Transformer Llama 2 y Llama 3/3.1, que presenta un paso de avance cuantizado en int8.",
      "La codificación incluye soporte para varios entornos como el Kernel de Linux, Unikraft Unikernel y modelos embebidos a través de Zip Archive.",
      "Los usuarios pueden personalizar parámetros como la temperatura, el muestreo top-p y la versión del modelo a través de argumentos de línea de comandos, mejorando la flexibilidad para diferentes casos de uso."
    ],
    "commentSummary": [
      "Los modelos Llama 3.1 de Meta pueden generar texto multilingüe, pero la implementación actual en C todavía tiene errores y requiere un mayor refinamiento.",
      "La tarea implica cuantificar el modelo a 8 bits, lo que puede degradar la calidad de salida, humorísticamente referido como 'daño cerebral'.",
      "La comunidad está contribuyendo activamente a mejorar la implementación, con discusiones sobre métodos de cuantificación óptimos y la extensión de la longitud del contexto utilizando nuevas técnicas de escalado."
    ],
    "points": 179,
    "commentCount": 29,
    "retryCount": 0,
    "time": 1721789384
  },
  {
    "id": 41052593,
    "title": "La creación de Emacs en 1976",
    "originLink": "https://onlisp.co.uk/On-the-Origin-of-Emacs-in-1976.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41052593",
    "commentBody": "",
    "originSummary": [
      "EMACS, un editor de texto, fue desarrollado en el Laboratorio de Inteligencia Artificial del MIT en 1976, con Richard Stallman (RMS) convirtiéndose en el desarrollador principal a finales de ese año.",
      "RMS nombró \"E\" y \"EMACS\" y jugó un papel crucial en la transformación de los macros de TECO en un editor poderoso, con la ayuda inicial de Guy Steele, David Moon y John Kulp.",
      "La comunidad de usuarios tempranos, incluyendo a Moon, contribuyó a las combinaciones de teclas y nombres de comandos, destacando la naturaleza colaborativa y orientada a la comunidad del desarrollo de EMACS."
    ],
    "commentSummary": [
      "En 1976, MIT-AI utilizó \"at\" en lugar del símbolo @ para las direcciones de correo electrónico debido a la ausencia del DNS (Sistema de Nombres de Dominio).",
      "Los primeros científicos de la computación preferían formatos de fecha claros como \"dd MON yy\" y discutían los primeros sistemas de archivos en red y protocolos como MLDEV y SUPDUP.",
      "Emacs, un editor de texto inicialmente escrito en TECO, evolucionó con las contribuciones de desarrolladores como James Gosling, quien creó una versión para Unix en 1981."
    ],
    "points": 176,
    "commentCount": 76,
    "retryCount": 0,
    "time": 1721782166
  },
  {
    "id": 41052371,
    "title": "Scrapscript: Un lenguaje de programación funcional y direccionable por contenido",
    "originLink": "https://github.com/tekknolagi/scrapscript",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41052371",
    "commentBody": "",
    "originSummary": [
      "Scrapscript es un lenguaje de programación con un intérprete disponible para Python 3.8+ y Cosmopolitan, y admite Docker para la ejecución en contenedores.",
      "La sintaxis de Scrapscript se actualizará pronto, y los usuarios pueden consultar `scrapscript.py` y sus pruebas para entender el lenguaje.",
      "Un compilador experimental está disponible, capaz de producir salidas en formatos ELF, Cosmopolitan y Wasm, con comandos específicos proporcionados para cada uno."
    ],
    "commentSummary": [
      "Scrapscript es un nuevo lenguaje de programación funcional y direccionable por contenido, diseñado para abordar problemas de compartibilidad de software utilizando tipos, funciones y referencias con hash similares a JSON.",
      "Al contrario de Unison, que utiliza un paradigma basado en git, Scrapscript es más ambicioso y se centra en IPFS (Sistema de Archivos InterPlanetario) para la identificación y serialización de código.",
      "La lengua ha ganado atención debido a su desarrollo público y al viaje personal de su creador, quien superó el alcoholismo mientras trabajaba en el proyecto."
    ],
    "points": 176,
    "commentCount": 32,
    "retryCount": 0,
    "time": 1721779701
  },
  {
    "id": 41056387,
    "title": "Obtuviste un resultado nulo. ¿Alguien lo publicará?",
    "originLink": "https://www.nature.com/articles/d41586-024-02383-9",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41056387",
    "commentBody": "",
    "originSummary": [
      "Los investigadores enfrentan desafíos al publicar resultados nulos, que no muestran una relación significativa entre variables, lo que lleva a un sesgo a favor de los hallazgos positivos.",
      "Este sesgo de publicación distorsiona el registro científico y desperdicia recursos, como se observa en el estudio inconcluso de la bióloga evolutiva Natalie Pilakouta sobre las preferencias de los peces en las aguas termales de Islandia.",
      "Los esfuerzos para abordar este problema incluyen que las revistas fomenten los informes pre-registrados, pero la adopción lenta y la percepción de que los resultados nulos indican una investigación defectuosa siguen siendo obstáculos significativos."
    ],
    "commentSummary": [
      "La discusión destaca los desafíos y la falta de incentivos para publicar resultados nulos en la investigación científica, a pesar de su valor potencial.",
      "Una parte significativa de los científicos está dispuesta a publicar resultados nulos, pero muy pocos pueden hacerlo debido a barreras sistémicas y a la falta de demanda por parte de revistas de alto nivel.",
      "Las sugerencias incluyen la creación de revistas dedicadas a los resultados nulos, la integración de los resultados nulos como apéndices a las publicaciones principales y la mejora del proceso de revisión por pares para incluir la preinscripción de métodos."
    ],
    "points": 166,
    "commentCount": 99,
    "retryCount": 0,
    "time": 1721824500
  },
  {
    "id": 41052934,
    "title": "We made glhf.chat – run almost any open-source LLM, including 405B",
    "originLink": "https://glhf.chat/landing/home",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41052934",
    "commentBody": "",
    "originSummary": [
      "Un nuevo sitio web, https://glhf.chat/, permite a los usuarios ejecutar casi cualquier LLM (Modelo de Lenguaje Grande) de código abierto en clústeres de GPU con escalado automático de forma gratuita durante la fase de determinación de precios.",
      "El servicio es compatible con cualquier modelo compatible con el proyecto de código abierto vLLM, ofreciendo hasta ~640GB de VRAM, y tiene como objetivo ser más rentable que otros servicios de GPU al ejecutar modelos multi-inquilino.",
      "La plataforma se lanzó en el Día de Lanzamiento de Llama-3.1-405B y admite modelos eficientes como los ajustes finos de Llama-3-70b, con planes para mejorar el soporte para modelos más grandes y abordar las limitaciones actuales."
    ],
    "commentSummary": [
      "glhf.chat permite a los usuarios ejecutar casi cualquier LLM (Modelo de Lenguaje Grande) de código abierto en clústeres de GPU con escalado automático, actualmente gratis mientras determinan los precios.",
      "La plataforma admite cualquier modelo compatible con el proyecto de código abierto vLLM, incluidos modelos populares como Llama-3-70b finetunes, con algunas limitaciones debido a problemas con NVLink.",
      "Launched on Llama-3.1-405B Launch Day, the platform aims to be cost-effective by running models in a multi-tenant environment and welcomes user feedback."
    ],
    "points": 152,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1721785929
  },
  {
    "id": 41052446,
    "title": "Pnut: Un compilador de C a shell POSIX en el que puedes confiar",
    "originLink": "https://pnut.sh",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41052446",
    "commentBody": "",
    "originSummary": [
      "Pnut es un transpilador de C a shell POSIX que convierte programas en C en scripts de shell legibles por humanos, asegurando una alta portabilidad en shells compatibles con POSIX.",
      "Permite a los desarrolladores escribir scripts en C sin necesidad de aprender un nuevo lenguaje, y la salida es fácil de inspeccionar, depurar y mantener.",
      "Pnut se ejecuta en todos los sistemas operativos principales, incluidos Linux, macOS y Windows, y está licenciado bajo la Licencia BSD-2 Clause."
    ],
    "commentSummary": [
      "Pnut es un compilador de C a shell POSIX que puede distribuirse como un script de shell legible por humanos, lo que permite construcciones reproducibles a partir de archivos fuente.",
      "Puede compilarse a sí mismo y, con esfuerzo, el Tiny C Compiler (TCC), que luego puede iniciar el GNU Compiler Collection (GCC), creando una cadena de herramientas de compilación completa.",
      "Si bien es elogiado por su innovación, Pnut enfrenta críticas en cuanto a limitaciones prácticas, como el manejo de E/S binaria y ciertos constructos de C, y opiniones variadas sobre su confiabilidad y completitud."
    ],
    "points": 150,
    "commentCount": 94,
    "retryCount": 0,
    "time": 1721780524
  },
  {
    "id": 41053383,
    "title": "MPPP – El primer desastre de 'drogas de diseño' (2023)",
    "originLink": "https://www.chm.bris.ac.uk/motm/mppp/mppph.htm",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41053383",
    "commentBody": "",
    "originSummary": [
      "MPPP (1-metil-4-fenil-4-propionoxipiperidina) es una droga de diseño reportada por primera vez en 1947, destinada a ser un analgésico pero se descubrió que no era mejor que las opciones existentes.",
      "En 1976, Barry Kidston sintetizó MPPP y desarrolló síntomas similares a los del Parkinson debido a una impureza, MPTP, que mata selectivamente las células cruciales para el control motor.",
      "La epidemia de síntomas de Parkinson en 1982 vinculada a la heroína sintética contaminada con MPTP llevó a importantes descubrimientos científicos sobre la enfermedad de Parkinson y destacó los peligros de la síntesis de drogas amateur."
    ],
    "commentSummary": [
      "La discusión se centra en los peligros de las drogas de diseño, particularmente MPPP y su subproducto MPTP, que han sido vinculados a síntomas similares al Parkinson en los usuarios.",
      "Se hace hincapié en los riesgos asociados con las drogas sintéticas, la importancia de la pureza de las drogas y los posibles beneficios de legalizar y regular las drogas para garantizar la seguridad.",
      "Los usuarios comparten experiencias personales y enfatizan la necesidad de precaución y pruebas adecuadas, al tiempo que abordan las implicaciones más amplias de la prohibición de drogas y los desafíos de garantizar un consumo seguro."
    ],
    "points": 139,
    "commentCount": 165,
    "retryCount": 0,
    "time": 1721791960
  },
  {
    "id": 41055230,
    "title": "Micromouse",
    "originLink": "https://en.wikipedia.org/wiki/Micromouse",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41055230",
    "commentBody": "",
    "originSummary": [
      "Micromouse es una competencia de robótica donde pequeños robots autónomos resuelven un laberinto de 16×16, originada a finales de la década de 1970 y popular en varios países, incluyendo el Reino Unido, EE. UU. y Japón.",
      "Los robots utilizan algoritmos como Bellman flood-fill, Dijkstra y A* para la navegación, con velocidades máximas que superan los tres metros por segundo; el récord mundial actual es de 3.921 segundos por Ng Beng Kiat.",
      "Los avances recientes incluyen el uso de ventiladores para obtener mayor carga aerodinámica, permitiendo aceleraciones superiores a 2.5g, y una variante llamada Half-Size Micromouse utiliza un laberinto de 32×32 con dimensiones más pequeñas."
    ],
    "commentSummary": [
      "Micromouse es una competencia de robótica donde pequeños robots navegan por un laberinto, con un video reciente de Veritasium destacando el tema.",
      "La competencia incluye una fase de reconocimiento para mapear el laberinto, y se utilizan diferentes estrategias como seguir la pared y mapear el laberinto.",
      "La actividad involucra a los jóvenes en la programación y la ingeniería, con categorías como robots LEGO y robots más avanzados, demostrando la evolución de la tecnología a lo largo de las décadas."
    ],
    "points": 132,
    "commentCount": 37,
    "retryCount": 0,
    "time": 1721813804
  }
]
