[
  {
    "id": 41050055,
    "title": "Esplosione idrotermale al Parco Nazionale di Yellowstone",
    "originLink": "https://www.jhnewsandguide.com/the_hole_scroll/video-biscuit-basin-geyser-explodes-sending-yellowstone-tourists-packing/article_6862fda2-4923-11ef-b5c4-abdc9bc8cd83.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41050055",
    "commentBody": "",
    "originSummary": [
      "Il Servizio Forestale sta lavorando per chiudere parti del sistema di sentieri Mike Harris.",
      "Il vivaio MD è stato multato per oltre $28.000 a causa della morte di un uomo in una trincea.",
      "Un'esplosione idrotermale a Biscuit Basin nello Yellowstone ha causato la fuga dei turisti."
    ],
    "commentSummary": [
      "Un'esplosione idrotermale si è verificata nel Parco Nazionale di Yellowstone nell'area termale di Biscuit Basin, danneggiando la passerella ma senza causare feriti.",
      "Esplosione è avvenuta vicino alla Black Diamond Pool ed è stata registrata dai visitatori, portando a chiusure temporanee nell'area per motivi di sicurezza.",
      "Gli esperti sottolineano che tali eventi idrotermali locali non sono indicativi di attività nella più grande Caldera di Yellowstone (supervulcano)."
    ],
    "points": 513,
    "commentCount": 273,
    "retryCount": 0,
    "time": 1721764184
  },
  {
    "id": 41058107,
    "title": "Abbastanza grande – Mistral AI",
    "originLink": "https://mistral.ai/news/mistral-large-2407/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41058107",
    "commentBody": "",
    "originSummary": [
      "Mistral AI ha rilasciato il modello Mistral Large 2, caratterizzato da una finestra di contesto di 128k e supporto per oltre 80 linguaggi di programmazione, ottimizzato per l'inferenza su singolo nodo con 123 miliardi di parametri.",
      "Il modello raggiunge un'accuratezza dell'84,0% su MMLU, superando i modelli precedenti e rivali come GPT-4o e Llama 3 405B, con capacità migliorate per ridurre le \"allucinazioni\" e migliorare il ragionamento.",
      "Mistral Large 2 è disponibile con diverse licenze per uso non commerciale e commerciale, con i pesi ospitati su HuggingFace e partnership di servizi cloud ampliati, tra cui Google Cloud Platform e Azure AI Studio."
    ],
    "commentSummary": [
      "Mistral AI's new model, Large 2, e Llama 3.1 405B di Meta sono stati testati e si sono rivelati comparabili, senza un chiaro vincitore.",
      "Gli utenti hanno evidenziato che Claude rimane un'opzione valida ma hanno espresso il desiderio di miglioramenti come risposte più intelligenti, finestre di contesto più lunghe e risposte più rapide.",
      "Nonostante alcuni modelli abbiano difficoltà con compiti semplici a causa di problemi di tokenizzazione, lo sviluppo rapido e la competizione nei modelli di intelligenza artificiale rimangono entusiasmanti, con molti utenti che passano a modelli come Claude Sonnet 3.5 per una migliore performance nella programmazione e in altri compiti."
    ],
    "points": 385,
    "commentCount": 281,
    "retryCount": 0,
    "time": 1721835141
  },
  {
    "id": 41052365,
    "title": "Prendere il controllo del mio trattamento per il diabete",
    "originLink": "https://martin.janiczek.cz/2024/07/23/taking-my-diabetes-treatment-into-my-own-hands.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41052365",
    "commentBody": "",
    "originSummary": [
      "Un diabetico di Tipo 1 ha sviluppato un'applicazione Windows Forms con grafici OxyPlot per visualizzare e gestire meglio l'assunzione di insulina e carboidrati.",
      "Il soggetto ha utilizzato GeneticSharp, una libreria di algoritmi genetici, per ottimizzare i dosaggi di insulina, stabilizzando con successo i livelli di glucosio.",
      "Il metodo mostra potenzialità per la gestione personalizzata del diabete, sebbene siano necessarie ulteriori simulazioni e aggiustamenti per l'insulina a lunga durata d'azione."
    ],
    "commentSummary": [
      "Le persone con diabete stanno condividendo esperienze personali e strategie per gestire la loro condizione, sottolineando l'importanza dell'automonitoraggio e della registrazione dei dati.",
      "Vari metodi discussi includono cambiamenti dietetici, monitoraggio continuo del glucosio (CGM) e monitoraggio personalizzato degli impatti di cibo ed esercizio fisico sui livelli di zucchero nel sangue.",
      "Il dialogo mette in evidenza un sentimento comune di autosufficienza dovuto alle percepite inadeguatezze nella gestione del diabete da parte del sistema sanitario."
    ],
    "points": 292,
    "commentCount": 200,
    "retryCount": 0,
    "time": 1721779619
  },
  {
    "id": 41057033,
    "title": "Google è l'unico motore di ricerca che funziona su Reddit ora, grazie all'accordo sull'IA",
    "originLink": "https://www.404media.co/google-is-the-only-search-engine-that-works-on-reddit-now-thanks-to-ai-deal/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41057033",
    "commentBody": "",
    "originSummary": [
      "Google è ora l'unico motore di ricerca che può visualizzare i risultati recenti di Reddit, rendendo i contenuti di Reddit esclusivi per Google.",
      "Altri motori di ricerca come Bing, DuckDuckGo e Qwant non possono mostrare risultati recenti di Reddit, con DuckDuckGo che fornisce link limitati senza descrizioni.",
      "Questa situazione sottolinea il quasi monopolio di Google sulla ricerca, influenzando la concorrenza e attirando critiche sulla qualità della ricerca, con speculazioni su un accordo da milioni di dollari che permetterebbe a Google di raccogliere dati da Reddit per l'addestramento dell'IA."
    ],
    "commentSummary": [
      "Google è diventato il motore di ricerca esclusivo per Reddit grazie a un nuovo accordo sull'intelligenza artificiale, con il file robots.txt di Reddit che blocca gli altri motori di ricerca dall'indicizzare i suoi contenuti.",
      "Questa decisione ha acceso dibattiti sui suoi effetti sulla concorrenza tra i motori di ricerca e sui principi di un internet aperto.",
      "Preoccupazioni sono state sollevate riguardo alla natura anticoncorrenziale dell'accordo e al suo potenziale impatto negativo sull'esperienza dell'utente e sull'accessibilità dei contenuti."
    ],
    "points": 272,
    "commentCount": 213,
    "retryCount": 0,
    "time": 1721828482
  },
  {
    "id": 41051327,
    "title": "Puoi scegliere di non sottoporti alle scansioni facciali in aeroporto",
    "originLink": "https://www.vox.com/future-perfect/360952/summer-travel-airport-facial-recognition-scan",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41051327",
    "commentBody": "",
    "originSummary": [
      "Viaggiatori possono rinunciare al riconoscimento facciale in aeroporto allontanandosi dalla telecamera, presentando il loro documento d'identità e dichiarando: 'Rinuncio ai biometria.'",
      "Il programma “Freedom Flyers” della Algorithmic Justice League mira a sensibilizzare su questo diritto, soprattutto mentre la TSA prevede di estendere il riconoscimento facciale a tutti gli aeroporti degli Stati Uniti.",
      "Il riconoscimento facciale comporta rischi come violazioni dei dati, identificazioni errate, bias dell'IA e la normalizzazione della sorveglianza, con significative preoccupazioni per la privacy riguardo alla conservazione e all'uso dei dati biometrici."
    ],
    "commentSummary": [
      "Le esperienze con la rinuncia alle scansioni facciali in aeroporto variano significativamente, con alcuni utenti che affrontano resistenze e altri che non incontrano problemi.",
      "Le telecamere avanzate negli aeroporti catturano immagini 3D per un'elevata precisione nel riconoscimento facciale, sollevando preoccupazioni riguardo alla conservazione dei dati facciali e alla sorveglianza pervasiva.",
      "Il dibattito continua su se rinunciare sia essenziale per resistere alla normalizzazione delle pratiche di sorveglianza o se sia inutile a causa dell'ubiquità di tali tecnologie."
    ],
    "points": 258,
    "commentCount": 232,
    "retryCount": 0,
    "time": 1721771409
  },
  {
    "id": 41058261,
    "title": "CrowdStrike offre una carta regalo di scuse da $10 per scusarsi dell'interruzione",
    "originLink": "https://techcrunch.com/2024/07/24/crowdstrike-offers-a-10-apology-gift-card-to-say-sorry-for-outage/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41058261",
    "commentBody": "",
    "originSummary": [
      "CrowdStrike, una società di cybersecurity, ha causato un'interruzione globale il 19 luglio a causa di un aggiornamento difettoso, che ha colpito milioni di computer e ha portato a significativi disagi come ritardi negli aeroporti e interventi chirurgici sospesi.",
      "Come scusa, l'azienda ha offerto buoni regalo Uber Eats da 10 dollari ai suoi partner, ma alcuni destinatari hanno segnalato che i voucher erano invalidi.",
      "CrowdStrike, il CEO e il responsabile della sicurezza hanno rilasciato scuse pubbliche, riconoscendo la gravità dell'incidente e impegnandosi alla trasparenza e a misure preventive future."
    ],
    "commentSummary": [
      "CrowdStrike ha emesso buoni regalo Uber Eats da 10 dollari per scusarsi di un'interruzione, ma molti utenti hanno trovato i voucher non validi, portando a critiche e speculazioni sulla competenza dell'azienda.",
      "Alcuni utenti sospettavano che il problema della carta regalo potesse essere un tentativo di phishing o un attacco hacker, danneggiando ulteriormente la reputazione di CrowdStrike.",
      "Il gesto è stato percepito come inadeguato e offensivo, soprattutto considerando il notevole impatto dell'interruzione sui servizi critici come le compagnie aeree e gli ospedali, suscitando discussioni sulle potenziali responsabilità legali."
    ],
    "points": 237,
    "commentCount": 128,
    "retryCount": 0,
    "time": 1721836179
  },
  {
    "id": 41053329,
    "title": "Che aspetto ha il \"consenso\" per la DEA e la TSA",
    "originLink": "https://papersplease.org/wp/2024/07/23/what-consent-really-looks-like-for-the-dea-and-tsa/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41053329",
    "commentBody": "",
    "originSummary": [
      "DEA e TSA hanno collaborato per sequestrare il denaro dei viaggiatori prendendo di mira coloro che trasportano grandi quantità di contanti, utilizzando informatori e posti di controllo TSA per identificare gli individui e affermando che essi \"consentono\" alle perquisizioni.",
      "Questa pratica, che si estende ai treni Amtrak con l'aiuto della US Customs and Border Protection, comporta il \"sequestro civile\" in cui il denaro viene sequestrato senza un mandato, spesso ignorando il rifiuto dei passeggeri di acconsentire.",
      "Una causa legale collettiva in corso evidenzia la frequenza di queste perquisizioni illegali, con i querelanti che sostengono che il volume dei documenti indica un problema sistemico, nonostante la resistenza della DEA e della TSA a divulgare questi documenti."
    ],
    "commentSummary": [
      "Un matrimonio è stato interrotto da un'inondazione improvvisa, rendendo necessaria un'operazione di salvataggio, sebbene non ci siano stati feriti gravi.",
      "Prima di trasferirli in un rifugio scolastico, la polizia ha trattenuto i partecipanti sugli autobus con cani antidroga, aumentando il loro disagio.",
      "L'incidente ha scatenato una discussione sull'abuso di potere da parte delle forze dell'ordine, sulla confisca dei beni civili e sulla guerra alla droga, evidenziando la necessità di riforme e il loro impatto sulla fiducia e sulla sicurezza pubblica."
    ],
    "points": 216,
    "commentCount": 175,
    "retryCount": 0,
    "time": 1721790975
  },
  {
    "id": 41053201,
    "title": "Llama 3.1 in C",
    "originLink": "https://github.com/trholding/llama2.c/blob/master/runq.c",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41053201",
    "commentBody": "",
    "originSummary": [
      "È stata rilasciata una nuova implementazione basata su C per l'inferenza sui modelli Transformer Llama 2 e Llama 3/3.1, caratterizzata da un passaggio in avanti quantizzato a int8.",
      "Il codice include il supporto per vari ambienti come Linux Kernel, Unikraft Unikernel e modelli embedded tramite Zip Archive.",
      "Gli utenti possono personalizzare parametri come la temperatura, il campionamento top-p e la versione del modello tramite argomenti da riga di comando, migliorando la flessibilità per diversi casi d'uso."
    ],
    "commentSummary": [
      "Le versioni 3.1 di Llama di Meta possono generare testo multilingue, ma l'implementazione attuale in C è ancora difettosa e necessita di ulteriori perfezionamenti.",
      "Il progetto prevede la quantizzazione del modello a 8 bit, il che può degradare la qualità dell'output, scherzosamente definita come \"danno cerebrale\".",
      "La comunità sta contribuendo attivamente a migliorare l'implementazione, con discussioni sui metodi di quantizzazione ottimali e l'estensione della lunghezza del contesto utilizzando nuove tecniche di scalabilità."
    ],
    "points": 179,
    "commentCount": 29,
    "retryCount": 0,
    "time": 1721789384
  },
  {
    "id": 41052593,
    "title": "L'origine di Emacs nel 1976",
    "originLink": "https://onlisp.co.uk/On-the-Origin-of-Emacs-in-1976.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41052593",
    "commentBody": "",
    "originSummary": [
      "EMACS, un editor di testo, è stato sviluppato presso il MIT AI Lab nel 1976, con Richard Stallman (RMS) che è diventato il principale sviluppatore entro la fine di quell'anno.",
      "RMS chiamato \"E\" e \"EMACS\" e ha svolto un ruolo cruciale nella trasformazione delle macro TECO in un potente editor, con l'aiuto iniziale di Guy Steele, David Moon e John Kulp.",
      "Le prime comunità di utenti, inclusa Moon, contribuirono ai tasti di scelta rapida e ai nomi dei comandi, evidenziando la natura collaborativa e guidata dalla comunità dello sviluppo di EMACS."
    ],
    "commentSummary": [
      "In 1976, MIT-AI usava \"at\" invece del simbolo @ per gli indirizzi email a causa dell'assenza del DNS (Domain Name System).",
      "All'inizio, gli scienziati informatici preferivano formati di data chiari come \"gg MMM aa\" e discutevano dei primi sistemi di file di rete e protocolli come MLDEV e SUPDUP.",
      "Emacs, un editor di testo inizialmente scritto in TECO, si è evoluto con i contributi di sviluppatori come James Gosling, che ha creato una versione Unix nel 1981."
    ],
    "points": 176,
    "commentCount": 76,
    "retryCount": 0,
    "time": 1721782166
  },
  {
    "id": 41052371,
    "title": "Scrapscript: Un linguaggio di programmazione funzionale e indirizzabile per contenuti",
    "originLink": "https://github.com/tekknolagi/scrapscript",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41052371",
    "commentBody": "",
    "originSummary": [
      "Scrapscript è un linguaggio di programmazione con un interprete disponibile per Python 3.8+ e Cosmopolitan, e supporta Docker per l'esecuzione containerizzata.",
      "Si prevede che la sintassi di Scrapscript verrà aggiornata presto, e gli utenti possono fare riferimento a `scrapscript.py` e ai suoi test per comprendere il linguaggio.",
      "È disponibile un compilatore sperimentale, capace di produrre output nei formati ELF, Cosmopolitan e Wasm, con comandi specifici forniti per ciascuno."
    ],
    "commentSummary": [
      "Scrapscript è un nuovo linguaggio di programmazione funzionale, indirizzabile per contenuto, progettato per affrontare i problemi di condivisione del software utilizzando tipi simili a JSON, funzioni e riferimenti hash.",
      "Al contrario di Unison, che utilizza un paradigma basato su git, Scrapscript è più ambizioso e si concentra su IPFS (InterPlanetary File System) per l'identificazione e la serializzazione del codice.",
      "Il linguaggio ha attirato l'attenzione grazie al suo sviluppo pubblico e al percorso personale del suo creatore, che ha superato l'alcolismo mentre lavorava al progetto."
    ],
    "points": 176,
    "commentCount": 32,
    "retryCount": 0,
    "time": 1721779701
  },
  {
    "id": 41056387,
    "title": "Avete ottenuto un risultato nullo. Qualcuno lo pubblicherà?",
    "originLink": "https://www.nature.com/articles/d41586-024-02383-9",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41056387",
    "commentBody": "",
    "originSummary": [
      "Ricercatori affrontano sfide nella pubblicazione di risultati nulli, che non mostrano alcuna relazione significativa tra le variabili, portando a un bias a favore dei risultati positivi.",
      "Questo bias di pubblicazione distorce il registro scientifico e spreca risorse, come si vede nello studio inconcludente della biologa evoluzionista Natalie Pilakouta sulle preferenze dei pesci nelle sorgenti termali islandesi.",
      "Gli sforzi per affrontare questo problema includono le riviste che incoraggiano i rapporti pre-registrati, ma l'adozione lenta e la percezione che i risultati nulli indichino una ricerca difettosa rimangono ostacoli significativi."
    ],
    "commentSummary": [
      "Il dibattito mette in evidenza le sfide e la mancanza di incentivi per la pubblicazione di risultati nulli nella ricerca scientifica, nonostante il loro potenziale valore.",
      "Una parte significativa degli scienziati è disposta a pubblicare risultati nulli, ma pochissimi riescono a farlo a causa di barriere sistemiche e della mancanza di domanda da parte delle riviste di alto livello.",
      "Le proposte includono la creazione di riviste dedicate ai risultati nulli, l'integrazione dei risultati nulli come appendici alle pubblicazioni principali e il miglioramento del processo di revisione tra pari per includere la pre-registrazione dei metodi."
    ],
    "points": 166,
    "commentCount": 99,
    "retryCount": 0,
    "time": 1721824500
  },
  {
    "id": 41052934,
    "title": "Abbiamo creato glhf.chat – esegui quasi qualsiasi LLM open-source, incluso 405B",
    "originLink": "https://glhf.chat/landing/home",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41052934",
    "commentBody": "",
    "originSummary": [
      "Un nuovo sito web, https://glhf.chat/, consente agli utenti di eseguire quasi qualsiasi LLM (Large Language Model) open-source su cluster GPU autoscalabili gratuitamente durante la fase di determinazione dei prezzi.",
      "Il servizio supporta qualsiasi modello compatibile con il progetto open-source vLLM, offrendo fino a ~640GB di VRAM, e mira a essere più conveniente rispetto ad altri servizi GPU eseguendo modelli multi-tenant.",
      "Il lancio della piattaforma è avvenuto nel giorno del lancio di Llama-3.1-405B e supporta modelli efficienti come le finetune di Llama-3-70b, con piani per migliorare il supporto per modelli più grandi e affrontare le limitazioni attuali."
    ],
    "commentSummary": [
      "glhf.chat consente agli utenti di eseguire quasi qualsiasi LLM (Large Language Model) open-source su cluster GPU autoscalabili, attualmente gratuiti mentre determinano i prezzi.",
      "Il servizio supporta qualsiasi modello compatibile con il progetto open-source vLLM, inclusi modelli popolari come Llama-3-70b finetunes, con alcune limitazioni dovute a problemi di NVLink.",
      "La piattaforma, lanciata il giorno del lancio di Llama-3.1-405B, mira a essere conveniente gestendo i modelli in un ambiente multi-tenant e accoglie i feedback degli utenti."
    ],
    "points": 152,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1721785929
  },
  {
    "id": 41052446,
    "title": "Pnut: Un compilatore da C a shell POSIX di cui ti puoi fidare",
    "originLink": "https://pnut.sh",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41052446",
    "commentBody": "",
    "originSummary": [
      "Pnut è un transpiler da C a shell POSIX che converte i programmi C in script di shell leggibili dall'uomo, garantendo un'alta portabilità tra le shell conformi a POSIX.",
      "Permette agli sviluppatori di scrivere script in C senza dover imparare un nuovo linguaggio, e l'output è facile da ispezionare, debug e mantenere.",
      "Pnut funziona su tutti i principali sistemi operativi, inclusi Linux, macOS e Windows, ed è concesso in licenza sotto la BSD-2 Clause License."
    ],
    "commentSummary": [
      "Pnut è un compilatore da C a shell POSIX che può essere distribuito come script di shell leggibile dall'uomo, consentendo build riproducibili dai file sorgente.",
      "Può compilare se stesso e, con sforzo, il Tiny C Compiler (TCC), che può poi avviare la GNU Compiler Collection (GCC), creando una catena di strumenti di build completa.",
      "Pur lodato per la sua innovazione, Pnut affronta critiche riguardanti limitazioni pratiche, come la gestione dell'I/O binario e di alcune strutture del C, e opinioni divergenti sulla sua affidabilità e completezza."
    ],
    "points": 150,
    "commentCount": 94,
    "retryCount": 0,
    "time": 1721780524
  },
  {
    "id": 41053383,
    "title": "MPPP – Il primo disastro delle 'designer drug' (2023)",
    "originLink": "https://www.chm.bris.ac.uk/motm/mppp/mppph.htm",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41053383",
    "commentBody": "",
    "originSummary": [
      "MPPP (1-metil-4-fenil-4-propionossipiperidina) è una droga di design riportata per la prima volta nel 1947, destinata come analgesico ma risultata non migliore delle opzioni esistenti.",
      "In 1976, Barry Kidston sintetizzò MPPP e sviluppò sintomi simili al Parkinson a causa di un'impurità, MPTP, che uccide selettivamente le cellule cruciali per il controllo motorio.",
      "Il focolaio del 1982 di sintomi parkinsoniani legati all'eroina sintetica contaminata da MPTP ha portato a significativi approfondimenti scientifici sulla malattia di Parkinson e ha evidenziato i pericoli della sintesi amatoriale di droghe."
    ],
    "commentSummary": [
      "Il dibattito si concentra sui pericoli delle droghe sintetiche, in particolare MPPP e il suo sottoprodotto MPTP, che sono stati collegati a sintomi simili al Parkinson negli utenti.",
      "Si pone l'accento sui rischi associati alle droghe sintetiche, sull'importanza della purezza delle droghe e sui potenziali benefici della legalizzazione e regolamentazione delle droghe per garantire la sicurezza.",
      "Gli utenti condividono esperienze personali e sottolineano la necessità di cautela e di test adeguati, affrontando anche le implicazioni più ampie della proibizione delle droghe e le sfide per garantire un consumo sicuro."
    ],
    "points": 139,
    "commentCount": 165,
    "retryCount": 0,
    "time": 1721791960
  },
  {
    "id": 41055230,
    "title": "Micromouse",
    "originLink": "https://en.wikipedia.org/wiki/Micromouse",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41055230",
    "commentBody": "",
    "originSummary": [
      "Micromouse è una competizione di robotica in cui piccoli robot autonomi risolvono un labirinto di 16×16, nata alla fine degli anni '70 e popolare in diversi paesi tra cui il Regno Unito, gli Stati Uniti e il Giappone.",
      "Robot utilizzano algoritmi come Bellman flood-fill, Dijkstra e A* per la navigazione, con velocità massime che superano i tre metri al secondo; l'attuale record mondiale è di 3,921 secondi di Ng Beng Kiat.",
      "Recenti progressi includono l'uso di ventole per una maggiore deportanza, consentendo accelerazioni superiori a 2,5g, e una variante chiamata Half-Size Micromouse utilizza un labirinto 32×32 con dimensioni ridotte."
    ],
    "commentSummary": [
      "Micromouse è una competizione di robotica in cui piccoli robot navigano in un labirinto, con un recente video di Veritasium che mette in evidenza l'argomento.",
      "Il concorso include una fase di ricognizione per mappare il labirinto, e vengono utilizzate diverse strategie come il seguire i muri e la mappatura del labirinto.",
      "Il evento coinvolge i giovani nella programmazione e nell'ingegneria, con categorie come robot LEGO e robot più avanzati, dimostrando l'evoluzione della tecnologia nel corso dei decenni."
    ],
    "points": 132,
    "commentCount": 37,
    "retryCount": 0,
    "time": 1721813804
  }
]
