[
  {
    "id": 41805446,
    "title": "انفجار فقاعة تأجير وحدات معالجة الرسومات: $2 H100s",
    "originLink": "https://www.latent.space/p/gpu-bubble",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41805446",
    "commentBody": "",
    "originSummary": [
      "شهد سوق وحدات معالجة الرسوميات (GPU) انخفاضًا كبيرًا في الأسعار، حيث انخفضت أسعار وحدات H100 من 8 دولارات في الساعة إلى أقل من 2 دولار في الساعة بسبب فائض العرض وتغير ديناميكيات الطلب. تشمل العوامل التي تسهم في هذا التحول إعادة بيع الحوسبة المحجوزة، وضبط النماذج المفتوحة، وانخفاض عدد شركات النماذج الأساسية الجديدة، مما يجعل استئجار وحدات معالجة الرسوميات أكثر تفضيلًا من شرائها. يؤثر ظهور النماذج ذات الأوزان المفتوحة والبدائل الأكثر تكلفة، مثل وحدات معالجة الرسوميات من AMD وIntel، على السوق، مع تزايد التركيز على استدلال الذكاء الاصطناعي وضبطه، مدعومًا بمنصات مثل Featherless.AI التي تقدم حلول ذكاء اصطناعي فعالة من حيث التكلفة."
    ],
    "commentSummary": [
      "شهد سوق تأجير وحدات معالجة الرسوميات (GPU) انخفاضًا كبيرًا في أسعار وحدات H100، حيث انخفضت من 8 دولارات في الساعة إلى 2 دولار في الساعة، وذلك بسبب زيادة العرض وانخفاض الطلب من شركات النماذج الأساسية الجديدة.",
      "أدى تخفيض الأسعار هذا إلى انفجار فقاعة تأجير وحدات معالجة الرسومات، مما أثر على المستثمرين الذين استثمروا بشكل كبير في البنية التحتية لوحدات معالجة الرسومات.",
      "يستكشف المقال إمكانية وجود مشهد ذكاء اصطناعي أكثر سهولة مع خيارات حساب أرخص، على الرغم من أن الاستدامة طويلة الأجل لهذه الأسعار المنخفضة ومستقبل البنية التحتية للذكاء الاصطناعي غير مؤكدين."
    ],
    "points": 351,
    "commentCount": 241,
    "retryCount": 0,
    "time": 1728613182
  },
  {
    "id": 41805706,
    "title": "تاكسي روبوت تسلا",
    "originLink": "https://www.tesla.com/we-robot",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41805706",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "عرضت تسلا مؤخرًا سيارة الأجرة الروبوتية الخاصة بها، مسلطة الضوء على رؤية لسيارات الأجرة الذاتية القيادة التي تتناقض مع نهج وايمو، الذي يستخدم أجهزة مكلفة مثل ليدار. يشير تصميم سيارة الأجرة الروبوتية، الذي يفتقر إلى عجلة القيادة، إلى مستقبل يعتمد على القيادة الذاتية الكاملة، رغم أنه يواجه تحديات تنظيمية وتكنولوجية. تعتبر تقنية القيادة الذاتية الكاملة (FSD) من تسلا موضوعًا للنقاش، حيث يشكك النقاد في جاهزيتها للقيادة غير المراقبة بينما يتفاءل المؤيدون بإمكاناتها."
    ],
    "points": 251,
    "commentCount": 649,
    "retryCount": 0,
    "time": 1728617065
  },
  {
    "id": 41809698,
    "title": "ابدأ في تعطيل الإضافات المثبتة التي لا تزال تستخدم Manifest V2 في إصدار Chrome المستقر",
    "originLink": "https://developer.chrome.com/docs/extensions/develop/migrate/mv2-deprecation-timeline",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41809698",
    "commentBody": "",
    "originSummary": [
      "تقوم جوجل بالتخلص التدريجي من Manifest V2 لملحقات كروم، مع بدء التحذيرات وتعطيل هذه الملحقات على القنوات غير المستقرة اعتبارًا من 9 أكتوبر 2024.",
      "يُشجع المستخدمون على الانتقال إلى بدائل Manifest V3، مع منح المؤسسات حتى يونيو 2025 لإكمال الانتقال باستخدام سياسة ExtensionManifestV2Availability.",
      "بدأت عملية التخلص التدريجي في 3 يونيو 2024، ولم يقبل متجر كروم الإلكتروني إضافات Manifest V2 الجديدة منذ يونيو 2022 للإضافات الخاصة ويناير 2022 للإضافات العامة أو غير المدرجة."
    ],
    "commentSummary": [
      "يتحول متصفح كروم من الإضافات التي تعتمد على Manifest V2 إلى Manifest V3، مما يؤثر على أدوات حجب الإعلانات مثل uBlock Origin عن طريق تقليل قدراتها. بينما يقوم كروم بهذا التحول، تعتزم متصفحات مثل فايرفوكس، فيفالدي، وبريف الاستمرار في دعم Manifest V2 في الوقت الحالي. وقد أثار هذا التغيير مناقشات حول تحكم المستخدم والخصوصية، حيث يفكر بعض المستخدمين في التحول إلى متصفحات بديلة للحفاظ على ميزات حجب الإعلانات الفعالة."
    ],
    "points": 198,
    "commentCount": 194,
    "retryCount": 0,
    "time": 1728656426
  },
  {
    "id": 41808696,
    "title": "مترجم Lisp إلى RISC-V مكتوب بلغة Lisp",
    "originLink": "http://www.ulisp.com/show?4Y20",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41808696",
    "commentBody": "",
    "originSummary": [
      "uLisp هو نسخة من لغة البرمجة Lisp مصممة للميكروكنترولرز، وتدعم منصات مثل Arduino وRaspberry Pi وESP32. تتضمن ميزات مثل التصحيح، واجهة بطاقة SD، وواجهات تسلسلية I2C/SPI، مع أمثلة لتطبيقات مثل وميض LED وتسجيل البيانات. ميزة هامة هي المترجم Lisp لـ RISC-V، الذي يقوم بترجمة دوال Lisp إلى كود الآلة، ويدعم الدوال التكرارية وتحسين استدعاء الذيل لتحسين الأداء."
    ],
    "commentSummary": [
      "يوجد قيد التطوير مترجم للغة Lisp مخصص لمعمارية RISC-V ومكتوب بلغة Lisp، ولكنه يفتقر إلى بعض العمليات والوظائف ليكون قادرًا على تجميع نفسه. يدعم المترجم الوظائف الأساسية للغة Lisp مثل car وcdr، ولكنه لم يكتمل بعد. يتم تسليط الضوء على uLisp لبساطته وملاءمته للميكروكنترولر، حيث تعتبر RISC-V منصة جذابة لعشاق التكنولوجيا والمخترقين."
    ],
    "points": 192,
    "commentCount": 29,
    "retryCount": 0,
    "time": 1728647817
  },
  {
    "id": 41807681,
    "title": "جائزة نوبل للسلام لعام 2024 مُنحت لمنظمة نيهون هيدانكيو",
    "originLink": "https://www.nobelprize.org/press-release-peace-2024/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41807681",
    "commentBody": "",
    "originSummary": [
      "تم منح جائزة نوبل للسلام لعام 2024 لمنظمة نيهون هيدانكيو اليابانية، وهي منظمة تضم الناجين من القنابل الذرية، والمعروفة باسم هيروشيما، وذلك لجهودهم في الدعوة لعالم خالٍ من الأسلحة النووية. - لقد ساهم الهيروشيما بشكل كبير في تأسيس \"التابو النووي\"، وهو معيار عالمي ضد استخدام الأسلحة النووية، من خلال شهاداتهم المؤثرة. - يتماشى هذا الاعتراف مع رؤية ألفريد نوبل في تكريم الجهود التي تفيد الإنسانية ويستمر في إلهام الأجيال الجديدة نحو نزع السلاح النووي."
    ],
    "commentSummary": [
      "تم منح جائزة نوبل للسلام لعام 2024 لمنظمة نيهون هيدانكيو اليابانية التي تدعو ضد الأسلحة النووية، مما يبرز التهديد المستمر للأسلحة النووية وسط التوترات العالمية. - تعمل هذه الجائزة كتذكير بالتأثير المدمر للحرب النووية، كما يتضح من هيروشيما وناجازاكي، وتؤكد على أهمية نزع السلاح. - كما تتضمن مناقشة الجائزة تعقيدات الردع النووي والقانون الدولي والديناميات الجيوسياسية بين القوى النووية."
    ],
    "points": 180,
    "commentCount": 238,
    "retryCount": 0,
    "time": 1728637314
  },
  {
    "id": 41805391,
    "title": "بدائل ووردبريس",
    "originLink": "https://darn.es/wordpress-alternatives/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41805391",
    "commentBody": "",
    "originSummary": [
      "تم تحديث المقالة لتشمل المزيد من بدائل أنظمة إدارة المحتوى (CMS) نظرًا لزيادة الاهتمام، خاصة في ضوء الوضع الحالي لـ WordPress. - تتضمن القائمة خيارات CMS قابلة للتنزيل مثل Ghost وKirby وIndiekit وCraft CMS وClassicPress وStatamic وWagtail وTextpattern، مع استثناء أنظمة CMS القائمة على API وgit. - تشمل الإشارات البارزة Ghost لميزاته المدمجة في البريد الإلكتروني، وKirby لنهجه القائم على الملفات، وClassicPress كفرع من WordPress يقوده المجتمع، بينما لم تعد بعض أنظمة CMS مثل Anchor مدعومة."
    ],
    "commentSummary": [
      "يُوصى باستخدام Jekyll على GitHub Pages للمدونات البسيطة التي تستخدم Markdown، حيث يوفر سهولة في الاستخدام دون الحاجة إلى إعداد محلي ويسمح بنقل المحتوى عبر المنصات.",
      "تشمل البدائل لبرنامج ووردبريس للتدوين كل من Chyrp Lite وTypecho وQuartz وLogseq، بينما توفر Drupal وProcessWire وWagtail مرونة أكبر للمطورين.",
      "أصبحت مولدات المواقع الثابتة مثل Astro وPublii تزداد شعبية، وللاستضافة الصور، يُقترح استخدام خيارات مثل S3+Cloudfront أو CloudFlare."
    ],
    "points": 144,
    "commentCount": 106,
    "retryCount": 0,
    "time": 1728612210
  },
  {
    "id": 41808917,
    "title": "قتلت Google Play لعبتي ولن تخبرني بالسبب",
    "originLink": "https://antiidlereborn.com/news/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41808917",
    "commentBody": "",
    "originSummary": [
      "توكّون، مطور ألعاب مستقل، كان يعمل على \"Anti-Idle: Reborn\"، الذي تمت الموافقة عليه من قبل جوجل وآبل، وكان في مرحلة البيتا المغلقة لمدة شهر. في 7 أكتوبر 2024، قامت جوجل بإنهاء حساب توكّون مشيرة إلى \"انتهاكات سابقة\" و\"سلوك عالي المخاطر\"، لكنها لم تقدم تفسيرًا واضحًا، مما أثر على عمله ودخله. تسلط هذه الحالة الضوء على قضية أوسع حيث يواجه المطورون إنهاء حسابات غامضة، مما يدفع إلى دعوات لمزيد من الشفافية والوضوح من منصات مثل جوجل."
    ],
    "commentSummary": [
      "أزالت جوجل بلاي لعبة مطور دون تفسير، مما يبرز السيطرة الكبيرة التي تتمتع بها شركات التكنولوجيا على المطورين.",
      "تم الإبلاغ عن حوادث مماثلة مع أمازون وجوجل، حيث يتم حظر الحسابات أو التطبيقات دون أسباب واضحة أو دعم كافٍ.",
      "يُشجع المطورون على تنويع منصاتهم لتقليل المخاطر، حيث تبرز هذه الحالة مخاوف أوسع بشأن خدمة العملاء لدى عمالقة التكنولوجيا ومخاطر الاعتماد على بناء الأعمال على منصاتهم."
    ],
    "points": 121,
    "commentCount": 59,
    "retryCount": 0,
    "time": 1728650042
  },
  {
    "id": 41806629,
    "title": "دورية نيردل",
    "originLink": "https://www.nurdlepatrol.org/app/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41806629",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "في عام 2023، فُقد 221 حاوية شحن في البحر، وهو عدد ضئيل مقارنة بـ 250 مليون حاوية تُشحن سنويًا، مما يبرز حجم عمليات الشحن العالمية.",
      "الكريات البلاستيكية، المعروفة باسم النيردلز، هي ملوثات مرئية على الشواطئ ويمكن أن تتحلل إلى جزيئات بلاستيكية دقيقة، مما يدخل في السلسلة الغذائية ويشكل ضررًا محتملاً، على الرغم من أنها ليست المصدر الرئيسي لتلوث البلاستيك البحري.",
      "تؤكد المناقشة حول تلوث البلاستيك على تعقيده وتأثيره العالمي، بما في ذلك تصدير مشكلات النفايات من الدول المتقدمة إلى الدول النامية والقدرة المحتملة للنظم البيئية على التكيف مع تلوث البلاستيك، مما يثير القلق بشأن استخدام البلاستيك في المستقبل."
    ],
    "points": 113,
    "commentCount": 34,
    "retryCount": 0,
    "time": 1728626403
  },
  {
    "id": 41808013,
    "title": "دروس أولية في أداء CUDA",
    "originLink": "https://probablydance.com/2024/10/07/initial-cuda-performance-lessons/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41808013",
    "commentBody": "",
    "originSummary": [
      "يتحدث مالتي سكاروبكي عن تجربته في تعلم CUDA، مشيرًا إلى أنها في الأساس لغة C++ مع ميزات إضافية للحوسبة المتوازية.",
      "تشمل الدروس الأساسية لتحسين أداء CUDA التوحيد في الذاكرة، وفهم أنواع الذاكرة المختلفة، وتعظيم التوازي باستخدام العديد من الخيوط وفصل المهام إلى نوى مختلفة.",
      "يشدد سكاروبكي على أن كتابة كود CUDA تشبه حل لغز، حيث يجب أن يكون التركيز الأساسي على تشغيل المهام بشكل متوازٍ قبل تحسين السرعة."
    ],
    "commentSummary": [
      "تركز المناقشة على تحسين كود CUDA لأداء وحدة معالجة الرسومات، تحديدًا لتجربة مشغل LHC (مصادم الهدرونات الكبير)، من خلال إدارة السجلات والذاكرة المشتركة وكتل الخيوط.",
      "يؤكد على التوازنات بين الإشغال (عدد الخيوط النشطة)، واستخدام السجلات، وفترات انتظار الذاكرة، مسلطًا الضوء على تطور قيود البرمجة في CUDA.",
      "تتناول المحادثة مقارنة بين أداء وحدات معالجة الرسومات (GPU) ووحدات المعالجة المركزية (CPU)، مشيرة إلى الفروقات في استهلاك الطاقة والقدرات الحسابية، وتؤكد على أهمية تحقيق التوازن بين الإشغال والأداء من أجل تحسينات مستقبلية في الأجهزة والبرمجيات."
    ],
    "points": 112,
    "commentCount": 28,
    "retryCount": 0,
    "time": 1728640892
  },
  {
    "id": 41802823,
    "title": "أنشأت مكتب التحقيقات الفيدرالي عملة للتحقيق في مخططات الضخ والتفريغ للعملات المشفرة",
    "originLink": "https://www.theverge.com/2024/10/10/24267098/fbi-coin-crypto-token-nexgenai-sec-doj-fraud-investigation",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41802823",
    "commentBody": "",
    "originSummary": [
      "طورت مكتب التحقيقات الفيدرالي عملة مشفرة تعتمد على إيثريوم، تسمى NexFundAI، للتحقيق وكشف مخططات الضخ والتفريغ في العملات المشفرة، مما أدى إلى اتخاذ إجراءات قانونية كبيرة. تم توجيه اتهامات ضد 18 فردًا وكيانًا بتهمة الاحتيال والتلاعب بالسوق، حيث استهدفت لجنة الأوراق المالية والبورصات ثلاثة صانعي سوق وتسعة آخرين لتضخيم أسعار الأصول المشفرة. نجحت وزارة العدل في استرداد 25 مليون دولار من العائدات الاحتيالية، والتي ستُعاد إلى المستثمرين، مما يبرز فعالية العملية في مكافحة الاحتيال في العملات المشفرة."
    ],
    "commentSummary": [
      "طورت الـ FBI عملة مشفرة للتحقيق في مخططات الضخ والتفريغ، وهي ممارسات احتيالية ترفع بشكل مصطنع سعر الأصل قبل بيعه.",
      "أثارت هذه المبادرة نقاشات حول الإيقاع والمضامين الأخلاقية لإنفاذ القانون في إنشاء أوراق مالية مزيفة.",
      "تمتد المناقشة إلى مخاوف أوسع بشأن شرعية العملات المشفرة ودور الحكومة في تنظيم العملات الرقمية."
    ],
    "points": 109,
    "commentCount": 122,
    "retryCount": 0,
    "time": 1728589967
  },
  {
    "id": 41808943,
    "title": "NotesHub: تطبيق لتدوين الملاحظات عبر الأنظمة الأساسية يعتمد على Markdown",
    "originLink": "https://about.noteshub.app",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41808943",
    "commentBody": "",
    "originSummary": [
      "التطبيق متاح عبر منصات متعددة، بما في ذلك iOS، Android، Windows، Mac، Apple Vision Pro، والويب، حيث أن نسخة الويب هي تطبيق ويب تقدمي مجاني يعمل دون اتصال. يمكن تخزين الملاحظات في مستودعات Git، مع أفضل تكامل مع GitHub، ويدعم أيضًا الخيارات المستضافة ذاتيًا مثل Gitea، أنظمة الملفات، أو iCloud Drive. يدعم التطبيق صيغة Markdown الغنية مع امتدادات لإنشاء لوحات كانبان، ولوحات بيضاء تعتمد على Excalidraw، ويشمل ميزات مثل ترميز موسيقى Mermaid وABC."
    ],
    "commentSummary": [
      "NotesHub هو تطبيق متعدد الاستخدامات لتدوين الملاحظات يعتمد على Markdown ومتوفر عبر منصات متعددة، بما في ذلك iOS وAndroid وWindows وMac وApple Vision Pro والويب. يقدم التطبيق نسخة مجانية من تطبيق الويب التقدمي، بينما تتطلب النسخ الأصلية دفعة واحدة، مع تكامل قوي لتخزين الملاحظات في مستودعات Git مثل GitHub وGitLab أو Bitbucket. يتميز التطبيق بدعم غني لكتابة Markdown ولوحات Kanban ولوحات بيضاء تعتمد على Excalidraw، حيث يشيد المستخدمون بتصميمه النظيف وقدراته على العمل دون اتصال، على الرغم من أنه ليس مفتوح المصدر ويدعم Linux بشكل محدود."
    ],
    "points": 107,
    "commentCount": 90,
    "retryCount": 0,
    "time": 1728650257
  },
  {
    "id": 41809879,
    "title": "مفتاح الرجل الميت بدون الاعتماد على بنيتك التحتية",
    "originLink": "https://github.com/adamdecaf/deadcheck",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41809879",
    "commentBody": "",
    "originSummary": [
      "تم تطوير مشروع جديد بلغة Go يسمى Deadcheck ليعمل كزر الأمان دون الاعتماد على وظائف cron أو المؤقتات أو قواعد البيانات. يندمج Deadcheck مع منصة PagerDuty الشهيرة لإدارة الحوادث، ليبقي الحوادث في حالة غفوة حتى يتم تفويت تسجيل الدخول، وعندها يطلق تنبيهًا. يُعتبر هذا المشروع مميزًا لنهجه المبتكر في إدارة التنبيهات والحوادث دون الاعتماد على الجدولة التقليدية أو قواعد البيانات."
    ],
    "commentSummary": [
      "Deadcheck هو مشروع بلغة Go مصمم ليكون بمثابة مفتاح الرجل الميت، مما يلغي الحاجة إلى وظائف cron أو قواعد البيانات، ويتكامل مع PagerDuty لإدارة التنبيهات.",
      "أثار المشروع مناقشات حول مفاتيح الرجل الميت، بما في ذلك الجوانب القانونية والحلول البديلة مثل استخدام المحامين أو أنظمة البلوكشين.",
      "اقترح المستخدمون خدمات موجودة مثل Cronitor أو OpsGenie لوظائف مشابهة، ويخطط المشروع لتوسيع التكاملات لتتجاوز PagerDuty."
    ],
    "points": 102,
    "commentCount": 90,
    "retryCount": 0,
    "time": 1728657639
  },
  {
    "id": 41808683,
    "title": "فهم حدود التفكير الرياضي في نماذج اللغة الكبيرة",
    "originLink": "https://arxiv.org/abs/2410.05229",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41808683",
    "commentBody": "",
    "originSummary": [
      "تبحث الورقة \"GSM-Symbolic\" التي كتبها إيمان ميرزاده وآخرون في قدرات النماذج اللغوية الكبيرة (LLMs) في الاستدلال الرياضي باستخدام معيار GSM8K. يقدم المؤلفون معيارًا جديدًا يسمى GSM-Symbolic، مع قوالب رمزية، مما يظهر أن النماذج اللغوية الكبيرة تواجه صعوبة في التعامل مع التغيرات في القيم العددية والبنود الإضافية في الأسئلة. تشير الدراسة إلى أن النماذج اللغوية الكبيرة قد تكرر الاستدلال من بيانات التدريب بدلاً من القيام باستدلال منطقي حقيقي، مما يبرز محدودياتها في الاستدلال الرياضي."
    ],
    "commentSummary": [
      "تواجه النماذج اللغوية الكبيرة (LLMs) تحديات في الاستدلال الرياضي، خاصة عندما تتضمن المسائل معلومات غير ذات صلة، مما يؤثر على أدائها. - يبرز هذا القيد اعتماد النماذج اللغوية الكبيرة على التعرف على الأنماط بدلاً من الاستدلال المنطقي، مما يجعلها أقل فعالية في السيناريوهات الواقعية التي تحتوي على تفاصيل زائدة. - على الرغم من التقدم المحرز، لا تزال النماذج اللغوية الكبيرة تكافح لتمييز المعلومات المهمة عن الضوضاء، وهي مهارة حاسمة مطلوبة للتطبيقات العملية."
    ],
    "points": 98,
    "commentCount": 118,
    "retryCount": 0,
    "time": 1728647706
  },
  {
    "id": 41804829,
    "title": "آريا: نموذج مفتوح متعدد الوسائط يعتمد على مزيج من الخبراء الأصليين",
    "originLink": "https://arxiv.org/abs/2410.05993",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41804829",
    "commentBody": "",
    "originSummary": [
      "آريا هو نموذج ذكاء اصطناعي متعدد الوسائط مفتوح المصدر يدمج معلومات متنوعة من العالم الحقيقي لتحقيق فهم شامل، متفوقًا على نماذج مثل Pixtral-12B وLlama3.2-11B في الأداء. إنه نموذج مزيج من الخبراء يحتوي على 3.9 مليار و3.5 مليار من المعاملات المفعلة لكل رمز بصري ونصي على التوالي، مما يعزز قدراته اللغوية ومتعددة الوسائط. تم فتح مصدر أوزان النموذج وقاعدة الشيفرة، مما يسهل التبني والتكيف من قبل المطورين والباحثين."
    ],
    "commentSummary": [
      "ARIA هو نموذج جديد متعدد الوسائط من نوع Mixture-of-Experts (MoE) يتفوق على Pixtral-12B وLlama3.2-11B في الأداء وسرعة الاستدلال من خلال استخدامه الفعال للمعلمات النشطة. على الرغم من أن استخدامه للذاكرة مشابه لنموذج 25B، إلا أن ARIA يعمل مثل نموذج 10B ويعمل بسرعة نموذج 4B، مما يجعله مناسبًا للأجهزة ذات الذاكرة الكافية، مثل M2 Max. يركز خبراء النموذج على التركيب النحوي، مع وجود مجال لتحسين اختيار الخبراء، وهو متاح حاليًا للاختبار، على الرغم من أن بعض المستخدمين قد واجهوا مشكلات في المنصة."
    ],
    "points": 91,
    "commentCount": 20,
    "retryCount": 0,
    "time": 1728605092
  }
]
