[
  {
    "id": 41805446,
    "title": "2 H100s: कैसे GPU किराये का बुलबुला फूटा",
    "originLink": "https://www.latent.space/p/gpu-bubble",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41805446",
    "commentBody": "",
    "originSummary": [
      "GPU बाजार में एक महत्वपूर्ण मूल्य गिरावट देखी गई है, जिसमें H100 GPUs की कीमत $8/घंटा से घटकर $2/घंटा से कम हो गई है, जो अधिक आपूर्ति और बदलती मांग की गतिशीलता के कारण है।- इस बदलाव में योगदान देने वाले कारकों में आरक्षित कंप्यूट पुनर्विक्रय, ओपन मॉडल फाइन-ट्यूनिंग, और नए फाउंडेशन मॉडल कंपनियों में कमी शामिल है, जिससे GPUs को किराए पर लेना खरीदने की तुलना में अधिक अनुकूल हो गया है।- ओपन-वेट मॉडल्स और अधिक किफायती विकल्पों जैसे AMD और Intel GPUs का उदय बाजार को प्रभावित कर रहा है, जिसमें AI इन्फरेंस और फाइन-ट्यूनिंग पर बढ़ता जोर है, जिसे Featherless.AI जैसे प्लेटफॉर्म द्वारा समर्थित लागत-प्रभावी AI समाधान प्रदान किए जा रहे हैं।"
    ],
    "commentSummary": [
      "GPU किराये के बाजार में H100 GPUs की कीमत में नाटकीय गिरावट आई है, जो $8/घंटा से घटकर $2/घंटा हो गई है, इसका कारण अधिक आपूर्ति और नए फाउंडेशन मॉडल कंपनियों से घटती मांग है।",
      "इस मूल्य में कमी ने GPU किराये के बुलबुले को फोड़ दिया है, जिससे उन निवेशकों पर प्रभाव पड़ा है जिन्होंने GPU अवसंरचना में भारी निवेश किया था।",
      "लेख सस्ते कंप्यूट विकल्पों के साथ अधिक सुलभ एआई परिदृश्य की संभावनाओं का पता लगाता है, हालांकि इन कम कीमतों की दीर्घकालिक स्थिरता और एआई अवसंरचना का भविष्य अनिश्चित है।"
    ],
    "points": 351,
    "commentCount": 241,
    "retryCount": 0,
    "time": 1728613182
  },
  {
    "id": 41805706,
    "title": "टेस्ला रोबोटैक्सी",
    "originLink": "https://www.tesla.com/we-robot",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41805706",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "हाल ही में टेस्ला ने अपने रोबोटैक्सी का प्रदर्शन किया, जिसमें स्वायत्त टैक्सियों के लिए एक दृष्टिकोण पर जोर दिया गया जो वेमो के दृष्टिकोण के विपरीत है, जो महंगे हार्डवेयर जैसे कि LiDAR का उपयोग करता है।- रोबोटैक्सी का डिज़ाइन, जिसमें स्टीयरिंग व्हील नहीं है, पूर्ण स्वायत्तता पर निर्भर भविष्य का संकेत देता है, हालांकि यह नियामक और तकनीकी चुनौतियों का सामना करता है।- टेस्ला की फुल सेल्फ-ड्राइविंग (FSD) तकनीक बहस का विषय है, जिसमें आलोचक इसके बिना निगरानी के ड्राइविंग के लिए तैयार होने पर सवाल उठाते हैं और समर्थक इसकी संभावनाओं के प्रति आशावादी हैं।"
    ],
    "points": 251,
    "commentCount": 649,
    "retryCount": 0,
    "time": 1728617065
  },
  {
    "id": 41809698,
    "title": "Chrome स्थिर संस्करण में अभी भी मैनिफेस्ट V2 का उपयोग कर रहे स्थापित एक्सटेंशनों को अक्षम करना शुरू करें",
    "originLink": "https://developer.chrome.com/docs/extensions/develop/migrate/mv2-deprecation-timeline",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41809698",
    "commentBody": "",
    "originSummary": [
      "गूगल क्रोम एक्सटेंशनों के लिए मैनिफेस्ट V2 को चरणबद्ध तरीके से समाप्त कर रहा है, जिसमें 9 अक्टूबर, 2024 से प्री-स्टेबल चैनलों पर इन एक्सटेंशनों की चेतावनी और अक्षम करना शुरू हो जाएगा।",
      "उपयोगकर्ताओं को मैनिफेस्ट V3 विकल्पों पर स्थानांतरित होने के लिए प्रोत्साहित किया जाता है, जिसमें उद्यमों के पास जून 2025 तक ExtensionManifestV2Availability नीति का उपयोग करके स्थानांतरण पूरा करने का समय है।",
      "चरणबद्ध समाप्ति प्रक्रिया 3 जून, 2024 को शुरू हुई, और क्रोम वेब स्टोर ने जून 2022 से निजी और जनवरी 2022 से सार्वजनिक या सूचीबद्ध न किए गए एक्सटेंशनों के लिए नए मैनिफेस्ट V2 एक्सटेंशनों को स्वीकार नहीं किया है।"
    ],
    "commentSummary": [
      "Chrome मैनिफेस्ट V2 से मैनिफेस्ट V3 एक्सटेंशनों में परिवर्तन कर रहा है, जिससे uBlock Origin जैसे विज्ञापन अवरोधकों की क्षमताओं पर प्रभाव पड़ेगा।- जबकि Chrome यह बदलाव कर रहा है, Firefox, Vivaldi, और Brave जैसे ब्राउज़र फिलहाल मैनिफेस्ट V2 का समर्थन जारी रखने का इरादा रखते हैं।- इस परिवर्तन ने उपयोगकर्ता नियंत्रण और गोपनीयता पर चर्चाओं को प्रेरित किया है, जिसमें कुछ उपयोगकर्ता प्रभावी विज्ञापन-अवरोधक सुविधाओं को बनाए रखने के लिए वैकल्पिक ब्राउज़रों पर स्विच करने पर विचार कर रहे हैं।"
    ],
    "points": 198,
    "commentCount": 194,
    "retryCount": 0,
    "time": 1728656426
  },
  {
    "id": 41808696,
    "title": "लिस्प में लिखा गया एक लिस्प कंपाइलर जो RISC-V के लिए है",
    "originLink": "http://www.ulisp.com/show?4Y20",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41808696",
    "commentBody": "",
    "originSummary": [
      "uLisp एक संस्करण है जो माइक्रोकंट्रोलर्स के लिए डिज़ाइन की गई Lisp प्रोग्रामिंग भाषा का है, जो Arduino, Raspberry Pi, और ESP32 जैसे प्लेटफार्मों का समर्थन करता है। इसमें डिबगिंग, एसडी कार्ड इंटरफेस, और I2C/SPI सीरियल इंटरफेस जैसी विशेषताएं शामिल हैं, जिसमें एलईडी ब्लिंकिंग और डेटा लॉगिंग जैसे अनुप्रयोगों के उदाहरण हैं। एक महत्वपूर्ण विशेषता RISC-V के लिए Lisp कंपाइलर है, जो Lisp फ़ंक्शंस को मशीन कोड में संकलित करता है, पुनरावर्ती फ़ंक्शंस और टेल-कॉल ऑप्टिमाइज़ेशन का समर्थन करता है जिससे प्रदर्शन में सुधार होता है।"
    ],
    "commentSummary": [
      "RISC-V के लिए एक Lisp कंपाइलर, जो Lisp में लिखा गया है, विकासाधीन है लेकिन इसमें कुछ ऑपरेशन्स और फंक्शन्स की कमी है जिससे यह स्वयं-संकलन करने में सक्षम नहीं है।- कंपाइलर बुनियादी Lisp फंक्शन्स जैसे car और cdr का समर्थन करता है, लेकिन यह अभी तक पूर्ण नहीं है।- uLisp को इसकी सरलता और माइक्रोकंट्रोलर्स के लिए उपयुक्तता के लिए उजागर किया गया है, जिसमें RISC-V तकनीकी उत्साही और हैकर्स के लिए एक आकर्षक प्लेटफॉर्म है।"
    ],
    "points": 192,
    "commentCount": 29,
    "retryCount": 0,
    "time": 1728647817
  },
  {
    "id": 41807681,
    "title": "2024 के लिए नोबेल शांति पुरस्कार निहोन हिदानक्यो को प्रदान किया गया",
    "originLink": "https://www.nobelprize.org/press-release-peace-2024/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41807681",
    "commentBody": "",
    "originSummary": [
      "2024 का नोबेल शांति पुरस्कार जापानी संगठन निहोन हिदानक्यो को दिया गया है, जो परमाणु बम से बचे लोगों का संगठन है, जिन्हें हिबाकुशा के नाम से जाना जाता है, उनके परमाणु-मुक्त विश्व के लिए किए गए प्रयासों के लिए।- हिबाकुशा ने अपने प्रभावशाली गवाहियों के माध्यम से परमाणु हथियारों के उपयोग के खिलाफ एक वैश्विक मानदंड, \"परमाणु वर्जना,\" स्थापित करने में महत्वपूर्ण योगदान दिया है।- यह मान्यता अल्फ्रेड नोबेल की उस दृष्टि के साथ मेल खाती है जो मानवता के लाभ के लिए किए गए प्रयासों को सम्मानित करती है और परमाणु निरस्त्रीकरण की दिशा में नई पीढ़ियों को प्रेरित करती है।"
    ],
    "commentSummary": [
      "2024 का नोबेल शांति पुरस्कार जापानी संगठन निहोन हिदानक्यो को दिया गया, जो परमाणु हथियारों के खिलाफ आवाज उठाता है, और वैश्विक तनावों के बीच परमाणु हथियारों के लगातार खतरे को उजागर करता है।- यह पुरस्कार परमाणु युद्ध के विनाशकारी प्रभाव की याद दिलाता है, जैसा कि हिरोशिमा और नागासाकी द्वारा उदाहरणित किया गया है, और निरस्त्रीकरण के महत्व पर जोर देता है।- पुरस्कार चर्चा में परमाणु निवारण, अंतरराष्ट्रीय कानून, और परमाणु शक्तियों के बीच भू-राजनीतिक गतिशीलता की जटिलताओं को भी शामिल किया गया है।"
    ],
    "points": 180,
    "commentCount": 238,
    "retryCount": 0,
    "time": 1728637314
  },
  {
    "id": 41805391,
    "title": "वर्डप्रेस विकल्प",
    "originLink": "https://darn.es/wordpress-alternatives/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41805391",
    "commentBody": "",
    "originSummary": [
      "इस लेख को अधिक कंटेंट मैनेजमेंट सिस्टम (CMS) विकल्पों को शामिल करने के लिए अपडेट किया गया है, विशेष रूप से वर्तमान वर्डप्रेस स्थिति के मद्देनजर बढ़ती रुचि के कारण।- इस सूची में डाउनलोड करने योग्य CMS विकल्प जैसे कि Ghost, Kirby, Indiekit, Craft CMS, ClassicPress, Statamic, Wagtail, और Textpattern शामिल हैं, जिसमें API और git-आधारित CMS शामिल नहीं हैं।- उल्लेखनीय CMS में Ghost अपने इनबिल्ट ईमेल फीचर्स के लिए, Kirby अपनी फाइल-आधारित दृष्टिकोण के लिए, और ClassicPress एक समुदाय-नेतृत्व वाले वर्डप्रेस फोर्क के रूप में शामिल हैं, जबकि कुछ CMS जैसे कि Anchor अब मेंटेन नहीं किए जाते हैं।"
    ],
    "commentSummary": [
      "Markdown का उपयोग करने वाले सरल ब्लॉग के लिए GitHub Pages पर Jekyll की सिफारिश की जाती है, जो स्थानीय सेटअप की आवश्यकता के बिना उपयोग में आसानी और विभिन्न प्लेटफार्मों पर सामग्री की पोर्टेबिलिटी की अनुमति प्रदान करता है।",
      "ब्लॉगिंग के लिए वर्डप्रेस के विकल्पों में Chyrp Lite, Typecho, Quartz, और Logseq शामिल हैं, जबकि Drupal, ProcessWire, और Wagtail डेवलपर्स के लिए अधिक लचीलापन प्रदान करते हैं।",
      "स्टेटिक साइट जनरेटर्स जैसे कि एस्ट्रो और पब्लिई तेजी से लोकप्रिय हो रहे हैं, और इमेज होस्टिंग के लिए, S3+क्लाउडफ्रंट या क्लाउडफ्लेयर जैसे विकल्प सुझाए जाते हैं।"
    ],
    "points": 144,
    "commentCount": 106,
    "retryCount": 0,
    "time": 1728612210
  },
  {
    "id": 41808917,
    "title": "गूगल प्ले ने मेरा गेम हटा दिया और मुझे कारण नहीं बताया",
    "originLink": "https://antiidlereborn.com/news/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41808917",
    "commentBody": "",
    "originSummary": [
      "टुक्कुन, एक इंडी गेम डेवलपर, \"एंटी-आइडल: रिबॉर्न\" पर काम कर रहे हैं, जिसे गूगल और एप्पल द्वारा मंजूरी दी गई थी, और यह एक महीने से क्लोज्ड बीटा में था।- 7 अक्टूबर, 2024 को, गूगल ने \"पूर्व उल्लंघनों\" और \"उच्च जोखिम व्यवहार\" का हवाला देते हुए टुक्कुन का खाता समाप्त कर दिया, लेकिन स्पष्ट स्पष्टीकरण नहीं दिया, जिससे उनके काम और आय पर प्रभाव पड़ा।- यह स्थिति एक व्यापक मुद्दे को उजागर करती है जहां डेवलपर्स अस्पष्ट खाता समाप्तियों का अनुभव करते हैं, जिससे गूगल जैसे प्लेटफार्मों से अधिक पारदर्शिता और स्पष्टता की मांग की जाती है।"
    ],
    "commentSummary": [
      "गूगल प्ले ने एक डेवलपर के गेम को बिना किसी स्पष्टीकरण के हटा दिया, जो यह दर्शाता है कि तकनीकी कंपनियों के पास डेवलपर्स पर कितना महत्वपूर्ण नियंत्रण होता है।",
      "ऐसे ही घटनाओं की रिपोर्ट अमेज़न और गूगल के साथ भी की गई है, जहां खातों या ऐप्स को बिना स्पष्ट कारणों या पर्याप्त समर्थन के प्रतिबंधित कर दिया जाता है।",
      "डेवलपर्स को प्रोत्साहित किया जाता है कि वे अपने प्लेटफॉर्म को विविध बनाएं ताकि जोखिमों को कम किया जा सके, क्योंकि यह स्थिति तकनीकी दिग्गजों की ग्राहक सेवा और उनके प्लेटफॉर्म पर व्यवसाय बनाने के निर्भरता जोखिमों के बारे में व्यापक चिंताओं को उजागर करती है।"
    ],
    "points": 121,
    "commentCount": 59,
    "retryCount": 0,
    "time": 1728650042
  },
  {
    "id": 41806629,
    "title": "नर्डल पेट्रोल",
    "originLink": "https://www.nurdlepatrol.org/app/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41806629",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "2023 में, समुद्र में 221 शिपिंग कंटेनर खो गए, जो कि वार्षिक रूप से भेजे जाने वाले 250 मिलियन कंटेनरों की तुलना में एक मामूली संख्या है, जो वैश्विक शिपिंग संचालन के पैमाने को दर्शाता है।",
      "प्लास्टिक के छोटे दाने, जिन्हें नर्डल्स कहा जाता है, समुद्र तटों पर दिखाई देने वाले प्रदूषक होते हैं और ये माइक्रोप्लास्टिक में बदल सकते हैं, जो खाद्य श्रृंखला में प्रवेश कर सकते हैं और संभावित नुकसान पहुंचा सकते हैं, हालांकि वे समुद्री प्लास्टिक प्रदूषण का मुख्य स्रोत नहीं हैं।",
      "प्लास्टिक प्रदूषण पर चर्चा इसके जटिलता और वैश्विक प्रभाव पर जोर देती है, जिसमें विकसित देशों से विकासशील देशों को कचरे के निर्यात के मुद्दे और प्लास्टिक प्रदूषण के लिए पारिस्थितिक तंत्र के संभावित अनुकूलन शामिल हैं, जो भविष्य में प्लास्टिक के उपयोग के बारे में चिंताएं बढ़ाते हैं।"
    ],
    "points": 113,
    "commentCount": 34,
    "retryCount": 0,
    "time": 1728626403
  },
  {
    "id": 41808013,
    "title": "प्रारंभिक CUDA प्रदर्शन पाठ",
    "originLink": "https://probablydance.com/2024/10/07/initial-cuda-performance-lessons/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41808013",
    "commentBody": "",
    "originSummary": [
      "माल्टे स्कारुपके ने CUDA सीखने के अपने अनुभव पर चर्चा की, यह बताते हुए कि यह मूल रूप से C++ है जिसमें समानांतर कंप्यूटिंग के लिए अतिरिक्त विशेषताएं शामिल हैं।",
      "CUDA प्रदर्शन को अनुकूलित करने के लिए मुख्य पाठों में मेमोरी कोएलसिंग, विभिन्न मेमोरी प्रकारों की समझ, और अधिकतम समानांतरता प्राप्त करने के लिए कई थ्रेड्स का उपयोग और कार्यों को विभिन्न कर्नल्स में विभाजित करना शामिल है।",
      "स्कारुपके इस बात पर जोर देते हैं कि CUDA लिखना एक पहेली को हल करने के समान है, जहाँ प्राथमिक ध्यान कार्यों को समानांतर में चलाने पर होना चाहिए, उसके बाद गति के लिए अनुकूलन करना चाहिए।"
    ],
    "commentSummary": [
      "चर्चा का केंद्र बिंदु GPU प्रदर्शन के लिए CUDA कोड का अनुकूलन करना है, विशेष रूप से LHC (बड़ा हैड्रॉन कोलाइडर) प्रयोग ट्रिगर के लिए, जिसमें रजिस्टरों, साझा मेमोरी और थ्रेड ब्लॉक्स का प्रबंधन शामिल है।",
      "यह अधिभोग (सक्रिय थ्रेड्स की संख्या), रजिस्टर उपयोग, और मेमोरी विलंबताओं के बीच के समझौतों पर जोर देता है, जो CUDA में प्रोग्रामिंग बाधाओं के विकास को उजागर करता है।",
      "वार्तालाप में GPU और CPU के प्रदर्शन की तुलना की गई है, जिसमें बिजली की खपत और गणनात्मक क्षमताओं में अंतर को नोट किया गया है, और भविष्य के हार्डवेयर और सॉफ़्टवेयर प्रगति के लिए अधिभोग और प्रदर्शन के संतुलन के महत्व पर जोर दिया गया है।"
    ],
    "points": 112,
    "commentCount": 28,
    "retryCount": 0,
    "time": 1728640892
  },
  {
    "id": 41802823,
    "title": "एफबीआई ने क्रिप्टो पंप-एंड-डंप योजनाओं की जांच के लिए एक सिक्का बनाया",
    "originLink": "https://www.theverge.com/2024/10/10/24267098/fbi-coin-crypto-token-nexgenai-sec-doj-fraud-investigation",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41802823",
    "commentBody": "",
    "originSummary": [
      "एफबीआई ने एथेरियम-आधारित क्रिप्टोकरेंसी, नेक्सफंडएआई, को विकसित किया ताकि क्रिप्टो पंप-एंड-डंप योजनाओं की जांच और खुलासा किया जा सके, जिससे महत्वपूर्ण कानूनी कार्रवाइयां हुईं।- 18 व्यक्तियों और संस्थाओं के खिलाफ धोखाधड़ी और बाजार में हेरफेर के आरोप लगाए गए, जिसमें सिक्योरिटीज एंड एक्सचेंज कमीशन ने तीन बाजार निर्माताओं और नौ अन्य पर क्रिप्टो संपत्ति की कीमतों को बढ़ाने का आरोप लगाया।- न्याय विभाग ने सफलतापूर्वक $25 मिलियन की धोखाधड़ी से प्राप्त राशि को बरामद किया, जिसे निवेशकों को लौटाया जाएगा, जो क्रिप्टो धोखाधड़ी से लड़ने में इस ऑपरेशन की प्रभावशीलता को उजागर करता है।"
    ],
    "commentSummary": [
      "एफबीआई ने पंप-एंड-डंप योजनाओं की जांच के लिए एक क्रिप्टोकरेंसी विकसित की, जो धोखाधड़ी वाली प्रथाएं हैं जो किसी संपत्ति की कीमत को कृत्रिम रूप से बढ़ाकर उसे बेचने से पहले बढ़ा देती हैं।",
      "इस पहल ने फर्जी प्रतिभूतियों के निर्माण में कानून प्रवर्तन की नैतिक निहितार्थों और फंसाने के मुद्दों पर बहस छेड़ दी है।",
      "चर्चा व्यापक चिंताओं तक फैली हुई है, जिसमें क्रिप्टोकरेंसी की वैधता और डिजिटल मुद्राओं को विनियमित करने में सरकार की भूमिका शामिल है।"
    ],
    "points": 109,
    "commentCount": 122,
    "retryCount": 0,
    "time": 1728589967
  },
  {
    "id": 41808943,
    "title": "नोट्सहब: क्रॉस-प्लेटफ़ॉर्म, मार्कडाउन-आधारित नोट लेने वाला ऐप",
    "originLink": "https://about.noteshub.app",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41808943",
    "commentBody": "",
    "originSummary": [
      "यह ऐप कई प्लेटफार्मों पर उपलब्ध है, जिसमें iOS, Android, Windows, Mac, Apple Vision Pro और वेब शामिल हैं, जिसमें वेब संस्करण एक मुफ्त प्रोग्रेसिव वेब ऐप है जो ऑफलाइन काम करता है।- नोट्स को Git रिपॉजिटरी में संग्रहीत किया जा सकता है, जिसमें GitHub के साथ सबसे अच्छा एकीकरण है, और Gitea, फाइल सिस्टम, या iCloud ड्राइव जैसे स्व-होस्टेड विकल्पों का भी समर्थन करता है।- ऐप समृद्ध मार्कडाउन सिंटैक्स का समर्थन करता है, जिसमें कानबन बोर्ड बनाने के लिए एक्सटेंशन, Excalidraw-आधारित व्हाइटबोर्ड शामिल हैं, और इसमें मर्मेड और ABC संगीत नोटेशन जैसी विशेषताएं शामिल हैं।"
    ],
    "commentSummary": [
      "NotesHub एक बहुमुखी, मार्कडाउन-आधारित नोट-लेने वाला ऐप है जो कई प्लेटफार्मों पर उपलब्ध है, जिसमें iOS, Android, Windows, Mac, Apple Vision Pro, और वेब शामिल हैं।- ऐप एक मुफ्त प्रोग्रेसिव वेब ऐप संस्करण प्रदान करता है, जबकि देशी संस्करणों के लिए एक बार भुगतान की आवश्यकता होती है, जिसमें GitHub, GitLab, या Bitbucket जैसे Git रिपॉजिटरी में नोट्स संग्रहीत करने के लिए मजबूत एकीकरण होता है।- इसमें समृद्ध मार्कडाउन सिंटैक्स, कानबन बोर्ड, और Excalidraw-आधारित व्हाइटबोर्ड शामिल हैं, उपयोगकर्ता इसके साफ-सुथरे डिज़ाइन और ऑफ़लाइन क्षमताओं की प्रशंसा करते हैं, हालांकि यह ओपन-सोर्स नहीं है और इसमें सीमित लिनक्स समर्थन है।"
    ],
    "points": 107,
    "commentCount": 90,
    "retryCount": 0,
    "time": 1728650257
  },
  {
    "id": 41809879,
    "title": "आपके बुनियादी ढांचे पर निर्भरता के बिना डेड मैन स्विच",
    "originLink": "https://github.com/adamdecaf/deadcheck",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41809879",
    "commentBody": "",
    "originSummary": [
      "एक नया गो प्रोजेक्ट, डेडचेक, विकसित किया गया है जो क्रोन जॉब्स, टाइमर्स, या डेटाबेस पर निर्भर किए बिना एक डेड मैन का स्विच के रूप में कार्य करता है।- डेडचेक पेजरड्यूटी के साथ एकीकृत होता है, जो एक लोकप्रिय घटना प्रबंधन प्लेटफॉर्म है, ताकि घटनाओं को तब तक स्थगित रखा जा सके जब तक कि एक चेक-इन छूट न जाए, उस बिंदु पर यह एक अलर्ट ट्रिगर करता है।- यह प्रोजेक्ट पारंपरिक शेड्यूलिंग या डेटाबेस निर्भरताओं के बिना अलर्ट और घटनाओं को प्रबंधित करने के लिए अपने नवाचारी दृष्टिकोण के लिए उल्लेखनीय है।"
    ],
    "commentSummary": [
      "डेडचेक एक गो प्रोजेक्ट है जिसे एक डेड मैन स्विच के रूप में डिज़ाइन किया गया है, जो क्रोन जॉब्स या डेटाबेस की आवश्यकता को समाप्त करता है, और अलर्ट प्रबंधन के लिए पेजरड्यूटी के साथ एकीकृत होता है।",
      "इस परियोजना ने मृत व्यक्ति के स्विच पर चर्चाओं को जन्म दिया है, जिसमें कानूनी पहलू और वैकल्पिक समाधान जैसे वकीलों या ब्लॉकचेन प्रणालियों का उपयोग शामिल है।",
      "उपयोगकर्ताओं ने समान कार्यक्षमताओं के लिए Cronitor या OpsGenie जैसी मौजूदा सेवाओं का सुझाव दिया है, और परियोजना की योजना PagerDuty से परे एकीकरण का विस्तार करने की है।"
    ],
    "points": 102,
    "commentCount": 90,
    "retryCount": 0,
    "time": 1728657639
  },
  {
    "id": 41808683,
    "title": "बड़े भाषा मॉडलों में गणितीय तर्क की सीमाओं को समझना",
    "originLink": "https://arxiv.org/abs/2410.05229",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41808683",
    "commentBody": "",
    "originSummary": [
      "इमान मिर्ज़ादेह और अन्य द्वारा लिखित पेपर \"GSM-Symbolic\" बड़े भाषा मॉडलों (LLMs) की गणितीय तर्क क्षमताओं की जांच करता है, जिसमें GSM8K बेंचमार्क का उपयोग किया गया है।- लेखक GSM-Symbolic, एक नया बेंचमार्क प्रस्तुत करते हैं जिसमें प्रतीकात्मक टेम्पलेट्स होते हैं, यह दिखाते हुए कि LLMs संख्यात्मक मानों में भिन्नताओं और प्रश्नों में अतिरिक्त धाराओं के साथ संघर्ष करते हैं।- अध्ययन यह सुझाव देता है कि LLMs प्रशिक्षण डेटा से तर्क को दोहरा सकते हैं बजाय इसके कि वे वास्तविक तार्किक तर्क का प्रदर्शन करें, जो गणितीय तर्क में उनकी सीमाओं को उजागर करता है।"
    ],
    "commentSummary": [
      "बड़े भाषा मॉडल (LLMs) गणितीय तर्क में चुनौतियों का सामना करते हैं, विशेष रूप से जब समस्याओं में अप्रासंगिक जानकारी शामिल होती है, जो उनके प्रदर्शन को प्रभावित करती है।- यह सीमा LLMs की पैटर्न पहचान पर निर्भरता को उजागर करती है, जो उन्हें तार्किक तर्क के मुकाबले कम प्रभावी बनाती है, जिससे वे वास्तविक दुनिया के परिदृश्यों में कम प्रभावी होते हैं जहां अतिरिक्त विवरण होते हैं।- प्रगति के बावजूद, LLMs अभी भी महत्वपूर्ण जानकारी को शोर से अलग करने में संघर्ष करते हैं, जो व्यावहारिक अनुप्रयोगों के लिए एक महत्वपूर्ण कौशल है।"
    ],
    "points": 98,
    "commentCount": 118,
    "retryCount": 0,
    "time": 1728647706
  },
  {
    "id": 41804829,
    "title": "एआरआईए: एक ओपन मल्टीमॉडल नेटिव मिक्सचर-ऑफ-एक्सपर्ट्स मॉडल",
    "originLink": "https://arxiv.org/abs/2410.05993",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41804829",
    "commentBody": "",
    "originSummary": [
      "एरिया एक ओपन मल्टीमॉडल नेटिव एआई मॉडल है जो व्यापक समझ के लिए विविध वास्तविक दुनिया की जानकारी को एकीकृत करता है, और प्रदर्शन में पिक्स्ट्रल-12बी और लामा3.2-11बी जैसे मॉडलों को पार करता है।- यह एक विशेषज्ञों के मिश्रण का मॉडल है जिसमें दृश्य और पाठ टोकन के लिए क्रमशः 3.9 बिलियन और 3.5 बिलियन सक्रियित पैरामीटर हैं, जो इसकी भाषा और मल्टीमॉडल क्षमताओं को बढ़ाते हैं।- मॉडल के वेट्स और कोडबेस ओपन-सोर्स हैं, जो डेवलपर्स और शोधकर्ताओं द्वारा आसान अपनाने और अनुकूलन की सुविधा प्रदान करते हैं।"
    ],
    "commentSummary": [
      "ARIA एक नया मल्टीमॉडल नेटिव मिक्सचर-ऑफ-एक्सपर्ट्स (MoE) मॉडल है जो प्रदर्शन और अनुमान गति में Pixtral-12B और Llama3.2-11B को पार करता है, सक्रिय पैरामीटरों का कुशलतापूर्वक उपयोग करके।- हालांकि इसकी मेमोरी उपयोग 25B मॉडल के समान है, ARIA 10B मॉडल की तरह प्रदर्शन करता है और 4B मॉडल की तरह तेजी से काम करता है, जिससे यह पर्याप्त मेमोरी वाले उपकरणों, जैसे कि M2 Max, के लिए उपयुक्त है।- मॉडल के विशेषज्ञ सिंटैक्स पर ध्यान केंद्रित करते हैं, विशेषज्ञ चयन में सुधार की गुंजाइश के साथ, और यह वर्तमान में परीक्षण के लिए उपलब्ध है, हालांकि कुछ उपयोगकर्ताओं ने प्लेटफॉर्म मुद्दों का सामना किया है।"
    ],
    "points": 91,
    "commentCount": 20,
    "retryCount": 0,
    "time": 1728605092
  }
]
