[
  {
    "id": 37869760,
    "title": "आपको Y Combinator में क्यों शामिल नहीं होना चाहिए",
    "originLink": "https://newsletter.smallbets.co/p/why-you-shouldnt-join-y-combinator",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37869760",
    "commentBody": "",
    "originSummary": [
      "लेख वाई कॉम्बीनेटर स्टार्टअप त्वरक का एक महत्वपूर्ण विश्लेषण प्रदान करता है, जो सफलता दर और इसकी पद्धतियों की प्रभावशीलता पर सवाल उठाता है।",
      "यह बताता है कि छोटी, विश्वसनीय सफलताओं पर ध्यान केंद्रित करना और आय के कई स्रोतों का निर्माण दीर्घकालिक व्यावसायिक सफलता के लिए अधिक टिकाऊ रणनीति प्रदान कर सकता है।",
      "वाई कॉम्बीनेटर एक प्रसिद्ध स्टार्टअप त्वरक है; इसके दृष्टिकोण की आलोचना सर्वोत्तम उद्यमिता प्रथाओं के बारे में व्यापक बातचीत की आवश्यकता का सुझाव देती है।"
    ],
    "commentSummary": [
      "चर्चा का मुख्य विषय वाई कॉम्बीनेटर में शामिल होने और स्टार्टअप के लिए उद्यम पूंजी प्राप्त करने के संभावित लाभ और नुकसान हैं, बहस में विभिन्न राय प्रमुख हैं।",
      "एक सेवा (SaaS) व्यवसाय के रूप में एक सफल सॉफ्टवेयर चलाने, तकनीकी ऋण का प्रबंधन करने, कार्य-जीवन संतुलन प्राप्त करने और वित्तीय योजना और रणनीति की आवश्यकता की जटिलताओं पर ध्यान केंद्रित किया गया है।",
      "सफलता के वैकल्पिक मार्ग, जैसे बूटस्ट्रैपिंग या उधार लेना, निर्णय लेने को सूचित करने के लिए व्यक्तिगत लक्ष्यों की पहचान करने के महत्व के साथ भी चर्चा की जाती है।"
    ],
    "points": 580,
    "commentCount": 286,
    "retryCount": 0,
    "time": 1697199497
  },
  {
    "id": 37870437,
    "title": "एआई जोड़ने वाला हर ऐप इस तरह दिखता है",
    "originLink": "https://botharetrue.substack.com/p/every-app-that-adds-ai-looks-like",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37870437",
    "commentBody": "",
    "originSummary": [
      "एलेक्स डोब्रेंको, एक टीवी अभिनेता और लेखक, तकनीकी कंपनियों के अनुप्रयोगों में कृत्रिम बुद्धि (एआई) कार्यों के अत्यधिक उपयोग और प्रचार की आलोचना करते हैं।",
      "डोब्रेंको एआई प्रवृत्ति को एक-दूसरे की नकल करने वाली कंपनियों के रूप में देखता है और इस नवीनतम प्रवृत्ति से लाभ उठाने की कोशिश करता है, अक्सर अपनी एआई सुविधाओं को ग्राउंडब्रेकिंग के रूप में विपणन करता है, फिर भी औसत दर्जे के परिणाम प्रदान करता है।",
      "वह एआई प्रचार को कम करने की वकालत करते हैं और इस शब्द के लिए व्यक्तिगत नापसंदगी व्यक्त करते हैं।"
    ],
    "commentSummary": [
      "बहस विभिन्न क्षेत्रों में कृत्रिम बुद्धिमत्ता (एआई) के अति-शोषण और प्रचार पर केंद्रित है, जिसमें अभिनव और कार्यात्मक एआई उत्पादों की अनुपस्थिति और एआई को शामिल करने से पहले वास्तविक समस्याओं को हल करने की आवश्यकता पर चिंता है।",
      "प्रतिभागियों ने भ्रामक विपणन रणनीतियों, मीडिया पूर्वाग्रह और एआई उद्योग के भीतर नैतिक विचारों और पारदर्शिता की कमी के बारे में संदेह और निराशा व्यक्त की।",
      "लेखक ने प्रभावी एआई कार्यान्वयन की चुनौतियों को इंगित करते हुए जनरेटिव एआई को लागू करने के कॉर्पोरेट प्रयासों की आलोचना की, और अस्पष्ट और अतिप्रयुक्त शब्द \"एआई\" पर भरोसा करने के बजाय उत्पादों के विशिष्ट लाभों और समस्या सुलझाने की क्षमताओं पर ध्यान केंद्रित करने का सुझाव दिया।"
    ],
    "points": 540,
    "commentCount": 197,
    "retryCount": 0,
    "time": 1697204117
  },
  {
    "id": 37874891,
    "title": "TimeGPT-1",
    "originLink": "https://arxiv.org/abs/2310.03589",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37874891",
    "commentBody": "",
    "originSummary": [
      "लेखक टाइमजीपीटी प्रस्तुत करते हैं, जो समय श्रृंखला के लिए एक मूलभूत मॉडल है जो विभिन्न डेटासेट में सटीक भविष्यवाणियां प्रदान कर सकता है।",
      "मॉडल दक्षता, सरल कार्यान्वयन और बेहतर पूर्वानुमान प्रदर्शन के मामले में दूसरों से बेहतर है।",
      "अध्ययन का तात्पर्य है कि टाइमजीपीटी जैसे बड़े पैमाने पर समय श्रृंखला मॉडल सटीक भविष्यवाणियों तक व्यापक पहुंच की सुविधा प्रदान कर सकते हैं और अनिश्चितता को कम कर सकते हैं।"
    ],
    "commentSummary": [
      "लेखक समय श्रृंखला पूर्वानुमान के लिए गहन शिक्षण मॉडल की प्रभावकारिता पर सवाल उठाता है, यह सुझाव देते हुए कि पारंपरिक मॉडल उनसे बेहतर प्रदर्शन कर सकते हैं।",
      "चर्चा टाइमजीपीटी, एक विशेष मॉडल की जांच करती है, अन्य मॉडलों के साथ तुलना की कमी की आलोचना करती है, और समय श्रृंखला की भविष्यवाणी में भाषा मॉडल की प्रभावशीलता पर बहस करती है।",
      "नई तकनीकों को गुप्त रखने के लिए वित्तीय प्रोत्साहन के बारे में अटकलों के साथ, ओपन-सोर्स मॉडल और विस्तृत बेंचमार्किंग की अनुपस्थिति को रेखांकित किया गया है; ऐतिहासिक डेटा की उपयोगिता और बाजार पर ओपन-सोर्स एआई एल्गोरिदम के संभावित प्रभाव पर भी चर्चा की जाती है।"
    ],
    "points": 356,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1697227112
  },
  {
    "id": 37873621,
    "title": "सीआईए ने सार्वजनिक रूप से स्वीकार किया कि 1953 में ईरान में तख्तापलट अलोकतांत्रिक था",
    "originLink": "https://www.nbcnews.com/news/us-news/cia-publicly-acknowledges-1953-coup-backed-iran-was-undemocratic-revis-rcna120154",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37873621",
    "commentBody": "",
    "originSummary": [
      "सीआईए सार्वजनिक रूप से स्वीकार करता है कि ईरान में 1953 के तख्तापलट का समर्थन करना अलोकतांत्रिक था, जिसमें यह ईरान में 1979 के अमेरिकी दूतावास को जब्त करने के बारे में नई अंतर्दृष्टि भी प्रदान करता है।",
      "भले ही सीआईए की स्वीकृति महत्वपूर्ण है, तख्तापलट के आधिकारिक इतिहास का एक बड़ा हिस्सा अभी भी वर्गीकृत है, जो संयुक्त राज्य अमेरिका-ईरान संबंधों को तनाव देता है।",
      "संयुक्त राष्ट्र में ईरान का मिशन सीआईए की स्वीकारोक्ति को कमजोर करता है, इस बात पर जोर देते हुए कि इससे कोई सुधारात्मक उपाय नहीं हुआ है या भविष्य के हस्तक्षेप से बचने के लिए एक दृढ़ वादा प्रदर्शित नहीं किया गया है।"
    ],
    "commentSummary": [
      "पाठ में सीआईए संचालन, इजरायल-फिलिस्तीनी संघर्ष, विभिन्न षड्यंत्र सिद्धांतों और मध्य पूर्व में अमेरिकी विदेश नीति सहित विभिन्न भू-राजनीतिक मुद्दों पर चर्चा की गई है।",
      "पाठकों के परस्पर विरोधी विचार हैं, कुछ खुफिया एजेंसियों और अमेरिकी विदेशी कार्यों में अधिक पारदर्शिता, जवाबदेही और नैतिकता के लिए तर्क देते हैं।",
      "गद्यांश इन विषयों के आसपास के जटिल इतिहास और संदर्भ को रेखांकित करता है, पिछले कार्यों के संभावित नतीजों को उजागर करता है।"
    ],
    "points": 264,
    "commentCount": 169,
    "retryCount": 0,
    "time": 1697220566
  },
  {
    "id": 37872774,
    "title": "संपूर्ण पृथ्वी सूची अब ऑनलाइन है",
    "originLink": "https://www.wired.com/story/whole-earth-catalog-now-online-internet-archive/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37872774",
    "commentBody": "",
    "originSummary": [
      "होल अर्थ कैटलॉग, एक DIY गाइड और सिलिकॉन वैली की स्टार्टअप संस्कृति में प्रभावशाली समीक्षा प्रकाशन, मुफ्त में ऑनलाइन उपलब्ध कराया गया है।",
      "डिजिटल संग्रह ग्रे एरिया, लॉन्ग नाउ फाउंडेशन और इंटरनेट आर्काइव के बीच एक सहयोगी प्रयास है, जो कैटलॉग की ऐतिहासिक विरासत को दर्शाता है।",
      "यह आशा की जाती है कि यह अंततः मूल कैटलॉग से सभी कलाकृतियों को गले लगाएगा, जिसमें विज्ञान से लेकर सामाजिक न्याय तक के विविध विषयों की विशेषता होगी, जिससे री-रिलीज़ के प्रभाव को इसके पाठकों द्वारा व्याख्या की जा सके।"
    ],
    "commentSummary": [
      "प्रतिष्ठित प्रकाशन, द होल अर्थ कैटलॉग, अब डिजिटल रूप से सुलभ है, जो अपने पाठकों के बीच प्रत्याशा और स्मृति दोनों पैदा करता है।",
      "कैटलॉग के प्रभाव, निर्माता आंदोलन को प्रेरित करने में इसकी भूमिका और कृत्रिम बुद्धिमत्ता प्रशिक्षण में इसकी सामग्री के संभावित अनुप्रयोग के बारे में ऑनलाइन चर्चा चल रही है।",
      "उपयोगकर्ता कैटलॉग के ऑनलाइन संग्रह के लिंक प्रसारित कर रहे हैं और संबंधित प्रकाशनों के बारे में बातचीत में संलग्न हैं।"
    ],
    "points": 256,
    "commentCount": 46,
    "retryCount": 0,
    "time": 1697216232
  },
  {
    "id": 37876988,
    "title": "दृष्टि के बिना पूरी तरह से ग्राउंड मांस कैसे पकाएं",
    "originLink": "https://theblindkitchen.com/how-to-cook-ground-meat-perfectly-every-time/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37876988",
    "commentBody": "",
    "originSummary": [
      "यह लेख ग्राउंड मीट को सही ढंग से पकाने के तरीके के बारे में सलाह प्रस्तुत करता है, खासकर उन लोगों के लिए जो अंधे या दृष्टिहीन हैं।",
      "तकनीकों में पैन में तेल जोड़ना, खाना पकाने से पहले मांस को टुकड़ों में तोड़ना, सिज़लिंग सुनना और मांस का आकलन करने के लिए गंध का उपयोग करना शामिल है।",
      "लेख में एक लंबे समय तक संभाले जाने वाले बर्तन और एक अद्वितीय तनाव विधि का उपयोग करने का भी सुझाव दिया गया है, जो एक अतिरिक्त छन्नी की आवश्यकता को नकारता है। यह द ब्लाइंड किचन वेबसाइट पर शेफ डेबरा एरिक्सन द्वारा लिखा गया है।"
    ],
    "commentSummary": [
      "सारांश संवेदी संकेतों और विशेष उपकरणों का उपयोग करके, नेत्रहीन व्यक्तियों के लिए ग्राउंड मीट पकाने के लिए तकनीकों और रणनीतियों पर जोर देता है।",
      "यह दृष्टिबाधित व्यक्तियों के लिए रसोई में पहुंच के महत्व को रेखांकित करता है।",
      "वनस्पति तेल का उपयोग करने, खाना पकाने के दौरान विशिष्ट ध्वनियों को सुनने, और विशेष स्मार्ट रसोई उपकरणों को नियोजित करने जैसी तकनीकों को दृष्टि के बिना खाना पकाने में सहायता के लिए सुझाया जाता है।"
    ],
    "points": 239,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1697242777
  },
  {
    "id": 37870557,
    "title": "CSAM क्लाइंट-साइड स्कैनिंग डेटाबेस को दूषित करना",
    "originLink": "https://blog.xot.nl/2023/10/11/tainting-the-csam-client-side-scanning-database/index.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37870557",
    "commentBody": "",
    "originSummary": [
      "बाल यौन शोषण से निपटने के लिए यूरोपीय आयोग के प्रस्तावित विनियमन को कार्य करने के लिए अतिसंवेदनशील हो सकता है, जिसमें क्लाइंट-साइड स्कैनिंग सिस्टम गैर-सीएसएएम (बाल यौन शोषण सामग्री) सामग्री का पता लगा सकता है।",
      "संभावित जोखिम हैं कि पहुंच वाली संस्थाएं सीएसएएम डेटाबेस को गैर-प्रासंगिक डेटा के साथ मिलावट कर सकती हैं, संचार को प्रभावित कर सकती हैं और गोपनीयता के मुद्दों को उठा सकती हैं।",
      "इस प्रस्तावित प्रणाली की सफलता दुरुपयोग केंद्रों की झूठी सकारात्मक और दुर्भावनापूर्ण प्रविष्टियों को पहचानने और प्रबंधित करने की क्षमता पर टिकी हुई है; इसलिए, क्लाइंट-साइड स्कैनिंग सिस्टम में रिपोर्ट का डिज़ाइन और हैंडलिंग महत्वपूर्ण है।"
    ],
    "commentSummary": [
      "ऐप्पल का प्रस्तावित सीएसएएम (बाल यौन शोषण सामग्री) क्लाइंट-साइड स्कैनिंग डेटाबेस संभावित शोषण, झूठी सकारात्मकता की संभावनाओं, स्वचालित सेंसरशिप और उपयोगकर्ता गोपनीयता संरक्षण की आवश्यकता पर चिंताओं के कारण जांच के दायरे में है।",
      "चर्चा में संभावित कमजोरियों और सीएसएएम का पता लगाने के लिए उपयोग की जाने वाली अवधारणात्मक हैश स्कैनिंग सिस्टम के संभावित दुरुपयोग पर प्रकाश डाला गया है, जो उपयोगकर्ता की गोपनीयता और अधिकारियों द्वारा संभावित दुरुपयोग को प्रभावित करता है।",
      "यह प्रवचन YouTube सामग्री संरक्षण प्रणाली के शोषण, झूठे कॉपीराइट दावों के लिए दंड की अनुपस्थिति, और हेरफेर किए गए हैश, झूठे आरोप, एआई-जनित CSAM, कब्जे के कानूनों और स्कैनिंग सिस्टम की दक्षता के आसपास के विषयों तक भी फैला हुआ है।"
    ],
    "points": 239,
    "commentCount": 253,
    "retryCount": 0,
    "time": 1697204840
  },
  {
    "id": 37870930,
    "title": "एलओआरए के साथ सैकड़ों एलएलएम फाइनट्यूनिंग प्रयोगों से टेकअवे",
    "originLink": "https://lightning.ai/pages/community/lora-insights/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37870930",
    "commentBody": "",
    "originSummary": [
      "लेख लिट-जीपीटी का परिचय देता है, एक ओपन-सोर्स बड़ी भाषा मॉडल जो अनुकूलन की अनुमति देता है।",
      "यह एलओआरए नामक एक फाइनट्यूनिंग तकनीक के आवेदन की समीक्षा करता है, जो कस्टम भाषा मॉडल के प्रशिक्षण के लिए सही सेटिंग्स और हाइपरपैरामीटर के महत्व पर जोर देता है।",
      "लेखक ने लिट-जीपीटी के प्रदर्शन और मेमोरी उपयोग को अनुकूलित करने के लिए क्वांटाइज्ड एलओआरए सहित कई तरीकों के साथ प्रयोग किया।"
    ],
    "commentSummary": [
      "लेख प्रदर्शन को बढ़ाने, कम स्मृति खपत और प्रशिक्षण समय को कम करने के लिए बड़े भाषा मॉडल (एलएलएम) को ठीक करने के लिए एलओआरए (लो रैंक अनुकूलन) के उपयोग की पड़ताल करता है।",
      "प्रमुख खोजें स्मृति बचत, प्रशिक्षण गति और मॉडल प्रदर्शन पर विभिन्न अनुकूलन तकनीकों और हाइपरपैरामीटर चयन के प्रभाव को उजागर करती हैं।",
      "अनुकूलित एलओआरए मॉडल ने बेस एलएलएम मॉडल की तुलना में कई बेंचमार्क में प्रगति का प्रदर्शन किया, और लेख एलओआरए के हाइपरपैरामीटर को ट्यून करने के लिए व्यावहारिक सलाह प्रदान करता है।"
    ],
    "points": 238,
    "commentCount": 36,
    "retryCount": 0,
    "time": 1697206803
  },
  {
    "id": 37869534,
    "title": "सिग्नल पहचान - विकिपीडिया",
    "originLink": "https://www.sigidwiki.com/wiki/Signal_Identification_Guide",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37869534",
    "commentBody": "",
    "originSummary": [
      "उल्लिखित विकी रेडियो संकेतों की पहचान करने के लिए एक व्यापक संसाधन है, जो मुख्य रूप से सॉफ्टवेयर परिभाषित रेडियो के माध्यम से प्राप्त और रिकॉर्ड किए गए संकेतों पर ध्यान केंद्रित करता है।",
      "इसमें एक संपादन योग्य प्रारूप है, जो चर्चा टैब के माध्यम से इंटरैक्टिव जुड़ाव को बढ़ावा देता है, और आर्टेमिस 3 नामक एक साथी ऐप के माध्यम से ज्ञात संदर्भ संकेतों तक ऑफ़लाइन पहुंच प्रदान करता है।",
      "विकि पहचाने गए, अज्ञात और अनुरोधित संकेतों का एक रिकॉर्ड किया गया डेटाबेस रखता है और हाल ही में जोड़े गए या संशोधित संकेतों पर अपडेट भी प्रदान करता है।"
    ],
    "commentSummary": [
      "सिग्नल आइडेंटिफिकेशन विकिहैकर न्यूजपास्टलॉगइन वेबसाइट सिग्नल पहचान और शौकिया रेडियो संचार के विभिन्न पहलुओं पर चर्चा करती है, जो ज्ञान और संसाधन-साझाकरण सामुदायिक मंच के रूप में कार्य करती है।",
      "उपयोगकर्ता आगामी घटनाओं, सिग्नल पहचान के लिए संसाधनों और रेडियो उत्साही लोगों के लिए सस्ती हार्डवेयर उपलब्धता के बारे में जानकारी साझा करते हैं।",
      "बातचीत सिग्नल पहचान में मशीन लर्निंग और आर्टिफिशियल इंटेलिजेंस के संभावित अनुप्रयोगों पर भी प्रकाश डालती है।"
    ],
    "points": 230,
    "commentCount": 28,
    "retryCount": 0,
    "time": 1697197817
  },
  {
    "id": 37874220,
    "title": "माजदा कनेक्टेड सेवा एकीकरण को हटाना",
    "originLink": "https://www.home-assistant.io/blog/2023/10/13/removal-of-mazda-connected-services-integration/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37874220",
    "commentBody": "",
    "originSummary": [
      "माजदा ने एक ओपन-सोर्स योगदानकर्ता को एक संघर्ष विराम और निषेध पत्र भेजा है, जिसके परिणामस्वरूप एक पुस्तकालय को हटा दिया गया है जो माज़्दा की सेवाओं के साथ इंटरफेस करता है।",
      "इस निष्कासन ने होम असिस्टेंट के एकीकरण को प्रभावित किया है, जिसका नाम 'माजदा कनेक्टेड सर्विसेज' है, जो स्थानीय नियंत्रण और गोपनीयता को प्राथमिकता देने वाले होम असिस्टेंट होम ऑटोमेशन सिस्टम का एक हिस्सा है।",
      "होम असिस्टेंट, निराशा व्यक्त करते हुए, टेस्ला और ऑडी जैसे अन्य ऑटोमोबाइल निर्माताओं की तुलना में इस एकीकरण के संभावित पेशेवरों पर चर्चा के लिए माजदा को आमंत्रित करता है, जिन्होंने इसी तरह के एकीकरण को स्वीकार किया है।"
    ],
    "commentSummary": [
      "माजदा ने एक वेबसाइट से अपने माजदा कनेक्टेड सर्विसेज एकीकरण को हटाने की मांग की है, जिसमें आरोप लगाया गया है कि यह उनके ऐप स्टोर की पेशकश के साथ ओवरलैप करता है, जिससे इस दावे की वैधता पर बहस छिड़ गई है।",
      "ऑटोमेकर पर एक ओपन-सोर्स प्लेटफॉर्म के खिलाफ डीएमसीए नोटिस का दुरुपयोग करने का आरोप है, जिससे उपयोगकर्ता की स्वतंत्रता पर लाभ को प्राथमिकता देने का आरोप लगाया गया है।",
      "इस मुद्दे ने स्वचालन प्लेटफार्मों के साथ वाहनों को एकीकृत करने के संभावित जोखिमों पर चिंता पैदा की है।"
    ],
    "points": 228,
    "commentCount": 72,
    "retryCount": 0,
    "time": 1697223732
  },
  {
    "id": 37873749,
    "title": "iSponsorBlockTV v2: टीवी और गेम कंसोल के लिए प्रायोजक ब्लॉक",
    "originLink": "https://github.com/dmunozv04/iSponsorBlockTV",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37873749",
    "commentBody": "",
    "originSummary": [
      "iSponsorBlockTV प्रोजेक्ट एक ओपन-सोर्स टूल है जो उपयोगकर्ताओं को ऐप्पल टीवी, सैमसंग टीवी और एलजी टीवी जैसे विभिन्न टीवी उपकरणों पर यूट्यूब वीडियो देखने के दौरान प्रायोजक सेगमेंट और विज्ञापनों से बचने की अनुमति देने के लिए डिज़ाइन किया गया है।",
      "यह परियोजना पायथन में लिखी गई है और इन खंडों को ऑटो-स्किप करने के लिए प्रायोजकब्लॉक एपीआई को एकीकृत करती है, जो देखने के अनुभवों को बेहतर बनाने के लिए एक सक्रिय दृष्टिकोण का प्रदर्शन करती है।",
      "परियोजना को सक्रिय रूप से बनाए रखा जाता है, अन्य डेवलपर्स से योगदान को प्रोत्साहित करता है, और जीपीएल -3.0 लाइसेंस के तहत लाइसेंस प्राप्त है, जो विज्ञापन-अवरुद्ध प्रौद्योगिकियों में खुले सहयोग और प्रगति को बढ़ावा देता है।"
    ],
    "commentSummary": [
      "iSponsorBlockTV v2 एक नया टूल है जो उपयोगकर्ताओं को YouTube सहित वीडियो में प्रायोजित सेगमेंट और विज्ञापनों को छोड़ने में मदद करने के लिए डिज़ाइन किया गया है, जो उनके मीडिया खपत अनुभव को बढ़ाता है।",
      "उपयोगकर्ता विज्ञापनों से बचने से फोकस और मूड में सुधार की रिपोर्ट करते हैं, लेकिन वीडियो और यूट्यूब के विज्ञापन अनुभव में अनुस्मारक संकेतों के साथ आवाज की निराशा व्यक्त करते हैं।",
      "चर्चा में सामग्री निर्माता के राजस्व और विश्लेषिकी पर ऐसे उपकरणों का उपयोग करने के निहितार्थ भी शामिल हैं।"
    ],
    "points": 217,
    "commentCount": 85,
    "retryCount": 0,
    "time": 1697221178
  },
  {
    "id": 37871577,
    "title": "स्केलर: स्वैगर फ़ाइलों से इंटरैक्टिव एपीआई दस्तावेज उत्पन्न करें",
    "originLink": "https://github.com/scalar/scalar",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37871577",
    "commentBody": "",
    "originSummary": [
      "सॉफ्टवेयर प्रोजेक्ट 'स्केलर' स्वैगर फाइलों से इंटरैक्टिव एपीआई दस्तावेज बनाता है, जो विभिन्न भाषा अनुरोध उदाहरणों, एक एकीकृत एपीआई क्लाइंट और स्वैगर फ़ाइलों को संपादित करने की क्षमता जैसी सुविधाओं की पेशकश करता है।",
      "स्केलर ओपन-सोर्स और अनुकूलन योग्य है, जो विभिन्न विषयों और उन्नत स्टाइल का समर्थन करता है। यह Vue.js और React के साथ संगत है और अतिरिक्त पैकेज प्रदान करता है।",
      "परियोजना जनता से योगदान का स्वागत करती है और सामूहिक विकास और नवाचार को बढ़ावा देने के लिए एमआईटी लाइसेंस के तहत लाइसेंस प्राप्त है।"
    ],
    "commentSummary": [
      "स्केलर एक उपकरण है जो स्वैगर फ़ाइलों से इंटरैक्टिव एपीआई प्रलेखन बनाता है; इसकी उल्लेखनीय विशेषताओं में अनुकूलन विकल्प और सकारात्मक उपयोगकर्ता प्रतिक्रिया शामिल हैं।",
      "स्केलर-यूआई, एपीआई प्रलेखन के लिए एक और ओपन-सोर्स टूल, अपनी पेशकश को बढ़ाने के लिए टोकन ओएथ बियरर प्रमाणीकरण के लिए समर्थन शामिल करने की योजना बना रहा है।",
      "कंपनी स्वैगर-यूआई और ओपनएपीआई पारिस्थितिकी तंत्र में आगे योगदान की योजना बना रही है, जैसे कि एक समर्पित आरईएसटी एपीआई क्लाइंट और जावास्क्रिप्ट उपयोग के माध्यम से एपीआई प्रलेखन में सुधार।"
    ],
    "points": 211,
    "commentCount": 64,
    "retryCount": 0,
    "time": 1697210153
  },
  {
    "id": 37869220,
    "title": "काश मुझे पता होता कि मुझे अपना एएसएन कब मिला",
    "originLink": "https://quantum5.ca/2023/10/10/what-i-wish-i-knew-when-i-got-my-asn/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37869220",
    "commentBody": "",
    "originSummary": [
      "टेक्स्ट नेटवर्क सेटअप के लिए एक स्वायत्त सिस्टम नंबर (एएसएन) प्राप्त करने पर गाइड करता है, जिसमें क्षेत्रीय इंटरनेट रजिस्ट्रियों (आरआईआर) नीतियों को समझने की आवश्यकता पर जोर दिया गया है, जिसमें राइप और एआरआईएन पर ध्यान केंद्रित किया गया है।",
      "यह एक ऑर्ग आईडी बनाने, आईपी पते का अनुरोध करने, और एएसएन का अनुरोध करने और इंटरनेट पीयरिंग समझौतों के लिए एक डेटाबेस पीयरिंगडीबी पर पंजीकरण करने की सलाह देता है, और बीजीपी (बॉर्डर गेटवे प्रोटोकॉल) -सक्षम सर्वर या कोलोकेशन प्रदाता खोजने का सुझाव देता है।",
      "यह राइप लोकल इंटरनेट रजिस्ट्रियों (एलआईआर) और बीजीपी-सक्षम होस्टिंग प्रदाताओं के लिए सलाह के साथ समाप्त होता है, जो नेटवर्क स्थापित करने में तकनीकी विचारों की ओर इशारा करता है।"
    ],
    "commentSummary": [
      "लेखक आईपीवी 6 में यूएलए (अद्वितीय स्थानीय पते) का उपयोग करने और एएसएन (स्वायत्त प्रणाली संख्या) के बिना स्थिर पते प्राप्त करने में बाधाओं के साथ आश्चर्य और असंतोष व्यक्त करता है।",
      "वे RFC1918 पते का उपयोग करके स्थानीय रूप से आईपीवी 4 चलाने पर विचार करते हैं, एक ऐसा कदम जो आईपीवी 6 को आगे बढ़ाने के उद्देश्य के विपरीत है।",
      "वैकल्पिक समाधान ों के विकल्पों और पूर्ण तालिकाओं के लिए साथियों को प्राप्त करने पर सलाह पर चर्चा की जाती है।"
    ],
    "points": 193,
    "commentCount": 15,
    "retryCount": 0,
    "time": 1697194975
  },
  {
    "id": 37872850,
    "title": "यीशु अखरोट",
    "originLink": "https://en.wikipedia.org/wiki/Jesus_nut",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37872850",
    "commentBody": "",
    "originSummary": [
      "\"जीसस नट\" शब्द हेलीकॉप्टरों में मुख्य रोटर को बनाए रखने वाले अखरोट को संदर्भित करता है, एक घटक जिसकी विफलता से विनाशकारी परिणाम हो सकते हैं।",
      "यह स्लैंग शब्द वियतनाम युद्ध के दौरान उत्पन्न हुआ था और इसे सिस्टम के कामकाज के अभिन्न अंग किसी भी इंजीनियरिंग घटकों पर लागू किया जा सकता है।",
      "इसके महत्वपूर्ण कार्य के बावजूद, यीशु अखरोट पर वास्तविक चूक दुर्लभ हैं, लेकिन हर उड़ान से पहले इसकी जांच की जानी चाहिए।"
    ],
    "commentSummary": [
      "मुख्य विषय \"यीशु अखरोट\" के चारों ओर घूमता है, जो रोटर को सुरक्षित करने के लिए जिम्मेदार हेलीकॉप्टरों में एक महत्वपूर्ण घटक है - और रोटर की गति बहुत कम हो जाती है।",
      "चर्चा इस शब्द को सॉफ्टवेयर इंजीनियरिंग में विफलता के एकल बिंदुओं के संदर्भ में रूपक रूप से विस्तारित करती है, जिसमें \"यीशु अखरोट\" की महत्वपूर्ण भूमिका और सॉफ्टवेयर डिजाइन में महत्वपूर्ण तत्वों के बीच एक समानांतर खींचा गया है।",
      "अतिरिक्त विषयों में अपर्याप्त ईथरनेट बंदरगाहों, हेलीकॉप्टर सुरक्षा इंजीनियरिंग, साथ ही विमानन उद्योग में लागत और नियामक विचारों के लिए वर्कअराउंड शामिल हैं।"
    ],
    "points": 191,
    "commentCount": 91,
    "retryCount": 0,
    "time": 1697216645
  },
  {
    "id": 37870737,
    "title": "ब्लू फ्रंटियर और इसके ऊर्जा-कुशल एसी",
    "originLink": "https://www.technologyreview.com/2023/10/04/1080128/2023-climate-tech-companies-blue-frontier-air-conditioning-energy-storage-climate-technology/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37870737",
    "commentBody": "",
    "originSummary": [
      "ब्लू फ्रंटियर, एक स्टार्टअप, ने एक ऊर्जा-कुशल एयर कंडीशनिंग सिस्टम विकसित किया है जो ग्रिड अधिभार को रोकने के लिए वैकल्पिक रेफ्रिजरेंट और ऊर्जा भंडारण का उपयोग करके ग्रीनहाउस गैस उत्सर्जन को काफी कम कर देता है।",
      "पारंपरिक इकाइयों की तुलना में, ये एसी इकाइयां तीन गुना अधिक कुशल हैं, ऊर्जा की खपत को 60% से अधिक कम करती हैं और संभावित रूप से ग्रीनहाउस गैस उत्सर्जन को 80% से अधिक कम करती हैं।",
      "जबकि अभी भी शुरुआती विकास चरणों में है और उद्योग के नेताओं से प्रतिस्पर्धा का सामना कर रहा है, ब्लू फ्रंटियर ने वित्त पोषण में $ 26 मिलियन हासिल किए हैं और 2025 में वाणिज्यिक भवनों के लिए विनिर्माण शुरू करने की योजना है।"
    ],
    "commentSummary": [
      "ब्लू फ्रंटियर, एक स्टार्टअप, ने एक अधिक ऊर्जा-कुशल एयर कंडीशनिंग सिस्टम बनाया है जो नमी को खत्म करने के लिए एक डेसिकेंट का उपयोग करता है, जिससे संभावित रूप से बिजली के उपयोग में 90% की कमी आती है।",
      "कंपनी प्रारंभिक चरणों में है और अभी भी सिस्टम की प्रभावशीलता की पुष्टि करने के लिए क्षेत्र परीक्षण की आवश्यकता है; हालांकि, एसी सदस्यता सेवाओं और मौसमी अनुकूलन में इसके उपयोग की संभावना है।",
      "रखरखाव आवश्यकताओं, डेसिकेंट प्रतिस्थापन और ऐसे एयर कंडीशनिंग सिस्टम की समग्र दक्षता के बारे में चिंताओं को आवाज दी गई है।"
    ],
    "points": 190,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1697205716
  }
]
