[
  {
    "title": "The Disconnect: Americans' Negative View of Economy Despite Positive Indicators",
    "originLink": "https://apnews.com/article/economy-inflation-prices-jobs-income-recession-unemployment-e9e96643d8a1eb3ab2f57810219b8324",
    "originBody": "1 of 3Workers apply sheathing to the exterior of a new multifamily residential building, Friday, Nov. 3, 2023, in the East Boston neighborhood of Boston. According to a raft of polls and surveys, most Americans hold a glum view of the economy. (AP Photo/Michael Dwyer) Read More 2 of 3Shoppers consider big-screen televisions in a Costco warehouse Tuesday, Nov. 14, 2023, in Thornton, Colo. According to a raft of polls and surveys, most Americans hold a glum view of the economy. (AP Photo/David Zalubowski) Read More 3 of 3FILE - The per-gallon price is displayed electronically at the pump of a Shell station, July 5, 2023, in Englewood, Colo. According to a raft of polls and surveys, most Americans hold a glum view of the economy. (AP Photo/David Zalubowski, File) Read More By CHRISTOPHER RUGABER Updated 11:50 AM UTC, November 19, 2023 Share Share Copy Link copied Email Facebook X Reddit LinkedIn Pinterest Flipboard Print WASHINGTON (AP) — Inflation has reached its lowest point in 2 1/2 years. The unemployment rate has stayed below 4% for the longest stretch since the 1960s. And the U.S. economy has repeatedly defied predictions of a coming recession. Yet according to a raft of polls and surveys, most Americans hold a glum view of the economy. The disparity has led to befuddlement, exasperation and curiosity on social media and in opinion columns. Last week, the government reported that consumer prices didn’t rise at all from September to October, the latest sign that inflation is steadily cooling from the heights of last year. A separate report showed that while Americans slowed their retail purchases in October from the previous month’s brisk pace, they’re still spending enough to drive economic growth. Even so, according to a poll last month by The Associated Press-NORC Center for Public Affairs Research, about three-quarters of respondents described the economy as poor. Two-thirds said their expenses have risen. Only one-quarter said their income has. Other news Argentines vote in an election that could lead a Trump-admiring populist to the presidency Retail sales slip in October as consumers pull back after summer splurges US producer prices slide 0.5% in October, biggest drop since 2020 The disconnect poses a political challenge for President Joe Biden as he gears up for his re-election campaign. Polls consistently show that most Americans disapprove of Biden’s handling of the economy. Many factors lie behind the disconnect, but economists increasingly point to one in particular: The lingering financial and psychological effects of the worst bout of inflation in four decades. Despite the steady cooling of inflation over the past year, many goods and services are still far pricier than they were just three years ago. Inflation — the rate at which costs are increasing — is slowing. But most prices are high and still rising. Lisa Cook, a member of the Federal Reserve’s Board of Governors, captured this dynamic in recent remarks at Duke University. “Most Americans,” Cook said, “are not just looking for disinflation” — a slowdown in price increases. “They’re looking for deflation. They want these prices to be back where they were before the pandemic. ... I hear that from my family.” That’s particularly true for some of the goods and services that Americans pay for most frequently: Bread, beef and other groceries, apartment rents and utilities. Every week or month, consumers are reminded of how far those prices have risen. Deflation — a widespread drop in prices — typically makes people and companies reluctant to spend and therefore isn’t desirable. Instead, economists say, the goal is for wages to rise faster than prices so that consumers still come out ahead. How inflation-adjusted incomes have fared since the pandemic is a complicated question, because it’s difficult for just one metric to capture the experiences of roughly 160 million Americans. Adjusted for inflation, median weekly earnings — those in the middle of the income distribution — have risen at just a 0.2% annual rate from the final three months of 2019 through the second quarter of this year, according to calculations by Wendy Edelberg, a senior fellow at the Brookings Institution. That meager gain has left many Americans feeling that they have made little financial progress. For Katherine Charles, a 40-year old single mother in Tampa, Florida, inflation’s slowdown hasn’t made it easier to make ends meet. Her rent jumped 15% in May. Over the summer, to keep her electricity bill down, Charles kept the air conditioning off during the day despite Tampa’s blistering hot weather . She has felt the need to cut back on groceries, even though, she said, her 16-year old son and 10-year old daughter “are at the age they are eating everything in front of them.” “My son loves red meat,” Charles said. “We cannot any longer afford it the way we used to. The economy’s not getting better for nobody, especially not for me.” Charles, a call center representative with a company that handles customer service for the Medicare and Affordable Care Act health plans, received a raise to $18.21 an hour two years ago. But it wasn’t much of an increase. She doesn’t even remember how large it was. This month, Charles took part in a one-day strike against her employer, Maximus. She and her co-workers are seeking higher wages and more affordable health insurance. Charles’ two children are on Medicaid, she said, because Maximus’ health insurance is too expensive. Eileen Cassidy Rivera, a spokeswoman for Maximus, said that a recent survey of its 40,000 employees found that three-quarters of those who responded said “they would recommend Maximus as a great place to work.” “During the past five years, we have increased compensation, reduced out-of-pocket health care expenses and improved the work environment,” Rivera added. Rising prices have been a key driver of a wave of strikes and other forms of labor activism this year, with unions representing autoworkers, Teamsters and airline pilots winning sizable pay increases. Other factors also play a role in why many people are still unhappy with the economy. Political partisanship is one of them. With Biden occupying the White House, Republicans are far more likely than Democrats to characterize the economy as poor, according to the University of Michigan’s monthly survey of consumer sentiment. Karen Dynan, a Harvard economist who served in both the George W. Bush and Obama administrations, noted that distinct swings in economic sentiment occur after a new president is inaugurated, with voters from the party opposed to the president quickly switching to a more negative view. “The partisan divide is stronger than it was before,” she said. “Partly because the country is more polarized.” Even so, many Americans, like Charles, are still feeling the pain of inflation. The national average price of a gallon of milk reached $3.93 in October, up 23% since February 2020, just before the pandemic struck. A pound of ground beef, at $5.35, is 33% higher than it was then. Average gas prices, despite a steep decline from a year ago, are still 53% higher at $3.78 a gallon, on average. All those increases have far outpaced the rise in overall prices, which are up nearly 19% over the same period. Edelberg said the jump in prices for items that people typically buy most often helps explain why many people are disgruntled about the economy — even as Americans have remained confident enough to keep spending at a healthy pace. “Their purchasing power overall,” Edelberg said, “is doing pretty well.” Yet broad national data doesn’t capture the experiences of everyday Americans, many of whom haven’t seen their wages keep up with prices. “In real terms, most people are probably pretty close to where they were pre-pandemic,” said Brad Hershbein, a senior economist at the Upjohn Institute. “But there are a lot of exceptions.” Lower-income Americans, for example, have generally received the largest percentage wage gains since the pandemic. Fierce competition for front-line workers at restaurants, hotels, retailers and entertainment venues forced companies to provide significant pay hikes. But poorer people typically face a higher inflation rate, according to economic research, because they spend a greater proportion of their income on such volatile expenses as food, gas and rent — items that have absorbed some of the biggest price spikes. “At the lower end of the income distribution, people got somewhat higher pay raises,” said Anthony Murphy, a senior economic policy advisor at the Federal Reserve Bank of Dallas. “But I don’t think it compensates them for the fact that inflation was so much higher. They’re consuming a different bundle of goods than the average.” Census Bureau surveys that Murphy and his colleague Aparna Jayashankar have studied show that nearly half of Americans say they’re “very stressed” by inflation, little changed from a year earlier, even though inflation has tumbled since last year. Even for people whose incomes have kept pace with prices, research has long found that people hate inflation more intently than its economic impact would suggest. Most people do not expect their pay to keep up with rising prices. Even if it does, the higher pay may come with a time lag. “They’re obsessing over the fact that the prices they pay for the things that are very salient — gas, food, grocery store prices, rent — those things still seem elevated, even though they’re not increasing as rapidly as they were,” Hershbein said. “If everyone had lost a job,” he said, “we’d be focused on that.” CHRISTOPHER RUGABER Chris Rugaber covers the economy and the Federal Reserve twitter mailto",
    "originSummary": [
      "Many Americans hold a negative view of the economy, despite low inflation and low unemployment rates.",
      "Lingering effects of high inflation have led to higher prices for goods and services, causing financial stress for lower-income individuals.",
      "Political partisanship also shapes people's perceptions of the economy, creating a challenge for President Joe Biden."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700402985114
  },
  {
    "title": "Argentina's Presidential Election Run-Off: Crucial updates and insights",
    "originLink": "https://www.aljazeera.com/news/2023/11/19/argentina-holds-key-presidential-election-with-economy-at-stake",
    "originBody": "list 1 of 4 Argentina presidential election run-off: Here’s what’s to know",
    "originSummary": [
      "\"List 1 of 4 Argentina's presidential election run-off\" is a helpful resource for gaining important information and staying updated about the upcoming election in Argentina.",
      "This resource provides essential updates and details about the candidates, their policies, and the election process.",
      "It is crucial for anyone interested in the election to stay informed by referring to this list."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700402985114
  },
  {
    "title": "UK's Bloqs: Boosting Local Design and Manufacturing in the Maker Economy",
    "originLink": "https://www.forbes.com/sites/trevorclawson/2023/11/19/open-access-the-entrepreneurs-tapping-into-an-evolving-maker-economy/",
    "originBody": "FORBESSMALL BUSINESSENTREPRENEURS Open Access: The Entrepreneurs Tapping Into An Evolving Maker Economy Trevor Clawson Contributor Nov 19, 2023,05:13am EST Al Parra and Arnaud Nicholds are Co Founders and Directors at \"open access factory\" Bloqs BLOQS These days, we don’t hear quite so much about the “maker economy.” At a time when the word startup is indelibly associated with software in general and new hot categories such as deep tech and AI in particular, the work of twenty-century artisans rarely grabs headlines. And yet, the maker economy is thriving. From arts and crafts products sold on Etsy through to inventors and using crowdfunding platforms to connect with potential buyers, makers play an important role in today’s economy as designers, manufacturers, employers and taxpayers. And as the tech sector evolves, the ability to produce prototypes and small runs of physical objects may also play an increasing role in the development of technologies that combine software with physical equipment. The question is, of course, where does all this work actually get done? Pre-pay for a new product via a crowdfunding site and the chances are the item in question will be manufactured in a factory somewhere in Asia. The same may be true of prototypes. Unless a creator has both the skills and machinery to turn an idea into physical reality, the manufacturing work will probably have to be outsourced. Here in the UK, it can be difficult to find factories that offer short runs, so the only option is to look overseas. That’s a problem that Arnaud Nichols, Al Parra and Vinny Nanray have set out to address. As co-founders of Bloqs, they have created a co-working space for craftsmen and designers. Operating rather like software-oriented workspaces - with open plan design to encourage collaboration - and styled as an \"open access factory,\" it offers access to a wide range of tools on a pay-as-you-needs basis. When I spoke to Parra and Nichols earlier this week, I was keen to get their take on the maker economy and their own role in encouraging domestic design and manufacturing on a small scale. MORE FOR YOU OpenAI Investors Plot Last Minute Push With Microsoft To Reinstate Sam Altman As CEO Craftwork Out To Modernize Home Services Market Scores 6 Million Seed Round Why Entrepreneurship Is An Attractive Option For Older Adults Born Out Of Necessity Established twelve years ago, Bloqs was a venture born out of necessity. Nichols, Parra and Nanray were three of seven crafts workers facing eviction from a co-living/working space. Faced with the prospect of having nowhere to work, they leased a building in Enfield and began to fill it with equipment, some of it borrowed from Arnaud’s father. The idea was to provide makers with all they needed to work on a flexible basis. “The idea was to make it as big as possible and fill it with as many tools as possible,” says Parra. And as Nichols adds, the fundamental principle was to offer craftspeople a “no-overheads'' model.” They would only pay for the time spent working in Bloqs. In practice there is a wide range of equipment on offer, allowing users to work with wood, fabric, metal and 3D laser printers. Training is also provided for those who need it. So who does this cater for? Is it a space for traditional crafts workers or are centers like this something that startup founders - particularly those who combine software and hardware - should be taking advantage of? A Place For R&D Well, it’s a broad church. A user might be a furniture maker accessing the woodworking and fabric tools, or an engineer using the metalwork facilities. Some users might be fabricating products for customers or building prototypes. “So we have people doing cross-disciplinary R&D work and others doing small production runs,” says Nichols. In terms of R&D, Nichols cites the example of a climate tech company building a prototype machine for carbon sequestration. Typically carbon capture systems combine a range of disciplines, including chemistry and software engineering. But there is also the all-important physical component. A machine has to be built. Interfacing With Tech As Parra sees it, this is where the services offered by Bloqs reach beyond the obvious market of craftspeople, designers and engineers, and interface with the evolving tech-startup community. “In the new industry of tech, there is a lot of software and a lot of process. But there is also a lot to do physically. That’s a market that we are keen to serve,” he says. The company is also keen to encourage a home-grown maker industry. “If you want to mass produce something you will have to go to a massive factory,” says Nichols. “But if you have the node, you do something small and you can bring manufacturing close to home. You don’t have to manufacture overseas.” This, he believes aligns with the changing expectations of potential customers. “We are seeing a change in the industry,” he adds. “People are much more conscious about what they are consuming.” In particular, there is concern about the carbon footprint of manufactured products. All things being equal, goods produced closer to home are likely to generate fewer emissions around shipping than those wending their way from far-flung corners of the world. For its part, Bloqs uses solar power and recycles wood chippings in a bid to move closer to net zero. How much of this can be communicated to end consumers is perhaps an open question, but reducing C02 output is a good end in itself. Nicholas and Parra say they are keen to expand to other centers, using their pay-as-you-use model. They aren’t alone in the marketplace. Many British cities and towns are home to Makerspaces and universities have also been keen to offer facilities to their students. The key for would-be makers is to find facilities providing appropriate-for-purpose tools. In the meantime, Bloqs is catering to a range of constituencies, including the perhaps traditional audience of designers and small manufacturers and also tech startups who need a space where they can build prototype devices which may at some time in the future become cutting-edge products. Follow me on Twitter. Trevor Clawson I am a UK-based journalist and author with more than a decade's experience of writing about startups, tech companies and fast growth businesses. My career in journalism began ... Read More Editorial Standards Print Reprints & Permissions",
    "originSummary": [
      "Bloqs is an \"open access factory\" in the UK that offers co-working spaces and tools for craftsmen, designers, and tech startups to create prototypes and small production runs.",
      "The founders have a goal of supporting domestic design and manufacturing on a small scale and reducing the reliance on outsourcing to overseas factories.",
      "Bloqs prioritizes sustainability by utilizing solar power and recycling materials and has plans to expand to other centers and serve different groups within the maker economy."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700402985114
  },
  {
    "title": "Hunt's Optimism for Economy Dampened by Slow Progress, Hollywood Ending Unlikely",
    "originLink": "https://www.theguardian.com/business/2023/nov/19/hollywood-ending-unlikely-for-jeremy-hunt-with-progress-on-economy-slow",
    "originBody": "The chancellor, Jeremy Hunt, was remarkably cheerful as he did the rounds of the TV studios. Photograph: Jeff Overs/BBC/PA Economics viewpoint Jeremy Hunt Hollywood ending unlikely for Jeremy Hunt, with progress on economy slow Larry Elliott Chancellor is upbeat but there is little chance of autumn statement changing voter perceptions of Tory plan Sun 19 Nov 2023 06.55 EST I f the opinion polls are right, Jeremy Hunt is on the political equivalent of death row. Voters have passed judgment on the government and it is only a matter of time before the sentence is carried out. That’s not the way the chancellor sees it. For a condemned man, he was remarkably cheerful as he did the rounds of the TV studios in the run-up to Wednesday’s autumn statement. His message was simple: things may look bleak for the government but all is not lost. There is too much negativity. The long-term prospects are “fantastic”. The chancellor is confident there will be an 11th-hour pardon from the British people. Hunt says the tough decisions on tax and spending taken a year ago are bearing fruit and that the public can be brought round gradually to the idea of a reprieve. Jeremy Hunt faces red wall revolt if he delivers ‘a budget for the rich’ Read more Miracles do happen. Hunt may be able to pull off his own version of the Hollywood courtroom drama 12 Angry Men, with himself as Henry Fonda, but the chances of a not guilty verdict for the government whenever the election comes are vanishingly small. This is not the movies. There is no way back for the Tories without a marked improvement in the economy, and progress on that score is going to be slow at best. The autumn statement is unlikely to change voter perceptions. In part, that is because the package will be modest, even though the chancellor appears to have more money to play with than expected a few weeks ago. The preannounced £4.5bn investment in strategically important manufacturing, for example, is spread over five years and in no way matches the ambition of Joe Biden’s Inflation Reduction Act. That act provides genuine incentives for green businesses to invest in the US; Hunt’s money will barely touch the sides on its way down. That’s not all, though. The measures the chancellor is apparently contemplating – such as reducing inheritance tax and not fully uprating welfare benefits – would be poorly targeted and politically tin-eared. Hunt played down weekend speculation that he would announce cuts to income tax or national insurance on Wednesday. Ultimately, whatever Hunt does will be too little too late. The removal of Liz Truss was supposed to mark the nadir of the Conservative party’s fortunes but even with the “grownups” back in charge, poll ratings have not improved. The latest poll by Ipsos shows almost eight out of 10 voters – including 70% of Tory supporters – think public services have got worse over the past five years. In Hunt’s best-case scenario, the economy avoids going into a recession this winter and starts to recover gently in early 2024. Consumers feel better off because earnings are rising faster than prices. Inflation continues to fall, prompting the Bank of England to cut interest rates next spring. Cheaper borrowing reignites the housing market. The improvement in the public finances provides the scope for a giveaway budget. Voters feel less negative about the government and – at the last minute – produce a stay of execution. This, though, is based on two questionable assumptions: that the economy avoids recession this winter and that the public is prepared to forgive the government for the squeeze on living standards caused by a two-year cost of living crisis. The chances of avoiding a recession would be markedly improved were the Bank of England to start cutting interest rates. In previous economic cycles, growth this weak would have already led to lower borrowing costs but rates will be stuck at 5.25% until well into next year. The Bank’s concern about the risk of a wage-price spiral means there is no real chance of borrowing costs coming down any sooner, and that means there is no real prospect of the economy generating a head of steam until after the election. Given that interest rates have been going up and taxes have been raised, it is surprising the economy has held up as well as it has in 2023. A small increase in unemployment and stagnant growth represents a soft landing. In all the circumstances, things could have been a lot worse. skip past newsletter promotion Sign up to Business Today Free daily newsletter Get set for the working day – we'll point you to all the business news and analysis you need every morning Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy. We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion Hunt and Rishi Sunak have received zero credit for the economy outperforming expectations, which is what tends to happen to governments when they have the misfortune to preside over an economic crisis after such a long period in office. After 13 years, the signs are that voters think it is time for a change, just as they did at the 2010 election. By then, the economy had started to recover from the deep recession caused by the global financial crisis but Labour still lost. Hunt will find the money to announce some tax cuts on Wednesday Hunt will find the money to announce some tax cuts on Wednesday and will no doubt be even more generous in next spring’s budget. He will only be able to do so by ignoring the fragile state of the public finances, which are in a much worse state than he is prepared to admit. Interest rates are not going to return to rock-bottom levels and this means the government will have to run a tighter ship if it is to meet its own rules for the public finances. As far as Hunt is concerned, though, that’s a problem that can be put off until the other side of the election. He can come up with tax cuts and implausibly tough plans for public spending, knowing that someone else will have to deal with the consequences. That someone will almost certainly be Rachel Reeves. The shadow chancellor needs to learn a key lesson from Labour’s defeat in 2010: the importance of seizing control of the political narrative and blaming the outgoing government for any tough decisions she needs to take. Because, make no mistake, there will be some. Explore more on these topics Jeremy Hunt Economics viewpoint Autumn statement 2023 Economics Conservatives Bank of England Interest rates Economic policy comment Reuse this content",
    "originSummary": [
      "Chancellor Jeremy Hunt remains optimistic about the government's prospects, despite negative voter perceptions and is hopeful that tough decisions on tax and spending will ultimately benefit the economy.",
      "The upcoming autumn statement is unlikely to change these negative perceptions due to the proposed modest and poorly targeted measures.",
      "The chances of avoiding a recession and improving the economy before the election are uncertain, and the fragile state of public finances may hinder Hunt's plans to announce tax cuts."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700402985114
  },
  {
    "title": "Argentina Elects New President to Tackle Economic Crisis",
    "originLink": "https://www.wsj.com/world/americas/argentina-votes-for-new-president-to-confront-economic-crisis-99b73b86",
    "originBody": "By Kejal Vyas and Silvina Frydlewsky Nov. 19, 2023 7:33 am ET Share Resize Listen (2 min) People in Buenos Aires waiting Sunday to cast their vote. PHOTO: CRISTINA SILLE/REUTERS BUENOS AIRES—Argentines began to cast their ballots Sunday in a hotly contested presidential election between two candidates with starkly different views on how to pull the troubled country out of a punishing economic recession marked by a collapsing currency, growing poverty and one of the world’s highest rates of inflation. Polls had indicated a tossup between Economy Minister Sergio Massa and libertarian TV pundit Javier Milei. Massa, a 51-year-old lawyer who has directed the economy as inflation rose to 143%, has sought to distance himself from the unpopular ruling Peronist government, promising to deliver a “moderate and centrist” administration. Copyright ©2023 Dow Jones & Company, Inc. All Rights Reserved. 87990cbe856818d5eddac44c7b1cdeb8 Continue reading your article with a WSJ subscription Subscribe Now Already a subscriber? Sign In What to Read Next SPONSORED OFFERS TURBOTAX: Save up to $15 with TurboTax coupon 2023 THE MOTLEY FOOL: Epic Bundle - 3x Expert Stock Recommendations H&R BLOCK TAX: Get 20% off H&R Block tax software products TOP RESUME: Top Resume Coupon: 10% off professional resume writing EBAY: eBay coupon: Get extra 10% off $50+ GROUPON: Up to $50 off any order with Groupon promo code",
    "originSummary": [
      "Argentines are currently voting in a closely contested presidential election between Economy Minister Sergio Massa and libertarian TV pundit Javier Milei.",
      "Sergio Massa aims to distance himself from the unpopular ruling Peronist government and plans to lead a \"moderate and centrist\" administration if elected.",
      "The election is taking place during a severe economic recession in Argentina marked by a devaluing currency, high inflation, and increasing poverty."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700402985114
  },
  {
    "title": "Argentines vote in high-stakes election amid economic crisis",
    "originLink": "https://news.yahoo.com/argentina-holds-cliffhanger-election-economy-011043999.html",
    "originBody": "AFP Argentines vote in cliffhanger election with economy at stake Fran BLANDY and Sandra FERRER Sun, November 19, 2023 at 5:33 AM CST·4 min read 11 Link Copied Read full article Argentines have to choose between an economy minister who has overseen triple-digit inflation, or a political outsider threatening to upend the system (Luis ROBAYO) Oops! Something went wrong. Please try again later. More content below Oops! Something went wrong. Please try again later. More content below Desperate for a way out of a crippling economic crisis, Argentines began voting Sunday in a nail-biter election between embattled Economy Minister Sergio Massa and the libertarian outsider Javier Milei. The two men represent starkly different futures for Latin America's third-largest economy, creaking under triple-digit inflation and poverty levels over 40 percent. Polls show the candidates in a dead heat, with Milei holding such a slight advantage that no one wants to predict an outcome. Some 36 million Argentines will be able to vote until 6:00 pm (2100 GMT), with results expected a few hours later. The new president will take office on December 10. Massa, 51, is a charismatic and seasoned politician seeking to convince Argentines to trust him despite his performance as economy minister which has seen annual inflation hit 143 percent. His rival Milei is an anti-establishment outsider, who has vowed to halt Argentina's unbridled spending, ditch the peso for the US dollar, and \"dynamite\" the central bank. Argentines are \"on the edge of a nervous breakdown,\" said political analyst Ana Iparraguirre of GBAO Strategies, describing tensions over what comes next. Most are so disgusted with their options that \"they're going to have to choose the lesser of two evils.\" Turnout will be crucial with polls showing about 10 percent of voters still undecided, and the election taking place on a long weekend. \"Neither of the two candidates have good proposals. I voted for the one who will do the least damage to the country which is in a very complicated situation,\" said nurse Laura Coleman, 25. - Milei puts down chainsaw - Milei, a 53-year-old economist, is a political newcomer who stunned observers by surging to the front of the electoral race just months ago. He is often compared to former US president Donald Trump and Brazil's Jair Bolsonaro, with Massa accusing him of aping the two politicians by raising the specter of electoral fraud -- for which he has provided no evidence. Milei's rants against traditional parties who have failed to halt decades of economic decline have fired up voters tired of the status quo. \"I hope Milei wins,\" said taxi driver Daniel Ayala, 50, adding he was \"tired of the corruption\" of the ruling Peronist coalition. In a first-round election in October, Massa confounded the polls by coming first with almost 37 percent, while Milei scored about 30 percent of the vote. Both have scrambled to shore up millions of votes from the three losing candidates. Third-placed candidate Patricia Bullrich, from the powerful center-right opposition, has thrown her weight behind Milei. Milei has toned down his rhetoric to appeal to her more moderate voters, imploring the public not to give in to fear stoked by Massa's campaign. \"If you are afraid you will be paralyzed and... nothing will change. We are not going to privatize health and education, we are not going to allow the unrestricted carrying of guns,\" he said. He previously said he was going to ditch those ministries entirely and was in favor of making it easier to carry guns and even sell human organs. In recent weeks there has been no sign of the powered-up chainsaw he used to wield at rallies -- a symbol of cuts he wanted to make to public spending. - Calm alternative - Massa represents the Peronist coalition, a populist movement heavy on state intervention and welfare programs that has dominated Argentine politics for decades. He has sought to distance himself from the deeply unpopular outgoing President Alberto Fernandez and his Vice President Cristina Kirchner, who was last year convicted of fraud. Both have vanished from the public eye. Massa has sought to portray himself as the calm, statesmanlike opposite of Milei. However, analysts accuse him of abusing state resources to boost his electoral chances. This includes using ads to warn that transport prices would increase under Milei as well as slashing income taxes for almost the whole population and granting cash payouts to millions. - 'Unbelievably deep hole' - Whoever wins, analysts warn Argentina is in for a tough road ahead. Analysts say the strictly controlled peso is long overdue for a devaluation, and a lack of dollars has led to shortages in fuel, medicine and even bananas in recent weeks. With central bank reserves in the red and no credit line, the next government \"will be digging Argentina out of an unbelievably deep hole with very few resources to do so,\" said Benjamin Gedan, director of the Argentina Project at the Washington-based Wilson Center. fb/aha View comments",
    "originSummary": [
      "Argentina is currently holding a tightly contested election between Economy Minister Sergio Massa and libertarian candidate Javier Milei, with the country's struggling economy in the balance.",
      "Massa has been in charge during a period of high inflation, while Milei advocates for spending cuts, dollar adoption, and drastic changes to the central bank.",
      "Polls indicate that the race is extremely close, with 10% of voters yet to make up their minds. The winner will confront major hurdles such as the devaluation of the peso and a shortage of dollars."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700402985114
  },
  {
    "title": "Argentina faces pivotal election amidst economic crisis",
    "originLink": "https://www.france24.com/en/americas/20231119-argentina-braces-for-nail-biter-election-amid-economic-crisis",
    "originBody": "Argentina braces for nail-biter election amid economic crisis Desperate for a way out of a crippling economic crisis, Argentines will vote Sunday in a nail-biter election race between embattled Economy Minister Sergio Massa and the libertarian outsider Javier Milei. Issued on: 19/11/2023 - 07:50 Modified: 19/11/2023 - 12:04 3 min File photos: Javier Milei (L), the Liberty Advances coalition presidential candidate, in Cordoba, Argentina on November 16, 2023. Economy Minister Sergio Massa (R), the ruling party's presidential candidate, in Brasilia, Brazil, August 28, 2023. © Nicolas Aguilera, Eraldo Peres, AP By: NEWS WIRES ADVERTISING Read more The two men represent starkly different futures for Latin America’s third-largest economy, creaking under triple-digit inflation after decades of debt, financial mismanagement and currency volatility. Polls show the candidates in a dead heat, with Milei holding such a slight advantage that no one wants to predict an outcome. Polling opens at 8am local time (1100GMT) and closes at 6pm (2100GMT), with results expected a few hours later. Massa, 51, is a charismatic and seasoned politician seeking to convince Argentines to trust him despite his performance as economy minister which has seen annual inflation hit 143 percent and record poverty levels. His rival Milei is an anti-establishment outsider, who has vowed to halt Argentina’s unbridled spending, ditch the peso for the US dollar, and “dynamite” the central bank. Argentines are “on the edge of a nervous breakdown,” said political analyst Ana Iparraguirre of GBAO Strategies, describing tensions over what comes next. 01:55 Most are so disgusted with their options that “they’re going to have to choose the lesser of two evils.” “Unfortunately, one has to choose one of the two,” said florist Pablo Rivera, 55, who is leaning towards Milei. Milei puts down chainsaw Milei, a 53-year-old economist, is a political newcomer who stunned observers by surging to the front of the electoral race just months ago. He is often compared to former US president Donald Trump and Brazil’s Jair Bolsonaro, with Massa accusing him of aping the two politicians by raising the specter of electoral fraud – for which he has provided no evidence. Milei’s rants against traditional parties who have failed to halt decades of economic decline have fired up an angry population tired of the status quo. “What exists now doesn’t work for me. Maybe this change would be good,” said Milei supporter Matias Esoukourian, a 19-year-old economics student. In a first-round election in October, Massa confounded the polls by coming first with almost 37 percent, while Milei scored about 30 percent of the vote. Read moreEstablishment insider or political provocateur? Argentina faces stark presidential choice Both have scrambled to shore up millions of votes from the three losing candidates. Third-placed candidate Patricia Bullrich, from the powerful center-right opposition, has thrown her weight behind Milei. Milei has toned down his rhetoric to appeal to her more moderate voters, imploring the public not to give in to fear stoked by Massa’s campaign. “If you are afraid you will be paralyzed and ... nothing will change. We are not going to privatize health and education, we are not going to allow the unrestricted carrying of guns,” he said. He previously said he was going to ditch those ministries entirely and was in favor of making it easier to carry guns and even sell human organs. In recent weeks there has been no sign of the powered-up chainsaw he used to wield at rallies. Calm alternative Massa represents the Peronist coalition, a populist movement heavy on state intervention and welfare programs that has dominated Argentine politics for decades. He has sought to distance himself from the deeply unpopular outgoing President Alberto Fernandez and his Vice President Cristina Kirchner, who was last year convicted of fraud. Both have vanished from the public eye. Massa has sought to portray himself as the calm, statesmanlike opposite of Milei. However, analysts accuse him of abusing state resources to boost his electoral chances. This includes using ads to warn that transport prices would increase under Milei as well as slashing income taxes for almost the whole population and granting cash payouts to millions. ‘Unbelievably deep hole’ Whoever wins, analysts warn Argentina is in for a tough road ahead. Analysts say the strictly controlled peso is long overdue for a devaluation, and a lack of dollars has led to shortages in fuel, medicine, and even bananas in recent weeks. With over $400 billion in public debt, central bank reserves in the red, and no credit line, the next government “will be digging Argentina out of an unbelievably deep hole with very few resources to do so,” said Benjamin Gedan, director of the Argentina Project at the Washington-based Wilson Center. (AFP) Daily newsletterReceive essential international news every morning Subscribe Take international news everywhere with you! Download the France 24 app Share : Read more on related topics: Argentina elections economy USA US dollar poverty Latin America Donald Trump Related content PRESIDENTIAL ELECTIONS Establishment insider or political provocateur? Argentina faces stark presidential choice PEOPLE & PROFIT Milei or Massa? Argentinians face tough choice amid economic crisis INSIDE THE AMERICAS Argentina presidential election: Far-right Milei and Peronist Massa race neck and neck",
    "originSummary": [
      "Argentina is in the midst of a major election during a severe economic crisis.",
      "Ruling party candidate Sergio Massa and libertarian challenger Javier Milei are the main candidates with contrasting visions for the country's future.",
      "Massa, an experienced politician, has faced criticism for his handling of the economy, which has experienced high inflation and record poverty levels.",
      "Milei, an anti-establishment figure, has gained support for promises to reduce spending, adopt the US dollar, and bring changes to the central bank.",
      "Polls show a tight race, with both candidates working to secure additional votes.",
      "Regardless of the outcome, the next government will face significant challenges in addressing Argentina's deep economic troubles."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700402985114
  },
  {
    "title": "Good News for Economy Causes GOP Concerns",
    "originLink": "https://madison.com/opinion/cartoon/phil-hands-cartoon-good-news-economy/article_4f5f20d2-8589-11ee-bf6a-bb1914364098.html",
    "originBody": "top story editor's pickOpinion Advocates for ideas and draws conclusions based on the interpretation of facts and data. Hands on Wisconsin: Good news for the economy is bad news for the GOP Nov 19, 2023 59 min ago 0 Phil HandsWisconsin State Journal Follow Phil HandsWisconsin State Journal Facebook Twitter WhatsApp Email Print Copy article link Save Phil HandsWisconsin State Journal The latest economic indicators show that inflation in down and the economy is improving. This is a disaster for Republicans who are pinning their 2024 election hopes on the idea that Joe Biden has mismanaged the economy. Listen now and subscribe: Apple PodcastsGoogle PodcastsSpotifyStitcherRSS FeedOmny Studio Hands on Wisconsin archive Editorial Cartoon by Phil Hands 0 comments Tags Madison Wisconsin Catch the latest in Opinion Get opinion pieces, letters and editorials sent directly to your inbox weekly! Sign up! * I understand and agree that registration on or use of this site constitutes agreement to its user agreement and privacy policy. Phil HandsWisconsin State Journal Follow Phil HandsWisconsin State Journal Related to this story Most Popular Hands on Wisconsin: Wisconsin Badgers' air raid offense feels more like a free fall New Badgers football coach Luke Fickell was supposed to introduce the \"air raid\" offense to Wisconsin with more passing and a faster pace. But… Hands on Wisconsin: Nebraska gets stuck in Bucky's teeth The Badgers host the Cornhuskers of Nebraska in their last home game of the season at Camp Randall on Saturday. It's been a disappointing seas… Hands on Wisconsin: Tavern gets religion to stay open during public health crisis Republicans are hoping to push through a constitutional amendment that would bar the government from closing houses of worship during a public… Mendota Marsh: Oscar Fox gets excited for Thanksgiving Oscar Fox gets excited for Thanksgiving in this week's Mendota Marsh. Turkeys toss pigskin in this week's You Toon caption contest Turkeys toss a football in this week's You Toon caption contest",
    "originSummary": [
      "Recent economic indicators reveal a decrease in inflation and an improving economy, presenting a challenge for Republicans who have been banking on the narrative that Joe Biden mishandled the economy for the upcoming 2024 election.",
      "The positive economic data undermines the Republican's strategy to criticize Biden's economic policies and could weaken their campaign messaging.",
      "This shift in economic indicators may require Republicans to reassess their messaging and find alternative angles to challenge Biden's economic leadership."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700402985114
  },
  {
    "title": "Indiana's Hydrogen Hub Drives Economic and Environmental Sustainability",
    "originLink": "https://www.nwitimes.com/news/state-regional/business/hydrogen-hub-building-a-more-economically-and-environmentally-sustainable-economy-for-indiana/article_0b8b3440-8313-11ee-b5db-7fcebce47f88.html",
    "originBody": "alert top story Hydrogen Hub Building a More Economically and Environmentally Sustainable Economy for Indiana Tom Dakich Nov 19, 2023 2 hrs ago 0 Tom Dakich Provided Facebook Twitter WhatsApp Email Print Copy article link Save Tom Dakich Northern Indiana business leaders have been working hard over the past several years to attract new, 21st century businesses and industries to our region in order to create local jobs and strengthen local economies — and with great success. Our high-quality workforce, proximity to Chicago, business-friendly tax environment, and robust existing infrastructure have all helped make this vision of economic and environmental revitalization a reality. From the Quantum Corridor that spreads across northern Indiana under the Indiana Toll Road to the Digital Crossroad data center in Hammond, Indiana, investments in building out our technology and data infrastructure are helping create new economic opportunities. Moreover, these investments are helping transform our region from being known as a leading polluter to one that is on the cutting edge of technology, successfully advancing both environmental and economic sustainability goals. People are also reading… Omaha landlord paints house rainbow colors in response to neighbor's disparaging comments Calumet Fisheries temporarily closed after failing health inspection New doctors join Franciscan Physician Network in Crown Point Sandhill cranes flocking back to Northwest Indiana The recent announcement that the Midwest Alliance for Clean Hydrogen (MachH2) was awarded a portion of the $7 billion allocated by the Infrastructure Investment and Jobs Act (IIJA) to accelerate the production and use of clean hydrogen is just the latest example of this positive new trend. Thanks to the focused leadership of Governor Eric Holcomb, Senator Todd Young, and Representative Frank Mrvan, the MachH2 hub was just one of seven clean hydrogen hubs across the country to receive IIJA funding, Listen now and subscribe: Apple PodcastsGoogle PodcastsSpotifyStitcherRSS FeedOmny Studio Video Player is loading. Play Video Play Mute Current Time 0:00 / Duration 0:00 Loaded: 0% Stream Type LIVE Seek to live, currently behind liveLIVE Remaining Time -0:00 1x Playback Rate Chapters Chapters Descriptions descriptions off, selected Captions captions and subtitles off, selected Audio Track Picture-in-PictureFullscreen This is a modal window. Beginning of dialog window. Escape will cancel and close the window. Text Color White Black Red Green Blue Yellow Magenta Cyan Transparency Opaque Semi-Transparent Background Color Black White Red Green Blue Yellow Magenta Cyan Transparency Opaque Semi-Transparent Transparent Window Color Black White Red Green Blue Yellow Magenta Cyan Transparency Transparent Semi-Transparent Opaque Font Size 50% 75% 100% 125% 150% 175% 200% 300% 400% Text Edge Style None Raised Depressed Uniform Dropshadow Font Family Proportional Sans-Serif Monospace Sans-Serif Proportional Serif Monospace Serif Casual Script Small Caps Reset restore all settings to the default valuesDone Close Modal Dialog End of dialog window. True believers in Jesus don’t need a “secondary plan” for salvation and eternal life. They need to follow the actions of Jesus Christ, according to Pastor Greg Lee of Suncrest Christian Church in St. John. “Followers of Jesus - church people - tend to forget that following Jesus is the way to get to heaven. But they’ve somehow constructed a different way in their mind by beating people into it, or convincing people about it, or telling people they’re wrong,\" Lee says. On this week’s show, Lee joins us in the studio to examine the gospel about Jesus Christ and why too many Christians don’t act Christ-like in their daily lives. “If you look at who Jesus had his harshest words for, it was for religious people who were harsh to people who were on the margins,” Lee tells Jerry, who's been on the margins of spirituality for decades. We hope you join us for a candid conversation - not a sermon - about faith, redemption, conviction and forgiveness. Also, how to demonstrate grace and mercy with a species that instinctively seeks justice. About the show “She Said, He Said\" with co-hosts Jerry Davich and Karen Davich unpacks all the baggage about relationships, couples and issues between the sexes (and the ex’s). “Because there’s a lot to unpack,” Karen says. The dangers of online dating. The fun of flirting. Blended families. Difficult in-laws. Connecting after arguments. First kisses and final divorces. You name it, they’ll unpack it on “She Said, He Said.” All episodes are now available for viewing at NWI.com or to listen on your favorite platforms such as Apple, Spotify, Google and Audacy. Subscribe to not miss any new episodes. The couple's podcast is sponsored by Times Media Co. and Lee Enterprises. It's recorded each week at CreataSpacePlace studios in Hobart, Indiana, with local guests in the studio and timeless topics on the table. In total, the regional MachH2 hydrogen hub — which includes Indiana as well as Illinois and Michigan — will receive $1 billion worth of investments to bring the groundbreaking clean energy project to life. According to projections by the U.S. Department of Energy, it will create 13,600 direct jobs for our states while driving private-sector investments in Indiana communities. MachH2 will help the United States continue to increase production of, and discover new applications for, clean hydrogen as a fuel source, ensuring Northern Indiana and our entire region continue to lead on carbon reduction and clean energy. Altogether, the project comprises over 70 private and public businesses, economic development groups, and educational institutions across our region, including Purdue University Northwest, which will be involved in research and workforce development efforts that will create exciting new industry partnership opportunities for students and faculty alike. Enormous changes have begun over the years, particularly in the past decade or so. Looking back on the days when Hammond was home to one of the dirtiest power plants in the nation, I’m immensely proud on the progress we have made and the role that Digital Crossroad has played in helping transform the old State Line Power Station into a 21st century green data center. Ultimately, the soon-to-be MachH2 clean hydrogen hub will enable Northwest Indiana to continue building on the progress and momentum of the past few years, both to grow a stronger economy as well as to reduce emissions and improve the quality of life in our communities. This project should supercharge the revitalizing of the region and attract new businesses, grow our clean energy capabilities, and create high-paying jobs for Hoosiers — and I’m thankful to our leaders from Indianapolis to Washington, D.C. for helping secure this much-needed, economy-growing project. Tom Dakich is the Chief Executive Officer for Quantum Corridor and the Founder of Digital Crossroad. 0 Comments Love 1 Funny 0 Wow 0 Sad 0 Angry 0 The business news you need Get the latest local business news delivered FREE to your inbox weekly. Sign up! * I understand and agree that registration on or use of this site constitutes agreement to its user agreement and privacy policy. Related to this story Most Popular NWI Business Ins and Outs: Battista's Market & Deli, Kid's Empire at Southlake Mall, Red's Deli and Cheers opening; The Chesterton Brewery closes NWI Business Ins and Outs: Battista's Market & Deli, Kid's Empire at Southlake Mall, Red's Deli and Cheers open; The Chesterton Brewery closes NWI Business Ins and Outs: Veleros, Mi Sueño, Flako's Tacos and Greco Nut and Candy open; Big N Little Shoes and Chick & Shake close NWI Business Ins and Outs: Veleros, Mi Sueño, Flako's Tacos and Greco Nut and Candy open; Big N Little Shoes and Chick & Shake close Hard Rock hits two years as Indiana's top-earning casino Hard Rock wrested the title from the Horseshoe Casino barely five months after opening, and the Gary gaming and entertainment destination has … Consultant hired for convention center study update The new study is intended to evaluate market demand for a convention center in Lake County and estimate the economic impact of one. NWI Business Ins and Outs: Tiny's Coffee Bar, Polish Peasant Kolasa's Restaurant and Starbucks open; Brickie's Gyros, Station 801, Cedar Sub Shop and Walgreens close NWI Business Ins and Outs: Tiny's Coffee Bar, Polish Peasant Kolasa's Restaurant and Starbucks open; Brickie's Gyros, Station 801, Cedar Sub S… Watch Now: Related Video Video Player is loading. Play Video Play Mute Current Time 0:00 / Duration 0:00 Loaded: 0% Stream Type LIVE Seek to live, currently behind liveLIVE Remaining Time -0:00 1x Playback Rate Chapters Chapters Descriptions descriptions off, selected Captions captions and subtitles off, selected Audio Track Picture-in-PictureFullscreen This is a modal window. Beginning of dialog window. Escape will cancel and close the window. Text Color White Black Red Green Blue Yellow Magenta Cyan Transparency Opaque Semi-Transparent Background Color Black White Red Green Blue Yellow Magenta Cyan Transparency Opaque Semi-Transparent Transparent Window Color Black White Red Green Blue Yellow Magenta Cyan Transparency Transparent Semi-Transparent Opaque Font Size 50% 75% 100% 125% 150% 175% 200% 300% 400% Text Edge Style None Raised Depressed Uniform Dropshadow Font Family Proportional Sans-Serif Monospace Sans-Serif Proportional Serif Monospace Serif Casual Script Small Caps Reset restore all settings to the default valuesDone Close Modal Dialog End of dialog window. Army veteran in Aberdeen: 'We have been living in terror' Palestinians say killings by Israeli army similar to massacres carried out in 1948 'Nakba' Palestinians say killings by Israeli army similar to massacres carried out in 1948 'Nakba' Israeli army orders doctors, patients to evacuate. Israeli army orders doctors, patients to evacuate. Lerner and Rowe turkey giveaway Lerner and Rowe turkey giveaway",
    "originSummary": [
      "Business leaders in Northern Indiana have successfully attracted environmentally sustainable businesses and transformed the region into a clean technology hub, shifting away from being a leading polluter.",
      "The Midwest Alliance for Clean Hydrogen (MachH2) will receive funding from the Infrastructure Investment and Jobs Act to accelerate the production and use of clean hydrogen.",
      "The regional MachH2 hydrogen hub, consisting of Indiana, Illinois, and Michigan, will receive $1 billion in investments and create 13,600 direct jobs, aiming to further reduce emissions, enhance community quality of life, and attract new businesses to the area."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700402985114
  }
]
