[
  {
    "id": 38871987,
    "title": "Klicks: Die ultimative iPhone-Tastatur für verbessertes Tippen und mehr Produktivität",
    "originLink": "https://www.clicks.tech/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38871987",
    "commentBody": "",
    "originSummary": [
      "Clicks ist eine Entwicklertastatur für das iPhone, die den Benutzern mehr Platz auf dem Bildschirm, ein verbessertes Tipperlebnis und Zugriff auf Tastenkombinationen bietet.",
      "Sie ermöglicht es den Nutzern, die Bildschirmfläche ihres iPhones für die Erstellung von Inhalten zu maximieren und bietet eine nahtlose Integration in iOS.",
      "Clicks ist derzeit für die Modelle iPhone 14 Pro, iPhone 15 Pro und Pro Max als limitierte Auflage zu Preisen ab 139 US-Dollar erhältlich."
    ],
    "commentSummary": [
      "Die Nutzer diskutieren über ihren Wunsch nach physischen Tastaturen auf Smartphones und die Herausforderungen, die sie bei der Suche nach Geräten haben, die diesem Wunsch entsprechen.",
      "Die Sehnsucht nach älteren Geräten mit physischen Tastaturen wird ebenso geäußert wie der Wunsch nach mehr Abwechslung und Aufregung im Smartphone-Design.",
      "Die Benutzer erkunden verschiedene Optionen zur Befestigung von Tastaturen und diskutieren das Potenzial für innovative Designs, die Touchscreens und physische Tastaturen kombinieren."
    ],
    "points": 715,
    "commentCount": 416,
    "retryCount": 0,
    "time": 1704401000
  },
  {
    "id": 38869235,
    "title": "Teilen Sie die Website Sit Down für Entspannung und Komfort",
    "originLink": "https://sonnet.io/posts/sit/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38869235",
    "commentBody": "",
    "originSummary": [
      "Der Autor sendet Neujahrsgrüße und ermutigt die Leser, eine Website, die Entspannung oder Vergnügen bietet, mit Freunden zu teilen.",
      "Der Zweck der Website wird durch zwei Links erläutert."
    ],
    "commentSummary": [
      "Der Text enthält eine Reihe unzusammenhängender Kommentare zu verschiedenen Themen, darunter die Nutzung einer Meditations-App namens Sit und die möglichen Risiken der Meditation.",
      "Es gibt auch Diskussionen über den Vollbildmodus in Browsern, Techniken zur Gestaltung von Websites und eine App für Atemübungen.",
      "Darüber hinaus werden die fehlende persönliche Note bei Online-Interaktionen und die Verfolgung der Meditationszeit genannt."
    ],
    "points": 532,
    "commentCount": 97,
    "retryCount": 0,
    "time": 1704386970
  },
  {
    "id": 38872362,
    "title": "Go: Gleichzeitigkeit und Einfachheit setzen sich durch, Fehler werden behoben",
    "originLink": "https://commandcenter.blogspot.com/2024/01/what-we-got-right-what-we-got-wrong.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38872362",
    "commentBody": "",
    "originSummary": [
      "Die Programmiersprache Go hat sich erfolgreich für die Gleichzeitigkeit, die Einfachheit von Serversoftware und die Verwendung von Schnittstellen eingesetzt.",
      "Es wurden Fehler gemacht, indem keine klare Anleitung zur Gleichzeitigkeit gegeben wurde und Probleme mit Abhängigkeitsgraphen in der Paketverwaltung nicht behandelt wurden.",
      "Trotz der Probleme hat Go eine unterstützende Gemeinschaft und ist aufgrund seiner starken Standardbibliothek und der Konzentration auf Codekonsistenz und Kompatibilität weiterhin erfolgreich."
    ],
    "commentSummary": [
      "Die Zusammenfassung gibt einen Überblick über den Artikel und den Kommentar-Thread, wobei der Schwerpunkt auf der Entwicklung und dem Erfolg der Programmiersprache Go im Bereich der serverseitigen und Netzwerk-Software im Vergleich zu Python und Java liegt.",
      "Es werden die Einschränkungen und Kritikpunkte von Go erörtert, darunter die Handhabung von Low-Level-C/C++-Code, das Fehlen bestimmter Funktionen und die Herausforderungen bei der Systemprogrammierung.",
      "Die Zusammenfassung beleuchtet die verschiedenen Perspektiven auf die Eignung von Go für verschiedene Programmierzwecke, seine Einfachheit, die Paketverwaltung, die Fehlerbehandlung und die Entscheidung, die Hinzufügung von Generika zu verzögern. Die Meinungen über die Stärken und Schwächen von Go variieren zwischen den Teilnehmern."
    ],
    "points": 527,
    "commentCount": 471,
    "retryCount": 0,
    "time": 1704402968
  },
  {
    "id": 38868115,
    "title": "Iggy.rs: Revolutionierung des Nachrichten-Streamings mit Rust",
    "originLink": "https://blog.iggy.rs/posts/building-message-streaming-in-rust/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38868115",
    "commentBody": "",
    "originSummary": [
      "Iggy.rs ist eine Nachrichten-Streaming-Plattform, die in Rust mit dem Ziel entwickelt wurde, leichtgewichtig, schnell und benutzerfreundlich zu sein und gleichzeitig einen hohen Durchsatz und eine geringe Latenz zu erreichen.",
      "Die Plattform hat bereits einen persistenten Streaming-Server implementiert und verfügt über ein engagiertes Team von Mitarbeitern, die an verschiedenen Bereichen des Projekts arbeiten.",
      "Zu den Merkmalen von Iggy.rs gehören die Unterstützung mehrerer Streams, Transportprotokolle und Authentifizierung. Es ist geplant, Clustering-Funktionen hinzuzufügen und das Feedback der Nutzer zu berücksichtigen, um kontinuierliche Verbesserungen zu erzielen."
    ],
    "commentSummary": [
      "Iggy.rs ist ein in Rust entwickeltes Nachrichten-Streaming-Projekt, das eine Plattform für kollaborative Nachrichtenübermittlung schaffen soll.",
      "Der Artikel behandelt verschiedene Lösungen für das Nachrichten-Streaming, technische Aspekte, die Verwendung von Rust-Laufzeiten und die Leistung von TCP gegenüber QUIC.",
      "Der Autor bekundet sein Interesse an einer zukünftigen Konzentration auf die Linux-Entwicklung und erkundet die Vorteile von Rust für Entwickler und verschiedene Arten der Programmierung."
    ],
    "points": 289,
    "commentCount": 55,
    "retryCount": 0,
    "time": 1704382174
  },
  {
    "id": 38868265,
    "title": "AMD aktualisiert 22 Jahre alte GPUs mit Vertex Shader Code Review",
    "originLink": "https://gitlab.freedesktop.org/mesa/mesa/-/merge_requests/26816",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38868265",
    "commentBody": "",
    "originSummary": [
      "Diese Codeüberprüfung konzentriert sich auf die Verschiebung der Backend-Senkung in NIR für Vertex-Shader, was eine Voraussetzung für weitere Backend-Bereinigungen ist.",
      "Der Prozess der Absenkung ist aufgrund der Reihenfolge der Durchläufe und der Notwendigkeit von benutzerdefinierten algebraischen Durchläufen komplexer.",
      "Die Reihe von Änderungen in der Überprüfung ermöglicht zukünftige Bereinigungen und hat Verbesserungen in der Shader-DB für R500 gezeigt, mit meist gleichmäßigen Ergebnissen für R300."
    ],
    "commentSummary": [
      "Die Diskussionen befassen sich mit der Debatte um Open-Source-Hardwaretreiber, einschließlich der Vorteile, Bedenken und der Rolle von Open-Source-Gemeinschaften bei der Verbesserung von Treibern.",
      "Ein Schwerpunkt liegt auf AMDs GPU-Treibern und deren Unterstützung für ältere GPUs, wobei die Bedeutung von Kompatibilität und Unterstützung für ältere Hardware hervorgehoben wird.",
      "Die Diskussionen befassen sich auch mit den Einschränkungen von Softwarebibliotheken und Treibern für ältere Hardware in Anwendungen des maschinellen Lernens sowie mit der Leistung, Erschwinglichkeit und Lebensdauer verschiedener GPUs und Betriebssysteme."
    ],
    "points": 272,
    "commentCount": 94,
    "retryCount": 0,
    "time": 1704382782
  },
  {
    "id": 38871295,
    "title": "Nestflix: Entdecken Sie mehr als 700 verschachtelte Filme und Serien mit fiktionalen Welten in Welten",
    "originLink": "https://nestflix.fun/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38871295",
    "commentBody": "",
    "originSummary": [
      "Nestflix ist eine einzigartige Plattform, die eine Sammlung von über 700 verschachtelten Filmen und Serien bietet, mit fiktiven Filmen in Filmen und fiktiven Serien in Serien.",
      "Die Plattform bietet ein breites Spektrum an Genres, darunter Dramen, Komödien, Actionfilme, Science-Fiction-Filme, Kriegs- und Historiendramen, Thriller, Krimis, romantische Dramen, Horrorfilme, Reality-TV, Spielshows, Varietéshows, Webshows, Sitcoms, Musicals und Talkshows.",
      "Nestflix stellt verschiedene Geschichten vor, die von Stadtkrimis bis hin zur Hintergrundgeschichte des Handlangers eines Superhelden reichen."
    ],
    "commentSummary": [
      "Nestflix ist eine Crowd-Source-Datenbank mit fiktionalen Fernseh- und Kinofilmen. Die Nutzer bewerten die Sammlung und schlagen künftige Entwicklungen vor, indem sie KI einsetzen, um Episoden in voller Länge zu erstellen.",
      "Die Website regt Diskussionen über die Auswirkungen der KI-Automatisierung in verschiedenen Branchen, die Übersättigung in der Filmbranche und die Bedeutung von gutem Schreiben an.",
      "Es wird angenommen, dass gut geschriebene Filme mit der Verbreitung von Spezialeffekten an Wert gewinnen, auch wenn das Marketing nach wie vor eine wichtige Rolle spielt."
    ],
    "points": 268,
    "commentCount": 78,
    "retryCount": 0,
    "time": 1704397311
  },
  {
    "id": 38866256,
    "title": "Global Fishing Watch deckt mit KI und Satellitenbildern versteckte industrielle Fischereifahrzeuge und Offshore-Infrastruktur auf",
    "originLink": "https://globalfishingwatch.org/press-release/new-research-harnesses-ai-and-satellite-imagery-to-reveal-the-expanding-footprint-of-human-activity-at-sea/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38866256",
    "commentBody": "",
    "originSummary": [
      "Global Fishing Watch hat mithilfe von künstlicher Intelligenz und Satellitenbildern die erste globale Karte des Verkehrs großer Schiffe und der Offshore-Infrastruktur erstellt, die bisher unbekannte industrielle Aktivitäten im Meer aufzeigt.",
      "Die Studie ergab, dass 75 % der industriellen Fischereifahrzeuge der Welt für die Öffentlichkeit nicht sichtbar sind.",
      "Es wurden \"dunkle Flotten\" identifiziert, die in geschützten Meeresgebieten operieren, und es gibt eine hohe Konzentration von Schiffen in asiatischen Gewässern im Vergleich zu Europa.",
      "Die Forschungsergebnisse deuten auf einen Rückgang der Fischereitätigkeit während der COVID-19-Pandemie hin, während die Entwicklung der Offshore-Energie, insbesondere der Windkraftanlagen, zunahm.",
      "Diese Technologie hat das Potenzial, zur Bewältigung des Klimawandels beizutragen und das Meeresmanagement und die Transparenz zu verbessern."
    ],
    "commentSummary": [
      "Es finden Diskussionen über die Verfolgung und Überwachung menschlicher Aktivitäten auf See statt, insbesondere über die illegale Fischerei und die Schwierigkeiten bei der Durchsetzung von Vorschriften.",
      "KI, Satellitenbilder, AIS und ADS-B werden eingesetzt, um menschliche Aktivitäten auf See zu erkennen und zu analysieren.",
      "Bedenken hinsichtlich des Datenschutzes, der unterschiedlichen Durchsetzung von Vorschriften, der Umweltauswirkungen von Schiffsemissionen, des Rückgangs der Fischpopulationen und der chinesischen Fischereiaktivitäten in fremden Gewässern sind die wichtigsten Themen, die im Zusammenhang mit Meeresaktivitäten und der Notwendigkeit von Vorschriften, Überwachung und Durchsetzung zum Schutz der Meeresressourcen diskutiert werden."
    ],
    "points": 262,
    "commentCount": 171,
    "retryCount": 0,
    "time": 1704371973
  },
  {
    "id": 38873810,
    "title": "Sicheres und vereinfachtes Wi-Fi für Heimnetzwerke: Erkundung von WPA3 Enterprise und EAP-TLS",
    "originLink": "https://smallstep.com/blog/home-network-eap-tls-wifi/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38873810",
    "commentBody": "",
    "originSummary": [
      "Die Verwendung von NSA-Grade-Wi-Fi zu Hause wird aufgrund der Komplexität und der Kompatibilitätsprobleme mit Geräten nicht empfohlen.",
      "Für Wi-Fi-Heimnetzwerke werden alternative Sicherheitsmodi wie WPA2-PSK oder WPA3-Personal empfohlen.",
      "Für die sichere Netzwerkauthentifizierung im Unternehmens-Wi-Fi wird EAP-TLS empfohlen. Es werden Anleitungen zur Einrichtung eines Wi-Fi-Netzwerks mit WPA3-Enterprise-Authentifizierung, zur Sicherung von Netzwerken für die Einhaltung des HIPAA und zur manuellen Verwaltung von Apple-Geräten für MDM gegeben. Der Artikel erläutert auch die Erstellung von Zertifikaten für Hausgäste."
    ],
    "commentSummary": [
      "Die Sicherheit von Wi-Fi-Netzen und die Wirksamkeit von Authentifizierungsmethoden werden diskutiert.",
      "Zu den Themen gehören die Verwendung von VPNs für den Zugang zu sensiblen Daten, die Grenzen des alleinigen Verlassens auf die Wi-Fi-Authentifizierung und die Notwendigkeit eines mehrschichtigen Schutzes.",
      "Weitere Themen sind die Sicherung von IoT-Geräten, die Vorteile von Gateways und Firewalls, die Verwendung mehrerer Pre-Shared Keys und die Grenzen von WPS.",
      "Die Verwendung von EAP-TLS für die sichere Authentifizierung, die Geräteidentifizierung und die Implementierung von RADIUS-Servern werden ebenfalls behandelt.",
      "Es ist bekannt, dass es nicht ausreicht, sich bei der Sicherheit allein auf Wi-Fi zu verlassen, und dass zusätzliche Maßnahmen ergriffen werden müssen."
    ],
    "points": 256,
    "commentCount": 146,
    "retryCount": 0,
    "time": 1704411842
  },
  {
    "id": 38868185,
    "title": "Rosebud AI: Verwandeln Sie Spielbeschreibungen in Browserspiele mit AI-generiertem Code",
    "originLink": "https://news.ycombinator.com/item?id=38868185",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38868185",
    "commentBody": "",
    "originSummary": [
      "Rosebud AI ist eine Plattform, die es technisch nicht versierten Entwicklern ermöglicht, Spiele zu entwickeln, indem sie auf der Grundlage ihrer Spielbeschreibungen den Code für sie generiert.",
      "Es unterstützt browserbasierte JavaScript-Frameworks und setzt auf KI-Nicht-Spieler-Charaktere (NPCs), die LLMs (Large Language Models) für Dialoge und Aktionen verwenden.",
      "Die Plattform unterscheidet sich durch ihren einzigartigen Ansatz bei der Spieleerstellung und die Verwendung von generativer KI von anderen Spiele-Engines und arbeitet nach einem ähnlichen Geschäftsmodell wie Roblox, das es den Entwicklern ermöglicht, von den Nutzern Gebühren zu verlangen und einen Anteil an den Einnahmen zu erhalten. Das Feedback der Beta-Tester ist positiv."
    ],
    "commentSummary": [
      "Rosebud AI ist eine Plattform, die es technisch nicht versierten Entwicklern ermöglicht, Spielbeschreibungen in Browserspiele zu verwandeln, insbesondere in RPGs und Hindernisparcours.",
      "Die Plattform nutzt große Sprachmodelle (LLMs) für Dialoge und Handlungen, die positives Feedback für Benutzerfreundlichkeit und KI-Unterstützung erhalten haben.",
      "Die Nutzer haben sich über unvollständigen oder fehlerhaft generierten Code und die Einschränkungen des chatbasierten Ansatzes beklagt, was das Team dazu veranlasst hat, an der Verbesserung der Plattform und der Backend-Prozesse zu arbeiten.",
      "Das Team erforscht auch Möglichkeiten für KI-generierte Spiele, was zu Diskussionen über die potenzielle Sättigung des Marktes mit mehr Entwicklern, die Rolle der KI bei der Spieleentwicklung und die Bedeutung von Dialogen und Alternativen im Spiel führt.",
      "Einige Nutzer haben mit der Plattform erfolgreich Tower-Defense-Spiele entwickelt, mit positivem Feedback.",
      "Es gibt Bedenken hinsichtlich des Wertangebots und des potenziellen Erfolgs der Plattform. Es wird vorgeschlagen, sich auf generative KI-Kunstwerke zu konzentrieren und sich an künftige Fortschritte bei der Codegenerierung anzupassen."
    ],
    "points": 251,
    "commentCount": 91,
    "retryCount": 0,
    "time": 1704382430
  },
  {
    "id": 38870727,
    "title": "Kritische Bewertungen von überbewerteten technischen Themen",
    "originLink": "https://github.com/hwayne/awesome-cold-showers",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38870727",
    "commentBody": "",
    "originSummary": [
      "Diese Zusammenfassung besteht aus kritischen Überprüfungen oder \"kalten Duschen\" von überhypten Themen, einschließlich formaler Verifikation, statischer vs. dynamischer Typisierung, Skalierbarkeit von Big-Data-Systemen, Web-Framework-Benchmarks, agilen Methoden, Bezeichner-Namenskonventionen, Microservices, VM-Warmup, Skalierung von SQLite und Go's Gleichzeitigkeitssystem.",
      "Jede Übersicht bietet eine kritische Bewertung des jeweiligen Themas und weist auf Einschränkungen, Vorbehalte und widersprüchliche Belege hin.",
      "Der Zweck dieser Übersichten ist es, den Einzelnen daran zu erinnern, auf dem Boden der Tatsachen zu bleiben und den übermäßigen Hype um diese Themen kritisch zu bewerten."
    ],
    "commentSummary": [
      "Die Skepsis gegenüber der Forschung im Bereich der Softwareentwicklung unterstreicht die Notwendigkeit einer angemessenen Forschung, anstatt sich nur auf persönliche Erfahrungen zu verlassen.",
      "Die Vorteile des Saunierens werden erörtert, wobei ihr Potenzial zur Entspannung, zum Stressabbau und zur Verbesserung der kardiovaskulären Gesundheit hervorgehoben wird.",
      "Der Einsatz der formalen Verifikation in der Softwareentwicklung wird untersucht, wobei betont wird, wie sie die Zuverlässigkeit und Sicherheit von Software verbessern kann.",
      "Die Vorteile der statischen Typisierung in der Programmierung werden erforscht, wobei hervorgehoben wird, wie sie dazu beitragen kann, Fehler bei der Kompilierung zu erkennen und die Codequalität zu verbessern.",
      "Die Klassifizierung von Robotern wird diskutiert, wobei der Schwerpunkt auf der Unterscheidung zwischen autonomen Robotern und automatisierten Systemen liegt.",
      "Die Kontroverse um die Verwendung von Ivermectin zur Behandlung von COVID-19 wird angesprochen, wobei Argumente für und gegen seine Wirksamkeit und Sicherheit angeführt werden.",
      "Die Programmiersprache Go wird für ihre Innovation im Bereich der Gleichzeitigkeit hervorgehoben, die eine effiziente und skalierbare gleichzeitige Programmierung ermöglicht.",
      "Die Vorteile des kalten Duschens werden erörtert, darunter erhöhte Wachsamkeit, verbesserte Stimmung und mögliche gesundheitliche Vorteile wie eine verbesserte Immunfunktion."
    ],
    "points": 204,
    "commentCount": 148,
    "retryCount": 0,
    "time": 1704394150
  },
  {
    "id": 38875422,
    "title": "Leistungssteigerung: Aufteilung von Strukturen über 16 Bytes auf AMD64",
    "originLink": "https://gist.github.com/FeepingCreature/5dff669aad380a123b15659e195fb96c",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38875422",
    "commentBody": "",
    "originSummary": [
      "Die Übergabe von Strukturen, die größer als 16 Byte sind, kann auf AMD64 die Codeausführung erheblich verlangsamen.",
      "Durch die Übergabe von Arrays als drei separate Zeigerparameter anstelle eines struct-Parameters wurde die Leistung der Neat-Sprache um den Faktor zwei verbessert.",
      "Diese Verbesserung ist auf die Tatsache zurückzuführen, dass Strukturen, die größer als 16 Byte sind, in der SystemV AMD64 ABI-Spezifikation per Zeiger übergeben werden, was zu einer zusätzlichen Stapelumordnung bei Funktionsaufrufen führt. Durch die Übergabe von Arrays als separate Zeigerparameter befinden sich die Werte bereits in SSE-Registern und müssen nicht vom Stack geladen werden, was zu einer schnelleren Ausführung führt."
    ],
    "commentSummary": [
      "Es werden verschiedene Programmierthemen erörtert, z. B. die Übergabe von Structs auf der AMD64-Plattform und die Übergabe von Objekten als Wert oder Referenz.",
      "Googles Ansatz zur Datenübergabe wird ebenfalls besprochen, ebenso wie die Leistungsunterschiede zwischen dem Schreiben von Stacks und der Zuweisung von Heaps.",
      "Das Gespräch hebt die Kompromisse zwischen Leistung, Klarheit und Effizienz bei der Codierung hervor und betont die Bedeutung von Code-Optimierung und Profiling."
    ],
    "points": 193,
    "commentCount": 50,
    "retryCount": 0,
    "time": 1704425773
  },
  {
    "id": 38871952,
    "title": "Ungleichheit visualisieren: UK und US Mindestlohn vs. CEO Gehälter",
    "originLink": "https://moonbase.lgbt/blog/minimum-wage-clock/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38871952",
    "commentBody": "",
    "originSummary": [
      "Der Autor stellt einen visuellen Vergleich zwischen dem britischen Mindestlohn, dem US-Mindestlohn und den Gehältern von Unternehmensleitern an und verdeutlicht die Lohnunterschiede.",
      "Die angegebenen Lohnzahlen entsprechen dem Stand zum Zeitpunkt der Veröffentlichung und verdeutlichen die erheblichen Unterschiede zwischen Mindestlohn und Geschäftsführergehältern.",
      "Es wird darauf hingewiesen, dass sich der nationale Mindestlohn im Vereinigten Königreich im April 2024 ändern wird. Die Schätzungen des CEO-Gehalts beruhen auf Jahresgehältern und gehen von 260 Wochentagen und 8 Arbeitsstunden pro Tag aus."
    ],
    "commentSummary": [
      "Die Diskussion deckt eine Reihe von Themen ab, darunter Vermögensungleichheit, Geschäftsführergehälter, Armut, Verbraucherverantwortung, Steuern, Mindestlohngesetze und staatliche Eingriffe.",
      "Die Kommentatoren debattieren über den Einfluss des Reichtums auf das Regierungssystem, die Ethik der Praktiken von Milliardären und den Einfluss reicher Einzelpersonen auf das Gemeinwesen.",
      "Das Gespräch befasst sich auch mit den Vor- und Nachteilen von Großunternehmen im Vergleich zu lokalen Unternehmen, wobei der Schwerpunkt auf Verantwortlichkeit und gesellschaftlichem Engagement liegt."
    ],
    "points": 186,
    "commentCount": 234,
    "retryCount": 0,
    "time": 1704400843
  },
  {
    "id": 38869138,
    "title": "Hüten Sie sich vor \"Geisterjobs\": Bewerben Sie sich auf Stellenanzeigen, die möglicherweise gar nicht existieren",
    "originLink": "https://www.marketplace.org/2024/01/03/those-jobs-youre-applying-to-they-might-not-be-real/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38869138",
    "commentBody": "",
    "originSummary": [
      "Manche Unternehmen schreiben Stellen aus, die sie gar nicht besetzen wollen, so genannte \"Geisterjobs\", um den Eindruck von Wachstum zu erwecken oder um einen großen Bewerberpool zu sammeln.",
      "Diese Praxis ist in der Technologiebranche weit verbreitet und könnte auf wirtschaftliche Unsicherheit zurückzuführen sein.",
      "Stellensuchende sollten sich auf Stellenausschreibungen bewerben, unabhängig davon, wie lange sie bereits ausgeschrieben sind, und sich bei Vorstellungsgesprächen nach dem Einstellungszeitplan des Unternehmens erkundigen, um längere Prozesse bei der Stellensuche zu vermeiden."
    ],
    "commentSummary": [
      "Der Artikel und die Diskussion befassen sich mit dem Thema Jobbetrug, gefälschten Stellenangeboten und den Herausforderungen, mit denen Menschen bei der Stellensuche konfrontiert sind.",
      "Die Teilnehmer berichten von ihren persönlichen Erfahrungen mit betrügerischen Aktivitäten und erörtern die möglichen Motive hinter diesen Betrügereien.",
      "Das Gespräch unterstreicht auch, wie wichtig es ist, bei der Weitergabe persönlicher Daten oder bei Finanztransaktionen zu beruflichen Zwecken vorsichtig zu sein, und es werden Bedenken hinsichtlich der Diskriminierung bei Bewerbungen und der Frustration über den Einstellungsprozess geäußert."
    ],
    "points": 181,
    "commentCount": 170,
    "retryCount": 0,
    "time": 1704386567
  }
]
