[
  {
    "id": 38871987,
    "title": "לחיצות: מקלדת ה-iPhone האולטימטיבית להקלדה משופרת ופרודוקטיביות משופרת",
    "originLink": "https://www.clicks.tech/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38871987",
    "commentBody": "",
    "originSummary": [
      "Clicks היא מקלדת יוצרת המיועדת לאייפון, ומציעה למשתמשים שטח מסך גדול יותר, חוויית הקלדה משופרת וגישה לקיצורי דרך.",
      "הוא מאפשר למשתמשים למקסם את שטח המסך של האייפון שלהם ליצירת תוכן ומציע אינטגרציה חלקה עם iOS.",
      "קליקים זמינים כעת לדגמי אייפון 14 פרו, אייפון 15 פרו ופרו מקס במהדורה מוגבלת, עם מחירים החל מ-139 דולר."
    ],
    "commentSummary": [
      "משתמשים דנים ברצונם במקלדות פיזיות בסמארטפונים ובאתגרים העומדים בפניהם במציאת מכשירים העונים על העדפה זו.",
      "נוסטלגיה למכשירים ישנים עם מקלדות פיזיות באה לידי ביטוי, לצד רצון לגיוון וריגוש רב יותר בעיצובים של סמארטפונים.",
      "המשתמשים בוחנים אפשרויות שונות של חיבור מקלדת ודנים בפוטנציאל של עיצובים חדשניים המשלבים מסכי מגע ומקלדות פיזיות."
    ],
    "points": 715,
    "commentCount": 416,
    "retryCount": 0,
    "time": 1704401000
  },
  {
    "id": 38869235,
    "title": "שתפו את אתר Sit Down לרגיעה ונוחות",
    "originLink": "https://sonnet.io/posts/sit/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38869235",
    "commentBody": "",
    "originSummary": [
      "המחבר שולח ברכות לשנה החדשה ומעודד את הקוראים לשתף אתר המספק רגיעה או הנאה עם חברים.",
      "מטרת האתר מוסברת באמצעות שני קישורים שסופקו."
    ],
    "commentSummary": [
      "הטקסט מכיל סדרה של הערות לא קשורות בנושאים שונים, כולל שימוש באפליקציית מדיטציה בשם Sit והסיכונים הפוטנציאליים של מדיטציה.",
      "יש גם דיונים על כניסה למצב מסך מלא בדפדפנים, טכניקות עיצוב אתר ואפליקציית תרגילי נשימה.",
      "בנוסף, מוזכר היעדר מגע אישי באינטראקציות מקוונות ומעקב אחר זמן מדיטציה."
    ],
    "points": 532,
    "commentCount": 97,
    "retryCount": 0,
    "time": 1704386970
  },
  {
    "id": 38872362,
    "title": "Go: מקביליות ופשטות מצליחות, טיפול בטעויות",
    "originLink": "https://commandcenter.blogspot.com/2024/01/what-we-got-right-what-we-got-wrong.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38872362",
    "commentBody": "",
    "originSummary": [
      "שפת התכנות Go הצליחה לקדם מקביליות, פשטות בתוכנות שרת ושימוש בממשקים.",
      "נעשו טעויות בכך שלא סיפקו הנחיות ברורות לגבי מקביליות ולא התייחסו לבעיות גרף תלות בניהול חבילות.",
      "למרות הבעיות, ל-Go יש קהילה תומכת והיא ממשיכה להצליח בזכות הספרייה הסטנדרטית החזקה שלה וההתמקדות בעקביות קוד ותאימות."
    ],
    "commentSummary": [
      "התקציר מספק סקירה כללית של המאמר ושרשור התגובות, תוך התמקדות בפיתוח והצלחה של שפת התכנות Go בתוכנות צד שרת ורשת בהשוואה לפייתון וג'אווה.",
      "הוא דן במגבלות ובביקורת של Go, כולל הטיפול שלה בקוד C/C++ ברמה נמוכה, היעדר תכונות מסוימות ואתגרים בתכנות מערכות.",
      "הסיכום מדגיש נקודות מבט שונות על התאמתה של גו למטרות תכנות שונות, פשטותה, ניהול חבילות, טיפול בשגיאות וההחלטה לעכב את הוספת התרופות הגנריות. הדעות על נקודות החוזק והחולשה של גו משתנות בין המשתתפים."
    ],
    "points": 527,
    "commentCount": 471,
    "retryCount": 0,
    "time": 1704402968
  },
  {
    "id": 38868115,
    "title": "Iggy.rs: מהפכה בהזרמת הודעות עם Rust",
    "originLink": "https://blog.iggy.rs/posts/building-message-streaming-in-rust/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38868115",
    "commentBody": "",
    "originSummary": [
      "Iggy.rs היא פלטפורמת הזרמת הודעות שפותחה ברוסט במטרה להיות קלת משקל, מהירה וידידותית למשתמש, תוך השגת תפוקה גבוהה והשהיה נמוכה.",
      "הפלטפורמה כבר הטמיעה שרת סטרימינג מתמשך ויש לה צוות ייעודי של תורמים שעובדים על תחומים שונים של הפרויקט.",
      "התכונות של Iggy.rs כוללות תמיכה בזרמים מרובים, פרוטוקולי תעבורה ואימות, עם תוכניות להוסיף פונקציונליות קיבוץ באשכולות ולתעדף משוב משתמשים כדי לבצע שיפורים מתמשכים."
    ],
    "commentSummary": [
      "Iggy.rs הוא פרויקט הזרמת הודעות שפותח ברוסט, שנועד ליצור פלטפורמת מסרים שיתופית.",
      "המאמר דן בפתרונות שונים להזרמת הודעות, היבטים טכניים, השימוש בזמני ריצה של Rust והביצועים של TCP לעומת QUIC.",
      "המחבר מביע עניין בהתמקדות עתידית בפיתוח לינוקס ובוחן את היתרונות של Rust עבור מפתחים וסוגים שונים של תכנות."
    ],
    "points": 289,
    "commentCount": 55,
    "retryCount": 0,
    "time": 1704382174
  },
  {
    "id": 38868265,
    "title": "AMD מעדכנת מעבדים גרפיים בני 22 שנה עם סקירת קוד Shader של Vertex",
    "originLink": "https://gitlab.freedesktop.org/mesa/mesa/-/merge_requests/26816",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38868265",
    "commentBody": "",
    "originSummary": [
      "סקירת קוד זו מתמקדת בהעברת הורדת קצה עורפי ל- NIR עבור תוכניות Shader של קודקודים, המהווה תנאי מוקדם לניקוי עורפי נוסף.",
      "תהליך ההנמכה מורכב יותר בשל סדר המעבר והצורך במעברים אלגבריים מותאמים אישית.",
      "סדרת השינויים בסקירה מאפשרת ניקוי עתידי והראתה שיפורים ב- Shader-db עבור R500, עם תוצאות אחידות בעיקר עבור R300."
    ],
    "commentSummary": [
      "הדיונים מכסים את הדיון סביב מנהלי התקנים של חומרה במיקור פתוח, כולל יתרונות, חששות והתפקיד של קהילות קוד פתוח בשיפור מנהלי התקנים.",
      "יש דגש על מנהלי ההתקן של AMD GPU והתמיכה שלהם במעבדים גרפיים ישנים, מה שמדגיש את החשיבות של תאימות ותמיכה בחומרה מדור קודם.",
      "הדיונים נוגעים גם במגבלות של ספריות תוכנה ומנהלי התקנים עבור חומרה ישנה יותר ביישומי למידת מכונה, כמו גם בביצועים, במחיר סביר ובתוחלת החיים של מעבדים גרפיים ומערכות הפעלה שונות."
    ],
    "points": 272,
    "commentCount": 94,
    "retryCount": 0,
    "time": 1704382782
  },
  {
    "id": 38871295,
    "title": "Nestflix: חקור 700+ סרטים ותוכניות מקוננים עם עולמות בדיוניים בתוך עולמות",
    "originLink": "https://nestflix.fun/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38871295",
    "commentBody": "",
    "originSummary": [
      "Nestflix היא פלטפורמה ייחודית המספקת אוסף של למעלה מ-700 סרטים ותוכניות מקוננים, הכוללים סרטים בדיוניים בתוך סרטים ותוכניות מזויפות בתוך תוכניות.",
      "הפלטפורמה מציעה מגוון רחב של ז'אנרים, כולל דרמות, קומדיות, סרטי פעולה, סרטי מדע בדיוני, דרמות מלחמה ודרמות היסטוריות, מותחנים, תוכניות פשע, דרמות רומנטיות, סרטי אימה, תוכניות ריאליטי, שעשועונים, תוכניות שונות, תוכניות רשת, קומדיות מצבים, מחזות זמר ותוכניות אירוח.",
      "נסטפליקס מציגה נרטיבים שונים, החל מסיפורי פשע עירוניים ועד סיפור הרקע של עוזרו של גיבור על."
    ],
    "commentSummary": [
      "Nestflix הוא מסד נתונים במיקור המונים של תוכניות בדיוניות מתוכניות טלוויזיה וסרטים, כאשר משתמשים מעריכים את האוסף ומציעים פיתוחים עתידיים באמצעות AI ליצירת פרקים באורך מלא.",
      "האתר מעורר דיונים על ההשפעה של אוטומציה של בינה מלאכותית בתעשיות שונות, רוויית יתר בתעשיית הקולנוע, והחשיבות של כתיבה טובה.",
      "סרטים כתובים היטב נחשבים בעלי ערך רב יותר ככל שאפקטים מיוחדים הופכים נפוצים, אם כי שיווק עדיין משחק תפקיד משמעותי."
    ],
    "points": 268,
    "commentCount": 78,
    "retryCount": 0,
    "time": 1704397311
  },
  {
    "id": 38866256,
    "title": "Global Fishing Watch חושף ספינות דיג תעשייתיות נסתרות ותשתיות ימיות באמצעות בינה מלאכותית ותצלומי לוויין",
    "originLink": "https://globalfishingwatch.org/press-release/new-research-harnesses-ai-and-satellite-imagery-to-reveal-the-expanding-footprint-of-human-activity-at-sea/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38866256",
    "commentBody": "",
    "originSummary": [
      "Global Fishing Watch ערך מחקר באמצעות בינה מלאכותית ותצלומי לוויין כדי ליצור את המפה הגלובלית הראשונה של תנועת כלי שיט גדולים ותשתיות ימיות, וחשף פעילות תעשייתית שלא הייתה ידועה עד כה באוקיינוס.",
      "המחקר גילה כי 75% מספינות הדיג התעשייתיות בעולם אינן גלויות לציבור.",
      "זוהו \"ציים אפלים\" הפועלים באזורים ימיים מוגנים, ויש ריכוז גבוה של כלי שיט במימי אסיה בהשוואה לאירופה.",
      "המחקר מצביע על ירידה בפעילות הדיג במהלך מגפת הקורונה, בעוד פיתוח האנרגיה בים, בעיקר טורבינות רוח, גדל.",
      "לטכנולוגיה זו יש פוטנציאל לתרום להתמודדות עם שינויי האקלים ולשפר את הניהול הימי ואת מאמצי השקיפות."
    ],
    "commentSummary": [
      "מתקיימים דיונים בנושא מעקב וניטור פעילות אנושית בים, בעיקר דיג בלתי חוקי והקשיים באכיפת תקנות.",
      "AI, תצלומי לוויין, AIS ו- ADS-B משמשים לגילוי וניתוח פעילות אנושית בים.",
      "חששות לפרטיות, אכיפה משתנה של תקנות, השפעה סביבתית של פליטות ספנות, ירידה באוכלוסיית הדגים ופעילויות דיג סיניות במים זרים הם נושאים מרכזיים הנדונים ביחס לפעילות ימית והצורך ברגולציה, ניטור ואכיפה להגנה על משאבים ימיים."
    ],
    "points": 262,
    "commentCount": 171,
    "retryCount": 0,
    "time": 1704371973
  },
  {
    "id": 38873810,
    "title": "Wi-Fi מאובטח ופשוט לעבודה ברשת ביתית: גילוי WPA3 Enterprise ו- EAP-TLS",
    "originLink": "https://smallstep.com/blog/home-network-eap-tls-wifi/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38873810",
    "commentBody": "",
    "originSummary": [
      "שימוש ב- Wi-Fi ברמה של NSA בבית אינו מומלץ עקב מורכבות ובעיות תאימות עם מכשירים.",
      "מצבי אבטחה חלופיים כגון WPA2-PSK או WPA3-Personal מוצעים עבור רשתות Wi-Fi ביתיות.",
      "לאימות רשת מאובטח ב- Wi-Fi ארגוני, מומלץ EAP-TLS. הוראות ניתנות להגדרת רשת Wi-Fi עם אימות WPA3 Enterprise, אבטחת רשתות לתאימות HIPAA וניהול ידני של מכשירי Apple עבור MDM. המאמר מסביר גם את תהליך יצירת האישורים עבור אורחי הבית."
    ],
    "commentSummary": [
      "האבטחה של רשתות Wi-Fi ואת האפקטיביות של שיטות אימות נדונים.",
      "הנושאים כוללים שימוש בשירותי VPN לגישה רגישה, המגבלות של הסתמכות אך ורק על אימות Wi-Fi, והצורך בשכבות הגנה מרובות.",
      "נושאים אחרים כוללים אבטחת מכשירי IoT, היתרונות של שערים וחומות אש, שימוש במספר מפתחות משותפים מראש והמגבלות של WPS.",
      "כמו כן, נדון שימוש ב- EAP-TLS לאימות מאובטח, זיהוי מכשירים ויישום שרתי RADIUS.",
      "ידוע כי הסתמכות אך ורק על Wi-Fi לאבטחה אינה מספיקה, ויש לנקוט באמצעים נוספים."
    ],
    "points": 256,
    "commentCount": 146,
    "retryCount": 0,
    "time": 1704411842
  },
  {
    "id": 38868185,
    "title": "Rosebud AI: הפוך תיאורי משחקים למשחקי דפדפן באמצעות קוד שנוצר באמצעות בינה מלאכותית",
    "originLink": "https://news.ycombinator.com/item?id=38868185",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38868185",
    "commentBody": "",
    "originSummary": [
      "Rosebud AI היא פלטפורמה המאפשרת ליוצרים לא טכניים לפתח משחקים על ידי יצירת הקוד עבורם על סמך תיאורי המשחק שלהם.",
      "הוא תומך במסגרות JavaScript מבוססות דפדפן ומדגיש דמויות AI שאינן שחקנים (NPC) המשתמשות ב- LLMs (מודלי שפה גדולים) לדיאלוג ופעולות.",
      "הגישה הייחודית של הפלטפורמה ליצירת משחקים והשימוש שלה בבינה מלאכותית גנרטיבית מבדילה אותה ממנועי משחק אחרים, והיא פועלת במודל עסקי דומה לזה של רובלוקס, המאפשר למפתחים לגבות תשלום מהמשתמשים ולקחת נתח מההכנסות. הוא זכה למשוב חיובי מבודקי בטא."
    ],
    "commentSummary": [
      "Rosebud AI היא פלטפורמה המאפשרת ליוצרים לא טכניים להפוך תיאורי משחקים למשחקי דפדפן, במיוחד RPG ומסלולי מכשולים.",
      "הפלטפורמה משתמשת במודלי שפה גדולים (LLM) לדיאלוג ופעולות, שקיבלו משוב חיובי על שימושיות וסיוע AI.",
      "משתמשים העלו חששות לגבי קוד חלקי או שגוי שנוצר ומגבלות של הגישה מבוססת הצ'אט, מה שגרם לצוות לעבוד על שיפור הפלטפורמה ותהליכים עורפיים.",
      "הצוות בוחן גם אפשרויות למשחקי AI בייצור עצמי, ומעורר דיונים על הרוויה הפוטנציאלית של השוק עם יוצרים נוספים, תפקידה של AI בפיתוח משחקים, והחשיבות של דיאלוג וחלופות במשחקיות.",
      "חלק מהמשתמשים יצרו בהצלחה משחקי הגנת מגדל באמצעות הפלטפורמה, עם משוב חיובי.",
      "ישנם חששות לגבי הצעת הערך של הפלטפורמה וההצלחה הפוטנציאלית, עם הצעות להתמקד בנכסי אמנות AI גנרטיביים ולהסתגל להתקדמות עתידית ביצירת קוד."
    ],
    "points": 251,
    "commentCount": 91,
    "retryCount": 0,
    "time": 1704382430
  },
  {
    "id": 38870727,
    "title": "ביקורות ביקורתיות על נושאים טכנולוגיים מוגזמים",
    "originLink": "https://github.com/hwayne/awesome-cold-showers",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38870727",
    "commentBody": "",
    "originSummary": [
      "סיכום זה מורכב מסקירות קריטיות או \"מקלחות קרות\" של נושאים מוגזמים, כולל אימות רשמי, הקלדה סטטית לעומת דינמית, מדרגיות של מערכות ביג דאטה, אמות מידה של מסגרת אינטרנט, שיטות זריזות, מוסכמות למתן שמות מזהים, מיקרו-שירותים, חימום VM, קנה מידה של SQLite והמערכת המקבילית של Go.",
      "כל סקירה מציעה הערכה ביקורתית של הנושא המתאים, תוך הצבעה על מגבלות, אזהרות וראיות סותרות.",
      "מטרת הסקירות הללו היא להזכיר לאנשים להישאר מקורקעים ולהעריך באופן ביקורתי את ההייפ המופרז סביב נושאים אלה."
    ],
    "commentSummary": [
      "קיימת ספקנות כלפי מחקר בפיתוח תוכנה, המדגישה את הצורך במחקר נכון ולא להסתמך רק על ניסיון אישי.",
      "היתרונות של סאונות נדונים, המדגישים את הפוטנציאל שלהם להרפיה, הפחתת מתח, ובריאות הלב וכלי הדם משופרת.",
      "נבחן השימוש באימות פורמלי בפיתוח תוכנה, תוך שימת דגש על האופן שבו הוא יכול לשפר את אמינות התוכנה וביטחונה.",
      "היתרונות של הקלדה סטטית בתכנות נחקרים, ומדגישים כיצד זה יכול לעזור לתפוס שגיאות בזמן הידור ולשפר את איכות הקוד.",
      "סיווג הרובוטים נדון, תוך התמקדות בהבחנה בין רובוטים אוטונומיים למערכות אוטומטיות.",
      "המחלוקת סביב השימוש באיברמקטין כטיפול לקורונה מטופלת, עם טיעונים בעד ונגד יעילותו ובטיחותו.",
      "שפת התכנות Go מודגשת בזכות החדשנות שלה במקביל, המאפשרת תכנות בו-זמני יעיל ומדרגי.",
      "מדברים על היתרונות של מקלחות קרות, כולל ערנות מוגברת, מצב רוח משופר ויתרונות בריאותיים פוטנציאליים כמו תפקוד חיסוני משופר."
    ],
    "points": 204,
    "commentCount": 148,
    "retryCount": 0,
    "time": 1704394150
  },
  {
    "id": 38875422,
    "title": "שיפור ביצועים: פיצול מבנים מעל 16 בתים ב- AMD64",
    "originLink": "https://gist.github.com/FeepingCreature/5dff669aad380a123b15659e195fb96c",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38875422",
    "commentBody": "",
    "originSummary": [
      "העברת מבנים גדולים מ- 16 בתים ב- AMD64 יכולה להאט באופן משמעותי את ביצוע הקוד.",
      "שינוי מערכים כך שיועברו כשלושה פרמטרים נפרדים של מצביע במקום פרמטר מבנה אחד שיפר את הביצועים של השפה המסודרת פי שניים.",
      "שיפור זה נובע מהעובדה שמבנים גדולים מ- 16 בתים מועברים על ידי מצביע במפרט SystemV AMD64 ABI, וכתוצאה מכך סידור מחדש של מחסנית נוספת עבור קריאות פונקציה. על-ידי העברת מערכים כפרמטרי מצביע נפרדים, הערכים כבר נמצאים באוגרי SSE ואין צורך לטעון אותם מהערימה, וכתוצאה מכך ביצוע מהיר יותר."
    ],
    "commentSummary": [
      "הדיון בוחן מספר נושאי תכנות, כגון העברת מבנים על פלטפורמת AMD64 והעברת אובייקטים לפי ערך או הפניה.",
      "הגישה של גוגל להעברת נתונים נדונה גם היא, יחד עם הבדלי הביצועים בין כתיבת מחסנית להקצאת ערימות.",
      "השיחה מדגישה את הפשרות בין ביצועים, בהירות ויעילות בפרקטיקות קידוד, ומדגישה את החשיבות של אופטימיזציה של קוד ויצירת פרופילים."
    ],
    "points": 193,
    "commentCount": 50,
    "retryCount": 0,
    "time": 1704425773
  },
  {
    "id": 38871952,
    "title": "המחשת הפערים: שכר מינימום בבריטניה ובארה\"ב לעומת שכר מנכ\"לים",
    "originLink": "https://moonbase.lgbt/blog/minimum-wage-clock/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38871952",
    "commentBody": "",
    "originSummary": [
      "המחבר מציג השוואה ויזואלית בין שכר מינימום לאומי בבריטניה, שכר מינימום פדרלי בארה\"ב ושכר מנכ\"לים, תוך שימת דגש על פערי השכר.",
      "נתוני השכר שנמסרו מדויקים למועד פרסומם ומדגישים את ההבדלים המשמעותיים בין שכר המינימום לשכר המנכ\"לים.",
      "יצוין כי שכר מינימום לאומי בבריטניה ישתנה באפריל 2024. אומדני שכר המנכ\"ל מבוססים על שכר שנתי ומניחים 260 ימי חול ו-8 שעות עבודה ביום."
    ],
    "commentSummary": [
      "הדיון עוסק במגוון נושאים, בהם אי שוויון בעושר, שכר מנכ\"לים, עוני, אחריות צרכנית, מיסוי, חוקי שכר מינימום והתערבות ממשלתית.",
      "המגיבים מתווכחים על השפעת העושר על מערכות ממשלתיות, על האתיקה של פרקטיקות של מיליארדרים ועל ההשפעה של אנשים עשירים על קהילות.",
      "השיחה בוחנת גם את היתרונות והחסרונות של תאגידים גדולים בהשוואה לעסקים מקומיים, תוך התמקדות באחריות ומעורבות קהילתית."
    ],
    "points": 186,
    "commentCount": 234,
    "retryCount": 0,
    "time": 1704400843
  },
  {
    "id": 38869138,
    "title": "היזהרו מ\"משרות רפאים\": הגשת מועמדות למודעות דרושים שאולי אינן קיימות בפועל",
    "originLink": "https://www.marketplace.org/2024/01/03/those-jobs-youre-applying-to-they-might-not-be-real/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38869138",
    "commentBody": "",
    "originSummary": [
      "חלק מהחברות מפרסמות משרות פתוחות שאין להן כוונה למלא, מה שמכונה \"משרות רפאים\", כדי ליצור אשליה של צמיחה או לאסוף מאגר גדול של מועמדים.",
      "פרקטיקה זו רווחת בתעשיית הטכנולוגיה ועשויה לנבוע מאי ודאות כלכלית.",
      "מחפשי עבודה צריכים להגיש מועמדות לפרסומים ללא קשר לכמה זמן הם פתוחים ולשאול על ציר הזמן של החברה לגיוס במהלך ראיונות כדי לנווט בתהליכי חיפוש עבודה ארוכים יותר."
    ],
    "commentSummary": [
      "המאמר והדיון מתעמקים בנושא הונאות עבודה, רישומי משרות מזויפים והאתגרים העומדים בפני אנשים בתהליך חיפוש העבודה.",
      "המשתתפים חולקים את חוויותיהם האישיות עם פעילויות הונאה ודנים במניעים האפשריים מאחורי הונאות אלה.",
      "השיחה גם מדגישה את החשיבות של זהירות בעת שיתוף מידע אישי או ביצוע עסקאות פיננסיות למטרות עבודה, ומעלה חששות לגבי אפליה בבקשות עבודה ותסכולים מתהליך הגיוס."
    ],
    "points": 181,
    "commentCount": 170,
    "retryCount": 0,
    "time": 1704386567
  }
]
