[
  {
    "id": 35555525,
    "timestamp": 1681394185,
    "title": "Arrest made in SF killing of Bob Lee – alleged killer also worked in tech",
    "url": "https://missionlocal.org/2023/04/bob-lee-killing-arrest-made-san-francisco/",
    "hn_url": "http://news.ycombinator.com/item?id=35555525",
    "content": "Mission Local is informed that the San Francisco Police Department early this morning made an arrest in the April 4 killing of tech executive Bob Lee, following an operation undertaken outside the city’s borders. The alleged killer also works in tech and is a man Lee purportedly knew.We are told that police today were dispatched to Emeryville with a warrant to arrest a man named Nima Momeni. The name and Emeryville address SFPD officers traveled to correspond with this man, the owner of a company called Expand IT.Multiple police sources have described the predawn knifing last week, which left the 43-year-old Lee dead in a deserted section of downtown San Francisco, as neither a robbery attempt nor a random attack. Rather, Lee and Momeni were portrayed by police as being familiar with one another. In the wee hours of April 4, they were purportedly driving together through downtown San Francisco in a car registered to the suspect. Some manner of confrontation allegedly commenced while both men were in the vehicle, and potentially continued after Lee exited the car. Police allege that Momeni stabbed Lee multiple times with a knife that was recovered not far from the spot on the 300 block of Main Street to which officers initially responded. This scenario would explain, in part, why Lee was walking through a portion of Main Street in which there is little to no foot traffic at 2:30 a.m. That was one of several incongruous circumstances surrounding Lee’s violent death, which law-enforcement sources, from the get-go felt made it far from a straightforward or random crime. Nevertheless, some of Lee’s fellow tech luminaries and a chorus of other influential voices portrayed this killing as part and parcel of a city awash in violent crime and on a descent into further chaos. While Lee is one of a dozen homicide victims in San Francisco this year, his is the only killing that has garnered national coverage — or, in most cases, even cursory local coverage. San Francisco’s other homicide victims in 2023 are Gavin Boston, 40; Irving Sanchez-Morales, 28; Carlos Romero Flores, 29; Maxwell Maltzman, 18; Demario Lockett, 44; Maxwell Mason, 29; Humberto Avila, 46; Gregory McFarland Jr, 36; Kareem Sims, 43; Debra Lynn Hord, 57; and Jermaine Reeves, 52.The dozen homicides recorded in San Francisco as of April 13, 2023. Map by Will Jarrett. Basemap from Mapbox.San Francisco is home to much in the way of visible public misery, unnerving street behavior and overt drug use. Its property crime rate has long been high, and the police clearance rate for property crimes has long been minimal. But the city’s violent crime rate is at a near-historic low, and is lower than most mid-to-large-sized cities.Today’s arrest would appear to undermine the premise that Lee’s violent death was due to street conditions in San Francisco. If the police do have their man, this was not a robbery gone bad nor a motiveless assault by some random attacker, but an alleged grievance between men who knew one another, which the suspect purportedly escalated into a lethal conflict.Homicides per 100,000 residents1816Over the past few years,homicides did rise in SanFrancisco – but they remainlow compared tohistoric trends1412108642019851990199520002005201020152020YearChart by Will Jarrett. Data from the California Department of Justice and the Census Bureau.Lee’s death, however, was packaged in the media and on social media into a highlight reel of recent San Francisco misfortunes and crimes: large groups of young people brawling at Stonestown; the abrupt closure of the mid-market Whole Foods, leaving San Franciscans just eight other Whole Foods within city limits; the severe beating of former fire commissioner Don Carmignani in the Marina District, allegedly by belligerent homeless people — it all adds up to a feeling of a city coming undone.This manner of coverage, however, does not capture the actual lived experience of the vast majority of San Franciscans. It also omits potentially mitigating details of the individual events. Carmignani, for instance, was brutally struck in the head with a metal rod and hospitalized. But the lawyer for his alleged attacker claims that the former fire commissioner first pepper-sprayed the homeless man accused of beating him — which certainly would color this incident.Of note, police sources say that a series of homeless people had previously been pepper-sprayed in the Marina District prior to this instance.The arrest in the Lee case is a breaking story. We will update or follow this article as soon as possible.Update:San Francisco records show Nima Momeni was booked into jail at 9:19 a.m.SEE ALSOBob Lee deserved better than to be killed — and then co-opted in deathby JOE ESKENAZIAPRIL 7, 2023Bob Lee: SF officials slam Elon Musk, others, for spreading rampant crime narrativeby ELENI BALAKRISHNANAPRIL 13, 2023Explore: How crime changed in 2022by WILL JARRETTJANUARY 19, 2023Follow UsTAGGED: SFPDJOE ESKENAZIgetbackjoejoe@gmail.comtwitterManaging Editor/Columnist. Joe was born in San Francisco, raised in the Bay Area, and attended U.C. Berkeley. He never left.“Your humble narrator” was a writer and columnist for SF Weekly from 2007 to 2015, and a senior editor at San Francisco Magazine from 2015 to 2017. You may also have read his work in the Guardian (U.S. and U.K.); San Francisco Public Press; San Francisco Chronicle; San Francisco Examiner; Dallas Morning News; and elsewhere.He resides in the Excelsior with his wife and three (!) kids, 4.3 miles from his birthplace and 5,474 from hers.The Northern California branch of the Society of Professional Journalists named Eskenazi the 2019 Journalist of the Year.More by Joe Eskenazi",
    "summary": "An arrest has been made in the killing of tech executive Bob Lee, and the alleged killer also worked in tech and was known to Lee. The police reportedly found Lee and the suspect driving together in a car registered to the suspect, and allege that some kind of confrontation took place while in the vehicle and potentially continued after Lee left. The coverage of Lee's death has been packaged with other recent San Francisco misfortunes and crimes, though this does not accurately represent the actual lived experience of most San Franciscans.",
    "hn_title": "Arrest made in SF killing of Bob Lee – alleged killer also worked in tech",
    "original_title": "Arrest made in SF killing of Bob Lee – alleged killer also worked in tech",
    "score": 867,
    "hn_content": "An arrest has been made in the San Francisco murder of Bob Lee, who was apparently killed by an \"entrepreneur\" who also worked in tech. Several comments on Hacker News bring up issues of homelessness, mental health, and drug addiction as potential factors in violent crime. Others suggest that the emotional reaction to this tragedy reveals how easily people can be drawn into a powerful narrative, even without supporting facts. Overall, the post generates discussion about the complex intersections between wealth, mental health, and violence in the tech industry and San Francisco more broadly.A tech entrepreneur's recent murder in San Francisco has prompted discussion on factors that may have led to the crime, including homelessness, drug addiction, and mental illness. However, commenters are cautioned against making generalizations about these issues; homeless individuals are, statistically speaking, no more likely to be violent than others, and mental illness and drug addiction should not be demonized. Rather than relying on personal biases, discussions should focus on factors like poverty and the impact of money. Some readers also find value in discussion, no matter how unpleasant.An HN post discusses crime rates in San Francisco, where the debate focuses on the usage of statistics versus direct anecdotes. While city-wide statistics may be misleading because violent crimes are often concentrated in specific parts frequented by a certain crowd, individual anecdotes are also problematic as they are colored by emotion and can cloud reality. The emotional appeal of personal anecdotes is often relied on to dismiss statistical conclusions, which is not helpful when trying to assess big problems such as crime rates. While official statistics may be less than useful because most victims of minor crimes do not file police reports, they still offer valuable information to observe trends.A Tech Times article provides an insider's perspective on the panhandling issue in San Francisco. Homelessness, drug addiction, and petty property crime are major problems that have persisted for decades. The promise of an overnight transformation leads to solutions that do not work, such as homelessness sweeps and policing non-violent property crime. The long-term solution is a community-involved approach to access resources for those living on the street, healing from addiction, and preventing petty property crimes for survival. Encampments built around navigation centers offer potential solutions, but involuntary mental health treatment centers and job training opportunities may also be necessary. The visible signs of homelessness, drug use, and urinating on the sidewalks affect the city's overall quality of life but do not necessarily lead to danger or increase in crime rates.Comments on a recent post highlight the complexity of the issues facing San Francisco. One user notes that actual Bay Area degeneration should be the determining factor in discussions surrounding the city's state. Another identifies a morality-driven approach to defining what makes a city great. Several users note that San Francisco's violent crime rate is among the lowest in major US cities, but quality of life crime remains high. The city's housing crisis is identified as the root cause of homelessness, property crime, and the outflux of residents. The disconnection between commonly perceived safety issues and quantitative crime data is also noted.Comments on a post discuss crime in San Francisco and other major cities, with some users sharing personal experiences of crime. Some compare crime rates between cities and question the relevance of discussing crime in relation to an individual murder case. One comment points out that data may not reflect non-reported crimes, particularly those related to homelessness and drug use. Users also discuss the importance of relying on actual data rather than sensationalist media or personal anecdotes. An HN user recommends evaluating crime levels in relation to poverty rather than comparing different cultures.A murder of a crypto executive in San Francisco has prompted discussions about the city's crime problem being overblown, with data pointing to worse murder rates in other states. The majority of those who claim that the crime problem is overblown, however, live in nicer, low-crime areas of San Francisco. Many express fear of crime and have difficulty accepting data-informed analysis, often behaving as if they're worried it might be contagious. There is rampant speculation around the cause of the crime and what the victim may have been involved in, with little input from the actual investigation.An HN user discusses the recent attack on the fire commissioner, refuting claims that it was not a random attack. Another HN user argues that people should stop paying attention to tech industry people's opinions. The recent SF murder reflects both narratives of the city's decline, with concern about not sensationalizing the situation. The lesson is not to jump to global conclusions based on one single case, but the emotional narrative about San Francisco's decline is correct. High homicide rates in certain areas often mean that victims are in connected social graphs. Police can address homicide rates by intervening in these areas.Comments on a tragedy in San Francisco caution against blaming the homeless and point out that violent crimes are usually committed by individuals known to the victim. One commenter cites a study linking the removal of lead from gasoline to lower crime rates in the '70s. Others note that there are legitimate viewpoints and approaches to the city's struggles with homelessness, drugs, and crimes. HN users discuss violent crime and statistics, with one saying not all violent crimes are committed by people known to their victims but most are. Another commenter criticizes the \"culture warriors\" who use such incidents to advance existing opinions. Applications for YC Summer 2023 are open.",
    "hn_summary": "The murder of a tech executive in San Francisco has sparked discussions about factors such as homelessness, mental health, drug addiction, and poverty that may have led to the crime, but commenters caution against making generalizations. There is also debate about the use of statistics versus personal anecdotes when assessing crime rates, and a need for a community-involved approach to address the complex issues of homelessness, addiction, and crime. Users highlight the importance of evaluating crime levels in relation to poverty rather than comparing different cultures and not jumping to conclusions based on one case."
  },
  {
    "id": 35553337,
    "timestamp": 1681381179,
    "title": "YouTube-DL Hosting Ban Paves the Way to Privatized Censorship",
    "url": "https://torrentfreak.com/youtube-dl-hosting-ban-paves-the-way-to-privatized-censorship-230411/",
    "hn_url": "http://news.ycombinator.com/item?id=35553337",
    "content": "HOME > PIRACY >Last week, a German court ruled that Uberspace is liable for hosting the website of youtube-dl, an open-source tool that allows people to download content from YouTube. The owner of the hosting company warns that this \"ridiculous\" and \"devastating\" verdict opens the door to privatized censorship.In 2020, the RIAA infuriated many players in the open source community by targeting YouTube-ripping tool youtube-dl.The RIAA sent a takedown notice to GitHub, alleging that the software bypassed technological protection measures, in violation of the DMCA.GitHub initially complied but later changed course. After consulting legal experts, including those at the EFF, it restored the youtube-dl repository. GitHub also launched a million-dollar defense fund to assist developers in similar disputes.Targeting Youtube-dl’s HostThis episode was a massive setback for the music industry, which had been fighting stream-ripping tools for years. However, instead of laying down their arms, the music companies went after Uberspace, youtube-dl’s website hosting company in Germany.A few days ago this lawsuit resulted in a clear victory for Sony Entertainment, Warner Music Group and Universal Music. The district court of Hamburg essentially ruled that youtube-dl violates the law as it bypasses YouTube’s technological protection measures.Going one step further, the court also concluded that as a host, Uberspace can be held liable for youtube-dl’s activity. The hosting provider received a takedown notice for the website in the past but continued to host it. According to Uberspace, the software wasn’t clearly illegal but the court ruled that the company should have known better.With the dust beginning to settle, TorrentFreak spoke with Uberspace owner Jonas Pasche, who has decided to appeal the ruling. According to Pasche, the court made a big mistake that could have far-reaching consequences.Uberspace Responds to Court VerdictFor starters, Pasche still doesn’t believe that it’s clear that youtube-dl violates copyright law. More importantly for his own business, however, is the court’s finding that a hosting company can be held liable for doubting the validity of a takedown request.German law requires hosting companies to remove the content as soon as they learn about ‘clear’ or ‘obvious’ illegal activity. That’s an easy decision in many cases, but Uberspace paused for thought in youtube-dl’s case, presumably for good reason.“Just because someone ‘claims’ that something hosted with us is illegal, it doesn’t necessarily need to be true. So when we received the notice from the Rasch law firm that we’re hosting youtube-dl which they claimed to be illegal, our first reaction was: Really? Is it..? Let’s do some research,” Pasche tells us.“And boy, did we do some research. Starting with a simple Google search for ‘youtube download legal’, there is a TON of sources – well-known, serious, public magazines – basically all stating: Yeah, it’s totally legal to download videos from YouTube.”Uberspace knows that answers that appear through Google should be carefully weighed. So Uberspace continued looking for answers. The company reviewed YouTube’s protection measures, for example, which didn’t appear to involve any type of encryption for free and publicly available videos.‘Clearly Not Clearly Illegal’Also, Uberspace couldn’t find any claims from YouTube itself that their content has effective copy protection. If anything, the company’s searches suggested that the opposite was true.For example, GitHub eventually concluded that youtube-dl wasn’t violating US copyright law, a decision that was based on input from the legal experts at EFF. In addition, Uberspace consulted a lawyer in Germany who reached a similar conclusion.“We also got ourselves informed about ‘fair use’ under German law. We even appointed a lawyer, at our own cost, who did his own research and also came to the conclusion that what youtube-dl does is perfectly legal and covered by fair use,” Uberspace’s owner tells us.Uberspace Keeps Youtube-dl OnlineBased on its own investigation into youtube-dl, Uberspace decided to keep the website online. The company informed Rasch, the music company’s law firm, of its decision, which responded with some follow-up questions.For example, the law firm wanted to know how many times the youtube-dl software had been downloaded. However, Uberspace couldn’t answer this question since it didn’t host or distribute the actual code, which was stored on GitHub.“I guess they didn’t like my answer, but that’s their problem, not mine. How about asking GitHub for download numbers? We suggested that to them! I’m sure they didn’t even ask over there.”The biggest disappointment and threat ultimately comes from the court’s conclusion that Uberspace is liable for youtube-dl’s alleged wrongdoing because it failed to take the website offline. Apparently, Uberspace should have known that youtube-dl was illegal, even though that wasn’t clear.“This is ridiculous. And it’s devastating,” Pasche says, fearing that the court order will have a chilling effect on the hosting business.“The consequences of this will be that hosting providers receiving complaints will most likely kick out their customers without a court ruling, for things that might be perfectly legal. Otherwise, they have to fear being held responsible by a court that might see things differently.”Hosting Companies as Internet Police?In a way, the court order requires hosting companies to police their network, which requires weighing advanced legal issues that even legal experts have different opinions on.Ultimately, many hosting companies will likely take the cautious option and terminate customer accounts to avoid liability.“This court decision basically takes away the option of staying neutral for a hosting provider,” Pasche says.“They will be unable to say ‘it might be unlawful, but it’s not really clear. Let a court decide about this, and until then continue to host it. After all, we have a hosting contract to fulfill!’ In the future, they will have to say ‘It might be unlawful, so better let’s get rid of it, without a court order’.”“It’s just too risky to insist on a court decision because we might face damages for ‘helping’ with illegal activity.”Pasche also finds it bizarre that the court ordered Uberspace to answer various questions it can’t answer. This includes the number of youtube-dl downloads, which is information that it simply doesn’t have.GitHub?There is a much more logical target in this case in the form of GitHub, which actually hosts the software. For some reason, the music companies have decided to go after Uberspace instead.“GitHub isn’t some shady bulletproof hoster located on some cozy island. It’s a Microsoft-owned corporation. They have processes to deal with complaints. They have a legal team. They could perfectly block youtube-dl, even just in Germany,” Pasche says.“What’s the point of suing the hosting provider of a website pointing to that GitHub repository, when they had perfectly established ways to file a complaint with the hosting provider of the actual software they want to see banned?”The music companies did approach GitHub earlier, of course, but went after Uberspace when their DMCA takedown was denied. According to Pasche, the music companies chose to pick an ‘easier’ target after this setback.“It really looks like they just didn’t want to face what they might regard as a ‘real’ opponent; Microsoft. Instead, they’re going for what they might have regarded as an ‘easy target’. This is exactly the behavior of bullies.”Legal Battle ContinuesUberspace doesn’t like being bullied, so it will continue to fight back through the appeal court. In fact, the company is determined to fight this battle to the bitter end, whatever it takes.Pasche believes that the recent court order effectively opens the door to increased censorship, and he hopes to shut that door again before it’s too late.“This is a shameful day for the freedom of speech. It’s paving the way for privatized censorship. Do we as a society really want this? We strongly believe we’re on the right side of history here. Everyone except the music industry knows this,” he concludes.",
    "summary": "A German court has ruled Uberspace liable for hosting the website of youtube-dl - an open-source tool that allows for downloading YouTube content. Uberspace warns the verdict could lead to privatized censorship and is appealing the decision, though the court held that Uberspace \"can be held liable for doubting the validity of a takedown request,\" even when it was not clear that the tool violated the law.",
    "hn_title": "YouTube-DL Hosting Ban Paves the Way to Privatized Censorship",
    "original_title": "YouTube-DL Hosting Ban Paves the Way to Privatized Censorship",
    "score": 488,
    "hn_content": "The banning of YouTube-DL hosting is seen as a move towards privatized censorship. The RIAA and MPAA prioritizing money and power over decency is not surprising. The Hamburg court's decision is seen as another example of siding with media industry for decades. The issue is not about piracy but rather, censorship. There is a power imbalance with the consumer having no ability to negotiate in unilateral policies. Consumers giving up their rights with these agreements is a form of entitlement.The concept of \"intellectual property\" and its restriction on the free flow of information is debated in the comments. Some argue that it is unreasonable to treat intangible objects as physical property, while others argue that creative industries rely on intellectual property to incentivize content creation. The discussion also touches on the distinction between copyright infringement and plagiarism. However, there is no clear consensus on whether or not intellectual property should be considered true property or if it should be limited in scope and duration.The article discusses the coordination problem of funding TV shows, and the potential for the internet to solve it; meanwhile, a user argues that proposed regulations would unfairly suppress innocent parties who must prove their innocence, and others argue for the legitimacy of YouTube-DL as a tool rather than piracy facilitator. Privatized censorship is also raised as a point, with Clarifire pointed out as a representative example of the phenomenon. The time-sensitive nature of funding coordination is stressed, and a discussion of freedom of association concludes the post.The article discusses private censorship and the importance of non-discrimination. HN users suggest that protecting specific groups of people is important, and the use of CDNs by websites is due to distributed DDoS attacks. Invidious provides an alternative to YouTube, and technological protection measures should not affect a media's legality, according to some users. Additionally, users discuss the death of youtube-dl and the emergence of yt-dlp.The \"Youtube-dl\" repository is not dead, but a major feature that's not working for two months has shaken users' faith in its future. The inability to adjust to Python 3 vs. Python 2.7 syntax and semantics causing the \"python\" vs. \"python3\" issue is still prevalent. Different Linux distros behave differently with respect to the \"python\" executable, some have an existing binary, some don't. Arch's decision to symlink python to python3 has messed up other distros, too. People with Arch build programs on it using the python3 -> python symlink, causing friction when the program is packaged for other distros. While some forks and fixes of Youtube-dl are available, it's easy to look for alternative programs.Users discuss the usefulness of two other YouTube downloading programs, yt-dlp and youtube-dl, in comparison to the almost unusable YouTube. The programs can still rip from hundreds of websites despite efforts to stymie ripping. While yt-dlp offers additional functionalities compared to youtube-dl, some users argue that the latter is still worth using. Recent legal troubles are causing a stir, with one user noting an abnormal court decision in Germany, and others mentioning other copyrighted material sharing services that continue to survive. Uberspace.de is defending itself for hosting a website that linked to youtube-dl on GitHub. German law delineating fair use is being put forward by some users to protect the software's legality.A German court ruling in favor of a copyright holder shows that different countries' legal systems affect the internet, and that the internet must evolve to adapt to regional variations while offering resistance to censorship, and retirees of judges are not the solution to personal biases from jurists. The possibility of generative sound in the music industry sparks concerns of new technologies' potential impact on the industry's business model; AI-generated songs may breach copyright laws in Apple Music and Spotify. The conversation also mentions the infamous Sony BMG copy protection rootkit scandal and how the industry adapts to the assimilation or copying of important experiences in the music industry.Hacker News users discuss various aspects of the recent lawsuit against YouTube-dl, a program that allows users to download videos off YouTube, with some expressing concern about the broader implications of the lawsuit for free speech online. Other users suggest that decentralized solutions and alternative tools may help in safeguarding free expression online. An HN user notes that while there are advantages to decentralized internet solutions, blockchains are not always necessary or appropriate. Some users also criticize the reliance of many FLOSS projects on centralized platforms such as GitHub for code hosting and version control, highlighting the need for alternative, distributed tools.It is illegal in Germany to bypass copy protection measures, which includes ripping a Netflix stream that uses Widivine/DRM. A recent court case may have used this argument, and it's worth noting that YouTube videos may use browser DRM. Copy protections on YouTube may rely more on security by obscurity, and some users speculate that it involves weird endpoints, parameters, and requirements. There is no evidence that YouTube's copy protection involves funding concentration camps, as one user sarcastically suggested. Meanwhile, applications for YC Summer 2023 are now open.",
    "hn_summary": "The banning of YouTube-DL hosting is seen as a push towards privatized censorship, with the RIAA and MPAA prioritizing money and power over decency. Intellectual property's role in limiting information flow is debated, with a range of views offered, including limitation of scope and duration. Users propose alternatives and denounce reliance on GitHub while discussing decentralization and problems with security by obscurity in copy protection."
  },
  {
    "id": 35552393,
    "timestamp": 1681372959,
    "title": "The art of auto engineering",
    "url": "https://www.howacarworks.com/video-course",
    "hn_url": "http://news.ycombinator.com/item?id=35552393",
    "content": "Skip to main contentHow a Car WorksArticlesVideo CourseSign inSign inSearch for:SearchTHE ART OF AUTO ENGINEERINGA COMPLETE 20 HOUR VIDEO COURSE122+ LESSONSEvery single part of a car. Clearly explained in great detail.EARLYBIRD PRICEWith 122 lessons, the course is ready to go. Buy it today for a bargain price until filming is completed in June 2023.Get started nowGET LIFETIME ACCESS$25 - One-off payment for lifetime accessAS SEEN IN.st0{fill:#fff}.st1{fill:#fdb913}.st0{fill:#fff}Get the knowledge you needOver the course of 20 hours, Alex Muir dismantles and then rebuilds a 2001 Mazda MX5 Miata. Every part and every system is explained in incredible detail, alongside beautiful CGI that makes it easy to understand. Professionally filmed in 4K, with full subtitles - this course covers the practical side of a major in automotive engineering.14+ PRO HOURSGo from the basics to advanced automotive engineering using 11 sections of lessons. Every part of a car is explained.COURSE HANDBOOKA downloadable 200-page handbook accompanies the course, with hundreds of beautiful illustrations of every part of a modern car - including practical tips and advice.ANYTIME, ANYWHEREA one-time payment gets lifetime access. Watch online, or in our iOS and Android apps. We'll keep track of your progress as you master the mechanicals of a modern motor.COURSE STRUCTUREOver 14 hours of pro-quality lessons are available in the course today. These 122 lessons are arranged into 11 sections. Further lessons are added every week, with an estimated completion date of June 2023.01Engine 291 minutesBonus: Dismantling the engineEngine BlockCrankshaftTools: Using a tap setUsing an engine standThe PistonsTips: How to install piston ringsTips: How to install pistonsHead GasketCylinder headEngine ValvesTips: How to install and remove valvesCamshaftsTips: How to install camshaftsLubrication system: IntroLubrication System: OilLubrication: Oil PumpLubrication: Main Oil SealsLubrication: Oil filtersLubrication: Oil Pressure SwitchLubrication: Where the oil goesLubrication: Oil Pan / SumpWater pumpTiming Gear & Timing BeltsStructure of the carEngine mountsFlywheelHarmonic balancerThe StarterSerpentine and Drive Belts02Electrical Systems 113 minutesAutomotive Electrics: PrinciplesAutomotive Electricity: MeasurementOscilloscopes: An introductionAlternatorRelaysSEE 87 MORE LESSONS▼Get started nowGET LIFETIME ACCESS$25 - One-off payment for lifetime accessVIEWERS LOVE IT21 October 2019I stumbled across your website while looking for info about a dieseling problem on my 1986 Ford F150 pickup. All I can say is you have a fantastic website for anyone looking for sound and detailed info on mechanical car stuff. I grew up in Detroit, and am, by default, a lifelong car guy. I’ve been a collector, restorer, enthusiast and studier of all things auto. Your site hits the nail on the head without going overboard for us enthusiasts who are not prof-mechanics. Thanks for building a great website. No need to respond, I just wanted to say thanks – and, I’ll be back.Tom Jackson, Tennessee13 October 2019Oscar Edel Netherlands8 October 2019WillJConnolly Austin, Texas30 September 2019Every once in a while, I come across an INSANELY valuable resource @alexmuir’s How a Car Works (@howacarworks) is one of these If you have ever felt like knowing more how these “from-A-to-B machines” work, check out this project CGI. Video courses. The whole thing So good 🔥— @roguewealth 2019-09-30@roguewealth30 September 2019@d_landsverk Grenland, Telemark, Norway18 September 2019wa3l San Francisco, CA1 August 2019Sam Petitfils over 3 years agoI purchased the \"early-bird\" pricing and wow am I glad. This stuff is unrivaled. A labor of love with engaging instruction and plenty of 4K footage. Masterful.REPLYSam Petitfils16 June 2019@oliviasayward Berlin15 March 2019@CalabogiePro Calabogie, Canada12 March 2019Hi Guys. I wanted to shoot you a message and tell you how much I have been enjoying the course. Your production value is next level. I think programs like this are the future of the internet. You go above and beyond what top youtubers are producing and you hit the mark with an affordable price point. I often see posts in online forums where people are asking how to get into car maintenance and you are my recommendation.Ander G Canada2 March 2019i Sir Alex! sir i Love your work and everything you are doing! I'm a Muslim 🙃Sir i am waiting for the update like Deadly !!! 😁I just can't wait !I wanted to be a car mechanic (computer specialist and auto electrician) In Pakistan we don't have teachers like you !!!🥰 I'll be very Thankful For Your Reply Sir! Love From Pakistan❤️Muhammad S Pakistan14 February 2019@P1kachugahashi1 Japan14 February 2019@TheCaptainDan9 February 2019Hey Alex! 😀I can't describe how thankful I am for everything you're doing. Searching through websites and youtube can be soooo exhausting and overwhelming. It's a true blessing to have everything covered in one place in such an easy, simple and detailed way like in your website and video courses. 😀Amila S Kosovo20 February 2018@0xP1kachu JapanAny questionsCan I start watching today?Absolutely. There are 14 hours of lessons covering the whole engine and most of the engine bay systems. We're filming more every week, and all future content is included.How long do I get access?Forever. Until the course is completed the pricing is a one-time payment of $25. When I've finished the course I might look at some sort of monthly subscription but for now, I know that I prefer to pay a fair price once and get everything. That's how it works in a shop and I believe that's how it should work online.When will the series be complete?June 2023. I work full-time on this series, and it takes a long time to setup, write, record and edit every lesson. But the quality is extremely high, and I want it to be a reference piece for the next 10 years. As technology develops I will go back and add more lessons.Can I download the videos?You can install the free apps for Android and iOS - these apps let you download the videos for offline viewing. At the moment you can't download the video files (mainly because I want to completely finish every lesson before I make them 'permanent').Will this course teach me to fix my car?I am asked this a lot. If you just want to fix one thing on a car then you don't need to understand automotive engineering or how things work. You can find videos on YouTube that will show you almost any repair, and you just follow those videos. But if you want to be able to diagnose and fix any car, any engine without spending hours Googling then you want a deep understanding of car mechanics. That is what you'll get from this series. You'll understand how things work, and by the time you've finished watching you'll really know what things like a MAF sensor, or a PCV valve are. It's universal, fascinating stuff! I love it.What about subtitles?Every lesson is professionally subtitled in English. Sometimes people ask whethe I will make subtitles in other languages and I'm afraid the answer is probably not. Technical foreign languge subtitles cost around $3 per minute. Right now we have 853 minutes of lessons, so it would cost $2,561 to translate. Sorry guys, there's just too much quality content!Can I donate or support you on Patreon?Thanks - you're kind! Honestly, the video course sales make enough to cover production costs and that's good enough for me at the moment. I love working on this project and I like creating a product that people buy and enjoy. If you've bought the course then that's great! I appreciate it :)Facebook@howacarworksTwitter@howacarworksYouTube@howacarworks👋How a Car Works is created, written by, and maintained by Alex Muir. I don't really have adverts here: it's funded by wonderful people buying the Car Mechanics Video Course.The design of this site was heavily, heavily inspired by CSS-Tricks under their supercool licence. If you're into design, go and check them out.Some stuffContactAboutPressBlogVideo Course",
    "summary": "The Art of Auto Engineering is a complete video course composed of 122+ lessons with 20 hours of footage explaining every single part of a car in great detail, covering the basics to advanced automotive engineering. The course is accompanied by a 200-page handbook and is available online or in iOS and Android apps for a one-time payment of $25 with lifetime access, and is professionally filmed in 4K quality with full subtitles. The course is praised by viewers for its engaging instruction and excellent production value.",
    "hn_title": "The art of auto engineering",
    "original_title": "The art of auto engineering",
    "score": 486,
    "hn_content": "A post on Hacker News about howacarworks.com, a website that teaches people the fundamentals of auto engineering with the help of interactive videos and 3D viewers; a few users have shared their experiences with the website, including a user who completed the course and found it worth the money; the website's founder, AlexMuir, also shared his personal journey of developing the website and the challenges he faced; other users have recommended cars or resources for beginners who are interested in auto engineering.Hacker News users discuss their favorite vehicles for learning car maintenance and repair, including the value for money of certain cars and the benefits of motorcycles for learning purposes. One user recommends a specific car model and notes important criteria to look for. Another user praises the educational value and affordability of a video course that teaches car maintenance and repair, and several express a willingness to pay even more for additional content.A conversation on the usefulness of an online automotive engineering course takes place on Hacker News, with users discussing the benefits of understanding car mechanics for repairs and maintenance. Users also share their personal experiences and opinions on DIY car repair and the reliability of AI-prompted car advice. Some users express their gratitude for the content, while others criticize the use of AI for important tasks such as snorkeling trail recommendations. Overall, the article highlights the importance of education and personal expertise in the realm of modern technology, and the limitations of relying solely on AI for practical tasks.Commenters discuss the accessibility and feasibility of DIY car repairs, while also sharing resources and tips for learning about automotive engineering. One commenter proposes a startup idea to crawl technical bulletins to make maintenance information searchable. Another suggests a German video series that demonstrates car manufacturing. A user discusses their experience learning from Volkswagen's official workshop manuals and YouTube videos. Overall, commenters emphasize the importance of understanding the theory behind repairs and having patience when tackling new tasks.Automotive experts discuss the benefits of investing in a set of tools for DIY auto repairs, with some recommending specific tool rental services. The promotion of paid courses on car repair and maintenance on HN sparks a debate, with some questioning why advertisements for pay-to-use classes should appear on the site. Despite the general agreement among auto enthusiasts regarding the usefulness of learning to repair your vehicle, some disagree on the necessity of purchasing car-brand specific tools. Readers recommend seeking out model-specific forums and YouTube videos on the topic for additional learning.Some people are willing to pay a high price for ebooks and sample code, possibly for professional development, while others find 22 Euros for 14 hours of content to be a great deal. A comment points out the prevalence of Apple ads on HN and questions the double standard. Another comment notes that the site itself functions as an advertisement for YC and its portfolio companies, as well as a job board with limited access. Despite potential sarcasm from commenters, the article highlights the varying opinions on the value of tech education materials.",
    "hn_summary": "Hacker News users share experiences and recommend resources for learning about automotive engineering, including interactive video courses and specific car models. Commenters discuss the benefits of understanding car mechanics, the limitations of relying solely on AI, and provide tips for DIY car repairs. Additionally, users debate the usefulness of paid courses and tools, and some criticize the appearance of pay-to-use class advertisements on the site."
  },
  {
    "id": 35554270,
    "timestamp": 1681388312,
    "title": "Apple will use 100 percent recycled cobalt in batteries by 2025",
    "url": "https://www.apple.com/newsroom/2023/04/apple-will-use-100-percent-recycled-cobalt-in-batteries-by-2025/",
    "hn_url": "http://news.ycombinator.com/item?id=35554270",
    "content": "Apple has announced that they will use 100% recycled cobalt in all Apple-designed batteries by 2025, in addition to using entirely recycled rare earth elements for magnets in Apple devices and 100% recycled tin soldering and gold plating for printed circuit boards. Apple has already expanded its use of recycled metals and aims to make all products with only recycled and renewable materials. To date, Apple sources more than 95% of all tungsten, nearly three-quarters of all rare earths, and over two-thirds of all aluminum from 100% recycled material. Apple's innovations in recycling and disassembly can drive industry-wide change, reducing reliance on newly mined minerals.Apple is using augmented reality (AR) to guide the disassembly of devices for recycling partners and further accelerate rare earth element recovery by disassembling Taptic Engines. By publishing Apple Recycler Guides, they aim to maximize efficiency of material recovery while safeguarding human health and safety. The enhanced recovery brings Apple closer to its goal of being carbon neutral across its entire supply chain and the life cycle of every product by 2030. The company has more than 100,000 employees dedicated to making the best products on earth, and to leaving the world better than it was found.",
    "summary": "Apple has announced its plan to use 100% recycled cobalt in all Apple-designed batteries by 2025, alongside entirely recycled rare earth elements for magnets and 100% recycled tin for circuit boards. Their aim is to use only recycled and renewable materials and they already source more than 95% of tungsten, nearly three-quarters of rare earths, and over two-thirds of aluminum from 100% recycled material. Apple uses augmented reality (AR) to guide the disassembly of devices for recycling partners and increase rare earth element recovery, thereby driving industry-wide change towards reducing reliance on newly mined minerals.",
    "hn_title": "Apple will use 100 percent recycled cobalt in batteries by 2025",
    "original_title": "Apple will use 100 percent recycled cobalt in batteries by 2025",
    "score": 421,
    "hn_content": "Apple announces it will use 100% recycled cobalt in batteries by 2025 to reduce waste. Additionally, Apple has been innovating to reduce plastic use in packaging using digital printing and new varnishing technology. Apple creates machines for its vendors and further reducing waste by producing less. There is substantial debate on whether Apple ought to make its recycling tech public knowledge to promote environmentalism. Though the efficacy of these changes is debated, it has created a culture of sustainability in the company.Apple aims to reduce the amount of cobalt put into its batteries, with old batteries containing more cobalt than the ones expected to be used by Apple in 2025, according to an HN user. Meanwhile, a debate over user-replaceable batteries continues, with one user arguing they are environmentally negative due to the waste generated by used batteries. However, recycling methods and the extended lifespan of durable products suggest the situation could be changed, a further user noted. On the other hand, users have pointed out some of the difficulties associated with repairing or replacing parts.Efficient battery disposal, recycling and replacement are issues faced by everyone or every region differently. Some places have better solutions, while some don't. Electronics stores and big boxes that sell devices containing Li-ion/Li-po batteries are a few places to recycle them. However, the recycling rates of businesses specializing in phone repairs may not be great compared to that of batteries. Mandating the companies that claim to recycle batteries to do so, rather than allowing them to send the batteries to a landfill can ensure a higher recycling rate. Apple offers a financial incentive to trade in your phone, but some view it as a controlling move. Besides, Apple offers a cheaper option of replacing batteries for continued phone use, which does not put the whole device in the trash. While user-replaceable batteries make devices easier to repair, they do not guarantee that the battery will be responsibly disposed of. If Apple did not exist, all smartphones might have user-replaceable batteries, but smartphones would look radically different.Apple's battery replacement policy is clear – no user replaceable batteries. However, they do offer replacements and third-party shops can do it too. While airpods add to e-waste, their limited lifespan is not very different from wired headphones. The iPhone 14 has improved repairability, but Apple is still criticized for their design. Apple also faces criticism over their cobalt supply chain, which involves child labor in DRC. Nevertheless, the company’s commitment to recyclable materials and a carbon-neutral supply chain continues. Although some may accuse Apple of greenwashing with this effort, they are headed in the right direction.While some argue that iPhones have a lifespan of around 5-6 years, others believe that the hardware, which often works fine for over a decade, is made obsolete by the software. However, older iPhones still receive security updates for much longer than 5 years, making them some of the longest-term supported devices on the market. Older Android phones also receive security updates for a long time via Google Play Services. Apple's device support and lifespan are best-in-class, with some users still using their operational iPhone 5s or 2013 MacBook Pro.Apple announces that starting from 2025, it will only use batteries with 100% recycled cobalt. The move signifies a shift towards sustainability and efficient recycling. Android phones receive security patches for longer than two years, contrary to common belief. Experts compare the support span of iPhones, Samsungs and recent Pixels with the aging Nexus 5X to ascertain Android's overall longevity. Although Apple batteries use a lot of cobalt, the metal's decreasing importance in the energy sector will lessen its impact. The pledges of sustainable production by tech companies are criticized as insincere marketing tactics.An HN discussion about Apple’s recycling cobalt policy suggests skepticism towards the genuineness of the program as marketing strategy, rather than sound ecological engineering. Some comments argue that recycling cobalt may not necessarily have a positive effect on the environment, given the marginal cost of increasing recycling, the price for recycled Cobalt, and that dollars spent serve as the best proxy for ecological damage. Endisneigh suggests MagSafe batteries should act as the primary battery for iPhones, using the MagSafe battery first and the built-in battery secondarily. The critical importance lies in keeping the phone running, especially in the context of a future Apple car. However, layer8 criticized MagSafe's inefficiency arguing that if Apple couldn't win, they ought to have opted for the environmentally-friendly option.MagSafe charging may not work if the phone's battery is completely dead. Users have raised questions about how MagSafe works differently than the traditional charging system, but it's unclear as there is no additional information available online. Some users express that MagSafe would be cool if it could charge a dead phone.",
    "hn_summary": "Apple announced its plan to use 100% recycled cobalt in batteries by 2025 and reduce plastic waste, but users debate the efficacy of these changes and whether the company should make its recycling tech public. The debate over user-replaceable batteries continues, with arguments that they are environmentally negative, while others suggest recycling methods and extending durable product lifespan can solve this problem. Apple's commitment to recyclable materials and a carbon-neutral supply chain is praised, but criticized for its design and cobalt supply chain. Users discuss the lifespan of iPhones and Android phones, and recycling methods for batteries. Some users suggest MagSafe batteries as the primary battery for iPhones, while others question its efficiency."
  },
  {
    "id": 35551830,
    "timestamp": 1681367502,
    "title": "We achieved a 6-fold increase in Podman startup speed",
    "url": "https://www.redhat.com/sysadmin/speed-containers-podman-raspberry-pi",
    "hn_url": "http://news.ycombinator.com/item?id=35551830",
    "content": "The authors of this article explain how they achieved a 6-fold increase in Podman startup speed by cutting out unnecessary processes, detailing the changes they made to improve the container engine's speed. They assert that this is critical in cars and other time-sensitive applications, where near-real-time container startup is essential. The team analyzed what happens when Podman starts a container and why it takes so long, addressing minor inefficiencies that became significant when grinding with a profiler. They also provided workarounds for kernel issues and used transient storage to speed up container startup.Red Hat's container engine, Podman, is working on finding and fixing performance issues in container start-up. By creating Podman with this new approach, it moved all container locking, reads, and writes, as well as the Podman database, to /run, which is a temporary filesystem, thus dramatically increasing the speed of starting a container from 2 seconds on the Raspberry Pi to under 0.3 seconds. This makes using the --transient-store option particularly great for an edge device or server. However, note that you cannot run containers in a mixed mode, where some are transient and others persist.",
    "summary": "Red Hat's container engine, Podman, achieved a 6-fold increase in startup speed by removing unnecessary processes and addressing minor inefficiencies that impact critical applications like cars, where near-real-time container startup is essential. The team used transient storage and provided workarounds for kernel issues, resulting in faster container startup. The use of --transient-store option is ideal for edge devices, although mixed mode containers are not supported.",
    "hn_title": "We achieved a 6-fold increase in Podman startup speed",
    "original_title": "We achieved a 6-fold increase in Podman startup speed",
    "score": 378,
    "hn_content": "Red Hat announced a six-fold increase in Podman startup speed with the latest release. However, some HN users expressed concern over the increasing complexity of software in cars after a bad experience with a breakdown, although other users pointed out that software can prevent catastrophic failures. There was also a debate about whether more software in cars is a good thing or not, with some suggesting that it can lead to more code bloat. One user made a joke about Kubernetes in cars, but others pointed out that the U.S. Air Force has indeed deployed Kubernetes in planes.HN users discuss the overcomplication of modern cars and point out the trade-off between electronics and reliability. Some users suggest using technologies such as Erlang or Docker Compose, while others argue that reliability never comes from unnecessary complexity. The conversation diverges into a discussion about the ease of use and reliability of modern printers compared to older models, and how some users prefer to use separate print servers to prevent unnecessary complexity. Overall, the discussion highlights the need to balance technological advancements with practicality and reliability.Older printers were overengineered, making them more reliable but with a higher cost. Some comments suggest that modern appliances with fewer discrete components are more reliable than the older ones. However, cars, phones, and other devices with complex software and numerous sensors may be harder to repair and maintain, leading some people to prefer older models. An HN user suggests that manufacturers could make \"dumb cars\" with fewer components and less software. Mechanically skilled IT people may be in short supply in the future, given the move to electronic and possibly electric cars. Finally, an HN user suggests the use of a code reader for checking engine lights in cars, which could save money on garage diagnostics.A discussion on diagnosing complex auto issues leads to a debate on the right to repair, liability issues, and the potential for containerization in automobiles. HN users argue that it is cheaper and better for the environment to allow tinkering with software in cars and hold entities liable for their own modifications. Some argue that the use of microservices in cars can cause integration issues and testing complexities. One user jokingly suggests a scenario where a mechanic diagnoses a car problem using Kubernetes terminology.Experts discuss the advantages and disadvantages of microservices and containers in relation to scalability, service isolation, update management, and system resilience. While some users argue that deploying separate services in containers can help achieve better service isolation and security, others point out that such an approach might increase memory usage and reduce the sharing of resources. Although containers' toolset has potential benefits, some users stress that too much reliance on them might create new problems, including security, compatibility issues, and container sprawl. Finally, experts suggest that it's up to individual teams and organizations to choose the tools that fit their specific needs instead of blindly adopting the latest tech trends.A discussion on Hacker News has sparked debate over the use of containers in various programs such as car entertainment systems. Proponents argue that containers simplify the update process and unify apps while reducing risk and allowing for better resource sharing, which can be particularly helpful for inessential systems like vehicle entertainment systems. However, opponents say that containers are not necessary and can introduce security risks. The discussion raises questions about the use of containers in various applications, and whether they ultimately help or hinder the development process.Red Hat's Podman container system is improving in its startup speeds for cars as we now learn that containers are commonly used in cars. Though Podman has improved it has experienced continuity issues with files at times leaving the network in an undefined state. Docker favors improvements in their 'rootless mode' however, after multiple problematic runs with Podman, trust was lost between developers and Podman will always have its issues. It seems the use of containers in cars is becoming widespread and thus developers must constantly innovate in constraints enabling constant creativity.",
    "hn_summary": "Red Hat's Podman sees a six-fold increase in startup speed for cars, though HN users discuss the overcomplication of modern cars and raise concerns over reliability and maintenance. The discussion diverges into debates on the right to repair, the use of microservices and containers, and the balance between technological advancements and practicality."
  },
  {
    "id": 35559124,
    "timestamp": 1681407399,
    "title": "Improving Tailscale via Apple's open source",
    "url": "https://tailscale.dev/blog/darwin-spelunking",
    "hn_url": "http://news.ycombinator.com/item?id=35559124",
    "content": "The ability to peek under the hood of the operating system can be a powerful tool for debugging. Spelunking Apple’s Open Source, a recent blog post by Daniel Jalkut’s, struck a very familiar chord with me, reminding me of times I spent poring through WebKit internals at my previous employer. I've been able to continue that pattern at Tailscale, now more focused on Darwin (the operating system at the core of macOS and iOS), its kernel and its userland tools.Just recently, Apple's open source came in handy when debugging an issue for the Tailscale 1.36 release. We were investigating two network-interface related bugs – one where Tailscale traffic was looping on itself (instead of being passed through to the actual physical network connection) and another where Tailscale was sending traffic over the phone’s cellular interface (even though Wi-Fi was available). The fix for both of these involved more consistently “binding” Tailscale’s network requests to the active network interface (and re-binding them when it changes).Normally figuring out what the active network interface is pretty straightforward — it is the interface that is associated with the default route. However, when Tailscale is configured to use an exit node, it becomes the default route, thus putting us back in danger of looping traffic. We want to know what the interface would be if Tailscale was not present (but without actually disabling it, since that is disruptive). I initially had an approach that lived in our closed-source repo and relied on private APIs (that I should probably plead the 5th instead of discussing further). Worse yet, we started to get reports that users were having issues because we were sometimes detecting the wrong interface.Brad mentioned we should see how the ifconfig outputs changes in various states: when Tailscale is the default route, when the default physical interface changes (e.g. from Ethernet to Wi-Fi), and combinations of the two. While the default output didn’t have anything interesting, getting more verbose information (via the -v flag) had a clue: an “effective interface” field appeared for the virtual Tailscale utunN interface, with the name of the actual physical interface (en0, en10, etc.) that should be handling the traffic.utun5: flags=8051<UP,POINTOPOINT,RUNNING,MULTICAST> mtu 1280 index 34  eflags=5002080<TXSTART,NOAUTOIPV6LL,ECN_ENABLE,CHANNEL_DRV>  inet 100.118.111.67 --> 100.118.111.67 netmask 0xffffffff  ...  effective interface: en4  ...ifconfig is part of the code that Apple open-sources, and a quick search through it turned up the implementation of that line:if (ioctl(s, SIOCGIFDELEGATE, &ifr) != -1 && ifr.ifr_delegated) {  char delegatedif[IFNAMSIZ+1];  if (if_indextoname(ifr.ifr_delegated, delegatedif) != NULL)    printf(\"\\teffective interface: %s\\n\", delegatedif);}ioctl is kind of a Swiss Army knife system call, in this particular case the SIOCGIFDELEGATE option allows the underlying physical interface to be obtained. The Darwin Networking chapter of the *OS Internals book has more details.Now that we knew what ifconfig did, it was a matter of trying to replicate it in Tailscale’s client. Go ends up using various ioctls to implement standard library functionality on Darwin (e.g. to get the MTU associated with an interface), but it didn’t happen to have a wrapper for SIOCGIFDELEGATE. Luckily it was not too much boilerplate to do the equivalent within Tailscale’s code.I ran the code on my MacBook and it worked! But what about iOS? ifconfig (and the Darwin userland tools in general) is not available on iOS (except for creative hacks), and the iOS sandbox may be more restrictive when it comes to which ioctls it allows. I was betting on this being a shared implementation on Apple’s side, and thus that it worked on all of their platforms. The moment of truth came a few minutes later when I tried it on my iPhone, and luckily it worked there too.The final implementation ended up being pretty concise, and it was satisfying to have it an unstable build the next day and have users confirm that the problem was fixed.",
    "summary": "The Tailscale team used Apple's open source to debug network-interface related bugs for their 1.36 release, relying on ifconfig to determine the active network interface. When Tailscale is configured to use an exit node, it becomes the default route, necessitating a fix to consistently \"bind\" network requests to the active network interface without causing looping traffic. SIOCGIFDELEGATE, available via ioctl, allows for the underlying physical interface to be obtained and was implemented into Tailscale's code for macOS and iOS.",
    "hn_title": "Improving Tailscale via Apple’s open source",
    "original_title": "Improving Tailscale via Apple’s open source",
    "score": 374,
    "hn_content": "Tailscale's improvement via Apple's open source has caught the attention of Hacker News. Users highlight the benefits of shared/open source code for unusual projects and the importance of transparency in software development. The discussion includes debates around Tailscale's closed source code and the importance of open sourcing. However, Tailscale's developer highlights the effectiveness of their proprietary GUIs, which may not be worth the resulting pain of open sourcing. Some paying customers indicate that the reputation of the core product being open source while having support for questions about its development is more important than open sourcing everything.The article debates the importance of closed and open source software, while some commenters argue that a more open approach is better for Linux and the tech community overall. Others point out the benefits of closed systems, such as easier maintenance and better control for the creators. Some comments also focus on specific issues with Tailscale, including difficulty accessing network shares on Windows 11 and potential battery drain on iOS devices. Despite the diverse opinions, the discussion highlights the importance of considering various perspectives in the tech industry.Tailscale is gaining traction over Zerotier due to its open protocols, transparency, and continuous deployment of new features. Zerotier's restricted userland environments also require a \"Business Source License\" and may not provide enough engineering efforts in maintaining its own protocol. Tailscale's mesh system allows for direct connections, making their free tier economically workable. While there are many competing solutions in the market offering unique value propositions, Tailscale appears to have captured mindshare within the tech community. Revenue and moat concerns, however, exist for some product users.",
    "hn_summary": "HN users discuss the benefits and challenges of open and closed source software in Tailscale's improvement via Apple's open source. Some pay customers prioritize the reputation of Tailscale's open source core product, while some raise specific issues with Tailscale such as difficulty accessing network shares on Windows 11 and potential battery drain on iOS devices. The discussion highlights the importance of considering various perspectives and Tailscale's gaining traction over Zerotier due to its mesh system and continuous deployment of new features, but revenue and moat concerns exist for some product users."
  },
  {
    "id": 35561203,
    "timestamp": 1681415497,
    "title": "Animated Drawings",
    "url": "https://fairanimateddrawings.com/site/home",
    "hn_url": "http://news.ycombinator.com/item?id=35561203",
    "content": "HomePaperDatasetGithub Animated DrawingsCreate animations starring your own drawn characters. This is an implementation of the algorithm described in the paper, 'A Method for Automatically Animating Children's Drawings of the Human Figure'.Sorry, your browser doesn't support embedded videos.Animated DrawingsThis repo contains an implementation of the algorithm described in the paper, `A Method for Automatically Animating Children's Drawings of the Human Figure' (currenly under peer review).In addition, this repo aims to be a useful creative tool in its own right, allowing you to flexibly create animations starring your own drawn characters.If you do create something fun with this, let us know! Use hashtag #FAIRAnimatedDrawingsInstallationInstallation is quick and easy! You can install with these simple commands:git clone git@github.com:fairinternal/AnimatedDrawings.gitcd AnimatedDrawingspip install -e .See the README for more details.Using Animated DrawingsOnce you've installed AnimatedDrawings, using it is as simple as importing the package and specifying a configuration file. Here's an example:from animated_drawings import renderrender.start('./examples/config/mvc/interactive_window_example.yaml')And the resulting window:OptionsBy modifying the configuration files, you can switch characters, apply different motions, change output formats, and more! Here are a couple examples:Transparent GIFsfrom animated_drawings import renderrender.start('./examples/config/mvc/export_gif_example.yaml')Multiple characters in a scenefrom animated_drawings import renderrender.start('./examples/config/mvc/multiple_characters_example.yaml')Adding a background imageSuppose you'd like to add a background to the animation. You can do so by specifying the image path within the config. Run the following commands from a Python interpreter within the AnimatedDrawings root directory:from animated_drawings import renderrender.start('./examples/config/mvc/background_example.yaml')Animate Your Own DrawingWe also provide scripts and models so you can animate your own drawings with a single command:python image_to_animation.py drawings/garlic.png garlic_outTry It Out For YourselfIf you want to learn how to do all this and more, see the GitHub Readme :)Alternatively, if you just want to quickly animate your own drawing, try out our browser-based demo, sketch.metademolab.com.Get In TouchIf you want to contact the project author directly, you can reach me on Twitter: @hjessmith.",
    "summary": "The 'Animated Drawings' repository on Github implements the algorithm described in the paper 'A Method for Automatically Animating Children's Drawings of the Human Figure', allowing users to create custom animations featuring their own hand-drawn characters. The installation process is straightforward, and configuration files can be modified to change various options, including output formats and background images. The repository also provides scripts and models for animating personal drawings, and a browser-based demo is available for quick and easy use.",
    "hn_title": "Animated Drawings",
    "original_title": "Animated Drawings",
    "score": 371,
    "hn_content": "The Fair Animated Drawings project allows users to animate drawings with code and a browser-based version. Some users point out issues with the browser version, but such issues are fixed in the GitHub version. The project has attracted attention from readers, who explore its potential for animation-related business ideas. The author provides a browser-based and a GitHub Code for the project under an MIT license. The readers hope for an Android app version of the project. The project can be used for creating animations from videos captured by Rokoko Video.A relevant work on non-photorealistic pose estimation called Gesture3D, posing 3D characters via gesture drawings, seems to be applicable to a specific use case, according to an HN user's comment. YC Summer 2023 applications are open, which can be found in the provided links.",
    "hn_summary": "The Fair Animated Drawings project animates drawings with code, available in a browser-based and GitHub version. Users are interested in its potential for business ideas and hope for an Android app version. A relevant work on non-photorealistic pose estimation called Gesture3D seems applicable to a specific use case, and YC Summer 2023 applications are open."
  },
  {
    "id": 35554460,
    "timestamp": 1681389489,
    "title": "Amazon CodeWhisperer, Free for Individual Use, Is Now Generally Available",
    "url": "https://aws.amazon.com/blogs/aws/amazon-codewhisperer-free-for-individual-use-is-now-generally-available/",
    "hn_url": "http://news.ycombinator.com/item?id=35554460",
    "content": "Amazon CodeWhisperer, Free for Individual Use, is Now Generally Availableby Steve Roberts | on 13 APR 2023 | in Amazon CodeWhisperer, Amazon Machine Learning, Artificial Intelligence, AWS Cloud9, AWS Toolkit For JetBrains IntelliJ IDEA, AWS Toolkit For JetBrains PyCharm, AWS Toolkit For JetBrains Rider, AWS Toolkit For JetBrains WebStorm, AWS Toolkit For VS Code, Developer Tools, Launch, News | Permalink | Comments | ShareToday, Amazon CodeWhisperer, a real-time AI coding companion, is generally available and also includes a CodeWhisperer Individual tier that’s free to use for all developers. Originally launched in preview last year, CodeWhisperer keeps developers in the zone and productive, helping them write code quickly and securely and without needing to break their flow by leaving their IDE to research something. Faced with creating code for complex and ever-changing environments, developers can improve their productivity and simplify their work by making use of CodeWhisperer inside their favorite IDEs, including Visual Studio Code, IntelliJ IDEA, and others. CodeWhisperer helps with creating code for routine or time-consuming, undifferentiated tasks, working with unfamiliar APIs or SDKs, making correct and effective use of AWS APIs, and other common coding scenarios such as reading and writing files, image processing, writing unit tests, and lots more.Using just an email account, you can sign up and, in just a few minutes, become more productive writing code—and you don’t even need to be an AWS customer. For business users, CodeWhisperer offers a Professional tier that adds administrative features, like SSO and IAM Identity Center integration, policy control for referenced code suggestions, and higher limits on security scanning. And in addition to generating code suggestions for Python, Java, JavaScript, TypeScript, and C#, the generally available release also now supports Go, Rust, PHP, Ruby, Kotlin, C, C++, Shell scripting, SQL, and Scala. CodeWhisperer is available to developers working in Visual Studio Code, IntelliJ IDEA, CLion, GoLand, WebStorm, Rider, PhpStorm, PyCharm, RubyMine, and DataGrip IDEs (when the appropriate AWS extensions for those IDEs are installed), or natively in AWS Cloud9 or AWS Lambda console.Helping to keep developers in their flow is increasingly important as, facing increasing time pressure to get their work done, developers are often forced to break that flow to turn to an internet search, sites such as StackOverflow, or their colleagues for help in completing tasks. While this can help them obtain the starter code they need, it’s disruptive as they’ve had to leave their IDE environment to search or ask questions in a forum or find and ask a colleague—further adding to the disruption. Instead, CodeWhisperer meets developers where they are most productive, providing recommendations in real time as they write code or comments in their IDE. During the preview we ran a productivity challenge, and participants who used CodeWhisperer were 27% more likely to complete tasks successfully and did so an average of 57% faster than those who didn’t use CodeWhisperer.Code generation from a commentThe code developers eventually locate may, however, contain issues such as hidden security vulnerabilities, be biased or unfair, or fail to handle open source responsibly. These issues won’t improve the developer’s productivity when they later have to resolve them. CodeWhisperer is the best coding companion when it comes to coding securely and using AI responsibly. To help you code responsibly, CodeWhisperer filters out code suggestions that might be considered biased or unfair, and it’s the only coding companion that can filter or flag code suggestions that may resemble particular open-source training data. It provides additional data for suggestions—for example, the repository URL and license—when code similar to training data is generated, helping lower the risk of using the code and enabling developers to reuse it with confidence.Open-source reference trackingCodeWhisperer is also the only AI coding companion to have security scanning for finding and suggesting remediations for hard-to-detect vulnerabilities, scanning both generated and developer-written code looking for vulnerabilities such as those in the top ten listed in the Open Web Application Security Project (OWASP). If it finds a vulnerability, CodeWhisperer provides suggestions to help remediate the issue.Scanning for vulnerabilitiesCode suggestions provided by CodeWhisperer are not specific to working with AWS. However, CodeWhisperer is optimized for the most-used AWS APIs, for example AWS Lambda, or Amazon Simple Storage Service (Amazon S3), making it the best coding companion for those building applications on AWS. While CodeWhisperer provides suggestions for general-purpose use cases across a variety of languages, the tuning performed using additional data on AWS APIs means you can be confident it is the highest quality, most accurate code generation you can get for working with AWS.Meet Your new AI Code Companion TodayAmazon CodeWhisperer is generally available today to all developers—not just those with an AWS account or working with AWS—writing code in Python, Java, JavaScript, TypeScript, C#, Go, Rust, PHP, Ruby, Kotlin, C, C++, Shell scripting, SQL, and Scala. You can sign up with just an email address, and, as I mentioned at the top of this post, CodeWhisperer offers an Individual tier that’s freely available to all developers. More information on the Individual tier, and pricing for the Professional tier, can be found at https://aws.amazon.com/codewhisperer/pricing. Steve RobertsSteve Roberts is a Senior Developer Advocate, focused on .NET and PowerShell development on AWS. Based in Seattle, Washington, Steve worked as a Senior Development Engineer on the AWS SDKs and tools for .NET and PowerShell developers. He was the development lead for the AWS Tools for PowerShell and the AWS Tools for Azure DevOps, and also worked on the AWS Toolkits for Visual Studio, and Visual Studio Code, plus the AWS SDK for .NET. Follow him on Twitter @bellevuesteve.CommentsAWS PodcastSubscribe for weekly AWS news and interviewsLearn more AWS Partner NetworkFind an APN member to support your cloud business needsLearn more AWS Training & CertificationsFree digital courses to help you develop your skillsLearn more",
    "summary": "Amazon CodeWhisperer, a real-time AI coding companion, is now generally available and includes a CodeWhisperer Individual tier that's free for all developers to use. The tool helps developers write code quickly and securely and without leaving their IDE. CodeWhisperer offers suggestions for general-purpose use cases across a variety of languages and can filter or flag code suggestions that may resemble particular open-source training data, helping to reduce the risk of using potentially biased or flawed code.",
    "hn_title": "Amazon CodeWhisperer, Free for Individual Use, Is Now Generally Available",
    "original_title": "Amazon CodeWhisperer, Free for Individual Use, Is Now Generally Available",
    "score": 308,
    "hn_content": "Amazon CodeWhisperer is now generally available and supports Python, Java, JavaScript, TypeScript, and C# plus ten other languages, including Go, Kotlin, Rust, PHP, and SQL. Copilot is reportedly better than CodeWhisperer, although CodeWhisperer is a useful tool. Copilot is not limited to language support as it even provides elaborate slabs of code for languages it doesn't know. The future of coding may involve LLMs (large language models) for coding, debugging, and refactoring, allowing design to take center stage. However, computer time may be cheaper than developer time, which may create problems for the future.Amazon has launched CodeGuru Reviewer, an AI tool that scans code to identify issues and recommend fixes for efficiency and cost reduction. The CodeGuru also offers security and privacy controls, and its subscription is priced according to code analysis frequency. The service can be run on specific existing code or on whole new projects, enabling the opportunity to take corrective measures before issues become entrenched problems. It remains unclear whether pricing is scalable to large commercial users, who may also harbour confidential concerns around privacy.Amazon's CodeWhisperer goes through a significant compliance process to ensure security, and AWS treats user data with utmost care; CodeWhisperer uses AI to help write code, and users are sceptical about privacy and trust; the new technology is not yet 100% reliable, though it may be heading towards a time when AI-generated code is the norm; the value of the AI-generated code is yet to be seen, but it's theoretically possible there will come a time where the code is not even seen by its author.CodeWhisperer, a new AI-powered coding assistant developed by AWS, uses language models to assist developers in writing code, only requiring the user to provide descriptions of the desired functionality. However, the coding assistant system is non-deterministic, and for software development beyond typical use cases, prompt engineering is likely to become increasingly important. Although LLM generated apps may be efficient for rapid prototyping, building complicated systems will require human intervention. Furthermore, users hoping to use the AI generated code must ensure that the instructions are carefully and specifically designed. Finally, CodeWhisperer filters code suggestions that may be biased or unfair, and can identify similarities to open-source training data.Amazon CodeGuru has released a new version including more languages compared to Copilot, although an HN user pointed out that it has terrible UX and Copilot has miles more intelligent suggestions. It's possible to use CodeWhisperer to generate code, but potential legal concerns arise from the use of AI-generated code. The product is free for individual use, but pricing for enterprise use is unclear. Amazon seems to want to drive adoption and compete against established Copilot products. Free software has its place in getting users to pay for business licenses and encouraging the use of more AWS API stuff, which CodeWhisperer is fine-tuned on.",
    "hn_summary": "Amazon CodeWhisperer is now generally available, supporting several languages, including Python, Java, JavaScript, TypeScript, and C#. Although Copilot is reportedly better than CodeWhisperer, the latter is a useful tool that may lead to AI-generated code becoming the norm. Additionally, Amazon has launched CodeGuru Reviewer, an AI tool that scans code to identify issues and recommend fixes for efficiency and cost reduction."
  },
  {
    "id": 35553421,
    "timestamp": 1681382084,
    "title": "Google has already pulled six products in 2023",
    "url": "https://toolhub.tech/blog/Google-2023-Shutdown-Spree-6-Products-Pulled-in-Just-4-Months/",
    "hn_url": "http://news.ycombinator.com/item?id=35553421",
    "content": "Google's 2023 Shutdown Spree: 6 Products Pulled in Just 4 MonthsPublished on 2023-04-11 by ToolHubGoogle Graveyard 2023Google is notorious for its habit of killing off products, and 2023 has been no exception. In just the first four months of the year, the tech giant has already pulled the plug on six products, leaving users scrambling for alternatives. Let's take a closer look at each of the products that have been shut down in 2023 so far:Google Code JamGoogle Code Jam: This international programming competition was hosted and administered by Google. It consisted of multiple rounds of online and onsite contests, where participants had to solve challenging problems using their preferred programming language. The top 25 finalists got to compete for the title of Code Jam Champion and a prize of 15,000 USD at the Google headquarters. However, Google has decided to shut it down in 2023.Google CurrentsGoogle Currents: This service provided social media features similar to Google+ for Workspace users. It was launched in July 2020 as a rebrand of the now-defunct Google+ platform. However, it was shut down in April 2023, and people using it were pushed to Spaces, Google's equivalent of a Slack channel.Google Street ViewGoogle Street View app: This app was available on Android and iOS and enabled people to get a 360-degree view of locations around the world. It was over 12 years old but was shut down in March 2023. While the app is now gone, its functionality still exists on Google Maps and Street View Studio. As this comment on HN pointed out, this was a good move by Google.Google JacquardGoogle Jacquard: This small tag could be embedded into clothing and paired with a smartphone, allowing people to perform certain customizable actions on their phones without actually touching them. For example, a double-tap could play/pause music, brushing the fabric could change tracks, and covering the sensor would mute/unmute notifications. It was first unveiled back in 2015 by Google Advanced Technology & Projects (ATAP), but was killed in March 2023.Google StadiaGoogle Stadia: Google's cloud gaming service allowed gamers to run AAA titles on cheaper hardware, including phones, laptops, and TVs. However, it was shut down on January 18 due to low user adoption. Google refunded all Stadia hardware purchased through the Google Store along with the games and add-ons purchased from the Stadia Store.Google OnHubGoogle OnHub: This wireless router was powered by Google software and managed by Google apps. It offered special features like Google Assistant and was sold in two versions, manufactured by either Asus or TP-Link. In 2021, Google announced that the OnHub routers would no longer receive any software updates. Then in January 2023, the company rendered the product almost completely useless by disabling most of its features.Share Tweet Share Share Share Share",
    "summary": "Google has shut down six products in the first four months of 2023, including the Code Jam programming competition, social media platform Google Currents, the Street View app, wearable tech Google Jacquard, cloud gaming service Google Stadia, and wireless router Google OnHub. While some of these products were over a decade old, Google has faced criticism for its habit of abruptly ending popular services.",
    "hn_title": "Google has already pulled six products in 2023",
    "original_title": "Google has already pulled six products in 2023",
    "score": 300,
    "hn_content": "Google has discontinued six products already this year, with a dedicated Streetview app being the most recent. Some users argue that Google should be more transparent about which projects are side projects and which are products. Others suggest releasing side projects under a different brand name. Some users criticize Google's practice of labeling products as \"beta\" or \"experimental,\" as this can damage public perception of their products. One example is Gmail, which was in beta for five years despite having over a billion users. Stadia, a recent Google product, was refunded to users after it was shut down.Google's spotty track record for new products includes failed endeavors such as Google Glass, Google Plus, and Google Wave. The lack of trust in Google comes from its failure to stand behind their roadmaps and lack of clear support for products. The company cannot simply experiment without facing the risk of adverse effects for those who bet on their experiment. However, Google's cloud unit, while dismissed by some as just another side project, is growing with around 10% of the market share in the cloud market.Google's cloud business has grown to over $20B/year and is still expanding. However, some users note concerns over Google's customer and developer engagement as well as fears about its account-killing algorithm. An HN user also questions GCP's profitability and market share in comparison to AWS. Other comments point out issues with Google's product development and acquisitions. Despite these concerns, readers understand the potential of Google's technological innovation, specifically mentioning Stadia and Google Earth on mobile. Nonetheless, past reports about its struggling services continue to plague Google's online reputation.Comments on an article about Google's decision to discontinue its Street View app suggest that the company's reputation for killing off products has led to consumer distrust. Some HN users claim that Google is missing opportunities to create new revenue streams and to evolve beyond ads, while others argue that the decision to cancel the Stadia gaming service was an inevitable consequence of a flawed business model that failed to attract users. One HN user suggests that Google should have focused on improving its voice assistant, Google Assistant, in a bid to compete with Siri and Alexa.Comments on Google's products range from half-assed implementations to compatibility issues with other services. Some users have experienced losing their data with no support available. Despite this, companies and individuals still use Google's products. Google's reputation damage does not significantly affect their revenue as their primary income comes from advertising. Google's decision-making process for launching, maintaining, and killing products seems sudden and quick compared to other companies. The search function is not considered reliable anymore, causing the ChatGPT tool to capitalize on this weakness. While accuracy in Google's AI language tools is improving with each iteration, efficiency is becoming stagnant.An HN discussion about the accuracy of ChatGPT has users debating solutions such as the costly GPT4, 5, or custom hardware; even if the industry is optimistic, AI developers should consider the enormous cost of maintaining and developing this tech. OpenAI and Microsoft are pioneers of LLMs, which have proven to monopolize the search engine space and could potentially be a danger to Google's search engine interface. While Google's performance evaluation system is aimed at bringing new and innovative projects to life, there's an urgent need for \"steady hand on the tiller\" engineers to maintain existing projects.Google's tendency to abandon projects and its impact on the company's reputation are a popular topic among HN users, although the majority of people outside of tech enthusiasts do not seem to care; many HN users question why Google does not use a different brand name to experiment with new products, rather than risking damage to its main brand image; contractors may be used to mitigate staff retention and overwhelming developers with maintenance work, but this is not always effective and can harm career progression prospects; the idea that people would rather work on less exciting maintenance tasks at Google due to the high pay is also discussed; while it is acknowledged that other companies cancel projects, Google's reputation for doing so frequently, and sometimes capriciously, draws criticism; it is noted that this reputation can negatively impact Google's profits in lines of business beyond ads.Stadia was shut down by Google, leading users to question why Gmail is free and lives forever but Stadia, with paying customers, was not good enough. This has led to speculation that users are sold out to advertisers. Google is known for killing moderately successful products that users depend on while launching competitor products, as evident in its numerous chat/messaging platforms. Alphabet exists to generate profits for shareholders, not to make cool stuff or make users happy. Users have expressed dissatisfaction in relation to Google's wave of unfinished products it has launched over the past decade. Some commentators have pointed out that when Google cancels its products, it's not usually due to financial constraints.Google employees and their company's practices are criticized for minimizing negative press and stymying discussion, and for being notoriously unreliable partners due to product cancellations with short notice and poor path forward. However, other big tech corporations such as Microsoft and Amazon have also frequently launched and canceled products. HN users pointed out specific cases of Google's questionable product shutdown methods, such as with Stadia, while a website called 'killedbygoogle.com' lists all of Google's discontinued products. Overall, the article focuses on discussions about corporate practices in big tech companies and how they affect product support for consumers.",
    "hn_summary": "Google has discontinued six products in 2023, with concerns over transparency and product labeling, and lack of support for failed endeavors including Google Glass and Google Plus. While the cloud unit is growing with 10% market share, concerns are raised about customer and developer engagement and the account-killing algorithm. Users debate solutions and costs for improving ChatGPT's accuracy, while Google's reputation for abandoning projects draws criticism on product support for consumers."
  },
  {
    "id": 35552378,
    "timestamp": 1681372813,
    "title": "Nvidia RTX Remix Runtime Open Source Available Now",
    "url": "https://www.nvidia.com/en-us/geforce/news/rtx-remix-runtime-open-source-download/",
    "hn_url": "http://news.ycombinator.com/item?id=35552378",
    "content": "Skip to main contentArtificial Intelligence Computing Leadership from NVIDIAProductsSolutionsIndustriesFor YouShopDriversSupportGeForceProductsGames & TechGeForce ExperienceDriversNewsSupportShopNVIDIA RTX Remix Runtime Open Source Available NowBy NVIDIA on April 12, 2023 | Featured Stories GeForce RTX GPUs GeForce RTX Laptops NVIDIA DLSS NVIDIA Omniverse NVIDIA RTX NVIDIA RTX Remix Ray TracingRTX Remix is a revolutionary modding platform to remaster classic DirectX 8 and 9 games with path tracing, NVIDIA DLSS, AI-enhanced textures, and user-created assets. RTX Remix, part of the NVIDIA Studio suite of apps, is composed of two core components that work together to enable modders to remaster classic PC games: the RTX Remix creator toolkit, and a custom RTX Remix runtime.The RTX Remix creator toolkit, built on NVIDIA Omniverse and used to develop Portal with RTX, allows modders to assign new assets and lights within their remastered scene, and use AI tools to rebuild the look of any asset. The RTX Remix creator toolkit Early Access is coming soon.The RTX Remix runtime captures a game scene, and replaces assets at playback while injecting RTX technology, such as path tracing, DLSS 3 and Reflex into the game. Already, mod developers have been using the RTX Remix runtime from Portal With RTX to create experimental ray traced scenes in numerous classic games.To further empower the mod development community to extend Remix’s game compatibility and feature set, NVIDIA is releasing the RTX Remix runtime as open source on GitHub today.The RTX Remix runtime is open source with a permissive MIT license, and includes the following components:USD capture and replacement modules, which are responsible for capturing a game scene to USD, and replacing original game assets with modded game assets at runtime.Bridge, which translates the renderer from a x86 to a x64 instruction set. This component uncaps the memory available for rendering.Scene manager, which uses information coming through the D3D9 fixed function API to create a representation of the original scene, track game objects frame to frame, and set up the scene to be path traced.The core path tracer, which includes the rendering loop, the material handling, and the game specific rendering features (e.g., decals and particles). Please note, the various technologies (DLSS, NRD, RTXDI) that accelerate our path tracer and enable it to render in real time will continue to be available via their existing SDKs and licenses from the NVIDIA Developer portal.Open sourcing unlocks numerous possibilities to extend the feature set of the Remix runtime. A few examples of projects that advanced mod developers might tackle via source code access include:Making more of their favorite games compatible with RemixModernizing the fluid simulation to render smoke and fire with realistic volumetricsInjecting custom post effects shaders in the runtimeAdding animated lights (e.g., flickering fire, or lights that cycle through colors)Replacing animated character meshesChanging camera positions in games (e.g., turning a first person game into an isometric one)Incorporating virtual reality support into the rendererImplementing dynamic conditional replacements (e.g., add fog or change a light in response to a player’s position)There is ample opportunity to change how classic titles are played, and open source widens the possibilities beyond our imagination. We look forward to seeing what mod developers will build with source access.For PC gamers, an open source RTX Remix runtime will help broaden the variety of games with RTX mods and the types of mods themselves.How To Get InvolvedThe RTX Remix runtime source code can be found on GitHub, and bugs can be reported here.Our main goal is to expand game compatibility and extend the features of Remix in collaboration with the community. In keeping with that aim, NVIDIA will accept pull requests on Github for code submissions from the community, provide feedback, and help advance code until it is mature enough to be merged into the official RTX Remix runtime.To further help the community with Remix, several Remix engineers have joined the community-led RTX Remix Showcase Discord server, are providing guidelines on compatibility, and responding to mod developers’ questions about RTX Remix. If you are looking to get started with your own Remix runtime open source project, head over to the Discord to find subject matter experts to collaborate with. We have also prepared some starter guides and documentation for mod developers as we continue to prepare the RTX Remix application.Modding is all about community, and providing an open source RTX Remix runtime will help empower mod developers to expand Remix compatibility to even more classic PC games. We look forward to seeing how creators usher in this new era of modding with RTX Remix.ProductsGraphics CardsLaptopsG-SYNC MonitorsGeForce NOW Cloud GamingCommunity & NewsLatest NewsCommunity Forums#SHOTWITHGEFORCECommunity PortalDeveloper ResourcesSupportDriversPurchase SupportTechnical SupportFollow GeForceFacebookTwitterInstagramYouTubeTwitchUnited StatesPrivacy Policy Manage My Privacy Legal Accessibility Corporate Policies Product Security ContactCopyright © 2023 NVIDIA CorporationNVIDIA uses cookies to enable and improve the use of the website. Please see our Cookie Policy for more information. By clicking \"Accept\" or continuing to browse the site, you consent to our use of cookies.Manage Cookies Accept Cookies",
    "summary": "Nvidia has released the RTX Remix runtime, an open source modding platform for remastering classic DirectX 8 and 9 games with path tracing, AI-enhanced textures, and user-created assets. The RTX Remix creator toolkit enables modders to assign new assets and lights within a remastered scene, and use AI tools to rebuild the look of any asset. The RTX Remix runtime, on the other hand, captures a game scene, replaces assets at playback, and injects RTX technology, such as path tracing, DLSS 3, and Reflex into the game.",
    "hn_title": "Nvidia RTX Remix Runtime Open Source Available Now",
    "original_title": "Nvidia RTX Remix Runtime Open Source Available Now",
    "score": 290,
    "hn_content": "Nvidia RTX Remix Runtime open-source is available - this program allows DirectX 8/9 games to be played with ray tracing in real-time. The program is based on the DXVK open-source program. Expert users can determine how the program works, and how the technology can be incorporated into older games; however, not all games will work. The innovation has been well received by the tech-savvy. While some older games can look janky, there is an increasing appreciation for early 3D aesthetics. Nvidia has a lot of open-source work, sharing 349 repositories on Github; however, proprietary closed-source desktop driver limitations affected Nvidia's user reputation.An online discussion on Hacker News compares the open-source contributions of Nvidia and its competitors, with opinions varying on the importance of open-source drivers. While some argue that open-source graphics drivers are crucial for Linux compatibility, others point out that the proprietary nature of HDMI and other interfaces forces everyone to use some closed-source code. Users also discuss the poor performance of Nvidia's RTX ray-tracing technology on non-Nvidia hardware, and speculate on any potential favoritism on Nvidia's part. One user suggests supporting cryptocurrency developers that implement GPU-only proof-of-work schemes.The polygon rounding issue in computer games is due to the cost of detail scaling and the dominance of triangles in graphics card hardware. Unreal 5's Nanite is a new, unique system that will fix this problem, but currently, only a few games are out, and no other big engines have a competing technology. The polygon count affects the game's quality and performance, and game developers must balance the two. While alternatives to NURBS exist, they are not popular. The article's prominent readers are experts in the field who seek new and exciting developments in computer games.Nvidia's AI-based upscaling tool, Remix, has been released and can revive old DirectX 7 and 8 PC games, and Nvidia might open-source the tech if publishers don't adopt it, according to users on Hacker News. \"Max Payne\" PC games remakes are also in development by Remedy. The only known example of Remix in action is a \"Portal\" mod, which has just been released. An Nvidia video showcasing Remix's capabilities was posted to YouTube, while PC users have reported seeking fixes for the visibly-impressive tech's frame pacing and stuttering. Compatibility issues could scuttle integration of the Nvidia-only tech into other devices.",
    "hn_summary": "Nvidia has released its open-source RTX Remix Runtime allowing users to play older games with ray tracing in real-time, though not all games will work. Hacker News users discuss the importance of open-source drivers versus proprietary drivers, Nvidia's reputation, and the poor performance of RTX on non-Nvidia hardware. Users also speculate on potential favoritism and suggest supporting cryptocurrency developers that implement GPU-only proof-of-work schemes. One user notes Remedy's development of Max Payne PC games remakes using Remix and discusses the tech's frame pacing and stuttering issues."
  }
]
