[
  {
    "id": 40877337,
    "title": "בטריות: עד כמה זול הן יכולות להיות?",
    "originLink": "https://aukehoekstra.substack.com/p/batteries-how-cheap-can-they-get",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40877337",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "ליתיום ברזל פוספט (LiFePO4) סוללות לשימוש ביתי מתומחרות כיום ב-89 דולר לקוט\"ש מספקים סיניים מכובדים, עם תוספת של 30 דולר לקוט\"ש אם נרכשות בארה\"ב.",
      "סוללות נתרן זמינות במחיר של 130 דולר לקוט\"ש אך הן פחות יעילות ב-26% בהשוואה לסוללות LiFePO4.",
      "״הפוסט מדגיש את המחיר הנגיש והיעילות של פאנלים סולאריים וסוללות, כאשר חלק מהמשתמשים מצליחים לעבור לשימוש באנרגיה סולארית ואחסון בסוללות בבתיהם, ובכך להפחית את התלות בחברות החשמל המסורתיות.״"
    ],
    "points": 276,
    "commentCount": 268,
    "retryCount": 0,
    "time": 1720120825
  },
  {
    "id": 40880932,
    "title": "אני ללא בנאי, ואני חייב לאתחל",
    "originLink": "https://consteval.ca/2024/07/03/initialization/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40880932",
    "commentBody": "",
    "originSummary": [
      "״ב-C++, אם לא מספקים בנאים, המהדר עשוי ליצור בנאים ברירת מחדל, מה שעלול להוביל לאובייקטים לא מאותחלים.״",
      "אתחול ברירת מחדל אינו עושה דבר עבור סוגים שאינם מחלקות ואינם מערכים, בעוד שאתחול ערך מאתחל לאפס סוגים שאינם מחלקות ולאחר מכן מאתחל ברירת מחדל.",
      "להסתמך על בנאים שנוצרו על ידי המהדר יכול לגרום להתנהגות בלתי מוגדרת; מומלץ לכתוב בנאים מותאמים אישית כדי להימנע מבעיות אלו."
    ],
    "commentSummary": [
      "C++ מורכבת בשל אופייה הרב-פרדיגמטי, התומך ביישומים שונים כמו מערכות משובצות, משחקי וידאו, שרתים וממשקי משתמש גרפיים.",
      "חלופות כמו C ו-Rust אינן מכסות את כל מקרי השימוש של C++, מה שהופך אותה לשפה ייחודית אך מאתגרת.",
      "בעוד שהמורכבות של C++ נחוצה לביצועים וגמישות, היא יכולה להיות מכבידה עבור צוותים פחות מנוסים."
    ],
    "points": 240,
    "commentCount": 122,
    "retryCount": 0,
    "time": 1720168947
  },
  {
    "id": 40877648,
    "title": "יפן מציגה רובוט אנושי עצום לתחזוקת קווי רכבת",
    "originLink": "https://www.theguardian.com/world/article/2024/jul/04/japan-train-robot-maintain-railway-lines",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40877648",
    "commentBody": "",
    "originSummary": [
      "מסילת הרכבת של מערב יפן חשפה רובוט בגובה 12 מטר המותקן על משאית לצורך משימות תחזוקת מסילות כמו גיזום ענפי עצים וצביעה.",
      "הרובוט, שניתן להפעילו מרחוק, כולל זרועות גדולות שיכולות לשאת עד 40 ק\"ג ולהגיע לגובה של עד 12 מטרים, במטרה להתמודד עם מחסור בעובדים ולהפחית תאונות.",
      "החברה מתכננת להרחיב את השימוש ברובוט למשימות תחזוקה שונות בעתיד."
    ],
    "commentSummary": [
      "יפן חשפה רובוט הומנואידי גדול לתחזוקת קווי רכבת, הנשלט מרחוק בדומה לרובוט כירורגי.",
      "״הרובוט, המסוגל להגיע לגובה של 12 מטרים על מנוף טלסקופי, מיועד למשימות כמו הסרת ענפי עצים וביצוע בדיקות.״",
      "חדשנות זו נועדה להתמודד עם כוח העבודה המזדקן של יפן ומחסור בכוח אדם, למרות ספקנות מסוימת לגבי יעילותה בהשוואה לשיטות המסורתיות."
    ],
    "points": 211,
    "commentCount": 89,
    "retryCount": 0,
    "time": 1720123378
  },
  {
    "id": 40883277,
    "title": "״הנח את לוגו ה-DVD בפינה (2023)״",
    "originLink": "https://eieio.games/game-diary/game-6-get-the-dvd-logo-into-the-corner/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40883277",
    "commentBody": "",
    "originSummary": [
      "משחק 6: שים את לוגו ה-DVD בפינה\" הוא משחק פעולה בסגנון ארקייד שנוצר על ידי מרגרט ליונס, ופיתוחו ארך רק 4 ימים באמצעות פלטפורמת PICO-8.",
      "״המשחק נוצר במרכז Recurse וזמין ב-itch.io, כאשר הקוד שלו נגיש ב-GitHub. זהו משחק קצר (45 שניות) המבוסס על בדיחה.״",
      "פיקו-8 היא \"קונסולת פנטזיה\" שמחקה קונסולות משנות ה-80, עם מגבלות על גרפיקה, סאונד וגודל קוד, מה שהופך אותה לאידיאלית לפרויקטים של משחקים קטנים ופשוטים."
    ],
    "commentSummary": [
      "הפוסט דן במרכז Recurse, תוכנית שהות חינמית למתכנתים המעודדת יצירתיות וצמיחה אישית, כאשר המחבר משתף את חווייתו ביצירת 8 משחקים ב-12 שבועות.",
      "״יש עניין ניכר בקונסולות פנטזיה כמו Pico-8, שמוערכות בזכות המגבלות שלהן שמעודדות חדשנות ופרויקטי קידוד מהירים ומהנים.״",
      "״השיחה כוללת התייחסויות שונות למשחקי רטרו וסביבות תכנות, ומדגישה את הערכת הקהילה לקידוד יצירתי בתוך מגבלות.״"
    ],
    "points": 192,
    "commentCount": 35,
    "retryCount": 0,
    "time": 1720190894
  },
  {
    "id": 40882243,
    "title": "תאריך יציאת עידן החלל",
    "originLink": "https://factorio.com/blog/post/fff-418",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40882243",
    "commentBody": "",
    "originSummary": [
      "\"Factorio: Space Age\" צפוי לצאת ב-21 באוקטובר 2024, במחיר של $35.00, כמו המשחק הבסיסי.",
      "פיצ'רים חדשים כוללים פלטפורמות חלל, רשתות רכבת רב-מפלסיות וכוכבי לכת עם משאבים ואתגרים ייחודיים, כגון וולקנוס, פולגורה וגלבה.",
      "\"פקטוריו 2.0\" יהיה שדרוג חינמי, שיציע שיפורים במשחק כמו רובוטים חכמים יותר, מסילות חדשות ושיפור ביצירת השטח."
    ],
    "commentSummary": [
      "״תאריך השחרור להרחבת עידן החלל של Factorio הוכרז, מה שמעורר התרגשות ודיונים על האופי הממכר מאוד של המשחק.״",
      "״משתמשים שיתפו חוויות אישיות, הזהירו מפני הפוטנציאל של המשחק לצרוך זמן רב ולהשפיע על חיי היומיום, ובמקביל המליצו על משחקים ומודים דומים.״",
      "קהילת המשתמשים דנה באסטרטגיית התמחור של Factorio, והביעה הערכה לערך העקבי הנובע מהיעדר מבצעים, והביעה גם התלהבות וגם זהירות לגבי המשחקיות הממכרת."
    ],
    "points": 183,
    "commentCount": 64,
    "retryCount": 0,
    "time": 1720183629
  },
  {
    "id": 40881836,
    "title": "״יצרתי כלי מחקר SEO זול יותר״",
    "originLink": "https://withtelescope.com",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40881836",
    "commentBody": "",
    "originSummary": [
      "המחבר בנה כלי מחקר מילות מפתח מותאם אישית בשם טלסקופ, והשקיע $51 במשך 2 חודשים, בהשוואה ל-$1297 על מנוי ל-Ahrefs במשך 13 חודשים.",
      "תלסקופ מציע תכונות כמו חוקר מילות מפתח, רעיונות למילות מפתח, מילות מפתח מדורגות ומילות מפתח שמורות, עם אפשרויות תשלום הכוללות מנוי מבוסס שימוש או טעינת יתרה.",
      "חשבונות חדשים מקבלים יתרה חינמית להתחלה, והמחבר מבקש משוב על הכלי."
    ],
    "commentSummary": [
      "כלי מחקר SEO חדש וחסכוני בשם טלסקופ הושק, ומציע חיסכון משמעותי בהשוואה למתחרים כמו Ahrefs ו-SEMrush.",
      "״תכונות הטלסקופ כוללות חוקר מילות מפתח, רעיונות למילות מפתח, מילות מפתח מדורגות ומילות מפתח שמורות, עם אפשרויות תשלום גמישות ויתרת התחלה חינמית לחשבונות חדשים.״",
      "דיונים של משתמשים מדגישים את העלויות הגבוהות של הכלים הקיימים, את הפוטנציאל של Telescope כחלופה ל-SEMrush, ושאלות לגבי ספקי backend, זמינות API, ונתוני שוק ספציפיים."
    ],
    "points": 168,
    "commentCount": 81,
    "retryCount": 0,
    "time": 1720178830
  },
  {
    "id": 40877992,
    "title": "נקסדוק הופך את הסמארטפון שלך למחשב נייד",
    "originLink": "https://nexdock.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40877992",
    "commentBody": "",
    "originSummary": [
      "נקסדוק מאפשרת למשתמשים להמיר את הסמארטפונים שלהם למחשבים ניידים, באמצעות חיבורים חוטיים או אלחוטיים.",
      "נקספד מאפשר לסמארטפונים לתפקד כטאבלטים, ומספק מקרה שימוש רב-תכליתי למכשירים ניידים.",
      "נקסדוק XL, מוצר חדש שעומד לצאת, מבטיח להרחיב את מגוון מכשירי NEX ולהגביר את הפרודוקטיביות הניידת."
    ],
    "commentSummary": [
      "נקסדוק שואפת להפוך סמארטפונים למחשבים ניידים, אך משתמשים מדווחים על חוסר שביעות רצון בשל חוויות שולחן עבודה/מחשב נייד ירודות על סמארטפונים.",
      "״למרות המשיכה של הרעיון לשדרג רק את הטלפון ולא את צורת המחשב הנייד, בעיות בביצוע, במיוחד בצד הטלפון, מעכבות את הצלחתו.״",
      "חלופות כמו מחשבים ניידים ישנים מ-eBay או מכשירים כמו ה-Steam Deck מציעים ביצועים וחוויית משתמש טובים יותר בעלויות דומות או נמוכות יותר."
    ],
    "points": 166,
    "commentCount": 201,
    "retryCount": 0,
    "time": 1720126672
  },
  {
    "id": 40882077,
    "title": "עבדתי ב-AMD באמצע-סוף שנות ה-2000 ועזרתי בתכנון מעבדי CPU/APU/GPU",
    "originLink": "https://twitter.com/mohapatrahemant/status/1809135345683841050",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40882077",
    "commentBody": "",
    "originSummary": [
      "נבידיה עברה את שווי השוק של גם AMD וגם אינטל, ציון דרך משמעותי בתעשיית הטכנולוגיה.",
      "״המנט מוהפטרה, עובד לשעבר ב-AMD, מהרהר בטבע הבלתי צפוי של ההישג הזה, בהתחשב במעמדה ההיסטורי של AMD ביחס לאינטל.״"
    ],
    "commentSummary": [
      "כותב המאמר, מהנדס לשעבר ב-AMD, מדגיש את התרבות ההנדסית החזקה של AMD אך מציין ליקויים בתמיכה בתוכנה ובקשרים עם ספקים.",
      "את הצלחתה של Nvidia ניתן לייחס לשיטות עסקיות אגרסיביות, ולעיתים שנויות במחלוקת, ולמערכת אקולוגית תוכנתית חזקה, במיוחד עם CUDA.",
      "ד\"ר ליסה סו הובילה את AMD בצורה מכרעת, ויש ויכוח מתמשך האם הדומיננטיות של Nvidia בת קיימא או אם מתחרים כמו AMD ואינטל יכולים לצמצם את הפער."
    ],
    "points": 158,
    "commentCount": 106,
    "retryCount": 0,
    "time": 1720182189
  },
  {
    "id": 40878765,
    "title": "יש תוכנה שיצרת לשימושך האישי בלבד אבל אף אחד אחר לא משתמש בה?",
    "originLink": "https://news.ycombinator.com/item?id=40878765",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40878765",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "משתמשים יצרו כלים תוכנה שונים לשימוש אישי, החל מעזרים לפרודוקטיביות ועד למערכות אוטומציה מורכבות.",
      "״דוגמאות כוללות זחלן לוח משרות, מנהל גן הידרופוני, אפליקציה לרישום הערות אישיות, ומחולל רשימות השמעה של Spotify.״",
      "פרויקטים אלה מכוונים לעיתים קרובות לפתור בעיות ספציפיות או לשפר משימות יומיומיות, כאשר חלק מהמשתמשים מתכננים לשתף את הכלים שלהם בסופו של דבר."
    ],
    "points": 155,
    "commentCount": 312,
    "retryCount": 0,
    "time": 1720134610
  },
  {
    "id": 40878222,
    "title": "מעבד הגרפי Adreno של Snapdragon X Elite",
    "originLink": "https://chipsandcheese.com/2024/07/04/the-snapdragon-x-elites-adreno-igpu/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40878222",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "״מעבד הגרפיקה המשולב Adreno של Snapdragon X Elite בתחילה עלה בביצועיו על מעבדי גרפיקה בינוניים של Apple, AMD ו-NVIDIA במבחני ביצועים, אך כעת מתקשה להתמודד עם עומסי גרפיקה מודרניים, כולל משחקי מחשב שולחניים.״",
      "קוולקום ניצבת בפני החלטה אסטרטגית בין שמירה על הדומיננטיות שלה בגרפיקה ניידת לבין חתירה לביצועי גיימינג גבוהים יותר, עם בעיות מתמשכות בדרייברים של Adreno שצוות Dolphin ציין.",
      "מעבדי ARM SOC (מערכת על שבב) של אפל ו-NVIDIA נשארים חזקים, בעוד ש-GPU משולבים (iGPUs) של אינטל ו-AMD עולים בביצועים על מקביליהם של ARM, מה שמצביע על הצורך של קוואלקום לאזן בין ביצועי GPU ניידים ושולחניים מבלי להתחרות ישירות עם GPU נפרדים (dGPUs)."
    ],
    "points": 150,
    "commentCount": 58,
    "retryCount": 0,
    "time": 1720128782
  },
  {
    "id": 40879541,
    "title": "״מעבר ל-RTOS על ה-RP2040״",
    "originLink": "https://blog.brixit.nl/moving-to-a-rtos-on-the-rp2040/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40879541",
    "commentBody": "",
    "originSummary": [
      "עם התפתחות הפרויקטים והפיכתם למורכבים יותר, ה-Raspberry Pi Pico לעיתים קרובות עולה על היכולות של Arduino IDE, מה שמחייב שימוש בכלים מתקדמים יותר כמו RTOS (מערכת הפעלה בזמן אמת).",
      "״מרטיין בראם מפתח בקר חומרה למצלמות PTZ וממתגים וידאו, הדורש מערכת הפעלה בזמן אמת (RTOS) בשל מורכבות התוכנה; הוא העריך את FreeRTOS, Apache NuttX, ו-Zephyr.״",
      "״למרות האתגרים הראשוניים עם FreeRTOS, כמו printf שגורם לתקיעות והיעדר הפשטת חומרה, הוא נשאר האופציה הכי מעשית בשל האינטגרציה שלו עם ה-pico-sdk.״"
    ],
    "commentSummary": [
      "הפוסט דן במעבר למערכת הפעלה בזמן אמת (RTOS) על המיקרו-בקר RP2040, ומדגיש אפשרויות RTOS שונות והתאמתן.",
      "״אפשרויות RTOS מרכזיות שהוזכרו כוללות את FreeRTOS, Zephyr ו-NuttX, כל אחת עם החוזקות והחולשות שלה מבחינת תמיכה, ידידותיות למשתמש ותאימות לחומרה.״",
      "״הדיון נוגע גם בסביבות פיתוח חלופיות כמו Rust ו-MicroPython, ומדגיש את היתרונות שלהן לפיתוח משובץ על ה-RP2040.״"
    ],
    "points": 149,
    "commentCount": 85,
    "retryCount": 0,
    "time": 1720148365
  },
  {
    "id": 40878895,
    "title": "תיקון רקמת עצם באמצעות אלמוגים וספוגי ים",
    "originLink": "https://web.stanford.edu/group/mota/education/Physics%2087N%20Final%20Projects/Group%20Gamma/bone.htm",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40878895",
    "commentBody": "",
    "originSummary": [
      "מדענים פיתחו שיטה חדשה לתיקון רקמת עצם באמצעות אלמוגים וספוגי ים כשלד, תוך ניצול הנקבוביות והרכב סידן פחמתי שלהם.",
      "״שיטה זו כוללת הכנת שלדים שיתאימו לאזור הפגוע ושימוש בתאי מח עצם (MSC) או תאי גזע לקידום התחדשות העצם.״",
      "״בניגוד לחומרים מסורתיים כמו קרמיקה או סגסוגות, אלמוגים וספוגי ים נמנעים מהגנה מפני לחץ, ומספקים מסגרת שתומכת בריפוי נכון של העצם ובשילובה.״"
    ],
    "commentSummary": [
      "חוקרים בוחנים את השימוש באלמוגים ובספוגי ים לתיקון רקמת עצם, ומדגישים גישה חדשנית במדע הרפואה.",
      "דיון זה כולל אנקדוטות אישיות על תיקוני עצמות מוצלחים באמצעות שברי אלמוגים, מה שמרמז כי חומרים אלו הם חלופות יעילות וחסכוניות לשיטות המסורתיות.",
      "השיחה נוגעת גם בחשיבות צפיפות העצם ובשיטות שונות לשיפור שלה, כמו אימוני התנגדות וטיפול ברטט, ומספקת הקשר רחב יותר לשמירה על בריאות העצם."
    ],
    "points": 130,
    "commentCount": 49,
    "retryCount": 0,
    "time": 1720136541
  },
  {
    "id": 40880322,
    "title": "וִיוַאלְדִי לא ילך בעקבות הטרנד הנוכחי של הבינה המלאכותית?",
    "originLink": "https://vivaldi.com/blog/technology/vivaldi-wont-allow-a-machine-to-lie-to-you/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40880322",
    "commentBody": "",
    "originSummary": [
      "ויוואלדי החליטו שלא לשלב מודלים של שפה גדולה (LLMs) כמו ChatGPT בדפדפן האינטרנט שלהם, בשל חששות מפני פלגיאט, הפרות פרטיות ויצירת מידע לא מדויק.",
      "מודלים לשוניים גדולים מנתחים כמויות עצומות של נתונים, מה שעלול להוביל לשחזור בלתי מכוון של חומר המוגן בזכויות יוצרים ולחשיפת מידע פרטי.",
      "ויוואלדי שואפת לספק חוויית גלישה עשירה בתכונות ואתית, תוך שמירה על פתיחות להתקדמות עתידית בלמידת מכונה שמעדיפה פרטיות ושימושיות."
    ],
    "commentSummary": [
      "ההחלטה של ויוואלדי להימנע משילוב בינה מלאכותית, במיוחד מודלים גדולים של שפה (LLMs), עוררה דיון משמעותי בקרב המשתמשים.",
      "תומכי עמדתו של ויוואלדי מדגישים חששות לגבי אמינותם של מודלים לשוניים גדולים (LLMs) וצריכת האנרגיה הגבוהה שלהם, בעוד שמבקרים טוענים כי מודלים לשוניים גדולים מספקים תכונות חשובות שיכולות להועיל למשתמשים.",
      "״המאמר המסביר את החלטתו של ויוואלדי ספג ביקורת על כך שהוא נראה מוטה ומזלזל ביתרונות הפוטנציאליים של מודלים לשוניים גדולים (LLMs), כאשר רבים תומכים בכך שהאינטגרציה של בינה מלאכותית תהיה תכונה אופציונלית בדפדפנים.״"
    ],
    "points": 124,
    "commentCount": 154,
    "retryCount": 0,
    "time": 1720161984
  },
  {
    "id": 40879899,
    "title": "מיומנויות טכניות",
    "originLink": "https://sashalaundy.com/writing/technical-skills/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40879899",
    "commentBody": "",
    "originSummary": [
      "״התיוג המסורתי של אנשים כ\"טכניים\" או \"לא טכניים\" בעמק הסיליקון מפחית מערכן של המיומנויות הטכניות המגוונות בתחומים שונים.״",
      "״דוגמאות כמו הסרט \"סולו חופשי\" וקריירת הכדורסל של סטף קרי מדגישות פרטים טכניים מורכבים שלעיתים קרובות מתעלמים מהם, בדומה לכישורים בשיווק, מכירות וניהול.״",
      "״הכרה ותיאור מדויק של מיומנויות אלו יכולים להעשיר את הבנתנו לגבי מקצועות שונים ולמנוע את המשך הדינמיקות של כוח שממעיטות בערך של עבודה חשובה.״"
    ],
    "commentSummary": [
      "״בחברות תוכנה, כאשר מתכנתים שואלים אם הבוס הוא \"טכני\", הם מתכוונים לשאול אם הבוס יודע לתכנת.״",
      "ההבחנה בין תפקידים טכניים ולא טכניים נפוצה בתחומים שונים, ומדגישה ידע מעשי בהקשרים ספציפיים.",
      "להבין עבודה טכנית זה קריטי למנהלים כדי לטעון ביעילות ולקבל החלטות בנוגע לעבודה של הצוות שלהם."
    ],
    "points": 102,
    "commentCount": 104,
    "retryCount": 0,
    "time": 1720154883
  },
  {
    "id": 40882133,
    "title": "לתכנת ביוניסון",
    "originLink": "https://lwn.net/Articles/978955/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40882133",
    "commentBody": "",
    "originSummary": [
      "יוניסון היא שפת תכנות ברישיון MIT שמאחסנת קוד במסד נתונים במקום בקבצי טקסט, מה שמפשט תכנות מבוזר.",
      "זה משתמש במערכת שמות ייחודית המבוססת על האשים, המאפשרת שינוי שם וגרסאות בצורה חלקה, ומכילה מערכת יכולות למעקב אחר תלות ואינטראקציות בקוד.",
      "״מתוכנן למחשוב ענן, יוניסון מציע שירותים מנוהלים דרך יוניסון קלאוד, אך מתמודד עם אתגרים כמו היעדר ממשק פונקציות זר יציב (FFI) והצורך בכלי עבודה מותאמים אישית.״"
    ],
    "commentSummary": [
      "״שפת התכנות Unison ידועה בעיצוב הארגונומי שלה ובגישה של קוד בתוך מסד נתונים, מה שמפשט את הקידוד על ידי ביטול זמני קומפילציה ארוכים והצורך ב-Git.״",
      "״למרות היותה שפה צעירה, יוניסון מציעה כלים חזקים, כולל אינטגרציה עם פרוטוקול שרת שפה (LSP) ותיעוד ברמה ראשונה, מה שמשפר את חוויית המפתח.״",
      "השיטה של יוניסון לטיפול בקוד בלתי ניתן לשינוי המאוחסן במסד נתונים מתמודדת עם בעיות נפוצות בשפות מבוססות REPL מסורתיות, אם כי ישנם משתמשים שחוששים ששפות מודרניות כוללות יותר מדי כלים מובנים."
    ],
    "points": 95,
    "commentCount": 13,
    "retryCount": 0,
    "time": 1720182687
  }
]
