[
  {
    "id": 41786101,
    "title": "Kimya Nobel: Hesaplamalı protein tasarımı ve protein yapısı tahmini",
    "originLink": "https://www.nobelprize.org/prizes/chemistry/2024/press-release/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41786101",
    "commentBody": "",
    "originSummary": [
      "2024 Nobel Kimya Ödülü, hesaplamalı protein tasarımı konusundaki çalışmaları nedeniyle David Baker'a ve protein yapısı tahmini için bir yapay zeka modeli olan AlphaFold2'nin geliştirilmesi nedeniyle Demis Hassabis ve John M. Jumper'a verildi. Bu ilerlemeler, antibiyotik direncinin anlaşılmasına yardımcı olmak ve plastiği parçalayacak enzimler geliştirmek gibi önemli bilimsel etkiler taşımaktadır. Ödül, Baker'ın yarısını alması ve Hassabis ile Jumper'ın kalan yarıyı paylaşması şeklinde bölünmüştür."
    ],
    "commentSummary": [
      "Kimya Nobel Ödülü, hesaplamalı protein tasarımı ve protein yapısı tahminindeki ilerlemeler için verildi ve AlphaFold'un etkisini vurguladı. AlphaFold'un hızlı protein yapısı tahmini, CRISPR gibi geçmişteki atılımlarla karşılaştırılıyor, ancak protein katlanmasını tamamen çözmemek gibi sınırlamaları var. Ödül ayrıca Rosetta ile David Baker'ın katkılarını da tanıyor ve bilimsel tanımanın evrimsel doğasını ve yapay zekanın araştırmadaki rolünü vurguluyor."
    ],
    "points": 424,
    "commentCount": 231,
    "retryCount": 0,
    "time": 1728467678
  },
  {
    "id": 41785265,
    "title": "Cognizant, Hintli olmayan çalışanlara karşı ayrımcılık yapmaktan suçlu bulundu.",
    "originLink": "https://www.siliconvalley.com/2024/10/07/h-1b-visa-company-supplying-thousands-of-tech-workers-to-silicon-valley-discriminated-against-non-indians-jury-finds/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41785265",
    "commentBody": "",
    "originSummary": [
      "Bir jüri, Cognizant'ın Hintli çalışanları H-1B vizeleriyle tercih ederek Hintli olmayan çalışanlara karşı ayrımcılık yaptığını, bu durumun haksız muamele ve işten çıkarma iddialarına yol açtığını belirledi.",
      "Cognizant, jürinin cezai tazminat önerisine rağmen, çeşitliliğe ve ayrımcılığa karşı taahhüdünü sürdürdüğünü belirterek karara itiraz etmeyi planlıyor.",
      "Bu dava, H-1B vize süreciyle ilgili endişeleri vurguluyor, bunlar arasında var olmayan işler için vize alınması iddiaları ve potansiyel olarak ABD'li çalışanların dezavantajlı duruma düşürülmesi yer alıyor."
    ],
    "commentSummary": [
      "Cognizant, Hintli olmayan çalışanlara karşı ayrımcılık yaptığı için suçlu bulundu ve bu durum kültürel önyargılar ve işyeri dinamikleri hakkında endişeleri artırdı.",
      "Kültürel farklılıkların, örneğin kolektivizm ve bireycilik, yönetsel kararları nasıl etkileyebileceği ve önyargıya yol açabileceği tartışılmaktadır.",
      "Bu durum, dış kaynak kullanımının etkisi, kapsayıcılık ihtiyacı ve küresel iş gücünde çeşitli kültürel ortamların entegrasyonunun zorlukları hakkında daha geniş bir tartışma başlattı."
    ],
    "points": 346,
    "commentCount": 319,
    "retryCount": 0,
    "time": 1728457556
  },
  {
    "id": 41782534,
    "title": "Zamanın Doğası Üzerine",
    "originLink": "https://writings.stephenwolfram.com/2024/10/on-the-nature-of-time/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41782534",
    "commentBody": "",
    "originSummary": [
      "Metin, zamanın hesaplamalı bakış açısını araştırıyor ve zamanın evrenin devam eden hesaplaması olduğunu öne sürüyor. Hesaplamalı indirgenemezlik nedeniyle, geleceği tahmin edemeyeceğimizi veya zamanda 'ileriye atlayamayacağımızı' belirtiyor.",
      "Zamanı doğrusal olarak algılamamızın, hesaplama sınırlarımızdan kaynaklandığını, oysa temelde zamanın çok iş parçacıklı olabileceğini ve deneyimimizin, tüm hesaplamaların iç içe geçmiş sınırını temsil eden bir kavram olan ruliadın sınırlı keşfimiz tarafından şekillendirildiğini tartışıyor.",
      "Sonuç, zaman yolculuğu gibi geleneksel kavramlara meydan okuyarak, zamanın hesaplamalı bakış açısını, entropi veya düzensizliğin zamanla artma eğiliminde olduğunu belirten termodinamiğin İkinci Yasası ile uyumlu hale getiriyor."
    ],
    "commentSummary": [
      "Stephen Wolfram ve Julian Barbour, zamanın ortaya çıkan bir özellik olduğunu öne sürerek, temelde zamansız olan ve tüm olası durumları içeren bir evren öneriyorlar.",
      "Barbour'un bakış açısı, zamanın statik geometrik ilişkilerden ortaya çıktığı yönündeyken, Wolfram bunu zamansız bir hesaplama çerçevesi içindeki hesaplama sınırlamalarımıza atfetmektedir.",
      "Her iki teorisyen de gerçeklik için zamansız bir temel üzerinde hemfikir olsalar da, Wolfram'ın fikirleri genellikle spekülatif ve felsefi olarak görülür, ampirik destekten yoksundur ve ebediyetçilik ve blok evren teorileri gibi kavramlarla ilişkilidir."
    ],
    "points": 334,
    "commentCount": 232,
    "retryCount": 0,
    "time": 1728427321
  },
  {
    "id": 41781457,
    "title": "HTMX'in mütevazı bir eleştirisi",
    "originLink": "https://chrisdone.com/posts/htmx-critique/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41781457",
    "commentBody": "",
    "originSummary": [
      "Htmx'in eleştirisi, sorunlu mülk mirası da dahil olmak üzere birkaç sorunu tanımlar; bu, örtük ve tutarsız olup kafa karışıklığına yol açar ve açık beyanları gerektirir.- Htmx, DOM öğesi değiştirme, durum depolama ve kuyruklama modu ile ilgili zorluklarla karşılaşır, bu da tarayıcıya özgü durumun kaybına, hatalı durum depolamaya ve sezgisel olmayan istek işlemeye neden olabilir.- React ile entegrasyon sorunlarına rağmen, Htmx sunucu tarafı dilleriyle kullanıldığında faydalar sunar, potansiyel olarak TypeScript, serileştirme ve GraphQL ihtiyacını ortadan kaldırır ve bu endişeleri gidermek için Htmx'in React'te yeniden uygulanmasını önerir."
    ],
    "commentSummary": [
      "Eleştiriler, Htmx'in daha büyük projelerde sorun yaratabilecek istemci tarafı durum çatışmaları ve olay karmaşıklığı gibi zorluklara odaklanıyor.",
      "Bu tartışma, frontend karmaşıklığı ve farklı araçların uygunluğu hakkındaki devam eden tartışmayı vurgulayarak React ile karşılaştırmaları içeriyor.",
      "Eleştirilere rağmen, Htmx belirli görevlerdeki sadeliği ve etkinliği nedeniyle değerli bulunmakta olup, her proje için uygun aracın seçilmesinin önemini vurgulamaktadır."
    ],
    "points": 287,
    "commentCount": 137,
    "retryCount": 0,
    "time": 1728418797
  },
  {
    "id": 41784591,
    "title": "Eklemeler Enerji Verimli Dil Modelleri İçin Yeterlidir",
    "originLink": "https://arxiv.org/abs/2410.00907",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41784591",
    "commentBody": "",
    "originSummary": [
      "“Addition is All You Need for Energy-efficient Language Models” başlıklı makale, hesaplama ve enerji maliyetlerini azaltarak kayan nokta çarpımını yaklaşık olarak hesaplamak için tam sayı toplamasını kullanan L-Mul algoritmasını sunmaktadır.- L-Mul, 8-bit kayan nokta çarpımından daha yüksek bir hassasiyet elde eder ve eleman bazlı tensör çarpımları için enerji maliyetlerini %95'e kadar ve nokta çarpımları için %80'e kadar azaltabilir.- Çeşitli görevlerde yapılan testler, L-Mul'un geleneksel yöntemlerle karşılaştırılabilir bir hassasiyeti koruduğunu gösterdi ve bu da onu dönüştürücü modellerde uygulanabilir bir alternatif haline getirdi."
    ],
    "commentSummary": [
      "Bu tartışma, özellikle kayan nokta birimlerinden yoksun sistemlerde, kayan nokta hesaplamalarından daha verimli olan sabit nokta aritmetiği ve tamsayı işlemlerini kullanarak dil modellerinde enerji verimliliğini artırmaya odaklanmaktadır.",
      "IEEE 754 kayan nokta standartlarıyla karşılaştırıldığında pratiklik ve doğrulukla ilgili endişeler devam etse de, enerji maliyetlerini daha da azaltmak için sinir ağları için toplama tabanlı mimarilere ilgi vardır.",
      "Bu tartışma, çeşitli bilişim ortamlarında hassasiyet ve performans arasındaki dengeyi içeriyor ve Nvidia gibi büyük şirketlerin AI araştırma yönlerini nasıl etkileyebileceği, potansiyel olarak verimli hesaplama yöntemlerinin keşfini sınırlayabileceği üzerine spekülasyonlar yapılıyor."
    ],
    "points": 256,
    "commentCount": 81,
    "retryCount": 0,
    "time": 1728449260
  },
  {
    "id": 41781777,
    "title": "Güvenilir Yazılım Tasarımı Uygulamaları",
    "originLink": "https://entropicthoughts.com/practices-of-reliable-software-design",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41781777",
    "commentBody": "",
    "originSummary": [
      "‘Güvenilir Yazılım Tasarımı Uygulamaları’ adlı eserinde kqr, güvenilir yazılım geliştirmek için sekiz temel uygulamayı sunar ve hızlı, bellek içi bir önbellek oluşturma üzerine odaklanır.- Anahtar uygulamalar arasında Redis gibi hazır çözümler kullanmak, özelliklerden ziyade maliyet ve güvenilirliğe öncelik vermek ve gerekli olanı öğrenmek için minimal özellikleri hızlı bir şekilde dağıtmak yer alır.- Ek uygulamalar arasında basit veri yapıları kullanmak, kaynakları erken ayırmak, performans sorunlarını önlemek için maksimumlar belirlemek, test etmeyi kolaylaştırmak ve sistem davranışını izlemek için performans sayaçları yerleştirmek bulunur."
    ],
    "commentSummary": [
      "Yedeklilik veya başarıya giden birden fazla bağımsız yolun olması, Google Arama ve RAID 5 gibi sistemler tarafından gösterildiği gibi, güvenilir yazılım sistemleri oluşturmak için çok önemlidir. Yedeklilik güvenilirliği artırırken, özellikle modern sistemlerde, arızaların genellikle bireysel bileşen arızalarından ziyade bileşenler arasındaki etkileşimlerden kaynaklandığı durumlarda karmaşıklık ve verimsizlik de getirebilir. Verimlilik ve güvenilirlik arasında denge kurmak esastır; gerçek dünya örnekleri, aşırı optimizasyonun sistem kırılganlığına yol açabileceğini göstermektedir; bu nedenle, iyi anlaşılan, basit alt sistemler kullanmak ve düzenli bakım yapmak, güvenilirliğe ulaşmanın anahtarıdır."
    ],
    "points": 192,
    "commentCount": 42,
    "retryCount": 0,
    "time": 1728421282
  },
  {
    "id": 41781855,
    "title": "Dict'lerin kodunuzu bozmasına izin vermeyin",
    "originLink": "https://roman.pt/posts/dont-let-dicts-spoil-your-code/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41781855",
    "commentBody": "",
    "originSummary": [
      "Diziler (dicts) Python'da değiştirilebilir ve opaktır, bu da kod bakımını ve genişletmeyi zorlaştırabilir.- Kod yönetimini iyileştirmek için dict'lerin dataclasses veya Pydantic gibi araçlar kullanılarak yapılandırılmış veri modellerine dönüştürülmesi önerilir.- Eski kodlar için, TypedDicts yapıya eklenebilir ve teknik borcu önlemek için anahtar-değer depoları için Mapping açıklamaları önerilir."
    ],
    "commentSummary": [
      "Yazı, geliştirme sürecinin başlarında veri tanımlarını netleştirmek ve isteğe bağlı alanlardan kaçınmak için dataclass gibi değer nesnelerinin kullanılmasını vurguluyor. Dinamik veriler için sözlüklerin yararlı olduğunu, ancak aşırı kullanımlarının karmaşık koda yol açabileceğini ve bilinen veriler için yapılandırılmış türlerin kullanılmasının kodun netliğini artırıp hataları azaltacağını öneriyor. Python, daha iyi veri işleme sağlamak için dataclass, TypedDict ve Pydantic gibi araçlar sunarak temiz ve verimli kodu teşvik ediyor."
    ],
    "points": 174,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1728421814
  },
  {
    "id": 41784287,
    "title": "ABD, dönüm noktası niteliğindeki antitröst davasında Google'ın bölünmesini değerlendiriyor",
    "originLink": "https://www.ft.com/content/f6e84608-e0e5-48c5-a0eb-dde7675fb608",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41784287",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "ABD, Google'ın arama ve reklamcılık sektörlerindeki hakimiyetini hedef alarak, potansiyel olarak Google'ı parçalamak için önemli bir antitröst davası açmayı düşünüyor.",
      "Bu dava, rekabetin ve yeniliğin engellenmesi konusundaki endişeleri yansıtarak, büyük teknoloji şirketlerine karşı gelecekteki düzenleyici eylemler için bir emsal oluşturabilir.",
      "Bu tartışma, Android ve YouTube gibi hizmetler sunan Google gibi büyük ölçekli teknoloji şirketlerinin sağladığı faydaları koruma ile piyasa rekabetini teşvik etme arasındaki gerilimi vurguluyor."
    ],
    "points": 164,
    "commentCount": 220,
    "retryCount": 0,
    "time": 1728445190
  },
  {
    "id": 41785511,
    "title": "Go öğrenmek için bir SSH tünel yöneticisi yaptım",
    "originLink": "https://github.com/alebeck/boring",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41785511",
    "commentBody": "",
    "originSummary": [
      "Boring Tunnel Manager, hem yerel hem de uzak bağlantıları destekleyen SSH (Güvenli Kabuk) tünellerini yönetmek için hafif bir komut satırı aracıdır.",
      "Kullanıcılar, ana bilgisayar, kullanıcı ve port gibi ayrıntıları belirtme seçenekleriyle bir TOML (Tom's Obvious, Minimal Language) dosyası kullanarak tünelleri yapılandırır.",
      "Bu araç, macOS ve Linux ile uyumludur ve güvenli kimlik doğrulama için otomatik yeniden bağlanma ve ssh-agent ile entegrasyon gibi özellikler sunar."
    ],
    "commentSummary": [
      "Go programlama dili kullanılarak yeni bir SSH tünel yöneticisi geliştirildi ve GitHub'da mevcut, Go'nun kütüphaneleri ile SSH sunucularını uygulamalara gömmenin ne kadar kolay olduğunu gösteriyor.",
      "Go'nun SSH kütüphanelerinin kullanıcı dostu yapısına rağmen, çözülmemiş sorunlar üçüncü taraf çözümlerin kullanılmasına yol açmıştır ve bu proje bu sorunları ele almayı amaçlamaktadır.",
      "Gelecekteki geliştirmeler, Windows desteği ve SSH çoğullama içerebilir; proje şimdiden olumlu geri bildirimler almakta ve daha fazla iyileştirme için önerilere açık durumda."
    ],
    "points": 154,
    "commentCount": 54,
    "retryCount": 0,
    "time": 1728460344
  },
  {
    "id": 41787647,
    "title": "Almanlar, İngilizcenin etkisini 'aptalın kesme işareti' onay alırken kınıyor",
    "originLink": "https://www.theguardian.com/world/2024/oct/07/germany-influence-of-english-idiots-apostrophe",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41787647",
    "commentBody": "",
    "originSummary": [
      "Almanya, mülkiyet için apostrof kullanımına ilişkin kurallarını gevşeterek, Almanca'da geleneksel olarak doğru olmayan \"Rosi's Bar\" gibi biçimlere izin verdi. Alman Ortografi Konseyi, özel isimlerdeki genitif 's'yi ayırmak için apostrof kullanımına artık izin veriyor ve bu durum, İngilizcenin Almanca üzerindeki etkisi konusunda tartışmalara yol açtı. Bu değişiklik, Almanca üzerindeki uluslararası etkiler hakkında tartışmalara yol açtı ve bazıları İngilizce terimlere karşı Almanca alternatifler savunuyor."
    ],
    "commentSummary": [
      "Almanlar, dillerindeki İngilizce etkisini tartışıyor ve özellikle iş isimleri gibi belirli bağlamlarda, ancak kişisel eşyalar için değil, 'aptalın kesme işareti'nin onaylanmasına odaklanıyorlar.",
      "Bu tartışma, dilin evrimi ile korunması arasındaki gerilimi vurguluyor ve dilin organik olarak uyum sağlaması mı yoksa kültürel kimliği koruması mı gerektiği konusunda farklı görüşler ortaya koyuyor.",
      "Bu tartışma aynı zamanda İngilizcenin daha geniş küresel etkisini ve dil standartlarını koruma zorluklarını da yansıtmaktadır."
    ],
    "points": 139,
    "commentCount": 329,
    "retryCount": 0,
    "time": 1728479815
  },
  {
    "id": 41784069,
    "title": "LibreDrive Nedir (2019)",
    "originLink": "https://forum.makemkv.com/forum/viewtopic.php?t=18856",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41784069",
    "commentBody": "",
    "originSummary": [
      "LibreDrive, optik disk sürücüleri için bir mod olup, UHD disklerin okunmasını ve AACS ana bilgisayar iptalinin atlanmasını sağlayarak, doğrudan veri erişimine firmware kısıtlamaları olmadan izin verir.",
      "Uçucu bellekte depolanan bir ürün yazılımı uzantısı kullanır, bu da güç kapatıldıktan sonra hiçbir iz bırakılmamasını sağlar ve açık kaynaklı LibDriveIO kütüphanesi tarafından desteklenir.",
      "Bu yaklaşım, belirli sürücü modellerine veya ürün yazılımı sürümlerine bağlı olmayan evrensel araçlar sağlar ve MakeMKV gibi yazılımlarla uyumluluğu artırır."
    ],
    "commentSummary": [
      "LibreDrive, LibDriveIO kütüphanesinin bir parçası olarak 2019 yılında duyuruldu, ancak kaynak kodu henüz yayınlanmadı, bu da yaratıcısının emekliliği sonrasında gelecekte bir yayın yapılabileceği konusunda spekülasyonlara yol açtı.",
      "MakeMKV, Blu-ray Diskleri (BD) ve DVD'leri MKV dosyalarına dönüştüren bir araçtır ve otomasyon için bir komut satırı arayüzü (CLI) sunar, ancak bazı kullanıcılar daha geniş uyumluluk için MP4'ü tercih eder.",
      "LibreDrive ve MakeMKV ile ilgili tartışmalar, kullanıcıların çözümler bulduğu Dijital Haklar Yönetimi (DRM) ve bölge kısıtlamaları ile ilgili zorlukları içerirken, DMCA ihlalleriyle ilgili yasal endişeler devam etmektedir."
    ],
    "points": 134,
    "commentCount": 27,
    "retryCount": 0,
    "time": 1728442719
  },
  {
    "id": 41788026,
    "title": "PEP 760: Artık çıplak except yok",
    "originLink": "https://discuss.python.org/t/pep-760-no-more-bare-excepts/67182",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41788026",
    "commentBody": "",
    "originSummary": [
      "PEP 760, Pablo Galindo Salgado ve Brett Cannon tarafından önerilen, Python'da çıplak `except:` ifadelerinin kullanılmasını yasaklamayı öneriyor ve bu sayede hata yönetimi hassasiyetini artırmayı hedefliyor.- Öneri, geniş kapsamlı hata yönetiminin önemli hataları gizleyebilmesini önlemek için açıkça belirtilmiş istisna türlerini zorunlu kılmayı amaçlıyor.- PEP, geliştiricileri daha hassas hata yönetimi uygulamaları benimsemeye teşvik ediyor ve bu konuda daha fazla ayrıntı, kullanımdan kaldırma, araçlar ve reddedilen fikirler hakkında mevcut."
    ],
    "commentSummary": [
      "PEP 760, Python'da tüm istisnaları, sistem çıkışları ve klavye kesintileri gibi kritik olanlar da dahil olmak üzere yakalayan çıplak `except:` maddelerini yasaklamayı önermektedir.",
      "Eleştirmenler, bu değişikliğin mevcut kodu bozabileceğini, kullanıcıların yükseltme yapmasını veya bağımlılıkları yamalamasını gerektirebileceğini ve bunun da rastlantısal Python kullanıcıları için külfetli olabileceğini savunuyorlar.",
      "Öneri, geriye dönük uyumluluk ve bunun Python ekosistemi üzerindeki etkisi hakkında tartışma başlattı, bazıları bunun bir dil değişikliği yerine bir linter kuralı olması gerektiğini öne sürüyor."
    ],
    "points": 125,
    "commentCount": 246,
    "retryCount": 0,
    "time": 1728482081
  },
  {
    "id": 41780929,
    "title": "Intel'in Xe2 Mimarisi'nin İlk Kez Tanıtıldığı Lunar Lake iGPU",
    "originLink": "https://chipsandcheese.com/p/lunar-lakes-igpu-debut-of-intels",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41780929",
    "commentBody": "",
    "originSummary": [
      "Intel'in Lunar Lake'i, ince ve hafif dizüstü bilgisayarlardaki entegre GPU'lar için verimlilik ve performansı önemli ölçüde artıran Xe2 grafik mimarisini tanıtıyor. Xe2 mimarisi, iki Render Dilimine bölünmüş sekiz Xe Çekirdeği ile önbellekleme, Vektör Motorları ve ışın izleme yeteneklerinde iyileştirmeler sunarak selefi Meteor Lake'e göre dikkate değer performans artışları gösteriyor. Intel'in stratejisi, DRAM erişimini azaltmak için daha fazla önbellek kullanarak verimlilik ve güç optimizasyonunu vurguluyor ve yaklaşan Battlemage ayrık GPU'larını önizleyerek GPU performansını geliştirmeye güçlü bir odaklanma olduğunu gösteriyor."
    ],
    "commentSummary": [
      "Intel'in Xe2 mimarisi, grafiklerini ürün serisi genelinde birleştirmeyi ve ayrık GPU pazarına girmeyi hedefleyen Lunar Lake'in entegre GPU'su (iGPU) ile tanıtılıyor.",
      "Linux desteği ve Xe2 için güç yönetimi hala geliştirme aşamasındayken, açık kaynak topluluğu Xe1 SR-IOV grafik sanallaştırmasını geliştirmeye devam ediyor.",
      "Metin, Intel'in yeni donanım ve sürücü mimarisine odaklanmasını, topluluk katkılarını vurgulayan tartışmaları ve video kodlama/çözme konularını ele alıyor, donanım ve yazılım kodlama kalitesi ve hızını karşılaştırıyor."
    ],
    "points": 121,
    "commentCount": 58,
    "retryCount": 0,
    "time": 1728415957
  },
  {
    "id": 41789242,
    "title": "n-topları Arasındaki bir n-topu",
    "originLink": "https://www.arnaldur.be/writing/about/an-n-ball-between-n-balls",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41789242",
    "commentBody": "",
    "originSummary": [
      "Makale, 2D bir kareden başlayarak daha yüksek boyutlara uzanan yüksek boyutlu şekillerin şaşırtıcı özelliklerini gösteren geometrik bir düşünce deneyini sunmaktadır.- Daha yüksek boyutlarda, merkezi kürenin (veya n-kürenin) çevresindeki şeklin ötesine geçebileceğini ortaya koyarak, uzay ve hacim hakkındaki sezgisel beklentilere meydan okumaktadır.- Tartışma, n-kürelerin matematiksel özelliklerini içermekte olup, boyutlar arttıkça etraflarındaki alanın n-kürelerin kendilerinden daha hızlı büyüdüğünü, etkileşimli görselleştirmeler ve daha fazla analizle destekleyerek göstermektedir."
    ],
    "commentSummary": [
      "Metin, yüksek boyutlu geometriyi araştırıyor ve n-boyutlu uzayda küreler (n-balls) simetrik kalırken, n-boyutlu uzayda küplerin (n-cubes) boyutlar arttıkça \"dikenli\" hale geldiğine odaklanıyor.",
      "Bu, n≥10 boyutlarında, merkez n-kürenin n-küpün sınırlarının ötesine geçebileceğini vurgulayarak, daha yüksek boyutların karmaşıklıklarını göstermektedir.",
      "Konu, kullanıcı yorumlarını ve 'boyutların laneti'ne yapılan atıfları içeriyor; kullanıcılar, geometrik animasyonlar ve düşünce deneyleri karşısında hayranlıklarını dile getiriyorlar."
    ],
    "points": 115,
    "commentCount": 19,
    "retryCount": 0,
    "time": 1728489000
  }
]
