[
  {
    "id": 41786101,
    "title": "جائزة نوبل في الكيمياء: تصميم البروتينات الحاسوبية وتنبؤ هيكل البروتين",
    "originLink": "https://www.nobelprize.org/prizes/chemistry/2024/press-release/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41786101",
    "commentBody": "",
    "originSummary": [
      "تم منح جائزة نوبل في الكيمياء لعام 2024 لديفيد بيكر عن عمله في تصميم البروتينات الحاسوبية، ولدميس هاسابيس وجون إم. جامبر لتطويرهما نموذج AlphaFold2، وهو نموذج ذكاء اصطناعي لتوقع هيكل البروتين.- هذه التطورات لها آثار علمية كبيرة، مثل المساعدة في فهم مقاومة المضادات الحيوية وتطوير إنزيمات لتحليل البلاستيك.- تم تقسيم الجائزة، حيث حصل بيكر على نصفها، بينما تقاسم هاسابيس وجامبر النصف المتبقي."
    ],
    "commentSummary": [
      "تم منح جائزة نوبل في الكيمياء للتقدم في تصميم البروتينات الحاسوبية وتوقع هيكل البروتين، مما يبرز تأثير AlphaFold. يتم مقارنة التنبؤ السريع بهيكل البروتين بواسطة AlphaFold بالاختراقات السابقة مثل CRISPR، على الرغم من وجود قيود، مثل عدم حل مشكلة طي البروتين بشكل كامل. كما تعترف الجائزة بمساهمات ديفيد بيكر مع Rosetta، مما يبرز الطبيعة المتطورة للاعتراف العلمي ودور الذكاء الاصطناعي في البحث."
    ],
    "points": 424,
    "commentCount": 231,
    "retryCount": 0,
    "time": 1728467678
  },
  {
    "id": 41785265,
    "title": "تم العثور على شركة كوجنيزانت مذنبة بالتمييز ضد الموظفين غير الهنود",
    "originLink": "https://www.siliconvalley.com/2024/10/07/h-1b-visa-company-supplying-thousands-of-tech-workers-to-silicon-valley-discriminated-against-non-indians-jury-finds/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41785265",
    "commentBody": "",
    "originSummary": [
      "قررت هيئة المحلفين أن شركة كوجنيزانت قامت بالتمييز ضد الموظفين غير الهنود، مفضلة العمال الهنود الحاصلين على تأشيرات H-1B، مما أدى إلى ادعاءات بمعاملة غير عادلة وإنهاء الخدمة.",
      "تعتزم شركة كوجنيزانت استئناف الحكم، مؤكدة التزامها بالتنوع وعدم التمييز، على الرغم من توصية هيئة المحلفين بفرض تعويضات عقابية.",
      "تؤكد القضية المخاوف المتعلقة بعملية تأشيرة H-1B، بما في ذلك الادعاءات بالحصول على تأشيرات لوظائف غير موجودة، مما قد يضع العمال الأمريكيين في وضع غير مؤاتٍ."
    ],
    "commentSummary": [
      "تم العثور على شركة كوجنيزانت مذنبة بالتمييز ضد الموظفين غير الهنود، مما أثار مخاوف بشأن التحيزات الثقافية وديناميكيات مكان العمل.",
      "تناقش المناقشة كيف يمكن للاختلافات الثقافية، مثل الجماعية مقابل الفردية، أن تؤثر على القرارات الإدارية وتؤدي إلى التحيز.",
      "أثارت هذه الحالة نقاشًا أوسع حول تأثير الاستعانة بمصادر خارجية، والحاجة إلى الشمولية، وتحديات دمج البيئات الثقافية المتنوعة في القوى العاملة العالمية."
    ],
    "points": 346,
    "commentCount": 319,
    "retryCount": 0,
    "time": 1728457556
  },
  {
    "id": 41782534,
    "title": "عن طبيعة الزمن",
    "originLink": "https://writings.stephenwolfram.com/2024/10/on-the-nature-of-time/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41782534",
    "commentBody": "",
    "originSummary": [
      "يستكشف المنشور النظرة الحاسوبية للزمن، مشيرًا إلى أن الزمن هو الحساب المستمر للكون، وبسبب عدم قابلية الحساب للاختزال، لا يمكننا التنبؤ بالمستقبل أو \"القفز إلى الأمام\" في الزمن.",
      "يناقش كيف أن تصورنا للوقت كخط مستقيم يعود إلى حدودنا الحسابية، بينما قد يكون الوقت في الأساس متعدد الخيوط، وتجربتنا تتشكل من خلال استكشافنا المحدود للروليد، وهو مفهوم يمثل الحد المتشابك لجميع الحسابات.",
      "التفسير يتحدى المفاهيم التقليدية مثل السفر عبر الزمن، حيث يربط بين النظرة الحاسوبية للزمن وقانون الديناميكا الحرارية الثاني، الذي ينص على أن الإنتروبيا، أو الفوضى، تميل إلى الزيادة مع مرور الوقت."
    ],
    "commentSummary": [
      "يقترح ستيفن وولفرام وجوليان باربور أن الزمن هو خاصية ناشئة، مما يشير إلى كونٍ أساسه بلا زمن ويحتوي على جميع الحالات الممكنة.",
      "وجهة نظر باربور هي أن الزمن ينبثق من العلاقات الهندسية الثابتة، بينما يعزو وولفرام ذلك إلى قيودنا الحسابية داخل إطار حسابي لا زمني.",
      "بينما يتفق كلا المنظرين على أساس دائم للواقع، تُعتبر أفكار وولفرام غالبًا نظرية وفلسفية، تفتقر إلى الدعم التجريبي، وترتبط بمفاهيم مثل الأبدية ونظريات الكون الكتلي."
    ],
    "points": 334,
    "commentCount": 232,
    "retryCount": 0,
    "time": 1728427321
  },
  {
    "id": 41781457,
    "title": "نقد متواضع لـ Htmx",
    "originLink": "https://chrisdone.com/posts/htmx-critique/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41781457",
    "commentBody": "",
    "originSummary": [
      "تتضمن نقد Htmx عدة قضايا، بما في ذلك وراثة الخصائص التي تكون ضمنية وغير متسقة، مما يؤدي إلى الارتباك ويستلزم التصريحات الصريحة. يواجه Htmx تحديات مع استبدال عناصر DOM وتخزين الحالة ووضع الطابور، مما قد يؤدي إلى فقدان الحالة المحلية للمتصفح وتخزين الحالة بشكل معيب ومعالجة الطلبات بشكل غير بديهي. على الرغم من مشكلات التكامل مع React، يقدم Htmx فوائد عند استخدامه مع اللغات الجانبية للخادم، مما قد يلغي الحاجة إلى TypeScript والتسلسل وGraphQL، مع اقتراح إعادة تنفيذ Htmx في React لمعالجة هذه المخاوف."
    ],
    "commentSummary": [
      "يركز النقد الموجه لـ Htmx على التحديات مثل تعارضات حالة العميل وتعقيد الأحداث، والتي يمكن أن تكون مشكلة في المشاريع الكبيرة.",
      "تشمل المناقشة مقارنات مع React، مسلطة الضوء على الجدل المستمر حول تعقيد الواجهة الأمامية ومدى ملاءمة الأدوات المختلفة.",
      "على الرغم من الانتقادات، يُقدَّر Htmx لبساطته وفعاليته في مهام محددة، مما يبرز أهمية اختيار الأداة المناسبة لكل مشروع."
    ],
    "points": 287,
    "commentCount": 137,
    "retryCount": 0,
    "time": 1728418797
  },
  {
    "id": 41784591,
    "title": "الإضافة هي كل ما تحتاجه لنماذج اللغة الموفرة للطاقة",
    "originLink": "https://arxiv.org/abs/2410.00907",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41784591",
    "commentBody": "",
    "originSummary": [
      "تقدم الورقة البحثية \"الإضافة هي كل ما تحتاجه لنماذج اللغة الموفرة للطاقة\" خوارزمية L-Mul، التي تستخدم الجمع بالأعداد الصحيحة لتقريب الضرب بالنقاط العائمة، مما يقلل من تكاليف الحساب والطاقة. تحقق L-Mul دقة أعلى من الضرب بالنقاط العائمة ذات 8 بت ويمكن أن تقلل تكاليف الطاقة بنسبة تصل إلى 95% للضربات العنصرية للمصفوفات و80% للمنتجات النقطية. أظهرت الاختبارات على مهام متنوعة أن L-Mul تحافظ على دقة مماثلة للطرق التقليدية، مما يجعلها بديلاً قابلاً للتطبيق في نماذج المحولات."
    ],
    "commentSummary": [
      "تركز المناقشة على تحسين كفاءة الطاقة في نماذج اللغة من خلال استخدام الحساب بالنقطة الثابتة والعمليات الصحيحة، والتي تعتبر أكثر كفاءة من الحسابات بالنقطة العائمة، خاصة في الأنظمة التي تفتقر إلى وحدات النقطة العائمة.",
      "هناك اهتمام بالهياكل المعمارية القائمة على الإضافة للشبكات العصبية لتقليل تكاليف الطاقة بشكل أكبر، على الرغم من استمرار المخاوف بشأن العملية والدقة مقارنة بمعايير النقطة العائمة IEEE 754.",
      "تشمل المناقشة الموازنة بين الدقة والأداء في بيئات الحوسبة المختلفة، مع تكهنات حول كيفية تأثير شركات كبرى مثل Nvidia على اتجاهات أبحاث الذكاء الاصطناعي، مما قد يحد من استكشاف طرق حسابية فعالة."
    ],
    "points": 256,
    "commentCount": 81,
    "retryCount": 0,
    "time": 1728449260
  },
  {
    "id": 41781777,
    "title": "ممارسات تصميم البرمجيات الموثوقة",
    "originLink": "https://entropicthoughts.com/practices-of-reliable-software-design",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41781777",
    "commentBody": "",
    "originSummary": [
      "يقدم كتاب \"ممارسات تصميم البرمجيات الموثوقة\" للمؤلف kqr ثماني ممارسات أساسية لتطوير البرمجيات الموثوقة، مع التركيز على إنشاء ذاكرة تخزين مؤقت سريعة في الذاكرة. تشمل الممارسات الرئيسية استخدام الحلول الجاهزة مثل Redis، وإعطاء الأولوية للتكلفة والموثوقية على الميزات، ونشر الميزات البسيطة بسرعة لتعلم ما هو ضروري. تتضمن الممارسات الإضافية استخدام هياكل بيانات بسيطة، وحجز الموارد مبكرًا، وتحديد الحدود القصوى لمنع مشاكل الأداء، وتسهيل عملية الاختبار، وتضمين عدادات الأداء لتتبع سلوك النظام."
    ],
    "commentSummary": [
      "التكرار، أو وجود مسارات متعددة ومستقلة لتحقيق النجاح، هو أمر حيوي لبناء أنظمة برمجية موثوقة، كما يتضح من أنظمة مثل بحث جوجل وRAID 5. بينما يعزز التكرار الموثوقية، فإنه يمكن أن يضيف أيضًا تعقيدًا وعدم كفاءة، خاصة في الأنظمة الحديثة حيث غالبًا ما تنتج الأعطال عن تفاعلات بين المكونات بدلاً من فشل مكون فردي. تحقيق التوازن بين الكفاءة والموثوقية أمر ضروري، مع أمثلة من العالم الحقيقي تظهر أن الإفراط في التحسين يمكن أن يؤدي إلى هشاشة النظام؛ وبالتالي، فإن استخدام الأنظمة الفرعية البسيطة والمفهومة جيدًا والصيانة الدورية هو المفتاح لتحقيق الموثوقية."
    ],
    "points": 192,
    "commentCount": 42,
    "retryCount": 0,
    "time": 1728421282
  },
  {
    "id": 41781855,
    "title": "لا تدع القواميس تفسد شيفرتك",
    "originLink": "https://roman.pt/posts/dont-let-dicts-spoil-your-code/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41781855",
    "commentBody": "",
    "originSummary": [
      "القواميس (dicts) في بايثون قابلة للتغيير وغير شفافة، مما قد يعقد صيانة الكود وتوسيعه. يُوصى بتحويل القواميس إلى نماذج بيانات منظمة باستخدام أدوات مثل dataclasses أو Pydantic لتحسين إدارة الكود. بالنسبة للكود القديم، يمكن استخدام TypedDicts لإضافة هيكلية، وتُقترح تعليقات Mapping لمخازن المفاتيح والقيم لمنع الديون التقنية."
    ],
    "commentSummary": [
      "تؤكد المشاركة على استخدام كائنات القيمة، مثل فئات البيانات، للتعامل مع البيانات في وقت مبكر من عملية التطوير لضمان تعريفات بيانات واضحة وتجنب الحقول الاختيارية. تقترح أنه بينما تكون القواميس مفيدة للبيانات الديناميكية، فإن الإفراط في استخدامها يمكن أن يؤدي إلى كود فوضوي، ويجب استخدام الأنواع المهيكلة للبيانات المعروفة لتحسين وضوح الكود وتقليل الأخطاء. يوفر بايثون أدوات مثل فئات البيانات، TypedDict، وPydantic لتسهيل التعامل الأفضل مع البيانات، مما يعزز الكود النظيف والفعال."
    ],
    "points": 174,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1728421814
  },
  {
    "id": 41784287,
    "title": "الولايات المتحدة تدرس تفكيك جوجل في قضية مكافحة الاحتكار التاريخية",
    "originLink": "https://www.ft.com/content/f6e84608-e0e5-48c5-a0eb-dde7675fb608",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41784287",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "تدرس الولايات المتحدة قضية مكافحة احتكار تاريخية قد تؤدي إلى تفكيك شركة جوجل، مستهدفة هيمنتها في قطاعات البحث والإعلانات.",
      "يمكن أن يشكل هذا القضية سابقة للإجراءات التنظيمية المستقبلية ضد شركات التكنولوجيا الكبرى، مما يعكس المخاوف بشأن قمع المنافسة والابتكار.",
      "يبرز النقاش التوتر بين تعزيز المنافسة في السوق والحفاظ على الفوائد التي تقدمها شركات التكنولوجيا الكبرى مثل جوجل، والتي تشمل خدمات مثل أندرويد ويوتيوب."
    ],
    "points": 164,
    "commentCount": 220,
    "retryCount": 0,
    "time": 1728445190
  },
  {
    "id": 41785511,
    "title": "لقد أنشأت مدير نفق SSH لتعلم لغة Go",
    "originLink": "https://github.com/alebeck/boring",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41785511",
    "commentBody": "",
    "originSummary": [
      "مدير نفق Boring هو أداة خفيفة الوزن لسطر الأوامر لإدارة الأنفاق SSH (الصدفة الآمنة)، ويدعم كل من الاتصالات المحلية والبعيدة.",
      "يقوم المستخدمون بتكوين الأنفاق باستخدام ملف TOML (لغة توم الواضحة والبسيطة)، مع خيارات لتحديد تفاصيل مثل المضيف، المستخدم، والمنفذ.",
      "الأداة متوافقة مع macOS وLinux، وتقدم ميزات مثل إعادة الاتصال التلقائي والتكامل مع ssh-agent للمصادقة الآمنة."
    ],
    "commentSummary": [
      "تم تطوير مدير نفق SSH جديد باستخدام لغة البرمجة Go وهو متاح على GitHub، مما يبرز سهولة تضمين خوادم SSH في التطبيقات باستخدام مكتبات Go.",
      "على الرغم من الطبيعة السهلة الاستخدام لمكتبات SSH في لغة Go، إلا أن القضايا غير المحلولة قد أدت إلى استخدام حلول من طرف ثالث، وهو ما يهدف هذا المشروع إلى معالجته.",
      "قد تتضمن التحسينات المستقبلية دعم نظام التشغيل ويندوز وتعدد الإرسال عبر SSH، حيث يتلقى المشروع بالفعل ردود فعل إيجابية وهو مفتوح للاقتراحات من أجل تحسينات إضافية."
    ],
    "points": 154,
    "commentCount": 54,
    "retryCount": 0,
    "time": 1728460344
  },
  {
    "id": 41787647,
    "title": "الألمان ينتقدون تأثير اللغة الإنجليزية حيث يحصل 'الفاصلة العليا للأحمق' على الموافقة",
    "originLink": "https://www.theguardian.com/world/2024/oct/07/germany-influence-of-english-idiots-apostrophe",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41787647",
    "commentBody": "",
    "originSummary": [
      "ألمانيا خففت قواعدها بشأن استخدام الفواصل العليا للإشارة إلى الملكية، مما يسمح بأشكال مثل \"Rosi's Bar\"، والتي لم تكن صحيحة تقليديًا في اللغة الألمانية. - مجلس الإملاء الألماني الآن يسمح باستخدام الفاصلة العليا لفصل حرف 's' الملكي في الأسماء الخاصة، مما أثار جدلاً حول تأثير اللغة الإنجليزية على اللغة الألمانية. - أدى هذا التغيير إلى مناقشات حول التأثيرات الدولية على اللغة الألمانية، مع بعض الأشخاص الذين يدعون إلى بدائل ألمانية للمصطلحات الإنجليزية."
    ],
    "commentSummary": [
      "الألمان يناقشون تأثير اللغة الإنجليزية على لغتهم، مع التركيز على الموافقة على استخدام \"الفاصلة الغبية\" في سياقات محددة، مثل أسماء الشركات ولكن ليس في العناصر الشخصية.",
      "تؤكد هذه المناقشة على التوتر بين تطور اللغة والحفاظ عليها، مع وجود آراء متباينة حول ما إذا كان ينبغي للغة أن تتكيف بشكل طبيعي أو تحافظ على الهوية الثقافية.",
      "يعكس النقاش أيضًا التأثير العالمي الأوسع للغة الإنجليزية والتحديات في الحفاظ على المعايير اللغوية."
    ],
    "points": 139,
    "commentCount": 329,
    "retryCount": 0,
    "time": 1728479815
  },
  {
    "id": 41784069,
    "title": "ما هو LibreDrive (2019)",
    "originLink": "https://forum.makemkv.com/forum/viewtopic.php?t=18856",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41784069",
    "commentBody": "",
    "originSummary": [
      "LibreDrive هو وضع لأجهزة الأقراص الضوئية يسمح بالوصول المباشر إلى البيانات دون قيود البرامج الثابتة، مما يمكن من قراءة أقراص UHD وتجاوز إلغاء اعتماد المضيف AACS.",
      "يستخدم امتدادًا للبرامج الثابتة مخزنًا في ذاكرة متطايرة، مما يضمن عدم ترك أي أثر بعد إيقاف التشغيل، ويدعمه مكتبة LibDriveIO مفتوحة المصدر.",
      "تسمح هذه الطريقة بتوفير أدوات عالمية لا تعتمد على نماذج محركات معينة أو إصدارات البرامج الثابتة، مما يعزز التوافق مع برامج مثل MakeMKV."
    ],
    "commentSummary": [
      "تم الإعلان عن LibreDrive، وهو جزء من مكتبة LibDriveIO، في عام 2019، ولكن لم يتم إصدار الشيفرة المصدرية له، مما أدى إلى تكهنات حول إمكانية إصداره في المستقبل عند تقاعد المبدع.",
      "MakeMKV هو أداة ذات صلة تقوم بتحويل أقراص Blu-ray (BD) وأقراص DVD إلى ملفات MKV، وتوفر واجهة سطر الأوامر (CLI) للتشغيل الآلي، على الرغم من أن بعض المستخدمين يفضلون MP4 لتوافق أوسع.",
      "تتضمن المناقشات حول LibreDrive و MakeMKV تحديات مع إدارة الحقوق الرقمية (DRM) وقيود المناطق، حيث يجد المستخدمون حلولاً بديلة، بينما تستمر المخاوف القانونية بشأن انتهاكات قانون الألفية للملكية الرقمية (DMCA)."
    ],
    "points": 134,
    "commentCount": 27,
    "retryCount": 0,
    "time": 1728442719
  },
  {
    "id": 41788026,
    "title": "PEP 760: لا مزيد من الاستثناءات العارية",
    "originLink": "https://discuss.python.org/t/pep-760-no-more-bare-excepts/67182",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41788026",
    "commentBody": "",
    "originSummary": [
      "يقترح PEP 760، الذي قدمه بابلو جاليندو سالجادو وبريت كانون، منع استخدام عبارات `except:` العارية في بايثون لتعزيز دقة معالجة الأخطاء. يهدف الاقتراح إلى منع معالجة الاستثناءات الواسعة التي يمكن أن تخفي أخطاء كبيرة من خلال فرض تحديد أنواع الاستثناءات بشكل صريح. يشجع PEP المطورين على تبني ممارسات معالجة أخطاء أكثر دقة، مع توفر تفاصيل إضافية حول الإهمال، الأدوات، والأفكار المرفوضة."
    ],
    "commentSummary": [
      "يقترح PEP 760 عدم السماح باستخدام عبارات `except:` العارية في بايثون، والتي تلتقط حاليًا جميع الاستثناءات، بما في ذلك الاستثناءات الحرجة مثل إنهاء النظام ومقاطعات لوحة المفاتيح.",
      "يجادل النقاد بأن هذا التغيير قد يؤدي إلى تعطيل الشيفرات الحالية، مما يتطلب من المستخدمين ترقية أو تصحيح التبعيات، وهو ما قد يكون مرهقًا للمستخدمين العرضيين للغة بايثون.",
      "أثار الاقتراح نقاشًا حول التوافق العكسي وتأثيره على نظام بايثون البيئي، حيث اقترح البعض أن يكون قاعدة في أداة تحليل الشيفرة بدلاً من تغيير في اللغة."
    ],
    "points": 125,
    "commentCount": 246,
    "retryCount": 0,
    "time": 1728482081
  },
  {
    "id": 41780929,
    "title": "وحدة معالجة الرسوميات المدمجة في بحيرة لونار: ظهور معمارية Xe2 من إنتل",
    "originLink": "https://chipsandcheese.com/p/lunar-lakes-igpu-debut-of-intels",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41780929",
    "commentBody": "",
    "originSummary": [
      "تقدم Intel معمارية الرسوميات Xe2 في Lunar Lake، مما يعزز بشكل كبير الكفاءة والأداء لوحدات معالجة الرسوميات المدمجة في أجهزة الكمبيوتر المحمولة الرقيقة والخفيفة. تتميز معمارية Xe2 بثمانية نوى Xe مقسمة إلى شريحتين للتصيير، مع تحسينات في التخزين المؤقت ومحركات المتجهات وقدرات تتبع الأشعة، مما يظهر مكاسب أداء ملحوظة مقارنة بسابقتها، Meteor Lake. تركز استراتيجية Intel على الكفاءة وتحسين الطاقة، باستخدام المزيد من التخزين المؤقت لتقليل الوصول إلى DRAM، وتعرض وحدات معالجة الرسوميات المنفصلة القادمة Battlemage، مما يشير إلى تركيز قوي على تحسين أداء وحدات معالجة الرسوميات."
    ],
    "commentSummary": [
      "تظهر بنية Xe2 من إنتل لأول مرة مع وحدة معالجة الرسوميات المدمجة (iGPU) في معالجات Lunar Lake، وتهدف إلى توحيد الرسوميات عبر خط منتجاتها والدخول إلى سوق وحدات معالجة الرسوميات المنفصلة.",
      "لا يزال دعم لينكس وإدارة الطاقة لـ Xe2 قيد التطوير، بينما تواصل مجتمع المصادر المفتوحة تحسين افتراضية الرسوميات SR-IOV لـ Xe1.",
      "تؤكد المناقشات على تركيز إنتل على الأجهزة الجديدة وهندسة السائقين، مع مساهمات المجتمع، وتتناول ترميز/فك ترميز الفيديو، مع مقارنة جودة وسرعة الترميز بين الأجهزة والبرامج."
    ],
    "points": 121,
    "commentCount": 58,
    "retryCount": 0,
    "time": 1728415957
  },
  {
    "id": 41789242,
    "title": "كرة n بين كرات n",
    "originLink": "https://www.arnaldur.be/writing/about/an-n-ball-between-n-balls",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41789242",
    "commentBody": "",
    "originSummary": [
      "تقدم المقالة تجربة فكرية هندسية توضح الخصائص المفاجئة للأشكال ذات الأبعاد العالية، بدءًا من المربع ثنائي الأبعاد والامتداد إلى أبعاد أعلى. تكشف أن في الأبعاد الأعلى، يمكن للكرة المركزية (أو n-ball) أن تمتد إلى ما وراء الشكل المحيط، مما يتحدى التوقعات البديهية حول الفضاء والحجم. تتضمن المناقشة خصائص رياضية للكرات n، موضحة أنه مع زيادة الأبعاد، ينمو الفضاء حولها بشكل أسرع من الكرات نفسها، مدعومة بتصورات تفاعلية وتحليل إضافي."
    ],
    "commentSummary": [
      "يستكشف المنشور الهندسة ذات الأبعاد العالية، مع التركيز على كيفية بقاء الكرات في الفضاء ذي الأبعاد n متناظرة، بينما تصبح المكعبات في الفضاء ذي الأبعاد n \"شائكة\" مع زيادة الأبعاد.",
      "يشير إلى أنه في الأبعاد n≥10، يمكن للكرة المركزية n أن تمتد إلى ما وراء حدود المكعب n، مما يوضح تعقيدات الأبعاد الأعلى.",
      "تشمل المناقشة تعليقات المستخدمين وإشارات إلى \"لعنة الأبعاد\"، حيث يعبر المستخدمون عن انبهارهم بالرسوم المتحركة الهندسية وتجارب التفكير."
    ],
    "points": 115,
    "commentCount": 19,
    "retryCount": 0,
    "time": 1728489000
  }
]
