[
  {
    "title": "2023년 기술직 해고 급증: 영향을 받는 주요 기업 및 산업",
    "originLink": "https://techcrunch.com/2023/11/8/tech-layoffs-2023-list/",
    "originBody": "",
    "originSummary": [
      "기술 업계는 2023년에 해고가 크게 증가하여 전년도 전체 해고 건수를 넘어섰습니다.",
      "구글, 아마존, 마이크로소프트 등 주요 기업들이 대량 해고를 실시하면서 다양한 직종과 분야에 영향을 미쳤습니다.",
      "해고는 성장률 감소, 구조조정 이니셔티브, 업계의 재정적 어려움 등의 요인으로 인해 발생했습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "The tech industry has experienced a significant increase in layoffs in 2023 compared to the previous year.",
      "Major companies such as Google, Amazon, and Microsoft have conducted mass layoffs, affecting various positions and industries.",
      "Layoffs have been attributed to factors such as decreased growth, restructuring, and financial difficulties."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699535801677
  },
  {
    "title": "디지털 의료 스타트업에 종사하는 의사 수 증가: 혁신 추진 및 환자 치료 개선",
    "originLink": "https://www.statnews.com/2023/11/09/digital-health-industry-doctors-md-ceos/",
    "originBody": "",
    "originSummary": [
      "디지털 헬스 스타트업은 의사가 업계에 제공하는 고유한 가치로 인해 의사를 CEO로 고용하는 것을 고려해야 합니다.",
      "의사는 비즈니스 교육이 부족하고 위험을 회피한다는 전통적인 믿음에도 불구하고 디지털 의료 분야에서 의사에서 창업자로 변신한 성공적인 사례가 있습니다.",
      "의사는 환자 집단과 임상 워크플로우에 대한 이해도가 높기 때문에 의료 스타트업을 이끌고 의료 기관을 탐색하는 데 매우 적합합니다. 창업에 관심이 있는 의사들을 위해 의료의 비즈니스 측면에 대한 더 많은 훈련과 교육이 필요합니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "Digital health startups should consider hiring doctors as CEOs due to their unique value and advantages in the industry.",
      "Contrary to traditional thinking, physicians have been successful as founders in the digital health space.",
      "Doctors' deep understanding of patient needs, clinical workflows, and ability to navigate healthcare organizations make them well-suited to lead healthcare startups."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699535801677
  },
  {
    "title": "운영 비용 증가로 중국에서 철수하는 Citrix 소유주",
    "originLink": "https://www.scmp.com/tech/article/3240901/citrix-owner-cloud-software-becomes-latest-us-software-company-quit-china-economy-weakens",
    "originBody": "",
    "originSummary": [
      "Citrix의 모회사인 Cloud Software Group은 운영 비용 상승으로 인해 중국 내 신규 상업 거래를 중단하고 있습니다.",
      "LinkedIn, Salesforce와 같은 다른 미국 기술 기업들도 비슷한 추세에 따라 중국 내 사업 규모를 축소하고 있습니다.",
      "이러한 결정은 경제 불확실성과 데이터 보안 및 국경 간 데이터 처리 요건을 포함한 엄격한 규제로 인해 다국적 기술 기업의 규정 준수 비용과 운영상의 어려움이 증가했기 때문입니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "The parent company of Citrix, Cloud Software Group, will halt all new business transactions in China due to rising operational costs.",
      "This decision follows similar actions taken by American tech companies like LinkedIn and Salesforce, who have downsized their operations in China.",
      "The move is a result of a weaker economic outlook, increased data-security requirements, and stricter regulations on cross-border data processing in China."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699535801677
  },
  {
    "title": "영국 통신 감시 기관이 온라인에서 어린이를 보호하기 위해 소셜 미디어 플랫폼에 대한 지침을 발표했습니다.",
    "originLink": "https://www.bbc.com/news/technology-67358369",
    "originBody": "",
    "originSummary": [
      "영국의 통신 감시 기관인 Ofcom은 소셜 미디어 플랫폼이 온라인 안전법을 준수하도록 지침을 발표했으며, 특히 온라인 아동 학대 등 불법 콘텐츠에 대한 대응에 중점을 두고 있습니다.",
      "이 지침은 온라인 그루밍을 방지하기 위해 플랫폼이 기본적으로 아동을 '친구'로 제안하지 못하도록 촉구하며, 아동의 위치 정보를 보호하고 연락처 목록에 없는 사람과의 접촉을 제한하는 조치를 포함하고 있습니다.",
      "이 지침은 효과적인 검토 팀, 간편한 불만 신고, 테러와 관련된 계정 삭제의 중요성을 강조합니다. 아동 성적 학대 자료를 탐지하기 위해 해시 매칭 기술을 사용할 것을 제안하지만, 비공개 메시지에 대한 암호화를 해제하는 방안은 제안하지 않습니다. 암호화된 메시지를 스캔할 수 있는 권한은 2024년까지 논의되지 않을 예정입니다.",
      "20,000개의 소규모 기업을 포함하여 100,000개 이상의 서비스에서 규정 준수가 예상되며, Ofcom은 요구사항에 비례하고 증거에 기반하는 것을 목표로 합니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "Ofcom, the UK communications watchdog, has released guidance for social media platforms to comply with the Online Safety Act.",
      "The guidance focuses on addressing illegal content, particularly child abuse online, and encourages platforms to prevent online grooming by not suggesting children as \"friends\" by default.",
      "The guidance also includes measures to protect children's location information, limit contact with unknown individuals, have effective moderation teams, provide easy reporting mechanisms, and remove accounts associated with terrorism.",
      "While the guidance does not propose breaking encryption for private messages, it suggests using hash-matching technology to identify child sexual abuse material (CSAM).",
      "Controversial powers to scan encrypted messages will not be discussed until 2024.",
      "Ofcom's guidance is extensive, spanning over 1,500 pages, and applies to more than 100,000 services, including 20,000 small businesses.",
      "According to Ofcom's chief executive, the regulator aims to be proportionate and evidence-based in its requirements."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699535801677
  },
  {
    "title": "텍사스 북부 기업 10곳이 딜로이트의 2023년 테크놀로지 패스트 500 리스트에 선정되었습니다.",
    "originLink": "https://dallasinnovates.com/10-north-texas-companies-make-2023-deloitte-tech-fast-500-list/",
    "originBody": "",
    "originSummary": [
      "딜로이트는 2023년 북미 테크놀로지 패스트 500 목록을 발표했으며, 텍사스 북부에서 10개 기업이 선정되었고 상위 50위권에는 2개 기업이 포함되었습니다. 텍사스주 전체에서는 30개 기업이 이 리스트에 포함되었습니다.",
      "또한 딜로이트는 댈러스 독립 교육구에서 8명의 졸업생에게 장학금을 수여하여 기술 분야의 지역 인재를 더욱 지원하고 있습니다.",
      "Dallas Innovates Magazine은 독자들에게 이 지역의 혁신 기술 부문에 대한 귀중한 인사이트를 제공하는 2023년 독점 호를 무료로 제공합니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "Deloitte has published its 2023 North America Technology Fast 500 list, featuring 10 companies from North Texas, with two in the top 50.",
      "Texas has a total of 30 companies on the list, showcasing its strong presence in the tech industry.",
      "Deloitte has also granted scholarships to eight seniors from the Dallas Independent School District, highlighting their commitment to supporting education in the local community."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699535801677
  },
  {
    "title": "인도의 온라인 검열이 글로벌 표준을 세우는 방법",
    "originLink": "https://www.washingtonpost.com/world/2023/11/08/india-twitter-online-censorship/",
    "originBody": "",
    "originSummary": [
      "인도 정부는 미국 소셜 미디어 기업에 대해 더 엄격한 규제를 시행하여 검열을 강화하고 정부 요구를 준수하도록 하고 있습니다.",
      "한때 반항적이었던 트위터는 이제 새로운 규정을 준수하고 법적 처벌을 피하기 위해 나렌드라 모디 총리에 대한 비판적인 게시물을 정기적으로 삭제하고 있습니다.",
      "이러한 단속으로 인해 트위터와 테슬라 같은 실리콘밸리 기업들은 인도의 규정을 준수하지 않으면 정부의 표적이 될 수 있다는 압박을 받고 있습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "The Indian government has imposed stricter control over American social media companies, resulting in increased censorship and compliance with government demands.",
      "Twitter, which was once defiant, is now regularly removing critical posts about Prime Minister Narendra Modi due to new regulations and fear of legal consequences.",
      "Twitter's compliance with India's demands has sparked criticism from its employees and pressure on other Silicon Valley companies to comply with Indian regulations or face government targeting."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699535801677
  },
  {
    "title": "음이온 기술을 사용하는 휴대용 공기청정기가 대기 오염 퇴치에 혁신을 가져오는 방법",
    "originLink": "https://www.businessinsider.com/clear-air-tech-companies-change-way-we-breathe-2023-11",
    "originBody": "",
    "originSummary": [
      "영국의 스타트업인 Air For Life와 Air Shield Mini는 대기 오염 문제를 해결하기 위해 음이온 기술을 사용하는 휴대용 공기청정기를 개발하고 있습니다.",
      "에어 포 라이프의 필터 없는 이중 이온화 기술은 음이온을 생성하여 공기 중과 표면의 불순물을 제거합니다.",
      "크리스티안 트람스가 개발한 에어 쉴드 미니는 음이온을 지속적으로 방출하여 오염 물질과 결합하여 바닥이나 표면에 가라앉게 합니다. 두 장치 모두 기존 공기청정기에 비해 더 작고 가벼운 옵션을 제공합니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "Air For Life and Air Shield Mini, two UK startups, are working on portable air purifiers that utilize negative-ion technology to address air pollution.",
      "Air For Life's filterless, dual-ionization method generates negative ions that eliminate impurities in the air and on surfaces.",
      "The Air Shield Mini, created by Christiaan Trahms, emits a continuous stream of negative ions that bind to pollutants, leading them to settle on surfaces or fall to the ground. Both devices provide a smaller and lighter option compared to conventional air purifiers."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699535801677
  },
  {
    "title": "기후 기술 스타트업, 3분기에 76억 달러 모금하며 VC 펀딩 신기록 수립",
    "originLink": "https://carboncredits.com/climate-tech-startups-amass-7-6b-in-q3-setting-new-record-for-vc-funding/",
    "originBody": "",
    "originSummary": [
      "탄소 및 배출 기술을 전문으로 하는 기후 기술 스타트업은 2023년 3분기 동안 무려 76억 달러의 벤처 캐피털 자금을 조달했습니다.",
      "자금 조달이 급증한 데에는 공장 건설을 지원하는 대규모 자금 조달 라운드와 정부 인센티브가 중요한 역할을 했습니다.",
      "눈에 띄는 거래로는 H2 Green Steel의 16억 달러 펀딩 라운드와 Redwood Materials의 9억 9720만 달러 투자가 있습니다.",
      "친환경 채굴 및 에너지 효율 분야의 VC 거래도 분기 중 인상적인 가치를 보였습니다.",
      "기후 기술 스타트업은 정부의 지원과 기후 변화에 대한 관심 증가 덕분에 전반적인 벤처캐피털의 자금 조달이 둔화되었음에도 불구하고 상당한 자금을 유치할 수 있었습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "Climate-tech startups focusing on carbon and emissions technology attracted a record-breaking $7.6 billion in venture capital funding during Q3 of 2023.",
      "This surge in funding was driven by large financing rounds that supported the construction of factories and was aided by government incentives.",
      "Notable transactions included H2 Green Steel closing a $1.6 billion funding round and Redwood Materials securing $997.2 million."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699535801677
  },
  {
    "title": "Google.org, APAC 지속가능성 시드 펀드를 통해 아시아의 환경 비영리 단체를 지원하기 위해 5백만 달러를 기부합니다.",
    "originLink": "https://www.eco-business.com/news/how-tech-companies-can-fund-and-scale-climate-projects-in-apac/",
    "originBody": "",
    "originSummary": [
      "Google.org는 환경 문제 해결에 전념하는 아시아의 비영리단체를 지원하기 위해 AVPN의 APAC 지속가능성 씨앗 기금에 5백만 달러를 기부했습니다.",
      "이 기금은 위험에 처한 지역사회를 위한 지속 가능한 솔루션에 초점을 맞춘 조직에 보조금을 제공합니다.",
      "또한 Google.org는 소셜 임팩트 조직이 기술을 활용할 수 있도록 역량 강화 프로그램을 제공하여 지원하고 있습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "Google.org has pledged an additional $5 million to the AVPN's APAC Sustainability Seed Fund to assist non-profit organizations in Asia in tackling environmental challenges.",
      "The fund grants support to organizations that focus on sustainable solutions for vulnerable communities.",
      "This funding is part of Google.org's larger goal to fund AI projects that address climate-related, medical, and social issues."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699535801677
  }
]
