[
  {
    "id": 41201555,
    "title": "제이크 셀리거가 사망했습니다",
    "originLink": "https://marginalrevolution.com/marginalrevolution/2024/08/jake-seliger-is-dead.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41201555",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Jake Seliger, Hacker News에서 jseliger로 알려진 인물이 세상을 떠났으며, 커뮤니티에 큰 영향을 남겼습니다.",
      "그는 특히 암과의 싸움에 대한 블로깅과 주체성 및 임상 시험에 대한 통찰력으로 많은 사람들의 존경을 받았다.",
      "HN 커뮤니티는 깊은 영향을 받았으며, 많은 사람들이 애도를 표하고 그의 영향력 있는 글에 대해 회상하고 있습니다."
    ],
    "points": 425,
    "commentCount": 77,
    "retryCount": 0,
    "time": 1723209543
  },
  {
    "id": 41199567,
    "title": "OTranscribe: 오디오 인터뷰를 필사하기 위한 무료 오픈 도구",
    "originLink": "https://otranscribe.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41199567",
    "commentBody": "",
    "originSummary": [
      "oTranscribe는 녹음된 인터뷰를 필사하는 과정을 간소화하는 무료 웹 애플리케이션으로, 일시 정지, 되감기 및 빨리 감기와 같은 키보드 제어 기능을 갖춘 데스크탑 사용을 위해 설계되었습니다.",
      "이 앱은 대화형 타임스탬프, 자동 저장, 파일을 컴퓨터에 보관하여 프라이버시를 보호하는 기능을 포함하며, 전사본을 Markdown, 일반 텍스트, Google Docs로 내보낼 수 있습니다.",
      "비디오 파일을 지원하며, MIT 라이선스 하에 오픈 소스로 제공되고, MuckRock 재단에 의해 소개된 Elliot Bentley에 의해 만들어졌습니다."
    ],
    "commentSummary": [
      "OTranscribe는 AI를 사용하지 않고 오디오 인터뷰를 수동으로 전사하기 위해 설계된 무료 도구입니다.",
      "사용자들은 자동 전사 및 화자 식별을 위해 Whisper Diarization 및 Spectropic과 같은 대안을 탐색하고 있으며, 더 빠른 처리를 위해 Whisper.CPP와 같은 로컬 솔루션을 찾고 있습니다.",
      "논의에는 iOS에서 오프라인 전사를 위한 Aiko와 같은 도구와 화자 인식 및 다양한 내보내기 형식과 같은 추가 기능을 제공하는 TurboScribe와 같은 서비스가 포함됩니다."
    ],
    "points": 330,
    "commentCount": 83,
    "retryCount": 0,
    "time": 1723188675
  },
  {
    "id": 41197300,
    "title": "USPS 문자 사기범들이 그의 아내를 속이자, 그는 그들의 작전을 해킹했다",
    "originLink": "https://blog.smithsecurity.biz/hacking-the-scammers",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41197300",
    "commentBody": "",
    "originSummary": [
      "한 사람, s1n으로 불리는 이는 nmap과 Burp Suite 같은 도구를 사용하여 가짜 USPS 사이트의 취약점을 이용해 사기꾼들에게 보복했습니다.",
      "시원(S1n)은 로컬 파일 포함(LFI) 익스플로잇과 SQL 인젝션 취약점을 식별하여 사기꾼들의 데이터베이스에 접근하고 관리자와 피해자 세부 정보를 공개했습니다.",
      "원래 게시자는 인터넷 범죄 당국에 결과를 보고할 계획이며, 역해킹의 윤리적 고려 사항과 잠재적인 법적 함의에 대해 강조할 것입니다."
    ],
    "commentSummary": [
      "한 남성이 아내가 피해를 입은 후 USPS 문자 사기 작전에 보복하며 자신의 행동을 smithsecurity.biz에 공유했다.",
      "논의에는 역해킹의 윤리, 사이버 범죄에 대한 법 집행의 효과, 자경단 정의의 가능성에 대한 토론이 포함됩니다.",
      "댓글 작성자들은 또한 향상된 사이버 보안 조치의 필요성과 컴퓨터 과학 교육에서 윤리의 중요성에 대해 논의했습니다."
    ],
    "points": 309,
    "commentCount": 212,
    "retryCount": 0,
    "time": 1723158021
  },
  {
    "id": 41195225,
    "title": "CPython에서 함수 호출의 최근 성능 향상",
    "originLink": "https://blog.codingconfessions.com/p/are-function-calls-still-slow-in-python",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41195225",
    "commentBody": "",
    "originSummary": [
      "최근 CPython의 최적화로 함수 호출, 내장 함수, 인라이닝의 성능이 크게 향상되어 Python이 더 빠르고 효율적으로 되었습니다.",
      "주요 개선 사항에는 슈퍼 명령어 도입, 바이트코드 명령어 특수화, 내장 함수에 대한 벡터콜 메서드가 포함됩니다.",
      "벤치마크는 간단한 계산, 내장 함수 호출 및 Python 함수 호출 오버헤드 감소에서 눈에 띄는 성능 향상을 보여줍니다."
    ],
    "commentSummary": [
      "최근 CPython의 성능 향상, 특히 함수 호출에서 주목받고 있으며, Python 3.11 이후의 변경 사항이 C 수준의 함수 호출을 피함으로써 실행 속도를 향상시키고 있습니다.",
      "이 논의는 성숙한 생태계 덕분에 과학 컴퓨팅에서의 Python의 역할을 강조하며, 성능에 대한 비판에도 불구하고 Go와 같은 언어와 대조적으로 특정 작업에 대한 포괄적인 라이브러리가 부족하다는 점을 지적합니다.",
      "토론에는 개발 속도와 C/C++ 라이브러리와의 통합 용이성 때문에 Python을 사용하는 관점과 성능이 중요한 응용 프로그램에 대해 Rust나 Julia와 같은 다른 언어의 잠재적 이점에 대한 관점이 포함됩니다."
    ],
    "points": 194,
    "commentCount": 124,
    "retryCount": 0,
    "time": 1723145016
  },
  {
    "id": 41195124,
    "title": "인텔의 빈곤화",
    "originLink": "https://thechipletter.substack.com/p/intels-immiseration",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41195124",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "인텔의 쇠퇴는 내부 문제, 부실한 브랜드 관리, 그리고 혁신 부족 때문이며, 특히 울트라북, 셀러론 프로세서, GPU 사업에서 구체적인 문제가 있다.",
      "인텔 CPU의 비효율적인 전력 관리로 인해 노트북 성능이 저하되었으며, 이는 AMD와 ARM과의 경쟁에서 회사가 뒤처지게 만든 요인 중 하나입니다.",
      "인텔의 내부 문화는 독성이 강하고 부서 간의 소통이 단절되어 있으며, 혁신보다는 정치적 책략에 중점을 두고 있어, 상당한 문화적 및 전략적 변화가 필요하다고 묘사됩니다."
    ],
    "points": 180,
    "commentCount": 198,
    "retryCount": 0,
    "time": 1723144309
  },
  {
    "id": 41195584,
    "title": "애플은 미국의 반도체 문제이다",
    "originLink": "https://www.semiconductor-digest.com/apple-is-americas-semiconductor-problem/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41195584",
    "commentBody": "",
    "originSummary": [
      "2022년 반도체법(CHIPS Act)은 반도체 칩 제조를 미국으로 다시 가져오기 위해 도입되었으며, 코로나 시대의 부족으로 드러난 국제 공급망 의존 문제를 해결하고자 합니다.",
      "1990년에 미국은 세계 반도체의 37%를 생산했지만, 2020년에는 12%로 감소했습니다. 애플은 생산을 동아시아로 이전함으로써 이 감소에 중요한 역할을 했습니다.",
      "일부 국내에서 칩을 조달하려는 노력에도 불구하고, 애플은 여전히 외국 공급업체에 크게 의존하고 있으며, 법무부는 CHIPS 법안의 목표를 지원하기 위해 애플의 독점적 관행을 조사하고 있습니다."
    ],
    "commentSummary": [
      "애플의 반도체 시장 지배력은 비판받고 있지만, 그 주장은 약하고 편향된 것으로 인식된다.",
      "진짜 문제는 애플의 아웃소싱 관행이 아니라 다른 회사들이 애플의 규모로 혁신하지 않는 시장 실패라는 점이 강조되고 있습니다.",
      "이 기사는 중국 공장의 열악한 근로 조건과 더 많은 국내 경쟁의 필요성과 같은 더 넓은 문제를 다루고 있지만, 인텔과 퀄컴과 같은 다른 주요 업체에 대해서는 언급하지 않습니다."
    ],
    "points": 170,
    "commentCount": 225,
    "retryCount": 0,
    "time": 1723147220
  },
  {
    "id": 41198491,
    "title": "소닉 파이: 작곡 도구로서의 루비",
    "originLink": "https://bhmt.dev/blog/sonic_pi/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41198491",
    "commentBody": "",
    "originSummary": [
      "소닉 파이(Sonic Pi)는 코드로 제어되는 소프트웨어 신시사이저로, 샘 아론(Sam Aaron)이 만들었으며, 음악과 오디오 개념을 매핑하기 위해 루비(Ruby)를 확장한 도메인 특화 언어를 사용합니다.",
      "이 도구는 사용자가 코드를 작성하여 음악을 작곡할 수 있게 하여, 프로그래밍과 오디오 엔지니어링의 독특한 교차점을 이루며, 두 분야에 관심이 있는 사람들에게 이상적입니다.",
      "소닉 파이는 `in_thread`를 사용한 병렬 실행과 `live_loop`를 사용한 연속 루프와 같은 고급 기능을 지원하여 코딩을 통해 복잡한 음악 작곡을 가능하게 합니다."
    ],
    "commentSummary": [
      "루비를 사용하여 라이브 코딩 음악을 만드는 도구인 소닉 파이는 거의 영어와 같은 문법과 역동적인 성능으로 주목받고 있습니다.",
      "라이브 코딩과 사운드 디자인에서 독특한 기능으로 언급되는 대안으로는 Glicol과 TidalCycles, 그리고 Strudel이라는 JavaScript 포트가 있습니다.",
      "소닉 파이는 플랫허브에서 플랫팩으로 제공되어 리눅스 시스템에서 설치를 간소화하고 종속성 문제에 대한 우려를 해결합니다."
    ],
    "points": 168,
    "commentCount": 17,
    "retryCount": 0,
    "time": 1723172928
  },
  {
    "id": 41197950,
    "title": "스타트업 CEO, 성폭행 신고로 인해 벤처캐피털 회사로부터 불이익 받았다고 주장",
    "originLink": "https://www.bloomberg.com/news/articles/2024-08-08/startup-ceo-says-vc-firm-punished-her-for-reporting-sex-assault",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41197950",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "한 스타트업 CEO는 한 임원을 성폭행으로 신고한 후 벤처 캐피털 회사가 자신에게 보복했다고 주장합니다.",
      "해커 뉴스 토론에서는 개인적인 인맥, 부실한 법률 자문, 그리고 집단 역학 등 기업이 고발된 임원을 보호하는 이유를 강조합니다.",
      "대화는 또한 고발자와 피고인 모두에게 있어 부정행위를 보고하는 것의 복잡성과 잠재적인 결과에 대해서도 다룹니다."
    ],
    "points": 166,
    "commentCount": 62,
    "retryCount": 0,
    "time": 1723165709
  },
  {
    "id": 41203306,
    "title": "LLM 지원 OCR (LLM을 사용한 Tesseract OCR 오류 수정)",
    "originLink": "https://github.com/Dicklesworthstone/llm_aided_ocr",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41203306",
    "commentBody": "",
    "originSummary": [
      "처음에는 Tesseract OCR을 개선하기 위해 Llama2를 사용하던 프로젝트가 OpenAI의 GPT4o-mini와 Anthropic의 Claude3-Haiku와 같은 더 빠르고 저렴한 모델의 등장으로 발전했습니다.",
      "새로운 모델은 텍스트를 조각으로 나누고 다단계 교정 과정을 사용하여 효율적이고 비용 효율적인 문서 처리를 가능하게 하며, OCR 오류 수정 및 텍스트 재포맷팅을 크게 개선합니다.",
      "이 프로젝트는 오래된 스캔된 책을 읽을 수 있는 형식으로 변환하는 데 있어 인상적인 결과를 보여주며, 내년에 더 많은 개선 가능성을 보여줍니다."
    ],
    "commentSummary": [
      "처음에는 Tesseract OCR의 오류를 수정하기 위해 Llama2를 사용하던 프로젝트가 이제는 더 저렴하고 효율적인 GPT4o-mini와 Claude3-Haiku와 같은 최신의 더 빠른 모델로 발전했습니다.",
      "프로젝트의 다단계 접근 방식은 OCR 오류를 수정하고 텍스트를 형식화하여 오래된 스캔된 책을 전자책 리더용 읽기 가능한 형식으로 변환하는 데 유용합니다.",
      "과학 논문 및 송장과 같은 특정 문서 유형의 경우 Meta의 Nougat 및 Donut과 같은 모델이 우수한 성능을 제공합니다. 이 프로젝트는 오픈 소스이며 GitHub에서 이용할 수 있습니다."
    ],
    "points": 130,
    "commentCount": 71,
    "retryCount": 0,
    "time": 1723220919
  },
  {
    "id": 41196554,
    "title": "국립공원관리청, 4WD 전용 도로에서 AWD 운전자에게 벌금 부과 예정",
    "originLink": "https://jalopnik.com/national-park-service-will-cite-drivers-of-awd-cars-for-1851617315",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41196554",
    "commentBody": "",
    "originSummary": [
      "한 스바루 크로스트렉 소유자가 캐니언랜즈 국립공원에서 4WD 전용 도로를 주행하다가 경고를 받았는데, 이는 AWD와 4WD의 차이를 강조하는 사례입니다.",
      "AWD는 가벼운 오프로드 주행에 적합하지만, 잠금 차동 장치를 갖춘 4WD 시스템의 오프로드 견인력은 부족하여 도전적인 트레일에는 적합하지 않습니다.",
      "국립공원관리청은 방문객의 안전을 보장하기 위해 이러한 제한을 시행하며, 위반 시 최대 $5,000의 벌금과 징역형이 부과될 수 있습니다."
    ],
    "commentSummary": [
      "국립공원관리청(NPS)은 사륜구동(4WD) 차량 전용으로 지정된 트레일에서 전륜구동(AWD) 차량을 사용하는 운전자에게 벌금을 부과할 것입니다.",
      "이 조치는 AWD 차량이 잠금 차동장치와 같은 필수 기능이 부족함에도 불구하고, 도전적인 오프로드 조건에 적합하다는 오해의 소지가 있는 마케팅을 다룹니다.",
      "국립공원관리청(NPS)은 도로의 손상을 방지하고 운전자의 안전을 보장하기 위해 AWD와 4WD 기능의 중요한 차이를 강조합니다."
    ],
    "points": 127,
    "commentCount": 241,
    "retryCount": 0,
    "time": 1723152833
  },
  {
    "id": 41198422,
    "title": "SQLite FTS5 확장",
    "originLink": "https://www.sqlite.org/fts5.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41198422",
    "commentBody": "",
    "originSummary": [
      "SQLite의 FTS5(Full-Text Search 5) 확장은 데이터베이스 애플리케이션에 고급 전체 텍스트 검색 기능을 제공하여 대규모 문서 컬렉션에서 효율적인 검색을 가능하게 합니다.",
      "FTS5는 접두사 쿼리, NEAR 쿼리 및 불리언 연산자를 포함한 다양한 쿼리 유형을 지원하여 검색의 유연성과 정밀성을 향상시킵니다.",
      "확장은 SQLite의 일부로 구축되거나 로드 가능한 확장으로 구축될 수 있어 개발자에게 다양한 통합 옵션을 제공합니다."
    ],
    "commentSummary": [
      "SQLite FTS5 확장은 추가 설치 없이 Python 표준 라이브러리에 포함된 강력한 검색 엔진입니다.",
      "이는 지역 코드 검색 도구와 블로그 검색 엔진에 널리 사용되지만, 사용자 정의 토크나이저를 지원함에도 불구하고 비영어권 언어에서는 한계가 있습니다.",
      "사용자들은 모바일 플랫폼에서도 그 성능을 높이 평가하며, 맞춤형 토크나이저와 보조 기능을 통해 고급 사용 사례에 맞게 성능을 향상시킬 수 있습니다."
    ],
    "points": 122,
    "commentCount": 43,
    "retryCount": 0,
    "time": 1723171758
  },
  {
    "id": 41197277,
    "title": "미국 산림청, 애로우헤드 생수에 캘리포니아 파이프라인 폐쇄 명령",
    "originLink": "https://www.latimes.com/environment/story/2024-08-07/arrowhead-bottled-water-permit",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41197277",
    "commentBody": "",
    "originSummary": [
      "미국 산림청은 블루트리톤 브랜드의 허가 신청을 거부한 후, 샌버나디노 산맥에서의 물 추출 작업을 중단하라고 명령했습니다.",
      "환경 운동가들은 이 운영이 환경에 해를 끼쳤다고 주장하며 소송을 제기했지만, BlueTriton은 이러한 주장에 이의를 제기하고 법원에서 결정을 다투고 있다.",
      "삼림청의 명령에는 연방 토지에서 모든 인프라를 제거하는 것이 포함되지만, BlueTriton은 San Manuel 인디언 부족에게 물을 계속 공급하기 위해 일시적인 유예를 확보했습니다."
    ],
    "commentSummary": [
      "미국 산림청은 유효한 허가 없이 운영하고 허가되지 않은 용도로 물을 사용한 이유로 Arrowhead 생수의 캘리포니아 파이프라인을 폐쇄하라고 명령했습니다.",
      "이 결정은 Save Our Forest 협회의 소송과 반복된 준수 요청에 따른 것이며, 캘리포니아 수자원 위원회도 중지 명령을 내렸습니다.",
      "비평가들은 BlueTriton이 최근에 추출된 물을 병에 담지 않았음에도 불구하고 연간 2,500달러의 허가 수수료가 환경적 영향을 고려할 때 너무 낮다고 주장합니다."
    ],
    "points": 122,
    "commentCount": 19,
    "retryCount": 0,
    "time": 1723157817
  },
  {
    "id": 41201922,
    "title": "3진법 컴퓨팅이 이진법을 능가하다",
    "originLink": "https://www.quantamagazine.org/how-base-3-computing-beats-binary-20240809/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41201922",
    "commentBody": "",
    "originSummary": [
      "3진법 컴퓨팅, 또는 삼진법은 세 자리 숫자(0, 1, 2)를 사용하며, 이진법보다 더 효율적입니다. 두 개의 삼진법 '트릿'은 두 개의 이진법 비트가 네 개의 숫자를 나타낼 수 있는 것에 비해 아홉 개의 숫자를 나타낼 수 있습니다.",
      "삼진법 컴퓨팅은 큰 수에 대해 낮은 기수 경제성을 가지며, 가장 경제적인 정수 기수가 됩니다. 또한 세 가지 가능한 결과로 질문에 답할 수 있어 필요한 쿼리 수를 줄일 수 있습니다.",
      "효율성에도 불구하고 삼진 컴퓨팅은 이진 하드웨어와 소프트웨어의 지배로 인해 널리 사용되지 않았지만, 최근의 발전은 낮은 오류율로 사이버 보안에서 잠재적인 응용 가능성을 시사합니다."
    ],
    "commentSummary": [
      "이 기사는 널리 사용되는 이진법(기수 2) 시스템과 비교하여 삼진법(기수 3) 컴퓨팅의 잠재력에 대해 논의하며, 삼진 회로의 복잡성과 실질적인 도전에 대해 강조하고 있습니다.",
      "이론적으로 정보 밀도에서의 장점에도 불구하고, 삼진 컴퓨팅은 전력 소비 증가, 노이즈 민감성, 하드웨어 복잡성 등의 중요한 문제에 직면해 있어 이진 시스템보다 실현 가능성이 낮습니다.",
      "역사적 맥락이 제공되며, 소련이 삼진법 시스템을 실험했지만 실용적인 고려 사항과 미국 우주 경쟁에서 이진법 컴퓨팅의 성공이 이진 논리의 지배로 이어졌음을 언급하고 있다."
    ],
    "points": 106,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1723212079
  },
  {
    "id": 41195271,
    "title": "첫 번째 비스마트 AI 펜던트 (NotFriend)",
    "originLink": "https://notfriend.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41195271",
    "commentBody": "",
    "originSummary": [
      "NotFriend는 기능적인 목적이 전혀 없는 플라스틱 원형이지만 패션 액세서리로 마케팅되고 있습니다.",
      "비할 데 없는 단순함, 시대를 초월한 디자인, 그리고 친환경성을 자랑하며, 독특한 대화의 시작점이 됩니다.",
      "이 제품은 고객 리뷰와 평생 보증을 통해 유머러스하게 소개되며, 그 독창성과 비기능적인 특성을 강조합니다."
    ],
    "commentSummary": [
      "첫 번째 비스마트 AI 펜던트(NotFriend)는 최근 출시된 AI 웨어러블인 Friend를 패러디한 것으로, 이 제품은 불쾌하고 민망하다는 비판을 받고 있습니다.",
      "Friend 제품의 홍보 영상은 찾기 어려웠고 어두운 공포 영화 같은 분위기로 묘사되었으며, 도메인 이름이 180만 달러에 달해 기술 사기에 대한 논란을 불러일으켰습니다.",
      "NotFriend 패러디는 그 유머와 타이밍으로 인해 좋은 반응을 얻었으며, 기술 커뮤니티 내의 회의론과 유머를 강조하고 있습니다."
    ],
    "points": 96,
    "commentCount": 46,
    "retryCount": 0,
    "time": 1723145388
  },
  {
    "id": 41195988,
    "title": "GPUDrive: 데이터 기반, 멀티 에이전트 운전 시뮬레이션, 1M FPS에서 실행",
    "originLink": "https://arxiv.org/abs/2408.01584",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41195988",
    "commentBody": "",
    "originSummary": [
      "GPUDrive는 Madrona 게임 엔진을 기반으로 구축된 GPU 가속 시뮬레이터로, 다중 에이전트 학습 알고리즘을 위해 초당 백만 스텝 이상을 생성할 수 있습니다.",
      "이는 C++와 CUDA를 사용하여 복잡한 에이전트 행동을 최적화하며, Waymo Motion 데이터셋을 사용하여 강화 학습 에이전트를 훈련하는 데 필요한 시간을 크게 줄입니다.",
      "시뮬레이터는 몇 분 만에 목표 도달 에이전트를 달성하고 일반적으로 몇 시간 만에 유능한 에이전트를 달성하며, 추가 연구 및 개발을 위해 코드 베이스에서 훈련된 에이전트를 사용할 수 있습니다."
    ],
    "commentSummary": [
      "GPUDrive는 소비자용 GPU에서 초당 100만 프레임(FPS)으로 수백 개의 AI 에이전트를 사용한 운전 시뮬레이션을 가능하게 하며, Python 바인딩, Pytorch 및 Jax 래퍼, MIT 라이선스를 특징으로 합니다.",
      "높은 프레임 속도는 초당 4.5시간 이상의 시뮬레이션을 가능하게 하여 자율 주행 AI 시스템의 학습 속도를 잠재적으로 가속화할 수 있습니다.",
      "시뮬레이션은 주로 위치 데이터를 사용하지만 다양한 '파싱된' 센서 입력을 지원하며, LIDAR 데이터가 실제인지 합성인지 불분명합니다."
    ],
    "points": 90,
    "commentCount": 9,
    "retryCount": 0,
    "time": 1723149621
  }
]
