[
  {
    "id": 41201555,
    "title": "Jake Seliger öldü",
    "originLink": "https://marginalrevolution.com/marginalrevolution/2024/08/jake-seliger-is-dead.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41201555",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Jake Seliger, Hacker News'te jseliger olarak bilinen, vefat etti ve topluluk üzerinde önemli bir etki bıraktı.",
      "O, özellikle kanserle mücadelesi ve ajanlık ile klinik deneyler hakkındaki görüşleri üzerine yaptığı kapsamlı blog yazıları nedeniyle takdir edildi.",
      "HN topluluğu derinden etkilendi, birçok kişi taziyelerini ileterek onun etkileyici yazıları üzerine düşünüyor."
    ],
    "points": 425,
    "commentCount": 77,
    "retryCount": 0,
    "time": 1723209543
  },
  {
    "id": 41199567,
    "title": "OTranscribe: Sesli röportajları yazıya dökmek için ücretsiz ve açık bir araç",
    "originLink": "https://otranscribe.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41199567",
    "commentBody": "",
    "originSummary": [
      "oTranscribe, kaydedilmiş röportajları yazıya dökmeyi kolaylaştıran, duraklatma, geri sarma ve ileri sarma için klavye kontrolleri ile masaüstü kullanımına yönelik tasarlanmış ücretsiz bir web uygulamasıdır.",
      "Uygulama, etkileşimli zaman damgaları, otomatik kaydetme ve dosyaları bilgisayarınızda tutarak gizlilik gibi özellikler içerir ve transkriptleri Markdown, düz metin ve Google Dokümanlar'a aktarmaya olanak tanır.",
      "Video dosyalarını destekler, MIT lisansı altında açık kaynaklıdır ve MuckRock Vakfı tarafından öne çıkarılan Elliot Bentley tarafından oluşturulmuştur."
    ],
    "commentSummary": [
      "OTranscribe, sesli röportajların manuel olarak transkripsiyonu için tasarlanmış, yapay zeka kullanmayan ücretsiz bir araçtır.",
      "Kullanıcılar, otomatik transkripsiyon ve konuşmacı tanımlama için Whisper Diarization ve Spectropic gibi alternatifleri ve daha hızlı işlem için Whisper.CPP gibi yerel çözümleri araştırıyor.",
      "İOS'ta çevrimdışı transkripsiyon için Aiko gibi araçlar ve konuşmacı tanıma ve çeşitli dışa aktarma formatları gibi ek özellikler sunan TurboScribe gibi hizmetler tartışmalara dahildir."
    ],
    "points": 330,
    "commentCount": 83,
    "retryCount": 0,
    "time": 1723188675
  },
  {
    "id": 41197300,
    "title": "USPS metin dolandırıcıları karısını kandırdı, bu yüzden onların operasyonunu hackledi",
    "originLink": "https://blog.smithsecurity.biz/hacking-the-scammers",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41197300",
    "commentBody": "",
    "originSummary": [
      "Bir kişi, s1n olarak anılan, nmap ve Burp Suite gibi araçları kullanarak sahte USPS sitesindeki açıkları istismar ederek dolandırıcılara karşılık verdi.",
      "S1n, bir Yerel Dosya Dahil Etme (LFI) açığı ve bir SQL enjeksiyonu zafiyeti tespit ederek dolandırıcıların veritabanına erişim sağladı ve yönetici ile kurban bilgilerini ortaya çıkardı.",
      "Orijinal gönderici, bulguları internet suçları yetkililerine bildirmeyi planlıyor ve geri hacklemenin etik hususlarını ve olası yasal sonuçlarını vurguluyor."
    ],
    "commentSummary": [
      "Bir adam, karısının kurbanı olduğu bir USPS metin dolandırıcılığı operasyonuna karşılık verdi ve eylemlerini smithsecurity.biz'de paylaştı.",
      "Tartışma, karşı saldırı yapmanın etiği, kolluk kuvvetlerinin siber suçlara karşı etkinliği ve kanunsuz adaletin potansiyeli üzerine tartışmaları içeriyor.",
      "Yorumcular ayrıca, geliştirilmiş siber güvenlik önlemlerine duyulan ihtiyaç ve bilgisayar bilimi eğitiminde etiğin önemi hakkında da tartıştılar."
    ],
    "points": 309,
    "commentCount": 212,
    "retryCount": 0,
    "time": 1723158021
  },
  {
    "id": 41195225,
    "title": "CPython'da Fonksiyon Çağrılarında Son Performans İyileştirmeleri",
    "originLink": "https://blog.codingconfessions.com/p/are-function-calls-still-slow-in-python",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41195225",
    "commentBody": "",
    "originSummary": [
      "CPython'daki son optimizasyonlar, fonksiyon çağrıları, yerleşik fonksiyonlar ve satır içi kodlama performansını önemli ölçüde artırarak Python'u daha hızlı ve verimli hale getirdi.",
      "Önemli iyileştirmeler arasında süper talimatların tanıtılması, bayt kodu talimat özelleştirmesi ve yerleşik fonksiyonlar için vectorcall yönteminin eklenmesi yer almaktadır.",
      "Karşılaştırmalar, basit hesaplamalarda, yerleşik fonksiyonları çağırmada ve Python fonksiyon çağrısı yükünü azaltmada dikkate değer performans artışları gösteriyor."
    ],
    "commentSummary": [
      "CPython'daki son performans iyileştirmeleri, özellikle fonksiyon çağrılarında, dikkat çekti ve Python 3.11'den bu yana yapılan değişiklikler, C düzeyindeki fonksiyon çağrılarını önleyerek yürütme hızını artırdı.",
      "Bu tartışma, performans eleştirilerine rağmen olgun ekosistemi nedeniyle Python'un bilimsel hesaplamadaki rolünü vurguluyor ve belirli görevler için kapsamlı kütüphanelerden yoksun olan Go gibi dillerle karşılaştırıyor.",
      "Tartışma, Python'un geliştirme hızı ve C/C++ kütüphaneleriyle entegrasyon kolaylığı açısından kullanılması ile performans açısından kritik uygulamalar için Rust veya Julia gibi diğer dillerin potansiyel faydaları arasındaki bakış açılarını içeriyor."
    ],
    "points": 194,
    "commentCount": 124,
    "retryCount": 0,
    "time": 1723145016
  },
  {
    "id": 41195124,
    "title": "Intel'in Yoksullaşması",
    "originLink": "https://thechipletter.substack.com/p/intels-immiseration",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41195124",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Intel'in düşüşü, iç sorunlar, zayıf marka yönetimi ve yenilik eksikliğinden kaynaklanmaktadır. Özellikle Ultrabook'lar, Celeron işlemciler ve GPU iş kolunda belirli problemler yaşanmaktadır.",
      "Intel CPU'larındaki verimsiz güç yönetimi, dizüstü bilgisayarların performansının düşük olmasına yol açtı ve bu durum, şirketin AMD ve ARM ile rekabet edememesine katkıda bulundu.",
      "Intel'deki iç kültür, yenilikten ziyade siyasi manevralara odaklanarak zehirli ve bölünmüş olarak tanımlanıyor, bu da önemli kültürel ve stratejik değişiklikler gerektiriyor."
    ],
    "points": 180,
    "commentCount": 198,
    "retryCount": 0,
    "time": 1723144309
  },
  {
    "id": 41195584,
    "title": "Apple, Amerika'nın yarı iletken sorunudur",
    "originLink": "https://www.semiconductor-digest.com/apple-is-americas-semiconductor-problem/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41195584",
    "commentBody": "",
    "originSummary": [
      "2022 CHIPS Yasası, Covid dönemi kıtlıklarıyla ortaya çıkan uluslararası tedarik zincirlerine bağımlılığı ele alarak yarı iletken çip üretimini ABD'ye geri getirmek için tanıtıldı.",
      "1990 yılında ABD, dünya çiplerinin %37'sini üretiyordu, ancak bu oran 2020'ye gelindiğinde %12'ye düştü ve Apple, üretimi Doğu Asya'ya kaydırarak bu düşüşte önemli bir rol oynadı.",
      "Apple, çipleri yerel olarak temin etme çabalarına rağmen, yabancı tedarikçilere büyük ölçüde bağımlı olmaya devam ediyor ve Adalet Bakanlığı, CHIPS Yasası'nın hedeflerini desteklemek için tekelci uygulamalarını araştırıyor."
    ],
    "commentSummary": [
      "Apple'ın yarı iletken pazarındaki hakimiyeti eleştiriliyor, ancak bu argümanlar zayıf ve taraflı olarak algılanıyor.",
      "Vurgulanan asıl sorun, Apple'ın dış kaynak kullanımı uygulamalarından ziyade, diğer şirketlerin Apple'ın ölçeğinde yenilik yapmamasıyla ilgili bir piyasa başarısızlığıdır.",
      "Makale, Çin fabrikalarındaki kötü çalışma koşulları ve daha fazla yerli rekabet ihtiyacı gibi daha geniş konulara değiniyor, ancak Intel ve Qualcomm gibi diğer önemli oyuncuları ele almıyor."
    ],
    "points": 170,
    "commentCount": 225,
    "retryCount": 0,
    "time": 1723147220
  },
  {
    "id": 41198491,
    "title": "Sonic Pi: Bir Kompozisyon Aracı Olarak Ruby",
    "originLink": "https://bhmt.dev/blog/sonic_pi/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41198491",
    "commentBody": "",
    "originSummary": [
      "Sonic Pi, Sam Aaron tarafından oluşturulan ve müzik ile ses kavramlarını haritalamak için Ruby'yi genişleten bir alan özel dili kullanan, kodla kontrol edilen bir yazılım sentezleyicisidir.",
      "Bu araç, kullanıcıların kod yazarak müzik bestelemesine olanak tanır ve programlama ile ses mühendisliğinin benzersiz bir kesişimini oluşturur, her iki alana da ilgi duyanlar için idealdir.",
      "Sonic Pi, kodlama yoluyla karmaşık müzikal kompozisyonları mümkün kılan `in_thread` ile paralel yürütme ve `live_loop` ile sürekli döngüler gibi gelişmiş özellikleri destekler."
    ],
    "commentSummary": [
      "Sonic Pi, müzik için canlı kodlama yapan ve Ruby kullanan bir araç olarak, neredeyse İngilizce benzeri sözdizimi ve dinamik performans yetenekleriyle dikkat çekiyor.",
      "Glicol ve TidalCycles gibi alternatifler ile Strudel adlı bir JavaScript portu da canlı kodlama ve ses tasarımındaki benzersiz özellikleriyle anılmaktadır.",
      "Sonic Pi, bağımlılık sorunlarıyla ilgili endişeleri gidererek Linux sistemlerine kurulumunu basitleştiren Flathub'da bir Flatpak olarak mevcuttur."
    ],
    "points": 168,
    "commentCount": 17,
    "retryCount": 0,
    "time": 1723172928
  },
  {
    "id": 41197950,
    "title": "Startup CEO'su, girişim sermayesi firmasının cinsel saldırıyı bildirdiği için kendisini cezalandırdığını söyledi",
    "originLink": "https://www.bloomberg.com/news/articles/2024-08-08/startup-ceo-says-vc-firm-punished-her-for-reporting-sex-assault",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41197950",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Bir girişim CEO'su, bir yöneticinin cinsel saldırısını bildirdikten sonra bir risk sermayesi firmasının kendisine misilleme yaptığını iddia ediyor.",
      "Hacker News tartışmaları, firmaların suçlanan yöneticileri koruma nedenlerini vurguluyor; bunlar arasında kişisel bağlantılar, kötü hukuk danışmanlığı ve grup dinamikleri yer alıyor.",
      "Konuşma, hem suçlayıcı hem de suçlanan için suistimali bildirme konusundaki karmaşıklıkları ve olası sonuçları da ele alıyor."
    ],
    "points": 166,
    "commentCount": 62,
    "retryCount": 0,
    "time": 1723165709
  },
  {
    "id": 41203306,
    "title": "LLM Destekli OCR (Tesseract OCR Hatalarını LLM'ler ile Düzeltme)",
    "originLink": "https://github.com/Dicklesworthstone/llm_aided_ocr",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41203306",
    "commentBody": "",
    "originSummary": [
      "Başlangıçta Tesseract OCR'yi geliştirmek için Llama2 kullanan bir proje, OpenAI'nin GPT4o-mini ve Anthropic'in Claude3-Haiku gibi daha hızlı ve uygun fiyatlı modellerin kullanılabilirliği ile evrildi.",
      "Yeni modeller, metni parçalara ayırarak ve çok aşamalı bir düzeltme süreci kullanarak verimli ve maliyet etkin belge işleme olanağı sağlar, bu da OCR hata düzeltme ve metin yeniden biçimlendirmeyi önemli ölçüde iyileştirir.",
      "Proje, eski taranmış kitapları okunabilir formatlara dönüştürmede etkileyici sonuçlar sergiliyor ve gelecek yıl için daha fazla iyileştirme potansiyeli gösteriyor."
    ],
    "commentSummary": [
      "Başlangıçta Tesseract OCR'yi hataları düzelterek geliştirmek için Llama2 kullanan bir proje, şimdi daha yeni, daha hızlı ve uygun maliyetli modeller olan GPT4o-mini ve Claude3-Haiku ile evrildi.",
      "Projede kullanılan çok aşamalı yaklaşım, OCR hatalarını düzeltir ve metni biçimlendirir, bu da eski taranmış kitapları e-okuyucular için okunabilir formatlara dönüştürmeyi faydalı hale getirir.",
      "Belirli belge türleri için, bilimsel makaleler ve faturalar gibi, Meta'nın Nougat ve Donut gibi modelleri üstün performans sunar; proje açık kaynaklıdır ve GitHub'da mevcuttur."
    ],
    "points": 130,
    "commentCount": 71,
    "retryCount": 0,
    "time": 1723220919
  },
  {
    "id": 41196554,
    "title": "Ulusal Park Servisi, Sadece 4 Çeker Araçlar İçin Olan Yollarda AWD Sürücülerine Ceza Verecek",
    "originLink": "https://jalopnik.com/national-park-service-will-cite-drivers-of-awd-cars-for-1851617315",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41196554",
    "commentBody": "",
    "originSummary": [
      "Bir Subaru Crosstrek sahibi, Canyonlands Ulusal Parkı'nda sadece 4WD araçların kullanabileceği bir yolda sürüş yaptığı için uyarı aldı ve bu durum AWD ile 4WD arasındaki farkı gözler önüne serdi.",
      "AWD hafif arazi sürüşü için uygundur ancak zorlu parkurlar için gerekli olan kilitli diferansiyellere sahip 4WD sistemlerinin arazi çekişinden yoksundur.",
      "Ulusal Park Servisi, ziyaretçilerin güvenliğini sağlamak için bu kısıtlamaları uygular ve ihlaller için 5.000 dolara kadar para cezası ve hapis cezası gibi yaptırımlar öngörür."
    ],
    "commentSummary": [
      "NPS (Ulusal Park Hizmeti), yalnızca Dört Tekerlekten Çekiş (4WD) araçlar için belirlenmiş yollarda Tüm Tekerlekten Çekiş (AWD) araçları kullanan sürücülere ceza verecektir.",
      "Bu eylem, kilitli diferansiyel gibi temel özelliklerden yoksun olmasına rağmen AWD araçların zorlu arazi koşullarına uygun olduğunu öne süren yanıltıcı pazarlamayı ele alıyor.",
      "NPS, yolları hasardan korumayı ve sürücülerin güvenliğini sağlamayı amaçlayarak AWD ve 4WD yetenekleri arasındaki kritik farkı vurgulamaktadır."
    ],
    "points": 127,
    "commentCount": 241,
    "retryCount": 0,
    "time": 1723152833
  },
  {
    "id": 41198422,
    "title": "SQLite FTS5 Uzantısı",
    "originLink": "https://www.sqlite.org/fts5.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41198422",
    "commentBody": "",
    "originSummary": [
      "SQLite'ın FTS5 (Tam Metin Arama 5) uzantısı, veritabanı uygulamaları için gelişmiş tam metin arama yetenekleri sunar ve büyük belge koleksiyonları arasında verimli aramalar yapılmasına olanak tanır.",
      "FTS5, arama esnekliğini ve hassasiyetini artıran önek sorguları, YAKIN sorguları ve boolean operatörleri de dahil olmak üzere çeşitli sorgu türlerini destekler.",
      "Uzantı, SQLite'ın bir parçası olarak veya yüklenebilir bir uzantı olarak inşa edilebilir ve bu da geliştiricilere birden fazla entegrasyon seçeneği sunar."
    ],
    "commentSummary": [
      "SQLite FTS5 Uzantısı, ek kurulumlara gerek kalmadan Python standart kütüphanesine dahil edilen güçlü bir arama motorudur.",
      "Yerel kod arama araçları ve blog arama motorları için yaygın olarak kullanılır, ancak özel belirteçleyicileri desteklemesine rağmen İngilizce olmayan dillerde sınırlamaları vardır.",
      "Kullanıcılar, mobil platformlarda bile performansını takdir ediyor ve gelişmiş kullanım durumları için özel ayrıştırıcılar ve yardımcı işlevlerle geliştirilebiliyor."
    ],
    "points": 122,
    "commentCount": 43,
    "retryCount": 0,
    "time": 1723171758
  },
  {
    "id": 41197277,
    "title": "Orman Hizmetleri, Arrowhead şişelenmiş su şirketine Kaliforniya boru hattını kapatma emri verdi",
    "originLink": "https://www.latimes.com/environment/story/2024-08-07/arrowhead-bottled-water-permit",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41197277",
    "commentBody": "",
    "originSummary": [
      "ABD Orman Hizmetleri, BlueTriton Brands'in izin başvurusunu reddettikten sonra San Bernardino Dağları'ndaki su çıkarma operasyonlarını durdurmasını emretti.",
      "Çevre aktivistleri, operasyonların çevreye zarar verdiğini iddia ederek dava açarken, BlueTriton bu iddialara itiraz ediyor ve karara mahkemede itiraz etti.",
      "Orman Hizmetleri'nin emri, federal araziden tüm altyapının kaldırılmasını içeriyor, ancak BlueTriton, San Manuel Band of Mission Indians'a su tedarik etmeye devam etmek için geçici bir durdurma kararı aldı."
    ],
    "commentSummary": [
      "Orman Hizmetleri, geçerli bir izin olmadan faaliyet gösterdiği ve izin verilmeyen amaçlar için su kullandığı gerekçesiyle Arrowhead şişelenmiş su şirketine Kaliforniya boru hattını kapatma emri verdi.",
      "Karar, Ormanlarımızı Koruyalım Derneği tarafından açılan bir dava ve tekrarlanan uyum taleplerinin ardından alındı, ayrıca Kaliforniya su kurulu da durdurma ve vazgeçme emri verdi.",
      "Eleştirmenler, BlueTriton'un son zamanlarda herhangi bir çıkarılmış suyu şişelememesine rağmen, yıllık 2.500 dolarlık izin ücretinin çevresel etki göz önüne alındığında çok düşük olduğunu savunuyorlar."
    ],
    "points": 122,
    "commentCount": 19,
    "retryCount": 0,
    "time": 1723157817
  },
  {
    "id": 41201922,
    "title": "Üç Tabanlı Hesaplama İkiliyi Geçiyor",
    "originLink": "https://www.quantamagazine.org/how-base-3-computing-beats-binary-20240809/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41201922",
    "commentBody": "",
    "originSummary": [
      "Üç tabanlı hesaplama veya üçlü sistem, üç rakam (0, 1, 2) kullanır ve ikili sistemden daha verimlidir, çünkü iki üçlü \"trit\" dokuz sayıyı temsil edebilirken, iki ikili bit dört sayıyı temsil edebilir.",
      "Ternary hesaplama, büyük sayılar için daha düşük bir taban ekonomisine sahiptir, bu da onu en ekonomik tam sayı tabanı yapar ve üç olası sonuçla soruları yanıtlayabilir, bu da gereken sorgu sayısını azaltır.",
      "Verimliliğine rağmen, üçlü hesaplama, ikili donanım ve yazılımın hakimiyeti nedeniyle hiçbir zaman yaygın kullanım kazanmadı, ancak son gelişmeler, daha düşük hata oranlarıyla siber güvenlikte potansiyel uygulamalara işaret ediyor."
    ],
    "commentSummary": [
      "Makale, yaygın olarak kullanılan ikili (taban 2) sistemlere kıyasla üçlü (taban 3) hesaplamanın potansiyelini tartışıyor ve üçlü devrelerin karmaşıklıklarını ve pratik zorluklarını vurguluyor.",
      "Bilgi yoğunluğunda teorik avantajlara rağmen, üçlü hesaplama, artan güç tüketimi, gürültüye duyarlılık ve donanım karmaşıklığı gibi önemli sorunlarla karşı karşıya kalmaktadır, bu da onu ikili sistemlere göre daha az uygulanabilir kılmaktadır.",
      "Tarihsel bağlam sağlanarak, Sovyetler Birliği'nin üçlü sistemlerle denemeler yaptığı, ancak pratik kaygılar ve ABD'nin uzay yarışındaki ikili hesaplamadaki başarısının ikili mantığın hakimiyetine yol açtığı belirtilmektedir."
    ],
    "points": 106,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1723212079
  },
  {
    "id": 41195271,
    "title": "İlk Akıllı Olmayan AI Kolye (NotFriend)",
    "originLink": "https://notfriend.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41195271",
    "commentBody": "",
    "originSummary": [
      "NotFriend, işlevsel bir amacı olmayan ancak moda aksesuarı olarak pazarlanan plastik bir dairedir.",
      "Rakipsiz sadelik, zamansız tasarım ve çevre dostu özellikler gibi özellikleriyle övünür, bu da onu benzersiz bir sohbet başlatıcı yapar.",
      "Ürün, müşteri yorumları ve ömür boyu garanti ile mizahi bir şekilde sunulmuş olup, yenilikçi ve işlevsel olmayan doğasını vurgulamaktadır."
    ],
    "commentSummary": [
      "İlk Akıllı Olmayan AI Kolyesi (NotFriend), yakın zamanda piyasaya sürülen ve rahatsız edici ve utanç verici olduğu için eleştirilen AI giyilebilir cihazı Friend'in bir parodisidir.",
      "Friend ürününün tanıtım videosu bulması zor ve karanlık, korku benzeri bir tona sahip olarak tanımlandı ve alan adının 1,8 milyon dolara mal olduğu bildirildi, bu da teknoloji dolandırıcılıkları hakkında tartışmalara yol açtı.",
      "NotFriend parodisi, mizahı ve zamanlamasıyla beğeni topladı, teknoloji topluluğunda şüphecilik ve mizahı ön plana çıkardı."
    ],
    "points": 96,
    "commentCount": 46,
    "retryCount": 0,
    "time": 1723145388
  },
  {
    "id": 41195988,
    "title": "GPUDrive: Veri odaklı, çoklu ajanlı sürüş simülasyonu 1M FPS hızında",
    "originLink": "https://arxiv.org/abs/2408.01584",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41195988",
    "commentBody": "",
    "originSummary": [
      "GPUDrive, Madrona Oyun Motoru üzerine inşa edilmiş, çoklu ajan öğrenme algoritmaları için saniyede bir milyondan fazla adım üretebilen GPU hızlandırmalı bir simülatördür.",
      "Waymo Motion veri setini kullanarak pekiştirmeli öğrenme ajanlarını eğitmek için gereken süreyi önemli ölçüde azaltarak karmaşık ajan davranışlarını optimize etmek için C++ ve CUDA kullanır.",
      "Simülatör, dakikalar içinde hedefe ulaşan ajanlar ve saatler içinde genel olarak yetenekli ajanlar elde eder, eğitimli ajanlar ise daha fazla araştırma ve geliştirme için kod tabanında mevcuttur."
    ],
    "commentSummary": [
      "GPUDrive, Python bağlayıcıları, Pytorch ve Jax sarmalayıcıları ve MIT lisansı ile tüketici sınıfı GPU'larda saniyede 1 milyon kare (FPS) hızında yüzlerce yapay zeka ajanıyla sürüş simülasyonlarını mümkün kılar.",
      "Yüksek kare hızı, saniyede 4,5 saatten fazla simülasyon yapılmasına olanak tanır ve bu da otonom sürüş yapay zeka sistemleri için öğrenme hızını potansiyel olarak artırır.",
      "Simülasyon öncelikle konum verilerini kullanır, ancak çeşitli \"ayrıştırılmış\" sensör girişlerini destekler, ancak LIDAR verilerinin gerçek mi yoksa sentetik mi olduğu belirsizdir."
    ],
    "points": 90,
    "commentCount": 9,
    "retryCount": 0,
    "time": 1723149621
  }
]
