[
  {
    "id": 36264232,
    "timestamp": 1686345166,
    "title": "Reddit CEO doubles down on attack on Apollo developer in drama-filled AMA",
    "url": "https://techcrunch.com/2023/06/09/reddit-ceo-doubles-down-on-attack-on-apollo-developer-in-drama-filled-ama/",
    "hn_url": "http://news.ycombinator.com/item?id=36264232",
    "content": "AppsReddit CEO doubles down on attack on Apollo developer in drama-filled AMASarah Perez@sarahintampa / 2:12 PM PDT•June 9, 2023comment CommentcameraImage Credits: ShutterstockReddit’s unpopular decision to revise its API pricing in a move that’s forcing third-party apps out of business has taken a weird turn. In an AMA hosted today by Reddit co-founder and CEO Steve Huffman, aka u/spez on the internet forum site, the exec doubled down on accusations against the developer behind the well-liked third-party app Apollo, which the company had previously accused of operating inefficiently and not being a good “API” user.Despite community backlash — which includes a site-wide protest from thousands of communities known as subreddits — Huffman’s AMA confirmed the company has no plans to revise its coming API changes. What’s more, Huffman continued his accusations against Apollo, calling out the developer, Christian Selig’s, “behavior and communications” as being “all over the place” and saying he couldn’t see Reddit working with the developer further.Selig had been among the first to highlight that Reddit’s new API pricing would effectively make it impossible to continue to operate the Apollo app. He explained that, under the new terms, it would cost him $20 million per year to do so — money the app doesn’t make. This week, Selig announced the app’s last day would be June 30, ahead of the July 1 implementation of the new API pricing.Other third-party apps are also closing down, including Sync, RIF and Reddplant, to name a few.But Huffman seemingly has an ax to grind with Selig in particular, first accusing the developer of extortion, per Selig’s extensive post on the situation between himself and Reddit.According to Selig’s interpretation of the situation, he raised the question as to why Reddit was choosing to change its API terms to put third-party apps out of business rather than just buying them out, as the company did with Alien Blue (an older Reddit client that it acquired in 2014). He said that if Apollo was costing Reddit $20 million per year, Reddit should cut him a check to put an end to the app. The remark doesn’t sound like a serious ask from his telling. In fact, he clarified on the call, “…this is mostly a joke.”If anything, it comes across as a means of trying to understand why the company would make a move that’s sure to generate ill will among its wider community. (As it has.)A Reddit representative on a call with Selig, however, first seemingly interpreted his comment as a “threat,” Selig said. But on the call, they cleared up the misunderstanding and the contact apologized. Selig came with receipts — he recorded the call (which is legal where he’s based in Canada).But in a subsequent call with moderators, Huffman referred to this conversation as Selig “threatening” Reddit.That stance hasn’t softened on Reddit’s side, Huffman made clear today.In the AMA, one user asked Huffman to clarify, “what were you thinking with your attempt to discredit Apollo by claiming that Christian threatened and blackmailed you?”The response was surprising. Unlike most companies, which try to soften their blows behind corporate PR speak, Huffman answered rather plainly.“His ‘joke’ is the least of our issues,” the CEO wrote. “His behavior and communications with us has been all over the place—saying one thing to us while saying something completely different externally; recording and leaking a private phone call—to the point where I don’t know how we could do business with him.”It’s an odd turn of events for Apollo, whose iOS-first and user-friendly design just this week saw it featured during Apple’s Worldwide Developer Conference, ahead of Reddit’s API policy change that will now put it out of business.👀 Apollo with visionOS maybe? pic.twitter.com/EMjDQS7qZW— Christian Selig (@ChristianSelig) June 5, 2023Other prominent developers have come out in support of Selig following this debacle.Halide co-founder Sebastiaan de With tweeted on Thursday calling Selig “one of the nicest guys in our indie app world,” and said Reddit management was lying, slandering, and vilifying him. Others quote-tweeted and agreed.Absolutely horrible news. Not only is Apollo a great app, Reddit’s management is lying about, slandering and vilifying one of the nicest guys in our indie app world while unceremoniously killing off an app he worked on for many years. https://t.co/uDDnUX5hIW— Sebastiaan de With (@sdw) June 8, 2023Unless Reddit’s board chooses to intervene, it doesn’t seem that Huffman is concerned much about the fallout from these decisions, site-wide protest or not.In the AMA, he fended off a number of questions, politely phrased and not, from users upset over the API changes. These ranged from those questioning the model (why not a profit-sharing model like Epic does with Unreal?) and asking about the compressed timeframe to broader questions about Reddit’s shift to being more about profits than community engagement. (“We’ll continue to be profit-driven until profits arrive,” the CEO replied. “Unlike some of the 3P apps, we are not profitable.”)“Some apps, like Apollo, Reddit is Fun and Sync have decided this [API] pricing doesn’t work for their businesses and will close before pricing goes into effect,” Huffman explained. “For the other apps, we will continue talking. We acknowledge that the timeline we gave was tight; we are happy to engage with folks who want to work with us.”In the comments, though, ReddPlanet’s developer (u/lupeski, aka Tony Lupeski) said “this is a blatant lie,” noting that he had tried multiple times to get in contact with Reddit regarding these changes and had been ignored. Another indie app developer said they had filled out a request for Enterprise API access three times and had received no response.As for the rest of the AMA, there’s little more to report beyond what Reddit had already shared. The company is seemingly unmoved by the community backlash over its API changes and has no intention to delay or reconsider. It will still maintain its carve-out for a handful of accessibility-focused apps, as stated.Huffman also clarified that while The NYT piece positioned the API pricing changes as a way to limit access to its forums, which have become a training ground for large language models (LLMs), that’s not the only reason behind this move. The company is also spending “tens of millions of dollars” per year to support the third-party app ecosystem, and that needed to be reigned in. (And it’s in “active discussion” with companies using Reddit as training data for their AIs).The exec additionally noted that access to mature content will be limited via its Data API as of July 5, 2023, as part of a broader effort to provide additional guardrails under a “stricter” regulatory environment, but explicit content was still being allowed.An overview of the AMA in a more readable format is available on r/Save3rdPartyApps, a community that sprung up since the API changes were announced. The forum now has over 50,000 members.CopyTagsapiapolloAppsdevelopersReddit",
    "summary": "- Reddit CEO Steve Huffman continues to defend the company's unpopular decision to revise its API pricing, leading to the closure of third-party apps, including Apollo.\n- Huffman accused Christian Selig, the developer of Apollo, of operating inefficiently and not being a good \"API\" user, despite Selig's highlighting the new API pricing would make operating the Apollo app impossible.\n- The community backlash and protest from thousands of subreddits have not caused Huffman or Reddit any concern over the fallout from the API changes, and the company has no intention to delay or reconsider the decision.",
    "hn_title": "Reddit CEO doubles down on attack on Apollo developer in drama-filled AMA",
    "original_title": "Reddit CEO doubles down on attack on Apollo developer in drama-filled AMA",
    "score": 500,
    "hn_content": "Reddit CEO, Spez, faced drama-filled backlash in an AMA targeting the Apollo developer. The most difficult questions went unanswered by Reddit, leaving it in a worse position than if they just skipped the AMA. Some believe Reddit is trying to capitalize on business customers by providing its platform to train its AI models with. Due to pressure, Reddit is trying to meet profitability plans by IPO, although its user base is a fraction of Facebook or TikTok. Reddit is urged to take users into confidence and establish full transparency. It is hypothesized that Reddit plans on moving everyone to the official app, with the expectation of potential user backlash and implementation of tactics to manage it. Nonetheless, Reddit is a dysfunctional colossus with free labor from community moderators, threatened by the possibility of a move of some of its users elsewhere.The possibility of a mass exodus of moderators and power users leaving Reddit due to recent changes has sparked a debate. Some believe that new, inexperienced moderators will disrupt the site and drive longtime users away. Alternately, it is likely that new moderators will step in to fill the vacuum, and many addicted users will stick around. In addition, the poor user experience on the official Reddit app makes it unappealing for some users. However, it is argued that there is currently no real competition for Reddit in the social media space, and that Discord may be the closest competitor. Overall, the post highlights concerns about the stability and future of Reddit as a platform.Reddit users and moderators are upset about the company's decision to limit third-party app access to its API, leading to calls for a “Reddit competitor” that focuses on community, not just profits. Many users and moderators feel disillusioned with the company's focus on profits against genuine community engagement. The difficult issue of finding the right type of moderator for subreddits was discussed by users, with thoughts that there are too many moderators carrying out the task for free, devaluing the importance of the role. A recent AMA with Reddit CEO Steve Huffman left many dissatisfied, with many users asking the same questions about a lack of transparency and problems with moderation. A proposed solution by some is to create a non-profit foundation to run alternative forums that allow unfettered discussion.- A suggestion has been made to build a new Reddit that's run by a non-profit and (hopefully) stays off of variable cost infrastructure for stability.\n- Some commenters have pointed out that there have been similar platforms like USENET, but as forums and then platforms with easier access and better moderation tools took over, USENET became nothing but spam, only leaving alt.binaries.\n- Some users have suggested that Reddit could follow the Wikipedia model and raise funds via charity fundraising and clear goals to become self-sustaining as a non-profit organization.\n- The CEO's decision to shut down third-party apps has caused controversy and backlash among passionate users, and some critics have accused the board of lacking tact and making poor decisions.\n- Suggestions for monetizing Reddit include engaging with relevant businesses via affiliate links, coupons, and meaningful dialogue, as well as charging users for third-party clients or selling user data. \n- Good moderation is a scarce and valuable resource, with only a small percentage of users actively moderating subreddits. Losing experienced moderators could lead to subreddits becoming choked with off-topic posts, spam, porn, and toxic behavior.Reddit moderators are discussed in a recent post, with some commenters stating that moderation quality can suffer without domain knowledge in a particular subreddit. Others suggest that volunteer moderators can tend to be \"bossy scoundrels\" and amateur moderators in need of supervision, while one commenter suggests that moderators should be paid and anonymous. Additionally, several commenters express frustration with recent decisions made by Reddit, including the company's allegedly poor handling of a developer's concerns and recent updates that seem to prioritize short-term profit over long-term revenue. Finally, some users express confusion over Reddit's monetization strategy, especially with regards to Reddit Gold and premium subscriptions.Reddit users are criticizing the platform's leadership for prioritizing profit over its community members. Some longtime supporters of the site also feel disillusioned by their recent advertising choices, which seems to be promoting negative rather than community-driven content. They say that Reddit should have never taken VC money as their offerings to monetize have been lackluster. Although some users have supported the platform by paying for Reddit Gold and other rewards, they are now contemplating canceling their subscriptions, as they dislike seeing ads and supporting non-ad-based business models. Despite the criticism, the company plans to continue being profit-driven until they achieve profitability. Some users suggest that Reddit's rivals are ready to take its place, and they predict an incoming influx of alternatives to the platform.Reddit CEO, Steve Huffman, announced the recent changes to the API pricing and developers' access to user data. The announcement sparked backlash from the Reddit community, including accusations that Huffman lied about a conversation with a third-party app developer. The community criticized Huffman's response for lacking transparency and honesty. Some users shared their own experiences of being lied to by their employers. The discussions also highlighted the tension between community value and profitability, with some suggesting that investors prioritize short-term gains over community health. The importance of recording conversations to protect oneself was also discussed, with some suggesting that notes or transcripts could be sufficient evidence in some situations.The thread discusses the legality of recording conversations and how to document important meetings. There is discussion about the recent controversy surrounding Reddit's CEO and their interaction with an Apollo app developer. Some argue that the CEO was caught lying while others believe he misunderstood the situation. Suggestions are made for potential PR responses to refute the audio recording. The importance of documentation and email records is emphasized. State laws regarding recording conversations are mentioned. The conversation includes comments on the weaker party's interests and the difficulties of believing people in business calls.",
    "hn_summary": "- Reddit CEO faced backlash in a drama-filled AMA targeting the Apollo developer, leaving Reddit in a worse position.\n- Reddit is trying to meet profitability plans by IPO, despite a small user base, and needs to establish full transparency.\n- Reddit users and moderators are upset about the company's focus on profits and calls for a “Reddit competitor” that focuses on community, not just profits."
  },
  {
    "id": 36254172,
    "timestamp": 1686292932,
    "title": "ArchiveTeam has saved over 11.2B Reddit links",
    "url": "https://old.reddit.com/r/DataHoarder/comments/142l1i0/archiveteam_has_saved_over_108_billion_reddit/",
    "hn_url": "http://news.ycombinator.com/item?id=36254172",
    "content": "ArchiveTeam has saved over 10.8 billion Reddit links and is calling for assistance to archive subreddits before they are gone indefinitely after June 12th due to a change in Reddit's API cost system. The group is working to save Reddit posts so that in the event the API cost change is never addressed, posts from closed subreddits can still be accessed. ArchiveTeam has already archived 10.81 billion links, with 150 million more to go. The group is seeking hosts for Windows, MacOS, and Linux-based devices to help run ArchiveTeam Warrior to archive Reddit posts and comments, and provide help and support to anyone considering lending a hand.",
    "summary": "- ArchiveTeam has saved over 10.8 billion Reddit links and is trying to archive subreddits before they disappear due to Reddit's API cost system change.\n- The group has already archived 10.81 billion links and needs help from people with Windows, MacOS, and Linux devices to archive posts and comments using ArchiveTeam Warrior.\n- This effort aims to ensure that posts from closed subreddits remain accessible in case the API cost change is never resolved.",
    "hn_title": "ArchiveTeam has saved over 11.2B Reddit links",
    "original_title": "ArchiveTeam has saved over 11.2B Reddit links",
    "score": 498,
    "hn_content": "ArchiveTeam has saved over 11.2B Reddit links to preserve old posts in subreddits that may go private in protest of recent Reddit API cost changes. Reddit threatened to de-private subs and replace mods, causing controversy. There's debate about whether paid moderators would be committed enough. Some see it as a way to reduce power trips by unpaid volunteers, while others argue that it would degrade quality and centralize the site. The situation highlights the challenges of governing online moderation and how the business model of relying on free labor for moderation may need to change.Reddit's recent replacement of volunteer moderators' third-party apps with official ones has caused controversy. Some argue that the move destroys the illusion of control that moderators have on their subreddits. Others believe that the illusion is Reddit's primary value proposition and that destroying it will hurt the site. Meanwhile, some point out that only a small percentage of moderation actions come from third-party apps. Despite this, Reddit's decision has sparked a debate about the power and control of moderators and their role in shaping social media communities. Some argue that too much power has been concentrated in the hands of individual moderators, leading to abuses of power and censorship. Others argue that moderation is essential to the health and vitality of online communities and that Reddit's recent move is a step in the wrong direction.The ArchiveTeam is archiving all data on Reddit, including text posts, comments, images, and videos, going back to 2005, in response to Reddit's decision to limit the API access to archived data. Many users are contributing to the project by running the ArchiveTeam Warrior software in a VM or Docker emulator. Some users are concerned that the massive data collection will add to the increasing problem of digital hoarding. However, others argue that Reddit contains valuable content, such as tech support, product reviews, and niche knowledge, that users return to years later. The archives are available on the Internet Archive, and users are advised to leave the Warrior running long enough to get through any backlog.The Archive Team has completed its download of Reddit. The site's knowledge and conversations are now preserved on Archive.org. Reddit's volatile nature is under scrutiny as people discuss the value of permanently archiving social media data. Archive Team says the data will be used to train language models, and provide a vital resource for future researchers. Some critics argue that Reddit's often short-lived, insignificant content does not need preserving, and that if content is valuable, individuals and communities will back it up on their own. Others view social media as a \"dumpster fire,\" and that, ultimately, this accessible method of conveying knowledge should continue to be preserved. Regardless of the debate, the Archive Team's work is done, and Reddit conversation history is now open to all.",
    "hn_summary": "- ArchiveTeam has saved over 11.2B Reddit links to preserve old posts in subreddits that may go private in protest of recent Reddit API cost changes.\n- Reddit's recent replacement of volunteer moderators' third-party apps with official ones has caused controversy.\n- The ArchiveTeam has completed its download of Reddit, preserving the site's knowledge and conversations."
  },
  {
    "id": 36257523,
    "timestamp": 1686317306,
    "title": "June 2023 Data Dump is missing",
    "url": "https://meta.stackexchange.com/a/390023/6212",
    "hn_url": "http://news.ycombinator.com/item?id=36257523",
    "content": "Stack Overflow has not released its June 2023 data dump, which is typically updated every three months. Resistance is Futile is offering a +200 reputation bounty for an existing answer to the question as this is unusual given the regular updates of the data dump. It has since been revealed that senior leadership has disabled the upload of the data dump to Archive.org as they work on a strategy to protect the data from being misused by charging companies building LLMs extortionate amounts of money. While they work on this strategy, they have put guardrails in place, which has led to the stopping of the data dump and APIs. Stack Overflow is looking for ways to gate access to the Dump, APIs, and SEDE to prevent misuse by organizations. OpenAI's models famously have a knowledge cut-off date of 2021 and are not using Stack Exchange Data Dumps to train AI models.Stack Overflow has temporarily stopped the data dump until it can put guardrails in place to prevent the misuse of its data by companies building large language models (LLMs). The company is working on setting up infrastructure that will combine open data sharing with appropriate safeguards to prevent misuse of data by organizations looking to profit from the work of the community. Stack Overflow senior leadership is developing a strategy that aims to protect Stack Overflow data from being misused. The company is seeking compensation from companies tapping its data and will charge AI giants for training data. Regular updates on the progress of implementing these measures will be provided. Previously published content posted by users on the Stack Exchange network is licensed under CC-BY-SA, and anyone can host it elsewhere if SE blocks free access to the content.",
    "summary": "- Stack Overflow has not released its June 2023 data dump, which is typically updated every three months, and senior leadership has disabled its upload to Archive.org.\n- This is because they are working on a strategy to prevent misuse of the data by companies building large language models (LLMs), and they have temporarily stopped the data dump until they can put guardrails in place.\n- Stack Overflow is seeking compensation from companies tapping its data and will charge AI giants for training data, and previously published content posted by users on the Stack Exchange network is licensed under CC-BY-SA.",
    "hn_title": "June 2023 Data Dump is missing",
    "original_title": "June 2023 Data Dump is missing",
    "score": 482,
    "hn_content": "The June 2023 data dump for Stack Exchange is currently missing and raises concerns about reliance on large companies to store important community data. The author suggests decentralized communication as an alternative to centralized platforms and data storage. The idea of forking data to create a new community or platform is discussed, with examples such as Wikivoyage being successful. However, the issue of licensing and attribution requirements, as well as the desire to make a complete break from the original platform, may hinder the success of such forks. Founders selling their companies and moving on to new projects is also discussed as a possible explanation for community data reliance on large companies.A discussion on Codidact, a new Q&A style format that is being developed as an alternative to Stack Overflow. Some commenters feel that Codidact is not a step function in capabilities, and that it remains similar in format to Stack Overflow, while others appreciate its clean presentation. The debate centers around the idea of decentralization, its benefits, and whether or not people would switch to federated sites. Some suggest that a non-profit model run by a co-op could be an alternative to private or for-profit companies. Others argue that user inertia and the network effects are the main reasons why centralized corporations are effective in locking down protocol standards. Members of the discussion recognize the challenges of creating stable, growing communities.The author discusses the challenges of creating a decentralized platform and highlights the importance of a skilled founder or group of developers with management experience to organize the business side of things. Non-investment sources of income, such as charging for services or accepting donations, may be necessary, and scaling up to pay employees salaries and benefits is difficult. While open-source models work for software, funding is required for backend infrastructure costs. The author acknowledges the difficulties of competing against Stack Overflow, a centralized platform that has strong influencers in the tech community and requires significant effort for moderation. Moderation and managing decentralized platforms are challenging and time-consuming, and incentivizing users to collectively not experience viral lock-in remains a hurdle. The promotion of web3 has the potential to reintroduce artificial scarcity into digital spaces, and the commodification and gatekeeping of digital assets may not necessarily empower users.Developers should prioritize user agency over VC interests in technological paradigms to avoid monetization strategies that hinder free expression. Decentralized server configurations that allow for federation, interoperability, and mobile identities have shown promise in increasing user agency. There is concern about companies restricting access to APIs as a preemptive measure against AI that could replace creators or devalue their work. The distinction between companies blocking AI scraping to protect user-generated content and those aiming to profit from data is the subject of debate. Stack Overflow leadership is working on a strategy to prevent misuse of their data by companies building LLMs, and Reddit's pricing of data for licensing suggests they may be motivated by profit. There are also concerns around AIs becoming heavily integrated into creative processes and taxing artists while restricting their freedom to create. Overall, the key questions revolve around who owns user-generated content and whether users can control their data.Stack Overflow (SO) has announced that it will limit access to its application programming interface (API) to those who build machine learning models. This restriction entails that SO's data will be inaccessible to many developers who depend on its wealth of coding knowledge to get their work done. SO's senior director of engineering, Prashanth Chandrasekar, stated that the move aims to find a balance between providing access to those who build machine learning models and its commitment to its community of contributors. Critics have argued that SO's decision, which comes at a time of increasing use of natural language processing (NLP) models, could prove detrimental to its user-generated content economy. In a Reddit thread, many users denounced the move as selfish and ill-conceived. Some have inflamed the debate with suggestions that a blockchain-based solution would be better suited to host and steward open-source code repositories that are managed by platforms like SO.Stack Overflow's decision to restrict automated access to its Q&A forum has caused controversy among users who fear it could hinder AI and machine learning advancements. While the firm said it has seen a rise in automated traffic over the last few years, some programmers argue that machine learning models require training data constantly. They claim Stack Overflow content is invaluable for this field and responsible for much of the digital progress made to date, calling on other sites to open their content. However, others say the site has the right to protect its community.Stack Overflow and Reddit are among the centralized sites that have begun restricting their data access. This brings up the question of how to future-proof against this issue. Some suggest adopting decentralized platforms with libre/free/open licenses, while others propose building an identity system that is optionally centralized or federated to eliminate conflict of interest. Additionally, the conversation touches on the definition of \"open\" in open source and how various licenses require payment for some uses of open data. Overall, the discussion highlights the tensions between the desire for open data and the need for compensation for the data creators.Stack Overflow has discontinued its public data dump for developers due to concerns over AI training models taking advantage of user-generated content. While some users believe scraping the data manually is still possible, others worry about the effect it will have on the platform's current setup. The move has raised questions about whether other data-driven services like Reddit and Twitter will follow suit, especially as AI applications become more common. Despite the concerns, some developers remain optimistic that a decentralized solution like Mastodon could be used to create a searchable database of user-generated content. There was also some discussion around Nostr, a social media platform that utilizes private keys to verify authored content.Stack Exchange's decision to discontinue public data dumps for third-party use has caused controversy among users since it breaks the implied social contract that community users would offer their spare time in exchange for a platform and voice in how the platform is run. The decision is part of the company's move toward for-profit chatbots. The company depends on vast amounts of volunteer effort, so balancing providing a site where people are willing to contribute against making as much money as possible is crucial. Sources suggest that the reason users are willing to contribute to Stack Overflow is chiefly because of the CC licensing model, which allows the knowledge not to be locked up. But some users argue that realistically, this model leads to the opening up of bot training data, which helps buffer your bot against opening day failure. The tech industry's desperation to hide the current busts behind advancing technologies is driving this trend towards increasing exclusive platforms.",
    "hn_summary": "- The missing June 2023 data dump for Stack Exchange raises concerns about relying on centralized platforms and storage.\n- Decentralized communication and forking data to create new communities are discussed as alternatives, but there are challenges such as licensing and attribution requirements.\n- Stack Overflow's decision to restrict API access for machine learning models causes controversy among users who fear it could hinder AI advancements, while others defend the company's right to protect its community."
  },
  {
    "id": 36254086,
    "timestamp": 1686292288,
    "title": "Reddark: Website to watch subreddits going dark",
    "url": "https://reddark.netlify.app/",
    "hn_url": "http://news.ycombinator.com/item?id=36254086",
    "content": "This page does not have main article.",
    "summary": "- This page does not have a main article.\n- This website is best experienced by visiting the website directly.\n- Please visit the website to explore other articles.",
    "hn_title": "Reddark: Website to watch subreddits going dark",
    "original_title": "Reddark: Website to watch subreddits going dark",
    "score": 477,
    "hn_content": "A website called Reddark has been created to allow users to watch subreddits going dark. The creator argues that a blackout period of two weeks to a month, with a threat to extend to three months if demands aren't met, could be effective. However, critics argue subreddits going dark is unlikely to have much effect on the company, due to its size and the fact that regular users aren't directly impacted. Some users believe the blackouts may harm Reddit, making investors think twice about the IPO. There are reports some subreddits, including programming humor, may shut down permanently. Moderators have expressed concern that Reddit is out of touch with the community and that users hold the power, maintenance an illusion of autonomy of subreddits.Reddit users are leaving due to their frustration with the platform's web and mobile applications, but some argue that leaving the site entirely is not the best approach. Many users are not aware of the balance between moderators and Reddit's power users, and how crucial their contributions are to the core of the site. As moderators protest current changes, they could lose their subreddits, and alternative platforms may arise. However, finding qualified moderators who are willing to work for free may prove difficult. While alternatives exist, Reddit has already shifted the online community space, and it would take effort to return to the dispersed forum model. The voting system can encourage a behavior of chasing high numbers, and some suggest that Discord channels could be a viable alternative for online discussions. Finally, Reddit's ownership and control over discussion boards raises questions of temporary ownership and loyalty to the platform.Some moderators of subreddits are participating in a 48-hour-long blackout to protest against Reddit's lack of communication and support regarding their troubles with third-party apps and moderation tools. This event has the potential to fracture some Reddit communities, although others criticize the mods' credibility or do not believe it will make a significant change to the platform. Reddit's monetization strategy involving both unpaid volunteer labor from moderators and the charging of money for API access has been questioned for its inconsistency. Commercial entities using Reddit for advertising purposes may be using third-party tools, but more lucrative revenue could potentially be gained through introducing paid plans for commercial use and tagging content from commercial accounts.Reddit's new Terms of Service state that third-party apps will now be considered commercial use and subject to high pricing. However, some users argue that this new policy targets third-party apps containing their own advertisements and not those using Reddit's API. There are concerns that the policy could affect smaller third-party app developers. Alternatively, some suggest that restricting this commercial use may have been a missed financial opportunity for Reddit. Amid the debate, Reddit has expanded free API access to 100 calls per minute and continues to protect its developer resources for non-commercial use. Meanwhile, the Reddit community is also questioning the company's profitability and how its C-suite is making money.A trending discussion among Reddit moderators about the platform's new policy changes, including the addition of a \"proactive enforcement for API abuse\" and a limit on subreddit \"community awards,\" has garnered attention and potential protests. Some moderators have announced plans to close their respective subreddits or even shut down their apps in response. Many are also discussing alternative platforms like Lemmy and Hacker News, but concerns about these platforms' ability to handle millions of users and requests remain. Others have criticized Reddit for its lack of transparency and for allegedly allowing companies to control their own subreddits, thereby eroding the platform's previous illusion of impartiality. An upcoming AMA with Reddit CEO Steve Huffman about the changes has also been met with skepticism.Various subreddit moderators have decided to make their subreddits private until Reddit management addresses the issue of moderators having little control over their subreddit. Some subreddits with hundreds of thousands of subscribers have gone fully private, and default subreddits are among those going dark. Reddit moderators have long bemoaned the fact that they spend a significant amount of time working for Reddit for free, in some cases, and that they have little control over content or their own moderator accounts, which hackers can and have easily stolen. This disruption highlights the lack of authority individual subreddit moderators have within the larger platform, and could negatively impact user engagement.",
    "hn_summary": "- Reddark allows users to watch subreddits going dark, but critics argue it may not have much effect on the company.\n- Some subreddits, including programming humor, may shut down permanently, and moderators express concern about Reddit being out of touch with the community.\n- Reddit's new policies, including the treatment of third-party apps as commercial use and a limit on subreddit \"community awards,\" have caused controversy and potential protests among moderators."
  },
  {
    "id": 36256167,
    "timestamp": 1686309598,
    "title": "Apollo Back end just made public",
    "url": "https://old.reddit.com/r/apolloapp/comments/144l6se/apollo_backend_just_made_public_the_goal_of/",
    "hn_url": "http://news.ycombinator.com/item?id=36256167",
    "content": "The developer of Apollo, a Reddit app for iPhone, has made the code for its backend repository publicly available to demonstrate that Apollo does not scrape any data and solely relies on authenticated Reddit API requests. The move seeks to counter recent statements by Reddit administrators to the contrary. Apollo takes care to respect Reddit API rate limits, giving users an enhanced experience while conforming to the requirements set out by Reddit. The developer has made their errors and successes open and is willing to field any questions about the project. The release of the backend code is in keeping with the transparency that the project has shown throughout.",
    "summary": "- Developer of Apollo, a Reddit app for iPhone, has made the code for its backend repository publicly available to demonstrate that Apollo does not scrape any data and solely relies on authenticated Reddit API requests.\n- Apollo respects Reddit API rate limits, giving users an enhanced experience while conforming to the requirements set out by Reddit.\n- The release of the backend code is in keeping with the transparency that the project has shown throughout.",
    "hn_title": "Apollo Back end just made public",
    "original_title": "Apollo Back end just made public",
    "score": 457,
    "hn_content": "The creator of Apollo's back end has made the code public for educational purposes. Reddit users are praising the developer for their effort to make Reddit more enjoyable to use. Discussions regarding software development practices are also taking place on the thread, such as leadership expectations and licensing recommendations. The community is reflecting on what makes successful code and software development, including the balance between polished code and working code that brings value to users. The back end worked by polling user accounts to generate notifications and the team behind Apollo ensured it had minimal impact on Reddit's end.The Readme for Apollo code on Github is not clear on its functionality, prompting questions from users. The code was used for push notifications on iOS and to reduce resubmission to Apple when Reddit experiences issues. The code is praised for being efficient, using Golang-Migrate for running migration queries, and for setting an industry standard in-app development with millions of users. While Reddit has faced scrutiny, many are turning to alternative platforms, such as Lemmy, that could address the issues that Apollo's code was designed for better. There is also a Reddit CEO AMA that many individuals believe will fail to address their concerns meaningfully. Overall, the code is seen as production quality, and users are grateful for its release and transparency despite less-than-optimal practices.Reddit users are unhappy about the platform trying to move users onto native app to access it. Moderators are planning a blackout in response to push back against Reddit's API policy. Some users don't believe it will impact the site's success, while others believe it could be the beginning of the end for the platform. Twitter has lost growth in many categories, while Reddit has fewer followers but more in-depth post engagement. Reddit is currently preparing to go public.Twitter has lost more than half of its advertisers, due to mismanagement and poor decision-making. However, despite the decline in its ad revenue, Twitter seems to have no problem filling that ad space. The comments section of this article discusses the decline of other social media platforms, like Reddit, and the potential for open source community-run alternatives to emerge. One such platform that is suggested as an alternative to Reddit is Tildes, which promotes respectful dialogue and simple UI, but its invite-only policy and lack of images present a barrier to mass migration. Overall, the article shares comments on the state of social media platforms and their potential alternatives.Apollo's backend code has been made public on GitHub, showing that it does not scrape Reddit and all requests are authenticated. The move comes after Reddit's recent changes and charges to its API, which some feel unfairly impact third-party apps such as Apollo and its users. However, some users have criticized Apollo for not being truly open source and not putting its codebase on public platforms like GitLab. Additionally, some users are calling for people to \"nuke\" their personal Reddit history as a protest against the changes. There is also discussion around the lack of the ability to sort by controversial posts on Tildes, which some feel helps prevent hate speech in communities.",
    "hn_summary": "- The creator of Apollo's back end has made the code public for educational purposes and has been praised by Reddit users for their effort to make Reddit more enjoyable to use.\n- Discussions regarding software development practices, including leadership expectations and licensing recommendations, and what makes successful code and software development are taking place in the thread.\n- The code is seen as production quality, and users are grateful for its release and transparency despite less-than-optimal practices."
  },
  {
    "id": 36259930,
    "timestamp": 1686326793,
    "title": "Archive your Reddit data before it's too late",
    "url": "https://xavd.id/blog/post/archive-your-reddit-data/",
    "hn_url": "http://news.ycombinator.com/item?id=36259930",
    "content": "Archive Your Reddit Data While You Still CanJune 09, 2023RedditenshittificationSQLitePythontl;dr: I wrote a tool to make a searchable archive of your Reddit data. I'd suggest downloading and running it before June 30th, 2023.If you're an active Reddit user, you may have heard about impending changes to its public API. This move will have widespread impact on Redditors, including the death of beloved 3rd party clients and some subreddits even going dark indefinitely. These changes mark the beginning of the (apparently) inevitable enshittification of Reddit as a platform. Realizing this bummed me out more than I expected the death of a website might. 1I've been a fairly active Redditor for more than 11 years. Until now, it's been the website with the best mix of community, popularity, developer ecosystem, and web-search-ability. 2 The non-monetary value Reddit as a knowledge store is literally priceless; it's a modern-day Library of Alexandria. So when I saw the writing on the wall, I became worried about the most valuable thing I'd contributed to Reddit: my posts and comments.I've posted many stories, jokes, and (dare I say) insightful comments on Reddit over the years. When I heard the news, I realized I'd be upset if I wasn't able to access my contributions anymore. I'll occasionally want to go back and find specific comments I made years ago, a task which the web UI doesn't make simple (there's a lot of clicking \"next page\" involved).Reddit does have a feature to export your data into a GDPR archive, but it's pretty barebones - only the plaintext of the comment, the subreddit name, the timestamp, and weirdly, the number of awards. Unfortunately, the highest fidelity data comes from the API, which is exactly what's going to be changing/worsening soon. So it felt urgent to create an archive of my personal API data.The venerable SQLite project allows storing structured, searchable data in a single file. This leads us to my project, reddit-user-to-sqlite. It's a small Python tool which builds an archive of all of your posts and comments. You can read all about it here: https://github.com/xavdid/reddit-user-to-sqlite/Running it requires a bit of comfort with the command line, but being able to paste 3 commands into a terminal will get you what you need:install pipxrun pipx install reddit-user-to-sqliterun reddit-user-to-sqlite user YOUR_USERNAME_HEREAfter running, you'll get a database file that you can use with Datasette:Each column is sortable and you can perform full-text search on your comments (and posts):Your content being in a database means it's easy to get insights about your usage. For instance, I can see the amount of karma I've gotten from each subreddit, or where I comment the most.The tool also supports reading data from a GDPR archive, which will continue working after the API is shut down (albeit with some data missing, like score). See the docs for more info.Best of all, your content is yours again. Once it's archived, it's in a file that they can never take away from you. (No matter what stupid things they keep doing to the platform.) The reddit-user-to-sqlite will update an existing database with new data if you run it again, so feel free to run it periodically to keep your archive up-to-date.I've got no clue what will happen after the API terms have changed. If you're going to create an archive, make sure to do it before June 30th, 2023.Let me know if you have any questions or come across any issues. I'll try to get them fixed before the deadline. Until then, happy archiving!",
    "summary": "- Upcoming changes to Reddit's API may cause some subreddits to go dark indefinitely and affect third-party clients.\n- The non-monetary value of Reddit as a knowledge store is priceless, and users can archive their personal data using a Python tool called reddit-user-to-sqlite.\n- The tool allows users to store structured and searchable data in a single file that they can use to perform full-text search on their comments and posts without having to rely on Reddit's search functionality.",
    "hn_title": "Archive your Reddit data before it's too late",
    "original_title": "Archive your Reddit data before it's too late",
    "score": 426,
    "hn_content": "Hacker News users are discussing the value of Reddit accounts and karma, with some sharing their methods for wiping accounts and using anonymous or short-lived accounts. Some point out the necessity of gaining a certain amount of karma to interact in certain subreddits, but there are also concerns about echo chambers and spam. Despite criticisms, some users find Reddit useful for discussing niche interests and receiving technical support. However, others suggest that Reddit's lifespan may be limited, and some express a desire for anonymity and shifting away from public karma displays. Overall, the discussion revolves around the role and relevance of Reddit in online communities.This post is a thread discussing the purpose of upvoting and downvoting on websites like Hacker News and Reddit. Some users suggest having different categories for voting, while others argue that the current system of upvoting and downvoting results in tribalism and lack of diversity of opinions. Some users also discuss the idea of punishing those who downvote for the wrong reasons. There is also a discussion on users deleting their post history and the impact it has on future readers of old threads. Overall, this post offers insights into the dynamics of online voting systems and user behavior in online communities.The text discusses personal keys as a workaround for apps with a 1:many dev:user ratio. However, this is a high-friction method, especially for mobile apps, requiring building/patching an APK and side-loading it. The conversation in the comments discusses the issue of deleting comments and their impact on searchability, archives, and repositories of knowledge. Users share their experiences with deleting their Reddit accounts and the reasons behind it. There are also discussions of privacy and doxing, as well as tools and methods to delete posts and comments on Reddit. However, the deletion of comments and posts also raises the issue of losing valuable information and the lack of permanent, searchable repositories of knowledge.Various users discuss techniques for deleting all posts and comments on Reddit, including using third-party apps like Shreddit and official Reddit tools. Some express frustration with the limitations of Reddit's new API pricing model, while others debate the usefulness of online communities like Reddit and YouTube. Pushshift, a service that archives Reddit posts and comments, is mentioned as having shut down temporarily due to a conflict with Reddit, but is expected to return in some form. Some users note that while deleting one's own content can give a sense of privacy, data from deleted accounts is likely still available in some form.Users on Hacker News discussed the potential for creating a decentralized social media platform with Reddit-like features. Some suggested using the subreddit form as a decentralized aspect for smaller communities, while others looked into creating a central hub that aggregates different platforms in a consistent format. The discussion touched on the benefits of having a single-pane-of-glass view for a feed of multiple communities' posts, as well as the difficulties in creating a fully-centralized platform. Some users pointed out that communities nowadays tend to leverage a combination of different platforms like Discord, Reddit, and Patreon. Finally, some suggested that creating such a platform would be time-consuming and difficult, but they would be open to contributing if someone were to create a Show HN that showed signs of momentum.Amid changes and limitations of Reddit's API, users are discussing the rise of alternative platforms and communities like Tildes, Lemmy, Kbin.social, Discord servers, and web forums. Many users agree that a centralized platform to view posts from all existing communities would be ideal. Some developers are working on new concepts, such as Sociables, AvocadoReader, and Flingup, but others assert that creating a clone of Reddit is not enough and marketing and PR challenges are more important than technical ones. The quality of the Reddit interface is also subject to criticism, especially with the prevalence of ads and a lack of accessibility for people with disabilities. Overall users seem to be searching for new spaces for content and discussion that offer better structures, interfaces, and community management tools.",
    "hn_summary": "- HN users discuss the value of Reddit accounts and karma, with concerns about echo chambers and spam.\n- The post discusses the purpose of upvoting and downvoting on websites like Hacker News and Reddit, and the impact of users deleting their post history on future readers.\n- Users share techniques and tools for deleting posts and comments on Reddit, but some express concerns about losing valuable information and the lack of permanent, searchable repositories of knowledge."
  },
  {
    "id": 36257981,
    "timestamp": 1686319499,
    "title": "Shreddit is a Python program to remove all your Reddit comments",
    "url": "https://github.com/x89/Shreddit",
    "hn_url": "http://news.ycombinator.com/item?id=36257981",
    "content": "ShredditShreddit is a Python command line program which will take a user's post history on the website Reddit, and will systematically go through the user's history deleting one post/submission at a time until only those whitelisted remain. It allows you to maintain your normal reddit account while having your history scrubbed after a certain amount of time.When it became known that post edits were not saved but post deletions were saved, code was added to edit your post prior to deletion. In fact you can actually turn off deletion all together and just have lorem ipsum (or a message about Shreddit) but this will increase how long it takes the script to run as it will be going over all of your messages every run.Important New Changes (as of Dec 2016)Due to deprecation of the PRAW 3.x library, Shreddit is using PRAW 4. This requires that OAuth be used to authenticate. Thankfully, however, it is much easier than in previous versions. If you are upgrading, please review the usage section to ensure that you have set up credentials correctly.Pip Installationpip install -U shreddit will install the package and its dependencies, and it will add a shreddit command line utility to your PATH. This is typically either run in a virtualenv or using administrative privileges for global installation.Manual InstallationClone the shreddit repository to a directory.From the directory, run pip install -r requirements.txtRun python setup.py install to install the package and the shreddit command line utility. This is typically either run in a virtualenv or using administrative privileges for global installation.UsageAfter installing the shreddit command line utility, the first step is setting up the tool's configuration files. Simply typing shreddit -g will generate configs. After configuring credentials, running the tool with the shreddit command will begin the tool's operation.Configuring CredentialsRunning shreddit -g will generate a blank praw.ini file that looks like this:# Credentials go here. Fill out default, or provide one or more names and call shreddit with the -u option to specify# which set to use.[default]client_id=client_secret=username=password=You must provide values for each of these. As strange as it may seem to provide both a username/password pair and a client id/secret pair, that is how the Reddit API does \"OAuth\" script applications.Username and password are simply your Reddit login credentials for the account that will be used. However, to obtain the client ID and secret, follow these steps (taken from PRAW documentation):Open your Reddit application preferences by clicking here.Add a new application. It doesn't matter what it's named, but calling it \"shreddit\" makes it easier to remember.Select \"script\".Redirect URL does not matter for script applications, so enter something like http://127.0.0.1:8080Once created, you should see the name of your application followed by 14 character string. Enter this 14 character string as your client_id.Copy the 27 character \"secret\" string into the client_secret field.Finally, your praw.ini should look like this (with fake data provided here):[default]client_id=f3FaKeD4t40PsJclient_secret=dfK3pfMoReFAkEDaTa123456789username=testuserpassword=123passwordgoeshere123Keep your praw.ini either in the current directory when running shreddit, or in one of the config folders described here such as ~/.config in Linux or %APPDATA% in Windows.To use more than one account, you can add multiple profiles instead of just [default] and use the -u option to shreddit to choose which one each time.AutomatingThe easiest way to automate this tool after the first run is by using the cron utility. Run crontab -e to edit your user's crontab settings.Examples:The following examples require that the PRAW configuration file is located in the config directory. See this PRAW documentation for more information.Run every hour on the hour 0 * * * * shreddit -c <full path to shreddit.yml>Run at 3am every morning 0 3 * * * shreddit -c <full path to shreddit.yml>Run once a month on the 1st of the month 0 0 1 * * shreddit -c <full path to shreddit.yml>If virtualenv was used, be sure to add source /full/path/to/venv/bin/activate && before the command. For example:0 * * * * source /full/path/to/venv/bin/activate && shreddit -c <full path to shreddit.yml>Command Line Options$ shreddit --helpusage: app.py [-h] [-c CONFIG] [-g] [-u USER]Command-line frontend to the shreddit library.optional arguments: -h, --help      show this help message and exit -c CONFIG, --config CONFIG            Config file to use instead of the default shreddit.yml -g, --generate-configs            Write shreddit and praw config files to current            directory. -u USER, --user USER User section from praw.ini if not defaultFor Windows usersMake sure you have Python installed. Click here for the Python download page. - Note: Install either python 2.x or python 3.x, not both.Follow the pip installation instructions.Open a new command prompt and verify that the shreddit command works before moving on to the usage section.CaveatsCertain limitations in the Reddit API and the PRAW library make it difficult to delete more than 1,000 comments. While deleting >1000 comments is planned, it is necessary right now to rerun the program until they are all deleted.We are relying on Reddit admin words that they do not store edits, deleted posts are still stored in the database they are merely inaccessible to the public.DonateA few people have asked about donating so here's a Bitcoin address, any amount is appreciated, spread amongst recent contributors and if there's enough interest a web service may be on the horizon! 1PbeYK7FonjVmgWxf4ieKmvwtomZR1K1Qu",
    "summary": "- Shreddit is a Python command line program that removes a user's post history on Reddit systematically, leaving only those whitelisted. \n- It uses PRAW 4 and requires OAuth authentication, but the new library makes it easier to authenticate. \n- Users can set up multiple profiles for different accounts and automate the process using the cron utility.",
    "hn_title": "Shreddit is a Python program to remove all your Reddit comments",
    "original_title": "Shreddit is a Python program to remove all your Reddit comments",
    "score": 371,
    "hn_content": "A Python program called Shreddit has been developed to delete all Reddit comments. However, this raises concerns about the loss of information and troves of discussions. Some argue that Reddit is valuable for its trove of conversations and getting deleted information should be an option. Reddit has confirmed in the past that they don't keep track of the history of deleted comments. Some users suggest that overwriting comments with random text before deleting them is an effective strategy to stop Reddit from restoring them. There are also concerns that using Shreddit to erase all Reddit comments might hurt fellow users more than Reddit itself. Additionally, some fear that if everyone used Shreddit, there would be less valuable conversations on Reddit, and the demand for Reddit would decline.A tool exists to mass-delete Reddit comments, but comments can be restored manually if the right version can be identified. Some suggest Reddit should truncate the record of deleted comments after a certain time to prevent mass-deleters. A script could insert and edit random garbage text and delay the activity to make it difficult for Reddit to distinguish between real and script activity. However, comments left on Reddit are owned by Reddit, and a perpetual license is granted for their use. GDPR applies to any company operating in the EU storing the data of users, regardless of the citizenship of those users. Companies may find it more efficient to use public data dumps of Reddit comments rather than paying Reddit to scrape data using APIs. Deleting comments from Reddit could be seen as punishing it for behaving badly, but our reliance on proprietary platforms could be limiting in the long term.The discussion centers around individuals deleting their own comments and posing questions about the intention of posting on Reddit/HN. Some argue that deleting comments hurts other humans, while others suggest that it's not a sane default to expect a comment to last forever and that it's akin to burning books from a library. There is also a discussion about whether Reddit is a reliable source for social history and its archival value. Users suggest that the best solution is a tool that copies and then deletes, making the copy anonymous while keeping the data available. Overall, the sentiment is divided between preserving data and the right to be forgotten, and the consequences of deleting data from a site like Reddit/HN.- Self-promotion in groups you do not regularly participate in is considered spam\n- Reddit moderation is not a democracy, with a small group controlling many large subreddits\n- Moderators use third-party tools and software to manage subreddits effectively\n- Some believe that the lack of moderation tools provided by Reddit is an issue\n- The company's approach to profitability has been criticized for being user-hostile and greedy\n- There is debate over the activist goals of those calling for changes in how Reddit operates",
    "hn_summary": "- Shreddit is a Python program that deletes all Reddit comments, but concerns are raised about the loss of information and troves of discussions.\n- Reddit does not keep track of the history of deleted comments, and some suggest overwriting comments with random text before deleting them.\n- There is a discussion about the archival value of Reddit and the consequences of deleting data from the site."
  },
  {
    "id": 36257963,
    "timestamp": 1686319411,
    "title": "OpenMW: Open-source TES3: Morrowind reimplementation",
    "url": "https://gitlab.com/OpenMW/openmw",
    "hn_url": "http://news.ycombinator.com/item?id=36257963",
    "content": "Skip to contentGitLabAbout GitLabPricingTalk to an expert/HelpRegisterSign inopenmwProject informationRepositoryIssues893Merge requests55CI/CDDeploymentsPackages and registriesAnalyticsCollapse sidebarOpenMWopenmwopenmwProject ID: 7107382Star66631,211 Commits69 Branches59 Tags919.7 GiB Project Storage3 ReleasesTopics:gameMorrowindnif+ 2 moreOpenMW is an open-source open-world RPG game engine that supports playing Morrowind.Merge branch 'dev-7019' into 'master'psi29a authored 6 hours ago2686e586masteropenmwFind fileSelect Archive FormatCloneREADMEGNU General Public License v3.0 or laterCHANGELOGCONTRIBUTINGName Last commit Last update",
    "summary": "- OpenMW is an open-source game engine that supports playing the game Morrowland.\n- The project has over 66,000 stars on its GitLab page, indicating its popularity among the open-source gaming community.\n- The recent merge of 'dev-7019' branch into the master branch reflects the ongoing development and commitment to the project.",
    "hn_title": "OpenMW: Open-source TES3: Morrowind reimplementation",
    "original_title": "OpenMW: Open-source TES3: Morrowind reimplementation",
    "score": 318,
    "hn_content": "OpenMW, an open-source reimplementation of \"The Elder Scrolls III: Morrowind,\" has been released on GitLab. This has led to modders developing and combining different open-source games in innovative ways. The community of modders who play these games are an intense tech scene, with most participants young, low-commitment, grew up in these scenes or are members of a strong community. Many modders feel celebrated by their peers when they can achieve something that only the community will recognize. Having kids requires a significant commitment and could result in productivity drop or personal advancement opportunity failure. However, it can also provide drive and focus that can outweigh the ability to dabble or move at any given moment. Some YouTubers with entertaining and educational videos are recording amazing playthroughs: includingOpenMW, a community-developed open-source game engine, enables players to enjoy the iconic game Morrowind with updated graphics and improved performance. The platform has an active modding community, with mod lists available for players' benefits. Players' note-taking increases the fun and immersion of the game. Backwards compatibility with Microsoft Windows lets users enjoy games from 1995 to about 2007. Despite the improved graphics and performance, some gamers still prefer the original version of Morrowind's world-building. A former Morrowind developer, Michael Kirkbride, contributed to the game's world-building, which was unique and intriguing due to his distinctive creativity.OpenMW, an open-source project for re-implementing game engines, including Morrowind and now Oblivion, is in active development and offers improved performance and modding capabilities compared to the original games. It also has a dedicated Android port. OpenMW stands for Open Microwave, and the project offers an opportunity for fan base development and modification, enhancing the entire Elder Scrolls ecosystem. The reimplementation of game engines opens up the possibility for generative AI to create replacements for textures, images, and even quests or stats. OpenMW is not the only project in this space, as Daggerfall Unity has a similar blog-style project over at dfworkshop.net. However, new versions of OpenMW are released regularly, and it is highly recommended for Elder Scrolls fans looking to play these beloved games on modern hardware.OpenMW, an open source game engine recreation, allows for enhancements, fixing defects, playing on more platforms, such as Linux, and adding new sections or expansions. OpenMW requires owning Morrowind and is stable and moddable, offering features such as playing in 4K and changing what you don't like in the game. OpenMW also has a sister project, TES3MP, which adds multiplayer. The game does not come with any content or asset and needs to be installed and configured to use the existing installation. The point is to provide stability and moddability to the game, allowing for wider options and opportunities. OpenMW also offers the potential for someone to write a whole new game for the engine and release the entire thing for free.",
    "hn_summary": "- OpenMW is an open-source reimplementation of the game Morrowind, and its release on GitLab has led to innovative modding of different open-source games.\n- Players enjoy Morrowind with updated graphics and improved performance, and note-taking increases immersion in the game, while some gamers still prefer the original version of Morrowind's unique and intriguing world-building.\n- OpenMW offers stability, moddability, and the potential for someone to create a whole new game for the engine and release it for free, and it has a dedicated Android port and a sister project, TES3MP, which adds multiplayer."
  },
  {
    "id": 36256985,
    "timestamp": 1686314416,
    "title": "I bought the only physical encyclopedia still in print",
    "url": "https://arstechnica.com/culture/2023/06/rejoice-its-2023-and-you-can-still-buy-a-22-volume-paper-encyclopedia/",
    "hn_url": "http://news.ycombinator.com/item?id=36256985",
    "content": "A HANDSOME, SHARK-BOUND REFERENCE —I just bought the only physical encyclopedia still in print, and I regret nothingThe still-updated World Book Encyclopedia is my antidote to the information apocalypse.BENJ EDWARDS - 6/9/2023, 4:30 AMEnlarge / A photo of the 2023 edition of the World Book Encyclopedia on the author's family room shelf.Benj Edwards256WITHThese days, many of us live online, where machine-generated content has begun to pollute the Internet with misinformation and noise. At a time when it's hard to know what information to trust, I felt delight when I recently learned that World Book still prints an up-to-date book encyclopedia in 2023. Although the term \"encyclopedia\" is now almost synonymous with Wikipedia, it's refreshing to see such a sizable reference printed on paper. So I bought one, and I'll tell you why.FURTHER READINGEncyclopædia Britannica’s 2010 edition to be its lastBased in Chicago, World Book, Inc. first published an encyclopedia in 1917, and it has released a new edition almost every year since 1925. The company, a subsidiary of Warren Buffett's Berkshire Hathaway, claims that its encyclopedia is \"the only general reference encyclopedia still published today.\" My research seems to back up this claim, at least in English; it's possibly true even for languages. Its fiercest competitor of yore, The Encyclopedia Britannica, ended its print run in 2012 after 244 years in print.In a nod to our present digital age, World Book also offers its encyclopedia as a subscription service through the web. Yet it's the print version that mystifies and attracts my fascination. Why does it still exist?\"Because there is still a demand!\" Tom Evans, World Book's editor-in-chief, told Ars over email.Today, up-to-date information flows freely thanks to the Internet. It's only a Google search away. Many people rely on Wikipedia, which is a nonprofit collaborative resource, for reference purposes. Despite that, some people and organizations apparently still buy paper encyclopedias. Evans said that sales of the print edition are \"in the thousands\" and that World Book always prints just enough copies to satisfy demand.Enlarge / The Encyclopedia Britannica, a competitor of World Book, ended its print run in 2012.Encyclopedia BritannicaA World Book rep told Quartz in 2019 that the print encyclopedia sold mostly to schools, public libraries, and homeschooling families. Today, Evans says that public and school libraries are still the company's primary customers. \"World Book has a loyal following of librarians who understand the importance of a general reference encyclopedia in print form, accessible to all.\"As a kid, our family owned a 1968 edition of World Book that I relied on for school reports and projects all the way until my high school graduation in 1999, although I briefly used Microsoft Encarta on CD-ROM and a CompuServe encyclopedia in the 1990s. At the time, even with electronic references, instantaneous, up-to-date information didn't seem as important. We were still largely operating at the speed of paper. While that concept seems foreign to us in our current world, there was a certain kind of comfort in that slowness.Speaking of slow, a paper encyclopedia set certainly can't run away from you. Back in the day, our family's encyclopedia set took up a large dedicated shelf in our family room. Just like my old 1968 edition, the new print edition of World Book is a physically hefty reference. The 2023 version spans 17,000 articles spread over 14,000 pages in 22 volumes. The company says it features over 25,000 photographs, illustrations, diagrams, and maps.All this paper-bound content can't possibly come cheap, you might think. And, of course, you're right. At a time when most information comes to us for free online (with strings attached, of course), it's easy to have sticker shock at the $1,199 retail price for the 2023 edition of World Book, although shoppers might occasionally find it for as low as $799 on Amazon (to compare, the online subscription costs $250 per year). Earlier editions are available for much lower prices.I know it may seem weird to prefer the print edition since you can get the same content in the online version in a space-saving and portable format. But with the paper version, the World Book will always be yours. It can't be edited stealthily or taken down if the company needs the server space or goes out of business.So I took the plunge.Page: 1 2 3 Next →READER COMMENTS256WITHBENJ EDWARDSBenj Edwards is an AI and Machine Learning Reporter for Ars Technica. In his free time, he writes and records music, collects vintage computers, and enjoys nature. He lives in Raleigh, NC.Channel Ars Technica← PREVIOUS STORYNEXT STORY →Related StoriesToday on Ars",
    "summary": "- World Book Encyclopedia is the only updated book encyclopedia in print.\n- World Book's encyclopedia also exists as a subscription service through the web.\n- World Book's primary customers are public and school libraries.",
    "hn_title": "I bought the only physical encyclopedia still in print",
    "original_title": "I bought the only physical encyclopedia still in print",
    "score": 268,
    "hn_content": "The article reminisces about owning a physical encyclopedia and how it was acquired. The limitations of the encyclopedia and how it compares to Wikipedia are discussed. Encyclopedias are considered a starting point for research, but not for primary sources. The importance of encyclopedias for an overview of human knowledge and shaping of interests is highlighted. The tactile experience of using a physical encyclopedia and how it can shape the learning process is discussed. Personal experiences and memories of using a physical encyclopedia are shared. The article is not particularly special or exciting, but it may be of interest for those looking to understand the history and evolution of resources for learning and research.No meaningful content was found.The 2023 edition of the World Book encyclopedia retails at $1,199, while the online subscription costs $250 per year. Nostalgic readers reflect on the appeal of print encyclopedias, which they find to be more charming than online versions. Older encyclopedias are considered more intriguing than modern ones, and they offer a fascinating snapshot of pre-discovery consensus and information. Encyclopedias like Brockhaus Enzyklopädie were popular and useful before the internet, as were textbooks. The Stanford Encyclopedia of Philosophy online reads better than Wikipedia because its articles are written by experts in the field. Encyclopedias such as the 1911 11th edition of the Encyclopedia Britannica and the World Book have secured a place of honor in some homes.The World Book Encyclopaedia 2023 edition is now available for $1,200, but with its physical form and comprehensive information, it's seen as a luxury item. It's been surprising for many people in the tech industry to see an up-to-date print encyclopedia in 2023, as electronic texts have taken over, but there is still nostalgia for the physical book. Many people like to read encyclopaedias for fun and love the detailed diagrams and illustrations. There is debate over the benefits of having information so easily accessible in a click, versus having to work harder to attain knowledge, which some feel leads to a broader understanding of the world.People recall the nostalgia associated with the print encyclopedia, such as the joy of discovering new information through flipping its pages and the legacy they inherited from their parents' purchases. They argue that reading a print version does not protect readers from a biased perspective or propaganda. Individuals also share links to alternatives and older versions that they own. Some express concern over the need for a reliable source of truth amidst the overwhelming information found on the internet. The blog post discussed the author's personal experience of purchasing and reviewing the latest edition of World Book Encyclopedia, which sparked some debates about sponsored content and the value of such books.",
    "hn_summary": "- The article discusses the experience and limitations of owning a physical encyclopedia compared to digital resources like Wikipedia.\n- Encyclopedias serve as a starting point for research and offer an overview of human knowledge, shaping interests and the learning process.\n- Nostalgic readers find print encyclopedias more charming and intriguing than modern ones, but there is a debate over the benefits of easily accessible information versus working harder for knowledge."
  },
  {
    "id": 36259163,
    "timestamp": 1686324011,
    "title": "3M heads to trial in 'existential' $143B forever-chemicals litigation",
    "url": "https://www.bloomberg.com/news/articles/2023-06-02/3m-heads-to-trial-in-existential-143-billion-pfas-litigation",
    "hn_url": "http://news.ycombinator.com/item?id=36259163",
    "content": "Your browser is: Chrome Headless 114.0.5735.106. This browser is out of date so some features on this site might break. Try a different browser or update this browser. Learn more.✕Skip to contentSkip to contentBloomberg the Company & Its ProductsBloomberg Terminal Demo RequestBloomberg Anywhere Remote LoginBloomberg Customer SupportUS EditionSign InSubscribeLive NowMarketsEconomicsIndustriesTechnologyPoliticsWealthPursuitsOpinionBusinessweekEqualityGreenCityLabCryptoMoreIndustriesLegal3M Heads to Trial in ‘Existential’ $143 Billion Forever-Chemicals LitigationFirst PFAS case to go before a jury is set to kick off June 5Litigation risk has made 3M stock ‘uninvestible,’ analyst saysByJef Feeley and Ryan BeeneJune 2, 2023 at 4:00 AM PDTFollow the authors+ Get alerts forJef Feeley@ryanbbeene+ Get alerts forRyan Beene3M Co. faces an existential threat from lawsuits over allegedly cancer-linked “forever chemicals” that have leached into municipal water supplies, with the company’s liability possibly hitting $143 billion for cleanup alone. The first trial out of some 4,000 lawsuits against 3M, many by state and local governments, over pollution caused by per- and polyfluoroalkyl substances, or PFAS, is set to start June 5 in federal court in Charleston, South Carolina. PFAS have been used for decades in products ranging from nonstick pans to cosmetics, but they don’t break down naturally and can settle in soil, water or human bodies.",
    "summary": "- 3M faces the first trial out of 4,000 lawsuits, with an estimated liability of $143 billion for the cleanup of allegedly cancer-linked \"forever chemicals\" that have contaminated municipal water supplies.\n- The chemicals, called per- and polyfluoroalkyl substances (PFAS), have been used for decades in everyday products but do not break down naturally and can accumulate in soil, water, and human bodies.\n- The trial, starting on June 5th in federal court, could have significant implications for the company's future and highlights the growing legal and public concern over PFAS pollution.",
    "hn_title": "3M heads to trial in ‘existential’ $143B forever-chemicals litigation",
    "original_title": "3M heads to trial in ‘existential’ $143B forever-chemicals litigation",
    "score": 259,
    "hn_content": "3M is heading to a trial in a $143B litigation centered around PFAS chemicals that are still legal to use but being phased out and banned in a few years. The issue is that the toxicity levels of the chemicals to humans have been known for a while but not shared with the public or regulators. PFAS is used in everyday products like pans and dental floss. While cast iron skillets are a good alternative to PFAS, they require a bit of maintenance and seasoning. Stainless steel is another alternative that does not poison the environment. Ceramic pans might not be free of PFOA or similar chemicals, so it's important to research before purchasing. The trial highlights the importance of regulating chemical use and transparency, especially when it comes to public health.The post discusses the best ways to create a non-stick surface on a frying pan, including using cooking oil and butter, heating the oil to the point of smoking, and seasoning a cast-iron skillet. There is a debate around the health risks of using Teflon-coated pans versus cast iron and carbon steel pans, with concerns about carcinogenic compounds produced by heated oil and the potential leaching of plastic compounds into food. Many recommend switching to glass or stainless steel containers and silk floss, but others acknowledge the difficulty of avoiding plastic altogether. Some people recommend specific brands of non-stick pans, including Scanpan and carbon steel pans, while others suggest using parchment paper instead of non-stick pans.PFAS chemicals consist of fluorine atoms attached to carbon chains, with a hydrophilic \"head\" that makes them biologically active and able to function as surfactants. PFAS can cause health issues when absorbed by cell membranes. Steel pans do not contain \"forever chemical\" coatings, which are toxic. There is concern over the safety of various industrial chemicals, including refrigerants and plastic, due to the possibility of them being toxic. Governments may go after big corporations for covering up toxic effects of their products. Disbanding corporations like 3M may help prevent future public harm. The US government is unlikely to have profited much from the recent case against 3M, which fined them a relatively small amount of money.3M, a manufacturer of non-stick coatings used in thousands of different products, is being sued for selling products they knew to be toxic, without disclosing that information. Scientists believe that Perfluorooctanoic acid (PFAS) may be linked to high cholesterol, thyroid disease, kidney and testicular cancer, and other chronic diseases. The plaintiffs estimate that 3M may ultimately be on the hook for nationwide PFAS cleanup costs of up to $142.7 billion. The chemicals in question have stopped being made for decades by 3M, but as they are bioaccumulative, they remain present in the environment for a long time. The trial is seen as \"existential\" as it threatens the existence of life on the planet.3M faces a total liability exceeding their assets to the tune of $142.7 billion due to the toxic chemicals it has manufactured over the years. In the case of bankruptcy, creditors, including the US government, bondholders, and equity shareholders, will be arranged according to seniority. Breaking up the company and selling its more profitable assets, like manufacturing capabilities and intellectual property, to pay off debts may be an option. The idea of shareholders receiving zero may be in question, as some argue that profits made since the 1970s should be clawed back. The concept of limited liability, the ability of shareholders to avoid personal responsibility for the actions of the business, is being challenged by the idea of making individuals responsible and legally empowered. Nationalizing the company has been suggested given their importance to strategically important materials.3M is facing a potential payout due to a lawsuit about the safety of their chemicals, called PFAS, that lasted over 60 years and are toxic. Some people suggest that the company's board and C-Suite need to be punished for their actions, while others argue that nationalizing the company is not a viable solution, and punishing the individuals responsible would be the best option. The PFAS chemicals used by 3M prove that it will kill more people than any terrorist attack, and it's not fair that taxpayers should be liable for corporate misdeeds repeatedly. Finally, many chemical products present dangers to health, such as those in our food supply chain, mainly vegetable oils.The comments do not provide meaningful tech news summary.",
    "hn_summary": "- 3M is facing a $143B litigation centered around toxic PFAS chemicals that were still legal to use despite being known to be harmful to humans.\n- PFAS is used in everyday products and the trial highlights the importance of regulating chemical use and transparency, especially when it comes to public health.\n- The trial is seen as \"existential\" as it threatens the existence of life on the planet, while breaking up the company and nationalizing it have been suggested as potential solutions."
  }
]
