[
  {
    "id": 39444500,
    "title": "Zvýšenie ochrany súkromia v službe Signal: Skryte svoje telefónne číslo pomocou používateľských mien",
    "originLink": "https://signal.org/blog/phone-number-privacy-usernames/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39444500",
    "commentBody": "",
    "originSummary": [
      "Služba Signal zvyšuje súkromie tým, že umožňuje používateľom predvolene skrývať svoje telefónne čísla a používať na komunikáciu jedinečné používateľské mená, čím kontroluje, kto ich môže zistiť podľa telefónneho čísla.",
      "Používateľské mená sú v chatoch súkromné a môžu sa vymieňať na spojenie bez odhalenia telefónnych čísel, pričom používatelia môžu kedykoľvek flexibilne upraviť nastavenia a používateľské mená.",
      "Tieto nové funkcie sú voliteľné a ich cieľom je zachovať súkromie počas interakcie na platforme Signal."
    ],
    "commentSummary": [
      "V diskusiách sa rozoberá ochrana súkromia, bezpečnosť, šifrovanie a identifikácia používateľov v aplikáciách na zasielanie správ, ako sú Telegram a Signal, a riešia sa obavy týkajúce sa finančnej udržateľnosti, príslušnosti k vládam a implementácie zabezpečenia.",
      "Používatelia diskutujú o krehkej rovnováhe medzi súkromím a pohodlím, pričom zvažujú používanie používateľských mien a kódov priateľov ako alternatívy k telefónnym číslam na identifikáciu na platformách na zasielanie správ.",
      "Medzi témy patria techniky šifrovania, pravidlá vypršania platnosti aplikácií, zhromažďovanie údajov a kompromisy medzi použiteľnosťou a súkromím, ako aj skúmanie overovania totožnosti, prevencia spamu a navrhovanie alternatívnych metód zabezpečenia online komunikácie."
    ],
    "points": 1183,
    "commentCount": 704,
    "retryCount": 0,
    "time": 1708452065
  },
  {
    "id": 39447041,
    "title": "Kagi Sidekick: Nástroj na rýchle vyhľadávanie a AI chat",
    "originLink": "https://sidekick.kagi.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39447041",
    "commentBody": "",
    "originSummary": [
      "Kagi Sidekick umožňuje rýchle vyhľadávanie, AI chat a indexovanie na webových stránkach s použitím minimálneho kódu, pričom sa zameriava na osobné stránky alebo stránky s dokumentáciou.",
      "Je bezplatný pre malé/osobné webové stránky a ponúka komerčným stránkam možnosti za rozumnú cenu vrátane zaradenia do vyhľadávania Kagi.",
      "Používatelia, ktorí majú o nástroj záujem, sa môžu zapojiť do diskusného vlákna Sidekick alebo sa pripojiť ku komunite Kagi na Discorde, kde získajú aktualizácie a spätnú väzbu."
    ],
    "commentSummary": [
      "Rozhovor sa zameriava na Kagi Sidekick, alfa koncept spoločnosti Kagi Labs, ktorý má rozšíriť ich zbierku osobných webových stránok a startupov, pričom sa dotýka rizík obsahu generovaného umelou inteligenciou, taktiky SEO a problémov neziskových wiki.",
      "Používatelia kladú technické otázky o fungovaní vyhľadávacieho nástroja, vymieňajú si skúsenosti a navrhujú vylepšenia, zatiaľ čo niektorí spochybňujú hodnotu služieb Kagi a uvažujú o ich zámeroch, ktoré stoja za ponukou nových bezplatných iniciatív.",
      "Diskusia zdôrazňuje význam poskytovania hodnotného obsahu a transparentného marketingu pre účinnú propagáciu v technologickom priemysle."
    ],
    "points": 562,
    "commentCount": 130,
    "retryCount": 0,
    "time": 1708463900
  },
  {
    "id": 39443965,
    "title": "Zvýšime efektivitu tokenizácie GPT",
    "originLink": "https://www.youtube.com/watch?v=zduSFxRajkE",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39443965",
    "commentBody": "",
    "originSummary": [
      "Text zdôrazňuje význam tokenizácie vo veľkých jazykových modeloch, ako je GPT-2, a ukazuje jej vplyv na výkonnosť modelu a spracovanie jazyka.",
      "Vysvetľujú sa techniky, ako je kódovanie párov bajtov, aby sa zdôraznila dôležitosť účinnej tokenizácie na zvýšenie výkonu modelu, pričom sa skúmajú rôzne algoritmy tokenizácie a metódy kódovania, ako je utf8.",
      "Osobitná pozornosť sa venuje práci so špeciálnymi tokenmi, tréningu slovníkov tokenizéra a prekonávaniu problémov, ktoré predstavuje veľká veľkosť slovníka v transformátoroch."
    ],
    "commentSummary": [
      "Fórum upozorňuje na prehliadaný aspekt používania tokenov v modeloch GPT a navrhuje návody a zdroje na pochopenie modelov transformátorov a inžinierstva umelej inteligencie.",
      "Používatelia sa delia o svoje skúsenosti s využívaním LLM na rôzne aplikácie a odporúčajú špičkové učebné materiály z oblasti informatiky.",
      "Medzi zmienkami sú aj videá Andreja Karpathyho a jeho postrehy o prechode z tradičného back-end inžinierstva do vzrušujúcej oblasti inžinierstva umelej inteligencie."
    ],
    "points": 547,
    "commentCount": 33,
    "retryCount": 0,
    "time": 1708449630
  },
  {
    "id": 39440179,
    "title": "Na obranu jednoduchých architektúr: Prípad spoločnosti Wave, ktorá má hodnotu 1,7 miliardy dolárov",
    "originLink": "https://danluu.com/simple-architectures/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39440179",
    "commentBody": "",
    "originSummary": [
      "Spoločnosť Wave, ktorá má hodnotu 1,7 miliardy dolárov, si zvolila jednoduchú architektúru aplikácie CRUD s monolitom Python na Postgres, podobne ako Stackoverflow, čo svedčí o uprednostňovaní jednoduchosti pred zložitosťou pri škálovateľnosti.",
      "Spoločnosť spracúva miliardy požiadaviek mesačne pomocou synchrónneho jazyka Python a frontu úloh, pričom počas globálnej expanzie naráža na prekážky v oblasti integrácie telekomunikačných systémov a dodržiavania právnych predpisov.",
      "Napriek technologickým trendom, ktoré uprednostňujú zložité nastavenia, spoločnosť Wave využíva GraphQL, Kubernetes a vlastné transportné protokoly pre svoje API, pričom sa zameriava na jednoduchosť prevádzky a nákladovú efektívnosť s malým tímom inžinierov."
    ],
    "commentSummary": [
      "Článok skúma výhody a nevýhody mikroslužieb v porovnaní s monolitickými architektúrami v softvérovom inžinierstve, pričom zdôrazňuje disciplínu, organizačné usporiadanie a komunikáciu.",
      "Diskusie sa týkajú škálovateľnosti, udržiavateľnosti, zložitosti a toho, ako architektonické rozhodnutia ovplyvňujú výkonnosť a integritu údajov, najmä v oblasti finančných služieb.",
      "Dôraz sa kladie na dosiahnutie rovnováhy medzi jednoduchosťou a zložitosťou, splnenie obchodných cieľov, dosiahnutie hmatateľných výsledkov a zvládnutie prechodov medzi úlohami a technológiami v tejto oblasti."
    ],
    "points": 547,
    "commentCount": 409,
    "retryCount": 0,
    "time": 1708429834
  },
  {
    "id": 39443679,
    "title": "Pokroky v oblasti SSD predstihli ponuky cloudu",
    "originLink": "http://databasearchitects.blogspot.com/2024/02/ssds-have-become-ridiculously-fast.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39443679",
    "commentBody": "",
    "originSummary": [
      "Príspevok na blogu poukazuje na pokrok v technológii SSD v oblasti rýchlosti a kapacity a dáva do kontrastu zlepšenie komoditných SSD so stagnujúcim výkonom cloudových SSD od hlavných dodávateľov, ako sú AWS a Azure.",
      "Špekuluje sa o možných dôvodoch rozdielov vo výkonnosti cloudových SSD, ako sú obavy zo zlyhania zariadenia, obmedzený dopyt po rýchlejšom úložisku a potenciálne narušenie existujúcich služieb ukladania.",
      "V príspevku sa obhajuje budúce zavedenie rýchlejších diskov SSD v cloudových inštanciách, čo naznačuje nádejné vyhliadky na rozšírené možnosti ukladania dát v cloude."
    ],
    "commentSummary": [
      "Diskusia sa zaoberá výzvami výkonu SSD v cloude, riešením obmedzení sieťových protokolov, optimalizáciou úložísk v platformách, ako je AWS, konfiguráciami CPU a ekonomickými vplyvmi nastavení úložísk.",
      "Témy zahŕňajú vplyv konfigurácií úložísk na výkonnosť virtuálnych strojov, latenciu siete, stratégie na zvýšenie výkonu cloudu a diskusie o nasadení komunikačných protokolov a abstrakcii hardvéru v cloudových službách.",
      "Zdôrazňuje tiež význam lokálne pripojených diskov SSD, problémy so sieťovou latenciou, spoľahlivé podnikové disky a rovnováhu medzi výkonom a odolnosťou pri možnostiach ukladania dát v databázových klastroch."
    ],
    "points": 488,
    "commentCount": 345,
    "retryCount": 0,
    "time": 1708448383
  },
  {
    "id": 39446537,
    "title": "DIY LED maticové náušnice žiaria jasne",
    "originLink": "https://mitxela.com/projects/ledstud",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39446537",
    "commentBody": "",
    "originSummary": [
      "Náušnice s LED matricou sú vyrobené pomocou vlastnej dosky s obvodmi s 0201 LED diódami, ktoré nahrádzajú tradičné komponenty a zlepšujú funkčnosť a estetiku.",
      "Výzvy týkajúce sa spotreby energie a taktovacej frekvencie sú prekonané a výsledkom je funkčný a vizuálne príjemný finálny dizajn náušníc.",
      "Projekt ponúka márnivé zábery hotového produktu a poskytuje prístup ku kompletnému zdrojovému kódu na git.mitxela.com a GitHub pre ďalšie skúmanie."
    ],
    "commentSummary": [
      "Používatelia sa zapájajú do diskusií o príslušenstve LED, ako sú náušnice a manžetové gombíky, vrátane funkcií prenosu dát a synchronizácie hudby.",
      "Diskutuje sa o kreatívnych aplikáciách LED náušníc, technických detailoch manžetových gombíkov a účinnosti batérií.",
      "Rozhovor sa rozširuje o históriu a pokroky v technológii merania času v hodinách a hodinkách."
    ],
    "points": 447,
    "commentCount": 65,
    "retryCount": 0,
    "time": 1708461252
  },
  {
    "id": 39442273,
    "title": "Python Web Scraping: Techniky a osvedčené postupy",
    "originLink": "https://proxiesapi.com/articles/web-scraping-in-python-the-complete-guide",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39442273",
    "commentBody": "",
    "originSummary": [
      "Naučte sa vytvárať webové prehľadávače pomocou knižníc Pythonu, ako je BeautifulSoup, riešiť bežné prekážky pri škrabaní a dodržiavať osvedčené postupy pre rozsiahle škrabanie.",
      "Zoznámte sa s technikami extrakcie údajov zo súborov HTML, využívania selektorov CSS, sťahovania obrázkov a správy dynamického obsahu na zlepšenie možností škrabania.",
      "Implementujte stratégie, ako je oneskorenie prehľadávania, proxy servery, rotujúci používateľskí agenti a simulácia prirodzeného ľudského správania, aby ste zabránili blokovaniu pri zodpovednom škrabaní webových stránok, spolu s využívaním nástrojov, ako je Selenium, na automatizáciu webu."
    ],
    "commentSummary": [
      "Diskusia zahŕňa optimalizáciu pracovných postupov škrabania webových stránok v jazyku Python, pričom sa zdôrazňuje dôležitosť oddelenia krokov prehľadávania a škrabania a využitie ukladania do vyrovnávacej pamäte na dosiahnutie efektívnosti.",
      "Diskusie o procesoch ETL vs. ELT v dátových skladoch zdôrazňujú význam testovania, flexibility a integrity údajov so zameraním na nástroje ako Playwright a výzvy, ktoré predstavuje Cloudflare alebo AWS WAF.",
      "Porovnanie programovacích jazykov na škrabanie webových stránok uprednostňuje Python pred Node.js, zaoberá sa bežnými prekážkami, ako sú chyby 403/401, captcha a paywalls, a navrhuje riešenia, ako sú agenti prehliadača, služby na riešenie captcha a správa proxy serverov."
    ],
    "points": 352,
    "commentCount": 131,
    "retryCount": 0,
    "time": 1708442207
  },
  {
    "id": 39442429,
    "title": "Microsoft odhaľuje hackerov, ktorí používajú jeho nástroje AI na kybernetickú špionáž",
    "originLink": "https://www.schneier.com/blog/archives/2024/02/microsoft-is-spying-on-users-of-its-ai-tools.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39442429",
    "commentBody": "",
    "originSummary": [
      "Čínski, ruskí a iránski hackeri využívajú nástroje umelej inteligencie spoločnosti Microsoft na zlepšenie svojich hackerských zručností, čo vyvoláva obavy z možného narušenia súkromia.",
      "Toto zistenie naznačuje, že spoločnosť Microsoft a iné firmy zaoberajúce sa umelou inteligenciou môžu neúmyselne monitorovať aktivity používateľov pomocou nástrojov umelej inteligencie.",
      "Využívanie umelej inteligencie na kybernetickú špionáž predstavuje významnú hrozbu, ktorá vyvoláva diskusie o otázkach ochrany súkromia a opatreniach dohľadu."
    ],
    "commentSummary": [
      "Zameriava sa na rôzne politiky ochrany osobných údajov a postupy technologických gigantov, ako sú Microsoft, OpenAI a Google, pričom zdôrazňuje obavy týkajúce sa spracovania, monitorovania a dostupnosti údajov.",
      "V diskusii sa zdôrazňuje význam získania informovaného súhlasu, vplyv dohľadu na výcvik umelej inteligencie a možné zneužitie informácií o používateľoch.",
      "Používatelia prejavujú pochybnosti o politikách ochrany súkromia, obhajujú transparentnosť a diskutujú o etických dôsledkoch zhromažďovania údajov a dohľadu v dnešnej digitálnej ére."
    ],
    "points": 347,
    "commentCount": 140,
    "retryCount": 0,
    "time": 1708442902
  },
  {
    "id": 39439655,
    "title": "Vytvorenie 3D mapy sveta Disney pomocou Rustu a WebAssembly",
    "originLink": "https://mary.codes/blog/programming/translating_openstreetmaps_to_HTML5_canvas_rust_wasm/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39439655",
    "commentBody": "",
    "originSummary": [
      "Mary Knizeová vylepšuje svoj projekt Line Buddy využitím údajov OpenStreetMap a využitím Rustu s WebAssembly na vytvorenie 3D mapy zábavných parkov Disney World.",
      "Projekt demonštruje načítanie, spracovanie a prezentáciu mapových údajov pomocou programov Rust a JavaScript s cieľom efektívne spracovať prvky, ako sú budovy, chodníky a vodné plochy, optimalizovať čas načítania a zároveň ponúknuť výber parku.",
      "V blízkej budúcnosti sa plánujú ďalšie vylepšenia, ktoré rozšíria funkčnosť projektu."
    ],
    "commentSummary": [
      "Príspevok sa zaoberá prekladom údajov OpenStreetMap do HTML5 Canvas pomocou programov Rust a WebAssembly, pričom zdôrazňuje vizuálne skreslenia pri mapovaní a obhajuje Mercatorovu projekciu kvôli presnosti.",
      "Diskutuje sa v nej o voľbe medzi JavaScriptom a Rustom na spracovanie údajov a o potenciáli vektorových dlaždíc v OSM, pričom sa navrhuje použiť WebGL na kreslenie s cieľom zvýšiť výkon namiesto prenosu údajov medzi Rustom a JavaScriptom.",
      "V diskusii je tiež zahrnuté používanie rôznych projekcií na presné mapovanie."
    ],
    "points": 342,
    "commentCount": 33,
    "retryCount": 0,
    "time": 1708424881
  },
  {
    "id": 39444282,
    "title": "Všimnite si všestranné možnosti plánovania spoločnosti Picat",
    "originLink": "https://www.hillelwayne.com/post/picat/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39444282",
    "commentBody": "",
    "originSummary": [
      "Picat je jedinečný programovací jazyk, ktorý spája logiku, imperatívne programovanie a riešenie obmedzení.",
      "Autor sa venuje koncepcii plánovania Picat, ukazuje riešenie problémov s trasovaním a skúma rôzne techniky plánovania v Picat.",
      "Hoci má Picat obmedzenia pre produkciu, vyniká pri riešení špecifických výpočtových problémov; GOAP a PDDL sú stručne spomenuté ako alternatívne plánovacie jazyky."
    ],
    "commentSummary": [
      "Príspevok sa zaoberá aplikáciou plánovacieho programovania pre systémy údržby vozového parku, riešením problémov so škálovaním a optimalizačnými riešeniami.",
      "Porovnáva špecializované a všeobecné riešitele a zdôrazňuje CP-SAT ako alternatívu k CPLEX v konkrétnych scenároch.",
      "Diskusia sa venuje rôznym optimalizačným nástrojom, ako je OptaPlanner, open-source riešiteľom a úlohe plánovania v umelej inteligencii, pričom sa spomína Picat a rôzne programovacie jazyky."
    ],
    "points": 293,
    "commentCount": 34,
    "retryCount": 0,
    "time": 1708451105
  },
  {
    "id": 39449424,
    "title": "Keby architekti pracovali ako programátori: Nerealistické požiadavky (1995)",
    "originLink": "http://www.gksoft.com/a/fun/architects.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39449424",
    "commentBody": "",
    "originSummary": [
      "V liste sú architektom predložené protichodné a nereálne požiadavky na návrh a výstavbu domu, ako sú nejasné špecifikácie, rozpočtové obmedzenia, protichodné preferencie a krátky termín.",
      "Architektom sa odporúča, aby zohľadnili názory rôznych členov rodiny, dodržiavali súčasný dizajn a materiály a oslovili potenciálnych budúcich kupujúcich.",
      "V závere listu upozorňuje, aby si hľadali iného architekta, a ako vhodnejšiu alternatívu uvádza cestovný príves."
    ],
    "commentSummary": [
      "Článok a komentáre zdôrazňujú výzvy a podobnosti v oblasti riadenia projektov, komunikácie s klientmi, zodpovednosti a prispôsobivosti medzi architektmi a softvérovými inžiniermi.",
      "Diskutuje sa v nej o dôležitosti spolupráce, pochopení očakávaní klientov a riešení regulačných problémov v oboch oblastiach.",
      "V rozhovore sa kladie dôraz na efektívnu komunikáciu, spoluprácu a riešenie problémov, ktoré sú kľúčové pre riadenie zložitých projektov v oblasti stavebníctva a vývoja softvéru, pričom sa spomínajú dôsledky rozhodnutí v oblasti riadenia projektov a možné dôsledky chýb v každom odvetví."
    ],
    "points": 289,
    "commentCount": 103,
    "retryCount": 0,
    "time": 1708481487
  },
  {
    "id": 39439771,
    "title": "Premena vášho okolia pomocou umelej inteligencie v službe Google Street View",
    "originLink": "https://googlemapsmania.blogspot.com/2024/02/ai-your-home-on-street-view.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39439771",
    "commentBody": "",
    "originSummary": [
      "Panoramia je nový nástroj, ktorý umožňuje používateľom upravovať svoje okolie na službe Google Maps Street View pomocou návrhov umelej inteligencie.",
      "Holandský nástroj Cycling Lifestyle mení ulice na prostredie vhodné pre cyklistov, čím zlepšuje mestské prostredie pre cyklistov.",
      "Street Galleries umožňuje používateľom zdobiť mestá na Street View umeleckými dielami z prestížnych múzeí."
    ],
    "commentSummary": [
      "Príspevok na blogu sa zaoberá úlohou umelej inteligencie pri redizajne služby Google Street View, udržateľným krajinným dizajnom v Kalifornii, prekážkami mestského plánovania, použiteľnosťou webových stránok a výzvami interpolácie umelej inteligencie.",
      "Členovia komunity hodnotia význam zelene, hustej zástavby a súdržnosti komunity, pričom zdôrazňujú dodržiavanie pravidiel fóra a úctivé vzájomné vzťahy.",
      "Komentátori chvália občiansku atmosféru na stránke, moderovanie a ponúkajú návrhy na vylepšenie a riešenie technických problémov."
    ],
    "points": 243,
    "commentCount": 60,
    "retryCount": 0,
    "time": 1708426081
  },
  {
    "id": 39440503,
    "title": "Rozmanité možnosti a služby serverov spoločnosti Hetzner",
    "originLink": "https://robot.hetzner.com/order/index/culture/en_GB",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39440503",
    "commentBody": "",
    "originSummary": [
      "Webová stránka poskytuje rôzne možnosti serverov, ako sú dedikované servery a servery GPU, pričom ceny závisia od typu servera a špecifikácií.",
      "Zákazníci si môžu preniesť servery od iných klientov spoločnosti Hetzner a získať prístup ku kolokačným službám a správe domén.",
      "Výpočet DPH a ceny v miestnej mene sú k dispozícii na základe vybranej krajiny zákazníka."
    ],
    "commentSummary": [
      "Zameriava sa na nový server GPU spoločnosti Hetzner, porovnáva nákladovú efektívnosť prenájmu a kúpy hardvéru, ceny elektrickej energie a životnosť servera.",
      "Diskutuje sa o procesoch registrácie, ponukách VPS cloudov, obmedzeniach GPU, cenách a celkovej kvalite služieb cloud computingu, vrátane skúseností používateľov.",
      "Používatelia sa delia o názory na obavy z podvodov, overovanie totožnosti, dostupnosť GPU a zákaznícku podporu, porovnávajú Hetzner s poskytovateľmi ako DigitalOcean a AMD, pričom sa venujú aj ochrane osobných údajov, cenám NVIDIA a vplyvu ťažby na dostupnosť GPU."
    ],
    "points": 239,
    "commentCount": 146,
    "retryCount": 0,
    "time": 1708432756
  },
  {
    "id": 39443283,
    "title": "Spoločnosť Valve otvorila zdroje Steam Audio SDK 4.5.2 pod Apache 2.0",
    "originLink": "https://www.phoronix.com/news/Steam-Audio-SDK-Fully-Open",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39443283",
    "commentBody": "",
    "originSummary": [
      "Spoločnosť Valve vydala Steam Audio SDK 4.5.2 ako plne otvorený zdrojový kód pod licenciou Apache 2.0, ktorý umožňuje komerčné použitie a úpravy.",
      "Vydanie obsahuje opravy chýb a štandardné aktualizácie a ponúka pohlcujúce zvukové riešenie pre hry a VR, kompatibilné s rôznymi hernými enginmi.",
      "Spoločnosť Valve vyzýva vývojárov, aby prispievali k ďalšiemu zlepšovaniu softvéru."
    ],
    "commentSummary": [
      "Spoločnosť Valve zverejnila zdrojový kód Steam Audio SDK pod licenciou Apache 2.0, čím zlepšila dostupnosť pre vývojárov na rôznych platformách.",
      "Diskusie sa točia okolo dôležitosti šírenia zvuku v stealth hrách, navrhovania metód na výpočet vzdialenosti a modelovania útlmu zvuku a porovnávania zvukových enginov, ako sú Steam Audio, Fmod a Wwise.",
      "Názory používateľov na hardvérové projekty spoločnosti Valve, ako je Steam Deck a náhlavná súprava Apple Vision Pro VR, sa líšia, niektorí sú skeptickí a iní optimistickí, pričom sa zameriavajú na používanie káblov Lightning spoločnosťou Apple a výzvy na trhu VR/AR."
    ],
    "points": 236,
    "commentCount": 61,
    "retryCount": 0,
    "time": 1708446567
  }
]
