[
  {
    "id": 37356497,
    "title": "Wavacity – வலைக்கு ஆடாசிட்டியின் ஒரு FOSS துறைமுகம்",
    "originLink": "https://wavacity.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37356497",
    "commentBody": "",
    "originSummary": [
      "வாவாசிட்டி என்பது ஒரு இலவச, திறந்த மூல ஆன்லைன் ஆடியோ எடிட்டர் ஆகும், இது ஆடாசிட்டியைப் போன்றது, இது வலை உலாவிகளில் நேரடியாகப் பயன்படுத்தப்படலாம்.",
      "ஒற்றுமைகள் இருந்தபோதிலும், வாவாசிட்டி ஆடாசிட்டியுடன் இணைக்கப்படவில்லை அல்லது அங்கீகரிக்கப்படவில்லை.",
      "வெளியிடப்பட்ட வாவாசிட்டி குறியீடு எடிட்டர் செயல்பாடு மற்றும் பயனர் இடைமுகத்திற்கு அவசியமான பல்வேறு செயல்பாடுகள் மற்றும் ஸ்கிரிப்ட்களைக் கொண்டுள்ளது."
    ],
    "commentSummary": [
      "ஆடியோ எடிட்டிங் மென்பொருளான ஆடாசிட்டியின் வலை அடிப்படையிலான பதிப்பான வாவாசிட்டி, அதன் உயர் செயல்திறன் மற்றும் கச்சிதமான கோப்பு அளவு ஆகியவற்றிற்காக பாராட்டைப் பெறுகிறது, இது ஒரு உலாவிக்குள் செயல்பட வெப்அசெம்ப்ளியைப் பயன்படுத்துகிறது.",
      "பயன்பாட்டின் செயல்பாடு குறுக்கு-தள மெய்நிகர் இயந்திரங்களின் சாத்தியமான எதிர்காலம் குறித்த விவாதங்களை எழுப்புகிறது மற்றும் உலாவிக்குள் இயக்க பயன்பாடுகளின் நன்மைகள் மற்றும் குறைபாடுகள் குறித்த விவாதங்களை எழுப்புகிறது.",
      "உரையாடல்கள் பிளெண்டர் போன்ற பயன்பாடுகள் வலை அடிப்படையிலான பயன்பாடுகளாக செயல்படுவதற்கான சாத்தியக்கூறுகளைக் கருத்தில் கொள்கின்றன மற்றும் வலை மற்றும் சொந்த மொபைல் பயன்பாடுகளுக்கு இடையிலான வேறுபாடுகளை வரைகின்றன."
    ],
    "points": 559,
    "commentCount": 89,
    "retryCount": 0,
    "time": 1693604765
  },
  {
    "id": 37354000,
    "title": "டக் லெனட் இறந்துவிட்டார்",
    "originLink": "https://garymarcus.substack.com/p/doug-lenat-1950-2023",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37354000",
    "commentBody": "",
    "originSummary": [
      "இந்த இடுகை, இயந்திரங்கள் புரிந்துகொள்வதற்காக பொது அறிவு அறிவை குறியாக்கம் செய்ய வடிவமைக்கப்பட்ட ஒரு திட்டமான சைக்கில் தனது முன்னோடி பணிக்காக அறியப்பட்ட புகழ்பெற்ற செயற்கை நுண்ணறிவு ஆராய்ச்சியாளரான டக் லெனாட்டுக்கு அஞ்சலி செலுத்துகிறது.",
      "சைக், வணிக ரீதியாக இலாபகரமானதாக இல்லாவிட்டாலும், செயற்கை பொது நுண்ணறிவை நோக்கிய வளர்ச்சிகளுக்கு முக்கியமான ஒரு புரட்சிகர சோதனையாக கேரி மார்கஸால் முன்னிலைப்படுத்தப்படுகிறது.",
      "வளர்ந்து வரும் செயற்கை நுண்ணறிவு ஆராய்ச்சியாளர்களுக்கான சைக்கின் நோக்கங்களைப் புரிந்துகொள்வதன் முக்கியத்துவத்தில் மார்கஸ் கவனம் செலுத்துகிறார், மேலும் அவருடன் இணைந்து எழுதப்பட்ட லெனாட்டின் கடைசி கட்டுரையை ஊக்குவிக்கிறார், இது சைக்கிலிருந்து எடுக்கப்பட்டவை மற்றும் நவீன பெரிய மொழி மாதிரிகளுடன் குறியீட்டு செயற்கை நுண்ணறிவு முறைகளை இணைப்பதற்கான சாத்தியக்கூறுகள் பற்றி விவாதிக்கிறது."
    ],
    "commentSummary": [
      "செயற்கை நுண்ணறிவின் (ஏஐ) முன்னோடியும், சைகார்ப் (பொது செயற்கை நுண்ணறிவில் கவனம் செலுத்தும் நிறுவனம்) நிறுவனருமான டக் லெனட் காலமானார், ஆனால் அவரது பார்வைக்கு அர்ப்பணிப்பின் பாரம்பரியத்தை விட்டுச்சென்றார்.",
      "நரம்பியல் மற்றும் குறியீட்டு செயற்கை நுண்ணறிவு இணைப்பது குறித்த விவாதம் தொடர்கிறது, சைக்கின் அணுகுமுறை மற்றும் ஒருங்கிணைந்த செயற்கை நுண்ணறிவு நுட்பங்களுக்கான விருப்பம் போன்ற பழைய வழிமுறைகளின் பொருத்தம் குறித்த வாதங்கள் தொடர்கின்றன.",
      "லீலா கோர் ஏஐ இயந்திரம் வழக்கமான நரம்பியல் நெட்வொர்க்குகளுக்கு மாறாக அதன் வேகம் மற்றும் வெளிப்படைத்தன்மைக்காக அங்கீகரிக்கப்பட்டுள்ளது, இது வெவ்வேறு அணுகுமுறைகளைப் பயன்படுத்தி நரம்பியல் நெட் மாதிரிகளை பரிசோதித்து கற்பிப்பதற்கான திறனைக் குறிக்கிறது."
    ],
    "points": 498,
    "commentCount": 142,
    "retryCount": 0,
    "time": 1693590276
  },
  {
    "id": 37352356,
    "title": "எக்ஸ் / ட்விட்டர் அதன் சேவை விதிமுறைகளைப் புதுப்பித்துள்ளது, இது செயற்கை நுண்ணறிவு பயிற்சிக்கான இடுகைகளைப் பயன்படுத்த அனுமதிக்கிறது",
    "originLink": "https://stackdiary.com/x-can-now-use-posts-for-ai-training-as-per-terms-of-service/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37352356",
    "commentBody": "",
    "originSummary": [
      "ட்விட்டர் அதன் சேவை விதிமுறைகளை திருத்தியுள்ளது, இது நிறுவனம் செயற்கை நுண்ணறிவு பயிற்சிக்கு பயனர் இடுகைகளைப் பயன்படுத்த உதவுகிறது.",
      "இந்த சரிசெய்தல் தனியுரிமை கவலைகள் மற்றும் மிகவும் தனிப்பயனாக்கப்பட்ட ஆனால் கட்டுப்படுத்தப்பட்ட இணைய அனுபவத்திற்கு வழிவகுக்கும்.",
      "இந்த புதுப்பிப்பு செயற்கை நுண்ணறிவு அமைப்புகளுக்கு ட்விட்டர் தரவைப் பயன்படுத்தும் மூன்றாம் தரப்பு நிறுவனங்களுக்கு அறிவுறுத்திய எலான் மஸ்க்கின் முந்தைய கருத்துகளுக்கு முரணாகத் தெரிகிறது."
    ],
    "commentSummary": [
      "செயற்கை நுண்ணறிவு (ஏஐ) மாதிரிகளைப் பயிற்றுவிக்க பயனர் தரவைப் பயன்படுத்த அனுமதிக்கும் வகையில் ட்விட்டர் அதன் சேவை விதிமுறைகளை மாற்றியமைத்தது, இது தரவு தனியுரிமை மற்றும் செயற்கை நுண்ணறிவு பயிற்சிக்காக ட்விட்டரில் கிடைக்கும் தகவல்களின் தரம் குறித்து பயனர்களிடையே கவலைகளை ஏற்படுத்தியது.",
      "ட்விட்டரில் எலான் மஸ்க்கின் ஈடுபாட்டிலிருந்து முதலாளித்துவம் மற்றும் திறந்த மூல மாற்றுகள் போன்ற பரந்த விஷயங்கள் வரை நீண்டுள்ள இந்த உரையாடல், தரவு மற்றும் தகவல்களுக்கு இடையிலான வேறுபாட்டை வலியுறுத்துகிறது மற்றும் பயனர்கள் தங்கள் தரவைப் பயன்படுத்துவதைப் பற்றி விழிப்புடன் இருக்க ஊக்குவிக்கிறது.",
      "செயற்கை நுண்ணறிவு ஆராய்ச்சியாளர்களை அதன் முழு காப்பகத்திற்கு அணுக அனுமதிக்கும் ட்விட்டர் அறிவிப்பைத் தொடர்ந்து, சேவை, சட்டம் மற்றும் தற்போதைய சமூக தளங்களுக்கு மாற்றீடுகள் ஆகியவற்றின் அடிப்படையில் அதிகரித்த வெளிப்படைத்தன்மை குறித்த விவாதங்கள் எழுந்துள்ளன."
    ],
    "points": 329,
    "commentCount": 268,
    "retryCount": 0,
    "time": 1693583480
  },
  {
    "id": 37351667,
    "title": "யார் பணியமர்த்தப்படுகிறார்கள்? (செப்டம்பர் 2023)",
    "originLink": "https://news.ycombinator.com/item?id=37351667",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37351667",
    "commentBody": "",
    "originSummary": [
      "இருப்பிடம் மற்றும் தொலைதூர வேலை அல்லது விசா ஸ்பான்சர்ஷிப் கிடைப்பது பற்றிய தகவல்கள் உள்ளிட்ட நிறுவனங்களிடமிருந்து வேலை விளம்பரங்களை இந்த இடுகை கோருகிறது.",
      "மேலும் தகவல்களைக் கண்டுபிடிக்க வேலை தேடுபவர்கள் பயன்படுத்தக்கூடிய வளங்கள் மற்றும் இணைப்புகளையும் இது வழங்குகிறது.",
      "வேலை இடுகைகள் குறித்து புகார் செய்ய வேண்டாம் என்று வாசகர்கள் எச்சரிக்கப்படுகிறார்கள், மேலும் தொடர்புடைய நூல்களை மேலும் சூழலுக்குக் குறிப்பிடலாம்."
    ],
    "commentSummary": [
      "மென்பொருள் பொறியாளர்கள், தரவு விஞ்ஞானிகள் மற்றும் தொழில்நுட்ப மேலாளர்கள் போன்ற பதவிகள் உட்பட பல்வேறு துறைகளில் பல நிறுவனங்களில் உள்ள வேலை காலியிடங்களின் விரிவான பட்டியலை இந்த பதவி கொண்டுள்ளது.",
      "இந்த பதவிகளில் செயற்கை நுண்ணறிவு, இயந்திர கற்றல், மென்பொருள் மேம்பாடு தொடர்பான பணிகள் அடங்கும், மேலும் சில நிறுவனங்கள் தொலைதூர வேலை, விசா ஸ்பான்சர்ஷிப் மற்றும் போட்டி சம்பள தொகுப்புகளை வழங்குகின்றன.",
      "சமீபத்தில் நிதி திரட்டிய ஸ்டார்ட்அப் நிறுவனங்கள் மென்பொருள் பொறியியல் துறையில் பல்வேறு வாய்ப்புகளைக் குறிக்கும் கிளவுட் பொறியாளர்கள் மற்றும் தனியுரிமையை மையமாகக் கொண்ட பொறியாளர்கள் போன்ற பணிகளுக்கு தீவிரமாக ஆட்சேர்ப்பு செய்து வருகின்றன."
    ],
    "points": 306,
    "commentCount": 274,
    "retryCount": 0,
    "time": 1693580425
  },
  {
    "id": 37349633,
    "title": "பிரியாவிடை EC2-கிளாசிக், அது வீக்கமடைந்துள்ளது",
    "originLink": "https://www.allthingsdistributed.com/2023/09/farewell-ec2-classic.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37349633",
    "commentBody": "",
    "originSummary": [
      "ஆகஸ்ட் 15, 2023 அன்று, அமேசான் வலை சேவைகள் (ஏ.டபிள்யூ.எஸ்) தங்கள் கிளவுட் கம்ப்யூட்டிங் சேவையான ஈ.சி 2 இன் ஆரம்ப மாறுபாடான ஈ.சி 2-கிளாசிக்கை முற்றிலுமாக நிறுத்தியது, இது கிட்டத்தட்ட 17 ஆண்டுகளாக செயல்பட்டு வந்தது.",
      "EC2-Classic உள்கட்டமைப்பை எளிமையாக நிர்வகித்தது, பயன்பாடுகளை வடிவமைப்பது மற்றும் உருவாக்குவதை எளிதாக்கியது, மேலும் காலப்போக்கில், எலாஸ்டிக் ஐபிக்கள், ஆட்டோ ஸ்கேலிங், சுமை சமநிலை மற்றும் விபிசி போன்ற புதிய அம்சங்களுடன் உருவானது, இது தனித்தனியாக நிர்வகிக்கப்படும் கிளவுட் பிரிவுகளின் வடிவமைப்பிற்கு வழிவகுத்தது.",
      "ஈசி 2-கிளாசிக்கின் ஓய்வு கிளவுட் கம்ப்யூட்டிங்கின் முன்னேற்றத்தில் ஒரு குறிப்பிடத்தக்க படியைக் குறிக்கிறது; இருப்பினும், வாடிக்கையாளர் பயன்பாட்டிற்கான தகவமைக்கக்கூடிய அமைப்புகளை மேம்படுத்துவதற்கும் உருவாக்குவதற்கும் AWS அர்ப்பணிக்கப்பட்டுள்ளது."
    ],
    "commentSummary": [
      "இந்த கட்டுரை அமேசான் வலை சேவைகள் (ஏ.டபிள்யூ.எஸ்) ஈ.சி 2-கிளாசிக் ஓய்வு மற்றும் மெய்நிகர் தனியார் கிளவுட் (வி.பி.சி) க்கு மாறுவதில் கவனம் செலுத்துகிறது, புதிய தளத்தின் அதிகரித்த சிக்கலான தன்மை குறித்து பயனர்கள் கவலைகளை வெளிப்படுத்தினர்.",
      "AWS OpsWorks இன் மூடல் சந்தை இயக்கவியலில் அதன் சாத்தியமான தாக்கத்துடன் விவாதிக்கப்படுகிறது, அதே நேரத்தில் பயனர்கள் கூகுளின் வருவாய் சார்ந்த கவனம் மற்றும் குறைந்து வரும் தேடல் முடிவு தரம் குறித்து விமர்சனங்களை வெளிப்படுத்துகிறார்கள்.",
      "இந்த உரை பிளாக்கிங் சுற்றுச்சூழல் அமைப்பில் கூகிள் ரீடரின் மூடல் மற்றும் கூகிள் + க்கான கூகிளின் அணுகுமுறை மீதான அதிருப்தி ஆகியவற்றின் விளைவுகளை எடுத்துக்காட்டுகிறது, இது பழைய கிளவுட் வழங்கல்களிலிருந்து புதிய கிளவுட் வழங்கல்களுக்கு மாறுவதற்கான பரந்த சவால்களை அடிக்கோடிட்டுக் காட்டுகிறது."
    ],
    "points": 271,
    "commentCount": 175,
    "retryCount": 0,
    "time": 1693569426
  },
  {
    "id": 37348808,
    "title": "Lidl Product Recall [pdf]",
    "originLink": "https://www.lidl.co.uk/static/assets/Paw_Patrol_Public_Recall_poster-500790.pdf",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37348808",
    "commentBody": "",
    "originSummary": ["\"\""],
    "commentSummary": [
      "ஹேக்கர் நியூஸ் விவாதத்தின் மைய கருப்பொருள் சில்லறை தயாரிப்புகளில் சமரசம் செய்யப்பட்ட அல்லது காலாவதியான க்யூஆர் குறியீடுகளைச் சுற்றி வருகிறது, குறிப்பாக, குழந்தைகளின் சிற்றுண்டி பொருட்கள் மற்றும் தயாரிப்புகள், ஐடி மற்றும் பாதுகாப்பு குழுக்களை படத்தில் கொண்டு வருகிறது.",
      "சமரசம் செய்யப்பட்ட சப்ளையர் யுஆர்எல் காரணமாக பாவ் பெட்ரோல் பிராண்டட் பொருட்களுக்கு லிடில் ஜிபியால் ஒரு தயாரிப்பு திரும்பப் பெறுதல் தொடங்கப்பட்ட ஒரு வழக்கை இது கோடிட்டுக் காட்டுகிறது, இது அத்தகைய திரும்பப் பெறுதல்களிலிருந்து கழிவுகள் மற்றும் ஒரு முறை பயன்படுத்தும் பிளாஸ்டிக் பிரச்சினை குறித்த விவாதங்களைத் தூண்டுகிறது.",
      "குழந்தைகளின் கார்ட்டூன்களில் சட்ட அமலாக்கம் மற்றும் அந்தந்த சந்தைப்படுத்தல் மூலோபாயம் போன்ற தலைப்புகளில் இந்த இடுகை பயணிக்கிறது, இது விவாதத்தின் பன்முகத்தன்மையை நிரூபிக்கிறது."
    ],
    "points": 260,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1693562862
  },
  {
    "id": 37355487,
    "title": "ஆஃப்லைனில் மில்லியன் கணக்கான பக்கங்கள் வழியாக விக்கிப்பீடியா தேடல்",
    "originLink": "https://www.leebutterman.com/2023/06/01/offline-realtime-embedding-search.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37355487",
    "commentBody": "",
    "originSummary": [
      "இந்த உரை விக்கிப்பீடியாவிற்காக வடிவமைக்கப்பட்ட உலாவி அடிப்படையிலான தேடுபொறியை அறிமுகப்படுத்துகிறது, இது பயனர்கள் பொருத்தமான முடிவுகளை ஆஃப்லைனில் கண்டுபிடிக்க உதவுகிறது, வாக்கிய டிரான்ஸ்பார்மர்கள், தயாரிப்பு குவாண்டிசேஷன் மற்றும் டிரான்ஸ்பார்மர்கள் மூலம் தேடல் அனுபவத்தை மேம்படுத்துகிறது.js.",
      "முகத் தேடலைக் கொண்டிருக்கும் இந்த இயந்திரம் பயனர்கள் குறிப்பிட்ட துணைப் பிரிவுகளுக்குள் தேட அனுமதிக்கிறது. இது மில்லியன் கணக்கான உட்பொதிப்புகளை ஆதரிக்கும் திறன் கொண்ட ஒரு சிறிய தரவுத்தளத்தைக் கொண்டுள்ளது, தேடல் முடிவுகள் படிப்படியாக புதுப்பிக்கப்படுகின்றன.",
      "கோடிட்டுக் காட்டப்பட்ட செயல்முறையில் விக்கிப்பீடியா முழுவதையும் உட்பொதித்தல், இந்த உட்பொதிப்புகளை சுருக்குதல், பின்னர் திறமையான தரவு சேமிப்பிற்காக ஓ.என்.என்.எக்ஸ் (திறந்த நரம்பியல் நெட்வொர்க் எக்ஸ்சேஞ்ச்) மாதிரிகள் மற்றும் அம்பு வடிவமைப்பைப் பயன்படுத்துதல் ஆகியவை அடங்கும்."
    ],
    "commentSummary": [
      "இந்த இடுகை ஒரு வலை அடிப்படையிலான விக்கிபீடியா தேடுபொறியைப் பற்றியது, இது முடிவுகளைத் தர வாக்கிய உட்பொதிப்புகளைப் பயன்படுத்துகிறது, இருப்பினும் பயனர்கள் முடிவுகளின் துல்லியத்தை கேள்வி எழுப்புகிறார்கள்.",
      "வாக்கியங்களை மட்டுமே வரையறுப்பது மற்றும் அதிக தரவுத்தொகுப்புகளை இணைப்பது போன்ற முன்னேற்றத்திற்கான பரிந்துரைகள் செய்யப்படுகின்றன.",
      "டெவலப்பர் இந்த சிக்கல்களை அங்கீகரிக்கிறார், தரவுத்தளத்தை மேம்படுத்துவதில் ஆர்வம் காட்டுகிறார், சில பயனர்கள் இதேபோன்ற செயற்கை நுண்ணறிவு தேடல் சேவைகளுடன் அனுபவங்களைப் பகிர்ந்துகொள்கிறார்கள் மற்றும் சாத்தியமான ஒத்துழைப்புகளை பரிந்துரைக்கின்றனர்."
    ],
    "points": 253,
    "commentCount": 49,
    "retryCount": 0,
    "time": 1693598119
  },
  {
    "id": 37351157,
    "title": "ஒற்றை ஜோடி ஈதர்நெட்டில் ஒரு ஆழமான டைவ்",
    "originLink": "https://electricui.com/blog/spe-sensor-node",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37351157",
    "commentBody": "",
    "originSummary": [
      "அதிக தரவு விகிதங்கள், சக்தி விநியோகம் மற்றும் எளிமைப்படுத்தப்பட்ட வயரிங் ஆகியவற்றிற்கான ஒற்றை ஜோடி ஈதர்நெட் (எஸ்பிஇ) மற்றும் பவர் ஓவர் டேட்டா லைன்ஸ் (பிஓடிஎல்) ஆகியவற்றின் ஆய்வு குறித்து ஆசிரியர் விவாதிக்கிறார்.",
      "அலை நடத்தை அளவீட்டிற்கான சென்சார் முனை உருவாக்கம் மற்றும் சோதனையும் திட்டத்தின் ஒரு சிறப்பம்சமாகும்.",
      "வாட்டர் ப்ரூஃப் வீட்டுவசதி மற்றும் பிசிபி வடிவமைப்பு, வெவ்வேறு சென்சார்கள் மற்றும் நூலகங்களைப் பயன்படுத்தி ஃபார்ம்வேர் மேம்பாடு மற்றும் எதிர்கொண்ட சவால்களை சமாளிப்பது போன்ற பல நிலைகள் செயல்முறையின் ஒரு பகுதியாகும்."
    ],
    "commentSummary": [
      "தன்னாட்சி வாகனங்கள் மற்றும் நீருக்கடியில் சென்சார் வரிசைகளில் சக்தி மற்றும் தரவு பரிமாற்றம் போன்ற பல்வேறு பயன்பாடுகளில் ஒற்றை ஜோடி ஈத்தர்நெட்டின் (எஸ்பிஇ) செயல்திறனை இந்த கட்டுரை எடுத்துக்காட்டுகிறது.",
      "1 ஜிபி செயல்திறனில் உள்ள பவர் ஓவர் டேட்டா லைன் (பிஓடிஎல்) 100 எம்பியை விட முக்கியமானது, மேலும் இது 1 ஜிபி நெறிமுறையில் முன்னோக்கிய பிழை திருத்தம் (எஃப்இசி) உள்ளடக்கியது.",
      "எஸ்பிஇ வீட்டு பயனர்கள் மற்றும் ஐஓடி பயன்பாடுகளுக்கு நன்மைகளை வழங்குவது மட்டுமல்லாமல், ஜிகாபிட் ஈதர்நெட் தூர வரம்புகளை கடப்பதில் அதன் திறன்கள் காரணமாக நுகர்வோர் சாதனங்களிலும் ஏற்றுக்கொள்ளப்படலாம்."
    ],
    "points": 214,
    "commentCount": 66,
    "retryCount": 0,
    "time": 1693577879
  },
  {
    "id": 37352486,
    "title": "அப்பாவி மக்களின் சொத்துக்களை போலீசார் பறிமுதல் செய்து, பல ஆண்டுகளாக வைத்திருந்தனர். ஸ்காட்டஸ் என்ன செய்யும்?",
    "originLink": "https://reason.com/2023/07/11/police-seized-innocent-peoples-property-and-kept-it-for-years-what-will-the-supreme-court-do/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37352486",
    "commentBody": "",
    "originSummary": [
      "சிவில் சொத்து பறிமுதல் தொடர்பான வழக்கை மறுஆய்வு செய்ய உச்ச நீதிமன்றம் தயாராகி வருகிறது, இது சட்ட அமலாக்கத்திற்கு அவர்களின் குற்றத்தை நிரூபிக்காமல் அவர்களின் சொத்துக்களை பறிமுதல் செய்ய உதவுகிறது.",
      "இந்த நடைமுறை முறையான செயல்முறையை அலட்சியப்படுத்துவதாலும், அப்பாவி சொத்து உரிமையாளர்கள் மீது அது சுமத்தும் நிதி அழுத்தத்திற்காகவும் விமர்சனத்திற்கு உள்ளாகியுள்ளது, அவர்கள் தங்கள் சொத்துக்களை மீட்டெடுக்க போராடக்கூடும்.",
      "சட்ட அமுலாக்க நிறுவனங்கள் இந்த நடைமுறையை அடிக்கடி பண ஆதாயத்திற்காகப் பயன்படுத்துகின்றன என்றும், அரசாங்கம் பொறுப்புக்கூறலை மறுக்கிறது மற்றும் முறையான செயல்முறையை புறக்கணிக்கிறது, இது பெரும்பாலும் தனிநபர்களை அதிக அளவில் பாதிக்கிறது என்றும் வாதிடப்படுகிறது."
    ],
    "commentSummary": [
      "இந்த விவாதத்தில் முன்னிலைப்படுத்தப்பட்ட பிரச்சினை அமெரிக்காவில் சிவில் சொத்து பறிமுதல் ஆகும், இது குறிப்பிடத்தக்க தரவு பற்றாக்குறை மற்றும் சீர்திருத்தத்திற்கான கோரிக்கையை அடிக்கோடிட்டுக் காட்டுகிறது.",
      "பங்கேற்பாளர்கள் பொலிஸ் ஊழல் மற்றும் உள்ளக அதிகார இயக்கவியல் முதல் சாத்தியமான தீர்வுகள் வரை பரந்த விவாதங்களை ஆராய்கின்றனர், சிவில் பறிமுதல் மற்றும் வாக்களிப்பு வரம்புகளின் அவசியம் குறித்து மாறுபட்ட கருத்துக்களைக் கொண்டுள்ளனர்.",
      "உரையாடல் சட்ட, பொருளாதார மற்றும் சமூக கருப்பொருள்களாகவும் மாறுகிறது; மேலும் , கட்டுரையில் முன்வைக்கப்பட்ட விவரிப்புகள் மற்றும் சிவில் சொத்து பறிமுதல் பற்றிய எதிர்மறையான கண்ணோட்டத்திற்கான சாத்தியமான தீர்வுகள் குறித்து அவர்கள் சந்தேகத்தை வெளிப்படுத்துகின்றனர் ."
    ],
    "points": 203,
    "commentCount": 156,
    "retryCount": 0,
    "time": 1693583981
  },
  {
    "id": 37351628,
    "title": "வர்த்தக முத்திரை சிக்கல்களை மேற்கோள் காட்டி சட்டமன்ற மொழி குருவின் டொமைன்களை ஏ.ஆர்.எம் நீக்குகிறது",
    "originLink": "https://www.theregister.com/2023/08/31/a_star_star_domains/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37351628",
    "commentBody": "",
    "originSummary": [
      "சட்டமன்ற மொழி மற்றும் பாதுகாப்பு ஆராய்ச்சியில் அங்கீகரிக்கப்பட்ட நிபுணரான மரியா மார்க்ஸ்டெட்டருக்கு, arm-assembly.com தனது டொமைன் பெயரில் தங்கள் வர்த்தக முத்திரையைப் பயன்படுத்தியதற்காக ஆர்மின் வழக்கறிஞர்களிடமிருந்து இடைநிறுத்த உத்தரவு வழங்கப்பட்டுள்ளது.",
      "ஆர்மின் அறிவுறுத்தல் செட் கட்டிடக்கலை (ஐ.எஸ்.ஏ) பற்றிய புத்தகம் உட்பட அவரது விரிவான எழுத்து மூலம் ஆர்மிற்கு அவர் பங்களிப்புகள் இருந்தபோதிலும், அவரது ஹோஸ்டிங் வழங்குநர் இதேபோன்ற நிறுத்தம் மற்றும் நிறுத்த கடிதத்தைப் பெற்ற பின்னர் அவரது வலைத்தளங்கள் அகற்றப்பட்டன.",
      "ஆர்மின் நடவடிக்கைகளுக்கான விமர்சனங்களுக்கு மத்தியில், ஆர்ம் தனது புத்தகத்தை பல்கலைக்கழகங்களுக்கும் அதை வாங்க முடியாத நபர்களுக்கும் நன்கொடையாக வழங்க வேண்டும் என்று மார்க்ஸ்டெட்டர் முன்மொழிந்துள்ளார், இருப்பினும் இந்த பரிந்துரைக்கு இதுவரை எந்த பதிலும் இல்லை."
    ],
    "commentSummary": [
      "செமிகண்டக்டர் தொழில்நுட்பத்தின் முன்னணி வழங்குநரான ஏ.ஆர்.எம், டொமைன் பெயர்களுடன் இணைக்கப்பட்ட வர்த்தக முத்திரை மீறல் தொடர்பாக ஒரு புகழ்பெற்ற டெவலப்பருக்கு எதிராக சட்ட நடவடிக்கைகளை மேற்கொண்டு வருகிறது.",
      "ஏ.ஆர்.எம் இன் இந்த நடவடிக்கை தொழில்நுட்ப சமூகத்தில் ஒரு விவாதத்தைத் தூண்டியுள்ளது, சிலர் அவர்களின் அணுகுமுறையை விமர்சிக்கின்றனர், மற்றவர்கள் தங்கள் அறிவுசார் சொத்துக்களைப் பாதுகாப்பதாகக் கூறுகின்றனர்.",
      "வர்த்தகமுத்திரை அமலாக்கத்திற்கு தானியங்கி அமைப்புகளைப் பயன்படுத்துவது குறித்து ஒரு பரந்த விவாதம் உள்ளது, சாத்தியமான பாதகமான விளைவுகள் குறித்த கேள்விகள் மேலும் சர்ச்சையை ஏற்படுத்துகின்றன."
    ],
    "points": 196,
    "commentCount": 88,
    "retryCount": 0,
    "time": 1693580252
  }
]
