[
  {
    "id": 37356497,
    "title": "- ওয়াভাসিটি - ওয়েবে অডাসিটির একটি এফওএসএস পোর্ট",
    "originLink": "https://wavacity.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37356497",
    "commentBody": "",
    "originSummary": [
      "Wavacity একটি বিনামূল্যে, ওপেন-সোর্স অনলাইন অডিও এডিটর, অডাসিটির অনুরূপ, যা সরাসরি ওয়েব ব্রাউজারগুলিতে ব্যবহার করা যেতে পারে।",
      "সাদৃশ্য থাকা সত্ত্বেও, ওয়াভাসিটি অডাসিটির সাথে সম্পর্কিত বা অনুমোদিত নয়।",
      "প্রকাশিত ওয়াভাসিটি কোডে সম্পাদকের কার্যকারিতা এবং ব্যবহারকারী ইন্টারফেসের জন্য প্রয়োজনীয় বিভিন্ন ফাংশন এবং স্ক্রিপ্ট রয়েছে।"
    ],
    "commentSummary": [
      "অডিও এডিটিং সফ্টওয়্যার অডাসিটির একটি ওয়েব-ভিত্তিক সংস্করণ ওয়াভাসিটি তার উচ্চ কর্মক্ষমতা এবং কম্প্যাক্ট ফাইল আকারের জন্য প্রশংসা অর্জন করছে, একটি ব্রাউজারের মধ্যে কাজ করার জন্য ওয়েবঅ্যাসেম্বলিকে ব্যবহার করছে।",
      "অ্যাপ্লিকেশনটির কার্যকারিতা ক্রস-প্ল্যাটফর্ম ভার্চুয়াল মেশিনগুলির সম্ভাব্য ভবিষ্যত সম্পর্কে আলোচনা উত্থাপন করে এবং ব্রাউজারের মধ্যে অপারেটিং অ্যাপ্লিকেশনগুলির সুবিধা এবং অসুবিধাগুলি নিয়ে বিতর্ক উত্থাপন করে।",
      "কথোপকথনগুলি ওয়েব-ভিত্তিক অ্যাপ্লিকেশন হিসাবে ব্লেন্ডারের মতো অ্যাপ্লিকেশনগুলির কার্যকারিতার সম্ভাবনাগুলি বিবেচনা করছে এবং ওয়েব এবং নেটিভ মোবাইল অ্যাপ্লিকেশনগুলির মধ্যে পার্থক্য আঁকছে।"
    ],
    "points": 559,
    "commentCount": 89,
    "retryCount": 0,
    "time": 1693604765
  },
  {
    "id": 37354000,
    "title": "ডগ লেনাট মারা গেছেন",
    "originLink": "https://garymarcus.substack.com/p/doug-lenat-1950-2023",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37354000",
    "commentBody": "",
    "originSummary": [
      "পোস্টটি প্রখ্যাত এআই গবেষক ডগ লেনাতের প্রতি শ্রদ্ধা নিবেদন করে, যিনি সাইকের অগ্রণী কাজের জন্য পরিচিত, একটি প্রকল্প যা মেশিনগুলি বোঝার জন্য সাধারণ জ্ঞানকে এনকোড করার জন্য ডিজাইন করা হয়েছে।",
      "সাইক, যদিও বাণিজ্যিকভাবে লাভজনক নয়, গ্যারি মার্কাস কৃত্রিম সাধারণ বুদ্ধিমত্তার দিকে উন্নয়নের জন্য গুরুত্বপূর্ণ একটি বিপ্লবী পরীক্ষা হিসাবে তুলে ধরেছেন।",
      "মার্কাস উদীয়মান এআই গবেষকদের জন্য সাইকের উদ্দেশ্যগুলি বোঝার তাৎপর্যের উপর দৃষ্টি নিবদ্ধ করেন এবং তার সাথে সহ-লেখক লেনাটের শেষ গবেষণাপত্রটি প্রচার করেন, যা সাইকের টেকওয়ে এবং আধুনিক বৃহত ভাষা মডেলগুলির সাথে প্রতীকী এআই পদ্ধতিগুলি একীভূত করার সম্ভাবনাগুলি নিয়ে আলোচনা করে।"
    ],
    "commentSummary": [
      "কৃত্রিম বুদ্ধিমত্তার (এআই) অগ্রদূত এবং সাইকর্প (সাধারণ এআই-এর উপর দৃষ্টি নিবদ্ধ একটি সংস্থা) এর প্রতিষ্ঠাতা ডগ লেনাত মারা গেছেন তবে তার দৃষ্টিভঙ্গির প্রতি উৎসর্গের উত্তরাধিকার রেখে গেছেন।",
      "নিউরাল এবং প্রতীকী এআই য়ের একীভূতকরণ সম্পর্কিত বিতর্ক অব্যাহত রয়েছে, সাইকের পদ্ধতির মতো পুরানো প্রক্রিয়াগুলির প্রাসঙ্গিকতা এবং সম্মিলিত এআই কৌশলগুলির অগ্রাধিকার সম্পর্কে যুক্তি সহ।",
      "প্রচলিত নিউরাল নেটওয়ার্কগুলির বিপরীতে লীলা কোর এআই ইঞ্জিনটি তার গতি এবং স্বচ্ছতার জন্য স্বীকৃত, বিভিন্ন পদ্ধতি ব্যবহার করে নিউরাল নেট মডেলগুলি পরীক্ষা এবং শেখানোর সম্ভাবনা নির্দেশ করে।"
    ],
    "points": 498,
    "commentCount": 142,
    "retryCount": 0,
    "time": 1693590276
  },
  {
    "id": 37352356,
    "title": "এক্স / টুইটার এআই প্রশিক্ষণের জন্য পোস্টগুলি ব্যবহার করার অনুমতি দেওয়ার জন্য তার পরিষেবার শর্তাবলী আপডেট করেছে",
    "originLink": "https://stackdiary.com/x-can-now-use-posts-for-ai-training-as-per-terms-of-service/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37352356",
    "commentBody": "",
    "originSummary": [
      "টুইটার তার পরিষেবার শর্তাবলী সংশোধন করেছে, সংস্থাটিকে এআই প্রশিক্ষণের জন্য ব্যবহারকারীর পোস্টগুলি ব্যবহার করতে সক্ষম করেছে।",
      "এই সমন্বয়টি গোপনীয়তার উদ্বেগ এবং সম্ভাব্যভাবে আরও ব্যক্তিগতকৃত কিন্তু সীমাবদ্ধ ইন্টারনেট অভিজ্ঞতার দিকে পরিচালিত করতে পারে।",
      "এই আপডেটটি ইলন মাস্কের অতীত মন্তব্যের বিপরীত বলে মনে হচ্ছে, যিনি এআই সিস্টেমের জন্য টুইটার ডেটা ব্যবহার কারী তৃতীয় পক্ষের সংস্থাগুলিকে সতর্ক করেছিলেন।"
    ],
    "commentSummary": [
      "কৃত্রিম বুদ্ধিমত্তা (এআই) মডেলগুলি প্রশিক্ষণের জন্য ব্যবহারকারীর ডেটা ব্যবহারের অনুমতি দেওয়ার জন্য টুইটার তার পরিষেবার শর্তাবলী সংশোধন করেছে, যা ব্যবহারকারীদের মধ্যে ডেটা গোপনীয়তা এবং এআই প্রশিক্ষণের জন্য টুইটারে উপলব্ধ তথ্যের গুণমান নিয়ে উদ্বেগ সৃষ্টি করেছে।",
      "টুইটারে ইলন মাস্কের সম্পৃক্ততা থেকে শুরু করে পুঁজিবাদ এবং ওপেন সোর্স বিকল্পের মতো বিস্তৃত বিষয়গুলিতে বিস্তৃত কথোপকথনটি ডেটা এবং তথ্যের মধ্যে পার্থক্যের উপর জোর দেয় এবং ব্যবহারকারীদের তাদের ডেটা ব্যবহার সম্পর্কে সচেতন হতে উত্সাহিত করে।",
      "টুইটার এআই গবেষকদের তার সম্পূর্ণ সংরক্ষণাগারে অ্যাক্সেসের অনুমতি দেওয়ার ঘোষণার পরে, পরিষেবা, আইন এবং বর্তমান সামাজিক প্ল্যাটফর্মগুলির বিকল্পগুলির ক্ষেত্রে স্বচ্ছতা বাড়ানোর বিষয়ে আলোচনা উঠে এসেছে।"
    ],
    "points": 329,
    "commentCount": 268,
    "retryCount": 0,
    "time": 1693583480
  },
  {
    "id": 37351667,
    "title": "কে নিয়োগ দিচ্ছে? (সেপ্টেম্বর ২০২৩)",
    "originLink": "https://news.ycombinator.com/item?id=37351667",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37351667",
    "commentBody": "",
    "originSummary": [
      "পোস্টটি সংস্থাগুলির কাছ থেকে চাকরির বিজ্ঞাপন চেয়েছে, যার মধ্যে অবস্থান এবং দূরবর্তী কাজ বা ভিসা স্পনসরশিপের প্রাপ্যতা সম্পর্কে তথ্য রয়েছে।",
      "এটি সংস্থান এবং লিঙ্কগুলিও সরবরাহ করে যা চাকরি প্রার্থীরা আরও তথ্য সন্ধানের জন্য ব্যবহার করতে পারেন।",
      "পাঠকদের চাকরির পোস্টিং সম্পর্কে অভিযোগ করার বিরুদ্ধে সতর্ক করা হয় এবং আরও প্রসঙ্গের জন্য সম্পর্কিত থ্রেডগুলি উল্লেখ করতে পারেন।"
    ],
    "commentSummary": [
      "এই পদে সফটওয়্যার ইঞ্জিনিয়ার, ডেটা সায়েন্টিস্ট এবং টেকনিক্যাল ম্যানেজারের মতো ভূমিকা সহ বিভিন্ন সেক্টরের একাধিক সংস্থায় চাকরির শূন্যপদের একটি বিস্তৃত তালিকা অন্তর্ভুক্ত রয়েছে।",
      "পদগুলিতে এআই, মেশিন লার্নিং, সফ্টওয়্যার ডেভেলপমেন্ট সম্পর্কিত কাজ জড়িত এবং কিছু সংস্থা রিমোট ওয়ার্ক, ভিসা স্পনসরশিপ এবং প্রতিযোগিতামূলক বেতন প্যাকেজ সরবরাহ করছে।",
      "সম্প্রতি তহবিল সংগ্রহকারী স্টার্টআপগুলি সক্রিয়ভাবে ক্লাউড ইঞ্জিনিয়ার এবং গোপনীয়তা-কেন্দ্রিক প্রকৌশলীদের মতো ভূমিকার জন্য নিয়োগ করছে, যা সফ্টওয়্যার প্রকৌশল ক্ষেত্রে বিভিন্ন সুযোগকে নির্দেশ করে।"
    ],
    "points": 306,
    "commentCount": 274,
    "retryCount": 0,
    "time": 1693580425
  },
  {
    "id": 37349633,
    "title": "বিদায় ইসি 2-ক্লাসিক, এটি ফুলে গেছে",
    "originLink": "https://www.allthingsdistributed.com/2023/09/farewell-ec2-classic.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37349633",
    "commentBody": "",
    "originSummary": [
      "15 আগস্ট, 2023 এ, অ্যামাজন ওয়েব সার্ভিসেস (এডাব্লুএস) তাদের ক্লাউড কম্পিউটিং পরিষেবা ইসি 2 এর প্রাথমিক সংস্করণ ইসি 2-ক্লাসিক সম্পূর্ণরূপে বন্ধ করে দিয়েছে, যা প্রায় 17 বছর ধরে চালু ছিল।",
      "ইসি 2-ক্লাসিক সরলভাবে অবকাঠামো পরিচালনা করে, অ্যাপ্লিকেশনগুলি ডিজাইন এবং তৈরি করা সহজ করে তোলে এবং সময়ের সাথে সাথে ইলাস্টিক আইপি, অটো স্কেলিং, লোড ব্যালেন্সিং এবং ভিপিসির মতো নতুন বৈশিষ্ট্যগুলির সাথে বিকশিত হয়, যা পৃথকভাবে পরিচালিত ক্লাউড বিভাগগুলির নকশার দিকে পরিচালিত করে।",
      "ইসি 2-ক্লাসিকের অবসর ক্লাউড কম্পিউটিংয়ের অগ্রগতিতে একটি গুরুত্বপূর্ণ পদক্ষেপ নির্দেশ করে; যাইহোক, এডাব্লুএস গ্রাহক ব্যবহারের জন্য অভিযোজনযোগ্য সিস্টেমগুলি অগ্রসর এবং নির্মাণের জন্য নিবেদিত রয়েছে।"
    ],
    "commentSummary": [
      "নিবন্ধটি অ্যামাজন ওয়েব সার্ভিসেস (এডাব্লুএস) ইসি 2-ক্লাসিকের অবসর এবং ভার্চুয়াল প্রাইভেট ক্লাউডে (ভিপিসি) এর রূপান্তরের উপর দৃষ্টি নিবদ্ধ করে, ব্যবহারকারীরা নতুন প্ল্যাটফর্মের ক্রমবর্ধমান জটিলতা নিয়ে উদ্বেগ প্রকাশ করে।",
      "এডাব্লুএস অপসওয়ার্কস বন্ধ ের পাশাপাশি বাজারের গতিশীলতার উপর এর সম্ভাব্য প্রভাব নিয়ে আলোচনা করা হচ্ছে, যখন ব্যবহারকারীরা গুগলের রাজস্ব-ভিত্তিক ফোকাস এবং অনুসন্ধান ফলাফলের গুণমান হ্রাসের বিষয়ে সমালোচনা প্রকাশ করছেন।",
      "লেখাটি ব্লগিং ইকোসিস্টেমে গুগল রিডারের বন্ধ এবং গুগল + এর প্রতি গুগলের দৃষ্টিভঙ্গি নিয়ে অসন্তুষ্টির পরিণতি তুলে ধরেছে, পুরানো থেকে নতুন ক্লাউড অফারগুলিতে স্থানান্তরিত হওয়ার বিস্তৃত চ্যালেঞ্জগুলি তুলে ধরেছে।"
    ],
    "points": 271,
    "commentCount": 175,
    "retryCount": 0,
    "time": 1693569426
  },
  {
    "id": 37348808,
    "title": "লিডল প্রোডাক্ট রিকল [পিডিএফ]",
    "originLink": "https://www.lidl.co.uk/static/assets/Paw_Patrol_Public_Recall_poster-500790.pdf",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37348808",
    "commentBody": "",
    "originSummary": ["\"\""],
    "commentSummary": [
      "হ্যাকার নিউজ আলোচনার মূল প্রতিপাদ্য হচ্ছে খুচরা পণ্য, বিশেষ করে শিশুদের স্ন্যাক আইটেম এবং পণ্যের আপোসযুক্ত বা মেয়াদোত্তীর্ণ কিউআর কোড, আইটি এবং নিরাপত্তা দলকে ছবিতে নিয়ে আসা।",
      "এটি এমন একটি ঘটনার রূপরেখা দেয় যেখানে সরবরাহকারীর ইউআরএল আপসযুক্ত কারণে পাও পেট্রোল ব্র্যান্ডেড আইটেমগুলির জন্য লিডল জিবি দ্বারা একটি পণ্য প্রত্যাহার শুরু হয়েছিল, যা এই ধরনের রিকল থেকে বর্জ্য এবং একক-ব্যবহারযোগ্য প্লাস্টিকের সমস্যা নিয়ে বিতর্ক ের সূত্রপাত করেছিল।",
      "পোস্টটি শিশুদের কার্টুনে আইন প্রয়োগকারী সংস্থার উপস্থাপনা এবং তাদের নিজ নিজ বিপণন কৌশলের মতো বিষয়গুলির মাধ্যমেও নেভিগেট করে, আলোচনার বৈচিত্র্য প্রদর্শন করে।"
    ],
    "points": 260,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1693562862
  },
  {
    "id": 37355487,
    "title": "অফলাইনে লক্ষ লক্ষ পৃষ্ঠার মাধ্যমে উইকিপিডিয়া অনুসন্ধান-বাই-ভাইব",
    "originLink": "https://www.leebutterman.com/2023/06/01/offline-realtime-embedding-search.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37355487",
    "commentBody": "",
    "originSummary": [
      "পাঠ্যটি উইকিপিডিয়ার জন্য ডিজাইন করা একটি ব্রাউজার-ভিত্তিক অনুসন্ধান ইঞ্জিনের পরিচয় দেয় যা ব্যবহারকারীদের অফলাইনে প্রাসঙ্গিক ফলাফল গুলি খুঁজে পেতে সক্ষম করে, বাক্য ট্রান্সফরমার, পণ্য কোয়ান্টাইজেশন এবং ট্রান্সফরমারগুলির মাধ্যমে অনুসন্ধানের অভিজ্ঞতা বাড়িয়ে তোলে.js।",
      "বহুমুখী অনুসন্ধান বৈশিষ্ট্যযুক্ত, ইঞ্জিন ব্যবহারকারীদের নির্দিষ্ট উপবিভাগগুলির মধ্যে অনুসন্ধান করতে দেয়। এটি একটি কম্প্যাক্ট ডাটাবেস ধারণ করে যা লক্ষ লক্ষ এম্বেডিং সমর্থন করতে সক্ষম, অনুসন্ধান ফলাফলগুলি ক্রমান্বয়ে আপডেট হয়।",
      "উল্লিখিত প্রক্রিয়ার মধ্যে রয়েছে সমস্ত উইকিপিডিয়া এম্বেড করা, এই এম্বেডিংগুলি সংকুচিত করা এবং তারপরে ওএনএনএক্স (ওপেন নিউরাল নেটওয়ার্ক এক্সচেঞ্জ) মডেল এবং দক্ষ ডেটা স্টোরেজের জন্য অ্যারো ফর্ম্যাট ব্যবহার করা।"
    ],
    "commentSummary": [
      "পোস্টটি একটি ওয়েব-ভিত্তিক উইকিপিডিয়া অনুসন্ধান ইঞ্জিন সম্পর্কে যা ফলাফল পেতে বাক্য এম্বেডিং ব্যবহার করে, যদিও ব্যবহারকারীরা ফলাফলের নির্ভুলতা নিয়ে প্রশ্ন তোলে।",
      "উন্নতির জন্য পরামর্শ দেওয়া হচ্ছে যেমন শুধুমাত্র সংজ্ঞায়িত বাক্য ব্যবহার করা এবং আরও ডেটাসেট অন্তর্ভুক্ত করা।",
      "বিকাশকারী এই সমস্যাগুলি সনাক্ত করে, ডাটাবেস বাড়ানোর আগ্রহ দেখায়, কিছু ব্যবহারকারী অনুরূপ এআই অনুসন্ধান পরিষেবাগুলির সাথে অভিজ্ঞতা ভাগ করে নেয় এবং সম্ভাব্য সহযোগিতার পরামর্শ দেয়।"
    ],
    "points": 253,
    "commentCount": 49,
    "retryCount": 0,
    "time": 1693598119
  },
  {
    "id": 37351157,
    "title": "একক জোড়া ইথারনেটে একটি গভীর ডুব",
    "originLink": "https://electricui.com/blog/spe-sensor-node",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37351157",
    "commentBody": "",
    "originSummary": [
      "লেখক উচ্চ ডেটা হার, পাওয়ার ডেলিভারি এবং সরলীকৃত তারের জন্য সিঙ্গেল পেয়ার ইথারনেট (এসপিই) এবং পাওয়ার ওভার ডেটা লাইনস (পিওডিএল) অনুসন্ধান নিয়ে আলোচনা করেছেন।",
      "তরঙ্গ আচরণ পরিমাপের জন্য সেন্সর নোড তৈরি এবং পরীক্ষাও প্রকল্পের একটি হাইলাইট উপাদান।",
      "ওয়াটারপ্রুফ হাউজিং এবং পিসিবি ডিজাইন, বিভিন্ন সেন্সর এবং লাইব্রেরি ব্যবহার করে ফার্মওয়্যার ডেভেলপমেন্ট এবং মুখোমুখি চ্যালেঞ্জগুলি কাটিয়ে ওঠার মতো বেশ কয়েকটি ধাপ প্রক্রিয়াটির অংশ ছিল।"
    ],
    "commentSummary": [
      "নিবন্ধটি বিভিন্ন অ্যাপ্লিকেশনগুলিতে সিঙ্গেল পেয়ার ইথারনেট (এসপিই) এর কার্যকারিতা তুলে ধরেছে, যেমন স্বায়ত্তশাসিত যানবাহন এবং আন্ডারওয়াটার সেন্সর অ্যারেগুলিতে শক্তি এবং ডেটা স্থানান্তর।",
      "1 গিগাবাইট দক্ষতায় পাওয়ার ওভার ডেটা লাইন (পিওডিএল) 100 এমবি এর চেয়ে বেশি বিশিষ্ট, এবং এটি 1 গিগাবাইট প্রোটোকলের ফরোয়ার্ড ত্রুটি সংশোধন (এফইসি) অন্তর্ভুক্ত করে।",
      "এসপিই কেবল বাড়ির ব্যবহারকারীদের এবং আইওটি অ্যাপ্লিকেশনগুলির জন্য সুবিধা উপস্থাপন করে না তবে গিগাবিট ইথারনেট দূরত্বের সীমাবদ্ধতা কাটিয়ে ওঠার ক্ষমতার কারণে ভোক্তা ডিভাইসেও গ্রহণ করা যেতে পারে।"
    ],
    "points": 214,
    "commentCount": 66,
    "retryCount": 0,
    "time": 1693577879
  },
  {
    "id": 37352486,
    "title": "পুলিশ নিরপরাধ মানুষের সম্পত্তি বাজেয়াপ্ত করেছে, বছরের পর বছর ধরে রেখেছে। স্কটস কী করবে?",
    "originLink": "https://reason.com/2023/07/11/police-seized-innocent-peoples-property-and-kept-it-for-years-what-will-the-supreme-court-do/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37352486",
    "commentBody": "",
    "originSummary": [
      "সুপ্রিম কোর্ট নাগরিক সম্পদ বাজেয়াপ্তকরণ সম্পর্কিত একটি মামলা পুনর্বিবেচনার প্রস্তুতি নিচ্ছে, এমন একটি পদ্ধতি যা আইন প্রয়োগকারী সংস্থাকে তাদের অপরাধ প্রমাণ না করেই জনগণের সম্পদ বাজেয়াপ্ত করতে সক্ষম করে।",
      "এই অনুশীলনটি যথাযথ প্রক্রিয়ার প্রতি অবহেলা এবং নিরীহ সম্পত্তির মালিকদের উপর এটি আরোপিত আর্থিক চাপের জন্য সমালোচনার মুখে রয়েছে, যারা তাদের সম্পদ পুনরুদ্ধারের জন্য লড়াই করতে পারে।",
      "এটি আরও যুক্তি যুক্ত করা হয় যে আইন প্রয়োগকারী সংস্থাগুলি প্রায়শই আর্থিক লাভের জন্য এই অনুশীলনটি ব্যবহার করে, সরকার জবাবদিহিতা অস্বীকার করে এবং যথাযথ প্রক্রিয়াউপেক্ষা করে, প্রায়শই ব্যক্তিদের অসামঞ্জস্যপূর্ণভাবে প্রভাবিত করে।"
    ],
    "commentSummary": [
      "আলোচনায় আলোচিত বিষয়টি হ'ল মার্কিন যুক্তরাষ্ট্রে নাগরিক সম্পদ বাজেয়াপ্ত করা, উল্লেখযোগ্য ডেটা ঘাটতি এবং সংস্কারের দাবিকে তুলে ধরা।",
      "অংশগ্রহণকারীরা পুলিশের দুর্নীতি এবং অভ্যন্তরীণ ক্ষমতার গতিশীলতা থেকে শুরু করে সম্ভাব্য সমাধান পর্যন্ত বিস্তৃত বিতর্কগুলি অন্বেষণ করে, নাগরিক বাজেয়াপ্তকরণ এবং ভোটের সীমাবদ্ধতার প্রয়োজনীয়তা সম্পর্কে ভিন্ন দৃষ্টিভঙ্গি সহ।",
      "কথোপকথনটি আইনী, অর্থনৈতিক এবং সামাজিক থিমগুলিতেও ঘুরে বেড়ায়; তদুপরি, তারা নিবন্ধে উপস্থাপিত বিবরণ এবং নাগরিক সম্পদ বাজেয়াপ্তির নেতিবাচক উপলব্ধির সম্ভাব্য সমাধান সম্পর্কে সন্দেহ প্রকাশ করে।"
    ],
    "points": 203,
    "commentCount": 156,
    "retryCount": 0,
    "time": 1693583981
  },
  {
    "id": 37351628,
    "title": "ট্রেডমার্ক ইস্যুর কথা উল্লেখ করে অ্যাসেম্বলি ভাষা গুরুর ডোমেইন কেড়ে নিল এআরএম",
    "originLink": "https://www.theregister.com/2023/08/31/a_star_star_domains/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37351628",
    "commentBody": "",
    "originSummary": [
      "অ্যাসেম্বলি ল্যাঙ্গুয়েজ এবং নিরাপত্তা গবেষকের স্বীকৃত বিশেষজ্ঞ মারিয়া মার্কস্টেডারকে তার ডোমেইন নাম, arm-assembly.com তাদের ট্রেডমার্ক ব্যবহার করার জন্য আর্মের আইনজীবীদের কাছ থেকে বিরত থাকার আদেশ দেওয়া হয়েছে।",
      "আর্ম'স ইনস্ট্রাকশন সেট আর্কিটেকচার (আইএসএ) সম্পর্কিত একটি বই সহ তার বিস্তৃত লেখার মাধ্যমে আর্মে তার অবদান সত্ত্বেও, তার হোস্টিং সরবরাহকারী অনুরূপ বিরতি এবং বিরত থাকার চিঠি পাওয়ার পরে তার ওয়েবসাইটগুলি সরিয়ে নেওয়া হয়েছিল।",
      "আর্মের কর্মকাণ্ডের জন্য সমালোচনার মধ্যে, মার্কস্টেডার প্রস্তাব করেছেন যে আর্ম তার বইটি বিশ্ববিদ্যালয় এবং এমন ব্যক্তিদের দান করুন যারা এটি বহন করতে পারে না, যদিও এখনও পর্যন্ত এই পরামর্শের কোনও প্রতিক্রিয়া পাওয়া যায়নি।"
    ],
    "commentSummary": [
      "সেমিকন্ডাক্টর প্রযুক্তির শীর্ষস্থানীয় সরবরাহকারী এআরএম ডোমেইন নামের সাথে যুক্ত ট্রেডমার্ক লঙ্ঘনের জন্য একটি স্বনামধন্য বিকাশকারীর বিরুদ্ধে আইনি ব্যবস্থা নিচ্ছে।",
      "এআরএম-এর এই পদক্ষেপ প্রযুক্তি সম্প্রদায়ের মধ্যে বিতর্কের জন্ম দিয়েছে, কেউ কেউ তাদের পদ্ধতির সমালোচনা করেছে, অন্যরা বলছে যে তারা তাদের মেধা সম্পত্তি রক্ষা করছে।",
      "ট্রেডমার্ক প্রয়োগের জন্য স্বয়ংক্রিয় সিস্টেমের ব্যবহার সম্পর্কে একটি বিস্তৃত আলোচনা রয়েছে, সম্ভাব্য বিরূপ প্রভাব সম্পর্কে প্রশ্ন গুলি আরও বিতর্ক সৃষ্টি করে।"
    ],
    "points": 196,
    "commentCount": 88,
    "retryCount": 0,
    "time": 1693580252
  }
]
