[
  {
    "id": 39640992,
    "title": "Turvallisen kotilaboratorion rakentaminen: Essential Guide: Essential Guide: Essential Guide",
    "originLink": "https://linuxblog.io/home-lab-beginners-guide-hardware/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39640992",
    "commentBody": "",
    "originSummary": [
      "Blogikirjoituksessa korostetaan kotilaboratorion perustamisen merkitystä turvallista teknologiakokeilua varten.",
      "Siinä käsitellään laitteiston valintaa, paikan perustamista, verkkolaitteiden ja palvelimien valintaa laboratoriota varten.",
      "Suosituksia annetaan esimerkiksi modeemeille, UPS-järjestelmille, jäähdytyspuhaltimille, reitittimille, kytkimille ja palvelinmerkeille."
    ],
    "commentSummary": [
      "Artikkelissa tarkastellaan kotilaboratorion luomista pienikokoisilla tietokoneilla, kuten NUC- tai Dell SFF -tietokoneilla, jotka ovat tilatehokkaita ja hiljaisia.",
      "Käyttäjät suosittelevat OptiPlex-tietokoneita ja Odroid SBC:tä kotilaboratorioihin ja keskustelevat verkottumisesta, tallennuksesta, konttien orkestroinnista, käyttöjärjestelmävaihtoehdoista ja katastrofista toipumisesta.",
      "Siinä tarkastellaan kokemuksia laitteistoista, ohjelmistotyökaluista ja yhteisön avusta VM:ien ja konttien hallinnassa kotona."
    ],
    "points": 546,
    "commentCount": 343,
    "retryCount": 0,
    "time": 1709905633
  },
  {
    "id": 39643136,
    "title": "Esittelyssä Hatchet: Uusi avoimen lähdekoodin tehtäväjono",
    "originLink": "https://github.com/hatchet-dev/hatchet",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39643136",
    "commentBody": "",
    "originSummary": [
      "Gabe ja Alexander luovat Hatchetia, avoimen lähdekoodin hajautettua tehtäväjonoa, joka kilpailee Celeryn ja BullMQ:n kanssa ja korostaa luotettavuutta ja havainnoitavuutta, ja jonon perustana on Postgres.",
      "Hatchet pyrkii täydelliseen transaktioiden jonottamiseen ja yksinkertaistettuun tehtävien tarkkailtavuuteen kehittäjille, jotka käyttävät työntekijöitä eri VM:issä, klustereissa ja alueilla.",
      "Projekti sisältää optimointeja latenssin suhteen sekä parannuksia, kuten uusintayrityksiä, aikakatkaisuja ja cron-aikatauluja, ja palautetta alustasta toivotaan."
    ],
    "commentSummary": [
      "Keskustelussa keskitytään Hatchetiin, avoimen lähdekoodin hajautettuun tehtäväjonoon, joka käyttää Postgres-tietokantaa, joka tunnetaan luotettavuudestaan ja tarkkailtavuudestaan.",
      "Käyttäjät arvostavat Hatchetia sen ainutlaatuisten ominaisuuksien ja yksinkertaisen infrastruktuurin vuoksi verrattuna työkaluihin kuten RabbitMQ, Oban ja Graphile Worker.",
      "Keskusteluissa käsitellään Graphile Workerin hallintakäyttöliittymän parantamista, tekoälyä kehittävien startup-yritysten väitteiden tutkimista, vaihtoehtoisia taustajärjestelmän asetuksia Celerylle sekä työn aikataulutukseen ja hajautettuihin työnkulkuihin liittyviä haasteita."
    ],
    "points": 458,
    "commentCount": 137,
    "retryCount": 0,
    "time": 1709917655
  },
  {
    "id": 39643833,
    "title": "Teinin avoimet lähdekoodit Wallstreetlocalille avoimia SEC-ilmoituksia varten",
    "originLink": "https://github.com/bruhbruhroblox/wallstreetlocal",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39643833",
    "commentBody": "",
    "originSummary": [
      "Seitsemäntoista-vuotias Anonyo Kaakkois-Michiganista on avannut Wallstreetlocal-hankkeensa, joka keskittyy tekemään SEC:n ilmoituksista, erityisesti 13F-lomakkeesta, avoimempia ja helpommin saatavilla olevia.",
      "Hankkeen tavoitteena on demokratisoida SEC-asiakirjojen saatavuutta ja lisätä avoimuutta, mikä osoittaa Anonyon intohimoa tietokoneohjelmointiin ja kunnianhimoa olla tulevaisuudessa osa startup-yrityksiä.",
      "Anonyo rohkaisee antamaan palautetta ja ehdotuksia sivuston parantamiseksi ja korostaa avoimuuttaan rakentavalle panokselle."
    ],
    "commentSummary": [
      "Seitsemäntoista-vuotias Anonyo Kaakkois-Michiganista kehitti wallstreetlocal-verkkosivuston tarjotakseen ilmaisen pääsyn SEC:n 13F-asiakirjoihin yrityksille, joiden omistusosuus on yli 100 miljoonaa dollaria.",
      "Hankkeen tavoitteena on demokratisoida SEC-tiedonantoja, ja se on saanut myönteistä palautetta ja parannusehdotuksia, kuten GIS-kartoitusohjelmisto kiinteistöjen omistusta varten ja yritysten ja omaisuudenhoitajien välisten erojen poistaminen SEC-tiedonannoissa.",
      "Hankkeen laajentaminen uusilla ominaisuuksilla on käynnissä, ja se rohkaisee käyttäjiä osallistumaan SEC:n asiakirjojen saatavuuden ja hyödyllisyyden parantamiseen, mikä edellyttää palautetta lisätiedoista, ominaisuuksista, isännöintihaasteista ja sijoitusstrategioista."
    ],
    "points": 243,
    "commentCount": 46,
    "retryCount": 0,
    "time": 1709920946
  },
  {
    "id": 39640647,
    "title": "Itsehillintä avain koettuun valtaan ja menestykseen",
    "originLink": "https://today.ucsd.edu/story/having-self-control-leads-to-power",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39640647",
    "commentBody": "",
    "originSummary": [
      "UC San Diegon Rady School of Managementin tutkimuksen mukaan henkilöitä, joilla on korkea itsehillintä, pidetään vaikutusvaltaisina ja he saavat todennäköisemmin valtaa vertaisiltaan.",
      "Journal of Personality and Social Psychology -lehdessä julkaistussa tutkimuksessa, johon sisältyi seitsemän koetta, joihin osallistui 3 500 ihmistä, osoitetaan, että korkean itsekontrollin omaavia pidetään sopivampina valta-asemiin.",
      "Kunnianhimoisten tavoitteiden saavuttamatta jättäminen voi johtaa käsitykseen alhaisemmasta vallasta, vaikka suoritus vastaisi vertaisryhmää, mikä korostaa itsehillinnän merkitystä menestyksen ja vallan saavuttamisessa eri tavoitteissa."
    ],
    "commentSummary": [
      "Keskustelussa syvennytään itsehillinnän ja vallan väliseen yhteyteen, arvioidaan uudelleen kiusausten vastustamista koskevaa perinteistä viisautta ja otetaan huomioon esimerkiksi sosioekonominen asema.",
      "Henkilökohtaiset tarinat painonpudotuksesta ja lääkityksestä korostavat tapakäyttäytymisen merkitystä itsehillinnässä ja korostavat sen merkitystä menestyksen saavuttamisessa ja henkilökohtaisessa kehityksessä.",
      "Keskustelua laajennetaan yhteiskunnallisiin vaikutuksiin, syrjintään ja yritysten tavoitteiden asettamiseen, jotka vaikuttavat itsehillintään, ja tarkastellaan itsehillinnän, vallan ja toimeenpanevien käyttäytymismuotojen, kuten alkoholinkäytön, välistä monimutkaista suhdetta Elon Muskin kaltaisia henkilöitä lainaten."
    ],
    "points": 192,
    "commentCount": 121,
    "retryCount": 0,
    "time": 1709902716
  },
  {
    "id": 39647331,
    "title": "Läpimurto: Korkean lämpötilan suprajohtavat magneetit muuttavat fuusiota",
    "originLink": "https://news.mit.edu/2024/tests-show-high-temperature-superconducting-magnets-fusion-ready-0304",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39647331",
    "commentBody": "",
    "originSummary": [
      "MIT ja Commonwealth Fusion Systems ovat testanneet korkean lämpötilan suprajohtavia magneetteja kompaktia fuusiovoimalaitosta varten ja tehneet maailmanennätyksen 20 teslan magneettikentän voimakkuudella.",
      "Uuden suprajohtavan REBCO-materiaalin käyttö mahdollisti innovatiiviset suunnitteluelementit, kuten sen, että suprajohtavan nauhan ympärillä ei ollut eristystä, mikä tehosti fuusioenergian tuotantoa.",
      "Onnistunut testaus osoittaa, että on mahdollista rakentaa fuusiovoimala, joka tuottaa enemmän energiaa kuin se kuluttaa, ja korostaa MIT:n plasmatutkimus- ja fuusiokeskuksen yhteistyön ja asiantuntemuksen ratkaisevaa merkitystä."
    ],
    "commentSummary": [
      "Korkean lämpötilan suprajohtavat magneetit soveltuvat fuusiokäyttöön, mutta magneettikuvauslaitteissa niihin liittyy ongelmia heliumjäähdytyksen ja haurastumisen vuoksi.",
      "Haasteet, kuten taloudellinen toteutettavuus, toimitusrajoitukset ja gradienttikäämien aiheuttama melu, rajoittavat niiden laajempaa käyttöä.",
      "Keskustelussa käsitellään MIT:n Sparc/Arc-reaktorin suunnittelua ja ITERin jälkiasennushaasteita sekä sääntelyyn liittyviä huolenaiheita, jätehuoltoa, turvallisuutta ja mahdollista ylimääräistä tritiumin tuotantoa fuusioenergiakeskustelussa."
    ],
    "points": 185,
    "commentCount": 69,
    "retryCount": 0,
    "time": 1709937301
  },
  {
    "id": 39645991,
    "title": "New York Times puolustaa Wordle Clone Takedownsia",
    "originLink": "https://www.theverge.com/2024/3/8/24094234/ny-times-wordle-clones-files-dmca-copyright-takedowns-knockoffs",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39645991",
    "commentBody": "",
    "originSummary": [
      "New York Times lähettää GitHubissa toimiville kehittäjille laillisia poistopyyntöjä Wordle-klooneista vedoten nimen ja pelattavuuden omistajuuteen.",
      "Jotkut kehittäjät poistavat kloonejaan välttääkseen oikeusriitoja Timesin kanssa, vaikka ne olisi luotu ennen kuin Times osti Wordlen.",
      "Tämä tilanne korostaa pelialalla esiintyviä tekijänoikeusrikkomuksiin liittyviä haasteita ja teollis- ja tekijänoikeuksien suojelun tärkeyttä."
    ],
    "commentSummary": [
      "New York Times lähettää DMCA-takedowneja Wordle-klooneille vedoten tavaramerkki- ja tekijänoikeusloukkauksiin.",
      "Keskustelua käydään siitä, onko pelattavuus tekijänoikeudellisesti suojattua, ja NYT syyttää sitä kiusaamisesta.",
      "Wordlen menestyksestä, vertailuista muihin sanapeleihin ja mahdollisista pelimekaniikkaan ja sanaluetteloihin liittyvistä oikeudellisista huolenaiheista keskustellaan, ja NYT:tä kritisoidaan sen oikeudellisista toimista ja sisältöpäätöksistä."
    ],
    "points": 153,
    "commentCount": 95,
    "retryCount": 0,
    "time": 1709929731
  },
  {
    "id": 39643685,
    "title": "Apple palauttaa Epicin tilin EU:ssa",
    "originLink": "https://twitter.com/TimSweeneyEpic/status/1766158416093798866",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39643685",
    "commentBody": "",
    "originSummary": [
      "Digitaalisia markkinoita koskeva laki (Digital Markets Act, DMA) kohtasi merkittävän esteen, kun Apple poisti Epic Gamesin App Storesta.",
      "Myöhemmin DMA saavutti merkittävän voiton, kun Euroopan komission tutkimus sai Applen perumaan toimensa.",
      "Tilaisuudessa korostetaan DMA:n roolia digitaalisten markkinoiden ja teknologiajättien käyttäytymisen sääntelyssä."
    ],
    "commentSummary": [
      "Apple on palauttanut Epicin tilin EU:ssa, mikä on merkki mahdollisesta ratkaisusta aiempiin konflikteihin.",
      "Tätä kehitystä koskevia yksityiskohtaisempia tietoja ja keskusteluja on saatavana erillisellä sivulla, joka tarjoaa lisää taustatietoa."
    ],
    "points": 153,
    "commentCount": 1,
    "retryCount": 0,
    "time": 1709920391
  },
  {
    "id": 39643958,
    "title": "Piano paperilla: Pelaa webkameralla ja paperinäppäimillä",
    "originLink": "https://github.com/Mayuresh1611/Paper-Piano",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39643958",
    "commentBody": "",
    "originSummary": [
      "Paper Piano -projektin avulla käyttäjät voivat soittaa pianoa paperilla web-kameran ja kahden A4-kokoisen valkoisen paperin avulla, ja se tukee tällä hetkellä kahta sormea.",
      "Projektin perustaminen edellyttää Python 3.11:n käyttöönottoa, arkiston kloonausta ja vaatimusten asentamista, ja sen käyttäminen edellyttää webkameran oikeaa sijoittelua ja valaistusta.",
      "Mallin harjoitteluun kuuluu kameran säätäminen, sormien tarkoituksellinen liikuttaminen ja kosketettujen ja koskemattomien sormien erottaminen, ja siihen kannustetaan osallistumaan soittimien saavutettavuuden parantamiseen."
    ],
    "commentSummary": [
      "GitHub-käyttäjät tutkivat selainpohjaista virtuaalipianosimulaatiota, jossa seurataan sormien asentoja mediapipe-ohjelmalla, keskustelevat digitaalisen pianon huippuluokan toiminnoista, yhtäläisyyksistä akustisen pianon toimintoihin, pianon toimintojen pienentämisestä ja VR-teknologian integroinnista.",
      "Keskustelussa tuodaan esiin painon ja haptisen palautteen merkitys pianon näppäimissä, oppimismenetelmät (paperilla vs. oikea näppäimistö) ja aivo-tietokone -rajapintojen mahdollisuudet VR-ympäristöissä.",
      "Käyttäjät arvioivat virtuaalisten laserinäppäimistöjen tehokkuutta ja kustannuksia ja ehdottavat parannuksia 3D-tulostustekniikan avulla."
    ],
    "points": 140,
    "commentCount": 40,
    "retryCount": 0,
    "time": 1709921435
  },
  {
    "id": 39642135,
    "title": "Petos paljastuu: Suprajohtavuus skandaali rokkaa fysiikan laboratorio",
    "originLink": "https://www.nature.com/articles/d41586-024-00716-2",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39642135",
    "commentBody": "",
    "originSummary": [
      "Fyysikko Ranga Diasin väite huoneenlämpöisten suprajohteiden löytämisestä peruttiin tietojen manipuloinnin ja väärinkäytösväitteiden vuoksi, mikä vaikutti nuorten tutkijoiden uraan ja herätti kysymyksiä institutionaalisesta valvonnasta.",
      "Diasin suprajohtavuutta koskevia tutkimusasiakirjoja on tutkittu avoimuuden puutteen ja tietojen manipuloinnin vuoksi, mikä on johtanut useiden lehtien tutkimuksiin ja jatkuviin epäilyihin tutkimuksen pätevyydestä.",
      "Seurauksiin kuuluu henkilöstöön kohdistuvia toimia, laboratorioon pääsyn menettäminen ja Diasin mahdollinen vaikutus NSF-apurahoihin, ja siihen liittyviä tutkimuksia on vedettävä takaisin tai korjattava, mikä aiheuttaa huolta tiedeyhteisössä."
    ],
    "commentSummary": [
      "Artikkelissa käsitellään petosta ja valtadynamiikkaa akateemisessa maailmassa, ja siinä keskitytään fysiikan laboratorion skandaaliin ja tohtoriopiskelijoiden ohjaajien vastuun puutteeseen.",
      "Siinä tuodaan esiin haasteita, kuten huonojen neuvonantajien, työturvallisuuden ja maahanmuuttolakien kohtaaminen, ja korostetaan tieteellisen tutkimuksen avoimuutta sekä toistettavuuden ja tietojen saatavuuden merkitystä.",
      "Erityistapauksia, kuten kylmää fuusiota ja huoneenlämpötilan suprajohteita, käsitellään ja korostetaan tutkimustulosten toistamisen ja validoinnin merkitystä tieteellisen tutkimuksen luotettavuuden ja uskottavuuden säilyttämiseksi."
    ],
    "points": 137,
    "commentCount": 87,
    "retryCount": 0,
    "time": 1709912794
  }
]
