[
  {
    "id": 39640992,
    "title": "Construir un laboratorio casero seguro: Guía esencial",
    "originLink": "https://linuxblog.io/home-lab-beginners-guide-hardware/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39640992",
    "commentBody": "",
    "originSummary": [
      "La entrada del blog destaca la importancia de crear un laboratorio doméstico para experimentar con la tecnología de forma segura.",
      "Abarca la selección de hardware, el establecimiento de una ubicación, la elección de equipos de red y servidores para el laboratorio.",
      "Se dan recomendaciones para equipos como módems, sistemas SAI, ventiladores de refrigeración, routers, conmutadores y marcas de servidores."
    ],
    "commentSummary": [
      "El artículo explora la creación de un laboratorio doméstico con ordenadores compactos como los NUC o los SFF de Dell para ahorrar espacio y funcionar de forma silenciosa.",
      "Los usuarios sugieren PC OptiPlex y SBC Odroid para laboratorios domésticos, y hablan de redes, almacenamiento, orquestación de contenedores, opciones de SO y recuperación ante desastres.",
      "Profundiza en las experiencias con el hardware, las herramientas de software y la ayuda de la comunidad para gestionar máquinas virtuales y contenedores en casa."
    ],
    "points": 546,
    "commentCount": 343,
    "retryCount": 0,
    "time": 1709905633
  },
  {
    "id": 39643136,
    "title": "Presentación de Hatchet: La nueva cola de tareas de código abierto",
    "originLink": "https://github.com/hatchet-dev/hatchet",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39643136",
    "commentBody": "",
    "originSummary": [
      "Gabe y Alexander están creando Hatchet, una cola de tareas distribuidas de código abierto, como competidora de Celery y BullMQ, haciendo hincapié en la fiabilidad y la observabilidad, con Postgres como base de la cola.",
      "El objetivo de Hatchet es ofrecer a los desarrolladores una puesta en cola transaccional completa y una capacidad de observación de tareas simplificada, ejecutando trabajadores en varias máquinas virtuales, clústeres y regiones.",
      "El proyecto incluye optimizaciones para la latencia, junto con mejoras como reintentos, tiempos de espera y cronogramas."
    ],
    "commentSummary": [
      "El debate se centra en Hatchet, una cola de tareas distribuida de código abierto que utiliza Postgres, conocido por su fiabilidad y observabilidad.",
      "Los usuarios aprecian Hatchet por sus características únicas y su infraestructura sencilla en comparación con herramientas como RabbitMQ, Oban y Graphile Worker.",
      "Las charlas tratan sobre la mejora de la interfaz de gestión de Graphile Worker, la exploración de las reivindicaciones de las startups de IA, las configuraciones backend alternativas para Celery y los retos en la programación de trabajos y los flujos de trabajo distribuidos."
    ],
    "points": 458,
    "commentCount": 137,
    "retryCount": 0,
    "time": 1709917655
  },
  {
    "id": 39643833,
    "title": "Adolescentes abren Wallstreetlocal para presentar documentos transparentes ante la SEC",
    "originLink": "https://github.com/bruhbruhroblox/wallstreetlocal",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39643833",
    "commentBody": "",
    "originSummary": [
      "Anonyo, un joven de diecisiete años del sureste de Michigan, ha puesto en marcha su proyecto wallstreetlocal, centrado en hacer más transparentes y accesibles de forma gratuita los archivos de la SEC, en particular el formulario 13F.",
      "El objetivo del proyecto es democratizar el acceso a los archivos de la SEC y aumentar la transparencia, mostrando la pasión de Anonyo por la programación informática y su ambición de formar parte de las startups en el futuro.",
      "Anonyo anima a hacer comentarios y sugerencias para mejorar el sitio, destacando su apertura a las aportaciones constructivas."
    ],
    "commentSummary": [
      "Anonyo, un joven de diecisiete años del sudeste de Michigan, creó wallstreetlocal para ofrecer acceso gratuito a los archivos SEC 13F de empresas con participaciones superiores a 100 millones de dólares.",
      "El proyecto pretende democratizar los archivos de la SEC, recibiendo comentarios positivos y sugerencias de mejora, como un software SIG/mapeo de la propiedad y abordar las diferencias entre empresas y gestores de activos en los archivos de la SEC.",
      "La ampliación del proyecto con nuevas funciones está en curso, fomentando las contribuciones de los usuarios para mejorar la accesibilidad y utilidad de los archivos de la SEC, lo que implica comentarios sobre datos adicionales, funciones, retos de alojamiento y estrategias de inversión."
    ],
    "points": 243,
    "commentCount": 46,
    "retryCount": 0,
    "time": 1709920946
  },
  {
    "id": 39640647,
    "title": "El autocontrol, clave del poder y el éxito percibidos",
    "originLink": "https://today.ucsd.edu/story/having-self-control-leads-to-power",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39640647",
    "commentBody": "",
    "originSummary": [
      "Los individuos con un alto autocontrol son vistos como poderosos y tienen más probabilidades de recibir poder de sus compañeros, según una investigación de la Rady School of Management de la Universidad de California en San Diego.",
      "El estudio, que incluye siete experimentos con 3.500 participantes y se publica en la revista Journal of Personality and Social Psychology, demuestra que las personas con un elevado autocontrol se consideran más aptas para ocupar puestos de poder.",
      "No alcanzar objetivos ambiciosos puede llevar a una percepción de menor poder, incluso si el rendimiento se iguala al de los compañeros, lo que subraya la importancia del autocontrol para alcanzar el éxito y el poder en diferentes objetivos."
    ],
    "commentSummary": [
      "El debate profundiza en el vínculo entre autocontrol y poder, reevaluando la sabiduría convencional sobre la resistencia a las tentaciones y teniendo en cuenta factores como el estatus socioeconómico.",
      "Las historias personales sobre pérdida de peso y medicación subrayan la importancia de los comportamientos habituales en el autocontrol, destacando su papel en la consecución del éxito y el desarrollo personal.",
      "La conversación se amplía a las influencias sociales, la discriminación y la fijación de objetivos corporativos que afectan al autocontrol, y se examina la intrincada relación entre autocontrol, poder y comportamientos ejecutivos como el consumo de alcohol, citando a figuras como Elon Musk."
    ],
    "points": 192,
    "commentCount": 121,
    "retryCount": 0,
    "time": 1709902716
  },
  {
    "id": 39647331,
    "title": "Gran avance: los imanes superconductores de alta temperatura transforman la fusión",
    "originLink": "https://news.mit.edu/2024/tests-show-high-temperature-superconducting-magnets-fusion-ready-0304",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39647331",
    "commentBody": "",
    "originSummary": [
      "El MIT y Commonwealth Fusion Systems han probado imanes superconductores de alta temperatura para una central de fusión compacta, estableciendo un récord mundial con una intensidad de campo magnético de 20 tesla.",
      "El uso del nuevo material superconductor REBCO permitió elementos de diseño innovadores, como la ausencia de aislamiento alrededor de la cinta superconductora, lo que hizo más eficiente la producción de energía de fusión.",
      "El éxito de las pruebas demuestra el potencial de construcción de una central de fusión que genere más energía de la que consume, lo que pone de relieve el papel fundamental de la colaboración y la experiencia del Centro de Ciencia del Plasma y Fusión del MIT."
    ],
    "commentSummary": [
      "Los imanes superconductores de alta temperatura son adecuados para la fusión, pero en las máquinas de resonancia magnética plantean problemas debido al enfriamiento con helio y a su fragilidad.",
      "Problemas como la viabilidad económica, las limitaciones de suministro y el ruido de las bobinas de gradiente limitan su uso generalizado.",
      "Se analizan el diseño del reactor Sparc/Arc del MIT y los retos de la adaptación en el ITER, junto con las preocupaciones normativas, la gestión de residuos, la seguridad y la posible producción excesiva de tritio en el debate sobre la energía de fusión."
    ],
    "points": 185,
    "commentCount": 69,
    "retryCount": 0,
    "time": 1709937301
  },
  {
    "id": 39645991,
    "title": "El New York Times defiende la retirada de clones de Wordle",
    "originLink": "https://www.theverge.com/2024/3/8/24094234/ny-times-wordle-clones-files-dmca-copyright-takedowns-knockoffs",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39645991",
    "commentBody": "",
    "originSummary": [
      "El New York Times está enviando solicitudes legales de retirada a los desarrolladores en GitHub para los clones de Wordle, citando la propiedad del nombre y el juego.",
      "Algunos desarrolladores están retirando sus clones para evitar disputas legales con el Times, incluso si fueron creados antes de que el Times adquiriera Wordle.",
      "Esta situación pone de relieve los problemas de infracción de los derechos de autor presentes en el sector del juego y la importancia de proteger los derechos de propiedad intelectual."
    ],
    "commentSummary": [
      "El New York Times está enviando DMCA takedowns a los clones de Wordle, citando infracción de marcas y derechos de autor.",
      "Sigue el debate sobre si la jugabilidad es susceptible de derechos de autor, con acusaciones de acoso por parte del NYT.",
      "El éxito de Wordle, las comparaciones con otros juegos de palabras y los posibles problemas legales sobre la mecánica de juego y las listas de palabras son objeto de debate, con críticas dirigidas al NYT por sus acciones legales y sus decisiones sobre contenidos."
    ],
    "points": 153,
    "commentCount": 95,
    "retryCount": 0,
    "time": 1709929731
  },
  {
    "id": 39643685,
    "title": "Apple restablece la cuenta de Epic en la UE",
    "originLink": "https://twitter.com/TimSweeneyEpic/status/1766158416093798866",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39643685",
    "commentBody": "",
    "originSummary": [
      "La Ley de Mercados Digitales (DMA) se enfrentó a un importante obstáculo cuando Apple retiró Epic Games de la App Store.",
      "Posteriormente, la DMA logró una victoria histórica cuando la investigación de la Comisión Europea hizo que Apple se retractara de sus acciones.",
      "Este acto pone de relieve el papel de la DMA en la regulación de los mercados digitales y el comportamiento de los gigantes tecnológicos."
    ],
    "commentSummary": [
      "Apple ha restablecido la cuenta de Epic en la UE, lo que indica una posible resolución de sus conflictos anteriores.",
      "Para más información, consulte la página dedicada a este tema."
    ],
    "points": 153,
    "commentCount": 1,
    "retryCount": 0,
    "time": 1709920391
  },
  {
    "id": 39643958,
    "title": "Piano en papel: Tocar con webcam y teclas de papel",
    "originLink": "https://github.com/Mayuresh1611/Paper-Piano",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39643958",
    "commentBody": "",
    "originSummary": [
      "El proyecto Paper Piano permite a los usuarios tocar el piano en papel a través de una webcam y dos papeles blancos de tamaño A4, que actualmente admiten dos dedos.",
      "La configuración del proyecto requiere Python 3.11, la clonación del repositorio y la instalación de los requisitos, mientras que su uso requiere la colocación y la iluminación adecuadas de la cámara web.",
      "El entrenamiento del modelo incluye ajustar la cámara, mover los dedos deliberadamente y distinguir entre dedos tocados y no tocados, y se anima a hacer aportaciones para mejorar la accesibilidad de los instrumentos musicales."
    ],
    "commentSummary": [
      "Los usuarios de GitHub están explorando una simulación de piano virtual basada en navegador que rastrea las posiciones de los dedos con mediapipe, debatiendo sobre los mecanismos de los pianos digitales de gama alta, las similitudes con los mecanismos de los pianos acústicos, la miniaturización de los mecanismos de los pianos de cola y la integración de la tecnología de RV.",
      "La conversación destaca la importancia del peso y la respuesta háptica en las teclas del piano, los métodos de aprendizaje (en papel frente al teclado real) y el potencial de las interfaces cerebro-ordenador en entornos de realidad virtual.",
      "Los usuarios evalúan la eficacia y el coste de los teclados láser virtuales y proponen mejoras mediante la tecnología de impresión 3D."
    ],
    "points": 140,
    "commentCount": 40,
    "retryCount": 0,
    "time": 1709921435
  },
  {
    "id": 39642135,
    "title": "Engaño al descubierto: El escándalo de la superconductividad sacude el laboratorio de física",
    "originLink": "https://www.nature.com/articles/d41586-024-00716-2",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39642135",
    "commentBody": "",
    "originSummary": [
      "La afirmación del físico Ranga Dias de haber descubierto superconductores a temperatura ambiente fue retractada debido a la manipulación de datos y a acusaciones de mala conducta, lo que afectó a las carreras de jóvenes científicos y suscitó dudas sobre la supervisión institucional.",
      "Los trabajos de investigación de Dias sobre superconductividad fueron objeto de escrutinio por falta de transparencia y manipulación de datos, lo que dio lugar a investigaciones por parte de múltiples revistas y a dudas persistentes sobre la validez de la investigación.",
      "Las consecuencias incluyen acciones contra el personal, la pérdida de acceso al laboratorio y el posible impacto de la subvención de la NSF para Dias, con investigaciones relacionadas que se enfrentan a retractaciones o correcciones, causando preocupación en la comunidad científica."
    ],
    "commentSummary": [
      "El artículo aborda el engaño y la dinámica de poder en el mundo académico, centrándose en el escándalo de un laboratorio de física y la falta de responsabilidad de los asesores de los estudiantes de doctorado.",
      "Destaca retos como lidiar con malos consejeros, la seguridad laboral y las leyes de inmigración, e insiste en la transparencia de la investigación científica y en la importancia de la reproducibilidad y la disponibilidad de datos.",
      "Se analizan casos concretos, como la fusión fría y los superconductores a temperatura ambiente, y se subraya la importancia de replicar y validar los resultados de la investigación para mantener la integridad y la credibilidad de la investigación científica."
    ],
    "points": 137,
    "commentCount": 87,
    "retryCount": 0,
    "time": 1709912794
  }
]
