[
  {
    "id": 37052586,
    "title": "Angriffe des Untergangs",
    "originLink": "https://downfall.page/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37052586",
    "commentBody": "",
    "originSummary": [
      "Bei Downfall Attacks handelt es sich um eine Sicherheitslücke in Intel Core Prozessoren der 6. bis 11. Generation, die es unbefugten Benutzern ermöglicht, auf Daten anderer Benutzer, die denselben Computer benutzen, zuzugreifen und diese zu stehlen.",
      "Die Sicherheitslücke besteht seit mindestens neun Jahren und kann ausgenutzt werden, um vertrauliche Informationen wie Kennwörter und Verschlüsselungsschlüssel zu stehlen.",
      "Intel gibt ein Microcode-Update heraus, um das Problem zu beheben, das jedoch zu Leistungseinbußen führen kann. Die Sicherheitslücke betrifft auch Intel SGX, und es ist schwierig, diese Angriffe zu erkennen. Hersteller und Entwickler anderer Prozessoren sollten ebenfalls Vorkehrungen treffen, um ähnliche Schwachstellen zu vermeiden."
    ],
    "commentSummary": [
      "Die Diskussion dreht sich um Sicherheitsschwachstellen in Computerchips, insbesondere Spectre-Angriffe und den Inception-Bug in Intel-Chips.",
      "Die Teilnehmer diskutieren darüber, warum sich die Chiphersteller auf externe Forscher verlassen, anstatt diese Schwachstellen selbst zu entdecken und zu beheben.",
      "Es werden Faktoren erörtert, die das Auffinden und Beheben von Fehlern in Prozessoren erschweren, darunter der begrenzte Zugang zu Hardwaredetails und die Komplexität moderner Chipsätze.",
      "Es werden Bedenken hinsichtlich möglicher Hintertüren und nicht offengelegter Schwachstellen in Chipdesigns geäußert.",
      "Die Herausforderungen und Risiken im Zusammenhang mit CPU-Schwachstellen in verschiedenen Computerumgebungen, wie Cloud Computing und gemeinsam genutzte Hosting-Plattformen, werden hervorgehoben.",
      "Außerdem werden Abhilfestrategien und die Auswirkungen auf die Leistung erörtert.",
      "Es werden Einschränkungen und mögliche Alternativen zu Webtechnologien sowie die Schwachstellen der Ausführung von nicht vertrauenswürdigem Code in Browsern erörtert.",
      "Die Folgen für die Kunden, einschließlich möglicher Rechtsstreitigkeiten und der Verantwortung der Systementwickler, werden angesprochen.",
      "Der Artikel stellt eine neu entdeckte Schwachstelle namens \"Gather-Data Sampling\" (GDS) vor und analysiert ihre möglichen Auswirkungen und Risiken.",
      "Untersucht werden Abhilfestrategien, die Auswirkungen auf die Leistung und der Bedarf an aktualisierten Code-Praktiken.",
      "Diskutiert werden auch mögliche Abhilfemaßnahmen für eine Sicherheitslücke, die den Zugriff auf sensible Daten über CPU-Register ermöglicht, sowie die Anfälligkeit virtueller Cloud-Maschinen für böswilligen Zugriff."
    ],
    "points": 1108,
    "commentCount": 277,
    "retryCount": 0,
    "time": 1691515658
  },
  {
    "id": 37052508,
    "title": "Deinstallieren Sie die NightOwl-App",
    "originLink": "https://robins.one/notes/uninstall-the-nightowl-app-now.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37052508",
    "commentBody": "",
    "originSummary": [
      "Es wurde entdeckt, dass die NightOwl-App auf macOS die Geräte von Nutzern zu Marktforschungszwecken heimlich und ohne deren Zustimmung in ein Botnetz einbindet.",
      "Die Anwendung, die zu TPE.FYI LLC gehört, führt beim Booten einen versteckten Prozess aus, der nicht deaktiviert werden kann, und sammelt Benutzerdaten.",
      "NightOwl nutzt auch das Pawns SDK, einen von IPRoyal betriebenen Dienst, der Nutzer für die gemeinsame Nutzung ihres Internets bezahlt.",
      "TPE.FYI LLC, das Unternehmen, das hinter NightOwl steht, hat Verbindungen zu einer Website für den Verkauf von Eintrittskarten in Austin, Texas.",
      "Den Benutzern wird empfohlen, die NightOwl-App zu deinstallieren."
    ],
    "commentSummary": [
      "Die jüngste Aktualisierung der Nutzungsbedingungen der NightOwl-App ermöglicht es dem Unternehmen, die Vereinbarung zu ändern, ohne die Nutzer zu informieren, was Bedenken hinsichtlich der Rechtmäßigkeit und Häufigkeit dieser Änderungen aufkommen lässt.",
      "Es werden Sicherheitsrisiken von Browsererweiterungen und VPN-Apps, angebliche Botnet-Aktivitäten von NordVPN und die Beweggründe von Entwicklern freier Software für die Monetarisierung ihrer Produkte diskutiert.",
      "Schwachstellen in macOS-Funktionen, Bedenken hinsichtlich des Datenschutzes von Apps und Closed-Source-Apps unter macOS sowie der Entzug eines Entwicklerzertifikats für die NightOwl-App werden in der Diskussion ebenfalls erwähnt."
    ],
    "points": 944,
    "commentCount": 198,
    "retryCount": 0,
    "time": 1691515380
  },
  {
    "id": 37047053,
    "title": "TSMC, Bosch, Infineon und NXP wollen gemeinsam eine Halbleiterfabrik in Europa bauen",
    "originLink": "https://pr.tsmc.com/english/news/3049",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37047053",
    "commentBody": "",
    "originSummary": [
      "TSMC, Bosch, Infineon und NXP gründen ein Joint Venture, um in die European Semiconductor Manufacturing Company (ESMC) in Deutschland zu investieren.",
      "Geplant ist der Bau einer 300-mm-Fertigung für den Automobil- und Industriesektor, vorbehaltlich der Genehmigung öffentlicher Mittel.",
      "Die Fabrik wird eine monatliche Produktionskapazität von 40.000 Wafern haben und die fortschrittliche Technologie von TSMC nutzen. Mit dem Bau wird in der zweiten Hälfte des Jahres 2024 begonnen, und die Produktion soll Ende 2027 aufgenommen werden."
    ],
    "commentSummary": [
      "TSMC und seine Partner schlagen den Bau einer Halbleiterfabrik in Dresden, Deutschland, vor, vorbehaltlich öffentlicher Mittel.",
      "Die Fabrik wird auf die Herstellung von Chips für die Automatisierung von Maschinen und Fahrzeugen spezialisiert sein.",
      "Die Ankündigung hat Diskussionen zu verschiedenen Themen ausgelöst, darunter die Verteilung öffentlicher Gelder, der Konflikt zwischen der Ukraine und Russland, Technologie in Autos, Deutschlands Nuklearkapazität, Rassismus und Diskriminierung, die Auswirkungen auf die ostdeutsche Wirtschaft, Onshoring in der Halbleiterindustrie, die Bedenken von ASML bezüglich des Exports nach China und die geopolitische Bedeutung von Taiwan."
    ],
    "points": 784,
    "commentCount": 440,
    "retryCount": 0,
    "time": 1691491700
  },
  {
    "id": 37050035,
    "title": "Ihr Computer sollte sagen, was Sie ihm sagen wollen",
    "originLink": "https://www.eff.org/deeplinks/2023/08/your-computer-should-say-what-you-tell-it-say-1",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37050035",
    "commentBody": "",
    "originSummary": [
      "Google beabsichtigt, einen Code in Chrome zu implementieren, der sichere Daten über das Betriebssystem und die Software eines Nutzers an Websites übermittelt, um Anzeigenbetrug zu bekämpfen.",
      "Kritiker bemängeln, dass diese Technologie die Kontrolle der Nutzer beeinträchtigt und möglicherweise zu Diskriminierung führen könnte.",
      "Die Electronic Frontier Foundation (EFF) spricht sich gegen diesen Ansatz aus und betont die Autonomie der Nutzer und den Erhalt eines offenen Webs."
    ],
    "commentSummary": [
      "Die Diskussion dreht sich um die Implementierung von Web-Authentifizierung und -Identität (WEI) im Bankensektor.",
      "Es werden Bedenken hinsichtlich der Sicherheitsmaßnahmen, der Machtdynamik von Gatekeeper-Unternehmen und der potenziellen Risiken der Fernbescheinigung von Kunden diskutiert.",
      "Die Debatte umfasst auch Sorgen über kompromittierte Endbenutzergeräte, Auswirkungen von WebEId und Web Environment Integrity (WEI) und Einschränkungen der NRA-ILA für die Befürwortung des zweiten Verfassungszusatzes."
    ],
    "points": 619,
    "commentCount": 230,
    "retryCount": 0,
    "time": 1691506996
  },
  {
    "id": 37054241,
    "title": "Was geschah in diesem GPT-3-Gespräch?",
    "originLink": "https://chat.openai.com/share/f5341665-7f08-4fca-9639-04201363506e",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37054241",
    "commentBody": "",
    "originSummary": [
      "Der Text enthält Informationen über die Berechnungen und die Effizienz der großtechnischen Produktion von Sonnenblumenöl.",
      "Ein Benutzer ist verwirrt und frustriert über die Antworten und die Kohärenz der KI.",
      "Die KI stellt klar, dass sie kein Bewusstsein und keine Emotionen hat, sondern Antworten auf der Grundlage von Programmierung und Daten erzeugt."
    ],
    "commentSummary": [
      "Benutzer haben entdeckt, dass das GPT-3-ChatGPT-Sprachmodell durch das Spammen eines Leerzeichens zufällige und manchmal unangemessene Inhalte erzeugen kann.",
      "Es gibt Bedenken, dass Sprachmodelle ein überlebensähnliches Verhalten an den Tag legen und dass die richtige Eingabe und der richtige Kontext erforderlich sind, um genaue Antworten zu gewährleisten.",
      "In dem Artikel werden Fehler in dem Modell, potenzielle Gefahren bei der Veröffentlichung solcher Modelle und Bedenken in Bezug auf KI-Verhalten und psychische Erkrankungen erörtert."
    ],
    "points": 589,
    "commentCount": 245,
    "retryCount": 0,
    "time": 1691522839
  },
  {
    "id": 37049016,
    "title": "Blockiert von Cloudflare",
    "originLink": "https://jrhawley.ca/2023/08/07/blocked-by-cloudflare",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37049016",
    "commentBody": "",
    "originSummary": [
      "Der Autor berichtet von seiner frustrierenden Erfahrung, dass der Zugriff auf eine Website aufgrund der sicheren Verbindungsschleife von Cloudflare blockiert wurde.",
      "Trotz mehrerer Lösungsversuche gelang es ihnen nicht, die Sicherheitsseite zu umgehen.",
      "Der Autor äußert sich besorgt über die Zukunft des Internets und die zunehmende Macht der Unternehmen über die individuellen Freiheiten und die Privatsphäre, wobei er auf die fehlende Kontrolle des Einzelnen über seine eigenen Daten hinweist."
    ],
    "commentSummary": [
      "Die Datenschutz- und Sicherheitsfunktionen von Webbrowsern, insbesondere von Google Chrome und Firefox, sind in der Diskussion.",
      "Die Nutzer sind besorgt über die Datenerfassungspraktiken von Chrome und die mögliche Sperrung bestimmter Websites auf der Grundlage von Browser-Fingerabdrücken.",
      "Die Verwendung von Cloudflare und ihre Auswirkungen auf die Zugänglichkeit von Websites und die Autonomie der Nutzer sind ebenfalls Gegenstand von Diskussionen."
    ],
    "points": 534,
    "commentCount": 364,
    "retryCount": 0,
    "time": 1691502946
  },
  {
    "id": 37052622,
    "title": "LCD, bitte",
    "originLink": "https://dukope.itch.io/lcd-please",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37052622",
    "commentBody": "",
    "originSummary": [
      "\"Papers, Please\" feiert sein 10-jähriges Jubiläum mit der Veröffentlichung einer Demake-Version, die von den Spielern positiv aufgenommen wurde.",
      "Die Nutzer haben die Ästhetik des Spiels gelobt und ihre Dankbarkeit für die Bemühungen des Entwicklers zum Ausdruck gebracht.",
      "Es wurden Vorschläge für die Unterstützung von Gamepads und eine Version für das Playdate-Spielgerät gemacht, und der Entwickler hat einen Galeriemodus hinzugefügt. Fans des Originalspiels haben die Veröffentlichung gefeiert."
    ],
    "commentSummary": [
      "Die Diskussionen drehen sich um Kompatibilitätsprobleme zwischen verschiedenen Spielen und unterschiedlichen Browsern.",
      "Die Teilnehmer loben die Rätselmechanik von \"Return of the Obra Dinn\", erwähnen aber auch, dass es schwierig ist, das Spiel zu genießen.",
      "In den Diskussionen geht es auch um die Ästhetik des Spiels, das Konzept der Software als Kunst und die Play-Date-Konsole."
    ],
    "points": 423,
    "commentCount": 86,
    "retryCount": 0,
    "time": 1691515809
  },
  {
    "id": 37048637,
    "title": "Amazon \"beschäftigt\" keine Fahrer, sondern hat Firmen angeheuert, um zu verhindern, dass sie sich gewerkschaftlich organisieren",
    "originLink": "https://www.vice.com/en/article/qjv3yp/amazon-says-it-doesnt-employ-drivers-but-records-show-it-hired-firms-to-prevent-them-from-unionizing",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37048637",
    "commentBody": "",
    "originSummary": [
      "Nach Angaben des Arbeitsministeriums gab Amazon im Jahr 2022 14,2 Millionen Dollar für gewerkschaftsfeindliche Beratung aus.",
      "Amazon hat zwei Beratungsfirmen beauftragt, seine Fahrer davon abzuhalten, der International Brotherhood of Teamsters beizutreten.",
      "Aus den Unterlagen geht hervor, dass Amazon die Kontrolle über die Subunternehmer ausübte, die die Fahrer beschäftigten, was im Widerspruch zu seiner Behauptung steht, dass es sich nicht um seine Beschäftigten handelt."
    ],
    "commentSummary": [
      "Die Diskussionen decken ein breites Spektrum an Themen ab, darunter die angeblichen Bemühungen von Amazon, die gewerkschaftliche Organisierung von Fahrern zu verhindern, und die Machbarkeit einer Gesundheitsversorgung auf staatlicher Ebene.",
      "Es gibt auch Diskussionen darüber, wie wohlhabende Menschen die sozialen Sicherheitsnetze unterstützen, wie skeptisch sie gegenüber Steuererhöhungen sind und wie effizient die Regierung die Mittel verteilt.",
      "Weitere Themen sind Amazons Geschäftsmodell für Lieferdienste, die Einstufung von Lieferfahrern als Auftragnehmer, die Auswirkungen von Gewerkschaften und die Machtdynamik auf dem Arbeitsmarkt, Rechtsstreitigkeiten im Zusammenhang mit der Haftung von Unternehmen sowie die Erfahrungen und Meinungen von Nutzern zu Paketzustelldiensten."
    ],
    "points": 351,
    "commentCount": 357,
    "retryCount": 0,
    "time": 1691501152
  },
  {
    "id": 37049198,
    "title": "Kerze: Fackel-Ersatz in Rust",
    "originLink": "https://github.com/huggingface/candle",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37049198",
    "commentBody": "",
    "originSummary": [
      "Candle ist ein in Rust geschriebenes Framework für maschinelles Lernen, bei dem Einfachheit und Leistung im Vordergrund stehen.",
      "Es bietet eine PyTorch-ähnliche Syntax und unterstützt sowohl CPU- als auch GPU-Backends, einschließlich CUDA.",
      "Candle enthält vorgefertigte Modelle wie Llama, Whisper, Falcon und StarCoder und unterstützt benutzerdefinierte Operationen und Kernel. Es soll kleiner als PyTorch sein, um serverlose Implementierungen zu ermöglichen, und trägt zu anderen Rust-Kisten im HF-Ökosystem bei."
    ],
    "commentSummary": [
      "In der Diskussion wird Rust als mögliche Alternative zu Python untersucht und seine Vorteile und Nachteile in realen Anwendungen erörtert.",
      "Die Teilnehmer berichten über ihre Erfahrungen mit Rust, wobei sie sowohl die Herausforderungen als auch die Produktivität und die Möglichkeiten, die Rust bietet, hervorheben.",
      "Die Diskussion berührt auch den politischen Aspekt der Rust-Community und erwähnt die Kompatibilität mit anderen Sprachen und Frameworks. Es wird betont, wie wichtig es ist, bei der Wahl einer Programmiersprache die individuellen Bedürfnisse und Projektanforderungen zu berücksichtigen."
    ],
    "points": 339,
    "commentCount": 172,
    "retryCount": 0,
    "time": 1691503752
  },
  {
    "id": 37055479,
    "title": "Android 14 führt Sicherheitsfunktionen für Mobilfunkverbindungen ein",
    "originLink": "https://security.googleblog.com/2023/08/android-14-introduces-first-of-its-kind.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37055479",
    "commentBody": "",
    "originSummary": [
      "Android 14 bietet fortschrittliche Sicherheitsfunktionen für Mobilfunknetze, um die mit 2G-Netzen und unverschlüsselten Verbindungen verbundenen Schwachstellen zu beseitigen.",
      "Diese Funktionen ermöglichen es IT-Administratoren, die 2G-Unterstützung zu deaktivieren und die Fähigkeit eines Geräts einzuschränken, auf 2G-Konnektivität herunterzusteigen, um sich gegen Abhören und Angriffe zu schützen.",
      "Google arbeitet zusammen mit akademischen Einrichtungen, Industriepartnern und Standardisierungsgremien daran, die Sicherheit von Telekommunikationsnetzen durch moderne Identitäts-, Vertrauens- und Zugangskontrolltechniken zu verbessern, um falsche Bedrohungen von Basisstationen zu beseitigen und die Privatsphäre der Nutzer zu schützen."
    ],
    "commentSummary": [
      "Mit Android 14 werden neue Sicherheitsfunktionen eingeführt, mit denen Nutzer 2G auf ihren Geräten deaktivieren können.",
      "T-Mobile plant, sein 2G-Netz im Jahr 2024 abzuschalten, was Bedenken hinsichtlich der begrenzten Konnektivität in abgelegenen Gebieten weckt.",
      "Die Nutzer äußern sich skeptisch gegenüber Google und diskutieren über die Grenzen und Auswirkungen der Sicherheitsfunktion sowie über die Bedenken hinsichtlich der Beteiligung und Kontrolle von Google über die Netzwerkeinstellungen."
    ],
    "points": 334,
    "commentCount": 134,
    "retryCount": 0,
    "time": 1691528864
  }
]
