[
  {
    "id": 37052586,
    "title": "Downfall hyökkäykset",
    "originLink": "https://downfall.page/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37052586",
    "commentBody": "",
    "originSummary": [
      "Downfall-hyökkäykset ovat 6.-11. sukupolven Intel Core -prosessoreissa havaittu tietoturva-aukko, jonka avulla luvattomat käyttäjät voivat päästä käsiksi ja varastaa tietoja muilta samaa tietokonetta käyttäviltä käyttäjiltä.",
      "Haavoittuvuus on ollut olemassa ainakin yhdeksän vuotta, ja sen avulla voidaan varastaa arkaluonteisia tietoja, kuten salasanoja ja salausavaimia.",
      "Intel julkaisee mikrokoodipäivityksen ongelman ratkaisemiseksi, mutta se saattaa aiheuttaa suorituskyvyn ylikuormitusta. Haavoittuvuus vaikuttaa myös Intel SGX:ään, ja näiden hyökkäysten havaitseminen on haastavaa. Myös muiden prosessoreiden valmistajien ja suunnittelijoiden tulisi ryhtyä varotoimiin vastaavien haavoittuvuuksien estämiseksi."
    ],
    "commentSummary": [
      "Keskustelu pyörii tietokonesirujen tietoturva-aukkojen ympärillä, erityisesti Spectre-hyökkäysten ja Intelin sirujen Inception-virheen ympärillä.",
      "Osallistujat keskustelevat siitä, miksi siruvalmistajat luottavat ulkopuolisiin tutkijoihin sen sijaan, että he löytäisivät ja korjaisivat nämä haavoittuvuudet itse.",
      "Keskustellaan prosessoreissa olevien vikojen löytämisen ja korjaamisen vaikeuteen vaikuttavista tekijöistä, kuten laitteiston yksityiskohtien rajallisesta saatavuudesta ja nykyaikaisten piirisarjojen monimutkaisuudesta.",
      "Huolta herättävät mahdolliset takaovet ja piirisuunnitelmien paljastamattomat haavoittuvuudet.",
      "Keskusyksikön haavoittuvuuksiin liittyviä haasteita ja riskejä erilaisissa laskentaympäristöissä, kuten pilvipalveluissa ja jaetuissa hosting-alustoissa, tuodaan esiin.",
      "Myös lieventämisstrategioista ja niiden vaikutuksesta suorituskykyyn keskustellaan.",
      "Keskustellaan verkkotekniikoiden rajoituksista ja mahdollisista vaihtoehdoista sekä selaimissa suoritettavan epäluotettavan koodin haavoittuvuuksista.",
      "Asiakasnäkökohtia, mukaan lukien mahdolliset oikeusjutut ja järjestelmien suunnittelijoiden vastuu, käsitellään.",
      "Artikkelissa esitellään äskettäin löydetty haavoittuvuus nimeltä \"Gather-Data Sampling\" (GDS) ja analysoidaan sen mahdollisia vaikutuksia ja riskejä.",
      "Tarkastellaan lieventämisstrategioita, suorituskykyvaikutuksia ja tarvetta päivittää koodikäytäntöjä.",
      "Keskusteluissa käsitellään myös haavoittuvuuden mahdollisia lieventämistoimia, jotka mahdollistavat pääsyn arkaluonteisiin tietoihin suorittimen rekisterien kautta, sekä pilvipalvelun virtuaalikoneiden haavoittuvuutta haitalliselle käytölle."
    ],
    "points": 1108,
    "commentCount": 277,
    "retryCount": 0,
    "time": 1691515658
  },
  {
    "id": 37052508,
    "title": "Poista NightOwl-sovelluksen asennus",
    "originLink": "https://robins.one/notes/uninstall-the-nightowl-app-now.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37052508",
    "commentBody": "",
    "originSummary": [
      "MacOS:n NightOwl-sovelluksen on havaittu liittävän käyttäjien laitteet salaa botnetiin markkinatutkimustarkoituksessa ilman heidän suostumustaan.",
      "TPE.FYI LLC:n omistama sovellus suorittaa käynnistyksen yhteydessä piilotetun prosessin, jota ei voi poistaa käytöstä, ja kerää käyttäjätietoja.",
      "NightOwl käyttää myös Pawns SDK:ta, IPRoyalin ylläpitämää palvelua, joka maksaa käyttäjille internetin jakamisesta.",
      "NightOwlin takana olevalla TPE.FYI LLC:llä on yhteyksiä lippuja myyvään verkkosivustoon Austinissa, Texasissa.",
      "Käyttäjille suositellaan NightOwl-sovelluksen poistamista."
    ],
    "commentSummary": [
      "NightOwl-sovelluksen äskettäinen käyttöehtojen päivitys antaa yhtiölle mahdollisuuden muuttaa sopimusta ilmoittamatta siitä käyttäjille, mikä herättää huolta näiden muutosten laillisuudesta ja tiheydestä.",
      "Keskustellaan selainlaajennusten ja VPN-sovellusten turvallisuusriskeistä, NordVPN:n väitetyistä bottiverkkotoiminnoista ja ilmaisten ohjelmistojen kehittäjien motiiveista saada tuotteistaan rahaa.",
      "Keskustelussa mainitaan myös macOS-ominaisuuksien puutteet, huoli sovellusten yksityisyydestä ja suljetun lähdekoodin sovelluksista macOS:ssä sekä NightOwl-sovelluksen kehittäjäsertifikaatin peruuttaminen."
    ],
    "points": 944,
    "commentCount": 198,
    "retryCount": 0,
    "time": 1691515380
  },
  {
    "id": 37047053,
    "title": "TSMC, Bosch, Infineon ja NXP rakentavat yhdessä puolijohdetehtaan Eurooppaan.",
    "originLink": "https://pr.tsmc.com/english/news/3049",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37047053",
    "commentBody": "",
    "originSummary": [
      "TSMC, Bosch, Infineon ja NXP perustavat yhteisyrityksen investoidakseen European Semiconductor Manufacturing Companyyn (ESMC) Saksassa.",
      "Suunnitelmissa on rakentaa 300 mm:n tuotantolaitos auto- ja teollisuussektorille, jos julkinen rahoitus saadaan hyväksyttyä.",
      "Tuotantolaitoksen kuukausittainen tuotantokapasiteetti on 40 000 kiekkoa, ja siinä hyödynnetään TSMC:n kehittynyttä teknologiaa. Rakennustyöt aloitetaan vuoden 2024 jälkipuoliskolla, ja tuotannon on määrä alkaa vuoden 2027 loppuun mennessä."
    ],
    "commentSummary": [
      "TSMC ja sen yhteistyökumppanit ehdottavat puolijohdetehtaan rakentamista Dresdeniin Saksaan, kunhan julkinen rahoitus saadaan.",
      "Tuotantolaitos on erikoistunut koneiden ja ajoneuvojen automaatiossa käytettävien sirujen valmistukseen.",
      "Ilmoitus on herättänyt keskustelua eri aiheista, kuten julkisten varojen jakamisesta, Ukrainan ja Venäjän välisestä konfliktista, autojen teknologiasta, Saksan ydinvoimakapasiteetista, rasismista ja syrjinnästä, Itä-Saksan talouteen kohdistuneista vaikutuksista, puolijohdeteollisuuden ulkoistamisesta, ASML:n huolista Kiinaan suuntautuvasta viennistä ja Taiwanin geopoliittisesta merkityksestä."
    ],
    "points": 784,
    "commentCount": 440,
    "retryCount": 0,
    "time": 1691491700
  },
  {
    "id": 37050035,
    "title": "Tietokoneen pitäisi sanoa, mitä käsket sen sanoa.",
    "originLink": "https://www.eff.org/deeplinks/2023/08/your-computer-should-say-what-you-tell-it-say-1",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37050035",
    "commentBody": "",
    "originSummary": [
      "Google aikoo sisällyttää Chromeen koodin, joka välittää verkkosivustoille suojattua tietoa käyttäjän käyttöjärjestelmästä ja ohjelmistosta mainospetosten torjumiseksi.",
      "Kriitikot väittävät, että tämä tekniikka vaarantaa käyttäjän kontrollin ja saattaa johtaa syrjintään.",
      "Electronic Frontier Foundation (EFF) vastustaa tätä lähestymistapaa ja korostaa käyttäjien autonomiaa ja avoimen verkon säilyttämistä."
    ],
    "commentSummary": [
      "Keskustelun aiheena on Web Authentication and Identity (WEI) -järjestelmän käyttöönotto pankkialalla.",
      "Keskustellaan turvallisuustoimenpiteisiin liittyvistä huolenaiheista, portinvartijayritysten vallan dynamiikasta ja etäasiakkaiden varmentamiseen liittyvistä mahdollisista riskeistä.",
      "Keskustelua käydään myös loppukäyttäjien vaarantuneista laitteista, WebEId:n ja WEI:n (Web Environment Integrity) vaikutuksista sekä NRA-ILA:n rajoituksista toisen perustuslain muutoksen puolustamisessa."
    ],
    "points": 619,
    "commentCount": 230,
    "retryCount": 0,
    "time": 1691506996
  },
  {
    "id": 37054241,
    "title": "Mitä tässä GPT-3-keskustelussa tapahtui?",
    "originLink": "https://chat.openai.com/share/f5341665-7f08-4fca-9639-04201363506e",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37054241",
    "commentBody": "",
    "originSummary": [
      "Kappale sisältää tietoja auringonkukkaöljyn laajamittaisen tuotannon laskelmista ja tehokkuudesta.",
      "Käyttäjä on ilmaissut hämmennystä ja turhautumista tekoälyn vastauksista ja johdonmukaisuudesta.",
      "Tekoäly selventää, että sillä ei ole tietoisuutta eikä tunteita, vaan se tuottaa vastauksia ohjelmoinnin ja datan perusteella."
    ],
    "commentSummary": [
      "Käyttäjät ovat havainneet, että välilyönnin lisääminen yhdellä merkillä voi saada GPT-3 ChatGPT -kielimallin tuottamaan satunnaista ja joskus sopimatonta sisältöä.",
      "On olemassa huolenaiheita siitä, että kielimallit käyttäytyvät eloonjäämisen kaltaisesti ja että oikeiden vastausten varmistamiseksi tarvitaan asianmukaista syötettä ja asiayhteyttä.",
      "Artikkelissa käsitellään mallin virheitä, tällaisten mallien julkaisemisen mahdollisia vaaroja sekä tekoälyn käyttäytymiseen ja mielisairauksiin liittyviä huolenaiheita."
    ],
    "points": 589,
    "commentCount": 245,
    "retryCount": 0,
    "time": 1691522839
  },
  {
    "id": 37049016,
    "title": "Cloudflare on estänyt",
    "originLink": "https://jrhawley.ca/2023/08/07/blocked-by-cloudflare",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37049016",
    "commentBody": "",
    "originSummary": [
      "Kirjoittaja kertoo turhauttavasta kokemuksestaan, kun hän ei päässyt verkkosivustolle Cloudflaren suojatun yhteyden silmukan vuoksi.",
      "Vaikka he yrittivät useita ratkaisuja, he eivät pystyneet ohittamaan turvasivua.",
      "Kirjoittaja ilmaisee huolensa verkon tulevaisuudesta ja yritysten kasvavasta vallasta yksilön vapauksiin ja yksityisyyteen nähden ja korostaa, että yksilöillä ei ole mahdollisuutta valvoa omia tietojaan."
    ],
    "commentSummary": [
      "Verkkoselaimien, erityisesti Google Chromen ja Firefoxin, yksityisyys- ja tietoturvaominaisuuksista keskustellaan.",
      "Käyttäjät ovat huolissaan Chromen tiedonkeruukäytännöistä ja tiettyjen sivustojen mahdollisesta estämisestä selaimen sormenjälkien perusteella.",
      "Cloudflaren käytöstä ja sen vaikutuksesta verkkosivustojen saavutettavuuteen ja käyttäjien riippumattomuuteen käydään myös keskustelua."
    ],
    "points": 534,
    "commentCount": 364,
    "retryCount": 0,
    "time": 1691502946
  },
  {
    "id": 37052622,
    "title": "LCD, kiitos",
    "originLink": "https://dukope.itch.io/lcd-please",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37052622",
    "commentBody": "",
    "originSummary": [
      "\"Papers, Please\" juhlii 10-vuotispäiväänsä julkaisemalla demake-version, joka on saanut pelaajilta positiivista palautetta.",
      "Käyttäjät ovat kehuneet pelin estetiikkaa ja ilmaisseet kiitollisuutensa kehittäjän ponnisteluista.",
      "Gamepad-tukea ja Playdate-pelilaitteen versiota on ehdotettu, ja kehittäjä on lisännyt galleriatilan. Alkuperäisen pelin fanit ovat juhlineet julkaisua."
    ],
    "commentSummary": [
      "Keskusteluissa keskitytään eri pelien ja eri selainten välisiin yhteensopivuusongelmiin.",
      "Osallistujat kehuvat \"Obra Dinnin paluun\" palapelimekaniikkaa, mutta mainitsevat, että siitä on vaikea nauttia.",
      "Keskusteluissa käsitellään myös pelin estetiikkaa, ohjelmistojen käsitettä taiteena ja Play Date -konsolia."
    ],
    "points": 423,
    "commentCount": 86,
    "retryCount": 0,
    "time": 1691515809
  },
  {
    "id": 37048637,
    "title": "Amazon ei \"työllistä\" kuljettajia, vaan palkkasi yrityksiä estääkseen heitä järjestäytymästä ammattiyhdistyksiin",
    "originLink": "https://www.vice.com/en/article/qjv3yp/amazon-says-it-doesnt-employ-drivers-but-records-show-it-hired-firms-to-prevent-them-from-unionizing",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37048637",
    "commentBody": "",
    "originSummary": [
      "Työministeriön tietojen mukaan Amazon käytti 14,2 miljoonaa dollaria ammattiliittojen vastaiseen konsultointiin vuonna 2022.",
      "Amazon palkkasi kaksi konsulttiyritystä estääkseen kuljettajiensa liittymisen International Brotherhood of Teamsters -järjestöön.",
      "Asiakirjoista käy ilmi, että Amazon valvoi kuljettajia työllistäviä alihankkijoita, mikä on ristiriidassa sen väitteen kanssa, jonka mukaan kuljettajat eivät ole sen työntekijöitä."
    ],
    "commentSummary": [
      "Keskusteluissa käsitellään monenlaisia aiheita, kuten Amazonin väitettyjä pyrkimyksiä estää kuljettajien liittoutuminen ja osavaltiotason terveydenhuollon toteutettavuutta.",
      "Keskustelua käydään myös siitä, miten varakkaat ihmiset tukevat sosiaalisia turvaverkkoja, suhtautuvat epäilevästi veronkorotuksiin ja ovat huolissaan hallituksen tehokkuudesta varojen kohdentamisessa.",
      "Muita aiheita ovat muun muassa Amazonin toimituspalvelujen liiketoimintamalli, jakelukuljettajien luokittelu urakoitsijoiksi, ammattiliittojen ja valtadynamiikan vaikutukset työmarkkinoilla, yritysten vastuita koskevat oikeustapaukset sekä käyttäjien kokemukset ja mielipiteet pakettien toimituspalveluista."
    ],
    "points": 351,
    "commentCount": 357,
    "retryCount": 0,
    "time": 1691501152
  },
  {
    "id": 37049198,
    "title": "Kynttilä: Soihtu Korvaus Rust",
    "originLink": "https://github.com/huggingface/candle",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37049198",
    "commentBody": "",
    "originSummary": [
      "Candle on Rust-kielellä kirjoitettu koneoppimiskehys, jossa yksinkertaisuus ja suorituskyky ovat etusijalla.",
      "Se tarjoaa PyTorchin kaltaisen syntaksin ja tukee sekä CPU- että GPU-taustoja, mukaan lukien CUDA.",
      "Candle sisältää valmiita malleja, kuten Llama, Whisper, Falcon ja StarCoder, ja tukee käyttäjän määrittelemiä toimintoja ja ytimiä. Sen tavoitteena on olla pienempi kuin PyTorch, jotta se mahdollistaisi palvelimettomat käyttöönotot, ja se osallistuu HF-ekosysteemin muihin Rust-kehyksiin."
    ],
    "commentSummary": [
      "Keskustelussa tarkastellaan Rustia mahdollisena vaihtoehtona Pythonille ja keskustellaan sen eduista ja kompromisseista todellisissa sovelluksissa.",
      "Osallistujat jakavat kokemuksiaan Rustista ja korostavat sekä haasteita että sen tarjoamia tuottavuutta ja mahdollisuuksia.",
      "Keskustelussa käsitellään myös Rust-yhteisön poliittista näkökulmaa ja mainitaan yhteensopivuus muiden kielten ja kehysten kanssa. Siinä korostetaan, että ohjelmointikieltä valittaessa on tärkeää ottaa huomioon yksilölliset tarpeet ja projektivaatimukset."
    ],
    "points": 339,
    "commentCount": 172,
    "retryCount": 0,
    "time": 1691503752
  },
  {
    "id": 37055479,
    "title": "Android 14 esittelee matkapuhelinyhteyksien tietoturvaominaisuudet",
    "originLink": "https://security.googleblog.com/2023/08/android-14-introduces-first-of-its-kind.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37055479",
    "commentBody": "",
    "originSummary": [
      "Android 14 tuo mukanaan kehittyneitä matkapuhelinturvaominaisuuksia, joilla puututaan 2G-verkkoihin ja nollasalattuihin yhteyksiin liittyviin haavoittuvuuksiin.",
      "Näiden ominaisuuksien avulla IT-ylläpitäjät voivat poistaa 2G-tuen käytöstä ja rajoittaa laitteen kykyä siirtyä 2G-yhteyteen, mikä suojaa salakuuntelulta ja hyökkäyksiltä.",
      "Google tekee yhteistyötä akateemisten laitosten, teollisuuskumppaneiden ja standardointielinten kanssa parantaakseen televerkkojen tietoturvaa nykyaikaisilla identiteetti-, luottamus- ja pääsynvalvontatekniikoilla, joilla pyritään poistamaan väärät tukiasemauhat ja parantamaan käyttäjien viestinnän yksityisyyttä."
    ],
    "commentSummary": [
      "Android 14 esittelee uusia tietoturvaominaisuuksia, joiden avulla käyttäjät voivat poistaa 2G:n käytöstä laitteissaan.",
      "T-Mobile aikoo sulkea 2G-verkkonsa vuonna 2024, mikä herättää huolta yhteyksien rajallisuudesta syrjäseuduilla.",
      "Käyttäjät suhtautuvat epäilevästi Googleen ja keskustelevat tietoturvaominaisuuden rajoituksista ja vaikutuksista sekä Googlen osallisuudesta ja verkkoasetusten hallinnasta."
    ],
    "points": 334,
    "commentCount": 134,
    "retryCount": 0,
    "time": 1691528864
  }
]
