[
  {
    "title": "미국 의원들, 중국 블록체인과의 연방 관계를 제한하는 명확성 법안 도입",
    "originLink": "https://cointelegraph.com/news/u-s-lawmakers-clarity-act-tlimit-federal-ties-chinese-blockchain",
    "originBody": "",
    "originSummary": [
      "미국 의원인 잭 넌과 아비게일 스팬버거는 중국 블록체인 기업과의 연방 관계를 제한하는 2023년 투명성 법안(CLARITY Act of 2023)을 제안했습니다.",
      "이 법안은 정부 공무원이 테더의 모회사인 아이파이넥스 등 중국 블록체인 및 암호화폐 거래 플랫폼과 거래하는 것을 금지하는 내용을 담고 있습니다.",
      "이 법안은 암호화폐 부문에서 중국과의 연관성에 대한 우려를 해결함으로써 중요한 국가 안보 정보와 미국인의 개인 정보를 보호하는 것을 목표로 합니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "US lawmakers Zach Nunn and Abigail Spanberger have introduced the CLARITY Act of 2023, which seeks to restrict federal interactions with Chinese blockchain firms.",
      "The act would bar government officials from engaging in business with Chinese blockchain or cryptocurrency trading platforms and explicitly prohibit transactions with iFinex, the parent company of USDT issuer Tether.",
      "The legislation aims to safeguard critical national security intelligence and the private information of Americans by preventing foreign adversaries from accessing them through Chinese connections in the cryptocurrency sector."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699538596527
  },
  {
    "title": "국익과 미국 달러 보호를 위해 중국 블록체인과 테더를 금지하는 것을 목표로 하는 미국 법안",
    "originLink": "https://www.ledgerinsights.com/us-bill-chinese-blockchains-tether-ban/",
    "originBody": "",
    "originSummary": [
      "잭 넌 의원과 아비게일 스팬버거 의원은 \"중국 및 기타 외국 적대세력\"의 블록체인 활동으로부터 미국을 보호하고 미국 달러의 지위를 보호하기 위한 법안을 발의했습니다.",
      "이 법안은 중국 블록체인 및 최대 스테이블코인 모기업인 아이파이넥스의 테더와 관련된 정부 지출을 금지하고자 합니다.",
      "이 법안에는 블록체인 및 DLT 부문의 행위자에 대한 보고서 요청과 미국 달러의 지위에 미치는 영향에 대한 평가도 포함되어 있습니다.",
      "BSN, BSN 스파르탄 네트워크, 레드 데이트 테크놀로지, 컨플럭스 네트워크와 같은 중국 네트워크가 구체적으로 언급되었습니다.",
      "레드 데이트는 BSN 스파르탄 네트워크가 오픈소스이며 미국 정부의 검토를 환영한다는 입장을 밝혔습니다.",
      "발표 이후 Conflux의 코인 가치는 6% 상승했습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "Representatives Zach Nunn and Abigail Spanberger have introduced a Bill to safeguard the US from blockchain activities of \"China and other foreign adversaries\" and protect the status of the US dollar.",
      "The Bill seeks to prohibit government spending related to Chinese blockchains and Tether, the largest stablecoin parent, iFinex.",
      "It also requires a report on actors in the blockchain and DLT sectors and an assessment of the impact on the US dollar.",
      "The specified Chinese networks include BSN, BSN Spartan Network, Red Date Technology, and Conflux Network.",
      "Red Date Technology responded by stating that the BSN Spartan Network is open source and welcomes the evaluation by the US government.",
      "Following the announcement, Conflux Network has experienced a 6% increase in the value of its coin."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699538596527
  },
  {
    "title": "인터롭 벤처스, 코스모스 블록체인 생태계에 집중하기 위해 385만 달러 투자 유치, RISC 제로 오픈소스 영지식 암호화 기술, 지르회로, 더 빠르고 저렴한 거래를 위한 ZK 롤업 출시, 모플릭스, 헤데라 기술 연구를 위해 310만 달러 투자 유치, 스택랩, 앱별 마이크로 롤업을 위해 550만 달러 투자 유치, 스탠다드차타드와 SBI홀딩스, UAE에 암호화폐 스타트업을 위한 1억 달러 규모의 투자회사 설립.",
    "originLink": "https://www.coindesk.com/tech/2023/11/08/protocol-latest-tech-news-crypto-blockchain/",
    "originBody": "",
    "originSummary": [
      "인터롭 벤처스는 코스모스 블록체인 생태계에 특별한 관심을 가지고 '인터체인 경제'에 초점을 맞춘 385만 달러의 자금을 확보했습니다.",
      "RISC 제로는 영지식 암호화와 블록체인 개발자를 위한 세 가지 핵심 기술을 오픈소스로 공개했습니다.",
      "지르서킷은 보다 효율적인 블록체인 트랜잭션을 목표로 수수료를 낮추고 트랜잭션 속도를 높이기 위해 ZK 증명과 낙관적인 인프라를 결합한 새로운 ZK 롤업을 출시했습니다.",
      "모플릭스는 헤데라의 기술을 자사의 디지털 통신 솔루션에 통합하는 방안을 모색하기 위해 310만 달러의 투자를 유치했습니다.",
      "스태커 랩스는 앱별 \"마이크로 롤업\"의 개발과 출시를 지원하기 위해 시드 라운드에서 550만 달러를 모금했습니다.",
      "스탠다드차타드와 SBI홀딩스는 파트너십을 맺고 아랍에미리트에 1억 달러 규모의 투자 회사를 설립하여 암호화폐 스타트업 투자에 주력할 계획입니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "Interop Ventures, a venture fund focused on the \"Interchain economy,\" has raised $3.85 million in funding, with a particular interest in the Cosmos blockchain ecosystem.",
      "RISC Zero has open-sourced three key technologies for zero knowledge cryptography and blockchain developers.",
      "Zircuit has launched a new ZK rollup that combines ZK proofs with optimistic infrastructure, aiming to reduce fees and increase transaction speeds."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699538596527
  },
  {
    "title": "미국 의원, 웹3.0 분리 노력에서 중국 블록체인을 겨냥한 법안 발의",
    "originLink": "https://www.scmp.com/tech/policy/article/3240921/us-lawmakers-target-chinese-blockchains-bsn-conflux-bill-brings-tech-decoupling-web3",
    "originBody": "",
    "originSummary": [
      "미국 하원 의원 두 명이 연방 기관이 중국에서 개발한 블록체인 네트워크를 사용하거나 관련 기업과 거래하는 것을 금지하는 법안을 제안했습니다.",
      "이 법안은 블록체인 기반 서비스 네트워크(BSN)와 컨플럭스 네트워크를 '외국의 적대적' 분산 원장의 예로 구체적으로 언급하고 있습니다.",
      "법안 발의자들은 이러한 블록체인 기업들이 국가 안보와 외교 정책적 이익에 위험을 초래할 수 있다고 주장하며, 정기적인 위험 평가를 실시할 것을 촉구합니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "Two US House representatives have proposed a bipartisan bill to prevent federal agencies from using Chinese-developed blockchain networks or doing business with related companies.",
      "The bill specifically mentions the Blockchain-based Service Network (BSN) and the Conflux Network as examples of \"foreign adversarial\" distributed ledgers.",
      "The lawmakers argue that these blockchain companies pose risks to national security and foreign policy interests, calling for regular risk assessments to be conducted."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699538596527
  },
  {
    "title": "프랑스 게임 개발사 유비소프트, 블록체인 게임을 위해 이뮤터블과 파트너십 체결",
    "originLink": "https://crypto.news/far-cry-dev-ubisoft-taps-immutable-for-blockchain-games/",
    "originBody": "",
    "originSummary": [
      "Ubisoft는 블록체인 회사인 Immutable과 협력하여 웹3 기술을 사용하여 새로운 게임 경험을 제공합니다.",
      "이번 협업은 게이머에게 디지털 소유권을 제공하고 대체 불가능한 토큰(NFT)을 잠재적으로 통합하는 데 초점을 맞추고 있습니다.",
      "이번 파트너십은 게임 업계에서 블록체인의 가능성을 탐구하기 위한 유비소프트의 헌신을 보여줍니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "Ubisoft has teamed up with blockchain company Immutable to create new gaming experiences using web3 technology.",
      "The partnership aims to offer gamers digital ownership and potentially explore non-fungible tokens (NFTs).",
      "This collaboration demonstrates Ubisoft's dedication to harnessing the potential of blockchain in the gaming industry."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699538596527
  },
  {
    "title": "비트커브 체인, 야심찬 2024년 계획으로 태국 최고의 블록체인 생태계가 되다",
    "originLink": "https://www.cointrust.com/market-news/bitkub-chain-unveils-ambitious-plans-to-become-thailands-leading-blockchain-ecosystem",
    "originBody": "",
    "originSummary": [
      "태국 최고의 블록체인 네트워크인 비트큐브 체인은 사용자 경험 업그레이드, 대체 불가능한 토큰(NFT) 및 모바일 버전 업데이트, 글로벌 확장, 개발자 인센티브 제공 등을 포함한 2024년 계획을 발표했습니다.",
      "이러한 계획은 사용자 편의성을 향상시키고, 경쟁사와 비트큐브 체인을 차별화하며, 급성장하는 NFT 시장을 활용하는 것을 목표로 합니다.",
      "이러한 이니셔티브의 성공적인 실행은 비트큐브 체인을 태국의 선도적인 블록체인 생태계로 발전시키고 태국의 디지털 경제 성장에 기여할 수 있습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "Bitkub Chain, the leading blockchain network in Thailand, has unveiled its ambitious plans for 2024, which encompass a comprehensive user experience revamp, enhancements to NFT and mobile versions, global expansion, and incentives for developers.",
      "These plans aim to cater to the needs of the blockchain community, enhance Bitkub Chain's user-friendliness, distinguish it from other platforms, and take advantage of the flourishing NFT market.",
      "The expansion and developer initiatives are particularly significant, as they could position Bitkub Chain as Thailand's premier blockchain ecosystem and contribute to the growth of the country's digital economy."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699538596527
  },
  {
    "title": "실제 사용으로 풀뿌리 암호화폐 채택이 가속화되고 있다고 체인널리시스 아태지역 정책 책임자는 말합니다.",
    "originLink": "https://finance.yahoo.com/news/grassroots-crypto-adoption-real-world-103000359.html",
    "originBody": "",
    "originSummary": [
      "블록체인 기반 게임 및 송금과 같은 실제 사용 사례가 전 세계 암호화폐 채택을 주도하고 있으며, 아시아 태평양 지역이 그 선두에 서 있습니다.",
      "아시아 태평양 국가를 포함한 중저소득 국가는 전 세계 인구의 40%를 차지하며 암호화폐 채택의 선두에 서 있습니다.",
      "인도가 암호화폐 채택률에서 가장 높은 순위를 차지했고, 나이지리아가 그 뒤를 이었으며, 상위 20개 국가 중 아태지역 국가가 8개국에 달했습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "Real-world use cases are driving crypto adoption globally, with the Asia Pacific region leading the way.",
      "Chainalysis's APAC policy lead, Chengyi Ong, highlighted the growing digital asset use in countries like India and Vietnam, where adoption is outpacing other regions.",
      "Blockchain-based gaming, remittances, and protection against currency volatility are fueling this growth.",
      "Popular commercial applications like cricket-themed NFTs in India and the Axie Infinity blockchain game in Vietnam have onboarded users onto crypto.",
      "Low-to-middle income countries, including APAC nations, make up 40% of the world's population and are leading in crypto adoption.",
      "The collapse of the FTX exchange in 2022 caused a decline in global crypto adoption, but LMIs have since recovered to pre-FTX levels.",
      "A combination of bottom-up adoption in LMIs and top-down adoption in high income countries could drive further crypto adoption.",
      "Chainalysis, despite being valued at $8.6 billion, has recently undergone layoffs.",
      "India ranks the highest in crypto adoption, followed by Nigeria, with eight APAC countries in the top 20."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699538596527
  },
  {
    "title": "레이어 2 네트워크가 블록체인 산업을 혁신하는 방법",
    "originLink": "https://blockchainmagazine.net/how-layer-2-networks-enhance-the-blockchain-industry/",
    "originBody": "",
    "originSummary": [
      "레이어 2 네트워크는 이더리움이나 비트코인과 같은 블록체인 플랫폼 위에 구축된 보조 인프라입니다.",
      "보안과 탈중앙화를 유지하면서 확장성 및 성능 문제를 해결하는 것을 목표로 합니다.",
      "레이어 2 솔루션은 트랜잭션 처리량을 늘리고, 더 낮은 비용으로 더 빠르게 트랜잭션을 처리하며, 블록체인의 혼잡을 줄이고, 개인 정보 보호를 강화하며, 여러 블록체인과의 상호 운용성을 가능하게 합니다.",
      "레이어 2 네트워크의 사용 사례에는 디파이, 대체 불가능한 토큰, 게임, 공급망 추적, 소액 결제, 크로스체인 상호운용성 등이 있습니다.",
      "레이어 2 네트워크는 블록체인 업계에서 중요한 발전으로 여겨지며, 가능성을 확장하고 사용자 경험을 개선하는 데 중요한 역할을 할 것입니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "Layer 2 networks are built on top of blockchain platforms like Ethereum and Bitcoin to tackle scalability and performance issues while maintaining security and decentralization.",
      "These solutions increase transaction throughput, process transactions faster and at lower costs, reduce congestion on the blockchain, enhance privacy, and enable interoperability with multiple blockchains.",
      "Layer 2 networks have diverse use cases including DeFi, NFTs, gaming, supply chain tracking, micropayments, and cross-chain interoperability, making them crucial for expanding possibilities and improving user experience in the blockchain industry."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699538596527
  }
]
