[
  {
    "title": "Baidu CEO Slams China Tech Firms' Frenzy over AI Models as 'Waste of Resources'",
    "originLink": "https://www.scmp.com/tech/big-tech/article/3241659/chinese-tech-companies-frenzy-over-ai-large-language-models-huge-waste-resources-baidu-ceo-says",
    "originBody": "Artificial intelligence + FOLLOW Get more with myNEWS A personalised news feed of stories that matter to you Learn more Let 1 million artificial intelligence-native applications bloom. Baidu chief executive Robin Li says China needs more AI-native applications and less AI large language models. Photo: Shutterstock TechBig Tech Chinese tech companies’ frenzy over AI large language models ‘a huge waste of resources’, Baidu CEO says There are too many large language models being launched in China, but too few AI-native applications are in development, according to Baidu’s Robin Li He called on the government to push policies that would encourage the creation of more AI-native applications to help drive economic growth Iris Deng in Shenzhen + FOLLOW Published: 7:04pm, 15 Nov, 2023 Why you can trust SCMP Chinese tech companies’ repeated launch of various artificial intelligence (AI) large language models (LLMs) is “a huge waste of resources”, according to Baidu’s Robin Li Yanhong, who called on the government to push for greater applications development initiatives that will bring to market more ChatGPT-like services. Li, the co-founder, chairman and chief executive of Chinese internet search giant Baidu, told his audience at the annual X-Lake Forum in Shenzhen on Wednesday that this frenzy over LLMs – the technology used to train intelligent chatbots like ChatGPT – has resulted in 238 such AI models launched in the country as of October, up from 79 in June. By contrast, there are hardly any successful AI applications that are familiar to the public, he said. “There are too many big models in China, but too few AI-native applications based on those models,” Li said. AI-native applications are developed on the “unprecedented” capabilities of AI, according to Li, who used the analogy of Tencent Holdings’ super app WeChat as a mobile-native app. “Developing foundation models continuously and repeatedly is a huge waste of social resources,” he said. “We need 1 million AI-native applications, but we don’t need 100 big models.” Baidu co-founder, chairman and chief executive Robin Li Yanhong speaks at the annual X-Lake Forum in Shenzhen on November 15, 2023. Photo: Handout LLMs are deep-learning AI algorithms that can recognise, summarise, translate, predict and generate content using very large data sets. “If our industry policies can be more encouraging on [creating more] AI-native applications based on the big models, we will surely create a prosperous AI ecosystem and drive a new round of economic growth,” Li said. Li’s remarks extolled AI’s potential to help drive economic growth and become a useful daily tool, while urging China’s technology industry to be more circumspect in developing the technology to meet those goals. In his presentation at the X-Lake Forum, Li criticised recent efforts by unnamed enterprises and cities to hoard advanced semiconductors and build intelligent computing centres as part of plans to build their own AI foundation models from scratch. He indicated that these new models would have no “emergent abilities” – referring to capabilities to perform a task via a few prompts – owing to a lack of parameter scale and training data sets. Intel sees massive demand for AI chips designed for China: report An LLM’s capability partly hinges on its number of parameters, a measure of the sophistication of a model. OpenAI’s ChatGPT, for example, was trained on 175 billion parameters, while most open-sourced Chinese LLMs in the market have between 6 and 13 billion parameters. The government should support the demand side and encourage companies to deploy big models for building new AI applications, according to Li. Still, OpenAI recently introduced its LLM update, GPT-4 Turbo, which is expected to ignite a race among Chinese Big Tech rivals – including Baidu and Alibaba Group Holding, owner of the South China Morning Post – to catch up on this latest development. China’s major tech firms and AI start-ups have been engaged in an intense competition to provide their own ChatGPT-like services, as OpenAI’s popular chatbot and rival services like Google’s Bard are not officially available in mainland China or Hong Kong. OpenAI backer Microsoft Corp, however, has been pushing its GPT-4-powered Bing Chat in the region. OpenAI’s GPT-4 Turbo likely to spark more competition among Chinese rivals Baidu was the first major tech firm in China to launch its own AI chatbot, Ernie Bot, in March. Ernie Bot was made available to the general public in August after receiving government approval. It now has a total user base of 45 million and 54,000 developers, the company said last month. In October, Baidu unveiled Ernie Bot 4.0 and claimed that it is as powerful as OpenAI’s GPT-4. The company recently started to monetise the new chatbot by offering a 59.9 yuan (US$8.18) monthly subscription. At the X-Lake Forum, Li claimed that Ernie Bot’s application programming interface call volume has shown “exponential growth” since its August launch, which “exceeded the other 200 models in combination”. Baidu is currently incubating its own AI applications, such as the code-writing assistant Comate, Li said. Still, he asserted that the best AI-native applications have yet to be developed either in China or the US. “Just like in the [previous] era that gave birth to ‘mobile-native’ apps like WeChat, Douyin and Uber, in the AI era there will definitely be excellent AI-native applications developed based on these big models,” Li said. Post",
    "originSummary": [
      "Baidu CEO Robin Li expressed concern over the proliferation of large language models (LLMs) by Chinese tech companies, deeming it as a wasteful allocation of resources.",
      "Li claimed that there is a lack of focus on the development of AI-native applications in the industry.",
      "He urged the government and industry to prioritize initiatives that support the creation of AI-native applications, which he believes will contribute to economic growth."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700053676077
  },
  {
    "title": "Challenging Holiday Season Predicted for Consumer Tech Companies",
    "originLink": "https://www.marketwatch.com/story/the-grinch-may-steal-holiday-cheer-from-these-consumer-tech-companies-5208f26e",
    "originBody": "Home Industries Retail/Wholesale MarketWatch First Take MarketWatch First Take Opinion: The Grinch may steal holiday cheer from these consumer tech companies Published: Nov. 15, 2023 at 8:05 a.m. ET By Therese Poletti comments Some big tech companies are predicting a bleak holiday season. Courtesy Everett Collection Email icon Facebook icon Twitter icon Linkedin icon Flipboard icon Print icon Resize icon Referenced Symbols AAPL +1.43% ETSY +8.18% ABNB +6.32% EBAY +4.16% AMZN +2.25% MA +0.84% META +2.16% SNAP +7.52% HD +5.40% TSLA +6.12% The Grinch is expected to steal some holiday cheer for several consumer-focused tech companies, in what is normally their strongest quarter. This earnings season, investors were surprised by some grim forecasts of slower growth from a range of tech companies with big consumer businesses: Apple Inc. AAPL, +1.43%, Etsy Inc. ETSY, +8.18%, Airbnb Inc. ABNB, +6.32%, eBay Inc. EBAY, +4.16% and Amazon.com Inc. AMZN, +2.25%. Each of these companies, with the exception of Airbnb, usually posts their biggest revenue of the year in the December quarter, fueled largely by the holiday shopping season. But this year, consumers have continued to be more more nervous about spending, as inflation and higher interest rates are taking a toll on their wallets. Even with Tuesday’s positive news of flat inflation data for October and hopes that rate hikes are at an end, the interest rates that consumers will face for holiday purchases on credit cards are still high. Read also: The Magnificent Seven add more than $200 billion to their market caps. “From a customer-behavior standpoint, we still see customers remaining cautious about price, trading down where they can and seeking out deals, coupled with lower spending on discretionary items,” Amazon Chief Financial Officer Brian Olsavsky told analysts late last month. Amazon’s fourth-quarter revenue forecast came in lighter than Wall Street expected. Other online retailers, such as eBay and Etsy, also see slowing sales, with eBay pointing to emerging softness in some European markets, such as Germany and the U.K., and Etsy calling the macroeconomy “volatile.” Advertisement “There’s no doubt that this is an incredibly challenging environment for spending on consumer discretionary items,” said Etsy CEO Josh Silverman. “It’s therefore important to acknowledge that the volatile macro climate is going to make it challenging for us to grow this quarter.” In general, consumer demand or spending issues were the dominant disappointment of the quarter, while many enterprise-focused tech companies were buoyed by spending on artificial intelligence and building out their data centers to handle more processing of AI. “It was a better-than-expected earnings season, if you consider top-line beats, lots of the tech names surpassed on the top and bottom line,” said Christine Short, vice president of strategy at Wall Street Horizons. “It was the commentary that threw me off.” Apple surprised Wall Street with its lackluster forecast for the December quarter, guiding for a fiscal first quarter “similar” to its October quarter, in which revenue fell less than 1%. And that was for a quarter that included some new iPhone 15 sales. Its revenue could even potentially fall in the December quarter. Bernstein Research analyst Toni Sacconaghi said in a recent note that he is expecting a “muted iPhone cycle” this year, and is forecasting iPhone sales will be down 3.5% for the fiscal 2024 full year. This year’s holiday spending is expected to come close to last year’s results, according to a forecast issued by Circana, formerly the NPD Group, late last month. But the research firm added that overall spending may fall short by as much as 2.5% in the November-December timeframe. Additionally, a survey of 1,000 U.S. consumers by McKinsey & Co. showed 79% are changing behaviors, buying lower-cost items or foregoing purchases entirely. “General consumer sentiment about the U.S. economy is one of uncertainty,” the market-research firm said. Some credit-card companies are giving mixed signals. Last month, Mastercard MA, +0.84%, while highlighting “continued resilience in consumer spending” in the third quarter, also reported a sequential growth slowdown in October, rattling investors. The ongoing Israel-Hamas war is also fueling uncertainties. For advertisers on consumer internet platforms, such as Meta’s META, +2.16% Facebook, Instagram and Snap Inc. SNAP, +7.52%, the conflict is causing “greater uncertainties” and “volatility.” Meta warned of softer ad spending in the fourth quarter. As the large retailers report third-quarter results this week, investors will continue to focus on their forecasts, especially after Home Depot Inc. HD, +5.40% had a mixed call on Tuesday. Executives said that while the “worst of the inflationary environment may be behind us,” they still pointed to consumers staying away from certain “big-ticket items,” and working on smaller home projects, rather than taking on bigger costly ones. Electric-vehicle maker Tesla Inc. TSLA, +6.12% Chief Executive Elon Musk was uncharacteristically gloomy on the company’s most recent earnings call, talking about how he was worried about how the high-interest-rate environment would affect the car-buying public. Are all the cautious CEOs just sandbagging, and hoping to blow out their fourth quarters? Or at least exceed their “meh” expectations? “They are all trying to mange expectations, under-promise and over-deliver,” said Short of Wall Street Horizons. “You are seeing analysts draw down expectations for the fourth quarter.” She pointed out that in October, estimates came down 4%, versus the typical 1% to 2%. “This quarter, Q3, we have had the highest number of CEOs who were more uncertain than they have been since they were in the middle of the pandemic.” So while next year should look brighter — especially if the Fed begins to lower rates, as some are now predicting — this holiday season could be a bleak one for many consumer-focused tech companies. Advertisement Partner Center Most Popular Hedge-fund manager who called last year’s tech crash bets on Florida, oil drillers and this commodity Target’s stock soars toward best day in 4 years after big earnings beat Dow futures build on 2-month high amid signs of cooling inflation Pimco's bond chief says investors need to prepare for a hard landing This is the worst part of retirement Advertisement Advertisement Read Next Broadcom’s deal to buy VMware may be in jeopardy, but its soaring stock will be just fine As Broadcom and VMware get closer to the merger deadline of November 26, some investors are nervous that the deal will not get done. More On MarketWatch Amazon’s stock reaches a milestone not seen in 19 months Lauren Sanchez is ‘100 percent’ excited about ‘being Mrs. Bezos’ — and says it comes with ‘a lot of opportunities’ Barron's: These Stocks Moved the Most Today: Home Depot, Fisker, Tesla, Nvidia, Snap, VF Corp., and More Barron's: The Stock Market Is Soaring. Here’s How High the S&P 500 Could Go. About the Author Therese Poletti Therese Poletti writes the \"Tech Tales\" column for MarketWatch. Follow her on Twitter @tpoletti. ADVERTISEMENT ADVERTISEMENT",
    "originSummary": [
      "Consumer-focused tech companies like Apple, Etsy, Airbnb, eBay, and Amazon are anticipating a difficult holiday season with slower growth.",
      "Consumer hesitation in spending, caused by inflation and high interest rates, is contributing to slower sales for online retailers like eBay and Etsy, especially in European markets.",
      "A survey shows that many consumers are changing their buying behaviors, opting for lower-cost items or foregoing purchases entirely, and credit card companies are giving mixed signals with Mastercard reporting a growth slowdown in October."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700053676077
  },
  {
    "title": "Remote-Friendly Companies See Higher Revenue Growth, Study Finds",
    "originLink": "https://tech.co/news/remote-working-companies-revenue-growth",
    "originBody": "If greater productivity or happier, healthier employees isn’t enough to sway CEOs into the flexible remote working movement, this latest news may. A recent study by a technology startup has shown that the average public company, with a flexible remote working policy, outperformed on revenue growth over the past three years by 16 percentage points. This is in comparison to companies with return-to-office mandates. The analysis of remote working policies was done by Scoop, in partnership with the Boston Consulting Group, and looked at the work policies and revenue growth of 554 public companies. This comes following the recent successful results of Spain’s four-day working week trial, proving that flexible working provides lots of benefits for the employee, business, and our environment as a whole. Remote Working Works The report from Scoop, a technology developer that creates hybrid work planning tools, sought to compare the relationship between remote working policies and revenue growth. A link that, until now, had not been studied. The analysis looked at the revenue growth between 2020 and 2022 across a range of industries. This included technology, media, insurance, and financial services. From here it was found that fully flexible public companies significantly outperformed their peers in revenue growth by 16 percentage points. 🔎 Want to browse the web privately? 🌎 Or appear as if you're in another country? Get a huge 86% off Surfshark with this Tech.co Black Friday offer. More than that, structured hybrid companies – those who require their employees to be in the office for a certain amount of time or on certain days – also performed better on revenue growth in comparison to those who implement working in the office full time, by 13 percentage points. Companies in the data set with more restrictive policies, including set hours and days or full-time mandates, had only a 5% industry-adjusted revenue growth rate. On the 16 percentage point revenue growth, Rob Sadow, CEO and co-founder of Scoop, stated: “That gap was really surprising to us and larger than expected”. He went on to compare Scoop’s past research of work policies and employee-number growth and concluded that “collectively they paint a pretty strong picture” for the argument of flexible working. Flexibility Contributes to Office Culture The data isn’t suggesting that a remote working policy is the definitive cause behind revenue growth. Rather it’s a contributing factor showing that an open-minded business culture that engages workers with autonomy and trust, and listens to their needs, will naturally support growth. Add to this the fact that flexible remote working – and therefore fewer commutes – helps the environment and allows businesses to widen their employee talent pool search, and really CEOs start to become hard pressed to find the negatives. Sadow continued: “The argument a lot of execs and board members have is they believe companies that offer flexibility are going to underperform because they’re not together, that they’re not going to allow for water cooler conversations and relationships to develop. The data suggests not only is that not true in terms of underperformance, but you might actually outperform.” Younger Companies More Likely to be Flexible As well as the revenue growth correlation, the study identified a lot of interesting data that displayed the emerging shape of how we now work. While companies shouldn’t feel forced into being one way or the other, that is either fully remote or full time in the office, it’s clear that flexibility is continuing to grow more prevalent. This is due to figures showing that 38% of companies now require employees to be in the office full time, which is down from the 49% identified at the start of the year. Similarly, correlation between the age of a company and the likelihood of it offering flexible working was also found. The younger the company, the more likely it will offer flexible and remote options, no matter the size of the business or its industry. While on the topic of industries, Scoop also found that small companies; tech, media, and finance companies; and those with offices in the West and Northeast United States are all more likely to offer flexible working practices. So, if you’re in need of a career change to something with a little more flex, you now know where to look. Share this post facebook linkedin flipboard twitter-x whatsapp Did you find this article helpful? Click on one of the following buttons Yes No Tags BUSINESS TRENDS REMOTE WORKING Written by: Ellis Di Cataldo Writer Ellis Di Cataldo (MA) has over 9 years experience writing about, and for, some of the world’s biggest tech companies. She's been the lead writer across digital campaigns, always-on content and worldwide product launches, for global brands including Sony, Electrolux, Byrd, The Open University and Barclaycard. Her particular areas of interest are business trends, startup stories and product news.",
    "originSummary": [
      "Public companies with flexible remote working policies have experienced a 16 percentage point higher revenue growth over the past three years compared to those with return-to-office mandates.",
      "Companies with structured hybrid work policies that require some in-office time also perform better in terms of revenue growth than those with full-time office mandates.",
      "The study suggests that flexible working supports office culture, aids growth, benefits the environment, and attracts talent, particularly among younger companies and those in the technology, media, and finance industries."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700053676077
  },
  {
    "title": "Material Impact Raises $352 Million Fund to Support Deep Tech Startups",
    "originLink": "https://www.wsj.com/articles/material-impact-raises-352-million-fund-to-target-technical-startups-897cc66a",
    "originBody": "By Marc Vartabedian Nov. 15, 2023 6:00 am ET|WSJ PRO Share Resize Listen (2 min) Carmichael Roberts, left, and Adam Sharkawy, right, co-founders and managing partners of venture firm Material Impact. PHOTO: MATERIAL IMPACT Venture firm Material Impact said it has raised a $352 million fund to back companies developing so-called deep technology, which is focused on innovations in science and engineering. The Boston-based firm said its investment partners have science backgrounds, which will give them a leg up in a sector that is increasingly drawing interest from generalist investors. Copyright ©2023 Dow Jones & Company, Inc. All Rights Reserved. 87990cbe856818d5eddac44c7b1cdeb8 Exclusive venture capital news and commentary. Stay on top of deals, funds, people and the broader influences on the market. SIGN IN SUBSCRIBE",
    "originSummary": [
      "Material Impact has raised a $352 million fund to support companies focusing on deep technology advancements in science and engineering.",
      "The firm's investment partners, who have science backgrounds, are expected to have an edge in a sector that is drawing attention from generalist investors.",
      "This funding indicates the growing interest in deep technology and highlights the advantage of having expertise in the field when it comes to investing in these types of companies."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700053676077
  },
  {
    "title": "How Israeli Tech Founders Thrived During War: Lessons for Entrepreneurs Worldwide",
    "originLink": "https://www.forbes.com/sites/kalinabryant/2023/11/14/how-tech-founders-create-operational-resilience-while-navigating-war/",
    "originBody": "FORBESLEADERSHIPDIVERSITY, EQUITY & INCLUSION How Tech Founders Create Operational Resilience While Navigating War Kalina Bryant Contributor I empower, educate and improve equity for (BIPOC) women in tech. Nov 14, 2023,08:21pm EST Israeli Tech Founders Create Operational Resilience And Community While Navigating War GETTY In 2021, the Israeli tech ecosystem forged an indelible mark on the global stage, securing an extraordinary $27 billion in venture capital investments. This remarkable achievement, as reported by the Israel Innovation Authority, a government agency, not only shattered previous records but also defied the prevailing trends in venture capital funding. While the last two years witnessed a dip in VC funding for Israeli startups, echoing global patterns, the nation has demonstrated an unparalleled resilience and remains an unequivocal choice for technology investment. Amidst the challenges and uncertainties, Israeli companies stand as exemplars of operational resilience, showcasing an ability to not only weather storms but to thrive and redefine success in the dynamic landscape of the tech sector. Gal Biran, founder of Base.ai shares, the unwavering priority to ensure safety and wellbeing of his team is critical. Collaboratively, with the entire team, steps were taken to ensure minimal impact on customers and the business, epitomizing a dedication to operational resilience. Despite the uncertainties, Israeli companies emerge as exemplars of not just weathering storms, but thriving and redefining success in the dynamic tech landscape. This narrative echoes the deeper ethos that transcends business metrics—a testament to the resilience, humanity, and adaptability inherent in the Israeli tech sector. Navigating Through Adversity Israel's thriving tech sector, resilient through past crises like financial downturns and the Covid-19 pandemic, faces a unique challenge due to the recent war triggered by the Hamas assault. The conflict, resulting in over 1,300 casualties in Israel, has disrupted daily life, leading to the closure of schools, deserted streets in Tel Aviv, and numerous businesses shutting down. This time, the impact on the country's pivotal industry is distinctive, with closures attributed not only to security concerns but also to employees being called up for military service. The most immediate repercussion of the war on tech companies is evident in the workforce. Israel has mobilized over 300,000 military reservists to participate in the conflict, primarily individuals who were working and studying within the country, with a few returning from overseas. According to SNC's estimates, approximately 10% of tech personnel in Israel have been conscripted, and in certain companies, this figure has surged to as high as 30%. Despite the challenges of conflict, the industry remains a crucial lifeline, drawing unwavering support from seasoned investors dedicated to helping the nation rebuild. MORE FOR YOU Taylor Swift Is Inching Closer To A Billboard Chart Record No One Wants Student Loan Forgiveness Could Happen If You Graduated In These Years The MCU Is Now Reportedly Backing Away From Jonathan Majors Kang This solidarity is evident in the global tech community's response, with over 500 VC funds signing a \"Statement of Support\" for Israeli startups, entrepreneurs, and investors. Recognizing Israel's role in the global innovation ecosystem, the statement reflects a collective commitment to stand by the country and its people. Tech companies themselves have exemplified unity, setting aside differences with the government to contribute to the war effort. From procuring vital equipment for soldiers to leveraging expertise in AI and cybersecurity, the industry demonstrates a cohesive response in coming together. The Impact On Business—Becoming Resilient Through Change In the midst of navigating war, tech founders are exemplifying resilience in unprecedented ways. A poignant reflection comes from one CEO who encapsulates the essence of operational resilience while nurturing a thriving company. \"At the end of the day, we’re here to build a thriving company. And it becomes extremely harder in a time when every employee is affected by the atrocities we all experienced,\" says, Ittay Hayut, Co-founder & CEO of hoopo. In the face of adversity, these leaders recognize the paramount role they play in supporting their employees emotionally and caring for their wellbeing. Their unwavering commitment is clear: to maintain success, they must prioritize the people who make it all possible—their workforce. This commitment manifests in tangible ways, with CEO at hoopo, noting the humbling instances of employees rallying together. Whether it's witnessing acts of mutual assistance or the proactive stance of the US team, demanding more tasks to support their Israeli colleagues, the collective strength of the workforce stands out. \"I know we will keep innovating and creating value and change in the world while we stand strong – as a nation, in startups, and as individuals,” said Gal Biran, the CEO and Co-Founder of Base.ai, a MarTech company designed to deliver a designated customer marketing platform helping B2B organizations create personalized lifecycle engagement with their customer base at scale. Israeli startup raises $15 million for marketing customer-led growth vision BASE.AI Surprisingly, amidst the challenges, these tech companies are experiencing a surge in output that surpasses expectations. Both Gal Biran CEO and Co-Founder of Base.ai and Ittay Hayut, the Co-founder & CEO at hoopo attributes this to the team's resilience and determination to push forward, viewing it not just as a response to adversity but as a real triumph against terror. This narrative showcases a broader theme in the tech industry, where the spirit of unity and perseverance emerges as a powerful force against the backdrop of global challenges. Building Community And Driving Toward Organizational Change Many founders are standing at the forefront, navigating the intersection of innovation and operational resilience. Israeli founders are prioritizing the safety and wellbeing of their teams. In an interview, with a few Israeli tech founders, many highlighted the second level of action—creating operational resilience and business continuity—is integral to their strategic approach. With a global team, half of whom are based outside of Israel, Gal and his team have successfully minimized the impact on both customers and business operations. Talia Soen, the Co-Founder and CEO of Happy Things, took decisive action, embodying the transformative power of Israeli founders. When the devastating events of October 7th unfolded, Soen swiftly shifted her focus from startup operations to hands-on involvement in civil volunteering initiatives. The mission was clear: to actively contribute to the community's immediate needs, from purchasing food to assisting in shipping and aiding survivors' camps. Harnessing the unique capabilities of Happy Things—a mental health app—Soen and her team provided their product free of charge to all those in Israel, recognizing the profound impact of mental well-being during trying times. This proactive response reflected not only a commitment to their product but also a dedication to the broader societal fabric. In the face of frozen company processes—halted hiring, slowed recruitment, and paused development projects due to widespread military engagement—Soen acknowledged the mental toll reminiscent of the early pandemic days. Yet, undeterred, Happy Things pressed on, navigating the challenges with resilience reminiscent of Israel's national spirit. Fundraising, an inherently complex task for startups, assumed a unique dimension for Happy Things. Soen, unapologetically prefacing meetings with the stark reality of potential bomb alarms, showcased the grit and determination necessary for startups navigating uncharted territories. In this moment of adversity, the global tech community's outpouring of support provided a heartening backdrop, exemplifying the strength derived from a united network. The story of Happy Things underlines not only the challenges but also the unyielding spirit and collective resilience that define Israeli founders, showcasing that, even amid turmoil, their commitment to innovation and community remains unwavering. 5 Lessons To Embody From Israeli Tech Founders Operational Resilience: Israeli founders showcase the importance of operational resilience in the face of adversity. Being prepared for unforeseen challenges and having a flexible strategy allows a startup to navigate turbulent times with resilience. Community Engagement: Actively engaging with and supporting the community during times of crisis is a lesson from Israeli founders. Whether it's contributing to civil volunteering efforts or providing essential services, fostering a strong connection with the community enhances both social impact and company reputation. Prioritizing Mental Health: Talia Soen's example highlights the significance of prioritizing mental health. In the tech sector, where work can be demanding, acknowledging and addressing the mental well-being of employees is crucial for sustaining productivity and fostering a positive work culture. Adaptability and Innovation: The Israeli tech industry's ability to adapt and innovate, even amid challenging circumstances, provides a valuable lesson. Founders should cultivate a culture of adaptability, encouraging their teams to think creatively and pivot when necessary. Global Network and Solidarity: Building a global network and fostering a sense of solidarity within the tech community is essential. The support garnered by Israeli startups from international colleagues during times of crisis demonstrates the strength derived from a connected and supportive global network. Founders should actively cultivate relationships beyond borders to navigate challenges collectively. In conclusion, In the midst of adversity, these insights from Israeli founders illuminate the roadmap for tech entrepreneurs worldwide, demonstrating that in the relentless pursuit of innovation, operational resilience becomes not just a necessity but a transformative force, capable of steering companies through the storms of uncertainty with unwavering strength and purpose. Follow me on Twitter or LinkedIn. Check out my website. Kalina Bryant I am an award-winning trailblazer specializing in transforming the tech industry for over a decade. An African American change agent, I started my professional advocacy while ... Read More Editorial Standards Print Reprints & Permissions",
    "originSummary": [
      "Israeli tech founders have shown resilience and community support during the recent war, despite security concerns and military conscriptions.",
      "Over 500 VC funds have expressed solidarity with Israeli startups by signing a \"Statement of Support.\"",
      "Tech companies in Israel are prioritizing the well-being of their teams and witnessing increased productivity.",
      "Israeli founders stress the significance of operational resilience, community engagement, mental health prioritization, adaptability, innovation, and global networking and solidarity.",
      "These insights can guide tech entrepreneurs worldwide in navigating uncertainty with strength and purpose."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700053676077
  },
  {
    "title": "These 3 Mega-Cap Tech Companies Are Cash-Generating Machines",
    "originLink": "https://www.zacks.com/stock/news/2184260/these-3-mega-cap-tech-companies-are-cash-generating-machines",
    "originBody": "These 3 Mega-Cap Tech Companies Are Cash-Generating Machines Derek Lewis November 14, 2023 AAPL Quick QuoteAAPL MSFT Quick QuoteMSFT GOOGL Quick QuoteGOOGL Better trading starts here. What would you like to follow? Derek Lewis Stocks in the News Cancel",
    "originSummary": [
      "Apple, Microsoft, and Alphabet are recognized as strong cash-generating tech companies.",
      "The article emphasizes their overall ability to generate cash but lacks specific details or analysis.",
      "No further information is provided on the specific strengths or methods of cash generation for these companies."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700053676077
  },
  {
    "title": "Tampa Bay Tech Honors Companies and Executives at Annual Awards Event",
    "originLink": "https://stpetecatalyst.com/tampa-bay-tech-honors-companies-elevating-regions-success/",
    "originBody": "INNOVATE Tampa Bay Tech honors companies elevating region’s success Published 16 hours ago on November 14, 2023 By Veronica Brezina Tampa Bay Tech's 20th annual award ceremony at Armature Works in Tampa. All photos by Veronica Brezina. Tampa Bay’s ascension to being named among the top cities for tech jobs and HQ relocations is largely thanks to the cheerleaders behind business-building organizations and companies promoting the local pipeline of talent. Non-profit technology council Tampa Bay Tech recognized such companies and executives during its 20th annual awards event Nov. 10 at the Armature Works venue in Tampa, honoring winners across six award categories. Meet the winners: Technology Leader of the Year Awardee: Andrew McIntyre, senior vice president of technology and innovation at Vinik Sports Group: McIntyre oversees the information technology and video production of the group, which is the parent company of the Tampa Bay Lightning. Criteria: A C-level executive who has made a significant impact on their organization and the tech industry. Abacode COO Rolando Torres. Technology Company of the Year Awardee: Abacode Cybersecurity and Compliance: The company provides a fully managed cybersecurity and compliance platform, seamlessly integrating cyber defense with continuous compliance and third-party risk management. Criteria: A company that’s committed to advancing the tech community and demonstrates transformational excellence with its team, programs and/or projects. Samantha Ramos, founder and CEO at Tampa Bay Techies. Emerging Technology Leader of the Year Winner: Samantha Ramos, founder and CEO at Tampa Bay Techies, a 501 (c)(3) organization founded this year with the mission of connecting the area’s entrepreneurs and building networking opportunities. The organization initially started as an IT study group. Ramos currently serves as the Cyber Security Risk Manager at the Florida Cancer Specialists and Research Institute as a part of its cyber risk management team. Criteria: A leader, under 40 years of age, who has made a significant impact on their team, organization and/or in the tech community. Lazarillo CEO Rene Espinoza. Emerging Technology Company of the Year Winner: Lazarillo: The Chilean-founded startup helps the visually impaired community navigate destinations via an app that provides audio messages and alerts. The company launched a pilot program with the City of Tampa in December 2022. Criteria: A company that’s been in business for less than five years and is committed to advancing the tech community. An image of The Dream Tapestry by the Dalí Museum. Technology Project of the Year Winner: The Dream Tapestry by the Dalí Museum: Late last year, the museum launched an AI experience called the “Dream Tapestry.” Visitors follow prompts and reveal moments from their own recurring dreams. Every few minutes, the computer creates a “painting,” a tapestry weaving together interpretations of several visitor dreams. Criteria: A technology project developed and led by an in-house team in Tampa that created regional, national and/or international impact through industry disruption or a transformative effect within the organization. Michelle Bauer, COO of the Tampa Bay Economic Development Council. Photo: Tampa Bay Tech. Community Dedication and Leadership Award Winner: Michelle Bauer, COO of the Tampa Bay Economic Development Council, overseeing the operations. Bauer first joined the EDC as vice president of marketing and communications in 2014. Bauer was previously president and chief strategist at St. Petersburg-based communications and consulting firm Common Language. Today, she leads investor relations and is responsible for directing and marketing events and communicating with the research team. The passing of the torch: TBT’s next Chair Moments before the unveiling, Tampa Bay Tech’s board members took the opportunity to announce a major transition as Chair Ande Johnson will step down. Outgoing TBT Chair Ande Johnson gives her exit speech at the awards ceremony. Vice Chair Chris Karlo, who will step into her shoes, stands behind Johnson. “No matter what I’ve given to this organization, it does not equal what was given to me,” Johnson said onstage. “I have trusted partners, I’ve built lasting relationships with my clients, I found answers to my technology challenges, I found roles for people in my network. I found the smartest people and added them to my team.” Johnson is the managing director of digital experience Strategy and the director of operations for Accenture’s global IT organization. Although she is exiting her post and handing the torch to Vice Chair Chris Karlo, she said it’s not a true farewell as she plans to continue to be a prominent advocate of TBT. “I have no doubt the platform you [Johnson] put in place, your legacy will endure for the coming years,” Karlo said following Johnson’s speech. “I’ve been fortunate to call you a friend. As you step down as Chair, I have no doubt that you will continue to serve this organization and have your presence felt and keep that commitment to excellence that drives us all forward.” Incoming Chair Chris Karlo speaks at the podium. Karlo has over two decades of experience in business, strategy and technology consulting, according to his biography. He is currently an equity partner at MercuryWorks, a digital application and professional services firm focused on custom software development and data-driven solutions. Karlo said in the incoming year, the board has identified four key pillars to build Tampa’s business framework: Thought leadership, regional magnetism, tech advancement and career development. Email Share Tweet Share RELATED TOPICS: ABACODE AI CHRIS KARLO CYBERSECURITY IT LAZARILLO TAMPA BAY EDC TAMPA BAY TECH TAMPA BAY TECHIES THE DALI VINIK SPORTS GROUP CLICK TO COMMENT Subscribe to the Daily Spark Get the latest right to your phone Subscribe to the Daily Spark Get the latest right to your phone Subscribe YOU MAY LIKE St. Pete PR firm starts a new chapter St. Pete College’s new innovation hub to bridge workforce gap AI exec deploys app to help treat, diagnose pets",
    "originSummary": [
      "Tampa Bay Tech held its 20th annual awards event to recognize outstanding companies and individuals in the tech industry.",
      "The winners included Andrew McIntyre as Technology Leader of the Year, Abacode Cybersecurity and Compliance as Technology Company of the Year, Samantha Ramos as Emerging Technology Leader of the Year, Lazarillo as Emerging Technology Company of the Year, and The Dream Tapestry by the Dalí Museum as Technology Project of the Year.",
      "Michelle Bauer received the Community Dedication and Leadership Award, and Ande Johnson stepped down as Chair of Tampa Bay Tech, with Chris Karlo assuming the role."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700053676077
  },
  {
    "title": "Companies Urged to Update Risk-Management Frameworks for AI Procurement",
    "originLink": "https://news.bloomberglaw.com/legal-ops-and-tech/companies-should-ask-these-risk-questions-when-procuring-ai-tools",
    "originBody": "Parker Poe’s Sarah Hutchins, Debbie Edney, and Robert Botkin emphasize the importance of updating risk-management frameworks to reflect evolving best practices in AI procurement. As businesses increasingly consider artificial intelligence tools to augment, supplement, or replace a variety of functions, it’s crucial to update risk-management frameworks to reflect best procurement practices. Failing to do so can lead companies to adopt what seems like an AI panacea, but is actually a Pandora’s box of regulatory enforcement and litigation risks. Businesses should look to the World Economic Forum’s guidelines for adopting AI responsibly and consider the following questions when procuring AI tools. Do I Understand the Data? AI tools can seem complicated, but they’re only as robust as the data they’re trained on. Businesses should seek assurances from their AI vendors on collecting, using, and disclosing data used to train the model. Vendors should demonstrate they secured all the consent necessary when collecting data from consumers under applicable law. Businesses also should vet the AI tool’s data usage and training methods when onboarding it. And vendors should detail their governance programs, audits, and other mechanisms that ensure the tool’s usability, reliability, and potential for bias, inaccuracies, and unfairness. When inputting company data, businesses need to understand how the vendor will use that data for training purposes, and should think through the possible use cases for internal data that may or may not be uploaded. Finally, a company should understand the tool’s accessibility to company data, and ask whether the data could be collected and reviewed in litigation, if necessary. Have I Considered Regulatory Scrutiny? The Department of Justice, Federal Trade Commission, and other regulators are focused on whether technology companies and their tools create anti-competitive environments or put consumers at a disadvantage. Given the powerful insights AI tools can provide, regulators are concerned with the harm they may have on consumers. An AI tool could be used in marketing and pricing strategies to accurately predict a specific consumer’s spending capacity, for example. The business could then ensure every widget is sold at the highest price that each individual consumer is willing to pay. Regulators have also focused on how bias and inaccuracies in AI output disadvantage certain categories of consumers. AI tools can expand opportunity for anti-competitive market collaboration. Take an element of antitrust law that has long been settled: Companies can’t collude to set future prices but can share historical prices. If an AI tool combs through a massive volume of competitors’ historical price data, “the distinctions between past and current or aggregated versus disaggregated data may be eroded,” Principal Deputy Assistant Attorney General Doha Mekki warned this year. “Where competitors adopt the same pricing algorithms, our concern is only heightened.” By thinking how the data sources could cross a line concerning competitive information, businesses can proactively navigate evolving regulatory risks. Have I Mitigated Security Risks? Cyberattacks on AI vendors have \" potential to impact the integrity of the AI model’s decisions and predictions,” World Economic Forum’s guidelines say. Data duplicated into an AI tool is vulnerable to access by a bad actor, and companies should exercise caution when inputting personally identifiable information. Depending how the tools are integrated, they could create a new back door to company systems. This is particularly true for AI tools that “crawl” through systems looking for places to create efficiencies and where AI tools can make certain fetch or “get” requests for data. It is essential to understanding the vendor’s cybersecurity defenses, including what proactive steps it takes to detect attacks and how its incident response plan would minimize the effects of a breach. Did I Include Best Practices in the Contract? Businesses should ensure they have appropriate clauses in contracts with AI vendors to address usage of provided data, data retention and destruction, intellectual property rights, security breaches, and other standard contractual clauses. Special security measures should be in place for certain categories of data, such as limiting or encrypting data based on personal information that implicates data privacy regulations. Additionally, World Economic Forum guidelines suggest including a compliance statement in master service agreements, such as the Responsible Artificial Intelligence Institute certification, which aligns with current AI regulations and principles. The guidelines also suggest businesses develop their own key performance indicators. Businesses should further consider whether policies providing guidance to employees on proper use are warranted. AI is rapidly changing how the world does business. To maximize the promise of AI while minimizing its risks, companies should be diligent in the proactive assessment of AI tools and protect themselves through each contract. This article does not necessarily reflect the opinion of Bloomberg Industry Group, Inc., the publisher of Bloomberg Law and Bloomberg Tax, or its owners. Author Information Sarah Hutchins is partner at Parker Poe and leads the firm’s cybersecurity and data privacy team. Debbie Edney is counsel at Parker Poe and has experience representing corporate, financial, and individual clients in all aspects of complex commercial litigation. Robert Botkin is an associate at Parker Poe and helps clients navigate data privacy and security issues across industries. Write for Us: Author Guidelines Continue Reading Learn About Bloomberg Law AI-powered legal analytics, workflow tools and premium legal & business news. Learn more Already a subscriber? Log in to keep reading or access research tools. Log In",
    "originSummary": [
      "The article emphasizes the importance of updating risk-management frameworks for AI procurement to avoid regulatory enforcement and litigation risks.",
      "Businesses should consider questions related to data understanding, regulatory scrutiny, security risks, and contract best practices when procuring AI tools.",
      "The article advises companies to assess AI tools diligently and protect themselves through each contract by including appropriate contractual clauses."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700053676077
  }
]
