[
  {
    "title": "First-ever C-UAS Forum Draws Hundreds of Attendees in Oklahoma",
    "originLink": "https://www.swoknews.com/community_news/counter-unmanned-aerial-systems-forum-held/article_1eee7017-6b20-5f35-be4e-eb5d472234de.html",
    "originBody": "",
    "originSummary": [
      "The Fires Innovation Science and Technology Accelerator (FISTA) Innovation Park, in partnership with the U.S. Army Air Defense Artillery Association, organized the first-ever Counter Unmanned Aerial Systems (C-UAS) Forum in Lawton, Oklahoma.",
      "The event drew a crowd of approximately 400 participants, including representatives from the U.S. Army, elected officials, industry experts, and key stakeholders.",
      "The forum aimed to address the challenges posed by unmanned aerial systems and explore innovative solutions in countering them."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700143790108
  },
  {
    "title": "Pentagon's counter-drone office advances with new technology acquisition",
    "originLink": "https://www.c4isrnet.com/unmanned/2023/11/15/pentagon-counter-drone-office-makes-headway-as-services-adopt-new-tech/",
    "originBody": "",
    "originSummary": [
      "The Pentagon's counter-drone office is acquiring new technologies to combat drone threats, based on successful evaluations and demonstrations.",
      "Multiple demonstrations have been conducted to address various drone threats, with vendors identified for low-collateral interceptors.",
      "A final fly-off will be conducted to select recommended vendors, and the office plans to transition laser weapons from development to procurement. However, there is a recommendation for modifications to the office's authorities and coordination with service acquisition agencies."
    ],
    "commentBody": "",
    "commentSummary": ["The post does not contain a meaningful summary or key information."],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700143790108
  },
  {
    "title": "EDGE Receives Order for 100 REACH-S Unmanned Aircraft from UAE Ministry of Defence",
    "originLink": "https://www.edrmagazine.eu/edge-receives-order-from-the-uae-ministry-of-defence-for-100-reach-s-unmanned-aircraft",
    "originBody": "",
    "originSummary": [
      "EDGE, a technology and defense group, has secured a major order from the UAE Ministry of Defence for 100 locally-manufactured REACH-S fixed-wing unmanned aircraft.",
      "The order, announced at the Dubai Airshow, signifies a significant achievement for EDGE and will equip the UAE Armed Forces with a cost-effective, 24-hour intelligence, surveillance, and reconnaissance capability.",
      "The REACH-S offers autonomous take-off and landing, an electro-optical sensor, and the ability to fly up to 200km away from the Ground Control Station. The development and production of the REACH-S are overseen by ADVANCED CONCEPTS and ADASI, which are part of the EDGE Group."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700143790108
  },
  {
    "title": "ECITB drone course enhances safety and efficiency of Sellafield inspections",
    "originLink": "https://www.suasnews.com/2023/11/ecitb-drone-course-helps-make-sellafield-inspections-safer-and-faster/",
    "originBody": "",
    "originSummary": [
      "Sellafield, a nuclear facility in Cumbria, has become the first group to complete the ECITB's new UAS training course for industrial settings.",
      "The week-long course, provided by Global Drone Training, covered theoretical knowledge and practical flying to ensure safe operation in industrial environments.",
      "Sellafield expects that the training will lead to safer and faster inspections, as well as time savings on internal assessments."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700143790108
  },
  {
    "title": "Elistair Unveils KHRONOS: Tethered Drone System for Surveillance in Challenging Environments",
    "originLink": "https://uasmagazine.com/articles/3129/elistair-unveils-khronos-push-button-tethered-drone",
    "originBody": "",
    "originSummary": [
      "Elistair has introduced KHRONOS, a tethered drone system for intelligence, surveillance, and reconnaissance missions in difficult conditions.",
      "The drone can be deployed quickly and operated with limited human involvement, offering a prolonged aerial perspective over a 10-kilometer area for 24 hours.",
      "The system is rugged and capable of functioning in GPS/GNSS-denied and RF-denied environments.",
      "Elistair is set to deliver the initial KHRONOS systems to customers in January 2024."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700143790108
  },
  {
    "title": "University of Arkansas Seeks Assistant Professor of Geography with Geographic Data Science Expertise",
    "originLink": "https://jobs.chronicle.com/job/37562879/assistant-professor-of-geography/",
    "originBody": "",
    "originSummary": [
      "The University of Arkansas is hiring an Assistant Professor of Geography, starting in August 2024.",
      "The successful candidate should have knowledge in geospatial data science and field-based research using modern methods such as unmanned aircraft systems, photogrammetry, and geographic information systems.",
      "They should also have expertise in areas such as land-change dynamics, physical geography, and human-environment interactions. They will be expected to develop an independent research program, teach courses in their field, and collaborate with other departments and centers.",
      "The position offers a competitive salary and benefits package.",
      "Applications will be accepted until January 2, 2024.",
      "The University of Arkansas is an affirmative action/equal opportunity employer committed to diversity."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700143790108
  },
  {
    "title": "EDGE Expands Global VTOL Capabilities with First Major Sale of HT-100 Unmanned Helicopters",
    "originLink": "https://www.edrmagazine.eu/edge-expands-global-vtol-capabilities-with-first-major-sale-of-ht-100-unmanned-helicopters",
    "originBody": "",
    "originSummary": [
      "ADSB, a subsidiary of the EDGE Group, has acquired HT-100 unmanned helicopters from ANAVIA to install on its vessels, as part of their plan to establish themselves as a leading player in autonomous air systems.",
      "The HT-100 drones have a flight duration of up to six hours and can be utilized for different applications.",
      "This acquisition marks the first significant international order for the HT-100 unmanned helicopter."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700143790108
  },
  {
    "title": "EDGE Group's ADASI secures AED 239 million contract to provide unmanned aerial systems to Ministry of Defence",
    "originLink": "https://www.zawya.com/en/press-release/companies-news/edge-awarded-aed-239mln-contract-to-supply-unmanned-aerial-systems-to-the-ministry-of-defence-dbhtopty",
    "originBody": "",
    "originSummary": [
      "The EDGE Group entity ADASI has secured a contract worth AED 239 million to provide unmanned aerial systems (UAS) to the Ministry of Defence.",
      "The contract includes integrated logistics support, training, and spare parts management.",
      "The GARMOOSHA UAS is specifically designed for advanced air operations, with a payload capacity of 120kg, an endurance of 8 hours, and a range of 150km."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700143790108
  }
]
