[
  {
    "id": 37848212,
    "title": "स्टारलिंक सेल के लिए सीधा",
    "originLink": "https://direct.starlink.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37848212",
    "commentBody": "",
    "originSummary": [
      "स्पेसएक्स का एक डिवीजन स्टारलिंक एक डायरेक्ट टू सेल फीचर लॉन्च कर रहा है जो वैश्विक एलटीई फोन को टेक्स्ट, वॉयस और डेटा सेवाओं तक निर्बाध पहुंच प्रदान करेगा।",
      "अंतरिक्ष-आधारित सेलफोन टावरों के रूप में काम करने वाली नई तकनीक, दूरस्थ स्थानों में कनेक्टिविटी की अनुमति देती है और मौजूदा हार्डवेयर या ऐप्स में संशोधन की आवश्यकता के बिना मृत क्षेत्रों को हटा देती है।",
      "रॉकेट निर्माण और प्रक्षेपण में स्पेसएक्स के ज्ञान का लाभ उठाते हुए, स्टारलिंक का उद्देश्य बड़ी संख्या में इन सेल-सेवा-सहायक उपग्रहों को तैनात करना है, जिसमें वैश्विक सेलुलर प्रदाता भागीदार देशों में नेटवर्क पहुंच साझा करते हैं।"
    ],
    "commentSummary": [
      "चर्चा ओं में दूरदराज के क्षेत्रों में उपग्रह संचार लाभ, अत्यधिक तापमान में स्मार्टफोन का उपयोग करने की चुनौतियां, और कम बैंडविड्थ स्थितियों में मैसेजिंग ऐप से लेकर जंगल में सुरक्षा के लिए फोन पर समर्पित उपकरणों की खूबियों तक शामिल हैं।",
      "प्रमुख फोकस दूरस्थ क्षेत्रों में स्टारलिंक डायरेक्ट टू सेल और स्टारलिंक के संभावित लाभ, ऐप्पल और गूगल जैसी कंपनियों के साथ सहयोग, साथ ही उपग्रह सेवाओं से संबंधित मूल्य निर्धारण, नियामक और लाइसेंसिंग मुद्दे हैं।",
      "वे व्यक्तिगत लोकेटर बीकन (पीएलबी) जैसे आपातकालीन संचार उपकरणों पर भी विचार करते हैं, और विभिन्न उपग्रह नेटवर्क के फायदे और सीमाओं की तुलना करते हैं। व्यक्तिगत अनुभव व्यावहारिक संदर्भ प्रदान करते हैं।"
    ],
    "points": 657,
    "commentCount": 482,
    "retryCount": 0,
    "time": 1697048280
  },
  {
    "id": 37850930,
    "title": "स्थायी विकलांगता वाले अमेरिकी नागरिकों को राष्ट्रीय उद्यानों के लिए मुफ्त आजीवन पास मिलता है",
    "originLink": "https://www.nps.gov/subjects/accessibility/interagency-access-pass.htm",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37850930",
    "commentBody": "",
    "originSummary": [
      "द अमेरिका द ब्यूटीफुल - द नेशनल पार्क एंड फेडरल रिक्रिएशनल लैंड्स एक्सेस पास, अमेरिकी नागरिकों या स्थायी विकलांगता वाले स्थायी निवासियों के लिए उपलब्ध एक मुफ्त पास, व्यक्तिगत रूप से या ऑनलाइन प्राप्त किया जा सकता है।",
      "आवेदकों को पास प्राप्त करने के लिए अपनी स्थायी विकलांगता को प्रमाणित करने वाले दस्तावेज प्रस्तुत करने होंगे।",
      "इंटरएजेंसी एक्सेस पास विकलांग लोगों को राष्ट्रीय उद्यानों और संघीय मनोरंजक भूमि तक आसान पहुंच प्रदान करके सहायता करता है।"
    ],
    "commentSummary": [
      "चर्चाओं में विकलांग व्यक्तियों द्वारा अनुभव की जाने वाली कठिनाइयों, विकलांगता के रूप में एडीएचडी के पुनर्मूल्यांकन और समाज में विकलांगता की व्यापक समझ और धारणा सहित कई विषयों को शामिल किया गया है।",
      "यह स्वास्थ्य देखभाल, आवास और व्यक्तियों के जीवन पर एडीएचडी के प्रभावों से संबंधित मामलों को भी संबोधित करता है।",
      "बातचीत विभिन्न प्रकार के विचारों और दृष्टिकोणों को व्यक्त करती है।"
    ],
    "points": 402,
    "commentCount": 278,
    "retryCount": 0,
    "time": 1697062093
  },
  {
    "id": 37854846,
    "title": "आधुनिक सांख्यिकी का परिचय",
    "originLink": "https://openintro-ims2.netlify.app/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37854846",
    "commentBody": "",
    "originSummary": [
      "\"आधुनिक सांख्यिकी का परिचय (दूसरा संस्करण)\" एक पाठ्यपुस्तक है जिसे माइन केटिंकाया-रुंडेल और जोहाना हार्डिन द्वारा लिखा गया है, जो डीज़, बार और केटिंकाया-रुंडेल के पिछले संस्करणों से लिया गया है।",
      "पुस्तक मुफ्त डाउनलोड के लिए उपलब्ध है, जो छात्रों और उत्साही लोगों को समान रूप से सस्ती शैक्षिक सामग्री तक पहुंच प्रदान करती है।",
      "पुस्तक को क्रिएटिव कॉमन्स एट्रिब्यूशन-शेयरअलाइक 3.0 के तहत लाइसेंस प्राप्त है, जो काम के वितरण और साझाकरण की अनुमति देता है और प्रोत्साहित करता है।"
    ],
    "commentSummary": [
      "पोस्ट में आधुनिक सांख्यिकी और सॉफ्टवेयर के अनुप्रयोग पर चर्चा की गई है जिसे जेएएसपी कहा जाता है ताकि लगातार और बायेसियन विधियों की तुलना की जा सके, जो डेटा की व्याख्या करने के लिए सांख्यिकीय दृष्टिकोण हैं।",
      "लेखक सांख्यिकी शिक्षा में रैखिक मॉडल और बायेसियन तकनीकों के उपयोग की ओर एक बदलाव की वकालत करता है, जो वर्तमान शिक्षण विधियों में परिवर्तन की आवश्यकता का सुझाव देता है।",
      "चर्चा में गणित के साथ व्यक्तिगत संघर्ष, इसके प्रति संभावित नकारात्मक दृष्टिकोण, और सांख्यिकी सीखने के लिए पुस्तक सिफारिशें शामिल हैं, विशेष रूप से कार्लसन एंड विनक्विस्ट द्वारा \"सांख्यिकी\" पर प्रकाश डाला गया है। टिप्पणीकार बायेसियन नेटवर्क फ्रेमवर्क के आवेदन और आर प्रोग्रामिंग भाषा के उपयोग के बारे में अधिक जानने में रुचि रखते हैं।"
    ],
    "points": 337,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1697100310
  },
  {
    "id": 37846471,
    "title": "कानूनी रूप से हर फ़ॉन्ट को पायरेट कैसे करें",
    "originLink": "https://blog.willdepue.com/how-to-legally-pirate-all-fonts-in-an-afternoon",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37846471",
    "commentBody": "",
    "originSummary": [
      "यह विषय वेब पर बिना लाइसेंस वाले फोंट की कॉपीराइट वैधता के आसपास घूमता है, जहां अमेरिकी कानून व्यक्तिगत ग्लिफ़ ्स के कॉपीराइट की अनुमति नहीं देता है लेकिन फ़ॉन्ट फ़ाइल को कॉपीराइट करने की अनुमति देता है।",
      "ट्रेडमार्क किए गए फोंट कानून के तहत संरक्षित हैं, जबकि गैर-ट्रेडमार्क ग्लिफ़ कॉपीराइट के लिए अतिसंवेदनशील नहीं हैं।",
      "लेखक लाइसेंस प्राप्त फोंट को फिर से बनाने के लिए सार्वजनिक, गैर-रचनात्मक, गैर-ट्रेडमार्क फोंट का उपयोग करने पर विचार करता है, इस तरह के प्रयास की जटिलता को पहचानता है, और कानूनी रूप से फोंट खरीदकर फ़ॉन्ट रचनाकारों का समर्थन करने के महत्व पर जोर देता है।"
    ],
    "commentSummary": [
      "इस चर्चा का केंद्रीय विषय फोंट से संबंधित कॉपीराइट मुद्दे और उन्हें पीटने का बाद का अभ्यास है।",
      "यह फ़ॉन्ट दोहराव की वैधता में प्रवेश करता है, और कॉपीराइट संभावित रूप से रचनात्मकता और रचनात्मक कार्यों की पहुंच को कैसे प्रभावित करता है।",
      "यह फ़ॉन्ट लाइसेंसिंग की जटिलताओं और कॉपीराइट कानूनों के तहत फ़ॉन्ट को दी जाने वाली सुरक्षा की सीमा की भी जांच करता है।"
    ],
    "points": 315,
    "commentCount": 139,
    "retryCount": 0,
    "time": 1697041266
  },
  {
    "id": 37847454,
    "title": "Google क्लाउड स्पैनर अब Amazon DynamoDB की लागत का आधा है",
    "originLink": "https://cloud.google.com/blog/products/databases/announcing-cloud-spanner-price-performance-updates",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37847454",
    "commentBody": "",
    "originSummary": [
      "Google Cloud ने अपने क्लाउड स्पैनर डेटाबेस में प्रमुख मूल्य-प्रदर्शन संवर्द्धन पेश किए हैं जिसमें बिना किसी अतिरिक्त लागत के प्रति नोड 50% तक अधिक थ्रूपुट और 2.5 गुना अधिक स्टोरेज शामिल है।",
      "उच्च प्रदर्शन, उपलब्धता और स्केलेबिलिटी के लिए प्रसिद्ध अपडेटेड क्लाउड स्पैनर, अब बड़े डेटा वॉल्यूम और एप्लिकेशन आवश्यकताओं को संभालने वाले संगठनों के लिए और भी अधिक लागत-इष्टतम समाधान बन जाता है।",
      "तुलनात्मक रूप से, स्पैनर अब अमेज़ॅन डायनेमोडीबी की तुलना में अधिक लागत प्रभावी है। ये अपडेट वर्तमान में कुछ इंस्टेंस कॉन्फ़िगरेशन के लिए उपलब्ध हैं, निकट भविष्य में सभी स्पैनर ग्राहकों के लिए एक पूर्ण रोलआउट की योजना है।"
    ],
    "commentSummary": [
      "चर्चा मुख्य रूप से क्लाउड सेवा प्रदाताओं के आसपास केंद्रित है, विशेष रूप से मूल्य निर्धारण और उपयोगकर्ता अनुभव जैसे पहलुओं पर गूगल क्लाउड स्पैनर और अमेज़ॅन डायनामोडीबी के विपरीत।",
      "अन्य चर्चा किए गए विषयों में समर्थन और विश्वसनीयता के मुद्दे, विशेष अनुप्रयोगों के लिए विभिन्न डेटाबेस की उपयुक्तता, सर्वरलेस कंप्यूटिंग का उपयोग और विशेष डेटाबेस का अनुप्रयोग शामिल है।",
      "क्लाउड सेवा उद्योग के भीतर विक्रेता लॉक-इन और मूल्य निर्धारण स्थिरता पर एक स्पष्ट चिंता है, जो उपयोगकर्ताओं के अनुभवों और राय को दर्शाती है।"
    ],
    "points": 299,
    "commentCount": 347,
    "retryCount": 0,
    "time": 1697045140
  },
  {
    "id": 37850265,
    "title": "ग्राइंड - अमिगा 500 के लिए एक पहला व्यक्ति शूटर",
    "originLink": "https://www.indieretronews.com/2023/10/grind-first-person-shooter-for-amiga.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37850265",
    "commentBody": "",
    "originSummary": [
      "ग्राइंड अमिगा 500 के लिए एक अद्यतन प्रथम-व्यक्ति शूटर गेम है, जिसे ड्रेड-इंजन के साथ विकसित किया गया है। यह एक स्टीमपंक / लवक्राफ्टियन सौंदर्य शास्त्र के आसपास बनाया गया है और इसमें उच्च गुणवत्ता वाले हथियार डिजाइन हैं।",
      "नवीनतम अपडेट में एक डेमो और एक शहर में एक नया स्तर सेट शामिल है, जिसमें अतिरिक्त स्तरों और दुश्मन प्रकारों के लिए भविष्य की विकास योजनाएं हैं।",
      "संगीत समर्थन, ध्वनि प्रभाव, और अधिक स्तर वर्तमान में प्रगति पर हैं, जो एक Patreon द्वारा समर्थित हैं। इसके अतिरिक्त, खेल का एक मेगा ड्राइव संस्करण वर्तमान में विचाराधीन है।"
    ],
    "commentSummary": [
      "पोस्ट का केंद्र बिंदु अमिगा 500 के लिए गेम \"ग्रिंड\" है, जिसे बिटमैप ब्रदर्स के काम को याद करते हुए इसकी सावधानीपूर्वक डिटेलिंग और असाधारण 3 डी ग्राफिक्स के लिए सराहा गया है।",
      "बातचीत में 3 डी गेमिंग के प्रति सेगा की रणनीति और वीडियो गेम कंसोल पर इसके प्रभाव को शामिल किया गया है।",
      "अन्य विषयों में अमिगा 500 की बाधाएं और क्षमता, अनुकूलन के डेवलपर के प्रयास और अन्य गेमिंग प्लेटफार्मों के साथ तुलना शामिल है, जिसमें कई उपयोगकर्ताओं ने शुरुआती संदेह के बावजूद अमिगा 500 पर गेम के प्रदर्शन के लिए अपनी प्रशंसा व्यक्त की है।"
    ],
    "points": 292,
    "commentCount": 120,
    "retryCount": 0,
    "time": 1697058404
  },
  {
    "id": 37847782,
    "title": "Wordpress.com अब ActivityPub का समर्थन करता है",
    "originLink": "https://wordpress.com/blog/2023/10/11/activitypub/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37847782",
    "commentBody": "",
    "originSummary": [
      "WordPress.com ने एक्टिविटीपब फीचर लॉन्च किया है, जिससे उपयोगकर्ता अपने ब्लॉग को व्यापक दर्शकों तक पहुंचने के लिए मास्टोडॉन जैसे फेडरेटेड प्लेटफॉर्म से लिंक कर सकते हैं।",
      "ActivityPub प्लगइन सहज एकीकरण में सहायता करता है, जिससे पाठकों को ब्लॉग पोस्ट का पालन करने और ब्लॉग पर टिप्पणियों में उत्तरों को बदलने में सक्षम बनाता है।",
      "उपयोगकर्ता एक कस्टम डोमेन के साथ अपनी प्रोफाइल को बढ़ा सकते हैं और इस सुविधा को अपनी ब्लॉग सेटिंग्स के माध्यम से सक्रिय कर सकते हैं, जो जुड़ाव को बढ़ावा देने और WordPress.com ब्लॉगों तक पहुंचने का इरादा रखते हैं।"
    ],
    "commentSummary": [
      "WordPress.com ने एक्टिविटीपब, एक विकेन्द्रीकृत सोशल नेटवर्किंग प्रोटोकॉल को एकीकृत किया है, जो उपयोगकर्ताओं को विविध सामग्री प्रकाशित करने और साझा करने में सक्षम बनाता है।",
      "यह कदम विकेंद्रीकृत सोशल मीडिया आंदोलन के लिए अपने व्यापक उपयोगकर्ता आधार पहुंच प्रदान करता है, हालांकि कुछ उपयोगकर्ता मॉडरेशन और उपयोगकर्ता इंटरफ़ेस (यूआई) में विसंगतियों पर चिंता व्यक्त करते हैं।",
      "WordPress.com के बीच अंतर पर ध्यान दें, जिसने इन परिवर्तनों को लागू किया, और वर्डप्रेस के ओपन-सोर्स पुनरावृत्ति।"
    ],
    "points": 252,
    "commentCount": 48,
    "retryCount": 0,
    "time": 1697046443
  },
  {
    "id": 37848793,
    "title": "अनिवार्य - स्व-होस्टर्स के लिए एक ओपनआईडी कनेक्ट सर्वर",
    "originLink": "https://github.com/anderspitman/obligator",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37848793",
    "commentBody": "",
    "originSummary": [
      "\"अनिवार्य\" एक ओपनआईडी कनेक्ट प्रदाता (ओपी) सर्वर विकसित करने वाली एक परियोजना है, जिसे ईमेल स्वामित्व को मान्य करने और उपयोगकर्ता द्वारा एक्सेस किए जा रहे एप्लिकेशन को संवाद करने के विशिष्ट लक्ष्य के साथ स्व-होस्टिंग के लिए डिज़ाइन किया गया है।",
      "यह परियोजना अनाम OAuth2 क्लाइंट, बहु-डोमेन प्रमाणीकरण, पासवर्ड रहित ईमेल लॉगिन और एपीआई के माध्यम से कॉन्फ़िगर करने योग्य रनटाइम जैसी सुविधाओं का समर्थन करती है।",
      "वर्तमान में, परियोजना बीटा में है और उत्पादन उपयोग के लिए उपयुक्त नहीं है जब तक कि यह सुरक्षा समीक्षा पारित नहीं करता है।"
    ],
    "commentSummary": [
      "पोस्ट अनिवार्य के बारे में है, एक ओपनआईडी कनेक्ट सर्वर जो स्व-होस्टिंग उद्देश्यों के लिए तैयार किया गया है।",
      "चर्चाओं में वैकल्पिक प्रमाणीकरण सेवाओं जैसे Zitadel, Authentik और Keycloak को शामिल करने के लिए विस्तार किया गया है, जिसमें ईमेल और सामाजिक लॉगिन विकल्पों के साथ मुद्दों सहित उनकी चुनौतियों और सीमाओं पर प्रकाश डाला गया है।",
      "ओरी स्टैक और हाइड्रा, क्रेटोस और ओथकीपर जैसे अन्य लोगों का संदर्भ है, उनके सुरक्षा उपायों और उपयोगकर्ता इंटरफ़ेस पहलुओं के बारे में चल रही बहस के साथ।"
    ],
    "points": 241,
    "commentCount": 87,
    "retryCount": 0,
    "time": 1697050760
  },
  {
    "id": 37850485,
    "title": "अपने स्वयं के ऑल-स्काई, रास्पबेरी पाई कैमरा रोल करें",
    "originLink": "https://spectrum.ieee.org/all-sky-camera",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37850485",
    "commentBody": "",
    "originSummary": [
      "लेख रास्पबेरी पाई का उपयोग करके डू-इट-योरसेल्फ (DIY) ऑल-स्काई कैमरा बनाने के तरीके को रेखांकित करता है, जो छोटे और किफायती कंप्यूटरों की एक श्रृंखला है जो तकनीकी परियोजनाओं में व्यापक रूप से उपयोग किए जाते हैं।",
      "होममेड कैमरा का उद्देश्य पूरी रात के आकाश, विशेष रूप से उल्काओं की छवियों को कैप्चर करना है, और उल्का प्रक्षेप पथ के बारे में वैज्ञानिक अध्ययन में सहायता कर सकता है।",
      "यह आवश्यक घटकों और कैमरा स्थापित करने की प्रक्रिया पर एक गहन मार्गदर्शिका प्रदान करता है और उल्का अध्ययन के लिए ऐसे कैमरों का उपयोग करके अन्य समान परियोजनाओं को भी पेश करता है।"
    ],
    "commentSummary": [
      "यह लेख ऑल-स्काई फोटोग्राफी के लिए रास्पबेरी पाई कैमरों का उपयोग करने वाले उपयोगकर्ताओं के अनुभव और सलाह पर प्रकाश डालता है, कैमरा गुंबद स्क्रैच, मैनुअल फोकस कैमरों पर तापमान प्रभाव जैसी विशिष्ट चिंताओं को संबोधित करता है, और बेहतर लंबे समय तक एक्सपोजर तस्वीरों के लिए ठंडे मौसम का लाभ उठाता है।",
      "पाठक रास्पबेरी पाई से उच्च गुणवत्ता वाले कैमरों के लिए लालसा व्यक्त करते हैं, एक्सपोज़र समय, सेंसर आकार, कम रोशनी प्रदर्शन, संभावित सूर्य क्षति, और मुख्य रूप से खगोल विज्ञान और इसी तरह की परियोजनाओं में रास्पबेरी पाई एचक्यू कैमरा की सीमाओं और गुणवत्ता जैसी बारीकियों पर चर्चा करते हैं।",
      "बातचीत एमआईपीआई कैमरों की सीमाओं को स्वीकार करती है और उच्च गुणवत्ता वाली इमेजरी के लिए प्रकाशिकी की महत्वपूर्ण भूमिका पर जोर देती है; कुछ उपयोगकर्ता बेहतर गुणवत्ता और प्रकाश संवेदनशीलता के साथ वैकल्पिक कैमरों की सलाह देते हैं।"
    ],
    "points": 238,
    "commentCount": 46,
    "retryCount": 0,
    "time": 1697059735
  },
  {
    "id": 37846387,
    "title": "एम 2 अल्ट्रा समानांतर में लामा 2 7 बी की 128 धाराओं को चला सकता है",
    "originLink": "https://github.com/ggerganov/llama.cpp/pull/3228",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37846387",
    "commentBody": "",
    "originSummary": [
      "गिटहब रिपॉजिटरी में लामा .cpp कोड को अपडेट किया गया है, जिसमें कोड की दक्षता बढ़ाने के लिए ध्यान मास्क के साथ समानांतर डिकोडिंग शामिल है।",
      "संशोधनों में केवी कैश अनुकूलन, बहु-अनुक्रम डिकोडिंग, और आरओपीई के अपडेट, सत्र बचत / लोडिंग, साथ ही समानांतर प्रसंस्करण के माध्यम से प्रदर्शन में सुधार शामिल है।",
      "परिवर्तनों में एम 2 अल्ट्रा मॉडल आकार परीक्षणों में ग्राफ टोपोलॉजी संशोधनों और अनुकूलन के लिए कॉन्करेंसी अनुकूलन को अक्षम करना भी शामिल है।"
    ],
    "commentSummary": [
      "चर्चा ऐप्पल के नए एम 2 अल्ट्रा चिप की विशेषताओं की जांच करती है और ऑन-प्रिमाइसेस बुनियादी ढांचे के विपरीत क्लाउड सेवाओं का उपयोग करने के गुणों और दोषों का विश्लेषण करती है।",
      "यह स्व-होस्टिंग सेवाओं बनाम उन्हें आउटसोर्स करने के फायदे और नुकसान पर भी बहस करता है और डेटा केंद्रों में ऐप्पल मैक मिनिस के संभावित उपयोग की पड़ताल करता है।",
      "चर्चा बड़े भाषा मॉडल (एलएलएम) के रोजगार के साथ-साथ व्यावसायिक अवसरों और बाधाओं को भी छूती है जो एलएएमए नामक एक ओपन-सोर्स तकनीक के संबंध में उत्पन्न होती हैं।"
    ],
    "points": 238,
    "commentCount": 155,
    "retryCount": 0,
    "time": 1697040902
  },
  {
    "id": 37845903,
    "title": "K3s - लाइटवेट कुबेरनेट्स",
    "originLink": "https://k3s.io/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37845903",
    "commentBody": "",
    "originSummary": [
      "K3s IoT और एज कंप्यूटिंग के लिए बनाया गया एक कॉम्पैक्ट कुबेरनेट्स संस्करण है, जिसे दूरस्थ और संसाधन-सीमित वातावरण में प्रभावी ढंग से कार्य करने के लिए डिज़ाइन किया गया है।",
      "यह निर्भरता को कम करने और स्थापना को आसान बनाने के लिए एकल बाइनरी के रूप में बंडल किया गया है, जो एआरएम 64 और एआरएम वी 7 आर्किटेक्चर दोनों का समर्थन करता है, जिससे यह रास्पबेरी पाई जैसे छोटे उपकरणों के लिए बड़े सर्वरों के लिए उपयुक्त हो जाता है।",
      "क्लाउड नेटिव कंप्यूटिंग फाउंडेशन सैंडबॉक्स प्रोजेक्ट के रूप में, उपयोगकर्ता इसे डाउनलोड करके और इसे अपने सर्वर पर चलाकर और फिर एजेंट नोड्स जोड़कर के 3 का उपयोग करना शुरू कर सकते हैं।"
    ],
    "commentSummary": [
      "लेख में होमलैब सेटिंग में एकल-नोड सेटअप के लिए स्क्लाइट के साथ कुबेरनेट्स के एक हल्के संस्करण के 3 एस का उपयोग करके लेखक के सकारात्मक अनुभवों पर चर्चा की गई है।",
      "पोस्ट में लॉन्गहॉर्न, सेफ और रूक जैसे साझा ब्लॉक स्टोरेज समाधानों और कंटेनर ऑर्केस्ट्रेशन प्लेटफॉर्म, विशेष रूप से कुबेरनेट्स बनाम नोमैड के बीच तुलना की गई है।",
      "इन प्रौद्योगिकियों की उपयुक्तता पर बहस की जाती है, जिसमें कुबेरनेट्स से लेकर कई कंपनियों के लिए संभावित रूप से ओवरकिल होने की राय होती है, विशिष्ट आवश्यकताओं और वरीयताओं के आधार पर के0 जैसे हल्के विकल्पों की सिफारिश, और रैंचर डेस्कटॉप जैसे उपकरण।"
    ],
    "points": 236,
    "commentCount": 176,
    "retryCount": 0,
    "time": 1697038789
  },
  {
    "id": 37845195,
    "title": "गणित के प्रमाणों और कंप्यूटर कार्यक्रमों को बराबर करने वाला गहरा लिंक",
    "originLink": "https://www.quantamagazine.org/the-deep-link-equating-math-proofs-and-computer-programs-20231011/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37845195",
    "commentBody": "",
    "originSummary": [
      "लेख करी-हॉवर्ड पत्राचार का अवलोकन देता है, गणितीय प्रमाणों और कंप्यूटर कार्यक्रमों को जोड़ता है, कंप्यूटर विज्ञान में प्रकार और कार्यक्रमों और तार्किक विषयों में प्रस्तावों और प्रमाणों के बीच समानता का सुझाव देता है।",
      "इस पत्राचार के संभावित अनुप्रयोगों और निहितार्थों को छुआ जाता है, जिसमें सॉफ्टवेयर सत्यापन प्रक्रियाओं और प्रमाण सहायकों के विकास के लिए इसकी निरंतरता शामिल है।",
      "यह इस बात पर प्रकाश डालता है कि गणना और तर्क के बीच यह लिंक केवल अंतर्ज्ञानवादी तर्क तक ही सीमित नहीं है और इसकी मूलभूत प्रकृति का उल्लेख करता है, जो कई शोधकर्ताओं द्वारा इसकी खोज में स्पष्ट है।"
    ],
    "commentSummary": [
      "हैकर न्यूज चर्चा प्रोग्रामिंग में गणित की भूमिका के साथ-साथ गणितीय प्रमाणों और कंप्यूटर कार्यक्रमों के बीच सहसंबंध के आसपास घूमती है।",
      "प्रतिभागियों ने सही समय, अमूर्त अवधारणाओं की पहुंच और सीखने के लिए व्यावहारिक अनुप्रयोगों की आवश्यकता को प्राप्त करने में चुनौतियों को आवाज दी।",
      "वार्तालाप करी-हॉवर्ड आइसोमोर्फिज्म और प्रोग्राम गुणों को सत्यापित करने के लिए प्रमेय-सिद्ध भाषाओं के उपयोग में भी शामिल है।"
    ],
    "points": 233,
    "commentCount": 138,
    "retryCount": 0,
    "time": 1697035945
  },
  {
    "id": 37853181,
    "title": "मीट्रिक समय",
    "originLink": "https://metric-time.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37853181",
    "commentBody": "",
    "originSummary": [
      "मीट्रिक समय एक प्रणाली है जो दिन को 10 घंटे में विभाजित करती है, प्रत्येक घंटे में 100 मिनट शामिल होते हैं, और प्रत्येक मिनट में 100 सेकंड होते हैं, जिससे मानसिक गणित सरल हो जाता है और विभिन्न समय क्षेत्रों से निपट ता है।",
      "मीट्रिक समय प्रणाली में, एएम और पीएम के बीच कोई अंतर नहीं है, जिसमें एक दिन में केवल 10 घंटे होते हैं।",
      "मीट्रिक समय के पीछे की अवधारणा की तुलना मौद्रिक सोच से की जाती है, जहां प्रत्येक मीट्रिक घंटा 100-डॉलर के बिल के बराबर होता है और प्रत्येक मीट्रिक मिनट 1-डॉलर के बिल के समान होता है, जो प्रति दिन 1,000 मिनट और 100,000 सेकंड होता है।"
    ],
    "commentSummary": [
      "प्राथमिक बहस समय को मापने के लिए दशमलव या मीट्रिक प्रणाली लागू करने के प्रस्ताव पर केंद्रित है, अधिवक्ताओं का तर्क है कि यह गणना को सुव्यवस्थित करेगा और मौजूदा मीट्रिक प्रणाली के साथ संरेखित करेगा।",
      "हालांकि, आलोचकों को सटीक, कार्यान्वयन से संबंधित चुनौतियों और सामाजिक समायोजन के बारे में संभावित मुद्दों की उम्मीद है जो नई प्रणाली की आवश्यकता हो सकती है।",
      "चर्चा वैकल्पिक समय माप प्रणालियों और संभावित कैलेंडर सुधारों तक भी फैली हुई है।"
    ],
    "points": 230,
    "commentCount": 230,
    "retryCount": 0,
    "time": 1697081239
  },
  {
    "id": 37852711,
    "title": "क्या किसी को टिनिटस से पूर्ण, स्थायी राहत मिली है?",
    "originLink": "https://news.ycombinator.com/item?id=37852711",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37852711",
    "commentBody": "",
    "originSummary": [
      "लेखक उन व्यक्तियों से ज्ञान प्राप्त कर रहा है जिन्होंने टिनिटस से स्थायी राहत पाई है, एक चिकित्सा स्थिति जो कानों में घंटी बजाने का कारण बनती है।",
      "लेखक उन उपचारों के प्रति संदेह दिखाता है जो केवल लक्षणों को कम करते हैं और यह पता लगाने की कोशिश कर रहे हैं कि क्या पूर्ण राहत प्राप्त करने योग्य है।"
    ],
    "commentSummary": [
      "यह सारांश टिनिटस के आसपास ऑनलाइन वार्तालापों पर प्रकाश डालता है, जहां लोग स्थिति का प्रबंधन करने के लिए व्यक्तिगत अनुभव और रणनीतियों को साझा करते हैं, जिसमें ध्वनि चिकित्सा और जीवन शैली समायोजन तक सीमित नहीं है।",
      "ध्यान अनुरूप दृष्टिकोण, आवश्यकता होने पर पेशेवर मदद और श्रवण संरक्षण के महत्व की आवश्यक भूमिका पर है।",
      "चर्चाएं मानसिक स्वास्थ्य पर टिनिटस के प्रभाव को उजागर करती हैं और उभरते उपचारों को पेश करती हैं, इस तथ्य को रेखांकित करती हैं कि जबकि टिनिटस के लिए कोई व्यापक इलाज नहीं है, व्यक्तिगत रणनीतियां इसे प्रबंधित करने में मदद कर सकती हैं।"
    ],
    "points": 217,
    "commentCount": 249,
    "retryCount": 0,
    "time": 1697076600
  },
  {
    "id": 37850110,
    "title": "माइक्रोसॉफ्ट एसईसी 8-के: आईआरएस $ 29 बी के अतिरिक्त कर भुगतान की मांग कर रहा है",
    "originLink": "https://microsoft.gcs-web.com/node/31951/html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37850110",
    "commentBody": "",
    "originSummary": [
      "11 अक्टूबर, 2023 को, माइक्रोसॉफ्ट कॉर्पोरेशन ने खुलासा किया कि उसे 2004 और 2013 के बीच कर वर्षों से संबंधित आंतरिक राजस्व सेवा (आईआरएस) से प्रस्तावित समायोजन (एनओपीए) के नोटिस प्राप्त हुए हैं।",
      "आईआरएस ने इंटरकंपनी ट्रांसफर प्राइसिंग के मुद्दे के इर्द-गिर्द घूमते हुए दंड और ब्याज के अलावा करों में अतिरिक्त $ 28.9 बिलियन की मांग की है।",
      "माइक्रोसॉफ्ट प्रशासनिक अपीलों और संभवतः न्यायिक कार्यवाही के माध्यम से एनओपीए पर विवाद करने पर जोर देता है, स्पष्ट रूप से अगले 12 महीनों के भीतर अंतिम समाधान या अपनी कर आकस्मिकताओं में महत्वपूर्ण बदलाव की उम्मीद नहीं करता है।"
    ],
    "commentSummary": [
      "आईआरएस 2004 से 2013 तक अपनी आय और खर्चों को सही ढंग से आवंटित नहीं करने के लिए माइक्रोसॉफ्ट से 29 अरब डॉलर के अतिरिक्त कर भुगतान की मांग कर रहा है। Microsoft इन प्रस्तावित समायोजनों का विरोध कर रहा है, और समाधान में एक वर्ष से अधिक समय लगने की उम्मीद है।",
      "जबकि माइक्रोसॉफ्ट के पास कर भुगतान को कवर करने की वित्तीय क्षमता है, यह उनकी भविष्य की रणनीतियों और अधिग्रहणों को प्रभावित कर सकता है, विशेष रूप से $ 30 बिलियन कंपनी का अधिग्रहण करने की उनकी कथित योजना।",
      "माइक्रोसॉफ्ट को संभावित रूप से नियामक दंड और जांच का सामना करने के बावजूद, शेयर बाजार की प्रतिक्रिया ठंडी रही है, जिससे पता चलता है कि निवेशक माइक्रोसॉफ्ट द्वारा पूरी कर राशि का भुगतान करने के बारे में संदेह कर रहे हैं।"
    ],
    "points": 208,
    "commentCount": 155,
    "retryCount": 0,
    "time": 1697057557
  }
]
