[
  {
    "id": 37848212,
    "title": "Starlink Direct to Cell",
    "originLink": "https://direct.starlink.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37848212",
    "commentBody": "",
    "originSummary": [
      "Starlink, oddział SpaceX, uruchamia funkcję Direct to Cell, która zapewni globalnym telefonom LTE nieprzerwany dostęp do usług tekstowych, głosowych i transmisji danych.",
      "Nowa technologia, działająca jako kosmiczne wieże telefonii komórkowej, umożliwia łączność w odległych lokalizacjach i usuwa martwe strefy, bez konieczności modyfikacji istniejącego sprzętu lub aplikacji.",
      "Wykorzystując know-how SpaceX w zakresie produkcji i wystrzeliwania rakiet, Starlink ma na celu rozmieszczenie tych satelitów wspierających usługi komórkowe w dużych ilościach, z globalnymi dostawcami usług komórkowych udostępniającymi dostęp do sieci w krajach partnerskich."
    ],
    "commentSummary": [
      "Dyskusje obejmują korzyści z komunikacji satelitarnej w odległych obszarach, wyzwania związane z korzystaniem ze smartfonów w ekstremalnych temperaturach i aplikacje do przesyłania wiadomości w sytuacjach o niskiej przepustowości, a także zalety dedykowanych urządzeń zamiast telefonów dla bezpieczeństwa w dziczy.",
      "Kluczowymi zagadnieniami są potencjalne korzyści płynące z usług Starlink Direct to Cell i Starlink w odległych obszarach, współpraca z firmami takimi jak Apple i Google, a także kwestie cenowe, regulacyjne i licencyjne związane z usługami satelitarnymi.",
      "Rozważają również urządzenia do komunikacji w sytuacjach awaryjnych, takie jak osobiste nadajniki lokalizacyjne (PLB), oraz porównują zalety i ograniczenia różnych sieci satelitarnych. Osobiste doświadczenia zapewniają wnikliwy kontekst."
    ],
    "points": 657,
    "commentCount": 482,
    "retryCount": 0,
    "time": 1697048280
  },
  {
    "id": 37850930,
    "title": "Obywatele USA z trwałą niepełnosprawnością otrzymują bezpłatną dożywotnią przepustkę do parków narodowych",
    "originLink": "https://www.nps.gov/subjects/accessibility/interagency-access-pass.htm",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37850930",
    "commentBody": "",
    "originSummary": [
      "Przepustkę America the Beautiful - The National Parks and Federal Recreational Lands Access Pass, bezpłatną przepustkę dostępną dla obywateli USA lub stałych mieszkańców z trwałą niepełnosprawnością, można uzyskać osobiście lub online.",
      "Aby uzyskać przepustkę, wnioskodawcy muszą przedstawić dokumenty potwierdzające ich trwałą niepełnosprawność.",
      "Interagency Access Pass pomaga osobom niepełnosprawnym, zapewniając łatwiejszy dostęp do parków narodowych i federalnych terenów rekreacyjnych."
    ],
    "commentSummary": [
      "Dyskusje obejmują szereg tematów, w tym trudności doświadczane przez osoby niepełnosprawne, ponowną ocenę ADHD jako niepełnosprawności oraz szersze rozumienie i postrzeganie niepełnosprawności w społeczeństwie.",
      "Zajmuje się również kwestiami związanymi z opieką zdrowotną, mieszkalnictwem i wpływem ADHD na życie jednostek.",
      "Rozmowy wyrażają różnorodne opinie i punkty widzenia."
    ],
    "points": 402,
    "commentCount": 278,
    "retryCount": 0,
    "time": 1697062093
  },
  {
    "id": 37854846,
    "title": "Wprowadzenie do nowoczesnej statystyki",
    "originLink": "https://openintro-ims2.netlify.app/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37854846",
    "commentBody": "",
    "originSummary": [
      "\"Introduction to Modern Statistics (2nd Ed)\" to podręcznik autorstwa Mine Çetinkaya-Rundel i Johanny Hardin, wywodzący się z poprzednich wydań autorstwa Dieza, Barra i Çetinkaya-Rundel.",
      "Książka jest dostępna do pobrania za darmo, zapewniając dostęp do niedrogich materiałów edukacyjnych zarówno studentom, jak i entuzjastom.",
      "Książka jest dostępna na licencji Creative Commons Attribution-ShareAlike 3.0, która zezwala i zachęca do rozpowszechniania i udostępniania utworu."
    ],
    "commentSummary": [
      "Post omawia zastosowanie nowoczesnych statystyk i oprogramowania o nazwie JASP do porównania metod częstościowych i bayesowskich, które są statystycznymi podejściami do interpretacji danych.",
      "Autor opowiada się za zmianą w kierunku wykorzystania modeli liniowych i technik bayesowskich w edukacji statystycznej, sugerując potrzebę transformacji obecnych metod nauczania.",
      "Dyskusja obejmuje osobiste zmagania z matematyką, możliwe negatywne nastawienie do niej oraz rekomendacje książek do nauki statystyki, ze szczególnym uwzględnieniem \"Statystyki\" Carlsona i Winquista. Komentatorzy są zainteresowani dowiedzeniem się więcej o zastosowaniu sieci bayesowskich i wykorzystaniu języka programowania R."
    ],
    "points": 337,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1697100310
  },
  {
    "id": 37846471,
    "title": "Jak legalnie piracić każdą czcionkę",
    "originLink": "https://blog.willdepue.com/how-to-legally-pirate-all-fonts-in-an-afternoon",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37846471",
    "commentBody": "",
    "originSummary": [
      "Temat obraca się wokół legalności praw autorskich nielicencjonowanych czcionek w Internecie, gdzie prawo amerykańskie nie zezwala na prawa autorskie do poszczególnych glifów, ale zezwala na prawa autorskie do pliku czcionki.",
      "Czcionki opatrzone znakami towarowymi są chronione prawem, podczas gdy glify nieopatrzone znakami towarowymi nie podlegają prawom autorskim.",
      "Autor rozważa użycie publicznych, nietwórczych, nieoznaczonych znakami towarowymi czcionek do odtworzenia licencjonowanych czcionek, uznając złożoność takiego przedsięwzięcia, a na koniec podkreśla znaczenie wspierania twórców czcionek poprzez legalny zakup czcionek."
    ],
    "commentSummary": [
      "Głównym tematem tej dyskusji są kwestie praw autorskich związane z czcionkami i późniejszą praktyką ich piracenia.",
      "Zagłębia się w legalność powielania czcionek oraz w to, jak prawa autorskie potencjalnie wpływają na kreatywność i dostępność dzieł twórczych.",
      "Analizuje również złożoność licencjonowania czcionek i zakres ochrony oferowanej czcionkom na mocy praw autorskich."
    ],
    "points": 315,
    "commentCount": 139,
    "retryCount": 0,
    "time": 1697041266
  },
  {
    "id": 37847454,
    "title": "Google Cloud Spanner jest teraz o połowę tańszy od Amazon DynamoDB",
    "originLink": "https://cloud.google.com/blog/products/databases/announcing-cloud-spanner-price-performance-updates",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37847454",
    "commentBody": "",
    "originSummary": [
      "Google Cloud wprowadziło do swojej bazy danych Cloud Spanner znaczne ulepszenia w zakresie ceny i wydajności, które obejmują do 50% wyższą przepustowość i 2,5 razy więcej pamięci masowej na węzeł, bez żadnych dodatkowych kosztów.",
      "Zaktualizowany Cloud Spanner, znany z wysokiej wydajności, dostępności i skalowalności, staje się teraz jeszcze bardziej optymalnym kosztowo rozwiązaniem dla organizacji obsługujących duże ilości danych i wymagania aplikacji.",
      "Dla porównania, Spanner jest teraz bardziej opłacalny niż Amazon DynamoDB. Aktualizacje te są obecnie dostępne dla niektórych konfiguracji instancji, a pełne wdrożenie planowane jest dla wszystkich klientów Spanner w najbliższej przyszłości."
    ],
    "commentSummary": [
      "Dyskusja koncentruje się głównie na dostawcach usług w chmurze, w szczególności na porównaniu Google Cloud Spanner i Amazon DynamoDB w takich aspektach, jak ceny i wrażenia użytkownika.",
      "Inne omawiane tematy obejmują kwestie wsparcia i niezawodności, przydatność różnych baz danych do konkretnych zastosowań, wykorzystanie przetwarzania bezserwerowego oraz zastosowanie wyspecjalizowanych baz danych.",
      "Istnieją wyraźne obawy dotyczące uzależnienia od dostawcy i stabilności cen w branży usług w chmurze, odzwierciedlające doświadczenia i opinie użytkowników."
    ],
    "points": 299,
    "commentCount": 347,
    "retryCount": 0,
    "time": 1697045140
  },
  {
    "id": 37850265,
    "title": "Grind - strzelanka pierwszoosobowa na Amigę 500",
    "originLink": "https://www.indieretronews.com/2023/10/grind-first-person-shooter-for-amiga.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37850265",
    "commentBody": "",
    "originSummary": [
      "Grind to zaktualizowana strzelanka pierwszoosobowa dla Amigi 500, stworzona przy użyciu Dread-Engine. Zbudowana jest w estetyce steampunkowo-lovecraftiańskiej i oferuje wysokiej jakości projekty broni.",
      "Najnowsza aktualizacja zawiera demo i nowy poziom osadzony w mieście, a przyszłe plany rozwoju obejmują dodatkowe poziomy i typy wrogów.",
      "Obsługa muzyki, efekty dźwiękowe i więcej poziomów są obecnie w toku, wspierane przez Patreon. Dodatkowo, obecnie rozważana jest wersja gry na konsolę Mega Drive."
    ],
    "commentSummary": [
      "Centralnym punktem wpisu jest gra \"Grind\" na Amigę 500, oklaskiwana za drobiazgową szczegółowość i wyjątkową grafikę 3D, przypominającą prace Bitmap Brothers.",
      "Rozmowa dotyczy strategii firmy Sega w zakresie gier 3D i jej wpływu na konsole do gier wideo.",
      "Inne tematy obejmują ograniczenia i potencjał Amigi 500, próby optymalizacji podejmowane przez deweloperów oraz porównania z innymi platformami do gier, przy czym wielu użytkowników wyraża swój podziw dla wydajności gry na Amidze 500, pomimo wczesnych wątpliwości."
    ],
    "points": 292,
    "commentCount": 120,
    "retryCount": 0,
    "time": 1697058404
  },
  {
    "id": 37847782,
    "title": "Wordpress.com obsługuje teraz ActivityPub",
    "originLink": "https://wordpress.com/blog/2023/10/11/activitypub/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37847782",
    "commentBody": "",
    "originSummary": [
      "WordPress.com uruchomił funkcję ActivityPub, umożliwiając użytkownikom łączenie swoich blogów z platformami federacyjnymi, takimi jak Mastodon, aby dotrzeć do szerszego grona odbiorców.",
      "Wtyczka ActivityPub pomaga w łatwej integracji, umożliwiając czytelnikom śledzenie postów na blogu i przekształcanie odpowiedzi w komentarze na blogu.",
      "Użytkownicy mogą rozszerzyć swoje profile o niestandardową domenę i mogą aktywować tę funkcję w ustawieniach bloga, zamierzając zwiększyć zaangażowanie i zasięg blogów WordPress.com."
    ],
    "commentSummary": [
      "WordPress.com zintegrował ActivityPub, zdecentralizowany protokół sieci społecznościowych, umożliwiający użytkownikom publikowanie i udostępnianie treści w federacji.",
      "To posunięcie zapewnia rozległej bazie użytkowników dostęp do zdecentralizowanego ruchu mediów społecznościowych, choć niektórzy użytkownicy wyrażają obawy dotyczące moderacji i rozbieżności w interfejsie użytkownika (UI).",
      "Należy zwrócić uwagę na rozróżnienie między WordPress.com, który wdrożył te zmiany, a iteracją WordPress o otwartym kodzie źródłowym."
    ],
    "points": 252,
    "commentCount": 48,
    "retryCount": 0,
    "time": 1697046443
  },
  {
    "id": 37848793,
    "title": "Obligator - serwer OpenID Connect dla samodzielnych hostów",
    "originLink": "https://github.com/anderspitman/obligator",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37848793",
    "commentBody": "",
    "originSummary": [
      "\"Obligator\" to projekt rozwijający serwer OpenID Connect Provider (OP), przeznaczony do samodzielnego hostowania, którego konkretnym celem jest weryfikacja własności wiadomości e-mail i przekazywanie jej do aplikacji, do której użytkownik uzyskuje dostęp.",
      "Projekt ten obsługuje takie funkcje, jak anonimowi klienci OAuth2, uwierzytelnianie wielu domen, logowanie e-mail bez hasła i konfigurowalny czas działania za pośrednictwem interfejsu API.",
      "Obecnie projekt jest w fazie beta i nie nadaje się do użytku produkcyjnego, dopóki nie przejdzie przeglądu bezpieczeństwa."
    ],
    "commentSummary": [
      "Post dotyczy Obligatora, serwera OpenID Connect dostosowanego do celów samodzielnego hostingu.",
      "Dyskusje poszerzają się o alternatywne usługi uwierzytelniania, takie jak Zitadel, Authentik i Keycloak, zagłębiając się w ich wyzwania i ograniczenia, w tym kwestie związane z opcjami logowania e-mail i społecznościowego.",
      "Istnieje odniesienie do stosu Ory i innych, takich jak Hydra, Kratos i Oathkeeper, z trwającymi debatami na temat ich środków bezpieczeństwa i aspektów interfejsu użytkownika."
    ],
    "points": 241,
    "commentCount": 87,
    "retryCount": 0,
    "time": 1697050760
  },
  {
    "id": 37850485,
    "title": "Własna kamera All-Sky na Raspberry Pi",
    "originLink": "https://spectrum.ieee.org/all-sky-camera",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37850485",
    "commentBody": "",
    "originSummary": [
      "W artykule opisano, jak stworzyć kamerę typu \"zrób to sam\" przy użyciu Raspberry Pi, serii małych i niedrogich komputerów, które są szeroko stosowane w projektach technologicznych.",
      "Kamera domowej roboty jest przeznaczona do rejestrowania obrazów całego nocnego nieba, w szczególności meteorów, i może pomóc w badaniach naukowych dotyczących trajektorii meteorów.",
      "Zawiera szczegółowy przewodnik po niezbędnych komponentach i procedurze konfiguracji kamery, a także przedstawia inne podobne projekty wykorzystujące takie kamery do badania meteorów."
    ],
    "commentSummary": [
      "Artykuł zagłębia się w doświadczenia i porady użytkowników wykorzystujących kamery Raspberry Pi do fotografowania całego nieba, odnosząc się do typowych obaw, takich jak zarysowania kopuły kamery, wpływ temperatury na kamery z ręcznym ustawianiem ostrości i wykorzystanie zimnej pogody do lepszych zdjęć z długim czasem naświetlania.",
      "Czytelnicy wyrażają tęsknotę za wysokiej jakości kamerami z Raspberry Pi, omawiając szczegóły, takie jak czas ekspozycji, rozmiar czujnika, wydajność przy słabym oświetleniu, potencjalne uszkodzenia słoneczne, a przede wszystkim ograniczenia i jakość Raspberry Pi HQ Camera w astronomii i podobnych projektach.",
      "W rozmowie uznano ograniczenia kamer MIPI i podkreślono kluczową rolę optyki dla wysokiej jakości obrazu; niektórzy użytkownicy zalecają alternatywne kamery o lepszej jakości i czułości na światło."
    ],
    "points": 238,
    "commentCount": 46,
    "retryCount": 0,
    "time": 1697059735
  },
  {
    "id": 37846387,
    "title": "M2 Ultra może uruchomić równolegle 128 strumieni Llama 2 7B",
    "originLink": "https://github.com/ggerganov/llama.cpp/pull/3228",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37846387",
    "commentBody": "",
    "originSummary": [
      "Kod llama.cpp w repozytorium GitHub został zaktualizowany, włączając równoległe dekodowanie z maskami uwagi w celu zwiększenia wydajności kodu.",
      "Modyfikacje obejmują poprawę wydajności poprzez optymalizację pamięci podręcznej KV, dekodowanie wielu sekwencji oraz aktualizacje RoPE, zapisywanie/ładowanie sesji, a także przetwarzanie równoległe.",
      "Zmiany obejmują również wyłączenie optymalizacji współbieżności dla modyfikacji topologii grafu i adaptacji w testach rozmiaru modelu M2 Ultra."
    ],
    "commentSummary": [
      "W dyskusji omówiono funkcje nowego układu M2 Ultra firmy Apple oraz przeanalizowano zalety i wady korzystania z usług w chmurze w przeciwieństwie do infrastruktury lokalnej.",
      "Omówiono także zalety i wady samodzielnego hostingu usług w porównaniu z ich outsourcingiem oraz zbadano potencjalne wykorzystanie komputerów Apple Mac Mini w centrach danych.",
      "Dyskusja dotyczy również wykorzystania dużych modeli językowych (LLM), a także możliwości biznesowych i przeszkód, które pojawiają się w związku z technologią open source o nazwie LLAMA."
    ],
    "points": 238,
    "commentCount": 155,
    "retryCount": 0,
    "time": 1697040902
  },
  {
    "id": 37845903,
    "title": "K3s - lekki Kubernetes",
    "originLink": "https://k3s.io/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37845903",
    "commentBody": "",
    "originSummary": [
      "K3s to kompaktowa wersja Kubernetes stworzona z myślą o IoT i przetwarzaniu brzegowym, zaprojektowana do efektywnego działania w środowiskach zdalnych i o ograniczonych zasobach.",
      "Jest on dostarczany jako pojedynczy plik binarny, aby zmniejszyć liczbę zależności i ułatwić instalację, obsługując zarówno architektury ARM64, jak i ARMv7, dzięki czemu nadaje się zarówno do małych urządzeń, takich jak Raspberry Pi, jak i większych serwerów.",
      "Jako projekt sandbox Cloud Native Computing Foundation, użytkownicy mogą rozpocząć korzystanie z K3s, pobierając go i uruchamiając na swoim serwerze, a następnie dodając węzły agenta."
    ],
    "commentSummary": [
      "W artykule omówiono pozytywne doświadczenia autora z wykorzystaniem K3s, lekkiego wariantu Kubernetes, z sqlite dla konfiguracji z jednym węzłem w środowisku domowym.",
      "Post zawiera również porównanie rozwiązań współdzielonej pamięci blokowej, takich jak Longhorn, Ceph i Rook, oraz platform orkiestracji kontenerów, w szczególności Kubernetes i Nomad.",
      "Przydatność tych technologii jest przedmiotem dyskusji, a opinie wahają się od Kubernetes jako potencjalnie przesadzonej dla wielu firm, do rekomendacji lekkich alternatyw, takich jak K0s, i narzędzi takich jak Rancher Desktop, w zależności od konkretnych potrzeb i preferencji."
    ],
    "points": 236,
    "commentCount": 176,
    "retryCount": 0,
    "time": 1697038789
  },
  {
    "id": 37845195,
    "title": "Głębokie powiązanie między dowodami matematycznymi a programami komputerowymi",
    "originLink": "https://www.quantamagazine.org/the-deep-link-equating-math-proofs-and-computer-programs-20231011/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37845195",
    "commentBody": "",
    "originSummary": [
      "Artykuł przedstawia przegląd korespondencji Curry-Howard, łączącej dowody matematyczne i programy komputerowe, sugerując równoważność między typami i programami w informatyce oraz propozycjami i dowodami w dyscyplinach logicznych.",
      "Potencjalne zastosowania i implikacje tej korespondencji są poruszane, w tym jej znaczenie dla procedur weryfikacji oprogramowania i rozwoju asystentów dowodu.",
      "Podkreśla, że ten związek między obliczeniami a logiką nie ogranicza się tylko do logiki intuicjonistycznej i wspomina o jego fundamentalnym charakterze, widocznym w jego odkryciu przez wielu badaczy."
    ],
    "commentSummary": [
      "Dyskusja w Hacker News toczy się wokół korelacji między dowodami matematycznymi a programami komputerowymi, a także roli matematyki w programowaniu.",
      "Uczestnicy zwracają uwagę na wyzwania związane z osiągnięciem poprawnego czasu, dostępnością abstrakcyjnych pojęć i potrzebą praktycznych zastosowań do nauki.",
      "Rozmowa dotyczy również izomorfizmu Curry'ego-Howarda i wykorzystania języków sprawdzania twierdzeń do weryfikacji właściwości programów."
    ],
    "points": 233,
    "commentCount": 138,
    "retryCount": 0,
    "time": 1697035945
  },
  {
    "id": 37853181,
    "title": "Czas metryczny",
    "originLink": "https://metric-time.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37853181",
    "commentBody": "",
    "originSummary": [
      "Czas metryczny to system dzielący dobę na 10 godzin, z których każda składa się ze 100 minut, a każda minuta ze 100 sekund, co upraszcza matematykę umysłową i radzenie sobie z różnymi strefami czasowymi.",
      "W metrycznym systemie czasu nie ma rozróżnienia na AM i PM, a dzień składa się po prostu z 10 godzin.",
      "Koncepcja czasu metrycznego jest podobna do myślenia monetarnego, w którym każda godzina metryczna jest równoważna banknotowi 100-dolarowemu, a każda minuta metryczna banknotowi 1-dolarowemu, co daje łącznie 1000 minut i 100 000 sekund dziennie."
    ],
    "commentSummary": [
      "Główna debata koncentruje się na propozycji zastosowania systemu dziesiętnego lub metrycznego do pomiaru czasu, przy czym zwolennicy argumentują, że usprawniłoby to obliczenia i dostosowało się do istniejącego systemu metrycznego.",
      "Krytycy przewidują jednak potencjalne kwestie dotyczące precyzji, wyzwań związanych z wdrożeniem i dostosowań społecznych, które mogą wymagać nowego systemu.",
      "Dyskusje dotyczą również alternatywnych systemów pomiaru czasu i potencjalnych reform kalendarza."
    ],
    "points": 230,
    "commentCount": 230,
    "retryCount": 0,
    "time": 1697081239
  },
  {
    "id": 37852711,
    "title": "Czy ktoś uzyskał całkowitą, trwałą ulgę od szumów usznych?",
    "originLink": "https://news.ycombinator.com/item?id=37852711",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37852711",
    "commentBody": "",
    "originSummary": [
      "Autor sięga po wiedzę od osób, które znalazły trwałe wytchnienie od szumów usznych, schorzenia powodującego dzwonienie w uszach.",
      "Autor wykazuje sceptycyzm wobec terapii, które jedynie zmniejszają objawy i stara się dowiedzieć, czy możliwe jest całkowite złagodzenie objawów."
    ],
    "commentSummary": [
      "To podsumowanie przedstawia rozmowy online dotyczące szumów usznych, w których ludzie dzielą się osobistymi doświadczeniami i strategiami radzenia sobie z tym stanem, w tym między innymi terapią dźwiękiem i dostosowaniem stylu życia.",
      "Nacisk kładziony jest na kluczową rolę indywidualnego podejścia, profesjonalnej pomocy w razie potrzeby oraz znaczenia ochrony słuchu.",
      "Dyskusje naświetlają wpływ szumów usznych na zdrowie psychiczne i przedstawiają nowe metody leczenia, podkreślając fakt, że chociaż nie ma szerokiego lekarstwa na szumy uszne, indywidualne strategie mogą pomóc w radzeniu sobie z nimi."
    ],
    "points": 217,
    "commentCount": 249,
    "retryCount": 0,
    "time": 1697076600
  },
  {
    "id": 37850110,
    "title": "Microsoft SEC 8-K: IRS domaga się dodatkowej zapłaty podatku w wysokości 29 mld USD",
    "originLink": "https://microsoft.gcs-web.com/node/31951/html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37850110",
    "commentBody": "",
    "originSummary": [
      "W dniu 11 października 2023 r. Microsoft Corporation ujawnił, że otrzymał zawiadomienia o proponowanych korektach (NOPA) od Internal Revenue Service (IRS) dotyczące lat podatkowych od 2004 do 2013.",
      "IRS zażądał dodatkowych 28,9 miliarda dolarów podatków, oprócz kar i odsetek, związanych z kwestią cen transferowych między spółkami.",
      "Microsoft nalega na kwestionowanie NOPA w drodze odwołań administracyjnych i ewentualnie postępowań sądowych, najwyraźniej nie spodziewając się ostatecznego rozstrzygnięcia lub znaczących zmian w swoich zobowiązaniach podatkowych w ciągu kolejnych 12 miesięcy."
    ],
    "commentSummary": [
      "IRS domaga się od Microsoftu dodatkowej płatności podatkowej w wysokości 29 miliardów dolarów za nieprawidłową alokację dochodów i wydatków w latach 2004-2013. Microsoft kwestionuje te proponowane korekty, a ich rozwiązanie ma zająć ponad rok.",
      "Chociaż Microsoft ma zdolność finansową do pokrycia podatku, może to wpłynąć na jego przyszłe strategie i przejęcia, zwłaszcza na plan przejęcia firmy o wartości 30 miliardów dolarów.",
      "Pomimo tego, że Microsoftowi potencjalnie grożą kary regulacyjne i kontrola, reakcja giełdy była letnia, co sugeruje, że inwestorzy są sceptycznie nastawieni do płacenia przez Microsoft pełnej kwoty podatku."
    ],
    "points": 208,
    "commentCount": 155,
    "retryCount": 0,
    "time": 1697057557
  }
]
