[
  {
    "title": "Vertex Holdings CEO, 한국 스타트업에 싱가포르 시장 진출 적극 권장",
    "originLink": "https://www.sedaily.com/NewsView/29X4Q96HGG",
    "originBody": "",
    "originSummary": [
      "Vertex Holdings의 CEO Kee Lock Chua는 한국의 투자자와 스타트업이 국제 시장에 적극적으로 참여하도록 격려하였습니다.",
      "그는 또한 자신의 회사가 싱가포르 시장 진출을 원하는 한국 기업들에게 도움을 줄 수 있음을 제안하며, 이것을 세계 경쟁력 향상을 위한 중요한 단계로 보고 있습니다.",
      "그는 한국의 벤처 캐피탈리스트들이 전세계 시장 변동에 뒤처지지 않고 지역 사업에만 집중하지 않아야 한다고 덧붙였습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "Vertex Holdings의 CEO 케이 록 추아는 한국 투자자와 스타트업들에게 국제 시장에 적극적으로 참여하도록 권장했습니다.",
      "그는 싱가포르 시장에 진출을 원하는 한국 기업들에게 자사의 지원을 제공하겠다며, 이것을 글로벌 경쟁력을 갖추는 핵심 단계로 보았습니다.",
      "또한, 한국 벤처 투자자들은 국내 사업에만 집중하는 것이 아니라 글로벌 시장 변화를 지켜보는 것이 중요하다고 덧붙였습니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699276076960
  },
  {
    "title": "2023 스타트업 혁신 리더십 컨퍼런스, 한동대에서 개최",
    "originLink": "https://www.christiandaily.co.kr/news/129774",
    "originBody": "",
    "originSummary": [
      "김정석 목사가 이끄는 광림교회가 5월 5일에 70주년을 기념했습니다.",
      "이 기념일을 축하하며 교회는 그들의 역사적인 기념관을 재개장했고 12일에는 기념 콘서트를 개최할 예정입니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "김정석 목사가 이끄는 광림교회가 5월 5일에 70주년을 맞이하여 기념하였습니다.",
      "이 주요 이벤트를 기념하기 위해 교회는 역사적인 기념관을 다시 열었습니다.",
      "추가로, 12일에는 기념 콘서트가 개최될 예정입니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699276076960
  },
  {
    "title": "카카오 창업자 김범수, '더 이상 스타트업 아닌 카카오' 위기관리 앞장",
    "originLink": "https://m.hankookilbo.com/News/Read/A2023110616130002368",
    "originBody": "",
    "originSummary": [
      "카카오의 창설자인 김범수가 회사에 대한 주요 변화를 발표했습니다, 이에 따라 카카오는 더 이상 스타트업이 아닙니다.",
      "그는 회사의 위기 관리를 이끄는 것을 약속했습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "카카오의 창업자인 김범수는 회사에 대한 중요한 변화를 발표하면서, 카카오는 더 이상 스타트업이 아니라고 말했습니다.",
      "그는 카카오의 위기 관리를 이끌 것을 약속했습니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699276076960
  },
  {
    "title": "머스크의 AI 스타트업, 센스있는 대화 능력을 지닌 챗봇 '그록' 공개",
    "originLink": "https://www.yonhapnewstv.co.kr/news/MYH20231106008300032",
    "originBody": "",
    "originSummary": [
      "Elon Musk의 AI 스타트업인 xAI가 그들의 첫 생성적 AI 챗봇인 Grok을 공개했습니다.",
      "Grok은 이해와 공감의 개념을 기반으로 본격적인 문제에 대응하고, 약간의 위트와 반항적인 성격을 가집니다.",
      "Grok은 xAI에서 개발한 대규모 언어 모델인 'Grok-1'에 의해 구동되며, 소셜 미디어 플랫폼 X의 프리미엄 구독자에게 제공될 예정입니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "Elon Musk의 AI 스타트업인 xAI가 그들의 첫 번째 생성 AI 챗봇인 'Grok'을 공개했습니다.",
      "이 챗봇은 이해와 공감의 개념을 담았으며, 질문에 재치 있는 답변을 제공하도록 설계되었습니다.",
      "Grok은 xAI가 개발한 대규모 언어 모델 'Grok-1'에 의해 지원되며, 소셜 미디어 플랫폼 X의 프리미엄 구독자들에게 제공될 예정입니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699276076960
  },
  {
    "title": "애플의 글루코스 모니터링 시스템, 스타트업 경쟁과 함께 건강 관리의 핵심으로 부상",
    "originLink": "https://www.chosun.com/economy/smb-venture/2023/11/06/D5MUGCXTCVE25NEPROCYSV2W2A/",
    "originBody": "",
    "originSummary": [
      "애플은 사용자의 피부를 통해 혈당 수준을 측정하는 비침습적인 혈당 모니터링 시스템인 'E5'를 10년 동안 개발해 왔습니다.",
      "이 기술을 애플 워치에 통합하려고 하며, 이는 건강 기술 산업에 진입하려는 애플의 의지를 보여줍니다.",
      "동시에, 혈당 수준을 정기적으로 모니터링하면 체중 관리와 질병 위험 감소를 포함하여 식단 및 건강 관리에 중요한 정보를 제공할 수 있기 때문에 연속 혈당 모니터링(CGM) 기술에 대한 관심이 증가하고 있습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "Apple은 10년 동안 비침습적인 혈당 모니터링 시스템인 'E5'를 개발하고 있으며, 이는 사용자의 피부를 통해 혈당 수준을 측정하는 빛을 사용합니다.",
      "이 기술을 Apple Watch에 통합하려는 계획으로, 건강기술 산업 진입의 야심을 시사합니다.",
      "동시에, 혈당 수준의 규칙적인 모니터링이 식단 및 건강 관리, 체중 조절 및 질병 위험 감소에 중요한 정보를 제공할 수 있기 때문에, 지속적인 혈당 모니터링 (CGM) 기술에 대한 관심이 증가하고 있습니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699276076960
  },
  {
    "title": "플랫폼 독과점 규제 강화 제안, 스타트업 성장 및 국내 회사 개발에 부정적 영향 우려",
    "originLink": "https://www.seoul.co.kr/news/newsView.php?id=20231107002001",
    "originBody": "",
    "originSummary": [
      "대한민국의 윤석열 대통령이 독점적인 플랫폼 경제에 대해 더 엄격한 규제를 제안한 것에 따라 플랫폼 사업에 대한 이중 규제에 대한 우려가 있습니다.",
      "비평가들은 이러한 조치가 이미 존재하는 공정거래위원회의 가이드라인과 결합하여 스타트업 성장을 저해하고 국내 기업에 어려움을 줄 수 있다고 우려하고 있습니다.",
      "대한민국의 디지털 규제는 이미 다른 나라들보다 강하다고 여겨집니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "대통령 문재인이 독점적 플랫폼 경제에 대한 보다 엄격한 규제를 제안함에 따라, 한국에서는 플랫폼 사업의 이중 규제에 대한 우려가 커지고 있습니다.",
      "비판가들은 이러한 조치가 공정거래위원회의 기존 가이드라인과 결합하여 스타트업의 성장을 저해하고 국내 기업에 도전을 던질 수 있다고 우려한다고 말합니다.",
      "한국의 디지털 규제는 이미 다른 나라들보다 강하게 간주되고 있습니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699276076960
  },
  {
    "title": "유명인의 개인 이슈부터 ESG 중심 스타트업 투자 증가까지-다양한 한국 이슈 총정리",
    "originLink": "https://news.mt.co.kr/mtview.php?no=2023110215500955203",
    "originBody": "",
    "originSummary": [
      "TV 개성 아안 현모의 이혼, 배우 구혜선의 YouTube 수익 분쟁, 김길수범죄자의 체포 등 다양한 주제를 다루는 한국 뉴스 기사입니다.",
      "EU가 한국항공의 행동 계획을 인정하고, 한국질병관리청이 저항성 벌레로 인해 감시를 강화하며, 한국 벤처 투자가 ESG 중심의 스타트업에 더 많이 투자할 계획인 점도 소개하였습니다.",
      "회사 인수, 주식 시장 스캠과 공매도 금지의 영향에 대한 이야기도 주요한 내용 중 하나입니다. 기사는 또한 29명의 사망자를 낸 비참한 보트 전복사건에 대해 보도하였습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "TV 개성인 안현모의 이혼, 배우 구혜선의 YouTube 수익 분쟁, 그리고 범죄자 김길수의 체포와 관련된 주요 이슈를 다룹니다.",
      "EU가 대한항공의 행동 계획을 인정하였으며, 한국질병관리청이 저항성 벌레들로 인한 감시를 강화하였고, 한국벤처투자가 ESG 중심의 스타트업에 더 큰 투자를 하려는 계획도 소개되었습니다.",
      "기업 인수, 주식 시장 사기, 과다 매도 금지의 영향 등과 관련된 기사도 다수 보도되었습니다. 또한, 29명의 사망자를 낸 트래직한 보트 전복 사건도 보도하고 있습니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699276076960
  },
  {
    "title": "중국 AI 스타트업 '01.AI', 설립 8개월 만에 유니콘 등극",
    "originLink": "https://www.hankyung.com/article/2023110667521",
    "originBody": "",
    "originSummary": [
      "중국의 AI 스타트업 01.AI는 회사 가치가 10억 달러를 초과하며 단 8개월 만에 유니콘 기업의 지위에 올랐습니다.",
      "이 회사는 구글 중국의 전 대표가 설립하였고, 자신들의 언어 모델 Yi-34B 덕분에 메타보다 기술적으로 우월하다고 주장합니다.",
      "이제는 중국어와 영어 서비스를 제공하지만, 미래에는 더 많은 언어를 추가할 계획입니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "중국 AI 스타트업인 01.AI는 회사 가치가 10억 달러를 넘으면서 단 8개월만에 유니콘 기업이 됐습니다.",
      "이 회사는 구글 중국의 전 대표가 창립하였으며, 자사의 언어 모델인 Yi-34B로 Meta보다 기술적 우위를 가지고 있다고 주장하고 있습니다.",
      "현재 중국어와 영어 서비스를 제공하고 있으며, 향후에는 더 많은 언어를 추가할 계획입니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699276076960
  },
  {
    "title": "기후위기 지표, 전 세계 온난화 1.5도 제한까지 남은 시간은 5년 258일...재생에너지 비율 13.88%",
    "originLink": "https://biz.heraldcorp.com/view.php?ud=20231106000648",
    "originBody": "",
    "originSummary": [
      "전 세계 기후 위기 지표에 따르면, 전 세계 온난화를 1.5도 섭씨로 제한하기 위해 남은 시간은 5년 258일이며, 현재 재생 가능 에너지 비중은 13.88%입니다.",
      "뉴칼레도니아에 의한 태평양 보호 지역의 확장, 인도네시아 정부의 고유의 숲 인정, 미국의 식사 대체에 대한 연구 등 전 세계적으로 기후 대책이 진행 중입니다.",
      "호주 Victoria 주와 뉴욕 연방준비은행은 재생 에너지 투자를 확대하고 기상 관련 위험을 고려하며, 호주 전기 그리드에 재생 에너지 공급이 급증하고 있습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "전 세계적인 기후 위기 지표에 따르면, 전 세계 온난화를 1.5도 섭씨로 제한하기 위해 남은 시간은 5년 258일입니다.",
      "현재, 전 세계에서 재생 가능한 에너지 비율은 13.88%입니다.",
      "뉴칼레도니아의 엄격히 보호받는 지역의 확장, 인도네시아 정부가 최초로 수많은 조상의 숲을 인정, 미국 전역의 식사 대체로 인한 탄소 발자국 감소 등, 기후 변화 대책이 전세계적으로 진행되고 있습니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699276076960
  }
]
