[
  {
    "title": "Argentina's Milei faces uphill battle to fix economy, combat inflation",
    "originLink": "https://www.reuters.com/world/americas/argentinas-next-president-milei-must-tame-inflation-turn-around-economy-2023-11-20/",
    "originBody": "Americas Argentina's next president Milei must tame inflation, turn around economy By Hernan Nessi and Eliana Raszewski November 20, 20231:15 PM UTCUpdated 6 min ago BUENOS AIRES, Nov 20 (Reuters) - Argentina's libertarian President-elect Javier Milei has won a closely fought election. Now comes the hard part: dealing with economic crises. Inflation is at 143%, net reserves of foreign currency are deep in the red, savers are ditching the peso, and a recession is looming - if not already here. Four in 10 Argentines live in poverty and a sharp peso devaluation is likely. Milei, who is pledging economic shock therapy such as shutting the central bank and dollarization, won a second-round runoff vote on Sunday with some 56% to rival Sergio Massa's 44%. Advertisement · Scroll to continue Milei now faces the huge challenge of turning around the economy once he takes office on Dec. 10. Failure could lead to the already embattled country suffering a tenth sovereign debt default, poverty climbing and possible social unrest. \"It is an economy that is in intensive care,\" said Miguel Kiguel, a former undersecretary of finance at the Economy Ministry in the 1990s. INFLATION Argentina's high inflation rate creates huge distortions in markets and for consumers, with prices changing weekly. A central bank poll of analysts forecast 185% inflation by the end of the year. Advertisement · Scroll to continue \"One of the biggest challenges of the next administration will be to correct the distortion of relative prices that the economy has today,\" said Lucio Garay Mendez, economist at consulting firm EcoGo. \"In a context of high inflation and a stabilization plan, a correction is inevitable.\" In a bid to tamp down inflation Argentina's central bank has hiked the benchmark interest rate to 133%, which encourages saving in pesos, but hurts access to credit and economic growth. Advertisement · Scroll to continue Reuters Graphics Reuters Graphics PESO CONTROLS Argentina's peso currency has been shackled by capital controls since a market crash in 2019, which has led to an unwieldy array of exchange rates, where dollars trade for well over twice the price of the official level near 350 per dollar. Popular unofficial exchange rates include the \"blue\" dollar, the MEP, and blue-chip swap, though demand for dollars through parallel channels has over time spawned dozens of different rates including a \"Coldplay dollar\" and \"Malbec dollar.\" [1/5]Argentine president-elect Javier Milei addresses supporters after winning Argentina's runoff presidential election, in Buenos Aires, Argentina November 19, 2023. REUTERS/Agustin Marcarian Acquire Licensing Rights Milei has pledged to quickly undo capital controls and eventually dollarize the economy, while a sharp devaluation is likely in the near future to bring the official and parallel rates closer together. Reuters Graphics Reuters Graphics CENTRAL BANK RESERVES Argentina's central bank reserves of foreign currency are near their lowest level since 2006, and in net terms are widely seen by analysts to be in negative territory after a major drought hit exports of key cash crops like soy, corn, and wheat. The low reserves threaten the country's ability to repay debts to major creditor the International Monetary Fund (IMF) and private bondholders, as well as cover key imports. Argentina will need to revamp its creaking $44 billion IMF program. The government has agreed on an extended currency swap with China to help cover some of its costs, and had to delay some payments to key trade partners such as Brazil. Reuters Graphics Reuters Graphics RECESSION Latin America's third-largest economy is on track to shrink 2% this year, according to the latest central bank analyst survey, partly due to the impact of the recent drought that cut corn and soy crops in half. Along with triple-digit inflation, that is likely to sharpen poverty levels, with two-fifths of people already living under the poverty line as salaries and savings are eroded. Reuters Graphics Reuters Graphics SILVER LININGS? Argentina, rich in grains, shale gas and lithium, could see a boost next year as better rains help the harvest, a new gas pipeline trims reliance on costly imports, and demand rises for the lithium needed for electric vehicle batteries. Soy and corn are expected to have far stronger harvests, which will bring in much-needed foreign currency. \"The harvest will help bring a greater flow of income in the economy, as will the greater production of (shale oil formation) Vaca Muerta,\" said Eugenio Marí, chief economist at Libertad y Progreso Foundation. Reporting by Hernan Nessi and Eliana Raszewski; Editing by Adam Jourdan, Daniel Wallis and Chris Reese Our Standards: The Thomson Reuters Trust Principles. Acquire Licensing Rights , opens new tab Read Next Americas category Argentine libertarian Milei pledges new political era after election win Milei is pledging economic shock therapy, including shutting the central bank, ditching the peso and slashing spending. His challenges will be enormous: Empty coffers, a $44 billion debt program with the IMF, 150% inflation and more. Americas category Canada to crack down on profit making from short-term rentals, the Toronto Star reports Canada's Finance Minister Chrystia Freeland will announce a narrowly focused fall fiscal update on Tuesday to include a measure designed to make it less lucrative for people to use their properties as short-term rentals, Canadian newspaper The Toronto Star reported on Sunday. Europe category Shakira reaches deal with tax authorities to avoid $15 million tax fraud trial - judge Colombian singer Shakira on Monday reached a settlement with prosecution to avoid a trial over charges she failed to pay 14.5 million euros ($15.74 million) in Spanish income tax between 2012 and 2014. Americas category Kremlin notes Argentina President-elect Milei's comments on Russia, but hopes for good ties The Kremlin said on Monday it had taken note of statements about Russia from Argentina's President-elect Javier Milei, but wanted to maintain strong ties with Buenos Aires. Europe category Shakira reaches deal to avoid $15 million tax fraud trial in Spain Colombian pop star Shakira on Monday reached a settlement to avoid a trial in Barcelona over charges she failed to pay 14.5 million euros ($15.7 million) in Spanish income tax between 2012 and 2014, arguing it was triggered by personal reasons.",
    "originSummary": [
      "Argentina's incoming President, Javier Milei, faces significant challenges in tackling high inflation and the country's struggling economy.",
      "Milei plans to introduce economic shock therapy measures, including shutting down the central bank and dollarization, to address these issues.",
      "Failure to address these challenges could lead to increased poverty, social unrest, and a tenth sovereign debt default."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700486570566
  },
  {
    "title": "Can Argentina's controversial president fix the economy with his radical policies?",
    "originLink": "https://www.economist.com/the-americas/2023/11/20/is-argentinas-new-president-too-divisive-to-fix-a-broken-economy",
    "originBody": "The AmericasThe great divider Is Argentina’s new president too divisive to fix a broken economy? Javier Milei’s libertarian policies may be too radical to pass, or to work Nov 20th 2023BUENOS AIRES Share J avier milei, Argentina’s newly elected president, rose to fame by bashing the country’s political class on television. Now the world’s first avowedly libertarian leader will probably demonstrate the truth of the notion that it is easier to criticise than to do. On November 19th, Mr Milei surpassed expectations and won 56% of the vote in the presidential run-off, compared with 44% for Sergio Massa, a stalwart of the Peronist movement, which has governed Argentina for 28 of the past 40 years. His coalition, Liberty Advances, won in 20 of Argentina’s 23 provinces, plus the city of Buenos Aires. In his victory speech, Mr Milei promised to make “drastic changes” to end Argentina’s century-long decline and return the country to being a “world power” within 35 years. Yet, despite what at first glance appears to be a clear mandate, the firebrand Mr Milei will not find governing easy. His coalition was only created two years ago. It commands the support of none of Argentina’s powerful governors, and will have only 38 of 257 seats in the lower house of Congress, and seven of 72 seats in the Senate. This lack of political muscle, combined with the depth of Argentina’s malaise, will make it difficult for him to achieve his grand promises. Mr Milei was elected on a pledge to take a chainsaw to Argentina’s gargantuan state. He has vowed to cut public spending by up to 15 percentage points of gdp (from 38% now), to slash export taxes and regulations, and to privatise most state-owned enterprises. He wants to reduce the number of government ministries from 18 to eight and move towards a unified exchange rate. The country’s central bank, he says, is nothing but a machine for “crooked” politicians to print money, and thus must be shut down. In order to eliminate inflation, Mr Milei proposes swapping the peso for the United States dollar, the currency which most Argentines prefer to save in. There is little doubt that much needs to be done to turn Argentina around. Under the current Peronist administration of Alberto Fernández, annual inflation has risen from 54% in December 2019 to 143% today. The share of poor people, defined as those who cannot afford both a basic bag of goods and an essential service like transport, has risen from 36% to 40%. Around 32 taxes have either been created or raised, and numerous new exchange rates have been invented, making investment fiendishly complex. Argentina owes the imf $43bn but the current government has ploughed through the central bank’s vaults; net foreign exchange reserves are over $10bn in the red. Yet in order to slash public spending by the amount that he promises, Mr Milei will have to touch the most sensitive parts of Argentina’s economy. Much of the increase in spending has gone towards pensions, on which the state splurges around 12% of gdp—a similar share to far richer and greyer countries like Germany and Finland. Another 2.5% of gdp is spent every year on transport and utility subsidies. Reducing pensions and subsidies will hurt Argentina’s poor in the short term. If Mr Milei insists on his ill-defined plan to dollarise the economy, that could also lead to higher inflation or perhaps even hyperinflation as Argentines dump their pesos in droves, thinks Alejandro Werner, a former director of the Western Hemisphere department at the IMF. He warns that Argentina does not have sufficient dollars to pay for all the pesos in circulation and held in banks, and that neither international creditors nor the IMF will lend Argentina greenbacks to implement a risky plan. If the economic situation implodes, social unrest may follow. Only one of Argentina’s three non-Peronist presidents has been able to finish his mandate since the collapse of the military junta and the return of democracy in 1983. The other two had to leave office early as a result of street uprisings. “I am a militant,” says Lilian, from Somos Barrios de Pie, a Peronist social movement. “We fight twice as hard when we are in the opposition.” Mr Milei received only 30% of the vote in the first round of the presidential election in October. To win, he had to ally himself with Mauricio Macri, a former centre-right president, and Patricia Bullrich, the presidential candidate from the main centre-right coalition, Together for Change (jxc by its Spanish acronym). It is far from clear that Mr Milei will have the backing of all of jxc’s 94 Congressmen and 21 Senators. Instead he will have to negotiate, a skill that he lacks. In the past, Mr Milei has called one of jxc’s main leaders a “leftist piece of shit” and accused Ms Bullrich of bombing kindergartens as a left-wing guerilla in the 1970s (there is no evidence she did so). Detente will be made all the more difficult because of the bitterness of the election campaign. In the run-up to the vote, Mr Milei’s team repeatedly claimed—without evidence—that the incumbent party was planning a colossal fraud to steal the election. In the last presidential debate Mr Massa insinuated that Mr Milei was mentally unstable. Mr Milei’s running-mate, Victoria Villarruel, has long minimised the brutal crimes of the country’s dictatorship. On the night of the election, Donald Trump congratulated Mr Milei. “I am very proud of you,” he said in an online post. “You will turn your country around and truly Make Argentina Great Again!” Much will come down to the professionalism of Mr Milei’s cabinet. “The main doubt about Milei is his team, and in particular whether the future central bank president and economy minister subscribe to the idea of dollarisation,” says Lucas Llach, an economist in Buenos Aires. Mr Milei himself often puts ideology before sound policy. He has called China “murderous” and Brazil’s president, Luiz Inácio Lula da Silva, a “communist”. He says he would meet neither Xi Jinping nor Lula in office—despite China and Brazil being Argentina’s main trading partners. So the immediate question is whether he stuffs his cabinet with technocrats from more established outfits like jxc, or with ideologues from his own party. If he chooses wrongly, he risks facing the same inglorious ending as other non-Peronist presidents before him.■ Share Reuse this content THE ECONOMIST TODAY Handpicked stories, in your inbox A daily newsletter with the best of our journalism Sign up Yes, I agree to receive exclusive content, offers and updates to products and services from The Economist Group. I can change these preferences at any time. More from The Americas Mexico’s foreign policy is unambitious and erratic Blame its president, Andrés Manuel López Obrador Andrés Manuel López Obrador has reduced poverty in Mexico But he could have done better Latin America’s most powerful new gang built a human-trafficking empire It took advantage of millions of Venezuelan migrants",
    "originSummary": [
      "Argentina's new president, Javier Milei, aims to make significant changes to improve the country's struggling economy.",
      "Milei's libertarian policies, such as cutting public spending and privatizing state-owned enterprises, may face opposition and could potentially have negative consequences.",
      "The success of Milei's presidency will hinge on the effective implementation of his proposed policies and the support he receives from his team."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700486570566
  },
  {
    "title": "India's Female Employment Challenge: Limited Opportunities and Consequences",
    "originLink": "https://www.nytimes.com/2023/11/20/briefing/india-economy-gender-inequality.html",
    "originBody": "ADVERTISEMENT SKIP ADVERTISEMENT NEWSLETTER The Morning A Major Economic Challenge India has one of the world’s lowest rates of formal employment for women. Share full article Arti Kumari Credit... Andrea Bruce for The New York Times By Amanda Taub Nov. 20, 2023 Updated 7:19 a.m. ET There is one change, so simple it can be described in just six words, that could lift millions of people out of poverty and expand the world’s fifth-largest economy: Get more Indian women paid jobs. In many other countries, female labor-force participation has propelled economic growth. But India has one of the world’s lowest rates of formal employment for women. The percentage of women doing paid work has dropped sharply in recent years. Last year, 24 percent had a paid job, down from 29 percent in 2010. In China, by comparison, that rate is about 60 percent. “Every month, I read a statistic somewhere about how our G.D.P. is losing out because we don’t have ‘productive workers’ in the work force, and by that they mean women,” said Shrayana Bhattacharya, an economist at the World Bank. But changing that is easier said than done. Risk vs. reward One problem is India’s “jobless growth”: Although the country has some big companies, especially in technology, they are clustered in a few large cities. Much of the country’s recent economic growth has been concentrated in small, family-owned firms that employ few outsiders. That has had pronounced effects for women because it reinforces the patriarchal norms that keep them at home. In societies like India’s that place a high premium on family “honor” — which depends on female members’ reputations for chastity — letting an unmarried daughter work outside the home can seem risky because unsupervised contact with men could jeopardize her reputation. The result is what Alice Evans, a lecturer at King’s College London, calls the “patrilineal trap”: Even many families that would like their daughters to have jobs are afraid of the reputational cost of being the first to try. In many countries, Evans said, the patrilineal trap breaks when the economy creates enough well-paying, reliable jobs to make paid work extremely attractive. As more young women move to cities for jobs, the norms shift, and letting a daughter work no longer seems as risky. That’s what has started to happen in Bangladesh, for instance. But in India, the trap is still too powerful for most to escape. That can have catastrophic consequences. Without a way to earn a living, many women cannot escape violent marriages. Marital rape is not criminalized in India, and thousands of women are killed each year by their husbands or in-laws. Uncertainty’s cost If you were going to bet on a young woman to make it out of the trap, you might think Arti Kumari, the academic superstar of her village in Bihar, a rural state on the border with Nepal, would be a good one to back. When she was growing up, her friends and relatives used superlatives to describe her: the smartest, the strongest, the most determined. While other girls in her village married in their late teens, Arti finished high school and enrolled in college. But there were few jobs near her home. And traveling to another city for work seemed too precarious: She and her family worried that she might be left with nothing if she took the financial and reputational risks of moving but then couldn’t land a good job or was fired. Only federal government jobs, which effectively offer lifetime tenure in India, seemed to offer enough security to counterbalance the risks. Arti set her sights on winning one, but many other young people had the same idea. Since 2014, there has been an average of only three government jobs for every thousand young Indians pursuing one. Arti took exam after exam, but she didn’t make the cut. Meanwhile, the pressures of the trap grew stronger. Her family insisted on an arranged marriage. Her future mother-in-law, she knew, would expect her to stay home and care for the household. But Arti pushed back. She negotiated delays to the wedding so she could study for more exams. Then, after the string of disappointments continued, she secured her fiancé’s promise to let her keep trying for a job after marriage. When her wedding day dawned, Arti remained unemployed but determined. “I want to get the job as soon as possible, so that I can be independent and stand on my own feet,” she said. “I won’t have to be dependent on my husband.” For more: You can read India’s Daughters, a continuing series on this subject. And to receive the series’s final chapter and find out how Arti’s story ends, sign up for the Interpreter newsletter. THE LATEST NEWS ISRAEL-HAMAS WAR Israel’s military released videos of what it said was a fortified tunnel beneath the Shifa Hospital complex, bolstering its case that Hamas used the hospital for military operations. Israeli also released videos that it said showed two hostages being taken inside the hospital on Oct. 7, the day of Hamas’s major attack. Aid workers evacuated 31 premature babies in precarious health from Al-Shifa to a hospital in southern Gaza. Yemen’s Iran-backed Houthi militia hijacked a ship in the Red Sea, hours after threatening to target Israeli vessels. Israel’s military said no Israelis were on board. Israel and Hamas are close to agreeing to a pause in fighting of several days so hostages can be released, a White House official said. For almost two decades, an Israeli peace activist and a Hamas official quietly maintained an informal line of communication. The Oct. 7 attacks ended that. “They are alive, but they are not OK”: A Palestinian filmmaker in the U.S. is trying to keep in touch with his family in Gaza through communication blackouts. Watch our video. ROSALYNN CARTER Image Rosalynn and Jimmy Carter in 1976. Credit... Mikki Ansin/Getty Images Rosalynn Carter helped propel her husband, Jimmy Carter, from rural Georgia to the White House. They were from the same small Georgia town and spent eight decades together. She died at 96. “White House aides consider her the most influential First Lady since Eleanor Roosevelt,” The Times wrote in 1978. She attended cabinet meetings and security briefings. Michelle Obama said Rosalynn Carter “reminded me to make the role of first lady my own.” Bill and Hillary Clinton said she would be remembered as “the embodiment of a life lived with purpose.” See her life in photos from CBS News. POLITICS Greg Abbott, Texas’ governor, endorsed Donald Trump at an event near the southern border. “We need a president who’s going to secure the border,” Abbott said. At a hearing today, Trump’s lawyers will challenge a gag order placed on him in his federal election case. President Biden turns 81 today. Another birthday may offer a reminder of his age to an already skeptical electorate, writes Peter Baker. TECH OpenAI’s board of directors stood by its decision to push out its former chief executive, Sam Altman. Microsoft, an investor in the company, said it was hiring him to lead a research lab. Kyle Vogt, the chief executive of the driverless carmaker Cruise, resigned. The company pulled its autonomous cars off the road last month after a series of problems. NEW YORK The Times examined 94 attacks in New York City by mentally ill homeless people and found failures by an underfunded social safety net. The city and the state have paid out $110 million in settlements to people who were investigated by a police detective accused of rigging dozens of murder cases. OTHER BIG STORIES Image Javier Milei, Argentina’s president-elect. Credit... Cristina Sille/Reuters Javier Milei, a brash far-right libertarian with little political experience, won Argentina’s presidential election. A study found evidence that distinct groups of apes cooperate, challenging the notion that humans are the only primates capable of group-to-group alliances. A man suspected of shooting to death three women and a 13-year-old girl in Memphis was found dead after an hourslong manhunt. The fastest-growing places along the Atlantic coast are also among the most hurricane-prone. “It’s a market of haves and have-nots”: America’s unique and ubiquitous 30-year fixed-rate mortgage is creating inequality between new buyers and established homeowners. Laboratories in at least four U.S. states are investigating a mysterious respiratory illness in dogs. OPINIONS We need to recognize Malcolm X as a human being with flaws and vulnerabilities to truly understand his revolutionary legacy, Peniel E. Joseph writes. Here are columns by David French on antisemitism and Jane Coaston on abortion. MORNING READS Image At Badwater Basin. Sudden life: Visitors flock to Death Valley for its heat and barren landscape. This fall, they’ve been drawn in by something else: a lake that appeared almost overnight. Anxiety: It’s a good time to be a professional bedbug killer in Asia. Last wish: A cancer patient wanted to help pay others’ medical debt. She has posthumously raised enough to erase $20 million. New housing: In New York City’s financial district, families are filling empty offices. Metropolitan Diary: Good shoes, good deed. Lives Lived: Karel Schwarzenberg was a Czech prince who twice served as his country’s foreign minister, and quietly subverted aristocratic expectations. He died at 85. SPORTS Sunday Night Football: The Denver Broncos extended their winning streak with a comeback to beat the Minnesota Vikings, 21-20. Around the N.F.L.: The Detroit Lions beat the Chicago Bears and improved their record to 8-2. And the San Francisco 49ers’ Brock Purdy had a perfect quarterback rating in his victory over the Tampa Bay Buccaneers. Here are takeaways. M.L.B.: The Phillies re-signed the pitcher Aaron Nola in a seven-year, $172 million contract, taking a top pitcher off the free-agent market early. U.N.C.: The North Carolina field hockey team won its second straight national title, this one with a 23-year-old first-time head coach who played on the team last year. ARTS AND IDEAS Image Travis Kelce and Jason Kelce. Credit... Wave Sports + Entertainment Helmets off, mics up: The N.F.L. often suppresses individuality — players wear helmets, there’s a strict uniform policy and extravagant celebrations risk a fine. But an influx of more tolerant coaches, and more business-conscious players, has fostered a surprising trend: the football player podcast. On shows like Travis and Jason Kelce’s “New Heights” and Von Miller’s “The Voncast,” players have a direct line to fans — and a way build their brands. “I think it’s fun and guys will keep doing it as long as there’s a thirst from the audience,” Jason Kelce said. More on culture Police officers in London questioned the comedian Russell Brand in relation to three allegations of sexual offenses, according to British news outlets. Taylor Swift’s Eras Tour has encountered tragedy and mishaps in Brazil. Two fans have died and a show was postponed. THANKSGIVING PREP LIST If you’re cooking a fresh turkey for Thanksgiving, pick it up today. Or browse our nonturkey mains and vegetarian centerpieces. Make apple pie filling, if that’s on the menu. Shop for perishables. THE MORNING RECOMMENDS … Image Credit... Jason Henry for The New York Times Pick an easy dinner for the night before Thanksgiving. Read books that experts say can make your relationship stronger. Navigate Thanksgiving air travel chaos with this gear. Clean your luggage. Here’s how. Take our news quiz. GAMES Image Here is today’s Spelling Bee. Yesterday’s pangram was obedience. And here are today’s Mini Crossword, Wordle, Sudoku and Connections. Thanks for spending part of your morning with The Times. See you tomorrow. Sign up here to get this newsletter in your inbox. Reach our team at themorning@nytimes.com. Share full article ADVERTISEMENT SKIP ADVERTISEMENT",
    "originSummary": [
      "Only 24 percent of women in India have paid jobs, resulting in one of the lowest rates of formal employment for women in the country.",
      "Factors such as patriarchal norms and the lack of well-paying, reliable jobs contribute to the low employment rate.",
      "The consequences of this low employment rate include poverty, violence against women, and limited opportunities for personal and financial independence."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700486570566
  },
  {
    "title": "Milei wins Argentina's presidency, aims for dollarized economy",
    "originLink": "https://www.cnbc.com/2023/11/20/milei-wins-in-argentina-edging-the-country-closer-to-the-us-dollar.html",
    "originBody": "SKIP NAVIGATION MARKETS BUSINESS INVESTING TECH POLITICS CNBC TV INVESTING CLUB PRO MAKE IT SELECT USA INTL WATCH LIVE Search quotes, news & videos WATCHLIST SIGN IN POLITICS Trump-admiring populist Milei wins in Argentina, edging the country closer to a dollarized economy PUBLISHED MON, NOV 20 20236:40 AM ESTUPDATED 19 MIN AGO Sam Meredith @SMEREDITH19 KEY POINTS Argentina's Javier Milei vowed to deliver on his radical economic policies shortly after resoundingly winning the country's presidential runoff. The far-right libertarian outsider has pledged to dollarize the economy, abolish the country's central bank and privatize the pension system. \"We have the determination to put Argentina on its feet and move forward,\" Milei said shortly after his victory, according to a translation. Newly elected President of Argentina Javier Milei of La Libertad Avanza speaks after the polls closed in the presidential runoff on November 19, 2023 in Buenos Aires, Argentina. Tomas CuestaGetty Images NewsGetty Images Argentina's Javier Milei, a far-right political outsider often compared to former U.S. President Donald Trump, vowed to deliver on his radical economic policies shortly after winning the country's presidential runoff. Milei, whose term will run from Dec. 10 through to the end of 2027, staged a resounding win in Sunday's vote by a wider-than-expected margin. He received roughly 56% of the vote, according to provisional results, comfortably beating Peronist Economy Minister Sergio Massa, who conceded after receiving just over 44%. The shock result leaves Latin America's third-largest economy in uncharted territory. Proud libertarian Milei, 53, has previously described himself as an \"anarcho capitalist\" and at one point on the campaign trail even wielded a chainsaw to symbolize his intent to cut state spending. Among some of his proposed policies, Milei has pledged to dollarize the economy, abolish the country's central bank and privatize the pension system. \"We have the determination to put the fiscal accounts in check. We have the determination to fix the problems of the central bank. We have the determination to put Argentina on its feet and move forward,\" Milei said shortly after his victory, according to a translation. \"Today, we return to the path that made this country great,\" he added. The challenges facing Milei's presidency are significant, however — particularly given that the country is once again in the grip of a profound economic crisis. The purchasing power of the South American nation has been ravaged by an annual inflation rate of more than 140%, while 2 in 5 Argentines now live in poverty and key agricultural areas have been hit by a historic drought. Presidential candidate Javier Milei of La Libertad Avanza lifts a chainsaw during a rally on September 25, 2023 in San Martin, Buenos Aires, Argentina. Tomas CuestaGetty Images NewsGetty Images \"Governability is going to be really tough for him,\" Nicholas Watson, managing director of Teneo, told CNBC's \"Street Signs Europe\" on Monday. \"We could be in for a roller coaster ahead.\" \"If he really goes through with the kind of 'shock therapy' that he's talking about, we would expect to see public appetite for that begin to wane potentially quite quickly,\" Watson continued. \"Dollarization? I think they are going to kick that into the long grass. Reform of the central bank? I mean he talked about blowing the central bank up, his schtick is with a chainsaw … I mean, some of that is just no longer realistic.\" Asked whether investors could expect sky-high inflation to start to come down after the vote, Watson replied, \"Inflation might go up because the distortions and imbalances of the economy are so intense and so widespread that addressing one thing means perhaps creating problems somewhere else.\" 'Dollarization is feasible and it's desirable' While many remain skeptical about Milei's political ability to deliver on some of his economic reforms, others felt the measures could be \"very positive\" for Argentina. \"The key problem in Argentina since 1876 has been the peso,\" Steve Hanke, professor of applied economics at Johns Hopkins University, told CNBC's \"Street Signs Asia\" on Monday. \"One currency crisis after another. One recession after another. Defaults on debt — one right after another. They have had three defaults on sovereign debt since the year 2000. And the current inflation rate, I just measured it today, it's 220% in Argentina,\" he added. WATCH NOW VIDEO03:21 Argentina: Steve Hanke says many arguments against dollarization are 'rubbish' \"It's all tangled up with the central bank and the peso. So, Milei has the right idea. You've got to dollarize and many of these arguments against dollarization are absolute rubbish. This idea that somehow, they don't have enough dollars to dollarize is ridiculous.\" Hanke said he had not been a formal part of Milei's campaign, but had been in close contact with his technical team and described himself as an \"informal advisor\" on issues such as dollarization. Read more CNBC politics coverage Tim Cook, Elon Musk, Steve Schwarzman spotted at Xi Jinping dinner with U.S. CEOs Biden stands by comment that Xi is a ‘dictator’ hours after their first meeting in a year Why the Pentagon is spending billions to bring laser weapons to the battlefield \"Dollarization is feasible and it's desirable,\" Hanke said, saying the next steps would need to be akin to \"a precision drill.\" He added, \"We're talking about a very precise operation. So, if it is done right, it will be a huge economic boom in Argentina. Very positive.\" Likelihood of immediate dollarization 'remains remote' Jimena Blanco, head of Americas at Verisk Maplecroft, noted that Milei will need to deliver significant structural reforms if he is to make good on his promises including dollarizing the economy and scrapping the central bank. \"The former, however, requires dollars that the central bank currently lacks and, therefore, the probability of immediate dollarisation remains remote,\" said said in a research note. WATCH NOW VIDEO12:16 Why China has its eye on Latin America \"In the immediate term, we expect Milei would announce a tough fiscal, monetary and FX policy to begin stabilizing the economy and reduce inflation with the aim of transitioning towards dollarisation. And while peso-denominated bonds would take a hit, market expectations might improve over the medium-term horizon.\" Subscribe to CNBC PRO Licensing & Reprints CNBC Councils Select Personal Finance CNBC on Peacock Join the CNBC Panel Supply Chain Values Select Shopping Closed Captioning Digital Products News Releases Internships Corrections About CNBC Ad Choices Site Map Podcasts Careers Help Contact News Tips Got a confidential news tip? We want to hear from you. GET IN TOUCH Advertise With Us PLEASE CONTACT US CNBC Newsletters Sign up for free newsletters and get more CNBC delivered to your inbox SIGN UP NOW Get this delivered to your inbox, and more info about our products and services. Privacy PolicyYour Privacy ChoicesCA NoticeTerms of Service © 2023 CNBC LLC. All Rights Reserved. A Division of NBCUniversal Data is a real-time snapshot *Data is delayed at least 15 minutes. Global Business and Financial News, Stock Quotes, and Market Data and Analysis. Market Data Terms of Use and Disclaimers Data also provided by",
    "originSummary": [
      "Javier Milei, a far-right political outsider, has won Argentina's presidential runoff and plans to implement radical economic policies.",
      "Milei's proposed policies include dollarizing the economy, abolishing the central bank, and privatizing the pension system.",
      "Experts caution that governing will be challenging and some of Milei's policies may not be realistic, with the immediate implementation of dollarization being unlikely. Stabilizing the economy and reducing inflation would require significant reforms."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700486570566
  },
  {
    "title": "German Economy Chief Warns of Economic Impact From Budget Restriction",
    "originLink": "https://finance.yahoo.com/news/german-budget-shock-major-blow-080523830.html",
    "originBody": "Bloomberg German Economy Chief Warns of Major Blow From Budget Ruling Read full article Iain Rogers Mon, November 20, 2023 at 5:30 AM CST·4 min read 1 / 2 German Economy Chief Warns of Major Blow From Budget Ruling (Bloomberg) -- German Vice Chancellor Robert Habeck said last week’s ruling by the country’s top court curbing the use of off-budget special funds is a major blow for Europe’s biggest economy and could lead to higher energy costs for households and companies. Most Read from Bloomberg The Doomed Mission Behind Sam Altman's Shock Ouster From OpenAI Microsoft Ends Weekend of OpenAI Drama With Coup of Its Own OpenAI Leaders' Efforts to Bring Back Altman Reach Impasse Over Board Role OpenAI’s Murati Aims to Re-Hire Altman, Brockman After Exits OpenAI Board Urged by Microsoft, Investors to Restore Altman Constitutional Court judges said that €60 billion ($65.5 billion) in untapped credit authorizations can’t be transfered into the government’s Climate and Transformation Fund, potentially threatening projects like the expansion of hydrogen infrastructure and charging stations for electric vehicles. While the government is still digesting the ruling and how to implement it, it’s already clear that it will have “massive implications” for Germany’s transformation to a cleaner and more technologically advanced economy, Habeck said Monday in an interview with Deutschlandfunk radio. It also potentially impacts similar off-budget vehicles, he added. Read More: German Ruling Puts €770 Billion of Government Funds at Risk “This is about the core substance of the German economy,” Habeck said. “The answer is not easy to find and things could get really difficult.” Government support for efforts by companies to green manufacturing processes, including in the steel industry, and the expansion of solar power are among initiatives under threat, he said. As well as throwing the governing coalition’s budget policy into disarray, the bombshell ruling has prompted renewed debate about rules enshrined in Germany’s constitution that limit net new borrowing, known as the debt brake. Lawmakers from Chancellor Olaf Scholz’s Social Democrats and Habeck’s Greens have called for the rules to be temporarily set aside again, as they were to help the government deal with the fallout from the Covid-19 pandemic and the energy crisis. The fiscally hawkish Free Democrats, led by Finance Minister Christian Lindner, have categorically ruled out such a move. Story continues Habeck, who is also the economy minister, said that while he believes that the rules are “inflexible,” he is also aware that the constraints of the coalition with the FDP limit any room for maneuver. Asked if suspending the debt brake again is the right move, he said it’s too early to say and declined to “speculate.” “I can only refer to the economic data and note that the year 2023 had three quarters of virtually no growth,” Habeck said. “How we will implement this ruling has not yet been decided.” Read More: Bundesbank Says Germany Must Respect Constitutional Debt Brake Scholz’s chief spokesman, Steffen Hebestreit, said Monday that the government’s analysis of the “complex legal ruling” is ongoing and it would “certainly take some more days.” Habeck also raised the prospect that the court ruling will impact Germany’s Economic Stabilization Fund, known as the WSF. If that proves to be the case, it could have implications for around €30 billion euros of net new debt that has been allocated to help shield companies from high energy prices. That borrowing may have to be retroactively accounted for in the 2023 budget, leading to a breach of the debt-brake rules that Lindner insisted on reinstating. If the government is forced to take action on the WSF funds, it would mean that households and firms would face higher power prices and, potentially, higher gas costs as well, Habeck said. He lashed out at the opposition conservatives, who filed the challenge to the KTF fund with the Constitutional Court, and said one outcome is that the government can no longer afford to shield consumers from expensive energy. “They filed the legal challenge, it must be said, in favor of people in Germany paying higher prices,” he told Deutschlandfunk. Saskia Esken, a co-leader of Scholz’s Social Democrats, told Funke media group at the weekend that the government will likely have to suspend the debt brake in both 2023 and 2024 as a consequence of the court ruling. She also called for a more general loosening of the fiscal rules. The coalition would need the support of the conservatives for such a move, as a two-thirds majority in parliament is required. --With assistance from Michael Nienaber, Kamil Kowalcze and Arne Delfs. (Updates with Scholz spokesman in ninth paragraph) Most Read from Bloomberg Businessweek More Americans on Ozempic Means Smaller Plates at Thanksgiving The Share of Americans Who Are Mortgage-Free Is at an All-Time High The Impact and Cost of Musk’s Endorsement of Antisemitism on X Sequoia Icon Michael Moritz Bets $300 Million on Reshaping San Francisco Inflation Raging in Triple Digits Is Pushing Argentina Down a Radical Path ©2023 Bloomberg L.P. TRENDING 1. TC Energy receives FERC approval for Virginia Reliability Project 2. Microsoft emerges as big winner from OpenAI turmoil with Altman on board 3. Sterling touches two-month high ahead of interim budget 4. WHO: Three babies remain at Gaza hospital after evacuation 5. NRG Energy CEO Gutierrez leaves after Elliott sought new chief executive",
    "originSummary": [
      "Germany's top court ruling restricting the use of off-budget special funds will have significant implications for the country's economy, warns German Vice Chancellor Robert Habeck.",
      "The ruling blocks the transfer of €60 billion in untapped credit authorizations to the government's Climate and Transformation Fund, potentially affecting projects related to hydrogen infrastructure, electric vehicle charging stations, green manufacturing processes, and solar power expansion.",
      "There are debates about Germany's constitutional rules on borrowing, with calls for their suspension, but the implementation of the ruling is still undecided. Concerns also arise about the impact on Germany's Economic Stabilization Fund, potentially leading to higher energy prices for households and companies. The government is currently analyzing the ruling and its implications."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700486570566
  },
  {
    "title": "U.S. Outdoor Recreation Economy Tops $1 Trillion, Fuels Job Growth",
    "originLink": "https://coloradosun.com/2023/11/20/outdoor-recreation-economy-trillion/",
    "originBody": "This story first appeared in The Outsider, the premium outdoor newsletter by Jason Blevins. In it, he covers the industry from the inside out, plus the fun side of being outdoors in our beautiful state. SUBSCRIBE Outdoor recreation has a new tagline: a trillion-dollar industry. The new measurement of the outdoor recreation economy by the Bureau of Economic Analysis shows outdoor businesses in 2022 earning $563.7 billion, accounting for 2.2% of the nation’s gross domestic product and employing 5 million workers. Spending on outdoor recreation — defined by the bureau as gross output — reached $1.1 trillion, a 19% jump from 2021. This is the sixth year the federal government has analyzed outdoor recreation. And the numbers continue to reveal an economic juggernaut that drives urban and rural communities across the country. Outdoor recreation now is bigger than the country’s mining, agriculture and technology industries. The new easy-to-trumpet trillion-dollar impact arrives as federal lawmakers weigh the America’s Outdoor Recreation Act of 2023, a package of legislation that would, among, many things, champion recreation in federal land management plans, encourage private partnerships on federal campgrounds, support outdoor businesses and help rural communities manage the impacts of recreation. The legislation, sponsored by Democrats and Republicans, has passed out of the U.S. Senate’s Energy and Natural Resources Committee and is expected to be heard by a U.S. House committee soon. “These numbers help us make the case for outdoor recreation priorities,” said Chris Perkins, the vice president of programs for the Outdoor Recreation Roundtable, a coalition representing 110,000 outdoor businesses, nonprofits and associations. “This gives the industry a seat at the table supporting the most comprehensive package of outdoor recreation bills in a generation.” The Bureau of Economic Analysis measures the industry in three categories: “conventional” outdoor recreation, “other” outdoor recreation and “supporting” industries. The conventional category includes cycling, paddling, fishing, climbing, hunting, motorized recreation, RVing and skiing. Other recreation categories include going to amusement parks, concerts and sporting events, playing field sports, taking guided tours and gardening. Supporting industries include construction and travel. Using the BEA yardstick, travel is the largest contributor to the outdoor recreation economy, accounting for more than $339 million — or roughly 40% — of the outdoor economy. The industries supporting outdoor recreation are up 28% compared with 2021, while the economic activity in the core outdoor recreation categories is up 12%. But since 2018, when the bureau first began studying the outdoor economy, the economic impact of core activities are up 36%. That’s understandable considering the spectacular growth and appeal of outdoor recreation in 2020 and 2021 as the pandemic pushed more people outside. Now, as other industries, like travel, rebound from the pandemic downturn, it’s understandable to see stronger growth in those peripheral, supporting economies, Perkins said. Kent Ebersole, the head of the Boulder-based Outdoor Industries Association, said the $1.1 trillion mark “proves that the outdoor recreation industry is an economic force.” He said his group was “especially proud” to see the growth in core activities since 2019, with more than 55% of Americans getting outside for recreation. The BEA is still compiling specific state data, but Colorado ranks sixth among states with the fastest growing outdoor recreation economies. Outdoor recreation employment in Colorado rose 9.2% in 2022, compared with a national average of 7.4%. In 2022, outdoor recreation in Colorado generated $13.9 billion in spending in 2022, which supported nearly 130,000 workers who earned $6.9 billion. In 2021, outdoor recreation in Colorado generated $11.6 billion in spending, which supported 125,244 workers who earned $6.1 billion. In 2020, outdoor recreation in Colorado generated $9.6 billion in spending, which supported 120,000 workers who earned $5.7 billion. In 2019, outdoor recreation in Colorado generated $12.2 billion in spending, which supported 149,140 workers who earned $6.47 billion. In 2018 outdoor recreation in Colorado generated $11.3 billion in spending, which supported 146,178 workers who earned $6 billion. A big part of the 2022 growth in Colorado can be credited to snowsports. Nationally, the economic impact of all snow activity — skiing, snowboarding, snowmobiling and other winter sports — grew 39%, with spending reaching $13.2 billion. Skiing and snowboarding accounted for $7 billion of that. Colorado contributed $1.4 billion to that winter sports impact, more than twice any other state. That jibes with ski industry numbers showing both the 2021-22 and 2022-23 ski seasons as the busiest ever for the nation’s resorts. And Colorado ski areas reported highs of 14 million visits in 2021-22 and 14.8 million in 2022-23. Colorado typically accounts for 20% to 25% of the nation’s ski resort business. Luis Benitez, the first director of Colorado’s outdoor recreation office who now works as the chief impact officer at the Trust for Public Lands said the trillion-dollar mark should sway the federal government to form a federal office of recreation. “Name another trillion-dollar economy that does not have a deep, well-constructed overwatch,” he said. “The time is now.” The new federal office inside the Department of Commerce would direct the Biden Administration’s revived Federal Interagency Council on Outdoor Recreation. It would support natural resource protection. It would wade into public health and trade policies and promote higher education programs to better hone industry leaders, Benitez said. As the race for the 2024 presidency begins, Benitez wants to see all candidates discussing how they will support and protect the nation’s newest trillion-dollar industry. “The ’t’ really shifts the conversation,” he said. “The ’t’ changes things.” The Daily Sun-Up podcastMore episodes Tagged: Bureau of Economic Analysis, outdoor industry, outdoor recreation, outdoor recreation economy, outdoor recreation industry Jason BlevinsOutdoors Reporter jason@coloradosun.com Jason Blevins lives in Eagle with his family. He writes The Outsider, a weekly newsletter covering the outdoors industry from the inside out. Topic expertise: Western Slope, public lands, outdoors, ski industry, mountain business, housing,... More by Jason Blevins",
    "originSummary": [
      "The outdoor recreation industry in the United States is valued at $1.1 trillion, representing a 19% increase from the previous year and contributing 2.2% to the country's GDP.",
      "The industry employs 5 million workers and surpasses other major industries such as mining, agriculture, and technology in economic significance.",
      "Federal lawmakers are considering the America's Outdoor Recreation Act of 2023, which has bipartisan support and aims to support and promote the industry. The act has already passed the U.S. Senate's Energy and Natural Resources Committee."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700486570566
  },
  {
    "title": "Americans Dissatisfied with Economy despite Strong Jobs Market",
    "originLink": "https://www.vox.com/2023/11/20/23964535/labor-market-employment-inflation-sentiment-economy-bad-polls",
    "originBody": "Filed under: Economy Politics Money Wages are rising. Jobs are plentiful. Nobody’s happy. It’s a good time to be a worker and a bad time to be a consumer — the problem is most people are both. By Emily Stewartemily.stewart@vox.com Nov 20, 2023, 7:00am EST Share this story Share this on Facebook Share this on Twitter Share All sharing options Share All sharing options for: Wages are rising. Jobs are plentiful. Nobody’s happy. Reddit Pocket Flipboard Email American workers: doing well, hating everything. RichVintage via Getty Images Emily Stewart covers business and economics for Vox and writes the newsletter The Big Squeeze, examining the ways ordinary people are being squeezed under capitalism. Before joining Vox, she worked for TheStreet. Explaining the state of the American economy at the moment is a conundrum. The labor market is good — as is much of the economy — and people say that everything is terrible. The past couple of years have been a solid stretch for workers in America. Unemployment is low. People who want to find jobs, by and large, can. Wages are up — even accounting for inflation over the past several months, and especially for people at the lower ends of the income spectrum. Workers really have been able to flex their muscles, whether that means quitting their jobs or unionizing or going on strike. And yet, amid all this, poll after poll shows that Americans say the economy is absolutely awful (what Americans do in this supposedly awful economy is a different thing, which we’ll get to later). That such a strong labor market isn’t making a dent, opinion-wise, is a little weird. It seems like this jobs landscape should make the public feel better. So why do people say it doesn’t? Sign up for The Big Squeeze newsletter Emily Stewart’s column exposes the ways we’re all being squeezed under capitalism. Sign up here. There are some obvious answers as to why Americans are so disgruntled. Everything is super expensive. The pandemic hangover is persistent — long covid isn’t just physical, it’s emotional. The government supports doled out in recent years — expanded unemployment insurance, the student loan pause, the child tax credit — have expired. The country’s political system is not exactly working spectacularly, not to mention the sense of dread heading into the 2024 elections. But what if full employment — meaning a labor market firing on all cylinders — or something close to it, like we’ve got now, just isn’t that popular, at least in its current form? Some elements of it clearly are. People generally like higher pay, lower unemployment, and unions. But it’s not that simple — the American public isn’t on cloud nine over the state of affairs. Hot job market, cold hearts To get this out of the way, there is absolutely evidence that full employment in other contexts has gone over much better. In the recent past, the United States largely had a full employment economy in the pre-Covid Trump era in 2018 and 2019. People generally felt pretty good about that. There is a partisanship element to all of this — when a Republican is in the White House, Republican voters say everything is awesome and Democratic voters say everything is terrible, and vice versa, even if they don’t really change their spending. “The reason we think it’s puzzling, why people are unhappy now, is because the evidence that a full employment economy makes people happy is overwhelming,” said Justin Wolfers, an economist at the University of Michigan. Right now, people are frustrated by inflation that, while cooling, is still higher than it has been in many people’s lifetimes, and they’re still missing 2019 prices. Consumers and businesses are dealing with higher interest rates that have come as a result of the Federal Reserve’s attempt to tame inflation, meaning items such as mortgages and car loans are more expensive. All of the noise coming from that can drown out the positive aspects of the economy, including the labor market, which not everyone experiences uniformly. “There is a recognition that a strong labor market is great for workers but not necessarily good for businesses” “Full employment is so good for the economy. It raises wages, it brings people into the labor force who have been traditionally left behind, it is an extremely equalizing force,” said Bharat Ramamurti, former deputy director of the National Economic Council. But that equalizing force might be part of the perception problem. “I think a lot of people respond to that negatively because they’re on the other side of that equation.” [Related: The problem isn’t inflation. It’s prices.] This type of labor market means that businesses big and small have to compete more for workers, which they don’t love and complain about loudly. In turn, it means consumers might have to wait more or have a worse time at a restaurant, cafe, or hotel, because staffing just isn’t what it used to be. That latte isn’t only pricier, but it takes longer, and customers are now being asked to tip more often as companies try to keep workers happy and subsidize their pay without cutting into their own bottom lines. This labor market means more “Help Wanted” signs, which are generally a good thing, though that’s not always intuitive. The flip side of full employment is not enough workers. Companies need workers just as much as workers need companies. When employers say, “Oh, it’s so hard to find good help these days,” that means better pay for their employees (though it also sometimes means shorter staffing). The public hears the former voice more often and louder than it does latter. “There is a recognition that a strong labor market is great for workers but not necessarily good for businesses,” said Joanne Hsu, who runs consumer surveys for the University of Michigan’s Institute for Social Research. “People tell us that they’ve been hearing bad news about labor markets with respect to business conditions.” The Michigan survey’s current readings find that people report hearing more negative news about employment than they did in the mid to late 2010s. “A surprising share of consumers are mentioning labor markets as a topic of negative news about the economy,” Hsu said. Why do people feel like this? A lot of it is perception It may be the case that people should say they feel better about the economy than they do, but nobody can tell anybody how to feel about things or say the reality they’re living isn’t, well, real. As to why full employment isn’t breaking through, sentiment-wise, there are likely a number of factors in play. Partisanship and negative media bias play a role. Republicans aren’t going to say things are good when Joe Biden is in office, and apparently, Democrats have their own qualms, too. (Whether Democrats are actually mad about the economy or just nonplussed by Biden is an open question.) The media tells stories through the lens of business owners, CEOs, and investors, all of whom are less likely to love how hard it is to find workers; stories about the workers who are benefiting tend to be less plentiful. Layoffs make headlines, especially when they’re at big names in media and tech — and even when they’re a teeny tiny sliver of the labor market. Social media often thrives on negative content. “Making it” in America today doesn’t feel very made. Inflation is, of course, painful and an enormous mood dampener. It’s not clear how much higher wages have played into higher prices (the answer appears to be likely not very much). Still, consumers worry that higher pay for workers and organized labor making more demands could lead to higher prices on items ranging from their cars to their Chick-fil-A sandwiches. Inflation also feels like a thing happening to people outside of their control. When things go well for people at work — when they get promotions and raises — they often attribute it to their unique circumstances and talents, not macroeconomic conditions. In a robust labor market like this one, many people feel secure about their jobs and confident about their prospects. At the same time, they’re seeing businesses scrounging around for employees. They can’t get a plumber to come fix their sink, their favorite restaurant has shorter hours, or their local vet clinic has completely shut down. “When you run into that, then you see the downside of the tight labor market, and I think this is particularly acute because people with jobs — which is most people who want jobs right now — have money to spend, and they can’t always spend it in the ways that they want,” Hsu said. “Even good news can be spun into bad news.” Given the strength of the current labor market, it’s fair to think things should feel better. Many people (though not everyone) are making quite a bit more than they were four years ago. It can feel almost more frustrating that your job is finally paying you well, you’re in the spot you wanted to be in, and you still can’t afford things easily. Gas and groceries remain a pain. You finally got to take that vacation, but it was more than you expected to pay, and the service at the hotel was dismal. Moreover, full employment does not address how prohibitively expensive some major pillars of our economy are — health care, child care, higher education, housing. “Making it” in America today doesn’t feel very made. “You need more than fully realized wages, you need many other pieces that comprise your cost of living to be significantly more affordable,” said Felicia Wong, president and CEO of the Roosevelt Institute, a progressive think tank. “The reason many of these things aren’t affordable is because their markets are so broken.” Even though people are saying the economy is bad, a lot of them aren’t acting like it In conversations with economists, journalists, policymakers, and others who pay attention to the economy, one theme often comes up: The way people say they feel about the economy right now doesn’t line up with where the data, historically, would indicate it should, or even with their own actions. From 2019 to 2022, American families saw their net worth increase and their incomes go up. While wages overall lagged inflation for much of the pandemic, that’s no longer the case, and they’re growing faster than prices are rising. The economy has seen wage compression as low-wage workers, specifically, have been able to take advantage of the tight labor market. That may cause some consternation for more middle- and upper-middle-class Americans, who aren’t used to much economic discomfort and are accustomed to the gap between them and lower earners being bigger. (The gap between the ultra-rich and everyone else, of course, is much wider, which makes you wonder if an economy so unequal could ever feel that good.) As Derek Thompson at the Atlantic noted in 2022, plenty of people say that their personal financial situations are okay and that even their local economies are plugging along, but then they say the national economy is trash. Many Americans are better off financially than they were pre-pandemic, and many of them are acting like it, too. Consumers and businesses have kept spending. New businesses have been created. None of this is to say that all is hunky dory. If you’re trying to buy or sell your house right now, things are far from ideal. Credit card debt is on the rise. I cannot say this enough: Higher prices suck. Still, actions speak louder than words. “If people were actually pessimistic about the future of the economy, they’d start saving, when in fact they’re spending like crazy,” Wolfers said. “If you look at the behaviors that would reflect the belief that the economy was good or bad, all of those behaviors suggest they’re incredibly optimistic, and they’re roughly as optimistic as you would expect based on things like the unemployment rate.” “If you just look at people’s actual spending habits, which I think is probably a fair measure of their actual view of their financial condition and where the actual economy is going, it is screaming that people feel very comfortable with where they think things are,” Ramamurti said. “We should evaluate conditions more by how people act rather than what they say.” The economy has been in an odd moment for years now, as has the way people feel about it. It’s not that full employment shouldn’t be a goal, or that it’s not a good thing, but depending on the context, it’s complicated — maybe a little more than, on paper, it would seem. Will you support Vox’s explanatory journalism? Most news outlets make their money through advertising or subscriptions. But when it comes to what we’re trying to do at Vox, there are a couple reasons that we can't rely only on ads and subscriptions to keep the lights on. First, advertising dollars go up and down with the economy. We often only know a few months out what our advertising revenue will be, which makes it hard to plan ahead. Second, we’re not in the subscriptions business. Vox is here to help everyone understand the complex issues shaping the world — not just the people who can afford to pay for a subscription. We believe that’s an important part of building a more equal society. We can’t do that if we have a paywall. That’s why we also turn to you, our readers, to help us keep Vox free. If you also believe that everyone deserves access to trusted high-quality information, will you make a gift to Vox today? One-Time Monthly Annual $5/month $10/month $25/month $50/month Other $ Yes, I'll give $5/month Yes, I'll give $5/month We accept credit card, Apple Pay, and Google Pay. You can also contribute via Next Up In Politics Most Read Formula 1 grew too fast. Now its new fans are tuning out. The controversy over TikTok and Osama bin Laden’s “Letter to America,” explained What are Israel and Palestine? Why are they fighting? The Crown increasingly becomes a fantastical apologetic for the royal family Explaining “Twin Flames,” the subject of Netflix’s disturbing new documentary Sign up for the newsletter Sentences The day's most important news stories, explained in your inbox. Email (required) By submitting your email, you agree to our Terms and Privacy Notice. You can opt out at any time. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. For more newsletters, check out our newsletters page. Subscribe The Latest We’ve been fighting poverty all wrong By Oshan Jarow Rishi Sunak’s cabinet shuffle won’t fix the UK’s Tories’ problems By Ellen Ioanes Most of Israel’s weapons imports come from the US. Now Biden is rushing even more arms. By Jonathan Guyer Formula 1 grew too fast. Now its new fans are tuning out. By Izzie Ramirez The controversy over TikTok and Osama bin Laden’s “Letter to America,” explained By A.W. Ohlheiser and Li Zhou Your phone is the key to your digital life. Make sure you know what to do if you lose it. By Sara Morrison",
    "originSummary": [
      "Americans are dissatisfied with the economy despite a strong labor market and increasing wages.",
      "High cost of living, pandemic effects, expired government support, and concerns about the political system contribute to this dissatisfaction.",
      "Perception of the labor market is influenced by political affiliations, which often emphasize negative aspects, despite positive indicators like increased net worth and incomes. However, people's actions show optimism for the future economy."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700486570566
  },
  {
    "title": "Javier Milei's Far-Right Proposals for Argentina: Economy, Security, Foreign Policy, and Human Rights",
    "originLink": "https://english.elpais.com/international/2023-11-20/javier-mileis-proposals-for-argentina-economy-security-foreign-policy-and-human-rights.html",
    "originBody": "ARGENTINA Javier Milei’s proposals for Argentina: Economy, security, foreign policy and human rights The far-right economist wants to reduce the functions of state to a minimum and adopt a policy of ‘zero tolerance’ against crime Newly elected President of Argentina Javier Milei greets supporters after the polls closed in the presidential runoff on November 19, 2023 in Buenos Aires. TOMAS CUESTA (GETTY IMAGES) CONSTANZA LAMBERTUCCI Buenos Aires - NOV 20, 2023 - 12:01 CET Argentina on Sunday elected the ultra-right-wing candidate Javier Milei as president and is entering a period of deep uncertainty. The economist, who will take office on December 10, will have to contend with a serious financial crisis, high levels of poverty, minimal reserves, and pending payments to the International Monetary Fund (IMF). Milei has proposed reducing the functions of state to a minimum and has placed his trust in the market alone solving Argentina’s problems through the development of trade and exports. He also proposes a revision of the values of equality and social justice that have structured Argentine society since the beginning of the last century. Towards the end of the campaign, Milei, leader of La Libertad Avanza, toned down his most controversial ideas, such as the free bearing of arms, the end of social plans, or the free sale of organs. These are his proposals on economy, security, foreign policy, health, education, and human rights: Economy Milei proposes an “integral reform” so that Argentina can return to being “the powerful country” of the beginning of the 20th century. The “paternalistic state,” believes the ultra-libertarian, is the root of all evil and as such he intends to strip it down. Among his plans are reducing the number of ministries from 18 to eight, “progressively” removing social assistance plans and cutting retirement and pension funds. His star economic proposals are dollarization and “burning down” the Central Bank. Milei also promises a “deep adjustment” that “will be paid for by the public sector” and to bring to end “in three months” the cepo cambiario system, which restricts the purchase and sale of foreign currency. Security Security emerged as a key element in the electoral campaign ahead of the presidential primaries, when an 11-year-old girl was attacked by two delinquents and died in hospital. La Libertad Avanza dedicated the most extensive section of its electoral platform to this issue. Milei intends to investigate the reduction of the minimum age of legal responsibility, the prohibition of entry into the country of “foreigners with criminal records” and the deregulation of the “legal” firearms market, a measure which sparked controversy during the electoral campaign and which he subsequently clarified. In addition, he proposes to equip, train, and provide technology to the security forces to give them back their “professional and moral authority” and to adopt a policy of “zero tolerance” against crime. Milei’s running mate, Victoria Villarruel, promotes the idea that the Argentine Armed Forces should carry out internal security tasks, a task they are currently forbidden from performing, and has promised that the military budget will increase from 0.6% to 2% of GDP. Foreign policy Milei is aligned with the United States, Israel, and “the free world” and stated during his campaign that he would break with Brazil and China — Argentina’s two main trading partners — if elected. During the last presidential debate, however, he said that this was “false” and got tangled up in trying to explain himself: “I deeply believe in opening up to international trade. However, I also believe that the state should not intervene in trade relations. It is a matter for the private sector.” Milei has also stated that he will pull Argentina out of the Southern Common Market (Mercosur) and rejected the country’s entry into the BRICS group of emerging economies. The president-elect has also confronted the Vatican, stating that Pope Francis is a “filthy lefty” and the “representative of the Evil One,” but then later affirmed that if the pontiff visits Argentina he will receive him “with the honors of a head of state” and “of the spiritual head of the Church.” Education and Health Two of the ministries that Milei promised to shut down are Education and Health, which together with those of Social Development and Labor will be merged into one, called “Human Capital,” as detailed in his electoral platform. The ultra-right candidate proposed creating a “system of educational vouchers” and to deliver the education budget to parents “instead of giving it to the ministry.” He also suggests eliminating the compulsory nature of comprehensive sex education. In public health, Milei wants a shift towards an insurance system that would stop subsidizing supply — i.e. hospitals — and finance demand — i.e. patients. In this section of its electoral program, La Libertad Avanza also defends the protection of a child “from conception,” thus preventing the voluntary interruption of a pregnancy, which has been a legal right since 2020. Democracy and human rights During the campaign, Milei attacked some of the basic consensuses built after the end of the military dictatorship (1976-1983). The ultra-rightist and his future vice-president, Victoria Villarruel, question many of the agreements reached during the democratic transition and believe that in Argentina there is a “fraud” surrounding human rights. Both deny state terrorism during the dictatorship, which has been recognized by the justice system, and instead maintain that the systematic plan promoted by the military juntas was “a war” in which “excesses” were committed. Milei’s running mate also promotes what she calls “complete memory” and recently proposed dismantling the Museum and Site of Memory at the former ESMA naval academy, where the dictatorship’s largest detention and extermination center operated and which was declared a World Heritage Site in September. Sign up for our weekly newsletter to get more English-language news coverage from EL PAÍS USA Edition More information Far-right Javier Milei sweeps Argentina’s elections, pushing the country into the unknown Federico Rivas MolinaBuenos Aires The daunting economic landscape choking Argentine voters Constanza LambertucciBuenos Aires Archived In Javier Milei Argentina Sergio Massa Israel China Washington D.C. BRICS Mercosur Adheres to More information If you are interested in licensing this content, please contact ventacontenidos@prisamedia.com newsletter Sign up to EL PAÍS in English Edition bulletin Most viewed Gaza: The rights of the injured Shakira’s ex-boyfriend, hairdresser, doorman and four zumba teachers: 117 witnesses to testify in the Colombian singer’s tax fraud trial Trump’s plans if he returns to the White House include deportation raids, tariffs and mass firings Israel-Hamas war deepens divisions in Iran ‘Working in Amazon offices was like slowly killing yourself’: Life in the tech giant, according to a former executive",
    "originSummary": [
      "Javier Milei, the newly elected president of Argentina, is a far-right economist who intends to decrease the role of the government and take a \"zero tolerance\" approach to combatting crime.",
      "He proposes market-oriented solutions, including dollarization and cutting social assistance programs, to address Argentina's financial crisis and high poverty rates.",
      "Milei also plans reforms in security, foreign policy, health, education, and human rights, with policies such as lowering the legal age of responsibility, deregulating the firearms market, increasing military spending, aligning with the United States and Israel, breaking ties with Brazil and China, merging Education and Health ministries, and questioning past human rights agreements during the military dictatorship."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700486570566
  },
  {
    "title": "Argentina's Economic Turmoil: Policies and Cycles Exposed",
    "originLink": "https://www.wsj.com/world/americas/argentinas-economic-turmoil-is-getting-worse-these-charts-explain-why-199fd7a8",
    "originBody": "By Santiago Pérez and Roque Ruiz Nov. 20, 2023 5:30 am ET Share Resize Listen (2 min) Argentine president-elect Javier Milei will take office in early December. PHOTO: AGUSTIN MARCARIAN/REUTERS Argentina has long been trapped in recurring cycles of deep and destructive economic contractions brought on by policies that force governments to routinely spend more than they collect through taxes and other income, economists say. President-elect Javier Milei will take office in early December with the task of reversing unsustainable spending policies that have depleted government coffers and caused inflation and interest rates to soar. Copyright ©2023 Dow Jones & Company, Inc. All Rights Reserved. 87990cbe856818d5eddac44c7b1cdeb8 Continue reading your article with a WSJ subscription Subscribe Now Already a subscriber? Sign In What to Read Next SPONSORED OFFERS TURBOTAX: Save up to $15 with TurboTax coupon 2023 THE MOTLEY FOOL: Epic Bundle - 3x Expert Stock Recommendations H&R BLOCK TAX: Get 20% off H&R Block tax software products TOP RESUME: Top Resume Coupon: 10% off professional resume writing EBAY: eBay coupon: Get extra 10% off $50+ GROUPON: Up to $50 off any order with Groupon promo code",
    "originSummary": [
      "Argentina's president-elect, Javier Milei, faces the challenge of reversing unsustainable spending policies that have caused economic contractions, depleted government coffers, and led to high inflation and interest rates.",
      "Economists believe that these recurring economic crises are due to policies that force governments to spend more than they collect in taxes and other sources of income.",
      "Milei will need to implement measures to address these issues and restore stability to the economy."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700486570566
  }
]
