[
  {
    "id": 41395413,
    "title": "A verdade por trás de Um Milhão de Caixas de Seleção",
    "originLink": "https://eieio.games/essays/the-secret-in-one-million-checkboxes/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41395413",
    "commentBody": "",
    "originSummary": [
      "\"Assegure-se de que o texto fornecido seja traduzido corretamente.\" O site \"One Million Checkboxes\" (OMCB) foi lançado em 26 de junho de 2024 e, inesperadamente, atraiu 500.000 jogadores que marcaram mais de 650.000.000 de caixas em duas semanas.",
      "Os usuários usaram criativamente as caixas de seleção para escrever mensagens binárias, levando a um servidor do Discord onde discutiram a automação do site e criaram desenhos e animações complexas.",
      "Apesar de algumas reclamações sobre bots, o criador achou a criatividade da comunidade inspiradora e documentou a experiência em um vídeo no YouTube para compartilhar o impacto emocional."
    ],
    "commentSummary": [
      "A postagem discute a jornada emocional e o processo criativo por trás do site 'One Million Checkboxes' (OMCB), destacando o equilíbrio entre restrições e criatividade na internet.",
      "O autor compartilha sua decisão de encerrar o site, citando razões como o fim natural do interesse, o aumento dos custos e o desejo de evitar os encargos de manutenção.",
      "A história ressoou com muitos leitores, evocando nostalgia e um renovado senso de alegria na engenharia de software, contrastando com o cenário tecnológico frequentemente avassalador e comercializado."
    ],
    "points": 2016,
    "commentCount": 185,
    "retryCount": 0,
    "time": 1724966412
  },
  {
    "id": 41399872,
    "title": "Despedida da AnandTech",
    "originLink": "https://www.anandtech.com/show/21542/end-of-the-road-an-anandtech-farewell",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41399872",
    "commentBody": "",
    "originSummary": [
      "MediaTek está prestes a adicionar suporte ao NVIDIA G-Sync aos escaladores de monitores, visando tornar os displays G-Sync mais acessíveis a um público mais amplo.",
      "Qualcomm apresenta o Snapdragon 7s Gen 3, aprimorando sua linha intermediária com a arquitetura Cortex-A720.",
      "Intel vendeu suas ações na Arm e reduziu suas participações em outras empresas, indicando uma mudança estratégica em seu portfólio de investimentos."
    ],
    "commentSummary": [
      "AnandTech, um renomado site de análises tecnológicas, está encerrando suas atividades, marcando o fim de uma era para análises e artigos técnicos detalhados.",
      "O site era conhecido por seu conteúdo detalhado e orientado pela integridade, o que influenciou significativamente muitos entusiastas e profissionais de tecnologia.",
      "Ao fechamento, despertou-se nostalgia e discussões sobre a mudança no cenário do jornalismo de tecnologia, com muitos lamentando a perda de um recurso tão único e confiável."
    ],
    "points": 1640,
    "commentCount": 355,
    "retryCount": 0,
    "time": 1725019523
  },
  {
    "id": 41394797,
    "title": "Elasticsearch é open source, novamente",
    "originLink": "https://www.elastic.co/blog/elasticsearch-is-open-source-again",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41394797",
    "commentBody": "",
    "originSummary": [
      "Elasticsearch e Kibana agora são novamente open source, com a AGPL sendo adicionada como uma opção de licença ao lado da ELv2 e SSPL.",
      "Essa mudança reafirma o compromisso da Elastic com o código aberto, abordando problemas anteriores com a AWS e a confusão no mercado que levaram a um fork do Elasticsearch.",
      "A mudança visa simplificar a experiência do usuário oferecendo múltiplas opções de licenciamento e está alinhada com o objetivo da Elastic de apoiar mais licenciamento de código aberto."
    ],
    "commentSummary": [
      "Elasticsearch voltou a ser open source, agora sob a licença AGPL, que exige que os usuários contribuam com quaisquer alterações.",
      "A AWS criou o OpenSearch depois que a Elastic rejeitou a oferta da AWS de contribuir com recursos de segurança, levando a uma divisão na comunidade.",
      "Os novos licenciamentos da Elastic visam equilibrar os benefícios do código aberto com as necessidades empresariais, impedindo que concorrentes usem seu código sem contribuir."
    ],
    "points": 710,
    "commentCount": 395,
    "retryCount": 0,
    "time": 1724962202
  },
  {
    "id": 41395921,
    "title": "Tutorial Interativo de Engenharia de Prompt da Anthropic",
    "originLink": "https://github.com/anthropics/courses/tree/master/prompt_engineering_interactive_tutorial",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41395921",
    "commentBody": "",
    "originSummary": [
      "Anthropic lançou um tutorial interativo para engenharia de prompts no Claude, com o objetivo de ensinar os usuários a criar prompts otimizados.",
      "As aulas abrangem tópicos desde o nível iniciante até o avançado, incluindo a estrutura de prompts, resolução de problemas comuns e construção de prompts complexos, com exercícios práticos e um 'Playground de Exemplos' para experimentação.",
      "Tutoriais utilizam Claude 3 Haiku e incluem uma versão em Google Sheets para facilitar o uso, tornando-o acessível para novos usuários entenderem e aplicarem técnicas de engenharia de prompts de forma eficaz."
    ],
    "commentSummary": [
      "Anthropic lançou um Tutorial Interativo de Engenharia de Prompt, que atraiu atenção significativa da comunidade tecnológica.",
      "Tutoriais têm como objetivo ensinar os usuários a se comunicarem de forma eficaz com Modelos de Linguagem de Grande Escala (LLMs) para alcançar os resultados desejados, uma habilidade conhecida como engenharia de prompts.",
      "Este lançamento é notável porque fornece orientações estruturadas sobre a otimização de prompts, o que é crucial para melhorar o desempenho e a confiabilidade de aplicações impulsionadas por IA."
    ],
    "points": 271,
    "commentCount": 74,
    "retryCount": 0,
    "time": 1724970115
  },
  {
    "id": 41396260,
    "title": "Nova API de GPU do SDL3 mesclada",
    "originLink": "https://github.com/libsdl-org/SDL/pull/9312",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41396260",
    "commentBody": "",
    "originSummary": [
      "A API GPU MkII #9312 foi mesclada no branch principal do libsdl-org, introduzindo atualizações significativas como o componente gráfico Refresh, que suporta APIs modernas como Vulkan e a API gráfica do PS5.",
      "Esta atualização inclui um sistema de compilação de shaders offline, visando simplificar a API da GPU, melhorar o desempenho e aumentar a segurança dos recursos.",
      "Os principais contribuintes são @thatcosmonaut, com o apoio da equipe central do FNA e feedback de vários colaboradores, indicando um esforço colaborativo para refinar e otimizar a API."
    ],
    "commentSummary": [
      "Uma nova API de GPU do SDL3 foi incorporada ao ramo principal, apesar do SDL3 ainda estar em pré-visualização, com o objetivo de simplificar o desenvolvimento gráfico multiplataforma, incluindo em consoles.",
      "Esta nova API foi projetada para ser mais poderosa do que a antiga API SDL 2D, suportando recursos modernos de GPU e atendendo tanto a necessidades 2D quanto algumas 3D.",
      "Embora esforços semelhantes como WebGPU/WGSL existam, eles não possuem backends para consoles, e a nova API SDL3 GPU ainda não suporta WebGPU como um backend."
    ],
    "points": 261,
    "commentCount": 94,
    "retryCount": 0,
    "time": 1724972672
  },
  {
    "id": 41395893,
    "title": "Distúrbio Sanguíneo: Desvendando o Mistério do Meu Envenenamento na Suécia",
    "originLink": "https://rattvisan.blog/2024/07/28/yes-i-was-poisoned-by-my-wife-a-software-engineer-of-top3-us-company/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41395893",
    "commentBody": "",
    "originSummary": [
      "A autora relata uma série de eventos começando em 24 de julho de 2021, quando sua esposa, Kim, foi presa após ser encontrada com uma garrafa suspeita, levando à descoberta de que ela havia adulterado sua garrafa de água.",
      "A autora vinha sofrendo de hipercalcemia e toxicidade de vitamina D desde 2019, com saúde oscilante apesar de inúmeros testes e tratamentos médicos, incluindo ressonância magnética e tomografia por emissão de pósitrons.",
      "Não se sabia a origem do excesso de vitamina D e cálcio até que o autor descobriu que Kim estava adicionando um líquido marrom à sua água, que ela afirmava ser potássio."
    ],
    "commentSummary": [
      "Uma postagem no blog rattvisan.blog discute um caso suspeito de envenenamento na Suécia, onde o autor alega que sua esposa o envenenou com vitamina D.",
      "Apesar dos registros médicos e das filmagens, o promotor sueco optou por não apresentar acusações devido à insuficiência de provas, gerando debate sobre o sistema de justiça.",
      "Comentadores expressam descrença na decisão, discutem a possibilidade de uma acusação privada e especulam sobre as motivações e o estado mental da esposa."
    ],
    "points": 169,
    "commentCount": 116,
    "retryCount": 0,
    "time": 1724969988
  },
  {
    "id": 41396206,
    "title": "Regras de firewall: não tão seguras quanto você pensa",
    "originLink": "https://www.haskellforall.com/2024/08/firewall-rules-not-as-secure-as-you.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41396206",
    "commentBody": "",
    "originSummary": [
      "Esta postagem discute técnicas para contornar firewalls empresariais, permitindo solicitações arbitrárias de entrada e saída sobre qualquer protocolo, o que é útil para implantar software em ambientes de rede restritos.",
      "Ele apresenta um repositório chamado 'holepunch' contendo módulos NixOS que automatizam esses truques de contorno de firewall, incluindo o tunelamento de conexões SSH de entrada dentro de solicitações HTTPS de saída.",
      "As técnicas assumem o controle sobre hosts em ambas as extremidades da solicitação de rede e utilizam ferramentas como proxies de encaminhamento, proxies reversos que terminam TLS, túneis reversos e Corkscrew para disfarçar e tunelar o tráfego."
    ],
    "commentSummary": [
      "As postagens discutem as limitações e potenciais vulnerabilidades das regras de firewall, destacando que elas podem não ser tão seguras quanto comumente se acredita.",
      "Compartilha anedotas do mundo real e insights técnicos sobre como fornecedores e indivíduos podem contornar restrições de firewall usando ferramentas como SSH e netcat, levantando preocupações sobre práticas de segurança.",
      "Essa conversa destaca a tensão entre políticas de segurança e necessidades práticas, enfatizando a importância da comunicação transparente e de medidas de segurança adequadas para prevenir o acesso não autorizado."
    ],
    "points": 166,
    "commentCount": 71,
    "retryCount": 0,
    "time": 1724972187
  },
  {
    "id": 41396641,
    "title": "Estou bloqueando conexões da AWS para meus serviços locais",
    "originLink": "http://consulting.m3047.net/dubai-letters/balkanized-internet.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41396641",
    "commentBody": "",
    "originSummary": [
      "Início da resposta: A ascensão dos grandes provedores de nuvem está levando a uma internet fragmentada ou 'balkanizada', onde a interoperabilidade com a internet geral é limitada. Fim da resposta.",
      "Contexto histórico: A internet passou de uma ferramenta governamental e educacional para um espaço comercial dominado pela publicidade e pela monetização de dados dos usuários.",
      "Preocupações incluem roubo de dados e tráfego excessivo de serviços em nuvem, levando alguns a bloquear o acesso de grandes provedores como a AWS para proteger recursos locais."
    ],
    "commentSummary": [
      "Autor está bloqueando conexões AWS para seus serviços locais devido a preocupações com abuso e ataques.",
      "Bloquear a extensa faixa de IPs da Amazon é desafiador, mas o autor está disposto a sacrificar algum tráfego legítimo para reduzir o tráfego indesejado.",
      "Há um debate sobre se bloquear os IPs dos provedores de nuvem poderia levar à fragmentação (balcanização) da internet, mas o autor prioriza a segurança em detrimento dessa preocupação."
    ],
    "points": 165,
    "commentCount": 120,
    "retryCount": 0,
    "time": 1724976951
  },
  {
    "id": 41395925,
    "title": "Google Closure Library foi arquivada",
    "originLink": "https://github.com/google/closure-library",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41395925",
    "commentBody": "",
    "originSummary": [
      "Closure Library foi arquivada porque não está mais alinhada com os requisitos modernos de desenvolvimento em JavaScript.",
      "Os usuários são incentivados a encontrar bibliotecas alternativas para atender às suas necessidades de desenvolvimento.",
      "Mais informações estão disponíveis na edição nº 1214."
    ],
    "commentSummary": [
      "Google Closure Library foi arquivada, marcando o fim de sua manutenção, apesar de sua importância histórica na construção de clientes de email robustos, como o editor do Gmail.",
      "A Closure Compiler continuará a receber suporte, mesmo com a evolução do ecossistema JavaScript para reduzir a necessidade de bibliotecas tão abrangentes.",
      "Legado de excelência em engenharia da Closure Library continua influente na comunidade de desenvolvimento."
    ],
    "points": 164,
    "commentCount": 66,
    "retryCount": 0,
    "time": 1724970132
  },
  {
    "id": 41401415,
    "title": "CIEL é um Lisp Estendido",
    "originLink": "http://ciel-lang.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41401415",
    "commentBody": "",
    "originSummary": [
      "CIEL é uma linguagem Lisp estendida, totalmente compatível com Common Lisp, e inclui recursos adicionais (\"baterias incluídas\").",
      "A página do repositório GitHub para o CIEL oferece recursos e documentação para usuários interessados em explorar ou contribuir para o projeto.",
      "Um script de exemplo demonstra a obtenção e impressão de dados JSON de uma API web usando CIEL, destacando suas aplicações práticas."
    ],
    "commentSummary": [
      "CIEL é uma versão estendida do Lisp, com discussões destacando suas ferramentas bem documentadas e o potencial para um mascote ou logotipo.",
      "Os principais recursos discutidos incluem a passagem de comandos do shell no REPL, a facilidade de compilar binários e a natureza interativa do REPL do CIEL em comparação com o do Python.",
      "Ciel"
    ],
    "points": 163,
    "commentCount": 49,
    "retryCount": 0,
    "time": 1725030259
  },
  {
    "id": 41396487,
    "title": "DuckDuckGo para Mac agora é open source",
    "originLink": "https://github.com/duckduckgo/macos-browser",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41396487",
    "commentBody": "",
    "originSummary": [
      "DuckDuckGo está expandindo sua equipe e contratando engenheiros de software sênior para aprimorar os padrões de confiança online.",
      "O projeto macOS usa o Swift Package Manager para dependências e o SwiftLint para a aplicação do estilo de código.",
      "Atualizações de terminologia foram feitas para remover conotações raciais problemáticas, adotando termos como principais ramificações, listas de permissão e listas de bloqueio."
    ],
    "commentSummary": [
      "DuckDuckGo tornou seu navegador para Mac de código aberto, disponível no GitHub, e ele é baseado no WebKit, o mesmo motor do Safari.",
      "Usuários relataram uma queda na qualidade de busca do DuckDuckGo, citando spam de IA e links irrelevantes de negócios locais, o que levou alguns a mudar para alternativas como Brave Search e Kagi.",
      "Engenheiros corajosos estão trabalhando ativamente na resolução de problemas de captcha, destacando melhorias contínuas em motores de busca alternativos."
    ],
    "points": 142,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1724975007
  },
  {
    "id": 41396501,
    "title": "Visite Bletchley Park",
    "originLink": "https://bletchleypark.org.uk/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41396501",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Bletchley Park oferece exposições históricas sobre a vida durante a Segunda Guerra Mundial e a decodificação de códigos, com foco nos aspectos humanos e de processo.",
      "As extensas coleções do Museu Nacional de Computação, localizado no mesmo local, incluem réplicas dos computadores Bombe e Colossus.",
      "Os ingressos para Bletchley Park são válidos por 12 meses, permitindo várias visitas."
    ],
    "points": 140,
    "commentCount": 65,
    "retryCount": 0,
    "time": 1724975185
  },
  {
    "id": 41397679,
    "title": "Rust: A Sintaxe Feia (2023)",
    "originLink": "https://matklad.github.io/2023/01/26/rusts-ugly-syntax.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41397679",
    "commentBody": "",
    "originSummary": [
      "A postagem discute o equívoco comum de que a sintaxe do Rust é o principal problema, enquanto o verdadeiro desafio está em sua semântica.",
      "Ele fornece vários estilos de sintaxe (Rs++, Rhodes, RhodesScript, Rattlesnake, CrabML) para ilustrar como a semântica do Rust pode ser simplificada.",
      "Os posts sugerem várias mudanças na função da biblioteca padrão do Rust para torná-la mais amigável ao usuário, incluindo a remoção de funções aninhadas, restrições e a simplificação do tratamento de erros."
    ],
    "commentSummary": [
      "O artigo discute a complexidade e os problemas de legibilidade na sintaxe do Rust, especialmente ao lidar com tipos genéricos e marcadores de tempo de vida.",
      "Os exemplos fornecidos incluem o uso de funções assíncronas em traits, o que pode resultar em código complicado devido à combinação de tempos de vida e limites de tipos.",
      "Os debates destacam opiniões divergentes sobre as escolhas de sintaxe do Rust, como o uso da aspa simples (') para tempos de vida, e se palavras-chave mais verbosas melhorariam a legibilidade do código."
    ],
    "points": 139,
    "commentCount": 131,
    "retryCount": 0,
    "time": 1724991354
  },
  {
    "id": 41397498,
    "title": "Open Source Twitch para Desenvolvedores",
    "originLink": "https://github.com/algora-io/tv",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41397498",
    "commentBody": "",
    "originSummary": [
      "Algora TV apresenta um novo recurso chamado Livestream Billboards, permitindo que os desenvolvedores ganhem dinheiro com anúncios em vídeo durante transmissões ao vivo.",
      "Configuração requer Elixir, Erlang/OTP, PostgreSQL, FFmpeg e OBS Studio, com etapas detalhadas fornecidas para a inicialização do projeto e configuração do banco de dados.",
      "As arquiteturas envolvem streamers usando Fly (um aplicativo Elixir) e servidores RTMP, com armazenamento e entrega de mídia gerenciados pelo Tigris, e o serviço é distribuído sob a Licença AGPLv3."
    ],
    "commentSummary": [
      "Algora é uma plataforma de transmissão ao vivo de código aberto para desenvolvedores, que suporta multistreaming para plataformas como Twitch, YouTube e X, e agrega comentários ao vivo.",
      "Construído usando Elixir para produtividade e tolerância a falhas, o Algora aproveita o Phoenix LiveView e o OTP para lidar com pipelines de streaming complexos e o BEAM clustering para baixa latência.",
      "A manutenção do projeto é feita por um desenvolvedor solo que está buscando contribuições e feedback, com recompensas disponíveis para questões prioritárias."
    ],
    "points": 119,
    "commentCount": 33,
    "retryCount": 0,
    "time": 1724988507
  },
  {
    "id": 41395591,
    "title": "Já usou o Google Chrome no modo de navegação anônima? Você pode ter direito a até $5 mil",
    "originLink": "https://bivens.plaintip.com/index.php/google-incognito/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41395591",
    "commentBody": "",
    "originSummary": [
      "Google está enfrentando acusações de enganar os usuários sobre a privacidade do seu modo Incognito, potencialmente dando direito aos usuários a até $5.000 em compensação por violações de privacidade.",
      "A ação judicial alega que o Google rastreou atividades, vendeu dados pessoais e enganou os usuários sobre a privacidade do modo Incógnito entre 2016-2023.",
      "Os critérios de elegibilidade incluem usar o modo de navegação anônima durante o período especificado, esperar privacidade, nem sempre consentir com o rastreamento, ter mais de 18 anos e ser residente dos EUA."
    ],
    "commentSummary": [
      "Usuários do modo anônimo do Google Chrome podem ser elegíveis para até $5.000, mas nenhum acordo foi alcançado ainda.",
      "Processo alega que o nome e o ícone do modo de navegação anônima são enganosos, sugerindo anonimato total, apesar dos avisos de que ele não oculta a atividade de sites, empregadores ou provedores de serviços de internet (ISPs).",
      "A questão gerou discussões sobre alfabetização tecnológica e expectativas dos usuários, com riscos potenciais para aqueles que se juntarem ao processo, incluindo possíveis custos se o caso for perdido."
    ],
    "points": 112,
    "commentCount": 113,
    "retryCount": 0,
    "time": 1724967884
  }
]
