[
  {
    "title": "Heroes of the Storm fans are excited: More than a year after ...",
    "originLink": "https://www.pcgamer.com/heroes-of-the-storm-fans-are-excited-more-than-a-year-after-blizzard-ended-development-a-new-patch-has-appeared-on-the-ptr/",
    "originBody": "Skip to main content THE GLOBAL AUTHORITY ON PC GAMES SUBSCRIBE US Edition News Reviews Hardware Best Of Magazine The Top 100 Forum More POPULAR CS2 Diablo 4 Top 100 Starfield Cities: Skylines 2 When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. News MOBA Heroes Of The Storm Heroes of the Storm fans are excited: More than a year after Blizzard ended development, a new patch has appeared on the PTR By Andy Chalk published 6 days ago There's no new content in the surprise new HotS update, but it fixes an awful lot of bugs. COMMENTS (Image credit: Blizzard) More than a year after Blizzard did an Old Yeller to Heroes of the Storm—\"the only good MOBA\" in the eyes of our weekend editor Jody Macgregor—a new patch has appeared on the public test realm, and it's got some fans hopeful for more to come. The patch is a beefy one, but entirely a fixer-upper: There are some UI changes, a handful of balance tweaks, and a big pile of bug fixes. Blizzard thanked players \"for providing insight and feedback for these changes,\" and asked that anyone who runs into a bug during PTR testing report them on the appropriate forum. The new update is in keeping with what Blizzard committed to when it formally ended Heroes of the Storm development. \"Moving forward we will support Heroes in a manner similar to our other longstanding games, StarCraft and StarCraft II\", it said at the time. \"In the future, we'll continue seasonal rolls and hero rotations, and while the in-game shop will remain operational there are no plans for new for-purchase content to be added. Future patches will primarily focus on client sustainability and bug fixing, with balance updates coming as needed.\" Sponsored Links Play this game for 1 minute and see why everyone is addicted. Raid Shadow Legends Despite that, there is hope born anew amongst the diehard fanbase, fuelled not just by the surprise arrival of a new patch but also Microsoft's acquisition of Activision Blizzard. Microsoft Gaming CEO Phil Spencer has previously expressed enthusiasm for reviving some of the company's old classics, and there's hope that Heroes of the Storm will be among them. RECOMMENDED VIDEOS FOR YOU... \"I hope they peep over to [StarCraft 2] and realize Blizz nerds are a hardy bunch and can survive content droughts and flourish with a drop of content,\" redditor fourtyonexx wrote. \"Also give us arcade mode wtf, HotS runs off of the SC2 engine, so it’s easy to just give us arcade mode smhhhhh.\" \"I hope they are like 'League of Legends, Dota2....we have our own MOBA too, lets start that back up',\" GrumpyKitten514 added. \"HOTS is/was one of my favorite games to play. I might just reinstall it.\" Similar sentiments are being shared on Blizzard's own Heroes of the Storm forums. \"That’s A LOT of fixes for a game that’s in maintenance mode,\" Ephemiel wrote. \"It’s absolutely getting re-launched somewhere, perhaps Steam since they already added Overwatch 2 and Diablo 4.\" And of course there's a meme: (Image credit: Gardomirror (Reddit)) Now, I don't want to be the guy to crush a dream, and anything is possible, especially with Microsoft now calling the shots. But I think it's a very long shot indeed: Heroes of the Storm fans are obviously dedicated but they're also, with all due respect, small in number—and as GrumpyKitten514 indirectly noted, the MOBA genre is already dominated by LoL and Dota. There's very little space for Heroes of the Storm to muscle into, even if active development resumed. So, could Heroes of the Storm suddenly spring back to full and vigorous life? Sure, absolutely. But will it? Sorry to say, folk, but no, I don't think so. The full Heroes of the Storm patch notes are up at blizzard.com. PC Gamer Newsletter Sign up to get the best content of the week, and great gaming deals, as picked by the editors. Contact me with news and offers from other Future brands Receive email from us on behalf of our trusted partners or sponsors By submitting your information you agree to the Terms & Conditions and Privacy Policy and are aged 16 or over. Andy Chalk Andy has been gaming on PCs from the very beginning, starting as a youngster with text adventures and primitive action games on a cassette-based TRS80. From there he graduated to the glory days of Sierra Online adventures and Microprose sims, ran a local BBS, learned how to build PCs, and developed a longstanding love of RPGs, immersive sims, and shooters. He began writing videogame news in 2007 for The Escapist and somehow managed to avoid getting fired until 2014, when he joined the storied ranks of PC Gamer. He covers all aspects of the industry, from new game announcements and patch notes to legal disputes, Twitch beefs, esports, and Henry Cavill. Lots of Henry Cavill. MORE NEWS 'This is only the beginning': Metal Gear Solid fans lose their minds as David Hayter returns to voice Solid Snake in a new teaser Bungie lays off employees as Destiny 2: The Final Shape is reportedly delayed to June LATEST For those who love optimizing PC games as much as playing them, Modern Warfare 3 promises more than 500 settings to fiddle with SEE MORE LATEST ► SEE COMMENTS The best free VPN of 2023 We help you pick the best free VPN service in 2023, explaining the pros, cons, and risks. Avoid VPN scams and get a free VPN for streaming Netflix. Play this game for 1 minute and see why everyone is addicted. Raid Shadow LegendsSponsored Here Are 29 of the Coolest Gifts for This 2023 29 Insanely Cool Gadgets You'll Regret Not Getting Before They Sell Out Cool GiftsSponsored Click Here No More Free Returns? Amazon Releases New Fees Americans, you'll want to check this out ASAP Online Shopping ToolsSponsored MOST POPULAR Windows 11 has been shrunk to a 3.3GB install size but even the developer believes you should think twice before installing it By Andy EdserOctober 30, 2023 In Call of Duty's most infamous mission, Infinity Ward was 'basically just trying to think of the most atrocious things that could happen' By Rich StantonOctober 30, 2023 If Cities: Skylines 2 didn't float your boat, Anno 1800 is free for a week By Dave JonesOctober 30, 2023 New leak suggests AMD's Zen 4 APUs are close to release but won't deliver the gaming performance we were hoping for By Andy EdserOctober 30, 2023 D&D's latest physical book has been delayed due to bad luck of the draw: 'The defect rate is too high. I cannot in good conscience ship this stock' By Harvey RandallOctober 30, 2023 Confirmed RTX 4080 Super GPU means at best you're getting just 5.3% more Ada for the money By Nick EvansonOctober 30, 2023 Asus' Dual RTX 4060 Ti with an integrated M.2 SSD slot answers a question few thought to ask By Chris SzewczykOctober 30, 2023 Wordle today: Hint and answer #863 for Monday, October 30 By Kerry BrunskillOctober 30, 2023 Your new co-op survival horror obsession is about being underpaid and overworked space scavengers By Jonathan BoldingOctober 29, 2023 Here's a cute, free economic real-time strategy about colonizing and defending a solar system By Jonathan BoldingOctober 29, 2023 Enter an abandoned amusement park to solve a horror mystery in this upcoming bit of indie psychological horror By Jonathan BoldingOctober 29, 2023 LOAD COMMENTS Advertisement RECOMMENDED Avatar: Frontiers of Pandora is really hoping you'll show up already loving Avatar Mesh shaders explained: What are they, what's the big fuss, and why are they only in Alan Wake 2? Advertisement HARDWARE BUYING GUIDES LATEST GAME REVIEWS 1 The best NBN plans for gaming in 2023 2 Best OLED gaming monitors in 2023 3 Best gaming PC builds: budget, mid-range and high-end recommendations 4 Best graphics cards in 2023: GPUs for every budget 5 Best gaming chairs in 2023 Advertisement PC Gamer is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. About Us Contact Future's experts Terms and conditions Privacy policy Cookies policy Advertise with us Accessibility Statement Careers Do not sell or share my personal information © Future US, Inc. Full 7th Floor, 130 West 42nd Street, New York, NY 10036.",
    "originSummary": [
      "More than a year after Blizzard halted development on \"Heroes of the Storm\", a new patch aimed at fixing existing issues has emerged on the public test realm, sparking hopes for more updates amongst fans.",
      "While no new content has been introduced in the patch, the game's fans are optimistic about a potential revamp, especially following Microsoft's acquisition of Activision Blizzard.",
      "However, the article suggests that a significant game update is unlikely due to the game's smaller fan base and the dominance of the MOBA (Multiplayer Online Battle Arena) genre by larger games like \"League of Legends\" and \"Dota 2\"."
    ],
    "commentBody": "",
    "commentSummary": [
      "The Indian government is contemplating a partnership with the U.S. to acquire 80-100 Predator C Avenger aircraft, which would enhance India's defence capabilities.",
      "The potential acquisition includes armed drone systems along with advanced surveillance technology, boosting India's spying and attack potential.",
      "This strategy is in response to escalating tensions with China over territorial disputes in the Himalayas, with India preparing armaments for these stealthy, jet-powered drones with precision-guided bombs and missiles."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1698844681509
  },
  {
    "title": "How to Rate Games on IGN",
    "originLink": "https://nordic.ign.com/duplicate-baldurs-gate-3/74833/opinion/how-to-rate-games-on-ign",
    "originBody": "Nordic Home Reviews Videos Features News Previews Movies & TV More HOME More About IGN Nordic Contact Advertise Press Privacy Policy User agreement Cookies RSS IGN Nordic is operated under license by eMense Change Region United States United Kingdom Australia Africa Adria Benelux / Dutch Brazil China / 中国 Czechia / Slovakia France Germany Greece / Ελλάδα Hungary India Israel Italy / Italia Japan / 日本 Korea / 한국 Latin America Middle East - English Middle East - الأوسطالشرق Nordic Poland Portugal Southeast Asia Spain / España Turkey / Türkiye world.ign.com Login Register BALDUR'S GATE III How to Rate Games on IGN Submit your own scores. + BY JOHN DAVISON Posted Oct. 31, 2023, 10:55 p.m. While it’s not quite over yet, 2023 has certainly been an incredible year for game releases. Whether we look back on it as one of the greatest years in gaming history remains to be seen, but there’s a good chance we’ll be talking about The Legend of Zelda: Tears of the Kingdom, Baldur’s Gate 3, Metroid Prime Remastered, Alan Wake 2, Diablo IV, Street Fighter 6, and the Resident Evil 4 remake for years to come. We’ve given four games a 10 this year, and a further 27 have received a nine, so that puts it up there alongside great moments like 2004 (Halo 2, Half-Life 2, Metal Gear Solid 3: Snake Eater, GTA: San Andreas) or 1998 (The Legend of Zelda: Ocarina of Time, Half-Life, Starcraft, Resident Evil 2, Metal Gear Solid). You may not always agree with our reviews (believe me, I'm aware of this), so some additional perspective from other players can be useful. Earlier this year we rolled out a way for you to add your scores to the games in our database alongside our own as another element to help provide as much guidance as we can. You may not always agree with our reviews (believe me, I'm aware of this), so some additional perspective from other players can be useful. If you’re signed-in as a registered IGN user, when you go to any of our game pages – like, say, Baldur’s Gate 3 – you can hit the “Rate Game” button and there’s then a very quick multi-part process that you can zip through on either your phone or desktop. As you can see in the screenshots below, the most important part comes first: simply give the game a rating on a scale of 1-10. If you’re managing your game collection through IGN Playlist the next tab will ask you to enter what platform you played it on. If you’re new to Playlist, it’ll pause here briefly and ask you what your current status with the game is. Are you actively playing it? Are you taking a break? Did you beat it? Or have you quit? (No one ever seems to pick that last option. Never surrender, right?) Then the system will ask you to give a thumbs up or down to specific aspects of the game – do you think the characters are great? Do you like the graphics? Does the balance suck? You don’t have to answer all of these, just give a thumbs up or down to the elements of the game that really stood out to you either positively or negatively. Finally, if you want to write up a brief review you can enter up to 2,000 characters sharing your thoughts on the game, but you can leave this blank if you don’t have anything further to say. Hit “next” from here, and it’ll give you a preview of your choices and then you can post. Once you’ve submitted your review, it contributes to a few areas of IGN. First, all user reviews aggregate up to the main game page so it’ll appear in the main infobox there. Potentially (and hopefully, eventually) every game in our database could have an audience score. Secondly, for the really good stuff, these scores also drive our Icon Awards list, which is an entirely user-review driven greatest games of all time list. The greater the volume of high user scores a game receives, the further it moves up the list. Currently the top of this list is dominated by Zelda. The number one game is The Legend of Zelda: Tears of the Kingdom, followed by Red Dead Redemption 2, The Legend of Zelda: Ocarina of Time, Persona 5: Royal, and then The Legend of Zelda: Breath of the Wild. If, like me, you’re grazing through that list and wondering where Baldur’s Gate 3 is, or why my beloved Elder Scrolls: Skyrim is somehow only number 30, then the best course of action is to rate the games that you really love. Our goal with all of this stuff stems from our belief in the value of reviews as broad guidance for helping people choose what to play. Our hope for our game reviews is that they provide as much context as possible so you have plenty to go on. This includes ensuring our video reviews have as much illustrative gameplay footage as possible, that our screenshots show you exactly what the game looks like, and that we provide performance reviews where we can to show how things run on different hardware. We also try to ensure that we’re as transparent as possible about our review process, and that includes regular updates from our director of reviews, Dan Stapleton, about the challenges reviewers face. Since we launched IGN Playlist last year, we also include embedded lists to provide additional context about both the franchise the game is from (like where Super Mario Wonder fits into the bigger picture of Mario games) or the reviewer’s specific tastes (lists of their favorite games, or favorites within the genre of the reviewed game) so you can get a feel for what makes them tick. If you’ve not seen a Playlist before, I’ve embedded one below of all our best-reviewed games this year as an example. Supplementing all of this with a tool where you can share your scores and opinions on games too provides another important piece of context that we can include as part of our database, and incorporate into our other content. Maybe you can use this Playlist as a jumping off point to review some games. John Davison is IGN's publisher and editorial lead, and has been writing about games and entertainment for more than 30 years. He really does like Skyrim quite a lot. When you buy something from this article, IGN Nordic might get a part of the revenue. In This Article Baldur's Gate III LARIAN STUDIOS PLATFORM More Like This 5 days, 22 hours Ex-Skyrim Developer Explains the Key Difference Between Bethesda Games and Baldur’s Gate 3 1 week, 5 days Josh Sawyer Would Make Pillars of Eternity 3 If Given a Baldur's Gate 3-Sized Budget 3 weeks, 2 days Genius Baldur’s Gate 3 Player Uses Sheep Magic to Recruit the Evil Minthara During Good Playthrough 3 weeks, 4 days Baldur’s Gate 3 Hotfix 9 Out Now — Here’s What it Does Come Play Mortal Kombat 1 With Us! Comments IGN Nordic is operated under license by eMense",
    "originSummary": [
      "IGN Nordic has announced key 2023 game releases, including The Legend of Zelda: Tears of the Kingdom, Baldur’s Gate 3, Metroid Prime Remastered, Alan Wake 2, Diablo IV, Street Fighter 6, and the Resident Evil 4 remake.",
      "They have implemented a feature that allows registered users to score games, this can shape aggregate user scores and possibly impact IGN's Icon Awards list, a ranking driven by user reviews.",
      "IGN also reaffirmed its pledge to providing transparent reviews to assist users in game selection."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1698844681509
  },
  {
    "title": "How to rate games on IGN",
    "originLink": "https://worldtimetodays.com/how-to-rate-games-on-ign/",
    "originBody": "Wednesday, November 1 2023 Breaking News Pancreatic Cancer, Ken Jennings Video – Donate – TVLine Search for BREAKING NEWS NEWS LOCAL BUSINESS ENTERTAINMENT LIFESTYLE SPORTS TECHNOLOGY Home/Technology/How to rate games on IGN How to rate games on IGN Chrissy Callahan9 hours ago 54 Facebook X LinkedIn Tumblr Pinterest Reddit While it’s not quite over yet, 2023 has certainly been an incredible year for game releases. Whether we’ll look back on this year as one of the greatest years in gaming history remains to be seen, but there’s a good chance we’ll be talking about The Legend of Zelda: Tears of the Kingdom, Baldur’s Gate 3, Metroid Prime Remastered and Alan Wake 2 , Diablo IV, Street Fighter 6 and the Resident Evil 4 remake for years to come. We gave four games a 10 this year, and another 27 received a nine, joining great moments like 2004 (Halo 2, Half-Life 2, Metal Gear Solid 3: Snake Eater, GTA: San Andreas) and 1998 (The Legend of Zelda: Ocarina of Time, Half-Life, Starcraft, Resident Evil 2, Metal Gear Solid). You may not always agree with our reviews (believe me, I know that), so an additional perspective from other players can be helpful. Earlier this year we introduced a way for you to add your scores to the games in our database along with our own. This is another element to give you as much guidance as possible. You may not always agree with our reviews (believe me, I know that), so an additional perspective from other players can be helpful. If you are logged in as a registered IGN user and visit one of our gaming sites – for example Baldur’s Gate 3 – You can click on the “Rate Game” button and then there is a very quick multi-part process that you can go through on either your phone or desktop. As you can see in the screenshots below, first things first: simply give the game a rating on a scale of 1-10. If you manage your game collection through IGN Playlist, the next tab will ask you to enter the platform you played it on. If you’re new to Playlist, it will pause here and ask you what your current status is with the game. Are you actively playing it? Are you taking a break? Did you make it? Or have you stopped? (No one ever seems to choose that last option. Never give up, right?) Then the system asks you to give certain aspects of the game a thumbs up or down – do you think the characters are great? Do you like the graphics? Is the balance bad? You don’t have to answer all of these questions. Simply give a thumbs up or down to the elements of the game that stood out to you positively or negatively. Finally, if you want to write a short review, you can enter up to 2,000 characters expressing your thoughts on the game. However, you can leave this field blank if you have nothing else to say. Click here on “Continue”. You’ll get a preview of your selection and then post. Once you submit your review, it contributes to some areas of IGN. First, all user reviews are summarized on the main game page so that they appear in the main info box there. Potentially (and hopefully eventually) every game in our database could have an audience score. Secondly, when it comes to the really good stuff, these results are also what drive us Icon Awards List, which is exclusively a list of the best games of all time, fully rated by users. The more high user ratings a game receives, the further it moves up the list. Currently, the top of this list is dominated by Zelda. The number one game is The Legend of Zelda: Tears of the Kingdom, followed by Red Dead Redemption 2, The Legend of Zelda: Ocarina of Time, Persona 5: Royal and then The Legend of Zelda: Breath of the Wild. If you’re like me, scrolling through this list and wondering where Baldur’s Gate 3 is or why my beloved Elder Scrolls: Skyrim somehow only sits at number 30, then the best course of action is to rank the games you really love. Our goal in all of this is based on our belief in the value of reviews as a comprehensive guide to help people decide what to play. We hope our game reviews provide as much context as possible to give you plenty to work with. This includes ensuring that our video reviews contain as much graphic gameplay footage as possible, that our screenshots show you exactly what the game looks like, and that we provide performance reviews where possible to show how it runs on different hardware. We also try to ensure that our verification process is as transparent as possible regular updates from our Director of Reviews, Dan Stapleton, about the challenges reviewers face. Since we launched the IGN Playlist last year, we’ve also been adding embedded lists to provide additional context to both the franchise the game comes from (e.g. where Super Mario Wonder fits into the bigger picture of Mario games). to provide the reviewer’s specific preferences (lists of their favorite games or favorites within the genre of the game being reviewed) so you can get a feel for what drives them. If you’ve never seen a playlist before, I’ve embedded one of our top-rated games this year below as an example. Complementing all of this with a tool that also allows you to share your results and opinions on games provides another important context that we can add to our database and integrate into our other content. Maybe you can use this playlist as a starting point for reviewing some games. Top Rated Games 2023 Here’s our running list of the best games and expansions rated by IGN editors this year. John Davison is IGN’s publisher and editorial director and has been writing about games and entertainment for more than 30 years. He really likes Skyrim. Share Facebook X LinkedIn Tumblr Pinterest Reddit Chrissy Callahan Chrissy Callahan is a Worldtimetodays U.S. News Reporter based in Canada. His focus is on U.S. politics and the environment. He has covered climate change extensively, as well as healthcare and crime. Chrissy Callahan joined Worldtimetodays in 2023 from the Daily Express and previously worked for Chemist and Druggist and the Jewish Chronicle. He is a graduate of Cambridge University. Languages: English. You can get in touch with me by emailing: ChrissyCallahan@worldtimetodays.com. Towie's Amber Turner shows Dan Edgar what he's missing as she strips down to a bikini Can a smart meter really help Britain stop relying on imported gas to heat our homes? Related Articles Star Ocean: The Second Story R Review – Back to the Future 30 mins ago Lies of P sequel confirmed, first DLC and game update announced 1 hour ago Vampire: The Masquerade – Bloodlines 2 will feature a fully voiced cyberpunk-esque protagonist 2 hours ago Worldtimetodays.com © Copyright 2023, All Rights Reserved Home About US Contact US Privacy Policy Terms of Service Sitemap RSS Follow Back to top button",
    "originSummary": [
      "IGN has launched a new feature enabling users to rate and review games on its platform, ratings are based on a 1-to-10 scale, and individual platforms and specific gaming features can be assessed.",
      "User reviews are compiled on the game's main page and also contribute to IGN's Icon Awards List, with 'The Legend of Zelda: Tears of the Kingdom' currently topping the list.",
      "The objective of these user reviews is to offer a comprehensive guide to assist users in selecting which games to play."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1698844681509
  },
  {
    "title": "10 Retro Games With Vibrant Competitive Communities",
    "originLink": "https://www.cbr.com/retro-games-with-esports-scenes-today/",
    "originBody": "Newsletter Log in Trending Exclusives Dynamic Duos Podcast Ahsoka Aquaman and the Lost Kingdom Loki The Marvels Marvel's Spider-Man 2 FRANCHISES COMICS ANIME MOVIES TV GAMES MORE Join Our Team Newsletter Advertise With Us Log In Write For Us Home Contact Us Terms Privacy Copyright About Us Press Kit Find a Comic Shop Fact Checking Policy Corrections Policy Ethics Policy Ownership Policy Do Not Sell My Personal Information Copyright © 2023 www.cbr.com AD AD AD AD AD AD Home Games 10 Retro Games with Active Competitive Scenes Worth Watching BY JOEY COLEMAN-ZAITZEFF PUBLISHED 6 DAYS AGO Titles like Tetris, StarCraft, and CounterStrike 1.6 may feel like relics of the past, but these games actually have thriving competitive communities. Gamers return to beloved retro classics for an abundance of reasons. Nostalgia transports fans to an earlier time while playing retro games, and trying out an old series today is an excellent way to appreciate classic titles. Revisiting retro games brings pieces of media history to the present, and their age gives them added meaning in the context of newer franchises. Fans of certain retro competitive games have been keeping the titles alive for decades. Fighting game classics and genre-defining strategy games alike maintain an active community of competitive play. Despite retro competitive games' age, players continue to discover new tactics and strategies. 10 Dated Nintendo Games That Are Still Fun 10 Age of Empires II Release Date 1999 Developer Ensemble Studios Publisher Microsoft Age of Empires II pits players against each other in medieval real-time strategy combat. Competitors start their empire as a few workers in the Dark Age and transform it into a thriving kingdom in the Empire Age. Managing resources, buildings, and manpower is essential for building an army powerful enough to conquer opponents. Age of Empires II allows players to choose from 45 different civilizations with their own unique bonuses, technologies, and units. Players can go head-to-head in 1v1s or team up in matches with up to 8 players in 4v4. Though the Age of Empires series has had numerous entries, Age of Empires II received an HD remake in 2012 as well as a remaster in the form of Age of Empires II: Definitive Edition in 2019. 9 Counter-Strike 1.6 Release Date 2000 Developer Valve Publisher Valve With Counter-Strike 2 just released, it may seem odd that the original Counter-Strike still has a competitive scene. Diehard fans continue to play Counter-Strike version 1.6, strafing and sneaking around classic maps like Dust and Inferno. Though casual play is almost non-existent, small teams around the globe maintain fan servers and set up competitions. Counter-Strike's competitive popularity is primarily due to its high skill ceiling and ability to run on limited hardware. Counter-Strike 1.6 can now run on basic computers and setting up a server for play is relatively easy. Because the game is now 23 years old, tips and guides on how to play are widely available. 8 Super Smash Bros. Melee Release Date 2001 Developer HAL Laboratories Publisher Nintendo Scary Retro Nintendo Levels To Revisit This Halloween Super Smash Bros. Melee, the sequel to the original Super Smash Bros., features quick and explosive combat with a roster filled with Nintendo's most iconic characters, like Link and Mario. Rather than depleting the opponent's health bar, attacks build up a damage percentage. The higher the damage percentage, the farther a character will fly when hit. The goal of each match is to knock opponents out of the stage. Since its release, grassroots Super Smash Bros. Melee tournaments have been a staple of the fighting game community. Though titles in the Smash Bros. series are commonly considered party games, there is a wealth of techniques and strategies to develop in competitive play. 7 StarCraft Release Date 1998 Developer Blizzard Entertainment Publisher Blizzard Entertainment The original StarCraft is legendary in the competitive gaming community. To this day, StarCraft is known for its finely tuned balance and its high level of competitive play. Players fight as one of three races, the technologically advanced Protoss, the hordes of insectoid Zerg, or the versatile human Terrans. Quick thinking and strategic planning must both be employed to overcome rival strategists. StarCraft was most popular in South Korea and much of the game's meta stems from the strategies developed by competitive Korean players. Today, StarCraft II reigns as the king of strategy games in eSports, but fans are still mastering the micromanagement of the first in the series. The original StarCraft is now free for those who want to experience one of the first eSports. 6 Heroes of Might and Magic III Release Date 1999 Developer New World Computing Publisher The 3DO Company Heroes of Might and Magic III remains one of the most expansive turn-based strategy games. The gameplay is split into three parts: Town development where players purchase buildings and combat units, map exploration where players send heroes to gather resources and engage in combat and tactical hex-based combat sequences where players command their armies against AI monsters or rival armies. Mastering all three sections allows the player to quickly build powerful armies and capture more towns. Heroes of Might and Magic III was a pioneer of online gaming, and--though the built-in online mechanics have not aged well--fan mods have kept the title alive since its release. The first-ever Heroes of Might and Magic III world tournament was held in January 2022 and the strategy classic maintains a substantial following on Twitch. Twelve differing factions and an endless number of maps ensure that every match plays out in its own unique way. 5 Pokémon Red, Blue and Yellow Release Date 1998 Developer Game Freak Publisher Nintendo 10 Things Pokemon Red And Blue Still Do Better Than The Rest Of The Series While the world of Pokémon has become ubiquitous, no iteration is better known than the original 151 Pokémon of Gen 1. Fans constantly debate the merits of the Pokémon sequels, reminiscing about the great creature design or the unique gameplay additions of a specific generation. Gen 1 has the most simplified mechanics, limiting the Pokémon pool, movesets, and types to those in the original entries to the series. The advent of the free web app Pokémon Showdown has made playing Gen 1 Pokémon easier than ever. Pokémon Showdown allows players to select and customize their teams automatically, foregoing the capturing and training in mainline Pokémon titles. Nostalgic fans can relive their dreams of being a Kanto Pokémon trainer while getting to know the mechanics of competitive Pokémon. 4 Super Mario Kart Release Date 1992 Developer Nintendo EAD Publisher Nintendo Super Mario spinoffs have truly taken lives of their own and the Mario Kart series is no exception. Super Mario Kart contains all the core DNA of the Mario Kart series: a roster of eight Mario characters race on one of 20 tracks, using battle items and driving skills to get ahead. The game's graphics used the SNES's Mode 7 to simulate 3D racing before polygonal graphics were widely available. The Super Mario Kart community continues to hold championships, not only for the standard racing mode but also for the game's item-based battle mode. For fans interested in the highest levels of play, online leaderboards post the world's fastest times for each track. Both types of competitive play demand intimate knowledge of every track and the game's retro driving controls. 3 The Legend of Zelda: A Link to the Past Release Date 1991 Developer Nintendo EAD Publisher Nintendo Best Storylines In The Legend Of Zelda Series, Ranked Fans adore The Legend of Zelda: A Link to the Past, not only for its lavish design or innovative mechanics but also for the way it captures the heart of the Zelda series. A Link to the Past blends the classic magical adventure of Zelda with wonderful pacing that thoughtfully introduces new mechanics and areas. The game also features the two parallel overworlds of the Light World and the Dark World, almost doubling the size of the initial map. The organization of dual overworlds, a plethora of dungeons, and numerous unlockable items make A Link to the Past a perfect candidate for a logic randomizer. The randomizer mixes up the location of items and randomly reorders the events of the game. In randomizer competitions, players try to complete the game the fastest through optimal gameplay and knowledge of the game's world. 2 Street Fighter II Turbo: Hyper Fighting Release Date 1992 Developer Capcom Publisher Capcom Even 30 years after the first Street Fighter game, competitive fighting game players are still returning to the smash arcade hit, Street Fighter II Turbo: Hyper Fighting. Street Fighter II introduced move combos and a roster of unique playable characters, tenets that would become central to the fighting game genre. The original arcade controls used an eight-directional joystick and six attack buttons, controls that can be replicated with a Fight Stick or mapped onto conventional controllers. The introduction of Turbo increased game speed and allowed players to attack and react quickly. This change kicked the competitive capacity of Street Fighter II into high gear because of the precise timing needed for combos and special moves. Fans and critics list Street Fighter II as one of the best games of all time, and it continues to be a standby at fighting game tournaments. 1 Tetris (NES) Release Date 1989 Developer Nintendo R&D1 (based on the original game created by Alexey Pajitnov) Publisher Nintendo Tetris remains one of the most iconic video games ever made due to its approachable gameplay. The classic real-time puzzle game keeps it simple: blocks of different shapes fall from the top of the screen and disappear when they are placed into a completed row. The speed at which blocks fall gets faster over time, and the game ends when the stack of blocks reaches the top of the screen, leaving players with their score based on how many rows they completed. Tournaments such as the Classic Tetris World Championship have been the source of many strategies and techniques for optimizing Tetris. One such technique called \"rolling,\" where players tap the back of the controller into their fingers, has redefined the game. The current world record for NES Tetris is 6.4 million points. Subscribe To Our Newsletter! By subscribing, you agree to our Privacy Policy and may receive occasional deal communications; you can unsubscribe anytime. Share Tweet Share Share Share Copy Email Link copied to clipboard Related Topics GAMES RETRO GAMES VIDEO GAMES About The Author Joey Coleman-Zaitzeff (11 Articles Published) Joey is a writer and designer from Kentucky. When not cramming in time to read, draw, play video games, or replay said video games, they are spending time with their partner, running with their dog, or enjoying a lovely iced latte. They are currently working on animating handdrawn films and getting frustrated on camera on their weekly stream. POLL What is your preferred video streaming service for watching Animation content? Hulu Netflix Disney+ Amazon Prime Video Max See More TRENDING NOW Dr. Robotnik Goes Clean-Shaven for First Time in Sonic the Hedgehog History Marvel's Spider-Man 2 Director Knows MJ Is OP, Doesn't Care 10 Best Suits in Marvel's Spider-Man 2, Ranked by Style ✕ WATCH NEXT Play Video",
    "originSummary": [
      "Retro games such as Tetris, Street Fighter II Turbo, and Super Mario Kart still carry allure, with active competitive environments present for them.",
      "Players are perpetually discovering new methods and strategies in these games while gaining an understanding of their historical significance.",
      "Decades post their initial release, games like Age of Empires II, Counter-Strike 1.6, and Super Smash Bros. Melee maintain popularity, as do Pokemon Red, Blue, and Yellow, facilitated by platforms like Pokémon Showdown simplifying team set-ups and customization."
    ],
    "commentBody": "",
    "commentSummary": [
      "Scientific Games is introducing its new systems technology in Canada, in an agreement with SG and SGMS monopoly product portfolio.",
      "The company plans to use this new technology to launch a lottery gaming system with a focus on promoting responsible gambling.",
      "The technology will facilitate a slot system that will allow customers to monitor their gameplay and impose their own gaming limits."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1698844681509
  },
  {
    "title": "Speedway Motorsports taps Thor as RV partner",
    "originLink": "https://www.sportsbusinessjournal.com/Articles/2023/10/30/speedway-motorsports-thor-industries.aspx",
    "originBody": "Wednesday, November 1, 2023Sign In SUBSCRIBE Menu Media Tech Executive Transactions Marketing All Topics Print Daily EditionsNewslettersWeekly Issue 10.30.2023 MARKETING AND SPONSORSHIP Speedway Motorsports taps Thor as RV partner BY ADAM STERN 10.30.2023 Speedway Motorsports has filled its official RV partner category with a new sponsor, as the publicly traded Thor Industries will promote its various brands at the promoter’s NASCAR tracks across America. The agreement was announced this morning heading into the final week of the 2023 NASCAR season. The track owner, controlled by the Smith family, is leveraging the massive amount of people who camp on their grounds annually during event weeks on an overall 25,000 camping spots. The deal includes marketing rights at all of SM’s 10 tracks plus Circuit of the Americas, which SM promotes NASCAR races at but doesn’t own. Thor plans to run campground promotions and sweepstakes, and provide on-site RV support. Indiana-based Thor owns 20 RV manufacturer brands like Airstream, Starcraft and Highland Ridge. Thor is entering the deal at a time when it is trying to boost business in the U.S., where its revenue and profit were down this year versus last year. The company was founded in 1980 and went public in 1984. Its name is a combination of the first two letters of the last names of company founders Wade Thompson and Peter Busch Orthwein. PREVIOUS ESPN extends Mike Breen two more years NEXT Chelsea bans Star of David banner from stadium SPONSORED CONTENT ADDITIONAL SECTIONS Media Tech Executive Transactions Marketing International Data Franchises Esports Betting Colleges Facilities Events and Attractions Finance Labor and Agents Leagues Olympics Opinion People and Pop Culture Sports and Society PODCASTS SBJ Morning Buzzcast: November 1, 2023 November 1, 2023 The NCAA's social strategy to promote fall championships; More traction for volleyball; A-B's marketing roadmap for Bud Light and MLB Stands Up For Cancer. SBJ I Factor: Jon Niemuth October 10, 2023 SBJ I Factor presented by Allied Sports features an interview with Jon Niemuth, director of sports at Gensler. Niemuth, a longtime leader and innovator in architecture, is a member of Sports Business Journal’s Forty Under 40 class of 2006. He sat down with SBJ’s Abe Madkour to talk about his career path, what it takes to be successful, and how facilities have changed and will continue to evolve. SBJ I Factor is a monthly podcast offering interviews with executives who have been recipients of one of the magazine’s awards, such as Forty Under 40, Game Changers and others. SBJ Spotlight: Toledo's Strategic Plan September 7, 2023 SBJ TV Lisa Murray at Game Changers: ‘Just be the best that you can possibly be’ 4 MINS Pacers’ Ellis-Ward on being a Game Changer and the state of women’s sports 3 MINS Angel City's Uhrman: Biggest challenge for women’s sports is visibility 4 MINS You have 0 All Access articles remainingSUBSCRIBE TODAY Become an industry insider SUBSCRIBE NOW DAILY ISSUES October 31 October 30 October 27 October 26 October 25 October 24 October 23 October 20 October 19 October 18 WEEKLY ISSUE October 30 October 23 October 16 October 9 October 2 September 25 September 18 September 11 September 4 August 28 Digital Edition NEWSLETTERS Betting College Esports Football Marketing Media Power Up Tech Unpacks EDITIONS Morning Buzz Closing Bell Weekend Rap PODCASTS/TV All Podcasts Buzzcast Unpacks SBJ TV SBJ Spotlight SBJ I Factor Sports Media ALL TOPICS Media Tech Executive Transactions Marketing International Data Franchises Esports Betting Colleges Facilities Events and Attractions Finance Labor and Agents Leagues Olympics Opinion People and Pop Culture Sports and Society SPONSORED CONTENT All Sponsored Content EVENTS Event Calendar 2023 Media Innovators 2023 Dealmakers 2023 Intercollegiate Athletics Forum 2024 Tech Week 2024 SBA Tech Awards 2024 CAA World Congress of Sports 2024 4se 2024 Sports Business Awards 2024 Brand Innovation Summit 2024 Thought Leaders 2024 Thought Leaders Tech 2024 AXS DRIVE 2024 Forty Under 40 PROPERTIES On Campus SBJ Atlas SportTechie Newzoo Leaders in Sport COMPANY About Us Staff FAQ Contact Us Advertise Subscribe © 2023 Leaders Group. All rights reserved. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Leaders Group. Privacy Policy User Agreement Cookie Settings Ad Choices",
    "originSummary": [
      "Speedway Motorsports recognizes Thor Industries as its official RV partner, aiming to promote Thor's brands at Speedway's NASCAR tracks in the United States.",
      "The partnership grants Thor marketing rights at all 10 of Speedway's tracks and the Circuit of the Americas, where they will conduct campground promotions and offer on-site RV support.",
      "Thor Industries, known for owning 20 RV brand manufacturers like Airstream, Starcraft, and Highland Ridge, could potentially increase their brand visibility and consolidate their position in the RV market through this partnership."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1698844681509
  },
  {
    "title": "Shopify Rebellion head explains joining the LCS and ...",
    "originLink": "https://www.dexerto.com/league-of-legends/shopify-rebellion-head-explains-joining-the-lcs-and-partnering-with-moist-2350556/",
    "originBody": "Register Sign in Gaming Entertainment TV & Movies Esports Tech More Call of Duty Pokemon Apex Legends Overwatch Valorant League of Legends EA SPORTS FC Fortnite Starfield Destiny Counter-Strike 2 Diablo Baldur's Gate Cyberpunk 2077 Zelda GTA Roblox Genshin Impact Honkai Star Rail CS:GO Mortal Kombat Minecraft World of Warcraft Rainbow Six All ESPORTS LEAGUE OF LEGENDS Shopify Rebellion head explains joining the LCS and partnering with Moist Declan Mclaughlin ❘ Published: Oct 26, 2023, 03:05 ❘ Updated: Oct 26, 2023, 03:05 SHOPIFY One of the heads of Shopify Rebellion spoke to Dexerto about purchasing TSM’s LCS slot, partnering with Moist Moguls in Valorant and the future of esports. Keep Watching Jacksepticeye claims MrBeast RUINED YouTube! 00:00/00:49 Shopify Rebellion made back-to-back blockbuster announcements on September 20. The Canadian e-commerce company’s esports division revealed their purchase of TSM’s former LCS slot and also showcased their partnership with influencer-lead Moist Esports in Valorant. The esports side of the public company has been competing in titles since 2021 and has a presence in Valorant, Rocket League, DOTA 2, Starcraft and Halo. However, the organization has not had a presence in League of Legends and is a new face to an LCS crowd. Shopify Rebellion’s Esports Program Development Lead Dario ‘TLO’ Wünsch, spoke with Dexerto about entering the League of Legends space and how he plans to grow the brand in the LCS. TLO was a professional StarCraft player for Team Liquid, and he’s chosen to take his esports experience to Shopify Rebellion to try and create the next big esports org. And, considering that they’re entering the LCS in 2024 and working with Moist to take over the Valorant world, they’re kicking things into the next gear. Shopify Rebellion’s taking a chance on the LCS The organization is replacing arguably the most popular and one of the founding teams in the North American league, TSM. TLO told Dexerto that he is hoping to introduce the brand to the new esports community over time. “I think the scene is more focused on their own game, a little bit less cross-interest to other scenes. But certainly, over time that’s definitely the hope that this will create and garner more attention and that people more people will hopefully like what we’re doing,” the former StarCraft pro said. RELATED: Best free games to download & play on PC, PS5, Xbox, or Nintendo Switch We'll see you at the #LCS Arena in 2024. pic.twitter.com/9ZZAUmMEBA — Shopify Rebellion (@ShopifyRebels) September 20, 2023 Unlike some other recent transactions in the League of Legends franchise system, TSM and Shopify have not disclosed how much the LCS slot costs. However, reports put the sale price at about $10 million, which is about as much money TSM spent to join the league back in 2018. While this and other metrics, like declining viewership, have scared off some of the business around esports, TLO isn’t convinced the LCS is a dying entity. “We believe in the long term, potential and health of the property and that the way it’s perceived right now, and the market value that exists, is not representative of where we will be over the next decade. Generally, we believe in Riot Games’ ecosystems very strongly,” he said. Shopify is already a mainstay in the Game Changers and Tier 2 level in Riot’s other major esport, Valorant. TLO also explained that this feels like the right time to jump into the esport for an org that isn’t too worried about next quarter’s earnings. While some orgs in the LCS are laying off people in the short term, Shopify can look ahead to 2028 and beyond. That doesn’t mean Shopify won’t try to be competitive right off the bat, or try to import expensive players in an attempt to make major tournaments quickly. However, it does mean that they have time to think through decisions longer than orgs that are strapped for cash and downsizing. SHOPIFY REBELLION Shopify Rebellion’s Halo team a the Fort Worth Major. “I feel sometimes teams and orgs get a little bit carried away by only pursuing a title and only being happy with a title. Obviously, that is the ultimate goal. But results are much less binary. You can be a very, very strong team and have a year you’re decently happy without necessarily taking home the trophy that year as well. So we look at it very in a nuanced way,” TLO said. Shopify Rebellion will also have the force of a public company in tow with its massive infrastructure. TLO said he is hoping to tap into the company’s marketing department for the LCS team and see what they can do to pull fans in. Subscribe to our newsletter for the latest updates on Esports, Gaming and more. Email Sign up Shopify Rebellion links up with Moist Esports Along with introducing itself to a new esports community, Shopify also had to explain its new venture in Valorant. The organization signed a main circuit Valorant team in 2022 and competed in the first year of the North American Challengers League. Going into the off-season, Shopify got to talking to the Moist Esports camp about trading players or finding other players homes and ended up coming out of it with a merged team and a joint venture, Moist x Shopify Rebellion. The two teams merged into one, only taking up one league spot, and the 10 players were consolidated into five. Showcasing Shopify’s structure and stability as an org combined with the reach and passion of Moist’s creator owners. Ludwig Aghren, a co-owner of the Moist brand, has already organized two showmatches for the new team during the off-season. We’re about to get wet with @MoistEsports 💧💚 Follow @MXSVALORANT for the roster reveal, coming in a hot minute 👀 pic.twitter.com/UclZ5As81z — Shopify Rebellion (@ShopifyRebels) September 20, 2023 Moist has its hands in other esports, some of the same ones as Shopify, but does not have a partnership like this in any other title. Right now, the arrangement is more of an experiment and “casual” according to TLO, as more serious legal structures could come depending on results during the season. “Once you have ownership of a slot like that, things become a lot more serious,” he said when asked how the arrangement would work if the team earned a promotion in VCT Americas. Creator-led initiatives in esports are becoming more common as outside investment is harder to come by in the current economic climate. Orgs owned by content creators, like KOI and Karmine Corp, are also some of the more popular esports brands in their region and have broken into the same realm as traditional teams in the LEC. While not directly signing Ludwig, or his co-owner Charles ‘Cr1TiKaL’ White Jr., as creators, TLO has given Shopify more reach than it previously had in the esport, and beyond. The Shopify Rebellion head said the experiment is better than signing a celebrity, or creator, to attach to the esport who isn’t all that passionate about it to start with. CLOUD9 Moist x Shopify Rebellion and Cloud9’s Valorant teams after a showmatch. “A lot of teams have leaned heavily into trying to get influencers, and creators involved in some ways, but I think the problem so far has been that there was not enough genuine connection to it,” TLO said. The former Team Liquid player explained that some celebrities will interact with an esport or a team once, and then never really get involved at that level again. Prominent examples of this include Drake, who went viral for playing Fortnite with Ninja and has invested in 100 Thieves, and Snoop Dogg, who wore a FaZe Clan chain at the 2022 Super Bowl halftime show and was a part of the company’s board of directors. Both celebrities have not interacted with, or shown much interest, in esports since their initial dive into the space. “You need to find people who are genuinely excited to be part of this and have some degree of ownership over it. So then you actually get real value out of it and people don’t just come over as fans of that celebrity,” the Shopify head said. SENTINELS Ludwig and tarik at the MxS vs. Sentinels showmatch. Shopify Rebellion is now in what looks to be a growth period after two years of juggling the responsibilities of a couple of different esports. The organization still needs time to build up staff for its new League team and will have to wait and see how its partnership pans out with Moist, but that doesn’t mean new things aren’t on the horizon. While orgs are downsizing, or going under, at a decent rate in North America, Shopify are moving in the opposite direction with a plan in mind. “I don’t think this is the end of the expansion, but we just want to make sure first we are fully set up until we consider the next step,” TLO said. Related Topics About Dexerto: Editorial Staff, Standards And Policies Advertise With Us Cookies Policy Privacy Policy Terms And Conditions Acceptable Use Policy Editorial Staff We May Earn An Affiliate Commission From Links On This Page Dexerto.Es Dexerto.Fr Do Not Sell My Personal Information © Copyright 2023 Dexerto Ltd. ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789-_~ x ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789-_~ x",
    "originSummary": [
      "Shopify Rebellion has acquired TSM’s LCS slot for reportedly $10 million, showing their commitment to the value of LCS, even amid declining viewership and multiple businesses pulling away from the esport.",
      "Alongside the purchase, Shopify Rebellion has formed a partnership with Moist Esports to establish a single Valorant team, expanding their esports endeavours.",
      "Shopify Rebellion, the esports division of Shopify since 2021, operates teams across various games, including Valorant, Rocket League, DOTA 2, Starcraft, and Halo."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1698844681509
  },
  {
    "title": "apostar em starcraft 2",
    "originLink": "https://www.ppi.gov.br/app/flames-for-car/30-10-2023.html",
    "originBody": "Home Quem Somos Projetos Invista no Brasil Notícias Legislação e Arquivos Facebook Twitter WhatsApp Email Compartilhar A Secretaria Especial para o Programa de Parcerias de Investimentos da Casa Civil da Presidência da República (SEPPI-CC-PR) realizou a quinta edição da agenda “Diálogos PPI com Estados e Municípios” nesta sexta-feira (27). O encontro virtual mensal tem o objetivo de reunir secretários, gestores e servidores que trabalham com Parcerias Público-Privadas (PPPs) e concessões nos estados e municípios para promover a troca de experiências e debates sobre os desafios e avanços no setor. Os participantes tiveram a oportunidade de se familiarizar com a carteira de investimentos do Governo do Estado do Rio de Janeiro, com foco especial no Centro Cultural João Nogueira, conhecido como Imperator. A apresentação foi conduzida por Augusto Gavioli, o Superintendente de Concessões e Parcerias da Secretaria de Estado da Casa Civil do Estado do Rio de Janeiro. Ele detalhou que a concessão abrangerá um período de 10 anos, com o propósito de impulsionar a cena cultural, aprimorar a gestão e expandir a variedade de atividades culturais no local. O objetivo central é atrair um público diversificado e promover o desenvolvimento cultural na região. Em seguida, Miquéias Assunção Salvador Nery Castro, o Coordenador de Projetos Matriz da Caixa Econômica Federal, apresentou o pipeline de projetos da Caixa. Dentre os ativos, destacou-se o projeto de Resíduos Sólidos Urbanos Comares, que foi leiloado em dezembro de 2022. O consórcio composto pelas empresas Aegea e Engep ofereceu um deságio de 15,12%, e o contrato foi assinado em 13 de junho de 2023, com as atividades já em andamento. Este projeto visa atender uma estimativa de 350 mil habitantes e faz parte de uma carteira que inclui 74 projetos, beneficiando 320 municípios e uma população total de 26,32 milhões. Ao final das palestras, os representantes das secretarias estaduais e municipais puderam esclarecer dúvidas pontuais, trocar informações e sugerir novas implementações nos projetos vigentes e futuros, ampliando a dinâmica do evento. A próxima edição dos Diálogos PPI com Estados e Municípios está agendada para o dia 24 de novembro. Clique aqui para acessar a apresentação da Caixa e aqui para acessar a apresentação do Rio de Janeiro. Facebook Twitter WhatsApp Email Compartilhar Facebook Twitter WhatsApp Email Compartilhar A Secretaria Especial do Programa de Parcerias de Investimentos (SEPPI), em parceria com a Escola Nacional de Administração Pública (ENAP), vai realizar a segunda turma do Modelo de Cinco Dimensões (M5D) no mês de outubro. Esta iniciativa representa um avanço significativo no aprimoramento da tomada de decisões governamentais no Brasil, adaptando o reconhecido Five Case Model do governo do Reino Unido à realidade brasileira. O M5D é uma metodologia que visa apoiar a decisão governamental em projetos de investimento, e é internacionalmente reconhecido como uma boa prática. Desde 2022, o Modelo de Cinco Dimensões é um requisito fundamental para a qualificação de projetos no âmbito do Programa de Parcerias de Investimentos (PPI), tornando-se uma peça-chave no desenvolvimento de projetos estratégicos para o país. Assim como na primeira turma, a segunda turma do M5D contará com participantes de diversos órgãos do governo federal, incluindo ministérios de Integração e Desenvolvimento Regional, Portos e Aeroportos, Transportes, Defesa e Meio Ambiente e Mudança Climática. Além disso, instituições vinculadas, como Codevasf, ICMBio, Serviço Geológico Brasileiro, Agência Nacional de Mineração e INFRA S.A., também estarão presentes no treinamento. O objetivo principal do M5D é aprimorar a capacidade dos órgãos governamentais em avaliar projetos de investimento, considerando as cinco dimensões essenciais: o caso estratégico, o caso econômico, o caso comercial, o caso financeiro e o caso de conformidade. Isso permite uma avaliação mais abrangente e criteriosa, garantindo que projetos estratégicos sejam conduzidos de forma eficiente e transparente. Os participantes da segunda turma do M5D terão a oportunidade de aprimorar suas habilidades e conhecimentos, contribuindo para o avanço do setor público no Brasil. A iniciativa representa mais um passo importante na busca por uma gestão eficaz e transparente dos projetos de investimento no país. Facebook Twitter WhatsApp Email Compartilhar Facebook Twitter WhatsApp Email Compartilhar A Prefeitura do Recife abriu a Consulta Pública referente ao projeto da PPP (Parceria Público-Privada) de Atenção Primária à Saúde do município. O objetivo da Consulta é assegurar a transparência e a participação social no processo de estruturação do projeto, bem como coletar contribuições formuladas pela sociedade civil com vistas ao aperfeiçoamento do projeto. A PPP terá o prazo de 20 anos, e a empresa vencedora do certame será responsável por serviços não assistenciais, dentre os quais construção, gestão, operação, conservação e manutenção de 41 (quarenta e uma) novas Unidades de Saúde da Família. As contribuições deverão ser encaminhadas entre os dias 9 de outubro e 8 de novembro. A Audiência Pública está prevista para ocorrer no dia 7 de novembro de 2023, das 10h às 12h. Os interessados em participar deverão acessar a transmissão clicando aqui. Na ocasião, serão apresentados os principais aspectos que conformam o projeto e, respeitadas as limitações de tempo e ordem de inscrições, coletadas as contribuições e dúvidas dos participantes. Como o PAC conta com a construção de 2780 Unidades Básicas de Saúde (UBS), o modelo pernambucano pode servir de exemplo para outros municípios interessados em expandir ou aprimorar sua rede de atenção primária utilizando modelagem semelhante. Benefícios da Concessão Os estudos coordenados pelas consultorias apontam para o aumento significativo das condições de melhoria da qualidade de vida da população por meio da prestação dos serviços de saúde no município, bem como propiciar a expansão do acesso à saúde gratuita. Mundialmente as implementações de projetos por PPP tem conseguido fazer a entrega dos projetos no prazo e dentro do custo originalmente previstos, o que além de qualificar o gasto público, também propicia à comunidade de desfrutar da política pública mais rapidamente. É importante ressaltar que o escopo do investimento também considera as ações ESG, ao inserir tecnologia e energia limpa entre os investimentos constantes no CAPEX, de R$ 318,1 milhões. O escopo do investimento considera os serviços não assistenciais, tais como: Gestão de Utilidades (água e energia); Lavanderia e Rouparia; Help-Desk / Service-Desk; Manutenção predial e conservação; Serviço de Recepção; Manutenção de equipamentos médicos; Tecnologia da Informação; Seguros e garantias; Limpeza, resíduos, jardinagem e dedetização; Vigilância, CFTV e Alarmes. Para mais informações, clique aqui. Facebook Twitter WhatsApp Email Compartilhar Facebook Twitter WhatsApp Email Compartilhar O Governo do Rio Grande do Sul realizou nesta sexta-feira (6/10), o leilão da Parceria Público-Privada (PPP) do Presídio de Erechim, na sede da B3, em São Paulo. A vencedora foi a empresa Soluções Serviços Terceirizados, que apresentou proposta de R$ 233,00 para o valor da vaga dia e deságio de 0,004292% em relação ao valor estipulado em edital. A PPP abarca a construção, manutenção e apoio à operação do estabelecimento prisional, em um contrato com valor estimado de R$ 2,5 bilhões. Estão previstos investimentos de R$ 149 milhões. O prazo de concessão é de 30 anos. Neste período, o Estado continua sendo o titular do serviço público objeto da PPP e responsável pela execução da política pública, em conjunto com o parceiro privado. “O Governo do Rio Grande do Sul está investindo na ressocialização e na diminuição do déficit no sistema prisional. A lógica é simples: quanto menor a infraestrutura, maior a insegurança dentro e fora dos presídios. Por outro lado, quanto maior o investimento, maior a segurança”, afirmou o titular da Secretaria de Estado de Parcerias e Concessões do Rio Grande do Sul, Pedro Capeluppi. O projeto faz parte da política de fomento à realização de parcerias no setor qualificada no PPI por meio de Decreto nº 10.106, de 2019, por demanda do Ministério da Justiça e Segurança Pública. A estruturação contou com apoio da Secretaria Especial do Programa de Parcerias de Investimentos da Presidência da República (SEPPI) e do Banco Interamericano de Desenvolvimento (BID). A estruturação foi coordenada pelo Banco Nacional de Desenvolvimento Econômico e Social (BNDES) e contou com a atuação de nove consultorias do Brasil, dos Países Baixos e de Portugal, lideradas pela PWC. Para o Secretário Adjunto de Infraestrutura Social e Urbana do PPI, Manoel Renato Machado Filho, o Brasil está diante de uma solução pioneira e inovadora na gestão da segurança pública no país. “Este projeto foi construído por muitas mãos, todas elas com um único objetivo: transformar o modelo prisional em um objeto eficiente, trazendo melhorias na gestão, infraestrutura e sobretudo na oferta de espaços de educação e trabalho dentro do presídio para possibilitar a reintegração do preso à sociedade. Estamos unindo a tecnologia, inovação e o cuidado com o ser humano. É uma receita de sucesso que já tem dado bons resultados no Brasil”, afirmou Manoel Renato. A Superintendente da área de Estruturação de Projetos do BNDES, Luciene Machado, ressaltou a importância das políticas públicas para a segurança, destacando que, como todo modelo inovador, estamos no estágio inicial de superar resistências através do diálogo e da transparência. “A escassez de infraestrutura na prestação de serviços não é exclusiva deste setor, e é por isso que as PPPs desempenham um papel muito importante. Essa dinâmica está moldando a transformação do nosso país e deve ser cada vez mais difundida”, afirmou. A concessão prevê que o complexo prisional seja um dos mais modernos do Brasil, empregando tecnologia de ponta para aumentar a segurança e reduzir os custos da operação. Há também a previsão do modelo de “presídio indústria” no qual há oferta de vagas de trabalho qualificadas para a maior parte dos presos. A remuneração da concessionária é proporcional à disponibilidade de vagas, bem como à qualidade da prestação dos serviços, não havendo qualquer incentivo à ocupação das vagas. O exercício do poder de polícia é exclusivo do Estado, cabendo ao parceiro privado construir a infraestrutura, prestar serviços não finalísticos (limpeza, alimentação, lavanderia), além de educação profissionalizante e a disponibilização de vagas de trabalho, apoio social e suporte aos familiares. A unidade terá 10,4 hectares, dois módulos com 26 mil metros quadrados cada e um total de 1,2 mil vagas disponibilizadas para presos em regime fechado. A previsão para realização das obras é de até 24 meses. Fotos por: @patricia_aart Facebook Twitter WhatsApp Email Compartilhar Facebook Twitter WhatsApp Email Compartilhar O Governo do Rio Grande do Sul publicou a nova data para o leilão da Parceria Público-Privada (PPP) do Presídio de Erechim, que ocorrerá dia 6 de outubro, às 11 horas, na B3, em São Paulo. O recebimento dos envelopes ocorreu dia 29 de setembro. A alteração foi solicitada pelas empresas interessadas em participar do certame e foi acolhida pelo Executivo Estadual. A data anterior do leilão era 1º de setembro. O projeto é fruto da qualificação da política de fomento aos Sistemas Prisionais Estaduais no PPI por meio do Decreto 10.106/2019, com o objetivo de desenvolver um modelo contratual de parceria com a iniciativa privada para construção e operação de presídios, a ser replicado no país. O modelo deve viabilizar a prestação do serviço público com maior segurança, alcançando o objetivo de integração social e ressocialização dos presos por meio do trabalho e estudo. Além disso, busca-se melhorar a eficácia das instalações prisionais através da implementação de automação e tecnologia nas operações diárias. A modelagem e planejamento dessa PPP serão realizados conjuntamente pelo Banco Nacional de Desenvolvimento Econômico e Social (BNDES), Ministério da Justiça e Departamento Penitenciário Nacional (DEPEN), Governo do Rio Grande do Sul, em colaboração com o Banco Interamericano de Desenvolvimento (BID). A execução do projeto ficará a cargo de um consórcio liderado pela renomada empresa de consultoria – PWC. O edital prevê a construção, manutenção e apoio à operação do estabelecimento prisional no município. A unidade terá 10,4 hectares, dois módulos com 26 mil metros quadrados cada e um total de 1,2 mil vagas disponibilizadas para apenados. A previsão para realização da obra é de até 24 meses. Presidio Industria A iniciativa também é focada na ressocialização, prevendo a possibilidade de trabalho, educação e reinserção social para detentos, assim como o uso de tecnologia na gestão prisional. Uma das principais melhorias será a nova localização do presídio, distante da zona urbana, entre as rodovias ERS-135 e BR-153, que atende a diretrizes de segurança e satisfaz um anseio da população de Erechim. O modelo de gestão será o de Parceria Público-Privada, no qual uma entidade selecionada por licitação – modelo concorrência internacional – é remunerada pela gestão de uma concessão pública, pelo período de 30 anos. No caso do complexo penal, a entidade será responsável pela construção e operação do presídio, que inclui manutenção das instalações, limpeza e apoio logístico na movimentação dos detentos. O critério para seleção do responsável pela construção, manutenção e apoio à operação será o de menor contraprestação pública. Facebook Twitter WhatsApp Email Compartilhar Facebook Twitter WhatsApp Email Compartilhar Os quase 605 km de rodovias do Lote 2 do Paraná serão administrados pelo Consórcio Infraestrutura PR, que arrematou o processo licitatório promovido pela Agência Nacional de Transportes Terrestres (ANTT) e pelo Ministério dos Transportes. O projeto foi leiloado nesta sexta-feira (29/9) na B3 em São Paulo está qualificado no Programa de Parcerias de Investimentos e abrange as rodovias federais BRs-153/277/369 e as rodovias estaduais PR-092/151/239/407/408/411/508/804/855, conectando pontos estratégicos da região, como o Porto de Paranaguá e a Região Metropolitana de Curitiba. O Consórcio Infraestrutura PR investirá mais de R$ 17 bilhões nas rodovias do Lote 2 ao longo dos próximos 30 anos. O projeto abrange diversas melhorias, incluindo a duplicação de 350 km de rodovias, a adição de 139 km de faixas extras, incluindo a desafiadora Serra do Mar, a construção de 73 km de vias marginais, 52 passarelas para pedestres, duas áreas de descanso para caminhoneiros e 150 paradas de ônibus. O Consórcio é uma associação entre as empresas EPR 2 Participações S.A. e Perfin Voyager, especializadas em investimentos em concessões de rodovias e mobilidade. Atualmente, o grupo já é responsável por três concessões estaduais em Minas Gerais, com contratos de 30 anos, e agora assumirá sua primeira concessão federal com o Lote 2 do Paraná. Em relação à segurança dos usuários, o projeto incluirá a instalação de câmeras com tecnologia OCR para o reconhecimento de placas, pontos de atendimento ao usuário com acesso à internet Wi-Fi, painéis de mensagem variável e sistema de pesagem automático. A conectividade também será um destaque na concessão, com cobertura 4G e sistema de telefonia ao longo de toda a rodovia, além de iluminação em LED em áreas críticas. O Lote 2 contará com cinco Bases de Serviços Operacionais e de Atendimento ao Usuário (BSO/SAU), incluindo duas já existentes que passarão por uma reforma completa e três novas a serem implantadas. Também haverá o suporte de ambulâncias tipo C para o resgate e atendimento de vítimas de acidentes, ambulâncias tipo D, UTI móvel com suporte médico, assim como guinchos leves e pesados. Cronograma de Atuação O cronograma de atuação prevê que a empresa vencedora do leilão assine o contrato em janeiro, com a concessão assumida 30 dias após a assinatura, prevista para fevereiro de 2024. Os primeiros trabalhos, incluindo a revitalização asfáltica de trechos, a construção de novas praças de pedágio e postos de atendimento, serão concentrados no primeiro ano da concessão, somando um investimento de mais de R$ 315 milhões em obras. A expectativa é que a concessão gere cerca de 110 mil empregos diretos e indiretos, impulsionando o crescimento econômico da região. Facebook Twitter WhatsApp Email Compartilhar Facebook Twitter WhatsApp Email Compartilhar Dentre as ações legais esperadas do Programa de Parcerias de investimentos da Casa Civil da Presidência da República está a atração de investimentos . Para tanto, representantes do Programa atuam de maneira diversa, viajando ao exterior ou recebendo autoridades, empresários e interessados em conhecer e investir nas oportunidades presentes na carteira de ativos do PPI. Atualmente são mais de 230 projetos qualificados, nas mais diversas áreas de infraestrutura. Destes, 93 ativos fazem parte do portfólio do Novo PAC. Abrindo o calendário de roadshows, o Chefe da Assessoria Especial, Cleyton Barros, visitou Nova Iorque para reforçar a boa opção que os ativos brasileiros representam. Juntamente com diplomatas brasileiros e membros do Banco Interamericano de Desenvolvimento – BID, o assessor especial do PPI visitou grandes tomadores de decisão, fundos , bancos e players importantes do setor de Infraestrutura e financiamento. A agenda foi bastante robusta, contendo encontros com expoentes do setor como Pátria Investments, CitiGroup, J.P Morgan, Godman Sachs, Maquarie, BlackRock,Btg Pactual e Kirkoswald. Facebook Twitter WhatsApp Email Compartilhar Facebook Twitter WhatsApp Email Compartilhar Em 27 de setembro, o Secretário Especial do Programa de Parcerias de Investimentos da Casa Civil da Presidência da República, Marcus Cavalcanti, recebeu, juntamente com autoridades brasileiras, equipe da UNDRR – agência para Prevenção de Risco de Desastres das Nações Unidas. Em ampla conversa, os participantes da ONU compartilharam iniciativas para prevenir e mitigar desastres ambientais. Ressaltaram a importância de um plano de ação mencionando o passo a passo para elaborar inventário de infraestruturas e seu nível de resiliência atual. Para tanto, é necessário mapear a governança institucional de locais e desafios dignos de atenção. Frisaram que o levantamento de normativas e políticas existentes para ação governamental deve ser realizado de modo coerente com o levantamento de vulnerabilidades. Ainda, em suas atividades, buscam entender as consequências financeiras dos desastres, a fim de identificar e priorizar necessidades de financiamento. Após esse estudo, desenvolvem plano de ação, adequando a situação às opções de financiamento que proporcionam. As autoridades brasileiras presentes, representadas pelos ministérios da Casa Civil, Transportes, Cidades, Integração e Desenvolvimento Regional, mostraram-se bastante atentas à questão e apresentaram algumas iniciativas já empreendidas para diminuir danos e desastres e evitar custos da ausência de adaptação climática. Houve apresentação do “Building Back Better”, pela Defesa Civil, mostrando o avanço na construção de barragens e o avanço empreendido na normatização do tema. A reunião reveste-se de grande importância e vem ao encontro das iniciativas nacionais para lidar com o contexto de aprofundamento de crise climática e de fenômenos como o El Niño, que motivaram os ciclones no Rio Grande do Sul e as secas no Rio Amazonas. Facebook Twitter WhatsApp Email Compartilhar Facebook Twitter WhatsApp Email Compartilhar A Secretaria Especial para o Programa de Parcerias de Investimentos da Casa Civil da Presidência da República (SEPPI-CC-PR) realizou a quarta edição da agenda “Diálogos PPI com Estados e Municípios” em 28 de setembro de 2023. Os encontros virtuais são realizados mensalmente com o objetivo de reunir secretários, gestores e servidores que trabalham com temas relacionados a Parcerias Público-Privadas (PPPs) e concessões nos estados e municípios, visando a troca de experiências e debates sobre os desafios e avanços no setor. Nesta edição, os participantes tiveram a oportunidade de conhecer o projeto de PPP para a construção e conservação dos novos Centros Educacionais Unificados (CEUs) no município de São Paulo. O Secretário Executivo de Desestatização e Parcerias, Paulo José Galli, destacou que o empreendimento abrangerá 58 unidades em toda a cidade, com foco nas áreas periféricas. Galli enfatizou que esses complexos educacionais, esportivos e culturais são reconhecidos como centros de estruturação urbana que geram transformações nos territórios. A concessão administrativa tem prazo de 25 anos e conta com investimentos no valor de R$ 1,5 bilhão. Após a apresentação, representantes de outros estados puderam esclarecer suas dúvidas sobre a modelagem do projeto e aprender com a experiência de São Paulo. O Secretário Especial do PPI, Marcus Cavalcanti, ressaltou a importância da troca de experiências entre os representantes para aprimorar as práticas de PPPs no país e enfatizou o compromisso do PPI em promover o conhecimento e o desenvolvimento dessa política para impulsionar a infraestrutura nos estados e municípios. Paulo Galli concluiu a apresentação destacando que a iniciativa dos CEUs demonstra um compromisso com o desenvolvimento educacional, cultural e esportivo da cidade de São Paulo. Além disso, destacou a flexibilidade na adaptação a diferentes terrenos e na gestão de licenciamentos e obras, mostrando o compromisso em buscar melhores resultados em prol da educação e do bem-estar dos cidadãos. Em seguida, cumprindo o papel de trazer um convidado especial nas edições dos Diálogos, os participantes receberam o Chefe de Departamento da Área de Estruturação de Projetos do BNDES, Leonardo Pereira, para falar sobre a estruturação de projetos para concessões e PPPs. O gestor reforçou o compromisso do banco em apoiar o setor público na estruturação de parcerias para viabilizar investimentos privados em projetos de interesse público, com transparência e neutralidade, utilizando expertise técnica para promover os investimentos. Quanto aos projetos em andamento, o BNDES apresentou progresso em diversas áreas, com destaque para investimentos na infraestrutura educacional e de saúde. Atualmente, o BNDES está trabalhando na estruturação de projetos que beneficiarão aproximadamente 130 mil alunos em iniciativas de educação e cerca de 450 mil pessoas em projetos de saúde. Esses projetos estão em diferentes estágios, com alguns deles já em fase de contratação e outros em processo de estudo e preparação para a publicação de editais. A próxima edição está marcada para o dia 27 de outubro de 2023. Clique aqui para acessar a apresentação de São Paulo Clique aqui para acessar a apresentação do BNDES Facebook Twitter WhatsApp Email Compartilhar Facebook Twitter WhatsApp Email Compartilhar A SEPPI participou nesta sexta-feira (29/9), da Audiência Pública do projeto PPP Morar no Centro, Parceria Público-Privada de Habitação para Locação Social do Município do Recife. O projeto é parte da carteira do PPI e recebe assistência técnica e financeira do Governo Federal. Também estiveram presentes os demais participantes da estruturação do projeto para prestar esclarecimentos sobre a PPP Morar no Centro, dentre os quais destacamos os representantes da Secretaria de Habitação e da Secretaria Executiva de Parcerias Estratégicas da Prefeitura do Recife; da Secretaria Nacional de Habitação do Ministério das Cidades; da Secretaria do Patrimônio da União do Ministério da Gestão e da Inovação em Serviços Públicos; da CAIXA, responsável pelo assessoramento técnico ao ente; e do consórcio UNA/HIGH TECH/MANESCO, contratados com recursos do Fundo de Apoio a Concessões e Parcerias – FEP para prestar consultoria técnica. A iniciativa é parte da política de fomento federal a parcerias com o setor privado para estudar alternativas habitacionais destinadas à locação social, qualificada no PPI pelo Decreto n° 10.678/2021. Consulta Pública aberta de 08 de setembro a 09 de outubro Os cidadãos interessados em contribuir para o aperfeiçoamento do projeto, que visa a requalificação de imóveis e construção de unidades habitacionais a serem destinadas à locação social, têm até o dia 09 de outubro para apresentar suas críticas e sugestões de melhorias. Os documentos e estudos desenvolvidos para a estruturação do projeto estão disponíveis para consulta aqui. As contribuições deverão ser encaminhadas ao endereço eletrônico oficial, seguindo as orientações disponibilizadas pela Prefeitura: consulta.morarnocentro@recife.pe.gov.br. Encerrada a Consulta Pública a equipe de estruturação se dedicará à revisão do projeto, que seguirá para apreciação e aprovação pelo Tribunal de Contas do Estado. O leilão, na modalidade Concorrência Nacional, está previsto para ocorrer no primeiro semestre de 2024. Sobre a PPP Morar no Centro O valor estimado do contrato para os 25 anos é de R$ 182 milhões, com o valor da Contraprestação Mensal Máxima de aproximadamente R$ 1.943 mil. A empresa que assumir a PPP, na modalidade concessão patrocinada, será responsável pela implantação, manutenção e operação de 4 (quatro) empreendimentos de locação social e 2 (dois) empreendimentos habitacionais destinados ao mercado popular, no Município do Recife, totalizando 1.128 unidades habitacionais. Além das obras de construção e de requalificação de unidades habitacionais, a PPP inclui a prestação de serviços de gestão de carteira, gestão condominial e de trabalho social e desenvolvimento comunitário. Sobre o FEP O FEP foi instituído pela Lei nº 13.529/2017, com o objetivo de financiar serviços técnicos profissionais especializados para a estruturação de projetos de concessão e parcerias público-privadas, com foco no apoio a entes subnacionais. A SEPPI é responsável pelos aportes financeiros no Fundo e pela coordenação e monitoramento dessa importante ferramenta de fomento à realização de projetos de parcerias subnacionais. A realização de projetos por meio do FEP oferece benefícios às prefeituras, como a garantia de recursos financeiros para execução completa dos projetos e a condução da estruturação pela CAIXA, instituição com corpo técnico qualificado, responsável pela contratação de consultorias externas e por realizar todo o assessoramento ao município, trazendo confiabilidade e isenção aos projetos. Facebook Twitter WhatsApp Email Compartilhar Twitter Youtube Instagram Linkedin PÁGINA INICIAL / HOME Página Inicial QUEM SOMOS Sobre o Programa Ouvidoria Sala de Impressa Fale Conosco NOTÍCIAS Ultimas Notícias Multimídia PROJETOS Projetos em Andamento Projetos Concluídos Próximos Leilões LEGISLAÇÃO E ARQUIVOS Legislação Arquivos Apoio aos Estados e Municípios INVISTA NO BRASIL Porque Investir no Brasil Como Investir no Brasil ENDEREÇO SAUN Q 5, Lote C, Centro Empresarial CNC, Torre D, 2º andar – Asa Norte, Brasília – DF, 70040-250",
    "originSummary": [
      "Brazil's Special Secretariat for the Investment Partnership Program (SEPPI) is fostering public-private partnerships to bolster sectors like culture, urban waste, and healthcare.",
      "A notable SEPPI-coordinated project is a $463m high-tech prison, focusing on resocialization and work opportunities for inmates, won by Soluções Serviços Terceirizados and a $1bn investment in highway infrastructure in Rio Grande do Sul state.",
      "Other plans include partnership initiatives for environmental disaster mitigation with the UNDRR, a $261m investment in Educational Centres in São Paulo, and a project to create over 1,000 housing units in Recife, primarily financed by the FEP."
    ],
    "commentBody": "",
    "commentSummary": [
      "The article emphasizes the growing importance of Artificial Intelligence in marketing, with an increased popularity of AI-powered chatbots among customers.",
      "It highlights the advantage of expanded data capabilities and advanced AI-based technologies in aiding marketing professionals to improve the consumer experience with tailored narratives.",
      "These advanced AI tools are also mentioned as instrumental in predicting customer behavior and automating routine tasks."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1698844681509
  },
  {
    "title": "Weekend PC Download Deals for Oct. 27: Steam Scream returns",
    "originLink": "https://www.shacknews.com/article/137567/weekend-pc-download-deals-for-oct-27-steam-scream-returns",
    "originBody": "2023 video game release dates calendarDestiny 2 Complete Strategy GuideThe Legend of Zelda: Tears of the Kingdom Strategy GuideStarfield Strategy Guide LOLA          Log In  Forum: Posts today 140  Reviews News Videos Guides Podcasts Features Long Reads  DESTINY 2 NINTENDO SHACKPETS TOTK BALDUR'S GATE 3 STARFIELD BLACK LIVES MATTER FEATURE Weekend PC Download Deals for Oct. 27: Steam Scream returns It's Steam Scream: The Revenge, featuring big discounts on some of the spookiest games on the market. Ozzie Mejia October 27, 2023 1:30 PM 1 Halloween is next week and that means it's time to scare up some savings over at Steam. Valve's storefront has returned with its seasonal sale called Steam Scream: The Revenge, featuring spooky and seasonal-themed titles. Find something like Resident Evil 4, Dead Space, The Last of Us Part 1, and dozens more with big discounts. There are other scare-tastic deals to be found elsewhere. Diablo 4 is still on sale with Battle.net users getting the option to jump on board for free until Monday. The Epic Games Store is continuing its Halloween Sale, while GOG.com's is just getting started. Don't forget we're also inching closer to Fallout Day, so check out different storefronts for some Fallout-related savings. Lastly, do you want the hottest new releases? You might want to shop around. Fanatical has Ghostrunner 2 with a 20 percent launch discount. Gamersgate and GamesPlanet has early savings on NBA 2K24. GamesPlanet and Green Man Gaming have Hellboy Web of Wyrd. Plus, Green Man Gaming also has the Metal Gear Solid: Master Collection Vol. 1. And head over to Gamebillet to find a launch discount on Cities: Skylines 2. Here's our selection of this weekend's PC deals: Blizzard Diablo 4 - $52.49 (25% off) (FREE WEEK for Battle.net users until 10/30) StarCraft 2 Carbot Complete Bundle - $9.99 (19% off) Heroes of the Storm: Welcome to the Nexus Bundle - $15.99 (70% off) Heroes of the Storm: Heroic Reinforcement Bundle - $39.99 (70% off) Epic Games Store Tandem: A Tale of Shadows - FREE until 11/2 The Evil Within 2 - FREE until 11/2 Ghostwire Tokyo - FREE from Prime Gaming (Must claim before 10/31) Tiny Tina's Wonderlands Chaotic Great Edition - $26.39 (67% off) Eternights - $22.49 (25% off) Epic Games Halloween Sale 2023 The Last of Us Part I - $47.99 (20% off) Remnant 2 - $39.99 (20% off) Dead Island 2 - $41.99 (30% off) The Outlast Trials - $23.99 (20% off) Amnesia: The Bunker - $18.74 (25% off) Returnal - $40.19 (33% off) Dead By Daylight - $9.99 (50% off) Evil Dead: The Game - $14.99 (50% off) Dying Light 2: Stay Human - $29.99 (50% off) Hades - $12.49 (50% off) Gotham Knights - $14.99 (75% off) Alan Wake Remastered - $9.89 (67% off) Chivalry 2 - $15.99 (60% off) Inscryption - $11.99 (40% off) World War Z Aftermath - $23.99 (40% off) Choo-Choo Charles - $9.99 (50% off) Killing Floor 2 - $5.99 (80% off) Alien: Isolation - $13.59 (66% off) Quake - $3.99 (60% off) More from the Epic Games Store's Halloween Sale. Fanatical Ghostrunner 2 [Steam] - $31.99 (20% off) Remnant 2 [Steam] - $39.99 (20% off) The Last of Us Part 1 [Steam] - $41.99 (30% off) Hogwarts Legacy [Steam] - $37.19 (38% off) WrestleQuest [Steam] - $22.04 (27% off) Returnal [Steam] - $35.99 (40% off) LEGO 2K Drive [Steam] - $35.39 (41% off) Cassette Beasts [Steam] - $14.99 (25% off) Miasma Chronicles [Steam] - $38.99 (22% off) Warhammer 40K: Darktide [Steam] - $25.99 (35% off) Marvel's Midnight Suns [Steam] - $20.99 (65% off) Sifu [Steam] - $21.19 (47% off) Have A Nice Death [Steam] - $17.49 (30% off) Turbo Golf Racing [Steam Early Access] - $4.31 (76% off) Super Dungeon Maker [Steam] - $15.74 (21% off) Soulstice [Steam] - $9.99 (75% off) Cat Cafe Manager [Steam] - $9.99 (50% off) Gamebillet Cities: Skylines 2 [Steam] - $40.11 (20% off) Lords of the Fallen [Steam] - $48.90 (18% off) Mortal Kombat 1 [Steam] - $56.95 (19% off) Hogwarts Legacy [Steam] - $35.09 (42% off) No Man's Sky [Steam] - $24.39 (59% off) Resident Evil Village [Steam] - $19.29 (52% off) Red Dead Redemption 2 - $19.04 (68% off) Crusader Kings 3 [Steam] - $21.79 (56% off) Horizon Zero Dawn Complete Edition [Steam] - $34.89 (30% off) Days Gone [Steam] - $11.47 (77% off) Mortal Kombat 11 Ultimate Edition [Steam] - $7.18 (88% off) Mechwarrior 5: Mercenaries [Steam] - $11.99 (60% off) Uno [Ubisoft] - $3.43 (66% off) Gamersgate NBA 2K24 [Steam] - $35.99 (40% off) Returnal [Steam] - $40.19 (33% off) Hogwarts Legacy [Steam] - $41.99 (30% off) Sifu [Steam] - $23.99 (40% off) LEGO Star Wars: The Skywalker Saga [Steam] - $16.49 (67% off) No Man's Sky [Steam] - $29.99 (50% off) Gotham Knights [Steam] - $14.99 (75% off) Control Ultimate Edition [Steam] - $8.69 (78% off) Chorus [Steam] - $22.79 (43% off) Metro Exodus [Steam] - $8.99 (70% off) The Walking Dead: The Telltale Definitive Series [Steam] - $19.99 (60% off) GamesPlanet Hellboy Web of Wyrd [Steam] - $19.99 (20% off) NBA 2K24 [Steam] - $33.50 (44% off) Ghost Trick: Phantom Detective [Steam] - $17.99 (40% off) The Last of Us Part 1 [Steam] - $44.99 (25% off) No Man's Sky [Steam] - $24.40 (59% off) Aliens: Dark Descent [Steam] - $27.99 (30% off) Atomic Heart [Steam] - $32.99 (45% off) A Plague Tale: Requiem [Steam] - $22.50 (55% off) LEGO 2K Drive [Steam] - $22.99 (62% off) Marvel's Midnight Suns [Steam] - $22.99 (62% off) Warhammer 40K: Boltgun [Steam] - $15.39 (30% off) Resident Evil Village [Steam] - $11.99 (70% off) Red Dead Redemption 2 - $19.80 (67% off) Fallout 76 [Steam] - $7.50 (81% off) Fallout 4 GOTY Edition [Steam] - $9.50 (76% off) Mutant Year Zero: Road to Eden [Steam] - $12.50 (64% off) Find the full list of weekly deals on GamesPlanet. GOG.com Cyberpunk 2077 - $35.99 (40% off) The Witcher 3: Wild Hunt Complete Edition - $14.99 (70% off) Monster Prom 2: Monster Camp - FREE from Prime Gaming (Must claim before 11/15) The Coma 2: Vicious Sisters Deluxe Edition - FREE from Prime Gaming (Must claim before 11/15) Doom 3 - FREE from Prime Gaming (Must claim before 11/18) The Textorcist: The Story of Ray Bibbia - FREE from Prime Gaming (Must claim before 11/22) Days Gone - $16.49 (67% off) System Shock - $29.99 (25% off) Blasphemous 2 - $23.99 (20% off) Amnesia: The Bunker - $18.74 (25% off) Dredge - $18.74 (25% off) WrestleQuest - $20.99 (30% off) A Plague Tale: Requiem - $24.99 (50% off) Return to Monkey Island - $16.24 (35% off) Disco Elysium: The Final Cut - $9.99 (75% off) Stardew Valley - $11.99 (20% off) No Man's Sky - $29.99 (50% off) Inscryption - $11.99 (40% off) Hellblade: Senua's Sacrifice - $4.49 (85% off) Frostpunk GOTY Edition - $12.24 (75% off) Batman: Arkham Knight Premium Edition - $7.99 (80% off) Dragon's Dogma: Dark Arisen - $4.79 (84% off) Spiritfarer Digital Deluxe Edition - $9.99 (75% off) Costume Quest 2 - $9.99 (50% off) Quake 2 - $3.99 (60% off) There are over 3,300 games on sale over the next week. Check out everything available during the GOG.com Halloween Sale. Green Man Gaming Use the coupon code OCT17 to get 17% off of all PC games. Exclusions apply. Metal Gear Solid: Master Collection Vol. 1 [Steam] - $46.79 (22% off) Ghostrunner 2 [Steam] - $31.99 (20% off) Resident Evil 4 [Steam] - $34.44 (43% off) Hellboy Web of Wyrd [Steam] - $19.99 (20% off) NBA 2K24 [Steam] - $31.31 (48% off) The Last of Us Part 1 [Steam] - $47.99 (20% off) Monster Hunter Rise + Sunbreak [Steam] - $34.70 (50% off) Saints Row [Steam] - $17.40 (71% off) Blood Bowl 3 [Steam] - $23.39 (22% off) Ravenswatch [Steam Early Access] - $15.59 (22% off) The Outlast Trials [Steam Early Access] - $23.99 (20% off) Resident Evil Village [Steam] - $13.92 (65% off) Fallout 76 [Steam] - $6.80 (83% off) Tekken 7 Definitive Edition [Steam] - $14.19 (87% off) Shadow of the Tomb Raider [Steam] - $8.60 (78% off) Humble Bundle Subscribe to Humble Choice for $11.99 each month. For the month of October, you'll receive The Quarry Deluxe Edition, Metal: Hellsinger, The Dark Pictures Anthology: House of Ashes, Rebel Inc.: Escalation, Lords and Villeins, A Juggler's Tale, Spirit of the Island, and Mr. Prepper. DRMs vary. Humble Choice members also save extra on most purchases from the Humble Store. Pay $15 or more to get Sid Meier's Civilization 6 with the Gathering Storm and Rise and Fall expansions and the Vikings Scenario Pack, Poland Civilization & Scenario Pack, Australia Civilization & Scenario Pack, Persia and Macedon Civilization & Scenario Pack, Nubia Civilization & Scenario Pack, and Khmer & Indonesia Double Civilization & Scenario Pack DLCs, Sid Meier's Civilization: Beyond Earth, Sid Meier's Civilization 5: The Complete Edition, Sid Meier's Pirates, Sid Meier's Civilization 4: The Complete Edition, Sid Meier's Civilization 3: Complete, Sid Meier's Starships, Sid Meier's Railroads, Sid Meier's Ace Patrol: Pacific Skies, Sid Meier's Ace Patrol, Sid Meier's Colonization (Classic), and Sid Meier's Covert Action (Classic). The activate on Steam. Pay $10 or more to get Lumberjacks Dynasty, Fresh Star Cleaning Simulator, Electrician Simulator, and Juno: New Origins. Pay $15 or more to also receive Builder Simulator, Firefighting Simulator: The Squad, House Flipper (with the Luxury and Garden DLC packs), and Farming Simulator 19. These activate on Steam. Pay $13 or more to get STASIS: Bone Totem, Bendy and the Dark Revival, the Alan Wake Collector's Edition, Hidden Deep, Tormented Souls, Bendy and the Ink Machine, Pathologic 2, and Moons of Madness. These activate on Steam. Pay $10 or more to get Tekken 7, Code Vein, Katamari Damacy REROLL, God Eater 3, Tales of Vesperia Definitive Edition, .hack//G.U. Last Recode, and Pac-Man Museum+. These activate on Steam. Remnant 2 [Steam] - $39.99 (20% off) The Texas Chain Saw Massacre [Steam] - $27.99 (30% off) Role-Playing Radness Mega Man Battle Network Legacy Collection [Steam] - $39.59 (34% off) Hogwarts Legacy [Steam] - $41.99 (30% off) Marvel's Midnight Suns [Steam/Epic] - $23.99 (60% off) Gotham Knights [Steam] - $14.99 (75% off) WrestleQuest [Steam] - $20.99 (30% off) Atomic Heart [Steam] - $39.59 (34% off) Borderlands 3 Ultimate Edition [Steam/Epic] - $29.99 (70% off) Batman: Arkham Collection [Steam] - $8.99 (85% off) More from the Humble Store's Role-Playing Radness Sale. PlayStation Halloween Sale The Last of Us Part 1 [Steam] - $47.99 (20% off) Returnal [Steam] - $40.19 (33% off) Days Gone [Steam] - $16.49 (67% off) Preadator: Hunting Grounds [Steam] - $7.49 (75% off) Fallout Day Sale Fallout 76 [Steam] - $7.99 (80% off) Fallout Classic Collection [Steam] - $4.99 (75% off) Fallout 4 GOTY Edition [Steam] - $14.99 (75% off) Fallout New Vegas Ultimate Edition [Steam] - $6.59 (67% off) Fallout 3 GOTY Edition [Steam] - $4.99 (75% off) Ubisoft Store Far Cry 6 - $15.00 (75% off) Tom Clancy's Rainbow Six Siege - $8.00 (60% off) Watch Dogs Legion - $9.00 (85% off) Tom Clancy's Ghost Recon Breakpoint - $12.00 (80% off) Uno - $4.00 (60% off) Steam Diablo 4 - $52.49 (25% off) Star Wars Jedi: Survivor - $45.49 (35% off) NBA 2K24 - $35.99 (40% off) Madden NFL 24 - $45.49 (35% off) Final Fantasy 14: Endwalker - $19.99 (50% off) Marvel's Spider-Man Remastered - $35.99 (40% off) Marvel's Spider-Man: Miles Morales - $29.99 (40% off) Steam Scream: The Revenge Resident Evil 4 - $39.59 (34% off) Dead Space - $35.99 (40% off) The Texas Chain Saw Massacre - $27.99 (30% off) The Last of Us Part 1 - $47.99 (20% off) Returnal - $40.19 (33% off) Dead by Daylight - $7.99 (60% off) Blasphemous 2 - $23.99 (20% off) Amnesia: The Bunker - $18.74 (25% off) Ghost Trick: Phantom Detective - $19.79 (34% off) Aliens: Dark Descent - $26.79 (33% off) System Shock - $29.99 (25% off) Dredge - $18.74 (25% off) Stray - $22.49 (25% off) The Callisto Protocol - $23.99 (60% off) Atomic Heart - $39.59 (34% off) Return to Monkey Island - $18.74 (25% off) The Outlast Trials [Steam Early Access] - $23.99 (20% off) Phasmophobia [Steam Early Access] - $11.19 (20% off) Sons of the Forest [Steam Early Access] - $23.99 (20% off) A Plague Tale: Requiem - $24.99 (50% off) Dying Light 2: Stay Human - $29.99 (50% off) Cult of the Lamb - $14.99 (40% off) Inscryption - $9.99 (50% off) Metal: Hellsinger - $14.99 (50% off) Death's Door - $7.99 (60% off) Black Mesa - $3.99 (80% off) Hollow Knight - $7.49 (50% off) The Walking Dead: The Telltale Definitive Series - $12.49 (75% off) Iratus: Lord of the Dead - $3.87 (87% off) Strange Brigade - $2.50 (95% off) More from the Steam Scream: The Revenge Sale. Fallout Day Sale Fallout 76 - $7.99 (80% off) (FREE WEEK until 10/30 @ 9AM PT) Fallout Franchise Bundle - $62.83 (74% off) Fallout 4 GOTY Edition - $9.99 (75% off) Fallout New Vegas Ultimate Edition - $6.59 (67% off) Fallout 3 GOTY Edition - $4.99 (75% off) IO Interactive 25th Anniversary Sale Hitman: World of Assassination - $27.99 (60% off) Hitman Absolution - $3.99 (80% off) Hitman Blood Money - $1.99 (80% off) Hitman Contracts - $1.79 (80% off) Hitman 2: Silent Assassin - $1.79 (80% off) Hitman: Codename 47 - $1.59 (80% off) WB Games Publisher Sale Hogwarts Legacy - $41.99 (30% off) LEGO Star Wars: The Skywalker Saga - $16.49 (67% off) Gotham Knights - $14.99 (75% off) Back 4 Blood - $11.99 (80% off) Middle-earth: The Shadow Bundle - $10.49 (85% off) Mortal Kombat 11 Ultimate Edition - $8.99 (85% off) Batman Arkham Collection - $8.99 (85% off) More from the Steam WB Games Publisher Sale. Among Us - $2.99 (40% off) Red Dead Redemption 2 - $23.99 (60% off) Monster Hunter Rise + Sunbreak - $29.99 (50% off) Monster Hunter World - $14.99 (50% off) Mass Effect Legendary Edition - $9.59 (84% off) Ghostbusters: Spirits Unleashed Ecto Edition - $14.99 (25% off) Hades - $12.49 (50% off) Slay the Spire - $8.49 (66% off) Slender: The Arrival - $13.99 (30% off) American Truck Simulator - $4.99 (75% off) Euro Truck Simulator 2 - $4.99 (75% off) If you've found any deals we might have missed or there's a specific one you wish to highlight, be sure to join the conversation and let us know in the comments. Or let us know how you're enjoying your new games by jumping into the Official Shacknews Community Discord. Ozzie Mejia Senior Editor Ozzie has been playing video games since picking up his first NES controller at age 5. He has been into games ever since, only briefly stepping away during his college years. But he was pulled back in after spending years in QA circles for both THQ and Activision, mostly spending time helping to push forward the Guitar Hero series at its peak. Ozzie has become a big fan of platformers, puzzle games, shooters, and RPGs, just to name a few genres, but he’s also a huge sucker for anything with a good, compelling narrative behind it. Because what are video games if you can't enjoy a good story with a fresh Cherry Coke? Filed Under DEALS AND DISCOUNTS FEATURE DEALS WEEKEND PC DOWNLOAD DEALS Related Stories Remnant 2's The Awakened King DLC takes you back to Losomn to deal with a familiar threat Star Ocean: The Second Story R review: Epic adventure elevated Evening Reading - October 31, 2023 Robocop: Rogue City review: Packing heat... and parking tickets From The Chatty Refresh Go To Thread Shacknews Ozzie Mejia posted a new article, Weekend PC Download Deals for Oct. 27: Steam Scream returns © 1996 - 2023 Shacknews LTD. Company About Shacknews Shackpets Contact Us Privacy Policy Terms of Service Do It For Shacknews Facebook Twitter Twitch Youtube Subscribe",
    "originSummary": [
      "Several video game platforms like Steam, Battle.net, Epic Games Store, and Prime Gaming are offering significant discounts, from 20% to 88% off, for Halloween 2023.",
      "Noteworthy games on sale include Diablo 4, StarCraft 2, and Resident Evil 4, while some games, including Doom 3 and The Textorcist, are available for free on Prime Gaming within a certain timeframe.",
      "Other platforms like the Humble Bundle store, PlayStation Halloween sale, and Ubisoft Store are also holding similar sales, with many popular games at discounted prices."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1698844681509
  },
  {
    "title": "como apostar em starcraft 2",
    "originLink": "https://www.congonhas.mg.gov.br/index.php/category/destaque/?ios=bet-20/31-10-2023.html",
    "originBody": "CONHEÇA CONGONHAS SECRETARIAS TRANSPARÊNCIA CARTA DE SERVIÇOS SERVIDOR PÚBLICO FALE COM A PREFEITURA DESTAQUE EM CONGONHAS 31 de outubro de 2023 Destaque Notícias Obras Campo do bairro Lucas Monteiro recebe muro de gabião A Prefeitura de Congonhas continua com as obras de contenção pela cidade. As intervenções são fundamentais para garantir a segurança da população. A Secretaria de Obras e Infraestrutura faz a construção do muro de gabião do campo localizado no bairro Lucas Monteiro. No local foi feito o corte de terra, montagem das gaiolas e o […] Leia + Destaque Notícias Obras Novo acesso entre os bairros Vila Rica e Paschoal Vartulli recebe hidrossemeadura de taludes A hidrossemeadura é um processo indicado para proteção contra o efeito dos agentes erosivos. Durante essa semana, no novo acesso que liga os bairros Vila Rica e Paschoal Vartulli, essa técnica foi realizada nos taludes. Primeiramente foi feita a preparação para receber um composto de várias sementes e adubos. Após esse processo, com a ajuda […] Leia + Destaque Notícias Saúde Dengue, Chikungunya e Zika: Prefeitura alerta para os cuidados que população deve ter durante homenagem aos entes falecidos Evitar a proliferação da dengue, chikungunya e zika é um trabalho constante da Prefeitura de Congonhas durante todo o ano. Nesta quinta-feira, 2 de novembro, é celebrado o Dia dos Finados e essa data tem por objetivo principal relembrar a memória dos mortos, dos entes queridos que já se foram. Em Congonhas, diversas pessoas passam […] Leia + Destaque Leia mais Meio Ambiente Notícias Governo Municipal inicia projeto “Colorindo Congonhas”. Alegria e satisfação em morar em um local agradável é uma das preocupações do Governo Municipal com os congonhenses. Em parceria com o projeto “Se Essa Rua Fosse Minha”, através do Programa de Educação Ambiental – PEA da CSN Mineração, executado pela Fundação CSN e a Semad, com o apoio do Projeto Garoto Cidadão, a […] Leia + 30 de outubro de 2023 Destaque Notícias Saúde Sem categoria Congonhas contra a Sífilis Congonhas está atenta ao controle e prevenção da Sífilis. No mês de combate e conscientização contra a doença, o Governo Municipal promove ações de testagens e orientações em todas as Unidades Básicas de Saúde. Durante todo o ano, nas UBS’s são disponibilizados gratuitamente os testes para toda a população sexualmente ativa. Caso seja detectada, a […] Leia + Destaque Educação Leia mais Nota oficial Notícias Confira a 1º edição do Jornal da Educação! 📰📚Começamos a distribuir os Jornais da Educação para alunos e profissionais da área nesta segunda-feira. Quer saber tudo que já fizemos? Você pode baixar e ler a versão digital. Educação é nossa prioridade, afinal, as crianças e jovens são o futuro de nossa cidade! Isso é trabalho e amor por Congonhas! JORNAL EDUCAÇÃO Leia + 27 de outubro de 2023 Cultura Destaque Leia mais Nota oficial Notícias Inscrições prorrogadas, até o dia 08 de novembro, para entrega dos projetos da Lei Paulo Gustavo. O Governo Municipal de Congonhas realizou a escuta pública sobre a implementação da Lei e a elaboração dos editais recebendo aproximadamente 180 cadastros de agentes culturais. Todos os editais passaram por aprovação do Conselho Municipal de Cultura. Para que mais artistas participem deste grande projeto, entendendo os prazos para elaboração e entrega, fica prorrogado as […] Leia + 1 2 3 … 262 VAGAS DE EMPREGO Sistema nacional de empregos. PROTOCOLO ONLINE Acompanhamento e abertura de processos. LICITAÇÃO PÚBLICA Publicadas, em andamento e concluídas. PORTAL DA TRANSPARÊNCIA Prefeitura de Congonhas. DIÁRIO ELETRÔNICO Leis, decretos, portarias e demais publicações. TERMOS DE PARCERIAS Emendas, fomento e Acordos. SERVIÇOS TRIBUTÁRIOS Alvará, Certidões, ISS e validação de documentos. NOTA FISCAL ELETRÔNICA Cadastro e acesso a nota fiscal eletrônica. GUIA IPTU Obtenha a guia de pagamento LIVRO ELETRÔNICO Cadastro e acesso ao livro eletrônico. PREFEITURA MUNICIPAL DE CONGONHAS PRAÇA PRESIDENTE JUSCELINO KUBITSCHECK, 135, CENTRO CEP: 36410-064 TEL: (31) 3731-1300",
    "originSummary": [
      "The Municipality of Congonhas in Brazil is initiating various infrastructural and community health projects for resident welfare, including the construction of a gabion wall and creating a path between neighborhoods.",
      "The city is campaigning to prevent the spread of dengue, chikungunya, and zika virus. Through the \"Colorindo Congonhas\" initiative, authorities are focusing on creating a vibrant living atmosphere. The health sector is battling Syphilis with regular tests and guidance.",
      "Education resources are being improved for students and professionals, and the submission deadline for the Paulo Gustavo Law projects has been moved to November 8th."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1698844681509
  },
  {
    "title": "Cloud9 открыла подразделение по StarCraft II и подписала корейского ветерана",
    "originLink": "https://www.cybersport.ru/tags/starcraft-2/cloud9-otkryla-podrazdelenie-po-starcraft-ii-i-podpisala-koreiskogo-veterana",
    "originBody": "МАТЧИ ТУРНИРЫ КОМАНДЫ И ИГРОКИ БЛОГИ ИГРЫ ВОЙТИ Dota 2 CS2 Еще Прогнозы Косплей АКТУАЛЬНОЕ PARI PASS TI12 TI12 — конкурс Worlds 2023 билайн UP турнир Новость Cloud9 открыла подразделение по StarCraft II и подписала корейского ветерана 01.11.2023 в 10:47 7 Организация Cloud9 запустила подразделение по стратегии в реальном времени StarCraft II. Анонс состоялся в твиттере. Представителем C9 в этой дисциплине будет корейский игрок Кох GuMiho Бён Джэ. Он выступает на профессиональной сцене с 2010 года, за 13 лет карьеры Кох заработал более $290 тыс. призовых. В 2017 году GuMiho стал чемпионом GSL Code S, последний турнир этой серии, который состоялся в июле, кореец завершил на 3-4 месте. На момент публикации материала Кох выступает на 2023 Global StarCraft II League Season 3: Code S, 2 ноября он встретится с Ким Classic Дох Ву в полуфинале. Призовой фонд чемпионата составляет 34 млн корейских вон (около $25 тыс.). StarCraft II Трансферы Cloud9 GuMiho Classic GSL S2 — 2023 Global StarCraft II League Season 3: Code S 5 Медведева ответила, занималась ли любовью накануне соревнований 12 знаменитых актрис, внешность которых отталкивает мужчин В Америке жестко поиздевались над русским хоккеистом В РФ полным ходом идет модернизация одной из главных ж/д магистралей Отец Тайсона Фьюри узнал о пенсионере из РФ, остановившем грабителя Хотите записать ребёнка в спортивную школу? Зайдите на \"Госуслуги\" Виктория Дудакова разделась догола на взвешивании перед UFC 294 Налет эротизма. Загитова снова удивляет публику Льюиса арестовали за превышение скорости Самой красивой футболистке мира предложили переспать за деньги МАТЧИ СПОНСОР РУБРИКИ Реклама 18+ ПРОШЕДШИЕ LIVE БУДУЩИЕ Сегодня в 17:00 AG Monte Перейти на матч 2.20 1.60 Roobet Cup Сегодня в 20:00 FURIA VP Перейти на матч 2.52 1.46 Roobet Cup 02.11.23 в 11:00 NRG Weibo Gaming Перейти на матч 4.70 1.15 Worlds 02.11.23 в 20:00 TBD TBD Перейти на матч Roobet Cup 03.11.23 в 11:00 Gen.G Bilibili Перейти на матч 1.20 4.00 Worlds ВСЕ МАТЧИ Главные новости 01.11 в 15:57 СМИ: в 9Pandas останется Solo и ещё один игрок 30 01.11 в 15:55 Официально: zai объявил об уходе в инактив 7 01.11 в 15:03 S1mple: «Знаете, во что я хочу потом поиграть по прикольчику? В Clash Royale на компе» 11 01.11 в 14:46 Blitz после ухода zai: «Других изменений в составе не будет» 23 01.11 в 13:54 «Увидеть что-то типа Falcons.Miracle- — не такой уж и маленький шанс» — STORM намекнул на новую команду в Dota 2 26 Комментарии На сайте cybersport.ru применяются рекомендательные технологии. О нас Документы © Cybersport Media — All Rights Reserved 18+",
    "originSummary": [
      "Cloud9, a significant organization in esports, has initiated a division for the real-time strategy game StarCraft II and enlisted Koh GuMiho ByeonJae, a seasoned player from Korea.",
      "Since his start in 2010, GuMiho has earned over $290,000 from prizes, and in 2017, achieved the title of GSL Code S champion.",
      "Koh is presently taking part in the 2023 Global StarCraft II League Season 3: Code S, with the announcement made via Cloud9's Twitter account."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1698844681509
  }
]
