[
  {
    "id": 40723220,
    "title": "KidPix",
    "originLink": "https://kidpix.app",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40723220",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "KidPix (kidpix.app) привлек значительное внимание, набрав 809 очков, вызвав ностальгические обсуждения о его использовании в начале 90-х и его влиянии на детское творчество.",
      "Пользователи обсуждали технические проблемы, такие как сглаживание альфа-краев на инструментах карандаша и линии, предлагая решения, такие как отключение сглаживания или использование определенных свойств CSS.",
      "Разговоры также касались оригинального создателя, Крэйга Хикмана, его влияния на цифровое искусство и уместности названия инструмента, подчеркивая долговечное наследие KidPix."
    ],
    "points": 809,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1718753920
  },
  {
    "id": 40730156,
    "title": "Безопасный Суперинтеллект Инк.",
    "originLink": "https://ssi.inc",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40730156",
    "commentBody": "",
    "originSummary": [
      "Safe Superintelligence Inc. (SSI) — это первая лаборатория, полностью посвященная созданию безопасного суперинтеллекта, решающая вопросы безопасности и возможностей с помощью передовых инженерных и научных исследований.",
      "Компания стремится быстро развивать возможности суперинтеллекта, обеспечивая при этом безопасность, с миссией и бизнес-моделью, соответствующими этой цели.",
      "Компания SSI, расположенная в Пало-Альто и Тель-Авиве, набирает лучших технических специалистов для формирования специализированной команды, сосредоточенной исключительно на этом важном вызове."
    ],
    "commentSummary": [
      "Компания Safe Superintelligence Inc. (ssi.inc) разрабатывает передовую архитектуру ИИ под названием panoptic computronium cathedral™ и ставит приоритет на программирование, а не на публичные объявления.",
      "«Компания планирует разместить вакансии для тех, кто заинтересован в участии в их технологическом прорыве.»",
      "Существуют продолжающиеся дебаты о возможности и безопасности создания действительно безопасного ИИ, при этом некоторые ставят под сомнение практичность и потенциальные риски, связанные с этим."
    ],
    "points": 507,
    "commentCount": 325,
    "retryCount": 0,
    "time": 1718816776
  },
  {
    "id": 40726974,
    "title": "Разработчик Neofetch архивирует все свои репозитории: «Занялся фермерством»",
    "originLink": "https://github.com/dylanaraps",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40726974",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Разработчик Neofetch, популярного инструмента для отображения системной информации в командной строке, заархивировал все свои репозитории, ссылаясь на новую карьеру в сельском хозяйстве.",
      "Этот шаг вызвал обсуждения о трудностях и романтизированных взглядах на фермерство, при этом некоторые пользователи делятся своим опытом перехода от технологий к сельской жизни.",
      "«Объявление вызвало значительный интерес и дебаты в технологическом сообществе, подчеркивая более широкую тенденцию среди специалистов в области технологий к поиску изменений в образе жизни.»"
    ],
    "points": 342,
    "commentCount": 267,
    "retryCount": 0,
    "time": 1718794162
  },
  {
    "id": 40725983,
    "title": "Совет ЕС проголосует по предложению о сканировании чатов в четверг",
    "originLink": "https://www.patrick-breyer.de/en/posts/chat-control/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40725983",
    "commentBody": "",
    "originSummary": [
      "Предложение ЕС Chat Control 2.0 направлено на обязательное сканирование всех частных коммуникаций на наличие материалов, связанных с сексуальной эксплуатацией детей (CSEM), что фактически положит конец цифровой конфиденциальности.",
      "«Европейский парламент выступает против этого предложения, выступая за целенаправленное наблюдение с судебными ордерами и сохранение сквозного шифрования.»",
      "Значительное сопротивление возникло со стороны граждан, заинтересованных сторон и различных правительств ЕС, призывающих людей связаться со своими представителями, чтобы предотвратить принятие предложения."
    ],
    "commentSummary": [
      "Совет ЕС готовится к голосованию по предложению о сканировании чатов, что вызвало дебаты о конфиденциальности, демократии и роли национальных правительств в ЕС.",
      "Критики предупреждают, что это предложение может привести к массовой слежке и цензуре, тогда как сторонники утверждают, что оно необходимо для защиты детей.",
      "«Ситуация подчеркивает сложный характер политики ЕС и продолжающееся напряжение между национальным и общеевропейским уровнем принятия решений, при этом гражданам настоятельно рекомендуется высказывать свои мнения своим представителям.»"
    ],
    "points": 279,
    "commentCount": 280,
    "retryCount": 0,
    "time": 1718784315
  },
  {
    "id": 40723302,
    "title": "«Почему архитектуры, основанные на очередях сообщений, кажутся менее популярными сейчас?»",
    "originLink": "https://news.ycombinator.com/item?id=40723302",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40723302",
    "commentBody": "",
    "originSummary": [
      "«В конце 2000-х и начале 2010-х годов наблюдался значительный энтузиазм по поводу создания распределенных систем с использованием очередей сообщений, таких как Amazon SQS, RabbitMQ и ZeroMQ.»",
      "Текущее снижение обсуждений о системах очередей сообщений может быть связано с тем, что Redis решает многие задачи, улучшенные базы данных справляются с высокой нагрузкой, а также с осознанием того, что архитектуры, основанные на очередях сообщений, могут не всегда оправдывать ожидания.",
      "«Несмотря на уменьшившийся ажиотаж, очереди сообщений остаются широко используемыми, хотя технология стала более зрелой и менее интересной для написания.»"
    ],
    "commentSummary": [
      "Архитектуры, основанные на очередях сообщений, когда-то популярные в конце 2000-х и начале 2010-х годов, потеряли интерес по нескольким причинам.",
      "Redis и Kafka заняли многие области применения, при этом Redis используется для кэширования, а Kafka предпочитается для высокомасштабируемых приложений.",
      "Современные базы данных и осознание ограничений очередей сообщений привели к альтернативным подходам, делая технологию зрелой и менее захватывающей для обсуждения."
    ],
    "points": 277,
    "commentCount": 297,
    "retryCount": 0,
    "time": 1718754639
  },
  {
    "id": 40725214,
    "title": "«Мост Ферн Холлоу должен был быть закрыт за годы до его обрушения»",
    "originLink": "https://practical.engineering/blog/2024/6/18/this-bridge-should-have-been-closed-years-before-it-collapsed",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40725214",
    "commentBody": "",
    "originSummary": [
      "Мост Ферн Холлоу в Питтсбурге обрушился 28 января 2022 года после того, как более десяти лет находился в 'плохом состоянии', несмотря на многочисленные инспекции и рекомендации по ремонту.",
      "Отчет NTSB от февраля 2024 года подчеркнул системные недостатки в инспекции и обслуживании мостов, включая плохой дренаж, приводящий к сильной коррозии, и заниженные оценки нагрузок.",
      "«Обрушение было вызвано корродированной стяжной пластиной, а расследование NTSB выявило отсутствие последующих действий по рекомендациям по ремонту и плохую коммуникацию между инспекционными группами и владельцами моста.»"
    ],
    "commentSummary": [
      "Обрушение моста Ферн Холлоу подчеркивает критическую проблему конструктивно недостаточных мостов в США, число которых в 2023 году составило 42 391.",
      "Несмотря на проверки, выявлявшие проблемы, мост оставался открытым до его внезапного обрушения, что указывает на необходимость лучшего приоритезации и обслуживания инфраструктуры.",
      "Отчет NTSB и видео подчеркивают необходимость устранения как инженерных, так и организационных недостатков для предотвращения будущих инцидентов на фоне более широких проблем, связанных с недостаточным финансированием инфраструктуры и балансированием между обслуживанием и новым строительством."
    ],
    "points": 238,
    "commentCount": 144,
    "retryCount": 0,
    "time": 1718775953
  },
  {
    "id": 40723356,
    "title": "Open Source Python ETL",
    "originLink": "https://amphi.ai/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40723356",
    "commentBody": "",
    "originSummary": [
      "«Amphi — это инструмент ETL (извлечение, преобразование, загрузка) на основе Python, предназначенный для интеграции данных с низким уровнем кода, их извлечения и подготовки, поддерживающий такие форматы, как CSV и JSON.»",
      "«Он включает графический интерфейс для проектирования конвейеров данных, генерирует нативный код на Python, который можно развернуть в любом месте, и обеспечивает конфиденциальность данных за счет локальной обработки данных.»",
      "Amphi в настоящее время доступен для публичного бета-тестирования в Jupyterlab, продвигая разработку с минимальным кодированием, гибридное развертывание и сотрудничество в сообществе."
    ],
    "commentSummary": [
      "«Amphi.ai — это инструмент ETL (извлечение, преобразование, загрузка) с низким уровнем кода, который генерирует код на Python для развертывания, доступный в виде веб-приложения или расширения для JupyterLab.»",
      "Он поддерживает интеграцию файлов, подготовку данных, миграцию и AI-пайплайны, пользователи хвалят его за генерацию кода на Python и интеграцию с JupyterLab.",
      "Критики утверждают, что инструменты с низким кодом, такие как Amphi.ai, могут не подходить для сложных нужд ETL, и он лицензирован по Elastic License v2, а не является открытым исходным кодом."
    ],
    "points": 219,
    "commentCount": 103,
    "retryCount": 0,
    "time": 1718755343
  },
  {
    "id": 40722155,
    "title": "Amazon оштрафован на $5,9 млн за нарушение трудового законодательства в Калифорнии",
    "originLink": "https://www.washingtonpost.com/technology/2024/06/18/amazon-fine-labor-law-california/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40722155",
    "commentBody": "",
    "originSummary": [
      "Калифорния оштрафовала Amazon на 5,9 миллиона долларов за нарушение Закона о квотах на складе, который защищает работников от чрезмерных скоростей работы, угрожающих их здоровью и безопасности.",
      "Расследования на двух объектах Amazon возле Лос-Анджелеса показали, что компания не уведомила сотрудников о их рабочих квотах, что привело к штрафам в размере 1,2 миллиона долларов и 4,7 миллиона долларов для объектов в Редленде и Морено-Вэлли соответственно.",
      "Amazon оспаривает обвинения и подала апелляцию, в то время как продолжает сталкиваться с пристальным вниманием к своим трудовым практикам, с аналогичными законами, появляющимися в других штатах, и предложенным федеральным законопроектом."
    ],
    "commentSummary": [
      "Amazon была оштрафована на $5,9 млн за то, что не раскрыла сотрудникам на двух складах в Калифорнии производственные квоты, нарушив трудовое законодательство штата.",
      "Штраф вызвал дебаты о его адекватности, некоторые утверждают, что он должен быть пропорционален огромным доходам Amazon, чтобы служить сдерживающим фактором.",
      "«Обсуждение охватывает более широкие вопросы прав трудящихся, корпоративной ответственности и эффективности текущих регулирующих мер.»"
    ],
    "points": 218,
    "commentCount": 226,
    "retryCount": 0,
    "time": 1718744377
  },
  {
    "id": 40724283,
    "title": "Google Gemini пытался меня убить",
    "originLink": "https://old.reddit.com/r/ChatGPT/comments/1diljf2/google_gemini_tried_to_kill_me/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40724283",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "«Пост на Reddit обсуждает опасности Google Gemini, генеративного ИИ, после того как он неправильно идентифицировал ядовитый гриб, подчеркивая риски использования больших языковых моделей (LLM) для получения критической информации.»",
      "Разговор подчеркивает, что большие языковые модели могут давать правдоподобные, но неверные ответы, что требует проверки человеком, чтобы избежать потенциально вредных последствий.",
      "«Пост подчеркивает важность ответственного использования ИИ и необходимость для бизнеса проверять результаты работы ИИ, чтобы предотвратить вред клиентам и возможные юридические проблемы.»"
    ],
    "points": 199,
    "commentCount": 133,
    "retryCount": 0,
    "time": 1718765432
  },
  {
    "id": 40729501,
    "title": "Быстрые преступления в школе Лямбда",
    "originLink": "https://www.sandofsky.com/lambda-school/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40729501",
    "commentBody": "",
    "originSummary": [
      "Первоначальный успех: Школа Лямбда, запущенная в 2017 году, быстро завоевала популярность благодаря своей модели соглашения о разделе доходов (ISA), привлекая значительные венчурные инвестиции.",
      "Падение: Утечка коммуникаций в 2020 году выявила низкие показатели трудоустройства и финансовую нестабильность, что привело к обвинениям в введении в заблуждение студентов и инвесторов.",
      "Ребрендинг и упадок: Переименованная в «Институт технологий Блум», компания продолжала испытывать трудности, сталкиваясь с многочисленными увольнениями, уходами руководителей и продолжающимися юридическими проблемами."
    ],
    "commentSummary": [
      "Школа Lambda столкнулась с такими проблемами, как поиск подходящих студентов, скептицизм по поводу заявлений буткемпа и проблемы со структурой программы и методами обучения.",
      "«Договоры о разделе доходов (ISA) школы подверглись критике как хищнические и вводящие в заблуждение, что привело к неоднозначным впечатлениям среди бывших преподавателей и студентов.»",
      "Более широкое обсуждение подчеркнуло сложность обучения программированию и необходимость реалистичных ожиданий и улучшенных систем поддержки."
    ],
    "points": 197,
    "commentCount": 107,
    "retryCount": 0,
    "time": 1718812648
  },
  {
    "id": 40723150,
    "title": "Перехват TCP вне пути в Wi-Fi сетях с поддержкой NAT",
    "originLink": "https://blog.apnic.net/2024/06/18/off-path-tcp-hijacking-in-nat-enabled-wi-fi-networks/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40723150",
    "commentBody": "",
    "originSummary": [
      "«Исследование Юсянга Янга и его коллег выявляет уязвимости в Wi-Fi сетях, в частности в обработке NAT (Network Address Translation) маршрутизатора, что позволяет осуществлять захват TCP-соединений вне пути.»",
      "Исследование, принятое NDSS 2024, протестировало 67 маршрутизаторов от 30 производителей, обнаружив уязвимости в 52 из них, и выявило, что 75 из 93 реальных Wi-Fi сетей подвержены риску.",
      "Стратегии смягчения последствий включают случайное распределение портов, проверку обратного пути и проверку окна TCP, при этом некоторые производители уже выпустили патчи в ответ на эти выводы."
    ],
    "commentSummary": [
      "«В техническом документе о CVE-2022-32296 раскрывается уязвимость перехвата TCP вне пути в сетях Wi-Fi с поддержкой NAT, которая была исправлена в Linux 5.17.9.»",
      "Смягчающие меры включают включение rp_filter, использование HTTPS в Firefox, случайное распределение портов NAT, проверку обратного пути и проверку окна TCP.",
      "Обсуждение подчеркивает влияние уязвимости на маршрутизаторы, роль NAT и важность методов шифрования, таких как IPSec или TLS, при этом некоторые предлагают переход на IPv6, чтобы избежать проблем с NAT типа «многие к одному»."
    ],
    "points": 192,
    "commentCount": 74,
    "retryCount": 0,
    "time": 1718753256
  },
  {
    "id": 40726426,
    "title": "Мониторинг морского мусора из космоса теперь стал реальностью",
    "originLink": "https://www.esa.int/Enabling_Support/Space_Engineering_Technology/Monitoring_marine_litter_from_space_is_now_a_reality",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40726426",
    "commentBody": "",
    "originSummary": [
      "Новое исследование ESA Discovery продемонстрировало возможность использования спутников для мониторинга плавающего пластикового мусора в океане, как сообщается в Nature Communications.",
      "«Исследование использовало 300 000 спутниковых изображений за шесть лет для сканирования Средиземного моря, выявив тысячи плотных скоплений пластика, что привело к созданию самой подробной карты загрязнения морским мусором на сегодняшний день.»",
      "«Результаты подчеркивают потенциал использования специализированных датчиков для улучшения возможностей мониторинга, что также может быть полезно для обнаружения разливов нефти и проведения поисково-спасательных операций.»"
    ],
    "commentSummary": [
      "Мониторинг морского мусора из космоса теперь возможен, что улучшает отслеживание и учет загрязнения океана.",
      "Миссия Sentinel-2, охватывающая глобальные наземные поверхности и прибрежные воды, представляет собой значительный прогресс, хотя остаются трудности в мониторинге открытых океанов.",
      "Видимость загрязнения океана возросла, подчеркивая необходимость комплексных решений, несмотря на продолжающиеся политические, инфраструктурные и образовательные проблемы."
    ],
    "points": 181,
    "commentCount": 77,
    "retryCount": 0,
    "time": 1718788534
  },
  {
    "id": 40722317,
    "title": "Я создал приложение для перевода с открытым исходным кодом и локальной поддержкой",
    "originLink": "https://github.com/niedev/RTranslator",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40722317",
    "commentBody": "",
    "originSummary": [
      "Разработчик создал приложение для синхронного перевода для Android, изначально используя API Google из-за отсутствия бесплатных, качественных решений.",
      "«После университета разработчик обновил приложение, чтобы использовать Whisper от OpenAI для распознавания речи и NLLB от Meta для перевода, оба работающие локально, сделав его бесплатным и с открытым исходным кодом.»",
      "Приложение в настоящее время находится в стадии бета-тестирования, и разработчик ищет отзывы пользователей."
    ],
    "commentSummary": [
      "Разработано приложение для перевода на Android с открытым исходным кодом, которое изначально использовало API Google, но теперь использует Whisper от OpenAI для распознавания речи и NLLB от Meta для перевода, оба работают локально.",
      "Приложение находится в стадии бета-тестирования, и разработчик ищет отзывы, планируя обновить политику конфиденциальности и решить проблемы с инициализацией TTS (текст-в-речь) на некоторых устройствах.",
      "Будущие улучшения включают в себя улучшение пользовательского интерфейса (UI) и, возможно, выпуск версии для iOS, если будет достаточная поддержка."
    ],
    "points": 177,
    "commentCount": 47,
    "retryCount": 0,
    "time": 1718746011
  },
  {
    "id": 40724201,
    "title": "Сенат США принял законопроект в поддержку развертывания передовых ядерных технологий",
    "originLink": "https://www.reuters.com/business/energy/us-senate-passes-bill-support-advanced-nuclear-energy-deployment-2024-06-19/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40724201",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Сенат США принял законопроект в поддержку развертывания передовых ядерных технологий, направленный на снижение регуляторных барьеров и продвижение их использования.",
      "Несмотря на историческую конкуренцию с углем и нынешнее доминирование более дешевой солнечной энергии, сторонники считают, что дерегулирование и технологические достижения могут сделать ядерную энергию конкурентоспособной.",
      "Законопроект теперь ожидает подписи президента Байдена, при этом критики утверждают, что ядерная энергия остается дорогой и сложной."
    ],
    "points": 171,
    "commentCount": 189,
    "retryCount": 0,
    "time": 1718764536
  },
  {
    "id": 40727022,
    "title": "Астрономы наблюдают пробуждение черной дыры в реальном времени",
    "originLink": "https://www.eso.org/public/germany/news/eso2409/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40727022",
    "commentBody": "",
    "originSummary": [
      "«ESO (Европейская Южная Обсерватория) поддерживает глобальные астрономические исследования, проектируя и эксплуатируя обсерватории мирового класса, с штаб-квартирой в Германии и телескопами в Чили.»",
      "«Недавнее исследование, опубликованное в журнале Astronomy & Astrophysics, наблюдало внезапное яркое свечение галактики SDSS1335+0728, вероятно, из-за активации массивной черной дыры, что стало первой в реальном времени наблюдаемой записью такого события.»",
      "Это открытие, впервые замеченное в декабре 2019 года, продолжает интриговать ученых, так как галактика остается яркой, предоставляя новые данные о поведении черных дыр."
    ],
    "commentSummary": [
      "Астрономы наблюдали, как черная дыра в галактике SDSS1335+0728 внезапно стала активной, излучая газ и энергию, что предполагает её «пробуждение».",
      "Это событие, происходящее на расстоянии 300 миллионов световых лет, изучается в реальном времени с использованием различных обсерваторий, и для подтверждения теории необходимы дальнейшие наблюдения.",
      "Открытие вызвало обсуждения и дебаты о природе черных дыр и космических событий среди научного сообщества."
    ],
    "points": 167,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1718794642
  }
]
