[
  {
    "id": 40723220,
    "title": "KidPix",
    "originLink": "https://kidpix.app",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40723220",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "KidPix (kidpix.app) 809 புள்ளிகளுடன் முக்கிய கவனத்தை பெற்றது, 90களின் தொடக்கத்தில் அதன் பயன்பாடு மற்றும் குழந்தைகளின் படைப்பாற்றலின் மீது அதன் தாக்கம் பற்றிய நினைவூட்டல்களை தூண்டியது.",
      "பயனர்கள் பென்சில் மற்றும் கோடு கருவிகளில் அல்பா விளிம்புகளை மிருதுவாக்குதல் போன்ற தொழில்நுட்ப பிரச்சினைகளை விவாதித்தனர், எதிர்கால தீர்வுகளைப் பரிந்துரைத்தனர், உதாரணமாக, எதிர்மறை விளிம்புகளை அணைக்க அல்லது குறிப்பிட்ட CSS பண்புகளைப் பயன்படுத்த.",
      "உரையாடல்கள் முதன்மை உருவாக்குனர் கிரேக் ஹிக்மேன், அவரது டிஜிட்டல் கலை மீது உள்ள தாக்கம், மற்றும் கருவியின் பெயரின் பொருத்தம் ஆகியவற்றையும் தொட்டன. இதனால் KidPix இன் நீடித்த பாரம்பரியம் வெளிப்படுத்தப்பட்டது."
    ],
    "points": 809,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1718753920
  },
  {
    "id": 40730156,
    "title": "சேஃப் சூப்பர்இன்டெலிஜென்ஸ் இன்க்.",
    "originLink": "https://ssi.inc",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40730156",
    "commentBody": "",
    "originSummary": [
      "Safe Superintelligence Inc. (SSI) என்பது பாதுகாப்பான சூப்பர்இன்டெலிஜென்ஸ் உருவாக்குவதற்காக மட்டுமே அர்ப்பணிக்கப்பட்ட முதல் ஆய்வகம் ஆகும், இது மேம்பட்ட பொறியியல் மற்றும் அறிவியல் ஆராய்ச்சியின் மூலம் பாதுகாப்பு மற்றும் திறன்களை இரண்டையும் கையாள்கிறது.",
      "நிறுவனம் பாதுகாப்பை உறுதிப்படுத்தி, அதிவேகமாக மேம்பட்ட சூப்பர்இன்டெலிஜென்ஸ் திறன்களை முன்னேற்றுவதற்கான நோக்கத்துடன், இந்த இலக்கை நோக்கி இணைந்த ஒரு பணி மற்றும் வணிக மாதிரியை கொண்டுள்ளது.",
      "பாலோ ஆல்டோ மற்றும் தெல் அவிவில் அமைந்துள்ள எஸ்எஸ்ஐ, இந்த முக்கிய சவாலில் மட்டும் கவனம் செலுத்தும் சிறப்பு குழுவை உருவாக்க சிறந்த தொழில்நுட்ப திறமைகளை ஆட்சேர்ப்பு செய்கிறது."
    ],
    "commentSummary": [
      "Safe Superintelligence Inc. (ssi.inc) ஒரு மேம்பட்ட AI கட்டமைப்பை உருவாக்கி வருகிறது, இதற்கு panoptic computronium cathedral™ என்று பெயர், மேலும் பொது அறிவிப்புகளை விட குறியீட்டு பணிகளை முன்னுரிமையாகக் கொள்கிறது.",
      "நிறுவனம் தங்களின் தொழில்நுட்ப முன்னேற்றத்திற்கு பங்களிக்க ஆர்வமுள்ளவர்களுக்கு வேலை வாய்ப்புகளை வெளியிட திட்டமிட்டுள்ளது.",
      "ஒரு உண்மையான பாதுகாப்பான செயற்கை நுண்ணறிவை உருவாக்குவதின் சாத்தியக்கூறுகள் மற்றும் பாதுகாப்பு குறித்து தொடர்ந்து விவாதங்கள் நடைபெற்று வருகின்றன, இதில் சிலர் நடைமுறைக்கு எதிரான கேள்விகள் மற்றும் சாத்தியமான ஆபத்துகளை எழுப்புகின்றனர்."
    ],
    "points": 507,
    "commentCount": 325,
    "retryCount": 0,
    "time": 1718816776
  },
  {
    "id": 40726974,
    "title": "Neofetch டெவலப்பர் தனது அனைத்து ரிப்போசிடரிகளையும் காப்பகமாக்குகிறார்: \"விவசாயத்தை எடுத்துக்கொண்டேன்\"",
    "originLink": "https://github.com/dylanaraps",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40726974",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Neofetch என்ற பிரபலமான கட்டளை வரி அமைப்பு தகவல் கருவியின் உருவாக்குனர், விவசாயத்தில் புதிய தொழில் காரணமாக, தனது அனைத்து களஞ்சியங்களையும் காப்பகமாக்கியுள்ளார்.",
      "இந்த நடவடிக்கை விவசாயத்தின் சவால்கள் மற்றும் கற்பனையான பார்வைகள் குறித்து விவாதங்களை ஏற்படுத்தியுள்ளது, சில பயனர்கள் தங்களின் தொழில்நுட்பத்திலிருந்து கிராமப்புற வாழ்க்கைக்கு மாறிய அனுபவங்களை பகிர்ந்து கொள்கின்றனர்.",
      "அறிவிப்பு தொழில்நுட்ப சமூகத்தில் முக்கியமான ஆர்வத்தையும் விவாதத்தையும் உருவாக்கியுள்ளது, தொழில்நுட்ப வல்லுநர்கள் வாழ்க்கை முறை மாற்றங்களை நாடும் பரந்த போக்கை வெளிப்படுத்துகிறது."
    ],
    "points": 342,
    "commentCount": 267,
    "retryCount": 0,
    "time": 1718794162
  },
  {
    "id": 40725983,
    "title": "ஐரோப்பிய ஒன்றியக் கவுன்சில் வியாழக்கிழமை உரையாடல் ஸ்கேனிங் முன்மொழிவை வாக்கெடுப்பில் போட உள்ளது",
    "originLink": "https://www.patrick-breyer.de/en/posts/chat-control/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40725983",
    "commentBody": "",
    "originSummary": [
      "EU இன் Chat Control 2.0 முன்மொழிவு குழந்தை பாலியல் சுரண்டல் பொருட்கள் (CSEM) க்கான அனைத்து தனிப்பட்ட தொடர்புகளையும் ஸ்கேன் செய்ய கட்டாயமாக்க முயல்கிறது, இது டிஜிட்டல் தனியுரிமையை முடிவுக்கு கொண்டு வரும்.",
      "ஐரோப்பிய பாராளுமன்றம் இந்த முன்மொழிவுக்கு எதிராக உள்ளது, நீதிமன்ற உத்தரவுகளுடன் குறிவைத்த கண்காணிப்பையும், முடிவு முதல் முடிவு வரை குறியாக்கத்தை பாதுகாப்பதையும் ஆதரிக்கிறது.",
      "பிரமுகமான எதிர்ப்பு குடிமக்கள், பங்குதாரர்கள் மற்றும் பல்வேறு ஐரோப்பிய ஒன்றிய அரசுகளிடமிருந்து எழுந்துள்ளது, மக்களை தங்கள் பிரதிநிதிகளை தொடர்பு கொண்டு இந்த முன்மொழிவின் ஏற்றத்தைத் தடுக்குமாறு கேட்டுக்கொள்கின்றது."
    ],
    "commentSummary": [
      "EU கவுன்சில் ஒரு உரையாடல் ஸ்கேனிங் முன்மொழிவை வாக்களிக்கத் தயாராக உள்ளது, இது தனியுரிமை, ஜனநாயகம் மற்றும் EU இல் தேசிய அரசாங்கங்களின் பங்குகள் குறித்து விவாதங்களை ஏற்படுத்தியுள்ளது.",
      "விமர்சகர்கள் இந்த முன்மொழிவு பெருமளவு கண்காணிப்பு மற்றும் தணிக்கையை ஏற்படுத்தும் என்று எச்சரிக்கின்றனர், ஆனால் ஆதரவாளர்கள் இது குழந்தைகள் பாதுகாப்புக்கு அவசியம் என்று வாதிடுகின்றனர்.",
      "நிலைமை, ஐரோப்பிய ஒன்றிய அரசியலின் சிக்கலான தன்மையையும், தேசிய மற்றும் ஐரோப்பிய ஒன்றிய மட்டத்தில் நடைபெறும் முடிவெடுப்புகளுக்கிடையேயான தொடர்ந்துவரும் பதற்றத்தையும் வலியுறுத்துகிறது, குடிமக்கள் தங்கள் பிரதிநிதிகளிடம் தங்கள் கருத்துகளை தெரிவிக்குமாறு கேட்டுக்கொள்ளப்படுகிறார்கள்."
    ],
    "points": 279,
    "commentCount": 280,
    "retryCount": 0,
    "time": 1718784315
  },
  {
    "id": 40723302,
    "title": "செய்தி வரிசை அடிப்படையிலான கட்டமைப்புகள் ஏன் இப்போது குறைவாக பிரபலமாக உள்ளன?",
    "originLink": "https://news.ycombinator.com/item?id=40723302",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40723302",
    "commentBody": "",
    "originSummary": [
      "2000களின் இறுதியில் மற்றும் 2010களின் தொடக்கத்தில், Amazon SQS, RabbitMQ, மற்றும் ZeroMQ போன்ற செய்தி வரிசைகளைப் பயன்படுத்தி பகிர்ந்தளிக்கப்பட்ட அமைப்புகளை உருவாக்குவதற்கான பெரும் ஆர்வம் இருந்தது.",
      "தற்போதைய செய்தி வரிசைகள் பற்றிய விவாதத்தின் குறைவு, பல பயன்பாடுகளை தீர்க்கும் Redis, மேம்பட்ட தரவுத்தொகுப்புகள் அதிக அளவிலான செயல்பாடுகளை கையாளுதல், மற்றும் செய்தி வரிசை அடிப்படையிலான கட்டமைப்புகள் எப்போதும் எதிர்பார்ப்புகளை பூர்த்தி செய்யாது என்பதற்கான உணர்வு ஆகியவற்றால் ஏற்படலாம்.",
      "பெரிய பரபரப்பு குறைந்திருந்தாலும், செய்தி வரிசைகள் பரவலாக பயன்படுத்தப்படுகின்றன, ஆனால் தொழில்நுட்பம் முதிர்ந்து, அதைப் பற்றி எழுதுவது குறைவாகவே உள்ளது."
    ],
    "commentSummary": [
      "செய்தி வரிசை அடிப்படையிலான கட்டமைப்புகள், 2000களின் இறுதியில் மற்றும் 2010களின் தொடக்கத்தில் பிரபலமாக இருந்தபோதிலும், பல காரணங்களால் ஆர்வம் குறைந்துவிட்டது.",
      "Redis மற்றும் Kafka பல பயன்பாடுகளை கைப்பற்றியுள்ளன, Redis காட்சிங்கை கையாளுவதற்கும், Kafka உயர் அளவிலான பயன்பாடுகளுக்கு விரும்பப்படுவதற்கும்.",
      "நவீன தரவுத்தொகுப்புகள் மற்றும் செய்தி வரிசைகளின் வரம்புகளை உணர்வது மாற்று அணுகுமுறைகளை உருவாக்கியுள்ளது, இதனால் தொழில்நுட்பம் முதிர்ச்சியடைந்து விவாதிக்க குறைவாக சுவாரஸ்யமாகியுள்ளது."
    ],
    "points": 277,
    "commentCount": 297,
    "retryCount": 0,
    "time": 1718754639
  },
  {
    "id": 40725214,
    "title": "பெர்ன் ஹாலோ பாலம் இடிந்து விழுவதற்கு பல ஆண்டுகள் முன்பே மூடப்பட வேண்டும்",
    "originLink": "https://practical.engineering/blog/2024/6/18/this-bridge-should-have-been-closed-years-before-it-collapsed",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40725214",
    "commentBody": "",
    "originSummary": [
      "பிட்ஸ்பர்க் நகரில் உள்ள ஃபெர்ன் ஹாலோ பாலம், பல ஆய்வுகள் மற்றும் பழுது பராமரிப்பு பரிந்துரைகள் இருந்தபோதிலும், ஒரு தசாப்தத்திற்கு மேலாக 'மோசமான நிலை'யில் இருந்த பிறகு, 2022 ஜனவரி 28 அன்று இடிந்து விழுந்தது.",
      "2024 பிப்ரவரியில் வெளியிடப்பட்ட NTSB அறிக்கை பாலம் ஆய்வு மற்றும் பராமரிப்பில் அமைப்புசார்ந்த குறைபாடுகளை வெளிப்படுத்தியது, அதில் மோசமான வடிகால் ஏற்பாடுகள் கடுமையான துருப்பிடிப்பை ஏற்படுத்தியது மற்றும் குறைவாக மதிப்பீடு செய்யப்பட்ட சுமை மதிப்பீடுகள் அடங்கும்.",
      "சரிவு ஒரு கறைந்த டை பிளேட் காரணமாக ஏற்பட்டது, மேலும் NTSB இன் விசாரணை பழுது பார்க்கும் பரிந்துரைகளின் தொடர்ச்சியின்மையும், ஆய்வு குழுக்கள் மற்றும் பாலம் உரிமையாளர்களுக்கு இடையிலான மோசமான தொடர்பும் வெளிப்படுத்தியது."
    ],
    "commentSummary": [
      "\"Fern Hollow Bridge\" பாலம் இடிந்து விழுந்தது, 2023 இல் 42,391 இவ்வாறான பாலங்கள் அடையாளம் காணப்பட்டுள்ள நிலையில், அமெரிக்காவில் கட்டமைப்பில் குறைபாடுள்ள பாலங்களின் முக்கிய பிரச்சினையை வலியுறுத்துகிறது.",
      "தரிசனங்கள் பிரச்சினைகளை வெளிப்படுத்தினாலும், மேம்பாலம் திடீரென சரிந்தது வரை திறந்தே இருந்தது, இது மேம்பட்ட உட்கட்டமைப்பு முன்னுரிமை மற்றும் பராமரிப்பு தேவையை சுட்டிக்காட்டுகிறது.",
      "நடப்பு சவால்களான போதிய இல்லாத உள்கட்டமைப்பு நிதி மற்றும் புதிய கட்டுமானத்துடன் பராமரிப்பை சமநிலைப்படுத்துதல் ஆகியவற்றின் மத்தியில், எதிர்கால சம்பவங்களைத் தடுக்க பொறியியல் மற்றும் அமைப்புச் சிக்கல்களைத் தீர்க்க NTSB அறிக்கையும் வீடியோவும் முக்கியத்துவம் கொடுக்கின்றன."
    ],
    "points": 238,
    "commentCount": 144,
    "retryCount": 0,
    "time": 1718775953
  },
  {
    "id": 40723356,
    "title": "திறந்த மூல பைதான் ETL",
    "originLink": "https://amphi.ai/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40723356",
    "commentBody": "",
    "originSummary": [
      "Amphi என்பது குறைந்த குறியீட்டு தரவுகள் ஒருங்கிணைப்பு, எடுக்கும், மாற்றும், ஏற்றும் (ETL) கருவியாக வடிவமைக்கப்பட்ட பைதான் அடிப்படையிலான கருவியாகும், இது CSV மற்றும் JSON போன்ற வடிவங்களை ஆதரிக்கிறது.",
      "இது தரவுப் பாதைகளை வடிவமைக்க ஒரு கிராபிகல் இடைமுகத்தை கொண்டுள்ளது, எங்கு வேண்டுமானாலும் பயன்படுத்தக்கூடிய சொந்த Python குறியீட்டை உருவாக்குகிறது, மற்றும் தரவுகளை உள்ளூராக செயலாக்குவதன் மூலம் தரவுப் தனியுரிமையை உறுதிப்படுத்துகிறது.",
      "Amphi தற்போது Jupyterlab இல் பொது பீட்டாவாக கிடைக்கிறது, குறைந்த குறியீட்டு மேம்பாடு, கலப்பு பிரயோகம், மற்றும் சமூக ஒத்துழைப்பை ஊக்குவிக்கிறது."
    ],
    "commentSummary": [
      "Amphi.ai என்பது Python குறியீட்டைப் பயன்படுத்தி செயல்படுத்துவதற்கான குறைந்த குறியீட்டு ETL (Extract, Transform, Load) கருவியாகும், இது வலை பயன்பாடு அல்லது JupyterLab நீட்டிப்பாக கிடைக்கிறது.",
      "இது கோப்பு ஒருங்கிணைப்பு, தரவுத் தயாரிப்பு, இடமாற்றம் மற்றும் AI குழாய்களை ஆதரிக்கிறது, பயனர்கள் அதன் பைதான் குறியீட்டு உருவாக்கம் மற்றும் ஜூபிடர் லேப் ஒருங்கிணைப்பை பாராட்டுகின்றனர்.",
      "விமர்சகர்கள் Amphi.ai போன்ற குறைந்த குறியீட்டு கருவிகள் சிக்கலான ETL தேவைகளுக்கு பொருத்தமாக இருக்காது என்று வாதிடுகின்றனர், மேலும் இது திறந்த மூலமாக இல்லாமல் Elastic License v2 இல் உரிமம் பெற்றுள்ளது."
    ],
    "points": 219,
    "commentCount": 103,
    "retryCount": 0,
    "time": 1718755343
  },
  {
    "id": 40722155,
    "title": "அமேசான் கலிபோர்னியாவில் தொழிலாளர் சட்டத்தை மீறியதற்காக $5.9 மில்லியன் அபராதம் விதிக்கப்பட்டது",
    "originLink": "https://www.washingtonpost.com/technology/2024/06/18/amazon-fine-labor-law-california/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40722155",
    "commentBody": "",
    "originSummary": [
      "காலிஃபோர்னியா அமேசானுக்கு $5.9 மில்லியன் அபராதம் விதித்தது, இது கையிருப்பு ஒதுக்கீட்டு சட்டத்தை மீறியது, இது தொழிலாளர்களை அவர்களின் ஆரோக்கியம் மற்றும் பாதுகாப்புக்கு ஆபத்தை ஏற்படுத்தும் அதிக வேக வேலைகளிலிருந்து பாதுகாக்கிறது.",
      "லாஸ் ஏஞ்சலஸ் அருகிலுள்ள இரண்டு அமேசான் நிறுவனங்களில் மேற்கொள்ளப்பட்ட விசாரணைகள், நிறுவனத்தின் பணியாளர்களுக்கு அவர்களின் வேலை ஒதுக்கீடுகளை அறிவிக்க தவறியதை வெளிப்படுத்தியது, இதன் விளைவாக ரெட்லாண்ட் மற்றும் மொரேனோ பள்ளத்தாக்கு நிறுவனங்களுக்கு முறையே $1.2 மில்லியன் மற்றும் $4.7 மில்லியன் அபராதம் விதிக்கப்பட்டது.",
      "அமேசான் குற்றச்சாட்டுகளை எதிர்த்து முறையிட்டுள்ளது, இதற்கிடையில் அதன் வேலைப்பாடுகள் தொடர்பான தொடர்ச்சியான கண்காணிப்புக்கு முகம்கொடுத்து வருகிறது, இதே போன்ற சட்டங்கள் பிற மாநிலங்களில் உருவாகி வருகின்றன மற்றும் föடரல் மசோதா முன்மொழியப்பட்டுள்ளது."
    ],
    "commentSummary": [
      "Amazon க்கு $5.9 மில்லியன் அபராதம் விதிக்கப்பட்டது, இரண்டு கலிபோர்னியா கிடங்குகளில் பணியாளர்களுக்கு உற்பத்தித் தரங்களை வெளிப்படுத்தாததற்காக, மாநில தொழிலாளர் சட்டத்தை மீறியது.",
      "அமேசானின் பெரும் வருமானத்திற்கு ஏற்ப தடுக்கக்கூடியதாக இருக்க வேண்டும் என்று சிலர் வாதிடுவதால், அபராதம் அதன் போதுமான தன்மையைப் பற்றி விவாதத்தை ஏற்படுத்தியுள்ளது.",
      "சர்ச்சை தொழிலாளர் உரிமைகள், நிறுவன பொறுப்புணர்வு, மற்றும் தற்போதைய ஒழுங்குமுறை நடவடிக்கைகளின் செயல்திறன் போன்ற பரந்த பிரச்சினைகளுக்கு விரிகிறது."
    ],
    "points": 218,
    "commentCount": 226,
    "retryCount": 0,
    "time": 1718744377
  },
  {
    "id": 40724283,
    "title": "Google Gemini என்னைக் கொல்ல முயன்றது",
    "originLink": "https://old.reddit.com/r/ChatGPT/comments/1diljf2/google_gemini_tried_to_kill_me/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40724283",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "ஒரு ரெடிட் பதிவு, ஜெனரேட்டிவ் ஏஐ ஆன கூகுள் ஜெமினியின் ஆபத்துகளைப் பற்றி விவாதிக்கிறது, இது ஒரு நச்சு காளானையை தவறாக அடையாளம் கண்ட பிறகு, முக்கியமான தகவல்களுக்கு பெரிய மொழி மாதிரிகளை (LLMs) நம்புவதின் அபாயங்களை வெளிப்படுத்துகிறது.",
      "உரையாடல், LLMக்கள் நம்பகமானதாக தோன்றும் ஆனால் தவறான பதில்களை உருவாக்க முடியும் என்பதை வலியுறுத்துகிறது, இது மனித சரிபார்ப்பை தேவைப்படுத்துகிறது, ஏனெனில் தவறான விளைவுகளை தவிர்க்க வேண்டும்.",
      "பதிவு பொறுப்பான செயற்கை நுண்ணறிவு பயன்பாட்டின் முக்கியத்துவத்தை மற்றும் வாடிக்கையாளர் சேதம் மற்றும் சாத்தியமான சட்ட பிரச்சினைகளைத் தவிர்க்க AI வெளியீடுகள் பரிசீலிக்கப்பட வேண்டும் என்பதற்கான தேவையை வலியுறுத்துகிறது."
    ],
    "points": 199,
    "commentCount": 133,
    "retryCount": 0,
    "time": 1718765432
  },
  {
    "id": 40729501,
    "title": "லாம்ப்டா பள்ளியில் வேகமான குற்றங்கள்",
    "originLink": "https://www.sandofsky.com/lambda-school/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40729501",
    "commentBody": "",
    "originSummary": [
      "**ஆரம்ப வெற்றி:** 2017 இல் தொடங்கப்பட்ட லாம்டா பள்ளி, அதன் வருமானப் பகிர்வு ஒப்பந்த (ISA) மாதிரியுடன் வேகமாக பிரபலமடைந்து, முக்கியமான வென்சர் மூலதனத்தை ஈர்த்தது.",
      "**தோல்வி:** 2020 இல் கசியவிடப்பட்ட தொடர்புகள் மோசமான வேலைவாய்ப்பு விகிதங்கள் மற்றும் நிதி நிலைத்தன்மையின்மையை வெளிப்படுத்தின, இது மாணவர்களையும் முதலீட்டாளர்களையும் தவறாக வழிநடத்தியதாக குற்றச்சாட்டுகளை ஏற்படுத்தியது.",
      "**மீள்பிராண்ட் மற்றும் சரிவு:** \"த ப்ளூம் இன்ஸ்டிடியூட் ஆஃப் டெக்னாலஜி\" என மீள்பிராண்ட் செய்யப்பட்டு, அந்த நிறுவனம் பல்வேறு பணிநீக்கங்கள், நிர்வாக அதிகாரிகளின் விலகல்கள் மற்றும் தொடர்ச்சியான சட்ட பிரச்சினைகளை எதிர்கொண்டது."
    ],
    "commentSummary": [
      "Lambda School பல சவால்களை சந்தித்தது, உதாரணமாக தகுதியான மாணவர்களை கண்டுபிடிப்பது, புட்கேம்ப் குறித்த சந்தேகங்கள், மற்றும் திட்ட அமைப்பு மற்றும் கற்பித்தல் முறைகளில் சிக்கல்கள்.",
      "பள்ளியின் வருமான பகிர்வு ஒப்பந்தங்கள் (ISAs) பேராசையாகவும் தவறாக வழிநடத்துவதாகவும் விமர்சிக்கப்பட்டன, இதனால் முந்தைய ஆசிரியர்கள் மற்றும் மாணவர்களுக்கு கலவையான அனுபவங்கள் ஏற்பட்டன.",
      "விரிவான விவாதம் குறியீற்றக் கல்வியின் சிக்கல்களை மற்றும் யதார்த்தமான எதிர்பார்ப்புகளின் அவசியத்தையும் மேம்பட்ட ஆதரவு அமைப்புகளின் தேவையையும் வலியுறுத்தியது."
    ],
    "points": 197,
    "commentCount": 107,
    "retryCount": 0,
    "time": 1718812648
  },
  {
    "id": 40723150,
    "title": "நாடோடிப் பாதை TCP கடத்தல் NAT-இயக்கப்பட்ட Wi-Fi நெட்வொர்க்குகளில்",
    "originLink": "https://blog.apnic.net/2024/06/18/off-path-tcp-hijacking-in-nat-enabled-wi-fi-networks/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40723150",
    "commentBody": "",
    "originSummary": [
      "Yuxiang Yang மற்றும் அவரது குழுவினரின் ஆராய்ச்சி, Wi-Fi நெட்வொர்க்குகளில், குறிப்பாக ரவுடர் NAT (நெட்வொர்க் அட்ரஸ் டிரான்ஸ்லேஷன்) கையாளுதலில் உள்ள பலவீனங்களை வெளிப்படுத்துகிறது, இது off-path TCP ஹிஜாக்கிங்கை அனுமதிக்கிறது.",
      "ஆய்வு, NDSS 2024 இல் ஏற்றுக்கொள்ளப்பட்டது, 30 உற்பத்தியாளர்களின் 67 ரவுடர்களை சோதித்து, 52 ரவுடர்கள் பாதிக்கப்படக்கூடியவை என கண்டறிந்தது, மேலும் 93 நிஜ உலக Wi-Fi நெட்வொர்க்குகளில் 75 பாதிக்கப்படக்கூடியவை என அடையாளம் கண்டது.",
      "மிதமாக்கல் உத்தியோகங்கள் சீரற்ற போர்ட் ஒதுக்கீடு, மாறுபட்ட பாதை சரிபார்ப்பு, மற்றும் TCP சாளர சரிபார்ப்பு ஆகியவற்றை உள்ளடக்கியவை, சில உற்பத்தியாளர்கள் கண்டுபிடிப்புகளுக்கு பதிலளித்து ஏற்கனவே திருத்தங்களை வெளியிட்டுள்ளனர்."
    ],
    "commentSummary": [
      "ஒரு வெள்ளை ஆவணம் CVE-2022-32296 குறித்துப் பேசுகிறது, இது NAT-இயக்கப்பட்ட Wi-Fi நெட்வொர்க்குகளில் ஒரு பாதைத் தவிர்க்கும் TCP கடத்தல் பாதிப்பை வெளிப்படுத்துகிறது, இது Linux 5.17.9 இல் சரிசெய்யப்பட்டது.",
      "மீறல்கள் rp_filter ஐ இயக்குதல், Firefox இல் HTTPS ஐ பயன்படுத்துதல், சீரற்ற NAT போர்ட் ஒதுக்கீடு, மாறுபட்ட பாதை சரிபார்த்தல், மற்றும் TCP சாளர சரிபார்த்தல் ஆகியவற்றை உள்ளடக்கியவை.",
      "இந்த விவாதம் ரவுடர்களின் பாதிப்பை, NAT இன் பங்கை, மற்றும் IPSec அல்லது TLS போன்ற குறியாக்க முறைகளின் முக்கியத்துவத்தை வலியுறுத்துகிறது, பலர் பல-க்கு-ஒன்று NAT பிரச்சினைகளை தவிர்க்க IPv6 க்கு இடமாற்றம் செய்ய பரிந்துரைக்கின்றனர்."
    ],
    "points": 192,
    "commentCount": 74,
    "retryCount": 0,
    "time": 1718753256
  },
  {
    "id": 40726426,
    "title": "இப்போது விண்வெளியில் இருந்து கடல் குப்பைகளை கண்காணிப்பது ஒரு நிஜமாகியுள்ளது",
    "originLink": "https://www.esa.int/Enabling_Support/Space_Engineering_Technology/Monitoring_marine_litter_from_space_is_now_a_reality",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40726426",
    "commentBody": "",
    "originSummary": [
      "ஒரு புதிய ESA கண்டுபிடிப்பு ஆய்வு, கடலில் மிதக்கும் பிளாஸ்டிக் குப்பைகளை கண்காணிக்க செயற்கைக்கோள்களைப் பயன்படுத்துவதற்கான சாத்தியத்தை நிரூபித்துள்ளது, என Nature Communications இல் தெரிவிக்கப்பட்டுள்ளது.",
      "ஆய்வு ஆறு ஆண்டுகளாக 300,000 செயற்கைக்கோள் படங்களைப் பயன்படுத்தி மத்தியதரைக் கடலை ஸ்கேன் செய்து, ஆயிரக்கணக்கான அடர்த்தியான பிளாஸ்டிக் துகள்களை அடையாளம் கண்டது, இதுவரை உள்ள மிக விரிவான கடல் குப்பை மாசு வரைபடத்தை உருவாக்கியது.",
      "கண்டுபிடிப்புகள் கண்காணிப்பு திறன்களை மேம்படுத்துவதற்காக சிறப்பு சென்சார்களை பயன்படுத்துவதற்கான சாத்தியத்தை வெளிப்படுத்துகின்றன, இது எண்ணெய் கசிவு கண்டறிதல் மற்றும் தேடுதல் மற்றும் மீட்பு நடவடிக்கைகளுக்கும் பயனுள்ளதாக இருக்கலாம்."
    ],
    "commentSummary": [
      "இப்போது விண்வெளியில் இருந்து கடல் குப்பைகளை கண்காணிப்பது சாத்தியமாகியுள்ளது, இது கடல் மாசுபாட்டின் கண்காணிப்பு மற்றும் பொறுப்பை மேம்படுத்துகிறது.",
      "Sentinel-2 பணி, உலகளாவிய நிலப்பரப்புகள் மற்றும் கடலோர நீர்நிலைகளை உள்ளடக்கியது, முக்கிய முன்னேற்றத்தை குறிக்கிறது, ஆனால் திறந்த கடல்களை கண்காணிப்பதில் சவால்கள் நீடிக்கின்றன.",
      "கடல் மாசுபாட்டின் காட்சிப்படுத்தல் அதிகரித்துள்ளது, தொடர்ந்துவரும் அரசியல், கட்டமைப்பு மற்றும் கல்வி சவால்களை அடுத்து முழுமையான தீர்வுகளின் தேவையை வலியுறுத்துகிறது."
    ],
    "points": 181,
    "commentCount": 77,
    "retryCount": 0,
    "time": 1718788534
  },
  {
    "id": 40722317,
    "title": "நான் ஒரு திறந்த மூல மற்றும் உள்ளூர் மொழிபெயர்ப்பு பயன்பாட்டை உருவாக்கினேன்",
    "originLink": "https://github.com/niedev/RTranslator",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40722317",
    "commentBody": "",
    "originSummary": [
      "ஒரு டெவலப்பர், இலவச, உயர்தர தீர்வுகள் இல்லாத காரணத்தால், முதலில் Google's API ஐ பயன்படுத்தி, Android க்கான ஒரே நேரத்தில் மொழிபெயர்ப்பு செயலியை உருவாக்கினார்.",
      "பல்கலைக்கழகத்திற்கு பிறகு, டெவலப்பர் பேச்சு அடையாளம் காண்பதற்காக OpenAI's Whisper மற்றும் மொழிபெயர்ப்பிற்காக Meta's NLLB ஆகியவற்றைப் பயன்படுத்துவதற்காக செயலியை புதுப்பித்தார், இரண்டும் உள்ளூராக இயங்குகின்றன, இதனால் அது இலவசமாகவும் திறந்த மூலமாகவும் உள்ளது.",
      "அப்பிளிகேஷன் தற்போது பீட்டா நிலையில் உள்ளது, மற்றும் டெவலப்பர் பயனர் கருத்துக்களை எதிர்பார்க்கிறார்."
    ],
    "commentSummary": [
      "ஒரு திறந்த மூல, உள்ளூர் மொழிபெயர்ப்பு செயலி Android க்காக உருவாக்கப்பட்டுள்ளது, முதலில் Google's API ஐ பயன்படுத்தி இருந்தாலும், இப்போது OpenAI's Whisper ஐ பேச்சு அங்கீகாரம் மற்றும் Meta's NLLB ஐ மொழிபெயர்ப்பு செய்ய பயன்படுத்துகிறது, இரண்டும் உள்ளூராக இயங்குகின்றன.",
      "ஆப் பீட்டா நிலையில் உள்ளது, மற்றும் டெவலப்பர் கருத்துக்களை எதிர்பார்க்கிறார், தனியுரிமைக் கொள்கையை புதுப்பிக்கவும், சில சாதனங்களில் உள்ள TTS (Text-to-Speech) தொடக்க சிக்கல்களை சரிசெய்யவும் திட்டமிட்டுள்ளார்.",
      "பயனாளர் இடைமுகத்தை (UI) மேம்படுத்துவது மற்றும் போதுமான ஆதரவு இருந்தால் iOS பதிப்பை வெளியிடுவது போன்ற எதிர்கால மேம்பாடுகள் அடங்கும்."
    ],
    "points": 177,
    "commentCount": 47,
    "retryCount": 0,
    "time": 1718746011
  },
  {
    "id": 40724201,
    "title": "அமெரிக்க செனட் மேம்பட்ட அணுசக்தி பயன்பாட்டை ஆதரிக்கும் மசோதாவை நிறைவேற்றியது",
    "originLink": "https://www.reuters.com/business/energy/us-senate-passes-bill-support-advanced-nuclear-energy-deployment-2024-06-19/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40724201",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "அமெரிக்க செனட் மேம்பட்ட அணுசக்தி பயன்பாட்டை ஆதரிக்க ஒரு மசோதாவை நிறைவேற்றியுள்ளது, இது ஒழுங்குமுறை சுமைகளை குறைத்து அதன் பயன்பாட்டை ஊக்குவிக்க நோக்கமாகக் கொண்டுள்ளது.",
      "வரலாற்று போட்டியை நிலக்கரி மற்றும் தற்போதைய மலிவு சூரிய ஆற்றலுடன் எதிர்கொண்டாலும், ஒழுங்குமுறை நீக்கம் மற்றும் தொழில்நுட்ப முன்னேற்றங்கள் அணு ஆற்றலை போட்டித்திறனுடையதாக மாற்றக்கூடும் என்று ஆதரவாளர்கள் நம்புகின்றனர்.",
      "மசோதா தற்போது ஜனாதிபதி பைடனின் கையொப்பத்தை எதிர்நோக்கி உள்ளது, விமர்சகர்கள் அணு ஆற்றல் இன்னும் செலவானதும் சிக்கலானதுமாகவே உள்ளது என்று வாதிடுகின்றனர்."
    ],
    "points": 171,
    "commentCount": 189,
    "retryCount": 0,
    "time": 1718764536
  },
  {
    "id": 40727022,
    "title": "வானியலாளர்கள் நேரடியாக ஒரு கருந்துளை விழித்தெழுவதை காண்கிறார்கள்",
    "originLink": "https://www.eso.org/public/germany/news/eso2409/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40727022",
    "commentBody": "",
    "originSummary": [
      "ESO (ஐரோப்பிய தெற்கு வானியல் ஆய்வு மையம்) உலகத் தரத்திலான வானியல் ஆய்வகங்களை வடிவமைத்து இயக்குவதன் மூலம் உலகளாவிய வானியல் ஆராய்ச்சியை ஆதரிக்கிறது, இதன் தலைமையகம் ஜெர்மனியில் மற்றும் தொலைநோக்கிகள் சிலியில் உள்ளன.",
      "ஒரு சமீபத்திய ஆய்வு வானியல் & விண்வெளி அறிவியல் இதழில் வெளியிடப்பட்டது, SDSS1335+0728 என்ற விண்மீன் மண்டலத்தின் திடீர் பிரகாசத்தை கவனித்தது, இது பெரும் கருந்துளையின் செயல்பாட்டினால் ஏற்பட்டிருக்கலாம், இத்தகைய நிகழ்வின் முதல் நேரடி பார்வையாகும்.",
      "இந்த கண்டுபிடிப்பு, முதலில் 2019 டிசம்பரில் கவனிக்கப்பட்டது, விண்மீன் மண்டலம் பிரகாசமாகவே இருந்து, கருந்துளை நடத்தை பற்றிய புதிய புரிதல்களை வழங்குவதால் விஞ்ஞானிகளை தொடர்ந்து கவர்கிறது."
    ],
    "commentSummary": [
      "வானியலாளர்கள் SDSS1335+0728 என்ற விண்மீன் மண்டலத்தில் உள்ள கருந்துளை திடீரென செயல்படத் தொடங்கி, வாயு மற்றும் ஆற்றலை வெளியிடுவதைக் கவனித்துள்ளனர், இது 'விழித்தெழுகிறது' என்பதைக் குறிக்கிறது.",
      "இந்த நிகழ்வு, 300 மில்லியன் ஒளியாண்டுகள் தொலைவில் நடைபெறுகிறது, பல்வேறு வானியல் ஆய்வகங்களைப் பயன்படுத்தி நேரடியாக ஆய்வு செய்யப்படுகிறது, கோட்பாட்டை உறுதிப்படுத்த மேலும் கண்காணிப்புகள் தேவைப்படுகிறது.",
      "இந்த கண்டுபிடிப்பு கருந்துளைகள் மற்றும் பிரபஞ்ச நிகழ்வுகளின் இயல்பைப் பற்றிய விவாதங்கள் மற்றும் விவாதங்களை அறிவியல் சமூகத்தில் தூண்டியுள்ளது."
    ],
    "points": 167,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1718794642
  }
]
