[
  {
    "id": 40723220,
    "title": "किडपिक्स",
    "originLink": "https://kidpix.app",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40723220",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "KidPix (kidpix.app) को 809 अंकों के साथ महत्वपूर्ण ध्यान मिला, जिससे 90 के दशक की शुरुआत में इसके उपयोग और बचपन की रचनात्मकता पर इसके प्रभाव के बारे में पुरानी यादें ताजा हो गईं।",
      "उपयोगकर्ताओं ने पेंसिल और लाइन टूल्स पर अल्फा किनारों को स्मूथ करने जैसी तकनीकी समस्याओं पर चर्चा की, और समाधान के रूप में एंटी-अलियासिंग को बंद करने या विशिष्ट CSS गुणों का उपयोग करने का सुझाव दिया।",
      "बातचीत में मूल निर्माता क्रेग हिकमैन, उनके डिजिटल कला पर प्रभाव, और उपकरण के नाम की उपयुक्तता पर भी चर्चा की गई, जिससे किडपिक्स की स्थायी विरासत को उजागर किया गया।"
    ],
    "points": 809,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1718753920
  },
  {
    "id": 40730156,
    "title": "सेफ सुपरइंटेलिजेंस इंक.",
    "originLink": "https://ssi.inc",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40730156",
    "commentBody": "",
    "originSummary": [
      "सेफ सुपरइंटेलिजेंस इंक. (एसएसआई) पहला ऐसा प्रयोगशाला है जो केवल सुरक्षित सुपरइंटेलिजेंस के निर्माण के लिए समर्पित है, जो उन्नत इंजीनियरिंग और वैज्ञानिक अनुसंधान के माध्यम से सुरक्षा और क्षमताओं दोनों को संबोधित करता है।",
      "कंपनी का उद्देश्य सुरक्षा सुनिश्चित करते हुए सुपरइंटेलिजेंस क्षमताओं को तेजी से आगे बढ़ाना है, और इसका मिशन और व्यापार मॉडल इस लक्ष्य के अनुरूप है।",
      "पैलो ऑल्टो और तेल अवीव में स्थित, एसएसआई शीर्ष तकनीकी प्रतिभाओं की भर्ती करता है ताकि एक विशेष टीम का गठन किया जा सके जो विशेष रूप से इस महत्वपूर्ण चुनौती पर केंद्रित हो।"
    ],
    "commentSummary": [
      "सेफ सुपरइंटेलिजेंस इंक. (ssi.inc) एक उन्नत एआई आर्किटेक्चर विकसित कर रहा है जिसे पैनॉप्टिक कंप्यूट्रोनियम कैथेड्रल™ कहा जाता है और यह सार्वजनिक घोषणाओं की तुलना में कोडिंग को प्राथमिकता देता है।",
      "कंपनी उन लोगों के लिए नौकरी के अवसर पोस्ट करने की योजना बना रही है जो उनकी तकनीकी प्रगति में योगदान देने में रुचि रखते हैं।",
      "एक वास्तव में सुरक्षित एआई बनाने की व्यवहार्यता और सुरक्षा के बारे में लगातार बहसें चल रही हैं, जिसमें कुछ लोग इसमें शामिल व्यावहारिकता और संभावित जोखिमों पर सवाल उठा रहे हैं।"
    ],
    "points": 507,
    "commentCount": 325,
    "retryCount": 0,
    "time": 1718816776
  },
  {
    "id": 40726974,
    "title": "Neofetch डेवलपर ने अपने सभी रिपॉजिटरी को संग्रहित किया: 'खेती करने का काम शुरू कर दिया है'",
    "originLink": "https://github.com/dylanaraps",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40726974",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Neofetch, एक लोकप्रिय कमांड-लाइन सिस्टम जानकारी उपकरण के डेवलपर ने, सभी अपने रिपॉजिटरी को संग्रहित कर दिया है, यह कहते हुए कि वह अब खेती में नया करियर बना रहे हैं।",
      "इस कदम ने खेती की चुनौतियों और रोमांटिक दृष्टिकोणों के बारे में चर्चाओं को जन्म दिया है, जिसमें कुछ उपयोगकर्ता अपने तकनीकी जीवन से ग्रामीण जीवन में परिवर्तन के अनुभव साझा कर रहे हैं।",
      "इस घोषणा ने तकनीकी समुदाय के भीतर महत्वपूर्ण रुचि और बहस को जन्म दिया है, जो तकनीकी पेशेवरों द्वारा जीवनशैली में बदलाव की व्यापक प्रवृत्ति को उजागर करता है।"
    ],
    "points": 342,
    "commentCount": 267,
    "retryCount": 0,
    "time": 1718794162
  },
  {
    "id": 40725983,
    "title": "ईयू परिषद गुरुवार को चैट स्कैनिंग प्रस्ताव पर मतदान करेगी",
    "originLink": "https://www.patrick-breyer.de/en/posts/chat-control/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40725983",
    "commentBody": "",
    "originSummary": [
      "यूरोपीय संघ का चैट कंट्रोल 2.0 प्रस्ताव सभी निजी संचारों की स्कैनिंग को अनिवार्य करने का प्रयास करता है ताकि बाल यौन शोषण सामग्री (CSEM) का पता लगाया जा सके, जिससे डिजिटल गोपनीयता प्रभावी रूप से समाप्त हो जाएगी।",
      "यूरोपीय संसद इस प्रस्ताव का विरोध करती है, न्यायिक वारंट के साथ लक्षित निगरानी और अंत-से-अंत एन्क्रिप्शन के संरक्षण की वकालत करती है।",
      "नागरिकों, हितधारकों और विभिन्न यूरोपीय संघ सरकारों से महत्वपूर्ण विरोध उत्पन्न हुआ है, जो लोगों से अपने प्रतिनिधियों से संपर्क करने का आग्रह कर रहे हैं ताकि प्रस्ताव को अपनाने से रोका जा सके।"
    ],
    "commentSummary": [
      "यूरोपीय संघ परिषद एक चैट स्कैनिंग प्रस्ताव पर मतदान करने वाली है, जिसने गोपनीयता, लोकतंत्र और यूरोपीय संघ के भीतर राष्ट्रीय सरकारों की भूमिकाओं के बारे में बहस छेड़ दी है।",
      "आलोचकों का कहना है कि यह प्रस्ताव बड़े पैमाने पर निगरानी और सेंसरशिप का कारण बन सकता है, जबकि समर्थकों का तर्क है कि यह बाल संरक्षण के लिए आवश्यक है।",
      "यह स्थिति यूरोपीय संघ की राजनीति की जटिल प्रकृति और राष्ट्रीय तथा ईयू-स्तरीय निर्णय-निर्माण के बीच चल रहे तनाव को उजागर करती है, जिसमें नागरिकों से अपने प्रतिनिधियों के समक्ष अपनी राय व्यक्त करने का आग्रह किया गया है।"
    ],
    "points": 279,
    "commentCount": 280,
    "retryCount": 0,
    "time": 1718784315
  },
  {
    "id": 40723302,
    "title": "संदेश कतार-आधारित आर्किटेक्चर अब कम लोकप्रिय क्यों लगते हैं?",
    "originLink": "https://news.ycombinator.com/item?id=40723302",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40723302",
    "commentBody": "",
    "originSummary": [
      "2000 के दशक के अंत और 2010 के दशक की शुरुआत में, अमेज़न SQS, RabbitMQ, और ZeroMQ जैसे संदेश कतारों का उपयोग करके वितरित प्रणालियों के निर्माण के लिए काफी उत्साह था।",
      "वर्तमान में संदेश कतारों के बारे में चर्चा में गिरावट का कारण Redis द्वारा कई उपयोग मामलों को संबोधित करना, उच्च पैमाने को संभालने वाले बेहतर डेटाबेस, और यह एहसास हो सकता है कि संदेश कतार-आधारित आर्किटेक्चर हमेशा अपेक्षाओं को पूरा नहीं कर सकते।",
      "हालांकि प्रचार कम हो गया है, संदेश कतारें अभी भी व्यापक रूप से उपयोग की जाती हैं, हालांकि तकनीक परिपक्व हो गई है और इसके बारे में लिखना कम रोमांचक हो गया है।"
    ],
    "commentSummary": [
      "संदेश कतार-आधारित आर्किटेक्चर, जो 2000 के दशक के अंत और 2010 के शुरुआती वर्षों में लोकप्रिय थे, कई कारणों से रुचि में गिरावट देखी गई है।",
      "रेडिस और काफ्का ने कई उपयोग मामलों को संभाल लिया है, जिसमें रेडिस कैशिंग को संभालता है और काफ्का उच्च-स्तरीय अनुप्रयोगों के लिए पसंद किया जाता है।",
      "आधुनिक डेटाबेस और संदेश कतारों की सीमाओं की समझ ने वैकल्पिक दृष्टिकोणों को जन्म दिया है, जिससे यह तकनीक परिपक्व हो गई है और चर्चा के लिए कम रोमांचक हो गई है।"
    ],
    "points": 277,
    "commentCount": 297,
    "retryCount": 0,
    "time": 1718754639
  },
  {
    "id": 40725214,
    "title": "फर्न होलो ब्रिज को गिरने से कई साल पहले ही बंद कर देना चाहिए था",
    "originLink": "https://practical.engineering/blog/2024/6/18/this-bridge-should-have-been-closed-years-before-it-collapsed",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40725214",
    "commentBody": "",
    "originSummary": [
      "पिट्सबर्ग में फर्न हॉलो ब्रिज 28 जनवरी, 2022 को ढह गया, जो एक दशक से अधिक समय से 'खराब स्थिति' में था, बावजूद इसके कि कई निरीक्षण और मरम्मत की सिफारिशें की गई थीं।",
      "फरवरी 2024 की एनटीएसबी रिपोर्ट में पुल निरीक्षण और रखरखाव में प्रणालीगत खामियों को उजागर किया गया, जिसमें खराब जल निकासी के कारण गंभीर जंग लगना और भार रेटिंग का कम आकलन शामिल था।",
      "ढहने का कारण एक जंग लगी टाई प्लेट थी, और NTSB की जांच में मरम्मत की सिफारिशों पर अनुपालन की कमी और निरीक्षण टीमों और पुल मालिकों के बीच खराब संचार का खुलासा हुआ।"
    ],
    "commentSummary": [
      "फर्न हॉलो ब्रिज का ढहना अमेरिका में संरचनात्मक रूप से कमजोर पुलों की गंभीर समस्या को उजागर करता है, जिसमें 2023 में 42,391 ऐसे पुलों की पहचान की गई है।",
      "निरीक्षणों में समस्याओं को उजागर करने के बावजूद, पुल अचानक गिरने तक खुला रहा, जो बेहतर बुनियादी ढांचे की प्राथमिकता और रखरखाव की आवश्यकता की ओर इशारा करता है।",
      "एनटीएसबी रिपोर्ट और वीडियो भविष्य की घटनाओं को रोकने के लिए इंजीनियरिंग और संगठनात्मक विफलताओं को संबोधित करने पर जोर देते हैं, जबकि अपर्याप्त बुनियादी ढांचा वित्तपोषण और नए निर्माण के साथ रखरखाव को संतुलित करने की व्यापक चुनौतियों के बीच।"
    ],
    "points": 238,
    "commentCount": 144,
    "retryCount": 0,
    "time": 1718775953
  },
  {
    "id": 40723356,
    "title": "ओपन सोर्स पायथन ईटीएल",
    "originLink": "https://amphi.ai/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40723356",
    "commentBody": "",
    "originSummary": [
      "Amphi एक पायथन-आधारित ETL (एक्सट्रैक्ट, ट्रांसफॉर्म, लोड) टूल है जो कम-कोड डेटा इंटीग्रेशन, एक्सट्रैक्शन और प्रिपरेशन के लिए डिज़ाइन किया गया है, और यह CSV और JSON जैसे फॉर्मेट्स को सपोर्ट करता है।",
      "यह डेटा पाइपलाइनों को डिज़ाइन करने के लिए एक ग्राफिकल इंटरफ़ेस प्रदान करता है, देशी पायथन कोड उत्पन्न करता है जिसे कहीं भी तैनात किया जा सकता है, और डेटा को स्थानीय रूप से प्रोसेस करके डेटा गोपनीयता सुनिश्चित करता है।",
      "अंफी वर्तमान में जुपिटरलैब में सार्वजनिक बीटा के लिए उपलब्ध है, जो कम-कोड विकास, हाइब्रिड परिनियोजन, और सामुदायिक सहयोग को बढ़ावा देता है।"
    ],
    "commentSummary": [
      "Amphi.ai एक लो-कोड ETL (एक्सट्रैक्ट, ट्रांसफॉर्म, लोड) टूल है जो डिप्लॉयमेंट के लिए पायथन कोड जनरेट करता है, और यह एक वेब ऐप या JupyterLab एक्सटेंशन के रूप में उपलब्ध है।",
      "यह फ़ाइल एकीकरण, डेटा तैयारी, माइग्रेशन, और एआई पाइपलाइनों का समर्थन करता है, और उपयोगकर्ता इसके पायथन कोड जनरेशन और JupyterLab एकीकरण की प्रशंसा करते हैं।",
      "आलोचकों का तर्क है कि Amphi.ai जैसे लो-कोड टूल्स जटिल ETL आवश्यकताओं के लिए उपयुक्त नहीं हो सकते हैं, और यह ओपन-सोर्स नहीं है, बल्कि Elastic License v2 के तहत लाइसेंस प्राप्त है।"
    ],
    "points": 219,
    "commentCount": 103,
    "retryCount": 0,
    "time": 1718755343
  },
  {
    "id": 40722155,
    "title": "कैलिफोर्निया में श्रम कानून तोड़ने के लिए अमेज़न पर $5.9 मिलियन का जुर्माना लगाया गया",
    "originLink": "https://www.washingtonpost.com/technology/2024/06/18/amazon-fine-labor-law-california/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40722155",
    "commentBody": "",
    "originSummary": [
      "कैलिफोर्निया ने वेयरहाउस कोटा कानून का उल्लंघन करने के लिए अमेज़न पर $5.9 मिलियन का जुर्माना लगाया, जो श्रमिकों को उनकी स्वास्थ्य और सुरक्षा को खतरे में डालने वाली अत्यधिक कार्य गति से बचाता है।",
      "लॉस एंजिल्स के पास स्थित दो अमेज़न सुविधाओं में जांच से पता चला कि कंपनी ने कर्मचारियों को उनके कार्य कोटा के बारे में सूचित नहीं किया, जिसके परिणामस्वरूप रेडलैंड और मोरेनो वैली सुविधाओं के लिए क्रमशः $1.2 मिलियन और $4.7 मिलियन के जुर्माने लगाए गए।",
      "अमेज़न ने इन आरोपों का खंडन किया है और अपील की है, जबकि इसके कार्यस्थल प्रथाओं के लिए निरंतर जांच का सामना कर रहा है, अन्य राज्यों में समान कानून उभर रहे हैं और एक प्रस्तावित संघीय विधेयक भी है।"
    ],
    "commentSummary": [
      "कैलिफोर्निया के दो गोदामों में कर्मचारियों को उत्पादकता कोटा न बताने के लिए अमेज़न पर $5.9 मिलियन का जुर्माना लगाया गया, जिससे राज्य श्रम कानून का उल्लंघन हुआ।",
      "इस जुर्माने ने इसकी पर्याप्तता पर बहस छेड़ दी है, कुछ लोगों का तर्क है कि इसे अमेज़न की विशाल राजस्व के अनुपात में होना चाहिए ताकि यह एक निवारक के रूप में काम कर सके।",
      "चर्चा श्रम अधिकारों, कॉर्पोरेट जवाबदेही, और वर्तमान नियामक उपायों की प्रभावशीलता जैसे व्यापक मुद्दों तक फैली हुई है।"
    ],
    "points": 218,
    "commentCount": 226,
    "retryCount": 0,
    "time": 1718744377
  },
  {
    "id": 40724283,
    "title": "गूगल जेमिनी ने मुझे मारने की कोशिश की",
    "originLink": "https://old.reddit.com/r/ChatGPT/comments/1diljf2/google_gemini_tried_to_kill_me/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40724283",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "एक Reddit पोस्ट में Google Gemini, एक जनरेटिव एआई, के खतरों पर चर्चा की गई है, जब उसने एक विषाक्त मशरूम की गलत पहचान की, जिससे महत्वपूर्ण जानकारी के लिए बड़े भाषा मॉडल (LLMs) पर निर्भर रहने के जोखिमों को उजागर किया गया।",
      "वार्तालाप इस बात पर जोर देता है कि LLMs संभावित रूप से सही लेकिन गलत उत्तर उत्पन्न कर सकते हैं, जिससे संभावित हानिकारक परिणामों से बचने के लिए मानव सत्यापन की आवश्यकता होती है।",
      "यह पोस्ट जिम्मेदार एआई उपयोग के महत्व और व्यवसायों के लिए एआई आउटपुट की जांच सुनिश्चित करने की आवश्यकता को रेखांकित करती है ताकि ग्राहक को नुकसान और संभावित कानूनी मुद्दों को रोका जा सके।"
    ],
    "points": 199,
    "commentCount": 133,
    "retryCount": 0,
    "time": 1718765432
  },
  {
    "id": 40729501,
    "title": "लैम्ब्डा स्कूल में तेज़ अपराध",
    "originLink": "https://www.sandofsky.com/lambda-school/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40729501",
    "commentBody": "",
    "originSummary": [
      "प्रारंभिक सफलता: 2017 में शुरू हुआ लैम्ब्डा स्कूल अपने आय साझा समझौता (आईएसए) मॉडल के साथ तेजी से लोकप्रिय हुआ, जिससे इसे महत्वपूर्ण वेंचर कैपिटल प्राप्त हुआ।",
      "पतन: 2020 में लीक हुई संचार ने खराब नौकरी प्लेसमेंट दरों और वित्तीय अस्थिरता को उजागर किया, जिससे छात्रों और निवेशकों को गुमराह करने के आरोप लगे।",
      "पुनर्ब्रांडिंग और गिरावट: 'द ब्लूम इंस्टीट्यूट ऑफ टेक्नोलॉजी' के रूप में पुनर्ब्रांडिंग के बाद भी, कंपनी संघर्ष करती रही, कई छंटनियों, कार्यकारी प्रस्थान और चल रहे कानूनी मुद्दों का सामना करती रही।"
    ],
    "commentSummary": [
      "लैम्ब्डा स्कूल को उपयुक्त छात्रों को खोजने, बूटकैंप के दावों के प्रति संदेह, और कार्यक्रम की संरचना और शिक्षण विधियों से संबंधित समस्याओं जैसी चुनौतियों का सामना करना पड़ा।",
      "स्कूल के आय साझाकरण समझौतों (ISAs) की आलोचना शोषणकारी और भ्रामक होने के कारण की गई, जिससे पूर्व प्रशिक्षकों और छात्रों के बीच मिश्रित अनुभव उत्पन्न हुए।",
      "व्यापक चर्चा ने कोडिंग शिक्षा की जटिलताओं और यथार्थवादी अपेक्षाओं तथा बेहतर समर्थन प्रणालियों की आवश्यकता पर जोर दिया।"
    ],
    "points": 197,
    "commentCount": 107,
    "retryCount": 0,
    "time": 1718812648
  },
  {
    "id": 40723150,
    "title": "एनएटी-सक्षम वाई-फाई नेटवर्क में ऑफ-पाथ टीसीपी हाईजैकिंग",
    "originLink": "https://blog.apnic.net/2024/06/18/off-path-tcp-hijacking-in-nat-enabled-wi-fi-networks/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40723150",
    "commentBody": "",
    "originSummary": [
      "युशियांग यांग और उनके सहयोगियों द्वारा किए गए शोध से वाई-फाई नेटवर्क में कमजोरियों का पता चलता है, विशेष रूप से राउटर NAT (नेटवर्क एड्रेस ट्रांसलेशन) हैंडलिंग में, जो ऑफ-पाथ TCP हाईजैकिंग की अनुमति देता है।",
      "अध्ययन, जिसे NDSS 2024 द्वारा स्वीकार किया गया, ने 30 निर्माताओं के 67 राउटर्स का परीक्षण किया, जिसमें 52 को असुरक्षित पाया गया, और 93 वास्तविक-विश्व वाई-फाई नेटवर्क में से 75 को संवेदनशील के रूप में पहचाना।",
      "शमन रणनीतियों में रैंडम पोर्ट आवंटन, रिवर्स पाथ सत्यापन, और टीसीपी विंडो जांच शामिल हैं, कुछ निर्माताओं ने पहले ही निष्कर्षों के जवाब में पैच जारी कर दिए हैं।"
    ],
    "commentSummary": [
      "सीवीई-2022-32296 पर एक श्वेतपत्र NAT-सक्षम वाई-फाई नेटवर्क में एक ऑफ-पाथ TCP हाइजैकिंग भेद्यता को उजागर करता है, जिसे लिनक्स 5.17.9 में ठीक किया गया था।",
      "शमन में rp_filter को सक्षम करना, Firefox में HTTPS का उपयोग करना, रैंडम NAT पोर्ट आवंटन, रिवर्स पाथ वैलिडेशन, और TCP विंडो चेकिंग शामिल हैं।",
      "चर्चा में राउटर्स पर कमजोरियों के प्रभाव, NAT की भूमिका, और IPSec या TLS जैसे एन्क्रिप्शन विधियों के महत्व पर जोर दिया गया है, जिसमें कुछ लोग कई-से-एक NAT समस्याओं से बचने के लिए IPv6 में स्थानांतरण का सुझाव दे रहे हैं।"
    ],
    "points": 192,
    "commentCount": 74,
    "retryCount": 0,
    "time": 1718753256
  },
  {
    "id": 40726426,
    "title": "अंतरिक्ष से समुद्री कचरे की निगरानी अब एक वास्तविकता है",
    "originLink": "https://www.esa.int/Enabling_Support/Space_Engineering_Technology/Monitoring_marine_litter_from_space_is_now_a_reality",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40726426",
    "commentBody": "",
    "originSummary": [
      "नेचर कम्युनिकेशंस में रिपोर्ट के अनुसार, एक नई ईएसए डिस्कवरी अध्ययन ने महासागर में तैरते प्लास्टिक कचरे की निगरानी के लिए उपग्रहों का उपयोग करने की संभावना को प्रदर्शित किया है।",
      "अध्ययन ने छह वर्षों में 300,000 उपग्रह छवियों का उपयोग करके भूमध्य सागर को स्कैन किया, जिससे हजारों घने प्लास्टिक पैचों की पहचान की गई, और अब तक का सबसे व्यापक समुद्री कचरा प्रदूषण का मानचित्र तैयार किया गया।",
      "निष्कर्ष विशेष सेंसरों को तैनात करने की संभावनाओं को उजागर करते हैं, जो निगरानी क्षमताओं को बढ़ा सकते हैं और तेल रिसाव का पता लगाने और खोज और बचाव अभियानों में भी लाभकारी हो सकते हैं।"
    ],
    "commentSummary": [
      "अंतरिक्ष से समुद्री कचरे की निगरानी अब संभव है, जिससे महासागर प्रदूषण की ट्रैकिंग और जवाबदेही में सुधार हो रहा है।",
      "सेंटिनल-2 मिशन, जो वैश्विक भूमि सतहों और तटीय जल को कवर करता है, एक महत्वपूर्ण प्रगति का प्रतिनिधित्व करता है, हालांकि खुले महासागरों की निगरानी में चुनौतियाँ बनी रहती हैं।",
      "महासागर प्रदूषण की दृश्यता बढ़ गई है, जो राजनीतिक, बुनियादी ढांचे और शैक्षिक चुनौतियों के बावजूद व्यापक समाधान की आवश्यकता पर जोर देती है।"
    ],
    "points": 181,
    "commentCount": 77,
    "retryCount": 0,
    "time": 1718788534
  },
  {
    "id": 40722317,
    "title": "मैंने एक ओपन सोर्स और स्थानीय अनुवाद ऐप बनाया है",
    "originLink": "https://github.com/niedev/RTranslator",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40722317",
    "commentBody": "",
    "originSummary": [
      "एक डेवलपर ने एंड्रॉइड के लिए एक साथ अनुवाद ऐप बनाया, शुरू में मुफ्त, उच्च-गुणवत्ता वाले समाधानों की कमी के कारण गूगल की एपीआई का उपयोग किया।",
      "विश्वविद्यालय के बाद, डेवलपर ने ऐप को अपडेट किया ताकि वह स्पीच रिकग्निशन के लिए OpenAI के Whisper और अनुवाद के लिए Meta के NLLB का उपयोग कर सके, दोनों को स्थानीय रूप से चलाया गया, जिससे यह मुफ्त और ओपन-सोर्स हो गया।",
      "ऐप वर्तमान में बीटा में है, और डेवलपर उपयोगकर्ता प्रतिक्रिया की तलाश कर रहा है।"
    ],
    "commentSummary": [
      "एक ओपन-सोर्स, स्थानीय अनुवाद ऐप एंड्रॉइड के लिए विकसित किया गया है, जो प्रारंभ में गूगल की एपीआई का उपयोग कर रहा था लेकिन अब स्पीच रिकग्निशन के लिए OpenAI के Whisper और अनुवाद के लिए Meta के NLLB का उपयोग कर रहा है, दोनों ही स्थानीय रूप से चल रहे हैं।",
      "ऐप बीटा में है, और डेवलपर प्रतिक्रिया की तलाश में है, जिसमें गोपनीयता नीति को अपडेट करने और कुछ उपकरणों पर टीटीएस (टेक्स्ट-टू-स्पीच) प्रारंभिक मुद्दों को संबोधित करने की योजना है।",
      "भविष्य में सुधारों में उपयोगकर्ता इंटरफ़ेस (UI) को बेहतर बनाना और यदि पर्याप्त समर्थन मिलता है तो संभावित रूप से एक iOS संस्करण जारी करना शामिल है।"
    ],
    "points": 177,
    "commentCount": 47,
    "retryCount": 0,
    "time": 1718746011
  },
  {
    "id": 40724201,
    "title": "अमेरिकी सीनेट ने उन्नत परमाणु ऊर्जा तैनाती का समर्थन करने वाला विधेयक पारित किया",
    "originLink": "https://www.reuters.com/business/energy/us-senate-passes-bill-support-advanced-nuclear-energy-deployment-2024-06-19/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40724201",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "अमेरिकी सीनेट ने उन्नत परमाणु ऊर्जा की तैनाती का समर्थन करने के लिए एक विधेयक पारित किया है, जिसका उद्देश्य नियामक बाधाओं को कम करना और इसके उपयोग को बढ़ावा देना है।",
      "कोयले के साथ ऐतिहासिक प्रतिस्पर्धा और वर्तमान में सस्ती सौर ऊर्जा के प्रभुत्व के बावजूद, समर्थकों का मानना है कि विनियमन में ढील और तकनीकी प्रगति परमाणु ऊर्जा को प्रतिस्पर्धी बना सकती है।",
      "अब यह विधेयक राष्ट्रपति बाइडेन के हस्ताक्षर की प्रतीक्षा कर रहा है, जबकि आलोचकों का तर्क है कि परमाणु ऊर्जा महंगी और जटिल बनी हुई है।"
    ],
    "points": 171,
    "commentCount": 189,
    "retryCount": 0,
    "time": 1718764536
  },
  {
    "id": 40727022,
    "title": "खगोलविदों ने वास्तविक समय में एक ब्लैक होल को जागते हुए देखा",
    "originLink": "https://www.eso.org/public/germany/news/eso2409/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40727022",
    "commentBody": "",
    "originSummary": [
      "ईएसओ (यूरोपीय दक्षिणी वेधशाला) विश्व स्तरीय वेधशालाओं को डिजाइन और संचालित करके वैश्विक खगोलीय अनुसंधान का समर्थन करता है, जिसका मुख्यालय जर्मनी में है और दूरबीनें चिली में स्थित हैं।",
      "हाल ही में खगोल विज्ञान और खगोल भौतिकी में प्रकाशित एक अध्ययन में आकाशगंगा SDSS1335+0728 की अचानक चमक बढ़ने का अवलोकन किया गया, जो संभवतः एक विशाल ब्लैक होल के सक्रिय होने के कारण हुआ, और इस प्रकार की घटना का यह पहला वास्तविक समय में अवलोकन है।",
      "यह खोज, जिसे पहली बार दिसंबर 2019 में देखा गया था, वैज्ञानिकों को लगातार आकर्षित कर रही है क्योंकि यह आकाशगंगा चमकती रहती है, जिससे ब्लैक होल के व्यवहार के बारे में नई जानकारियाँ मिल रही हैं।"
    ],
    "commentSummary": [
      "खगोलविदों ने आकाशगंगा SDSS1335+0728 में एक ब्लैक होल को अचानक सक्रिय होते हुए देखा है, जो गैस और ऊर्जा उत्सर्जित कर रहा है, जिससे यह संकेत मिलता है कि यह 'जाग' रहा है।",
      "यह घटना, जो 300 मिलियन प्रकाश-वर्ष दूर हो रही है, विभिन्न वेधशालाओं का उपयोग करके वास्तविक समय में अध्ययन की जा रही है, और सिद्धांत की पुष्टि के लिए आगे के अवलोकनों की आवश्यकता है।",
      "इस खोज ने वैज्ञानिक समुदाय के बीच ब्लैक होल और ब्रह्मांडीय घटनाओं की प्रकृति पर चर्चाओं और बहसों को जन्म दिया है।"
    ],
    "points": 167,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1718794642
  }
]
