[
  {
    "id": 41493634,
    "title": "James Earl Jones telah meninggal dunia",
    "originLink": "https://variety.com/2024/film/news/james-earl-jones-dead-darth-vader-lion-king-1236138656/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41493634",
    "commentBody": "",
    "originSummary": [
      "James Earl Jones, terkenal karena suaranya yang ikonik sebagai Darth Vader dalam \"Star Wars,\" meninggal dunia pada usia 93 tahun di rumahnya di Dutchess County, N.Y.",
      "Jones mengatasi gagap masa kecilnya dan memiliki karier yang beragam selama lebih dari 60 tahun, termasuk peran dalam \"The Lion King,\" \"Dr. Strangelove,\" dan \"Field of Dreams.\"",
      "Jones memenangkan berbagai penghargaan bergengsi, termasuk dua Tony Awards, dua Emmy, satu Grammy, dan satu Oscar kehormatan, serta dikenal juga sebagai narator dokumenter dan tagline CNN."
    ],
    "commentSummary": [
      "James Earl Jones, terkenal karena peran suaranya yang ikonik seperti Darth Vader dalam Star Wars dan Mufasa dalam The Lion King, telah meninggal dunia.",
      "Selain peran suaranya yang terkenal, Jones memiliki karier yang beragam, termasuk penampilan dalam film seperti 'The Hunt for Red October,' 'Field of Dreams,' dan 'Coming to America.'",
      "Prestasinya juga mencakup mengatasi gagap masa kecil, menghadiri Sekolah Ranger, dan tampil dalam drama Shakespearean serta kontemporer, menjadikannya seorang aktor yang dihormati dan serba bisa."
    ],
    "points": 643,
    "commentCount": 175,
    "retryCount": 0,
    "time": 1725915016
  },
  {
    "id": 41492251,
    "title": "FTC Didesak untuk Menindak Perusahaan yang Merusak Perangkat Keras melalui Pembaruan Perangkat Lunak",
    "originLink": "https://www.techdirt.com/2024/09/09/ftc-pushed-to-crack-down-on-companies-that-ruin-hardware-via-software-updates-or-annoying-paywalls/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41492251",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "FTC didesak untuk menangani perusahaan-perusahaan yang dengan sengaja menurunkan kualitas perangkat keras melalui pembaruan perangkat lunak, yang menyebabkan frustrasi konsumen.",
      "Contohnya termasuk headset VR dan smartphone yang kehilangan fungsionalitas karena tindakan jarak jauh dari produsen, seperti mematikan server cloud.",
      "Ada seruan untuk regulasi yang memastikan fungsi perangkat atau merilis kode sumber ketika dukungan berakhir, serta saran untuk sertifikasi perangkat yang 'bebas awan' atau 'sumber terbuka'."
    ],
    "points": 434,
    "commentCount": 190,
    "retryCount": 0,
    "time": 1725908565
  },
  {
    "id": 41496725,
    "title": "Hanya untuk Bersenang-senang (2022)",
    "originLink": "https://justforfunnoreally.dev",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41496725",
    "commentBody": "",
    "originSummary": [
      "Postingan tersebut menekankan bahwa beberapa pengembang membuat perangkat lunak sumber terbuka murni untuk kesenangan dan kegembiraan dalam memecahkan masalah, bukan untuk keuntungan finansial atau konsumsi massal.",
      "Ini mencantumkan beberapa proyek 'hanya untuk bersenang-senang', termasuk kompiler Ruby (Natalie), parser PHP dalam Rust (php-parser-rs), dan peluncur Minecraft dalam Python (PyCraft), yang menunjukkan keragaman dan kreativitas dalam komunitas open-source.",
      "Kirimannya mendorong para pengembang untuk menemukan kembali kesenangan dalam pemrograman dengan mengerjakan proyek-proyek yang menarik bagi mereka, menekankan pentingnya menikmati proses daripada hanya berfokus pada hasil akhir."
    ],
    "commentSummary": [
      "Seorang pengembang berbagi hasrat mereka untuk coding dan menjalankan sebuah kelompok di mana para peserta membangun proyek bersama dalam kelompok 6 minggu, menekankan kegembiraan dan kesenangan dari penciptaan kolaboratif.",
      "Diskusi tersebut menyoroti nilai bekerja pada proyek pribadi untuk kesenangan, dengan berbagai peserta berbagi pengalaman dan motivasi mereka, seperti mempelajari keterampilan baru atau sekadar menikmati proses kreatif.",
      "Percakapan tersebut menyentuh tantangan dan persepsi dalam membahas proyek pribadi di lingkungan profesional, dengan beberapa orang melihatnya sebagai tanda inisiatif dan kreativitas, sementara yang lain merasa sulit mengaitkannya dengan kinerja pekerjaan."
    ],
    "points": 283,
    "commentCount": 82,
    "retryCount": 0,
    "time": 1725936614
  },
  {
    "id": 41496254,
    "title": "DOJ mengklaim Google memiliki 'trifecta monopoli' pada Hari 1 dari persidangan teknologi iklan",
    "originLink": "https://arstechnica.com/tech-policy/2024/09/doj-claims-google-has-trifecta-of-monopolies-on-day-1-of-ad-tech-trial/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41496254",
    "commentBody": "",
    "originSummary": [
      "Departemen Kehakiman AS (DOJ) memulai persidangan antitrust terhadap Google pada 9 September 2024, di Virginia, dengan fokus pada dominasi Google dalam teknologi iklan.",
      "Pengacara DOJ Julia Tarver Wood mengklaim bahwa Google telah memanipulasi lelang iklan, yang mengakibatkan pendapatan yang lebih rendah bagi penerbit dan biaya yang lebih tinggi bagi pengiklan.",
      "Kasus pengadilan ini bisa lebih merusak daripada kasus-kasus sebelumnya, dengan DOJ bertujuan untuk melepaskan rangkaian Ad Manager Google, yang berpotensi menyebabkan pemisahan bisnis pencarian dan periklanan Google."
    ],
    "commentSummary": [
      "DOJ menuduh Google memegang 'trifecta monopoli' di pasar teknologi iklan, mengklaim praktik ini merugikan penerbit dan ekonomi.",
      "Kritikus menyarankan bahwa kasus ini juga harus membahas pelanggaran privasi dan kerugian sosial, sementara Google berpendapat bahwa perspektif DOJ tentang pasar teknologi iklan sudah ketinggalan zaman.",
      "Persidangan ini menyoroti isu-isu kompleks tentang dominasi pasar, potensi manfaat bagi konsumen dari pemecahan Google, dan implikasi yang lebih luas bagi persaingan dan inovasi dalam industri teknologi."
    ],
    "points": 246,
    "commentCount": 194,
    "retryCount": 0,
    "time": 1725931450
  },
  {
    "id": 41501496,
    "title": "Kehidupan yang baik untuk berusaha keras: menghemat komputasi 1% setiap kali",
    "originLink": "https://blog.cloudflare.com/pingora-saving-compute-1-percent-at-a-time/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41501496",
    "commentBody": "",
    "originSummary": [
      "Cloudflare telah mengembangkan crate Rust open-source baru untuk mengurangi penggunaan CPU, meningkatkan kapasitas CDN mereka.",
      "Melalui optimalisasi fungsi `clear_internal_headers` menggunakan struktur data trie, mereka mengurangi waktu eksekusinya dari 3,65µs menjadi 0,93µs, mencapai pengurangan 1,28% dalam pemakaian CPU untuk layanan proxy mereka.",
      "Perbaikan ini menyoroti dampak signifikan dari mengoptimalkan operasi tingkat mikrodetik terhadap kinerja keseluruhan, menekankan pentingnya alat observabilitas dan pemprofilan."
    ],
    "commentSummary": [
      "Metode penyimpanan header internal Cloudflare telah memicu perdebatan di Hacker News, dengan pengguna membahas berbagai pendekatan seperti kamus terpisah dan awalan unik.",
      "Kritikus berpendapat bahwa metode Cloudflare rentan terhadap kesalahan, dan seorang mantan karyawan menyoroti potensi masalah dengan manipulasi header pada pekerja.",
      "CTO Cloudflare menyebutkan upaya yang sedang berlangsung untuk mengganti header HTTP untuk komunikasi antar-proses (IPC), dan diskusi tersebut juga mencakup optimasi struktur data, seperti menggunakan tabel hash atau filter Bloom."
    ],
    "points": 244,
    "commentCount": 80,
    "retryCount": 0,
    "time": 1725980611
  },
  {
    "id": 41498358,
    "title": "Apple harus membayar pajak tertunggak sebesar 13 miliar euro, putusan pengadilan tertinggi Uni Eropa",
    "originLink": "https://www.cnbc.com/2024/09/10/apple-loses-eu-court-battle-over-13-billion-euro-tax-bill-in-ireland.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41498358",
    "commentBody": "",
    "originSummary": [
      "Pengadilan tertinggi Eropa telah memutuskan melawan Apple dalam sengketa pajak yang berlangsung selama satu dekade, mewajibkan perusahaan tersebut untuk membayar pajak tertunggak sebesar 13 miliar euro ($14,4 miliar) kepada Irlandia.",
      "Pengadilan Eropa menegaskan klaim Komisi Eropa tahun 2016 bahwa Apple menerima manfaat pajak \"ilegal\" dari Irlandia, membatalkan kemenangan banding tahun 2020 oleh Apple dan Irlandia.",
      "Kasus ini menyoroti ketegangan yang terus berlanjut antara raksasa teknologi AS dan Uni Eropa terkait masalah perpajakan dan antitrust, dengan Apple akan dikenakan biaya pajak sebesar $10 miliar pada kuartal fiskal keempat tahun 2024."
    ],
    "commentSummary": [
      "Pengadilan tertinggi Uni Eropa telah memutuskan bahwa Apple harus membayar pajak tertunggak sebesar 13 miliar euro, mempertanyakan apakah Irlandia menerapkan aturan pajak yang seragam untuk semua perusahaan.",
      "Kasus ini berpusat pada apakah perlakuan pajak Irlandia terhadap Apple merupakan bantuan negara yang ilegal, yang menurut pengadilan memang demikian.",
      "Putusan ini telah memicu perdebatan tentang pengaruh Uni Eropa terhadap kebijakan perpajakan dan dampaknya terhadap perusahaan serta negara-negara anggotanya."
    ],
    "points": 197,
    "commentCount": 361,
    "retryCount": 0,
    "time": 1725955434
  },
  {
    "id": 41496699,
    "title": "Model dasar khusus radiologi",
    "originLink": "https://harrison.ai/harrison-rad-1/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41496699",
    "commentBody": "",
    "originSummary": [
      "Harrison.rad.1 adalah model dasar baru yang khusus untuk radiologi yang secara signifikan mengungguli yang lain, dengan skor 85,67% dalam ujian FRCR 2B Rapids, dibandingkan dengan model lain yang skornya di bawah 50%.",
      "Model ini unggul dalam berbagai tugas radiologi, termasuk deteksi temuan, lokalisasi, multi-modalitas, dan pelaporan terstruktur, berkat dataset eksklusif dan arsitektur khususnya.",
      "Harrison.rad.1 bertujuan untuk meningkatkan layanan kesehatan global dengan meningkatkan kapasitas radiologi dan tersedia untuk kolaborator terpilih dalam penelitian dan integrasi klinis."
    ],
    "commentSummary": [
      "Kajian tentang model AI khusus radiologi oleh harrison.ai menyoroti potensi manfaat dan tantangannya, termasuk akses publik yang terbatas dan kebutuhan akan model berlangganan dengan penafian.",
      "Pengguna memperdebatkan risiko teknologi dan etika dari diagnosis mandiri, batasan regulasi dan komersial, serta pentingnya mengintegrasikan data pasien dan kumpulan data terbuka.",
      "Kekhawatiran tentang tanggung jawab, akurasi, dan potensi penyalahgunaan model AI muncul, dengan beberapa pengguna optimis tentang masa depan AI dalam perawatan kesehatan dan yang lain memperingatkan terhadap ketergantungan berlebihan tanpa pengawasan yang tepat."
    ],
    "points": 177,
    "commentCount": 120,
    "retryCount": 0,
    "time": 1725936373
  },
  {
    "id": 41494786,
    "title": "Sigrok – sebuah rangkaian perangkat lunak analisis sinyal FOSS yang portabel dan lintas platform",
    "originLink": "https://sigrok.org/wiki/Main_Page",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41494786",
    "commentBody": "",
    "originSummary": [
      "Proyek sigrok menyediakan rangkaian perangkat lunak analisis sinyal yang portabel, lintas platform, dan sumber terbuka, mendukung perangkat seperti penganalisis logika dan osiloskop.",
      "Komponen utama termasuk libsigrok, libsigrokdecode, dan antarmuka seperti PulseView dan sigrok-cli, dengan pembaruan terbaru adalah sigrok-cli 0.7.2.",
      "Sigrok menawarkan fitur-fitur seperti pencatatan data, kontrol perangkat laboratorium, dan dekoding sinyal digital, dengan dukungan perangkat keras yang luas dan dokumentasi lengkap yang tersedia secara online."
    ],
    "commentSummary": [
      "Sigrok adalah perangkat lunak portabel, lintas platform, gratis, dan sumber terbuka (FOSS) untuk analisis sinyal, yang dipuji karena kegunaannya dengan perangkat keras yang terjangkau.",
      "Para kontributor telah menyatakan frustrasi atas umpan balik yang lambat dan gaya kode yang sudah ketinggalan zaman, yang mengarah pada diskusi tentang tantangan dalam memberikan patch besar dan kebutuhan bagi para pemelihara untuk menyeimbangkan waktu mereka.",
      "Beberapa pengguna menyarankan untuk mem-fork proyek tersebut karena lambatnya penggabungan, sementara yang lain tetap berharap akan lebih banyak kontributor untuk meningkatkan proyek tersebut."
    ],
    "points": 149,
    "commentCount": 30,
    "retryCount": 0,
    "time": 1725920535
  },
  {
    "id": 41500405,
    "title": "Debugging di Multiverse",
    "originLink": "https://antithesis.com/blog/multiverse_debugging/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41500405",
    "commentBody": "",
    "originSummary": [
      "Antithesis memperkenalkan alat debugging revolusioner yang memungkinkan pengguna untuk 'memutar balik waktu' guna memeriksa sistem tepat sebelum terjadi kerusakan, sehingga deteksi dan penyelesaian bug menjadi lebih efisien.",
      "Fitur utama mencakup simulasi deterministik, snapshotting, analisis lalu lintas jaringan, dan profil kinerja, semuanya bertujuan untuk menyederhanakan proses debugging.",
      "The Reactive Multiverse Interface menawarkan notebook reaktif berbasis peramban yang terhubung ke hypervisor deterministik, menyediakan lingkungan bebas efek samping untuk umpan balik debugging langsung."
    ],
    "commentSummary": [
      "Antithesis telah memperkenalkan hypervisor baru untuk debugging perjalanan waktu, memicu minat karena pendekatannya yang unik terhadap debugging deterministik.",
      "Berbeda dengan alat yang ada, Antithesis berfokus pada pengujian otomatis dan lingkungan pengembangan deterministik, menangani masalah seperti non-determinisme dan biaya penyimpanan secara efisien.",
      "Hypervisor dapat berjalan pada sistem Linux generik, termasuk NodeJS, dan menggunakan fuzzing terpandu serta snapshot untuk mengelola lingkungan produksi yang kompleks dan penangkapan data yang panjang."
    ],
    "points": 138,
    "commentCount": 39,
    "retryCount": 0,
    "time": 1725973542
  },
  {
    "id": 41501630,
    "title": "Ford mencari paten untuk teknologi yang mendengarkan percakapan pengemudi untuk menayangkan iklan",
    "originLink": "https://therecord.media/ford-patent-application-in-vehicle-listening-advertising",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41501630",
    "commentBody": "",
    "originSummary": [
      "Ford Motor Company sedang mengajukan paten untuk teknologi yang mendengarkan percakapan di dalam mobil untuk menyesuaikan iklan berdasarkan dialog, lokasi, dan data historis.",
      "Sistem yang disebut 'penyajian iklan dalam kendaraan' dapat menyampaikan iklan audio atau visual dan memprediksi tujuan untuk iklan yang relevan, tetapi paten tersebut tidak merinci langkah-langkah perlindungan data.",
      "Permohonan paten Ford telah menimbulkan kekhawatiran privasi, mirip dengan paten sebelumnya yang melibatkan pemantauan kecepatan mobil dan kendaraan yang dapat menarik diri sendiri."
    ],
    "commentSummary": [
      "Ford sedang mengajukan paten untuk teknologi yang mendengarkan percakapan pengemudi untuk menyampaikan iklan yang ditargetkan, yang menimbulkan kekhawatiran privasi yang signifikan.",
      "Kritikus khawatir tentang implikasi yang lebih luas, termasuk potensi masalah regulasi dan erosi privasi konsumen, jika teknologi ini menjadi meluas.",
      "Perdebatan berpusat pada apakah konsumen akan menerima fitur-fitur ini atau menghindari merek yang menerapkan metode iklan yang mengganggu tersebut."
    ],
    "points": 131,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1725981426
  },
  {
    "id": 41492807,
    "title": "Cohost akan ditutup pada akhir tahun 2024",
    "originLink": "https://cohost.org/staff/post/7611443-cohost-to-shut-down",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41492807",
    "commentBody": "",
    "originSummary": [
      "Kohost.org akan ditutup pada akhir tahun 2024 karena kekurangan dana dan kelelahan staf, tanpa staf yang dibayar dan semua dana dialokasikan untuk biaya operasional.",
      "Site ini akan menjadi hanya-baca pada 1 Oktober 2024, dengan opsi ekspor data yang ditingkatkan, dan pengguna dapat mengunduh data mereka hingga 31 Desember 2024, setelah itu semua data akan dihapus.",
      "Mulai 1 Januari 2025, situs akan dialihkan ke Wayback Machine, dan tim sedang mencari pekerjaan baru sambil mengucapkan terima kasih kepada pengguna serta meminta dukungan pendanaan potensial."
    ],
    "commentSummary": [
      "Kohost, sebuah platform media sosial, mengumumkan akan ditutup pada akhir tahun 2024, memicu diskusi tentang keberlanjutan layanan web sosial terbuka.",
      "Perdebatan ini menyoroti kesalahpahaman bahwa kontribusi pengguna yang minimal dapat mempertahankan platform semacam itu, mengabaikan biaya signifikan seperti gaji pengembang, jam kerja administratif, dan upaya moderasi.",
      "Penutupan ini menyoroti masalah yang lebih luas dalam industri teknologi, seperti tantangan dalam mempertahankan layanan yang tidak didukung iklan dan ekspektasi yang tidak realistis terhadap operasi berbiaya rendah."
    ],
    "points": 126,
    "commentCount": 112,
    "retryCount": 0,
    "time": 1725911573
  },
  {
    "id": 41502510,
    "title": "Google Illuminate: Buku dan Makalah diubah menjadi konten audio",
    "originLink": "https://illuminate.google.com/home",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41502510",
    "commentBody": "",
    "originSummary": [
      "Illuminate adalah alat AI eksperimental yang dirancang untuk mengubah konten menjadi diskusi audio yang menarik, yang dioptimalkan khusus untuk topik ilmu komputer.",
      "Pengguna dapat bergabung dengan daftar tunggu untuk bereksperimen dengan Illuminate, yang menggunakan suara dan diskusi yang dihasilkan oleh AI untuk menyesuaikan konten dengan preferensi belajar individu."
    ],
    "commentSummary": [
      "Google telah memperkenalkan \"Illuminate,\" sebuah layanan yang mengubah buku dan makalah akademis menjadi konten audio menggunakan suara yang dihasilkan oleh AI.",
      "Teknologi ini menggunakan AI untuk menciptakan audio percakapan yang membahas poin-poin penting dari makalah yang dipilih, saat ini dioptimalkan untuk penelitian ilmu komputer.",
      "Inovasi ini telah memicu diskusi tentang potensi untuk podcast yang dihasilkan secara otomatis, kualitas suara yang dihasilkan oleh AI, dan kekhawatiran tentang keaslian dan akurasi konten yang diekstraksi oleh AI."
    ],
    "points": 124,
    "commentCount": 69,
    "retryCount": 0,
    "time": 1725985333
  },
  {
    "id": 41500268,
    "title": "Kita berada dalam fase kekuatan kasar AI – begitu fase ini berakhir, permintaan untuk GPU juga akan berakhir",
    "originLink": "https://www.theregister.com/2024/09/10/brute_force_ai_era_gartner/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41500268",
    "commentBody": "",
    "originSummary": [
      "Erick Brethenoux, kepala AI di Gartner, mengklaim bahwa teknik AI yang memerlukan perangkat keras khusus, seperti GPU, 'terkutuk' dan mewakili fase 'kekuatan kasar' yang akan berakhir seiring dengan peningkatan teknik pemrograman.",
      "Brethenoux berpendapat bahwa AI generatif terlalu dibesar-besarkan, hanya cocok untuk lima persen dari beban kerja, dan menyarankan organisasi dapat mengambil manfaat dari AI tanpa terlalu bergantung padanya.",
      "Bern Elliot dari Gartner menyarankan untuk tidak terlalu bergantung pada AI generatif, merekomendasikan penggunaannya terutama untuk pembuatan konten dan antarmuka percakapan, serta menyarankan penggunaan AI non-generatif untuk memverifikasi hasil."
    ],
    "commentSummary": [
      "The current phase of AI development heavily relies on brute force computing, leading to high demand for GPUs.",
      "Paradoks Jevons menyiratkan bahwa peningkatan efisiensi dalam AI dapat mengakibatkan permintaan GPU yang lebih tinggi secara keseluruhan karena lebih banyak aplikasi.",
      "Ada perdebatan yang sedang berlangsung tentang apakah kemajuan AI akan beralih dari GPU atau apakah kebutuhan akan perangkat keras yang kuat akan tetap ada seiring dengan berkembangnya aplikasi AI."
    ],
    "points": 115,
    "commentCount": 159,
    "retryCount": 0,
    "time": 1725972743
  },
  {
    "id": 41495871,
    "title": "Board kompatibel DE10-Nano yang terjangkau untuk platform retro MiSTer FPGA",
    "originLink": "https://www.retrorgb.com/mister-pi-de-10-nano-clone-up-for-sale-today.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41495871",
    "commentBody": "",
    "originSummary": [
      "Udon merilis batch pertama papan kloning DE-10 Nano miliknya, \"MiSTer Pi,\" hari ini pukul 8 malam waktu NYC, dengan batch kedua pada tanggal 6 September pukul 8 pagi waktu NYC.",
      "Penetapan harga untuk papan klon dimulai dari $100, dengan opsi untuk komponen tambahan seperti RAM dan kipas, serta kit PCB lengkap tersedia seharga $160 (tidak termasuk casing).",
      "Ada kekhawatiran tentang proses manufaktur, dan calon pembeli disarankan untuk menunggu perbandingan rinci dengan versi DE-10 dan QMTech asli sebelum membeli."
    ],
    "commentSummary": [
      "Board kompatibel DE10-Nano yang terjangkau untuk platform retro MiSTer FPGA telah dirilis, menarik minat yang signifikan di kalangan penggemar game retro.",
      "Proyek MiSTer menargetkan papan DE10-Nano dan Cyclone V FPGA SoC-nya, tanpa port saat ini untuk papan yang lebih kuat, menyoroti fokus khusus pada emulasi perangkat keras game retro.",
      "Kartu baru terjual habis dengan cepat, menunjukkan permintaan tinggi dan antusiasme di dalam komunitas, dengan batch berikutnya diharapkan pada awal Oktober."
    ],
    "points": 106,
    "commentCount": 39,
    "retryCount": 0,
    "time": 1725927983
  },
  {
    "id": 41502721,
    "title": "Apa yang bisa Anda dapatkan dari font berkualitas tinggi",
    "originLink": "https://sinja.io/blog/get-maximum-out-of-your-font",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41502721",
    "commentBody": "",
    "originSummary": [
      "Font OpenType berkualitas tinggi dapat mengemas beberapa gaya ke dalam satu file, tidak seperti font tradisional yang memerlukan file terpisah untuk gaya yang berbeda.",
      "Font OpenType mendukung sumbu variabel (misalnya, berat, lebar, kemiringan) dan berbagai fitur seperti alternatif, gaya angka yang berbeda, huruf kecil, dan alternatif kontekstual, yang dapat dimanipulasi menggunakan properti CSS.",
      "Fitur font canggih ini meningkatkan tipografi dengan menyediakan alternatif gaya, swash, berbagai gaya angka, dan huruf kecil, membuat teks lebih menarik secara visual dan serbaguna."
    ],
    "commentSummary": [
      "Font berkualitas tinggi meningkatkan tipografi dan menawarkan fitur seperti angka tabular, tetapi banyak, terutama dari Google Fonts, kurang memiliki fitur OpenType canggih untuk meminimalkan ukuran file.",
      "Pengguna menyatakan kekhawatiran atas kelangkaan font Unicode yang komprehensif dan ketiadaan satu set font berlisensi terbuka yang distandardisasi di berbagai sistem operasi.",
      "Variabel sumbu dalam font memberikan fleksibilitas lebih dari sekadar penyesuaian berat, dan sumber daya seperti Practical Typography dari Butterick serta alat seperti fontdrop.info membantu desainer dalam mengoptimalkan fitur font."
    ],
    "points": 105,
    "commentCount": 34,
    "retryCount": 0,
    "time": 1725986330
  }
]
