[
  {
    "id": 41461499,
    "title": "बर्नआउट आपके मस्तिष्क के लिए हानिकारक है, ध्यान रखें",
    "originLink": "https://news.ycombinator.com/item?id=41461499",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41461499",
    "commentBody": "",
    "originSummary": [
      "लेखक अपने अवसाद और थकावट के अनुभव को साझा करते हैं, जिसमें सीखने, समस्या-समाधान और स्मृति जैसी संज्ञानात्मक क्षमताओं में महत्वपूर्ण गिरावट को उजागर किया गया है।",
      "वे समान समस्याओं को रोकने के लिए मानसिक स्वास्थ्य की देखभाल के महत्व पर जोर देते हैं।"
    ],
    "commentSummary": [
      "बर्नआउट संज्ञानात्मक कार्यों को महत्वपूर्ण रूप से प्रभावित करता है, जिससे रोजमर्रा के कार्य चुनौतीपूर्ण हो जाते हैं और सीखने और समस्या-समाधान की क्षमताओं पर असर पड़ता है।",
      "काम और जीवन के बीच स्पष्ट संतुलन स्थापित करना और कार्य समय में सीखने को शामिल करना, बर्नआउट को कम करने के लिए आवश्यक रणनीतियाँ हैं।",
      "बर्नआउट से उबरने में पेशेवर मदद, शारीरिक स्वास्थ्य का रखरखाव, और सहायक समुदायों के साथ जुड़ना शामिल है, जिसमें धैर्य और आत्म-देखभाल के महत्व पर जोर दिया जाता है।"
    ],
    "points": 612,
    "commentCount": 260,
    "retryCount": 0,
    "time": 1725580742
  },
  {
    "id": 41463809,
    "title": "क्या सैंडिया ने किसी उत्पाद के लोगो में एक थर्मोन्यूक्लियर सेकेंडरी का उपयोग किया?",
    "originLink": "https://blog.nuclearsecrecy.com/2024/09/04/did-sandia-use-a-thermonuclear-secondary-in-a-product-logo/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41463809",
    "commentBody": "",
    "originSummary": [
      "2007 में सैंडिया नेशनल लेबोरेटरीज के एक स्लाइड डेक में SIERRA सॉफ्टवेयर फ्रेमवर्क के लोगो के रूप में एक ग्राफिक दिखाया गया था, जो एक थर्मोन्यूक्लियर हथियार के कटअवे जैसा दिखता था, जिससे इसकी उत्पत्ति के बारे में सवाल उठने लगे।",
      "ग्राफिक, जो कई प्रस्तुतियों में दिखाई देता है, एक पुनः प्रवेश वाहन को दर्शाता है जिसमें थर्मोन्यूक्लियर वारहेड के समान घटक होते हैं, फिर भी सैंडिया ने इसे अवर्गीकृत माना।",
      "सिद्धांत बताते हैं कि यह एक जानबूझकर अनवर्गीकृत आकार हो सकता है या एक गलती, क्योंकि ऊर्जा विभाग (DOE) आमतौर पर विस्तृत हथियार डिजाइनों से बचता है ताकि प्रसार और राजनीतिक घोटाले को रोका जा सके।"
    ],
    "commentSummary": [
      "सैंडिया नेशनल लेबोरेटरीज ने एक छवि जारी की है जो एक थर्मोन्यूक्लियर हथियार की विस्तृत योजना प्रतीत होती है, जिससे इसकी सटीकता और प्रभावों के बारे में बहस छिड़ गई है।",
      "छवि का विवरण स्तर, जिसमें प्राथमिक, द्वितीयक और विकिरण केस जैसे घटक शामिल हैं, असामान्य है और ऊर्जा विभाग (DoE) के दिशानिर्देशों का उल्लंघन कर सकता है, जो आमतौर पर ऐसे चित्रणों को सरल आकारों तक सीमित रखते हैं।",
      "यह रिलीज़ तकनीकी जानकारी के लिए नहीं बल्कि प्रतिबंधित परमाणु डेटा के प्रबंधन और रिलीज़ के संबंध में अमेरिकी सरकारी प्रक्रियाओं में संभावित महत्वपूर्ण बदलाव का प्रतिनिधित्व करने के लिए उल्लेखनीय है।"
    ],
    "points": 482,
    "commentCount": 159,
    "retryCount": 0,
    "time": 1725607626
  },
  {
    "id": 41465735,
    "title": "वेल्थफोलियो: निजी, ओपन-सोर्स निवेश ट्रैकर",
    "originLink": "https://wealthfolio.app",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41465735",
    "commentBody": "",
    "originSummary": [
      "वेल्थफोलियो एक डेस्कटॉप-आधारित निवेश ट्रैकर है जो वित्तीय डेटा को स्थानीय रूप से संग्रहीत करता है, जिससे स्प्रेडशीट्स, सब्सक्रिप्शन और क्लाउड सेवाओं की आवश्यकता समाप्त हो जाती है।",
      "यह निवेश और बचत खातों को एकत्रित करता है, जिससे उपयोगकर्ता ब्रोकर या बैंकों से विवरण आयात कर सकते हैं, खाते के प्रदर्शन को ट्रैक कर सकते हैं, और लाभांश और ब्याज आय की निगरानी कर सकते हैं।",
      "उपयोगकर्ता स्पष्ट प्रगति ट्रैकिंग के साथ बचत लक्ष्य निर्धारित कर सकते हैं, जो वित्तीय प्रबंधन का एक सुरक्षित और सरल तरीका प्रदान करता है।"
    ],
    "commentSummary": [
      "वेल्थफोलियो एक निजी, ओपन-सोर्स निवेश ट्रैकर है जिसे SaaS सब्सक्रिप्शन और गोपनीयता समस्याओं से बचने के लिए डिज़ाइन किया गया है, और इसका मुद्रीकरण करने की कोई योजना नहीं है।",
      "उपयोगकर्ता वित्तीय संस्थानों के साथ सहज एकीकरण की आवश्यकता पर जोर देते हैं ताकि बोझिल मैनुअल CSV आयात को प्रतिस्थापित किया जा सके और उदाहरण डेटासेट जोड़ने और समर्थित दलालों/बैंकों की सूची बनाने का सुझाव देते हैं।",
      "स्थानीय डेटा भंडारण को क्लाउड-आधारित समाधानों पर प्राथमिकता दी जाती है, और स्वचालित आयात की कमी और सटीक डेटा को मैन्युअल रूप से बनाए रखने की चुनौतियों के बारे में चिंताएँ हैं।"
    ],
    "points": 392,
    "commentCount": 137,
    "retryCount": 0,
    "time": 1725627375
  },
  {
    "id": 41460037,
    "title": "Clojure 1.12.0 अब उपलब्ध है",
    "originLink": "https://clojure.org/news/2024/09/05/clojure-1-12-0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41460037",
    "commentBody": "",
    "originSummary": [
      "Clojure 1.12.0 कई नए फीचर्स और अपडेट्स पेश करता है, जिसमें Java 8 संगतता को समाप्त करना और Java 21 के लिए समर्थन जोड़ना शामिल है।",
      "मुख्य अपडेट्स में CVE-2024-22871 के लिए एक सुधार, जावा सीरियलाइजेशन पहचानकर्ताओं पर बेहतर नियंत्रण, और spec.alpha और core.specs.alpha के लिए अद्यतन निर्भरताएँ शामिल हैं।",
      "नई विशेषताओं में इंटरएक्टिव लाइब्रेरी जोड़ना, आउट-ऑफ-प्रोसेस टूल फंक्शन इनवोकेशन, बेहतर प्रोसेस मैनेजमेंट, और उन्नत जावा इंटरऑप क्षमताएं शामिल हैं जैसे कि जावा मेथड्स को फंक्शन्स के रूप में उपयोग करना और जावा स्ट्रीम्स के लिए बेहतर समर्थन।"
    ],
    "commentSummary": [
      "Clojure 1.12.0 जारी किया गया है, जिसमें add-libs की सुविधा है, जो बिना किसी अतिरिक्त कोड के रन करने योग्य कोड स्निपेट्स और जावा लाइब्रेरी का डेमो साझा करना आसान बनाता है।",
      "रिलीज में कार्यात्मक इंटरफ़ेस परिवर्तनों को शामिल किया गया है, जिससे उपयोगिता मैक्रोज़ की आवश्यकता कम हो जाती है, और इसकी तुलना Groovy के @Grab एनोटेशन और Jbang की निर्भरता सुविधा से की जाती है।",
      "इकोसिस्टम के आकार को लेकर चिंताओं के बावजूद, Clojure स्थिर, विश्वसनीय और पिछली संगतता बनाए रखता है, और इसकी एक ऐसी समुदाय है जो सरलता और सोच-समझकर किए गए विकास को महत्व देती है।"
    ],
    "points": 351,
    "commentCount": 94,
    "retryCount": 0,
    "time": 1725567172
  },
  {
    "id": 41459865,
    "title": "एक सामान्य खाद्य रंग त्वचा और मांसपेशियों को अस्थायी रूप से पारदर्शी बनाने के लिए पाया गया",
    "originLink": "https://www.theguardian.com/science/article/2024/sep/05/common-food-dye-found-to-make-skin-and-muscle-temporarily-transparent",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41459865",
    "commentBody": "",
    "originSummary": [
      "स्टैनफोर्ड विश्वविद्यालय के शोधकर्ताओं ने एक सामान्य खाद्य रंग, टार्ट्राजीन, का उपयोग करके जीवित जानवरों में त्वचा, मांसपेशियों और संयोजी ऊतकों को अस्थायी रूप से पारदर्शी बनाने की तकनीक विकसित की है।",
      "यह विधि आंतरिक अंगों, रक्त वाहिकाओं, चोटों, नसों और ट्यूमर की गैर-आक्रामक दृश्यता की अनुमति देकर चिकित्सा अनुप्रयोगों में क्रांति ला सकती है।",
      "यह प्रक्रिया प्रतिवर्ती है, जिसमें रंग धोने के बाद ऊतक अपनी सामान्य उपस्थिति पुनः प्राप्त कर लेते हैं, हालांकि इसे अभी तक मनुष्यों पर परीक्षण नहीं किया गया है।"
    ],
    "commentSummary": [
      "शोधकर्ताओं ने पाया कि खाद्य रंग टार्ट्राजीन चूहों में त्वचा और मांसपेशियों को अस्थायी रूप से पारदर्शी बना सकता है, जिससे आंतरिक अंग दिखाई देने लगते हैं।",
      "इस प्रक्रिया का मनुष्यों पर परीक्षण नहीं किया गया है, जिससे सुरक्षा संबंधी चिंताएँ उत्पन्न हो रही हैं, विशेष रूप से इंजेक्शन के संबंध में।",
      "इस खोज ने संभावित अनुप्रयोगों और सुरक्षा के बारे में चर्चाओं की शुरुआत की है, जिसमें काल्पनिक अदृश्यता सीरम की तुलना की जा रही है, लेकिन मनुष्यों में इसके पूर्ण संभावनाओं और सुरक्षा को समझने के लिए और अधिक शोध की आवश्यकता है।"
    ],
    "points": 335,
    "commentCount": 138,
    "retryCount": 0,
    "time": 1725565702
  },
  {
    "id": 41462574,
    "title": "जब आप एक अचार को एएम रेडियो टॉवर से छूते हैं तो क्या होता है",
    "originLink": "https://www.jeffgeerling.com/blog/2024/what-happens-when-you-touch-pickle-am-radio-tower",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41462574",
    "commentBody": "",
    "originSummary": [
      "प्रयोग में विभिन्न खाद्य पदार्थों को एक एएम रेडियो टॉवर से जोड़ना और एसडब्ल्यूआर (स्टैंडिंग वेव रेशियो), आरएफ (रेडियो फ्रीक्वेंसी) पावर, और मांस के तापमान जैसे मापदंडों को मापना शामिल था।",
      "मुख्य निष्कर्षों में शामिल थे हॉट डॉग का शोर उत्पन्न करना और 80°C तक गर्म होना, अचार का प्लाज्मा शॉकवेव उत्पन्न करना, और ब्राटवुर्स्ट का संकेतों को जर्मन वाक्यांशों में अनुवाद करना।",
      "भविष्य के परीक्षणों में ध्वनि दबाव स्तर मीटर, बेहतर इन्सुलेटिंग रॉड्स, और प्लाज्मा इंटरैक्शन को कैप्चर करने के लिए एक उच्च गति कैमरा शामिल करने का सुझाव दिया गया है।"
    ],
    "commentSummary": [
      "एक अचार को एएम रेडियो टॉवर से छूने पर ऑडियो शोर उत्पन्न हो सकता है क्योंकि एएम सिग्नल प्लाज्मा आर्क्स का कारण बनता है।",
      "एएम टावर एफएम टावर की तुलना में अधिक खतरनाक होते हैं क्योंकि वे अधिक ऊर्जा वहन करते हैं और आकार में बड़े होते हैं।",
      "प्रयोग एएम संकेतों के अद्वितीय गुणों और उच्च-शक्ति वाले रेडियो टावरों के संभावित खतरों को प्रदर्शित करता है।"
    ],
    "points": 302,
    "commentCount": 98,
    "retryCount": 0,
    "time": 1725592580
  },
  {
    "id": 41463734,
    "title": "20 लाख उपयोगकर्ता लेकिन बैंक में पैसे नहीं",
    "originLink": "https://exercism.org/blog/september-2024-restructure",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41463734",
    "commentBody": "",
    "originSummary": [
      "दो मिलियन उपयोगकर्ताओं और 45 मिलियन व्यायाम प्रस्तुतियों तक पहुंचने के बावजूद, मंच वित्तीय चुनौतियों का सामना कर रहा है और अपनी टीम को भुगतान करने में असमर्थ है।",
      "एरिक, एक प्रमुख टीम सदस्य, वित्तीय बाधाओं के कारण जा रहे हैं लेकिन वरिष्ठ मेंटेनर के रूप में जारी रहेंगे; गुणवत्ता नियंत्रण के लिए नए GitHub टीमों के साथ रिपॉजिटरी प्रबंधन को पुनर्गठित किया गया है।",
      "प्लेटफ़ॉर्म के पास 800 मासिक दानदाता हैं जो सर्वर की लागत को कवर करते हैं, और संस्थापक 2025 में एक नया शैक्षिक उत्पाद लॉन्च कर रहे हैं जो कोडिंग के मूल सिद्धांतों को सिखाएगा और प्लेटफ़ॉर्म की वृद्धि का समर्थन करेगा।"
    ],
    "commentSummary": [
      "Exercism.org, 2 मिलियन उपयोगकर्ताओं के साथ, अपनी लोकप्रियता के बावजूद वित्तीय चुनौतियों का सामना कर रहा है, क्योंकि बैंक में कोई पैसा नहीं है।",
      "लागत को कवर करने के लिए सुझावों में एक छोटी सी शुल्क ($1/माह या $10/वर्ष) लेना शामिल है, हालांकि गैर-पश्चिमी देशों में विशेष रूप से छात्रों को हतोत्साहित करने के बारे में चिंताएँ हैं।",
      "मंच वर्तमान में सर्वर लागतों के लिए मासिक $7,500 के दान पर निर्भर है, जिससे लाभकारी मॉडल में बदलाव करने या स्थिरता के लिए नए राजस्व स्रोत खोजने पर चर्चा हो रही है।"
    ],
    "points": 221,
    "commentCount": 156,
    "retryCount": 0,
    "time": 1725606998
  },
  {
    "id": 41464371,
    "title": "स्विफ्ट एक अधिक सुविधाजनक रस्ट है",
    "originLink": "http://blog.namangoel.com/swift-is-the-more-convenient-rust",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41464371",
    "commentBody": "",
    "originSummary": [
      "रस्ट और स्विफ्ट में कई विशेषताएँ समान हैं, जिनमें फंक्शनल तत्व, एक मजबूत प्रकार प्रणाली, और LLVM-आधारित संकलन शामिल हैं, लेकिन वे अपने डिफ़ॉल्ट अमूर्तन स्तरों में भिन्न हैं।",
      "स्विफ्ट की सिंटैक्स और त्रुटि प्रबंधन उन डेवलपर्स के लिए अधिक परिचित और सुविधाजनक है जो C-जैसी भाषाओं के आदी हैं, जबकि रस्ट सिस्टम प्रोग्रामिंग के लिए अधिक नियंत्रण और गति प्रदान करता है।",
      "रस्ट निम्न-स्तरीय सिस्टम और एम्बेडेड प्रोग्रामिंग के लिए आदर्श है, जबकि स्विफ्ट यूआई और सर्वर अनुप्रयोगों के लिए बेहतर अनुकूल है, और भविष्य में इनके बीच अधिक ओवरलैप की संभावना है।"
    ],
    "commentSummary": [
      "पोस्ट में स्विफ्ट और रस्ट के बीच तुलना की गई है, जिसमें स्विफ्ट को रस्ट के मुकाबले एक अधिक सुविधाजनक विकल्प के रूप में प्रस्तुत किया गया है।",
      "यह इस बात पर जोर देता है कि रस्ट गैर-गार्बेज कलेक्टेड (जीसी) स्वचालित मेमोरी प्रबंधन को मुख्यधारा में लाने के लिए उल्लेखनीय है, एक विशेषता जिसने डेवलपर्स के बीच महत्वपूर्ण रुचि और बहस को जन्म दिया है।",
      "चर्चा में प्रोग्रामिंग भाषाओं के विकास पर भी ध्यान दिया गया है, जिसमें स्मॉलटॉक-व्युत्पन्न भाषाओं (जैसे, रूबी, पायथन) से एमएल परिवार की भाषाओं (जैसे, रस्ट, स्काला, स्विफ्ट) की ओर बदलाव का उल्लेख किया गया है।"
    ],
    "points": 219,
    "commentCount": 242,
    "retryCount": 0,
    "time": 1725613849
  },
  {
    "id": 41460276,
    "title": "वाल्व के शुरुआती दिन एक अंदरूनी महिला की नजर से",
    "originLink": "https://medium.com/@monicah428/the-early-days-of-valve-from-a-woman-inside-bf80c6b47961",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41460276",
    "commentBody": "",
    "originSummary": [
      "वाल्व का हाफ-लाइफ, जो 26 साल पहले रिलीज़ हुआ था, अभी भी अमेज़न पर उपलब्ध है, जो इसकी स्थायी लोकप्रियता को दर्शाता है।",
      "मोनिका हैरिंगटन, जिन्होंने वॉल्व की प्रारंभिक सफलता में एक महत्वपूर्ण लेकिन अक्सर अनदेखी की जाने वाली भूमिका निभाई, कंपनी के लिए अपने विपणन और व्यापार विकास की कहानी साझा करती हैं।",
      "प्रारंभिक चुनौतियों के बावजूद, हाफ-लाइफ ने महत्वपूर्ण प्रशंसा प्राप्त की, जिससे वाल्व गेमिंग उद्योग में एक प्रमुख खिलाड़ी के रूप में स्थापित हो गया।"
    ],
    "commentSummary": [
      "यह लेख वाल्व के शुरुआती दिनों पर एक अंदरूनी दृष्टिकोण प्रदान करता है, जिसमें मोनिका हैरिंगटन के योगदान को उजागर किया गया है, जिन्होंने कंपनी की सफलता में महत्वपूर्ण भूमिका निभाई लेकिन उन्हें बड़े पैमाने पर मान्यता नहीं मिली।",
      "यह दिखाता है कि माइक्रोसॉफ्ट ने उसे वेल्व के लिए अतिरिक्त काम करने की अनुमति दी, जो एक प्रतिस्पर्धी कंपनी है, जो आज के सख्त आईपी स्वामित्व वाले माहौल में प्रमुख तकनीकी कंपनियों में असामान्य है।",
      "यह कहानी तकनीक के क्षेत्र में महिलाओं द्वारा सामना की जाने वाली चुनौतियों को उजागर करती है, जिसमें महत्वपूर्ण योगदान के बावजूद इतिहास से मिटा दिया जाना शामिल है, और वाल्व की प्रारंभिक वृद्धि और अंतिम सफलता को आकार देने वाले गतिशीलता और निर्णयों पर प्रकाश डालती है।"
    ],
    "points": 209,
    "commentCount": 39,
    "retryCount": 0,
    "time": 1725569249
  },
  {
    "id": 41459781,
    "title": "रिफ्लेक्शन 70बी, शीर्ष ओपन-सोर्स मॉडल",
    "originLink": "https://twitter.com/mattshumer_/status/1831767014341538166",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41459781",
    "commentBody": "",
    "originSummary": [
      "रिफ्लेक्शन 70B, एक ओपन-सोर्स मॉडल, पेश किया गया है, जो रिफ्लेक्शन-ट्यूनिंग का उपयोग करके बड़े भाषा मॉडल्स (LLMs) को अपनी खुद की गलतियों को सुधारने की अनुमति देता है।",
      "एक अधिक उन्नत मॉडल, रिफ्लेक्शन 405B, के अगले सप्ताह जारी होने की उम्मीद है, जिसे दुनिया में सबसे अच्छा माना जा रहा है।",
      "दोनों मॉडलों को GlaiveAI के सहयोग से विकसित किया गया है, जो AI आत्म-सुधार क्षमताओं में महत्वपूर्ण प्रगति का संकेत देता है।"
    ],
    "commentSummary": [
      "रिफ्लेक्शन 70B, एक ओपन-सोर्स मॉडल, अपने प्रदर्शन के लिए जाना जाता है, जो 'रिफ्लेक्शन' तकनीक का उपयोग करके Llama-3.1 का एक फाइन-ट्यून संस्करण प्रतीत होता है।",
      "परावर्तन तकनीक में मॉडल द्वारा प्रारंभिक उत्तर का मसौदा तैयार करना और फिर उसे संशोधित करना शामिल है, जिससे त्रुटियों का सुधार और बेहतर उत्तर प्राप्त होते हैं, जो कभी-कभी GPT-4o और Claude जैसे मॉडलों से भी बेहतर प्रदर्शन करते हैं।",
      "यह बहस जारी है कि क्या अन्य मॉडल समान सुधार प्राप्त कर सकते हैं यदि वे परावर्तन तकनीक को अपनाते हैं, और बहु-मोड़ वार्तालापों और विभिन्न मानकों में मॉडल की प्रभावशीलता का अभी भी मूल्यांकन किया जा रहा है।"
    ],
    "points": 206,
    "commentCount": 77,
    "retryCount": 0,
    "time": 1725565145
  },
  {
    "id": 41463330,
    "title": "खेल का अपेक्षित मूल्य सकारात्मक है चाहे बाल्मर की रणनीति कुछ भी हो",
    "originLink": "https://gukov.dev/puzzles/math/2024/09/05/steve-ballmer-was-wrong.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41463330",
    "commentBody": "",
    "originSummary": [
      "जॉन ग्राहम-कमिंग की पोस्ट, जिसमें स्टीव बाल्मर के बाइनरी सर्च इंटरव्यू प्रश्न के बारे में बताया गया है, ने हैकर न्यूज़ पर रुचि जगा दी है।",
      "बॉल्मर तर्क देते हैं कि खेल का अपेक्षित मूल्य नकारात्मक है, लेकिन जॉन इसका विरोध करते हुए कहते हैं कि यादृच्छिक संख्या चयन के साथ, अपेक्षित मूल्य सकारात्मक है: $0.20।",
      "गणितीय अनुकूलन और scipy के सॉल्वर का उपयोग करके, एक मिश्रित रणनीति तैयार की जा सकती है जो सकारात्मक अपेक्षित मूल्य सुनिश्चित करती है, जिससे खेल संभावित रूप से लाभदायक हो सकता है।"
    ],
    "commentSummary": [
      "खेल का अपेक्षित मूल्य सकारात्मक है चाहे बाल्मर की रणनीति कुछ भी हो, लेकिन बाल्मर का तर्क है कि यदि जीवित रहना प्राथमिकता है तो टेल रिस्क के कारण अपेक्षित मूल्य एक अच्छा मापदंड नहीं है।",
      "सेंट पीटर्सबर्ग विरोधाभास का उपयोग यह दिखाने के लिए किया जाता है कि अपेक्षित मूल्य हमेशा जोखिम का एक विश्वसनीय माप नहीं होता है।",
      "इस खेल में 1 से 100 के बीच एक संख्या का अनुमान लगाना शामिल है, जिसमें प्रतिकूल व्यवहार की संभावना होती है, और एक मिश्रित रणनीति सकारात्मक अपेक्षित मूल्य सुनिश्चित कर सकती है।"
    ],
    "points": 183,
    "commentCount": 152,
    "retryCount": 0,
    "time": 1725602893
  },
  {
    "id": 41461747,
    "title": "टेक कंपनियां अपने इंजीनियरों को रुकने के लिए भुगतान क्यों नहीं करतीं?",
    "originLink": "https://www.goethena.com/post/why-dont-tech-companies-pay-engineers-more-to-stay/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41461747",
    "commentBody": "",
    "originSummary": [
      "कई तकनीकी कंपनियाँ इंजीनियरों को पर्याप्त वेतन नहीं देती हैं जिससे उन्हें बनाए रखना मुश्किल हो जाता है, और इसके परिणामस्वरूप डेवलपर्स बेहतर वेतन की तलाश में अन्यत्र चले जाते हैं।",
      "एथीना इस मुद्दे को संबोधित कर रही है, करियर पथ और मुआवजा संरचनाएं बनाकर जो इंजीनियरों को उनके प्रभाव के आधार पर उदारतापूर्वक पुरस्कृत करती हैं, जिसका उद्देश्य लंबी अवधि को प्रोत्साहित करना है।",
      "एथीना का दृष्टिकोण शीर्षक, कार्यकाल, और प्रदर्शन को ध्यान में रखते हुए एक मुआवजा सूत्र शामिल करता है, जिससे यह पूर्वानुमेय और सार्वजनिक हो जाता है ताकि प्रतिभा की घनत्व को बनाए रखा जा सके और प्रभावशाली इंजीनियरों को पुरस्कृत किया जा सके।"
    ],
    "commentSummary": [
      "इंजीनियर अक्सर प्रबंधन की निराशाओं के कारण तकनीकी कंपनियों को छोड़ देते हैं, न कि अपर्याप्त वेतन के कारण, जो इस धारणा को चुनौती देता है कि पैसा ही मुख्य प्रेरक है।",
      "बहस में वित्तीय स्वतंत्रता, नौकरी की संतुष्टि, और प्रबंधन के प्रभाव पर विचार शामिल हैं, जिसमें कुछ का तर्क है कि बेहतर प्रबंधन और उचित मुआवजा प्रतिभा को बनाए रखने की कुंजी हैं।",
      "आय को दोगुना करने से जीवन की गुणवत्ता में महत्वपूर्ण बदलाव आता है या नहीं, इस पर दृष्टिकोण भिन्न होते हैं, जो यह दर्शाता है कि नौकरी की संतुष्टि के कारक केवल वेतन से परे कितने जटिल हो सकते हैं।"
    ],
    "points": 164,
    "commentCount": 267,
    "retryCount": 0,
    "time": 1725583296
  },
  {
    "id": 41461850,
    "title": "LwIP – लाइटवेट आईपी स्टैक",
    "originLink": "https://www.nongnu.org/lwip/2_1_x/index.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41461850",
    "commentBody": "",
    "originSummary": [
      "lwIP 2.1.0 एक हल्का TCP/IP प्रोटोकॉल सूट है जिसे RAM उपयोग को न्यूनतम करने के लिए डिज़ाइन किया गया है, जिससे यह सीमित संसाधनों वाले एम्बेडेड सिस्टम के लिए आदर्श बनता है।",
      "यह IPv4/IPv6, DHCP, TCP/UDP, और mbedTLS के माध्यम से वैकल्पिक TLS सहित कई नेटवर्किंग सुविधाओं का समर्थन करता है।",
      "मूल रूप से एडम डंकल्स द्वारा विकसित, lwIP अब वैश्विक डेवलपर्स के नेटवर्क द्वारा बनाए रखा जाता है और BSD लाइसेंस के तहत उपलब्ध है।"
    ],
    "commentSummary": [
      "LwIP (लाइटवेट आईपी) एक लोकप्रिय TCP/IP स्टैक है जिसे सीमित संसाधनों वाले एम्बेडेड सिस्टम के लिए डिज़ाइन किया गया है, जैसे कि कुछ किलोबाइट्स की RAM और लगभग 40 किलोबाइट्स की कोड ROM।",
      "एलडब्ल्यूआईपी के विकल्पों में नेटएक्सडुओ शामिल है, जो अब एमआईटी-लाइसेंस प्राप्त है और एक्लिप्स फाउंडेशन द्वारा समर्थित है, और अन्य स्टैक्स जैसे ज़ेफिर और स्मॉलटीसीपी।",
      "LwIP का व्यापक रूप से संसाधन-सीमित उपकरणों में उपयोग किया जाता है और यह FreeRTOS के साथ अच्छी तरह से एकीकृत होता है, लेकिन इसे खराब दस्तावेज़ीकरण और विक्रेता-विशिष्ट पोर्ट और ड्राइवरों के मुद्दों के लिए आलोचना का सामना करना पड़ा है।"
    ],
    "points": 152,
    "commentCount": 49,
    "retryCount": 0,
    "time": 1725584406
  },
  {
    "id": 41464334,
    "title": "अनशिप करने का इरादा: HTTP/2 पुश",
    "originLink": "https://groups.google.com/a/mozilla.org/g/dev-platform/c/vU9hJg343U8/m/4cZsHz7TAQAJ",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41464334",
    "commentBody": "",
    "originSummary": [
      "वैलेंटिन गोसु ने प्रमुख ब्राउज़रों जैसे सफारी, क्रोम, और फायरफॉक्स के साथ संगतता समस्याओं के कारण सभी प्लेटफार्मों पर HTTP/2 पुश को अक्षम करने की घोषणा की।",
      "क्रोम ने सितंबर 2022 में HTTP/2 पुश को अक्षम कर दिया, और rel=\"preload\" और 103 अर्ली हिंट्स जैसे विकल्पों की सिफारिश की, जबकि फ़ायरफ़ॉक्स को वेब संगतता समस्याओं का सामना करना पड़ा।",
      "इस सुविधा को जल्द ही बंद कर दिया जाएगा और अगले वसंत में विस्तारित समर्थन रिलीज़ (ESR) 140 से पहले इसे हटाए जाने की उम्मीद है।"
    ],
    "commentSummary": [
      "HTTP/2 पुश को उसकी अप्रभाविता और जटिलता के कारण चरणबद्ध तरीके से समाप्त किया जा रहा है, भले ही इसे प्रारंभिक समर्थन गूगल से मिला था।",
      "इस सुविधा का उद्देश्य सर्वरों को संसाधनों को सक्रिय रूप से भेजने की अनुमति देकर विलंबता को कम करना था, लेकिन इसे खराब ब्राउज़र कार्यान्वयन और कैश की अक्षमताओं जैसी चुनौतियों का सामना करना पड़ा।",
      "प्रीलोड हेडर्स और 103 अर्ली हिंट्स जैसे विकल्प सरल और अधिक प्रभावी साबित हुए हैं, जो व्यावहारिक, आसानी से लागू होने वाले समाधानों की प्रवृत्ति को दर्शाते हैं।"
    ],
    "points": 138,
    "commentCount": 78,
    "retryCount": 0,
    "time": 1725613430
  },
  {
    "id": 41464347,
    "title": "अध्ययन: डी एंड डी खेलने से ऑटिस्टिक खिलाड़ियों को सामाजिक बातचीत में मदद मिलती है",
    "originLink": "https://arstechnica.com/science/2024/09/study-playing-dungeons-dragons-helps-autistic-players-in-social-interactions/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41464347",
    "commentBody": "",
    "originSummary": [
      "जर्नल ऑटिज्म में प्रकाशित एक अध्ययन से पता चलता है कि डंजन्स एंड ड्रैगन्स (D&D) खेलना ऑटिस्टिक खिलाड़ियों को सामाजिक बातचीत में सुधार करने में मदद करता है।",
      "शोधकर्ताओं ने पाया कि डी एंड डी का संरचित वातावरण और स्पष्ट सामाजिक नियम आत्मविश्वास बढ़ाते हैं और ऑटिस्टिक खिलाड़ियों में एकता की भावना को प्रोत्साहित करते हैं।",
      "अध्ययन, जिसमें आठ प्रतिभागी ऑनलाइन वाटरडीप: ड्रैगनहिस्ट अभियान खेल रहे थे, यह सुझाव देता है कि डी एंड डी एक सामाजिक स्नेहक के रूप में कार्य कर सकता है, जो ऑटिस्टिक व्यक्तियों के लिए सकारात्मक अनुभव और कौशल प्रदान करता है।"
    ],
    "commentSummary": [
      "एक अध्ययन से संकेत मिलता है कि डंजन्स एंड ड्रैगन्स (D&D) खेलना ऑटिस्टिक खिलाड़ियों को भावनाओं को बाहरी रूप देने और विश्वास बनाने के माध्यम से सामाजिक संपर्कों को बढ़ाने में मदद कर सकता है।",
      "डी एंड डी का संरचित वातावरण सामाजिक अभ्यास के लिए एक सुरक्षित स्थान प्रदान करता है, हालांकि कुछ ऑटिस्टिक व्यक्तियों को खेल के नियम और गतिशीलताएँ चुनौतीपूर्ण लग सकती हैं।",
      "अध्ययन में नमूने का आकार छोटा था, जो इन निष्कर्षों की पुष्टि के लिए आगे के शोध की आवश्यकता को इंगित करता है।"
    ],
    "points": 130,
    "commentCount": 71,
    "retryCount": 0,
    "time": 1725613550
  }
]
