[
  {
    "id": 40940225,
    "title": "WebVM is een serverloze virtuele Linux-omgeving die client-side draait",
    "originLink": "https://webvm.io/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40940225",
    "commentBody": "",
    "originSummary": [
      "WebVM is een server-loze virtuele Linux-omgeving die volledig client-side draait met behulp van HTML5 en WebAssembly, aangedreven door de CheerpX-virtualisatie-engine.",
      "Het maakt veilige, sandboxed uitvoering van x86-binaries in elke browser mogelijk, met een x86-naar-WebAssembly JIT (Just-In-Time) compiler, een virtueel blokgebaseerd bestandssysteem en een Linux syscall-emulator.",
      "Nieuwe functie: Gebruikers kunnen nu aangepaste WebVM-afbeeldingen maken met behulp van Dockerfile, wat de flexibiliteit en aanpassing verbetert."
    ],
    "commentSummary": [
      "WebVM is een server-loze virtuele Linux-omgeving die client-side draait, gebruikmakend van een CheerpX-build gehost door Leaning Technologies en netwerkondersteuning via Tailscale.",
      "WebVM fungeert als een Linux syscall-emulator voor userland-binaries, in tegenstelling tot volledige systeememulators, en biedt daardoor meer flexibiliteit en snelheid.",
      "Het is niet open-source, en zelf-hosting van de CheerpX-engine is verboden, waardoor het geschikt is voor onderwijs, live documentatie, softwarebehoud en web-IDE-ontwikkeling, hoewel het beperkingen heeft zoals prestatieproblemen op mobiele apparaten en gedeeltelijke offline functionaliteit."
    ],
    "points": 572,
    "commentCount": 119,
    "retryCount": 0,
    "time": 1720728981
  },
  {
    "id": 40944505,
    "title": "AT&T zegt dat criminelen telefoongegevens van 'bijna alle' klanten hebben gestolen bij een datalek",
    "originLink": "https://techcrunch.com/2024/07/12/att-phone-records-stolen-data-breach/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40944505",
    "commentBody": "",
    "originSummary": [
      "AT&T bevestigde een datalek dat bijna 110 miljoen klanten treft, met betrekking tot telefoonnummers, bel- en sms-gegevens en locatiegerelateerde informatie.",
      "De inbreuk, gekoppeld aan cloudgegevensleverancier Snowflake, omvat metadata maar niet de inhoud van oproepen of sms'jes.",
      "De FBI en DOJ hebben de openbare kennisgeving uitgesteld vanwege zorgen over de nationale veiligheid, wat het tweede beveiligingsincident van AT&T dit jaar markeert."
    ],
    "commentSummary": [
      "AT&T heeft een datalek ervaren dat bijna alle klanten treft, waarbij bel- en tekstmetadata zijn blootgesteld, maar niet de inhoud of tijdstempels.",
      "Ondanks een aanvankelijke daling van de aandelen, blijft de markt grotendeels onaangetast, wat een geloof weerspiegelt dat bedrijven minimale financiële gevolgen ondervinden van dergelijke inbreuken.",
      "Het incident, gekoppeld aan het cloudplatform van Snowflake, heeft geleid tot oproepen voor strengere gegevensbewaaringsbeleid, betere beveiligingspraktijken en mogelijke zware boetes of rechtszaken om de verantwoordelijkheid van bedrijven af te dwingen."
    ],
    "points": 285,
    "commentCount": 214,
    "retryCount": 0,
    "time": 1720783074
  },
  {
    "id": 40941056,
    "title": "Fysica-gebaseerd Deep Learning Boek",
    "originLink": "https://physicsbaseddeeplearning.org/intro.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40941056",
    "commentBody": "",
    "originSummary": [
      "Het Physics-based Deep Learning Book (v0.2) biedt een praktische introductie tot deep learning in fysieke simulaties, met praktische Jupyter-notebookvoorbeelden.",
      "Nieuw in versie 0.2: Uitgebreid gedeelte over het integreren van differentieerbare programmering (DP) in de training van neurale netwerken (NN) en een nieuw hoofdstuk over verbeterde leermethoden voor natuurkundige problemen.",
      "Toekomstige updates zullen hoofdstukken bevatten over het trainen van netwerken voor vloeistofstroomvoorspelling, het gebruik van modelvergelijkingen als residuen, het interactie met simulatoren voor inverse problemen, en het benutten van hogere-orde informatie voor betere neurale netwerken."
    ],
    "commentSummary": [
      "Een nieuw boek getiteld 'Physics-Based Deep Learning' is geïntroduceerd, met de nadruk op het toepassen van deep learning op fysicasimulaties in plaats van algemene deep learning-concepten vanuit het perspectief van een natuurkundige.",
      "Het boek bevat praktische codevoorbeelden in Jupyter-notebooks, fysieke verliesbeperkingen, differentieerbare simulaties, trainingsalgoritmen voor natuurkundige problemen, versterkend leren en onzekerheidsmodellering.",
      "Het boek is geproduceerd door de Physics-based Simulation Group en is beschikbaar voor download op arXiv, met aanvullende bronnen en discussies beschikbaar op verschillende platforms zoals YouTube en GitHub."
    ],
    "points": 283,
    "commentCount": 20,
    "retryCount": 0,
    "time": 1720735810
  },
  {
    "id": 40942732,
    "title": "Gebruik S3 als een Container Registry",
    "originLink": "https://ochagavia.nl/blog/using-s3-as-a-container-registry/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40942732",
    "commentBody": "",
    "originSummary": [
      "Een ontwikkelaar heeft aangetoond dat Amazon S3 kan worden gebruikt als een containerregister door een S3-bucket via HTTP bloot te stellen en containerbeeldbestanden naar specifieke paden te uploaden, waardoor `docker pull`-operaties mogelijk zijn.",
      "Het belangrijkste voordeel van het gebruik van S3 boven traditionele containerregisters zoals DockerHub of Amazon ECR is aanzienlijk snellere uploadsnelheden dankzij parallelle gechunkte uploads.",
      "Deze experimentele benadering mist functies zoals geautomatiseerde beveiligingsscans en toegangscontroles, maar zou kunnen leiden tot het hosten van openbare containerafbeeldingen in Cloudflare's R2 met gratis uitgaande gegevens."
    ],
    "commentSummary": [
      "Het gebruik van Amazon S3 als een containerregister wordt besproken, waarbij de nadruk ligt op het potentieel ervan als een alternatief voor traditionele containerregisters zoals DockerHub en AWS ECR.",
      "Het gesprek bekritiseert de OCI (Open Container Initiative) Distribution Spec vanwege de inefficiënties, zoals het vereisen van sequentiële laaguploads en het ontbreken van gestandaardiseerde paginering voor het weergeven van tags.",
      "Docker's impact op softwareontwikkeling wordt besproken, waarbij sommigen de vereenvoudiging van het afhankelijkheidsbeheer prijzen en anderen het bekritiseren omdat het de betrouwbaarheid van het eindproduct of de ontwikkelsnelheid niet verbetert."
    ],
    "points": 255,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1720758383
  },
  {
    "id": 40943436,
    "title": "Als werknemer ben je vervangbaar (2023)",
    "originLink": "https://nelson.cloud/as-an-employee-you-are-disposable/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40943436",
    "commentBody": "",
    "originSummary": [
      "Recente ontslagen in de technologiesector geven aan dat werknemers vaak als wegwerpbaar worden beschouwd door leidinggevenden, zelfs in winstgevende bedrijven.",
      "Bedrijven zoals Microsoft blijven werknemers ontslaan en salarisbevriezingen doorvoeren ondanks het overtreffen van de verwachtingen van investeerders en het hebben van hoge inkomsten.",
      "Wealthy executives, zoals Tim Gurner, hebben opmerkingen gemaakt die het idee versterken dat werknemers vervangbaar zijn, ongeacht hun bijdragen of anciënniteit."
    ],
    "commentSummary": [
      "Bedrijven zijn transactionele entiteiten en kunnen werknemers laten gaan wanneer het hen uitkomt, waarbij ze benadrukken dat werknemers niet onmisbaar zijn.",
      "Over-hiring en ontslagen zijn vaak strategieën om de aandeelhouderswaarde te verhogen, wat het belang benadrukt van werknemers die zich richten op hun eigen belangen en eerlijke compensatie zoeken.",
      "Het overwegen van vakbonden en het open-sourcen van code kan voordelig zijn voor ontwikkelaars, en versterkt het idee dat de relatie tussen werkgever en werknemer in wezen een zakelijke overeenkomst is."
    ],
    "points": 238,
    "commentCount": 350,
    "retryCount": 0,
    "time": 1720770076
  },
  {
    "id": 40945076,
    "title": "Windows NT voor Power Macintosh",
    "originLink": "https://github.com/Wack0/maciNTosh",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40945076",
    "commentBody": "",
    "originSummary": [
      "De repository bevat broncode voor ARC-firmware en de bijbehorende loader, gericht op New World Power Macintosh-systemen die de Gossamer-architectuur gebruiken, waaronder modellen zoals iMac G3 en Power Macintosh G3.",
      "De ARC-firmware ondersteunt verschillende drivere, maar kun NT4 is momenteel compatibel, met mogelijke toekomstige ondersteuning voor NT 3.51.",
      "Installatie omvat het downloaden van binaries, het partitioneren van de schijf en het volgen van prompts om NT4 in te stellen, met bekende problemen zoals instabiliteit en specifieke stappen die nodig zijn voor dual-booten met Mac-partities."
    ],
    "commentSummary": [
      "Een ontwikkelaar heeft Windows NT overgezet om te draaien op Power Macintosh, wat nostalgie en discussies over alternatieve OS-geschiedenissen oproept.",
      "Windows NT was ontworpen om draagbaar te zijn en ondersteunde verschillende architecturen zoals PowerPC, MIPS en Alpha, hoewel het voornamelijk bekend stond om x86.",
      "Dit project benadrukt de technische haalbaarheid van het aanpassen van NT aan verschillende hardwareplatforms, waarbij de modulariteit van het ontwerp wordt getoond."
    ],
    "points": 209,
    "commentCount": 110,
    "retryCount": 0,
    "time": 1720788718
  },
  {
    "id": 40939703,
    "title": "Gen-stilleggende verktøy viser lovende resultater som en fremtidig terapi mot prionsykdommer",
    "originLink": "https://news.mit.edu/2024/charmed-collaboration-creates-therapy-candidate-fatal-prion-diseases-0627",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40939703",
    "commentBody": "",
    "originSummary": [
      "CHARM (Coupled Histone tail for Autoinhibition Release of Methyltransferase) is een nieuw gen-stillegingsinstrument ontwikkeld door het Broad Institute en Whitehead Institute, dat potentieel toont voor de behandeling van prionziekten en andere neurodegeneratieve aandoeningen.",
      "Deze tool gebruikt epigenetische bewerking om ziekteveroorzakende genen, waaronder het prion-eiwitgen, het zwijgen op te leggen zonder het onderliggende DNA te veranderen, wat mogelijk een eenmalige behandeling biedt.",
      "Het onderzoeksteam, onder leiding van Sonia Vallabh en Jonathan Weissman, heeft aanzienlijke vooruitgang geboekt, een compact, effectief en laag-toxisch gendempingsmiddel gecreëerd en is nu CHARM aan het verfijnen voor klinische proeven."
    ],
    "commentSummary": [
      "Een gen-stilleggend hulpmiddel, geleverd via Adeno-Associated Virus (AAV), toont potentieel als een therapie voor prionziekten, die momenteel 100% dodelijk en resistent tegen vernietiging zijn.",
      "Deze tool werkt door het prioneiwitgen te dempen, wat mogelijk de ziekte kan voorkomen of omkeren, en zou effectief kunnen zijn tegen zowel genetische als verworven prionen.",
      "Hoewel veelbelovend, worden de langetermijneffecten van het hulpmiddel op geheugen en cognitie nog steeds onderzocht, met lopend onderzoek dat toepassingen voor andere prionachtige ziekten zoals Alzheimer en Parkinson verkent."
    ],
    "points": 204,
    "commentCount": 63,
    "retryCount": 0,
    "time": 1720725668
  },
  {
    "id": 40946033,
    "title": "Tau: Open-source PaaS – Een zelf-gehost Vercel / Netlify / Cloudflare alternatief",
    "originLink": "https://github.com/taubyte/tau",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40946033",
    "commentBody": "",
    "originSummary": [
      "Tau is een nieuw framework ontworpen voor het bouwen van onderhoudsarme, zeer schaalbare cloud computing platforms, en dient als een alternatief voor diensten zoals Vercel, Netlify en AWS.",
      "Belangrijke kenmerken zijn onder andere minimale configuratie, Git-native infrastructuurwijzigingen, peer-to-peer netwerken en ondersteuning voor WebAssembly, met toekomstige plannen voor containers en VM's.",
      "Tau streeft ernaar de infrastructuurkosten en ontwikkeltijd te verminderen, en biedt een ontwikkelaarsvriendelijk platform met tools voor lokale ontwikkeling en end-to-end testen."
    ],
    "commentSummary": [
      "Tau is een open-source, zelf-gehost Platform as a Service (PaaS) alternatief voor Vercel, Netlify en Cloudflare, waarbij libp2p wordt gebruikt voor netwerkautodiscovery en IPFS voor gedistribueerde opslag.",
      "Het is WebAssembly-native, wat voordelen biedt zoals het vermijden van vendor lock-in, maar gebruikers hebben opgemerkt dat de documentatie vaag is en het concept onduidelijk.",
      "Vergelijkingen met Kubernetes en andere PaaS-oplossingen zoals Coolify en CapRover zijn gebruikelijk, wat wijst op het potentieel van het project, maar benadrukt de noodzaak van betere documentatie en duidelijkere communicatie van de functies en voordelen."
    ],
    "points": 178,
    "commentCount": 58,
    "retryCount": 0,
    "time": 1720795282
  },
  {
    "id": 40939707,
    "title": "Karpathy: Laten we GPT-2 (1.6B) reproduceren: één 8XH100 node 24h $672 in llm.c",
    "originLink": "https://github.com/karpathy/llm.c/discussions/677",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40939707",
    "commentBody": "",
    "originSummary": [
      "Onderzoekers hebben GPT-2 (1.6B) gereproduceerd met behulp van llm.c, een C/CUDA-implementatie, op een enkele 8XH100-node in 24 uur voor $672, waarbij ze typische Python-gebaseerde deep learning-stacks zoals PyTorch omzeilen.",
      "Ondanks enkele afstemmings- en stabiliteitsproblemen is de prestatie van het model vergelijkbaar met GPT-2, beoordeeld aan de hand van metrics zoals validatieverlies en HellaSwag-nauwkeurigheid.",
      "De post behandelt ook geheugenbeheer, training met meerdere knooppunten, en vergelijkt de implementatie met een PyTorch-versie, met toekomstige plannen om hyperparameters te optimaliseren en de trainingsstabiliteit te verbeteren."
    ],
    "commentSummary": [
      "Andrej Karpathy heeft met succes GPT-2 (1,6 miljard parameters) gereproduceerd op een enkele 8XH100-node in 24 uur voor een kostprijs van $672.",
      "AI-hardware-vooruitgangen kunnen mogelijk de kosten verlagen en de trainingstijden in de toekomst verkorten.",
      "Hoewel AI in videogames veelbelovend is voor het verbeteren van NPC's en storytelling, kampt de huidige technologie nog steeds met aanzienlijke beperkingen, vooral bij het genereren van tekst voor narratieven en dialogen."
    ],
    "points": 177,
    "commentCount": 53,
    "retryCount": 0,
    "time": 1720725707
  },
  {
    "id": 40942141,
    "title": "Floppy8 – Een kleine computer, in een floppy drive (2023)",
    "originLink": "https://abe.today/blogs/main/floppy8-a-tiny-computer-in-a-floppy-drive",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40942141",
    "commentBody": "",
    "originSummary": [
      "De Floppy8 is een microcomputer en cartridgesysteem ingebouwd in een floppy drive, in staat om 4K-films en -games af te spelen met draadloze controllers en gemotoriseerde cartridge-uitwerping.",
      "Het project omvatte het hergebruiken van een Amiga 1010 diskdrive, het ontwerpen van een nieuw mediaformaat en uitgebreid 3D-printen en elektrotechniek om alle componenten in de drive te passen.",
      "De maker brukte en Latte Panda 3 Delta-datamaskin og spesiallagde 3D-printede kassetter, og overvant utfordringer med størrelsesbegrensninger, utkastmekanismer og LED-kontroll for å fullføre prosjektet."
    ],
    "commentSummary": [
      "Floppy8 is een kleine computer ingebouwd in een 3,5\" diskettestation, die doet denken aan eerdere compacte computerprojecten zoals de Amiga 1200-kloon en Ross SPARCPlug.",
      "De maker, abeisgreat, deelde een video waarin het project werd beschreven, inclusief op SD-kaart gebaseerde cartridges en andere technische aspecten, wat interesse en bewondering wekte in de techgemeenschap.",
      "Discussies benadrukken de nostalgie en innovatie bij het passen van computers in kleine formaten, met verwijzingen naar historische pogingen en moderne doe-het-zelfprojecten."
    ],
    "points": 159,
    "commentCount": 36,
    "retryCount": 0,
    "time": 1720748705
  },
  {
    "id": 40941853,
    "title": "AuraFlow v0.1: een open source alternatief voor Stable Diffusion 3",
    "originLink": "https://blog.fal.ai/auraflow/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40941853",
    "commentBody": "",
    "originSummary": [
      "AuraFlow v0.1 is een open-source, flow-based tekst-naar-beeld generatie model, dat de veerkracht van de open-source AI-gemeenschap aantoont.",
      "Het model blinkt uit in het genereren van gedetailleerde afbeeldingen op basis van tekstbeschrijvingen en maakt gebruik van geavanceerde technieken zoals zero-shot leeroverdracht en hercaptionering.",
      "Met 6,8 miljard parameters werd AuraFlow gedurende vier weken getraind, waarbij hoge GenEval-scores werden behaald, en toekomstige plannen omvatten verdere training en het ontwikkelen van efficiënte modellen voor consument-GPU's."
    ],
    "commentSummary": [
      "AuraFlow v0.1 is een open-source alternatief voor Stable Diffusion 3, en toont belofte ondanks dat het een vroege release is.",
      "Het model presteert goed bij eenvoudige prompts, maar heeft moeite met complexe prompts en ontkenningen, wat wijst op verbeterpunten.",
      "Discussies benadrukken de beperkingen van het model bij het genereren van realistische menselijke lichamen en het omgaan met genuanceerde tekstprompts, wat de voortdurende uitdagingen in AI-beeldgeneratie weerspiegelt."
    ],
    "points": 137,
    "commentCount": 31,
    "retryCount": 0,
    "time": 1720744963
  },
  {
    "id": 40940241,
    "title": "De L1-cache verslaan met waardespeculatie (2021)",
    "originLink": "https://mazzo.li/posts/value-speculation.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40940241",
    "commentBody": "",
    "originSummary": [
      "De post bespreekt het gebruik van waardespeculatie om de CPU-prestaties te verbeteren door de vertakkingsvoorspeller te gebruiken om waarden te raden en gegevensafhankelijkheden in strakke lussen te verminderen.",
      "Door å spekulere på adressen til den neste noden i en lenket liste-summeringsfunksjon, har teknikken som mål å omgå L1-cacheleseforsinkelser, noe som resulterer i betydelige ytelsesforbedringer.",
      "Ondanks dat kompilatorer ofte optimaliserer bort dette trikset, sikrer bruk av inline assembly at spekulasjonen forblir, noe som fører til en økning i funksjonshastigheten på 50-200% når data passer innenfor CPU-cacher."
    ],
    "commentSummary": [
      "Het artikel 'Beating the L1 cache with value speculation' (2021) door mazzo.li onderzoekt het optimaliseren van geheugenindeling in gekoppelde lijsten door middel van waardespeculatie, waarbij de nadruk ligt op het belang van lineaire geheugenindeling van knooppunten.",
      "Commentatoren debatteren over de praktische bruikbaarheid en effectiviteit van deze methode, waarbij sommigen de slimheid ervan waarderen maar de brede toepasbaarheid in twijfel trekken.",
      "Discussies behandelen ook gerelateerde technische details zoals instructie-uitvoering, geheugenmodellen, potentiële gebruiksscenario's en de mogelijkheid dat compilers dergelijke optimalisaties automatiseren."
    ],
    "points": 125,
    "commentCount": 29,
    "retryCount": 0,
    "time": 1720729078
  },
  {
    "id": 40939627,
    "title": "Apple Vision Pro U.S. Sales Are All but Dead, Market Analysts Say",
    "originLink": "https://gizmodo.com/apple-vision-pro-u-s-sales-2000469302",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40939627",
    "commentBody": "",
    "originSummary": [
      "De verkoop van Apple Vision Pro in de VS daalt sterk, met een verwachte daling van 75% tegen eind augustus 2024, aangezien de meeste geïnteresseerde kopers de headset van $3.500 al hebben gekocht.",
      "Het huidige model heeft de 100.000 verkochte eenheden niet bereikt, waardoor Apple zijn verkoopverwachtingen heeft verlaagd en overweegt een goedkoper model, naar verluidt rond de $1.750, voor 2025.",
      "Apple ontwikkelt ook een visionOS-update om de gebruikerservaring te verbeteren, wat kan helpen om de interesse te behouden tot de release van de goedkopere headset."
    ],
    "commentSummary": [
      "Apple Vision Pro U.S.-salget presterer dårlig på grunn av begrenset brukerinteresse og utviklerstøtte.",
      "De hoge prijs van $3500 en begrenset innhold er betydelige hindringer som avskrekker både forbrukere og utviklere.",
      "Analisten suggereren dat Apple mogelijk zijn strategie moet heroverwegen, mogelijk door een meer betaalbare versie te creëren of zijn software-ecosysteem te verbeteren om de aantrekkingskracht te vergroten."
    ],
    "points": 121,
    "commentCount": 209,
    "retryCount": 0,
    "time": 1720725140
  },
  {
    "id": 40946644,
    "title": "Intel verkoopt defecte 13-14e generatie CPU's",
    "originLink": "https://alderongames.com/intel-crashes",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40946644",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Intel verkoopt naar verluidt defecte 13e en 14e generatie CPU's, wat leidt tot crashes, BSOD's (Blue Screen of Death) en andere fouten, waarbij sommige rapporten aangeven dat de problemen na verloop van tijd verergeren.",
      "Betrouwbare bronnen zoals RadGames en Level1Techs hebben deze instabiliteitsproblemen bevestigd, die mogelijk verband houden met Intel's agressieve stroom- en thermisch beheerstrategieën.",
      "Vanwege deze aanhoudende problemen overwegen veel gebruikers over te stappen naar AMD als alternatief."
    ],
    "points": 113,
    "commentCount": 59,
    "retryCount": 0,
    "time": 1720799212
  },
  {
    "id": 40943253,
    "title": "GE Aerospace ontwikkelt en test met succes nieuwe hypersonische dual-mode ramjet",
    "originLink": "https://www.geaerospace.com/news/press-releases/ge-aerospace-successfully-develops-and-tests-new-hypersonic-dual-mode-ramjet",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40943253",
    "commentBody": "",
    "originSummary": [
      "GE Aerospace heeft met succes een nieuwe hypersonische dual-mode ramjet ontwikkeld en getest in minder dan 11 maanden, waarbij een drievoudige toename van de luchtstroom ten opzichte van eerdere technologieën werd aangetoond.",
      "Deze prestatie onderstreept de toewijding van GE Aerospace aan de vooruitgang van hypersonische technologie, waarbij de volgende fase zich richt op verdere tests en technologische demonstraties.",
      "Het project was een gezamenlijke inspanning van GE Aerospace, Innoveering en het onderzoekscentrum van GE Aerospace, wat de snelle vooruitgang en toewijding van het team benadrukt."
    ],
    "commentSummary": [
      "GE Aerospace heeft in samenwerking met Innoveering en hun Onderzoekscentrum in minder dan 11 maanden een nieuwe hypersonische dual-mode ramjet ontwikkeld en getest.",
      "De technologie, waarschijnlijk gebaseerd op een bestaand ontwerp, is bedoeld voor raketten of hogesnelheidsvliegtuigen, niet voor commerciële luchtvaart, vanwege de extreme snelheden en omstandigheden.",
      "Dit project benadrukt belangrijke vooruitgangen in hypersonische voortstuwing, die van vitaal belang zijn voor militaire toepassingen."
    ],
    "points": 113,
    "commentCount": 116,
    "retryCount": 0,
    "time": 1720767259
  }
]
