[
  {
    "id": 38627652,
    "title": "구글이 데이터 복구 서비스를 제공하지 못함: 임박한 데이터 파괴에 분노한 사용자",
    "originLink": "https://www.techdirt.com/2023/12/12/google-promises-unlimited-cloud-storage-then-cancels-plan-then-tells-journalist-his-lifes-work-will-be-deleted-without-enough-time-to-transfer-the-data/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38627652",
    "commentBody": "",
    "originSummary": [
      "구글은 사용자에게 데이터 삭제에 대해 알리기 전에 데이터 복구 서비스를 제공하지 않아 익명의 사용자가 실망했습니다.",
      "이러한 서비스가 없다는 것은 사용자에게 우스꽝스러운 일로 여겨집니다."
    ],
    "commentSummary": [
      "사용자들은 Google 스토리지 서비스의 데이터 해지 및 삭제에 대해 불만을 가지고 있습니다.",
      "커뮤니케이션의 명확성 및 '무제한' 저장 용량 요금제의 한계에 대한 우려가 있습니다.",
      "대체 저장소 옵션이 언급되고 Google의 관행에 대한 비판이 이어집니다."
    ],
    "points": 914,
    "commentCount": 600,
    "retryCount": 0,
    "time": 1702476950
  },
  {
    "id": 38632492,
    "title": "SMERF로 가능해진 NeRF 모델의 실시간 탐색",
    "originLink": "https://smerf-3d.github.io/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38632492",
    "commentBody": "",
    "originSummary": [
      "SMERF는 웹 브라우저에서 직접 NeRF 모델을 실시간으로 탐색할 수 있는 새로운 기술입니다.",
      "이 방식은 뛰어난 정확도를 제공하며 오프라인 모델과 거의 동일한 장면을 생성합니다.",
      "사용자는 공식 웹사이트에서 프로젝트를 체험하고 이메일이나 트위터를 통해 피드백을 공유할 수 있습니다."
    ],
    "commentSummary": [
      "Google은 다양한 기기에서 3D 모델을 탐색할 수 있는 실시간 렌더링 기술인 SMERF를 개발했습니다.",
      "데모에 대한 피드백은 긍정적이었지만 이동 및 VR 모드에서 개선이 필요합니다.",
      "긴 로딩 시간과 큰 페이로드 크기에 대한 우려와 함께 개선에 대한 제안이 있습니다."
    ],
    "points": 522,
    "commentCount": 121,
    "retryCount": 0,
    "time": 1702494193
  },
  {
    "id": 38628635,
    "title": "폴란드 화이트햇 해커, DRM에 감염된 열차를 복구한 후 열차 제조업체로부터 협박당해",
    "originLink": "https://www.404media.co/polish-hackers-repaired-trains-the-manufacturer-artificially-bricked-now-the-train-company-is-threatening-them/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38628635",
    "commentBody": "",
    "originSummary": [
      "폴란드의 화이트햇 해커들은 독립 유지보수 회사가 제조업체에 의해 작동 불능 상태가 된 열차의 기능을 복구하는 데 도움을 주었습니다.",
      "수리 방지 메커니즘을 우회한 것에 불만을 품은 제조업체는 해커를 상대로 법적 조치를 취하겠다고 위협하고 있습니다.",
      "이 사건은 독립적인 수리 전문가의 권리와 제조업체의 제품 통제권과 소비자의 수리 능력 사이의 지속적인 투쟁에 대한 논쟁을 촉발시켰습니다. 현재 유럽 저작권법에 따라 해커들의 행위가 합법적인지 여부는 불확실합니다."
    ],
    "commentSummary": [
      "이 문서에서는 해커, DRM, 열차 제조업체, GPS 스푸핑과 관련된 다양한 시나리오를 살펴봅니다.",
      "해킹을 둘러싼 윤리적 논쟁, 수리권 운동, EU에서 리버스 엔지니어링의 법적 의미에 대해 자세히 설명합니다.",
      "열차 시스템과 관련된 안전 문제와 잠재적 범죄 혐의에 대해서도 논의하고, GPS 스푸핑과 그 잠재적 응용에 대해서도 살펴봅니다."
    ],
    "points": 437,
    "commentCount": 128,
    "retryCount": 0,
    "time": 1702480857
  },
  {
    "id": 38628184,
    "title": "머신 러닝 성능에서 MLX를 탑재한 Apple M1 Pro를 능가하는 Nvidia RTX 4090",
    "originLink": "https://owehrens.com/whisper-nvidia-rtx-4090-vs-m1pro-with-mlx/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38628184",
    "commentBody": "",
    "originSummary": [
      "필자는 Whisper 벤치마킹 툴을 사용하여 애플 실리콘에서 머신러닝을 위한 애플의 MLX 프레임워크와 엔비디아의 RTX 4090을 비교하는 성능 테스트를 수행했습니다.",
      "벤치마크 결과에 따르면 Nvidia 4090은 MLX 프레임워크보다 16% 더 빠른 것으로 나타났습니다.",
      "하지만 엔비디아에 최적화된 모델을 사용했을 때는 8초 만에 트랜스크립트가 생성되어 최적화의 이점을 입증했습니다.",
      "저자는 M2 Ultra와 M3 Max에서 실시한 테스트에서도 M1 Pro와 비슷한 속도를 보였다고 언급했습니다.",
      "저자는 측정 결과가 부정확할 수 있다는 점을 인정하면서도 MLX 프레임워크가 노트북에 적합한 성능을 발휘한다고 강조했습니다.",
      "테스트의 목적은 저자의 팟캐스트 검색 엔진 프로젝트를 위한 것이었습니다."
    ],
    "commentSummary": [
      "이 문서에서는 머신 러닝 작업을 위해 OpenAI Whisper 리포지토리를 사용하는 MLX와 Nvidia RTX 4090 및 Apple M1 Pro의 성능을 비교합니다.",
      "이 토론에서는 머신 러닝 하드웨어에 대한 엔비디아, AMD, 인텔, 애플의 최적화 노력을 살펴봅니다.",
      "엔비디아 GPU가 애플의 M1 칩에 비해 머신 러닝에 더 나은 성능을 제공하는 경향이 있지만, 다른 요소와 최적화를 고려해야 한다는 것이 중론입니다."
    ],
    "points": 333,
    "commentCount": 144,
    "retryCount": 0,
    "time": 1702479156
  },
  {
    "id": 38629355,
    "title": "빈곤 극복하기: 회복력과 옹호를 위한 개인적인 여정",
    "originLink": "https://cookingonabootstrap.com/2020/07/30/the-price-of-potatoes-and-the-value-of-compassion/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38629355",
    "commentBody": "",
    "originSummary": [
      "저자는 주택, 재정 문제, 긴장된 가족 관계 등 빈곤에 대한 개인적인 경험을 공유합니다.",
      "이들은 빈곤에 대한 무감각을 비판하며 특히 안눈지아타 리스-모그를 언급합니다.",
      "저자는 가난에서 벗어나기까지의 여정, 빈곤층 가정을 위한 활동, 책 인세를 받지 못한 것에 대한 분노를 회고합니다. 이들은 자신의 경험을 바탕으로 다른 사람들을 옹호하고 연민의 중요성을 강조하고자 합니다."
    ],
    "commentSummary": [
      "기사와 토론은 빈곤, 부의 불평등, 재능, 유전, 교육, 사회적 요인과 관련된 다양한 주제를 다룹니다.",
      "부의 격차, 자본주의, 비즈니스 관행의 역할에 대한 논의와 함께 발전과 성공을 가로막는 주요 장애물인 빈곤 해결의 중요성이 강조됩니다.",
      "또한 빈곤과 운동 능력, 지능, 영재 교육 프로그램, 지역사회 지원, 낙인, 개인적 주도권, 사회적 요인, 산업에서의 착취, 편부모가 겪는 어려움, 서구 문화권에서의 지역사회 지원 부족, 빈곤과 행운의 관계, 개인적 책임, 빈곤층 개인이 직면한 문제 등 다양한 주제에 대해 논의합니다. 소통에 있어 이해와 연민, 강인한 사랑의 필요성이 강조됩니다."
    ],
    "points": 323,
    "commentCount": 259,
    "retryCount": 0,
    "time": 1702483426
  },
  {
    "id": 38629630,
    "title": "모질라, 라마파일 출시: 이미지 요약용 오픈소스 언어 모델",
    "originLink": "https://justine.lol/oneliners/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38629630",
    "commentBody": "",
    "originSummary": [
      "Mozilla는 사용자 컴퓨터에서 다운로드하여 실행할 수 있는 온디바이스 언어 모델인 llamafile이라는 오픈 소스 프로젝트를 시작했습니다.",
      "사용자는 멀티모달 비전 모델을 위한 명령줄 인터페이스가 포함된 사전 빌드된 llamafile 파일을 다운로드하여 모델을 실행할 수 있습니다.",
      "이 블로그 게시물에서는 이미지 요약에 llamafile 프로그램을 사용하는 방법에 대한 지침을 제공합니다."
    ],
    "commentSummary": [
      "이 논의는 명령줄 인터페이스(CLI) 및 기타 AI 관련 도구에서 대규모 언어 모델(LLM)을 사용하는 것을 중심으로 이루어집니다.",
      "사용자들은 LLM, Docker 및 다양한 컨테이너 런타임 사용에 대한 경험, 도전 과제, 팁을 공유합니다.",
      "하이엔드 컴퓨터의 비용과 성능, 다양한 하드웨어에서 LLM을 실행할 때의 한계와 요구 사항, 특정 도구와 기술에 대한 회의론이나 혼란 등을 주제로 다룹니다."
    ],
    "points": 321,
    "commentCount": 94,
    "retryCount": 0,
    "time": 1702484592
  },
  {
    "id": 38629763,
    "title": "도전적인 기업 광고: 공공 공간에서 예술과 자연을 홍보하는 광고 없는 도시",
    "originLink": "https://adfreecities.org.uk/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38629763",
    "commentBody": "",
    "originSummary": [
      "애드프리 시티는 기업 옥외 광고에 도전하고 예술, 커뮤니티, 자연을 위한 공공 공간의 사용을 촉진하기 위해 노력하는 단체들의 네트워크입니다.",
      "이들은 광고가 환경과 사람들의 복지에 부정적인 영향을 미친다고 생각합니다.",
      "이 단체는 광고 없는 도시를 만드는 데 도움이 되는 뉴스, 인사이트, 개인이 지역사회에 참여할 수 있는 기회를 제공합니다."
    ],
    "commentSummary": [
      "다양한 도시에서 광고, 특히 광고판의 존재와 영향력에 대한 논의가 이루어지고 있습니다.",
      "참가자들은 광고의 미적, 안전, 효과 및 규제에 관한 경험, 의견 및 우려 사항을 공유합니다.",
      "토론 주제는 광고가 소비자 행동에 미치는 영향, 접근의 형평성, 탄소 영향, 공공 예술과 같은 잠재적 대안 등 다양합니다."
    ],
    "points": 305,
    "commentCount": 250,
    "retryCount": 0,
    "time": 1702485113
  },
  {
    "id": 38629963,
    "title": "Dropbox 사용자 경고: 타사 AI 액세스 비활성화",
    "originLink": "https://twitter.com/Werner/status/1734890651378975007",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38629963",
    "commentBody": "",
    "originSummary": [
      "Amazon의 최고기술책임자(CTO)인 베르너 보겔스가 트위터를 통해 Dropbox 사용자에게 영향을 미치는 개인정보 보호 문제에 대해 언급했습니다.",
      "보겔스는 타사 AI 기술 파트너는 기본적으로 Dropbox 사용자 파일에 액세스할 수 있다고 설명했습니다.",
      "그는 사용자에게 계정 설정에서 이 설정을 비활성화하라고 조언하고 트윗에 유럽 데이터 보호 감독관을 태그했습니다."
    ],
    "commentSummary": [
      "Dropbox 사용자들은 명시적인 동의 없이 사용자 파일을 스캔하고 액세스하는 회사의 새로운 AI 기능에 대해 우려와 불만을 제기하고 있습니다.",
      "지역 제한 및 개인정보 보호 설정의 가용성과 관련하여 여러 추측이 제기되고 있습니다.",
      "사용자들은 데이터에 대한 투명성과 통제력 부족에 대한 우려로 인해 더 강력한 데이터 보안과 암호화를 갖춘 대체 옵션을 모색하고 있습니다."
    ],
    "points": 303,
    "commentCount": 154,
    "retryCount": 0,
    "time": 1702485850
  },
  {
    "id": 38625380,
    "title": "테슬라의 완전 자율 주행(FSD) 타임라인: 소비자 FSD 및 트위터 업데이트 달성하기",
    "originLink": "https://motherfrunker.ca/fsd/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38625380",
    "commentBody": "",
    "originSummary": [
      "이 요약본에서는 Tesla의 완전자율주행(FSD) 기술에 대해 설명하고 개발 일정에 대해 언급합니다.",
      "저자는 테슬라가 최초의 일반 또는 소비자 FSD를 달성할 것이라는 믿음을 표명합니다.",
      "이 요약에는 해당 주제에 대한 업데이트를 받아볼 수 있는 트위터 핸들이 제공됩니다."
    ],
    "commentSummary": [
      "테슬라의 완전자율주행(FSD) 패키지는 속도 제한을 인식하지 못하거나 광고된 기능의 부족 등 한계와 실패로 인해 조사를 받고 있습니다.",
      "사용자들은 수년간 소유한 후 불만을 품고 집단 소송 가능성을 논의하고 있으며, Tesla 주식에 투자한 FSD 패키지 비용을 기준으로 환불을 요구하고 있습니다.",
      "이 밖에도 테슬라 소유에 대한 어려움과 불만, 엔지니어링 및 테스트의 편견, 일론 머스크에 대한 비판, 국가 간 속도 제한 표지판 표준의 차이 등에 대한 논의가 이루어지고 있습니다."
    ],
    "points": 300,
    "commentCount": 343,
    "retryCount": 0,
    "time": 1702463884
  },
  {
    "id": 38635695,
    "title": "아고라: Shopify 제품을 위한 강력한 검색 엔진",
    "originLink": "https://www.searchagora.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38635695",
    "commentBody": "",
    "originSummary": [
      "아고라 검색 엔진은 수천 개의 Shopify 스토어를 크롤링하여 크리스마스 선물을 쉽게 찾을 수 있도록 설계되었습니다.",
      "제품 저장, 필터, 리뷰, 인기 상품 등 다양한 기능을 제공합니다.",
      "이 크리에이터는 다른 전자상거래 플랫폼으로 확장하는 것을 목표로 하고 있지만, 현재 대규모 데이터 집합으로 인해 검색 속도와 성능을 유지하는 데 어려움을 겪고 있습니다."
    ],
    "commentSummary": [
      "이 토론에서는 검색 엔진, 가격 추적 웹사이트, 데이터 스크래핑, Shopify 스토어 소유자가 직면한 문제 등 전자상거래의 다양한 측면에 대해 다룹니다.",
      "검색 기능 개선, 서버 비용 관리, 사용자 확보, 스토어 큐레이션에 대한 제안과 경험이 공유됩니다.",
      "데이터 스크래핑과 관련된 윤리적 고려 사항과 콘텐츠 제작자 및 검색 결과에 미치는 영향을 살펴보고, 이커머스 사용자 경험을 개선하기 위한 다양한 플랫폼, 도구 및 전략에 대해 논의합니다."
    ],
    "points": 257,
    "commentCount": 188,
    "retryCount": 0,
    "time": 1702509998
  },
  {
    "id": 38634213,
    "title": "호주, 건강 위험으로 인해 공학 석재 사용 금지",
    "originLink": "https://www.abc.net.au/news/2023-12-13/engineered-stone-ban-discussed-at-ministers-meeting/103224362",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38634213",
    "commentBody": "",
    "originSummary": [
      "호주는 가공 석재 작업과 관련된 폐 질환인 규폐증 사례가 증가함에 따라 가공 석재 사용을 금지한 최초의 국가가 되었습니다.",
      "이 금지 조치는 대부분의 주와 테리토리에서 2024년 7월부터 시행될 예정입니다.",
      "이 결정에 대해 노동조합, 보건 단체, 개인 상해 전문 로펌은 지지를 보냈지만, 엔지니어링 석재 제조업체인 시저스톤은 실망감을 표하며 금지 조치의 근거를 비판했습니다."
    ],
    "commentSummary": [
      "이 토론에서는 엔지니어드 스톤 및 실리카 노출과 관련된 작업자 안전 및 건강 위험에 대해 논의합니다.",
      "호주에서 엔지니어드 스톤의 잠재적 사용 금지와 작업자 안전 및 규정 준수 개선의 필요성을 고려합니다.",
      "연구에 따르면 저실리카 인조석 제품은 염증을 유발할 수 있어, 실리카를 줄이는 것만으로 질병 위험을 없앨 수 있다는 생각에 의문이 제기되고 있습니다."
    ],
    "points": 251,
    "commentCount": 365,
    "retryCount": 0,
    "time": 1702502055
  },
  {
    "id": 38632970,
    "title": "차단 선택 기능이 있는 Go 채널을 구현하는 C 라이브러리",
    "originLink": "https://github.com/rochus-keller/CspChan",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38632970",
    "commentBody": "",
    "originSummary": [
      "이 C 라이브러리는 Hoare가 도입하여 Go 프로그래밍 언어에 의해 대중화된 개념인 채널을 구현합니다.",
      "버퍼링된 채널과 버퍼링되지 않은 채널은 물론 select 문을 모두 지원합니다.",
      "이 라이브러리는 현재 Ptreads와 함께 작동하며 Win32 스레드용으로 개발 중입니다. 사용자는 프로젝트에 포함하거나 공유 라이브러리를 구축할 수 있습니다. 관련 작업 및 지원을 받을 수 있는 곳에 대한 정보와 함께 사용법을 보여주기 위한 예제가 제공됩니다."
    ],
    "commentSummary": [
      "이 문서에서는 C89의 Go 채널 구현, bool 및 typedef 사용 등 C 프로그래밍 언어와 관련된 몇 가지 주제에 대해 설명합니다.",
      "또한 서로 다른 C 버전 간의 호환성, 동시 프로그래밍에서 채널과 상위 수준 추상화의 적합성, C 언어의 복잡성과 생산성에 대해서도 살펴봅니다.",
      "대화는 대체 도구 및 구현 옵션에 대한 권장 사항으로 마무리됩니다."
    ],
    "points": 237,
    "commentCount": 118,
    "retryCount": 0,
    "time": 1702495904
  },
  {
    "id": 38628417,
    "title": "구글 클라우드, 이미지 2: 버텍스 AI의 고급 텍스트-이미지 변환 기술 발표",
    "originLink": "https://cloud.google.com/blog/products/ai-machine-learning/imagen-2-on-vertex-ai-is-now-generally-available",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38628417",
    "commentBody": "",
    "originSummary": [
      "구글 클라우드는 고급 텍스트-이미지 변환 기술인 Imagen 2를 버텍스 AI에서 일반적으로 사용할 수 있도록 했습니다.",
      "Imagen 2를 통해 고객은 사용하기 쉬운 도구, 관리형 인프라, 기본 제공 개인정보 보호 및 안전 조치를 사용하여 이미지 생성을 맞춤화하고 배포할 수 있습니다.",
      "이번 업그레이드는 향상된 이미지 품질과 텍스트 렌더링, 로고 생성, 캡션 및 질문과 답변, 다국어 프롬프트, 안전 예방 조치 등의 기능을 제공합니다. Snap, Shutterstock, Canva와 같은 회사에서는 이미 이미지 API를 활용하여 크리에이티브 워크플로우를 개선하고 있습니다."
    ],
    "commentSummary": [
      "이 대화는 구글의 이미지 2 서비스에 대한 비판과 불만, AI 텍스트-이미지 생성기의 한계와 과제 등 다양한 주제를 중심으로 진행되었습니다.",
      "직장 내 문제, 트위터의 현재 상태, Google의 AI 도구의 투명성과 접근성 부족에 대한 우려, AI 모델과 그 기능을 둘러싼 혼란에 대해서도 논의합니다.",
      "공통적인 주제는 Google 제품 및 서비스에 대한 실망, 사용성 및 문서화에 대한 우려, 개선 및 대안에 대한 요구 등이었습니다."
    ],
    "points": 226,
    "commentCount": 170,
    "retryCount": 0,
    "time": 1702480025
  },
  {
    "id": 38628489,
    "title": "Cortex A57: 닌텐도 스위치를 위한 성능 및 전력 효율성",
    "originLink": "https://chipsandcheese.com/2023/12/12/cortex-a57-nintendo-switchs-cpu/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38628489",
    "commentBody": "",
    "originSummary": [
      "Cortex A57은 휴대용 게임 콘솔의 고성능 GPU 성능을 위해 Nintendo Switch의 Nvidia Tegra X1에 사용된 Arm의 첫 번째 64비트 지원 코어입니다.",
      "적당한 분기 예측기 및 캐싱 시스템, 48개 항목의 명령어 TLB, 통합 레지스터 파일, 분산 스케줄링, 2개의 정수 파이프라인을 갖추고 있습니다.",
      "A57 프로세서는 사이클당 4개의 정수 연산을 처리할 수 있지만 부동 소수점 연산은 지연 시간이 길어집니다. 주소 공간이 제한되어 있으며, 최적화를 통해 통합 그래픽이 탑재된 닌텐도 스위치 및 구형 플랫폼에서 게임 성능을 개선할 수 있습니다."
    ],
    "commentSummary": [
      "이 대화에서는 하드웨어 버그, 디자인 결정, 프로세서 선택 등 Nintendo Switch 콘솔의 여러 측면에 대해 자세히 다룹니다.",
      "비용 절감 방안, 게임 순위, 다른 게임 기기와의 비교 등에 대한 토론도 진행됩니다.",
      "이 대화에서는 자체 제작 기능, PS Vita, 그래픽 기능, 향후 콘솔 개선에 대한 다양한 관점과 의견이 제시되었습니다."
    ],
    "points": 224,
    "commentCount": 97,
    "retryCount": 0,
    "time": 1702480286
  },
  {
    "id": 38629626,
    "title": "기본 프레임 포인터로 성능을 향상시키는 우분투 24.04 LTS",
    "originLink": "https://ubuntu.com/blog/ubuntu-performance-engineering-with-frame-pointers-by-default",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38629626",
    "commentBody": "",
    "originSummary": [
      "캐노니컬은 성능 엔지니어링을 향상시키기 위해 Ubuntu 24.04 LTS에서 프레임 포인터를 기본으로 구현하고 있습니다.",
      "이 변경으로 프로파일링 및 디버깅 프로세스가 간소화되어 더욱 정확한 성능 분석 데이터를 제공할 수 있습니다.",
      "성능에 약간의 영향이 있을 수 있지만, 성능 인사이트에 대한 접근성이 높아지면 이러한 단점을 상쇄할 수 있습니다."
    ],
    "commentSummary": [
      "Ubuntu 24.04 LTS는 특정 플랫폼에서 디버깅 및 성능 향상을 위해 기본적으로 프레임 포인터를 활성화합니다.",
      "성능 향상과 코어 덤프 및 디버깅 문제 사이의 절충점에 대한 논쟁이 있습니다.",
      "x86_64 CPU에서 더 높은 레지스터의 사용과 그것이 성능에 미치는 영향에 대해 설명합니다."
    ],
    "points": 200,
    "commentCount": 99,
    "retryCount": 0,
    "time": 1702484581
  }
]
