[
  {
    "id": 38627652,
    "title": "גוגל לא מצליחה לספק שחזור נתונים: המשתמש זועם על השמדת הנתונים הממשמשת ובאה",
    "originLink": "https://www.techdirt.com/2023/12/12/google-promises-unlimited-cloud-storage-then-cancels-plan-then-tells-journalist-his-lifes-work-will-be-deleted-without-enough-time-to-transfer-the-data/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38627652",
    "commentBody": "",
    "originSummary": [
      "גוגל לא סיפקה שירות שחזור נתונים לפני שהודיעה למשתמשים על מחיקת הנתונים שלהם, מה שהותיר משתמש אנונימי מאוכזב.",
      "היעדר שירות כזה נתפס כמגוחך על ידי המשתמש."
    ],
    "commentSummary": [
      "המשתמשים מתוסכלים מהסיום והמחיקה של נתונים בשירותי האחסון של Google.",
      "ישנם חששות לגבי בהירות התקשורת ומגבלות של תוכניות אחסון \"בלתי מוגבלות\".",
      "מוזכרות אפשרויות אחסון חלופיות, והביקורת מופנית כלפי שיטות העבודה של גוגל."
    ],
    "points": 914,
    "commentCount": 600,
    "retryCount": 0,
    "time": 1702476950
  },
  {
    "id": 38632492,
    "title": "חקר בזמן אמת של דגמי NeRF המתאפשר באמצעות SMERF",
    "originLink": "https://smerf-3d.github.io/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38632492",
    "commentBody": "",
    "originSummary": [
      "SMERF היא טכניקה חדשה המאפשרת חקירה בזמן אמת של מודלי NeRF ישירות בדפדפני אינטרנט.",
      "השיטה מספקת דיוק יוצא דופן ומייצרת סצנות כמעט זהות למודלים לא מקוונים.",
      "משתמשים יכולים לחוות את הפרויקט באתר הרשמי ולשתף את המשוב שלהם באמצעות דוא\"ל או טוויטר."
    ],
    "commentSummary": [
      "גוגל יצרה את SMERF, טכנולוגיית עיבוד בזמן אמת לחקר מודלים תלת-ממדיים במכשירים שונים.",
      "המשוב על ההדגמות היה חיובי, אך נדרשים שיפורים בתנועה ובמצב VR.",
      "יש חששות לגבי זמני טעינה ארוכים וגדלי מטען גדולים, עם הצעות לשיפור."
    ],
    "points": 522,
    "commentCount": 121,
    "retryCount": 0,
    "time": 1702494193
  },
  {
    "id": 38628635,
    "title": "האקרים פולנים בעלי כובע לבן מאוימים על ידי יצרן רכבות לאחר ששיקמו רכבות שהושפעו מ-DRM",
    "originLink": "https://www.404media.co/polish-hackers-repaired-trains-the-manufacturer-artificially-bricked-now-the-train-company-is-threatening-them/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38628635",
    "commentBody": "",
    "originSummary": [
      "האקרים בעלי כובע לבן בפולין סייעו בהצלחה לחברת תחזוקה עצמאית להחזיר את הפונקציונליות לרכבת שיצאה מכלל שימוש על ידי היצרן שלה.",
      "היצרן, שאינו מרוצה מעקיפת מנגנון האנטי-תיקון שלו, מאיים בצעדים משפטיים נגד ההאקרים.",
      "מקרה זה עורר דיון על זכויותיהם של אנשי מקצוע עצמאיים בתחום התיקונים והמאבק המתמשך בין שליטת היצרנים במוצריהם לבין יכולתם של הצרכנים לתקן אותם. חוקיות פעולותיהם של ההאקרים אינה ודאית כיום על פי חוקי זכויות היוצרים האירופיים."
    ],
    "commentSummary": [
      "המאמר בוחן תרחישים שונים הכוללים האקרים, DRM, יצרני רכבות וזיוף GPS.",
      "הוא מתעמק בדיונים אתיים סביב פריצה, תנועת הזכות לתיקון וההשלכות המשפטיות של הנדסה לאחור באיחוד האירופי.",
      "חששות בטיחות ואישומים פליליים פוטנציאליים הקשורים למערכות רכבת נדונים גם כן, יחד עם חקירת זיוף GPS ויישומיו הפוטנציאליים."
    ],
    "points": 437,
    "commentCount": 128,
    "retryCount": 0,
    "time": 1702480857
  },
  {
    "id": 38628184,
    "title": "Nvidia RTX 4090 עולה בביצועיו על Apple M1 Pro עם MLX בביצועי למידת מכונה",
    "originLink": "https://owehrens.com/whisper-nvidia-rtx-4090-vs-m1pro-with-mlx/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38628184",
    "commentBody": "",
    "originSummary": [
      "המחבר ערך בדיקות ביצועים שהשוו את מסגרת MLX של אפל ללמידת מכונה ב-Apple Silicon עם RTX 4090 של Nvidia באמצעות כלי השוואת הביצועים Whisper.",
      "תוצאות הבנצ'מרק הראו כי Nvidia 4090 היה מהיר יותר ב-16% ממסגרת MLX.",
      "עם זאת, בעת שימוש במודל אופטימיזציה של Nvidia, התמליל נוצר תוך 8 שניות בלבד, מה שמדגים את היתרון של אופטימיזציה.",
      "המחבר הזכיר גם בדיקות שנערכו על M2 Ultra ו- M3 Max, שהראו מהירויות דומות ל- M1 Pro.",
      "המחבר הכיר בחוסר הדיוק הפוטנציאלי של המדידות אך הדגיש כי מסגרת MLX תפקדה היטב עבור מחשב נייד.",
      "מטרת הבדיקות הייתה עבור פרויקט מנוע החיפוש של הפודקאסט של המחבר."
    ],
    "commentSummary": [
      "המאמר משווה את הביצועים של Nvidia RTX 4090 ו- Apple M1 Pro עם MLX באמצעות הריפו OpenAI Whisper למשימות למידת מכונה.",
      "הדיון בוחן את מאמצי האופטימיזציה של אנבידיה, AMD, אינטל ואפל בחומרת למידת מכונה.",
      "הקונצנזוס הוא שהמעבדים הגרפיים של Nvidia נוטים לספק ביצועים טובים יותר עבור למידת מכונה בהשוואה לשבבי M1 של אפל, אך יש לקחת בחשבון גורמים ואופטימיזציות אחרות."
    ],
    "points": 333,
    "commentCount": 144,
    "retryCount": 0,
    "time": 1702479156
  },
  {
    "id": 38629355,
    "title": "התמודדות עם עוני: מסע אישי של חוסן וסנגור",
    "originLink": "https://cookingonabootstrap.com/2020/07/30/the-price-of-potatoes-and-the-value-of-compassion/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38629355",
    "commentBody": "",
    "originSummary": [
      "המחבר חולק את חוויותיהם האישיות עם עוני, כולל מאבקים עם דיור, כספים ויחסים משפחתיים מתוחים.",
      "הם מבקרים את חוסר הרגישות כלפי עוני, ומזכירים במיוחד את אנונציאטה ריס-מוג.",
      "המחבר משקף את מסעם החוצה מהעוני, את פעילותם למען משפחות עניות ואת כעסם על כך שלא קיבלו תמלוגים על ספרם. הם מקווים להשתמש בחוויותיהם כדי לסנגר על אחרים ולהדגיש את חשיבותה של חמלה."
    ],
    "commentSummary": [
      "המאמר והדיון עוסקים בנושאים שונים הקשורים לעוני, אי שוויון בעושר, כישרון, גנטיקה, חינוך וגורמים חברתיים.",
      "החשיבות של טיפול בעוני כמחסום העיקרי להתקדמות ולהצלחה מודגשת, יחד עם דיונים על פערי עושר, קפיטליזם ותפקידן של פרקטיקות עסקיות.",
      "השיחה בוחנת גם את הקשר בין עוני ליכולת ספורטיבית, אינטליגנציה, תוכניות חינוך לתלמידים מחוננים, תמיכה קהילתית, סטיגמות, יוזמה אישית, גורמים חברתיים, ניצול בתעשיות, קשיים של הורים יחידניים, היעדר תמיכה קהילתית בתרבויות המערב, הקשר בין עוני למזל, אחריות אישית ואתגרים העומדים בפני פרטים בעוני. הצורך בהבנה, חמלה ואהבה קשוחה בתקשורת מודגש."
    ],
    "points": 323,
    "commentCount": 259,
    "retryCount": 0,
    "time": 1702483426
  },
  {
    "id": 38629630,
    "title": "Mozilla משיקה את Llamafile: מודל שפת קוד פתוח לסיכום תמונות",
    "originLink": "https://justine.lol/oneliners/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38629630",
    "commentBody": "",
    "originSummary": [
      "מוזילה השיקה פרויקט קוד פתוח בשם llamafile, מודל שפה במכשיר שניתן להוריד ולהריץ במחשב שלך.",
      "משתמשים יכולים להוריד קבצי llamafile שנבנו מראש כדי להפעיל את המודל, הכולל ממשק שורת פקודה עבור מודל ראייה רב-מודאלי.",
      "רשומת הבלוג מספקת הוראות כיצד להשתמש בתוכנית llamafile לסיכום תמונות."
    ],
    "commentSummary": [
      "הדיונים סובבים סביב השימוש במודלי שפה גדולים (LLM) בממשקי שורת פקודה (CLI) ובכלים אחרים הקשורים לבינה מלאכותית.",
      "משתמשים משתפים את החוויות, האתגרים והעצות שלהם לשימוש ב- LLM, Docker וזמני ריצה שונים של קונטיינרים.",
      "הנושאים כוללים את העלות והביצועים של מחשבים מתקדמים, מגבלות ודרישות של הפעלת LLMs על חומרה שונה, ספקנות או בלבול לגבי כלים וטכנולוגיות ספציפיים."
    ],
    "points": 321,
    "commentCount": 94,
    "retryCount": 0,
    "time": 1702484592
  },
  {
    "id": 38629763,
    "title": "פרסום ארגוני מאתגר: Adfree Cities מקדמת אמנות וטבע במרחב הציבורי",
    "originLink": "https://adfreecities.org.uk/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38629763",
    "commentBody": "",
    "originSummary": [
      "Adfree Cities היא רשת של קבוצות הפועלות לאתגר פרסום חוצות תאגידי ולקדם את השימוש במרחב הציבורי לאמנות, קהילה וטבע.",
      "הם מאמינים כי פרסום יש השפעות שליליות על הסביבה ואת רווחתם של אנשים.",
      "הארגון מציע חדשות, תובנות והזדמנויות לאנשים להיות מעורבים באזורים המקומיים שלהם כדי לעזור ליצור ערים ללא פרסומות."
    ],
    "commentSummary": [
      "הדיונים מתרכזים סביב נוכחותו והשפעתו של פרסום, במיוחד שלטי חוצות, בערים שונות.",
      "המשתתפים חולקים את חוויותיהם, דעותיהם ודאגותיהם לגבי האסתטיקה, הבטיחות, האפקטיביות והרגולציה של הפרסום.",
      "נושאי הדיון כוללים את השפעת הפרסום על התנהגות הצרכנים, שוויון הגישה, השפעת פחמן ואלטרנטיבות פוטנציאליות כמו אמנות ציבורית."
    ],
    "points": 305,
    "commentCount": 250,
    "retryCount": 0,
    "time": 1702485113
  },
  {
    "id": 38629963,
    "title": "משתמשי דרופבוקס הוזהרו: השבת גישת AI של צד שלישי",
    "originLink": "https://twitter.com/Werner/status/1734890651378975007",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38629963",
    "commentBody": "",
    "originSummary": [
      "סמנכ\"ל הטכנולוגיות של אמזון, ורנר ווגלס, צייץ בטוויטר על בעיית פרטיות המשפיעה על משתמשי דרופבוקס.",
      "ווגלס הצהיר כי לשותפי טכנולוגיית AI של צד שלישי יש גישת ברירת מחדל לקבצי משתמש של דרופבוקס.",
      "הוא יעץ למשתמשים להשבית הגדרה זו בהגדרות החשבון שלהם ותייג את המפקח האירופי על הגנת המידע בציוץ."
    ],
    "commentSummary": [
      "משתמשי דרופבוקס מעלים דאגה ותסכול מתכונות הבינה המלאכותית החדשות של החברה, שסורקות וניגשות לקבצי משתמשים ללא הסכמה מפורשת.",
      "ספקולציות עולות לגבי הגבלות אזוריות וזמינות של הגדרות פרטיות.",
      "משתמשים בוחנים אפשרויות חלופיות עם אבטחת נתונים והצפנה חזקות יותר בשל חששות מחוסר שקיפות ושליטה על הנתונים שלהם."
    ],
    "points": 303,
    "commentCount": 154,
    "retryCount": 0,
    "time": 1702485850
  },
  {
    "id": 38625380,
    "title": "ציר הזמן המלא של טסלה לנהיגה עצמית (FSD): השגת עדכוני FSD וטוויטר לצרכנים",
    "originLink": "https://motherfrunker.ca/fsd/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38625380",
    "commentBody": "",
    "originSummary": [
      "הסיכום דן בטכנולוגיית הנהיגה העצמית המלאה (FSD) של טסלה ומזכיר ציר זמן לפיתוחה.",
      "המחבר מביע אמונה כי טסלה תשיג את FSD הכללי או הצרכן הראשון.",
      "הסיכום מספק נקודת אחיזה של טוויטר למעקב לקבלת עדכונים בנושא."
    ],
    "commentSummary": [
      "חבילת הנהיגה העצמית המלאה (FSD) של טסלה נמצאת תחת בדיקה בשל מגבלותיה וכשלותיה, כולל חוסר היכולת לזהות מגבלות מהירות והיעדר תכונות מפורסמות.",
      "המשתמשים מתוסכלים לאחר שנים של בעלות ודנים באפשרות של תביעה ייצוגית ומבקשים החזר על בסיס עלות חבילת ה- FSD שהושקעה במניות טסלה.",
      "קשיים ותלונות אחרות על בעלות על טסלה, הטיות בהנדסה ובדיקות, ביקורת על אילון מאסק וההבדלים בתקני שילוט הגבלת מהירות בין מדינות נמצאים בדיונים."
    ],
    "points": 300,
    "commentCount": 343,
    "retryCount": 0,
    "time": 1702463884
  },
  {
    "id": 38635695,
    "title": "Agora: מנוע חיפוש רב עוצמה למוצרי Shopify",
    "originLink": "https://www.searchagora.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38635695",
    "commentBody": "",
    "originSummary": [
      "מנוע החיפוש Agora נועד להקל על מציאת מתנות חג המולד על ידי סריקת אלפי חנויות Shopify.",
      "הוא מציע תכונות שונות כגון שמירת מוצרים, מסננים, ביקורות ופריטים פופולריים.",
      "היוצר שואף להתרחב לפלטפורמות מסחר אלקטרוני אחרות, אך מתמודד כעת עם אתגרים בשמירה על מהירות החיפוש והביצועים בשל מערך נתונים גדול."
    ],
    "commentSummary": [
      "הדיון נוגע בהיבטים שונים של מסחר אלקטרוני, כולל מנועי חיפוש, אתרי מעקב אחר מחירים, גירוד נתונים ואתגרים העומדים בפני בעלי חנויות Shopify.",
      "הצעות וחוויות משותפות לשיפור פונקציונליות החיפוש, ניהול עלויות שרת, רכישת משתמשים ואוצרות חנויות.",
      "שיקולים אתיים בנוגע לגירוד נתונים והשפעתו על יוצרי תוכן ותוצאות חיפוש נבחנים, יחד עם דיונים על פלטפורמות, כלים ואסטרטגיות שונות לשיפור חוויית המשתמש במסחר אלקטרוני."
    ],
    "points": 257,
    "commentCount": 188,
    "retryCount": 0,
    "time": 1702509998
  },
  {
    "id": 38634213,
    "title": "אוסטרליה אוסרת על אבן מהונדסת בשל סיכונים בריאותיים",
    "originLink": "https://www.abc.net.au/news/2023-12-13/engineered-stone-ban-discussed-at-ministers-meeting/103224362",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38634213",
    "commentBody": "",
    "originSummary": [
      "אוסטרליה הפכה למדינה הראשונה שאוסרת על אבן מהונדסת בשל העלייה במקרי סיליקוזיס, מחלת ריאות הקשורה לעבודה עם החומר.",
      "האיסור ייכנס לתוקף החל מיולי 2024 ברוב המדינות והטריטוריות.",
      "ההחלטה זכתה לתמיכה מאיגודים מקצועיים, ארגוני בריאות ומשרדי עורכי דין לנזקי גוף, ואילו יצרנית האבנים המהונדסות אבן קיסר הביעה אכזבה ומתחה ביקורת על ההיגיון מאחורי האיסור."
    ],
    "commentSummary": [
      "הדיון סובב סביב סיכוני בטיחות ובריאות העובדים הקשורים לחשיפה לאבן מהונדסת ולסיליקה.",
      "האיסור הפוטנציאלי על אבן מהונדסת באוסטרליה נחשב, כמו גם הצורך בשיפורים בבטיחות העובדים ובתאימות.",
      "מחקרים הראו כי מוצרי אבן מהונדסים דלי סיליקה עלולים לגרום לדלקת, מה שמאתגר את הרעיון שהפחתת סיליקה לבדה תבטל את הסיכון למחלות."
    ],
    "points": 251,
    "commentCount": 365,
    "retryCount": 0,
    "time": 1702502055
  },
  {
    "id": 38632970,
    "title": "ספריית C מיישמת ערוצי Go עם בוררי חסימה",
    "originLink": "https://github.com/rochus-keller/CspChan",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38632970",
    "commentBody": "",
    "originSummary": [
      "ספריית C זו מיישמת ערוצים, מושג שהוצג על ידי Hoare והפך פופולרי על ידי שפת התכנות Go.",
      "הוא תומך הן בערוצים חוצצים והן בערוצים לא חוצצים, כמו גם במשפט הנבחר.",
      "הספרייה עובדת כיום עם Ptreads ומפותחת עבור חוטי Win32. משתמשים יכולים לכלול אותו בפרוייקט שלהם או לבנות ספריה משותפת. דוגמה ניתנת כדי להדגים את השימוש בו, יחד עם מידע על עבודה קשורה והיכן לחפש תמיכה."
    ],
    "commentSummary": [
      "המאמר דן במספר נושאים הקשורים לשפת התכנות C, כולל יישום ערוצי Go ב- C89 והשימוש ב- bool ו- typedefs.",
      "הוא גם בוחן את התאימות של גרסאות C שונות, את התאמת הערוצים והפשטות ברמה גבוהה יותר בתכנות מקבילי, ואת המורכבות והפרודוקטיביות של שפת C.",
      "השיחה מסתיימת בהמלצות לכלים חלופיים ואפשרויות יישום."
    ],
    "points": 237,
    "commentCount": 118,
    "retryCount": 0,
    "time": 1702495904
  },
  {
    "id": 38628417,
    "title": "Google Cloud מכריזה על Imagen 2: טכנולוגיית טקסט לתמונה מתקדמת ב-Vertex AI",
    "originLink": "https://cloud.google.com/blog/products/ai-machine-learning/imagen-2-on-vertex-ai-is-now-generally-available",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38628417",
    "commentBody": "",
    "originSummary": [
      "Google Cloud הפך את Imagen 2, טכנולוגיית טקסט לתמונה מתקדמת, לזמינה בדרך כלל ב-Vertex AI.",
      "Imagen 2 מאפשרת ללקוחות להתאים אישית ולפרוס יצירת תמונות באמצעות כלים קלים לשימוש, תשתית מנוהלת ואמצעי פרטיות ובטיחות מובנים.",
      "השדרוג מציע איכות תמונה משופרת ותכונות כמו עיבוד טקסט, יצירת לוגואים, כיתובים ומענה על שאלות, הנחיות מרובות שפות ואמצעי בטיחות. חברות כמו Snap, Shutterstock ו-Canva כבר ממנפות את ה-API של Imagen כדי לשפר את תהליכי העבודה היצירתיים שלהן."
    ],
    "commentSummary": [
      "השיחה סובבת סביב נושאים שונים, כולל ביקורת ותסכול משירות Imagen 2 של גוגל ומהמגבלות והאתגרים של מחוללי טקסט לתמונה AI.",
      "כמו כן, נדונות סוגיות במקום העבודה, מצבה הנוכחי של טוויטר, חששות לגבי חוסר השקיפות והנגישות של גוגל בכלי הבינה המלאכותית שלה, ובלבול סביב מודלים של בינה מלאכותית ויכולותיהם.",
      "נושאים נפוצים כוללים אכזבה מהמוצרים והשירותים של Google, חששות לגבי שימושיות ותיעוד, והרצון לשיפורים ואלטרנטיבות."
    ],
    "points": 226,
    "commentCount": 170,
    "retryCount": 0,
    "time": 1702480025
  },
  {
    "id": 38628489,
    "title": "Cortex A57: ביצועים ויעילות צריכת חשמל עבור Nintendo Switch",
    "originLink": "https://chipsandcheese.com/2023/12/12/cortex-a57-nintendo-switchs-cpu/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38628489",
    "commentBody": "",
    "originSummary": [
      "Cortex A57 היא הליבה הראשונה של Arm בעלת יכולת 64 סיביות, המשמשת ב-Nvidia Tegra X1 של Nintendo Switch לביצועי GPU גבוהים בקונסולת משחקים ניידת.",
      "יש לו מערכת חיזוי ואחסון מטמון צנועה של ענפים, TLB הוראה של 48 כניסות, קובץ רישום מאוחד, תזמון מבוזר ושני צינורות שלמים.",
      "מעבד A57 יכול לטפל בארבע פעולות שלמות בכל מחזור, אך לפעולות נקודה צפה יש השהיה גבוהה. יש לו שטח כתובות מוגבל, ומאמצי אופטימיזציה יכולים לשפר את ביצועי המשחק ב- Nintendo Switch ובפלטפורמות ישנות יותר עם גרפיקה משולבת."
    ],
    "commentSummary": [
      "השיחה מתעמקת בהיבטים רבים של קונסולת Nintendo Switch, כגון באגים בחומרה, החלטות עיצוב ובחירות מעבד.",
      "דיונים על אמצעים לחיסכון בעלויות, דירוגי משחקים והשוואות עם מכשירי משחקים אחרים מוצגים גם כן.",
      "השיחה נוגעת ביכולות homebrew, PS Vita, יכולות גרפיות ושיפורים עתידיים בקונסולות, ומציגה מגוון נקודות מבט ודעות."
    ],
    "points": 224,
    "commentCount": 97,
    "retryCount": 0,
    "time": 1702480286
  },
  {
    "id": 38629626,
    "title": "Ubuntu 24.04 LTS משפר את הביצועים עם מצביעי מסגרת ברירת מחדל",
    "originLink": "https://ubuntu.com/blog/ubuntu-performance-engineering-with-frame-pointers-by-default",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38629626",
    "commentBody": "",
    "originSummary": [
      "קנוניקל מיישמת מצביעי מסגרת כברירת מחדל באובונטו 24.04 LTS כדי לשפר את הנדסת הביצועים.",
      "שינוי זה יפשט תהליכי יצירת פרופילים וניפוי באגים, ויספק נתוני ניתוח ביצועים מדויקים יותר.",
      "למרות שעשויה להיות השפעה מינורית על הביצועים, הנגישות המוגברת לתובנות ביצועים עולה על חיסרון זה."
    ],
    "commentSummary": [
      "Ubuntu 24.04 LTS יאפשר מצביעי מסגרת כברירת מחדל לאיתור באגים וביצועים טובים יותר בפלטפורמות ספציפיות.",
      "יש ויכוח על הפשרה בין שיפורי ביצועים ובעיות עם dumps ליבה וניפוי באגים.",
      "נדון השימוש באוגרים גבוהים יותר על מעבדי x86_64 והשפעתו על הביצועים."
    ],
    "points": 200,
    "commentCount": 99,
    "retryCount": 0,
    "time": 1702484581
  }
]
