[
  {
    "id": 40310896,
    "title": "TCP_NODELAY i moderne distribuerte systemer",
    "originLink": "https://brooker.co.za/blog/2024/05/09/nagle.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40310896",
    "commentBody": "",
    "originSummary": [
      "Marc Brooker, ingeniør hos Amazon Web Services med fokus på databaser og serverløs teknologi, diskuterer TCP_NODELAY-socketalternativet og Nagles algoritme i distribuerte systemer.",
      "Brooker foreslår at TCP_NODELAY bør være standardinnstillingen, og sier at Nagles algoritme kanskje ikke er avgjørende i moderne systemer.",
      "Han utdyper historien bak og konsekvensene av disse nettverksprotokollene."
    ],
    "commentSummary": [
      "Debatten dreier seg om å forbedre nettverksytelsen ved å justere innstillinger som TCP_NODELAY, TCP_QUICKACK og TCP_CORK, med fokus på effekten på latenstiden i nettverksapplikasjoner.",
      "Deltakerne utveksler erfaringer og innsikt om optimalisering av nettverksprotokoller som TCP og UDP for bedre ytelse, og understreker betydningen av effektiv protokollutnyttelse og kodeoptimalisering i datasenterscenarier.",
      "Det gis anbefalinger om hvordan innstillingene kan justeres for å øke effektiviteten i dataoverføringen og unngå nettverksrelaterte utfordringer."
    ],
    "points": 663,
    "commentCount": 215,
    "retryCount": 0,
    "time": 1715277289
  },
  {
    "id": 40307138,
    "title": "Verdens første genterapiforsøk gjenoppretter hørselen hos et døvt barn",
    "originLink": "https://www.independent.co.uk/news/health/deaf-cure-girl-gene-therapy-b2541735.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40307138",
    "commentBody": "",
    "originSummary": [
      "Et banebrytende genterapiforsøk i Storbritannia har gitt en 18 måneder gammel døv jente, Opal Sandy, hørselen tilbake på grunn av hørselsnevropati, noe som er første gang i verden.",
      "Den innovative engangsbehandlingen med genterapi ved Addenbrooke's Hospital forbedret hørselen til Opal betydelig, noe som potensielt kan bane vei for en kur for personer med lignende døvhet.",
      "Metoden går ut på å introdusere en funksjonell genkopi i øret, noe som muliggjør kommunikasjon mellom ørecellene og hørselsnerven, og i Opals tilfelle ble det rapportert om raske og merkbare forbedringer."
    ],
    "commentSummary": [
      "Et genterapiforsøk har gitt en døv jente hørselen tilbake, noe som gir håp for fremtidig behandling av genetisk betinget hørselstap.",
      "Pasienter deler erfaringer med operasjoner, høreapparater, cochleaimplantater og nevrale implantater, noe som skaper debatt om den kontroversielle bruken av implantater i døvemiljøet.",
      "Diskusjonene dreier seg om medisinske fremskritt, genredigering, samfunnets holdninger til funksjonshemninger, etikk knyttet til å kurere døvhet, reproduktiv frihet, genmanipulering og samfunnsmessige konsekvenser av genteknologiske fremskritt."
    ],
    "points": 621,
    "commentCount": 284,
    "retryCount": 0,
    "time": 1715254694
  },
  {
    "id": 40307519,
    "title": "Kartlegging av hackernyhetsdata: Sentimentanalyse og trender",
    "originLink": "https://blog.wilsonl.in/hackerverse/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40307519",
    "commentBody": "",
    "originSummary": [
      "Forfatteren brukte tekstinnbygging til å analysere 40 millioner innlegg og kommentarer fra Hacker News, og utviklet verktøy for interaktivt søk, anbefalinger og sentimentanalyse.",
      "Analysen omfatter optimalisering av datahenting, sentimentstrender som positive følelser i Rust-kommentarer og utfordringer med å håndtere minne på GPU-er.",
      "Samarbeid og tilbakemeldinger er velkomne for å forbedre appen, og data og kode er tilgjengelig for utforskning på GitHub."
    ],
    "commentSummary": [
      "Innlegget tar for seg sentimentanalyse av Hacker News-kommentarer, og legger vekt på den høye frekvensen av negativitet og nødvendigheten av en sofistikert sentimentklassifisering.",
      "Brukerne deltar i diskusjoner om ulike temaer som plattformatmosfære, selvpromotering, dataanalyseprosjekter, GPU-optimalisering og UMAP-integrering.",
      "Tråden berører også tekniske emner som dimensjonsreduksjon, visualiseringsverktøy, emneprevalens, identifisering av alt-kontoer, algoritmer for innholdsanbefalinger og prediktiv modellering ved hjelp av RSS-feed-innhold, i tillegg til å foreslå forbedringer av plattformen og dele ressurser for dybdeanalyse."
    ],
    "points": 431,
    "commentCount": 133,
    "retryCount": 0,
    "time": 1715257864
  },
  {
    "id": 40307098,
    "title": "Datatype99: Sikre algebraiske datatyper for C99",
    "originLink": "https://github.com/Hirrolot/datatype99",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40307098",
    "commentBody": "",
    "originSummary": [
      "Datatype99 er et sikkert C99-bibliotek for algebraiske datatyper, som sørger for typesikkerhet, portabilitet, forutsigbarhet og tydelige feilmeldinger i sanntidsstrømmingsprogramvare.",
      "Den tilbyr syntakssukker for taggede unioner, sikker mønstermatching og retningslinjer for kodeorganisering, feilhåndtering og optimalisering av datatyper i C-programmering.",
      "Biblioteket støtter Metalang99-makroer, noe som forenkler datahåndtering og garanterer kompilatorsikkerhet."
    ],
    "commentSummary": [
      "Diskusjonen på Github tar for seg fordelene og begrensningene ved algebraiske datatyper (ADT-er) og mønstermatching i ulike programmeringsspråk.",
      "Brukerne setter pris på ADT-er på grunn av fleksibiliteten og den konsise koden, og uttrykker misnøye med språk som mangler disse egenskapene, for eksempel Go.",
      "Samtalen tar også for seg fagforeninger i objektorientert programmering, makroer i språk som C, Rust og Swift og innføringen av mønstermatching i Java, og understreker viktigheten av syntakssukker og fordelene ved å bruke Zig og Nim som C-alternativer."
    ],
    "points": 347,
    "commentCount": 191,
    "retryCount": 0,
    "time": 1715254287
  },
  {
    "id": 40310228,
    "title": "OpenAIs partnerskap med nyhetsutgivere",
    "originLink": "https://www.adweek.com/media/openai-preferred-publisher-program-deck/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40310228",
    "commentBody": "",
    "originSummary": [
      "OpenAI henvender seg til nyhetsutgivere med tilbud om partnerskap gjennom sitt Preferred Publisher Program, som gir økonomiske insentiver og fordeler for samarbeid.",
      "Programmet har som mål å øke brukerengasjementet ved å bruke AI-drevne funksjoner som merkede lenker og innholdsvisningsprodukter.",
      "OpenAIs metoder for dataskraping er imidlertid under juridisk granskning, noe som har ført til at enkelte utgivere har gått til sak for påstått brudd på opphavsretten."
    ],
    "commentSummary": [
      "Fokuset ligger på OpenAIs lekkede pitch-dekk for publisher-partnerskap, med diskusjoner om skjevheter i AI-modeller, produktivitet og effekten av reklameintegrasjon.",
      "Debattene omfatter åpenhet, etiske bekymringer og integrering av annonser i AI-generert innhold, samt etiske konsekvenser av datalekkasjer og kommersialisering av AI-teknologi.",
      "Brukerne viser skepsis til reklamens effekt på AI-teknologi, fremtidig teknologis innvirkning på samfunnet, språkutvikling, spesielt med henvisning til begrepet \"kortstokk\" i presentasjoner."
    ],
    "points": 288,
    "commentCount": 259,
    "retryCount": 0,
    "time": 1715273815
  },
  {
    "id": 40313143,
    "title": "Sioyek: PDF Viewer optimalisert for lærebøker og forskning",
    "originLink": "https://github.com/ahrm/sioyek",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40313143",
    "commentBody": "",
    "originSummary": [
      "Sioyek er en spesialisert PDF-visningsprogramvare som er skreddersydd for lærebøker og forskningsartikler, og som tilbyr hurtigsøk, innholdsfortegnelse, smarte hopp, bokmerker, høydepunkter og støtte for flere skjermer.",
      "Det er tilgjengelig på Windows, macOS og Linux via offisielle pakker, Homebrew Cask og tredjepartspakker for ulike Linux-distribusjoner.",
      "Brukere kan bidra til Sioyeks utvikling ved å donere penger og finne installasjonsveiledning for ulike operativsystemer på nettstedet deres."
    ],
    "commentSummary": [
      "Brukerne deltar i diskusjoner om ulike PDF-visningsprogrammer og notatverktøy som Sioyek, Cahier og Hypothesis, og fremhever funksjoner de liker og områder som kan forbedres.",
      "Andre verktøy som Zotero, Obsidian og Heptabase blir også tatt opp i samtalen, noe som utvider utvalget av alternativer som brukerne kan vurdere.",
      "Dialogen tar for seg temaer som e-ink-enheter, kompatibilitet med operativsystemer og betydningen av systemkrav ved valg av programvare, og understreker viktigheten av å velge verktøy som er tilpasset individuelle behov og passer til maskinvaren og operativsystemet."
    ],
    "points": 236,
    "commentCount": 83,
    "retryCount": 0,
    "time": 1715290123
  },
  {
    "id": 40307454,
    "title": "PGMQ: Postgres-basert lettvektsmeldingskø",
    "originLink": "https://github.com/tembo-io/pgmq",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40307454",
    "commentBody": "",
    "originSummary": [
      "Postgres Message Queue (PGMQ) er en lettvekts meldingskø som er beslektet med AWS SQS og RSMQ, med Postgres som fundament og støtte for funksjoner som \"nøyaktig én gang\"-levering av meldinger og kompatibilitet med Postgres versjon 12-16.",
      "Dokumentasjonen gir innsikt i installasjon, klientbiblioteker, SQL-bruk og konfigurasjonsinnstillinger for partisjonerte køer i PGMQ.",
      "PGMQ sikrer synlighet av meldinger ved hjelp av en tidsavbrudd for synlighet og gir valgmuligheter for sletting eller arkivering av meldinger."
    ],
    "commentSummary": [
      "Github-diskusjonen drøfter bruk av Postgres i stedet for SQS for å oppnå \"nøyaktig én gang\"-levering av meldinger innenfor en tidsavbruddsperiode, og diskuterer systemfeil som påvirker denne garantien og utfordringene ved distribuert konsensus.",
      "Deltakerne snakker om håndtering av feil i meldingsleveranser, forskjellen mellom leveringssikkerhet og behandlingssikkerhet, effektiviteten til Postgres som meldingskø, nevner unike identifikatorer og vurderer alternativer som RabbitMQ og Graphile Worker for jobbadministrasjon.",
      "Fokuset ligger på å effektivisere arkitekturen, minimere kompleksiteten og sikre pålitelig meldingslevering i distribuerte systemer."
    ],
    "points": 222,
    "commentCount": 92,
    "retryCount": 0,
    "time": 1715257313
  },
  {
    "id": 40309342,
    "title": "Muddy: Samarbeidsbrowser med AI-organisering",
    "originLink": "https://news.ycombinator.com/item?id=40309342",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40309342",
    "commentBody": "",
    "originSummary": [
      "Muddy er en nettleser som er utviklet for arbeid, og som skal hjelpe brukerne med å organisere prosjektfiler effektivt på ett sted.",
      "Nettleseren utnytter kunstig intelligens for automatisk apporganisering og styring av prosjektets tidslinje, med vekt på samarbeid og produktivitet.",
      "Muddy tilbyr et gratis basisprodukt med betalte abonnementer for team, med personvern som et viktig aspekt, tilgjengelig for nedlasting på Mac eller Windows."
    ],
    "commentSummary": [
      "Muddy er en samarbeidsnettleser som er utviklet for arbeid, og som bruker kunstig intelligens til å organisere prosjektfiler og øke teamets produktivitet.",
      "Brukerne setter pris på den tidslinjebaserte organiseringen, meldingsfunksjonen og de personaliserte visningene, med betalte abonnementsalternativer.",
      "Fremtidige planer kan omfatte integrering av en e-postklient og AI-faneorganisasjon, og det pågår diskusjoner om tekniske krav og personvernhensyn."
    ],
    "points": 215,
    "commentCount": 93,
    "retryCount": 0,
    "time": 1715269128
  },
  {
    "id": 40309759,
    "title": "ESP32 trommesyntmaskin: Lofi Wavetable Drum Synthesizer",
    "originLink": "https://github.com/zircothc/DRUM_2004_V1",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40309759",
    "commentBody": "",
    "originSummary": [
      "DRUM_2004_V1 ESP32 DRUM SYNTH MACHINE er en lofi-trommesynthesizer med en wavetable synth-motor som bruker DZL Arduino-biblioteket.",
      "Den har 16 polyfonier og justerbare lydparametere som tabell, lengde, konvolutt, tonehøyde, modulasjon, volum, panorering og filter.",
      "Maskinvaren består av en Lolin S2 Mini (ESP32 S2) med ulike komponenter, blant annet trykknapper, en roterende enkoder, et OLED-display og WS2812B-lysdioder."
    ],
    "commentSummary": [
      "Medlemmer på Github deltar i en diskusjon om et ESP32 Drum Synth Machine-prosjekt, som dekker tekniske detaljer, stabilitet, designfunksjoner og ressurser for å lære mer om synthesizere og DIY-prosjekter.",
      "Alternativer som Woovebox eller Synthstrom Deluge blir anbefalt av noen deltakere i tråden."
    ],
    "points": 207,
    "commentCount": 30,
    "retryCount": 0,
    "time": 1715271434
  },
  {
    "id": 40308261,
    "title": "Sikkerhetsbrudd: Microsoft PlayReady ECC-nøkler kompromittert",
    "originLink": "https://seclists.org/fulldisclosure/2024/May/5",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40308261",
    "commentBody": "",
    "originSummary": [
      "Security Explorations identifiserte to angrepsscenarioer som gjorde det mulig å hente ut private ECC-nøkler i Microsoft PlayReady-klienter.",
      "Ved å kompromittere disse nøklene kan det være mulig å etterligne en PlayReady-klient utenfor Protected Media Path, noe som kan medføre risiko for eksponering av innholdsnøkler i Windows.",
      "Understreker behovet for kontinuerlige sikkerhetsforbedringer for å beskytte mot sårbarheter i programvarebaserte innholdsbeskyttelsessystemer som PlayReady."
    ],
    "commentSummary": [
      "Artikkelen tar for seg sårbarheten til Microsoft PlayReady, med fokus på kompromittert klientidentitet, særlig når det gjelder å beskytte premium videoinnhold mot piratkopiering.",
      "Den utforsker hindringene ved DRM-strategier, kryptering og verktøy som Widevine, og dissekerer de etiske overveielsene og begrensningene ved DRM i kampen mot piratkopiering.",
      "Diskusjonen legger vekt på den kontinuerlige diskursen om DRM-effektivitet, dens innflytelse på brukernes rettigheter og viktigheten av å finne nye metoder for å motvirke piratkopiering i dagens digitale tidsalder."
    ],
    "points": 181,
    "commentCount": 159,
    "retryCount": 0,
    "time": 1715262786
  },
  {
    "id": 40307832,
    "title": "Eksponentielle data er nødvendig for multimodal generalisering av \"nullskudd\"",
    "originLink": "https://arxiv.org/abs/2404.04125",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40307832",
    "commentBody": "",
    "originSummary": [
      "Multimodale modeller trenger betydelig mer pretrainingsdata for å oppnå marginale ytelsesforbedringer, noe som setter spørsmålstegn ved konseptet \"null-shot\"-generalisering innen datasyn og mønstergjenkjenning.",
      "Forskningen introduserer \"Let it Wag!\"-referansen for å understreke behovet for ytterligere studier av generaliseringsevnen i omfattende treningsscenarioer.",
      "Det er avgjørende å forstå hvordan hyppigheten av pretrainingsdata påvirker modellytelsen for å fremme forskningen på multimodale modeller innen datasyn og mønstergjenkjenning."
    ],
    "commentSummary": [
      "Diskusjonene dreide seg om hvordan man kan realisere null-shot-læring i AI-modeller ved å trene på data som inneholder eksempler på de testede klassene, og understreket betydningen av å forstå språk, syn og resonnement i AI-modeller.",
      "Ulike temaer ble utforsket, blant annet potensialet for en ny \"AI-vinter\", effekten av store språkmodeller og bruk av syntetiske data i modellopplæringen, noe som understreket utfordringene og begrensningene ved dagens AI-teknologi.",
      "Utfordringer knyttet til å oppnå null-shot generalisering i bilde-til-tekst- og tekst-til-bilde-modeller ble spesielt tatt opp under diskusjonene."
    ],
    "points": 171,
    "commentCount": 101,
    "retryCount": 0,
    "time": 1715260085
  },
  {
    "id": 40309957,
    "title": "E-postlekkasje fra FBI avslører tvilsom begrunnelse for avlytting uten fullmakt",
    "originLink": "https://gizmodo.com/leaked-fbi-email-warrantless-wiretaps-section-702-1851464520",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40309957",
    "commentBody": "",
    "originSummary": [
      "Kongressen godkjente på nytt USAs program for avlytting uten fullmakt, paragraf 702 i FISA, ut fra hensynet til nasjonal sikkerhet.",
      "En e-postlekkasje fra FBI til Wired avslørte planer om å tøye lovens grenser ved å søke etter amerikanere i avlyttet kommunikasjon, til tross for at man teknisk sett fulgte lovens ordlyd.",
      "Til tross for innvendinger fikk FBI fornyet autorisasjonen, noe som reiste spørsmål om ansvarlighet og oppfatningen av å overskride lovens grenser."
    ],
    "commentSummary": [
      "Debatten omfatter overvåkingsprogrammenes effektivitet, etikk og lovlighet, og det uttrykkes bekymring for manglende rapportering og potensielt maktmisbruk fra myndighetenes side.",
      "Diskusjonene omfatter blant annet tolkninger av det andre grunnlovstillegget, rollen til statlige militser og balansen mellom effektivitet i rettshåndhevelsen og sivile friheter.",
      "Det stilles spørsmål ved bruken av strenge straffer i avskrekkende øyemed, behovet for masseovervåkningstiltak og åpenhet og ansvarlighet i forbindelse med myndighetenes overvåkning og rettshåndhevelse."
    ],
    "points": 160,
    "commentCount": 80,
    "retryCount": 0,
    "time": 1715272457
  },
  {
    "id": 40313451,
    "title": "Verden nærmer seg forurensningstoppen på grunn av regionale forskjeller",
    "originLink": "https://www.sustainabilitybynumbers.com/p/peak-pollution",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40313451",
    "commentBody": "",
    "originSummary": [
      "Nyere data tyder på at verden trolig har passert forurensningstoppen for lokale luftforurensningsstoffer, og at utslippene har gått ned i rikere land som USA og Europa, mens Kina også har opplevd en betydelig nedgang.",
      "I lav- og lavere mellominntektsland øker derimot utslippene, noe som understreker hvor viktig det er at landene raskt beveger seg gjennom \"miljø-Kuznets-kurven\" for å oppnå lavere forurensningsnivåer.",
      "Hovedfokuset er å redusere antallet for tidlige dødsfall som følge av luftforurensning, særlig i utviklingsland, uten å hindre økonomisk fremgang og energitilgang."
    ],
    "commentSummary": [
      "Diskusjonen tar for seg befolkningsvekst, energiforbruk, forurensning, samfunnsverdier og teknologiens miljøpåvirkning, og kommer inn på synkende fødselstall, religiøse/sekulære oppfatninger om fruktbarhet og konsekvensene av \"peak coal\" og \"peak oil\" i det globale energiforbruket.",
      "Den understreker nødvendigheten av bærekraftig praksis, samfunnsreformer og globalt samarbeid for å håndtere miljøproblemer som klimaendringer og forurensning.",
      "Samtalen understreker samspillet mellom menneskelig atferd, samfunnets rammer og miljøet, og understreker betydningen av informerte beslutninger og felles innsats for en bærekraftig fremtid."
    ],
    "points": 152,
    "commentCount": 139,
    "retryCount": 0,
    "time": 1715292701
  },
  {
    "id": 40313193,
    "title": "Spektakulær kartlegging av hjernebarken i nanoskala avdekker skjulte funksjoner",
    "originLink": "https://www.nature.com/articles/d41586-024-01387-9",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40313193",
    "commentBody": "",
    "originSummary": [
      "Google-forskere har kartlagt et fragment av menneskehjernen med nanoskalaoppløsning, og avdekket nye trekk ved nevroner og forbindelser i hjernebarken.",
      "3D-kartet består av 57 000 celler og 150 millioner synapser, og gir en enestående detaljrikdom som kan bidra til å forstå og behandle psykiatriske og nevrodegenerative tilstander.",
      "Denne monumentale nevrovitenskapelige bragden, som involverer en bevart og metallfarget hjerneprøve, har potensial til å avdekke ny innsikt i de nevrale forbindelsene i menneskehjernen."
    ],
    "commentSummary": [
      "Artikkelen tar for seg den kompliserte prosessen med å kartlegge hjernen i mikroskopisk skala, og legger vekt på variasjoner i nevrontetthet mellom fugler og pattedyr.",
      "Den utforsker den potensielle effekten av forskjeller i nevrondensitet på stimulirespons og prosesseringshastighet, og sammenligner også språkmodeller som GPT-4 med menneskehjernen.",
      "I tillegg berører den proteinberegning i celler, problemer med avbildning av hjernevev, lagringskravene for fullstendige hjerneskanninger, og uttrykker skepsis til å fullt ut forstå kompleksiteten i menneskehjernen og replikere dens funksjoner i modeller for kunstig intelligens."
    ],
    "points": 149,
    "commentCount": 74,
    "retryCount": 0,
    "time": 1715290566
  },
  {
    "id": 40307108,
    "title": "Maskinlæring i Elixir: En skalerbar og effektiv plattform",
    "originLink": "https://cigrainger.com/elixirconf-eu-2024-keynote/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40307108",
    "commentBody": "",
    "originSummary": [
      "Maskinlæring i Elixir anses nå som produksjonsklar, takket være integrasjonen med BEAM- og OTP-primitivene, noe som gjør den ideell for distribusjon av maskinlæringsmodeller.",
      "Nx-rammeverket, som er inspirert av JAX, byr på fordeler innen metaprogrammering og pluggbare backends, med funksjoner som Nx.Serving for distribuert, maskinvareagnostisk automatisk batching ved hjelp av Elixirs aktørmodell for samtidighet.",
      "Elixirs integrasjon med Phoenix-applikasjoner er sømløs, og bruker biblioteker som Oban, Broadway og FLAME for effektiv prosessering og sanntidsoppdateringer, noe som viser hvor skalerbar og effektiv den er for maskinlæringsapplikasjoner."
    ],
    "commentSummary": [
      "Diskusjonen tar for seg bruken av Elixir og BEAM-språk som Erlang til maskinlæring og programvareutvikling, og understreker fordelene med skalerbarhet, feiltoleranse og samtidig prosessering.",
      "Elixir får ros for sin produktivitet og parallellprosesseringsmuligheter, men noen er bekymret for problemer med typing og vanskeligheter med å ta det i bruk.",
      "Debatten setter Elixirs ytelsesfordeler opp mot språk som Python og Java, samtidig som den fremhever utfordringer som mangelfull dokumentasjon, et begrenset biblioteksøkosystem og støtte fra samfunnet."
    ],
    "points": 131,
    "commentCount": 92,
    "retryCount": 0,
    "time": 1715254429
  }
]
