[
  {
    "id": 41858665,
    "title": "FTC, 구독 취소를 더 쉽게 하는 '클릭-투-취소' 규칙 발표",
    "originLink": "https://www.ftc.gov/news-events/news/press-releases/2024/10/federal-trade-commission-announces-final-click-cancel-rule-making-it-easier-consumers-end-recurring",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41858665",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "FTC는 구독 취소 과정을 간소화하기 위해 '클릭하여 취소' 규칙을 도입하여 가입만큼 쉽게 만들었습니다.",
      "이 규칙은 취소를 어렵게 만드는 회사와 관련된 문제를 다루며, 소비자를 착취적인 관행으로부터 보호하기 위한 광범위한 노력의 일환입니다.",
      "일부는 이것이 의회에 의해 법제화되어야 한다고 믿지만, 캘리포니아와 같은 주들이 이미 유사한 법을 시행하고 있는 상황에서 이 규칙은 법적 도전에 직면할 것으로 예상된다."
    ],
    "points": 819,
    "commentCount": 403,
    "retryCount": 0,
    "time": 1729084144
  },
  {
    "id": 41853810,
    "title": "Graphite, Blender에서 영감을 받은 2D 절차적 디자인 Rust 앱",
    "originLink": "https://graphite.rs/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41853810",
    "commentBody": "",
    "originSummary": [
      "Adobe와 경쟁하기 위해 새로운 2D 디자인 및 이미지 편집 도구가 개발 중이며, 최근 3분기 업데이트에서 상당한 진전이 이루어졌습니다.",
      "이 프로젝트는 오픈 소스 개발을 지원하는 프로그램인 Google Summer of Code (GSoC)에 참여했으며, 향후 참여를 위해 Rust 개발자를 찾고 있습니다.",
      "관심 있는 개발자들은 Q3 진행 보고서를 검토하고 다음 GSoC 주기의 인턴십에 지원하는 것을 고려해 보시기 바랍니다."
    ],
    "commentSummary": [
      "Graphite는 Blender에서 영감을 받은 2D 절차적 디자인 애플리케이션으로, Rust로 개발되었으며 Adobe의 2D 디자인 도구에 대한 대안을 제공하는 것을 목표로 합니다.",
      "이 프로젝트는 오픈 소스이며 Rust 개발자들의 기여를 구하고 있으며, 3년 동안 개발 중에 있으며 최근 Google Summer of Code에 참여했습니다.",
      "현재 벡터 편집에 중점을 두고 있는 Graphite는 내년에 래스터 편집으로 확장할 계획이며, 사용자 정의 코드와 노드 기반 편집을 통한 프로그래밍 데이터 처리 파이프라인을 강조할 것입니다."
    ],
    "points": 696,
    "commentCount": 106,
    "retryCount": 0,
    "time": 1729031526
  },
  {
    "id": 41856883,
    "title": "MacOS는 때때로 시스템 업데이트 후에 트래픽이 누출됩니다.",
    "originLink": "https://mullvad.net/en/blog/macos-sometimes-leaks-traffic-after-system-updates",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41856883",
    "commentBody": "",
    "originSummary": [
      "시스템 업데이트 후, macOS는 네트워크 트래픽을 유출할 수 있으며, 방화벽 문제로 인해 일부 애플리케이션이 VPN 터널을 우회할 가능성이 있습니다.",
      "이 문제는 macOS 버전 14.6부터 관찰되었으며, Apple의 애플리케이션을 포함한 여러 애플리케이션에 영향을 미치고 있습니다. 재부팅이 일시적으로 문제를 해결할 수 있습니다.",
      "사용자는 모든 트래픽을 차단하는 방화벽 규칙을 추가하여 누출을 테스트할 수 있습니다. 트래픽이 VPN을 우회하면 누출이 있는 것이며, 수정이 필요합니다."
    ],
    "commentSummary": [
      "MacOS 업데이트는 특히 Apple 기기에서 트래픽 누출을 일으킬 수 있으며, 이는 App Store와 같은 특정 서비스에 대해 VPN을 우회할 수 있습니다. 업데이트는 방화벽을 포함한 설정을 재설정할 수 있으며, 인터넷 액세스가 필요할 수 있어 데이터를 AI 서버로 전송할 가능성이 있어 일부 사용자는 업데이트 중에 라우터를 비활성화하기도 합니다. 이러한 우려에도 불구하고 MacOS는 여전히 하드웨어와 기능 때문에 일부 사용자에게 선호되며, 다른 사람들은 현대적인 리눅스를 대안으로 추천합니다."
    ],
    "points": 350,
    "commentCount": 183,
    "retryCount": 0,
    "time": 1729067843
  },
  {
    "id": 41852821,
    "title": "CapibaraZero: ESP32-S3 기반의 FlipperZero에 대한 저렴한 대안",
    "originLink": "https://capibarazero.github.io/docs/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41852821",
    "commentBody": "",
    "originSummary": [
      "CapibaraZero는 무선 통신 기능으로 잘 알려진 Espressif 보드를 활용하여 FlipperZero™의 비용 효율적인 대안으로 소개됩니다.",
      "이 프로젝트는 문서와 펌웨어 다운로드를 제공하여 이 대안을 탐색하는 데 관심이 있는 사용자에게 활발한 개발과 지원을 나타냅니다.",
      "이 릴리스는 FlipperZero™ 장치가 제공하는 유사한 기능을 예산 친화적인 옵션으로 찾고 있는 기술 애호가들에게 중요합니다."
    ],
    "commentSummary": [
      "CapibaraZero는 FlipperZero의 비용 효율적인 대안으로 소개되었으며, ESP32-S3 칩을 사용하여 높은 가격과 내장 WiFi 부족과 같은 제한 사항을 극복합니다.",
      "이 프로젝트는 싱글 보드 컴퓨터와 결합하고 리포 배터리로 구동될 때의 잠재력 때문에 관심을 끌고 있으며, 오프 그리드 기능을 위한 LoRa 통합에 대한 논의가 진행 중입니다.",
      "CapibaraZero에 대한 열정이 넘쳐나고 있으며, 사용 가능한 PCB 설계와 3D 프린팅을 위한 STL 파일이 이를 뒷받침하고 있지만, FlipperZero의 강력한 소프트웨어 커뮤니티는 여전히 주목할 만한 장점입니다."
    ],
    "points": 346,
    "commentCount": 73,
    "retryCount": 0,
    "time": 1729024481
  },
  {
    "id": 41857032,
    "title": "FLOSS/자유 및 오픈 소스 프로젝트를 위한 기금",
    "originLink": "https://floss.fund/blog/announcing-floss-fund/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41857032",
    "commentBody": "",
    "originSummary": [
      "Zerodha의 CTO인 Kailash Nadh는 전 세계의 자유 및 오픈 소스 소프트웨어(FOSS) 프로젝트를 지원하기 위한 연간 100만 달러 규모의 FLOSS/fund 출범을 발표했습니다.",
      "이 기금은 수혜자당 $10,000에서 $100,000 사이의 금액을 제공하며, 매년 총 $100만 달러가 배포되어 FOSS 프로젝트를 지속 가능하게 하고 다른 기업들이 기여하도록 영감을 주는 것을 목표로 합니다.",
      "새로운 funding.json 파일은 프로젝트가 재정적 필요를 전달하는 데 도움을 줄 것이며, 전 세계적으로 신청이 가능하고 전담 팀에 의해 관리됩니다."
    ],
    "commentSummary": [
      "FLOSS/fund는 무료 및 오픈 소스 프로젝트에 재정적 지원을 제공하며, 프로젝트의 저장소에 funding.json 파일을 요구하는 간단한 신청 절차를 가지고 있습니다. 이 펀드는 프로젝트당 연간 최대 $100,000를 제공하며, 널리 사용되고 중요한 영향을 미치는 프로젝트를 우선시합니다. 이 이니셔티브는 인도의 저명한 투자 플랫폼인 Zerodha에 의해 지원되며, 오픈 소스 프로젝트와 기여자를 지원하기 위한 지속 가능한 자금 조달 및 혁신적인 모델에 대한 논의를 촉발했습니다."
    ],
    "points": 345,
    "commentCount": 93,
    "retryCount": 0,
    "time": 1729069345
  },
  {
    "id": 41853637,
    "title": "왜 우리는 더 이상 차양을 사용하지 않을까 (2022)",
    "originLink": "https://thecraftsmanblog.com/why-dont-we-use-awnings-anymore/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41853637",
    "commentBody": "",
    "originSummary": [
      "차양은 역사적으로 태양열 획득을 차단하여 겨울에는 수동 난방을 제공하고 여름에는 냉방을 제공하는 데 사용되었으나, 20세기 중반 에어컨의 등장과 함께 인기가 떨어졌다.",
      "차양 사용의 감소는 낮은 에너지 비용과 단열에 대한 집중으로 인해 발생했으며, 현재는 주로 간판 및 파티오 덮개로 사용되고 있습니다.",
      "에너지 가격 상승은 난방 및 냉방 비용을 줄이는 비용 효율적인 방법으로 차양의 인기가 다시 높아질 수 있습니다."
    ],
    "commentSummary": [
      "차양은 에어컨의 보급과 저방사율(low-e) 유리와 같은 창문 기술의 발전으로 인해 인기가 줄어들었습니다.",
      "그것들은 종종 유지 보수가 필요하고 구식으로 보이는 것으로 여겨져, 많은 사람들이 블라인드나 커튼과 같은 대안을 선택하도록 유도합니다.",
      "이러한 경향에도 불구하고, 차양은 에너지 효율성에 유익하며 자연 냉각이 우선시되는 지역에서 여전히 사용되고 있습니다."
    ],
    "points": 328,
    "commentCount": 282,
    "retryCount": 0,
    "time": 1729030295
  },
  {
    "id": 41857754,
    "title": "인터넷 아카이브가 다시 온라인 상태입니다",
    "originLink": "https://arstechnica.com/tech-policy/2024/10/the-internet-archive-and-its-916-billion-saved-webpages-are-back-online/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41857754",
    "commentBody": "",
    "originSummary": [
      "인터넷 아카이브의 웨이백 머신이 DDoS(분산 서비스 거부) 공격으로 인해 중단된 후 읽기 전용 모드로 다시 온라인 상태가 되었습니다.",
      "설립자 브루스터 케일은 웨이백 머신이 작동 중이지만 추가적인 유지보수가 필요할 수 있으며, '페이지 저장하기' 기능을 포함한 다른 서비스들은 여전히 오프라인 상태라고 밝혔다.",
      "인터넷 아카이브는 1996년부터 9,160억 개의 웹 페이지를 보관해 왔으며, 3,100만 명의 사용자 기록에 영향을 미친 데이터 유출 이후 데이터 보안에 집중하고 있습니다."
    ],
    "commentSummary": [
      "인터넷 아카이브는 해커 공격 이후 운영을 재개했으며, 이는 그 중요성을 부각시키고 미래의 중단을 방지하기 위한 탈중앙화에 대한 논의를 촉발했습니다.",
      "사용자들은 시더 부족과 콘텐츠 호스팅과 관련된 법적 위험과 같은 탈중앙화의 문제에 대해 논의했습니다.",
      "이 사건은 Cloudflare의 개입과 아카이브를 강화하기 위한 탈중앙화 기술의 잠재력에 대한 논의를 촉발했으며, 일부 사용자는 기부를 통해 지지를 더욱 강화하고 있다고 표현했습니다."
    ],
    "points": 302,
    "commentCount": 73,
    "retryCount": 0,
    "time": 1729076991
  },
  {
    "id": 41854405,
    "title": "Redbox는 사용 중지된 기계에 개인 식별 정보를 남겼습니다.",
    "originLink": "https://digipres.club/@foone/113313955144323780",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41854405",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "레드박스가 사용 중지된 기계에서 개인 정보를 제거하지 못한 것은 소프트웨어 개발에서 과도한 엔지니어링에 대한 논쟁을 촉발시켰으며, 이는 단순성과 추상화에 중점을 두고 있습니다.",
      "이 논의는 실용적인 코딩과 테스트 가능하며 확장 가능한 시스템의 필요성을 균형 있게 맞추는 것의 중요성을 강조합니다.",
      "이번 사건은 데이터 보안과 기술 자산의 책임 있는 폐기에 대한 중대한 우려를 제기하며, 특히 회사 파산과 관련된 상황에서 더욱 그렇습니다."
    ],
    "points": 250,
    "commentCount": 128,
    "retryCount": 0,
    "time": 1729037722
  },
  {
    "id": 41859012,
    "title": "Apple Vision Pro와 함께 여행하기",
    "originLink": "https://azadux.blog/2024/10/08/traveling-with-apple-vision-pro/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41859012",
    "commentBody": "",
    "originSummary": [
      "Azad의 블로그는 여행을 위한 Apple Vision Pro를 리뷰하며 몰입감 있는 영화 경험과 확장된 MacBook 작업 공간을 주요 장점으로 언급합니다. Vision Pro의 여행 모드는 이동 중인 차량에서의 추적 문제를 해결하며, 외부 전원 공급 장치를 통해 배터리 수명도 관리할 수 있습니다. 인체공학적 및 사회적 편안함의 도전 과제에도 불구하고, Azad는 미래의 Vision Pro 버전이 빈번한 여행자에게 잠재력이 있다고 보고 있으며, 어둠 속에서의 기능성과 눈에 띄지 않는 UI 상호작용을 강조합니다."
    ],
    "commentSummary": [
      "Apple Vision Pro는 독특한 여행 경험을 제공하지만 부피가 크고 비싸며 배터리 수명이 제한적이어서 Xreal Air 안경과 같은 대안에 비해 여행에 덜 실용적입니다.",
      "일부 여행자들은 실용성과 사회적 수용성 때문에 기내 엔터테인먼트로 iPad와 같은 전통적인 기기를 선호합니다.",
      "Vision Pro의 향후 개선 가능성은 인정되지만, 현재 형태로는 여행 목적으로 널리 받아들여지지 않고 있습니다."
    ],
    "points": 210,
    "commentCount": 251,
    "retryCount": 0,
    "time": 1729086531
  },
  {
    "id": 41860909,
    "title": "ArchiveBox가 진화하고 있습니다: 자체 호스팅 인터넷 아카이브의 미래",
    "originLink": "https://docs.sweeting.me/s/archivebox-plugin-ecosystem-announcement",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41860909",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "ArchiveBox는 지속 가능성과 신뢰성을 중점으로 자체 호스팅 인터넷 아카이브를 개선하기 위한 중요한 개발을 진행 중입니다.",
      "이 프로젝트는 개발 조직 또는 재단의 설립을 모색하고 있으며 지원을 강화하기 위해 더 많은 팀원을 고용하는 것을 고려하고 있습니다.",
      "암호화 서명 아카이브 및 사이트 호환성을 향상시키기 위한 플러그인 시스템과 같은 새로운 기능들이 준비 중이며, 추가적인 탄력성을 위해 커뮤니티의 참여가 권장됩니다."
    ],
    "points": 204,
    "commentCount": 42,
    "retryCount": 0,
    "time": 1729095519
  },
  {
    "id": 41855886,
    "title": "저는 Coolify를 사용하여 제 홈 서버에 Llama 3.2를 자체 호스팅했습니다.",
    "originLink": "https://geek.sg/blog/how-i-self-hosted-llama-32-with-coolify-on-my-home-server-a-step-by-step-guide",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41855886",
    "commentBody": "",
    "originSummary": [
      "이 게시물은 Next.js 앱을 자체 호스팅하고 Ollama를 사용하여 Llama 3.2를 홈 서버에서 실행하는 가이드를 설명하며, 이는 가격 문제로 인해 Vercel에서 이주하는 추세에 의해 동기 부여되었습니다. - 설정의 주요 구성 요소로는 Coolify를 사용한 배포, CUDA 툴킷을 통한 GPU 가속, 도메인 관리를 위한 Cloudflare 터널 구성 등이 포함됩니다. - 이 가이드는 추론 시간의 상당한 개선을 강조하며, 홈 서버에서 GPU 지원 AI 애플리케이션을 설정하는 단계별 프로세스를 자세히 제공합니다."
    ],
    "commentSummary": [
      "이 게시물은 Coolify를 사용하여 홈 서버에서 Llama 3.2라는 언어 모델을 자체 호스팅하는 것에 대해 논의하며, 타사 서비스에 비해 제어 및 프라이버시의 이점을 강조합니다.",
      "Cloudflare는 빠른 응답 시간으로 인해 정적 웹사이트 호스팅에 권장되지만, 사용자는 엄격한 미디어 제공 규칙을 인지하고 Cloudflare Tunnels 또는 Tailscale과 같은 안전한 연결 옵션을 고려해야 합니다.",
      "Coolify는 애플리케이션 배포에 유용한 도구로 주목받고 있으며, 곧 출시될 v4 베타 버전이 향후 발전 가능성을 보여주고 있습니다."
    ],
    "points": 199,
    "commentCount": 86,
    "retryCount": 0,
    "time": 1729056395
  },
  {
    "id": 41858975,
    "title": "호프스태터의 리스프에 관한 글 (1983)",
    "originLink": "https://gist.github.com/jackrusher/5139396",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41858975",
    "commentBody": "",
    "originSummary": [
      "1950년대 후반에 John McCarthy가 개발한 Lisp는 AI 연구의 중심에 있는 프로그래밍 언어로, 우아함, 유연성, 상호작용적인 특성으로 잘 알려져 있습니다. 다른 언어와 달리 Lisp는 즉각적인 피드백과 점진적인 프로그램 개발을 가능하게 하며, 독특한 폴란드 표기법을 사용하고 리스트와 원자의 조작에 중점을 둡니다. Douglas Hofstadter가 Scientific American에서 소개한 Lisp는 그 강력함과 다재다능함을 강조하며, car와 cdr 같은 함수와 새로운 함수를 정의할 수 있는 능력 등 핵심 기능을 보여주는 연습 문제와 예제를 특징으로 합니다."
    ],
    "commentSummary": [
      "호프스태터의 1983년 리스프에 관한 글은 그 시대를 초월한 특성과 그의 책 \"괴델, 에셔, 바흐\" (GEB)에서의 생략을 강조하며, 리스프의 수학적 우아함과 인공지능(AI)에서의 응용에 대한 논의를 촉발시켰다.",
      "이 기사와 후속 논의는 Lisp의 진화, 코드가 데이터로 취급되는 호모이코닉성 및 기호 처리와 같은 고유한 기능, 그리고 AI, 컴퓨터 지원 설계(CAD), 웹 서비스 등 현대 프로그래밍에서의 관련성을 탐구합니다.",
      "독자들은 또한 현대 출판물에서 심층 과학 글쓰기의 감소를 반영하며, 이를 오래된 작품에서 발견되는 상세한 논의와 대조합니다."
    ],
    "points": 196,
    "commentCount": 62,
    "retryCount": 0,
    "time": 1729086277
  },
  {
    "id": 41852009,
    "title": "주요 작가들의 모든 가능한 줄거리 (2020)",
    "originLink": "https://www.the-fence.com/plots-major-authors/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41852009",
    "commentBody": "",
    "originSummary": [
      "영국에 기반을 둔 잡지 The Fence는 주요 작가들의 문학적 줄거리에서 반복되는 주제에 대해 풍자적인 관점을 제공합니다.",
      "여기에는 다양한 독자들의 관심사를 충족시키기 위해 스포트라이트, 특집, 조사, 문화, 소설과 같은 여러 섹션이 포함되어 있습니다.",
      "구독 옵션에는 선물 구독이 포함되어 있으며, 디지털 액세스는 월 £1.66부터 시작합니다."
    ],
    "commentSummary": [
      "해커 뉴스에서 유명 작가와 프로그래머의 글쓰기 스타일을 유머러스하게 탐구하는 가벼운 스레드가 있으며, 여기에는 댄 브라운, 테리 프래쳇, 스티븐 킹이 포함됩니다.",
      "사용자들은 Linus Torvalds와 Grace Hopper 같은 프로그래머들이 코딩에 접근하는 방식을 재치 있는 관찰로 기여하며, 문학적 비유와 프로그래밍 유머를 결합합니다.",
      "토론에서는 프로그래밍 언어와 소셜 네트워크의 특이점에 대한 농담이 등장하며, 참가자들이 코믹한 통찰력과 다른 유머러스한 콘텐츠에 대한 언급을 추가합니다."
    ],
    "points": 176,
    "commentCount": 127,
    "retryCount": 0,
    "time": 1729019203
  },
  {
    "id": 41861056,
    "title": "Winamp, 몇 주간의 어려움을 겪은 후 GitHub 소스 코드 저장소 전체를 삭제하다",
    "originLink": "https://arstechnica.com/gadgets/2024/10/winamp-really-whips-open-source-coders-into-frenzy-with-its-source-release/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41861056",
    "commentBody": "",
    "originSummary": [
      "Winamp는 승인되지 않은 코드와 독점 패키지를 포함한 문제가 있는 릴리스 이후 GitHub 소스 코드 저장소를 제거했습니다.",
      "“Winamp 협업 라이선스” 하에 출시된 이 제품은 부실한 관리로 인해 법적 및 커뮤니티 문제에 직면하여 비판을 받았습니다.",
      "전직 직원들은 적절한 감사와 법적 검토의 부족을 지적했으며, 벨기에 소유주인 라마 그룹은 이 상황에 대해 언급하지 않았다."
    ],
    "commentSummary": [
      "Winamp는 포크 및 수정된 버전 배포에 대한 제한을 포함한 불명확한 라이선스 조건에 대한 반발 이후 GitHub 소스 코드 저장소를 제거했습니다.",
      "이러한 라이선스 문제에 대한 커뮤니티의 부정적인 반응은 저장소 삭제로 이어졌으며, 이는 레거시 소프트웨어의 오픈 소싱에서의 어려움을 보여줍니다.",
      "이 사건은 오픈 소스 프로젝트에서 라이선스 및 커뮤니티 참여의 복잡성을 부각하며, 일부는 커뮤니티의 반응이 향후 오픈 소스 이니셔티브를 저해할 수 있다고 주장합니다."
    ],
    "points": 161,
    "commentCount": 98,
    "retryCount": 0,
    "time": 1729096455
  },
  {
    "id": 41853411,
    "title": "구글의 크롬 브라우저, uBlock Origin 비활성화 시작",
    "originLink": "https://www.pcmag.com/news/googles-chrome-browser-starts-disabling-ublock-origin",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41853411",
    "commentBody": "",
    "originSummary": [
      "Google은 더 안전한 Manifest V3 프레임워크로 전환을 시작하면서 이전의 \"Manifest V2\" 확장을 단계적으로 중단하고 있습니다. 이로 인해 uBlock Origin이 Chrome에서 작동을 멈출 수 있습니다.",
      "개발자 Raymond Hill은 사용 중단을 확인했으며, 사용자들은 광고 차단기를 제거하라는 알림을 받고 있지만 일부는 여전히 다운로드할 수 있습니다.",
      "Google은 Manifest V3가 uBlock Origin Lite와 같은 광고 차단기를 지원한다고 주장하지만, 원래의 모든 기능을 갖추고 있지는 않아서 일부 사용자는 Brave나 Firefox와 같은 대체 브라우저로 전환하는 것을 고려하고 있습니다."
    ],
    "commentSummary": [
      "Google의 Chrome 브라우저는 광고 차단 기능을 제한하는 Manifest V2에서 V3로의 전환으로 인해 uBlock Origin을 비활성화하고 있습니다.",
      "이 결정은 구글의 동기에 대한 논쟁을 촉발했으며, 비평가들은 이것이 광고 수익에 대한 관심에 의해 영향을 받았다고 제안하고 있습니다.",
      "사용자들은 광고 차단 기능을 유지하고 인터넷 프라이버시 및 구글의 시장 지배에 대한 우려를 해결하기 위해 Firefox로 전환하는 등의 대안을 논의하고 있습니다."
    ],
    "points": 159,
    "commentCount": 81,
    "retryCount": 0,
    "time": 1729028519
  }
]
