[
  {
    "id": 41858665,
    "title": "FTC công bố quy tắc \"nhấp để hủy\" giúp dễ dàng hủy đăng ký",
    "originLink": "https://www.ftc.gov/news-events/news/press-releases/2024/10/federal-trade-commission-announces-final-click-cancel-rule-making-it-easier-consumers-end-recurring",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41858665",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "FTC đã giới thiệu quy tắc \"nhấp để hủy\" để đơn giản hóa quy trình hủy đăng ký, làm cho nó dễ dàng như khi đăng ký.",
      "Quy định này giải quyết các vấn đề với các công ty gây khó khăn trong việc hủy bỏ và là một phần của nỗ lực rộng lớn hơn nhằm bảo vệ người tiêu dùng khỏi các hành vi lạm dụng.",
      "Mặc dù một số người tin rằng điều này nên được Quốc hội ban hành, quy định này dự kiến sẽ đối mặt với các thách thức pháp lý, với các tiểu bang như California đã có các luật tương tự."
    ],
    "points": 819,
    "commentCount": 403,
    "retryCount": 0,
    "time": 1729084144
  },
  {
    "id": 41853810,
    "title": "Graphite, một ứng dụng thiết kế thủ tục 2D lấy cảm hứng từ Blender viết bằng Rust",
    "originLink": "https://graphite.rs/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41853810",
    "commentBody": "",
    "originSummary": [
      "Một công cụ thiết kế 2D và chỉnh sửa hình ảnh mới đang được phát triển để cạnh tranh với Adobe, với tiến bộ đáng kể đã đạt được trong bản cập nhật Q3 gần đây.",
      "The project đã tham gia Google Summer of Code (GSoC), một chương trình hỗ trợ phát triển mã nguồn mở, và đang tìm kiếm các nhà phát triển Rust cho sự tham gia trong tương lai.",
      "Khuyến khích các nhà phát triển quan tâm xem xét báo cáo tiến độ quý 3 và cân nhắc nộp đơn xin thực tập trong chu kỳ GSoC tiếp theo."
    ],
    "commentSummary": [
      "Graphite là một ứng dụng thiết kế 2D theo quy trình lấy cảm hứng từ Blender, được phát triển bằng Rust, và nhằm cung cấp một sự thay thế cho các công cụ thiết kế 2D của Adobe.",
      "Dự án, mã nguồn mở và đang tìm kiếm sự đóng góp từ các nhà phát triển Rust, đã được phát triển trong ba năm và gần đây đã tham gia vào Google Summer of Code.",
      "Hiện tại tập trung vào chỉnh sửa vector, Graphite dự định mở rộng sang chỉnh sửa raster vào năm tới, nhấn mạnh vào quy trình xử lý dữ liệu theo chương trình với mã tùy chỉnh và chỉnh sửa dựa trên nút."
    ],
    "points": 696,
    "commentCount": 106,
    "retryCount": 0,
    "time": 1729031526
  },
  {
    "id": 41856883,
    "title": "MacOS đôi khi rò rỉ lưu lượng sau khi cập nhật hệ thống",
    "originLink": "https://mullvad.net/en/blog/macos-sometimes-leaks-traffic-after-system-updates",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41856883",
    "commentBody": "",
    "originSummary": [
      "Sau khi cập nhật hệ thống, macOS có thể rò rỉ lưu lượng mạng, có khả năng cho phép một số ứng dụng vượt qua các đường hầm VPN do các vấn đề về tường lửa.",
      "Vấn đề này đã được quan sát thấy kể từ phiên bản macOS 14.6, ảnh hưởng đến các ứng dụng, bao gồm cả những ứng dụng của Apple, và khởi động lại có thể tạm thời giải quyết nó.",
      "Người dùng có thể kiểm tra rò rỉ bằng cách thêm một quy tắc tường lửa để chặn tất cả lưu lượng; nếu lưu lượng vượt qua VPN, có một rò rỉ và cần có biện pháp khắc phục."
    ],
    "commentSummary": [
      "Những bản cập nhật MacOS có thể gây ra rò rỉ lưu lượng, đặc biệt trên các thiết bị của Apple, vì chúng có thể bỏ qua VPN cho một số dịch vụ như App Store. - Các bản cập nhật có thể đặt lại cài đặt, bao gồm cả tường lửa, và có thể yêu cầu truy cập internet, có khả năng gửi dữ liệu đến các máy chủ AI, khiến một số người dùng tắt bộ định tuyến trong quá trình cập nhật. - Mặc dù có những lo ngại này, MacOS vẫn được một số người ưa chuộng vì phần cứng và tính năng của nó, trong khi những người khác khuyến nghị Linux hiện đại như một sự thay thế."
    ],
    "points": 350,
    "commentCount": 183,
    "retryCount": 0,
    "time": 1729067843
  },
  {
    "id": 41852821,
    "title": "CapibaraZero: Một lựa chọn thay thế rẻ tiền cho FlipperZero dựa trên ESP32-S3",
    "originLink": "https://capibarazero.github.io/docs/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41852821",
    "commentBody": "",
    "originSummary": [
      "CapibaraZero được giới thiệu như một giải pháp thay thế tiết kiệm chi phí cho FlipperZero™, sử dụng các bảng mạch của Espressif, nổi tiếng với khả năng giao tiếp không dây.",
      "Bản dự án cung cấp tài liệu và tải xuống firmware, cho thấy sự phát triển và hỗ trợ tích cực cho người dùng quan tâm đến việc khám phá lựa chọn thay thế này.",
      "Phát hành này có ý nghĩa đối với những người đam mê công nghệ đang tìm kiếm các lựa chọn tiết kiệm chi phí cho các chức năng tương tự được cung cấp bởi thiết bị FlipperZero™."
    ],
    "commentSummary": [
      "CapibaraZero được giới thiệu như một giải pháp thay thế tiết kiệm chi phí cho FlipperZero, sử dụng chip ESP32-S3 để khắc phục các hạn chế như giá cao và thiếu WiFi tích hợp.",
      "Theo dõi dự án này ngày càng tăng do tiềm năng của nó khi kết hợp với máy tính đơn bo mạch và được cấp nguồn bởi pin lipo, cùng với các cuộc thảo luận về việc tích hợp LoRa để có khả năng hoạt động ngoài lưới điện.",
      "Xung quanh CapibaraZero có nhiều sự hào hứng, được hỗ trợ bởi các thiết kế PCB có sẵn và các tệp STL để in 3D, mặc dù cộng đồng phần mềm mạnh mẽ của FlipperZero vẫn là một lợi thế đáng chú ý."
    ],
    "points": 346,
    "commentCount": 73,
    "retryCount": 0,
    "time": 1729024481
  },
  {
    "id": 41857032,
    "title": "Quỹ FLOSS cho các dự án mã nguồn mở và miễn phí",
    "originLink": "https://floss.fund/blog/announcing-floss-fund/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41857032",
    "commentBody": "",
    "originSummary": [
      "Giám đốc công nghệ của Zerodha, Kailash Nadh, đã công bố ra mắt FLOSS/fund, một quỹ hàng năm trị giá 1 triệu đô la để hỗ trợ các dự án Phần mềm Tự do và Mã nguồn Mở (FOSS) trên toàn thế giới.",
      "Theo quỹ này, mỗi người nhận sẽ được cung cấp từ 10.000 đến 100.000 đô la, với tổng số tiền 1 triệu đô la được phân phối hàng năm, nhằm duy trì các dự án FOSS và truyền cảm hứng cho các doanh nghiệp khác đóng góp.",
      "Một tệp funding.json mới sẽ được sử dụng để giúp các dự án truyền đạt nhu cầu tài chính của họ, và các đơn đăng ký được mở trên toàn cầu, được quản lý bởi một đội ngũ chuyên trách."
    ],
    "commentSummary": [
      "FLOSS/fund cung cấp hỗ trợ tài chính cho các dự án miễn phí và mã nguồn mở, với quy trình đăng ký đơn giản yêu cầu một tệp funding.json trong kho lưu trữ của dự án. Quỹ này cung cấp lên đến 100.000 đô la mỗi dự án hàng năm, ưu tiên các dự án được sử dụng rộng rãi và có tác động đáng kể. Sáng kiến này được hỗ trợ bởi Zerodha, một nền tảng đầu tư nổi tiếng của Ấn Độ, và đã khơi dậy các cuộc thảo luận về tính bền vững của việc tài trợ và các mô hình sáng tạo để hỗ trợ các dự án và người đóng góp mã nguồn mở."
    ],
    "points": 345,
    "commentCount": 93,
    "retryCount": 0,
    "time": 1729069345
  },
  {
    "id": 41853637,
    "title": "Vì sao chúng ta không còn sử dụng mái hiên nữa (2022)",
    "originLink": "https://thecraftsmanblog.com/why-dont-we-use-awnings-anymore/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41853637",
    "commentBody": "",
    "originSummary": [
      "Ai hiên đã được sử dụng trong lịch sử để ngăn chặn sự gia tăng nhiệt mặt trời, cung cấp sưởi ấm thụ động vào mùa đông và làm mát vào mùa hè, nhưng đã không còn được ưa chuộng với sự ra đời của điều hòa không khí vào giữa thế kỷ 20.",
      "Việc giảm sử dụng mái hiên là do chi phí năng lượng thấp và tập trung vào cách nhiệt, dẫn đến việc chúng hiện nay chủ yếu được sử dụng cho biển hiệu và che phủ sân hiên.",
      "Giá năng lượng tăng có thể dẫn đến sự hồi sinh của sự phổ biến của mái hiên như một phương pháp tiết kiệm chi phí để giảm chi phí sưởi ấm và làm mát."
    ],
    "commentSummary": [
      "Ai hiên đã trở nên kém phổ biến hơn do sự phổ biến của điều hòa không khí và những tiến bộ trong công nghệ cửa sổ như kính phát xạ thấp (low-e).",
      "Họ thường được coi là cần bảo trì và có vẻ ngoài lỗi thời, khiến nhiều người chọn các lựa chọn thay thế như rèm hoặc màn cửa.",
      "Mặc dù có những xu hướng này, mái hiên vẫn có lợi cho hiệu quả năng lượng và vẫn được sử dụng ở các khu vực mà việc làm mát tự nhiên là ưu tiên."
    ],
    "points": 328,
    "commentCount": 282,
    "retryCount": 0,
    "time": 1729030295
  },
  {
    "id": 41857754,
    "title": "Internet Archive đã hoạt động trở lại",
    "originLink": "https://arstechnica.com/tech-policy/2024/10/the-internet-archive-and-its-916-billion-saved-webpages-are-back-online/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41857754",
    "commentBody": "",
    "originSummary": [
      "Máy Wayback của Internet Archive đã hoạt động trở lại ở chế độ chỉ đọc sau khi bị tấn công DDoS (Tấn công Từ chối Dịch vụ Phân tán).",
      "Người sáng lập Brewster Kahle cho biết mặc dù Wayback Machine vẫn đang hoạt động, nhưng có thể cần bảo trì thêm, và các dịch vụ khác, bao gồm tính năng \"Lưu Trang Ngay\", vẫn chưa hoạt động.",
      "The Internet Archive, tổ chức đã lưu trữ 916 tỷ trang web kể từ năm 1996, đang tập trung vào bảo mật dữ liệu sau khi xảy ra vi phạm dữ liệu ảnh hưởng đến 31 triệu hồ sơ người dùng."
    ],
    "commentSummary": [
      "The Internet Archive đã hoạt động trở lại sau một cuộc tấn công của hacker, nhấn mạnh tầm quan trọng của nó và khơi dậy các cuộc thảo luận về việc phi tập trung hóa để ngăn chặn các gián đoạn trong tương lai.",
      "Người dùng đã tranh luận về những thách thức của việc phi tập trung hóa, chẳng hạn như thiếu người chia sẻ dữ liệu và các rủi ro pháp lý liên quan đến việc lưu trữ nội dung.",
      "Vụ việc đã thúc đẩy các cuộc thảo luận về sự tham gia của Cloudflare và tiềm năng của công nghệ phi tập trung để củng cố Archive, với một số người dùng bày tỏ sự ủng hộ gia tăng thông qua các khoản quyên góp."
    ],
    "points": 302,
    "commentCount": 73,
    "retryCount": 0,
    "time": 1729076991
  },
  {
    "id": 41854405,
    "title": "Redbox đã để lại thông tin cá nhân (PII) trên các máy đã ngừng hoạt động",
    "originLink": "https://digipres.club/@foone/113313955144323780",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41854405",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Việc Redbox không xóa thông tin cá nhân khỏi các máy đã ngừng hoạt động đã làm dấy lên một cuộc tranh luận về việc kỹ thuật quá mức trong phát triển phần mềm, tập trung vào sự đơn giản so với trừu tượng hóa.",
      "Cuộc thảo luận nhấn mạnh tầm quan trọng của việc cân bằng giữa mã hóa thực tiễn với nhu cầu về các hệ thống có thể kiểm tra và mở rộng.",
      "Vụ việc này làm dấy lên những lo ngại đáng kể về an ninh dữ liệu và việc ngừng sử dụng tài sản công nghệ một cách có trách nhiệm, đặc biệt trong các tình huống liên quan đến phá sản của công ty."
    ],
    "points": 250,
    "commentCount": 128,
    "retryCount": 0,
    "time": 1729037722
  },
  {
    "id": 41859012,
    "title": "Du lịch với Apple Vision Pro",
    "originLink": "https://azadux.blog/2024/10/08/traveling-with-apple-vision-pro/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41859012",
    "commentBody": "",
    "originSummary": [
      "Blog của Azad đánh giá Apple Vision Pro cho du lịch, lưu ý trải nghiệm phim sống động và không gian làm việc mở rộng của MacBook là những lợi ích chính. Chế độ Du lịch của Vision Pro giải quyết các vấn đề theo dõi trong các phương tiện di chuyển, và thời lượng pin có thể quản lý được với các nguồn điện bên ngoài. Mặc dù có những thách thức về thoải mái công thái học và xã hội, Azad thấy tiềm năng trong các phiên bản Vision Pro tương lai cho những người thường xuyên đi du lịch, nhấn mạnh sự tương tác giao diện người dùng kín đáo và chức năng trong bóng tối."
    ],
    "commentSummary": [
      "Apple Vision Pro mang đến trải nghiệm du lịch độc đáo nhưng được coi là cồng kềnh, đắt đỏ và có thời lượng pin hạn chế, khiến nó kém thực tế hơn cho việc du lịch so với các lựa chọn thay thế như kính Xreal Air.",
      "Một số du khách thích các thiết bị truyền thống, chẳng hạn như iPad, để giải trí trên chuyến bay do tính thực tế và sự chấp nhận xã hội của chúng.",
      "Tiềm năng cải tiến trong tương lai của Vision Pro được công nhận, nhưng hình thức hiện tại của nó chưa được chấp nhận rộng rãi cho mục đích du lịch."
    ],
    "points": 210,
    "commentCount": 251,
    "retryCount": 0,
    "time": 1729086531
  },
  {
    "id": 41860909,
    "title": "ArchiveBox đang phát triển: tương lai của các kho lưu trữ internet tự lưu trữ",
    "originLink": "https://docs.sweeting.me/s/archivebox-plugin-ecosystem-announcement",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41860909",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "ArchiveBox đang trải qua sự phát triển đáng kể để cải thiện các kho lưu trữ internet tự lưu trữ, tập trung vào tính bền vững và độ tin cậy.",
      "Theo dự án, việc thành lập một tổ chức phát triển hoặc quỹ đang được khám phá và đang xem xét việc thuê thêm thành viên để tăng cường hỗ trợ.",
      "Những tính năng mới, chẳng hạn như ký mã hóa các tệp lưu trữ và hệ thống plugin để cải thiện khả năng tương thích của trang web, đang được phát triển, với sự khuyến khích đóng góp ý kiến từ cộng đồng để tăng cường khả năng chống chịu."
    ],
    "points": 204,
    "commentCount": 42,
    "retryCount": 0,
    "time": 1729095519
  },
  {
    "id": 41855886,
    "title": "I Self-Hosted Llama 3.2 với Coolify trên Máy Chủ Tại Nhà của Tôi",
    "originLink": "https://geek.sg/blog/how-i-self-hosted-llama-32-with-coolify-on-my-home-server-a-step-by-step-guide",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41855886",
    "commentBody": "",
    "originSummary": [
      "Theo bài viết, đây là hướng dẫn tự lưu trữ các ứng dụng Next.js và chạy Llama 3.2 bằng Ollama trên máy chủ gia đình, được thúc đẩy bởi xu hướng chuyển từ Vercel do giá cả. - Các thành phần chính của thiết lập bao gồm sử dụng Coolify để triển khai, tăng tốc GPU với bộ công cụ CUDA, và cấu hình Cloudflare Tunnel để quản lý tên miền. - Hướng dẫn nêu bật những cải tiến đáng kể về thời gian suy luận và cung cấp quy trình chi tiết từng bước để thiết lập các ứng dụng AI với hỗ trợ GPU trên máy chủ gia đình."
    ],
    "commentSummary": [
      "Bài viết thảo luận về việc tự lưu trữ Llama 3.2, một mô hình ngôn ngữ, trên máy chủ gia đình bằng cách sử dụng Coolify, nhấn mạnh lợi ích của việc kiểm soát và bảo mật so với các dịch vụ của bên thứ ba.",
      "Cloudflare được khuyến nghị cho việc lưu trữ các trang web tĩnh nhờ vào thời gian phản hồi nhanh, nhưng người dùng nên lưu ý đến các quy tắc nghiêm ngặt về phục vụ phương tiện của nó và cân nhắc các tùy chọn kết nối an toàn như Cloudflare Tunnels hoặc Tailscale.",
      "Coolify được ghi nhận là một công cụ hữu ích cho việc triển khai ứng dụng, với phiên bản v4 beta sắp tới cho thấy tiềm năng cho các phát triển trong tương lai."
    ],
    "points": 199,
    "commentCount": 86,
    "retryCount": 0,
    "time": 1729056395
  },
  {
    "id": 41858975,
    "title": "Hofstadter về Lisp (1983)",
    "originLink": "https://gist.github.com/jackrusher/5139396",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41858975",
    "commentBody": "",
    "originSummary": [
      "Lisp, được phát triển bởi John McCarthy vào cuối những năm 1950, là một ngôn ngữ lập trình trung tâm cho nghiên cứu AI, nổi tiếng với sự thanh lịch, linh hoạt và tính tương tác của nó. Không giống như các ngôn ngữ khác, Lisp cho phép phản hồi ngay lập tức và phát triển chương trình từng bước, sử dụng ký hiệu Ba Lan độc đáo và tập trung vào việc thao tác danh sách và nguyên tử. Giới thiệu của Douglas Hofstadter về Lisp trong Scientific American nêu bật sức mạnh và tính linh hoạt của nó, với các bài tập và ví dụ minh họa các tính năng cốt lõi của nó, chẳng hạn như các hàm như car và cdr, và khả năng định nghĩa các hàm mới."
    ],
    "commentSummary": [
      "Hofstadter trong bài viết năm 1983 về Lisp nhấn mạnh tính chất vượt thời gian của nó và việc nó bị bỏ qua trong cuốn sách \"Gödel, Escher, Bach\" (GEB) của ông, khơi dậy các cuộc thảo luận về sự thanh lịch toán học của Lisp và ứng dụng của nó trong trí tuệ nhân tạo (AI).",
      "Bài viết và các cuộc thảo luận sau đó khám phá sự phát triển của Lisp, các tính năng độc đáo của nó như tính đồng nhất (mã như dữ liệu) và xử lý ký hiệu, cũng như sự liên quan của nó trong lập trình hiện đại, bao gồm AI, thiết kế hỗ trợ máy tính (CAD), và dịch vụ web.",
      "Độc giả cũng suy ngẫm về sự suy giảm của các bài viết khoa học chuyên sâu trong các ấn phẩm đương đại, so sánh với những cuộc thảo luận chi tiết được tìm thấy trong các tác phẩm cũ hơn."
    ],
    "points": 196,
    "commentCount": 62,
    "retryCount": 0,
    "time": 1729086277
  },
  {
    "id": 41852009,
    "title": "Tất cả các cốt truyện có thể có của các tác giả lớn (2020)",
    "originLink": "https://www.the-fence.com/plots-major-authors/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41852009",
    "commentBody": "",
    "originSummary": [
      "The Fence, một tạp chí có trụ sở tại Vương quốc Anh, cung cấp góc nhìn châm biếm về các chủ đề lặp lại trong cốt truyện văn học của các tác giả lớn.",
      "Bao gồm nhiều mục khác nhau như Tiêu điểm, Đặc điểm, Điều tra, Văn hóa và Tiểu thuyết, phục vụ cho sở thích đa dạng của độc giả.",
      "Đã có các tùy chọn đăng ký, bao gồm cả đăng ký quà tặng, với quyền truy cập kỹ thuật số bắt đầu từ £1.66 mỗi tháng."
    ],
    "commentSummary": [
      "Một chủ đề nhẹ nhàng trên Hacker News hài hước khám phá phong cách viết của các tác giả và lập trình viên nổi tiếng, bao gồm Dan Brown, Terry Pratchett và Stephen King.",
      "Người dùng đóng góp những quan sát dí dỏm về cách các lập trình viên như Linus Torvalds và Grace Hopper tiếp cận việc lập trình, kết hợp các mô típ văn học với sự hài hước trong lập trình.",
      "Cuộc thảo luận có những câu chuyện cười về ngôn ngữ lập trình và những điều kỳ quặc trên mạng xã hội, với những người tham gia thêm vào những góc nhìn hài hước và tham chiếu đến các nội dung hài hước khác."
    ],
    "points": 176,
    "commentCount": 127,
    "retryCount": 0,
    "time": 1729019203
  },
  {
    "id": 41861056,
    "title": "Winamp xóa toàn bộ kho mã nguồn GitHub sau vài tuần đầy khó khăn",
    "originLink": "https://arstechnica.com/gadgets/2024/10/winamp-really-whips-open-source-coders-into-frenzy-with-its-source-release/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41861056",
    "commentBody": "",
    "originSummary": [
      "Winamp đã gỡ bỏ kho mã nguồn GitHub của mình sau khi phát hành một phiên bản có vấn đề bao gồm mã không được phép và các gói độc quyền.",
      "Việc phát hành theo \"Giấy phép Hợp tác Winamp\" đã gặp phải chỉ trích vì quản lý kém, dẫn đến các vấn đề pháp lý và cộng đồng.",
      "Những cựu nhân viên đã nhấn mạnh sự thiếu sót trong việc kiểm toán và xem xét pháp lý, trong khi chủ sở hữu người Bỉ, Llama Group, chưa đưa ra bình luận về tình hình này."
    ],
    "commentSummary": [
      "Winamp đã gỡ bỏ kho mã nguồn trên GitHub của mình sau khi gặp phản ứng dữ dội về các điều khoản cấp phép không rõ ràng, bao gồm các hạn chế về việc tạo nhánh và phân phối các phiên bản đã chỉnh sửa.",
      "Phản ứng tiêu cực của cộng đồng đối với các vấn đề cấp phép này đã dẫn đến việc xóa kho lưu trữ, minh họa những khó khăn trong việc mã nguồn mở phần mềm kế thừa.",
      "Vụ việc này làm nổi bật sự phức tạp của việc cấp phép và sự tham gia của cộng đồng trong các dự án mã nguồn mở, với một số người cho rằng phản ứng của cộng đồng có thể ngăn cản các sáng kiến mã nguồn mở trong tương lai."
    ],
    "points": 161,
    "commentCount": 98,
    "retryCount": 0,
    "time": 1729096455
  },
  {
    "id": 41853411,
    "title": "Trình duyệt Chrome của Google bắt đầu vô hiệu hóa uBlock Origin",
    "originLink": "https://www.pcmag.com/news/googles-chrome-browser-starts-disabling-ublock-origin",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41853411",
    "commentBody": "",
    "originSummary": [
      "Google đang loại bỏ các tiện ích mở rộng \"Manifest V2\" cũ hơn, điều này có thể khiến uBlock Origin ngừng hoạt động trên Chrome, khi quá trình chuyển đổi sang khung Manifest V3 an toàn hơn bắt đầu.",
      "Nhà phát triển Raymond Hill đã xác nhận việc ngừng hỗ trợ, và người dùng đang nhận được thông báo để gỡ bỏ trình chặn quảng cáo, mặc dù một số người vẫn có thể tải xuống.",
      "Trong khi Google khẳng định rằng Manifest V3 hỗ trợ các trình chặn quảng cáo như uBlock Origin Lite, nó thiếu các khả năng đầy đủ của phiên bản gốc, khiến một số người dùng cân nhắc chuyển sang các trình duyệt thay thế như Brave hoặc Firefox."
    ],
    "commentSummary": [
      "Trình duyệt Chrome của Google đang vô hiệu hóa uBlock Origin do chuyển đổi từ Manifest V2 sang V3, điều này hạn chế khả năng chặn quảng cáo.",
      "Quyết định này đã gây ra tranh luận về động cơ của Google, với những người chỉ trích cho rằng nó bị ảnh hưởng bởi lợi ích từ doanh thu quảng cáo của công ty.",
      "Người dùng đang thảo luận về các lựa chọn thay thế, chẳng hạn như chuyển sang Firefox, để duy trì chức năng chặn quảng cáo và giải quyết các mối lo ngại về quyền riêng tư trên internet và sự thống trị thị trường của Google."
    ],
    "points": 159,
    "commentCount": 81,
    "retryCount": 0,
    "time": 1729028519
  }
]
