[
  {
    "id": 40736771,
    "title": "سحب مجلس الاتحاد الأوروبي التصويت على مراقبة الدردشة",
    "originLink": "https://stackdiary.com/eu-council-has-withdrawn-the-vote-on-chat-control/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40736771",
    "commentBody": "",
    "originSummary": [
      "تتناول المقالة أبرز متصفحات الويب التي تعطي الأولوية لخصوصية وأمان المستخدم، مسلطة الضوء على ميزاتها وفوائدها.",
      "يوفر مقارنة بين المتصفحات مثل بريف وفايرفوكس وتور، التي تُعرف بحمايتها القوية للخصوصية وإجراءات الأمان.",
      "التركيز هو على كيفية تعامل هذه المتصفحات مع بيانات المستخدم، وحجب المتعقبات، وتقديم ميزات أمان محسنة للحماية من التهديدات عبر الإنترنت."
    ],
    "commentSummary": [
      "سحب مجلس الاتحاد الأوروبي التصويت على اقتراح مراقبة الدردشة، الذي واجه معارضة كبيرة، خاصة من المسؤولين الألمان.",
      "الاقتراح، الذي تعرض للانتقاد بسبب نقص الخبرة التقنية والمخاطر المحتملة، قد يعاود الظهور عندما تتولى المجر رئاسة الاتحاد الأوروبي.",
      "على الرغم من الانسحاب، لا تزال القضية غير محلولة ويمكن إعادة النظر فيها في المستقبل."
    ],
    "points": 773,
    "commentCount": 361,
    "retryCount": 0,
    "time": 1718876741
  },
  {
    "id": 40737294,
    "title": "تيتريس كخط",
    "originLink": "https://erikdemaine.org/fonts/tetris/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40737294",
    "commentBody": "",
    "originSummary": [
      "صمم إريك ومارتن ديماني خطًا مستوحى من لعبة تيتريس حيث يتم بناء كل حرف ورقم من قطع تيتريس (I, J, L, O, S, T, Z).",
      "يستخدم تصميم الخط برنامج BurrTools ويلتزم بقواعد لعبة تيتريس، بما في ذلك نظام الدوران الفائق لتدوير القطع الأولية.",
      "الخط هو جزء من تحليل رياضي للعبة تيتريس، يبرز طبيعتها NP-complete، وقد استُلهم من تعاون خلال BRIDGES 2017."
    ],
    "commentSummary": [
      "إريك ديميين قد أنشأ خطًا حيث يتكون كل حرف ورقم من قطع تيتريس، مصمم يدويًا بمساعدة برنامج BurrTools.",
      "تمت مشاركة عرض توضيحي لخط يلعب لعبة تتريس باستخدام Harfbuzz shaper مع WebAssembly، مما يعرض استخدامًا مبتكرًا لتقنيات الويب.",
      "لقد حظي المشروع باهتمام كبير وردود فعل إيجابية من مجتمع التكنولوجيا، مما يبرز جِدَّته والتقاطع الإبداعي بين الطباعة والألعاب."
    ],
    "points": 432,
    "commentCount": 66,
    "retryCount": 0,
    "time": 1718881876
  },
  {
    "id": 40738916,
    "title": "كلود 3.5 سونيت",
    "originLink": "https://www.anthropic.com/news/claude-3-5-sonnet",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40738916",
    "commentBody": "",
    "originSummary": [
      "تم إطلاق Claude 3.5 Sonnet، الأول في عائلة نموذج Claude 3.5، حيث يقدم أداءً متفوقًا مقارنةً بنماذج المنافسين وClaude 3 Opus، وهو متاح على Claude.ai، وتطبيق Claude على نظام iOS، ومن خلال واجهات برمجة التطبيقات المختلفة.",
      "يتفوق النموذج في مهام التفكير على مستوى الدراسات العليا، وإتقان البرمجة، ومهام التفكير البصري، مما يجعله مناسبًا للمهام المعقدة مثل دعم العملاء وسير العمل متعدد الخطوات، كما يقدم ميزات جديدة مثل Artifacts لتوليد وتحرير المحتوى الديناميكي.",
      "يتم إعطاء الأولوية للسلامة والخصوصية من خلال اختبارات صارمة وتقييمات خارجية، وتشمل الخطط المستقبلية إطلاق كلود 3.5 هايكو وكلود 3.5 أوبوس، بالإضافة إلى ميزات جديدة مثل الذاكرة لتجارب مخصصة."
    ],
    "commentSummary": [
      "تم إصدار Claude 3.5 Sonnet، وحظي بإشادة لأدائه، خاصة في مهام البرمجة، حيث يفضل بعض المستخدمين استخدامه على GPT-4o بسبب النتائج الأفضل والاستجابات الأسرع.",
      "لاحظ المستخدمون غياب ميزة مشاركة المحادثات وتطبيق للأندرويد كعيوب، لكن النموذج لا يزال يُشاد به لسرعته وجودته واستجاباته الأكثر شبهًا بالبشر مقارنة بنماذج GPT.",
      "على الرغم من بعض المشاكل البسيطة، فإن الاستقبال العام إيجابي، حيث يشعر العديد من المستخدمين بالحماس تجاه التحسينات والميزات الجديدة التي قدمها النموذج الجديد من Anthropic."
    ],
    "points": 427,
    "commentCount": 175,
    "retryCount": 0,
    "time": 1718892226
  },
  {
    "id": 40731922,
    "title": "ظهور X لأول مرة قبل 40 عامًا (1984)",
    "originLink": "https://www.talisman.org/x-debut.shtml",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40731922",
    "commentBody": "",
    "originSummary": [
      "نظام X Window، الذي طوره روبرت دبليو شيفلر، ظهر لأول مرة في 19 يونيو 1984، وهو مصمم لجهاز VS100، حيث يقدم ضعف سرعة سابقه، W.",
      "لقد تبنى مختبر علوم الحاسوب (LCS) النظام X، ويقوم ببناء التطبيقات عليه، ويشجع الآخرين الذين يستخدمون النظام W على التحول إلى النظام X للحصول على أداء وتجارب أفضل.",
      "تشمل الواجهات الحالية CLU و Argus، مع واجهة C قيد التطوير؛ التطبيقات الموجودة هي محرر نصوص (TED)، وواجهة إدخال/إخراج Argus، ومدير نوافذ أساسي، على الرغم من أن التوثيق لا يزال مطلوبًا."
    ],
    "commentSummary": [
      "احتفل نظام X11، وهو نظام نوافذ لعرض الصور النقطية، بالذكرى الأربعين لتأسيسه، حيث تم إطلاقه لأول مرة في عام 1984.",
      "شارك المستخدمون تجاربهم الحنينية، بدءًا من تكوين خطوط النموذج وإدارة أنظمة يونكس إلى تطور مختبرات الحاسوب والانتقال إلى لينكس.",
      "أبرزت المناقشات تراجع المختبرات الحاسوبية التقليدية بسبب انتشار أجهزة الكمبيوتر المحمولة ذات الأسعار المعقولة والتأثير الكبير لـ X11 على العديد من المهن."
    ],
    "points": 309,
    "commentCount": 102,
    "retryCount": 0,
    "time": 1718827778
  },
  {
    "id": 40733160,
    "title": "أنظمة الوسائط الفائقة",
    "originLink": "https://hypermedia.systems/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40733160",
    "commentBody": "",
    "originSummary": [
      "تقدم htmx و Hyperview طرقًا ثورية لتبسيط تطوير تطبيقات الويب، مما يلغي الحاجة إلى أطر عمل تطبيق الصفحة الواحدة (SPA).",
      "تُعد هذه الأدوات مثالية لمطوري الويب الذين يرغبون في التركيز على البساطة، وتعزيز فهمهم لأساسيات الويب، أو استكشاف الوسائط الفائقة وREST (نقل الحالة التمثيلية).",
      "الموارد متاحة عبر الإنترنت مجانًا، مع خيارات لشراء نسخ مطبوعة أو كتب إلكترونية على أمازون."
    ],
    "commentSummary": [
      "توثيق HTMX مفيد كمرجع ولكنه يفتقر إلى برنامج تعليمي شامل، وهو ما يهدف هذا الكتاب إلى تقديمه.",
      "يُوصى باستخدام HTMX للأدوات الداخلية والمواقع الإلكترونية ذات الديناميكية البسيطة، ولكنه قد لا يكون مناسبًا للجلسات الطويلة على الأجهزة المحمولة بسبب تحسينات المتصفح.",
      "يمكن لمزيج من JavaScript (JS) الفانيليا أو Alpine.js أن يعزز مواقع HTMX، وأحيانًا يكون إطار عمل كامل مثل Vue أو React ضروريًا للأقسام الديناميكية للغاية."
    ],
    "points": 227,
    "commentCount": 82,
    "retryCount": 0,
    "time": 1718836781
  },
  {
    "id": 40736577,
    "title": "البرمجيات الحرة اختطفت حياة فيليب هازل",
    "originLink": "https://lwn.net/SubscriberLink/978463/608c876c1153fd31/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40736577",
    "commentBody": "",
    "originSummary": [
      "فيليب هازل، مبتكر Exim MTA وPCRE، قد قام بصيانة PCRE وخليفته PCRE2 لأكثر من 27 عامًا وهو الآن يبحث عن خليفة لـ PCRE2.",
      "تشمل أبرز محطات مسيرة هازل المهنية مساهمات كبيرة في أنظمة يونكس وتطوير برامج معتمدة على نطاق واسع مثل Exim وPCRE، والتي تُستخدم في مشاريع رئيسية مثل Apache HTTPD وPostfix.",
      "يقدر المجتمع المقالة ويدعو إلى المزيد من الميزات حول مطوري المصادر المفتوحة، مسلطًا الضوء على التأثير العملي والتحديات في الحفاظ على مثل هذه المشاريع."
    ],
    "commentSummary": [
      "تسلط تجربة فيليب هازل الضوء على التحديات في العثور على مشرفين جدد لمشاريع البرمجيات الحرة، خاصة تلك التي تتم صيانتها بشكل جيد مثل PCRE2.",
      "تشمل المخاوف إضافة القائمين الجدد على الصيانة ميزات غير ضرورية ونقص الحوافز لصيانة البرامج \"المنتهية\"، مما يؤدي إلى إرهاق المتطوعين والتوتر.",
      "تتناول المناقشة أيضًا إمكانية استهداف أجهزة الاستخبارات للمشاريع مفتوحة المصدر والصعوبات في التحقق من المشرفين الجدد."
    ],
    "points": 221,
    "commentCount": 41,
    "retryCount": 0,
    "time": 1718874865
  },
  {
    "id": 40733615,
    "title": "لا أحد يعرف ما الذي يجري",
    "originLink": "https://www.raptitude.com/2024/06/nobody-knows-whats-going-on/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40733615",
    "commentBody": "",
    "originSummary": [
      "خطأ أحد المراسلين بشأن تقاعد المؤلف في سن 33 يوضح مدى سهولة انتشار المعلومات الخاطئة، خاصة عبر الإنترنت.",
      "يشرح تأثير جيل-مان النسياني سبب ثقة الناس في وسائل الإعلام بشأن المواضيع غير المألوفة على الرغم من إدراكهم للأخطاء في المجالات المألوفة.",
      "المعرفة الموثوقة غالبًا ما تكون نادرة وتأتي من أولئك الذين يستثمرون بعمق في مجالات محددة، لكن البشر عمومًا مدفوعون بالحوافز الاجتماعية والعاطفية بدلاً من الدقة."
    ],
    "commentSummary": [
      "تسلط المناقشة الضوء على الظاهرة التي يدرك فيها الناس عدم دقة المقالات حول المواضيع التي يعرفونها جيدًا، مما يؤدي إلى الشك في المقالات حول المواضيع التي لا يعرفونها.",
      "يُشار إلى هذا غالبًا بتأثير جيل-مان للنسيان، حيث ينسى الناس الأخطاء في مقال واحد عند قراءة مقالات أخرى في نفس المنشور.",
      "تتناول المحادثة أيضًا الآثار الأوسع للمعلومات المضللة والتحديات المتعلقة بتمييز المعلومات الدقيقة في وسائل الإعلام والمناقشات عبر الإنترنت."
    ],
    "points": 206,
    "commentCount": 216,
    "retryCount": 0,
    "time": 1718841988
  },
  {
    "id": 40740021,
    "title": "لقد صنعت لعبة ألغاز تقدم بلطف ألغاز الرياضيات المفضلة لدي",
    "originLink": "https://www.rahulilango.com/coloring/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40740021",
    "commentBody": "",
    "originSummary": [
      "تهدف اللعبة إلى إثارة الفضول حول الرياضيات من خلال الأسئلة التفاعلية والأفكار، بدلاً من تقديم تفسيرات مفصلة.",
      "تشمل الميزات التقنية نقاط تقاطع الأعداد الصحيحة، ورسومات خرائط شبه دقيقة باستخدام topojson، وخوارزمية التراجع لتلوين الرسوم البيانية، واكتشاف المضلعات باستخدام turf.js.",
      "تشمل المقايضات تأخير الروابط التعليمية للحفاظ على تدفق اللعبة واستخدام خرائط أبسط لضمان ملاءمتها للأجهزة المحمولة."
    ],
    "commentSummary": [
      "تم إنشاء لعبة ألغاز لتقديم غموض الرياضيات بشكل تفاعلي، بهدف إثارة الفضول بدلاً من تقديم تفسيرات مفصلة.",
      "تشمل الجوانب التقنية استخدام topojson للحصول على خرائط دقيقة، وخوارزمية التراجع لتلوين الرسوم البيانية، وturf.js لتحويل مقاطع الخطوط إلى مضلعات.",
      "لقد لاقت اللعبة استحسانًا كبيرًا، حيث استمتع المستخدمون بتجربة التعلم التفاعلية وقدموا ملاحظات لتحسينها، مثل تحسين التوافق مع الأجهزة المحمولة وتوضيح الشروحات."
    ],
    "points": 195,
    "commentCount": 55,
    "retryCount": 0,
    "time": 1718898319
  },
  {
    "id": 40735743,
    "title": "أقدم نبيذ أبيض في العالم عُثر عليه في قبر من القرن الأول في إسبانيا",
    "originLink": "https://doi.org/10.1016/j.jasrep.2024.104636",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40735743",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "تم اكتشاف أقدم نبيذ أبيض في العالم في قبر روماني من القرن الأول في كارمونا، جنوب إسبانيا.",
      "يُعتبر النبيذ، الذي وُجد في شكل سائل محمر داخل جرة رماد، أقدم نبيذ قديم محفوظ في شكل سائل.",
      "يُنسب الحفاظ على النبيذ إلى الختم المثالي ودرجات الحرارة المستقرة تحت الأرض، على الرغم من أن القبر قد شهد العديد من الأحداث التاريخية."
    ],
    "points": 180,
    "commentCount": 50,
    "retryCount": 0,
    "time": 1718866681
  },
  {
    "id": 40733705,
    "title": "OSRD: مصمم السكك الحديدية مفتوح المصدر",
    "originLink": "https://osrd.fr/en/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40733705",
    "commentBody": "",
    "originSummary": [
      "تطبيق ويب مفتوح المصدر لتصميم السكك الحديدية وتحليل السعة وجدولة المواعيد متاح الآن على GitHub.",
      "تشمل الميزات الرئيسية البنية التحتية للسكك الحديدية وتصميم الجداول الزمنية، وتحليل السعة، واكتشاف النزاعات، والتخطيط قصير الأجل مع إضافة القطارات تلقائيًا.",
      "المشروع مجاني للاستخدام والتطوير والتوزيع، مع التركيز على اتخاذ القرارات الجماعية ودعم تنسيقات البنية التحتية المخصصة وأنظمة الإشارات."
    ],
    "commentSummary": [
      "OSRD (مصمم السكك الحديدية مفتوح المصدر) هو أداة احترافية لتصميم السكك الحديدية، مدعومة من الاتحاد الأوروبي وفرنسا، وتم عرضها في محاضرة في FOSDEM.",
      "يهدف الأداة إلى التعاون في الوقت الفعلي بين كيانات متعددة، باستخدام نهج قائم على الويب لتسهيل الوصول والقدرة على التوسع.",
      "تم تصميم البرنامج ليكون بديهيًا ولكنه قد يتطلب بعض الإلمام بتخطيط السكك الحديدية؛ فهو يتضمن ميزات مثل تقييم متانة الجداول الزمنية تلقائيًا باستخدام المحاكاة العشوائية."
    ],
    "points": 172,
    "commentCount": 34,
    "retryCount": 0,
    "time": 1718842860
  },
  {
    "id": 40737308,
    "title": "وهم إعادة تدوير البلاستيك المتقدمة",
    "originLink": "https://www.propublica.org/article/delusion-advanced-chemical-plastic-recycling-pyrolysis",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40737308",
    "commentBody": "",
    "originSummary": [
      "تدعو صناعة البلاستيك إلى استخدام التحلل الحراري، وهي طريقة تستخدم الحرارة لتفكيك البلاستيك إلى مكوناته الجزيئية، كحل لمشكلة النفايات البلاستيكية.",
      "على الرغم من الادعاءات، فإن التحلل الحراري غير فعال، حيث ينتج كمية ضئيلة من البلاستيك المعاد تدويره ومعظمها مواد كيميائية ووقود غير قابلة لإعادة التدوير.",
      "تستخدم الصناعة محاسبة معقدة للمبالغة في محتوى المنتجات المعاد تدويرها، مما قد يضلل المستهلكين بشأن فعالية إعادة التدوير الكيميائي."
    ],
    "commentSummary": [
      "مقالة ProPublica بعنوان \"وهم إعادة تدوير البلاستيك المتقدمة\" تثير جدلاً حول فعالية إعادة تدوير البلاستيك، حيث يجادل البعض بأنها تؤدي إلى المزيد من التلوث وأنها غير فعالة إلى حد كبير.",
      "تشمل البدائل المقترحة تحسين إدارة مكبات النفايات، وتقليل استخدام البلاستيك، وتحسين تكنولوجيا التغليف، إلى جانب تغييرات نظامية مثل فرض ضرائب على المنتجين لتحفيزهم على تقليل استخدام البلاستيك.",
      "تؤكد المناقشة على الحاجة إلى العمل الجماعي وتحسين ممارسات إدارة النفايات لمعالجة القضايا البيئية."
    ],
    "points": 167,
    "commentCount": 92,
    "retryCount": 0,
    "time": 1718881956
  },
  {
    "id": 40737508,
    "title": "يجب على NPM و NodeJS بذل المزيد من الجهد لجعل استخدام وحدات ES أسهل",
    "originLink": "https://borischerny.com/javascript,/typescript/2024/06/19/ES-Modules-Are-A-Mess.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40737508",
    "commentBody": "",
    "originSummary": [
      "يسلط مدونة بوريس تشيرني الضوء على صعوبات استخدام وحدات ES في NodeJS وNPM، خاصة لأولئك العائدين من لغات أخرى مثل بايثون وهاك.",
      "على الرغم من تقديم وحدات ES لتحسين أوقات تحميل الشفرات، فإن تبنيها منخفض، حيث يستخدمها فقط 9-27% من المشاريع وأقل من 6% من الملفات تعلن عنها عبر امتدادات محددة.",
      "يقترح تشيرني تبسيط النظام البيئي عن طريق إزالة امتدادات .mjs و .cjs، وجعل type=module هو الافتراضي في package.json، وترقية المكتبات إلى وحدات ES، وفي النهاية التخلص التدريجي من require و module.exports في NodeJS."
    ],
    "commentSummary": [
      "يُشجع استخدام NPM و NodeJS لتبسيط استخدام وحدات ES لتسهيل التبني دون الحاجة إلى إعادة هيكلة واسعة النطاق.",
      "يدعم Node.js 22 وحدات ES باستخدام العلم `--experimental-require-module`، لكن الانتقال لا يزال يمثل تحديًا للعديد من المشاريع.",
      "يقترح المستخدمون حلولًا مثل `importSync()` لسد الفجوة بين CommonJS وES modules، مما يثير نقاشات مستمرة حول أفضل نهج لتحديث النظام البيئي."
    ],
    "points": 158,
    "commentCount": 129,
    "retryCount": 0,
    "time": 1718883626
  },
  {
    "id": 40737349,
    "title": "Curl موجود داخل 22,734 لعبة على Steam",
    "originLink": "https://daniel.haxx.se/blog/2024/06/20/inside-22734-steam-games/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40737349",
    "commentBody": "",
    "originSummary": [
      "يُستخدم cURL وlibcurl في 22,734 من أصل 91,559 لعبة على Steam، مما يشكل نسبة 24.8% من العناوين، وفقًا لـ SteamDB.",
      "تؤكد هذه البيانات التبني الكبير لأداة cURL في صناعة الألعاب، وهو ما كان يُشاع سابقًا ولكنه لم يكن مؤكدًا.",
      "الاستخدام الواسع لـ cURL في الألعاب يبرز أهميته وموثوقيته كأداة للمطورين."
    ],
    "commentSummary": [
      "يتم دمج Curl في 22,734 لعبة على Steam وهو مكتبة HTTP للمنصات المكتبية في Unreal Engine، مما يبرز استخدامه الواسع في صناعة الألعاب.",
      "تتناول التدوينة تصميم واجهة برمجة تطبيقات curl، حيث يشكك بعض المستخدمين فيها بينما يدافع آخرون عن وظيفتها وموثوقيتها.",
      "هناك نقص ملحوظ في الدعم المالي لمشروع cURL من الاستوديوهات المربحة، مما يبرز التحديات في تأمين المساهمات للمشاريع مفتوحة المصدر على الرغم من ترخيصها المتساهل."
    ],
    "points": 132,
    "commentCount": 62,
    "retryCount": 0,
    "time": 1718882333
  },
  {
    "id": 40732490,
    "title": "Unique3D: توليد ثلاثي الأبعاد من صورة واحدة",
    "originLink": "https://github.com/AiuniAI/Unique3D",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40732490",
    "commentBody": "",
    "originSummary": [
      "تقدم Unique3D طريقة لتوليد شبكات ثلاثية الأبعاد عالية الدقة من صور ذات منظور واحد في غضون 30 ثانية فقط، مما يجعلها تقدمًا كبيرًا في مجال النمذجة ثلاثية الأبعاد.",
      "المشروع لا يزال قيد التطوير، مع خطط لإصدار الأوزان، وعرض توضيحي محلي باستخدام Gradio، ودليل تفصيلي، ودعم لمختلف المنصات بما في ذلك ويندوز وDocker.",
      "يتم توفير تعليمات الإعداد لكل من لينكس وويندوز، ويعترف المشروع بمساهمات من مشاريع بارزة أخرى مثل Stable Diffusion وWonder3d."
    ],
    "commentSummary": [
      "Unique3D هو أداة جديدة تولد نماذج ثلاثية الأبعاد من صورة واحدة، مما يثير اهتمام عشاق التكنولوجيا والفنانين ثلاثيي الأبعاد.",
      "يجادل النقاد بأن الأداة رغم ادعائها بأنها ذات \"جودة عالية\"، تفتقر إلى ميزات أساسية مثل الطوبولوجيا القابلة للاستخدام، وإعادة الطوبولوجيا (ريتوپو)، وتفكيك الأشعة فوق البنفسجية، وهي أمور حاسمة لنماذج بجودة الإنتاج.",
      "تسلط المناقشة الضوء على الحاجة إلى أدوات الذكاء الاصطناعي لمعالجة المخاوف العملية للمحترفين في مجال التصميم ثلاثي الأبعاد بدلاً من مجرد تحقيق معايير عالية في الأوراق البحثية."
    ],
    "points": 128,
    "commentCount": 30,
    "retryCount": 0,
    "time": 1718832003
  },
  {
    "id": 40739710,
    "title": "تصفية أتكينسون",
    "originLink": "https://beyondloom.com/blog/dither.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40739710",
    "commentBody": "",
    "originSummary": [
      "كان جهاز ماكنتوش الأصلي، الذي أُصدر في عام 1984، يتميز بشاشة عرض بالأبيض والأسود بدقة 72 نقطة في البوصة وبدقة 512x342، وكان قادرًا على عرض محطة طرفية بعمود 80 مع شريط تمرير.",
      "تقنيتان شائعتان للتنقيط تُستخدمان لمحاكاة التدرج الرمادي على هذا العرض هما تقنية فلويد-شتاينبرغ وتقنية أتكينسون، وكلاهما لهما تطبيقات جافا سكريبت للاستخدام الحديث.",
      "توزع تقنية التوزيع النقطي لفلويد-شتاينبرغ أخطاء التكميم على البكسلات المجاورة، بينما تنشر تقنية التوزيع النقطي لأتكينسون، التي طورها بيل أتكينسون، الأخطاء في نمط أوسع، مما يحافظ على ثلاثة أرباع الخطأ لتحقيق تباين أغنى."
    ],
    "commentSummary": [
      "يتم مناقشة تقنية التوزيع النقطي لأتكينسون، وهي تقنية تُستخدم لإنشاء صور ذات لوحات ألوان محدودة، من حيث تطبيقاتها التاريخية والحديثة.",
      "تمت الإشادة بالتقنية، التي تم تطويرها في الأصل لأجهزة ماكنتوش، لقدرتها على الحفاظ على جودة الصورة في البيئات ذات الألوان المنخفضة، مثل شاشات الكمبيوتر المبكرة وشاشات الحبر الإلكتروني الحديثة.",
      "تسلط المناقشة الضوء على الأهمية المستمرة لتقنية التدرج في مجالات مختلفة، بما في ذلك تشغيل الفيديو الرقمي، وسائل الإعلام المطبوعة، وألعاب الفيديو القديمة، مع التأكيد على دورها في منع مشاكل مثل تدرج الألوان والتأثيرات البصرية غير المرغوب فيها."
    ],
    "points": 118,
    "commentCount": 47,
    "retryCount": 0,
    "time": 1718896707
  }
]
