[
  {
    "id": 36231313,
    "timestamp": 1686162828,
    "title": "Windows 11 calls a zip file a 'postcode file' in UK English",
    "url": "https://twitter.com/JymFox/status/1665799627377975300",
    "hn_url": "http://news.ycombinator.com/item?id=36231313",
    "content": "Thread ReaderOne-click sign-up and loginSign up or login to access your unrolled and bookmarked threads (or PDF archives if you are a Premium member!)Login with TwitterLogin with EmailLogin above to accept Thread Reader App'sTerms of Service and Privacy PolicyHelp | About | TOS | Privacy | Twitter Files",
    "summary": "",
    "hn_title": "Windows 11 calls a zip file a 'postcode file' in UK English",
    "original_title": "Windows 11 calls a zip file a 'postcode file' in UK English",
    "score": 660,
    "hn_content": "A tweet points out that Windows 11 refers to a zip file as a 'postcode' file in UK English, sparking a discussion on regionalThe conversation revolves around automating text replacements using either regex or AI-based language models like GPT-4. Some argue that AI-based language models are better because they understand how language works, whereas regex fails to account for linguistic nuances. Others argue that it's easier to use regex, and paying an editor to proofread is better than paying a programmer to waste time. There are also examples of mistranslations in media due to lack of context or cultural knowledge.There is no meaningful content in this post.The discussion on the forum revolves around various file compression tools like WinRAR, 7-Zip, WinAce, and Peazip, their features, advantages, and limitations. Users share their experiences and opinions regarding these tools. Additionally, there is some discussion on language-related issues arising from localizing technology products.A discussion on the use of language localization in software reveals amusing anecdotes and interesting linguistic differences between American and British English. Examples include the use of \"zip code\" versus \"postal code,\" the insertion of local acronyms without explanation, and differences in spelling and pronunciation. Despite potential confusion and bugs, many continue to advocate for separate regional settings for currency, measurements, and week start days. The discussion also touches on how accents and language have evolved over time in both the US and UK and how American English is not necessarily less complex than British English.Spelling variations between American and British English remain open and subject to change. The use of \"-our\" spelling is uncommon in the US except for the Labor party and some \"honor\" inscriptions. Rhoticity is a phenomenon in which parts of Britain dropped the letter R before 1776, but it became more widespread after that, while the US port cities and some dialects in Canada and Ireland have also adopted it. \"Gotten\" is generally used in North America rather than the shortened version \"got,\" which became standard elsewhere. Imperial units and Fahrenheit for temperature are mainly used in the US but are different from the metric system and Celsius. Latinizations of spellings have taken root in America, eg horror, tremor, governor.",
    "hn_summary": "- A tweet unveils that Windows 11 calls a zip file a 'postcode' file in UK English, prompting a discussion on regional language differences.\n- Users debate the use of AI-based language models vs. regex for text replacements, as well as file compression tools like WinRAR and 7-Zip.\n- The discussion also covers spelling and linguistic differences between American and British English, including variations in accents, measurements, and units of temperature."
  },
  {
    "id": 36228125,
    "timestamp": 1686151887,
    "title": "Deepmind Alphadev: Faster sorting algorithms discovered using deep RL",
    "url": "https://www.nature.com/articles/s41586-023-06004-9",
    "hn_url": "http://news.ycombinator.com/item?id=36228125",
    "content": "Researchers from DeepMind have created an AI program called AlphaDev that uses deep reinforcement learning to generate small sorting algorithms. The agent discovers these algorithms from scratch and can create new sequences of CPU instructions that are more efficient than existing human benchmarks in sort efficiency. AlphaDev has even integrated some of the discovered algorithms into the LLVM standard C++ sort library, which is used by millions of users around the world. This breakthrough creates the possibility for AI solutions to optimize and improve fundamental routines that humans have been optimizing for years, bringing further advances in computation and efficiency.A team of researchers at Google has developed an artificial intelligence system called AlphaDev, which uses reinforcement learning to optimize programs. AlphaDev has been used to optimize sorting networks, with its algorithms reducing sorting times by up to 70%. The researchers have reported that their optimised solutions have been included in the LLVM C++ library used by millions of developers. The architecture does not optimise programs by looking for existing human-made solutions but instead looks for new algorithms instead. In addition to sorting, AlphaDev has been tested on other problems, including protocol buffers and competitive coding.\nA new study explores the advantages and limitations of Deep Reinforcement Learning (DRL) and stochastic search learning algorithms used in AlphaDev, a system that optimizes assembly programs. The study compares AlphaDev to AlphaDev-S, AlphaDev-S-CS (cold start), and AlphaDev-S-WS (warm start). AlphaDev optimizes for algorithm length, while the stochastic search algorithms optimize for correctness. Compared to AlphaDev-S variants, AlphaDev is more capable of escaping the space of incorrect algorithms and can find a new space of correct algorithms due to its more diverse exploration capabilities. It outperforms AlphaDev-S-WS when optimizing directly for latency in variable sort algorithms. However, the latter algorithm performs better than AlphaDev in warm start settings. The study also compared different search approaches for optimizing assembly programs, including enumerative, stochastic, and symbolic search techniques.Deepmind's AlphaDev discovers efficient programs for sorting algorithms through reinforcement learning. The process involves designing a language with rules and transforms that dictate how algorithms are selected and executed. Synthesized programs meet predefined specifications to ensure correctness. The study includes the discovered AlphaDev assembly implementations for sort 3-8, exhaustive testing, and additional, correct sorting algorithms for sort 3, sort 4, and sort 5. Pseudocode, implementation of policy, and value and representation networks are released for public access on Github. The AlphaDev implementations were also included in the LLVM libc++ standard sorting library. The performance of the algorithms was tested on three different CPU architectures, and float, int32, and int64 data types detailed in the Supplementary Information.",
    "summary": "- AlphaDev is an AI program created by researchers at DeepMind that uses deep reinforcement learning to discover and generate efficient sorting algorithms from scratch.\n- AlphaDev algorithms have demonstrated up to a 70% reduction in sorting time and have been added to the LLVM standard C++ sorting library used by millions of developers worldwide.\n- A new study compares the capabilities of different algorithms used in AlphaDev and explores the advantages and limitations of deep reinforcement learning in optimizing assembly programs. All AlphaDev assembly implementations, pseudocode, implementation of policies, and networks are accessible on Github.",
    "hn_title": "Deepmind Alphadev: Faster sorting algorithms discovered using deep RL",
    "original_title": "Deepmind Alphadev: Faster sorting algorithms discovered using deep RL",
    "score": 648,
    "hn_content": "Deepmind's AlphaDev team discovered new sorting algorithms using deep reinforcement learning that improved the LLVM libc++ sorting library by up to 70% for short sequences and 1.7% for larger ones. However, one commentator pointed out that the library had an inefficient implementation beforehand. This marks the first time that an algorithm designed by reinforcement learning has been added to the sorting library, with developers attributing this to \"millions of developers and companies\" now employing it on AI applications. While some have criticized the release's impact and claims as \"hyperbolic,\" others contend that discovering the algorithms via RL is a significant achievement. Nevertheless, critics argue that discoveries like these merely scratch \"the tip of the iceberg\" of AI-powered coding optimisations.The conversation thread contains various comments regarding the impact of AlphaGo, DeepMind's perceived hype, and the value of their work in academia. Some comments note increased activity in go clubs and online servers, interesting \"discoveries\" from analyzing published games, and popularity in analyzing kifus using AI to improve gameplay. Others question whether losing to AI counts in ELO or whether AI is \"dumbing down\" the game. Some note that DeepMind's work has not lived up to the hype and that some are unhappy with promotions. Additionally, there is a discussion of DeepMind's work on hashing optimizations and estimation of quantum properties of materials via density functional theory, with some critiques of the latter work's methodology.DeepMind has used AI to discover new ways of optimising sorting networks in LLVM, achieving performance improvements in search of provably optimal code. The team found that very small sorting networks could deliver improved performance through AI optimisation by taking advantage of machine precision, access to faster-than-expected multiplication and exploiting guarantees from previous steps. While the improvements were specific to search of provably optimal code in LLVM, the team has suggested they could also find use cases in other disciplines, such as quantum system simulation. The project demonstrates the combination of brute-force processing power with sophisticated learning algorithms can achieve significant improvements in previously unsolved problems.AlphaDev has developed new sorting algorithms to improve the LLVM libc++ sorting library, resulting in up to 70% faster speeds for shorter sequences. A study in Nature examines the effectiveness of training machine learning models to guess how efficient their own solutions are before verifying only 0.002% of cases experimentally. Industry insiders have commented on the potential applications for such technology, including biomolecular simulations, interpreter-compiler coherence and even an AI that generates human-readable code from an executable. The use of machine learning models has applications in various branches of technology, including computation, processing, and optimization.Google's DeepMind has developed faster sorting algorithms through the use of reinforcement learning (RL), with the algorithms being integrated into LLVM standard C++ library. The algorithms are shown to consistently outperform pre-existing solutions for various input sizes. The dual value function design of AlphaDev, which combined a prediction of algorithm correctness with an estimation of latency, allowed for optimized latency at the fifth percentile of 100 measurements from 100 different machines, efficiently reducing noise and allowing real-world application. While DeepMind primarily focuses on advancing technology and helping humanity, some believe that it should be spun off, possessing little regard for Google and only utilizing Google's funds to cover research.No meaningful content to summarize.",
    "hn_summary": "-Deepmind's AlphaDev team discovered new sorting algorithms using deep reinforcement learning that improved the LLVM libc++ sorting library by up to 70% for short sequences and 1.7% for larger ones.\n-Some have criticized the release's impact and claims as \"hyperbolic,\" while others believe discovering the algorithms via RL is a significant achievement.\n-DeepMind's work has sparked various comments and discussions regarding its perceived hype and impact in academia, as well as discussions on AI's impact on areas like go clubs and online servers."
  },
  {
    "id": 36227411,
    "timestamp": 1686149036,
    "title": "uBlock Origin 1.50.0",
    "url": "https://github.com/gorhill/uBlock/releases/tag/1.50.0",
    "hn_url": "http://news.ycombinator.com/item?id=36227411",
    "content": "Skip to contentProductSolutionsOpen SourcePricingSign inSign upgorhill/uBlockPublicNotificationsFork 2.7kStar 36.2kCodeIssues13Pull requests1ActionsProjectsWikiSecurityInsightsReleases 1.50.01.50.0 LatestComparegithub-actions released this 15 hours ago 07 Jun 14:371.50.0257cfadCommits to master since this releaseCommits since last releaseTo install the stable build:Firefox: Review pendinguBO works best on Firefox.Chromium: Review pending (rolled out to 10% of users)Edge: Install from Microsoft Store: https://microsoftedge.microsoft.com/addons/detail/odfafepnkmbhccpbejgmiehpchacaeakThe Microsoft Store version of uBO is published by Nicole RollsOpera: Submission pendingFixes / changesAdd support to remove attributes in xml-prune scriptletFix/improve href-sanitizer scriptletAdd evaldata-prune scriptletAdd support for xhr in xml-pruneAdd remove-node-text.js scriptletAdd trusted-set-constant scriptletSupport injecting scriptlet in MAIN or ISOLATED worldAdd trusted-source support for privileged scriptlets (and add replace-node-text scriptlet)Add spoof-css scriptletAdd back AdGuard Tracking ProtectionExpand/harden some scriptletsReturn string when storage.sync.get() promise failsDo not bail out when content-disposition is inlineFix improperly unselecting imported listsReport injected scriptlets in troubleshooting informationFix rendering issue of row-filter icon in popup panelAdd \"scriptlet\" filter expression to loggerFix hostname-detecting regexAdd support for sublists in \"Filter lists\" paneProperly handle converted procedural filters in loggerMind small screen size in asset viewerAdd thunderbird as target for installationAdd ability to execute aeld scriptlet at a later timeMove hostname label to top of popup panelOffer opportunity to update filter lists before reporting issueFix compiling of negated regex-based to= domainAssets 6Footer© 2023 GitHub, Inc.Footer navigationTermsPrivacySecurityStatusDocsContact GitHubPricingAPITrainingBlogAbout",
    "summary": "- uBlock Origin 1.50.0 has been released with various fixes and changes\n- The update adds new features like the ability to remove attributes and injecting scriptlets in MAIN or ISOLATED world\n- It's available for Firefox, Chromium, Edge, and Opera, with install and review pending for some platforms.",
    "hn_title": "uBlock Origin 1.50.0",
    "original_title": "uBlock Origin 1.50.0",
    "score": 486,
    "hn_content": "The post on Hacker News discusses the usefulness of uBlock Origin, highlighting the benefits of filtering \"legitimate portions\" of websites. Some users express surprise that many other \"power users\" don't use it. The conversation then shifts to an observation that many professionals in tech lack broader knowledge of how the web and technology actually work, limited to specific skills for their job. This leads to discussions on DNS, the usefulness of being a generalist vs. a specialist, and the effects of advertising on mental health. Some express concerns about the industry being mostly exploitative, while others believe ads empower small players as well. The conversation ends with a comment on the potential of AI to replace programmers, but acknowledges the importance of creativity in the field.A discussion on HN on whether web developers need to know about various networking and deployment topics. Some argue that specific knowledge is not required for day-to-day web development, while others point out the importance of understanding the overall scenario. The conversation also touches on the use of ad-blockers, with some believing that they provide a necessary filter for ads while others question their effect on the tech economy. Suggestions for various ad-blocker and annoyance blocker tools are also shared.Users discuss their experiences with using ad blockers, particularly uBlock Origin, on different platforms and browsers. iOS is noted to have limitations on ad blocking for in-app ads. Some users share their personal filters and strategies for blocking different types of ads and content. The refusal of uBlock Origin's developer to accept donations is also discussed. Finally, some users suggest alternative methods for email backup and retrieval.A conversation on Hacker News focuses on various ad-blockers. A user recommends using Orion browser along with uBlock Origin for blocking ads. Another user suggests using Firefox along with uBlock Origin or LibreWolf, which comes with UBO out of the box. However, several users express concerns about the new Chrome manifest junk, and one suggests that users switch to Firefox because uBlock Origin works best on Firefox. Some users wonder how to calculate the energy saved by using uBlock. Others discuss sponsored content and how ad-blockers are a never-ending cat and mouse game. Overall, the conversation emphasizes the importance of ad-blockers in today's internet landscape and how they improve user experience.- The post discusses the differences between \"Ublock\" and \"Ublock Origin\"\n- \"Ublock Origin\" is recommended due to being authentic and open-source\n- Addon updates (without permission change) are automatic on most browsers, which can lead to adware/malware extensions being resold to less scrupulous owners\n- \"Hard Mode\" on \"Ublock Origin\" can replace most features of NoScript\n- The post ends with users thanking Mr. Gorhill and praising him as a legend",
    "hn_summary": "- Comparison between uBlock and uBlock Origin\n- uBlock Origin is recommended for being authentic and open-source\n- Addon updates can lead to adware/malware extensions being resold"
  },
  {
    "id": 36231016,
    "timestamp": 1686161955,
    "title": "Reddit's Recently Announced API Changes, & the future of /r/blind",
    "url": "https://old.reddit.com/r/Blind/comments/13zr8h2/reddits_recently_announced_api_changes_and_the/",
    "hn_url": "http://news.ycombinator.com/item?id=36231016",
    "content": "The r/blind community is protesting Reddit's recent API pricing changes, which will affect third-party apps like those used by visually impaired moderators and users. The mod team is shutting down the subreddit for 48 hours from June 12-14 in solidarity with other impacted subreddits. Users and moderators are concerned about the impact on accessibility and inclusivity for blind and visually impaired individuals, as many rely on third-party apps for enhanced accessibility features and compatibility with screen readers. The mod team has been in contact with Reddit for the past three years over accessibility concerns with little response. The blackout aims to raise awareness and encourage action from Reddit on behalf of the visually impaired community.r/blind and several other subreddits are blacking out in protest of Reddit's decision to ban third-party apps that are essential for visually-impaired users. The move has been met with backlash from the blind and visually-impaired communities, who argue that the official Reddit app is not accessible for them. The moderators of r/blind have had multiple hour-long calls with Reddit employees, but their concerns have gone unheeded thus far. Some users have suggested legal action, but it may not be a viable option. Many users are showing solidarity with the visually-impaired community by boycotting Reddit during the blackout period.",
    "summary": "- The r/blind community is protesting Reddit's recent API pricing changes that will affect third-party apps like those used by visually impaired moderators and users.\n- The mod team is shutting down the subreddit for 48 hours from June 12-14 in solidarity with other impacted subreddits, to raise awareness and encourage action from Reddit on behalf of the visually impaired community.\n- Users and moderators are concerned about the impact on accessibility and inclusivity for the visually impaired, as many rely on third-party apps for better accessibility features and compatibility with screen readers.",
    "hn_title": "Reddit's Recently Announced API Changes, and the future of /r/blind",
    "original_title": "Reddit's Recently Announced API Changes, and the future of /r/blind",
    "score": 473,
    "hn_content": "A Reddit user posted a protest on Hacker News regarding the lack of accessibility for blind users as Reddit made changes to their API. Many commenters expressed concerns about poor mod access on mobile and web interfaces, with users concluding that it's a general issue with website accessibility overall. The anonymous nature of moderators was discussed, with one user highlighting how some moderators on the platform might not even be members of the community. Overall, commenters hoped that Reddit invests the cost savings from offloading content moderations to a group of volunteers in enhancing accessibility and improving mod access. The discussion highlighted the importance of accessibility and the needs of disabled individuals, including the importance of having mods with disabilities.Reddit moderators are becoming problematic with some controlling many subreddits for personal gain. Powermods may earn a personal or financial benefit from controlling subs that put them in charge of many. Powermods see real threats to their controls and would rather take the subreddits dark than relinquish their authority. Reddit is making an exemption to its API pricing terms for makers of accessibility apps, exempting non-commercial apps that address accessibility needs. The looming IPO and branding are shaping Reddit’s recent actions as they try to keep users on their platform rather than using third-party apps. Third-party users, who are most invested in the platform, are also most likely to use ad-blockers and the company would rather replace them with those who use easier setups.Reddit is facing criticism for the lack of effort it has put into making its platform accessible to people with disabilities. Several users noted that many popular third-party apps are excluded due to commercialism. This has sparked wider criticism about the lack of respect Reddit has for its volunteers, with longstanding moderators complaining that the social media company listens to them but then actually takes no action. Many commenters also argue that Reddit is becoming more toxic and that a decline in the quality of the community will make it no different from other dreary parts of the internet. One user with a visual disability said they had never used the site before, as it was not particularly easy to use with a screen reader.Reddit is removing critical tools used by moderators to keep forums productive, leading to concerns about the future of accessibility and the impact on communities. Some mods are advocating for non-profit community building and diversifying across platforms. Reddit's removal of critical tools is seen as an attempt to monetize and profit, leading to mistrust and frustration among moderators and users. While some predict Reddit will survive, there are concerns about the platform's future relevance and cultural integration. Other notable platforms that remain relevant include Twitter and YouTube, despite changes and criticisms. The decline in discussion quality on Twitter is attributed to the promotion of comments from verified accounts while Reddit's future relevance is questioned as communities move to other platforms.Users discuss Reddit's decision to limit third-party apps and the impact on blind users who rely on third-party apps with built-in accessibility features. Some suggest finding alternatives or changing the way they use Reddit to break their addiction to the platform. Others criticize Reddit's approach and hope for a reversal of the decision. The discussion touches on broader issues of proprietary services and their impact on accessibility. Some users predict a decline in the quality of conversation and engagement on Reddit as a result of the changes. The potential legal implications of Reddit's decision, particularly regarding the Americans with Disabilities Act, are also discussed. Overall, the discussion highlights the tension between profit and accessibility in the tech industry.A group of developers and users are protesting against Reddit's recent changes, including the proposed charging for API access, which they claim is unreasonable and could kill many third-party clients. Reddit has also been criticized for making its content difficult to access for those with visual impairments. The community is concerned that the changes are endangering Reddit's long-term viability, and say that the platform is discriminating against the disabled. While some users have expressed a desire to switch to a more accessible platform, no viable alternative to Reddit has yet emerged. Investors are being warned that if the recent changes continue, the company's core business may be threatened.N/A, as the text provided does not contain meaningful content related to cutting-edge tech news.",
    "hn_summary": "- Reddit is facing criticism for its lack of accessibility for disabled users, with concerns raised about the lack of respect for volunteers and long-standing moderators.\n- Removal of critical tools used by moderators is seen as an attempt to monetize and profit, leading to mistrust and frustration.\n- Limits on third-party apps and the potential legal implications of Reddit's changes are also discussed, highlighting the tension between profit and accessibility in the tech industry."
  },
  {
    "id": 36222625,
    "timestamp": 1686109968,
    "title": "Royal Navy says quantum navigation test a success",
    "url": "https://thequantuminsider.com/2023/06/06/royal-navy-says-quantum-navigation-test-a-success/",
    "hn_url": "http://news.ycombinator.com/item?id=36222625",
    "content": "Toshiba Europe And Orange Show Viability of Quantum Key Distribution Deployment With Existing EquipmentJUNE 7, 2023",
    "summary": "",
    "hn_title": "Royal Navy says quantum navigation test a success",
    "original_title": "Royal Navy says quantum navigation test a success",
    "score": 396,
    "hn_content": "The Royal Navy announces successful testing of quantum navigation, potentially enabling nuclear submarines to obtain ultra-accurate maps using variations in the gravitational constant g. Submarines primarily surface regularly for communications, not just for GPS lock. Different types of submarines operate differently, with diesel submarines, for example, roaming for much of their time since fuel is limited. Throughout the discussion, some commentators suggest that underwater activity, such as landslides, earthquakes and even the movements of crew members and engines, could interfere with this new navigation technology. Overall, the technology improves navigation accuracy, reducing the need to surface regularly and reducing the chances of being detected.A new technology known as a Bose-Einstein Condensate (BEC) gravity map could revolutionize naval navigation for submarines. The technology uses a sensor that measures gravity to create a super accurate map of Earth's gravity, which can then be used for navigational purposes without the need to surface for GPS several times a day. The accuracy of the technology could reduce errors caused by INS drift and potentially enable the creation of accelerated navigation to speed up submarine travel.\nA discussion on using gravity fields for navigational purposes through the detection of variations in the gravitational constant G. The use of quantum sensors like Bose-Einstein condensates (BECs) was mentioned as a potential tool for this purpose but may require a large device, and there are already more precise methods available. GPS and celestial navigation are also used for submarine navigation without relying on surfacing. The limitations and challenges of using gravity fields for navigation were discussed, with concerns around the accuracy of elevation measurements and the noisy signal resulting from external factors like ocean currents and nearby masses. The potential use of gravity fields for market arbitrage was also mentioned.The Royal Navy is testing a quantum accelerometer on one of their ships. The device is built by an Imperial College researcher and containsThe Royal Navy is working on next-generation navigation technology for submarines, which may utilize atom interferometry to provide extremely precise sensors of acceleration and rotation, the essential requirements to build an inertial navigation system. It is speculated that this technology allows mapping the seafloor and performing localization based on that, using matches to the known contour of the bottom of the ocean as a fix for dead reckoning. Submarines require periodic updates to the inertially derived position, and may use charts and ENCs while still needing GPS. The potential impact of this technology is not clear, as current military technology research, such as AI assisted battlefield tactics, remains a largely classified area. Additionally, inertial navigation requires many parameters to be stable for long-term operation, including gravitational constant, the rotation of Earth, and a high sampling rate for sensors.A high precision RTK GNSS receiver is being tested in the Barents Sea, with some days showing cm accuracy but others with no RTK fix; northern lights and man-made interference are suspected culprits. The US military is reportedly developing a device that uses stars to determine location in daylight. The device is reportedly portable and a potential upgrade to submarines and other weapon systems. Building such a device involves having extensive contacts in the submarine navigation ecosystem and knowledge about highly complex and classified navigation systems to make it work as a business. The exact capabilities of most government-level systems are kept classified, so there is no telling who has what.",
    "hn_summary": "- The Royal Navy has successfully tested quantum navigation using variations in the gravitational constant g, potentially improving navigation accuracy and reducing the need for submarines to surface for GPS.\n- The use of Bose-Einstein Condensate (BEC) gravity maps can provide super-accurate navigation without relying on surfacing for GPS, potentially reducing INS drift errors and speeding up travel.\n- There are potential limitations and challenges to using gravity fields for navigation, such as the accuracy of elevation measurements and the noisy signal from external factors, but the Royal Navy is working on next-generation navigation technology utilizing atom interferometry and inertial navigation."
  },
  {
    "id": 36233068,
    "timestamp": 1686169637,
    "title": "Tell HN: \"I don't care about cookies\" extension bought by Avast, users jump ship",
    "url": "https://addons.mozilla.org/en-US/firefox/addon/i-dont-care-about-cookies/reviews/?score=1&utm_content=addons-manager-reviews-link&utm_medium=firefox-browser&utm_source=firefox-browser",
    "hn_url": "http://news.ycombinator.com/item?id=36233068",
    "content": "To use these add-ons, you'll need todownload FirefoxDismiss this noticeFirefox Browser Add-onsExtensionsThemesMore…Log inSearchSearchReviews for I don't care about cookiesI don't care about cookiesby Gen Digital Inc., KikoRated 3.3 out of 53.3 Stars out of 557734953432301598598 reviewsShow all reviewsShow only five-star reviewsShow only four-star reviewsShow only three-star reviewsShow only two-star reviewsShow only one-star reviewsRated 1 out of 5by JimmyQ, 7 hours agoI would never use anything offered by Avast. Warning: Do not use this extension if you want to keep you information private!FlagRated 1 out of 5by Firefox user 13457496, 8 hours agoRated 1 out of 5by Firefox user 17933629, 8 hours agoRated 1 out of 5by Maximillian Laumeister, 9 hours agoRated 1 out of 5by ssl, 9 hours agoNo notification was given that the addon was bought by Avast, a company I have no reason to trust. Use Consent-O-Matic or I Still Don't Care About Cookies addons instead.FlagRated 1 out of 5by Rapacious Bodhisattva, 9 hours agoRated 1 out of 5by Calum Chisholm, 9 hours agoRated 1 out of 5by nikxda, 9 hours agoRated 1 out of 5by Firefox user 14992949, 9 hours agoIt is very wrong for the extension to change ownership without warning the user about it. I trusted the original developer of this extension, but i do not trust Avast.FlagRated 1 out of 5by stratosgear, 10 hours agoAvast made me uninstall this extension!FlagRated 1 out of 5by Firefox user 14046894, 4 days ago2023 update : moved to \"I still don't care about cookies\" without Avast company behind...------Très bien pour contrecarrer les ennuis visuels liés à des lois complètement inutiles, faites par des guignols sous la pression d'autres guignols ! (ils devraient plutôt mettre un autocollant sur les box pour te prévenir, comme sur les bouteilles d'alcool... haha! \"Attention internet peut contenir des cookies\"). Quels branques ces politiques.Merci en tous cas.FlagRated 1 out of 5by Firefox user 17705868, 5 days agoThis used to be a great extension, but it was bought by Avast (who are known to steal user data) and its no longer safe. There's a community version called \"I still don't care about cookies\" that doesn't steal your data.FlagRated 1 out of 5by nag73, 8 days agoRated 1 out of 5by Crash10X, 9 days agoThis extension was bought by Avast, a company known for harvesting user's data. Use \"I still don't care about cookies\" instead which is a fork of the original one and does the same job.FlagRated 1 out of 5by cheeky, 9 days agoRated 1 out of 5by Dawpaw, 12 days agoRated 1 out of 5by skateguy, 16 days agoRated 1 out of 5by Firefox user 17716164, 18 days agobought by avastFlagRated 1 out of 5by trolzilol, 21 days agoRated 1 out of 5by Firefox user 17375931, a month agoRated 1 out of 5by Firefox user 17900656, a month agoWARNING: EXTENSION SELL YOUR DATA AND SPY YOU AS IT WAS BOUGHT BY AVAST. USE \"I still dont care about cookies\" INSTEAD!!!FlagRated 1 out of 5by Firefox user 17900072, a month agoRated 1 out of 5by Christophe, a month agoRated 1 out of 5by DeineMudda69, a month agoWARNUNG! Wurde von den Avast-Missgeburten übernommen. Hat auch einige Seiten kaputt gemacht z.B. DeviantArt konnte man nix mehr anklicken. Daher KEINE Empfehlung! Nehmt die opensource Alternative \"I still don't care about cookies!FlagRated 1 out of 5by Max Anthem, a month agoI didn't understand why so many users voted it 1 star until I realized that it was indeed bought by Avast. I am usually not too concerned about my privacy, but this time I'll pay attention and go to serious alternatives.FlagPrevious1234567NextPage 1 of 24Go to Mozilla's homepageAdd-onsAboutFirefox Add-ons BlogExtension WorkshopDeveloper HubDeveloper PoliciesCommunity BlogForumReport a bugReview GuideBrowsersDesktopMobileEnterpriseProductsBrowsersVPNRelayMonitorPocketTwitter (@firefox)Instagram (Firefox)YouTube (firefoxchannel)PrivacyCookiesLegalExcept where otherwise noted, content on this site is licensed under the Creative Commons Attribution Share-Alike License v3.0 or any later version.Change languageAfrikaansعربيAsturianuAzərbaycancaБългарскиবাংলাBosanskiCatalàMaya KaqchikelČeštinaDanskDeutschDolnoserbšćinaΕλληνικάEnglish (Canadian)English (British)English (US)EspañolEesti keelEuskaraفارسیsuomiFrançaisFryskGaeilgeעבריתHrvatskiHornjoserbscemagyarInterlinguaBahasa IndonesiaíslenskaItaliano日本語ქართულიTaqbaylit한국어lietuvių kalbaLatviešuМакедонскиМонголMelayuMaltiNorsk bokmålNederlandsNorsk nynorskਪੰਜਾਬੀ (ਭਾਰਤ)PolskiPortuguês (do Brasil)Português (Europeu)RomânăРусскийසිංහලslovenčinaSlovenščinaShqipSvenskaతెలుగుไทยTürkçeУкраїнськаاُردوTiếng Việt中文 (简体)正體中文 (繁體)",
    "summary": "- Avast has acquired the \"I don't care about cookies\" extension and users have expressed concerns about privacy.\n- Users have recommended using alternative add-ons such as Consent-O-Matic or \"I still don't care about cookies\".\n- Some users have reported issues with the extension and concerns about Avast's history with data collection.",
    "hn_title": "Tell HN: \"I don't care about cookies” extension bought by Avast, users jump ship",
    "original_title": "Tell HN: \"I don't care about cookies” extension bought by Avast, users jump ship",
    "score": 387,
    "hn_content": "Users of the \"I don't care about cookies\" browser extension are jumping ship after its acquisition by anti-virus software company, Avast. The move has raised questions regarding browser extension ownership and updates. Some argue that policy changes should be implemented by browser creators to require user approval for extension upgrades in cases where ownership has changed. Others suggest using open-source software or taking control of owned software to avoid automatic updates altogether. Many users of the \"I don't care about cookies\" extension are now seeking alternative options due to concerns over Avast's ownership and data privacy policies.Extensions for browsers may be problematic since users may not know when they change ownership or business model; extensions are difficult to monetize. Selling ongoing loans to other companies should be made illegal. Even if the mortgage terms do not change, some customers strongly object to being forced to do business with a company they dislike. Updates for software can be detrimental, and automatic updates can also cause issues. Automatic updates are particularly concerning for extensions, which can change hands and business models without the user noticing. Open-source software is less affected by these problems. Businesses may buy old extensions and turn them into advertising malware. Customers should be able to see how many steps away a product is from a parent company.Avast, the antivirus software company, recently acquired the popular browser extension \"I don't care about cookies.\" Following the acquisition, concerns were raised about the extension's change of ownership and the potential for malicious changes to be made. Users have called for more formal systems of verification and trust for extensions. Some have suggested using community-maintained forks as an alternative. Others recommend using tools like uBlock Origin or Consent-O-Matic to deal with cookie prompts. The discussion highlights the issue of trust in the tech industry and the potential risks associated with change of ownership.Avast, a company with a previously accused record of selling data, recently purchased the \"I don't care about cookies\" browser extension without notifying its users. It's unclear if Avast has any nefarious reasons for its acquisition, but the extension does have access to users' browsing history, passwords, and credit card numbers. Some users believe that websites tracking data is not as big of a problem as the risk of an 'access all sites' chrome extension. There are various free alternatives to the extension and Firefox already has a cookie banner reduction feature. Mozilla allows for user reporting of add-ons and has received complaints about Avast's purchase. The sale of the extension also raises questions about informed user consent and lack of communication between commercial parties and users.Avast, a well-known antivirus software provider, has bought an extension called \"I don't care about cookies.\" Although the extension gained popularity due to its ability to dismiss pop-up cookie notifications, some complain that it doesn't prevent websites from tracking user data. Additionally, Avast has a history of collecting and selling user browsing data, causing concern for some. Developers argue about the \"spaghetti\" coding of the extension and the difficulty in creating a general solution. Some users instead use mobile browsers with Javascript blocked to avoid pop-ups.",
    "hn_summary": "- Avast's acquisition of \"I don't care about cookies\" has caused users to seek alternative options due to concerns over data privacy policies and ownership changes.\n- Some suggest that policy changes should be implemented to require user approval for extension upgrades in cases where ownership has changed, or open-source software should be used to avoid automatic updates.\n- The sale of the extension raises questions about informed user consent and lack of communication between commercial parties and users."
  },
  {
    "id": 36223927,
    "timestamp": 1686122859,
    "title": "Apple's game porting toolkit is fantastic. Cyberpunk 2077 at Ultra on an M1 MBP",
    "url": "https://twitter.com/isaacmarovitz/status/1666209780031971341",
    "hn_url": "http://news.ycombinator.com/item?id=36223927",
    "content": "Thread ReaderOne-click sign-up and loginSign up or login to access your unrolled and bookmarked threads (or PDF archives if you are a Premium member!)Login with TwitterLogin with EmailLogin above to accept Thread Reader App'sTerms of Service and Privacy PolicyHelp | About | TOS | Privacy | Twitter Files",
    "summary": "",
    "hn_title": "Apple's game porting toolkit is fantastic. Cyberpunk 2077 at Ultra on an M1 MBP",
    "original_title": "Apple's game porting toolkit is fantastic. Cyberpunk 2077 at Ultra on an M1 MBP",
    "score": 329,
    "hn_content": "Apple's game porting toolkit enables casual gamers to play a few games on their Macs; this is not targeted towards dedicated gamers. However, the hardware is amazing but it still cannot compete with gaming PCs, especially since Apple does not have strong relationships with AAA developers like Microsoft and other platform owners. Apple has built its own little parallel gaming stack that adapts open-source efforts of Codeweavers, Valve and the broader Linux community. Adapting these for Metal is no small feat, but an investment that Apple's size can handle without much risk.WebGPU, a cross-platform graphics API that is meant to rival Vulkan and Directx12, is seen as a means to an end for Apple's Metal offering. Apple poured a lot of resources into making WebGPU happen, which could pay off if game developers start targeting WebGPU instead of Vulkan or DX12. Though games available in App Store or Steam for Mac have mostly not been ported to Apple Silicon, some games can still be played on Macs, albeit not the top of the line. Glorified vt100s is how HN users viewed Macs: a great work platform only if one is developing iOS/MacOS apps or into media production.The conversation revolves around the use of Macs in workplaces, particularly the prevalence of Microsoft Office on Macs. There is also discussion about the performance of Mac GPUs and their usage for gaming. Some argue that Macs' strength lies in their Unix-based platform, while others believe that it is not suitable for terminal-based tasks. The conversation includes comparisons to other hardware and software, such as AMD and Nvidia GPUs and gaming PCs. Overall, the conversation highlights the varying opinions on the usage and performance of Macs in different settings.Apple's M1 Max chip outperforms a $5,000 Mac Studio in gaming, but configuring a PC with the Nvidia RTX 3090 can provide even better GPU throughput at a sub-$2,000 price point. Apple's expensive gaming machines lack PCIe slots for additional GPUs, but Apple's gaming platform is the iPhone, not Macs. The M1 Max chip is impressive with PS5 ballpark performance, and the iGPU could provide a comparable gaming experience for some gamers on the go. However, Apple's ground-breaking technical greatness is overdone, given the amount of silicon investment. Ultimately, Apple isn't targeting the high-end, 1200 watt, 12-fan 4090 PCMR sorts. Instead, the company is trying to compete by supporting ancillary gaming for users who prefer Apple for other reasons.Apple's M1 chip is capable of running Cyberpunk 2077, but only at 15fps and low resolution. This development could lead to better gaming experiences on Macs, especially with improved Metal conversion. Apple has created a Game Porting Toolkit, indicating a desire for AAA games on Macs. Apple's M2 Max GPU will be powerful, but not as powerful as high-end dedicated laptop GPUs from Nvidia. The high-end gaming market is relatively small compared to the casual gaming market, and Apple is well-positioned for high-quality casual games. There is potential for console game ports to Macs, especially as the M-series evolves, and Apple works on GPU improvements. The gaming market is significant and relevant to Apple, and they are testing the waters to see if they can expand Mac gaming beyond iOS ports.Comments on a forum post about the Apple M1 chip and gaming. Users discuss the M1's comparison to Nvidia 3090, power limits, battery life, and emulation and translation issues. Discussion also includes comparisons with other devices, such as Windows PCs and the Steam Deck, and speculation about the future of Apple devices in gaming.Apple's M1 chip can run Windows games at playable frame rates using CrossOver, a compatibility layer with DirectX. The subset of games tested so far are a mix of old and recent titles. Apple's foray into gaming might stem from its recent announcement of a mixed reality headset. However, the M1 chip may not have enough graphics memory to become an attractive gaming platform, and it is unclear whether Apple will release a proper gaming computer or port of the Mac OS. Its high-end hardware such as the Mac Studio and MacBook Pro 16-inch could offer a viable option, but the price point is prohibitive for some gamers. \nValve's emulation layer is designed for end users to run games without a native port. The new Mac Pro has PCI Express slots, but cannot be used to add discrete GPUs to the system for graphics tasks. Nvidia drivers for macOS have not been available for years. Apple could build their own NVK-like driver for Metal, but they do not seem to prioritize any GPU other than their own. No one is likely to get a Mac Pro just for games, even if it works. It is unclear if the issue with adding discrete GPUs to the Mac Pro is technical or something else. Nvk/mesa may enable Linux gaming on Mac Pros with third-party cards in the future.",
    "hn_summary": "- Apple's game porting toolkit is not primarily targeted towards dedicated gamers, but is aimed at casual gamers.\n- Apple built its own gaming stack, adapting open-source efforts of Codeweavers, Valve, and the broader Linux community.\n- The M1 Max chip outperforms a $5,000 Mac Studio in gaming, but configuring a PC with the Nvidia RTX 3090 can provide even better GPU throughput at a sub-$2,000 price point."
  },
  {
    "id": 36230839,
    "timestamp": 1686161357,
    "title": "Apple removes $99 dev account requirement for first iOS 17 & macOS 14 betas",
    "url": "https://arstechnica.com/gadgets/2023/06/how-to-install-ios-17-and-macos-14-developer-betas-now-that-anyone-can-do-it/",
    "hn_url": "http://news.ycombinator.com/item?id=36230839",
    "content": "YOU BETA BELIEVE IT —Apple removes $99 dev account requirement for first iOS 17 and macOS 14 betasWe'll also explain how the beta install process has changed since last year.ANDREW CUNNINGHAM - 6/7/2023, 10:54 AMEnlargeApple27WITHUsually when Apple announces big new operating system updates at WWDC, it releases early, work-in-progress developer betas for app developers who have paid for an Apple Developer account. A few weeks later, once the betas have been updated a couple of times, it has released somewhat more-stable public beta versions for general consumption.That has changing this year. Anyone who signs in to Apple's developer site with their Apple ID will have access to the developer beta builds of iOS 17, macOS Sonoma, and Apple's other operating systems for free. Actually submitting apps to Apple for App Store distribution (or, on the Mac, signing them so that you can distribute them outside the App Store without setting off macOS' many unsigned app warning messages) will still cost $99 per year. But enthusiasts and testers who use developer accounts to get early beta access will no longer need to pay to do it.Apple will still release public beta builds of all its operating systems through its public beta program sometime in July.It should go without saying, but don't install these beta operating systems on anything that you rely on day to day. That's doubly true for these initial developer betas, which have historically been especially buggy and prone to crashes and compatibility issues. Past public betas from Apple have corresponded to the third or fourth developer beta build, so if you've only experienced the public betas before, know that the first developer betas are usually in pretty rough shape.How to install, and how things have changedThe pricing isn't the only thing that has changed about how Apple releases its beta software since the first iOS 16 and macOS Ventura betas a year ago.The process differed slightly for iDevices and Macs, but historically you needed to download and run a file on your device to point it at the beta update servers instead of the public ones. On iDevices, this was a \"provisioning profile,\" while Macs just had a package that used the command-line seedutil tool behind the scenes. (Installing developer betas on macOS has been \"free\" for a long time, if you looked up the right seedutil command.)That changed circa the iOS 16.4 and macOS 13.3 releases. You now opt in or out of Apple's beta programs in the Software Update section of the Settings app. The list of betas available to you is tied to your Apple ID, so you'll need to have signed in to your device using the same Apple ID you used to sign in to Apple's developer site.Once you've signed up for betas, you'll see everything that's available to you on devices that are signed in with the same Apple ID.Andrew CunninghamPrevious SlideNext SlideIt's a little annoying to need to sign in with an Apple ID to access the betas, though you can sign out once you've installed the software and do a factory reset if you want a fresh \"clean\" install of the new OS. You'll also need to be running a recent version of macOS or iOS on your devices, which could add some extra update time if you're using a test phone, tablet, or Mac that you don't always actively use and update.But the new system helps solve one problem I've occasionally encountered while testing software. This time of year, Apple is usually testing two different beta operating systems—right now, iOS 17 and macOS 14 are available alongside iOS 16.6 and macOS 13.5, for example. The new system makes it easy to know exactly which beta you're opting in to and to easily switch between (or opt out of) beta programs if you want to.Apple does still offer full IPSW restore images for many devices. These are the same kind of operating images that macOS or the Apple Configurator software would download to revive a soft-bricked device, and you can boot your device into recovery mode and install it directly without needing to sign in. This is also the quickest way to get a clean install, if you prefer a blank slate when you start testing new software, and the only real way to roll back to a non-beta version of the operating system.That said, restore images are only available for iPhones, iPads, Apple Silicon Macs, and the old Apple TV HD. Intel Macs, Apple Watches, and newer Apple TVs will need to be updated via Software Update. Apple Watches and newer Apple TVs can't be downgraded after they're upgraded, so proceed with extra caution there.READER COMMENTS27WITHANDREW CUNNINGHAMAndrew is a Senior Technology Reporter at Ars Technica, with a focus on consumer tech including computer hardware and in-depth reviews of operating systems like Windows and macOS. Andrew lives in Philadelphia and co-hosts a weekly book podcast called Overdue.Promoted CommentsIgnoble XenonThe article mentions it pretty heavily, but it cannot be stated enough that installing the early Dev builds is very very \"at your own risk\".June 7, 2023 at 6:11 pmChannel Ars Technica← PREVIOUS STORYNEXT STORY →Related StoriesToday on Ars",
    "summary": "- Apple has removed the $99 developer account requirement for access to first iOS 17 and macOS 14 betas.\n- Access to betas is now tied to your Apple ID, and anyone signing in to Apple's developer site with their Apple ID can access developer beta builds of iOS 17, macOS Sonoma, and other operating systems for free.\n- The beta install process has changed since last year, and installing the early developer builds is at your own risk.",
    "hn_title": "Apple removes $99 dev account requirement for first iOS 17 and macOS 14 betas",
    "original_title": "Apple removes $99 dev account requirement for first iOS 17 and macOS 14 betas",
    "score": 289,
    "hn_content": "Apple has removed the $99 dev account requirement for submitting applications to its App Store for beta testing on iOS 17 and macOS 14. However, the $99 fee still applies for submitting apps to the App Store for commercial use or distribution outside of it. This change could be seen as a positive for developers in developing countries who can now use the TestFlight app for free when beta testing to share with a maximum of 30 people. However, there is still pushback from some developers who argue that other fees and requirements limit hobbyist and non-commercial development. Apple introduced this policy decision to prevent spam and misuse in its stores, but some developers argue that charging $99 per year unfairly targets smaller businesses.The text discusses the Apple Developer Program, which has existed for decades, and its membership benefits. Xcode was free with Mac OS X until 2012 when code signing requirements began. The $99 Mac developer program began in 2010, and before that, membership was $500 to $3500. There is discussion around the fees and requirements for software developers to create Apple apps, including a sarcastic comment from a developer. The discussion also explores why developers in developing nations might select MacOS, with the response being that iOS is where the money is. Finally, TestFlight cannot be used for free, and technically, app developers can distribute an app themselves, but Apple will label it as dangerous and potentially containing malware.Apple's new developer beta versions of iOS and macOS can now be downloaded without a developer account, unlike in previous years. However, non-developers could still face barriers, such as warnings of potential malicious software and requests to update. There is also a $99 fee to distribute apps on the Apple App Store, and unsigned software often comes with warnings about being dangerous. Despite this, downloading pre-release operating systems can benefit not only developers but also system administrators, and is cheaper than paying for a developer account. College students and enthusiasts who want access to the most advanced software may also choose to download betas.Apple has made changes to the way developers access its iOS and MacOS betas. Developers no longer need to pay the $99 registration fee to access them - instead, users can opt into a beta channel directly in the \"Settings\" menu. Some responses to the news reflect scepticism over whether developers will be committed enough to be interested in beta testing but unwilling to pay the annual fee. There are also concerns over whether the changes will result in non-registered developers downloading profiles shared elsewhere. One comment suggested that the changes are part of an attempt to rejuvenate Mac dev, but others indicated that they believe Apple should do more to make it more accessible.",
    "hn_summary": "- Apple has removed the $99 dev account requirement for submitting applications to its App Store for beta testing on iOS 17 and macOS 14.\n- The change could benefit developers in developing countries and hobbyists, but some developers argue that other fees and requirements limit non-commercial development.\n- While the new developer beta versions of iOS and macOS can now be downloaded without a developer account, non-developers may still face barriers, such as warnings of potential malicious software and requests to update."
  },
  {
    "id": 36222266,
    "timestamp": 1686106166,
    "title": "DirectX 12 Support on macOS",
    "url": "https://twitter.com/andytizer/status/1666131239575728130",
    "hn_url": "http://news.ycombinator.com/item?id=36222266",
    "content": "Thread ReaderOne-click sign-up and loginSign up or login to access your unrolled and bookmarked threads (or PDF archives if you are a Premium member!)Login with TwitterLogin with EmailLogin above to accept Thread Reader App'sTerms of Service and Privacy PolicyHelp | About | TOS | Privacy | Twitter Files",
    "summary": "- This text does not contain any content related to cutting-edge tech news or information on DirectX 12 support on macOS. \n- This website is best experienced by visiting the website directly.\n- Please visit the website to read the article.",
    "hn_title": "DirectX 12 Support on macOS",
    "original_title": "DirectX 12 Support on macOS",
    "score": 288,
    "hn_content": "Apple has unveiled a translation layer allowing DirectX 12-based apps to run on Macs. The adoption of DirectX 12 support and the fact that it translates to the Apple Metal API rather than relying on a translation to Vulkan, has got the attention of gamers and developers. It's seen by some as a strange move, given Apple's support of its proprietary graphics technology ‘Metal,' which was expected to be singularly supported by Macs. Nevertheless, Microsoft has welcomed the move and sees it as another push for gamers to have \"flexibility\" in the platforms they can use without sacrificing performance. On the contrary, some gamers are not as pleased about the latest feature as it has been released with a very restrictive license, allowing only for evaluation purposes.Apple has announced a Game Porting Toolkit for developers, letting them convert Windows-based DirectX 11 and 12 games to macOS. Specifically intended to help developers \"evaluate and test how their games will perform on macOS,\" the toolkit includes the \"Metal Game Controller\" tool, which maps Xbox and PlayStation gamepads to macOS. Part of the company's wider push for gaming on the Mac platform, the toolkit will be free for developers, and follows last year's introduction of quick frame syncing for external GPUs, a wealth of Apple Arcade games, and the recent launch of a new MMORPG World of Warcraft expansion for the platform.Apple is rumored to be entering the gaming market, and may partner or cooperate with Valve around VR game development, however, Apple may have enough hubris to try to supplant Steam instead of working with it. Apple has developed a Windows DirectX 12 gaming emulator on Mac, named Game Porting Toolkit, which is intended as a developer tool for testing before porting rather than an end-user application. The emulator uses Wine with additional graphics translation built on Metal, which replaces OpenGL and allows games to run on Apple's devices. The emulator should also be able to run most Windows.exe games and does not require developers to port-game UI, networking, or platform integration. The emulator has lower graphics processing power and a lack of graphics card support on most Macs, which may create issues with high-end games.Apple announced its Game Porting Toolkit, a tool for developers to port Windows games to iOS and macOS. The toolkit contains a D3DMetal framework, which directly translates Direct3D calls into Metal, and can be used with a Wine implementation developed by Codeweavers, CrossOver. However, the toolkit is aimed at developers, not end-users. Developers may still need to spend a lot of effort making their software run on macOS, and cross-platform support is challenging because porting an existing stack to new platforms requires much engineering work. Gaming companies may not support Linux and Mac versions of their games natively because of engine differences. Moreover, Apple's inability to have a stable API and forced updates to the new API has caused problems in supporting games on its platforms. ",
    "hn_summary": "- Apple has introduced DirectX 12 support on macOS, allowing for translation to the Metal API rather than relying on Vulkan translation.\n- The move has garnered attention from developers and gamers, some of whom question the move given Apple's support of its proprietary Metal graphics technology.\n- Apple has also announced a Game Porting Toolkit for developers to convert Windows-based DirectX 11 and 12 games to macOS, as part of a wider push for gaming on the Mac platform."
  },
  {
    "id": 36235143,
    "timestamp": 1686180704,
    "title": "SEC granted emergency restraining order to freeze, repatriate Binance.US assets",
    "url": "https://www.kitco.com/news/2023-06-07/SEC-granted-emergency-restraining-order-to-freeze-repatriate-Binance-US-assets.html",
    "hn_url": "http://news.ycombinator.com/item?id=36235143",
    "content": "Get all the essential market news and expert opinions in one place with our daily newsletter. Receive a comprehensive recap of the day's top stories directly to your inbox. Sign up here!(Kitco News) - The U.S. Securities and Exchange Commission (SEC) is continuing to hammer the world’s largest crypto exchange, submitting a court filing for an emergency restraining order to freeze the assets of Binance.US the day after filing a massive 13-charge lawsuit against Binance.“The Securities and Exchange Commission today filed an emergency action application seeking a temporary restraining order freezing assets, directing defendants to repatriate assets held for the benefit of customers of the Binance.US crypto trading platform, and seeking other emergency relief against Binance Holdings Limited, BAM Trading Services Inc., BAM Management US Holdings, Inc., and their founder, Changpeng Zhao,” the SEC wrote in their announcement.The regulator said the goal of the order is “to ensure that Binance.US customers’ assets are protected and remain in the United States through the resolution of the SEC’s pending litigation of this matter.”The SEC’s emergency motion asks that the court grant them “(1) an order to show cause why a preliminary injunction should not be granted as to the defendants; (2) an order freezing the assets of BAM Management; (3) an order directing the defendants to repatriate assets held for the benefit of BAM Trading's or BAM Management’s (together “BAM”) customers; (4) an order for other relief concerning the custody and control of BAM customers’ assets; (5) an order prohibiting the destruction of records by the defendants; (6) an order requiring sworn accountings of certain assets from the defendants; (7) an order authorizing expedited discovery from the defendants; and (8) an order granting alternate means of service.”Later on Tuesday, a filing from the United States District Court for the District Of Columbia showed that the court had agreed to grant the SEC’s demands.“The Commission has made a sufficient and proper showing in support of the relief granted herein,” the court wrote, “by setting forth evidence from which an inference of a violation can be drawn and showing a likelihood that the Commission will prevail at trial on the merits and that the Defendants have engaged in and, unless temporarily restrained and enjoined by order of this Court, will continue to engage in acts, practices, and courses of business constituting violations” of the Securities Act and the Exchange Act.By granting the order, the court has effectively frozen the assets of Binance entities BAM Management and BAM Trading and prevented them from transferring the assets except to recognized third-party custodians. It also requires Binance to repatriate any assets held outside of the United States on behalf of Binance.US customers.Binance now has five days to ensure that all access to Binance.US customers’ funds is limited to the U.S. entity, and 30 days to transfer to Binance.US any assets that it holds in offshore entities on behalf of U.S. customers.In the wake of the filing, Binance announced on Twitter that while the court order prohibits Binance.US from transferring funds to other entities, it does not impact the ability of Binance.US customers to access or withdraw their own funds.This afternoon, the SEC filed a motion seeking a TRO and preliminary injunction against https://t.co/AZwoBOgsqS attempting to, amongst other things, freeze https://t.co/AZwoBOgsqS corporate assets. User assets remain safe and secure and the platform continues to be fully…— Binance.US 🇺🇸 (@BinanceUS) June 6, 2023On June 5, the SEC filed a lawsuit against Binance and its CEO, Changpeng Zhao (CZ) charging them with operating an illegal platform in the U.S. and misusing customer funds.“Through thirteen charges, we allege that Zhao and Binance entities engaged in an extensive web of deception, conflicts of interest, lack of disclosure, and calculated evasion of the law,” said SEC Chair Gary Gensler. “As alleged, Zhao and Binance misled investors about their risk controls and corrupted trading volumes while actively concealing who was operating the platform, the manipulative trading of its affiliated market maker, and even where and with whom investor funds and crypto assets were custodied.”The SEC has alleged that customer funds were illegally diverted to Sigma Chain, a trading entity controlled by Zhao, and used to engage in fraudulent trades that inflated Binance’s true trading volume.The filing also says that Binance concealed the fact that it commingled billions of dollars in customer assets that were sent to Merit Peak, another third-party entity owned by Zhao.ByErnest HoffmanFor Kitco NewsFollow @KitcoNewsNOWehoffman@kitco.comwww.kitco.com",
    "summary": "- The U.S. Securities and Exchange Commission (SEC) has filed an emergency restraining order to freeze the assets of Binance.US the day after filing a 13-charge lawsuit against Binance. \n- The order aims to protect Binance.US customers' assets and ensure they remain in the U.S. until the SEC resolves the litigation against the company. \n- The court has granted the SEC's demands, effectively freezing the assets of Binance entities BAM Management and BAM Trading and requiring Binance to repatriate any assets held outside of the United States on behalf of Binance.US customers.",
    "hn_title": "SEC granted emergency restraining order to freeze, repatriate Binance.US assets",
    "original_title": "SEC granted emergency restraining order to freeze, repatriate Binance.US assets",
    "score": 287,
    "hn_content": "The U.S. Securities and Exchange Commission (SEC) has granted an emergency restraining order to freeze and repatriate Binance.US assets due to it being an exchange, broker, asset custodian, market maker, and trader for its own account, all at once without regulation. The SEC claims Binance has been transferring funds into the personal account of its CEO. The article discusses various groups that use cryptocurrency, including those who believe in owning their wallets rather than using traditional banks, but also those who evade taxes and participate in illegal activities. The crypto community is criticized for its failure to develop a use for cryptocurrency beyond speculation and crime. The article also includes some sarcastic comments about the effectiveness of regulations and the potential benefits of crypto gaming companies.- Real money mechanics turn games into gambling and attract scammers\n- Diablo 3 launched a real money auction house that caused controversy\n- Crypto is not needed for a Steam-like model where users own and resell game licenses\n- Cheating protection is a feature available in most multiplayer games\n- Cash-out options for in-game currency make games similar to selling cinema tickets after the show\n- Bitcoin is useful for sending money across borders and avoiding banking issues\n- Trustless decentralized exchanges do not currently exist for real-world assets\n- Bitcoin can be used to buy real-world goods and services, like flights and hotel stays\n- Bitcoin can be a hedge against economic problems like QE and bank closures\n- Crypto exchanges can be risky, so use caution when choosing where to store funds\n- Opinions vary on the legitimacy and usefulness of crypto as a wholeThe discussion thread includes a range of opinions on cryptocurrency, including skepticism, interest in leveraging its financial potential, and critiques of the lack of regulation. One commenter highlights the potential for self-custody in cryptocurrency, while another notes the trend towards utilizing it for financial gain. A comparison is made between index investing and derivatives, and the benefits and downsides to both approaches are discussed. Some commenters point out the need for regulation in the industry, while others argue for a free market approach. Another notable point is the potential for cryptocurrency to offer an alternative to the limitations of payment processors in certain industries.Many payment processors restrict business with certain industries beyond legal requirements, leading to interest in cryptocurrency as an alternative. Sex workers and other legally operating but stigmatized industries are turning to crypto due to moralizing terms of service and difficulty getting paid with traditional methods. Government restrictions and mass interest in crypto as a financial asset contribute to the appeal of crypto. However, keeping and transferring crypto requires significant efforts to maintain security, making the asset ill-suited for some. Despite its disadvantages, crypto attracts many speculators who seek opportunities for financial gain.The US SEC has asked a federal judge to force cryptocurrency exchanges Coinbase and Kraken to hand over user records as part of an investigation into possible illegal trading. Coinbase said it had \"received legal process requesting customers' information\" and would not comment further. In a statement on Twitter, Kraken said it hadn't yet received a subpoena but would \"evaluate and respond\" if one came in. The SEC alleges that some trading may have violated US securities law, and is also investigating whether the exchanges have failed to register as broker-dealers. Both Kraken and Coinbase say they are regulated.The Securities and Exchange Commission (SEC) is cracking down on cryptocurrency exchanges Binance and Coinbase for allegedly engaging in illegal activities such as securities trading without registering, providing incorrect information to investors, and concealing information about their operations. Critics argue that the SEC has failed to protect investors in the past and that some cryptocurrency exchanges' alleged fraud has led to skepticism about crypto investments. However, others insist that the regulatory crackdown will only make cryptocurrency more resilient and resistant to future control by governments. The impact of the regulatory actions on the cryptocurrency market is still uncertain.- Market reaction suggests people doubt US control over money\n- Expectation of toothless action due to ability to hold in self-custody\n- Possibility of market providing alternatives in case of exchange shutdown",
    "hn_summary": "- SEC grants emergency restraining order to freeze and repatriate Binance.US assets\n- Critiques of the crypto community's failure to develop a use for cryptocurrency beyond speculation and crime.\n- Range of opinions on cryptocurrency, including skepticism, interest in leveraging its financial potential, and critiques of the lack of regulation."
  }
]
