[
  {
    "id": 37286860,
    "title": "Metode baru untuk memprogram ulang sel manusia agar dapat meniru sel punca embrionik dengan lebih baik",
    "originLink": "https://www.uwa.edu.au/news/Article/2023/August/Scientists-find-way-to-wipe-a-cells-memory-to-reprogram-it-as-a-stem-cell",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37286860",
    "commentBody": "",
    "originSummary": [
      "Ilmuwan Australia telah mengembangkan metode baru yang disebut pemrograman ulang TNT untuk membuat sel manusia bertindak lebih seperti sel punca embrionik.",
      "Metode ini bertujuan untuk menghapus memori sel dan mengurangi perbedaan antara sel induk pluripoten yang diinduksi (iPS) dan sel induk embrionik (ES).",
      "Terobosan ini dapat memajukan terapi sel dan penelitian biomedis, menurut para peneliti."
    ],
    "commentSummary": [
      "Para peneliti telah menemukan metode baru untuk memprogram ulang sel manusia, membuatnya lebih mirip dengan sel punca embrionik dan berpotensi meningkatkan sel punca pluripoten yang diinduksi (iPSC) untuk tujuan penelitian.",
      "Percakapan ini membahas kemungkinan penggunaan obat-obatan untuk mengatasi masalah kesehatan akibat gaya hidup yang tidak sehat, serta dampak obesitas terhadap tingkat kanker.",
      "Ada diskusi tentang pelestarian sel punca untuk intervensi medis, memperpanjang usia manusia, dan penelitian yang sedang berlangsung untuk menghentikan penuaan dan membalikkan efeknya."
    ],
    "points": 354,
    "commentCount": 82,
    "retryCount": 0,
    "time": 1693172269
  },
  {
    "id": 37283860,
    "title": "Dari mana asal muasal font? Monotype, sebagian besar",
    "originLink": "https://thehustle.co/where-do-fonts-come-from/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37283860",
    "commentBody": "",
    "originSummary": [
      "Monotype, pemain dominan dalam industri font, memberikan tantangan bagi para desainer font independen yang berjuang untuk bersaing dan mencari nafkah.",
      "Dominasi pasar dan akuisisi Monotype menyulitkan para desainer independen untuk berkembang, karena mereka mengambil sebagian besar penghasilan mereka.",
      "Desainer independen juga menghadapi masalah dengan penggunaan font mereka secara tidak sah oleh perusahaan besar.",
      "Monotype berencana untuk memperkenalkan model langganan untuk pasar MyFonts-nya, sehingga menimbulkan kekhawatiran bahwa model ini mungkin akan menguntungkan Monotype.",
      "Monotype sedang menjajaki penggunaan AI untuk penemuan font, namun para desainer font berpendapat bahwa AI tidak dapat meniru kisah dan makna manusia di balik font."
    ],
    "commentSummary": [
      "Diskusi ini mencakup berbagai aspek font, seperti asal-usulnya, masalah hak cipta, dan dukungan untuk desainer independen.",
      "Para peserta terlibat dalam percakapan tentang rendering font pada sistem operasi yang berbeda dan pemilihan serta kombinasi font untuk tujuan desain.",
      "Monopoli dalam industri fon dan pengaruh perusahaan ekuitas swasta juga dieksplorasi, dengan fokus pada ketersediaan, kualitas, dan efektivitas fon sumber terbuka dan komersial."
    ],
    "points": 313,
    "commentCount": 157,
    "retryCount": 0,
    "time": 1693151656
  },
  {
    "id": 37284487,
    "title": "111.111,1 meter adalah 1 derajat lintang",
    "originLink": "https://gis.stackexchange.com/a/2964/5599",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37284487",
    "commentBody": "",
    "originSummary": [
      "Geographic Information Systems (GIS) Stack Exchange adalah sebuah platform bagi para kartografer, geografer, dan profesional GIS untuk bertanya dan menjawab pertanyaan.",
      "Seorang pengguna sedang mencari algoritme untuk mengimbangi koordinat lintang dan bujur dengan jarak tertentu dalam meter untuk pekerjaan mereka pada sistem tertanam.",
      "Rumus langsung Vincenty disarankan sebagai algoritma yang berpotensi membantu untuk tujuan ini, karena dikenal karena kecepatan dan akurasinya."
    ],
    "commentSummary": [
      "Diskusi ini membahas keandalan 1 derajat lintang sebagai unit pengukuran dan keterbatasan koordinat lintang dan bujur.",
      "Buku ini menyelidiki sejarah dan redefinisi meteran, menyoroti kelebihan dan kekurangan sistem pengukuran yang berbeda, seperti metrik dan imperial.",
      "Buku ini membahas resistensi terhadap metrik di AS dan kebingungan yang disebabkan oleh sistem imperial, sementara juga membahas kenyataan dan kegunaan mil laut. Selain itu, buku ini juga membahas konversi satuan dan kompleksitas pengukuran dalam konteks yang berbeda."
    ],
    "points": 297,
    "commentCount": 209,
    "retryCount": 0,
    "time": 1693155631
  },
  {
    "id": 37281745,
    "title": "Overthewire.org",
    "originLink": "https://overthewire.org/wargames/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37281745",
    "commentBody": "",
    "originSummary": [
      "Komunitas OverTheWire menyediakan permainan perang untuk membantu individu belajar dan mempraktikkan konsep keamanan.",
      "Permainan ini dapat diakses melalui SSH pada berbagai port.",
      "Komunitas ini menawarkan platform obrolan bagi para pengguna untuk mencari bantuan, mengajukan pertanyaan, atau memberikan saran. Selain itu, ada permohonan donasi yang tersedia bagi mereka yang tertarik untuk mendukung komunitas."
    ],
    "commentSummary": [
      "Overthewire.org adalah situs web yang menyediakan permainan perang untuk belajar tentang keamanan komputer dan peretasan.",
      "Para peserta dalam diskusi berbagi pengalaman mereka tentang tantangan-tantangan tersebut dan merekomendasikan sumber daya lain yang serupa.",
      "Beberapa peserta mencatat bahwa jenis tantangan ini menjadi kurang relevan karena kemajuan dalam langkah-langkah keamanan seperti ASLR dan peringatan kompiler yang lebih baik."
    ],
    "points": 295,
    "commentCount": 45,
    "retryCount": 0,
    "time": 1693137236
  },
  {
    "id": 37283375,
    "title": "Beberapa pesan kesalahan yang dihasilkan oleh kompiler MPW C Apple (2006)",
    "originLink": "https://www.cs.cmu.edu/~jasonh/personal/humor/compile.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37283375",
    "commentBody": "",
    "originSummary": [
      "Ringkasan terdiri dari pesan kesalahan dari kompiler MPW C Apple, yang didekompilasi dari sumber daya String.",
      "Pesan kesalahan termasuk komentar lucu dan sarkastik tentang kesalahan pemrograman dan keterbatasan kompiler.",
      "Masalah hak cipta juga disebutkan dalam ringkasan."
    ],
    "commentSummary": [
      "Diskusi di Hacker News mencakup berbagai topik yang berkaitan dengan pengembangan perangkat lunak, termasuk pesan kesalahan dari kompiler MPW C Apple pada tahun 2006 dan tantangan dalam mengkompilasi kode lama.",
      "Para pengguna mengungkapkan nostalgia untuk program-program lama dan mendiskusikan masalah-masalah seperti perangkat lunak yang membengkak, keterbatasan kompiler, dan harga RAM yang mahal dari Apple.",
      "Topik lain yang dibahas termasuk manajemen memori pada Apple Silicon Mac, pembatas komentar bahasa pemrograman yang berbeda, keausan SSD, peraturan baterai Uni Eropa, penunjuk kosong dalam pemrograman C, dan keinginan untuk komentar blok bersarang dalam bahasa pemrograman."
    ],
    "points": 256,
    "commentCount": 128,
    "retryCount": 0,
    "time": 1693148644
  },
  {
    "id": 37283636,
    "title": "Aku Bisa Makan Kaca",
    "originLink": "https://en.wikipedia.org/wiki/I_Can_Eat_Glass",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37283636",
    "commentBody": "",
    "originSummary": [
      "\"I Can Eat Glass\" adalah sebuah proyek linguistik yang dimulai oleh Ethan Mollick pada masa-masa awal internet.",
      "Proyek ini bertujuan untuk menerjemahkan frasa tersebut ke dalam berbagai bahasa, dan menghasilkan lebih dari 150 terjemahan.",
      "Meskipun halaman web aslinya sudah tidak tersedia lagi, proyek ini mendapatkan popularitas dan menjadi meme internet, menyediakan terjemahan yang lucu bagi para wisatawan."
    ],
    "commentSummary": [
      "Artikel ini berfokus pada proyek penerjemahan berjudul \"I Can Eat Glass\" yang mengeksplorasi berbagai terjemahan frasa ini dalam berbagai bahasa.",
      "Percakapan ini mencakup anekdot, konteks sejarah, dan perbandingan antara terjemahan, memberikan nada yang menghibur dan ringan.",
      "Selain itu, artikel ini juga menyentuh topik-topik seperti nostalgia internet, arsip meme, dan keamanan makan dengan menggunakan gelas, yang menambah kedalaman diskusi."
    ],
    "points": 241,
    "commentCount": 85,
    "retryCount": 0,
    "time": 1693150438
  },
  {
    "id": 37281692,
    "title": "WTFPython: Menjelajahi dan memahami Python melalui cuplikan-cuplikan yang mengejutkan",
    "originLink": "https://github.com/satwikkansal/wtfpython",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37281692",
    "commentBody": "",
    "originSummary": [
      "\"wtfpython\" adalah sebuah proyek yang mempelajari aspek-aspek tersembunyi dan fitur-fitur Python yang kurang dikenal dengan menggunakan cuplikan kode yang menarik.",
      "Ini mencakup berbagai topik, seperti konsep Python, pengoptimalan, perilaku tak terduga, kesalahpahaman umum, dan kiat-kiat pemrograman.",
      "Proyek ini menawarkan sumber daya yang disebut \"wtfpython\" yang memberikan penjelasan dan contoh terperinci, dan mendorong kontribusi."
    ],
    "commentSummary": [
      "Operator \"is\" dalam Python dibahas sebagai operator yang memiliki kelebihan dibandingkan operator \"==\".",
      "Keunikan dan kritik terhadap JavaScript dan Python dieksplorasi, termasuk perdebatan tentang faktor kejutan dan penggunaan bahasa pemrograman yang vulgar.",
      "Tidak ada perkembangan atau rilis baru atau menarik yang disebutkan."
    ],
    "points": 239,
    "commentCount": 72,
    "retryCount": 0,
    "time": 1693136790
  },
  {
    "id": 37282385,
    "title": "Petunjuk Jenis Python - *args dan **kwargs (2021)",
    "originLink": "https://adamj.eu/tech/2021/05/11/python-type-hints-args-and-kwargs/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37282385",
    "commentBody": "",
    "originSummary": [
      "Artikel blog ini membahas penggunaan operator argumen variabel Python, *args dan **kwargs, bersama dengan petunjuk tipe.",
      "Metode yang salah dalam mendeklarasikan tipe untuk args dan kwargs dibahas, dengan menyoroti kebutuhan untuk mendefinisikan tipe dari argumen yang terkandung.",
      "Proposal Peningkatan Python (PEP) 484 direferensikan sebagai dasar untuk pendekatan yang benar, yang melibatkan penentuan jenis argumen individual.",
      "Tulisan ini diakhiri dengan contoh yang berhasil melewati pemeriksaan tipe, yang menunjukkan keefektifan metode yang direkomendasikan."
    ],
    "commentSummary": [
      "Pembahasannya berkisar pada beberapa topik Python, seperti petunjuk tipe, tanda tangan fungsi, pewarisan, sifat, argumen kata kunci, pemotongan, fungsi variadik, nama keluarga, dan dokumentasi.",
      "Para peserta berbagi pengalaman pribadi, frustrasi, dan saran untuk menghadapi tantangan-tantangan ini.",
      "Beragam topik dan perspektif dibahas, memberikan wawasan yang berharga bagi para pengembang Python."
    ],
    "points": 238,
    "commentCount": 127,
    "retryCount": 0,
    "time": 1693141878
  },
  {
    "id": 37289151,
    "title": "Scrum adalah kanker",
    "originLink": "https://twitter.com/svpino/status/1695806027256475777",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37289151",
    "commentBody": "",
    "originSummary": [
      "Penulis tweet tersebut mengkritik keras Scrum, dengan alasan bahwa Scrum membuat tim perangkat lunak menjadi tidak efektif.",
      "Dua anekdot disediakan untuk mendukung pendapat negatif, satu tentang penggunaan Poker sebagai alat perencanaan dan satu lagi tentang keyakinan bahwa menambahkan proses meningkatkan efisiensi."
    ],
    "commentSummary": [
      "Ada perdebatan seputar implementasi dan efektivitas metodologi Scrum dan Agile dalam tim pengembangan perangkat lunak.",
      "Beberapa orang menganggap Scrum bermanfaat untuk produktivitas tim, sementara yang lain mengkritik sifatnya yang birokratis.",
      "Tantangan yang dibahas termasuk menemukan dan mempertahankan programmer berbakat, serta kekhawatiran tentang beban kerja dan tekanan dalam kerangka kerja Scrum."
    ],
    "points": 230,
    "commentCount": 201,
    "retryCount": 0,
    "time": 1693191218
  },
  {
    "id": 37283128,
    "title": "Seorang ibu ditangkap di Bangladesh setelah putranya di AS mengkritik pemerintah secara online",
    "originLink": "https://www.nbcnews.com/news/asian-america/mother-arrested-bangladesh-son-us-criticizes-government-online-rcna101392",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37283128",
    "commentBody": "",
    "originSummary": [
      "Seorang ibu di Bangladesh telah ditangkap karena unggahan putranya di Facebook yang mengkritik pemerintah.",
      "Sang anak, seorang mahasiswa Ph.D. di AS, mengungkapkan kekecewaannya atas penahanan ibunya, yang ia yakini sebagai akibat dari jabatannya.",
      "Insiden ini menimbulkan kekhawatiran akan adanya penyensoran dan penganiayaan terhadap orang-orang di diaspora Bangladesh yang berbicara menentang pemerintah."
    ],
    "commentSummary": [
      "Seorang ibu di Bangladesh ditangkap karena putranya mengkritik pemerintah secara online.",
      "Masalah penangkapan individu karena kritik online tidak hanya terjadi di Bangladesh dan mungkin memiliki implikasi geopolitik.",
      "Percakapan tersebut membahas topik-topik seperti anonimitas online, perlawanan tanpa kekerasan, dan situasi politik di Bangladesh."
    ],
    "points": 222,
    "commentCount": 110,
    "retryCount": 0,
    "time": 1693146922
  }
]
