[
  {
    "id": 37286860,
    "title": "Новый метод перепрограммирования человеческих клеток для лучшего подражания эмбриональным стволовым клеткам",
    "originLink": "https://www.uwa.edu.au/news/Article/2023/August/Scientists-find-way-to-wipe-a-cells-memory-to-reprogram-it-as-a-stem-cell",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37286860",
    "commentBody": "",
    "originSummary": [
      "Австралийские ученые разработали новый метод, получивший название TNT-репрограммирование, позволяющий заставить человеческие клетки вести себя более похоже на эмбриональные стволовые клетки.",
      "Метод направлен на стирание памяти клетки и уменьшение различий между индуцированными плюрипотентными стволовыми (iPS) и эмбриональными стволовыми (ES) клетками.",
      "По мнению исследователей, этот прорыв может способствовать развитию клеточной терапии и биомедицинских исследований."
    ],
    "commentSummary": [
      "Исследователи разработали новый метод перепрограммирования человеческих клеток, что позволяет сделать их более похожими на эмбриональные стволовые клетки и потенциально улучшить индуцированные плюрипотентные стволовые клетки (iPSC) для исследовательских целей.",
      "В ходе беседы обсуждаются возможности использования лекарственных препаратов для решения проблем здоровья, обусловленных нездоровым образом жизни, а также влияние ожирения на заболеваемость раком.",
      "Обсуждаются вопросы сохранения стволовых клеток для медицинских вмешательств, продления жизни человека, а также ведутся исследования по остановке старения и обращению его последствий."
    ],
    "points": 354,
    "commentCount": 82,
    "retryCount": 0,
    "time": 1693172269
  },
  {
    "id": 37283860,
    "title": "Откуда берутся шрифты? В основном Monotype",
    "originLink": "https://thehustle.co/where-do-fonts-come-from/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37283860",
    "commentBody": "",
    "originSummary": [
      "Компания Monotype, занимающая доминирующее положение в шрифтовой индустрии, создает проблемы для независимых дизайнеров шрифтов, которые пытаются конкурировать и зарабатывать на жизнь.",
      "Доминирование компании Monotype на рынке и ее поглощения затрудняют процветание независимых дизайнеров, поскольку забирают значительную часть их доходов.",
      "Независимые дизайнеры также сталкиваются с проблемами несанкционированного использования их шрифтов крупными корпорациями.",
      "Компания Monotype планирует ввести модель подписки для своего рынка MyFonts, что вызывает опасения, что это может быть выгодно в первую очередь Monotype.",
      "Компания Monotype изучает возможности использования искусственного интеллекта для поиска шрифтов, однако дизайнеры шрифтов утверждают, что искусственный интеллект не может повторить человеческую историю и смысл, заложенный в шрифтах."
    ],
    "commentSummary": [
      "Обсуждаются различные аспекты шрифтов, такие как их происхождение, проблемы авторского права, поддержка независимых дизайнеров.",
      "Участники обсуждают вопросы рендеринга шрифтов в различных операционных системах, выбора и сочетания шрифтов для целей дизайна.",
      "Также рассматриваются монополии в шрифтовой индустрии и влияние частных акционерных компаний, уделяется внимание доступности, качеству и эффективности шрифтов с открытым исходным кодом и коммерческих шрифтов."
    ],
    "points": 313,
    "commentCount": 157,
    "retryCount": 0,
    "time": 1693151656
  },
  {
    "id": 37284487,
    "title": "111 111,1 метра - это достоверно 1 градус широты",
    "originLink": "https://gis.stackexchange.com/a/2964/5599",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37284487",
    "commentBody": "",
    "originSummary": [
      "Geographic Information Systems (GIS) Stack Exchange - это платформа для картографов, географов и специалистов по ГИС, где они могут задавать вопросы и отвечать на них.",
      "Пользователь ищет алгоритм смещения координат широты и долготы на определенное расстояние в метрах для своей работы над встраиваемой системой.",
      "В качестве потенциально полезного алгоритма для этой цели предлагается прямая формула Винцента, известная своей скоростью и точностью."
    ],
    "commentSummary": [
      "Обсуждается вопрос о надежности 1 градуса широты как единицы измерения и об ограничениях координат широты и долготы.",
      "В ней рассматриваются история и новые определения метра, преимущества и недостатки различных систем измерения, таких как метрическая и имперская.",
      "В ней рассматриваются вопросы сопротивления метризации в США и путаницы, вызванной имперской системой, а также обсуждается реальность и полезность морских миль. Кроме того, затрагиваются вопросы конвертации единиц измерения и сложности измерений в различных контекстах."
    ],
    "points": 297,
    "commentCount": 209,
    "retryCount": 0,
    "time": 1693155631
  },
  {
    "id": 37281745,
    "title": "Overthewire.org",
    "originLink": "https://overthewire.org/wargames/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37281745",
    "commentBody": "",
    "originSummary": [
      "В сообществе OverTheWire проводятся военные игры, помогающие людям изучать и применять на практике концепции безопасности.",
      "Доступ к этим играм можно получить через SSH по различным портам.",
      "В сообществе имеется чат, в котором пользователи могут обратиться за помощью, задать вопросы или высказать свои предложения. Кроме того, для тех, кто заинтересован в поддержке сообщества, предусмотрена возможность пожертвований."
    ],
    "commentSummary": [
      "Overthewire.org - это сайт, на котором представлены игры для обучения компьютерной безопасности и взлому.",
      "Участники дискуссии делятся своим опытом решения поставленных задач и рекомендуют другие аналогичные ресурсы.",
      "Некоторые участники отмечают, что подобные проблемы становятся все менее актуальными в связи с развитием таких мер безопасности, как ASLR и более эффективные предупреждения компилятора."
    ],
    "points": 295,
    "commentCount": 45,
    "retryCount": 0,
    "time": 1693137236
  },
  {
    "id": 37283375,
    "title": "Некоторые сообщения об ошибках, выдаваемые компилятором MPW C компании Apple (2006 год)",
    "originLink": "https://www.cs.cmu.edu/~jasonh/personal/humor/compile.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37283375",
    "commentBody": "",
    "originSummary": [
      "Сводка состоит из сообщений об ошибках компилятора MPW C компании Apple, декомпилированных из ресурсов String.",
      "Сообщения об ошибках содержат юмористические и саркастические высказывания об ошибках программирования и ограничениях компилятора.",
      "В резюме также упоминаются проблемы авторского права."
    ],
    "commentSummary": [
      "Обсуждение на Hacker News затрагивает различные темы, связанные с разработкой программного обеспечения, в том числе сообщения об ошибках компилятора MPW C компании Apple в 2006 году и проблемы компиляции старого кода.",
      "Пользователи выражают ностальгию по старым программам и обсуждают такие проблемы, как раздутость программного обеспечения, ограничения компиляторов и дорогие цены на оперативную память от Apple.",
      "Также обсуждались такие темы, как управление памятью в компьютерах Apple Silicon Mac, разделители комментариев в различных языках программирования, износ твердотельных накопителей, правила Европейского союза по использованию батарей, указатели пустоты в программировании на языке Си и стремление к вложенным блочным комментариям в языках программирования."
    ],
    "points": 256,
    "commentCount": 128,
    "retryCount": 0,
    "time": 1693148644
  },
  {
    "id": 37283636,
    "title": "Я могу есть стекло",
    "originLink": "https://en.wikipedia.org/wiki/I_Can_Eat_Glass",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37283636",
    "commentBody": "",
    "originSummary": [
      "\"I Can Eat Glass\" - лингвистический проект, начатый Итаном Молликом на заре существования Интернета.",
      "Проект был направлен на перевод этой фразы на различные языки, в результате чего было создано более 150 переводов.",
      "Хотя оригинальная страница уже недоступна, проект приобрел популярность и стал интернет-мемом, предоставляя туристам юмористические переводы."
    ],
    "commentSummary": [
      "Статья посвящена переводческому проекту \"I Can Eat Glass\", в рамках которого исследуются различные варианты перевода этой фразы на разные языки.",
      "Беседа включает в себя анекдоты, исторический контекст и сравнения между переводами, что придает ей занимательный и непринужденный тон.",
      "Кроме того, в статье затрагиваются такие темы, как ностальгия по Интернету, архивы мемов и безопасность употребления стекла, что придает дискуссии дополнительную глубину."
    ],
    "points": 241,
    "commentCount": 85,
    "retryCount": 0,
    "time": 1693150438
  },
  {
    "id": 37281692,
    "title": "WTFPython: Изучение и понимание языка Python с помощью удивительных фрагментов",
    "originLink": "https://github.com/satwikkansal/wtfpython",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37281692",
    "commentBody": "",
    "originSummary": [
      "\"wtfpython\" - это проект, в котором с помощью интригующих фрагментов кода рассматриваются скрытые аспекты и малоизвестные возможности языка Python.",
      "Он охватывает широкий спектр тем, таких как концепции Python, оптимизации, неожиданные поведения, распространенные заблуждения и советы по программированию.",
      "Проект предлагает ресурс \"wtfpython\", содержащий подробные объяснения и примеры, а также поощряющий участие в проекте."
    ],
    "commentSummary": [
      "Обсуждаются преимущества оператора \"is\" в Python перед оператором \"==\".",
      "Рассматриваются особенности и критика JavaScript и Python, в том числе дискуссии о факторах неожиданности и использовании вульгаризмов в языках программирования.",
      "Никаких конкретных новых или интересных разработок или релизов не упоминается."
    ],
    "points": 239,
    "commentCount": 72,
    "retryCount": 0,
    "time": 1693136790
  },
  {
    "id": 37282385,
    "title": "Подсказки по типам Python - *args и **kwargs (2021)",
    "originLink": "https://adamj.eu/tech/2021/05/11/python-type-hints-args-and-kwargs/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37282385",
    "commentBody": "",
    "originSummary": [
      "В этой статье рассматривается использование операторов переменных аргументов Python, *args и **kwargs, в сочетании с подсказками типов.",
      "Обсуждается некорректный способ объявления типов для args и kwargs, подчеркивается необходимость определения типов содержащихся в них аргументов.",
      "За основу правильного подхода взято предложение Python Enhancement Proposal (PEP) 484, которое предполагает указание типов отдельных аргументов.",
      "В конце статьи приводится пример, который успешно проходит проверку типов, демонстрируя эффективность рекомендуемого метода."
    ],
    "commentSummary": [
      "Обсуждение ведется по нескольким темам Python, таким как подсказки типов, сигнатуры функций, наследование, черты, аргументы ключевых слов, нарезка, переменные функции, фамилии и документация.",
      "Участники делятся своим личным опытом, разочарованиями и предложениями по решению этих проблем.",
      "Рассматривается широкий спектр тем и перспектив, что дает ценные знания для разработчиков Python."
    ],
    "points": 238,
    "commentCount": 127,
    "retryCount": 0,
    "time": 1693141878
  },
  {
    "id": 37289151,
    "title": "Scrum - это рак",
    "originLink": "https://twitter.com/svpino/status/1695806027256475777",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37289151",
    "commentBody": "",
    "originSummary": [
      "Автор твита резко критикует Scrum, утверждая, что он делает команды разработчиков неэффективными.",
      "В поддержку негативного мнения приводятся два анекдота: об использовании Poker в качестве инструмента планирования и о вере в то, что добавление процесса повышает эффективность."
    ],
    "commentSummary": [
      "Вокруг внедрения и эффективности методологий Scrum и Agile в командах разработчиков программного обеспечения ведутся споры.",
      "Одни считают Scrum полезным для продуктивности команды, другие критикуют его бюрократичность.",
      "Среди обсуждаемых проблем - поиск и удержание талантливых программистов, а также проблемы, связанные с нагрузкой и давлением в рамках Scrum."
    ],
    "points": 230,
    "commentCount": 201,
    "retryCount": 0,
    "time": 1693191218
  },
  {
    "id": 37283128,
    "title": "Мать арестована в Бангладеш после того, как сын в США раскритиковал правительство в Интернете",
    "originLink": "https://www.nbcnews.com/news/asian-america/mother-arrested-bangladesh-son-us-criticizes-government-online-rcna101392",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37283128",
    "commentBody": "",
    "originSummary": [
      "Мать в Бангладеш была арестована за пост ее сына в Facebook с критикой правительства.",
      "Сын, аспирант в США, выразил недовольство по поводу задержания матери, которое, по его мнению, стало следствием его сообщения.",
      "Этот инцидент вызывает опасения по поводу цензуры и преследования людей в бангладешской диаспоре, выступающих против правительства."
    ],
    "commentSummary": [
      "Мать в Бангладеш была арестована за то, что ее сын критиковал правительство в Интернете.",
      "Проблема ареста людей за критику в Интернете не ограничивается Бангладеш и может иметь геополитические последствия.",
      "В беседе рассматриваются такие темы, как анонимность в Интернете, ненасильственное сопротивление и политическая ситуация в Бангладеш."
    ],
    "points": 222,
    "commentCount": 110,
    "retryCount": 0,
    "time": 1693146922
  }
]
