[
  {
    "id": 37286860,
    "title": "Um novo método para reprogramar células humanas para imitar melhor as células-tronco embrionárias",
    "originLink": "https://www.uwa.edu.au/news/Article/2023/August/Scientists-find-way-to-wipe-a-cells-memory-to-reprogram-it-as-a-stem-cell",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37286860",
    "commentBody": "",
    "originSummary": [
      "Cientistas australianos desenvolveram um novo método chamado reprogramação TNT para fazer com que as células humanas se comportem mais como células-tronco embrionárias.",
      "O método visa apagar a memória da célula e reduzir as diferenças entre as células-tronco pluripotentes induzidas (iPS) e as células-tronco embrionárias (ES).",
      "De acordo com os pesquisadores, essa descoberta pode promover terapias celulares e pesquisas biomédicas."
    ],
    "commentSummary": [
      "Pesquisadores desenvolveram um novo método para reprogramar células humanas, tornando-as mais semelhantes às células-tronco embrionárias e melhorando potencialmente as células-tronco pluripotentes induzidas (iPSCs) para fins de pesquisa.",
      "A conversa aborda a possibilidade de usar drogas para tratar de problemas de saúde resultantes de estilos de vida pouco saudáveis, bem como o impacto da obesidade nas taxas de câncer.",
      "Há uma discussão sobre a preservação de células-tronco para intervenções médicas, o prolongamento da vida humana e a pesquisa em andamento sobre a interrupção do envelhecimento e a reversão de seus efeitos."
    ],
    "points": 354,
    "commentCount": 82,
    "retryCount": 0,
    "time": 1693172269
  },
  {
    "id": 37283860,
    "title": "De onde vêm as fontes? Monotype, principalmente",
    "originLink": "https://thehustle.co/where-do-fonts-come-from/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37283860",
    "commentBody": "",
    "originSummary": [
      "A Monotype, uma empresa dominante no setor de fontes, está colocando desafios para os designers de fontes independentes que lutam para competir e ganhar a vida.",
      "O domínio do mercado e as aquisições da Monotype dificultam a prosperidade dos designers independentes, já que eles ficam com uma parte significativa de seus ganhos.",
      "Os designers independentes também enfrentam problemas com o uso não autorizado de suas fontes por grandes corporações.",
      "A Monotype está planejando introduzir um modelo de assinatura para seu mercado MyFonts, levantando preocupações de que isso possa beneficiar principalmente a Monotype.",
      "A Monotype está explorando o uso da IA para a descoberta de fontes, mas os designers de fontes argumentam que a IA não pode replicar a história humana e o significado por trás das fontes."
    ],
    "commentSummary": [
      "A discussão abrange vários aspectos das fontes, como suas origens, preocupações com direitos autorais e suporte a designers independentes.",
      "Os participantes participam de conversas sobre a renderização de fontes em diferentes sistemas operacionais e a seleção e combinação de fontes para fins de design.",
      "Os monopólios no setor de fontes e a influência das empresas de capital privado também são explorados, com foco na disponibilidade, qualidade e eficácia das fontes comerciais e de código aberto."
    ],
    "points": 313,
    "commentCount": 157,
    "retryCount": 0,
    "time": 1693151656
  },
  {
    "id": 37284487,
    "title": "111.111,1 metros é, de forma confiável, 1 grau de latitude",
    "originLink": "https://gis.stackexchange.com/a/2964/5599",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37284487",
    "commentBody": "",
    "originSummary": [
      "O Geographic Information Systems (GIS) Stack Exchange é uma plataforma para cartógrafos, geógrafos e profissionais de GIS fazerem e responderem perguntas.",
      "Um usuário está procurando um algoritmo para compensar as coordenadas de latitude e longitude por uma distância específica em metros para seu trabalho em um sistema incorporado.",
      "A fórmula direta de Vincenty é sugerida como um algoritmo potencialmente útil para essa finalidade, pois é conhecida por sua velocidade e precisão."
    ],
    "commentSummary": [
      "A discussão explora a confiabilidade de 1 grau de latitude como uma unidade de medida e as limitações das coordenadas de latitude e longitude.",
      "Ele se aprofunda na história e nas redefinições do metro, destacando as vantagens e desvantagens de diferentes sistemas de medição, como o métrico e o imperial.",
      "Ele aborda a resistência à metrificação nos EUA e a confusão causada pelo sistema imperial, além de discutir a realidade e a utilidade das milhas náuticas. Além disso, aborda as conversões de unidades e as complexidades das medidas em diferentes contextos."
    ],
    "points": 297,
    "commentCount": 209,
    "retryCount": 0,
    "time": 1693155631
  },
  {
    "id": 37281745,
    "title": "Overthewire.org",
    "originLink": "https://overthewire.org/wargames/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37281745",
    "commentBody": "",
    "originSummary": [
      "A comunidade OverTheWire oferece jogos de guerra para ajudar as pessoas a aprender e praticar conceitos de segurança.",
      "Esses jogos podem ser acessados por meio de SSH em várias portas.",
      "A comunidade oferece uma plataforma de bate-papo para que os usuários busquem assistência, façam perguntas ou forneçam sugestões. Além disso, há uma solicitação de doação disponível para os interessados em apoiar a comunidade."
    ],
    "commentSummary": [
      "O Overthewire.org é um site que oferece jogos de guerra para aprender sobre segurança de computadores e hacking.",
      "Os participantes da discussão compartilham suas experiências com os desafios e recomendam outros recursos semelhantes.",
      "Alguns participantes observaram que esses tipos de desafios estão se tornando menos relevantes devido aos avanços nas medidas de segurança, como ASLR e melhores avisos do compilador."
    ],
    "points": 295,
    "commentCount": 45,
    "retryCount": 0,
    "time": 1693137236
  },
  {
    "id": 37283375,
    "title": "Algumas das mensagens de erro produzidas pelo compilador MPW C da Apple (2006)",
    "originLink": "https://www.cs.cmu.edu/~jasonh/personal/humor/compile.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37283375",
    "commentBody": "",
    "originSummary": [
      "O resumo consiste em mensagens de erro do compilador MPW C da Apple, descompilado a partir dos recursos String.",
      "As mensagens de erro incluem comentários bem-humorados e sarcásticos sobre erros de programação e limitações do compilador.",
      "As preocupações com os direitos autorais também são mencionadas no resumo."
    ],
    "commentSummary": [
      "A discussão no Hacker News abrange vários tópicos relacionados ao desenvolvimento de software, incluindo mensagens de erro do compilador MPW C da Apple em 2006 e os desafios de compilar códigos antigos.",
      "Os usuários expressam nostalgia por programas mais antigos e discutem questões como inchaço de software, limitações do compilador e preços caros de RAM da Apple.",
      "Outros tópicos discutidos incluem o gerenciamento de memória em Macs de silício da Apple, delimitadores de comentários de diferentes linguagens de programação, desgaste de SSDs, regulamentações da União Europeia sobre baterias, ponteiros vazios na programação em C e o desejo de comentários de blocos aninhados em linguagens de programação."
    ],
    "points": 256,
    "commentCount": 128,
    "retryCount": 0,
    "time": 1693148644
  },
  {
    "id": 37283636,
    "title": "Eu posso comer vidro",
    "originLink": "https://en.wikipedia.org/wiki/I_Can_Eat_Glass",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37283636",
    "commentBody": "",
    "originSummary": [
      "\"I Can Eat Glass\" foi um projeto linguístico iniciado por Ethan Mollick nos primórdios da Internet.",
      "O projeto tinha como objetivo traduzir a frase para vários idiomas, resultando em mais de 150 traduções.",
      "Embora a página da Web original não esteja mais disponível, o projeto ganhou popularidade e se tornou um meme da Internet, fornecendo traduções bem-humoradas para os turistas."
    ],
    "commentSummary": [
      "O artigo se concentra em um projeto de tradução chamado \"I Can Eat Glass\", que explora as várias traduções dessa frase em diferentes idiomas.",
      "A conversa inclui anedotas, contexto histórico e comparações entre traduções, proporcionando um tom divertido e descontraído.",
      "Além disso, o artigo aborda tópicos como a nostalgia da Internet, arquivos de memes e a segurança de comer vidro, acrescentando profundidade à discussão."
    ],
    "points": 241,
    "commentCount": 85,
    "retryCount": 0,
    "time": 1693150438
  },
  {
    "id": 37281692,
    "title": "WTFPython: Explorando e entendendo Python através de trechos surpreendentes",
    "originLink": "https://github.com/satwikkansal/wtfpython",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37281692",
    "commentBody": "",
    "originSummary": [
      "O \"wtfpython\" é um projeto que investiga os aspectos ocultos e os recursos menos conhecidos do Python usando trechos de código intrigantes.",
      "Ele abrange uma ampla gama de tópicos, como conceitos de Python, otimizações, comportamentos inesperados, equívocos comuns e dicas de programação.",
      "O projeto oferece um recurso chamado \"wtfpython\" que fornece explicações e exemplos detalhados e incentiva contribuições."
    ],
    "commentSummary": [
      "O operador \"is\" em Python é discutido como tendo vantagens sobre o operador \"==\".",
      "As peculiaridades e críticas do JavaScript e do Python são exploradas, incluindo debates sobre fatores surpresa e o uso de vulgaridades em linguagens de programação.",
      "Nenhum desenvolvimento ou lançamento específico, novo ou empolgante, foi mencionado."
    ],
    "points": 239,
    "commentCount": 72,
    "retryCount": 0,
    "time": 1693136790
  },
  {
    "id": 37282385,
    "title": "Dicas de tipo Python - *args e **kwargs (2021)",
    "originLink": "https://adamj.eu/tech/2021/05/11/python-type-hints-args-and-kwargs/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37282385",
    "commentBody": "",
    "originSummary": [
      "A postagem do blog explora o uso dos operadores de argumento variável do Python, *args e **kwargs, em conjunto com dicas de tipo.",
      "O método incorreto de declarar tipos para args e kwargs é discutido, destacando a necessidade de definir os tipos dos argumentos contidos.",
      "A Proposta de Aprimoramento do Python (PEP) 484 é referenciada como base para a abordagem correta, que envolve a especificação dos tipos dos argumentos individuais.",
      "A postagem é concluída com um exemplo que passa com êxito nas verificações de tipo, demonstrando a eficácia do método recomendado."
    ],
    "commentSummary": [
      "A discussão gira em torno de vários tópicos do Python, como dicas de tipos, assinaturas de funções, herança, características, argumentos de palavras-chave, fatiamento, funções variadas, sobrenomes e documentação.",
      "Os participantes compartilham suas experiências pessoais, frustrações e sugestões para lidar com esses desafios.",
      "Uma gama diversificada de tópicos e perspectivas é abordada, fornecendo insights valiosos para os desenvolvedores de Python."
    ],
    "points": 238,
    "commentCount": 127,
    "retryCount": 0,
    "time": 1693141878
  },
  {
    "id": 37289151,
    "title": "Scrum é um câncer",
    "originLink": "https://twitter.com/svpino/status/1695806027256475777",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37289151",
    "commentBody": "",
    "originSummary": [
      "O autor do tweet critica fortemente o Scrum, argumentando que ele torna as equipes de software ineficazes.",
      "Duas anedotas são fornecidas para apoiar a opinião negativa, uma sobre o uso do Poker como ferramenta de planejamento e outra sobre a crença de que adicionar processos melhora a eficiência."
    ],
    "commentSummary": [
      "Há um debate em torno da implementação e da eficácia das metodologias Scrum e Agile nas equipes de desenvolvimento de software.",
      "Algumas pessoas consideram o Scrum útil para a produtividade da equipe, enquanto outras criticam sua natureza burocrática.",
      "Os desafios discutidos incluem encontrar e reter programadores talentosos, além de preocupações com a carga de trabalho e a pressão dentro da estrutura do Scrum."
    ],
    "points": 230,
    "commentCount": 201,
    "retryCount": 0,
    "time": 1693191218
  },
  {
    "id": 37283128,
    "title": "Mãe é presa em Bangladesh após filho nos EUA criticar o governo on-line",
    "originLink": "https://www.nbcnews.com/news/asian-america/mother-arrested-bangladesh-son-us-criticizes-government-online-rcna101392",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37283128",
    "commentBody": "",
    "originSummary": [
      "Uma mãe em Bangladesh foi presa devido a uma publicação no Facebook de seu filho criticando o governo.",
      "O filho, um estudante de doutorado nos EUA, expressou frustração com a detenção de sua mãe, que ele acredita ter sido resultado de sua postagem.",
      "Esse incidente levanta preocupações sobre a censura e a perseguição de pessoas da diáspora de Bangladesh que se manifestam contra o governo."
    ],
    "commentSummary": [
      "Uma mãe em Bangladesh foi presa porque seu filho criticou o governo on-line.",
      "A questão da prisão de indivíduos por críticas on-line não se limita a Bangladesh e pode ter implicações geopolíticas.",
      "A conversa explora tópicos como o anonimato on-line, a resistência não violenta e a situação política em Bangladesh."
    ],
    "points": 222,
    "commentCount": 110,
    "retryCount": 0,
    "time": 1693146922
  }
]
