[
  {
    "id": 37286860,
    "title": "Nová metóda na preprogramovanie ľudských buniek, aby lepšie napodobňovali embryonálne kmeňové bunky",
    "originLink": "https://www.uwa.edu.au/news/Article/2023/August/Scientists-find-way-to-wipe-a-cells-memory-to-reprogram-it-as-a-stem-cell",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37286860",
    "commentBody": "",
    "originSummary": [
      "Austrálski vedci vyvinuli novú metódu nazývanú TNT reprogramovanie, ktorá umožňuje, aby sa ľudské bunky správali viac ako embryonálne kmeňové bunky.",
      "Cieľom metódy je vymazať pamäť buniek a znížiť rozdiely medzi indukovanými pluripotentnými kmeňovými bunkami (iPS) a embryonálnymi kmeňovými bunkami (ES).",
      "Podľa vedcov by tento prelom mohol priniesť pokrok v bunkovej terapii a biomedicínskom výskume."
    ],
    "commentSummary": [
      "Výskumníci vyvinuli novú metódu na preprogramovanie ľudských buniek, vďaka ktorej sa viac podobajú embryonálnym kmeňovým bunkám a potenciálne sa môžu zlepšiť indukované pluripotentné kmeňové bunky (iPSC) na výskumné účely.",
      "Rozhovor sa zaoberá možnosťou využitia drog na riešenie zdravotných problémov vyplývajúcich z nezdravého životného štýlu, ako aj vplyvom obezity na výskyt rakoviny.",
      "Diskutuje sa o zachovaní kmeňových buniek na lekárske zákroky, predlžovaní ľudského života a prebiehajúcom výskume zastavenia starnutia a zvrátenia jeho účinkov."
    ],
    "points": 354,
    "commentCount": 82,
    "retryCount": 0,
    "time": 1693172269
  },
  {
    "id": 37283860,
    "title": "Odkiaľ pochádzajú písma? Väčšinou z Monotype",
    "originLink": "https://thehustle.co/where-do-fonts-come-from/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37283860",
    "commentBody": "",
    "originSummary": [
      "Spoločnosť Monotype, dominantný hráč v odvetví písiem, predstavuje výzvu pre nezávislých dizajnérov písiem, ktorí sa snažia konkurovať a uživiť sa.",
      "Dominantné postavenie spoločnosti Monotype na trhu a jej akvizície sťažujú nezávislým dizajnérom prosperitu, pretože im berú značnú časť zárobku.",
      "Nezávislí dizajnéri majú problémy aj s neoprávneným používaním ich písiem veľkými spoločnosťami.",
      "Spoločnosť Monotype plánuje zaviesť model predplatného pre svoje trhovisko MyFonts, čo vyvoláva obavy, že z neho môže profitovať predovšetkým spoločnosť Monotype.",
      "Spoločnosť Monotype skúma možnosti využitia umelej inteligencie na objavovanie písiem, ale dizajnéri písiem tvrdia, že umelá inteligencia nedokáže kopírovať ľudský príbeh a význam písma."
    ],
    "commentSummary": [
      "Diskusia zahŕňa rôzne aspekty písiem, ako je ich pôvod, otázky autorských práv a podpora nezávislých dizajnérov.",
      "Účastníci sa zapojia do rozhovorov o vykresľovaní písma v rôznych operačných systémoch a o výbere a kombinácii písiem na účely dizajnu.",
      "Skúmajú sa aj monopoly v odvetví písiem a vplyv súkromných kapitálových spoločností so zameraním na dostupnosť, kvalitu a účinnosť písiem s otvoreným zdrojovým kódom a komerčných písiem."
    ],
    "points": 313,
    "commentCount": 157,
    "retryCount": 0,
    "time": 1693151656
  },
  {
    "id": 37284487,
    "title": "111,111.1 metrov je spoľahlivo 1 stupeň zemepisnej šírky",
    "originLink": "https://gis.stackexchange.com/a/2964/5599",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37284487",
    "commentBody": "",
    "originSummary": [
      "Geografické informačné systémy (GIS) Stack Exchange je platforma pre kartografov, geografov a profesionálov v oblasti GIS, kde môžu klásť otázky a odpovedať na ne.",
      "Používateľ hľadá algoritmus na posunutie súradníc zemepisnej šírky a dĺžky o určitú vzdialenosť v metroch pre svoju prácu na vstavanom systéme.",
      "Ako potenciálne užitočný algoritmus na tento účel sa navrhuje Vincentyho priamy vzorec, ktorý je známy svojou rýchlosťou a presnosťou."
    ],
    "commentSummary": [
      "V diskusii sa skúma spoľahlivosť 1 stupňa zemepisnej šírky ako mernej jednotky a obmedzenia súradníc zemepisnej šírky a dĺžky.",
      "Venuje sa histórii a novým definíciám metra, pričom poukazuje na výhody a nevýhody rôznych meracích systémov, ako sú metrické a imperiálne.",
      "Zaoberá sa odporom voči metrizácii v USA a zmätkom, ktorý spôsobuje imperiálny systém, a zároveň diskutuje o reálnosti a užitočnosti námorných míľ. Okrem toho sa dotýka prevodov jednotiek a zložitosti merania v rôznych kontextoch."
    ],
    "points": 297,
    "commentCount": 209,
    "retryCount": 0,
    "time": 1693155631
  },
  {
    "id": 37281745,
    "title": "Overthewire.org",
    "originLink": "https://overthewire.org/wargames/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37281745",
    "commentBody": "",
    "originSummary": [
      "Komunita OverTheWire poskytuje vojnové hry, ktoré pomáhajú jednotlivcom učiť sa a precvičovať bezpečnostné koncepty.",
      "K týmto hrám môžete pristupovať cez SSH na rôznych portoch.",
      "Komunita ponúka chatovú platformu, kde môžu používatelia hľadať pomoc, klásť otázky alebo poskytovať návrhy. Okrem toho je k dispozícii prosba o darcovstvo pre tých, ktorí majú záujem podporiť komunitu."
    ],
    "commentSummary": [
      "Overthewire.org je webová stránka, ktorá poskytuje vojnové hry na učenie sa o počítačovej bezpečnosti a hackingu.",
      "Účastníci diskusie sa podelia o svoje skúsenosti s výzvami a odporučia ďalšie podobné zdroje.",
      "Niektorí účastníci poznamenávajú, že tieto typy výziev sa stávajú menej relevantnými vďaka pokroku v bezpečnostných opatreniach, ako je ASLR a lepšie varovania kompilátora."
    ],
    "points": 295,
    "commentCount": 45,
    "retryCount": 0,
    "time": 1693137236
  },
  {
    "id": 37283375,
    "title": "Niektoré chybové hlásenia kompilátora MPW C od spoločnosti Apple (2006)",
    "originLink": "https://www.cs.cmu.edu/~jasonh/personal/humor/compile.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37283375",
    "commentBody": "",
    "originSummary": [
      "Súhrn pozostáva z chybových hlásení kompilátora MPW C spoločnosti Apple, dekompilovaných zo zdrojov String.",
      "Chybové hlásenia obsahujú vtipné a sarkastické poznámky o programátorských chybách a obmedzeniach kompilátora.",
      "V zhrnutí sa uvádzajú aj obavy týkajúce sa autorských práv."
    ],
    "commentSummary": [
      "Diskusia na portáli Hacker News sa zaoberá rôznymi témami súvisiacimi s vývojom softvéru vrátane chybových hlásení kompilátora MPW C od spoločnosti Apple v roku 2006 a problémov pri kompilácii starého kódu.",
      "Používatelia vyjadrujú nostalgiu za staršími programami a diskutujú o problémoch, ako je napríklad preťaženie softvéru, obmedzenia kompilátora a drahé ceny pamäte RAM od spoločnosti Apple.",
      "Medzi ďalšie diskutované témy patrí správa pamäte v počítačoch Apple Silicon Mac, oddeľovače komentárov v rôznych programovacích jazykoch, opotrebovanie SSD, nariadenia Európskej únie o batériách, ukazovatele void v programovacom jazyku C a snaha o vnorené blokové komentáre v programovacích jazykoch."
    ],
    "points": 256,
    "commentCount": 128,
    "retryCount": 0,
    "time": 1693148644
  },
  {
    "id": 37283636,
    "title": "Môžem jesť sklo",
    "originLink": "https://en.wikipedia.org/wiki/I_Can_Eat_Glass",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37283636",
    "commentBody": "",
    "originSummary": [
      "\"I Can Eat Glass\" bol jazykový projekt, ktorý začal Ethan Mollick v začiatkoch internetu.",
      "Cieľom projektu bolo preložiť túto frázu do rôznych jazykov a výsledkom bolo viac ako 150 prekladov.",
      "Hoci pôvodná webová stránka už nie je dostupná, projekt si získal popularitu a stal sa internetovým mémom, ktorý poskytuje turistom vtipné preklady."
    ],
    "commentSummary": [
      "Článok sa zameriava na prekladateľský projekt s názvom \"I Can Eat Glass\", ktorý skúma rôzne preklady tejto frázy v rôznych jazykoch.",
      "Rozhovor obsahuje anekdoty, historický kontext a porovnania medzi prekladmi, ktoré sa nesú v zábavnom a odľahčenom tóne.",
      "Okrem toho sa článok dotýka tém, ako je internetová nostalgia, archívy mémov a bezpečnosť konzumácie skla, čím sa diskusia prehlbuje."
    ],
    "points": 241,
    "commentCount": 85,
    "retryCount": 0,
    "time": 1693150438
  },
  {
    "id": 37281692,
    "title": "WTFPython: Zisťovanie a pochopenie jazyka Python prostredníctvom prekvapivých úryvkov",
    "originLink": "https://github.com/satwikkansal/wtfpython",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37281692",
    "commentBody": "",
    "originSummary": [
      "\"wtfpython\" je projekt, ktorý sa zaoberá skrytými aspektmi a menej známymi funkciami jazyka Python pomocou zaujímavých úryvkov kódu.",
      "Zahŕňa širokú škálu tém, ako sú koncepty jazyka Python, optimalizácie, neočakávané správanie, bežné mylné predstavy a tipy na programovanie.",
      "Projekt ponúka zdroj s názvom \"wtfpython\", ktorý poskytuje podrobné vysvetlenia a príklady a podporuje prispievanie."
    ],
    "commentSummary": [
      "O operátore \"is\" v jazyku Python sa hovorí, že má výhody oproti operátoru \"==\".",
      "Skúmajú sa zvláštnosti a kritika jazykov JavaScript a Python vrátane diskusií o faktoroch prekvapenia a používaní vulgarizmov v programovacích jazykoch.",
      "Žiadne konkrétne nové alebo vzrušujúce novinky alebo vydania neboli spomenuté."
    ],
    "points": 239,
    "commentCount": 72,
    "retryCount": 0,
    "time": 1693136790
  },
  {
    "id": 37282385,
    "title": "Tipy jazyka Python - *args a **kwargs (2021)",
    "originLink": "https://adamj.eu/tech/2021/05/11/python-type-hints-args-and-kwargs/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37282385",
    "commentBody": "",
    "originSummary": [
      "Príspevok sa zaoberá používaním operátorov premenných argumentov v jazyku Python, *args a **kwargs, v spojení s typovými nápovedami.",
      "Diskutuje sa o nesprávnom spôsobe deklarovania typov pre args a kwargs, pričom sa zdôrazňuje potreba definovať typy obsiahnutých argumentov.",
      "Ako základ správneho prístupu sa uvádza návrh na rozšírenie jazyka Python (PEP) 484, ktorý zahŕňa špecifikáciu typov jednotlivých argumentov.",
      "V závere príspevku je uvedený príklad, ktorý úspešne prešiel typovými kontrolami a ukazuje účinnosť odporúčanej metódy."
    ],
    "commentSummary": [
      "Diskusia sa točí okolo niekoľkých tém jazyka Python, ako sú typové nápovedy, signatúry funkcií, dedičnosť, črty, argumenty kľúčových slov, rezanie, variadické funkcie, priezviská a dokumentácia.",
      "Účastníci sa podelia o svoje osobné skúsenosti, frustrácie a návrhy na riešenie týchto problémov.",
      "Pokrýva rôznorodé témy a pohľady, ktoré poskytujú cenné poznatky pre vývojárov Pythonu."
    ],
    "points": 238,
    "commentCount": 127,
    "retryCount": 0,
    "time": 1693141878
  },
  {
    "id": 37289151,
    "title": "Scrum je rakovina",
    "originLink": "https://twitter.com/svpino/status/1695806027256475777",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37289151",
    "commentBody": "",
    "originSummary": [
      "Autor tweetu ostro kritizuje Scrum a tvrdí, že robí softvérové tímy neefektívnymi.",
      "Na podporu negatívneho názoru sú uvedené dve anekdoty, jedna o používaní pokru ako nástroja plánovania a druhá o presvedčení, že pridanie procesu zvyšuje efektívnosť."
    ],
    "commentSummary": [
      "Okolo implementácie a účinnosti metodík Scrum a Agile v tímoch zaoberajúcich sa vývojom softvéru sa vedú diskusie.",
      "Niektorí ľudia považujú Scrum za užitočný pre tímovú produktivitu, zatiaľ čo iní kritizujú jeho byrokratickú povahu.",
      "Medzi diskutované výzvy patrí hľadanie a udržanie talentovaných programátorov, ako aj obavy z pracovného zaťaženia a tlaku v rámci Scrum."
    ],
    "points": 230,
    "commentCount": 201,
    "retryCount": 0,
    "time": 1693191218
  },
  {
    "id": 37283128,
    "title": "Matku zatkli v Bangladéši po tom, čo syn v USA kritizoval vládu na internete",
    "originLink": "https://www.nbcnews.com/news/asian-america/mother-arrested-bangladesh-son-us-criticizes-government-online-rcna101392",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37283128",
    "commentBody": "",
    "originSummary": [
      "V Bangladéši bola zatknutá matka za príspevok svojho syna na Facebooku, v ktorom kritizoval vládu.",
      "Syn, doktorand v USA, vyjadril frustráciu zo zadržania svojej matky, ktoré bolo podľa neho dôsledkom jeho príspevku.",
      "Tento incident vyvoláva obavy z cenzúry a prenasledovania ľudí v bangladéšskej diaspóre, ktorí vystupujú proti vláde."
    ],
    "commentSummary": [
      "V Bangladéši zatkli matku, pretože jej syn kritizoval vládu na internete.",
      "Otázka zatýkania osôb za kritiku na internete sa neobmedzuje len na Bangladéš a môže mať geopolitické dôsledky.",
      "V rozhovore sa rozoberajú témy ako anonymita online, nenásilný odpor a politická situácia v Bangladéši."
    ],
    "points": 222,
    "commentCount": 110,
    "retryCount": 0,
    "time": 1693146922
  }
]
