[
  {
    "id": 37286860,
    "title": "İnsan hücrelerini embriyonik kök hücreleri daha iyi taklit edecek şekilde yeniden programlamak için yeni bir yöntem",
    "originLink": "https://www.uwa.edu.au/news/Article/2023/August/Scientists-find-way-to-wipe-a-cells-memory-to-reprogram-it-as-a-stem-cell",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37286860",
    "commentBody": "",
    "originSummary": [
      "Avustralyalı bilim insanları, insan hücrelerinin embriyonik kök hücreler gibi davranmasını sağlamak için TNT yeniden programlama adı verilen yeni bir yöntem geliştirdi.",
      "Yöntem, hücrenin hafızasını silmeyi ve indüklenmiş pluripotent kök (iPS) hücreler ile embriyonik kök (ES) hücreler arasındaki farklılıkları azaltmayı amaçlıyor.",
      "Araştırmacılara göre bu buluş, hücre tedavilerini ve biyomedikal araştırmaları ilerletebilir."
    ],
    "commentSummary": [
      "Araştırmacılar insan hücrelerini yeniden programlamak için yeni bir yöntem geliştirerek onları embriyonik kök hücrelere daha benzer hale getirdi ve araştırma amaçlı indüklenmiş pluripotent kök hücreleri (iPSC'ler) potansiyel olarak geliştirdi.",
      "Görüşmede, sağlıksız yaşam tarzından kaynaklanan sağlık sorunlarını gidermek için ilaç kullanma olasılığının yanı sıra obezitenin kanser oranları üzerindeki etkisi de ele alınıyor.",
      "Tıbbi müdahaleler için kök hücrelerin korunması, insan ömrünün uzatılması ve yaşlanmanın durdurulması ve etkilerinin tersine çevrilmesi üzerine devam eden araştırmalar hakkında bir tartışma var."
    ],
    "points": 354,
    "commentCount": 82,
    "retryCount": 0,
    "time": 1693172269
  },
  {
    "id": 37283860,
    "title": "Yazı tipleri nereden geliyor? Çoğunlukla Monotype",
    "originLink": "https://thehustle.co/where-do-fonts-come-from/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37283860",
    "commentBody": "",
    "originSummary": [
      "Yazı tipi endüstrisinde baskın bir oyuncu olan Monotype, rekabet etmek ve geçimini sağlamak için mücadele eden bağımsız yazı tipi tasarımcıları için zorluklar yaratıyor.",
      "Monotype'ın pazar hakimiyeti ve satın almaları, kazançlarının önemli bir kısmını aldıkları için bağımsız tasarımcıların gelişmesini zorlaştırıyor.",
      "Bağımsız tasarımcılar da fontlarının büyük şirketler tarafından izinsiz kullanımıyla ilgili sorunlarla karşılaşmaktadır.",
      "Monotype, MyFonts pazarı için bir abonelik modeli getirmeyi planlıyor ve bu da öncelikle Monotype'a fayda sağlayabileceği endişelerini artırıyor.",
      "Monotype, font keşfi için yapay zeka kullanımını araştırıyor, ancak font tasarımcıları yapay zekanın insan hikayesini ve fontların arkasındaki anlamı kopyalayamayacağını savunuyor."
    ],
    "commentSummary": [
      "Tartışma, fontların kökenleri, telif hakkı endişeleri ve bağımsız tasarımcılara destek gibi çeşitli yönlerini kapsıyor.",
      "Katılımcılar, farklı işletim sistemlerinde yazı tipi oluşturma ve tasarım amaçlı yazı tipi seçimi ve kombinasyonu hakkında konuşurlar.",
      "Font endüstrisindeki tekeller ve özel sermaye şirketlerinin etkisi de açık kaynaklı ve ticari fontların kullanılabilirliği, kalitesi ve etkinliğine odaklanılarak incelenmektedir."
    ],
    "points": 313,
    "commentCount": 157,
    "retryCount": 0,
    "time": 1693151656
  },
  {
    "id": 37284487,
    "title": "111,111.1 metre güvenilir bir şekilde 1 derece enlemdir",
    "originLink": "https://gis.stackexchange.com/a/2964/5599",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37284487",
    "commentBody": "",
    "originSummary": [
      "Coğrafi Bilgi Sistemleri (CBS) Stack Exchange, haritacılar, coğrafyacılar ve CBS uzmanlarının soru sorup cevaplayabilecekleri bir platformdur.",
      "Bir kullanıcı, gömülü bir sistem üzerindeki çalışmaları için enlem ve boylam koordinatlarını metre cinsinden belirli bir mesafe ile dengeleyecek bir algoritma arıyor.",
      "Vincenty'nin doğrudan formülü, hızı ve doğruluğu ile bilindiği için bu amaç için potansiyel olarak yararlı bir algoritma olarak önerilmektedir."
    ],
    "commentSummary": [
      "Tartışma, bir ölçü birimi olarak 1 derece enlemin güvenilirliğini ve enlem ve boylam koordinatlarının sınırlamalarını araştırmaktadır.",
      "Metrenin tarihini ve yeniden tanımlanışını inceliyor, metrik ve emperyal gibi farklı ölçüm sistemlerinin avantaj ve dezavantajlarını vurguluyor.",
      "ABD'de metrikleştirmeye karşı direnişi ve emperyal sistemin neden olduğu kafa karışıklığını ele alırken, deniz milinin gerçekliğini ve kullanışlılığını da tartışıyor. Ayrıca, birim dönüşümlerine ve farklı bağlamlardaki ölçümlerin karmaşıklığına değinmektedir."
    ],
    "points": 297,
    "commentCount": 209,
    "retryCount": 0,
    "time": 1693155631
  },
  {
    "id": 37281745,
    "title": "Overthewire.org",
    "originLink": "https://overthewire.org/wargames/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37281745",
    "commentBody": "",
    "originSummary": [
      "OverTheWire topluluğu, bireylerin güvenlik kavramlarını öğrenmelerine ve uygulamalarına yardımcı olmak için savaş oyunları sağlar.",
      "Bu oyunlara SSH aracılığıyla çeşitli portlardan erişilebilir.",
      "Topluluk, kullanıcıların yardım istemeleri, soru sormaları veya önerilerde bulunmaları için bir sohbet platformu sunmaktadır. Ayrıca, topluluğu desteklemek isteyenler için bir bağış talebi de mevcut."
    ],
    "commentSummary": [
      "Overthewire.org, bilgisayar güvenliği ve bilgisayar korsanlığı hakkında bilgi edinmek için savaş oyunları sağlayan bir web sitesidir.",
      "Tartışmaya katılanlar zorluklarla ilgili deneyimlerini paylaşıyor ve benzer başka kaynaklar öneriyor.",
      "Bazı katılımcılar, ASLR ve daha iyi derleyici uyarıları gibi güvenlik önlemlerindeki ilerlemeler nedeniyle bu tür zorlukların daha az önemli hale geldiğini belirtiyor."
    ],
    "points": 295,
    "commentCount": 45,
    "retryCount": 0,
    "time": 1693137236
  },
  {
    "id": 37283375,
    "title": "Apple'ın MPW C derleyicisi tarafından üretilen bazı hata mesajları (2006)",
    "originLink": "https://www.cs.cmu.edu/~jasonh/personal/humor/compile.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37283375",
    "commentBody": "",
    "originSummary": [
      "Özet, Apple'ın MPW C derleyicisinden gelen ve String kaynaklarından derlenen hata mesajlarından oluşur.",
      "Hata mesajları, programlama hataları ve derleyicinin sınırlamaları hakkında esprili ve alaycı ifadeler içerir.",
      "Özette telif hakkı endişelerinden de bahsedilmektedir."
    ],
    "commentSummary": [
      "Hacker News'deki tartışma, 2006 yılında Apple'ın MPW C derleyicisinden gelen hata mesajları ve eski kodu derlemenin zorlukları da dahil olmak üzere yazılım geliştirme ile ilgili çeşitli konuları kapsıyor.",
      "Kullanıcılar eski programlar için nostaljilerini dile getiriyor ve yazılım şişkinliği, derleyici sınırlamaları ve Apple'ın pahalı RAM fiyatları gibi konuları tartışıyorlar.",
      "Tartışılan diğer konular arasında Apple Silicon Mac'lerde bellek yönetimi, farklı programlama dillerinin yorum sınırlayıcıları, SSD aşınması, Avrupa Birliği'nin pil düzenlemeleri, C programlamada void işaretçileri ve programlama dillerinde iç içe geçmiş blok yorumlarına duyulan istek yer alıyor."
    ],
    "points": 256,
    "commentCount": 128,
    "retryCount": 0,
    "time": 1693148644
  },
  {
    "id": 37283636,
    "title": "Cam Yiyebilirim",
    "originLink": "https://en.wikipedia.org/wiki/I_Can_Eat_Glass",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37283636",
    "commentBody": "",
    "originSummary": [
      "\"I Can Eat Glass\" Ethan Mollick tarafından internetin ilk günlerinde başlatılan dilbilimsel bir projeydi.",
      "Bu ifadenin çeşitli dillere çevrilmesini amaçlayan proje sonucunda 150'den fazla çeviri yapılmıştır.",
      "Orijinal web sayfası artık mevcut olmasa da, proje popülerlik kazandı ve turistler için esprili çeviriler sağlayan bir internet meme'i haline geldi."
    ],
    "commentSummary": [
      "Makale, bu ifadenin farklı dillerdeki çeşitli çevirilerini araştıran \"I Can Eat Glass\" adlı bir çeviri projesine odaklanıyor.",
      "Anekdotlar, tarihsel bağlam ve çeviriler arasında karşılaştırmalar içeren sohbet, eğlenceli ve neşeli bir ton sunuyor.",
      "Makale ayrıca internet nostaljisi, meme arşivleri ve cam yemenin güvenliği gibi konulara da değinerek tartışmaya derinlik katıyor."
    ],
    "points": 241,
    "commentCount": 85,
    "retryCount": 0,
    "time": 1693150438
  },
  {
    "id": 37281692,
    "title": "WTFPython: Şaşırtıcı parçacıklar aracılığıyla Python'u keşfetmek ve anlamak",
    "originLink": "https://github.com/satwikkansal/wtfpython",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37281692",
    "commentBody": "",
    "originSummary": [
      "\"wtfpython\", ilgi çekici kod parçacıkları kullanarak Python'un gizli yönlerini ve daha az bilinen özelliklerini araştıran bir projedir.",
      "Python kavramları, optimizasyonlar, beklenmedik davranışlar, yaygın yanlış anlamalar ve programlama ipuçları gibi çok çeşitli konuları kapsar.",
      "Proje, ayrıntılı açıklamalar ve örnekler sağlayan ve katkıları teşvik eden \"wtfpython\" adlı bir kaynak sunmaktadır."
    ],
    "commentSummary": [
      "Python'daki \"is\" operatörünün \"==\" operatörüne göre avantajları olduğu tartışılmaktadır.",
      "JavaScript ve Python'un tuhaflıkları ve eleştirileri, sürpriz faktörler ve programlama dillerinde kaba ifadelerin kullanımı hakkındaki tartışmalar da dahil olmak üzere incelenmektedir.",
      "Belirli bir yeni veya heyecan verici gelişme veya sürümden bahsedilmedi."
    ],
    "points": 239,
    "commentCount": 72,
    "retryCount": 0,
    "time": 1693136790
  },
  {
    "id": 37282385,
    "title": "Python Tip İpuçları - *args ve **kwargs (2021)",
    "originLink": "https://adamj.eu/tech/2021/05/11/python-type-hints-args-and-kwargs/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37282385",
    "commentBody": "",
    "originSummary": [
      "Bu blog yazısı, Python'un değişken argüman operatörleri olan *args ve **kwargs'ın tip ipuçlarıyla birlikte kullanımını incelemektedir.",
      "Args ve kwargs için tür bildirmenin yanlış yöntemi tartışılmakta ve içerilen argümanların türlerinin tanımlanması gerektiği vurgulanmaktadır.",
      "Bağımsız değişkenlerin türlerinin belirtilmesini içeren doğru yaklaşım için Python Geliştirme Önerisi (PEP) 484'e başvurulmaktadır.",
      "Yazı, tip kontrollerini başarıyla geçen ve önerilen yöntemin etkinliğini gösteren bir örnekle sona ermektedir."
    ],
    "commentSummary": [
      "Tartışma, tür ipuçları, işlev imzaları, kalıtım, özellikler, anahtar kelime argümanları, dilimleme, değişken işlevler, soyadları ve dokümantasyon gibi çeşitli Python konuları etrafında dönmektedir.",
      "Katılımcılar kişisel deneyimlerini, hayal kırıklıklarını ve bu zorluklarla başa çıkmak için önerilerini paylaşıyor.",
      "Python geliştiricileri için değerli bilgiler sağlayan çok çeşitli konular ve bakış açıları ele alınmaktadır."
    ],
    "points": 238,
    "commentCount": 127,
    "retryCount": 0,
    "time": 1693141878
  },
  {
    "id": 37289151,
    "title": "Scrum bir kanserdir",
    "originLink": "https://twitter.com/svpino/status/1695806027256475777",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37289151",
    "commentBody": "",
    "originSummary": [
      "Tweet'in yazarı Scrum'ı şiddetle eleştiriyor ve yazılım ekiplerini etkisiz hale getirdiğini savunuyor.",
      "Olumsuz görüşü desteklemek için biri Poker'in bir planlama aracı olarak kullanılması, diğeri de süreç eklemenin verimliliği artırdığı inancıyla ilgili iki anekdot sunulmuştur."
    ],
    "commentSummary": [
      "Yazılım geliştirme ekiplerinde Scrum ve Çevik metodolojilerin uygulanması ve etkinliği konusunda tartışmalar bulunmaktadır.",
      "Bazı kişiler Scrum'ı ekip üretkenliği için yararlı bulurken, diğerleri bürokratik yapısını eleştirmektedir.",
      "Tartışılan zorluklar arasında yetenekli programcıları bulma ve elde tutmanın yanı sıra Scrum çerçevesindeki iş yükü ve baskıyla ilgili endişeler de yer alıyor."
    ],
    "points": 230,
    "commentCount": 201,
    "retryCount": 0,
    "time": 1693191218
  },
  {
    "id": 37283128,
    "title": "ABD'deki oğlu internette hükümeti eleştirince anne Bangladeş'te tutuklandı",
    "originLink": "https://www.nbcnews.com/news/asian-america/mother-arrested-bangladesh-son-us-criticizes-government-online-rcna101392",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37283128",
    "commentBody": "",
    "originSummary": [
      "Bangladeş'te bir anne, oğlunun hükümeti eleştiren Facebook paylaşımı nedeniyle tutuklandı.",
      "ABD'de doktora öğrencisi olan oğul, paylaşımının bir sonucu olduğuna inandığı annesinin gözaltına alınmasından duyduğu hayal kırıklığını dile getirdi.",
      "Bu olay, Bangladeş diasporasında hükümet aleyhinde konuşan kişilere yönelik sansür ve zulüm konusundaki endişeleri arttırmaktadır."
    ],
    "commentSummary": [
      "Bangladeş'te bir anne, oğlu internette hükümeti eleştirdiği için tutuklandı.",
      "İnternet üzerinden yapılan eleştiriler nedeniyle bireylerin tutuklanması meselesi Bangladeş ile sınırlı olmayıp jeopolitik sonuçlar doğurabilir.",
      "Söyleşide çevrimiçi anonimlik, şiddetsiz direniş ve Bangladeş'teki siyasi durum gibi konular ele alınıyor."
    ],
    "points": 222,
    "commentCount": 110,
    "retryCount": 0,
    "time": 1693146922
  }
]
