[
  {
    "id": 37286860,
    "title": "भ्रूण स्टेम कोशिकाओं की बेहतर नकल करने के लिए मानव कोशिकाओं को पुन: प्रोग्राम करने का एक नया तरीका",
    "originLink": "https://www.uwa.edu.au/news/Article/2023/August/Scientists-find-way-to-wipe-a-cells-memory-to-reprogram-it-as-a-stem-cell",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37286860",
    "commentBody": "",
    "originSummary": [
      "ऑस्ट्रेलियाई वैज्ञानिकों ने मानव कोशिकाओं को भ्रूण स्टेम कोशिकाओं की तरह कार्य करने के लिए टीएनटी रीप्रोग्रामिंग नामक एक नई विधि विकसित की है।",
      "विधि का उद्देश्य सेल की स्मृति को मिटाना और प्रेरित प्लुरिपोटेंट स्टेम (आईपीएस) कोशिकाओं और भ्रूण स्टेम (ईएस) कोशिकाओं के बीच अंतर को कम करना है।",
      "शोधकर्ताओं के अनुसार, यह सफलता सेल थेरेपी और बायोमेडिकल अनुसंधान को आगे बढ़ा सकती है।"
    ],
    "commentSummary": [
      "शोधकर्ताओं ने मानव कोशिकाओं को पुन: प्रोग्राम करने के लिए एक नई विधि तैयार की है, जिससे उन्हें भ्रूण स्टेम कोशिकाओं के समान बनाया जा सकता है और अनुसंधान उद्देश्यों के लिए प्रेरित प्लुरिपोटेंट स्टेम सेल (आईपीएससी) में संभावित रूप से सुधार किया जा सकता है।",
      "बातचीत में अस्वास्थ्यकर जीवन शैली के परिणामस्वरूप स्वास्थ्य मुद्दों को संबोधित करने के लिए दवाओं का उपयोग करने की संभावना के साथ-साथ कैंसर की दर पर मोटापे के प्रभाव पर प्रकाश डाला गया है।",
      "चिकित्सा हस्तक्षेप के लिए स्टेम कोशिकाओं को संरक्षित करने, मानव जीवन का विस्तार करने और उम्र बढ़ने को रोकने और इसके प्रभावों को उलटने पर चल रहे शोध के बारे में चर्चा है।"
    ],
    "points": 354,
    "commentCount": 82,
    "retryCount": 0,
    "time": 1693172269
  },
  {
    "id": 37283860,
    "title": "फ़ॉन्ट कहाँ से आते हैं? मोनोटाइप, ज्यादातर",
    "originLink": "https://thehustle.co/where-do-fonts-come-from/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37283860",
    "commentBody": "",
    "originSummary": [
      "मोनोटाइप, फ़ॉन्ट उद्योग में एक प्रमुख खिलाड़ी, स्वतंत्र फ़ॉन्ट डिजाइनरों के लिए चुनौतियां पेश कर रहा है जो प्रतिस्पर्धा करने और जीवन यापन करने के लिए संघर्ष करते हैं।",
      "मोनोटाइप के बाजार प्रभुत्व और अधिग्रहण स्वतंत्र डिजाइनरों के लिए कामयाब होना मुश्किल बनाते हैं, क्योंकि वे अपनी कमाई का एक महत्वपूर्ण हिस्सा लेते हैं।",
      "स्वतंत्र डिजाइनरों को भी बड़े निगमों द्वारा अपने फोंट के अनधिकृत उपयोग के साथ मुद्दों का सामना करना पड़ता है।",
      "मोनोटाइप अपने माईफोंट ्स मार्केटप्लेस के लिए एक सब्सक्रिप्शन मॉडल पेश करने की योजना बना रहा है, जिससे चिंता बढ़ रही है कि यह मुख्य रूप से मोनोटाइप को लाभ पहुंचा सकता है।",
      "मोनोटाइप फ़ॉन्ट खोज के लिए एआई के उपयोग की खोज कर रहा है, लेकिन फ़ॉन्ट डिजाइनरों का तर्क है कि एआई फोंट के पीछे मानव कहानी और अर्थ को दोहरा नहीं सकता है।"
    ],
    "commentSummary": [
      "चर्चा में फोंट के विभिन्न पहलुओं को शामिल किया गया है, जैसे कि उनकी उत्पत्ति, कॉपीराइट चिंताएं और स्वतंत्र डिजाइनरों के लिए समर्थन।",
      "प्रतिभागी विभिन्न ऑपरेटिंग सिस्टम पर फ़ॉन्ट रेंडरिंग और डिज़ाइन उद्देश्यों के लिए फ़ॉन्ट के चयन और संयोजन के बारे में बातचीत में संलग्न होते हैं।",
      "ओपन-सोर्स और वाणिज्यिक फोंट की उपलब्धता, गुणवत्ता और प्रभावशीलता पर ध्यान देने के साथ फ़ॉन्ट उद्योग में एकाधिकार और निजी इक्विटी फर्मों के प्रभाव का भी पता लगाया जाता है।"
    ],
    "points": 313,
    "commentCount": 157,
    "retryCount": 0,
    "time": 1693151656
  },
  {
    "id": 37284487,
    "title": "111,111.1 मीटर विश्वसनीय रूप से 1 डिग्री अक्षांश है",
    "originLink": "https://gis.stackexchange.com/a/2964/5599",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37284487",
    "commentBody": "",
    "originSummary": [
      "भौगोलिक सूचना प्रणाली (जीआईएस) स्टैक एक्सचेंज कार्टोग्राफरों, भूगोलवेत्ताओं और जीआईएस पेशेवरों के लिए प्रश्न पूछने और जवाब देने के लिए एक मंच है।",
      "एक उपयोगकर्ता एम्बेडेड सिस्टम पर अपने काम के लिए मीटर में एक विशिष्ट दूरी से अक्षांश और देशांतर निर्देशांक को ऑफसेट करने के लिए एक एल्गोरिथ्म की मांग कर रहा है।",
      "विन्सेंटी के प्रत्यक्ष सूत्र को इस उद्देश्य के लिए संभावित सहायक एल्गोरिदम के रूप में सुझाया गया है, क्योंकि यह अपनी गति और सटीकता के लिए जाना जाता है।"
    ],
    "commentSummary": [
      "चर्चा माप की एक इकाई के रूप में अक्षांश के 1 डिग्री की विश्वसनीयता और अक्षांश और देशांतर निर्देशांक की सीमाओं की पड़ताल करती है।",
      "यह मीटर के इतिहास और पुनर्परिभाषाओं में प्रवेश करता है, मीट्रिक और शाही जैसे विभिन्न माप प्रणालियों के फायदे और नुकसान को उजागर करता है।",
      "यह अमेरिका में मीट्रिकेशन के प्रतिरोध और शाही प्रणाली के कारण होने वाले भ्रम को संबोधित करता है, जबकि समुद्री मील की वास्तविकता और उपयोगिता पर भी चर्चा करता है। इसके अतिरिक्त, यह इकाई रूपांतरण और विभिन्न संदर्भों में माप की जटिलताओं को छूता है।"
    ],
    "points": 297,
    "commentCount": 209,
    "retryCount": 0,
    "time": 1693155631
  },
  {
    "id": 37281745,
    "title": "Overthewire.org",
    "originLink": "https://overthewire.org/wargames/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37281745",
    "commentBody": "",
    "originSummary": [
      "ओवरदवायर समुदाय व्यक्तियों को सुरक्षा अवधारणाओं को सीखने और अभ्यास करने में मदद करने के लिए वॉरगेम प्रदान करता है।",
      "इन खेलों को विभिन्न बंदरगाहों पर एसएसएच के माध्यम से एक्सेस किया जा सकता है।",
      "समुदाय उपयोगकर्ताओं को सहायता लेने, प्रश्न पूछने या सुझाव प्रदान करने के लिए एक चैट प्लेटफ़ॉर्म प्रदान करता है। इसके अलावा, समुदाय का समर्थन करने में रुचि रखने वालों के लिए एक दान याचिका उपलब्ध है।"
    ],
    "commentSummary": [
      "Overthewire.org एक वेबसाइट है जो कंप्यूटर सुरक्षा और हैकिंग के बारे में जानने के लिए वॉरगेम प्रदान करती है।",
      "चर्चा में भाग लेने वाले लोग चुनौतियों के साथ अपने अनुभव साझा करते हैं और अन्य समान संसाधनों की सिफारिश करते हैं।",
      "कुछ प्रतिभागियों ने ध्यान दिया कि एएसएलआर और बेहतर कंपाइलर चेतावनियों जैसे सुरक्षा उपायों में प्रगति के कारण इस प्रकार की चुनौतियां कम प्रासंगिक हो रही हैं।"
    ],
    "points": 295,
    "commentCount": 45,
    "retryCount": 0,
    "time": 1693137236
  },
  {
    "id": 37283375,
    "title": "Apple के MPW C कंपाइलर (2006) द्वारा निर्मित कुछ त्रुटि संदेश",
    "originLink": "https://www.cs.cmu.edu/~jasonh/personal/humor/compile.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37283375",
    "commentBody": "",
    "originSummary": [
      "सारांश में ऐप्पल के एमपीडब्ल्यू सी कंपाइलर से त्रुटि संदेश शामिल हैं, जो स्ट्रिंग संसाधनों से डीकंपाइल किए गए हैं।",
      "त्रुटि संदेशों में प्रोग्रामिंग त्रुटियों और कंपाइलर की सीमाओं के बारे में विनोदी और व्यंग्यात्मक टिप्पणियां शामिल हैं।",
      "सारांश में कॉपीराइट चिंताओं का भी उल्लेख किया गया है।"
    ],
    "commentSummary": [
      "हैकर न्यूज पर चर्चा में सॉफ्टवेयर विकास से संबंधित विभिन्न विषयों को शामिल किया गया है, जिसमें 2006 में ऐप्पल के एमपीडब्ल्यू सी कंपाइलर से त्रुटि संदेश और पुराने कोड को संकलित करने की चुनौतियां शामिल हैं।",
      "उपयोगकर्ता पुराने कार्यक्रमों के लिए पुरानी यादों को व्यक्त करते हैं और ऐप्पल से सॉफ्टवेयर ब्लोट, कंपाइलर सीमाओं और महंगी रैम कीमतों जैसे मुद्दों पर चर्चा करते हैं।",
      "चर्चा किए गए अन्य विषयों में ऐप्पल सिलिकॉन मैक में मेमोरी प्रबंधन, विभिन्न प्रोग्रामिंग भाषाओं के टिप्पणी डिलिमिटर्स, एसएसडी वियर, यूरोपीय संघ के बैटरी नियम, सी प्रोग्रामिंग में शून्य पॉइंटर्स और प्रोग्रामिंग भाषाओं में नेस्टेड ब्लॉक टिप्पणियों की इच्छा शामिल है।"
    ],
    "points": 256,
    "commentCount": 128,
    "retryCount": 0,
    "time": 1693148644
  },
  {
    "id": 37283636,
    "title": "मैं गिलास खा सकता हूँ",
    "originLink": "https://en.wikipedia.org/wiki/I_Can_Eat_Glass",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37283636",
    "commentBody": "",
    "originSummary": [
      "\"आई कैन ईट ग्लास\" इंटरनेट के शुरुआती दिनों में एथन मोलिक द्वारा शुरू की गई एक भाषाई परियोजना थी।",
      "परियोजना का उद्देश्य वाक्यांश का विभिन्न भाषाओं में अनुवाद करना था, जिसके परिणामस्वरूप 150 से अधिक अनुवाद हुए।",
      "हालांकि मूल वेबपेज अब उपलब्ध नहीं है, परियोजना ने लोकप्रियता हासिल की और पर्यटकों के लिए विनोदी अनुवाद प्रदान करते हुए एक इंटरनेट मीम बन गया।"
    ],
    "commentSummary": [
      "लेख \"आई कैन ईट ग्लास\" नामक एक अनुवाद परियोजना पर केंद्रित है जो विभिन्न भाषाओं में इस वाक्यांश के विभिन्न अनुवादों की पड़ताल करता है।",
      "बातचीत में उपाख्यानों, ऐतिहासिक संदर्भ और अनुवादों के बीच तुलना शामिल है, जो एक मनोरंजक और हल्के-फुल्के स्वर प्रदान करती है।",
      "इसके अतिरिक्त, लेख इंटरनेट नॉस्टेल्जिया, मीम अभिलेखागार और खाने के ग्लास की सुरक्षा जैसे विषयों को छूता है, जिससे चर्चा में गहराई आती है।"
    ],
    "points": 241,
    "commentCount": 85,
    "retryCount": 0,
    "time": 1693150438
  },
  {
    "id": 37281692,
    "title": "WTFPython: आश्चर्यजनक स्निपेट के माध्यम से पायथन की खोज और समझना",
    "originLink": "https://github.com/satwikkansal/wtfpython",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37281692",
    "commentBody": "",
    "originSummary": [
      "\"wtfpython\" एक ऐसी परियोजना है जो पेचीदा कोड स्निपेट का उपयोग करके पायथन के छिपे हुए पहलुओं और कम ज्ञात विशेषताओं में प्रवेश करती है।",
      "इसमें पाइथन अवधारणाओं, अनुकूलन, अप्रत्याशित व्यवहार, सामान्य गलत धारणाओं और प्रोग्रामिंग युक्तियों जैसे विषयों की एक विस्तृत श्रृंखला शामिल है।",
      "परियोजना \"wtfpython\" नामक एक संसाधन प्रदान करती है जो विस्तृत स्पष्टीकरण और उदाहरण प्रदान करती है, और योगदान को प्रोत्साहित करती है।"
    ],
    "commentSummary": [
      "पायथन में \"है\" ऑपरेटर को \"==\" ऑपरेटर पर फायदे के रूप में चर्चा की जाती है।",
      "जावास्क्रिप्ट और पायथन की विचित्रताओं और आलोचनाओं का पता लगाया जाता है, जिसमें आश्चर्यजनक कारकों पर बहस और प्रोग्रामिंग भाषाओं में अश्लीलता का उपयोग शामिल है।",
      "कोई विशिष्ट नए या रोमांचक विकास या रिलीज का उल्लेख नहीं किया गया है।"
    ],
    "points": 239,
    "commentCount": 72,
    "retryCount": 0,
    "time": 1693136790
  },
  {
    "id": 37282385,
    "title": "पायथन प्रकार संकेत - *args और **kwargs (2021)",
    "originLink": "https://adamj.eu/tech/2021/05/11/python-type-hints-args-and-kwargs/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37282385",
    "commentBody": "",
    "originSummary": [
      "ब्लॉग पोस्ट टाइप संकेतों के संयोजन के साथ पायथन के चर तर्क ऑपरेटरों, * args और **kwargs के उपयोग की पड़ताल करता है।",
      "आर्ग और क्वार्ग के लिए प्रकार घोषित करने की गलत विधि पर चर्चा की गई है, जिसमें निहित तर्कों के प्रकारों को परिभाषित करने की आवश्यकता पर प्रकाश डाला गया है।",
      "पायथन एन्हांसमेंट प्रस्ताव (पीईपी) 484 को सही दृष्टिकोण के आधार के रूप में संदर्भित किया गया है, जिसमें व्यक्तिगत तर्कों के प्रकार निर्दिष्ट करना शामिल है।",
      "पोस्ट एक उदाहरण के साथ समाप्त होता है जो अनुशंसित विधि की प्रभावशीलता को प्रदर्शित करते हुए टाइप चेक को सफलतापूर्वक पास करता है।"
    ],
    "commentSummary": [
      "चर्चा कई पायथन विषयों के आसपास घूमती है, जैसे कि प्रकार संकेत, फ़ंक्शन हस्ताक्षर, वंशानुक्रम, लक्षण, कीवर्ड तर्क, स्लाइसिंग, वैरिडिक फ़ंक्शन, उपनाम और दस्तावेज़ीकरण।",
      "प्रतिभागी इन चुनौतियों से निपटने के लिए अपने व्यक्तिगत अनुभव, निराशा और सुझाव साझा करते हैं।",
      "विषयों और दृष्टिकोणों की एक विविध श्रृंखला को कवर किया गया है, जो पायथन डेवलपर्स के लिए मूल्यवान अंतर्दृष्टि प्रदान करता है।"
    ],
    "points": 238,
    "commentCount": 127,
    "retryCount": 0,
    "time": 1693141878
  },
  {
    "id": 37289151,
    "title": "स्क्रम एक कैंसर है",
    "originLink": "https://twitter.com/svpino/status/1695806027256475777",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37289151",
    "commentBody": "",
    "originSummary": [
      "ट्वीट के लेखक ने स्क्रम की कड़ी आलोचना करते हुए तर्क दिया कि यह सॉफ्टवेयर टीमों को अप्रभावी बनाता है।",
      "नकारात्मक राय का समर्थन करने के लिए दो उपाख्यान प्रदान किए जाते हैं, एक योजना उपकरण के रूप में पोकर का उपयोग करने के बारे में और दूसरा इस विश्वास के बारे में कि प्रक्रिया जोड़ने से दक्षता में सुधार होता है।"
    ],
    "commentSummary": [
      "सॉफ्टवेयर विकास टीमों में स्क्रम और एजाइल पद्धतियों के कार्यान्वयन और प्रभावशीलता के आसपास बहस है।",
      "कुछ व्यक्तियों को स्क्रम टीम उत्पादकता के लिए सहायक लगता है, जबकि अन्य इसकी नौकरशाही प्रकृति की आलोचना करते हैं।",
      "चर्चा की गई चुनौतियों में प्रतिभाशाली प्रोग्रामर को ढूंढना और बनाए रखना, साथ ही स्क्रम ढांचे के भीतर कार्यभार और दबाव के बारे में चिंताएं शामिल हैं।"
    ],
    "points": 230,
    "commentCount": 201,
    "retryCount": 0,
    "time": 1693191218
  },
  {
    "id": 37283128,
    "title": "अमेरिका में बेटे ने सरकार की ऑनलाइन आलोचना की, बांग्लादेश में मां गिरफ्तार",
    "originLink": "https://www.nbcnews.com/news/asian-america/mother-arrested-bangladesh-son-us-criticizes-government-online-rcna101392",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37283128",
    "commentBody": "",
    "originSummary": [
      "बांग्लादेश में एक मां को अपने बेटे के फेसबुक पोस्ट के कारण गिरफ्तार किया गया है, जिसमें उसने सरकार की आलोचना की थी।",
      "अमेरिका में पीएचडी के छात्र बेटे ने अपनी मां की हिरासत पर निराशा व्यक्त की, जो उनका मानना है कि उनकी पोस्ट का परिणाम था।",
      "यह घटना बांग्लादेशी डायस्पोरा में सेंसरशिप और उत्पीड़न के बारे में चिंताओं को बढ़ाती है जो सरकार के खिलाफ बोलते हैं।"
    ],
    "commentSummary": [
      "बांग्लादेश में एक मां को इसलिए गिरफ्तार कर लिया गया क्योंकि उसके बेटे ने ऑनलाइन सरकार की आलोचना की थी।",
      "ऑनलाइन आलोचना के लिए व्यक्तियों को गिरफ्तार करने का मुद्दा बांग्लादेश तक सीमित नहीं है और इसके भू-राजनीतिक प्रभाव हो सकते हैं।",
      "बातचीत ऑनलाइन गुमनामी, अहिंसक प्रतिरोध और बांग्लादेश में राजनीतिक स्थिति जैसे विषयों की पड़ताल करती है।"
    ],
    "points": 222,
    "commentCount": 110,
    "retryCount": 0,
    "time": 1693146922
  }
]
