[
  {
    "id": 37286860,
    "title": "Un nuevo método para reprogramar células humanas e imitar mejor a las células madre embrionarias",
    "originLink": "https://www.uwa.edu.au/news/Article/2023/August/Scientists-find-way-to-wipe-a-cells-memory-to-reprogram-it-as-a-stem-cell",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37286860",
    "commentBody": "",
    "originSummary": [
      "Científicos australianos han desarrollado un nuevo método denominado reprogramación TNT para hacer que las células humanas se comporten de forma más parecida a las células madre embrionarias.",
      "El método pretende borrar la memoria celular y reducir las diferencias entre las células madre pluripotentes inducidas (iPS) y las células madre embrionarias (ES).",
      "Según los investigadores, este avance podría contribuir al progreso de las terapias celulares y la investigación biomédica."
    ],
    "commentSummary": [
      "Los investigadores han ideado un nuevo método para reprogramar células humanas, haciéndolas más similares a las células madre embrionarias y mejorando potencialmente las células madre pluripotentes inducidas (iPSC) con fines de investigación.",
      "La conversación ahonda en la posibilidad de utilizar fármacos para tratar problemas de salud derivados de estilos de vida poco saludables, así como en el impacto de la obesidad en las tasas de cáncer.",
      "Se debate sobre la conservación de células madre para intervenciones médicas, la prolongación de la vida humana y las investigaciones en curso para frenar el envejecimiento e invertir sus efectos."
    ],
    "points": 354,
    "commentCount": 82,
    "retryCount": 0,
    "time": 1693172269
  },
  {
    "id": 37283860,
    "title": "¿De dónde proceden los tipos de letra? Monotype, principalmente",
    "originLink": "https://thehustle.co/where-do-fonts-come-from/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37283860",
    "commentBody": "",
    "originSummary": [
      "Monotype, empresa dominante en la industria tipográfica, está planteando retos a los diseñadores independientes de fuentes que luchan por competir y ganarse la vida.",
      "El dominio del mercado y las adquisiciones de Monotype dificultan la prosperidad de los diseñadores independientes, ya que se llevan una parte importante de sus ingresos.",
      "Los diseñadores independientes también tienen problemas con el uso no autorizado de sus fuentes por parte de grandes empresas.",
      "Monotype tiene previsto introducir un modelo de suscripción para su mercado MyFonts, lo que suscita la preocupación de que pueda beneficiar principalmente a Monotype.",
      "Monotype está explorando el uso de la IA para el descubrimiento de fuentes, pero los diseñadores de fuentes argumentan que la IA no puede replicar la historia humana y el significado que hay detrás de las fuentes."
    ],
    "commentSummary": [
      "El debate abarca diversos aspectos de las fuentes, como sus orígenes, los derechos de autor y el apoyo a los diseñadores independientes.",
      "Los participantes entablan conversaciones sobre la representación de fuentes en distintos sistemas operativos y la selección y combinación de fuentes con fines de diseño.",
      "También se estudian los monopolios en la industria tipográfica y la influencia de las empresas de capital riesgo, con especial atención a la disponibilidad, calidad y eficacia de las fuentes comerciales y de código abierto."
    ],
    "points": 313,
    "commentCount": 157,
    "retryCount": 0,
    "time": 1693151656
  },
  {
    "id": 37284487,
    "title": "111.111,1 metros es 1 grado de latitud fiable",
    "originLink": "https://gis.stackexchange.com/a/2964/5599",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37284487",
    "commentBody": "",
    "originSummary": [
      "Geographic Information Systems (GIS) Stack Exchange es una plataforma para cartógrafos, geógrafos y profesionales de GIS para hacer y responder preguntas.",
      "Un usuario busca un algoritmo para desplazar las coordenadas de latitud y longitud una distancia específica en metros para su trabajo en un sistema embebido.",
      "La fórmula directa de Vincenty se sugiere como un algoritmo potencialmente útil para este propósito, ya que es conocida por su velocidad y precisión."
    ],
    "commentSummary": [
      "El debate explora la fiabilidad de 1 grado de latitud como unidad de medida y las limitaciones de las coordenadas de latitud y longitud.",
      "Se adentra en la historia y las redefiniciones del metro, destacando las ventajas e inconvenientes de distintos sistemas de medida como el métrico y el imperial.",
      "Aborda la resistencia al sistema métrico decimal en Estados Unidos y la confusión que provoca el sistema imperial, al tiempo que debate la realidad y utilidad de las millas náuticas. Además, aborda las conversiones de unidades y la complejidad de las medidas en distintos contextos."
    ],
    "points": 297,
    "commentCount": 209,
    "retryCount": 0,
    "time": 1693155631
  },
  {
    "id": 37281745,
    "title": "Overthewire.org",
    "originLink": "https://overthewire.org/wargames/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37281745",
    "commentBody": "",
    "originSummary": [
      "La comunidad OverTheWire ofrece juegos de guerra para ayudar a las personas a aprender y practicar conceptos de seguridad.",
      "Se puede acceder a estos juegos a través de SSH en varios puertos.",
      "La comunidad ofrece una plataforma de chat para que los usuarios busquen ayuda, hagan preguntas o aporten sugerencias. Además, los interesados en apoyar a la comunidad pueden hacer donaciones."
    ],
    "commentSummary": [
      "Overthewire.org es un sitio web que ofrece juegos de guerra para aprender sobre seguridad informática y piratería informática.",
      "Los participantes en el debate comparten sus experiencias con los retos y recomiendan otros recursos similares.",
      "Algunos participantes señalan que este tipo de retos son cada vez menos relevantes debido a los avances en medidas de seguridad como ASLR y mejores advertencias de los compiladores."
    ],
    "points": 295,
    "commentCount": 45,
    "retryCount": 0,
    "time": 1693137236
  },
  {
    "id": 37283375,
    "title": "Algunos de los mensajes de error producidos por el compilador MPW C de Apple (2006)",
    "originLink": "https://www.cs.cmu.edu/~jasonh/personal/humor/compile.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37283375",
    "commentBody": "",
    "originSummary": [
      "El resumen consiste en mensajes de error del compilador MPW C de Apple, descompilados a partir de los recursos String.",
      "Los mensajes de error incluyen comentarios humorísticos y sarcásticos sobre errores de programación y limitaciones del compilador.",
      "En el resumen también se mencionan los derechos de autor."
    ],
    "commentSummary": [
      "El debate en Hacker News abarca varios temas relacionados con el desarrollo de software, incluidos los mensajes de error del compilador MPW C de Apple en 2006 y los retos de compilar código antiguo.",
      "Los usuarios expresan su nostalgia por los programas antiguos y discuten problemas como la saturación del software, las limitaciones de los compiladores y los caros precios de la RAM de Apple.",
      "Otros temas tratados son la gestión de la memoria en los Mac de silicio de Apple, los delimitadores de comentarios de los distintos lenguajes de programación, el desgaste de las unidades SSD, la normativa de la Unión Europea sobre baterías, los punteros nulos en la programación en C y el deseo de anidar comentarios de bloque en los lenguajes de programación."
    ],
    "points": 256,
    "commentCount": 128,
    "retryCount": 0,
    "time": 1693148644
  },
  {
    "id": 37283636,
    "title": "Puedo comer vidrio",
    "originLink": "https://en.wikipedia.org/wiki/I_Can_Eat_Glass",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37283636",
    "commentBody": "",
    "originSummary": [
      "\"I Can Eat Glass\" fue un proyecto lingüístico iniciado por Ethan Mollick en los primeros días de Internet.",
      "El proyecto pretendía traducir la frase a varios idiomas, lo que dio lugar a más de 150 traducciones.",
      "Aunque la página web original ya no está disponible, el proyecto ganó popularidad y se convirtió en un meme de Internet, proporcionando traducciones humorísticas a los turistas."
    ],
    "commentSummary": [
      "El artículo se centra en un proyecto de traducción llamado \"I Can Eat Glass\" que explora las diversas traducciones de esta frase en distintos idiomas.",
      "La conversación incluye anécdotas, contexto histórico y comparaciones entre traducciones, aportando un tono ameno y desenfadado.",
      "Además, el artículo aborda temas como la nostalgia de Internet, los archivos de memes y la seguridad de comer vidrio, lo que añade profundidad al debate."
    ],
    "points": 241,
    "commentCount": 85,
    "retryCount": 0,
    "time": 1693150438
  },
  {
    "id": 37281692,
    "title": "WTFPython: Explorar y comprender Python a través de sorprendentes fragmentos",
    "originLink": "https://github.com/satwikkansal/wtfpython",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37281692",
    "commentBody": "",
    "originSummary": [
      "\"wtfpython\" es un proyecto que profundiza en los aspectos ocultos y las características menos conocidas de Python mediante intrigantes fragmentos de código.",
      "Abarca una amplia gama de temas, como conceptos de Python, optimizaciones, comportamientos inesperados, conceptos erróneos comunes y consejos de programación.",
      "El proyecto ofrece un recurso llamado \"wtfpython\" que proporciona explicaciones detalladas y ejemplos, y anima a contribuir."
    ],
    "commentSummary": [
      "Se discute si el operador \"is\" de Python tiene ventajas sobre el operador \"==\".",
      "Se exploran las peculiaridades y críticas de JavaScript y Python, incluidos los debates sobre los factores sorpresa y el uso de vulgaridades en los lenguajes de programación.",
      "No se mencionan novedades ni lanzamientos específicos."
    ],
    "points": 239,
    "commentCount": 72,
    "retryCount": 0,
    "time": 1693136790
  },
  {
    "id": 37282385,
    "title": "Python Type Hints - *args y **kwargs (2021)",
    "originLink": "https://adamj.eu/tech/2021/05/11/python-type-hints-args-and-kwargs/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37282385",
    "commentBody": "",
    "originSummary": [
      "La entrada del blog explora el uso de los operadores de argumento variable de Python, *args y **kwargs, junto con las sugerencias de tipo.",
      "Se discute el método incorrecto de declarar tipos para args y kwargs, destacando la necesidad de definir los tipos de los argumentos contenidos.",
      "Se hace referencia a la Python Enhancement Proposal (PEP) 484 como base para el enfoque correcto, que implica especificar los tipos de los argumentos individuales.",
      "El post concluye con un ejemplo que supera con éxito las comprobaciones de tipo, mostrando la eficacia del método recomendado."
    ],
    "commentSummary": [
      "La discusión gira en torno a varios temas de Python, como sugerencias de tipos, firmas de funciones, herencia, rasgos, argumentos de palabras clave, troceado, funciones variádicas, apellidos y documentación.",
      "Los participantes comparten sus experiencias personales, frustraciones y sugerencias para afrontar estos retos.",
      "Se cubren una amplia gama de temas y perspectivas, proporcionando valiosos conocimientos para los desarrolladores de Python."
    ],
    "points": 238,
    "commentCount": 127,
    "retryCount": 0,
    "time": 1693141878
  },
  {
    "id": 37289151,
    "title": "Scrum es un cáncer",
    "originLink": "https://twitter.com/svpino/status/1695806027256475777",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37289151",
    "commentBody": "",
    "originSummary": [
      "El autor del tuit critica duramente Scrum, argumentando que hace que los equipos de software sean ineficaces.",
      "Se aportan dos anécdotas para apoyar la opinión negativa, una sobre el uso del póquer como herramienta de planificación y otra sobre la creencia de que añadir procesos mejora la eficacia."
    ],
    "commentSummary": [
      "Existe un debate en torno a la implantación y la eficacia de las metodologías Scrum y Agile en los equipos de desarrollo de software.",
      "Algunas personas consideran que Scrum es útil para la productividad del equipo, mientras que otras critican su naturaleza burocrática.",
      "Entre los retos que se debaten figuran la búsqueda y retención de programadores con talento, así como la preocupación por la carga de trabajo y la presión en el marco de Scrum."
    ],
    "points": 230,
    "commentCount": 201,
    "retryCount": 0,
    "time": 1693191218
  },
  {
    "id": 37283128,
    "title": "Detienen a una madre en Bangladesh después de que su hijo criticara al gobierno en Internet",
    "originLink": "https://www.nbcnews.com/news/asian-america/mother-arrested-bangladesh-son-us-criticizes-government-online-rcna101392",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37283128",
    "commentBody": "",
    "originSummary": [
      "Una madre de Bangladesh ha sido detenida por una publicación de su hijo en Facebook en la que criticaba al gobierno.",
      "El hijo, estudiante de doctorado en Estados Unidos, expresó su frustración por la detención de su madre, que considera consecuencia de su cargo.",
      "Este incidente suscita preocupación por la censura y la persecución de las personas de la diáspora bangladeshí que se manifiestan contra el gobierno."
    ],
    "commentSummary": [
      "Una madre de Bangladesh fue detenida porque su hijo criticó al gobierno en Internet.",
      "La cuestión de la detención de personas por criticar en Internet no se limita a Bangladesh y puede tener implicaciones geopolíticas.",
      "La conversación explora temas como el anonimato en Internet, la resistencia no violenta y la situación política en Bangladesh."
    ],
    "points": 222,
    "commentCount": 110,
    "retryCount": 0,
    "time": 1693146922
  }
]
