[
  {
    "id": 37509507,
    "title": "Marjinal Kullanıcının Tiranlığı",
    "originLink": "https://nothinghuman.substack.com/p/the-tyranny-of-the-marginal-user",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37509507",
    "commentBody": "",
    "originSummary": [
      "Makalede, OKCupid gibi arkadaşlık uygulamalarının örnek teşkil ettiği tüketici yazılımlarındaki düşüş, mevcut kullanıcıların deneyimini iyileştirmek pahasına yeni kullanıcıları çekmeye odaklanılması nedeniyle eleştiriliyor.",
      "Basit içeriği tercih eden, kısa dikkat süresine sahip bir kullanıcı olan \"marjinal kullanıcı\" kavramı ortaya atılmıştır. Bu kullanıcı tipine öncelik verilmesinin yazılım kalitesinde ve kullanıcı temsilciliğinde düşüşe neden olduğu düşünülmektedir.",
      "Yazar, kullanıcı temsilciliğini artıran araçların genellikle hobiciler tarafından geliştirildiğini ve genellikle daha büyük şirketler tarafından satın alınıp durdurulduğunu belirtiyor."
    ],
    "commentSummary": [
      "Makalede OkCupid'in mobil kullanıcı merkezli bir yaklaşıma doğru kaydığı, bunun da sohbet kalitesinin düşmesine ve daha yüzeysel arkadaşlık uygulamalarının yükselmesine neden olduğu belirtiliyor.",
      "Ayrıca, yazılım geliştirmedeki büyüme modellerinin olumsuz etkilerini vurgulayarak, bu modellerin kullanıcı deneyimi yerine ekonomik başarıya odaklanmasını eleştiriyor ve anlık hazlara hitap etmenin bir ürünün çöküşüne nasıl yol açabileceğine dikkat çekiyor.",
      "Makale, kullanıcı arayüzü tasarımının içerik aktarımı üzerindeki etkisi, faydacılığın zorlukları ve kaynak tüketimi ve eşitsizlikle ilgili artan endişeler gibi konulara odaklanarak optimal bir ahlaki sistem tasarlamanın zorluklarına dikkat çekiyor."
    ],
    "points": 1150,
    "commentCount": 628,
    "retryCount": 0,
    "time": 1694701686
  },
  {
    "id": 37516523,
    "title": "Unity, ToS değişikliklerini takip eden GitHub deposunu sessizce kaldırmış görünüyor",
    "originLink": "https://www.gamerbraves.com/unity-silently-deletes-github-repo-that-tracks-terms-of-service-changes-and-updated-its-license/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37516523",
    "commentBody": "",
    "originSummary": [
      "Bir oyun geliştirme platformu olan Unity, hizmet şartlarında (ToS) yapılan değişiklikleri ve geliştiricilerin oyun motorunun eski sürümlerini kullanmasına izin veren bir maddeyi takip eden bir GitHub deposunu sessizce kaldırdı.",
      "Deponun silinmesiyle web sayfasına artık erişilememektedir ve son erişilebilirlik tarihi 16 Temmuz 2022'dir.",
      "Unity'nin ToS'undaki önemli değişiklikler arasında, geliştiricilerin güncelleme sırasındaki şartlara göre mevcut yılın yazılım sürümlerini kullanmalarına izin veren bir maddenin (Nisan 2023'te) kaldırılması yer alıyor; bu, kullanıcıları, her oyun yüklemesi için geliştiricilerden ücret alan son fiyatlandırma planı güncellemesi gibi Unity'nin tüm hizmet değişikliklerine uymaya zorluyor."
    ],
    "commentSummary": [
      "Unity, hizmet şartlarında (ToS) yapılan değişiklikleri takip eden GitHub deposunu silerek şeffaflık ve güven konusundaki endişeleri artırdı.",
      "ToS'ta geriye dönük olarak yapılan bu değişiklikler, çalışmalarını önceki maliyet yapısına dayandıran oyun geliştiricilerini üzdü.",
      "Unity'nin eylemleri yasallığı ve etiği konusunda soru işaretleri yarattı ve benzer bir yükleme başına ücret uygulamayan Unreal Engine ile olumsuz karşılaştırmalar yapıldı."
    ],
    "points": 586,
    "commentCount": 151,
    "retryCount": 0,
    "time": 1694736607
  },
  {
    "id": 37510865,
    "title": "Chromebook'lar 10 yıl boyunca otomatik güncelleme alacak",
    "originLink": "https://blog.google/outreach-initiatives/education/automatic-update-extension-chromebook/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37510865",
    "commentBody": "",
    "originSummary": [
      "Google, on yıl boyunca tüm Chromebook'ları otomatik olarak güncellemeyi planlıyor ve bu da onu güvenlik, kararlılık ve cihaz ömrünü artıracak bu tür uzun vadeli güncellemeleri taahhüt eden tek işletim sistemi haline getiriyor.",
      "Teknoloji devi, Chromebook'ları daha fazla geri dönüştürülmüş malzeme kullanarak üretmek için ortaklarıyla işbirliği yapıyor ve güç tasarruflu özellikler ve hızlandırılmış onarım yöntemleri sunuyor.",
      "Google'ın stratejisi, bir Chromebook'un üretiminden geri dönüşümüne kadar tüm yaşam döngüsünü vurgulayarak sürdürülebilirlik ve kullanıcı rahatlığı konusundaki kararlılığını ortaya koyuyor."
    ],
    "commentSummary": [
      "Google, elektronik atıkları en aza indirmek amacıyla Chromebook'ların 10 yıla kadar otomatik olarak güncellenmesine karar verdi.",
      "Çevrimiçi forumda parmak izi kimlik doğrulamasının güvenliği, Chromebook'ların eğitim ortamlarında dayanıklılığı ve Google'ın donanım tedarikçileriyle karşılaşabileceği olası zorluklar hakkında tartışmalar yaşandı.",
      "Chromebook'lara yönelik genişletilmiş desteği takdir etmekle birlikte, kullanıcılar donanım sınırlamaları ve yanlışlıkla İşletim Sistemi (OS) Doğrulamasının yeniden etkinleştirilmesi konusundaki endişelerini dile getirdiler."
    ],
    "points": 574,
    "commentCount": 326,
    "retryCount": 0,
    "time": 1694708057
  },
  {
    "id": 37508471,
    "title": "PostgreSQL 16",
    "originLink": "https://www.postgresql.org/about/news/postgresql-16-released-2715/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37508471",
    "commentBody": "",
    "originSummary": [
      "PostgreSQL Global Geliştirme Grubu, açık kaynaklı veritabanının en son güncellemesi olan PostgreSQL 16'nın 14 Eylül 2023 tarihinde yayınlanacağını duyurdu.",
      "Geliştirmeler arasında sorgu paralelliği, toplu veri yükleme ve mantıksal çoğaltmada performans iyileştirmeleri; genişletilmiş SQL/JSON sözdizimi; yeni izleme istatistikleri ve ilke yönetimi için geliştirilmiş erişim denetimi bulunmaktadır.",
      "İstemci yük dengeleme desteği, SIMD aracılığıyla CPU hızlandırma ve güçlendirilmiş izleme, erişim kontrolü ve güvenlik özellikleri nedeniyle geliştiriciler ve kuruluşlar için faydalı olan çift yönlü mantıksal çoğaltma dikkate değer eklemelerdir."
    ],
    "commentSummary": [
      "Açık kaynaklı bir yazılım projesi olan PostgreSQL 16, gelişmiş özellikler ve daha iyi sürüm yönetimi ile piyasaya sürüldü.",
      "Yazılım altyapısındaki etkili rolüyle tanınan bu proje, çeşitli katılımcılardan oluşan bir grup tarafından desteklenmektedir.",
      "Güncel tartışmalar PostgreSQL ile ilgili performans optimizasyonu, indeks şişmesi, replikasyon ve dağıtım seçenekleri gibi alanlara odaklanmaktadır."
    ],
    "points": 534,
    "commentCount": 72,
    "retryCount": 0,
    "time": 1694696786
  },
  {
    "id": 37514940,
    "title": "Google benimle işbirliği yapmak veya beni desteklemek yerine fikrimi çaldı",
    "originLink": "https://github.com/google/project-gameface/issues/1",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37514940",
    "commentBody": "",
    "originSummary": [
      "ozramos adlı kişi, Handsfree.js adlı projelerinin Google tarafından Project Gameface için intihal edildiğini, bunun da destek ve tanınma eksikliği nedeniyle hayal kırıklığı ve hüsranla sonuçlandığını iddia ediyor.",
      "Carnegie Mellon Üniversitesi'nden bir profesör ozramos'un iddialarının geçerliliğine kefil oldu ve Google'ın eylemlerinden duydukları hayal kırıklığını dile getirdi.",
      "Kullanıcı yorumlarındaki genel tepki ozramos'u destekler nitelikteydi ve Google'ın yanıt vermesi ve ozramos'un katkılarını kabul etmesi çağrısında bulunuldu."
    ],
    "commentSummary": [
      "TSSB ve evsizlikten muzdarip bir gazi, projesinin şirket tarafından desteklenmemesi nedeniyle Google'ı intihal yapmakla suçladığı yararlı bir teknoloji geliştirdi.",
      "Bu durum kurumsal etik, hesap verebilirlik ve yenilikçilere yönelik muamele konularında tartışmalara yol açmış, yasal işlemler ve kamuoyu önünde utandırma potansiyel çözümler olarak görülmüştür.",
      "Bu olay, kurumsal eylemlerin karmaşıklığının altını çizmekte ve toplumsal gelişim için bu tür çatışmaların ele alınmasının gerekliliğini tartışmaktadır."
    ],
    "points": 421,
    "commentCount": 72,
    "retryCount": 0,
    "time": 1694726070
  },
  {
    "id": 37507355,
    "title": "Sıfırdan bir IP coğrafi konum veritabanı nasıl oluşturulur?",
    "originLink": "https://ipapi.is/geolocation.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37507355",
    "commentBody": "",
    "originSummary": [
      "IP coğrafi konumunun hedefli reklamcılık, dolandırıcılık tespiti, içerik yerelleştirme, ağ güvenliği ve analitik alanlarındaki uygulamaları, IP adreslerini coğrafi olarak konumlandırmanın zorluklarıyla birlikte ele alınmaktadır.",
      "Makale, WHOIS kayıtlarını ve açık kaynak projelerini kullanarak bir coğrafi konum veritabanının nasıl oluşturulacağını ortaya koymakta ve RIPE NCC veritabanındaki coğrafi konum özelliklerinin sınırlı kapsamını ele almaktadır.",
      "Diğer coğrafi konum projeleri ve veri zenginleştirme için üçüncü taraf kaynaklar gibi IP adreslerinden coğrafi konum verilerini kullanmanın sınırlamaları ve alternatifleri araştırılmış ve ipapi.is'den bahsedilerek sonlandırılmıştır."
    ],
    "commentSummary": [
      "Metin, sıfırdan doğru bir IP coğrafi konum veritabanı oluşturmaya odaklanmakta, IP konum doğruluğunun önemini vurgulamakta ve CSV dosyaları için MMDB formatını kullanmak gibi çeşitli metodolojileri tartışmaktadır.",
      "VPN'lerin ve proxy'lerin tespiti, IPinfo'nun API'sinin dolandırıcılık tespiti için kullanımı, anycasted adresleri tespit etmenin zorlukları ve coğrafi konum verilerini çevreleyen gizlilik sonuçlarına dikkat çekilmektedir.",
      "MaxMind ve Cloudflare gibi coğrafi konum belirleme hizmetlerinin güvenilirliği sorgulanmakta, bunların yerine traceroute analizi ve BGP reklamları gibi alternatif yöntemler önerilmektedir. Bu veri tabanlarının Google gibi şirketler için önemi de vurgulanmaktadır."
    ],
    "points": 400,
    "commentCount": 154,
    "retryCount": 0,
    "time": 1694689246
  },
  {
    "id": 37507226,
    "title": "Kaliforniya'da şimdiye kadarki en güçlü onarım hakkı yasası kabul edildi, 7 yıllık parça zorunluluğu getirildi",
    "originLink": "https://arstechnica.com/gadgets/2023/09/calif-passes-strongest-right-to-repair-bill-yet-requiring-7-years-of-parts/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37507226",
    "commentBody": "",
    "originSummary": [
      "Kaliforniya, satıcıların tüketici elektroniği ve cihazları için parça, alet, onarım kılavuzu ve gerekli yazılımları tedarik etmelerini zorunlu kılan kapsamlı bir onarım hakkı yasasını kabul etti.",
      "Tasarı, diğer eyalet yasalarının ötesine geçerek, satıcıların 1 Temmuz 2021'den itibaren satılan ürünler için, ürünün maliyetine göre belirlenen bir süre boyunca bu tür ürünleri sunmasını talep ediyor. Yasa, yaptırım hükümleri içeriyor ve onarım satıcılarının \"yetkili olmayan\" parçaların kullanımını açıklamasını zorunlu kılıyor.",
      "Apple, ürünlerinin tamir edilebilirliğinin ve dayanıklılığının arttığının altını çizerek bu tasarıyı destekledi. Bu yasa, diğer eyaletlerdeki ve Avrupa'daki benzer yasalarla birlikte, üreticileri küresel olarak onarılabilir ve sürdürülebilir ürünler sunmaya teşvik edebilir."
    ],
    "commentSummary": [
      "Kaliforniya, üreticilerin ürünleri için en az yedi yıl boyunca parça tedarik etmelerini zorunlu kılan bir onarım hakkı yasasını kabul etti.",
      "Bu tasarı, üçüncü taraf yedek parçaların kalitesi, küçük işletmeler üzerindeki baskı, rekabet ve fikri mülkiyet hakları üzerinde potansiyel etkiye sahip şemaların açıklanması gibi konularla ilgili tartışmalara yol açmıştır.",
      "Tartışmalar, elektronik cihazların onarım kapasitesi, münferit parçaların bulunabilirliği, teknoloji ürünlerinin dayanıklılığı ve süresi, planlı eskime ve bunun tüketici hakları üzerindeki etkisi, maliyet hususları ve işletmeler ve endüstriler üzerindeki genel etkisi üzerine dikkate değer söylemlerle daha derinlere inmektedir."
    ],
    "points": 391,
    "commentCount": 270,
    "retryCount": 0,
    "time": 1694688144
  },
  {
    "id": 37509560,
    "title": "Tails, gözetim ve sansüre karşı koruma sağlayan taşınabilir bir işletim sistemidir",
    "originLink": "https://tails.net/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37509560",
    "commentBody": "",
    "originSummary": [
      "Tails, çevrimiçi gizlilik ve sansüre karşı direnç için Tor ağını kullanan, gözetim ve sansüre karşı koruma sağlamak üzere tasarlanmış taşınabilir bir işletim sistemidir.",
      "Bir USB belleğe kurulmak üzere tasarlanan Tails, hassas belgelerin işlenmesi ve güvenli iletişim için uygulamalarla donatılmış herhangi bir makinede güvenli bir bilgi işlem ortamı sağlar.",
      "Edward Snowden tarafından desteklenen ve internet özgürlüğü örgütleri tarafından finanse edilen Tails, Debian GNU/Linux tabanlıdır. Ücretsiz olarak kullanılabilir ve genellikle gazeteciler, aktivistler, aile içi şiddet mağdurları ve ek gizliliğe ihtiyaç duyan diğer kişiler tarafından kullanılır."
    ],
    "commentSummary": [
      "Tartışma, önceki oturumların izlerini engelleme ve kötü amaçlı yazılımlara karşı savunma gibi özelliklerle gözetim ve sansüre karşı koruma sağlamak için geliştirilen gizlilik odaklı bir İşletim Sistemi (OS) olan Tails'e odaklanıyor.",
      "Konuşmada ayrıca Tails OS'nin IP adresi sızıntısı riski de dahil olmak üzere bazı sınırlamalarına dikkat çekiliyor ve güvenli tarama seçenekleri olarak Whonix, Heads ve TENS gibi alternatiflerden bahsediliyor.",
      "Diyalogdaki diğer konular arasında internetin tarihi ve büyümesi, açık kaynaklı yazılımların güvenilirliği ve açık kaynaklı girişimlerin finansmanı yer alıyor."
    ],
    "points": 384,
    "commentCount": 170,
    "retryCount": 0,
    "time": 1694701994
  },
  {
    "id": 37515996,
    "title": "iNaturalist kendi başına yola çıkıyor",
    "originLink": "https://baynature.org/2023/09/12/inaturalist-strikes-out-on-its-own/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37515996",
    "commentBody": "",
    "originSummary": [
      "Biyoçeşitliliğin kayıt altına alınmasına yönelik bir sosyal ağ olan iNaturalist, 10 milyon dolarlık bir hibenin desteğiyle kâr amacı gütmeyen bağımsız bir kuruluş haline geldi.",
      "Hibe, iNaturalist'in insanları doğa ile buluşturma ve ekolojik veri üretme misyonunu sürdürmesine destek olmayı amaçlıyor. Platform ayrıca biyoçeşitliliğin yüksek olduğu ve hizmetlerine erişimin sınırlı olduğu bölgelerdeki varlığını artırmayı umuyor.",
      "iNaturalist ayrıca türlerin dağılımını tahmin etmek için yapay zekayı da kullanmayı planlıyor ve önceki ortak kuruluşlarıyla işbirliği yapmayı hedefliyor."
    ],
    "commentSummary": [
      "TensorFlow Lite modelini kullanan iNaturalist uygulaması, 50 milyon gözlemi aşarak doğa meraklılarına bitki ve hayvanları tanımlamada yardımcı oldu.",
      "Fotoğraflarda sınıf dengesizliği ve nesne karışıklığı gibi eksikliklere rağmen uygulama, kullanıcı doğrulaması ve coğrafi öncellerin dahil edilmesiyle hassasiyetini artırıyor.",
      "Gelecekteki geliştirmeler, gelişmiş kamera teknolojilerinin potansiyel kullanımına ve çeşitli platformlarda uygulama kullanılabilirliğine işaret etmektedir."
    ],
    "points": 338,
    "commentCount": 60,
    "retryCount": 0,
    "time": 1694732836
  },
  {
    "id": 37512888,
    "title": "Bir Git deposunda dosyalarınız nerede yaşar?",
    "originLink": "https://jvns.ca/blog/2023/09/14/in-a-git-repository--where-do-your-files-live-/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37512888",
    "commentBody": "",
    "originSummary": [
      "Git, dosyaları bir deponun içindeki .git/objects dizininde farklı nesneler olarak depolar ve dosya adlarının dosya içeriğinin karması olduğu içerik adresli depolama kullanır.",
      "Git, bireysel sürümler için farkları saklamaz; her sürüm tam bir dosya olarak kaydedilir. Eski sürümleri bulmak için, dosya değişiklikleriyle ilişkili commit ID'lerini bulmak için 'git log' kullanılabilir.",
      "Git, zlib formatını kullanarak nesneleri sıkıştırır. Yazar, kod parçacıkları eşliğinde Git kullanarak bir blog yazısının eski bir sürümünün alınmasına ilişkin pratik bir örnek sunmaktadır."
    ],
    "commentSummary": [
      "Makale, Git'in benzersiz işlevselliğini, sorun giderme yöntemlerini, iç işleyişini ve değişiklikleri izlemek için Yönlendirilmiş Döngüsel Grafiğin (DAG) kullanımını kapsayan kapsamlı bir genel bakış sunmaktadır.",
      "Sürüm kontrol sistemleri alanındaki esnekliğini ve tutarlılığını destekleyen argümanlara rağmen, Git'in kullanıcı arayüzüne yönelik eleştiriler potansiyel iyileştirmelerle birlikte incelenmiştir.",
      "Yazıda ayrıca Git'in karmaşıklığı ve kullanılabilirliği tartışılıyor, diğer seçeneklerle popülerliği karşılaştırılıyor ve gelecekteki yenilik ve ölçek büyütme potansiyeli özetleniyor."
    ],
    "points": 331,
    "commentCount": 88,
    "retryCount": 0,
    "time": 1694716454
  },
  {
    "id": 37516542,
    "title": "Godot Kalkınma Fonu",
    "originLink": "https://fund.godotengine.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37516542",
    "commentBody": "",
    "originSummary": [
      "Godot Geliştirme Fonu, bireylerin ve işletmelerin seçtikleri üyelik seviyelerine göre değişen miktarlarda katkıda bulunarak Godot oyun motorunun geliştirilmesine finansal olarak yardımcı olmalarını sağlayan bir programdır.",
      "Fonlar Godot Vakfı tarafından yönetilmekte ve geliştiricilerin işe alınması, sanat eserlerinin oluşturulması, donanım satın alınması ve projeyle ilgili diğer masrafların karşılanması gibi amaçlar için kullanılmaktadır.",
      "Godot, Software Freedom Conservancy'nin bir parçasıdır ve web sitesi TuxFamily.org tarafından barındırılmaktadır, bu da bu açık kaynaklı projeye bir meşruiyet katmanı ekler."
    ],
    "commentSummary": [
      "Godot Geliştirme Fonu bir Hacker News gönderisinde tartışma konusu olmuştur, ancak ilgili yorumlar başka bir siteye taşınmıştır.",
      "Y Combinator (YC) 2024 Kış dönemi için başvuruların açıldığı duyuruldu.",
      "Yazıda başvuru kılavuzları, SSS'ler, API'ler, güvenlik, yasal bilgiler ve YC'ye nasıl başvurulacağı ve ulaşılacağı ile ilgili ayrıntılar gibi çeşitli kaynaklara bağlantılar verilmektedir."
    ],
    "points": 291,
    "commentCount": 1,
    "retryCount": 0,
    "time": 1694736744
  },
  {
    "id": 37509624,
    "title": "ABD, Google çalışanlarına 'share' ve 'bundle' gibi kelimelerden kaçınmalarını söyledi",
    "originLink": "https://www.bloomberg.com/news/newsletters/2023-09-14/googlers-told-to-avoid-words-like-share-and-bundle-us-says-lmj27bhl",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37509624",
    "commentBody": "",
    "originSummary": [
      "Devam etmekte olan bir davada sunulan belgelere göre, Google çalışanlarına ya da \"Googler \"lara rekabete aykırı davranış anlamına gelebilecek belirli kelime ve ifadeleri kullanmaktan kaçınmaları talimatı verildi.",
      "Bu talimatlar, Google'ın çevrimiçi arama pazarında tekel oluşturmakla suçlandığı daha büyük bir davanın parçasıdır. Ancak Google bu iddiaları reddetmektedir.",
      "Belgeler ayrıca çalışanların hassas sohbetleri geçmişleri kapalı olarak yapmaları ve \"hava kaynaklarını kesmek\" ve \"pazar payı\" gibi ifadelerden kaçınmaları için teşvik edildiğini ortaya koyuyor."
    ],
    "commentSummary": [
      "Tartışma, Google ve antitröst sorunlarına odaklanarak, yasal konularda dilin önemini ve tekel gücünün potansiyel kötüye kullanımını vurguluyor.",
      "Konular arasında Google'ın çalışanlarına belirli kelimeleri atlamaları için verdiği talimat ve avukat-müvekkil ayrıcalığını çevreleyen ve teknoloji endüstrisindeki yasal yönlerin karmaşıklığını gösteren bir konuşma yer alıyor.",
      "Ele alınan bir diğer konu da Google'ın yazılım sektöründeki baskın rolü olup, ürünlerinin kalitesi, fiyatlandırması ve rekabet üzerindeki etkileri gibi faktörler tartışılmaktadır."
    ],
    "points": 261,
    "commentCount": 322,
    "retryCount": 0,
    "time": 1694702304
  },
  {
    "id": 37509533,
    "title": "Unity'den Unreal Engine'e Geçmeye Karar Verdiniz",
    "originLink": "https://impromptugames.com/movingtounreal.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37509533",
    "commentBody": "",
    "originSummary": [
      "Bu özet, Unity'den Unreal Engine'e geçişe yardımcı olacak rehberlik ve kaynaklar sunarak belgeleri anlamanın, ilgili topluluklara katılmanın ve Epic Online Learning Library gibi eğitim kaynaklarını kullanmanın önemini vurguluyor.",
      "Ödeme yapıları ve platform desteğiyle ilgili endişeleri gideriyor ve Unreal'in çok yönlülük, kapsamlı pazar yeri, verimli giriş sistemleri ve hem 2D hem de 3D oyun geliştirme ile uyumluluk gibi avantajlarını vurguluyor.",
      "Makalede Unreal Engine'in popüler oyunlarda kullanımından, seviye tasarım araçlarındaki geliştirmelerden bahsediliyor ve Linux ve Mac platformlarında oyun geliştirmenin fizibilitesine dikkat çekiliyor."
    ],
    "commentSummary": [
      "Tartışmalar öncelikle Unity'den Unreal Engine'e geçiş ve Unreal'de 'Blueprints' uygulaması başta olmak üzere oyun motorlarıyla ilgili konulara odaklanıyor.",
      "Diğer ilgi çekici noktalar arasında Blueprints kullanırken sürüm kontrolü ve değişikliklerin birleştirilmesi ile ilgili endişeler, C++ ile karşılaştırıldığında performansı ve kısıtlamaları ve Godot gibi diğer oyun motorlarıyla karşılaştırmalar yer almaktadır.",
      "Tartışılan diğer konular arasında oyun motoru şirketlerinin gelir elde etmesi, Unity'nin politika ve fiyat değişiklikleri, yöneticilere yönelik tehditler ve Twitter kullanımındaki azalma yer alıyor."
    ],
    "points": 261,
    "commentCount": 138,
    "retryCount": 0,
    "time": 1694701840
  },
  {
    "id": 37517329,
    "title": "Doğrusal kod daha okunabilir",
    "originLink": "https://blog.separateconcerns.com/2023-09-11-linear-code.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37517329",
    "commentBody": "",
    "originSummary": [
      "Yazar, okunabilirlik uğruna kodun soyutlanmasına karşı çıkıyor ve doğrusal kodun özünde daha anlaşılır olduğunu iddia ediyor.",
      "Yazar, kodda soyutlama kullanımını eleştiren bir işlev örneği sunarak duruşunu kanıtlamaktadır.",
      "Bir cihazı içeren olası bir kod sorununu ele alarak, kodun fırını bir parametre olarak ele almasını önererek, küçük işlevlerin doğrusal koddan çıkarılmaması gerektiği fikrini güçlendiriyorlar."
    ],
    "commentSummary": [
      "Tartışmanın ana teması, daha büyük doğrusal fonksiyonları ve daha küçük modüler fonksiyonları destekleyen farklı görüşlerle kodun okunabilirliği ve sürdürülebilirliğidir.",
      "Söylem, diğer geliştiricilerin okunabilirliğini göz önünde bulundurarak kod yazmanın ve soyutlamayı dikkatli bir şekilde kullanarak bir denge kurmanın öneminin altını çiziyor.",
      "Okunabilirlik ve verimlilik arasında önceliklendirme yaparken kod tabanının özel gereksinimlerini dikkate almanın önemini vurgulamaktadır. Kod yapısı, test ve ölçeklenebilirliğe ilişkin çeşitli bakış açıları da incelenmektedir."
    ],
    "points": 242,
    "commentCount": 208,
    "retryCount": 0,
    "time": 1694743384
  },
  {
    "id": 37515645,
    "title": "Programlama Dili Mucidi mi Seri Katil mi? (2003)",
    "originLink": "https://vole.wtf/coder-serial-killer-quiz/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37515645",
    "commentBody": "",
    "originSummary": [
      "Metin, bir programlama dili mucidi ile bir seri katili ayırt etmenin zor olduğu bir oyun konseptine işaret etmektedir.",
      "Bu oyun, bireylerin potansiyel olarak bilgisayar korsanlığı ve cinayet gibi konuları içerebilecek ilgi alanlarının incelenmesini içerebilir.",
      "Bu yazı, teknoloji ve gerçek suçu interaktif bir formatta bir araya getirme önerisiyle benzersizdir."
    ],
    "commentSummary": [
      "Makale, bir resimdeki kişinin seri katil mi yoksa programlama dilleri geliştiricisi mi olduğunu tahmin etmeyi içeren bir oyundan bahsediyor.",
      "Tartışma başlığında, programcılar ve seri katillerle bağlantılı stereotiplerin yanı sıra, yüz özelliklerinin bir kişinin doğasıyla ilişkilendirilmesinin geçerliliği konusunda bir tartışma var.",
      "Oyun karışık tepkiler aldı; bazı katılımcılar oyunu beğenirken, diğerleri potansiyel ayrımcılıkla ilgili endişelerini dile getirdi ve bazı istisnalara şaşırdı."
    ],
    "points": 239,
    "commentCount": 107,
    "retryCount": 0,
    "time": 1694730488
  },
  {
    "id": 37511036,
    "title": "Aşırı güven ve olumsuz tutumlarla ilişkili orta düzey bilim bilgisi",
    "originLink": "https://www.nature.com/articles/s41562-023-01677-8",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37511036",
    "commentBody": "",
    "originSummary": [
      "Çalışma, bilimsel bilgi, özgüven ve bilime yönelik tutumlar arasında bir bağlantı keşfediyor ve özellikle orta düzeyde bilimsel bilgiye sahip bireylerde aşırı güven ve olumsuz önyargıya dikkat çekiyor.",
      "Bulgular mevcut modelleri sorgulamakta ve bu aşırı güveni ele alma ve bilimin daha derinlemesine anlaşılmasını teşvik etme gerekliliğini vurgulamaktadır.",
      "Makalede ayrıca akademik yayın ve yayıncısı hakkında ayrıntılar da sunuluyor."
    ],
    "commentSummary": [
      "Tartışma, bilimin sınırlarını, onu tanımlamanın zorluklarını ve bilimsel iddialara çok fazla inanmanın tehlikelerini anlamaya odaklanmaktadır.",
      "Aşırı güvenin çeşitli alanları nasıl etkilediğine ve medya ile siyasetin halkın bilim algısını nasıl şekillendirdiğine ışık tutuyor.",
      "Aşırı güven ve bilim inkârcılığına karşı alçakgönüllülük, eleştirel düşünme ve bilimsel anlayıştaki belirsizliklerin kabul edilmesi gerekliliğine vurgu yapılmaktadır."
    ],
    "points": 239,
    "commentCount": 194,
    "retryCount": 0,
    "time": 1694708692
  },
  {
    "id": 37509427,
    "title": "Arm halka arzı bugün başlıyor",
    "originLink": "https://www.theregister.com/2023/09/14/arm_ipo/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37509427",
    "commentBody": "",
    "originSummary": [
      "İngiliz çip tasarımcısı Arm, şirket değerini 54,5 milyar dolar olarak belirleyerek her biri 51 dolarlık hisse senedi fiyatıyla halka arzını başlatıyor.",
      "Halka arz, Arm'ın ana şirketi Softbank'a yaklaşık 4,9 milyar dolar kazandıracak ve halka arz sonrasında Arm, Softbank'ın bir yan kuruluşu olarak yoluna devam edecek.",
      "Halka arz, Apple, Samsung ve Intel gibi teknoloji devlerinin yatırımlarını çekerek geniş çaplı bir onay aldı, ancak bu yılın başlarında Londra'da çifte kote olma umutlarının suya düşmesinin ardından yalnızca ABD'de kote olacak."
    ],
    "commentSummary": [
      "ARM'ın İlk Halka Arzı (IPO) başladı ve spekülasyonlar fiyatlardaki potansiyel artışın müşterileri açık kaynaklı RISC-V mimarisine doğru itebileceğini öne sürüyor.",
      "ARM'den RISC-V'ye olası bir geçişle ilgili tartışmalar devam etmekte olup, temel hususlar yazılım uyumluluğu ve donanımın birlikte çalışabilirliğidir.",
      "Halka arz, SoftBank'ın %21'lik bir hisse satmasıyla ARM'ın başarısını sürdürmek için stratejik olarak konumlandırılmıştır. Apple, Google ve Nvidia gibi teknoloji devleri, düşmanca bir devralmayı önlemek için halka arzı potansiyel olarak destekliyor."
    ],
    "points": 235,
    "commentCount": 155,
    "retryCount": 0,
    "time": 1694701076
  },
  {
    "id": 37510885,
    "title": "Çalınan van Gogh tablosu IKEA çantasında iade edildi",
    "originLink": "https://www.smithsonianmag.com/smart-news/dutch-art-detective-recovers-a-van-gogh-stolen-in-2020-180982896/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37510885",
    "commentBody": "",
    "originSummary": [
      "Vincent van Gogh'un erken dönem eserlerinden biri olan Nuenen'deki Papaz Evi Bahçesi, çalındıktan üç buçuk yıl sonra Hollanda'daki bir müzeden geri alındı.",
      "Değeri 3,2 ila 6,4 milyon dolar arasında değişen tablo, sanat dedektifi Arthur Brand'a bir Ikea çantası içinde isimsiz olarak iade edildi ve iade eden kişinin hırsızlıkla hiçbir ilgisi bulunmuyordu.",
      "Orijinal hırsız 2021 yılında tutuklanmış ve sekiz yıl hapis cezasına çarptırılmıştır. Restore edilen sanat eseri, gerekli inceleme ve restorasyonun ardından tekrar sergilenecek."
    ],
    "commentSummary": [
      "Çalınan van Gogh tablosu, sanat dedektifi Arthur Brand tarafından yönetilen bir yeraltı ağı aracılığıyla bir IKEA çantası içinde bulunmuş ve iade edilmiştir.",
      "2002'de çalınan bu tablo yeraltı suç dünyasında dolaşmaktaydı ve geri dönüşü çalıntı sanat eserlerinin bulundurulmasına ilişkin yasal sorunları gözler önüne sermektedir.",
      "Yazıda ayrıca tabloların korunması, sanat restorasyonu ve sanat hırsızlığı anlatılarına ilişkin kitap ve dizi önerileri de ele alınıyor."
    ],
    "points": 228,
    "commentCount": 76,
    "retryCount": 0,
    "time": 1694708140
  },
  {
    "id": 37507419,
    "title": "Nue - Bir React/Vue/Vite/Astro Alternatifi",
    "originLink": "https://nuejs.org",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37507419",
    "commentBody": "",
    "originSummary": [
      "Yazar, kullanıcı arayüzleri oluşturmak için Vue 2.0 ve Riot.js'den etkilenen bir JavaScript kütüphanesi olan Nue JS'yi geliştirmiştir.",
      "Vite, Next.js ve Astro gibi araçlara alternatif olması için tasarlanan Nue JS'yi tamamlayacak bir ekosistem üzerinde çalışılıyor. Amaç, aşamalı geliştirmeyi, endişelerin ayrılmasını ve semantik web tasarımını vurgulamaktır.",
      "Nue markası altındaki tüm ürünler, yazarın açık kaynaklı araçlara olan bağlılığını teyit eden MIT lisansı altında yayınlanacaktır."
    ],
    "commentSummary": [
      "Makale, tanınmış ön uç çerçevelerine hafif bir alternatif olan Nue JS'nin piyasaya sürüldüğünü duyuruyor ve ilgili projelerin potansiyel genişlemelerini tartışıyor.",
      "Ön uç geliştirme kapsülleme sorunları etrafındaki tartışmaları sergiler ve diğer benzer çerçevelerle karşılaştırmalar yaparken kullanıcı geri bildirimi sağlar.",
      "Yazı ayrıca Nue JS'ye yönelik değişen izleyici duygularını araştırıyor ve yapay zekanın kodlama normları üzerindeki potansiyel etkisini tartışmaya açıyor."
    ],
    "points": 207,
    "commentCount": 151,
    "retryCount": 0,
    "time": 1694689877
  },
  {
    "id": 37513030,
    "title": "Akıllı bir \"sürekli hareket\" cihazı [video]",
    "originLink": "https://www.youtube.com/watch?v=r_LG8FDt51U",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37513030",
    "commentBody": "",
    "originSummary": [
      "Video, bir topu sürekli hareket halinde tutmak için elektromıknatıslar ve endüktif bir yakınlık sensörü kullanarak esasen bir sürekli hareket simülatörü olarak çalışan bir 'sürekli hareket' cihazının sunumunu içermektedir.",
      "İçerik oluşturucu, cihazın işlevselliğinin kapsamlı bir gösterimini yapıyor ve kapasitörler ve ayarlanabilir parametreler gibi çeşitli bileşenleri üzerinden geçiyor.",
      "Video sırasında sürekli hareket kavramı, cihazın çalışma yönleriyle iç içe geçerek tartışılıyor. Sponsorlardan Incogni'nin kişisel verilerin korunmasına ve istenmeyen telefon aramalarının önlenmesine yardımcı olan bir hizmet olduğundan bahsediliyor."
    ],
    "commentSummary": [
      "Öne çıkan video, plastik raylar, mikro denetleyiciler, motorlu tekerlekler ve yeni güç kaynakları gibi potansiyel iyileştirmeler üzerine tartışmalara yol açan bir \"sürekli hareket\" cihazını gösteriyor.",
      "Konuşmalarda ayrıca gerçekliğin doğası, bilimin rolü, enerjinin korunması ve enerjinin eğri bir uzay-zaman bağlamında tanımlanması gibi felsefi ve bilimsel konular da ele alınıyor.",
      "Karanlık madde ve enerji teorileri ve bazı argümanların inandırıcılığı konusundaki şüphecilik de tartışmalar arasında yaygındır. Makale, YC Winter 2024 için yapılan başvurulara değinerek sona eriyor."
    ],
    "points": 205,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1694717042
  }
]
