[
  {
    "id": 37509507,
    "title": "প্রান্তিক ব্যবহারকারীর স্বৈরাচার",
    "originLink": "https://nothinghuman.substack.com/p/the-tyranny-of-the-marginal-user",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37509507",
    "commentBody": "",
    "originSummary": [
      "নিবন্ধটি ভোক্তা সফ্টওয়্যারহ্রাসের সমালোচনা করে, যা ওকেকিউপিডের মতো ডেটিং অ্যাপ্লিকেশনগুলির দ্বারা উদাহরণস্বরূপ, বিদ্যমানদের জন্য অভিজ্ঞতা উন্নত করার ব্যয়ে নতুন ব্যবহারকারীদের আকৃষ্ট করার দিকে মনোনিবেশের পরিবর্তনের কারণে।",
      "\"প্রান্তিক ব্যবহারকারী\" ধারণাটি প্রবর্তন করা হয়েছে, একটি সংক্ষিপ্ত মনোযোগ স্প্যান সহ ব্যবহারকারী যিনি সহজ সামগ্রী পছন্দ করেন। এই ব্যবহারকারীর ধরণের অগ্রাধিকার সফ্টওয়্যার গুণমান এবং ব্যবহারকারী এজেন্সি হ্রাসে অবদান হিসাবে দেখা হয়।",
      "লেখক নোট করেছেন যে ব্যবহারকারী এজেন্সি বাড়ানোর সরঞ্জামগুলি সাধারণত শখীদের দ্বারা বিকাশ করা হয় এবং প্রায়শই বড় কর্পোরেশনগুলি দ্বারা অধিগ্রহণ এবং বন্ধ হয়ে যায়।"
    ],
    "commentSummary": [
      "নিবন্ধটি মোবাইল-ব্যবহারকারী-কেন্দ্রিক পদ্ধতির দিকে ওকেকিউপিডের স্থানান্তর নিয়ে আলোচনা করেছে, যার ফলে কথোপকথনের গুণমান হ্রাস পেয়েছে এবং আরও পৃষ্ঠ-স্তরের ডেটিং অ্যাপ্লিকেশনগুলির উত্থান ঘটেছে বলে জানা গেছে।",
      "এটি সফ্টওয়্যার বিকাশে বৃদ্ধির মডেলগুলির নেতিবাচক প্রভাবকেও তুলে ধরে, ব্যবহারকারীর অভিজ্ঞতার চেয়ে অর্থনৈতিক সাফল্যের উপর তাদের ফোকাসের সমালোচনা করে এবং তাত্ক্ষণিক সন্তুষ্টি কীভাবে কোনও পণ্যের পতনের কারণ হতে পারে তা উল্লেখ করে।",
      "নিবন্ধটি একটি সর্বোত্তম নৈতিক সিস্টেম ডিজাইনের চ্যালেঞ্জগুলির দিকে মনোযোগ আকর্ষণ করে, বিষয়বস্তু ট্রান্সমিশনে ব্যবহারকারী ইন্টারফেস ডিজাইনের প্রভাব, উপযোগিতাবাদের চ্যালেঞ্জ এবং সম্পদ ের ব্যবহার এবং বৈষম্য সম্পর্কে ক্রমবর্ধমান উদ্বেগের মতো বিষয়গুলিতে মনোনিবেশ করে।"
    ],
    "points": 1150,
    "commentCount": 628,
    "retryCount": 0,
    "time": 1694701686
  },
  {
    "id": 37516523,
    "title": "ইউনিটি আপাতদৃষ্টিতে নীরবে তার গিটহাব রেপো সরিয়ে ফেলেছে যা টিওএস পরিবর্তনগুলি ট্র্যাক করে",
    "originLink": "https://www.gamerbraves.com/unity-silently-deletes-github-repo-that-tracks-terms-of-service-changes-and-updated-its-license/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37516523",
    "commentBody": "",
    "originSummary": [
      "ইউনিটি, একটি গেম ডেভেলপমেন্ট প্ল্যাটফর্ম, নীরবে একটি গিটহাব সংগ্রহস্থল সরিয়ে দেয় যা তার পরিষেবার শর্তাবলী (টিওএস) এবং ডেভেলপারদের গেম ইঞ্জিনের পুরানো সংস্করণগুলি ব্যবহার করার অনুমতি দেয়।",
      "রিপোজিটরির অপসারণওয়েবপৃষ্ঠাটিকে আর অ্যাক্সেসযোগ্য করে তোলে না, শেষ প্রাপ্যতা ছিল 16 জুলাই, 2022।",
      "ইউনিটির টিওএসের মূল পরিবর্তনগুলির মধ্যে একটি ধারা অপসারণ (এপ্রিল 2023 এ) অন্তর্ভুক্ত রয়েছে যা ডেভেলপারদের আপডেটের সময় শর্তাবলী অনুসারে বর্তমান বছরের সফ্টওয়্যার সংস্করণগুলি ব্যবহার করার অনুমতি দেয়; এটি ব্যবহারকারীদের ইউনিটির সমস্ত পরিষেবা পরিবর্তনগুলি মেনে চলতে বাধ্য করে, যেমন প্রতিটি গেম ইনস্টলেশনের জন্য সাম্প্রতিক মূল্য পরিকল্পনা আপডেট চার্জিং ডেভেলপার।"
    ],
    "commentSummary": [
      "ইউনিটি তার গিটহাব সংগ্রহস্থলটি মুছে ফেলেছে যা তার পরিষেবার শর্তাবলী (টিওএস) এর সংশোধনগুলি ট্র্যাক করে, স্বচ্ছতা এবং বিশ্বাস সম্পর্কে উদ্বেগ জাগিয়ে তোলে।",
      "টিওএসের এই রেট্রোঅ্যাক্টিভ পরিবর্তনগুলি গেম ডেভেলপারদের পূর্ববর্তী ব্যয় কাঠামোর উপর ভিত্তি করে তাদের কাজকে বিরক্ত করেছে।",
      "ইউনিটির ক্রিয়াকলাপগুলি তাদের বৈধতা এবং নৈতিকতা সম্পর্কে প্রশ্ন তুলেছে এবং আনরিয়েল ইঞ্জিনের সাথে প্রতিকূল তুলনা করা হয়েছে যা অনুরূপ প্রতি-ইনস্টল ফি আরোপ করে না।"
    ],
    "points": 586,
    "commentCount": 151,
    "retryCount": 0,
    "time": 1694736607
  },
  {
    "id": 37510865,
    "title": "১০ বছরের স্বয়ংক্রিয় আপডেট পাবে ক্রোমবুক",
    "originLink": "https://blog.google/outreach-initiatives/education/automatic-update-extension-chromebook/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37510865",
    "commentBody": "",
    "originSummary": [
      "গুগল এক দশকের জন্য স্বয়ংক্রিয়ভাবে সমস্ত ক্রোমবুক আপডেট করার পরিকল্পনা করেছে, এটি এই জাতীয় দীর্ঘমেয়াদী আপডেটগুলিতে প্রতিশ্রুতিবদ্ধ একমাত্র ওএস, যা সুরক্ষা, স্থিতিশীলতা এবং ডিভাইসের দীর্ঘায়ু উন্নত করবে।",
      "প্রযুক্তি জায়ান্ট তার অংশীদারদের সাথে আরও পুনর্ব্যবহারযোগ্য উপকরণ ব্যবহার করে ক্রোমবুক তৈরিতে সহযোগিতা করছে এবং বিদ্যুৎ সাশ্রয়ী বৈশিষ্ট্য এবং দ্রুত মেরামত পদ্ধতি চালু করছে।",
      "গুগলের কৌশলটি একটি ক্রোমবুকের উত্পাদন থেকে পুনর্ব্যবহার পর্যন্ত সম্পূর্ণ জীবনচক্রের উপর জোর দেয়, স্থায়িত্ব এবং ব্যবহারকারীর সুবিধার প্রতিশ্রুতি প্রদর্শন করে।"
    ],
    "commentSummary": [
      "ইলেকট্রনিক বর্জ্য কমাতে ক্রোমবুক স্বয়ংক্রিয়ভাবে ১০ বছর পর্যন্ত আপডেট করার সিদ্ধান্ত নিয়েছে গুগল।",
      "ফিঙ্গারপ্রিন্ট প্রমাণীকরণের নিরাপত্তা, শিক্ষাগত সেটিংসে ক্রোমবুকের স্থায়িত্ব এবং হার্ডওয়্যার সরবরাহকারীদের সাথে গুগলের সম্ভাব্য চ্যালেঞ্জসম্পর্কে অনলাইন ফোরামে বিতর্ক রয়েছে।",
      "ক্রোমবুকের জন্য বর্ধিত সমর্থনের প্রশংসা করা সত্ত্বেও, ব্যবহারকারীরা হার্ডওয়্যার সীমাবদ্ধতা এবং অনিচ্ছাকৃত অপারেটিং সিস্টেম (ওএস) যাচাইকরণ পুনরায় সক্ষমকরণ সম্পর্কে উদ্বেগ প্রকাশ করেছেন।"
    ],
    "points": 574,
    "commentCount": 326,
    "retryCount": 0,
    "time": 1694708057
  },
  {
    "id": 37508471,
    "title": "PostgreSQL 16",
    "originLink": "https://www.postgresql.org/about/news/postgresql-16-released-2715/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37508471",
    "commentBody": "",
    "originSummary": [
      "পোস্টগ্রেএসকিউএল গ্লোবাল ডেভেলপমেন্ট গ্রুপ ওপেন-সোর্স ডাটাবেসের সর্বশেষ আপডেট 14 সেপ্টেম্বর, 2023 এ পোস্টগ্রেএসকিউএল 16 প্রকাশের ঘোষণা দিয়েছে।",
      "বর্ধিতকরণগুলির মধ্যে কোয়েরি সমান্তরালতা, বাল্ক ডেটা লোডিং এবং যৌক্তিক প্রতিলিপিতে কর্মক্ষমতা উন্নতি অন্তর্ভুক্ত রয়েছে; বর্ধিত এসকিউএল / জেএসওএন সিনট্যাক্স; নতুন পর্যবেক্ষণ পরিসংখ্যান; এবং পলিসি ম্যানেজমেন্টের জন্য উন্নত অ্যাক্সেস নিয়ন্ত্রণ।",
      "উল্লেখযোগ্য সংযোজনগুলি হ'ল ক্লায়েন্ট লোড ভারসাম্য, এসআইএমডির মাধ্যমে সিপিইউ ত্বরণ এবং দ্বিমুখী যৌক্তিক প্রতিলিপি, শক্তিশালী পর্যবেক্ষণ, অ্যাক্সেস নিয়ন্ত্রণ এবং সুরক্ষা বৈশিষ্ট্যগুলির কারণে বিকাশকারী এবং সংস্থার জন্য উপকারী।"
    ],
    "commentSummary": [
      "পোস্টগ্রেএসকিউএল 16, একটি ওপেন-সোর্স সফ্টওয়্যার প্রকল্প, উন্নত বৈশিষ্ট্য এবং আরও ভাল সংস্করণ পরিচালনার সাথে প্রকাশিত হয়েছে।",
      "সফ্টওয়্যার অবকাঠামোতে প্রভাবশালী ভূমিকার জন্য বিখ্যাত এই প্রকল্পটি অবদানকারীদের একটি বৈচিত্র্যময় গ্রুপ দ্বারা সমর্থিত।",
      "বর্তমান আলোচনাগুলি পোস্টগ্রেএসকিউএল সম্পর্কিত পারফরম্যান্স অপ্টিমাইজেশান, ইনডেক্স ফোলাভাব, প্রতিলিপি এবং স্থাপনা বিকল্পগুলির মতো ক্ষেত্রগুলিতে ফোকাস করে।"
    ],
    "points": 534,
    "commentCount": 72,
    "retryCount": 0,
    "time": 1694696786
  },
  {
    "id": 37514940,
    "title": "আমাকে সহযোগিতা বা সমর্থন করার পরিবর্তে, গুগল আমার ধারণাটি চুরি করেছে",
    "originLink": "https://github.com/google/project-gameface/issues/1",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37514940",
    "commentBody": "",
    "originSummary": [
      "ওজরামোস নামের ওই ব্যক্তি অভিযোগ করেন, তাদের প্রজেক্ট হ্যান্ডসফ্রি.js গুগল তাদের প্রজেক্ট গেমফেসের জন্য চুরি করেছে, যার ফলে সমর্থন ও স্বীকৃতির অভাবে হতাশা ও হতাশা রয়ে গেছে।",
      "কার্নেগি মেলন ইউনিভার্সিটির একজন অধ্যাপক ওজরামোসের দাবির বৈধতার পক্ষে কথা বলেছেন এবং গুগলের কর্মকাণ্ডে তাদের নিজস্ব হতাশা প্রকাশ করেছেন।",
      "ব্যবহারকারীর মন্তব্যগুলিতে সাধারণ প্রতিক্রিয়া ওজরামোসের প্রতি সহায়ক ছিল, গুগলকে প্রতিক্রিয়া জানাতে এবং ওজরামোসের অবদানকে স্বীকৃতি দেওয়ার আহ্বান জানানো হয়েছিল।"
    ],
    "commentSummary": [
      "PTSD এবং গৃহহীনতায় ভুগছেন এমন একজন প্রবীণ একটি সহায়ক প্রযুক্তি তৈরি করেছেন, যা তিনি গুগলের বিরুদ্ধে তার প্রকল্পের জন্য সংস্থার সমর্থনের অভাবে চুরি করার অভিযোগ করেছেন।",
      "এই পরিস্থিতি কর্পোরেট নৈতিকতা, জবাবদিহিতা এবং উদ্ভাবকদের সাথে আচরণ সম্পর্কে বিতর্কের জন্ম দেয়, আইনী পদক্ষেপ এবং জনসাধারণের লজ্জাকে সম্ভাব্য সমাধান হিসাবে দেখা হয়।",
      "ঘটনাটি কর্পোরেট ক্রিয়াকলাপের জটিলতাগুলি তুলে ধরে এবং সামাজিক উন্নতির জন্য এই জাতীয় দ্বন্দ্বগুলি মোকাবেলার প্রয়োজনীয়তা নিয়ে আলোচনা করে।"
    ],
    "points": 421,
    "commentCount": 72,
    "retryCount": 0,
    "time": 1694726070
  },
  {
    "id": 37507355,
    "title": "স্ক্র্যাচ থেকে আইপি জিওলোকেশন ডাটাবেস কীভাবে তৈরি করবেন?",
    "originLink": "https://ipapi.is/geolocation.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37507355",
    "commentBody": "",
    "originSummary": [
      "লক্ষ্যযুক্ত বিজ্ঞাপন, জালিয়াতি সনাক্তকরণ, সামগ্রী স্থানীয়করণ, নেটওয়ার্ক সুরক্ষা এবং বিশ্লেষণে আইপি জিওলোকেশনের অ্যাপ্লিকেশনটি আইপি ঠিকানাগুলির জিওলোকেশনের চ্যালেঞ্জগুলির পাশাপাশি আলোচনা করা হয়েছে।",
      "নিবন্ধটি ডাব্লুএইচওআইএস রেকর্ড এবং ওপেন-সোর্স প্রকল্পগুলি ব্যবহার করে কীভাবে একটি জিওলোকেশন ডাটাবেস তৈরি করতে হয় তা বর্ণনা করে এবং আরআইপিই এনসিসি ডাটাবেসে জিওলোকেশন বৈশিষ্ট্যগুলির সীমিত কভারেজকে সম্বোধন করে।",
      "আইপি অ্যাড্রেস থেকে জিওলোকেশন ডেটা ব্যবহারের সীমাবদ্ধতা এবং বিকল্পগুলি অন্বেষণ করা হয়, যেমন অন্যান্য জিওলোকেশন প্রকল্প এবং ডেটা সমৃদ্ধকরণের জন্য তৃতীয় পক্ষের উত্স, ipapi.is উল্লেখ দিয়ে শেষ হয়।"
    ],
    "commentSummary": [
      "পাঠ্যটি স্ক্র্যাচ থেকে একটি সঠিক আইপি জিওলোকেশন ডাটাবেস স্থাপনের উপর দৃষ্টি নিবদ্ধ করে, আইপি অবস্থান নির্ভুলতার তাত্পর্যের উপর জোর দেয় এবং সিএসভি ফাইলগুলির জন্য এমএমডিবি ফর্ম্যাট ব্যবহার ের মতো বিভিন্ন পদ্ধতি নিয়ে আলোচনা করে।",
      "ভিপিএন এবং প্রক্সি সনাক্তকরণ, জালিয়াতি সনাক্তকরণের জন্য আইপিনফোর এপিআই ব্যবহার, কোনওকাস্টেড ঠিকানা সনাক্ত করার অসুবিধা এবং জিওলোকেশন ডেটার আশেপাশের গোপনীয়তার প্রভাবগুলিতে মনোযোগ দেওয়া হয়।",
      "ম্যাক্সমাইন্ড এবং ক্লাউডফ্লেয়ারের মতো জিওলোকেশন পরিষেবাগুলির নির্ভরযোগ্যতা প্রশ্নবিদ্ধ, বিকল্প পদ্ধতি যেমন ট্রেসরুট বিশ্লেষণ এবং বিজিপি বিজ্ঞাপনগুলি প্রতিস্থাপন হিসাবে প্রস্তাবিত। গুগলের মতো সংস্থাগুলির জন্য এই ডাটাবেসগুলির গুরুত্বের উপরও জোর দেওয়া হয়।"
    ],
    "points": 400,
    "commentCount": 154,
    "retryCount": 0,
    "time": 1694689246
  },
  {
    "id": 37507226,
    "title": "ক্যালিফোর্নিয়া এখনও পর্যন্ত সবচেয়ে শক্তিশালী রাইট-টু-মেরামত বিল পাস করেছে, 7 বছরের যন্ত্রাংশ প্রয়োজন",
    "originLink": "https://arstechnica.com/gadgets/2023/09/calif-passes-strongest-right-to-repair-bill-yet-requiring-7-years-of-parts/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37507226",
    "commentBody": "",
    "originSummary": [
      "ক্যালিফোর্নিয়া একটি বিস্তৃত রাইট-টু-মেরামত বিল পাস করেছে, যা বিক্রেতাদের ভোক্তা ইলেকট্রনিক্স এবং সরঞ্জামগুলির জন্য যন্ত্রাংশ, সরঞ্জাম, মেরামত গাইড এবং প্রয়োজনীয় সফ্টওয়্যার সরবরাহ করতে বাধ্য করে।",
      "বিলটি অন্যান্য রাষ্ট্রীয় আইনকে ছাড়িয়ে গেছে, বিক্রেতাদের 1 জুলাই, 2021 থেকে বিক্রি হওয়া পণ্যগুলির জন্য পণ্যের দাম দ্বারা নির্ধারিত সময়কালের জন্য এই জাতীয় আইটেমসরবরাহ ের দাবি জানিয়েছে। আইনটি প্রয়োগের বিধানগুলি অন্তর্ভুক্ত করে এবং মেরামত বিক্রেতাদের \"অনুমোদিত নয়\" অংশগুলির ব্যবহার প্রকাশ করার আদেশ দেয়।",
      "অ্যাপল এই বিলটিকে সমর্থন করেছে, তার পণ্যগুলির বর্ধিত মেরামতযোগ্যতা এবং স্থায়িত্বকে তুলে ধরেছে। এই আইন, অন্যান্য রাজ্য এবং ইউরোপের অনুরূপ আইনগুলির সাথে, নির্মাতাদের বিশ্বব্যাপী মেরামতযোগ্য এবং টেকসই পণ্য সরবরাহ করতে অনুপ্রাণিত করতে পারে।"
    ],
    "commentSummary": [
      "ক্যালিফোর্নিয়া একটি রাইট-টু-মেরামত বিল পাস করেছে যা নির্মাতাদের ন্যূনতম সাত বছরের জন্য তাদের পণ্যগুলির জন্য যন্ত্রাংশ সরবরাহ করতে বাধ্য করে।",
      "এই বিলটি তৃতীয় পক্ষের প্রতিস্থাপন অংশগুলির গুণমান, ছোট ব্যবসার উপর চাপ, প্রতিযোগিতা এবং বৌদ্ধিক সম্পত্তির অধিকারের উপর সম্ভাব্য প্রভাব সহ স্কিম্যাটিকস প্রকাশের মতো বিষয়গুলি সম্পর্কিত বিতর্কের জন্ম দিয়েছে।",
      "ইলেকট্রনিক ডিভাইস মেরামতের ক্ষমতা, স্বতন্ত্র যন্ত্রাংশের প্রাপ্যতা, স্থায়িত্ব এবং প্রযুক্তিপণ্যের সময়কাল, পরিকল্পিত অবহেলা এবং ভোক্তা অধিকারের উপর এর প্রভাব, ব্যয় বিবেচনা এবং ব্যবসা ও শিল্পের উপর সামগ্রিক প্রভাব সম্পর্কে উল্লেখযোগ্য আলোচনাসহ আলোচনাগুলি গভীরভাবে অনুসন্ধান করে।"
    ],
    "points": 391,
    "commentCount": 270,
    "retryCount": 0,
    "time": 1694688144
  },
  {
    "id": 37509560,
    "title": "টেলস একটি পোর্টেবল ওএস যা নজরদারি এবং সেন্সরশিপ থেকে রক্ষা করে",
    "originLink": "https://tails.net/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37509560",
    "commentBody": "",
    "originSummary": [
      "টেইলস একটি পোর্টেবল অপারেটিং সিস্টেম যা নজরদারি এবং সেন্সরশিপ থেকে রক্ষা করার জন্য ডিজাইন করা হয়েছে, অনলাইন গোপনীয়তা এবং সেন্সরশিপ প্রতিরোধের জন্য টর নেটওয়ার্ক ব্যবহার করে।",
      "একটি ইউএসবি স্টিকে ইনস্টল করার জন্য ডিজাইন করা, টেলস যে কোনও মেশিনে একটি সুরক্ষিত কম্পিউটিং পরিবেশ সরবরাহ করে, সংবেদনশীল ডকুমেন্টগুলি পরিচালনা এবং নিরাপদ যোগাযোগপরিচালনার জন্য অ্যাপ্লিকেশনগুলির সাথে সজ্জিত।",
      "এডওয়ার্ড স্নোডেন কর্তৃক অনুমোদিত এবং ইন্টারনেট স্বাধীনতা সংস্থাগুলির অর্থায়নে টেইলস ডেবিয়ান গ্নু / লিনাক্সের উপর ভিত্তি করে তৈরি। এটি অবাধে উপলব্ধ এবং প্রায়শই সাংবাদিক, অ্যাক্টিভিস্ট, গার্হস্থ্য সহিংসতা থেকে বেঁচে যাওয়া এবং অতিরিক্ত গোপনীয়তার প্রয়োজন এমন অন্যান্যদের দ্বারা ব্যবহার করা হয়।"
    ],
    "commentSummary": [
      "আলোচনাটি টেইলসের উপর দৃষ্টি নিবদ্ধ করে, একটি গোপনীয়তা-কেন্দ্রিক অপারেটিং সিস্টেম (ওএস) যা নজরদারি এবং সেন্সরশিপ থেকে রক্ষা করার জন্য তৈরি করা হয়েছে, পূর্ববর্তী সেশনগুলির চিহ্নগুলি ব্লক করা এবং ম্যালওয়্যার থেকে রক্ষা করার মতো বৈশিষ্ট্যগুলির সাথে।",
      "কথোপকথনটি টেইলস ওএসের কিছু সীমাবদ্ধতাও নির্দেশ করে, যার মধ্যে আইপি অ্যাড্রেস লিকেজের ঝুঁকি রয়েছে, হুনিক্স, হেডস এবং টিএনএসের মতো বিকল্পগুলি নিরাপদ ব্রাউজিং বিকল্প হিসাবে উল্লেখ করা হয়েছে।",
      "সংলাপের অন্যান্য বিষয়গুলির মধ্যে রয়েছে ইন্টারনেটের ইতিহাস এবং বৃদ্ধি, ওপেন-সোর্স সফ্টওয়্যারের নির্ভরযোগ্যতা এবং ওপেন-সোর্স উদ্যোগের অর্থায়ন।"
    ],
    "points": 384,
    "commentCount": 170,
    "retryCount": 0,
    "time": 1694701994
  },
  {
    "id": 37515996,
    "title": "আইন্যাচারিস্ট নিজে থেকেই আক্রমণ করে",
    "originLink": "https://baynature.org/2023/09/12/inaturalist-strikes-out-on-its-own/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37515996",
    "commentBody": "",
    "originSummary": [
      "জীববৈচিত্র্য লগিংয়ের জন্য একটি সামাজিক নেটওয়ার্ক আইন্যাচারলিস্ট একটি স্বাধীন অলাভজনক সত্তায় পরিণত হয়েছে, 10 মিলিয়ন ডলার অনুদানের সহায়তায়।",
      "অনুদানের লক্ষ্য হল প্রকৃতির সাথে মানুষকে সংযুক্ত করার এবং পরিবেশগত ডেটা তৈরির মিশন চালিয়ে যাওয়ার জন্য আইন্যাচারলিস্টকে সহায়তা করা। প্ল্যাটফর্মটি উচ্চ জীববৈচিত্র্য এবং তাদের পরিষেবাগুলিতে সীমিত অ্যাক্সেস যুক্ত অঞ্চলে তার উপস্থিতি বাড়ানোর আশা করে।",
      "আইন্যাচারলিস্ট প্রজাতির বিতরণের পূর্বাভাস দেওয়ার জন্য কৃত্রিম বুদ্ধিমত্তা অন্তর্ভুক্ত করার পরিকল্পনা করেছে এবং এর পূর্ববর্তী অংশীদার সংস্থাগুলির সাথে সহযোগিতা করতে চায়।"
    ],
    "commentSummary": [
      "টেনসরফ্লো লাইট মডেল ব্যবহার করে আইন্যাচারলিস্ট অ্যাপ্লিকেশনটি 50 মিলিয়ন পর্যবেক্ষণ পর্যবেক্ষণ করেছে, উদ্ভিদ এবং প্রাণীসনাক্তকরণে প্রকৃতি প্রেমীদের সহায়তা করেছে।",
      "ফটোগুলিতে শ্রেণি ভারসাম্যহীনতা এবং অবজেক্ট বিভ্রান্তির মতো ত্রুটি সত্ত্বেও, অ্যাপ্লিকেশনটি ব্যবহারকারী যাচাইকরণ এবং ভৌগলিক অগ্রাধিকারঅন্তর্ভুক্তির মাধ্যমে এর নির্ভুলতা বাড়িয়ে তোলে।",
      "ভবিষ্যতের উন্নতিগুলি বিভিন্ন প্ল্যাটফর্ম জুড়ে উন্নত ক্যামেরা প্রযুক্তি এবং অ্যাপ্লিকেশন প্রাপ্যতার সম্ভাব্য কর্মসংস্থানকে নির্দেশ করে।"
    ],
    "points": 338,
    "commentCount": 60,
    "retryCount": 0,
    "time": 1694732836
  },
  {
    "id": 37512888,
    "title": "একটি গিট সংগ্রহশালায়, আপনার ফাইলগুলি কোথায় থাকে?",
    "originLink": "https://jvns.ca/blog/2023/09/14/in-a-git-repository--where-do-your-files-live-/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37512888",
    "commentBody": "",
    "originSummary": [
      "গিট ফাইলগুলিকে একটি সংগ্রহস্থলের অভ্যন্তরে .git/objects ডিরেক্টরিতে স্বতন্ত্র অবজেক্ট হিসাবে সঞ্চয় করে, সামগ্রী-সম্বোধিত সঞ্চয়স্থান ব্যবহার করে, যেখানে ফাইলের নামগুলি ফাইলের সামগ্রীর হ্যাশ।",
      "গিট পৃথক সংস্করণগুলির জন্য ডিফ সঞ্চয় করে না; প্রতিটি সংস্করণ একটি সম্পূর্ণ ফাইল হিসাবে সংরক্ষিত হয়। পুরানো সংস্করণগুলি সনাক্ত করতে, ফাইল পরিবর্তনের সাথে সম্পর্কিত প্রতিশ্রুতিবদ্ধ আইডিগুলি সন্ধান করতে কেউ 'গিট লগ' ব্যবহার করতে পারেন।",
      "Git zlib বিন্যাস ব্যবহার করে অবজেক্টগুলিকে সংকুচিত করে। লেখক কোড স্নিপেটসহ গিট ব্যবহার করে একটি ব্লগ পোস্টের পুরানো সংস্করণ পুনরুদ্ধারের একটি ব্যবহারিক উদাহরণ সরবরাহ করেছেন।"
    ],
    "commentSummary": [
      "নিবন্ধটি গিটের একটি বিস্তৃত ওভারভিউ সরবরাহ করে, এর অনন্য কার্যকারিতা, সমস্যা সমাধানের পদ্ধতি, অভ্যন্তরীণ কার্যকারিতা এবং পরিবর্তনগুলি ট্র্যাকিং করার জন্য একটি নির্দেশিত অ্যাসাইক্লিক গ্রাফ (ডিএজি) এর ব্যবহার কে কভার করে।",
      "সংস্করণ নিয়ন্ত্রণ ব্যবস্থার ক্ষেত্রে এর নমনীয়তা এবং ধারাবাহিকতা সমর্থন কারী যুক্তি সত্ত্বেও গিটের ব্যবহারকারী ইন্টারফেসের সমালোচনাগুলি সম্ভাব্য উন্নতির পাশাপাশি অন্বেষণ করা হয়।",
      "অংশটি গিটের জটিলতা এবং ব্যবহারযোগ্যতা নিয়েও আলোচনা করে, অন্যান্য বিকল্পগুলির সাথে এর জনপ্রিয়তা তুলনা করে এবং ভবিষ্যতের উদ্ভাবন এবং স্কেল-আপের সম্ভাবনার রূপরেখা দেয়।"
    ],
    "points": 331,
    "commentCount": 88,
    "retryCount": 0,
    "time": 1694716454
  },
  {
    "id": 37516542,
    "title": "গডট ডেভেলপমেন্ট ফান্ড",
    "originLink": "https://fund.godotengine.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37516542",
    "commentBody": "",
    "originSummary": [
      "গোডট ডেভেলপমেন্ট ফান্ড এমন একটি প্রোগ্রাম যা ব্যক্তি এবং ব্যবসায়গুলিকে তাদের নির্বাচিত সদস্যতা স্তর অনুযায়ী বিভিন্ন পরিমাণে অবদান রেখে গডট গেম ইঞ্জিনবিকাশে আর্থিকভাবে সহায়তা করতে সক্ষম করে।",
      "তহবিলগুলি গডট ফাউন্ডেশন দ্বারা পরিচালিত হয় এবং ডেভেলপারদের নিয়োগ, শিল্পকর্ম তৈরি, হার্ডওয়্যার অর্জন এবং অন্যান্য প্রকল্প-সম্পর্কিত ব্যয়গুলি কভার করার মতো উদ্দেশ্যে ব্যবহৃত হয়।",
      "গডট সফ্টওয়্যার ফ্রিডম কনজারভেন্সির একটি অংশ এবং এর ওয়েবসাইটটি TuxFamily.org দ্বারা হোস্ট করা হয়, এই ওপেন-সোর্স প্রকল্পে বৈধতার একটি স্তর যুক্ত করে।"
    ],
    "commentSummary": [
      "একটি হ্যাকার নিউজ পোস্টে গডট ডেভেলপমেন্ট ফান্ড আলোচনার বিষয়, তবে সম্পর্কিত মন্তব্যগুলি অন্য সাইটে স্থানান্তরিত করা হয়েছে।",
      "ওয়াই কম্বিনেটর (ওয়াইসি) উইন্টার ২০২৪ ব্যাচের জন্য আবেদন উন্মুক্ত ঘোষণা করা হয়েছে।",
      "পোস্টটি অ্যাপ্লিকেশন নির্দেশিকা, FAQ, এপিআই, সুরক্ষা, আইনি তথ্য এবং কীভাবে আবেদন করতে হবে এবং ওয়াইসিতে পৌঁছানো যায় সে সম্পর্কে বিশদ বিবরণের মতো বেশ কয়েকটি সংস্থানের লিঙ্ক সরবরাহ করে।"
    ],
    "points": 291,
    "commentCount": 1,
    "retryCount": 0,
    "time": 1694736744
  },
  {
    "id": 37509624,
    "title": "গুগল ব্যবহারকারীদের 'শেয়ার' এবং 'বান্ডেল' এর মতো শব্দ এড়িয়ে চলতে বলা হয়েছে।",
    "originLink": "https://www.bloomberg.com/news/newsletters/2023-09-14/googlers-told-to-avoid-words-like-share-and-bundle-us-says-lmj27bhl",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37509624",
    "commentBody": "",
    "originSummary": [
      "চলমান ট্রায়ালে উপস্থাপিত নথি অনুসারে, গুগল কর্মীদের বা \"গুগলার্স\" কে প্রতিযোগিতাবিরোধী আচরণের ইঙ্গিত দেয় এমন নির্দিষ্ট শব্দ এবং বাক্যাংশ ব্যবহার করা থেকে বিরত থাকার নির্দেশ দেওয়া হয়েছে।",
      "এই নির্দেশগুলি একটি বৃহত্তর মামলার অংশ যেখানে গুগলকে অনলাইন অনুসন্ধানের বাজারে একচেটিয়া বজায় রাখার অভিযোগ আনা হচ্ছে। তবে গুগল এসব অভিযোগ অস্বীকার করেছে।",
      "নথিগুলি আরও প্রকাশ করে যে কর্মচারীদের তাদের ইতিহাস বন্ধ করে সংবেদনশীল চ্যাট করতে এবং \"তাদের বিমান সরবরাহ বন্ধ করা\" এবং \"বাজার ভাগ\" এর মতো বাক্যাংশগুলি এড়াতে উত্সাহিত করা হয়।"
    ],
    "commentSummary": [
      "আলোচনাটি গুগল এবং এর অ্যান্টিট্রাস্ট ইস্যুগুলির উপর দৃষ্টি নিবদ্ধ করে, আইনী বিষয়গুলিতে ভাষার গুরুত্ব এবং একচেটিয়া ক্ষমতার সম্ভাব্য অপব্যবহারের উপর জোর দেয়।",
      "বিষয়গুলির মধ্যে রয়েছে গুগলের কর্মীদের নির্দিষ্ট শব্দগুলি এড়িয়ে যাওয়ার নির্দেশ এবং অ্যাটর্নি-ক্লায়েন্টের বিশেষাধিকারকে ঘিরে কথোপকথন, প্রযুক্তি শিল্পে আইনী দিকগুলির জটিলতা প্রদর্শন করে।",
      "আরেকটি থিম হ'ল সফ্টওয়্যার শিল্পে গুগলের প্রভাবশালী ভূমিকা, এর পণ্যগুলির গুণমান এবং মূল্য এবং প্রতিযোগিতায় তাদের প্রভাবের মতো বিষয়গুলি নিয়ে আলোচনা করে।"
    ],
    "points": 261,
    "commentCount": 322,
    "retryCount": 0,
    "time": 1694702304
  },
  {
    "id": 37509533,
    "title": "সুতরাং আপনি ইউনিটি থেকে অবাস্তব ইঞ্জিনে যাওয়ার সিদ্ধান্ত নিয়েছেন",
    "originLink": "https://impromptugames.com/movingtounreal.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37509533",
    "commentBody": "",
    "originSummary": [
      "এই সারসংক্ষেপটি ইউনিটি থেকে আনরিয়েল ইঞ্জিনে রূপান্তরে সহায়তা করার জন্য গাইডেন্স এবং সংস্থান সরবরাহ করে, ডকুমেন্টেশন বোঝার গুরুত্ব, প্রাসঙ্গিক সম্প্রদায়গুলিতে যোগদান এবং এপিক অনলাইন লার্নিং লাইব্রেরির মতো শিক্ষাগত সংস্থানগুলি ব্যবহার ের গুরুত্বের উপর জোর দেয়।",
      "এটি পেমেন্ট স্ট্রাকচার, প্ল্যাটফর্ম সমর্থন সম্পর্কে উদ্বেগগুলি সমাধান করে এবং বহুমুখীতা, বিস্তৃত মার্কেটপ্লেস, দক্ষ ইনপুট সিস্টেম এবং 2 ডি এবং 3 ডি গেম বিকাশের সাথে সামঞ্জস্যের মতো আনরিয়েলের সুবিধাগুলির উপর জোর দেয়।",
      "নিবন্ধটি জনপ্রিয় গেমগুলিতে আনরিয়েল ইঞ্জিনের ব্যবহার, স্তরের নকশা সরঞ্জামগুলির উন্নতি এবং লিনাক্স এবং ম্যাক প্ল্যাটফর্মগুলিতে গেমগুলি বিকাশের সম্ভাব্যতা নোট করে।"
    ],
    "commentSummary": [
      "আলোচনাগুলি প্রাথমিকভাবে গেম ইঞ্জিন সম্পর্কিত বিষয়গুলিতে ফোকাস করে, বিশেষত ইউনিটি থেকে আনরিয়েল ইঞ্জিনে রূপান্তর এবং অবাস্তবের মধ্যে 'ব্লুপ্রিন্টস' এর প্রয়োগ।",
      "আগ্রহের অন্যান্য বিষয়গুলির মধ্যে রয়েছে ব্লুপ্রিন্টগুলি ব্যবহার করার সময় সংস্করণ নিয়ন্ত্রণ এবং একীভূত পরিবর্তন, সি ++ এর তুলনায় এর কর্মক্ষমতা এবং সীমাবদ্ধতা এবং গোডটের মতো অন্যান্য গেম ইঞ্জিনগুলির সাথে তুলনা।",
      "আলোচিত আরও বিষয়গুলির মধ্যে রয়েছে গেম ইঞ্জিন সংস্থাগুলির রাজস্ব উত্পাদন, ইউনিটি দ্বারা নীতি এবং মূল্য পরিবর্তন, পরিচালকদের দিকে নির্দেশিত হুমকি এবং টুইটারের ব্যবহার হ্রাস।"
    ],
    "points": 261,
    "commentCount": 138,
    "retryCount": 0,
    "time": 1694701840
  },
  {
    "id": 37517329,
    "title": "রৈখিক কোড আরও পাঠযোগ্য",
    "originLink": "https://blog.separateconcerns.com/2023-09-11-linear-code.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37517329",
    "commentBody": "",
    "originSummary": [
      "লেখক পঠনযোগ্যতার স্বার্থে বিমূর্ত কোডের বিরুদ্ধে পরামর্শ দিচ্ছেন, যুক্তি দিচ্ছেন যে রৈখিক কোড অভ্যন্তরীণভাবে আরও বোধগম্য।",
      "লেখক এমন একটি ফাংশনের উদাহরণ দিয়ে তাদের অবস্থানকে প্রমাণ করেছেন যা কোডে বিমূর্ততার ব্যবহারের সমালোচনা করে।",
      "তারা একটি সরঞ্জামের সাথে জড়িত একটি সম্ভাব্য কোড সমস্যা সমাধান করে, সুপারিশ করে যে কোডটি ওভেনকে একটি প্যারামিটার হিসাবে বিবেচনা করা উচিত, এই ধারণাটিকে শক্তিশালী করে যে ছোট ফাংশনগুলি রৈখিক কোড থেকে বের করা উচিত নয়।"
    ],
    "commentSummary": [
      "আলোচনার কেন্দ্রীয় থিম হ'ল বৃহত্তর রৈখিক ফাংশন এবং ছোট মডুলার ফাংশনপ্রচারের জন্য বিভিন্ন মতামতসহ কোডের পঠনযোগ্যতা এবং রক্ষণাবেক্ষণযোগ্যতা।",
      "বক্তৃতাটি অন্যান্য বিকাশকারীদের পঠনযোগ্যতার কথা মাথায় রেখে কোড লেখার তাৎপর্যকে তুলে ধরে এবং বিমূর্ততার যত্নসহকারে ব্যবহারের মাধ্যমে ভারসাম্য বজায় রাখে।",
      "এটি পঠনযোগ্যতা এবং দক্ষতার মধ্যে অগ্রাধিকার দেওয়ার সময় কোডবেসের নির্দিষ্ট প্রয়োজনীয়তাগুলি বিবেচনা করার গুরুত্বের উপর জোর দেয়। কোড গঠন, পরীক্ষা এবং স্কেলেবিলিটি সম্পর্কিত বিভিন্ন দৃষ্টিভঙ্গিও পরীক্ষা করা হয়।"
    ],
    "points": 242,
    "commentCount": 208,
    "retryCount": 0,
    "time": 1694743384
  },
  {
    "id": 37515645,
    "title": "প্রোগ্রামিং ল্যাঙ্গুয়েজ উদ্ভাবক নাকি সিরিয়াল কিলার? (2003)",
    "originLink": "https://vole.wtf/coder-serial-killer-quiz/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37515645",
    "commentBody": "",
    "originSummary": [
      "পাঠ্যটি এমন একটি গেমের ধারণাকে নির্দেশ করে যেখানে একটি প্রোগ্রামিং ভাষা উদ্ভাবক এবং একটি সিরিয়াল কিলারের মধ্যে পার্থক্য করা চ্যালেঞ্জ।",
      "এই গেমটিতে ব্যক্তিদের আগ্রহগুলি পরীক্ষা করা জড়িত থাকতে পারে, যা সম্ভবত হ্যাকিং এবং হত্যার মতো বিষয়গুলির সাথে জড়িত থাকতে পারে।",
      "প্রযুক্তি এবং সত্যিকারের অপরাধকে একটি ইন্টারেক্টিভ ফর্ম্যাটে একত্রিত করার পরামর্শে পোস্টটি অনন্য।"
    ],
    "commentSummary": [
      "নিবন্ধটি এমন একটি গেম কভার করে যা অনুমান করে যে কোনও ছবিতে কোনও ব্যক্তি সিরিয়াল কিলার বা প্রোগ্রামিং ভাষার বিকাশকারী কিনা।",
      "প্রোগ্রামার এবং সিরিয়াল কিলারদের সাথে যুক্ত স্টেরিওটাইপগুলির পাশাপাশি কারও প্রকৃতির সাথে মুখের বৈশিষ্ট্যগুলি যুক্ত করার বৈধতা নিয়ে আলোচনার থ্রেডের মধ্যে একটি বিতর্ক রয়েছে।",
      "গেমটি মিশ্র প্রতিক্রিয়া অর্জন করেছে, কিছু অংশগ্রহণকারী এটি উপভোগ করেছেন, অন্যরা সম্ভাব্য বৈষম্য সম্পর্কে উদ্বেগ প্রকাশ করেছেন এবং কিছু বর্জন দেখে বিস্মিত হয়েছেন।"
    ],
    "points": 239,
    "commentCount": 107,
    "retryCount": 0,
    "time": 1694730488
  },
  {
    "id": 37511036,
    "title": "অত্যধিক আত্মবিশ্বাস এবং নেতিবাচক মনোভাবের সাথে যুক্ত মধ্যবর্তী বিজ্ঞান জ্ঞান",
    "originLink": "https://www.nature.com/articles/s41562-023-01677-8",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37511036",
    "commentBody": "",
    "originSummary": [
      "গবেষণাটি বৈজ্ঞানিক জ্ঞান, আত্ম-আশ্বাস এবং বিজ্ঞানের প্রতি মনোভাবের মধ্যে একটি লিঙ্ক আবিষ্কার করে, বিশেষত মধ্য-স্তরের বৈজ্ঞানিক জ্ঞানযুক্ত ব্যক্তিদের মধ্যে অত্যধিক আত্মবিশ্বাস এবং নেতিবাচক পক্ষপাত লক্ষ্য করে।",
      "অনুসন্ধানগুলি বিদ্যমান মডেলগুলিকে প্রশ্নবিদ্ধ করে এবং এই অত্যধিক আত্মবিশ্বাসকে মোকাবেলা করার প্রয়োজনীয়তা তুলে ধরে এবং বিজ্ঞানের আরও গভীরভাবে বোঝার জন্য উত্সাহিত করে।",
      "নিবন্ধটি একাডেমিক প্রকাশনা এবং এর প্রকাশক সম্পর্কে ও বিশদ সরবরাহ করে।"
    ],
    "commentSummary": [
      "আলোচনাটি বিজ্ঞানের সীমাবদ্ধতা, এটি সংজ্ঞায়িত করার চ্যালেঞ্জগুলি এবং বৈজ্ঞানিক দাবিগুলিতে অত্যধিক বিশ্বাস রাখার বিপদগুলি বোঝার উপর দৃষ্টি নিবদ্ধ করে।",
      "অত্যধিক আত্মবিশ্বাস কীভাবে বিভিন্ন ক্ষেত্রে প্রভাব ফেলে এবং মিডিয়া এবং রাজনীতি কীভাবে বিজ্ঞান সম্পর্কে জনসাধারণের উপলব্ধিকে আকার দেয় সে সম্পর্কে এটি আলোকপাত করে।",
      "অত্যধিক আত্মবিশ্বাস এবং বিজ্ঞান অস্বীকারবাদ মোকাবেলার জন্য নম্রতা, সমালোচনামূলক চিন্তাভাবনা এবং বৈজ্ঞানিক বোঝার অনিশ্চয়তার স্বীকৃতির প্রয়োজনীয়তার উপর জোর দেওয়া হয়।"
    ],
    "points": 239,
    "commentCount": 194,
    "retryCount": 0,
    "time": 1694708692
  },
  {
    "id": 37509427,
    "title": "আজ থেকে শুরু হচ্ছে আইপিও",
    "originLink": "https://www.theregister.com/2023/09/14/arm_ipo/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37509427",
    "commentBody": "",
    "originSummary": [
      "ব্রিটিশ চিপ ডিজাইনার আর্ম ৫১ ডলার স্টক প্রাইস নিয়ে আইপিও শুরু করছে, যার ফলে কোম্পানির মূল্য ৫৪.৫ বিলিয়ন ডলার নির্ধারণ করা হয়েছে।",
      "এই আইপিও থেকে আর্মের মূল কোম্পানি সফটব্যাংকের জন্য প্রায় ৪.৯ বিলিয়ন ডলার আয় হবে এবং আইপিওর পরে, আর্ম সফটব্যাংকের সহায়ক সংস্থা হিসাবে অব্যাহত থাকবে।",
      "আইপিওটি ব্যাপক অনুমোদন পেয়েছে, অ্যাপল, স্যামসাং এবং ইন্টেলের মতো প্রযুক্তি হেভিওয়েটদের কাছ থেকে বিনিয়োগ আকৃষ্ট করেছে, তবে এই বছরের শুরুতে লন্ডনে দ্বৈত তালিকাভুক্তির আশা ভেঙে যাওয়ার পরে এটি কেবল মার্কিন যুক্তরাষ্ট্রে তালিকাভুক্ত হবে।"
    ],
    "commentSummary": [
      "এআরএম-এর প্রাথমিক গণপ্রস্তাব (আইপিও) শুরু হয়েছে, ধারণা করা হচ্ছে যে দামের সম্ভাব্য বৃদ্ধি গ্রাহকদের ওপেন-সোর্স আরআইএসসি-ভি আর্কিটেকচারের দিকে ঠেলে দিতে পারে।",
      "এআরএম থেকে আরআইএসসি-ভি-তে সম্ভাব্য রূপান্তর সম্পর্কে আলোচনা চলছে, মূল বিবেচনাগুলি হ'ল সফ্টওয়্যার সামঞ্জস্যতা এবং হার্ডওয়্যার ইন্টারঅপারেবিলিটি।",
      "আইপিও কৌশলগতভাবে এআরএমের সাফল্য বজায় রাখার জন্য অবস্থান করছে, সফটব্যাংক 21% শেয়ার বিক্রি করেছে। অ্যাপল, গুগল এবং এনভিডিয়ার মতো প্রযুক্তি জায়ান্টরা প্রতিকূল অধিগ্রহণ এড়াতে আইপিওকে সমর্থন করতে পারে।"
    ],
    "points": 235,
    "commentCount": 155,
    "retryCount": 0,
    "time": 1694701076
  },
  {
    "id": 37510885,
    "title": "চুরি যাওয়া ভ্যান গগ পেইন্টিং আইকিয়া ব্যাগে ফেরত দেওয়া হয়েছে",
    "originLink": "https://www.smithsonianmag.com/smart-news/dutch-art-detective-recovers-a-van-gogh-stolen-in-2020-180982896/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37510885",
    "commentBody": "",
    "originSummary": [
      "ভিনসেন্ট ভ্যান গগের একটি প্রাথমিক কাজ, বসন্তে নুয়েনেনের পার্সোনেজ গার্ডেন, ডাচ জাদুঘর থেকে চুরির সাড়ে তিন বছর পরে পুনরুদ্ধার করা হয়েছে।",
      "৩.২ থেকে ৬.৪ মিলিয়ন ডলার মূল্যের এই চিত্রকর্মটি একটি আইকিয়া ব্যাগে করে শিল্প গোয়েন্দা আর্থার ব্র্যান্ডের কাছে বেনামে ফেরত দেওয়া হয়েছিল।",
      "মূল চোরকে ২০২১ সালে গ্রেপ্তার করা হয়েছিল এবং আট বছরের কারাদণ্ড দেওয়া হয়েছিল। পুনরুদ্ধার করা শিল্পকর্মটি প্রয়োজনীয় পরীক্ষা এবং পুনরুদ্ধারের পরে আবার প্রদর্শিত হবে।"
    ],
    "commentSummary": [
      "চুরি যাওয়া ভ্যান গগ পেইন্টিংটি উদ্ধার করা হয়েছিল এবং শিল্প গোয়েন্দা আর্থার ব্র্যান্ড পরিচালিত একটি ভূগর্ভস্থ নেটওয়ার্কের মাধ্যমে একটি আইকেইএ ব্যাগে ফিরিয়ে দেওয়া হয়েছিল।",
      "২০০২ সালে চুরি হওয়া এই চিত্রকর্মটি অপরাধমূলক আন্ডারওয়ার্ল্ডে ছড়িয়ে পড়েছিল এবং এর প্রত্যাবর্তন চুরি হওয়া শিল্পকর্মের মালিকানা সম্পর্কিত আইনি বিষয়গুলি চিত্রিত করে।",
      "এছাড়াও পোস্টে চিত্রসংরক্ষণ, শিল্প পুনরুদ্ধার এবং শিল্প চুরির বিবরণ সম্পর্কিত বই এবং সিরিজের জন্য সুপারিশ সম্পর্কে থিমগুলি আলোচনা করা হয়েছে।"
    ],
    "points": 228,
    "commentCount": 76,
    "retryCount": 0,
    "time": 1694708140
  },
  {
    "id": 37507419,
    "title": "Nue – A React/Vue/Vite/Astro Alternative",
    "originLink": "https://nuejs.org",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37507419",
    "commentBody": "",
    "originSummary": [
      "লেখক ভিউ ২.০ এবং রাইট.js দ্বারা প্রভাবিত হয়ে ইউজার ইন্টারফেস তৈরির জন্য একটি জাভাস্ক্রিপ্ট লাইব্রেরি নু জেএস তৈরি করেছেন।",
      "ভিট, নেক্সট, .js এবং অ্যাস্ট্রোর মতো সরঞ্জামগুলির বিকল্প হিসাবে ডিজাইন করা নু জেএসের পরিপূরক হিসাবে একটি ইকোসিস্টেম কাজ করছে। লক্ষ্য হ'ল প্রগতিশীল বৃদ্ধি, উদ্বেগের পৃথকীকরণ এবং শব্দার্থিক ওয়েব ডিজাইনের উপর জোর দেওয়া।",
      "নু ব্র্যান্ডের অধীনে সমস্ত পণ্য এমআইটি লাইসেন্সের অধীনে প্রকাশিত হবে, যা ওপেন-সোর্স টুলিংয়ের প্রতি লেখকের প্রতিশ্রুতি নিশ্চিত করে।"
    ],
    "commentSummary": [
      "নিবন্ধটি বিখ্যাত ফ্রন্ট-এন্ড ফ্রেমওয়ার্কগুলির একটি হালকা বিকল্প নু জেএস চালু করার ঘোষণা দেয় এবং সম্পর্কিত প্রকল্পগুলিতে সম্ভাব্য সম্প্রসারণ নিয়ে আলোচনা করে।",
      "এটি ফ্রন্ট-এন্ড ডেভেলপমেন্ট এনক্যাপসুলেশন ইস্যুগুলি নিয়ে বিতর্ক প্রদর্শন করে এবং অন্যান্য অনুরূপ ফ্রেমওয়ার্কের সাথে তুলনা করার সময় ব্যবহারকারীর প্রতিক্রিয়া সরবরাহ করে।",
      "পোস্টটি নু জেএস-এর প্রতি শ্রোতাদের বিভিন্ন অনুভূতিও অনুসন্ধান করে এবং কোডিং নিয়মের উপর কৃত্রিম বুদ্ধিমত্তার সম্ভাব্য প্রভাব সম্পর্কে কথোপকথনে নিয়ে আসে।"
    ],
    "points": 207,
    "commentCount": 151,
    "retryCount": 0,
    "time": 1694689877
  },
  {
    "id": 37513030,
    "title": "একটি চতুর \"চিরস্থায়ী গতি\" ডিভাইস [ভিডিও]",
    "originLink": "https://www.youtube.com/watch?v=r_LG8FDt51U",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37513030",
    "commentBody": "",
    "originSummary": [
      "ভিডিওটিতে একটি 'চিরস্থায়ী গতি' ডিভাইসের উপস্থাপনা জড়িত যা মূলত একটি চিরস্থায়ী গতি সিমুলেটর হিসাবে কাজ করে, ইলেক্ট্রোম্যাগনেট এবং একটি ইনডাকটিভ প্রক্সিমিটি সেন্সর ব্যবহার করে একটি বলকে ধ্রুবক গতিতে রাখতে।",
      "নির্মাতা ডিভাইসের কার্যকারিতার একটি বিস্তৃত প্রদর্শন ী দেয় এবং এর বিভিন্ন উপাদান যেমন ক্যাপাসিটর এবং সামঞ্জস্যযোগ্য প্যারামিটারগুলির মধ্য দিয়ে যায়।",
      "ডিভাইসের ক্রিয়াকলাপের দিকগুলির সাথে জড়িত ভিডিও চলাকালীন চিরস্থায়ী গতির ধারণাটি নিয়ে আলোচনা করা হয়েছে। একটি স্পনসর, ইনকগনি, এমন একটি পরিষেবা হিসাবে উল্লেখ করা হয় যা ব্যক্তিগত ডেটা সুরক্ষা এবং অবাঞ্ছিত ফোন কল প্রতিরোধে সহায়তা করে।"
    ],
    "commentSummary": [
      "বৈশিষ্ট্যযুক্ত ভিডিওটিতে একটি \"চিরস্থায়ী গতি\" ডিভাইস দেখানো হয়েছে, যা প্লাস্টিকরেল, মাইক্রোকন্ট্রোলার, মোটরচালিত চাকা এবং নতুন শক্তি উত্সগুলির মতো সম্ভাব্য উন্নতিনিয়ে আলোচনা শুরু করে।",
      "কথোপকথনগুলি দার্শনিক এবং বৈজ্ঞানিক বিষয়গুলিও অন্তর্ভুক্ত করে, যেমন বাস্তবতার প্রকৃতি, বিজ্ঞানের ভূমিকা, শক্তি সংরক্ষণ এবং একটি বাঁকা স্থান-সময়ের প্রেক্ষাপটে শক্তি সংজ্ঞায়িত করা।",
      "ডার্ক ম্যাটার এবং এনার্জি থিওরি নিয়ে সংশয় এবং কিছু যুক্তির বিশ্বাসযোগ্যতাও আলোচনার মধ্যে প্রচলিত। নিবন্ধটি ওয়াইসি উইন্টার 2024 এর জন্য অ্যাপ্লিকেশনগুলি উল্লেখ করে শেষ হয়।"
    ],
    "points": 205,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1694717042
  }
]
