[
  {
    "id": 37509507,
    "title": "طغيان المستخدم الهامشي",
    "originLink": "https://nothinghuman.substack.com/p/the-tyranny-of-the-marginal-user",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37509507",
    "commentBody": "",
    "originSummary": [
      "ينتقد المقال الانخفاض في برامج المستهلك ، والذي يتضح من تطبيقات المواعدة مثل OKCupid ، بسبب التحول في التركيز نحو جذب مستخدمين جدد على حساب تحسين تجربة المستخدمين الحاليين.",
      "يتم تقديم مفهوم \"المستخدم الهامشي\" ، وهو مستخدم ذو فترة انتباه قصيرة ويفضل المحتوى البسيط. ينظر إلى تحديد أولويات هذا النوع من المستخدمين على أنه يساهم في انخفاض جودة البرامج ووكالة المستخدم.",
      "يلاحظ المؤلف أن الأدوات التي تزيد من وكالة المستخدم عادة ما يتم تطويرها من قبل الهواة وغالبا ما يتم الحصول عليها وإيقافها من قبل الشركات الكبرى."
    ],
    "commentSummary": [
      "يناقش المقال تحول OkCupid نحو نهج يركز على مستخدم الهاتف المحمول ، والذي يقال إنه أدى إلى انخفاض جودة المحادثة وظهور المزيد من تطبيقات المواعدة على مستوى السطح.",
      "كما يسلط الضوء على التأثير السلبي لنماذج النمو في تطوير البرمجيات ، وينتقد تركيزها على النجاح الاقتصادي على تجربة المستخدم ، ويلاحظ كيف أن تلبية الإشباع الفوري قد تؤدي إلى سقوط المنتج.",
      "يلفت المقال الانتباه إلى التحديات في تصميم نظام أخلاقي مثالي ، مع التركيز على مسائل مثل تأثير تصميم واجهة المستخدم على نقل المحتوى ، وتحديات النفعية ، والقلق المتزايد بشأن استهلاك الموارد وعدم المساواة."
    ],
    "points": 1150,
    "commentCount": 628,
    "retryCount": 0,
    "time": 1694701686
  },
  {
    "id": 37516523,
    "title": "يبدو أن Unity قد أزالت بصمت GitHub repo الذي يتتبع تغييرات ToS",
    "originLink": "https://www.gamerbraves.com/unity-silently-deletes-github-repo-that-tracks-terms-of-service-changes-and-updated-its-license/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37516523",
    "commentBody": "",
    "originSummary": [
      "قامت Unity ، وهي منصة لتطوير الألعاب ، بإزالة مستودع GitHub بهدوء الذي يتتبع التغييرات التي تطرأ على شروط الخدمة (ToS) وفقرة تسمح للمطورين باستخدام الإصدارات القديمة من محرك اللعبة.",
      "يؤدي حذف المستودع إلى عدم إمكانية الوصول إلى صفحة الويب ، حيث كان آخر توفر هو 16 يوليو 2022.",
      "تضمنت التغييرات الرئيسية في شروط خدمة Unity إزالة بند (في أبريل 2023) يسمح للمطورين باستخدام إصدارات البرامج للعام الحالي وفقا للشروط في وقت التحديث ؛ هذا يجبر المستخدمين على الامتثال لجميع تغييرات خدمة Unity ، مثل تحديث خطة التسعير الأخير الذي يفرض رسوما على المطورين لكل تثبيت لعبة."
    ],
    "commentSummary": [
      "قامت Unity بمسح مستودع GitHub الخاص بها الذي تتبع التعديلات على شروط الخدمة (ToS) ، مما أثار مخاوف بشأن الشفافية والثقة.",
      "هذه التغييرات بأثر رجعي على ToS قد أزعجت مطوري الألعاب الذين يستندون في عملهم على هيكل التكلفة السابق.",
      "أثارت تصرفات Unity تساؤلات بشأن شرعيتها وأخلاقياتها ، وتم إجراء مقارنات غير مواتية مع Unreal Engine الذي لا يفرض رسوما مماثلة لكل تثبيت."
    ],
    "points": 586,
    "commentCount": 151,
    "retryCount": 0,
    "time": 1694736607
  },
  {
    "id": 37510865,
    "title": "ستحصل أجهزة Chromebook على 10 سنوات من التحديثات التلقائية",
    "originLink": "https://blog.google/outreach-initiatives/education/automatic-update-extension-chromebook/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37510865",
    "commentBody": "",
    "originSummary": [
      "تخطط Google لتحديث جميع أجهزة Chromebook تلقائيا لمدة عقد من الزمان ، مما يجعلها نظام التشغيل الوحيد الذي يلتزم بمثل هذه التحديثات طويلة المدى ، والتي ستعمل على تحسين الأمان والاستقرار وطول عمر الجهاز.",
      "تتعاون شركة التكنولوجيا العملاقة مع شركائها لبناء أجهزة Chromebook باستخدام المزيد من المواد المعاد تدويرها وتقدم ميزات موفرة للطاقة وطرق إصلاح سريعة.",
      "تؤكد استراتيجية Google على دورة الحياة الكاملة لجهاز Chromebook ، من إنتاجه إلى إعادة التدوير ، مما يعرض التزاما بالاستدامة وراحة المستخدم."
    ],
    "commentSummary": [
      "قررت Google أن أجهزة Chromebook سيتم تحديثها تلقائيا لمدة تصل إلى 10 سنوات في محاولة لتقليل النفايات الإلكترونية.",
      "كان هناك نقاش في المنتدى عبر الإنترنت حول أمان مصادقة بصمات الأصابع ، ومتانة أجهزة Chromebook في البيئات التعليمية ، والتحديات المحتملة التي قد تواجهها Google مع موردي الأجهزة.",
      "على الرغم من تقديرهم للدعم الموسع لأجهزة Chromebook ، فقد أعرب المستخدمون عن مخاوفهم بشأن قيود الأجهزة وإعادة تمكين التحقق من نظام التشغيل (OS) غير المقصود."
    ],
    "points": 574,
    "commentCount": 326,
    "retryCount": 0,
    "time": 1694708057
  },
  {
    "id": 37508471,
    "title": "PostgreSQL 16",
    "originLink": "https://www.postgresql.org/about/news/postgresql-16-released-2715/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37508471",
    "commentBody": "",
    "originSummary": [
      "أعلنت مجموعة التطوير العالمية PostgreSQL عن إصدار PostgreSQL 16 في 14 سبتمبر 2023 ، وهو آخر تحديث لقاعدة البيانات مفتوحة المصدر.",
      "تشمل التحسينات تحسينات في الأداء في توازي الاستعلام وتحميل البيانات المجمعة والنسخ المتماثل المنطقي ؛ بناء جملة SQL / JSON الموسع ؛ إحصائيات مراقبة جديدة ؛ وتحسين التحكم في الوصول لإدارة السياسة.",
      "الإضافات الجديرة بالملاحظة هي دعم موازنة تحميل العميل ، وتسريع وحدة المعالجة المركزية عبر SIMD ، والنسخ المتماثل المنطقي ثنائي الاتجاه ، وهو مفيد للمطورين والمؤسسات بسبب المراقبة المعززة والتحكم في الوصول وميزات الأمان."
    ],
    "commentSummary": [
      "تم إصدار PostgreSQL 16 ، وهو مشروع برمجي مفتوح المصدر ، بميزات محسنة وإدارة أفضل للإصدارات.",
      "هذا المشروع ، المشهور بدوره المؤثر في البنية التحتية للبرمجيات ، مدعوم من قبل مجموعة متنوعة من المساهمين.",
      "تركز المناقشات الحالية على مجالات مثل تحسين الأداء ، وسخام الفهرس ، والنسخ المتماثل ، وخيارات النشر المتعلقة ب PostgreSQL."
    ],
    "points": 534,
    "commentCount": 72,
    "retryCount": 0,
    "time": 1694696786
  },
  {
    "id": 37514940,
    "title": "بدلا من التعاون معي أو دعمي ، سرقت Google فكرتي",
    "originLink": "https://github.com/google/project-gameface/issues/1",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37514940",
    "commentBody": "",
    "originSummary": [
      "يدعي الفرد ، أوزراموس ، أن مشروعه ، Handsfree .js ، كان مسروقا من قبل Google بسبب Project Gameface ، مما أدى إلى الإحباط وخيبة الأمل بسبب نقص الدعم والتقدير.",
      "أكد أستاذ من جامعة كارنيجي ميلون صحة ادعاءات أوزراموس ، معربا عن خيبة أمله في تصرفات Google.",
      "كانت الاستجابة العامة في تعليقات المستخدمين داعمة ل ozramos ، مع دعوات ل Google للرد والاعتراف بمساهمات ozramos."
    ],
    "commentSummary": [
      "طور أحد المحاربين القدامى الذين يعانون من اضطراب ما بعد الصدمة والتشرد تقنية مفيدة ، والتي يتهم Google بسرقتها بسبب نقص الدعم من الشركة لمشروعه.",
      "أثار الوضع مناقشات حول أخلاقيات الشركات والمساءلة ومعاملة المبتكرين ، مع النظر إلى الإجراءات القانونية والتشهير العام كحلول محتملة.",
      "يؤكد الحادث على تعقيدات إجراءات الشركات ويناقش ضرورة معالجة مثل هذه النزاعات من أجل تحسين المجتمع."
    ],
    "points": 421,
    "commentCount": 72,
    "retryCount": 0,
    "time": 1694726070
  },
  {
    "id": 37507355,
    "title": "كيفية بناء قاعدة بيانات تحديد الموقع الجغرافي IP من البداية؟",
    "originLink": "https://ipapi.is/geolocation.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37507355",
    "commentBody": "",
    "originSummary": [
      "تتم مناقشة تطبيق تحديد الموقع الجغرافي IP في الإعلانات المستهدفة ، واكتشاف الاحتيال ، وتوطين المحتوى ، وأمن الشبكة ، والتحليلات ، إلى جانب تحديات تحديد الموقع الجغرافي لعناوين IP.",
      "توضح المقالة كيفية إنشاء قاعدة بيانات لتحديد الموقع الجغرافي باستخدام سجلات WHOIS والمشاريع مفتوحة المصدر، وتتناول التغطية المحدودة لسمات تحديد الموقع الجغرافي في قاعدة بيانات RIPE NCC.",
      "يتم استكشاف قيود وبدائل استخدام بيانات تحديد الموقع الجغرافي من عناوين IP ، مثل مشاريع تحديد الموقع الجغرافي الأخرى ومصادر الطرف الثالث لإثراء البيانات ، وتختتم بذكر ipapi.is."
    ],
    "commentSummary": [
      "يركز النص على إنشاء قاعدة بيانات دقيقة لتحديد الموقع الجغرافي IP من البداية ، مع التأكيد على أهمية دقة موقع IP ، ومناقشة منهجيات مختلفة مثل استخدام تنسيق MMDB لملفات CSV.",
      "يتم إيلاء الاهتمام للكشف عن الشبكات الافتراضية الخاصة والوكلاء ، واستخدام واجهة برمجة تطبيقات IPinfo للكشف عن الاحتيال ، وصعوبات اكتشاف أي عناوين مرسلة ، والآثار المترتبة على الخصوصية المحيطة ببيانات تحديد الموقع الجغرافي.",
      "يتم التشكيك في موثوقية خدمات تحديد الموقع الجغرافي مثل MaxMind و Cloudflare ، مع طرق بديلة مثل تحليل traceroute وإعلانات BGP المقترحة كبدائل. كما تم التأكيد على أهمية قواعد البيانات هذه لشركات مثل Google."
    ],
    "points": 400,
    "commentCount": 154,
    "retryCount": 0,
    "time": 1694689246
  },
  {
    "id": 37507226,
    "title": "كاليفورنيا تمرر أقوى فاتورة حق في الإصلاح حتى الآن ، تتطلب 7 سنوات من قطع الغيار",
    "originLink": "https://arstechnica.com/gadgets/2023/09/calif-passes-strongest-right-to-repair-bill-yet-requiring-7-years-of-parts/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37507226",
    "commentBody": "",
    "originSummary": [
      "أقرت كاليفورنيا مشروع قانون شامل للحق في الإصلاح ، يلزم البائعين بتوريد قطع الغيار والأدوات وأدلة الإصلاح والبرامج الأساسية للإلكترونيات والأجهزة الاستهلاكية.",
      "يتجاوز مشروع القانون قوانين الولاية الأخرى ، ويطالب البائعين بتقديم مثل هذه العناصر للمنتجات المباعة اعتبارا من 1 يوليو 2021 ، لمدة تحددها تكلفة المنتج. يتضمن التشريع أحكاما تنفيذية ويفرض على بائعي الإصلاح الكشف عن استخدام الأجزاء \"غير المصرح بها\".",
      "دعمت Apple مشروع القانون هذا ، مما يؤكد على زيادة قابلية منتجاتها للإصلاح والمتانة. قد يحفز هذا التشريع ، إلى جانب القوانين المماثلة في دول أخرى وأوروبا ، الشركات المصنعة على توفير منتجات مستدامة وقابلة للإصلاح على مستوى العالم."
    ],
    "commentSummary": [
      "أقرت ولاية كاليفورنيا مشروع قانون الحق في الإصلاح الذي يلزم الشركات المصنعة بتوريد قطع غيار لمنتجاتها لمدة لا تقل عن سبع سنوات.",
      "وقد أثار مشروع القانون هذا نقاشا يتعلق بقضايا مثل جودة قطع غيار الأطراف الثالثة، والضغط على الشركات الصغيرة، والكشف عن المخططات ذات التأثير المحتمل على المنافسة وحقوق الملكية الفكرية.",
      "تتعمق المناقشات في قدرة إصلاح الأجهزة الإلكترونية ، وتوافر الأجزاء الفردية ، ومتانة ومدة السلع التقنية ، مع خطاب ملحوظ حول التقادم المخطط له وتأثيره على حقوق المستهلك ، واعتبارات التكلفة ، والتأثير العام على الشركات والصناعات."
    ],
    "points": 391,
    "commentCount": 270,
    "retryCount": 0,
    "time": 1694688144
  },
  {
    "id": 37509560,
    "title": "Tails هو نظام تشغيل محمول يحمي من المراقبة والرقابة",
    "originLink": "https://tails.net/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37509560",
    "commentBody": "",
    "originSummary": [
      "Tails هو نظام تشغيل محمول مصمم للحماية من المراقبة والرقابة ، باستخدام شبكة Tor للخصوصية عبر الإنترنت ومقاومة الرقابة.",
      "تم تصميم Tails ليتم تثبيته على محرك أقراص USB ، ويوفر بيئة حوسبة آمنة على أي جهاز ، ومجهزة بتطبيقات للتعامل مع المستندات الحساسة والاتصالات الآمنة.",
      "Tails، الذي أقره إدوارد سنودن ومولته منظمات حرية الإنترنت، مبني على دبيان جنو/لينكس. إنه متاح مجانا وغالبا ما يستفيد منه الصحفيون والنشطاء والناجون من العنف المنزلي وغيرهم ممن يحتاجون إلى خصوصية إضافية."
    ],
    "commentSummary": [
      "تركز المناقشة على Tails ، وهو نظام تشغيل يركز على الخصوصية (OS) تم تطويره للحماية من المراقبة والرقابة ، مع ميزات مثل حظر آثار الجلسات السابقة والدفاع ضد البرامج الضارة.",
      "تشير المحادثة أيضا إلى بعض القيود على نظام التشغيل Tails OS ، بما في ذلك خطر تسرب عنوان IP ، مع ذكر بدائل مثل Whinix و Heads و TENS كخيارات تصفح آمنة.",
      "وتشمل الموضوعات الأخرى في الحوار تاريخ الإنترنت ونموه، وموثوقية البرمجيات مفتوحة المصدر، وتمويل المبادرات مفتوحة المصدر."
    ],
    "points": 384,
    "commentCount": 170,
    "retryCount": 0,
    "time": 1694701994
  },
  {
    "id": 37515996,
    "title": "iNaturalist يضرب من تلقاء نفسه",
    "originLink": "https://baynature.org/2023/09/12/inaturalist-strikes-out-on-its-own/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37515996",
    "commentBody": "",
    "originSummary": [
      "أصبحت iNaturalist ، وهي شبكة اجتماعية لقطع الأشجار في التنوع البيولوجي ، كيانا مستقلا غير ربحي ، بمساعدة منحة قدرها 10 ملايين دولار.",
      "تهدف المنحة إلى دعم iNaturalist في مواصلة مهمتها المتمثلة في ربط الناس بالطبيعة وتوليد البيانات البيئية. تأمل المنصة أيضا في زيادة وجودها في المناطق ذات التنوع البيولوجي العالي والوصول المحدود إلى خدماتها.",
      "تخطط iNaturalist أيضا لدمج الذكاء الاصطناعي للتنبؤ بتوزيعات الأنواع وتسعى إلى التعاون مع المنظمات الشريكة السابقة."
    ],
    "commentSummary": [
      "تجاوز تطبيق iNaturalist ، الذي يستخدم نموذج TensorFlow Lite ، 50 مليون ملاحظة ، مما ساعد هواة الطبيعة في تحديد النباتات والحيوانات.",
      "على الرغم من أوجه القصور مثل عدم التوازن الطبقي وارتباك الكائن في الصور ، فإن التطبيق يعزز دقته من خلال التحقق من المستخدم وإدراج المقدمات الجغرافية.",
      "تشير التحسينات المستقبلية إلى إمكانية توظيف تقنيات الكاميرا المحسنة وتوافر التطبيقات عبر منصات مختلفة."
    ],
    "points": 338,
    "commentCount": 60,
    "retryCount": 0,
    "time": 1694732836
  },
  {
    "id": 37512888,
    "title": "في مستودع Git ، أين تعيش ملفاتك؟",
    "originLink": "https://jvns.ca/blog/2023/09/14/in-a-git-repository--where-do-your-files-live-/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37512888",
    "commentBody": "",
    "originSummary": [
      "يخزن Git الملفات ككائنات مميزة في دليل .git/objects داخل مستودع ، باستخدام التخزين العنونة بالمحتوى ، حيث تكون أسماء الملفات هي تجزئة محتوى الملف.",
      "لا يقوم Git بتخزين الاختلافات للإصدارات الفردية ؛ يتم حفظ كل إصدار كملف كامل. لتحديد الإصدارات القديمة ، يمكن للمرء استخدام \"git log\" للعثور على معرفات الالتزام المرتبطة بتغييرات الملف.",
      "يقوم Git بضغط الكائنات باستخدام تنسيق zlib. يقدم المؤلف مثالا عمليا لاسترداد إصدار أقدم من منشور مدونة باستخدام Git ، مصحوبا بمقتطفات الشفرة."
    ],
    "commentSummary": [
      "توفر المقالة نظرة عامة شاملة على Git ، تغطي وظائفه الفريدة ، وطرق استكشاف الأخطاء وإصلاحها ، والأعمال الداخلية ، واستخدام الرسم البياني الدوري الموجه (DAG) لتتبع التغييرات.",
      "يتم استكشاف الانتقادات الموجهة لواجهة مستخدم Git جنبا إلى جنب مع التحسينات المحتملة ، على الرغم من الحجج التي تدعم مرونتها واتساقها في مجال أنظمة التحكم في الإصدار.",
      "يناقش المقال أيضا تعقيد Git وقابليته للاستخدام ، ويقارن شعبيته بالخيارات الأخرى ، ويحدد إمكانات الابتكار والتوسع في المستقبل."
    ],
    "points": 331,
    "commentCount": 88,
    "retryCount": 0,
    "time": 1694716454
  },
  {
    "id": 37516542,
    "title": "صندوق غودو للتنمية",
    "originLink": "https://fund.godotengine.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37516542",
    "commentBody": "",
    "originSummary": [
      "صندوق تطوير Godot هو برنامج يمكن الأفراد والشركات من المساعدة ماليا في تطوير محرك لعبة Godot من خلال المساهمة بمبالغ متفاوتة لكل مستويات العضوية التي يختارونها.",
      "تتم إدارة الأموال من قبل مؤسسة Godot وتستخدم لأغراض مثل توظيف المطورين وإنشاء الأعمال الفنية والحصول على الأجهزة وتغطية التكاليف الأخرى المتعلقة بالمشروع.",
      "Godot هو جزء من Software Freedom Conservancy ، ويستضيف موقع الويب الخاص به TuxFamily.org ، مما يضيف طبقة من الشرعية لهذا المشروع مفتوح المصدر."
    ],
    "commentSummary": [
      "صندوق غودو للتنمية هو موضوع المناقشة في منشور Hacker News ، ولكن تم نقل التعليقات ذات الصلة إلى موقع آخر.",
      "تم الإعلان عن فتح باب التقديم لدفعة شتاء 2024 من Y Combinator (YC).",
      "يوفر المنشور روابط للعديد من الموارد مثل إرشادات التطبيق والأسئلة الشائعة وواجهات برمجة التطبيقات والأمان والمعلومات القانونية وتفاصيل حول كيفية التقديم والتواصل مع YC."
    ],
    "points": 291,
    "commentCount": 1,
    "retryCount": 0,
    "time": 1694736744
  },
  {
    "id": 37509624,
    "title": "طلب من موظفي Google تجنب كلمات مثل \"مشاركة\" و \"حزمة\" ، كما تقول الولايات المتحدة",
    "originLink": "https://www.bloomberg.com/news/newsletters/2023-09-14/googlers-told-to-avoid-words-like-share-and-bundle-us-says-lmj27bhl",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37509624",
    "commentBody": "",
    "originSummary": [
      "صدرت تعليمات لموظفي Google أو \"موظفي Google\" بالامتناع عن استخدام كلمات وعبارات معينة يحتمل أن تنطوي على سلوك مانع للمنافسة ، وفقا للمستندات المقدمة في محاكمة جارية.",
      "هذه التعليمات هي جزء من قضية أكبر حيث يتم اتهام Google بالحفاظ على احتكار سوق البحث عبر الإنترنت. ومع ذلك ، تنفي Google هذه المزاعم.",
      "تكشف الوثائق أيضا أنه يتم تشجيع الموظفين على إيقاف الدردشات الحساسة مع إيقاف تاريخهم وتجنب عبارات مثل \"قطع إمدادات الهواء\" و \"حصتهم في السوق\"."
    ],
    "commentSummary": [
      "تركز المناقشة على Google وقضايا مكافحة الاحتكار الخاصة بها ، مع التأكيد على أهمية اللغة في المسائل القانونية وإساءة الاستخدام المحتملة للسلطة الاحتكارية.",
      "تشمل الموضوعات تعليمات Google لموظفيها بتجاوز كلمات معينة ومحادثة حول امتياز المحامي والعميل ، مما يدل على تعقيد الجوانب القانونية في صناعة التكنولوجيا.",
      "موضوع آخر يتم تناوله هو دور Google المهيمن في صناعة البرمجيات ، ومناقشة عوامل مثل جودة وتسعير منتجاتها وتأثيرها على المنافسة."
    ],
    "points": 261,
    "commentCount": 322,
    "retryCount": 0,
    "time": 1694702304
  },
  {
    "id": 37509533,
    "title": "لذلك قررت الانتقال من Unity إلى Unreal Engine",
    "originLink": "https://impromptugames.com/movingtounreal.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37509533",
    "commentBody": "",
    "originSummary": [
      "يقدم هذا الملخص إرشادات وموارد للمساعدة في الانتقال من Unity إلى Unreal Engine، مع التأكيد على أهمية فهم الوثائق، والانضمام إلى المجتمعات ذات الصلة، واستخدام الموارد التعليمية مثل مكتبة Epic Online Learning.",
      "يعالج المخاوف المتعلقة بهياكل الدفع ودعم النظام الأساسي ويؤكد على فوائد Unreal مثل التنوع والسوق الواسعة وأنظمة الإدخال الفعالة والتوافق مع كل من تطوير ألعاب 2D و 3D.",
      "يذكر المقال استخدام Unreal Engine في الألعاب الشعبية ، وتحسينات أدوات تصميم المستوى ، ويلاحظ جدوى تطوير الألعاب على منصات Linux و Mac."
    ],
    "commentSummary": [
      "تركز المناقشات بشكل أساسي على الموضوعات المتعلقة بمحركات الألعاب ، ولا سيما الانتقال من Unity إلى Unreal Engine وتطبيق \"المخططات\" داخل Unreal.",
      "تشمل نقاط الاهتمام الأخرى مخاوف بشأن التحكم في الإصدار ودمج التغييرات عند استخدام Blueprints وأدائها وقيودها مقارنة ب C ++ ، والمقارنات مع محركات الألعاب الأخرى مثل Godot.",
      "وتشمل الموضوعات الأخرى التي تمت مناقشتها توليد الإيرادات من قبل شركات محركات الألعاب، وتحولات السياسة والتسعير من قبل الوحدة، والتهديدات الموجهة إلى المديرين، والحد من استخدام تويتر."
    ],
    "points": 261,
    "commentCount": 138,
    "retryCount": 0,
    "time": 1694701840
  },
  {
    "id": 37517329,
    "title": "الكود الخطي أكثر قابلية للقراءة",
    "originLink": "https://blog.separateconcerns.com/2023-09-11-linear-code.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37517329",
    "commentBody": "",
    "originSummary": [
      "يدافع المؤلف ضد تجريد الكود من أجل سهولة القراءة ، معتبرا أن الكود الخطي أكثر قابلية للفهم في جوهره.",
      "يثبت الكاتب موقفهم من خلال تقديم مثال على وظيفة تنتقد استخدام التجريد في الكود.",
      "يعالجون مشكلة رمز محتملة تتضمن جهازا ، ويوصون بأن الكود يجب أن يعامل الفرن كمعلمة ، مما يعزز فكرة أنه لا ينبغي استخراج الوظائف الصغيرة من الكود الخطي."
    ],
    "commentSummary": [
      "الموضوع الرئيسي للمناقشة هو قابلية قراءة الكود وصيانته مع آراء متباينة تعزز وظائف خطية أكبر ووظائف معيارية أصغر.",
      "يؤكد الخطاب على أهمية كتابة التعليمات البرمجية مع وضع قابلية قراءة المطورين الآخرين في الاعتبار وتحقيق التوازن من خلال الاستخدام الدقيق للتجريد.",
      "ويشدد على أهمية مراعاة المتطلبات المحددة لقاعدة الشفرة مع تحديد الأولويات بين قابلية القراءة والكفاءة. كما يتم فحص وجهات نظر مختلفة حول بنية الكود والاختبار وقابلية التوسع."
    ],
    "points": 242,
    "commentCount": 208,
    "retryCount": 0,
    "time": 1694743384
  },
  {
    "id": 37515645,
    "title": "مخترع لغة البرمجة أم قاتل متسلسل؟ (2003)",
    "originLink": "https://vole.wtf/coder-serial-killer-quiz/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37515645",
    "commentBody": "",
    "originSummary": [
      "يشير النص إلى مفهوم اللعبة حيث يتمثل التحدي في التمييز بين مخترع لغة البرمجة والقاتل المتسلسل.",
      "قد تتضمن هذه اللعبة فحص اهتمامات الأفراد ، والتي قد تتضمن موضوعات مثل القرصنة والقتل.",
      "المنشور فريد من نوعه في اقتراحه للجمع بين التكنولوجيا والجريمة الحقيقية في تنسيق تفاعلي."
    ],
    "commentSummary": [
      "يغطي المقال لعبة تتضمن تخمين ما إذا كان الشخص الموجود في الصورة قاتلا متسلسلا أو مطورا للغات البرمجة.",
      "هناك نقاش داخل موضوع المناقشة حول صحة ربط ملامح الوجه بطبيعة شخص ما ، إلى جانب الصور النمطية المرتبطة بالمبرمجين والقتلة المتسلسلين.",
      "حصلت اللعبة على ردود فعل متباينة ، حيث استمتع بها بعض المشاركين بينما أعرب آخرون عن مخاوفهم بشأن التمييز المحتمل وفوجئوا ببعض الاستثناءات."
    ],
    "points": 239,
    "commentCount": 107,
    "retryCount": 0,
    "time": 1694730488
  },
  {
    "id": 37511036,
    "title": "المعرفة العلمية المتوسطة المرتبطة بالثقة المفرطة والمواقف السلبية",
    "originLink": "https://www.nature.com/articles/s41562-023-01677-8",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37511036",
    "commentBody": "",
    "originSummary": [
      "تكتشف الدراسة وجود صلة بين المعرفة العلمية والثقة بالنفس والمواقف تجاه العلم ، مشيرة على وجه التحديد إلى الثقة المفرطة والتحيز السلبي لدى الأفراد ذوي المعرفة العلمية متوسطة المستوى.",
      "تشكك النتائج في النماذج الحالية وتسلط الضوء على ضرورة معالجة هذه الثقة المفرطة وتشجيع فهم أكثر تعمقا للعلوم.",
      "يقدم المقال أيضا تفاصيل حول المنشور الأكاديمي وناشره."
    ],
    "commentSummary": [
      "تركز المناقشة على فهم حدود العلم ، والتحديات في تعريفه ، ومخاطر وضع الكثير من الثقة في الادعاءات العلمية.",
      "ويسلط الضوء على كيفية تأثير الثقة المفرطة على مختلف المجالات وكيف تشكل وسائل الإعلام والسياسة تصور الجمهور للعلوم.",
      "يتم التركيز على ضرورة التواضع والتفكير النقدي والاعتراف بعدم اليقين في الفهم العلمي لمواجهة الثقة المفرطة وإنكار العلم."
    ],
    "points": 239,
    "commentCount": 194,
    "retryCount": 0,
    "time": 1694708692
  },
  {
    "id": 37509427,
    "title": "الاكتتاب العام ينطلق اليوم",
    "originLink": "https://www.theregister.com/2023/09/14/arm_ipo/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37509427",
    "commentBody": "",
    "originSummary": [
      "بدأت شركة Arm ، وهي شركة بريطانية لتصميم الرقائق ، الاكتتاب العام بسعر سهم يبلغ 51 دولارا لكل سهم ، مما يحدد تقييم الشركة بمبلغ 54.5 مليار دولار.",
      "ومن المقرر أن يولد الاكتتاب العام حوالي 4.9 مليار دولار لشركة Softbank ، الشركة الأم لشركة Arm ، وبعد الاكتتاب العام ، ستستمر Arm كشركة تابعة ل Softbank.",
      "حصل الاكتتاب العام على موافقة واسعة النطاق ، حيث جذب استثمارات من شركات التكنولوجيا ذات الوزن الثقيل مثل Apple و Samsung و Intel ، ولكن سيتم إدراجه فقط في الولايات المتحدة ، بعد تبديد الآمال في الإدراج المزدوج في لندن في وقت سابق من هذا العام."
    ],
    "commentSummary": [
      "بدأ الاكتتاب العام الأولي لشركة ARM (IPO) ، مع تكهنات تشير إلى أن الزيادة المحتملة في الأسعار قد تدفع العملاء نحو بنية RISC-V مفتوحة المصدر.",
      "والمناقشات جارية بشأن إمكانية الانتقال من ARM إلى RISC-V، مع مراعاة توافق البرمجيات وقابلية التشغيل البيني للأجهزة.",
      "يتمتع الاكتتاب العام بموقع استراتيجي للحفاظ على نجاح ARM ، حيث تبيع SoftBank حصة 21٪. من المحتمل أن يدعم عمالقة التكنولوجيا مثل Apple و Google و Nvidia الاكتتاب العام لمنع الاستحواذ العدائي."
    ],
    "points": 235,
    "commentCount": 155,
    "retryCount": 0,
    "time": 1694701076
  },
  {
    "id": 37510885,
    "title": "عادت لوحة فان جوخ المسروقة في حقيبة ايكيا",
    "originLink": "https://www.smithsonianmag.com/smart-news/dutch-art-detective-recovers-a-van-gogh-stolen-in-2020-180982896/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37510885",
    "commentBody": "",
    "originSummary": [
      "تم استرداد عمل مبكر لفنسنت فان جوخ ، حديقة القسيس في نوينين في الربيع ، بعد ثلاث سنوات ونصف من السرقة من متحف هولندي.",
      "وأعيدت اللوحة، التي تتراوح قيمتها بين 3.2 و6.4 مليون دولار، دون الكشف عن هويتها في حقيبة إيكيا إلى المحقق الفني آرثر براند دون أي إشارة إلى أن العائد في السرقة.",
      "تم القبض على اللص الأصلي في عام 2021 وحكم عليه بالسجن ثماني سنوات. سيتم عرض العمل الفني المستعاد مرة أخرى بعد الفحص والترميم اللازمين."
    ],
    "commentSummary": [
      "تم استرداد لوحة فان جوخ المسروقة وإعادتها في حقيبة ايكيا ، تم تسهيلها من خلال شبكة تحت الأرض يديرها المحقق الفني آرثر براند.",
      "هذه اللوحة ، التي سرقت في عام 2002 ، كانت متداولة في عالم الجريمة الإجرامي وتوضح إعادتها القضايا القانونية المتعلقة بحيازة الأعمال الفنية المسروقة.",
      "كما تمت مناقشة موضوعات حول الحفاظ على اللوحات وترميم الفن وتوصيات للكتب والمسلسلات المتعلقة بروايات سرقة الفن."
    ],
    "points": 228,
    "commentCount": 76,
    "retryCount": 0,
    "time": 1694708140
  },
  {
    "id": 37507419,
    "title": "Nue - بديل رد فعل / فيو / فيت / أسترو",
    "originLink": "https://nuejs.org",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37507419",
    "commentBody": "",
    "originSummary": [
      "طور المؤلف Nue JS ، وهي مكتبة جافا سكريبت لبناء واجهات المستخدم ، متأثرة ب Vue 2.0 و Riot.js.",
      "هناك نظام بيئي قيد العمل لاستكمال Nue JS ، المصمم ليكون بديلا لأدوات مثل Vite و Next.js و Astro. الهدف هو التأكيد على التحسين التدريجي ، وفصل الاهتمامات ، وتصميم الويب الدلالي.",
      "سيتم إصدار جميع المنتجات تحت العلامة التجارية Nue بموجب ترخيص معهد ماساتشوستس للتكنولوجيا ، مما يؤكد التزام المؤلف بالأدوات مفتوحة المصدر."
    ],
    "commentSummary": [
      "يعلن المقال عن إطلاق Nue JS ، وهو بديل خفيف الوزن لأطر الواجهة الأمامية الشهيرة ، ويناقش التوسعات المحتملة للمشاريع ذات الصلة.",
      "يعرض النقاش حول قضايا تغليف تطوير الواجهة الأمامية ويوفر ملاحظات المستخدمين أثناء إجراء مقارنات مع أطر أخرى مماثلة.",
      "يستكشف المنشور أيضا مشاعر الجمهور المختلفة تجاه Nue JS ويجلب إلى المحادثة التأثير المحتمل للذكاء الاصطناعي على معايير الترميز."
    ],
    "points": 207,
    "commentCount": 151,
    "retryCount": 0,
    "time": 1694689877
  },
  {
    "id": 37513030,
    "title": "جهاز ذكي \"الحركة الدائمة\" [فيديو]",
    "originLink": "https://www.youtube.com/watch?v=r_LG8FDt51U",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37513030",
    "commentBody": "",
    "originSummary": [
      "يتضمن الفيديو عرضا لجهاز \"الحركة الدائمة\" الذي يعمل بشكل أساسي كمحاكي للحركة الدائمة ، باستخدام مغناطيسات كهربائية ومستشعر القرب الاستقرائي للحفاظ على الكرة في حركة ثابتة.",
      "يقدم المنشئ عرضا شاملا لوظائف الجهاز ويمشي عبر مكوناته المختلفة ، مثل المكثفات والمعلمات القابلة للتعديل.",
      "تتم مناقشة مفهوم الحركة الدائمة خلال الفيديو ، متشابكا مع جوانب تشغيل الجهاز. تم ذكر الراعي ، Incogni ، كخدمة تساعد في حماية البيانات الشخصية ومنع المكالمات الهاتفية غير المرغوب فيها."
    ],
    "commentSummary": [
      "يظهر الفيديو المميز جهاز \"الحركة الدائمة\" ، مما يثير مناقشات حول التحسينات المحتملة ، مثل القضبان البلاستيكية ، والمتحكمات الدقيقة ، والعجلات الآلية ، ومصادر الطاقة الجديدة.",
      "تغطي المحادثات أيضا موضوعات فلسفية وعلمية ، مثل طبيعة الواقع ، ودور العلم ، والحفاظ على الطاقة ، وتعريف الطاقة في سياق الزمكان المنحني.",
      "كما أن الشكوك حول المادة المظلمة ونظريات الطاقة ومصداقية بعض الحجج سائدة أيضا بين المناقشات. ينتهي المقال بذكر تطبيقات YC Winter 2024."
    ],
    "points": 205,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1694717042
  }
]
