[
  {
    "id": 38602575,
    "title": "La aplicación Beeper Mini soluciona un problema de mensajería, ofrece acceso gratuito y desafía a Apple en materia de seguridad",
    "originLink": "https://blog.beeper.com/p/beeper-mini-is-back",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38602575",
    "commentBody": "",
    "originSummary": [
      "Beeper Mini, una aplicación de chat que permite la comunicación entre usuarios de Android y iPhone, se enfrentaba a un problema de mensajería que ya ha sido resuelto con una actualización publicada.",
      "El registro de números de teléfono no está disponible actualmente, y los usuarios deben iniciar sesión con un AppleID. Los mensajes se enviarán y recibirán a través del correo electrónico en lugar de los números de teléfono.",
      "A pesar de que el problema ha provocado una caída en el ranking de la aplicación, Beeper está trabajando diligentemente para estabilizar la aplicación y la ofrece de forma gratuita. Los cofundadores de Beeper creen que la aplicación mejora la seguridad y la privacidad de los usuarios de Android y iPhone y están dispuestos a compartir su código base con una empresa de investigación de seguridad de terceros para su validación."
    ],
    "commentSummary": [],
    "points": 952,
    "commentCount": 1157,
    "retryCount": 0,
    "time": 1702315814
  },
  {
    "id": 38607424,
    "title": "Epic Games gana el juicio contra Google por crear un monopolio ilegal en la App Store",
    "originLink": "https://www.theverge.com/23945184/epic-v-google-fortnite-play-store-antitrust-trial-updates#stream-entry-65d34a06-1fa5-4eab-abf6-ce450441b543",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38607424",
    "commentBody": "",
    "originSummary": [
      "El jurado ha fallado a favor de Epic Games en la demanda contra Google, afirmando que Google ha creado un monopolio ilegal con su tienda de aplicaciones y su servicio de facturación.",
      "Google tiene previsto recurrir el veredicto, impugnando la decisión.",
      "Epic Games presentó documentos internos durante el juicio para respaldar su denuncia de comportamiento anticompetitivo de Google, mientras que Google defendió su método de cobro de tasas y destacó la competencia con Apple."
    ],
    "commentSummary": [],
    "points": 815,
    "commentCount": 680,
    "retryCount": 0,
    "time": 1702340467
  },
  {
    "id": 38605525,
    "title": "El proyecto de \"reforma\" de la FISA amplía el alcance de la vigilancia a más entidades",
    "originLink": "https://www.zwillgen.com/law-enforcement/fisa-reform-bill-702-surveillance/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38605525",
    "commentBody": "",
    "originSummary": [
      "El Comité Permanente Selecto de Inteligencia de la Cámara de Representantes ha aprobado la Ley de Reforma y Reautorización de la FISA de 2023, que ampliaría la autorización de la Sección 702 de la Ley de Vigilancia de Inteligencia Extranjera (FISA 702).",
      "El proyecto de ley incluye una disposición que ampliaría la autoridad del gobierno en virtud de FISA 702 mediante la ampliación de la definición de \"proveedores de servicios de comunicación electrónica\" (ECSP) que pueden ser obligados a ayudar en la vigilancia.",
      "De aprobarse, estos cambios aumentarían significativamente el número de empresas y entidades obligadas a colaborar en la vigilancia FISA 702."
    ],
    "commentSummary": [],
    "points": 260,
    "commentCount": 47,
    "retryCount": 0,
    "time": 1702329003
  },
  {
    "id": 38605643,
    "title": "Las autoridades de Portland proponen prohibir el consumo público de drogas para reactivar la ciudad",
    "originLink": "https://www.nytimes.com/2023/12/11/us/portland-oregon-drug-laws.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38605643",
    "commentBody": "",
    "originSummary": [
      "Las autoridades estatales y municipales de Portland (Oregón) están estudiando la posibilidad de derogar parte de la ley estatal de despenalización de las drogas para hacer frente al aumento de las sobredosis y al éxodo empresarial de la ciudad.",
      "El plan incluye la prohibición del consumo público de drogas y el aumento de las medidas policiales para mejorar la seguridad.",
      "Además de los cambios propuestos en la política de drogas, un grupo de trabajo dirigido por el gobernador ha propuesto desgravaciones fiscales para las empresas y mayores servicios para los residentes sin hogar. Sin embargo, los defensores de la reforma de la política de drogas han expresado su preocupación por las posibles consecuencias de criminalizar el consumo de drogas."
    ],
    "commentSummary": [
      "El debate profundiza en las cuestiones de la drogadicción, la falta de vivienda y los retos específicos a los que se enfrentan ciudades como Portland y Seattle a la hora de abordar estos problemas.",
      "Hay desacuerdo sobre la eficacia de las estrategias actuales, con especial atención a las deficiencias de la Medida 110 en Oregón, y se plantean soluciones alternativas como proporcionar alojamiento gratuito y aplicar una regulación de las drogas.",
      "El impacto del consumo de drogas en los espacios públicos, la complejidad de la prestación de servicios integrales de apoyo y la importancia de una gestión eficaz y de la rendición de cuentas en la utilización de los fondos son puntos clave de debate."
    ],
    "points": 248,
    "commentCount": 645,
    "retryCount": 0,
    "time": 1702329677
  },
  {
    "id": 38599270,
    "title": "Calculadora Inteligente Tohands: Seguimiento de ventas y gastos fácilmente",
    "originLink": "https://smart.tohands.in/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38599270",
    "commentBody": "",
    "originSummary": [
      "Tohands Smart Calculator es una calculadora fácil de usar y eficiente diseñada específicamente para que los comerciantes gestionen sus ventas y gastos.",
      "Ofrece informes y análisis diarios, semanales y mensuales para ayudar a los comerciantes a seguir el rendimiento de su negocio.",
      "Actualmente, los pedidos no están disponibles debido a la gran demanda, pero los clientes pueden apuntarse a una lista de espera para que se les avise cuando la calculadora vuelva a estar disponible.",
      "La calculadora cuenta con una gran pantalla, funciona sin conexión y tiene una memoria integrada para almacenar hasta 40 lakh de transacciones.",
      "Es una alternativa asequible a las máquinas de facturación tradicionales y tiene un año de garantía.",
      "Destacada en varias publicaciones, la calculadora inteligente Tohands se enorgullece de ser un producto Made in India."
    ],
    "commentSummary": [],
    "points": 234,
    "commentCount": 81,
    "retryCount": 0,
    "time": 1702290423
  },
  {
    "id": 38607474,
    "title": "Un jurado falla a favor de Epic Games y declara monopolio la tienda de aplicaciones de Google",
    "originLink": "https://www.theverge.com/23994174/epic-google-trial-jury-verdict-monopoly-google-play",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38607474",
    "commentBody": "",
    "originSummary": [
      "El jurado ha fallado a favor de Epic Games en el juicio contra Google por supuestos monopolios en las tiendas de aplicaciones.",
      "La sentencia establece que la tienda Google Play y el servicio de facturación Google Play de Google constituían un monopolio ilegal y que Google incurrió en un comportamiento anticompetitivo.",
      "El juez James Donato determinará las soluciones específicas y los posibles daños monetarios para Epic Games en enero, y ambas partes se reunirán para discutir las posibles soluciones."
    ],
    "commentSummary": [
      "Un jurado ha declarado a Google culpable de monopolio ilegal en la batalla de las tiendas de aplicaciones.",
      "La sentencia sugiere que las prácticas de Google en la gestión de su tienda de aplicaciones han violado las leyes antimonopolio.",
      "Esta decisión pone de relieve el continuo escrutinio y los desafíos legales a los que se enfrentan las grandes empresas tecnológicas por su dominio en diversos mercados."
    ],
    "points": 225,
    "commentCount": 2,
    "retryCount": 0,
    "time": 1702340734
  },
  {
    "id": 38603207,
    "title": "GigaGPT: Entrenamiento de modelos de tamaño GPT-2 con hardware Cerebras",
    "originLink": "https://www.cerebras.net/blog/introducing-gigagpt-gpt-3-sized-models-in-565-lines-of-code",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38603207",
    "commentBody": "",
    "originSummary": [
      "GigaGPT es la implementación de Cerebras del código base nanoGPT de Andrei Karpathy para el entrenamiento de modelos GPT a gran escala.",
      "Puede manejar modelos con más de 100.000 millones de parámetros utilizando el hardware Cerebras sin código ni marcos adicionales.",
      "GigaGPT se basa en la arquitectura GPT-2 y se ha probado con éxito con modelos de entre 111 millones y 175.000 millones de parámetros."
    ],
    "commentSummary": [
      "El debate explora múltiples aspectos de los modelos y el hardware de aprendizaje automático, incluido el desarrollo de métodos eficientes de entrenamiento a gran escala y el posible paso a arquitecturas más sencillas.",
      "El aumento de la potencia de cálculo se considera beneficioso, pero preocupa la falta de información sobre el rendimiento de algunos chips.",
      "Los distintos modelos de lenguaje y marcos ofrecen capacidades y flexibilidad variables, lo que da lugar a debates sobre la eficacia y sencillez de las distintas implementaciones. La importancia del número de líneas de código de un proyecto también es objeto de opiniones divergentes. En última instancia, no hay consenso sobre la importancia del proyecto debatido."
    ],
    "points": 218,
    "commentCount": 65,
    "retryCount": 0,
    "time": 1702318408
  },
  {
    "id": 38601960,
    "title": "La mala ciencia y las estadísticas en los tribunales conducen a condenas erróneas",
    "originLink": "https://www.scientificamerican.com/article/bad-science-and-bad-statistics-in-the-courtroom-convict-innocent-people/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38601960",
    "commentBody": "",
    "originSummary": [
      "El uso de datos científicos y estadísticos erróneos en los tribunales puede conducir a la condena injusta de personas inocentes.",
      "Los jurados y los jueces carecen a menudo de los conocimientos necesarios para evaluar correctamente las pruebas científicas, lo que da lugar a testimonios periciales erróneos.",
      "Las técnicas forenses engañosas y las prácticas pseudocientíficas contribuyen a condenas infundadas, lo que pone de relieve la necesidad de mejorar la educación sobre pruebas científicas y estadísticas en los tribunales."
    ],
    "commentSummary": [
      "El artículo y los debates arrojan luz sobre numerosos fallos del sistema de justicia penal que contribuyen a condenas erróneas y resultados injustos.",
      "Entre los temas debatidos figuran los errores científicos y estadísticos, la parcialidad de los peritos, la inadecuada representación legal y las injusticias sistémicas.",
      "También se abordan las preocupaciones relativas al uso de la tecnología y las pruebas, el impacto de las leyes sobre drogas y la dificultad de demostrar la inocencia.",
      "Entre las sugerencias de mejora figuran el aumento de los recursos, la transparencia, la rendición de cuentas y la eliminación de los prejuicios dentro del sistema."
    ],
    "points": 195,
    "commentCount": 190,
    "retryCount": 0,
    "time": 1702311962
  },
  {
    "id": 38601435,
    "title": "Repensar la función Deshacer: mejorar la experiencia de usuario del editor de texto",
    "originLink": "https://cdacamar.github.io/data%20structures/algorithms/benchmarking/text%20editors/c++/rethinking-undo/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38601435",
    "commentBody": "",
    "originSummary": [
      "El artículo explora el concepto de deshacer y rehacer en editores de texto y diferentes enfoques de implementación.",
      "El autor propone una estructura de datos y una estrategia de visualización para gestionar las operaciones de deshacer/rehacer con el fin de mejorar la experiencia del usuario.",
      "También se destacan las ventajas de utilizar estructuras de datos inmutables y de comprender el algoritmo diff, lo que sugiere que el enfoque propuesto puede ser más eficiente que el modelo lineal tradicional de deshacer/rehacer."
    ],
    "commentSummary": [
      "El debate explora la importancia de la configuración del usuario en la funcionalidad de deshacer/rehacer en los editores de texto.",
      "Examina el comportamiento de los comandos deshacer/rehacer en distintos editores y los retos de la edición modal.",
      "También se discute la implementación de sistemas de deshacer/rehacer en varias aplicaciones, junto con los beneficios de la función de deshacer en región de Emacs y el uso de estructuras de datos persistentes."
    ],
    "points": 192,
    "commentCount": 63,
    "retryCount": 0,
    "time": 1702308462
  },
  {
    "id": 38607071,
    "title": "El proyecto de ley de vigilancia del Comité de Inteligencia de la Cámara de Representantes permite la vigilancia masiva durante ocho años",
    "originLink": "https://www.eff.org/deeplinks/2023/12/section-702-needs-reform-and-oversight-not-expansion-congress-should-oppose-hpsci",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38607071",
    "commentBody": "",
    "originSummary": [
      "El Comité Judicial de la Cámara de Representantes y el Comité Permanente Selecto de Inteligencia de la Cámara de Representantes han propuesto diferentes proyectos de ley para reautorizar la Sección 702 de la Ley de Vigilancia de Inteligencia Extranjera (FISA).",
      "El proyecto de ley del Comité Judicial, H.R. 6570, aborda las preocupaciones sobre las búsquedas por la puerta trasera sin orden judicial y la compra de datos de estadounidenses sin orden judicial. Propone renovar la autoridad durante tres años más.",
      "El proyecto de ley del Comité de Inteligencia, H.R. 6611, renueva la autoridad de vigilancia masiva durante ocho años, permite la recopilación de comunicaciones de personas estadounidenses sin orden judicial y amplía la vigilancia para investigar a los solicitantes de asilo y a una gama más amplia de proveedores en línea. La Electronic Frontier Foundation (EFF) insta a apoyar el proyecto de ley del Comité Judicial frente al del Comité de Inteligencia."
    ],
    "commentSummary": [
      "El proyecto de ley de \"reforma\" de la vigilancia del Comité de Inteligencia de la Cámara de Representantes se enfrenta a críticas por ser una farsa.",
      "Un artículo de Hacker News cuestiona la capacidad del proyecto de ley para abordar realmente los problemas de la vigilancia.",
      "Se plantean dudas sobre la eficacia del proyecto de ley a la hora de abordar los problemas de vigilancia."
    ],
    "points": 190,
    "commentCount": 1,
    "retryCount": 0,
    "time": 1702338329
  },
  {
    "id": 38602750,
    "title": "Transpilación de WebAssembly a C: una alternativa sin tiempo de ejecución",
    "originLink": "https://00f.net/2023/12/11/webassembly-compilation-to-c/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38602750",
    "commentBody": "",
    "originSummary": [
      "El artículo analiza un enfoque alternativo para compilar código WebAssembly transpilándolo a código fuente C.",
      "Este enfoque permite una depuración mejorada, una integración sencilla con el código C existente y la posibilidad de compilar y ejecutar WebAssembly en nuevas plataformas.",
      "El código C transpilado puede compilarse con un compilador C normal, lo que da lugar a ejecutables más rápidos y pequeños en comparación con los tiempos de ejecución WebAssembly tradicionales.",
      "Sin embargo, existen limitaciones, como la falta de compilación just-in-time y la configuración manual de las páginas de guarda de memoria.",
      "Este enfoque es adecuado para mejorar la seguridad del código y ejecutar WebAssembly en plataformas no compatibles, pero los tiempos de ejecución tradicionales ofrecen más funciones y flexibilidad."
    ],
    "commentSummary": [
      "En los comentarios de esta entrada se debaten diversos temas relacionados con WebAssembly (WASM), como su potencial como tiempo de ejecución para el desarrollo web, problemas de compatibilidad del lenguaje, problemas de seguridad, portabilidad, diferencias de rendimiento en comparación con JavaScript y la necesidad de mejorar las tecnologías web existentes.",
      "Algunos comentarios expresan escepticismo sobre las limitaciones e inconvenientes de WASM, mientras que otros destacan sus ventajas en términos de seguridad, flujo de control y preservación del software.",
      "Los debates muestran una combinación de entusiasmo y cautela respecto al uso de WASM en diferentes aplicaciones y entornos."
    ],
    "points": 182,
    "commentCount": 120,
    "retryCount": 0,
    "time": 1702316666
  },
  {
    "id": 38606146,
    "title": "Expansión de Sentencias SQL con 'RESULTDB': Desbloqueando el Potencial para Devolver una Base de Datos",
    "originLink": "https://arxiv.org/abs/2312.00638",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38606146",
    "commentBody": "",
    "originSummary": [
      "El documento sugiere eliminar la limitación de las sentencias SQL que sólo permiten la devolución de una única tabla.",
      "Los autores proponen ampliar la cláusula SELECT de SQL con una palabra clave \"RESULTDB\" que permita devolver una base de datos de resultados.",
      "Destacan las ventajas de este enfoque, como la simplificación del código de la aplicación, la mejora del rendimiento de las consultas, la reducción del tamaño de los resultados de las consultas y la agilización de los tiempos de transferencia de los resultados de las consultas."
    ],
    "commentSummary": [
      "El documento examina la idea de devolver una base de datos como resultado de una sentencia SQL y explora sus posibles ventajas y retos.",
      "Entre los temas tratados se incluyen el mapeo objeto-relacional, el rendimiento de las consultas, la unión de datos relacionados, las estructuras JSON anidadas y las limitaciones de SQL.",
      "Los participantes destacan ventajas potenciales como la mejora del rendimiento y la simplificación de las consultas complejas, así como la reducción de la carga de la base de datos. También se exploran la terminología, la recuperación jerárquica de datos y la viabilidad de devolver una base de datos como una sentencia SQL."
    ],
    "points": 181,
    "commentCount": 101,
    "retryCount": 0,
    "time": 1702332352
  },
  {
    "id": 38600031,
    "title": "Madera transparente: Un cambio de juego para las pantallas de los smartphones y las ventanas aislantes",
    "originLink": "https://arstechnica.com/science/2023/12/why-scientists-are-making-transparent-wood/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38600031",
    "commentBody": "",
    "originSummary": [
      "Los científicos están creando un material de madera transparente para diversas aplicaciones, como pantallas de teléfonos inteligentes y ventanas aislantes.",
      "La madera se hace transparente eliminando los pigmentos de las células vegetales y puede reforzarse con resina epoxi para aumentar su resistencia.",
      "La madera transparente es más fuerte y resistente que el plástico y el vidrio, por lo que puede ser una alternativa sostenible y duradera para diversos productos."
    ],
    "commentSummary": [
      "La madera transparente es un material creado mediante la sustitución de la lignina de la madera por resina epoxi, y se está debatiendo su desarrollo y posibles aplicaciones.",
      "Entre los temas tratados en los debates figuran los retos de la crianza de los hijos, la eficiencia y sostenibilidad de los materiales de acristalamiento de ventanas, la reciclabilidad e idoneidad de la madera transparente para diversas aplicaciones, las técnicas de locución utilizadas por un YouTuber, los desafíos para aumentar las tasas de reciclado de vidrio en Estados Unidos y las comparaciones con otros materiales como el vidrio y el plástico.",
      "También se mencionan otros materiales, como la poliaramida, y la importancia de utilizar nombres precisos para los nuevos materiales."
    ],
    "points": 167,
    "commentCount": 129,
    "retryCount": 0,
    "time": 1702297860
  },
  {
    "id": 38602786,
    "title": "Preocupación de un abogado estadounidense por los efectos nocivos de las apuestas deportivas y la necesidad de regularlas",
    "originLink": "https://www.ft.com/content/497fdb45-fe81-4b13-97d0-70abe667b94f",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38602786",
    "commentBody": "",
    "originSummary": [
      "El artículo presenta una entrevista con un destacado abogado estadounidense que anteriormente persiguió a la industria tabaquera y ahora está implicado en la cuestión de las apuestas deportivas.",
      "El abogado expresa su preocupación por las posibles repercusiones negativas de la generalización de las apuestas deportivas y subraya la importancia de la normativa para salvaguardar a los consumidores.",
      "También se discute la influencia de la industria del juego en la política y la necesidad de educar al público sobre los riesgos asociados al juego."
    ],
    "commentSummary": [
      "El debate abarca una amplia gama de temas relacionados con la industria del juego, como la preocupación por los aspectos depredadores de las apuestas deportivas y la prohibición de los ganadores constantes.",
      "Otros temas son los pros y los contras de la legalización y la regulación, el impacto en las familias y la sociedad, la moralidad de la publicidad y las comparaciones con otras industrias reguladas.",
      "La conversación también aborda la naturaleza adictiva de los juegos de azar, la regulación de las cajas de botín en los videojuegos, la influencia de la publicidad en el tabaquismo y el vapeo, y la corrupción en el deporte."
    ],
    "points": 166,
    "commentCount": 186,
    "retryCount": 0,
    "time": 1702316767
  }
]
