[
  {
    "id": 38602575,
    "title": "A Beeper Mini alkalmazás javítja az üzenetküldési problémát, ingyenes hozzáférést kínál, és kihívások elé állítja az Apple-t a biztonság terén",
    "originLink": "https://blog.beeper.com/p/beeper-mini-is-back",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38602575",
    "commentBody": "",
    "originSummary": [
      "A Beeper Mini, az Android és iPhone felhasználók közötti kommunikációt lehetővé tevő csevegőalkalmazás egy üzenetküldési problémával szembesült, amely most egy közzétett frissítéssel megoldódott.",
      "A telefonszám regisztráció jelenleg nem érhető el, és a felhasználóknak AppleID-vel kell bejelentkezniük. Az üzenetek küldése és fogadása a telefonszámok helyett e-mailen keresztül történik.",
      "Annak ellenére, hogy a probléma az alkalmazás rangsorának csökkenését okozta, a Beeper szorgalmasan dolgozik az alkalmazás stabilizálásán, és ingyenesen kínálja azt. A Beeper társalapítói úgy vélik, hogy az alkalmazás növeli a biztonságot és az adatvédelmet mind az Android, mind az iPhone felhasználók számára, és hajlandóak megosztani a kódbázisát egy harmadik fél biztonsági kutatócéggel hitelesítés céljából."
    ],
    "commentSummary": [],
    "points": 952,
    "commentCount": 1157,
    "retryCount": 0,
    "time": 1702315814
  },
  {
    "id": 38607424,
    "title": "Az Epic Games pert nyert a Google ellen, jogellenes App Store monopóliumot hozott létre",
    "originLink": "https://www.theverge.com/23945184/epic-v-google-fortnite-play-store-antitrust-trial-updates#stream-entry-65d34a06-1fa5-4eab-abf6-ce450441b543",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38607424",
    "commentBody": "",
    "originSummary": [
      "Az esküdtszék az Epic Games javára döntött a Google elleni perben, mondván, hogy a Google jogellenes monopóliumot hozott létre az alkalmazásboltjával és számlázási szolgáltatásával.",
      "A Google azt tervezi, hogy fellebbez az ítélet ellen, megtámadva a döntést.",
      "Az Epic Games a tárgyalás során belső dokumentumokat mutatott be a Google versenyellenes magatartására vonatkozó állításuk alátámasztására, míg a Google megvédte díjbeszedési módszerét, és kiemelte az Apple-lel való versenyt."
    ],
    "commentSummary": [],
    "points": 815,
    "commentCount": 680,
    "retryCount": 0,
    "time": 1702340467
  },
  {
    "id": 38605525,
    "title": "A FISA \"reform\" törvényjavaslat több szervezetre is kiterjeszti a megfigyelés hatályát",
    "originLink": "https://www.zwillgen.com/law-enforcement/fisa-reform-bill-702-surveillance/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38605525",
    "commentBody": "",
    "originSummary": [
      "A képviselőház hírszerzéssel foglalkozó állandó különbizottsága jóváhagyta a 2023. évi FISA reformjáról és újbóli felhatalmazásáról szóló törvényt, amely meghosszabbítaná a külföldi hírszerzési megfigyelésről szóló törvény 702. szakaszának (FISA 702) engedélyét.",
      "A törvényjavaslat tartalmaz egy olyan rendelkezést, amely kiterjesztené a kormány FISA 702. cikke szerinti hatáskörét azáltal, hogy kiszélesíti az \"elektronikus hírközlési szolgáltatók\" (ECSP-k) fogalmát, amelyek kötelezhetők a megfigyelésben való közreműködésre.",
      "Elfogadása esetén ezek a változtatások jelentősen megnövelnék a FISA 702 szerinti megfigyelésben való közreműködésre kötelezett vállalkozások és szervezetek számát."
    ],
    "commentSummary": [],
    "points": 260,
    "commentCount": 47,
    "retryCount": 0,
    "time": 1702329003
  },
  {
    "id": 38605643,
    "title": "Portland tisztviselői nyilvános droghasználat tilalmát javasolják a város újjáélesztése érdekében",
    "originLink": "https://www.nytimes.com/2023/12/11/us/portland-oregon-drug-laws.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38605643",
    "commentBody": "",
    "originSummary": [
      "Az oregoni Portland állam és a város tisztviselői fontolgatják, hogy visszaveszik az állami drogdekriminalizációs törvény egy részét, hogy kezeljék a növekvő túladagolásokat és a városból való üzleti elvándorlást.",
      "A terv tartalmazza a nyilvános kábítószer-használat tilalmát és a biztonság fokozása érdekében a fokozott rendőri felügyeletet.",
      "A kormányzó által vezetett munkacsoport a javasolt kábítószer-politikai változtatásokon túlmenően adókedvezményeket javasolt a vállalkozásoknak és a hajléktalan lakosoknak nyújtott szolgáltatások növelését. A kábítószer-politikai reform hívei azonban aggodalmuknak adtak hangot a kábítószer-fogyasztás kriminalizálásának lehetséges következményei miatt."
    ],
    "commentSummary": [
      "A beszélgetés a kábítószer-függőség és a hajléktalanság kérdését járja körül, valamint azokat a konkrét kihívásokat, amelyekkel az olyan városok, mint Portland és Seattle szembesülnek e problémák kezelése során.",
      "A jelenlegi stratégiák hatékonyságát illetően nézeteltérések vannak, különös tekintettel az oregoni 110-es intézkedés hiányosságaira, és olyan alternatív megoldásokat is megvizsgálnak, mint az ingyenes lakhatás biztosítása és a kábítószer-szabályozás bevezetése.",
      "A kábítószer-használat hatása a közterületekre, az átfogó támogató szolgáltatások nyújtásának összetettsége, valamint a hatékony gazdálkodás és elszámoltathatóság fontossága a pénzeszközök felhasználása során mind-mind kulcsfontosságú vitapontok."
    ],
    "points": 248,
    "commentCount": 645,
    "retryCount": 0,
    "time": 1702329677
  },
  {
    "id": 38599270,
    "title": "Tohands Smart Calculator: Nyomon követni az eladásokat és a kiadásokat egyszerűen",
    "originLink": "https://smart.tohands.in/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38599270",
    "commentBody": "",
    "originSummary": [
      "A Tohands Smart Calculator egy felhasználóbarát és hatékony számológép, amelyet kifejezetten boltosok számára terveztek, hogy kezeljék eladásaikat és kiadásaikat.",
      "Napi, heti és havi jelentéseket és elemzéseket kínál, amelyek segítségével a boltosok nyomon követhetik üzleti teljesítményüket.",
      "Jelenleg a megrendelések a nagy kereslet miatt nem állnak rendelkezésre, de az ügyfelek várólistára kerülhetnek, hogy értesítést kapjanak, ha a számológép ismét elérhetővé válik.",
      "A számológép nagy kijelzővel rendelkezik, offline működik, és beépített memóriája akár 40 lakh tranzakció tárolására is alkalmas.",
      "Megfizethető alternatívája a hagyományos számlázógépeknek, és 1 év garanciával rendelkezik.",
      "A számos kiadványban bemutatott Tohands Smart Calculator büszke arra, hogy Made in India termék."
    ],
    "commentSummary": [],
    "points": 234,
    "commentCount": 81,
    "retryCount": 0,
    "time": 1702290423
  },
  {
    "id": 38607474,
    "title": "Az esküdtszék az Epic Games javára döntött, monopóliumnak nyilvánította a Google alkalmazásboltját",
    "originLink": "https://www.theverge.com/23994174/epic-google-trial-jury-verdict-monopoly-google-play",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38607474",
    "commentBody": "",
    "originSummary": [
      "Az esküdtszék az Epic Games javára döntött a Google ellen az állítólagos alkalmazásbolt-monopóliumok miatt indított perben.",
      "Az ítélet szerint a Google Google Play áruház és a Google Play számlázási szolgáltatása jogellenes monopóliumot alkotott, és a Google versenyellenes magatartást tanúsított.",
      "James Donato bíró januárban határozza meg az Epic Games konkrét jogorvoslati lehetőségeit és a lehetséges pénzbeli kártérítést, és mindkét fél találkozik majd, hogy megvitassák a lehetséges jogorvoslati lehetőségeket."
    ],
    "commentSummary": [
      "A Google-t az esküdtszék ítélete alapján bűnösnek találták abban, hogy jogellenes monopóliummal rendelkezik az alkalmazásboltok csatájában.",
      "Az ítélet szerint a Google az alkalmazásboltjának kezelése során alkalmazott gyakorlatával megsértette a trösztellenes törvényeket.",
      "Ez a döntés rávilágít a nagy technológiai cégek folyamatos ellenőrzésére és jogi kihívásaira, amelyekkel a különböző piacokon betöltött erőfölényük miatt szembesülnek."
    ],
    "points": 225,
    "commentCount": 2,
    "retryCount": 0,
    "time": 1702340734
  },
  {
    "id": 38603207,
    "title": "GigaGPT: GPT-2 méretű modellek képzése Cerebras hardverrel",
    "originLink": "https://www.cerebras.net/blog/introducing-gigagpt-gpt-3-sized-models-in-565-lines-of-code",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38603207",
    "commentBody": "",
    "originSummary": [
      "A GigaGPT a Cerebras implementációja Andrei Karpathy nanoGPT kódbázisának a nagyméretű GPT modellek képzésére.",
      "Több mint 100 milliárd paramétert tartalmazó modelleket képes kezelni a Cerebras hardver használatával, további kód vagy keretrendszerek nélkül.",
      "A GigaGPT a GPT-2 architektúrán alapul, és sikeresen tesztelték 111 millió és 175 milliárd paraméter közötti modellekkel."
    ],
    "commentSummary": [
      "A vita a gépi tanulási modellek és hardverek több aspektusát vizsgálja, beleértve a hatékony, nagyméretű képzési módszerek fejlesztését és az egyszerűbb architektúrák felé való lehetséges elmozdulást.",
      "A számítási teljesítmény növelését előnyösnek tartják, de aggodalmak merülnek fel azzal kapcsolatban, hogy bizonyos chipek esetében nem áll rendelkezésre elegendő információ a teljesítményről.",
      "A különböző nyelvi modellek és keretrendszerek különböző képességeket és rugalmasságot kínálnak, ami vitákhoz vezet a különböző megvalósítások hatékonyságáról és egyszerűségéről. A projekten belüli kódsorok számának jelentősége szintén eltérő vélemények tárgyát képezi. Végső soron nincs konszenzus a tárgyalt projekt fontosságát illetően."
    ],
    "points": 218,
    "commentCount": 65,
    "retryCount": 0,
    "time": 1702318408
  },
  {
    "id": 38601960,
    "title": "A rossz tudományos eredmények és a bírósági statisztikák téves ítéletekhez vezetnek",
    "originLink": "https://www.scientificamerican.com/article/bad-science-and-bad-statistics-in-the-courtroom-convict-innocent-people/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38601960",
    "commentBody": "",
    "originSummary": [
      "A bíróságon a hibás tudomány és statisztikák használata ártatlan személyek téves elítéléséhez vezethet.",
      "Az esküdtek és a bírák gyakran nem rendelkeznek a tudományos bizonyítékok megfelelő értékeléséhez szükséges szakértelemmel, ami hibás szakértői vallomásokat eredményez.",
      "A félrevezető törvényszéki technikák és az áltudományos gyakorlatok hozzájárulnak a megalapozatlan ítéletekhez, ami rávilágít a tudományos és statisztikai bizonyítékok jobb oktatásának szükségességére a tárgyalóteremben."
    ],
    "commentSummary": [
      "A cikk és a viták rávilágítanak a büntető igazságszolgáltatási rendszer számos hibájára, amelyek hozzájárulnak a téves ítéletekhez és a tisztességtelen eredményekhez.",
      "A megvitatott kérdések közé tartoznak a hibás tudomány és statisztikák, az elfogult szakértői tanúk, a nem megfelelő jogi képviselet és a rendszerszintű igazságtalanságok.",
      "A technológia és a bizonyítékok használatával, a kábítószertörvények hatásával és az ártatlanság bizonyításának nehézségével kapcsolatos aggályok is szóba kerülnek.",
      "A fejlesztési javaslatok között szerepel a források növelése, az átláthatóság, az elszámoltathatóság és a rendszeren belüli előítéletek kezelése."
    ],
    "points": 195,
    "commentCount": 190,
    "retryCount": 0,
    "time": 1702311962
  },
  {
    "id": 38601435,
    "title": "A visszavonás újragondolása: a szövegszerkesztő felhasználói élményének javítása",
    "originLink": "https://cdacamar.github.io/data%20structures/algorithms/benchmarking/text%20editors/c++/rethinking-undo/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38601435",
    "commentBody": "",
    "originSummary": [
      "A cikk a visszavonás és az újrakezdés koncepcióját vizsgálja a szövegszerkesztőkben, valamint a különböző megvalósítási megközelítéseket.",
      "A szerző javaslatot tesz egy adatszerkezetre és vizualizációs stratégiára a visszavonási/visszavonási műveletek kezelésére a felhasználói élmény javítása érdekében.",
      "A változtathatatlan adatszerkezetek használatának és a diff algoritmus megértésének előnyeit is hangsúlyozzák, ami arra utal, hogy a javasolt megközelítés hatékonyabb lehet, mint a hagyományos lineáris visszavonás/visszavonás modell."
    ],
    "commentSummary": [
      "A vita a felhasználói konfiguráció fontosságát vizsgálja a szövegszerkesztők visszavonási/visszavonási funkcióiban.",
      "Megvizsgálja a visszavonás/visszavonás parancsok viselkedését a különböző szerkesztőkben és a modális szerkesztés kihívásait.",
      "Az undo/redo rendszerek különböző alkalmazásokban való megvalósítása is szóba kerül, valamint az Emacs undo in region funkciójának előnyei és a perzisztens adatstruktúrák használata."
    ],
    "points": 192,
    "commentCount": 63,
    "retryCount": 0,
    "time": 1702308462
  },
  {
    "id": 38607071,
    "title": "A képviselőház hírszerzési bizottságának megfigyelési törvényjavaslata nyolc évig lehetővé teszi a tömeges megfigyelést",
    "originLink": "https://www.eff.org/deeplinks/2023/12/section-702-needs-reform-and-oversight-not-expansion-congress-should-oppose-hpsci",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38607071",
    "commentBody": "",
    "originSummary": [
      "A képviselőház igazságügyi bizottsága és a képviselőház hírszerzéssel foglalkozó állandó különbizottsága különböző törvényjavaslatokat terjesztett elő a külföldi hírszerzési megfigyelésről szóló törvény (FISA) 702. szakaszának újbóli felhatalmazására.",
      "Az Igazságügyi Bizottság törvényjavaslata, a H.R. 6570, a házkutatási parancs nélküli, hátsó ajtókon történő keresésekkel és az amerikaiak adatainak parancs nélküli megszerzésével kapcsolatos aggályokat kezeli. Javasolja, hogy a felhatalmazást további három évvel hosszabbítsák meg.",
      "A hírszerzési bizottság törvényjavaslata, a H.R. 6611 nyolc évre megújítja a tömeges megfigyelési jogkört, engedélyezi az amerikai személyek kommunikációjának végzés nélküli gyűjtését, és kiterjeszti a megfigyelést a menedékkérők és az online szolgáltatók szélesebb körének ellenőrzésére. Az Electronic Frontier Foundation (EFF) sürgeti az igazságügyi bizottság törvényjavaslatának támogatását a hírszerzési bizottság törvényjavaslatával szemben."
    ],
    "commentSummary": [
      "A képviselőház hírszerzési bizottságának megfigyelési \"reform\" törvényjavaslatát kritika éri, mivel az egy bohózat.",
      "A Hacker News egyik cikke megkérdőjelezi, hogy a törvényjavaslat valóban képes-e kezelni a megfigyeléssel kapcsolatos aggályokat.",
      "Kétségek merülnek fel a törvényjavaslat hatékonyságát illetően a felügyeleti kérdések kezelésében."
    ],
    "points": 190,
    "commentCount": 1,
    "retryCount": 0,
    "time": 1702338329
  },
  {
    "id": 38602750,
    "title": "WebAssembly átfordítása C-re: Egy futásidő-mentes alternatíva",
    "originLink": "https://00f.net/2023/12/11/webassembly-compilation-to-c/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38602750",
    "commentBody": "",
    "originSummary": [
      "A cikk a WebAssembly kód fordításának alternatív megközelítését tárgyalja, amely a kód C forráskódba történő átfordításával érhető el.",
      "Ez a megközelítés lehetővé teszi a jobb hibakeresést, a meglévő C kóddal való egyszerű integrációt, valamint a WebAssembly lefordításának és futtatásának lehetőségét új platformokon.",
      "Az átfordított C kód egy hagyományos C fordítóprogrammal fordítható, ami a hagyományos WebAssembly futtatókhoz képest gyorsabb és kisebb futtatható állományokat eredményez.",
      "Vannak azonban korlátozások, például a just-in-time fordítás hiánya és a memóriaőrző oldalak kézi beállítása.",
      "A megközelítés alkalmas a kódbiztonság javítására és a WebAssembly nem támogatott platformokon történő futtatására, de a hagyományos futásidejű programok több funkciót és rugalmasságot kínálnak."
    ],
    "commentSummary": [
      "A hozzászólásokban a WebAssembly (WASM) különböző témáit vitatják meg, mint például a webes fejlesztési futtatórendszerben rejlő lehetőségeket, a nyelvi kompatibilitási problémákat, a biztonsági aggályokat, a hordozhatóságot, a JavaScripthez viszonyított teljesítménybeli különbségeket, valamint a meglévő webes technológiák fejlesztésének szükségességét.",
      "Néhány hozzászóló szkeptikusan nyilatkozik a WASM korlátairól és hátrányairól, míg mások a biztonság, a vezérlésáramlás és a szoftver megőrzésének előnyeit emelik ki.",
      "A viták a WASM különböző alkalmazásokban és környezetekben történő felhasználásával kapcsolatos izgalom és óvatosság kombinációját mutatják."
    ],
    "points": 182,
    "commentCount": 120,
    "retryCount": 0,
    "time": 1702316666
  },
  {
    "id": 38606146,
    "title": "Az SQL-kijelentések kibővítése a 'RESULTDB'-vel: Az adatbázis visszaadásának lehetőségeinek felszabadítása",
    "originLink": "https://arxiv.org/abs/2312.00638",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38606146",
    "commentBody": "",
    "originSummary": [
      "A cikk azt javasolja, hogy szüntessük meg az SQL utasításokban azt a korlátozást, amely csak egyetlen táblázat visszaadását teszi lehetővé.",
      "A szerzők azt javasolják, hogy az SQL SELECT záradékát bővítsék ki a \"RESULTDB\" kulcsszóval, hogy lehetővé tegyék egy eredményadatbázis visszaküldését.",
      "Kiemelik e megközelítés előnyeit, például az egyszerűsített alkalmazáskódot, a fokozott lekérdezési teljesítményt, a lekérdezési eredmények csökkentett méretét és a gyorsabb lekérdezési eredmények átviteli idejét."
    ],
    "commentSummary": [
      "A tanulmány megvizsgálja az SQL-kijelentés eredményeképpen az adatbázis visszaadásának ötletét, és feltárja a lehetséges előnyöket és kihívásokat.",
      "A tárgyalt témák között szerepel az objektum-relációs leképezés, a lekérdezések teljesítménye, a kapcsolódó adatok összekapcsolása, az egymásba ágyazott JSON struktúrák és az SQL korlátai.",
      "A résztvevők kiemelik az olyan lehetséges előnyöket, mint a jobb teljesítmény és az egyszerűsített összetett lekérdezések, valamint az adatbázis kisebb terhelése. A terminológia, a hierarchikus adatlekérdezés és az adatbázis SQL-kijelentésként való visszaküldésének megvalósíthatósága is szóba kerül."
    ],
    "points": 181,
    "commentCount": 101,
    "retryCount": 0,
    "time": 1702332352
  },
  {
    "id": 38600031,
    "title": "Átlátszó fa: A játék-változó az okostelefon képernyők és a szigetelt ablakok számára",
    "originLink": "https://arstechnica.com/science/2023/12/why-scientists-are-making-transparent-wood/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38600031",
    "commentBody": "",
    "originSummary": [
      "A tudósok egy átlátszó faanyagot hoznak létre különböző alkalmazásokhoz, többek között okostelefonok képernyőjéhez és hőszigetelt ablakokhoz.",
      "A fát a növényi sejtekben lévő pigmentek kiiktatásával teszik átlátszóvá, és a nagyobb szilárdság érdekében epoxigyantával erősítik meg.",
      "Az átlátszó fa erősebb és strapabíróbb, mint a műanyag és az üveg, így fenntartható és tartós alternatívát jelenthet különböző termékek számára."
    ],
    "commentSummary": [
      "Az átlátszó fa egy olyan anyag, amelyet a fa ligninjének epoxigyantával való helyettesítésével hoznak létre, és amelynek fejlesztéséről és lehetséges alkalmazásairól most tárgyalnak.",
      "A megbeszélések témái között szerepelnek a szülői munkával kapcsolatos kihívások, az ablaküvegezés anyagainak hatékonysága és fenntarthatósága, az átlátszó fa újrahasznosíthatósága és különböző alkalmazásokhoz való alkalmassága, egy YouTuber által használt hangtechnika, az üveg újrahasznosítási arányának növelésével kapcsolatos kihívások az Egyesült Államokban, valamint összehasonlítások más anyagokkal, például üveggel és műanyaggal.",
      "Más anyagok, például a poliaramid is szóba kerül, valamint az új anyagok pontos elnevezésének fontossága."
    ],
    "points": 167,
    "commentCount": 129,
    "retryCount": 0,
    "time": 1702297860
  },
  {
    "id": 38602786,
    "title": "Amerikai ügyvéd aggályai a sportfogadás káros hatásai és a szabályozás szükségessége miatt",
    "originLink": "https://www.ft.com/content/497fdb45-fe81-4b13-97d0-70abe667b94f",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38602786",
    "commentBody": "",
    "originSummary": [
      "A cikk interjút közöl egy neves amerikai ügyvéddel, aki korábban a dohányipar ellen folytatott büntetőeljárást, most pedig a sportfogadás kérdésével foglalkozik.",
      "Az ügyvéd aggodalmát fejezi ki a széles körű sportfogadás lehetséges negatív hatásaival kapcsolatban, és hangsúlyozza a fogyasztók védelmét szolgáló szabályozás fontosságát.",
      "A szerencsejáték-ipar befolyása a politikára és a szerencsejátékkal kapcsolatos kockázatokról szóló közoktatás szükségessége is szóba kerül."
    ],
    "commentSummary": [
      "A vita a szerencsejáték-ipart érintő témák széles skáláját öleli fel, például a sportfogadás ragadozói szempontjaival kapcsolatos aggodalmakat és a folyamatos nyertesek betiltását.",
      "További témák között szerepelnek a legalizálás és a szabályozás előnyei és hátrányai, a családokra és a társadalomra gyakorolt hatás, a reklám erkölcsisége, valamint összehasonlítások más szabályozott iparágakkal.",
      "A beszélgetés kitér a szerencsejátékok addiktív jellegére, a videojátékok zsákmányládáinak szabályozására, a reklámok dohányzásra és párolásra gyakorolt hatására, valamint a sportban tapasztalható korrupcióra is."
    ],
    "points": 166,
    "commentCount": 186,
    "retryCount": 0,
    "time": 1702316767
  }
]
