[
  {
    "id": 38602575,
    "title": "Beeper Mini-App behebt Messaging-Problem, bietet kostenlosen Zugang und fordert Apple in Sachen Sicherheit heraus",
    "originLink": "https://blog.beeper.com/p/beeper-mini-is-back",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38602575",
    "commentBody": "",
    "originSummary": [
      "Beeper Mini, eine Chat-App, die die Kommunikation zwischen Android- und iPhone-Nutzern ermöglicht, hatte ein Nachrichtenproblem, das jetzt mit einem veröffentlichten Update behoben wurde.",
      "Die Telefonnummernregistrierung ist derzeit nicht verfügbar, und die Benutzer müssen sich mit einer AppleID anmelden. Nachrichten werden nicht mehr über Telefonnummern, sondern per E-Mail gesendet und empfangen.",
      "Trotz des Problems, das zu einem Rückgang im Ranking der App führte, arbeitet Beeper fleißig an der Stabilisierung der App und bietet sie kostenlos an. Die Mitbegründer von Beeper sind der Meinung, dass die App die Sicherheit und den Datenschutz sowohl für Android- als auch für iPhone-Nutzer verbessert, und sind bereit, ihre Codebasis zur Validierung mit einem externen Sicherheitsforschungsunternehmen zu teilen."
    ],
    "commentSummary": [],
    "points": 952,
    "commentCount": 1157,
    "retryCount": 0,
    "time": 1702315814
  },
  {
    "id": 38607424,
    "title": "Epic Games gewinnt Klage gegen Google und entscheidet, dass das Unternehmen ein illegales App-Store-Monopol geschaffen hat",
    "originLink": "https://www.theverge.com/23945184/epic-v-google-fortnite-play-store-antitrust-trial-updates#stream-entry-65d34a06-1fa5-4eab-abf6-ce450441b543",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38607424",
    "commentBody": "",
    "originSummary": [
      "Die Geschworenen haben in der Klage gegen Google zu Gunsten von Epic Games entschieden und festgestellt, dass Google mit seinem App-Store und Abrechnungsdienst ein illegales Monopol geschaffen hat.",
      "Google plant, gegen das Urteil Berufung einzulegen und die Entscheidung anzufechten.",
      "Epic Games legte während des Prozesses interne Dokumente vor, um seine Behauptung über das wettbewerbswidrige Verhalten von Google zu untermauern, während Google seine Gebührenerhebungsmethode verteidigte und den Wettbewerb mit Apple hervorhob."
    ],
    "commentSummary": [],
    "points": 815,
    "commentCount": 680,
    "retryCount": 0,
    "time": 1702340467
  },
  {
    "id": 38605525,
    "title": "FISA-\"Reform\"-Gesetzentwurf dehnt Überwachungsumfang auf weitere Einrichtungen aus",
    "originLink": "https://www.zwillgen.com/law-enforcement/fisa-reform-bill-702-surveillance/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38605525",
    "commentBody": "",
    "originSummary": [
      "Der ständige Geheimdienstausschuss des Repräsentantenhauses hat den FISA Reform and Reauthorization Act of 2023 verabschiedet, der die Ermächtigung für Abschnitt 702 des Foreign Intelligence Surveillance Act (FISA 702) verlängern würde.",
      "Der Gesetzentwurf enthält eine Bestimmung, mit der die Befugnisse der Regierung gemäß FISA 702 erweitert werden, indem die Definition der \"Anbieter elektronischer Kommunikationsdienste\" (ECSP), die zur Mithilfe bei der Überwachung gezwungen werden können, ausgeweitet wird.",
      "Im Falle einer Verabschiedung würden diese Änderungen die Zahl der Unternehmen und Einrichtungen, die bei der FISA-702-Überwachung mitwirken müssen, deutlich erhöhen."
    ],
    "commentSummary": [],
    "points": 260,
    "commentCount": 47,
    "retryCount": 0,
    "time": 1702329003
  },
  {
    "id": 38605643,
    "title": "Beamte in Portland schlagen ein Verbot des öffentlichen Drogenkonsums vor, um die Stadt zu beleben",
    "originLink": "https://www.nytimes.com/2023/12/11/us/portland-oregon-drug-laws.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38605643",
    "commentBody": "",
    "originSummary": [
      "Beamte des Bundesstaates und der Stadt Portland, Oregon, erwägen, einen Teil des staatlichen Gesetzes zur Entkriminalisierung von Drogen zurückzunehmen, um der zunehmenden Zahl von Überdosen und der Abwanderung von Unternehmen aus der Stadt zu begegnen.",
      "Der Plan umfasst ein Verbot des Drogenkonsums in der Öffentlichkeit und eine verstärkte polizeiliche Durchsetzung zur Erhöhung der Sicherheit.",
      "Eine vom Gouverneur geleitete Arbeitsgruppe hat neben den vorgeschlagenen Änderungen der Drogenpolitik auch Steuererleichterungen für Unternehmen und mehr Dienstleistungen für Obdachlose vorgeschlagen. Befürworter von Reformen in der Drogenpolitik haben jedoch Bedenken wegen der möglichen Folgen einer Kriminalisierung des Drogenkonsums geäußert."
    ],
    "commentSummary": [
      "Die Diskussion befasst sich mit den Themen Drogenabhängigkeit, Obdachlosigkeit und den besonderen Herausforderungen, denen sich Städte wie Portland und Seattle bei der Bewältigung dieser Probleme gegenübersehen.",
      "Es besteht Uneinigkeit über die Wirksamkeit der derzeitigen Strategien, wobei der Schwerpunkt auf den Mängeln der Maßnahme 110 in Oregon liegt, und es werden alternative Lösungen wie die Bereitstellung von kostenlosem Wohnraum und die Einführung einer Drogenregulierung erwogen.",
      "Die Auswirkungen des Drogenkonsums auf den öffentlichen Raum, die Komplexität der Bereitstellung umfassender Unterstützungsdienste und die Bedeutung einer effizienten Verwaltung und Rechenschaftspflicht bei der Verwendung der Mittel sind allesamt wichtige Diskussionspunkte."
    ],
    "points": 248,
    "commentCount": 645,
    "retryCount": 0,
    "time": 1702329677
  },
  {
    "id": 38599270,
    "title": "Tohands Smart Calculator: Verfolgen Sie Verkäufe und Ausgaben ganz einfach",
    "originLink": "https://smart.tohands.in/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38599270",
    "commentBody": "",
    "originSummary": [
      "Tohands Smart Calculator ist ein benutzerfreundlicher und effizienter Taschenrechner, der speziell für Ladenbesitzer entwickelt wurde, um ihre Umsätze und Ausgaben zu verwalten.",
      "Es bietet tägliche, wöchentliche und monatliche Berichte und Analysen, die den Ladenbesitzern helfen, ihre Geschäftsleistung zu verfolgen.",
      "Aufgrund der hohen Nachfrage sind derzeit keine Bestellungen möglich, aber Kunden können sich auf eine Warteliste setzen lassen, um benachrichtigt zu werden, wenn der Rechner wieder verfügbar ist.",
      "Der Rechner verfügt über ein großes Display, arbeitet offline und hat einen eingebauten Speicher, der bis zu 40 Lakh Transaktionen speichern kann.",
      "Es ist eine erschwingliche Alternative zu herkömmlichen Abrechnungsgeräten und wird mit einer einjährigen Garantie geliefert.",
      "Der Tohands Smart Calculator wurde in verschiedenen Publikationen vorgestellt und ist stolz darauf, ein Made in India-Produkt zu sein."
    ],
    "commentSummary": [],
    "points": 234,
    "commentCount": 81,
    "retryCount": 0,
    "time": 1702290423
  },
  {
    "id": 38607474,
    "title": "Jury entscheidet zugunsten von Epic Games und erklärt Googles App Store zum Monopol",
    "originLink": "https://www.theverge.com/23994174/epic-google-trial-jury-verdict-monopoly-google-play",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38607474",
    "commentBody": "",
    "originSummary": [
      "Die Geschworenen haben im Rechtsstreit gegen Google wegen angeblicher App-Store-Monopole zu Gunsten von Epic Games entschieden.",
      "In dem Urteil heißt es, dass der Google Play Store und der Google Play Billing Service ein illegales Monopol darstellen und dass Google sich wettbewerbswidrig verhält.",
      "Richter James Donato wird im Januar die spezifischen Abhilfemaßnahmen und den möglichen Schadenersatz für Epic Games festlegen, und beide Parteien werden sich treffen, um mögliche Abhilfemaßnahmen zu besprechen."
    ],
    "commentSummary": [
      "Google wurde von einem Geschworenengericht des illegalen Monopols im Kampf um den App-Store für schuldig befunden.",
      "Das Urteil legt nahe, dass die Praktiken von Google bei der Verwaltung seines App-Stores gegen das Kartellrecht verstoßen haben.",
      "Diese Entscheidung verdeutlicht, dass die Dominanz großer Technologieunternehmen auf verschiedenen Märkten immer wieder unter die Lupe genommen und rechtlich angefochten wird."
    ],
    "points": 225,
    "commentCount": 2,
    "retryCount": 0,
    "time": 1702340734
  },
  {
    "id": 38603207,
    "title": "GigaGPT: Training von Modellen der Größe GPT-2 mit Cerebras Hardware",
    "originLink": "https://www.cerebras.net/blog/introducing-gigagpt-gpt-3-sized-models-in-565-lines-of-code",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38603207",
    "commentBody": "",
    "originSummary": [
      "GigaGPT ist die Cerebras-Implementierung von Andrei Karpathys nanoGPT-Codebasis für das Training großer GPT-Modelle.",
      "Es kann Modelle mit über 100 Milliarden Parametern unter Verwendung von Cerebras-Hardware ohne zusätzlichen Code oder Frameworks verarbeiten.",
      "GigaGPT basiert auf der GPT-2-Architektur und wurde bereits erfolgreich mit Modellen mit 111 Millionen bis 175 Milliarden Parametern getestet."
    ],
    "commentSummary": [
      "Die Diskussion befasst sich mit verschiedenen Aspekten von Modellen und Hardware für maschinelles Lernen, einschließlich der Entwicklung effizienter Trainingsmethoden in großem Maßstab und dem möglichen Übergang zu einfacheren Architekturen.",
      "Die Erhöhung der Rechenleistung wird als vorteilhaft angesehen, aber es werden Bedenken geäußert, dass für bestimmte Chips keine Leistungsinformationen vorliegen.",
      "Verschiedene Sprachmodelle und Frameworks bieten unterschiedliche Fähigkeiten und Flexibilität, was zu Debatten über die Effektivität und Einfachheit verschiedener Implementierungen führt. Auch über die Bedeutung der Anzahl der Codezeilen in einem Projekt gibt es unterschiedliche Meinungen. Letztlich gibt es keinen Konsens über die Bedeutung des besprochenen Projekts."
    ],
    "points": 218,
    "commentCount": 65,
    "retryCount": 0,
    "time": 1702318408
  },
  {
    "id": 38601960,
    "title": "Schlechte Wissenschaft und Statistiken vor Gericht führen zu falschen Verurteilungen",
    "originLink": "https://www.scientificamerican.com/article/bad-science-and-bad-statistics-in-the-courtroom-convict-innocent-people/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38601960",
    "commentBody": "",
    "originSummary": [
      "Die Verwendung fehlerhafter wissenschaftlicher und statistischer Daten vor Gericht kann dazu führen, dass Unschuldige zu Unrecht verurteilt werden.",
      "Geschworenen und Richtern fehlt oft das Fachwissen, um wissenschaftliche Beweise richtig zu bewerten, was zu fehlerhaften Expertenaussagen führt.",
      "Irreführende forensische Techniken und pseudowissenschaftliche Praktiken tragen zu unhaltbaren Verurteilungen bei, was die Notwendigkeit einer besseren Aufklärung über wissenschaftliche und statistische Beweise im Gerichtssaal unterstreicht."
    ],
    "commentSummary": [
      "Der Artikel und die Diskussionen beleuchten zahlreiche Schwachstellen im Strafrechtssystem, die zu ungerechtfertigten Verurteilungen und ungerechten Ergebnissen beitragen.",
      "Zu den diskutierten Themen gehören fehlerhafte Wissenschaft und Statistiken, voreingenommene Sachverständige, unzureichende rechtliche Vertretung und systembedingte Ungerechtigkeiten.",
      "Auch Bedenken hinsichtlich des Einsatzes von Technologie und Beweisen, der Auswirkungen von Drogengesetzen und der Schwierigkeit des Unschuldsbeweises werden angesprochen.",
      "Zu den Verbesserungsvorschlägen gehören mehr Ressourcen, Transparenz, Rechenschaftspflicht und die Beseitigung von Vorurteilen innerhalb des Systems."
    ],
    "points": 195,
    "commentCount": 190,
    "retryCount": 0,
    "time": 1702311962
  },
  {
    "id": 38601435,
    "title": "Rückgängig machen neu denken: Verbesserung der Benutzerfreundlichkeit von Texteditoren",
    "originLink": "https://cdacamar.github.io/data%20structures/algorithms/benchmarking/text%20editors/c++/rethinking-undo/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38601435",
    "commentBody": "",
    "originSummary": [
      "Der Artikel befasst sich mit dem Konzept des Rückgängigmachens und Wiederholens in Texteditoren sowie mit verschiedenen Implementierungsansätzen.",
      "Der Autor schlägt eine Datenstruktur und eine Visualisierungsstrategie für die Verwaltung von Undo/Redo-Vorgängen vor, um die Benutzerfreundlichkeit zu erhöhen.",
      "Die Vorteile der Verwendung unveränderlicher Datenstrukturen und des Verständnisses des Diff-Algorithmus werden ebenfalls hervorgehoben, was darauf hindeutet, dass der vorgeschlagene Ansatz effizienter sein könnte als das traditionelle lineare Undo/Redo-Modell."
    ],
    "commentSummary": [
      "Die Diskussion befasst sich mit der Bedeutung der Benutzerkonfiguration für die Undo/Redo-Funktionalität in Texteditoren.",
      "Er untersucht das Verhalten von Undo/Redo-Befehlen in verschiedenen Editoren und die Herausforderungen der modalen Bearbeitung.",
      "Die Implementierung von Undo/Redo-Systemen in verschiedenen Anwendungen wird ebenso diskutiert wie die Vorteile der Undo-in-Region-Funktion von Emacs und die Verwendung von persistenten Datenstrukturen."
    ],
    "points": 192,
    "commentCount": 63,
    "retryCount": 0,
    "time": 1702308462
  },
  {
    "id": 38607071,
    "title": "Gesetzentwurf des Geheimdienstausschusses des Repräsentantenhauses zur Überwachung ermöglicht Massenüberwachung für acht Jahre",
    "originLink": "https://www.eff.org/deeplinks/2023/12/section-702-needs-reform-and-oversight-not-expansion-congress-should-oppose-hpsci",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38607071",
    "commentBody": "",
    "originSummary": [
      "Der Justizausschuss des Repräsentantenhauses und der ständige Sonderausschuss des Repräsentantenhauses für Nachrichtendienste haben verschiedene Gesetzesentwürfe zur Wiederzulassung von Abschnitt 702 des Foreign Intelligence Surveillance Act (FISA) vorgelegt.",
      "Der Gesetzentwurf des Justizausschusses, H.R. 6570, befasst sich mit den Bedenken gegen die Durchsuchung von Hintertüren und den Kauf von Daten von Amerikanern ohne Durchsuchungsbefehl. Er schlägt vor, die Befugnis um drei weitere Jahre zu verlängern.",
      "Der Gesetzentwurf des Geheimdienstausschusses, H.R. 6611, verlängert die Befugnis zur Massenüberwachung um acht Jahre, erlaubt die Erfassung der Kommunikation von US-Bürgern ohne Durchsuchungsbefehl und erweitert die Überwachung auf die Überprüfung von Asylbewerbern und eine breitere Palette von Online-Anbietern. Die Electronic Frontier Foundation (EFF) empfiehlt dringend, den Gesetzentwurf des Justizausschusses dem des Geheimdienstausschusses vorzuziehen."
    ],
    "commentSummary": [
      "Der Gesetzentwurf des Geheimdienstausschusses des Repräsentantenhauses zur \"Reform\" der Überwachung wird als Farce kritisiert.",
      "In einem Artikel auf Hacker News wird bezweifelt, dass der Gesetzesentwurf wirklich auf die Probleme der Überwachung eingehen kann.",
      "Es werden Zweifel an der Wirksamkeit des Gesetzentwurfs in Bezug auf Überwachungsfragen geäußert."
    ],
    "points": 190,
    "commentCount": 1,
    "retryCount": 0,
    "time": 1702338329
  },
  {
    "id": 38602750,
    "title": "Transpilieren von WebAssembly nach C: Eine laufzeitunabhängige Alternative",
    "originLink": "https://00f.net/2023/12/11/webassembly-compilation-to-c/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38602750",
    "commentBody": "",
    "originSummary": [
      "In diesem Artikel wird ein alternativer Ansatz zur Kompilierung von WebAssembly-Code durch Transpilierung in C-Quellcode erörtert.",
      "Dieser Ansatz ermöglicht ein verbessertes Debugging, eine einfache Integration in vorhandenen C-Code und die Möglichkeit, WebAssembly auf neuen Plattformen zu kompilieren und auszuführen.",
      "Der transpilierte C-Code kann mit einem normalen C-Compiler kompiliert werden, was im Vergleich zu herkömmlichen WebAssembly-Laufzeiten zu schnelleren und kleineren ausführbaren Dateien führt.",
      "Allerdings gibt es Einschränkungen, wie das Fehlen einer Just-in-Time-Kompilierung und die manuelle Einrichtung von Speicherschutzseiten.",
      "Der Ansatz eignet sich zur Verbesserung der Codesicherheit und zur Ausführung von WebAssembly auf nicht unterstützten Plattformen, doch bieten herkömmliche Laufzeiten mehr Funktionen und Flexibilität."
    ],
    "commentSummary": [
      "In den Kommentaren zu diesem Beitrag werden verschiedene Themen im Zusammenhang mit WebAssembly (WASM) erörtert, z. B. sein Potenzial als Laufzeitumgebung für die Webentwicklung, Fragen der Sprachkompatibilität, Sicherheitsbedenken, Portabilität, Leistungsunterschiede im Vergleich zu JavaScript und die Notwendigkeit, bestehende Webtechnologien zu verbessern.",
      "Einige Kommentatoren äußern sich skeptisch zu den Einschränkungen und Nachteilen von WASM, während andere die Vorteile in Bezug auf Sicherheit, Kontrollfluss und Softwareerhaltung hervorheben.",
      "Die Diskussionen zeigen eine Mischung aus Begeisterung und Vorsicht in Bezug auf den Einsatz von WASM in verschiedenen Anwendungen und Umgebungen."
    ],
    "points": 182,
    "commentCount": 120,
    "retryCount": 0,
    "time": 1702316666
  },
  {
    "id": 38606146,
    "title": "Erweitern von SQL-Anweisungen mit 'RESULTDB': Das Potenzial für die Rückgabe einer Datenbank erschließen",
    "originLink": "https://arxiv.org/abs/2312.00638",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38606146",
    "commentBody": "",
    "originSummary": [
      "In dem Papier wird vorgeschlagen, die Beschränkung in SQL-Anweisungen aufzuheben, die nur die Rückgabe einer einzigen Tabelle erlaubt.",
      "Die Autoren schlagen vor, die SELECT-Klausel von SQL um das Schlüsselwort \"RESULTDB\" zu erweitern, um die Rückgabe einer Ergebnisdatenbank zu ermöglichen.",
      "Sie heben die Vorteile dieses Ansatzes hervor, wie z. B. vereinfachter Anwendungscode, verbesserte Abfrageleistung, geringere Größe der Abfrageergebnisse und schnellere Übertragungszeiten der Abfrageergebnisse."
    ],
    "commentSummary": [
      "Das Papier untersucht die Idee, eine Datenbank als Ergebnis einer SQL-Anweisung zurückzugeben, und erforscht deren potenzielle Vorteile und Herausforderungen.",
      "Zu den besprochenen Themen gehören die objektrelationale Zuordnung, die Abfrageleistung, die Verknüpfung verwandter Daten, verschachtelte JSON-Strukturen und die Grenzen von SQL.",
      "Die Teilnehmer heben die potenziellen Vorteile wie verbesserte Leistung und vereinfachte komplexe Abfragen sowie geringere Belastung der Datenbank hervor. Terminologie, hierarchischer Datenabruf und die Möglichkeit, eine Datenbank als SQL-Anweisung zurückzugeben, werden ebenfalls untersucht."
    ],
    "points": 181,
    "commentCount": 101,
    "retryCount": 0,
    "time": 1702332352
  },
  {
    "id": 38600031,
    "title": "Transparentes Holz: Ein Wendepunkt für Smartphone-Bildschirme und isolierte Fenster",
    "originLink": "https://arstechnica.com/science/2023/12/why-scientists-are-making-transparent-wood/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38600031",
    "commentBody": "",
    "originSummary": [
      "Wissenschaftler entwickeln ein transparentes Holzmaterial für verschiedene Anwendungen, darunter Smartphone-Bildschirme und Isolierfenster.",
      "Das Holz wird durch die Eliminierung von Pigmenten in den Pflanzenzellen transparent gemacht und kann mit Epoxidharz verstärkt werden, um die Festigkeit zu erhöhen.",
      "Transparentes Holz ist stärker und widerstandsfähiger als Kunststoff und Glas und könnte eine nachhaltige und dauerhafte Alternative für verschiedene Produkte darstellen."
    ],
    "commentSummary": [
      "Transparentes Holz ist ein Material, bei dem das Lignin des Holzes durch Epoxidharz ersetzt wird, und seine Entwicklung und mögliche Anwendungen werden diskutiert.",
      "Zu den Themen, die in den Diskussionen behandelt wurden, gehören die Herausforderungen der Elternschaft, die Effizienz und Nachhaltigkeit von Fensterglas, die Recyclingfähigkeit und Eignung von transparentem Holz für verschiedene Anwendungen, die von einem YouTuber verwendeten Voiceover-Techniken, die Herausforderungen bei der Erhöhung der Glasrecyclingraten in den USA und Vergleiche mit anderen Materialien wie Glas und Kunststoff.",
      "Andere Materialien wie Polyaramid werden ebenfalls erwähnt, ebenso wie die Bedeutung der Verwendung genauer Namen für neue Materialien."
    ],
    "points": 167,
    "commentCount": 129,
    "retryCount": 0,
    "time": 1702297860
  },
  {
    "id": 38602786,
    "title": "Bedenken eines US-Anwalts über die schädlichen Auswirkungen von Sportwetten und die Notwendigkeit von Regulierungen",
    "originLink": "https://www.ft.com/content/497fdb45-fe81-4b13-97d0-70abe667b94f",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38602786",
    "commentBody": "",
    "originSummary": [
      "Der Artikel enthält ein Interview mit einem prominenten US-Anwalt, der früher die Tabakindustrie strafrechtlich verfolgte und sich nun mit dem Thema Sportwetten befasst.",
      "Der Anwalt äußert Bedenken über die potenziellen negativen Auswirkungen weit verbreiteter Sportwetten und unterstreicht die Bedeutung von Vorschriften zum Schutz der Verbraucher.",
      "Der Einfluss der Glücksspielindustrie auf die Politik und die Notwendigkeit der Aufklärung der Öffentlichkeit über die mit dem Glücksspiel verbundenen Risiken werden ebenfalls diskutiert."
    ],
    "commentSummary": [
      "Die Diskussion deckt ein breites Spektrum von Themen ab, die die Glücksspielindustrie betreffen, wie z. B. die Besorgnis über die räuberischen Aspekte von Sportwetten und das Verbot von Dauergewinnern.",
      "Weitere Themen sind das Für und Wider der Legalisierung und Regulierung, die Auswirkungen auf Familien und die Gesellschaft, die Moral der Werbung und der Vergleich mit anderen regulierten Branchen.",
      "Weitere Themen des Gesprächs sind das Suchtpotenzial von Glücksspielen, die Regulierung von Beutekisten in Videospielen, der Einfluss von Werbung auf Rauchen und Dampfen sowie Korruption im Sport."
    ],
    "points": 166,
    "commentCount": 186,
    "retryCount": 0,
    "time": 1702316767
  }
]
