[
  {
    "id": 38602575,
    "title": "L'app Beeper Mini risolve il problema della messaggistica, offre accesso gratuito e sfida Apple sulla sicurezza",
    "originLink": "https://blog.beeper.com/p/beeper-mini-is-back",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38602575",
    "commentBody": "",
    "originSummary": [
      "Beeper Mini, un'app di chat che consente la comunicazione tra utenti Android e iPhone, ha avuto un problema di messaggistica che ora è stato risolto con un aggiornamento pubblicato.",
      "La registrazione del numero di telefono non è attualmente disponibile e gli utenti devono accedere utilizzando un AppleID. I messaggi saranno inviati e ricevuti tramite e-mail anziché tramite numero di telefono.",
      "Nonostante il problema abbia causato un calo nel ranking dell'applicazione, Beeper sta lavorando diligentemente per stabilizzare l'applicazione e la sta offrendo gratuitamente. I cofondatori di Beeper ritengono che l'applicazione migliori la sicurezza e la privacy degli utenti Android e iPhone e sono disposti a condividere il codice base con una società di ricerca sulla sicurezza di terze parti per la convalida."
    ],
    "commentSummary": [],
    "points": 952,
    "commentCount": 1157,
    "retryCount": 0,
    "time": 1702315814
  },
  {
    "id": 38607424,
    "title": "Epic Games vince la causa contro Google, stabilendo che ha creato un monopolio illegale sugli app store",
    "originLink": "https://www.theverge.com/23945184/epic-v-google-fortnite-play-store-antitrust-trial-updates#stream-entry-65d34a06-1fa5-4eab-abf6-ce450441b543",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38607424",
    "commentBody": "",
    "originSummary": [
      "La giuria si è pronunciata a favore di Epic Games nella causa contro Google, affermando che Google ha creato un monopolio illegale con il suo app store e il servizio di fatturazione.",
      "Google intende appellarsi al verdetto, contestando la decisione.",
      "Durante il processo, Epic Games ha presentato documenti interni a sostegno delle sue affermazioni sul comportamento anticoncorrenziale di Google, mentre Google ha difeso il suo metodo di riscossione delle tariffe e ha sottolineato la concorrenza con Apple."
    ],
    "commentSummary": [],
    "points": 815,
    "commentCount": 680,
    "retryCount": 0,
    "time": 1702340467
  },
  {
    "id": 38605525,
    "title": "Il disegno di legge di \"riforma\" della FISA espande la portata della sorveglianza a un maggior numero di entità",
    "originLink": "https://www.zwillgen.com/law-enforcement/fisa-reform-bill-702-surveillance/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38605525",
    "commentBody": "",
    "originSummary": [
      "La House Permanent Select Committee on Intelligence ha approvato il FISA Reform and Reauthorization Act of 2023, che proroga l'autorizzazione della Sezione 702 del Foreign Intelligence Surveillance Act (FISA 702).",
      "Il disegno di legge include una disposizione che espanderebbe l'autorità del governo ai sensi della FISA 702, ampliando la definizione di \"fornitori di servizi di comunicazione elettronica\" (ECSP) che possono essere obbligati ad assistere nella sorveglianza.",
      "Se approvate, queste modifiche aumenterebbero in modo significativo il numero di aziende ed entità tenute a prestare assistenza nella sorveglianza FISA 702."
    ],
    "commentSummary": [],
    "points": 260,
    "commentCount": 47,
    "retryCount": 0,
    "time": 1702329003
  },
  {
    "id": 38605643,
    "title": "I funzionari di Portland propongono il divieto di consumo di droghe in pubblico per rilanciare la città",
    "originLink": "https://www.nytimes.com/2023/12/11/us/portland-oregon-drug-laws.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38605643",
    "commentBody": "",
    "originSummary": [
      "I funzionari dello Stato e della città di Portland, in Oregon, stanno valutando la possibilità di revocare parte della legge statale sulla depenalizzazione delle droghe per far fronte all'aumento delle overdose e all'esodo delle imprese dalla città.",
      "Il piano prevede il divieto di consumo di droghe in pubblico e un maggiore controllo da parte della polizia per aumentare la sicurezza.",
      "Una task force guidata dal governatore ha proposto sgravi fiscali per le imprese e maggiori servizi per i residenti senza fissa dimora, oltre alle modifiche proposte alla politica sulle droghe. Tuttavia, i sostenitori della riforma delle politiche sulle droghe hanno espresso preoccupazione per le potenziali conseguenze della criminalizzazione del consumo di droga."
    ],
    "commentSummary": [
      "La discussione approfondisce i temi della tossicodipendenza, dei senzatetto e delle sfide specifiche che città come Portland e Seattle devono affrontare per risolvere questi problemi.",
      "C'è disaccordo sull'efficacia delle strategie attuali, con particolare attenzione alle carenze della Misura 110 in Oregon, e vengono prese in considerazione soluzioni alternative come la fornitura di alloggi gratuiti e l'attuazione di una regolamentazione delle droghe.",
      "L'impatto del consumo di droga sugli spazi pubblici, la complessità di fornire servizi di supporto completi e l'importanza di una gestione efficiente e della responsabilità nell'utilizzo dei fondi sono tutti punti chiave di discussione."
    ],
    "points": 248,
    "commentCount": 645,
    "retryCount": 0,
    "time": 1702329677
  },
  {
    "id": 38599270,
    "title": "Calcolatrice intelligente Tohands: Traccia le vendite e le spese in modo semplice",
    "originLink": "https://smart.tohands.in/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38599270",
    "commentBody": "",
    "originSummary": [
      "Tohands Smart Calculator è una calcolatrice efficiente e facile da usare, progettata appositamente per i negozianti per gestire le vendite e le spese.",
      "Offre report e analisi giornaliere, settimanali e mensili per aiutare i negozianti a monitorare le prestazioni della loro attività.",
      "Attualmente gli ordini non sono disponibili a causa dell'elevata domanda, ma i clienti possono iscriversi a una lista d'attesa per essere avvisati quando la calcolatrice sarà nuovamente disponibile.",
      "La calcolatrice è dotata di un ampio display, funziona offline e ha una memoria integrata che consente di memorizzare fino a 40 mila transazioni.",
      "È un'alternativa economica alle macchine di fatturazione tradizionali e viene fornita con una garanzia di 1 anno.",
      "Presentata in varie pubblicazioni, la calcolatrice intelligente Tohands è orgogliosa di essere un prodotto Made in India."
    ],
    "commentSummary": [],
    "points": 234,
    "commentCount": 81,
    "retryCount": 0,
    "time": 1702290423
  },
  {
    "id": 38607474,
    "title": "La giuria si pronuncia a favore di Epic Games, dichiarando il negozio di app di Google un monopolio",
    "originLink": "https://www.theverge.com/23994174/epic-google-trial-jury-verdict-monopoly-google-play",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38607474",
    "commentBody": "",
    "originSummary": [
      "La giuria si è pronunciata a favore di Epic Games nella causa contro Google per il presunto monopolio dei negozi di app.",
      "Il verdetto afferma che il negozio Google Play e il servizio di fatturazione Google Play costituiscono un monopolio illegale e che Google ha adottato un comportamento anticoncorrenziale.",
      "Il giudice James Donato stabilirà i rimedi specifici e i potenziali danni monetari per Epic Games a gennaio, ed entrambe le parti si incontreranno per discutere i potenziali rimedi."
    ],
    "commentSummary": [
      "Google è stata dichiarata colpevole di avere un monopolio illegale nella battaglia degli app store da un verdetto della giuria.",
      "La sentenza suggerisce che le pratiche di Google nella gestione del suo app store hanno violato le leggi antitrust.",
      "Questa decisione evidenzia il continuo controllo e le sfide legali che le grandi aziende tecnologiche devono affrontare per la loro posizione dominante in vari mercati."
    ],
    "points": 225,
    "commentCount": 2,
    "retryCount": 0,
    "time": 1702340734
  },
  {
    "id": 38603207,
    "title": "GigaGPT: Addestramento di modelli di dimensioni GPT-2 con hardware Cerebras",
    "originLink": "https://www.cerebras.net/blog/introducing-gigagpt-gpt-3-sized-models-in-565-lines-of-code",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38603207",
    "commentBody": "",
    "originSummary": [
      "GigaGPT è l'implementazione di Cerebras del codice base nanoGPT di Andrei Karpathy per l'addestramento di modelli GPT su larga scala.",
      "Può gestire modelli con oltre 100 miliardi di parametri utilizzando l'hardware Cerebras senza codice o framework aggiuntivi.",
      "GigaGPT si basa sull'architettura GPT-2 ed è stato testato con successo con modelli che vanno da 111 milioni a 175 miliardi di parametri."
    ],
    "commentSummary": [
      "La discussione esplora diversi aspetti dei modelli di apprendimento automatico e dell'hardware, tra cui lo sviluppo di metodi di addestramento efficienti su larga scala e il potenziale passaggio ad architetture più semplici.",
      "L'aumento della potenza di calcolo è considerato vantaggioso, ma si teme la mancanza di informazioni sulle prestazioni di alcuni chip.",
      "I diversi modelli e framework linguistici offrono capacità e flessibilità diverse, il che porta a dibattiti sull'efficacia e la semplicità delle diverse implementazioni. Anche l'importanza del numero di linee di codice in un progetto è oggetto di opinioni diverse. In definitiva, non c'è consenso sull'importanza del progetto discusso."
    ],
    "points": 218,
    "commentCount": 65,
    "retryCount": 0,
    "time": 1702318408
  },
  {
    "id": 38601960,
    "title": "La cattiva scienza e le statistiche in tribunale portano a condanne errate",
    "originLink": "https://www.scientificamerican.com/article/bad-science-and-bad-statistics-in-the-courtroom-convict-innocent-people/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38601960",
    "commentBody": "",
    "originSummary": [
      "L'uso di scienze e statistiche errate in tribunale può portare alla condanna ingiusta di persone innocenti.",
      "Le giurie e i giudici spesso non hanno le competenze necessarie per valutare correttamente le prove scientifiche, il che si traduce in testimonianze di esperti errate.",
      "Tecniche forensi fuorvianti e pratiche pseudoscientifiche contribuiscono a condanne infondate, evidenziando la necessità di una migliore formazione sulle prove scientifiche e statistiche in aula."
    ],
    "commentSummary": [
      "L'articolo e le discussioni fanno luce su numerosi difetti del sistema giudiziario penale che contribuiscono a condanne errate e a risultati ingiusti.",
      "Le questioni discusse includono scienza e statistiche errate, testimoni esperti di parte, rappresentanza legale inadeguata e ingiustizie sistemiche.",
      "Vengono inoltre affrontate le preoccupazioni relative all'uso della tecnologia e delle prove, all'impatto delle leggi sulla droga e alla difficoltà di dimostrare l'innocenza.",
      "I suggerimenti per il miglioramento includono l'aumento delle risorse, la trasparenza, la responsabilità e l'eliminazione dei pregiudizi all'interno del sistema."
    ],
    "points": 195,
    "commentCount": 190,
    "retryCount": 0,
    "time": 1702311962
  },
  {
    "id": 38601435,
    "title": "Ripensare l'annullamento: migliorare l'esperienza dell'utente dell'editor di testo",
    "originLink": "https://cdacamar.github.io/data%20structures/algorithms/benchmarking/text%20editors/c++/rethinking-undo/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38601435",
    "commentBody": "",
    "originSummary": [
      "L'articolo esplora il concetto di undo e redo negli editor di testo e i diversi approcci di implementazione.",
      "L'autore propone una struttura di dati e una strategia di visualizzazione per la gestione delle operazioni di annullamento/ripristino per migliorare l'esperienza dell'utente.",
      "I vantaggi dell'uso di strutture dati immutabili e della comprensione dell'algoritmo diff sono stati sottolineati, suggerendo che l'approccio proposto può essere più efficiente del tradizionale modello lineare di undo/redo."
    ],
    "commentSummary": [
      "La discussione esplora l'importanza della configurazione dell'utente nella funzionalità di annullamento/ripristino negli editor di testo.",
      "Esamina il comportamento dei comandi di annullamento/ripristino in diversi editor e le sfide dell'editing modale.",
      "Viene inoltre discussa l'implementazione di sistemi di annullamento/ripristino in varie applicazioni, nonché i vantaggi della funzione di annullamento in regione di Emacs e l'uso di strutture di dati persistenti."
    ],
    "points": 192,
    "commentCount": 63,
    "retryCount": 0,
    "time": 1702308462
  },
  {
    "id": 38607071,
    "title": "Il disegno di legge sulla sorveglianza della Commissione Intelligence della Camera consente la sorveglianza di massa per otto anni",
    "originLink": "https://www.eff.org/deeplinks/2023/12/section-702-needs-reform-and-oversight-not-expansion-congress-should-oppose-hpsci",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38607071",
    "commentBody": "",
    "originSummary": [
      "La Commissione giudiziaria della Camera e il Comitato permanente di selezione sull'intelligence della Camera hanno proposto diverse proposte di legge per la riautorizzazione della sezione 702 della legge sulla sorveglianza dei servizi segreti stranieri (FISA).",
      "La proposta di legge del Comitato giudiziario, H.R. 6570, affronta le preoccupazioni relative alle perquisizioni backdoor senza mandato e all'acquisto dei dati degli americani senza un mandato. Propone di rinnovare l'autorità per altri tre anni.",
      "La proposta di legge della Commissione per l'Intelligence, H.R. 6611, rinnova l'autorità di sorveglianza di massa per otto anni, consente la raccolta di comunicazioni di persone statunitensi senza un mandato ed espande la sorveglianza ai richiedenti asilo e a una più ampia gamma di fornitori online. La Electronic Frontier Foundation (EFF) invita a sostenere la proposta di legge del Comitato giudiziario rispetto a quella del Comitato per l'intelligence."
    ],
    "commentSummary": [
      "Il disegno di legge di \"riforma\" della sorveglianza della Commissione per l'Intelligence della Camera è oggetto di critiche perché è una farsa.",
      "Un articolo pubblicato su Hacker News mette in dubbio la capacità del disegno di legge di affrontare realmente i problemi di sorveglianza.",
      "Sono stati sollevati dubbi sull'efficacia del disegno di legge nell'affrontare i problemi di sorveglianza."
    ],
    "points": 190,
    "commentCount": 1,
    "retryCount": 0,
    "time": 1702338329
  },
  {
    "id": 38602750,
    "title": "Trapelare WebAssembly in C: un'alternativa senza runtime",
    "originLink": "https://00f.net/2023/12/11/webassembly-compilation-to-c/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38602750",
    "commentBody": "",
    "originSummary": [
      "L'articolo esamina un approccio alternativo alla compilazione del codice WebAssembly mediante la trasposizione in codice sorgente C.",
      "Questo approccio consente di migliorare il debugging, di integrarsi facilmente con il codice C esistente e di compilare ed eseguire WebAssembly su nuove piattaforme.",
      "Il codice C transpilato può essere compilato con un normale compilatore C, con il risultato di ottenere eseguibili più veloci e più piccoli rispetto ai runtime WebAssembly tradizionali.",
      "Tuttavia, ci sono delle limitazioni, come la mancanza della compilazione just-in-time e l'impostazione manuale delle pagine di protezione della memoria.",
      "L'approccio è adatto per migliorare la sicurezza del codice ed eseguire WebAssembly su piattaforme non supportate, ma i runtime tradizionali offrono maggiori funzionalità e flessibilità."
    ],
    "commentSummary": [
      "I commenti a questo post discutono vari argomenti relativi a WebAssembly (WASM), come il suo potenziale come runtime per lo sviluppo web, i problemi di compatibilità del linguaggio, i problemi di sicurezza, la portabilità, le differenze di prestazioni rispetto a JavaScript e la necessità di migliorare le tecnologie web esistenti.",
      "Alcuni commentatori esprimono scetticismo sui limiti e gli svantaggi di WASM, mentre altri ne sottolineano i vantaggi in termini di sicurezza, flusso di controllo e conservazione del software.",
      "Le discussioni mostrano una combinazione di entusiasmo e cautela riguardo all'uso di WASM in diverse applicazioni e ambienti."
    ],
    "points": 182,
    "commentCount": 120,
    "retryCount": 0,
    "time": 1702316666
  },
  {
    "id": 38606146,
    "title": "Espansione delle dichiarazioni SQL con 'RESULTDB': Sbloccare il potenziale di restituzione di un database",
    "originLink": "https://arxiv.org/abs/2312.00638",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38606146",
    "commentBody": "",
    "originSummary": [
      "Il documento suggerisce di rimuovere la limitazione delle istruzioni SQL che consente di restituire solo una singola tabella.",
      "Gli autori propongono di estendere la clausola SELECT di SQL con la parola chiave \"RESULTDB\" per consentire la restituzione di un database di risultati.",
      "I vantaggi di questo approccio, come la semplificazione del codice dell'applicazione, il miglioramento delle prestazioni delle query, la riduzione delle dimensioni dei risultati delle query e l'accelerazione dei tempi di trasferimento dei risultati delle query, sono stati evidenziati."
    ],
    "commentSummary": [
      "Il documento esamina l'idea di restituire un database come risultato di un'istruzione SQL e ne esplora i potenziali vantaggi e le sfide.",
      "Gli argomenti trattati comprendono la mappatura oggetto-relazionale, le prestazioni delle query, l'unione di dati correlati, le strutture JSON annidate e i limiti dell'SQL.",
      "I partecipanti evidenziano i potenziali vantaggi, come il miglioramento delle prestazioni e la semplificazione delle query complesse, nonché la riduzione del carico sul database. Vengono inoltre esaminati la terminologia, il reperimento di dati gerarchici e la fattibilità della restituzione di un database come istruzione SQL."
    ],
    "points": 181,
    "commentCount": 101,
    "retryCount": 0,
    "time": 1702332352
  },
  {
    "id": 38600031,
    "title": "Legno trasparente: Una svolta per gli schermi degli smartphone e le finestre isolate",
    "originLink": "https://arstechnica.com/science/2023/12/why-scientists-are-making-transparent-wood/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38600031",
    "commentBody": "",
    "originSummary": [
      "Gli scienziati stanno creando un materiale di legno trasparente per varie applicazioni, tra cui schermi di smartphone e finestre isolate.",
      "Il legno viene reso trasparente eliminando i pigmenti delle cellule vegetali e può essere rinforzato con resina epossidica per una maggiore resistenza.",
      "Il legno trasparente è più forte e resistente della plastica e del vetro e può rappresentare un'alternativa sostenibile e durevole per diversi prodotti."
    ],
    "commentSummary": [
      "Il legno trasparente è un materiale creato sostituendo la lignina del legno con la resina epossidica, di cui si discute lo sviluppo e le potenziali applicazioni.",
      "Gli argomenti trattati includono le sfide della genitorialità, l'efficienza e la sostenibilità dei materiali per i vetri delle finestre, la riciclabilità e l'idoneità del legno trasparente per varie applicazioni, le tecniche di voiceover utilizzate da uno YouTuber, le sfide per aumentare i tassi di riciclaggio del vetro negli Stati Uniti e il confronto con altri materiali come il vetro e la plastica.",
      "Si parla anche di altri materiali, come la poliaramide, e dell'importanza di utilizzare nomi precisi per i nuovi materiali."
    ],
    "points": 167,
    "commentCount": 129,
    "retryCount": 0,
    "time": 1702297860
  },
  {
    "id": 38602786,
    "title": "Le preoccupazioni di un avvocato statunitense sugli effetti dannosi delle scommesse sportive e sulla necessità di una regolamentazione",
    "originLink": "https://www.ft.com/content/497fdb45-fe81-4b13-97d0-70abe667b94f",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38602786",
    "commentBody": "",
    "originSummary": [
      "L'articolo contiene un'intervista a un importante avvocato statunitense che in passato ha perseguito l'industria del tabacco e ora è coinvolto nella questione delle scommesse sportive.",
      "L'avvocato esprime preoccupazione per i potenziali impatti negativi della diffusione delle scommesse sportive e sottolinea l'importanza di una regolamentazione a tutela dei consumatori.",
      "Si discute anche dell'influenza dell'industria del gioco d'azzardo sulla politica e della necessità di educare il pubblico sui rischi associati al gioco d'azzardo."
    ],
    "commentSummary": [
      "La discussione copre un'ampia gamma di argomenti riguardanti l'industria del gioco d'azzardo, come le preoccupazioni per gli aspetti predatori delle scommesse sportive e il divieto di vincite costanti.",
      "Altri argomenti includono i pro e i contro della legalizzazione e della regolamentazione, l'impatto sulle famiglie e sulla società, la moralità della pubblicità e il confronto con altre industrie regolamentate.",
      "La conversazione tocca anche la natura di dipendenza del gioco d'azzardo, la regolamentazione delle loot crates nei videogiochi, l'influenza della pubblicità sul fumo e sul vaping e la corruzione nello sport."
    ],
    "points": 166,
    "commentCount": 186,
    "retryCount": 0,
    "time": 1702316767
  }
]
