[
  {
    "id": 37985176,
    "title": "Software desencantado",
    "originLink": "https://tonsky.me/blog/disenchantment/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37985176",
    "commentBody": "",
    "originSummary": [
      "El autor critica la ineficacia de la industria del software, señalando problemas de lentitud e hinchazón del software. Expresan su preocupación por la práctica de dar prioridad a un hardware más rápido frente a la optimización del software.",
      "El autor aboga por mejorar la arquitectura del software y las prácticas de programación, haciendo hincapié en la estabilidad y la calidad, como respuesta a los errores y la inestabilidad observados en las aplicaciones web.",
      "Con el objetivo de iniciar el debate y la mejora en la industria, el autor apoya la contribución y adopción de proyectos de código abierto para mejorar las soluciones informáticas."
    ],
    "commentSummary": [
      "El artículo plantea cuestiones relativas al impacto de los incentivos financieros, las presiones del mercado y la financiación de capital riesgo en la calidad del software, en el contexto de la presión por lanzar productos con rapidez.",
      "Analiza las compensaciones entre rentabilidad y calidad del software, haciendo hincapié en aspectos como la complejidad, el rendimiento, la prevalencia de errores y los retos de utilizar lenguajes como C++.",
      "El artículo también cuestiona la priorización de la eficiencia del desarrollador sobre la eficiencia del usuario, con mención específica a la falta de motivación económica para abstenerse de utilizar Docker para el despliegue."
    ],
    "points": 526,
    "commentCount": 390,
    "retryCount": 0,
    "time": 1698067043
  },
  {
    "id": 37990031,
    "title": "Google tira de la escalera de la Internet abierta e impulsa una normativa inconstitucional",
    "originLink": "https://www.techdirt.com/2023/10/23/google-decides-to-pull-up-the-ladder-on-the-open-internet-pushes-for-unconstitutional-regulatory-proposals/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37990031",
    "commentBody": "",
    "originSummary": [
      "Google ha establecido un nuevo marco político destinado a proteger a los menores en Internet, introduciendo medidas como la verificación de la edad y una mayor supervisión parental.",
      "Los críticos afirman que esta política podría afectar negativamente a las pequeñas empresas y restringir la libertad en Internet, lo que refleja la preocupación por las motivaciones empresariales y las posibles influencias políticas.",
      "La conversación también se extiende a temas como los contenidos NSFW, la regulación gubernamental y la censura en las redes sociales, mientras que otras noticias tecnológicas informan sobre la resolución de un pleito de marcas, la anulación de una multa y los planes para la banda ancha en toda la ciudad."
    ],
    "commentSummary": [
      "El debate detalla temas relacionados con la regulación de la web y la seguridad infantil, destacando la preocupación por las posibles acciones censoras de Google a través de navegadores seguros.",
      "Entre las sugerencias para proteger a los niños en línea figuran la puesta en marcha de una configuración de \"contenidos seguros\" en los sistemas operativos, la obligatoriedad de filtros parentales de Internet y la verificación de la seguridad de los sitios web infantiles.",
      "También se plantean retos notables en la aplicación de estas soluciones, que abarcan aspectos relacionados con las medidas de verificación de la edad, las certificaciones de los sitios web y el equilibrio entre la tecnología y otros factores sociales."
    ],
    "points": 338,
    "commentCount": 238,
    "retryCount": 0,
    "time": 1698087495
  },
  {
    "id": 37993575,
    "title": "Lector SumatraPDF",
    "originLink": "https://github.com/sumatrapdfreader/sumatrapdf",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37993575",
    "commentBody": "",
    "originSummary": [
      "SumatraPDF es un lector de código abierto que soporta múltiples formatos de archivo como PDF, EPUB, MOBI, CBZ y más.",
      "Disponible para Windows, funciona bajo las licencias (A)GPLv3 y BSD.",
      "Cuenta con una presencia significativa en GitHub, con más de 11.000 estrellas, 1,6 horquillas y contribuciones de 48 colaboradores diversos."
    ],
    "commentSummary": [
      "El hilo se centra en los méritos e inconvenientes de SumatraPDF Reader, posicionándolo como una alternativa a Adobe Acrobat para el procesamiento de PDF. Esto incluye su compatibilidad con plataformas, su ligereza y sus recientes mejoras.",
      "La conversación también aborda la necesidad de herramientas de edición de PDF de código abierto sin fisuras y los retos que plantea el análisis sintáctico y la renderización de archivos PDF, lo que indica la complejidad de los flujos de trabajo en PDF.",
      "Aunque SumatraPDF es alabado por su rendimiento y facilidad para navegar por las páginas, los usuarios han encontrado problemas con la impresión y la congelación en Mac. También se desean funciones adicionales como la posibilidad de arrastrar pestañas a nuevas ventanas."
    ],
    "points": 330,
    "commentCount": 148,
    "retryCount": 0,
    "time": 1698107895
  },
  {
    "id": 37990990,
    "title": "Mazda abofetea a un desarrollador con una orden de cese y desistimiento por la integración de bricolaje en el hogar inteligente",
    "originLink": "https://www.thedrive.com/news/mazda-slaps-developer-with-cease-and-desist-for-diy-smart-home-integration",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37990990",
    "commentBody": "",
    "originSummary": [
      "Mazda emitió una orden de cese y desistimiento a un desarrollador que creó un código de fuente abierta que mejoraba la funcionalidad de los coches Mazda, declarando que violaba los derechos de autor y replicaba funciones existentes.",
      "El desarrollador acató la orden para evitar acciones legales, lo que ha provocado la decepción de los propietarios de Mazda que utilizaban el código para elevar su experiencia de conducción.",
      "Este incidente suscita debates sobre el equilibrio entre la ciberseguridad, las leyes de derechos de autor y el concepto de uso legítimo, junto con la posible indiferencia de un fabricante de automóviles ante las preferencias de los clientes por la personalización y la autonomía de sus vehículos."
    ],
    "commentSummary": [
      "Mazda se ha enfrentado a incidentes polémicos debido a su reticencia a permitir la personalización y el acceso de terceros a sus vehículos, enviando cartas de cese y desistimiento y avisos de retirada de DMCA a los desarrolladores que crearon diversas integraciones.",
      "La empresa automovilística justificó sus acciones alegando razones legales, de seguridad y de derechos de autor, pero los críticos sostienen que está limitando la personalización por motivos de beneficio y responsabilidad.",
      "El debate subraya las dificultades de la interoperabilidad y la disminución del sentido de propiedad en el mundo digital, con comentarios que expresan el descontento con la DMCA y sugieren formas alternativas de salvaguardar a los desarrolladores y el código de fuente abierta."
    ],
    "points": 292,
    "commentCount": 155,
    "retryCount": 0,
    "time": 1698092326
  },
  {
    "id": 37983903,
    "title": "Una mujer gana una batalla legal de 12 años contra Google",
    "originLink": "https://www.abc.net.au/news/2023-10-23/janice-duffy-wins-12-year-legal-battle-against-google/103008954",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37983903",
    "commentBody": "",
    "originSummary": [
      "La Dra. Janice Duffy, de Adelaida, concluyó su lucha legal de 12 años contra Google, tras ganar dos demandas por difamación contra el gigante tecnológico.",
      "El caso se centró en la publicación por parte de Google de contenido difamatorio de un sitio web en su página del motor de búsqueda, incluso después de que Duffy solicitara la retirada del contenido.",
      "Aunque los detalles del acuerdo son confidenciales, este caso subraya la tensión emocional y financiera de tales procedimientos y puede conducir a una mayor responsabilidad de las empresas de motores de búsqueda para vigilar más de cerca sus contenidos."
    ],
    "commentSummary": [
      "Una mujer ha ganado un pleito de 12 años contra Google por sugerencias difamatorias de autocompletar, determinando la responsabilidad de Google por estas sugerencias y estableciendo un precedente para su eliminación previa notificación.",
      "Varios casos, incluido otro en Australia, reflejan el debate en curso sobre la responsabilidad de los motores de búsqueda por contenidos difamatorios, el \"derecho al olvido\" y el equilibrio entre la libertad de expresión y la protección de la reputación.",
      "El debate se extiende a cuestiones de antecedentes penales públicos y privacidad, cuestionando además la responsabilidad y regulación de los motores de búsqueda en el tratamiento de contenidos potencialmente difamatorios."
    ],
    "points": 264,
    "commentCount": 183,
    "retryCount": 0,
    "time": 1698058210
  },
  {
    "id": 37984404,
    "title": "Implementación en Java de un algoritmo criptográfico resistente a la computación cuántica",
    "originLink": "https://github.com/mthiim/dilithium-java",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37984404",
    "commentBody": "",
    "originSummary": [
      "Este texto analiza una implementación en Java del algoritmo Dilithium, una alternativa criptográfica post-cuántica a RSA (Rivest-Shamir-Adleman) y ECC (Elliptic-curve cryptography).",
      "Esta implementación soporta tres niveles de seguridad e incluye funciones para generar claves, firmar, verificar, así como serializar/deserializar claves.",
      "Se indica explícitamente que esta implementación no está pensada para su uso en producción y no ofrece ninguna garantía, pero el código es de libre acceso bajo la licencia Apache 2.0."
    ],
    "commentSummary": [
      "El artículo se centra en el desarrollo de un algoritmo criptográfico resistente a la cuántica en Java, haciendo hincapié en la ausencia actual de bibliotecas listas para la producción y en las perspectivas prometedoras.",
      "Se debaten los retos de la protección de datos a largo plazo y los riesgos potenciales asociados a la aplicación de estos nuevos algoritmos debido al avance de la computación cuántica.",
      "El cifrado híbrido, una combinación de criptografía post-cuántica y tradicional, se sugiere como posible solución, aunque con dudas sobre su fiabilidad y efectos en monedas digitales como Bitcoin."
    ],
    "points": 248,
    "commentCount": 48,
    "retryCount": 0,
    "time": 1698062052
  },
  {
    "id": 37987573,
    "title": "El Gobierno británico vigila las redes sociales de los profesores asistentes",
    "originLink": "https://reclaimthenet.org/uk-government-caught-surveilling-social-media-of-teaching-assistants-and-librarians",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37987573",
    "commentBody": "",
    "originSummary": [
      "El Ministerio de Educación británico ha estado vigilando y documentando la actividad en las redes sociales de los educadores que expresan críticas a las políticas educativas.",
      "Estos registros podrían tener repercusiones potenciales en la carrera profesional de los asistentes de enseñanza, bibliotecarios, entre otros educadores.",
      "Las medidas de vigilancia se extienden más allá de los meros educadores, con intentos de acallar a los críticos con las políticas del gobierno. El Ministerio aún no ha hecho comentarios sobre casos concretos."
    ],
    "commentSummary": [
      "Al parecer, el gobierno británico está controlando las cuentas en las redes sociales de los auxiliares docentes, lo que ha suscitado debates en torno a la privacidad y la libertad de expresión.",
      "Los críticos consideran que la vigilancia y las supuestas medidas punitivas contra quienes critican las políticas del gobierno son una extralimitación.",
      "Las discusiones en el hilo también abordan la postura de la nación respecto a los derechos a la intimidad y a la libertad de expresión frente a su énfasis en la vigilancia, y la necesidad de cámaras de vigilancia para la seguridad nacional, reflejando opiniones divergentes."
    ],
    "points": 226,
    "commentCount": 115,
    "retryCount": 0,
    "time": 1698076732
  },
  {
    "id": 37988483,
    "title": "Cleveland lanza un plan para ofrecer banda ancha barata",
    "originLink": "https://www.techdirt.com/2023/10/23/tired-of-being-ripped-off-by-monopolies-cleveland-launches-ambitious-plan-to-provide-citywide-dirt-cheap-broadband/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37988483",
    "commentBody": "",
    "originSummary": [
      "Cleveland está invirtiendo 20 millones de dólares en ayudas COVID para una banda ancha asequible y se ha asociado con SiFi Networks para establecer una red de fibra de 500 millones de dólares gratuita para los contribuyentes.",
      "Estas iniciativas pretenden desafiar el dominio de grandes ISP, como AT&T y Charter, que con frecuencia han pasado por alto zonas de bajos ingresos y minorías.",
      "Aunque las redes de banda ancha de propiedad comunitaria podrían reducir los costes y aumentar la competencia, entre los posibles obstáculos figuran las demandas de los proveedores existentes."
    ],
    "commentSummary": [
      "Cleveland ha puesto en marcha un nuevo servicio de banda ancha asequible y de alta velocidad, contribuyendo así al debate más amplio sobre las iniciativas municipales de banda ancha y el control gubernamental de las conexiones de red.",
      "Esta iniciativa ha suscitado un debate en torno a las ventajas e inconvenientes del control gubernamental de la red, en el que algunos lo ven como un medio para mejorar el servicio y la transparencia, mientras que otros expresan su preocupación por un posible abuso de poder.",
      "Este debate subraya la necesidad de aumentar la competencia en el mercado de la banda ancha y el papel del gobierno para garantizar un acceso asequible a la banda ancha, como demuestran las frustraciones en Baltimore por los altos precios de Comcast y la falta de competencia."
    ],
    "points": 222,
    "commentCount": 79,
    "retryCount": 0,
    "time": 1698080723
  },
  {
    "id": 37991295,
    "title": "¿Cómo gestiona macOS los núcleos virtuales en Apple Silicon?",
    "originLink": "https://eclecticlight.co/2023/10/23/how-does-macos-manage-virtual-cores-on-apple-silicon/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37991295",
    "commentBody": "",
    "originSummary": [
      "Este artículo trata de la gestión de núcleos virtuales por macOS en los chips de silicio de Apple, introduciendo dos tipos de núcleos de CPU: Núcleos de Eficiencia (E) y Núcleos de Rendimiento (P).",
      "macOS asigna estos núcleos según la configuración de calidad de servicio (QoS) de una app, determinando cómo pueden utilizarse los núcleos para optimizar el rendimiento de la app.",
      "En él se analizan los problemas que plantea el uso de máquinas virtuales (VM) en hosts de silicio Apple, a saber, la incapacidad de asignar núcleos de forma eficaz y la falta de ventajas asociadas en materia de eficiencia energética."
    ],
    "commentSummary": [
      "El artículo analiza cómo macOS gestiona los núcleos virtuales en su Apple Silicon y cómo AMD y ARM implementan el procesamiento big-little, lo que sugiere un debate sobre la preparación de la industria tecnológica para la informática heterogénea.",
      "Destaca el importante papel de los programadores del sistema operativo (SO) a la hora de determinar la asignación de núcleos; esto podría estar relacionado con problemas como el rendimiento de los juegos y los problemas de Docker en macOS.",
      "El artículo también aborda las afinidades de los hilos en programas de espacio de usuario, la gestión de marcadores y pestañas en navegadores web, el uso de grupos de pestañas en Chrome y la capacidad de las FPGA en procesadores especializados, destacando la eficiencia de la arquitectura de núcleo."
    ],
    "points": 207,
    "commentCount": 140,
    "retryCount": 0,
    "time": 1698093739
  },
  {
    "id": 37989875,
    "title": "Cómo correr un 50% más rápido sin energía externa (2020)",
    "originLink": "https://www.science.org/doi/10.1126/sciadv.aay1950",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37989875",
    "commentBody": "",
    "originSummary": [
      "Un estudio demuestra que un dispositivo exoesquelético similar a una catapulta puede mejorar la velocidad de carrera en más de un 50%, lo que significa el potencial de los exoesqueletos robóticos sin motor para mejorar el rendimiento humano.",
      "Los investigadores proponen un enfoque innovador con muelles de rigidez variable fijados a las extremidades, que podrían permitir a los humanos superar la velocidad natural de carrera.",
      "Los debates sobre los requisitos físicos y las limitaciones de la carrera aumentada indican la necesidad de más innovaciones de ingeniería para los exoesqueletos de carrera. Además, los diversos artículos y patentes mencionados ofrecen multitud de fuentes para ampliar la investigación sobre esta tecnología."
    ],
    "commentSummary": [
      "El artículo profundiza en la idea de utilizar dispositivos con muelles para mejorar la velocidad y la eficacia de la carrera, analizando modelos populares como las zapatillas Nike Vaporfly y Alphafly.",
      "Analiza los posibles tratamientos de la fascitis plantar, una dolorosa afección del pie que afecta a muchos deportistas.",
      "El artículo debate además la validez de subirse a los pedales para mejorar el rendimiento ciclista y hace referencia a un estudio sobre la mejora de la eficiencia al correr fijando muelles a los pies."
    ],
    "points": 207,
    "commentCount": 152,
    "retryCount": 0,
    "time": 1698086767
  },
  {
    "id": 37993702,
    "title": "1Password detecta \"actividad sospechosa\" en su cuenta interna de Okta",
    "originLink": "https://arstechnica.com/security/2023/10/1password-detects-suspicious-activity-in-its-internal-okta-account/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37993702",
    "commentBody": "",
    "originSummary": [
      "1Password, un gestor de contraseñas, ha detectado actividad sospechosa en una cuenta interna proporcionada por Okta, un servicio de identidad y autenticación que recientemente sufrió una brecha de seguridad.",
      "A pesar de la actividad sospechosa, 1Password confirmó que no hubo violación de los datos de los usuarios ni de los sistemas vulnerables; se está investigando cómo accedió el atacante a la cuenta.",
      "Este incidente es el segundo ataque dirigido conocido contra un cliente de Okta e insinúa la posibilidad de que haya más clientes implicados en un futuro próximo."
    ],
    "commentSummary": [
      "El sumario ahonda en una brecha de seguridad en las cuentas internas de Okta, encendiendo las preocupaciones sobre las medidas de seguridad implementadas por la compañía.",
      "En la conversación se debate a fondo sobre los méritos y deméritos de la gestión de contraseñas a través de servicios en línea, las complejidades de las vulnerabilidades del software, y se sopesa el autoalojamiento frente al uso de proveedores de identidad de terceros.",
      "Llama la atención sobre una brecha de seguridad a través de Okta que afecta a 1Password, un gestor de contraseñas ampliamente utilizado, promoviendo un debate sobre la necesidad de una bóveda descentralizada para la gestión de contraseñas y la crítica a la autenticación centralizada."
    ],
    "points": 191,
    "commentCount": 93,
    "retryCount": 0,
    "time": 1698108956
  },
  {
    "id": 37991746,
    "title": "Marcel la Concha",
    "originLink": "https://www.marceltheshell.org",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37991746",
    "commentBody": "",
    "originSummary": [
      "Marcel es un shell contemporáneo que mejora la composición mediante la canalización de valores Python en lugar de cadenas.",
      "Permite a los usuarios pasar entre comandos tipos incorporados y objetos que representan archivos y procesos.",
      "En su tutorial se puede obtener más información y orientación para el usuario."
    ],
    "commentSummary": [
      "La comunidad tecnológica está debatiendo activamente la necesidad de un nuevo shell en Linux, con propuestas como PowerShell y Marcel.",
      "Marcel emerge como un punto focal en la discusión; es un shell basado en Python conocido por sus atributos de fácil uso y compatibilidad con objetos Python.",
      "Los usuarios muestran curiosidad por el empaquetado de Marcel para Nix y aconsejan mejoras para el sitio web de Marcel, lo que indica una participación activa y un interés compartido en el desarrollo del proyecto."
    ],
    "points": 187,
    "commentCount": 121,
    "retryCount": 0,
    "time": 1698095985
  },
  {
    "id": 37985777,
    "title": "RSU 2.0 - Simulacro de trabajador de servicios",
    "originLink": "https://mswjs.io/blog/introducing-msw-2.0/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37985777",
    "commentBody": "",
    "originSummary": [
      "El autor presenta MSW 2.0, una importante actualización de la biblioteca Mock Service Worker, que incluye mejoras significativas como una API pública refinada junto con el soporte de primitivas de la API Fetch.",
      "La actualización deja obsoleta la necesidad de polyfills y mejora la compatibilidad con Node.js, haciendo que los gestores de peticiones de MSW sean más reutilizables y adaptables.",
      "La versión incluye no sólo correcciones de errores y mejoras, sino también algunos cambios de última hora; no obstante, se facilitan directrices detalladas para la migración. El autor expresa su sincero agradecimiento a los colaboradores y anima a seguir patrocinando el proyecto para impulsar su desarrollo en el futuro."
    ],
    "commentSummary": [
      "El post gira en torno a las experiencias beneficiosas con MSW (Mock Service Worker) y OpenAPI en el desarrollo web, incluyendo la mejora de la productividad y la simplificación del proceso de desarrollo.",
      "Los usuarios alaban la capacidad de MSW para generar código y crear API simuladas, lo que agiliza su flujo de trabajo.",
      "Otra característica única y apreciada es la capacidad de MSW para ejecutar el servidor simulado tanto en entornos de navegador como de servidor."
    ],
    "points": 180,
    "commentCount": 52,
    "retryCount": 0,
    "time": 1698069707
  },
  {
    "id": 37985450,
    "title": "¿Se publicó alguna vez la autopsia de Starfighter?",
    "originLink": "https://news.ycombinator.com/item?id=37985450",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37985450",
    "commentBody": "",
    "originSummary": [
      "Starfighter, una empresa de contratación fundada por veteranos de la HN, utilizó una prueba del estilo CTF/Microcorrupción para la contratación.",
      "Lamentablemente, la empresa ha cerrado. Las razones de este cierre siguen sin especificarse, ya que no parece haberse redactado ningún análisis post mortem.",
      "El uso de una prueba del estilo de Capture The Flag (CTF) o Microcorrupción en la contratación es un enfoque innovador, que demuestra la perspectiva única de la empresa en el proceso de contratación."
    ],
    "commentSummary": [
      "El debate gira en torno a los retos del proceso de contratación en la industria tecnológica, citando problemas de fiabilidad de las credenciales y la ineficacia de ciertos métodos de selección.",
      "Los participantes insisten en la necesidad de métodos de evaluación alternativos, destacando la importancia de las recomendaciones personales y la experiencia previa en la evaluación de los candidatos.",
      "El debate saca a relucir la posibilidad de programas de aprendizaje y cambios en el proceso de contratación para que se corresponda mejor con los puestos directivos, reflexionando sobre las dificultades a las que se enfrentan las nuevas empresas del sector."
    ],
    "points": 178,
    "commentCount": 141,
    "retryCount": 0,
    "time": 1698068387
  },
  {
    "id": 37995119,
    "title": "La NASA acaba de enviar una actualización de software a una nave espacial a 12B millas de distancia",
    "originLink": "https://bgr.com/science/nasa-just-sent-a-software-update-to-a-spacecraft-12-billion-miles-away/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37995119",
    "commentBody": "",
    "originSummary": [
      "La NASA ha transmitido una actualización de software a la Voyager 2, situada a más de 12.000 millones de kilómetros de la Tierra, con la esperanza de evitar los mismos problemas a los que se enfrentó la Voyager 1 el año pasado.",
      "La actualización, que tardó 18 horas en concluirse, pretende ser una póliza de seguro para prolongar la vida útil de la sonda.",
      "La NASA tiene previsto utilizar la Voyager 2 como prueba. Si tiene éxito, se aplicará el mismo parche a la Voyager 1."
    ],
    "commentSummary": [
      "La NASA ha transmitido con éxito una actualización de software a la nave espacial Voyager 2, situada a 12.000 millones de kilómetros de la Tierra, lo que demuestra la destreza de la ingeniería y el trabajo en equipo de esta misión de 50 años de duración.",
      "No se ha revelado la naturaleza específica de la actualización ni su tamaño, pero se ha señalado que Voyager 2 funciona en ordenadores hechos a medida con memoria limitada, lo que indica importantes retos técnicos.",
      "El post subraya el impresionante mantenimiento en curso de la nave Voyager 2 después de 40 años e introduce un debate más amplio relacionado con el espacio que incluye las capacidades de la NASA y comparaciones con otras entidades como SpaceX."
    ],
    "points": 169,
    "commentCount": 97,
    "retryCount": 0,
    "time": 1698125632
  }
]
