[
  {
    "id": 41286203,
    "title": "سلاسل ماركوف أكثر إضحاكًا من نماذج اللغة الكبيرة",
    "originLink": "https://emnudge.dev/blog/markov-chains-are-funny/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41286203",
    "commentBody": "",
    "originSummary": [
      "سلاسل ماركوف هي نماذج إحصائية بسيطة تتنبأ بالكلمة التالية بناءً على السياق، على عكس نماذج اللغة الكبيرة المعقدة (LLMs) التي تستخدم رياضيات المتجهات المتقدمة.",
      "على الرغم من دقتها، فإن نماذج اللغة الكبيرة غالبًا ما تنتج محتوى متوقعًا ومملًا، مما يجعلها أقل فعالية في مجال الفكاهة الذي يعتمد على المفاجأة والأصالة.",
      "تشير المناقشة إلى أنه قد يكون هناك حاجة إلى نوع جديد من نماذج اللغة لتوليد محتوى فكاهي حقيقي، مما يبرز قيدًا حاليًا في نماذج اللغة الكبيرة."
    ],
    "commentSummary": [
      "تسلط المناقشة الضوء على الفروق الطريفة بين سلاسل ماركوف والنماذج اللغوية الكبيرة الحديثة (LLMs)، حيث تولد سلاسل ماركوف محتوى أكثر غرابة وفكاهة مقارنة بالمخرجات الأكثر واقعية للنماذج اللغوية الكبيرة.",
      "شارك المستخدمون تجاربهم الشخصية ومشاريعهم التي استخدموا فيها سلاسل ماركوف لإنشاء محتوى مزيف مسلي، مثل منشورات مدونة AWS المزيفة وملاحظات تحديثات الألعاب، والتي لاقت استحسانًا كبيرًا بسبب عدم توقعها.",
      "تتضمن المشاركة سلسلة من النكات التي أنشأها كلود 3.5، وهو نموذج لغوي كبير، توضح التباين في أساليب الفكاهة بين سلاسل ماركوف والنماذج اللغوية الكبيرة، حيث تكون الأولى أكثر عبثية والأخيرة أكثر تنظيمًا وأقل مفاجأة."
    ],
    "points": 447,
    "commentCount": 203,
    "retryCount": 0,
    "time": 1724021557
  },
  {
    "id": 41287099,
    "title": "روبلوكس هي أكبر لعبة في العالم، لكنها غير مربحة",
    "originLink": "https://www.matthewball.co/all/roblox2024",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41287099",
    "commentBody": "",
    "originSummary": [
      "روبلوكس، أكبر لعبة في العالم، تضم أكثر من 80 مليون مستخدم يوميًا و380 مليون مستخدم شهريًا، لكنها لا تزال غير مربحة على الرغم من نموها.",
      "التكاليف العالية، بما في ذلك رسوم متجر التطبيقات (23%)، مدفوعات المطورين (26%)، البنية التحتية والسلامة (28%)، والبحث والتطوير (44%)، تساهم في تحدياته المالية.",
      "لتحقيق الربحية، تهدف روبلوكس إلى تقليل رسوم متجر التطبيقات، وزيادة إنفاق المستخدمين، وتوسيع أعمالها الإعلانية، وتقديم ميزات جديدة مثل الرسائل والمكالمات الصوتية."
    ],
    "commentSummary": [
      "رغم أن روبلوكس هي أكبر لعبة على مستوى العالم، إلا أنها لا تزال غير مربحة، مما يثير تساؤلات حول استراتيجياتها المالية وموقعها في السوق.",
      "تشمل مخاوف الآباء نموذج الدفع للفوز في اللعبة، والإعلانات المكثفة، ووجود البالغين السامين، مما يبرز التحديات في تنظيم بيئات الألعاب عبر الإنترنت.",
      "تشير المناقشات إلى بدائل للأطفال، مثل شراء ألعاب أخرى أو تعزيز عادات لعب أكثر صحة، مما يعكس قضايا أوسع في صناعة الألعاب عبر الإنترنت."
    ],
    "points": 379,
    "commentCount": 450,
    "retryCount": 0,
    "time": 1724031956
  },
  {
    "id": 41286045,
    "title": "استغرقت جوجل ثلاثة أشهر لإزالة تطبيق احتيالي سرق أكثر من 5 ملايين دولار",
    "originLink": "https://www.theblock.co/post/311707/google-took-three-months-to-remove-scam-app-that-stole-over-5-million-in-crypto-lawsuit",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41286045",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "استغرقت جوجل ثلاثة أشهر لإزالة تطبيق احتيالي من متجر بلاي سرق أكثر من 5 ملايين دولار من المستخدمين.",
      "امرأة تقاضي جوجل، مدعية أنها وثقت في المنصة لمنع مثل هذه الاحتيالات وخسرت 5 ملايين دولار بعد استخدام التطبيق لعدة أشهر.",
      "تثير القضية مخاوف بشأن عمليات التحقق في متاجر التطبيقات وتوازن المسؤولية بين منصات التكنولوجيا والمستخدمين."
    ],
    "points": 347,
    "commentCount": 193,
    "retryCount": 0,
    "time": 1724019959
  },
  {
    "id": 41284703,
    "title": "PgQueuer – تحويل PostgreSQL إلى قائمة انتظار للمهام",
    "originLink": "https://github.com/janbjorge/PgQueuer",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41284703",
    "commentBody": "",
    "originSummary": [
      "PgQueuer هي مكتبة طوابير وظائف بايثون بسيطة وعالية الأداء مصممة للعمل مع PostgreSQL.",
      "يستخدم ميزة LISTEN/NOTIFY في PostgreSQL لإدارة قائمة المهام بكفاءة.",
      "يجعل هذا منها أداة بارزة للمطورين الذين يبحثون عن حل خفيف وفعال لجدولة المهام في تطبيقات بايثون."
    ],
    "commentSummary": [
      "PgQueuer هي مكتبة طوابير وظائف عالية الأداء للغة بايثون تستفيد من ميزة LISTEN/NOTIFY في PostgreSQL لإدارة الوظائف بكفاءة.",
      "يستخدم SELECT FOR UPDATE SKIP LOCKED لضمان معالجة المهام ومنع فقدان الرسائل أثناء الأعطال، مما يجعله قويًا وموثوقًا.",
      "يقارن المستخدمون بين PgQueuer وأنظمة أخرى مثل Celery وGraphile Worker والطوابير المستندة إلى Redis، مشيرين إلى بساطته وكفاءته، على الرغم من أن البعض يفضل الحلول المخصصة لتحقيق إنتاجية أعلى."
    ],
    "points": 335,
    "commentCount": 107,
    "retryCount": 0,
    "time": 1724008951
  },
  {
    "id": 41285851,
    "title": "مايك ماجيك قد توفي",
    "originLink": "https://fudzilla.com/news/59503-mike-mageek-is-dead",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41285851",
    "commentBody": "",
    "originSummary": [
      "مايك ماجي، شخصية بارزة في صحافة تكنولوجيا المعلومات ومؤسس موقعي The Register وThe Inquirer، توفي عن عمر يناهز 74 عامًا.",
      "تشمل أبرز محطات مسيرة ماجي تأسيسه لموقع The Register في عام 1994 ولاحقًا The Inquirer، الذي أصبح مربحًا باستثمار ضئيل.",
      "بعيدًا عن الصحافة التقنية، كان لدى ماجي اهتمامات متنوعة، بما في ذلك تأسيس \"النظام السحري الغامض لفرسان شامبالا\" وترجمة النصوص التانترية."
    ],
    "commentSummary": [
      "مايك ماجيك، مؤسس The Register وThe Inquirer، قد توفي، تاركًا إرثًا كبيرًا في صحافة التكنولوجيا.",
      "اشتهر بأسلوبه الفريد ومساهماته، تضمنت مسيرة ماجيك ذكريات لا تُنسى وتوجيه الكُتّاب، مما شكّل مشهد أخبار التكنولوجيا.",
      "على الرغم من الجدل، فإن تأثير Mageek على صناعة التكنولوجيا يُذكر باعتزاز من قبل العديد في مجتمع التكنولوجيا."
    ],
    "points": 322,
    "commentCount": 60,
    "retryCount": 0,
    "time": 1724018186
  },
  {
    "id": 41289114,
    "title": "تحليل protobuf بسرعة 2+ جيجابايت/ثانية: كيف تعلمت حب استدعاءات الذيل في لغة C (2021)",
    "originLink": "https://blog.reverberate.org/2021/04/21/musttail-efficient-interpreters.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41289114",
    "commentBody": "",
    "originSummary": [
      "ميزة جديدة في مترجم Clang، باستخدام السمات `[[clang::musttail]]` أو `__attribute__((musttail))`، تضمن استدعاءات الذيل في لغات C وC++ وObjective-C، مما يعزز الأداء بشكل كبير.",
      "من خلال تطبيق تحسين استدعاء الذيل على تحليل protobuf، تم تحقيق سرعة تزيد عن 2 جيجابايت/ثانية، مما يزيد عن ضعف الرقم القياسي السابق.",
      "القيد الرئيسي هو قابلية النقل، حيث أن `musttail` هو امتداد غير قياسي، ولكن تُبذل جهود لمعالجة ذلك باستخدام الماكرو والسمات الأخرى."
    ],
    "commentSummary": [
      "تناقش المقالة استخدام استدعاءات الذيل في لغة C لتحقيق تحليل عالي السرعة لبيانات protobuf، حيث تصل السرعات إلى أكثر من 2 جيجابايت/ثانية.",
      "اقتراح لمعيار جديد للغة C، \"return goto (expression);\"، يهدف إلى تبسيط تنفيذ استدعاء الذيل من خلال ضمان انتهاء مدة حياة الكائنات المحلية، وتجنب التحليل الهروبي المكثف.",
      "تسلط المناقشة الضوء على التحديات والفوائد المتعلقة بتحسين استدعاء الذيل (TCO) في لغات البرمجة والهياكل المختلفة، بما في ذلك C وRust وWebAssembly (WASM)."
    ],
    "points": 275,
    "commentCount": 122,
    "retryCount": 0,
    "time": 1724056923
  },
  {
    "id": 41285046,
    "title": "ناسا تعترف بأنها لا تستطيع تحديد مخاطر مشاكل الدفع في مركبة ستارلاينر",
    "originLink": "https://arstechnica.com/space/2024/08/nasa-acknowledges-it-cannot-quantify-risk-of-starliner-propulsion-issues/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41285046",
    "commentBody": "",
    "originSummary": [
      "لا تستطيع ناسا تحديد المخاطر المرتبطة بمشاكل الدفع في مركبة ستارلاينر التابعة لشركة بوينغ، مما يؤخر القرار بشأن إعادة رواد الفضاء بوتش ويلمور وسوني ويليامز إلى الأرض أو تمديد إقامتهم في محطة الفضاء الدولية.",
      "ستارلاينر، التي واجهت مشاكل في المحركات وتسرب الهيليوم، تحتل موقعًا حيويًا للالتحام بمحطة الفضاء الدولية ويجب أن تخليه قبل مهمة دراجون القادمة لشركة سبيس إكس في 24 سبتمبر.",
      "على الرغم من تعافي بعض المحركات، لا تزال ناسا قلقة بشأن موثوقيتها لحرق إزالة المدار والدخول مجددًا، مع الحاجة إلى اتخاذ قرار بحلول أواخر أغسطس."
    ],
    "commentSummary": [
      "تعترف ناسا بأنها لا تستطيع تحديد كمية المخاطر المرتبطة بمشاكل الدفع في مركبة ستارلاينر التابعة لشركة بوينغ، مشددة على الحاجة إلى وجود مزودين موثوقين متعددين في المهمات الفضائية.",
      "لا يزال الجدل قائمًا حول ما إذا كان يجب الاستمرار في استخدام ستارلاينر لإعادة رواد الفضاء أم الاعتماد فقط على دراجون من سبيس إكس، مما يبرز مخاطر الاعتماد على مزود واحد.",
      "تؤكد هذه الحالة على أهمية وجود خيارات متنوعة وموثوقة لضمان نجاح وسلامة المهمات الفضائية."
    ],
    "points": 249,
    "commentCount": 336,
    "retryCount": 0,
    "time": 1724011780
  },
  {
    "id": 41292018,
    "title": "محطات الطاقة العملاقة وغير المنظمة في السحابة",
    "originLink": "https://berthub.eu/articles/posts/the-gigantic-unregulated-power-plants-in-the-cloud/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41292018",
    "commentBody": "",
    "originSummary": [
      "كشف هاكر هولندي عن ثغرات أمنية من خلال السيطرة على 4 ملايين منشأة للطاقة الشمسية، مما كشف عن مخاطر في البنية التحتية للطاقة في الاتحاد الأوروبي.",
      "الإدارة المركزية للألواح الشمسية، غالبًا من قبل شركات خارج أوروبا، تشكل خطرًا يتمثل في الإغلاق المتزامن، مما قد يؤدي إلى انهيار شبكة الكهرباء الأوروبية.",
      "يمكن أن تحسن توجيهات NIS2 للاتحاد الأوروبي وقانون المرونة السيبرانية الأمن، ولكن هناك حاجة إلى لوائح صريحة للتعامل مع مديري الألواح الشمسية كشركات طاقة، مما يضمن تنظيمهم مثل مزودي الطاقة الكبار."
    ],
    "commentSummary": [
      "تسلط المقالة الضوء على المخاطر الأمنية المرتبطة بالإدارة المركزية للألواح الشمسية والمحولات وغيرها من مصادر الطاقة المتجددة عبر خدمات السحابة، مما يجعلها عرضة للهجمات الإلكترونية.",
      "في هولندا، تولد الألواح الشمسية طاقة تعادل 25 محطة نووية متوسطة الحجم، لكن الإنتاج السنوي الفعلي للطاقة أقرب إلى 1.5 ضعف إنتاج محطة نووية متوسطة.",
      "تدور المناقشة حول ما إذا كان يجب استخدام القدرة الاسمية (أقصى إنتاج يمكن أن ينتجه النظام) أو الإنتاج الفعلي لتقييم المخاطر، مع التأكيد على الحاجة إلى تحسين اللوائح والممارسات الأمنية لحماية الشبكة."
    ],
    "points": 222,
    "commentCount": 93,
    "retryCount": 0,
    "time": 1724082319
  },
  {
    "id": 41287031,
    "title": "اعثر على فليبر الخاص بي – محاكي AirTag و SmartTag",
    "originLink": "https://github.com/MatthewKuKanich/FindMyFlipper",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41287031",
    "commentBody": "",
    "originSummary": [
      "تطبيق FindMy Flipper يعزز قدرات البلوتوث في جهاز FlipperZero، مما يمكنه من محاكاة Apple AirTag وSamsung SmartTag وTile Tracker.",
      "تشمل الميزات الرئيسية محاكاة العلامات، وتخصيص فترات بث المنارات وقوة الإرسال، وتشغيل فعال في الخلفية لتقليل استهلاك البطارية.",
      "يتيح التطبيق استنساخ العلامات الموجودة، وتوليد أزواج مفاتيح OpenHaystack لشبكة FindMy من Apple، وتتبع FlipperZero، مع توفير تعليمات مفصلة للتثبيت والتكوين."
    ],
    "commentSummary": [
      "FindMy Flipper هو مشروع محاكي AirTag وSmartTag متاح على GitHub، ويجذب اهتمامًا كبيرًا من مجتمع التكنولوجيا.",
      "تم إثارة مخاوف بشأن أمان إحدى التبعيات، وتحديدًا مكتبة مصادقة iCloud غير الآمنة التي قد تؤدي إلى حظر الحسابات من قبل شركة Apple.",
      "للمشروع تداعيات محتملة لتجاوز ميزات مكافحة التتبع الخاصة بشركة آبل من خلال التبديل بين عدة علامات، مما يجعله موضوعًا يثير اهتمام كل من هواة الأمن والمدافعين عن الخصوصية."
    ],
    "points": 213,
    "commentCount": 51,
    "retryCount": 0,
    "time": 1724031065
  },
  {
    "id": 41290409,
    "title": "تصنيف جميع ملفات الـ PDF على الإنترنت",
    "originLink": "https://snats.xyz/pages/articles/classifying_a_bunch_of_pdfs.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41290409",
    "commentBody": "",
    "originSummary": [
      "قام باحث بتصنيف مجموعة بيانات SafeDocs بالكامل، وهي مجموعة بحجم 8 تيرابايت تحتوي على 8.4 مليون ملف PDF، باستخدام مزيج من نماذج التعلم الآلي (ML) والتعلم العميق.",
      "حقق النموذج الأفضل أداءً، XGBoost embeddings، دقة بلغت 85.26% بعد ضبط المعاملات الفائقة، مما يوضح فعالية الجمع بين تقنيات التعلم الآلي التقليدية وتقنيات التعلم العميق.",
      "يسلط المشروع الضوء على الإمكانيات المتاحة لتصنيف النصوص على نطاق واسع ويوفر جميع مجموعات البيانات والشفرات على منصتي Huggingface وKaggle لمزيد من الاستكشاف."
    ],
    "commentSummary": [
      "تتناول المقالة تصنيف 500,000 ملف PDF، وليس جميع ملفات PDF على الإنترنت، كما قد يوحي العنوان بشكل مضلل.",
      "يستكشف المؤلف والمعلقون استخدام تضمينات نموذج اللغة الكبير (LLM) وتقنيات أخرى لتصنيف واستخراج البيانات من ملفات PDF.",
      "تسلط المحادثة الضوء على التحديات والإمكانات في التعامل مع مجموعات البيانات الكبيرة، حيث أشار بعض المستخدمين إلى أن 8 تيرابايت من ملفات PDF تُعتبر كمية كبيرة ولكنها ليست أكبر مجموعة متاحة على الإنترنت."
    ],
    "points": 191,
    "commentCount": 65,
    "retryCount": 0,
    "time": 1724070189
  },
  {
    "id": 41284873,
    "title": "الدماغ يحاكي الأفعال ونتائجها أثناء نوم حركة العين السريعة",
    "originLink": "https://www.biorxiv.org/content/10.1101/2024.08.13.607810v1",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41284873",
    "commentBody": "",
    "originSummary": [
      "تشير دراسة جديدة قبل الطباعة إلى أنه خلال نوم حركة العين السريعة (REM)، يقوم الدماغ بمحاكاة الأفعال ونتائجها عن طريق إصدار أوامر حركية لا يتم تنفيذها ولكن لها تأثيرات كما لو كانت قد نُفذت.",
      "تسلط الأبحاث الضوء على دور السقف العلوي في الفئران، الذي يصدر هذه الأوامر الحركية، مما يشير إلى أن الدماغ يستخدم نموذجه الداخلي لمحاكاة التفاعلات مع العالم أثناء النوم.",
      "تكتسب هذه الدراسة أهمية لأنها تقدم رؤى حول نشاط الدماغ أثناء نوم حركة العين السريعة وكيفية استخدامه للأحلام لمعالجة ومحاكاة التفاعلات في العالم الحقيقي."
    ],
    "commentSummary": [
      "تشمل مرحلة النوم بحركة العين السريعة (REM) محاكاة الدماغ للأفعال ونتائجها، مما قد يُعد الأفراد لمواقف الحياة الواقعية.",
      "يناقش المستخدمون كيف يمكن أن تكون الأحلام بمثابة محاكيات تدريبية للمواقف القصوى وتساعد في حل المشكلات المعقدة، مع اقتراح البعض إمكانية التحكم الخارجي في الأحلام.",
      "تُبرز المحادثة دور النوم في معالجة الذكريات الصادمة، وتحسين اتخاذ القرارات، وترسيخ التعلم والذاكرة."
    ],
    "points": 171,
    "commentCount": 52,
    "retryCount": 0,
    "time": 1724010513
  },
  {
    "id": 41287014,
    "title": "إريك شميدت حذف مقابلة ستانفورد",
    "originLink": "https://www.youtube.com/watch?v=3f6XM6_7pUE",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41287014",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "أثار حذف مقابلة إريك شميدت في ستانفورد جدلاً على موقع Hacker News، خاصة حول انتقاده لتوازن العمل والحياة في جوجل وتأثيره على التنافسية.",
      "تعليقات شميت المثيرة للجدل حول سرقة الملكية الفكرية وضرورة العمل في المكتب قد أثارت نقاشات حول تأثير العمل عن بُعد على الإنتاجية وثقافة جوجل.",
      "على الرغم من حذفه، فإن نص المقابلة متاح على GitHub وتم إعادة تحميله بشكل متكرر، مما يشير إلى اهتمام عام قوي."
    ],
    "points": 170,
    "commentCount": 125,
    "retryCount": 0,
    "time": 1724030864
  },
  {
    "id": 41284639,
    "title": "تخزين الموجهات",
    "originLink": "https://docs.anthropic.com/en/docs/build-with-claude/prompt-caching",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41284639",
    "commentBody": "",
    "originSummary": [
      "قدمت شركة Anthropic ميزة جديدة تسمى التخزين المؤقت للمطالبات (بيتا) لتحسين استخدام واجهة برمجة التطبيقات من خلال الاستئناف من بدايات محددة في المطالبات، مما يقلل من وقت المعالجة والتكاليف للمهام المتكررة.",
      "التخزين المؤقت للمطالبات مفيد بشكل خاص للمطالبات التي تحتوي على العديد من الأمثلة، والسياقات الكبيرة، والمهام المتكررة، والمحادثات الطويلة، مع فترة صلاحية للتخزين المؤقت تبلغ 5 دقائق.",
      "تشمل النماذج المدعومة كلود 3.5 سونيت وكلود 3.0 هايكو، مع كون تكلفة كتابة الرموز في الذاكرة المؤقتة أغلى بنسبة 25% وتكلفة قراءة الرموز من الذاكرة المؤقتة أرخص بنسبة 90% من تكلفة الرموز الأساسية المدخلة."
    ],
    "commentSummary": [
      "أنتروبيك قد قدمت ميزة جديدة تسمى التخزين المؤقت للمطالبات لنظام الذكاء الاصطناعي كلود، والتي تسمح بتخزين مؤقت لمطالبات النظام والأدوات ورسائل المستخدم لتقليل التكاليف والكمون.",
      "الميزة مفيدة بشكل خاص للتطبيقات التي تحتوي على استفسارات متكررة ومتكررة، حيث يمكنها خفض التكلفة بشكل كبير بنسبة تصل إلى 90% وتحسين أوقات الاستجابة.",
      "يُعتبر هذا التطور ملحوظًا لإمكانية تحسين كفاءة التطبيقات التي تتعامل مع العملاء والمحادثات المستمرة مع نماذج الذكاء الاصطناعي من خلال الحفاظ على السياق عبر طلبات متعددة في إطار زمني قصير."
    ],
    "points": 161,
    "commentCount": 61,
    "retryCount": 0,
    "time": 1724008467
  },
  {
    "id": 41287425,
    "title": "أرشفة \"مقهى الكمبيوتر الشهير\"",
    "originLink": "https://blog.archive.org/2024/08/19/archiving-the-famous-computer-cafe/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41287425",
    "commentBody": "",
    "originSummary": [
      "تم اكتشاف مجموعة من المقابلات من برنامج الراديو \"مقهى الكمبيوتر الشهير\" من الثمانينيات، وتم تحويلها إلى صيغة رقمية ورفعها على أرشيف الإنترنت.",
      "العرض، الذي بُث من عام 1983 إلى 1986، تضمن شخصيات تقنية بارزة مثل تيموثي ليري، دوغلاس آدامز، وبيل غيتس، حيث غطى أخبار صناعة الكمبيوتر ومراجعات المنتجات.",
      "استعاد الأرشيفي كاي سافيتز الأشرطة، وأطلق حملة تمويل جماعي على منصة GoFundMe من أجل رقمنتها، وقام بتحميل الحلقات، على الرغم من أن بعض المقابلات، بما في ذلك تلك مع راي برادبري وجين رودينبيري، لا تزال مفقودة."
    ],
    "commentSummary": [
      "أرشيف الإنترنت قد أتاح حلقات من برنامج \"مقهى الكمبيوتر الشهير\"، وهو برنامج إذاعي تقني بارز من الثمانينيات، يتضمن مقابلات مع شخصيات بارزة مثل بيل غيتس ودوغلاس آدامز.",
      "يمكن للمستخدمين الوصول إلى هذه الحلقات عبر موجز RSS، الذي يمكن استيراده إلى تطبيقات البودكاست، والاستماع إلى مناقشات تاريخية حول مواضيع مثل الذكاء الاصطناعي ورسومات الكمبيوتر.",
      "يتضمن الأرشيف مجموعة متنوعة من خيارات التشغيل، بما في ذلك مشغل مستنسخ من Winamp، مما يعزز التجربة الحنينية للمستمعين."
    ],
    "points": 122,
    "commentCount": 16,
    "retryCount": 0,
    "time": 1724036572
  },
  {
    "id": 41284549,
    "title": "قد تقوم شركة آبل بتنفيذ أمر رقابة على الشبكات الافتراضية الخاصة (VPN) في البرازيل",
    "originLink": "https://status.proton.me/incidents/0frlp8crn7kx",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41284549",
    "commentBody": "",
    "originSummary": [
      "يواجه المستخدمون في البرازيل صعوبات في تنزيل Proton VPN من متجر تطبيقات iOS، ربما بسبب مشاكل في المتجر نفسه أو احتمال وجود رقابة من قبل شركة Apple.",
      "كحل مؤقت، تقترح Proton استخدام النسخة التجريبية لنظام iOS عبر Testflight أو إعداد تكوين WireGuard يدوي للوصول إلى خوادم VPN الخاصة بهم.",
      "المشكلة خاصة بمنصة iOS في البرازيل؛ تظل Proton VPN وتطبيقات Proton الأخرى متاحة على المنصات الأخرى وغير متأثرة."
    ],
    "commentSummary": [
      "قد تكون شركة آبل تحظر بعض تطبيقات VPN في البرازيل بسبب متطلبات قانونية محتملة، مما يعكس إجراءات مماثلة في الصين وروسيا.",
      "تثير هذه الحالة مخاوف بشأن نقص البدائل لمستخدمي آبل، الذين يقتصرون على تثبيت التطبيقات فقط من متجر التطبيقات، على عكس مستخدمي أندرويد الذين يمكنهم تحميل التطبيقات من مصادر خارجية.",
      "يجادل النقاد بأن هذه القيود تحد من حرية المستخدم وأمانه، مما قد يؤدي إلى قضايا أوسع تتعلق بالرقابة والسيطرة، خاصة في المناطق الحساسة سياسياً."
    ],
    "points": 111,
    "commentCount": 96,
    "retryCount": 0,
    "time": 1724007873
  }
]
