[
  {
    "id": 41286203,
    "title": "Markov zincirleri, büyük dil modellerinden (LLM'lerden) daha eğlencelidir.",
    "originLink": "https://emnudge.dev/blog/markov-chains-are-funny/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41286203",
    "commentBody": "",
    "originSummary": [
      "Markov zincirleri, gelişmiş vektör matematiği kullanan karmaşık Büyük Dil Modellerinin (LLM'ler) aksine, bağlama dayalı olarak bir sonraki kelimeyi tahmin eden basit istatistiksel modellerdir.",
      "LLM'ler, doğru olmalarına rağmen, genellikle tahmin edilebilir ve sıradan içerikler üretirler, bu da onları sürpriz ve özgünlük üzerine kurulu olan mizah için daha az etkili kılar.",
      "Bu tartışma, gerçekten mizahi içerik oluşturmak için yeni bir tür dil modeline ihtiyaç duyulabileceğini öne sürerek, mevcut büyük dil modellerinin bir sınırlamasını vurgulamaktadır."
    ],
    "commentSummary": [
      "Bu tartışma, Markov zincirleri ile modern Büyük Dil Modelleri (LLM'ler) arasındaki mizahi farkları vurguluyor; Markov zincirleri daha saçma ve komik içerikler üretirken, LLM'lerin daha gerçekçi çıktılar ürettiğini belirtiyor.",
      "Kullanıcılar, Markov zincirlerinin eğlenceli sahte içerikler oluşturmak için kullanıldığı kişisel deneyimlerini ve projelerini paylaştılar. Örneğin, sahte AWS blog gönderileri ve oyun yama notları gibi içerikler, öngörülemezlikleri nedeniyle beğeni topladı.",
      "Yazı, Markov zincirleri ile LLM'ler arasındaki mizah tarzlarındaki farkı gösteren Claude 3.5 tarafından üretilen bir dizi şaka içeriyor. Markov zincirleri daha absürt, LLM'ler ise daha yapılandırılmış ve daha az şaşırtıcıdır."
    ],
    "points": 447,
    "commentCount": 203,
    "retryCount": 0,
    "time": 1724021557
  },
  {
    "id": 41287099,
    "title": "Roblox dünyadaki en büyük oyun, ancak kârsız",
    "originLink": "https://www.matthewball.co/all/roblox2024",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41287099",
    "commentBody": "",
    "originSummary": [
      "Roblox, dünyanın en büyük oyunu olup, günlük 80 milyondan fazla kullanıcıya ve aylık 380 milyon kullanıcıya sahip olmasına rağmen büyümesine rağmen kârlı değildir.",
      "Yüksek maliyetler, uygulama mağazası ücretleri (%23), geliştirici ödemeleri (%26), altyapı ve güvenlik (%28) ve Ar-Ge (%44) dahil olmak üzere, finansal zorluklarına katkıda bulunuyor.",
      "Kar elde etmek için Roblox, uygulama mağazası ücretlerini azaltmayı, kullanıcı harcamalarını artırmayı, reklam işini genişletmeyi ve mesajlaşma ve sesli arama gibi yeni özellikler sunmayı hedefliyor."
    ],
    "commentSummary": [
      "Roblox, dünya çapında en büyük oyun olmasına rağmen, kârlı olamıyor ve bu durum, finansal stratejileri ve pazar konumu hakkında soru işaretleri yaratıyor.",
      "Velilerin endişeleri arasında oyunun kazanmak için ödeme yapma modeli, yoğun reklamlar ve toksik yetişkinlerin varlığı yer alıyor, bu da çevrimiçi oyun ortamlarını denetlemede zorlukları vurguluyor.",
      "Çocuklar için alternatifler öneren tartışmalar, diğer oyunların satın alınması veya daha sağlıklı oyun alışkanlıklarının teşvik edilmesi gibi konuları ele alarak çevrimiçi oyun endüstrisindeki daha geniş sorunları yansıtıyor."
    ],
    "points": 379,
    "commentCount": 450,
    "retryCount": 0,
    "time": 1724031956
  },
  {
    "id": 41286045,
    "title": "Google, 5 milyon dolardan fazla çalan dolandırıcılık uygulamasını kaldırmak için üç ay bekledi.",
    "originLink": "https://www.theblock.co/post/311707/google-took-three-months-to-remove-scam-app-that-stole-over-5-million-in-crypto-lawsuit",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41286045",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Google, kullanıcılarından 5 milyon dolardan fazla çalan bir dolandırıcılık uygulamasını Play Store'dan kaldırmak için üç ay bekledi.",
      "Bir kadın, platformun bu tür dolandırıcılıkları önleyeceğine güvendiğini iddia ederek Google'a dava açıyor ve uygulamayı birkaç ay kullandıktan sonra 5 milyon dolar kaybettiğini belirtiyor.",
      "Bu dava, uygulama mağazası denetim süreçleri ve teknoloji platformları ile kullanıcılar arasındaki sorumluluk dengesi hakkında endişeler uyandırıyor."
    ],
    "points": 347,
    "commentCount": 193,
    "retryCount": 0,
    "time": 1724019959
  },
  {
    "id": 41284703,
    "title": "PgQueuer – PostgreSQL'i Bir İş Kuyruğuna Dönüştürün",
    "originLink": "https://github.com/janbjorge/PgQueuer",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41284703",
    "commentBody": "",
    "originSummary": [
      "PgQueuer, PostgreSQL ile çalışmak üzere tasarlanmış minimalist ve yüksek performanslı bir Python iş kuyruğu kütüphanesidir.",
      "Verimli iş kuyruğu yönetimi için PostgreSQL'in LISTEN/NOTIFY özelliğini kullanır.",
      "Bu, Python uygulamalarında iş sıralaması için hafif ve etkili bir çözüm arayan geliştiriciler için dikkate değer bir araç haline getirir."
    ],
    "commentSummary": [
      "PgQueuer, PostgreSQL'ün LISTEN/NOTIFY özelliğini kullanarak verimli iş yönetimi sağlayan, Python için yüksek performanslı bir iş kuyruğu kütüphanesidir.",
      "İşlem işleme ve çökme sırasında mesaj kaybını önlemek için SELECT FOR UPDATE SKIP LOCKED kullanır, bu da onu sağlam ve güvenilir kılar.",
      "Kullanıcılar, PgQueuer'i Celery, Graphile Worker ve Redis tabanlı kuyruklar gibi diğer sistemlerle karşılaştırarak, basitliği ve verimliliğini vurguluyorlar, ancak bazıları daha yüksek verim için özel çözümleri tercih ediyor."
    ],
    "points": 335,
    "commentCount": 107,
    "retryCount": 0,
    "time": 1724008951
  },
  {
    "id": 41285851,
    "title": "Mike Mageek öldü",
    "originLink": "https://fudzilla.com/news/59503-mike-mageek-is-dead",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41285851",
    "commentBody": "",
    "originSummary": [
      "Mike Magee, The Register ve The Inquirer'ın kurucusu ve BT gazeteciliğinde önde gelen bir isim, 74 yaşında hayatını kaybetti.",
      "Magee'nin kariyerindeki önemli noktalar arasında 1994 yılında The Register'ı ve daha sonra The Inquirer'ı kurması yer alıyor; bu girişim, minimal yatırımla kârlı hale geldi.",
      "Teknoloji gazeteciliğinin ötesinde, Magee'nin eklektik ilgi alanları vardı; bunlar arasında \"Shambhala Şövalyeleri Gizemli Büyü Düzeni\"ni kurmak ve tantrik metinleri çevirmek de bulunuyordu."
    ],
    "commentSummary": [
      "Mike Mageek, The Register ve The Inquirer'ın kurucusu, teknoloji gazeteciliğinde önemli bir miras bırakarak vefat etti.",
      "Mageek'in kariyeri, benzersiz tarzı ve katkılarıyla tanınır, unutulmaz anekdotlar ve yazarları mentorluk yaparak teknoloji haberleri alanını şekillendirmiştir.",
      "Mageek'in teknoloji endüstrisi üzerindeki etkisi, tartışmalara rağmen, teknoloji topluluğundaki birçok kişi tarafından sevgiyle hatırlanıyor."
    ],
    "points": 322,
    "commentCount": 60,
    "retryCount": 0,
    "time": 1724018186
  },
  {
    "id": 41289114,
    "title": "2+GB/s hızında protobuf ayrıştırma: C dilinde kuyruk çağrılarını sevmeyi nasıl öğrendim (2021)",
    "originLink": "https://blog.reverberate.org/2021/04/21/musttail-efficient-interpreters.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41289114",
    "commentBody": "",
    "originSummary": [
      "Clang derleyicisindeki yeni bir özellik olan `[[clang::musttail]]` veya `__attribute__((musttail))` özniteliklerini kullanmak, C, C++ ve Objective-C'de kuyruk çağrılarını garanti eder ve performansı önemli ölçüde artırır.",
      "Protobuf ayrıştırmasına kuyruk çağrısı optimizasyonu uygulayarak, 2GB/s'nin üzerinde bir hız elde edildi ve önceki rekorun iki katından fazla bir hız sağlandı.",
      "Temel sınırlama taşınabilirliktir, çünkü `musttail` standart dışı bir uzantıdır, ancak bu durumu makrolar ve diğer özniteliklerle ele almak için çaba sarf edilmektedir."
    ],
    "commentSummary": [
      "Makale, protobuf verilerinin yüksek hızda ayrıştırılmasını sağlamak için C dilinde kuyruk çağrılarının kullanımını tartışıyor ve 2GB/s'nin üzerinde hızlara ulaşıldığını belirtiyor.",
      "Yeni bir C standardı önerisi olan \"return goto (ifade);\", yerel nesne ömürlerinin sona ermesini sağlayarak kapsamlı kaçış analizinden kaçınarak kuyruk çağrısı uygulamasını basitleştirmeyi amaçlıyor.",
      "Tartışma, C, Rust ve WebAssembly (WASM) dahil olmak üzere çeşitli programlama dilleri ve mimarilerde kuyruk çağrısı optimizasyonunun (TCO) zorluklarını ve faydalarını vurgulamaktadır."
    ],
    "points": 275,
    "commentCount": 122,
    "retryCount": 0,
    "time": 1724056923
  },
  {
    "id": 41285046,
    "title": "Nasa, Starliner itici güç sorunlarının riskini ölçemediğini kabul ediyor",
    "originLink": "https://arstechnica.com/space/2024/08/nasa-acknowledges-it-cannot-quantify-risk-of-starliner-propulsion-issues/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41285046",
    "commentBody": "",
    "originSummary": [
      "NASA, Boeing'in Starliner'ındaki itki sorunlarıyla ilgili riski belirleyemediği için, astronotlar Butch Wilmore ve Suni Williams'ı Dünya'ya geri getirip getirmeme veya ISS'deki kalış sürelerini uzatma kararını erteledi.",
      "İtici ve helyum sızıntısı sorunları yaşayan Starliner, kritik bir ISS kenetlenme noktasını işgal ediyor ve SpaceX'in bir sonraki Dragon görevi 24 Eylül'de başlamadan önce bu noktayı boşaltmak zorunda.",
      "Birkaç iticinin toparlanmasına rağmen, NASA, kritik yörüngeden çıkış yanması ve yeniden giriş için güvenilirlikleri konusunda endişeli olup, Ağustos ayı sonuna kadar bir karar verilmesi gerekmektedir."
    ],
    "commentSummary": [
      "Nasa, Boeing'in Starliner itki sorunlarıyla ilgili riski ölçemediğini kabul ediyor ve uzay görevlerinde birden fazla güvenilir sağlayıcının gerekliliğini vurguluyor.",
      "Starliner'ı astronot dönüşleri için kullanmaya devam edip etmeme veya yalnızca SpaceX'in Dragon'una güvenme konusundaki tartışma, tek bir sağlayıcıya bağımlı olmanın risklerini vurguluyor.",
      "Durum, uzay görevlerinin başarısını ve güvenliğini sağlamak için çeşitli ve güvenilir seçeneklere sahip olmanın önemini vurgulamaktadır."
    ],
    "points": 249,
    "commentCount": 336,
    "retryCount": 0,
    "time": 1724011780
  },
  {
    "id": 41292018,
    "title": "Buluttaki devasa ve denetimsiz enerji santralleri",
    "originLink": "https://berthub.eu/articles/posts/the-gigantic-unregulated-power-plants-in-the-cloud/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41292018",
    "commentBody": "",
    "originSummary": [
      "Hollandalı bir hacker, 4 milyon güneş paneli kurulumunu kontrol altına alarak AB'nin enerji altyapısındaki riskleri ortaya çıkardı.",
      "Avrupa dışındaki şirketler tarafından sıklıkla gerçekleştirilen güneş panellerinin merkezi yönetimi, eşzamanlı kapanma riskini ve potansiyel olarak Avrupa elektrik şebekesinin çökmesini beraberinde getiriyor.",
      "NIS2 direktifi ve Siber Dayanıklılık Yasası, güvenliği artırabilir, ancak güneş paneli yöneticilerinin enerji şirketleri olarak muamele görmesini sağlamak için açık düzenlemelere ihtiyaç vardır, böylece büyük enerji sağlayıcıları gibi düzenlenirler."
    ],
    "commentSummary": [
      "Makale, güneş panelleri, invertörler ve diğer yenilenebilir enerji kaynaklarının bulut hizmetleri aracılığıyla merkezi yönetimiyle ilgili güvenlik risklerini vurgulamakta ve bunları siber saldırılara karşı savunmasız hale getirmektedir.",
      "İsviçre'de, güneş panelleri 25 orta büyüklükteki nükleer santrale eşdeğer güç üretir, ancak yıllık enerji çıktısı ortalama bir nükleer santralin yaklaşık 1,5 katıdır.",
      "Bu tartışma, riskin değerlendirilmesinde isim plakası kapasitesinin (bir sistemin üretebileceği maksimum çıktı) mi yoksa gerçek çıktının mı kullanılacağına odaklanıyor ve şebekeyi korumak için daha iyi düzenlemeler ve güvenlik uygulamalarının gerekliliğini vurguluyor."
    ],
    "points": 222,
    "commentCount": 93,
    "retryCount": 0,
    "time": 1724082319
  },
  {
    "id": 41287031,
    "title": "FindMy Flipper – AirTag ve SmartTag Emülatörü",
    "originLink": "https://github.com/MatthewKuKanich/FindMyFlipper",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41287031",
    "commentBody": "",
    "originSummary": [
      "FindMy Flipper uygulaması, FlipperZero'nun Bluetooth yeteneklerini geliştirerek Apple AirTag, Samsung SmartTag ve Tile Tracker'ı taklit etmesini sağlar.",
      "Temel özellikler arasında etiket öykünmesi, işaret yayma aralıklarının ve iletim gücünün özelleştirilmesi ve pil kullanımını en aza indirmek için verimli arka plan çalışması yer alır.",
      "Uygulama, mevcut etiketlerin kopyalanmasına, Apple'ın FindMy ağı için OpenHaystack anahtar çiftlerinin oluşturulmasına ve FlipperZero'nun izlenmesine olanak tanır ve ayrıntılı kurulum ve yapılandırma talimatları sağlar."
    ],
    "commentSummary": [
      "FindMy Flipper, GitHub'da bulunan ve teknoloji topluluğunun büyük ilgisini çeken bir AirTag ve SmartTag emülatör projesidir.",
      "Apple tarafından hesap yasaklamalarına yol açabilecek güvensiz bir iCloud kimlik doğrulama kütüphanesi olan bir bağımlılığının güvenliği hakkında endişeler dile getirildi.",
      "Proje, birden fazla etiketi döngüye sokarak Apple'ın takip önleme özelliklerini atlatma potansiyeline sahip olduğundan, hem güvenlik meraklıları hem de gizlilik savunucuları için ilgi çekici bir konu haline geliyor."
    ],
    "points": 213,
    "commentCount": 51,
    "retryCount": 0,
    "time": 1724031065
  },
  {
    "id": 41290409,
    "title": "İnternetteki tüm pdf dosyalarını sınıflandırmak",
    "originLink": "https://snats.xyz/pages/articles/classifying_a_bunch_of_pdfs.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41290409",
    "commentBody": "",
    "originSummary": [
      "Bir araştırmacı, makine öğrenimi (ML) ve derin öğrenme modellerinin bir kombinasyonunu kullanarak, 8,4 milyon PDF'den oluşan 8TB'lık SafeDocs veri setinin tamamını sınıflandırdı.",
      "En iyi performans gösteren model olan XGBoost gömüleri, hiperparametre ayarlamasından sonra %85.26 doğruluk elde ederek geleneksel ML ve derin öğrenme tekniklerinin birleştirilmesinin etkinliğini göstermiştir.",
      "Proje, büyük ölçekli metin sınıflandırma potansiyelini vurgulamakta ve daha fazla keşif için tüm veri setlerini ve kodları Huggingface ve Kaggle'da sunmaktadır."
    ],
    "commentSummary": [
      "Yazı, başlığın yanıltıcı bir şekilde önerebileceği gibi internet üzerindeki tüm PDF'ler değil, 500.000 PDF'nin sınıflandırılmasını tartışıyor.",
      "Yazar ve yorumcular, PDF'lerden veri sınıflandırma ve çıkarma için Büyük Dil Modeli (LLM) gömüleri ve diğer tekniklerin kullanımını araştırıyor.",
      "Konuşma, büyük veri kümelerinin işlenmesindeki zorlukları ve potansiyeli vurguluyor, bazı kullanıcılar 8TB PDF'nin önemli olduğunu ancak çevrimiçi olarak mevcut en büyük koleksiyon olmadığını belirtiyor."
    ],
    "points": 191,
    "commentCount": 65,
    "retryCount": 0,
    "time": 1724070189
  },
  {
    "id": 41284873,
    "title": "Beyin, REM uykusu sırasında eylemleri ve bunların sonuçlarını simüle eder",
    "originLink": "https://www.biorxiv.org/content/10.1101/2024.08.13.607810v1",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41284873",
    "commentBody": "",
    "originSummary": [
      "Yeni bir ön baskı çalışması, REM uykusu sırasında beynin, motor komutları vererek ve bu komutlar gerçekleştirilmemiş olsa bile gerçekleştirilmiş gibi etkiler yaratarak, eylemleri ve sonuçlarını simüle ettiğini öne sürüyor.",
      "Bu araştırma, beynin uyku sırasında dünyayla etkileşimleri simüle etmek için iç modelini kullandığını göstererek, bu motor komutlarını veren farelerdeki superior colliculus'un rolünü vurgulamaktadır.",
      "Bu çalışma, REM uykusu sırasında beynin aktiviteleri ve rüyaları gerçek dünya etkileşimlerini işlemek ve simüle etmek için nasıl kullanabileceği hakkında bilgiler sağladığı için önemlidir."
    ],
    "commentSummary": [
      "REM uykusu, beynin eylemleri ve sonuçlarını simüle etmesini içerir, bu da bireyleri gerçek yaşam senaryolarına hazırlayabilir.",
      "Kullanıcılar, rüyaların aşırı durumlar için bir eğitim simülatörü olarak hizmet edebileceğini ve karmaşık problemleri çözmeye yardımcı olabileceğini tartışıyor, bazıları ise rüyaların dışarıdan kontrol edilme olasılığını öne sürüyor.",
      "Konuşma, travmatik anıların işlenmesinde, karar verme yetisinin geliştirilmesinde ve öğrenme ile hafızanın pekiştirilmesinde uykunun rolünü vurgulamaktadır."
    ],
    "points": 171,
    "commentCount": 52,
    "retryCount": 0,
    "time": 1724010513
  },
  {
    "id": 41287014,
    "title": "Eric Schmidt Stanford röportajını sildi",
    "originLink": "https://www.youtube.com/watch?v=3f6XM6_7pUE",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41287014",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Eric Schmidt'in silinen Stanford röportajı, özellikle Google'ın iş-yaşam dengesi ve bunun rekabet üzerindeki etkisi konusundaki eleştirileri etrafında Hacker News'te tartışmaları alevlendirdi.",
      "Schmidt'in fikri mülkiyet hırsızlığı ve ofiste çalışma gerekliliği konusundaki tartışmalı yorumları, uzaktan çalışmanın verimlilik ve Google'ın kültürü üzerindeki etkisi hakkında tartışmaları körükledi.",
      "Silinmesine rağmen, röportaj transkripti GitHub'da erişilebilir durumda ve sık sık yeniden yükleniyor, bu da güçlü bir kamu ilgisini gösteriyor."
    ],
    "points": 170,
    "commentCount": 125,
    "retryCount": 0,
    "time": 1724030864
  },
  {
    "id": 41284639,
    "title": "İstek Önbellekleme",
    "originLink": "https://docs.anthropic.com/en/docs/build-with-claude/prompt-caching",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41284639",
    "commentBody": "",
    "originSummary": [
      "Anthropic, tekrarlayan görevler için işlem süresini ve maliyetleri azaltarak belirli öneklerden devam ederek API kullanımını optimize etmek amacıyla Prompt Caching (beta) adlı yeni bir özellik tanıttı.",
      "İstek Önbellekleme, birçok örnek içeren istekler, büyük bağlamlar, tekrarlayan görevler ve uzun konuşmalar için özellikle kullanışlıdır ve önbellek ömrü 5 dakikadır.",
      "Desteklenen modeller arasında Claude 3.5 Sonnet ve Claude 3.0 Haiku bulunmaktadır, önbellek yazma jetonları temel giriş jetonlarından %25 daha pahalı ve önbellek okuma jetonları %90 daha ucuzdur."
    ],
    "commentSummary": [
      "Anthropic, Claude AI için sistem istemlerini, araçları ve kullanıcı mesajlarını önbelleğe alarak maliyetleri ve gecikmeyi azaltan yeni bir özellik olan İstem Önbelleğe Almayı tanıttı.",
      "Bu özellik, sık ve tekrarlayan sorgulara sahip uygulamalar için özellikle faydalıdır, çünkü maliyeti %90'a kadar önemli ölçüde düşürebilir ve yanıt sürelerini iyileştirebilir.",
      "Bu gelişme, kısa bir zaman dilimi içinde birden fazla istek arasında bağlamı koruyarak, müşteriyle yüz yüze olan uygulamaların ve AI modelleriyle devam eden konuşmaların verimliliğini artırma potansiyeli açısından dikkate değerdir."
    ],
    "points": 161,
    "commentCount": 61,
    "retryCount": 0,
    "time": 1724008467
  },
  {
    "id": 41287425,
    "title": "Ünlü Bilgisayar Kafesi'ni Arşivleme",
    "originLink": "https://blog.archive.org/2024/08/19/archiving-the-famous-computer-cafe/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41287425",
    "commentBody": "",
    "originSummary": [
      "1980'lerin radyo programı \"The Famous Computer Cafe\"den bir dizi röportaj keşfedildi, dijitalleştirildi ve İnternet Arşivi'ne yüklendi.",
      "1983'ten 1986'ya kadar yayınlanan program, bilgisayar endüstrisi haberleri ve ürün incelemelerini kapsayarak Timothy Leary, Douglas Adams ve Bill Gates gibi önemli teknoloji figürlerini ağırladı.",
      "Arşivci Kay Savetz kasetleri kurtardı, dijitalleştirme için bir GoFundMe başlattı ve bölümleri yükledi, ancak Ray Bradbury ve Gene Roddenberry ile yapılan bazı röportajlar kayıp durumda."
    ],
    "commentSummary": [
      "İnternet Arşivi, 1980'lerden kalma ünlü teknoloji radyo programı \"The Famous Computer Cafe\"nin bölümlerini erişime açtı. Bu programda Bill Gates ve Douglas Adams gibi önemli isimlerle yapılan röportajlar yer alıyor.",
      "Kullanıcılar, bu bölümlere bir RSS beslemesi aracılığıyla erişebilir, bu beslemeyi podcast uygulamalarına aktarabilir ve yapay zeka ve bilgisayar grafikleri gibi konularda tarihsel tartışmaları dinleyebilirler.",
      "Arşiv, dinleyiciler için nostaljik deneyimi artıran bir Winamp klonu oynatıcı da dahil olmak üzere çeşitli oynatma seçenekleri içerir."
    ],
    "points": 122,
    "commentCount": 16,
    "retryCount": 0,
    "time": 1724036572
  },
  {
    "id": 41284549,
    "title": "Apple, Brezilya'da bir VPN sansür emri uyguluyor olabilir",
    "originLink": "https://status.proton.me/incidents/0frlp8crn7kx",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41284549",
    "commentBody": "",
    "originSummary": [
      "Kullanıcılar Brezilya'da iOS App Store'dan Proton VPN'i indirmekte zorluk yaşıyorlar, bu durum muhtemelen App Store'un kendisindeki sorunlardan veya Apple tarafından olası sansürden kaynaklanıyor olabilir.",
      "Geçici bir çözüm olarak, Proton, Testflight aracılığıyla iOS beta sürümünü kullanmayı veya VPN sunucularına erişmek için manuel bir WireGuard yapılandırması kurmayı öneriyor.",
      "Bu sorun, Brezilya'daki iOS platformuna özgüdür; Proton VPN ve diğer Proton uygulamaları diğer platformlarda mevcuttur ve etkilenmemektedir."
    ],
    "commentSummary": [
      "Apple, Çin ve Rusya'daki eylemleri yansıtarak, Brezilya'da potansiyel yasal gereklilikler nedeniyle belirli VPN uygulamalarını engelliyor olabilir.",
      "Bu durum, Android kullanıcılarının aksine uygulamaları yalnızca App Store'dan yükleyebilen Apple kullanıcıları için alternatiflerin eksikliği konusunda endişeleri artırıyor.",
      "Eleştirmenler, bu kısıtlamaların kullanıcı özgürlüğünü ve güvenliğini sınırladığını, özellikle siyasi olarak hassas bölgelerde sansür ve kontrol gibi daha geniş sorunlara yol açabileceğini savunuyorlar."
    ],
    "points": 111,
    "commentCount": 96,
    "retryCount": 0,
    "time": 1724007873
  }
]
