[
  {
    "id": 41412256,
    "title": "بناء نماذج اللغة الكبيرة من الصفر: ورشة عمل برمجية لمدة 3 ساعات",
    "originLink": "https://magazine.sebastianraschka.com/p/building-llms-from-the-ground-up",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41412256",
    "commentBody": "",
    "originSummary": [
      "ورشة عمل برمجة لمدة 3 ساعات حول بناء نماذج اللغة الكبيرة (LLMs) من الصفر يقدمها سيباستيان راشكا، دكتوراه.",
      "تشمل الورشة مواضيع مثل مقدمة في LLM، فهم بيانات الإدخال، بنية الترميز، التدريب المسبق، تحميل الأوزان المدربة مسبقًا، تحسين التعليمات، وتقييم الأداء.",
      "سيحصل المشاركون على إمكانية الوصول إلى الموارد ذات الصلة مثل كتاب \"بناء نموذج لغوي كبير من الصفر\" ومستودعات GitHub."
    ],
    "commentSummary": [
      "سيباستيان راشكا يقدم ورشة عمل برمجية لمدة 3 ساعات حول بناء نماذج اللغة الكبيرة (LLMs) من الصفر، والتي حظيت باهتمام كبير في مجتمع التكنولوجيا.",
      "يتم مقارنة الورشة بسلسلة أندريه كارباتي، حيث يتم الثناء على كل منهما لقيمتهما التعليمية، على الرغم من أنهما يغطيان جوانب مختلفة من نماذج اللغة الكبيرة.",
      "تسلط المناقشة الضوء على أهمية فهم المفاهيم الأساسية في تعلم الآلة، حيث يناقش بعض المستخدمين عمق ونهج الدروس التي تبدأ من الصفر."
    ],
    "points": 801,
    "commentCount": 94,
    "retryCount": 0,
    "time": 1725140759
  },
  {
    "id": 41415023,
    "title": "وضع المؤسس",
    "originLink": "https://paulgraham.com/foundermode.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41415023",
    "commentBody": "",
    "originSummary": [
      "براين تشيسكي، الشريك المؤسس لشركة Airbnb، تحدى الحكمة التقليدية في الإدارة خلال حدث في YC، مجادلاً بأن النصائح التقليدية مثل \"توظيف أشخاص جيدين ومنحهم مساحة\" كانت ضارة لشركة Airbnb.",
      "دراسة تشيسكي لأساليب ستيف جوبز أدت إلى نهج جديد، أطلق عليه اسم \"وضع المؤسس\"، والذي يتضمن مشاركة أكثر مباشرة وتقليل التفويض، مما أدى إلى تحسين أداء شركة Airbnb.",
      "يمكن أن يُحدث مفهوم \"وضع المؤسس\" ثورة في كيفية توسع الشركات الناشئة، حيث شارك العديد من المؤسسين في الحدث تجارب مماثلة حول عدم فعالية النصائح التقليدية."
    ],
    "commentSummary": [
      "ريد هاستينغز، الشريك المؤسس والرئيس التنفيذي لشركة نتفليكس، قدم أسلوب إدارة يركز على حرية الموظفين ومسؤوليتهم، وهو ما كان محوريًا في ابتكار ونمو نتفليكس.",
      "يجادل النقاد بأن العديد من مديري البرمجيات المحترفين يتجنبون المخاطر، مما يؤدي إلى ثقافات شركات أقل فعالية، بينما يدعو بول غراهام المؤسسين إلى الانخراط المباشر والتفويض بناءً على الثقة.",
      "يسلط النقاش المستمر الضوء على أن أساليب الإدارة المختلفة، مثل تلك الخاصة بشركتي نتفليكس وآبل، يمكن أن تؤدي إلى النجاح، اعتمادًا على سياق الشركة وقيادتها."
    ],
    "points": 571,
    "commentCount": 361,
    "retryCount": 0,
    "time": 1725176123
  },
  {
    "id": 41415819,
    "title": "الفوضى في السودان أفرزت أسوأ مجاعة في العالم منذ 40 عامًا",
    "originLink": "https://www.economist.com/briefing/2024/08/29/anarchy-in-sudan-has-spawned-the-worlds-worst-famine-in-40-years",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41415819",
    "commentBody": "",
    "originSummary": [
      "السودان يشهد أسوأ مجاعة في العالم منذ 40 عامًا، حيث يواجه الملايين خطر الموت، وفقًا لما أعلنته الأمم المتحدة في مخيم زمزم للاجئين بالقرب من الفاشر.",
      "أفادت منظمة أطباء بلا حدود في أبريل أن طفلاً كان يموت كل ساعتين بسبب الجوع أو المرض، وأن الوضع قد تدهور أكثر.",
      "الأزمة، التي تفاقمت بسبب حرب السودان، تؤثر على ثلاث قارات وتؤكد على تزايد الإفلات من العقاب والفوضى العالمية."
    ],
    "commentSummary": [
      "أدى الفوضى في السودان إلى أسوأ مجاعة منذ 40 عامًا، حيث أعلنت الأمم المتحدة عن مجاعة كاملة بسبب غياب حكومة فعالة.",
      "المجاعة تؤثر بشدة على مخيم للاجئين يضم حوالي 500,000 شخص، في حين تفتقر الأمم المتحدة إلى بيانات عن مناطق أخرى من البلاد.",
      "لقد أشعلت الأزمة، التي تفاقمت بسبب الحروب الأهلية وحروب الوكالة، نقاشات حول فعالية المساعدات الدولية ودور التدخلات الخارجية."
    ],
    "points": 215,
    "commentCount": 288,
    "retryCount": 0,
    "time": 1725187733
  },
  {
    "id": 41415238,
    "title": "عزيزتي، لقد قلصت {fmt}: تقليص حجم الملف الثنائي إلى 14 كيلوبايت والتخلي عن وقت تشغيل C++",
    "originLink": "https://vitaut.net/posts/2024/binary-size/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41415238",
    "commentBody": "",
    "originSummary": [
      "تُعرف مكتبة التنسيق {fmt} ببصمتها الثنائية الصغيرة، حيث غالبًا ما تنتج شيفرة أصغر مقارنة بالبدائل مثل IOStreams أو Boost Format.",
      "من خلال تحسينات مختلفة، بما في ذلك تعطيل دعم اللغة وتنسيق الأرقام العائمة، تم تقليل حجم الملف الثنائي لـ {fmt} إلى 14 كيلوبايت فقط، مما يلغي الحاجة إلى وقت تشغيل C++.",
      "تجعل هذه التحسينات {fmt} مناسبًا للغاية للأجهزة ذات الذاكرة المحدودة وبيئات الحوسبة القديمة."
    ],
    "commentSummary": [
      "تم تحسين مكتبة {fmt} لتقليل حجمها الثنائي إلى 14 كيلوبايت وإزالة الاعتماد على وقت تشغيل C++.",
      "يُعد هذا التحسين مهمًا للتطبيقات التي يكون فيها حجم الملف الثنائي حاسمًا، مثل الأنظمة المدمجة ووحدات التحكم الدقيقة.",
      "تسلط المناقشة الضوء على التحديات والحلول في تقليل حجم الشيفرة، بما في ذلك استخدام الخوارزميات البديلة وتأثير تنسيق الأعداد العائمة على حجم الملف الثنائي."
    ],
    "points": 186,
    "commentCount": 76,
    "retryCount": 0,
    "time": 1725179445
  },
  {
    "id": 41413662,
    "title": "محاكاة جهاز بلايستيشن 2 GS – الحدود النهائية لمحاكاة الحوسبة باستخدام Vulkan",
    "originLink": "https://themaister.net/blog/2024/07/03/playstation-2-gs-emulation-the-final-frontier-of-vulkan-compute-emulation/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41413662",
    "commentBody": "",
    "originSummary": [
      "paraLLEl-GS هو محاكي جديد يعتمد على الحوسبة باستخدام Vulkan لمحاكي جهاز PlayStation 2 Graphics Synthesizer (GS)، مستوحى من نجاح paraLLEl-RDP لجهاز N64.",
      "على عكس المحاولات السابقة، يركز paraLLEl-GS على الأداء العالي وتجنب المشكلات الرسومية الواضحة، رغم أنه لا يهدف إلى الدقة البتية.",
      "يتناول المشروع التحديات الفريدة لمحاكاة PS2 GS، مثل معدل الملء العالي، ميزات خط أنابيب البكسل الغريبة، وعمليات التكسية والذاكرة المؤقتة المعقدة."
    ],
    "commentSummary": [
      "محاكاة معالج الرسوميات (Graphics Synthesizer) في جهاز بلايستيشن 2 تعتبر تحديًا بسبب عرض النطاق الترددي العالي والميزات المعقدة، مثل المزج القابل للبرمجة وتظليل القوام.",
      "لقد تطورت جهود المحاكاة من استخدام أجهزة PS2 المدمجة في PS3 إلى الحلول القائمة على البرمجيات، مما يبرز الصعوبات التقنية المتضمنة.",
      "تتضمن المناقشة السياق التاريخي لتطوير الألعاب وتطور تكنولوجيا وحدات معالجة الرسومات، مشيرة إلى أن شركة Nvidia صاغت مصطلح \"GPU\" في عام 1997."
    ],
    "points": 185,
    "commentCount": 49,
    "retryCount": 0,
    "time": 1725156859
  },
  {
    "id": 41411281,
    "title": "WatchYourLAN: ماسح IP الشبكة الخفيف",
    "originLink": "https://github.com/aceberg/WatchYourLAN",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41411281",
    "commentBody": "",
    "originSummary": [
      "WatchYourLAN هو ماسح IP شبكي خفيف الوزن بواجهة مستخدم ويب، يقدم ميزات مثل الإشعارات للمضيفين الجدد ومراقبة تاريخ تواجد المضيفين على الإنترنت/غير متصل.",
      "يمكنه الحفاظ على قائمة بجميع مضيفي الشبكة وإرسال البيانات إلى InfluxDB2 لاستخدامها في لوحات معلومات Grafana.",
      "يرجى ملاحظة أن الإصدار 2.0 غير متوافق مع الإصدار 1.0، وأن صور Docker للإصدار 2.0 موجودة حاليًا تحت العلامة v2 ولكن سيتم وضع علامة عليها كأحدث قريبًا."
    ],
    "commentSummary": [
      "WatchYourLAN هو ماسح IP شبكي خفيف الوزن، يتم مناقشته بناءً على تجارب المستخدمين والرؤى التقنية.",
      "شارك المستخدمون تجاربهم مع ميزة الاستيقاظ عبر الشبكة المحلية (WoL)، مشيرين إلى اعتمادها على إطارات إيثرنت خاصة وميزات الاستعداد الحديثة.",
      "شملت المناقشات التقنية معالجة عناوين MAC، مع اقتراحات لاستخدام قوائم OUI الخاصة بـ IEEE ومخاوف بشأن الأجهزة التي تغير عناوين MAC بشكل متكرر."
    ],
    "points": 173,
    "commentCount": 24,
    "retryCount": 0,
    "time": 1725132732
  },
  {
    "id": 41417284,
    "title": "كيف تقوم سلسلة رائدة من المستشفيات النفسية بإيقاع المرضى في الفخ",
    "originLink": "https://www.nytimes.com/2024/09/01/business/acadia-psychiatric-patients-trapped.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41417284",
    "commentBody": "",
    "originSummary": [
      "كشفت تحقيقات صحيفة نيويورك تايمز أن شركة أكاديا للرعاية الصحية، وهي سلسلة رئيسية من المستشفيات النفسية، كانت تحتجز المرضى ضد إرادتهم لزيادة مدفوعات التأمين.",
      "تم تنبيه السلطات في ما لا يقل عن 12 من الولايات الـ19 التي تعمل فيها أكاديا بشأن هذه الاحتجازات غير القانونية، حيث تدخل القضاة أحيانًا لإطلاق سراح المرضى.",
      "تشير التقارير إلى أن المرضى كانوا يُحتجزون غالبًا دون أسباب طبية صحيحة، مع تعرض الموظفين لضغوط لتضخيم الأعراض وتمديد فترات الإقامة، مما أدى إلى مخاوف أخلاقية وقانونية خطيرة."
    ],
    "commentSummary": [
      "تُتهم سلسلة رائدة من المستشفيات النفسية باحتجاز المرضى لتحقيق الربح، مستغلة ضعفهم ونقص الدعم لديهم.",
      "يواجه المرضى تحديات كبيرة في السعي لتحقيق العدالة، حيث غالبًا ما تنحاز هيئات المحلفين إلى الأطباء، ويتم تهديدهم بعواقب وخيمة إذا حاولوا المغادرة أو التوقف عن تناول الأدوية.",
      "المشكلة النظامية مدفوعة بالحوافز المالية ونقص التنظيم، مما يجعل من الصعب على مكاتب المحاماة المتخصصة معالجة هذه الممارسات غير الأخلاقية بفعالية."
    ],
    "points": 158,
    "commentCount": 77,
    "retryCount": 0,
    "time": 1725201203
  },
  {
    "id": 41416714,
    "title": "Linkpreview، شاهد كيف تبدو مواقعك على وسائل التواصل الاجتماعي وتطبيقات الدردشة",
    "originLink": "https://linkpreview.xyz",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41416714",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "يتيح Linkpreview للمستخدمين رؤية كيفية ظهور موقعهم على وسائل التواصل الاجتماعي وتطبيقات الدردشة، مع مناقشات تقارنه بأدوات مثل socialsharepreview.com و opengraph.xyz.",
      "يقترح المستخدمون تحسينات مثل إضافة \"https://\" تلقائيًا وتحسين التعامل مع العلامات الوصفية، بينما يفضل البعض أدوات أخرى لدقتها وميزاتها الإضافية.",
      "يعتزم المُنشئ تنفيذ تحسينات بناءً على ملاحظات المستخدمين، مما يشير إلى تطوير مستمر واستجابة لاحتياجات المستخدمين."
    ],
    "points": 152,
    "commentCount": 53,
    "retryCount": 0,
    "time": 1725196034
  },
  {
    "id": 41413174,
    "title": "مفاتيح AirTags تكشف خداع إعادة تدوير البلاستيك في هيوستن",
    "originLink": "https://appleinsider.com/articles/24/08/31/airtags-key-to-discovery-of-houstons-plastic-recycling-deception",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41413174",
    "commentBody": "",
    "originSummary": [
      "استخدمت مقيمة في هيوستن أجهزة AirTags لتتبع إعادة تدوير البلاستيك الخاص بها ووجدت أنه يتم إرساله إلى منشأة غير معتمدة فشلت في فحوصات السلامة من الحرائق.",
      "اعترف مدير إدارة النفايات الصلبة في المدينة بأن 250 طنًا من البلاستيك التي تم جمعها منذ أواخر عام 2022 لم يتم إعادة تدويرها، في انتظار إنشاء منشأة فرز جديدة.",
      "المدعي العام في كاليفورنيا يحقق في ادعاءات شركتي Cyclix وExxonMobil بشأن عمليات إعادة تدوير البلاستيك الخاصة بهما."
    ],
    "commentSummary": [
      "كانت أجهزة AirTags أساسية في كشف عملية احتيال في إعادة تدوير البلاستيك في هيوستن، مما كشف عن ممارسات خادعة في صناعة إعادة التدوير.",
      "تسلط الاكتشافات الضوء على المشكلات المستمرة في إعادة تدوير البلاستيك، بما في ذلك صعوبة إعادة تدوير البلاستيك أكثر من مرة والتأثير البيئي للميكروبلاستيك.",
      "أثارت القضية مناقشات حول فعالية إعادة تدوير البلاستيك والحاجة إلى مواد بديلة أو ممارسات أفضل لإدارة النفايات."
    ],
    "points": 143,
    "commentCount": 144,
    "retryCount": 0,
    "time": 1725151113
  },
  {
    "id": 41411478,
    "title": "التهديد لشركة OpenAI",
    "originLink": "https://www.wsj.com/tech/ai/ai-chatgpt-nvidia-apple-facebook-383943d1",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41411478",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "النقاش حول مستقبل OpenAI يركز على إمكانيات التطبيقات المتخصصة (الملفات المغلفة) مقارنة بالنماذج العامة مثل النماذج اللغوية الكبيرة (LLMs).",
      "تُثار مخاوف بشأن التقييمات العالية لشركة OpenAI وما إذا كانت تستطيع الحفاظ على تقدمها من خلال الابتكار ومزايا النظام البيئي، خاصة مع وجود منافسين مثل Anthropic وClaude.",
      "يُنظر إلى ChatGPT المجاني من OpenAI كأداة لاكتساب البيانات لتعزيز النماذج، وإصداراتهم النادرة تشير إلى أنهم قد يعملون على تحسينات كبيرة."
    ],
    "points": 139,
    "commentCount": 147,
    "retryCount": 0,
    "time": 1725134163
  },
  {
    "id": 41415144,
    "title": "تواجه شركة E Ink منافسة متزايدة في مجال الشاشات التي تشبه الورق",
    "originLink": "https://liliputing.com/e-ink-faces-growing-competition-in-the-paper-like-display-space/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41415144",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "تواجه شركة E Ink منافسة متزايدة في سوق الشاشات \"الشبيهة بالورق\"، مع ظهور منتجات جديدة تستخدم وحدات المعالجة المركزية المعاد تدويرها من أجهزة تعدين البيتكوين القديمة، مثل لوحة EBAZ4205.",
      "يناقش المستخدمون الحاجة إلى أجهزة يمكن قراءتها بشكل أفضل في الهواء الطلق، ويقارنون الخيارات الحالية مثل شاشة الحبر الإلكتروني Dasung Paperlike HD-FT، وأجهزة Onyx Boox اللوحية، وPineNote، وDaylight Computer، ولكل منها مزايا وعيوب خاصة بها.",
      "تتمثل المزايا الرئيسية لشاشات الحبر الإلكتروني في استهلاكها المنخفض للطاقة وقابليتها للقراءة في ضوء الشمس، على الرغم من أنها غالبًا ما تفتقر إلى قوة الأجهزة وتكامل البرمجيات مقارنة بالأجهزة الأخرى."
    ],
    "points": 136,
    "commentCount": 80,
    "retryCount": 0,
    "time": 1725178143
  },
  {
    "id": 41413641,
    "title": "ترويض الوحش الذي هو ORM في Django – مقدمة",
    "originLink": "https://www.davidhang.com/blog/2024-09-01-taming-the-django-orm/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41413641",
    "commentBody": "",
    "originSummary": [
      "تقدم المقالة التمهيدية لمحة عن ORM (مُخطط الكائنات العلائقية) في Django، مسلطة الضوء على مزاياه وعيوبه، وتقدم أمثلة عملية ونصائح.",
      "تشمل المزايا الرئيسية لاستخدام Django ORM التجريد عن SQL، القابلية للنقل، التوافق المباشر بين قاعدة البيانات والنماذج، التوليد التلقائي للمخططات، وتعزيز الأمان ضد حقن SQL.",
      "تشمل التحديات مع Django ORM وجود SQL مخفي تحت السطح، واحتمالية وجود استعلامات N+1، ومنحنى تعلم أكثر حدة للمطورين الجدد، وربما SQL أبطأ مقارنة بـ SQL المصمم يدويًا."
    ],
    "commentSummary": [
      "تتناول المقالة مزايا ومساوئ استخدام نظام الربط الكائني العلائقي (ORM) في Django، مسلطة الضوء على كفاءته وسهولة استخدامه في تعريف التطبيقات والمخططات.",
      "تشمل الميزات الرئيسية لـ Django ORM الهجرات، واستكشاف الأخطاء وإصلاحها، والتقارير، ولكنه يواجه أيضًا تحديات مثل إدارة استعلامات N+1 ووراثة النماذج.",
      "تشمل المناقشة آراء متنوعة حول استخدام ORMs مقابل SQL الخام، حيث يدعو البعض إلى بساطة SQL في الاستعلامات المعقدة بينما يؤكد آخرون على فوائد تجريدات ORM."
    ],
    "points": 136,
    "commentCount": 118,
    "retryCount": 0,
    "time": 1725156454
  },
  {
    "id": 41418302,
    "title": "أبل وإنفيديا في محادثات للاستثمار في ChatGPT",
    "originLink": "https://www.businesstoday.in/technology/news/story/apple-nvidia-in-talks-to-invest-in-chatgpt-maker-openai-potentially-valuing-company-over-100-billion-443624-2024-08-30",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41418302",
    "commentBody": "",
    "originSummary": [
      "تجري شركة آبل وإنفيديا محادثات للاستثمار في شركة أوبن إيه آي، مما قد يرفع قيمة الشركة إلى أكثر من 100 مليار دولار.",
      "يأتي هذا في إطار خطة Thrive Capital للاستثمار بحوالي مليار دولار، مع احتمال حصول Apple على دور مراقب في مجلس إدارة OpenAI.",
      "ارتفعت قيمة شركة OpenAI بشكل كبير بسبب المنافسة الشديدة في قطاع الذكاء الاصطناعي، خاصة بعد إطلاق ChatGPT في أواخر عام 2022."
    ],
    "commentSummary": [
      "تُفيد التقارير بأن شركتي آبل وإنفيديا تجريان محادثات للاستثمار في ChatGPT، وهو نموذج لغة ذكاء اصطناعي متقدم.",
      "يبرز هذا الاستثمار المحتمل الاهتمام المتزايد للشركات التقنية الكبرى بتقنيات الذكاء الاصطناعي وتعلم الآلة.",
      "يمكن أن يعزز انخراط عمالقة الصناعة مثل آبل وإنفيديا بشكل كبير تطوير وقدرات ChatGPT."
    ],
    "points": 123,
    "commentCount": 0,
    "retryCount": 0,
    "time": 1725209172
  },
  {
    "id": 41415647,
    "title": "نظرية أينشتاين الأخرى عن كل شيء",
    "originLink": "https://nautil.us/einsteins-other-theory-of-everything-823245/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41415647",
    "commentBody": "",
    "originSummary": [
      "تناقش المقالة جهود أينشتاين الأقل شهرة لتطوير نظرية الحقل الموحد، التي كانت تهدف إلى تفسير المادة والطاقة والزمكان كتشوهات في الزمكان.",
      "على الرغم من أن النظريات الحديثة مثل نظرية الأوتار والجاذبية الكمية الحلقية قد طغت عليها، إلا أن أفكار أينشتاين الأصلية لا تزال مثيرة للاهتمام وتستحق إعادة النظر.",
      "المقالة من تأليف سابين هوسنفيلدر، وهي فيزيائية نظرية، مما يضيف مصداقية وعمقًا للنقاش حول مساعي أينشتاين العلمية."
    ],
    "commentSummary": [
      "تدور المناقشة حول مساهمات أينشتاين التي تتجاوز النسبية العامة، وخاصة مفارقة EPR، التي تتحدى الفكرة القائلة بأنه لم ينتج أعمالًا مهمة بعد ذلك.",
      "يناقش العديد من المستخدمين نماذج بديلة لتشبيه \"الكرة على ورقة مطاطية\" للجاذبية، مقترحين تصورات مختلفة مثل لف العجينة اللينة أو استخدام إسفنجة مع كتل كثيفة.",
      "تشمل المحادثة توضيحات تقنية حول التأثيرات النسبية، مثل سلوك الإلكترونات والبروتونات، وحدود الميكانيكا الكلاسيكية في تفسير هذه الظواهر."
    ],
    "points": 115,
    "commentCount": 44,
    "retryCount": 0,
    "time": 1725185355
  },
  {
    "id": 41412221,
    "title": "تاريخ موجز لشبكات الهاتف عبر أسلاك السياج الشائكة",
    "originLink": "https://loriemerson.net/2024/08/31/a-brief-history-of-barbed-wire-fence-telephone-networks/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41412221",
    "commentBody": "",
    "originSummary": [
      "يسلط كتاب لوري إيمرسون، \"شبكات أخرى: مصدر تكنولوجيا راديكالية\"، الضوء على التاريخ غير الموثق إلى حد كبير لشبكات الهاتف عبر أسلاك السياج الشائكة، والتي كانت حيوية في المناطق الريفية في الولايات المتحدة وكندا خلال أوائل ومنتصف القرن العشرين.",
      "تم اختراع الأسلاك الشائكة في البداية لتسييج الماشية، ولكن أعاد المزارعون استخدامها لشبكات الهاتف غير الرسمية، خاصة بعد انتهاء احتكار براءة اختراع ألكسندر جراهام بيل في عامي 1893-94، مما أتاح للمجتمعات الريفية التواصل دون الحاجة إلى مراكز تبادل أو فواتير شهرية.",
      "على الرغم من المشاكل المتعلقة بالطقس، ازدهرت هذه الشبكات واستُخدمت حتى السبعينيات، حيث وفرت اتصالات أساسية للطوارئ وتحديثات الطقس والتفاعل الاجتماعي في مناطق الزراعة التعاونية."
    ],
    "commentSummary": [
      "يمكن استخدام الأسلاك الشائكة لنقل إيثرنت بسرعة جيجابت مع الإعداد الصحيح، مما يبرز تنوعها خارج الاستخدامات التقليدية.",
      "تكشف الحكايات التاريخية أنه خلال الحرب العالمية الثانية، استخدمت كل من القوات المتحالفة والألمانية خطوط الهاتف الأرضية للاتصالات الخالية من الترددات الراديوية في شمال إفريقيا.",
      "يُعد ضغط خطوط الهاتف، سواء كانت فوق الأرض أو تحتها، ممارسة شائعة لمنع تسرب المياه وضمان سلامة النظام، حيث تلعب أجهزة الاستشعار والضواغط أدوارًا حاسمة."
    ],
    "points": 108,
    "commentCount": 12,
    "retryCount": 0,
    "time": 1725140490
  }
]
