[
  {
    "id": 38207024,
    "title": "கூகிள் வாங்கியதிலிருந்து நான் கற்றுக்கொண்டவை: ஸ்டார்ட்அப் நிறுவனர்களுக்கான பாடங்கள்",
    "originLink": "https://shreyans.org/google",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38207024",
    "commentBody": "",
    "originSummary": [
      "கூகுளால் பெறப்பட்ட தங்கள் ஸ்டார்ட்அப் பற்றிய நேரடி அனுபவத்தையும், அது வழங்கிய மதிப்புமிக்க அணுகல் மற்றும் வாய்ப்புகளையும் ஆசிரியர் பகிர்ந்து கொள்கிறார்.",
      "கூகிளின் விஷயங்களைச் செய்யும் முறை மற்றும் சரியான நபர்கள் மற்றும் இலக்குகளுடன் தன்னைச் சுற்றியுள்ள முக்கியத்துவத்தை அவர்கள் வலியுறுத்துகின்றனர்.",
      "ஆசிரியர் தொழில்நுட்ப மற்றும் செயல்முறைக் கடனின் தாக்கத்தையும், முக்கியமான சிக்கல்களைத் தீர்ப்பதற்கு முன்னுரிமை அளிக்க வேண்டியதன் அவசியத்தையும் விவாதிக்கிறார். கையகப்படுத்தலின் கலவையான முடிவுகளையும், கூகுளை விட்டு வெளியேறி தங்கள் சொந்த நிறுவனங்களைத் தொடங்குவதற்கான முடிவையும் அவர்கள் குறிப்பிடுகின்றனர்."
    ],
    "commentSummary": [
      "கூகுளால் கையகப்படுத்தப்பட்ட தங்கள் ஸ்டார்ட்அப் பற்றிய அவர்களின் நேரடி அனுபவத்தையும், நிறுவனத்தில் அவர்கள் இருந்த காலத்தில் அவர்கள் கற்றுக்கொண்ட பாடங்களையும் ஆசிரியர் பகிர்ந்து கொள்கிறார்.",
      "கூகிளில் கிடைக்கக்கூடிய அணுகல் மற்றும் வாய்ப்புகளைப் பற்றியும், கூகிளின் விஷயங்களைச் செய்வதற்கான வழிக்கு ஏற்ப தகவமைத்துக்கொள்வதன் முக்கியத்துவத்தையும், நிறுவனத்துடன் இலக்குகளை ஒருங்கிணைப்பதன் முக்கியத்துவத்தையும் அவர்கள் விவாதிக்கிறார்கள்.",
      "தொழில்நுட்ப மற்றும் செயல்முறைக் கடனின் தாக்கம், சரியான நபர்களுடன் உங்களைச் சுற்றியுள்ளதன் முக்கியத்துவம் மற்றும் முக்கியமான சிக்கல்களைத் தீர்ப்பதில் கவனம் செலுத்த வேண்டியதன் அவசியத்தை ஆசிரியர் வலியுறுத்துகிறார். கையகப்படுத்தலின் கலவையான முடிவுகளையும், கூகுளை விட்டு வெளியேறி தங்கள் சொந்த நிறுவனங்களைத் தொடங்குவதற்கான முடிவையும் அவர்கள் குறிப்பிடுகின்றனர்."
    ],
    "points": 859,
    "commentCount": 510,
    "retryCount": 0,
    "time": 1699546856
  },
  {
    "id": 38210574,
    "title": "மோனாஸ்பேஸ்: குறியீட்டுக்காக வடிவமைக்கப்பட்ட ஒரு புதுமையான எழுத்துரு சூப்பர் குடும்பம்",
    "originLink": "https://monaspace.githubnext.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38210574",
    "commentBody": "",
    "originSummary": [
      "மோனாஸ்பேஸ் என்பது குறியீட்டிற்காக குறிப்பாக வடிவமைக்கப்பட்ட ஒரு புதிய எழுத்துரு சூப்பர் குடும்பமாகும், இது தனிப்பயனாக்கக்கூடிய குறியீடு காட்சிக்காக மூன்று மாறும் அச்சுகளுடன் ஐந்து எழுத்துருக்களை வழங்குகிறது.",
      "டெக்ஸ்ச்சர் ஹீலிங் என்பது ஒரு தனித்துவமான அம்சமாகும், இது மோனோஸ்பேஸ் வகையின் அடர்த்தியை சமப்படுத்துகிறது, வாசிப்புத்திறனை மேம்படுத்துகிறது.",
      "மோனாஸ்பேஸ் நிரலாக்க மொழிகளுக்கான குறியீட்டு இணைப்புகளை உள்ளடக்கியது, இது குறியீட்டு அனுபவத்தை அழகியல் ரீதியாக மேம்படுத்துகிறது."
    ],
    "commentSummary": [
      "மோனாஸ்பேஸ் என்பது குறியீட்டிற்காக குறிப்பாக வடிவமைக்கப்பட்ட ஒரு தனித்துவமான எழுத்துரு குடும்பமாகும், இது தனிப்பயனாக்கக்கூடிய விருப்பங்களுடன் ஐந்து வெவ்வேறு எழுத்துருக்களை வழங்குகிறது.",
      "எழுத்துருவில் டெக்ஸ்ச்சர் ஹீலிங் அடங்கும், இது மோனோஸ்பேஸ் வகையின் காட்சி சமநிலை மற்றும் வாசிப்புத்திறனை மேம்படுத்துகிறது.",
      "மோனாஸ்பேஸ் பல்வேறு நிரலாக்க மொழிகளுக்கான குறியீட்டு இணைப்புகளையும் கொண்டுள்ளது, இது குறியீட்டு அனுபவத்தை மேம்படுத்துகிறது."
    ],
    "points": 435,
    "commentCount": 132,
    "retryCount": 0,
    "time": 1699560994
  },
  {
    "id": 38207866,
    "title": "தெரிந்து கொள்ள உங்களுக்கு உரிமை உள்ளது: உரிமைகோரல்களை மறுக்கும் மற்றும் விளக்கங்களை நிறுத்திவைக்கும் சுகாதார காப்பீட்டாளர்களை விசாரித்தல்",
    "originLink": "https://www.propublica.org/article/your-right-to-know-why-health-insurer-denied-claim",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38207866",
    "commentBody": "",
    "originSummary": [
      "சுகாதார காப்பீட்டாளர்கள் உரிமைகோரல்களை மறுப்பது மற்றும் கூட்டாட்சி விதிமுறைகளின்படி மறுப்புக்கான காரணங்களை விளக்கும் பதிவுகளை நோயாளிகளுக்கு வழங்கத் தவறுவது போன்ற நடைமுறையை ProPublica ஆராய்ந்தது.",
      "சில காப்பீட்டு நிறுவனங்கள் புரோபப்ளிகா தலையிட்ட பின்னரே பதிவுகளை வழங்கின, இது உரிமைகோரல் கோப்புகளை எவ்வாறு கோருவது மற்றும் சுகாதார வழங்குநர்கள் மற்றும் வழக்கறிஞர்களுடன் வளங்களைப் பகிர்வது குறித்த வழிகாட்டியை வெளியிடத் தூண்டியது.",
      "பல நோயாளிகள் தவறவிட்ட காலக்கெடு மற்றும் சம்மன்களுக்கான தவறான தேவைகள் போன்ற சவால்களை எதிர்கொண்டதாக புரோபப்ளிகா கண்டறிந்தது, இது ஐந்து காப்பீட்டு நிறுவனங்களை பதிலுக்கு தங்கள் கொள்கைகளை புதுப்பிக்கத் தூண்டியது."
    ],
    "commentSummary": [
      "உரிமைகோரல்களை மறுக்கும் மற்றும் கூட்டாட்சி விதிமுறைகளை மீறி, மறுப்புகளை விளக்கும் பதிவுகளை நோயாளிகளுக்கு வழங்கத் தவறிய சுகாதார காப்பீட்டு நிறுவனங்களை ProPublica விசாரித்தது.",
      "சில காப்பீட்டு நிறுவனங்கள் ProPublica தலையிட்ட பிறகு மட்டுமே பதிவுகளை வழங்கின, உரிமைகோரல் கோப்புகளை எவ்வாறு கோருவது மற்றும் சுகாதார வழங்குநர்கள் மற்றும் வழக்கறிஞர்களுடன் வளங்களைப் பகிர்வது என்பதற்கான வழிகாட்டியை வெளியிட அவர்களைத் தூண்டியது.",
      "ProPublica ஐந்து காப்பீட்டு நிறுவனங்களுடன் இந்த பிரச்சினையை எழுப்பியது, அவை கோரப்பட்ட தகவல்களை வழங்குவதற்கான தங்கள் கடமையை ஏற்றுக்கொண்டன மற்றும் பதிலுக்கு தங்கள் கொள்கைகளைப் புதுப்பித்தன."
    ],
    "points": 380,
    "commentCount": 197,
    "retryCount": 0,
    "time": 1699550365
  },
  {
    "id": 38212992,
    "title": "ஆப்பிள் இணை நிறுவனர் ஸ்டீவ் வோஸ்னியாக் திடீர் பக்கவாதம் காரணமாக மருத்துவமனையில் அனுமதி",
    "originLink": "https://www.bbc.co.uk/news/technology-67366306",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38212992",
    "commentBody": "",
    "originSummary": [
      "வோஸ் என்று அழைக்கப்படும் ஆப்பிள் இணை நிறுவனர் ஸ்டீவ் வோஸ்னியாக், மெக்சிகோ சிட்டியில் நடந்த ஒரு மாநாட்டில் இருந்தபோது லேசான பக்கவாதத்தால் பாதிக்கப்பட்டார்.",
      "73 வயதான வோஸ்னியாக் இந்த நிகழ்வின் போது மயக்கமடைந்து மருத்துவமனைக்கு கொண்டு செல்லப்பட்டார்.",
      "தவறாகப் பயன்படுத்துவது குறித்த கவலைகள் காரணமாக செயற்கை நுண்ணறிவை (ஏஐ) ஒழுங்குபடுத்துவதற்கு வோஸ்னியாக் குரல் கொடுத்து வருகிறார், ஆனால் அவரது பிரதிநிதிகள் இந்த சம்பவம் குறித்து இதுவரை கருத்து தெரிவிக்கவில்லை."
    ],
    "commentSummary": [
      "ஆப்பிள் நிறுவனத்தின் இணை நிறுவனர் ஸ்டீவ் வோஸ்னியாக், மெக்சிகோ சிட்டியில் நடந்த மாநாட்டில் கலந்து கொண்டபோது லேசான பக்கவாதத்தால் பாதிக்கப்பட்டு மருத்துவமனையில் அனுமதிக்கப்பட்டார்.",
      "முதல் ஆப்பிள் கம்ப்யூட்டரை கண்டுபிடித்து ஸ்டீவ் ஜாப்ஸுடன் இணைந்து நிறுவனத்தை நிறுவியதற்காக அறியப்பட்ட வோஸ்னியாக், தவறாகப் பயன்படுத்தப்படுவதைத் தடுக்க செயற்கை நுண்ணறிவு (ஏஐ) ஒழுங்குமுறைக்கு ஒரு வக்கீலாக இருந்து வருகிறார்.",
      "இந்த சம்பவம் குறித்து வோஸ்னியாக்கின் பிரதிநிதிகள் எந்த அதிகாரப்பூர்வ கருத்தையும் தெரிவிக்கவில்லை."
    ],
    "points": 368,
    "commentCount": 86,
    "retryCount": 0,
    "time": 1699573505
  },
  {
    "id": 38214915,
    "title": "குரல் கட்டுப்பாடு மூலம் கோடிங்: கர்சர்லெஸ் செருகுநிரலின் திறனை ஆராய்தல்",
    "originLink": "https://xeiaso.net/notes/cursorless-alien-magic/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38214915",
    "commentBody": "",
    "originSummary": [
      "குரல் கட்டுப்படுத்தப்பட்ட குறியீடு எடிட்டிங் செருகுநிரலான கர்சோர்லெஸுடன் ஆசிரியரின் அனுபவத்தை கட்டுரை எடுத்துக்காட்டுகிறது.",
      "குறிப்பிட்ட குறியீட்டு கூறுகளை அடையாளம் காணவும் கையாளவும் நங்கூரங்கள் மற்றும் வண்ண-குறியீட்டு தொப்பிகளைப் பயன்படுத்துகிறது.",
      "ஆசிரியர் கர்சோர்லெஸில் கிடைக்கும் தனிப்பயனாக்க விருப்பங்களை ஆராய்கிறார் மற்றும் டாலோன் பிணைப்புகளைப் பயன்படுத்தி கோ நிரலாக்கத்தில் வாக்கிய அமைப்பை மறுவரையறை செய்வதற்கான சோதனைகள் செய்கிறார். குரல் குறியீட்டுக்கான கிட்ஹப் கோபிலட்டின் குரல் பீட்டாவுடன் டாலோனை ஒப்பிடுவதில் அவர்கள் ஆர்வத்தை வெளிப்படுத்துகிறார்கள்."
    ],
    "commentSummary": [
      "கர்சோர்லெஸ் என்பது குரல் கட்டுப்பாடு மூலம் குறியீடு எடிட்டிங்கை செயல்படுத்தும் ஒரு செருகுநிரல் ஆகும், இது தேர்வு அல்லது நீக்குதல் போன்ற செயல்களுக்கான குறியீட்டு கூறுகளை அடையாளம் காண ஆங்கர்கள் மற்றும் வண்ண-குறியீட்டு தொப்பிகளைப் பயன்படுத்துகிறது.",
      "தனிப்பயன் கட்டளைகளை உருவாக்கும் திறன் மற்றும் டாலோன் பிணைப்புகளைப் பயன்படுத்தி கோ நிரலாக்கத்தில் வாக்கிய அமைப்பை மறுவரையறை செய்வதில் அதன் பயன்பாடு உள்ளிட்ட கர்சோர்லெஸின் திறனை கட்டுரை விவாதிக்கிறது.",
      "குரல் குறியீட்டுக்கான கிட்ஹப் கோபிலோட்டின் குரல் பீட்டாவுடன் டாலோனை ஒப்பிடுவது குறித்த ஆர்வத்தை ஆசிரியர் வெளிப்படுத்துகிறார்."
    ],
    "points": 336,
    "commentCount": 131,
    "retryCount": 0,
    "time": 1699589050
  },
  {
    "id": 38204733,
    "title": "இணைய உலாவி எஞ்சின் அம்சங்களை மேம்படுத்த செர்வோ மானியம் பெறுகிறது",
    "originLink": "https://servo.org/blog/2023/11/06/nlgrant-announcement/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38204733",
    "commentBody": "",
    "originSummary": [
      "இணைய உலாவி இயந்திரமான செர்வோ, அதன் அம்சங்களை மேம்படுத்த என்எல்நெட் அறக்கட்டளையிடமிருந்து மானியத்தைப் பெற்றுள்ளது.",
      "மிதவை ஆதரவை நிறைவு செய்வது, இன்லைன் தளவமைப்பில் அதிக மொழிகளை ஆதரிப்பது மற்றும் அட்டவணைகளுக்கு ஆரம்ப ஆதரவைச் சேர்ப்பது ஆகியவற்றில் மானியம் கவனம் செலுத்தும்.",
      "மிதவைகளை செயல்படுத்துவதில் செர்வோ ஏற்கனவே 82.2% தேர்ச்சி விகிதத்தை அடைந்துள்ளார், மேலும் லத்தீன் அல்லாத எழுத்து மொழிகளுக்கான ஆதரவை அதிகரிக்கும் பணியில் ஈடுபட்டுள்ளார். விக்கிப்பீடியாவில் அட்டவணைகளை சரியாக வழங்குவதே இறுதி இலக்கு."
    ],
    "commentSummary": [
      "இணைய உலாவி இயந்திரமான செர்வோ, அதன் அம்சங்களை மேம்படுத்த என்.எல்.நெட் அறக்கட்டளையிலிருந்து மானியம் வழங்கப்பட்டுள்ளது.",
      "மிதவை ஆதரவை முடிக்கவும், இன்லைன் தளவமைப்பில் அதிக மொழிகளை ஆதரிக்கவும், அட்டவணைகளுக்கு ஆரம்ப ஆதரவைச் சேர்க்கவும் மானியம் பயன்படுத்தப்படும்.",
      "செர்வோ ஏற்கனவே 82.2% தேர்ச்சி விகிதத்துடன் மிதவைகளை செயல்படுத்துவதில் முன்னேற்றம் கண்டுள்ளது, மேலும் லத்தீன் அல்லாத அகரவரிசை மொழிகளில் உள்ளடக்கத்தைக் காண்பிப்பதற்கான ஆதரவை மேம்படுத்துவதிலும் பணியாற்றி வருகிறது."
    ],
    "points": 323,
    "commentCount": 76,
    "retryCount": 0,
    "time": 1699536613
  },
  {
    "id": 38212453,
    "title": "மைக்ரோசாப்டின் புதிய அவுட்லுக் பயனர்களின் IMAP நற்சான்றிதழ்களை அனுப்புவதால் தனியுரிமை கவலைகள் எழுகின்றன",
    "originLink": "https://www-heise-de.translate.goog/news/Microsoft-krallt-sich-Zugangsdaten-Achtung-vorm-neuen-Outlook-9357691.html?_x_tr_sl=de&_x_tr_tl=en&_x_tr_hl=de",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38212453",
    "commentBody": "",
    "originSummary": [
      "விண்டோஸில் மெயில் நிரலை மாற்றுவதற்கான மைக்ரோசாப்டின் வரவிருக்கும் இலவச பதிப்பான அவுட்லுக், பயனர்களின் ஐஎம்ஏபி மற்றும் எஸ்எம்டிபி அணுகல் தரவை மைக்ரோசாஃப்ட் சேவையகங்களுக்கு அனுப்புவது குறித்து கவலைகளை எழுப்பியுள்ளது.",
      "இந்த பரிமாற்றம் பயனர்களின் மின்னஞ்சல்களைப் படிக்கவும் பகுப்பாய்வு செய்யவும் மைக்ரோசாப்ட்டை அனுமதிக்கிறது, இது அவர்களின் நோக்கங்களைப் பற்றிய கேள்விகளைத் தூண்டியுள்ளது.",
      "ஜிமெயில் மற்றும் ஐஎம்ஏபியில் காணப்படாத தனித்துவமான அம்சங்களை வழங்கிய போதிலும், புதிய அவுட்லுக்கைப் பயன்படுத்தலாமா என்பதை கவனமாக பரிசீலிக்குமாறு பயனர்களுக்கு அறிவுறுத்தும் எச்சரிக்கைகள் வெளியிடப்பட்டுள்ளன."
    ],
    "commentSummary": [
      "விண்டோஸில் மெயில் நிரலுக்கு மாற்றாக அமைக்கப்பட்டுள்ள மைக்ரோசாப்டின் வரவிருக்கும் அவுட்லுக்கின் இலவச பதிப்பு, பயனர்களின் ஐஎம்ஏபி மற்றும் எஸ்எம்டிபி அணுகல் தரவை மைக்ரோசாஃப்ட் சேவையகங்களுக்கு அனுப்புவது குறித்து கவலைகளை எழுப்பியுள்ளது.",
      "இந்த தரவு பரிமாற்றம் பயனர்களின் மின்னஞ்சல்களைப் படித்து பகுப்பாய்வு செய்யும் திறனை மைக்ரோசாப்ட்டுக்கு வழங்குகிறது, இது அவர்களின் நோக்கங்களைப் பற்றிய கேள்விகளைத் தூண்டுகிறது மற்றும் கவனமாக பரிசீலிக்காமல் புதிய அவுட்லுக்கைப் பயன்படுத்துவது குறித்த எச்சரிக்கைகளைத் தூண்டுகிறது.",
      "ஜிமெயில் மற்றும் ஐஎம்ஏபி உடன் ஒப்பிடும்போது தனித்துவமான அம்சங்களை வழங்கிய போதிலும், தரவு பரிமாற்ற பிரச்சினை பயனர்களிடையே சங்கடத்தை ஏற்படுத்தியுள்ளது."
    ],
    "points": 278,
    "commentCount": 62,
    "retryCount": 0,
    "time": 1699569900
  },
  {
    "id": 38212749,
    "title": "அப்பல்லோ விண்வெளி வீரர் பிராங்க் போர்மன் காலமானார்",
    "originLink": "https://www.washingtonpost.com/obituaries/2023/11/09/frank-borman-astronaut-eastern-dead/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38212749",
    "commentBody": "",
    "originSummary": [
      "நாசாவின் திறமையான விண்வெளி வீரரும், ஈஸ்டர்ன் ஏர் லைன்ஸ் நிறுவனத்தின் முன்னாள் தலைமை நிர்வாக அதிகாரியுமான பிராங்க் போர்மன் காலமானார்.",
      "அப்பல்லோ 8 திட்டத்தின் போது நீண்ட கால விண்வெளி பயணங்களின் சாத்தியக்கூறுகளை நிரூபிப்பதில் போர்மன் முக்கிய பங்கு வகித்தார்.",
      "அவரும் அவரது குழுவினரும் நிலவைச் சுற்றி பூமியின் ஈர்ப்புப் புலத்தை விட்டு வெளியேறிய முதல் மனிதர்கள் என்ற குறிப்பிடத்தக்க மைல்கல்லை அடைந்தனர்."
    ],
    "commentSummary": [
      "நாசா விண்வெளி வீரரும், ஈஸ்டர்ன் ஏர் லைன்ஸ் நிறுவனத்தின் முன்னாள் தலைமை நிர்வாக அதிகாரியுமான பிராங்க் போர்மன் தனது 95 வயதில் காலமானார்.",
      "வரலாற்று சிறப்புமிக்க அப்போலோ 8 திட்டத்தின் போது நீண்ட கால விண்வெளி பயணங்களின் சாத்தியக்கூறுகளை நிரூபிப்பதில் போர்மன் முக்கிய பங்கு வகித்தார்.",
      "இவரும் அவரது குழுவினரும் பூமியின் ஈர்ப்பு விசையைத் தாண்டி சந்திரனைச் சுற்றி வந்த முதல் நபர்கள் ஆவர்."
    ],
    "points": 252,
    "commentCount": 78,
    "retryCount": 0,
    "time": 1699571657
  },
  {
    "id": 38207744,
    "title": "அனுமதியின்றி குறுஞ்செய்திகள் மற்றும் அழைப்பு பதிவுகளை அறுவடை செய்ய கார்கள் அனுமதிக்கப்படுகின்றன: நீதிமன்றம்",
    "originLink": "https://www.theregister.com/2023/11/09/car_text_harvesting/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38207744",
    "commentBody": "",
    "originSummary": [
      "இணைக்கப்பட்ட ஸ்மார்ட்போன்களிலிருந்து உரை செய்திகள் மற்றும் அழைப்பு பதிவுகளை சேமிப்பது தொடர்பாக ஹோண்டா, டொயோட்டா, ஃபோக்ஸ்வேகன் மற்றும் ஜெனரல் மோட்டார்ஸ் உள்ளிட்ட கார் உற்பத்தியாளர்களுக்கு எதிரான ஐந்து வர்க்க நடவடிக்கை வழக்குகளை வாஷிங்டன் மேல்முறையீட்டு நீதிமன்றம் தள்ளுபடி செய்தது.",
      "உரிமைகோரல்கள் வாஷிங்டன் தனியுரிமைச் சட்டத்தின் சட்டப்பூர்வ காயத் தேவைகளைப் பூர்த்தி செய்யவில்லை என்று நீதிமன்றம் தீர்ப்பளித்தது, தனியுரிமை மீறல் உண்மையானதை விட சாத்தியமானதாகக் கருதப்படுகிறது.",
      "கார் உற்பத்தியாளர்கள் இப்போது ஒப்புதல் இல்லாமல் உரை செய்திகள் மற்றும் அழைப்பு பதிவுகளை இடைமறிக்க, பதிவுசெய்ய, பதிவிறக்கம் செய்ய, சேமிக்க மற்றும் அனுப்ப அனுமதிக்கப்படுகிறார்கள். உச்சநீதிமன்றத்தில் மேலும் மேல்முறையீடு செய்ய வாய்ப்புள்ளது."
    ],
    "commentSummary": [
      "இணைக்கப்பட்ட ஸ்மார்ட்போன்களிலிருந்து உரை செய்திகள் மற்றும் அழைப்பு பதிவுகளை சேமிப்பதன் மூலம் கார் உற்பத்தியாளர்கள் தனியுரிமை சட்டங்களை மீறவில்லை என்று வாஷிங்டன் மேல்முறையீட்டு நீதிமன்றம் தீர்ப்பளித்துள்ளது.",
      "இந்த உரிமைகோரல்கள் வாஷிங்டன் தனியுரிமைச் சட்டத்தின் தேவைகளைப் பூர்த்தி செய்யவில்லை என்று கூறி நீதிமன்றம் ஐந்து வர்க்க நடவடிக்கை வழக்குகளை தள்ளுபடி செய்தது.",
      "தனியுரிமை மீறல் உண்மையானதை விட சாத்தியமானதாகக் கருதப்படுவதால், இது அனுமதியின்றி உரை செய்திகள் மற்றும் அழைப்பு பதிவுகளை இடைமறிக்கவும் சேமிக்கவும் கார்களை அனுமதிக்கிறது. உச்சநீதிமன்றத்தில் மேலும் மேல்முறையீடு செய்ய வாய்ப்புள்ளது."
    ],
    "points": 218,
    "commentCount": 147,
    "retryCount": 0,
    "time": 1699549919
  },
  {
    "id": 38204430,
    "title": "பெஞ்ச்மார்க்கிங் ஜிபிடி -4 டர்போ: அதன் செயல்திறன் மற்றும் சாத்தியமான வரம்புகள் பற்றிய நுண்ணறிவுகள்",
    "originLink": "https://blog.mentat.ai/benchmarking-gpt-4-turbo-a-cautionary-tale",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38204430",
    "commentBody": "",
    "originSummary": [
      "குறியீடு எடிட்டிங் மாடலான ஜிபிடி -4 டர்போ, அதன் முன்னோடி ஜிபிடி -4 உடன் ஒப்பிடும்போது சற்று குறைவான பணிகளை தீர்க்கிறது என்பதை பெஞ்ச்மார்க்கிங் முடிவுகள் வெளிப்படுத்துகின்றன, இது தெளிவற்ற வழிமுறைகள் காரணமாக இருக்கலாம்.",
      "ஜிபிடி -4 பயிற்சி பணிகளை மிகவும் திறம்பட மனப்பாடம் செய்ததாகத் தெரிகிறது, அதே நேரத்தில் ஜிபிடி -4 டர்போ இந்த நினைவாற்றல் திறனில் சிலவற்றை இழந்துவிட்டதாகத் தெரிகிறது.",
      "மாதிரிகளைக் காட்டாமல் நடத்தப்பட்ட கூடுதல் அளவுகோல்கள் ஜிபிடி -4 டர்போவை விட ஜிபிடி -4 அதிக அளவிலான பயிற்சிகளைக் கொண்டுள்ளது என்பதை நிரூபிக்கிறது.",
      "எதிர்காலத்தில் வெவ்வேறு மாதிரிகளின் செயல்திறனை துல்லியமாக மதிப்பிடுவதற்கு சிறந்த அளவுகோல்களை உருவாக்குவதன் முக்கியத்துவத்தையும் மதிப்பீட்டு செயல்முறையை மேம்படுத்துவதன் முக்கியத்துவத்தையும் இந்த கட்டுரை எடுத்துக்காட்டுகிறது."
    ],
    "commentSummary": [
      "குறியீடு எடிட்டிங் மாடலான ஜிபிடி -4 டர்போவின் பெஞ்ச்மார்க்கிங் முடிவுகள் அதன் முன்னோடி ஜிபிடி -4 உடன் ஒப்பிடப்பட்டன.",
      "ஜிபிடி -4 டர்போ முதல் முயற்சியில் சற்று குறைவான பணிகளை தீர்க்கிறது, இது தெளிவற்ற வழிமுறைகள் காரணமாக இருக்கலாம்.",
      "ஜிபிடி -4 டர்போவுடன் ஒப்பிடும்போது ஜிபிடி -4 அதிக பயிற்சிகளைக் கொண்டிருந்தது, இது நினைவாற்றல் திறனில் வேறுபாட்டைக் குறிக்கிறது."
    ],
    "points": 217,
    "commentCount": 108,
    "retryCount": 0,
    "time": 1699534853
  },
  {
    "id": 38213158,
    "title": "வேகமாக தட்டச்சு செய்தல்: திறவுகோல் தாமதம், த்ரோபுட் அல்ல",
    "originLink": "https://two-wrongs.com/typing-fast-is-about-latency-not-throughput",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38213158",
    "commentBody": "",
    "originSummary": [
      "நிமிடத்திற்கு 80 வார்த்தைகளுக்கு மேல் தட்டச்சு செய்யும் வேகம் கணினி வேலைக்கு முக்கியமல்ல என்ற தவறான கருத்தை இந்த கட்டுரை உடைக்கிறது.",
      "நிமிடத்திற்கு தட்டச்சு செய்யப்படும் சொற்களின் எண்ணிக்கை அல்ல, ஆனால் ஒவ்வொரு வார்த்தையையும் தட்டச்சு செய்வதில் உள்ள தாமதம் தான் முக்கியம் என்று ஆசிரியர் வாதிடுகிறார்.",
      "வேகமான தட்டச்சு விரைவான திருத்தங்கள், வாக்கிய அமைப்பு மற்றும் குறியீட்டுக்கு உதவுகிறது, இது மேம்பட்ட உற்பத்தித்திறன் மற்றும் சிந்தனை ஓட்டத்திற்கு வழிவகுக்கிறது."
    ],
    "commentSummary": [
      "கணினி வேலைக்கு நிமிடத்திற்கு 80 வார்த்தைகளுக்கு மேல் தட்டச்சு வேகம் முக்கியமல்ல என்ற தவறான கருத்தை இந்த கட்டுரை உடைக்கிறது.",
      "இது நிமிடத்திற்கு தட்டச்சு செய்யப்பட்ட சொற்களின் எண்ணிக்கையைப் பற்றியது மட்டுமல்ல, ஒவ்வொரு வார்த்தையையும் தட்டச்சு செய்வதற்கான தாமதத்தையும் பற்றியது என்று ஆசிரியர் வாதிடுகிறார்.",
      "வேகமான தட்டச்சு விரைவான திருத்தங்கள் மற்றும் வாக்கியங்கள் அல்லது குறியீட்டை ஒழுங்கமைக்க உதவுகிறது, இது மேம்பட்ட உற்பத்தித்திறன் மற்றும் சிந்தனை ஓட்டத்திற்கு வழிவகுக்கிறது."
    ],
    "points": 180,
    "commentCount": 132,
    "retryCount": 0,
    "time": 1699574760
  }
]
