[
  {
    "id": 38207024,
    "title": "Τι έμαθα από την εξαγορά μου από την Google: Google: Μαθήματα για ιδρυτές νεοφυών επιχειρήσεων",
    "originLink": "https://shreyans.org/google",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38207024",
    "commentBody": "",
    "originSummary": [
      "Ο συγγραφέας μοιράζεται από πρώτο χέρι την εμπειρία του από την εξαγορά της νεοσύστατης επιχείρησής του από την Google και την πολύτιμη πρόσβαση και τις ευκαιρίες που του παρείχε.",
      "Υπογραμμίζουν τη σημασία της προσαρμογής στον τρόπο λειτουργίας της Google και του να περιβάλλεται κανείς από τους σωστούς ανθρώπους και στόχους.",
      "Ο συγγραφέας αναλύει τον αντίκτυπο του τεχνικού χρέους και του χρέους διαδικασιών, καθώς και την ανάγκη να δοθεί προτεραιότητα στην επίλυση σημαντικών προβλημάτων. Αναφέρουν επίσης τα μικτά αποτελέσματα της εξαγοράς και την απόφασή τους να εγκαταλείψουν την Google και να ξεκινήσουν τις δικές τους εταιρείες."
    ],
    "commentSummary": [
      "Ο συγγραφέας μοιράζεται από πρώτο χέρι την εμπειρία του από την εξαγορά της νεοσύστατης επιχείρησής του από την Google και τα μαθήματα που πήρε κατά τη διάρκεια της θητείας του στην εταιρεία.",
      "Συζητούν για την πρόσβαση και τις ευκαιρίες που προσφέρει η Google, καθώς και για τη σημασία της προσαρμογής στον τρόπο λειτουργίας της Google και της ευθυγράμμισης των στόχων με την εταιρεία.",
      "Ο συγγραφέας τονίζει τον αντίκτυπο του τεχνικού χρέους και του χρέους διαδικασιών, τη σημασία του να περιβάλλεται κανείς από τους σωστούς ανθρώπους και την ανάγκη να εστιάζει στην επίλυση σημαντικών προβλημάτων. Αναφέρουν επίσης τα μικτά αποτελέσματα της εξαγοράς και την απόφασή τους να εγκαταλείψουν την Google και να ξεκινήσουν τις δικές τους εταιρείες."
    ],
    "points": 859,
    "commentCount": 510,
    "retryCount": 0,
    "time": 1699546856
  },
  {
    "id": 38210574,
    "title": "Monaspace: Σχεδιασμένη για κώδικα",
    "originLink": "https://monaspace.githubnext.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38210574",
    "commentBody": "",
    "originSummary": [
      "Η Monaspace είναι μια νέα υπερ-οικογένεια γραμματοσειρών σχεδιασμένη ειδικά για κώδικα, προσφέροντας πέντε γραμματοσειρές με τρεις μεταβλητούς άξονες για προσαρμόσιμη εμφάνιση κώδικα.",
      "Το Texture Healing είναι ένα χαρακτηριστικό που ξεχωρίζει και εξισορροπεί την πυκνότητα των μονοδιάστιχων γραμματοσειρών, βελτιώνοντας την αναγνωσιμότητα.",
      "Το Monaspace περιλαμβάνει συνδέσμους κώδικα για γλώσσες προγραμματισμού, βελτιώνοντας αισθητικά την εμπειρία της κωδικοποίησης."
    ],
    "commentSummary": [
      "Η Monaspace είναι μια μοναδική οικογένεια γραμματοσειρών που έχει σχεδιαστεί ειδικά για κώδικα, προσφέροντας πέντε διαφορετικές γραμματοσειρές με παραμετροποιήσιμες επιλογές.",
      "Η γραμματοσειρά περιλαμβάνει το Texture Healing, το οποίο βελτιώνει την οπτική ισορροπία και την αναγνωσιμότητα των μονοδιάστιχων γραμματοσειρών.",
      "Το Monaspace διαθέτει επίσης κωδικές ligatures για διάφορες γλώσσες προγραμματισμού, βελτιώνοντας την εμπειρία της κωδικοποίησης."
    ],
    "points": 435,
    "commentCount": 132,
    "retryCount": 0,
    "time": 1699560994
  },
  {
    "id": 38207866,
    "title": "Έχετε το δικαίωμα να γνωρίζετε: Ασφαλιστές Υγείας που αρνούνται απαιτήσεις και παρακρατούν εξηγήσεις",
    "originLink": "https://www.propublica.org/article/your-right-to-know-why-health-insurer-denied-claim",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38207866",
    "commentBody": "",
    "originSummary": [
      "Η ProPublica διερεύνησε την πρακτική των ασφαλιστών υγείας να αρνούνται τις απαιτήσεις και να μην παρέχουν στους ασθενείς αρχεία που εξηγούν τους λόγους της άρνησης, όπως απαιτείται από τους ομοσπονδιακούς κανονισμούς.",
      "Ορισμένες ασφαλιστικές εταιρείες παρείχαν τα αρχεία μόνο μετά την παρέμβαση της ProPublica, με αποτέλεσμα να δημοσιευθεί ένας οδηγός για το πώς να ζητηθούν αρχεία απαιτήσεων και να μοιραστούν πόρους με παρόχους υγειονομικής περίθαλψης και υποστηρικτές.",
      "Η ProPublica διαπίστωσε ότι πολλοί ασθενείς αντιμετώπιζαν προκλήσεις, όπως χαμένες προθεσμίες και λανθασμένες απαιτήσεις για κλήτευση, γεγονός που ώθησε πέντε ασφαλιστικές εταιρείες να ενημερώσουν τις πολιτικές τους ως απάντηση."
    ],
    "commentSummary": [
      "Η ProPublica διερεύνησε ασφαλιστές υγείας που αρνούνταν απαιτήσεις και δεν παρείχαν στους ασθενείς αρχεία που εξηγούσαν τις αρνήσεις, κατά παράβαση των ομοσπονδιακών κανονισμών.",
      "Ορισμένοι ασφαλιστές παρείχαν τα αρχεία μόνο μετά την παρέμβαση της ProPublica, γεγονός που τους ώθησε να δημοσιεύσουν έναν οδηγό για το πώς να ζητούν αρχεία αξιώσεων και να μοιράζονται πόρους με παρόχους υγειονομικής περίθαλψης και υποστηρικτές.",
      "Η ProPublica έθεσε το θέμα σε πέντε ασφαλιστικές εταιρείες, οι οποίες αναγνώρισαν την υποχρέωσή τους να παρέχουν τις ζητούμενες πληροφορίες και ενημέρωσαν τις πολιτικές τους σε απάντηση."
    ],
    "points": 380,
    "commentCount": 197,
    "retryCount": 0,
    "time": 1699550365
  },
  {
    "id": 38212992,
    "title": "Ο συνιδρυτής της Apple Steve Wozniak νοσηλεύεται στο νοσοκομείο μετά από ελαφρύ εγκεφαλικό επεισόδιο",
    "originLink": "https://www.bbc.co.uk/news/technology-67366306",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38212992",
    "commentBody": "",
    "originSummary": [
      "Ο συνιδρυτής της Apple Steve Wozniak, γνωστός ως Woz, υπέστη ελαφρύ εγκεφαλικό επεισόδιο ενώ βρισκόταν σε συνέδριο στην Πόλη του Μεξικού.",
      "Ο Wozniak, 73 ετών, μεταφέρθηκε στο νοσοκομείο αφού λιποθύμησε κατά τη διάρκεια της εκδήλωσης.",
      "Ο Wozniak έχει ταχθεί υπέρ της ρύθμισης της τεχνητής νοημοσύνης (AI) λόγω των ανησυχιών για την κατάχρηση, αλλά οι εκπρόσωποί του δεν έχουν ακόμη σχολιάσει το περιστατικό."
    ],
    "commentSummary": [
      "Ο Steve Wozniak, συνιδρυτής της Apple, υπέστη ελαφρύ εγκεφαλικό επεισόδιο ενώ συμμετείχε σε συνέδριο στην Πόλη του Μεξικού και μεταφέρθηκε στο νοσοκομείο.",
      "Ο Wozniak, ο οποίος είναι γνωστός για την εφεύρεση του πρώτου υπολογιστή της Apple και τη συνίδρυση της εταιρείας με τον Steve Jobs, έχει ταχθεί υπέρ της ρύθμισης της τεχνητής νοημοσύνης (AI) για την αποτροπή της κατάχρησης.",
      "Οι εκπρόσωποι του Wozniak δεν έχουν κάνει κανένα επίσημο σχόλιο σχετικά με το περιστατικό."
    ],
    "points": 368,
    "commentCount": 86,
    "retryCount": 0,
    "time": 1699573505
  },
  {
    "id": 38214915,
    "title": "Κωδικοποίηση με φωνητικό έλεγχο: Cursorless Plugin",
    "originLink": "https://xeiaso.net/notes/cursorless-alien-magic/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38214915",
    "commentBody": "",
    "originSummary": [
      "Το άρθρο υπογραμμίζει την εμπειρία του συγγραφέα με το Cursorless, ένα πρόσθετο επεξεργασίας κώδικα με φωνητικό έλεγχο.",
      "Το Cursorless χρησιμοποιεί άγκυρες και χρωματικά κωδικοποιημένα καπέλα για τον εντοπισμό και τον χειρισμό συγκεκριμένων στοιχείων κώδικα.",
      "Ο συγγραφέας εξερευνά τις επιλογές προσαρμογής που είναι διαθέσιμες στο Cursorless και πειραματίζεται με τον επαναπροσδιορισμό της σύνταξης στον προγραμματισμό Go χρησιμοποιώντας δεσμεύσεις Talon. Εκφράζουν ενδιαφέρον για τη σύγκριση του Talon με το voice beta του GitHub Copilot για τη φωνητική κωδικοποίηση."
    ],
    "commentSummary": [
      "Το Cursorless είναι ένα πρόσθετο που επιτρέπει την επεξεργασία κώδικα μέσω φωνητικού ελέγχου, χρησιμοποιώντας άγκυρες και χρωματικά κωδικοποιημένα καπέλα για να αναγνωρίζει στοιχεία κώδικα για ενέργειες όπως η επιλογή ή η διαγραφή.",
      "Το άρθρο εξετάζει τις δυνατότητες του Cursorless, συμπεριλαμβανομένης της δυνατότητας δημιουργίας προσαρμοσμένων εντολών και της χρήσης του για τον επαναπροσδιορισμό της σύνταξης στον προγραμματισμό Go με χρήση δεσμών Talon.",
      "Ο συγγραφέας εκφράζει την περιέργειά του να συγκρίνει το Talon με το voice beta του GitHub Copilot για τη φωνητική κωδικοποίηση."
    ],
    "points": 336,
    "commentCount": 131,
    "retryCount": 0,
    "time": 1699589050
  },
  {
    "id": 38204733,
    "title": "Η Servo λαμβάνει επιχορήγηση για τη βελτίωση των χαρακτηριστικών του μηχανισμού περιήγησης στο Web",
    "originLink": "https://servo.org/blog/2023/11/06/nlgrant-announcement/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38204733",
    "commentBody": "",
    "originSummary": [
      "Το Servo, ένα πρόγραμμα περιήγησης στο διαδίκτυο, έλαβε επιχορήγηση από το Ίδρυμα NLnet για τη βελτίωση των χαρακτηριστικών του.",
      "Η επιχορήγηση θα επικεντρωθεί στην ολοκλήρωση της υποστήριξης float, στην υποστήριξη περισσότερων γλωσσών σε γραμμική διάταξη και στην προσθήκη αρχικής υποστήριξης για πίνακες.",
      "Το Servo έχει ήδη επιτύχει ποσοστό επιτυχίας 82,2% στην εφαρμογή floats και εργάζεται για την ενίσχυση της υποστήριξης για γλώσσες με μη λατινικό αλφάβητο. Ο απώτερος στόχος είναι η σωστή απόδοση των πινάκων στη Wikipedia."
    ],
    "commentSummary": [
      "Το Servo, ένα πρόγραμμα περιήγησης στο διαδίκτυο, έχει λάβει επιχορήγηση από το NLnet Foundation για τη βελτίωση των χαρακτηριστικών του.",
      "Η επιχορήγηση θα χρησιμοποιηθεί για να ολοκληρωθεί η υποστήριξη πλωτών μέσων, να υποστηριχθούν περισσότερες γλώσσες σε γραμμική διάταξη και να προστεθεί αρχική υποστήριξη για πίνακες.",
      "Το Servo έχει ήδη σημειώσει πρόοδο στην εφαρμογή των floats, με ποσοστό επιτυχίας 82,2%, και εργάζεται επίσης για τη βελτίωση της υποστήριξης για την εμφάνιση περιεχομένου σε γλώσσες με μη λατινικό αλφάβητο."
    ],
    "points": 323,
    "commentCount": 76,
    "retryCount": 0,
    "time": 1699536613
  },
  {
    "id": 38212453,
    "title": "Ανησυχίες για το απόρρητο προκύπτουν καθώς το νέο Outlook της Microsoft μεταδίδει τα διαπιστευτήρια IMAP των χρηστών",
    "originLink": "https://www-heise-de.translate.goog/news/Microsoft-krallt-sich-Zugangsdaten-Achtung-vorm-neuen-Outlook-9357691.html?_x_tr_sl=de&_x_tr_tl=en&_x_tr_hl=de",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38212453",
    "commentBody": "",
    "originSummary": [
      "Η επερχόμενη δωρεάν έκδοση του Outlook της Microsoft, που προορίζεται να αντικαταστήσει το πρόγραμμα Mail στα Windows, έχει προκαλέσει ανησυχίες σχετικά με τη μετάδοση των δεδομένων πρόσβασης IMAP και SMTP των χρηστών στους διακομιστές της Microsoft.",
      "Αυτή η μετάδοση επιτρέπει στη Microsoft να διαβάζει και να αναλύει τα μηνύματα ηλεκτρονικού ταχυδρομείου των χρηστών, γεγονός που έχει προκαλέσει ερωτήματα σχετικά με τις προθέσεις της.",
      "Παρά το γεγονός ότι προσφέρει μοναδικά χαρακτηριστικά που δεν υπάρχουν στο Gmail και το IMAP, έχουν εκδοθεί προειδοποιήσεις που συμβουλεύουν τους χρήστες να εξετάσουν προσεκτικά αν θα χρησιμοποιήσουν το νέο Outlook."
    ],
    "commentSummary": [
      "Η επερχόμενη δωρεάν έκδοση του Outlook της Microsoft, που πρόκειται να αντικαταστήσει το πρόγραμμα Mail στα Windows, έχει προκαλέσει ανησυχίες σχετικά με τη μετάδοση των δεδομένων πρόσβασης IMAP και SMTP των χρηστών στους διακομιστές της Microsoft.",
      "Αυτή η μετάδοση δεδομένων δίνει στη Microsoft τη δυνατότητα να διαβάζει και να αναλύει τα μηνύματα ηλεκτρονικού ταχυδρομείου των χρηστών, εγείροντας ερωτήματα σχετικά με τις προθέσεις τους και προκαλώντας προειδοποιήσεις για τη χρήση του νέου Outlook χωρίς προσεκτική εξέταση.",
      "Παρά το γεγονός ότι προσφέρει μοναδικά χαρακτηριστικά σε σύγκριση με το Gmail και το IMAP, το ζήτημα της μετάδοσης δεδομένων έχει δημιουργήσει ανησυχία στους χρήστες."
    ],
    "points": 278,
    "commentCount": 62,
    "retryCount": 0,
    "time": 1699569900
  },
  {
    "id": 38212749,
    "title": "Ο αστροναύτης του Apollo Frank Borman πέθανε στα 95 του χρόνια",
    "originLink": "https://www.washingtonpost.com/obituaries/2023/11/09/frank-borman-astronaut-eastern-dead/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38212749",
    "commentBody": "",
    "originSummary": [
      "Ο Frank Borman, ένας επιτυχημένος αστροναύτης της NASA και πρώην διευθύνων σύμβουλος της Eastern Air Lines, απεβίωσε σε ηλικία 95 ετών.",
      "Ο Borman έπαιξε καθοριστικό ρόλο στην επίδειξη της δυνατότητας πραγματοποίησης διαστημικών πτήσεων μεγάλης διάρκειας κατά τη διάρκεια της αποστολής Apollo 8.",
      "Ο ίδιος και οι σύντροφοί του στο πλήρωμά του πέτυχαν ένα σημαντικό ορόσημο, καθώς έγιναν οι πρώτοι άνθρωποι που τέθηκαν σε τροχιά γύρω από το φεγγάρι και εγκατέλειψαν το βαρυτικό πεδίο της Γης."
    ],
    "commentSummary": [
      "Ο Frank Borman, αστροναύτης της NASA και πρώην διευθύνων σύμβουλος της Eastern Air Lines, πέθανε σε ηλικία 95 ετών.",
      "Ο Borman έπαιξε ζωτικό ρόλο στην επίδειξη της δυνατότητας πραγματοποίησης διαστημικών πτήσεων μεγάλης διάρκειας κατά τη διάρκεια της ιστορικής αποστολής Apollo 8.",
      "Αυτός και το πλήρωμά του ήταν οι πρώτοι που ταξίδεψαν πέρα από το βαρυτικό πεδίο της Γης και τέθηκαν σε τροχιά γύρω από το φεγγάρι."
    ],
    "points": 252,
    "commentCount": 78,
    "retryCount": 0,
    "time": 1699571657
  },
  {
    "id": 38207744,
    "title": "Τα αυτοκίνητα επιτρέπεται να συγκεντρώνουν κείμενα και αρχεία καταγραφής κλήσεων χωρίς άδεια, σύμφωνα με το Δικαστήριο",
    "originLink": "https://www.theregister.com/2023/11/09/car_text_harvesting/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38207744",
    "commentBody": "",
    "originSummary": [
      "Εφετείο της Ουάσινγκτον απορρίπτει πέντε ομαδικές αγωγές κατά κατασκευαστών αυτοκινήτων, συμπεριλαμβανομένων των Honda, Toyota, Volkswagen και General Motors, σχετικά με την αποθήκευση μηνυμάτων κειμένου και αρχείων καταγραφής κλήσεων από συνδεδεμένα smartphones.",
      "Το δικαστήριο έκρινε ότι οι ισχυρισμοί δεν πληρούσαν τις νόμιμες απαιτήσεις ζημίας του νόμου περί προστασίας της ιδιωτικής ζωής της Ουάσινγκτον, δηλώνοντας ότι η παραβίαση της ιδιωτικής ζωής θεωρείται πιθανή και όχι πραγματική.",
      "Οι κατασκευαστές αυτοκινήτων επιτρέπεται πλέον να υποκλέπτουν, να καταγράφουν, να κατεβάζουν, να αποθηκεύουν και να μεταδίδουν μηνύματα κειμένου και αρχεία καταγραφής κλήσεων χωρίς άδεια. Περαιτέρω προσφυγές στο Ανώτατο Δικαστήριο είναι πιθανές."
    ],
    "commentSummary": [
      "Εφετείο της Ουάσινγκτον αποφάνθηκε ότι οι κατασκευαστές αυτοκινήτων δεν παραβίασαν τους νόμους περί προστασίας της ιδιωτικής ζωής με την αποθήκευση μηνυμάτων κειμένου και αρχείων καταγραφής κλήσεων από συνδεδεμένα smartphones.",
      "Το δικαστήριο απέρριψε πέντε ομαδικές αγωγές, δηλώνοντας ότι οι αξιώσεις δεν πληρούσαν τις απαιτήσεις του νόμου της Ουάσινγκτον για την προστασία της ιδιωτικής ζωής.",
      "Αυτό επιτρέπει στα αυτοκίνητα να υποκλέπτουν και να αποθηκεύουν μηνύματα κειμένου και αρχεία καταγραφής κλήσεων χωρίς άδεια, καθώς η παραβίαση της ιδιωτικής ζωής θεωρείται πιθανή και όχι πραγματική. Περαιτέρω προσφυγές στο Ανώτατο Δικαστήριο είναι πιθανές."
    ],
    "points": 218,
    "commentCount": 147,
    "retryCount": 0,
    "time": 1699549919
  },
  {
    "id": 38204430,
    "title": "Συγκριτική αξιολόγηση GPT-4 Turbo: GPT Turbo: Διαπιστώσεις για τις επιδόσεις και τους πιθανούς περιορισμούς του",
    "originLink": "https://blog.mentat.ai/benchmarking-gpt-4-turbo-a-cautionary-tale",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38204430",
    "commentBody": "",
    "originSummary": [
      "Τα αποτελέσματα της συγκριτικής αξιολόγησης αποκαλύπτουν ότι το GPT-4 Turbo, ένα μοντέλο επεξεργασίας κώδικα, επιλύει ελαφρώς λιγότερες εργασίες σε σύγκριση με τον προκάτοχό του GPT-4, ενδεχομένως λόγω ασαφών εντολών.",
      "Η GPT-4 φαίνεται να απομνημονεύει τα εκπαιδευτικά καθήκοντα πιο αποτελεσματικά, ενώ η GPT-4 Turbo φαίνεται να έχει χάσει μέρος αυτής της ικανότητας απομνημόνευσης.",
      "Πρόσθετα benchmarks που πραγματοποιήθηκαν χωρίς να δείξουμε στα μοντέλα τις οδηγίες δείχνουν ότι το GPT-4 έχει υψηλότερο επίπεδο απομνημονευμένων ασκήσεων από το GPT-4 Turbo.",
      "Το άρθρο υπογραμμίζει τη σημασία της ανάπτυξης καλύτερων σημείων αναφοράς και της βελτίωσης της διαδικασίας αξιολόγησης για την ακριβή αξιολόγηση των επιδόσεων των διαφόρων μοντέλων στο μέλλον."
    ],
    "commentSummary": [
      "Τα αποτελέσματα συγκριτικής αξιολόγησης του GPT-4 Turbo, ενός μοντέλου επεξεργασίας κώδικα, συγκρίθηκαν με τον προκάτοχό του GPT-4.",
      "Το GPT-4 Turbo λύνει ελαφρώς λιγότερες εργασίες με την πρώτη προσπάθεια, ενδεχομένως λόγω ασαφών οδηγιών.",
      "Το GPT-4 είχε απομνημονεύσει περισσότερες ασκήσεις σε σύγκριση με το GPT-4 Turbo, γεγονός που υποδηλώνει διαφορά στην ικανότητα απομνημόνευσης."
    ],
    "points": 217,
    "commentCount": 108,
    "retryCount": 0,
    "time": 1699534853
  },
  {
    "id": 38213158,
    "title": "Γρήγορη πληκτρολόγηση: Το κλειδί είναι η καθυστέρηση, όχι η απόδοση",
    "originLink": "https://two-wrongs.com/typing-fast-is-about-latency-not-throughput",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38213158",
    "commentBody": "",
    "originSummary": [
      "Το άρθρο καταρρίπτει την εσφαλμένη αντίληψη ότι η ταχύτητα πληκτρολόγησης πάνω από 80 λέξεις ανά λεπτό δεν είναι σημαντική για την εργασία στον υπολογιστή.",
      "Ο συγγραφέας υποστηρίζει ότι δεν έχει σημασία ο αριθμός των λέξεων που πληκτρολογούνται ανά λεπτό, αλλά η καθυστέρηση μεταξύ της πληκτρολόγησης κάθε λέξης.",
      "Η ταχύτερη δακτυλογράφηση επιτρέπει ταχύτερες αναθεωρήσεις, δόμηση προτάσεων και κωδικοποίηση, οδηγώντας σε βελτιωμένη παραγωγικότητα και ροή σκέψης."
    ],
    "commentSummary": [
      "Αυτό το άρθρο καταρρίπτει την εσφαλμένη αντίληψη ότι η ταχύτητα πληκτρολόγησης πάνω από 80 λέξεις ανά λεπτό δεν είναι σημαντική για την εργασία στον υπολογιστή.",
      "Ο συγγραφέας υποστηρίζει ότι δεν πρόκειται μόνο για τον αριθμό των λέξεων που πληκτρολογούνται ανά λεπτό, αλλά και για την καθυστέρηση μεταξύ της πληκτρολόγησης κάθε λέξης.",
      "Η ταχύτερη πληκτρολόγηση επιτρέπει ταχύτερες αναθεωρήσεις και οργάνωση προτάσεων ή κώδικα, οδηγώντας σε βελτιωμένη παραγωγικότητα και ροή σκέψης."
    ],
    "points": 180,
    "commentCount": 132,
    "retryCount": 0,
    "time": 1699574760
  }
]
