[
  {
    "id": 40687660,
    "title": "Voyager 1 tekrar çevrimiçi! NASA uzay aracı, tüm 4 cihazdan veri gönderiyor",
    "originLink": "https://www.space.com/voyager-1-fully-operational",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40687660",
    "commentBody": "",
    "originSummary": [
      "Nasa'nın Voyager 1 uzay aracı, Kasım 2023'ten bu yana teknik sorunlar yaşadıktan sonra, şimdi tamamen çalışır durumda ve dört bilimsel cihazın tamamı kullanılabilir veri sağlıyor.",
      "Problemin, uçuş veri alt sistemindeki bir çipe kadar izlenmesi ve kodun yeniden konumlandırılmasıyla çözülmesi, 46 yıllık uzay aracının dayanıklılığını gözler önüne serdi.",
      "Voyager 1, Dünya'dan 15 milyar mil uzakta olmasına rağmen, işlevselliğini sürdürmek ve görevini uzatmak için devam eden çabalarla birlikte, yıldızlararası uzaydan değerli veriler sağlamaya devam ediyor."
    ],
    "commentSummary": [
      "Voyager 1 tekrar çevrimiçi ve dört cihazın tamamından veri aktarıyor, yakın zamanda vefat eden Voyager'ın temel proje bilimcisi Ed Stone'a bir övgü olarak hizmet ediyor.",
      "Tartışmalar, nesil gemileri ve gelecekteki daha hızlı uzay araçlarının hedeflerine ilk ulaşma potansiyeli hakkında ateşleniyor, zaman genişlemesi ve göreceli seyahat gibi kavramlar araştırılıyor.",
      "Breakthrough Starshot, gram ölçeğinde sondaların lazer yelkeni ile hızlandırılmasını öneriyor, bu da uzay yolculuğu teknolojisindeki ilerlemeleri vurgulayarak Voyager 1'i on yıl içinde geçme potansiyeline sahip olabilir."
    ],
    "points": 792,
    "commentCount": 164,
    "retryCount": 0,
    "time": 1718428365
  },
  {
    "id": 40690898,
    "title": "Perplexity AI Kullanıcı Aracısı Hakkında Yalan Söylüyor",
    "originLink": "https://rknight.me/blog/perplexity-ai-is-lying-about-its-user-agent/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40690898",
    "commentBody": "",
    "originSummary": [
      "Yazar, sunucularında ve MacStories'de Perplexity gibi AI botlarını engelleme konusunda, engellemeleri uygulamalarına rağmen karşılaştıkları zorlukları tartışıyor.",
      "Perplexity AI, robots.txt kısıtlamalarını aşar gibi görünüyor ve doğru kullanıcı aracısı dizgesini kullanmıyor, bu da erişimlerini engellemeyi zorlaştırıyor.",
      "Yazar, daha fazla bilgi için Perplexity'nin Discord'una katılmak, bir hata raporu oluşturmak ve bir GDPR talebini değerlendirmek gibi ek eylemleri araştırıyor."
    ],
    "commentSummary": [
      "Metin, Perplexity AI'nin veri kullanımını ele alıyor ve kullanıcıların AI eğitimi için veri kullanımını kontrol etmesine odaklanıyor. Ayrıca, verileri kullanıcı tarafından talep edilen formatta sunmak için web sitelerini sorgulamanın etik sonuçlarını tartışıyor.",
      "Perplexity gibi toplayıcı hizmetlerin içerik oluşturucular üzerindeki olumsuz etkisi hakkında endişeler dile getiriliyor, çünkü bu hizmetler orijinal içerik kaynaklarına doğrudan trafiği azaltabilir ve bu da potansiyel olarak içgörü ve gelir kaybına yol açabilir.",
      "Metin ayrıca, uygulamaları tarihsel vakalarla karşılaştırarak ve yeni düzenlemeler ve analiz özelliklerine duyulan potansiyel ihtiyacı tartışarak, yapay zeka eğitimi ve veri kazıma konularında telif hakkı, yasallık ve etik gibi daha geniş konulara da değiniyor."
    ],
    "points": 287,
    "commentCount": 247,
    "retryCount": 0,
    "time": 1718470093
  },
  {
    "id": 40684901,
    "title": "Üstel Olarak Daha İyi Dönüşler (2022) SONUÇ:",
    "originLink": "http://thenumb.at/Exponential-Rotations/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40684901",
    "commentBody": "",
    "originSummary": [
      "3D programlama, her biri kendi avantajları ve sınırlamaları olan dönüşüm matrisleri, Euler açıları ve kuaterniyonlar gibi çeşitli 3D döndürme tekniklerini içerir.",
      "Euler açıları, gimbal kilidi ve tutarsız açısal hız gibi sorunlara neden olabilir, bu da onları robotik gibi uygulamalarda enterpolasyon için daha az uygun hale getirir.",
      "Quateryonlar ve eksen/açı dönüşleri, dönüşlerin birleştirilmesi ve enterpolasyonu için daha etkili olarak vurgulanmaktadır; quateryonlar, 3D nokta dönüşleri için sağlam bir yöntem ve üstel haritanın kolay hesaplanmasını sunmaktadır."
    ],
    "commentSummary": [
      "Metin, 3D dönüşümler için faydalı olan Lie grubu/Lie cebiri ilişkilendirmesini açıklar ve üstel ve logaritmik haritalar kullanarak düzgün geçişler ve bileşimler sağlar.",
      "Kuaterniyonlar, kompakt temsilleri ve 3x3 matrislere göre hesaplama avantajları nedeniyle, özellikle animasyonda bilgisayar grafiklerinde verimlilikleri ile öne çıkar.",
      "Bu tartışma, dönüşlerin tahmini için Kalman filtrelerinin kullanımını, dönüşlerin ortalamasının karmaşıklıklarını ve robotik ile video oyunu geliştirme gibi alanlarda çeşitli metriklerin uygulanmasını içermektedir."
    ],
    "points": 253,
    "commentCount": 53,
    "retryCount": 0,
    "time": 1718397723
  },
  {
    "id": 40688001,
    "title": "Telsa'nın FSD'si – Kullanışsız Bir Teknoloji Gösterimi SONUÇ:",
    "originLink": "https://tomverbeure.github.io/2024/05/20/Tesla-FSD-First-and-Last-Impressions.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40688001",
    "commentBody": "",
    "originSummary": [
      "Telsa, Tam Otonom Sürüş (FSD) sisteminin ücretsiz deneme sürümünü sunuyor, ancak kullanıcılar hala önemli hatalar yaptığını ve sürücü müdahalesi gerektirdiğini bildiriyor.",
      "Birden fazla testte, FSD yanlış şerit değişiklikleri, gergin düzeltmeler ve hatta kırmızı ışıkta geçme gibi hatalar yaptı, bu da güvenilirliği konusunda endişelere yol açtı.",
      "Yazar, FSD'nin potansiyel gösterdiğini, ancak şu anda pratik bir değeri olmadığını ve adaptif hız sabitleyici ve şerit ortalama gibi daha güvenilir otomatik pilot özelliklerini tercih ettiğini sonucuna varıyor."
    ],
    "commentSummary": [
      "Tesla'nın Tam Otonom Sürüş (FSD) teknolojisi, rakiplerine göre teknolojik üstünlüğü konusunda şüpheler bulunması nedeniyle, uygulanabilir bir üründen ziyade hisse senedi fiyatını artırıcı bir unsur olarak eleştiriliyor.",
      "Raporlar, Tesla'nın zayıf sürücü katılım sisteminin Autopilot'un yetenekleri için uygunsuz olduğunu, bu durumun kötüye kullanıma, kazalara ve en az 13 ölümcül olaya yol açtığını gösteriyor. SONUÇ:",
      "Bu tartışma, Tesla'nın vaatlerine yönelik şüpheciliği, tam otonom sürüşe ulaşmanın karmaşıklığını ve sürüşü iyileştirmek için daha fazla sensöre duyulan ihtiyacı içeriyor, kullanıcı beklentileri ile gerçek yetenekler arasındaki farkı vurguluyor."
    ],
    "points": 238,
    "commentCount": 318,
    "retryCount": 0,
    "time": 1718435069
  },
  {
    "id": 40685644,
    "title": "Snowden: 'Tamamen maskelerini çıkardılar: OpenAI'ye veya ürünlerine asla güvenmeyin'",
    "originLink": "https://twitter.com/Snowden/status/1801610725229498403",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40685644",
    "commentBody": "",
    "originSummary": [
      "Edward Snowden, OpenAI'nin yönetim kuruluna bir NSA Direktörü atamasını küresel haklara ihanet olarak nitelendirerek kamuoyuna eleştirdi.",
      "Snowden'in uyarısı, OpenAI'nin ürünleri, özellikle ChatGPT ile ilgili gizlilik ve gözetim konularında endişeleri ima ediyor."
    ],
    "commentSummary": [
      "Edward Snowden, OpenAI'ye güvenilmemesi gerektiği konusunda uyarıda bulunarak, fikri mülkiyet haklarını atlamaya ve eserleri uygun atıf veya ödeme olmadan kullanmaya yönelik bir acele olduğunu öne sürüyor.",
      "Metin, OpenAI gibi şirketlerde yönetim kurulu üyelerinin atanmasını tartışıyor, kararların mali kazanç için onaylanma potansiyelini ve otantikliğini sorguluyor.",
      "Yapay zekanın mahremiyet üzerindeki etkisi, telif hakkı ihlali ve OpenAI ile hükümet arasındaki olası işbirliği konusundaki endişeler, bazı kullanıcıların hesaplarını iptal etmelerine ve verilerini silmelerine yol açtı."
    ],
    "points": 227,
    "commentCount": 121,
    "retryCount": 0,
    "time": 1718403218
  },
  {
    "id": 40686787,
    "title": "Syzygy: Düşük maliyetli, kompakt ve yüksek performanslı çevre birimleri için açık standart",
    "originLink": "https://syzygyfpga.io/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40686787",
    "commentBody": "",
    "originSummary": [
      "SYZYGY, yüksek performanslı çevresel bağlantı için tasarlanmış, uygun maliyetli ve kompakt konnektörler ve kablolar sunan açık bir standarttır.",
      "Bu, düşük hızlı Digilent PMOD cihazları ile yüksek performanslı VITA 57.1 FMC çevre birimleri arasındaki boşluğu doldurarak, prototipler, sistem entegrasyonu, test ve değerlendirme sistemleri için ideal hale getirir.",
      "SYZYGY, sabit ve programlanabilir voltajları ve tek uçlu sinyalleri destekleyen iki tür konektör sağlar: 40 pinli standart çevresel konektör ve 60 pinli alıcı-verici çevresel konektör."
    ],
    "commentSummary": [
      "Metin, yüksek hızlı, düşük gecikmeli iletişim için MCUs (Mikrodenetleyici Birimleri) ve MPUs (Mikroişlemci Birimleri) içine sert PCIe (Çevresel Bileşen Ara Bağlantı Ekspresi) uç noktalarının entegrasyonunun potansiyel faydalarını tartışmaktadır.",
      "Mevcut sınırlamalar arasında PCIe'yi kullanmak için pahalı FPGA'lara (Saha Programlanabilir Kapı Dizileri) veya sınırlı sayıda MCU/MPU'ya ihtiyaç duyulması ve RISC-V MCU'larda hızlı veri transferi seçeneklerinin eksikliği bulunmaktadır.",
      "Metin, çevre birimlerinin adreslenmesi için analog voltaj gibi yenilikçi yöntemler kullanan ve Opal Kelly tarafından geliştirilen Syzygy standardının gelişimini vurgulamaktadır. Bu standardın kademeli olarak benimsendiği görülse de, FMC (FPGA Mezzanine Card) gibi diğer standartlarla karşılaştırıldığında popülaritesi belirsizliğini korumaktadır."
    ],
    "points": 118,
    "commentCount": 27,
    "retryCount": 0,
    "time": 1718415115
  },
  {
    "id": 40689296,
    "title": "Threescaper: Townscaper modellerini Three.js'e yüklemek için bir web sitesi",
    "originLink": "https://github.com/meliharvey/threescaper",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40689296",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Threescaper, kullanıcıların Townscaper modellerini Three.js'e yüklemelerine olanak tanıyan ve etkileşimli 3D deneyimini geliştiren bir web sitesidir.",
      "Tiny Glade, Bevy kullanılarak Rust ile yazılmış yaklaşan bir oyun, sezgisel bina UI/UX'i ile dikkat çekiyor ve benzer konseptlerin Unreal Editor'e dahil edilmesi öneriliyor.",
      "Yazar, teleportasyon ve çift zıplama gibi özelliklere sahip interaktif bir 3D projeyi tartışıyor ve performans sorunları ile Battlefield Heroes'u anımsatan nostaljik unsurlardan bahsediyor."
    ],
    "points": 116,
    "commentCount": 15,
    "retryCount": 0,
    "time": 1718453623
  },
  {
    "id": 40685254,
    "title": "İki yaşındaki çocuklara okumayı öğretmek için aralıklı tekrar",
    "originLink": "https://chrislakin.blog/p/spaced-repetition-for-teaching-two",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40685254",
    "commentBody": "",
    "originSummary": [
      "CoffeePie olarak bilinen bir baba, Anki adlı aralıklı tekrar aracını kullanarak çocuklarına ortalama yaştan yıllar önce, 2 yaş ve 1 yıl 9 aylıkken okumayı öğretti.",
      "Kızı 5 yaşına geldiğinde, İngilizce, İbranice ve İspanyolca dillerinde beşinci veya sekizinci sınıf seviyesinde okuyordu, oğlu ise çarpım tablolarını ve ileri matematik kavramlarını biliyordu.",
      "Baba, Anki'nin erken okuma ve matematik için etkili olduğunu, ancak çocuklarının becerileri ilerledikçe daha karmaşık problem çözme araçlarına ihtiyaç duyulması nedeniyle sınırlamaları olduğunu gözlemledi."
    ],
    "commentSummary": [
      "Bu tartışma, iki yaşındaki çocuklara okumayı öğretmenin faydalı mı yoksa potansiyel olarak zararlı mı olduğu konusunda odaklanıyor ve her iki taraf da sosyal ve bilişsel etkilerle ilgili argümanlar sunuyor.",
      "Bir gelişim araştırmacısı, çocuk gelişim kilometre taşlarının değişkenlik gösterdiğini ve çocukları çok zorlamanın ters etki yapabileceğini savunarak, bir çocuğun merak ve ilgisini takip etmenin önemini vurguluyor.",
      "Metin, okuma öğretimi için flaş kartlar, etkileşimli müfredatlar ve aralıklı tekrar gibi çeşitli yöntemler ve araçları tartışmakta olup, ilgi çekici ve yaşa uygun içerik ihtiyacını vurgulamaktadır."
    ],
    "points": 108,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1718400037
  },
  {
    "id": 40686396,
    "title": "Yerel LLM sesli asistanımı RAG ile daha hızlı ve daha ölçeklenebilir hale getirmek",
    "originLink": "https://johnthenerd.com/blog/faster-local-llm-assistant/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40686396",
    "commentBody": "",
    "originSummary": [
      "Yazar, akıllı ev kontrolü için yerel bir LLM (Büyük Dil Modeli) sesli asistanını optimize etmek üzerinde çalışıyor ve çıkarımın 'ön doldurma' aşamasında gecikmeyi azaltmaya odaklanıyor.",
      "Bağlam uzunluğunu azaltmaya ve hızı artırmaya yardımcı olan büyük istemleri daha küçük bölümlere ayırmak için bir RAG (Retrieval-Augmented Generation) yöntemi uyguladılar.",
      "Yazar, bir RAG API oluşturdu, hava durumu tahminleri ve takvim etkinlikleri gibi özellikler ekledi ve sesli asistanı daha verimli ve duyarlı hale getirmeyi amaçlayarak sistemlerini bu yeni API'yi kullanacak şekilde güncelledi."
    ],
    "commentSummary": [
      "Kullanıcılar, LLM (Büyük Dil Modeli) sesli asistanlarının hızını artırmak için yaygın hizmetler için önişlem gömme işlemlerini tartışıyor ve bazıları öneri algoritmalarını uygulanabilir bir çözüm olarak öneriyor.",
      "Model `casperhansen/llama-3-70b-instruct-awq`, Llama 2'ye dayalı olması ve performansı hakkında bir tartışma var, bazı kullanıcılar sorgu ve yanıt arasındaki gecikmeyi sorunlu buluyor.",
      "Yapay zekanın insan davranışlarını taklit etmesi mi yoksa sadece görevleri yerine getirmesi mi gerektiği konusunda görüşler farklılık gösteriyor; bazı kullanıcılar modelin alaycı tonundan eğlenirken, diğerleri bu yaklaşımı insanlık dışı buluyor."
    ],
    "points": 107,
    "commentCount": 16,
    "retryCount": 0,
    "time": 1718410329
  },
  {
    "id": 40688336,
    "title": "Django SQLite Üretim Yapılandırması",
    "originLink": "https://blog.pecar.me/sqlite-django-config",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40688336",
    "commentBody": "",
    "originSummary": [
      "Varsayılan SQLite yapılandırması, düşük eşzamanlılık optimizasyonu nedeniyle Django'nun ihtiyaçlarıyla çeliştiğinden, üretim için uygun değildir.",
      "5.0, 4.2 veya daha eski Django sürümleri için, WAL (Write-Ahead Logging) günlük modunu etkinleştirmek, yazma isteklerinin okumaları engellemesini önleyerek eşzamanlılığı artırabilir.",
      "Django 5.1'in 2024 Ağustos'unda beklenen sürümü, bu SQLite optimizasyonlarının doğrudan settings.py dosyasında yapılandırılmasına olanak tanıyacak ve geliştiriciler için süreci basitleştirecek."
    ],
    "commentSummary": [
      "Django SQLite Üretim Yapılandırması, WAL (Öne Yazma Günlüğü) modunda SQLite ile ilgili önemli bir soruna sahiptir; yüksek yük altında WAL dosyası aşırı büyüyebilir ve bu durum sistem arızasına neden olabilir.",
      "Bir geçici çözüm, WAL boyutunu izlemek ve 8 MB'ı aşarsa okuma ve yazma işlemlerini yavaşlatmak için ayrı bir iş parçacığı çalıştırmayı içerir, ancak bu, WAL modundaki SQLite'ın üretim ortamları için uygun olmayabileceğini gösterir.",
      "PostgreSQL, yüksek hacimli işlemleri daha iyi yönetmesi ve SQLite'a kıyasla daha az sınırlamaya sahip olması nedeniyle çoğu küçük ve orta ölçekli projeler için tavsiye edilir."
    ],
    "points": 97,
    "commentCount": 39,
    "retryCount": 0,
    "time": 1718440220
  }
]
