[
  {
    "id": 38221552,
    "title": "Egyedi szerszámlánc: Jobb megközelítés az AI-termékek építéséhez",
    "originLink": "https://www.builder.io/blog/build-ai",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38221552",
    "commentBody": "",
    "originSummary": [
      "A meglévő AI-modelleknek, például a ChatGPT-nek vannak korlátai és hátrányai, többek között a differenciálás hiánya, a magas költségek, a lassú feldolgozás és a korlátozott testreszabhatóság.",
      "A szerző azt javasolja, hogy a finomhangolt modellek, az egyéni fordítók és az egyéni képzett modellek kombinálásával hozzunk létre egy egyéni eszköztárat a mesterséges intelligencia termékek létrehozásához.",
      "Fontos, hogy a szokásos programozási gyakorlatból induljunk ki, és csak ott alkalmazzunk mesterséges intelligencia modelleket, ahol szükséges.",
      "A szerző megosztja a Visual Copilot, a Figma terveket kiváló minőségű kóddá alakító mesterséges intelligencia termék megalkotásával kapcsolatos tapasztalatait, és kiemeli a saját modellek ellenőrzésének és folyamatos fejlesztésének előnyeit.",
      "Az egyéni megközelítés előnyeként említik az adatvédelem ellenőrzését is.",
      "A szerző azt javasolja, hogy a mesterséges intelligenciát takarékosan használjuk, és azokra a területekre összpontosítsunk, ahol a legnagyobb értéket nyújtja."
    ],
    "commentSummary": [
      "A hangsúly a mesterséges intelligencia technológiák, különösen a chatbotok használatán van, hogy valódi felhasználói problémákat oldjanak meg, nem pedig azon, hogy csak a feltörekvő technológia használatának kedvéért alkalmazzák őket.",
      "Vita folyik a chatbotok hatékonyságáról és korlátairól az ügyfélszolgálatban, és a vélemények megoszlanak a hasznosságukról.",
      "A sikeres mesterséges intelligencia termékek kifejlesztéséhez differenciálásra, technikai szakértelemre és felhasználói visszajelzésekre van szükség, ugyanakkor el kell kerülni a túlzott támaszkodást a mesterséges intelligencia technológiára, és figyelembe kell venni a termék egyéb szempontjait is."
    ],
    "points": 435,
    "commentCount": 202,
    "retryCount": 0,
    "time": 1699636808
  },
  {
    "id": 38226743,
    "title": "A böngésző hibakeresés elsajátítása fejlett trükkökkel",
    "originLink": "https://alan.norbauer.com/articles/browser-debugging-tricks",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38226743",
    "commentBody": "",
    "originSummary": [
      "A cikk hasznos trükkök listáját kínálja a böngésző hibakereső hatékonyságának maximalizálásához.",
      "Ezek a hackek magukban foglalják a fejlett feltételes töréspontok, a napló- és nyomkövetési pontok, a figyelőablak, a híváslisták nyomon követése és a program viselkedésének megváltoztatása használatát.",
      "A további tippek között szerepel a gyors teljesítményprofilozás, a CSS használata töréspontokhoz, az osztályhívások figyelése, a tulajdonságok olvasásának hibakeresése és a HTML/CSS hibakeresés."
    ],
    "commentSummary": [
      "A cikk olyan hibakeresési technikákat mutat be a böngészőben, mint a majomfoltozás és a helyi változók elérése.",
      "Megvitatja a jelenlegi böngészőeszközök korlátait, és javaslatot tesz a lehetséges fejlesztésekre.",
      "A szerző megemlíti a Replay.io eszközt és a csapat erőfeszítéseit egy Chromium fork kifejlesztésére, amely hasonló képességekkel rendelkezik, mint a jelenlegi Firefox forkjuk, valamint új, időutazásra képes funkciókkal a böngésző számára."
    ],
    "points": 355,
    "commentCount": 52,
    "retryCount": 0,
    "time": 1699666517
  },
  {
    "id": 38224950,
    "title": "Az Apple 25 millió dollárt fizet az amerikai diszkriminációs vádak rendezésére: DOJ",
    "originLink": "https://arstechnica.com/tech-policy/2023/11/apple-discriminated-against-us-citizens-in-hiring-doj-says/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38224950",
    "commentBody": "",
    "originSummary": [
      "Az amerikai igazságügyi minisztérium (DOJ) azzal vádolta az Apple-t, hogy a felvételi gyakorlatában hátrányosan megkülönbözteti az amerikai állampolgárokat, mivel elriasztja őket attól, hogy külföldi munkavállalók számára nyitott állásokra jelentkezzenek.",
      "Az Apple beleegyezett, hogy a vádak rendezése érdekében akár 25 millió dolláros elmaradt fizetést és polgári jogi büntetést is fizet, ami a bevándorlási és állampolgársági törvény diszkriminációellenes rendelkezése alapján beszedett legnagyobb összegű kifizetés.",
      "Az Apple nem ismerte el bűnösségét, de elismerte, hogy nem tartotta be a DOJ előírásait, és tervet hajtott végre a kormányzati követelményeknek való megfelelés érdekében, beleértve a felvételi gyakorlat megváltoztatását és kiterjedtebb toborzást az állandó munkaügyi igazolási program (PERM) keretében betöltött valamennyi pozícióra."
    ],
    "commentSummary": [
      "Az amerikai igazságügyi minisztérium azzal vádolta meg az Apple-t, hogy külföldi munkavállalókat részesített előnyben az amerikai állampolgárokkal szemben a felvételi gyakorlatában.",
      "Az Apple állítólag hamis álláshelyeket hozott létre, hogy külföldi munkavállalókat alkalmazzon, és megkerülje a bevándorlási törvényeket.",
      "Az Apple megegyezett az ügyben a DOJ-vel, és beleegyezett a bírság megfizetésébe."
    ],
    "points": 323,
    "commentCount": 212,
    "retryCount": 0,
    "time": 1699652738
  },
  {
    "id": 38218667,
    "title": "A Nordic a RISC-V architektúrát használja az energiahatékony IoT-alkalmazásokhoz",
    "originLink": "https://blog.nordicsemi.com/getconnected/why-nordic-is-getting-involved-in-risc-v",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38218667",
    "commentBody": "",
    "originSummary": [
      "A Nordic csatlakozott egy konzorciumhoz, amelynek célja a RISC-V, egy nyílt forráskódú chiparchitektúra elterjesztése.",
      "Ez a lépés nem jelenti a Nordic és az Arm kapcsolatának megszakadását, mivel a RISC-V-t kiegészítő alternatívának tekintik, különösen az energiafogyasztás szempontjából kritikus mobil és IoT alkalmazásokban.",
      "A RISC-V rugalmasságot kínál a hardver testreszabásához, hogy rendkívül alacsony energiafogyasztást biztosítson, ami előnyös az érzékelőkben és a lokalizált gépi tanulásban használt egyszerűbb beágyazott chipek számára. További tervezési lehetőségeket biztosít a Nordic ügyfelei számára, és elősegíti az innovációt az IoT-piacon."
    ],
    "commentSummary": [
      "A Nordic Semiconductor, a Bluetooth-chipek egyik vezető szállítója az olcsóbb kínai riválisok versenyével néz szembe, ami arra készteti őket, hogy fontolóra vegyék a RISC-V technológia bevezetését.",
      "A chipjeik biztonsági sebezhetőségével kapcsolatos aggodalmak továbbra is fennállnak, de sok IoT-eszköz már most is kínai chipeket használ, mivel azok olcsóbbak.",
      "A Nordic Semiconductor az energiafelhasználás és a teljesítmény növelése érdekében olyan processzorok kifejlesztését tervezi, amelyekben az Arm és a RISC-V magok is megtalálhatóak ugyanazon a chipen, hangsúlyozva a RISC-V architektúra előnyeit az energiahatékonyság és az egyszerűség szempontjából."
    ],
    "points": 300,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1699623741
  },
  {
    "id": 38218580,
    "title": "\"Sajnáljuk, hogy létrehoztuk a Torment Nexust\": Charles Stross a sci-fi hatásáról a technológiára és a társadalomra",
    "originLink": "http://www.antipope.org/charlie/blog-static/2023/11/dont-create-the-torment-nexus.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38218580",
    "commentBody": "",
    "originSummary": [
      "Charles Stross tudományos-fantasztikus író a tudományos-fantasztikus irodalomnak a technológiára és a társadalomra gyakorolt hatásáról beszél, és aggodalmát fejezi ki amiatt, hogy a milliárdosok úgy valósítanak meg ötleteket, hogy nem értik meg a következményeket.",
      "Stross kritizálja a Szilícium-völgyi milliárdosok ideológiáját, és kiemeli a jobboldali ideológiák hatását a tudományos-fantasztikus irodalomban.",
      "A cikk a könyvkiadás kereskedelmi aspektusát, az olvasók előítéletének a műfajra gyakorolt hatását vizsgálja, és olyan témákkal foglalkozó kommentárrészeket tartalmaz, mint a mesterséges intelligencia, a sci-fi és a technológia társadalomra gyakorolt hatása."
    ],
    "commentSummary": [
      "A beszélgetés több témát is érint, többek között az emberi törekvésekben megnyilvánuló önhittséget, a cyberpunk és a disztópikus világok értelmezését, valamint a sci-fi szerepét a jövő alakításában.",
      "Vita folyik arról, hogy a nagyméretű nyelvi modelleket a mesterséges intelligenciához kell-e sorolni.",
      "A beszélgetés kitér arra is, hogy a valós világ mennyire hasonlít egy cyberpunk-regényre, és megvitatja a technológia hatását, a milliárdosok befolyását, valamint a sci-fi művek hollywoodi adaptációinak kreativitáshiányát."
    ],
    "points": 285,
    "commentCount": 353,
    "retryCount": 0,
    "time": 1699623255
  },
  {
    "id": 38222909,
    "title": "A Dan's Tools által kínált Unix időbélyegző és webfejlesztési konverziós eszközök",
    "originLink": "https://www.unixtimestamp.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38222909",
    "commentBody": "",
    "originSummary": [
      "A Dan's Tools egy olyan weboldal, amely webfejlesztési konverziós eszközöket kínál, beleértve a kódolókat/dekódolókat és a formázókat.",
      "Az oldalon elérhető egyik eszköz lehetővé teszi a Unix időbélyegek átalakítását, amelyek az 1970. január 1. óta eltelt másodpercek számát jelentik UTC-ben.",
      "A weboldal az ember által olvasható időátváltással kapcsolatos információkat is kínál, és felhívja a figyelmet arra a problémára, hogy a Unix időbélyegző 2038. január 19. után nem tud működni egy 32 bites túlcsordulás miatt."
    ],
    "commentSummary": [
      "A Unix időbélyegző ezen a kedden éri el a 17. mérföldkövet, ami vitákat vált ki a múlt és a jövő jelentős időbélyegeiről.",
      "A felhasználók megosztják tapasztalataikat és emlékeiket a mérföldkőnek számító időbélyegekkel kapcsolatban, és linkeket osztanak meg az időbélyegek megjelenítésére és kiszámítására szolgáló weboldalakhoz és eszközökhöz.",
      "A beszélgetés a Unix epocharendszer e mérföldköveinek varázsát és jelentőségét, valamint az ember által olvasható formátumok használatáról és az időbélyegváltozatok korlátairól szóló vitákat tárja fel."
    ],
    "points": 282,
    "commentCount": 69,
    "retryCount": 0,
    "time": 1699642494
  },
  {
    "id": 38224245,
    "title": "Hogyan adjunk hatékony és tiszteletteljes parancsokat vezetőként?",
    "originLink": "https://www.jeffwofford.com/?p=2089",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38224245",
    "commentBody": "",
    "originSummary": [
      "A cikk útmutatást nyújt arra vonatkozóan, hogyan adhatsz vezetőként hatékonyabb és tiszteletteljesebb módon parancsokat.",
      "Javasolja, hogy különböző kifejezéseket és hangnemeket használjunk a parancsok enyhítésére és a csapat bevonására a döntéshozatalba.",
      "Hangsúlyozzák az egyértelmű és közvetlen kommunikáció fontosságát, ugyanakkor óvatosságra intenek az óvatos és homályos megfogalmazásoktól."
    ],
    "commentSummary": [
      "A hatékony vezetési és kommunikációs stílus döntő fontosságú a sikerhez, hangsúlyt fektetve a világos kommunikációra és a csapattagok bevonására.",
      "Az egyéni és kulturális összefüggések megértése, valamint a megfontoltság és az őszinteség a hatékony vezetés kulcsfontosságú elemei.",
      "Az együttműködésen alapuló és tisztelettudó megközelítés jobb eredményeket hoz, mivel a csapattagok igényeinek és preferenciáinak megértését és az azokhoz való alkalmazkodást igényli."
    ],
    "points": 242,
    "commentCount": 99,
    "retryCount": 0,
    "time": 1699648929
  },
  {
    "id": 38221379,
    "title": "A Github Type System textúrajavító funkciója megoldja a monospace betűtípusok tervezési problémáit",
    "originLink": "https://github.com/githubnext/monaspace/blob/main/docs/Texture%20Healing.md",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38221379",
    "commentBody": "",
    "originSummary": [
      "A Github Type System Monospace betűtípusainak Texture Healing funkciója a monospace betűtípusok tervezési problémáit oldja meg alternatív betűjelek bevezetésével, amelyek képesek a betűtávolság beállítására.",
      "Ez az OpenType funkció kódján keresztül történik, amely lehetővé teszi a betűjelek cseréjét, ha a távolsági követelmények ütköznek.",
      "A folyamat magában foglalja alternatív glifaváltozatok létrehozását és a szomszédos karakterek alapján történő keresést, a kód és a dokumentáció pedig nyilvánosan hozzáférhető."
    ],
    "commentSummary": [
      "A \"textúra gyógyítás\" egy olyan koncepció, amely a betűk szélességének beállítását jelenti a monospace betűtípusokban a vizuális vonzerő javítása érdekében, de vita van arról, hogy ez valóban javítja-e az olvashatóságot, vagy inkább megnehezíti azt.",
      "Néhány felhasználónak aggályai vannak a \"textúra gyógyítás\" kifejezés megfelelőségével, valamint a kódolásra és az olvashatóságra gyakorolt hatásával kapcsolatban.",
      "A Monaspace betűtípust megvitatják, és eltérő véleményeket fogalmaznak meg az olvashatóságáról, valamint egyes felhasználók aggodalmukat fejezik ki a karakterek mozgásával és igazításával kapcsolatban."
    ],
    "points": 226,
    "commentCount": 82,
    "retryCount": 0,
    "time": 1699636051
  },
  {
    "id": 38219568,
    "title": "A Microsoft új Outlook-alkalmazása aggályokat vet fel az adatvédelemmel kapcsolatban",
    "originLink": "https://www.heise.de/news/Microsoft-lays-hands-on-login-data-Beware-of-the-new-Outlook-9358925.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38219568",
    "commentBody": "",
    "originSummary": [
      "A Microsoft új Outlook-alkalmazása adatvédelmi aggályokat vet fel, mivel a bejelentkezési adatokat és e-maileket a Microsoft szervereire küldi, lehetővé téve a vállalat számára, hogy elolvassa és elemezze azokat.",
      "Az új Outlookot használó felhasználók azt kockáztatják, hogy IMAP és SMTP hitelesítő adataikat és e-mailjeiket a Microsoft tárolja.",
      "Az adatvédelmi hatóságok, köztük a németországi adatvédelmi és információszabadságért felelős szövetségi biztos, aggodalmukat fejezték ki az új Outlookban szereplő adatkerülő út miatt."
    ],
    "commentSummary": [
      "A vita középpontjában az adatbiztonsággal kapcsolatos aggodalmak, a funkcionalitás korlátai és a Microsoft meglévő termékeinek újratervezésével kapcsolatos csalódások állnak.",
      "Aggályok merülnek fel a Microsoft csomagban kínált ajánlatokkal kapcsolatban is, beleértve az interoperabilitással, a kompatibilitással, a biztonsággal és az adatvédelemmel kapcsolatos kérdéseket.",
      "A beszélgetés kérdéseket vet fel a Microsoft hozzáférésével kapcsolatban a Gmail jelszavaihoz, valamint a jelszavak biztonságával kapcsolatos egyértelmű kommunikáció szükségességével kapcsolatban."
    ],
    "points": 215,
    "commentCount": 102,
    "retryCount": 0,
    "time": 1699628044
  },
  {
    "id": 38224810,
    "title": "A ritka japán KitKats elrablása egy számítógépes csalás során",
    "originLink": "https://www.straitstimes.com/world/united-states/how-to-kidnap-339000-in-rare-japanese-kitkats",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38224810",
    "commentBody": "",
    "originSummary": [
      "Egy 339 000 dollár értékű, ritka japán KitKat édességszállítmányt loptak el egy számítógépes csalás során Kaliforniából New Jerseybe történő szállítás közben.",
      "Egy kamionosnak álcázott csaló birtokába került a szállítmány, amely végül két kaliforniai raktárban kötött ki, ahol tárolási díjakat halmozott fel.",
      "A szállításért felelős szállítmányozási bróker nem szerezte vissza az ellopott édességet, ami jól példázza a logisztikai ágazatban egyre növekvő problémát, a stratégiai lopást, amikor a bűnözők ellopják az árut, és váltságdíjat követelnek a visszaszolgáltatásáért."
    ],
    "commentSummary": [
      "Az összefoglaló a Kit Kats lopott szállítmányokkal kapcsolatos csalást vázol fel, amelybe esetleg biztosítási csalás is beletartozhat.",
      "A logisztika és a hitelesítés kihívásait vizsgálja a fuvarozási ágazatban.",
      "A Nestlé küzdelmei az egyedi Kit Kat-ízek értékesítésének világszerte történő kiterjesztéséért, beleértve az olyan akadályokat, mint a licencszerződések és a szabályozási követelmények."
    ],
    "points": 205,
    "commentCount": 127,
    "retryCount": 0,
    "time": 1699651833
  },
  {
    "id": 38220982,
    "title": "Dungeon KeeperFX 1.0 Megjelent: Javított funkciók és az önálló játék állapota",
    "originLink": "https://keeperfx.net/news/11/2023-11-10/keeperfx-100-has-been-released",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38220982",
    "commentBody": "",
    "originSummary": [
      "A KeeperFX 1.0.0, a nyílt forráskódú játék nagyobb kiadása már elérhető.",
      "Ez a frissítés magában foglalja az eredeti Dungeon Keeper kódhoz vezető link eltávolítását, így a KeeperFX önálló játékká válik.",
      "A frissítés különböző fejlesztéseket kínál, többek között további pályaszabályozási lehetőségeket, új egységeket és tárgyakat, javított többjátékos stabilitást és még sok mást."
    ],
    "commentSummary": [
      "A Dungeon Keeper 1 és 2 jelenleg akciós a GOG-on (Good Old Games).",
      "A Dungeon Keeper 1 újbóli implementációját, a Dungeon KeeperFX-et is megemlítik, a felhasználók pedig megosztják tapasztalataikat mindkét játékkal kapcsolatban.",
      "A bejegyzés a nyelvi modellek használatát vizsgálja a kódminőség javítása érdekében, de óva int attól, hogy kizárólag ezekre a modellekre hagyatkozzunk.",
      "A KeeperFX nevű, rajongók által készített projekt, amely kiadta a Dungeon Keeper frissített változatát, közösségi támogatást kér."
    ],
    "points": 200,
    "commentCount": 96,
    "retryCount": 0,
    "time": 1699634362
  },
  {
    "id": 38219926,
    "title": "Interjú Jeff Geerlinggel: Pi és az elektronika jövőjének felfedezése",
    "originLink": "https://www.raspberrypi.com/news/meet-jeff-geerling/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38219926",
    "commentBody": "",
    "originSummary": [
      "Jeff Geerling megosztja tapasztalatait a Raspberry Pi otthoni hálózati és automatizálási projektekben való alkalmazásáról, kiemelve annak sokoldalúságát és megfizethetőségét.",
      "Az interjú hangsúlyozza a Raspberry Pi nyílt forráskódú jellegét és azt a képességét, hogy visszahozza az elektronikai hobbikészletek örömét.",
      "A cikk izgatottan várja a Raspberry Pi ökoszisztéma jövőbeli fejlődését."
    ],
    "commentSummary": ["Az adott szövegnek nincs értelmes tartalma az összefoglaló elkészítéséhez."],
    "points": 197,
    "commentCount": 104,
    "retryCount": 0,
    "time": 1699629633
  },
  {
    "id": 38219578,
    "title": "FreeBSD 14.0-RELEASE bejelentés: Branch frissítve és készen áll",
    "originLink": "https://lists.freebsd.org/archives/dev-commits-src-all/2023-November/033349.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38219578",
    "commentBody": "",
    "originSummary": [
      "A git tárolóban a releng/14.0 ágat -RELEASE-re frissítettük.",
      "A frissítés az UPDATING fájl, a crtbrand.S fájl és a newvers.sh fájl módosításait tartalmazza.",
      "Az ágat már előkészítettük a FreeBSD 14.0-RELEASE bejelentésére."
    ],
    "commentSummary": [
      "A FreeBSD 14.0 kiadását tárgyaljuk, kiemelve annak előnyeit, mint például az egyszerűség, a vállalati befolyás hiánya, valamint a megbízható portok és csomagok.",
      "A felhasználók javítandó területeket javasolnak, például más csomagrendszert és jobb kompatibilitást a Waylanddel és a KDE-vel.",
      "A szerző a FreeBSD-t a Linux stabil alternatívájaként ajánlja, dicsérve a megbízható virtuálisgép-képességet és az egyszerűsített felhasználói élményt. Frusztrációjukat fejezik ki a Linux rendszer instabilitása és a külső hatások miatt. A bHyve hipervizor grafikus kompatibilitását is megemlítik."
    ],
    "points": 193,
    "commentCount": 86,
    "retryCount": 0,
    "time": 1699628094
  },
  {
    "id": 38224217,
    "title": "Az Apple kérte az Amazont, hogy blokkolja a rivális hirdetéseket, ami a tisztességtelen előnyökkel kapcsolatos aggályokat vet fel",
    "originLink": "https://www.businessinsider.com/amazon-gives-apple-special-treatment-while-others-suffer-junk-ads-2023-11",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38224217",
    "commentBody": "",
    "originSummary": [
      "Az Apple állítólag kedvezményes elbánásban részesült az Amazontól, ami azt eredményezte, hogy az Apple-hez kapcsolódó oldalakon korlátozottan jelentek meg rivális hirdetések, és a nem Apple-ajánlások nélküli termékoldalak tisztábbak lettek.",
      "Egy belső e-mailből kiderült, hogy az Apple kérte ezt a különleges bánásmódot, ami frusztrációt keltett az Apple versenytársai, köztük a Samsung körében.",
      "A tisztább oldalak hozzájárulhattak az Apple-termékek eladásainak növekedéséhez, mivel a gyorsabb oldalletöltés általában magasabb eladásokat eredményez."
    ],
    "commentSummary": [
      "Az Apple a hamisított termékekkel kapcsolatos aggodalmakra hivatkozva kérte az Amazont, hogy blokkolja a rivális cégek reklámjait a platformján.",
      "Az Apple és az Amazon közötti megállapodás célja a hamisított termékek, különösen az Apple-termékek kiszűrése.",
      "Állítólag az Amazon és az Apple összejátszott a hamisított hirdetések eltávolítása érdekében, és a Szövetségi Kereskedelmi Bizottság is vizsgálja a szerzői jogok esetleges megsértését.",
      "Néhány vásárlónak nehézséget okozott az Apple-termékek visszaküldése az Amazonhoz.",
      "Az, hogy az Amazon előnyben részesíti az Apple-t a versenytársakkal, például a Samsunggal szemben, aggodalmakat vetett fel a piaci tisztességességgel kapcsolatban.",
      "Az Amazont kritika éri, amiért lehetővé teszi a hamisított áruk értékesítését a platformján, és a felhasználók proaktívabb intézkedéseket követelnek a hamisított termékekkel szemben.",
      "Az Amazon harmadik fél eladókkal kapcsolatos kezelésével és elszámoltathatóságával kapcsolatos aggályok is terítékre kerülnek."
    ],
    "points": 190,
    "commentCount": 128,
    "retryCount": 0,
    "time": 1699648773
  }
]
