[
  {
    "id": 38052344,
    "title": "OpenSign - et alternativ til DocuSign med åpen kildekode",
    "originLink": "https://github.com/OpenSignLabs/OpenSign",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38052344",
    "commentBody": "",
    "originSummary": [
      "OpenSign er et alternativ med åpen kildekode til kommersielle e-signeringsplattformer som DocuSign, PandaDoc og SignNow.",
      "OpenSign tilbyr blant annet sikker dokumentsignering, brukervennlig grensesnitt, støtte for flere plattformer, samarbeidsfunksjoner, revisjonsspor, fullføringssertifikater og API-integrasjon.",
      "OpenSign, som er utviklet av OpenSignLabs, er lisensiert under AGPL-lisensen, tar imot bidrag fra fellesskapet og har fått støtte og tilbakemeldinger fra brukere og bidragsytere."
    ],
    "commentSummary": [
      "OpenSign Labs har lansert OpenSign, et alternativ til DocuSign basert på åpen kildekode, noe som har utløst en debatt om lovligheten av digitale signaturer og hvor grundig OpenSigns juridiske forskning er.",
      "Foredraget fokuserer også på behovet for enhetlige krav til digitale signaturer på tvers av regioner, med henvisning til IT Act 2000 i India og eIDAS i Europa.",
      "I tillegg ble det diskutert sikkerheten og påliteligheten til OpenSign, fordeler og ulemper med programvare med åpen kildekode, og hvilken rolle tillit og langsiktig gjennomførbarhet spiller i forretningsprodukter som håndterer signerte dokumenter."
    ],
    "points": 364,
    "commentCount": 120,
    "retryCount": 0,
    "time": 1698518845
  },
  {
    "id": 38052577,
    "title": "FCC ønsker å styrke amatørradioen",
    "originLink": "https://www.radioworld.com/news-and-business/business-and-law/fcc-wants-to-bolster-amateur-radio",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38052577",
    "commentBody": "",
    "originSummary": [
      "Federal Communications Commission (FCC) har til hensikt å modernisere amatørradiobåndene ved å erstatte begrensningen på baudrate (dataoverføringshastighet) med en båndbreddebegrensning for å fremme innovasjon og forbedre kommunikasjonen i nødsituasjoner.",
      "American Radio Relay League (ARRL), en organisasjon for radioamatører, støtter dette initiativet.",
      "FCC vurderer å fjerne baudhastighetsbegrensningene også for andre frekvensbånd og er åpen for tilbakemeldinger om hvordan man kan sette en passende båndbreddegrense. Disse oppdateringene forventes å være til stor nytte for radioamatører og styrke datakommunikasjonen."
    ],
    "commentSummary": [
      "Federal Communications Commission (FCC) er i ferd med å revidere amatørradioreglementet etter anmodning fra American Radio Relay League (ARRL), noe som kan føre til økt eksperimentering og nye modulasjonsteknikker.",
      "Blant de viktigste temaene som FCC vurderer, er morsekode, grenser for baudrate, kryptering, potensielle fordeler med kryptering i amatørradio og utvidede frekvenser og dataoverføringshastigheter for operatører.",
      "Samtidig som forbedringene vekker begeistring i lokalsamfunnet, har det også blitt uttrykt bekymring for mulige forstyrrelser og restriksjoner på ikke-kommersiell og eksperimentell radiovirksomhet."
    ],
    "points": 324,
    "commentCount": 163,
    "retryCount": 0,
    "time": 1698520558
  },
  {
    "id": 38050106,
    "title": "MagicaVoxel - Et gratis redigeringsprogram for voxel-tegninger og interaktiv banegjengivelse",
    "originLink": "https://ephtracy.github.io/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38050106",
    "commentBody": "",
    "originSummary": [
      "MagicaVoxel er en gratis voxel art editor og renderer med mange funksjoner og snarveier for å lage 3D-modeller og animasjoner. Programmet kan imidlertid ikke selges kommersielt eller leveres sammen med annen programvare.",
      "Nylige oppdateringer har optimalisert animasjonsskaping, rendering, transformasjonsredigering, materialsystemet og penselalternativene. Den nyeste versjonen inneholder forbedringer som nye utvalgsmoduser, justerbare penselalternativer og forbedret renderingskvalitet.",
      "Verktøyet har flere unike funksjoner som kamerakontroll, mønsterpakker, språkoversettelse og støtte for eksport av voxelmodeller i ulike formater med funksjoner som tåkespredning og voxel shaders."
    ],
    "commentSummary": [
      "MagicaVoxel er et populært, gratis redigeringsprogram for voxel-tegning og path tracing-renderer som brukes mye til å lage voxel-modeller og landskap, for eksempel i open source MMORPG MMORPG Veloren.",
      "Selv om det ikke er åpen kildekode, har det mange tilhengere på grunn av sin enkelhet, behagelige brukeropplevelse og kompatibilitet med 3D-printing. Det har til og med satt fart på utviklingen av lignende verktøy.",
      "Noen brukere har uttrykt ønske om fremtidig støtte for Linux og Apple Silicon, noe som indikerer at programvaren har potensial for vekst og utvidelse."
    ],
    "points": 291,
    "commentCount": 45,
    "retryCount": 0,
    "time": 1698503579
  },
  {
    "id": 38050535,
    "title": "Å få bibliotekkortene mine inn på telefonen på den vanskelige måten",
    "originLink": "https://iliana.fyi/blog/ios-wallet-library-card/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38050535",
    "commentBody": "",
    "originSummary": [
      "Forfatteren forteller om sine erfaringer med å digitalisere bibliotekkort for å lagre dem i iPhone-appen Wallet, og går nærmere inn på tekniske detaljer som strekkodeformater og kryptografisk signering.",
      "Artikkelen gir en omfattende veiledning i hvordan du oppretter et virtuelt lånekort ved hjelp av passerspesifikasjonen og diskuterer ulike bruksområder for passerseddelgeneratoren.",
      "Det foreslås å inkludere Codabar-støtte (et strekkodeformat som brukes av mange biblioteker) i Apple Wallet for å utvide funksjonaliteten."
    ],
    "commentSummary": [
      "Artikkelen tar for seg kompleksiteten og hindringene knyttet til bruk av mobiltelefoner som bibliotek- og transportkort, med særlig fokus på teknologiske mangler i Seattle.",
      "Den tar opp personvernhensyn ved bruk av kredittkort i forbindelse med kollektivtransport, diskuterer fordelene med kredittkort kontra transportkort og utfordringene med å opprettholde billettløse transportsystemer.",
      "Brukere viser en viss forvirring over nedstemmer på Hacker News for å utvikle løsninger og skrive skript, noe som peker mot en bredere debatt om lagring av digitale kort på smarttelefoner."
    ],
    "points": 280,
    "commentCount": 147,
    "retryCount": 0,
    "time": 1698506783
  },
  {
    "id": 38051488,
    "title": "Fikse volumet på Bluetooth-øreproppene mine",
    "originLink": "https://blog.ornx.net/post/bluetooth-volume-fix/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38051488",
    "commentBody": "",
    "originSummary": [
      "Forfatteren deler prosessen med å utbedre volumproblemet på Tozo T6-øreproppene, som omfatter undersøkelser, diagnostisering og oppdatering av fastvaren ved hjelp av en Android-app.",
      "Innlegget beskriver hvordan forfatteren satte opp en avlyttingsproxy for å analysere nettverkstrafikk og finne fastvarefiler, og overvinne krypterings- og komprimeringsutfordringer.",
      "Til syvende og sist lykkes forfatteren med å endre volumet på systemlydfilene i fastvaren og blinke den til enheten, og presenterer prosjektet som et morsomt prosjekt og tar til orde for kontroll av systemlydvolumet."
    ],
    "commentSummary": [
      "Diskusjonene dreier seg om problemer med Bluetooth-enheter som varsler om lavt batterinivå ved maks volum, tilkoblingsproblemer og volumkontroll på iOS-enheter.",
      "Et annet viktig diskusjonstema er mangelen på brukerautoritet over systemlyder på Bluetooth-enheter.",
      "Brukerne deler sine personlige erfaringer med disse problemene, samt mulige løsninger og diskuterer Bluetooths tekniske kompleksitet."
    ],
    "points": 224,
    "commentCount": 60,
    "retryCount": 0,
    "time": 1698512806
  },
  {
    "id": 38053586,
    "title": "Elektroreduksjon av nitrogen med nesten 100 % strøm-til-ammoniakk-effektivitet (2022)",
    "originLink": "https://www.nature.com/articles/s41586-022-05108-y",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38053586",
    "commentBody": "",
    "originSummary": [
      "En fersk studie, publisert i Nature, fokuserer på elektroreduksjon av nitrogen til ammoniakk, som kan brukes i sektorer som fornybar energi, transport og gjødselproduksjon.",
      "Forskere ved Monash University oppdaget at en høykonsentrert imidbasert litiumsaltelektrolytt muliggjorde et høyt ammoniakkutbytte med en strøm-til-ammoniakk-virkningsgrad på nesten 100 %.",
      "Disse innovasjonene kan resultere i en mer effektiv og miljøvennlig metode for ammoniakkproduksjon, som kan få kommersiell anvendelse via Jupiter Ionics."
    ],
    "commentSummary": [
      "En ny forskningsartikkel legger vekt på et gjennombrudd innen nitrogenelektroreduksjon, som gir høy effektivitet i ammoniakkproduksjon via laserindusert multifotondissosiasjon av litiumoksid.",
      "Denne metoden baner vei for lokal ammoniakkproduksjon og karbonfrie drivstoffalternativer, til tross for problemer med høyt energiforbruk og sikkerhetsproblemer.",
      "Studien utforsker også effektiv konvertering av elektrisitet til ammoniakk for energilagring, gjødsel- og drivstoffproduksjon, samtidig som den tar hensyn til praktiske og sikkerhetsmessige aspekter, med diskusjoner om skalerbarhet, toksisitet og potensiell bruk av ammoniakk til produksjon av eksplosiver."
    ],
    "points": 209,
    "commentCount": 113,
    "retryCount": 0,
    "time": 1698528855
  },
  {
    "id": 38050381,
    "title": "Samsung deaktiverer kundetelefoner eksternt og holder data som gissel [video].",
    "originLink": "https://www.youtube.com/watch?v=Ln4rsxWq3WM",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38050381",
    "commentBody": "",
    "originSummary": [
      "I sammendraget fremheves det hvordan produsenter, spesielt Samsung, deaktiverer enheter som eies av kundene, slik at brukerne i praksis blir låst ute fra dataene sine med mindre de kjøper et nytt produkt.",
      "Mange mexicanske forbrukere som ikke har råd til å kjøpe disse enhetene i offisielle butikker, har kjøpt dem på det grå markedet, og de mexicanske myndighetene har grepet inn og hevdet at disse handlingene krenker forbrukernes rettigheter.",
      "Samsung får massiv kritikk, særlig for å ha deaktivert enheter og holdt tilbake brukernes data."
    ],
    "commentSummary": [
      "Artikkelen fremhever bekymringen for Samsungs evne til å fjerndeaktivere telefoner, noe som kan føre til at kundedata holdes som gissel, noe som kan ha negativ innvirkning på selskapets image og salg.",
      "Den utforsker det begrensede utvalget av sikre smarttelefoner og diskuterer alternative operativsystemer med åpen kildekode, og tar opp spørsmål om telefonsikkerhet, markedstilgjengelighet og forbrukerrettigheter.",
      "Artikkelen understreker viktigheten av personvern og kontroll over personopplysninger, og kritiserer teknologigiganter som Samsung, Apple, Microsoft og Google for inkonsekvens på dette området."
    ],
    "points": 194,
    "commentCount": 102,
    "retryCount": 0,
    "time": 1698505722
  },
  {
    "id": 38052564,
    "title": "Tildeling av arenaer i SBCL",
    "originLink": "https://github.com/sbcl/sbcl/blob/master/doc/internals-notes/arena-allocation.txt",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38052564",
    "commentBody": "",
    "originSummary": [
      "Teksten gir en oversikt over et kodelager for et åpen kildekode-prosjekt ved navn sbcl.",
      "Repositoryet inneholder ulike viktige filer knyttet til prosjektets interne funksjoner, inkludert dokumentasjon og kodefiler.",
      "Den nevner også et nyttig tips om å trykke Alt+F1 for å få tilgang til en meny med operasjoner."
    ],
    "commentSummary": [
      "Diskusjonstråden på Hacker News dreier seg om Arena Allocation, en ny funksjon i SBCL (Steel Bank Common Lisp), som gjør det mulig å allokere minne i en bestemt arena og ødelegge det uten om søppelsamleren.",
      "De potensielle fordelene og de aktuelle scenariene for tildeling av arenaer utforskes i tråden.",
      "Tråden diskuterer også den sannsynlige relevansen av denne funksjonen for store selskaper som Google og ITA Software."
    ],
    "points": 188,
    "commentCount": 26,
    "retryCount": 0,
    "time": 1698520494
  },
  {
    "id": 38055711,
    "title": "Er koloskopier verdt det?",
    "originLink": "https://asteriskmag.com/issues/04/you-re-invited-to-a-colonoscopy?ref=thebrowser.com",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38055711",
    "commentBody": "",
    "originSummary": [
      "En studie som undersøkte effekten av koloskopier for å forebygge kolorektal kreft, viste både positive og negative resultater, noe som førte til varierende svar.",
      "Selv om det ble observert en markant reduksjon i kreftforekomsten, var reduksjonen i dødelighet liten, noe som har utløst en debatt om kostnadseffektivitet.",
      "Kritikerne mener at studien har mangler, og at det derfor er nødvendig med ytterligere forskning for å kartlegge alle fordeler og ulemper ved koloskopi som kreftforebyggende tiltak."
    ],
    "commentSummary": [
      "Diskusjonen dreier seg om fordelene og ulempene ved å bruke koloskopi som screeningmetode for kolorektal kreft.",
      "Det er delte meninger, blant annet om enkeltpersoners erfaringer med alternative tester og bekymringer knyttet til mulige økonomiske interesser i forbindelse med regelmessige koloskopier.",
      "Samtalen omfatter også effektiviteten, begrensningene og muligheten for ikke-invasive screeningmetoder."
    ],
    "points": 187,
    "commentCount": 139,
    "retryCount": 0,
    "time": 1698551676
  },
  {
    "id": 38054860,
    "title": "Friend's Chandler, Matthew Perry, døde 54 år gammel",
    "originLink": "https://www.latimes.com/california/story/2023-10-28/freinds-star-matthew-perry-dead-at-56",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38054860",
    "commentBody": "",
    "originSummary": [
      "\"Friends\"-stjernen Matthew Perry, kjent for sin rolle som Chandler Bing, er død 54 år gammel. Dødsårsaken er foreløpig ukjent, men det er ingen mistanke om at noe kriminelt har skjedd.",
      "Perry har tidligere slitt med rusavhengighet, men begynte nylig å skrive som en form for terapi.",
      "Han mottok mange hyllester fra kolleger, venner og fans, og Perry hadde uttrykt et ønske om å bli husket som en som levde et godt liv og hjalp andre."
    ],
    "commentSummary": [
      "Matthew Perry, kjent for sin rolle i Friends, er død 54 år gammel, noe som har ført til diskusjoner om kjendisers død og aldring.",
      "Samtalen omfatter også følelsesmessige reaksjoner på slike dødsfall og viktigheten av å søke profesjonell hjelp ved behov.",
      "En sidediskusjon tar for seg teknologiens potensielle rolle i å forutse fatale hendelser, samt ulike syn på forstad versus byliv og hvordan berømmelse kan føre til avhengighet."
    ],
    "points": 178,
    "commentCount": 124,
    "retryCount": 0,
    "time": 1698540440
  },
  {
    "id": 38052416,
    "title": "React bruker C",
    "originLink": "https://github.com/elnardu/react-use-c",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38052416",
    "commentBody": "",
    "originSummary": [
      "\"elnardu/react-use-c\" er et repository på GitHub som inneholder et grensesnitt for bruk av programmeringsspråket C i React-rammeverket.",
      "Repositoryet er populært med 163 stjerner og har blitt forked to ganger, noe som tyder på at det er brukervennlig og vekker interesse i miljøet.",
      "Den er bygget ved hjelp av JavaScript, HTML og Makefile-kode, noe som viser at det finnes mange forskjellige kodespråk i konstruksjonen."
    ],
    "commentSummary": [
      "Innlegget på Hacker News er en debatt om de nylige endringene i React-økosystemet, med særlig fokus på Next.js og gjengivelse på serversiden.",
      "Diskusjonen tar også for seg valg av ressursbegrensede brikker for innebygd utvikling og balanserer dette med kompleksiteten og bruken av JavaScript.",
      "I innlegget nevnes også alternative rammeverk til React, noe som viser mangfoldet av meninger i teknologimiljøet når det gjelder bruk og kompleksitet av JavaScript."
    ],
    "points": 173,
    "commentCount": 70,
    "retryCount": 0,
    "time": 1698519470
  },
  {
    "id": 38052864,
    "title": "Elixir og Phoenix kan gjøre alt",
    "originLink": "https://fly.io/phoenix-files/elixir-and-phoenix-can-do-it-all/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38052864",
    "commentBody": "",
    "originSummary": [
      "Artikkelen tar til orde for bruk av Elixir og Phoenix i webutvikling, og roser funksjoner som støtte for samtidighet, distribusjon og eksterne funksjonskall, noe som kan oppnås gjennom den virtuelle maskinen BEAM.",
      "Det understreker også fordelene med programmeringsspråket Elixir - som avhengighetsstyring, testverktøy og et omfattende standardbibliotek - som øker funksjonaliteten.",
      "Den konkluderer med å foreslå Fly.io som en egnet plattform for kjøring av Phoenix-applikasjoner, og bekrefter at den er effektiv."
    ],
    "commentSummary": [
      "Denne artikkelen tar for seg fordelene ved å bruke Elixir og Phoenix til utvikling av kompleks infrastruktur, og fremhever hvor enkelt og fleksibelt det er å administrere ulike tjenester innenfor samme kodebase.",
      "De største debattene blant utviklere og Hacker News-brukere dreier seg om fraværet av statisk typing i Elixir, der noen mener denne funksjonen er unødvendig, mens andre mener den er avgjørende.",
      "Andre diskusjoner i innlegget dreier seg om problemer med læremateriell og spesifikke databaser, i tillegg til komplimenter for økosystemet og verktøyene, der den begrensede adopsjonen av Elixir i stor grad tilskrives mangelen på støtte fra store bedrifter."
    ],
    "points": 150,
    "commentCount": 79,
    "retryCount": 0,
    "time": 1698523036
  },
  {
    "id": 38050236,
    "title": "Velnærte menneskers grusomme fantasier",
    "originLink": "https://www.monbiot.com/2023/10/04/the-cruel-fantasies-of-well-fed-people/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38050236",
    "commentBody": "",
    "originSummary": [
      "Artikkelen kritiserer Chris Smajes bok \"A Small Farm Future\", særlig hans syn på det ikke-bærekraftige ved høye avlinger og urban livsstil.",
      "Artikkelforfatteren mener at disse oppfatningene bidrar til fattigdom og sult, og oppfordrer til en mer sammenkoblet tilnærming for å løse globale utfordringer og forhindre samfunnskollaps.",
      "Artikkelen setter søkelyset på nødvendigheten av å prioritere menneskers og planetens ve og vel fremfor personlige interesser, og oppfordrer til et åpent sinn og en mangfoldig tilnærming til løsninger."
    ],
    "commentSummary": [
      "Samtalen berører flere spørsmål knyttet til matproduksjon og bærekraft, blant annet de skadelige effektene av husdyrhold, utfordringer ved å gå over til vegansk kosthold og betydningen av tradisjonelle jordbruksmetoder.",
      "Diskusjonen omfatter også aspekter som lokal matproduksjon i byer, bærekraftig landbruk, tilgjengelig og rimelig sunt kosthold, årsaker til fedme, kostnader og tilgjengelighet av mat globalt og truende landbrukskriser.",
      "Innlegget foreslår løsninger som å legge om industrilandbruket til fornybar energi, minimere avhengigheten av animalske produkter og kontrollere befolkningsveksten. Andre temaer som statlige gårder, kjøttforbruk, erfaringer med jordbruk og kapitalismens rolle tas også opp."
    ],
    "points": 143,
    "commentCount": 119,
    "retryCount": 0,
    "time": 1698504611
  },
  {
    "id": 38048811,
    "title": "Storbritannias omstridte lov om sikkerhet på nettet er nå lovfestet",
    "originLink": "https://www.wired.com/story/the-uks-controversial-online-safety-act-is-now-law/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38048811",
    "commentBody": "",
    "originSummary": [
      "Den britiske regjeringens \"Online Safety Act\" er nå lovfestet og har til hensikt å beskytte enkeltpersoner, særlig barn, på Internett.",
      "Kritikerne mener imidlertid at loven er ineffektiv når det gjelder å motvirke feilinformasjon, at den krenker personvernet og overlater omfattende kontroll til private selskaper. Den kan til og med sette krypteringen i fare ved å kreve skanning av brukernes meldinger.",
      "Lovens likhet med Investigatory Powers Act har fått enkelte selskaper til å vurdere å forlate Storbritannia. Samtidig oppfattes EU-kommissærens trusler mot Elon Musk og selskapet hans som hule av kritikerne."
    ],
    "commentSummary": [
      "Storbritannias Online Safety Act har ført til debatter om personvern, databeskyttelse, informasjonsfrihet og effektive metoder for aldersverifisering.",
      "Kritikerne hevder at lovforslaget kan føre til kommunikasjonsanklager basert på falsk informasjon og ujevnt juridisk forsvar, og noen vurderer til og med å blokkere britiske besøkende på nettsidene sine som en form for protest.",
      "Loven satte i gang bredere diskusjoner om håndtering av feilinformasjon på nettet og konsekvensene for ytringsfriheten, og det oppstod også en perifer debatt om byplanlegging, offentlig transport og autoritære styresett."
    ],
    "points": 131,
    "commentCount": 141,
    "retryCount": 0,
    "time": 1698490599
  },
  {
    "id": 38055816,
    "title": "Windows-installasjonsprogrammet for ImageMagick vil ikke lenger være signert.",
    "originLink": "https://github.com/ImageMagick/ImageMagick/discussions/6826",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38055816",
    "commentBody": "",
    "originSummary": [
      "Windows-installasjonsprogrammet for ImageMagick vil ikke lenger være signert på grunn av utløpet av kodesigneringssertifikatet, som de ikke lenger kan eksportere og bruke i GitHub-handlinger.",
      "Teamet vurderer for øyeblikket en skyløsning, og Digicert er foreløpig det eneste alternativet, med en pris på 629 dollar for ett år.",
      "Selv om de inviterer til sponsing for å få et kodesigneringssertifikat, har noen brukere foreslått alternativer som SignPath og Azure KeyVault."
    ],
    "commentSummary": [
      "Dialogen dreier seg om problemene åpen kildekode-prosjekter har med å anskaffe og fornye kodesigneringssertifikater for programvaren sin, med kritikk av høye kostnader og ineffektivitet.",
      "Diskusjoner om økonomisk bærekraft, behovet for forbedrede finansierings- og sikkerhetssystemer og alternative løsninger som Azure Key Vault, en skytjeneste for sikker lagring og tilgang til kryptografiske nøkler, er også utbredt.",
      "Det legges vekt på betydningen av identitetsverifisering, tillit til kode og bekymringer rundt proprietær programvare og selvsignerte sertifikater. Verdien og svakhetene ved ImageMagick, en programvarepakke for bilderedigering med åpen kildekode, blir også nevnt."
    ],
    "points": 126,
    "commentCount": 143,
    "retryCount": 0,
    "time": 1698553894
  }
]
