[
  {
    "id": 39326559,
    "title": "Amazon Secara Ilegal Memecat Pekerja karena Menyuarakan Kematian Rekan Kerja",
    "originLink": "https://jacobin.com/2023/11/i-was-illegally-fired-by-amazon-for-speaking-out-about-a-coworkers-death/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39326559",
    "commentBody": "",
    "originSummary": [
      "Pengadilan Polandia telah memutuskan bahwa Amazon secara tidak sah memberhentikan seorang pekerja yang berbicara tentang kematian seorang rekan kerja, menyoroti masalah-masalah seperti perlakuan tidak manusiawi, pelanggaran hak-hak serikat pekerja, dan kondisi kerja yang berbahaya.",
      "Pengadilan memutuskan bahwa Amazon melanggar hak-hak serikat pekerja, tetapi perusahaan masih memiliki opsi untuk mengajukan banding atas keputusan tersebut dalam waktu tiga minggu. Masih belum dapat dipastikan apakah keputusan ini akan menghasilkan perubahan kebijakan yang signifikan di Amazon.",
      "Pekerja menghadapi tantangan dalam berorganisasi karena perbedaan kontrak kerja, meskipun ada perkembangan positif, seperti perlindungan hukum bagi pengurus serikat pekerja dan potensi perubahan di bawah pemerintahan yang baru."
    ],
    "commentSummary": [
      "Seorang karyawan Amazon di Polandia mengklaim telah dipecat secara tidak sah karena berbicara tentang kematian rekan kerjanya, sehingga menimbulkan kekhawatiran akan adanya potensi pembalasan terhadap karyawan AS.",
      "Percakapan tersebut mencakup topik-topik seperti perbedaan kondisi jalan di berbagai negara bagian, perbedaan sistem pajak di Florida dan California, pengalaman karyawan dengan perayaan di tempat kerja dan departemen SDM, dan dinamika kekuasaan antara pemberi kerja dan karyawan.",
      "Laporan ini juga membahas tentang upaya-upaya serikat pekerja, profitabilitas Amazon, dan kewajiban pemberi kerja untuk memastikan lingkungan kerja yang aman."
    ],
    "points": 528,
    "commentCount": 418,
    "retryCount": 0,
    "time": 1707576993
  },
  {
    "id": 39330797,
    "title": "OpenTTD: Game Taipan Transportasi Sumber Terbuka Terbaik",
    "originLink": "https://www.openttd.org/about",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39330797",
    "commentBody": "",
    "originSummary": [
      "OpenTTD adalah game simulasi sumber terbuka yang sangat mirip dengan game klasik \"Transport Tycoon Deluxe\" sambil menggabungkan fitur-fitur baru.",
      "Menawarkan peta yang lebih besar, mode multipemain yang dapat menampung hingga 255 pemain, algoritme pencarian jalur yang canggih, dan opsi penyesuaian yang banyak.",
      "Gim ini dapat diakses, mendukung berbagai bahasa, dan menampilkan berbagai peningkatan antarmuka. Selain itu, game ini kompatibel dengan berbagai sistem operasi."
    ],
    "commentSummary": [
      "OpenTTD, sebuah game simulasi transportasi, menandai hari jadinya yang ke-20 dan bersiap-siap untuk rilis besar-besaran.",
      "Para pemain berbagi elemen favorit mereka dari permainan ini, seperti menyabotase teman dan menyebabkan kemacetan lalu lintas, sementara beberapa pemain merasa permainan ini kurang sulit dan menyarankan untuk memperkenalkan tantangan.",
      "Percakapan juga mencakup perbandingan dengan game simulator lain seperti Factorio, serta tips untuk pemain baru dan diskusi tentang pembaruan dan ketersediaan game di Steam."
    ],
    "points": 334,
    "commentCount": 54,
    "retryCount": 0,
    "time": 1707604082
  },
  {
    "id": 39327192,
    "title": "Aho: Implementasi Git di AWK untuk Pendidikan dan Hiburan",
    "originLink": "https://github.com/djanderson/aho",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39327192",
    "commentBody": "",
    "originSummary": [
      "\"Aho\" adalah implementasi Git yang ditulis dalam AWK, yang dirancang untuk tujuan hiburan dan pendidikan.",
      "Kursus ini mengeksplorasi bagian dalam Git dan memanfaatkan fitur-fitur terbaru dari GNU AWK.",
      "Petunjuk untuk menjalankan proyek tersedia, tetapi mungkin tidak bekerja dengan lancar pada BSD/Mac."
    ],
    "commentSummary": [
      "Diskusi di Hacker News berpusat pada bahasa pemrograman Awk dan kelebihannya dibandingkan dengan Perl, Python, dan Ruby.",
      "Para peserta menyoroti kesederhanaan dan ketiadaan masalah ketergantungan sebagai manfaat Awk, tetapi ada kekhawatiran tentang kesesuaiannya untuk tugas-tugas yang kompleks.",
      "Topik lain dalam pembicaraan termasuk kurangnya pembaruan untuk Awk, saran untuk perbaikan, penggunaannya dalam lingkungan baris perintah Linux, pemrosesan teks, dan efisiensinya dalam router dengan memori terbatas."
    ],
    "points": 240,
    "commentCount": 104,
    "retryCount": 0,
    "time": 1707581137
  },
  {
    "id": 39327734,
    "title": "Bagaimana cara belajar yang efektif: Panduan Komprehensif untuk Sukses",
    "originLink": "https://cse.buffalo.edu/~rapaport/howtostudy.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39327734",
    "commentBody": "",
    "originSummary": [
      "Artikel ini menawarkan panduan menyeluruh untuk belajar secara efektif, membahas berbagai aspek seperti manajemen waktu, membuat catatan, membaca aktif, pekerjaan rumah, persiapan ujian, penelitian, dan penulisan esai.",
      "Buku ini menyoroti pentingnya menemukan teknik belajar yang dipersonalisasi dan menawarkan tips praktis berdasarkan pengalaman pribadi.",
      "Artikel ini juga menyanggah teori-teori tentang gaya belajar dan memberikan referensi sumber daya tambahan tentang membaca yang efektif, mencari bantuan dari guru, dan persiapan ujian."
    ],
    "commentSummary": [
      "Diskusi ini mengeksplorasi strategi belajar yang efektif, termasuk perdebatan antara mencatat dan memahami konten.",
      "Gaya belajar yang berbeda dan pentingnya motivasi juga dibahas, serta berbagai teknik pembelajaran.",
      "Teks ini juga membahas tentang peningkatan kinerja tes SAT, peran motivasi dalam pembelajaran jangka panjang, dan pentingnya pengkodean dan pengambilan dalam retensi memori."
    ],
    "points": 220,
    "commentCount": 71,
    "retryCount": 0,
    "time": 1707583830
  },
  {
    "id": 39327113,
    "title": "Svelte: Kerangka Kerja Web yang Ajaib dan Berfokus pada Pengguna untuk Membangun Hal-hal Keren",
    "originLink": "https://github.com/sveltejs/svelte/discussions/10085",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39327113",
    "commentBody": "",
    "originSummary": [
      "Svelte adalah sebuah kerangka kerja web yang menghargai web dan berfokus pada pengoptimalan untuk pengalaman yang positif daripada mengejar popularitas.",
      "Svelte memprioritaskan HTML sebagai bahasa utama untuk mendeskripsikan antarmuka pengguna dan mendorong kemajuan dan inovasi dalam pengembangan web.",
      "Kerangka kerja ini menekankan desain kualitatif, yang bertujuan untuk membuat Svelte terasa ajaib dan memberdayakan pengguna untuk membangun hal-hal keren tanpa pengetahuan teknis yang luas. Framework ini digerakkan oleh komunitas, menghargai konsensus dan umpan balik, dan bertujuan untuk menjadi kerangka kerja terbaik untuk semua jenis aplikasi."
    ],
    "commentSummary": [
      "Kerangka kerja Svelte sedang didiskusikan dan para pengguna memiliki pendapat yang berbeda tentang kekuatan dan kelemahannya.",
      "Beberapa pengguna menyukainya karena menyerupai HTML dan ramah pengguna, sementara yang lain mengkritiknya karena menyimpang dari HTML dan menambah kerumitan.",
      "Perdebatan meliputi pro dan kontra penggunaan HTML versus bahasa alternatif untuk deskripsi UI, keterbatasan HTML untuk antarmuka dinamis, dan pentingnya memahami teknologi yang mendasarinya. Perbandingan dengan kerangka kerja lain seperti React, NextJS, dan Vue dibuat, dan diskusi menyentuh sintaks, arahan kompiler, dan pengoptimalan kinerja dan pengalaman pengguna."
    ],
    "points": 186,
    "commentCount": 131,
    "retryCount": 0,
    "time": 1707580662
  },
  {
    "id": 39331771,
    "title": "Remaja Dicurigai Menjalankan Aksi Terorisme yang Menargetkan Sekolah dan Gereja, Membuat Ribuan Orang Terancam",
    "originLink": "https://www.independent.co.uk/news/world/americas/crime/swatting-nikki-haley-trump-fbi-stalkers-b2494097.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39331771",
    "commentBody": "",
    "originSummary": [
      "Seorang remaja dari California, Alan Winston Filion, dicurigai mengoperasikan layanan \"pemukulan\", menawarkan ancaman bom hoax dan penembakan massal dengan bayaran melalui aplikasi pesan terenkripsi Telegram.",
      "Filion menargetkan sekolah, gereja, dan bahkan Mahkamah Agung dengan panggilan palsu ini, yang menimbulkan risiko serius bagi ribuan orang.",
      "Penulis Patrick S. Tomlinson, yang menjadi korban dalam beberapa insiden pemukulan, mengadvokasi undang-undang yang lebih ketat dan memperlakukan pelaku pemukulan sebagai teroris domestik."
    ],
    "commentSummary": [
      "Diskusi ini berfokus pada pemukulan, termasuk topik-topik seperti respon polisi, akuntabilitas, dan pelatihan.",
      "Kekhawatiran muncul tentang bahaya yang dihadapi oleh para korban dan petugas polisi.",
      "Solusi yang diusulkan termasuk hukuman yang lebih tegas bagi para pemukul dan meningkatkan metode validasi sebelum mengirim tim SWAT."
    ],
    "points": 171,
    "commentCount": 276,
    "retryCount": 0,
    "time": 1707613182
  },
  {
    "id": 39326675,
    "title": "Sewa-Setabil 1 Kamar Tidur di NYC: Biaya Broker yang Tinggi Mengancam Keterjangkauan",
    "originLink": "https://gothamist.com/news/a-rent-stabilized-1-bedroom-apartment-for-1100-in-nyc-the-brokers-fee-is-15k",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39326675",
    "commentBody": "",
    "originSummary": [
      "Seorang broker di Queens, New York mendaftarkan sebuah apartemen satu kamar tidur di bawah harga pasar dengan harga $1.100 per bulan, tetapi dengan biaya broker $15.000, sehingga menyulitkan penyewa untuk menyewa karena harus membayar uang tunai di muka.",
      "Biaya broker yang berlebihan di pasar real estat New York City menyebabkan kesulitan bagi penyewa yang ingin pindah.",
      "Sebuah rancangan undang-undang Dewan Kota yang baru telah diusulkan yang akan mengalihkan tanggung jawab pembayaran biaya broker dari penyewa ke pihak yang menyewa broker, tetapi para kritikus berpendapat bahwa hal ini dapat menyebabkan harga sewa yang lebih tinggi."
    ],
    "commentSummary": [
      "Diskusi ini mencakup berbagai topik yang berhubungan dengan perumahan, seperti harga sewa, pajak properti, keterjangkauan perumahan, dan peran sejarah kredit dalam menyewa.",
      "Isu-isu spesifik di berbagai negara dan kota disebutkan, seperti kekurangan perumahan di Jerman dan biaya broker di AS.",
      "Percakapan ini menekankan pada tantangan dan perspektif yang beragam seputar perumahan dan menekankan pentingnya perumahan yang adil dan terjangkau."
    ],
    "points": 165,
    "commentCount": 389,
    "retryCount": 0,
    "time": 1707577945
  },
  {
    "id": 39328007,
    "title": "Menjadi Dungeon Master: Proses Wawancara Inovatif dari Startup untuk Teknisi Pendukung",
    "originLink": "https://www.propelauth.com/post/interview-dungeon-master",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39328007",
    "commentBody": "",
    "originSummary": [
      "Sebuah perusahaan rintisan telah mengembangkan proses wawancara unik untuk para teknisi pendukung yang melibatkan lingkungan simulasi yang menyerupai tugas sehari-hari dalam pekerjaan.",
      "Kandidat akan diberikan produk palsu, dokumentasi, dan antrean email/pertanyaan, dan ditugaskan untuk menyelesaikan tiket seperti yang mereka lakukan di dunia nyata.",
      "Proses ini mencakup aset tambahan untuk setiap tiket untuk mensimulasikan penyelesaian masalah tanpa komunikasi bolak-balik, mirip seperti menjadi Dungeon Master di Dungeons and Dragons.",
      "Simulasi ini membantu mengevaluasi kemampuan pemecahan masalah para kandidat dan memberikan wawasan yang berharga tentang kemampuan mereka.",
      "Namun, ada tantangan dalam menetapkan batasan untuk kandidat dan memastikan konsistensi di antara para pewawancara.",
      "Secara keseluruhan, proses wawancara ini telah menerima umpan balik yang positif dan menawarkan pengalaman yang lebih menarik bagi para kandidat."
    ],
    "commentSummary": [
      "Ada pergeseran dalam proses wawancara untuk insinyur perangkat lunak, dengan penekanan pada pertanyaan algoritmik daripada pengalaman dunia nyata.",
      "Kandidat yang berpengalaman mungkin akan kesulitan mempersiapkan diri untuk menghadapi pertanyaan-pertanyaan seperti ini, yang menyebabkan kekhawatiran tentang keadilan.",
      "Topik diskusi lainnya termasuk pengaruh perusahaan teknologi besar, penggunaan pertanyaan bergaya leetcode, keterbatasan penilaian keterampilan praktis, dan dampak sistem ekonomi terhadap akses ke alat canggih.",
      "Efektivitas metode wawancara yang berbeda, seperti tugas yang dibawa pulang dan wawancara standar, masih diperdebatkan, bersama dengan pentingnya menghasilkan data dan melibatkan beberapa peninjau.",
      "Strategi rekrutmen yang efektif untuk pengembang perangkat lunak dibahas, termasuk mendefinisikan persyaratan pekerjaan, mengajukan pertanyaan yang relevan, menilai keingintahuan dan antusiasme, dan menawarkan gaji yang kompetitif."
    ],
    "points": 160,
    "commentCount": 137,
    "retryCount": 0,
    "time": 1707585199
  },
  {
    "id": 39326201,
    "title": "Walmart, Delta, dan Starbucks Menggunakan AI untuk Memantau Pesan Karyawan",
    "originLink": "https://www.cnbc.com/2024/02/09/ai-might-be-reading-your-slack-teams-messages-using-tech-from-aware.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39326201",
    "commentBody": "",
    "originSummary": [
      "Walmart, Delta, Chevron, T-Mobile, dan Starbucks memanfaatkan teknologi AI dari perusahaan rintisan Aware untuk memonitor pesan karyawan di platform seperti Slack dan Microsoft Teams.",
      "Teknologi AI Aware menganalisis sentimen karyawan dan mengidentifikasi perilaku seperti pelecehan dan ketidakpatuhan.",
      "Pendapatan Aware telah tumbuh 150% setiap tahunnya, dan kliennya mencakup perusahaan-perusahaan besar dengan sekitar 30.000 karyawan."
    ],
    "commentSummary": [
      "Perusahaan seperti Walmart, Delta, dan Starbucks menggunakan teknologi AI untuk memantau pesan karyawan, yang memicu kekhawatiran tentang privasi dan kontrol perusahaan terhadap karyawan.",
      "Perdebatan ini menimbulkan pertanyaan tentang lingkungan kerja yang menindas, erosi kepercayaan sosial, kebutuhan akan undang-undang privasi, dan implikasi etis dari praktik pengawasan.",
      "Diskusi juga mencakup topik-topik seperti enkripsi pesan secara manual, manfaat dan risiko analisis sentimen, dan potensi penyalahgunaan informasi pribadi oleh pemberi kerja. Pentingnya privasi di tempat kerja, potensi diskriminasi usia, dan strategi yang menargetkan kelompok usia yang lebih muda juga disebutkan."
    ],
    "points": 148,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1707573991
  },
  {
    "id": 39333220,
    "title": "Bekerja di GitLab: Perpaduan Pengalaman dalam Kinerja, Manajemen, dan Penentuan Prioritas",
    "originLink": "https://yorickpeterse.com/articles/what-it-was-like-working-for-gitlab/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39333220",
    "commentBody": "",
    "originSummary": [
      "Penulis bekerja di GitLab selama enam tahun dan baru-baru ini keluar, berbagi pengalaman dan wawasan mereka.",
      "Mereka mendiskusikan pencapaian, seperti meningkatkan kinerja, membangun alat bantu, dan memperkenalkan fitur-fitur baru di perusahaan.",
      "Tantangan yang dihadapi termasuk masalah manajemen, kinerja yang buruk, dan perbedaan arah, yang membuat mereka keluar.",
      "Kritik dibuat tentang proses pengambilan keputusan GitLab dan penentuan prioritas keputusan produk.",
      "Artikel ini menyoroti tantangan-tantangan SaaS versus instalasi yang di-host sendiri dan menekankan pentingnya penerapan kode yang cepat.",
      "Penulis menyimpulkan dengan ulasan yang beragam tentang waktu mereka di GitLab, merekomendasikannya sebagai tempat yang bagus untuk bekerja."
    ],
    "commentSummary": [
      "Diskusi ini mencakup berbagai topik termasuk bahasa pemrograman, manajemen, kejenuhan, gaji berdasarkan lokasi, dan dampaknya terhadap ekonomi lokal.",
      "Ada perdebatan tentang kesesuaian bahasa dan kerangka kerja, pentingnya manajemen yang baik, tantangan kerja jarak jauh, dan keadilan gaji berbasis lokasi.",
      "Artikel tersebut menyarankan bahwa perusahaan harus memiliki formula standar untuk kompensasi, dengan mempertimbangkan faktor-faktor seperti sharding dan waktu penyebaran untuk kesuksesan organisasi."
    ],
    "points": 142,
    "commentCount": 102,
    "retryCount": 0,
    "time": 1707636544
  },
  {
    "id": 39330330,
    "title": "Kompilasi Stasiun Radio Streaming Musik Demoscene dan Video Game",
    "originLink": "https://mw.rat.bz/davgmsrl/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39330330",
    "commentBody": "",
    "originSummary": [
      "Halaman web ini merupakan kompilasi tautan stasiun radio streaming musik demoscene dan video game.",
      "Daftar ini mencakup tautan ke beranda, daftar putar, dan streaming untuk setiap stasiun.",
      "Pengguna dapat mencari berdasarkan genre atau kata kunci untuk menemukan stasiun yang serupa."
    ],
    "commentSummary": [
      "Pos ini menampilkan berbagai tautan radio streaming musik demosene dan video game yang dibagikan oleh pengguna, menyediakan koleksi sumber daya bagi para penggemar.",
      "Rainwave.cc disorot karena fitur uniknya yang memungkinkan pendengar untuk mempengaruhi pemilihan lagu melalui sistem voting.",
      "Pengguna juga berbagi situs web dan stasiun radio lain yang terkait dengan musik demoscene dan video game, sehingga memperluas pilihan bagi individu yang tertarik."
    ],
    "points": 134,
    "commentCount": 32,
    "retryCount": 0,
    "time": 1707599959
  },
  {
    "id": 39326092,
    "title": "Transisi TLD .GOV dari Verisign ke Cloudflare: Pendekatan Penandatanganan DNSSEC Unik yang Digunakan",
    "originLink": "https://indico.dns-oarc.net/event/48/contributions/1038/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39326092",
    "commentBody": "",
    "originSummary": [
      "Presentasi ini membahas transisi domain tingkat atas .GOV dari Verisign ke Cloudflare dan pendekatan mereka terhadap penandatanganan DNSSEC.",
      "Verisign menggunakan penandatanganan offline dengan RSA dan NSEC3, sementara Cloudflare menggunakan penandatanganan online dengan ECDSA dan NSEC.",
      "Pengujian ekstensif tidak menemukan masalah dalam menggunakan NSEC dan NSEC3 secara bersamaan, sehingga keduanya dapat digunakan dalam masa transisi."
    ],
    "commentSummary": [
      "Verisign telah mengalihkan operasi untuk domain tingkat atas .GOV ke Cloudflare, sehingga memicu diskusi tentang kompleksitas DNS dan waktu henti domain .nz.",
      "Spekulasi muncul mengenai kemitraan pemerintah dengan Cloudflare, potensi pengawasan NSA, dan kebingungan seputar manajemen server DNS dan captcha.",
      "Langkah ini menimbulkan pertanyaan tentang proposisi nilai Cloudflare dan perannya dalam mengelola infrastruktur internet yang penting."
    ],
    "points": 127,
    "commentCount": 66,
    "retryCount": 0,
    "time": 1707572788
  },
  {
    "id": 39331383,
    "title": "Pelajaran Piano Jarak Jauh Menjadi Mudah dengan API MIDI Web",
    "originLink": "https://keyboardconnect.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39331383",
    "commentBody": "",
    "originSummary": [
      "Seorang pengembang membuat aplikasi konferensi video yang dirancang khusus untuk pelajaran piano guna mengatasi kesulitan yang dihadapi oleh tutor piano dan siswa yang menggunakan platform seperti Skype atau Zoom.",
      "Aplikasi ini menggunakan WebRTC untuk transmisi data, termasuk media, status MIDI, dan pada akhirnya file lembaran musik dan data musik lainnya.",
      "Produk minimum yang layak (MVP) dari aplikasi ini telah berkinerja lebih baik dari yang diharapkan, dan pengembangnya terbuka untuk umpan balik dan saran."
    ],
    "commentSummary": [
      "Keyboard Connect adalah platform yang sukses untuk pelajaran piano jarak jauh menggunakan Web MIDI API.",
      "Pengguna dapat mendaftar untuk mengikuti pelajaran dan membeli adaptor USB MIDI yang direkomendasikan.",
      "Diskusi ini berfokus pada pentingnya tuts berbobot dalam pembelajaran piano, serta mengeksplorasi alternatif lain seperti keyboard dan antarmuka MIDI."
    ],
    "points": 123,
    "commentCount": 55,
    "retryCount": 0,
    "time": 1707609029
  },
  {
    "id": 39325700,
    "title": "7 Tips untuk Meningkatkan Hubungan Anda di Hari Valentine",
    "originLink": "https://www.psychologytoday.com/gb/blog/beautiful-minds/200812/the-tears-clown",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39325700",
    "commentBody": "",
    "originSummary": [
      "Artikel ini menawarkan tujuh tips untuk memperkuat hubungan pada Hari Valentine.",
      "Kiat-kiat ini dapat membantu individu memperbaiki dan meningkatkan ikatan mereka dengan pasangannya.",
      "Artikel ini memberikan saran dan nasihat praktis yang dapat diterapkan untuk menciptakan pengalaman Hari Valentine yang lebih bermakna dan menyenangkan."
    ],
    "commentSummary": [
      "Diskusi ini mencakup berbagai topik yang berkaitan dengan komedi, humor, dan ketidakbahagiaan.",
      "Karya ini mengeksplorasi potensi kelelahan emosional yang disebabkan oleh tawa, kritik Plato terhadap seni dan sastra, dan penggambaran kehidupan manusia dalam media.",
      "Buku ini juga membahas tanggung jawab penulis, hubungan antara komedi dan perjuangan pribadi, dan penggunaan humor sebagai mekanisme koping."
    ],
    "points": 122,
    "commentCount": 81,
    "retryCount": 0,
    "time": 1707568340
  }
]
