[
  {
    "id": 37764581,
    "title": "Interaktivní úvod do CRDT",
    "originLink": "https://jakelazaroff.com/words/an-interactive-intro-to-crdts/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37764581",
    "commentBody": "",
    "originSummary": [
      "Příspěvek se zabývá myšlenkou bezkonfliktních replikovaných datových typů (CRDT) a jejich úlohou při vývoji kolaborativních aplikací.",
      "Blog se zaměřuje na CRDT založené na stavu a nabízí příklady, jako jsou Last Write Wins Register a Last Write Wins Map.",
      "Článek dále vysvětluje implementaci třídy Last Write Wins (LWW) Map a obsahuje ukázky kódu pro správu dat v registrech LWW a naznačuje možný budoucí příspěvek."
    ],
    "commentSummary": [
      "Článek se věnuje typům CRDT (Conflict-free Replicated Data Types) a jejich úloze v systémech pro úpravu textu a spolupráci na dokumentech.",
      "Zdůrazňuje důležitost pochopení základních operací CRDT prostřednictvím skutečných příkladů kódu a diskutuje problémy a kompromisy při používání CRDT v lokálním nastavení.",
      "V doprovodné diskusi na fóru se diskutuje o použití CRDT versus operačních transformací v softwaru pro kolaborativní editaci, což podtrhuje význam CRDT v populárních aplikacích."
    ],
    "points": 781,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1696425165
  },
  {
    "id": 37763424,
    "title": "FTC žaluje Amazon kvůli \"skryté dani\" v celé ekonomice",
    "originLink": "https://www.thebignewsletter.com/p/the-ftc-sues-to-break-up-amazon-over",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37763424",
    "commentBody": "",
    "originSummary": [
      "Federální obchodní komise (FTC) a 17 států podalo proti společnosti Amazon antimonopolní žalobu, v níž ji obviňují z monopolizace a nekalé hospodářské soutěže především kvůli jejímu členskému programu Prime.",
      "Mezi obviněními uvedenými v žalobě jsou vysoké poplatky účtované prodejcům třetích stran, které vedou ke zvýšení spotřebitelských cen, odrazují prodejce od nabízení levnějších cen na jiných platformách a zhoršují uživatelskou zkušenost.",
      "Pokud bude žaloba úspěšná, mohla by vést ke snížení cen, posílení konkurence a možným nápravným opatřením, jako je ukončení opatření proti slevám nebo rozdělení společnosti Amazon. Stížnost rovněž upozorňuje na tajnůstkářskou povahu antimonopolních soudů a ničení dokumentů společností Amazon."
    ],
    "commentSummary": [
      "Federální obchodní komise (FTC) žaluje společnost Amazon kvůli údajným skrytým daním, které zvyšují náklady na reklamní model. Stejně tak kalifornský generální prokurátor obviňuje společnost Amazon z protisoutěžních praktik.",
      "Diskutuje se o zásadních otázkách, jako je manipulace s cenami, hospodářská soutěž a vliv \"buy boxu\" společnosti Amazon na výběr zákazníků a hospodářskou soutěž. Komentáře na Redditu se zaměřují na doložky nejvyšších výhod společnosti Amazon, které vyvolaly obavy o spravedlivost trhu.",
      "Diskutuje se také o kontrole společnosti Amazon nad trhem elektronického obchodování, obtížnosti vytváření konkurence pro platformy jako Amazon, její politice vyžadující nejnižší ceny ve srovnání s ostatními platformami a o případném zásahu vlády."
    ],
    "points": 687,
    "commentCount": 585,
    "retryCount": 0,
    "time": 1696417402
  },
  {
    "id": 37763098,
    "title": "Klasický video poker",
    "originLink": "https://lfgslots.com/classicvideopoker/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37763098",
    "commentBody": "",
    "originSummary": [
      "Jedná se o zkušeného odborníka na Unity 3D, který úspěšně založil a vedl svou konzultační společnost.",
      "Oceňují Godot, pokročilý open-source 2D a 3D herní engine, a dokázali ho efektivně využít.",
      "Chtějí založit specializovanou firmu, která by vyvíjela hry ve stylu 80. let pro korporace, a v současné době hledají zájemce, konkrétně o vytvoření hry Space Invaders pro Nike. Za zajištěnou práci je nabízena provize."
    ],
    "commentSummary": [
      "Autor, odborník na Unity 3D, začal používat herní engine Godot, jehož prostřednictvím vyvinul hru video poker a získal pozitivní zpětnou vazbu, přestože se objevila chyba ve výplatě za pár es.",
      "Diskuse se zaměřují na dobu načítání hry v Godotu, srovnání s jinými enginy, jako je Unity, použití CRT shaderů a běžné problémy a odměny při vývoji her.",
      "Zpětná vazba ke hře video poker zahrnuje návrhy na použití jazyka C# namísto GDScript v systému Godot, vylepšení hratelnosti, problémy s padáním a zamrzáním a diskuse o historii hry video poker."
    ],
    "points": 553,
    "commentCount": 211,
    "retryCount": 0,
    "time": 1696414684
  },
  {
    "id": 37766446,
    "title": "Pixel 8 Pro",
    "originLink": "https://store.google.com/product/pixel_8_pro?hl=en-US",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37766446",
    "commentBody": "",
    "originSummary": [
      "Společnost Google nabízí propagační akci, v jejímž rámci mohou zákazníci, kteří si zakoupí nový telefon Pixel 8 Pro, získat zdarma hodinky Pixel Watch 2 nebo sluchátka Pixel Buds Pro.",
      "Pixel 8 Pro nabízí pokročilé funkce, jako je umělá inteligence Google, propracovaný systém fotoaparátu, lepší možnosti fotografování při slabém osvětlení a nahrávání videa. Klade také důraz na bezpečnost díky krizovým upozorněním a různým ochranným vrstvám.",
      "Společnost Google také nabízí možnosti financování, plány ochrany, program výměny a dopravu zdarma. Za zmínku stojí nabídka banky Synchrony Bank na financování telefonu a dalších nákupů s 0% RPSN."
    ],
    "commentSummary": [
      "V diskusích se hovoří o negativním dopadu častého vydávání chytrých telefonů na životní prostředí a spotřebitele, přičemž se vyjadřuje nespokojenost s malými hardwarovými vylepšeními a krátkou životností těchto zařízení.",
      "Účastníci navrhují telefony s uživatelsky vyměnitelnými bateriemi a vyměnitelným úložištěm, aby se prodloužila jejich životnost, a řeší preference upgradovatelných součástí, minimální softwarovou zátěž a problémy se spolehlivostí karet microSD.",
      "Dialog se týká také problému zpomalení iPhonu, postoje spotřebitelů k upgradům, vnímaného rozdílu v inovacích mezi společnostmi Apple a Qualcomm a budoucího technologického pokroku. Diskutuje se také o obavách o životní prostředí, touze po zařízeních s delší životností a řešeních, jako jsou otevřené telefony založené na Linuxu."
    ],
    "points": 424,
    "commentCount": 689,
    "retryCount": 0,
    "time": 1696432759
  },
  {
    "id": 37774580,
    "title": "Pythagorova věta nalezená na hliněné tabulce o 1 000 let starší než Pythagoras",
    "originLink": "https://link.springer.com/article/10.1057/jt.2009.16",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37774580",
    "commentBody": "",
    "originSummary": [
      "Pythagorova věta, která je často připisována Pythagorovi, mohla být babylonským matematikům známa již dříve.",
      "Tato věta má významnou hodnotu jak ve fyzice, tak v matematice, kde se stále uplatňuje.",
      "Významní matematici, jako například Euklides a Pierre de Fermat, rovněž přispěli svými díly, což ještě zvýšilo význam a důležitost této věty v dnešní době."
    ],
    "commentSummary": [
      "Byla objevena hliněná tabulka, která by mohla pocházet z doby před Pythagorovou smrtí, a ukazuje větu, kterou Pythagoras dobře znal a která spojuje matematiku s duchovnem.",
      "Diskuse na fóru zpochybňuje historické připsání věty Pythagorovi a zabývá se také tématy, jako je význam jmen a vznik technologie.",
      "Vlákno také představuje debatu o pravosti zmíněného akademického časopisu, která ilustruje kontrolu zdrojů v akademické diskusi."
    ],
    "points": 362,
    "commentCount": 93,
    "retryCount": 0,
    "time": 1696475983
  },
  {
    "id": 37764326,
    "title": "Silné statické psaní, kopec, na kterém jsem ochoten zemřít",
    "originLink": "https://www.svix.com/blog/strong-typing-hill-to-die-on/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37764326",
    "commentBody": "",
    "originSummary": [
      "Článek zdůrazňuje výhody silného typování při vývoji softwaru, především zachycení chyb během kompilace a definování smluv mezi částmi kódu.",
      "Na příkladech a scénářích je popsáno, jak může psaní na klávesnici zlepšit vývoj a zabránit chybám.",
      "Autor dochází k závěru, že výhody silného psaní převažují nad jeho nevýhodami, a podporuje jeho začlenění do programátorské praxe."
    ],
    "commentSummary": [
      "Diskuse se zabývá efektivitou a problémy statického typování v programovacích jazycích, přičemž někteří tvrdí, že zlepšuje zachytávání chyb a čitelnost, zatímco jiní tvrdí, že dynamické typování umožňuje větší agilitu a robustní testování.",
      "Specifické typové systémy, jako je například TypeScript, jsou také rozebírány s ohledem na jejich omezení. Neexistuje však jasná shoda na tom, zda je lepší statické nebo dynamické typování, a akademické poznatky zůstávají nepřesvědčivé.",
      "Jsou diskutována další související témata, včetně automatického dokončování, deserializace, validace a kritického významu vyčerpávajícího testování."
    ],
    "points": 357,
    "commentCount": 704,
    "retryCount": 0,
    "time": 1696423757
  },
  {
    "id": 37769962,
    "title": "Vespa.ai se vyděluje ze společnosti Yahoo jako samostatná společnost",
    "originLink": "https://blog.vespa.ai/vespa-is-becoming-its-own-company/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37769962",
    "commentBody": "",
    "originSummary": [
      "Vespa.ai, nástroj pro zpracování velkých objemů dat, se stává samostatným subjektem společnosti Yahoo. Tento engine je známý tím, že implementuje algoritmy umělé inteligence pro efektivní správu a využití velkých datových souborů.",
      "Navzdory rozdělení bude Vespa nadále spolupracovat se společností Yahoo a plánuje rozšířit své cloudové služby, aby pomohla více podnikům při řešení problémů s umělou inteligencí a velkými daty.",
      "Společnost hodlá urychlit vývoj nových funkcí, aby zákazníkům umožnila navrhovat špičková řešení při nižších nákladech."
    ],
    "commentSummary": [
      "Vespa.ai, vyhledávač založený na umělé inteligenci společnosti Yahoo, se mění na samostatnou společnost, přičemž Yahoo zůstává jejím akcionářem. Cílem tohoto plánu je získat přístup na veřejné kapitálové trhy a využít expandující odvětví umělé inteligence.",
      "Uživatelé si pochvalují vyspělost a schopnosti společnosti Vespa, i když existují obavy ohledně jejích vyhlídek jako samostatné organizace.",
      "Diskuse zahrnuje srovnání s alternativními databázovými řešeními, ziskovost společnosti Yahoo a potenciální vyhlídky společnosti."
    ],
    "points": 307,
    "commentCount": 115,
    "retryCount": 0,
    "time": 1696446007
  },
  {
    "id": 37766122,
    "title": "Pixel 8 bude mít sedm let aktualizací systému Android",
    "originLink": "https://www.theverge.com/2023/10/4/23899900/google-pixel-8-pro-android-updates-7-years-security-features",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37766122",
    "commentBody": "",
    "originSummary": [
      "Google oznamuje prodlouženou podporu pro Pixel 8 a Pixel 8 Pro a slibuje sedm let aktualizací operačního systému a zabezpečení až do roku 2030.",
      "Tato rozšířená podpora, která představuje skok oproti předchozí politice společnosti Google, překonává konkurenci v oblasti Androidu a je možná díky tomu, že společnost Google používá vlastní procesor Tensor.",
      "Přestože podobnou dlouhodobou podporu nabízí i společnost Apple a ještě déle Fairphone, panuje skepse kvůli nekonzistentní historii podpory jiných služeb a iniciativ ze strany společnosti Google."
    ],
    "commentSummary": [
      "Předpokládá se, že smartphone Pixel 8 dostane sedm let aktualizací systému Android, nicméně vzhledem k omezené životnosti baterie a vysokým nákladům na její výměnu vyvstávají otázky, zda je to možné.",
      "Uživatelé diskutují o výhodách a nevýhodách uživatelsky vyměnitelných baterií a o jejich vlivu na elektronický odpad, přičemž hlavním problémem jsou náklady a dostupnost náhradních baterií.",
      "Porovnává se závazek společnosti Google k aktualizacím softwaru pro Pixel 8 s politikou podpory společnosti Apple, včetně diskuzí o dosavadních výsledcích společnosti Google a možnostech používání vlastních ROM."
    ],
    "points": 245,
    "commentCount": 318,
    "retryCount": 0,
    "time": 1696431488
  },
  {
    "id": 37769139,
    "title": "Eliminace rádiového rušení z nabíječky Apple",
    "originLink": "https://oh8hub.substack.com/p/eliminating-radio-interference-from",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37769139",
    "commentBody": "",
    "originSummary": [
      "Příspěvek na blogu OH8HUB se zabývá problémem rádiového rušení způsobeného bezdrátovou nabíječkou Apple.",
      "Podrobně popisuje, jak lze pomocí feritové kuličky a omotáním vodiče USB nabíječky potlačit problematické frekvence.",
      "Autor navrhuje, aby společnost Apple tento problém zvážila při navrhování svých budoucích produktů."
    ],
    "commentSummary": [
      "Rozhovor se soustředí na problém rádiového rušení způsobeného nabíječkami Apple, konkrétně na to, jak ovlivňuje letecké frekvence.",
      "Vyvstávají otázky týkající se schválení těchto zařízení Federální komisí pro komunikace (FCC) a účinnosti jejich mechanismů pro filtrování rušení.",
      "Jsou navržena různá řešení pro minimalizaci tohoto rušení, jako je použití RF tlumivek a feritových kuliček, spolu s potřebou lepší konstrukční praxe a dodržování emisních norem."
    ],
    "points": 242,
    "commentCount": 147,
    "retryCount": 0,
    "time": 1696442474
  },
  {
    "id": 37764088,
    "title": "1,3 miliardy Worldcat scrape a minisoutěž v datové vědě",
    "originLink": "https://annas-blog.org/worldcat-scrape.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37764088",
    "commentBody": "",
    "originSummary": [
      "Archiv Anny získal data ze sbírky metadat knihovny Worldcat a uspořádal minisoutěž v datové vědě.",
      "Získaný soubor dat obsahuje 1,8 miliardy záznamů a organizace přijímá přihlášky do soutěže.",
      "Vyzýváme dobrovolníky, aby tato data analyzovali, podíleli se na ochraně knih a přispívali k jejich iniciativám."
    ],
    "commentSummary": [
      "Článek zkoumá monopol OCLC na Deweyho desetinný systém a databázi Worldcat a zdůrazňuje potřebu udržitelného financování při zachování dostupnosti pro veřejnost.",
      "Zmiňuje se o obavách týkajících se autorských práv v souvislosti s Deweyho desetinným systémem a navrhuje zvážit alternativy.",
      "Článek dále upozorňuje na případ, kdy Annin archiv vyškrábal databázi OCLC, a zdůrazňuje tak důležitost a náročnost získávání přesných a komplexních metadat o knihách. Článek naznačuje potenciální příležitosti pro další cenné datové soubory uprostřed frustrace z přístupu k přesným metadatům ISBN."
    ],
    "points": 228,
    "commentCount": 69,
    "retryCount": 0,
    "time": 1696422178
  },
  {
    "id": 37765158,
    "title": "OpenSSH 9.5 vydáno s obfuskací časování stisků kláves",
    "originLink": "https://lwn.net/Articles/946497/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37765158",
    "commentBody": "",
    "originSummary": [
      "Na trh byla uvedena verze 9.5, která přináší nové funkce, jako je mechanismus ping a krytí časování stisků kláves, chybí však podpora MPTCP.",
      "V současné době probíhá diskuse o rozvětvení OpenSSH, které by zahrnovalo funkce jako MPTCP a AF_VSOCK.",
      "Dialogy se týkají také zavádění některých funkcí v jádrech Linux a BSD a překážek při používání nových síťových protokolů."
    ],
    "commentSummary": [
      "Byla představena verze 9.5 OpenSSH, která obsahuje obfuskaci časování stisku kláves a přechod z generování klíčů RSA na Ed25519, což zvyšuje bezpečnost a stabilitu.",
      "Azure v současné době nepodporuje klíče Ed25519, což může vést k problémům s kompatibilitou.",
      "Vydání podnítilo diskuse o technologické společnosti Rambus, která se zabývá kryptografií a patenty, a debaty o výhodách a nevýhodách kryptografického algoritmu Ed448 a upřednostňování menších a rychlejších klíčů v SSH."
    ],
    "points": 220,
    "commentCount": 54,
    "retryCount": 0,
    "time": 1696427409
  },
  {
    "id": 37766711,
    "title": "Jak americké zpravodajské služby skrývaly své nejhanebnější experimenty",
    "originLink": "https://lithub.com/how-us-intelligence-agencies-hid-their-most-shameful-experiments/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37766711",
    "commentBody": "",
    "originSummary": [
      "Článek se zabývá etickými problémy a nedostatkem odpovědnosti v tajné vědě prováděné americkými zpravodajskými službami, včetně experimentů CIA s ovládáním mysli.",
      "Dotýká se mocenského úsilí CIA při používání zesílených výslechových technik a poukazuje na etické problémy a spornou účinnost těchto experimentů.",
      "Článek oceňuje úsilí hlavního řešitele projektu History Lab, financovaného NSF na Kolumbijské univerzitě, o využití datové vědy k udržování veřejných záznamů."
    ],
    "commentSummary": [
      "Článek pojednává o kontroverzních a skrytých experimentech prováděných americkými zpravodajskými službami, jako byl projekt MKUltra CIA, a zmiňuje některé experimenty ESP, na které se odvolává esej Alana Turinga.",
      "Zdůrazňuje potřebu transparentnosti, dohledu a odpovědnosti ve zpravodajských agenturách a zdůrazňuje, že whistleblowing často nevede k významným strukturálním změnám.",
      "Článek také srovnává zálibu americké zpravodajské komunity ve sběru dat s čínskou vládou a zkoumá různé konspirační teorie, obvinění z korupce a geopolitické události, aby pochopil motivace některých akcí."
    ],
    "points": 210,
    "commentCount": 170,
    "retryCount": 0,
    "time": 1696433779
  },
  {
    "id": 37767205,
    "title": "\"Máte zde 27% problém s umělou inteligencí\"",
    "originLink": "https://twitter.com/rustykitty_/status/1709316764868153537",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37767205",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Diskuse na Twitteru se točí kolem témat, jako je vzdělávání, automatizace, plagiátorství a využití umělé inteligence při hodnocení, a zdůrazňuje obavy ze snížení interakce s lidmi v různých odvětvích.",
      "Účastníci zpochybňují účinnost současných metod hodnocení a možné důsledky přílišného spoléhání se na umělou inteligenci. Diskutuje se o užitečnosti domácích úkolů, hodnotě osobních přednášek a obtížích při provádění alternativních technik hodnocení.",
      "Jsou nastoleny otázky týkající se možného zneužití nástrojů pro odhalování plagiátorství pomocí umělé inteligence, důsledků podvádění na akademické půdě a vnímaného snížení kvality výuky v důsledku integrace umělé inteligence do vzdělávání."
    ],
    "points": 205,
    "commentCount": 231,
    "retryCount": 0,
    "time": 1696435601
  },
  {
    "id": 37770523,
    "title": "1.1.1.1 selhání vyhledávání 4. října 2023",
    "originLink": "https://blog.cloudflare.com/1-1-1-1-lookup-failures-on-october-4th-2023/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37770523",
    "commentBody": "",
    "originSummary": [
      "4. října 2023 se společnost Cloudflare potýkala s problémy s překladem DNS (Domain Name System) kvůli interní softwarové chybě, která vedla k chybným odpovědím SERVFAIL DNS a bránila používání nových verzí kořenových zón.",
      "Problém, který vedl k chybám validace, byl odstraněn tím, že se přestal používat starý soubor kořenové zóny.",
      "Společnost Cloudflare plánuje opatření, která mají podobným případům v budoucnu zabránit a která zahrnují vylepšení monitorovacích a testovacích postupů."
    ],
    "commentSummary": [
      "Dne 4. října 2023 došlo u společnosti Cloudflare k výpadku kvůli vypršení platnosti podpisu DNSSEC, což uživatelům způsobilo problémy s připojením k internetu.",
      "Uživatelé vyjádřili znepokojení nad nedostatkem výstrah a doporučili vylepšení monitorovacích postupů.",
      "Navzdory kritice dominantního postavení společnosti Cloudflare a jejího vlivu na internetovou infrastrukturu zastánci tvrdí, že poskytuje cenná řešení a že se jí podařilo na trhu efektivně expandovat."
    ],
    "points": 192,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1696448481
  },
  {
    "id": 37763143,
    "title": "Problémy s veřejným resolverem 1.1.1.1 a WARPem",
    "originLink": "https://www.cloudflarestatus.com/incidents/j3h00yhjyw6p",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37763143",
    "commentBody": "",
    "originSummary": [
      "Společnost Cloudflare oznámila problémy s překladem DNS u svého veřejného překladače 1.1.1.1 a služby WARP, což vedlo k různým problémům uživatelů.",
      "Problém identifikovali a pracují na jeho nápravě, přičemž některé dopady stále trvají.",
      "Současně společnost Cloudflare zaznamenává nárůst počtu selhání sestavení stránek Pages. Výsledky opravy pečlivě sledují."
    ],
    "commentSummary": [
      "Veřejný resolver Cloudflare (1.1.1.1) a služba WARP se potýkají s problémy s odkazy na archive.is kvůli nekompatibilní podpoře rozšíření DNS. Zdá se, že Archive.is záměrně vrací resolverům Cloudflare falešné výsledky, pravděpodobně kvůli obavám o bezpečnost.",
      "Společnost Cloudflare vyvíjí alternativní řešení, které tyto problémy řeší. Tato situace vedla k širší diskusi o bezpečnosti a ochraně soukromí DNS, včetně zavedení DNS-over-HTTPS (DoH).",
      "Mezi další diskutované body patří úloha resolverů DNS při poskytování funkcí rodičovské kontroly a blokování reklamy, zásady uchovávání dat, používání alternativních služeb resolverů DNS a zásadní potřeba redundance serverů DNS."
    ],
    "points": 180,
    "commentCount": 112,
    "retryCount": 0,
    "time": 1696415123
  }
]
