[
  {
    "id": 37764581,
    "title": "சிஆர்டிடிகளுக்கான ஊடாடும் அறிமுகம்",
    "originLink": "https://jakelazaroff.com/words/an-interactive-intro-to-crdts/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37764581",
    "commentBody": "",
    "originSummary": [
      "இந்த இடுகை மோதல் இல்லாத நகலெடுக்கப்பட்ட தரவு வகைகள் (சிஆர்டிடி) மற்றும் கூட்டு பயன்பாடுகளை வளர்ப்பதில் அவற்றின் பங்கு ஆகியவற்றை ஆராய்கிறது.",
      "இந்த வலைப்பதிவு மாநில அடிப்படையிலான சிஆர்டிடிக்களை மையமாகக் கொண்டுள்ளது மற்றும் கடைசி எழுத்து வெற்றிகள் பதிவேடு மற்றும் கடைசி எழுத்து வெற்றிகள் வரைபடம் போன்ற எடுத்துக்காட்டுகளை வழங்குகிறது.",
      "எல்.டபிள்யூ.டபிள்யூ பதிவேடுகளில் தரவு மேலாண்மைக்கான குறியீட்டு துணுக்குகளுடன் லாஸ்ட் ரைட் வின்ஸ் (எல்.டபிள்யூ.டபிள்யூ) வரைபட வகுப்பை செயல்படுத்துவதை கட்டுரை மேலும் விளக்குகிறது, இது சாத்தியமான எதிர்கால இடுகையைக் குறிக்கிறது."
    ],
    "commentSummary": [
      "கட்டுரை சிஆர்டிடிக்கள் (மோதல் இல்லாத நகலெடுக்கப்பட்ட தரவு வகைகள்) மற்றும் உரை எடிட்டிங் மற்றும் கூட்டு ஆவண அமைப்புகளில் அவற்றின் பங்கு ஆகியவற்றை ஆராய்கிறது.",
      "இது உண்மையான குறியீட்டு எடுத்துக்காட்டுகள் மூலம் சிஆர்டிடிகளின் அடிப்படை செயல்பாடுகளைப் புரிந்துகொள்வதன் முக்கியத்துவத்தை அடிக்கோடிட்டுக் காட்டுகிறது மற்றும் உள்ளூர்-முதல் அமைப்பில் சிஆர்டிகளைப் பயன்படுத்துவதன் சவால்கள் மற்றும் வர்த்தகங்களைப் பற்றி விவாதிக்கிறது.",
      "அதனுடன் கூடிய மன்ற விவாதத்தில், கூட்டு எடிட்டிங் மென்பொருளில் சிஆர்டிடிக்கள் மற்றும் செயல்பாட்டு மாற்றங்களைப் பயன்படுத்துவது குறித்து விவாதம் உள்ளது, இது பிரபலமான பயன்பாடுகளில் சிஆர்டிடிகளின் பொருத்தத்தை அடிப்படையாகக் கொண்டுள்ளது."
    ],
    "points": 781,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1696425165
  },
  {
    "id": 37763424,
    "title": "பொருளாதார அளவிலான \"மறைக்கப்பட்ட வரி\" தொடர்பாக அமேசானை உடைக்க எஃப்.டி.சி வழக்கு தொடுக்கிறது",
    "originLink": "https://www.thebignewsletter.com/p/the-ftc-sues-to-break-up-amazon-over",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37763424",
    "commentBody": "",
    "originSummary": [
      "ஃபெடரல் டிரேட் கமிஷன் (எஃப்.டி.சி) மற்றும் 17 மாநிலங்கள் அமேசானுக்கு எதிராக நம்பிக்கை எதிர்ப்பு வழக்கைத் தொடங்கியுள்ளன, முதன்மையாக அதன் பிரைம் உறுப்பினர் திட்டத்தின் காரணமாக ஏகபோகம் மற்றும் நியாயமற்ற போட்டி என்று குற்றம் சாட்டியுள்ளன.",
      "மூன்றாம் தரப்பு விற்பனையாளர்களுக்கு விதிக்கப்படும் அதிக கட்டணம் நுகர்வோர் விலைகளை அதிகரிக்க வழிவகுக்கிறது, விற்பனையாளர்களை மற்ற தளங்களில் மலிவான விலைகளை வழங்குவதை ஊக்கப்படுத்துவது மற்றும் பயனர் அனுபவத்தை மோசமாக்குவது ஆகியவை இந்த வழக்கில் முன்வைக்கப்பட்ட குற்றச்சாட்டுகளில் அடங்கும்.",
      "வழக்கு வெற்றிகரமாக இருந்தால், இது குறைந்த விலைகள், அதிகரித்த போட்டி மற்றும் தள்ளுபடி எதிர்ப்பு நடவடிக்கைகளுக்கு முற்றுப்புள்ளி வைப்பது அல்லது அமேசானைப் பிரிப்பது போன்ற சாத்தியமான தீர்வுகளுக்கு வழிவகுக்கும். இந்த புகார் நம்பிக்கை எதிர்ப்பு நீதிமன்றங்கள் மற்றும் அமேசானின் ஆவண அழிப்பின் ரகசிய தன்மையையும் கொண்டு வருகிறது."
    ],
    "commentSummary": [
      "ஃபெடரல் டிரேட் கமிஷன் (எஃப்.டி.சி) அமேசான் மீது அதன் விளம்பர மாதிரி மூலம் மறைக்கப்பட்ட வரிகள் செலவுகளை அதிகரிப்பதாக குற்றம் சாட்டுகிறது. இதேபோல், கலிபோர்னியா அட்டர்னி ஜெனரல் அமேசான் போட்டிக்கு எதிரான நடைமுறைகளைக் குற்றம் சாட்டுகிறார்.",
      "விலை கையாளுதல், போட்டி மற்றும் வாடிக்கையாளர் தேர்வுகள் மற்றும் போட்டியில் அமேசானின் 'வாங்கு பெட்டி' தாக்கம் போன்ற முக்கியமான பிரச்சினைகள் விவாதிக்கப்படுகின்றன. ரெடிட் கருத்துக்கள் அமேசானின் மிகவும் விரும்பப்பட்ட நாடு (எம்.எஃப்.என்) பிரிவுகள் மீது கவனம் செலுத்துகின்றன, இது சந்தை நியாயம் குறித்த கவலைகளைத் தூண்டியது.",
      "இ-காமர்ஸ் சந்தையில் அமேசானின் கட்டுப்பாடு, அமேசான் போன்ற தளங்களுக்கான போட்டியை உருவாக்குவதில் உள்ள சிரமம், மற்ற தளங்களுடன் ஒப்பிடும்போது மிகக் குறைந்த விலைகள் தேவைப்படும் அதன் கொள்கை மற்றும் சாத்தியமான அரசாங்க தலையீடு ஆகியவையும் விவாதத்தில் அடங்கும்."
    ],
    "points": 687,
    "commentCount": 585,
    "retryCount": 0,
    "time": 1696417402
  },
  {
    "id": 37763098,
    "title": "கிளாசிக் வீடியோ போக்கர்",
    "originLink": "https://lfgslots.com/classicvideopoker/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37763098",
    "commentBody": "",
    "originSummary": [
      "தனிநபர் ஒரு திறமையான யூனிட்டி 3 டி நிபுணர், அவர் வெற்றிகரமாக தங்கள் ஆலோசனையை நிறுவி நிர்வகித்துள்ளார்.",
      "மேம்பட்ட திறந்த மூல 2 டி மற்றும் 3 டி கேம் இயந்திரமான கோடோட்டை அவர்கள் பாராட்டுகிறார்கள், மேலும் அதை திறம்பட பயன்படுத்த முடிந்தது.",
      "பெருநிறுவனங்களுக்காக 80 களின் பாணி விளையாட்டுகளை உருவாக்கும் ஒரு சிறப்பு நிறுவனத்தை நிறுவ அவர்கள் முயற்சிக்கின்றனர், மேலும் அவர்கள் தற்போது முன்னணிகளைத் தேடுகிறார்கள், குறிப்பாக நைக்கிற்கான விண்வெளி படையெடுப்பாளர்கள் விளையாட்டை உருவாக்குவதற்காக. பாதுகாக்கப்பட்ட பணிக்கு கமிஷன் வழங்கப்படுகிறது."
    ],
    "commentSummary": [
      "யுனிட்டி 3 டி நிபுணரான ஆசிரியர், கோடோட் கேம் இயந்திரத்தைப் பயன்படுத்தத் தொடங்கியுள்ளார், இதன் மூலம் அவர்கள் ஒரு வீடியோ போக்கர் விளையாட்டை உருவாக்கி நேர்மறையான கருத்துக்களைப் பெற்றனர், ஒரு ஜோடி ஏஸ்ஸுக்கு பணம் செலுத்தும் பிழை இருந்தபோதிலும்.",
      "விவாதங்கள் கோடோட்டில் விளையாட்டு ஏற்றுதல் நேரம், ஒற்றுமை போன்ற பிற இயந்திரங்களுடன் ஒப்பீடுகள், சிஆர்டி ஷேடர் காட்சிகளின் பயன்பாடு மற்றும் விளையாட்டு வளர்ச்சியில் பொதுவான சவால்கள் மற்றும் வெகுமதிகள் ஆகியவற்றில் கவனம் செலுத்துகின்றன.",
      "வீடியோ போக்கர் விளையாட்டைப் பற்றிய பின்னூட்டத்தில் கோடோட்டில் ஜிடிஸ்கிரிப்டுக்கு பதிலாக சி # ஐப் பயன்படுத்துவது குறித்த பரிந்துரைகள், கேம்ப்ளே மேம்பாடுகள், செயலிழப்பு மற்றும் உறைதல் சிக்கல்கள் மற்றும் வீடியோ போக்கரின் வரலாற்றைச் சுற்றியுள்ள விவாதங்கள் ஆகியவை அடங்கும்."
    ],
    "points": 553,
    "commentCount": 211,
    "retryCount": 0,
    "time": 1696414684
  },
  {
    "id": 37766446,
    "title": "பிக்சல் 8 ப்ரோ",
    "originLink": "https://store.google.com/product/pixel_8_pro?hl=en-US",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37766446",
    "commentBody": "",
    "originSummary": [
      "புதிய பிக்சல் 8 ப்ரோவை வாங்கும் வாடிக்கையாளர்கள் இலவச பிக்சல் வாட்ச் 2 அல்லது பிக்சல் பட்ஸ் ப்ரோவைப் பெறும் விளம்பர சலுகையை கூகிள் இயக்குகிறது.",
      "பிக்சல் 8 ப்ரோ கூகிள் ஏஐ, அதிநவீன கேமரா அமைப்பு, அதிகரித்த குறைந்த ஒளி புகைப்படம் எடுத்தல் மற்றும் வீடியோ பதிவு திறன் போன்ற மேம்பட்ட அம்சங்களை வழங்குகிறது. இது நெருக்கடி எச்சரிக்கைகள் மற்றும் பல்வேறு பாதுகாப்பு அடுக்குகளுடன் பாதுகாப்பை வலியுறுத்துகிறது.",
      "கூகிள் நிதி விருப்பங்கள், பாதுகாப்பு திட்டங்கள், டிரேட்-இன் திட்டம் மற்றும் இலவச ஷிப்பிங் ஆகியவற்றையும் வழங்குகிறது. தொலைபேசி மற்றும் பிற தகுதிவாய்ந்த கொள்முதல்களில் சின்க்ரோனி வங்கியின் 0% ஏபிஆர் நிதி சலுகை குறிப்பிடத்தக்கது."
    ],
    "commentSummary": [
      "இந்த விவாதங்கள் அடிக்கடி ஸ்மார்ட்போன் வெளியீடுகளின் எதிர்மறையான சுற்றுச்சூழல் மற்றும் நுகர்வோர் தாக்கத்தைப் பற்றி பேசுகின்றன, இந்த சாதனங்களின் சிறிய வன்பொருள் மேம்பாடுகள் மற்றும் குறுகிய ஆயுட்காலம் குறித்து விரக்திகள் எழுப்பப்படுகின்றன.",
      "ஆயுட்காலத்தை அதிகரிக்க பயனர் மாற்றக்கூடிய பேட்டரிகள் மற்றும் அகற்றக்கூடிய சேமிப்பகம் கொண்ட தொலைபேசிகளை பங்கேற்பாளர்கள் பரிந்துரைக்கின்றனர், மேம்படுத்தக்கூடிய பாகங்களுக்கான விருப்பத்தேர்வுகள், குறைந்தபட்ச மென்பொருள் வீக்கம் மற்றும் மைக்ரோ எஸ்டி கார்டுகளுடன் நம்பகத்தன்மை சிக்கல்களை நிவர்த்தி செய்கிறார்கள்.",
      "இந்த உரையாடலில் ஐபோன் ஸ்லோ டவுன் பிரச்சினை, மேம்படுத்தல்களுக்கான நுகர்வோர் அணுகுமுறைகள், ஆப்பிள் மற்றும் குவால்காம் இடையே கண்டுபிடிப்புகளில் உணரப்பட்ட வேறுபாடு மற்றும் எதிர்கால தொழில்நுட்ப முன்னேற்றங்கள் ஆகியவை அடங்கும். சுற்றுச்சூழல் கவலைகள், நீண்டகால சாதனங்களுக்கான விருப்பம் மற்றும் திறந்த லினக்ஸ் அடிப்படையிலான தொலைபேசிகள் போன்ற தீர்வுகளும் விவாதிக்கப்படுகின்றன."
    ],
    "points": 424,
    "commentCount": 689,
    "retryCount": 0,
    "time": 1696432759
  },
  {
    "id": 37774580,
    "title": "களிமண் டேப்லெட்டில் காணப்படும் பைத்தகோரியன் தேற்றம் பைத்தகோரஸை விட 10 ஆண்டுகள் பழமையானது",
    "originLink": "https://link.springer.com/article/10.1057/jt.2009.16",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37774580",
    "commentBody": "",
    "originSummary": [
      "பைத்தகோரியன் தேற்றம், பெரும்பாலும் பைத்தகோரஸால் கூறப்பட்டாலும், பாபிலோனிய கணிதவியலாளர்களுக்கு முன்பே தெரிந்திருக்கலாம்.",
      "இக்கோட்பாடு இயற்பியல் மற்றும் கணிதம் ஆகிய இரு துறைகளிலும் குறிப்பிடத்தக்க மதிப்பைக் கொண்டுள்ளது, அங்கு இது தொடர்ந்து பயன்படுத்தப்படுகிறது.",
      "யூக்ளிட் மற்றும் பியர் டி ஃபெர்மாட் போன்ற குறிப்பிடத்தக்க கணிதவியலாளர்களும் கணிசமான பங்களிப்புகளைச் செய்தனர், இது தேற்றத்தின் முக்கியத்துவத்தையும் பொருத்தத்தையும் இன்று அதிகரித்தது."
    ],
    "commentSummary": [
      "கணிதத்தையும் ஆன்மீகத்தையும் இணைக்கும் அவருக்கு நன்கு தெரிந்த தேற்றத்தை வெளிப்படுத்தும் ஒரு களிமண் பலகை கண்டுபிடிக்கப்பட்டுள்ளது.",
      "மன்ற நூல் விவாதம் பைதாகரஸுக்கு தேற்றத்தின் வரலாற்றுக் காரணத்தை கேள்விக்குள்ளாக்குகிறது, மேலும் பெயர்களின் முக்கியத்துவம் மற்றும் தொழில்நுட்பத்தின் தோற்றம் போன்ற தலைப்புகளையும் ஆராய்கிறது.",
      "இந்த நூல் குறிப்பிடப்பட்ட கல்வி இதழின் நம்பகத்தன்மை குறித்த விவாதத்தையும் முன்வைக்கிறது, இது கல்வி விவாதத்தில் ஆதாரங்களின் ஆய்வை விளக்குகிறது."
    ],
    "points": 362,
    "commentCount": 93,
    "retryCount": 0,
    "time": 1696475983
  },
  {
    "id": 37764326,
    "title": "வலுவான நிலையான தட்டச்சு, நான் இறக்கத் தயாராக இருக்கும் ஒரு மலை",
    "originLink": "https://www.svix.com/blog/strong-typing-hill-to-die-on/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37764326",
    "commentBody": "",
    "originSummary": [
      "மென்பொருள் உருவாக்கத்தில் வலுவான தட்டச்சு செய்வதன் நன்மைகளை இந்த கட்டுரை எடுத்துக்காட்டுகிறது, முக்கியமாக தொகுப்பு நேரத்தின் போது பிழைகளைப் பிடிப்பது மற்றும் குறியீடு பிரிவுகளுக்கு இடையிலான ஒப்பந்தங்களை வரையறுப்பது.",
      "எடுத்துக்காட்டுகள் மற்றும் காட்சிகளைப் பயன்படுத்தி, தட்டச்சு எவ்வாறு வளர்ச்சி அனுபவத்தை மேம்படுத்தலாம் மற்றும் பிழைகளைத் தடுக்கலாம் என்பதை இது விவாதிக்கிறது.",
      "வலுவான தட்டச்சு நன்மைகள் அதன் குறைபாடுகளை விட அதிகமாக உள்ளன மற்றும் நிரலாக்க நடைமுறைகளில் அதன் ஒருங்கிணைப்பை ஊக்குவிக்கின்றன என்று ஆசிரியர் முடிவு செய்கிறார்."
    ],
    "commentSummary": [
      "விவாதங்கள் நிரலாக்க மொழிகளில் நிலையான தட்டச்சு செய்வதன் செயல்திறன் மற்றும் சவால்களை ஆராய்கின்றன, சிலர் இது பிழை பிடிப்பு மற்றும் வாசிப்புத்திறனை மேம்படுத்துகிறது என்று வாதிடுகின்றனர், மற்றவர்கள் டைனமிக் தட்டச்சு அதிக சுறுசுறுப்பு மற்றும் வலுவான சோதனையை அனுமதிக்கிறது என்று வாதிடுகின்றனர்.",
      "டைப்ஸ்கிரிப்ட் போன்ற குறிப்பிட்ட வகை அமைப்புகளும் அவற்றின் வரம்புகள் குறித்து ஆராயப்படுகின்றன. இருப்பினும், நிலையான அல்லது டைனமிக் தட்டச்சு சிறந்ததா என்பதில் தெளிவான ஒருமித்த கருத்து இல்லை, மேலும் கல்வி கண்டுபிடிப்புகள் முடிவில்லாதவை.",
      "தன்னியக்க நிறைவு, நீக்குதல், சரிபார்த்தல் மற்றும் முழுமையான சோதனையின் முக்கிய முக்கியத்துவம் உள்ளிட்ட பிற தொடர்புடைய தலைப்புகள் விவாதிக்கப்படுகின்றன."
    ],
    "points": 357,
    "commentCount": 704,
    "retryCount": 0,
    "time": 1696423757
  },
  {
    "id": 37769962,
    "title": "யாஹூவில் இருந்து தனி நிறுவனமாக வலம் வரும் Vespa.ai",
    "originLink": "https://blog.vespa.ai/vespa-is-becoming-its-own-company/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37769962",
    "commentBody": "",
    "originSummary": [
      "பெரிய தரவு சேவை இயந்திரமான Vespa.ai யாஹூவிலிருந்து தனி நிறுவனமாக மாறி வருகிறது. பெரிய தரவுத் தொகுப்புகளை திறம்பட நிர்வகிக்கவும் பயன்படுத்தவும் செயற்கை நுண்ணறிவு வழிமுறைகளை செயல்படுத்துவதற்கு இந்த இயந்திரம் அறியப்படுகிறது.",
      "பிரிவு இருந்தபோதிலும், வெஸ்பா யாகூவுடன் ஒரு கூட்டாண்மையைப் பராமரிக்கும் மற்றும் செயற்கை நுண்ணறிவு மற்றும் பெரிய தரவு சிக்கல்களைத் தீர்ப்பதில் அதிக நிறுவனங்களுக்கு உதவ அதன் கிளவுட் சேவைகளை விரிவுபடுத்த திட்டமிட்டுள்ளது.",
      "வாடிக்கையாளர்கள் குறைந்த செலவில் சிறந்த தீர்வுகளை உருவாக்க உதவும் வகையில் புதிய அம்சங்களின் வளர்ச்சியை விரைவுபடுத்த நிறுவனம் விரும்புகிறது."
    ],
    "commentSummary": [
      "யாஹூவின் செயற்கை நுண்ணறிவு அடிப்படையிலான தேடுபொறியான Vespa.ai, யாகூவை ஒரு பங்குதாரராக வைத்திருக்கும் அதே நேரத்தில் ஒரு தனி நிறுவனமாக மாறுகிறது. இந்த திட்டம் பொது மூலதன சந்தைகளுக்கான அணுகலைப் பெறுவதும், விரிவடைந்து வரும் செயற்கை நுண்ணறிவுத் தொழிலை மேம்படுத்துவதும் ஆகும்.",
      "பயனர்கள் வெஸ்பாவின் முதிர்ச்சியையும் திறன்களையும் பாராட்டுகிறார்கள், இருப்பினும் ஒரு சுயாதீன நிறுவனமாக அதன் வாய்ப்புகள் குறித்து கவலைகள் உள்ளன.",
      "இந்த விவாதம் மாற்று தரவுத்தள தீர்வுகள், யாகூவின் இலாபம் மற்றும் நிறுவனத்திற்கான சாத்தியமான தவறவிடப்பட்ட வாய்ப்புகள் ஆகியவற்றுடன் ஒப்பீடுகளை உள்ளடக்கியது."
    ],
    "points": 307,
    "commentCount": 115,
    "retryCount": 0,
    "time": 1696446007
  },
  {
    "id": 37766122,
    "title": "பிக்சல் 8 ஸ்மார்ட்போனில் ஆண்ட்ராய்டு அப்டேட்",
    "originLink": "https://www.theverge.com/2023/10/4/23899900/google-pixel-8-pro-android-updates-7-years-security-features",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37766122",
    "commentBody": "",
    "originSummary": [
      "கூகிள் அதன் பிக்சல் 8 மற்றும் பிக்சல் 8 ப்ரோவுக்கு நீட்டிக்கப்பட்ட ஆதரவை அறிவிக்கிறது, இது 2030 வரை ஏழு ஆண்டுகள் ஓஎஸ் மற்றும் பாதுகாப்பு புதுப்பிப்புகளை உறுதியளிக்கிறது.",
      "கூகிளின் முந்தைய கொள்கையிலிருந்து ஒரு பாய்ச்சலான இந்த நீட்டிக்கப்பட்ட ஆதரவு, அதன் ஆண்ட்ராய்டு போட்டியை மிஞ்சுகிறது மற்றும் கூகிள் அதன் சொந்த டென்சர் செயலியைப் பயன்படுத்துவதால் இது சாத்தியமாகிறது.",
      "ஆப்பிள் வழங்கும் இதேபோன்ற நீண்டகால ஆதரவு இருந்தபோதிலும், ஃபேர்போனால் இன்னும் நீண்ட காலம் இருந்தபோதிலும், பிற சேவைகள் மற்றும் முன்முயற்சிகளை ஆதரிப்பதில் கூகிளின் சீரற்ற வரலாறு காரணமாக சந்தேகம் நிலவுகிறது."
    ],
    "commentSummary": [
      "பிக்சல் 8 ஸ்மார்ட்போன் ஏழு வருட ஆண்ட்ராய்டு புதுப்பிப்புகளைப் பெறும் என்று எதிர்பார்க்கப்படுகிறது, இருப்பினும், வரையறுக்கப்பட்ட பேட்டரி ஆயுட்காலம் மற்றும் மாற்றீடுகளின் அதிக செலவு ஆகியவற்றைக் கருத்தில் கொண்டு இதன் சாத்தியக்கூறு குறித்து கேள்விகள் எழுகின்றன.",
      "பயனர் மாற்றக்கூடிய பேட்டரிகளின் நன்மை தீமைகள் மற்றும் மின் கழிவுகளில் அவற்றின் விளைவுகள் குறித்து பயனர்கள் விவாதித்து வருகின்றனர், பேட்டரி மாற்றீடுகளின் செலவு மற்றும் கிடைக்கும் தன்மை முதன்மை கவலையாக உள்ளது.",
      "பிக்சல் 8 க்கான மென்பொருள் புதுப்பிப்புகளுக்கான கூகிளின் அர்ப்பணிப்பு மற்றும் ஆப்பிளின் ஆதரவு கொள்கைகளுக்கு இடையிலான ஒப்பீடுகள் வரையப்பட்டுள்ளன, இதில் கூகிளின் டிராக் ரெக்கார்டு மற்றும் தனிப்பயன் ரோம்களைப் பயன்படுத்துவதற்கான திறன் பற்றிய விவாதங்கள் அடங்கும்."
    ],
    "points": 245,
    "commentCount": 318,
    "retryCount": 0,
    "time": 1696431488
  },
  {
    "id": 37769139,
    "title": "ஆப்பிள் சார்ஜரிலிருந்து ரேடியோ குறுக்கீட்டை நீக்குதல்",
    "originLink": "https://oh8hub.substack.com/p/eliminating-radio-interference-from",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37769139",
    "commentBody": "",
    "originSummary": [
      "OH8HUB இன் வலைப்பதிவு இடுகை ஆப்பிளின் வயர்லெஸ் சார்ஜரால் ஏற்படும் ரேடியோ குறுக்கீடு பிரச்சினையைப் பற்றி பேசுகிறது.",
      "ஃபெரிட் மணி கூறுகளைப் பயன்படுத்துவது மற்றும் சார்ஜரின் யூ.எஸ்.பி கம்பியை அதைச் சுற்றி சுற்றுவது சிக்கலான அதிர்வெண்களை எவ்வாறு குறைக்கும் என்பதை இது விவரிக்கிறது.",
      "ஆப்பிள் தங்கள் எதிர்கால தயாரிப்பு வடிவமைப்புகளில் இந்த சிக்கலை கருத்தில் கொள்ள வேண்டும் என்று ஆசிரியர் பரிந்துரைக்கிறார்."
    ],
    "commentSummary": [
      "உரையாடல் ஆப்பிள் சார்ஜர்களால் ஏற்படும் ரேடியோ குறுக்கீடு பிரச்சினையை மையமாகக் கொண்டுள்ளது, குறிப்பாக இது விமான அதிர்வெண்களை எவ்வாறு பாதிக்கிறது.",
      "எஃப்.சி.சி, ஃபெடரல் கம்யூனிகேஷன்ஸ் கமிஷன் இந்த சாதனங்களின் ஒப்புதல் மற்றும் அவற்றின் இடையூறு-வடிகட்டுதல் வழிமுறைகளின் செயல்திறன் குறித்து கேள்விகள் எழுப்பப்படுகின்றன.",
      "இந்த குறுக்கீட்டைக் குறைப்பதற்கான பல்வேறு தீர்வுகள் பரிந்துரைக்கப்படுகின்றன, அதாவது ஆர்.எஃப் சோக்ஸ் மற்றும் ஃபெரிட் மணிகளைப் பயன்படுத்துதல், சிறந்த வடிவமைப்பு நடைமுறைகள் மற்றும் உமிழ்வு விதிமுறைகளைப் பின்பற்றுதல்."
    ],
    "points": 242,
    "commentCount": 147,
    "retryCount": 0,
    "time": 1696442474
  },
  {
    "id": 37764088,
    "title": "1.3பி வேர்ல்ட்கேட் ஸ்கிராப் மற்றும் டேட்டா சயின்ஸ் மினி போட்டி",
    "originLink": "https://annas-blog.org/worldcat-scrape.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37764088",
    "commentBody": "",
    "originSummary": [
      "தரவு அறிவியல் மினி போட்டியை நடத்த அண்ணாவின் காப்பகம் வேர்ல்ட்கேட் நூலக மெட்டாடேட்டா சேகரிப்பிலிருந்து தரவைப் பிரித்தெடுத்துள்ளது.",
      "பிரித்தெடுக்கப்பட்ட தரவுத்தொகுப்பு 1.8 பில்லியன் பதிவுகளைக் கொண்டுள்ளது, மேலும் நிறுவனம் போட்டிக்கான சமர்ப்பிப்புகளை வரவேற்கிறது.",
      "தன்னார்வலர்கள் இந்த தரவை பகுப்பாய்வு செய்யவும், புத்தக பாதுகாப்பில் பங்கேற்கவும், அவர்களின் முன்முயற்சிகளுக்கு பங்களிக்கவும் அழைப்பு விடுக்கப்பட்டுள்ளது."
    ],
    "commentSummary": [
      "இந்த கட்டுரை டியூவி தசம அமைப்பு மற்றும் வேர்ல்ட்கேட் தரவுத்தளத்தில் ஓ.சி.எல்.சியின் ஏகபோகத்தை ஆராய்கிறது, பொது அணுகலை பராமரிக்கும் போது நிலையான நிதியின் அவசியத்தை வலியுறுத்துகிறது.",
      "இது டியூவி தசம முறை குறித்த பதிப்புரிமை கவலைகளைக் குறிப்பிடுகிறது மற்றும் மாற்று வழிகளை பரிசீலிக்க பரிந்துரைக்கிறது.",
      "துல்லியமான மற்றும் விரிவான புத்தக மெட்டாடேட்டாவை அறுவடை செய்வதன் முக்கியத்துவத்தையும் சவால்களையும் அடிக்கோடிட்டுக் காட்டி, அண்ணாவின் காப்பகம் ஒ.சி.எல்.சியின் தரவுத்தளத்தை நீக்கிய ஒரு நிகழ்வையும் இந்த கட்டுரை மேலும் எடுத்துக்காட்டுகிறது. துல்லியமான ஐ.எஸ்.பி.என் மெட்டாடேட்டாவை அணுகுவதில் உள்ள விரக்திகளுக்கு மத்தியில் கூடுதல் மதிப்புமிக்க தரவுத்தொகுப்புகளுக்கான சாத்தியமான வாய்ப்புகளை இந்த கட்டுரை சுட்டிக்காட்டுகிறது."
    ],
    "points": 228,
    "commentCount": 69,
    "retryCount": 0,
    "time": 1696422178
  },
  {
    "id": 37765158,
    "title": "கீஸ்ட்ரோக் டைமிங் குழப்பத்துடன் ஓபன்எஸ்எஸ்எச் 9.5 வெளியிடப்பட்டது",
    "originLink": "https://lwn.net/Articles/946497/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37765158",
    "commentBody": "",
    "originSummary": [
      "ஓபன்எஸ்எஸ்எச் 9.5 பிங் மெக்கானிசம் மற்றும் கீஸ்ட்ரோக் டைமிங் கவர்-அப் போன்ற புதிய அம்சங்களை அறிமுகப்படுத்தியுள்ளது, இருப்பினும் எம்பிடிசிபி ஆதரவை இழக்கிறது.",
      "எம்.பி.டி.சி.பி மற்றும் AF_VSOCK போன்ற அம்சங்களை இணைக்க ஓபன் எஸ்.எஸ்.எச் பற்றி தொடர்ந்து உரையாடல் நடந்து வருகிறது.",
      "புதிய நெட்வொர்க்கிங் நெறிமுறைகளைப் பயன்படுத்தும்போது உள்ள தடைகளுடன், லினக்ஸ் மற்றும் பி.எஸ்.டி கர்னல்களுக்குள் சில அம்சங்களை எடுத்துக்கொள்வதையும் உரையாடல்கள் உள்ளடக்குகின்றன."
    ],
    "commentSummary": [
      "ஓபன்எஸ்எஸ்எச் பதிப்பு 9.5 அறிமுகப்படுத்தப்பட்டுள்ளது, இதில் கீஸ்ட்ரோக் டைமிங் மற்றும் ஆர்எஸ்ஏவிலிருந்து எட் 25519 விசை தலைமுறைக்கு மாறுதல் ஆகியவை அடங்கும், இது பாதுகாப்பு மற்றும் ஸ்திரத்தன்மையை மேம்படுத்துகிறது.",
      "அஸூர் தற்போது Ed25519 விசைகளை ஆதரிக்கவில்லை, இது சாத்தியமான பொருந்தக்கூடிய சிக்கல்களுக்கு வழிவகுக்கிறது.",
      "இந்த வெளியீடு கிரிப்டோகிராபி மற்றும் காப்புரிமைகளில் ஈடுபட்டுள்ள ஒரு தொழில்நுட்ப நிறுவனமான ராம்பஸ் பற்றிய விவாதங்களையும், எட் 448 கிரிப்டோகிராஃபிக் வழிமுறையின் நன்மைகள் மற்றும் தீமைகள் மற்றும் எஸ்.எஸ்.எச் இல் சிறிய, வேகமான விசைகளுக்கான விருப்பம் குறித்த விவாதங்களையும் தூண்டியுள்ளது."
    ],
    "points": 220,
    "commentCount": 54,
    "retryCount": 0,
    "time": 1696427409
  },
  {
    "id": 37766711,
    "title": "அமெரிக்க உளவு அமைப்புகள் தங்கள் மிகவும் வெட்கக்கேடான சோதனைகளை எவ்வாறு மறைத்தன",
    "originLink": "https://lithub.com/how-us-intelligence-agencies-hid-their-most-shameful-experiments/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37766711",
    "commentBody": "",
    "originSummary": [
      "சி.ஐ.ஏ.வின் மனக் கட்டுப்பாட்டு சோதனைகள் உட்பட அமெரிக்க உளவு அமைப்புகளால் நடத்தப்பட்ட இரகசிய அறிவியலில் நெறிமுறை கவலைகள் மற்றும் பொறுப்புக்கூறல் இல்லாமை ஆகியவற்றை இந்த கட்டுரை ஆராய்கிறது.",
      "இது மேம்பட்ட விசாரணை நுட்பங்களுடன் சிஐஏவின் அதிகாரத் தேடலைத் தொடுகிறது மற்றும் இந்த சோதனைகளின் நெறிமுறை சிக்கல்கள் மற்றும் கேள்விக்குரிய செயல்திறனை சுட்டிக்காட்டுகிறது.",
      "கொலம்பியா பல்கலைக்கழகத்தில் என்.எஸ்.எஃப் நிதியளிக்கும் திட்டமான ஹிஸ்டரி லேப்பில் உள்ள முதன்மை ஆய்வாளரின் முயற்சிகளை இந்த கட்டுரை அங்கீகரிக்கிறது, இது பொது பதிவுகளை பராமரிக்க தரவு அறிவியலைப் பயன்படுத்துகிறது."
    ],
    "commentSummary": [
      "இந்த கட்டுரை சி.ஐ.ஏ.வின் திட்டமான எம்.கே.எல்ட்ரா போன்ற அமெரிக்க உளவு அமைப்புகளால் மேற்கொள்ளப்பட்ட சர்ச்சைக்குரிய மற்றும் மறைக்கப்பட்ட சோதனைகளைப் பற்றி விவாதிக்கிறது மற்றும் ஆலன் டூரிங்கின் கட்டுரையில் குறிப்பிடப்பட்ட சில ஈ.எஸ்.பி பரிசோதனைகளைக் குறிப்பிடுகிறது.",
      "உளவுத்துறை நிறுவனங்களில் வெளிப்படைத்தன்மை, மேற்பார்வை மற்றும் பொறுப்புக்கூறல் ஆகியவற்றின் அவசியத்தை இது எடுத்துக்காட்டுகிறது, விசில் அடிப்பது பெரும்பாலும் குறிப்பிடத்தக்க கட்டமைப்பு மாற்றங்களை ஏற்படுத்தத் தவறுகிறது என்பதை வலியுறுத்துகிறது.",
      "தரவு சேகரிப்பில் அமெரிக்க உளவுத்துறை சமூகத்தின் ஆர்வத்தை சீன அரசாங்கத்துடன் ஒப்பிட்டு, பல்வேறு சதி கோட்பாடுகள், ஊழல் குற்றச்சாட்டுகள் மற்றும் புவிசார் அரசியல் நிகழ்வுகளை ஆராய்ந்து, சில நடவடிக்கைகளின் பின்னணியில் உள்ள உள்நோக்கங்களைப் புரிந்து கொள்கிறது."
    ],
    "points": 210,
    "commentCount": 170,
    "retryCount": 0,
    "time": 1696433779
  },
  {
    "id": 37767205,
    "title": "\"உங்களுக்கு இங்கே 27% 'ஏஐ' பிரச்சினை உள்ளது\"",
    "originLink": "https://twitter.com/rustykitty_/status/1709316764868153537",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37767205",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "ட்விட்டர் விவாதம் கல்வி, ஆட்டோமேஷன், திருட்டு மற்றும் மதிப்பீட்டில் செயற்கை நுண்ணறிவைப் பயன்படுத்துதல் போன்ற தலைப்புகளைச் சுற்றி சுழல்கிறது, இது பல்வேறு தொழில்களில் மனித தொடர்பு குறைவது குறித்த கவலைகளை எடுத்துக்காட்டுகிறது.",
      "பங்கேற்பாளர்கள் தற்போதைய மதிப்பீட்டு முறைகளின் செயல்திறன் மற்றும் செயற்கை நுண்ணறிவில் அதிகப்படியான நம்பகத்தன்மையின் சாத்தியமான விளைவுகள் குறித்து கேள்வி எழுப்புகின்றனர். வீட்டுப்பாடத்தின் பயன்பாடு, தனிப்பட்ட விரிவுரைகளின் மதிப்பு மற்றும் மாற்று மதிப்பீட்டு நுட்பங்களை செயல்படுத்துவதில் உள்ள சிரமங்கள் குறித்து ஒரு விவாதம் உள்ளது.",
      "செயற்கை நுண்ணறிவுத் திருட்டு கண்டறியும் கருவிகளின் சாத்தியமான துஷ்பிரயோகம், கல்வியில் மோசடியின் விளைவுகள் மற்றும் கல்வியில் செயற்கை நுண்ணறிவு ஒருங்கிணைப்பின் காரணமாக கற்றல் தரம் குறைவது குறித்து பிரச்சினைகள் எழுப்பப்படுகின்றன."
    ],
    "points": 205,
    "commentCount": 231,
    "retryCount": 0,
    "time": 1696435601
  },
  {
    "id": 37770523,
    "title": "1.1.1.1 அக்டோபர் 2023 அன்று தேடல் தோல்விகள்",
    "originLink": "https://blog.cloudflare.com/1-1-1-1-lookup-failures-on-october-4th-2023/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37770523",
    "commentBody": "",
    "originSummary": [
      "அக்டோபர் 4, 2023 அன்று, கிளவுட்ஃப்ளேர் ஒரு உள் மென்பொருள் பிழை காரணமாக டிஎன்எஸ் (டொமைன் பெயர் அமைப்பு) தீர்வு சிக்கல்களை எதிர்கொண்டது, இது SERVFAIL DNS பதில்களுக்கு வழிவகுத்தது மற்றும் புதிய ரூட் மண்டல பதிப்புகளைப் பயன்படுத்துவதைத் தடுத்தது.",
      "சரிபார்ப்பு பிழைகளுக்கு வழிவகுத்த சிக்கல், பழைய வேர் மண்டல கோப்பின் பயன்பாட்டை நிறுத்துவதன் மூலம் சரிசெய்யப்பட்டது.",
      "எதிர்காலத்தில் இதுபோன்ற நிகழ்வுகளைத் தவிர்ப்பதற்கான நடவடிக்கைகளை கிளவுட்ஃப்ளேர் திட்டமிட்டுள்ளது, இதில் அவற்றின் கண்காணிப்பு மற்றும் சோதனை நடைமுறைகளை மேம்படுத்துவது அடங்கும்."
    ],
    "commentSummary": [
      "அக்டோபர் 4, 2023 அன்று, டி.என்.எஸ்.எஸ்.இ.சி கையொப்பம் காலாவதியானதால் கிளவுட்ஃப்ளேர் செயலிழப்பை எதிர்கொண்டது, இதனால் பயனர்களுக்கு இணைய இணைப்பு சிக்கல்கள் ஏற்பட்டன.",
      "பயனர்கள் எச்சரிக்கைகள் இல்லாதது குறித்து கவலை தெரிவித்துள்ளனர் மற்றும் கண்காணிப்பு நடைமுறைகளில் மேம்பாடுகளை அறிவுறுத்தியுள்ளனர்.",
      "இணைய உள்கட்டமைப்பில் கிளவுட்ஃப்ளேரின் ஆதிக்கம் மற்றும் செல்வாக்கு குறித்த விமர்சனங்கள் இருந்தபோதிலும், ஆதரவாளர்கள் இது மதிப்புமிக்க தீர்வுகளை வழங்குகிறது மற்றும் சந்தையில் திறம்பட அளவிட முடிந்தது என்று கூறுகின்றனர்."
    ],
    "points": 192,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1696448481
  },
  {
    "id": 37763143,
    "title": "1.1.1.1 பொதுத் தீர்வு மற்றும் WARP உடனான சிக்கல்கள்",
    "originLink": "https://www.cloudflarestatus.com/incidents/j3h00yhjyw6p",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37763143",
    "commentBody": "",
    "originSummary": [
      "கிளவுட்ஃப்ளேர் தங்கள் 1.1.1.1 பொது தீர்வு மற்றும் வார்ப் சேவைகளில் டிஎன்எஸ் தீர்வு சிக்கல்களைப் புகாரளித்தது, இது பயனர்களுக்கு பல்வேறு சிக்கல்களுக்கு வழிவகுத்தது.",
      "அவர்கள் இந்த சிக்கலை கண்டறிந்து அதை சரிசெய்யும் பணியில் ஈடுபட்டுள்ளனர், சில தாக்கங்கள் இன்னும் தொடர்கின்றன.",
      "அதே நேரத்தில், கிளவுட்ஃப்ளேர் பேஜஸ் பில்டிங் தோல்விகளில் அதிகரிப்பைக் காண்கிறது. அவர்கள் சரிசெய்தலின் விளைவுகளை உன்னிப்பாகக் கண்காணித்து வருகின்றனர்."
    ],
    "commentSummary": [
      "பொருந்தாத டி.என்.எஸ் நீட்டிப்பு ஆதரவு காரணமாக கிளவுட்ஃப்ளேரின் பொது தீர்வு (1.1.1.1) மற்றும் வார்ப் சேவை archive.is இணைப்புகளுடன் சவால்களை எதிர்கொள்கின்றன. Archive.is வேண்டுமென்றே கிளவுட்ஃப்ளேரின் தீர்வுகளுக்கு தவறான முடிவுகளைத் திருப்பித் தருவதாகத் தெரிகிறது, ஒருவேளை பாதுகாப்பு கவலைகள் காரணமாக இருக்கலாம்.",
      "இந்த பிரச்சினைகளுக்கு தீர்வு காண கிளவுட்ஃப்ளேர் ஒரு மாற்று தீர்வை உருவாக்கி வருகிறது. இந்த நிலைமை DNS பாதுகாப்பு மற்றும் தனியுரிமை பற்றிய பரந்த உரையாடலுக்கு வழிவகுத்துள்ளது, இதில் DNS-over-HTTPS (DOH) அமலாக்கம் அடங்கும்.",
      "பெற்றோர் கட்டுப்பாடு மற்றும் விளம்பரத் தடுப்பு அம்சங்களை வழங்குவதில் டி.என்.எஸ் தீர்வுகளின் பங்கு, தரவு தக்கவைப்பு கொள்கைகள், மாற்று டி.என்.எஸ் தீர்வு சேவைகளின் பயன்பாடு மற்றும் டி.என்.எஸ் சேவையகங்களில் பணிநீக்கத்திற்கான முக்கியமான தேவை ஆகியவை விவாதத்தின் பிற அம்சங்களில் அடங்கும்."
    ],
    "points": 180,
    "commentCount": 112,
    "retryCount": 0,
    "time": 1696415123
  }
]
