[
  {
    "id": 37187837,
    "title": "Amsterdam użyje \"kamer hałasu\" przeciwko zbyt głośnym samochodom",
    "originLink": "https://nltimes.nl/2023/08/11/amsterdam-use-noise-cameras-loud-cars",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37187837",
    "commentBody": "",
    "originSummary": [
      "Amsterdam wdrożył \"kamery hałasu\", aby rozwiązać problem hałaśliwych pojazdów w mieście.",
      "Elektryczne znaki drogowe zostały umieszczone, aby ostrzegać kierowców, jeśli ich pojazdy są zbyt głośne, a znaki te zostaną później zastąpione kamerami hałasu, które automatycznie będą nakładać mandaty na kierowców naruszających przepisy.",
      "Znaki hałasu będą początkowo testowane w dwóch lokalizacjach, z planami zainstalowania większej liczby mierników dźwięku i znaków w ciągu miesiąca. Inicjatywa ta ma na celu zminimalizowanie zakłóceń związanych z hałasem w mieście. Rotterdam współpracuje również z Amsterdamem przy podobnym eksperymencie."
    ],
    "commentSummary": [
      "Amsterdam planuje wykorzystać \"kamery hałasu\" do rozwiązania problemu nadmiernego hałasu powodowanego przez samochody i motocykle w mieście.",
      "Debata wokół tej kwestii koncentruje się na konieczności i wpływie głośnych motocykli, przy czym niektórzy argumentują za ich korzyściami dla bezpieczeństwa, a inni krytykują ich irytację.",
      "Istnieje również szersza dyskusja na temat zanieczyszczenia hałasem, zachowania pieszych, modyfikacji pojazdów oraz promowania cichszych i elektrycznych alternatyw.",
      "Mieszkańcy opowiadają się za zakazem pojazdów napędzanych gazem i promowaniem motorowerów elektrycznych, aby stworzyć cichsze środowisko miejskie."
    ],
    "points": 461,
    "commentCount": 366,
    "retryCount": 0,
    "time": 1692446161
  },
  {
    "id": 37192858,
    "title": "Jak płacić za parkowanie?",
    "originLink": "https://cohost.org/cathoderaydude/post/2521077-hahaha-we-live-in-he",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37192858",
    "commentBody": "",
    "originSummary": [
      "Autor dzieli się frustrującym doświadczeniem pomagania starszej kobiecie z aplikacjami parkingowymi i podkreśla wyzwania i ograniczenia systemu.",
      "Użytkownicy w rozmowie wyrażają obawy dotyczące złożoności aplikacji parkingowych, polegania na smartfonach i potencjalnych konsekwencji finansowych.",
      "Przedstawiono sugestie dotyczące ujednoliconej aplikacji lub całkowitego wyeliminowania potrzeby korzystania z aplikacji parkingowych, a także wspomniano o prywatyzacji i kwestiach związanych z przychodami w miastach. Autor opowiada się za analogowymi opcjami płatności za parkowanie, szczególnie dla osób starszych, i wyraża frustrację złożonymi systemami cyfrowymi oraz brakiem poprawy codziennego życia pomimo postępu technologicznego."
    ],
    "commentSummary": [
      "Uczestnicy wyrażają frustrację z powodu nieuczciwych aplikacji parkingowych, ograniczonych opcji płatności i odhumanizowanej obsługi klienta.",
      "Pojawiają się obawy dotyczące korupcji, przestępczości zorganizowanej oraz prywatności i bezpieczeństwa w branży parkingowej.",
      "Technologia jest postrzegana jako tworząca złożone i niewygodne doświadczenia, a w branży panuje pragnienie prostoty i rozwiązywania problemów."
    ],
    "points": 361,
    "commentCount": 282,
    "retryCount": 0,
    "time": 1692477128
  },
  {
    "id": 37187760,
    "title": "Windy.com: globalna strona pogodowa z filtrami na żywo",
    "originLink": "https://www.windy.com",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37187760",
    "commentBody": "",
    "originSummary": [
      "Tekst wspomina o wielu miastach i lokalizacjach w Stanach Zjednoczonych, Kanadzie, Meksyku i na Kubie.",
      "Zwrócono również uwagę na huragan Hilary zbliżający się do zachodniego wybrzeża."
    ],
    "commentSummary": [
      "Użytkownicy Hacker News dyskutują o funkcjach i dokładności aplikacji pogodowej Windy.com.",
      "Niektórzy użytkownicy chwalą jego dokładność i możliwość porównywania modeli prognozy wiatru.",
      "Inni wspominają o obawach związanych z ostatnimi zmianami i problemami z wyświetlaniem na niektórych urządzeniach, a także polecają alternatywne aplikacje pogodowe."
    ],
    "points": 339,
    "commentCount": 127,
    "retryCount": 0,
    "time": 1692445317
  },
  {
    "id": 37190743,
    "title": "Dziennik nawigacji lotniczej na drukarce paragonów 20 USD",
    "originLink": "https://carloslagoa.com/blog/flipreps/flipreps.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37190743",
    "commentBody": "",
    "originSummary": [
      "Carlos dzieli się swoimi doświadczeniami ze szkolenia lotniczego i podkreśla trudności związane z zarządzaniem informacjami w małym kokpicie.",
      "Opracował projekt wykorzystujący drukarkę paragonów do tworzenia dziennika nawigacyjnego, który poprawia wrażenia z lotu.",
      "Carlos wyraża swój entuzjazm dla technologii i zamiar dalszego rozwijania projektu w przyszłości."
    ],
    "commentSummary": [
      "Drukarka paragonowa za 20 USD jest używana do rejestrowania nawigacji lotniczej, ale użytkownicy obawiają się, że papier stanie się nieczytelny z powodu ciepła i obecności BPA w papierze termicznym.",
      "W artykule omówiono różne systemy i instrumenty nawigacyjne wykorzystywane w różnych działaniach, podkreślając postęp technologiczny i ograniczenia niektórych metod.",
      "Autor dzieli się swoim projektem wykorzystania drukarki paragonów do logów nawigacyjnych i zaleca dokonywanie zakupów lokalnie lub zwracanie się do firm o udostępnienie drukarek. Inni czytelnicy również wykazują zainteresowanie wykorzystaniem drukarek paragonów do różnych celów."
    ],
    "points": 328,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1692464252
  },
  {
    "id": 37188015,
    "title": "Dlaczego stare książki tak ładnie pachną?",
    "originLink": "https://scienceswitch.com/2023/08/19/why-do-old-books-smell-so-good/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37188015",
    "commentBody": "",
    "originSummary": [
      "Naukowcy badają wyraźny zapach starych książek i wykorzystują uwalniane lotne związki organiczne (VOC) do określenia ich wieku, stanu i historii.",
      "Zapach starych książek jest spowodowany rozkładem papieru i innych związków organicznych, uwalniając specyficzne związki, takie jak benzaldehyd, wanilina, etylobenzen i 2-etyloheksanol.",
      "Analiza VOC może pomóc bibliotekarzom i historykom zidentyfikować potrzeby w zakresie ochrony i dopasować osierocone książki do ich oryginalnych bibliotek."
    ],
    "commentSummary": [
      "Dyskusja Hacker News porusza różne tematy, w tym zapach starych książek, nostalgię związaną z technologią, postęp technologiczny, obawy o zdrowie i trwającą debatę między fizycznymi książkami a ebookami.",
      "Jest krótka wzmianka o koncepcji cyfrowego nosa i możliwości syntezy zapachów."
    ],
    "points": 299,
    "commentCount": 207,
    "retryCount": 0,
    "time": 1692447688
  },
  {
    "id": 37187663,
    "title": "Stabilna dyfuzja w C/C++",
    "originLink": "https://github.com/leejet/stable-diffusion.cpp",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37187663",
    "commentBody": "",
    "originSummary": [
      "To repozytorium zawiera implementację C/C++ Stable Diffusion, techniki generowania obrazów.",
      "Oferuje wsparcie dla różnych dokładności, kwantyzacji i platform.",
      "Repozytorium zawiera instrukcje dotyczące pobierania wag, budowania i uruchamiania kodu, a także informacje o wymaganiach dotyczących pamięci i dysku."
    ],
    "commentSummary": [
      "Dyskusja analizuje wydajność, przydatność i ograniczenia Stable Diffusion (SD), GGML, AITemplate i Tinygrad na różnych platformach sprzętowych.",
      "Podkreślono wyzwania związane z mnożeniem macierzy w GGML oraz złożoność zarządzania zależnościami i środowiskami w uczeniu maszynowym.",
      "Przeanalizowano korzyści i ograniczenia związane z używaniem C++ i Rust jako języków programowania do optymalizacji, a także osobiste doświadczenia i zalecenia dotyczące poprawy wydajności."
    ],
    "points": 285,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1692444403
  },
  {
    "id": 37188659,
    "title": "Rivet - Zarządzanie serwerami gier open-source za pomocą Nomad i Rust",
    "originLink": "https://github.com/rivet-gg/rivet",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37188659",
    "commentBody": "",
    "originSummary": [
      "Rivet to narzędzie do zarządzania serwerami gier o otwartym kodzie źródłowym, zaprojektowane w celu uproszczenia wdrażania serwerów dedykowanych dla twórców gier bez doświadczenia w zakresie infrastruktury.",
      "Jest zbudowany głównie przy użyciu Rust i Lua, z integracją innych narzędzi i bibliotek.",
      "Rivet obsługuje różne funkcje, takie jak proxy brzegowe, buforowanie, analityka, sieci nakładkowe i skrypty Redis Lua.",
      "Jest on dostępny na licencji Apache 2.0 i ma być przystępnym i wszechstronnym menedżerem serwerów gier.",
      "Rivet nie obsługuje logiki sieciowej, ale działa w połączeniu z istniejącymi narzędziami.",
      "Jest w zamkniętej wersji beta od stycznia 2022 roku i obsługuje miliony aktywnych użytkowników miesięcznie w wielu tytułach."
    ],
    "commentSummary": [
      "Dyskusja koncentruje się na wyzwaniach związanych z infrastrukturą do tworzenia gier i zaletach narzędzi open source.",
      "Rivet, narzędzie do zarządzania serwerami gier o otwartym kodzie źródłowym, jest wysoko cenione za swoją zdolność do wydajnego wdrażania serwerów dedykowanych.",
      "W rozmowie omówiono również zalety i wady korzystania z Kubernetes i Nomad do tworzenia gier, a jeden z deweloperów wyraził zainteresowanie wykorzystaniem Rivet we własnej grze.",
      "Zespół Rivet uznaje potrzebę ulepszeń w rozwoju lokalnym i omawia takie tematy, jak funkcje open source, Nakama, zmiany licencji HashiCorp i wsparcie Bevy."
    ],
    "points": 283,
    "commentCount": 35,
    "retryCount": 0,
    "time": 1692452302
  },
  {
    "id": 37192710,
    "title": "Clone-a-Lisa",
    "originLink": "https://vole.wtf/clone-a-lisa/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37192710",
    "commentBody": "",
    "originSummary": [
      "Clone-a Lisa to gra, w której gracze ścigają się z czasem, aby namalować replikę Mona Lisy w zaledwie 60 sekund.",
      "Gra jest dostępna na stronie VOLE.wtf i zawiera efekty dźwiękowe zwiększające immersję.",
      "Oferuje zabawne i wymagające doświadczenie, które wystawia na próbę umiejętności malarskie graczy w ograniczonym czasie."
    ],
    "commentSummary": [
      "\"Clone-a-Lisa\" to wciągająca gra, której zadaniem jest stworzenie repliki słynnego obrazu Mona Lisy.",
      "Gra wykorzystuje ograniczoną paletę kolorów i ocenia użytkownika na podstawie odchyleń od oryginalnej grafiki, z naciskiem na ciemniejsze obszary.",
      "Gracze odkryli alternatywne strategie, takie jak wypełnianie płótna jednolitym kolorem, aby osiągnąć wysokie wyniki. Gra oferuje również funkcje przeglądania i porównywania obrazów oraz dzielenia się opiniami z innymi graczami."
    ],
    "points": 279,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1692476159
  },
  {
    "id": 37194272,
    "title": "Cellebrite prosi policjantów o zachowanie w tajemnicy swojej technologii",
    "originLink": "https://techcrunch.com/2023/08/19/cellebrite-asks-cops-to-keep-its-phone-hacking-tech-hush-hush/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37194272",
    "commentBody": "",
    "originSummary": [
      "Firma Cellebrite, zajmująca się technologią hakowania telefonów, zwraca się do organów ścigania z prośbą o zachowanie w tajemnicy jej technologii, co budzi obawy o przejrzystość i prawa oskarżonych.",
      "Krytycy twierdzą, że ujawnienie jest ważne dla oceny dowodów i ochrony prywatności.",
      "Rządowy wykonawca Harris Corporation złożył podobne wnioski o zachowanie tajemnicy w odniesieniu do swojego narzędzia do inwigilacji telefonów komórkowych."
    ],
    "commentSummary": [
      "Uczestnicy dyskusji wyrażają obawy dotyczące niezawodności i potencjalnego niewłaściwego wykorzystania Cellebrite, oprogramowania używanego przez organy ścigania do wydobywania danych ze smartfonów.",
      "Ważność niektórych technik kryminalistycznych i stosowanie testów poligraficznych są kwestionowane, wykazując sceptycyzm wobec ich skuteczności.",
      "W rozmowie podkreślono wyzwania związane z zapewnieniem bezpieczeństwa danych, prawne implikacje pozyskiwania dowodów za pośrednictwem Cellebrite oraz odniesiono się do kontrowersji między Apple a FBI, podnosząc obawy dotyczące bezpieczeństwa urządzeń i ochrony danych."
    ],
    "points": 250,
    "commentCount": 165,
    "retryCount": 0,
    "time": 1692486557
  },
  {
    "id": 37188736,
    "title": "WD odmówiło odpowiedzi na nasze pytania dotyczące samowycierających się dysków SSD SanDisk",
    "originLink": "https://www.theverge.com/23837513/western-digital-sandisk-ssd-corrupted-deleted-questions",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37188736",
    "commentBody": "",
    "originSummary": [
      "Dyski SSD SanDisk firmy Western Digital podobno powodują utratę danych, a firma nie odpowiada na zapytania dotyczące tego problemu.",
      "Pojawiło się wiele doniesień o utracie danych, w tym od pracowników The Verge i Ars Technica.",
      "Western Digital kontynuuje sprzedaż dysków SSD pomimo świadomości problemu, a szef działu PR firmy odmówił zajęcia się sprawą.",
      "Pojawiły się zarzuty, że Western Digital wykorzystuje fałszywe recenzje Amazon i manipuluje wynikami wyszukiwania, aby bagatelizować awarie.",
      "Firma stoi obecnie w obliczu wielu pozwów zbiorowych w związku z awariami dysków SSD SanDisk.",
      "Firma Western Digital została również oskarżona o oszukańcze praktyki, takie jak próba włączenia dysków o niższej jakości do swojej oferty produktów i wywoływanie niepotrzebnych ostrzeżeń na dyskach NAS."
    ],
    "commentSummary": [
      "Na forach internetowych toczą się dyskusje na temat niezawodności i jakości rozwiązań pamięci masowej, takich jak dyski SSD i HDD, a użytkownicy dzielą się swoimi doświadczeniami i obawami dotyczącymi różnych marek i modeli.",
      "Problemy z oprogramowaniem układowym i roszczenia gwarancyjne to jedne z omawianych tematów, podkreślające znaczenie niezawodnej i wydajnej obsługi klienta w branży technologicznej.",
      "Marki takie jak Western Digital i SanDisk są narażone na utratę reputacji z powodu skarg klientów i pozwów zbiorowych, co skłania użytkowników do poszukiwania alternatywnych marek, takich jak SK Hynix i Samsung, znanych ze swojej niezawodności."
    ],
    "points": 239,
    "commentCount": 176,
    "retryCount": 0,
    "time": 1692452777
  }
]
