[
  {
    "id": 37187837,
    "title": "암스테르담, 너무 시끄러운 자동차에 '소음 카메라'를 사용하다",
    "originLink": "https://nltimes.nl/2023/08/11/amsterdam-use-noise-cameras-loud-cars",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37187837",
    "commentBody": "",
    "originSummary": [
      "암스테르담은 도시 내 시끄러운 차량 문제를 해결하기 위해 '소음 카메라'를 도입했습니다.",
      "차량 소음이 너무 크면 운전자에게 경고하는 전기 도로 표지판이 설치되었으며, 이 표지판은 나중에 소음 카메라로 대체되어 위반 운전자에게 자동으로 벌금을 부과할 예정입니다.",
      "소음 표지판은 우선 두 곳에서 테스트되며, 한 달 동안 더 많은 소음 측정기와 표지판을 설치할 계획입니다. 이 이니셔티브는 도시의 소음 방해를 최소화하는 것을 목표로 합니다. 로테르담도 암스테르담과 협력하여 비슷한 실험을 진행하고 있습니다."
    ],
    "commentSummary": [
      "암스테르담은 도시 내 자동차와 오토바이의 과도한 소음 문제를 해결하기 위해 '소음 카메라'를 사용할 계획입니다.",
      "이 문제를 둘러싼 논쟁은 시끄러운 오토바이의 필요성과 영향에 초점을 맞추고 있으며, 일부는 안전에 도움이 된다고 주장하고 다른 일부는 성가시다고 비판합니다.",
      "또한 소음 공해, 보행자 행동, 차량 개조, 더 조용하고 전기적인 대안에 대한 홍보에 대한 광범위한 논의가 이루어지고 있습니다.",
      "주민들은 더 조용한 도시 환경을 조성하기 위해 가스 구동 차량의 사용을 금지하고 전기 오토바이를 장려해야 한다고 주장하고 있습니다."
    ],
    "points": 461,
    "commentCount": 366,
    "retryCount": 0,
    "time": 1692446161
  },
  {
    "id": 37192858,
    "title": "주차 요금은 어떻게 결제하나요?",
    "originLink": "https://cohost.org/cathoderaydude/post/2521077-hahaha-we-live-in-he",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37192858",
    "commentBody": "",
    "originSummary": [
      "저자는 한 노인의 주차 앱을 도와주면서 겪은 좌절스러운 경험을 공유하며 시스템의 문제점과 한계를 강조합니다.",
      "대화에 참여한 사용자들은 주차 앱의 복잡성, 스마트폰 의존도, 잠재적인 금전적 영향에 대해 우려를 표명합니다.",
      "통합 앱 또는 주차 앱의 필요성을 완전히 없애자는 제안과 함께 도시의 민영화 및 수익 문제가 언급됩니다. 저자는 특히 노년층을 위한 아날로그 방식의 주차 결제 방식을 옹호하며, 복잡한 디지털 시스템과 기술 발전에도 불구하고 일상 생활이 개선되지 않는 것에 대한 불만을 표출합니다."
    ],
    "commentSummary": [
      "참가자들은 사기성 주차 앱, 제한된 결제 옵션, 비인간적인 고객 서비스에 대한 불만을 표출합니다.",
      "주차 업계의 부패, 조직 범죄, 개인정보 보호 및 보안에 대한 우려가 제기되고 있습니다.",
      "기술은 복잡하고 불편한 경험을 만들어내는 것으로 여겨지며, 업계에서는 단순성과 문제 해결에 대한 열망이 있습니다."
    ],
    "points": 361,
    "commentCount": 282,
    "retryCount": 0,
    "time": 1692477128
  },
  {
    "id": 37187760,
    "title": "Windy.com: 실시간 필터가 있는 글로벌 날씨 웹사이트",
    "originLink": "https://www.windy.com",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37187760",
    "commentBody": "",
    "originSummary": [
      "이 텍스트에는 미국, 캐나다, 멕시코, 쿠바의 여러 도시와 위치가 언급되어 있습니다.",
      "또한 허리케인 힐러리가 서해안으로 접근하고 있음을 강조합니다."
    ],
    "commentSummary": [
      "Hacker News의 사용자들이 날씨 앱 Windy.com의 기능과 정확성에 대해 논의하고 있습니다.",
      "일부 사용자는 정확도와 바람 예보 모델을 비교할 수 있는 기능에 대해 칭찬을 아끼지 않습니다.",
      "다른 사용자들은 최근 변경 사항과 특정 디바이스의 디스플레이 문제에 대한 우려를 언급하고 대체 날씨 앱을 추천하기도 합니다."
    ],
    "points": 339,
    "commentCount": 127,
    "retryCount": 0,
    "time": 1692445317
  },
  {
    "id": 37190743,
    "title": "항공 내비게이션 로그온 $20 영수증 프린터",
    "originLink": "https://carloslagoa.com/blog/flipreps/flipreps.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37190743",
    "commentBody": "",
    "originSummary": [
      "카를로스는 자신의 비행 훈련 경험을 공유하고 좁은 조종석에서 정보를 관리할 때의 어려움을 강조합니다.",
      "그는 영수증 프린터를 사용하여 비행 경험을 개선하는 내비게이션 로그를 만드는 프로젝트를 개발했습니다.",
      "카를로스는 기술에 대한 열정과 앞으로도 프로젝트를 계속 발전시키겠다는 의지를 표명했습니다."
    ],
    "commentSummary": [
      "항공 내비게이션 기록에 20달러짜리 영수증 프린터를 사용하고 있지만, 사용자들은 열과 감열지에 함유된 BPA로 인해 용지를 읽을 수 없게 되는 것에 대해 우려하고 있습니다.",
      "이 기사에서는 다양한 활동에 사용되는 다양한 내비게이션 시스템과 계기에 대해 설명하며, 기술의 발전과 특정 방법의 한계를 강조합니다.",
      "저자는 내비게이션 로그에 영수증 프린터를 사용하는 프로젝트를 공유하며 현지에서 구매하거나 기업에 사용 가능한 프린터를 요청할 것을 권장합니다. 다른 독자들도 영수증 프린터를 다른 용도로 사용하는 데 관심을 보이고 있습니다."
    ],
    "points": 328,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1692464252
  },
  {
    "id": 37188015,
    "title": "오래된 책에서 좋은 냄새가 나는 이유는 무엇인가요?",
    "originLink": "https://scienceswitch.com/2023/08/19/why-do-old-books-smell-so-good/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37188015",
    "commentBody": "",
    "originSummary": [
      "과학자들은 오래된 책에서 나는 독특한 냄새를 연구하고 방출되는 휘발성 유기 화합물(VOC)을 사용하여 책의 나이, 상태 및 역사를 파악하고 있습니다.",
      "오래된 책의 냄새는 종이와 기타 유기 화합물이 분해되어 벤즈알데히드, 바닐린, 에틸벤젠, 2-에틸헥산올과 같은 특정 화합물이 방출되기 때문에 발생합니다.",
      "VOC 분석을 통해 사서와 역사가들은 보존 필요성을 파악하고 고아가 된 책을 원래의 도서관과 연결할 수 있습니다."
    ],
    "commentSummary": [
      "해커 뉴스 토론에서는 오래된 책의 향기, 기술과 관련된 향수, 기술 발전, 건강 문제, 실물 책과 전자책 사이의 지속적인 논쟁 등 다양한 주제를 탐구합니다.",
      "디지털 코의 개념과 냄새를 합성할 수 있는 가능성에 대한 간략한 언급이 있습니다."
    ],
    "points": 299,
    "commentCount": 207,
    "retryCount": 0,
    "time": 1692447688
  },
  {
    "id": 37187663,
    "title": "C/C++에서 안정적인 배포",
    "originLink": "https://github.com/leejet/stable-diffusion.cpp",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37187663",
    "commentBody": "",
    "originSummary": [
      "이 리포지토리에는 이미지 생성 기술인 안정적 확산의 C/C++ 구현이 포함되어 있습니다.",
      "다양한 정밀도, 정량화 및 플랫폼을 지원합니다.",
      "리포지토리에는 가중치 다운로드, 코드 빌드 및 실행에 대한 지침과 메모리 및 디스크 요구 사항에 대한 정보가 포함되어 있습니다."
    ],
    "commentSummary": [
      "이 토론에서는 다양한 하드웨어 플랫폼에서 안정적 확산(SD), GGML, AITemplate 및 Tinygrad의 성능, 적합성 및 한계를 살펴봅니다.",
      "GGML의 행렬 곱셈과 머신 러닝에서 종속성 및 환경 관리의 복잡성에 대한 과제가 강조됩니다.",
      "성능 향상을 위한 개인적인 경험 및 권장 사항과 함께 최적화를 위한 프로그래밍 언어로 C++ 및 Rust를 사용할 때의 장점과 한계를 살펴봅니다."
    ],
    "points": 285,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1692444403
  },
  {
    "id": 37188659,
    "title": "Rivet - Nomad 및 Rust를 사용한 오픈소스 게임 서버 관리",
    "originLink": "https://github.com/rivet-gg/rivet",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37188659",
    "commentBody": "",
    "originSummary": [
      "리벳은 인프라 경험이 없는 게임 개발자를 위해 전용 서버를 간편하게 배포할 수 있도록 설계된 오픈소스 게임 서버 관리 툴입니다.",
      "주로 Rust와 Lua를 사용하여 구축되었으며, 다른 도구와 라이브러리가 통합되어 있습니다.",
      "리벳은 엣지 프록시, 캐싱, 분석, 오버레이 네트워크, Redis Lua 스크립트 등 다양한 기능을 지원합니다.",
      "Apache 2.0에 따라 라이선스가 부여되었으며 접근성이 뛰어나고 포괄적인 게임 서버 관리자를 목표로 합니다.",
      "리벳은 네트워킹 로직을 처리하지는 않지만 기존 도구와 함께 작동합니다.",
      "2022년 1월부터 클로즈 베타 버전이 제공되고 있으며 여러 타이틀에서 수백만 명의 월간 활성 사용자를 지원합니다."
    ],
    "commentSummary": [
      "이 토론에서는 게임 개발 인프라의 과제와 오픈소스 툴의 장점에 대해 집중적으로 논의합니다.",
      "오픈소스 게임 서버 관리 툴인 리벳은 전용 서버를 효율적으로 배포할 수 있는 기능으로 높은 평가를 받고 있습니다.",
      "이 대화에서는 한 개발자가 자신의 게임에 리벳을 활용하고 싶다는 의사를 밝히면서 게임 개발에 Kubernetes와 Nomad를 사용할 때의 장점과 단점에 대해서도 살펴봅니다.",
      "리벳 팀은 로컬 개발 개선의 필요성을 인식하고 오픈소스 기능, 나카마, 해시코프 라이선스 변경, 비비 지원과 같은 주제에 대해 논의합니다."
    ],
    "points": 283,
    "commentCount": 35,
    "retryCount": 0,
    "time": 1692452302
  },
  {
    "id": 37192710,
    "title": "클론-어-리사",
    "originLink": "https://vole.wtf/clone-a-lisa/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37192710",
    "commentBody": "",
    "originSummary": [
      "클론아리사는 60초 안에 모나리자 복제품을 그리는 게임으로, 플레이어가 시간과의 경쟁을 통해 모나리자를 완성합니다.",
      "이 게임은 웹사이트 VOLE.wtf에서 액세스할 수 있으며 몰입감을 높여주는 음향 효과가 포함되어 있습니다.",
      "제한된 시간 내에 플레이어의 그림 실력을 시험하는 재미있고 도전적인 경험을 제공합니다."
    ],
    "commentSummary": [
      "\"Clone-a-Lisa\"는 사용자가 유명한 모나리자 그림의 복제품을 만들어야 하는 매력적인 게임입니다.",
      "이 게임은 제한된 색상 팔레트를 사용하고 어두운 부분을 강조하여 원본 아트웍과의 편차를 기준으로 사용자에게 점수를 매깁니다.",
      "플레이어들은 높은 점수를 얻기 위해 캔버스를 단색으로 채우는 등의 다른 전략을 발견했습니다. 이 게임은 그림을 보고 비교하고 다른 플레이어와 피드백을 공유하는 기능도 제공합니다."
    ],
    "points": 279,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1692476159
  },
  {
    "id": 37194272,
    "title": "셀레브라이트, 경찰에게 기술 비밀 유지를 요청하다",
    "originLink": "https://techcrunch.com/2023/08/19/cellebrite-asks-cops-to-keep-its-phone-hacking-tech-hush-hush/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37194272",
    "commentBody": "",
    "originSummary": [
      "휴대폰 해킹 기술 회사인 셀레브라이트는 법 집행 기관에 기술 사용의 비밀 유지를 요청하며 투명성과 피고인의 권리에 대한 우려를 제기하고 있습니다.",
      "비평가들은 증거를 평가하고 개인 정보를 보호하기 위해 공개가 중요하다고 주장합니다.",
      "정부 계약업체인 해리스 코퍼레이션도 휴대폰 감시 도구와 관련하여 비슷한 비밀 요청을 한 바 있습니다."
    ],
    "commentSummary": [
      "토론 참가자들은 법 집행 기관에서 스마트폰에서 데이터를 추출하는 데 사용하는 소프트웨어인 셀레브라이트의 신뢰성과 오용 가능성에 대한 우려를 제기했습니다.",
      "특정 법의학 기법의 유효성과 거짓말 탐지기 테스트의 사용에 대해 의문을 제기하며 그 효과에 회의적인 시각을 보이고 있습니다.",
      "이 대화에서는 데이터 보안을 보장하는 데 따르는 어려움과 셀레브라이트가 증거를 확보하는 데 미치는 법적 영향을 강조하고, Apple과 FBI의 논쟁을 언급하며 디바이스 보안 및 데이터 보호에 대한 우려를 제기합니다."
    ],
    "points": 250,
    "commentCount": 165,
    "retryCount": 0,
    "time": 1692486557
  },
  {
    "id": 37188736,
    "title": "WD는 자체 삭제하는 SanDisk SSD에 대한 질문에 대한 답변을 거부했습니다.",
    "originLink": "https://www.theverge.com/23837513/western-digital-sandisk-ssd-corrupted-deleted-questions",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37188736",
    "commentBody": "",
    "originSummary": [
      "웨스턴 디지털의 샌디스크 SSD가 데이터 손실을 유발하는 것으로 알려졌으며, 해당 문제에 대한 문의에 응답하지 않고 있습니다.",
      "더 버지(The Verge)와 아르스 테크니카(Ars Technica)의 직원을 포함해 데이터 손실에 대한 여러 보고가 나왔습니다.",
      "웨스턴 디지털은 이 문제를 알고 있음에도 불구하고 해당 SSD를 계속 판매하고 있으며, 회사 홍보 책임자는 이 문제에 대한 언급을 거부하고 있습니다.",
      "웨스턴 디지털이 가짜 아마존 리뷰를 사용하고 검색 결과를 조작하여 장애를 경시하고 있다는 주장이 제기되었습니다.",
      "현재 샌디스크는 샌디스크 SSD 장애와 관련하여 여러 건의 집단 소송에 직면해 있습니다.",
      "Western Digital은 또한 제품 라인업에 수준 이하의 드라이브를 포함시키려고 시도하고 NAS 디스크에 불필요한 경고를 표시하는 등 기만적인 관행으로 비난을 받기도 했습니다."
    ],
    "commentSummary": [
      "온라인 포럼에서는 사용자들이 다양한 브랜드와 모델에 대한 경험과 우려 사항을 공유하면서 SSD 및 HDD와 같은 스토리지 솔루션의 안정성과 품질에 대한 토론을 진행하고 있습니다.",
      "기술 업계에서 안정적이고 효율적인 고객 서비스의 중요성을 강조하며 펌웨어 문제와 보증 클레임이 논의되는 주제 중 하나입니다.",
      "웨스턴 디지털과 샌디스크 같은 브랜드는 고객 불만과 집단 소송으로 인해 평판에 타격을 입었고, 사용자들은 신뢰성이 높은 SK하이닉스나 삼성과 같은 대체 브랜드를 찾게 되었습니다."
    ],
    "points": 239,
    "commentCount": 176,
    "retryCount": 0,
    "time": 1692452777
  }
]
