[
  {
    "id": 41046773,
    "title": "ওপেন সোর্স এআই হলো অগ্রগতির পথ",
    "originLink": "https://about.fb.com/news/2024/07/open-source-ai-is-the-path-forward/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41046773",
    "commentBody": "",
    "originSummary": [
      "ওপেন-সোর্স লিনাক্স তার পরিবর্তনযোগ্যতা, সাশ্রয়ীতা এবং উন্নত বৈশিষ্ট্যগুলির কারণে ক্লাউড কম্পিউটিং এবং মোবাইল ডিভাইসের জন্য শিল্পের মানদণ্ড হয়ে উঠেছে, যা এআই-এর প্রত্যাশিত গতিপথের সাথে সাদৃশ্যপূর্ণ।",
      "মেটা লামা ৩.১ ৪০৫বি, প্রথম সীমান্ত-স্তরের ওপেন-সোর্স এআই মডেল, প্রকাশ করেছে, পাশাপাশি উন্নত ৭০বি এবং ৮বি মডেলও প্রকাশ করেছে, যা উন্নত খরচ/কার্যক্ষমতা এবং ফাইন-টিউনিংয়ের জন্য উপযুক্ততা উপর জোর দেয়।",
      "মেটা অ্যামাজন, ডেটাব্রিক্স, এবং এনভিডিয়া-এর মতো কোম্পানির সাথে সহযোগিতা করে ডেভেলপারদের সমর্থন করার জন্য, উন্মুক্ত-সোর্স এআইকে শিল্পের মানদণ্ডে পরিণত করার লক্ষ্যে, স্বচ্ছতা, নিরাপত্তা এবং অর্থনৈতিক বৃদ্ধিকে প্রচার করে।"
    ],
    "commentSummary": [
      "মেটা লঞ্চ করেছে লামা ৩.১, একটি ওপেন-সোর্স এআই মডেল, যা ৪০৫ বিলিয়ন প্যারামিটার মডেল এবং উন্নত ৭০ বিলিয়ন ও ৮ বিলিয়ন প্যারামিটার মডেল সমন্বিত।",
      "এই প্রকাশনাটি প্রতিদ্বন্দ্বী যেমন OpenAI, Google, এবং Microsoft-এর সাথে প্রতিযোগিতা করার জন্য একটি কৌশলগত পদক্ষেপ হিসাবে বিবেচিত হচ্ছে, যেখানে উন্নত AI মডেলগুলি বিনামূল্যে দেওয়া হচ্ছে, তবে ৭০০ মিলিয়নের বেশি ব্যবহারকারী থাকা কোম্পানিগুলির জন্য কিছু সীমাবদ্ধতা রয়েছে।",
      "সমালোচকরা যুক্তি দেন যে প্রশিক্ষণ ডেটা এবং অবকাঠামোতে প্রবেশাধিকার ছাড়া, এই মডেলগুলি প্রকৃতপক্ষে মুক্ত-উৎসের চেয়ে ফ্রিওয়্যারের মতো বেশি, যা মেটার প্রকৃত উদ্দেশ্য এবং এর বিস্তৃত প্রভাব নিয়ে বিতর্ক উস্কে দেয়।"
    ],
    "points": 767,
    "commentCount": 337,
    "retryCount": 0,
    "time": 1721747321
  },
  {
    "id": 41038552,
    "title": "কাওয়াই – একটি কীচেইন-আকৃতির নিন্টেন্ডো উই",
    "originLink": "https://bitbuilt.net/forums/index.php?threads/kawaii.6474/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41038552",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "থান্ডারভোল্ট প্রকল্পটি একটি নিন্টেন্ডো উই-কে পরিবর্তন করার সাথে জড়িত, যেখানে এর পিসিবি (প্রিন্টেড সার্কিট বোর্ড) কেটে শুধুমাত্র প্রয়োজনীয় উপাদানগুলি যেমন ডিআরএএম (ডাইনামিক র্যান্ডম-অ্যাক্সেস মেমরি) এবং প্রসেসরগুলি রাখা হবে, এবং পাওয়ারের জন্য একটি বাহ্যিক ডিসিডিসি (ডাইরেক্ট কারেন্ট টু ডাইরেক্ট কারেন্ট) বোর্ড যোগ করা হবে।",
      "প্রকল্পটির লক্ষ্য একটি কীচেইন-আকারের উই তৈরি করা, যার নাম 'কাওয়াই,' যা অন্যান্য ক্ষুদ্রায়িত সংস্করণ যেমন জিসি ন্যানোর চেয়ে ছোট, তবে সম্পূর্ণ কার্যকারিতার জন্য এখনও একটি ডকের প্রয়োজন, যার মধ্যে বিদ্যুৎ সরবরাহ এবং কন্ট্রোলার সংযোগ অন্তর্ভুক্ত।",
      "এই প্রকল্পটি রেট্রো গেমিং এবং কনসোলের ক্ষুদ্রাকৃতির প্রতি চলমান আগ্রহ এবং উদ্ভাবনকে তুলে ধরে, যা ক্লাসিক গেমিং হার্ডওয়্যার সংরক্ষণ এবং উন্নত করার জন্য সম্প্রদায়ের উত্সর্গকে প্রদর্শন করে।"
    ],
    "points": 693,
    "commentCount": 209,
    "retryCount": 0,
    "time": 1721675542
  },
  {
    "id": 41039967,
    "title": "টাইমশিফট: লিনাক্সের জন্য সিস্টেম পুনরুদ্ধার সরঞ্জাম",
    "originLink": "https://github.com/linuxmint/timeshift",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41039967",
    "commentBody": "",
    "originSummary": [
      "লিনাক্সের জন্য টাইমশিফট একটি সিস্টেম ব্যাকআপ টুল যা উইন্ডোজ সিস্টেম রিস্টোর এবং ম্যাক ওএস টাইম মেশিনের মতো, যা সিস্টেম ফাইল এবং সেটিংসের উপর কেন্দ্রীভূত।",
      "এটি দুটি মোড সমর্থন করে: RSYNC (rsync এবং হার্ড-লিঙ্ক ব্যবহার করে) এবং BTRFS (BTRFS ফাইলসিস্টেম বৈশিষ্ট্য ব্যবহার করে), যেখানে দ্বিতীয়টির জন্য একটি নির্দিষ্ট সাবভলিউম বিন্যাস প্রয়োজন।",
      "টনি জর্জ দ্বারা উন্নত এবং এখন লিনাক্স মিন্টের Xapp প্রকল্পের অংশ, টাইমশিফট একাধিক স্ন্যাপশট স্তর, ক্রস-ডিস্ট্রিবিউশন পুনরুদ্ধার এবং পোস্ট-রিস্টোর হুকের মতো বৈশিষ্ট্যগুলি অফার করে, বিভিন্ন লিনাক্স ডিস্ট্রিবিউশনের জন্য ইনস্টলেশন নির্দেশাবলী উপলব্ধ।"
    ],
    "commentSummary": [
      "টাইমশিফট একটি সিস্টেম রিস্টোর টুল লিনাক্সের জন্য, যা ম্যাকওএসের টাইম মেশিন এবং উইন্ডোজের সিস্টেম রিস্টোরের মতো, ব্যবহারকারীদের rsync এবং হার্ডলিঙ্ক ব্যবহার করে ফাইলসিস্টেম স্ন্যাপশট তৈরি করতে দেয়।",
      "ব্যবহারকারীরা বিভিন্ন ব্যাকআপ সমাধান এবং কনফিগারেশন নিয়ে আলোচনা করেন, যার মধ্যে রয়েছে রেস্টিক, আরক্লোন, ZFS, BTRFS, এবং LVM স্ন্যাপশট, যেখানে ডাটাবেসের সামঞ্জস্যতা এবং নির্ভরযোগ্য ব্যাকআপের জন্য পারমাণবিক স্ন্যাপশটের গুরুত্ব তুলে ধরা হয়।",
      "আলোচনাটি শক্তিশালী ব্যাকআপ কৌশলের প্রয়োজনীয়তার উপর জোর দেয়, যেমন restic, Borg, এবং kopia এর মতো টুলগুলির তুলনা করে এবং বিভিন্ন ফাইল সিস্টেম এবং স্ন্যাপশট পদ্ধতির সুবিধা এবং অসুবিধা নিয়ে আলোচনা করে।"
    ],
    "points": 319,
    "commentCount": 153,
    "retryCount": 0,
    "time": 1721683382
  },
  {
    "id": 41039708,
    "title": "জুলাই ২০২৪ আপডেট ইনস্ট্যাবিলিটি রিপোর্টসমূহ ইন্টেল কোর ১৩তম/১৪তম জেন ডেস্কটপ সিপিইউ সম্পর্কে",
    "originLink": "https://community.intel.com/t5/Processors/July-2024-Update-on-Instability-Reports-on-Intel-Core-13th-and/m-p/1617113#M74792",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41039708",
    "commentBody": "",
    "originSummary": [
      "ইন্টেল তার ১৩তম এবং ১৪তম প্রজন্মের ডেস্কটপ প্রসেসরগুলিতে অস্থিতিশীলতা সনাক্ত করেছে যা একটি মাইক্রোকোড অ্যালগরিদম থেকে উত্থিত অপারেটিং ভোল্টেজের কারণে ঘটেছে।",
      "এই সমস্যার সমাধানের জন্য একটি মাইক্রোকোড প্যাচ মধ্য আগস্টের মধ্যে আশা করা হচ্ছে, এবং ইন্টেল প্রভাবিত গ্রাহকদের সহায়তার জন্য সমর্থনের সাথে যোগাযোগ করার পরামর্শ দিচ্ছে।",
      "ব্যবহারকারীরা সম্ভাব্য দীর্ঘমেয়াদী CPU ক্ষতি, BIOS আপডেটের প্রয়োজনীয়তা নিয়ে উদ্বেগ প্রকাশ করেছেন এবং প্যাচ প্রকাশ না হওয়া পর্যন্ত অস্থিরতা পরিচালনার জন্য নির্দেশনা চাইতে গিয়ে RMA (রিটার্ন মার্চেন্ডাইজ অথরাইজেশন) সমস্যার রিপোর্ট করেছেন।"
    ],
    "commentSummary": [
      "ইন্টেলের জুলাই ২০২৪ আপডেট নির্দেশ করে যে ১৩তম/১৪তম জেনারেশন ডেস্কটপ সিপিইউতে একটি মাইক্রোকোড সমস্যা রয়েছে যা ভুল ভোল্টেজ অনুরোধ সৃষ্টি করছে, যদিও কিছু ব্যবহারকারী হার্ডওয়্যার ত্রুটি সন্দেহ করছেন।",
      "ইন্টেলের সমস্যা সমাধানে বিলম্ব এবং আপডেটেড মাইক্রোকোড ছাড়াই ত্রুটিমুক্ত সিপিইউ পাঠানোর রিপোর্টের কারণে উদ্বেগ দেখা দিয়েছে, যা দীর্ঘমেয়াদী সিপিইউ অবনতি ঘটাতে পারে।",
      "ইন্টেল একটি মাইক্রোকোড প্যাচ প্রকাশ করার পরিকল্পনা করছে, তবে এর কার্যকারিতা এবং পারফরম্যান্সের উপর প্রভাব অনিশ্চিত, কারণ ব্যবহারকারীরা CPU স্থিতিশীলতা সম্পর্কে মিশ্র অভিজ্ঞতা রিপোর্ট করছেন।"
    ],
    "points": 300,
    "commentCount": 181,
    "retryCount": 0,
    "time": 1721681702
  },
  {
    "id": 41043371,
    "title": "গুগল ক্যালেন্ডারের জন্য ডাটাবেস ডিজাইন: একটি টিউটোরিয়াল",
    "originLink": "https://kb.databasedesignbook.com/posts/google-calendar/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41043371",
    "commentBody": "",
    "originSummary": [
      "অ্যালেক্সি মাখোটকিনের টিউটোরিয়ালটি একটি গুগল ক্যালেন্ডার ক্লোনের জন্য ডাটাবেস টেবিল ডিজাইন করার ব্যাপক নির্দেশিকা প্রদান করে, যা আসন্ন বই “ডাটাবেস ডিজাইন ইউজিং মিনিমাল মডেলিং” এর পদ্ধতি অনুসরণ করে।",
      "এটি যৌক্তিক মডেলটি বিস্তৃতভাবে কভার করে, কীভাবে মৌলিক সারাদিনের ইভেন্ট, সময়-ভিত্তিক ইভেন্ট এবং পুনরাবৃত্ত ইভেন্টগুলি পরিচালনা করতে হয় তা বিশদভাবে বর্ণনা করে, এবং তারপর শারীরিক SQL টেবিল তৈরি করার দিকে অগ্রসর হয়।",
      "এই টিউটোরিয়ালটি ডাটাবেস সম্পর্কে সাধারণ ধারণা থাকা পাঠকদের জন্য তৈরি করা হয়েছে, যা তাদেরকে ধারণাগত ধারণা থেকে সম্পূর্ণ ডাটাবেস টেবিল সংজ্ঞায়িত করতে সাহায্য করে এবং ডিজাইন বাস্তবায়নের জন্য ব্যবহারিক পদক্ষেপগুলি অন্তর্ভুক্ত করে।"
    ],
    "commentSummary": [
      "গুগল ক্যালেন্ডারের ডাটাবেস ডিজাইন নিয়ে একটি আলোচনায় প্রস্তাব করা হয়েছে যে, একটি জটিল স্কিমা তৈরির পরিবর্তে দ্রুত ইভেন্ট স্ক্যানিংয়ের জন্য একটি iCalendar পার্সার অপ্টিমাইজ করা উচিত।",
      "SQL-এর মতো রেঞ্জ সার্চ এবং ব্যবহারকারী-নির্দিষ্ট কুয়েরির প্রয়োজনীয়তা নিয়ে উদ্বেগ প্রকাশ করা হয়েছিল, যা ঐতিহ্যবাহী ডাটাবেসগুলি ভালভাবে পরিচালনা করে।",
      "আলোচনায় সময় অঞ্চল, ডেলাইট সেভিংস এবং পুনরাবৃত্ত ইভেন্টের মতো চ্যালেঞ্জ অন্তর্ভুক্ত ছিল, এবং একটি ঐক্যমত্য ছিল যে সম্পর্ক এবং প্রশ্ন পরিচালনা করার SQL-এর ক্ষমতা এটিকে ক্যালেন্ডার অ্যাপ্লিকেশনের জন্য উপযুক্ত করে তোলে।"
    ],
    "points": 269,
    "commentCount": 76,
    "retryCount": 0,
    "time": 1721718345
  },
  {
    "id": 41040543,
    "title": "ASCII টেবিলের সৌন্দর্য",
    "originLink": "https://danq.me/2024/07/21/ascii/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41040543",
    "commentBody": "",
    "originSummary": [
      "ASCII টেবিল, যা ১৯৬৩ সালে মানক করা হয়েছিল, ১২৮ সম্ভাব্য ৭-বিট বাইনারি কোডপয়েন্টের মধ্যে ১০০টির অর্থ নির্ধারণ করে এবং আজও প্রাসঙ্গিক রয়েছে, বিশেষ করে UTF-8 এনকোডিং ব্যাকওয়ার্ড-কম্প্যাটিবল হওয়ায়।",
      "টেবিলটিতে নিয়ন্ত্রণ কোড, মুদ্রণযোগ্য অক্ষর অন্তর্ভুক্ত রয়েছে এবং নির্দিষ্ট বাইনারি প্যাটার্ন অনুসরণ করে, যেখানে স্পেস ক্যারেক্টারটি বাছাইয়ের উদ্দেশ্যে প্রথম মুদ্রণযোগ্য অক্ষর হিসাবে বিবেচিত হয়।",
      "ASCII-এর নকশা যৌক্তিক এবং নান্দনিকভাবে মনোরম, যা মানুষের জন্য শেখা এবং বোঝা সহজ করে তোলে, এর ঐতিহাসিক গুরুত্ব এবং পরিশীলিত যুক্তিকে প্রতিফলিত করে।"
    ],
    "commentSummary": [
      "পোস্টটি ASCII টেবিলের সৌন্দর্য এবং উপযোগিতা নিয়ে আলোচনা করে, যা কম্পিউটিংয়ে ব্যবহৃত একটি অক্ষর এনকোডিং মান।",
      "এটি উল্লেখ করে যে ব্যবহারকারীরা লিনাক্স সিস্টেমে `man ascii` কমান্ডের মাধ্যমে ASCII টেবিল অ্যাক্সেস করতে পারেন, যা শেল এস্কেপ কোড এবং নিয়মিত এক্সপ্রেশন (regex) এর জন্য উপকারী।",
      "আলোচনাটি বিভিন্ন প্রযুক্তি শেখার সময় ম্যানপেজের মাধ্যমে ঐতিহাসিক প্রেক্ষাপট এবং ব্যক্তিগত অভিজ্ঞতা অন্তর্ভুক্ত করে, যা কম্পিউটিংয়ে ASCII টেবিলের দীর্ঘস্থায়ী প্রাসঙ্গিকতাকে জোর দেয়।"
    ],
    "points": 248,
    "commentCount": 141,
    "retryCount": 0,
    "time": 1721687477
  },
  {
    "id": 41042123,
    "title": "FAANG কোম্পানিগুলোতে কাজ না করেও FAANG-এর মতো বেতন পাওয়া কি সম্ভব?",
    "originLink": "https://news.ycombinator.com/item?id=41042123",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41042123",
    "commentBody": "",
    "originSummary": [
      "FAANG (ফেসবুক, অ্যামাজন, অ্যাপল, নেটফ্লিক্স, গুগল) এবং নন-FAANG কোম্পানির মধ্যে বেতন ব্যবধান উল্লেখযোগ্য, যেখানে FAANG ইঞ্জিনিয়াররা উল্লেখযোগ্যভাবে উচ্চতর ক্ষতিপূরণ প্যাকেজ পান।",
      "একটি সাধারণ স্টার্টআপে একজন স্টাফ ইঞ্জিনিয়ার $250k বেস বেতন এবং ১০-২০% বোনাস উপার্জন করতে পারেন, যেখানে একটি FAANG কোম্পানির স্টাফ ইঞ্জিনিয়ার একই বেস বেতন এবং চার বছরে $১ মিলিয়ন স্টকের মালিক হতে পারেন।",
      "পোস্টটি প্রশ্ন করে যে FAANG এবং বড় ব্যাংক/উচ্চ-ফ্রিকোয়েন্সি ট্রেডিং (HFT) সংস্থার বাইরে থাকা ব্যক্তিরা তুলনামূলক পরিমাণ অর্থ উপার্জন করেন কিনা, এবং তারা কারা এবং তাদের ভূমিকা কী তা সনাক্ত করতে চায়।"
    ],
    "commentSummary": [
      "FAANG কোম্পানির বাইরে FAANG-স্তরের বেতন অর্জন করা সম্ভব কিন্তু বিরল, যা প্রায়ই নির্দিষ্ট বা উচ্চ-চাপের ভূমিকার সাথে জড়িত।",
      "উচ্চ বেতনের বিকল্পগুলির মধ্যে রয়েছে হেজ ফান্ড, উচ্চ-ফ্রিকোয়েন্সি ট্রেডিং ফার্ম, বিশেষায়িত পরামর্শ, নির্দিষ্ট সফটওয়্যার কোম্পানি, লিগ্যাসি সিস্টেমের দক্ষতা, এবং উদ্যোক্তা।",
      "এই ভূমিকা সাধারণত উচ্চ চাপ, তীব্র প্রতিযোগিতা, বা উল্লেখযোগ্য ঝুঁকি এবং প্রচেষ্টার সাথে আসে, যা তাদের FAANG চাকরির তুলনায় কম সাধারণ এবং সরল করে তোলে।"
    ],
    "points": 241,
    "commentCount": 442,
    "retryCount": 0,
    "time": 1721703798
  },
  {
    "id": 41046540,
    "title": "লামা ৩.১",
    "originLink": "https://llama.meta.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41046540",
    "commentBody": "",
    "originSummary": [
      "ল্লামা ৩.১ একটি ওপেন-সোর্স এআই মডেল যা তিনটি সংস্করণে উপলব্ধ: ৮বি, ৭০বি, এবং ৪০৫বি, যা বিভিন্ন কর্মক্ষমতা এবং খরচের প্রয়োজন মেটাতে সক্ষম।",
      "এটি উন্নত ব্যবহারের ক্ষেত্রে সমর্থন করে, যার মধ্যে রয়েছে কোডিং সহকারী, বহু-ভাষিক এজেন্ট এবং জটিল যুক্তি, রিয়েল-টাইম এবং ব্যাচ ইনফারেন্স, ফাইন-টিউনিং এবং সিন্থেটিক ডেটা জেনারেশনের ক্ষমতা সহ।",
      "মডেলটি ১৫০টিরও বেশি ডেটাসেটে মূল্যায়ন করা হয়েছে, যা সাধারণ, কোড, গণিত, যুক্তি, টুল ব্যবহারের ক্ষেত্রে এবং বহুভাষিক মানদণ্ডে উচ্চ কার্যকারিতা প্রদর্শন করেছে।"
    ],
    "commentSummary": [
      "ল্লামা ৩.১, মেটার একটি ওপেন-সোর্স এআই মডেল, জিপিটি-৪ এর মতো ক্লোজড-সোর্স মডেলের বিরুদ্ধে প্রতিযোগিতামূলক পারফরম্যান্স প্রদর্শন করছে।",
      "৪০৫বি মডেলটি উল্লেখযোগ্য বেঞ্চমার্ক উন্নতি প্রদর্শন করে কিন্তু ক্লাউড সমর্থন ছাড়া বাড়িতে ব্যবহার করা অবাস্তব, যা বড় মডেলগুলি স্থানীয়ভাবে চালানোর চ্যালেঞ্জগুলি তুলে ধরে।",
      "মেটার শক্তিশালী ওপেন মডেলগুলির মুক্তি প্রতিযোগিতামূলক প্রেক্ষাপটকে ব্যাহত করার লক্ষ্য নিয়েছে, যা হার্ডওয়্যার প্রয়োজনীয়তা, কোয়ান্টাইজেশন সমাধান এবং এআই উন্নয়ন ও অ্যাক্সেসিবিলিটির বিস্তৃত প্রভাব সম্পর্কে আগ্রহ সৃষ্টি করছে।"
    ],
    "points": 231,
    "commentCount": 128,
    "retryCount": 0,
    "time": 1721746072
  },
  {
    "id": 41042294,
    "title": "বোতাম চোর",
    "originLink": "https://anatolyzenkov.com/stolen-buttons/button-stealer",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41042294",
    "commentBody": "",
    "originSummary": [
      "বাটন স্টিলার একটি ক্রোম এক্সটেনশন যা আপনি যে প্রতিটি ওয়েবসাইটে যান সেখান থেকে স্বয়ংক্রিয়ভাবে একটি বাটন সরিয়ে দেয়।",
      "এক্সটেনশনটি মজার জন্য ডিজাইন করা হয়েছে এবং এটি ব্যবহার করতে কোনো খরচ নেই, তবে এর কোনো বাস্তব উপযোগিতা নেই।",
      "এটি ব্যবহারকারীর ডিভাইসে স্থানীয়ভাবে পরিচালনা করে ব্যবহারকারীর ডেটার গোপনীয়তা নিশ্চিত করে।"
    ],
    "commentSummary": [
      "বাটন স্টিলার, একটি ক্রোম এক্সটেনশন, এর বিস্তৃত অনুমতিগুলির কারণে নিরাপত্তা উদ্বেগ উত্থাপন করে, যা এটি যেকোনো ওয়েবপেজ থেকে ডেটা স্ক্র্যাপ করতে সক্ষম হতে পারে।",
      "ব্যবহারকারীরা পরামর্শ দেন যে কোডটি GitHub-এ পর্যালোচনা করা এবং স্থানীয়ভাবে ইনস্টল করা উচিত যাতে সম্ভাব্য ক্ষতিকারক আপডেটগুলি এড়ানো যায়, অন্যদিকে অন্যরা যুক্তি দেন যে এমন ঝুঁকিপূর্ণ এক্সটেনশনগুলি Chrome স্টোরে থাকা উচিত নয়।",
      "আলোচনাটি ব্রাউজার এক্সটেনশনের জন্য আরও নির্দিষ্ট অনুমতি এবং উন্নত নিরাপত্তা অনুশীলনের প্রয়োজনীয়তার উপর জোর দেয়।"
    ],
    "points": 213,
    "commentCount": 69,
    "retryCount": 0,
    "time": 1721705873
  },
  {
    "id": 41041537,
    "title": "প্রশ্ন: বাস্তব জীবনে মানুষ জানে যে আপনার একটি ব্লগ আছে?",
    "originLink": "https://lars-christian.com/re-do-people-irl-know-you-have-a-blog/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41041537",
    "commentBody": "",
    "originSummary": [
      "লেখক প্রায় বিশ বছর ধরে একটি ব্লগ বজায় রাখার ব্যক্তিগত গুরুত্ব নিয়ে আলোচনা করেন, যদিও বাস্তব জীবনে (IRL) মানুষের উদাসীনতা রয়েছে।",
      "ব্লগটি আত্মপ্রকাশ এবং স্বাধীনতার একটি রূপ হিসাবে কাজ করে, যা সামাজিক মিডিয়া এবং বড় প্রযুক্তির চাপের সাথে বিপরীত।",
      "পাঠকদের প্রতিক্রিয়াগুলি বিভিন্ন দৃষ্টিভঙ্গি তুলে ধরে, যার মধ্যে ব্যক্তিগত স্পষ্টতার জন্য ব্লগিংয়ের সুবিধা, এআই শোষণ সম্পর্কে উদ্বেগ এবং বিশ্লেষণ ছাড়াই লেখার উৎসাহ অন্তর্ভুক্ত।"
    ],
    "commentSummary": [
      "ব্যক্তিগত ওয়েবসাইটগুলি নিয়মিত আপডেটের চাপ ছাড়াই নমনীয়তা এবং পরিশীলন প্রদান করে, যা ব্লগের মতো অলস এবং অমার্জিত মনে হতে পারে না।",
      "ব্লগগুলি ইতিহাসবিদদের জন্য এবং চিন্তাভাবনা ভাগ করার জন্য উপকারী হতে পারে, তবে ব্যক্তিগত পৃষ্ঠাগুলি তাদের সংগঠন এবং সৃজনশীল সম্ভাবনার জন্য বেশি পছন্দ করা হয়।",
      "কিছু ব্যক্তি পেশাগত প্রতিক্রিয়া এড়াতে ব্যক্তিগত ওয়েবসাইটে ছদ্মনাম ব্যবহার করেন, যা এই প্ল্যাটফর্মগুলির ব্যক্তিগত প্রকৃতিকে তুলে ধরে।"
    ],
    "points": 175,
    "commentCount": 121,
    "retryCount": 0,
    "time": 1721696929
  },
  {
    "id": 41042034,
    "title": "উইজ গুগলের সাথে ২৩ বিলিয়ন ডলারের চুক্তি থেকে সরে দাঁড়িয়েছে",
    "originLink": "https://www.cnbc.com/2024/07/23/google-wiz-deal-dead.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41042034",
    "commentBody": "",
    "originSummary": [
      "উইজ গুগলের সাথে ২৩ বিলিয়ন ডলারের অধিগ্রহণ চুক্তি পরিত্যাগ করার সিদ্ধান্ত নিয়েছে এবং এর পরিবর্তে প্রাথমিক গণপ্রস্তাব (আইপিও) অনুসরণ করবে, বলে ঘোষণা করেছেন সিইও আসাফ রাপাপোর্ট।",
      "সিদ্ধান্তটি অ্যান্টিট্রাস্ট এবং বিনিয়োগকারীদের উদ্বেগ দ্বারা প্রভাবিত হয়েছিল, যেখানে উইজ বার্ষিক পুনরাবৃত্তি আয় হিসাবে ১ বিলিয়ন ডলার লক্ষ্য করছে।",
      "২০২০ সালে প্রতিষ্ঠিত, উইজ দ্রুত বৃদ্ধি পেয়েছে, গত বছর বার্ষিক পুনরাবৃত্তি আয় $৩৫০ মিলিয়ন অর্জন করেছে এবং ক্লাউড সিকিউরিটি পণ্য সরবরাহ করে।"
    ],
    "commentSummary": [
      "উইজ গুগলের সাথে ২৩ বিলিয়ন ডলারের চুক্তি থেকে সরে এসেছে, সম্ভবত গুগল অভ্যন্তরীণ ডেটা পর্যালোচনার পর চুক্তিটি পুনর্মূল্যায়ন করার কারণে।",
      "উইজ দাবি করে যে তারা সরে এসেছে কারণ তারা বিশ্বাস করে তাদের মূল্যায়ন বেশি, যদিও তাদের উচ্চ মূল্যায়ন সম্পর্কে সংশয় রয়েছে, যা প্রতিবেদন অনুযায়ী তাদের বার্ষিক পুনরাবৃত্তি আয়ের (ARR) চেয়ে ৬০ গুণেরও বেশি।",
      "চুক্তির ভেঙে পড়া উইজের প্রকৃত মূল্য এবং ভবিষ্যৎ সম্পর্কে প্রশ্ন উত্থাপন করে, যদিও ২০২০ সালে প্রতিষ্ঠার পর থেকে তারা দ্রুত $১০০ মিলিয়ন ARR-এ পৌঁছেছে।"
    ],
    "points": 161,
    "commentCount": 114,
    "retryCount": 0,
    "time": 1721702579
  },
  {
    "id": 41046956,
    "title": "OCSP পরিষেবা শেষ করার অভিপ্রায়",
    "originLink": "https://letsencrypt.org/2024/07/23/replacing-ocsp-with-crls.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41046956",
    "commentBody": "",
    "originSummary": [
      "প্রাইভেসি ঝুঁকি এবং সম্পদ দক্ষতার কারণে Let’s Encrypt অনলাইন সার্টিফিকেট স্ট্যাটাস প্রোটোকল (OCSP) এর সমর্থন বন্ধ করে সার্টিফিকেট রিভোকেশন লিস্ট (CRLs) এর পক্ষে যাচ্ছে।",
      "এই পরিবর্তন ওয়েবসাইট বা দর্শকদের প্রভাবিত করবে না, তবে কিছু নন-ব্রাউজার সফটওয়্যারে প্রভাব ফেলতে পারে; ব্যবহারকারীদের পরামর্শ দেওয়া হচ্ছে যে তারা তাদের সফটওয়্যারটি OCSP URL ছাড়াই কাজ করে কিনা তা নিশ্চিত করুন।",
      "CA/Browser ফোরামের সিদ্ধান্ত অনুযায়ী, পাবলিকভাবে বিশ্বাসযোগ্য সার্টিফিকেট অথরিটিগুলির (CAs) জন্য OCSP ঐচ্ছিক করা হয়েছে, যেখানে মাইক্রোসফট একমাত্র ব্যতিক্রম; মাইক্রোসফটও এটি ঐচ্ছিক করার পর OCSP পরিষেবাগুলি বন্ধ করার সময়সূচি ঘোষণা করা হবে।"
    ],
    "commentSummary": [
      "লেটস এনক্রিপ্ট তাদের OCSP (অনলাইন সার্টিফিকেট স্ট্যাটাস প্রোটোকল) পরিষেবা বন্ধ করার পরিকল্পনা করছে সার্টিফিকেট রিভোকেশন লিস্ট (CRLs) এবং OCSP সিস্টেমের জটিলতার সমস্যার কারণে।",
      "প্রস্তাবগুলির মধ্যে রয়েছে দক্ষতা বাড়ানোর জন্য CRLs-এর জন্য একটি বাইনারি ফর্ম্যাট ব্যবহার করা এবং গোপনীয়তা উদ্বেগ মোকাবেলার জন্য বাধ্যতামূলক OCSP স্ট্যাপলিং, যদিও এটি অনেক ওয়েবসাইটে বিঘ্ন ঘটাতে পারে।",
      "OCSP থেকে সরে আসা নন-ব্রাউজার অ্যাপ্লিকেশন এবং এমবেডেড ডিভাইসগুলিকে প্রভাবিত করতে পারে, তবে Nginx বা Caddy এর মতো স্ট্যান্ডার্ড ওয়েব সার্ভারের ব্যবহারকারীদের তাত্ক্ষণিক পরিবর্তনের প্রয়োজন হবে না।"
    ],
    "points": 157,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1721748314
  },
  {
    "id": 41042753,
    "title": "লিনাক্স অডিও স্ট্যাকের রহস্য উন্মোচন (এবং আরও অনেক কিছু)",
    "originLink": "https://blog.rtrace.io/posts/the-linux-audio-stack-demystified/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41042753",
    "commentBody": "",
    "originSummary": [
      "প্রবন্ধটি লিনাক্স অডিও স্ট্যাকের একটি বিস্তৃত পর্যালোচনা প্রদান করে, যা শব্দের মৌলিক বিষয়, মানুষের শব্দ উপলব্ধি এবং ডিজিটাল অডিও প্রক্রিয়াকরণ ব্যাখ্যা করে।",
      "লিনাক্স অডিও স্ট্যাকের প্রধান উপাদানগুলির মধ্যে রয়েছে নিম্ন-স্তরের হার্ডওয়্যার নিয়ন্ত্রণের জন্য ALSA, নিম্ন-বিলম্বিত রিয়েল-টাইম অডিওর জন্য JACK, এবং উচ্চ-স্তরের অডিও ব্যবস্থাপনার জন্য PulseAudio, যেখানে PipeWire একটি ঐক্যবদ্ধ সমাধান হিসাবে আবির্ভূত হচ্ছে।",
      "পাইপওয়্যারকে একটি বহুমুখী বিকল্প হিসাবে উল্লেখ করা হয়েছে যা জ্যাক এবং পালসঅডিও উভয়ের বৈশিষ্ট্যগুলিকে একত্রিত করে, যা ভবিষ্যতের লিনাক্স বিতরণগুলিতে তাদের প্রতিস্থাপন করতে পারে।"
    ],
    "commentSummary": [
      "লিনাক্স অডিও স্ট্যাক, যদিও জটিল, বিভিন্ন হার্ডওয়্যার এবং কার্যকারিতা সমর্থন করে, যার মধ্যে মাল্টিপ্লেক্সিং এবং নেটওয়ার্ক বৈশিষ্ট্য অন্তর্ভুক্ত।",
      "পাইপওয়্যার লিনাক্স অডিও স্ট্যাককে একীভূত করার লক্ষ্য রাখে, বিভিন্ন এপিআই সমর্থন করে এবং পালসঅডিওর উন্নতি সাধন করে, উন্নত বহুমুখিতা এবং স্থিতিশীলতা প্রদান করে।",
      "যদিও কিছু ব্যবহারকারী উন্নত সেটআপের সাথে চ্যালেঞ্জের মুখোমুখি হন, অনেকেই লিনাক্স অডিওতে পাইপওয়্যার যে উন্নতি এবং নমনীয়তা নিয়ে আসে তা প্রশংসা করেন।"
    ],
    "points": 144,
    "commentCount": 122,
    "retryCount": 0,
    "time": 1721711898
  },
  {
    "id": 41040417,
    "title": "যুক্তরাষ্ট্র পারমাণবিক ওয়ারহেডের সংখ্যা প্রকাশ করেছে; পারমাণবিক স্বচ্ছতা পুনরুদ্ধার করেছে",
    "originLink": "https://fas.org/publication/united-states-discloses-nuclear-warhead-numbers-restores-nuclear-transparency/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41040417",
    "commentBody": "",
    "originSummary": [
      "আমেরিকান বিজ্ঞানীদের ফেডারেশন (এফএএস) যুক্তরাষ্ট্রকে তার পারমাণবিক ওয়ারহেড সংখ্যা প্রকাশ করার জন্য প্রশংসা করেছে, যা পারমাণবিক স্বচ্ছতা বাড়িয়েছে।",
      "সেপ্টেম্বর ২০২৩ পর্যন্ত, যুক্তরাষ্ট্রের কাছে ৩,৭৪৮টি পারমাণবিক ওয়ারহেড রয়েছে, যার মধ্যে গত বছর মাত্র ৬৯টি ভেঙে ফেলা হয়েছে, যা ১৯৯৪ সালের পর থেকে সর্বনিম্ন।",
      "বাইডেন প্রশাসনের প্রকাশনা ট্রাম্প প্রশাসন দ্বারা স্থগিত করা স্বচ্ছতাকে পুনর্বহাল করে, এবং এফএএস অন্যান্য পারমাণবিক রাষ্ট্রগুলিকে অনুরূপ স্বচ্ছতা গ্রহণ করতে উৎসাহিত করে যাতে অবিশ্বাস এবং ভুল তথ্য প্রতিরোধ করা যায়।"
    ],
    "commentSummary": [
      "যুক্তরাষ্ট্র তাদের পারমাণবিক ওয়ারহেডের সংখ্যা প্রকাশ করেছে, পারমাণবিক স্বচ্ছতা পুনঃপ্রতিষ্ঠা করেছে এবং উৎপাদন ক্ষমতা ও কৌশলগত গুরুত্ব নিয়ে আলোচনা শুরু করেছে।",
      "মূল বিষয়গুলির মধ্যে রয়েছে সম্ভাব্য উৎপাদন বৃদ্ধির গতি, মজুদ আকারের বৈশ্বিক নিরাপত্তা এবং ভূ-রাজনীতির উপর প্রভাব, এবং রক্ষণাবেক্ষণের চ্যালেঞ্জ যেমন প্লুটোনিয়ামের বার্ধক্য এবং ট্রিটিয়াম প্রতিস্থাপন।",
      "প্রকাশটি মিত্রদের আশ্বস্ত করতে এবং প্রতিপক্ষদের নিরুৎসাহিত করতে লক্ষ্য করে, যুক্তরাষ্ট্রের উল্লেখযোগ্য পারমাণবিক সক্ষমতা প্রদর্শন করে।"
    ],
    "points": 132,
    "commentCount": 185,
    "retryCount": 0,
    "time": 1721686564
  },
  {
    "id": 41041575,
    "title": "সি# এ লিস্প",
    "originLink": "https://github.com/codr7/sharpl",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41041575",
    "commentBody": "",
    "originSummary": [
      "শার্পল একটি কাস্টম লিস্প ইন্টারপ্রেটার যা সি# এ লেখা হয়েছে, প্রায় ৪,০০০ লাইনের কোড এবং কোনো বাহ্যিক নির্ভরতা নেই, যা এটিকে সহজে এম্বেড করার যোগ্য করে তোলে।",
      "মূল বৈশিষ্ট্যগুলির মধ্যে রয়েছে জোড়া, অ্যারে, ম্যাপ, পদ্ধতি সংমিশ্রণ, ভ্যারাগস, একটি ঐক্যবদ্ধ ইটারেটর প্রোটোকল, এবং একটি স্থির বিন্দু দশমিক প্রকার, অন্যান্যগুলির মধ্যে।",
      "এটি লেক্সিকাল এবং ডাইনামিক বাইন্ডিংস, টেইল কল অপ্টিমাইজেশন যা স্ট্যাক ওভারফ্লো প্রতিরোধ করে এবং লাইন নম্বর সহ বিস্তারিত ত্রুটি রিপোর্টিং সমর্থন করে।"
    ],
    "commentSummary": [
      "একজন ডেভেলপার যার নাম codr7, তিনি C# এ একটি Lisp ইমপ্লিমেন্টেশন নিয়ে কাজ করছেন এবং সম্প্রদায়ের কাছ থেকে অপ্টিমাইজেশন সহায়তা চাইছেন।",
      "কমিউনিটির পরামর্শের মাধ্যমে উল্লেখযোগ্য কর্মক্ষমতা উন্নতি অর্জিত হয়েছে, যেমন ArrayStack কীভাবে অ্যাক্সেস করা হয় তা পরিবর্তন করা এবং ডেটা স্লাইসিংয়ের জন্য Span এবং ReadOnlySpan ব্যবহার করা।",
      "প্রকল্পটি মানসম্মত সম্মতির জন্য নয় বরং ব্যবহারিক কর্মক্ষমতা এবং ব্যবহারযোগ্যতার জন্য লক্ষ্য করছে, যেখানে ম্যাক্রো এবং ফাংশন এক্সপ্রেশন (Fexprs) এর মতো বৈশিষ্ট্যগুলি সংহত করার বিষয়ে চলমান আলোচনা রয়েছে।"
    ],
    "points": 130,
    "commentCount": 63,
    "retryCount": 0,
    "time": 1721697283
  }
]
