[
  {
    "id": 38381573,
    "title": "التفكير في 18 عاما في Google: دعوة لتغيير القيادة واستعادة القيم",
    "originLink": "https://ln.hixie.ch/?start=1700627373&count=1",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38381573",
    "commentBody": "",
    "originSummary": [
      "يتأمل المؤلف في 18 عاما في Google ويثني على ثقافة الشركة وقيمها المبكرة.",
      "بمرور الوقت ، تآكلت ثقافة Google ، وانخفضت الشفافية ، وبدأت عملية صنع القرار في إعطاء الأولوية لمصالح الشركة على مصالح المستخدمين.",
      "ينظر إلى الافتقار إلى القيادة الحكيمة من الرئيس التنفيذي الحالي ساندر بيتشاي كعامل مساهم في هذه القضايا.",
      "يعتقد المؤلف أن Google تحتاج إلى تغيير في القيادة لتوجيه الشركة مرة أخرى نحو مهمتها وقيمها الأصلية.",
      "لا يزال من الممكن ل Google الشفاء وتحقيق أشياء عظيمة ، لكن الوقت ينفد لعكس تدهور ثقافة الشركة."
    ],
    "commentSummary": [],
    "points": 1771,
    "commentCount": 860,
    "retryCount": 0,
    "time": 1700671455
  },
  {
    "id": 38378216,
    "title": "طرد سام ألتمان وأعاد: الاشتباكات والجدل في OpenAI",
    "originLink": "https://www.washingtonpost.com/technology/2023/11/22/sam-altman-fired-y-combinator-paul-graham/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38378216",
    "commentBody": "",
    "originSummary": [
      "تم طرد سام ألتمان ، الرئيس التنفيذي السابق لشركة OpenAI ، في البداية بسبب الاشتباكات وسلوك الخدمة الذاتية والمخاوف بشأن توازن السلطة ومجلس الإدارة.",
      "تفاوض ألتمان في وقت لاحق على عودته لكنه واجه معارضة من المؤسسين وأعضاء مجلس الإدارة ، مما أدى إلى مزاعم بالخداع والتلاعب.",
      "على الرغم من الجدل ، فإن ألتمان لديه مؤيدون ومنتقدون مخلصون ، مع اتهامات بالتلاعب والانقسام ، لكن مهاراته الاستراتيجية وجاذبيته تتماشى مع ثقافة وادي السيليكون ، ولا يزال مكرسا لمهمة OpenAI."
    ],
    "commentSummary": [
      "أثار سام ألتمان ، الرئيس التنفيذي السابق لشركة OpenAI ، العديد من المناقشات والمناظرات المحيطة بمغادرته الشركة.",
      "تشمل الموضوعات التي يتم تناولها طرده سابقا من Y Combinator ، والتكهنات حول قدراته ودوافعه ، ومصداقية الأفراد في مجال الذكاء الاصطناعي ، وتأثير قادة الأعمال.",
      "تتطرق المناقشات الأخرى إلى فصل الموظفين وإعادة توظيفهم ، والبيانات المتطورة من Y Combinator ، وتغريدات من بول جراهام حول Altman ، وتأثير Ilya Sutskever ، والتوافق بين كونك \"لطيفا\" مع التحكم في مستقبل الذكاء الاصطناعي."
    ],
    "points": 847,
    "commentCount": 658,
    "retryCount": 0,
    "time": 1700655430
  },
  {
    "id": 38386487,
    "title": "حذر باحثو OpenAI مجلس الإدارة من الذكاء الاصطناعي اختراق قبل الإطاحة بالرئيس التنفيذي",
    "originLink": "https://www.reuters.com/technology/sam-altmans-ouster-openai-was-precipitated-by-letter-board-about-ai-breakthrough-2023-11-22/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38386487",
    "commentBody": "",
    "originSummary": [
      "أثار باحثو OpenAI مخاوف بشأن خوارزمية الذكاء الاصطناعي قوية تسمى Q * والتي لديها القدرة على أن تكون اختراقا كبيرا نحو تحقيق الذكاء الاصطناعي العام (AGI).",
      "لعبت الرسالة واكتشاف Q * دورا في إقالة الرئيس التنفيذي Sam Altman ، حيث كان لدى مجلس الإدارة مخاوف بشأن تسويق التطورات دون فهم كامل للآثار.",
      "لم يتم التحقق من قدرات Q * بشكل مستقل ، ونتيجة لطرد Altman ، هدد أكثر من 700 موظف بالمغادرة والانضمام إلى Microsoft."
    ],
    "commentSummary": [
      "تتعمق المحادثة في مجموعة متنوعة من الموضوعات المتعلقة بالتطورات الذكاء الاصطناعي ، مع التركيز بشكل أساسي على قدرات وقيود نماذج اللغة الحالية في حل مشاكل الرياضيات.",
      "تتم مناقشة دمج فهم الرياضيات البديهي في الأنظمة الذكاء الاصطناعي وتحديات التفكير وقدرات حل المشكلات.",
      "كما يتم استكشاف أهمية الخبرة البشرية إلى جانب القوة الحسابية ، والمخاطر المحتملة للاختراقات الذكاء الاصطناعي ، والنقاش المستمر حول قدرة الذكاء الاصطناعي على التفكير وفهم المشكلات المعقدة."
    ],
    "points": 758,
    "commentCount": 835,
    "retryCount": 0,
    "time": 1700694458
  },
  {
    "id": 38380137,
    "title": "VMware تنضم إلى Broadcom ، وتقدم بوابة دعم محسنة",
    "originLink": "https://www.broadcom.com/info/vmware",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38380137",
    "commentBody": "",
    "originSummary": [
      "تقدم Broadcom بوابة دعم للمستخدمين للوصول إلى المعلومات والمساعدة.",
      "لدى المستخدمين خيار التسجيل في البوابة واسترداد أسماء المستخدمين / كلمات المرور المنسية."
    ],
    "commentSummary": [
      "تشمل المناقشة العديد من الموضوعات المتعلقة ببرامج المحاكاة الافتراضية ، بما في ذلك المخاوف بشأن استحواذ Broadcom على VMware والمقارنات بين برامج مراقبة الأجهزة الافتراضية المختلفة.",
      "يناقش المستخدمون الأسعار والميزات وتأثيرات عمليات الاستحواذ على الشركات والعملاء ، معربين عن تفضيلاتهم لخيارات برامج محددة.",
      "تتوسع المحادثة لتشمل بدائل VMware ، مثل Proxmox و KVM و Hyper-V ، بالإضافة إلى مواضيع أخرى مثل الحلول السحابية وبرامج المؤسسات."
    ],
    "points": 373,
    "commentCount": 250,
    "retryCount": 0,
    "time": 1700665298
  },
  {
    "id": 38378455,
    "title": "أوبونتو يتفوق على ويندوز 11 بنسبة 20٪ على الجديد AMD Zen 4 Threadripper",
    "originLink": "https://www.phoronix.com/review/threadripper-7995wx-windows-linux",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38378455",
    "commentBody": "",
    "originSummary": [
      "يتفوق Linux ، وتحديدا Ubuntu 23.10 ، على Microsoft Windows 11 على معالج AMD Zen 4 Threadripper الجديد مع ميزة أداء تبلغ حوالي 20٪.",
      "تتضمن الاختبارات القياسية على محطة عمل HP Z6 G5 A العرض وتقليل تشويش الصور وترميز الفيديو والشطرنج ومهام أخرى.",
      "تأتي وحدة المراجعة مع Windows 11 تم تحميله مسبقا ، والذي يقدم منظورا للأداء الذي أقره بائع الأجهزة."
    ],
    "commentSummary": [],
    "points": 339,
    "commentCount": 373,
    "retryCount": 0,
    "time": 1700657193
  },
  {
    "id": 38383138,
    "title": "طاحونة هوائية: أسرع محرك سير عمل مفتوح المصدر ذاتي التجهيز",
    "originLink": "https://www.windmill.dev/blog/launch-week-1/fastest-workflow-engine",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38383138",
    "commentBody": "",
    "originSummary": [
      "تؤكد Windmill Labs أن محرك سير العمل مفتوح المصدر القابل للاستضافة الذاتية ، Windmill ، هو الأسرع مقارنة بمحركات سير العمل المعروفة الأخرى مثل Airflow و Prefect و Temporal.",
      "تقدم Windmill الدعم للغات البرمجة المتعددة وتوفر بيئة تطوير متكاملة للبناء السريع واختبار سير العمل.",
      "على عكس Temporal ، تبرز Windmill في تنفيذ المهام التعسفية على مجموعة داخلية وتعتمد على Postgresql و Rust في تصميم نظامها ، مما يساهم في أدائها المثير للإعجاب."
    ],
    "commentSummary": [
      "Windmill هو محرك سير عمل مفتوح المصدر قابل للاستضافة الذاتية مصمم لبناء برامج داخلية في المؤسسات ، وتقديم الأداء ، والمجتمع النشط ، ودعم لغات البرمجة المتعددة.",
      "تعد الموافقة على استخدام Windmill في بيئات المؤسسات والترحيل من الحلول الحالية من الاهتمامات الرئيسية التي تمت مناقشتها في المقالة.",
      "تعتقد الشركة التي تقف وراء Windmill أن المصدر المفتوح هو أفضل نهج للبرامج على مستوى البنية التحتية ويستهدف المؤسسات التي تتطلع إلى أتمتة سير العمل. يسلط المستخدمون الضوء على سهولة الاستخدام والطبيعة ذاتية الاستضافة ودعم المهام المختلفة كجوانب إيجابية ل Windmill. تغطي المناقشة أيضا ميزات مثل خيارات التعليمات البرمجية وبدون تعليمات برمجية واستخدام Windmill لخطوط أنابيب البيانات."
    ],
    "points": 322,
    "commentCount": 157,
    "retryCount": 0,
    "time": 1700677984
  },
  {
    "id": 38384952,
    "title": "اكتشف النظام البيئي GPUOpen من AMD لمبرمجي الرسومات الطموحين",
    "originLink": "https://gpuopen.com/learn/how_do_you_become_a_graphics_programmer/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38384952",
    "commentBody": "",
    "originSummary": [
      "تم تصميم النظام الأساسي للمبتدئين لاكتشاف واكتساب المعرفة حول أدوات AMD ومكتباتها وتأثيراتها داخل نظام GPUOpen البيئي.",
      "يوفر بيئة مثالية للأفراد الذين يرغبون في استكشاف تقنيات وموارد AMD والتعرف عليها.",
      "توفر هذه المنصة فرصة رائعة للقادمين الجدد للغوص في النظام البيئي GPUOpen وفهم كيفية استخدام منتجات AMD وتطوراتها."
    ],
    "commentSummary": [
      "أهمية التركيز على الهدف النهائي المتمثل في إنشاء الرسومات بدلا من الوقوع في الأدوات والتعليمات البرمجية منخفضة المستوى.",
      "قيمة الخبرة الصناعية وأدوات التجريد مثل محركات الألعاب في برمجة الرسومات.",
      "الحاجة إلى قاعدة معرفية واسعة والقدرة على التكيف في التكنولوجيا عندما يتعلق الأمر ببرمجة الرسومات."
    ],
    "points": 282,
    "commentCount": 131,
    "retryCount": 0,
    "time": 1700686443
  },
  {
    "id": 38387464,
    "title": "فهم أوامر \"الاختبار\" و \"[]\" و \"[[\" في أنظمة Unix (2020)",
    "originLink": "https://jmmv.dev/2020/03/test-bracket.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38387464",
    "commentBody": "",
    "originSummary": [
      "يتم استخدام أوامر \"test\" و \"[]\" في أنظمة Unix لتقييم التعبيرات في البرامج النصية shell.",
      "يمكن تنفيذ هذه الأوامر كثنائيات منفصلة أو مضمنة داخل shell ، مما يؤدي إلى سلوك مختلف عبر قذائف مختلفة.",
      "الأمر '[[' هو امتداد Bash يضمن أنه مدمج ويسمح بإجراء تغييرات في قواعد اللغة داخل تعبيراتها.",
      "يوصى باستخدام \"[\" للنصوص المحمولة و \"[[\" للنصوص النصية الخاصة ب Bash.",
      "تذكر المقالة أيضا القدرة على الجمع بين تعبيرات الاختبار وتعبيرات shell في استدعاء واحد."
    ],
    "commentSummary": [
      "تغطي المقالات والمناقشات جوانب مختلفة من البرمجة النصية bash واستخدام البرامج النصية shell ، بما في ذلك التقنيات والأوامر وخيارات بناء الجملة.",
      "يتم التأكيد على أهمية قابلية النقل والالتزام بالمعايير وقيود وتعقيدات البرمجة النصية لشل.",
      "هناك جدل حول اختيار الأصداف والأدوات واللغات المحددة وإيجابيات وسلبيات استخدام البرامج النصية shell لمهام مختلفة. تسلط هذه المناقشات الضوء على التحديات والاعتبارات في كتابة نصوص قذيفة فعالة وقابلة للصيانة."
    ],
    "points": 247,
    "commentCount": 122,
    "retryCount": 0,
    "time": 1700699493
  },
  {
    "id": 38378242,
    "title": "UltraFastBERT: نمذجة لغوية أسرع بشكل كبير مع الحد الأدنى من مشاركة الخلايا العصبية",
    "originLink": "https://arxiv.org/abs/2311.10770",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38378242",
    "commentBody": "",
    "originSummary": [
      "تقدم \"نمذجة اللغة الأسرع بشكل كبير\" متغيرا جديدا من BERT يسمى UltraFastBERT يحقق أداء عاليا مع 0.3٪ فقط من الخلايا العصبية النشطة أثناء الاستدلال.",
      "يستخدم UltraFastBERT شبكات التغذية الأمامية السريعة (FFFs) بدلا من شبكات التغذية الأمامية التقليدية ، مما يؤدي إلى تحسين كبير في السرعة.",
      "يقدم المؤلفون رمزا ومعايير لتنفيذها ، مما يدل على سرعتها الفائقة مقارنة بالطرق الحالية."
    ],
    "commentSummary": [
      "يناقش المنشور مقالا بعنوان \"Ultra Fast BertHacker NewspastloginUltra Fast Bert\" تمت مشاركته على arxiv.org.",
      "تم نقل التعليقات المتعلقة بالوظيفة إلى news.ycombinator.com."
    ],
    "points": 233,
    "commentCount": 1,
    "retryCount": 0,
    "time": 1700655605
  },
  {
    "id": 38381918,
    "title": "تحديث Firefox الجديد يأخذ Chrome مع خصوصية أفضل وتجربة محسنة للجوال",
    "originLink": "https://www.androidpolice.com/never-been-better-time-switch-firefox-browser/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38381918",
    "commentBody": "",
    "originSummary": [
      "يتلقى Firefox ، متصفح الويب للجوال ، تحديثا رئيسيا يهدف إلى تحدي هيمنة Chrome في كل من تصفح الكمبيوتر الشخصي والجوال.",
      "يوفر Firefox خصوصية وأمانا أفضل وتجربة تصفح أنظف مقارنة ب Chrome ، مما يجعله بديلا جذابا.",
      "تتمثل إحدى مزايا Firefox على Chrome في قدرته على دعم الوظائف الإضافية ، وتطلق Mozilla 200 إضافة جديدة ل Firefox Mobile ، مما يجعلها أقرب إلى إصدار سطح المكتب. توفر هذه الوظائف الإضافية ميزات مثل حظر الإعلانات وإدارة كلمات المرور والأمان المحسن ، مما يجعل Firefox أكثر تنوعا وسهولة في الاستخدام."
    ],
    "commentSummary": [
      "يتمتع المستخدمون بتجارب إيجابية مع ميزات مثل الترجمات واستهلاك الطاقة عند استخدام Firefox كمتصفح ويب خاص بهم.",
      "ومع ذلك ، هناك مشكلات فنية وعدم رضا عن واجهة المستخدم التي أبلغ عنها بعض المستخدمين.",
      "تدور المناقشات أيضا حول قابلية تخصيص Firefox ، والحاجة إلى تحسين إدارة علامات التبويب وقدرات حفظ الملفات ، وتنفيذ واجهة برمجة تطبيقات نظام الملفات.",
      "تثار مخاوف الخصوصية وإدارة الحقوق الرقمية ، إلى جانب اعتبارات المتصفحات البديلة.",
      "بشكل عام ، يقترح أن التبديل إلى Firefox قد يكون خيارا جيدا في هذا الوقت."
    ],
    "points": 202,
    "commentCount": 81,
    "retryCount": 0,
    "time": 1700673044
  },
  {
    "id": 38380344,
    "title": "يعيد GitHub تسمية حسابات المستخدمين دون إشعار أو تفسير",
    "originLink": "http://russbishop.net/github-renamed-me",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38380344",
    "commentBody": "",
    "originSummary": [
      "تمت إعادة تسمية حساب Github الخاص بالمؤلف دون أي إشعار أو تفسير مسبق.",
      "قام شخص مجهول بتحميل مفتاح SSH إلى الحساب ، مما يسمح له بتعديل مستودعات المؤلف.",
      "يعرب المؤلف عن إحباطه من عدم وجود وثائق من Github فيما يتعلق بسياسة إعادة تسمية الحساب هذه."
    ],
    "commentSummary": [
      "يسمح GitHub للمستخدمين بطلب تغييرات اسم المستخدم للحسابات غير النشطة بدون مستودعات ، لكن عملية الموافقة غير متسقة.",
      "نجح بعض المستخدمين في تغيير أسماء المستخدمين الخاصة بهم ، بينما تم رفض البعض الآخر.",
      "تطورت سياسة GitHub بشأن تغييرات اسم المستخدم ، مع الموافقة على عدد أقل من الطلبات في السنوات الأخيرة.",
      "هناك مخاوف بشأن إعادة تسمية الحسابات دون إشعار ومخاطر أمنية محتملة مثل اختطاف الحساب.",
      "شارك المستخدمون تجارب مختلطة مع المطالبة بأسماء مستخدمين غير نشطة، مع تسليط الضوء على النتائج الإيجابية والسلبية."
    ],
    "points": 194,
    "commentCount": 70,
    "retryCount": 0,
    "time": 1700666143
  },
  {
    "id": 38378992,
    "title": "شرائح M3 من Apple: استكشاف التغييرات في التكوين الأساسي لوحدة المعالجة المركزية",
    "originLink": "https://eclecticlight.co/2023/11/22/what-has-changed-in-cpu-cores-in-m3-chips/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38378992",
    "commentBody": "",
    "originSummary": [
      "تحتوي شرائح M1 و M3 من Apple على اختلافات في نوى وحدة المعالجة المركزية ، والتي يمكن أن تؤثر على الأداء واستخدام الطاقة.",
      "تحتوي شرائح M3 على مجموعات أكبر من نوى وحدة المعالجة المركزية ، مما قد يؤثر على الأداء العام.",
      "تحتوي رقائق M3 على نوى E ذات تردد أقصى أعلى ولكن تردد أقل لمهام الخلفية ، بينما توفر نوى P أداء محسنا لمعالجة المتجهات وترددا أقصى أعلى."
    ],
    "commentSummary": [
      "تدور المناقشة حول جوانب مختلفة من Apple MacBooks ، بما في ذلك مقارنات الطراز وقدرات ذاكرة الوصول العشوائي وعمر البطارية والتأثير البيئي والأداء وخيارات الترقية.",
      "يشارك المستخدمون تجاربهم الشخصية وإحباطاتهم وتفضيلاتهم فيما يتعلق بنماذج MacBook المختلفة وأدائهم في مهام مثل تحرير الفيديو وإنتاج الموسيقى وتطوير التطبيقات.",
      "كما يتم تناول موضوعات مثل تكلفة أجهزة الكمبيوتر المحمولة من Apple ، ومزايا الترقية لأغراض مختلفة ، وقيود الأجهزة القديمة في المناقشة."
    ],
    "points": 191,
    "commentCount": 269,
    "retryCount": 0,
    "time": 1700660600
  },
  {
    "id": 38379543,
    "title": "هندسة المراهقين: الابتكار باستخدام منتجات التصميم عالية الجودة وأجهزة مزج الصوت اللاسلكية",
    "originLink": "https://teenage.engineering/products/ep-133",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38379543",
    "commentBody": "",
    "originSummary": [
      "Teenage Engineering هو استوديو يركز على إنشاء منتجات تصميم مبتكرة وعملية من خلال التقنيات الهندسية المتقدمة.",
      "إنهم متخصصون في أجهزة مزج الصوت اللاسلكية ويقدمون مجموعة من الخدمات مثل متجر على الإنترنت وعربة تسوق ورسالة إخبارية.",
      "أنها توفر أدلة الدعم والتنزيلات وبوابة دعم EMS لمساعدة المستخدمين. كما أنها تروج لأسلوب فريد للاستمتاع بالموسيقى واستخدام ملفات تعريف الارتباط ، مع مزيد من التفاصيل في سياسة الخصوصية الخاصة بهم."
    ],
    "commentSummary": [
      "أصدرت Teenage Engineering جهاز EP-133 ، وهو جهاز ميسور التكلفة بسعر 299 دولارا ، مما فاجأ العملاء بسعره المنخفض.",
      "على الرغم من كونها مصنوعة من البلاستيك ، إلا أن العملاء معجبون بالمنتج ، ويتكهن البعض بأن استراتيجية التسعير هي جزء من خطة التسويق الخاصة ب Teenage Engineering.",
      "تدور مناقشات أخرى حول جهاز صنع الموسيقى SP404mkII ، والمخاوف بشأن المشكلات البسيطة المتعلقة بجهاز المزج الذي تم شراؤه مؤخرا ، والمناقشات حول تردد الساعة ومعدل العينة ، والإعجاب بتصميم أجهزة Teenage Engineering KO II و PO-33.",
      "يعد السعر المعقول والقيمة الذاتية لهذه العناصر التي تمت مناقشتها من العوامل المهمة التي تؤثر على عمليات الشراء المحتملة."
    ],
    "points": 184,
    "commentCount": 107,
    "retryCount": 0,
    "time": 1700662945
  },
  {
    "id": 38379893,
    "title": "فورتران 2023: أحدث معيار دولي للغة البرمجة يعزز الصناعة والابتكار",
    "originLink": "https://www.iso.org/standard/82170.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38379893",
    "commentBody": "",
    "originSummary": [
      "ISO / IEC 1539-1: 2023 هو معيار دولي للغة البرمجة فورتران ، تم نشره في 17 نوفمبر 2023 ، ويتكون من 674 صفحة.",
      "يحل هذا المعيار محل الإصدار السابق ، ISO / IEC 1539-1: 2018.",
      "ISO هي منظمة عالمية تقوم بتطوير ونشر المعايير الدولية لمختلف القطاعات ، وتعزيز الاستدامة ودعم الصناعة والابتكار والبنية التحتية."
    ],
    "commentSummary": [
      "يدور النقاش حول استخدام لغة برمجة Fortran ومقارناتها باللغات الشائعة الأخرى مثل Julia, C ++, and Python.",
      "يشارك المستخدمون تجاربهم وآرائهم حول تطور Fortran وميزاته وتحديات وفوائد الانتقال إلى لغات مختلفة.",
      "يتم التأكيد على مزايا فورتران في المجالات المتخصصة مثل الفيزياء ونمذجة المناخ ، إلى جانب المناقشات حول تحسين الأداء والمكتبات وأهمية التنوع اللغوي.",
      "يفضل بعض المستخدمين Fortran لسرعته ، بينما يذكر آخرون المزايا المحتملة للغات الأخرى.",
      "كما تم التطرق إلى توافر وثائق معايير ISO وتأثيرها على تكاليف التطوير."
    ],
    "points": 176,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1700664390
  },
  {
    "id": 38386547,
    "title": "قدرة ChatGPT على توليد بيانات علمية مزيفة تثير مخاوف بشأن نزاهة البحث",
    "originLink": "https://www.nature.com/articles/d41586-023-03635-w",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38386547",
    "commentBody": "",
    "originSummary": [
      "تم العثور على النموذج الذكاء الاصطناعي ChatGPT قادرا على توليد مجموعات بيانات علمية مزيفة ، وفقا للباحثين.",
      "في دراسة حديثة ، أساءت البيانات التي تم إنشاؤها الذكاء الاصطناعي تمثيل فعالية الإجراءات الجراحية المختلفة لحالة العين.",
      "وقد أثيرت مخاوف بشأن التهديد المحتمل لنزاهة البحوث الذي تشكله قدرة الذكاء الاصطناعي على إنتاج مجموعات بيانات مقنعة ولكنها مزيفة. يدرس الباحثون ومحررو المجلات الحاجة إلى فحوصات جودة محدثة لتحديد البيانات التركيبية التي تم إنشاؤها الذكاء الاصطناعي."
    ],
    "commentSummary": [
      "أثيرت مخاوف بشأن استخدام ChatGPT ونماذج اللغة الأخرى لإنشاء بيانات مزيفة للبحث العلمي.",
      "تجدر الإشارة إلى أن تلفيق البيانات ليس حكرا على الذكاء الاصطناعي ويمكن القيام به من خلال طرق بسيطة مثل الأرقام العشوائية.",
      "يجب أن يكون التركيز على قابلية التكرار ومعالجة العيوب في الثقافة الأكاديمية لضمان نزاهة البحث.",
      "المناقشات جارية بشأن العواقب والتطبيقات المحتملة لتوليد بيانات مزيفة والشكوك المحيطة بنماذج اللغة.",
      "التقييم النقدي واليقظة في البحث العلمي أمران حاسمان ، حيث توجد إمكانية لإساءة استخدام أدوات الذكاء الاصطناعي.",
      "وتشمل المناقشات أيضا القيود المفروضة على نماذج اللغة، ونقل المعرفة من خلال التعليم، وأزمة التكرار في الأوساط الأكاديمية، والتحديات والعيوب الموجودة في المجتمع العلمي."
    ],
    "points": 166,
    "commentCount": 113,
    "retryCount": 0,
    "time": 1700694694
  }
]
