[
  {
    "id": 38291427,
    "title": "Sinyal: Memprioritaskan Privasi dengan Sumber Daya Terbatas",
    "originLink": "https://signal.org/blog/signal-is-expensive/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38291427",
    "commentBody": "",
    "originSummary": [
      "Signal, sebuah aplikasi perpesanan nirlaba, memprioritaskan privasi dan perlindungan data, tetapi menghadapi biaya tinggi dalam memelihara infrastrukturnya.",
      "Aplikasi ini berinvestasi dalam penelitian dan pengembangan untuk meningkatkan fitur privasi dan memastikan keamanan pengguna, tetapi tidak memiliki sumber daya keuangan seperti perusahaan teknologi besar seperti Meta.",
      "Transparansi dan akuntabilitas dalam industri teknologi sangat ditekankan, bersama dengan pentingnya untuk tidak mengumpulkan data sensitif."
    ],
    "commentSummary": [
      "Percakapan tersebut mencakup berbagai topik yang berkaitan dengan Signal, seperti gaji karyawan, masalah privasi, taktik penggalangan dana, pengalaman berdonasi, perbandingan dengan platform pesan lainnya, masalah infrastruktur, dan penggunaan verifikasi SMS.",
      "Pendapat terbagi, dengan beberapa orang mendukung pendekatan Signal dan yang lainnya mengajukan kritik dan menyarankan solusi alternatif.",
      "Diskusi ini juga membahas biaya penggunaan WhatsApp, kekhawatiran tentang anonimitas, dan kemungkinan protokol pesan universal."
    ],
    "points": 971,
    "commentCount": 749,
    "retryCount": 0,
    "time": 1700151490
  },
  {
    "id": 38293082,
    "title": "Apple akan Mendukung RCS pada iPhone pada tahun 2022",
    "originLink": "https://9to5mac.com/2023/11/16/apple-rcs-coming-to-iphone/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38293082",
    "commentBody": "",
    "originSummary": [
      "Apple telah mengumumkan bahwa dukungan RCS akan hadir untuk iPhone dalam waktu dekat.",
      "RCS, atau Rich Communication Services, menawarkan fitur perpesanan tingkat lanjut seperti indikator pengetikan, tanda terima baca, dan obrolan grup.",
      "Langkah Apple ini akan meningkatkan pengalaman perpesanan bagi pengguna iPhone dan membawa mereka lebih dekat ke fitur yang setara dengan pengguna Android yang telah memiliki dukungan RCS."
    ],
    "commentSummary": [
      "Pengumuman Apple tentang dukungan pesan RCS pada iPhone telah memicu percakapan tentang dampaknya terhadap Google dan ekosistem pesan.",
      "Tidak adanya enkripsi end-to-end dalam RCS ditekankan, serta keterbatasan integrasi pesan antara iOS dan Android.",
      "Perdebatan ini mencakup kontrol Apple atas platformnya, peran Google dalam RCS, dan perlunya solusi perpesanan alternatif. Kekhawatiran privasi, tantangan kompatibilitas, dan dominasi platform perpesanan tertentu muncul secara menonjol dalam diskusi."
    ],
    "points": 649,
    "commentCount": 590,
    "retryCount": 0,
    "time": 1700157894
  },
  {
    "id": 38292915,
    "title": "Gantungan Mantel: Gantungan Mantel yang Dapat Dilipat untuk Memaksimalkan Ruang",
    "originLink": "https://www.youtube.com/watch?v=vREokZa4dNU",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38292915",
    "commentBody": "",
    "originSummary": [
      "Seseorang telah menciptakan gantungan mantel yang dapat dilipat yang disebut Coat Hinger, yang dirancang untuk muat di ruang yang tidak bisa ditampung oleh gantungan biasa.",
      "Mereka telah meluncurkan kampanye Kickstarter untuk mendanai produk mereka dan berbagi rincian tentang berbagai versi desain dan bahan yang digunakan.",
      "Individu membahas tantangan dalam menjalankan bisnis produk dan menekankan pentingnya dukungan."
    ],
    "commentSummary": [
      "Para peserta terlibat dalam percakapan yang luas tentang gantungan baju, penyimpanan pakaian, manufaktur, kekayaan intelektual, dan pengalaman pribadi.",
      "Topiknya meliputi aksesibilitas dan biaya DIY versus membeli, harga dan kualitas barang yang disesuaikan, keberhasilan desain baru, solusi alternatif untuk menggantung pakaian, dan preferensi pribadi untuk gantungan baju dan sistem penyimpanan.",
      "Percakapan tersebut juga secara singkat menyinggung topik-topik yang tidak terkait seperti tumor otak, organisasi pakaian, kemampuan manufaktur Tiongkok, dan ketergantungan pada tenaga kerja non-Barat."
    ],
    "points": 601,
    "commentCount": 200,
    "retryCount": 0,
    "time": 1700157175
  },
  {
    "id": 38290145,
    "title": "Rintangan Terakhir: Menyelesaikan Fungsi printk() Asinkron untuk Integrasi Linux Realtime",
    "originLink": "https://lwn.net/SubscriberLink/951337/e9139cdb65a9cb93/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38290145",
    "commentBody": "",
    "originSummary": [
      "Dukungan realtime untuk kernel Linux sedang dikembangkan tetapi menghadapi kendala utama dengan fungsi printk() sinkron saat ini yang menyebabkan penundaan.",
      "Para pengembang secara aktif bekerja untuk membuat keluaran printk() menjadi asinkron untuk menyelesaikan masalah ini.",
      "Setelah masalah printk() diatasi, kode preemption realtime yang tersisa dapat diintegrasikan ke dalam kernel Linux untuk menyelesaikan proyek ini sebelum akhir tahun 2024."
    ],
    "commentSummary": [
      "Diskusi berkisar pada tantangan yang dihadapi oleh sistem operasi real-time (RTOS) dalam mencapai kemampuan real-time.",
      "Berbagai sistem operasi seperti QNX, Linux, dan seL4 dibandingkan dalam hal kekuatan dan kelemahannya dalam aplikasi real-time.",
      "Topik lainnya termasuk kombinasi perangkat keras-perangkat lunak, penjadwalan beban kerja, tenggat waktu pemrosesan, pencatatan dalam penyebaran sistem, trade-off dalam pengiriman log, dan kesulitan dalam mencapai kinerja waktu nyata dalam sistem perangkat keras yang kompleks."
    ],
    "points": 419,
    "commentCount": 224,
    "retryCount": 0,
    "time": 1700146022
  },
  {
    "id": 38297805,
    "title": "Kauai Memimpin dengan Jaringan Listrik Milik Publik untuk Energi Bersih",
    "originLink": "https://www.canarymedia.com/articles/clean-energy/portugal-just-ran-on-100-renewables-for-six-days-in-a-row",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38297805",
    "commentBody": "",
    "originSummary": [
      "Kauai memimpin dalam hal energi bersih dengan menggunakan jaringan listrik milik publik.",
      "Pulau ini telah membuat kemajuan yang signifikan dalam transisi ke sumber energi terbarukan.",
      "Penggunaan jaringan listrik milik publik memungkinkan kontrol yang lebih besar terhadap proses pembangkitan dan distribusi energi, sehingga menghasilkan solusi yang lebih berkelanjutan dan hemat biaya."
    ],
    "commentSummary": [
      "Diskusi ini membahas berbagai aspek energi terbarukan, termasuk tantangan dan keuntungan dari peralihan ke energi terbarukan.",
      "Kekhawatiran tentang tenaga nuklir dan limbahnya, serta biaya dan kelayakan sumber energi terbarukan, juga dieksplorasi.",
      "Percakapan ini menyoroti negara-negara tertentu seperti Portugal dan Jerman dan kemajuan mereka dalam mengadopsi energi terbarukan, sambil mengakui perlunya energi terbarukan untuk memerangi perubahan iklim, tetapi juga mengakui kompleksitas dan keterbatasan jika hanya mengandalkan energi terbarukan."
    ],
    "points": 289,
    "commentCount": 211,
    "retryCount": 0,
    "time": 1700182171
  },
  {
    "id": 38291015,
    "title": "Swedia Akan Bangun Reaktor Nuklir Baru, Berbagi Biaya pada 2035",
    "originLink": "https://www.reuters.com/business/energy/sweden-plans-new-nuclear-reactors-by-2035-can-take-costs-2023-11-16/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38291015",
    "commentBody": "",
    "originSummary": [
      "Pemerintah Swedia membalikkan sikap sebelumnya untuk menghapus tenaga nuklir dengan merencanakan untuk membangun dua reaktor baru pada tahun 2035 dan total 10 reaktor pada tahun 2045 untuk memenuhi permintaan tenaga bersih yang terus meningkat.",
      "Pemerintah menawarkan jaminan pinjaman dan pembagian biaya untuk mendorong investasi sektor swasta dalam proyek-proyek nuklir ini, dengan perusahaan-perusahaan milik negara seperti Vattenfall, Fortum, dan Uniper yang telah menyatakan minatnya.",
      "Keputusan ini didorong oleh proyeksi pemerintah bahwa permintaan listrik akan meningkat dua kali lipat pada tahun 2045 seiring dengan transisi menuju masyarakat bebas fosil."
    ],
    "commentSummary": [
      "Swedia berencana membangun 10 reaktor nuklir baru pada tahun 2045, dengan reaktor nuklir pertama diharapkan beroperasi pada tahun 2035.",
      "Model pendanaan untuk proyek ini masih belum diputuskan, memicu perdebatan yang sedang berlangsung mengenai kelebihan dan kekurangan tenaga nuklir dibandingkan dengan sumber energi terbarukan seperti angin dan matahari.",
      "Meskipun energi surya dan angin mengalami pertumbuhan pada tahun 2021, ada beberapa keterbatasan seperti kesesuaiannya dengan iklim Nordik dan kebutuhan akan penyimpanan daya yang terjangkau dan efisien.",
      "Diskusi ini juga membahas kapasitas penyimpanan baterai, kelayakan tenaga surya dan angin untuk menggantikan energi nuklir, serta keamanan dan kredibilitas tenaga nuklir dibandingkan dengan sumber-sumber lainnya.",
      "Kekhawatiran muncul terkait biaya, pembuangan limbah, dan masalah keamanan energi nuklir, sementara para pendukung menyoroti stabilitas dan emisi radiasi yang lebih rendah.",
      "Subsidi pemerintah, batas kewajiban, dan masa depan sumber energi juga menjadi topik diskusi."
    ],
    "points": 286,
    "commentCount": 343,
    "retryCount": 0,
    "time": 1700149738
  },
  {
    "id": 38290613,
    "title": "Mengungkap Nomor Telepon: Kelemahan dalam Opsi Pengaturan Ulang Kata Sandi (2019)",
    "originLink": "https://www.martinvigo.com/email2phonenumber/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38290613",
    "commentBody": "",
    "originSummary": [
      "Penelitian penulis berfokus pada kelemahan pada opsi pengaturan ulang kata sandi, khususnya mengenai pengungkapan nomor telepon.",
      "Situs web bervariasi dalam hal jumlah digit nomor telepon pengguna yang mereka tampilkan selama proses pengaturan ulang kata sandi.",
      "Bocoran informasi dari berbagai platform dapat membantu mempersempit nomor telepon seseorang, dan penulis melakukan penelitian tentang pertukaran nomor telepon untuk mempersempit kemungkinan.",
      "National Pooling Administration berperan dalam mengelola nomor telepon.",
      "Artikel ini menjelaskan sebuah metode untuk mendapatkan nomor telepon seseorang berdasarkan alamat email mereka dan menyoroti ketersediaan opsi pengaturan ulang kata sandi menggunakan nomor telepon.",
      "Penulis mengembangkan sebuah alat untuk mengotomatiskan proses mendapatkan nomor telepon dari email dan mendemonstrasikan bagaimana alat ini dapat digunakan untuk mereset kata sandi pada situs web populer.",
      "Artikel tersebut menyebutkan sebuah layanan online bernama phonerator yang menghasilkan daftar kemungkinan nomor telepon berdasarkan data publik yang terkait dengan rencana penomoran telepon suatu negara.",
      "Kekhawatiran akan terungkapnya informasi pribadi melalui nomor telepon, dan potensi vektor serangan dibahas.",
      "Solusi untuk privasi dan keamanan yang lebih baik diusulkan, termasuk memungkinkan pengguna untuk mengatur label untuk informasi kontak mereka dan menggunakan nomor virtual atau kartu SIM khusus.",
      "Pengungkapan yang bertanggung jawab ditekankan, dan penulis menyebutkan upaya mereka untuk mengatasi masalah dengan layanan online.",
      "Penelitian penulis telah dipresentasikan di berbagai konferensi, dan mereka adalah seorang Red Teamer dan peneliti keamanan siber."
    ],
    "commentSummary": [
      "Artikel ini mencakup berbagai topik yang berkaitan dengan keamanan online, intelijen sumber terbuka, identifikasi nomor telepon, dan pertimbangan etika.",
      "Ini membahas strategi untuk meningkatkan keamanan online dan keterbatasan eSIM pada iPhone.",
      "Artikel ini juga membahas dampak alat keamanan siber dan pengungkapan yang bertanggung jawab, penggunaan negatif dari alat penghasil email ke nomor telepon, kelemahan sistem ID nasional, dan kerentanan keamanan dalam opsi pengaturan ulang kata sandi di situs web."
    ],
    "points": 277,
    "commentCount": 107,
    "retryCount": 0,
    "time": 1700148052
  },
  {
    "id": 38297203,
    "title": "Departemen Kehakiman Memberi Lampu Hijau pada Gugatan Antimonopoli Terhadap RealPage",
    "originLink": "https://www.wsj.com/us-news/law/justice-department-clears-the-way-for-collusion-suit-against-apartment-owners-e545f260",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38297203",
    "commentBody": "",
    "originSummary": [
      "Departemen Kehakiman AS telah memberikan lampu hijau untuk gugatan terhadap RealPage, sebuah perusahaan perangkat lunak real estate yang dituduh memanipulasi harga sewa secara tidak sah.",
      "Penyewa menuduh bahwa RealPage dan pemilik properti yang menggunakan sistem penetapan harga algoritmiknya melanggar undang-undang antimonopoli dan menyebabkan kenaikan harga sewa.",
      "Gugatan tersebut mengklaim bahwa praktik RealPage mengakibatkan biaya sewa yang lebih tinggi bagi penyewa."
    ],
    "commentSummary": [
      "Departemen Kehakiman telah menyetujui gugatan kolusi terhadap pemilik apartemen yang diduga telah menggunakan perangkat lunak untuk mengkoordinasikan harga sewa, yang menyebabkan biaya sewa yang lebih tinggi.",
      "Diskusi ini mengeksplorasi taktik yang digunakan oleh tuan tanah untuk mempertahankan harga sewa dan tingkat hunian yang tinggi di pasar perumahan yang sangat diminati, dan dampak dari pembangunan gedung baru terhadap harga sewa.",
      "Legalitas penggunaan perangkat lunak untuk menetapkan harga tanpa koordinasi eksplisit, kebutuhan untuk reparasi, dan potensi perubahan transformatif dalam sistem perumahan masih diperdebatkan, bersama dengan peran perusahaan perangkat lunak dalam kolusi dan konsep kepemilikan pribadi."
    ],
    "points": 265,
    "commentCount": 174,
    "retryCount": 0,
    "time": 1700177727
  },
  {
    "id": 38294569,
    "title": "Transisi ke Bare-Metal Menghemat Perusahaan $230.000 per Tahun",
    "originLink": "https://blog.oneuptime.com/moving-from-aws-to-bare-metal/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38294569",
    "commentBody": "",
    "originSummary": [
      "Perusahaan menghemat lebih dari $230.000 per tahun dengan mengalihkan infrastrukturnya dari AWS ke solusi bare-metal.",
      "Langkah ini dimotivasi oleh kebutuhan perusahaan untuk tidak bergantung pada cloud publik, karena layanan mereka melibatkan pemberitahuan kepada pelanggan ketika cloud publik mengalami downtime.",
      "Mereka menggunakan Kubernetes, Helm, NFS, dan MetalLB untuk mengelola aplikasi, penyimpanan, dan penyeimbangan beban pada peladen mereka sendiri untuk kontrol yang lebih besar atas sumber daya dan untuk menghilangkan masalah yang dialami dalam lingkungan hosting bersama."
    ],
    "commentSummary": [
      "Diskusi ini membahas biaya dan manfaat menggunakan layanan cloud seperti AWS dibandingkan dengan mengelola server lokal untuk manajemen infrastruktur.",
      "Beberapa komentator menganjurkan server bare metal, mengutip potensi penghematan biaya dan kontrol perangkat keras, sementara yang lain menekankan kenyamanan dan skalabilitas penyedia cloud.",
      "Percakapan ini juga membahas tantangan dan pertimbangan pemulihan bencana, pentingnya keahlian dalam mengoperasikan layanan cloud, dan isu-isu yang berkaitan dengan gaji yang tinggi dan persyaratan pekerjaan di industri teknologi."
    ],
    "points": 253,
    "commentCount": 304,
    "retryCount": 0,
    "time": 1700164499
  },
  {
    "id": 38298918,
    "title": "Windows 11 untuk Mematuhi Undang-Undang Pasar Digital Komisi Eropa",
    "originLink": "https://arstechnica.com/gadgets/2023/11/europeans-can-soon-strip-bing-edge-other-microsoft-cruft-from-windows-11/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38298918",
    "commentBody": "",
    "originSummary": [
      "Microsoft memperbarui Windows 11 untuk mematuhi Undang-Undang Pasar Digital Komisi Eropa, yang bertujuan untuk meningkatkan persaingan dan pilihan pengguna.",
      "Pengguna di Wilayah Ekonomi Eropa (EEA) yang diperluas akan dapat menghapus aplikasi Microsoft tertentu, dengan mudah mengubah pengaturan default, dan menghindari permintaan untuk menggunakan layanan Microsoft.",
      "Perubahan ini akan diluncurkan dalam pembaruan pratinjau Windows 11 bulan ini dan juga akan diimplementasikan di Windows 10 di kemudian hari. Perusahaan teknologi besar lainnya seperti Google dan Apple juga akan terkena dampak dari Digital Markets Act."
    ],
    "commentSummary": [
      "Diskusi ini mencakup berbagai topik yang berkaitan dengan sistem operasi, termasuk kritik terhadap Windows 11 dan macOS, perdebatan tentang privasi dan perlindungan data, dan perbandingan antara Linux dan sistem lainnya.",
      "Pengguna mengungkapkan preferensi untuk Linux dan Mac, mendiskusikan opsi penyesuaian dan menyebutkan masalah yang terkait dengan pengaturan keamanan, navigasi file, permainan, dan manajemen perangkat lunak.",
      "Diskusi ini juga mencakup kekecewaan terhadap aplikasi yang sudah terinstal dan fitur-fitur yang tidak perlu, diskusi tentang persetujuan cookie dan akses situs web, serta kekhawatiran tentang perilaku dan keterbatasan sistem operasi yang berbeda."
    ],
    "points": 243,
    "commentCount": 266,
    "retryCount": 0,
    "time": 1700190190
  },
  {
    "id": 38292553,
    "title": "Bermigrasi ke OpenTelemetry: Meningkatkan Keandalan Data dan Efisiensi Biaya",
    "originLink": "https://www.airplane.dev/blog/migrating-to-opentelemetry",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38292553",
    "commentBody": "",
    "originSummary": [
      "Airplane telah berhasil memigrasikan sebagian besar pembuatan dan pengumpulan datanya ke standar OpenTelemetry (OTel).",
      "Migrasi ke OTel telah meningkatkan keandalan data, konektivitas dengan berbagai vendor, dan pemantauan biaya.",
      "OTel adalah seperangkat standar dan alat yang bersifat vendor-agnostik untuk memproses data pengamatan dan menyediakan dukungan pustaka untuk berbagai bahasa pemrograman."
    ],
    "commentSummary": [
      "Artikel ini membahas pro dan kontra penggunaan solusi pengamatan tunggal versus beberapa solusi untuk pengumpulan dan analisis data.",
      "OpenTelemetry diperkenalkan sebagai solusi potensial untuk menghindari penguncian vendor, dan SigNoz disorot sebagai produk yang menawarkan metrik, jejak, dan log dalam satu aplikasi menggunakan OpenTelemetry.",
      "Kompleksitas dan keterbatasan solusi pemantauan dan penelusuran di industri dibahas, termasuk frustrasi dengan biaya dan keterbatasan DataDog dan saran untuk alat alternatif. Manfaat konsolidasi alat pengamatan dari vendor yang berbeda juga diperdebatkan. Namun, keterbatasan OpenTelemetry dibandingkan dengan alat lain seperti APM juga disebutkan."
    ],
    "points": 227,
    "commentCount": 58,
    "retryCount": 0,
    "time": 1700155747
  },
  {
    "id": 38291452,
    "title": "Komunitas Hacker News Mendorong Perubahan Karier yang Mengubah Hidup",
    "originLink": "https://news.ycombinator.com/item?id=38291452",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38291452",
    "commentBody": "",
    "originSummary": [
      "Penulis berterima kasih kepada komunitas Hacker News atas dukungan dan umpan balik mereka terhadap proyek sampingan mereka.",
      "Mereka telah berhenti dari pekerjaan sehari-hari untuk mengejar proyek penuh waktu setelah mendapatkan 2.500 pelanggan berbayar.",
      "Penulis memuji komunitas Hacker News yang memungkinkan perubahan karier ini melalui dorongan dan dukungan mereka."
    ],
    "commentSummary": [
      "Artikel asli dan diskusi selanjutnya di Hacker News berfokus pada alat perencanaan keuangan yang direkomendasikan oleh penulis.",
      "Penulis mengucapkan terima kasih kepada komunitas atas dukungan mereka dan memuji keberhasilan mereka.",
      "Komentar lainnya mencakup tantangan, dukungan komunitas, masalah umpan data, opsi hosting mandiri, model lisensi, dan pertumbuhan pribadi dalam pengembangan web."
    ],
    "points": 226,
    "commentCount": 48,
    "retryCount": 0,
    "time": 1700151648
  },
  {
    "id": 38288980,
    "title": "Teknik pemindaian laser baru memungkinkan pencetakan 3D robot dengan tulang, ligamen, dan tendon",
    "originLink": "https://ethz.ch/en/news-and-events/eth-news/news/2023/11/printed-robots-with-bones-ligaments-and-tendons.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38288980",
    "commentBody": "",
    "originSummary": [
      "Para peneliti di ETH Zurich dan sebuah perusahaan rintisan di Amerika Serikat telah mengembangkan teknik pemindaian laser untuk robot cetak 3D dengan tulang, ligamen, dan tendon yang terbuat dari polimer yang berbeda.",
      "Polimer yang lambat mengering memungkinkan peningkatan sifat elastis dan daya tahan yang lebih baik, sehingga memperluas kemungkinan robotika lunak.",
      "Teknologi baru ini memungkinkan kombinasi bahan yang lembut, elastis, dan kaku, serta penciptaan struktur dan bagian yang halus dengan rongga. Para peneliti dan perusahaan rintisan ini berencana untuk menawarkan layanan pencetakan 3D kepada para pelanggan."
    ],
    "commentSummary": [
      "Para peneliti di ETH Zurich telah mengembangkan metode untuk mencetak robot 3D dengan tulang, ligamen, dan tendon, tetapi biaya printer yang tinggi dan persyaratan pemeliharaan telah menghambat adopsi secara luas.",
      "Alternatif yang lebih murah juga tersedia, menyoroti potensi peningkatan aksesibilitas di masa depan.",
      "Diskusi ini mencakup keterbatasan robotika saat ini dibandingkan dengan kemampuan manusia, kemungkinan menciptakan taman hiburan seperti \"Westworld\", pengembangan otot sintetis, dan tantangan pencetakan 3D pada skala protein seluler."
    ],
    "points": 198,
    "commentCount": 40,
    "retryCount": 0,
    "time": 1700139405
  }
]
