[
  {
    "id": 40755444,
    "title": "״המחשב שלי עם Windows פשוט כבר לא מרגיש כמו שלי״",
    "originLink": "https://www.howtogeek.com/my-windows-computer-just-doesnt-feel-like-mine-anymore/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40755444",
    "commentBody": "",
    "originSummary": [
      "ווינדוס הפכה ליותר מסחרית ופחות אישית, עם שילוב פרסומות שגורם לה להרגיש זולה.",
      "עדכונים כפויים ושינויים פולשניים לעיתים קרובות שוברים מערכות ומשנים הגדרות משתמש ללא הסכמה, מה שמשפיע על האמינות וחוויית המשתמש.",
      "״חלופות כמו macOS ולינוקס זוכות לשבחים על כך שהן נטולות פרסומות ומציעות יותר שליטה למשתמש, אם כי לינוקס יכולה להיות מורכבת.״"
    ],
    "commentSummary": [
      "משתמשים מביעים תסכול מהשליטה הגוברת והתכונות הפולשניות ב-Windows, כמו חוסר היכולת להסיר את 'מומלץ' מתפריט ההתחלה וההודעות המתמשכות של OneDrive.",
      "״תלונות כוללות בעיות כמו חיפושים באינטרנט בתפריט ההתחלה שלא ניתן להשבית, הגדרות דפדפן Edge שמתאפסות, ו-Windows שמתקינה אוטומטית גרסאות ישנות של מנהלי התקנים.״",
      "ישנם משתמשים שמציעים חלופות כמו שימוש בהפצות לינוקס (למשל, Fedora, Linux Mint) או כלים לניהול והפחתת העומס ב-Windows, מה שמדגיש חוסר שביעות רצון גובר מהחוויה הנוכחית של Windows."
    ],
    "points": 589,
    "commentCount": 563,
    "retryCount": 0,
    "time": 1719019764
  },
  {
    "id": 40754229,
    "title": "ארכיון האינטרנט נאלץ להסיר 500 אלף ספרים לאחר ניצחון המו\"לים בבית המשפט",
    "originLink": "https://arstechnica.com/tech-policy/2024/06/internet-archive-forced-to-remove-500000-books-after-publishers-court-win/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40754229",
    "commentBody": "",
    "originSummary": [
      "הארכיון האינטרנטי (IA) נאלץ להסיר 500,000 ספרים לאחר שהפסיד בתביעה למוציאים לאור, מה שמשפיע באופן משמעותי על קוראים שתלויים ב-IA לגישה לספרים נדירים.",
      "״IA מערערת על ההחלטה, בטענה שהשאלת הספרים הדיגיטליים המנוהלת על ידה צריכה להיחשב כשימוש הוגן תחת חוק זכויות היוצרים, תוך הדגשת תפקידן של הספריות במתן גישה לידע.״",
      "מכתב פתוח עם כמעט 19,000 חתימות מדגיש את ההשפעה השלילית על החינוך והקהילות המוחלשות, כאשר תומכי IA מפצירים במוציאים לאור להחזיר את הגישה לספרים שהוסרו."
    ],
    "commentSummary": [
      "הארכיון האינטרנטי (IA) נדרש להסיר 500,000 ספרים לאחר שפסק דין בית המשפט העדיף את המו\"לים, מה שהצית דיון על חוקי זכויות יוצרים.",
      "מבקרים טוענים כי פעולותיה של IA, על אף שהיו מכוונות היטב, היו מסוכנות מבחינה משפטית ויכלו לסכן את הארגון, מה שמדגיש את הצורך ברפורמה בזכויות יוצרים.",
      "המקרה מדגיש את המתח בין שמירה על גישה לידע לבין עמידה בחוקי זכויות היוצרים הנוכחיים, כאשר רבים תומכים באיזון טוב יותר."
    ],
    "points": 482,
    "commentCount": 463,
    "retryCount": 0,
    "time": 1719006834
  },
  {
    "id": 40756176,
    "title": "״השפה היא בראש ובראשונה כלי לתקשורת ולא למחשבה [pdf]״",
    "originLink": "https://gwern.net/doc/psychology/linguistics/2024-fedorenko.pdf",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40756176",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "הלשון משמשת בעיקר ככלי תקשורת, ולא בהכרח כאמצעי לחשיבה.",
      "אנשים מעבדים מחשבות בצורה שונה: יש כאלה שיש להם מונולוגים פנימיים, אחרים מדמיינים מילים, ויש כאלה שחושבים במושגים מופשטים.",
      "מגוון זה בעיבוד המחשבה מאתגר את ההנחה של חוויות קוגניטיביות אחידות ומדגיש את המורכבות של הקוגניציה האנושית."
    ],
    "points": 352,
    "commentCount": 270,
    "retryCount": 0,
    "time": 1719029062
  },
  {
    "id": 40758767,
    "title": "״אחרי שאבא שלי נפטר, ניהלתי ומכרתי את החברה שלו (2018)״",
    "originLink": "https://anandsanwal.me/2018/06/19/dad-company-sale/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40758767",
    "commentBody": "",
    "originSummary": [
      "״לאחר מות אביו, המחבר לקח על עצמו את ניהול חברת ייצור כימיקלים בנאשיק, הודו, תוך כדי ניהול החברה שלו, CB Insights, שהובילה לרכישת אטלס ב-1 ביוני 2018.״",
      "מחבר הספר ניווט את המורכבויות של ניהול עסק שונה לחלוטין, תוך התמקדות בצמיחה באמצעות שיחות קרות ושליחת מיילים ללקוחות פוטנציאליים, מה שהוביל לשנת ההכנסות הטובה ביותר של אטלס ולרכישתה בסופו של דבר על ידי חברה כימית בבעלות משפחתית.",
      "לקחים מרכזיים כללו את החשיבות של מטרות ברורות, פשטות במשא ומתן, והפוטנציאל לצמיחה בסביבה הרגולטורית המאתגרת של הודו, במיוחד עם עלייה בשיעור הנשים בכוח העבודה."
    ],
    "commentSummary": [
      "המחבר דן באתגרים של לקיחת ניהול ומכירת עסק משפחתי לאחר מות הורה, תוך הדגשת החשיבות של תכנון ירושה.",
      "״הנרטיב מדגיש את הקשיים הרגשיים והמעשיים בניהול עסק משפחתי ללא תוכנית ירושה ברורה.״",
      "״הסיפור מדגיש את החשיבות שבמציאת קונה שמעריך את העובדים, ומבטיח את רווחתם לאחר המכירה.״"
    ],
    "points": 324,
    "commentCount": 56,
    "retryCount": 0,
    "time": 1719060558
  },
  {
    "id": 40752761,
    "title": "ברצלונה תבטל דירות תיירות",
    "originLink": "https://www.theolivepress.es/spain-news/2024/06/21/breaking-barcelona-will-remove-all-tourist-apartments-in-2028-in-huge-win-for-anti-tourism-activists/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40752761",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "ברצלונה מתכננת לבטל דירות תיירותיות, במטרה לשחרר כ-10,000 בתים בארבע השנים הקרובות כדי להתמודד עם מחסור הדיור.",
      "מבקרים טוענים כי אמצעי זה אינו מספיק וכי יש צורך בבניית דיור נוספת כדי לעמוד בביקוש, בעוד שאחרים מודאגים מההשפעה הכלכלית על התיירות והעסקים המקומיים.",
      "הוויכוח מדגיש את המתח בין שמירה על דיור בר השגה לתושבים לבין אירוח תיירים."
    ],
    "points": 240,
    "commentCount": 345,
    "retryCount": 0,
    "time": 1718997782
  },
  {
    "id": 40756034,
    "title": "Farm: כלי בניית vite מהיר תואם שנכתב ב-Rust",
    "originLink": "https://www.farmfe.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40756034",
    "commentBody": "",
    "originSummary": [
      "Farm הוא כלי בניית אתרים מבוסס Rust המיועד לפיתוח אתרים מהיר והגדרת ספריות JavaScript, הידוע במהירותו וביעילותו.",
      "״הוא תומך בבנייה הדרגתית עם שמירה במטמון ברמת המודול, קומפילציה של מודולים ששונו בלבד, ומציע תכונות עשירות כולל תמיכה בסוגי קבצים שונים ובמסגרות כמו React ו-Vue.״",
      "״הפלטפורמה ניתנת לחיבור מלא, תואמת לתוספי Vite, ומבטיחה עקביות בין סביבות הפיתוח והייצור, תוך תמיכה בדפדפנים ישנים ומודרניים כאחד.״"
    ],
    "commentSummary": [
      "Farm הוא כלי בנייה חדש שנכתב ב-Rust, תואם ל-Vite, וטוען להפחתה משמעותית בזמני הבנייה.",
      "״משתמשים חלוקים בדעותיהם, כאשר חלקם מודאגים מסיכוני אבטחה פוטנציאליים בשל מקורו הלא-מערבי, בעוד אחרים משבחים את זמני הבנייה המהירים יותר שלו, במיוחד בצינורות אינטגרציה רציפה (CI).״",
      "הדיון כולל השוואות עם כלים אחרים לבניית פרונטאנד כמו ESBuild, Rollup ו-Bun, תוך הדגשת שיפורי ביצועים ודאגות לגבי יציבות ותמיכה באקוסיסטם."
    ],
    "points": 200,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1719027279
  },
  {
    "id": 40757787,
    "title": "״תיקיית קבועים משלך ב-C/C++״",
    "originLink": "https://www.neilhenning.dev/posts/yourownconstantfolder/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40757787",
    "commentBody": "",
    "originSummary": [
      "״שימוש בפונקציה הפנימית `sqrtps` ב-C/C++ עם הדגל `-ffast-math` של clang יכול להוביל לבעיות דיוק מכיוון שהוא מחליף את `sqrtps` ב-`rsqrtps`.״",
      "״הרכבה פנימית יכולה לאכוף את השימוש ב-`sqrtps`, אך היא לא תומכת בקיפול קבוע כאשר הפונקציה מוטמעת.״",
      "״כדי להבטיח גם קיפול קבוע וגם התנהגות נכונה, השתמש ב-`__builtin_constant_p` כדי לבדוק אם הווקטור הוא קבוע ויישם את `_mm_sqrt_ps` בהתאם.״"
    ],
    "commentSummary": [
      "משתמש ב-Hacker News הדגיש חוסר יעילות בפעולות מתמטיות בטוחות-סוג ב-Rust בעת אופטימיזציה של קוד למידת מכונה, במיוחד עם שאריות אוקלידיות הכוללות מספרים בנקודה צפה ומחלקים שלמים.",
      "״המשתמש יצר פונקציה מותאמת אישית לשיפור הביצועים אך נתקל במגבלות עקב מגבלות הסוגים של Rust, מה שמרמז כי תמיכה מהמהדר יכולה להקל על אופטימיזציות כאלה.״",
      "הדיון התרחב לכלול את הפוטנציאל של ארגז ייעודי, את המורכבויות של אופטימיזציות ב-C/C++, ואת החשיבות של הבנת התנהגות המהדר והפשרות באופטימיזציית ביצועים."
    ],
    "points": 132,
    "commentCount": 81,
    "retryCount": 0,
    "time": 1719050825
  },
  {
    "id": 40759277,
    "title": "אנדרו ס. טננבאום מקבל את פרס מערכת התוכנה של ACM",
    "originLink": "https://vu.nl/en/news/2024/andrew-s-tanenbaum-receives-acm-software-system-award",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40759277",
    "commentBody": "",
    "originSummary": [
      "בתאריך 20 ביוני 2024, אנדרו ס. טננבאום קיבל את פרס מערכת התוכנה של ACM על עבודתו על MINIX, מערכת הפעלה מבוססת מיקרו-ליבה UNIX שנוצרה בשנת 1987.",
      "MINIX, בתחילה 12,000 שורות קוד ונעשה קוד פתוח בשנת 2000, השפיע באופן משמעותי על הוראת מערכות הפעלה ועיצוב מערכות כמו לינוקס ו-MeikOS.",
      "הפרס, הנתמך על ידי IBM וכולל פרס כספי של 35,000 דולר, מכיר בהשפעתו של טננבאום על עיצוב מערכות הפעלה, במיוחד בתמיכתו בארכיטקטורת מיקרו-ליבה."
    ],
    "commentSummary": [
      "אנדרו ס. טננבאום קיבל את פרס מערכת התוכנה של ACM, כהוקרה על תרומותיו המשמעותיות לחינוך במדעי המחשב ולמערכות תוכנה.",
      "תננבאום ידוע בזכות ספרי הלימוד המשפיעים שלו, כגון \"רשתות מחשבים\" ו\"מערכות הפעלה מודרניות\", אשר סייעו לסטודנטים ואנשי מקצוע רבים להבין נושאים מורכבים.",
      "יצירתו, MINIX, מערכת הפעלה דמוית Unix, ידועה בשימוש שלה במנוע הניהול של מעבדי אינטל, מה שמדגיש את השפעתה הנרחבת."
    ],
    "points": 102,
    "commentCount": 18,
    "retryCount": 0,
    "time": 1719065522
  },
  {
    "id": 40759333,
    "title": "HybridNeRF: רינדור נוירוני יעיל",
    "originLink": "https://haithemturki.com/hybrid-nerf/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40759333",
    "commentBody": "",
    "originSummary": [
      "HybridNeRF, שיטת רינדור עצבית חדשה, משלבת רינדור שטח ונפח כדי לשפר את היעילות והאיכות, במיוחד עבור מבנים חצי-אטומים ודקים.",
      "״השיטה משיגה קצבי פריימים בזמן אמת (36 FPS) ברזולוציות VR (2K×2K) ומשפרת את שיעורי השגיאות ב-15-30% על מערכי נתונים כמו Eyeful Tower ו-ScanNet++.״",
      "HybridNeRF עולה על שיטות קודמות באיכות ובמהירות הרינדור, במיוחד בטיפול באפקטים ספקולריים ובסצנות פנימיות ברזולוציה גבוהה."
    ],
    "commentSummary": [
      "HybridNeRF היא גישה חדשה ברינדור נוירוני, שמטרתה לשפר את היעילות ביצירת סצנות תלת-ממדיות מתמונות דו-ממדיות.",
      "דיון זה מדגיש את האתגרים וההתקדמויות הפוטנציאליות בשדות קרינה עצבית (NeRF), כולל דיוק מיקום המצלמה ושלבי עיבוד מקדימים כמו מבנה מתנועה (SfM).",
      "הפוסט עורר עניין בשל האפשרות לשחרור הקוד וההתרגשות סביב כיווני מחקר עתידיים, במיוחד בהקשר של ביטול דרישות עיבוד מקדים מסורתיות."
    ],
    "points": 101,
    "commentCount": 21,
    "retryCount": 0,
    "time": 1719066081
  },
  {
    "id": 40752721,
    "title": "TSMC מתנסה בפרוסות מלבניות לעומת עגולות כדי להפיק יותר שבבים לכל פרוסה",
    "originLink": "https://asia.nikkei.com/Business/Tech/Semiconductors/TSMC-explores-radical-new-chip-packaging-approach-to-feed-AI-boom",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40752721",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "TSMC בודקת פרוסות מלבניות כדי להגדיל את תפוקת השבבים ולהפחית את הפסולת מקצוות הפרוסות העגולות המסורתיות בקוטר 300 מ\"מ.",
      "״התעשייה הסתמכה על פרוסות עגולות בקוטר 300 מ\"מ במשך 25 שנים, מה שהופך את המעבר לפרוסות מלבניות למאתגר בשל הציוד והתקנים הקיימים.״",
      "Apple ו-Nvidia משלמות מראש ל-TSMC, מה שעוזר בהוצאות ההון, והמעבר עשוי לפשט את תהליכי הליתוגרפיה ולהפחית את הלחץ על חלקי השבבים, למרות מכשולים טכניים ולוגיסטיים משמעותיים."
    ],
    "points": 99,
    "commentCount": 83,
    "retryCount": 0,
    "time": 1718997461
  },
  {
    "id": 40755528,
    "title": "OWASP Juice Shop: פריצה לאפליקציית ווב מודרנית",
    "originLink": "https://blog.javascripttoday.com/blog/hacking-a-web-application/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40755528",
    "commentBody": "",
    "originSummary": [
      "מאמר זה דן בפריצה ל-OWASP Juice Shop, יישום אינטרנט לא מאובטח שנועד לעזור למפתחים ובודקי חדירות לתרגל את כישוריהם.",
      "זה מתמקד בביצוע התקפת Cross-Site Scripting (XSS) משתקפת על ידי הזרקת קוד זדוני לתוך שורת החיפוש, תוך הדגשת הצורך בניקוי קלט המשתמש.",
      "״משאבים כמו TryHackMe ו-The Web Application Hacker’s Handbook מומלצים ללמידה נוספת, עם תזכורת שהאקינג אתי צריך להיות אך ורק למטרות חינוכיות.״"
    ],
    "commentSummary": [
      "OWASP Juice Shop מודגש ככלי חינוכי ללמידה על פרצות באפליקציות ווב באמצעות פורמט של תחרות לכידת הדגל.",
      "המאמר קיבל משוב מעורב, כאשר חלק שיבחו את ערכו החינוכי ואחרים ביקרו את איכותו ואת נוכחות הפרסומות בו.",
      "״הדיון כולל הצעות לשיפור סגנון הכתיבה ולהפחתת הסחות דעת כמו פרסומות כדי לשפר את הקריאות.״"
    ],
    "points": 93,
    "commentCount": 14,
    "retryCount": 0,
    "time": 1719020932
  },
  {
    "id": 40760042,
    "title": "עובדים יצירתיים ראויים ליותר מאשר בחירה מי ירמה אותם",
    "originLink": "https://pluralistic.net/2024/06/21/off-the-menu/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40760042",
    "commentBody": "",
    "originSummary": [
      "מודל התשלום של ספוטיפיי מיטיב עם חברות התקליטים הגדולות (יוניברסל, וורנר, סוני) בעלות אחזקות משמעותיות ותשלומים חודשיים מינימליים, שלעיתים קרובות אינם משותפים עם האמנים, מה שמוביל לרווחים נמוכים לאמנים למרות רווחים גבוהים של חברות התקליטים.",
      "עובדים יצירתיים מודאגים מכך שבינה מלאכותית תבטל משרות, עם תביעות משפטיות מחברות כמו הניו יורק טיימס וגטי אימג'ס נגד אימון בינה מלאכותית שעלולות לפגוע בשימוש הוגן. הפתרון האמיתי נראה בזכויות עובדים ובארגון ולא בהגברת זכויות היוצרים.",
      "הופעות קרובות כוללות את פרסי לוקוס (וירטואלי ובאוקלנד), HOPE XV בקווינס, ניו יורק, ונאומים מרכזיים בשיקגו עבור Exile in Bookville ואיגוד הספריות המשפטיות האמריקאי."
    ],
    "commentSummary": [
      "מאמר זה מדגיש את חוסר האיזון הכלכלי שבו היוצרים מקבלים חלק קטן מהרווחים, בעוד שהמתווכים לוקחים את הרוב.",
      "זה מציע שיוצרים יתאחדו וינהלו משא ומתן באופן קולקטיבי, במיוחד בתעשיות עם אוליגופולים חזקים, כמו מוזיקה.",
      "״הדיון כולל האם היצירתיות מוערכת פחות על ידי השוק ואת ההשפעה של פרקטיקות מונופוליסטיות, כאשר יש הטוענים שטכנולוגיה ופלטפורמות מעצבות באופן משמעותי את הכלכלה היצירתית.״"
    ],
    "points": 91,
    "commentCount": 82,
    "retryCount": 0,
    "time": 1719072488
  },
  {
    "id": 40755688,
    "title": "״סיפור רביעי (1995)״",
    "originLink": "https://groups.google.com/g/comp.lang.forth/c/ThWiGXwKqv4",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40755688",
    "commentBody": "",
    "originSummary": [
      "אלן צ'קוריץ', בוגר פיזיקה, התחיל את הקריירה שלו בשנת 1975 בתעשיות MDH, ועבד על מדידת תכולת גופרית בפחם באמצעות קליפורניום 252 ובתחילה השתמש בפורטרן לסימולציות.",
      "הוא אימץ מאוחר יותר את שפת התכנות Forth, למרות בלבול ראשוני, והשתמש בה לפיתוח אבטיפוס של מד גופרית, תוך שהוא מתמודד עם התנגדות מצד עמיתים שראו ב-Forth כשפה לא שגרתית.",
      "״למרות העוצמה והיעילות של פורט', מעמדו הנישתי והעדפת התעשייה לשפות תכנות מיינסטרים הגבילו את אימוצו, מה שהוביל את צ'קוריץ' להפסיק לתכנת בסופו של דבר.״"
    ],
    "commentSummary": [
      "מעבד NOVIX 2000 של צ'אק מור, המבוסס על Forth, השתמש בשתי מחסניות וביצע מספר הוראות בכל מחזור שעון עם מינימום שערים, מה שהציג ארכיטקטורת מעבד חלופית.",
      "״השבב GA144, בהשראת שפת Forth, הוא מינימליסטי ויכול להחליף מערכות על שבב (SoCs) עם גמישות רבה יותר ושימוש נמוך יותר באנרגיה, אם כי ייתכן שיהיה מאתגר להשתמש בו ללא ספריות היקפיות נפוצות.״",
      "״הפשטות של פורט' מאפשרת יצירה מהירה ואישית אך יכולה להיות לא סטנדרטית וקשה להבנה, מה שהופך אותה לפחות מאומצת על ידי צוותים למרות עוצמתה.״"
    ],
    "points": 86,
    "commentCount": 17,
    "retryCount": 0,
    "time": 1719023174
  }
]
