[
  {
    "id": 37534615,
    "title": "هوركروكس: قسم ملفك إلى أجزاء مشفرة",
    "originLink": "https://github.com/jesseduffield/horcrux",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37534615",
    "commentBody": "",
    "originSummary": [
      "Horcrux هي أداة مفتوحة المصدر تقسم الملف إلى أقسام مشفرة ، مما يلغي حاجة المستخدمين إلى استدعاء رمز مرور لتأمين التخزين الموزع.",
      "تعمل هذه التقنية على مخطط شامير للمشاركة السرية ، الذي يجزئ مفتاح التشفير بطريقة لا يمكن إلا لعدد محدد مسبقا من الأجزاء إعادة بنائه.",
      "تخدم الأداة جمهورا معينا يتعين عليه تشفير الملفات الكبيرة والحساسة ونشرها عبر عدة قنوات لتقليل مخاطر الاعتراض."
    ],
    "commentSummary": [
      "تتمحور المناقشة حول العديد من أدوات وتقنيات التشفير مثل Horcrux و Shamir Secret Sharing (SSS) ومصادقة HTTP الأساسية وعينات متعددة الحدود والنقل الغافل (OT).",
      "تتناول المحادثة على نطاق واسع القيود والمخاوف الأمنية وحالات الاستخدام المحتملة لهذه الأدوات ، مما يؤكد الحاجة إلى التحسينات وإمكانية وصول المستخدم.",
      "كما تم دمج بعض الموضوعات غير ذات الصلة ، مثل هاري بوتر ، ووجهات نظر جي كي رولينغ السياسية ، وحقوق المتحولين جنسيا ، لفترة وجيزة في المناقشة."
    ],
    "points": 459,
    "commentCount": 124,
    "retryCount": 0,
    "time": 1694871108
  },
  {
    "id": 37535537,
    "title": "علاج التليف الكيسي يفوز بجائزة الاختراق",
    "originLink": "https://www.nature.com/articles/d41586-023-02890-1",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37535537",
    "commentBody": "",
    "originSummary": [
      "حصل Trikafta ، وهو مزيج ثلاثي الأدوية طورته شركة Vertex Pharmaceuticals ، على جائزة Breakthrough بقيمة 3 ملايين دولار لتسليط الضوء على فعاليته في علاج التليف الكيسي ، وهو اضطراب وراثي شديد.",
      "يعمل العلاج المركب على تحسين نوعية حياة المرضى وتعزيز متوسط العمر المتوقع من خلال استهداف بروتين مشوه لدى المصابين بالتليف الكيسي.",
      "كما اعترفت جوائز الاختراق بإنجازات أخرى مثل الاكتشافات المتعلقة بمرض باركنسون وعلاجات السرطان والنظريات الرياضية."
    ],
    "commentSummary": [
      "تدور المناقشات حول الموضوعات الطبية الرئيسية مثل الفوائد والآثار الجانبية للعلاجات الرائدة للتليف الكيسي (CF) ، والمناقشات الحالية حول تمويل أبحاث التليف الكيسي ، والتكلفة العالية وإمكانية الوصول إلى أدوية التليف الكيسي.",
      "يلتقط الملخص الحوار حول الآثار الأخلاقية للفحص الجيني واختيار الأجنة أثناء التعامل مع متلازمة داون ، ويقدم نظرة ثاقبة للأسئلة الأخلاقية المعقدة في البحوث الطبية.",
      "تتعمق المحادثة أيضا في القضية العامة للنفقات الكبيرة المتعلقة بأدوية أمراض معينة ، مما يشير إلى مخاوف الربحية بشأن صناعة الأدوية الصيدلانية."
    ],
    "points": 300,
    "commentCount": 136,
    "retryCount": 0,
    "time": 1694877526
  },
  {
    "id": 37538333,
    "title": "جافا 21 يجعلني مثل جافا مرة أخرى",
    "originLink": "https://wscp.dev/posts/tech/java-pattern-matching/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37538333",
    "commentBody": "",
    "originSummary": [
      "تهدف Java 21 ، المقرر إطلاقها في سبتمبر 2023 ، إلى جلب أنماط التسجيل إلى كتل التبديل والتعبيرات ، وبالتالي تمكين أنماط البرمجة الوظيفية في Java.",
      "تتضمن الميزات التي تمت مناقشتها أنواع المنتجات ذات الصلة بفئة سجل Java ، ومزايا أنماط التبديل والفئات المختومة من Java 17 ، بالإضافة إلى مطابقة الأنماط مع الواجهات المختومة وإدخال بنود الحراسة.",
      "تم التأكيد على هذا الإصدار القادم ، وهو Java 21 ، باعتباره تطورا مهما نحو زيادة أدوات Java للبرمجة الوظيفية."
    ],
    "commentSummary": [
      "تتركز المناقشات على عدة جوانب من لغات البرمجة مثل Java و Go و Kotlin و C # ، بما في ذلك الإضافات الجديدة مثل سلاسل الرسائل الافتراضية والواجهات المختومة في Java.",
      "تم فحص اللغات المختلفة لبساطتها وأدواتها وسهولة استخدامها ، بالإضافة إلى عقبات الانتقال إلى إصدارات Java المحدثة.",
      "ولوحظ أن آراء المطورين تتباين تباينا كبيرا، حيث أشاد البعض بمتانة بعض اللغات ونظامها الإيكولوجي، بينما أشار آخرون إلى قيودها وسماتها المفقودة، مما يؤكد الطبيعة الذاتية للأفضليات اللغوية."
    ],
    "points": 261,
    "commentCount": 460,
    "retryCount": 0,
    "time": 1694895615
  },
  {
    "id": 37538028,
    "title": "كل نفس تأخذه - تدريب تقلب معدل ضربات القلب",
    "originLink": "https://github.com/kbre93/every-breath-you-take",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37538028",
    "commentBody": "",
    "originSummary": [
      "النقطة الأساسية هي أن التنفس المنظم يمكن أن يدير استجابة الجسم للإجهاد.",
      "تم تطوير تطبيق جديد يستخدم جهاز مراقبة معدل ضربات القلب Polar H10 لقياس هذا التأثير وتدريبه.",
      "يتيح هذا التطبيق للمستخدمين ضبط معدل تنفسهم ، ويقيس التحكم في التنفس عبر مقياس تسارع الصدر ، ويعرض استجابة تقلب معدل ضربات القلب."
    ],
    "commentSummary": [
      "يقدم المنشور تطبيقا مصمما لقياس وتدريب استجابة الجسم للإجهاد باستخدام جهاز مراقبة معدل ضربات القلب وتقنيات التنفس التي يتم التحكم فيها.",
      "التركيز الرئيسي للمناقشة هو تقلب معدل ضربات القلب (HRV) وارتباطاته بعوامل مختلفة مثل ممارسة الرياضة واستهلاك الكحول والنظام الغذائي والظروف الصحية ، ولا سيما مستويات القلق.",
      "في حين أن HRV هو مؤشر محتمل للأمراض الوشيكة والقلق ، إلا أن موثوقيته ودقته موضع نقاش. ومع ذلك ، يتم تقديم مفهوم إدارة الحالات العاطفية من خلال مراقبة ومعالجة HRV."
    ],
    "points": 261,
    "commentCount": 70,
    "retryCount": 0,
    "time": 1694893695
  },
  {
    "id": 37536016,
    "title": "ديناميكيات الصورة التوليدية",
    "originLink": "https://generative-dynamics.github.io/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37536016",
    "commentBody": "",
    "originSummary": [
      "تفصل الورقة البحثية تقنية لتحويل الصور الثابتة الفردية إلى مقاطع فيديو متكررة أو مشاهد ديناميكية تفاعلية.",
      "تتضمن الطريقة التعلم من مسارات الحركة المستخرجة من تسلسلات الفيديو الحقيقية للتنبؤ بتمثيل الحركة طويل المدى لكل بكسل ، والذي يطلق عليه نسيج الحركة العشوائية العصبية.",
      "يمكن لهذا النموذج تحويل نسيج الحركة العشوائية العصبية إلى مسارات حركة كثيفة لتوليد الفيديو ، مما يتيح تفاعلات واقعية مع الكائنات في الصور."
    ],
    "commentSummary": [
      "ديناميكيات الصورة التوليدية هي أداة جديدة تمكن من إنشاء حركة خفية في الصور ، على غرار الصور السينمائية ، والتي يمكن أن تعزز المواد التسويقية أو التصوير الفوتوغرافي.",
      "أثارت الأداة اهتماما ونقاشا كبيرين حول تطبيقاتها وأمثلتها المحتملة.",
      "هناك أيضا محادثة حول الاندماج المحتمل لتقنيات مماثلة في تطوير ألعاب الفيديو."
    ],
    "points": 257,
    "commentCount": 24,
    "retryCount": 0,
    "time": 1694880485
  },
  {
    "id": 37535187,
    "title": "يقوم مطورو الألعاب بإيقاف تشغيل جميع عمليات تحقيق الدخل من إعلانات IronSource و Unity",
    "originLink": "https://docs.google.com/document/d/16PzpX6qIwJu57jCB2fhxqKtmxA6A6QmZWifsWZBqI2w/view",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37535187",
    "commentBody": "",
    "originSummary": [
      "طلبت شركات تطوير الألعاب بشكل جماعي القدرة على مراجعة الشروط والأحكام الجديدة.",
      "بناء على طلبهم ، اتخذت هذه الشركات قرارا بوقف تحقيق الدخل من جميع إعلانات IronSource و Unity Ads.",
      "تعد IronSource و Unity Ads من المنصات الشائعة التي تستخدمها هذه الشركات لتحقيق الدخل من الألعاب ، مما يشير إلى حدوث تحول كبير محتمل في نماذج إيراداتها."
    ],
    "commentSummary": [
      "يناقش موضوع Reddit هذا المخاوف بشأن قيام شركات الألعاب الكبيرة بسرقة الألعاب المستقلة والاستفادة منها ، مما يؤدي إلى نزاعات داخل مجتمع الألعاب.",
      "يذكر قرار Unity بتعديل شروط الخدمة الخاصة بها ، مما قد يسبب صعوبات للمؤسسات الصغيرة ، وما إذا كان تعلم مبادئ تطوير الألعاب له قيمة كبيرة.",
      "كما يتم استكشاف انتقادات لمحركات الألعاب مثل Unity وتأثير الذكاء الاصطناعي (الذكاء الاصطناعي) على صناعة الألعاب ، مما يشير إلى تطور مستمر في هذا المجال."
    ],
    "points": 221,
    "commentCount": 129,
    "retryCount": 0,
    "time": 1694875225
  },
  {
    "id": 37541093,
    "title": "نظرة على نموذج النص التنبئي الجديد المدعوم بالمحولات من Apple",
    "originLink": "https://jackcook.com/2023/09/08/predictive-text.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37541093",
    "commentBody": "",
    "originSummary": [
      "تقدم Apple ميزة نص تنبؤي جديدة باستخدام نموذج لغة Transformer في إصدارات iOS و macOS المستقبلية.",
      "تركز الميزة ، التي يعتقد أنها تستند إلى نموذج GPT-2 مع ما يقرب من 34 مليون معلمة ، على الرموز التعبيرية والانقباضات بسبب استخدامها المتكرر في الرسائل النصية.",
      "على الرغم من أنه من المحتمل أن يكون أقل كفاءة في إنشاء جمل كاملة مثل نماذج اللغة الأكبر ، إلا أنه يقدم اقتراحات سريعة ودقيقة أثناء كتابة المستخدم."
    ],
    "commentSummary": [
      "تسلط المقالة الضوء على استياء المستخدم من وظيفة التصحيح التلقائي على أجهزة iOS من Apple ، مشيرة إلى المشكلات منذ التحول إلى نموذج التعلم الآلي.",
      "أبلغ المستخدمون عن تصحيحات غير مرغوب فيها ، خاصة مع أسماء الأعلام ، وصعوبات في الكتابة متعددة اللغات ، وتقديم بدائل مثل التمرير السريع وتحويل الصوت إلى نص كحلول محتملة.",
      "تتطرق المناقشة أيضا إلى الدعم اللغوي المحدود والدقة المشكوك فيها لنماذج محولات Apple ، والتي تضم مناقشات حول استخدام Apple لمصطلح \"LLM\". يتوقع المستخدمون تحسين التصحيح التلقائي في التحديثات المستقبلية."
    ],
    "points": 215,
    "commentCount": 92,
    "retryCount": 0,
    "time": 1694919623
  },
  {
    "id": 37538426,
    "title": "أعلنت Lodash للتو إفلاس القضية وأغلقت كل قضية وفتح العلاقات العامة",
    "originLink": "https://twitter.com/danielcroe/status/1703127430523703432",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37538426",
    "commentBody": "",
    "originSummary": [
      "وبحسب ما ورد أعلنت مكتبة البرمجيات \"lodash\" إفلاسها.",
      "وقد أدى هذا الإعلان إلى إغلاق جميع إصداراته المفتوحة وطلبات السحب."
    ],
    "commentSummary": [
      "تدور المناقشات حول العديد من الموضوعات المرتبطة بمكتبة الأداة المساعدة JavaScript Lodash ، بما في ذلك إغلاق جميع المشكلات وطلبات السحب ، وتطبيق البرمجة الوظيفية ووظيفة Reduce () ، وتحول Lodash إلى Bun.",
      "تتضمن المحادثات استخدام الأطر والمكتبات في الترميز ومقارنة فعالية Lodash مع التعليمات البرمجية المخصصة من حيث الأداء والبساطة.",
      "تطرح المناقشة أيضا إمكانية تنفيذ رسوم الإبلاغ عن المشكلات في المشاريع البارزة مفتوحة المصدر وفتح باب التقديم لمجموعة شتاء 2024 من Y Combinator (YC)."
    ],
    "points": 205,
    "commentCount": 163,
    "retryCount": 0,
    "time": 1694896329
  },
  {
    "id": 37533493,
    "title": "exaequOS - نظام تشغيل جديد يعمل في متصفح الويب",
    "originLink": "https://www.exaequos.com",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37533493",
    "commentBody": "",
    "originSummary": [
      "تكشف الوثيقة أن وثائق الاتصال الخاصة ب GitHub IP يمكن الوصول إليها الآن ، وتذكر أن ExaequOS ، وهو نظام تشغيل جديد ، لا يزال قيد التطوير.",
      "تتوفر العديد من الإصدارات الجديدة من البرامج ، بما في ذلك VIM 9.0 و Bash 5.2.2 و GNU Chess 6.2.9. بالإضافة إلى ذلك ، تم ذكر برنامج Bywater BASIC وبعض الألعاب.",
      "يتم الإعلان عن توفر إصدار جديد من GNUed ، الإصدار 1.19 ، ويتم توفير معلومات تسجيل الدخول ل ExaequOS."
    ],
    "commentSummary": [
      "ExaequOS هو نظام تشغيل تم تقديمه حديثا يعمل داخل متصفح ويب ، ويستخدم بنية microkernel ويستفيد من WebAssembly.",
      "يهدف إلى العمل بالكامل على الويب ولديه ميزات للوصول إلى منصات مثل Google Drive و Dropbox. إذا حظيت باهتمام كاف ، فقد يحدث مزيد من التطوير.",
      "المناقشات جارية حول إمكانية تجميع Linux إلى WebAssembly وتقدم مشروع ExaequOS ، بهدف إنشاء نظام أساسي مناسب لتطبيقات الويب."
    ],
    "points": 199,
    "commentCount": 99,
    "retryCount": 0,
    "time": 1694859094
  },
  {
    "id": 37539410,
    "title": "\"أريد استخدام هذا تكتيكيا مقابل GOOG / AAPL\" (2022)",
    "originLink": "https://twitter.com/TechEmails/status/1703172745893404913",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37539410",
    "commentBody": "",
    "originSummary": [
      "كشف الرئيس التنفيذي لشركة Microsoft ، ساتيا ناديلا ، في رسالة بريد إلكتروني لعام 2022 عن خططه الإستراتيجية للاستفادة من تقنية معينة ضد عمالقة التكنولوجيا Google (GOOG) و Apple (AAPL).",
      "تم نشر محتوى البريد الإلكتروني في 16 سبتمبر 2023 ، من خلال تغريدة من حساب يعرف باسم \"رسائل البريد الإلكتروني التقنية الداخلية\".",
      "لم يتم ذكر التقنية المحددة المخصصة للاستخدام ضد Google و Apple في المقتطف المقدم."
    ],
    "commentSummary": [
      "تستكشف المحادثات مجموعة متنوعة من الموضوعات مثل دخول Apple إلى ألعاب iPhone ، والمناقشات حول تأجير المنتجات مقابل امتلاكها ، وتأثير خدمات البث على صناعة الألعاب.",
      "وتشمل الموضوعات الأخرى مناهج مايكروسوفت للتنافس مع أبل، ومشهد خدمات الألعاب السحابية، وأساليب الاتصال المختلفة للرؤساء التنفيذيين، واستراتيجيات الاتصالات المؤسسية والاحتفاظ بالبيانات.",
      "يقدم المشاركون مجموعة واسعة من وجهات النظر ، مما يؤدي إلى مناقشات قوية حول جوانب متعددة من هذه الموضوعات."
    ],
    "points": 197,
    "commentCount": 201,
    "retryCount": 0,
    "time": 1694903228
  },
  {
    "id": 37535814,
    "title": "لن أكون منتجا بما يكفي للنظام الأكاديمي اليوم (2013)",
    "originLink": "https://www.theguardian.com/science/2013/dec/06/peter-higgs-boson-academic-system",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37535814",
    "commentBody": "",
    "originSummary": [
      "يعبر بيتر هيغز ، الفيزيائي المعروف عن بوزون هيغز ، عن شكوكه في أنه سيفي بمعايير الإنتاجية للنظام الأكاديمي اليوم.",
      "يقترح هيغز أنه بسبب الضغط المعاصر على الأكاديميين للنشر والتعاون باستمرار ، فإن تحقيق اختراق فريد مشابه لإنجازه أمر غير مرجح.",
      "يشعر بالأسف إزاء الإشارة إلى بوزون هيغز باسم \"جسيم الله\" ويكشف أن حياته المهنية كانت في خطر بسبب خلافات مع مدير جامعة إدنبرة."
    ],
    "commentSummary": [
      "يتعمق المقال في الضغط الحالي على العلماء للحفاظ على الإنتاجية ، مع استخدام المقاييس كأدوات لتقييم عملهم. يسلط الضوء على دور السياسيين والإداريين والعلماء في تشكيل النظام الأكاديمي.",
      "ويشير إلى تقليص حجم مختبرات البحث والتطوير في الشركات، والتحول اللاحق نحو الأوساط الأكاديمية، ويناقش القيود المفروضة على المقاييس في قياس إنتاجية البحوث. تقديم نقد حول الاعتماد المفرط على مقاييس النشر وتأثيره الضار على جودة البحث.",
      "تستكشف المناقشة كذلك العوائق التي تحول دون حرية البحث ، واستكشاف مسارات وظيفية بديلة ، والصراع بين الاعتماد على المقاييس وتنمية الثقة داخل الأوساط الأكاديمية. انتقاد النظام الأكاديمي الحالي لتعزيز المهنية على حساب البحوث المبتكرة."
    ],
    "points": 195,
    "commentCount": 102,
    "retryCount": 0,
    "time": 1694879199
  },
  {
    "id": 37536103,
    "title": "خوادم قاعدة البيانات التي تعمل على تشغيل Let's Encrypt (2021)",
    "originLink": "https://letsencrypt.org/2021/01/21/next-gen-database-servers.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37536103",
    "commentBody": "",
    "originSummary": [
      "قامت Let's Encrypt ، وهي مرجع مصدق يقدم شهادات TLS لمواقع الويب المختلفة ، بتحسين خوادم قواعد البيانات الخاصة بها لتحسين الأداء وقابلية التوسع.",
      "اختارت المؤسسة استخدام شرائح AMD EPYC والخوادم PowerEdge R7525 من Dell للترقية، مما ضاعف الأداء ومكن من استخدام محركات أقراص NVMe، مما قلل بشكل فعال من وقت معالجة طلب واجهة برمجة التطبيقات وزمن انتقال قاعدة البيانات.",
      "تم دمج OpenZFS لإدارة محركات أقراص NVMe كجزء من الترقية ، بهدف استيعاب الاعتماد المتزايد على Let's Encrypt لاتصالات الويب الآمنة."
    ],
    "commentSummary": [
      "قامت Let's Encrypt بتحسين خوادم قواعد البيانات الخاصة بها باستخدام معالجات AMD EPYC ومحركات أقراص NVMe SSD ، مما أدى إلى تحسين الأداء وقابلية التوسع ، وزيادة الإصدار اليومي للشهادات بشكل كبير.",
      "كما تمت مناقشة المقارنات مع قواعد البيانات الأخرى وتوفير التكاليف مقابل استضافة AWS، مما أثار جدلا بين استخدام الخدمات السحابية أو الاستثمار في الأجهزة المادية.",
      "يتم اقتراح استراتيجيات بديلة مثل استئجار خوادم مخصصة أو استخدام خدمات التوصيل الشبكي ، مع التأكيد على الحاجة إلى مراعاة الظروف وأعباء العمل الفريدة عند اتخاذ القرارات."
    ],
    "points": 186,
    "commentCount": 98,
    "retryCount": 0,
    "time": 1694880983
  },
  {
    "id": 37536361,
    "title": "هل هذا احتيال؟ وإذا كان الأمر كذلك ، إلى أي مدى أنا مسؤول؟",
    "originLink": "https://workplace.stackexchange.com/questions/193234/is-this-fraud-and-if-so-to-what-extent-am-i-responsible",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37536361",
    "commentBody": "",
    "originSummary": [
      "يواجه موظف تقني كبير ضغوطا للمشاركة في إجراءات غير شريفة تتعلق بعملية شراء العميل ، مما يثير مخاوف بشأن المسؤولية الشخصية والاستقالة المحتملة.",
      "تشمل الاقتراحات للموظف طلب المشورة القانونية ، وتوثيق جميع التفاعلات ذات الصلة للحصول على أدلة ، وربما تنبيه العميل ، والنظر في بدائل الوظيفة.",
      "في حين أن ثقافة الخداع قد تسهل البيع الفوري ، إلا أنه يتم التأكيد على أن الحفاظ على الصدق وإجراء اختبار الاختراق ومعالجة الأسئلة الصعبة هي رمز للممارسات التجارية الأخلاقية."
    ],
    "commentSummary": [
      "تركز المناقشة على المأزق الأخلاقي الذي يواجهه الموظف الذي يطلب منه المشاركة في الممارسات الاحتيالية التي تنطوي على البيانات الهندسية والاختبارات الأمنية.",
      "ويتعمق في التداعيات المحتملة بما في ذلك قيمة الصدق والنزاهة، والعواقب القانونية المحتملة، ويقترح تدابير مثل طلب المشورة القانونية والتوثيق والامتناع عن الانخراط في مثل هذه الأنشطة.",
      "تشكل المسميات الوظيفية ونماذج الامتثال وتعقيد اتخاذ القرارات الأخلاقية في سياق مهني قسما آخر من المناقشة."
    ],
    "points": 183,
    "commentCount": 199,
    "retryCount": 0,
    "time": 1694882569
  },
  {
    "id": 37538400,
    "title": "تسريح العمال.لمعلوماتك",
    "originLink": "https://layoffs.fyi/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37538400",
    "commentBody": "",
    "originSummary": [
      "أنشأ مؤسس شركة ناشئة موقعا إلكترونيا يراقب تسريح العمال في صناعة التكنولوجيا أثناء جائحة COVID-19.",
      "تتبع الموقع عمليات تسريح العمال في أكثر من 1000 شركة تقنية ، حيث أبلغ عن إجمالي مذهل لأكثر من 235000 موظف تم تسريحهم.",
      "بالإضافة إلى تتبع تسريح العمال ، يوفر الموقع أيضا بيانات قياس الرواتب المجانية لأكثر من 3000 شركة تقنية ، مما يوفر رؤى قيمة للصناعة خلال هذه الفترة الصعبة."
    ],
    "commentSummary": [
      "يطرح المقال انخفاضا في تسريح العمال في صناعة التكنولوجيا ويدقق في القضايا الاقتصادية التي تواجهها الشركات. كما يلمح إلى تواطؤ محتمل بين شركات التكنولوجيا الكبرى ويجادل بأن بعض عمليات التسريح قد تكون بسبب تغييرات في سياسات العمل عن بعد أو تفويضات العودة إلى المكتب.",
      "تتعمق المناقشة في قانونية مطالبة الموظفين بالانتقال دون تعويض ، ومفهوم \"الفصل البناء\" ، والفوائد المحتملة لتشكيل نقابات لحقوق العمل عن بعد.",
      "يذكر النص موقعا إلكترونيا يسرد تسريح العمال في صناعة التكنولوجيا ويتعمق في تأثير أصحاب رؤوس الأموال الاستثمارية (VCs) وأسعار الفائدة على قرارات التسريح. كما يسلط الضوء على جدول بيانات Google الذي يحتوي على معلومات حول الموظفين المسرحين ، مما أثار ردود فعل متنوعة."
    ],
    "points": 157,
    "commentCount": 63,
    "retryCount": 0,
    "time": 1694896103
  },
  {
    "id": 37537689,
    "title": "تشغيل المرجع المصدق الجذر الخاص بك في عام 2023",
    "originLink": "https://wejn.org/2023/09/running-ones-own-root-certificate-authority-in-2023/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37537689",
    "commentBody": "",
    "originSummary": [
      "توفر المقالة إرشادات حول إعداد مرجع مصدق جذر (CA) لأمن الإنترنت ، مع تحديد قيود البدائل المجانية وعرض كيفية إنشاء شهادات المرجع المصدق والمضيف.",
      "يتضمن المتطلبات الفنية لخدمة شهادات CA ويعطي أمثلة التعليمات البرمجية ، بالإضافة إلى مشاركة تجربة المؤلف الشخصية في إدارة مرجع مصدق جذر.",
      "ويشير إلى مخاطر العملية ويؤكد على أهمية الحفاظ على التدابير الأمنية ، مثل استخدام nameRestrictions للأمن ، وحماية الأسرار ، وتدوير الشهادات سنويا."
    ],
    "commentSummary": [
      "تستكشف المقالة مزايا وتحديات تشغيل مرجع مصدق (CA) خاص بالمجال ، وهو أداة مهمة لإدارة الشهادات الرقمية ، كبديل للمراجع المصدقة التقليدية.",
      "ويسلط الضوء على التعقيد والتكلفة المرتبطين بهذا النظام ، مع التأكيد على الحاجة إلى حلول إدارة شهادات أبسط وفعالة من حيث التكلفة. كما تم التأكيد على قيمة تشغيل مرجع مصدق يمكن الاعتماد عليه لتلبية الاحتياجات الداخلية.",
      "كما أنه يتعمق في المشكلات المحيطة بمجموعات برامج معينة مع Let's Encrypt ، وتفضيل تشفير المنحنى الإهليلجي على RSA للأمان ، ومتطلبات توزيع شهادات الجذر وإلغائها بأمان."
    ],
    "points": 157,
    "commentCount": 107,
    "retryCount": 0,
    "time": 1694891275
  },
  {
    "id": 37539686,
    "title": "شركة فينيكس SoC من AMD",
    "originLink": "https://chipsandcheese.com/2023/09/16/hot-chips-2023-amds-phoenix-soc/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37539686",
    "commentBody": "",
    "originSummary": [
      "أنشأت AMD Phoenix SoC ، الذي يتضمن نوى Zen 4 ورسومات RDNA 3 لتعزيز كفاءة الطاقة والأداء للأجهزة المدمجة والمحمولة.",
      "تتضمن الشريحة ، التي تم تصنيعها على عملية N4 من TSMC ، العديد من المسرعات ، ووحدة معالجة رسومات جديدة ذات نطاق ترددي أعلى للذاكرة ، وقدرات معالجة ترميز الفيديو من الجيل التالي.",
      "إلى جانب ذلك ، توفر Phoenix APU تحسينات في استخدام الطاقة والتعلم الآلي وأداء معالجة الصوت ، مما يجعل AMD منافسا قويا لشركة Intel."
    ],
    "commentSummary": [
      "AMD Phoenix SoC ، المعترف به لأدائه وقدراته في الألعاب ، متاح بسهولة في أجهزة ultrabooks ، مما يسبب صعوبات للمستخدم.",
      "وسط الثناء ، تنشأ مخاوف تتعلق بالخصوصية والأمان بسبب ميزة الموجات فوق الصوتية في SoC ، مما يؤدي إلى مقارنات مع Pluton من Microsoft ومناقشات حول ممارسات التوثيق.",
      "تشمل الموضوعات الإضافية التكامل المحتمل لمحرك الذكاء الاصطناعي من AMD ، XDNA ، في منصة ROCm الخاصة بهم ، واعتماد المطورين ل XDNA ، وغياب برامج تشغيل OpenCL ، والآثار المترتبة على اعتماد FPGA."
    ],
    "points": 145,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1694905389
  },
  {
    "id": 37538482,
    "title": "Linux على جهاز MacBook Pro (M1 Pro): ما مدى جودة Asahi الآن؟",
    "originLink": "https://www.youtube.com/watch?v=ZFx6R26aRHw",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37538482",
    "commentBody": "",
    "originSummary": [
      "جرب المؤلف Asahi Linux على جهاز MacBook Pro الذي يتميز بوحدة المعالجة المركزية M1 Pro ، مشيرا إلى أن بعض الميزات تعمل بسلاسة ، ولكن كانت هناك حدود ، مثل وظائف USB المتناقصة ومنافذ العرض الخارجية غير الوظيفية.",
      "على الرغم من أن أداء وحدة المعالجة المركزية وعمر البطارية أثناء بث YouTube وجد أنهما أقل قليلا مقارنة بنظام macOS ، إلا أن تثبيت برامج تشغيل GPU قدم عمرا محسنا للبطارية.",
      "على الرغم من أن Asahi Linux قابل للتطبيق لجهاز MacBook Pro ، إلا أن إمكانات الألعاب ودعم التطبيقات لا تزال مقيدة. لذلك ، يوصي المؤلف بالنظر في جهاز مثل كمبيوتر محمول أو سطح مكتب Tuxedo يأتي مثبتا مسبقا مع Linux للحصول على تجربة أكثر تحسينا."
    ],
    "commentSummary": [
      "تركز المحادثة على قضايا استخدام Linux على أجهزة MacBook المزودة بمعالج M1 من Apple ، بما في ذلك دعم الأجهزة واستهلاك الطاقة ونقص ميزات معينة.",
      "يناقش المستخدمون قرار شراء الأجهزة من Apple ، وهي شركة لا تدعم Linux حاليا ، ويناقشون إيجابيات وسلبيات استخدام أجهزة Mac مقابل الخيارات الأخرى.",
      "كما تسلط المناقشة الضوء على التقدم المحرز في تطوير Asahi Linux ، مع وجهات نظر متنوعة حول التطبيق العملي وجاذبية استخدام Linux على أجهزة Apple Silicon بسبب الاختلافات في استقرار النظام وتوافقه."
    ],
    "points": 142,
    "commentCount": 91,
    "retryCount": 0,
    "time": 1694896828
  },
  {
    "id": 37535910,
    "title": "محرك الاحتراق الذاتي من Unity",
    "originLink": "https://www.gamesindustry.biz/unitys-self-combustion-engine-this-week-in-business",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37535910",
    "commentBody": "",
    "originSummary": [
      "قوبلت Unity ، وهي منصة تطوير ألعاب شهيرة ، برفض كبير بعد قرارها بتقديم رسوم وقت التشغيل بناء على عمليات تثبيت اللعبة ، مما أثار ارتباكا بين مطوري الألعاب.",
      "أثارت الرسوم الجديدة رد فعل عنيف دفع بعض الاستوديوهات إلى سحب الإعلانات والتفكير في تبديل محركات الألعاب ، حيث لعبت الخلافات السابقة في Unity وتسريح العمال وانعدام الثقة دورا مساهما في رد الفعل.",
      "يشكك النقاد في الدافع وراء تنفيذ الرسوم ، ويتكهنون بأنه قد يكون مدفوعا بالتحديات المالية للوحدة ، بما في ذلك العجز المتراكم وعدم الربحية. ويجادلون بأنه ينتهك وعد الوحدة السابق بعدم دفع أي إتاوات ويتعارض مع مبادئ الشفافية والإنصاف."
    ],
    "commentSummary": [
      "يغوص المقال في الجدل الذي أثاره هيكل الرسوم الجديد ل Unity ، والذي حصل على انتقادات من المطورين.",
      "إنه يطرح مناقشات حول البدائل المحتملة لمحرك لعبة Unity ويتكهن بالمشترين المحتملين للشركة.",
      "يتم التشكيك في مصداقية إدارة Unity وفعالية نموذج الدفع الخاص بهم ، إلى جانب التأثير إذا كان لدى Unity حصرية لشركة Apple."
    ],
    "points": 136,
    "commentCount": 139,
    "retryCount": 0,
    "time": 1694879832
  },
  {
    "id": 37541243,
    "title": "أغنى 10٪ في الأمريكتين مسؤولة عن 40٪ من تلوث حرارة الكوكب",
    "originLink": "https://journals.plos.org/climate/article?id=10.1371/journal.pclm.0000190",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37541243",
    "commentBody": "",
    "originSummary": [
      "تستكشف هذه الدراسة البصمات الكربونية للأسر الأمريكية بناء على الدخل من 1990-2019 ، وتحديد أوجه عدم المساواة الرئيسية في الانبعاثات عبر التركيبة السكانية الاقتصادية والعرقية.",
      "يقترح البحث فرض ضريبة الكربون على الاستثمارات كاستراتيجية محتملة للحث على إزالة الكربون وزيادة تمويل المناخ.",
      "وتشير الدراسة إلى المساهمات الكبيرة ل \"الدول فائقة الانبعاثات\"، وهي في المقام الأول فئة الدخل الأعلى بنسبة 0.1٪، في الانبعاثات، موضحة الحاجة إلى معالجة هذا التفاوت في الانبعاثات. كما يقر بأوجه القصور المحتملة المتعلقة بالدخل غير المكتسب والحوافظ الاستثمارية."
    ],
    "commentSummary": [
      "تشير دراسة حديثة إلى أن أعلى 10٪ من أصحاب الدخول في أمريكا مسؤولون عن 40٪ من تلوث المناخ في البلاد.",
      "يركز الخطاب المحيط بهذا الموضوع على التزامات الأثرياء ، والحلول الممكنة مثل ضرائب الكربون ، وأهمية المسؤولية الشخصية في اتخاذ القرارات الأخلاقية لتقليل الضرر البيئي.",
      "وتشمل الموضوعات المذكورة أيضا الحرب، وأنماط الاستهلاك، ودور الحكومة في السيطرة على الممارسات الضارة، مع التركيز بشكل أساسي على إيجاد حلول فعالة لخفض الانبعاثات وتقليل الأثر البيئي."
    ],
    "points": 130,
    "commentCount": 98,
    "retryCount": 0,
    "time": 1694921470
  },
  {
    "id": 37533747,
    "title": "BtrBlocks: ضغط عمودي فعال لبحيرات البيانات [pdf]",
    "originLink": "https://www.cs.cit.tum.de/fileadmin/w00cfj/dis/papers/btrblocks.pdf",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37533747",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "تقدم المقالة BtrBlocks ، وهو تنسيق ضغط عمودي جديد مصمم لتعزيز فعالية بحيرات البيانات.",
      "تتم مقارنة BtrBlocks بالتنسيقات الحالية مثل Parquet و Arrow ، وتتميز بنسبة ضغط عالية وسرعة ضغط تنافسية وأداء ممتاز لتخفيف الضغط.",
      "كما يناقش تحديات تحسين تنسيقات بحيرة البيانات للتطبيقات المستقبلية غير المتوقعة وتعقيد تحديد تقنيات الضغط المثالية."
    ],
    "points": 128,
    "commentCount": 22,
    "retryCount": 0,
    "time": 1694862509
  }
]
