[
  {
    "id": 37534615,
    "title": "Horcrux: Rozdělte svůj soubor na zašifrované fragmenty",
    "originLink": "https://github.com/jesseduffield/horcrux",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37534615",
    "commentBody": "",
    "originSummary": [
      "Horcrux je nástroj s otevřeným zdrojovým kódem, který rozdělí soubor na zašifrované části, čímž eliminuje potřebu uživatelů pamatovat si přístupový kód pro zabezpečení distribuovaného úložiště.",
      "Technologie funguje na základě Shamirova schématu sdílení tajemství, které fragmentuje šifrovací klíč tak, že jej lze rekonstruovat pouze z předem definovaného počtu částí.",
      "Nástroj slouží konkrétním uživatelům, kteří musí šifrovat velké citlivé soubory a šířit je několika kanály, aby snížili riziko odposlechu."
    ],
    "commentSummary": [
      "Diskuse se soustředí na několik kryptografických nástrojů a technik, jako jsou Horcrux, Shamir Secret Sharing (SSS), HTTP Basic Authentication, polynomiální vzorky a Oblivious Transfer (OT).",
      "Rozhovor se široce zabývá omezeními, bezpečnostními obavami a možnými případy použití těchto nástrojů a zdůrazňuje potřebu jejich vylepšení a zpřístupnění uživatelům.",
      "Do diskuse jsou krátce zahrnuta i některá nesouvisející témata, jako je Harry Potter, politické názory J. K. Rowlingové a práva transsexuálů."
    ],
    "points": 459,
    "commentCount": 124,
    "retryCount": 0,
    "time": 1694871108
  },
  {
    "id": 37535537,
    "title": "Léčba cystické fibrózy získala průlomovou cenu",
    "originLink": "https://www.nature.com/articles/d41586-023-02890-1",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37535537",
    "commentBody": "",
    "originSummary": [
      "Trikafta, trojkombinace léků vyvinutá společností Vertex Pharmaceuticals, získává průlomové ocenění ve výši 3 milionů dolarů za účinnost při léčbě cystické fibrózy, závažného genetického onemocnění.",
      "Kombinovaná léčba zlepšuje kvalitu života pacientů a prodlužuje očekávanou délku života tím, že se zaměřuje na malformovaný protein u pacientů s cystickou fibrózou.",
      "Průlomové ceny byly uděleny i za další úspěchy, jako jsou objevy týkající se Parkinsonovy choroby, léčby rakoviny a matematických teorií."
    ],
    "commentSummary": [
      "Diskuse se točí kolem klíčových lékařských témat, jako jsou přínosy a vedlejší účinky převratné léčby cystické fibrózy (CF), současné debaty o financování výzkumu CF a vysoké náklady a dostupnost léků na CF.",
      "Shrnutí zachycuje dialog o etických důsledcích genetického screeningu a výběru embryí při řešení Downova syndromu a nabízí pohled na složité etické otázky v lékařském výzkumu.",
      "Rozhovor se dále zabývá obecnou otázkou velkých výdajů spojených s léky na konkrétní nemoci a naznačuje obavy o ziskovost farmaceutického průmyslu."
    ],
    "points": 300,
    "commentCount": 136,
    "retryCount": 0,
    "time": 1694877526
  },
  {
    "id": 37538333,
    "title": "Java 21 mě opět přiměla mít rád Javu",
    "originLink": "https://wscp.dev/posts/tech/java-pattern-matching/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37538333",
    "commentBody": "",
    "originSummary": [
      "Java 21, jejíž uvedení je plánováno na září 2023, má za cíl přinést vzory záznamů do bloků přepínačů a výrazů, a tím umožnit funkční programování v Javě.",
      "Diskutované vlastnosti zahrnují typy produktů relevantní pro třídu záznamů Javy, výhody přepínacích vzorů a uzavřených tříd z Javy 17, jakož i porovnávání vzorů s uzavřenými rozhraními a zavedení ochranných klauzulí.",
      "Tato nadcházející verze, konkrétně Java 21, je zdůrazňována jako významný vývoj směrem k rozšíření nástrojů Javy pro funkcionální programování."
    ],
    "commentSummary": [
      "Diskuse se soustředí na několik aspektů programovacích jazyků, jako jsou Java, Go, Kotlin a C#, včetně novinek, jako jsou virtuální vlákna a uzavřená rozhraní v Javě.",
      "Různé jazyky byly zkoumány z hlediska jejich jednoduchosti, nástrojů a uživatelské přívětivosti, stejně jako z hlediska překážek přechodu na aktualizované verze Javy.",
      "Bylo zjištěno, že názory vývojářů se značně lišily, přičemž někteří chválili robustnost a ekosystém některých jazyků, zatímco jiní poukazovali na jejich omezení a chybějící funkce, což podtrhuje subjektivní povahu jazykových preferencí."
    ],
    "points": 261,
    "commentCount": 460,
    "retryCount": 0,
    "time": 1694895615
  },
  {
    "id": 37538028,
    "title": "Každý nádech - trénink variability srdeční frekvence",
    "originLink": "https://github.com/kbre93/every-breath-you-take",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37538028",
    "commentBody": "",
    "originSummary": [
      "Hlavní je, že regulované dýchání dokáže zvládnout stresovou reakci organismu.",
      "Byla vyvinuta nová aplikace, která k měření a tréninku tohoto efektu využívá snímač tepové frekvence Polar H10.",
      "Tato aplikace umožňuje uživatelům nastavit si frekvenci dýchání, měří kontrolu dýchání pomocí hrudního akcelerometru a zobrazuje odezvu na variabilitu srdeční frekvence."
    ],
    "commentSummary": [
      "Příspěvek představuje aplikaci určenou k měření a tréninku reakce těla na stres pomocí monitoru srdečního tepu a technik řízeného dýchání.",
      "Ústředním tématem diskuse je variabilita srdeční frekvence (HRV) a její souvislosti s různými faktory, jako je cvičení, konzumace alkoholu, strava, zdravotní stav a zejména úroveň úzkosti.",
      "Přestože HRV je potenciálním indikátorem hrozících onemocnění a úzkosti, o jeho spolehlivosti a přesnosti se vedou diskuse. Je však představen koncept řízení emočních stavů prostřednictvím monitorování a manipulace s HRV."
    ],
    "points": 261,
    "commentCount": 70,
    "retryCount": 0,
    "time": 1694893695
  },
  {
    "id": 37536016,
    "title": "Generativní dynamika obrazu",
    "originLink": "https://generative-dynamics.github.io/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37536016",
    "commentBody": "",
    "originSummary": [
      "Výzkumný článek podrobně popisuje techniku transformace jednotlivých statických obrázků do smyčkových videí nebo interaktivních dynamických scén.",
      "Metoda zahrnuje učení se z trajektorií pohybu získaných ze skutečných videosekvencí za účelem předpovědi dlouhodobé reprezentace pohybu na pixel, označované jako neuronová stochastická textura pohybu.",
      "Tento model dokáže převést neuronovou stochastickou texturu pohybu na husté trajektorie pohybu pro generování videa, což umožňuje realistickou interakci s objekty v obrazech."
    ],
    "commentSummary": [
      "Generative Image Dynamics je nový nástroj, který umožňuje vytvářet jemný pohyb v obrázcích, podobně jako je tomu u filmových odstavců, čímž lze vylepšit marketingové materiály nebo fotografie.",
      "Tento nástroj vyvolal značný zájem a diskusi o jeho možných aplikacích a příkladech.",
      "Hovoří se také o možné integraci podobných technologií do vývoje videoher."
    ],
    "points": 257,
    "commentCount": 24,
    "retryCount": 0,
    "time": 1694880485
  },
  {
    "id": 37535187,
    "title": "Vývojáři her vypínají veškeré zpeněžení pomocí reklam IronSource a Unity Ads",
    "originLink": "https://docs.google.com/document/d/16PzpX6qIwJu57jCB2fhxqKtmxA6A6QmZWifsWZBqI2w/view",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37535187",
    "commentBody": "",
    "originSummary": [
      "Společnosti zabývající se vývojem her společně požádaly o možnost přezkoumání nových podmínek.",
      "Na základě jejich žádosti se tyto společnosti rozhodly ukončit veškerou monetizaci služeb IronSource a Unity Ads.",
      "IronSource a Unity Ads jsou oblíbené platformy, které tyto společnosti používají pro monetizaci her, což naznačuje potenciální významný posun v jejich modelech příjmů."
    ],
    "commentSummary": [
      "Toto vlákno na Redditu se zabývá obavami z plagiátorství velkých herních společností, které profitují z nezávislých her, což vede ke sporům v herní komunitě.",
      "Zmíněno je rozhodnutí společnosti Unity změnit podmínky služby, což může způsobit potíže menším podnikům, a to, zda má učení se zásadám vývoje her významnou hodnotu.",
      "Zkoumá se také kritika herních enginů, jako je Unity, a vliv umělé inteligence (AI) na herní průmysl, což naznačuje pokračující vývoj v této oblasti."
    ],
    "points": 221,
    "commentCount": 129,
    "retryCount": 0,
    "time": 1694875225
  },
  {
    "id": 37541093,
    "title": "Pohled na nový model prediktivního textu od společnosti Apple s technologií Transformer",
    "originLink": "https://jackcook.com/2023/09/08/predictive-text.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37541093",
    "commentBody": "",
    "originSummary": [
      "Apple v budoucích verzích iOS a macOS zavádí novou funkci prediktivního textu pomocí jazykového modelu Transformer.",
      "Funkce, o níž se spekuluje, že je založena na modelu GPT-2 se zhruba 34 miliony parametrů, se zaměřuje na emotikony a zkratky kvůli jejich častému používání v textových zprávách.",
      "Ačkoli je potenciálně méně zdatný při vytváření celých vět než větší jazykové modely, nabízí rychlé a přesné návrhy při psaní."
    ],
    "commentSummary": [
      "Článek poukazuje na nespokojenost uživatelů s funkcí automatické opravy v zařízeních Apple se systémem iOS a uvádí problémy, které nastaly po přechodu na model strojového učení.",
      "Uživatelé hlásili nechtěné opravy, zejména u vlastních jmen, a potíže při vícejazyčném psaní, přičemž jako možná řešení nabízeli alternativy, jako je přejetí prstem a převod hlasu na text.",
      "Diskuse se také dotýká omezené jazykové podpory a sporné přesnosti modelů transformátorů společnosti Apple a zahrnuje debaty o používání termínu \"LLM\" společností Apple. Uživatelé očekávají zlepšení automatické opravy v budoucích aktualizacích."
    ],
    "points": 215,
    "commentCount": 92,
    "retryCount": 0,
    "time": 1694919623
  },
  {
    "id": 37538426,
    "title": "Lodash právě vyhlásil emisní bankrot a uzavřel všechny emise a otevřené PR",
    "originLink": "https://twitter.com/danielcroe/status/1703127430523703432",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37538426",
    "commentBody": "",
    "originSummary": [
      "Softwarová knihovna `lodash` údajně vyhlásila bankrot.",
      "Toto prohlášení vedlo k uzavření všech otevřených problémů a žádostí o stažení."
    ],
    "commentSummary": [
      "Diskutuje se o několika tématech spojených s pomocnou knihovnou Lodash v jazyce JavaScript, včetně uzavření všech problémů a žádostí o stažení, použití funkcionálního programování a funkce reduce() a přechodu Lodashe na Bun.",
      "Rozhovory zahrnují používání frameworků a knihoven při kódování a porovnání efektivity Lodashe s vlastním kódem z hlediska výkonu a jednoduchosti.",
      "V diskusi se také hovoří o možnosti zavedení poplatků za hlášení problémů v prominentních open-source projektech a o otevření přihlášek do kohorty Y Combinator (YC) Winter 2024."
    ],
    "points": 205,
    "commentCount": 163,
    "retryCount": 0,
    "time": 1694896329
  },
  {
    "id": 37533493,
    "title": "exaequOS - nový operační systém běžící ve webovém prohlížeči",
    "originLink": "https://www.exaequos.com",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37533493",
    "commentBody": "",
    "originSummary": [
      "Dokument prozrazuje, že kontaktní dokumentace GitHub IP je nyní přístupná, a zmiňuje, že nový operační systém ExaequOS je stále vyvíjen.",
      "K dispozici je několik nových verzí softwaru, včetně VIM 9.0, Bash 5.2.2 a GNU Chess 6.2.9. Dále je zmíněn software Bywater BASIC a některé hry.",
      "Je oznámena dostupnost nové verze GNUed, verze 1.19, a jsou poskytnuty přihlašovací údaje pro ExaequOS."
    ],
    "commentSummary": [
      "ExaequOS je nově představený operační systém, který funguje v rámci webového prohlížeče, využívá architekturu mikrojádra a WebAssembly.",
      "Jeho cílem je fungovat výhradně na webu a má funkce pro přístup k platformám, jako je Disk Google a Dropbox. Pokud se mu dostane dostatečné pozornosti, může dojít k dalšímu vývoji.",
      "Probíhají diskuse o možnosti kompilace Linuxu do WebAssembly a o vývoji projektu ExaequOS, jehož cílem je vytvořit platformu vhodnou pro webové aplikace."
    ],
    "points": 199,
    "commentCount": 99,
    "retryCount": 0,
    "time": 1694859094
  },
  {
    "id": 37539410,
    "title": "\"Chci to využít takticky proti GOOG/AAPL\" (2022)",
    "originLink": "https://twitter.com/TechEmails/status/1703172745893404913",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37539410",
    "commentBody": "",
    "originSummary": [
      "Generální ředitel společnosti Microsoft Satya Nadella v e-mailu z roku 2022 odhalil své strategické plány na využití konkrétní technologie proti technologickým gigantům Google (GOOG) a Apple (AAPL).",
      "Obsah e-mailu byl zveřejněn 16. září 2023 prostřednictvím tweetu na účtu známém jako \"Internal Tech Emails\".",
      "Konkrétní technologie, která má být použita proti společnostem Google a Apple, není v poskytnutém úryvku zmíněna."
    ],
    "commentSummary": [
      "V rozhovorech se probírají různá témata, jako je vstup společnosti Apple do herního průmyslu na iPhonu, debaty o pronájmu a vlastnictví produktů a vliv streamovacích služeb na herní průmysl.",
      "Dalšími tématy jsou přístupy společnosti Microsoft ke konkurenci společnosti Apple, prostředí cloudových herních služeb, rozdílné styly komunikace generálních ředitelů a strategie firemní komunikace a uchovávání dat.",
      "Účastníci nabízejí širokou škálu pohledů, což vede k živým debatám o mnoha aspektech těchto témat."
    ],
    "points": 197,
    "commentCount": 201,
    "retryCount": 0,
    "time": 1694903228
  },
  {
    "id": 37535814,
    "title": "Pro dnešní akademický systém bych nebyl dostatečně produktivní (2013)",
    "originLink": "https://www.theguardian.com/science/2013/dec/06/peter-higgs-boson-academic-system",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37535814",
    "commentBody": "",
    "originSummary": [
      "Peter Higgs, fyzik známý díky objevu Higgsova bosonu, vyjadřuje pochybnosti, zda by splnil standardy produktivity dnešního akademického systému.",
      "Higgs naznačuje, že vzhledem k současnému tlaku na vědce, aby neustále publikovali a spolupracovali, je dosažení jedinečného průlomu podobného tomu jeho nepravděpodobné.",
      "Lituje toho, že Higgsův boson je označován za \"božskou částici\", a prozrazuje, že jeho kariéra byla kdysi ohrožena kvůli neshodám s ředitelem Edinburské univerzity."
    ],
    "commentSummary": [
      "Článek se zabývá současným tlakem na vědce, aby si udrželi produktivitu, přičemž metriky se používají jako nástroje k hodnocení jejich práce. Zdůrazňuje roli politiků, administrátorů a vědců při utváření akademického systému.",
      "Poukazuje na snižování počtu podnikových výzkumných a vývojových laboratoří, následný přesun na akademickou půdu a diskutuje o omezeních metrik při měření produktivity výzkumu; předkládá kritiku přílišného spoléhání se na publikační metriky a jejich škodlivý vliv na kvalitu výzkumu.",
      "Diskuse se dále zabývá překážkami svobody výzkumu, zkoumáním alternativních kariérních cest a konfliktem mezi spoléháním se na metriky a pěstováním důvěry v akademickém prostředí; kritizuje současný akademický systém za to, že podporuje kariérismus na úkor inovativního výzkumu."
    ],
    "points": 195,
    "commentCount": 102,
    "retryCount": 0,
    "time": 1694879199
  },
  {
    "id": 37536103,
    "title": "Databázové servery, které pohánějí službu Let's Encrypt (2021)",
    "originLink": "https://letsencrypt.org/2021/01/21/next-gen-database-servers.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37536103",
    "commentBody": "",
    "originSummary": [
      "Certifikační autorita Let's Encrypt, která poskytuje certifikáty TLS pro různé webové stránky, vylepšila své databázové servery pro lepší výkon a škálovatelnost.",
      "Organizace se rozhodla pro upgrade pomocí čipů AMD EPYC a serverů Dell PowerEdge R7525, které zdvojnásobily výkon a umožnily využití disků NVMe, čímž se účinně snížila doba zpracování požadavků API a latence databáze.",
      "Soubor OpenZFS byl začleněn do správy disků NVMe jako součást upgradu s cílem přizpůsobit se rostoucí závislosti na systému Let's Encrypt pro zabezpečenou webovou komunikaci."
    ],
    "commentSummary": [
      "Společnost Let's Encrypt vylepšila své databázové servery o procesory AMD EPYC a disky SSD NVMe, čímž zlepšila výkon i škálovatelnost a výrazně zvýšila denní počet vydaných certifikátů.",
      "Diskutuje se také o srovnání s jinými databázemi a úspoře nákladů oproti hostingu AWS, což vyvolává debatu mezi využitím cloudových služeb nebo investicí do fyzického hardwaru.",
      "Jsou navrženy alternativní strategie, jako je pronájem vyhrazených serverů nebo využití kolokačních služeb, a zdůrazněna potřeba zohlednit při rozhodování jedinečné okolnosti a pracovní zátěž."
    ],
    "points": 186,
    "commentCount": 98,
    "retryCount": 0,
    "time": 1694880983
  },
  {
    "id": 37536361,
    "title": "Jedná se o podvod? A pokud ano, do jaké míry jsem za to zodpovědný?",
    "originLink": "https://workplace.stackexchange.com/questions/193234/is-this-fraud-and-if-so-to-what-extent-am-i-responsible",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37536361",
    "commentBody": "",
    "originSummary": [
      "Vedoucí technický pracovník čelí nátlaku, aby se podílel na nekalém jednání souvisejícím se zadávacím řízením klienta, což vyvolává obavy z osobní odpovědnosti a možného odstoupení.",
      "Zaměstnanec by měl například vyhledat právního poradce, zdokumentovat všechny relevantní interakce, případně upozornit klienta a zvážit alternativní zaměstnání.",
      "I když kultura klamání může usnadnit okamžitý prodej, je zdůrazněno, že zachování poctivosti, provádění penetračních testů a řešení obtížných otázek je symbolem etických obchodních praktik."
    ],
    "commentSummary": [
      "Diskuse se zaměřuje na etické problémy, kterým čelí zaměstnanec, který je požádán, aby se podílel na podvodných praktikách týkajících se technických prohlášení a testování bezpečnosti.",
      "Zabývá se možnými důsledky, včetně hodnoty čestnosti a poctivosti, možných právních důsledků a navrhuje opatření, jako je vyhledání právního poradenství, dokumentace a zdržení se takových činností.",
      "Další část diskuse tvoří názvy pracovních pozic, formuláře pro dodržování předpisů a složitost etického rozhodování v profesním kontextu."
    ],
    "points": 183,
    "commentCount": 199,
    "retryCount": 0,
    "time": 1694882569
  },
  {
    "id": 37538400,
    "title": "Propouštění zaměstnanců.fyi",
    "originLink": "https://layoffs.fyi/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37538400",
    "commentBody": "",
    "originSummary": [
      "Zakladatel startupu vytvořil webovou stránku, která monitoruje propouštění v technologickém průmyslu během pandemie COVID-19.",
      "Webová stránka sledovala propouštění ve více než 1 000 technologických společnostech a uvádí ohromující celkový počet více než 235 000 propuštěných zaměstnanců.",
      "Kromě sledování propouštění poskytuje web také bezplatné srovnávací údaje o platech ve více než 3 000 technologických firmách, které nabízejí cenné informace o odvětví v tomto náročném období."
    ],
    "commentSummary": [
      "Článek upozorňuje na pokles propouštění v technologickém průmyslu a rozebírá ekonomické problémy, kterým společnosti čelí. Naznačuje také možné tajné dohody mezi velkými technologickými firmami a tvrdí, že některá propouštění mohou být způsobena změnami v politice práce na dálku nebo mandáty pro návrat do kanceláře.",
      "Diskuse se zabývá legálností požadavku na přemístění zaměstnanců bez náhrady, konceptem \"konstruktivního propuštění\" a možnými výhodami zakládání odborů pro práva na práci na dálku.",
      "Text zmiňuje webovou stránku, která uvádí seznam propouštěných zaměstnanců v technologickém průmyslu, a zabývá se vlivem rizikového kapitálu a úrokových sazeb na rozhodování o propouštění. Uvádí také tabulku společnosti Google s informacemi o propuštěných zaměstnancích, která vyvolala různé reakce."
    ],
    "points": 157,
    "commentCount": 63,
    "retryCount": 0,
    "time": 1694896103
  },
  {
    "id": 37537689,
    "title": "Provozování vlastní kořenové certifikační autority v roce 2023",
    "originLink": "https://wejn.org/2023/09/running-ones-own-root-certificate-authority-in-2023/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37537689",
    "commentBody": "",
    "originSummary": [
      "Článek poskytuje návod na nastavení kořenové certifikační autority (CA) pro zabezpečení internetu, popisuje omezení bezplatných alternativ a ukazuje, jak generovat certifikáty CA a hostitele.",
      "Obsahuje technické požadavky na doručování certifikátů certifikačních autorit, příklady kódu a osobní zkušenosti autora se správou kořenové certifikační autority.",
      "Upozorňuje na rizika tohoto procesu a zdůrazňuje důležitost dodržování bezpečnostních opatření, jako je používání omezení názvů pro zabezpečení, ochrana tajemství a každoroční rotace certifikátů."
    ],
    "commentSummary": [
      "Článek se zabývá výhodami a problémy provozu doménově specifické certifikační autority (CA), která je klíčovým nástrojem pro správu digitálních certifikátů, jako alternativy k běžným certifikačním autoritám.",
      "Upozorňuje na složitost a nákladnost tohoto systému a zdůrazňuje potřebu jednodušších a nákladově efektivních řešení správy certifikátů. Zdůrazněna je také hodnota provozování spolehlivé certifikační autority pro interní potřeby.",
      "Zabývá se také otázkami týkajícími se specifických kombinací softwaru s Let's Encrypt, upřednostňováním eliptické kryptografie před RSA pro zabezpečení a požadavky na bezpečnou distribuci a odvolávání kořenových certifikátů."
    ],
    "points": 157,
    "commentCount": 107,
    "retryCount": 0,
    "time": 1694891275
  },
  {
    "id": 37539686,
    "title": "SoC Phoenix společnosti AMD",
    "originLink": "https://chipsandcheese.com/2023/09/16/hot-chips-2023-amds-phoenix-soc/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37539686",
    "commentBody": "",
    "originSummary": [
      "Společnost AMD vytvořila SoC Phoenix, který obsahuje jádra Zen 4 a grafiku RDNA 3 pro zvýšení energetické účinnosti a výkonu kompaktních a mobilních zařízení.",
      "Čip vyrobený na procesu N4 společnosti TSMC obsahuje různé akcelerátory, nový grafický procesor s větší šířkou paměťového pásma a možnosti zpracování video kodeků nové generace.",
      "Kromě toho APU Phoenix přináší vylepšení v oblasti spotřeby energie a výkonu strojového učení a zpracování zvuku, čímž se AMD stává silným soupeřem společnosti Intel."
    ],
    "commentSummary": [
      "SoC AMD Phoenix, uznávaný pro svůj výkon a herní schopnosti, není v ultraboocích snadno dostupný, což uživatelům působí potíže.",
      "Mezi chválou se objevují obavy o soukromí a bezpečnost kvůli funkci ultrazvuku SoC, což vede ke srovnávání s Plutonem od Microsoftu a debatám o dokumentačních postupech.",
      "Mezi další témata patří potenciální integrace enginu umělé inteligence XDNA společnosti AMD do platformy ROCm, přijetí XDNA vývojáři, absence ovladačů OpenCL a důsledky přijetí FPGA."
    ],
    "points": 145,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1694905389
  },
  {
    "id": 37538482,
    "title": "Linux na MacBooku Pro (M1 Pro): Jak dobrý je nyní Asahi?",
    "originLink": "https://www.youtube.com/watch?v=ZFx6R26aRHw",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37538482",
    "commentBody": "",
    "originSummary": [
      "Autor experimentoval s Asahi Linuxem na MacBooku Pro s procesorem M1 Pro a zjistil, že některé funkce fungují hladce, ale existují omezení, jako je omezená funkčnost USB a nefunkční porty externího displeje.",
      "Ačkoli výkon procesoru a výdrž baterie při streamování YouTube byly ve srovnání se systémem macOS o něco nižší, instalace ovladačů GPU zajistila lepší výdrž baterie.",
      "Ačkoli je Asahi Linux pro MacBook Pro použitelný, jeho herní možnosti a podpora aplikací zůstávají omezené. Autor proto doporučuje zvážit zařízení, jako je notebook nebo stolní počítač Tuxedo, který je dodáván s předinstalovaným Linuxem pro optimálnější zážitek."
    ],
    "commentSummary": [
      "Rozhovor se soustředí na problémy s používáním Linuxu na MacBoocích Apple s procesorem M1, včetně podpory hardwaru, spotřeby energie a nedostatku některých funkcí.",
      "Uživatelé diskutují o rozhodnutí zakoupit hardware od společnosti Apple, která v současné době Linux nepodporuje, a diskutují o výhodách a nevýhodách používání hardwaru Mac oproti jiným možnostem.",
      "V diskusi je také zdůrazněn pokrok ve vývoji systému Asahi Linux a různé názory na praktičnost a atraktivitu použití systému Linux na zařízeních Apple Silicon kvůli rozdílům ve stabilitě a kompatibilitě systému."
    ],
    "points": 142,
    "commentCount": 91,
    "retryCount": 0,
    "time": 1694896828
  },
  {
    "id": 37535910,
    "title": "Samočinný spalovací motor Unity",
    "originLink": "https://www.gamesindustry.biz/unitys-self-combustion-engine-this-week-in-business",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37535910",
    "commentBody": "",
    "originSummary": [
      "Unity, známá platforma pro vývoj her, se setkala se značným nesouhlasem poté, co se rozhodla zavést poplatek za spuštění na základě herních instalací, což vyvolalo zmatek mezi vývojáři her.",
      "Nový poplatek vyvolal odpor, který přiměl některá studia ke stažení reklam a zvažování změny herního enginu, přičemž k reakci přispěly i minulé kontroverze, propouštění a vnímaná nedůvěra v Unity.",
      "Kritici zpochybňují motivy zavedení poplatků a spekulují, že za ním mohou být finanční problémy Jednoty, včetně nahromaděných deficitů a neziskovosti. Tvrdí, že porušuje dřívější slib Jednoty, že nebude vybírat žádné poplatky, a je v rozporu se zásadami transparentnosti a spravedlnosti."
    ],
    "commentSummary": [
      "Článek se zabývá kontroverzí, kterou vyvolala nová struktura poplatků společnosti Unity, jež vyvolala kritiku ze strany vývojářů.",
      "Přináší diskuse o možných alternativách herního enginu Unity a spekuluje o možných kupcích společnosti.",
      "Důvěryhodnost vedení společnosti Unity a účinnost jejího platebního modelu je zpochybňována, stejně jako dopad, kdyby společnost Unity měla exkluzivitu pro Apple."
    ],
    "points": 136,
    "commentCount": 139,
    "retryCount": 0,
    "time": 1694879832
  },
  {
    "id": 37541243,
    "title": "10 % nejbohatších Američanů je zodpovědných za 40 % znečištění planety.",
    "originLink": "https://journals.plos.org/climate/article?id=10.1371/journal.pclm.0000190",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37541243",
    "commentBody": "",
    "originSummary": [
      "Tato studie zkoumá uhlíkovou stopu amerických domácností v závislosti na příjmech v letech 1990-2019 a identifikuje hlavní nerovnosti v emisích mezi ekonomickými a rasovými demografickými skupinami.",
      "Výzkum navrhuje uhlíkovou daň z investic jako možnou strategii pro podporu dekarbonizace a zvýšení financování opatření v oblasti klimatu.",
      "Studie poukazuje na významný podíl \"superemitentů\", především 0,1 % nejvyšší příjmové skupiny, na emisích a zdůrazňuje potřebu řešit tuto nerovnost v emisích. Uznává také možné nedostatky související s nezaslouženými příjmy a investičními portfolii."
    ],
    "commentSummary": [
      "Nedávná studie uvádí, že 10 % nejlépe vydělávajících Američanů je zodpovědných za 40 % znečištění klimatu v zemi.",
      "Diskuse o tomto tématu se zaměřuje na povinnosti bohatých, možná řešení, jako jsou uhlíkové daně, a význam osobní odpovědnosti při přijímání etických rozhodnutí, která mají snížit škody na životním prostředí.",
      "Zmíněná témata zahrnují také válčení, spotřební vzorce a úlohu vlády při kontrole škodlivých praktik, přičemž hlavní důraz je kladen na hledání účinných řešení pro snížení emisí a zmírnění dopadu na životní prostředí."
    ],
    "points": 130,
    "commentCount": 98,
    "retryCount": 0,
    "time": 1694921470
  },
  {
    "id": 37533747,
    "title": "BtrBlocks: Efektivní sloupcová komprese pro datová jezera [pdf]",
    "originLink": "https://www.cs.cit.tum.de/fileadmin/w00cfj/dis/papers/btrblocks.pdf",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37533747",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Článek představuje BtrBlocks, nový sloupcový kompresní formát určený ke zvýšení efektivity datových jezer.",
      "BtrBlocks je srovnáván s existujícími formáty, jako jsou Parquet a Arrow, a může se pochlubit vysokým kompresním poměrem, konkurenceschopnou rychlostí komprese a vynikajícím výkonem dekomprese.",
      "Pojednává také o výzvách optimalizace formátů datových jezer pro nepředvídané budoucí aplikace a o složitosti identifikace ideálních kompresních technik."
    ],
    "points": 128,
    "commentCount": 22,
    "retryCount": 0,
    "time": 1694862509
  }
]
