[
  {
    "title": "South Korea to Invest $592M for Eco-friendly, Smart Ship Technologies to Secure Global Leadership by 2030",
    "originLink": "https://www.chosun.com/economy/economy_general/2023/11/15/L2DDYB3ZYBGHXA5RQMHHECCTD4/",
    "originBody": "",
    "originSummary": [
      "The South Korean government plans to invest around $592 million by 2028 to increase its eco-friendly and smart ship market share to over 80% from current 56%.",
      "They intend to spend 200 billion won on commercialising key decarbonisation fuel technologies such as LNG (Liquefied Natural Gas), ammonia, and hydrogen to lead the market in LNG and ammonia-driven ships.",
      "The Ministry of Oceans and Fisheries has plans to establish Ulsan Port as an eco-friendly fuel supply port and supply over 25% of eco-friendly fuel demand for ships in domestic ports from the public sector by 2027."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700228866123
  },
  {
    "title": "Global Agriculture Shifts to Eco-Friendly Produce Through Advanced Technologies Amid Climate Concerns",
    "originLink": "https://www.donga.com/news/It/article/all/20231117/122229091/1",
    "originBody": "",
    "originSummary": [
      "전 세계 농업 산업은 Covid-19와 기후 변화의 영향으로 친환경 농업 제품에 초점을 맞추고 있으며, 이로 인해 디지털 및 통신 기술의 사용이 늘고 있습니다.",
      "미국, 중국, 유럽, 그리고 한국과 같은 국가들은 토지 관리, 생산량 증가 및 탄소 배출량 감소를 위해 AI와 고도화된 농업 기법에 투자하고 있습니다.",
      "전망에 따르면, 전 세계 유기농 식품 시장은 매년 14%씩 성장하여 2026년에는 4374억 달러에 이를 것이며, 전 세계 온라인 농업 식품 시장은 2020년 이후로 연 20.5% 증가하여 2024년에는 1.77조 달러에 이를 것으로 예상됩니다."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700228866123
  },
  {
    "title": "South Korea's President Yoon Advocates for Carbon-Free Alliance and Green Maritime Routes at APEC Summit",
    "originLink": "https://m.news.nate.com/view/20231117n18958",
    "originBody": "",
    "originSummary": [
      "대한민국의 윤석열 대통령은 APEC(APEC) 정상회의에서 '탄소 무료 연합의' 형성에 회원국들의 협력을 요청하고, 한국이 친환경 선박 운송 시스템을 구축하기 위해 노력하고 있다고 밝혔습니다.",
      "윤 대통령은 APEC 내 친환경 교통의 확산을 주장하면서, 바다에서의 탄소 중립 실현을 위해 녹색 해상 루트의 지속적인 건설을 약속했습니다.",
      "윤 대통령은 정상회의 동안 중국의 시진핑 주석과 간단한 대화를 나눴지만, 두 나라 간 양자 정상회의에 대한 확신은 없습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "브로드밴드 연결성은 밀레니얼 세대에게 중요한 요소로 작용하며, 이들은 뛰어난 연결성을 제공하는 지역에서 더 높은 임대료 또는 주택 가격을 지불할 확률이 높습니다.",
      "IDC의 연구에 따르면, 설문 조사에 참여한 밀레니얼 세대의 68%가 뛰어난 브로드밴드 연결성을 갖춘 주택을 '절대적으로 필수적'이라고 평가했습니다.",
      "또한 설문 조사 결과, 대략 80%의 응답자들이 자신들의 연결성 기준을 충족하지 않는 potential property를 거절할 것이라고 답했습니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700228866123
  },
  {
    "title": "Ulsan and Busan Ports Collaborate for Eco-friendly Bunkering; Hyundai Partners with Amazon",
    "originLink": "https://www.hankyung.com/article/202311175727Y",
    "originBody": "",
    "originSummary": [
      "Ulsan Port Authority와 Busan Port Authority가 친환경 배송 연료 충전을 지원하기 위해 협력하며, 이는 해양수산부의 친환경 배송 연료 공급 네트워크 확장 계획의 일환입니다.",
      "Hyundai는 Amazon과 전략적 파트너십을 맺어 미국 고객이 온라인 소매 업체에서 Hyundai 차량을 직접 구매할 수 있도록 하였습니다.",
      "2023년 1월부터, 몇몇 딜러들이 Amazon에서 자신들의 새롭고 사용 중인 차량을 등록할 예정입니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "BMW, Toyota Motor Corp., Volkswagen 등의 전통적인 자동차 회사들이 Google, Apple, Tesla 등의 기술 회사들이 자동차 섹터에서 점점 늘어나며 위협을 느끼고 있습니다.",
      "이들 전통적인 회사들은 차량 내부의 하드웨어와 소프트웨어에 대한 컨트롤을 잃는 것, 그리고 연결된 차량이 생성하는 유용한 데이터를 잃는 것에 대해 걱정하고 있습니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700228866123
  },
  {
    "title": "Ulsan and Busan Ports Unite for Green Ship Fuel Supply Network Development",
    "originLink": "https://www.busan.com/view/busan/view.php?code=2023111720054076670",
    "originBody": "",
    "originSummary": [
      "울산 항만청과 부산 항만청은 친환경 선박 연료 공급 네트워크를 구축하기 위해 협력하고 있습니다.",
      "이 네트워크는 친환경 연료에 대한 정보 플랫폼과 글로벌 마케팅 노력을 포함할 것입니다.",
      "이 파트너십은 LNG, 메탄올, 그리고 수소 에너지 물류와 연관된 프로젝트를 가속화할 가능성이 있습니다."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700228866123
  },
  {
    "title": "POSCO Flow Discusses Eco-Friendly Shipping Solutions in Response to Greenhouse Gas Regulations at National Assembly",
    "originLink": "https://newsroom.posco.com/kr/%ED%8F%AC%EC%8A%A4%EC%BD%94%ED%94%8C%EB%A1%9C%EC%9A%B0-%EA%B5%AD%ED%9A%8C%EC%84%9C-%EC%98%A8%EC%8B%A4%EA%B0%80%EC%8A%A4-%ED%99%98%EA%B2%BD-%EA%B7%9C%EC%A0%9C-%EB%8C%80%EC%9D%91%ED%95%98%EB%8A%94/",
    "originBody": "",
    "originSummary": [
      "POSCO Flow는 전세계의 환경 규제 및 온실가스 배출 관리에 대응한 친환경 해운 솔루션 개발 및 배포 전략에 관해 논의하기 위해 한국 국회에서 열린 정책 토론회에 참석했습니다.",
      "정부, 학계, 물류 산업이 참석한 이번 토론회에서는 친환경 해운으로의 전환을 위한 정부 및 민간 부문의 협력에 대한 필요성이 강조되었습니다.",
      "POSCO Flow의 미래 전략은 LNG, 암모니아, 수소 등의 친환경 화물을 점진적으로 도입하고 친환경 선박 건설에 적극 투자하는 것을 포함하여, 2050년 탄소 중립 로드맵을 따르고 있습니다."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700228866123
  },
  {
    "title": "Busan and Ulsan Port Authorities Collaborate for Eco-friendly Ship Fuel Supply",
    "originLink": "https://m.nocutnews.co.kr/news/6048054",
    "originBody": "",
    "originSummary": [
      "부산 항만공사와 울산 항만공사는 부산 항에서 친환경 선박 연료에 대한 수요 증가에 대응하기 위해 협력하고 있습니다.",
      "이는 연료 공급 (벙커링)용 인프라 및 벙커링 시장에 대한 인센티브 제공, 그리고 관련 시스템과 규제 개선을 포함하고 있습니다.",
      "계획에는 LNG(액화 천연가스) 및 메탄올과 같은 연료를 선박 간 방식으로 공급하는 것이 포함되어 있습니다."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700228866123
  }
]
