[
  {
    "id": 38241304,
    "title": "HTML முதலில்: வலை மென்பொருள் மேம்பாட்டை எளிமைப்படுத்துதல் மற்றும் அணுகலை அதிகரித்தல்",
    "originLink": "https://html-first.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38241304",
    "commentBody": "",
    "originSummary": [
      "HTML First என்பது வலை மென்பொருளை உருவாக்கும் செயல்முறையை எளிமைப்படுத்துவதையும் மேம்படுத்துவதையும் நோக்கமாகக் கொண்ட கொள்கைகளின் தொகுப்பாகும்.",
      "எச்.டி.எம்.எல் இன் பண்புக்கூறுகள் மற்றும் நவீன வலை உலாவிகளின் இயல்புநிலை திறன்களை மேம்படுத்துவதன் மூலம் வலை நிரலாக்கத்தை மிகவும் அணுகக்கூடியதாக மாற்றுவதும் செலவுகளைக் குறைப்பதும் முக்கிய குறிக்கோள்.",
      "கொள்கைகள் எச்.டி.எம்.எல் பண்புகளைப் பயன்படுத்தும் வெண்ணிலா அணுகுமுறைகள் மற்றும் நூலகங்களைப் பயன்படுத்துவதை ஊக்குவிக்கின்றன, அதே நேரத்தில் குறியீட்டை குறைவாக படிக்கக்கூடியதாக மாற்றும் மற்றும் மூலக் குறியீடு புரிதலைத் தடுக்கும் படிகள் மற்றும் குழப்பமான அடுக்குகளை உருவாக்குவதை ஊக்குவிக்கின்றன."
    ],
    "commentSummary": [
      "HTML, கட்டமைப்புகள், நூலகங்கள், திட்டத் தேவைகள் மற்றும் அணுகல் உள்ளிட்ட வலை வளர்ச்சியின் பல அம்சங்களை விவாதங்கள் உள்ளடக்குகின்றன.",
      "சிறிய திட்டங்களுக்கு சிக்கலான கட்டமைப்புகளைப் பயன்படுத்துவது மற்றும் வெவ்வேறு அணுகுமுறைகளின் நன்மை தீமைகள் குறித்து விவாதங்கள் உள்ளன.",
      "தேதி எடுப்பவர்கள், படிகளை உருவாக்குதல், குறியீடு பகுப்பாய்வு மற்றும் செயல்திறன் மற்றும் பயனர் அனுபவத்தில் அவற்றின் தாக்கம் போன்ற தலைப்புகளையும் விவாதங்கள் தொடுகின்றன."
    ],
    "points": 793,
    "commentCount": 484,
    "retryCount": 0,
    "time": 1699804836
  },
  {
    "id": 38243949,
    "title": "திறந்த மூல டி-பாயிண்ட் டிஜிட்டல் பேனா ஆறு டிகிரி சுதந்திரத்துடன் துல்லியமான ஸ்டைலஸ் உள்ளீட்டை வழங்குகிறது",
    "originLink": "https://github.com/Jcparkyn/dpoint",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38243949",
    "commentBody": "",
    "originSummary": [
      "டி-பாயிண்ட் டிஜிட்டல் பேனா என்பது ஒரு திறந்த மூல ஸ்டைலஸ் ஆகும், இது கேமரா கண்காணிப்பு மற்றும் மந்தநிலை அளவீடுகளைப் பயன்படுத்தி துல்லியமான மற்றும் குறைந்த தாமத உள்ளீட்டை வழங்குகிறது.",
      "இது எந்த தட்டையான மேற்பரப்பிலும் பயன்படுத்தப்படலாம் மற்றும் நுகர்வோர் தர வெப்கேம்களுடன் இணக்கமானது.",
      "துல்லியத்தை மேம்படுத்துவதற்கும் தாமதத்தைக் குறைப்பதற்கும் மார்க்கர் கண்டறிதல், ரோலிங் ஷட்டர் திருத்தம் மற்றும் மந்தநிலை இணைவு உள்ளிட்ட பல தொழில்நுட்பங்களை ஸ்டைலஸ் உள்ளடக்கியது."
    ],
    "commentSummary": [
      "மெய்நிகர் சூழல்கள் மற்றும் விளையாட்டுகளில் மிகவும் துல்லியமான கட்டுப்பாடு மற்றும் தொடர்புக்காக திறந்த மூல தொழில்நுட்பங்கள் மற்றும் சாதனங்கள் விவாதிக்கப்படுகின்றன.",
      "தலைப்புகளில் பல உள்ளீட்டு சாதனங்களின் பயன்பாடு, தனியுரிம இயக்கிகளின் வரம்புகள், விண்வெளி விளையாட்டுகளில் சாத்தியமான பயன்பாடுகள் மற்றும் புதிய உள்ளீட்டு முறைகளுக்கு வெப்கேம்களைப் பயன்படுத்துதல் ஆகியவை அடங்கும்.",
      "விவாதங்கள் விண்வெளி அடிப்படையிலான பொருள்-அலை இன்டர்ஃபெரோமெட்ரி, குவாண்டம் வழிசெலுத்தல், தொடு பேனல்கள், கை கண்காணிப்பு மற்றும் வரைதல் பயன்பாடுகளையும் உள்ளடக்குகின்றன."
    ],
    "points": 461,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1699822110
  },
  {
    "id": 38242946,
    "title": "முழு எண்களின் இரண்டாவது முதன்மைக் காரணியின் சராசரி மதிப்பு 37 ஆக உறுதிப்படுத்தப்பட்டுள்ளது என்று புக் கூறுகிறது",
    "originLink": "https://grossack.site/2023/11/08/37-median.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38242946",
    "commentBody": "",
    "originSummary": [
      "\"அந்த கவர்ச்சிகரமான எண்கள்\" என்ற புத்தகம் முன்னுரையில் ஒரு முழு எண்களின் இரண்டாவது முதன்மை காரணியான 37 க்கான சராசரி மதிப்பைப் பற்றிய ஒரு புதிரான உண்மையை எடுத்துக்காட்டுகிறது.",
      "ஆரம்ப சந்தேகத்திற்குப் பிறகு, ஆசிரியர் உண்மையை சோதிக்க சேஜ் குறியீட்டை எழுதினார், மேலும் அனைத்து எண்களிலும் பாதிக்கும் மேற்பட்டவை 37 ஐ விட குறைவான இரண்டாவது முதன்மை காரணியைக் கொண்டுள்ளன என்பதை உறுதிப்படுத்தினார்.",
      "இந்த இடுகை முக்கிய காரணிகள் தொடர்பான கூடுதல் பயிற்சிகளை பரிந்துரைக்கிறது மற்றும் முக்கிய காரணிகளின் விநியோகம் மற்றும் பிரெஞ்சு மொழியில் நடுத்தர கே.டி.எச் முதன்மையின் அறிகுறிகள் பற்றிய ஒரு ஆராய்ச்சிக் கட்டுரையைக் குறிப்பிடுகிறது."
    ],
    "commentSummary": [
      "விவாதம் 37, 0 மற்றும் 1 போன்ற எண்களின் பண்புகள் மற்றும் முக்கியத்துவத்தை ஆராய்வதைச் சுற்றி சுழல்கிறது.",
      "பங்கேற்பாளர்கள் ஒரு எண்ணை சுவாரஸ்யமாக்குவது எது என்ற கருத்தை விவாதித்து, இந்த எண்கள் தொடர்பான கணிதக் கொள்கைகள் மற்றும் உறவுகளை ஆராய்கிறார்கள்.",
      "முதன்மைக் காரணிகள், வரையறைகள், அடிப்படை -10 தந்திரங்கள், முதன்மை எண்கள் மற்றும் முக்கோண எண்கள் ஆகியவை அடங்கும்."
    ],
    "points": 389,
    "commentCount": 179,
    "retryCount": 0,
    "time": 1699814748
  },
  {
    "id": 38240861,
    "title": "Iddlethumbs.social: மாஸ்டோடனால் இயக்கப்படும் ஒரு பரவலாக்கப்பட்ட சமூக வலைப்பின்னல்",
    "originLink": "https://idlethumbs.social/@ja2ke/111396017651485944",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38240861",
    "commentBody": "",
    "originSummary": [
      "iddlethumbs.social என்பது மாஸ்டோடனால் இயக்கப்படும் ஒரு பரவலாக்கப்பட்ட சமூக வலைப்பின்னல் ஆகும்.",
      "பயனர்கள் ஒரு கணக்கை உருவாக்கலாம், உள்நுழையலாம் மற்றும் தளத்தில் மீடியா, கருத்துக்கணிப்புகள் அல்லது உட்பொதிக்கப்பட்ட உள்ளடக்கத்தைத் தேடலாம்.",
      "சுயவிவரங்கள் அல்லது ஹேஷ்டேக்குகளைப் பின்பற்றுதல், இடுகைகளுக்கு ஆதரவளித்தல், பகிர்தல் மற்றும் பதிலளிப்பது, அத்துடன் வேறு சேவையகத்தில் கணக்கிலிருந்து தொடர்புகொள்வது போன்ற இடைவினைகளை தளம் செயல்படுத்துகிறது. சேவையக புள்ளிவிவரங்களும் கிடைக்கின்றன. மேலும் தகவல்களை ஐடில்தம்ப்ஸ்.சோஷியல் மற்றும் மாஸ்டோடன் வலைத்தளங்களில் காணலாம்."
    ],
    "commentSummary": [
      "வால்வின் ஸ்டீம் டெக் ஓஎல்இடி ஸ்பாட் விளம்பரம் கேம் போர்ட்டலில் இருந்து ஒரு கட்சீனுடன் ஒத்திருப்பதற்காக பாராட்டப்படுகிறது, இது வீடியோ தயாரிப்பு செயல்முறைகள் மற்றும் செயற்கை நுண்ணறிவு உருவாக்கிய திரைப்பட காட்சிகளுக்கான திறன் குறித்த விவாதங்களைத் தூண்டுகிறது.",
      "ஸ்டீம் டெக் உள்ளிட்ட லினக்ஸ் மற்றும் அவற்றின் தயாரிப்புகளுக்கான வால்வின் ஆதரவு, கேமிங் சமூகத்தில் இயக்க முறைமையை ஏற்றுக்கொள்வதில் அவர்களின் பங்களிப்பிற்காக முன்னிலைப்படுத்தப்படுகிறது.",
      "நீராவி பயன்பாட்டிற்கான கட்டண அமைப்பு மற்றும் சாத்தியமான மேம்பாடுகள், இயக்க முறைமைகளில் உள்ள வெவ்வேறு கர்னல்கள், ஸ்டீம் டெக்கிற்கான ஓஎல்இடி பேனல் சப்ளையர், எரியும் அபாயங்கள், பழுதுபார்க்கும் திறன் மற்றும் ஸ்டீம் டெக்கிற்காக பிரத்யேகமாக வடிவமைக்கப்பட்ட டெக்மேட் துணை ஆகியவை விவாதத்தின் பிற தலைப்புகளில் அடங்கும்."
    ],
    "points": 389,
    "commentCount": 60,
    "retryCount": 0,
    "time": 1699802441
  },
  {
    "id": 38240421,
    "title": "ஜிபியுக்களுடன் செயற்கை நுண்ணறிவை விரைவுபடுத்துதல்: செயற்கை நுண்ணறிவு யுகத்திற்கான விரிவான கருவித்தொகுப்பு",
    "originLink": "https://journal.hexmos.com/gpu-survival-toolkit/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38240421",
    "commentBody": "",
    "originSummary": [
      "ஜி.பி.யுக்கள் அவற்றின் இணை செயலாக்க திறன்கள் காரணமாக செயற்கை நுண்ணறிவு யுகத்தில் முக்கியமானவை, அவை செயற்கை நுண்ணறிவு மாதிரிகளை இயக்குவதற்கு மிகவும் திறமையானவை.",
      "இந்த கட்டுரை குடா மற்றும் என்விடியா ஜிபியு இயக்கிகளை அமைப்பதற்கான வழிகாட்டியை வழங்குகிறது மற்றும் ஜி.பி.யுக்களை நிர்வகித்தல் மற்றும் குடா கட்டமைப்போடு குறியீட்டை மேம்படுத்துவதற்கான எடுத்துக்காட்டுகளைக் காட்டுகிறது.",
      "இது நும்பா நூலகம் மற்றும் டென்சர்ஃப்ளோவுடன் ஃபிராக்டல்களை உருவாக்குவதற்கும் நரம்பியல் நெட்வொர்க்குகளுக்கு பயிற்சியளிப்பதற்கும் ஜிபியூ முடுக்கத்தை நிரூபிக்கிறது, இது பல்வேறு துறைகளில் சிக்கலான கணக்கீடுகளை விரைவுபடுத்துவதில் ஜிபியூக்களின் முக்கியத்துவத்தை எடுத்துக்காட்டுகிறது."
    ],
    "commentSummary": [
      "செயற்கை நுண்ணறிவு வளர்ச்சியில் ஜி.பி.யு.க்களின் பயன்பாடு மற்றும் இதில் உள்ள சாத்தியமான நன்மைகள் மற்றும் சவால்களை மையமாகக் கொண்டது இந்த விவாதம்.",
      "வெவ்வேறு பங்கேற்பாளர்கள் டெவலப்பர்களுக்கான செயற்கை நுண்ணறிவு அறிவின் முக்கியத்துவம் மற்றும் சிபியூக்கள் மற்றும் ஜிபியுக்களுக்கு இடையிலான செயல்திறன் வேறுபாடுகள் குறித்து மாறுபட்ட கருத்துக்களை வெளிப்படுத்துகிறார்கள்.",
      "வன்பொருளைப் புரிந்துகொள்வதன் முக்கியத்துவம், செயற்கை நுண்ணறிவில் பைத்தானின் ஆதிக்கம், செயல்திறன் மேம்பாட்டிற்கான மல்டித்ரெடிங் மற்றும் சிம்டி வழிமுறைகளின் திறன் மற்றும் ஜிபியு நிரலாக்கத்திற்கு ஏசாரா மற்றும் கூடா போன்ற குறிப்பிட்ட கருவிகளைப் பயன்படுத்துதல் போன்ற தலைப்புகளும் விவாதத்தில் அடங்கும்."
    ],
    "points": 276,
    "commentCount": 151,
    "retryCount": 0,
    "time": 1699799845
  },
  {
    "id": 38239728,
    "title": "பயிற்சியாளர் கையேடு: டிஜிட்டல் யுகத்தில் திறந்த, கடுமையான மற்றும் மீளுருவாக்கம் செய்யக்கூடிய ஆராய்ச்சியை வலியுறுத்துதல்",
    "originLink": "https://stanforddatascience.github.io/best-practices/index.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38239728",
    "commentBody": "",
    "originSummary": [
      "திறந்த, வெளிப்படையான மற்றும் மீளுருவாக்கம் செய்யக்கூடிய ஆராய்ச்சியின் முக்கியத்துவத்தை கையேடு வலியுறுத்துகிறது.",
      "பரவலாக அணுக முடியாத ஆராய்ச்சியின் வரம்புகள் மற்றும் முந்தைய படைப்புகளை நகலெடுப்பதில் உள்ள சவால்களை இது நிவர்த்தி செய்கிறது.",
      "இந்த கையேடு ஆய்வு வடிவமைப்பு, தரவு பகுப்பாய்வு மற்றும் வெளியீடு, திறந்த அறிவியல் நடைமுறைகளை ஊக்குவித்தல் மற்றும் ஆராய்ச்சி பொருட்களைப் பகிர்தல் குறித்த நடைமுறை வழிகாட்டலை வழங்குகிறது."
    ],
    "commentSummary": [
      "ஹேக்கர் நியூஸில் பயனர்கள் திறந்த, கடுமையான மற்றும் மீளுருவாக்கம் செய்யக்கூடிய ஆராய்ச்சி குறித்து புதிதாக வெளியிடப்பட்ட கையேட்டைப் பற்றி விவாதிக்கின்றனர்.",
      "இந்த உரையாடலில் மீளுருவாக்கம் செய்யக்கூடிய ஆராய்ச்சி சூழல்களை உருவாக்க டாக்கர் அல்லது ஆன்லைன் கணக்கீட்டு தளங்களைப் பயன்படுத்துவது குறித்த விவாதங்கள் அடங்கும்.",
      "சில பயனர்கள் தங்கள் தரவு அறிவியல் குழுவுக்கு பயிற்சியளிப்பதற்கான ஆதாரமாக கையேட்டைப் பயன்படுத்துவதில் ஆர்வத்தை வெளிப்படுத்துகிறார்கள், மற்றவர்கள் ஸ்டான்போர்டு பல்கலைக்கழகத்தின் தலைவரைச் சுற்றியுள்ள சமீபத்திய சர்ச்சை நிறுவனத்தின் வேலையை மதிப்பிழக்கச் செய்கிறதா என்று விவாதிக்கிறார்கள்."
    ],
    "points": 270,
    "commentCount": 24,
    "retryCount": 0,
    "time": 1699794259
  },
  {
    "id": 38240212,
    "title": "போதைக்கு அடிமையான பயனர்களிடமிருந்து மில்லியன் கணக்கானவர்களை வெளியேற்றும் கேசினோ பாணி பயன்பாடுகள், ஒழுங்குமுறை இல்லாதது குறித்து கவலைகளை எழுப்புகின்றன",
    "originLink": "https://www.nbcnews.com/tech/tech-news/addicted-losing-how-casino-apps-have-drained-people-millions-n1239604",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38240212",
    "commentBody": "",
    "originSummary": [
      "சூதாட்ட விதிமுறைகளைத் தவிர்ப்பதற்காக வீடியோ கேம்களாக மாறுவேடத்தில் இருக்கும் சூதாட்ட பாணி ஸ்மார்ட்போன் கேம்களின் போதைத் தன்மையை என்பிசி நியூஸ் வெளிச்சம் போட்டுக் காட்டியுள்ளது.",
      "ஜாக்பாட் மேஜிக் மற்றும் பிக் ஃபிஷ் கேசினோ போன்ற பிரபலமான விளையாட்டுகள் குறைந்தபட்ச மேற்பார்வையைக் கொண்டுள்ளன, இது வீரர்கள் உதவியற்றவர்களாக உணரவும் அடிமையாகவும் மாற வழிவகுக்கிறது, சிலர் ஆயிரக்கணக்கான டாலர்களை செலவிடுகிறார்கள்.",
      "சிலர் தங்கள் இழப்புகளை மீட்டெடுக்க வழக்குகளை தாக்கல் செய்துள்ளனர், ஆனால் தொழில்துறையில் கடுமையான விதிமுறைகளுக்கான தேவை அதிகரித்து வருகிறது."
    ],
    "commentSummary": [
      "இந்த விவாதம் சூதாட்டம் போன்ற பயன்பாடுகள் மற்றும் ஆன்லைன் சூதாட்டத்தின் போதை தன்மையில் கவனம் செலுத்துகிறது, இது போன்ற நடவடிக்கைகளை ஒழுங்குபடுத்துதல் மற்றும் தடை செய்வதன் அவசியம் குறித்த விவாதங்களைத் தூண்டுகிறது.",
      "பங்கேற்பாளர்கள் சூதாட்டம் மற்றும் ஆபாசம் போன்ற தீமைகளின் எதிர்மறையான தாக்கத்தையும், இந்த தொழில்களில் வேலை செய்வதன் நெறிமுறை தாக்கங்களையும் விவாதிக்கின்றனர்.",
      "இந்த உரையாடல் சூதாட்டத்தின் போதைத் தன்மை, அதன் உளவியல் வழிமுறைகள் மற்றும் போதை பழக்கத்தை செயல்படுத்துவதில் தொழில்நுட்ப நிறுவனங்களின் பங்கு ஆகியவற்றை ஆராய்கிறது. கூடுதலாக, வீடியோ கேம்கள் மற்றும் கொள்ளைப்பெட்டிகள் போன்ற மெய்நிகர் சூதாட்டங்களில் சூதாட்டம் போன்ற நடவடிக்கைகளின் ஒழுங்குமுறை மற்றும் நெறிமுறை தாக்கங்கள் ஆராயப்படுகின்றன. வெவ்வேறு பங்கேற்பாளர்கள் சூதாட்ட அடிமைத்தனத்தின் தீவிரம், தனிப்பட்ட பொறுப்பு மற்றும் சூதாட்டத்தின் சமூக பார்வை குறித்து மாறுபட்ட கருத்துக்களைக் கொண்டுள்ளனர்."
    ],
    "points": 267,
    "commentCount": 367,
    "retryCount": 0,
    "time": 1699798415
  },
  {
    "id": 38239503,
    "title": "அசாஹி லினக்ஸிற்கான ஸ்பீக்கர் ஆதரவை மேம்படுத்துதல்: மேக்புக் ஏர் 13\" மாதிரியில் வரம்புகள் மற்றும் பிழைகளை நிவர்த்தி செய்தல்",
    "originLink": "https://github.com/AsahiLinux/docs/wiki/SW:Speakers",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38239503",
    "commentBody": "",
    "originSummary": [
      "ஆசாஹி லினக்ஸ் திட்டம் எம் 1 மேக்புக் ஏர் 13\" இல் தொடங்கி அசாஹி ஃபெடோரா ரீமிக்ஸிற்கான ஸ்பீக்கர் ஆதரவை உருவாக்குவதில் பணியாற்றி வருகிறது.",
      "மின் நுகர்வு சிக்கல்கள் மற்றும் அதிக அளவுகளில் சிதைவு உள்ளிட்ட வரம்புகள் மற்றும் பிழைகளை தற்போதைய செயல்படுத்தல் கொண்டுள்ளது.",
      "இந்த திட்டம் \"போலி பாஸ்\" செயலாக்கம் மற்றும் சம-சத்த அளவு இழப்பீடு போன்ற அம்சங்களுடன் சீரான ஒலியை வழங்குவதை நோக்கமாகக் கொண்டுள்ளது, மேலும் பாதுகாப்பு ஆதரவுக்கான திறந்த மூல \"ஸ்மார்ட் ஆம்ப்\" செயல்படுத்தலையும் கொண்டுள்ளது."
    ],
    "commentSummary": [
      "அசாஹி லினக்ஸ் திட்டம் லினக்ஸில் மேம்பட்ட ஸ்பீக்கர் டி.எஸ்.பியைச் சேர்த்துள்ளது, சேதத்தை ஏற்படுத்தாமல் சிறிய ஸ்பீக்கர்களில் ஒலி தரம் மற்றும் அளவை மேம்படுத்துகிறது.",
      "லினக்ஸ் வரலாற்று ரீதியாக மற்ற இயக்க முறைமைகளுடன் ஒப்பிடும்போது குறைந்த ஆடியோ செயல்திறனைக் கொண்டுள்ளது, ஆனால் இந்த முன்னேற்றம் இடைவெளியைக் குறைக்க உதவுகிறது.",
      "அசாஹி லினக்ஸ் வன்பொருள் ஒருங்கிணைப்பு சவால்கள் மற்றும் லினக்ஸ் மடிக்கணினிகளில் ஆடியோ அனுபவத்தை மேம்படுத்த திறந்த மூல ஸ்பீக்கர் டிரைவர் பாதுகாப்பு அமைப்பை உருவாக்குகிறது."
    ],
    "points": 261,
    "commentCount": 142,
    "retryCount": 0,
    "time": 1699791601
  },
  {
    "id": 38241583,
    "title": "சான்டிஸ்க் எக்ஸ்ட்ரீம் ப்ரோ தோல்விகளுக்கு வடிவமைப்பு குறைபாடு காரணம் என்று ஆராய்ச்சி கூறுகிறது",
    "originLink": "https://www.tomshardware.com/news/sandisk-extreme-pro-failures-are-due-to-design-flaw",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38241583",
    "commentBody": "",
    "originSummary": [
      "தரவு மீட்பு நிறுவனமான அட்டிங்கோ, சான்டிஸ்க் எக்ஸ்ட்ரீம் ப்ரோ எஸ்.எஸ்.டி.களில் சமீபத்திய தோல்விகளுக்கு வடிவமைப்பு மற்றும் உற்பத்தி குறைபாடுகள் காரணம் என்று அடையாளம் கண்டுள்ளது, இது ஒரு வர்க்க நடவடிக்கை வழக்குக்கு வழிவகுக்கிறது.",
      "சர்க்யூட் போர்டுக்கு மிகவும் பெரிய கூறுகளிலிருந்து குறைபாடுகள் உருவாகின்றன, இதன் விளைவாக பலவீனமான இணைப்புகள் மற்றும் உடைந்து போக அதிக பாதிப்பு ஏற்படுகிறது.",
      "சான்டிஸ்க்கின் தாய் நிறுவனமான வெஸ்டர்ன் டிஜிட்டல், பாதிக்கப்பட்ட டிரைவ்களுக்கான ஃபார்ம்வேர் புதுப்பிப்பை வெளியிடவில்லை மற்றும் பல தயாரிப்பு வரிசைகளை பாதிக்கும் சிக்கல்களைப் பற்றி திறம்பட தொடர்பு கொள்ளவில்லை."
    ],
    "commentSummary": [
      "பயனர்கள் சான்டிஸ்க் SSD களின் தோல்விகள் மற்றும் வடிவமைப்பு குறைபாடுகளைப் பற்றி விவாதிக்கிறார்கள், தரவு இழப்பு குறித்த அதிருப்தியையும் கவலைகளையும் வெளிப்படுத்துகிறார்கள்.",
      "தோல்விகளுக்கான சாத்தியமான காரணங்கள் குறிப்பிடப்பட்டுள்ளன, இதில் சோல்டரிங் சிக்கல்கள், கூறு அளவு மற்றும் ஃபார்ம்வேர் பிழைகள் ஆகியவை அடங்கும்.",
      "சாம்சங் எஸ்எஸ்டிகள் மற்றும் சீகேட் எச்டிடிகள் போன்ற மாற்றுகள் மிகவும் நம்பகமான விருப்பங்களாக பரிந்துரைக்கப்படுகின்றன, மேலும் வழக்கமான காப்புப்பிரதிகள் மற்றும் பல சாதனங்கள் மற்றும் இடங்களில் தரவைப் பரப்புவதன் முக்கியத்துவம் வலியுறுத்தப்படுகிறது."
    ],
    "points": 255,
    "commentCount": 149,
    "retryCount": 0,
    "time": 1699806445
  },
  {
    "id": 38246668,
    "title": "ரஸ்ட் +வாஸ்ம்: செயற்கை நுண்ணறிவு அனுமானத்திற்கான பைத்தானுக்கு ஒரு இலகுரக மாற்று",
    "originLink": "https://www.secondstate.io/articles/fast-llm-inference/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38246668",
    "commentBody": "",
    "originSummary": [
      "ரஸ்ட் +வாஸ்ம் அடுக்கு செயற்கை நுண்ணறிவு அனுமானத்திற்கான பைத்தானுக்கு ஒரு வலுவான மாற்றாக உருவாகி வருகிறது.",
      "ரஸ்ட் ஏஜிஐயின் மொழியாகக் கருதப்படுகிறது, மேலும் ஸ்டாக் பாதுகாப்பான செயலாக்கத்திற்காக வாஸ்ம் எட்ஜ் இயக்க நேரத்தைப் பயன்படுத்துகிறது.",
      "சிறிய அளவு, வேகமான வேகம், வெவ்வேறு சாதனங்களுடன் பொருந்தக்கூடிய தன்மை, இலகுரக செயலாக்கம், பெயர்வுத்திறன், பணியமர்த்தல் எளிது மற்றும் பல்வேறு வன்பொருளுடன் பொருந்தக்கூடிய தன்மை போன்ற நன்மைகளை ரஸ்ட் + வாஸ்ம் வழங்குகிறது.",
      "இந்த கட்டுரை ரஸ்ட் + வாஸ்ம் பயன்பாடுகளை நிறுவுவதற்கும் இயக்குவதற்கும் வழிமுறைகளை வழங்குகிறது மற்றும் வாஸ்ம் எட்ஜ் ஜி.ஜி.எம்.எல் செருகுநிரல் மூலம் வன்பொருள் முடுக்கத்தை மேம்படுத்துவதற்கான திறனைக் குறிப்பிடுகிறது.",
      "எல்.எல்.எம்.களுக்கு அப்பால் அனுமான பயன்பாடுகளுக்கான அடுக்கின் சாத்தியமும் விவாதிக்கப்படுகிறது, இது வாஸ்ம் எட்ஜ் மற்றும் வாஸி என்.என் ஆகியவற்றைப் பயன்படுத்தி விவாதிக்கப்படுகிறது."
    ],
    "commentSummary": [
      "இந்த திட்டம் லாமா.cpp வாசம் பதிப்பைப் பயன்படுத்தி மேக்ஸில் எல்.எல்.எம்களின் செயல்திறனை மேம்படுத்துவதை நோக்கமாகக் கொண்டுள்ளது.",
      "இயந்திர கற்றல் மாதிரிகளை இயக்குவதில் வாஸ்மைப் பயன்படுத்துவதன் நன்மைகள் மற்றும் வரம்புகள் குறித்து ஒரு விவாதம் உள்ளது.",
      "பைனரி அளவைக் குறைப்பது மற்றும் வெவ்வேறு இயக்க முறைமைகள் மற்றும் வன்பொருள் சார்புகளுடன் பொருந்தக்கூடிய தன்மையை உறுதி செய்வதில் திட்டத்தின் கவனம் உள்ளது."
    ],
    "points": 247,
    "commentCount": 71,
    "retryCount": 0,
    "time": 1699847324
  },
  {
    "id": 38239358,
    "title": "பழைய மற்றும் எதிர்கால திட்டங்களை சேமிப்பதற்கான நிபுணர் உதவிக்குறிப்புகள்",
    "originLink": "https://arne.me/articles/archive-your-old-projects",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38239358",
    "commentBody": "",
    "originSummary": [
      "திட்டங்களை ஆன்லைனில் விட்டுவிடுவது, ஆஃப்லைன் காப்பகத்திற்கு பிரத்யேக கோப்புறைகள் மற்றும் துணை கோப்புறைகளை உருவாக்குவது மற்றும் ஸ்கிரீன் ஷாட்களை எடுப்பது மற்றும் எளிதான குறிப்புக்காக ரீட்எம்இ கோப்பைச் சேர்ப்பது உள்ளிட்ட எதிர்கால திட்டங்களைச் சேமிப்பதற்கான ஒரு மூலோபாயத்தை ஆசிரியர் பரிந்துரைக்கிறார்.",
      "தரவுத்தளங்களை காப்புப் பிரதி எடுக்கவும், உருவாக்கப்பட்ட சொத்துக்களை சேமிக்கவும், அத்துடன் இணைய காப்பகம் அல்லது பிற தளங்களில் பாதுகாப்பாக வைப்பதற்கான திட்டங்களை சேமிக்கவும் அவர்கள் பரிந்துரைக்கின்றனர்.",
      "வாசகர்கள் தங்கள் சொந்த திட்ட காப்பக உத்திகளைப் பகிர்ந்து கொள்ள ஆசிரியர் அழைக்கிறார்."
    ],
    "commentSummary": [
      "இந்த கட்டுரை பழைய திட்டங்களை சேமித்தல் மற்றும் ஆவணப்படுத்துவதன் முக்கியத்துவத்தை வலியுறுத்துகிறது மற்றும் தரவை ஒழுங்கமைத்தல், சேமித்தல் மற்றும் காப்புப் பிரதி எடுப்பதற்கான பல்வேறு முறைகள் குறித்த நுண்ணறிவுகளை வழங்குகிறது.",
      "இது திட்டங்களைப் பகிர்வதற்கும் கருத்துக்களைப் பெறுவதற்கும் மதிப்பை எடுத்துக்காட்டுகிறது, அதே நேரத்தில் பணிநீக்கத்தின் முக்கியத்துவத்தையும் தரவின் பல சுயாதீன நகல்களைப் பராமரிப்பதன் முக்கியத்துவத்தையும் வலியுறுத்துகிறது.",
      "இந்த கட்டுரை மேகக்கணி சேமிப்பு மற்றும் என்ஏஎஸ் சாதனங்கள் உள்ளிட்ட பல்வேறு உத்திகள் மற்றும் தொழில்நுட்பங்களை ஆராய்கிறது, மேலும் குறியாக்கம் மற்றும் நீண்டகால பாதுகாப்பிற்கான பரிசீலனைகளைப் பற்றி விவாதிக்கிறது."
    ],
    "points": 238,
    "commentCount": 60,
    "retryCount": 0,
    "time": 1699789222
  },
  {
    "id": 38241235,
    "title": "உலாவி சோதனைக்கு பிளேசிங் ஃபாஸ்ட் எல்.சி.எம் லோரா எஸ்.டி 1.5 மூலம் படங்களை விரைவாக உருவாக்கவும்",
    "originLink": "https://twitter.com/abidlabs/status/1723074108739706959",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38241235",
    "commentBody": "",
    "originSummary": [
      "அபுபக்கர் அபித் பிளஸிங் ஃபாஸ்ட் எல்சிஎம் லோரா எஸ்டி 1.5 என்ற புதிய தயாரிப்பை அறிமுகப்படுத்தியுள்ளார்.",
      "தயாரிப்பு விரைவாக படங்களை உருவாக்க வடிவமைக்கப்பட்டுள்ளது.",
      "இதை ஒரு உலாவியில் எளிதாக சோதிக்க முடியும்."
    ],
    "commentSummary": [
      "வழங்கப்பட்ட சுருக்கம் துண்டு துண்டான மற்றும் முழுமையற்ற தகவல் காரணமாக போதுமானதாக இல்லை என்று கருதப்படுகிறது.",
      "குறிப்பிடத்தக்க விவரங்கள் காணப்படவில்லை, இது சுருக்கமான சுருக்கத்தை உருவாக்குவது சவாலானது.",
      "துல்லியமான சுருக்கத்தை உருவாக்க கூடுதல் விளக்கம் அல்லது கூடுதல் விவரங்கள் தேவை."
    ],
    "points": 167,
    "commentCount": 26,
    "retryCount": 0,
    "time": 1699804486
  },
  {
    "id": 38239640,
    "title": "ஐபோன் பழுதுபார்ப்பு மீதான ஆப்பிளின் கட்டுப்பாடு பழுதுபார்க்கும் உரிமை விவாதத்தைத் தூண்டுகிறது",
    "originLink": "https://www.nytimes.com/2023/11/12/technology/iphone-repair-apple-control.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38239640",
    "commentBody": "",
    "originSummary": [
      "அங்கீகரிக்கப்படாத பழுதுபார்ப்புகளைக் கண்டறிய வடிவமைக்கப்பட்ட ஆப்பிளின் மென்பொருள் ஐபோன் பழுதுபார்ப்பதில் சிரமத்தை அதிகரித்துள்ளது, இது வாடிக்கையாளர்கள் ஆப்பிள் அல்லது அங்கீகரிக்கப்பட்ட பழுதுபார்க்கும் மையங்களை நம்புவதற்கு வழிவகுக்கிறது, இதன் விளைவாக அதிக விலைகள் ஏற்படுகின்றன.",
      "நிலைத்தன்மையை ஊக்குவிப்பதற்கும் சாதனங்களின் ஆயுட்காலத்தை நீட்டிப்பதற்கும் குறைந்த பழுதுபார்ப்பு செலவுகளுக்கு வழக்கறிஞர்கள் அழுத்தம் கொடுக்கின்றனர், ஆனால் ஆப்பிள் தங்கள் நடைமுறைகளுக்கான பாதுகாப்பாக பாதுகாப்பு கவலைகளைக் கோருகிறது.",
      "பழுதுபார்ப்பதை எளிதாக்க மாநில சட்டமன்ற உறுப்பினர்களும் பைடன் நிர்வாகமும் நடவடிக்கை எடுத்துள்ளன, இருப்பினும், விதிமுறைகள் பாகங்களை இணைப்பதை வெளிப்படையாகக் குறிப்பிடவில்லை, இது பழுதுபார்க்கும் உரிமை குறித்து நடந்து வரும் விவாதத்திற்கு எரியூட்டுகிறது. தயாரிப்பு வெளியீடுகள், தொழில்நுட்பத் தொழில் போக்குகள் மற்றும் தொழில்நுட்ப பயன்பாட்டின் சமூக தாக்கங்கள் உள்ளிட்ட ஆப்பிள் தொடர்பான பல்வேறு தலைப்புகளையும் இந்த கட்டுரை உள்ளடக்கியது."
    ],
    "commentSummary": [
      "பயன்பாட்டு அணுகல், பழுதுபார்க்கும் கொள்கைகள் மற்றும் பாதுகாப்பு நடவடிக்கைகள் உள்ளிட்ட ஐபோன்கள் மீதான ஆப்பிளின் இறுக்கமான கட்டுப்பாட்டை இந்த கட்டுரை ஆராய்கிறது.",
      "ஆப்பிளின் கட்டுப்பாட்டின் நன்மை தீமைகள் குறித்த விவாதங்கள் விவாதிக்கப்படுகின்றன, சாதன பாதுகாப்பை பராமரிக்கும் போது அதிக பயனர் தன்னாட்சிக்கான அழைப்புகள்.",
      "வெளிப்படைத்தன்மை, ஒழுங்குமுறைகள் மற்றும் பிற பிராண்டுகளுடனான ஒப்பீடுகள் ஆகியவை தங்கள் தயாரிப்புகள் மீதான ஆப்பிளின் கட்டுப்பாடு தொடர்பாக ஆராயப்படுகின்றன."
    ],
    "points": 165,
    "commentCount": 208,
    "retryCount": 0,
    "time": 1699793122
  },
  {
    "id": 38240333,
    "title": "இலவச ஓபரோன்: ஓபரோன் நிரலாக்க மொழிக்கான இலவச, குறுக்கு-மேடை ஐடிஇ",
    "originLink": "https://free.oberon.org/en/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38240333",
    "commentBody": "",
    "originSummary": [
      "இலவச ஓபரோன் என்பது ஓபரான் நிரலாக்க மொழிக்கான இலவச குறுக்கு-தள ஒருங்கிணைந்த மேம்பாட்டு சூழல் (ஐடிஇ) ஆகும், இது யூனிகோட் மற்றும் கிராபிக்ஸ் நிரலாக்கத்தை ஆதரிக்கிறது.",
      "இது தகவலியலை ஒரு அறிவியலாக முன்னேற்றுவதில் கவனம் செலுத்தும் ஒரு பெரிய திட்டத்தின் ஒரு பகுதியாகும்.",
      "பயனர்கள் ஜிப் காப்பகத்தை அணுகுவதன் மூலமும், செயல்படுத்தக்கூடிய கோப்பை இயக்குவதன் மூலமும் இலவச ஓபரானைப் பதிவிறக்கி நிறுவலாம். ஐடிஇ பல்வேறு தொகுதிகளை வழங்குகிறது மற்றும் பயனர்கள் மின்னஞ்சல் வழியாக டெவலப்பருக்கு கருத்துக்களை வழங்க அனுமதிக்கிறது."
    ],
    "commentSummary": [
      "இலவச ஓபெரான் என்பது ஒரு குறுக்கு-தள ஐடிஇ ஆகும், இது பயனர் நட்பு, ஆனால் கேடிஇ மற்றும் க்னோம் உடன் பொருந்தக்கூடிய சிக்கல்களைக் கொண்டிருக்கலாம்.",
      "ஓஎஸ் ஏபிஐகளுக்கான மட்டுப்படுத்தப்பட்ட அணுகல் மற்றும் நெட்வொர்க்கிங் திறன்கள் இல்லாததால் இது முதன்மையாக ஒரு கல்வி கருவியாக பொருத்தமானது.",
      "ஓபரோன் கல்விக்கு வெளியே மட்டுப்படுத்தப்பட்ட பிரபலத்தைக் கொண்டுள்ளது, அறிவியல் கணினி மற்றும் ஐஓடி வளர்ச்சியில் சில பயன்பாடுகள் உள்ளன."
    ],
    "points": 164,
    "commentCount": 37,
    "retryCount": 0,
    "time": 1699799302
  }
]
