[
  {
    "id": 42122085,
    "title": "GPS не требуется: наше приложение теперь может определять местоположение подземных поездов",
    "originLink": "https://blog.transitapp.com/go-underground/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42122085",
    "commentBody": "",
    "originSummary": [
      "Приложение обеспечивает отслеживание местоположения подземных поездов без использования GPS, который часто недоступен в таких условиях.",
      "Он использует оффлайн-обнаружение движения для определения местоположения пользователя между станциями, обеспечивая работоспособность даже при плохом сигнале.",
      "Приложение предупреждает пользователей, когда их остановка приближается, повышая удобство и снижая риск пропустить остановку."
    ],
    "commentSummary": [
      "Приложение может определять местоположение подземных поездов без использования GPS, используя датчик давления телефона для обнаружения изменений давления, когда поезд входит или выходит из станции.",
      "Вдохновленный французской компанией Snips, этот метод усовершенствован за счет включения расписаний поездов и данных акселерометра для повышения точности в прогнозировании движения поездов.",
      "Это нововведение значительно улучшает пользовательский опыт, предоставляя точную информацию о местоположении в подземных транспортных системах, даже несмотря на то, что не все телефоны оснащены датчиками давления."
    ],
    "points": 814,
    "commentCount": 269,
    "retryCount": 0,
    "time": 1731462380
  },
  {
    "id": 42120311,
    "title": "Эффективность Mac mini на базе M4",
    "originLink": "https://www.jeffgeerling.com/blog/2024/m4-mac-minis-efficiency-incredible",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42120311",
    "commentBody": "",
    "originSummary": [
      "Мини-компьютер M4 продемонстрировал прирост эффективности на 32% по сравнению с предыдущими моделями, достигнув 6,74 Gflops/W на тесте HPL, превзойдя M1 Max Mac Studio.",
      "Он работает в режиме ожидания при мощности 3-4 Вт, что сопоставимо с Raspberry Pi, и оснащен 10 GbE и 32 ГБ оперативной памяти, что делает его очень эффективным для своих размеров.",
      "В пространстве стойки 1.25U три мини-компьютера M4 могут работать в режиме ожидания при потреблении 10 Вт, обеспечивая почти терафлоп производительности процессора, что подчеркивает их потенциал для высокопроизводительных вычислений."
    ],
    "commentSummary": [
      "Mac mini M4 высоко ценится за свою эффективность и производительность, особенно в задачах видеомонтажа, что делает его популярным выбором для различных приложений, таких как домашние серверы и рендеринг видео.",
      "Расположение кнопки питания на нижней части устройства стало предметом споров, особенно для пользователей, которые устанавливают Mac mini в стойку, находя это неудобным.",
      "Пользователи выражают желание улучшить поддержку Linux и больше вариантов обновления, особенно в отношении хранения и оперативной памяти, несмотря на низкое энергопотребление устройства и его впечатляющие возможности."
    ],
    "points": 543,
    "commentCount": 568,
    "retryCount": 0,
    "time": 1731449297
  },
  {
    "id": 42119042,
    "title": "Jelly – более простая общая почта для небольших команд",
    "originLink": "https://letsjelly.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42119042",
    "commentBody": "",
    "originSummary": [
      "Компания Good Enough запустила Jelly, упрощенное решение для совместного использования почтового ящика, предназначенное для небольших команд, чтобы эффективно управлять электронной почтой. Jelly решает проблемы с существующими инструментами, такими как Fastmail и Google Groups, которые были либо хаотичными, либо неэффективными для управления командной почтой. Jelly предлагает экономичную альтернативу сложным и дорогим инструментам с моделью фиксированной цены, что делает его значительно дешевле, чем конкуренты, такие как Zendesk."
    ],
    "commentSummary": [
      "Jelly — это инструмент для совместного использования почтового ящика, разработанный компанией Good Enough, направленный на упрощение управления электронной почтой для небольших команд без сложности и высоких затрат других решений. Он предлагает фиксированную ставку в $29 в месяц для всей команды, что делает его более доступным по сравнению с конкурентами, такими как Zendesk, которые часто взимают плату за каждого пользователя. Построенный на стеке Rails и использующий Postmark для обработки электронной почты, Jelly разработан так, чтобы быть удобным для пользователей как с техническими, так и без технических навыков, решая такие проблемы, как неясные обязанности по электронной почте и потерянные ответы в личных почтовых ящиках."
    ],
    "points": 307,
    "commentCount": 125,
    "retryCount": 0,
    "time": 1731441345
  },
  {
    "id": 42120090,
    "title": "Необычные особенности Raku",
    "originLink": "https://buttondown.com/hillelwayne/archive/five-unusual-raku-features/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42120090",
    "commentBody": "",
    "originSummary": [
      "«Логика для программистов» достигла бета-версии 0.5, что указывает на завершение альфа-фазы, осталось только редактирование и форматирование.",
      "Книга исследует Raku, язык программирования, известный своими уникальными особенностями, такими как соединения, что угодно, гипероператоры и несколько моделей параллелизма.",
      "Автор подчеркивает достижения Raku в области регулярных выражений, синтаксиса пар и потенциала Slangs и RakuAST для будущих инноваций в языке, а также рекомендует блоги о Raku и предлагает ранний доступ к новой книге."
    ],
    "commentSummary": [
      "Raku — это язык программирования, известный своими уникальными особенностями, особенно мощными регулярными выражениями и грамматиками, которые превосходят традиционные парсеры по возможностям.",
      "Он поддерживает композиционные регулярные выражения, что позволяет создавать более модульный и понятный код, а также может выполнять сложные операции, такие как сопоставление равного количества символов без обратного отслеживания.",
      "Хотя Raku предлагает гибкость и продвинутые функции, его скорость и сложность могут быть сложными для некоторых разработчиков, однако он остается привлекательным для тех, кто интересуется инновационным дизайном языков."
    ],
    "points": 246,
    "commentCount": 137,
    "retryCount": 0,
    "time": 1731448085
  },
  {
    "id": 42118970,
    "title": "Мать заключена в тюрьму за то, что позволила 10-летнему ребенку идти одному в город",
    "originLink": "https://reason.com/2024/11/11/mom-jailed-for-letting-10-year-old-walk-alone-to-town/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42118970",
    "commentBody": "",
    "originSummary": [
      "Бриттани Паттерсон была арестована в Джорджии за то, что позволила своему 10-летнему сыну гулять одному, что подчеркивает столкновение между подходом \"свободного воспитания\" и юридическими взглядами на безопасность детей.",
      "Паттерсон была освобождена под залог, но столкнулась с давлением со стороны Департамента по делам семьи и детей, чтобы подписать «план безопасности», от чего она отказалась, обратившись за юридической помощью в ParentsUSA.",
      "Помощник окружного прокурора предложил снять обвинения, если Паттерсон подпишет план, но она остается непреклонной в своем отказе, что может привести к дальнейшим юридическим последствиям."
    ],
    "commentSummary": [
      "Мать была заключена в тюрьму за то, что позволила своему 10-летнему ребенку идти одному в город, что вызвало дебаты о самостоятельности детей в США.",
      "Инцидент подчеркивает различия в общественных нормах и практике правоохранительных органов, при этом некоторые регионы воспринимаются как чрезмерно защищающие.",
      "Этот случай подчеркивает более широкие проблемы, связанные с воспитанием, ориентированным на контроль, политикой, основанной на страхе, и балансом между безопасностью детей и их независимостью."
    ],
    "points": 208,
    "commentCount": 192,
    "retryCount": 0,
    "time": 1731440894
  },
  {
    "id": 42120385,
    "title": "3600 МГц Raspberry Pi 5 с жидким азотом",
    "originLink": "https://skatterbencher.com/2024/11/11/3600-mhz-raspberry-pi-5-with-liquid-nitrogen/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42120385",
    "commentBody": "",
    "originSummary": [
      "Попытка сделать Raspberry Pi 5 самым быстрым в мире включала методы, такие как изменение операционной системы, использование охлаждения жидким азотом и модификация схемы питания.",
      "Несмотря на усилия, включая использование карты питания ElmorLabs AMPLE-X1 и замену кварцевого генератора, Raspberry Pi 5 не удалось превысить частоту 3,6 ГГц.",
      "Проект предоставил ценные сведения о разгоне Raspberry Pi и модификациях оборудования, подчеркивая трудности и ограничения при увеличении производительности устройства."
    ],
    "commentSummary": [
      "Raspberry Pi 5 был разогнан до 3600 МГц с использованием жидкого азота, что вызвало интерес к экстремальным методам охлаждения для повышения производительности.",
      "Статья подверглась критике за то, что ее восприняли как рекламный контент для Elmor Labs, что подчеркивает важность прозрачности в технической журналистике.",
      "Обсуждения включали практичность разгона старых процессоров и сравнительную производительность Raspberry Pi OS по сравнению с другими операционными системами."
    ],
    "points": 188,
    "commentCount": 65,
    "retryCount": 0,
    "time": 1731449923
  },
  {
    "id": 42125863,
    "title": "Bluetooth USB периферийное реле – подключение Bluetooth устройств к USB",
    "originLink": "https://github.com/bahaaador/bluetooth-usb-peripheral-relay",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42125863",
    "commentBody": "",
    "originSummary": [
      "Был разработан Bluetooth USB периферийный реле с использованием Raspberry Pi Zero W для подключения Bluetooth-устройств, таких как клавиатуры и мыши, к хостам, поддерживающим только USB.",
      "Этот инструмент особенно полезен в ситуациях, когда Bluetooth отключен на ПК из-за ограничений политики, выступая в качестве моста для передачи ввода Bluetooth через USB.",
      "Проект написан на языке программирования Go и оптимизирован для Raspberry Pi Zero W, приглашая отзывы и вклад от сообщества."
    ],
    "commentSummary": [
      "Bluetooth USB Peripheral Relay позволяет Bluetooth-устройствам подключаться к хостам, поддерживающим только USB, с использованием Raspberry Pi Zero W, решая проблемы с ограничениями на использование Bluetooth. Разработанный bahaaador и написанный на Go, проект оптимизирован для Raspberry Pi Zero W и вызвал интерес благодаря своей способности переключать Bluetooth-устройства между компьютерами без повторного сопряжения. Проект является открытым, приглашая к обратной связи и вкладу на GitHub, и вызвал обсуждения альтернативных решений, таких как USB-хабы или устройства с несколькими профилями сопряжения."
    ],
    "points": 166,
    "commentCount": 92,
    "retryCount": 0,
    "time": 1731504281
  },
  {
    "id": 42119219,
    "title": "Русская семья жила в одиночестве в сибирской глуши 40 лет (2013)",
    "originLink": "https://www.smithsonianmag.com/history/this-russian-family-lived-alone-in-the-siberian-wilderness-for-40-years-unaware-of-world-war-ii-or-the-moon-landing-7354256/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42119219",
    "commentBody": "",
    "originSummary": [
      "В 1978 году экипаж вертолета обнаружил семью Лыковых, старообрядцев, которые более 40 лет жили в изоляции в сибирской тайге, чтобы избежать советских преследований. Лыковы выжили в суровых условиях с ограниченными ресурсами, демонстрируя замечательную стойкость и ум, хотя трое из четырех детей умерли после восстановления контакта с внешним миром. Агафья Лыкова, младшая, продолжает жить в тайге, получая периодическую помощь по мере ухудшения здоровья, но остается приверженной своему изолированному образу жизни."
    ],
    "commentSummary": [
      "Русская семья, принадлежащая к религиозной секте старообрядцев, жила в изоляции в сибирской глуши в течение 40 лет, чтобы избежать преследований. Их история выживания, отмеченная такими трудностями, как болезни и недоедание, подчеркивает темы веры, выживания и последствий изоляции. Открытие семьи геологами в 1970-х годах привлекло внимание к их образу жизни и вызвало обсуждения исторических, культурных и геополитических вопросов."
    ],
    "points": 157,
    "commentCount": 152,
    "retryCount": 0,
    "time": 1731442388
  },
  {
    "id": 42123909,
    "title": "Qwen2.5-Coder-32B — это LLM, который хорошо кодирует и работает на моем Mac.",
    "originLink": "https://simonwillison.net/2024/Nov/12/qwen25-coder/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42123909",
    "commentBody": "",
    "originSummary": [
      "Саймон Уиллиссон рассматривает Qwen2.5-Coder-32B, открытую модель большого языка (LLM), разработанную командой Qwen от Alibaba, которая может работать на MacBook Pro M2 с 64 ГБ оперативной памяти. Модель заявляет о соперничестве с GPT-4o в возможностях кодирования и демонстрирует высокую производительность в тестах, что делает её конкурентоспособной с другими размещёнными моделями. Уиллиссон столкнулся с некоторыми начальными трудностями при настройке, но нашёл модель эффективной для помощи в кодировании, используя версии Ollama и MLX."
    ],
    "commentSummary": [
      "Qwen2.5-Coder-32B — это открытая большая языковая модель (LLM), разработанная для задач программирования, примечательная своей способностью работать локально на устройствах, таких как Mac.",
      "Модель хвалят за доступность и экономичность, так как она дешевле альтернатив, но есть опасения по поводу её производительности в реальных задачах по сравнению с эталонными тестами.",
      "Пользователи имеют смешанные впечатления: некоторые считают его эффективным для выполнения конкретных задач, в то время как другие отмечают его ограничения в сложных сценариях, и обсуждение включает в себя проблемы запуска LLMs локально по сравнению с облачными сервисами."
    ],
    "points": 149,
    "commentCount": 54,
    "retryCount": 0,
    "time": 1731485807
  },
  {
    "id": 42122434,
    "title": "Micron запускает 60ТБ PCIe gen5 SSD с скоростью чтения 12ГБ/с",
    "originLink": "https://www.micron.com/products/storage/ssd/data-center-ssd/6550-ion",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42122434",
    "commentBody": "",
    "originSummary": [
      "Компания Micron представила Micron 6550 ION SSD, первый в мире твердотельный накопитель для центров обработки данных объемом 60 ТБ с интерфейсом PCIe Gen5, разработанный для повышения производительности и энергоэффективности при выполнении задач искусственного интеллекта.",
      "Компания предлагает разнообразные решения для памяти, включая DRAM, NAND и SSD, обслуживая такие рынки, как искусственный интеллект, автомобильная промышленность и центры обработки данных.",
      "Micron акцентирует внимание на устойчивом развитии, безопасности и инновациях, предоставляя инструменты для проектирования и техническую поддержку партнерам и клиентам."
    ],
    "commentSummary": [
      "Компания Micron представила SSD-накопитель PCIe Gen5 объемом 60 ТБ, который отличается впечатляющей скоростью чтения 12 ГБ/с и предназначен для серверных приложений, требующих высокой емкости. Несмотря на свои передовые характеристики, SSD является дорогостоящим, так как модели Gen5 значительно дороже традиционных жестких дисков, что создает трудности для более широкого потребительского принятия. Среднее время наработки на отказ (MTTF) в 2,5 миллиона часов подчеркивает его надежность, делая его подходящим для крупномасштабных операций, хотя точная цена остается неуказанной."
    ],
    "points": 134,
    "commentCount": 62,
    "retryCount": 0,
    "time": 1731466393
  },
  {
    "id": 42118638,
    "title": "Sentry только что выделила $750 тыс. на проекты с открытым исходным кодом",
    "originLink": "https://blog.sentry.io/we-just-gave-750-000-dollars-to-open-source-maintainers/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42118638",
    "commentBody": "",
    "originSummary": [
      "Sentry увеличила финансирование для поддерживающих Open Source до 750 000 долларов на 2024 год, что на 50% больше по сравнению с предыдущим годом, отражая свою приверженность сообществу Open Source.",
      "Компания представила Обещание с открытым исходным кодом, направленное на решение вопросов устойчивого развития, гарантируя, что поддерживающие разработчики получают не менее $2,000 в год на каждого разработчика, с существенными вкладами в проекты, такие как Django и OSI.",
      "Сентри выступает за эффективное распределение средств с помощью алгоритмов и руководства от фондов свободного и открытого программного обеспечения (FOSS) и приглашает другие компании присоединиться к обязательству по усилению поддержки сопровождающих."
    ],
    "commentSummary": [
      "Sentry пожертвовала $750,000 на проекты с открытым исходным кодом, что вызвало обсуждения о том, является ли это искренней поддержкой или маркетинговой стратегией, учитывая их акцент на платных планах. Sentry разработана с использованием Python и Django, что подчеркивает ее тесную связь с сообществом Python и способствует продолжающимся дебатам о преимуществах Django по сравнению с FastAPI. Несмотря на некоторые критические замечания, финансовые вклады Sentry в проекты с открытым исходным кодом значительны и заслуживают внимания."
    ],
    "points": 133,
    "commentCount": 20,
    "retryCount": 0,
    "time": 1731439013
  },
  {
    "id": 42121630,
    "title": "Как справиться с серьезным психическим кризисом?",
    "originLink": "https://news.ycombinator.com/item?id=42121630",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42121630",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [],
    "points": 131,
    "commentCount": 74,
    "retryCount": 0,
    "time": 1731458068
  }
]
