[
  {
    "id": 42141587,
    "title": "إعادة إنشاء بيئة تطوير Visual Basic 6 باستخدام لغة C#",
    "originLink": "https://github.com/BAndysc/AvaloniaVisualBasic6",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42141587",
    "commentBody": "",
    "originSummary": [
      "أفالونيا فيجوال بيسك 6 هو إعادة إنشاء بلغة C# لبيئة التطوير المتكاملة الكلاسيكية فيجوال بيسك 6 باستخدام أفالونيا، ويهدف إلى أن يكون مشروعًا ممتعًا وغير تجاري. يتضمن المشروع ميزات مثل مصمم بصري، والتوافق مع حفظ/تحميل مشاريع VB6، ودعم محدود للغة VB6. يتطلب بناء النسخة المكتبية عادةً .NET 9.0، ولكن يمكن استخدام .NET 8.0 مع بعض التعديلات؛ يتم التجميع باستخدام `dotnet build`، والنشر باستخدام `dotnet publish` لكل من بيئة التطوير والوقت التشغيلي."
    ],
    "commentSummary": [
      "تم إعادة إنشاء بيئة تطوير متكاملة (IDE) لبرنامج Visual Basic 6 باستخدام لغة C# وهي متاحة على GitHub، مما أثار الحنين لدى المطورين الذين بدأوا مع VB6.",
      "يستخدم المشروع Avalonia، وهو إطار عمل لواجهة المستخدم عبر الأنظمة الأساسية، ويدعم ميزات VB6 الأساسية، على الرغم من أنه لا يزال قيد التطوير.",
      "لقد تلقت المبادرة ردود فعل إيجابية، مما أثار الاهتمام بمزيد من التطوير والمناقشات حول تطور مجموعات أدوات واجهة المستخدم الرسومية (GUI) وبساطة VB6 مقارنة بالأدوات المعاصرة."
    ],
    "points": 357,
    "commentCount": 136,
    "retryCount": 0,
    "time": 1731620874
  },
  {
    "id": 42141843,
    "title": "تحليل الخسائر الاقتصادية والإنتاجية الناجمة عن لافتات ملفات تعريف الارتباط في أوروبا",
    "originLink": "https://legiscope.com/blog/hidden-productivity-drain-cookie-banners.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42141843",
    "commentBody": "",
    "originSummary": [
      "يقضي الأوروبيون مجتمعين 575 مليون ساعة سنويًا في التفاعل مع لافتات موافقة ملفات تعريف الارتباط، وهو مطلب من توجيه الاتحاد الأوروبي 2002/58، الذي يهدف إلى حماية خصوصية المستخدم. التأثير الاقتصادي لهذا الوقت المستغرق كبير، حيث يكلف 14.375 مليار يورو سنويًا، وهو ما يعادل 0.10% من الناتج المحلي الإجمالي للاتحاد الأوروبي، ويمثل خسارة في الإنتاجية تعادل 287,500 وظيفة بدوام كامل. هناك دعوة عاجلة لمراجعة التوجيه لتخفيف الأعباء الاقتصادية والإنتاجية، خاصة التي تؤثر على الشركات الصغيرة والمتوسطة."
    ],
    "commentSummary": [
      "يتطلب قانون \"الكوكيز\" الأوروبي الحصول على موافقة مستنيرة للتتبع، لكنه لا يفرض بشكل محدد استخدام لافتات الكوكيز؛ تختار الشركات استخدام اللافتات للامتثال.",
      "مشكلة شائعة هي أن الشركات تقوم بتطبيق الموافقة بشكل غير صحيح عن طريق تعيين ملفات تعريف الارتباط للتتبع بشكل افتراضي وتقديم لافتات بدون خيار رفض واضح، وهو ما يعد غير متوافق.",
      "يهدف القانون إلى حماية حقوق المستهلك، لكن الشركات غالبًا ما تنخرط في \"الامتثال الخبيث\" لإحباط المستخدمين، مما يشير إلى ضرورة تطبيق أكثر صرامة وإمكانية استخدام إعدادات الموافقة المستندة إلى المتصفح كحلول."
    ],
    "points": 319,
    "commentCount": 352,
    "retryCount": 0,
    "time": 1731622989
  },
  {
    "id": 42143269,
    "title": "النسبية: سماعة رأس للواقع الافتراضي مفتوحة المصدر بسعر 200 دولار",
    "originLink": "https://www.relativty.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42143269",
    "commentBody": "",
    "originSummary": [
      "ريلاتيفتي هو جهاز واقع افتراضي مفتوح المصدر تم تطويره من قبل المراهقين ماكسيم بيرومال وغابرييل كومب، وصُمم كمشروع افعلها بنفسك بدلاً من كونه منتجًا استهلاكيًا، بتكلفة تقارب 200 دولار. يدعم الجهاز ألعاب SteamVR ويتميز بتجربة مقياس الموضع باستخدام أي كاميرا، مع لوحة أم تعتمد على معالج Atmel SAM3X8E ARM Cortex-M3. يقوم المبدعون بإطلاق شركة جديدة، أوناي، لتطوير جهاز واقع افتراضي مستقل، وهم حاليًا في طور التوظيف، مع توفر المزيد من المعلومات على موقعهم الإلكتروني."
    ],
    "commentSummary": [
      "Relativty هو جهاز VR مفتوح المصدر بسعر 200 دولار مع تتبع 3DoF (ثلاث درجات من الحرية)، مشابه للنماذج القديمة مثل Oculus Go، ولكنه يفتقر إلى التتبع الأكثر غمرًا 6DoF (ست درجات من الحرية). - HadesVR هو مشروع مفتوح المصدر 6DoF تم تطويره من Relativty، ويقدم تجربة غامرة محسنة وتقليل دوار الحركة مقارنة بأنظمة 3DoF. - المخاوف المتعلقة بالخصوصية مع سماعات Meta's Quest تدفع بعض المستخدمين للنظر في بدائل، وهناك إمكانية لمشاريع تعليمية باستخدام Relativty رغم قيوده."
    ],
    "points": 295,
    "commentCount": 108,
    "retryCount": 0,
    "time": 1731635729
  },
  {
    "id": 42143265,
    "title": "ميزة أمان جديدة من آبل تعيد تشغيل أجهزة الآيفون بعد 3 أيام، يؤكد الباحثون",
    "originLink": "https://techcrunch.com/2024/11/14/new-apple-security-feature-reboots-iphones-after-3-days-researchers-confirm/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42143265",
    "commentBody": "",
    "originSummary": [
      "تقدم شركة آبل في نظام iOS 18 ميزة \"إعادة التشغيل عند عدم النشاط\" التي تعيد تشغيل أجهزة الآيفون تلقائيًا إذا ظلت غير مقفلة لمدة 72 ساعة، مما يعزز الأمان عن طريق تأمين مفاتيح التشفير في شريحة الحماية.",
      "تزيد هذه الميزة من حماية البيانات ضد السرقة والأدوات الجنائية القديمة، لكنها تقدم تحديات لإنفاذ القانون في استخراج البيانات من الأجهزة.",
      "أكد الباحثون الأمنيون وشركات مثل Magnet Forensics هذه الميزة، مسلطين الضوء على التوتر المستمر بين تدابير أمان آبل واحتياجات إنفاذ القانون للوصول إلى البيانات."
    ],
    "commentSummary": [
      "الميزة الأمنية الجديدة من آبل تعيد تشغيل أجهزة الآيفون تلقائيًا بعد 72 ساعة من عدم النشاط، بهدف الحفاظ على الأمان من خلال إزالة البرامج الضارة المحتملة أو الأخطاء. - هذه الميزة تشبه بروتوكولات الأمان في أجهزة الدفع، التي تعيد التشغيل كل 24 ساعة لضمان حالة آمنة. - بينما يعبر بعض المستخدمين عن مخاوفهم بشأن احتمالية انقطاع الاتصال، تُعتبر الميزة بشكل عام خطوة إيجابية نحو تعزيز الأمان، مع اقتراحات لجعل فترة إعادة التشغيل قابلة للتعديل."
    ],
    "points": 270,
    "commentCount": 201,
    "retryCount": 0,
    "time": 1731635711
  },
  {
    "id": 42141761,
    "title": "توفي توماس إي. كورتز",
    "originLink": "https://computerhistory.org/blog/in-memoriam-thomas-e-kurtz-1928-2024/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42141761",
    "commentBody": "",
    "originSummary": [
      "توفي توماس إي. كورتز، المشارك في اختراع لغة البرمجة BASIC، في 12 نوفمبر 2024، تاركًا إرثًا كبيرًا في مجال الحوسبة.",
      "لعب كورتز دورًا حيويًا في تطوير نظام المشاركة الزمنية في دارتموث، مما أتاح الوصول الواسع إلى لغة البرمجة BASIC وأثر على أجيال من تطوير الحوسبة والبرمجيات.",
      "شغل مناصب قيادية في دارتموث، وساهم في معايير BASIC، وتقاعد في عام 1993، وتم تكريمه كزميل في جمعية آلات الحوسبة (ACM) في عام 1994."
    ],
    "commentSummary": [
      "توفي توماس إي. كورتز، المشارك في إنشاء لغة البرمجة BASIC، مما دفع الكثيرين لمشاركة الذكريات والامتنان لمساهماته. لعبت BASIC دورًا حيويًا في ديمقراطية الحوسبة، مما جعل البرمجة متاحة لغير الخبراء وألهمت جيلًا من المبرمجين. كان عمل كورتز في دارتموث، إلى جانب جون كيميني، مهمًا في تطوير أنظمة المشاركة الزمنية والحوسبة التعليمية، مما ترك تأثيرًا دائمًا على صناعة التكنولوجيا."
    ],
    "points": 244,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1731622329
  },
  {
    "id": 42146338,
    "title": "Seer: واجهة رسومية أمامية لـ GDB لنظام Linux",
    "originLink": "https://github.com/epasveer/seer",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42146338",
    "commentBody": "",
    "originSummary": [
      "Seer هو واجهة مستخدم رسومية (GUI) لبرنامج GNU Debugger (gdb) على نظام Linux، مصمم لتحسين تجربة المستخدم بواجهة بسيطة. تم تطويره بواسطة Ernie Pasveer، ويتطلب Seer نظام Linux وC++17 وgdb مع مترجم \"mi\" وCMake 3.1.0+ وQT6، ولم يعد يدعم Qt5 بعد الإصدار 2.3. تشمل الميزات الرئيسية إدارة ملفات المصدر وتتبع المتغيرات وإدارة نقاط التوقف، مع توفر الدعم والتعليمات التفصيلية على GitHub أو عبر البريد الإلكتروني."
    ],
    "commentSummary": [
      "Seer هو واجهة مستخدم رسومية (GUI) لمصحح الأخطاء GNU Debugger (GDB) على نظام لينكس، لكن المستخدمين يبلغون عن مشكلات مثل تغييرات الخط غير الفعالة وأخطاء عند تمرير المؤشر فوق المتغيرات.",
      "على الرغم من عيوبه الحالية، فإن Seer لديه إمكانيات إذا تم تطويره بشكل أكبر، حيث يقارنه المستخدمون بأدوات أخرى مثل Gede، الذي يُعرف ببساطته وموثوقيته.",
      "تسلط المناقشات الضوء على تفضيلات تصحيح الأخطاء المختلفة، بما في ذلك واجهة المستخدم النصية المدمجة في GDB (TUI)، وNeovim، وgdb-dashboard، وDDD، حيث يفضل بعض المستخدمين تسجيل الأحداث على استخدام المصححات في السيناريوهات المعقدة."
    ],
    "points": 203,
    "commentCount": 129,
    "retryCount": 0,
    "time": 1731674169
  }
]
