[
  {
    "id": 42141587,
    "title": "विजुअल बेसिक 6 आईडीई को सी# में पुनः निर्मित किया गया",
    "originLink": "https://github.com/BAndysc/AvaloniaVisualBasic6",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42141587",
    "commentBody": "",
    "originSummary": [
      "एवलोनिया विजुअल बेसिक 6 एक C# पुनर्निर्माण है जो क्लासिक विजुअल बेसिक 6 इंटीग्रेटेड डेवलपमेंट एनवायरनमेंट (IDE) को एवलोनिया का उपयोग करके बनाता है, जिसे एक मजेदार, गैर-व्यावसायिक परियोजना के रूप में बनाया गया है।- इस परियोजना में एक दृश्य डिज़ाइनर, VB6 परियोजना को सहेजने/लोड करने के साथ संगतता, और VB6 भाषा के लिए सीमित समर्थन जैसी विशेषताएं शामिल हैं।- डेस्कटॉप संस्करण का निर्माण आमतौर पर .NET 9.0 की आवश्यकता होती है, लेकिन .NET 8.0 का उपयोग संशोधनों के साथ किया जा सकता है; संकलन `dotnet build` का उपयोग करके किया जाता है, और IDE और रनटाइम दोनों के लिए `dotnet publish` के साथ प्रकाशित किया जाता है।"
    ],
    "commentSummary": [
      "एक विजुअल बेसिक 6 इंटीग्रेटेड डेवलपमेंट एनवायरनमेंट (IDE) को C# का उपयोग करके फिर से बनाया गया है और यह GitHub पर उपलब्ध है, जिससे उन डेवलपर्स में पुरानी यादें ताजा हो रही हैं जिन्होंने VB6 के साथ शुरुआत की थी।",
      "यह परियोजना Avalonia, एक क्रॉस-प्लेटफ़ॉर्म UI फ्रेमवर्क का उपयोग करती है, और बुनियादी VB6 विशेषताओं का समर्थन करती है, हालांकि यह अभी भी प्रगति पर है।",
      "इस पहल को सकारात्मक प्रतिक्रिया मिली है, जिससे ग्राफिकल यूजर इंटरफेस (GUI) टूलकिट्स के विकास और VB6 की समकालीन उपकरणों की तुलना में सरलता पर आगे के विकास और चर्चाओं में रुचि बढ़ी है।"
    ],
    "points": 357,
    "commentCount": 136,
    "retryCount": 0,
    "time": 1731620874
  },
  {
    "id": 42141843,
    "title": "यूरोप में कुकी बैनरों के कारण आर्थिक और उत्पादकता हानि का विश्लेषण",
    "originLink": "https://legiscope.com/blog/hidden-productivity-drain-cookie-banners.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42141843",
    "commentBody": "",
    "originSummary": [
      "यूरोपीय लोग सामूहिक रूप से हर साल 575 मिलियन घंटे कुकी सहमति बैनरों के साथ बातचीत करने में बिताते हैं, जो कि EU निर्देश 2002/58 की एक आवश्यकता है, जिसका उद्देश्य उपयोगकर्ता की गोपनीयता की रक्षा करना है।- इस समय के आर्थिक प्रभाव काफी हैं, जिससे प्रति वर्ष €14.375 बिलियन की लागत आती है, जो EU के GDP का 0.10% है, और यह 287,500 पूर्णकालिक नौकरियों के समान उत्पादकता हानि का प्रतिनिधित्व करता है।- छोटे और मध्यम आकार के उद्यमों को विशेष रूप से प्रभावित करने वाले आर्थिक और उत्पादकता बोझ को कम करने के लिए निर्देश के तत्काल संशोधन की मांग की जा रही है।"
    ],
    "commentSummary": [
      "यूरोपीय \"कुकी कानून\" ट्रैकिंग के लिए सूचित सहमति की आवश्यकता करता है, लेकिन विशेष रूप से कुकी बैनरों के उपयोग का आदेश नहीं देता; कंपनियां अनुपालन के लिए बैनरों का चयन करती हैं।",
      "एक सामान्य समस्या यह है कि कंपनियाँ सहमति को गलत तरीके से लागू करती हैं, जैसे कि डिफ़ॉल्ट रूप से ट्रैकिंग कुकीज़ सेट करना और बैनर प्रदान करना जिसमें स्पष्ट अस्वीकार विकल्प नहीं होता है, जो कि अनुपालन नहीं है।",
      "कानून का उद्देश्य उपभोक्ता अधिकारों की रक्षा करना है, लेकिन कंपनियां अक्सर उपयोगकर्ताओं को निराश करने के लिए \"दुर्भावनापूर्ण अनुपालन\" में संलग्न होती हैं, जो सख्त प्रवर्तन और संभावित ब्राउज़र-आधारित सहमति सेटिंग्स को समाधान के रूप में सुझाती हैं।"
    ],
    "points": 319,
    "commentCount": 352,
    "retryCount": 0,
    "time": 1731622989
  },
  {
    "id": 42143269,
    "title": "रिलेटिविटी: $200 में एक ओपन-सोर्स वीआर हेडसेट",
    "originLink": "https://www.relativty.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42143269",
    "commentBody": "",
    "originSummary": [
      "रिलेटिविटी एक ओपन-सोर्स वर्चुअल रियलिटी (वीआर) हेडसेट है जिसे किशोर मैक्सिम पेरुमल और गेब्रियल कॉम्बे द्वारा विकसित किया गया है। इसे एक DIY प्रोजेक्ट के रूप में डिज़ाइन किया गया है, न कि एक उपभोक्ता उत्पाद के रूप में, और इसकी लागत लगभग $200 है। यह हेडसेट स्टीमवीआर गेम्स का समर्थन करता है और किसी भी कैमरे का उपयोग करके प्रायोगिक पोजिशनल-स्केलिंग की सुविधा प्रदान करता है, जिसमें मदरबोर्ड Atmel SAM3X8E ARM Cortex-M3 प्रोसेसर पर आधारित है। निर्माता एक नया कंपनी, Unai, लॉन्च कर रहे हैं ताकि एक स्टैंडअलोन वीआर हेडसेट विकसित किया जा सके, और वे वर्तमान में भर्ती कर रहे हैं, जिसकी अधिक जानकारी उनकी वेबसाइट पर उपलब्ध है।"
    ],
    "commentSummary": [
      "रिलेटिविटी एक $200 ओपन-सोर्स वीआर हेडसेट है जिसमें 3DoF (तीन डिग्री ऑफ फ्रीडम) ट्रैकिंग है, जो पुराने मॉडलों जैसे ओकुलस गो के समान है, लेकिन इसमें अधिक इमर्सिव 6DoF (छह डिग्री ऑफ फ्रीडम) ट्रैकिंग की कमी है।- हैड्सवीआर एक 6DoF ओपन-सोर्स प्रोजेक्ट है जो रिलेटिविटी से विकसित किया गया है, जो 3DoF सिस्टम की तुलना में बेहतर इमर्सन और कम मोशन सिकनेस प्रदान करता है।- मेटा के क्वेस्ट हेडसेट्स के साथ गोपनीयता संबंधी चिंताओं के कारण कुछ उपयोगकर्ता विकल्पों पर विचार कर रहे हैं, और रिलेटिविटी के सीमाओं के बावजूद शैक्षिक परियोजनाओं के लिए संभावनाएं हैं।"
    ],
    "points": 295,
    "commentCount": 108,
    "retryCount": 0,
    "time": 1731635729
  },
  {
    "id": 42143265,
    "title": "नए एप्पल सुरक्षा फीचर के तहत 3 दिनों के बाद आईफोन को रीबूट किया जाता है, शोधकर्ताओं ने पुष्टि की।",
    "originLink": "https://techcrunch.com/2024/11/14/new-apple-security-feature-reboots-iphones-after-3-days-researchers-confirm/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42143265",
    "commentBody": "",
    "originSummary": [
      "एप्पल का iOS 18 एक \"निष्क्रियता पुनरारंभ\" फीचर पेश करता है जो स्वचालित रूप से iPhones को पुनरारंभ करता है यदि वे 72 घंटे तक अनलॉक रहते हैं, जिससे सुरक्षा में सुधार होता है क्योंकि यह सुरक्षित एन्क्लेव चिप में एन्क्रिप्शन कुंजियों को सुरक्षित करता है।",
      "यह सुविधा चोरी और पुराने फोरेंसिक उपकरणों के खिलाफ डेटा सुरक्षा को बढ़ाती है, लेकिन कानून प्रवर्तन के लिए उपकरणों से डेटा निकालने में चुनौतियाँ प्रस्तुत करती है।",
      "सुरक्षा शोधकर्ताओं और मैग्नेट फॉरेंसिक्स जैसी कंपनियों ने इस फीचर की पुष्टि की है, जो एप्पल की सुरक्षा उपायों और कानून प्रवर्तन की डेटा पहुंच आवश्यकताओं के बीच चल रहे तनाव को उजागर करता है।"
    ],
    "commentSummary": [
      "एप्पल की नई सुरक्षा विशेषता 72 घंटे की निष्क्रियता के बाद आईफोन को स्वचालित रूप से पुनः आरंभ करती है, जिसका उद्देश्य संभावित मैलवेयर या त्रुटियों को साफ करके सुरक्षा बनाए रखना है।- यह विशेषता भुगतान टर्मिनलों की सुरक्षा प्रोटोकॉल के समान है, जो हर 24 घंटे में पुनः आरंभ होते हैं ताकि एक सुरक्षित स्थिति सुनिश्चित की जा सके।- जबकि कुछ उपयोगकर्ता संभावित कनेक्टिविटी व्यवधानों के बारे में चिंताएं व्यक्त करते हैं, यह विशेषता आमतौर पर उन्नत सुरक्षा की दिशा में एक सकारात्मक कदम के रूप में देखी जाती है, जिसमें पुनः आरंभ अंतराल को विन्यास योग्य बनाने के सुझाव दिए गए हैं।"
    ],
    "points": 270,
    "commentCount": 201,
    "retryCount": 0,
    "time": 1731635711
  },
  {
    "id": 42141761,
    "title": "थॉमस ई. कुर्ट्ज़ का निधन हो गया है",
    "originLink": "https://computerhistory.org/blog/in-memoriam-thomas-e-kurtz-1928-2024/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42141761",
    "commentBody": "",
    "originSummary": [
      "थॉमस ई. कर्ट्ज़, जो BASIC प्रोग्रामिंग भाषा के सह-आविष्कारक थे, का 12 नवंबर, 2024 को निधन हो गया, जिससे कंप्यूटिंग में एक महत्वपूर्ण विरासत पीछे छूट गई।",
      "Kurtz ने डार्टमाउथ टाइमशेयरिंग सिस्टम के विकास में एक महत्वपूर्ण भूमिका निभाई, जिससे BASIC की व्यापक पहुंच संभव हुई और कंप्यूटिंग और सॉफ्टवेयर विकास की पीढ़ियों पर प्रभाव पड़ा।",
      "उन्होंने डार्टमाउथ में नेतृत्व की भूमिकाएँ निभाईं, BASIC मानकों में योगदान दिया, 1993 में सेवानिवृत्त हुए, और 1994 में एसोसिएशन फॉर कंप्यूटिंग मशीनरी (ACM) के फेलो के रूप में सम्मानित किए गए।"
    ],
    "commentSummary": [
      "थॉमस ई. कर्ट्ज़, BASIC प्रोग्रामिंग भाषा के सह-निर्माता, का निधन हो गया है, जिससे कई लोग उनकी योगदानों के लिए यादें और आभार साझा कर रहे हैं।- BASIC ने कंप्यूटिंग को लोकतांत्रिक बनाने में महत्वपूर्ण भूमिका निभाई, जिससे प्रोग्रामिंग गैर-विशेषज्ञों के लिए सुलभ हो गई और प्रोग्रामर्स की एक पीढ़ी को प्रेरित किया।- डार्टमाउथ में जॉन केमेनी के साथ कर्ट्ज़ का काम समय-साझाकरण प्रणालियों और शैक्षिक कंप्यूटिंग के विकास में महत्वपूर्ण था, जिसने तकनीकी उद्योग पर एक स्थायी प्रभाव छोड़ा।"
    ],
    "points": 244,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1731622329
  },
  {
    "id": 42146338,
    "title": "सीयर: लिनक्स के लिए जीडीबी का एक जीयूआई फ्रंट एंड",
    "originLink": "https://github.com/epasveer/seer",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42146338",
    "commentBody": "",
    "originSummary": [
      "सीयर लिनक्स पर जीएनयू डिबगर (gdb) के लिए एक ग्राफिकल यूजर इंटरफेस (GUI) फ्रंटेंड है, जिसे एक सरल इंटरफेस के साथ उपयोगकर्ता अनुभव को बढ़ाने के लिए डिज़ाइन किया गया है।- अर्नी पासवीर द्वारा विकसित, सीयर के लिए लिनक्स, C++17, gdb के \"mi\" इंटरप्रेटर, CMake 3.1.0+, और QT6 की आवश्यकता होती है, और यह संस्करण 2.3 के बाद Qt5 का समर्थन नहीं करता है।- मुख्य विशेषताओं में स्रोत फ़ाइल प्रबंधन, वेरिएबल ट्रैकिंग, और ब्रेकपॉइंट प्रबंधन शामिल हैं, जिनके लिए समर्थन और विस्तृत निर्देश GitHub पर या ईमेल के माध्यम से उपलब्ध हैं।"
    ],
    "commentSummary": [
      "सीयर लिनक्स पर जीएनयू डिबगर (जीडीबी) के लिए एक ग्राफिकल यूजर इंटरफेस (जीयूआई) है, लेकिन उपयोगकर्ता ऐसी समस्याओं की रिपोर्ट करते हैं जैसे कि फॉन्ट परिवर्तन का काम न करना और वेरिएबल होवर त्रुटियाँ।",
      "इसके वर्तमान दोषों के बावजूद, सीयर में और अधिक विकास के साथ संभावनाएं हैं, क्योंकि उपयोगकर्ता इसकी तुलना अन्य उपकरणों जैसे गेडे से कर रहे हैं, जो अपनी सरलता और विश्वसनीयता के लिए जाना जाता है।",
      "चर्चाओं में विभिन्न डिबगिंग प्राथमिकताओं पर प्रकाश डाला गया है, जिसमें GDB का अंतर्निहित टेक्स्ट यूजर इंटरफेस (TUI), Neovim, gdb-dashboard, और DDD शामिल हैं, जबकि कुछ उपयोगकर्ता जटिल परिदृश्यों के लिए डिबगर्स की तुलना में लॉगिंग को प्राथमिकता देते हैं।"
    ],
    "points": 203,
    "commentCount": 129,
    "retryCount": 0,
    "time": 1731674169
  }
]
