[
  {
    "id": 42141587,
    "title": "Visual Basic 6 IDE luotu uudelleen C#:lla",
    "originLink": "https://github.com/BAndysc/AvaloniaVisualBasic6",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42141587",
    "commentBody": "",
    "originSummary": [
      "Avalonia Visual Basic 6 on C#:lla toteutettu versio klassisesta Visual Basic 6 -integroidusta kehitysympäristöstä (IDE) käyttäen Avaloniaa, ja se on tarkoitettu hauskaksi, ei-kaupalliseksi projektiksi. Projekti sisältää ominaisuuksia, kuten visuaalisen suunnittelijan, yhteensopivuuden VB6-projektien tallennuksen/latauksen kanssa ja rajoitetun tuen VB6-kielelle. Työpöytäversion rakentaminen vaatii yleensä .NET 9.0:n, mutta .NET 8.0:aa voidaan käyttää muutoksilla; kääntäminen tehdään `dotnet build` -komennolla ja julkaisu `dotnet publish` -komennolla sekä IDE:lle että ajonaikaiselle ympäristölle."
    ],
    "commentSummary": [
      "Visual Basic 6 -integroitu kehitysympäristö (IDE) on luotu uudelleen C#:lla ja se on saatavilla GitHubissa, herättäen nostalgiaa kehittäjissä, jotka aloittivat VB6:lla.",
      "Projekti käyttää Avaloniaa, monialustaista käyttöliittymäkehystä, ja tukee perus VB6-ominaisuuksia, vaikka se onkin vielä keskeneräinen.",
      "Initiatiivi on saanut positiivista palautetta, mikä on herättänyt kiinnostusta jatkokehitykseen ja keskusteluihin graafisten käyttöliittymätyökalujen (GUI) kehityksestä sekä VB6:n yksinkertaisuudesta verrattuna nykyaikaisiin työkaluihin."
    ],
    "points": 357,
    "commentCount": 136,
    "retryCount": 0,
    "time": 1731620874
  },
  {
    "id": 42141843,
    "title": "Analyysi evästeilmoitusten aiheuttamista taloudellisista ja tuottavuuden menetyksistä Euroopassa",
    "originLink": "https://legiscope.com/blog/hidden-productivity-drain-cookie-banners.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42141843",
    "commentBody": "",
    "originSummary": [
      "Eurooppalaiset käyttävät yhteensä 575 miljoonaa tuntia vuodessa vuorovaikutukseen evästeiden suostumusbannerien kanssa, mikä on EU:n direktiivin 2002/58 vaatimus ja jonka tarkoituksena on suojella käyttäjien yksityisyyttä. Tämän käytetyn ajan taloudellinen vaikutus on merkittävä, ja se maksaa vuosittain 14,375 miljardia euroa, mikä vastaa 0,10 % EU:n BKT:sta, ja edustaa tuottavuuden menetystä, joka vastaa 287 500 kokopäiväistä työpaikkaa. On esitetty kiireellinen vaatimus direktiivin tarkistamiseksi taloudellisten ja tuottavuusrasitteiden lievittämiseksi, erityisesti pieniin ja keskisuuriin yrityksiin kohdistuvien vaikutusten vuoksi."
    ],
    "commentSummary": [
      "Eurooppalainen \"evästelaki\" vaatii tietoon perustuvaa suostumusta seurantaan, mutta ei erityisesti edellytä evästeiden käyttöön liittyvien bannerien käyttöä; yritykset valitsevat bannerit noudattaakseen lakia.",
      "Yleinen ongelma on, että yritykset toteuttavat suostumuksen väärin asettamalla seurantakeksejä oletuksena ja tarjoamalla bannereita ilman selkeää hylkäysvaihtoehtoa, mikä ei ole sääntöjen mukaista.",
      "Lain tarkoituksena on suojella kuluttajien oikeuksia, mutta yritykset harjoittavat usein \"pahantahtoista noudattamista\" turhauttaakseen käyttäjiä, mikä viittaa tiukempaan valvontaan ja mahdollisiin selainpohjaisiin suostumusasetuksiin ratkaisuina."
    ],
    "points": 319,
    "commentCount": 352,
    "retryCount": 0,
    "time": 1731622989
  },
  {
    "id": 42143269,
    "title": "Relativty: Avoimen lähdekoodin VR-kuulokkeet hintaan 200 dollaria",
    "originLink": "https://www.relativty.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42143269",
    "commentBody": "",
    "originSummary": [
      "Relativty on avoimen lähdekoodin virtuaalitodellisuus (VR) -kuuloke, jonka ovat kehittäneet teini-ikäiset Maxim Perumal ja Gabriel Combe. Se on suunniteltu tee-se-itse-projektiksi eikä kuluttajatuotteeksi, ja sen hinta on noin 200 dollaria. Kuuloke tukee SteamVR-pelejä ja siinä on kokeellinen paikkaskaalautuvuus, joka käyttää mitä tahansa kameraa, ja sen emolevy perustuu Atmel SAM3X8E ARM Cortex-M3 -prosessoriin. Luojat ovat perustamassa uutta yritystä, Unai, kehittääkseen itsenäistä VR-kuuloketta, ja he ovat parhaillaan rekrytoimassa, lisätietoja on saatavilla heidän verkkosivustollaan."
    ],
    "commentSummary": [
      "Relativty on 200 dollarin avoimen lähdekoodin VR-kuuloke, jossa on 3DoF (kolmen vapausasteen) seuranta, samanlainen kuin vanhemmissa malleissa kuten Oculus Go, mutta siitä puuttuu immersiivisempi 6DoF (kuuden vapausasteen) seuranta. HadesVR on 6DoF avoimen lähdekoodin projekti, joka on kehitetty Relativtystä, tarjoten parannettua immersiota ja vähentäen liikesairautta verrattuna 3DoF-järjestelmiin. Metan Quest-kuulokkeiden yksityisyyshuolien vuoksi jotkut käyttäjät harkitsevat vaihtoehtoja, ja Relativtyllä on potentiaalia koulutushankkeisiin rajoituksistaan huolimatta."
    ],
    "points": 295,
    "commentCount": 108,
    "retryCount": 0,
    "time": 1731635729
  },
  {
    "id": 42143265,
    "title": "Uusi Applen tietoturvaominaisuus käynnistää iPhonet uudelleen kolmen päivän jälkeen, tutkijat vahvistavat",
    "originLink": "https://techcrunch.com/2024/11/14/new-apple-security-feature-reboots-iphones-after-3-days-researchers-confirm/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42143265",
    "commentBody": "",
    "originSummary": [
      "Applen iOS 18 esittelee \"toimettomuuden uudelleenkäynnistys\" -ominaisuuden, joka käynnistää iPhonet automaattisesti uudelleen, jos ne pysyvät lukitsemattomina 72 tuntia, parantaen turvallisuutta suojaamalla salausavaimet suojatussa enclave-sirussa.",
      "Tämä ominaisuus lisää tietosuojaa varkauksia ja vanhentuneita oikeuslääketieteellisiä työkaluja vastaan, mutta aiheuttaa haasteita lainvalvontaviranomaisille laitteista tapahtuvassa tiedonkeruussa.",
      "Turvallisuustutkijat ja yritykset, kuten Magnet Forensics, ovat vahvistaneet ominaisuuden, korostaen jatkuvaa jännitettä Applen turvallisuustoimenpiteiden ja lainvalvonnan tietojen saantitarpeiden välillä."
    ],
    "commentSummary": [
      "Applen uusi suojausominaisuus käynnistää iPhonet automaattisesti uudelleen 72 tunnin käyttämättömyyden jälkeen, pyrkien ylläpitämään turvallisuutta poistamalla mahdolliset haittaohjelmat tai virheet. Tämä ominaisuus on samankaltainen kuin maksupäätteiden suojausprotokollat, jotka käynnistyvät uudelleen 24 tunnin välein varmistaakseen turvallisen tilan. Vaikka jotkut käyttäjät ilmaisevat huolensa mahdollisista yhteyskatkoksista, ominaisuutta pidetään yleisesti positiivisena askeleena kohti parannettua turvallisuutta, ja on ehdotettu, että uudelleenkäynnistysväli olisi säädettävissä."
    ],
    "points": 270,
    "commentCount": 201,
    "retryCount": 0,
    "time": 1731635711
  },
  {
    "id": 42141761,
    "title": "Thomas E. Kurtz on kuollut",
    "originLink": "https://computerhistory.org/blog/in-memoriam-thomas-e-kurtz-1928-2024/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42141761",
    "commentBody": "",
    "originSummary": [
      "Thomas E. Kurtz, BASIC-ohjelmointikielen toinen keksijä, menehtyi 12. marraskuuta 2024, jättäen merkittävän perinnön tietojenkäsittelytieteeseen.",
      "Kurtzilla oli keskeinen rooli Dartmouthin aikajakojärjestelmän kehittämisessä, mikä mahdollisti laajan pääsyn BASIC-kieleen ja vaikutti sukupolvien ajan tietojenkäsittelyyn ja ohjelmistokehitykseen.",
      "Hän toimi johtotehtävissä Dartmouthissa, osallistui BASIC-standardien kehittämiseen, jäi eläkkeelle vuonna 1993 ja sai tunnustuksen Association for Computing Machineryn (ACM) jäsenenä vuonna 1994."
    ],
    "commentSummary": [
      "Thomas E. Kurtz, BASIC-ohjelmointikielen toinen luoja, on menehtynyt, mikä on saanut monet jakamaan muistoja ja kiitollisuutta hänen panoksestaan. BASIC:llä oli keskeinen rooli tietotekniikan demokratisoinnissa, sillä se teki ohjelmoinnista saavutettavaa ei-asiantuntijoille ja inspiroi kokonaisen sukupolven ohjelmoijia. Kurtzin työ Dartmouthissa yhdessä John Kemenyn kanssa oli merkittävää aikajakojärjestelmien ja opetusteknologian kehittämisessä, jättäen pysyvän vaikutuksen teknologia-alalle."
    ],
    "points": 244,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1731622329
  },
  {
    "id": 42146338,
    "title": "Seer: Graafinen käyttöliittymä GDB:lle Linuxissa",
    "originLink": "https://github.com/epasveer/seer",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42146338",
    "commentBody": "",
    "originSummary": [
      "Seer on graafinen käyttöliittymä (GUI) GNU Debuggerille (gdb) Linuxissa, suunniteltu parantamaan käyttäjäkokemusta yksinkertaisella käyttöliittymällä. Ernie Pasveerin kehittämä Seer vaatii Linuxin, C++17:n, gdb:n \"mi\"-tulkilla, CMake 3.1.0+:n ja QT6:n, eikä se enää tue Qt5:tä version 2.3 jälkeen. Tärkeimpiä ominaisuuksia ovat lähdetiedostojen hallinta, muuttujien seuranta ja katkaisupisteiden hallinta, ja tuki sekä yksityiskohtaiset ohjeet ovat saatavilla GitHubissa tai sähköpostitse."
    ],
    "commentSummary": [
      "Seer on graafinen käyttöliittymä (GUI) GNU Debuggerille (GDB) Linuxissa, mutta käyttäjät raportoivat ongelmista, kuten toimimattomista fonttimuutoksista ja muuttujien leijutukseen liittyvistä virheistä.",
      "Huolimatta nykyisistä puutteistaan, Seerillä on potentiaalia, jos sitä kehitetään edelleen, ja käyttäjät vertaavat sitä muihin työkaluihin, kuten Gedeen, joka tunnetaan yksinkertaisuudestaan ja luotettavuudestaan.",
      "Keskusteluissa korostetaan erilaisia virheenkorjausmieltymyksiä, mukaan lukien GDB:n sisäänrakennettu tekstikäyttöliittymä (TUI), Neovim, gdb-dashboard ja DDD, ja jotkut käyttäjät suosivat lokitusta virheenkorjaajien sijaan monimutkaisissa tilanteissa."
    ],
    "points": 203,
    "commentCount": 129,
    "retryCount": 0,
    "time": 1731674169
  }
]
