[
  {
    "id": 42141587,
    "title": "ভিজ্যুয়াল বেসিক ৬ আইডিই সি# এ পুনরায় তৈরি করা হয়েছে",
    "originLink": "https://github.com/BAndysc/AvaloniaVisualBasic6",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42141587",
    "commentBody": "",
    "originSummary": [
      "অ্যাভালোনিয়া ভিজ্যুয়াল বেসিক ৬ হল ক্লাসিক ভিজ্যুয়াল বেসিক ৬ ইন্টিগ্রেটেড ডেভেলপমেন্ট এনভায়রনমেন্ট (IDE)-এর একটি সি# পুনর্নির্মাণ, যা অ্যাভালোনিয়া ব্যবহার করে তৈরি করা হয়েছে এবং এটি একটি মজার, অ-বাণিজ্যিক প্রকল্প হিসেবে পরিকল্পিত।- প্রকল্পটিতে ভিজ্যুয়াল ডিজাইনার, VB6 প্রকল্প সংরক্ষণ/লোড করার সামঞ্জস্যতা এবং VB6 ভাষার সীমিত সমর্থন সহ বৈশিষ্ট্য অন্তর্ভুক্ত রয়েছে।- ডেস্কটপ সংস্করণ তৈরি করতে সাধারণত .NET 9.0 প্রয়োজন হয়, তবে কিছু পরিবর্তনের মাধ্যমে .NET 8.0 ব্যবহার করা যেতে পারে; সংকলন `dotnet build` ব্যবহার করে করা হয় এবং IDE এবং রানটাইম উভয়ের জন্য `dotnet publish` দিয়ে প্রকাশ করা হয়।"
    ],
    "commentSummary": [
      "একটি ভিজ্যুয়াল বেসিক ৬ ইন্টিগ্রেটেড ডেভেলপমেন্ট এনভায়রনমেন্ট (আইডিই) সি# ব্যবহার করে পুনরায় তৈরি করা হয়েছে এবং এটি গিটহাবে উপলব্ধ, যা সেইসব ডেভেলপারদের মধ্যে নস্টালজিয়া সৃষ্টি করছে যারা ভিবি৬ দিয়ে শুরু করেছিলেন।",
      "প্রকল্পটি একটি ক্রস-প্ল্যাটফর্ম UI ফ্রেমওয়ার্ক, অ্যাভালোনিয়া ব্যবহার করে এবং মৌলিক VB6 বৈশিষ্ট্যগুলিকে সমর্থন করে, যদিও এটি এখনও একটি চলমান কাজ।",
      "উদ্যোগটি ইতিবাচক প্রতিক্রিয়া পেয়েছে, যা আরও উন্নয়ন এবং গ্রাফিক্যাল ইউজার ইন্টারফেস (GUI) টুলকিটের বিবর্তন এবং সমসাময়িক সরঞ্জামগুলির তুলনায় VB6 এর সরলতা নিয়ে আলোচনার আগ্রহ জাগিয়েছে।"
    ],
    "points": 357,
    "commentCount": 136,
    "retryCount": 0,
    "time": 1731620874
  },
  {
    "id": 42141843,
    "title": "ইউরোপে কুকি ব্যানার দ্বারা সৃষ্ট অর্থনৈতিক এবং উৎপাদনশীলতার ক্ষতির বিশ্লেষণ",
    "originLink": "https://legiscope.com/blog/hidden-productivity-drain-cookie-banners.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42141843",
    "commentBody": "",
    "originSummary": [
      "ইউরোপীয়রা প্রতি বছর সম্মিলিতভাবে ৫৭৫ মিলিয়ন ঘণ্টা কুকি সম্মতি ব্যানারের সাথে মিথস্ক্রিয়া করতে ব্যয় করে, যা ইইউ ডিরেক্টিভ ২০০২/৫৮ এর একটি প্রয়োজনীয়তা, যা ব্যবহারকারীর গোপনীয়তা রক্ষা করার লক্ষ্য রাখে।- এই সময় ব্যয়ের অর্থনৈতিক প্রভাব উল্লেখযোগ্য, যা বার্ষিক €১৪.৩৭৫ বিলিয়ন খরচ করে, যা ইইউ'র জিডিপির ০.১০% এর সমতুল্য এবং ২৮৭,৫০০ পূর্ণকালীন চাকরির সমতুল্য উৎপাদনশীলতার ক্ষতি প্রতিনিধিত্ব করে।- অর্থনৈতিক এবং উৎপাদনশীলতার বোঝা লাঘব করার জন্য, বিশেষ করে ছোট এবং মাঝারি আকারের উদ্যোগগুলিকে প্রভাবিত করে, নির্দেশিকার জরুরি সংশোধনের জন্য একটি আহ্বান রয়েছে।"
    ],
    "commentSummary": [
      "ইউরোপীয় \"কুকি আইন\" ট্র্যাকিংয়ের জন্য অবগত সম্মতি প্রয়োজন, তবে কুকি ব্যানার ব্যবহারের জন্য নির্দিষ্টভাবে বাধ্য করে না; কোম্পানিগুলি সম্মতি প্রদানের জন্য ব্যানার ব্যবহার করে।",
      "একটি সাধারণ সমস্যা হল কোম্পানিগুলি সম্মতি ভুলভাবে প্রয়োগ করে, ডিফল্টভাবে ট্র্যাকিং কুকিজ সেট করে এবং স্পষ্ট প্রত্যাখ্যান বিকল্প ছাড়াই ব্যানার প্রদান করে, যা অননুমোদিত।",
      "আইনটির উদ্দেশ্য হল ভোক্তাদের অধিকার রক্ষা করা, কিন্তু কোম্পানিগুলি প্রায়ই ব্যবহারকারীদের বিরক্ত করতে \"দুরভিসন্ধিমূলক সম্মতি\" তে জড়িত হয়, যা কঠোর প্রয়োগ এবং সম্ভাব্য ব্রাউজার-ভিত্তিক সম্মতি সেটিংসকে সমাধান হিসাবে প্রস্তাব করে।"
    ],
    "points": 319,
    "commentCount": 352,
    "retryCount": 0,
    "time": 1731622989
  },
  {
    "id": 42143269,
    "title": "রিলেটিভিটি: একটি ওপেন-সোর্স ভিআর হেডসেট $২০০ ডলারে",
    "originLink": "https://www.relativty.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42143269",
    "commentBody": "",
    "originSummary": [
      "রিলেটিভিটি একটি ওপেন-সোর্স ভার্চুয়াল রিয়েলিটি (ভিআর) হেডসেট যা কিশোর ম্যাক্সিম পেরুমাল এবং গ্যাব্রিয়েল কম্ব দ্বারা উন্নত করা হয়েছে, যা একটি ডিআইওয়াই প্রকল্প হিসাবে ডিজাইন করা হয়েছে, ভোক্তা পণ্য হিসাবে নয়, যার খরচ প্রায় $200।- হেডসেটটি স্টিমভিআর গেম সমর্থন করে এবং পরীক্ষামূলক পজিশনাল-স্কেলিং বৈশিষ্ট্যযুক্ত যা যেকোনো ক্যামেরা ব্যবহার করে, এবং এটিতে একটি মাদারবোর্ড রয়েছে যা Atmel SAM3X8E ARM Cortex-M3 প্রসেসরের উপর ভিত্তি করে।- স্রষ্টারা একটি নতুন কোম্পানি, ইউনাই, চালু করছেন একটি স্ট্যান্ডঅলোন ভিআর হেডসেট উন্নয়নের জন্য, এবং তারা বর্তমানে নিয়োগ দিচ্ছেন, যার আরও তথ্য তাদের ওয়েবসাইটে পাওয়া যাবে।"
    ],
    "commentSummary": [
      "রিলেটিভিটি একটি $২০০ মূল্যের ওপেন-সোর্স ভিআর হেডসেট যা ৩ডিওএফ (তিন ডিগ্রি অব ফ্রিডম) ট্র্যাকিং সহ আসে, যা পুরনো মডেলগুলির মতো যেমন অকুলাস গো, কিন্তু এতে আরও বেশি ইমারসিভ ৬ডিওএফ (ছয় ডিগ্রি অব ফ্রিডম) ট্র্যাকিং নেই।- হেডেসভিআর একটি ৬ডিওএফ ওপেন-সোর্স প্রকল্প যা রিলেটিভিটি থেকে উন্নত করা হয়েছে, যা ৩ডিওএফ সিস্টেমের তুলনায় উন্নত ইমারশন এবং কম গতিশীলতা অসুস্থতা প্রদান করে।- মেটার কোয়েস্ট হেডসেটগুলির সাথে গোপনীয়তা উদ্বেগের কারণে কিছু ব্যবহারকারী বিকল্প বিবেচনা করছেন, এবং রিলেটিভিটির সীমাবদ্ধতা সত্ত্বেও শিক্ষামূলক প্রকল্পগুলির জন্য সম্ভাবনা রয়েছে।"
    ],
    "points": 295,
    "commentCount": 108,
    "retryCount": 0,
    "time": 1731635729
  },
  {
    "id": 42143265,
    "title": "নতুন অ্যাপল সিকিউরিটি ফিচার ৩ দিন পর আইফোন রিবুট করে, গবেষকরা নিশ্চিত করেছেন",
    "originLink": "https://techcrunch.com/2024/11/14/new-apple-security-feature-reboots-iphones-after-3-days-researchers-confirm/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42143265",
    "commentBody": "",
    "originSummary": [
      "অ্যাপলের iOS 18 একটি \"অক্রিয়তা পুনরায় চালু\" বৈশিষ্ট্য প্রবর্তন করেছে যা স্বয়ংক্রিয়ভাবে আইফোনগুলি পুনরায় চালু করে যদি তারা ৭২ ঘন্টা আনলক অবস্থায় থাকে, যা নিরাপত্তা উন্নত করে নিরাপদ এনক্লেভ চিপে এনক্রিপশন কী সুরক্ষিত করে।",
      "এই বৈশিষ্ট্যটি চুরি এবং পুরনো ফরেনসিক সরঞ্জামগুলির বিরুদ্ধে ডেটা সুরক্ষা বৃদ্ধি করে, কিন্তু ডিভাইস থেকে ডেটা নিষ্কাশনে আইন প্রয়োগকারী সংস্থার জন্য চ্যালেঞ্জ উপস্থাপন করে।",
      "নিরাপত্তা গবেষক এবং ম্যাগনেট ফরেনসিকসের মতো কোম্পানিগুলি এই বৈশিষ্ট্যটি নিশ্চিত করেছে, যা অ্যাপলের নিরাপত্তা ব্যবস্থার সাথে আইন প্রয়োগকারী সংস্থার ডেটা অ্যাক্সেসের প্রয়োজনের মধ্যে চলমান উত্তেজনাকে তুলে ধরেছে।"
    ],
    "commentSummary": [
      "অ্যাপলের নতুন সুরক্ষা বৈশিষ্ট্যটি ৭২ ঘণ্টা নিষ্ক্রিয় থাকার পর স্বয়ংক্রিয়ভাবে আইফোনগুলি পুনরায় চালু করে, সম্ভাব্য ম্যালওয়্যার বা ত্রুটি দূর করে সুরক্ষা বজায় রাখার লক্ষ্যে।- এই বৈশিষ্ট্যটি পেমেন্ট টার্মিনালের সুরক্ষা প্রোটোকলের অনুরূপ, যা প্রতিদিন ২৪ ঘণ্টা পর পুনরায় চালু হয় একটি সুরক্ষিত অবস্থা নিশ্চিত করতে।- যদিও কিছু ব্যবহারকারী সম্ভাব্য সংযোগ বিঘ্নিত হওয়ার বিষয়ে উদ্বেগ প্রকাশ করেছেন, এই বৈশিষ্ট্যটি সাধারণত উন্নত সুরক্ষার দিকে একটি ইতিবাচক পদক্ষেপ হিসেবে দেখা হয়, পুনরায় চালু করার সময়ের ব্যবধান কনফিগারযোগ্য করার প্রস্তাব সহ।"
    ],
    "points": 270,
    "commentCount": 201,
    "retryCount": 0,
    "time": 1731635711
  },
  {
    "id": 42141761,
    "title": "থমাস ই. কার্টজ মারা গেছেন",
    "originLink": "https://computerhistory.org/blog/in-memoriam-thomas-e-kurtz-1928-2024/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42141761",
    "commentBody": "",
    "originSummary": [
      "বেসিক প্রোগ্রামিং ভাষার সহ-উদ্ভাবক থমাস ই. কার্টজ ১২ নভেম্বর, ২০২৪ তারিখে পরলোক গমন করেন, কম্পিউটিং ক্ষেত্রে একটি গুরুত্বপূর্ণ উত্তরাধিকার রেখে গেছেন।",
      "কার্টজ ডার্টমাউথ টাইমশেয়ারিং সিস্টেমের উন্নয়নে একটি গুরুত্বপূর্ণ ভূমিকা পালন করেছিলেন, যা বিস্তৃতভাবে BASIC-এর অ্যাক্সেস সক্ষম করেছিল এবং কম্পিউটিং ও সফটওয়্যার উন্নয়নের প্রজন্মকে প্রভাবিত করেছিল।",
      "তিনি ডার্টমাউথে নেতৃত্বের ভূমিকা পালন করেছিলেন, BASIC মানদণ্ডে অবদান রেখেছিলেন, ১৯৯৩ সালে অবসর গ্রহণ করেছিলেন এবং ১৯৯৪ সালে অ্যাসোসিয়েশন ফর কম্পিউটিং মেশিনারি (ACM) এর ফেলো হিসেবে সম্মানিত হয়েছিলেন।"
    ],
    "commentSummary": [
      "বেসিক প্রোগ্রামিং ভাষার সহ-স্রষ্টা থমাস ই. কার্টজের মৃত্যু হয়েছে, যা অনেককে তার অবদানগুলির জন্য স্মৃতি এবং কৃতজ্ঞতা ভাগ করে নিতে প্ররোচিত করেছে।- বেসিক কম্পিউটিংকে গণতান্ত্রিক করতে একটি গুরুত্বপূর্ণ ভূমিকা পালন করেছিল, অ-বিশেষজ্ঞদের জন্য প্রোগ্রামিংকে অ্যাক্সেসযোগ্য করে তুলেছিল এবং প্রোগ্রামারদের একটি প্রজন্মকে অনুপ্রাণিত করেছিল।- ডার্টমাউথে কার্টজের কাজ, জন কেমেনির সাথে, সময়-ভাগ সিস্টেম এবং শিক্ষামূলক কম্পিউটিংয়ের বিকাশে উল্লেখযোগ্য ছিল, যা প্রযুক্তি শিল্পে একটি স্থায়ী প্রভাব ফেলেছিল।"
    ],
    "points": 244,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1731622329
  },
  {
    "id": 42146338,
    "title": "সিয়ার: লিনাক্সের জন্য জিডিবি-এর একটি জিইউআই ফ্রন্ট এন্ড",
    "originLink": "https://github.com/epasveer/seer",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42146338",
    "commentBody": "",
    "originSummary": [
      "সিয়ার হল লিনাক্সে জিএনইউ ডিবাগার (gdb) এর জন্য একটি গ্রাফিক্যাল ইউজার ইন্টারফেস (GUI) ফ্রন্টএন্ড, যা ব্যবহারকারীর অভিজ্ঞতা উন্নত করতে একটি সহজ ইন্টারফেস প্রদান করে।- এটি আর্নি পাসভিয়ার দ্বারা উন্নত করা হয়েছে এবং সিয়ার চালানোর জন্য লিনাক্স, C++17, \"mi\" ইন্টারপ্রেটার সহ gdb, CMake 3.1.0+ এবং QT6 প্রয়োজন হয়, এবং এটি আর Qt5 কে সংস্করণ 2.3 এর পর সমর্থন করে না।- মূল বৈশিষ্ট্যগুলির মধ্যে রয়েছে সোর্স ফাইল ব্যবস্থাপনা, ভেরিয়েবল ট্র্যাকিং এবং ব্রেকপয়েন্ট ব্যবস্থাপনা, এবং সহায়তা ও বিস্তারিত নির্দেশাবলী GitHub বা ইমেইলের মাধ্যমে পাওয়া যায়।"
    ],
    "commentSummary": [
      "সিয়ার হল লিনাক্সে জিএনইউ ডিবাগার (জিডিবি) এর জন্য একটি গ্রাফিক্যাল ইউজার ইন্টারফেস (জিইউআই), তবে ব্যবহারকারীরা যেমন অকার্যকর ফন্ট পরিবর্তন এবং ভেরিয়েবল হোভার ত্রুটির মতো সমস্যার রিপোর্ট করেন।",
      "এর বর্তমান ত্রুটিগুলি সত্ত্বেও, সিয়ার-এর সম্ভাবনা রয়েছে যদি এটি আরও উন্নত করা হয়, ব্যবহারকারীরা এটিকে অন্যান্য সরঞ্জাম যেমন গেডের সাথে তুলনা করে, যা এর সরলতা এবং নির্ভরযোগ্যতার জন্য পরিচিত।",
      "আলোচনাগুলি বিভিন্ন ডিবাগিং পছন্দগুলি তুলে ধরে, যার মধ্যে রয়েছে GDB-এর বিল্ট-ইন টেক্সট ইউজার ইন্টারফেস (TUI), Neovim, gdb-dashboard, এবং DDD, যেখানে কিছু ব্যবহারকারী জটিল পরিস্থিতির জন্য ডিবাগারগুলির পরিবর্তে লগিংকে পছন্দ করেন।"
    ],
    "points": 203,
    "commentCount": 129,
    "retryCount": 0,
    "time": 1731674169
  }
]
