[
  {
    "title": "“先锋领航退股并全面裁员 游戏工作室，腾讯独家销售Meta新VR设备”",
    "originLink": "https://cn.wsj.com/articles/%E4%B8%AD%E6%A6%82%E8%82%A1%E7%AE%80%E6%8A%A5-%E5%85%88%E9%94%8B%E9%A2%86%E8%88%AA%E9%80%80%E8%82%A1%E4%B8%8E%E8%9A%82%E8%9A%81%E9%9B%86%E5%9B%A2%E5%90%88%E8%B5%84%E5%85%AC%E5%8F%B8-a95f7175",
    "originBody": "金融市场 中概股简报：先锋领航退股与蚂蚁集团合资公司 PICO裁撤游戏工作室团队，日活前三VR音游全员被裁；景林资产最新美股持仓曝光：不断加码拼多多，看好消费、AI。 2023年11月11日10:20 CST 更新 据报腾讯成Meta新VR头戴装置中国独家销售商 Meta于... 成为《华尔街日报》会员， 畅读全文 马上注册 已经是会员? 登录 热门视频 揭秘拉斯维加斯巨球“炸裂视觉效果”背后的技术 為什麼我們應該向四歲兒童學習？ [中文] 以色列軍方稱其地面部隊已完全包圍加薩市 聯合國秘書長稱加薩正成為「兒童墓地」 揭秘拉斯維加斯巨球「震撼視覺效果」背後的技術",
    "originSummary": [
      "根据一份关于中国概念股的财经简报，Pioneer Navigation已经撤回股票，PICO已经裁掉了其整个游戏工作室团队。",
      "简报还透露，京霖资产正在增加在拼多多的股份，看好消费和AI领域的前景。",
      "另外，报告表示腾讯将成为Meta新VR头盔的中国独家销售商。"
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699707972758
  },
  {
    "title": "36Kr全方位解读：京东电商风波和中国创新科技启动环境",
    "originLink": "https://www.36kr.com/video/2512238277136384",
    "originBody": "登录 搜索 36氪Auto 数字时氪 未来消费 智能涌现 未来城市 启动Power on 36氪出海 36氪研究院 超人测评 36氪企服点评 36氪财经 职场bonus 36碳 后浪研究所 暗涌Waves 硬氪 媒体品牌 企业号 企服点评 36Kr研究院 36Kr创新咨询 企业服务 核心服务 城市之窗 政府服务 创投发布 LP源计划 VClub VClub投资机构库 投资机构职位推介 投资人认证 投资人服务 寻求报道 36氪Pro 创投氪堂 企业入驻 创业者服务 创投平台 首页 快讯 资讯 推荐 财经 科技 创新 城市 最新 创投 汽车 企服 专精特新 直播 视频 专题 活动 搜索 寻求报道 我要入驻 城市合作 30 点赞 3 收藏 1 评论 分享 TA的视频 12:08 吊打元气森林、称霸无糖茶，“最难喝”东方树叶凭啥越卖越火？ 10:40 寺庙百元文创，年轻人为何花钱疯抢？揭秘佛教界搞钱达人营销史 11:52 县城音乐节如何圈钱？揭秘音乐节商业真相 查看更多 IC实验室 关注 干不过拼多多、撕逼李佳琦、股价暴跌，京东衰落真相 发布于：11小时前 内容简介 干不过拼多多、撕逼李佳琦、股价暴跌，京东衰落真相 参与讨论 评论千万条，友善第一条 登录后参与讨论 提交评论0/1000 关于36氪 城市合作 寻求报道 我要入驻 投资者关系 商务合作 关于我们 联系我们 加入我们 网络谣言信息举报入口 热门推荐 热门资讯 热门产品 文章标签 快讯标签 合作伙伴 36氪APP下载 iOS & Android 本站由 阿里云 提供计算与安全服务 违法和不良信息、未成年人保护举报电话：010-89650707 举报邮箱：jubao@36kr.com 网上有害信息举报 © 2011~2023 北京多氪信息科技有限公司京ICP备12031756号-6京ICP证150143号京公网安备11010502036099号 意见反馈 36氪APP让一部分人先看到未来 36氪 鲸准 氪空间 推送和解读前沿、有料的科技创投资讯",
    "originSummary": [
      "36Kr是一个致力于初创企业和创业行为的中国科技平台，提供的服务和活动涵盖金融、科技创新、城市发展、投资者、企业和政府服务等领域。",
      "36Kr还提供新闻、视频和直播等多媒体内容。",
      "文章中提到了与电商公司京东有关的一些批评或争议。"
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699707972758
  },
  {
    "title": "\"双11\"购物节四大平台九类产品价格比较：最大折扣是否真的最便宜?",
    "originLink": "https://focus.scol.com.cn/zgsz/202311/82409167.html",
    "originBody": "首页 川观新闻 四川 问政四川 民情热线 C视觉 时事 党务公开 天府社区 天府评论 四川农网 航拍四川 文娱 辟谣 健康 汽车 房产 成都 乐山 泸州 南充 绵阳 德阳 眉山 内江 广元 资阳 巴中 宜宾 达州 遂宁 广安 自贡 攀枝花 雅安 凉山 甘孜 阿坝 关注我们 国内国际 > 天下 > 正文 “双11”四大平台9类产品大比价：有没有绝对“最低价” 2023-11-11 09:15:43 来源：澎湃新闻 编辑：牛霄 手机访问 堪称史上最卷的“双11”，被“最低价”的标签包围。 近日，澎湃新闻记者随机挑选手机、电器、美妆、护肤、时尚、个护、食品、母婴8个品类中，同一品牌、相同规格的9个产品，在淘宝、京东以及拼多多的品牌官方旗舰店以及李佳琦淘宝直播间中进行价格对比。 从11月2日及3日两天记者梳理的价格来看，9个产品在上述四个平台上的价格基本处于同一水平，但也有相差百元，部分手机、电器等价格越贵的单品，在不同平台的价格差更大。 整体来看，即便是今年喊出“最低价”口号最响的两大电商平台，相比另外几大平台价格优势也不明显。 当人人喊出“最低价”，“最低价”的内涵就已经发生了微妙的改变。 当然，抛开满减优惠的因素，各家的平台也有各自的优势品类。 比如，同一规格的苹果iPhone 15 Pro，在拼多多的品牌价格和其他平台相比，便宜600元左右。其中该产品页面显示“百亿补贴，多多支付补贴901元”。 阿迪达斯品牌的某款男鞋，在李佳琦直播间的价格比其他平台便宜80元左右；爱他美品牌某款奶粉，在李佳琦直播间里，双罐价格接近其他平台的单罐价格。 而电器方面，海信某款电视机在京东平台自动满减优惠后，价格比直播间便宜了400元左右。 需要指出的是，上述产品的统计价格均为11月2日至3日，记者领完各类产品券后的单品当日成交价格。部分平台主打满减优惠，除了店铺自身优惠折扣外，消费者若在平台凑单成功，还能够得到更低的单品成交价格。此外，直播间产品若在直播时下单，或有直播间其他红包等福利叠加，因此上述统计价格仅供消费者参考。 此外，记者发现，部分出现在淘宝头部主播李佳琦直播间的产品，基本不会在抖音、快手的头部达人的直播间里出现相同规格。 多个主播告诉澎湃新闻记者，无论是哪个平台，品牌方的产品价格都会在一定的控价范围内，不会为了引流而破坏自身的价格体系，主要为了保障商家在各个渠道的销售利益，很少会出现给直播间的价格要比给经销商的价格(即出厂价)还要低的情况。 其中一位主播表示，即使直播间出现低价，也是品牌方在不同时间段给到不同直播间相似的低价，造成某一直播间、或是平台短期内价格最低的现象。如果品牌方和达人合作得不错，基本会继续合作，有的直播间除了控价外，也会控品。因此一般很少会出现某款产品集中在多个头部达人直播间销售的情况。 “我们公司在各平台的产品定价控制得很严格，是为了推动品牌长期的发展，不赚快钱，也不被任何一方牵着鼻子走。”一家饮料品牌商家告诉澎湃新闻记者，由于没有仓储物流的成本，其品牌产品线上定价比线下销售要低，而在所有电商平台的旗舰店上，定价都是一样的，消费者看到的不同的成交价主要是平台给到的补贴。 “但是给到李佳琦等头部主播的价格会相对更低，本身头部主播流量大，话语权也大，品牌会考虑给到更多的优惠，或是最低价。”上述商家进一步补充道。 “由于受众群体不同，相对天猫和京东，公司产品会在拼多多定价更低一点。”另一位商家表示，为了打产品知名度或者清库存，某一时间段给到平台或是直播间的定价确实会低于出厂价的情况。 上述商家表示，当前，除了拼多多，淘宝以及京东也推出了百亿补贴，力度也都差不多。只是拼多多除了官方旗舰店还有很多第三方店铺，有的产品出货量大，公司会给到不同的经销商，这确实也给消费者加大了辨清正品的难度。 近几年来，在电商平台日活跃用户数量和商家数量渐显疲态的背景下，相比此前花样百出的双11，今年各家电商，不论是官方表态还是私下竞赛，都在往低价和性价比上靠拢。 一位双11资深用户告诉澎湃新闻记者，尽管今年各平台推出多种优惠政策，把“低价”卷起来，但自己没有像往年一样“巨额”消费。对比各个平台，有的平台本身就属于“常年都便宜”，不论何时可以作为底价参考，双11期间各项优惠活动叠加百亿补贴，性价比一直很高。 上述用户还告诉记者，有平台推出的不少都是试用装，现在也不需要囤货了，“比双11买大包装算下来还便宜很多，很多都可以用这样的方式薅到旗舰店的试用装羊毛，算下来甚至低于头部主播直播间的价格。” 编辑推荐 ~下拉加载更多~ 视觉焦点 C视频丨空军“庆生” “祥宇”来贺 学军爱军为军活动庆祝人民空军成立74周年 学习小课堂丨把握新发展阶段，贯彻新发展理念，构建新发展格局 四川申果庄保护区再次拍到野生大熊猫 当一个男人决定去稻城亚丁登雪山 焦点访谈丨荣耀光影 交流互鉴 “君子伙伴·善行致远”慈善主题活动顺利举行 排行榜 关于我们版权声明广告业务联系我们招聘信息隐私保护法律顾问 四川日报网络传媒发展有限公司版权所有 未经书面授权 不得复制或建立镜像 Copyright ©2000-2023 SICHUANDAILY NETWORK MEDIA DEVELOPMENT CO., LTD. All rights reserved. 蜀ICP备12028253号-2 川公网安备51010402000072号 互联网新闻信息服务许可证51120170001 互联网出版许可证 新出网证(川)字001号 网络文化经营许可证 川网文(2017)9822-397号 信息网络传播视听节目许可证2305117 广播电视节目经营许可证(川)字第00079号 四川日报网络传媒发展有限公司",
    "originSummary": [
      "这是一篇比较中国\"双11\"购物节期间四大在线平台产品价格的文章。记者选择了八个类别的九种产品 - 手机，电器，美容，护肤，时尚，个人护理，食品，婴幼儿和母婴 - 并比较了他们在淘宝，京东，拼多多和李佳琪的淘宝直播间的价格。",
      "产品在各平台上的价格范围相似，但在更贵的物品如手机和电器上有一些差异。总的来说，宣称折扣更大的平台并没有明显的价格优势。",
      "该文章还指出，由于不同的折扣策略，某些产品在特定平台上更便宜。"
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699707972758
  },
  {
    "title": "双11购物节：热销的国货产品和直播营销策略",
    "originLink": "https://www.nbd.com.cn/articles/2023-11-10/3108608.html",
    "originBody": "每经网首页丨 宏观丨 金融丨 公司丨 视频丨 券商丨 IPO丨 基金丨 汽车丨 房产丨 新文化丨 未来商业丨 文创通丨 城市丨 每经商学院 要闻 每经网首页 > 要闻 > 正文 双11特写硬核“国货”上链接！ 每日经济新闻 2023-11-10 21:19:38 ◎硬核国货吸引来了流量，日用国货就将流量变现。纵观各大电商平台今年双11的阶段性战况，国货品牌当仁不让地成为了“出圈”焦点。 每经记者 杨昕怡 每经编辑 刘雪梅 “每天交个硬核朋友。”11月9日晚10点，又一位“硬核朋友”来到了罗永浩淘宝直播间。 这件展而不卖的特殊国货，就是国内首台百万千瓦核电机组重大装备。今年双11，有16件此类“硬核”国货首次走进罗永浩、东方甄选等淘宝直播间，将直播间内的热度推向了高潮。 10月24日，在天猫双11启动日，首位“硬核朋友”亮相。首艘国产大邮轮“爱达·魔都号尊享定制之旅”一经上架，这款定价2000万的“稀有”产品就在7分钟的讲解里为罗永浩直播间增加了超16万观众。 硬核国货吸引来了流量，日用国货就将流量变现。纵观各大电商平台今年双11的阶段性战况，国货品牌当仁不让地成为了“出圈”焦点。 “今年双11的忙碌其实是从9月份开始的。”双11临近，莲花味精的拼多多官方旗舰店运营负责人胡广升每天都在关注仓库的备货、发货情况。大促至今，莲花味精的爆款单品在拼多多上已累计卖出了12万包。 《每日经济新闻》记者从淘宝方面了解到，在10月24日预售首日，国货美妆品牌珀莱雅两小时便突破10亿元的销量大关，花至、且初等国货新品牌也跻身“亿元俱乐部”；京东开启双11后，小米、荣耀、华为、OPPO、一加、vivo等国货品牌手机成交额1秒破亿元；在拼多多平台上，蜂花、郁美净、上海药皂等国货美妆销量增长显著，部分单品销量增长超20倍。 从销量来看，无论是资深品牌还是新生代，抑或是大国重器，国货搭上电商平台的快车已是不容忽视的趋势。那么，站上购物大促的C位后，国货品牌还需如何发力，守住这个位置？ 另辟蹊径，“硬核”国货登陆直播间 第15个双11还能有什么新玩法？淘宝推出了“最硬核的国货购物车”。 10月24日，在天猫开启双11预售的这一天，罗永浩和交个朋友主播王拓在直播间上架了首艘国产大邮轮“爱达·魔都号尊享定制之旅”，该件商品在当晚被一山东买家以18万意向金拍下。 在此之后，全球最大直径竖井掘进机、全球最大吨位桥面吊机、全球首创1.2万米特深井自动化钻机、全球首创干喷湿纺大丝束产品，还有被称为“移动核能充电宝”的全球首个陆上模块化小型核反应堆“玲龙一号”等16件大国重器陆续亮相罗永浩、东方甄选、烈儿宝贝等头部淘宝直播间。 《每日经济新闻》记者从淘宝方面了解到，这些“硬核”国货均来自于国务院国资委新闻中心旗下官方新媒体平台“国资小新”店铺，今年是大国重器和电商平台合作的第三年，也是大国重器走进淘宝店铺和电商直播领域的首年。 “对于整个邮轮行业的发展来说，我们希望借助优质的电商平台，让更多消费者认识、了解邮轮。”爱达邮轮有限公司市场营销总监贾璎在接受《每日经济新闻》记者采访时表示，“我们在这次合作有两个核心目标，一是实现品牌营销的目的，二是推动销售转化，让淘宝的流量基础帮助我们快速建立私域流量。” 不难看出，对于大国重器而言，在直播间“上链接”有效地打通了这些顶端工业品和C端用户之间的渠道。记者了解到，从螺丝帽到工程机械，目前淘宝天猫工业品品类齐全，市场的商品量达到4亿，年在线交易额已突破1200亿元。 另一方面，这一合作也为淘宝带来了更多可以变现的流量，并将其内容化战略推进一步。 去年9月，淘宝直播确定了成交与内容双轮驱动的新发展路径。今年年初，淘宝制定了“直播、私域、内容化、本地零售、价格力”这五大年度战略，其中再次提及“内容化”。 作为上架大国重器的直播间之一，交个朋友控股副总裁、淘宝事业部总经理崔东升向《每日经济新闻》记者表示，通过这次合作，一是想展示淘宝平台的实力，“在淘宝上可以买到一些意想不到的东西”，同时也希望让消费者对交个朋友有记忆标签。 “(此前卖卫星)这样的营销事件，无论从大家的关注度还是品牌度上来说，都是非常成功的。所以我们愿意和品牌方一起合作做这件事，这是一件多方共赢的事。”崔东升坦言。 新老品牌“出圈”，国货站电商平台C位 在本届双11的竞赛中，各品类国货品牌均遥遥领先。 预售开启的1小时内，珀莱雅红宝石面霜3.0卖出超过50万件，逐本卸妆油卖出超过40万件，彩棠销售额同比增长超315%，海尔、海信等国货家电品牌成交额超去年全天——天猫发布的双11预售数据显示，国货在食品、美妆、家电等多个品类迎来了销量爆发。 京东数据显示，在10月23日平台开启双11活动后，小米、荣耀、华为、OPPO、一加、vivo等国货品牌手机成交额1秒破亿元；前10分钟，国货美妆品牌珀莱雅成交额同比增长70倍，国货品牌蜂花、郁美净成交额分别同比增长20倍和10倍；前4小时，国货家电品牌科沃斯成交额同比增长13倍，荣事达、景德镇成交额同比增长超10倍。 与此同时，在拼多多平台上，今年大促开始后，国货美妆、服饰新品成为入驻拼多多百亿补贴数量最多的类目之一。 其中，蜂花、郁美净、上海药皂、孔凤春、百雀羚、珀莱雅等国货美妆销量增长显著，部分热销单品销量增长超过20倍；在国货运动服饰方面，李宁、特步、361°、安踏和匹克位列最受欢迎的TOP 5品牌。 天猫平台上，蜂花销量惊人 图片来源：天猫截图 《每日经济新闻》记者观察到，多家电商平台都上线了国货专区，加大力度推广国货品牌。拼多多百亿补贴相关负责人向记者表示，与去年大促相比，今年百亿补贴的品牌商品池预计同比增长110%，尤其在美妆、洗护、文具、服饰、清洁等国货商品上的增长最为显著。 在提振国货品牌声量上，淘宝“出奇制胜”，让老干妈、六婆、马应龙、鲍师傅、天府可乐等国货品牌在平台上“相亲组CP”。10月31日晚，首批国货CP礼盒套装上架TVB识货淘宝直播间，其中马应龙和小龙坎联合推出的“出入平安”套装在社交媒体上赚足了眼球。 “今年大促看了一堆国货安利帖，加购了很多国货美妆还有运动鞋。”一位消费者向记者表示，她的双11购物车里超60%的商品都是国货，“觉得大促的折扣力度大而且大家都说好用，感觉性价比很高”。 谈及国货在本届双11中的亮眼表现，互联网分析师张书乐在接受《每日经济新闻》记者采访时表示，近年来，国货无论是价格、质量，还是技术迭代方面，都在赢得越来越多的消费者青睐，从而形成了一股“国潮”。 “发力线上，可以让国货的产品迭代在加速状态下，快速完成线上铺货，只要和线下门店呈现一定差异性即可。同时，这种快速迭代能够让品牌更好地赶上当下Z世代的喜好风潮，尤其是一些联名款，可以通过全国同步上架以快速覆盖，进一步实现品牌破圈。”他表示。 封面图片来源：每经记者 叶晓丹 摄 本文经「原本」原创认证，作者每日经济新闻 访问yuanben.io查询 【65UHQGDC】获取授权信息转载授权 如需转载请与《每日经济新闻》报社联系。 未经《每日经济新闻》报社授权，严禁转载或镜像，违者必究。 版权合作及网站合作电话：021-60900099转688 读者热线：4008890008 特别提醒：如果我们使用了您的图片，请作者与本站联系索取稿酬。如您不希望作品出现在本站，可联系我们要求撤下您的作品。 上一篇文章 *ST明诚：实际控制人将变更为湖北省国资委 返回每经网首页 下一篇文章 中钢协：截至10月31日，73家钢铁企业完成了全工序超低排放改造，涉及粗钢产能约3.62亿吨 相关文章 罗永浩双11稳坐直播间 浙商证券给予双环传动买入评级，三季报归母利润同比增长44%，拟回购股份彰显信心 浙商证券给予双环传动买入评级，双环传动点评报告：三季报归母利润同比增长44%，拟回购股份彰显信心 花至、且初等新品牌首次迈入“亿元俱乐部” 国货美妆外，今年双11还有这些新爆发 热文精选 被《自然》撤稿的迪亚斯发声：室温超导论文将另投其他杂志 搭建新技术新产品首发、首秀、首展平台 成都市信息领域新产品发布会将在科创生态岛举行 成都位列2023中国夜经济第一梯队 “美食+电商”点燃“锦官不夜城” 当新电商遇见“成都食力”，如何赋能消费全业态“破圈”融合？ 万亿光伏产业“西南飞” 为何企业纷纷选择在区域加大布局？ 点击排行 1 西安巨响，什么情况？ 2 几乎零增长，洛阳的“风口”在哪里？ 3 “西安巨响”热搜第一！网友：直接吓醒！“这恐怕是我自出生以来头一次碰上这罕见的事了” 4 突发！广东省卫健委主任朱宏主动投案！4天前还公开露面，“老领导”此前已被查 5 孙书南被查！ 6 价高者得！16个城市取消土地限价，将如何影响楼市？ 7 专访贝克休斯检测科技事业部全球副总裁Ben Linke：数字化无损检测可显著提高各行业检测效率与准确性 8 华为战略合作恒生电子 9 广东卫健委主任投案 10 比亚迪方程豹首款车型上市，将与坦克400展开直面竞争 欢迎关注每日经济新闻APP 0 0 相关信息 关于我们 版权声明 联系我们 广告投放 友情链接 关注我们 订阅中心 加入我们 招聘专页 Copyright © 2023 每日经济新闻报社版权所有，未经许可不得转载使用，违者必究。 广告热线 北京: 010-57613265， 上海: 021-61283008， 广州: 020-84201861， 深圳: 0755-83520159， 成都: 028-86511519 028-86512112 互联网新闻信息服务许可证：51120190017 网站备案号：蜀ICP备19004508号-3 川公网安备 51019002002026号 违法和不良信息举报电话： 400 889 0008",
    "originSummary": [
      "文章讨论了在年度“双11”购物节中，中国本土产品日益受到欢迎的情况。",
      "主要亮点包括在直播中展示的独特产品，如中国首艘国内大型邮轮的旅行门票，以及国内品牌的美容产品。"
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699707972758
  },
  {
    "title": "\"双11\"盛典的兴趣减弱：消费行为的改变和电商营销策略的转变",
    "originLink": "https://www.yicai.com/news/101901629.html",
    "originBody": "首页 VIP 新闻 关注 视听 正在 一财号 直播 电视 ESG 图集 专题 数字报 首页 > 新闻 > 科技 分享到： 微信 微博 QQ 分享到微信 打开微信，点击底部的“发现”， 使用“扫一扫”即可将网页分享至朋友圈。 “双11”晚会低调重启 但热搜上的战报哪儿去了？ 第一财经 1小时前 听新闻 作者：陆涵之 责编：李娜 分享到： 随着电商行业新增用户的减少，平台对于流量的关注也在逐渐淡化。 11月10日晚，去年缺席的双11晚会再次举办。其中天猫与湖南卫视合作举办了《天猫双11惊喜夜》，抖音与东方卫视合作举办了《熠熠生辉闪耀之夜》。 去年双11，天猫、京东、拼多多等电商平台都未和电视台合作举办双11晚会。但今年重启后，从收视表现看，昨晚的双11晚会表现中规中矩。收视率显示，天猫双11晚会收视排名第五，而抖音双11晚会排名第十。 讨论度方面，昨晚双11晚会多个相关话题都登上了热搜，不过以明星和表演为主，淡化了双11概念。以往热闹的各种“战报”也在热搜榜上消失。 2021年11月10日，“真唱”、“双11狂欢夜”、“双11”等词语轮番登上微博热搜第一，双11晚会是当天最大的焦点。而此前，双11晚会节目点、邀请嘉宾、彩排等话题也会在11月10日的白天登上热搜。 回顾历史，双11晚会始于2015年，在2020年达到巅峰，随后数量与热度下滑，在2022年消失，2023年低调重启。 2015年，天猫首次与湖南卫视一起举办“2015天猫双11狂欢夜”，互联网平台举办商业晚会由此开始发展。举办晚会带来的高收视率以及高互动率，成为电商举办晚会的原因。以2019年双11为例，苏宁数据显示，2019年苏宁易购双11晚会开播4小时全站流量同比上升267%。 2020年，双11晚会达到热度的巅峰。当年11月10日，四场双11晚会同时进行。天猫联合东方卫视、浙江卫视推出“天猫双11狂欢夜”，拼多多和湖南卫视推出了“双11超拼夜”，京东与江苏卫视推出了双11“直播超级夜”，苏宁易购和北京卫视推出了“双11超级秀”。战火还蔓延至各大视频网站：优酷、芒果TV、爱奇艺和腾讯视频选择各自直播一家的晚会。如果算上10月31日的湖南卫视《天猫双11开幕直播盛典》和浙江卫视的《苏宁易购11.11超级秀》，2020年双11期间4家电商共举办了6场晚会。 而到了2021年，双11晚会数量开始下滑，与2020年相比缩减了一半。去年双11，天猫推出了“2021天猫双11狂欢夜”，拼多多推出了“湖南卫视1111超拼夜”，加上10月30日京东的“京东11.11沸腾之夜”，2021年双11一共有三台晚会。 在2022年双11，没有平台与卫视合作举办的情况下，双11晚会被认为已经消亡。 今年双11晚会再度开启，讨论度却一般。对此，易观分析品牌零售行业高级咨询顾问陈涛对第一财经表示，对于电商平台而言，双11晚会的作用更多在于提高关注度。是否举办晚会与每个平台当年目标以及对当前环境的认知相关，在618或者双11的大促节点，平台认为当年需要更多关注度以及稳定高速增长的成交额，会采取一系列的手段，包括晚会、电视广告等营销举措。部分平台认为晚会仍然是有效的曝光手段会选择继续举办，而部分平台可能调整了目标比如取消需要大投入的晚会，不过仍然保留了能见到效果的营销策略，例如电视广告等投放措施。晚会热度下滑的原因在于晚会通过电视屏幕播放，与电商交易的手机属于两个端口，同时晚会对于平台流量转化和交易转化的作用难以细究。 陈涛认为，从竞争角度看，随着电商行业新增用户的减少，平台对于流量的关注也在逐渐淡化。主流电商平台目前更关注平台内的存量用户以及对中高端用户消费潜力的挖掘。 去年双11没有平台举办晚会，而平台也没有公布双11大促的GMV，高增长时代已经成为过去。 另一方面，随着电商平台调整规则，过去从零点开始的双11大促已经调整为11月10日晚间8点开始，晚会时间与活动时间重合，也会分散消费者的注意力。同时，目前的双11大促预售由于时间线的拉长，已经被分为两轮。双11晚会开始前，天猫、京东等平台已经结束了第一轮大促，不少用户收到了双11的货品。 不仅是双11晚会，双11的热度也在下滑。今年双11被称为史上最难的一届双11，不少消费者已经不再关注这一大促活动。 今年双11，不少消费者都表示自己选择消费降级，尽可能减少消费。上海消费者陈悦(化名)今年没有关注双11，她对第一财经表示是因为自己工作太忙，没有太多时间关注大促。“公司楼下就有超市，日常生活用品都在超市解决。” 曾是直播间忠实粉丝的李婷(化名)对直播的兴趣也在减少。对于今年双11的计划，李婷表示“今年双11就随便看看，囤一些隐形眼镜和生活用品。也会看下直播间的文字预告，有很便宜的刚需还是会考虑买，但不会一直蹲直播间看了。如果自己想买的东西划算就买，不划算就克制一点。” 拒绝双11囤货的消费者不在少数。消费者吴莉(化名)表示，今年双11由于买了手机，整体花费高于去年同期，但是减少了很多囤货，“在购物前会看下囤货，没有用完的就不买，往年会囤的发油和面膜今年都没买。” 第一财经广告合作，请点击这里 此内容为第一财经原创，著作权归第一财经所有。未经第一财经书面授权，不得以任何方式加以使用，包括转载、摘编、复制或建立镜像。第一财经保留追究侵权者法律责任的权利。 如需获得授权请联系第一财经版权部：021-22002972或021-22002335；banquan@yicai.com。 文章作者 陆涵之 关键字 双11晚会消费降级 相关阅读 部分快递网点称双十一日均派件量增50% 第二波高峰即将开启 从过往经验看，双11期间快递高峰将在11日之后的三四天到来。 昨天 20:39 天猫双11正日子来了：看猫晚、抢茅台、领520大额券！ 昨天 13:18 “双11”电商卷起消费金融战，火拼下你的钱该怎么花？ 针对不同的期数，平台给予的优惠不同，部分期数仍包含一定手续费。 11-09 15:54 时尚情报｜三大奢侈品集团齐聚进博，双11理性消费成主流 一周时尚快报 生活美学+ 11-06 11:37 科技周报｜大疆辟谣“被美国罚款440亿元”；苹果销售额连跌四个季度 大疆辟谣“被美国罚款440亿元”，苹果销售额连跌四个季度。 11-05 15:05 一财最热 发表评论 还没有评论，快来抢沙发吧！ 第一财经客户端 第一财经电视 第一财经日报 第一财经杂志YiMagazine Yicai Global 一财全球 第一财经研究院 一财商学院 新一线·知城数据平台 DT实验室 第一财经商业数据中心 东方财经·浦东 有看投+ 应帆科技 第一财经陆家嘴 第一财经公益基金会 第一财经可持续商业研究中心 第一财经 APP 第一财经 日报微博 第一财经 微信服务号 第一财经 微信订阅号 第一财经 抖音官方账号 打开抖音扫一扫 第一财经 微信视频号 广告联系 法律声明 关于我们 上海市市场监督管理局 国家网信办举报中心 上海互联网举报中心 友情链接 沪ICP备14015572号-2互联网新闻信息服务许可证：31120180001互联网视听节目服务(AVSP):沪备2014002沪公安网备31010602000015号 版权所有 上海第一财经传媒有限公司意见反馈邮箱：yonghu@yicai.com 客服热线：400-6060101 违法和不良信息举报电话：400-6060101转6 技术支持 上海第一财经技术中心技术合作：直播合作：百视通 点击关闭",
    "originSummary": [
      "文章探讨了中国电商平台与电视台合作的\"双11\"晚会活动日渐减少的关注度，其中的原因包括活动缺乏新颖性，消费者行为改变，以及电商营销策略的变化。",
      "文章还提到一些消费者选择减少其消费，而不参与\"双11\"的促销活动。",
      "这些现象表明，这些电商平台可能正从高速增长的时期转向重点关注现有高端客户，而非获取新客户的时代。"
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699707972758
  },
  {
    "title": "“双11”15周年销售揭示中国消费者行为变迁：转向国产商品并更理性消费",
    "originLink": "https://www.zsnews.cn/news/index/view/cateid/37/id/716220.html",
    "originBody": "中山网 新闻 推荐 政务 镇街 视频 楼市 汽车 美食 旅游 文教 公益 金融 资讯 健康 数字报 繁 EN 新闻频道 本地 综合 公告 “双11”15年，你买了吗？ 发布时间：2023-11-11 互联网违法和不良信息举报 “没有疯狂‘买买买’，就趁优惠买了几样生活必需品。”“以前买很多欧美品牌，现在觉得国货化妆品也很‘香’。”今年，“双11”大促步入第15个年头，从仅有一天到战线拉长，从直接砍价到复杂减免，从低价盲买到回归理性，从抢购国外大牌到追求国潮……拉长时间线，“双11”的诸多变化折射出消费之变。 消费是支撑宏观经济回升向好的主要拉动力之一。今年前三季度，我国社会消费品零售总额342107亿元，同比增长6.8%；最终消费支出对经济增长贡献率是83.2%，拉动GDP增长4.4个百分点。作为观察消费市场重要窗口，今年“双11”有什么新动向？如何进一步拉动消费？南方+记者走访商家、平台、消费者，多方对话感知电商大促背后的经济脉动。 市场下沉 消费者更理性谨慎 “‘双11’大促开始了！”“大家赶紧加购！”“预售期间优惠更大！”……早在10月，“双11”大促前战已然打响，各路平台“吆喝声”不断——唯品会、拼多多10月20日就开启提前购，23日京东开启“双11”大促，24日天猫预售启动……各大电商平台纷纷下场也进一步炒热气氛。 随着“玩家”进场，今年的“游戏规则”也逐渐清晰。跟“双11”最初设立的目的一样，低价依然是今年各大平台“打法”核心。 比如，淘天集团就喊出“全网最低价”的目标。这也是“双11”创立以来，淘天集团首次强调“全网最低价”，提出今年预计将有超过8000万热销商品降至全年最低价；淘宝方面则设置“同时段、所有电商平台中最低价”商品，以及单品直降15%、无须凑单等规则。 “我们整体活动将持续至11月14日10点，设置了开幕盛典、品类轮动期、高潮期等促销节奏，数百款爆款商品价格将降至30天日常最低价的5折。”唯品会相关负责人介绍。 低价也是拼多多的“杀手锏”之一，其中秒杀频道每天都推出100多场品牌秒杀活动。“在大促主会场，我们推出年度降价榜、品牌折扣、直降百元等活动专区，并在每天的整点时间，额外为消费者发放50元优惠券。”拼多多百亿补贴有关负责人介绍。 除了延续大促节点一如既往的低价优惠传统之外，平台推出大力度的优惠还有一个很重要的考虑——消费者的钱没那么好赚了。 “今年我只买了纸巾、洗衣液、猫粮之类的一些生活必需品和宠物用品，趁着有优惠的价格囤一波。就猫粮来说，平时价格要600元，打折之后到手不到300元，还送了一堆赠品。不过，过去每年在‘双11’都要花数千元，今年账单还是要少一些。”广州市民黄敏之说。 低价、优惠、有赠品——这是不少消费者在“双11”下单的主要原因。但15年岁月流转，无论在繁华都市还是宁静乡村，消费者的行为也在变化。今年“双11”，随着消费者理性回归，年轻消费者不放弃“薅羊毛”，但也不再“狂买买买”。 数据更为直观揭示了这一趋势。普华永道发布的《2023年全球消费者洞察调研》显示，51%的中国消费者正在减少非必需品支出，而对于必需品，人们开始选择更低价的购买途径。 “近几年确实可以发现随着消费者理性的回归，‘双11’等一些大促节点大家没有那么‘疯狂’了，买东西更加考虑实用和刚需。”广东财经大学华南商业智库理事长、广东省商业经济学会会长王先庆表示。 当网购已成为消费日常，平时就能享受到优惠折扣，让消费者也在一定程度上削弱了对“双11”的依赖。但这并不意味着“双11”的“降温”。“不可否认的是，‘双11’依然还是具有很大吸引力的、消费规模巨大的促销活动节点。”王先庆补充道。 从金额来看，虽然“双11”现在已不公布具体成交额，从公开数据看，过去多年也在持续攀升。2009年，全网成交额只有0.52亿元，到2022年已有超万亿规模。QuestMobile数据显示，“双11”首波售卖期间2023年10月31日-11月3日，淘宝APP日活跃用户数连续4天破5亿，打破历史纪录。国际咨询机构埃森哲发布2023双十一报告《为万亿双十一注入新内涵》也表示，坚定看好中国消费市场和“双11”购物节增长潜力。 直播“新风” 头部主播“退烧” 品牌自播崛起 今年“双11”，电商直播战场依旧火热。李佳琦直播间首场直播的GMV达到了95亿元，辛巴首战“双11”单品链接累计支付额破10亿元，“疯狂的小杨哥”在10月24日“#双十一美妆节”主题的三场直播中，总计GMV销售额达8500万-1.5亿元。 看绝对值，数字依旧抢眼。但从时间线看，以李佳琦直播间为例，今年是三年来的最低成绩，2022年“双11”首日成绩约为215亿，2021年则为106亿元左右。 而与之相对应的，不少品牌的自主直播间在大促期间迎来流量上涨。天猫“双11”首日破千万元的店铺直播间中，有37个成交同比增长超100%，如华为天猫官方旗舰店成为首个破亿店播直播间，15分钟即破亿。 对此，网经社电子商务研究中心网络零售部主任、高级分析师莫岱青认为，今年品牌自播时代全面开启，头部主播不再“一家独大”，这有利于直播电商业态和谐发展，缓解中小主播及长尾主播生存空间被压缩的情况。 “头部主播逐渐‘去中心化’，如美腕旗下除李佳琦直播间外，还布局了所有女生直播间和所有女生的衣橱直播间，细分类目的同时也在分散头部主播的资源。此外，抖音、快手、淘宝直播等平台还相继发布系列培训计划，帮助‘中腰部’主播达人崛起。在平台和机构的共同推进下，头部主播的资源正在分散。”网经社电子商务研究中心主任曹磊也表示。 直播间火热的背后，质疑声也不断。“大杨哥怒批李佳琦挟持商家”“李佳琦回应最低价争夺”……与直播相关的话题频繁“上热搜”。对直播电商的监管呼声也越来越高，10月30日，“电商之都”杭州就发布了《直播电商产业合规指引》征求意见稿，提出直播电商从业者不得要求商家签订“最低价协议”等具体条例。 “在合规方面，直播带货的经营者适宜主动向本地具有管辖权的市场监管部门进行咨询，后者也应当为他们做一些培训或指导，从而做好事前的监管督导，预防可能引发违规争议或者消费者投诉的情况。”清华大学国家战略研究院特约研究员刘旭表示。 刘旭还建议，“在消费者不再满足于以低价格或者大批量采购同质化产品时，直播行业也需考虑更多与拥有线下连锁店的品牌合作，通过推广某些到店折扣券或积分券兑换的方式，更灵活地推广品牌商差异化的产品，满足消费者的个性化需求，提升消费体验。这样也许更有利于线下线上融合发展。” 对于直播电商的发展，王先庆也抱有积极态度。“未来直播的主角和场景可能都会迭代升级，更专业的技术人员、研发设计人员会成为主播，直播场景也不再是虚拟的直播间，而是会在车间、田间，让消费者从最前端了解产品的设计生产。” 国货崛起 Z世代成消费主力 国产品牌正在占领“双11”年轻人的购物车。 “一上架就被抢空了！到底是谁在和我抢？”10月24日晚上，李佳琦直播间多个珀莱雅产品一上架就被秒抢空，不少“珀莱雅女孩”惊呼“比抢火车票还难”。 与之相佐证的是珀莱雅与11月5日发布的公告。2023年“双11”阶段，公司主品牌珀莱雅荣登天猫、抖音等多平台美妆类目成交金额第一。经初步核算，天猫旗舰店GMV为18亿元左右，同比增长40%左右；抖音平台GMV为4.7亿元左右，同比增长200%左右。 不再迷信国际大牌，不轻易被营销洗脑，不再跟风随大流——随着Z世代逐渐成为消费主力，国货越来越在年轻消费者中风靡。《抖音电商双11预售期品牌直播热销榜》数据显示，10月20日-30日期间，GMV过亿的直播间中就有不少国货品牌，如珀莱雅、五粮液、华为等。尤其是国货直播间走红后，不少品牌直播间观看量与销售额均有明显增长。 平台也发现了年轻人的消费力。唯品会相关负责人介绍，智能家电、健康保健、家居用品等品类受到年轻消费者青睐，国货品牌、年轻消费者成为本次大促的亮点，众多知名国货品牌销量倍增。同时，“95后”的年轻人成为大促消费的主力军，消费市场也因此呈现出一片火热的景象。从品类上看，洗地机销售额同比增长近10倍，电动牙刷、智能手表销售额同比增长30%以上。 拼多多百亿补贴相关负责人也表示，与去年大促相比，今年百亿补贴的品牌商品池预计同比增长110%，尤其是美妆、洗护、文具、服饰、清洁等国货商品的增长最为显著。 年轻人消费理念的变化，也让国货迎来“泼天的富贵”。 “以Colorkey珂拉琪为例，品牌今年‘双11’预售第一天已经占据了国货彩妆前20的排名。在唇釉类目，各平台榜单都保持领先位置。”美尚(广州)化妆品股份有限公司，创始人、董事长兼CEO李琴娅介绍。 美尚旗下拥有国潮彩妆先锋品牌Colorkey珂拉琪、为东方女性专研的御龄养肤品牌Leen Long玲珑等。“国货崛起，缘起愈加提升的民族自信。每次超级大促，都为品牌提供了展示的机会。我们也应该不断提升品质，打造好口碑，才会获得消费者的认可。”李琴娅表示。 “可以看到，今年更多传统的国产品牌也在积极地杀入‘双11’促销和直播营销的赛道。这也和地方政府对老字号老品牌的引导和支持有关。”刘旭表示。 王先庆则认为，国货走俏和Z世代逐渐成为消费主力息息相关。“他们对于国外品牌没有过多崇拜和迷恋，另外中国制造的产品用质量实力说话，也更贴合他们的消费习惯，相信未来这种趋势会越来越明显。” 狂热退去，理性回归。作为支撑宏观经济回升向好的主要拉动力之一，今年前三季度我国消费支出对于经济增长的贡献在七成以上。“要让‘双11’继续火热，除了电商‘玩家’要继续努力之外，更要加强有效供给、扩大需求，在迎合消费者喜好的同时，打出优化投资、促进就业、稳定增收的政策组合拳，让消费者‘手里有钱’、放心消费。”王先庆说。 责任编辑：周亚平 相关报道 热点专题 专题穿越深中通道 “活力中山 乡村振兴新图景”摄影大赛 “树美好家风 传优良家训”主题征文 专题丨网络中国节·重阳 专题丨防御台风“小犬” 版权与免责声明： ① 凡本网注明“来源”为“中山日报”、“中山商报”、“中山网”的所有文字、图片和视频，版权均属中山网所有，任何媒体、网站或个人未经本网协议授权不得转载、链接、转贴或以其他方式复制发表。已经被本网协议授权的媒体、网站，在下载使用时必须注明“来源：中山网”，违者本网将依法追究责任。 ② 本网未注明“来源”为“中山日报”、“中山商报”、“中山网”的文/图等稿件均为转载稿，本网转载出于传递更多信息之目的，并不意味着赞同其观点或证实其内容的真实性。如其他媒体、网站或个人从本网下载使用，必须保留本网注明的“来源”，并自负版权等法律责任。如擅自篡改为“来源：中山网”，本网将依法追究责任。如对文章内容有疑议，请及时与我们联系。 ③ 如本网转载涉及版权等问题，请作者在两周内速来电或来函与中山网联系。 联系人：陈小姐(电话：0760-88238276)。 关于我们 - 版权声明 - 用户协议 新闻信息服务许可信息网络传播视听节目许可证号1908249广播电视节目制作经营许可证(粤)字第01845号 粤ICP备13033288号粤公网安备44200002005034号增值电信业务经营许可证：粤B2-20160575、B1-20203854 广告专线：(0760)88881052 88238276　采编热线：(0760)88881029　技术热线：(0760)88881015 联系邮箱：zsweditor@qq.com 违法和不良信息举报电话：88881029、88238276 广东中山网传媒信息科技有限公司版权所有 © 2005-2018",
    "originSummary": [
      "中国第15届\"双11\"销售中显示出消费者行为的转变，人们从外国品牌转向国内生产的商品，并对购买行为更理性。",
      "数据显示，今年前三个季度，中国消费品零售总额达到34.21万亿元，比去年增长6.8%。消费支出也占到中国GDP增长的83.2%。",
      "以Z世代为首的年轻消费者对国内产品的偏好正在增加。"
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699707972758
  },
  {
    "title": "2023年11月11日，AMD官方旗舰店将在多个平台进行大促销活动",
    "originLink": "https://beareyes.com.cn/2/lib/202311/11/20231111001.htm",
    "originBody": "Hi, 欢迎访问小熊在线！ 论坛|投稿爆料| 官方微博 互联网 手机 硬件 DIY三大件 无人机 智能穿戴 运动摄像 游戏 其他 出行 智家电 智能家居 黑电 白电 小家电 IT数码 传统IT科技 数码 VR/AR 大数据与云计算 机器人技术 有声新闻 当前位置： 首页 - 硬件 11.11超值购机！AMD官方旗舰店大促迎来最高潮 小熊在线 新闻稿2023年11月11日 11.11超值购机！AMD官方旗舰店大促迎来最高潮 ...... 【小熊在线讯】双十一年终大促的高潮即将来临，对于准备选购电脑硬件的用户们一定要抓住这个最优惠的时机，AMD(超威)在各大电商平台的官方旗舰店已经做好了万全准备，迎接朋友们的光顾，无论大家想要购买AMD锐龙处理器、板U套装、显卡、整机还是其它DIY配件，在AMD官方旗舰店都应有尽有，超低的价格，实实在在的会员福利，想要收获这些就赶快前往AMD京东自营旗舰店、AMD抖音旗舰店、AMD天猫官方旗舰店和AMD拼多多旗舰店买起来吧！ AMD京东自营旗舰店 AMD京东自营旗舰店11.11活动链接PC端： https://pro.jd.com/mall/active/2WEJdLjKNHBQLwFskwjqCqrv6xyM/index.html AMD京东自营旗舰店11.11活动链接APP端： https://pro.m.jd.com/mall/active/2WEJdLjKNHBQLwFskwjqCqrv6xyM/index.html AMD京东自营旗舰店可以说是11.11大促AMD的主战场，成为AMD会员之后就可以享受到各种限时会员福利，0元抽AMD遥控车模，关注加购商品还能赢京豆，下单抽AMD周边壕礼，AMD羽绒马甲暖冬来袭；参与评价晒单赢京东E卡，抽百元大奖。会员积分还能抽取潮玩配件，会员根据购买量冲榜还有机会赢取千元E卡，还可以参加最新的“会员晒3A主机”主题活动。 想要购买AMD锐龙处理器爆款单品的朋友可以优先选择前往AMD京东自营旗舰店，旗下锐龙7000/5000系列处理器和它们的超值板U套装都有不同程度的特惠。当然活动页面还有显卡、整机和其它DIY配件，一站购齐没问题。 AMD天猫官方旗舰店. AMD天猫官方旗舰店活动链接PC端： http://amd.tmall.com/p/rd760235.htm AMD天猫官方旗舰店活动链接APP端： https://shop.m.taobao.com/shop/sr.htm?p=4zaBpw_onI7k_8_ratm0 在AMD天猫官方旗舰店上，主打的是各种整机产品，也有一些爆款AMD板U套装和AMD Radeon RX 7000/6000系列显卡。朋友们可以选择充值购物金，充6500得6600，充10000得10200，充15000得15300，购买付款更优惠。天猫双十一的88VIP消费券也是支持同时使用的，大家可以兑换后合并付款获得最大程度的优惠。 AMD抖音旗舰店 抖音扫码直达： AMD抖音官方旗舰店大促期间每天都在进行直播，下单前多多咨询主播能抓住更多优惠，目前备受关注的大额品类券随时补货，朋友们可以加入AMD抖音官方旗舰店粉丝群获取即时动态。AMD整机直播间下单前100名下单送价值199 炫彩风扇套包。直播间下单AMD显卡，晒单送价值169品牌机械键盘一个。加入AMD店铺会员，会员抽签1元购RX 6750 GRE显卡，目前已经有将近5000名小伙伴参与了，结果即将揭晓，请大家关注最终结果。 AMD拼多多旗舰店 扫码直达： 最后来看一下AMD在拼多多官方旗舰店的活动，大促高潮期间，前111名下单并付款的用户可享豪礼，指定机型前30名下单付款还有机会赢取罗技耳机和技嘉背包。在收到货之后，前1-2名确认收货可免666元；前3-66名确认收货可免66元+罗技无线鼠标和大桌垫；前67-111名确认收货可免66元。这些活动重点是要求大家下单迅速，所以朋友们提前去店铺里把想要购买的产品加购好，大促开启之时直接付款就能赢取好礼了，晒单活动就要看物流情况了。 以上就是AMD在各大电商平台旗舰店的双十一高潮期的重磅活动了，如果朋友们想要购买硬件产品就要抓住这个特惠时期，毕竟这种级别的大促优惠错过的话下次就要很久了。大家根据自己的购物习惯赶快前往AMD京东自营旗舰店、AMD抖音旗舰店、AMD天猫官方旗舰店和AMD拼多多旗舰店吧！ 标签：AMD 大家都在看 国内首个！海尔车用空调牵头制定IEC国际标准 天玑9300 GPU性能、能效双双大幅提升，这才是玩游戏最强芯！ 提速3D数字内容创作,积木易搭推出消费级市场首款精度为0.01mm,重量仅200g的便携式3D扫描仪Seal 用户名： 　密码： 　没有注册？ 评论 网友评论：(请各位网友遵纪守法并注意语言文明，评论仅供参考不代表本站立场) 重磅推荐 AMD会员日11.11高潮来袭 京东自营旗舰店爆款钜惠 选空调看重啥？海尔空调：听用过的人怎么说 撒贝宁新家的海信激光电视惊艳全网，网友边买边提问 一文全解答 行业最多！海尔冰箱3个工厂入选国家级“绿色工厂” 华硕主板11.11巅峰28小时优惠抢先看 更温暖更节能！海尔空调在长白山开启极寒挑战 选高端就要物超所值！卡萨帝冰箱用3个点诠释 联发科天玑9300 AI性能大爆发，1秒内极速生成高质量图片 合作媒体: sinaTech 新浪硬件 新浪数码 搜狐IT 网易科技 21CN 中华网科技 腾讯科技 凤凰网 新华网 友情链接: 咔么电影工业网 驱动之家 DOIT 北青网 电脑报 TOMPDA智能手机 中国知识产权 chinaunix 动网论坛 新民网 非凡软件站 和讯IT 72变 华北新闻网 猫扑数码 樱桃社区 360OS社区 智能公会 更多>> 关于我们联系方式版权声明招聘信息广告刊例广告报价投稿咨询 1999-2017 All Rights Reserved 小熊在线版权所有 京ICP备05064776号京公网安备110108002017号",
    "originSummary": [
      "本新闻文章讨论了2023年11月11日在各大在线平台即将开始的AMD产品销售促销活动。包括JD.com、抖音、阿里巴巴的天猫和拼多多在内的AMD官方旗舰店都会有不同的促销和奖励活动。",
      "各商店会有针对处理器、图形卡和DIY电脑组件等产品的折扣。文章鼓励消费者抓住这个促销购物日以获取丰富的交易和节省开销。",
      "AMD是高级微设备的简称，该公司主要生产微型处理器和其他半导体设备。JD.com、抖音、天猫和拼多多等是中国最大的网购平台，促销活动通常在双十一(11月11日)这样的特殊日期进行。"
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699707972758
  },
  {
    "title": "2023年'雙11'網購節增長9.5%，低價策略吸引顧客，國產品牌蓬勃發展",
    "originLink": "https://www.singtaousa.com/2023-11-11/%E4%BB%8A%E5%B9%B4%E3%80%8C%E9%9B%9911%E3%80%8D%E5%B9%B3%E5%8F%B0%E6%8B%BC%E4%BD%8E%E5%83%B9-%E5%9C%8B%E7%94%A2%E5%93%81%E7%89%8C%E5%B4%9B%E8%B5%B7-%E6%B6%88%E8%B2%BB%E8%B6%A8%E7%90%86%E6%80%A7/4663894",
    "originBody": "⾸⾴ 即時兩岸 今年「雙11」平台拼低價 國產品牌崛起 消費趨理性 2023-11-11 01:33:00 如火如荼的「雙11購物節」進入尾聲，中新經緯研究院、中國國際電子商務中心研究院、浪潮卓數研究團隊10日發表聯合撰寫的《2023「雙11」消費洞察報告》，今年「搶先購」階段各平台網絡零售總額5155.6億元，同比增長9.5%，整體成績表現不俗。民眾消費趨個性化、高品質、體驗化，興趣項目成消費新寵。 天貓是網購平台交易額TOP 1。 京東2023「雙11」主題是「真便宜，閉眼買」。 「雙11」是一個交易額達數千億的日子。 新華社資料圖 主要平台交易額佔比分布圖。 「雙11」也是快遞高峰期，順豐華南航空樞紐(廣州)自動化分揀快遞包裹。 中新社 報告監測2023年10月31日至11月3日的數據，即各平台銷售最火熱的「搶先購」階段。監測期間，各平台網絡零售總額5155.6億元，同比增長9.5%，整體成績表現不俗。 交易額TOP3：天貓 京東 抖音 今年各平台核心戰略是以低價搶客，京東「雙11」主題是「真便宜，閉眼買」；天貓淘寶決心以「全網最低價」為目標；抖音號稱單品價格直降15%起；快手宣傳「會集中釋放全年最大優惠力度」；拼多多則直接宣布在大促銷與百億補貼基礎上額外發放官方補貼⋯⋯ 平台交易額佔比TOP7依次為天貓(35.4%)、京東(21.6%)、抖音(9.6%)、淘寶(8.6%)、拼多多(6.7%)、蘇寧易購(0.5%)，其他平台瓜分餘下17.5%。天貓和淘寶組成的淘天集團以合計44%的銷售額領先其他平台。 對此，中國國際電子商務中心研究院院長李鳴濤指出，天貓最早發起「雙11」大促銷，不出意外排名第一。而抖音登上第3，表明抖音的興趣電商、短視頻「種草」和直播帶貨的電商模式得到越來越多商家和消費者的認可，背後也反映出直播帶貨在整體網絡購物市場的滲透率會越來越高。 智能化、興趣化成消費新寵 報告通過監測淘寶、天貓、京東、拼多多、蘇寧易購、網易嚴選、抖音等17個平台，涉及服裝鞋帽針紡織品、日用品、家用電器和音像器材、糧油食品、文化辦公用品等18個維度數據後發現，今年「雙11」高品質、體驗化、智能化、興趣化成消費新寵。從攀巖、溯溪、露營等野外遊玩項目，到衝浪、潛水、海釣等海上運動項目，追求個性化、體驗感的年輕人讓這些以「興趣」為主導的各式新型消費不斷興起。 同時，智能化也是消費的重要訴求。開放式耳機、軌道插座、4K投影銷售額增速均超20%；智能床墊、電動升降桌銷售額同比均超50%。 隨著大眾健康管理意識不斷強化和「顏值經濟」的興起，健康管理、美容美體也成為消費者高意願消費品類。報告顯示，「診療家庭化」的發展勢頭旺盛，制氧機、血氧儀、助聽器、電動輪椅用品更受關注，銷售額同比均超30%；抗衰群體呈現年輕化趨勢，需求井噴之下，家用美容儀進入年輕消費者視線，光譜儀、吸黑頭儀、導入導出儀、生髮儀銷售額同比均超100%，光譜儀成為本次「雙11」熱賣爆品。 粵「大戶」佔網購零售額1/4 從各省份網絡零售額佔比及增長情況看，廣東省、上海市、浙江省銷售額排名前三，佔比分別達到23.9%、15.9%、13.8%；青海省、甘肅省、河北省銷售額同比增速排名前三，分別為133.3%、106.7%、91.2%。 報告分析近年消費行業榜單，可以看到服裝鞋帽針紡織品、家用電器和影音器材、日用品、化妝品等近年一直大熱，2023年的特色是多了糧油食品登上TOP 5，顯示消費逐漸回歸理性。 此外，報告發現今年「雙11」國貨品牌加速崛起，TOP20品牌當中，國產品牌佔據了11席，海爾(家電)、珀萊雅(美妝)、可復美(醫美)表現亮眼，同比增長均超過100%。 —",
    "originSummary": [
      "2023年的\"双11\"购物节取得了令人印象深刻的成绩，各平台的在线零售销售总量增长了9.5%，总销售额达到5155.6亿元人民币。",
      "交易量最大的三个平台是天猫，京东和抖音，他们的关键策略是以低价格吸引客户。",
      "消费者的购物习惯正变得更加个性化，注重高质量和体验性商品。同时，中国国内品牌的崛起也非常显著，前20大品牌中有11个是国内品牌。"
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699707972758
  },
  {
    "title": "\"雙11\"購物節：國產品牌崛起，消費者喜好個性化、高品質和體驗性購物，線上銷售再創新高",
    "originLink": "https://www.singtao.ca/6445587/2023-11-11/news-%E4%BB%8A%E5%B9%B4%E3%80%8C%E9%9B%9911%E3%80%8D%E5%B9%B3%E5%8F%B0%E6%8B%BC%E4%BD%8E%E5%83%B9+%E5%9C%8B%E7%94%A2%E5%93%81%E7%89%8C%E5%B4%9B%E8%B5%B7+%E6%B6%88%E8%B2%BB%E8%B6%A8%E7%90%86%E6%80%A7/",
    "originBody": "其他文章 點擊查看新聞列表 今年「雙11」平台拼低價 國產品牌崛起 消費趨理性 2023年11月11日 03:33 舉報 如火如荼的「雙11購物節」進入尾聲，中新經緯研究院、中國國際電子商務中心研究院、浪潮卓數研究團隊10日發表聯合撰寫的《2023「雙11」消費洞察報告》，今年「搶先購」階段各平台網絡零售總額5155.6億元，同比增長9.5%，整體成績表現不俗。民眾消費趨個性化、高品質、體驗化，興趣項目成消費新寵。 天貓是網購平台交易額TOP 1。 京東2023「雙11」主題是「真便宜，閉眼買」。 「雙11」是一個交易額達數千億的日子。 新華社資料圖 主要平台交易額佔比分布圖。 「雙11」也是快遞高峰期，順豐華南航空樞紐(廣州)自動化分揀快遞包裹。 中新社 報告監測2023年10月31日至11月3日的數據，即各平台銷售最火熱的「搶先購」階段。監測期間，各平台網絡零售總額5155.6億元，同比增長9.5%，整體成績表現不俗。 交易額TOP3：天貓 京東 抖音 今年各平台核心戰略是以低價搶客，京東「雙11」主題是「真便宜，閉眼買」；天貓淘寶決心以「全網最低價」為目標；抖音號稱單品價格直降15%起；快手宣傳「會集中釋放全年最大優惠力度」；拼多多則直接宣布在大促銷與百億補貼基礎上額外發放官方補貼⋯⋯ 平台交易額佔比TOP7依次為天貓(35.4%)、京東(21.6%)、抖音(9.6%)、淘寶(8.6%)、拼多多(6.7%)、蘇寧易購(0.5%)，其他平台瓜分餘下17.5%。天貓和淘寶組成的淘天集團以合計44%的銷售額領先其他平台。 對此，中國國際電子商務中心研究院院長李鳴濤指出，天貓最早發起「雙11」大促銷，不出意外排名第一。而抖音登上第3，表明抖音的興趣電商、短視頻「種草」和直播帶貨的電商模式得到越來越多商家和消費者的認可，背後也反映出直播帶貨在整體網絡購物市場的滲透率會越來越高。 智能化、興趣化成消費新寵 報告通過監測淘寶、天貓、京東、拼多多、蘇寧易購、網易嚴選、抖音等17個平台，涉及服裝鞋帽針紡織品、日用品、家用電器和音像器材、糧油食品、文化辦公用品等18個維度數據後發現，今年「雙11」高品質、體驗化、智能化、興趣化成消費新寵。從攀巖、溯溪、露營等野外遊玩項目，到衝浪、潛水、海釣等海上運動項目，追求個性化、體驗感的年輕人讓這些以「興趣」為主導的各式新型消費不斷興起。 同時，智能化也是消費的重要訴求。開放式耳機、軌道插座、4K投影銷售額增速均超20%；智能床墊、電動升降桌銷售額同比均超50%。 隨著大眾健康管理意識不斷強化和「顏值經濟」的興起，健康管理、美容美體也成為消費者高意願消費品類。報告顯示，「診療家庭化」的發展勢頭旺盛，制氧機、血氧儀、助聽器、電動輪椅用品更受關注，銷售額同比均超30%；抗衰群體呈現年輕化趨勢，需求井噴之下，家用美容儀進入年輕消費者視線，光譜儀、吸黑頭儀、導入導出儀、生髮儀銷售額同比均超100%，光譜儀成為本次「雙11」熱賣爆品。 粵「大戶」佔網購零售額1/4 從各省份網絡零售額佔比及增長情況看，廣東省、上海市、浙江省銷售額排名前三，佔比分別達到23.9%、15.9%、13.8%；青海省、甘肅省、河北省銷售額同比增速排名前三，分別為133.3%、106.7%、91.2%。 報告分析近年消費行業榜單，可以看到服裝鞋帽針紡織品、家用電器和影音器材、日用品、化妝品等近年一直大熱，2023年的特色是多了糧油食品登上TOP 5，顯示消費逐漸回歸理性。 此外，報告發現今年「雙11」國貨品牌加速崛起，TOP20品牌當中，國產品牌佔據了11席，海爾(家電)、珀萊雅(美妝)、可復美(醫美)表現亮眼，同比增長均超過100%。 — 訂閱星島網singtao.ca電郵快訊，每天可收到最快新聞資訊： https://www.singtao.ca/subscribe/singtao.php >>>訂閱CCUE YouTube 頻道，查看更多吃喝玩樂、生活資訊影片。 【看星島＊知天下】請立即下載「星島新聞(加拿大版)」App： iPhone：https://apple.co/2IBi812 Android：https://bit.ly/2Pe8anu 評論： 延伸閱讀 延伸閱讀 相關文章 慰安婦受害人李美金病逝享年98歲 紀錄片《二十二》中最後一位倖存者 雙11｜男性消費終於超越狗！ 「山系風」公路單車、衝鋒衣熱賣 重慶政協主席唐方裕隨習視察 料任中央要職 廣東省衛健委主任朱宏主動投案 目前正接受調查",
    "originSummary": [
      "2023年\"双11\"购物节全网销售额达到5155.6亿人民币，同比增长9.5%。主要平台包括天猫(占比35.4%)、京东(占比21.6%)以及抖音(占比9.6%)。",
      "消费者趋向于个性化、高质量和体验型商品的购买。报告还突出了国内品牌的崛起，前20大品牌中有11个是中国品牌。",
      "年增长超过100%的品牌有海尔和百雀羚，表现良好。"
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699707972758
  },
  {
    "title": "先鋒領航裁撤與螞蟻集團合資公司的團隊，騰訊獨家銷售Meta的新VR設備",
    "originLink": "https://cn.wsj.com/articles/%E4%B8%AD%E6%A6%82%E8%82%A1%E7%B0%A1%E5%A0%B1-%E5%85%88%E9%8B%92%E9%A0%98%E8%88%AA%E9%80%80%E8%82%A1%E8%88%87%E8%9E%9E%E8%9F%BB%E9%9B%86%E5%9C%98%E5%90%88%E8%B3%87%E5%85%AC%E5%8F%B8-abaed356",
    "originBody": "金融市場 中概股簡報：先鋒領航退股與螞蟻集團合資公司 PICO裁撤遊戲工作室團隊，日活前三VR音游全員被裁；景林資產最新美股持倉曝光：不斷加碼拼多多，看好消費、AI。 2023年11月11日10:20 CST 更新 據報騰訊成Meta新VR頭戴裝置中國獨家銷售商 Meta於... 成为《华尔街日报》会员， 畅读全文 马上注册 已经是会员? 登录 熱門視頻 现场视频：以色列地面部队在加沙北部与哈马斯交战 AI操控的“女武神”无人机可能成为美军下一利器 从领导人秀英语看中国人英语水平的提高 [中文] 揭秘拉斯维加斯巨球“炸裂视觉效果”背后的技术 WeWork如何从估值470亿美元走到破产边缘",
    "originSummary": [
      "先驱导航已经裁减了其游戏工作室团队和与蚂蚁集团旗下的领先VR音乐游戏公司PICO的联合企业中的所有活跃成员。",
      "与此同时，鲸鳞资产增加了其在美股的持有量，包括中国公司拼多多，展望聚焦消费者和AI领域。",
      "腾讯 reportedly 已成为Meta新VR头盔设备在中国的独家销售商。"
    ],
    "commentBody": "",
    "commentSummary": [
      "照片中重要的元素：广告，小贩摊位供应商，多层停车场。这意味着城市化和现代消费主义的存在。",
      "老年供应商的出现表明社会内存在的潜在收入差距。",
      "从这些因素中，我们可以洞察到社会的一些经济和社会问题。"
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699707972758
  }
]
