[
  {
    "id": 41891694,
    "title": "Şeffaflık batıyor",
    "originLink": "https://aworkinglibrary.com/writing/accountability-sinks",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41891694",
    "commentBody": "",
    "originSummary": [
      "Dan Davies, kararların sonuçlarını gizleyerek kimseyi sorumlu tutmayı zorlaştıran \"hesap verebilirlik bataklıkları\" kavramını tanıtıyor. Bu hesap verebilirlik bataklıkları, kararların kökenlerinin belirsizleştiği ve geri bildirim döngülerinin koptuğu konaklama, sağlık sigortası, havayolu ve devlet kurumları gibi sektörlerde yaygındır. Yapay zekanın kullanımı, sorumluluğu daha da gizleyerek hesap verebilirlik bataklıklarını kötüleştirebilir ve bu da organizasyonların kararlarından sorumlu kalmalarını sağlamak için yeni stratejilere duyulan ihtiyacı vurgular."
    ],
    "commentSummary": [
      "Kuruluşlar, hükümetler de dahil olmak üzere, genellikle kararlar için sorumluluğu gizleyen ve hesap verebilirliği karmaşıklaştıran \"hesap verebilirlik bataklıkları\" oluşturur.- Otomatik sistemler insan etkileşimini en aza indirir, bu da sinir bozucu müşteri deneyimlerine ve doğrudan hesap verebilirliğin eksikliğine yol açar.- Modern sistemlerin karmaşıklığı, kararların toplu olarak veya otomasyon yoluyla alınmasına neden olur, bu da bireyleri sorunları ele almak için net bir başvuru yolu olmadan bırakır."
    ],
    "points": 441,
    "commentCount": 254,
    "retryCount": 0,
    "time": 1729381183
  },
  {
    "id": 41890784,
    "title": "QUIC, hızlı internet üzerinde yeterince hızlı değil",
    "originLink": "https://arxiv.org/abs/2310.09423",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41890784",
    "commentBody": "",
    "originSummary": [
      "Çalışma \"QUIC, Hızlı İnternet Üzerinde Yeterince Hızlı Değil\", QUIC'in veri hızının yüksek hızlı ağlarda geleneksel TCP+TLS+HTTP/2'ye göre %45,2'ye kadar daha düşük olabileceğini ortaya koyuyor.- QUIC ile TCP+TLS+HTTP/2 arasındaki performans farkı, daha yüksek bant genişliği ile artarak dosya transferlerini, video akışını ve web taramasını etkiliyor.- Makale, QUIC'teki aşırı veri paketleri ve kullanıcı alanı onayları (ACK'ler) nedeniyle yüksek alıcı tarafı işlem yükünü temel neden olarak belirliyor ve iyileştirme önerileri sunuyor."
    ],
    "commentSummary": [
      "İnternet hızını artırmayı amaçlayan bir protokol olan QUIC, hızlı bağlantılarda zorluklarla karşılaşıyor; bazı uygulamalar, geleneksel TCP'ye (İletim Kontrol Protokolü) göre daha düşük veri hızları gösteriyor.",
      "Performans sorunları, protokolün kendisindeki kusurlardan ziyade, özellikle tarayıcılarda CPU'ya bağımlı olan mevcut QUIC uygulamalarına atfedilmektedir.",
      "QUIC'in düşük gecikme süresi ve iyileştirilmiş paket kaybı yönetimi gibi avantajlar sunmasına rağmen, yüksek hızlı bağlantılardaki performansı mevcut donanım ve yazılım optimizasyonları tarafından sınırlanmaktadır, bu da internet protokollerinin evrimleşmesindeki karmaşıklıkları göstermektedir."
    ],
    "points": 285,
    "commentCount": 248,
    "retryCount": 0,
    "time": 1729371892
  },
  {
    "id": 41895718,
    "title": "Syncthing Android Uygulaması Durduruldu",
    "originLink": "https://forum.syncthing.net/t/discontinuing-syncthing-android/23002",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41895718",
    "commentBody": "",
    "originSummary": [
      "Syncthing Android uygulaması emekliye ayrılacak ve son sürümü Aralık 2024'te Github ve F-Droid'de yayınlanacak.",
      "Uygulamanın emekliye ayrılma kararı, Google Play yayınlama ile ilgili zorluklar ve aktif bakım eksikliğinden kaynaklanmaktadır.",
      "Uygulama son zamanlarda önemli bir gelişme göstermedi, bu da bakımını sürdürmek için yetersiz motivasyona yol açtı."
    ],
    "commentSummary": [
      "Syncthing Android uygulaması, Google'ın gereksinimlerinin getirdiği belirsiz talepler ve ek işler nedeniyle Google Play Store'dan kaldırılmıştır.",
      "Geliştiricinin motivasyon kaybı, Google'ın Android üzerindeki artan kontrolü, uygulama işlevselliğini ve kullanıcı tercihlerini etkilemesi konusundaki endişeleri vurguluyor.",
      "Kullanıcılar, alternatif bir uygulama dağıtım platformu olan F-Droid'de uygulamanın bir çatalına hala erişebilirler."
    ],
    "points": 202,
    "commentCount": 106,
    "retryCount": 0,
    "time": 1729435865
  },
  {
    "id": 41895764,
    "title": "İnternet Arşivi, çalınan erişim belirteçleri aracılığıyla yeniden ihlal edildi",
    "originLink": "https://www.bleepingcomputer.com/news/security/internet-archive-breached-again-through-stolen-access-tokens/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41895764",
    "commentBody": "",
    "originSummary": [
      "İnternet Arşivi, Zendesk e-posta destek platformlarındaki çalınan erişim belirteçleri nedeniyle bir güvenlik ihlali yaşadı ve bu durum 800.000'den fazla destek biletini etkiledi.",
      "İhlal, daha önceki uyarılara rağmen Internet Archive'ın ifşa edilen GitLab kimlik doğrulama belirteçlerini döndürmemesi nedeniyle meydana geldi.",
      "Bu saldırı, siber sokak itibarını kazanma arzusuyla motive edildi ve kişisel kimlikler de dahil olmak üzere çalınan verilerin, veri ihlali topluluklarında muhtemelen ticareti yapılıyor."
    ],
    "commentSummary": [
      "İnternet Arşivi, çalınan erişim belirteçleri nedeniyle bir başka güvenlik ihlali yaşadı ve bu durum, tek hata noktalarından kaçınmak için merkezi olmayan depolamanın gerekliliği üzerine tartışmaları başlattı.",
      "Alternatif öneriler arasında, bir mutabakat protokolü kullanan LOCKSS (Lots of Copies Keep Stuff Safe) gibi sistemler yer alırken, IPFS (InterPlanetary File System) verimsizlik nedeniyle eleştirilere maruz kalıyor.",
      "İhlal, Arşiv'in güvenlik açıklarını vurguluyor ve daha iyi yönetim, finansman stratejileri ile telif hakkı ve güvenlik uygulamaları üzerine tartışmalar için çağrılar yapılıyor."
    ],
    "points": 199,
    "commentCount": 77,
    "retryCount": 0,
    "time": 1729436406
  },
  {
    "id": 41889876,
    "title": "Ribbonfarm Emekliye Ayrılıyor",
    "originLink": "https://www.ribbonfarm.com/2024/10/10/ribbonfarm-is-retiring/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41889876",
    "commentBody": "",
    "originSummary": [
      "Venkatesh Rao'nun blogu Ribbonfarm, 13 Kasım 2024'te 17 yıllık yayın hayatını sonlandırarak emekliye ayrılacak, ancak site yeni içerik olmadan erişilebilir kalacak.",
      "Rao, blog yazarlığının evrimi üzerine düşünerek, Substack gibi platformlara kaymaları ve dijital içerik tüketiminde değişiklikleri gösteren 'cozyweb' döneminin ortaya çıkışını not ediyor.",
      "Diğer medyalara geçiş yapmayı, teknoloji trendlerine ve seri projelere odaklanmayı planlıyor, bu sırada okuyuculara minnettarlığını ifade ediyor ve gelecekteki girişimleri değerlendiriyor."
    ],
    "commentSummary": [
      "Venkatesh Rao'nun blogu Ribbonfarm, 17 yılın ardından kapanıyor ve Web 2.0 döneminde gelişen blogosfer çağının sona erdiği algısını işaret ediyor.",
      "Blogların düşüşü, artan faiz oranları ve ücretli dağıtım modellerine geçişle bağlantılıdır ve bu durum daha geniş bir kültürel değişimi yansıtmaktadır.",
      "Rao, halka açık bloglar ve sosyal medyaya alternatif olarak ortaya çıkan samimi çevrimiçi alanları tanımlamak için 'cozyweb' terimini tanıttı ve blogun arşivlerinden kitap uzunluğunda ciltler derlemeyi planlıyor."
    ],
    "points": 169,
    "commentCount": 118,
    "retryCount": 0,
    "time": 1729364794
  },
  {
    "id": 41891953,
    "title": "Bilgisayarda 'Daemon'un Kökeni",
    "originLink": "https://www.takeourword.com/TOW146/page4.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41891953",
    "commentBody": "",
    "originSummary": [
      "Bilgisayarda \"daemon\" terimi, 1963 yılında Project MAC'te Profesör Corbato'nun ekibi tarafından kullanılmış olup, bir kısaltma değil, fizikteki Maxwell'in daemonundan esinlenilmiştir.",
      "Bu tartışma ayrıca \"au jus,\" \"golf\" ve \"piri piri\" gibi terimleri içeren dilin inceliklerini ve etimolojisini de araştırıyor.",
      "Okuyucu katkıları ve dil ile etimoloji üzerine açıklamalar tartışmaya dahil edilmiştir."
    ],
    "commentSummary": [
      "Bilgisayar biliminde, \"daemon\" terimi, *nix (Unix benzeri) işletim sistemlerinden kaynaklanan ve sistem görevlerini yöneten arka plan süreçlerini ifade eder.",
      "Bu terim, \"daimon\"un rehber ruh anlamına geldiği Yunan mitolojisinde köklere sahiptir ve teknoloji kültüründe genellikle tuhaf ve kara mizahla ilişkilendirilir.",
      "Daemon\" kelimesinin telaffuzu değişiklik gösterir; bazıları \"day-mon\" derken, diğerleri \"demon\" der, bu da kelimenin mitolojik ve kültürel etkilerini yansıtır."
    ],
    "points": 167,
    "commentCount": 64,
    "retryCount": 0,
    "time": 1729384521
  },
  {
    "id": 41893994,
    "title": "Bitwarden artık ücretsiz bir yazılım değil",
    "originLink": "https://github.com/bitwarden/clients/issues/11611",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41893994",
    "commentBody": "",
    "originSummary": [
      "Bitwarden'ın masaüstü sürümü 2024.10.0, yalnızca Bitwarden uygulamalarıyla kullanımını sınırlayan yeni bir bağımlılık olan @bitwarden/sdk-internal nedeniyle artık ücretsiz yazılım olarak kabul edilmemektedir.",
      "Bu değişiklik, açık kaynak ilkeleriyle çeliştiği için kullanıcılar arasında endişelere yol açtı ve bazılarını alternatifleri düşünmeye veya önceki sürümü çatallamaya yöneltti.",
      "Bitwarden, sorunu fark etti ve ele almayı planlıyor, SDK ve istemcinin farklı programlar olduğunu vurgulayarak açık kaynaklı yazılımdan tescilli yazılım modellerine geçişin daha geniş bir eğilimini yansıtıyor."
    ],
    "commentSummary": [
      "Bitwarden, tamamen açık kaynak olmaktan uzaklaşarak eleştiri alıyor ve bu durum, açık kaynak taahhüdüne değer veren kullanıcılar arasında endişe yaratıyor.",
      "Bu hamle, CTO'nun GPL (Genel Kamu Lisansı) uyumluluğunu koruma konusundaki güvencelerine rağmen, CEO Michael Crandell'in önceki eylemleriyle paralellikler çizerek, olası bir satın almanın habercisi olarak algılanıyor.",
      "Kullanıcılar, açık kaynaklı modellerden tescilli modellere geçiş yaparken şirketlerin karşılaştığı daha geniş zorlukları ve eleştirileri yansıtarak KeePassXC ve Proton Pass gibi alternatifleri araştırıyor."
    ],
    "points": 153,
    "commentCount": 58,
    "retryCount": 0,
    "time": 1729414289
  },
  {
    "id": 41891799,
    "title": "Automattic'e gönderdiğimiz İhtarname ile ilgili olarak",
    "originLink": "https://wpfusion.com/business/regarding-our-cease-and-desist-letter-to-automattic/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41891799",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Automattic, WPFusion'un listelemesi hakkında gönderilen durdurma ve vazgeçme mektubuna, ücretli planlarının bir parçası olmasına rağmen adil kullanım iddiasında bulunarak yanıt verdi ve bu durum açık kaynak yazılım ve ticari marka sorunları üzerine tartışma başlattı.",
      "Eleştirmenler, Automattic'in eylemlerinin WordPress.org (açık kaynak) ve WordPress.com (ticari) arasındaki ayrımı bulanıklaştırdığını ve WordPress topluluğunun önemli bir figürü olan Matt Mullenweg'in niyetleri hakkında endişeler yarattığını savunuyorlar.",
      "Durum, açık kaynak topluluğunda kurumsal kullanım ve ticari marka uygulamasıyla ilgili devam eden gerilimleri vurguluyor."
    ],
    "points": 147,
    "commentCount": 47,
    "retryCount": 0,
    "time": 1729382415
  },
  {
    "id": 41889990,
    "title": "Otizmin Dört Temel Alt Türü",
    "originLink": "https://www.thetransmitter.org/spectrum/untangling-biological-threads-from-autisms-phenotypic-patchwork-reveals-four-core-subtypes/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41889990",
    "commentBody": "",
    "originSummary": [
      "Bir çalışma, 5.000'den fazla otistik çocuktan elde edilen verileri kullanarak, otistik bireyleri paylaşılan özellikler ve genetik varyantlara göre dört alt gruba ayırmaktadır.",
      "Her alt grup, otizm özelliklerinde hafif ila şiddetli zorluklar, sosyal zorluklar veya gelişimsel gecikmeler gibi çeşitli zorluklarla, farklı biyolojik yollarla bağlantılıdır.",
      "Çalışma, genetik profillerin klinik dönüm noktalarını tahmin etmeye yardımcı olabileceğini ve daha fazla verinin bu alt tipleri daha da geliştirebileceğini öne sürüyor, medRxiv'de bildirildiği gibi."
    ],
    "commentSummary": [
      "Troyanskaya ve meslektaşları tarafından yapılan bir çalışma, 5.392 otistik bireyin özelliklerini ve davranışlarını analiz ederek, veri analizinde kümelemeye benzer bir istatistiksel model kullanarak dört otizm alt tipi belirledi.",
      "Buluntular, otizmin karmaşıklığını alt türler aracılığıyla anlamanın faydalı olabileceğini öne sürüyor, ancak psikolojik teşhislerin bireysel benzersizliği etkili bir şekilde yakalayıp yakalamadığı konusunda tartışmalar var.",
      "Bu tartışma, otizm teşhisinin genişliğini, otizm ve Asperger'in birleştirilmesini ve bilimsel olarak geçerli ve pratik olarak faydalı kategoriler oluşturmanın zorluklarını içermektedir."
    ],
    "points": 134,
    "commentCount": 101,
    "retryCount": 0,
    "time": 1729365562
  },
  {
    "id": 41894451,
    "title": "Dağıtılmış kilitleme nasıl yapılır (2016)",
    "originLink": "https://martin.kleppmann.com/2016/02/08/how-to-do-distributed-locking.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41894451",
    "commentBody": "",
    "originSummary": [
      "Martin Kleppmann, Redlock algoritmasını Redis üzerinde dağıtılmış kilitleme için eleştiriyor ve zamanlama varsayımlarına bağımlılığı ve çit tokenlarının yokluğu nedeniyle doğruluk gerektiren senaryolar için uygun olmadığını vurguluyor.",
      "Redlock'un zamanlama varsayımları, ağ gecikmeleri ve süreç duraklamaları gibi güvenlik açıklarına yol açabileceğinden, verimlilik kilitleri için tek bir Redis örneği ve doğruluk gerektiren kilitler için ZooKeeper gibi bir mutabakat sistemi kullanmayı tavsiye ediyor.",
      "Kleppmann, Redis'in sınırlamalarını anlamanın ve belirli kilitleme gereksinimleri için doğru araçları seçmenin önemini vurguluyor."
    ],
    "commentSummary": [
      "2018 yılında bir ekip, bilet tahsisinde dağıtılmış kilitleme için güvenilirliği ve sadeliği nedeniyle Redis yerine Postgres'i tercih etti.",
      "Takım, doğruluğu ve performansı artıran dağıtılmış kilitler için bileşik bir UPDATE ifadesi kullandı.",
      "Bu tartışma, birçok dağıtık sistemin geleneksel veritabanı işlemlerine güvenebileceğini ve tüm sorunların karmaşık dağıtık çözümler gerektirmediğini vurgulamaktadır."
    ],
    "points": 127,
    "commentCount": 65,
    "retryCount": 0,
    "time": 1729420697
  },
  {
    "id": 41890158,
    "title": "İngilizce, Matematik ve Programlama Dilleri",
    "originLink": "https://github.com/norvig/pytudes/blob/main/ipynb/Triplets.ipynb",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41890158",
    "commentBody": "",
    "originSummary": [
      "Norvig/pytudes deposu, 2.4k çatal ve 22.8k yıldız ile topluluk katılımının önemli olduğu bir GitHub üzerindeki herkese açık bir projedir.",
      "Bu, aktif geliştirme ve iş birliğini gösteren kod, sorunlar, çekme istekleri ve güvenlik içgörüleri gibi çeşitli kaynakları içerir.",
      "Depodaki dikkate değer bir dosya olan \"Triplets.ipynb\", 584 satırdan oluşmakta ve 19.3 KB boyutunda olup, önemli miktarda kod veya veri içerdiğini göstermektedir."
    ],
    "commentSummary": [
      "Bu tartışma, Büyük Dil Modelleri (LLM'ler) ile problem çözmede İngilizce, Matematik ve Programlama dillerinin etkinliğini vurgulamakta ve Python'un problemleri ifade etmedeki yapısal doğasına dikkat çekmektedir. LLM'lerin, bu dillerdeki örnekler üzerinde geniş kapsamlı eğitim almaları nedeniyle programlama dilleriyle daha iyi performans gösterebileceği öne sürülmekte, ancak akıl yürütme ve hesaplama konularında sınırlamalarla karşılaştıkları belirtilmektedir. Tartışma, matematik ve programlamanın dil olarak sınıflandırılıp sınıflandırılmaması gerektiğini, bu dillerin resmi dil özelliklerini ve dil seçiminin LLM'lerin problem çözme verimliliği üzerindeki etkisini içermektedir."
    ],
    "points": 123,
    "commentCount": 39,
    "retryCount": 0,
    "time": 1729366759
  }
]
