[
  {
    "id": 40970560,
    "title": "Använd CUDA, oförändrat, på AMD GPU:er",
    "originLink": "https://docs.scale-lang.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40970560",
    "commentBody": "",
    "originSummary": [
      "SCALE by Spectral Compute är ett GPGPU (General-Purpose computing on Graphics Processing Units) programmeringsverktyg som möjliggör inhemsk kompilering av CUDA-applikationer för AMD GPU:er utan att ändra den ursprungliga CUDA-koden eller byggsystemet.",
      "SCALE fungerar som en direkt ersättning för NVIDIAs nvcc-kompilator, vilket möjliggör sömlös integration med befintliga byggverktyg och skript, och stöder olika öppen källkod CUDA-projekt som NVIDIA Thrust och Blender Cycles.",
      "För närvarande stöder SCALE AMD GPU:er som gfx1030 (Navi 21, RDNA 2.0) och gfx1100 (Navi 31, RDNA 3.0), med pågående utveckling för ytterligare GPU-arkitekturer."
    ],
    "commentSummary": [
      "Diskussionen kretsar kring genomförbarheten och konsekvenserna av att köra CUDA (Compute Unified Device Architecture) på AMD GPU:er, med fokus på tekniska och juridiska utmaningar.",
      "Vissa hävdar att det är opraktiskt att stödja översättningslager för CUDA på AMD GPU:er och föreslår istället att fokusera på öppen källkodsprojekt som PyTorch.",
      "HIP (Heterogeneous-Compute Interface for Portability) nämns som en potentiell lösning med låg arbetsinsats för att porta CUDA-kod till AMD GPU:er, även om det inte är helt utan ansträngning."
    ],
    "points": 1102,
    "commentCount": 331,
    "retryCount": 0,
    "time": 1721070307
  },
  {
    "id": 40974112,
    "title": "För reklam samlar Firefox nu in användardata som standard",
    "originLink": "https://www.heise.de/en/news/For-advertising-Firefox-now-collects-user-data-by-default-9801345.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40974112",
    "commentBody": "",
    "originSummary": [
      "Firefox senaste version samlar nu in användardata som standard och introducerar Privacy-Preserving Attribution (PPA) för anonymiserad annonsmätning, vilket har väckt kontroverser.",
      "Critics argue that this default data collection undermines user trust and suspect Mozilla's intention to boost revenue, challenging Firefox's reputation for privacy.",
      "Den PPA använder en aggregeringsserver för att anonymisera data, men det finns fortfarande oro över att data lämnar användarnas datorer och potentiell framtida åtkomst av annonsörer."
    ],
    "commentSummary": [
      "Firefox har börjat samla in användardata som standard för reklamändamål, vilket kan inaktiveras i inställningarna under Sekretess & Säkerhet.",
      "Användare har rapporterat att inställningen för att inaktivera denna funktion inte är lätt att hitta och inte synkroniseras mellan enheter.",
      "Mozilla's CTO hävdar att funktionen balanserar integritet och annonsmätning, men användarskepsis och kritik kvarstår."
    ],
    "points": 522,
    "commentCount": 460,
    "retryCount": 0,
    "time": 1721112110
  },
  {
    "id": 40973339,
    "title": "Exo: Kör din egen AI-kluster hemma med vardagliga enheter",
    "originLink": "https://github.com/exo-explore/exo",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40973339",
    "commentBody": "",
    "originSummary": [
      "Exo låter användare skapa en AI-kluster hemma med hjälp av vardagliga enheter som iPhones, iPads, Androids, Macs och Linux-system, vilket eliminerar behovet av dyra NVIDIA GPU:er.",
      "Viktiga funktioner inkluderar brett modellstöd (t.ex. LLaMA), dynamisk modellpartitionering, automatisk enhetsupptäckt och en ChatGPT-kompatibel API, allt med en peer-to-peer-anslutning utan en master-worker-arkitektur.",
      "Exo är experimentell programvara, så användare bör förvänta sig tidiga buggar och uppmanas att rapportera problem och bidra till communityn."
    ],
    "commentSummary": [
      "Exo låter användare köra sina egna AI-kluster hemma med hjälp av vardagliga enheter, vilket ger ett alternativ till molnbaserad AI-beräkning.",
      "Projektet stöder olika hårdvaror, inklusive gamla telefoner och bärbara datorer, och syftar till att erbjuda integritet, anpassning och offlineåtkomst för AI-modeller.",
      "Diskussioner belyser avvägningarna mellan lokala och molnbaserade AI-modeller, inklusive kostnad, prestanda och integritet, där vissa användare föredrar lokala lösningar för personlig eller känslig data."
    ],
    "points": 292,
    "commentCount": 96,
    "retryCount": 0,
    "time": 1721098511
  },
  {
    "id": 40972122,
    "title": "Horizon – Privat alternativ till Imgur",
    "originLink": "https://horizon.pics",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40972122",
    "commentBody": "",
    "originSummary": [
      "James, en 17-årig fullstackutvecklare från Kanada, har utvecklat Horizon Pics, en filhostingtjänst med fokus på säkerhet, integritet och användarbehov, utan annonser eller försäljning av data.",
      "För nyligen genomgick Horizon Pics en omprofilering och lanserade en ny skrivbordsapp kallad Alpine, som automatiskt laddar upp skärmdumpar och urklippsinnehåll, och erbjuder funktioner som automatisk radering och end-to-end-kryptering.",
      "Appen är byggd med moderna teknologier som Tauri, TypeScript, SvelteKit, Sass och Rust, och Horizon Pics erbjuder både gratis- och betalplaner med varierande lagringsgränser."
    ],
    "commentSummary": [
      "Horizon Pics, utvecklat av en 17-årig fullstackingenjör från Kanada, är ett privat alternativ till Imgur som erbjuder reklamfri och säker filhosting.",
      "Den tjänsten lanserade nyligen en omprofilering, inklusive en ny skrivbordsapp kallad Alpine, som automatiskt laddar upp skärmdumpar och urklipp med integritetsalternativ.",
      "Horizon Pics erbjuder både en gratisplan med begränsad lagring och en betalplan med högre gränser, med målet att attrahera användare som söker integritetsfokuserade filhostinglösningar."
    ],
    "points": 259,
    "commentCount": 147,
    "retryCount": 0,
    "time": 1721083536
  },
  {
    "id": 40971553,
    "title": "Farmaceutisk prissättningsmaffia",
    "originLink": "https://www.thebignewsletter.com/p/inside-the-mafia-of-pharma-pricing",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40971553",
    "commentBody": "",
    "originSummary": [
      "FTC:s nya rapport avslöjar hur några få vårdkonglomerat, liknade vid en maffia, kontrollerar 4 % av alla pengar i USA genom läkemedelsprissättning.",
      "Apoteksförmånsförvaltare (PBM) identifieras som nyckelaktörer som höjer läkemedelspriser genom att kontrollera prissättningen och omdirigera medel till sig själva.",
      "FTC:s åtgärder och potentiella lagändringar syftar till att hantera monopoliserandet av läkemedelsprissättning av PBM:er, vilket har lett till avsevärt uppblåsta kostnader."
    ],
    "commentSummary": [
      "Artikeln diskuterar oetiska metoder inom läkemedelsindustrin, särskilt involverande apoteksförmånsförvaltare (PBM) och läkemedelsföretag.",
      "Viktiga frågor inkluderar försäljning av receptdata, lagliga \"rabatter\" som fungerar som mutor, och påverkan av finansiella incitament på medicinska diagnoser och recept.",
      "Konversationen belyser behovet av transparens och reglering för att hantera marknadsförvrängningar och skydda patienter från oetiskt beteende och uppblåsta läkemedelspriser."
    ],
    "points": 245,
    "commentCount": 98,
    "retryCount": 0,
    "time": 1721078439
  },
  {
    "id": 40974193,
    "title": "Ingenjörens guide till djupinlärning: Förstå transformer-modellen",
    "originLink": "https://www.interdb.jp/dl/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40974193",
    "commentBody": "",
    "originSummary": [
      "Dokumentet, \"Ingenjörens guide till djupinlärning,\" erbjuder en omfattande guide till att förstå Transformer-modellen, ett betydande AI-genombrott som introducerades 2017.",
      "Det inkluderar grundläggande koncept av neurala nätverk, RNNs (Recurrent Neural Networks), NLP (Natural Language Processing), och uppmärksamhetsmekanismer, med fungerande Python-kodexempel och referenser för vidare utforskning.",
      "Släppt den 21 maj 2024, är det gratis för utbildnings- och icke-kommersiellt bruk, författat av Hironobu SUZUKI, en erfaren mjukvaruprogrammerare och AI-entusiast."
    ],
    "commentSummary": [
      "Artikeln diskuterar olika resurser för att förstå Transformer-modellen inom djupinlärning och lyfter fram både gratis- och betalalternativ.",
      "Rekommendationer inkluderar \"The Annotated Transformer,\" \"Transformers from Scratch,\" Andrej Karpathys serie och 3Blue1Browns visuella introduktioner.",
      "Det pågår en debatt om relevansen av Keras, där vissa användare noterar dess nedgång inom akademin och industrin som föredrar JAX, medan andra nämner Keras 3:s stöd för flera backend-system."
    ],
    "points": 238,
    "commentCount": 28,
    "retryCount": 0,
    "time": 1721113266
  },
  {
    "id": 40977103,
    "title": "Codestral Mamba",
    "originLink": "https://mistral.ai/news/codestral-mamba/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40977103",
    "commentBody": "",
    "originSummary": [
      "Den 16 juli 2024 introducerade Mistral AI Codestral Mamba, en ny arkitektur utvecklad tillsammans med Albert Gu och Tri Dao, som erbjuder linjär tidsinferens och förmågan att modellera sekvenser av oändlig längd.",
      "Codestral Mamba är effektiv för kodproduktivitet, presterar jämförbart med toppmoderna (SOTA) transformer-modeller och stöder in-context hämtning upp till 256k tokens.",
      "Modellen kan distribueras via olika SDK:er, med råvikter tillgängliga på HuggingFace, och är gratis under Apache 2.0-licensen, medan Codestral 22B har kommersiella och gemenskapslicenser."
    ],
    "commentSummary": [
      "Codestral Mamba, en ny modell från Mistral.ai, har släppts och väcker intresse på grund av sin unika arkitektur och kapacitet.",
      "Modellen stödjer 256k kontexttoken och erbjuder linjär inferenstid, vilket gör den konkurrenskraftig med transformerbaserade modeller.",
      "Det pågår diskussioner om att integrera Codestral Mamba med utvecklingsmiljöer som VS Code och IntelliJ, men det nuvarande stödet är begränsat."
    ],
    "points": 229,
    "commentCount": 59,
    "retryCount": 0,
    "time": 1721141086
  },
  {
    "id": 40973422,
    "title": "Peter Buxtun, visselblåsaren som avslöjade Tuskegee-syfilisstudien, har avlidit",
    "originLink": "https://www.theguardian.com/us-news/article/2024/jul/15/peter-buxtun-tuskegee-whistleblower-dies",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40973422",
    "commentBody": "",
    "originSummary": [
      "Peter Buxtun, visselblåsaren som avslöjade den oetiska Tuskegee-syfilisstudien, har avlidit vid 86 års ålder.",
      "Buxtuns avslöjande ledde till att studien avslutades 1972, kongressförhör och en förlikning på 10 miljoner dollar för offren.",
      "Han jämförde studien med nazistiska medicinska experiment, vilket ledde till nya statliga forskningsregler och betonade hans betydande påverkan på etiska standarder inom medicinsk forskning."
    ],
    "commentSummary": [
      "Peter Buxtun, visselblåsaren som avslöjade den oetiska Tuskegee-syfilisstudien, har gått bort.",
      "Buxtuns oro över studien, som undanhöll behandling från afroamerikanska män med syfilis, ignorerades i sex år innan den fick uppmärksamhet.",
      "Studien i Tuskegee har haft långvariga effekter, inklusive att bidra till vaccinskepsis i afroamerikanska samhällen och att belysa systemisk rasism inom medicinsk forskning."
    ],
    "points": 211,
    "commentCount": 73,
    "retryCount": 0,
    "time": 1721099843
  },
  {
    "id": 40972437,
    "title": "Polygraphens illusion",
    "originLink": "https://lithub.com/what-the-all-american-delusion-of-the-polygraph-says-about-our-relationship-to-fact-and-fiction/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40972437",
    "commentBody": "",
    "originSummary": [
      "Justin St. Germain utforskar de suddiga gränserna mellan minne, memoar och myt genom sin upplevelse med ett lögndetektortest under en jobbansökan hos Tull- och gränsskydd.",
      "Han hävdar att polygrafen, som ofta ses som en lögndetektor, faktiskt skapar snarare än upptäcker sanning, och drar paralleller till memoarskrivande.",
      "Germain diskuterar lögndetektorns kontroversiella historia, dess användning för att tvinga fram bekännelser och dess symboliska roll i att hävda statens makt, och lyfter fram dess brister samt den amerikanska besattheten av en enkel, upptäckbar sanning."
    ],
    "commentSummary": [
      "Författaren berättar om att ha tagit ett lögndetektortest vid nitton års ålder på grund av misstankar om stöld på jobbet, trots att han var oskyldig.",
      "Polygrafer kritiseras för att de används för att tvinga fram bekännelser snarare än att exakt upptäcka lögner, vilket ofta leder till stress och opålitliga resultat.",
      "Trots deras tvivelaktiga noggrannhet fortsätter lögndetektorer att användas vid jobbscreeningar och brottsutredningar som ett verktyg för att skrämma."
    ],
    "points": 194,
    "commentCount": 188,
    "retryCount": 0,
    "time": 1721086774
  },
  {
    "id": 40973123,
    "title": "En recension av Linux på Surface Pro 4",
    "originLink": "https://www.binwang.me/2024-07-12-A-Review-of-Linux-on-Surface-Pro-4.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40973123",
    "commentBody": "",
    "originSummary": [
      "Författaren experimenterade med att installera Linux på en Surface Pro 4, ursprungligen inköpt 2016, för att undersöka dess användbarhet för olika användningsområden som internetanvändning, mediekonsumtion och skissande.",
      "Installation av Linux var enkel med EndeavourOS och Fedora Workstation 40, men surfplattans funktionalitet var problematisk, med problem som spöktryckningar, dålig handflatsavvisning och betydande batteridränering under viloläge.",
      "På grund av dessa problem återgick författaren till Windows 10, då det visade sig vara mer funktionellt för deras behov, men kan överväga Linux igen efter att Windows 10 når slutet av sin livscykel nästa år."
    ],
    "commentSummary": [
      "En recension av att köra Linux på en Surface Pro 4 har väckt betydande diskussioner och belyst olika användarupplevelser med Linux på olika hårdvaror.",
      "Många användare jämför sina erfarenheter med Linux på andra enheter, såsom Dell XPS och ThinkPads, och noterar problem som sömnläge, strömhantering och hårdvaruintegration.",
      "Konversationen understryker utmaningarna med att uppnå sömlös hårdvaru-mjukvaruintegration på Linux, liknande macOS på MacBooks, på grund av komplexiteterna i utvecklingen av enhetsdrivrutiner."
    ],
    "points": 187,
    "commentCount": 199,
    "retryCount": 0,
    "time": 1721095383
  },
  {
    "id": 40972134,
    "title": "Hur fångar juvelerare upp varje sista partikel av gulddamm? (2017)",
    "originLink": "https://www.ft.com/content/0512638c-b7c2-11e6-961e-a1acd97f622d",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40972134",
    "commentBody": "",
    "originSummary": [
      "Gary Williams på Mastermelt hanterar förbränning av kommersiellt avfall för att återvinna ädelmetaller, där juvelerare samlar varje partikel av gulddamm från sina verkstäder för bearbetning.",
      "Processen innebär att man värmer material till 2 000 grader Celsius för att återvinna metaller som guld och platina, med avancerade tekniker och teknologi som hjälper till att fånga upp mer avfallet.",
      "Förtroende mellan juvelerare och raffinaderier är avgörande, och branschen förfinar ständigt metoder för att maximera återvinningen av ädelmetaller."
    ],
    "commentSummary": [
      "Juvelerare använder noggranna metoder för att fånga upp varje guldpartikel, inklusive att uppgradera fönster, ha tvättmöjligheter på plats och riva upp golv.",
      "Sådana metoder påminner om historiska insatser, såsom Manhattanprojektets återvinning av silver från golv och utrustning.",
      "Juvelerare i städer som Sydney och New York återvinner guld från verkstadsgolv och trottoarer, vilket betonar branschens uppfinningsrikedom och minimala materialförlust."
    ],
    "points": 164,
    "commentCount": 128,
    "retryCount": 0,
    "time": 1721083704
  },
  {
    "id": 40970621,
    "title": "Verktyg för öppen samverkan",
    "originLink": "https://www.typefox.io/blog/open-collaboration-tools-announcement/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40970621",
    "commentBody": "",
    "originSummary": [
      "Open Collaboration Tools är ett open-source-projekt som syftar till att förbättra distansarbete genom live-delning av innehåll i integrerade utvecklingsmiljöer (IDE).",
      "Viktiga funktioner inkluderar tillägg för VS Code och Eclipse Theia, en serverapplikation för autentisering och samarbete, samt ett öppet protokoll med end-to-end-kryptering.",
      "Projektet åtgärdar brister i befintliga verktyg genom att erbjuda ingen leverantörsinlåsning, absolut utbyggbarhet, flexibla distributionsalternativ och öppen källkodslicensiering under MIT-licensen."
    ],
    "commentSummary": [
      "Open Collaboration Tools av TypeFox får uppmärksamhet, särskilt bland användare av openvscode-server och Eclipse Theia, på grund av dess potential för förbättrat fjärrsamarbete.",
      "TypeFox verktyg, inklusive Sprotty, Langium och Theia, lyfts fram, med spekulationer om att Theia kan ersätta openvscode-server om det uppfyller sina löften.",
      "Diskussionen inkluderar intresse för skalbarheten och beredskapen hos en YJS-leverantör för samarbetsredigering, samt jämförelser med andra samarbetsmetoder som skärmdelning och VS Live Share."
    ],
    "points": 160,
    "commentCount": 14,
    "retryCount": 0,
    "time": 1721070733
  },
  {
    "id": 40974154,
    "title": "OpenAI hindrade olagligt personal från att påtala säkerhetsrisker, säger visselblåsare",
    "originLink": "https://www.washingtonpost.com/technology/2024/07/13/openai-safety-risks-whistleblower-sec/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40974154",
    "commentBody": "",
    "originSummary": [
      "OpenAI-visselblåsare har lämnat in ett klagomål till SEC och anklagar företaget för att olagligt ha hindrat anställda från att varna tillsynsmyndigheter om riskerna med dess teknik.",
      "Anmälan hävdar att OpenAIs anställningsavtal bröt mot federala lagar genom att kräva att personalen avstår från rättigheter till visselblåsarkompensation och söker företagets samtycke innan de avslöjar information till myndigheter.",
      "OpenAI har uppgett att de stödjer skyddade avslöjanden och har reviderat sina policyer, medan SEC har erkänt klagomålet men inte bekräftat någon utredning."
    ],
    "commentSummary": [
      "Visselblåsare hävdar att OpenAI begränsade personalen från att diskutera säkerhetsrisker, vilket väcker oro över företagets användning av sekretessavtal (NDAs).",
      "Vissa kritiker menar att OpenAI:s fokus på \"säkerhetsrisker\" kanske handlar mer om marknadsföring och regleringsstrategier än om verkliga hot, vilket liknar taktiker som används av andra teknikföretag.",
      "Debatten sträcker sig till de etiska konsekvenserna av AI-utveckling, inklusive användningen av partiska modeller och den bredare påverkan av AI-reglering."
    ],
    "points": 143,
    "commentCount": 138,
    "retryCount": 0,
    "time": 1721112701
  },
  {
    "id": 40972099,
    "title": "KUtrace: Lågkostnads spårningsfunktion för Linux-kärnan",
    "originLink": "https://github.com/dicksites/KUtrace",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40972099",
    "commentBody": "",
    "originSummary": [
      "KUtrace är ett lågkostnadsverktyg för spårning av Linux-kärnan, utformat för att analysera prestanda genom att följa övergångar mellan kärna och användare.",
      "Den producerar detaljerade tidslinjer per CPU-kärna som kan zoomas in till nanosekundsnivå, vilket hjälper till att lösa prestandaproblem i datacenter och realtidsautonom körning.",
      "Verktyget stöder x86- och ARM-processorer, är öppen källkod under olika licenser och inkluderar filer från boken \"Understanding Software Dynamics\" av Richard L. Sites."
    ],
    "commentSummary": [
      "KUtrace är en lågkostnads spårningsfunktion för Linux-kärnan som är utformad för att hjälpa till att förstå prestandaflaskhalsar, särskilt i system med flera maskiner.",
      "Till skillnad från eBPF-verktyg kräver KUtrace kärnpatchar och root-åtkomst, vilket innebär att aktivt underhåll är nödvändigt.",
      "Verktyget beröms för sin effektivitet, med rekommendationer för boken \"Understanding Software Dynamics\" av dess författare, Dick Sites, för ytterligare insikter i systemprestanda."
    ],
    "points": 132,
    "commentCount": 26,
    "retryCount": 0,
    "time": 1721083310
  },
  {
    "id": 40978731,
    "title": "Jag startar ett AI+utbildningsföretag",
    "originLink": "https://twitter.com/karpathy/status/1813263734707790301",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40978731",
    "commentBody": "",
    "originSummary": [
      "Andrej Karpathy har tillkännagett lanseringen av sitt nya företag, Eureka Labs, som fokuserar på att integrera AI med utbildning.",
      "Eureka Labs har som mål att skapa en AI-infödd skola som är utformad för att revolutionera lärandeupplevelsen.",
      "Tillkännagivandet gjordes via en tweet, vilket väckte stort intresse inom teknik- och utbildningssamhällena."
    ],
    "commentSummary": [
      "Andrej Karpathy startar ett AI+utbildningsföretag, vilket väcker diskussioner om AI:s roll inom utbildning.",
      "Åsikterna varierar om AI:s potential, där vissa hävdar att det kan assistera men inte ersätta lärare, medan andra tror att AI kan förbättra och anpassa lärandeupplevelser.",
      "Debatten belyser det föränderliga landskapet inom utbildningsteknologi och betonar behovet av innovativa lösningar för att förbättra undervisning och lärande."
    ],
    "points": 119,
    "commentCount": 46,
    "retryCount": 0,
    "time": 1721152655
  }
]
