[
  {
    "id": 40970560,
    "title": "Chạy CUDA, không chỉnh sửa, trên GPU của AMD",
    "originLink": "https://docs.scale-lang.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40970560",
    "commentBody": "",
    "originSummary": [
      "SCALE của Spectral Compute là một bộ công cụ lập trình GPGPU (tính toán đa mục đích trên các đơn vị xử lý đồ họa) cho phép biên dịch gốc các ứng dụng CUDA cho GPU của AMD mà không cần sửa đổi mã CUDA gốc hoặc hệ thống xây dựng.",
      "SCALE hoạt động như một sự thay thế trực tiếp cho trình biên dịch nvcc của NVIDIA, cho phép tích hợp liền mạch với các công cụ và kịch bản xây dựng hiện có, và hỗ trợ các dự án CUDA mã nguồn mở khác nhau như NVIDIA Thrust và Blender Cycles.",
      "Hiện tại, SCALE hỗ trợ các GPU AMD như gfx1030 (Navi 21, RDNA 2.0) và gfx1100 (Navi 31, RDNA 3.0), với việc phát triển liên tục cho các kiến trúc GPU bổ sung."
    ],
    "commentSummary": [
      "Cuộc thảo luận tập trung vào tính khả thi và những tác động của việc chạy CUDA (Kiến trúc Thiết bị Tính toán Hợp nhất) trên các GPU của AMD, nhấn mạnh những thách thức về kỹ thuật và pháp lý.",
      "Vài người cho rằng việc hỗ trợ các lớp dịch cho CUDA trên GPU của AMD là không thực tế và đề xuất tập trung vào các dự án mã nguồn mở như PyTorch thay vào đó.",
      "HIP (Heterogeneous-Compute Interface for Portability) được đề cập như một giải pháp tiềm năng với ít công sức để chuyển mã CUDA sang GPU của AMD, mặc dù nó không hoàn toàn không tốn công sức."
    ],
    "points": 1102,
    "commentCount": 331,
    "retryCount": 0,
    "time": 1721070307
  },
  {
    "id": 40974112,
    "title": "Để phục vụ quảng cáo, Firefox hiện thu thập dữ liệu người dùng theo mặc định",
    "originLink": "https://www.heise.de/en/news/For-advertising-Firefox-now-collects-user-data-by-default-9801345.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40974112",
    "commentBody": "",
    "originSummary": [
      "Phiên bản mới nhất của Firefox hiện thu thập dữ liệu người dùng theo mặc định, giới thiệu Tính năng Quy gán Bảo vệ Quyền riêng tư (PPA) cho việc đo lường quảng cáo ẩn danh, điều này đã gây ra tranh cãi.",
      "Những người chỉ trích cho rằng việc thu thập dữ liệu mặc định này làm suy yếu niềm tin của người dùng và nghi ngờ ý định của Mozilla nhằm tăng doanh thu, thách thức danh tiếng về quyền riêng tư của Firefox.",
      "Hiệp hội Bảo vệ Quyền riêng tư (PPA) sử dụng một máy chủ tổng hợp để ẩn danh dữ liệu, nhưng vẫn còn lo ngại về việc dữ liệu rời khỏi máy tính của người dùng và khả năng truy cập trong tương lai bởi các nhà quảng cáo."
    ],
    "commentSummary": [
      "Firefox đã bắt đầu thu thập dữ liệu người dùng mặc định cho mục đích quảng cáo, điều này có thể được tắt trong cài đặt dưới mục Quyền riêng tư & Bảo mật.",
      "Người dùng đã báo cáo rằng cài đặt để vô hiệu hóa tính năng này không dễ dàng tìm kiếm và không đồng bộ trên các thiết bị.",
      "Một giám đốc kỹ thuật của Mozilla cho rằng tính năng này cân bằng giữa quyền riêng tư và đo lường quảng cáo, nhưng sự hoài nghi và chỉ trích từ người dùng vẫn tiếp tục tồn tại."
    ],
    "points": 522,
    "commentCount": 460,
    "retryCount": 0,
    "time": 1721112110
  },
  {
    "id": 40973339,
    "title": "Exo: Vận hành cụm AI của riêng bạn tại nhà với các thiết bị hàng ngày",
    "originLink": "https://github.com/exo-explore/exo",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40973339",
    "commentBody": "",
    "originSummary": [
      "Exo cho phép người dùng tạo một cụm AI tại nhà bằng cách sử dụng các thiết bị hàng ngày như iPhone, iPad, Android, Mac và hệ thống Linux, loại bỏ nhu cầu sử dụng các GPU NVIDIA đắt tiền.",
      "Những tính năng chính bao gồm hỗ trợ nhiều mô hình (ví dụ, LLaMA), phân chia mô hình động, tự động phát hiện thiết bị, và API tương thích với ChatGPT, tất cả đều sử dụng kết nối ngang hàng mà không cần kiến trúc chủ-thợ.",
      "Exo là phần mềm thử nghiệm, vì vậy người dùng nên mong đợi các lỗi ban đầu và được khuyến khích báo cáo các vấn đề cũng như đóng góp cho cộng đồng."
    ],
    "commentSummary": [
      "Exo cho phép người dùng chạy các cụm AI của riêng họ tại nhà bằng cách sử dụng các thiết bị hàng ngày, cung cấp một giải pháp thay thế cho việc tính toán AI dựa trên đám mây.",
      "Đề án hỗ trợ nhiều loại phần cứng khác nhau, bao gồm điện thoại và máy tính xách tay cũ, và nhằm cung cấp quyền riêng tư, tùy chỉnh và truy cập ngoại tuyến cho các mô hình AI.",
      "Thảo luận nêu bật những đánh đổi giữa các mô hình AI cục bộ và đám mây, bao gồm chi phí, hiệu suất và quyền riêng tư, với một số người dùng ưa chuộng các thiết lập cục bộ cho dữ liệu cá nhân hoặc nhạy cảm."
    ],
    "points": 292,
    "commentCount": 96,
    "retryCount": 0,
    "time": 1721098511
  },
  {
    "id": 40972122,
    "title": "Horizon – Giải pháp thay thế riêng tư cho Imgur",
    "originLink": "https://horizon.pics",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40972122",
    "commentBody": "",
    "originSummary": [
      "James, một kỹ sư full-stack 17 tuổi đến từ Canada, đã phát triển Horizon Pics, một dịch vụ lưu trữ tệp tập trung vào bảo mật, quyền riêng tư và nhu cầu của người dùng, không có quảng cáo hay bán dữ liệu.",
      "Vừa qua, Horizon Pics đã tiến hành tái thương hiệu và ra mắt một ứng dụng máy tính để bàn mới có tên là Alpine, ứng dụng này tự động tải lên các ảnh chụp màn hình và nội dung clipboard, cung cấp các tính năng như tự động xóa và mã hóa đầu cuối.",
      "Ứng dụng được xây dựng với các công nghệ hiện đại như Tauri, TypeScript, SvelteKit, Sass và Rust, và Horizon Pics cung cấp cả gói miễn phí và gói trả phí với các giới hạn lưu trữ khác nhau."
    ],
    "commentSummary": [
      "Horizon Pics, được phát triển bởi một kỹ sư full-stack 17 tuổi từ Canada, là một lựa chọn thay thế riêng tư cho Imgur, cung cấp dịch vụ lưu trữ tệp không có quảng cáo và an toàn.",
      "Địch vụ gần đây đã ra mắt một thương hiệu mới, bao gồm một ứng dụng máy tính để bàn mới có tên là Alpine, tự động tải lên các ảnh chụp màn hình và bảng tạm với các tùy chọn bảo mật.",
      "Horizon Pics cung cấp cả gói miễn phí với dung lượng lưu trữ giới hạn và gói trả phí với giới hạn cao hơn, nhằm thu hút người dùng tìm kiếm các giải pháp lưu trữ tệp tập trung vào quyền riêng tư."
    ],
    "points": 259,
    "commentCount": 147,
    "retryCount": 0,
    "time": 1721083536
  },
  {
    "id": 40971553,
    "title": "Giá cả Mafia của Ngành Dược",
    "originLink": "https://www.thebignewsletter.com/p/inside-the-mafia-of-pharma-pricing",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40971553",
    "commentBody": "",
    "originSummary": [
      "Phúc trình mới của FTC tiết lộ cách một số tập đoàn y tế, được ví như mafia, kiểm soát 4% tổng số tiền của Hoa Kỳ thông qua việc định giá dược phẩm.",
      "Nhà quản lý lợi ích dược phẩm (PBMs) được xác định là những nhân tố chính làm tăng giá thuốc bằng cách kiểm soát giá cả và chuyển hướng quỹ về phía họ.",
      "Những hành động của FTC và các thay đổi lập pháp tiềm năng nhằm giải quyết việc độc quyền hóa giá dược phẩm bởi các PBM, điều này đã dẫn đến chi phí tăng cao đáng kể."
    ],
    "commentSummary": [
      "Đoạn viết thảo luận về các hành vi phi đạo đức trong ngành công nghiệp dược phẩm, đặc biệt liên quan đến các Nhà Quản Lý Lợi Ích Dược Phẩm (PBMs) và các công ty dược.",
      "Những vấn đề chính bao gồm việc bán dữ liệu kê đơn, các khoản \"hoàn trả\" hợp pháp hoạt động như các khoản hối lộ, và ảnh hưởng của các động lực tài chính đến chẩn đoán và kê đơn y tế.",
      "Cuộc trò chuyện nhấn mạnh sự cần thiết của tính minh bạch và quy định để giải quyết các biến dạng thị trường và bảo vệ bệnh nhân khỏi hành vi phi đạo đức và giá thuốc bị thổi phồng."
    ],
    "points": 245,
    "commentCount": 98,
    "retryCount": 0,
    "time": 1721078439
  },
  {
    "id": 40974193,
    "title": "Cuốn Hướng Dẫn Kỹ Sư Về Học Sâu: Hiểu Về Mô Hình Transformer",
    "originLink": "https://www.interdb.jp/dl/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40974193",
    "commentBody": "",
    "originSummary": [
      "Văn bản, \"Hướng Dẫn Của Kỹ Sư Về Học Sâu,\" cung cấp một hướng dẫn toàn diện để hiểu mô hình Transformer, một bước đột phá quan trọng trong AI được giới thiệu vào năm 2017.",
      "Bao gồm các khái niệm cơ bản về mạng nơ-ron, RNNs (Mạng Nơ-ron Tái Phát), NLP (Xử lý Ngôn ngữ Tự nhiên), và các cơ chế chú ý, kèm theo các ví dụ mã Python hoạt động và tài liệu tham khảo để khám phá thêm.",
      "Phát hành vào ngày 21 tháng 5 năm 2024, nó miễn phí cho việc sử dụng giáo dục và phi thương mại, được tác giả bởi Hironobu SUZUKI, một lập trình viên phần mềm dày dặn kinh nghiệm và người đam mê AI."
    ],
    "commentSummary": [
      "Đoạn bài viết thảo luận về các nguồn tài liệu khác nhau để hiểu mô hình Transformer trong học sâu, nêu bật các tùy chọn miễn phí và trả phí.",
      "Những khuyến nghị bao gồm \"The Annotated Transformer,\" \"Transformers from Scratch,\" loạt bài của Andrej Karpathy, và các phần giới thiệu trực quan của 3Blue1Brown.",
      "Hiện đang có một cuộc tranh luận về sự liên quan của Keras, với một số người dùng lưu ý rằng nó đang giảm sút trong giới học thuật và công nghiệp ưa chuộng JAX, trong khi những người khác đề cập đến việc Keras 3 hỗ trợ nhiều backend."
    ],
    "points": 238,
    "commentCount": 28,
    "retryCount": 0,
    "time": 1721113266
  },
  {
    "id": 40977103,
    "title": "Mãng xà Codestral",
    "originLink": "https://mistral.ai/news/codestral-mamba/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40977103",
    "commentBody": "",
    "originSummary": [
      "Vào ngày 16 tháng 7 năm 2024, Mistral AI đã giới thiệu Codestral Mamba, một kiến trúc mới được phát triển cùng với Albert Gu và Tri Dao, cung cấp khả năng suy luận theo thời gian tuyến tính và khả năng mô hình hóa các chuỗi có độ dài vô hạn.",
      "Codestral Mamba hiệu quả cho năng suất mã, hoạt động tương đương với các mô hình transformer tiên tiến nhất (SOTA), và hỗ trợ truy xuất trong ngữ cảnh lên đến 256k token.",
      "Model này có thể triển khai thông qua các SDK khác nhau, với trọng số thô có sẵn trên HuggingFace, và miễn phí theo giấy phép Apache 2.0, trong khi Codestral 22B có giấy phép thương mại và cộng đồng."
    ],
    "commentSummary": [
      "Codestral Mamba, một mẫu mới từ Mistral.ai, đã được phát hành và đang thu hút sự quan tâm nhờ vào kiến trúc và khả năng độc đáo của nó.",
      "Model này hỗ trợ 256k token ngữ cảnh và cung cấp thời gian suy luận tuyến tính, làm cho nó cạnh tranh với các mô hình dựa trên transformer.",
      "Hiện đang có cuộc thảo luận về việc tích hợp Codestral Mamba với các môi trường phát triển như VS Code và IntelliJ, nhưng hỗ trợ hiện tại còn hạn chế."
    ],
    "points": 229,
    "commentCount": 59,
    "retryCount": 0,
    "time": 1721141086
  },
  {
    "id": 40973422,
    "title": "Peter Buxtun, người tố giác đã phơi bày nghiên cứu bệnh giang mai Tuskegee, đã qua đời",
    "originLink": "https://www.theguardian.com/us-news/article/2024/jul/15/peter-buxtun-tuskegee-whistleblower-dies",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40973422",
    "commentBody": "",
    "originSummary": [
      "Peter Buxtun, người tố giác đã phơi bày nghiên cứu bệnh giang mai Tuskegee phi đạo đức, đã qua đời ở tuổi 86.",
      "Tiết lộ của Buxtun đã dẫn đến việc chấm dứt nghiên cứu vào năm 1972, các phiên điều trần của quốc hội, và một khoản bồi thường 10 triệu đô la cho các nạn nhân.",
      "Việc ông so sánh nghiên cứu này với các thí nghiệm y khoa của Đức Quốc xã đã thúc đẩy các quy định nghiên cứu mới của chính phủ, nhấn mạnh tác động đáng kể của ông đối với các tiêu chuẩn đạo đức trong nghiên cứu y khoa."
    ],
    "commentSummary": [
      "Peter Buxtun, người tố giác đã phơi bày nghiên cứu bệnh giang mai Tuskegee phi đạo đức, đã qua đời.",
      "Những lo ngại của Buxtun về nghiên cứu, trong đó không cung cấp điều trị cho những người đàn ông Mỹ gốc Phi mắc bệnh giang mai, đã bị phớt lờ trong sáu năm trước khi thu hút sự chú ý.",
      "Cuộc nghiên cứu Tuskegee đã để lại những tác động lâu dài, bao gồm việc góp phần vào sự do dự về vaccine trong các cộng đồng người Mỹ gốc Phi và làm nổi bật sự phân biệt chủng tộc có hệ thống trong nghiên cứu y học."
    ],
    "points": 211,
    "commentCount": 73,
    "retryCount": 0,
    "time": 1721099843
  },
  {
    "id": 40972437,
    "title": "Ảo tưởng về máy phát hiện nói dối",
    "originLink": "https://lithub.com/what-the-all-american-delusion-of-the-polygraph-says-about-our-relationship-to-fact-and-fiction/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40972437",
    "commentBody": "",
    "originSummary": [
      "Justin St. Germain khám phá những ranh giới mờ nhạt giữa ký ức, hồi ký và huyền thoại thông qua trải nghiệm của mình với bài kiểm tra nói dối trong quá trình xin việc tại Cơ quan Hải quan và Bảo vệ Biên giới.",
      "He lập luận rằng máy phát hiện nói dối, thường được coi là máy phát hiện nói dối, thực ra tạo ra sự thật hơn là phát hiện sự thật, và so sánh điều này với việc viết hồi ký.",
      "Germain thảo luận về lịch sử gây tranh cãi của máy phát hiện nói dối, việc sử dụng nó để ép cung, và vai trò biểu tượng của nó trong việc khẳng định quyền lực nhà nước, nhấn mạnh những thiếu sót của nó và sự ám ảnh của người Mỹ với một sự thật đơn giản, có thể phát hiện."
    ],
    "commentSummary": [
      "Người tác giả kể lại việc phải tham gia kiểm tra bằng máy phát hiện nói dối khi mười chín tuổi do bị nghi ngờ ăn cắp tại nơi làm việc, mặc dù vô tội.",
      "Máy phát hiện nói dối bị chỉ trích vì việc sử dụng chúng để ép buộc lời thú tội hơn là phát hiện nói dối một cách chính xác, thường dẫn đến căng thẳng và kết quả không đáng tin cậy.",
      "Mặc dù độ chính xác của chúng còn gây tranh cãi, máy phát hiện nói dối vẫn tiếp tục được sử dụng trong các cuộc kiểm tra tuyển dụng và điều tra tội phạm như một công cụ để đe dọa."
    ],
    "points": 194,
    "commentCount": 188,
    "retryCount": 0,
    "time": 1721086774
  },
  {
    "id": 40973123,
    "title": "Đánh giá về Linux trên Surface Pro 4",
    "originLink": "https://www.binwang.me/2024-07-12-A-Review-of-Linux-on-Surface-Pro-4.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40973123",
    "commentBody": "",
    "originSummary": [
      "Người tác giả đã thử nghiệm cài đặt Linux trên Surface Pro 4, ban đầu được mua vào năm 2016, để khám phá tính khả thi của nó cho các trường hợp sử dụng khác nhau như duyệt internet, tiêu thụ phương tiện truyền thông và vẽ phác thảo.",
      "Việc cài đặt Linux rất đơn giản khi sử dụng EndeavourOS và Fedora Workstation 40, nhưng chức năng máy tính bảng gặp vấn đề, với các sự cố như chạm ma, từ chối lòng bàn tay kém và tiêu hao pin đáng kể khi ở chế độ ngủ.",
      "Do những vấn đề này, tác giả đã quay lại sử dụng Windows 10, thấy nó phù hợp hơn với nhu cầu của mình, nhưng có thể sẽ xem xét lại Linux sau khi Windows 10 hết hạn vào năm tới."
    ],
    "commentSummary": [
      "Việc đánh giá việc chạy Linux trên Surface Pro 4 đã gây ra nhiều cuộc thảo luận đáng kể, làm nổi bật các trải nghiệm khác nhau của người dùng với Linux trên các phần cứng khác nhau.",
      "Rất nhiều người dùng so sánh trải nghiệm của họ với Linux trên các thiết bị khác, chẳng hạn như Dell XPS và ThinkPad, lưu ý các vấn đề như chế độ ngủ, quản lý năng lượng và tích hợp phần cứng.",
      "Cuộc trò chuyện nhấn mạnh những thách thức trong việc đạt được sự tích hợp liền mạch giữa phần cứng và phần mềm trên Linux, tương tự như macOS trên MacBook, do những phức tạp trong phát triển trình điều khiển thiết bị."
    ],
    "points": 187,
    "commentCount": 199,
    "retryCount": 0,
    "time": 1721095383
  },
  {
    "id": 40972134,
    "title": "Những người thợ kim hoàn làm thế nào để thu thập từng hạt bụi vàng cuối cùng? (2017)",
    "originLink": "https://www.ft.com/content/0512638c-b7c2-11e6-961e-a1acd97f622d",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40972134",
    "commentBody": "",
    "originSummary": [
      "Gary Williams của Mastermelt quản lý việc đốt rác thải thương mại để thu hồi kim loại quý, với các thợ kim hoàn thu thập từng hạt bụi vàng từ xưởng của họ để xử lý.",
      "Quá trình này bao gồm việc đun nóng các vật liệu đến 2.000 độ C để thu hồi các kim loại như vàng và bạch kim, với các kỹ thuật và công nghệ tiên tiến hỗ trợ trong việc thu giữ nhiều chất thải hơn.",
      "Niềm tin giữa các thợ kim hoàn và các nhà tinh chế là rất quan trọng, và ngành công nghiệp này liên tục cải tiến các phương pháp để tối đa hóa việc thu hồi kim loại quý."
    ],
    "commentSummary": [
      "Thợ kim hoàn sử dụng các phương pháp tỉ mỉ để thu giữ từng hạt bụi vàng, bao gồm nâng cấp cửa sổ, giặt là tại chỗ và xé sàn nhà.",
      "Những thực hành này gợi nhớ đến các nỗ lực lịch sử, chẳng hạn như việc thu hồi bạc từ sàn nhà và thiết bị của Dự án Manhattan.",
      "Thợ kim hoàn ở các thành phố như Sydney và New York thu hồi vàng từ sàn xưởng và vỉa hè, nhấn mạnh sự khéo léo của ngành và việc giảm thiểu tổn thất vật liệu."
    ],
    "points": 164,
    "commentCount": 128,
    "retryCount": 0,
    "time": 1721083704
  },
  {
    "id": 40970621,
    "title": "Những Công Cụ Hợp Tác Mở",
    "originLink": "https://www.typefox.io/blog/open-collaboration-tools-announcement/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40970621",
    "commentBody": "",
    "originSummary": [
      "Open Collaboration Tools là một dự án mã nguồn mở nhằm nâng cao làm việc nhóm từ xa thông qua việc chia sẻ trực tiếp nội dung của Môi trường Phát triển Tích hợp (IDE).",
      "Những tính năng chính bao gồm các tiện ích mở rộng cho VS Code và Eclipse Theia, một ứng dụng máy chủ cho việc xác thực và cộng tác, và một giao thức mở với mã hóa đầu cuối.",
      "Đề án giải quyết các lỗ hổng trong các công cụ hiện có bằng cách cung cấp không khóa nhà cung cấp, khả năng mở rộng tuyệt đối, các tùy chọn triển khai linh hoạt và giấy phép mã nguồn mở theo Giấy phép MIT."
    ],
    "commentSummary": [
      "Open Collaboration Tools của TypeFox đang thu hút sự chú ý, đặc biệt là từ người dùng openvscode-server và Eclipse Theia, nhờ vào tiềm năng cải thiện sự hợp tác từ xa.",
      "Dụng cụ của TypeFox, bao gồm Sprotty, Langium và Theia, đang được nhấn mạnh, với suy đoán rằng Theia có thể thay thế openvscode-server nếu nó thực hiện được những lời hứa của mình.",
      "Cuộc thảo luận bao gồm sự quan tâm đến khả năng mở rộng và sẵn sàng của nhà cung cấp YJS cho việc chỉnh sửa hợp tác, và so sánh với các phương pháp hợp tác khác như chia sẻ màn hình và VS Live Share."
    ],
    "points": 160,
    "commentCount": 14,
    "retryCount": 0,
    "time": 1721070733
  },
  {
    "id": 40974154,
    "title": "Những người tố giác cho biết OpenAI đã cấm nhân viên công khai các rủi ro an toàn một cách bất hợp pháp",
    "originLink": "https://www.washingtonpost.com/technology/2024/07/13/openai-safety-risks-whistleblower-sec/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40974154",
    "commentBody": "",
    "originSummary": [
      "Những người tố giác tại OpenAI đã nộp đơn khiếu nại lên SEC, cáo buộc công ty này đã hạn chế bất hợp pháp nhân viên cảnh báo các cơ quan quản lý về những rủi ro của công nghệ của mình.",
      "Đơn khiếu nại cho rằng các thỏa thuận lao động của OpenAI đã vi phạm luật liên bang bằng cách yêu cầu nhân viên từ bỏ quyền nhận bồi thường khi tố giác và phải xin phép công ty trước khi tiết lộ thông tin cho các cơ quan chức năng.",
      "OpenAI đã tuyên bố rằng họ ủng hộ các tiết lộ được bảo vệ và đã sửa đổi các chính sách của mình, trong khi SEC đã thừa nhận đơn khiếu nại nhưng chưa xác nhận một cuộc điều tra."
    ],
    "commentSummary": [
      "Những người tố giác cho rằng OpenAI đã hạn chế nhân viên thảo luận về các rủi ro an toàn, làm dấy lên lo ngại về việc công ty sử dụng các thỏa thuận không tiết lộ thông tin (NDA).",
      "Những người chỉ trích cho rằng sự nhấn mạnh của OpenAI vào \"rủi ro an toàn\" có thể liên quan nhiều hơn đến chiến lược tiếp thị và quy định hơn là các mối đe dọa thực sự, tương tự như các chiến thuật được sử dụng bởi các công ty công nghệ khác.",
      "Cuộc tranh luận mở rộng đến các tác động đạo đức của việc phát triển AI, bao gồm việc sử dụng các mô hình thiên vị và tác động rộng hơn của việc điều chỉnh AI."
    ],
    "points": 143,
    "commentCount": 138,
    "retryCount": 0,
    "time": 1721112701
  },
  {
    "id": 40972099,
    "title": "KUtrace: Công cụ theo dõi nhân Linux với chi phí thấp",
    "originLink": "https://github.com/dicksites/KUtrace",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40972099",
    "commentBody": "",
    "originSummary": [
      "KUtrace là một công cụ theo dõi nhân Linux với chi phí thấp, được thiết kế để phân tích hiệu suất bằng cách theo dõi các chuyển đổi giữa nhân và người dùng.",
      "Chương trình này tạo ra các dòng thời gian chi tiết cho từng lõi CPU có thể phóng to đến từng nano giây, hỗ trợ giải quyết các vấn đề về hiệu suất trong các trung tâm dữ liệu và lái xe tự động thời gian thực.",
      "Phần mềm này hỗ trợ bộ vi xử lý x86 và ARM, được mã nguồn mở theo nhiều giấy phép khác nhau, và bao gồm các tệp từ cuốn sách \"Hiểu về Động lực Phần mềm\" của Richard L. Sites."
    ],
    "commentSummary": [
      "KUtrace là một công cụ theo dõi nhân Linux với chi phí thấp, được thiết kế để giúp hiểu rõ các nút thắt hiệu suất, đặc biệt trong các hệ thống đa máy.",
      "Không giống như các công cụ eBPF, KUtrace yêu cầu các bản vá kernel và quyền truy cập root, đòi hỏi phải bảo trì thường xuyên.",
      "Được khen ngợi vì tính hiệu quả của nó, công cụ này được khuyến nghị cùng với cuốn sách \"Hiểu về Động lực Phần mềm\" của tác giả Dick Sites để có thêm những hiểu biết sâu sắc về hiệu suất hệ thống."
    ],
    "points": 132,
    "commentCount": 26,
    "retryCount": 0,
    "time": 1721083310
  },
  {
    "id": 40978731,
    "title": "Tôi đang bắt đầu một công ty AI+Giáo dục",
    "originLink": "https://twitter.com/karpathy/status/1813263734707790301",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40978731",
    "commentBody": "",
    "originSummary": [
      "Andrej Karpathy đã công bố việc ra mắt công ty mới của mình, Eureka Labs, tập trung vào việc tích hợp AI với giáo dục.",
      "Eureka Labs hướng tới việc tạo ra một trường học gốc AI nhằm cách mạng hóa trải nghiệm học tập.",
      "Thông báo được đưa ra qua một tweet, thu hút sự quan tâm đáng kể từ cộng đồng công nghệ và giáo dục."
    ],
    "commentSummary": [
      "Andrej Karpathy đang khởi động một công ty AI+Giáo dục, khơi dậy các cuộc thảo luận về vai trò của AI trong giáo dục.",
      "Ý kiến khác nhau về tiềm năng của AI, với một số người cho rằng nó có thể hỗ trợ nhưng không thể thay thế giáo viên, trong khi những người khác tin rằng AI có thể nâng cao và cá nhân hóa trải nghiệm học tập.",
      "Cuộc tranh luận làm nổi bật bối cảnh đang phát triển của công nghệ giáo dục, nhấn mạnh sự cần thiết của các giải pháp sáng tạo để cải thiện việc giảng dạy và học tập."
    ],
    "points": 119,
    "commentCount": 46,
    "retryCount": 0,
    "time": 1721152655
  }
]
