[
  {
    "id": 40970560,
    "title": "Voer CUDA, ongewijzigd, uit op AMD GPU's",
    "originLink": "https://docs.scale-lang.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40970560",
    "commentBody": "",
    "originSummary": [
      "SCALE door Spectral Compute is een GPGPU (General-Purpose computing on Graphics Processing Units) programmeertoolkit die native compilatie van CUDA-toepassingen voor AMD GPU's mogelijk maakt zonder de oorspronkelijke CUDA-code of het buildsysteem te wijzigen.",
      "SCALE fungeert als een drop-in vervanging voor NVIDIA's nvcc-compiler, waardoor naadloze integratie met bestaande build-tools en scripts mogelijk is, en ondersteunt verschillende open-source CUDA-projecten zoals NVIDIA Thrust en Blender Cycles.",
      "Momenteel ondersteunt SCALE AMD GPU's zoals gfx1030 (Navi 21, RDNA 2.0) en gfx1100 (Navi 31, RDNA 3.0), met lopende ontwikkeling voor extra GPU-architecturen."
    ],
    "commentSummary": [
      "De discussie draait om de haalbaarheid en implicaties van het draaien van CUDA (Compute Unified Device Architecture) op AMD GPU's, waarbij technische en juridische uitdagingen worden belicht.",
      "Sommigen beweren dat het ondersteunen van vertalingslagen voor CUDA op AMD GPU's onpraktisch is en stellen voor om in plaats daarvan de focus te leggen op open-source projecten zoals PyTorch.",
      "HIP (Heterogeneous-Compute Interface for Portability) wordt genoemd als een potentiële oplossing met weinig inspanning voor het porteren van CUDA-code naar AMD GPU's, hoewel het niet volledig zonder inspanning is."
    ],
    "points": 1102,
    "commentCount": 331,
    "retryCount": 0,
    "time": 1721070307
  },
  {
    "id": 40974112,
    "title": "Voor advertenties verzamelt Firefox nu standaard gebruikersgegevens",
    "originLink": "https://www.heise.de/en/news/For-advertising-Firefox-now-collects-user-data-by-default-9801345.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40974112",
    "commentBody": "",
    "originSummary": [
      "De nieuwste versie van Firefox verzamelt nu standaard gebruikersgegevens en introduceert Privacy-Preserving Attribution (PPA) voor geanonimiseerde advertentiemeting, wat controverse heeft veroorzaakt.",
      "Critici beweren dat denne standard datainnsamlingen undergraver brukernes tillit og mistenker at Mozillas hensikt er å øke inntektene, noe som utfordrer Firefox sitt rykte for personvern.",
      "De PPA gebruikt een aggregatieserver om gegevens te anonimiseren, maar er blijven zorgen bestaan over gegevens die de computers van gebruikers verlaten en mogelijke toekomstige toegang door adverteerders."
    ],
    "commentSummary": [
      "Firefox is begonnen met het verzamelen van gebruikersgegevens standaard voor advertentiedoeleinden, wat kan worden uitgeschakeld in de instellingen onder Privacy & Beveiliging.",
      "Gebruikers hebben gemeld dat de instelling om deze functie uit te schakelen niet gemakkelijk te vinden is en niet synchroniseert tussen apparaten.",
      "De CTO van Mozilla beweert dat de functie privacy en advertentiemeting in balans brengt, maar gebruikersskepsis en kritiek blijven bestaan."
    ],
    "points": 522,
    "commentCount": 460,
    "retryCount": 0,
    "time": 1721112110
  },
  {
    "id": 40973339,
    "title": "Exo: Run je eigen AI-cluster thuis met alledaagse apparaten",
    "originLink": "https://github.com/exo-explore/exo",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40973339",
    "commentBody": "",
    "originSummary": [
      "Exo stelt gebruikers in staat om een AI-cluster thuis te creëren met alledaagse apparaten zoals iPhones, iPads, Androids, Macs en Linux-systemen, waardoor de noodzaak voor dure NVIDIA GPU's wordt geëlimineerd.",
      "Belangrijke kenmerken zijn onder andere brede modelondersteuning (bijv. LLaMA), dynamische modelpartitionering, automatische apparaatherkenning en een ChatGPT-compatibele API, allemaal met behulp van een peer-to-peer verbinding zonder een master-worker architectuur.",
      "Exo is experimentele software, dus gebruikers moeten vroege bugs verwachten en worden aangemoedigd om problemen te melden en bij te dragen aan de gemeenschap."
    ],
    "commentSummary": [
      "Exo stelt gebruikers in staat om hun eigen AI-clusters thuis te draaien met alledaagse apparaten, en biedt een alternatief voor cloudgebaseerde AI-computing.",
      "Het project ondersteunt verschillende hardware, waaronder oude telefoons en laptops, en heeft als doel privacy, maatwerk en offline toegang voor AI-modellen te bieden.",
      "Discussies benadrukken de afwegingen tussen lokale en cloud AI-modellen, waaronder kosten, prestaties en privacy, waarbij sommige gebruikers de voorkeur geven aan lokale opstellingen voor persoonlijke of gevoelige gegevens."
    ],
    "points": 292,
    "commentCount": 96,
    "retryCount": 0,
    "time": 1721098511
  },
  {
    "id": 40972122,
    "title": "Horizon – Privaat alternatief voor Imgur",
    "originLink": "https://horizon.pics",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40972122",
    "commentBody": "",
    "originSummary": [
      "James, een 17-jarige full-stack engineer uit Canada, heeft Horizon Pics ontwikkeld, een bestandsopslagdienst gericht op veiligheid, privacy en gebruikersbehoeften, zonder advertenties of gegevensverkoop.",
      "Onlangs heeft Horizon Pics een rebranding ondergaan en een nieuwe desktop-app gelanceerd genaamd Alpine, die automatisch schermafbeeldingen en klembordinhoud uploadt, met functies zoals automatische verwijdering en end-to-end encryptie.",
      "De app is gebouwd met moderne technologieën zoals Tauri, TypeScript, SvelteKit, Sass en Rust, en Horizon Pics biedt zowel gratis als betaalde abonnementen met verschillende opslaglimieten."
    ],
    "commentSummary": [
      "Horizon Pics, ontwikkeld door een 17-jarige full-stack engineer uit Canada, is een privé alternatief voor Imgur, dat advertentievrije en veilige bestandsopslag biedt.",
      "De service heeft onlangs een rebranding gelanceerd, inclusief een nieuwe desktop-app genaamd Alpine, die automatisch schermafbeeldingen en klemborden uploadt met privacyopties.",
      "Horizon Pics biedt zowel een gratis plan met beperkte opslag als een betaald plan met hogere limieten, met als doel gebruikers aan te trekken die op zoek zijn naar privacygerichte bestandsoplossingen."
    ],
    "points": 259,
    "commentCount": 147,
    "retryCount": 0,
    "time": 1721083536
  },
  {
    "id": 40971553,
    "title": "De maffia van farmaceutische prijzen",
    "originLink": "https://www.thebignewsletter.com/p/inside-the-mafia-of-pharma-pricing",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40971553",
    "commentBody": "",
    "originSummary": [
      "Het nieuwe rapport van de FTC onthult hoe enkele zorgconglomeraten, vergeleken met een maffia, 4% van al het Amerikaanse geld beheersen door middel van farmaceutische prijsstelling.",
      "Apotheekvoordeelbeheerders (PBM's) worden geïdentificeerd als belangrijke spelers die de medicijnprijzen opdrijven door de prijzen te controleren en fondsen naar zichzelf te herleiden.",
      "De acties van FTC en mogelijke lovendringer tar sikte på å adressere monopoliseringen av legemiddelpriser av PBM-er, noe som har ført til betydelig oppblåste kostnader."
    ],
    "commentSummary": [
      "De post bespreekt onethische praktijken in de farmaceutische industrie, met name met betrekking tot Pharmacy Benefit Managers (PBM's) en farmaceutische bedrijven.",
      "Belangrijke kwesties zijn onder meer de verkoop van voorschriftgegevens, legale 'kortingen' die functioneren als steekpenningen, en de invloed van financiële prikkels op medische diagnoses en voorschriften.",
      "Het gesprek benadrukt de noodzaak van transparantie en regelgeving om marktverstoringen aan te pakken en patiënten te beschermen tegen onethisch gedrag en opgeblazen medicijnprijzen."
    ],
    "points": 245,
    "commentCount": 98,
    "retryCount": 0,
    "time": 1721078439
  },
  {
    "id": 40974193,
    "title": "De ingenieursgids voor deep learning: Begrijpen van het transformer model",
    "originLink": "https://www.interdb.jp/dl/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40974193",
    "commentBody": "",
    "originSummary": [
      "Het document, 'De ingenieursgids voor diep leren,' biedt een uitgebreide gids voor het begrijpen van het Transformer-model, een belangrijke doorbraak in AI die in 2017 werd geïntroduceerd.",
      "Het omvat fundamentele concepten van neurale netwerken, RNN's (Recurrente Neurale Netwerken), NLP (Natuurlijke Taalverwerking) en aandacht mechanismen, met werkende Python codevoorbeelden en referenties voor verdere verkenning.",
      "Uitgebracht op 21 mei 2024, is het gratis voor educatief en niet-commercieel gebruik, geschreven door Hironobu SUZUKI, een ervaren softwareprogrammeur en AI-enthousiasteling."
    ],
    "commentSummary": [
      "De post bespreekt verschillende bronnen voor å forstå Transformer-modellen i dyp læring, og fremhever både gratis og betalte alternativer.",
      "De aanbevelingen omvatten \"The Annotated Transformer,\" \"Transformers from Scratch,\" Andrej Karpathy's serie, en 3Blue1Brown's visuele introducties.",
      "Er is een debat over de relevantie van Keras, waarbij sommige gebruikers wijzen op de afname ervan in de academische wereld en de industrie die de voorkeur geeft aan JAX, terwijl anderen de ondersteuning van Keras 3 voor meerdere backends noemen."
    ],
    "points": 238,
    "commentCount": 28,
    "retryCount": 0,
    "time": 1721113266
  },
  {
    "id": 40977103,
    "title": "Codestral Mamba",
    "originLink": "https://mistral.ai/news/codestral-mamba/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40977103",
    "commentBody": "",
    "originSummary": [
      "Op 16 juli 2024 introduceerde Mistral AI Codestral Mamba, een nieuwe architectuur ontwikkeld met Albert Gu en Tri Dao, die lineaire tijdsinferentie en de mogelijkheid om sequenties van oneindige lengte te modelleren biedt.",
      "Codestral Mamba is efficiënt voor codeproductiviteit, presteert vergelijkbaar met state-of-the-art (SOTA) transformermodellen, en ondersteunt in-context retrieval tot 256k tokens.",
      "Het model is inzetbaar via verschillende SDK's, met ruwe gewichten beschikbaar op HuggingFace, en is gratis onder de Apache 2.0-licentie, terwijl Codestral 22B commerciële en gemeenschapslicenties heeft."
    ],
    "commentSummary": [
      "Codestral Mamba, een nieuw model van Mistral.ai, is uitgebracht en wekt interesse vanwege zijn unieke architectuur en mogelijkheden.",
      "Het model ondersteunt 256k contexttokens en biedt lineaire inferentietijd, waardoor het concurrerend is met op transformator gebaseerde modellen.",
      "Er is een lopende discussie over het integreren van Codestral Mamba met ontwikkelomgevingen zoals VS Code en IntelliJ, maar de huidige ondersteuning is beperkt."
    ],
    "points": 229,
    "commentCount": 59,
    "retryCount": 0,
    "time": 1721141086
  },
  {
    "id": 40973422,
    "title": "Peter Buxtun, klokkenluider die de Tuskegee-syfilisstudie onthulde, is overleden",
    "originLink": "https://www.theguardian.com/us-news/article/2024/jul/15/peter-buxtun-tuskegee-whistleblower-dies",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40973422",
    "commentBody": "",
    "originSummary": [
      "Peter Buxtun, de klokkenluider die de onethische Tuskegee-syfilisstudie aan het licht bracht, is overleden op 86-jarige leeftijd.",
      "Buxtuns avsløring førte til avslutningen av studien i 1972, kongresshøringer og et forlik på 10 millioner dollar for ofrene.",
      "Zijn vergelijking van de studie met nazi-medische experimenten leidde tot nieuwe overheidsvoorschriften voor onderzoek, wat zijn aanzienlijke invloed op ethische normen in medisch onderzoek benadrukt."
    ],
    "commentSummary": [
      "Peter Buxtun, de klokkenluider die de onethische Tuskegee-syfilisstudie aan het licht bracht, is overleden.",
      "Buxtuns zorgen over de studie, die behandeling onthield aan Afro-Amerikaanse mannen met syfilis, werden zes jaar lang genegeerd voordat ze aandacht kregen.",
      "De Tuskegee-studie heeft blijvende gevolgen gehad, waaronder het bijdragen aan vaccinatie aarzeling in Afro-Amerikaanse gemeenschappen en het benadrukken van systemisch racisme in medisch onderzoek."
    ],
    "points": 211,
    "commentCount": 73,
    "retryCount": 0,
    "time": 1721099843
  },
  {
    "id": 40972437,
    "title": "De illusie van de leugendetector",
    "originLink": "https://lithub.com/what-the-all-american-delusion-of-the-polygraph-says-about-our-relationship-to-fact-and-fiction/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40972437",
    "commentBody": "",
    "originSummary": [
      "Justin St. Germain verkent de vervaagde lijnen tussen herinnering, memoires en mythe door zijn ervaring met een leugendetectortest tijdens een sollicitatie bij de Douane en Grensbescherming.",
      "Hij stelt dat de polygraaf, vaak gezien als een leugendetector, eigenlijk waarheid creëert in plaats van detecteert, en trekt parallellen met het schrijven van memoires.",
      "Germaine bespreekt polygraaf's controversiële geschiedenis, het gebruik ervan bij het afdwingen van bekentenissen, en zijn symbolische rol in het bevestigen van staatsmacht, waarbij hij de gebreken en de Amerikaanse obsessie met een eenvoudige, detecteerbare waarheid benadrukt."
    ],
    "commentSummary": [
      "De auteur vertelt om å ha tatt en løgndetektortest som nittenåring på grunn av tyverimisstanker på jobben, til tross for at han var uskyldig.",
      "Polygrafen worden bekritiseerd vanwege hun gebruik bij het afdwingen van bekentenissen in plaats van het nauwkeurig detecteren van leugens, wat vaak leidt tot stress en onbetrouwbare resultaten.",
      "Ondanks deres tvilsomme nøyaktighet, fortsetter løgndetektorer å bli brukt i jobbscreeninger og kriminelle etterforskninger som et verktøy for å skremme."
    ],
    "points": 194,
    "commentCount": 188,
    "retryCount": 0,
    "time": 1721086774
  },
  {
    "id": 40973123,
    "title": "Een recensie van Linux op Surface Pro 4",
    "originLink": "https://www.binwang.me/2024-07-12-A-Review-of-Linux-on-Surface-Pro-4.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40973123",
    "commentBody": "",
    "originSummary": [
      "De auteur experimenteerde met het installeren van Linux op een Surface Pro 4, oorspronkelijk gekocht in 2016, om de bruikbaarheid ervan voor verschillende toepassingen zoals internet browsen, mediaconsumptie en schetsen te verkennen.",
      "De installatie van Linux was eenvoudig met EndeavourOS en Fedora Workstation 40, maar de tabletfunctionaliteit was problematisch, met problemen zoals ghost touch, slechte palmafwijzing en aanzienlijk batterijverbruik tijdens de slaapstand.",
      "Vanwege deze problemen keerde de auteur terug naar Windows 10, omdat hij dit functioneler vond voor zijn behoeften, maar hij overweegt mogelijk Linux opnieuw na het einde van de levensduur van Windows 10 volgend jaar."
    ],
    "commentSummary": [
      "Een beoordeling van het gebruik van Linux op een Surface Pro 4 heeft aanzienlijke discussies op gang gebracht, waarbij verschillende gebruikerservaringen met Linux op verschillende hardware worden belicht.",
      "Veel gebruikers vergelijken hun ervaringen met Linux op andere apparaten, zoals Dell XPS en ThinkPads, waarbij ze problemen opmerken zoals slaapstand, energiebeheer en hardware-integratie.",
      "Het gesprek benadrukt de uitdagingen van het bereiken van naadloze hardware-software-integratie op Linux, vergelijkbaar met macOS op MacBooks, vanwege de complexiteit van de ontwikkeling van apparaatstuurprogramma's."
    ],
    "points": 187,
    "commentCount": 199,
    "retryCount": 0,
    "time": 1721095383
  },
  {
    "id": 40972134,
    "title": "Hoe vangen juweliers elk laatste deeltje goudstof op? (2017)",
    "originLink": "https://www.ft.com/content/0512638c-b7c2-11e6-961e-a1acd97f622d",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40972134",
    "commentBody": "",
    "originSummary": [
      "Gary Williams van Mastermelt beheert het verbranden van commercieel afval om edelmetalen terug te winnen, waarbij juweliers elk deeltje goudstof uit hun werkplaatsen verzamelen voor verwerking.",
      "Het proces omvat het verhitten van materialen tot 2.000°C om metalen zoals goud en platina terug te winnen, waarbij geavanceerde technieken en technologieën helpen om meer afval op te vangen.",
      "Vertrouwen tussen juweliers en raffinaderijen is cruciaal, en de industrie verfijnt voortdurend methoden om de terugwinning van edelmetalen te maximaliseren."
    ],
    "commentSummary": [
      "Juweliers gebruiken nauwgezette methoden om elk deeltje goudstof op te vangen, waaronder het upgraden van ramen, een eigen wasserij en het verwijderen van vloeren.",
      "Deze praktijken doen denken aan historische inspanningen, zoals de zilverterugwinning van de vloeren en apparatuur van het Manhattan Project.",
      "Juweliers in steden zoals Sydney en New York halen goud terug van werkplaatsvloeren en trottoirs, wat de vindingrijkheid van de industrie en het minimale materiaalverlies benadrukt."
    ],
    "points": 164,
    "commentCount": 128,
    "retryCount": 0,
    "time": 1721083704
  },
  {
    "id": 40970621,
    "title": "De Open Samenwerkingstools",
    "originLink": "https://www.typefox.io/blog/open-collaboration-tools-announcement/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40970621",
    "commentBody": "",
    "originSummary": [
      "Open Collaboration Tools is een open-source project dat gericht is op het verbeteren van samenwerking op afstand door middel van live-deling van Integrated Development Environment (IDE) inhoud.",
      "Belangrijke kenmerken zijn onder andere extensies voor VS Code en Eclipse Theia, een serverapplicatie voor authenticatie en samenwerking, en een open protocol met end-to-end encryptie.",
      "Het project pakt hiaten in bestaande tools aan door geen vendor lock-in te bieden, absolute uitbreidbaarheid, flexibele implementatieopties en open-source licenties onder de MIT-licentie."
    ],
    "commentSummary": [
      "Open Collaboration Tools by TypeFox krijgt steeds meer aandacht, vooral onder gebruikers van openvscode-server en Eclipse Theia, vanwege het potentieel voor verbeterde samenwerking op afstand.",
      "De tools van TypeFox, waaronder Sprotty, Langium en Theia, worden benadrukt, met speculatie om dat Theia openvscode-server zou kunnen vervangen als het zijn beloften waarmaakt.",
      "De discussie omvat interesse in de schaalbaarheid en gereedheid van een YJS-provider voor collaboratieve bewerking, en vergelijkingen met andere samenwerkingsmethoden zoals schermdeling en VS Live Share."
    ],
    "points": 160,
    "commentCount": 14,
    "retryCount": 0,
    "time": 1721070733
  },
  {
    "id": 40974154,
    "title": "OpenAI verbood medewerkers illegaal om veiligheidsrisico's aan de kaak te stellen, zeggen klokkenluiders",
    "originLink": "https://www.washingtonpost.com/technology/2024/07/13/openai-safety-risks-whistleblower-sec/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40974154",
    "commentBody": "",
    "originSummary": [
      "Klokkenblåsere fra OpenAI har levert en klage til SEC, og hevder at selskapet ulovlig begrenset ansatte fra å advare regulatorer om risikoene ved teknologien deres.",
      "De klacht beweert dat de arbeidsovereenkomsten van OpenAI federale wetten hebben geschonden door van het personeel te eisen dat ze afzien van hun recht op klokkenluiderscompensatie en toestemming van het bedrijf vragen voordat ze informatie aan de autoriteiten onthullen.",
      "OpenAI heeft verklaard dat het beschermde onthullingen ondersteunt en heeft zijn beleid herzien, terwijl de SEC de klacht heeft erkend maar geen onderzoek heeft bevestigd."
    ],
    "commentSummary": [
      "Klokkenluidere beweren dat OpenAI begrenset ansatte fra å diskutere sikkerhetsrisikoer, noe som vekker bekymring om selskapets bruk av taushetserklæringer (NDAs).",
      "Critici beweren dat OpenAI's nadruk op 'veiligheidsrisico's' mogelijk meer te maken heeft met marketing- en regelgevingsstrategieën dan met echte bedreigingen, vergelijkbaar met tactieken die door andere technologiebedrijven worden gebruikt.",
      "Het debat strekt zich uit tot de ethische implicaties van AI-ontwikkeling, inclusief het gebruik van bevooroordeelde modellen en de bredere impact van AI-regulering."
    ],
    "points": 143,
    "commentCount": 138,
    "retryCount": 0,
    "time": 1721112701
  },
  {
    "id": 40972099,
    "title": "KUtrace: Low-overhead Linux kernel tracing facility",
    "originLink": "https://github.com/dicksites/KUtrace",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40972099",
    "commentBody": "",
    "originSummary": [
      "KUtrace is een Linux-kerneltraceringshulpmiddel met lage overhead, ontworpen om prestaties te analyseren door kernel-gebruikerovergangen te volgen.",
      "Het produceert gedetailleerde tijdlijnen per CPU-kern die tot op de nanoseconde kunnen worden ingezoomd, wat helpt bij het oplossen van prestatieproblemen in datacenters en real-time autonoom rijden.",
      "De tool ondersteunt x86- en ARM-processors, is open-source onder verschillende licenties, en bevat bestanden fra boken \"Understanding Software Dynamics\" av Richard L. Sites."
    ],
    "commentSummary": [
      "KUtrace is een Linux-kerneltraceringsfaciliteit met lage overhead, ontworpen om prestatieknelpunten te begrijpen, vooral in systemen met meerdere machines.",
      "KUtrace vereist, in tegenstelling tot eBPF-tools, kernel-patches en root-toegang, wat actieve onderhoud vereist.",
      "De tool wordt geprezen om zijn effectiviteit, met aanbevelingen voor boken \"Understanding Software Dynamics\" av forfatteren Dick Sites, for ytterligere innsikt i systemytelse."
    ],
    "points": 132,
    "commentCount": 26,
    "retryCount": 0,
    "time": 1721083310
  },
  {
    "id": 40978731,
    "title": "Ik begin een AI+Onderwijs bedrijf",
    "originLink": "https://twitter.com/karpathy/status/1813263734707790301",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40978731",
    "commentBody": "",
    "originSummary": [
      "Andrej Karpathy heeft de lancering van zijn nieuwe bedrijf, Eureka Labs, aangekondigd, dat zich richt op de integratie van AI met onderwijs.",
      "Eureka Labs streeft ernaar een AI-native school te creëren die de leerervaring wil revolutioneren.",
      "De aankondiging werd gedaan via een tweet, wat aanzienlijke interesse wekte in de technologie- en onderwijsgemeenschappen."
    ],
    "commentSummary": [
      "Andrej Karpathy start een AI+Onderwijs bedrijf, wat discussies opwekt over de rol van AI in het onderwijs.",
      "Meningen verschillen over potensialet til AI, med noen som hevder at det kan assistere, men ikke erstatte lærere, mens andre mener at AI kan forbedre og tilpasse læringsopplevelser.",
      "Het debat benadrukt het veranderende landschap van onderwijstechnologie, waarbij de nadruk ligt op de noodzaak van innovatieve oplossingen om het lesgeven en leren te verbeteren."
    ],
    "points": 119,
    "commentCount": 46,
    "retryCount": 0,
    "time": 1721152655
  }
]
