[
  {
    "id": 40970560,
    "title": "تشغيل CUDA، دون تعديل، على وحدات معالجة الرسومات من AMD",
    "originLink": "https://docs.scale-lang.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40970560",
    "commentBody": "",
    "originSummary": [
      "برنامج SCALE من Spectral Compute هو مجموعة أدوات برمجية لـ GPGPU (الحوسبة العامة على وحدات معالجة الرسومات) تُمكّن من الترجمة الأصلية لتطبيقات CUDA على وحدات معالجة الرسومات من AMD دون تعديل كود CUDA الأصلي أو نظام البناء.",
      "يعمل SCALE كبديل مباشر لمترجم nvcc الخاص بشركة NVIDIA، مما يسمح بالتكامل السلس مع أدوات البناء والبرامج النصية الحالية، ويدعم مختلف مشاريع CUDA مفتوحة المصدر مثل NVIDIA Thrust وBlender Cycles.",
      "حاليًا، يدعم SCALE وحدات معالجة الرسومات من AMD مثل gfx1030 (Navi 21، RDNA 2.0) وgfx1100 (Navi 31، RDNA 3.0)، مع استمرار التطوير لدعم معماريات GPU إضافية."
    ],
    "commentSummary": [
      "تتمحور المناقشة حول جدوى وتشغيل CUDA (بنية الأجهزة الموحدة للحوسبة) على وحدات معالجة الرسومات من AMD، مع تسليط الضوء على التحديات التقنية والقانونية.",
      "يجادل البعض بأن دعم طبقات الترجمة لـ CUDA على وحدات معالجة الرسومات من AMD غير عملي ويقترحون التركيز على المشاريع مفتوحة المصدر مثل PyTorch بدلاً من ذلك.",
      "يُذكر أن واجهة الحوسبة غير المتجانسة للنقل (HIP) تعتبر حلاً محتملاً يتطلب جهدًا منخفضًا لنقل كود CUDA إلى وحدات معالجة الرسومات من AMD، على الرغم من أنها ليست خالية تمامًا من الجهد."
    ],
    "points": 1102,
    "commentCount": 331,
    "retryCount": 0,
    "time": 1721070307
  },
  {
    "id": 40974112,
    "title": "لأغراض الإعلانات، يقوم متصفح فايرفوكس الآن بجمع بيانات المستخدم بشكل افتراضي",
    "originLink": "https://www.heise.de/en/news/For-advertising-Firefox-now-collects-user-data-by-default-9801345.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40974112",
    "commentBody": "",
    "originSummary": [
      "أحدث إصدار من فايرفوكس يجمع الآن بيانات المستخدم بشكل افتراضي، حيث يقدم ميزة الإسناد المحافِظ على الخصوصية (PPA) لقياس الإعلانات بشكل مجهول، مما أثار جدلاً.",
      "يجادل النقاد بأن جمع البيانات الافتراضي هذا يقوض ثقة المستخدمين ويشكك في نية موزيلا لتعزيز الإيرادات، مما يتحدى سمعة فايرفوكس في الخصوصية.",
      "تستخدم PPA خادم تجميع لتجميع البيانات بشكل مجهول، لكن المخاوف لا تزال قائمة بشأن مغادرة البيانات لأجهزة المستخدمين وإمكانية الوصول المستقبلي من قبل المعلنين."
    ],
    "commentSummary": [
      "بدأ Firefox في جمع بيانات المستخدمين بشكل افتراضي لأغراض إعلانية، ويمكن تعطيل ذلك في الإعدادات تحت قسم الخصوصية والأمان.",
      "أفاد المستخدمون بأن إعداد تعطيل هذه الميزة ليس من السهل العثور عليه ولا يتزامن عبر الأجهزة.",
      "يدعي المدير التقني لشركة موزيلا أن الميزة توازن بين الخصوصية وقياس الإعلانات، لكن الشكوك والانتقادات من المستخدمين لا تزال قائمة."
    ],
    "points": 522,
    "commentCount": 460,
    "retryCount": 0,
    "time": 1721112110
  },
  {
    "id": 40973339,
    "title": "إكسو: شغّل مجموعة الذكاء الاصطناعي الخاصة بك في المنزل باستخدام الأجهزة اليومية",
    "originLink": "https://github.com/exo-explore/exo",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40973339",
    "commentBody": "",
    "originSummary": [
      "تتيح Exo للمستخدمين إنشاء مجموعة ذكاء اصطناعي في المنزل باستخدام الأجهزة اليومية مثل أجهزة iPhone وiPad وAndroid وMac وأنظمة Linux، مما يلغي الحاجة إلى وحدات معالجة الرسومات NVIDIA المكلفة.",
      "تشمل الميزات الرئيسية دعمًا واسعًا للنماذج (مثل LLaMA)، وتقسيمًا ديناميكيًا للنماذج، واكتشافًا تلقائيًا للأجهزة، وواجهة برمجة تطبيقات متوافقة مع ChatGPT، وكل ذلك باستخدام اتصال نظير إلى نظير دون بنية رئيس-عامل.",
      "إكسو هو برنامج تجريبي، لذا يجب على المستخدمين توقع وجود أخطاء مبكرة ويُشجعون على الإبلاغ عن المشكلات والمساهمة في المجتمع."
    ],
    "commentSummary": [
      "إكسو تتيح للمستخدمين تشغيل مجموعات الذكاء الاصطناعي الخاصة بهم في المنزل باستخدام الأجهزة اليومية، مما يوفر بديلاً للحوسبة السحابية للذكاء الاصطناعي.",
      "يدعم المشروع أجهزة متنوعة، بما في ذلك الهواتف القديمة وأجهزة الكمبيوتر المحمولة، ويهدف إلى توفير الخصوصية والتخصيص والوصول دون اتصال لنماذج الذكاء الاصطناعي.",
      "تسلط المناقشات الضوء على الموازنة بين النماذج الذكاء الاصطناعي المحلية والسحابية، بما في ذلك التكلفة والأداء والخصوصية، حيث يفضل بعض المستخدمين الإعدادات المحلية للبيانات الشخصية أو الحساسة."
    ],
    "points": 292,
    "commentCount": 96,
    "retryCount": 0,
    "time": 1721098511
  },
  {
    "id": 40972122,
    "title": "هورايزون – بديل خاص لـ Imgur",
    "originLink": "https://horizon.pics",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40972122",
    "commentBody": "",
    "originSummary": [
      "جيمس، مهندس برمجيات متكامل يبلغ من العمر 17 عامًا من كندا، قد طور Horizon Pics، وهي خدمة استضافة ملفات تركز على الأمان والخصوصية واحتياجات المستخدم، بدون إعلانات أو بيع بيانات.",
      "مؤخرًا، قامت Horizon Pics بإعادة تسمية علامتها التجارية وأطلقت تطبيق سطح مكتب جديد يسمى Alpine، والذي يقوم بتحميل لقطات الشاشة ومحتوى الحافظة تلقائيًا، ويقدم ميزات مثل الحذف التلقائي والتشفير من طرف إلى طرف.",
      "تم بناء التطبيق باستخدام تقنيات حديثة مثل Tauri وTypeScript وSvelteKit وSass وRust، وتقدم Horizon Pics خططًا مجانية ومدفوعة بحدود تخزين متفاوتة."
    ],
    "commentSummary": [
      "تم تطوير Horizon Pics بواسطة مهندس برمجيات كامل من كندا يبلغ من العمر 17 عامًا، وهي بديل خاص لـ Imgur، حيث توفر استضافة ملفات خالية من الإعلانات وآمنة.",
      "أطلقت الخدمة مؤخرًا إعادة تسمية، بما في ذلك تطبيق سطح مكتب جديد يسمى Alpine، والذي يقوم بتحميل لقطات الشاشة والحافظة تلقائيًا مع خيارات الخصوصية.",
      "تقدم Horizon Pics خطة مجانية مع مساحة تخزين محدودة وخطة مدفوعة بحدود أعلى، بهدف جذب المستخدمين الذين يبحثون عن حلول استضافة ملفات تركز على الخصوصية."
    ],
    "points": 259,
    "commentCount": 147,
    "retryCount": 0,
    "time": 1721083536
  },
  {
    "id": 40971553,
    "title": "مافيا تسعير الأدوية",
    "originLink": "https://www.thebignewsletter.com/p/inside-the-mafia-of-pharma-pricing",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40971553",
    "commentBody": "",
    "originSummary": [
      "يكشف التقرير الجديد للجنة التجارة الفيدرالية كيف أن بعض التكتلات الصحية، التي تُشبه بالمافيا، تسيطر على 4% من جميع الأموال في الولايات المتحدة من خلال تسعير الأدوية.",
      "يُعتبر مديرو منافع الصيدلة (PBMs) لاعبين رئيسيين في تضخيم أسعار الأدوية من خلال التحكم في التسعير وتوجيه الأموال لأنفسهم.",
      "تهدف إجراءات لجنة التجارة الفيدرالية والتغييرات التشريعية المحتملة إلى معالجة احتكار تسعير الأدوية من قبل مديري منافع الصيدلة، مما أدى إلى ارتفاع التكاليف بشكل كبير."
    ],
    "commentSummary": [
      "يناقش المنشور الممارسات غير الأخلاقية في صناعة الأدوية، وخاصة تلك التي تتعلق بمديري مزايا الصيدلة (PBMs) وشركات الأدوية.",
      "تشمل القضايا الرئيسية بيع بيانات الوصفات الطبية، و\"الخصومات\" القانونية التي تعمل كرشاوى، وتأثير الحوافز المالية على التشخيصات والوصفات الطبية.",
      "تسلط المحادثة الضوء على الحاجة إلى الشفافية والتنظيم لمعالجة تشوهات السوق وحماية المرضى من السلوك غير الأخلاقي وأسعار الأدوية المرتفعة."
    ],
    "points": 245,
    "commentCount": 98,
    "retryCount": 0,
    "time": 1721078439
  },
  {
    "id": 40974193,
    "title": "دليل المهندس لتعلم الآلة العميق: فهم نموذج المحول",
    "originLink": "https://www.interdb.jp/dl/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40974193",
    "commentBody": "",
    "originSummary": [
      "يوفر الوثيقة، \"دليل المهندس لتعلم العميق\"، دليلاً شاملاً لفهم نموذج المحول، وهو اختراق كبير في مجال الذكاء الاصطناعي تم تقديمه في عام 2017.",
      "يتضمن مفاهيم أساسية عن الشبكات العصبية، والشبكات العصبية التكرارية (RNNs)، ومعالجة اللغة الطبيعية (NLP)، وآليات الانتباه، مع أمثلة على كود بايثون العامل ومراجع لمزيد من الاستكشاف.",
      "صدر في 21 مايو 2024، وهو مجاني للاستخدام التعليمي وغير التجاري، من تأليف هيرونوبو سوزوكي، مبرمج برمجيات متمرس ومتحمس للذكاء الاصطناعي."
    ],
    "commentSummary": [
      "تتناول المقالة مختلف الموارد لفهم نموذج المحول في التعلم العميق، مع تسليط الضوء على الخيارات المجانية والمدفوعة.",
      "تشمل التوصيات \"The Annotated Transformer\"، \"Transformers from Scratch\"، سلسلة Andrej Karpathy، والمقدمات البصرية لـ 3Blue1Brown.",
      "هناك نقاش حول أهمية Keras، حيث يشير بعض المستخدمين إلى تراجعها في الأوساط الأكاديمية والصناعية لصالح JAX، بينما يذكر آخرون دعم Keras 3 للعديد من الخلفيات."
    ],
    "points": 238,
    "commentCount": 28,
    "retryCount": 0,
    "time": 1721113266
  },
  {
    "id": 40977103,
    "title": "كودسترال مامبا",
    "originLink": "https://mistral.ai/news/codestral-mamba/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40977103",
    "commentBody": "",
    "originSummary": [
      "في 16 يوليو 2024، قدمت شركة Mistral AI بنية جديدة تدعى Codestral Mamba، تم تطويرها بالتعاون مع ألبرت جو وتري داو، وتوفر استدلالًا بزمن خطي وقدرة على نمذجة تسلسلات بطول غير محدود.",
      "كودسترال مامبا فعال في إنتاجية الشفرات، ويؤدي بشكل مقارن لنماذج المحولات الحديثة (SOTA)، ويدعم استرجاع السياق حتى 256 ألف رمز.",
      "يمكن نشر النموذج عبر حزم تطوير البرمجيات المختلفة، مع توفر الأوزان الخام على منصة HuggingFace، وهو مجاني بموجب ترخيص Apache 2.0، بينما يمتلك Codestral 22B تراخيص تجارية ومجتمعية."
    ],
    "commentSummary": [
      "تم إصدار نموذج جديد من Mistral.ai يسمى Codestral Mamba، وهو يثير الاهتمام بسبب معماريته وقدراته الفريدة.",
      "يدعم النموذج 256 ألف رمز سياقي ويقدم وقت استدلال خطي، مما يجعله منافسًا للنماذج القائمة على المحولات.",
      "هناك نقاش مستمر حول دمج Codestral Mamba مع بيئات التطوير مثل VS Code و IntelliJ، لكن الدعم الحالي محدود."
    ],
    "points": 229,
    "commentCount": 59,
    "retryCount": 0,
    "time": 1721141086
  },
  {
    "id": 40973422,
    "title": "بيتر بوكستن، المُبلّغ الذي كشف دراسة الزهري في توسكيجي، قد توفي",
    "originLink": "https://www.theguardian.com/us-news/article/2024/jul/15/peter-buxtun-tuskegee-whistleblower-dies",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40973422",
    "commentBody": "",
    "originSummary": [
      "بيتر بوكستن، المُبلّغ الذي كشف الدراسة غير الأخلاقية لمرض الزهري في توسكيجي، توفي عن عمر يناهز 86 عامًا.",
      "أدى كشف بوكسطن إلى إنهاء الدراسة في عام 1972، وعقد جلسات استماع في الكونغرس، وتسوية بقيمة 10 ملايين دولار للضحايا.",
      "مقارنته للدراسة بتجارب النازيين الطبية دفعت إلى وضع لوائح جديدة للأبحاث الحكومية، مما أبرز تأثيره الكبير على المعايير الأخلاقية في الأبحاث الطبية."
    ],
    "commentSummary": [
      "بيتر بوكستن، المُبلّغ الذي كشف الدراسة غير الأخلاقية لمرض الزهري في توسكيجي، قد توفي.",
      "تم تجاهل مخاوف بكسون بشأن الدراسة، التي حجبت العلاج عن الرجال الأمريكيين من أصل أفريقي المصابين بمرض الزهري، لمدة ست سنوات قبل أن تحظى بالاهتمام.",
      "لقد كان لدراسة توسكيجي تأثيرات دائمة، بما في ذلك المساهمة في التردد في تلقي اللقاحات في المجتمعات الأمريكية الأفريقية وتسليط الضوء على العنصرية النظامية في البحث الطبي."
    ],
    "points": 211,
    "commentCount": 73,
    "retryCount": 0,
    "time": 1721099843
  },
  {
    "id": 40972437,
    "title": "وهم جهاز كشف الكذب",
    "originLink": "https://lithub.com/what-the-all-american-delusion-of-the-polygraph-says-about-our-relationship-to-fact-and-fiction/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40972437",
    "commentBody": "",
    "originSummary": [
      "يستكشف جاستن سانت جيرمان الخطوط الفاصلة بين الذاكرة والمذكرات والأسطورة من خلال تجربته مع اختبار كشف الكذب أثناء تقديمه لوظيفة في الجمارك وحماية الحدود.",
      "يجادل بأن جهاز كشف الكذب، الذي يُنظر إليه غالبًا ككاشف للأكاذيب، في الواقع يخلق الحقيقة بدلاً من اكتشافها، مشبّهًا ذلك بكتابة المذكرات.",
      "يناقش جيرمان التاريخ المثير للجدل لجهاز كشف الكذب، واستخدامه في إجبار المتهمين على الاعتراف، ودوره الرمزي في تأكيد سلطة الدولة، مسلطًا الضوء على عيوبه والهوس الأمريكي بالحقيقة البسيطة والقابلة للكشف."
    ],
    "commentSummary": [
      "يروي المؤلف أنه خضع لاختبار كشف الكذب في سن التاسعة عشرة بسبب شكوك حول سرقة في العمل، رغم كونه بريئًا.",
      "تُنتقد أجهزة كشف الكذب لاستخدامها في إجبار الأشخاص على الاعتراف بدلاً من الكشف بدقة عن الأكاذيب، مما يؤدي غالبًا إلى التوتر ونتائج غير موثوقة.",
      "على الرغم من دقة نتائجها المشكوك فيها، لا تزال أجهزة كشف الكذب تُستخدم في فحص الوظائف والتحقيقات الجنائية كأداة للترهيب."
    ],
    "points": 194,
    "commentCount": 188,
    "retryCount": 0,
    "time": 1721086774
  },
  {
    "id": 40973123,
    "title": "مراجعة لنظام لينكس على جهاز Surface Pro 4",
    "originLink": "https://www.binwang.me/2024-07-12-A-Review-of-Linux-on-Surface-Pro-4.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40973123",
    "commentBody": "",
    "originSummary": [
      "قام المؤلف بتجربة تثبيت نظام لينكس على جهاز Surface Pro 4، الذي تم شراؤه في الأصل عام 2016، لاستكشاف مدى صلاحيته للاستخدامات المختلفة مثل تصفح الإنترنت، واستهلاك الوسائط، والرسم.",
      "كان تثبيت نظام لينكس سهلاً باستخدام EndeavourOS و Fedora Workstation 40، لكن كانت هناك مشاكل في وظائف الجهاز اللوحي، مثل اللمس الوهمي، وسوء رفض راحة اليد، واستنزاف كبير للبطارية أثناء وضع السكون.",
      "بسبب هذه المشكلات، عاد المؤلف إلى استخدام ويندوز 10، حيث وجده أكثر ملاءمة لاحتياجاته، ولكنه قد يعيد النظر في استخدام لينكس بعد انتهاء دعم ويندوز 10 في العام المقبل."
    ],
    "commentSummary": [
      "أثار استعراض تشغيل نظام لينكس على جهاز Surface Pro 4 نقاشًا كبيرًا، مسلطًا الضوء على تجارب المستخدمين المختلفة مع لينكس على أجهزة متنوعة.",
      "يقارن العديد من المستخدمين تجاربهم مع نظام لينكس على أجهزة أخرى، مثل Dell XPS وThinkPads، مشيرين إلى مشاكل مثل وضع السكون وإدارة الطاقة وتكامل الأجهزة.",
      "تُبرز المحادثة التحديات التي تواجه تحقيق تكامل سلس بين الأجهزة والبرمجيات على نظام لينكس، بشكل مشابه لنظام macOS على أجهزة ماك بوك، وذلك بسبب تعقيدات تطوير برامج التشغيل للأجهزة."
    ],
    "points": 187,
    "commentCount": 199,
    "retryCount": 0,
    "time": 1721095383
  },
  {
    "id": 40972134,
    "title": "كيف يلتقط صائغو المجوهرات كل ذرة من غبار الذهب؟ (2017)",
    "originLink": "https://www.ft.com/content/0512638c-b7c2-11e6-961e-a1acd97f622d",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40972134",
    "commentBody": "",
    "originSummary": [
      "يدير غاري ويليامز من شركة ماسترملت عملية حرق النفايات التجارية لاستعادة المعادن الثمينة، حيث يجمع صائغو المجوهرات كل جزيء من غبار الذهب من ورشهم لمعالجته.",
      "تتضمن العملية تسخين المواد إلى 2000 درجة مئوية لاستعادة المعادن مثل الذهب والبلاتين، مع استخدام تقنيات وتكنولوجيا متقدمة للمساعدة في التقاط المزيد من النفايات.",
      "الثقة بين صائغي المجوهرات والمصافي أمر بالغ الأهمية، وتعمل الصناعة باستمرار على تحسين الأساليب لتعظيم استعادة المعادن الثمينة."
    ],
    "commentSummary": [
      "يستخدم صائغو المجوهرات طرقًا دقيقة لالتقاط كل جزيء من غبار الذهب، بما في ذلك ترقية النوافذ، وغسيل الملابس في الموقع، وتمزيق الأرضيات.",
      "هذه الممارسات تذكرنا بالجهود التاريخية، مثل استعادة الفضة في مشروع مانهاتن من الأرضيات والمعدات.",
      "يستعيد صائغو المجوهرات في مدن مثل سيدني ونيويورك الذهب من أرضيات الورش والأرصفة، مما يبرز براعة الصناعة والحد الأدنى من فقدان المواد."
    ],
    "points": 164,
    "commentCount": 128,
    "retryCount": 0,
    "time": 1721083704
  },
  {
    "id": 40970621,
    "title": "أدوات التعاون المفتوح",
    "originLink": "https://www.typefox.io/blog/open-collaboration-tools-announcement/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40970621",
    "commentBody": "",
    "originSummary": [
      "أدوات التعاون المفتوح هي مشروع مفتوح المصدر يهدف إلى تعزيز العمل الجماعي عن بُعد من خلال المشاركة الحية لمحتويات بيئة التطوير المتكاملة (IDE).",
      "تشمل الميزات الرئيسية الإضافات لـ VS Code وEclipse Theia، وتطبيق خادم للمصادقة والتعاون، وبروتوكول مفتوح مع تشفير شامل.",
      "يعالج المشروع الفجوات في الأدوات الحالية من خلال تقديم عدم الاعتماد على بائع معين، قابلية التوسع المطلقة، خيارات النشر المرنة، وترخيص مفتوح المصدر بموجب رخصة MIT."
    ],
    "commentSummary": [
      "أدوات التعاون المفتوح من TypeFox تكتسب اهتمامًا، خاصة بين مستخدمي openvscode-server وEclipse Theia، نظرًا لإمكاناتها في تحسين التعاون عن بُعد.",
      "يتم تسليط الضوء على أدوات TypeFox، بما في ذلك Sprotty وLangium وTheia، مع تكهنات بأن Theia قد تحل محل openvscode-server إذا أوفت بوعودها.",
      "تشمل المناقشة الاهتمام بقابلية التوسع وجاهزية مزود YJS للتحرير التعاوني، والمقارنات مع طرق التعاون الأخرى مثل مشاركة الشاشة وVS Live Share."
    ],
    "points": 160,
    "commentCount": 14,
    "retryCount": 0,
    "time": 1721070733
  },
  {
    "id": 40974154,
    "title": "يقول المبلغون عن المخالفات إن شركة OpenAI منعت الموظفين بشكل غير قانوني من التحدث عن مخاطر السلامة",
    "originLink": "https://www.washingtonpost.com/technology/2024/07/13/openai-safety-risks-whistleblower-sec/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40974154",
    "commentBody": "",
    "originSummary": [
      "أبلغ المبلغون عن المخالفات في شركة OpenAI لجنة الأوراق المالية والبورصات، مدعين أن الشركة قيدت بشكل غير قانوني الموظفين من تحذير الجهات التنظيمية بشأن مخاطر تقنيتها.",
      "تدعي الشكوى أن اتفاقيات التوظيف الخاصة بـ OpenAI انتهكت القوانين الفيدرالية من خلال مطالبة الموظفين بالتنازل عن حقوق التعويض للمبلغين عن المخالفات والحصول على موافقة الشركة قبل الكشف عن المعلومات للسلطات.",
      "صرحت شركة OpenAI بأنها تدعم الإفصاحات المحمية وقامت بمراجعة سياساتها، بينما أقرت هيئة الأوراق المالية والبورصات الأمريكية (SEC) بالشكوى لكنها لم تؤكد بدء تحقيق."
    ],
    "commentSummary": [
      "يدعي المبلغون عن المخالفات أن شركة OpenAI قيدت الموظفين من مناقشة مخاطر السلامة، مما أثار مخاوف بشأن استخدام الشركة لاتفاقيات عدم الإفشاء (NDAs).",
      "يجادل النقاد بأن تركيز شركة OpenAI على \"مخاطر السلامة\" قد يكون أكثر ارتباطًا باستراتيجيات التسويق والتنظيم بدلاً من التهديدات الحقيقية، مما يشابه التكتيكات التي تستخدمها شركات التكنولوجيا الأخرى.",
      "يمتد النقاش إلى التداعيات الأخلاقية لتطوير الذكاء الاصطناعي، بما في ذلك استخدام النماذج المتحيزة والتأثير الأوسع لتنظيم الذكاء الاصطناعي."
    ],
    "points": 143,
    "commentCount": 138,
    "retryCount": 0,
    "time": 1721112701
  },
  {
    "id": 40972099,
    "title": "KUtrace: مرفق تتبع نواة لينكس منخفض التكلفة",
    "originLink": "https://github.com/dicksites/KUtrace",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40972099",
    "commentBody": "",
    "originSummary": [
      "KUtrace هو أداة تتبع لنواة لينكس منخفضة الحمل مصممة لتحليل الأداء من خلال تتبع الانتقالات بين النواة والمستخدم.",
      "يُنتج جداول زمنية مفصلة لكل نواة من وحدة المعالجة المركزية يمكن تكبيرها إلى النانوثانية، مما يساعد في حل مشكلات الأداء في مراكز البيانات والقيادة الذاتية في الوقت الفعلي.",
      "يدعم الأداة معالجات x86 و ARM، وهي مفتوحة المصدر تحت تراخيص مختلفة، وتتضمن ملفات من كتاب \"فهم ديناميكيات البرمجيات\" لريتشارد إل. سايتس."
    ],
    "commentSummary": [
      "KUtrace هو أداة تتبع لنواة لينكس ذات تكلفة منخفضة مصممة للمساعدة في فهم اختناقات الأداء، خاصة في الأنظمة متعددة الآلات.",
      "على عكس أدوات eBPF، يتطلب KUtrace تصحيحات للنواة والوصول إلى الجذر، مما يستلزم صيانة نشطة.",
      "يُشاد بالأداة لفعاليتها، مع توصيات بقراءة كتاب \"فهم ديناميكيات البرمجيات\" لمؤلفه ديك سايتس للحصول على مزيد من الأفكار حول أداء النظام."
    ],
    "points": 132,
    "commentCount": 26,
    "retryCount": 0,
    "time": 1721083310
  },
  {
    "id": 40978731,
    "title": "أنا أبدأ شركة تجمع بين الذكاء الاصطناعي والتعليم",
    "originLink": "https://twitter.com/karpathy/status/1813263734707790301",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40978731",
    "commentBody": "",
    "originSummary": [
      "أندريه كارباتي أعلن عن إطلاق شركته الجديدة، يوريكا لابز، التي تركز على دمج الذكاء الاصطناعي مع التعليم.",
      "تهدف مختبرات يوريكا إلى إنشاء مدرسة تعتمد على الذكاء الاصطناعي مصممة لإحداث ثورة في تجربة التعلم.",
      "تم الإعلان عبر تغريدة، مما أثار اهتمامًا كبيرًا في مجتمعات التكنولوجيا والتعليم."
    ],
    "commentSummary": [
      "أندريه كارباتي يؤسس شركة تجمع بين الذكاء الاصطناعي والتعليم، مما يثير نقاشات حول دور الذكاء الاصطناعي في التعليم.",
      "تختلف الآراء حول إمكانيات الذكاء الاصطناعي، حيث يجادل البعض بأنه يمكن أن يساعد المعلمين ولكنه لا يمكن أن يحل محلهم، بينما يعتقد آخرون أن الذكاء الاصطناعي يمكن أن يعزز ويخصص تجارب التعلم.",
      "تسلط المناقشة الضوء على المشهد المتطور لتكنولوجيا التعليم، مشددة على الحاجة إلى حلول مبتكرة لتحسين التدريس والتعلم."
    ],
    "points": 119,
    "commentCount": 46,
    "retryCount": 0,
    "time": 1721152655
  }
]
