[
  {
    "id": 40970560,
    "title": "Suorita CUDA, muokkaamattomana, AMD:n näytönohjaimilla",
    "originLink": "https://docs.scale-lang.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40970560",
    "commentBody": "",
    "originSummary": [
      "SCALE by Spectral Compute on GPGPU (General-Purpose computing on Graphics Processing Units) ohjelmointityökalu, joka mahdollistaa CUDA-sovellusten natiivin kääntämisen AMD:n GPU:ille ilman alkuperäisen CUDA-koodin tai rakennusjärjestelmän muokkaamista.",
      "SCALE toimii suoraan korvaavana vaihtoehtona NVIDIA:n nvcc-kääntäjälle, mahdollistaen saumattoman integroinnin olemassa olevien rakennustyökalujen ja skriptien kanssa, ja tukee erilaisia avoimen lähdekoodin CUDA-projekteja, kuten NVIDIA Thrust ja Blender Cycles.",
      "Tällä hetkellä SCALE tukee AMD:n grafiikkasuorittimia, kuten gfx1030 (Navi 21, RDNA 2.0) ja gfx1100 (Navi 31, RDNA 3.0), ja kehitystyö jatkuu uusien grafiikkasuoritinarkkitehtuurien osalta."
    ],
    "commentSummary": [
      "Keskustelu keskittyy CUDA:n (Compute Unified Device Architecture) ajamisen toteutettavuuteen ja vaikutuksiin AMD:n näytönohjaimilla, korostaen teknisiä ja oikeudellisia haasteita.",
      "Jotkut väittävät, että CUDA-käännöskerrosten tukeminen AMD:n GPU:illa on epäkäytännöllistä ja ehdottavat keskittymistä avoimen lähdekoodin projekteihin, kuten PyTorchiin.",
      "HIP (Heterogeneous-Compute Interface for Portability) mainitaan mahdollisena vähäisen vaivan ratkaisuna CUDA-koodin siirtämiseksi AMD:n GPU:ille, vaikka se ei olekaan täysin vaivaton."
    ],
    "points": 1102,
    "commentCount": 331,
    "retryCount": 0,
    "time": 1721070307
  },
  {
    "id": 40974112,
    "title": "Mainontaa varten Firefox kerää nyt käyttäjätietoja oletuksena",
    "originLink": "https://www.heise.de/en/news/For-advertising-Firefox-now-collects-user-data-by-default-9801345.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40974112",
    "commentBody": "",
    "originSummary": [
      "Firefoxin uusin versio kerää nyt oletuksena käyttäjätietoja, ja se on ottanut käyttöön yksityisyyttä säilyttävän attribuution (PPA) anonymisoitua mainosmittausta varten, mikä on herättänyt kiistaa.",
      "Kriitikot väittävät, että tämä oletusarvoinen tiedonkeruu heikentää käyttäjien luottamusta ja epäilevät Mozillan aikomusta lisätä tuloja, mikä haastaa Firefoxin maineen yksityisyyden suojelijana.",
      "Palvelun PPA käyttää aggregointipalvelinta anonymisoidakseen tiedot, mutta huolenaiheita on edelleen siitä, että tiedot poistuvat käyttäjien tietokoneilta ja mainostajat voivat mahdollisesti saada niihin pääsyn tulevaisuudessa."
    ],
    "commentSummary": [
      "Firefox on alkanut kerätä käyttäjätietoja oletuksena mainostustarkoituksiin, mikä voidaan poistaa käytöstä asetuksissa kohdassa Tietosuoja ja turvallisuus.",
      "Käyttäjät ovat raportoineet, että tämän ominaisuuden poistamisasetusta ei ole helppo löytää, eikä se synkronoidu laitteiden välillä.",
      "Mozilla CTO väittää, että ominaisuus tasapainottaa yksityisyyden ja mainosten mittaamisen, mutta käyttäjien epäilykset ja kritiikki jatkuvat."
    ],
    "points": 522,
    "commentCount": 460,
    "retryCount": 0,
    "time": 1721112110
  },
  {
    "id": 40973339,
    "title": "Exo: Aja omaa tekoälyklusteriasi kotona arkipäivän laitteilla",
    "originLink": "https://github.com/exo-explore/exo",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40973339",
    "commentBody": "",
    "originSummary": [
      "Exo mahdollistaa käyttäjien luoda tekoälyklusterin kotona käyttämällä arkipäiväisiä laitteita, kuten iPhoneja, iPadeja, Android-laitteita, Maceja ja Linux-järjestelmiä, mikä poistaa tarpeen kalliille NVIDIA GPU:ille.",
      "Keskeisiä ominaisuuksia ovat laaja mallien tuki (esim. LLaMA), dynaaminen mallien jakaminen, automaattinen laitteiden tunnistus ja ChatGPT-yhteensopiva API, kaikki vertaisverkkoa hyödyntäen ilman master-worker-arkkitehtuuria.",
      "Exo on kokeellista ohjelmistoa, joten käyttäjien tulisi odottaa alkuvaiheen virheitä ja heitä kannustetaan raportoimaan ongelmista ja osallistumaan yhteisöön."
    ],
    "commentSummary": [
      "Exo antaa käyttäjille mahdollisuuden pyörittää omia tekoälyklustereitaan kotona tavallisilla laitteilla, tarjoten vaihtoehdon pilvipohjaiselle tekoälylaskennalle.",
      "Projekti tukee erilaisia laitteistoja, mukaan lukien vanhat puhelimet ja kannettavat tietokoneet, ja sen tavoitteena on tarjota yksityisyyttä, mukautettavuutta ja offline-käyttömahdollisuuksia tekoälymalleille.",
      "Keskusteluissa korostetaan paikallisten ja pilvipohjaisten tekoälymallien välisiä kompromisseja, kuten kustannuksia, suorituskykyä ja yksityisyyttä, ja jotkut käyttäjät suosivat paikallisia ratkaisuja henkilökohtaisten tai arkaluontoisten tietojen käsittelyyn."
    ],
    "points": 292,
    "commentCount": 96,
    "retryCount": 0,
    "time": 1721098511
  },
  {
    "id": 40972122,
    "title": "Horizon – Yksityinen vaihtoehto Imgurille",
    "originLink": "https://horizon.pics",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40972122",
    "commentBody": "",
    "originSummary": [
      "James, 17-vuotias full-stack-insinööri Kanadasta, on kehittänyt Horizon Picsin, tiedostojen isännöintipalvelun, joka keskittyy turvallisuuteen, yksityisyyteen ja käyttäjien tarpeisiin ilman mainoksia tai tietojen myyntiä.",
      "Äskettäin Horizon Pics uudisti brändinsä ja lanseerasi uuden työpöytäsovelluksen nimeltä Alpine, joka automaattisesti lataa näyttökuvat ja leikepöydän sisällön, tarjoten ominaisuuksia kuten automaattinen poistaminen ja päästä päähän -salaus.",
      "Sovellus on rakennettu nykyaikaisilla teknologioilla, kuten Tauri, TypeScript, SvelteKit, Sass ja Rust, ja Horizon Pics tarjoaa sekä ilmaisia että maksullisia suunnitelmia, joissa on vaihtelevat tallennusrajat."
    ],
    "commentSummary": [
      "Horizon Pics, jonka on kehittänyt 17-vuotias full-stack-insinööri Kanadasta, on yksityinen vaihtoehto Imgurille, tarjoten mainoksetonta ja turvallista tiedostojen isännöintiä.",
      "Palvelu lanseerasi äskettäin uudelleenbrändäyksen, johon sisältyy uusi Alpine-niminen työpöytäsovellus, joka automaattisesti lataa näyttökaappaukset ja leikepöydän sisällön yksityisyysasetuksilla.",
      "Horizon Pics tarjoaa sekä ilmaisen suunnitelman, jossa on rajoitettu tallennustila, että maksullisen suunnitelman, jossa on korkeammat rajat, pyrkien houkuttelemaan käyttäjiä, jotka etsivät yksityisyyteen keskittyviä tiedostojen isännöintiratkaisuja."
    ],
    "points": 259,
    "commentCount": 147,
    "retryCount": 0,
    "time": 1721083536
  },
  {
    "id": 40971553,
    "title": "Farmaseuttisen hinnoittelun mafia",
    "originLink": "https://www.thebignewsletter.com/p/inside-the-mafia-of-pharma-pricing",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40971553",
    "commentBody": "",
    "originSummary": [
      "FTC:n uusi raportti paljastaa, kuinka muutamat terveydenhuollon konglomeraatit, joita verrataan mafiaan, hallitsevat 4 % kaikista Yhdysvaltojen rahoista lääkkeiden hinnoittelun kautta.",
      "Apteekkien etuuksien hallinnoijat (PBM:t) tunnistetaan keskeisiksi toimijoiksi, jotka nostavat lääkkeiden hintoja hallitsemalla hinnoittelua ja ohjaamalla varoja itselleen.",
      "FTC:n toimet ja mahdolliset lainsäädännön muutokset pyrkivät puuttumaan PBM-yhtiöiden lääkkeiden hinnoittelun monopolisoimiseen, mikä on johtanut huomattavasti kohonneisiin kustannuksiin."
    ],
    "commentSummary": [
      "Kirjoitus käsittelee epäeettisiä käytäntöjä lääketeollisuudessa, erityisesti apteekkien etuuksien hallinnoijien (PBM) ja lääkeyhtiöiden osalta.",
      "Keskeisiä kysymyksiä ovat reseptitietojen myynti, lailliset \"alennukset\", jotka toimivat lahjuksina, sekä taloudellisten kannustimien vaikutus lääketieteellisiin diagnooseihin ja resepteihin.",
      "Keskustelu korostaa läpinäkyvyyden ja sääntelyn tarvetta markkinavääristymien korjaamiseksi ja potilaiden suojelemiseksi epäeettiseltä toiminnalta ja paisuneilta lääkkeiden hinnoilta."
    ],
    "points": 245,
    "commentCount": 98,
    "retryCount": 0,
    "time": 1721078439
  },
  {
    "id": 40974193,
    "title": "Insinöörin opas syväoppimiseen: Transformer-mallin ymmärtäminen",
    "originLink": "https://www.interdb.jp/dl/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40974193",
    "commentBody": "",
    "originSummary": [
      "Dokumentti \"The Engineer’s Guide To Deep Learning\" tarjoaa kattavan oppaan Transformer-mallin ymmärtämiseen, joka on merkittävä tekoälyn läpimurto, joka esiteltiin vuonna 2017.",
      "Se sisältää hermoverkkojen, RNN:ien (toistuvien hermoverkkojen), NLP:n (luonnollisen kielen käsittelyn) ja huomiointimekanismien peruskäsitteet, toimivia Python-koodiesimerkkejä ja viitteitä jatkotutkimuksia varten.",
      "Julkaistu 21. toukokuuta 2024, se on ilmainen opetukselliseen ja ei-kaupalliseen käyttöön. Sen on kirjoittanut Hironobu SUZUKI, kokenut ohjelmistokehittäjä ja tekoälyharrastaja."
    ],
    "commentSummary": [
      "Postaus käsittelee erilaisia resursseja Transformer-mallin ymmärtämiseksi syväoppimisessa, korostaen ilmaisia ja maksullisia vaihtoehtoja.",
      "Suosituksiin kuuluvat \"The Annotated Transformer,\" \"Transformers from Scratch,\" Andrej Karpathyn sarja ja 3Blue1Brownin visuaaliset johdannot.",
      "On käynnissä keskustelu Kerasin merkityksestä, kun jotkut käyttäjät huomauttavat sen suosion laskusta akatemiassa ja teollisuudessa JAXin suosion kasvaessa, kun taas toiset mainitsevat Keras 3:n tuen useille taustajärjestelmille."
    ],
    "points": 238,
    "commentCount": 28,
    "retryCount": 0,
    "time": 1721113266
  },
  {
    "id": 40977103,
    "title": "Koodinen Mamba",
    "originLink": "https://mistral.ai/news/codestral-mamba/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40977103",
    "commentBody": "",
    "originSummary": [
      "Heinäkuun 16. päivänä 2024 Mistral AI esitteli Codestral Mamban, uuden arkkitehtuurin, jonka kehittivät Albert Gu ja Tri Dao. Se tarjoaa lineaarisen ajan päättelyn ja kyvyn mallintaa äärettömän pitkiä sekvenssejä.",
      "Koodistral Mamba on tehokas koodin tuottavuudessa, suoriutuu verrattavissa nykyaikaisiin (SOTA) transformer-malleihin ja tukee kontekstin mukaista hakua jopa 256k tokeniin asti.",
      "Malli on otettavissa käyttöön eri SDK:iden kautta, ja sen raakapainot ovat saatavilla HuggingFacessa. Se on ilmainen Apache 2.0 -lisenssillä, kun taas Codestral 22B:llä on kaupalliset ja yhteisölisenssit."
    ],
    "commentSummary": [
      "Koodistral Mamba, Mistral.ai:n uusi malli, on julkaistu ja herättää kiinnostusta ainutlaatuisen arkkitehtuurinsa ja ominaisuuksiensa ansiosta.",
      "Malli tukee 256k kontekstimerkkiä ja tarjoaa lineaarisen päättelyajan, mikä tekee siitä kilpailukykyisen transformer-pohjaisten mallien kanssa.",
      "On käynnissä keskustelu Codestral Mamban integroimisesta kehitysympäristöihin, kuten VS Code ja IntelliJ, mutta nykyinen tuki on rajallinen."
    ],
    "points": 229,
    "commentCount": 59,
    "retryCount": 0,
    "time": 1721141086
  },
  {
    "id": 40973422,
    "title": "Peter Buxtun, ilmiantaja, joka paljasti Tuskegeen kuppatutkimuksen, on kuollut",
    "originLink": "https://www.theguardian.com/us-news/article/2024/jul/15/peter-buxtun-tuskegee-whistleblower-dies",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40973422",
    "commentBody": "",
    "originSummary": [
      "Peter Buxtun, ilmiantaja, joka paljasti epäeettisen Tuskegeen kuppatutkimuksen, on kuollut 86-vuotiaana.",
      "Buxtunin paljastus johti tutkimuksen lopettamiseen vuonna 1972, kongressin kuulemistilaisuuksiin ja 10 miljoonan dollarin korvaukseen uhreille.",
      "Hänen vertauksensa tutkimuksesta natsien lääketieteellisiin kokeisiin johti uusiin hallituksen tutkimussäädöksiin, korostaen hänen merkittävää vaikutustaan lääketieteellisen tutkimuksen eettisiin standardeihin."
    ],
    "commentSummary": [
      "Peter Buxtun, ilmiantaja, joka paljasti epäeettisen Tuskegeen kuppatutkimuksen, on menehtynyt.",
      "Buxtunin huolenaiheet tutkimuksesta, joka pidätti hoidon afroamerikkalaisilta miehiltä, joilla oli kuppa, jätettiin huomiotta kuuden vuoden ajan ennen kuin ne saivat huomiota.",
      "Tuskegeen tutkimuksella on ollut pitkäkestoisia vaikutuksia, mukaan lukien rokote-epäröinnin lisääntyminen afroamerikkalaisissa yhteisöissä ja systeemisen rasismin korostaminen lääketieteellisessä tutkimuksessa."
    ],
    "points": 211,
    "commentCount": 73,
    "retryCount": 0,
    "time": 1721099843
  },
  {
    "id": 40972437,
    "title": "Valheenpaljastimen harha",
    "originLink": "https://lithub.com/what-the-all-american-delusion-of-the-polygraph-says-about-our-relationship-to-fact-and-fiction/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40972437",
    "commentBody": "",
    "originSummary": [
      "Justin St. Germain tutkii muistin, muistelman ja myytin hämärtyneitä rajoja kokemuksensa kautta valheenpaljastustestistä työhakemuksen yhteydessä Tullissa ja Rajavartiolaitoksessa.",
      "Hän väittää, että polygrafi, jota usein pidetään valheenpaljastimena, itse asiassa luo totuuden sen sijaan, että se havaitsee sen, ja vertaa tätä muistelmakirjoittamiseen.",
      "Germain keskustelee valheenpaljastuskoneen kiistanalaisesta historiasta, sen käytöstä tunnustusten pakottamisessa ja sen symbolisesta roolista valtion vallan ilmentäjänä, korostaen sen puutteita ja amerikkalaisten pakkomiellettä yksinkertaisesta, havaittavasta totuudesta."
    ],
    "commentSummary": [
      "Kirjoittaja kertoo käyneensä läpi valheenpaljastustestin yhdeksäntoistavuotiaana työpaikalla tapahtuneiden varkausepäilyjen vuoksi, vaikka oli syytön.",
      "Polygrafeja kritisoidaan niiden käytöstä tunnustusten pakottamisessa sen sijaan, että ne tarkasti havaitsevat valheita, mikä usein johtaa stressiin ja epäluotettaviin tuloksiin.",
      "Huolimatta niiden kyseenalaisesta tarkkuudesta, valheenpaljastuskokeita käytetään edelleen työhaastatteluissa ja rikostutkinnoissa pelotteluvälineenä."
    ],
    "points": 194,
    "commentCount": 188,
    "retryCount": 0,
    "time": 1721086774
  },
  {
    "id": 40973123,
    "title": "Arvostelu: Linux Surface Pro 4:llä",
    "originLink": "https://www.binwang.me/2024-07-12-A-Review-of-Linux-on-Surface-Pro-4.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40973123",
    "commentBody": "",
    "originSummary": [
      "Kirjoittaja kokeili Linuxin asentamista Surface Pro 4:ään, joka oli alun perin ostettu vuonna 2016, tutkiakseen sen käyttökelpoisuutta erilaisiin käyttötarkoituksiin, kuten internetin selaamiseen, median kulutukseen ja luonnosteluun.",
      "Asennus Linuxille oli suoraviivaista käyttäen EndeavourOS:ää ja Fedora Workstation 40:ää, mutta tablettitoiminnallisuus oli ongelmallista, kuten haamukosketukset, huono kämmentunnistus ja merkittävä akun kuluminen lepotilassa.",
      "Näiden ongelmien vuoksi kirjoittaja palasi Windows 10:een, koska se oli heidän tarpeisiinsa toimivampi, mutta saattaa harkita Linuxia uudelleen Windows 10:n elinkaaren päättyessä ensi vuonna."
    ],
    "commentSummary": [
      "Arvostelu Linuxin käytöstä Surface Pro 4:llä on herättänyt merkittävää keskustelua, tuoden esiin erilaisia käyttäjäkokemuksia Linuxin käytöstä eri laitteistoilla.",
      "Monet käyttäjät vertaavat kokemuksiaan Linuxista muilla laitteilla, kuten Dell XPS:llä ja ThinkPadeilla, huomioiden ongelmia kuten lepotila, virranhallinta ja laitteiston integrointi.",
      "Keskustelu korostaa haasteita, jotka liittyvät saumattoman laitteisto-ohjelmistointegraation saavuttamiseen Linuxissa, vastaavasti kuin macOS MacBookeissa, johtuen laiteajurien kehittämisen monimutkaisuudesta."
    ],
    "points": 187,
    "commentCount": 199,
    "retryCount": 0,
    "time": 1721095383
  },
  {
    "id": 40972134,
    "title": "Miten kultasepät keräävät jokaisen kultapölyhiukkasen? (2017)",
    "originLink": "https://www.ft.com/content/0512638c-b7c2-11e6-961e-a1acd97f622d",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40972134",
    "commentBody": "",
    "originSummary": [
      "Gary Williams Mastermeltistä hallinnoi kaupallisen jätteen polttamista arvometallien talteen ottamiseksi, ja kultasepät keräävät työpajoistaan jokaisen kultapölyhiukkasen käsittelyä varten.",
      "Prosessi sisältää materiaalien kuumentamisen 2000 asteeseen metallien, kuten kullan ja platinan, talteenottamiseksi, ja edistyneet tekniikat ja teknologia auttavat keräämään enemmän jätettä.",
      "Luottamus jalokivikauppiaiden ja jalostajien välillä on ratkaisevan tärkeää, ja ala kehittää jatkuvasti menetelmiä jalometallien talteenoton maksimoimiseksi."
    ],
    "commentSummary": [
      "Jalokivikauppiaat käyttävät tarkkoja menetelmiä vangitakseen jokaisen kultapölyhiukkasen, mukaan lukien ikkunoiden päivittäminen, paikan päällä tapahtuva pyykinpesu ja lattioiden repiminen.",
      "Nämä käytännöt muistuttavat historiallisia ponnisteluja, kuten Manhattan-projektin hopean talteenottoa lattioilta ja laitteista.",
      "Jalokivikauppiaat kaupungeissa kuten Sydney ja New York keräävät kultaa työpajojen lattioilta ja jalkakäytäviltä, korostaen alan kekseliäisyyttä ja vähäistä materiaalihukkaa."
    ],
    "points": 164,
    "commentCount": 128,
    "retryCount": 0,
    "time": 1721083704
  },
  {
    "id": 40970621,
    "title": "Avointen yhteistyövälineiden työkalut",
    "originLink": "https://www.typefox.io/blog/open-collaboration-tools-announcement/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40970621",
    "commentBody": "",
    "originSummary": [
      "Avoimen yhteistyön työkalut on avoimen lähdekoodin projekti, jonka tavoitteena on parantaa etätyöskentelyä jakamalla Integroitu Kehitysympäristö (IDE) sisältöjä reaaliajassa.",
      "Keskeisiä ominaisuuksia ovat laajennukset VS Code- ja Eclipse Theia -sovelluksille, palvelinsovellus todennusta ja yhteistyötä varten sekä avoin protokolla päästä päähän -salausta käyttäen.",
      "Projekti paikkaa olemassa olevien työkalujen puutteita tarjoamalla ei vendor lock-inia, täydellistä laajennettavuutta, joustavia käyttöönotto vaihtoehtoja ja avoimen lähdekoodin lisensoinnin MIT-lisenssin alaisuudessa."
    ],
    "commentSummary": [
      "Avoimen yhteistyön työkalut TypeFoxilta saavat huomiota, erityisesti openvscode-serverin ja Eclipse Theian käyttäjien keskuudessa, niiden potentiaalin vuoksi parantaa etäyhteistyötä.",
      "TypeFoxin työkalut, mukaan lukien Sprotty, Langium ja Theia, ovat esillä, ja spekulaatioiden mukaan Theia saattaa korvata openvscode-serverin, jos se täyttää lupauksensa.",
      "Keskustelussa käsitellään kiinnostusta YJS-palveluntarjoajan skaalautuvuuteen ja valmiuteen yhteismuokkaukseen sekä vertailuja muihin yhteistyömenetelmiin, kuten näytön jakamiseen ja VS Live Shareen."
    ],
    "points": 160,
    "commentCount": 14,
    "retryCount": 0,
    "time": 1721070733
  },
  {
    "id": 40974154,
    "title": "OpenAI esti laittomasti henkilöstöä tuomasta esiin turvallisuusriskejä, ilmiantajat sanovat",
    "originLink": "https://www.washingtonpost.com/technology/2024/07/13/openai-safety-risks-whistleblower-sec/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40974154",
    "commentBody": "",
    "originSummary": [
      "OpenAI:n ilmiantajat ovat tehneet valituksen SEC:lle, väittäen, että yhtiö on laittomasti estänyt työntekijöitä varoittamasta viranomaisia sen teknologian riskeistä.",
      "Valitus väittää, että OpenAI:n työsopimukset rikkoivat liittovaltion lakeja vaatimalla henkilöstöä luopumaan ilmiantajien korvausoikeuksista ja hakemaan yhtiön suostumusta ennen tietojen paljastamista viranomaisille.",
      "OpenAI on ilmoittanut tukevansa suojattuja paljastuksia ja tarkistanut käytäntöjään, kun taas SEC on myöntänyt vastaanottaneensa valituksen, mutta ei ole vahvistanut tutkintaa."
    ],
    "commentSummary": [
      "Ilmiantajat väittävät, että OpenAI rajoitti henkilöstöä keskustelemasta turvallisuusriskeistä, mikä herättää huolta yrityksen salassapitosopimusten (NDA) käytöstä.",
      "Kriitikot väittävät, että OpenAI:n korostus \"turvariskeistä\" saattaa liittyä enemmän markkinointi- ja sääntelystrategioihin kuin todellisiin uhkiin, mikä muistuttaa muiden teknologiayritysten käyttämiä taktiikoita.",
      "Väittely ulottuu tekoälyn kehittämisen eettisiin vaikutuksiin, mukaan lukien puolueellisten mallien käyttö ja tekoälyn sääntelyn laajempi vaikutus."
    ],
    "points": 143,
    "commentCount": 138,
    "retryCount": 0,
    "time": 1721112701
  },
  {
    "id": 40972099,
    "title": "KUtrace: Pieni kuormitus Linux-ytimen jäljitysjärjestelmä",
    "originLink": "https://github.com/dicksites/KUtrace",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40972099",
    "commentBody": "",
    "originSummary": [
      "KUtrace on vähäisen kuormituksen Linux-ytimen jäljitystyökalu, joka on suunniteltu analysoimaan suorituskykyä seuraamalla ytimen ja käyttäjän välisiä siirtymiä.",
      "Se tuottaa yksityiskohtaisia per-CPU-ytimen aikajanoja, joita voidaan zoomata nanosekunnin tarkkuudella, mikä auttaa ratkaisemaan suorituskykyongelmia datakeskuksissa ja reaaliaikaisessa autonomisessa ajamisessa.",
      "Työkalu tukee x86- ja ARM-prosessoreita, on avoimen lähdekoodin eri lisenssien alaisuudessa ja sisältää tiedostoja Richard L. Sitesin kirjasta \"Understanding Software Dynamics\"."
    ],
    "commentSummary": [
      "KUtrace on vähäisen ylikuormituksen Linux-ytimen jäljitystoiminto, joka on suunniteltu auttamaan suorituskyvyn pullonkaulojen ymmärtämisessä, erityisesti monikonejärjestelmissä.",
      "Toisin kuin eBPF-työkalut, KUtrace vaatii kernelin korjauksia ja pääkäyttäjän oikeuksia, mikä edellyttää aktiivista ylläpitoa.",
      "Työkalua kiitetään sen tehokkuudesta, ja sen tekijä Dick Sites suosittelee kirjaa \"Understanding Software Dynamics\" lisätietojen saamiseksi järjestelmän suorituskyvystä."
    ],
    "points": 132,
    "commentCount": 26,
    "retryCount": 0,
    "time": 1721083310
  },
  {
    "id": 40978731,
    "title": "Aloitan tekoäly+opetusyrityksen",
    "originLink": "https://twitter.com/karpathy/status/1813263734707790301",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40978731",
    "commentBody": "",
    "originSummary": [
      "Andrej Karpathy on ilmoittanut uuden yrityksensä, Eureka Labsin, lanseerauksesta, joka keskittyy tekoälyn integroimiseen koulutukseen.",
      "Eureka Labs pyrkii luomaan tekoälyyn perustuvan koulun, joka on suunniteltu mullistamaan oppimiskokemus.",
      "Ilmoitus tehtiin twiitin välityksellä, mikä herätti suurta kiinnostusta teknologia- ja koulutusyhteisöissä."
    ],
    "commentSummary": [
      "Andrej Karpathy on perustamassa tekoäly+opetus-yritystä, mikä herättää keskusteluja tekoälyn roolista opetuksessa.",
      "Mielipiteet vaihtelevat tekoälyn potentiaalista; jotkut väittävät, että se voi auttaa mutta ei korvata opettajia, kun taas toiset uskovat, että tekoäly voi parantaa ja yksilöidä oppimiskokemuksia.",
      "Väittely korostaa opetusteknologian kehittyvää maisemaa, painottaen innovatiivisten ratkaisujen tarvetta opetuksen ja oppimisen parantamiseksi."
    ],
    "points": 119,
    "commentCount": 46,
    "retryCount": 0,
    "time": 1721152655
  }
]
