[
  {
    "title": "인하우스카운슬포럼, '주니어 사내변호사 네트워킹' 행사 ( - No translation provided)",
    "originLink": "https://www.lawtimes.co.kr/news/193211",
    "originBody": "",
    "originSummary": [
      "IHCF, the largest in-house lawyer organization in South Korea, hosted a networking event for junior in-house lawyers in Seoul on November 9th, promoting collaboration and networking opportunities.",
      "The event, attended by around 70 members and sponsored lawyers, aimed to foster relationships among junior in-house lawyers.",
      "IHCF, founded in 1999, plans to continue supporting networking and collaboration among its 2,100+ members through future events and programs such as academic seminars and mentorship programs."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700054234657
  },
  {
    "title": "리버네트워크와 큐냅(QNAP)은 'QNAPer만을 위한 블랙프라이데이'를 진행하며 최대 40% 할인을 제공합니다. 11월 16일부터 30일까지 진행되며, NAS 및 DAS 제품, 네트워크 주변장치 및 Seagate HDD 번들에 할인이 적용됩니다. 인기 있는 TS-x64 시리즈도 할인 이벤트에 포함되어 높은 성능을 제공하는 이 제품을 사용하는 고객들에게 다양한 혜택을 제공할 것이라 했습니다.",
    "originLink": "https://www.bodnara.co.kr/bbs/article.html?num=190258",
    "originBody": "",
    "originSummary": [
      "Rivernet Network, a South Korean distributor, is partnering with QNAP to host a Black Friday event offering discounts of up to 40% on QNAP products.",
      "The event will run from November 16th to November 30th and will feature discounts on NAS and DAS products, network peripherals, and Seagate HDD bundles.",
      "The popular TS-x64 series, known for its high-performance capabilities, will be among the highlights of the event, catering to power users and small businesses."
    ],
    "commentBody": "",
    "commentSummary": [
      "-"
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700054234657
  },
  {
    "title": "한진, 12월 '언박싱데이' 개최…“이커머스 셀러 교류의 장”",
    "originLink": "https://www.newstong.co.kr/view3.aspx?seq=12200949&allSeq=8&txtSearch=&cate=0&cnt=-5&subCate=2&order=default&newsNo=19",
    "originBody": "",
    "originSummary": [
      "한진은 12월에 \"언박싱 데이\" 행사를 개최하여 전자상거래 판매자 고객들에게 인사이트와 지원을 제공할 예정입니다.",
      "행사는 마케팅, 브랜딩, 라이브 커머스와 같은 다양한 분야의 연설과 프로그램을 특징으로 합니다.",
      "회사는 고객과의 성장과 협력을 증진하기 위해 이 행사를 개최하고자 합니다."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700054234657
  },
  {
    "title": "블록체인 개발팀 래티스가 옵티미즘 기반의 대체 데이터 가용성 네트워크 '레드스톤'을 공개했다.",
    "originLink": "https://www.tokenpost.kr/article-152577",
    "originBody": "",
    "originSummary": [
      "-'몇몇 대형 출판사들은 IPFS 게이트웨이를 운영하는 자원봉사자들에게 수만 건의 DMCA 고지를 발송하고 있으며, 이들은 이러한 자원봉사자들이 콘텐츠를 제어하거나 삭제할 수 없다는 사실을 이미 알고 있음에도 불구하고 이러한 행동을 이어나가고 있습니다.",
      "-'압력으로 인해 한 공개 게이트웨이 운영자는 서비스를 중단하기도 했는데, 이는 IPFS가 검열에 대해 강건하다는 점은 있지만 저작권 관련 불만에 의한 자기 검열에 대해서는 민감할 수 있음을 보여줍니다.",
      "-'DMCA 고지는 이들 게이트웨이 운영자 대신 호스트에게 제출되며, 이는 자원봉사자들과 관련없는 수천 개의 URL을 삭제하기 위한 것입니다."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700054234657
  },
  {
    "title": "HawaExpo, 2024년 3월 베트남 최대 가구 박람회, 글로벌 바이어 초청",
    "originLink": "http://www.hwtimes.co.kr/36462",
    "originBody": "",
    "originSummary": [
      "HawaExpo, Vietnam's biggest furniture fair, will be held from March 6th to 9th, 2024.",
      "The fair aims to promote Vietnam's furniture industry and facilitate business partnerships.",
      "There will be over 700 furniture companies, including new exhibitors, providing exclusive benefits for buyers and visitors, along with networking opportunities."
    ],
    "commentBody": "",
    "commentSummary": [
      "제공된 정보가 없으므로 내용을 요약할 수 없습니다.",
      "\"Unknown information or content is missing.\"은 아무런 의미가 없는 에러 메시지입니다.",
      "정보나 내용이 없으므로 \"\"로 처리됩니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700054234657
  },
  {
    "title": "젊은 전문가들을 위한 상공회의소 함께 만나 네트워킹 장려하는 박람회 개최",
    "originLink": "https://www.dakotanewsnow.com/2023/11/14/chamber-commerce-mixer-encourages-networking-among-young-professionals/",
    "originBody": "",
    "originSummary": [
      "대 수폴스 상공회의소에서는 젊은 전문가들을 위한 휴일 페어 & 혼합기(음료 및 안주 판매)를 개최합니다.",
      "이 이벤트는 11월 21일에 수폴스의 디스트릭트에서 무료로 열릴 예정입니다.",
      "참석자들은 커뮤니티 내에서 네트워킹하고 연결을 만들 수 있는 기회를 가질 수 있습니다."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700054234657
  }
]
