[
  {
    "id": 40620056,
    "title": "Terapia gênica restaura a audição em crianças com surdez hereditária",
    "originLink": "https://cosmosmagazine.com/science/biology/gene-therapy-restores-hearing-to-children-with-inherited-deafness/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40620056",
    "commentBody": "",
    "originSummary": [
      "Um estudo clínico restaurou com sucesso a audição de cinco crianças com surdez hereditária usando terapia gênica, especificamente fornecendo cópias funcionais do gene OTOF por meio do vírus adeno-associado (AAV).",
      "Foram observadas melhoras significativas na audição, na percepção da fala e na localização do som, e duas crianças desenvolveram uma apreciação pela música.",
      "Publicado na Nature Medicine, o estudo ressalta o potencial dessa abordagem e defende a realização de estudos internacionais maiores, observando a segurança e a eficácia da terapia, apesar de eventos adversos menores."
    ],
    "commentSummary": [
      "A terapia gênica restaurou a audição de crianças com surdez hereditária por meio da injeção de um vírus adeno-associado contendo genes OTOF funcionais em seus ouvidos internos, garantindo a expressão gênica a longo prazo.",
      "A discussão explora o potencial das tecnologias de edição de genes, como a CRISPR, para modificações humanas radicais e as implicações éticas de priorizar a engenharia genética cosmética em detrimento das aplicações médicas.",
      "São levantadas preocupações éticas sobre o uso da terapia genética para erradicar a surdez hereditária em crianças, com foco no consentimento e nas controvérsias dentro da comunidade surda sobre os implantes cocleares."
    ],
    "points": 464,
    "commentCount": 189,
    "retryCount": 0,
    "time": 1717879216
  },
  {
    "id": 40622704,
    "title": "Piku: Simplificando as implantações do Git Push para servidores pessoais em vários idiomas",
    "originLink": "https://github.com/piku/piku",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40622704",
    "commentBody": "",
    "originSummary": [
      "O Piku, inspirado no Dokku, facilita as implantações do git push em servidores pessoais, oferecendo suporte a um fluxo de trabalho semelhante ao do Heroku para várias linguagens de programação (Python, Node, Go, Java, Clojure, Ruby).",
      "Ele pode implementar, gerenciar e dimensionar vários aplicativos em arquiteturas ARM e Intel, compatível com qualquer provedor de nuvem ou configuração bare metal usando Python, nginx e uwsgi.",
      "O Piku é estável, tem manutenção ativa e foi projetado para dispositivos de baixo custo, amadores e uso educacional, enfatizando o mínimo de dependências, simplicidade e compatibilidade."
    ],
    "commentSummary": [
      "A discussão destaca o Piku, uma ferramenta minimalista para implementações push do Git em servidores pessoais, comparando-o ao Heroku, Dokku e Kubernetes por sua simplicidade e facilidade de uso.",
      "Um tutorial para o Piku, elogiado por sua clareza, agora faz parte da organização oficial do Piku no GitHub, com planos para mais aprimoramentos.",
      "Os usuários discutem várias configurações de implantação, incluindo systemd nspawn para sandboxing e NixOS para estabilidade, e abordam preocupações sobre gerenciamento de dependências, segurança e sobrecarga do Docker, favorecendo soluções de PaaS leves e personalizáveis."
    ],
    "points": 440,
    "commentCount": 115,
    "retryCount": 0,
    "time": 1717918825
  },
  {
    "id": 40620739,
    "title": "O Viagra se mostra promissor na melhora do fluxo sanguíneo cerebral para prevenir a demência",
    "originLink": "https://www.ox.ac.uk/news/2024-06-07-sildenafil-viagra-improves-brain-blood-flow-and-could-help-prevent-dementia",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40620739",
    "commentBody": "",
    "originSummary": [
      "Um estudo da Universidade de Oxford publicado na Circulation Research indica que o sildenafil (Viagra) melhora o fluxo sanguíneo e a função cerebral em pacientes com risco de demência vascular.",
      "O estudo OxHARP, um estudo duplo-cego e controlado por placebo com 75 participantes, constatou que o sildenafil melhora a função cerebrovascular com menos efeitos colaterais em comparação com o cilostazol.",
      "Essas descobertas sugerem o potencial do sildenafil na prevenção da demência vascular, o que suscita a necessidade de estudos em maior escala."
    ],
    "commentSummary": [
      "Um estudo recente sugere que o Viagra, inicialmente usado para problemas cardiovasculares e disfunção erétil (DE), pode melhorar o fluxo sanguíneo cerebral e ajudar a prevenir a demência.",
      "Os usuários relatam efeitos colaterais variados, como dores de cabeça, náuseas e congestão nasal, que geralmente diminuem com o tempo, e enfatizam a necessidade de estimulação sexual para que a droga funcione.",
      "A discussão abrange benefícios mais amplos para a saúde, a imprevisibilidade da pesquisa de medicamentos e a necessidade de estudos rigorosos para confirmar os benefícios para doenças como Alzheimer e demência vascular."
    ],
    "points": 346,
    "commentCount": 236,
    "retryCount": 0,
    "time": 1717887313
  },
  {
    "id": 40620472,
    "title": "Desenhe seu próprio iceberg e veja-o flutuar com o jogo 'Iceberger'",
    "originLink": "https://joshdata.me/iceberger.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40620472",
    "commentBody": "",
    "originSummary": [
      "\"Iceberger\" é um jogo desenvolvido por @joshdata, inspirado em um tweet de @GlacialMeg, que permite aos usuários desenhar um iceberg e visualizar sua orientação flutuante.",
      "O jogo simula a distribuição tridimensional da massa e a densidade relativa do iceberg, fatores essenciais para determinar sua orientação estável.",
      "A inspiração veio da solicitação de Megan Thompson-Munson para que os cientistas retratassem os icebergs em suas orientações estáveis, destacadas por sua pintura em aquarela."
    ],
    "commentSummary": [
      "Uma ferramenta da Web no Hacker News permite que os usuários desenhem um iceberg e observem seu comportamento flutuante, gerando uma discussão sobre experiências e percepções dos usuários.",
      "Os usuários fazem experiências com diferentes formas, como estrelas e triângulos, para ver resultados flutuantes variados, compartilhando exemplos e sugestões de melhorias.",
      "A ferramenta é elogiada por seu valor educativo e simplicidade, embora alguns usuários expressem frustração com as restrições do Twitter em relação à visualização de tópicos sem uma conta."
    ],
    "points": 276,
    "commentCount": 44,
    "retryCount": 0,
    "time": 1717884264
  },
  {
    "id": 40623843,
    "title": "Matt Stoller expõe os monopólios ocultos que estão drenando a economia",
    "originLink": "https://www.thebignewsletter.com/p/economic-termites-are-everywhere",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40623843",
    "commentBody": "",
    "originSummary": [
      "O artigo \"Economic Termites Are Everywhere\", de Matt Stoller, examina os efeitos prejudiciais dos monopólios de pequena escala na economia, principalmente em setores como construção, software e gases industriais.",
      "Empresas como Verisign, Autodesk e LinkedIn são citadas por usarem seu poder de mercado para inflacionar os preços e impedir a concorrência, destacando a necessidade de uma fiscalização antitruste mais forte.",
      "Stoller defende reformas legais e regulatórias para lidar com essas práticas monopolistas e restaurar o comércio justo e a democracia."
    ],
    "commentSummary": [
      "O artigo critica as métricas econômicas tradicionais por não refletirem as disparidades socioeconômicas e o aumento do custo de vida, defendendo uma reavaliação do entendimento econômico.",
      "Ele destaca questões como a decadência rural, o aumento dos custos essenciais, a desigualdade econômica e a disparidade entre o sentimento público e os dados estatísticos que refletem a realidade econômica.",
      "A discussão inclui críticas a questões econômicas dos EUA, como acesso à saúde, desertos alimentares e políticas habitacionais restritivas, exigindo maior transparência, regulamentação e políticas antitruste mais fortes para proteger os consumidores."
    ],
    "points": 274,
    "commentCount": 237,
    "retryCount": 0,
    "time": 1717934252
  },
  {
    "id": 40624924,
    "title": "Ruxandra Teslo defende a presença de \"nerds estranhos\" na academia em meio à reação a Karikó",
    "originLink": "https://www.writingruxandrabio.com/p/the-weird-nerd-comes-with-trade-offs",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40624924",
    "commentBody": "",
    "originSummary": [
      "A postagem de Ruxandra Teslo no Substack critica a reação contra Katalin Karikó, co-inventora da tecnologia de mRNA, por suas críticas à dinâmica política e social da academia.",
      "Teslo argumenta que a academia subestima os \"Nerds Esquisitos\" intelectualmente criativos, como Karikó, que geralmente não têm as habilidades interpessoais e políticas necessárias para o sucesso acadêmico, sugerindo que a Internet é um ambiente melhor para esses indivíduos.",
      "A postagem pede uma reavaliação de como o capital humano é valorizado nos campos científico e cultural, enfatizando a necessidade de normas explícitas pró-Weird Nerd para aproveitar seu potencial e lidar com a crise atual da academia, incluindo o declínio da confiança pública."
    ],
    "commentSummary": [
      "A discussão examina as complexidades de ser um \"nerd esquisito\", concentrando-se nas compensações do interesse intenso em áreas específicas e as deficiências resultantes em outros aspectos da vida.",
      "Ele desafia os estereótipos que associam esse comportamento ao autismo, atribuindo-o, em vez disso, a uma paixão profunda, e critica a medicalização dos traços de personalidade e a categorização da neurodiversidade.",
      "O texto destaca o papel dos \"nerds esquisitos\" nas inovações tecnológicas, a importância do trabalho em equipe e a evolução da percepção de termos como \"nerd\" e \"gênio\", além de abordar os desafios enfrentados por indivíduos neurodivergentes em ambientes profissionais."
    ],
    "points": 194,
    "commentCount": 197,
    "retryCount": 0,
    "time": 1717945610
  },
  {
    "id": 40620955,
    "title": "Revolucionando modelos de linguagem: Abordagem sem MatMul reduz o uso de memória em mais de 10 vezes",
    "originLink": "https://arxiv.org/abs/2406.02528",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40620955",
    "commentBody": "",
    "originSummary": [
      "O artigo \"Scalable MatMul-free Language Modeling\", de Rui-Jie Zhu et al., investiga a remoção de operações de multiplicação de matrizes (MatMul) em modelos de linguagem grandes (LLMs) para reduzir os custos de computação.",
      "Os autores demonstram que seus modelos sem MatMul mantêm um bom desempenho em escalas de bilhões de parâmetros, comparáveis aos Transformers de última geração, enquanto reduzem significativamente o uso de memória durante a inferência e o treinamento.",
      "Eles oferecem uma implementação eficiente de GPU que reduz o consumo de memória em até 61%, um kernel otimizado que o reduz em mais de 10 vezes e uma solução de hardware FPGA personalizada para aumentar a eficiência, obtendo um poder de processamento semelhante ao do cérebro."
    ],
    "commentSummary": [
      "O artigo \"Scalable MatMul-Free Language Modeling\" apresenta uma nova abordagem para modelos de linguagem usando pesos ternários e treinamento com reconhecimento de quantização (QAT) para aumentar a eficiência.",
      "O método emprega núcleos otimizados e fundidos com o Triton, reduzindo o ajuste excessivo e o uso de memória, e incorpora um transformador linear para minimizar as multiplicações no mecanismo de atenção.",
      "A implementação mostra uma economia significativa de memória, é compatível com os transformadores Huggingface e inclui um núcleo FPGA programado com um montador personalizado, indicando potencial para o desenvolvimento futuro de ASIC."
    ],
    "points": 168,
    "commentCount": 26,
    "retryCount": 0,
    "time": 1717891248
  },
  {
    "id": 40621611,
    "title": "Mozilla bloqueia add-ons anti-censura na Rússia sem notificação",
    "originLink": "https://discourse.mozilla.org/t/the-censorship-circumvention-extension-has-disappeared-from-the-russian-version-of-mozilla-addons/130914",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40621611",
    "commentBody": "",
    "originSummary": [
      "O complemento Censor Tracker 158, que ajuda a contornar a censura na Rússia, tornou-se inacessível no país sem aviso prévio ou alterações nas configurações.",
      "Os usuários russos que tentam acessar o complemento recebem uma mensagem indicando que a página não está disponível em sua região.",
      "O desenvolvedor está buscando esclarecimentos sobre se esse bloqueio se deve a uma solicitação das autoridades russas ou a uma decisão tomada pela Mozilla."
    ],
    "commentSummary": [
      "A Mozilla proibiu dois complementos anticensura na Rússia, gerando controvérsia e dividindo os usuários em questões de censura e políticas de plataforma.",
      "O desenvolvedor do \"Runet Censorship Bypass\" não foi notificado, e os usuários debatem se as ações da Mozilla são justificadas ou se constituem censura.",
      "A situação destaca preocupações mais amplas sobre o controle do usuário, práticas éticas e pressões geopolíticas, com alguns usuários explorando navegadores alternativos como o Vivaldi e o Orion da Kagi."
    ],
    "points": 160,
    "commentCount": 88,
    "retryCount": 0,
    "time": 1717900347
  },
  {
    "id": 40620048,
    "title": "Explorando a linha tênue entre jogos de azar e seguros: Perspectivas históricas e econômicas",
    "originLink": "https://www.bbc.com/news/business-38905963",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40620048",
    "commentBody": "",
    "originSummary": [
      "O artigo de Tim Harford examina as diferenças entre jogos de azar e seguros, destacando suas percepções jurídicas e culturais distintas, apesar de ambos envolverem apostas financeiras em eventos incertos.",
      "O contexto histórico inclui as primeiras práticas de seguro na Babilônia e na China, a evolução do Lloyd's de Londres de uma casa de café para um mercado formal de seguros e as sociedades de ajuda mútua nos Alpes.",
      "A importância econômica do seguro é ressaltada por exemplos como o seguro agrícola em Gana, e o artigo conclui discutindo os derivativos financeiros e seu papel na crise financeira de 2007."
    ],
    "commentSummary": [
      "O artigo contrasta os impactos do seguro e do jogo na segurança financeira e no bem-estar da sociedade, enfatizando que o seguro reduz os riscos, enquanto o jogo os aumenta.",
      "Os pontos principais incluem os princípios econômicos de utilidade, a utilidade marginal decrescente do dinheiro e os aspectos éticos dos produtos financeiros.",
      "A discussão também abrange as complexidades do setor de seguros, a necessidade de regulamentação e as diferentes percepções sociais e julgamentos morais entre seguros e jogos de azar."
    ],
    "points": 150,
    "commentCount": 262,
    "retryCount": 0,
    "time": 1717879078
  },
  {
    "id": 40622912,
    "title": "Mudança histórica da Suécia para dirigir do lado direito: A história de Dagen H",
    "originLink": "https://en.wikipedia.org/wiki/Dagen_H",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40622912",
    "commentBody": "",
    "originSummary": [
      "Dagen H, ou \"Högertrafikomläggningen\", foi o dia em que a Suécia trocou a direção do lado esquerdo pela direção do lado direito, em 3 de setembro de 1967, para reduzir as colisões frontais.",
      "A transição exigiu ampla educação pública, novas marcações nas estradas e a substituição de 350.000 placas de trânsito, com o tráfego não essencial proibido durante a troca.",
      "Embora a mudança tenha inicialmente reduzido os acidentes, as taxas voltaram ao normal em dois anos; os bondes foram em grande parte substituídos por ônibus, com apenas algumas linhas de bonde sobrevivendo."
    ],
    "commentSummary": [
      "A discussão destaca a mudança da Suécia para o tráfego à direita em 1967, apesar da significativa oposição do público, e seus eventuais benefícios.",
      "Os usuários comparam a coragem política necessária para tais decisões no passado com os desafios da implementação de políticas impopulares no ambiente atual, orientado pela mídia.",
      "A conversa também explora as normas globais de direção, a Convenção de Genebra sobre Trânsito Rodoviário e as implicações mais amplas da padronização de práticas como dirigir à direita e adotar o inglês como segundo idioma oficial."
    ],
    "points": 136,
    "commentCount": 137,
    "retryCount": 0,
    "time": 1717922307
  },
  {
    "id": 40621534,
    "title": "Correção de clones defeituosos do Altera USB Blaster para compatibilidade com o Linux",
    "originLink": "https://www.downtowndougbrown.com/2024/06/fixing-a-knockoff-altera-usb-blaster-that-never-worked/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40621534",
    "commentBody": "",
    "originSummary": [
      "Doug Brown consertou dois dispositivos clones Altera USB Blaster com defeito para seu projeto Time Sleuth, que mede o atraso de entrada HDMI.",
      "Ele resolveu problemas de temporização com o Waveshare USB Blaster V2 ajustando a frequência do relógio e modificou o firmware de código aberto para tornar funcional um clone mais barato da Amazon no Linux.",
      "Brown compartilha seu firmware modificado no GitHub e enfatiza os desafios e a satisfação de usar ferramentas de código aberto para converter dispositivos não funcionais em dispositivos funcionais."
    ],
    "commentSummary": [
      "A discussão se concentra na solução de problemas de uma imitação não funcional do Altera USB Blaster, especificamente problemas com um chip FTDI.",
      "Os participantes debatem os méritos e as desvantagens dos dispositivos originais em relação aos clonados, incluindo preços, custos de desenvolvimento e o impacto de clones mais baratos no mercado.",
      "O tópico também destaca soluções alternativas, como clones mais baratos baseados no chip Cypress FX2LP e opções de código aberto."
    ],
    "points": 130,
    "commentCount": 21,
    "retryCount": 0,
    "time": 1717899229
  },
  {
    "id": 40622189,
    "title": "Betula: bookmarking auto-hospedado para a Web independente com suporte para IndieWeb e Fediverse",
    "originLink": "https://betula.mycorrhiza.wiki/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40622189",
    "commentBody": "",
    "originSummary": [
      "O Betula é um software de bookmarking gratuito e auto-hospedado projetado para usuários individuais, permitindo que eles organizem e publiquem bookmarks com tags, títulos e descrições.",
      "Ele suporta marcadores públicos e privados, tem uma interface simples e armazena dados em um único arquivo SQLite, com microformatos IndieWeb e integração com o Fediverse para interação social.",
      "O Betula é fácil de instalar e configurar por meio de uma interface da Web, com atualizações de desenvolvimento e código-fonte disponíveis no SourceHut, Codeberg e GitHub, e novas versões lançadas aproximadamente a cada três meses."
    ],
    "commentSummary": [
      "O Betula é um software de bookmarking federado que permite aos usuários gerenciar e compartilhar bookmarks, projetado especificamente para a Web independente.",
      "Ele suporta marcação e ActivityPub para recursos sociais e é elogiado por ser auto-hospedável sem dependências complexas.",
      "Os usuários discutem desafios como o esquecimento de marcadores e sugerem soluções como marcadores centrados no conteúdo, ferramentas auto-hospedadas como o Wallabag e integração com aplicativos de anotações."
    ],
    "points": 105,
    "commentCount": 39,
    "retryCount": 0,
    "time": 1717909626
  },
  {
    "id": 40619752,
    "title": "Criação de um Matchmaker eficiente para jogos multijogador usando dados reais dos jogadores",
    "originLink": "https://mas-bandwidth.com/creating-a-matchmaker-for-your-multiplayer-game/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40619752",
    "commentBody": "",
    "originSummary": [
      "A publicação do blog de Glenn Fiedler no Más Bandwidth destaca a importância de um matchmaker robusto para jogos multijogador e apresenta um simulador de matchmaking baseado em dados reais de jogadores.",
      "O simulador testa a eficiência do matchmaker em encontrar correspondências de baixa latência, visando uma latência ≤50ms, expandindo para ≤100ms se necessário e, por fim, permitindo qualquer correspondência se nenhum servidor ideal for encontrado.",
      "A postagem ressalta a importância da estimativa precisa da latência e sugere o uso de mapas de latência e aceleradores de rede, com o simulador mostrando resultados promissores de correspondências encontradas em uma média de dois segundos e 30-40ms RTT (Round-Trip Time)."
    ],
    "commentSummary": [
      "A discussão examina a mudança de servidores voltados para a comunidade para a criação de partidas modernas em jogos multijogador, o que geralmente interrompe as interações sociais de longo prazo entre os jogadores.",
      "Ele destaca os benefícios dos servidores persistentes em jogos como \"Squad\" e \"Counter-Strike\" para a criação de relacionamentos e dá crédito ao blog de Glenn Fiedler pelas implementações bem-sucedidas de código de rede usando WebRTC e enet.",
      "A postagem detalha uma técnica de criação de partidas que envolve o código de rede autorizado pelo servidor com previsão e reversão do lado do cliente, enfatizando conexões de baixa latência, e discute os desafios de equilibrar os níveis de habilidade e a latência. O código-fonte está disponível no GitHub com uma opção para desativar o embaralhamento de jogadores."
    ],
    "points": 99,
    "commentCount": 41,
    "retryCount": 0,
    "time": 1717875533
  },
  {
    "id": 40624563,
    "title": "Equipes de agentes LLM superam o desempenho na exploração de vulnerabilidades de dia zero com o sistema HPTSA",
    "originLink": "https://arxiv.org/abs/2406.01637",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40624563",
    "commentBody": "",
    "originSummary": [
      "O artigo \"Teams of LLM Agents can Exploit Zero-Day Vulnerabilities\" (Equipes de agentes LLM podem explorar vulnerabilidades de dia zero), de Richard Fang et al., investiga o uso de agentes de modelo de linguagem grande (LLM) na segurança cibernética, com foco em vulnerabilidades de dia zero.",
      "Os autores apresentam o HPTSA, um sistema em que um agente de planejamento coordena subagentes para superar as limitações dos agentes LLM individuais no tratamento de vulnerabilidades desconhecidas e no planejamento de longo prazo.",
      "Ao comparar 15 vulnerabilidades do mundo real, o estudo mostra que a abordagem baseada em equipe do HPTSA supera significativamente os métodos anteriores, melhorando o desempenho em até 4,5 vezes."
    ],
    "commentSummary": [
      "A discussão examina os pontos fortes e fracos dos modelos de linguagem grande (LLMs), como Claude-opus e ChatGPT, na identificação de vulnerabilidades de dia zero no código.",
      "Embora os LLMs possam identificar problemas tecnicamente corretos, sua relevância mais ampla é debatida, e ferramentas especializadas e conhecimento especializado ainda são essenciais para vulnerabilidades complexas.",
      "Preocupações éticas e legais, altos custos e questões práticas, especialmente para projetos de código aberto, destacam o ceticismo sobre o valor agregado dos LLMs em relação às técnicas existentes de segurança cibernética."
    ],
    "points": 97,
    "commentCount": 63,
    "retryCount": 0,
    "time": 1717942506
  }
]
