[
  {
    "title": "AI에 의해 대체될 고학력·고소득 일자리, 341만 개 위험- 과학기술 직업은 유지될 전망",
    "originLink": "https://news.kbs.co.kr/news/view.do?ncd=7821076",
    "originBody": "",
    "originSummary": [
      "인공지능(AI)에 의해 대체될 수 있는 위험이 높은 직업은 대체로 높은 수준의 교육과 높은 급여를 받는 직업이며, 이로 인해 해당 소득 계층이 크게 영향을 받을 수 있습니다.",
      "약 341만 개의 직업이 AI에 의해 대체될 위험이 있습니다.",
      "과학, 기술, 공학, 수학 분야의 직업은 수요가 계속될 것이지만, 근로자의 적응력과 정책 설계에 따라 AI의 영향이 결정될 것입니다.",
      "보고서는 인공지능이 복제할 수 없는 사회적 기술, 팀워크, 커뮤니케이션 등의 능력이 미래에 더욱 보상받아야 한다고 강조합니다."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700313910201
  },
  {
    "title": "엘드리지 인더스트리즈, 전 인베스트콥 파트너 영입으로 대체 자산 강화",
    "originLink": "https://kr.investing.com/news/stock-market-news/article-93CH-969188",
    "originBody": "",
    "originSummary": [
      "유전자 치료 및 분석 분야는 상승세를 보이고 있습니다.",
      "암호화폐, 정유 및 석화 화학 분야는 하락세를 경험하고 있습니다."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700313910201
  },
  {
    "title": "삼성증권, 비대면 계좌 대체입고 및 매매 이벤트로 최대 100만원 지급",
    "originLink": "http://m.techholic.co.kr/news/articleView.html?idxno=210485",
    "originBody": "",
    "originSummary": [
      "삼성증권은 11월 동안 국내 주식 거래 및 비대면 계좌로의 이체에 대하여 최대 천만 원의 보상을 제공하는 이벤트를 개최합니다.",
      "다른 회사에서 적어도 천만 원 어치의 주식을 이체하고 동일한 금액을 거래하는 사용자가 보상을 받을 자격을 갖출 수 있습니다, 단, 계정 잔고는 12월 31일까지 유지되어야 합니다.",
      "새로운 고객 및 휴면 계정에 대해서는 온라인 국내 주식 수수료를 평생 면제하는 혜택도 제공하고 있습니다. 또한, 외국 주식을 이체하는 사람을 위한 별도의 이벤트도 진행하고 있습니다, 최대 350만 원의 보상이 제공됩니다."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700313910201
  },
  {
    "title": "만기 시 확정 수익이 매력인 만기채권형 ETF, 상장 1년만에 인기",
    "originLink": "https://www.hankyung.com/article/202311187033i",
    "originBody": "",
    "originSummary": [
      "한국에서 Maturity Bond-Type ETFs가 출시 1년 후 대거 인기를 얻고 있습니다. 이는 만기시 원금과 확정된 이자의 반환에 대한 기대로 인한 것입니다.",
      "이 ETFs는 약 3.8%에서 5%의 잠재적 수익률을 제공하며 월간 배당 형태 또는 비배당 형태로 사용할 수 있습니다.",
      "고정 이자와 원금 상환을 확보하는 것이 이와 같은 ETFs에 투자하는 주목적이지만, 채권 이자율이 예상보다 더 빨리 떨어질 경우 시장에서 거래할 수 있습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "브렉시트 이후 영국의 핀테크 섹터 전망에 대한 글로, 전문가들은 그 전망에 낙관적입니다.",
      "기업들에게는 브렉시트의 지역적 영향을 이해하며, 디지털 중심 세계로 나아가는 변화속에서 확장 기회를 활용할 것을 추천합니다.",
      "코로나19 대유행은 이미 이 업계에서 전례 없는 성장을 이끌어 내고 있으며, 앞으로 더욱 가속화될 것으로 예상됩니다.",
      "브렉시트 후 시기는 핀테크에 유리한 규제 변화를 가져올 수 있습니다. 또한, 이 섹터는 기존 은행과의 협업을 통해 하이브리드 디지털-물리적 비즈니스 모델을 고려할 수 있습니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700313910201
  },
  {
    "title": "미 백악관, 머스크가 동의한 반유대주의 댓글 강력조론",
    "originLink": "https://mobile.newsis.com/view.html?ar_id=NISX20231118_0002526373",
    "originBody": "",
    "originSummary": [
      "테슬라의 CEO인 일론 머스크는 유대인을 비난하는 글에 동의함으로써 백악관으로부터 비판 받았습니다. 머스크는 이 글이 \"진실\"이라고 주장했습니다.",
      "백악관은 해당 글을 \"역겹게도 반유대주의와 인종 증오를 조장하는 것\"이라고 비난하였습니다.",
      "남편은 그런 가정을 반복하는 것이 통과할 수 없으며, 바이든 대통령은 지난 달 하마스의 이스라엘 공격 이후 증가하는 반유대주의를 계속해서 비난할 것이라고 백악관이 강조했습니다."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700313910201
  },
  {
    "title": "AI 발전, 고임금·고학력 직업군 위협… 데이터 보호 및 소비자 대응 정책 필요",
    "originLink": "https://www.mindlenews.com/news/articleView.html?idxno=6002",
    "originBody": "",
    "originSummary": [
      "한국은행은 보고서에서 AI가 고소득 고기술 직종을 위협하며, 제한 없이 확산될 경우 임금 격차를 심화시킬 수 있다고 경고했습니다.",
      "특히 많은 데이터를 활용하는 변호사, 회계사, 공학 기술자 등의 직업은 AI에 의한 대체가 우려됩니다.",
      "보고서는 또한 AI의 사용이 급속히 확대될 경우, 과도한 개인정보 수집이나 소비자의 손해 등 사회적 문제를 초래할 수 있다고 지적했습니다. 따라서 AI의 남용을 방지하고, AI 혜택이 소수의 대기업에게 집중되는 것을 막기 위해 선제적인 규제 조치가 필요하다고 제안했습니다."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700313910201
  },
  {
    "title": "\"스킴플레이션\" 현상, 기업들이 물건의 품질과 양을 줄이며 가격은 그대로 유지",
    "originLink": "https://www.vanchosun.com/news/main/frame.php?main=1&boardId=17&bdId=79826",
    "originBody": "",
    "originSummary": [
      "\"skimpflation\"이란 물건의 품질과 양이 줄어들지만 가격은 동일하게 유지하는 방식으로, Quaker의 그래놀라 바와 영국의 슈퍼마켓 체인에서 이런 사례가 보고되었습니다.",
      "정부는 이러한 은밀한 인플레이션에 대처하기 위한 전략을 계획 중입니다.",
      "다른 뉴스에는 캐나다의 식품 가격 상승, 혐오 범죄에 대한 법률 변화, 마리화나 사용과 커피 음용 습관에 대한 건강 보고서, 그리고 중국에 대한 공포증 증가에 따른 현지 영향 등이 포함되어 있습니다."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700313910201
  },
  {
    "title": "\"정부 24\" 서비스 2일째 중단, 민원서류 발급 대체 방법과 재정비 현황",
    "originLink": "https://www.asiatoday.co.kr/view.php?key=20231118010011721",
    "originBody": "",
    "originSummary": [
      "한국 정부의 공문서 발급 서비스가 컴퓨터 네트워크 장애로 이틀 동안 중단되었습니다. 공무원 전용 네트워크인 \"Saor\"에서 사용자 인증 문제가 발생, 지방 정부의 공문서 발급에 영향을 끼쳤습니다.",
      "온라인 민원서비스인 \"정부24\"도 운영을 중단했습니다. 그 결과, 행정안전부는 복구 작업을 위해 100명 이상의 인력을 투입하고 있습니다.",
      "몇몇 문서는 대체 가능하며, 그 예로는 가족관계증명서가 온라인으로 발급 가능한 국적증명서를 대체할 수 있습니다. 총리 한덕수와 대통령 윤석열은 이 사태에 대한 정부의 우선 대응을 지시했습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "2016년에 데이터 중심의 혁신이 소매업계에서 27억 달러를 창출했지만, 많은 소매업체들이 데이터 통찰력을 실제 행동으로 전환하는 데 어려움을 겪고 있습니다.",
      "소매업체들은 분산된 데이터를 해석하고, 필요하지 않은 데이터는 수집하지 않으며, 보유하지 않은 데이터를 구매하는 것의 중요성을 이해해야 합니다.",
      "회사들은 데이터로부터 이점을 얻기 위해 올바른 기술과 도구를 사용해야 하며, 그렇지 않으면 의사결정을 복잡하게 만들고 비효율적인 고객 관계 관리를 초래할 수 있습니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700313910201
  }
]
