[
  {
    "title": "21 Analytics Introduces Open-Source Blockbook Library to Streamline Blockchain Data Access",
    "originLink": "https://blockonomi.com/21-analytics-unveils-open-source-blockbook-library-for-seamless-blockchain-data-access/",
    "originBody": "Share Facebook Twitter LinkedIn Email Telegram WhatsApp Blockbook, an open-source software solution, has gained widespread recognition as a backend component for prominent crypto wallets such as Trezor and Edge and other various services. This technology enables applications to harness up-to-the-minute blockchain data, encompassing transaction specifics, address balances, account history, and the seamless publication of new transactions. Moreover, it comprehensively indexes addresses and corresponding balances from the linked blockchain, aids effortless and efficient index searching for lightning-fast data retrieval, enhances accessibility and navigation due to its user-centric blockchain explorer, is available through both WebSocket and REST API protocols, and offers support for over 30 cryptocurrencies, with the potential for effortless expansion to other coin types. As open-source enthusiasts, we have a strong ambition at 21 Analytics to also contribute to the community and the Bitcoin ecosystem. The open-sourced Blockbook library is powering automation in 21 Travel Rule, our compliance solution for VASPs. We concluded that if it serves us well, it must also be useful for other innovators. Filip Gospodinov, CTO 21 Analytics 21 Analytics’ newly unveiled Blockbook Library introduces an innovative approach to decentralised data retrieval. By harnessing the power of an API, wallet applications can effortlessly retrieve blockchain data from a server, streamlining the process and improving user experiences. The library acts as a gateway, communicating with Blockbook servers to retrieve essential data from the Bitcoin Blockchain. This approach simplifies and expedites the integration process, enabling software engineers to focus on optimising user experiences without the burden of intricate protocol implementation. Developing open-source tools and software is at the core of 21 Analytics’ ethos. With open-source software, transparency and trust are fostered, two essential elements in cryptocurrency. Open-source projects, like the Blockbook library, allow anyone to inspect the code, ensuring no hidden vulnerabilities or backdoors. The company believes that the ecosystem can truly flourish through open-source software development. For additional details on this innovative release and the 21 Analytics’ Blockbook library, visit https://gitlab.com/21analytics/blockbook. About 21 Analytics Founded by Bitcoiners in 2020, 21 Analytics is a leader in crypto compliance technology and security. By leveraging the team’s vast experience in blockchain, it has been possible to advance the company’s ethos of combining compliance with data protection while strengthening privacy for financial intermediaries and their customers. Contact: 21 Analytics Advertise Here",
    "originSummary": [
      "Blockbook, an open-source software solution developed by 21 Analytics, is becoming popular as a backend component for crypto wallets and services.",
      "Blockbook allows applications to access real-time blockchain data, index addresses and balances, and supports over 30 cryptocurrencies.",
      "The newly released Blockbook Library enhances data retrieval from the Bitcoin Blockchain, improving user experiences."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699883904369
  },
  {
    "title": "Surge in AI Spending Boosts Technology Sector Growth, Indicates Start of New Bull Market",
    "originLink": "https://www.investing.com/news/cryptocurrency-news/friendtech-trading-activity-plummets-on-coinbases-base-blockchain-after-initial-surge-93CH-3231823",
    "originBody": "New tech bull market has begun on 'tidal wave' of AI spending declares Wedbush",
    "originSummary": [
      "Investment firm Wedbush predicts that a new technology bull market has begun due to increased investment in artificial intelligence (AI)",
      "The surge in AI spending is compared to a \"tidal wave\" and is expected to drive significant growth in the technology sector."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699883904369
  },
  {
    "title": "TD Securities Joins Paxos Settlement Service for Blockchain-driven Commodities Settlement",
    "originLink": "https://www.marketsmedia.com/td-securities-uses-blockchain-for-commodities-settlement/",
    "originBody": "Sectors 11.13.2023 From The Markets TD Securities Uses Blockchain for Commodities Settlement 11.13.2023 Share Tweet Share Paxos, the leading regulated blockchain infrastructure platform, has announced that TD Securities has become the latest financial institution to join the Paxos Settlement Service for Commodities. For the first time in the precious metals market, Paxos is facilitating the simultaneous settlement of cash and commodities trades. As part of the network, TD Securities will be able to facilitate fully automated settlement and streamline operations for both traditional and digital precious metals trades. With the numerous commodities trading firms still without automated confirmations and settlement, TD Securities’ adoption of the Paxos service is an important step to increasing efficiencies and common standards for commodities settlement. Joe Quinlan, Global Head of FX & Commodities Middle Office at TD Securities, said: “Bridging the longstanding gap between cash and asset settlement networks, as well as collecting settlement obligations in a controlled way that mitigates risk, are fundamental elements to creating safe settlement for the commodities market. Aside from the risk mitigation, joining this settlement network enables us to drive significant benefits to our processes, increasing our overall settlement efficiency.” Anoushka Rayner, Head of Growth – Commodities, Paxos, added: “In plugging the gap between cash and asset settlement, credit risk is reduced and capital efficiencies are realised, delivering real benefits to market participants such as TD Securities from day one. Not only does Paxos deliver simultaneous settlement but the Paxos Settlement Service also acts as a hub to accommodate all counterparty settlements regardless of whether the counterparty is on the network. TD Securities will be able to optimise its commodities business with full automation from post-trade confirmation to final settlement.” Source: Paxos Share Tweet Share NEWSLETTER SIGN UP And receive exclusive articles on securities markets Markets Media Follow Digital publisher covering trading & technology in capital markets. @marketsmedia @traders_tweets @FIXGlobalOnline @TheBondDesk @BestExecution @DerivSource Markets Media @marketsmedia · 13 Sep As Technology Evolves, Asset Managers Adapt and Innovate Reply on Twitter 1702005834081821046 Retweet on Twitter 1702005834081821046 Like on Twitter 1702005834081821046 Twitter 1702005834081821046 Markets Media @marketsmedia · 13 Sep Citi Changes Organizational Structure Reply on Twitter 1701949103419048274 Retweet on Twitter 1701949103419048274 Like on Twitter 1701949103419048274 Twitter 1701949103419048274 Markets Media @marketsmedia · 13 Sep SEC Charges Virtu for Disclosures Relating to Information Barriers Reply on Twitter 1701875573344157802 Retweet on Twitter 1701875573344157802 Like on Twitter 1701875573344157802 Twitter 1701875573344157802 Markets Media @marketsmedia · 13 Sep ICE Futures Singapore Partners with CoinDesk Indices Reply on Twitter 1701870991540895961 Retweet on Twitter 1701870991540895961 Like on Twitter 1701870991540895961 Twitter 1701870991540895961 Load More Related articles From The Markets BondbloX Raises $6m in Series B Funding Beacon Venture Capital joins existing shareholders MassMutual Ventures and Citigroup in the round. 11.10.2023 By Shanny Basar , Senior Writer From The Markets HSBC Tokenises Ownership of Physical Gold Gold tokenisation complements HSBC Orion, the platform for native digital assets such as digital bonds. 11.02.2023 By Shanny Basar , Senior Writer From The Markets DTCC Acquires Securrency DTCC will fast-track development of its enterprise digital asset platform for institutional DeFi. 10.20.2023 By Shanny Basar , Senior Writer Daily Email Feature More Funds Will be Tokenized Using blockchain to cut even 5 basis points of expenses in asset management creates big savings. 10.17.2023 By Shanny Basar , Senior Writer From The Markets BlackRock, Barclays Go Live on J.P. Morgan’s TCN The Tokenized Collateral Network facilitated its first collateral settlement for a live client OTC derivative. 10.11.2023 By Shanny Basar , Senior Writer",
    "originSummary": [
      "TD Securities has joined the Paxos Settlement Service for Commodities to utilize blockchain technology for settlement in the commodities market.",
      "This adoption will enable TD Securities to automate settlement processes and improve operational efficiency for traditional and digital precious metals trades.",
      "By bridging the gap between cash and asset settlement, this move aims to reduce credit risk and enhance overall settlement efficiency in the commodities market."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699883904369
  },
  {
    "title": "Nigeria's Wicrypt Network Partners with peaq Blockchain for Enhanced Decentralized Internet Sharing",
    "originLink": "https://www.cointrust.com/market-news/wicrypt-network-expands-integration-with-peaq-blockchain-for-enhanced-decentralized-internet-sharing",
    "originBody": "Market NewsNovember 13, 2023 by Kelly Cromley Wicrypt Network Expands Integration with peaq Blockchain for Enhanced Decentralized Internet Sharing Nigeria’s Wicrypt Network, a decentralized mobile internet sharing, and monetization network, has taken a significant step forward in its integration with peaq, a blockchain designed for real-world applications. This strategic collaboration aligns with Wicrypt’s mission to create a decentralized WiFi sharing ecosystem, and it positions the company as the first in Africa to establish a peer-to-peer infrastructure for mobile internet data sharing without the need for third-party integration. Wicrypt’s Evolution and Funding Milestone: Founded in 2018, Wicrypt has evolved into a decentralized WiFi sharing and monetization network, enabling individuals to earn compensation for sharing their WiFi. In November 2021, the startup successfully concluded a strategic funding round, securing US$1.5 million to facilitate its expansion into new countries. Since then, Wicrypt has rapidly expanded, boasting over 1,000 hotspot hubs across the globe. peaq: Empowering Real-World Applications with Blockchain: peaq, on the other hand, has developed a layer-1 blockchain designed to empower individuals to build decentralized applications (dApps) and networks for real-world use cases. These applications span a range of functionalities, including car-sharing, street-mapping, web access, and more. The collaboration with Wicrypt signifies peaq’s commitment to supporting practical applications of blockchain technology in everyday scenarios. Integration Milestone: Wicrypt’s WiFi Hotspots on peaq’s krest Blockchain: The latest phase of integration sees the deployment of Wicrypt WiFi hotspots on krest, peaq’s sister blockchain. These hotspots are equipped with unique peaq IDs, demonstrating the successful integration of Wicrypt’s infrastructure with peaq’s blockchain technology. The Wicrypt operating system’s new version ensures seamless compatibility with peaq, streamlining the connection process for users acquiring these devices. Ugochukwu Aronu’s Perspective on the Integration: Ugochukwu Aronu, the CEO of Wicrypt, expressed enthusiasm about the ongoing integration, particularly highlighting the activation of the first hotspots on krest. Aronu emphasized that krest, as a production-grade network, provides an ideal testing environment for all developments on peaq. In the long term, this integration is expected to enhance user rewards within Wicrypt’s DePIN ecosystem, presenting an incentivization mechanism to bridge digital divides. Future Implications and DePIN Ecosystem Boost: As Wicrypt continues to forge ahead with its integration with peaq, the activation of WiFi hotspots on krest marks a significant milestone. Beyond testing environments, this collaboration is poised to have lasting impacts on user rewards within Wicrypt’s DePIN ecosystem. The interconnected nature of these technologies presents a powerful solution for connecting individuals and communities, thereby contributing to reducing digital disparities. Conclusion: Bridging Divides and Empowering Connectivity: In conclusion, the expansion of Wicrypt’s integration with peaq signifies a meaningful stride towards creating a decentralized and accessible internet-sharing ecosystem. The deployment of WiFi hotspots on krest underscores the practical applications of blockchain in real-world scenarios. Ugochukwu Aronu’s positive outlook on the integration and the future implications for the DePIN ecosystem reinforces the transformative potential of these technologies in empowering connectivity and bridging digital divides in Nigeria and beyond.",
    "originSummary": [
      "Wicrypt Network has partnered with peaq Blockchain to improve its decentralized mobile internet sharing and monetization network in Nigeria.",
      "This collaboration makes Wicrypt the first company in Africa to establish a peer-to-peer infrastructure for mobile internet data sharing without third-party integration.",
      "The partnership aims to enhance user rewards within Wicrypt's ecosystem and bridge digital disparities in Nigeria and beyond, showcasing the practical applications of blockchain technology in real-world scenarios."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699883904369
  },
  {
    "title": "SBI Launches $660 Million Fund for Digital Space, Including Web3 and Metaverse",
    "originLink": "https://www.ledgerinsights.com/sbi-digital-space-fund-web3-metaverse/",
    "originBody": "Capital markets • News SBI unveils Digital Space fund of up to $660m, including web3, metaverse 2 hours ago by Ledger Insights Japan’s SBI unveiled its latest “Digital Space” fund, which will invest up to Yen 100 billion ($660m). Web3 and the metaverse are the first technologies on the list. However, it also covers AI, fintech, healthcare, digital transformation and climate tech. The fund is managed by SBI Investment. Previous mega funds include the 2018 SBI AI&Blockchain ($400m) Fund and the 4+5 Fund ($660m). Apart from SBI, follow on investors from the 4+5 fund include Mitsui & Co, Sumitomo Bank, Dai-ichi Life Insurance, Mizuho Bank and Fukuoka Bank. New investors include Nippon Life Insurance, beauty company Mandom and Sanyo Foods. Just last week SC Ventures and SBI Holdings announced a $100 million Digital Asset Joint Venture in the UAE, separate from the Digital Space Fund. SBI is a prolific investor in the blockchain space. Its most extensive activities are in the digital asset space, but it also invested in blockchain for insurance (the now defunct B3i) and SBI Traceability used for Saki traceability and authentication. On the digital asset front it has extensive cryptocurrency interests, including a crypto exchange and owns the B2C2 global market maker. On the tokenized securities front, it is an investor in the Progmat and BOOSTRY tokenization platforms. Plus, it owns the secondary exchange ODX, which is soon to launch digital securities. CBOE recently announced it invested in ODX. Additionally, SBI invested in multiple key DLT technology players, including Ripple, R3 and Digital Asset. It has joint ventures with all three. Image Copyright: leddamarita / 123rf blockchain blockchain investment cryptocurrency digital assets distributed ledger DLT Japan metaverse SBI SBI DIgital Space web3 FacebookXRedditEmailLinkedInWhatsApp",
    "originSummary": [
      "SBI, a leading Japanese investor in blockchain technology, has launched a new fund called \"Digital Space\" with a substantial investment of up to $660 million.",
      "The fund will focus on various cutting-edge technologies, including web3, the metaverse, AI, fintech, healthcare, digital transformation, and climate tech.",
      "SBI has a track record of managing successful funds in the past, such as the SBI AI&Blockchain Fund and the 4+5 Fund, and this new fund has both existing and new investors."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699883904369
  },
  {
    "title": "ISO20022: Bridging the Gap Between Financial Institutions and Blockchain Technology",
    "originLink": "https://medium.com/@ceelo92/iso20022-understanding-its-impact-on-the-financial-and-blockchain-sectors-67ced245bedf",
    "originBody": "ISO20022: Understanding Its Impact on the Financial and Blockchain Sectors Courtney Hall · Follow 2 min read · 3 hours ago -- The financial world is abuzz with discussions about ISO20022, a standard that has become increasingly relevant in the context of digital currencies and blockchain technologies. This standard, developed in 2004 by ISO TC68, a subgroup specializing in financial services, was initially created for legacy systems to enhance payments clearing and settlement globally. Its relevance in the blockchain era, however, deserves a closer examination. ISO20022 is essentially a financial data standard that enables efficient communication among financial institutions through a unified messaging language. Contrary to popular belief, it was not designed specifically for cryptocurrencies or digital assets. Instead, its application in the blockchain space aligns with its role in legacy financial systems – ensuring compliant data standards. With the upcoming ISO20022 mandate, there’s speculation about whether “ISO20022 coins” will replace conventional systems like SWIFT. While this transition may not be as drastic as some anticipate, ISO20022 compliance does mean that Distributed Ledger Technology (DLT) networks can be integrated into the financial system, provided they adhere to the standard’s format. Examples of this integration include: 1. Bank A using $CSPR Nucleus Finance for contracts, adhering to ISO TC68 SC9 standards. 2. Bank B transmitting ISO20022 compatible messages via the $XDC Network. 3. Real-time gross settlement systems translating messages onto DLTs through TC 307 harmonization with tools like the $QNT Overledger API. 4. Bank C leveraging $XRP for instant liquidity bridges, converting currencies in real-time. However, the role of ISO20022 extends beyond merely facilitating blockchain adoption in banking. It represents an update to the existing ISO15022 standard, aiming to enhance data capacity within each financial message. This development is more about improving data messaging standards than promoting specific technologies. The broader context involves ISO TC68 and ISO TC307, the standards for financial services and blockchain/DLT, respectively. Their collaboration, particularly in areas like security and reference data in financial services, indicates a growing intersection between DLT and traditional finance. This intersection highlights the potential for blockchain in enhancing security and auditability within the financial sector. Nonetheless, compliance with ISO20022 should not be seen as a definitive indicator of success for blockchain projects. Rather, it’s a basic requirement or a “barrier for entry” that allows these technologies to be considered for use in the financial sector. In this regard, compliance is analogous to having the necessary qualifications for a job – essential but not a guarantee of selection. In conclusion, while ISO20022 compliance opens doors for DLT networks in the financial sector, their actual adoption and application depend on various factors. It’s crucial to continue observing developments in this area to understand the full impact of ISO20022 on both finance and blockchain technologies.",
    "originSummary": [
      "ISO20022 is a financial data standard that facilitates efficient communication between financial institutions, and although not specifically designed for cryptocurrencies or digital assets, it can be used in the blockchain industry to ensure compliant data standards.",
      "Compliance with ISO20022 enables the integration of blockchain technology into the financial system, but its effectiveness depends on various factors.",
      "The standard represents an update to the existing ISO15022 standard and aims to improve data messaging standards in the financial sector, indicating the increasing intersection between blockchain and traditional finance with potential benefits in security and auditability. However, compliance with ISO20022 is not a guarantee of success for blockchain projects, but rather a basic requirement. Monitoring ongoing developments is crucial to fully grasp the impact of ISO20022."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699883904369
  },
  {
    "title": "ZK-Rollups-as-a-Service: Making Blockchain Scalability Easier and More Efficient",
    "originLink": "https://zycrypto.com/zk-rollups-as-a-service-will-be-a-game-changer-for-blockchain-scalability/",
    "originBody": "Crypto Cable ZK-Rollups-as-a-Service Will Be A Game-Changer For Blockchain Scalability By Livine Sanchez - November 13, 2023 ShareTwitterReddItTelegramWhatsApp Advertisement Blockchain has become notorious for its limitations in terms of transaction throughput and scalability. Because these networks add data to the blockchain in blocks of a fixed, maximum size, they can only process a limited number of transactions per second. For decentralized applications and Web3 games that demand low latencies and frequent interactions, these limitations can be crippling. Rollups have emerged as one of the most promising solutions to this problem. They record transactions off-chain and only commit them to the blockchain in bulk, ensuring many more can be processed at the same time. In this way, Rollups improve the scalability of blockchains. What Are Rollups? Rollups address the blockchain’s scalability problem by offloading transactions onto a second, higher network layer rather than processing them all on the main chain. Rollups are Layer-2 protocols that sit on top of an existing network such as Ethereum, recording summaries of transactions as they’re performed. Rollups then take batches of transactions and record them onto the main blockchain with minimal on-chain data, in order to record the status updates that result from those transactions, without overwhelming the network. Rollups come in two main flavors. First, there are Optimistic Rollips, which assume transactions are legitimate until proven otherwise. They operate with a “challenge period” during which anyone is able to submit that a rollup transaction is invalid. If no challenges are submitted during this period, the network will then assume the transactions are valid and process them on the main blockchain. The disadvantage of this approach is that users are unable to withdraw their funds immediately, and must wait until the challenge period has expired. Advertisement To overcome this limitation, ZK Rollups use a cryptographic technique called zero-knowledge proofs in order to demonstrate that its state updates are valid. ZK-proofs, as they’re known, make it possible to prove a transaction is valid without revealing the full details about that transaction. These proofs mean it’s possible to validate an entire batch of transactions without accessing the complete transaction data on-chain. Due to this, there’s no need for a challenge period, meaning users can withdraw their funds immediately. There are a number of dedicated Rollup platforms available for developers to access, including Starknet and zkSync. Developers can build on these L2 platforms to record their transactions off-chain, enabling their dApps to scale with ease. ZK Rollup Frameworks There are limitations to building on an existing ZK Rollup platform. For instance, the developer has no say in things such as the transaction structure, and the rate at which they’re verified on-chain, and these factors may not fit with the specific needs of their dApp. Additionally, existing ZK Rollapp platforms still face limits on the number of transactions they can process, even if these limits are far higher than the underlying L1. To get around this, developers can build their own ZK Rollup L2 using frameworks such as Arbitrum Orbit, Rollkit, and OP Stack, which provide all the tools needed to do this. Because ZK Rollups are implemented using open-source smart contracts, they can be modified to create a custom ZK Rollup that best meets the needs of their application. On the downside, these Rollup frameworks are not easy to use. Developers must have deep technical knowledge of the smart contract programming language in order to modify the smart contracts that govern their Rollups. A second problem with ZK-Rollups is that they require diverse hardware resources, including ZK-proof computational power, data storage and packaging nodes. The costs of maintaining these hardware resources can quickly add up, meaning ZK Rollups are an inappropriate solution for scaling many kinds of dApps. ZK Rollups-as-a-Service The complexity of building customized ZK Rollup layers is unfortunate because they have shown themselves to be one of the best solutions for blockchain scaling in terms of speed and security. Luckily, the industry has responded to this with a fresh concept known as ZK Rollups-as-a-Service, or ZK-RaaS, which handles many of the complexities involved in creating and customizing a ZK Rollup L2. Using ZK-RaaS platforms, developers are free to focus on customizing essential features such as payment fees, data availability and transaction fees, without worrying about the complexity of doing this themselves. One of the most notable pioneers of ZK-RaaS is Lumoz, which recently rebranded from Opside. It has created a hybrid Proof-of-Work/Proof-of-Stake network that facilitates ZK-proof mining and enables developers to quickly generate a customized zkEVM L2 chain in just a few clicks. One of the advantages of Lumoz is that its network handles all of the processing requirements, incentivizing a huge community of miners to provide the computational power necessary to run its zkEVMs. The main objective of Lumoz is to encourage the wider adoption of ZK Rollups by making them as simple as possible to deploy. It enables developers to create and deploy a zkEVM across multiple chains. ZK-RaaS Advantages ZK-RaaS makes it possible for any dApp to operate its own Rollup network to address scalability challenges. With their own ZK Rollup, dApps can process many more transactions than would be possible on the L1 network or even on a shared ZK Rollup layer, where they are forced to compete with other dApps. This means that dApp developers can offer their users almost instantaneous transaction processing times. With ZK-RaaS, developers have full control of parameters such as the frequency at which batches of transactions are written to the blockchain and confirmed. Another benefit is that developers are free to create their own fee structures, balancing this against the frequency at which transactions are processed. The more transactions that are bundled together as one, the cheaper the transaction costs will be. This provides a lot of flexibility to dApps that may not need immediate transaction processing, enabling them to entice users with lower costs. Perhaps the biggest advantage of all is that dApps can continue to take advantage of Ethereum’s strong security. While many dApp developers are building atop alternative, more scalable blockchain networks, those L1s cannot match Ethereum’s level of security. By using a ZK-RaaS on Ethereum, dApps can be built atop the most secure smart contract blockchain in existence. And it goes without saying that developers don’t require specialist skills to do any of this, as they instead rely on third-party expertise. ZK Rollups Are Ready For Prime Time ZK Rollups are one of the most promising scalability solutions around for blockchain networks, but the concept has not yet been widely adopted due to the complexity of creating them. With ZK-RaaS now reaching maturity, it has never been easier to implement ZK Rollups. Developers can build a fully customized scaling solution in a matter of minutes, and they can do so at a low cost as there’s no need to concern themselves with hardware maintenance. Previous articleBybit Enhances Its Crypto Debit Card in Europe as Binance Ends Its Own Service Livine Sanchez Livine Sanchez is an Avid Crypto Lover and Passionate writer. Contact: Livine.Sanchez [at] zycrypto.com",
    "originSummary": [
      "Rollups are Layer-2 protocols that alleviate blockchain scalability issues by offloading transactions onto a secondary network layer and committing them to the main blockchain in bulk.",
      "There are two types of Rollups: Optimistic Rollups and ZK Rollups. ZK Rollups utilize zero-knowledge proofs to validate batches of transactions without revealing full details, enabling immediate fund withdrawals.",
      "The emergence of ZK Rollups-as-a-Service (ZK-RaaS), exemplified by Lumoz, simplifies the process of building and customizing ZK Rollup layers, offering faster transaction processing times, control over parameters and fee structures, and the benefit of Ethereum's robust security."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699883904369
  },
  {
    "title": "Blockchain and Digital Assets: Transforming Copyright and Patent Distribution in Innovation Management",
    "originLink": "https://coingeek.com/blockchain-and-digital-assets-a-new-paradigm-for-copyright-and-patent-distribution-through-micropayments/",
    "originBody": "Blockchain and digital assets: A new paradigm for copyright and patent distribution through micropayments TECH 7 HOURS AGO Dr. Craig Wright This article was first published on Dr. Craig Wright’s blog, and we republished with permission from the author. Abstract This paper investigates integrating blockchain technology and digital assets within innovation management, particularly emphasizing their application in distributing copyright and patented material. This study provides a detailed assessment of the current state of innovation management, including prevalent models and practices, while identifying critical gaps in knowledge that necessitate further research. The research topic explores the definition and background of blockchain technology and digital assets, focusing on their role in managing copyright and patent distribution. This exploration examines current theories and debates, underscoring the need to address the limitations of existing platforms. The impact of blockchain and digital assets on innovation management is examined, highlighting the potential to enhance intellectual property protection, facilitate stakeholder collaboration, and improve transparency in distributing creative and patented works. By analyzing a case study on micropayments, the paper provides tangible evidence of the real-world application of blockchain technology in copyright distribution. Moreover, the study demonstrates the potential of BSV blockchain as a viable solution to overcome the scalability and high transaction fees associated with existing platforms, emphasizing its capacity to open up new opportunities and revolutionize the industry. In addition to examining the present landscape, the paper outlines future research directions to expand the understanding and application of blockchain technology and digital assets in innovation management. It explores scalable solutions to accommodate the growing demand for efficient copyright and patent distribution and legal frameworks that can effectively address the intricate legal implications of blockchain-based management systems. What is more, the paper underscores the significance of optimizing user experience and enhancing economic implications to ensure widespread adoption and seamless integration of blockchain technology. The study identifies and envisions a future where blockchain and digital assets enable a more distributed and equitable innovation ecosystem, empowering creators, innovators, and consumers. The study also contemplates the broader implications for future social change, emphasizing the democratization of access to copyrighted and intellectual property-protected material. This shift can unlock new markets and opportunities previously unexplored, fostering innovation, creativity, and economic growth on a global scale. In conclusion, this paper provides a comprehensive analysis of the integration of blockchain and digital assets in innovation management, focusing on copyright and patent distribution. By examining the current state of the field, presenting a robust research topic, exploring real-world case studies, and outlining future research directions, this study contributes to advancing knowledge in innovation management. Furthermore, the transformative potential of blockchain and digital assets regarding intellectual property protection, collaboration, and transparency is examined. Finally, by adopting Bitcoin SV and optimizing blockchain-based platforms, a future marked by inclusive, transparent, and efficient systems within the creative industries is within reach. Introduction Innovation management is critical to driving growth and competitiveness in today’s fast-paced and dynamic business environment (Schiuma et al., 2021). Effective innovation management requires exploring new methodologies, technologies, and approaches to address challenges and unlock opportunities (Ivaldi et al., 2021). One such technology that garnered significant attention is blockchain. Bitcoin is the first blockchain platform and offers distributed, devolved, and transparent systems for recording and verifying transactions (Wright, 2008). Coupled with utilizing digital and tokenized assets, a blockchain can revolutionize various aspects of innovation management. This paper focuses on the role of blockchain and digital assets in distributing copyright and patented material, highlighting their implications for innovation management. Copyright and patent distribution protect intellectual property rights and enable creators and inventors to benefit from their works (Bell & Parchomovsky, 2014). This remains important as traditional systems for managing copyright and patent distribution face challenges regarding transparency, efficiency, and accessibility. Bell and Parchomovsky (2014, p. 231) have contended that an enhanced intellectual property “system would reduce wasteful litigation while encouraging the wider dissemination and more extensive use of inventions and expressive works.” Integrating blockchain technology and digital assets presents new possibilities for addressing these challenges and enhancing innovation management practices. For example, the distributed peer-to-peer nature of blockchain technology simultaneously enables secure and transparent systems for recording and tracking ownership, transfers, and licensing agreements of copyrighted and patented material (Bamakan et al., 2022). In addition, by establishing a tamper-proof and immutable ledger, blockchain can provide a more efficient and trustworthy platform for managing intellectual property rights (Helo & Hao, 2019). Digital assets, on the other hand, facilitate new methods of incentivizing and rewarding innovation (Quah, 2003). For example, through micropayments and instant transactions enabled by Bitcoin and tokenized assets, creators can be fairly compensated for their contributions (Zema, 2022), fostering a more engaging and motivating environment for open innovation (Huizingh, 2011). These digital assets also introduce opportunities for new business models and revenue streams, driving innovation in product development and service delivery (Tavoletti et al., 2021). Integrating blockchain and digital assets in copyright and patent distribution can reshape the landscape of innovation management (Gunasekara & Rajapakse, 2022). By leveraging the benefits of the increased transparency, security, and efficiency from the blockchain and the possibilities offered by digital assets, organizations can enhance collaboration, accountability, and measurement of innovation outcomes (Rejeb et al., 2019). This opens new avenues for creators, inventors, and organizations to protect their intellectual property, drive innovation, and access global markets. Alkhader et al. (2020, p. 188363) demonstrate how integrating these technologies into real-world physical systems, such as additive manufacturing, can provide benefits that allow operators to “govern and trace transactions initiated by participants involved in the manufacturing process.” Throughout this paper, we will delve into the analysis of innovation management, identify knowledge gaps in the understanding and application of blockchain and digital assets in copyright and patent distribution, and explore the potential impact of this research topic on the broad field of innovation management. Furthermore, we will discuss the implications for future social change, emphasizing the importance of understanding and leveraging blockchain and digital assets to drive transformative outcomes in intellectual property management, democratizing innovation, and accessibility of creative and patented works (Bamakan et al., 2022). By examining the intersection of innovation management, blockchain technology, and digital assets in the context of copyright and patent distribution, we can gain insights into the transformative potential of these technologies and their implications for the future of innovation management (Bonnet & Teuteberg, 2022). Thus, This paper contributes to the growing body of knowledge and stimulates further research, discussions, and practical applications of blockchain and digital assets in innovation management. Thus, as Bonnet and Teuteberg (2022, p. 1) claim, it will be possible to extend the research to “investigate which blockchain benefits, in terms of technological security, immutability, decentralization, tokenization or disintermediation are promoted by these applications.” Analysis of the field In this section, we explore the current state of innovation management, including prevalent models and practices, challenges, and dilemmas. Open Innovation (Chesbrough, 2003), Blue Ocean Thinking (Kim & Mauborgne, 2015), Design Thinking (Lewrick et al., 2020), and Lean Startup (Céspedes-Mota et al., 2021) are influential methodologies. We highlight the potential role of blockchain and digital assets in addressing the challenges of innovation management. Blockchain technology offers opportunities for democratizing innovation, enhancing transparency, and improving the measurement of innovation outcomes (Rejeb et al., 2019). Digital assets, such as Bitcoin and tokenized assets, present new avenues for incentivizing innovation and enabling novel business models. Rejeb et al. (2019, p. 3) note that “blockchain technology is based on peer-to-peer communication, which alters market structures by fostering disintermediation.” The promise of blockchain comes from a combination of micropayments, which open up new avenues to create business opportunities coupled with the ability of individuals to exchange information nearly instantly across the globe. While peer-to-peer is often touted as the node network structure within systems such as Bitcoin, the reality is that peer-to-peer exchanges should involve individuals who can exchange directly (Milojicic et al., 2002). Current state of innovation management Innovation management, the organized and structured process of promoting innovation within an organization, remains a fundamental strategic approach in the business landscape (Ojasalo, 2008). The ever-changing dynamics of global markets necessitate constant adaptation and innovation for businesses to remain competitive and sustainable. However, managing innovation isn’t straightforward (Žemaitis, 2014). Managing innovation requires an interplay of various methodologies, theoretical frameworks, and the innovative integration of emerging technologies, such as Blockchain (Beck & Müller-Bloch, 2017). Open Innovation, first proposed by Henry Chesbrough (2003), is a paradigm that advocates for the free flow of information and ideas, both internally and externally, to accelerate the innovation process. This model could be further augmented by blockchain technology. By implementing blockchain systems, corporations can securely and transparently exchange data and knowledge, fostering collaboration while safeguarding intellectual property (De La Rosa et al., 2017). Blue Sky Thinking promotes innovative ideas without the constraints of practical limitations or existing realities (Wrigley et al., 2016). Often, the most transformative ideas stem from unrestricted, visionary thinking. Here too, blockchain could play a role. Blockchain’s decentralized nature can enable broad, independent participation in innovation, where anyone, regardless of their position in the corporate hierarchy, could contribute their ‘blue sky’ ideas. In addition, the blockchain can serve as an immutable record of these ideas, ensuring attribution and recognition. Design Thinking is an approach centered on understanding end-user needs and developing solutions accordingly, combining empathy, technological feasibility, and business viability. Blockchain can further enhance this approach (DeCovny, 2015). For instance, by leveraging blockchain’s transparency, corporations could better understand user interactions and preferences, leading to more user-centric innovations. Moreover, blockchain smart contracts could automate particular product or service delivery aspects, enhancing customer experience (Dal Mas et al., 2020). The Lean Startup methodology applies an ‘experiment, learn, iterate’ approach, encouraging quick prototyping and market testing (Frederickson, 2015). Blockchain’s immutable and transparent nature can provide reliable data for such iterative learning. In addition, it allows companies to track and analyze customer interactions in real-time, facilitating quicker learning cycles and more informed iterations (Gunasekara & Rajapakse, 2022). Various theoretical methods, such as the Innovation Ambition Matrix and the Three Horizons of Growth framework (Mazumdar & Perkins, 2021), assist corporations in charting their innovation strategy. However, blockchain can enable more efficient execution of these strategies. For instance, blockchain can provide a secure, transparent platform for managing and tracking innovation initiatives, providing real-time insights, and fostering accountability (Xu et al., 2022). Despite these methodologies, corporations still grapple with challenges in fostering a genuine innovation culture and effectively measuring the impact of their innovative efforts (Hynes & Mickahail, 2019; Jamrog et al., 2006). Here again, blockchain’s potential comes to the fore. The technology could provide a more transparent and efficient system for tracking innovation activities, outcomes, and impacts, facilitating a more objective evaluation of innovation performance (philsoophian et al., 2021). Finally, the rapid pace of technological advancement represents both opportunities and pressures for corporations. Almeida et al. (Almeida et al., 2020) contend that “[d]igital transformation is characterized by the fusion of advanced technologies and the integration of physical and digital systems”. Following recent events such as COVID-19, these events have come to the fore, and the criticality of change is arguably even more important than past. By adopting technologies like blockchain, corporations can leverage these opportunities, stay ahead of the competitive curve, and remain resilient in the face of change (Kiradoo, 2023). The following sections will explore the role of blockchain and digital assets in managing copyright and patent distribution as a specific application of these technologies in innovation management. Role of blockchain and digital assets in innovation management As businesses grapple with the challenges of innovation management, emergent technologies such as blockchain and digital assets provide potential solutions (Aoun et al., 2021). These technologies influence innovation management in several ways, impacting how ideas are generated, shared, evaluated, and implemented. Blockchain technology, with its characteristics of decentralization, transparency, and immutability, can fundamentally alter how organizations innovate (Deepa et al., 2022). It can democratize the innovation process, enabling broad-based participation and collaboration within and outside the organization. Blockchain can serve as a secure, tamper-proof platform where ideas can be shared, discussed, and developed collaboratively, fostering a culture of open innovation (Leible et al., 2019). Moreover, blockchain technology can provide a more efficient, transparent, and fair system for managing and recognizing innovation efforts. Fraga-Lamas and M. Fernández-Caramés (2020) contend that the “need for orchestrating multiple stakeholders in a trusted and reliable way matches perfectly with the distributed nature of blockchain.” For instance, blockchain could create a secure and transparent record of all innovation activities, from idea generation to implementation. This can ensure that all contributions are appropriately attributed and recognized, fostering a sense of ownership and motivation among the innovators (Li & Fang, 2021). Blockchain can also facilitate the more effective measurement and evaluation of innovation outcomes. Using technology, referred to as “smart contracts,” benefits innovative businesses despite being neither smart nor contract (Allam, 2018). These systems are programmable script functions that are recorded on the blockchain. By correctly noting the data flow, these systems can automate the tracking and rewarding of innovation outcomes, such as successful idea implementation or achievement of specific innovation goals (Swan, 2015). This can provide a more objective and reliable measure of innovation performance, helping organizations to better understand and manage their innovation efforts. Digital assets, such as Bitcoin, tokenized assets, and non-fungible tokens (NFTs), also present significant opportunities for innovation management. These assets can provide new ways to incentivize and reward innovation, creating a more engaging and motivating environment for innovators. Baudier et al. (2022) note that “Blockchain technology and tokenization can solve challenges in co-creation projects consisting of big companies, startups, and entrepreneurial accelerators.” For example, organizations could use tokenized rewards to recognize and reward innovative efforts, creating a more tangible sense of achievement and ownership among their employees. Furthermore, digital assets can enable new business models and revenue streams, driving product development and service delivery innovation. For instance, organizations could use tokenization to create new products or services or to monetize previously untapped resources. Businesses could also use Bitcoin or tokenized assets to facilitate transactions, reducing costs and enhancing customer experience. For example, van Haaften-Schick and Whitaker (2022, p. 288) note that “[w]hile resale royalties have historically been used more speculatively by artists of earlier generations, they are now reaching more viable form because of blockchain’s ability to redress these limitations of contracting and transacting.” This technology provides many new opportunities for innovation. In summary, blockchain and digital assets profoundly influence innovation management. They offer new tools and mechanisms to drive innovation, from enhancing collaboration and transparency to facilitating recognition and reward to enabling new business models and revenue streams. These technologies, therefore, deserve our close attention as we seek to understand and navigate the evolving landscape of innovation management. Centorrino et al. (2022) contend that this will produce new forms of value creation and deliver innovative structures that aid in value co-creation. Alternatively, Wang et al. (2022) see a growing alignment between artificial intelligence of Blockchain technology and that these technologies will enhance future business practices. Identification of knowledge gaps Despite the considerable promise of blockchain and digital assets in innovation management, several knowledge gaps remain in understanding their full potential and implications, especially regarding the management of copyright and patent distribution (Bonnet & Teuteberg, 2022). With the capability of distributing small value exchanges to a vast number of parties globally, Blockchain systems can open new forms of exchange that are linked to micropayments. These can be constructed using NFTs and other technology to securely integrate the exchange of information without the existing overhead. Firstly, there is a need to understand the technical and legal complexities associated with using blockchain for managing copyright and patent distribution (Fraga-Lamas & Fernandez-Carames, 2020). Blockchain technology offers robust solutions for tracking and verifying copyright and patent ownership (Leible et al., 2019). However, applying these solutions in real-world scenarios involves dealing with intricate legal systems and intellectual property rights conventions, which may not be fully compatible with existing legislative controls (Savelyev, 2018). The intersection of blockchain technology, copyright law, and patent law is thus an area that requires further exploration. Secondly, while digital assets hold promise as a new medium for transacting intellectual property rights, the mechanisms and models for such transactions remain underdeveloped (van Haaften-Schick & Whitaker, 2022). For example, using micropayments enabled by Bitcoin at scale could revolutionize the monetization of copyrighted and patented material. However, questions around the setting of microtransaction prices, the assurance of fair compensation for creators, and the prevention of illicit use of copyrighted material are questions that some authors would instead leave unaddressed (Filippi & Wright, 2018). A significant gap exists in understanding the user perspective toward blockchain and digital asset-based copyright and patent distribution solutions (Deepa et al., 2022). Blockchain-based technology could hinder its adoption among creators, consumers, and intermediaries who may lack the technical literacy to use these solutions confidently if not implemented flawlessly (Mougayar, 2016). Understanding user attitudes, perceptions, and skill levels towards blockchain and digital assets, and developing user-friendly, accessible solutions is a pressing need (Y. Wang et al., 2022). Lastly, while we recognize the potential of blockchain and digital assets to disrupt existing copyright and patent distribution models, there is limited empirical evidence to support these claims (Deepa et al., 2022). Therefore, case studies and pilot projects are needed to test the viability of these technologies in various contexts, to identify best practices, and to understand the challenges in implementing these solutions. Critically, these need to be in a way that demonstrates both the benefits and the pitfalls so that these latter issues may be avoided. Addressing these knowledge gaps will require a multidisciplinary approach, combining insights from technology, law, economics, and social sciences (Risius & Spohrer, 2017). However, only by filling these gaps can we unlock the full potential of blockchain and digital assets in managing copyright and patent distribution and drive the next wave of innovation in this field. As Risius & Spohrer (2017, p. 405) conclude, “investigations into consequences of different technological variations, into the business value of blockchain systems, and into their management and organization are fairly scarce. We conclude by urging researchers to take on the challenge”. As such, only by conducting more detailed research will businesses come to understand the technology entirely. Research topic The research topic delves into utilizing blockchain and digital assets for managing copyright and patent distribution. By leveraging the highly distributed and transparent quality of blockchain technology, organizations can establish secure and immutable systems for recording ownership, transfers, and licensing agreements of copyrighted and patented materials (Deepa et al., 2022). This section explores the current state of the field, identifying prevalent models and practices in innovation management while highlighting the challenges and dilemmas faced (Risius & Spohrer, 2017). The discussion encompasses methodologies such as Open Innovation, Blue Sky Thinking, Design Thinking, and Lean Startup and explores their influence on innovation management (Chesbrough & Tucci, 2020). Moreover, this section emphasizes the potential role of blockchain and digital assets in addressing the challenges of innovation management (Bonnet & Teuteberg, 2022), including the consequences of enhancing collaboration, transparency, and measurement of innovation. Finally, the impact on industries and technologies, such as the creative sector and software development, is examined, considering both the positive opportunities and the challenges to be mitigated (Aoun et al., 2021). Overall, this research sheds light on integrating blockchain and digital assets in copyright and patent management, its implications, and the potential for transforming innovation management practices (Z. Wang et al., 2022). Blockchain and digital assets for copyright and patent distribution As van Haaften-Schick and Whitaker (2022, p. 287) show, “the Artist’s Contract, first developed in 1971, was not broadly adopted in its early decades, renewed interest in it fifty years later has led to inventive related structures that are enabled by blockchain technology”. As such, research utilizing blockchain and digital assets to manage copyright and patent distribution has immediate applications. Deploying this technology involves leveraging the distributed and transparent nature of blockchain technology to enhance the efficiency, security, and accessibility of copyright and patent transactions (Savelyev, 2018). By implementing blockchain-based solutions, organizations can establish a tamper-proof and immutable ledger that records ownership, transfers, and licensing agreements for copyrighted and patented materials. The application of this technology has the promise of improving many forms of digital exchange and intellectual property licensing. Understanding the current theories and debates surrounding using blockchain and digital assets in copyright and patent management is crucial if these outcomes are to be implemented correctly. Existing theoretical discussions revolve around the potential of blockchain technology to disrupt traditional intermediaries and enable direct peer-to-peer transactions, eliminating the need for centralized copyright and patent authorities (Bonnet & Teuteberg, 2022). Additionally, debates exist regarding the scalability, privacy, and legal considerations of implementing blockchain solutions for copyright and patent distribution. As copyright and patent laws differ across jurisdictions, exploring the legal implications and challenges of integrating blockchain and digital assets in managing intellectual property rights is paramount (Allen et al., 2020). Understanding the complexities of intellectual property laws and their interaction with blockchain technology will contribute to developing appropriate frameworks and regulations that align with the benefits and requirements of this approach to innovation. Scholars can contribute to the knowledge base surrounding blockchain and digital assets in copyright and patent distribution by investigating this research topic. While these findings will provide insights into the current state of affairs and help identify areas for improvement, policy considerations, and potential solutions for optimizing copyright and patent management through these innovative technologies, they will also provide fundamental foundations that will enable the development of other types of technology and innovation management strategies. Significantly, as Leible et al. (2019) demonstrate, this technology may revolutionize intellectual property rules and change how open science and research are conducted. Impact on industries or technologies The creative sector, software development, and intellectual property management are among the industries that benefit most from these transformative effects. In utilizing blockchain and digital assets for copyright and patent distribution, both large and small businesses, as well as individual artists, can revolutionize the distribution of intellectual products to disrupt multiple industries and technologies, opening up new markets that were previously unexplored (van Haaften-Schick & Whitaker, 2022). Blockchain and digital assets empower creators by providing a secure and transparent platform for protecting and monetizing their copyrighted works. The technology behind blockchain allows for the creation of new platforms that create opportunities by leveraging the distributed structure of blockchain. With such a system, creators can establish digital scarcity for their electronic files, ensuring their content retains value in a digital landscape where replication is effortless (Soares & Kauffman, 2018). When coupled with micropayments and instant transactions facilitated by blockchain, this technology enables the global distribution of content, reaching audiences and opening up markets that were not previously considered economically viable. Similarly, in the realm of software development, blockchain and digital assets have the potential to revolutionize the distribution and licensing of software applications (Momoh et al., 2021). Using smart contracts and tokenization, developers can establish flexible licensing models that allow for granular control over software usage while ensuring fair compensation for their work. The transparency and immutability of blockchain also enhance trust and security within software supply chains, mitigating issues such as piracy, unauthorized modifications, and counterfeit software (Hastig & Sodhi, 2020). While adopting blockchain and digital assets offers numerous benefits, challenges and potential negative impacts must be considered. Scalability remains a concern, particularly in industries with high transaction volumes, such as music streaming or digital content platforms (Truong et al., 2023). Regulatory frameworks that effectively address the legal implications of blockchain-based copyright and patent management are crucial to balance innovation and compliance with existing intellectual property laws (Gürkaynak et al., 2018). Collaboration among industry stakeholders, policymakers, and technology experts is essential to maximize the positive impacts and mitigate potential negatives (Savelyev, 2018). Establishing industry-specific best practices and standards will guide the responsible and efficient adoption of blockchain and digital assets. Education and awareness initiatives will play a vital role in helping stakeholders understand the benefits, intricacies, and potential pitfalls associated with integrating blockchain technology (Xu et al., 2019). Continued research and development efforts are necessary to address technical challenges, improve scalability, and enhance the user experience when utilizing blockchain for copyright and patent distribution (Soares & Kauffman, 2018; Swan, 2015). Overall, the impact of blockchain and digital assets on industries and technologies holds immense potential for positive transformation. By embracing these innovations while proactively addressing challenges, industries and technologies can adapt and thrive in a rapidly evolving digital landscape, unlocking new opportunities and expanding global access to content, creativity, and innovation. These benefits can also apply across the government (Ølnes et al., 2017). As Ølnes et al. (2017, p. 355)show, Blockchain technology, “BCT can be used for any change of ownership and the storage of important information and documents like certificates, licenses, government decisions, and legislation.” Case Study: Micropayments in action Blockchain technology has presented new opportunities for innovation and disruption in various industries, including music. Blockchain-based music distribution platforms, such as Ujo Music (O’Dair et al., 2016), have emerged as potential solutions to address the challenges of copyright management, fair compensation, and transparent royalty distribution (Yahya & Habbal, 2021). While Ujo Music initially built its platform on the Ethereum blockchain, the limitations of Ethereum (Potts & Rennie, 2019), including high transaction fees and scalability issues, have prompted the exploration of alternative blockchain networks (Alharby & van Moorsel, 2017). This case study examines the potential of Bitcoin (BSV) as a more efficient and cost-effective solution for music rights management and intellectual property protection within the context of Ujo Music. Limitations in Music Distribution with Ethereum (Song et al., 2021) Ethereum, with its smart contract capabilities and distributed node architecture, played a significant role as a proof of concept in enabling platforms like Ujo Music to empower artists and revolutionize the music industry. However, the scalability challenges of Ethereum lead to rising transaction fees, which have hindered the seamless execution of micropayments and affected the overall user experience (Ray, 2023). As music distribution platforms seek to enable fair compensation and transparent royalty distribution, the limitations of Ethereum have prompted businesses to explore alternative blockchain networks. Further, despite the hype, Ethereum is distributed but not decentralized (Walch, 2018). The management of the Ethereum Foundation controls the development path. Rather than allowing the system to progress as an open protocol, individuals controlling this foundation dictate the future of the system and, in making changes to the underlying protocol, create rules that determine who will win and lose in an industry. While some authors analyze control from the point of view of distribution (De Collibus et al., 2022), the analysis should be simple. The question would be whether the protocol is fixed or if some party can change it to the detriment of others. Hence, despite the misleading term representing decentralization related to the systems node structure, the control of the Ethereum system is incredibly centralized. Bitcoin SV as an Efficient Solution Bitcoin SV (BSV) has emerged as a potential alternative for blockchain-based music distribution platforms, offering scalability, low transaction costs, and enhanced data storage capabilities. The larger block size and improved transaction processing capabilities of BSV make it well-suited for handling high transaction volumes, enabling efficient micropayments, and rapid royalty distribution (Porras, 2023). This scalability advantage over Ethereum positions BSV as a promising solution for cost-effective transactions within music distribution platforms. Transparent Royalty Distribution with BSV The transparency and immutability of BSV facilitate accurate and auditable royalty distribution, instilling trust in the music ecosystem (Tartan, 2023). By leveraging BSV, platforms like Ujo Music can ensure that artists receive fair compensation without the burden of high transaction fees. BSV’s data storage capabilities also provide a robust foundation for copyright management, securely recording ownership and licensing agreements. Enhanced User Experience and Direct Artist-Fan Engagement: BSV’s low transaction costs enable music platforms to offer cost-effective micropayments, fostering enhanced user engagement and a more vibrant music ecosystem. As a result, artists can establish direct connections with their audience, receiving immediate and fair compensation for their creative works (Taskinsoy, 2019). In addition, the efficient execution of micropayments on BSV enhances user satisfaction, as listeners can directly support their favorite artists without intermediaries. Beyond Ujo Music: Exploring Bitcoin SV in Music Rights Management The integration of BSV extends beyond Ujo Music, as other blockchain-based platforms, such as PeerTracks, have leveraged Bitcoin for music rights management. By tokenizing music and ensuring transparent royalty distribution, BSV enables artists to retain control over their intellectual property and establish direct connections with their fans (Tartan, 2023). Verisart, a platform for art and collectibles, also benefits from BSV’s transparency and immutability, enabling verifiable certificates of authenticity and secure transactions. The limitations of Ethereum, including high transaction fees and scalability challenges, have prompted businesses like Ujo Music to explore alternative blockchain solutions. Bitcoin SV (BSV) emerges as a potential solution for blockchain-based music distribution platforms, offering scalability, low transaction costs, and transparent infrastructure. Leveraging BSV enhances music rights management, enabling fair compensation, transparent royalty distribution, and secure copyright management. As exploring alternative blockchain networks continues, BSV presents an opportunity for innovation, greater inclusivity, and direct artist-fan engagement within the music industry (Taskinsoy, 2019). This case study highlights the transformative potential of BSV for music rights management and intellectual property protection, demonstrating the need for further research and exploration of alternative blockchain networks within the music industry and beyond. Future directions In this section, we explore the future directions of innovation management in light of blockchain and digital assets. First, we discuss specific areas of further research related to these technologies and their potential benefits for copyright and patent distribution. By identifying the gaps in knowledge and understanding, we can outline the areas that require further exploration and offer recommendations for future research. Additionally, we consider the potential impact of the chosen research topic on the broad field of innovation management (Bonnet & Teuteberg, 2022). Furthermore, we discuss the implications for future social change that arise from integrating blockchain and digital assets in managing intellectual property, promoting innovation, and enhancing accessibility to creative and patented works. Through these discussions, we aim to provide insights into the future trajectory of innovation management and the transformative potential of blockchain and digital assets in driving positive change (Baudier et al., 2022). Potential areas of further research Blockchain and digital assets have the potential to bring significant benefits to intellectual property management, innovation management, and the accessibility of copyrighted and protected material. In terms of intellectual property, blockchain technology can provide a secure and transparent platform for protecting and monetizing creative works (Centorrino et al., 2022). By leveraging distributed nature of a blockchain, creators in industries such as art, music, and writing can establish digital scarcity for their electronic files, ensuring that their content retains value in a digital landscape where replication is effortless (Tartan, 2023). This creates new opportunities for creators to directly connect with their audience and receive fair compensation for their creations. The transparency and immutability of blockchain also enhance trust in intellectual property rights, allowing for quick and easy verification of ownership and reducing the risk of infringement (Ølnes et al., 2017). Innovation management stands to benefit from the integration of blockchain and digital assets. These technologies enable enhanced collaboration and transparency, fostering open innovation. Blockchain’s decentralized nature reduces reliance on intermediaries, enabling direct peer-to-peer transactions and removing unnecessary barriers in the innovation process (Fraga-Lamas & Fernandez-Carames, 2020). This can lead to more efficient sharing of ideas, increased participation from diverse stakeholders, and faster development and implementation of innovative solutions. Moreover, blockchain’s ability to track and record the entire innovation journey, from idea generation to implementation, provides valuable data for measuring and evaluating innovation outcomes, contributing to evidence-based decision-making and improving innovation management practices. Blockchain and digital assets can revolutionize the distribution and licensing of copyrighted and patented materials (Aoun et al., 2021). In the creative industries, for example, blockchain can empower creators by providing a secure platform for protecting and monetizing their works. Through smart contracts and tokenization, developers can establish flexible licensing models, enabling granular control over the usage of copyrighted material and ensuring fair compensation. Blockchain’s transparency and immutability also enhance trust and security within intellectual property supply chains, mitigating issues such as piracy, unauthorized modifications, and counterfeit material. While blockchain and digital assets present numerous benefits, challenges and potential adverse impacts exist. Scalability remains a concern (Malik et al., 2022), particularly in industries with high transaction volumes, as blockchain networks must handle many copyright and patent transactions. Regulatory frameworks must be developed to effectively address the legal implications of blockchain-based intellectual property management, striking a balance between innovation and compliance with existing laws. The user experience and adoption of blockchain solutions also require attention, ensuring that interfaces and interactions are user-friendly and intuitive while promoting awareness and trust among creators, consumers, and intermediaries (Walch, 2019). Further research is necessary to address the knowledge gaps and fully explore the potential of blockchain and digital assets in managing copyright and patent distribution. Areas of research include scalability solutions to handle large transaction volumes (Bez et al., 2019), interoperability, and standards to facilitate seamless interaction between different networks, legal and regulatory frameworks to ensure compliance with intellectual property laws, user experience, and adoption strategies, economic and business models enabled by blockchain technology, and security and privacy considerations within blockchain systems. Investigating these areas can deepen our understanding and maximize the benefits of blockchain and digital assets in intellectual property management and innovation. This can enable quick and easy access to copyrighted and protected material while providing robust protection for creators’ ideas and intellectual property rights (Gürkaynak et al., 2018). Impact on innovation management research The research topic on utilizing blockchain and digital assets for copyright and patent distribution holds significant potential for impacting innovation management. Integrating blockchain technology and digital assets in innovation management practices can bring about transformative changes, leading to advancements in collaboration, transparency, and measurement of innovation outcomes (Baudier et al., 2022). One of the primary areas where the impact will be felt is in scaling innovation management processes. Blockchain’s distributed and scalable characteristics offer the possibility of handling large transaction volumes and accommodating the growing demand for innovation initiatives. Innovative management can handle increased participation, collaboration, and transactional activities with scalable blockchain architectures (Dang et al., 2019). This scalability will open up new avenues for managing and scaling innovation in organizations, fostering the exploration of new ideas and accelerating the implementation of innovative solutions. Moreover, integrating micropayments facilitated by digital assets has the potential to revolutionize the incentive structure in innovation management. By leveraging blockchain technology, micropayments can be seamlessly delivered, enabling fair compensation and recognition for contributors at every stage of the innovation process. This shift towards micropayments aligns with the concept of Open Innovation and encourages a more inclusive and collaborative innovation ecosystem (Fraga-Lamas & Fernandez-Carames, 2020). In the next 3-5 years, we can expect a significant impact on innovation management research as scholars delve deeper into understanding the dynamics of micropayments and the influence on driving creativity, motivation, and innovation outcomes. The potential effect on the overall field of innovation management lies in the advancement of measurement and evaluation methodologies. The transparency and immutability of a blockchain provide a robust foundation for capturing, tracking, and analyzing innovation data. Researchers can access reliable, real-time data on innovation activities, outcomes, and impacts by leveraging the capabilities of a blockchain. This enables a more objective evaluation of innovation performance, enhances evidence-based decision-making, and facilitates continuous improvement in innovation management practices (Li & Fang, 2021). As innovation management embraces the integration of blockchain and digital assets, we can anticipate the emergence of new measurement frameworks and methodologies that capture the complex dynamics of innovation ecosystems. Furthermore, the research topic holds the potential to spur interdisciplinary collaboration and cross-pollination of ideas. Applying blockchain and digital assets in innovation management bridges the gap between technology, law, business, and social sciences. Scholars from various disciplines will come together to explore the implications, challenges, and opportunities arising from this integration. This interdisciplinary collaboration will foster a holistic understanding of innovation management, encouraging the development of comprehensive frameworks that account for technical, legal, economic, and social dimensions (Gupta et al., 2023). Finally, the research topic on utilizing blockchain and digital assets for copyright and patent distribution is poised to substantially impact innovation management in the next 3-5 years. Scaling innovation management processes, leveraging micropayments, advancing measurement methodologies, and promoting interdisciplinary collaboration are among the key areas where the impact will be felt (Leible et al., 2019). As organizations increasingly adopt blockchain and digital assets in their innovation practices, researchers and practitioners alike will advance the knowledge and understanding in the field, driving positive change in how innovation is managed and fostering a more efficient and inclusive innovation ecosystem (Tartan, 2023). Implications for future social change Utilizing blockchain and digital assets for copyright and patent distribution carries significant implications for future social change (Gürkaynak et al., 2018). By embracing these technologies, several transformative outcomes can be envisioned, particularly in intellectual property management, the democratization of innovation, and the accessibility of creative and patented works. Regarding intellectual property management, blockchain, and digital assets offer the potential to establish a more transparent and equitable system. The distributed nature of blockchain reduces the reliance on centralized intermediaries, enabling creators to have more direct control over their intellectual property rights (Chin et al., 2022). This shift empowers creators by providing them with increased autonomy, fair compensation, and the ability to securely and tamper-proof their works. As a result, intellectual property management becomes more inclusive, fostering a sense of ownership and incentivizing creativity and innovation. The democratization of innovation is another area where blockchain and digital assets can contribute to social change (Wan et al., 2022). These technologies enable broader participation and collaboration, allowing individuals from diverse backgrounds and geographical locations to contribute their ideas and expertise. By eliminating barriers and intermediaries, blockchain facilitates direct peer-to-peer interactions, unlocking new opportunities for innovation (Savelyev, 2018). This shift towards democratization can lead to the emergence of novel solutions, the inclusion of marginalized voices, and the acceleration of societal progress through collective intelligence (Oliveira et al., 2020). Furthermore, the accessibility of creative and patented works can be significantly enhanced by integrating blockchain and digital assets. Blockchain technology allows for the secure and transparent distribution of content, ensuring that creators’ works are readily available to audiences worldwide (Fraga-Lamas & Fernandez-Carames, 2020). Furthermore, micropayments enabled by digital assets can facilitate instant and frictionless transactions, enabling consumers to seamlessly access and compensate creators for their contributions. This accessibility promotes cultural exchange, enables niche markets to thrive, and provides a platform for underrepresented creators to showcase their talent and reach global audiences. The combination of intellectual property management, the democratization of innovation, and enhanced accessibility have the potential to drive positive social change. As more individuals gain control over their creative outputs and are fairly rewarded for their contributions, socioeconomic disparities may decrease (Tartan, 2023). Moreover, the decentralized and inclusive nature of blockchain and digital assets fosters collaboration, diversity, and cooperation, creating an environment where collective creativity and problem-solving can flourish. Moreover, the accessibility of creative and patented works enriches cultural diversity, expands knowledge sharing, and empowers communities to shape their narratives and experiences. However, it is crucial to recognize that the mere adoption of blockchain and digital assets does not guarantee social change. These technologies should be deployed in a manner that considers the ethical, legal, and social implications (Allen et al., 2020). Ensuring inclusivity, addressing privacy concerns, and actively working to bridge the digital divide are essential to realizing the full potential of blockchain and digital assets for positive social change. In conclusion, integrating blockchain and digital assets in copyright and patent distribution has profound implications for future social change. By promoting fairer intellectual property management, democratizing innovation, and enhancing accessibility to creative and patented works, these technologies pave the way for a more inclusive, collaborative, and culturally rich society. However, to harness the transformative power of these technologies, it is essential to navigating potential challenges responsibly, ensuring that all stakeholders realize the benefits of blockchain and digital assets and contribute to a more equitable and vibrant future (Centorrino et al., 2022; O’Dair et al., 2016). Conclusion To finish, this paper has explored the role of blockchain and digital assets in innovation management, specifically focusing on copyright and patent distribution (Baudier et al., 2022). The analysis of the field highlighted the current state of innovation management, prevalent models, and practices while also identifying the gaps in knowledge that necessitate further research. Finally, the research topic delved into the definition and background of blockchain and digital assets for managing copyright and patent distribution, addressing current theories and debates (Bonnet & Teuteberg, 2022). It has become evident that blockchain and digital assets have the potential to bring significant benefits to intellectual property management, innovation management, and the accessibility of creative and patented works debates (Bonnet & Teuteberg, 2022). By using developments that integrate the distributed structure of blockchain, creators can establish digital scarcity for their electronic files, protecting and monetizing their works. In addition, integrating blockchain and digital assets fosters collaboration, transparency, and measurement of innovation outcomes, enhancing innovation management practices. Furthermore, these technologies enable the secure and transparent distribution of creative and patented works, promoting accessibility and cultural exchange (Leible et al., 2019). The implications for future social change are noteworthy (Swan, 2015). Blockchain and digital assets democratize innovation, empower creators, and foster a more inclusive and collaborative environment. They also hold the potential to reduce socioeconomic disparities by providing fair compensation and rewarding creativity. However, responsible adoption is crucial to address scalability, legal frameworks, user experience, and privacy challenges. While this technology can empower artists and creators (van Haaften-Schick & Whitaker, 2022) if implemented poorly, it also can facilitate criminal activity (Faccia et al., 2020). The impact on the overall field of innovation management is substantial. Blockchain and digital assets offer opportunities to scale innovation management processes, introduce micropayments, advance measurement methodologies, and promote interdisciplinary collaboration. These developments will shape the future of innovation management, fostering more efficient, inclusive, and evidence-based practices (Gupta et al., 2023). Most critically, micropayments will reduce barriers to exchange and the various problems noted by Kenneth Arrow (1962) when analyzing transaction costs. By pushing down fees, exchanges can be made at levels that were previously unforeseen or more likely not considered. In conclusion, understanding and leveraging Blockchain and digital assets in innovation management is paramount, particularly for copyright (Centorrino et al., 2022) and patent distribution (Bonnet & Teuteberg, 2022). Embracing these technologies can revolutionize how intellectual property is protected, creativity is rewarded, and innovation is managed. Organizations, policymakers, and researchers should collaborate to address challenges, develop standards, and foster responsible adoption. By harnessing the potential of blockchain and digital assets, we can unlock new possibilities, drive social and economic transformation, and create a more equitable and vibrant innovation ecosystem. References Alharby, M., & van Moorsel, A. (2017). Blockchain-based Smart Contracts: A Systematic Mapping Study. Computer Science & Information Technology (CS & IT), 125–140. https://doi.org/10.5121/csit.2017.71011 Alkhader, W., Alkaabi, N., Salah, K., Jayaraman, R., Arshad, J., & Omar, M. (2020). Blockchain-Based Traceability and Management for Additive Manufacturing. IEEE Access, 8, 188363–188377. https://doi.org/10.1109/ACCESS.2020.3031536 Allam, Z. (2018). On smart contracts and organisational performance: A review of smart contracts through the blockchain technology. Review of Economic and Business Studies, 11(2), 137–156. Allen, J. G., Rauchs, M., Blandin, A., & Bear, K. (2020). Legal and Regulatory Considerations for Digital Assets (SSRN Scholarly Paper No. 3712888). https://papers.ssrn.com/abstract=3712888 Almeida, F., Duarte Santos, J., & Augusto Monteiro, J. (2020). The Challenges and Opportunities in the Digitalization of Companies in a Post-COVID-19 World. IEEE Engineering Management Review, 48(3), 97–103. https://doi.org/10.1109/EMR.2020.3013206 Aoun, A., Ilinca, A., Ghandour, M., & Ibrahim, H. (2021). A review of Industry 4.0 characteristics and challenges, with potential improvements using blockchain technology. Computers & Industrial Engineering, 162, 107746. https://doi.org/10.1016/j.cie.2021.107746 Arrow, K. J. (1962). Economic Welfare and the Allocation of Resources for Invention. In Economic Welfare and the Allocation of Resources for Invention (pp. 609–626). Princeton University Press. https://doi.org/10.1515/9781400879762-024 Bamakan, S. M. H., Nezhadsistani, N., Bodaghi, O., & Qu, Q. (2022). Patents and intellectual property assets as non-fungible tokens; key technologies and challenges. Scientific Reports, 12(1), 1–13. https://doi.org/10.1038/s41598-022-05920-6 Baudier, P., Chang, V., & Arami, M. (2022). The Impacts of Blockchain on Innovation Management: Sectoral Experiments. Journal of Innovation Economics & Management, 37(1), 1–8. https://doi.org/10.3917/jie.037.0001 Beck, R., & Müller-Bloch, C. (2017). Blockchain as Radical Innovation: A Framework for Engaging with Distributed Ledgers as Incumbent Organization. Hawaii International Conference on System Sciences 2017 (HICSS-50). https://aisel.aisnet.org/hicss-50/os/practice-based_research/3 Bell, A., & Parchomovsky, G. (2014). Reinventing Copyright and Patent. Michigan Law Review, 113(2), 231–278. Bez, M., Fornari, G., & Vardanega, T. (2019). The scalability challenge of ethereum: An initial quantitative analysis. 2019 IEEE International Conference on Service-Oriented System Engineering (SOSE), 167–176. https://doi.org/10.1109/SOSE.2019.00031 Bonnet, S., & Teuteberg, F. (2022). Impact of blockchain and distributed ledger technology for the management, protection, enforcement and monetization of intellectual property: A systematic literature review. Information Systems and E-Business Management. https://doi.org/10.1007/s10257-022-00579-y Centorrino, G., Naciti, V., & Rupo, D. (2022). A new era of the music industry? Blockchain and value co-creation: the Bitsong case study. European Journal of Innovation Management, 26(7), 65–85. https://doi.org/10.1108/EJIM-07-2022-0362 Céspedes-Mota, A., Shenoy, D., & Cárdenas-Barrón, L. E. (2021). Application of Lean Manufacturing Concepts to Evolving a Policy for Engineering Education. Education Sciences, 11(11), 755. https://doi.org/10.3390/educsci11110755 Chesbrough, H. W. (2003). Open Innovation: The New Imperative for Creating and Profiting from Technology. Harvard Business Press. Chesbrough, H. W., & Tucci, C. L. (2020). The interplay between open innovation and lean startup, or, why large companies are not large versions of startups. Strategic Management Review, 1(2), 277–303. Chin, T., Shi, Y., Singh, S. K., Agbanyo, G. K., & Ferraris, A. (2022). Leveraging blockchain technology for green innovation in ecosystem-based business models: A dynamic capability of values appropriation. Technological Forecasting and Social Change, 183, 121908. https://doi.org/10.1016/j.techfore.2022.121908 Dal Mas, F., Dicuonzo, G., Massaro, M., & Dell’Atti, V. (2020). Smart contracts to enable sustainable business models. A case study. Management Decision, 58(8), 1601–1619. https://doi.org/10.1108/MD-09-2019-1266 Dang, H., Dinh, T. T. A., Loghin, D., Chang, E.-C., Lin, Q., & Ooi, B. C. (2019). Towards Scaling Blockchain Systems via Sharding. Proceedings of the 2019 International Conference on Management of Data, 123–140. https://doi.org/10.1145/3299869.3319889 De Collibus, F. M., Piškorec, M., Partida, A., & Tessone, C. J. (2022). The Structural Role of Smart Contracts and Exchanges in the Centralisation of Ethereum-Based Cryptoassets. Entropy, 24(8), Article 8. https://doi.org/10.3390/e24081048 De La Rosa, J. L., Torres-Padrosa, V., El-Fakdi, A., Gibovic, D., Hornyák, O., Maicher, L., & Miralles, F. (2017). A survey of blockchain technologies for open innovation. Proceedings of the 4th Annual World Open Innovation Conference, 14–15. DeCovny, S. (2015). Chips off the old blockchain. CFA Institute Magazine, 26(6), 24–25. Deepa, N., Pham, Q.-V., Nguyen, D. C., Bhattacharya, S., Prabadevi, B., Gadekallu, T. R., Maddikunta, P. K. R., Fang, F., & Pathirana, P. N. (2022). A survey on blockchain for big data: Approaches, opportunities, and future directions. Future Generation Computer Systems, 131, 209–226. https://doi.org/10.1016/j.future.2022.01.017 Faccia, A., Moşteanu, N. R., Cavaliere, L. P. L., & Mataruna-Dos-Santos, L. J. (2020). Electronic Money Laundering, The Dark Side of Fintech: An Overview of the Most Recent Cases. Proceedings of the 2020 12th International Conference on Information Management and Engineering, 29–34. https://doi.org/10.1145/3430279.3430284 Filippi, P. D., & Wright, A. (2018). Blockchain and the Law: The Rule of Code. Harvard University Press. Fraga-Lamas, P., & Fernandez-Carames, T. M. (2020). Fake News, Disinformation, and Deepfakes: Leveraging Distributed Ledger Technologies and Blockchain to Combat Digital Deception and Counterfeit Reality. IT Professional, 22(2), 53–59. https://doi.org/10.1109/MITP.2020.2977589 Frederickson, H. G. (2015). Social Equity and Public Administration: Origins, Developments, and Applications: Origins, Developments, and Applications (1st ed.). Routledge. https://doi.org/10.4324/9781315700748 Gunasekara, P. T., & Rajapakse, C. (2022). A Blockchain-Based Model to Improve Patent Authentication and Management Process. 2022 2nd International Conference on Advanced Research in Computing (ICARC), 338–343. https://doi.org/10.1109/ICARC54489.2022.9754086 Gupta, S., Campos Zeballos, J., del Río Castro, G., Tomičić, A., Andrés Morales, S., Mahfouz, M., Osemwegie, I., Phemia Comlan Sessi, V., Schmitz, M., Mahmoud, N., & Inyaregh, M. (2023). Operationalizing Digitainability: Encouraging Mindfulness to Harness the Power of Digitalization for Sustainable Development. Sustainability, 15(8), Article 8. https://doi.org/10.3390/su15086844 Gürkaynak, G., Yılmaz, İ., Yeşilaltay, B., & Bengi, B. (2018). Intellectual property law and practice in the blockchain realm. Computer Law & Security Review, 34(4), 847–862. https://doi.org/10.1016/j.clsr.2018.05.027 Hastig, G. M., & Sodhi, M. S. (2020). Blockchain for Supply Chain Traceability: Business Requirements and Critical Success Factors. Production and Operations Management, 29(4), 935–954. https://doi.org/10.1111/poms.13147 Helo, P., & Hao, Y. (2019). Blockchains in operations and supply chains: A model and reference implementation. Computers & Industrial Engineering, 136, 242–251. https://doi.org/10.1016/j.cie.2019.07.023 Huizingh, E. K. R. E. (2011). Open innovation: State of the art and future perspectives. Technovation, 31(1), 2–9. https://doi.org/10.1016/j.technovation.2010.10.002 Hynes, R., & Mickahail, B. K. (2019). Leadership, Culture, and Innovation. In B. K. Mickahail & C. T. E. de Aquino (Eds.), Effective and Creative Leadership in Diverse Workforces: Improving Organizational Performance and Culture in the Workplace (pp. 65–99). Springer International Publishing. https://doi.org/10.1007/978-3-030-02348-5_4 Ivaldi, S., Scaratti, G., & Fregnan, E. (2021). Dwelling within the fourth industrial revolution: Organizational learning for new competences, processes and work cultures. Journal of Workplace Learning, 34(1), 1–26. https://doi.org/10.1108/JWL-07-2020-0127 Jamrog, J., Vickers, M., & Bear, D. (2006). Building and sustaining a culture that supports innovation. People and Strategy, 29(3), 9. Kim, W. C., & Mauborgne, R. (2015). Blue Ocean Strategy, Expanded Edition: How to Create Uncontested Market Space and Make the Competition Irrelevant. Harvard Business Review Press. Kiradoo, G. (2023). Exploring the Opportunities and Challenges for Entrepreneurs in Industry 4.0 (SSRN Scholarly Paper No. 4388004). https://papers.ssrn.com/abstract=4388004 Leible, S., Schlager, S., Schubotz, M., & Gipp, B. (2019). A Review on Blockchain Technology and Blockchain Projects Fostering Open Science. Frontiers in blockchain, 2. https://www.frontiersin.org/articles/10.3389/fbloc.2019.00016 Lewrick, M., Link, P., & Leifer, L. (2020). The Design Thinking Toolbox: A Guide to Mastering the Most Popular and Valuable Innovation Methods. John Wiley & Sons. Li, G., & Fang, C.-C. (2021). Promoting Information-Resource Sharing within the Enterprise: A Perspective of Blockchain Consensus Perception. Journal of Open Innovation: Technology, Market, and Complexity, 7(3), 177. https://doi.org/10.3390/joitmc7030177 Malik, N., Aseri, M., Singh, P. V., & Srinivasan, K. (2022). Why Bitcoin Will Fail to Scale? Management Science, mnsc.2021.4271. https://doi.org/10.1287/mnsc.2021.4271 Mazumdar, S., & Perkins, C. (2021). The Innovation Engine for Growth: An Actionable Roadmap to Thriving in a Hyper-Competitive World. Routledge. Milojicic, D. S., Kalogeraki, V., Lukose, R., Nagaraja, K., Pruyne, J., Richard, B., Rollins, S., & Xu, Z. (2002). Peer-to-peer computing. Technical Report HPL-2002-57, HP Labs. https://www.cs.kau.se/cs/education/courses/dvad02/p2/seminar4/Papers/HPL-2002-57R1.pdf Momoh, M. O., Chinedu, P. U., Nwankwo, W., Aliu, D., & Shaba, M. S. (2021). BLOCKCHAIN ADOPTION: APPLICATIONS AND CHALLENGES. International Journal of Software Engineering and Computer Systems, 7(2), Article 2. https://doi.org/10.15282/ijsecs.7.2.2021.3.0086 Mougayar, W. (2016). The Business Blockchain: Promise, Practice, and Application of the Next Internet Technology. John Wiley & Sons. O’Dair, M., Beaven, Z., Neilson, D., Osborne, R., & Pacifico, P. (2016). Music on the Blockchain. Ojasalo, J. (2008). Management of innovation networks: A case study of different approaches. European Journal of Innovation Management, 11(1), 51–86. https://doi.org/10.1108/14601060810845222 Oliveira, T. A., Oliver, M., & Ramalhinho, H. (2020). Challenges for Connecting Citizens and Smart Cities: ICT, E-Governance and Blockchain. Sustainability, 12(7), Article 7. https://doi.org/10.3390/su12072926 Ølnes, S., Ubacht, J., & Janssen, M. (2017). Blockchain in government: Benefits and implications of distributed ledger technology for information sharing. Government Information Quarterly, 34(3), 355–364. https://doi.org/10.1016/j.giq.2017.09.007 philsoophian, M., Akhavan, P., & Namvar, M. (2021). The mediating role of blockchain technology in improvement of knowledge sharing for supply chain management. Management Decision, 60(3), 784–805. https://doi.org/10.1108/MD-08-2020-1122 Porras, E. R. (2023). Intellectual Property and the Blockchain Sector, a World of Potential Economic Growth and Conflict. IntechOpen. https://doi.org/10.5772/intechopen.1001882 Potts, J., & Rennie, E. (2019). Web3 and the creative industries: How blockchains are reshaping business models. In A Research Agenda for Creative Industries (pp. 93–111). Edward Elgar Publishing. https://www.elgaronline.com/display/edcoll/9781788118576/9781788118576.00013.xml Quah, D. (2003). Digital Goods and the New Economy (SSRN Scholarly Paper No. 410604). https://papers.ssrn.com/abstract=410604 Ray, P. P. (2023). Web3: A comprehensive review on background, technologies, applications, zero-trust architectures, challenges and future directions. Internet of Things and Cyber-Physical Systems, 3, 213–248. https://doi.org/10.1016/j.iotcps.2023.05.003 Rejeb, A., Keogh, J. G., & Treiblmaier, H. (2019). Leveraging the Internet of Things and Blockchain Technology in Supply Chain Management. Future Internet, 11(7), Article 7. https://doi.org/10.3390/fi11070161 Risius, M., & Spohrer, K. (2017). A Blockchain Research Framework. Business & Information Systems Engineering, 59(6), 385–409. https://doi.org/10.1007/s12599-017-0506-0 Savelyev, A. (2018). Copyright in the blockchain era: Promises and challenges. Computer Law & Security Review, 34(3), 550–561. https://doi.org/10.1016/j.clsr.2017.11.008 Schiuma, G., Schettini, E., & Santarsiero, F. (2021). How Wise Companies Drive Digital Transformation. Journal of Open Innovation: Technology, Market, and Complexity, 7(2), Article 2. https://doi.org/10.3390/joitmc7020122 Soares, M. N., & Kauffman, M. E. (2018). Industry 4.0: Horizontal Integration and Intellectual Property Law Strategies In England. Revista Opinião Jurídica (Fortaleza), 16(23), Article 23. https://doi.org/10.12662/2447-6641oj.v16i23.p268-289.2018 Song, J. G., Kang, E. seon, Shin, H. W., & Jang, J. W. (2021). A Smart Contract-Based P2P Energy Trading System with Dynamic Pricing on Ethereum Blockchain. Sensors, 21(6), Article 6. https://doi.org/10.3390/s21061985 Swan, M. (2015). Blockchain: Blueprint for a New Economy. O’Reilly Media, Inc. Tartan, C. (2023). A Blockchain-Based Welfare Distribution Model for Digital Inclusivity. REGION, 10(1), Article 1. https://doi.org/10.18335/region.v10i1.434 Taskinsoy, J. (2019). Blockchain: Moving Beyond Bitcoin into a Digitalized World (SSRN Scholarly Paper No. 3471413). https://doi.org/10.2139/ssrn.3471413 Tavoletti, E., Kazemargi, N., Cerruti, C., Grieco, C., & Appolloni, A. (2021). Business model innovation and digital transformation in global management consulting firms. European Journal of Innovation Management, 25(6), 612–636. https://doi.org/10.1108/EJIM-11-2020-0443 Truong, V. T., Le, L., & Niyato, D. (2023). Blockchain Meets Metaverse and Digital Asset Management: A Comprehensive Survey. IEEE Access, 11, 26258–26288. https://doi.org/10.1109/ACCESS.2023.3257029 van Haaften-Schick, L., & Whitaker, A. (2022). From the Artist’s Contract to the blockchain ledger: New forms of artists’ funding using equity and resale royalties. Journal of Cultural Economics, 46(2), 287–315. https://doi.org/10.1007/s10824-022-09445-8 Walch, A. (2018). Deconstructing ‘Decentralization’: Exploring the Core Claim of Crypto Systems. Institute for International Economic Law at Georgetown Law School on Nov, 5, 8. Walch, A. (2019). In code (rs) we trust: Software developers as fiduciaries in public blockchains. Wan, Y., Gao, Y., & Hu, Y. (2022). Blockchain application and collaborative innovation in the manufacturing industry: Based on the perspective of social trust. Technological Forecasting and Social Change, 177, 121540. https://doi.org/10.1016/j.techfore.2022.121540 Wang, Y., Zuest, P., Yao, Y., Lu, Z., & Wattenhofer, R. (2022). Impact and User Perception of Sandwich Attacks in the DeFi Ecosystem. CHI Conference on Human Factors in Computing Systems, 1–15. https://doi.org/10.1145/3491102.3517585 Wang, Z., Li, M., Lu, J., & Cheng, X. (2022). Business Innovation based on artificial intelligence and Blockchain technology. Information Processing & Management, 59(1), 102759. https://doi.org/10.1016/j.ipm.2021.102759 Wright, C. S. (2008). Bitcoin: A Peer-to-Peer Electronic Cash System. SSRN Electronic Journal. https://doi.org/10.2139/ssrn.3440802 Wrigley, C., Bucolo, S., & Straker, K. (2016). Designing new business models: Blue sky thinking and testing. Journal of Business Strategy, 37(5), 22–31. https://doi.org/10.1108/JBS-04-2015-0041 Xu, M., Chen, X., & Kou, G. (2019). A systematic review of blockchain. Financial Innovation, 5(1), 27. https://doi.org/10.1186/s40854-019-0147-z Xu, M., Ng, W. C., Lim, W. Y. B., Kang, J., Xiong, Z., Niyato, D., Yang, Q., Shen, X. S., & Miao, C. (2022). A Full Dive into Realizing the Edge-enabled Metaverse: Visions, Enabling Technologies,and Challenges (arXiv:2203.05471). arXiv. https://doi.org/10.48550/arXiv.2203.05471 Yahya, A., & Habbal, A. (2021). Music Royalty Payment Scheme Using Blockchain Technology. 2021 5th International Symposium on Multidisciplinary Studies and Innovative Technologies (ISMSIT), 539–545. https://doi.org/10.1109/ISMSIT52890.2021.9604559 Zema, E. (2022, April 20). A new era for digital payment industry focusing on cryptocurrencies and central bank digital currencies [Master’s Degree Thesis]. Luiss Guido Carli. http://tesi.luiss.it/33023/ Žemaitis, E. (2014). Knowledge Management in Open Innovation Paradigm Context: High Tech Sector Perspective. Procedia – Social and Behavioral Sciences, 110, 164–173. https://doi.org/10.1016/j.sbspro.2013.12.859 Watch: Socioeconomic impact of micropayments New to blockchain? Check out CoinGeek’s Blockchain for Beginners section, the ultimate resource guide to learn more about blockchain technology. TAGGED BITCOIN SVBLUE SKY THINKINGBSV BLOCKCHAINCOPYRIGHTDESIGN THINKINGINNOVATION AMBITION MATRIXINNOVATION MANAGEMENTINTELLECTUAL PROPERTYLEAN STARTUPMICROPAYMENTSOPEN INNOVATIONTHREE HORIZONS OF GROWTH",
    "originSummary": [
      "The text discusses how blockchain technology can revolutionize copyright and patent distribution in innovation management.",
      "Integrating blockchain in innovation processes can enhance collaboration, transparency, automate tracking, and reward innovation outcomes.",
      "The use of Bitcoin SV (BSV) in music rights management is highlighted for its scalability and cost-effectiveness compared to Ethereum."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699883904369
  }
]
