[
  {
    "id": 39804214,
    "title": "Sunucu Performansı için Temel Linux Kriz Araçları",
    "originLink": "https://www.brendangregg.com/blog/2024-03-24/linux-crisis-tools.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39804214",
    "commentBody": "",
    "originSummary": [
      "Brendan Gregg'in blogu, Linux sunucuları için kriz araçlarına vurgu yaparak sistem performans analizi hakkında değerli bilgiler ve öneriler sunuyor.",
      "Kesintiler sırasında performans sorunlarını derhal teşhis etmek ve düzeltmek için temel araçların önceden kurulmasını öneriyor.",
      "Blogda son makaleler, yaklaşan etkinlikler ve sistem performansı ve gözlemlenebilirlik ile ilgili bir dizi konu tartışılmaktadır."
    ],
    "commentSummary": [],
    "points": 331,
    "commentCount": 71,
    "retryCount": 0,
    "time": 1711241504
  },
  {
    "id": 39801088,
    "title": "Akış Hakimiyetinin Ortasında Blu-ray için Bir Canlanma",
    "originLink": "https://www.audioholics.com/news/a-return-to-blu-ray-as-streaming-value-evaporates",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39801088",
    "commentBody": "",
    "originSummary": [
      "Makale, yayın hizmetlerinin popülaritesi nedeniyle film diski medyasının gelirindeki düşüşü incelemekte ve fiziksel medyanın pazardaki geçerliliğini sürdürmesi için argümanlar sunmaktadır.",
      "Yayın sektöründeki şiddetli rekabete, sürdürülebilirlik endişelerine ve gelecekte fiziksel medyaya olası bir dönüşe vurgu yapıyor.",
      "Yazar, kişisel olarak satın aldığı premium Blu-ray baskısını ve fiziksel medya koleksiyonculuğuna olan duygusal bağlılığını gerekçe göstererek fiziksel medyayı desteklemeyi teşvik ediyor."
    ],
    "commentSummary": [
      "Makale, kullanıcı memnuniyetsizliği nedeniyle akış hizmetleri yerine medya tüketimi için Blu-ray disklerin yeniden canlanmasını araştırıyor.",
      "Kişisel medya sunucularının kurulması, DVD'lerin kopyalanması ve medya içeriğinin paylaşılmasıyla ilgili yasal ve etik konular ele alınmaktadır.",
      "Kullanıcılar fiziksel medyanın akışa karşı artılarını ve eksilerini, sunucu bakımının zorluklarını ve DRM yasalarının karmaşıklığını tartışıyor."
    ],
    "points": 262,
    "commentCount": 293,
    "retryCount": 0,
    "time": 1711211407
  },
  {
    "id": 39803508,
    "title": "San Andrés Tetepilco'da Yeni Aztek Kodeksleri Ortaya Çıkarıldı",
    "originLink": "https://tlacuilolli.com/2024/03/21/new-aztec-codices-the-codices-of-san-andres-tetepilco/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39803508",
    "commentBody": "",
    "originSummary": [
      "Ulusal Antropoloji ve Tarih Enstitüsü uzmanları Mexico City'deki San Andrés Tetepilco'da üç yeni Aztek kodeksi bularak 1603 yılına kadar Culhuacan ve Tenochtitlan yönetimlerine ilişkin tarihi ayrıntıları ortaya çıkardı.",
      "Keşif, yeni ikonografi ve Aztek yazısını sergileyerek daha önce belirsiz olan glifleri ve iletişim yöntemlerini açıklığa kavuşturuyor.",
      "Meksika hükümeti kodeksleri şimdi Ulusal Antropoloji ve Tarih Enstitüsü'nde tutuyor ve gelecekte yayınlanması için heyecan uyandırıyor."
    ],
    "commentSummary": [
      "Meksika'nın San Andrés Tetepilco kentinde, Meksika hükümeti tarafından yerel bir aileden satın alınan ve multispektral görüntüleme altında görülebilen daha önce silinmiş Aztek metinlerini içerdiğine inanılan yeni Aztek kodeksleri bulundu.",
      "Keşif, mevcut Aztek kodeksleri koleksiyonunu genişleterek, San Andrés Tetepilco'nun kuruluşu ve Tenochtitlan yönetimi hakkında ayrıntılar da dahil olmak üzere Aztek tarihi ve kültürü hakkında yeni bakış açıları sunuyor.",
      "Araştırmacılar önümüzdeki yıllarda kodeksler üzerinde daha derinlemesine analizler yapmayı ve Aztek öncesi ve fetih sonrası tarihi olaylara dair içgörüleri ortaya çıkarmayı planlıyor."
    ],
    "points": 232,
    "commentCount": 17,
    "retryCount": 0,
    "time": 1711233267
  },
  {
    "id": 39803845,
    "title": "Erken Başlangıçlı Kanser İnsidansı 1990'dan 2019'a %80 Arttı",
    "originLink": "https://bmjoncology.bmj.com/content/2/1/e000049#DC1",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39803845",
    "commentBody": "",
    "originSummary": [
      "Makale, 1990'dan 2019'a kadar erken başlangıçlı kanserdeki küresel eğilimleri inceleyerek, artan yükü ve diyet ve genetik gibi temel risk faktörlerini ortaya koyuyor.",
      "Bu eğilimlerle etkili bir şekilde mücadele etmek için sağlıklı yaşam ve erken tarama programlarının önemini vurgular.",
      "Yaşam tarzı, hava kalitesi ve genetik varyasyonların meme ve kolorektal kanseri nasıl etkilediğini tartışırken, diyabet, mide kanseri ve Helicobacter Pylori enfeksiyonu epidemiyolojisi hakkında da bilgi veriyor."
    ],
    "commentSummary": [
      "Tartışmada, 50 yaşın altındaki bireyler arasında kanser oranlarındaki artışa dikkat çekilerek, bu durum kirlilik ve aşırı antibiyotik kullanımı gibi faktörlere bağlanıyor ve tıp sektöründe dikkatli olunması gerektiği vurgulanıyor.",
      "Mikroplastiklerin insan sağlığı üzerindeki etkisini, gelişmekte olan ülkelerde artan obezite ve kanser prevalansını ve Batılılaşmış diyetlerin etkisini araştırıyor.",
      "Söyleşide ayrıca modern sağlık hizmetlerinin kanseri önlemedeki etkinliği, erken başlangıçlı kanserde çevresel unsurların rolü ve östrojen, kırmızı et alımı ve kansere yatkınlık arasındaki bağlantılar da ele alınıyor."
    ],
    "points": 227,
    "commentCount": 127,
    "retryCount": 0,
    "time": 1711237289
  },
  {
    "id": 39799752,
    "title": "Feedle: Blogları ve Podcast'leri Kolaylıkla Keşfedin",
    "originLink": "https://feedle.world/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39799752",
    "commentBody": "",
    "originSummary": [
      "Feedle, kullanıcıların blog veya podcast gönderebilecekleri ve milyonlarca gönderi ve bölüm arasında arama yapabilecekleri bir platformdur.",
      "Kullanıcılar, tercihlerine uyan yeni içeriklerle ilgili güncellemeleri almak için RSS beslemelerine abone olabilirler.",
      "Feedle, kullanıcıları ilgi alanlarına uygun yeni içerik oluşturucularla buluşturarak Mastodon'daki kullanıcı topluluğunu büyütmeyi hedefliyor."
    ],
    "commentSummary": [
      "Yazı, kullanıcıların deneyimlerini paylaştığı ve içerik toplama ve kitle katılımı için çözümler önerdiği özgün düşünce kaynakları olarak blogların değerini inceliyor.",
      "Konular hakkında çelişkili bakış açıları ve anlaşmalar sunan bir arama motoru sunarak blog aramasını ve kategorizasyonunu geliştirmeyi vurgulamaktadır.",
      "Kullanıcılar ayrıca Feedle'ın içerik keşif platformunu överken podcast filtreleme ve ön uç geliştirmeleri için önerilerde bulunarak ölü bağlantıların ortadan kaldırılmasını, SEO spam ile mücadele edilmesini ve çoklu dil desteğinin dahil edilmesini savunuyor."
    ],
    "points": 224,
    "commentCount": 59,
    "retryCount": 0,
    "time": 1711200186
  },
  {
    "id": 39802157,
    "title": "Pine Bluff'u Satın Alan Teknoloji Patronu",
    "originLink": "https://maxread.substack.com/p/the-man-who-bought-pine-bluff-arkansas",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39802157",
    "commentBody": "",
    "originSummary": [
      "Kod parçacığı, açık ve koyu renk şemaları için CSS stili, başarı ve hata mesajları için görüntüler, düğme ve bağlantı stili ve base64 kodlu SVG görüntüleri içerir.",
      "Şifrelenmiş veri alanları ve zorlu bir platform ortamında URL'leri ve tarayıcı geçmişini değiştirmek için bir JavaScript kod parçacığı içerir."
    ],
    "commentSummary": [
      "Pine Bluff, Arkansas'ta bir adamın benzersiz satın alımlarını ve projelerini inceleyen bir makale, bunların pratikliği ve toplumsal etkileri üzerine tartışmaları ateşliyor.",
      "Asgari ücret düzenlemeleri, mali mücadeleler, ekonomik gerileme, sosyal sorunlar ve tartışmalı kendin yap girişimleri gibi temaları araştırıyor.",
      "Haberde ayrıca, aktivistlerin talepleri doğrultusunda maymunların bir araştırma merkezinden bir barınağa nakledilmesine de yer veriliyor."
    ],
    "points": 208,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1711219268
  },
  {
    "id": 39801399,
    "title": "Lapdev: Uzaktan Geliştirme Ortamı Yönetimini Kolaylaştırın",
    "originLink": "https://github.com/lapce/lapdev",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39801399",
    "commentBody": "",
    "originSummary": [
      "Lapdev, Devcontainer açık spesifikasyonunu kullanarak kişisel sunucularda veya bulutlarda uzak geliştirme ortamlarının yönetimini kolaylaştıran, kendi kendine barındırılan bir uygulamadır.",
      "Geliştirme ortamlarını kod olarak düzenler, ölçeklenebilirlik ve basit çoğaltma sağlar, minimum kurulum ve bakım gereksinimlerini vurgular.",
      "Lapdev'in yol haritası, çeşitli çalışma alanı türlerini ve işletim sistemlerini desteklemek gibi potansiyel geliştirmeleri içeriyor ve ayrıntılı kurulum talimatları ve katkı yönergeleri web sitelerinde mevcut."
    ],
    "commentSummary": [
      "Github'daki odak noktası, docker-compose ve JetBrains'in uzaktan SSH geliştirme yazılımına kıyasla yeni açık kaynaklı uzaktan geliştirme ortamı yönetim yazılımı Lapdev'dir.",
      "Kullanıcılar, deneyimleri iyileştirmeyi ve kurulumları otomatikleştirmeyi vurgulayarak faydaları ve şüpheciliği tartışıyor, devcontainers ve Visual Studio Code gibi uzaktan geliştirme seçeneklerini keşfediyor.",
      "Docker kurulumlarını manuel olarak yapılandırmanın zorlukları, konteynerizasyon için yapılandırma dosyalarından yararlanma ve geliştiriciler için dağıtım süreçlerini basitleştirmenin önemi konuşmada vurgulandı."
    ],
    "points": 191,
    "commentCount": 45,
    "retryCount": 0,
    "time": 1711213662
  },
  {
    "id": 39800026,
    "title": "Bir Devrimcinin Son Duruşu",
    "originLink": "https://chinabooksreview.com/2023/10/19/a-spark-extinguished/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39800026",
    "commentBody": "",
    "originSummary": [
      "Eski komünist Zhang Chunyuan, öğrencileriyle birlikte Çin Komünist Partisi'ni eleştirmek ve çiftçilerin karşı devrimci eylemler nedeniyle hapis ve nihayetinde idamla karşı karşıya kaldıkları zorlukları tartışmak için Spark adlı bir dergi oluşturur.",
      "Zhang, hükümetin tarihi sansür çabalarına karşı direnişe ilham vermeyi amaçlayarak, zorlukların ortasında ortağı Tan'a olan aşkını cesurca ifade ediyor.",
      "Zhang'ın hikayesi, hükümet baskısıyla mücadele etmek ve ifade özgürlüğünü korumak için yapılan kişisel fedakarlıkları vurguluyor."
    ],
    "commentSummary": [
      "Makale, film yapımcısı Hu Jie'nin Çin'deki bir siyasi hareketten hayatta kalanlara odaklanan ve tarihsel yönetim modelleriyle paralellikler kuran \"Spark\" adlı belgeselini inceliyor.",
      "Yorumlar, mevcut Çin hükümeti ile eski imparatorluk sistemi arasındaki benzerliklerin altını çizerek, siyasi liderlikte geçmiş trajedilerden ders çıkarmanın önemini vurguluyor.",
      "Tartışmalar otoriter rejimlerin güçlü ve zayıf yönlerini, siyasette zihin kontrol teknolojisinin risklerini ve tarihsel hafıza kaybının siyasi sistemler üzerindeki etkisini kapsıyor."
    ],
    "points": 176,
    "commentCount": 23,
    "retryCount": 0,
    "time": 1711202807
  },
  {
    "id": 39801991,
    "title": "Eski Döner Telefonlar İnteraktif Deneyimle MoMA Sergisini Canlandırıyor",
    "originLink": "https://github.com/mnutt/rotary",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39801991",
    "commentBody": "",
    "originSummary": [
      "Döner Telefon Projesi, interaktif bir deneyim için Asterisk ve Grandstream cihazlarına bağlı eski döner telefonları kullanarak bir MoMA sergisini yeniden yaratıyor.",
      "Bir sunucuda Asterisk'i kurmayı, döner telefonu bağlamayı, ses dosyalarını çalmayı ve telefon görüşmeleri için Twilio'yu yapılandırmayı içerir.",
      "Proje, MTA tren durumlarını kontrol etme, girdi kabul etme ve şakaları paylaşma gibi özellikler sunarak yazarın oğluna neşe getirirken, SIP bağlantılarında hata ayıklama gibi zorluklar da sunuyor."
    ],
    "commentSummary": [
      "Döner Telefon Projesi, 1970'lerden kalma bir döner telefonu Nvidia Jetson gibi modern teknolojilerle güncelleyerek sorulara yanıt vermek, masal okumak ve terapi seansları düzenlemek gibi etkileşimli özellikler sunuyor.",
      "Nostalji ve en son yapay zeka teknolojisinin bu karışımı, farklı ve büyüleyici bir kullanıcı deneyimi ile sonuçlanır.",
      "Proje, onu çoğaltmak veya geliştirmek isteyen çok sayıda kullanıcıdan büyük ilgi gördü, bu da popülerliğini ve daha fazla özelleştirme potansiyelini gösteriyor."
    ],
    "points": 169,
    "commentCount": 31,
    "retryCount": 0,
    "time": 1711218081
  },
  {
    "id": 39801963,
    "title": "Intel 8088: Komut Önceden Alma Devresinin Paketinden Çıkarılması",
    "originLink": "https://www.righto.com/2024/03/8088-prefetch-circuitry.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39801963",
    "commentBody": "",
    "originSummary": [
      "Ken Shirriff'in blogu, Intel 8088 mikroişlemcisinin derinlemesine bir analizini sunuyor, özellikle de ön-getirme devresine ve performans etkilerine odaklanıyor.",
      "Blog 8086 ve 8088'i karşılaştırmakta, IBM PC için 8088'i tercih eden karar verme sürecini detaylandırmakta ve Veri Yolu Arayüz Birimi ile Yürütme Biriminin rollerini açıklamaktadır.",
      "Konular arasında prefetch kuyruğu senkronizasyonu, komut kod çözücü, flip-floplar ve kontrol hatları gibi işlemci tasarım öğeleri ve bellek işlemlerinde önbelleklerin önemi yer almaktadır. Blogda ayrıca 2008'den bu yana elektronik, programlama ve uzay araştırmaları konularına da değiniliyor."
    ],
    "commentSummary": [
      "Makale, Intel 8088 işlemcinin komut önbellek devresinden IBM PC'lerdeki temel RAM konfigürasyonlarının tarihsel gelişimine kadar çeşitli konuları kapsamaktadır.",
      "Elektronikte zamanlama testlerinin önemini, yaygın internet erişiminden önce teknik sorun gidermede karşılaşılan zorlukları ve 8086/8088 gibi işlemcilerin tasarım tercihlerini ve maliyet etkilerini araştırıyor.",
      "Tartışmalar ayrıca CPUID komut geçmişini, Pentium gibi işlemcilerdeki ön bellek yapılandırmalarını ve CPUID tanıtılmadan önce işlemci tipi tanımlama için kullanılan teknikleri de ele almaktadır."
    ],
    "points": 160,
    "commentCount": 32,
    "retryCount": 0,
    "time": 1711217872
  }
]
