[
  {
    "id": 39804214,
    "title": "أدوات أزمات Linux الأساسية لأداء الخادم",
    "originLink": "https://www.brendangregg.com/blog/2024-03-24/linux-crisis-tools.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39804214",
    "commentBody": "",
    "originSummary": [
      "تقدم مدونة Brendan Gregg رؤى واقتراحات قيمة حول تحليل أداء النظام ، مع التركيز على أدوات الأزمات لخوادم Linux.",
      "ويوصي بالتثبيت المسبق للأدوات الرئيسية لتشخيص مشاكل الأداء وإصلاحها على الفور أثناء الانقطاع.",
      "تناقش المدونة المقالات الأخيرة والأحداث القادمة ومجموعة من الموضوعات المتعلقة بأداء النظام وإمكانية الملاحظة."
    ],
    "commentSummary": [],
    "points": 331,
    "commentCount": 71,
    "retryCount": 0,
    "time": 1711241504
  },
  {
    "id": 39801088,
    "title": "إحياء ل Blu-ray وسط هيمنة البث",
    "originLink": "https://www.audioholics.com/news/a-return-to-blu-ray-as-streaming-value-evaporates",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39801088",
    "commentBody": "",
    "originSummary": [
      "يستكشف المقال الانخفاض في إيرادات وسائط أقراص الأفلام بسبب شعبية خدمات البث ، ويقدم حججا لاستمرار أهمية الوسائط المادية في السوق.",
      "ويؤكد على المنافسة الشرسة في قطاع البث ، ومخاوف الاستدامة ، والعودة المحتملة إلى الوسائط المادية في المستقبل.",
      "يروج المؤلف لدعم الوسائط المادية ، مستشهدا باكتسابهم الشخصي لإصدار Blu-ray المتميز والتعلق العاطفي بجمع الوسائط المادية."
    ],
    "commentSummary": [
      "يستكشف المقال عودة ظهور أقراص Blu-ray لاستهلاك الوسائط عبر خدمات البث بسبب استياء المستخدم.",
      "يناقش إعداد خوادم الوسائط الشخصية ، ونسخ أقراص DVD ، والتنقل في القضايا القانونية والأخلاقية المتعلقة بمشاركة محتوى الوسائط.",
      "يناقش المستخدمون إيجابيات وسلبيات الوسائط المادية مقابل البث ، وتحديات صيانة الخادم ، وتعقيدات قوانين إدارة الحقوق الرقمية."
    ],
    "points": 262,
    "commentCount": 293,
    "retryCount": 0,
    "time": 1711211407
  },
  {
    "id": 39803508,
    "title": "تم الكشف عن مخطوطات الأزتك الجديدة في سان أندريس تيتيبيلكو",
    "originLink": "https://tlacuilolli.com/2024/03/21/new-aztec-codices-the-codices-of-san-andres-tetepilco/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39803508",
    "commentBody": "",
    "originSummary": [
      "وجد متخصصون من المعهد الوطني للأنثروبولوجيا والتاريخ ثلاث مخطوطات جديدة من الأزتك في سان أندريس تيتيبيلكو ، مكسيكو سيتي ، تكشف النقاب عن تفاصيل تاريخية عن سياسات كولهواكان وتينوختيتلان حتى عام 1603.",
      "يعرض الاكتشاف أيقونات جديدة وكتابات الأزتك ، موضحا الحروف الرسومية وطرق الاتصال الغامضة سابقا.",
      "تضم الحكومة المكسيكية الآن المخطوطات في المعهد الوطني للأنثروبولوجيا والتاريخ ، مما أثار الحماس لنشرها في المستقبل."
    ],
    "commentSummary": [
      "تم العثور على مخطوطات أزتيك جديدة في سان أندريس تيتيبيلكو ، المكسيك ، حصلت عليها الحكومة المكسيكية من عائلة محلية ، يعتقد أنها تحتوي على نص أزتيك تم محوه سابقا ومرئيا تحت التصوير متعدد الأطياف.",
      "يوسع الاكتشاف المجموعة الحالية من مخطوطات الأزتك ، ويقدم وجهات نظر جديدة حول تاريخ وثقافة الأزتك ، بما في ذلك تفاصيل حول إنشاء سان أندريس تيتيبيلكو ونظام تينوختيتلان.",
      "يخطط الباحثون لإجراء مزيد من التحليل المتعمق للمخطوطات في السنوات القادمة ، وكشف النقاب عن رؤى حول الأحداث التاريخية قبل الأزتك وما بعد الفتح."
    ],
    "points": 232,
    "commentCount": 17,
    "retryCount": 0,
    "time": 1711233267
  },
  {
    "id": 39803845,
    "title": "ارتفاع معدل الإصابة بالسرطان المبكر بنسبة 80٪ من عام 1990 إلى عام 2019",
    "originLink": "https://bmjoncology.bmj.com/content/2/1/e000049#DC1",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39803845",
    "commentBody": "",
    "originSummary": [
      "يتعمق المقال في الاتجاهات العالمية في ظهور السرطان المبكر من عام 1990 إلى عام 2019 ، ويعرض العبء المتزايد وعوامل الخطر الرئيسية مثل النظام الغذائي وعلم الوراثة.",
      "يؤكد على أهمية الحياة الصحية وبرامج الفحص المبكر لمكافحة هذه الاتجاهات بشكل فعال.",
      "يناقش كيفية تأثير نمط الحياة وجودة الهواء والاختلافات الجينية على سرطان الثدي وسرطان القولون والمستقيم ، إلى جانب رؤى حول مرض السكري وسرطان المعدة ووبائيات عدوى هيليكوباكتر بيلوري."
    ],
    "commentSummary": [
      "تسلط المناقشة الضوء على الارتفاع في معدلات الإصابة بالسرطان بين الأفراد الذين تقل أعمارهم عن 50 عاما ، وتعزو ذلك إلى عوامل مثل التلوث والاستخدام المفرط للمضادات الحيوية ، مع التأكيد على الحذر في القطاع الطبي.",
      "يستكشف تأثير اللدائن الدقيقة على صحة الإنسان ، وزيادة انتشار السمنة والسرطان في الدول النامية ، وتأثير النظم الغذائية الغربية.",
      "تتعمق المحادثة أيضا في فعالية الرعاية الصحية الحديثة في الوقاية من السرطان ، ودور العناصر البيئية في الإصابة المبكرة بالسرطان ، والروابط بين هرمون الاستروجين ، وتناول اللحوم الحمراء ، وقابلية الإصابة بالسرطان."
    ],
    "points": 227,
    "commentCount": 127,
    "retryCount": 0,
    "time": 1711237289
  },
  {
    "id": 39799752,
    "title": "Feedle: اكتشف المدونات والبودكاست بسهولة",
    "originLink": "https://feedle.world/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39799752",
    "commentBody": "",
    "originSummary": [
      "Feedle عبارة عن منصة حيث يمكن للمستخدمين إرسال المدونات أو البودكاست والبحث في ملايين المنشورات والحلقات.",
      "يمكن للمستخدمين الاشتراك في موجزات RSS لتلقي تحديثات حول المحتوى الجديد المطابق لتفضيلاتهم.",
      "تهدف Feedle إلى تنمية مجتمع مستخدميها على Mastodon من خلال ربط المستخدمين بمنشئي محتوى جدد متوافقين مع اهتماماتهم."
    ],
    "commentSummary": [
      "يتعمق المنشور في قيمة المدونات كمصادر للفكر الأصلي ، حيث يتبادل المستخدمون الخبرات ويقترحون حلولا لتجميع المحتوى ومشاركة الجمهور.",
      "ويشدد على تعزيز البحث في المدونات وتصنيفها من خلال إدخال محرك بحث يقدم وجهات نظر واتفاقات متناقضة حول الموضوعات.",
      "يدافع المستخدمون أيضا عن التخلص من الروابط الميتة ، ومحاربة البريد العشوائي لتحسين محركات البحث ، ودمج الدعم متعدد اللغات ، مع الثناء على منصة اكتشاف محتوى Feedle واقتراحات لتصفية البودكاست وتحسينات الواجهة الأمامية."
    ],
    "points": 224,
    "commentCount": 59,
    "retryCount": 0,
    "time": 1711200186
  },
  {
    "id": 39802157,
    "title": "قطب التكنولوجيا الذي استحوذ على باين بلاف",
    "originLink": "https://maxread.substack.com/p/the-man-who-bought-pine-bluff-arkansas",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39802157",
    "commentBody": "",
    "originSummary": [
      "يتميز مقتطف الشفرة بتصميم CSS لأنظمة الألوان الفاتحة والداكنة ، وصور لرسائل النجاح والخطأ ، وتصميم الأزرار والارتباط ، وصور SVG المشفرة base64.",
      "يتضمن حقول بيانات مشفرة ومقتطف شفرة جافا سكريبت لتعديل عناوين URL وسجل المتصفح في إعداد النظام الأساسي للتحدي."
    ],
    "commentSummary": [
      "مقال يتعمق في مشتريات ومشاريع الرجل الفريدة في باين بلاف ، أركنساس ، مما يشعل المناقشات حول عمليتها وآثارها المجتمعية.",
      "يستكشف موضوعات مثل لوائح الحد الأدنى للأجور ، والصراعات المالية ، والانكماش الاقتصادي ، والمشاكل الاجتماعية ، ومبادرات افعلها بنفسك المثيرة للجدل.",
      "ويغطي المقال أيضا نقل من مركز أبحاث إلى ملاذ بناء على مطالب النشطاء."
    ],
    "points": 208,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1711219268
  },
  {
    "id": 39801399,
    "title": "Lapdev: تبسيط إدارة بيئة التطوير عن بعد",
    "originLink": "https://github.com/lapce/lapdev",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39801399",
    "commentBody": "",
    "originSummary": [
      "Lapdev هو تطبيق مستضاف ذاتيا يسهل إدارة بيئات التطوير عن بعد على الخوادم الشخصية أو السحب باستخدام مواصفات Devcontainer المفتوحة.",
      "إنه يبسط بيئات التطوير كرمز ، مما يضمن قابلية التوسع والنسخ المتماثل البسيط ، مع التركيز على الحد الأدنى من متطلبات التثبيت والصيانة.",
      "تتضمن خارطة طريق Lapdev تحسينات محتملة مثل دعم أنواع مختلفة من مساحات العمل وأنظمة التشغيل ، مع تعليمات التثبيت التفصيلية وإرشادات المساهمة المتاحة على موقع الويب الخاص بهم."
    ],
    "commentSummary": [
      "ينصب التركيز على Github على برنامج إدارة بيئة التطوير عن بعد الجديد مفتوح المصدر Lapdev ، مقارنة ب docker-compose ومطور SSH عن بعد من JetBrains.",
      "يناقش المستخدمون الفوائد والشكوك ويستكشفون خيارات التطوير عن بعد مثل حاويات التطوير و Visual Studio Code ، مع التركيز على تحسين التجارب وأتمتة الإعدادات.",
      "يتم تسليط الضوء على تحديات تكوين إعدادات Docker يدويا ، واستخدام ملفات التكوين للحاويات ، وأهمية تبسيط عمليات النشر للمطورين في المحادثة."
    ],
    "points": 191,
    "commentCount": 45,
    "retryCount": 0,
    "time": 1711213662
  },
  {
    "id": 39800026,
    "title": "الموقف الأخير للثوري",
    "originLink": "https://chinabooksreview.com/2023/10/19/a-spark-extinguished/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39800026",
    "commentBody": "",
    "originSummary": [
      "أنشأ الشيوعي السابق تشانغ تشون يوان مجلة ، سبارك ، مع الطلاب لنقد الحزب الشيوعي الصيني ومناقشة تحديات المزارعين ، الذين يواجهون السجن والإعدام في نهاية المطاف بسبب أعمال معادية للثورة.",
      "يعبر تشانغ بشجاعة عن حبه لشريكه تان وسط الشدائد ، بهدف إلهام المقاومة ضد جهود الرقابة التاريخية للحكومة.",
      "تسلط قصة تشانغ الضوء على التضحيات الشخصية التي بذلت لمكافحة القمع الحكومي ودعم حرية التعبير."
    ],
    "commentSummary": [
      "يتعمق المقال في الفيلم الوثائقي للمخرج هو جي \"سبارك\" ، مع التركيز على الناجين من حركة سياسية صينية ورسم أوجه تشابه مع أنماط الحكم التاريخية.",
      "وتسلط التعليقات الضوء على أوجه التشابه بين الحكومة الصينية الحالية والنظام الإمبراطوري القديم، مشددة على أهمية التعلم من مآسي الماضي في القيادة السياسية.",
      "تغطي المناقشات نقاط القوة والضعف في الأنظمة الاستبدادية ، ومخاطر تكنولوجيا التحكم في العقل في السياسة ، وتأثير فقدان الذاكرة التاريخي على الأنظمة السياسية."
    ],
    "points": 176,
    "commentCount": 23,
    "retryCount": 0,
    "time": 1711202807
  },
  {
    "id": 39801991,
    "title": "الهواتف الدوارة القديمة تحيي معرض MoMA من خلال التجربة التفاعلية",
    "originLink": "https://github.com/mnutt/rotary",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39801991",
    "commentBody": "",
    "originSummary": [
      "يعيد مشروع الهاتف الدوار إنشاء معرض MoMA باستخدام الهواتف الدوارة القديمة المتصلة بأجهزة Asterisk و Grandstream للحصول على تجربة تفاعلية.",
      "يتضمن إعداد علامة النجمة على الخادم ، وتوصيل الهاتف الدوار ، وتشغيل الملفات الصوتية ، وتكوين Twilio للمكالمات الهاتفية.",
      "يقدم المشروع ميزات مثل التحقق من حالات قطار MTA ، وقبول المدخلات ، ومشاركة النكات ، مما يجلب الفرح لابن المؤلف أثناء تقديم تحديات مثل تصحيح أخطاء اتصالات SIP."
    ],
    "commentSummary": [
      "يقوم مشروع الهاتف الروتاري بتحديث هاتف دوار عام 1970 بالتكنولوجيا الحديثة ، مثل Nvidia Jetson ، لتقديم ميزات تفاعلية مثل الإجابة على الأسئلة وقراءة قصص ما قبل النوم وتوفير جلسات العلاج.",
      "ينتج عن هذا المزيج من الحنين إلى الماضي وأحدث التقنيات الذكاء الاصطناعي تجربة مستخدم مميزة وآسرة.",
      "حظي المشروع باهتمام كبير من العديد من المستخدمين الذين يتطلعون إلى تكراره أو تحسينه ، مما يشير إلى شعبيته وإمكانية تخصيصه بشكل أكبر."
    ],
    "points": 169,
    "commentCount": 31,
    "retryCount": 0,
    "time": 1711218081
  },
  {
    "id": 39801963,
    "title": "إنتل 8088: تفريغ تعليمات الجلب المسبق الدوائر",
    "originLink": "https://www.righto.com/2024/03/8088-prefetch-circuitry.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39801963",
    "commentBody": "",
    "originSummary": [
      "توفر مدونة كين شريف تحليلا متعمقا للمعالج الدقيق Intel 8088 ، مع التركيز بشكل خاص على دوائر الجلب المسبق والآثار المترتبة على الأداء.",
      "تقارن المدونة بين 8086 و 8088 ، وتوضح عملية صنع القرار لصالح 8088 لجهاز كمبيوتر IBM ، وتشرح أدوار وحدة واجهة الناقل ووحدة التنفيذ.",
      "تشمل الموضوعات مزامنة قائمة انتظار الجلب المسبق ، ووحدة فك ترميز التعليمات ، وعناصر تصميم المعالج مثل الشباشب وخطوط التحكم ، وأهمية ذاكرات التخزين المؤقت في عمليات الذاكرة. تتطرق المدونة أيضا إلى الإلكترونيات والبرمجة واستكشاف الفضاء منذ عام 2008."
    ],
    "commentSummary": [
      "تغطي المقالة موضوعات تتراوح من دائرة الجلب المسبق لتعليمات معالج Intel 8088 إلى التطور التاريخي لتكوينات ذاكرة الوصول العشوائي الأساسية في أجهزة كمبيوتر IBM.",
      "يستكشف أهمية اختبارات التوقيت في الإلكترونيات ، والتحديات التي تواجهها في استكشاف الأخطاء وإصلاحها التقنية قبل إمكانية الوصول إلى الإنترنت على نطاق واسع ، وخيارات التصميم والآثار المترتبة على تكلفة المعالجات مثل 8086/8088.",
      "تتعمق المناقشات أيضا في محفوظات تعليمات CPUID وتكوينات ذاكرة التخزين المؤقت في المعالجات مثل Pentium والتقنيات المستخدمة لتحديد نوع المعالج قبل تقديم CPUID."
    ],
    "points": 160,
    "commentCount": 32,
    "retryCount": 0,
    "time": 1711217872
  }
]
