[
  {
    "title": "Assessing the risks of blockchain oracles in decentralized finance",
    "originLink": "https://www.spglobal.com/en/research-insights/featured/special-editorial/utility-at-a-cost-assessing-the-risks-of-blockchain-oracles",
    "originBody": "S&P Global S&P Global S&P Dow Jones Indices S&P Global Market Intelligence S&P Global Mobility S&P Global Commodity Insights S&P Global Ratings S&P Global Sustainable1 Close Discover more about S&P Global’s offerings Investor Relations Investor Relations Overview Presentations Investor Fact Book News Releases Quarterly Earnings SEC Filings & Reports Executive Committee Governance Merger Information Stock & Dividends Shareholder Services Contact English 中文 Contact Us Enterprise Contacts Divisional Contacts Media Contacts Product Login Who We Are Capabilities Research & Insights Careers Events Who We Are Our Purpose & Values Our People Our History Corporate Responsibility Diversity, Equity & Inclusion Investor Relations Capabilities Overview Data & Analytics Research & Insights Ratings & Benchmarks Technology Solutions Experts S&P Dow Jones Indices S&P Global Market Intelligence S&P Global Mobility S&P Global Commodity Insights S&P Global Ratings Research & Insights Overview Research Council Markets in Motion Podcasts Videos LOOK FORWARD Careers Overview Our Culture Our Commitment Our Work Search for a Job Events Featured S&P Global Events Webinar Replays CERAWeek S&P Global Ratings Events S&P Global Market Intelligence Events S&P Global Commodity Insights Events S&P Dow Jones Indices Events S&P Global Mobility Events Our Purpose & Values Our People Our History Corporate Responsibility Diversity, Equity & Inclusion Investor Relations From S&P Global Press Release: S&P Global Merges With IHS Markit On February 28, 2022, S&P Global completed its merger with IHS Markit, the next step in delivering data, technology and expertise that accelerates progress. Read: 2021 Annual Report As great as last year was for our company, in many ways 2022 is shaping up to be even better. In February, we closed a transformative merger with IHS Markit. We believe combining our two companies will create substantial long-term value for all our stakeholders. Read: S&P Global Foundation The S&P Global Foundation is about much more than philanthropy—we are about making a difference by finding and developing essential connections between the knowledge- and skill-driven work of S&P Global and the needs of society. Overview Data & Analytics Research & Insights Ratings & Benchmarks Technology Solutions Experts S&P Dow Jones Indices S&P Global Market Intelligence S&P Global Mobility S&P Global Commodity Insights S&P Global Ratings Overview Research Council Markets in Motion Podcasts Videos LOOK FORWARD Most Popular Insights Read: Utility at a cost: Assessing the risks of blockchain oracles Oracles are protocols that enable blockchains to both import and export off-chain data for use in smart contracts, as well as enable cross-chain communication. Evaluating the risks of smart contracts also means considering the key vulnerabilities introduced by oracles: concentration, data quality and technical risks. Read: Will Oil and Gas Producers Lose Access to External Financing as Lenders Decarbonize? Despite longer-term pressures on funding sources, a focus on cash flow generation and debt repayment, along with higher oil prices and slower demand growth, has reduced external financing needs for the sector, a trend we expect to continue for the foreseeable future. Read: Metaverse and Generative AI: Envisioning the Future of Human-Computer Interaction Technology hasn’t quite caught up to the metaverse’s potential for improving human interconnectedness and emulating physical processes, but the enablement of its use cases will inevitably bear advancements in technology and computing power. Overview Our Culture Our Commitment Our Work Search for a Job Featured S&P Global Events Webinar Replays CERAWeek S&P Global Ratings Events S&P Global Market Intelligence Events S&P Global Commodity Insights Events S&P Dow Jones Indices Events S&P Global Mobility Events Utility at a cost: Assessing the risks of blockchain oracles Mohamed Damak Managing Director, Bank Ratings, S&P Global Ratings Cihan Duran Associate Director, Bank Ratings, S&P Global Ratings Alex Johnston, Research Analyst, S&P Global Market Intelligence Dhaval Patel Technical Lead, IT Data Science, S&P Global Market Intelligence Anthony Raziano Analyst, Corporate Ratings, S&P Global Ratings Josh Stokesberry Analyst, S&P Global Market Intelligence Lawrence Wilkinson Managing Director, Insurance Ratings S&P Global Ratings Andrew O’Neill, CFA Senior Director, Rating Methodologies, S&P Global Ratings Co-chair, Digitalization of Markets Research Lab This is a cross-divisional thought-leadership report issued by S&P Global with contributions by S&P Global Ratings and S&P Global Market Intelligence. Each are separate, individual divisions of S&P Global. This report does not constitute a rating action, nor was it discussed by a rating committee. Published: November 17, 2023 Highlights Oracles are protocols that enable blockchains to both import and export off-chain data for use in smart contracts, as well as enable cross-chain communication. Oracles enhance the efficacy of smart contracts by giving access to off-chain data and computing power, as well as the ability to export data off-chain to the real world. Oracles can help to address interoperability between financial market participants that use different public and private blockchains. Evaluating the risks of smart contracts also means considering the key vulnerabilities introduced by oracles: concentration, data quality and technical risks. Download this report Conducting transactions on the blockchain requires not only on-chain technology such as smart contracts to execute them, but also a way to access key inputs such as real-time prices that are observed outside the blockchain. An oracle provides a means of obtaining off-chain data, connecting the real world and decentralized finance (DeFi) systems. Interoperability issues remain a key inhibitor to wider blockchain adoption due the proliferation of public and private blockchains that do not have a native ability to transfer information back and forth. Hence, oracles unlock the power of linking traditional finance (TradFi) to DeFi. While oracles meaningfully enhance the utility of smart contracts, they introduce a number of technical, data quality and concentration risks. These risks qualify as new operational risks, in our view, and can affect the credit quality of issuers with links to DeFi operators in the worst case scenario (see “How DeFi’s Operational Risks Could Influence Credit Quality,” published June 7, 2023). While oracles meaningfully enhance the utility of smart contracts, they introduce a number of technical, data quality and concentration risks. Oracles link smart contracts to the off-chain world Oracles perform a critical function in the blockchain ecosystem by providing the ability to both import and export data between two dimensions – the real world and the blockchain – that do not otherwise connect. A key feature of blockchain technology is smart contracts, which are programs stored on the blockchain that are executed once a predetermined set of conditions are met. Absent oracles, smart contracts would be limited to on-chain data and hence would have much more limited functionality. Oracles act as a bridge between on-chain and off-chain infrastructure as well as other blockchains, enabling smart contracts to make use of real-world data. Further, oracles provide the ability to export data off-chain. The ability of oracles to bridge smart contracts to the real world enhances the power of blockchains significantly and has accelerated their adoption for financial transactions. The success of DeFi protocols that enable peer-to-peer financial transactions is largely due to the ability of oracles to import necessary data into smart contracts. The increased use of on-chain swap and lending transactions has relied on oracles to import real-world pricing and user data to provide the necessary conditionalities to effect transactions governed by smart contracts. Given the breadth of data accessible through oracles and the efficiency gains of peer-to-peer transactions, there are many efforts underway to extend this technology to other fields such as real-world asset tokenization, insurance, healthcare and real estate. Characteristics of blockchain oracles Inbound versus outbound Inbound oracles transfer data from the real-world (off-chain) into the blockchain network and are the most common type of oracle. Outbound oracles allow smart contracts to export data and commands to off-chain systems. Centralized versus decentralized Centralized oracles are managed by one entity that serves as the oracle’s singular data source. Decentralized oracles rely on consensus from multiple entities to validate the accuracy and availability of data. Software versus hardware oracles Software oracles obtain data from online sources. Hardware oracles import data from real-world monitors and sensors. Overview of the blockchain oracle landscape Since Chainlink launched in 2017 there has been a proliferation of blockchain oracles. While they all provide connectivity between on- and off-chain domains, there are sizable differences in terms of supported blockchains, consensus mechanisms and available data sets. That said, the landscape is characterized by Chainlink as the largest participant (as measured by total value secured) by far, with several smaller, less established protocols. Blockchain oracle landscape Blockchain oracle Total value secured Token ticker Summary API3 $14 million API3 API3 aggregates data directly from source-level data providers on 16 different blockchains. Capabilities include direct API-provider-to-blockchain connectivity, decentralized data feeds (dAPIs) and random number generation. Band Protocol $40 million BAND Band Protocol aggregates and connects real-world data and provides application programming interfaces (APIs) to smart contracts across more than 20 blockchains. Band Protocol supports pricing data queries, cross-chain bridges and proof of identity. Chainlink $14.6 billion LINK Chainlink focuses on decentralized oracle networks and is by far the largest among peers in terms of market capitalization. Its networks use decentralization, trusted nodes and cryptographic proofs to connect data/APIs to smart contracts. Chronicle $6.4 billion Chronicle relies on a community-powered consensus network of 22 feed node operators to provide verifiable and trackable data across both public and enterprise blockchains. DIA $73 million DIA DIA is a cross-chain data and oracle platform focused on the sourcing and delivery of customizable data feeds both on- and off-chain. The platform collects data ticks directly from over 80 sources for web3 or web2 use cases. Pyth $1.6 billion Pyth Network is an oracle that publishes financial market data to multiple blockchains, with data contributed by over 80 first-party publishers using a unique pull price update model. UMA $95 million UMA UMA enables blockchain protocols to securely import arbitrary data types on-chain. It provides data for cross-chain bridges, insurance protocols, custom derivatives and prediction markets. WINkLink $7.7 billion WIN WINKLink is an oracle built on the Tron blockchain that provides data feeds from real-world sources like banks, weather and the internet to execute smart contracts. Note: Total value secured represents amount locked in all protocols associated with the referenced oracle. Source: defilama.com, as of Nov. 15, 2023. Oracles pose a variety of risks to DeFi While not directly visible as a risk to users of DeFi protocols, we believe oracle risks are material and it is critical to understand how they are mitigated within different protocols. Oracles introduce external dependencies, and with them, vulnerabilities that could challenge the accuracy and timeliness of critical real-time, real-world data. They increase the attack surface of a protocol if bad actors find ways to exploit oracle-delivered data points for their own advantage or if there are outages of critical service providers. We have identified the following nonexhaustive risk factors that drive oracle risks. Oracles introduce external dependencies, and with them, vulnerabilities that could challenge the accuracy and timeliness of critical real-time, real-world data. Concentration risks Concentration risk in the context of blockchain oracles is multifaceted, with concentration not merely a market challenge – with Chainlink dwarfing alternative projects – but a challenge faced within each oracle network. There are three main points of concentration risk: one at a market level, in activity centering on a single project, and two in the oracle process, in concentration of data providers and decision-making. Why it matters: Chainlink is the most widely used oracle project in DeFi: its total value secured exceeds that of the two next largest, WINkLink and Chronicle, combined. It has also recently partnered with TradFi market participants, including SWIFT and ANZ bank, in pilot projects experimenting with cross-chain communication to support financial transactions. Although Chainlink’s dominance represents a risk dependency, it is not a single point of failure. Chainlink is not a single network; its oracles used in DeFi consist of multiple decentralized oracle networks that run independently. This reduces the risk that a vulnerability could impact DeFi at a systemic level, and that network speed and latency issues could result from a spike in usage in a different network. SWIFT and ANZ’s pilot schemes used Chainlink’s new Cross-Chain Interoperability Protocol (CCIP), which aims to further enhance security with multiple networks used to support each bridge, and two separate implementations of the protocol with different code bases. Although Chainlink’s dominance represents a risk dependency, it is not a single point of failure. At a DeFi protocol level, data concentration is a notable risk for third-party oracle networks. To avoid creating single points of failure in providing data, third-party oracles are usually designed to aggregate data from multiple nodes. However, in some instances this does not secure against poor data quality as data can come from a single or small number of sources, even if those sources are supported by a wide array of validators. The process of decentralizing data from a small number of parties means that sometimes users are unnecessarily paying for inefficient third-party oracle networks, while remaining subject to trusting data providers. Another concentration concern emerges around governance and decision-making. In their role as aggregators, oracles make calls as to which nodes to reach out to for information. These decisions, as with others related to the technology’s roadmap, are not always transparent and may overly rely on team members and developers. The technical and specialist nature of oracles further challenges how far governance can be decentralized. Consequently, oracle providers can represent entities requiring trust in processes often positioned as “trustless.” Potential risk mitigation: Diversification across an array of oracle projects may help reduce concentration risk. Protocols investigating oracle projects may need to assess how transparent the governance and source code is. For example, any decentralized autonomous organization (DAO) promising more democratized oracles needs to make sure that DAO participation is sufficiently high to have an economically reasonable outcome. Such an assessment should be ongoing, as governance concentration risks will increase as voting participation declines or if a group of participants gain an oversized proportion of a network’s tokens, for example. This is particularly challenging in technically complex projects such as oracles where few users are knowledgeable enough to meaningfully shape decision-making. Data quality risks An oracle’s main role (in the context of DeFi) is to provide off-chain data for smart contracts to help their execution. As such, one of the key risks oracle users face is getting low-quality or even manipulated data that could lead to wrong outcomes or losses. This could arise either because of misreporting or manipulation of the data by the centralized oracle or the nodes of the decentralized oracle. Why it matters: Data quality risk can result in significant financial losses for oracle users. For example, a user programs a smart contract to sell an asset if its price drops below $500. If due to a lack of coverage for instance, the oracle uses reports that the asset price is $400 instead of $600, the smart contract will automatically sell the position, resulting in a $200 loss for the asset owner. There could also have been fraud or intentional misreporting of the data by a centralized oracle or by some nodes in a decentralized oracle, coupled with poor verification mechanisms. In this example, the oracle owner can intentionally send the price of $400 to buy the asset at a discount compared with its real market value. Verification of ownership records is another example where incorrect data could result in significant losses for oracle users. In this case, the smart contract for buying the asset is executed on the basis that the seller has effective ownership of the asset. If this information is incorrect, the buyer will have paid without receiving the asset. The loss for the end user is permanent and cannot be reversed given that blockchain transactions are automated and immutable. Data quality risk can result in significant financial losses for oracle users. Potential risk mitigation: Risk mitigation depends on the type of oracle. For centralized oracles, track record is important but cannot eliminate risk as the data used can be compromised. The oracle owner is responsible for the data quality, but if it uses unreliable data sources, the risk persists. To resolve this problem, decentralized oracles were created to aggregate data from various sources and use verification mechanisms that check its accuracy before transmitting it to the smart contracts. For example, a decentralized oracle will look at the different data sources and eliminate abnormal values, use the median data or calculate an average. As such, even if one node in the network provides wrong or manipulated data, other nodes will provide a different set of data and the incorrect data will be eliminated. The data aggregation mechanism is important in this case. If we go back to our previous example and assume that two nodes reported prices of $400 and $550 for the asset. Using the average price of $475 would still result in executing the smart contract and selling the asset at a $75 loss for the asset owner. While this is lower than the previous situation, it is still a loss for the end user. Therefore, it is important for oracles to diversify their sources of information and use reputable nodes. If the oracle had 10 nodes reporting a similar price of $550 and one node reporting $400, the latter would have been eliminated. Technical risks Bringing off-chain data reliably to the on-chain world comes along with technical risks related to outages of the oracle operators and more blockchain-specific risks like network congestion and latency. These issues could lead to outdated data transmissions or no transmissions at all to the receiver, which are usually smart contracts that execute functions as part of a protocol. Why it matters: Outdated data transmissions or failures to transmit data because of technical problems could lead to flawed function executions in smart contracts and to unintended outcomes with significant financial losses for the end users of DeFi protocols. For example, DeFi lending protocol Maker experienced oracle problems due to the congestion of the Ethereum network at the outset of the COVID-19 pandemic in March 2020, which translated to financial losses for its users. Latency in data transmissions could also lead to failures in transmitting accurate data. Limits to scalability on the Ethereum blockchain, for example, are well known and tackled with smart solutions like layer 2 blockchains (a blockchain network built on top of a base-layer blockchain to add functionality and speed). Potential risk mitigation: Technical risks resulting from specific oracles can be partly mitigated either at the protocol level, by using multiple oracles, or at the oracle provider level, if they operate as a decentralized network. The root causes of network congestion and latency may be addressed as blockchain technology develops, particularly with features enhancing scalability and interoperability (see the How blockchains scale section in “What can You Trust In A Trustless System,” published Oct. 11, 2023). Looking forward: Bringing TradFi on-chain? The ability of oracles to bring off-chain data onto a blockchain (and vice versa) greatly enhances DeFi use cases, and can support further growth in applications connected with the financing of the real economy. Going forward, the ability to secure communications across different blockchains could be transformative in supporting institutional adoption for financial market applications, by helping connect the “walled gardens” of private permissioned blockchains used by different institutions to each other and to public blockchains. However, the utility of oracles can come at the cost of adding a number of key risks such as concentration, data quality and technical risks. Understanding and addressing these risks will be critical to developing robust market infrastructure for financial applications. Related research – What Can You Trust in a Trustless System, Oct. 11, 2023 – How DeFi’s Operational Risks Could Influence Credit Quality, June 7, 2023 – Smart Contracts Could Improve Efficiency And Transparency In Financial Transactions, Oct. 4, 2022 – Cyber Brief: Reviewing The Credit Aspects Of Blockchain, May 5, 2022 Our Purpose & Values Press Ventures Contact Us Report an Ethics Concern Office Locations Careers Corporate Responsibility History Investor Relations Leadership IOSCO ESG Rating & Data Product Statements © 2023 S&P Global Terms of Use Cookie Notice Privacy Policy Client Privacy Portal Do Not Sell or Share My Personal Information 中文 Cookie Settings",
    "originSummary": [
      "S&P Global has finalized its merger with IHS Markit, aiming to provide data, technology, and expertise.",
      "The article explores the risks associated with blockchain oracles, which connect real-world data to smart contracts, including concentration, data quality, and technical risks.",
      "Chainlink is the largest participant in the oracle market, but other notable players exist. The use of oracles in decentralized finance (DeFi) brings risks like data quality and concentration, potentially leading to flawed function executions, financial losses, and data transmission failures."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700314058367
  },
  {
    "title": "Crypto news: ENS Threatens Lawsuit over Patent, WisdomTree Plans Bitcoin ETF, CoinShares Eyes Valkyrie Funds",
    "originLink": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "originBody": "SERGE EGON OSTMAN 17 HOURS AGO Here’s what happened in crypto today Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation. 583520 Total views 959 Total shares Listen to article 0:00 RECAP Join us on social networks Ethereum Name Service (ENS) developers warn Unstoppable Domains: Drop patents or face a lawsuit. Meanwhile, asset manager WisdomTree has filed an amended Form S-1 spot Bitcoin exchange-traded fund (ETF) prospectus with the United States Securities and Exchange Commission, and Europe-based CoinShares has the exclusive option to buy the U.S.-based Valkyrie Funds. ENS devs warn Unstoppable Domains: Drop patents or face lawsuit ENS founder and lead developer Nick Johnson recently posted an open letter on X (formerly Twitter) urging Web3 firm Unstoppable Domains to relinquish a blockchain tech patent or else face potential litigation. Failing that, ENS Labs stands ready to challenge this patent, which we believe is entirely derivative of our own inventions; a position we are able and willing to demonstrate. — nick.eth (@nicksdjohnson) November 16, 2023 Unstoppable Domains received its first U.S. patent in January 2023. According to the patent, Braden River Pezeshki, Matthew Everett Gould and Bogdan Gusiev are the inventors of a technology that uses blockchain technology to determine domains. Johnson disputes this claim and says ENS is the rightful creator of the patent. The ensuing discussion laid bare the disconnect between the two companies. WisdomTree amends S-1 form spot Bitcoin ETF filing as crypto awaits SEC decisions WisdomTree filed an amended Form S-1 spot Bitcoin (BTC) ETF prospectus with the SEC on Nov. 16. The update comes a few months after WisdomTree refiled its spot Bitcoin ETF application in June 2023, proposing a rule change to list and trade shares of the WisdomTree Bitcoin Trust on the BZX Exchange by the Chicago Board Options Exchange. The amended prospectus mentions that the WisdomTree Bitcoin Trust ETF will trade under a ticker symbol BTCW, with Coinbase Custody Trust serving as the custodian holding all of the trust’s Bitcoin on its behalf. According to Bloomberg ETF analyst James Seyffart, the updated filing means that the firm is still planning to launch an ETF and is discussing the opportunity with the SEC. UPDATE: Theres the S-1/Prospectus amendment for @WisdomTreeFunds’s spot #bitcoin ETF pic.twitter.com/RKzWbuKnl1 — James Seyffart (@JSeyff) November 16, 2023 “All issuers were expected to have to file one of these to potentially launch their ETF at some point. Just a step in the process. Nothing critical,” Seyffart wrote on X. Another Bloomberg ETF expert, Eric Balchunas, noticed that WisdomTree took “long enough” to amend its Form S-1. “Please tell me the SEC isn’t waiting till all S-1s are updated before issuing a second round of comments,” he added. CoinShares gets rights to buy Valkyrie’s crypto ETFs European digital asset manager CoinShares secured the exclusive option to acquire Valkyrie Funds, the ETF unit of its U.S. competitor Valkyrie Investments. Valkyrie has a spot Bitcoin ETF awaiting approval with the SEC — CoinShares thinks the U.S. could soon become the epicenter for ETF offerings. CoinShares CEO Jean-Marie Mognetti said he hopes the Valkyrie acquisition will help it capitalize on a fragmented global ETF market. Exciting update! @CoinSharesCo secures an option to acquire @ValkyrieFunds, uniting our strengths to create a global one-stop-shop in digital asset investments. This marks a strategic leap towards market leadership and bolsters our strong presence in the U.S.!… pic.twitter.com/0BPNGC518P — CoinShares (@CoinSharesCo) November 16, 2023 The option will remain active until March 31, 2024. Valkyrie Funds will continue to operate as an independent entity until CoinShares’ acquisition is finalized. This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision. #Bitcoin #Cryptocurrencies #Music #Central Bank #Ethereum #Bitcoin Price #United States #Cryptocurrency Exchange #United Kingdom #AI #Interest Rate Add reaction READ MORE History tells us we’re in for a strong bull market with a hard landing Expect some crypto companies to fail in the wake of Bitcoin's halving Why is the crypto market down today?",
    "originSummary": [
      "Ethereum Name Service (ENS) developers are threatening Unstoppable Domains with a lawsuit if they do not abandon their blockchain technology patent.",
      "WisdomTree, an asset manager, has submitted an amended Form S-1 spot Bitcoin ETF prospectus to the SEC, signaling their intention to launch an ETF.",
      "CoinShares has secured the exclusive right to acquire Valkyrie Funds, a U.S. competitor seeking authorization for a spot Bitcoin ETF."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700314058367
  },
  {
    "title": "Using Blockchain in Commercial Real Estate",
    "originLink": "https://www.eisneramper.com/insights/real-estate/commercial-real-estate-leverages-blockchain-video-1123/",
    "originBody": "Skip to content Contact Us Careers Client Resources Search Services Explore Services Advisory Explore Advisory Bankruptcy & Restructuring Change Management Compensation Resources Corporate Finance Disaster Management & Recovery EisnerAmper Digital Environmental, Social & Governance Federal Government Contracting Financial Management and Disbursements Forensic, Litigation & Valuation Grants Management HITRUST Regulatory Risk and Compliance Solutions Retirement Plan Administration & Consulting Risk Advisory Settlement Administration Technical Accounting Transactions Wealth Management Accounting Explore Accounting Audit & Assurance Employee Benefit Plan Audit Outsourced Finance & Accounting Royalty Exams & Contract Compliance SOCSystem & Organization Controls Tax Explore Tax Federal Tax International Tax Private Client State & Local Tax Tax Controversy & Dispute Resolution Outsourcing Explore Outsourcing Association Management EA Outsourcing Solutions EA RESIG – Real Estate Fund Administration Family Office Solutions Outsourcing for Financial Services HR Advisory and Outsourcing Outsourced IT Property Accounting Tax Function Outsourcing Industries Explore Industries Blockchain & Digital Assets Construction Education Financial Services Franchise Services Government Health Care Insurance Life Sciences Manufacturing & Distribution Not-for-Profit Organizations Oil & Gas Private Equity Professional Services Public Companies Real Estate Sports & Entertainment Technology Companies EisnerAmper U.K. Financial Services Group Solutions Explore Solutions Center for Family Business Excellence Center for Individual & Organizational Performance Center for Transformation Distressed Collateral Monitoring for Real Estate Lenders Disaster Preparedness & Recovery EA Outsourcing Solutions Outsourced Accounting, Finance, Tax & Advisory for Startups Protect your business from the unforeseen, as well as position yourself for long-term growth. Be informed and understand what’s to come. Get Solutions Insights Explore Insights Trending Topics Tax Solutions Insight Fraud Awareness Browse By Articles/Blogs Podcasts Videos Events & Webinars Receive the latest business insights, analysis, and perspectives from EisnerAmper professionals. Subscribe About Us Explore About Us Professional Directory Locations Global Reach Careers News Friends of the Firm EisnerAmper Cares EisnerAmper Alumni Submit RFP Contact Us Careers Client Resources Services Services EisnerAmper offers business organizations and individuals a comprehensive set of accounting and audit, tax, and advisory services to help them respond quickly to urgent issues, anticipate opportunities and risks, and grow profitably. Explore Services Advisory Bankruptcy & Restructuring Change Management Compensation Resources Corporate Finance Disaster Management & Recovery EisnerAmper Digital Environmental, Social & Governance Federal Government Contracting Financial Management and Disbursements Forensic, Litigation & Valuation Grants Management HITRUST Regulatory Risk and Compliance Solutions Retirement Plan Administration & Consulting Risk Advisory Settlement Administration Technical Accounting Transactions Wealth Management Accounting Audit & Assurance Employee Benefit Plan Audit Outsourced Finance & Accounting Royalty Exams & Contract Compliance SOCSystem & Organization Controls Tax Federal Tax International Tax Private Client State & Local Tax Tax Controversy & Dispute Resolution Outsourcing Association Management EA Outsourcing Solutions EA RESIG – Real Estate Fund Administration Family Office Solutions Outsourcing for Financial Services HR Advisory and Outsourcing Outsourced IT Property Accounting Tax Function Outsourcing Industries Industries EisnerAmper puts its industry-specific expertise and cutting edge technologies to work to help clients respond to the challenges they face today and position them for growth, profitability and success tomorrow. Explore Industries Blockchain & Digital Assets Construction Education Financial Services Franchise Services Government Health Care Insurance Life Sciences Manufacturing & Distribution Not-for-Profit Organizations Oil & Gas Private Equity Professional Services Public Companies Real Estate Sports & Entertainment Technology Companies EisnerAmper U.K. Financial Services Group Solutions Solutions Challenges abound in today’s evolving world. Access to knowledge, opportunities for transformation, regulatory issues, economic hurdles, and social concerns combine to raise questions to which clients constantly need to find answers. EisnerAmper professionals package experience, acumen, and market-specific skill sets to deliver custom-tailored solutions. Explore Solutions Center for Family Business Excellence Center for Individual & Organizational Performance Center for Transformation Distressed Collateral Monitoring for Real Estate Lenders Disaster Preparedness & Recovery EA Outsourcing Solutions Outsourced Accounting, Finance, Tax & Advisory for Startups Protect your business from the unforeseen, as well as position yourself for long-term growth. Be informed and understand what’s to come. Get Solutions Insights Insights Explore Insights Trending Topics Tax Solutions Insight Fraud Awareness Browse By Articles/Blogs Podcasts Videos Events & Webinars Receive the latest business insights, analysis, and perspectives from EisnerAmper professionals. Subscribe About Us About Us Large enterprises, privately owned companies and high net worth individuals face near and far-term accounting issues. They turn to EisnerAmper for comprehensive audit, accounting, advisory, consulting and tax services. Explore About Us Professional Directory Locations Global Reach Careers News Friends of the Firm EisnerAmper Cares EisnerAmper Alumni Submit RFP Search Home Insights How Commercial Real Estate Can Leverage Blockchain Published Nov 17, 2023 Share Blockchain technology is reshaping industries and transactions. Watch our two-minute video to understand how blockchain can help: Create a more secure means of sharing transaction data. Decrease the time needed for data reconciliation. Reduce the likelihood of cyberattacks. Interested in learning more about how you can best integrate blockchain into your organization? Contact us Blockchain is a versatile technology with applications like real-world asset transactions, supply chain management, and cryptocurrency. How does blockchain work? Each participant, or node, holds a complete ledger copy of shared information, such as transactions. A consensus mechanism creates an agreement among nodes as to which transactions, or blocks, are added to the ledger. Blocks of data in the ledger are chained together, with each block referencing the previous block, so historical transactions cannot be altered. Each block in the chain has a ‘hash’ — a unique identifier, much like a fingerprint. If any data in the block is altered, the hash will change, alerting the network that someone has tried to tamper with the data. Once data is committed to the blockchain, it cannot be altered. This is known as immutability. Transactions are secured by public key/private key architecture, a method of encrypting or signing data with two different keys. Data can’t be accessed without the private key. Why use blockchain technology? Since there is no single point of failure, blockchain technology can enhance security, reduce likelihood of cyber-attacks, and assure continuity of the ecosystem if node failure or attack doesn’t reach certain thresholds. As a decentralized peer-to-peer data structure, blockchain allows for real- or near real-time sharing of transactional ledgers, eliminating or decreasing intermediaries. This reduces time needed for data reconciliation. For example, cross-border payment settlement time can shrink from days to seconds. Blockchain technology is reshaping industries and revolutionizing transactions. Whether you're a business leader or a curious explorer, blockchain's potential is too significant to ignore. Contact EisnerAmper If you have any questions, we'd like to hear from you. Explore More Insights Article Niche Real Estate Lending in a Volatile Debt Market Read More Article What to Know About State Tax Incentives Tax Read More Article Section 754 Elections for Real Estate Private Equity Funds Tax Read More Podcast Navigating the Changing Landscape of Bonus Depreciation Tax Read More Article GAAP and Tax Differences Between Syndication and Organization Costs for Private Equity and Real Estate Private Equity Funds Read More Article Cost Segregation Update: 5 Must-Knows for TY 2023 Read More Podcast Strategies for Cost Segregation Success Read More Article The Importance of Reliable Collateral Data When Resolving Distressed Commercial and Multifamily Mortgages Read More Article Wanted: Capitulation – Resetting Property Values and the Path to Liquidity Read More Article ASC Topic 946: Scope Exception for REITs Read More Article Proposed Regulations for Determining Proceeds, Basis, and Reporting Requirements for Digital Assets Tax Technology Read More Podcast Outlook for Agency Lending in Multifamily Housing and Health Care Read More View All Insights Receive the latest business insights, analysis, and perspectives from EisnerAmper professionals. Subscribe Contact Us Submit RFP Subscribe Alternative Practice Disclosure Privacy Policy Personal Data Processing Summary Terms & Conditions Accessibility Statement \"EisnerAmper\" is the brand name under which EisnerAmper LLP and Eisner Advisory Group LLC and its subsidiary entities provide professional services. EisnerAmper LLP and Eisner Advisory Group LLC (and its subsidiary entities) practice as an alternative practice structure in accordance with the AICPA Code of Professional Conduct and applicable law, regulations and professional standards. EisnerAmper LLP is a licensed independent CPA firm that provides attest services to its clients, and Eisner Advisory Group LLC and its subsidiary entities provide tax and business consulting services to their clients. Eisner Advisory Group LLC and its subsidiary entities are not licensed CPA firms. © 2023 Eisner Advisory Group LLC. All rights reserved.",
    "originSummary": [
      "EisnerAmper is a professional services firm that offers a wide range of accounting, audit, tax, and advisory services to businesses and individuals.",
      "They specialize in various industries, including construction, financial services, healthcare, manufacturing, and technology.",
      "The company also offers solutions in areas like family business excellence, disaster recovery, and outsourcing, and highlights the potential benefits of blockchain technology, such as improved security, reduced reconciliation time, and real-time sharing of transactional ledgers."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700314058367
  },
  {
    "title": "BSN Foundation announces blockchain-as-a-service platform for non-crypto public chains",
    "originLink": "https://crypto.news/creating-a-resilient-and-sustainable-blockchain-as-a-service-for-all/",
    "originBody": "Creating a resilient and sustainable blockchain-as-a-service for all By Selva Ozelli November 18, 2023 at 10:37 am Edited by Max Yakubowski Opinion Collect the article Share Link copied Disclosure: The views and opinions expressed here belong solely to the author and do not represent the views and opinions of crypto.news’ editorial. The Asia-Pacific Economic Cooperation (APEC) Summit with the theme of “Creating a Resilient and Sustainable Future for All” was drawing world leaders, dignitaries and delegations from the 21 member economies to San Francisco from Nov. 15 till Nov. 17, 2023 to promote free, fair, and open trade and investment, and advance sustainable and inclusive economic growth focused on regional economic issues, including sustainability, digitalization, energy security and other matters. You might also like: An in-depth look at the regulatory landscape of privacy coins Parallel to the US APEC 2023—which became the most significant event with world leaders in San Francisco in recent history—in Singapore, with a similar theme, the BSN Foundation announced its founding members, its role in blockchain-as-a-service on Nov. 16, 2023. BSN Foundation is the governing body of the BSN Spartan Networks made up of: Red Date Technology, Blockdaemon, GFT Technologies, TOKO, Zeeve. These organizations originating from a diverse range of countries and regions, including United States, Germany, and Hong Kong, is to be bring a wide range of expertise dedicated to building the next-generation global public IT system infrastructures for internet communications, digital economies, metaverses, digital payments, and NFTs based on non-cryptocurrency public chain technologies, designed to serve IT systems around the world to advance fundamental technologies that benefit all humankind. Tim Bailey, the vice president of global business and operations for Red Date Technology explained to me in an interview: “On Nov. 16, we announced the founding members of the BSN Foundation that governs the BSN Spartan Network. The network launched late last year with three non-cryptocurrency public chains, including non-crypto versions of sustainable, proof-of-stake blockchain platforms: Ethereum, Cosmos, and PolygonEdge. The BSN Spartan Network provides an infrastructure that integrates non-cryptocurrency public blockchains that can be used by any traditional IT system to leverage the capabilities of the underlying blockchain technology in an easier and more cost-effective way. The service will be offered with fixed fees based in fiat currency or USD-backed stablecoin and is only available outside Mainland China. The cost of using our public chain technology is significantly lower and more predictable than using cryptocurrency based public chains.” The BSN Spartan Network is a decentralized network governed by the BSN Foundation with each member operating a governance data center that hosts all the validator nodes of non-cryptocurrency public chains. The BSN Foundation will operate via three core committees: the technical committee, the governance committee, and the business committee, each overseeing a distinct set of activities such as R&D, governance coordination, and commercial matters. Established as a decentralized governance organization, each member will have an equal voting right on governance decisions, such as integrating new blockchain protocols or adjusting network fees and will operate a governance data center that hosts all the validator nodes of the non-cryptocurrency public chains. The BSN Foundation recognizes public chain technologies as a complementary approach to conventional private IT systems, with inherent advantages such as data sharing costs, private data ownership, and transparency. These benefits have remained largely untapped by traditional enterprises due to the reluctance to get involved with unregulated cryptocurrencies. To bridge this gap, the BSN Spartan Network, will offer a decentralized cloud service solution with non-cryptocurrency public chains as the operation systems. The network consists of virtual data centers that are open source and free to download on GitHub, where nodes of the non-cryptocurrency public chains can be selectively installed. Businesses can deploy smart contracts and build dapps on the nodes and pay gas fees on non-cryptocurrency public chains using fiat currency or fiat-backed stablecoins such as USDC. The BSN Foundation will start with five members, with the goal of eventually growing to 40 members. Collectively, these organizations will contribute to the BSN Foundation’s mission to pioneer public IT system development at a global level to bring a portfolio of expertise ranging from blockchain-as-a-service and real-world asset tokenization to financial services and consulting. Among the first five members are: Blockdaemon, a provider of enterprise-grade blockchain node deployment solutions, dedicated to streamlining and enhancing the onboarding and iteration processes for organizations utilizing BSN Spartan Network. Andrew Vranjes, the vice president of sales and general manager of APAC at Blockdaem explained to me in an interview: “We are proud to be one of the founding members of the BSN Foundation. Our specialization in institutional-grade blockchain node deployment, validating solutions, and institutional wallet aligns perfectly with the BSN Foundation’s mission to advance decentralization. We are committed to assisting organizations in simplifying their BSN Spartan onboarding and iteration processes with institutional-grade security. Together with the BSN Foundation and our fellow founding members, we look forward to elevating the blockchain economy.” Operating in over 15 markets worldwide, GFT Technologies has more than 35 years of experience in developing sustainable solutions based on new technologies including artificial intelligence and blockchain. In exclusive comments Christopher Ortiz, group chief executive and global markets and region manager APAC and UK at GFT, said: “GFT is honored to be one of the founding members of the BSN Foundation. The BSN Spartan Network’s non-cryptocurrency public chain infrastructure makes it easier for enterprises to build and deploy blockchain-based applications. We are confident that BSN Spartan will meet our clients’ needs for a reliable, secure, and scalable public infrastructure, without the challenges of volatile cryptocurrency prices and unpredictable development costs.” Red Date Technology is a tech company headquartered in Hong Kong, it is dedicated to building next-generation public IT system infrastructures for internet communications, digital economies, digital payments, and NFTs. Red Date Technology, the technical architect of the BSN Spartan Network, contributes expertise in the fundamental technologies of public IT system infrastructures. Commenting on the announcement, Tim Bailey, VP of global business and operations for Red Date Technology, highlighted: “Building on our collaboration agreement with CloudSigma signed earlier this year to bring Enterprise BSN to the full global network of CloudSigma cloud locations, marks another significant milestone in the international expansion of the BSN. We are building the next layer of the internet, a layer serving public IT systems that has the benefit of greater transparency, easy connectivity, and individual ownership of data compared to private IT systems today.” Born out of global law firm DLA Piper, TOKO is a digital asset creation platform that couples the compliance and regulatory rigor of a global law firm with the innovative technology solutions of tomorrow. TOKO offers digital asset tokenization and legal compliance solutions based on the BSN Spartan infrastructure. Scott Thiel, managing director of TOKO, said: “TOKO is excited to be one of the five initial members of the BSN Foundation. We believe in BSN’s commitment, as a decentralized governance organization, in bringing blockchain technologies to the broader IT industry beyond cryptocurrencies. As a full market licensed Virtual Asset Broker Dealer and Exchange services Virtual Asset Service Provider (VASP) granted by Dubai’s Virtual Asset Regulatory Authority (VARA), we look forward to contributing to the foundation with our wealth of expertise in the governance and regulatory space.“ Zeeve is an enterprise-grade no-code blockchain infrastructure automation platform that enables easy deployment, monitoring, and management of blockchain nodes and networks. Zeeve empowers over 27,000 developers with its web3 infrastructure automation services and delivers plug-and-play solutions that enable traditional corporations to swiftly develop decentralized applications on the BSN Spartan Network. Dr. Ravi Chamria, Zeeve’s CEO, commented on the announcement: “We highly value innovation and forward-thinking approaches in our strategic partnerships. The BSN Foundation’s vision aligns seamlessly with our mission to simplify and enhance blockchain adoption for enterprises. By offering a decentralized cloud service solution that operates on non-cryptocurrency public chains, the BSN Spartan Network opens up exciting possibilities for businesses to harness the benefits of blockchain technology while maintaining financial stability and regulatory compliance. We’re excited to collaborate with the BSN Foundation to empower enterprises with the most reliable Blockchain infrastructure management, enabling them to thrive in a rapidly evolving digital landscape.” Looking toward the future, the BSN Foundation aims to expand its membership to at least 40 members, operating as a decentralized governance body. “When 40 leading international companies govern the Spartan Network as Foundation members with equal voting rights, the network will become one of the most decentralized IT infrastructures in the world”, said Yifan He, CEO of Red Date Technology. Together, they aim to promote the concept of public IT systems that complements the existing centralized IT architectures, revolutionizing traditional business operations and data communication in a sustainable way. Read more: Ready for changes? Anticipating the web3 revolution in 2024Opinion Selva Ozelli Selva Ozelli, Esq., CPA is an international tax attorney and CPA who frequently writes about tax, legal and accounting issues, as well as about sustainable investments in digital assets globally. Follow Us on Google News Read more about Blockchain decentralization public blockchain sustainability",
    "originSummary": [
      "The BSN Foundation, a decentralized governance organization, has unveiled its founding members and its mission to develop a blockchain-as-a-service platform.",
      "The platform's goal is to provide an infrastructure for non-cryptocurrency public blockchains that can be integrated with existing IT systems.",
      "The BSN Spartan Network, under the governance of the BSN Foundation, will offer a decentralized cloud service solution using fiat currency or stablecoins to cover gas fees on non-cryptocurrency public chains. The aim is to transform traditional business operations and data communication through public IT systems."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700314058367
  },
  {
    "title": "Matoaca High School football team advances to region final after 15-year wait",
    "originLink": "https://richmond.com/life-entertainment/the-role-of-blockchain-in-ensuring-transaction-transparency-and-security/article_c46502e3-e6ba-5a05-9869-d4cafc833cc1.html",
    "originBody": "High school football: Matoaca advances to first region final since 2006 with rout of Godwin",
    "originSummary": [
      "Matoaca High School's football team has advanced to the region final for the first time in 15 years after a resounding win against Godwin.",
      "This achievement marks a significant milestone for the team, as it is their first appearance in the region final since 2006.",
      "The victory demonstrates the team's exceptional performance and determination throughout the season."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700314058367
  },
  {
    "title": "Demystifying Digital Currency: Exploring Blockchain and Beyond",
    "originLink": "https://medium.com/@tharmeekandev/demystifying-digital-currency-a-journey-into-the-world-of-blockchain-and-beyond-de8b47eb6776",
    "originBody": "Demystifying Digital Currency: A Journey into the World of Blockchain and Beyond Tharmeekan Sivarasan · Follow 5 min read · 4 hours ago -- In the vast landscape of finance and technology, a revolutionary force has been quietly reshaping the way we perceive and interact with money — Digital Currency. This series of articles aims to demystify and unravel the complexities of digital currency, exploring its technical underpinnings, the marvels of blockchain technology, and its implementation. It will also discuss the current trends in the world of blockchain. Chapter 1: A Journey from Barter to Digital Gold A Historical Prelude: Understanding the Essence of Money Money, at its core, symbolizes the ability to represent value. From ancient times, people have used various materials, such as salt, wheat, shells, and gold, to represent value. These materials were valuable because they were in high demand and had limited supply; moreover, people put trust in them. Money is essential for the exchange of goods and services, and it helps us store and transfer value. As time unfolded, humans transitioned the trust model from trusting in something, like gold, to trusting in someone — the government. The Era of Fiat Money: Power, Mismanagement, and Control In the history of monetary history, the gold standard stands as a testament to the link between currency and a tangible asset. This meant that the government or central bank had to hold a corresponding amount of gold to the currency in circulation. After 1971, Fiat money is currency that has not been backed by a physical commodity like gold but rather has derived its value from the trust and confidence people have in the issuing government. Fiat money, the government-decreed currency, comes with its share of complexities. The power vested in centralized entities opens the door to corruption, mismanagement, and control over the financial destinies of individuals. “The power to create money is a power that should be held by the people, not by a central bank.” Digital Currency: A Leap into the Future Digital currency refers to any means of payment that exists in a purely electronic form. Digital money is not physically tangible like a dollar bill or a coin. It is accounted for and transferred using online systems. A variant of digital money already exists in society today in the form of cash held in online bank accounts. This digital cash can be sent to others or received from them, and it can also be used for online transactions. To facilitate these transactions, a central authority must maintain a centralized ledger to record the transactions and update each individual bank account. Double Spending Problem — An unsolved mystery in the past Imagine you have a digital file that represents a dollar. In a system without proper safeguards, such as a bank, maintains a ledger to ensure each unit of currency is spent only once, a user could potentially duplicate or copy this digital file, allowing them to spend the same dollar in multiple transactions. This would undermine the integrity of the currency and the trust in the system. In the absence of a central authority, preventing double spending in decentralized digital systems proved challenging. This is why a purely digital, decentralized form of money, which doesn’t rely on a central authority for approval, is considered unfeasible. Double Spending Problem Illustration Bitcoin: Transparent, Pseudo-Anonymous, and Decentralized An individual or group under the pseudonym Satoshi Nakamoto published an open-source project outlined in a white paper titled “Bitcoin: A Peer-to-Peer Electronic Cash System.” This revolutionary decentralized cryptocurrency, entirely digital, aimed to solve the double-spending problem without relying on a central authority. Bitcoin’s transparency, pseudo-anonymity, and decentralized nature set it apart from traditional banking systems. Bitcoin is currently the most well-known and widely circulated cryptocurrency. Upcoming chapters of this series will delve into the technical implementation and explain the process through which this decentralized solution became possible. The Advantages of Cryptocurrencies: Empowering Individuals and Revolutionizing Commerce Cryptocurrencies offer a myriad of advantages. It provides users with complete control over their funds, eliminating unnecessary middlemen (aka Banks) and offering cost-effective transactions. Its digital nature allows for additional programming layers, transforming it into “smart money.” More importantly, Cryptocurrencies open the doors of digital commerce to the unbanked and underbanked, fostering financial inclusion on a global scale. Once the majority of the population develops trust in cryptocurrency as the preferred medium of exchange, it could lead to a transformative shift in how people perceive and interact with financial systems, ushering in a new era of decentralized and digitized finance. “The basis of economic and human progress is trust, trust in one’s fellow man.” — Richard Nixon, 37th President of the United States DISCLAIMER This article does not constitute investment advice, nor is it an invitation to purchase any crypto assets :) As we conclude Chapter 1, “A Journey from Barter to Digital Gold,” we reflect on the evolutionary path of money — from tangible assets to the contemporary trust in governments. We navigated the intricacies of the gold standard, delving into the complexities of fiat money, and embraced the electronic realm of digital currency. Unveiling the historical challenge of double spending, we introduced Bitcoin as a beacon of decentralization. Get ready to delve into the heart of digital currency, where technology meets finance, and discover how it’s reshaping our understanding of money. Join me on this journey as we uncover the complexities, applications, and the ever-changing landscape of the digital financial realm. This is just the beginning of our exploration. Are you ready for the ride?",
    "originSummary": [
      "The article aims to explain digital currency and its technical foundations, including blockchain technology.",
      "It discusses the evolution of money from tangible assets to fiat currency and the drawbacks of centralized control.",
      "The article introduces digital currency as an electronic means of payment and mentions the challenges of preventing double spending in decentralized systems. It also discusses Bitcoin as a transparent, pseudo-anonymous, and decentralized cryptocurrency, highlighting its advantages in empowering individuals and revolutionizing commerce."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700314058367
  },
  {
    "title": "India's Potential as Blockchain Leader: Experts Highlight Adoption in Various Sectors",
    "originLink": "https://coingeek.com/unveiling-india-blockchain-future-with-julian-gordon-and-venkat-naga-on-coingeek-backstage-video/",
    "originBody": "Unveiling India’s blockchain future with Julian Gordon and Venkat Naga on CoinGeek Backstage INTERVIEWS 1 HOUR AGO Wahid Pessarlay As the world marches toward digitization, Web3 experts are optimistic that India has the potential to emerge as a trailblazer in the fledgling industry but predict an uphill climb. In a CoinGeek Backstage interview on the sidelines of the Blockchain for Productivity Forum conference, Venkat Naga, co-founder of data custody firm Serenity Shield, remarked that India is on course to be an industry leader. Naga said India’s strides with blockchain are primarily underreported, noting that the country has what it takes to be a “front runner in the process of digitization.” Naga highlighted several blockchain use cases for key sectors of the Indian economy outside of finance and digital currencies. He pointed to blockchain’s utility in legal services, the music industry, and manufacturing, citing the innate features of immutability, speed, and transparency associated with the technology. “Every industry is going to have a use case from blockchain simply because of the way it operates and the way you are able to store your data and the way you can build an application within the blockchain technology,” Naga said. He leaned on the added perks of decentralization, privacy, security, trackability, data integrity, “and self-ownership of your data.” Julian Gordon, VP of Asia Pacific for Hyperledger and OpenSSF Linux Foundation, took a similar stance with Naga, pointing to the immense potential of blockchain in India. Gordon emphasized that utilizing permissioned and permissionless networks in various scenarios can streamline operational processes, reduce costs, and enhance efficiency. Gordon also highlighted the application of Hyperledger technology in India for self-sovereign identities and a verifiable credit system for the residents. The Web3 executive said that apart from improving the lives of millions of Indians, blockchain offers several commercial benefits for corporate entities in the region. He pointed to the use of blockchain to store patents on public ledgers, allowing public access to over 25 million patents. Described as the “Rembrandt in the attic,” Gordon opines that enterprises can find utilities for patents that were previously hiding for years in filing cabinets with no utilities or commercial benefits. Experts have cited India’s large tech-savvy population and large smartphone market as reasons for the country to take a driver’s seat in the Web3 train. Already taking the first steps Aware of the potential for blockchain to add value to the Indian economy, the government has taken the first steps toward encouraging adoption. New Delhi has turned to the technology to streamline its nationwide forensic processes with land registries using blockchain for record-keeping purposes. Despite the first forays, the government remains wary of introducing blockchain into India’s financial sector over security and scalability concerns. However, Finance Minister Nirmala Sitharaman is confident that the country can achieve a 46% blockchain adoption rate before 2030 to emerge as the leading hub in the Asian subcontinent. Watch: India is building Web3 enabled payment rails New to blockchain? Check out CoinGeek’s Blockchain for Beginners section, the ultimate resource guide to learn more about blockchain technology. TAGGED COINGEEK BACKSTAGEINDIAJULIAN GORDONLINUX FOUNDATIONSERENITY SHIELDVENKAT NAGAWEB 3.0",
    "originSummary": [
      "Experts believe that India has the potential to become a leader in the blockchain industry, citing the country's progress in blockchain adoption.",
      "Blockchain technology can be applied across different sectors in India, including legal services, music industry, and manufacturing, to streamline operations, reduce costs, and improve efficiency.",
      "The Indian government has already taken steps to promote blockchain adoption, especially in land registries, but there are concerns regarding security and scalability when implementing blockchain in the financial sector."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700314058367
  },
  {
    "title": "TRON DAO Reinforces Decentralized Vision at Binance Blockchain Week Istanbul",
    "originLink": "https://finance.yahoo.com/news/tron-dao-team-binance-blockchain-175817908.html",
    "originBody": "News Direct TRON DAO Team at Binance Blockchain Week Istanbul 2023 Read full article News Direct Fri, November 17, 2023 at 10:58 AM MST·3 min read Geneva, Switzerland --News Direct-- TRON DAO Geneva, Switzerland / November 17, 2023 / - TRON DAO attended as a diamond sponsor at the Binance Blockchain Week in Istanbul, held from November 8 to November 9, 2023. This exciting event gathered a variety of blockchain enthusiasts, sparking pivotal conversations aimed at charting the course for the next billion Web3 users. Featuring Insights from TRON's Thought Leaders Feroz Lakhani, Enterprise Lead at TRON DAO, captivated the audience with his keynote, \"A Developer's Guide to TRON,\" detailing the opportunities the TRON network holds for creators and developers alike. Similarly, David Uhryniak, Ecosystem Lead at TRON DAO, addressed the subject \"Crypto: A Global Crossroads,\" illuminating how TRON is navigating the intersection of global finance and cutting-edge tech to pave the way for innovation. Deepening Connections in Istanbul The TRON DAO team's journey at Binance Blockchain Week extended beyond technical insights, diving into the heart of Istanbul’s cultural vibrancy. They explored the city's storied streets, engaging with the energy and traditions of the local community. As TRON DAO bid farewell to Istanbul, they left enriched by the shared experiences and more committed to a vision for an inclusive and decentralized future, energized by the spirit of innovation that thrived throughout the Binance Blockchain Week. About TRON DAO TRON DAO is a community-governed DAO dedicated to accelerating the decentralization of the internet via blockchain technology and dApps. Founded in September 2017 by H.E. Justin Sun, the TRON network has continued to deliver impressive achievements since MainNet launch in May 2018. July 2018 also marked the ecosystem integration of BitTorrent, a pioneer in decentralized Web3 services boasting over 100 million monthly active users. The TRON network has gained incredible traction in recent years. As of November 2023, it has over 195.00 million total user accounts on the blockchain, more than 6.69 billion total transactions, and over $19.18 billion in total value locked (TVL), as reported on TRONSCAN. Story continues In addition, TRON hosts the largest circulating supply of USD Tether (USDT) stablecoin across the globe, overtaking USDT on Ethereum since April 2021. The TRON network completed full decentralization in December 2021 and is now a community-governed DAO. Most recently in October 2022, TRON was designated as the national blockchain for the Commonwealth of Dominica, which marks the first time a major public blockchain partnered with a sovereign nation to develop its national blockchain infrastructure. On top of the government’s endorsement to issue Dominica Coin (“DMC”), a blockchain-based fan token to help promote Dominica’s global fanfare, seven existing TRON-based tokens - TRX, BTT, NFT, JST, USDD, USDT, TUSD, have been granted statutory status as authorized digital currency and medium of exchange in the country. TRONNetworkTRONDAOTwitterYouTubeTelegramDiscordRedditGitHubMediumForum Media Contact Hayward Wong press@tron.network Contact Details Hayward Wong press@tron.network Company Website https://trondao.org/ View source version on newsdirect.com: https://newsdirect.com/news/tron-dao-team-at-binance-blockchain-week-istanbul-2023-962813273 TRENDING 1. SpaceX Starship launched on test flight in Texas after last one blew up 2. UK Treasury chief signals tax cuts and a squeeze on welfare benefits are on the way 3. Here's why Americans with $1 million don't think they’re wealthy 4. UPDATE 1-Russia places former central banker Aleksashenko on wanted list - state news agencies 5. Israel Latest: EU Staff Family Members Starting to Leave Gaza",
    "originSummary": [
      "TRON DAO, a decentralized autonomous organization focused on blockchain technology, sponsored the Binance Blockchain Week in Istanbul as a diamond sponsor.",
      "The event aimed to discuss the future of Web3 and included insights from TRON's team members.",
      "TRON DAO participated in the event and gained a stronger vision for an inclusive and decentralized future."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700314058367
  }
]
