[
  {
    "id": 40676408,
    "title": "Çevrimiçi oyunlar ve sanal dünyalarda arazi değer vergisi (2022) SONUÇ:",
    "originLink": "https://progressandpoverty.substack.com/p/land-value-tax-in-online-games-and",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40676408",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Metin, çevrimiçi oyunlarda ve sanal dünyalarda Arazi Değer Vergisi (ADV) uygulanmasının artılarını ve eksilerini tartışmakta, bunun arazi değerlerini düşürebileceğini ancak kaldırılması durumunda arazi sahiplerine fayda sağlayabileceğini önermektedir.",
      "Bu, LVT'nin vergileri topraktan emeğe, girişimciliğe ve ticarete kaydırma potansiyelini vurgularken, zengin toprak sahiplerinden gelecek direniş ve LVT ilerlemesini sürdürmenin zorluğu konusunda uyarıda bulunuyor.",
      "Metin ayrıca LVT'nin (Arazi Değer Vergisi) daha geniş etkilerine, diğer tüm vergilerin yerini alma potansiyeline, böyle bir sistemin uygulanabilirliğine ve kamu bilincinin ve güçlü politikaların uygulanmasını desteklemedeki önemine değiniyor."
    ],
    "points": 327,
    "commentCount": 321,
    "retryCount": 0,
    "time": 1718325381
  },
  {
    "id": 40673567,
    "title": "ABD-Suudi petrodolar anlaşması 50 yıl sonra sona erdi",
    "originLink": "https://www.nasdaq.com/articles/us-saudi-petrodollar-pact-ends-after-50-years",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40673567",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "ABD-Suudi petrodolar anlaşması 50 yıl sonra sona erdi, ancak petrol işinde hemen bir değişiklik beklenmiyor.",
      "Anlaşmanın sona ermesi, dolarsızlaşmaya doğru kademeli bir kaymaya yol açabilir, ancak bu süreç zaman alacaktır.",
      "ABD, dünyanın en büyük enerji üreticisi olmaya devam ediyor, bu da jeopolitik manzarayı ve petrodoların önemini etkileyebilir."
    ],
    "points": 281,
    "commentCount": 298,
    "retryCount": 0,
    "time": 1718306902
  },
  {
    "id": 40680218,
    "title": "İlk Lunar Lander oyununda 55 yıllık bir hata buldum",
    "originLink": "https://martincmartin.com/2024/06/14/how-i-found-a-55-year-old-bug-in-the-first-lunar-lander-game/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40680218",
    "commentBody": "",
    "originSummary": [
      "1969'da, lise öğrencisi Jim Storer, bir ay iniş aracını kullanmayı ve her 10 simüle edilmiş saniyede yakıt tüketimini yönetmeyi içeren ilk Ay İnişi oyununu yarattı.",
      "55 yıl boyunca fark edilmeyen oyundaki bir hata, iniş tespitinde yanlışlıklara neden olan eksik bir 'ikiye bölme' işlemi içeriyordu; bu hatanın düzeltilmesi iniş doğruluğunu artırır.",
      "Oyun, Tsiolkovsky roket denklemi ve Taylor serisi açılımı gibi zamanının ileri düzey sayısal yöntemlerini kullanarak, erken dönem oyun tasarımında kayda değer bir başarı elde etti."
    ],
    "commentSummary": [
      "1960'larda lisede Jim Storer tarafından yazılan ilk Lunar Lander oyununda 55 yıllık bir hata keşfedildi.",
      "FOCAL programlama dilinde yazılmış olan oyun, özellikle o dönemdeki bir lise öğrencisi için fizik ve sayısal teknikler konusunda etkileyici bir anlayış gerektiriyordu.",
      "Keşif, erken dönem bilgisayar oyunlarının tarihsel önemini ve teknik zorluklarını, ayrıca kodlama uygulamalarının ve kalite güvencesinin on yıllar içindeki evrimini vurgulamaktadır."
    ],
    "points": 238,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1718367846
  },
  {
    "id": 40676239,
    "title": "Mantar okyanus plastiklerini parçalar",
    "originLink": "https://www.nioz.nl/en/news/fungus-breaks-down-ocean-plastic",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40676239",
    "commentBody": "",
    "originSummary": [
      "Sonuç: NIOZ ve diğer kurumlardan araştırmacılar, Parengyodontium album adlı deniz mantarının UV güneş ışığına maruz kaldığında polietilen plastiği parçalayabildiğini keşfettiler.",
      "Bu mantar, polietileni günde yaklaşık %0,05 oranında parçalayarak karbondioksite dönüştürür, ancak yalnızca okyanus yüzeyine yakın yüzen plastikler için geçerlidir.",
      "Bu keşif, Science of the Total Environment dergisinde yayımlandı ve özellikle plastik üretiminin 2060 yılına kadar üç katına çıkması beklendiğinden, plastik kirliliğini ele almak için biyolojik çözümlerin potansiyelini vurguluyor."
    ],
    "commentSummary": [
      "Mantar (Parengyodontium album), okyanus plastiklerini parçalama yeteneği nedeniyle izole edilmiş ve dizilenmiştir, eğer çoğalırsa ekolojik etkisi hakkında endişeler uyandırmaktadır.",
      "Vücutta biriken mikroplastiklerin ve doğal biyopolimerlerin potansiyel sağlık riskleri, asbest liflerinin zararlı etkileriyle karşılaştırılarak tartışılmaktadır.",
      "Konuşma, mikroplastikleri parçalamak için makrofajları geliştirme ve insan hücreleriyle birlikte var olabilen mantarları kullanma gibi spekülatif fikirleri içeriyor, ancak bunlar daha fazla araştırma gerektiriyor."
    ],
    "points": 224,
    "commentCount": 201,
    "retryCount": 0,
    "time": 1718323491
  },
  {
    "id": 40674135,
    "title": "IKEA'nın perakendecisi, maaşları artırarak küresel 'mutsuz işçi' krizini çözdü",
    "originLink": "https://fortune.com/europe/2024/06/11/ikeas-boss-solved-swedish-retailers-global-unhappy-worker-crisis-raising-salaries-introducing-flexible-working-subsidized-childcare/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40674135",
    "commentBody": "",
    "originSummary": [
      "Ikea, yüksek çalışan devir hızını ele almak için ücretleri artırarak, esnek çalışma programları sunarak ve çocuk bakımını sübvanse ederek, dünya genelinde gönüllü devir oranlarını önemli ölçüde azalttı.",
      "CEO Jon Abrahamsson Ring, ön saflardaki çalışanların koşullarını iyileştirmek ve operasyonları teknoloji ile düzenlemek için stratejiler uyguladı, bu da küresel işten ayrılma oranının Ağustos 2022'de %22,4'ten Nisan 2023'te %17,5'e düşmesine yol açtı.",
      "Iyileştirmelere rağmen, Ikea zihinsel sağlık desteği, küresel iş gücünü yönetme ve özellikle ABD'de sendika çabalarını bastırma suçlamaları gibi zorluklarla karşılaşmaya devam ediyor."
    ],
    "commentSummary": [
      "IKEA, küresel 'mutsuz çalışan' krizini ücretleri artırarak, esnek çalışma saatleri getirerek ve çocuk bakımını sübvanse ederek ele aldı ve çalışan memnuniyetinin sadece daha yüksek maaşla ilgili olmadığını vurguladı.",
      "Tartışma, şirket faydalarının doğrudan parasal tazminata karşı avantajları ve dezavantajlarını içeriyor; bazıları, faydaların daha maliyet etkin olabileceğini ve daha iyi bir çalışma ortamına katkıda bulunabileceğini savunuyor.",
      "Metin ayrıca, çift gelirli hanelerin emlak fiyatları üzerindeki etkisi ve çocuk yetiştirmenin önemi gibi daha geniş toplumsal sonuçlara da değinerek, profesyonel çocuk bakımının çocuklar, ebeveynler ve toplum için faydalı olabileceğini öne sürüyor."
    ],
    "points": 222,
    "commentCount": 189,
    "retryCount": 0,
    "time": 1718309534
  },
  {
    "id": 40680737,
    "title": "Nvidia Warp: Yüksek performanslı GPU simülasyonu ve grafikler için bir Python çerçevesi",
    "originLink": "https://github.com/NVIDIA/warp",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40680737",
    "commentBody": "",
    "originSummary": [
      "NVIDIA Warp, Python işlevlerini CPU veya GPU için verimli çekirdek koduna derleyerek yüksek performanslı simülasyon ve grafik kodu için tasarlanmış bir Python çerçevesidir.",
      "Uzamsal hesaplama, fizik simülasyonu, algılama, robotik ve geometri işleme destekler ve PyTorch ve JAX kullanarak makine öğrenimi hatlarıyla entegre olur.",
      "Kurulum, ek bağımlılıkların mevcut olduğu PyPI aracılığıyla yapılır ve GPU desteği için CUDA uyumlu bir NVIDIA GPU gerektirir. Çerçeve, Windows, Linux ve macOS'ta x86-64 ve ARMv8 CPU'larla uyumludur."
    ],
    "commentSummary": [
      "Nvidia Warp, Taichi Lang ve Numba gibi Python'dan GPU'ya kod projeleri listesine eklenen, yüksek performanslı GPU simülasyonu ve grafikler için tasarlanmış yeni bir Python çerçevesidir.",
      "Tartışma, Nvidia'nın açık kaynak yazılımının tescilli doğasını vurguluyor ve yazılımın rakip ürünler geliştirmek için kullanılmasını yasaklayan kısıtlayıcı lisanslama konusundaki endişeleri dile getiriyor.",
      "Kullanıcılar, Taichi ile ilgili karışık deneyimler ifade ediyor; kullanım kolaylığı ve veri sınıflarını desteklemesini belirtirken, aynı zamanda hatalar ve geliştirme sorunlarından bahsediyorlar, bu da bazılarını Nvidia Warp'a geçmeyi düşünmeye yönlendiriyor."
    ],
    "points": 209,
    "commentCount": 53,
    "retryCount": 0,
    "time": 1718371736
  },
  {
    "id": 40680648,
    "title": "Sunumlara ikinci slayttan başlayın",
    "originLink": "https://tidyfirst.substack.com/p/start-presentations-on-the-second",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40680648",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Metin, sunumlarda hikaye anlatımının önemini vurgulamakta ve sunumların başından itibaren düşünce uyandırması ve izleyiciyi meşgul etmesi gerektiğini önermektedir.",
      "Bu, büyük şirketlerde sözlü sunumlar ile slayt desteleri arasındaki farkı vurgular ve ikincisinin genellikle metin ağırlıklı ve üst yönetim için kendini açıklayıcı olduğunu belirtir.",
      "Metin, teknik sunumlarda anlatı yapısının kullanılmasını, bir sorunla başlayıp gerilim oluşturarak ve ardından bir çözüm sunarak içeriği daha ilgi çekici ve akılda kalıcı hale getirmeyi tavsiye ediyor."
    ],
    "points": 183,
    "commentCount": 79,
    "retryCount": 0,
    "time": 1718371031
  },
  {
    "id": 40677810,
    "title": "Apple'ın yapay zekaya teknik yaklaşımına bir bakış, temel model performansı vb. dahil.",
    "originLink": "https://www.interconnects.ai/p/apple-intelligence",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40677810",
    "commentBody": "",
    "originSummary": [
      "Apple, kullanıcı etkileşimini artırmak için dijital yaşamın çeşitli yönlerine yapay zekayı entegre eden Apple Intelligence adlı çok modelli bir yapay zeka sistemi tanıttı.",
      "Rakiplerinin yapay zeka üstünlüğüne odaklanmasının aksine, Apple pratik uygulamalara vurgu yaparak bu sonbaharda tüm cihazlarında yeni yapay zeka özelliklerini piyasaya sürmeyi planlıyor.",
      "Apple'ın yapay zeka stratejisi, temel model performansı, cihaz üzerindeki strateji ve uyum stratejilerini içerir; bu modeller GPT-4 ile karşılaştırılabilir ve önemli gizlilik özelliklerine sahiptir."
    ],
    "commentSummary": [
      "Apple'ın yapay zeka teknik yaklaşımı, daha fazla hesaplama kapasitesi gerektiren görevler için Özel Bulut Hesaplama kullanmayı içerir ve buluta gönderilen verilerin Apple tarafından depolanmadığını veya erişilemediğini garanti eder.",
      "Sistem, modellerin kısmen istemci tarafında yürütülmesini, ana model yürütmesinin bulutta yapılmasını içerir ve dinamik makine öğrenimi için Yerel LoRA'ların (Düşük Sıralı Adaptasyonlar) ve web tabanlı model kilidini açmak için WebGPU'nun kullanımını öngörür.",
      "Bu tartışma, Apple'ın dikey entegrasyon gücünü, potansiyel uzun vadeli uç cihaz AI yarışını ve AI'nın iPhone satışları üzerindeki etkisini vurgularken, Nvidia'nın pazar konumu ve donanım satış stratejisi ile karşılaştırmaktadır."
    ],
    "points": 179,
    "commentCount": 87,
    "retryCount": 0,
    "time": 1718343407
  },
  {
    "id": 40674073,
    "title": "iPhone'u elinden almak kızı daha iyi bir insan yaptı",
    "originLink": "https://www.theguardian.com/technology/article/2024/jun/13/kids-no-iphone-screen-time",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40674073",
    "commentBody": "",
    "originSummary": [
      "Yazar, kızının zihinsel sağlığı, akademik performansı ve davranışları üzerindeki olumsuz etkileri nedeniyle iPhone kullanmasını yasakladı.",
      "Kızına depresyon ve anksiyete teşhisi kondu, dikkatinin önemli bir kısmı sosyal medyaya ve akran onayını kazanmaya odaklanmıştı.",
      "Yazar, çocuklar arasında telefon bağımlılığı konusundaki daha geniş sorunu ve telefon kullanımını etkili bir şekilde yönetmek için hem bireysel hem de sistemik değişikliklerin gerekliliğini vurguluyor."
    ],
    "commentSummary": [
      "Makale, sosyal medya ve telefon bağımlılığının zararlı etkilerini tartışarak, bunların zor düşünceler ve duygulardan kaçmak için kullanılan kaçınma davranışları olduğunu öne sürüyor.",
      "Çözümün bu başa çıkma mekanizmalarını ortadan kaldırmak değil, bireylerin ruh sağlığını iyileştirmelerine yardımcı olmak olduğunu savunuyor.",
      "Metin ayrıca COVID karantinalarının etkisine, gizlilik endişeleri nedeniyle Linux'a geçişe ve topluluk tabanlı sosyal medya ağlarının potansiyel faydalarına değiniyor."
    ],
    "points": 170,
    "commentCount": 193,
    "retryCount": 0,
    "time": 1718309242
  },
  {
    "id": 40677926,
    "title": "60 Alman iklim yeşillendirme çabasından 40'ı sahtekar",
    "originLink": "https://www.fr.de/politik/warnungen-milliarden-an-konzerne-gezahlt-betrugsverdacht-beim-klimaschutz-trotz-zr-93122965.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40677926",
    "commentBody": "",
    "originSummary": [
      "Alman Federal Çevre Bakanlığı, THG kotasından milyonlarca fonla Çin'in iklim koruma projelerini ihmalkar bir şekilde desteklemekle suçlanıyor.",
      "2023 Ağustos ayından bu yana Çin'deki 60 iklim koruma projesinden 40'ına karşı önemli dolandırıcılık iddiaları ortaya çıktı ve bu durum, 2024 yılı sonuna kadar fonlamanın durdurulmasına yol açtı.",
      "Alman hükümeti, Fransa ve Hollanda ile birlikte, elektrikli araç sahiplerinin teşviklerini etkileyen ve sağlam kontrol mekanizmalarından yoksun olan THG bonus sistemindeki sorunları ele alması için AB Komisyonu'na çağrıda bulunuyor."
    ],
    "commentSummary": [
      "Çin'deki 60 Alman iklim yeşillendirme projesinden 40'ında sahtekarlık tespit edildi, bir Çinli şirket tarafından belgelerin değiştirildiği bildirildi ve bu durum çok uluslu petrol şirketlerinin potansiyel sahtekarlığını düşündürüyor.",
      "Çinli yan kuruluşların dolandırıcılık uyarılarına rağmen, Alman yetkililer, yabancı denetimlere yönelik Çin kısıtlamaları nedeniyle doğrulanamayan CO2 tasarrufu iddialarını kabul etti.",
      "Metin, mevcut karbon kredisi sisteminin kolayca istismar edilebilir olduğunu eleştiriyor ve ekonomik bozulmayı önlemek için kademeli bir geçişe ihtiyaç duyulduğunu kabul ederken, gerçek emisyonlar için faturalandırma yapılmasını öneriyor."
    ],
    "points": 159,
    "commentCount": 114,
    "retryCount": 0,
    "time": 1718344757
  },
  {
    "id": 40683210,
    "title": "Microsoft'un Recall AI özelliği süresiz olarak ertelendi",
    "originLink": "https://blogs.windows.com/windowsexperience/2024/06/07/update-on-the-recall-preview-feature-for-copilot-pcs/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40683210",
    "commentBody": "",
    "originSummary": [
      "7 Haziran 2024'te, Copilot+ PC'lerdeki Recall önizleme özelliği için bir güncelleme duyuruldu ve topluluk geri bildirimlerine dayanarak kalite ve güvenliği sağlamak amacıyla 18 Haziran 2024'ten itibaren Windows Insider Programı (WIP) kapsamında kullanılabilir hale getirileceği belirtildi.",
      "Recall, şifrelenmiş anlık görüntüler alarak PC etkinliğinin görsel bir zaman çizelgesini oluşturur. Bu görüntüler yerel olarak depolanır ve kullanıcılar tarafından kontrol edilebilir, duraklatılabilir veya silinebilir; erişim için Windows Hello Gelişmiş Oturum Açma Güvenliği gerektirir.",
      "Copilot+ PC'ler, 20 Mayıs 2024'te piyasaya sürülen, geliştirilmiş performans ve yapay zeka deneyimlerine sahip gelişmiş Windows PC'lerdir. Microsoft Pluton güvenlik işlemcisi ve Güvenli çekirdek PC teknolojisi gibi gelişmiş güvenlik önlemleri sunmaktadır."
    ],
    "commentSummary": [
      "Microsoft'un Recall AI özelliği, belirtilmemiş güvenlik endişeleri nedeniyle süresiz olarak ertelendi ve bu durum stratejik amaçlar ve gözetim için potansiyel kötüye kullanım hakkında spekülasyonlara yol açtı.",
      "Recall AI'nin, banka bilgileri ve kişisel aktiviteler gibi hassas bilgileri kaydedip sızdırma potansiyeli konusunda endişeler dile getiriliyor, bu da gizlilik sorunlarına yol açabilir.",
      "Bu gecikme ve endişeler, Microsoft'un tüketici karşıtı uygulamalarına yönelik geçmiş eleştirileri yansıtıyor ve Xbox One lansmanı sırasında karşılaşılan tepkiler ve Adobe'nin son EULA güncellemesi ile karşılaştırmalar yapılıyor."
    ],
    "points": 137,
    "commentCount": 49,
    "retryCount": 0,
    "time": 1718388189
  },
  {
    "id": 40681784,
    "title": "Maliyet: Llama-3 8B-Instruct'u kendi sunucunuzda barındırma",
    "originLink": "https://blog.lytix.co/posts/self-hosting-llama-3",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40681784",
    "commentBody": "",
    "originSummary": [
      "Bir Llama-3 8B-Instruct modelini kendi sunucunuzda barındırmak, ChatGPT kullanmaktan çok daha pahalıdır; 1 milyon token başına yaklaşık 17 dolar maliyeti varken, ChatGPT'nin maliyeti 1 milyon token başına 1 dolardır.",
      "Self-hosting'in başlangıçtaki yüksek maliyeti, donanım masrafları ve enerji maliyetlerini içerir, bu da uzun vadeli tasarruf potansiyeline rağmen onu daha az ekonomik hale getirir.",
      "Self-hosted donanımı yönetmek ve ölçeklendirmek ek zorluklar sunar ve gerçekçi olmayan %100 kullanım varsayımını gerektirir, bu da çoğu kullanıcı için daha az pratik hale getirir."
    ],
    "commentSummary": [
      "Kendi kendine barındırma donanımı, AWS kullanmaya kıyasla maliyetleri önemli ölçüde azaltabilir ve 4x NVidia Tesla T4 içeren bir kurulum yaklaşık 3.800 dolara mal olabilir. SONUÇ:",
      "Metin, potansiyel kesinti süreleri ve bakım maliyetleri nedeniyle gerekçelendirilmesi gereken bir iş durumu ihtiyacını vurgulayarak, kendi kendine barındırmanın artılarını ve eksilerini tartışıyor.",
      "Groq, Llama 3 modelleri için uygun maliyetli fiyatlandırma sunar ve metin, daha iyi verimlilik için quantized modeller ve together.ai gibi alternatif hizmetlerin kullanılmasını önerir."
    ],
    "points": 132,
    "commentCount": 94,
    "retryCount": 0,
    "time": 1718379058
  },
  {
    "id": 40679809,
    "title": "POSIX.1-2024 yayımlandı",
    "originLink": "https://ieeexplore.ieee.org/document/10555529",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40679809",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "POSIX.1-2024 yayınlandı ve yakında Open Group web sitesinde mevcut olacak, kabuk betikleme ve diğer işlevler için güncellenmiş standartlar sağlayacak.",
      "POSIX.1-2024'teki yeni özellikler arasında genişletilmiş düzenli ifadeler için sed -E, find -print0, xargs -0, güvenli dosya işleme için read -d ve C17, strlcpy, strlcat ve daha fazlası için destek bulunmaktadır.",
      "Güncelleme, AIX, Debian, macOS ve çeşitli Linux dağıtımları gibi farklı sistemler arasında daha iyi uyumluluk için POSIX uyumlu betikler yazmanın önemini vurgulamaktadır."
    ],
    "points": 123,
    "commentCount": 55,
    "retryCount": 0,
    "time": 1718365048
  },
  {
    "id": 40675577,
    "title": "Lamini Bellek Ayarı: 10 Kat Daha Az Halüsinasyon",
    "originLink": "https://www.lamini.ai/blog/lamini-memory-tuning",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40675577",
    "commentBody": "",
    "originSummary": [
      "Lamini Bellek Ayarı, gerçekleri Büyük Dil Modellerine (LLM'ler) yerleştirmenin yeni bir yöntemidir, bu da gerçek doğruluğunu önemli ölçüde artırır ve halüsinasyonları azaltır.",
      "Bir Fortune 500 müşterisi için %95 doğruluk sağladı, diğer yöntemlerle %50'ye kıyasla ve halüsinasyonları %50'den %5'e düşürdü.",
      "Yöntem, genel performansı korurken belirli gerçekler üzerinde sıfır hata için optimize ederek, herhangi bir açık kaynaklı LLM'nin üzerine milyonlarca uzman adaptörünü kesin gerçeklerle ayarlamayı içerir."
    ],
    "commentSummary": [
      "Lamini Bellek Ayarı, çok sayıda gerçeklere dayalı Düşük Dereceli Adaptasyonları (LoRA'ları) sıfır kayıpla eğiten ve bir sorgu için uygun LoRA'ları seçmek için Geri Getirme Artırılmış Üretim (RAG) kullanan bir yöntemdir.",
      "Yöntem, çıkarım zamanında hangi LoRA'ların entegre edileceğine karar vermek için uzman bir yönlendirici katmanı içerir, ancak yönlendiricinin eğitim süreci belirsizdir. SONUÇ:",
      "Model, Uzmanlar Karışımı (MoE) ve çapraz dikkat kavramlarını birleştirir, önceden eğitilmiş Büyük Dil Modeli (LLM) ağırlıklarını sabit tutarken, çapraz dikkat katmanında eğitilerek olgusal doğruluğu sağlar."
    ],
    "points": 123,
    "commentCount": 49,
    "retryCount": 0,
    "time": 1718317780
  },
  {
    "id": 40675397,
    "title": "Defterler Kodun McDonalds'ıdır",
    "originLink": "https://yobibyte.github.io/notebooks.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40675397",
    "commentBody": "",
    "originSummary": [
      "Defterler, durum ve sürüm oluşturma ile ilgili karışıklığa yol açabilir ve test yapmama veya kodu denetlememe gibi kötü alışkanlıkları teşvik edebilir.",
      "Genellikle farklı kurulumlar ve bağımlılıklar vardır, bu da kod çökmelerine ve hayal kırıklığına neden olabilir.",
      "Defterler, fikirleri test etmek için kullanışlıdır, ancak kodu modüllere aktarmak zor ve zaman alıcı olabilir."
    ],
    "commentSummary": [
      "Defterler öncelikle deneyler yapmak ve sonuçları kaydetmek için kullanılır, yazılım geliştirme için değil.",
      "Jupyter defterleri, ders projelerini çoğaltmak, satır içi grafik çizmek ve kod parçalarını önbelleğe almak için kullanışlıdır, ancak büyük kod tabanları için verimsiz olabilir.",
      "Defterler, hızlı deneyler, öğretim ve dokümantasyon için faydalıdır, ancak sürdürülebilirlik ve etkileşimle ilgili potansiyel sorunlar nedeniyle üretim kodu için ideal değildir."
    ],
    "points": 120,
    "commentCount": 137,
    "retryCount": 0,
    "time": 1718316595
  }
]
