[
  {
    "id": 40676408,
    "title": "ऑनलाइन खेलों और आभासी दुनियाओं में भूमि मूल्य कर (2022) परिणाम:",
    "originLink": "https://progressandpoverty.substack.com/p/land-value-tax-in-online-games-and",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40676408",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "पाठ में ऑनलाइन खेलों और आभासी दुनियाओं में भूमि मूल्य कर (एलवीटी) लागू करने के फायदे और नुकसान पर चर्चा की गई है, यह सुझाव देते हुए कि इससे भूमि मूल्यों में कमी आ सकती है लेकिन हटाए जाने पर भूमि मालिकों को लाभ भी हो सकता है।",
      "यह भूमि से श्रम, उद्यम, और वाणिज्य पर करों को स्थानांतरित करने की संभावना को उजागर करता है, जबकि धनी जमींदारों से प्रतिरोध और एलवीटी प्रगति को बनाए रखने की कठिनाई की चेतावनी देता है।",
      "यह पाठ LVT के व्यापक प्रभावों पर भी चर्चा करता है, जिसमें सभी अन्य करों को प्रतिस्थापित करने की इसकी संभावित क्षमता, ऐसे प्रणाली की व्यवहार्यता, और इसके कार्यान्वयन के लिए सार्वजनिक जागरूकता और मजबूत नीतियों के महत्व को शामिल किया गया है।"
    ],
    "points": 327,
    "commentCount": 321,
    "retryCount": 0,
    "time": 1718325381
  },
  {
    "id": 40673567,
    "title": "अमेरिका-सऊदी पेट्रोडॉलर समझौता 50 साल बाद समाप्त",
    "originLink": "https://www.nasdaq.com/articles/us-saudi-petrodollar-pact-ends-after-50-years",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40673567",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "अमेरिका-सऊदी पेट्रोडॉलर समझौता 50 साल बाद समाप्त हो गया है, लेकिन तेल व्यवसाय में तत्काल परिवर्तन की उम्मीद नहीं है।",
      "समझौते का अंत धीरे-धीरे डॉलर से विमुद्रीकरण की ओर एक बदलाव की ओर ले जा सकता है, लेकिन यह प्रक्रिया समय लेगी।",
      "अमेरिका दुनिया का सबसे बड़ा ऊर्जा उत्पादक बना हुआ है, जो भू-राजनीतिक परिदृश्य और पेट्रोडॉलर की प्रासंगिकता को प्रभावित कर सकता है।"
    ],
    "points": 281,
    "commentCount": 298,
    "retryCount": 0,
    "time": 1718306902
  },
  {
    "id": 40680218,
    "title": "मुझे पहले लूनर लैंडर गेम में 55 साल पुरानी बग मिली",
    "originLink": "https://martincmartin.com/2024/06/14/how-i-found-a-55-year-old-bug-in-the-first-lunar-lander-game/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40680218",
    "commentBody": "",
    "originSummary": [
      "1969 में, हाई स्कूल के छात्र जिम स्टोरर ने पहला लूनर लैंडिंग गेम बनाया, जिसमें एक मून लैंडर को पायलट करना और हर 10 सिम्युलेटेड सेकंड में ईंधन जलाने का प्रबंधन करना शामिल था।",
      "खेल में 55 वर्षों तक अनदेखा रहा एक बग, जिसमें 'दो से विभाजित' गायब था, जिसके कारण गलत लैंडिंग का पता चलता था; इसे ठीक करने से लैंडिंग की सटीकता में सुधार होता है।",
      "इस खेल ने अपने समय के लिए उन्नत संख्यात्मक विधियों का उपयोग किया, जैसे कि सिओलकोव्स्की रॉकेट समीकरण और टेलर श्रृंखला विस्तार, जिससे यह प्रारंभिक खेल डिजाइन में एक उल्लेखनीय उपलब्धि बन गया।"
    ],
    "commentSummary": [
      "1960 के दशक में हाई स्कूल के दौरान जिम स्टोरर द्वारा लिखे गए पहले लूनर लैंडर गेम में 55 साल पुरानी एक बग की खोज की गई।",
      "यह खेल, जो FOCAL प्रोग्रामिंग भाषा में लिखा गया था, उस समय के एक हाई स्कूल छात्र के लिए विशेष रूप से भौतिकी और संख्यात्मक तकनीकों की एक प्रभावशाली समझ की आवश्यकता थी।",
      "यह खोज प्रारंभिक कंप्यूटर खेलों के ऐतिहासिक महत्व और तकनीकी चुनौतियों को उजागर करती है, साथ ही दशकों में कोडिंग प्रथाओं और गुणवत्ता आश्वासन के विकास को भी दर्शाती है।"
    ],
    "points": 238,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1718367846
  },
  {
    "id": 40676239,
    "title": "फंगस महासागर के प्लास्टिक को तोड़ता है",
    "originLink": "https://www.nioz.nl/en/news/fungus-breaks-down-ocean-plastic",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40676239",
    "commentBody": "",
    "originSummary": [
      "एनआईओज और अन्य संस्थानों के शोधकर्ताओं ने पाया है कि समुद्री कवक Parengyodontium album यूवी सूर्यप्रकाश के संपर्क में आने पर पॉलीइथिलीन प्लास्टिक को तोड़ सकता है।",
      "फंगस पॉलीएथिलीन को लगभग 0.05% प्रति दिन की दर से विघटित करता है, इसे कार्बन डाइऑक्साइड में परिवर्तित करता है, लेकिन केवल समुद्र की सतह के पास तैरते हुए प्लास्टिक के लिए।",
      "यह खोज, जो जर्नल साइंस ऑफ द टोटल एनवायरनमेंट में प्रकाशित हुई है, प्लास्टिक प्रदूषण को संबोधित करने के लिए जैविक समाधानों की संभावनाओं को उजागर करती है, विशेष रूप से जब प्लास्टिक उत्पादन 2060 तक तीन गुना होने की उम्मीद है।"
    ],
    "commentSummary": [
      "एक कवक (Parengyodontium album) को समुद्री प्लास्टिक को तोड़ने की क्षमता के लिए अलग किया गया और अनुक्रमित किया गया है, जिससे यह चिंता बढ़ रही है कि यदि यह फैलता है तो इसका पारिस्थितिक प्रभाव क्या होगा।",
      "शरीर में सूक्ष्म प्लास्टिक और प्राकृतिक जैव पॉलिमर के संचय के संभावित स्वास्थ्य जोखिमों पर चर्चा की जाती है, जिसमें एस्बेस्टस फाइबर के हानिकारक प्रभावों की तुलना की जाती है।",
      "बातचीत में मैक्रोफेज को सुधारने और माइक्रोप्लास्टिक्स को तोड़ने के लिए और ऐसे कवक का उपयोग करने के बारे में अटकलें शामिल हैं जो मानव कोशिकाओं के साथ सह-अस्तित्व में रह सकते हैं, हालांकि इन पर और अधिक शोध की आवश्यकता है।"
    ],
    "points": 224,
    "commentCount": 201,
    "retryCount": 0,
    "time": 1718323491
  },
  {
    "id": 40674135,
    "title": "आईकेए के रिटेलर ने वेतन बढ़ाकर वैश्विक 'असंतुष्ट कर्मचारी' संकट को हल किया",
    "originLink": "https://fortune.com/europe/2024/06/11/ikeas-boss-solved-swedish-retailers-global-unhappy-worker-crisis-raising-salaries-introducing-flexible-working-subsidized-childcare/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40674135",
    "commentBody": "",
    "originSummary": [
      "आईकेईए ने उच्च कर्मचारी टर्नओवर को संबोधित करने के लिए वेतन बढ़ाया, लचीले कार्य समय की पेशकश की, और चाइल्डकेयर को सब्सिडी दी, जिससे वैश्विक स्तर पर स्वैच्छिक टर्नओवर दरों में महत्वपूर्ण कमी आई।",
      "सीईओ जॉन अब्राहमसन रिंग ने अग्रिम पंक्ति के कर्मचारियों की स्थिति में सुधार और प्रौद्योगिकी के साथ संचालन को सुव्यवस्थित करने के लिए रणनीतियों को लागू किया, जिससे वैश्विक त्याग दर अगस्त 2022 में 22.4% से घटकर अप्रैल 2023 में 17.5% हो गई।",
      "सुधारों के बावजूद, आइकिया को मानसिक स्वास्थ्य समर्थन, वैश्विक कार्यबल का प्रबंधन, और विशेष रूप से अमेरिका में यूनियन प्रयासों को दबाने के आरोपों सहित चुनौतियों का सामना करना पड़ रहा है।"
    ],
    "commentSummary": [
      "आईकेए ने अपने वैश्विक 'असंतुष्ट कर्मचारी' संकट को वेतन बढ़ाकर, लचीले कार्य घंटे पेश करके, और चाइल्डकेयर को सब्सिडी देकर संबोधित किया है, यह दर्शाते हुए कि कर्मचारी संतुष्टि केवल उच्च वेतन से अधिक शामिल करती है।",
      "चर्चा में कंपनी लाभों के बनाम प्रत्यक्ष मौद्रिक मुआवजे के फायदे और नुकसान शामिल हैं, जिसमें कुछ लोग तर्क देते हैं कि लाभ अधिक लागत-प्रभावी हो सकते हैं और एक बेहतर कार्य वातावरण में योगदान कर सकते हैं।",
      "पाठ व्यापक सामाजिक प्रभावों पर भी ध्यान देता है, जैसे कि दोहरी आय वाले परिवारों का रियल एस्टेट की कीमतों पर प्रभाव और बच्चों के पालन-पोषण का महत्व, यह सुझाव देते हुए कि पेशेवर बाल देखभाल बच्चों, माता-पिता और समाज के लिए लाभकारी हो सकती है।"
    ],
    "points": 222,
    "commentCount": 189,
    "retryCount": 0,
    "time": 1718309534
  },
  {
    "id": 40680737,
    "title": "एनवीडिया वॉर्प: उच्च प्रदर्शन जीपीयू सिमुलेशन और ग्राफिक्स के लिए एक पायथन फ्रेमवर्क",
    "originLink": "https://github.com/NVIDIA/warp",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40680737",
    "commentBody": "",
    "originSummary": [
      "एनवीडिया वॉर्प एक पायथन फ्रेमवर्क है जिसे उच्च-प्रदर्शन सिमुलेशन और ग्राफिक्स कोड के लिए डिज़ाइन किया गया है, जो पायथन फंक्शनों को सीपीयू या जीपीयू के लिए कुशल कर्नेल कोड में संकलित करता है।",
      "यह स्थानिक कंप्यूटिंग, भौतिकी सिमुलेशन, धारणा, रोबोटिक्स, और ज्यामिति प्रसंस्करण का समर्थन करता है, और PyTorch और JAX का उपयोग करके मशीन-लर्निंग पाइपलाइनों के साथ एकीकृत होता है।",
      "इंस्टॉलेशन PyPI के माध्यम से होता है, जिसमें अतिरिक्त निर्भरताएँ उपलब्ध हैं, और इसके लिए GPU समर्थन के लिए CUDA-सक्षम NVIDIA GPU की आवश्यकता होती है। यह फ्रेमवर्क Windows, Linux, और macOS पर x86-64 और ARMv8 CPUs के साथ संगत है।"
    ],
    "commentSummary": [
      "एनवीडिया वॉर्प एक नया पायथन फ्रेमवर्क है जो उच्च-प्रदर्शन जीपीयू सिमुलेशन और ग्राफिक्स के लिए डिज़ाइन किया गया है, और यह ताइची लैंग और नुम्बा जैसे पायथन-से-जीपीयू कोड प्रोजेक्ट्स की बढ़ती सूची में शामिल हो गया है।",
      "चर्चा में Nvidia के ओपन-सोर्स सॉफ़्टवेयर की स्वामित्व प्रकृति पर प्रकाश डाला गया है, जिसमें प्रतिस्पर्धी उत्पादों के विकास के लिए सॉफ़्टवेयर के उपयोग को प्रतिबंधित करने वाले प्रतिबंधात्मक लाइसेंसिंग के बारे में चिंताएँ हैं।",
      "उपयोगकर्ता ताइची के साथ मिश्रित अनुभव व्यक्त करते हैं, इसकी उपयोग में आसानी और डेटा क्लासेस के समर्थन की सराहना करते हैं, लेकिन बग्स और विकास संबंधी समस्याओं का भी उल्लेख करते हैं, जिससे कुछ लोग एनवीडिया वार्प पर स्विच करने पर विचार कर रहे हैं।"
    ],
    "points": 209,
    "commentCount": 53,
    "retryCount": 0,
    "time": 1718371736
  },
  {
    "id": 40680648,
    "title": "प्रस्तुतियों को दूसरे स्लाइड से शुरू करें",
    "originLink": "https://tidyfirst.substack.com/p/start-presentations-on-the-second",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40680648",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "पाठ प्रस्तुति में कहानी कहने के महत्व पर जोर देता है, यह सुझाव देते हुए कि उन्हें विचारोत्तेजक होना चाहिए और शुरुआत से ही दर्शकों को शामिल करना चाहिए।",
      "यह बड़े निगमों में मौखिक प्रस्तुतियों और स्लाइड डेक के बीच के अंतर को उजागर करता है, यह बताते हुए कि बाद वाले अक्सर पाठ-प्रधान और वरिष्ठ प्रबंधन के लिए आत्म-व्याख्यात्मक होते हैं।",
      "पाठ तकनीकी प्रस्तुतियों में एक कथा संरचना का उपयोग करने की सलाह देता है, जिसमें एक समस्या से शुरू करना, तनाव बनाना और फिर एक समाधान प्रदान करना शामिल है, ताकि सामग्री को अधिक आकर्षक और यादगार बनाया जा सके।"
    ],
    "points": 183,
    "commentCount": 79,
    "retryCount": 0,
    "time": 1718371031
  },
  {
    "id": 40677810,
    "title": "एआई के प्रति एप्पल के तकनीकी दृष्टिकोण पर एक नजर, जिसमें कोर मॉडल प्रदर्शन आदि शामिल हैं।",
    "originLink": "https://www.interconnects.ai/p/apple-intelligence",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40677810",
    "commentBody": "",
    "originSummary": [
      "एप्पल ने एक बहु-मॉडल एआई सिस्टम पेश किया है जिसे एप्पल इंटेलिजेंस कहा जाता है, जो उपयोगकर्ता की सहभागिता को बढ़ाने के लिए डिजिटल जीवन के विभिन्न पहलुओं में एआई को एकीकृत करता है।",
      "प्रतिद्वंद्वियों के विपरीत जो एआई श्रेष्ठता पर ध्यान केंद्रित कर रहे हैं, एप्पल व्यावहारिक अनुप्रयोगों पर जोर देता है और इस पतझड़ में सभी उपकरणों में नए एआई फीचर्स लॉन्च करने की योजना बना रहा है।",
      "एप्पल की एआई रणनीति में कोर मॉडल प्रदर्शन, ऑन-डिवाइस रणनीति, और संरेखण रणनीतियाँ शामिल हैं, जिनमें मॉडल GPT-4 के तुलनीय हैं और महत्वपूर्ण गोपनीयता सुविधाएँ हैं।"
    ],
    "commentSummary": [
      "एप्पल का एआई तकनीकी दृष्टिकोण उन कार्यों के लिए प्राइवेट क्लाउड कंप्यूट का उपयोग करना शामिल है जिनके लिए अधिक कम्प्यूटेशनल क्षमता की आवश्यकता होती है, यह सुनिश्चित करते हुए कि क्लाउड को भेजा गया डेटा एप्पल के लिए संग्रहीत या सुलभ नहीं है।",
      "यह प्रणाली मॉडल्स के आंशिक क्लाइंट-साइड निष्पादन को शामिल करती है, जिसमें मुख्य मॉडल निष्पादन क्लाउड में होता है, और गतिशील मशीन लर्निंग के लिए लोकल लोरा (लो-रैंक एडाप्टेशन्स) के उपयोग और वेब-आधारित मॉडल अनलॉकिंग के लिए वेबजीपीयू की भविष्यवाणी करती है।",
      "चर्चा में एप्पल की वर्टिकल इंटीग्रेशन की ताकत, संभावित दीर्घकालिक एज डिवाइस एआई दौड़, और आईफोन बिक्री पर एआई के प्रभाव को उजागर किया गया है, जो एनवीडिया की बाजार स्थिति और हार्डवेयर बिक्री रणनीति के विपरीत है।"
    ],
    "points": 179,
    "commentCount": 87,
    "retryCount": 0,
    "time": 1718343407
  },
  {
    "id": 40674073,
    "title": "iPhone छीनने से बेटी एक बेहतर इंसान बन गई",
    "originLink": "https://www.theguardian.com/technology/article/2024/jun/13/kids-no-iphone-screen-time",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40674073",
    "commentBody": "",
    "originSummary": [
      "लेखक ने अपनी बेटी को उसके मानसिक स्वास्थ्य, शैक्षणिक प्रदर्शन और व्यवहार पर इसके नकारात्मक प्रभाव के कारण उसका आईफोन उपयोग करने से प्रतिबंधित कर दिया।",
      "बेटी को अवसाद और चिंता का निदान हुआ, जिसमें उसका ध्यान सोशल मीडिया और साथियों की स्वीकृति प्राप्त करने पर केंद्रित था।",
      "लेखक बच्चों में फोन की लत के व्यापक मुद्दे और फोन के उपयोग को प्रभावी ढंग से प्रबंधित करने के लिए व्यक्तिगत और प्रणालीगत दोनों परिवर्तनों की आवश्यकता को उजागर करते हैं।"
    ],
    "commentSummary": [
      "लेख में सोशल मीडिया और फोन की लत के हानिकारक प्रभावों पर चर्चा की गई है, यह सुझाव देते हुए कि इनका उपयोग कठिन विचारों और भावनाओं से बचने के लिए एक परिहार व्यवहार के रूप में किया जाता है।",
      "यह तर्क देता है कि समाधान इन निपटने के तंत्रों को हटाना नहीं है, बल्कि व्यक्तियों को उनकी मानसिक स्वास्थ्य में सुधार करने में मदद करना है।",
      "पाठ में COVID लॉकडाउन के प्रभाव, गोपनीयता चिंताओं के कारण लिनक्स की ओर बदलाव, और समुदाय-आधारित सोशल मीडिया नेटवर्क के संभावित लाभों पर भी चर्चा की गई है।"
    ],
    "points": 170,
    "commentCount": 193,
    "retryCount": 0,
    "time": 1718309242
  },
  {
    "id": 40677926,
    "title": "60 में से 40 जर्मन जलवायु हरित प्रयास धोखाधड़ीपूर्ण",
    "originLink": "https://www.fr.de/politik/warnungen-milliarden-an-konzerne-gezahlt-betrugsverdacht-beim-klimaschutz-trotz-zr-93122965.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40677926",
    "commentBody": "",
    "originSummary": [
      "जर्मन संघीय पर्यावरण मंत्रालय पर आरोप है कि उसने टीएचजी कोटा से लाखों फंड के साथ चीनी जलवायु संरक्षण परियोजनाओं का लापरवाही से समर्थन किया है।",
      "अगस्त 2023 से चीन में 60 जलवायु संरक्षण परियोजनाओं में से 40 के खिलाफ महत्वपूर्ण धोखाधड़ी के आरोप सामने आए हैं, जिसके परिणामस्वरूप 2024 के अंत तक वित्त पोषण बंद कर दिया जाएगा।",
      "जर्मन सरकार, फ्रांस और नीदरलैंड्स के साथ मिलकर, ईयू आयोग से THG बोनस प्रणाली में मुद्दों को संबोधित करने का आग्रह कर रही है, जो इलेक्ट्रिक वाहन मालिकों के प्रोत्साहनों को प्रभावित करती है और जिसमें मजबूत नियंत्रण तंत्र की कमी है।"
    ],
    "commentSummary": [
      "चीन में 60 जर्मन जलवायु हरित परियोजनाओं में से 40 में धोखाधड़ी का पता चला, जिसमें एक चीनी कंपनी द्वारा बदले गए दस्तावेजों की रिपोर्ट की गई, जिससे बहुराष्ट्रीय तेल कंपनियों द्वारा संभावित धोखाधड़ी का संकेत मिलता है।",
      "जर्मन अधिकारियों ने चीन की विदेशी जांचों पर प्रतिबंधों के कारण CO2 बचत के अप्रमाणित दावों को स्वीकार कर लिया, जबकि चीनी सहायक कंपनियों ने धोखाधड़ी के बारे में चेतावनी दी थी।",
      "पाठ वर्तमान कार्बन क्रेडिट प्रणाली की आलोचना करता है क्योंकि यह आसानी से शोषणीय है और वास्तविक उत्सर्जन के लिए बिलिंग का सुझाव देता है, जबकि आर्थिक व्यवधान से बचने के लिए एक क्रमिक संक्रमण की आवश्यकता को स्वीकार करता है।"
    ],
    "points": 159,
    "commentCount": 114,
    "retryCount": 0,
    "time": 1718344757
  },
  {
    "id": 40683210,
    "title": "माइक्रोसॉफ्ट की रिकॉल एआई सुविधा अब अनिश्चितकाल के लिए विलंबित है",
    "originLink": "https://blogs.windows.com/windowsexperience/2024/06/07/update-on-the-recall-preview-feature-for-copilot-pcs/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40683210",
    "commentBody": "",
    "originSummary": [
      "7 जून, 2024 को, Copilot+ पीसी पर रिकॉल प्रीव्यू फीचर के लिए एक अपडेट की घोषणा की गई, जो 18 जून, 2024 से विंडोज इनसाइडर प्रोग्राम (WIP) में उपलब्ध होगा, गुणवत्ता और सुरक्षा सुनिश्चित करने के लिए समुदाय की प्रतिक्रिया के आधार पर।",
      "रिकॉल पीसी गतिविधि की एक दृश्य समयरेखा बनाता है, जो एन्क्रिप्टेड स्नैपशॉट्स लेकर बनाई जाती है। ये स्नैपशॉट्स स्थानीय रूप से संग्रहीत होते हैं और उपयोगकर्ताओं द्वारा नियंत्रित, रोके या हटाए जा सकते हैं; इसके लिए विंडोज हैलो एन्हांस्ड साइन-इन सुरक्षा की आवश्यकता होती है।",
      "कोपायलट+ पीसी, जो 20 मई, 2024 को लॉन्च किए गए थे, उन्नत विंडोज पीसी हैं जिनमें बेहतर प्रदर्शन और एआई अनुभव हैं, और इनमें माइक्रोसॉफ्ट प्लूटन सुरक्षा प्रोसेसर और सिक्योर्ड-कोर पीसी तकनीक जैसी उन्नत सुरक्षा उपाय शामिल हैं।"
    ],
    "commentSummary": [
      "Microsoft की रिकॉल एआई फीचर अनिश्चितकाल के लिए स्थगित कर दी गई है, अनिर्दिष्ट सुरक्षा चिंताओं के कारण, जिससे रणनीतिक उद्देश्यों और निगरानी के संभावित दुरुपयोग के बारे में अटकलें लगाई जा रही हैं।",
      "चिंताएँ उठाई जा रही हैं कि रिकॉल एआई संवेदनशील जानकारी, जैसे बैंकिंग क्रेडेंशियल्स और व्यक्तिगत गतिविधियों को रिकॉर्ड और लीक कर सकता है, जिससे गोपनीयता संबंधी समस्याएँ उत्पन्न हो सकती हैं।",
      "विलंब और चिंताएँ माइक्रोसॉफ्ट की उपभोक्ता-विरोधी प्रथाओं की पिछली आलोचनाओं की गूंज हैं, जिनकी तुलना Xbox One लॉन्च के दौरान और Adobe के हालिया EULA अपडेट के समय के विरोध से की जा रही है।"
    ],
    "points": 137,
    "commentCount": 49,
    "retryCount": 0,
    "time": 1718388189
  },
  {
    "id": 40681784,
    "title": "स्वयं होस्टिंग Llama-3 8B-Instruct की लागत",
    "originLink": "https://blog.lytix.co/posts/self-hosting-llama-3",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40681784",
    "commentBody": "",
    "originSummary": [
      "लामा-3 8B-इंस्ट्रक्ट मॉडल को स्वयं होस्ट करना चैटजीपीटी का उपयोग करने की तुलना में काफी अधिक महंगा है, जिसमें प्रति 1 मिलियन टोकन लगभग $17 की लागत आती है, जबकि चैटजीपीटी की लागत प्रति 1 मिलियन टोकन $1 है।",
      "स्वयं-होस्टिंग की प्रारंभिक उच्च लागत में हार्डवेयर खर्च और ऊर्जा लागत शामिल होती है, जिससे यह संभावित दीर्घकालिक बचत के बावजूद कम आर्थिक रूप से लाभकारी बनती है।",
      "स्व-होस्टेड हार्डवेयर का प्रबंधन और स्केलिंग अतिरिक्त चुनौतियाँ प्रस्तुत करता है और अवास्तविक 100% उपयोग मानता है, जिससे यह अधिकांश उपयोगकर्ताओं के लिए कम व्यावहारिक हो जाता है।"
    ],
    "commentSummary": [
      "स्वयं-होस्टिंग हार्डवेयर का उपयोग करने से AWS की तुलना में लागत में काफी कमी आ सकती है, जिसमें 4x NVidia Tesla T4s का सेटअप लगभग $3,800 का खर्च आता है।",
      "पाठ में स्व-होस्टिंग के फायदे और नुकसान पर चर्चा की गई है, जिसमें संभावित डाउनटाइम और रखरखाव लागतों के कारण इसे उचित ठहराने के लिए एक व्यावसायिक मामले की आवश्यकता पर जोर दिया गया है।",
      "Groq Llama 3 मॉडल के लिए किफायती मूल्य निर्धारण प्रदान करता है, और पाठ में बेहतर दक्षता के लिए क्वांटाइज्ड मॉडल और together.ai जैसी वैकल्पिक सेवाओं का उपयोग करने का सुझाव दिया गया है।"
    ],
    "points": 132,
    "commentCount": 94,
    "retryCount": 0,
    "time": 1718379058
  },
  {
    "id": 40679809,
    "title": "POSIX.1-2024 प्रकाशित हुआ",
    "originLink": "https://ieeexplore.ieee.org/document/10555529",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40679809",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "POSIX.1-2024 प्रकाशित हो गया है और जल्द ही ओपन ग्रुप वेबसाइट पर उपलब्ध होगा, जो शेल स्क्रिप्टिंग और अन्य कार्यात्मकताओं के लिए अद्यतन मानक प्रदान करेगा।",
      "POSIX.1-2024 में नई विशेषताओं में विस्तारित नियमित अभिव्यक्तियों के लिए sed -E, find -print0, xargs -0, सुरक्षित फ़ाइल प्रसंस्करण के लिए read -d, और C17, strlcpy, strlcat, और अधिक के लिए समर्थन शामिल हैं।",
      "यह अद्यतन विभिन्न प्रणालियों जैसे AIX, Debian, macOS, और विभिन्न Linux वितरणों में बेहतर संगतता के लिए POSIX-अनुपालन स्क्रिप्ट लिखने के महत्व पर जोर देता है।"
    ],
    "points": 123,
    "commentCount": 55,
    "retryCount": 0,
    "time": 1718365048
  },
  {
    "id": 40675577,
    "title": "लैमिनी मेमोरी ट्यूनिंग: 10 गुना कम भ्रांतियाँ परिणाम:",
    "originLink": "https://www.lamini.ai/blog/lamini-memory-tuning",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40675577",
    "commentBody": "",
    "originSummary": [
      "लैमिनी मेमोरी ट्यूनिंग एक नई विधि है जो बड़े भाषा मॉडल्स (LLMs) में तथ्यों को समाहित करती है, जिससे तथ्यात्मक सटीकता में महत्वपूर्ण सुधार होता है और भ्रमित करने वाली जानकारी को कम किया जाता है।",
      "इसने एक फॉर्च्यून 500 ग्राहक के लिए 95% सटीकता प्राप्त की, जबकि अन्य विधियों के साथ 50% थी, और भ्रम को 50% से घटाकर 5% कर दिया।",
      "इस विधि में किसी भी ओपन-सोर्स LLM के शीर्ष पर सटीक तथ्यों के साथ लाखों विशेषज्ञ एडेप्टर को ट्यून करना शामिल है, जो विशिष्ट तथ्यों पर शून्य त्रुटि के लिए अनुकूलित करते हुए सामान्य प्रदर्शन को बनाए रखता है।"
    ],
    "commentSummary": [
      "लामिनी मेमोरी ट्यूनिंग एक विधि है जो कई तथ्य-आधारित लो-रैंक अनुकूलन (LoRAs) को शून्य हानि तक प्रशिक्षित करती है और किसी क्वेरी के लिए उपयुक्त LoRAs का चयन करने के लिए पुनःप्राप्ति-संवर्धित पीढ़ी (RAG) का उपयोग करती है।",
      "इस विधि में एक विशेषज्ञ राउटर लेयर शामिल होती है जो यह निर्णय लेती है कि अनुमान समय पर किन LoRAs को एकीकृत करना है, लेकिन राउटर के लिए प्रशिक्षण प्रक्रिया स्पष्ट नहीं है।",
      "मॉडल मिश्रण विशेषज्ञों (MoE) और क्रॉस-अटेंशन की अवधारणाओं को मिलाता है, पूर्व-प्रशिक्षित बड़े भाषा मॉडल (LLM) के वज़न को स्थिर रखते हुए क्रॉस-अटेंशन लेयर पर प्रशिक्षण करता है ताकि तथ्यात्मक सटीकता सुनिश्चित की जा सके।"
    ],
    "points": 123,
    "commentCount": 49,
    "retryCount": 0,
    "time": 1718317780
  },
  {
    "id": 40675397,
    "title": "नोटबुक कोड की मैकडॉनल्ड्स हैं",
    "originLink": "https://yobibyte.github.io/notebooks.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40675397",
    "commentBody": "",
    "originSummary": [
      "नोटबुक्स राज्य और संस्करण नियंत्रण के साथ भ्रम पैदा कर सकते हैं, और परीक्षण या लिंटिंग न करने जैसी बुरी आदतों को बढ़ावा दे सकते हैं।",
      "उनके पास अक्सर अलग-अलग सेटअप और निर्भरताएँ होती हैं, जो कोड क्रैश और निराशा का कारण बन सकती हैं।",
      "नोटबुक विचारों का परीक्षण करने के लिए उपयोगी होती हैं, लेकिन कोड को मॉड्यूल में स्थानांतरित करना चुनौतीपूर्ण और समय-साध्य हो सकता है।"
    ],
    "commentSummary": [
      "नोटबुक मुख्य रूप से प्रयोग करने और परिणामों को रिकॉर्ड करने के लिए होती हैं, सॉफ्टवेयर विकास के लिए नहीं।",
      "जुपिटर नोटबुक्स कोर्स प्रोजेक्ट्स को दोहराने, इनलाइन प्लॉटिंग और कोड के टुकड़ों को कैश करने के लिए उपयोगी होते हैं, लेकिन बड़े कोडबेस के लिए यह अक्षम हो सकते हैं।",
      "नोटबुक्स त्वरित प्रयोग, शिक्षण, और दस्तावेज़ीकरण के लिए लाभकारी हैं, लेकिन रखरखाव और इंटरैक्टिविटी से संबंधित संभावित समस्याओं के कारण उत्पादन कोड के लिए आदर्श नहीं हैं।"
    ],
    "points": 120,
    "commentCount": 137,
    "retryCount": 0,
    "time": 1718316595
  }
]
