[
  {
    "id": 40676408,
    "title": "Налог на стоимость земли в онлайн-играх и виртуальных мирах (2022) РЕЗУЛЬТАТ:",
    "originLink": "https://progressandpoverty.substack.com/p/land-value-tax-in-online-games-and",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40676408",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Текст обсуждает плюсы и минусы внедрения налога на стоимость земли (LVT) в онлайн-играх и виртуальных мирах, предполагая, что это может снизить стоимость земли, но также принести пользу землевладельцам, если налог будет отменен.",
      "Это подчеркивает потенциал LVT для переноса налогов с земли на труд, предпринимательство и торговлю, предупреждая о сопротивлении со стороны богатых землевладельцев и трудностях в поддержании прогресса LVT.",
      "«Текст также затрагивает более широкие последствия LVT, включая его потенциал заменить все другие налоги, осуществимость такой системы и важность общественной осведомленности и сильной политики для поддержки ее внедрения.»"
    ],
    "points": 327,
    "commentCount": 321,
    "retryCount": 0,
    "time": 1718325381
  },
  {
    "id": 40673567,
    "title": "Соглашение между США и Саудовской Аравией о нефтедолларах завершилось после 50 лет",
    "originLink": "https://www.nasdaq.com/articles/us-saudi-petrodollar-pact-ends-after-50-years",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40673567",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Петродолларовый пакт между США и Саудовской Аравией завершился после 50 лет, но немедленных изменений в нефтяном бизнесе не ожидается.",
      "Конец пакта может привести к постепенному переходу к дедолларизации, но этот процесс займет время.",
      "США остаются крупнейшим производителем энергии в мире, что может повлиять на геополитический ландшафт и значимость петродоллара."
    ],
    "points": 281,
    "commentCount": 298,
    "retryCount": 0,
    "time": 1718306902
  },
  {
    "id": 40680218,
    "title": "Я нашел 55-летнюю ошибку в первой игре Lunar Lander",
    "originLink": "https://martincmartin.com/2024/06/14/how-i-found-a-55-year-old-bug-in-the-first-lunar-lander-game/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40680218",
    "commentBody": "",
    "originSummary": [
      "В 1969 году старшеклассник Джим Сторер создал первую игру о лунной посадке, в которой нужно было управлять лунным модулем и контролировать расход топлива каждые 10 симулированных секунд.",
      "Ошибка в игре, незамеченная в течение 55 лет, заключалась в отсутствии операции «разделить на два», что приводило к неправильному обнаружению посадки; исправление этого улучшает точность посадки.",
      "Игра использовала передовые численные методы для своего времени, такие как уравнение ракеты Циолковского и разложение в ряд Тейлора, что сделало её значительным достижением в раннем игровом дизайне."
    ],
    "commentSummary": [
      "В первой игре Lunar Lander, изначально написанной Джимом Сторером в старшей школе в 1960-х годах, был обнаружен 55-летний баг.",
      "Игра, написанная на языке программирования FOCAL, требовала впечатляющего понимания физики и численных методов, особенно для старшеклассника того времени.",
      "Это открытие подчеркивает историческую значимость и технические трудности ранних компьютерных игр, а также эволюцию практик программирования и обеспечения качества на протяжении десятилетий."
    ],
    "points": 238,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1718367846
  },
  {
    "id": 40676239,
    "title": "Грибок разлагает пластик в океане",
    "originLink": "https://www.nioz.nl/en/news/fungus-breaks-down-ocean-plastic",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40676239",
    "commentBody": "",
    "originSummary": [
      "Исследователи из NIOZ и других учреждений обнаружили, что морской гриб Parengyodontium album может разлагать полиэтиленовый пластик при воздействии ультрафиолетового солнечного света. РЕЗУЛЬТАТ:",
      "Гриб разлагает полиэтилен со скоростью около 0,05% в день, превращая его в углекислый газ, но только для пластика, плавающего у поверхности океана.",
      "Это открытие, опубликованное в журнале Science of the Total Environment, подчеркивает потенциал биологических решений для борьбы с загрязнением пластиком, особенно в условиях ожидаемого утроения производства пластика к 2060 году."
    ],
    "commentSummary": [
      "Грибок (Parengyodontium album) был изолирован и секвенирован за его способность разлагать океанический пластик, что вызывает опасения по поводу его экологического воздействия в случае его распространения.",
      "Обсуждаются потенциальные риски для здоровья, связанные с накоплением микропластиков и природных биополимеров в организме, с сравнением с вредными эффектами волокон асбеста.",
      "Разговор включает в себя предположительные идеи о повышении активности макрофагов для разрушения микропластика и использовании грибов, которые могут сосуществовать с человеческими клетками, хотя эти идеи требуют дальнейших исследований."
    ],
    "points": 224,
    "commentCount": 201,
    "retryCount": 0,
    "time": 1718323491
  },
  {
    "id": 40674135,
    "title": "Розничный продавец IKEA решил глобальный кризис 'несчастных работников', повысив зарплаты",
    "originLink": "https://fortune.com/europe/2024/06/11/ikeas-boss-solved-swedish-retailers-global-unhappy-worker-crisis-raising-salaries-introducing-flexible-working-subsidized-childcare/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40674135",
    "commentBody": "",
    "originSummary": [
      "Икеа решила проблему высокой текучести кадров, повысив заработную плату, предложив гибкие графики работы и субсидируя уход за детьми, что значительно снизило уровень добровольной текучести кадров по всему миру.",
      "Генеральный директор Джон Абрахамссон Ринг внедрил стратегии по улучшению условий для сотрудников на передовой и оптимизации операций с помощью технологий, что привело к снижению глобального уровня увольнений с 22,4% в августе 2022 года до 17,5% в апреле 2023 года.",
      "Несмотря на улучшения, Ikea продолжает сталкиваться с проблемами, включая поддержку психического здоровья, управление глобальной рабочей силой и обвинения в подавлении усилий профсоюзов, особенно в США."
    ],
    "commentSummary": [
      "ИКЕА решила глобальный кризис 'недовольных работников', повысив заработную плату, введя гибкий график работы и субсидируя уход за детьми, подчеркивая, что удовлетворенность работников включает в себя не только более высокую оплату труда.",
      "Обсуждение включает в себя плюсы и минусы корпоративных льгот по сравнению с прямой денежной компенсацией, при этом некоторые утверждают, что льготы могут быть более экономичными и способствовать улучшению рабочей атмосферы.",
      "Текст также затрагивает более широкие общественные последствия, такие как влияние семей с двумя доходами на цены на недвижимость и важность воспитания детей, предполагая, что профессиональный уход за детьми может принести пользу детям, родителям и обществу."
    ],
    "points": 222,
    "commentCount": 189,
    "retryCount": 0,
    "time": 1718309534
  },
  {
    "id": 40680737,
    "title": "Нвидиа Warp: Python-фреймворк для высокопроизводительного моделирования и графики на GPU",
    "originLink": "https://github.com/NVIDIA/warp",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40680737",
    "commentBody": "",
    "originSummary": [
      "Набор инструментов NVIDIA Warp — это фреймворк на языке Python, предназначенный для высокопроизводительного моделирования и графического кода, компилирующий функции Python в эффективный код ядра для CPU или GPU.",
      "Он поддерживает пространственные вычисления, моделирование физики, восприятие, робототехнику и обработку геометрии, а также интегрируется с конвейерами машинного обучения, используя PyTorch и JAX.",
      "Установка осуществляется через PyPI, с доступными дополнительными зависимостями, и требует наличия NVIDIA GPU с поддержкой CUDA для поддержки GPU. Фреймворк совместим с процессорами x86-64 и ARMv8 на Windows, Linux и macOS."
    ],
    "commentSummary": [
      "Новый фреймворк Nvidia Warp для Python предназначен для высокопроизводительного моделирования и графики на GPU, дополняя растущий список проектов по преобразованию кода с Python на GPU, таких как Taichi Lang и Numba.",
      "Обсуждение подчеркивает закрытый характер открытого программного обеспечения Nvidia, с опасениями по поводу ограничительной лицензии, которая запрещает использование программного обеспечения для разработки конкурирующих продуктов.",
      "Пользователи выражают смешанные впечатления от Taichi, отмечая его простоту в использовании и поддержку классов данных, но также упоминая о багах и проблемах с разработкой, что заставляет некоторых задуматься о переходе на Nvidia Warp."
    ],
    "points": 209,
    "commentCount": 53,
    "retryCount": 0,
    "time": 1718371736
  },
  {
    "id": 40680648,
    "title": "Начните презентации со второго слайда",
    "originLink": "https://tidyfirst.substack.com/p/start-presentations-on-the-second",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40680648",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Текст подчеркивает важность повествования в презентациях, предлагая, чтобы они вызывали размышления и вовлекали аудиторию с самого начала.",
      "Это подчеркивает разницу между устными презентациями и слайд-деками в крупных корпорациях, отмечая, что последние часто содержат много текста и являются самодостаточными для высшего руководства.",
      "Текст советует использовать повествовательную структуру в технических презентациях, начиная с проблемы, создавая напряжение, а затем предоставляя решение, чтобы сделать содержание более увлекательным и запоминающимся."
    ],
    "points": 183,
    "commentCount": 79,
    "retryCount": 0,
    "time": 1718371031
  },
  {
    "id": 40677810,
    "title": "Взгляд на технический подход Apple к ИИ, включая производительность основных моделей и т.д.",
    "originLink": "https://www.interconnects.ai/p/apple-intelligence",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40677810",
    "commentBody": "",
    "originSummary": [
      "Apple представила многомодельную систему искусственного интеллекта под названием Apple Intelligence, интегрируя ИИ в различные аспекты цифровой жизни для повышения вовлеченности пользователей.",
      "В отличие от конкурентов, сосредоточенных на превосходстве в области ИИ, Apple делает акцент на практических приложениях, планируя запустить новые функции ИИ на всех устройствах этой осенью.",
      "Стратегия Apple в области ИИ включает в себя производительность основных моделей, стратегию на устройстве и стратегии согласования, с моделями, сопоставимыми с GPT-4, и значительными функциями конфиденциальности."
    ],
    "commentSummary": [
      "Технический подход Apple к ИИ включает использование частного облачного вычисления для задач, требующих большей вычислительной мощности, при этом данные, отправляемые в облако, не хранятся и не доступны для Apple.",
      "Система включает частичное выполнение моделей на стороне клиента, основное выполнение модели в облаке и предсказывает использование Local LoRAs (низкоранговых адаптаций) для динамического машинного обучения и WebGPU для разблокировки моделей на веб-основе.",
      "Обсуждение подчеркивает силу вертикальной интеграции Apple, потенциальное долгосрочное преимущество в гонке устройств с ИИ, а также влияние ИИ на продажи iPhone, в отличие от рыночной позиции Nvidia и стратегии продаж оборудования."
    ],
    "points": 179,
    "commentCount": 87,
    "retryCount": 0,
    "time": 1718343407
  },
  {
    "id": 40674073,
    "title": "Отобрав iPhone, дочь стала лучше",
    "originLink": "https://www.theguardian.com/technology/article/2024/jun/13/kids-no-iphone-screen-time",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40674073",
    "commentBody": "",
    "originSummary": [
      "Автор запретил своей дочери пользоваться iPhone из-за его негативного влияния на её психическое здоровье, успеваемость и поведение.",
      "У дочери диагностировали депрессию и тревожность, значительная часть её внимания была сосредоточена на социальных сетях и получении одобрения сверстников.",
      "Автор подчеркивает более широкую проблему зависимости от телефонов среди детей и необходимость как индивидуальных, так и системных изменений для эффективного управления использованием телефонов."
    ],
    "commentSummary": [
      "Статья обсуждает вредные последствия зависимости от социальных сетей и телефонов, предполагая, что они используются как избегающее поведение для ухода от трудных мыслей и эмоций.",
      "В нем утверждается, что решение заключается не в том, чтобы убрать эти механизмы совладания, а в том, чтобы помочь людям улучшить их психическое здоровье.",
      "Текст также затрагивает влияние локдаунов из-за COVID, переход на Linux из-за опасений по поводу конфиденциальности и потенциальные преимущества социальных сетей, основанных на сообществе."
    ],
    "points": 170,
    "commentCount": 193,
    "retryCount": 0,
    "time": 1718309242
  },
  {
    "id": 40677926,
    "title": "40 из 60 немецких экологических инициатив оказались мошенническими",
    "originLink": "https://www.fr.de/politik/warnungen-milliarden-an-konzerne-gezahlt-betrugsverdacht-beim-klimaschutz-trotz-zr-93122965.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40677926",
    "commentBody": "",
    "originSummary": [
      "Министерство окружающей среды Германии обвиняется в небрежной поддержке китайских проектов по защите климата, используя миллионы средств из квоты THG.",
      "С августа 2023 года против 40 из 60 проектов по защите климата в Китае выдвинуты серьезные обвинения в мошенничестве, что приведет к прекращению финансирования к концу 2024 года.",
      "Правительство Германии вместе с Францией и Нидерландами призывает Комиссию ЕС решить проблемы в системе бонусов THG, которая влияет на стимулы для владельцев электромобилей и не имеет надежных механизмов контроля."
    ],
    "commentSummary": [
      "Мошенничество было обнаружено в 40 из 60 немецких проектов по озеленению климата в Китае, при этом китайская компания сообщила об измененных документах, что указывает на возможное мошенничество со стороны многонациональных нефтяных компаний.",
      "Немецкие власти приняли непроверяемые заявления об экономии CO2 из-за ограничений Китая на иностранные проверки, несмотря на предупреждения китайских дочерних компаний о мошенничестве.",
      "Текст критикует текущую систему углеродных кредитов за её лёгкую эксплуатацию и предлагает взимать плату за фактические выбросы, признавая при этом необходимость постепенного перехода, чтобы избежать экономических потрясений."
    ],
    "points": 159,
    "commentCount": 114,
    "retryCount": 0,
    "time": 1718344757
  },
  {
    "id": 40683210,
    "title": "Функция Recall AI от Microsoft теперь отложена на неопределенный срок",
    "originLink": "https://blogs.windows.com/windowsexperience/2024/06/07/update-on-the-recall-preview-feature-for-copilot-pcs/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40683210",
    "commentBody": "",
    "originSummary": [
      "7 июня 2024 года было объявлено об обновлении функции предварительного просмотра Recall на ПК с Copilot+, которое перенесло её доступность на программу Windows Insider (WIP), начиная с 18 июня 2024 года, на основе отзывов сообщества для обеспечения качества и безопасности.",
      "Recall создает визуальную временную шкалу активности ПК, делая зашифрованные снимки, которые хранятся локально и могут контролироваться, приостанавливаться или удаляться пользователями; для доступа требуется улучшенная система входа в Windows Hello.",
      "ПК Copilot+, выпущенные 20 мая 2024 года, представляют собой усовершенствованные компьютеры на базе Windows с улучшенной производительностью и возможностями ИИ, оснащенные усиленными мерами безопасности, такими как процессор безопасности Microsoft Pluton и технология Secured-core PC."
    ],
    "commentSummary": [
      "Функция Recall AI от Microsoft отложена на неопределенный срок из-за неуказанных проблем с безопасностью, что вызвало спекуляции о стратегических мотивах и возможном злоупотреблении для слежки.",
      "Выражаются опасения по поводу того, что Recall AI может записывать и утекать конфиденциальную информацию, такую как банковские реквизиты и личные действия, что приводит к проблемам с конфиденциальностью.",
      "Задержка и опасения перекликаются с прошлыми критическими замечаниями в адрес анти-потребительских практик Microsoft, с сравнениями с негативной реакцией, возникшей во время запуска Xbox One, и недавним обновлением EULA от Adobe."
    ],
    "points": 137,
    "commentCount": 49,
    "retryCount": 0,
    "time": 1718388189
  },
  {
    "id": 40681784,
    "title": "Стоимость самостоятельного хостинга Llama-3 8B-Instruct РЕЗУЛЬТАТ:",
    "originLink": "https://blog.lytix.co/posts/self-hosting-llama-3",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40681784",
    "commentBody": "",
    "originSummary": [
      "Самостоятельный хостинг модели Llama-3 8B-Instruct значительно дороже, чем использование ChatGPT, и стоит около $17 за 1 миллион токенов по сравнению с $1 за 1 миллион токенов у ChatGPT.",
      "Первоначально высокая стоимость самостоятельного хостинга включает в себя расходы на оборудование и затраты на энергию, что делает его менее экономичным, несмотря на потенциальные долгосрочные сбережения.",
      "Управление и масштабирование собственного оборудования создает дополнительные трудности и предполагает нереалистичное 100% использование, что делает его менее практичным для большинства пользователей."
    ],
    "commentSummary": [
      "Самостоятельное размещение оборудования может значительно снизить затраты по сравнению с использованием AWS, при этом установка с 4 NVidia Tesla T4 обойдется примерно в $3,800.",
      "Текст обсуждает плюсы и минусы самостоятельного хостинга, подчеркивая необходимость бизнес-обоснования для его оправдания из-за возможного простоя и затрат на обслуживание.",
      "Groq предлагает экономически эффективные цены на модели Llama 3, и текст предлагает использовать квантованные модели и альтернативные сервисы, такие как together.ai, для повышения эффективности."
    ],
    "points": 132,
    "commentCount": 94,
    "retryCount": 0,
    "time": 1718379058
  },
  {
    "id": 40679809,
    "title": "Опубликован POSIX.1-2024",
    "originLink": "https://ieeexplore.ieee.org/document/10555529",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40679809",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "POSIX.1-2024 был опубликован и скоро будет доступен на сайте Open Group, предоставляя обновленные стандарты для написания сценариев оболочки и других функций.",
      "Новые функции в POSIX.1-2024 включают sed -E для расширенных регулярных выражений, find -print0, xargs -0, read -d для безопасной обработки файлов, а также поддержку C17, strlcpy, strlcat и других.",
      "Обновление подчеркивает важность написания скриптов, соответствующих стандарту POSIX, для лучшей совместимости между различными системами, такими как AIX, Debian, macOS и различные дистрибутивы Linux."
    ],
    "points": 123,
    "commentCount": 55,
    "retryCount": 0,
    "time": 1718365048
  },
  {
    "id": 40675577,
    "title": "Настройка памяти Lamini: в 10 раз меньше галлюцинаций",
    "originLink": "https://www.lamini.ai/blog/lamini-memory-tuning",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40675577",
    "commentBody": "",
    "originSummary": [
      "Настройка памяти Lamini — это новый метод встраивания фактов в большие языковые модели (LLMs), значительно улучшающий фактическую точность и уменьшающий количество галлюцинаций.",
      "Он достиг 95% точности для клиента из списка Fortune 500 по сравнению с 50% другими методами и сократил количество галлюцинаций с 50% до 5%.",
      "Метод включает настройку миллионов экспертных адаптеров с точными фактами поверх любого открытого LLM, оптимизируя для нулевой ошибки на конкретных фактах при сохранении общей производительности."
    ],
    "commentSummary": [
      "Настройка памяти Lamini — это метод, который обучает множество основанных на фактах адаптаций низкого ранга (LoRAs) до нулевых потерь и использует генерацию с дополнением поиска (RAG) для выбора подходящих LoRAs для запроса.",
      "Метод включает в себя слой маршрутизатора-эксперта для принятия решения о том, какие LoRA интегрировать во время вывода, но процесс обучения для маршрутизатора неясен.",
      "Модель сочетает в себе концепции смеси экспертов (MoE) и перекрестного внимания, сохраняя постоянными веса предварительно обученной большой языковой модели (LLM), при этом обучая слой перекрестного внимания для обеспечения фактической точности."
    ],
    "points": 123,
    "commentCount": 49,
    "retryCount": 0,
    "time": 1718317780
  },
  {
    "id": 40675397,
    "title": "Ноутбуки — это Макдональдс в мире кода",
    "originLink": "https://yobibyte.github.io/notebooks.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40675397",
    "commentBody": "",
    "originSummary": [
      "Ноутбуки могут привести к путанице с состоянием и версионированием, а также способствовать плохим привычкам, таким как отсутствие тестирования или проверки кода.",
      "У них часто разные настройки и зависимости, что может вызвать сбои в коде и разочарование.",
      "Блокноты полезны для тестирования идей, но перенос кода в модули может быть сложным и отнимающим много времени."
    ],
    "commentSummary": [
      "Блокноты предназначены в первую очередь для проведения экспериментов и записи результатов, а не для разработки программного обеспечения.",
      "Jupyter ноутбуки полезны для воспроизведения учебных проектов, встроенного построения графиков и кэширования фрагментов кода, но могут быть неэффективны для больших кодовых баз.",
      "Ноутбуки полезны для быстрого эксперимента, обучения и документации, но не идеальны для производственного кода из-за возможных проблем с поддерживаемостью и интерактивностью."
    ],
    "points": 120,
    "commentCount": 137,
    "retryCount": 0,
    "time": 1718316595
  }
]
