[
  {
    "id": 40676408,
    "title": "ஆன்லைன் விளையாட்டுகள் மற்றும் மெய்நிகர் உலகங்களில் நில மதிப்பு வரி (2022)",
    "originLink": "https://progressandpoverty.substack.com/p/land-value-tax-in-online-games-and",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40676408",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "உரையில், நில மதிப்பு வரியை (LVT) ஆன்லைன் விளையாட்டுகள் மற்றும் மெய்நிகர் உலகங்களில் செயல்படுத்துவதன் நன்மைகள் மற்றும் தீமைகள் குறித்து விவாதிக்கப்படுகிறது, இது நில மதிப்புகளை குறைக்கக்கூடும் ஆனால் நீக்கப்பட்டால் நில உரிமையாளர்களுக்கு நன்மை தரக்கூடும் என்று பரிந்துரைக்கிறது.",
      "இது நிலத்திலிருந்து தொழிலாளர், தொழில், மற்றும் வாணிபத்திற்கு வரிகளை மாற்றுவதற்கான LVT இன் சாத்தியத்தை வெளிப்படுத்துகிறது, அதேசமயம் செல்வந்த நில உரிமையாளர்களிடமிருந்து எதிர்ப்பை எச்சரிக்கிறது மற்றும் LVT முன்னேற்றத்தை பராமரிப்பதில் உள்ள சிரமத்தை குறிப்பிடுகிறது.",
      "உரை LVT இன் பரந்த விளைவுகளை, அதில் அனைத்து பிற வரிகளையும் மாற்றும் சாத்தியக்கூறுகளை, அத்தகைய ஒரு அமைப்பின் செயல்திறனை, மற்றும் அதன் செயல்பாட்டை ஆதரிக்க பொதுமக்கள் விழிப்புணர்வு மற்றும் வலுவான கொள்கைகளின் முக்கியத்துவத்தை பற்றியும் குறிப்பிடுகிறது."
    ],
    "points": 327,
    "commentCount": 321,
    "retryCount": 0,
    "time": 1718325381
  },
  {
    "id": 40673567,
    "title": "அமெரிக்கா-சவுதி பெட்ரோடாலர் ஒப்பந்தம் 50 ஆண்டுகளுக்குப் பிறகு முடிவுக்கு வந்தது",
    "originLink": "https://www.nasdaq.com/articles/us-saudi-petrodollar-pact-ends-after-50-years",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40673567",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "",
      "ஒப்பந்தத்தின் முடிவு டாலரற்ற நிலைக்கு تدريجيயான மாற்றத்தை ஏற்படுத்தக்கூடும், ஆனால் இந்த செயல்முறை நேரம் எடுக்கும்.",
      "அமெரிக்கா உலகின் மிகப்பெரிய ஆற்றல் உற்பத்தியாளராகவே உள்ளது, இது புவிசார் அரசியல் நிலப்பரப்பையும் பெட்ரோடாலரின் முக்கியத்துவத்தையும் பாதிக்கக்கூடும்."
    ],
    "points": 281,
    "commentCount": 298,
    "retryCount": 0,
    "time": 1718306902
  },
  {
    "id": 40680218,
    "title": "நான் முதல் லூனார் லாண்டர் விளையாட்டில் 55 வருட பழைய பிழையை கண்டுபிடித்தேன்",
    "originLink": "https://martincmartin.com/2024/06/14/how-i-found-a-55-year-old-bug-in-the-first-lunar-lander-game/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40680218",
    "commentBody": "",
    "originSummary": [
      "1969 ஆம் ஆண்டில், உயர்நிலைப் பள்ளி மாணவர் ஜிம் ஸ்டோரர் முதல் லூனார் லாண்டிங் விளையாட்டை உருவாக்கினார், இது ஒரு நிலா லாண்டரை இயக்கி, ஒவ்வொரு 10 நகலாக்கப்பட்ட விநாடிகளுக்கும் எரிபொருள் எரிப்பை நிர்வகிப்பதை உள்ளடக்கியது.",
      "55 ஆண்டுகளாக கவனிக்கப்படாத ஒரு பிழை, 'இரண்டால் வகுக்க' என்பதன் குறைவால் தவறான தரையிறங்கல் கண்டறிதலை ஏற்படுத்தியது; இதை சரிசெய்வது தரையிறங்கல் துல்லியத்தை மேம்படுத்துகிறது.",
      ""
    ],
    "commentSummary": [
      "55 வயது பழமையான பிழை முதன்முதலில் ஜிம் ஸ்டோரர் உயர்நிலைப் பள்ளியில் 1960களில் எழுதிய லூனார் லாண்டர் விளையாட்டில் கண்டுபிடிக்கப்பட்டது.",
      "அந்த விளையாட்டு, FOCAL நிரலாக்க மொழியில் எழுதப்பட்டது, அக்காலத்தில் ஒரு உயர்நிலைப் பள்ளி மாணவனுக்கு மிகவும் பிரம்மிக்க வைக்கும் அளவுக்கு இயற்பியல் மற்றும் எண் நுட்பங்களைப் பற்றிய புரிதலைத் தேவைப்படுத்தியது.",
      "இந்த கண்டுபிடிப்பு, ஆரம்ப கால கணினி விளையாட்டுகளின் வரலாற்று முக்கியத்துவத்தையும், தொழில்நுட்ப சவால்களையும், கடந்த பல தசாப்தங்களில் குறியீட்டு நடைமுறைகள் மற்றும் தர உறுதிப்பாட்டு முறைகளின் பரிணாமத்தையும் வெளிப்படுத்துகிறது."
    ],
    "points": 238,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1718367846
  },
  {
    "id": 40676239,
    "title": "பூஞ்சை கடல் பிளாஸ்டிக்கைக் களைவதைக் குறைக்கிறது",
    "originLink": "https://www.nioz.nl/en/news/fungus-breaks-down-ocean-plastic",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40676239",
    "commentBody": "",
    "originSummary": [
      "நியோஸ் மற்றும் பிற நிறுவனங்களின் ஆராய்ச்சியாளர்கள், பரெங்கியோடோன்டியம் ஆல்பம் என்ற கடல் பூஞ்சை UV சூரிய ஒளிக்கு வெளிப்படுத்தப்பட்ட போது பாலிஎதிலீன் பிளாஸ்டிக்கைக் களைவதாக கண்டுபிடித்துள்ளனர்.",
      "பூஞ்சை தினமும் சுமார் 0.05% அளவிற்கு பாலிஎதிலினை சிதைத்து, அதை கார்பன் டையாக்சைடாக மாற்றுகிறது, ஆனால் இது கடலின் மேற்பரப்பில் மிதக்கும் பிளாஸ்டிக்கிற்கே மட்டுமே பொருந்தும்.",
      "இந்த கண்டுபிடிப்பு, சயன்ஸ் ஆஃப் த டோட்டல் என்விரான்மென்ட் என்ற இதழில் வெளியிடப்பட்டது, பிளாஸ்டிக் மாசுபாட்டை தீர்க்க உயிரியல் தீர்வுகளின் சாத்தியத்தை குறிப்பிடுகிறது, குறிப்பாக 2060 ஆம் ஆண்டுக்குள் பிளாஸ்டிக் உற்பத்தி மும்மடங்காக அதிகரிக்கும் என எதிர்பார்க்கப்படுகிறது."
    ],
    "commentSummary": [
      "ஒரு பூஞ்சை (Parengyodontium album) கடல் பிளாஸ்டிக்கைக் களைவதற்கான திறனுக்காக தனிமைப்படுத்தப்பட்டு வரிசைப்படுத்தப்பட்டுள்ளது, இது பரவினால் அதன் சுற்றுச்சூழல் தாக்கம் குறித்து கவலைகளை எழுப்புகிறது.",
      "உடலில் மைக்ரோபிளாஸ்டிக்கள் மற்றும் இயற்கை உயிரணு பாளிமர்கள் சேருவதால் ஏற்படும் சுகாதார ஆபத்துகள், அஸ்பெஸ்டாஸ் நார்களின் தீமைகளுடன் ஒப்பிடப்பட்டு விவாதிக்கப்படுகின்றன.",
      "இந்த உரையாடல், மைக்ரோபிளாஸ்டிக்ஸ்களை உடைக்க மேக்ரோஃபேஜ்களை மேம்படுத்துவது மற்றும் மனித செல்களுடன் இணைந்து வாழக்கூடிய பூஞ்சைகளைப் பயன்படுத்துவது போன்ற யூகத்திற்குரிய கருத்துக்களை உள்ளடக்கியது, ஆனால் இவை மேலும் ஆராய்ச்சியைத் தேவைப்படுத்துகின்றன."
    ],
    "points": 224,
    "commentCount": 201,
    "retryCount": 0,
    "time": 1718323491
  },
  {
    "id": 40674135,
    "title": "ஐகியா விற்பனையாளர் உலகளாவிய 'மகிழ்ச்சியற்ற தொழிலாளி' பிரச்சினையை சம்பளத்தை உயர்த்துவதன் மூலம் தீர்த்தார்",
    "originLink": "https://fortune.com/europe/2024/06/11/ikeas-boss-solved-swedish-retailers-global-unhappy-worker-crisis-raising-salaries-introducing-flexible-working-subsidized-childcare/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40674135",
    "commentBody": "",
    "originSummary": [
      "Ikea உயர் ஊழியர் திருப்பத்தை எதிர்கொண்டு, ஊதியங்களை உயர்த்தி, நெகிழ்வான வேலை நேரங்களை வழங்கி, குழந்தை பராமரிப்புக்கு மானியங்களை வழங்கி, உலகளாவிய அளவில் தன்னார்வ திருப்ப விகிதங்களை குறிப்பிடத்தக்க அளவில் குறைத்தது.",
      "CEO ஜான் ஆப்ரஹாம்சன் ரிங் முன்னணி ஊழியர்களின் நிலைகளை மேம்படுத்தவும், தொழில்நுட்பத்துடன் செயல்பாடுகளை எளிமைப்படுத்தவும் உத்தியோகபூர்வமாக செயல்திட்டங்களை செயல்படுத்தினார், இதனால் உலகளாவிய விலகல் விகிதம் ஆகஸ்ட் 2022 இல் 22.4% இருந்து ஏப்ரல் 2023 இல் 17.5% ஆக குறைந்தது.\" \"முடிவு:",
      "மேற்கோள்: மேம்பாடுகள் இருந்தபோதிலும், Ikea மனநலம் ஆதரவு, உலகளாவிய பணியாளர்களை மேலாண்மை, மற்றும் தொழிற்சங்க முயற்சிகளை ஒடுக்குவதற்கான குற்றச்சாட்டுகள், குறிப்பாக அமெரிக்காவில், உள்ளிட்ட சவால்களை தொடர்ந்து எதிர்கொள்கிறது. மூலமேற்கோள்:"
    ],
    "commentSummary": [
      "",
      "இந்த விவாதத்தில் நிறுவன நலன்கள் மற்றும் நேரடி பணஊதியம் ஆகியவற்றின் நன்மைகள் மற்றும் தீமைகள் அடங்கும், சிலர் நலன்கள் செலவினத்தில் சிக்கனமாகவும், சிறந்த வேலை சூழலை உருவாக்கவும் உதவுகின்றன என்று வாதிக்கின்றனர்.",
      "உரையும் பரந்த சமூக விளைவுகளைப் பற்றியும் பேசுகிறது, உதாரணமாக இரட்டை வருமானக் குடும்பங்கள் நிலுவை விலைகளில் ஏற்படுத்தும் தாக்கம் மற்றும் குழந்தை வளர்ப்பின் முக்கியத்துவம் போன்றவை, தொழில்முறை குழந்தை பராமரிப்பு குழந்தைகள், பெற்றோர் மற்றும் சமுதாயத்திற்கு பயனுள்ளதாக இருக்க முடியும் என்று பரிந்துரைக்கிறது."
    ],
    "points": 222,
    "commentCount": 189,
    "retryCount": 0,
    "time": 1718309534
  },
  {
    "id": 40680737,
    "title": "என்விடியா வார்ப்: உயர் செயல்திறன் GPU சிமுலேஷன் மற்றும் கிராபிக்ஸ் க்கான ஒரு பைதான் கட்டமைப்பு",
    "originLink": "https://github.com/NVIDIA/warp",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40680737",
    "commentBody": "",
    "originSummary": [
      "என்விடியா வார்ப் என்பது உயர் செயல்திறன் கொண்ட சிமுலேஷன் மற்றும் கிராபிக்ஸ் குறியீட்டு Python கட்டமைப்பாகும், இது Python செயல்பாடுகளை CPU அல்லது GPU க்கான திறமையான கர்னல் குறியீட்டாக தொகுக்கிறது.",
      "",
      "நிறுவல் PyPI மூலம் செய்யப்படுகிறது, கூடுதல் சார்புகளைப் பெறலாம், மேலும் GPU ஆதரவிற்காக CUDA திறன் கொண்ட NVIDIA GPU தேவைப்படுகிறது. இந்த கட்டமைப்பு Windows, Linux, மற்றும் macOS இல் x86-64 மற்றும் ARMv8 CPU களுடன் இணக்கமாக உள்ளது."
    ],
    "commentSummary": [
      "Nvidia Warp என்பது உயர் செயல்திறன் கொண்ட GPU சிமுலேஷன் மற்றும் கிராபிக்ஸ் க்காக வடிவமைக்கப்பட்ட புதிய Python கட்டமைப்பாகும், இது Taichi Lang மற்றும் Numba போன்ற Python-இல் இருந்து GPU குறியீட்டு திட்டங்களின் வளர்ந்து வரும் பட்டியலில் சேர்க்கப்படுகிறது.",
      "இந்த விவாதம் Nvidia இன் திறந்த மூல மென்பொருளின் சொந்த உரிமை தன்மையை முக்கியமாகக் குறிப்பிடுகிறது, போட்டி தயாரிப்புகளை உருவாக்க இந்த மென்பொருளைப் பயன்படுத்துவதைத் தடைசெய்யும் கட்டுப்படுத்தப்பட்ட உரிமம் பற்றிய கவலைகளுடன்.",
      "பயனர்கள் Taichi பற்றிய கலவையான அனுபவங்களை வெளிப்படுத்துகின்றனர், அதன் பயன்படுத்தும் எளிமை மற்றும் தரவுக் வகுப்புகளுக்கான ஆதரவை குறிப்பிடுகின்றனர், ஆனால் பிழைகள் மற்றும் மேம்பாட்டு சிக்கல்களையும் குறிப்பிடுகின்றனர், இதனால் சிலர் Nvidia Warp க்கு மாறுவதைக் கருதுகின்றனர்."
    ],
    "points": 209,
    "commentCount": 53,
    "retryCount": 0,
    "time": 1718371736
  },
  {
    "id": 40680648,
    "title": "மூன்றாம் சுருக்கம்: இரண்டாவது ஸ்லைடில் பிரசந்தனைகளை தொடங்குங்கள்",
    "originLink": "https://tidyfirst.substack.com/p/start-presentations-on-the-second",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40680648",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "உரை உரையாடல்களில் கதை சொல்லும் முக்கியத்துவத்தை வலியுறுத்துகிறது, அவை சிந்தனையைத் தூண்டி, தொடக்கத்திலிருந்தே பார்வையாளர்களை ஈர்க்க வேண்டும் என்று பரிந்துரைக்கிறது.",
      "இது பெரிய நிறுவனங்களில் வாய்மொழி விளக்கங்களுக்கும் ஸ்லைடு டெக்குகளுக்கும் இடையிலான வித்தியாசத்தை வெளிப்படுத்துகிறது, இதில் பின்வருவன அதிகமாக உரை அடிப்படையிலானவை மற்றும் மூத்த மேலாண்மைக்கு தானாகவே விளக்கமானவை.",
      "உரையாடல் அமைப்பை தொழில்நுட்ப விளக்கங்களில் பயன்படுத்துவதற்கு உரை பரிந்துரைக்கிறது, ஒரு பிரச்சினையுடன் தொடங்கி, பதட்டத்தை உருவாக்கி, பின்னர் ஒரு தீர்வை வழங்குவதன் மூலம் உள்ளடக்கத்தை மேலும் ஈர்க்கக்கூடியதாகவும் நினைவில் நிற்கக்கூடியதாகவும் மாற்றுகிறது."
    ],
    "points": 183,
    "commentCount": 79,
    "retryCount": 0,
    "time": 1718371031
  },
  {
    "id": 40677810,
    "title": "ஆப்பிளின் தொழில்நுட்ப அணுகுமுறையை AI உடன் தொடர்புடைய முக்கிய மாதிரி செயல்திறன் உள்ளிட்டவை பற்றிய ஒரு பார்வை.",
    "originLink": "https://www.interconnects.ai/p/apple-intelligence",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40677810",
    "commentBody": "",
    "originSummary": [
      "ஆப்பிள் பல்வேறு மாடல்களைக் கொண்ட செயற்கை நுண்ணறிவு அமைப்பான ஆப்பிள் இன்டெலிஜென்ஸை அறிமுகப்படுத்தியுள்ளது, இது பயனர் ஈடுபாட்டை மேம்படுத்துவதற்காக டிஜிட்டல் வாழ்க்கையின் பல்வேறு அம்சங்களில் செயற்கை நுண்ணறிவை ஒருங்கிணைக்கிறது.",
      "போட்டியாளர்கள் AI மேம்பாட்டில் கவனம் செலுத்துவதற்கு மாறாக, Apple நடைமுறை பயன்பாடுகளை முக்கியமாகக் கருதுகிறது, இந்த ஆண்டு குளிர்காலத்தில் அனைத்து சாதனங்களிலும் புதிய AI அம்சங்களை அறிமுகப்படுத்த திட்டமிட்டுள்ளது.",
      "ஆப்பிளின் செயற்கை நுண்ணறிவு (AI) உத்தியோகம் மைய மாதிரி செயல்திறன், சாதனத்தில் உள்ள உத்தியோகம், மற்றும் ஒத்திசைவு உத்தியோகங்களை உள்ளடக்கியது, GPT-4 உடன் ஒப்பிடக்கூடிய மாதிரிகள் மற்றும் முக்கியமான தனியுரிமை அம்சங்களுடன்."
    ],
    "commentSummary": [
      "ஆப்பிளின் செயற்கை நுண்ணறிவு தொழில்நுட்ப அணுகுமுறை, அதிக கணினி திறனை தேவையாக்கும் பணிகளுக்காக தனியார் மேக கணினியைப் பயன்படுத்துவதை உள்ளடக்கியது, மேகத்திற்கு அனுப்பப்படும் தரவுகள் ஆப்பிளால் சேமிக்கப்படவோ அணுகப்படவோ செய்யப்படாது என்பதை உறுதிப்படுத்துகிறது.",
      "",
      "இந்த விவாதம் ஆப்பிளின் செங்குத்து ஒருங்கிணைப்பு வலிமையை, நீண்டகால முன் நிலை சாதன AI போட்டியை, மற்றும் iPhone விற்பனை மீது AI இன் தாக்கத்தை, Nvidia இன் சந்தை நிலை மற்றும் வன்பொருள் விற்பனை உத்தியுடன் மாறுபடுகிறது."
    ],
    "points": 179,
    "commentCount": 87,
    "retryCount": 0,
    "time": 1718343407
  },
  {
    "id": 40674073,
    "title": "iPhone ஐப் பறித்ததால் மகள் நல்ல மனிதராக மாறினாள்",
    "originLink": "https://www.theguardian.com/technology/article/2024/jun/13/kids-no-iphone-screen-time",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40674073",
    "commentBody": "",
    "originSummary": [
      "ஆசிரியர் தனது மகளின் மனநலன், கல்வி செயல்திறன் மற்றும் நடத்தை மீது அதன் எதிர்மறை தாக்கம் காரணமாக, அவளது ஐபோனைப் பயன்படுத்துவதற்கு தடை விதித்தார்.",
      "மகள் மனச்சோர்வு மற்றும் பதட்டம் ஆகியவற்றால் பாதிக்கப்பட்டார், மேலும் சமூக ஊடகங்கள் மற்றும் சமவயதினரின் ஒப்புதலைப் பெறுவதில் அவரது கவனம் பெரிதும் இருந்தது.",
      "ஆசிரியர் குழந்தைகளில் தொலைபேசி அடிமைத்தனத்தின் பரந்த பிரச்சினையை மற்றும் தொலைபேசி பயன்பாட்டை திறம்படக் கட்டுப்படுத்த தனிநபர் மற்றும் அமைப்புசார்ந்த மாற்றங்களின் தேவையை முக்கியமாகக் குறிப்பிடுகிறார்."
    ],
    "commentSummary": [
      "கட்டுரை சமூக ஊடகம் மற்றும் தொலைபேசி அடிமைத்தனத்தின் தீங்கான விளைவுகளைப் பற்றி விவாதிக்கிறது, இவை கடினமான சிந்தனைகள் மற்றும் உணர்வுகளைத் தவிர்க்கும் நடத்தைகளாக பயன்படுத்தப்படுகின்றன என்று பரிந்துரைக்கிறது.",
      "தீர்வு இந்த சமாளிக்கும் முறைகளை நீக்குவது அல்ல, மாறாக, தனிநபர்கள் தங்கள் மனநலத்தை மேம்படுத்த உதவ வேண்டும் என்று வாதிக்கிறது.",
      "உரை COVID பூட்டுதல்களின் தாக்கம், தனியுரிமை கவலைகளால் லினக்ஸுக்கு மாறுதல், மற்றும் சமூக அடிப்படையிலான சமூக ஊடக நெட்வொர்க்குகளின் சாத்தியமான நன்மைகள் பற்றியும் பேசுகிறது."
    ],
    "points": 170,
    "commentCount": 193,
    "retryCount": 0,
    "time": 1718309242
  },
  {
    "id": 40677926,
    "title": "60 ஜெர்மன் காலநிலை பசுமை முயற்சிகளில் 40 மோசடி",
    "originLink": "https://www.fr.de/politik/warnungen-milliarden-an-konzerne-gezahlt-betrugsverdacht-beim-klimaschutz-trotz-zr-93122965.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40677926",
    "commentBody": "",
    "originSummary": [
      "",
      "2023 ஆகஸ்ட் மாதம் முதல் சீனாவில் உள்ள 60 காலநிலை பாதுகாப்பு திட்டங்களில் 40 திட்டங்களுக்கு எதிராக முக்கியமான மோசடி குற்றச்சாட்டுகள் எழுந்துள்ளன, இதனால் 2024 இறுதிக்குள் நிதியுதவி நிறுத்தப்பட்டுள்ளது.",
      "ஜெர்மன் அரசு, பிரான்ஸ் மற்றும் நெதர்லாந்து உடன், மின்சார வாகன உரிமையாளர்களின் ஊக்கங்களை பாதிக்கும் மற்றும் வலுவான கட்டுப்பாட்டு முறைமைகள் இல்லாத THG போனஸ் அமைப்பில் உள்ள பிரச்சினைகளை தீர்க்க ஐரோப்பிய யூனியன் கமிஷனை வலியுறுத்துகிறது."
    ],
    "commentSummary": [
      "\"Fraud was detected in 40 out of 60 German climate greening projects in China, with altered documents reported by a Chinese company, suggesting potential fraud by multinational oil companies.\" முடிவு:",
      "ஜெர்மன் அதிகாரிகள் சீனாவின் வெளிநாட்டு சோதனைகளுக்கான கட்டுப்பாடுகள் காரணமாக CO2 சேமிப்புகளின் சரிபார்க்க முடியாத கோரிக்கைகளை ஏற்றுக்கொண்டனர், சீன துணை நிறுவனங்களின் மோசடி குறித்து எச்சரிக்கைகள் இருந்தபோதிலும்.",
      "நடப்பு கார்பன் கிரெடிட் அமைப்பை எளிதில் சுரண்டக்கூடியதாக விமர்சிக்கிறது மற்றும் பொருளாதார சீர்குலைவுகளைத் தவிர்க்க постепமாக மாற்றம் தேவை என்பதை ஒப்புக்கொண்டு, உண்மையான உமிழ்வுகளுக்காக பில்லிங் செய்ய பரிந்துரைக்கிறது."
    ],
    "points": 159,
    "commentCount": 114,
    "retryCount": 0,
    "time": 1718344757
  },
  {
    "id": 40683210,
    "title": "Microsoft இன் Recall AI அம்சம் இப்போது காலவரையற்ற தாமதமாகியுள்ளது",
    "originLink": "https://blogs.windows.com/windowsexperience/2024/06/07/update-on-the-recall-preview-feature-for-copilot-pcs/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40683210",
    "commentBody": "",
    "originSummary": [
      "2024 ஜூன் 7 அன்று, Copilot+ கணினிகளில் Recall முன்னோட்ட அம்சத்திற்கு ஒரு புதுப்பிப்பு அறிவிக்கப்பட்டது, 2024 ஜூன் 18 முதல் Windows Insider Program (WIP) இல் அதன் கிடைக்கும் தன்மையை மாற்றியது, தரம் மற்றும் பாதுகாப்பை உறுதிப்படுத்த சமூக கருத்துக்களை அடிப்படையாகக் கொண்டு.",
      "மீள்பதிவு, குறியாக்கம் செய்யப்பட்ட நிழற்படங்களை எடுத்து, அவற்றை உள்ளூராக சேமித்து, பயனர்களால் கட்டுப்படுத்தப்படக்கூடிய, இடைநிறுத்தக்கூடிய அல்லது நீக்கக்கூடிய காட்சிப்பட வரலாற்றை உருவாக்குகிறது; அணுகுவதற்கு Windows Hello மேம்பட்ட உள்நுழைவு பாதுகாப்பு தேவைப்படுகிறது.",
      "Copilot+ கணினிகள், 2024 மே 20 அன்று அறிமுகப்படுத்தப்பட்டன, மேம்பட்ட செயல்திறன் மற்றும் AI அனுபவங்களுடன் கூடிய மேம்பட்ட Windows கணினிகள் ஆகும், Microsoft Pluton பாதுகாப்பு செயலி மற்றும் Secured-core PC தொழில்நுட்பம் போன்ற மேம்பட்ட பாதுகாப்பு நடவடிக்கைகளை கொண்டுள்ளன."
    ],
    "commentSummary": [
      "Microsoft இன் Recall AI அம்சம் குறிப்பிடப்படாத பாதுகாப்பு கவலைகள் காரணமாக காலவரையற்ற தாமதம் அடைந்துள்ளது, இது மூலோபாய நோக்கங்கள் மற்றும் கண்காணிப்புக்கு தவறாக பயன்படுத்தப்படுவதற்கான சாத்தியக்கூறுகள் பற்றிய ஊகங்களை தூண்டுகிறது.",
      "பேங்கிங் சான்றுகள் மற்றும் தனிப்பட்ட செயல்பாடுகள் போன்ற நுண்ணறிவு தகவல்களை பதிவு செய்து கசியவிடும் சாத்தியம் உள்ளதால், ரீகால் ஏ.ஐ. குறித்து கவலைகள் எழுந்துள்ளன, இது தனியுரிமை பிரச்சினைகளுக்கு வழிவகுக்கிறது.",
      "மைக்ரோசாஃப்ட் நிறுவனத்தின் நுகர்வோர் விரோத நடைமுறைகள் குறித்த முந்தைய விமர்சனங்களை இந்த தாமதமும் கவலைகளும் பிரதிபலிக்கின்றன, Xbox One வெளியீட்டின் போது எதிர்கொண்ட எதிர்ப்புகளுக்கும் Adobe இன் சமீபத்திய EULA புதுப்பிப்புக்கும் ஒப்பிடப்படுகிறது."
    ],
    "points": 137,
    "commentCount": 49,
    "retryCount": 0,
    "time": 1718388189
  },
  {
    "id": 40681784,
    "title": "",
    "originLink": "https://blog.lytix.co/posts/self-hosting-llama-3",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40681784",
    "commentBody": "",
    "originSummary": [
      "தானாகவே ஒரு Llama-3 8B-Instruct மாதிரியை ஹோஸ்ட் செய்வது ChatGPT ஐப் பயன்படுத்துவதைக் காட்டிலும் குறிப்பிடத்தக்க அளவில் அதிக செலவாகும், ChatGPT இன் 1 மில்லியன் டோக்கன்களுக்கு $1 ஆகும் போது, 1 மில்லியன் டோக்கன்களுக்கு சுமார் $17 ஆகும்.",
      "முதலில், சுயமாக ஹோஸ்ட் செய்வதற்கான அதிக செலவு, உபகரணச் செலவுகள் மற்றும் ஆற்றல் செலவுகளை உள்ளடக்கியது, இது நீண்டகால சேமிப்புகளைப் பொருட்படுத்தாமல் பொருளாதார ரீதியாக குறைவாக இருக்கும்.",
      ""
    ],
    "commentSummary": [
      "",
      "உரை சுய-ஹோஸ்டிங்கின் நன்மைகள் மற்றும் தீமைகளை விவரிக்கிறது, சாத்தியமான டவுன்டைம் மற்றும் பராமரிப்பு செலவுகளால் அதை நியாயப்படுத்த ஒரு வணிக வழக்கின் தேவையை வலியுறுத்துகிறது.",
      ""
    ],
    "points": 132,
    "commentCount": 94,
    "retryCount": 0,
    "time": 1718379058
  },
  {
    "id": 40679809,
    "title": "POSIX.1-2024 வெளியிடப்பட்டது",
    "originLink": "https://ieeexplore.ieee.org/document/10555529",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40679809",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "POSIX.1-2024 வெளியிடப்பட்டுள்ளது மற்றும் விரைவில் ஓபன் குழு வலைத்தளத்தில் கிடைக்கும், ஷெல் ஸ்கிரிப்டிங் மற்றும் பிற செயல்பாடுகளுக்கான புதுப்பிக்கப்பட்ட தரநிலைகளை வழங்குகிறது.",
      "POSIX.1-2024 இல் புதிய அம்சங்கள் sed -E விரிவான முறைமையான வெளிப்பாடுகளுக்கு, find -print0, xargs -0, read -d பாதுகாப்பான கோப்பு செயலாக்கத்திற்கு, மற்றும் C17, strlcpy, strlcat, மற்றும் பலவற்றிற்கு ஆதரவு ஆகியவற்றை உள்ளடக்கியவை.",
      "புதுப்பிப்பு AIX, Debian, macOS, மற்றும் பல்வேறு லினக்ஸ் விநியோகங்கள் போன்ற மாறுபட்ட அமைப்புகளில் சிறந்த இணக்கத்திற்காக POSIX-இன் விதிமுறைகளை பின்பற்றும் ஸ்கிரிப்ட்களை எழுதுவதன் முக்கியத்துவத்தை வலியுறுத்துகிறது."
    ],
    "points": 123,
    "commentCount": 55,
    "retryCount": 0,
    "time": 1718365048
  },
  {
    "id": 40675577,
    "title": "லாமினி நினைவக சீரமைப்பு: 10 மடங்கு குறைவான மாயங்கள்",
    "originLink": "https://www.lamini.ai/blog/lamini-memory-tuning",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40675577",
    "commentBody": "",
    "originSummary": [
      "லாமினி மெமரி டியூனிங் என்பது பெரிய மொழி மாதிரிகளில் (LLMs) உண்மைகளை உள்ளடக்குவதற்கான புதிய முறையாகும், இது உண்மைத்தன்மையை குறிப்பிடத்தக்க அளவில் மேம்படுத்துகிறது மற்றும் கற்பனைகளை குறைக்கிறது.",
      "இது ஒரு Fortune 500 வாடிக்கையாளருக்கு 95% துல்லியத்தை அடைந்தது, மற்ற முறைகளுடன் ஒப்பிடுகையில் 50% ஆகும், மேலும் மாயங்களை 50% இருந்து 5% ஆகக் குறைத்தது.",
      ""
    ],
    "commentSummary": [
      "லாமினி மெமரி டியூனிங் என்பது பல்வேறு உண்மை அடிப்படையிலான குறைந்த தர அடிப்படையிலான மாற்றங்களை (LoRAs) பிழையில்லாமல் பயிற்சி செய்து, ஒரு கேள்விக்கான பொருத்தமான LoRAs ஐத் தேர்ந்தெடுக்க மீட்டெடுப்பு-விருத்தி உருவாக்கத்தை (RAG) பயன்படுத்தும் ஒரு முறை ஆகும்.",
      "முறை ஒரு நிபுணர் ரவுடர் அடுக்கு மூலம் எந்த LoRAs ஐ ஒருங்கிணைக்க வேண்டும் என்பதை தீர்மானிக்கிறது, ஆனால் ரவுடருக்கான பயிற்சி செயல்முறை தெளிவாக இல்லை.",
      "மாதிரி, நிபுணர்களின் கலவை (MoE) மற்றும் குறுக்கு கவனம் ஆகிய கருத்துக்களை இணைக்கிறது, முன்பே பயிற்சியளிக்கப்பட்ட பெரிய மொழி மாதிரி (LLM) எடைகளை மாறாமல் வைத்துக்கொண்டு, குறுக்கு கவனம் அடுக்கு மீது பயிற்சி அளிப்பதன் மூலம் உண்மையான துல்லியத்தை உறுதிப்படுத்துகிறது."
    ],
    "points": 123,
    "commentCount": 49,
    "retryCount": 0,
    "time": 1718317780
  },
  {
    "id": 40675397,
    "title": "நோட்புக்குகள் குறியீட்டு மாக்டொனால்ட்ஸ் ஆகும்",
    "originLink": "https://yobibyte.github.io/notebooks.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40675397",
    "commentBody": "",
    "originSummary": [
      "நோட்புக்குகள் மாநிலம் மற்றும் பதிப்பீடு தொடர்பான குழப்பத்தை ஏற்படுத்தக்கூடும், மேலும் சோதனை அல்லது லின்டிங் செய்யாதது போன்ற மோசமான பழக்கங்களை ஊக்குவிக்கக்கூடும்.",
      "அவர்கள் அடிக்கடி வேறுபட்ட அமைப்புகள் மற்றும் சார்புகளை கொண்டிருப்பார்கள், இது குறியீட்டு பிழைகள் மற்றும் விரக்தியை ஏற்படுத்தக்கூடும்.",
      "குறிப்புத்தொகுப்புகள் யோசனைகளை சோதிக்க பயனுள்ளதாக இருக்கும் ஆனால் குறியீடுகளை தொகுதிகளுக்கு மாற்றுவது சவாலானதும் நேரம் பிடிப்பதுமானதாக இருக்கும்."
    ],
    "commentSummary": [
      "",
      "Jupyter நோட்புக்குகள் பாட திட்டத் திட்டங்களை நகலெடுக்க, இன்லைன் வரைதல் மற்றும் கேச்சிங் குறியீட்டு துண்டுகளுக்கு பயனுள்ளதாக இருக்கும், ஆனால் பெரிய குறியீட்டு அடிப்படைகளுக்கு செயல்திறனற்றதாக இருக்கலாம்.",
      "நோட்புக்குகள் விரைவான பரிசோதனை, கற்பித்தல் மற்றும் ஆவணப்படுத்தலுக்கு பயனுள்ளதாக இருக்கும், ஆனால் பராமரிப்பு மற்றும் தொடர்பாடல் சிக்கல்களால் உற்பத்தி குறியீட்டு பயன்பாட்டிற்கு சிறந்தவை அல்ல."
    ],
    "points": 120,
    "commentCount": 137,
    "retryCount": 0,
    "time": 1718316595
  }
]
