[
  {
    "id": 38709319,
    "title": "फोक्सवैगन, पोर्श और ऑडी टेस्ला के ईवी चार्जिंग मानक को अपनाएंगी",
    "originLink": "https://www.theverge.com/2023/12/19/24008426/volkswagen-audi-porsche-tesla-nacs-ev-charging-plug",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38709319",
    "commentBody": "",
    "originSummary": [
      "वोक्सवैगन, पोर्श और ऑडी ने टेस्ला के इलेक्ट्रिक वाहन (ईवी) चार्जिंग मानक को अपनाने की योजना बनाई है, जो वीडब्ल्यू ग्राहकों के लिए टेस्ला के सुपरचार्जर नेटवर्क तक पहुंच प्रदान करता है।",
      "टेस्ला के चार्जिंग प्लग को अपनाने से 2025 तक एडाप्टर समाधान के साथ लागू होने की उम्मीद है।",
      "टेस्ला का सुपरचार्जर नेटवर्क अपनी विश्वसनीयता और उपलब्धता के लिए प्रसिद्ध है, जो इसे अन्य तृतीय-पक्ष चार्जिंग स्टेशनों से बेहतर बनाता है।"
    ],
    "commentSummary": [
      "उद्योग में भुगतान और पावरलाइन संचार के लिए मानक प्रोटोकॉल की अनुपस्थिति के बावजूद, वोक्सवैगन, पोर्श और ऑडी टेस्ला के इलेक्ट्रिक वाहन चार्जिंग प्लग का उपयोग करेंगे।",
      "प्लग-एंड-चार्ज सिस्टम की सुविधा और सुरक्षा के बारे में चर्चा चल रही है, अधिवक्ताओं ने एक मानक भुगतान विधि की मांग की है और अन्य सुरक्षा चिंताओं को उठा रहे हैं।",
      "ईवी चार्जिंग के लिए मानकीकृत और उपयोगकर्ता के अनुकूल भुगतान प्रणालियों की आवश्यकता है, जिसमें टैप-टू-पे तकनीक, प्रत्यक्ष कार भुगतान और क्यूआर कोड भुगतान प्रणाली सहित संभावित समाधान शामिल हैं।"
    ],
    "points": 392,
    "commentCount": 578,
    "retryCount": 0,
    "time": 1703084186
  },
  {
    "id": 38708730,
    "title": "अनुक्रम मॉडलिंग के लिए PyTorch में माम्बा आर्किटेक्चर का कार्यान्वयन",
    "originLink": "https://github.com/johnma2006/mamba-minimal",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38708730",
    "commentBody": "",
    "originSummary": [
      "पोस्ट में PyTorch का उपयोग करके एक अनुक्रम मॉडलिंग तकनीक, Mamba के सरलीकृत कार्यान्वयन पर चर्चा की गई है।",
      "प्रदान किया गया कार्यान्वयन आगे और पीछे दोनों पास के लिए आधिकारिक कार्यान्वयन के समान संख्यात्मक आउटपुट उत्पन्न करता है।",
      "कोड सरलीकृत, पठनीय और एनोटेट किया गया है, लेकिन यह आधिकारिक कार्यान्वयन की तरह गति अनुकूलन को प्राथमिकता नहीं देता है।"
    ],
    "commentSummary": [
      "हैकर न्यूज पर उपयोगकर्ता माम्बा, एक पाइटॉर्च लाइब्रेरी के कार्यान्वयन पर चर्चा करते हैं, इसके स्वच्छ और कुशल कोड को गले लगाने के चेहरे के लिए एक महान विकल्प के रूप में प्रशंसा करते हैं।",
      "बातचीत वैज्ञानिक कोड में फोरट्रान के उपयोग को छूती है, संख्यात्मक कार्यों और समांतरता के लिए इसके लाभों पर प्रकाश डालती है।",
      "माम्बा मॉडल इनपुट के आधार पर एक चयन तंत्र के साथ राज्य अंतरिक्ष मॉडल को संबोधित करता है, और चर्चा हार्डवेयर दक्षता, नए आर्किटेक्चर और संभावित अनुप्रयोगों की पड़ताल करती है। यह ज्ञान आसवन और न्यूनतम विवरण लंबाई सिद्धांत का भी उल्लेख करता है।"
    ],
    "points": 373,
    "commentCount": 103,
    "retryCount": 0,
    "time": 1703080731
  },
  {
    "id": 38708585,
    "title": "PowerInfer: उपभोक्ता GPU पर सेवा रत उच्च गति बड़ी भाषा मॉडल",
    "originLink": "https://github.com/SJTU-IPADS/PowerInfer",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38708585",
    "commentBody": "",
    "originSummary": [
      "PowerInfer बड़े भाषा मॉडल (एलएलएम) के लिए एक तेज़ अनुमान इंजन है जो उपभोक्ता-ग्रेड GPU पर चल सकता है।",
      "यह अनुकूली भविष्यवाणियों और न्यूरॉन-जागरूक विरल ऑपरेटरों का उपयोग करके सक्रियण इलाके का लाभ उठाकर दक्षता का अनुकूलन करता है।",
      "PowerInfer उच्च टोकन उत्पादन दर प्राप्त करता है, मौजूदा मॉडल ों से बेहतर प्रदर्शन करता है, और सटीकता बनाए रखता है। यह स्थानीय परिनियोजन का समर्थन करता है और कम-विलंबता अनुमान के लिए डिज़ाइन किया गया है। कोड और डेटा धीरे-धीरे जारी किया जाएगा, और उद्धरण और पावती को प्रोत्साहित किया जाता है।"
    ],
    "commentSummary": [
      "हैकर समाचार चर्चा विभिन्न विषयों में शामिल है, जिसमें बड़े भाषा मॉडल के लिए अनुकूलन तकनीक और कम्प्यूटेशनल नियमों के कानूनी निहितार्थ शामिल हैं।",
      "मोबाइल गेम में विज्ञापनों और पुरस्कारों से जुड़े नुकसान, साथ ही गेमिंग और एआई के लिए दोहरे जीपीयू सेटअप के उपयोग पर भी चर्चा की जाती है।",
      "अन्य विषयों में डीप लर्निंग मॉडल में तेजी लाने के लिए पावरइंफर प्रोजेक्ट, मैट्रिक्स गणना के लिए लामा.cpp लाइब्रेरी, सीपीयू-केवल समाधानों के बारे में बहस, और माइक्रोसॉफ्ट के पावर से संबंधित उत्पादों के संदर्भ और पावरपॉइंट का अधिग्रहण शामिल हैं।"
    ],
    "points": 348,
    "commentCount": 73,
    "retryCount": 0,
    "time": 1703079968
  },
  {
    "id": 38710030,
    "title": "वायरफ्लो: इस ओपन सोर्स टूल के साथ आसानी से उपयोगकर्ता प्रवाह प्रोटोटाइप बनाएं",
    "originLink": "https://wireflow.co",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38710030",
    "commentBody": "",
    "originSummary": [
      "वायरफ्लो एक मुफ्त और ओपन-सोर्स टूल है जो उपयोगकर्ताओं को उपयोगकर्ता प्रवाह प्रोटोटाइप बनाने की अनुमति देता है।",
      "यह वास्तविक समय सहयोग, परियोजना अनुमतियों और एक अंतर्निहित लाइव चैट प्रदान करता है।",
      "इंटरफ़ेस उपयोगकर्ता के अनुकूल है और फ़ोटोशॉप कौशल की आवश्यकता नहीं है।",
      "परियोजना योजना और मंथन को सरल बनाने के लिए वायरफ्लो विकसित किया गया था।",
      "यह उल्का .js मंच पर बनाया गया है और टीम में सर्बिया, बांग्लादेश, फिनलैंड और फिलीपींस के डेवलपर्स शामिल हैं।",
      "उपकरण में कुछ बग हो सकते हैं लेकिन पूरी तरह से खुला स्रोत है।"
    ],
    "commentSummary": [
      "वायरफ्लो उपयोगकर्ता-प्रवाह प्रोटोटाइप बनाने के लिए एक मुफ्त, ऑनलाइन, ओपन सोर्स टूल है, लेकिन इसे वर्षों से गिटहब पर अपडेट नहीं किया गया है, जिससे इसके रखरखाव के बारे में चिंता बढ़ गई है।",
      "उपयोगकर्ता वैकल्पिक वायरफ्लो टूल जैसे एक्सकैलिड्रा, टीएलड्रा और फिग्मा पर चर्चा कर रहे हैं, साथ ही डिजाइन प्रक्रिया में विभिन्न वायरफ्लो टूल के साथ अपने अनुभव और चुनौतियों को साझा कर रहे हैं।",
      "कुछ उपयोगकर्ता वायरफ्लो को किसी अन्य उपकरण के साथ विलय करने की सलाह देते हैं, जबकि अन्य इसके विकास में योगदान देने में रुचि व्यक्त करते हैं। कुल मिलाकर, वायरफ्लो के लिए मिश्रित प्रतिक्रिया है और इसकी कार्यक्षमता और उपयोगिता के बारे में चल रही चर्चाएं हैं।"
    ],
    "points": 276,
    "commentCount": 32,
    "retryCount": 0,
    "time": 1703087707
  },
  {
    "id": 38715230,
    "title": "प्रोटीन ENPP1 स्तन कैंसर मेटास्टेसिस में प्रमुख खिलाड़ी के रूप में उजागर",
    "originLink": "https://news.stanford.edu/2023/12/20/breast-cancer-metastasis-off-switch-revealed/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38715230",
    "commentBody": "",
    "originSummary": [
      "शोधकर्ताओं ने ENPP1 नामक एक प्रोटीन की पहचान की है जो स्तन कैंसर के मेटास्टेसिस को नियंत्रित करता है।",
      "ENPP1 के उच्च स्तर इम्यूनोथेरेपी के प्रतिरोध और मेटास्टेसिस के बढ़ते जोखिम से जुड़े हैं।",
      "यह खोज बेहतर इम्यूनोथेरेपी के विकास का कारण बन सकती है और वर्तमान उपचारों के लिए रोगी प्रतिक्रियाओं की भविष्यवाणी करने में मदद कर सकती है। इसके अतिरिक्त, ENPP1 को लक्षित करने से मौजूदा उपचारों की प्रभावशीलता बढ़ सकती है। ईएनपीपी 1 फेफड़ों और अग्नाशय के कैंसर जैसे अन्य \"ठंडे\" ट्यूमर में भी प्रासंगिक हो सकता है।"
    ],
    "commentSummary": [
      "स्टैनफोर्ड विश्वविद्यालय और कैलिफोर्निया विश्वविद्यालय, सैन फ्रांसिस्को के शोधकर्ताओं ने चूहों में स्तन कैंसर मेटास्टेसिस के लिए एक संभावित \"ऑन / ऑफ स्विच\" की खोज की है, जो स्तन कैंसर के उपचार के लिए महत्वपूर्ण प्रभाव डाल सकता है।",
      "एक अन्य अध्ययन ने स्तन कैंसर मेटास्टेसिस में ईएनपीपी 1 प्रोटीन और इम्यूनोथेरेपी के प्रतिरोध के बीच एक सहसंबंध की पहचान की है, जो नए लक्षित उपचारों की क्षमता प्रदान करता है।",
      "शोधकर्ताओं के बीच संभावित पूर्वाग्रहों के बारे में चिंताओं के साथ, इन निष्कर्षों की प्रासंगिकता और महत्व के बारे में बहस चल रही है। इसके अतिरिक्त, कैंसर अनुसंधान में मॉडल के रूप में चूहों का उपयोग करने की सीमाओं को स्वीकार किया जाता है, जो चुनौतियों का सामना करते हैं।"
    ],
    "points": 266,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1703116298
  },
  {
    "id": 38714674,
    "title": "कुंजी सत्यापन के साथ iMessage सुरक्षा बढ़ाएँ",
    "originLink": "https://support.apple.com/en-gb/HT213465",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38714674",
    "commentBody": "",
    "originSummary": [
      "iMessage संपर्क कुंजी सत्यापन iMessage वार्तालापों की प्रामाणिकता सुनिश्चित करने के लिए Apple द्वारा पेश की जाने वाली एक सुरक्षा सुविधा है।",
      "उपयोगकर्ता सत्यापन कोड की तुलना करके संपर्कों को मैन्युअल रूप से सत्यापित कर सकते हैं या संपर्कों द्वारा साझा किए गए सार्वजनिक सत्यापन कोड का उपयोग कर सकते हैं।",
      "इस सुविधा के काम करने के लिए एक संगत सॉफ़्टवेयर संस्करण और आवश्यक सेटिंग्स सक्षम होना महत्वपूर्ण है। उपयोगकर्ता वार्तालाप विवरण में सत्यापन स्थिति की जांच कर सकते हैं और यदि कोई समस्या है तो सहायता के लिए ऐप्पल तक पहुंच सकते हैं।"
    ],
    "commentSummary": [
      "ऐप्पल ने आईमैसेज कुंजी सत्यापन पेश किया है, जिससे उपयोगकर्ता अपने संपर्कों की पहचान सत्यापित कर सकते हैं।",
      "उपयोगकर्ता को अपनाने और सत्यापन प्रक्रिया की संभावित असुविधा के बारे में चिंताएं उठाई जाती हैं।",
      "एन्क्रिप्शन कुंजियों को सत्यापित करने के महत्व और लक्षित हमलों के जोखिमों पर चर्चा की जाती है।",
      "सरकारी निगरानी और एन्क्रिप्शन टूल के उपयोग पर इसके प्रभाव पर बहस की जाती है।",
      "शून्य-दिन के शोषण से बचने के लिए ऑपरेटिंग सिस्टम को नियमित रूप से अपडेट करना महत्वपूर्ण है।",
      "एंड्रॉइड उपकरणों को कमजोर माना जाता है, और वारंटलेस निगरानी के सामान्यीकरण पर बहस की जाती है।",
      "कुछ उपयोगकर्ता ऐप्पल की नीति से निराशा व्यक्त करते हैं और एन्क्रिप्शन कुंजी सत्यापन के लिए तीसरे पक्ष के विकल्प सुझाते हैं।",
      "ऐप्पल के प्लेटफॉर्म पर सत्यापन विधि के कार्यान्वयन पर चर्चा की गई है, साथ ही उपयोगकर्ता अनुभव और संभावित कमियों के बारे में चिंताओं के बारे में भी चर्चा की गई है।",
      "iMessage और iCloud Keychain की सुरक्षा और एन्क्रिप्शन को छुआ जाता है।",
      "कुल मिलाकर, सुरक्षा और खाता प्रबंधन के लिए ऐप्पल के दृष्टिकोण से असंतोष है।"
    ],
    "points": 224,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1703112395
  },
  {
    "id": 38712802,
    "title": "ओपनपाइप का मिस्ट्राल 7 बी फाइन-ट्यून ऑप्टिमाइज्ड: जीपीटी -4 का एक शक्तिशाली विकल्प",
    "originLink": "https://openpipe.ai/blog/mistral-7b-fine-tune-optimized",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38712802",
    "commentBody": "",
    "originSummary": [
      "ओपनपाइप ने मिस्ट्राल 7 बी फाइन-ट्यून ऑप्टिमाइज़्ड विकसित किया है, एक मॉडल जो ग्राहक कार्यों में जीपीटी -4 को पार करता है।",
      "मिस्ट्रल फाइन-ट्यून ऑप्टिमाइज़्ड अधिक कॉम्पैक्ट और कुशल है क्योंकि यह जीपीटी -4 के विपरीत, विशेष कार्यों के लिए विशेष रूप से ठीक है, जो एक सामान्य-उद्देश्य मॉडल है।",
      "शीर्ष प्रदर्शन करने वाले मिस्ट्रल वेरिएंट का विलय बेस मॉडल बनाता है, जिसे एक नए ग्राहक डेटासेट पर मान्य किया गया था और अब हगिंग फेस पर और ओपनपाइप के लिए डिफ़ॉल्ट बेस मॉडल के रूप में मुफ्त में उपलब्ध है।"
    ],
    "commentSummary": [
      "लेख गहन शिक्षा में मॉडल विलय की अवधारणा और इसके लाभों और चुनौतियों पर चर्चा करता है।",
      "यह विरल सुधार और मापदंडों के संरक्षण पर एक अध्ययन का संदर्भ देता है।",
      "चर्चा में मिस्ट्रल नामक एक भाषा मॉडल का विकास और प्रदर्शन शामिल है, साथ ही साथ निजी भाषा मॉडल के उपयोग और लाभ भी शामिल हैं।",
      "विभिन्न उद्योगों में जीपीटी मॉडल के संभावित अनुप्रयोगों का पता लगाया जाता है।",
      "ओपनएआई के साथ लागत, गुणवत्ता, विश्वास और डेटा साझा करने के बारे में बहस पर प्रकाश डाला गया है।",
      "ठीक करने के लिए ओपनपाइप नामक एक नए बेस मॉडल की आवश्यकता पर चर्चा की गई है।",
      "बड़े पीडीएफ दस्तावेजों पर भाषा मॉडल को ठीक करने का उल्लेख किया गया है।",
      "जीपीटी -4 की संभावित क्षमताओं और भाषा मॉडल के मूल्यांकन में मूर्त साक्ष्य और गुणात्मक दृष्टिकोण की आवश्यकता पर भी चर्चा की जाती है।"
    ],
    "points": 216,
    "commentCount": 101,
    "retryCount": 0,
    "time": 1703101824
  },
  {
    "id": 38713167,
    "title": "सबसे छोटे रास्तों को खोजना: GitHub की नेविगेशन खोज",
    "originLink": "https://www.sixdegreesofwikipedia.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38713167",
    "commentBody": "",
    "originSummary": [
      "GitHub पर ब्लॉग दो स्थानों के बीच सबसे छोटे रास्ते खोजने की अवधारणा के आसपास केंद्रित है।",
      "इस अवधारणा के व्यावहारिक अनुप्रयोग और पाठकों को उपयोगी जानकारी प्रदान करने पर ध्यान केंद्रित किया गया है।",
      "ब्लॉग का उद्देश्य व्यक्तियों को कुशलतापूर्वक नेविगेट करने और सबसे कुशल मार्गों का निर्धारण करते समय सूचित निर्णय लेने में मदद करना है।"
    ],
    "commentSummary": [
      "वेबसाइट \"विकिपीडिया की छह डिग्री\" वर्तमान में उच्च ट्रैफ़िक और पुराने डेटा के कारण अनुपलब्ध है।",
      "वेबसाइट के निर्माता ने शॉर्टवेव नामक एक नए एआई ईमेल ऐप का भी उल्लेख किया, जिसे मिश्रित प्रतिक्रिया मिली है।",
      "हैकर समाचार पर चर्चा विकिपीडिया के छह डिग्री, संबंधित परियोजनाओं और खेलों के साथ उपयोगकर्ताओं के अनुभवों, और लोकप्रिय गेम \"केविन बेकन के छह डिग्री\" सहित विकिपीडिया को नेविगेट करने की चुनौतियों और सीमाओं के आसपास केंद्रित है।"
    ],
    "points": 213,
    "commentCount": 52,
    "retryCount": 0,
    "time": 1703104003
  },
  {
    "id": 38711003,
    "title": "एयरोथीमप्लाज्मा के साथ विंडोज 7 लुक और फील को दोहराएं",
    "originLink": "https://gitgud.io/wackyideas/aerothemeplasma",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38711003",
    "commentBody": "",
    "originSummary": [
      "एयरोथेमप्लाज्मा प्रोजेक्ट एक केडीई प्लाज्मा थीम है जिसे विंडोज 7 की उपस्थिति की नकल करने के लिए डिज़ाइन किया गया है।",
      "इसने 6 सितारों और 73 प्रतिबद्धताओं के साथ लोकप्रियता हासिल की है, जो समुदाय से सक्रिय विकास और रुचि का संकेत देता है।",
      "परियोजना भंडारण अपेक्षाकृत बड़ा है, 125.8 एमआईबी पर, यह सुझाव देता है कि इसमें चित्र और आइकन जैसे विभिन्न संसाधन हो सकते हैं।"
    ],
    "commentSummary": [
      "केडीई प्लाज्मा फोरम उपयोगकर्ताओं के लिए विंडोज संस्करणों और डेस्कटॉप वातावरण के विभिन्न विषयों और सौंदर्य गुणों पर चर्चा करने और अपने विचार साझा करने के लिए एक मंच है।",
      "कुछ उपयोगकर्ता पुराने विंडोज डिजाइनों के लिए नॉस्टेल्जिया व्यक्त करते हैं, जबकि अन्य केडीई प्लाज्मा जैसे ओपन-सोर्स टूल के अनुकूलन और प्रयोज्यता की सराहना करते हैं।",
      "चर्चा में वैकल्पिक फ़ाइल खोजकर्ता, टैब बार टूल और क्लासिक मैक ओएस थीमिंग की तुलना में लिनक्स थीमिंग की सीमाएं जैसे विषय भी शामिल हैं।"
    ],
    "points": 175,
    "commentCount": 75,
    "retryCount": 0,
    "time": 1703092725
  },
  {
    "id": 38711007,
    "title": "स्नोडेन के रहस्योद्घाटन का प्रभाव: ऑनलाइन गोपनीयता में चुनौतियां और प्रगति",
    "originLink": "https://blog.torproject.org/tor-in-2023/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38711007",
    "commentBody": "",
    "originSummary": [
      "बड़े पैमाने पर निगरानी के बारे में एडवर्ड स्नोडेन के खुलासे ने ऑनलाइन गोपनीयता के बारे में सार्वजनिक जागरूकता पर गहरा प्रभाव डाला है।",
      "सरकार और कॉर्पोरेट गोपनीयता उल्लंघन जनता की राय में हेरफेर कर सकते हैं और महत्वपूर्ण सामाजिक निर्णयों को प्रभावित कर सकते हैं।",
      "धारणा में बदलाव ने मजबूत गोपनीयता संरक्षण के लिए ग्राहकों की मांग में वृद्धि की है और उपभोक्ताओं को अपने डेटा पर अधिक नियंत्रण देने वाले कानून का निर्माण किया है।",
      "कुछ तकनीकी कंपनियों के प्राथमिकता के रूप में गोपनीयता का विपणन करने के बावजूद, उनके अंतर्निहित व्यवसाय मॉडल अभी भी डेटा संग्रह पर ध्यान केंद्रित करते हैं।",
      "टोर प्रोजेक्ट को प्रौद्योगिकी के एक उदाहरण के रूप में चित्रित किया गया है जो गोपनीयता को प्राथमिकता देता है, लेकिन ऑनलाइन गोपनीयता की रक्षा और डिजिटल क्षेत्र में मानवाधिकारों को आगे बढ़ाने में चुनौतियां बनी हुई हैं।"
    ],
    "commentSummary": [
      "चर्चा ऑनलाइन गोपनीयता के विभिन्न पहलुओं के आसपास केंद्रित है, जिसमें टॉर, एचटीटीपीएस एन्क्रिप्शन, डीएनएसएसईसी और डेटा एन्क्रिप्शन जैसे लोकप्रिय उपकरण शामिल हैं।",
      "सरकारी निगरानी और संभावित कमजोरियों के बारे में चिंताओं के साथ HTTPS-एवरीवेयर और टॉर जैसे विभिन्न तरीकों की प्रभावशीलता और सुरक्षा के बारे में एक बहस है।",
      "I2P और Freenet जैसे वैकल्पिक नेटवर्क को टोर के विकल्प के रूप में उल्लेख किया गया है, जबकि अमेरिकी सरकार की विश्वसनीयता और छोटे अपराधों को लक्षित करने वाले कानून प्रवर्तन के बारे में चिंताओं को भी संबोधित किया गया है। जानकारी को संग्रहीत करने और संचारित करने में सीपीयू की भूमिका पर भी सवाल उठाया जाता है।"
    ],
    "points": 172,
    "commentCount": 70,
    "retryCount": 0,
    "time": 1703092755
  },
  {
    "id": 38716032,
    "title": "उत्प्रेरक का परिचय: एक टेलविंड सीएसएस एप्लिकेशन यूआई किट",
    "originLink": "https://tailwindui.com/templates/catalyst",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38716032",
    "commentBody": "",
    "originSummary": [
      "टेलविंड यूआई ने कैटेलिस्ट, एक प्रतिक्रिया यूआई किट जारी की है जो आधुनिक एप्लिकेशन यूआई घटक प्रदान करती है।",
      "उत्प्रेरक में टेम्प्लेट और प्रलेखन शामिल हैं, जिससे डेवलपर्स आसानी से अपनी परियोजनाओं में अनुकूलन योग्य यूआई घटकों को शामिल कर सकते हैं।",
      "यूआई किट को टेलविंड सीएसएस, हेडलेस यूआई और रिएक्ट के साथ बनाया गया है, जो उद्योग की सर्वोत्तम प्रथाओं का पालन करता है और पहुंच सुनिश्चित करता है। इसे लाइफटाइम एक्सेस और अपडेट के लिए खरीदा जा सकता है। टेलविंड यूआई वेबसाइट टेम्प्लेट और घटक उदाहरण भी अलग से प्रदान करता है।"
    ],
    "commentSummary": [
      "चर्चा टेलविंड सीएसएस, इसके यूआई किट और अन्य समान यूआई पुस्तकालयों के आसपास घूमती है, जिसमें मूल्य निर्धारण, पूर्णता और उपयोगिता पर मिश्रित राय होती है।",
      "कुछ उपयोगकर्ता मूल्य पाते हैं और इन पुस्तकालयों के लिए भुगतान करने से संतुष्ट होते हैं, जबकि अन्य मुफ्त विकल्प पसंद करते हैं या अधिक लचीलापन चाहते हैं।",
      "वार्तालाप रचनाकारों का समर्थन करने के महत्व और विभिन्न रूपरेखाओं को एकीकृत करने की चुनौतियों को संबोधित करता है, और उत्प्रेरक और फ्लोबाइट जैसे विशिष्ट यूआई पुस्तकालयों के साथ-साथ टेबलर और एचटीएमएक्स जैसे वैकल्पिक उपकरणों की भी पड़ताल करता है।"
    ],
    "points": 169,
    "commentCount": 139,
    "retryCount": 0,
    "time": 1703122307
  },
  {
    "id": 38716390,
    "title": "पैराक्वाट हर्बिसाइड को लेकर कानूनी लड़ाई छिड़ गई: श्रमिकों ने पार्किंसंस रोग का आरोप लगाया",
    "originLink": "https://www.latimes.com/environment/story/2023-12-20/california-workers-say-herbicide-is-giving-them-parkinsons",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38716390",
    "commentBody": "",
    "originSummary": [
      "पूर्वी नगरपालिका जल जिला के पूर्व कार्यकर्ता, गैरी मुंड ने सिंजेंटा पर मुकदमा दायर किया है, जिसमें आरोप लगाया गया है कि हर्बिसाइड पैराक्वाट के संपर्क में आने से उन्हें पार्किंसंस रोग हुआ।",
      "पैराक्वाट 58 देशों में प्रतिबंधित है, लेकिन अमेरिका में अभी भी व्यापक रूप से इसका उपयोग किया जाता है, जिससे इसके संभावित स्वास्थ्य जोखिमों के बारे में चिंता बढ़ जाती है।",
      "अध्ययनों ने संकेत दिया है कि पैराक्वाट जानवरों में पार्किंसंस रोग के लक्षणों को दोहरा सकता है, हालांकि सिंजेंटा किसी भी कारण संबंध पर विवाद करता है। अर्थजस्टिस और माइकल जे फॉक्स फाउंडेशन जैसे वकालत समूह इन संभावित जोखिमों के कारण पैराक्वाट पर प्रतिबंध लगाने की मांग कर रहे हैं।"
    ],
    "commentSummary": [
      "कुछ अमेरिकी कर्मचारी पार्किंसंस रोग के विकास को देश में इस्तेमाल किए जाने वाले प्रतिबंधित खरपतवार नाशक से जोड़ रहे हैं, जिससे रसायनों के हानिकारक प्रभावों के बारे में बहस छिड़ गई है।",
      "ऐतिहासिक उदाहरणों को कुछ पदार्थों से जुड़े स्वास्थ्य जोखिमों के लिए चिंता की कमी पर जोर देने के लिए उद्धृत किया गया है।",
      "बातचीत विशिष्ट आहार के संभावित जोखिमों, वस्तुनिष्ठ जानकारी प्रस्तुत करने में पत्रकारों की भूमिका और कीटनाशक पैराक्वाट की सुरक्षा को छूती है, जबकि परिवार के स्वास्थ्य के मुद्दों के साथ व्यक्तिगत अनुभव भी साझा करती है।"
    ],
    "points": 152,
    "commentCount": 53,
    "retryCount": 0,
    "time": 1703126275
  }
]
