[
  {
    "title": "中国市场监管局食品安全抽检：多公司产品不合格，涉及拼多多和多省",
    "originLink": "http://www.10yan.com/qcw/2023/11/05/848179.shtml",
    "originBody": "新闻 政务 党建 视频 图片 社区 评论 旅游 电商 客户端  微博  微信  抖音  数字报 首页 > 社会万象 > 国内新闻 > 正文 这些食品抽检不合格！不要再吃啦 — 分享 — — 爆料 —  — 投稿 —  — 反馈 —  时间：2023-11-05 14:51 来源：央视新闻客户端  字体： 小 中 大  打印  播报 原标题：这些食品抽检不合格！不要再吃啦 近期 市场监管总局 组织食品安全监督抽检 抽取22大类食品1256批次样品 检出乳制品、饮料、糕点等 8大类食品10批次样品不合格 监督抽检不合格食品具体情况如下： 一、微生物污染问题 (一)拼多多良心干货铺(经营者为广东省深圳市宝安区沙井街道良心食品店)在拼多多(手机APP)销售的、标称广东省深圳市百果心享科技发展有限责任公司委托广东南兴天虹果仁制品有限公司生产的开心果，其中大肠菌群数不符合食品安全国家标准规定。 (二)云南省昆明市官渡区奎恩副食经营部销售的、标称云南九九九食品有限公司生产的澄江冰糖藕粉，其中霉菌数、菌落总数不符合食品安全国家标准规定。 (三)新疆维吾尔自治区吐鲁番市托克逊县新宝园超市销售的、标称新疆果子沟食品有限公司生产的黑蜂蜂蜜，其中菌落总数不符合食品安全国家标准规定。 二、食品添加剂超范围超限量使用问题 (一)福建省厦门润瑞商业有限公司销售的、标称福建龙岩牛车水食品有限公司生产的龙岩花生(咸酥口味)，其中二氧化硫残留量不符合食品安全国家标准规定。 (二)山东省烟台大年经贸有限公司销售的、标称山东省潍坊市诸城市森义达调味品有限公司生产的小磨香油，其中乙基麦芽酚检验值不符合食品安全国家标准规定。 (三)宁夏回族自治区银川市永宁县望远镇新百生活超市销售的、标称河南省新乡市发财雨饮品有限公司出品的、河南省新乡市及时雨饮品股份有限公司制造的柚子薄荷味电解质补水液，其中苯甲酸及其钠盐(以苯甲酸计)检验值不符合食品安全国家标准规定。 (四)宁夏回族自治区石嘴山市大武口区百邻汇生活超市销售的、标称宁夏康业食品有限公司生产的海绵蛋糕，其中脱氢乙酸及其钠盐(以脱氢乙酸计)、防腐剂混合使用时各自用量占其最大使用量的比例之和检验值不符合食品安全国家标准规定。 三、质量指标不达标问题 (一)山东省菏泽市东明县爱尚宝贝孕婴用品店销售的、标称陕西省西安安诺乳业有限公司生产的羚滋较大婴儿配方羊奶粉(6—12月龄，2段)，其中硒、二十二碳六烯酸(DHA)含量不符合食品安全国家标准规定。 (二)拼多多福宝来(经营者为安徽省合肥赪运孕婴童用品销售有限公司)在拼多多(手机APP)销售的、标称山东省青岛爱氏营养健康科技有限公司代理的、南阳世宗工厂Namyang Dairy Products.Co.Ltd(原产国：韩国)生产的上韵婴儿配方乳粉(0—6月龄，1段)，其中铁含量不符合食品安全国家标准规定。 (三)广西壮族自治区南宁市人人乐商业有限公司五象购物广场销售的、标称广西石埠乳业有限责任公司乳品二厂生产的双益风味发酵酸奶，其中酸度检验值不符合食品安全国家标准规定。 对抽检发现的不合格食品，上海、安徽、福建、山东、河南、广东、广西、云南、陕西、宁夏、新疆等省级市场监管部门已组织开展核查处置，查清产品流向，督促企业采取下架召回不合格产品等措施控制产品风险；对违法违规行为，依法从严处理。(来源：央视新闻客户端) ( 责任编辑：余红梅 新闻报料：8110110 版权声明 ) 推荐阅读 如何防治秋冬季高发呼吸道疾病？——国家卫生健康委组织专家解答热点问题 来源： 新华网 2023-11-05 08:32 康师傅被传涨价背后，3元以下的饮料要消失了？ 来源： 中新网 2023-11-05 08:30 北方多地冬天集体迟到 今年会是暖冬吗？ 来源： 中国天气网 2023-11-04 08:52 @在职场打拼的小伙伴们 年休假应该怎么休？一图看懂 来源： 人力资源和社会保障部 2023-11-04 08:49 教育部：中小学校要确保学生课间正常活动 来源： 央视新闻客户端 2023-11-04 08:44 3.9万余人参加首次新闻记者职业资格考试 来源： 新华社 2023-11-04 08:42 编辑推荐 全省第一！1至9月，十堰城建项目完成投资123.85亿元 畅行车城10月“畅行车城”成效发布 这些变化你感受到了吗 前三季度十堰实现地区生产总值1723.15亿元，同比增长6.7% 十堰城区将新建一座植物园，预计春节前免费开放 十堰两部门最新声明，事关城区公租房申请！ 全城征集！十堰城区健康步道有奖征名，最高可获10000元奖金 热图推荐 最低2℃！气温明显下降，备好厚衣服！明天天气 厉害了！十堰这个村的农业玩起“黑科技”！ 生态河道 秋意盎然 “双11”首个投递高峰已来临 十堰各快递企业多 机声隆隆秋播忙 郧阳小橄榄做成乡村振兴富民大产业 视频推荐 关于我们 - 版权声明 - 人才招聘 - 广告业务 - 联系我们 秦楚网(10yan.com) 版权所有 未经同意不得复制或镜像 主管：中共十堰市委宣传部 主办：十堰日报传媒集团 编辑部：0719-8208110 广告业务：0719—8114000 技术部：0719-8622987 互联网视听节目服务AVSP：鄂备2016003 网站备案：鄂ICP备06007886号-1",
    "originSummary": [
      "中國市場監督管理局組織了食品安全監管和抽樣檢查，發現包括拼多多手機應用程式在內的一些公司的產品不符合國家食品安全標準。",
      "這些問題產品來自於雲南、新疆、福建、山東、寧夏等省，問題包括微生物污染和過度使用食品添加劑。",
      "各省市場監督部門正在啟動調查並敦促公司控制產品風險，任何違反法律法規的公司將會依法嚴肅處理。"
    ],
    "commentBody": "",
    "commentSummary": [
      "中国市场监督管理局组织食品安全监管抽检，发现一些企业的产品不符合国家食品安全标准。",
      "这包括拼多多手机应用上销售的产品，以及云南、新疆、福建、山东、宁夏等省份的食品，问题包括微生物污染和食品添加剂过量使用。",
      "相关省份的市场监督部门正在启动调查并敦促企业控制产品风险，任何违反法律法规的公司将依法严厉处理。"
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699207922547
  },
  {
    "title": "雅诗兰黛净利大跌九成，广州柳丝品牌受年轻消费者追捧",
    "originLink": "https://www.sohu.com/a/733935800_116132",
    "originBody": "图片来源@视觉中国 文财经故事荟 顿悟的年轻人，开始理性消费，不再献祭智商，为高昂的溢价和热闹的噱头买单。 被视为美妆刺客的花西子，在双11预售里仓皇跌出了彩妆Top20榜单。 一路高歌猛涨的雅诗兰黛，也掉头向下——截止9月30日的最新财季里，其营收、净利润分别同比下降10%、92.65% 价格刺客和高端品牌退场让出的红利，平价平替的美妆商家们，已经尝到了。 总部位于广州产业带的美妆品牌柳丝木，早已习惯了高增长，2020年开店之初每月销售额不过三四十万，及至2023年，其单月销售额已经暴涨了100倍。 “以前我们的用户，主要是三四线、学生党和小镇青年，现在一二线的用户也慢慢多了”，柳丝木拼多多运营负责人陈思强告诉《财经故事荟》。 高速增长之下，柳丝木团队放开了手脚，招人、扩产线、创办子品牌…… 当完美日记等相对高价的网红美妆，都迟迟走不出亏损泥淖时，柳丝木们依靠区区二三十元，甚至十几元的低廉定价，真能保障品质，并且维持可持续的盈利吗？ 平价美妆爆火的背后，隐藏着另一套完全不同于网红和高端品牌的新打法。 拒绝刺客，年轻人疯抢产业带美妆 平价美妆的低廉价格，让不少买过贵妇底妆的打工人直接破防。 在北京某985高校就读大二的萌萌子，就是平价美妆的拥趸，“买了买了， 一支眼线笔6.9元，还不够我喝杯雪王，更不够我点杯瑞幸，我要看看这玩意儿到底是何方妖孽，姐妹们等我！” 年轻人不再愿意肉疼，雅诗兰黛的业绩血流成河。营收和利润双降的寒意里，中国市场首当其冲，“中国大陆高端美容产品整体复苏速度慢于预期带来了阻力”，最终拖累雅诗兰黛本季度亚太地区营收同比降低6%，而本季度公司净利润仅为3100万美元，对比去年同期的4.89亿美元下降92.65%。 财报公布后，雅诗兰黛股价跌幅达19%，创下最大单日跌幅。而今年以来，雅诗兰黛的股价已下跌了近60%。 靠头部主播撑场子的网红品牌，日子同样不好过——因为负担不起高昂的佣金和投流，而减少头部主播带货、削减广告投放后，完美日记的营收已经连续六个季度阴跌。 欧莱雅2023年第三季度财报(2023年7-9月)也显示，欧莱雅高端化妆品部门是所有部门中销售额同比增速最低的一个。 不独前述品牌，《中国高端美妆市场数字化趋势洞察报告》透露，2022年，在单价持平的情况下，高端化妆品成交量较上年有所下降。 但这样的寒意，产业带美妆品牌柳丝木、NOVO，却得以完全幸免。 NOVO销量的大爆发，始于2019年之后。 在这之前，NOVO先后试水了多个电商平台，但业绩平平——这也不难理解。 彼时，传统电商平台聚焦于扶持头部大牌和网红品牌，在各种大促榜单上，欧莱雅、雅诗兰黛、兰蔻等国外大牌，总是稳居前列。上述平台对于发源于产业带的中小美妆品牌，则兴趣了然，导致后者很难有出头之机。 而此时，拼多多的入场，给了NOVO爆发的机会。 主打性价比的拼多多，早期很难得到头部美妆大牌的青睐，从产业带中小商家以及美妆国货撕开扣子，成为其必选项。 广州，则是拼多多的第一站。 位于广州的白云区化妆品产业带，云集了全国三分之一化妆品企业——持证化妆品生产企业1300多家、商贸企业4000多家、工商个体户6000多家，拥有完备的产业链，贡献了全球三分之一的美妆产能。 2020年，拼多多在此召开“广州化妆品新品牌计划大会”。 彼时，拼多多副总裁放出豪言，“未来两年，拼多多将扎根中国化妆品产业带，培育50个亿级化妆品新品牌，其中10个10亿级化妆品新一线品牌。” 而2020年，也成为了NOVO业绩大爆发的起点，“一方面是拼多多的扶持政策越来越多了，我们抓住了机会，从两家店铺，扩容到十家；另一方面，疫情导致线下门店不开门，用户都到线上来了”。 如今，NOVO基本上已经放弃了其他电商平台，主攻拼多多，“十几二十元的价格，与平台低价心智很契合”，其主流用户是遍布全国的学生群体，月均销量从3万单增加到了大促期间的50万单。 柳丝木品牌的大爆发也在前后脚。相对之下，柳丝木的产品相对高端高价，但均价也不过三四十元左右。 2020年初入职柳丝木的电商负责人陈思强，亲见了柳丝木在拼多多的崛起。 他刚入职时，对接拼多多的运营团队只有四个人，如今增加到50多号人，销售额也从当时的每月三四十万元，暴涨了100倍。 而且，柳丝木拼多多渠道的增速，也远高于全网大盘，“全网今年同比增长六成，拼多多平台则翻了一倍有余”。 理性消费的风潮，与产业带美妆的崛起，共同聚拢于拼多多。正如一位美妆用户获得高赞的微博评论所言，“质疑拼多多，偶尔拼多多，次次拼多多”。 受花西子事件影响，国货美妆在拼多多销量猛增。其中，郁美净儿童霜单日销量增长达到230%，7.9元套餐上线不久后即售出2万单，花洛莉亚的眉笔单日销量最高增长2万单；谢馥春、孔凤春等老字号也实现翻倍增长。 而在双11大促开始后，国货美妆成为入驻拼多多百亿补贴数量最多的类目，多个国货美妆品牌销量增长显著，部分热销单品销量增长超过20倍。 拼多多，成为了平价美妆、国货美妆的新主场。 比价格网红品牌赢了，拼盈利产业带商家笑了 用低质换低价，很难玩转，守住品质底线，才有出头之机，这是NOVO和柳丝木的共识——两个品牌的用户评论区里，好评刷屏。 以用户评价超过10万条的一款NOVO四色眼影盘为例，粉质细腻服帖，颜色搭配好看等正面评价，占比达到99.92%(平台数据)。 严守品质安全的底线后，如此平价的NOVO和柳丝木，还能保持持续盈利吗？ 答案是肯定的——与网红美妆赔本赚吆喝不同，在平价的限制下，产业带美妆品牌虽然难以企及一线品牌的利润率，但盈利却是可持续的。 共性原因在于，无论是NOVO还是柳丝木，作为产业带商家，都有着完备的供应链体系。 柳丝木的背后，盘踞着两家公司，分别是从事化妆品原料贸易的广州华图，以及从事化妆品OEM、ODM加工的广州华狮，名列国家高新技术产业。两家兄弟公司的客户，包括多家头部化妆品品牌。 从原料到生产，“我们老板很懂行，懂原料成分，也懂生产”，谈起公司创始人，陈思强颇为自豪。 NOVO也是如此，其背后对接着两家自有工厂、12条生产线，以及200号的生产工人。 自建供应链，以及多年的大牌代工经验，其一，让其可以轻松拿捏品控，对齐大牌的水准和要求，去做自主品牌。 “我们的新品研发生产出来后，都会和对标品牌进行对比测试功效。然后寻找用户进行内测，小规模投放市场试探反馈，认可度高了才会大规模上线”，陈思强介绍。 另一方面，在成本控制和产能供给上，也能做到极致。 以NOVO为例，爆单之后，除了扩充自有产线，还能借由产业带优势，把一些环节如包装、发货等，分包给同行，快速补足供给能力。 实现品质、平价、盈利的兼得，还源于其极致压缩了庞杂的中间环节，大幅削减了营销投入。 在传统模式下，营销、渠道、包装等费用，占据了美妆产品成本结构的大头。 以欧莱雅为例，在其成本结构中，营销销售成本占比超过三成。 这并非个例。欧睿数据显示，美妆行业投放在互联网营销中稳居首位，2022年为互联网广告贡献的收入占TOP10的比重为32.9%。 另有统计显示，2022年中国8家上市化妆品品牌，花费的销售费用合计为133.70亿元，占总收入的比重为42.69%，远高于研发费用(8.60亿元)的占比(2.75%)。 而无论是NOVO和柳丝木，在拼多多平台的高增长，都不依赖于高昂的营销投入，这保证了其成本可以因此大幅缩减三四成。 当下正当风口的直播带货，同样投入不菲。 一位美妆行业创业者曾告诉《财经故事荟》,“美妆行业佣金率基本在20-50%之间，越是新品牌，佣金越高”。 而这些高昂的成本，在拼多多上，NOVO和柳丝木都无需承担。 另外一重费用的削减，则是减少了层层叠叠的分销商，借助平台，从工厂直达用户，也让其终端定价可以压到更低。 传统模式下，美妆产品的成本结构中，生产、研发等环节，占比其实是小头。无论是头部品牌，还是网红品牌，其研发费用占比，通常都在5%以下，生产和包装的合计成本，通常也仅为两三成左右。 因此，柳丝木和NOVO通过营销和渠道费用的缩减，大幅降低终端价格后，依然能保留合理的研发和生产费用，维持可靠品质。 “平价+品质”之下，无论是NOVO和柳丝木，都保持了高复购和高粘性，两个品牌的单店分别攒粉300万+和100万+。 其中，柳丝木美妆产品的整体用户复购率，更是高达15%，可以对比的是，知名美妆品牌毛戈平普通会员的平均复购率，也不过仅有5.87%。 综上，无论是NOVO，还是柳丝木，都依赖平价和相对安全的品质，带来了高复购和粘性用户，而极致的成本控制，又维持了持续的盈利能力，实现持续良性增长。 卷低价的电商，争抢产业带美妆 今年双11，各大电商平台，集体卷起最低价。 产业带美妆商家，也成了平台争相邀请的座上宾。 而如何把握平台，拿捏平台红利，则是产业带商家的必修课。 如今，NOVO在兜兜转转尝试了多个电商平台后，把主场放在了拼多多，“其他平台基本不玩了，聊胜于无。” NOVO对其他平台的心灰意冷，原因在于，后者马太效应过强，更愿意把流量和资源，倾斜到头部大牌，导致品牌不够响亮，同时投流营销费用有限的产业带商家，难有出头之机。 柳丝木品牌虽然多平台布局，但在整个线上大盘中，拼多多的贡献占比达到三成多，也是单一最大平台。 而产业带的中小商家们，想在拼多多出头，也有清晰路径，并非全靠不可琢磨的运气。 参与秒杀和百亿补贴，都是屡试不爽的捷径。 2020年，NOVO的起势就靠秒杀活动，后者在拼多多位居首页位置，流量极为可观，高性价比商品很容易在这里脱颖而出。 如今，NOVO日常也会参加秒杀活动，大概是日常售价的八折左右，“销量同比可以增三成左右”。 品牌属性更强的柳丝木，则同时参加秒杀和百亿补贴活动——今年11.11大促前三天，拼多多百亿补贴的用户就超过了6.2亿。 “平台补贴下，秒杀价大概是日常价的8.5折，参加一次秒杀，销量能提升三倍”，陈思强告诉《财经故事荟》。 为了加速发展，NOVO和柳丝木也会投流拉新，但横向对比来看，“拼多多的ROI(投入产出比)是最好的，算下来流量最便宜”。 目前，柳丝木营销费用投入最高的平台是抖音，但销量最高的依然是拼多多，“拼多多的投入产出成效，大概是抖音的两倍左右”。 更高效的转化效率，对于习惯了精打细算的中小商家更友好，也让其低价战略更具可持续性。 目前，柳丝木的抖音专供和线下专供的产品客单价，都要高于拼多多，“虽然克均价格一样，但规格更大”。 当下，电商平台集体卷起了低价，百亿补贴也成为行业标配。 不过，横向对比来看，拼多多常态化的平价心智，依然是最强的。 这从NOVO的全年销量分布中可见一斑，与其他平台的美妆大牌，618、双11可能贡献了全年两三成甚至三四成销量不同，NOVO双11期间的销量，也就比平时多了10-20%左右，“全年分布很均衡，不会忽高忽低”。 当增长无需过度依赖于大促节点，供应链保持了平稳，整体成本控制也更有优势。 无论是平台集体卷起低价，还是美妆用户消费越发理性，都给了柳丝木、NOVO更为强劲的信心。 虽然坚守平价，但NOVO在产品创新上，并不懈怠。 为了吃尽红利，NOVO店铺的SKU常年维持在千款左右，每月上线的新品SKU多达几十个，不断用平价新品去刺激消费。 而柳丝木的步子迈得更大，品牌意识也越来越强。 比如，为了保证品牌的独特调性和产品的高辨识度，在外包装上，柳丝木自主开发了专利私模，“就像那些大牌化妆品一样，看到瓶子和外观，就能识别品牌。” 与此同时，柳丝木已经开始尝试多品牌布局。 在规划中，未来柳丝木聚焦于护肤，而去年上线的新品牌安若花集则专注彩妆，后者上线面市才一年多，如今拼多多单店的累计销量已超过90万件。 作为数千万家中小商家的代表，柳丝木和NOVO，在维持平价普惠的同时，还能常态增长和盈利，或许故事不如网红品牌那般精彩刺激，但其模式更良性，也更具有可复制性。返回搜狐，查看更多",
    "originSummary": [
      "中国消费者越来越偏爱价格适中的美妆品牌，导致像雅诗兰黛这样的高端品牌的收入和利润下降。",
      "以广州的六十五为例，由于他们的高品质产品、较少的市场营销费用和吸引多元人群(包括学生和小城镇及大城市的居民)的特性，销售额显著上升。",
      "这种消费趋势的改变对于以往主导市场的高端品牌造成了影响。"
    ],
    "commentBody": "",
    "commentSummary": [
      "中國消費者越來越青睞價格實惠的美容品牌，導致如雅詩蘭黛等高端品牌的收入和利潤下降。",
      "而廣州一些實惠品牌，如六十五，由於提供高品質商品，營銷成本低且吸引了包括學生和來自小城市及大城市居民的不同人群，銷售大幅上升。",
      "這就是消費者需求和市場趨勢轉變對於各品牌的影響，也提醒著高端品牌必須調整策略以吸引更廣大的消費者。"
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699207922547
  },
  {
    "title": "\"股神\"沃伦·巴菲特领导的投资公司伯克希尔哈撒韦2023年第三季度亏损127.67亿美元，抵损因素为苹果股价下跌导致的投资收入240亿美元的下滑",
    "originLink": "https://www.yicai.com/video/101896293.html",
    "originBody": "首页 VIP 新闻 关注 视听 正在 一财号 直播 电视 ESG 图集 专题 数字报 首页 > 视听 > 此刻 “股神”也亏了：伯克希尔Q3财报出炉 投资亏损241亿美元 第一财经昨天 15:16 作者：视点 责编：陈东达 分享到： 北京时间11月4日，“股神”巴菲特旗下伯克希尔·哈撒韦，披露了2023年三季度财务报告。报告显示，伯克希尔三季度净亏损127.67亿美元，由于其持有的苹果股价下跌，投资收益在第三季度出现了241亿美元的巨额亏损。这也是伯克希尔今年来首度季报亏损。 伯克希尔表示，经营业务受到地缘政治冲突发展、供应链中断和政府减缓通胀行动的影响，并重申，任何特定季度的投资损益金额通常毫无意义，由此得出的每股净利润数据可能会让对会计规则知之甚少、或一无所知的投资者产生极大误导。 截至9月30日，伯克希尔大约78%的股权投资公允价值集中在五家公司，五只股票较上季度并未发生变化，依然是苹果、美国银行、美国运通、可口可乐、雪佛龙。其中，对美国运通持股市值226亿美元，对苹果持股市值1568亿美元，美国银行283亿美元，可口可乐224亿美元，雪佛龙186亿美元。 “股神”也亏了：伯克希尔Q3财报出炉 投资亏损241亿美元。点击视频，一看究竟！ 文章作者 视点 关键字 巴菲特伯克希尔·哈撒韦 相关视频 00'35'' 芒格捐赠77股伯克希尔股票 价值高达4045万美元 10-09 13:14 00'46'' 巴菲特新买入3只房地产股 高瓴建仓游戏巨头减持拼多多 08-16 11:56 01'29'' 伯克希尔哈撒韦现金储备接近历史最高水平 08-07 22:36 02'03'' 巴菲特半年“炒股”赚476亿美元 伯克希尔总资产破万亿｜刘婧视点 08-07 10:57 02'15'' 伯克希尔哈撒韦业绩全面超预期 二季度炒股赚242亿美元 苹果功不可没 巴菲特的投资变化有何启示？| 从华尔街到陆家嘴 08-07 09:25 一财最热 发表评论 还没有评论，快来抢沙发吧！ 第一财经客户端 第一财经电视 第一财经日报 第一财经杂志YiMagazine Yicai Global 一财全球 第一财经研究院 一财商学院 新一线·知城数据平台 DT实验室 第一财经商业数据中心 东方财经·浦东 有看投+ 应帆科技 第一财经陆家嘴 第一财经公益基金会 第一财经可持续商业研究中心 第一财经 APP 第一财经 日报微博 第一财经 微信服务号 第一财经 微信订阅号 第一财经 抖音官方账号 打开抖音扫一扫 第一财经 微信视频号 广告联系 法律声明 关于我们 上海市市场监督管理局 国家网信办举报中心 上海互联网举报中心 友情链接 沪ICP备14015572号-2互联网新闻信息服务许可证：31120180001互联网视听节目服务(AVSP):沪备2014002沪公安网备31010602000015号 版权所有 上海第一财经传媒有限公司意见反馈邮箱：yonghu@yicai.com 客服热线：400-6060101 违法和不良信息举报电话：400-6060101转6 技术支持 上海第一财经技术中心技术合作：直播合作：百视通",
    "originSummary": [
      "2023年第三季度，由“股神”沃伦·巴菲特领导的投资公司伯克希尔·哈撒韦报告了127.67亿美元的净亏损。",
      "这次亏损的主要因素是苹果股价下跌导致的241亿美元投资收入滑坡。",
      "尽管如此，伯克希尔强调，任何一季度的投资收益或亏损的货币价值都不应被视为公司总体业绩的指标。该公司78%的公允价值股票投资集中在五家公司：苹果，美国运通，美国银行，可口可乐，和雪佛龙。"
    ],
    "commentBody": "",
    "commentSummary": [
      "2023年第三季度，由“股神”沃伦·巴菲特领导的投资公司伯克希尔哈撒韦报告了127.67亿美元的净损失。",
      "造成这种亏损的主要因素是苹果股价下跌导致的241亿美元投资收入下滑。",
      "尽管出现了损失，但伯克希尔强调，任何一个季度的投资收益或损失的货币价值都不应作为判断全面绩效的指标。该公司78%的公平价值股票投资集中在五家公司：苹果、美国运通、美国银行、可口可乐和雪佛龙。"
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699207922547
  },
  {
    "title": "无法生成标题，该文本无关技术新闻。",
    "originLink": "https://cn.yna.co.kr/view/ACK20231105000200881",
    "originBody": "济州25 ℃CAI 一般 60",
    "originSummary": [
      "济州岛的天气为25°C。",
      "综合空气质量指数(CAI)为60，一般来说是可接受的。"
    ],
    "commentBody": "",
    "commentSummary": [
      "济州的天气是25°C，综合空气质量指数(CAI)为60，总体上是可以接受的。"
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699207922547
  },
  {
    "title": "李佳琦公司被曝光涉丑闻：90后员工涉嫌贪污百万，公司表态零容忍及已向公安机关报案",
    "originLink": "https://finance.jrj.com.cn/2023/11/05165038269371.shtml",
    "originBody": "登录/注册 首 页 行 情 爱投顾 下 载 财 经 股 票 基 金 银 行 保 险 科 技 医 药 美 股 视 频 盈利宝 更 多 7*24小时AI电报 大盘云图 涨跌停温度计 板块行情 龙虎榜 A股头条 市况直击 机会情报 每日财经热点 涨跌停揭秘 研报精选 大公司动态 公告集锦 晚间要闻盘点 主力资金 龙虎榜 打新必读 90后贪污百万，李佳琦公司被曝选品流程贪腐！业内人士称有品牌方默许勾兑 2023-11-05 16:50:10 来源： 蓝鲸财经记者工作平台 分享到: 近日，李佳琦公司美腕被曝选品流程贪腐，有90后招商专员在两年内贪腐超百万。 11月4日深夜，美腕官方就此做了紧急回应称，公司对商业活动中的腐败行为“零容忍”。美腕系被害单位，其于2022年获得相关线索后先进行公司内查，后向公安机关报案。 员工借马甲公司等方式贪腐百万，系业内常见手段 据上海市高级人民法院官网公布的刑事判决书，2020年7月至2022年9月，被告人周某在担任美ONE招商专员期间利用商务合作谈判、商品选送、合同签订、排期沟通的职务便利侵占公司费用55万元。 具体操作方式是和他人合谋虚设上海琼星文化传媒工作室，借此中间环节向美学公司提供代理服务。北京京师(杭州)律师事务所连润民律师告诉蓝鲸记者，类似员工职务侵占、非公受贿行为在直播电商领域并不少见，美腕此案只是冰山一角。 常见贪腐手段之一就是“业务转包”，成立马甲公司签高价合同，马甲公司再和业务公司签低价格合同赚差价。案中的“上海琼星”就是一家马甲公司，琼星向品牌方收取的费用是要高于美腕本身开价的。 此外，品牌方直接给好处费、返点费用也是一种常见的勾兑方式。本案中，周某在两年间利用其职务便利提供商品选送、直播排期等帮助，多次收受广州某公司相关人员送的好处费共计109万元。律师提醒称，这种方式更多是个人犯案，相对偶然、间歇，前述成立马甲公司的手段则一般涉及团队犯罪。 美腕在声明中表示，涉事员工行为明确违法且严重违反公司员工手册及管理规章制度，公司在其被采取强制措施后随即解除了劳动合同。 该受害单位还提醒称，美腕招商选品流程不存在绿色通道，未授权任何第三方公司、个人或机构开展直播招商代理业务。 部分老板默许勾兑，行业贪腐水深企业治理成本高 实际上，美腕此案并不是直播电商行业第一桩被公开的员工贪腐案例。 2021年11月，杭州盛珩文化被曝有员工因贪腐300万被开除并被采取刑事拘留措施。据南方都市报报道，盛珩文化系网红主播雪梨所在公司宸帆的直播代运营机构。犯案人员是雪梨直播团队滋补品类的招商人员，而滋补品类曾是雪梨直播间的优势直播品类。 这桩贪腐案件在当时曾引起一时讨论，被认为是直播电商狂飙猛进的一个缩影。随后两年，行业继续狂奔不止。 深耕电商领域的连润民律师透露称，受限于资源有限、信息不对称等原因，包括品牌方老板在内的很多人会默许勾兑发生。某种程度上来说，“信息不对称已经成为一门生意，那么它就是有市场的。” 在品牌和业务公司之外，平台工作人员可能也会借助对规则、活动的了解钻空牟利。尽管这些行为触犯法律，但通常可以通过一些方式隐蔽犯罪行为，比如不关联企业、不过自己的账户。 任何有油水的环节都可能滋生腐败，直播电商行业的特殊又在哪呢？律师分析称，电商从业人员复杂、素质良莠不齐，其对于潜规则的接受度较高，整体合规意识也有待增强。此外该行业近年来狂飙猛进，“赚的都是风口上的热钱”。 而针对贪腐，企业的治理成本往往是极高的。多数贪腐行为不是孤立的，利益盘根错节太深，很多时候都是不了了之。业内人士透露称，以本案中的招商角色为例，公司是否姑息往往取决于该员工在公司的地位作用以及企业是否有把柄在其手中。业内甚至有一些人，会在油水捞尽的情况下换个下家继续捞金。 相对大一点的公司或者传统企业，会在内部设立专门的稽查部或者廉正部。如果将视野放大到掌控流量的互联网领域，反腐其实一直是大厂们的重点工作。早在2010年，阿里就成立了廉正部专门打击腐败等严重违规行为；百度、腾讯、京东也是较早掀起反贪风暴的企业。 2019年被视为互联网行业反腐风暴的开端。 据南方都市报报道，这一年里苏宁、拼多多、京东、美团、阿里等18家企业共曝出超过190起反腐案件，超过400位员工被开除或移送司法机关调查。销售、渠道、市场、运营以及商务拓展等为反腐重灾区，其高频行为包括受贿、职务侵占、牟取私利、虚报费用等。 电商行业显然是反腐整治最关键的领域之一。有业内人士指出，现阶段靠企业自发治理贪腐很难，通过报案维权的成本也不低。一个行业的问题，必然需要国家层面的规范和引导。 责任编辑：张振江 精彩推荐 加载更多 发布 全部评论 机会情报 低轨卫星语音和可视电话取得最新进展 商业化望再提速 2023中国稀土论坛召开 万物电驱推动稀士需求增长 减肥药双雄业绩大超预期！减重类药物市场空间广阔，有望诞生“全球药王”，国内市场爆发在即 开源鸿蒙技术大会将开 系统生态建设再进一步 四部门联手发文 推动“以竹代塑”高质量发展 人形机器人重磅文件出炉，推动人形机器人创新发展，产业链迎来重大发展机遇 小米14首销一鸣惊人，打破所有国产手机纪录，消费电子正迎来AI创新和需求回暖共振 电动自行车新标准实施 行业集中度有望提升 特斯拉加大招聘力度 人形机器人行走测试在即 枯水期停产来临，云南电解铝减产再起，铝价或具上行动能 关于金融界 商业合作 联系我们 网站地图 服务协议 隐私政策 金融界APP 金融界公众号 金融界股灵通 金融界视频号 Copyright © 2023 JRJ.COM All Rights Reserved.违法和不良信息/未成年人保护：举报电话：010-83363200举报邮箱：jiankong@jrj.com.cn 京公网安备11010602200782号京ICP证010031号京金信备〔2021〕2号广播电视节目制作经营许可证(京)字第854号增值电信业务经营许可证信息网络传播视听节目许可证0110554",
    "originSummary": [
      "中国领先的直播销售员李佳琦的公司被腐败丑闻打击。一位90后投资专家被发现在两年内挪用了超过一百万元。",
      "该公司紧急回应，宣布对其商业活动中的腐败行为“零容忍”，并已向公安机关报告此事。"
    ],
    "commentBody": "",
    "commentSummary": [
      "中国领先的直播销售员李佳琦的公司受到一场腐败丑闻的影响，一位90后的投资专家被发现在两年内贪污了超过一百万元。",
      "公司紧急回应，对其商业活动中的腐败行为表示“零容忍”，并已向公安机关报告了此事。",
      "这起事件是李佳琦的公司首次公开面对腐败丑闻，引发了大量的公众关注和讨论。"
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699207922547
  }
]
