[
  {
    "id": 40931636,
    "title": "Cientistas descobrem uma causa do lúpus e uma possível maneira de revertê-lo",
    "originLink": "https://news.feinberg.northwestern.edu/2024/07/10/scientists-discover-a-cause-of-lupus-and-a-possible-way-to-reverse-it/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40931636",
    "commentBody": "",
    "originSummary": [
      "Cientistas da Northwestern Medicine e do Brigham and Women’s Hospital identificaram um defeito molecular no lúpus eritematoso sistêmico (lúpus) envolvendo a ativação insuficiente do receptor de hidrocarboneto aril (AHR).",
      "Reativar o AHR em amostras de sangue de pacientes com lúpus converteu células T auxiliares periféricas prejudiciais em células Th22, que podem ajudar na cicatrização de feridas e oferecer novas vias de tratamento.",
      "As descobertas, publicadas na Nature, sugerem novos tratamentos potenciais para lúpus sem os efeitos colaterais das terapias atuais, apoiados por bolsas do NIH e outras organizações."
    ],
    "commentSummary": [
      "Cientistas identificaram a via do receptor de hidrocarboneto aril (AHR) como uma causa potencial do lúpus e um método para revertê-lo, o que pode levar a novos tratamentos.",
      "A pessoa com lúpus relatou ter alcançado a remissão por meio de mudanças na dieta, especificamente eliminando carne e focando em vegetais folhosos crus.",
      "A descoberta destaca o papel significativo da dieta e da saúde intestinal no manejo de condições autoimunes, provocando discussões entre indivíduos com problemas de saúde semelhantes."
    ],
    "points": 693,
    "commentCount": 149,
    "retryCount": 0,
    "time": 1720646689
  },
  {
    "id": 40934924,
    "title": "As Fontes Tipográficas de Wall·E (2018)",
    "originLink": "https://typesetinthefuture.com/2018/12/04/walle/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40934924",
    "commentBody": "",
    "originSummary": [
      "WALL·E equilibra temas de distopia consumista e otimismo da corrida espacial dos anos sessenta, oferecendo uma perspectiva única de um futuro robótico.",
      "As características do filme incluem elementos de design detalhados, como a tipografia Gunship e o logotipo da BnL, além de inúmeras referências a clássicos de ficção científica e atrações da Disney.",
      "WALL·E’s journey and the Axiom’s design are influenced by real-world aesthetics and technology, including Apple’s sleek design and nods to iconic sci-fi elements like HAL from 2001: A Space Odyssey."
    ],
    "commentSummary": [
      "Este artigo oferece uma análise cultural aprofundada do filme Wall·E, abordando tipografia, arquitetura, estilos de arte, cinema e música, com inúmeros links e imagens de referência.",
      "A discussão destaca os detalhes intrincados em Wall·E que a maioria dos espectadores pode não perceber, enfatizando o impacto desses elementos na narrativa e na sensação do filme.",
      "A menção às Fontes Iconian, criadas por um hobbyista que é advogado de transações comerciais, e como suas fontes foram usadas em grandes franquias de filmes, é um ponto notável."
    ],
    "points": 368,
    "commentCount": 51,
    "retryCount": 0,
    "time": 1720690134
  },
  {
    "id": 40932492,
    "title": "Dut – um calculador rápido de uso de disco para Linux",
    "originLink": "https://codeberg.org/201984/dut",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40932492",
    "commentBody": "",
    "originSummary": [
      "Dut\" é um calculador de uso de disco multi-thread escrito em C, projetado para ser mais rápido do que ferramentas existentes como \"du\" quando os caches do Linux estão aquecidos.",
      "Melhorias chave de desempenho incluem o uso das chamadas de sistema fstatat(2) e statx(2), e getdents(2) para conteúdos de diretório, resultando em aumentos significativos de velocidade.",
      "‘dut’ apresenta uma leitura mais intuitiva inspirada no ncdu, e a instalação envolve compilar um único arquivo fonte e colocá-lo no seu caminho."
    ],
    "commentSummary": [
      "\"Dut\" é um calculador de uso de disco de alto desempenho e multithread para Linux, escrito em C, projetado para superar ferramentas tradicionais como \"du\" quando os caches do Linux estão aquecidos.",
      "Ele exibe uma árvore dos maiores itens no diretório atual, incluindo tamanhos de links físicos, e utiliza técnicas avançadas como fstatat(2), statx(2) e getdents(2) para desempenho aprimorado.",
      "Instalação é simples, exigindo o download e a compilação de um único arquivo fonte, e fornece uma visão geral rápida e não interativa do uso do disco."
    ],
    "points": 321,
    "commentCount": 126,
    "retryCount": 0,
    "time": 1720654196
  },
  {
    "id": 40933110,
    "title": "Princípios de engenharia para a construção de sistemas financeiros",
    "originLink": "https://substack.wasteman.codes/p/engineering-principles-and-best-practices",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40933110",
    "commentBody": "",
    "originSummary": [
      "Este post no blog discute as melhores práticas e princípios para criar sistemas financeiros baseados em software que sejam precisos e confiáveis, com base na experiência do autor em grandes empresas de tecnologia.",
      "Os principais princípios de engenharia incluem imutabilidade e durabilidade, representação do menor grão e idempotência, garantindo precisão, auditabilidade e pontualidade dos dados.",
      "Melhores práticas destacadas são o uso de inteiros para valores financeiros, metodologias consistentes de arredondamento, adiamento da conversão de moeda e uso de representações inteiras de tempo."
    ],
    "commentSummary": [
      "Princípios de engenharia fundamentais para sistemas financeiros incluem arredondamento consistente, representação precisa do tempo e tratamento cuidadoso dos segundos intercalares.",
      "Os sistemas financeiros devem usar bancos de dados relacionais para conformidade com ACID e precisão, e adiar a conversão de moeda para evitar perda de precisão.",
      "Testes extensivos, interfaces de usuário intuitivas e gestão cuidadosa dos identificadores de transações são cruciais para a precisão e conformidade em sistemas financeiros."
    ],
    "points": 271,
    "commentCount": 66,
    "retryCount": 0,
    "time": 1720662466
  },
  {
    "id": 40934495,
    "title": "Segundo Fator SMS: Pior do Que Sua Reputação",
    "originLink": "https://www.ccc.de/en/updates/2024/2fa-sms",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40934495",
    "commentBody": "",
    "originSummary": [
      "Pesquisadores de segurança do CCC acessaram mais de 200 milhões de mensagens SMS contendo senhas de uso único de mais de 200 empresas, destacando vulnerabilidades no 2FA-SMS.",
      "Os CCC demonstraram que os provedores de serviços que enviam 2FA-SMS podem acessar e potencialmente vazar essas mensagens, como visto com a IdentifyMobile, que expôs senhas únicas em tempo real online.",
      "Recomendações incluem o uso de senhas únicas geradas por aplicativos ou tokens de hardware para melhor segurança, já que o 2FA-SMS continua suscetível a ataques como troca de SIM e exploração de SS7."
    ],
    "commentSummary": [
      "Um amigo da família foi alvo de um ataque de phishing através de um site falso de \"login do BANKNAME\" anunciado no Google, resultando em uma transação fraudulenta.",
      "A ocorrência destaca que, embora a autenticação de dois fatores (2FA) baseada em aplicativos seja geralmente mais segura, a 2FA via SMS poderia ter sido mais eficaz neste caso devido às suas mensagens específicas de ação.",
      "A discussão enfatiza a necessidade de sistemas 2FA que gerem tokens específicos para diferentes transações e a importância de usar bloqueadores de anúncios e melhores práticas de segurança para prevenir tais golpes."
    ],
    "points": 245,
    "commentCount": 214,
    "retryCount": 0,
    "time": 1720683869
  },
  {
    "id": 40935971,
    "title": "Microsoft cortando ligação crucial com Gaza, dizem palestinos",
    "originLink": "https://www.bbc.com/news/articles/cger582weplo",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40935971",
    "commentBody": "",
    "originSummary": [
      "Palestinos acusam a Microsoft de fechar injustamente suas contas de e-mail, impactando o acesso a serviços essenciais como bancos, ofertas de emprego e Skype, cruciais para a comunicação em meio à campanha militar israelense.",
      "Microsoft cita violações de seus termos de serviço, uma alegação contestada pelos usuários afetados, que suspeitam de associação indevida com o Hamas ou atividade fraudulenta suspeita.",
      "Indivíduos como Eiad Hametto, Salah Elsadi e Khalid Obaied relatam interrupções significativas em seu trabalho e na comunicação familiar, levando a frustração e desconfiança em relação à Microsoft."
    ],
    "commentSummary": [
      "Microsoft restringiu o acesso ao Skype e Hotmail para palestinos em Gaza, provocando acusações de cumplicidade no 'cerco completo' de Israel.",
      "Os usuários não conseguem contatar a família ou acessar contas bancárias vinculadas aos seus endereços do Hotmail, levantando preocupações sobre o impacto nos serviços essenciais.",
      "A ocorrência destaca a questão mais ampla do controle das empresas de tecnologia sobre serviços críticos e a possível necessidade de plataformas mais abertas e descentralizadas em zonas de conflito."
    ],
    "points": 216,
    "commentCount": 134,
    "retryCount": 0,
    "time": 1720701064
  },
  {
    "id": 40932006,
    "title": "Uma abundância de Katherines: A teoria dos jogos na escolha de nomes para bebês",
    "originLink": "https://arxiv.org/abs/2404.00732",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40932006",
    "commentBody": "",
    "originSummary": [
      "A dissertação intitulada 'Uma Abundância de Katherines: A Teoria dos Jogos na Escolha de Nomes de Bebês' explora a natureza competitiva da escolha de nomes de bebês utilizando a teoria dos jogos, assumindo que os pais escolhem nomes com base na exclusividade.",
      "A pesquisa emprega um modelo claro e manejável e estende sua análise com experimentos numéricos e ferramentas de modelos de linguagem grandes, fornecendo insights e direções para pesquisas futuras.",
      "Aceito no SIGBOVIK 2024, o artigo está categorizado em Ciência da Computação e Teoria dos Jogos (cs.GT) e Computadores e Sociedade (cs.CY)."
    ],
    "commentSummary": [
      "Um artigo humorístico intitulado 'Uma Abundância de Katherines: A Teoria dos Jogos na Escolha de Nomes de Bebês' explora a popularidade e o processo de seleção de nomes derivados de Katherine.",
      "A dissertação, provavelmente submetida para o Dia da Mentira, utiliza referências recursivas, piadas e suposições lúdicas para discutir tendências de nomes, influências culturais e os desafios de escolher nomes que sejam únicos, mas ainda tradicionais.",
      "As autoras, todas com nomes semelhantes, fazem observações espirituosas e inteligentes, tornando o artigo tanto divertido quanto perspicaz."
    ],
    "points": 213,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1720649321
  },
  {
    "id": 40934898,
    "title": "Maioria dos sites e aplicativos usam padrões obscuros no marketing de assinaturas",
    "originLink": "https://icpen.org/news/1360",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40934898",
    "commentBody": "",
    "originSummary": [
      "A varredura global na internet realizada pelo ICPEN descobriu que 75,7% dos 642 sites e aplicativos móveis usavam pelo menos um dark pattern, com 66,8% usando dois ou mais.",
      "Os padrões obscuros são práticas online enganosas que manipulam as escolhas dos consumidores, como armadilhas de renovação automática e interferência na interface.",
      "As varreduras, conduzidas por 27 autoridades de proteção ao consumidor de 26 países, destacam a interseção entre proteção ao consumidor e privacidade, com relatórios detalhados disponíveis online."
    ],
    "commentSummary": [
      "Vários sites e aplicativos utilizam padrões obscuros para incentivar assinaturas, levando a problemas como perda de acesso à conta, cobranças inesperadas e assinaturas esquecidas.",
      "Soluções como cartões de débito virtuais, ferramentas centralizadas de gestão de assinaturas e pagamento por fatura podem ajudar a mitigar esses problemas.",
      "Há um apelo crescente por legislação que exija processos de cancelamento fáceis para melhor proteger os consumidores dessas práticas enganosas."
    ],
    "points": 207,
    "commentCount": 222,
    "retryCount": 0,
    "time": 1720689812
  },
  {
    "id": 40930549,
    "title": "Grande Bola de Lama (1999)",
    "originLink": "http://laputan.org/mud/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40930549",
    "commentBody": "",
    "originSummary": [
      "A arquitetura de software 'Big Ball of Mud' é caracterizada por sua estrutura caótica e expedita, mas continua prevalente devido à sua eficácia em certos contextos.",
      "A pesquisa identifica padrões como \"Código Descartável,\" \"Crescimento Gradual\" e \"Camadas de Cisalhamento\" que contribuem para a formação de tais sistemas.",
      "Compreender as forças como restrições de tempo, custo e complexidade que impulsionam a criação de sistemas \"Big Ball of Mud\" pode ajudar no desenvolvimento de arquiteturas de software mais duráveis e elegantes."
    ],
    "commentSummary": [
      "A discussão gira em torno do conceito de \"Big Ball of Mud\" (BBoM), um termo usado para descrever um sistema de software sem uma arquitetura clara, frequentemente resultante de remendos contínuos e falta de refatoração.",
      "Alguns participantes argumentam que trabalhar no BBoM pode ser administrável e até 'tranquilo' se alguém apenas busca cumprir responsabilidades profissionais, enquanto outros acham isso desanimador e insatisfatório.",
      "As conversas destacam os trade-offs entre manter um BBoM para correções rápidas e os benefícios a longo prazo de refatoração e código limpo, com exemplos de várias indústrias como bancária e de jogos."
    ],
    "points": 151,
    "commentCount": 128,
    "retryCount": 0,
    "time": 1720639772
  },
  {
    "id": 40935576,
    "title": "Se os chatbots de IA são o futuro, eu odeio isso",
    "originLink": "https://www.jeffgeerling.com/blog/2024/if-ai-chatbots-are-future-i-hate-it",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40935576",
    "commentBody": "",
    "originSummary": [
      "Um usuário da AT&T Fiber Internet experimentou uma queda significativa na velocidade de ~1 Gbps para 8 Mbps, provocando frustração e uma ligação para o suporte ao cliente.",
      "Usuário teve dificuldades com o chatbot de IA da AT&T, que confundiu 'WiFi' com 'Internet', e enfrentou respostas pouco úteis de um representante humano.",
      "As questões destacam problemas contínuos com o suporte ao cliente dos provedores de internet e as limitações dos chatbots de IA atuais em resolver problemas técnicos de forma eficaz."
    ],
    "commentSummary": [
      "A tendência de usar chatbots de IA para atendimento ao cliente é criticada por distanciar os clientes da interação humana, o que alguns acreditam demonstrar uma falta de cuidado por parte das empresas.",
      "Autor argumenta que, embora os chatbots de IA possam ser úteis, muitas implementações atuais são mal projetadas e frustrantes, destacando a necessidade de um equilíbrio entre o suporte de IA e humano.",
      "A ênfase está na importância do suporte ao cliente, sugerindo que priorizar lucros de curto prazo em detrimento da experiência do cliente é míope e prejudicial ao sucesso a longo prazo."
    ],
    "points": 149,
    "commentCount": 169,
    "retryCount": 0,
    "time": 1720698063
  },
  {
    "id": 40935701,
    "title": "Binance construiu um serviço de log de 100PB com Quickwit",
    "originLink": "https://quickwit.io/blog/quickwit-binance-story",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40935701",
    "commentBody": "",
    "originSummary": [
      "Binance migrou com sucesso do Elasticsearch para o Quickwit, escalando sua indexação de logs para 1,6 PB por dia e gerenciando um cluster de busca de logs de 100 PB.",
      "A migração resultou em uma redução de 80% nos custos de computação e uma redução de 20x nos custos de armazenamento, melhorando significativamente a retenção de logs e as capacidades de resolução de problemas.",
      "Os fatores chave para resolver os desafios de gerenciamento de logs da Binance foram a integração nativa do Quickwit com Kafka, as transformações VRL embutidas e o uso de armazenamento de objetos."
    ],
    "commentSummary": [
      "Binance desenvolveu um serviço de log de 100PB (petabyte) usando Quickwit, destacando a necessidade de armazenamento extensivo de logs em organizações financeiras para conformidade regulatória.",
      "Há um debate sobre a utilidade de logs versus métricas, com as métricas sendo vistas como mais eficazes para monitorar a saúde do sistema e os logs para diagnosticar problemas específicos.",
      "A discussão destaca a importância de equilibrar os custos de armazenamento, a gestão eficiente de logs e as políticas de retenção no manuseio de dados de logs em grande escala."
    ],
    "points": 147,
    "commentCount": 117,
    "retryCount": 0,
    "time": 1720699047
  },
  {
    "id": 40934582,
    "title": "A Superengenharia do Currículo com Zola, JSON Resume, Weasyprint e Nix (2023)",
    "originLink": "https://ktema.org/articles/the-overengineered-resume/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40934582",
    "commentBody": "",
    "originSummary": [
      "Ao autor, David Reed, descreve uma abordagem excessivamente complexa para manter um currículo, focando na separação de conteúdo e apresentação, controle de versão e múltiplos formatos de saída.",
      "Ferramentas utilizadas incluem JSON Resume para representação de dados, o motor de templates Tera do Zola para criação de templates, Weasyprint para renderização de PDF e NixOS para configuração do ambiente e gerenciamento de dependências.",
      "Continuous integration é alcançada usando GitHub Actions para automatizar a renderização de PDFs em commits, garantindo que o currículo esteja sempre atualizado sem intervenção manual."
    ],
    "commentSummary": [
      "A discussão no Hacker News explora a tendência de superengenharia de currículos usando ferramentas como Zola, JSON Resume, Weasyprint e Nix, com alguns usuários defendendo o uso de LaTeX devido à sua modularidade e consistência.",
      "Alternativas como Typst e JSON Resume são mencionadas por sua configuração mais fácil e melhor tratamento de erros, enquanto métodos mais simples como Google Docs ou LibreOffice também são preferidos por alguns.",
      "Há um consenso de que, embora exagerar na elaboração de currículos possa ser divertido, o conteúdo do currículo é, em última análise, mais crucial do que sua apresentação, especialmente considerando os desafios da análise automatizada de currículos pelos ATS (Sistemas de Rastreamento de Candidatos)."
    ],
    "points": 130,
    "commentCount": 76,
    "retryCount": 0,
    "time": 1720685198
  },
  {
    "id": 40935154,
    "title": "Core Oryon da Qualcomm: Muito tempo em desenvolvimento",
    "originLink": "https://chipsandcheese.com/2024/07/09/qualcomms-oryon-core-a-long-time-in-the-making/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40935154",
    "commentBody": "",
    "originSummary": [
      "Os núcleos Oryon da Qualcomm, desenvolvidos a partir da tecnologia da Nuvia, marcam o retorno da Qualcomm ao design interno de SoCs para smartphones após oito anos, estreando no Snapdragon X Elite.",
      "A Snapdragon X1E-80-10 possui 12 núcleos Oryon em três clusters de quatro núcleos, cada um com um cache L2 de 12 MB, e apresenta uma arquitetura avançada com alta capacidade de reordenação e tradução de endereços eficiente.",
      "Qualcomm enfrenta desafios para superar problemas de compatibilidade e altos custos de dispositivos para competir com AMD e Intel, necessitando de colaboração com OEMs para oferecer preços competitivos e melhorar a compatibilidade de software."
    ],
    "commentSummary": [
      "Os núcleos Oryon da Qualcomm estão em desenvolvimento há muito tempo, gerando um interesse significativo na comunidade tecnológica.",
      "A discussão destaca o chip M4 no iPad da Apple, conhecido por seu alto desempenho de núcleo único, mas criticado por ser subutilizado devido ao sistema operacional restritivo do iPad.",
      "As discussões giram em torno da utilidade de chips poderosos em plataformas fechadas como o iPad versus sistemas mais abertos como macOS ou Linux, que podem aproveitar esse hardware para uma gama mais ampla de aplicações profissionais e técnicas."
    ],
    "points": 129,
    "commentCount": 101,
    "retryCount": 0,
    "time": 1720693028
  },
  {
    "id": 40935443,
    "title": "Adolescentes que recebem smartphones mais cedo tornam-se adultos com pior saúde mental (2023)",
    "originLink": "https://www.afterbabel.com/p/sapien-smartphone-report",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40935443",
    "commentBody": "",
    "originSummary": [
      "A pesquisa global da Sapien Labs indica que crianças que recebem smartphones em uma idade mais jovem tendem a ter uma saúde mental pior na vida adulta, com um efeito mais forte observado em meninas.",
      "As pesquisas, envolvendo quase um milhão de participantes, mostram um padrão consistente em diferentes regiões e idiomas, ligando o uso precoce de smartphones a uma pior saúde mental na juventude.",
      "As pesquisas sugerem que o aumento da exposição às redes sociais e o vício em telefones podem contribuir para esses problemas de saúde mental, instando pais, educadores e formuladores de políticas a reconsiderarem a idade apropriada para as crianças receberem smartphones."
    ],
    "commentSummary": [
      "As postagens discutem o impacto do uso precoce de smartphones na saúde mental das crianças, com opiniões divergentes sobre sua gravidade.",
      "Alguns argumentam que, embora os smartphones e as redes sociais possam aumentar a ansiedade e a depressão, os efeitos não são universalmente catastróficos e variam de acordo com a região.",
      "Céticos destacam a necessidade de estudos mais rigorosos e revisados por pares para estabelecer a causalidade e abordar possíveis vieses de confirmação nas pesquisas existentes."
    ],
    "points": 119,
    "commentCount": 89,
    "retryCount": 0,
    "time": 1720696587
  },
  {
    "id": 40930983,
    "title": "As resenhas de livros do NYT são tudo o que a crítica literária não deveria ser",
    "originLink": "https://www.currentaffairs.org/news/new-york-times-book-review",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40930983",
    "commentBody": "",
    "originSummary": [
      "Yasmin Nair critica a NYT Book Review por não se envolver seriamente com livros e a indústria editorial, tornando-se insípida e relutante em expressar opiniões.",
      "Os comentários perpetuam tendências prejudiciais, como a tokenização de escritores não brancos e o foco nas cinco grandes editoras, reforçando a desigualdade material na publicação.",
      "Nair pede uma nova abordagem para a crítica literária que considere a economia da publicação e apoie uma gama mais ampla de vozes, destacando os efeitos negativos a longo prazo das práticas atuais da Review na cultura dos livros."
    ],
    "commentSummary": [
      "As críticas ao NYT Book Review frequentemente apontam que ele é insípido, excessivamente comercial e parte do complexo MFA-publicação, o que leva muitos na comunidade literária a não levá-lo a sério.",
      "Alternativas como a New York Review of Books (NYRB) e a London Review of Books (LRB) são elogiadas por oferecerem ensaios mais perspicazes, enquanto revistas menores e subreddits proporcionam discussões animadas e recomendações.",
      "Percebe-se que a lista de mais vendidos do NYT é tendenciosa e manipulada, contribuindo para a visão de que a NYT Book Review carece de profundidade e originalidade em comparação com outras fontes de resenhas literárias."
    ],
    "points": 111,
    "commentCount": 92,
    "retryCount": 0,
    "time": 1720642086
  }
]
