[
  {
    "id": 40931636,
    "title": "वैज्ञानिकों ने ल्यूपस के एक कारण की खोज की, इसे उलटने का संभावित तरीका भी खोजा",
    "originLink": "https://news.feinberg.northwestern.edu/2024/07/10/scientists-discover-a-cause-of-lupus-and-a-possible-way-to-reverse-it/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40931636",
    "commentBody": "",
    "originSummary": [
      "नॉर्थवेस्टर्न मेडिसिन और ब्रिघम एंड विमेन्स हॉस्पिटल के वैज्ञानिकों ने प्रणालीगत ल्यूपस एरिथेमेटोसस (ल्यूपस) में एक आणविक दोष की पहचान की है, जिसमें एरिल हाइड्रोकार्बन रिसेप्टर (AHR) की अपर्याप्त सक्रियता शामिल है।",
      "लुपस रोगियों के रक्त नमूनों में AHR को पुनः सक्रिय करने से हानिकारक T परिधीय सहायक कोशिकाएं Th22 कोशिकाओं में परिवर्तित हो गईं, जो घाव भरने में सहायता कर सकती हैं और नए उपचार के मार्ग प्रदान कर सकती हैं।",
      "नेचर में प्रकाशित निष्कर्षों से पता चलता है कि वर्तमान उपचारों के दुष्प्रभावों के बिना ल्यूपस के लिए संभावित नए उपचार हो सकते हैं, जो NIH अनुदानों और अन्य संगठनों द्वारा समर्थित हैं।"
    ],
    "commentSummary": [
      "वैज्ञानिकों ने एरिल हाइड्रोकार्बन रिसेप्टर (AHR) मार्ग को ल्यूपस के संभावित कारण और इसे उलटने के एक तरीके के रूप में पहचाना है, जो नए उपचारों का मार्ग प्रशस्त कर सकता है।",
      "लुपस से पीड़ित एक व्यक्ति ने बताया कि उसने आहार में बदलाव करके, विशेष रूप से मांस को हटाकर और कच्ची पत्तेदार सब्जियों पर ध्यान केंद्रित करके, रोग को शमन में लाने में सफलता प्राप्त की।",
      "यह खोज आहार और आंत स्वास्थ्य की महत्वपूर्ण भूमिका को उजागर करती है जो स्व-प्रतिरक्षित स्थितियों के प्रबंधन में सहायक हो सकती है, और इसी तरह की स्वास्थ्य समस्याओं वाले व्यक्तियों के बीच चर्चाओं को प्रोत्साहित करती है।"
    ],
    "points": 693,
    "commentCount": 149,
    "retryCount": 0,
    "time": 1720646689
  },
  {
    "id": 40934924,
    "title": "वॉल·ई का टाइपसेट (2018)",
    "originLink": "https://typesetinthefuture.com/2018/12/04/walle/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40934924",
    "commentBody": "",
    "originSummary": [
      "WALL·E उपभोक्तावादी डिस्टोपिया और साठ के दशक की अंतरिक्ष दौड़ की आशावादिता के विषयों को संतुलित करता है, एक अनूठा रोबोटिक भविष्य दृष्टिकोण प्रस्तुत करता है।",
      "फिल्म में विस्तृत डिज़ाइन तत्व शामिल हैं, जैसे गनशिप टाइपफेस और बीएनएल का लोगो, और इसमें क्लासिक साइ-फाई और डिज़्नी आकर्षणों के कई संदर्भ शामिल हैं।",
      "वॉल·ई की यात्रा और एक्सिओम का डिज़ाइन वास्तविक दुनिया की सौंदर्यशास्त्र और तकनीक से प्रभावित है, जिसमें एप्पल के स्लीक डिज़ाइन और 2001: ए स्पेस ओडिसी के HAL जैसे प्रतिष्ठित साइ-फाई तत्वों की झलक शामिल है।"
    ],
    "commentSummary": [
      "यह लेख फिल्म वॉल·ई का एक गहन सांस्कृतिक विश्लेषण प्रदान करता है, जिसमें टाइपोग्राफी, वास्तुकला, कला शैलियाँ, फिल्म और संगीत शामिल हैं, और इसमें कई लिंक और संदर्भ छवियाँ भी शामिल हैं।",
      "चर्चा में उन जटिल विवरणों को उजागर किया गया है जो अधिकांश दर्शक Wall·E में देख नहीं पाते, और इन तत्वों का फिल्म की कहानी और अनुभव पर प्रभाव को रेखांकित किया गया है।",
      "एक उल्लेखनीय बिंदु है आइकोनियन फोंट्स का उल्लेख, जिसे एक शौकिया व्यक्ति ने बनाया है जो एक वाणिज्यिक लेनदेन वकील है, और कैसे उनके फोंट्स का उपयोग प्रमुख फिल्म फ्रेंचाइजी में किया गया है।"
    ],
    "points": 368,
    "commentCount": 51,
    "retryCount": 0,
    "time": 1720690134
  },
  {
    "id": 40932492,
    "title": "Dut – एक तेज़ लिनक्स डिस्क उपयोग कैलकुलेटर",
    "originLink": "https://codeberg.org/201984/dut",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40932492",
    "commentBody": "",
    "originSummary": [
      "\"dut\" एक मल्टी-थ्रेडेड डिस्क उपयोग कैलकुलेटर है जो C में लिखा गया है, और इसे मौजूदा टूल्स जैसे \"du\" की तुलना में तेज़ होने के लिए डिज़ाइन किया गया है जब लिनक्स के कैश गर्म होते हैं।",
      "प्रमुख प्रदर्शन सुधारों में fstatat(2) और statx(2) सिस्टम कॉल्स का उपयोग, और डायरेक्टरी सामग्री के लिए getdents(2) का उपयोग शामिल है, जिससे महत्वपूर्ण गति वृद्धि होती है।",
      "\"dut\" में एक अधिक सहज रीडआउट शामिल है जो ncdu से प्रेरित है, और स्थापना में एकल स्रोत फ़ाइल को संकलित करना और इसे आपके पथ में रखना शामिल है।"
    ],
    "commentSummary": [
      "\"Dut\" एक उच्च-प्रदर्शन, बहु-थ्रेडेड लिनक्स डिस्क उपयोग कैलकुलेटर है जो C में लिखा गया है, और इसे पारंपरिक उपकरणों जैसे \"du\" से बेहतर प्रदर्शन करने के लिए डिज़ाइन किया गया है जब लिनक्स के कैश गर्म होते हैं।",
      "यह वर्तमान निर्देशिका में सबसे बड़े आइटमों का एक पेड़ प्रदर्शित करता है, जिसमें हार्ड-लिंक आकार शामिल हैं, और उन्नत प्रदर्शन के लिए fstatat(2), statx(2), और getdents(2) जैसी उन्नत तकनीकों का उपयोग करता है।",
      "इंस्टॉलेशन सीधा-सादा है, जिसमें एकल स्रोत फ़ाइल को डाउनलोड और संकलित करना शामिल है, और यह डिस्क उपयोग का एक त्वरित, गैर-इंटरैक्टिव अवलोकन प्रदान करता है।"
    ],
    "points": 321,
    "commentCount": 126,
    "retryCount": 0,
    "time": 1720654196
  },
  {
    "id": 40933110,
    "title": "वित्तीय प्रणालियों के निर्माण के लिए इंजीनियरिंग सिद्धांत",
    "originLink": "https://substack.wasteman.codes/p/engineering-principles-and-best-practices",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40933110",
    "commentBody": "",
    "originSummary": [
      "ब्लॉग पोस्ट में सटीक और विश्वसनीय सॉफ्टवेयर-आधारित वित्तीय प्रणालियों को बनाने के लिए सर्वोत्तम प्रथाओं और सिद्धांतों पर चर्चा की गई है, जो लेखक के बड़े तकनीकी अनुभव से प्रेरित हैं।",
      "मुख्य इंजीनियरिंग सिद्धांतों में अपरिवर्तनीयता और स्थायित्व, सबसे छोटे कण का प्रतिनिधित्व, और इडेम्पोटेंसी शामिल हैं, जो डेटा की सटीकता, ऑडिटेबिलिटी, और समयबद्धता सुनिश्चित करते हैं।",
      "सर्वोत्तम प्रथाओं में वित्तीय राशियों के लिए पूर्णांकों का उपयोग, सुसंगत राउंडिंग पद्धतियाँ, मुद्रा रूपांतरण में देरी, और समय के पूर्णांक प्रतिनिधित्व का उपयोग शामिल हैं।"
    ],
    "commentSummary": [
      "वित्तीय प्रणालियों के लिए प्रमुख इंजीनियरिंग सिद्धांतों में सुसंगत राउंडिंग, सटीक समय प्रतिनिधित्व, और लीप सेकंड का सावधानीपूर्वक प्रबंधन शामिल हैं।",
      "वित्तीय प्रणालियों को एसीआईडी अनुपालन और सटीकता के लिए रिलेशनल डेटाबेस का उपयोग करना चाहिए, और सटीकता की हानि से बचने के लिए मुद्रा रूपांतरण में देरी करनी चाहिए।",
      "वित्तीय प्रणालियों में सटीकता और अनुपालन के लिए व्यापक परीक्षण, सहज उपयोगकर्ता इंटरफेस, और लेनदेन पहचानकर्ताओं का सावधानीपूर्वक प्रबंधन महत्वपूर्ण हैं।"
    ],
    "points": 271,
    "commentCount": 66,
    "retryCount": 0,
    "time": 1720662466
  },
  {
    "id": 40934495,
    "title": "दूसरा कारक एसएमएस: इसकी प्रतिष्ठा से भी बदतर",
    "originLink": "https://www.ccc.de/en/updates/2024/2fa-sms",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40934495",
    "commentBody": "",
    "originSummary": [
      "सीसीसी के सुरक्षा शोधकर्ताओं ने 200 से अधिक कंपनियों से 200 मिलियन से अधिक एसएमएस संदेशों को एक्सेस किया, जिनमें एक बार उपयोग होने वाले पासवर्ड शामिल थे, जिससे 2FA-SMS में कमजोरियों को उजागर किया गया।",
      "CCC ने दिखाया कि सेवा प्रदाता जो 2FA-SMS भेजते हैं, वे इन संदेशों तक पहुंच सकते हैं और संभावित रूप से इन्हें लीक कर सकते हैं, जैसा कि IdentifyMobile के साथ देखा गया, जिसने वास्तविक समय के एक बार के पासवर्ड को ऑनलाइन उजागर कर दिया।",
      "सिफारिशों में बेहतर सुरक्षा के लिए ऐप-जनित एक-बार पासवर्ड या हार्डवेयर टोकन का उपयोग शामिल है, क्योंकि 2FA-SMS सिम स्वैपिंग और SS7 शोषण जैसे हमलों के प्रति संवेदनशील बना रहता है।"
    ],
    "commentSummary": [
      "एक पारिवारिक मित्र को Google पर विज्ञापित एक नकली \"BANKNAME लॉगिन\" साइट के माध्यम से फ़िशिंग हमले का निशाना बनाया गया, जिसके परिणामस्वरूप एक धोखाधड़ी लेनदेन हुआ।",
      "इस घटना से यह स्पष्ट होता है कि जबकि ऐप-आधारित 2FA (दो-कारक प्रमाणीकरण) सामान्यतः अधिक सुरक्षित होता है, इस मामले में एसएमएस 2FA अधिक प्रभावी हो सकता था क्योंकि इसके संदेश क्रिया-विशिष्ट होते हैं।",
      "चर्चा इस बात पर जोर देती है कि 2FA सिस्टम की आवश्यकता है जो विभिन्न लेनदेन के लिए विशिष्ट टोकन उत्पन्न करते हैं और ऐसे घोटालों को रोकने के लिए विज्ञापन अवरोधक और बेहतर सुरक्षा प्रथाओं का उपयोग करने का महत्व है।"
    ],
    "points": 245,
    "commentCount": 214,
    "retryCount": 0,
    "time": 1720683869
  },
  {
    "id": 40935971,
    "title": "माइक्रोसॉफ्ट गाजा से महत्वपूर्ण संबंध काट रहा है, फिलिस्तीनियों का कहना है",
    "originLink": "https://www.bbc.com/news/articles/cger582weplo",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40935971",
    "commentBody": "",
    "originSummary": [
      "फिलिस्तीनियों ने माइक्रोसॉफ्ट पर उनके ईमेल खातों को अनुचित रूप से बंद करने का आरोप लगाया है, जिससे बैंकिंग, नौकरी के प्रस्ताव और स्काइप जैसी आवश्यक सेवाओं तक पहुंच प्रभावित हो रही है, जो कि इजरायली सैन्य अभियान के बीच संचार के लिए महत्वपूर्ण हैं।",
      "माइक्रोसॉफ्ट ने अपनी सेवा की शर्तों के उल्लंघन का हवाला दिया है, जिसे प्रभावित उपयोगकर्ताओं ने विवादित किया है, जो हमास के साथ गलत संबंध या संदिग्ध धोखाधड़ी गतिविधि का संदेह करते हैं।",
      "ऐयाद हमेट्टो, सलाह एलसादी, और खालिद ओबाएद जैसे व्यक्तियों ने अपने काम और पारिवारिक संचार में महत्वपूर्ण व्यवधानों की रिपोर्ट की है, जिससे माइक्रोसॉफ्ट के प्रति निराशा और अविश्वास उत्पन्न हुआ है।"
    ],
    "commentSummary": [
      "माइक्रोसॉफ्ट ने गाजा में फिलिस्तीनियों के लिए स्काइप और हॉटमेल की पहुंच को प्रतिबंधित कर दिया है, जिससे इज़राइल की 'पूर्ण नाकाबंदी' में मिलीभगत के आरोप लगे हैं।",
      "उपयोगकर्ता अपने परिवार से संपर्क करने या अपने हॉटमेल पते से जुड़े बैंक खातों तक पहुंचने में असमर्थ हैं, जिससे आवश्यक सेवाओं पर प्रभाव को लेकर चिंताएं बढ़ रही हैं।",
      "यह घटना तकनीकी कंपनियों के महत्वपूर्ण सेवाओं पर नियंत्रण और संघर्ष क्षेत्रों में अधिक खुले, विकेंद्रीकृत प्लेटफार्मों की संभावित आवश्यकता के व्यापक मुद्दे को उजागर करती है।"
    ],
    "points": 216,
    "commentCount": 134,
    "retryCount": 0,
    "time": 1720701064
  },
  {
    "id": 40932006,
    "title": "कैथरीन की प्रचुरता: बच्चे के नामकरण का खेल सिद्धांत",
    "originLink": "https://arxiv.org/abs/2404.00732",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40932006",
    "commentBody": "",
    "originSummary": [
      "कागज जिसका शीर्षक है 'कथरीन की प्रचुरता: बेबी नेमिंग का गेम थ्योरी' गेम थ्योरी का उपयोग करके बेबी नेमिंग की प्रतिस्पर्धात्मक प्रकृति का अन्वेषण करता है, यह मानते हुए कि माता-पिता नामों की विशिष्टता के आधार पर नाम चुनते हैं।",
      "अध्ययन एक स्पष्ट, सरल मॉडल का उपयोग करता है और संख्यात्मक प्रयोगों और बड़े भाषा मॉडल उपकरणों के साथ अपने विश्लेषण का विस्तार करता है, जिससे अंतर्दृष्टि और भविष्य के अनुसंधान दिशाओं की जानकारी मिलती है।",
      "SIGBOVIK 2024 में स्वीकृत, यह पेपर कंप्यूटर विज्ञान और गेम थ्योरी (cs.GT) और कंप्यूटर और समाज (cs.CY) के अंतर्गत वर्गीकृत है।"
    ],
    "commentSummary": [
      "एक हास्यपूर्ण लेख जिसका शीर्षक है 'कई कैथरीन: बेबी नेमिंग का गेम थ्योरी', कैथरीन से उत्पन्न नामों की लोकप्रियता और चयन प्रक्रिया की जांच करता है।",
      "यह पेपर, जो संभवतः अप्रैल फूल्स डे के लिए प्रस्तुत किया गया है, नामकरण प्रवृत्तियों, सांस्कृतिक प्रभावों और अद्वितीय फिर भी पारंपरिक नाम चुनने की चुनौतियों पर चर्चा करने के लिए पुनरावृत्त संदर्भों, चुटकुलों और खेलपूर्ण धारणाओं का उपयोग करता है।",
      "लेखक, जिनके सभी नाम समान हैं, चतुर टिप्पणियाँ और बुद्धिमान अवलोकन प्रस्तुत करते हैं, जिससे यह लेख मनोरंजक और सूचनात्मक दोनों बन जाता है।"
    ],
    "points": 213,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1720649321
  },
  {
    "id": 40934898,
    "title": "अधिकांश साइटें और ऐप्स सदस्यताओं के विपणन में डार्क पैटर्न का उपयोग करते हैं",
    "originLink": "https://icpen.org/news/1360",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40934898",
    "commentBody": "",
    "originSummary": [
      "आईसीपीईएन द्वारा किए गए एक वैश्विक इंटरनेट सर्वेक्षण में पाया गया कि 642 वेबसाइटों और मोबाइल ऐप्स में से 75.7% ने कम से कम एक डार्क पैटर्न का उपयोग किया, जबकि 66.8% ने दो या अधिक का उपयोग किया।",
      "डार्क पैटर्न्स धोखाधड़ीपूर्ण ऑनलाइन प्रथाएं हैं जो उपभोक्ता विकल्पों में हेरफेर करती हैं, जैसे कि ऑटो-नवीनीकरण जाल और इंटरफेस हस्तक्षेप।",
      "27 उपभोक्ता संरक्षण प्राधिकरणों द्वारा 26 देशों में किए गए इस सर्वेक्षण में उपभोक्ता संरक्षण और गोपनीयता के बीच के संबंधों को उजागर किया गया है, जिसकी विस्तृत रिपोर्टें ऑनलाइन उपलब्ध हैं।"
    ],
    "commentSummary": [
      "कई वेबसाइटें और ऐप्स सब्सक्रिप्शन को बढ़ावा देने के लिए डार्क पैटर्न का उपयोग करते हैं, जिससे खाता एक्सेस खोने, अप्रत्याशित शुल्क और भूले हुए सब्सक्रिप्शन जैसी समस्याएं उत्पन्न होती हैं।",
      "वर्चुअल डेबिट कार्ड, केंद्रीकृत सदस्यता प्रबंधन उपकरण, और चालान द्वारा भुगतान जैसी समाधान इन समस्याओं को कम करने में मदद कर सकते हैं।",
      "इन भ्रामक प्रथाओं से उपभोक्ताओं की बेहतर सुरक्षा के लिए आसान रद्दीकरण प्रक्रियाओं को अनिवार्य करने के लिए कानून बनाने की मांग बढ़ रही है।"
    ],
    "points": 207,
    "commentCount": 222,
    "retryCount": 0,
    "time": 1720689812
  },
  {
    "id": 40930549,
    "title": "बिग बॉल ऑफ मड (1999)",
    "originLink": "http://laputan.org/mud/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40930549",
    "commentBody": "",
    "originSummary": [
      "\"बिग बॉल ऑफ मड\" सॉफ्टवेयर आर्किटेक्चर को इसकी अराजक और तात्कालिक संरचना के लिए जाना जाता है, फिर भी यह कुछ संदर्भों में अपनी प्रभावशीलता के कारण प्रचलित रहता है।",
      "यह पेपर उन पैटर्नों की पहचान करता है जैसे \"फेंकने योग्य कोड,\" \"टुकड़ों में वृद्धि,\" और \"शियरिंग लेयर्स\" जो ऐसे सिस्टमों के निर्माण में योगदान करते हैं।",
      "समय की सीमाएं, लागत, और जटिलता जैसी ताकतों को समझना जो 'बिग बॉल ऑफ मड' सिस्टम्स के निर्माण को प्रेरित करती हैं, अधिक टिकाऊ और सुंदर सॉफ्टवेयर आर्किटेक्चर विकसित करने में मदद कर सकता है।"
    ],
    "commentSummary": [
      "चर्चा 'बिग बॉल ऑफ मड' (BBoM) की अवधारणा के इर्द-गिर्द घूमती है, जो एक सॉफ़्टवेयर प्रणाली का वर्णन करने के लिए उपयोग किया जाता है जिसमें कोई स्पष्ट संरचना नहीं होती है, जो अक्सर निरंतर पैचिंग और पुनर्संरचना की कमी के परिणामस्वरूप होती है।",
      "कुछ प्रतिभागियों का तर्क है कि यदि कोई केवल पेशेवर जिम्मेदारियों को पूरा करने का लक्ष्य रखता है, तो BBoM पर काम करना प्रबंधनीय और यहां तक कि 'आरामदायक' भी हो सकता है, जबकि अन्य इसे आत्मा को कुचलने वाला और असंतोषजनक पाते हैं।",
      "यह बातचीत त्वरित सुधारों के लिए एक BBoM बनाए रखने और पुनर्गठन और स्वच्छ कोड के दीर्घकालिक लाभों के बीच के समझौतों को उजागर करती है, जिसमें बैंकिंग और गेमिंग जैसी विभिन्न उद्योगों के उदाहरण शामिल हैं।"
    ],
    "points": 151,
    "commentCount": 128,
    "retryCount": 0,
    "time": 1720639772
  },
  {
    "id": 40935576,
    "title": "अगर एआई चैटबॉट्स भविष्य हैं, तो मुझे यह नापसंद है",
    "originLink": "https://www.jeffgeerling.com/blog/2024/if-ai-chatbots-are-future-i-hate-it",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40935576",
    "commentBody": "",
    "originSummary": [
      "एक AT&T फाइबर इंटरनेट उपयोगकर्ता ने अपनी गति में ~1 Gbps से 8 Mbps तक की महत्वपूर्ण गिरावट का अनुभव किया, जिससे निराशा हुई और ग्राहक सहायता को कॉल करने की आवश्यकता पड़ी।",
      "उपयोगकर्ता AT&T के एआई चैटबॉट के साथ संघर्ष कर रहा था, जिसने 'वाईफाई' को 'इंटरनेट' के साथ भ्रमित कर दिया, और एक मानव प्रतिनिधि से असहायक प्रतिक्रियाओं का सामना किया।",
      "यह घटना आईएसपी ग्राहक समर्थन के साथ चल रही समस्याओं और तकनीकी समस्याओं को प्रभावी ढंग से हल करने में वर्तमान एआई चैटबॉट्स की सीमाओं को उजागर करती है।"
    ],
    "commentSummary": [
      "ग्राहक सेवा के लिए एआई चैटबॉट्स के उपयोग की प्रवृत्ति की आलोचना की जाती है क्योंकि यह ग्राहकों को मानवीय संपर्क से दूर कर देती है, जिसे कुछ लोग कंपनियों की ओर से देखभाल की कमी के रूप में मानते हैं।",
      "लेखक का तर्क है कि जबकि एआई चैटबॉट्स उपयोगी हो सकते हैं, वर्तमान में कई कार्यान्वयन खराब तरीके से डिज़ाइन किए गए हैं और निराशाजनक हैं, जिससे एआई और मानव समर्थन के बीच संतुलन की आवश्यकता पर प्रकाश डाला गया है।",
      "ज़ोर ग्राहक समर्थन के महत्व पर है, यह सुझाव देते हुए कि अल्पकालिक लाभ को ग्राहक अनुभव पर प्राथमिकता देना तुच्छ और दीर्घकालिक सफलता के लिए हानिकारक है।"
    ],
    "points": 149,
    "commentCount": 169,
    "retryCount": 0,
    "time": 1720698063
  },
  {
    "id": 40935701,
    "title": "Binance ने Quickwit के साथ 100PB लॉग सेवा बनाई",
    "originLink": "https://quickwit.io/blog/quickwit-binance-story",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40935701",
    "commentBody": "",
    "originSummary": [
      "Binance ने सफलतापूर्वक Elasticsearch से Quickwit में माइग्रेट किया, अपने लॉग इंडेक्सिंग को 1.6 PB प्रति दिन तक स्केल किया और 100 PB लॉग सर्च क्लस्टर को प्रबंधित किया।",
      "प्रवासन के परिणामस्वरूप कंप्यूट लागत में 80% की कमी और स्टोरेज लागत में 20 गुना कमी आई, जिससे लॉग रिटेंशन और समस्या निवारण क्षमताओं में महत्वपूर्ण सुधार हुआ।",
      "Quickwit की नेटिव Kafka इंटीग्रेशन, बिल्ट-इन VRL ट्रांसफॉर्मेशन, और ऑब्जेक्ट स्टोरेज का उपयोग Binance की लॉग प्रबंधन चुनौतियों को हल करने में महत्वपूर्ण कारक थे।"
    ],
    "commentSummary": [
      "Binance ने Quickwit का उपयोग करके 100PB (पेटाबाइट) लॉग सेवा विकसित की, जो वित्तीय संगठनों में नियामक अनुपालन के लिए व्यापक लॉग भंडारण की आवश्यकता को उजागर करती है।",
      "लॉग्स बनाम मेट्रिक्स की उपयोगिता पर बहस हो रही है, जिसमें मेट्रिक्स को सिस्टम की सेहत की निगरानी के लिए अधिक प्रभावी माना जाता है और लॉग्स को विशिष्ट समस्याओं का निदान करने के लिए।",
      "चर्चा बड़े पैमाने पर लॉग डेटा को संभालने में भंडारण लागत, कुशल लॉग प्रबंधन, और प्रतिधारण नीतियों के संतुलन के महत्व को रेखांकित करती है।"
    ],
    "points": 147,
    "commentCount": 117,
    "retryCount": 0,
    "time": 1720699047
  },
  {
    "id": 40934582,
    "title": "अत्यधिक जटिल रिज्यूमे ज़ोला, JSON रिज्यूमे, वीसीप्रिंट, और निक्स के साथ (2023)",
    "originLink": "https://ktema.org/articles/the-overengineered-resume/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40934582",
    "commentBody": "",
    "originSummary": [
      "लेखक, डेविड रीड, एक अत्यधिक जटिल दृष्टिकोण का वर्णन करते हैं जिसमें रिज्यूमे को बनाए रखने के लिए सामग्री को प्रस्तुति से अलग करना, संस्करण नियंत्रण और कई आउटपुट प्रारूपों पर ध्यान केंद्रित किया गया है।",
      "उपयोग किए गए उपकरणों में डेटा प्रतिनिधित्व के लिए JSON रिज्यूमे, टेम्पलेटिंग के लिए Zola का Tera टेम्पलेट इंजन, PDF रेंडरिंग के लिए Weasyprint, और पर्यावरण सेटअप और निर्भरता प्रबंधन के लिए NixOS शामिल हैं।",
      "निरंतर एकीकरण को GitHub Actions का उपयोग करके प्राप्त किया जाता है, जो कमिट्स पर PDF रेंडरिंग को स्वचालित करता है, यह सुनिश्चित करते हुए कि रिज्यूमे हमेशा बिना मैन्युअल हस्तक्षेप के अद्यतित रहे।"
    ],
    "commentSummary": [
      "एक हैकर न्यूज़ चर्चा में ज़ोला, JSON रिज्यूमे, Weasyprint, और Nix जैसे टूल्स का उपयोग करके रिज्यूमे को अत्यधिक जटिल बनाने की प्रवृत्ति का अन्वेषण किया गया है, जिसमें कुछ उपयोगकर्ता इसकी मॉड्यूलरिटी और स्थिरता के कारण LaTeX की वकालत कर रहे हैं।",
      "टाइपस्ट और JSON रिज्यूमे जैसे विकल्पों का उल्लेख उनके आसान सेटअप और बेहतर त्रुटि प्रबंधन के लिए किया गया है, जबकि कुछ लोग सरल तरीकों जैसे गूगल डॉक्स या लिब्रेऑफिस को भी पसंद करते हैं।",
      "सर्वसम्मति इस बात पर जोर देती है कि जबकि अत्यधिक इंजीनियरिंग वाले रिज्यूमे बनाना आनंददायक हो सकता है, रिज्यूमे की सामग्री अंततः उसकी प्रस्तुति से अधिक महत्वपूर्ण होती है, विशेष रूप से एटीएस (आवेदक ट्रैकिंग सिस्टम) द्वारा स्वचालित रिज्यूमे पार्सिंग की चुनौतियों को ध्यान में रखते हुए।"
    ],
    "points": 130,
    "commentCount": 76,
    "retryCount": 0,
    "time": 1720685198
  },
  {
    "id": 40935154,
    "title": "क्वालकॉम का ओरियन कोर: लंबे समय से निर्माणाधीन",
    "originLink": "https://chipsandcheese.com/2024/07/09/qualcomms-oryon-core-a-long-time-in-the-making/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40935154",
    "commentBody": "",
    "originSummary": [
      "क्वालकॉम का ओरियन कोर, जो नुविया की तकनीक से विकसित हुआ है, आठ साल बाद आंतरिक रूप से डिज़ाइन किए गए स्मार्टफोन SoCs में क्वालकॉम की वापसी को दर्शाता है, और यह स्नैपड्रैगन X एलीट में डेब्यू कर रहा है।",
      "स्नैपड्रैगन X1E-80-10 में तीन क्वाड-कोर क्लस्टर्स में 12 ओरियन कोर हैं, जिनमें से प्रत्येक में 12 एमबी L2 कैश है, और यह उच्च पुन: क्रमबद्ध क्षमता और कुशल पता अनुवाद के साथ उन्नत आर्किटेक्चर को प्रदर्शित करता है।",
      "क्वालकॉम को एएमडी और इंटेल के साथ प्रतिस्पर्धा करने के लिए संगतता मुद्दों और उच्च डिवाइस लागतों को पार करने में चुनौतियों का सामना करना पड़ रहा है, जिसके लिए उसे ओईएम के साथ सहयोग की आवश्यकता है ताकि प्रतिस्पर्धी कीमतें पेश की जा सकें और सॉफ्टवेयर संगतता में सुधार हो सके।"
    ],
    "commentSummary": [
      "क्वालकॉम का ओरियन कोर लंबे समय से विकास में है, जिससे तकनीकी समुदाय में काफी रुचि उत्पन्न हुई है।",
      "चर्चा में Apple's iPad में M4 चिप को प्रमुखता दी गई है, जिसे इसके उच्च सिंगल-कोर प्रदर्शन के लिए जाना जाता है, लेकिन इसे सीमित iPad OS के कारण अपर्याप्त उपयोग के लिए आलोचना की गई है।",
      "बहस का केंद्र बिंदु शक्तिशाली चिप्स के उपयोगिता पर है, जो बंद प्लेटफार्मों जैसे कि iPad में होते हैं, बनाम अधिक खुले सिस्टम जैसे macOS या Linux, जो इस तरह के हार्डवेयर का उपयोग व्यापक पेशेवर और तकनीकी अनुप्रयोगों के लिए कर सकते हैं।"
    ],
    "points": 129,
    "commentCount": 101,
    "retryCount": 0,
    "time": 1720693028
  },
  {
    "id": 40935443,
    "title": "जो बच्चे जल्दी स्मार्टफोन प्राप्त करते हैं, वे वयस्क होने पर खराब मानसिक स्वास्थ्य के शिकार होते हैं (2023)",
    "originLink": "https://www.afterbabel.com/p/sapien-smartphone-report",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40935443",
    "commentBody": "",
    "originSummary": [
      "सपियन लैब्स द्वारा किए गए एक वैश्विक अध्ययन से पता चलता है कि जो बच्चे कम उम्र में स्मार्टफोन प्राप्त करते हैं, वे वयस्क होने पर मानसिक स्वास्थ्य में गिरावट का सामना करते हैं, और यह प्रभाव लड़कियों में अधिक मजबूत होता है।",
      "इस शोध में, जिसमें लगभग एक मिलियन प्रतिभागी शामिल थे, विभिन्न क्षेत्रों और भाषाओं में एक सुसंगत पैटर्न दिखाया गया है, जो प्रारंभिक स्मार्टफोन उपयोग को युवा वयस्कता में खराब मानसिक स्वास्थ्य से जोड़ता है।",
      "अध्ययन से पता चलता है कि सोशल मीडिया और फोन की लत के बढ़ते संपर्क से इन मानसिक स्वास्थ्य समस्याओं में योगदान हो सकता है, जिससे माता-पिता, शिक्षकों और नीति निर्माताओं को बच्चों के लिए स्मार्टफोन प्राप्त करने की उपयुक्त आयु पर पुनर्विचार करने का आग्रह किया गया है।"
    ],
    "commentSummary": [
      "पोस्ट में बच्चों के मानसिक स्वास्थ्य पर शुरुआती स्मार्टफोन उपयोग के प्रभाव पर चर्चा की गई है, जिसमें इसकी गंभीरता पर मिश्रित राय है।",
      "कुछ लोग तर्क देते हैं कि जबकि स्मार्टफोन और सोशल मीडिया चिंता और अवसाद को बढ़ा सकते हैं, इनके प्रभाव सार्वभौमिक रूप से विनाशकारी नहीं होते और क्षेत्र के अनुसार भिन्न होते हैं।",
      "आलोचक अधिक कठोर, सहकर्मी-समीक्षित अध्ययनों की आवश्यकता पर जोर देते हैं ताकि कारण-प्रभाव स्थापित किया जा सके और मौजूदा शोध में संभावित पुष्टि पूर्वाग्रहों को संबोधित किया जा सके।"
    ],
    "points": 119,
    "commentCount": 89,
    "retryCount": 0,
    "time": 1720696587
  },
  {
    "id": 40930983,
    "title": "एनवाईटी पुस्तक समीक्षा वह सब कुछ है जो पुस्तक आलोचना नहीं होनी चाहिए",
    "originLink": "https://www.currentaffairs.org/news/new-york-times-book-review",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40930983",
    "commentBody": "",
    "originSummary": [
      "यास्मिन नायर ने एनवाईटी बुक रिव्यू की आलोचना की है कि वह पुस्तकों और प्रकाशन उद्योग के साथ गंभीरता से जुड़ने में विफल हो रहा है, और वह नीरस और राय व्यक्त करने में अनिच्छुक हो गया है।",
      "समीक्षा हानिकारक प्रवृत्तियों को बनाए रखती है, जैसे कि गैर-श्वेत लेखकों को प्रतीकात्मक रूप में प्रस्तुत करना और बिग फाइव प्रकाशकों पर ध्यान केंद्रित करना, जिससे प्रकाशन में भौतिक असमानता को मजबूती मिलती है।",
      "नायर पुस्तक समीक्षा के लिए एक नए दृष्टिकोण की मांग करते हैं जो प्रकाशन की अर्थव्यवस्था पर विचार करता है और व्यापक आवाज़ों का समर्थन करता है, वर्तमान प्रथाओं के पुस्तक संस्कृति पर दीर्घकालिक नकारात्मक प्रभावों को उजागर करता है।"
    ],
    "commentSummary": [
      "एनवाईटी बुक रिव्यू को अक्सर नीरस, अत्यधिक व्यावसायिक और एमएफए-प्रकाशन परिसर का हिस्सा होने के लिए आलोचना की जाती है, जिसके कारण साहित्यिक समुदाय में कई लोग इसे गंभीरता से नहीं लेते।",
      "न्यूयॉर्क रिव्यू ऑफ बुक्स (NYRB) और लंदन रिव्यू ऑफ बुक्स (LRB) जैसे विकल्पों की प्रशंसा अधिक सूक्ष्म निबंध प्रदान करने के लिए की जाती है, जबकि छोटे पत्रिकाएँ और सबरेडिट्स जीवंत चर्चाएँ और सिफारिशें प्रदान करते हैं।",
      "एनवाईटी की बेस्टसेलर सूची को पक्षपाती और खेली हुई माना जाता है, जिससे यह धारणा बनती है कि एनवाईटी बुक रिव्यू में अन्य साहित्यिक समीक्षा स्रोतों की तुलना में गहराई और मौलिकता की कमी है।"
    ],
    "points": 111,
    "commentCount": 92,
    "retryCount": 0,
    "time": 1720642086
  }
]
