[
  {
    "id": 40931636,
    "title": "Científicos descubren una causa del lupus y una posible forma de revertirlo",
    "originLink": "https://news.feinberg.northwestern.edu/2024/07/10/scientists-discover-a-cause-of-lupus-and-a-possible-way-to-reverse-it/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40931636",
    "commentBody": "",
    "originSummary": [
      "Los científicos de Northwestern Medicine y del Brigham and Women’s Hospital han identificado un defecto molecular en el lupus eritematoso sistémico (lupus) que implica una activación insuficiente del receptor de hidrocarburos arílicos (AHR).",
      "Reactivar el AHR en muestras de sangre de pacientes con lupus convirtió las células T auxiliares periféricas dañinas en células Th22, lo que puede ayudar en la cicatrización de heridas y ofrecer nuevas vías de tratamiento.",
      "Los hallazgos, publicados en Nature, sugieren posibles nuevos tratamientos para el lupus sin los efectos secundarios de las terapias actuales, respaldados por subvenciones de los NIH y otras organizaciones."
    ],
    "commentSummary": [
      "Los científicos han identificado la vía del receptor de hidrocarburos arílicos (AHR) como una posible causa del lupus y un método para revertirlo, lo que podría llevar a nuevos tratamientos.",
      "Una persona con lupus informó haber logrado la remisión a través de cambios en la dieta, específicamente eliminando la carne y enfocándose en vegetales de hoja crudos.",
      "La investigación resalta el papel significativo de la dieta y la salud intestinal en el manejo de condiciones autoinmunes, generando debates entre personas con problemas de salud similares."
    ],
    "points": 693,
    "commentCount": 149,
    "retryCount": 0,
    "time": 1720646689
  },
  {
    "id": 40934924,
    "title": "La tipografía de Wall·E (2018)",
    "originLink": "https://typesetinthefuture.com/2018/12/04/walle/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40934924",
    "commentBody": "",
    "originSummary": [
      "WALL·E equilibra temas de distopía consumista y el optimismo de la carrera espacial de los años sesenta, ofreciendo una perspectiva única del futuro robótico.",
      "La película presenta elementos de diseño detallados, como la tipografía Gunship y el logotipo de BnL, e incluye numerosas referencias a la ciencia ficción clásica y a las atracciones de Disney.",
      "WALL·E y el diseño del Axioma están influenciados por la estética y la tecnología del mundo real, incluyendo el diseño elegante de Apple y guiños a elementos icónicos de la ciencia ficción como HAL de 2001: Una odisea del espacio."
    ],
    "commentSummary": [
      "La artículo ofrece un análisis cultural en profundidad de la película Wall·E, abarcando tipografía, arquitectura, estilos artísticos, cine y música, con numerosos enlaces e imágenes de referencia.",
      "La discusión destaca los detalles intrincados en Wall·E que la mayoría de los espectadores podrían pasar por alto, enfatizando el impacto de estos elementos en la narrativa y la sensación de la película.",
      "Un punto notable es la mención de Iconian Fonts, creadas por un aficionado que es abogado de transacciones comerciales, y cómo sus fuentes han sido utilizadas en importantes franquicias cinematográficas."
    ],
    "points": 368,
    "commentCount": 51,
    "retryCount": 0,
    "time": 1720690134
  },
  {
    "id": 40932492,
    "title": "Dut – un calculador rápido de uso de disco para Linux",
    "originLink": "https://codeberg.org/201984/dut",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40932492",
    "commentBody": "",
    "originSummary": [
      "\"dut\" es un calculador de uso de disco multi-hilo escrito en C, diseñado para ser más rápido que las herramientas existentes como \"du\" cuando las cachés de Linux están calientes.",
      "Las mejoras clave en el rendimiento incluyen el uso de las llamadas al sistema fstatat(2) y statx(2), y getdents(2) para el contenido de directorios, lo que resulta en aumentos significativos de velocidad.",
      "\"dut\" presenta una lectura más intuitiva inspirada en ncdu, y la instalación implica compilar un solo archivo fuente y colocarlo en tu ruta."
    ],
    "commentSummary": [
      "\"Dut\" es un calculador de uso de disco de Linux de alto rendimiento y multi-hilo escrito en C, diseñado para superar a las herramientas tradicionales como \"du\" cuando las cachés de Linux están calientes.",
      "Despliega un árbol de los elementos más grandes en el directorio actual, incluyendo los tamaños de los enlaces duros, y utiliza técnicas avanzadas como fstatat(2), statx(2) y getdents(2) para un rendimiento mejorado.",
      "Instalarlo es sencillo, solo requiere la descarga y compilación de un único archivo fuente, y proporciona una visión rápida y no interactiva del uso del disco."
    ],
    "points": 321,
    "commentCount": 126,
    "retryCount": 0,
    "time": 1720654196
  },
  {
    "id": 40933110,
    "title": "Principios de ingeniería para construir sistemas financieros",
    "originLink": "https://substack.wasteman.codes/p/engineering-principles-and-best-practices",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40933110",
    "commentBody": "",
    "originSummary": [
      "La publicación del blog discute las mejores prácticas y principios para crear sistemas financieros basados en software precisos y confiables, basándose en la experiencia del autor en grandes empresas tecnológicas.",
      "Los principios clave de la ingeniería incluyen inmutabilidad y durabilidad, representación del grano más pequeño e idempotencia, asegurando la precisión, auditabilidad y puntualidad de los datos.",
      "Las mejores prácticas destacadas son el uso de enteros para cantidades financieras, metodologías de redondeo consistentes, retrasar la conversión de divisas y usar representaciones enteras del tiempo."
    ],
    "commentSummary": [
      "Los principios clave de ingeniería para los sistemas financieros incluyen el redondeo consistente, la representación precisa del tiempo y el manejo cuidadoso de los segundos intercalares.",
      "Los sistemas financieros deben utilizar bases de datos relacionales para el cumplimiento de ACID y la precisión, y retrasar la conversión de divisas para evitar la pérdida de precisión.",
      "Las pruebas exhaustivas, las interfaces de usuario intuitivas y la gestión cuidadosa de los identificadores de transacciones son cruciales para la precisión y el cumplimiento en los sistemas financieros."
    ],
    "points": 271,
    "commentCount": 66,
    "retryCount": 0,
    "time": 1720662466
  },
  {
    "id": 40934495,
    "title": "Segundo Factor SMS: Peor de lo que se dice",
    "originLink": "https://www.ccc.de/en/updates/2024/2fa-sms",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40934495",
    "commentBody": "",
    "originSummary": [
      "Investigadores de seguridad del CCC accedieron a más de 200 millones de mensajes SMS que contenían contraseñas de un solo uso de más de 200 empresas, destacando vulnerabilidades en 2FA-SMS.",
      "El CCC demostró que los proveedores de servicios que envían SMS de 2FA pueden acceder y potencialmente filtrar estos mensajes, como se vio con IdentifyMobile, que expuso contraseñas de un solo uso en tiempo real en línea.",
      "Las recomendaciones incluyen el uso de contraseñas de un solo uso generadas por aplicaciones o tokens de hardware para una mejor seguridad, ya que el 2FA-SMS sigue siendo susceptible a ataques como el intercambio de SIM y la explotación de SS7."
    ],
    "commentSummary": [
      "Un amigo de la familia fue víctima de un ataque de phishing a través de un sitio falso de \"inicio de sesión de BANKNAME\" anunciado en Google, lo que llevó a una transacción fraudulenta.",
      "La incidencia subraya que, aunque la autenticación de dos factores (2FA) basada en aplicaciones es generalmente más segura, la 2FA por SMS podría haber sido más efectiva en este caso debido a sus mensajes específicos de acción.",
      "La discusión enfatiza la necesidad de sistemas 2FA que generen tokens específicos para diferentes transacciones y la importancia de usar bloqueadores de anuncios y mejores prácticas de seguridad para prevenir tales estafas."
    ],
    "points": 245,
    "commentCount": 214,
    "retryCount": 0,
    "time": 1720683869
  },
  {
    "id": 40935971,
    "title": "Microsoft corta un vínculo crucial con Gaza, dicen los palestinos",
    "originLink": "https://www.bbc.com/news/articles/cger582weplo",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40935971",
    "commentBody": "",
    "originSummary": [
      "Los palestinos acusan a Microsoft de cerrar injustamente sus cuentas de correo electrónico, lo que afecta el acceso a servicios esenciales como la banca, ofertas de trabajo y Skype, cruciales para la comunicación en medio de la campaña militar israelí.",
      "Microsoft cita violaciones de sus términos de servicio, una afirmación disputada por los usuarios afectados, quienes sospechan una asociación indebida con Hamas o actividad fraudulenta sospechada.",
      "Individuos como Eiad Hametto, Salah Elsadi y Khalid Obaied informan de interrupciones significativas en su trabajo y comunicación familiar, lo que lleva a la frustración y desconfianza hacia Microsoft."
    ],
    "commentSummary": [
      "Microsoft ha restringido el acceso a Skype y Hotmail para los palestinos en Gaza, lo que ha provocado acusaciones de complicidad en el \"sitio completo\" de Israel.",
      "Los usuarios no pueden contactar a sus familias ni acceder a las cuentas bancarias vinculadas a sus direcciones de Hotmail, lo que genera preocupaciones sobre el impacto en los servicios esenciales.",
      "La incidencia subraya el problema más amplio del control de las empresas tecnológicas sobre servicios críticos y la posible necesidad de plataformas más abiertas y descentralizadas en zonas de conflicto."
    ],
    "points": 216,
    "commentCount": 134,
    "retryCount": 0,
    "time": 1720701064
  },
  {
    "id": 40932006,
    "title": "Una abundancia de Katherines: La teoría de juegos en la elección de nombres para bebés",
    "originLink": "https://arxiv.org/abs/2404.00732",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40932006",
    "commentBody": "",
    "originSummary": [
      "El artículo titulado 'Una Abundancia de Katherines: La Teoría de Juegos del Nombramiento de Bebés' explora la naturaleza competitiva del nombramiento de bebés utilizando la teoría de juegos, asumiendo que los padres eligen nombres basándose en la unicidad.",
      "La investigación emplea un modelo claro y manejable y extiende su análisis con experimentos numéricos y herramientas de modelos de lenguaje grande, proporcionando ideas y direcciones para futuras investigaciones.",
      "Aceptado en SIGBOVIK 2024, el artículo está categorizado bajo Ciencias de la Computación y Teoría de Juegos (cs.GT) y Computadoras y Sociedad (cs.CY)."
    ],
    "commentSummary": [
      "Un artículo humorístico titulado 'Una Abundancia de Katherines: La Teoría de Juegos del Nombramiento de Bebés' explora la popularidad y el proceso de selección de nombres derivados de Katherine.",
      "La publicación, probablemente presentada para el Día de los Inocentes, utiliza referencias recursivas, bromas y suposiciones lúdicas para discutir las tendencias de nombres, las influencias culturales y los desafíos de elegir nombres únicos pero tradicionales.",
      "Los autores, todos con nombres similares, ofrecen comentarios ingeniosos y observaciones astutas, haciendo que el artículo sea tanto entretenido como perspicaz."
    ],
    "points": 213,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1720649321
  },
  {
    "id": 40934898,
    "title": "La mayoría de los sitios y aplicaciones utilizan patrones oscuros en la comercialización de suscripciones",
    "originLink": "https://icpen.org/news/1360",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40934898",
    "commentBody": "",
    "originSummary": [
      "Una revisión global de internet realizada por ICPEN encontró que el 75.7% de 642 sitios web y aplicaciones móviles utilizaban al menos un patrón oscuro, y el 66.8% utilizaban dos o más.",
      "Los patrones oscuros son prácticas engañosas en línea que manipulan las elecciones de los consumidores, como las trampas de renovación automática y la interferencia de la interfaz.",
      "La barrida, realizada por 27 autoridades de protección al consumidor de 26 países, destaca la intersección entre la protección al consumidor y la privacidad, con informes detallados disponibles en línea."
    ],
    "commentSummary": [
      "Muchos sitios web y aplicaciones emplean patrones oscuros para impulsar suscripciones, lo que lleva a problemas como la pérdida de acceso a la cuenta, cargos inesperados y suscripciones olvidadas.",
      "Soluciones como las tarjetas de débito virtuales, las herramientas centralizadas de gestión de suscripciones y el pago por factura pueden ayudar a mitigar estos problemas.",
      "Existe una creciente demanda de legislación para exigir procesos de cancelación fáciles con el fin de proteger mejor a los consumidores de estas prácticas engañosas."
    ],
    "points": 207,
    "commentCount": 222,
    "retryCount": 0,
    "time": 1720689812
  },
  {
    "id": 40930549,
    "title": "Gran Bola de Barro (1999)",
    "originLink": "http://laputan.org/mud/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40930549",
    "commentBody": "",
    "originSummary": [
      "La arquitectura de software \"Big Ball of Mud\" se caracteriza por su estructura caótica y expedita, sin embargo, sigue siendo prevalente debido a su efectividad en ciertos contextos.",
      "La investigación identifica patrones como \"Código Desechable,\" \"Crecimiento Fragmentado\" y \"Capas de Cizallamiento\" que contribuyen a la formación de tales sistemas.",
      "Comprender las fuerzas como las limitaciones de tiempo, el costo y la complejidad que impulsan la creación de sistemas \"Big Ball of Mud\" puede ayudar a desarrollar arquitecturas de software más duraderas y elegantes."
    ],
    "commentSummary": [
      "La discusión gira en torno al concepto de \"Gran Bola de Lodo\" (BBoM), un término utilizado para describir un sistema de software sin una arquitectura clara, a menudo resultado de parches continuos y la falta de refactorización.",
      "Algunos participantes argumentan que trabajar en BBoM puede ser manejable e incluso 'relajado' si uno solo busca cumplir con las responsabilidades profesionales, mientras que otros lo encuentran devastador y poco gratificante.",
      "La conversación destaca los compromisos entre mantener un BBoM para arreglos rápidos y los beneficios a largo plazo de la refactorización y el código limpio, con ejemplos de diversas industrias como la banca y los videojuegos."
    ],
    "points": 151,
    "commentCount": 128,
    "retryCount": 0,
    "time": 1720639772
  },
  {
    "id": 40935576,
    "title": "Si los chatbots de IA son el futuro, lo odio",
    "originLink": "https://www.jeffgeerling.com/blog/2024/if-ai-chatbots-are-future-i-hate-it",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40935576",
    "commentBody": "",
    "originSummary": [
      "Un usuario de Internet de Fibra de AT&T experimentó una caída significativa en la velocidad de ~1 Gbps a 8 Mbps, lo que provocó frustración y una llamada al servicio de atención al cliente.",
      "La usuaria tuvo problemas con el chatbot de IA de AT&T, que confundió 'WiFi' con 'Internet', y recibió respuestas poco útiles de un representante humano.",
      "La incidencia resalta los problemas continuos con el soporte al cliente de los ISP y las limitaciones de los chatbots de IA actuales para resolver problemas técnicos de manera efectiva."
    ],
    "commentSummary": [
      "La tendencia de usar chatbots de IA para el servicio al cliente es criticada por distanciar a los clientes de la interacción humana, lo que algunos creen que muestra una falta de atención por parte de las empresas.",
      "El autor sostiene que, si bien los chatbots de IA pueden ser útiles, muchas implementaciones actuales están mal diseñadas y resultan frustrantes, lo que resalta la necesidad de un equilibrio entre la IA y el apoyo humano.",
      "La importancia se centra en el soporte al cliente, sugiriendo que priorizar las ganancias a corto plazo sobre la experiencia del cliente es miope y perjudicial para el éxito a largo plazo."
    ],
    "points": 149,
    "commentCount": 169,
    "retryCount": 0,
    "time": 1720698063
  },
  {
    "id": 40935701,
    "title": "Binance construyó un servicio de registro de 100PB con Quickwit",
    "originLink": "https://quickwit.io/blog/quickwit-binance-story",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40935701",
    "commentBody": "",
    "originSummary": [
      "Binance migró exitosamente de Elasticsearch a Quickwit, escalando su indexación de registros a 1.6 PB por día y gestionando un clúster de búsqueda de registros de 100 PB.",
      "La migración resultó en una reducción del 80% en los costos de cómputo y una reducción de 20 veces en los costos de almacenamiento, mejorando significativamente la retención de registros y las capacidades de resolución de problemas.",
      "Las integraciones nativas de Kafka de Quickwit, las transformaciones integradas de VRL y el uso de almacenamiento de objetos fueron factores clave para abordar los desafíos de gestión de registros de Binance."
    ],
    "commentSummary": [
      "Binance desarrolló un servicio de registro de 100PB (petabytes) utilizando Quickwit, destacando la necesidad de un almacenamiento extenso de registros en las organizaciones financieras para el cumplimiento normativo.",
      "Existe un debate sobre la utilidad de los registros frente a las métricas, considerándose que las métricas son más efectivas para monitorear la salud del sistema y los registros para diagnosticar problemas específicos.",
      "La discusión subraya la importancia de equilibrar los costos de almacenamiento, la gestión eficiente de registros y las políticas de retención al manejar datos de registros a gran escala."
    ],
    "points": 147,
    "commentCount": 117,
    "retryCount": 0,
    "time": 1720699047
  },
  {
    "id": 40934582,
    "title": "La hoja de vida sobreingenierada con Zola, JSON Resume, Weasyprint y Nix (2023)",
    "originLink": "https://ktema.org/articles/the-overengineered-resume/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40934582",
    "commentBody": "",
    "originSummary": [
      "El autor, David Reed, describe un enfoque sobreingenierado para mantener un currículum, centrándose en separar el contenido de la presentación, el control de versiones y múltiples formatos de salida.",
      "Las herramientas utilizadas incluyen JSON Resume para la representación de datos, el motor de plantillas Tera de Zola para la creación de plantillas, Weasyprint para la renderización de PDF y NixOS para la configuración del entorno y la gestión de dependencias.",
      "Se logra la integración continua utilizando GitHub Actions para automatizar el renderizado de PDF en los commits, asegurando que el currículum esté siempre actualizado sin intervención manual."
    ],
    "commentSummary": [
      "Una discusión en Hacker News explora la tendencia de sobreingeniería de currículums utilizando herramientas como Zola, JSON Resume, Weasyprint y Nix, con algunos usuarios abogando por LaTeX debido a su modularidad y consistencia.",
      "Alternativas como Typst y JSON Resume se mencionan por su configuración más sencilla y mejor manejo de errores, mientras que algunos también prefieren métodos más simples como Google Docs o LibreOffice.",
      "La opinión general destaca que, aunque sobreingeniar los currículums puede ser divertido, el contenido del currículum es en última instancia más crucial que su presentación, especialmente considerando los desafíos del análisis automatizado de currículums por los ATS (Sistemas de Seguimiento de Solicitantes)."
    ],
    "points": 130,
    "commentCount": 76,
    "retryCount": 0,
    "time": 1720685198
  },
  {
    "id": 40935154,
    "title": "El núcleo Oryon de Qualcomm: mucho tiempo en desarrollo",
    "originLink": "https://chipsandcheese.com/2024/07/09/qualcomms-oryon-core-a-long-time-in-the-making/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40935154",
    "commentBody": "",
    "originSummary": [
      "El núcleo Oryon de Qualcomm, desarrollado a partir de la tecnología de Nuvia, marca el regreso de Qualcomm a los SoCs de smartphones diseñados internamente después de ocho años, debutando en el Snapdragon X Elite.",
      "La Snapdragon X1E-80-10 cuenta con 12 núcleos Oryon en tres grupos de cuatro núcleos, cada uno con una caché L2 de 12 MB, y presenta una arquitectura avanzada con alta capacidad de reordenamiento y traducción de direcciones eficiente.",
      "Qualcomm enfrenta desafíos para superar problemas de compatibilidad y altos costos de dispositivos para competir con AMD e Intel, necesitando colaboración con los OEM para ofrecer precios competitivos y mejorar la compatibilidad del software."
    ],
    "commentSummary": [
      "El núcleo Oryon de Qualcomm ha estado en desarrollo durante mucho tiempo, generando un interés significativo en la comunidad tecnológica.",
      "La discusión destaca el chip M4 en el iPad de Apple, conocido por su alto rendimiento de un solo núcleo pero criticado por estar subutilizado debido al restrictivo sistema operativo iPad OS.",
      "La discusión se centra en la utilidad de los chips potentes en plataformas cerradas como el iPad frente a sistemas más abiertos como macOS o Linux, que pueden aprovechar dicho hardware para una gama más amplia de aplicaciones profesionales y técnicas."
    ],
    "points": 129,
    "commentCount": 101,
    "retryCount": 0,
    "time": 1720693028
  },
  {
    "id": 40935443,
    "title": "Los niños que obtienen teléfonos inteligentes antes se convierten en adultos con peor salud mental (2023)",
    "originLink": "https://www.afterbabel.com/p/sapien-smartphone-report",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40935443",
    "commentBody": "",
    "originSummary": [
      "Un estudio global realizado por Sapien Labs indica que los niños que reciben teléfonos inteligentes a una edad más temprana tienden a tener una peor salud mental en la adultez, con un efecto más fuerte observado en las niñas.",
      "La investigación, que involucró a casi un millón de participantes, muestra un patrón consistente en diferentes regiones e idiomas, vinculando el uso temprano de teléfonos inteligentes con una peor salud mental en la adultez joven.",
      "La investigación sugiere que una mayor exposición a las redes sociales y la adicción al teléfono pueden contribuir a estos problemas de salud mental, instando a los padres, educadores y legisladores a reconsiderar la edad apropiada para que los niños reciban teléfonos inteligentes."
    ],
    "commentSummary": [
      "La publicación discute el impacto del uso temprano de teléfonos inteligentes en la salud mental de los niños, con opiniones mixtas sobre su gravedad.",
      "Algunos argumentan que, si bien los teléfonos inteligentes y las redes sociales pueden aumentar la ansiedad y la depresión, los efectos no son universalmente catastróficos y varían según la región.",
      "Los críticos destacan la necesidad de estudios más rigurosos y revisados por pares para establecer la causalidad y abordar los posibles sesgos de confirmación en la investigación existente."
    ],
    "points": 119,
    "commentCount": 89,
    "retryCount": 0,
    "time": 1720696587
  },
  {
    "id": 40930983,
    "title": "La reseña de libros del NYT es todo lo que la crítica de libros no debería ser",
    "originLink": "https://www.currentaffairs.org/news/new-york-times-book-review",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40930983",
    "commentBody": "",
    "originSummary": [
      "Yasmin Nair critica al NYT Book Review por no comprometerse seriamente con los libros y la industria editorial, volviéndose insípido y reacio a expresar opiniones.",
      "La reseña perpetúa tendencias dañinas, como la tokenización de escritores no blancos y el enfoque en las cinco grandes editoriales, reforzando la desigualdad material en la publicación.",
      "Nair pide un nuevo enfoque para la crítica de libros que considere la economía de la publicación y apoye una gama más amplia de voces, destacando los efectos negativos a largo plazo de las prácticas actuales de la Review en la cultura del libro."
    ],
    "commentSummary": [
      "La reseña de libros del NYT a menudo es criticada por ser insípida, excesivamente comercial y parte del complejo de publicación de MFA, lo que lleva a muchos en la comunidad literaria a no tomarla en serio.",
      "Alternativas como la New York Review of Books (NYRB) y la London Review of Books (LRB) son elogiadas por ofrecer ensayos más perspicaces, mientras que revistas más pequeñas y subreddits proporcionan discusiones animadas y recomendaciones.",
      "La lista de bestsellers del NYT se percibe como sesgada y manipulada, lo que contribuye a la opinión de que la reseña de libros del NYT carece de profundidad y originalidad en comparación con otras fuentes de reseñas literarias."
    ],
    "points": 111,
    "commentCount": 92,
    "retryCount": 0,
    "time": 1720642086
  }
]
