[
  {
    "id": 40931636,
    "title": "Ученые обнаружили причину волчанки и возможный способ ее обратного развития",
    "originLink": "https://news.feinberg.northwestern.edu/2024/07/10/scientists-discover-a-cause-of-lupus-and-a-possible-way-to-reverse-it/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40931636",
    "commentBody": "",
    "originSummary": [
      "Ученые из Northwestern Medicine и Brigham and Women’s Hospital выявили молекулярный дефект при системной красной волчанке (волчанке), связанный с недостаточной активацией арилуглеводородного рецептора (AHR).",
      "Реактивация AHR в образцах крови пациентов с волчанкой преобразовала вредные Т-периферические вспомогательные клетки в клетки Th22, которые могут способствовать заживлению ран и предложить новые пути лечения.",
      "«Результаты, опубликованные в журнале Nature, предполагают возможность новых методов лечения волчанки без побочных эффектов, характерных для текущих терапий, при поддержке грантов NIH и других организаций.»"
    ],
    "commentSummary": [
      "Ученые выявили путь арилуглеводородного рецептора (AHR) как потенциальную причину волчанки и метод ее обратного развития, что может привести к созданию новых методов лечения.",
      "Человек с волчанкой сообщил, что достиг ремиссии благодаря изменениям в питании, в частности, исключив мясо и сосредоточившись на употреблении сырых листовых овощей.",
      "Открытие подчеркивает значительную роль диеты и здоровья кишечника в управлении аутоиммунными заболеваниями, вызывая обсуждения среди людей с аналогичными проблемами со здоровьем."
    ],
    "points": 693,
    "commentCount": 149,
    "retryCount": 0,
    "time": 1720646689
  },
  {
    "id": 40934924,
    "title": "«Шрифт Wall·E (2018)»",
    "originLink": "https://typesetinthefuture.com/2018/12/04/walle/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40934924",
    "commentBody": "",
    "originSummary": [
      "«ВАЛЛ·И балансирует между темами потребительской антиутопии и оптимизма космической гонки шестидесятых, предлагая уникальный взгляд на будущее роботов.»",
      "Фильм включает в себя детализированные элементы дизайна, такие как шрифт Gunship и логотип BnL, а также содержит множество отсылок к классической научной фантастике и аттракционам Disney.",
      "Путешествие ВАЛЛ·И и дизайн «Аксиомы» вдохновлены реальными эстетическими и технологическими решениями, включая элегантный дизайн Apple и отсылки к культовым элементам научной фантастики, таким как HAL из «Космической одиссеи 2001 года»."
    ],
    "commentSummary": [
      "«Статья представляет собой глубокий культурный анализ фильма \"ВАЛЛ·И\", охватывающий типографику, архитектуру, художественные стили, кино и музыку, с многочисленными ссылками и иллюстрациями.»",
      "«Обсуждение подчеркивает сложные детали в фильме \"ВАЛЛ·И\", которые большинство зрителей могут не заметить, акцентируя внимание на влиянии этих элементов на повествование и атмосферу фильма.»",
      "Примечательным моментом является упоминание шрифтов Iconian, созданных любителем, который является адвокатом по коммерческим сделкам, и о том, как его шрифты использовались в крупных кинофраншизах."
    ],
    "points": 368,
    "commentCount": 51,
    "retryCount": 0,
    "time": 1720690134
  },
  {
    "id": 40932492,
    "title": "Дут – быстрый калькулятор использования диска для Linux",
    "originLink": "https://codeberg.org/201984/dut",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40932492",
    "commentBody": "",
    "originSummary": [
      "«dut» — это многопоточный калькулятор использования диска, написанный на языке C, разработанный для работы быстрее, чем существующие инструменты, такие как «du», когда кэши Linux прогреты.",
      "«Ключевые улучшения производительности включают использование системных вызовов fstatat(2) и statx(2), а также getdents(2) для содержимого каталогов, что приводит к значительному увеличению скорости.»",
      "«\"dut\" имеет более интуитивно понятный вывод, вдохновленный ncdu, а установка включает компиляцию одного исходного файла и размещение его в вашем пути.»"
    ],
    "commentSummary": [
      "«\"Dut\" — это высокопроизводительный многопоточный калькулятор использования диска для Linux, написанный на C, разработанный для превосходства над традиционными инструментами, такими как \"du\", когда кэши Linux прогреты.»",
      "«Он отображает дерево самых крупных элементов в текущем каталоге, включая размеры жестких ссылок, и использует передовые техники, такие как fstatat(2), statx(2) и getdents(2) для повышения производительности.»",
      "«Установка проста, требует загрузки и компиляции одного исходного файла, и предоставляет быстрый, неинтерактивный обзор использования диска.»"
    ],
    "points": 321,
    "commentCount": 126,
    "retryCount": 0,
    "time": 1720654196
  },
  {
    "id": 40933110,
    "title": "Принципы инженерии для создания финансовых систем",
    "originLink": "https://substack.wasteman.codes/p/engineering-principles-and-best-practices",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40933110",
    "commentBody": "",
    "originSummary": [
      "В блоге обсуждаются лучшие практики и принципы создания точных и надежных программных финансовых систем, основанные на опыте автора в крупных технологических компаниях.",
      "Ключевые инженерные принципы включают неизменяемость и долговечность, представление наименьшей зернистости и идемпотентность, обеспечивая точность данных, возможность аудита и своевременность.",
      "Лучшие практики включают использование целых чисел для финансовых сумм, согласованные методы округления, отсрочку конвертации валют и использование целочисленных представлений времени."
    ],
    "commentSummary": [
      "Ключевые инженерные принципы для финансовых систем включают в себя согласованное округление, точное представление времени и тщательную обработку високосных секунд.",
      "Финансовые системы должны использовать реляционные базы данных для соблюдения требований ACID и точности, а также откладывать конвертацию валюты, чтобы избежать потери точности.",
      "«Обширное тестирование, интуитивно понятные пользовательские интерфейсы и тщательное управление идентификаторами транзакций имеют решающее значение для точности и соответствия в финансовых системах.»"
    ],
    "points": 271,
    "commentCount": 66,
    "retryCount": 0,
    "time": 1720662466
  },
  {
    "id": 40934495,
    "title": "«Второй фактор SMS: хуже, чем его репутация»",
    "originLink": "https://www.ccc.de/en/updates/2024/2fa-sms",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40934495",
    "commentBody": "",
    "originSummary": [
      "Исследователи безопасности из CCC получили доступ к более чем 200 миллионам SMS-сообщений, содержащих одноразовые пароли от более чем 200 компаний, что подчеркивает уязвимости в 2FA-SMS.",
      "CCC продемонстрировал, что поставщики услуг, отправляющие 2FA-SMS, могут получить доступ к этим сообщениям и потенциально утечь их, как это было с IdentifyMobile, который обнародовал одноразовые пароли в реальном времени в интернете.",
      "Рекомендации включают использование одноразовых паролей, сгенерированных приложением, или аппаратных токенов для лучшей безопасности, так как 2FA-SMS остается уязвимым для атак, таких как подмена SIM-карты и эксплуатация SS7."
    ],
    "commentSummary": [
      "«Семейный друг стал жертвой фишинговой атаки через поддельный сайт \"BANKNAME login\", рекламируемый в Google, что привело к мошеннической транзакции.»",
      "«Инцидент подчеркивает, что хотя двухфакторная аутентификация на основе приложений (2FA) в целом более безопасна, SMS 2FA могла бы быть более эффективной в данном случае из-за своих сообщений, связанных с конкретными действиями.»",
      "Обсуждение подчеркивает необходимость систем двухфакторной аутентификации, которые генерируют специфические токены для различных транзакций, а также важность использования блокировщиков рекламы и улучшенных практик безопасности для предотвращения таких мошенничеств."
    ],
    "points": 245,
    "commentCount": 214,
    "retryCount": 0,
    "time": 1720683869
  },
  {
    "id": 40935971,
    "title": "Microsoft разрывает важную связь с Газой, заявляют палестинцы",
    "originLink": "https://www.bbc.com/news/articles/cger582weplo",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40935971",
    "commentBody": "",
    "originSummary": [
      "Палестинцы обвиняют Microsoft в несправедливом закрытии их учетных записей электронной почты, что влияет на доступ к важным услугам, таким как банковские операции, предложения работы и Skype, жизненно важные для общения в условиях израильской военной кампании.",
      "Microsoft ссылается на нарушения своих условий обслуживания, что оспаривается пострадавшими пользователями, которые подозревают неправильную ассоциацию с ХАМАС или подозреваемую мошенническую деятельность.",
      "Люди, такие как Эиад Хаметто, Салах Эльсади и Халид Обейд, сообщают о значительных нарушениях в их работе и семейной коммуникации, что приводит к разочарованию и недоверию к Microsoft."
    ],
    "commentSummary": [
      "Microsoft ограничила доступ к Skype и Hotmail для палестинцев в Газе, вызвав обвинения в соучастии в «полной осаде» Израиля.",
      "Пользователи не могут связаться с семьей или получить доступ к банковским счетам, связанным с их адресами Hotmail, что вызывает обеспокоенность по поводу влияния на основные услуги.",
      "Инцидент подчеркивает более широкую проблему контроля технологических компаний над критически важными услугами и потенциальную необходимость более открытых, децентрализованных платформ в зонах конфликтов."
    ],
    "points": 216,
    "commentCount": 134,
    "retryCount": 0,
    "time": 1720701064
  },
  {
    "id": 40932006,
    "title": "Изобилие Кэтрин: Теория игр в выборе имен для детей",
    "originLink": "https://arxiv.org/abs/2404.00732",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40932006",
    "commentBody": "",
    "originSummary": [
      "Статья под названием «Изобилие Кэтрин: Теория игр в выборе имен для детей» исследует конкурентный характер выбора имен для детей с использованием теории игр, предполагая, что родители выбирают имена на основе их уникальности.",
      "«Исследование использует чистую, удобную для анализа модель и расширяет свой анализ с помощью численных экспериментов и инструментов больших языковых моделей, предоставляя идеи и направления для будущих исследований.»",
      "Принята на SIGBOVIK 2024, статья классифицируется под Компьютерные науки и Теория игр (cs.GT) и Компьютеры и общество (cs.CY)."
    ],
    "commentSummary": [
      "«Юмористическая статья под названием \"Изобилие Кэтрин: Теория игр в выборе имен для детей\" исследует популярность и процесс выбора имен, производных от Кэтрин.»",
      "Статья, вероятно, поданная к Дню дурака, использует рекурсивные ссылки, шутки и игривые предположения для обсуждения тенденций в именовании, культурных влияний и сложностей выбора уникальных, но традиционных имен.",
      "Авторы, все с похожими именами, делают остроумные замечания и умные наблюдения, делая статью одновременно развлекательной и познавательной."
    ],
    "points": 213,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1720649321
  },
  {
    "id": 40934898,
    "title": "Большинство сайтов и приложений используют темные паттерны в маркетинге подписок",
    "originLink": "https://icpen.org/news/1360",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40934898",
    "commentBody": "",
    "originSummary": [
      "Глобальная проверка интернета ICPEN показала, что 75,7% из 642 веб-сайтов и мобильных приложений использовали как минимум один тёмный паттерн, а 66,8% использовали два или более.",
      "«Темные паттерны — это обманные онлайн-практики, которые манипулируют выбором потребителей, такие как ловушки автоматического продления и вмешательство в интерфейс.»",
      "Проверка, проведенная 27 органами по защите прав потребителей из 26 стран, подчеркивает пересечение защиты прав потребителей и конфиденциальности, с подробными отчетами, доступными в интернете."
    ],
    "commentSummary": [
      "Многие веб-сайты и приложения используют темные паттерны для навязывания подписок, что приводит к таким проблемам, как потеря доступа к аккаунту, неожиданные расходы и забытые подписки.",
      "Решения, такие как виртуальные дебетовые карты, централизованные инструменты управления подписками и оплата по счету, могут помочь смягчить эти проблемы.",
      "«Существует растущий призыв к законодательству, которое обязывает упрощенные процессы отмены для лучшей защиты потребителей от этих обманных практик.»"
    ],
    "points": 207,
    "commentCount": 222,
    "retryCount": 0,
    "time": 1720689812
  },
  {
    "id": 40930549,
    "title": "Большой ком грязи (1999)",
    "originLink": "http://laputan.org/mud/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40930549",
    "commentBody": "",
    "originSummary": [
      "«Архитектура программного обеспечения \"Большой ком грязи\" характеризуется хаотичной и целесообразной структурой, однако она остается распространенной из-за своей эффективности в определенных контекстах.»",
      "В статье выявляются такие шаблоны, как «Одноразовый код», «Постепенный рост» и «Слои сдвига», которые способствуют формированию таких систем.",
      "Понимание таких факторов, как временные ограничения, стоимость и сложность, которые приводят к созданию систем типа «Большой ком грязи», может помочь в разработке более долговечных и элегантных программных архитектур."
    ],
    "commentSummary": [
      "Обсуждение вращается вокруг концепции «Большой ком грязи» (BBoM), термина, используемого для описания программной системы без четкой архитектуры, часто возникающей в результате постоянных исправлений и отсутствия рефакторинга.",
      "Некоторые участники утверждают, что работа над BBoM может быть управляемой и даже «расслабленной», если только стремиться выполнять профессиональные обязанности, в то время как другие считают её душераздирающей и неудовлетворительной.",
      "«Разговор подчеркивает компромиссы между поддержанием BBoM для быстрых исправлений и долгосрочными преимуществами рефакторинга и чистого кода, с примерами из различных отраслей, таких как банковское дело и игровая индустрия.»"
    ],
    "points": 151,
    "commentCount": 128,
    "retryCount": 0,
    "time": 1720639772
  },
  {
    "id": 40935576,
    "title": "Если чат-боты с искусственным интеллектом — это будущее, я ненавижу это",
    "originLink": "https://www.jeffgeerling.com/blog/2024/if-ai-chatbots-are-future-i-hate-it",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40935576",
    "commentBody": "",
    "originSummary": [
      "Пользователь AT&T Fiber Internet столкнулся с существенным снижением скорости с ~1 Гбит/с до 8 Мбит/с, что вызвало разочарование и звонок в службу поддержки клиентов.",
      "Пользователь столкнулся с трудностями при общении с чат-ботом AI от AT&T, который путал 'WiFi' с 'Интернетом', и получил бесполезные ответы от представителя-человека.",
      "Инцидент подчеркивает продолжающиеся проблемы с поддержкой клиентов у интернет-провайдеров и ограничения текущих чат-ботов с искусственным интеллектом в эффективном решении технических проблем."
    ],
    "commentSummary": [
      "«Тенденция использования чат-ботов с искусственным интеллектом для обслуживания клиентов подвергается критике за то, что она отдаляет клиентов от человеческого взаимодействия, что, по мнению некоторых, свидетельствует о недостатке заботы со стороны компаний.»",
      "Автор утверждает, что, хотя чат-боты с искусственным интеллектом могут быть полезными, многие текущие реализации плохо спроектированы и вызывают разочарование, подчеркивая необходимость баланса между ИИ и поддержкой человека.",
      "Акцент делается на важности поддержки клиентов, предполагая, что приоритет краткосрочной прибыли над опытом клиентов является недальновидным и вредным для долгосрочного успеха."
    ],
    "points": 149,
    "commentCount": 169,
    "retryCount": 0,
    "time": 1720698063
  },
  {
    "id": 40935701,
    "title": "«Binance создала лог-сервис объемом 100 ПБ с помощью Quickwit»",
    "originLink": "https://quickwit.io/blog/quickwit-binance-story",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40935701",
    "commentBody": "",
    "originSummary": [
      "Binance успешно перешла с Elasticsearch на Quickwit, увеличив объем индексирования логов до 1,6 ПБ в день и управляя кластером поиска логов объемом 100 ПБ.",
      "Миграция привела к снижению затрат на вычисления на 80% и сокращению затрат на хранение в 20 раз, что значительно улучшило возможности сохранения логов и устранения неполадок.",
      "Нативная интеграция Quickwit с Kafka, встроенные преобразования VRL и использование объектного хранилища были ключевыми факторами в решении проблем управления логами Binance."
    ],
    "commentSummary": [
      "Binance разработала лог-сервис объемом 100PB (петабайт) с использованием Quickwit, подчеркивая необходимость обширного хранения логов в финансовых организациях для соблюдения нормативных требований.",
      "«Существует дискуссия о полезности логов по сравнению с метриками, при этом метрики считаются более эффективными для мониторинга состояния системы, а логи — для диагностики конкретных проблем.»",
      "Обсуждение подчеркивает важность балансировки затрат на хранение, эффективного управления журналами и политик хранения при обработке крупномасштабных данных журналов."
    ],
    "points": 147,
    "commentCount": 117,
    "retryCount": 0,
    "time": 1720699047
  },
  {
    "id": 40934582,
    "title": "Переусложненное резюме с использованием Zola, JSON Resume, Weasyprint и Nix (2023)",
    "originLink": "https://ktema.org/articles/the-overengineered-resume/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40934582",
    "commentBody": "",
    "originSummary": [
      "Автор, Дэвид Рид, описывает чрезмерно сложный подход к ведению резюме, сосредотачиваясь на разделении содержания и оформления, контроле версий и множественных форматах вывода.",
      "Используемые инструменты включают JSON Resume для представления данных, шаблонизатор Tera от Zola для шаблонов, Weasyprint для рендеринга PDF и NixOS для настройки окружения и управления зависимостями.",
      "Непрерывная интеграция достигается с помощью GitHub Actions для автоматизации рендеринга PDF при коммитах, что гарантирует актуальность резюме без ручного вмешательства."
    ],
    "commentSummary": [
      "Обсуждение на Hacker News исследует тенденцию чрезмерного усложнения резюме с использованием таких инструментов, как Zola, JSON Resume, Weasyprint и Nix, при этом некоторые пользователи выступают за LaTeX из-за его модульности и согласованности.",
      "«Альтернативы, такие как Typst и JSON Resume, упоминаются за их более простую настройку и лучшее управление ошибками, в то время как более простые методы, такие как Google Docs или LibreOffice, также предпочитаются некоторыми.»",
      "Консенсус подчеркивает, что хотя чрезмерное усложнение резюме может быть увлекательным, содержание резюме в конечном итоге важнее его оформления, особенно с учетом трудностей автоматического анализа резюме системами отслеживания кандидатов (ATS)."
    ],
    "points": 130,
    "commentCount": 76,
    "retryCount": 0,
    "time": 1720685198
  },
  {
    "id": 40935154,
    "title": "«Ядро Oryon от Qualcomm: долгое время в разработке»",
    "originLink": "https://chipsandcheese.com/2024/07/09/qualcomms-oryon-core-a-long-time-in-the-making/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40935154",
    "commentBody": "",
    "originSummary": [
      "«Ядро Oryon от Qualcomm, разработанное на основе технологий Nuvia, знаменует возвращение Qualcomm к внутренне разработанным SoC для смартфонов после восьмилетнего перерыва, дебютируя в Snapdragon X Elite.»",
      "«Snapdragon X1E-80-10 оснащен 12 ядрами Oryon, сгруппированными в три кластера по четыре ядра, каждый из которых имеет кэш L2 объемом 12 МБ, и демонстрирует передовую архитектуру с высокой способностью к переупорядочиванию и эффективным преобразованием адресов.»",
      "Qualcomm сталкивается с трудностями в преодолении проблем совместимости и высоких затрат на устройства, чтобы конкурировать с AMD и Intel, нуждаясь в сотрудничестве с OEM-производителями для предложения конкурентоспособных цен и улучшения совместимости программного обеспечения."
    ],
    "commentSummary": [
      "«Ядро Oryon от Qualcomm разрабатывалось долгое время, вызывая значительный интерес в технологическом сообществе.»",
      "Обсуждение подчеркивает чип M4 в iPad от Apple, отмеченный за его высокую производительность на одно ядро, но подвергнутый критике за недостаточное использование из-за ограничений операционной системы iPad OS.",
      "«Дебаты сосредоточены вокруг полезности мощных чипов в закрытых платформах, таких как iPad, по сравнению с более открытыми системами, такими как macOS или Linux, которые могут использовать такое оборудование для более широкого спектра профессиональных и технических приложений.»"
    ],
    "points": 129,
    "commentCount": 101,
    "retryCount": 0,
    "time": 1720693028
  },
  {
    "id": 40935443,
    "title": "Дети, которые раньше получают смартфоны, становятся взрослыми с худшим психическим здоровьем (2023)",
    "originLink": "https://www.afterbabel.com/p/sapien-smartphone-report",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40935443",
    "commentBody": "",
    "originSummary": [
      "Глобальное исследование, проведенное Sapien Labs, показывает, что дети, которые получают смартфоны в более раннем возрасте, имеют более плохое психическое здоровье во взрослом возрасте, причем более сильный эффект наблюдается у девочек.",
      "Исследование, в котором приняли участие почти миллион человек, показывает устойчивую закономерность в разных регионах и на разных языках, связывая раннее использование смартфонов с ухудшением психического здоровья в молодом возрасте.",
      "Исследование предполагает, что увеличенное воздействие социальных сетей и зависимость от телефонов могут способствовать этим проблемам с психическим здоровьем, призывая родителей, педагогов и политиков пересмотреть подходящий возраст для получения детьми смартфонов."
    ],
    "commentSummary": [
      "Пост обсуждает влияние раннего использования смартфонов на психическое здоровье детей, при этом мнения о его серьезности разделяются.",
      "«Некоторые утверждают, что, хотя смартфоны и социальные сети могут увеличивать тревожность и депрессию, их влияние не является повсеместно катастрофическим и варьируется в зависимости от региона.»",
      "Критики подчеркивают необходимость более строгих, рецензируемых исследований для установления причинно-следственной связи и устранения возможных подтверждающих предвзятостей в существующих исследованиях."
    ],
    "points": 119,
    "commentCount": 89,
    "retryCount": 0,
    "time": 1720696587
  },
  {
    "id": 40930983,
    "title": "Рецензия на книгу в NYT - это всё, чем не должна быть книжная критика",
    "originLink": "https://www.currentaffairs.org/news/new-york-times-book-review",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40930983",
    "commentBody": "",
    "originSummary": [
      "Ясмин Наир критикует обзор книг в New York Times за неспособность серьезно взаимодействовать с книгами и издательской индустрией, становясь безвкусным и неохотно выражая мнения.",
      "Обзор увековечивает вредные тенденции, такие как символическое использование писателей неевропейского происхождения и сосредоточение внимания на пяти крупнейших издательствах, что усиливает материальное неравенство в издательской сфере.",
      "Наир призывает к новому подходу к критике книг, который учитывает экономику издательского дела и поддерживает более широкий спектр голосов, подчеркивая долгосрочные негативные последствия текущих практик Review для книжной культуры."
    ],
    "commentSummary": [
      "«Обзор книг NYT часто критикуют за то, что он скучный, чрезмерно коммерческий и является частью комплекса MFA-издательства, из-за чего многие в литературном сообществе не воспринимают его всерьез.»",
      "«Альтернативы, такие как New York Review of Books (NYRB) и London Review of Books (LRB), хвалят за более содержательные эссе, в то время как небольшие журналы и сабреддиты предлагают оживленные обсуждения и рекомендации.»",
      "Список бестселлеров NYT воспринимается как предвзятый и манипулируемый, что способствует мнению о том, что книжное обозрение NYT уступает в глубине и оригинальности по сравнению с другими источниками литературных рецензий."
    ],
    "points": 111,
    "commentCount": 92,
    "retryCount": 0,
    "time": 1720642086
  }
]
