[
  {
    "id": 38012032,
    "title": "OpenAPI DevTools - rozšíření pro Chrome, které generuje specifikaci API",
    "originLink": "https://github.com/AndrewWalsh/openapi-devtools",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38012032",
    "commentBody": "",
    "originSummary": [
      "Bylo vyvinuto rozšíření pro Chrome, které dokáže v reálném čase generovat specifikace OpenAPI pro libovolnou aplikaci nebo webovou stránku.",
      "Tento nástroj zjednodušuje proces pochopení chování rozhraní API (Application Programming Interfaces).",
      "Specifikace OpenAPI poskytují formát pro popis, vytváření, konzumaci a vizualizaci webových služeb RESTful."
    ],
    "commentSummary": [
      "Rozšíření OpenAPI DevTools pro Chrome umožňuje uživatelům automaticky generovat specifikace OpenAPI pro webové stránky a aplikace v reálném čase.",
      "Uživatelé se mohou zapojit do diskusí o souvisejících nástrojích a projektech v oblasti správy rozhraní API a webové interoperability a předkládat návrhy na zlepšení a požadavky na přidané funkce.",
      "Rozhovor také zdůrazňuje význam integrace rozhraní API v případech, kdy informace o rozhraní nejsou veřejně dostupné, a poukazuje na reverzní inženýrství jako možnou metodu."
    ],
    "points": 733,
    "commentCount": 96,
    "retryCount": 0,
    "time": 1698236659
  },
  {
    "id": 38015277,
    "title": "iLeakage: Útoky na zařízení Apple založené na prohlížeči bez časového spekulativního spouštění",
    "originLink": "https://ileakage.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38015277",
    "commentBody": "",
    "originSummary": [
      "Útok iLeakage je útok postranním kanálem zaměřený na webový prohlížeč Safari v zařízeních Apple, který zneužívá spekulativní spouštění k přístupu k citlivým datům.",
      "Útok je schopen získat obsah schránky Gmail a automaticky vyplněná hesla, což poukazuje na potenciální zranitelnost zabezpečení při prohlížení webu.",
      "Výzkum byl podpořen řadou organizací a grantů a zaměřil se nejen na účinnost útoku, ale také na možnou obranu proti němu."
    ],
    "commentSummary": [
      "Byl zjištěn iLeakage, nový útok na prohlížeč Safari v zařízeních Apple. Mohl by potenciálně zpřístupnit automaticky vyplněné přihlašovací údaje z webových stránek.",
      "Přestože byla zranitelnost společnosti Apple nahlášena již před více než rokem, stále není vyřešena a týká se nejnovějších iPhonů, iPadů a stolních a přenosných počítačů Apple, ačkoli používání správce hesel zranitelnost nezvyšuje.",
      "Situace vyvolala diskuse o účinnosti izolace stránek v jiných prohlížečích, o době, kterou společnost Apple potřebovala k řešení zranitelnosti, a o složitosti zmírňování takových zranitelností."
    ],
    "points": 512,
    "commentCount": 189,
    "retryCount": 0,
    "time": 1698254149
  },
  {
    "id": 38012263,
    "title": "Loajální pracovníci jsou selektivně a ironicky využíváni.",
    "originLink": "https://www.sciencedirect.com/science/article/abs/pii/S0022103122001615",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38012263",
    "commentBody": "",
    "originSummary": [
      "Nedávná výzkumná studie naznačuje, že zaměstnanci, kteří jsou oceňováni za svou loajalitu, jsou často vybíráni manažery k vykořisťování, což může vést k nepříznivým výsledkům na pracovišti.",
      "Předpokladem tohoto využívání je vnímaná ochota loajálních zaměstnanců přinášet osobní oběti a souhlas s využíváním dále posiluje jejich pověst loajality.",
      "Studie zdůrazňuje škody, které může loajalita způsobit v určitých pracovních kontextech, a zdůrazňuje potřebu řešit vykořisťovatelské praktiky na pracovišti."
    ],
    "commentSummary": [
      "Diskuse se týká řady témat souvisejících s prací, například vykořisťování loajálních pracovníků, daňových sazeb, rovnováhy mezi pracovním a soukromým životem a vnímání tvrdé práce a úspěchu.",
      "Mezi další oblasti patří odměňování a dynamika moci, spokojenost s prací, význam zvyšování kvalifikace, problémy na pracovišti, kulturní pohled na práci a koncept všeobecné samostatné výdělečné činnosti s pracovními právy.",
      "Celkově příspěvek zdůrazňuje komplexní a mnohostrannou povahu práce a osvětluje její hodnotu, význam a potenciální výhody a nevýhody."
    ],
    "points": 406,
    "commentCount": 310,
    "retryCount": 0,
    "time": 1698238484
  },
  {
    "id": 38020109,
    "title": "Jina AI spouští open-source vkládání 8k textu",
    "originLink": "https://jina.ai/news/jina-ai-launches-worlds-first-open-source-8k-text-embedding-rivaling-openai/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38020109",
    "commentBody": "",
    "originSummary": [
      "Berlínská společnost Jina AI představila svou druhou generaci modelu vkládání textu, jina-embeddings-v2, který je otevřený a podporuje délku kontextu 8K, což je vlastnost, která zpochybňuje proprietární model OpenAI.",
      "Nový model údajně překonal OpenAI v mnoha srovnávacích testech a nabízí rozšířený kontext, který je přínosný pro aplikace, jako je zkoumání právních dokumentů, lékařský výzkum a konverzační AI.",
      "Mezi budoucí plány společnosti Jina AI patří vydání akademické práce, vývoj platformy API pro embeddings a spuštění vícejazyčných modelů, které rozšíří její dosah a všestrannost."
    ],
    "commentSummary": [
      "Společnost Jina AI představila model vkládání 8k textu s otevřeným zdrojovým kódem, což vyvolalo debaty o konceptu \"otevřenosti\", pokud jde o zveřejnění konkrétních údajů o tréninku a užitečnosti modelu pro úlohy, jako je vyhledávání a generování textu.",
      "Konkurenční společnost OpenAI uvedla na trh nový model vkládání textu s menší velikostí vektoru, který funguje efektivně a zajišťuje rychlé vyhledávání, a to i přes některé kontroverze kolem pojmenování modelu a jeho spojení s předchozími modely, jako je GPT-3.",
      "Diskuse se také zabývá výhodami a omezeními nového modelu, vztahem mezi různými modely OpenAI a obecně vnímanou efektivitou vkládání textu."
    ],
    "points": 360,
    "commentCount": 131,
    "retryCount": 0,
    "time": 1698279881
  },
  {
    "id": 38012008,
    "title": "První vakcína proti malárii snižuje úmrtnost v raném dětství",
    "originLink": "https://www.science.org/content/article/first-malaria-vaccine-slashes-early-childhood-deaths",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38012008",
    "commentBody": "",
    "originSummary": [
      "První vakcína proti malárii, Mosquirix (RTS,S), prokázala podle významné studie provedené v Africe 13% snížení úmrtnosti batolat a 22% snížení závažné malárie u dětí v průběhu téměř 4 let.",
      "Navzdory obavám ohledně bezpečnosti a účinnosti během klinických studií Světová zdravotnická organizace (WHO) schválila Mosquirix pro široké použití v roce 2021, přičemž jeho zavádění začne v roce 2022 v 17 zemích subsaharské Afriky, čímž potvrdila jeho potenciál pro záchranu životů.",
      "Problémem jsou náklady a implementace v zemích s omezenými zdroji, ačkoli WHO nedávno dala zelenou druhé, pravděpodobně cenově dostupnější a vydatnější vakcíně proti malárii, R-21."
    ],
    "commentSummary": [
      "První vakcína proti malárii, RTS,S, podle nedávné studie údajně snižuje úmrtnost dětí v raném věku o 13 %, což je významný pokrok v prevenci malárie.",
      "Kritici se však vyslovují pro to, aby byl před plošným zavedením proveden další výzkum, a vyjadřují obavy z možných vedlejších účinků a spolehlivosti studie kvůli možným nekontrolovaným faktorům a zkreslením.",
      "Příspěvek také podněcuje diskusi o širších otázkách, jako je integrita zkoušek léčiv, krize replikace ve vědeckém výzkumu a nutnost zlepšování zdravotní péče."
    ],
    "points": 347,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1698236415
  },
  {
    "id": 38019231,
    "title": "Stála rez za to?",
    "originLink": "https://jsoverson.medium.com/was-rust-worth-it-f43d171fb1b3",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38019231",
    "commentBody": "",
    "originSummary": [
      "Autor popisuje své zkušenosti s používáním jazyka Rust pro vývoj webových aplikací v průběhu tří let a zdůrazňuje jeho silný typový systém, nástroj pro kontrolu výpůjček a integrovaný testovací rámec.",
      "Jsou však zmíněny i nevýhody jazyka Rust, jako jsou nedostatky ve funkčnosti, omezení při rozšiřování knihoven, problémy se strukturováním projektů a problémy s prováděním asynchronního kódu.",
      "Autor dochází k závěru, že navzdory cenným vlastnostem Rustu nemusí být ideální pro projekty vyžadující rychlé iterace kvůli určitým překážkám a jeho vhodnosti pro projekty, u nichž lze počítat s počátečními náklady."
    ],
    "commentSummary": [
      "Diskuse se zabývá různými tématy programovacího jazyka, včetně produktivity a efektivity jazyka Rust, správy cyklických odkazů a kontrastu mezi jazyky Python a Rust.",
      "Rozhovor se zabývá ekosystémem, knihovnami různých jazyků, absencí jmenných prostorů ve správci balíčků Rust a bezpečnostními otázkami týkajícími se správce balíčků Cargo.",
      "Zahrnuje výhody a nevýhody různých systémů správy balíčků, používání závislostí, pojmenovávání balíčků, problematiku jmenných prostorů v jazyce Go, debatu o jmenných prostorech v registru balíčků jazyka Rust a výhody a nevýhody malé standardní knihovny jazyka Rust spolu se schopností překladačů jazyka C++ vytvářet diagnostiku chyb."
    ],
    "points": 329,
    "commentCount": 464,
    "retryCount": 0,
    "time": 1698273426
  },
  {
    "id": 38012662,
    "title": "Webové komponenty přežijí rámce JavaScriptu",
    "originLink": "https://jakelazaroff.com/words/web-components-will-outlive-your-javascript-framework/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38012662",
    "commentBody": "",
    "originSummary": [
      "Autor podporuje používání webových komponent v projektech blogů a uvádí výhody, jako je přenositelnost, dlouhá životnost a kompatibilita s různými generátory webových stránek.",
      "Autor dává přednost webovým komponentám na základě jejich schopnosti vykreslovat v jakémkoli prostředí HTML a jejich jednoduchosti.",
      "Důležité je používání prostého jazyka HTML v rámci webových komponent, používání stínového DOM pro izolaci komponent a dodržování webových standardů pro budoucí přístupnost a údržbu."
    ],
    "commentSummary": [
      "Článek se zabývá životností, výhodami a nedostatky používání webových komponent na rozdíl od frameworků JavaScriptu, přičemž se dotýká témat, jako je správa stavu, výkon a práce se složitými objekty.",
      "Zabývá se riziky, složitostí a omezeními různých frameworků, debatami o úloze front-end specialistů, se zvláštním důrazem na použití Reactu, a srovnáním s webovými komponentami.",
      "Diskuse se zabývá také obavami týkajícími se rozhraní API a jeho podpory webových komponent, jejich přijetí, použití na různých webech a v různých frameworcích a problémy s laděním, stylováním a možností použití témat."
    ],
    "points": 281,
    "commentCount": 217,
    "retryCount": 0,
    "time": 1698241244
  },
  {
    "id": 38018917,
    "title": "Jak najít ztracený telefon v kempu bez mobilního pokrytí?",
    "originLink": "https://manas.tech/blog/2023/10/25/approaching-unconventional-problems/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38018917",
    "commentBody": "",
    "originSummary": [
      "Autor vypráví svůj příběh o hledání ztraceného telefonu v odlehlé oblasti bez mobilních služeb během kempování pomocí chytrých technologií.",
      "Pomocí funkce tethering vlastního telefonu replikovali domácí síť wifi ztraceného telefonu a přiřadili mu stejné jméno a heslo.",
      "Pohybovali se po okolí, dokud nebylo zjištěno připojení k hotspotu, které je přímo dovedlo ke ztracenému telefonu, což svědčí o důmyslném a praktickém využití technických znalostí."
    ],
    "commentSummary": [
      "V článku jsou popsány osobní zkušenosti s používáním funkce Najít moje od společnosti Apple ke sledování ukradených předmětů, jako jsou sluchátka AirPods a MacBook, a zdůrazněny úspěšné i neúspěšné pokusy.",
      "Zabývá se technologickými aspekty funkce \"Find My\", konkrétně využitím technologií Bluetooth a WiFi, a také možnostmi vývoje sledovacích zařízení s otevřeným zdrojovým kódem pro lepší možnosti sledování.",
      "Přestože chválí pohodlí, které \"Find My\" nabízí, poukazuje na omezení současné technologie a vyjadřuje frustraci jednotlivců z nich."
    ],
    "points": 255,
    "commentCount": 168,
    "retryCount": 0,
    "time": 1698271082
  },
  {
    "id": 38013477,
    "title": "Muzeum internetových artefaktů",
    "originLink": "https://neal.fun/internet-artifacts/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38013477",
    "commentBody": "",
    "originSummary": [
      "Text je ucelenou sbírkou počítačových termínů a slangu, které se mezi informatiky běžně používají.",
      "Nabízí historickou časovou osu, na které jsou zvýrazněny klíčové milníky internetu, od vzniku první webové stránky a webové kamery až po první nevyžádanou poštu.",
      "Představuje přehled mnoha témat, jako je programování, hackerská kultura a rané postupy internetové komunikace."
    ],
    "commentSummary": [
      "Muzeum internetových artefaktů představuje interaktivní prvky z historie internetu a podněcuje diskuse mezi uživateli Hacker News o jejich původu a historickém kontextu.",
      "Konverzace se dále rozšiřuje o odkazy na významné webové stránky a hry minulosti a o návrhy na další artefakty, které by bylo možné prezentovat.",
      "Na fóru se také diskutuje o proměně webu v průběhu času a o roli, kterou v tomto vývoji hrají technologické společnosti."
    ],
    "points": 250,
    "commentCount": 54,
    "retryCount": 0,
    "time": 1698245673
  },
  {
    "id": 38015169,
    "title": "Přidávání drceného kamene na zemědělskou půdu odčerpává uhlík ze vzduchu",
    "originLink": "https://www.ucdavis.edu/climate/news/adding-crushed-rock-farmland-pulls-carbon-out-air",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38015169",
    "commentBody": "",
    "originSummary": [
      "Výzkumníci z Kalifornské univerzity v Davisu a Cornellovy univerzity zjistili, že drcená sopečná hornina přidaná na zemědělskou půdu může absorbovat oxid uhličitý, a to i v suchém podnebí.",
      "Tato metoda se nazývá zvětrávání hornin, při kterém se v půdě zachycuje uhlík. Tento proces se urychluje drcením horniny na jemný prach.",
      "Během intenzivního sucha v Kalifornii ukázala terénní studie, že oblasti s drcenou horninou uložily 0,15 tuny oxidu uhličitého na hektar, což naznačuje, že zvýšené zvětrávání hornin je účinným nástrojem pro zachycování a zmírňování emisí uhlíku."
    ],
    "commentSummary": [
      "Pasáž pojednává o možnostech využití drcených hornin, jako je olivín nebo čedič, k odstraňování oxidu uhličitého z atmosféry, což by mohlo pomoci v boji proti změně klimatu.",
      "Existují však obavy ohledně emisí uhlíku vznikajících při těžbě a přepravě těchto hornin, dlouhodobé účinnosti této metody a možných dopadů na zdraví půdy.",
      "Text se zabývá proveditelností, škálovatelností a ekonomickou životaschopností tohoto přístupu a jeho dopady na obnovitelné zdroje energie, průmyslová odvětví a společenské struktury."
    ],
    "points": 244,
    "commentCount": 249,
    "retryCount": 0,
    "time": 1698253738
  },
  {
    "id": 38014069,
    "title": "Počkat, co je to záložka?",
    "originLink": "https://thehistoryoftheweb.com/postscript/wait-whats-a-bookmarklet/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38014069",
    "commentBody": "",
    "originSummary": [
      "Článek podrobně popisuje historii a vývoj adres URL v jazyce JavaScript, označovaných také jako bookmarklety, a způsob jejich implementace do webových prohlížečů.",
      "Popisuje, jak se adresy URL v JavaScriptu původně používaly k manipulaci s obsahem webových stránek a k jeho úpravám a jak se díky rozsáhlým nástrojům pro sdílení staly mezi uživateli populárními.",
      "Článek dále zkoumá vznik rozšíření prohlížeče jako alternativy k záložkám, což znamená jejich rostoucí význam."
    ],
    "commentSummary": [
      "Příspěvek se zaměřuje především na bookmarklety, což jsou malé úryvky kódu v jazyce JavaScript, které lze uložit jako záložky pro různé funkce ve webových prohlížečích.",
      "Komentátoři upozorňují na své oblíbené záložky a diskutují o jejich použitelnosti při úkolech, jako je přizpůsobení, zvýšení produktivity a změna webových stránek.",
      "Diskuse zahrnuje také možná rizika a omezení používání záložek a zdroje pro jejich odhalení a vytvoření. Proto jsou bookmarklety považovány za cenné nástroje pro obohacení zážitků z prohlížení webu."
    ],
    "points": 219,
    "commentCount": 149,
    "retryCount": 0,
    "time": 1698249022
  },
  {
    "id": 38016849,
    "title": "Myslím, že GCP je lepší než AWS (2020)",
    "originLink": "https://nandovillalba.medium.com/why-i-think-gcp-is-better-than-aws-ea78f9975bda",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38016849",
    "commentBody": "",
    "originSummary": [
      "V článku jsou uvedeny osobní zkušenosti autora s platformou Google Cloud Platform (GCP) a Amazon Web Services (AWS), přičemž GCP je chválena pro svou uživatelskou přívětivost, pokročilou implementaci Kubernetes, bezpečnost a škálovatelnost.",
      "Přestože autor uznává širší nabídku funkcí AWS, považuje GCP za spolehlivější a inovativnější, zatímco AWS kritizuje za složité rozhraní a nedostatek automatizace.",
      "Autor se krátce zmiňuje o své nechuti k Microsoft Azure, probírá transformaci DevOps na Platform Engineering a představuje nový nástroj známý jako Azure Analytics Architecture Advisor."
    ],
    "commentSummary": [
      "V diskusi se porovnávají různé vlastnosti cloudových platforem Google (GCP) a Amazon Web Service (AWS), včetně nabídky služeb, podpory, spolehlivosti, snadnosti použití, nákladů, dokumentace, dlouhodobých závazků a uživatelských zkušeností.",
      "Účastníci vyjádřili obavy ohledně možného ukončení některých služeb GCP a spolehlivosti závazků společnosti Google.",
      "Názory se různí: někteří uživatelé dávají přednost GCP pro jeho jedinečné funkce a uživatelsky přívětivé rozhraní, zatímco jiní se přiklánějí k AWS pro jeho spolehlivou podporu a stabilitu."
    ],
    "points": 208,
    "commentCount": 333,
    "retryCount": 0,
    "time": 1698260514
  },
  {
    "id": 38017146,
    "title": "Průlom v umělé inteligenci: neuronová síť má schopnost zobecňovat jazyk podobnou lidskému.",
    "originLink": "https://www.nature.com/articles/d41586-023-03272-3",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38017146",
    "commentBody": "",
    "originSummary": [
      "Výzkumníci vytvořili neuronovou síť, která dokáže zobecňovat jazyk podobně jako lidé a překonává chatbota ChatGPT v začleňování nově získaných slov do stávajících slovníků a různých kontextů.",
      "Tento technologický pokrok by mohl vyústit v organičtější interakce mezi lidmi a stroji.",
      "Studie naznačuje, že neuronové sítě mohou provádět systematickou generalizaci, což je klíčová součást lidského poznávání, která byla dříve v oblasti umělé inteligence sporným tématem."
    ],
    "commentSummary": [
      "Vědci vytvořili neuronovou síť s porozuměním a produkcí jazyka podobnou lidskému, která se může pochlubit 85% účinností při vytváření barevných sekvencí na základě instrukcí.",
      "Kritici tvrdí, že tento úspěch může být výsledkem pohotového inženýrství, a neustále se diskutuje o překážkách testování, zaujatosti, spravedlnosti a reprodukovatelnosti jazykových modelů.",
      "V příspěvku je vysvětlen systém GPT-4, zmíněna jeho menší slovní zásoba a potenciál pro škálování a nový jazykový model, který dokáže vytvářet a chápat nová slova a který byl vycvičen na více než 8 milionech anglických slov."
    ],
    "points": 177,
    "commentCount": 56,
    "retryCount": 0,
    "time": 1698262125
  },
  {
    "id": 38014812,
    "title": "Nil: Postgres bez serveru pro moderní SaaS",
    "originLink": "https://www.thenile.dev/blog/introducing-nile",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38014812",
    "commentBody": "",
    "originSummary": [
      "Nile, bezserverová databáze Postgres, je navržena pro aplikace SaaS, které se snaží zjednodušit vývoj a škálování tím, že poskytuje izolaci tenantů, zálohování pro jednotlivé tenanty a prostředí bez serveru.",
      "Klade důraz na virtuální databáze nájemců pro izolaci dat mezi různými zákazníky a zahrnuje funkce, jako je směrování dotazů do správných databází nájemců a sdílení dat mezi nájemci.",
      "Aplikace Nile je založena na umělé inteligenci a poskytuje prvotřídní podporu pro správu uživatelů v rámci nájemců s vestavěnou správou ověřování a oprávnění. Nabízí zdroje pro uživatele a podporuje prosperující komunitu vývojářů."
    ],
    "commentSummary": [
      "Nile je bezserverová databáze Postgres přizpůsobená moderním aplikacím SaaS (Software as a Service), která nabízí více nájemců, možnosti směrování a virtualizaci nájemců pro lepší škálovatelnost.",
      "Společnost Nile klade důraz na přenositelnost a snadnou migraci, čímž zabraňuje vendor lock-in. Umožňuje pečlivou kontrolu nad nájemci a zahrnuje sdílené tabulky pro replikaci dat.",
      "V současné době je Nile k dispozici pouze prostřednictvím dokumentace a příkladů, přičemž společnost může v budoucnu nabídnout možnost DIY (Do-It-Yourself)."
    ],
    "points": 165,
    "commentCount": 112,
    "retryCount": 0,
    "time": 1698252355
  },
  {
    "id": 38013955,
    "title": "Projekt SpaceX Starship Super Heavy na kosmodromu Boca Chica",
    "originLink": "https://www.faa.gov/space/stakeholder_engagement/spacex_starship",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38013955",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Osnova se zabývá širokou škálou otázek týkajících se Elona Muska a společnosti SpaceX a dotýká se debat o bezpečnosti startu, dopadu na životní prostředí, ambiciózních nárocích a raketě Starship společnosti SpaceX.",
      "Diskutuje se o sbližování vesmírných teleskopů a satelitů Starlink a také o různých názorech na Muskův styl řízení a kontroverzní používání Twitteru.",
      "Podrobné diskuse a debaty se zaměřují na dopad činnosti společnosti SpaceX na chráněné mokřady, udržitelnost a nezbytnost vesmírných misí a potenciální využití lodi Starship pro vojenské účely."
    ],
    "points": 163,
    "commentCount": 522,
    "retryCount": 0,
    "time": 1698248357
  }
]
