[
  {
    "id": 38012032,
    "title": "OpenAPI DevTools - امتداد Chrome الذي ينشئ مواصفات واجهة برمجة التطبيقات",
    "originLink": "https://github.com/AndrewWalsh/openapi-devtools",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38012032",
    "commentBody": "",
    "originSummary": [
      "تم تطوير إضافة Chrome يمكنها إنشاء مواصفات OpenAPI لأي تطبيق أو موقع ويب في الوقت الفعلي.",
      "تعمل هذه الأداة على تبسيط عملية فهم سلوك واجهات برمجة التطبيقات (واجهات برمجة التطبيقات).",
      "توفر مواصفات OpenAPI تنسيقا لوصف خدمات الويب RESTful وإنتاجها واستهلاكها وتصورها."
    ],
    "commentSummary": [
      "تتيح إضافة OpenAPI DevTools Chrome للمستخدمين إنشاء مواصفات OpenAPI تلقائيا لمواقع الويب والتطبيقات في الوقت الفعلي.",
      "ينظر إلى المستخدمين على أنهم يشاركون في مناقشات حول الأدوات والمشاريع المرتبطة في إدارة واجهة برمجة التطبيقات وقابلية التشغيل البيني للويب ، مع اقتراحات للتحسينات وطلبات الميزات المضافة.",
      "تسلط المحادثة الضوء أيضا على أهمية تكامل واجهة برمجة التطبيقات في الحالات التي تكون فيها معلومات الواجهة غير متاحة للجمهور وتشير إلى الهندسة العكسية كطريقة ممكنة."
    ],
    "points": 733,
    "commentCount": 96,
    "retryCount": 0,
    "time": 1698236659
  },
  {
    "id": 38015277,
    "title": "iLeakage: هجمات تنفيذ مضاربة بدون مؤقت تعتمد على المتصفح على أجهزة Apple",
    "originLink": "https://ileakage.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38015277",
    "commentBody": "",
    "originSummary": [
      "هجوم iLeakage هو هجوم قناة جانبية خاص بالمتصفح موجه إلى متصفح الويب Safari على أجهزة Apple ، ويستغل التنفيذ التخميني للوصول إلى البيانات الحساسة.",
      "الهجوم قادر على استرداد محتوى البريد الوارد في Gmail وكلمات المرور المملوءة تلقائيا ، مما يسلط الضوء على نقاط الضعف المحتملة في أمان تصفح الويب.",
      "تم دعم البحث من قبل العديد من المنظمات والمنح ، مع التركيز ليس فقط على فعالية الهجوم ولكن أيضا على الدفاعات المحتملة ضده."
    ],
    "commentSummary": [
      "تم اكتشاف iLeakage ، وهو هجوم جديد قائم على المتصفح يؤثر على Safari على أجهزة Apple. من المحتمل أن يصل إلى بيانات الاعتماد المملوءة تلقائيا من مواقع الويب.",
      "على الرغم من إبلاغ Apple منذ أكثر من عام ، إلا أن الثغرة الأمنية لا تزال دون حل ، مما يؤثر على أجهزة iPhone و iPad وأجهزة Apple المكتبية والمحمولة الحديثة ، على الرغم من أن استخدام مدير كلمات المرور لا يزيد من الضعف.",
      "أثار الموقف مناقشات حول فعالية عزل الموقع في المتصفحات الأخرى ، والوقت الذي استغرقته Apple لمعالجة الثغرة الأمنية ، وتعقيدات التخفيف من هذه الثغرات الأمنية."
    ],
    "points": 512,
    "commentCount": 189,
    "retryCount": 0,
    "time": 1698254149
  },
  {
    "id": 38012263,
    "title": "يتم استهداف العمال المخلصين بشكل انتقائي ومثير للسخرية للاستغلال",
    "originLink": "https://www.sciencedirect.com/science/article/abs/pii/S0022103122001615",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38012263",
    "commentBody": "",
    "originSummary": [
      "تشير دراسة بحثية حديثة إلى أن الموظفين الذين يتم الاحتفال بولائهم غالبا ما يتم اختيارهم للاستغلال من قبل المديرين ، مما قد يؤدي إلى نتائج سلبية في مكان العمل.",
      "الافتراض الكامن وراء هذا الاستغلال هو الاستعداد المتصور للموظفين المخلصين لتقديم تضحيات شخصية ، والموافقة على الاستغلال يعزز سمعتهم في الولاء.",
      "وتؤكد الدراسة على الضرر الذي يمكن أن يسببه الولاء في سياقات عمل معينة، مشددة على الحاجة إلى معالجة الممارسات الاستغلالية في مكان العمل."
    ],
    "commentSummary": [
      "تغطي المناقشة مجموعة من الموضوعات المتعلقة بالعمل ، مثل استغلال العمال المخلصين ، ومعدلات الضرائب ، والتوازن بين العمل والحياة ، وتصورات العمل الجاد مقابل النجاح.",
      "وتشمل المجالات الأخرى ديناميكيات التعويض والسلطة ، والرضا الوظيفي ، وأهمية تحسين المهارات ، وتحديات مكان العمل ، والمنظورات الثقافية للعمل ، ومفهوم العمل الحر العالمي مع حقوق العمال.",
      "بشكل عام ، يؤكد المنشور على الطبيعة المعقدة والمتعددة الأوجه للعمل ، ويسلط الضوء على قيمته ومعناه وفوائده وعيوبه المحتملة."
    ],
    "points": 406,
    "commentCount": 310,
    "retryCount": 0,
    "time": 1698238484
  },
  {
    "id": 38020109,
    "title": "جينا الذكاء الاصطناعي تطلق تضمين نص 8K مفتوح المصدر",
    "originLink": "https://jina.ai/news/jina-ai-launches-worlds-first-open-source-8k-text-embedding-rivaling-openai/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38020109",
    "commentBody": "",
    "originSummary": [
      "كشفت شركة Jina الذكاء الاصطناعي ، وهي شركة الذكاء الاصطناعي مقرها برلين ، النقاب عن نموذج تضمين النص من الجيل الثاني ، jina-embeddings-v2 ، وهو مفتوح المصدر ويدعم طول سياق 8K ، وهي خاصية تتحدى نموذج OpenAI الخاص.",
      "يقال إن النموذج الجديد قد تفوق على OpenAI في العديد من المعايير ، حيث يوفر سياقا موسعا مفيدا لتطبيقات مثل فحص المستندات القانونية والبحوث الطبية الذكاء الاصطناعي المحادثة.",
      "تشمل خطط جينا الذكاء الاصطناعي المستقبلية نشر ورقة أكاديمية ، وتطوير منصة API مضمنة ، وإطلاق نماذج متعددة اللغات لتوسيع نطاق وصولها وتعدد استخداماتها."
    ],
    "commentSummary": [
      "قدمت جينا الذكاء الاصطناعي نموذجا مفتوحا لتضمين النص بدقة 8K ، مما أثار مناقشات حول مفهوم \"الانفتاح\" فيما يتعلق بالكشف عن تفاصيل التدريب وفائدة النموذج لمهام مثل استرجاع النص وتوليده.",
      "بالتنافس ضدها ، أطلقت OpenAI نموذجا جديدا لتضمين النص بحجم متجه أصغر ، والذي يعمل بفعالية ويضمن عمليات بحث سريعة ، على الرغم من بعض الجدل حول تسمية النموذج وارتباطه بالنماذج السابقة مثل GPT-3.",
      "يتعمق الخطاب أيضا في مزايا وقيود النموذج الجديد ، والعلاقة بين نماذج OpenAI المختلفة ، والكفاءة المتصورة بشكل عام لتضمين النص."
    ],
    "points": 360,
    "commentCount": 131,
    "retryCount": 0,
    "time": 1698279881
  },
  {
    "id": 38012008,
    "title": "أول لقاح للملاريا يخفض معدل الوفيات في مرحلة الطفولة المبكرة",
    "originLink": "https://www.science.org/content/article/first-malaria-vaccine-slashes-early-childhood-deaths",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38012008",
    "commentBody": "",
    "originSummary": [
      "أظهر أول لقاح للملاريا ، Mosquirix (RTS ، S) ، انخفاضا بنسبة 13٪ في وفيات الأطفال الصغار وانخفاضا بنسبة 22٪ في الملاريا الشديدة لدى الأطفال على مدار 4 سنوات تقريبا ، وفقا لدراسة مهمة أجريت في إفريقيا.",
      "على الرغم من المخاوف المتعلقة بالسلامة والفعالية أثناء التجارب السريرية ، وافقت منظمة الصحة العالمية (WHO) على استخدام Mosquirix على نطاق واسع في عام 2021 ، مع بدء طرحه في عام 2022 في 17 دولة أفريقية جنوب الصحراء الكبرى ، مما يؤكد إمكاناته في إنقاذ الأرواح.",
      "وتشكل قضايا التكلفة والتنفيذ في الدول المحدودة الموارد مصدر قلق، على الرغم من أن لقاحا ثانيا للملاريا ربما يكون أكثر وفرة وبأسعار معقولة، وهو R-21، قد حصل مؤخرا على الضوء الأخضر من منظمة الصحة العالمية."
    ],
    "commentSummary": [
      "أفادت التقارير أن أول لقاح للملاريا ، RTS ، S ، يقلل من وفيات الأطفال المبكرة بنسبة 13٪ وفقا لدراسة حديثة ، مما يسلط الضوء على تقدم كبير في الوقاية من الملاريا.",
      "ومع ذلك ، يجادل النقاد بإجراء أبحاث إضافية قبل التنفيذ على نطاق واسع ، مما يثير مخاوف بشأن الآثار الجانبية المحتملة وموثوقية الدراسة بسبب العوامل والتحيزات المحتملة غير المنضبطة.",
      "كما أثار المنشور مناقشات حول قضايا أوسع مثل نزاهة تجارب الأدوية ، وأزمة التكرار في البحث العلمي ، وضرورة تحسين الرعاية الصحية."
    ],
    "points": 347,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1698236415
  },
  {
    "id": 38019231,
    "title": "هل كان الصدأ يستحق كل هذا العناء؟",
    "originLink": "https://jsoverson.medium.com/was-rust-worth-it-f43d171fb1b3",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38019231",
    "commentBody": "",
    "originSummary": [
      "يعبر المؤلف عن تجربته في استخدام Rust لتطوير الويب على مدار ثلاث سنوات ، مع تسليط الضوء على نظام النوع القوي ، ومدقق الاقتراض ، وإطار الاختبار المتكامل.",
      "ومع ذلك ، تم ذكر الجوانب السلبية ل Rust أيضا ، مثل الثغرات في الوظائف ، والقيود المفروضة على تحسين المكتبة ، وتحديات هيكلة المشروع ، ومشكلات تنفيذ التعليمات البرمجية غير المتزامنة.",
      "يخلص المؤلف إلى أنه على الرغم من ميزات Rust القيمة ، فقد لا يكون مثاليا للمشاريع التي تتطلب تكرارا سريعا بسبب بعض العقبات ومدى ملاءمتها للمشاريع التي يمكن فيها استيعاب تكلفة مقدمة."
    ],
    "commentSummary": [
      "يدرس الخطاب مجموعة متنوعة من موضوعات لغة البرمجة ، بما في ذلك إنتاجية Rust وفعاليتها ، وإدارة المراجع الدورية ، والتباين بين Python و Rust.",
      "تتناول المحادثة النظام البيئي ، ومكتبات اللغات المختلفة ، وغياب مدير الطرود في Rust لمساحات الأسماء ، والمخاوف الأمنية المتعلقة بمدير طرود Cargo .",
      "وهو يتضمن إيجابيات وسلبيات أنظمة إدارة الحزم المختلفة ، واستخدام التبعية ، وتسمية الحزمة ، وقضايا تباعد الأسماء في Go ، والنقاش حول مساحات الأسماء في سجل حزم Rust ، ومزايا وعيوب مكتبة Rust القياسية الصغيرة ، جنبا إلى جنب مع قدرة مترجمي C ++ على إنتاج تشخيصات الأخطاء."
    ],
    "points": 329,
    "commentCount": 464,
    "retryCount": 0,
    "time": 1698273426
  },
  {
    "id": 38012662,
    "title": "ستعيش مكونات الويب أكثر من أطر عمل جافا سكريبت",
    "originLink": "https://jakelazaroff.com/words/web-components-will-outlive-your-javascript-framework/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38012662",
    "commentBody": "",
    "originSummary": [
      "يروج المؤلف لاستخدام مكونات الويب في مشاريع المدونات ، مستشهدا بفوائد مثل قابلية النقل وطول العمر والتوافق مع مولدات مواقع الويب المختلفة.",
      "يعتمد تفضيل المؤلف لمكونات الويب على قدرتها على تقديمها في أي بيئة HTML وطبيعتها المبسطة.",
      "يتم وضع الأهمية على استخدام HTML عادي داخل مكونات الويب ، واستخدام DOM الظل لعزل المكونات ، والالتزام بمعايير الويب لإمكانية الوصول والصيانة في المستقبل."
    ],
    "commentSummary": [
      "تستكشف المقالة طول العمر والفوائد وأوجه القصور في استخدام مكونات الويب بدلا من أطر عمل JavaScript ، مع التطرق إلى موضوعات مثل إدارة الحالة والأداء ومعالجة الكائنات المعقدة.",
      "ويوضح مخاطر وتعقيد وقيود الأطر المختلفة ، والمناقشات حول دور المتخصصين في الواجهة الأمامية ، مع التركيز بشكل خاص على استخدام React ، والمقارنة مع مكونات الويب.",
      "تتناول المناقشة أيضا المخاوف المتعلقة بواجهة برمجة التطبيقات ودعمها لمكونات الويب ، واعتمادها ، واستخدامها عبر المواقع وأطر العمل ، والتحديات المتعلقة بتصحيح الأخطاء والتصميم وقابلية السمة."
    ],
    "points": 281,
    "commentCount": 217,
    "retryCount": 0,
    "time": 1698241244
  },
  {
    "id": 38018917,
    "title": "كيف تجد هاتفا مفقودا في موقع تخييم بدون تغطية خلوية؟",
    "originLink": "https://manas.tech/blog/2023/10/25/approaching-unconventional-problems/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38018917",
    "commentBody": "",
    "originSummary": [
      "يروي المؤلف قصتهم عن تحديد موقع هاتف في غير محله في منطقة نائية خالية من الخدمة الخلوية أثناء التخييم عبر الاستخدام الذكي للتكنولوجيا.",
      "باستخدام وظيفة الربط لهواتفهم الخاصة ، قاموا بتكرار شبكة wifi المنزلية للهاتف المفقود ، وتعيين نفس الاسم وكلمة المرور له.",
      "تحركوا في جميع أنحاء المنطقة حتى تم اكتشاف اتصال بنقطة الاتصال ، مما أدى بهم مباشرة إلى الهاتف المفقود ، مما يشير إلى تطبيق بارع وعملي للخبرة الفنية."
    ],
    "commentSummary": [
      "تستعرض المقالة التجارب الشخصية لاستخدام ميزة \"Find My\" من Apple لتتبع العناصر المسروقة ، مثل AirPods و MacBook ، مع التركيز على كل من المساعي الناجحة وغير الناجحة.",
      "يتعمق في الجوانب التكنولوجية ل \"Find My\" ، وتحديدا استخدام Bluetooth و WiFi ، بالإضافة إلى إمكانات تطوير أجهزة تتبع مفتوحة المصدر لتحسين قدرات التتبع.",
      "على الرغم من الإشادة بالراحة التي يوفرها \"Find My\" ، إلا أنه يشير إلى قيود التكنولوجيا الحالية ويعبر عن إحباط الأفراد منها."
    ],
    "points": 255,
    "commentCount": 168,
    "retryCount": 0,
    "time": 1698271082
  },
  {
    "id": 38013477,
    "title": "متحف القطع الأثرية على الإنترنت",
    "originLink": "https://neal.fun/internet-artifacts/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38013477",
    "commentBody": "",
    "originSummary": [
      "النص عبارة عن مجموعة شاملة من المصطلحات المتعلقة بالكمبيوتر والعامية المستخدمة بشكل سائد بين علماء الكمبيوتر.",
      "يقدم جدولا زمنيا تاريخيا يسلط الضوء على المعالم الرئيسية على الإنترنت ، من بداية أول موقع ويب وكاميرا ويب إلى أول بريد إلكتروني غير مرغوب فيه.",
      "يقدم نظرة عامة على العديد من الموضوعات مثل البرمجة وثقافة القراصنة وممارسات الاتصال المبكرة عبر الإنترنت."
    ],
    "commentSummary": [
      "يقدم متحف القطع الأثرية على الإنترنت عناصر تفاعلية من تاريخ الإنترنت ، مما يحفز المناقشات بين مستخدمي Hacker News حول أصولهم وسياقهم التاريخي.",
      "تتوسع المحادثة لتشمل إشارات إلى مواقع الويب والألعاب البارزة في الماضي ، إلى جانب اقتراحات لمزيد من القطع الأثرية لعرضها.",
      "أيضا ، يشهد المنتدى مناقشات حول تحول الويب بمرور الوقت والدور الذي تلعبه شركات التكنولوجيا في هذا التطور."
    ],
    "points": 250,
    "commentCount": 54,
    "retryCount": 0,
    "time": 1698245673
  },
  {
    "id": 38015169,
    "title": "إضافة الصخور المكسرة إلى الأراضي الزراعية تسحب الكربون من الهواء",
    "originLink": "https://www.ucdavis.edu/climate/news/adding-crushed-rock-farmland-pulls-carbon-out-air",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38015169",
    "commentBody": "",
    "originSummary": [
      "اكتشف باحثون من جامعة كاليفورنيا وديفيس وجامعة كورنيل أن الصخور البركانية المسحوقة المضافة إلى الأراضي الزراعية يمكن أن تمتص ثاني أكسيد الكربون ، حتى في المناخات القاحلة.",
      "تسمى هذه الطريقة التجوية الصخرية ، التي تحبس الكربون في التربة. يتم تسريع هذه العملية عن طريق سحق الصخور إلى غبار ناعم.",
      "خلال الجفاف الشديد في كاليفورنيا ، كشفت دراسة ميدانية أن المناطق ذات الصخور المسحوقة تخزن 0.15 طن من ثاني أكسيد الكربون لكل هكتار ، مما يشير إلى تعزيز التجوية الصخرية كأداة إنتاجية لاحتجاز الكربون والتخفيف من حدته."
    ],
    "commentSummary": [
      "يناقش المقطع إمكانية استخدام الصخور المجروقة ، مثل الزبرجد الزيتوني أو البازلت ، لإزالة ثاني أكسيد الكربون من الغلاف الجوي ، مما قد يساعد في مكافحة تغير المناخ.",
      "ومع ذلك ، هناك مخاوف بشأن انبعاثات الكربون المتولدة أثناء تعدين ونقل هذه الصخور ، وفعالية هذه الطريقة على المدى الطويل ، والآثار المحتملة على صحة التربة.",
      "يناقش النص جدوى هذا النهج وقابليته للتوسع وجدواه اقتصاديا، إلى جانب آثاره على مصادر الطاقة المتجددة والصناعات والهياكل المجتمعية."
    ],
    "points": 244,
    "commentCount": 249,
    "retryCount": 0,
    "time": 1698253738
  },
  {
    "id": 38014069,
    "title": "انتظر ، ما هو التطبيق المختصر؟",
    "originLink": "https://thehistoryoftheweb.com/postscript/wait-whats-a-bookmarklet/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38014069",
    "commentBody": "",
    "originSummary": [
      "توضح المقالة تاريخ وتطور عناوين URL لجافا سكريبت ، والتي يشار إليها أيضا باسم الإشارات المرجعية ، وكيف تم تنفيذها في متصفحات الويب.",
      "يصف كيف تم استخدام عناوين URL لجافا سكريبت في البداية لمعالجة محتوى صفحة الويب وتغييره ، كما أن أدوات المشاركة الموسعة جعلتها شائعة بين المستخدمين.",
      "يستكشف المقال كذلك ظهور ملحقات المتصفح كبديل للإشارات المرجعية ، مما يدل على أهميتها المتزايدة."
    ],
    "commentSummary": [
      "يركز المنشور بشكل أساسي على الإشارات المرجعية ، وهي مقتطفات شفرة جافا سكريبت صغيرة يمكن تخزينها كإشارات مرجعية لوظائف مختلفة في متصفحات الويب.",
      "يسلط المعلقون الضوء على الإشارات المرجعية المفضلة لديهم ويناقشون قابليتها للتطبيق في مهام مثل التخصيص وتحسين الإنتاجية وتغيير موقع الويب.",
      "تشمل المناقشة أيضا المخاطر والقيود المحتملة لاستخدام الإشارات المرجعية ، إلى جانب الموارد اللازمة لاكتشافها وصياغتها. وبالتالي ، ينظر إلى الإشارات المرجعية على أنها أدوات قيمة لإثراء تجارب تصفح الويب."
    ],
    "points": 219,
    "commentCount": 149,
    "retryCount": 0,
    "time": 1698249022
  },
  {
    "id": 38016849,
    "title": "أعتقد أن GCP أفضل من AWS (2020)",
    "originLink": "https://nandovillalba.medium.com/why-i-think-gcp-is-better-than-aws-ea78f9975bda",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38016849",
    "commentBody": "",
    "originSummary": [
      "تعرض المقالة تجارب المؤلف الشخصية مع Google Cloud Platform (GCP) و Amazon Web Services (AWS) ، وتثني على GCP لسهولة الاستخدام وتنفيذ Kubernetes المتقدم والأمان وقابلية التوسع.",
      "على الرغم من الاعتراف بمجموعة ميزات AWS الأوسع ، يرى المؤلف أن GCP أكثر موثوقية وابتكارا ، بينما ينتقد AWS لواجهته المعقدة وافتقاره إلى الأتمتة.",
      "يذكر المؤلف بإيجاز كرههم ل Microsoft Azure ، ويناقش تحويل DevOps إلى هندسة النظام الأساسي ، ويقدم أداة جديدة تعرف باسم Azure Analytics Architecture Advisor."
    ],
    "commentSummary": [
      "تقارن المناقشات الميزات المختلفة ل Google Cloud Platform (GCP) و Amazon Web Service (AWS) ، بما في ذلك عروض الخدمة والدعم والموثوقية وسهولة الاستخدام والتكلفة والتوثيق والالتزام طويل الأجل وتجارب المستخدم.",
      "أثار المشاركون مخاوف بشأن احتمال إيقاف بعض خدمات GCP وموثوقية التزامات Google.",
      "الآراء مختلطة: يفضل بعض المستخدمين GCP لميزاته الفريدة وواجهته سهلة الاستخدام ، بينما يميل البعض الآخر نحو AWS لدعمها واستقرارها الموثوقين."
    ],
    "points": 208,
    "commentCount": 333,
    "retryCount": 0,
    "time": 1698260514
  },
  {
    "id": 38017146,
    "title": "الذكاء الاصطناعي \"اختراق\": الشبكة العصبية لديها قدرة شبيهة بالإنسان على تعميم اللغة",
    "originLink": "https://www.nature.com/articles/d41586-023-03272-3",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38017146",
    "commentBody": "",
    "originSummary": [
      "أنشأ الباحثون شبكة عصبية يمكنها تعميم اللغة المشابهة للبشر ، متجاوزة chatbot ChatGPT في دمج الكلمات المكتسبة حديثا في المفردات الحالية والسياقات المختلفة.",
      "يمكن أن يتوج هذا التقدم التكنولوجي بمزيد من التفاعلات العضوية بين البشر والآلات.",
      "تشير الدراسة إلى أن الشبكات العصبية يمكن أن تحقق تعميما منهجيا ، وهو عنصر حاسم في الإدراك البشري ، والذي كان في السابق موضوعا مثيرا للجدل في مجال الذكاء الاصطناعي."
    ],
    "commentSummary": [
      "أنشأ العلماء شبكة عصبية ذات فهم وإنتاج شبيه بالإنسان للغة ، وتتميز بفعالية 85٪ في إنشاء تسلسلات ألوان بناء على التعليمات.",
      "يجادل النقاد بأن هذا النجاح قد يكون نتيجة للهندسة السريعة ، وهناك مناقشات مستمرة حول اختبار العقبات والتحيز والإنصاف والتكرار في نماذج اللغة.",
      "يشرح المنشور GPT-4 ، مشيرا إلى مفرداته الأصغر وإمكانية التوسع ، ويذكر نموذجا لغويا جديدا يمكنه إنشاء وفهم كلمات جديدة ، تم تدريبه على أكثر من 8 ملايين كلمة إنجليزية."
    ],
    "points": 177,
    "commentCount": 56,
    "retryCount": 0,
    "time": 1698262125
  },
  {
    "id": 38014812,
    "title": "النيل: Postgres بدون خادم ل SaaS الحديثة",
    "originLink": "https://www.thenile.dev/blog/introducing-nile",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38014812",
    "commentBody": "",
    "originSummary": [
      "تم تصميم Nile، وهي قاعدة بيانات Postgres بدون خادم، لتطبيقات SaaS، وتسعى إلى تبسيط التطوير والتوسع من خلال توفير عزل المستأجر والنسخ الاحتياطي لكل مستأجر وتجربة بدون خادم.",
      "يتميز بالتركيز على قواعد بيانات المستأجر الافتراضية لعزل البيانات عبر عملاء مختلفين ويتضمن وظائف مثل استعلامات التوجيه لتصحيح قواعد بيانات المستأجر ومشاركة البيانات بين المستأجرين.",
      "النيل الذكاء الاصطناعي الأصلي ويوفر دعما من الدرجة الأولى لإدارة المستخدمين في سياق المستأجرين ، مع المصادقة المدمجة وإدارة الأذونات. يوفر موارد للمستخدمين ويشجع مجتمع مطورين مزدهر."
    ],
    "commentSummary": [
      "Nile هي قاعدة بيانات Postgres بدون خادم مصممة خصيصا لتطبيقات SaaS (البرامج كخدمة) الحديثة ، وتوفر إمكانات متعددة الإيجار والتوجيه والمحاكاة الافتراضية للمستأجر لتحسين قابلية التوسع.",
      "تؤكد النيل على قابلية النقل وسهولة الترحيل ، مما يوفر الوقاية ضد حبس البائع. يسمح بالتحكم الدقيق في المستأجرين ويتضمن جداول مشتركة لنسخ البيانات.",
      "اعتبارا من الآن ، لا يتوفر Nile إلا من خلال الوثائق والأمثلة ، مع إمكانية خيار افعل ذلك بنفسك (DIY) من الشركة في المستقبل."
    ],
    "points": 165,
    "commentCount": 112,
    "retryCount": 0,
    "time": 1698252355
  },
  {
    "id": 38013955,
    "title": "مشروع سبيس إكس ستارشيب سوبر هيفي في موقع إطلاق بوكا تشيكا",
    "originLink": "https://www.faa.gov/space/stakeholder_engagement/spacex_starship",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38013955",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "يغطي المخطط مجموعة واسعة من القضايا المتعلقة ب Elon Musk و SpaceX ، ويتطرق إلى المناقشات حول سلامة الإطلاق ، والتأثير البيئي ، والمطالبات الطموحة ، وصاروخ Starship من SpaceX.",
      "تمت مناقشة التقارب بين التلسكوبات الفضائية وأقمار Starlink الصناعية ، إلى جانب آراء مختلفة حول أسلوب إدارة Musk والاستخدام المثير للجدل ل Twitter.",
      "تركز المناقشات والمناظرات المتعمقة على تأثير أنشطة SpaceX على الأراضي الرطبة المحمية ، واستدامة وضرورة البعثات الفضائية ، والاستخدام المحتمل ل Starship لأغراض عسكرية."
    ],
    "points": 163,
    "commentCount": 522,
    "retryCount": 0,
    "time": 1698248357
  }
]
