[
  {
    "title": "North Korea's Afforestation Attempts Hindered by Food Shortages and High Fuel Costs",
    "originLink": "https://www.rfa.org/korean/weekly_program/acbdc81cc640-c6b0b9ac-c0ddd65c/ecolife-11152023203434.html",
    "originBody": "",
    "originSummary": [
      "북한의 임농복합경영 접근 방식은 동시에 농업과 나무 심기를 장려하며, 이는 일부 지역의 삼림 벌채 수준을 낮추었습니다.",
      "그러나 지속적인 식량 부족과 높은 연료 비용은 '소토지' 즉, 농업 가능한 숲 땅을 줄이는 범위를 제한하게 합니다.",
      "전반적으로, 작은 규모의 농지인 '소토지'의 감소는 새로운 삼림-농업 방법, 더 강한 시장 기회, 그리고 농촌 지역의 인구 변화 등의 요인에 기인됩니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "Red Hat은 IT 자동화를 위한 Ansible 도구를 업데이트하여 관리를 간소화하고 효율성을 높이고자 합니다.",
      "빠른 실행 시간과 AIX 및 IBM i 플랫폼을 위한 다른 향상사항과 함께, 업데이트된 도구는 Power 플랫폼을 사용합니다.",
      "이러한 새로운 향상 사항을 통해, Red Hat은 IBM Power Systems를 활용하는 기업 환경을 더욱 잘 지원하고자 합니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700228549868
  },
  {
    "title": "India Leads Global Import of Scotch Whisky, Overtakes United States and France",
    "originLink": "https://www.chosun.com/economy/weeklybiz/2023/11/16/VH35FWPCMBCJPMYI5YBAY6HWDU/",
    "originBody": "",
    "originSummary": [
      "인도는 Scotch Whisky Association(SWA)에 따르면 지난해 스코치 위스키의 최대 수입국이었으며, 219백만 병을 수입했습니다.",
      "이는 인도가 처음으로 이 명단을 선도하는 것을 표시하며, 이는 큰 인구와 빠른 경제 성장으로 인해 위스키 시장이 크게 성장한 결과입니다.",
      "SWA는 지난 10년 동안 인도 시장이 200% 이상 성장했다고 밝혔습니다. 하지만 수입 가치로 순위를 매기면 미국이 1위, 인도는 5위로 밀려났습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "중국의 온라인 의료 플랫폼 WeDoctor와 NWS Holdings가 합작하여 중국에 광저우 국제 인터넷 병원을 개설하였습니다.",
      "이 합작은 오프라인 및 온라인 의료 서비스를 결합한 디지털 모델을 개발할 것입니다. 이 서비스에는 온라인 상담, 장기 건강 관리 계획, 인공 지능을 활용한 진단 및 처방 서비스 등이 포함됩니다.",
      "WeDoctor는 새로운 병원이 공중 보건 요구를 충족하고 도시와 농촌 사이의 보건 격차를 좁히는 데 도움이 될 것으로 기대합니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700228549868
  },
  {
    "title": "IPEF Initiates 'Core Minerals Dialogue' for Enhanced Supply Network Cooperation",
    "originLink": "https://m.hankookilbo.com/News/Read/A2023111714550004894",
    "originBody": "",
    "originSummary": [
      "US 주도의 International Partnership for Energy Futures (IPEF)가 'Core Minerals Dialogue'를 시작하여 공급 네트워크에서 협력을 시작했습니다.",
      "이 사항은 전세계적인 에너지 공급에 대한 협력과 다양한 국가들 간의 상호 작용을 더욱 활성화시킬 것으로 예상됩니다.",
      "'Core Minerals Dialogue'는 에너지 시장의 핵심 요소인 광물에 대한 공급 및 수요를 조정하는 역할을 합니다."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700228549868
  },
  {
    "title": "Examining the Steadfast Dominance of the U.S Dollar Amid Alternatives and Rising Debt Concerns",
    "originLink": "https://www.sedaily.com/NewsView/29X9SB0P2P",
    "originBody": "",
    "originSummary": [
      "이 기사는 미국 달러가 세계 경제에 미치는 영향에 대해 자세히 다룹니다.",
      "유로, 위안화, BRICS 국가들의 노력, 그리고 암호화폐와 같은 달러 대안에 대해 설명하며, 이들이 달러의 지배력에 즉각적인 위협을 가하고 있다고 보지는 않습니다.",
      "미국의 국가 공무원이 증가하고 있어 이로 인해 국가의 경제 신용에 영향을 미칠 수 있으며, 미국의 금융 제재를 견디고 있는 국가들로부터의 반발 가능성에 대한 우려가 제기되었습니다."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700228549868
  },
  {
    "title": "South Korea's Democratic Party Faces Criticism for Youth-Focused Campaign",
    "originLink": "https://www.hani.co.kr/arti/politics/assembly/1116809.html",
    "originBody": "",
    "originSummary": [
      "한겨레 홈페이지의 메뉴 구성은 이스라엘-하마스 전쟁, APEC, 정치, 환경 등 다양한 카테고리를 특징으로 합니다.",
      "대한민국 더불어민주당이 2030 세대를 대상으로 개성과 다양성에 중점을 둔 캠페인을 시작했으며, 이는 청년층을 향해 경멸적인 태도를 보이는 것이 아닌가 하는 비판을 받고 있습니다.",
      "뉴스 사이트에는 글로벌 뉴스와 미래 과학 등의 섹션이 포함되어 있으며, 또한 연락처와 저작권 정보도 제공하고 있습니다."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700228549868
  },
  {
    "title": "Biden and Xi Jinping Agree on Restoration of Military Channels, Disagreement on Economic Sanctions Continues",
    "originLink": "https://www.donga.com/news/Inter/article/all/20231117/122233556/1",
    "originBody": "",
    "originSummary": [
      "Donga Daily의 한국 기사는 교육, 경제, 예술, 게임 산업, 투자 전략, 정치, 사회 등 다양한 주제를 다룹니다.",
      "특정 논의 사항에는 미국-중국 관계, 경제 제재, 미국의 수출통제가 중국 기술회사에 미치는 영향, 남한의 정치 사건, 그리고 인천공항에서 강남까지 새로운 지하철 서비스같은 사회적 업데이트가 포함됩니다.",
      "콘텐츠에는 범죄, 건강, 엔터테인먼트 쪽 뉴스 업데이트도 포함되어 있습니다."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700228549868
  },
  {
    "title": "US Economy Signals Cooling: Impact on the New York Stock Exchange",
    "originLink": "https://biz.sbs.co.kr/article/20000144565",
    "originBody": "",
    "originSummary": [
      "미국 경제가 둔화하는 조징을 보이며, 이로 인해 뉴욕 증권거래소의 상승 추세가 정체되고 있습니다.",
      "중요한 경제 지표를 중심으로 미래 방향을 재평가할 필요가 있습니다.",
      "세 가지 주요 지수는 마감 전에 혼합된 추세를 보였습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "몬테카를로의 두 층짜리 펜트하우스인 Villa l’Echauguette가 110백만 유로에 판매됩니다.",
      "이 6,700 평방 피트의 펜트하우스는 개인 수영장을 갖추고 있으며, 유명한 카지노와 지중해의 광대한 전망을 자랑합니다.",
      "몬테카를로의 유명한 디자이너인 Jacques Garcia에 의해 재단장 및 재장식되었습니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700228549868
  },
  {
    "title": "Yeongcheon Teams Up with Korean-American Association for Economic And Cultural Development",
    "originLink": "http://www.dailydgnews.com/news/article.html?no=170568",
    "originBody": "",
    "originSummary": [
      "Yeongcheon city, South Korea has partnered with The Korean-American Association of Greater New York to enhance its economy, culture, and other sectors with further assistance for Yeongcheon-based companies penetrating the North American market.",
      "TBI Mobility, a Korean firm, announced the launch of six electric vehicles equipped with mobile rapid charging facilities in conjunction with municipalities and PMGrow.",
      "The Korean government inked an agreement with Seoul City to establish a center to extensively support crime victims, launching in mid-November, whereas the Korea Atomic Energy Research Institute maintains groundwater related activities under the standardization plans set for 2023."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700228549868
  }
]
