[
  {
    "id": 39928604,
    "title": "Dekódování odměn a mezibankovních poplatků u kreditních karet",
    "originLink": "https://www.bitsaboutmoney.com/archive/anatomy-of-credit-card-rewards-programs/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39928604",
    "commentBody": "",
    "originSummary": [
      "Mezibankovní poplatky jsou pro vydavatele platebních karet důležitým zdrojem příjmů, kterému se věnujeme v článku o programech odměn na kreditních kartách.",
      "Chase a American Express si konkurují na trhu kreditních karet, přičemž Chase uvedla na trh kartu Chase Sapphire Reserve, aby konkurovala American Express.",
      "Při posuzování možností kreditních karet je klíčové porozumět mezibankovním poplatkům a odměnám, jak je zdůrazněno v článku."
    ],
    "commentSummary": [
      "Článek se zabývá strukturou programů odměn na kreditních kartách a jejich vlivem na obchodníky i spotřebitele.",
      "Zdůrazňuje faktory ovlivňující zapojení obchodníků, předpisy EU, spravedlnost, ceny a konkurenci, jakož i výhody a nevýhody hotovostních a elektronických plateb a složitost poplatků za transakce kreditními kartami.",
      "Diskuse se zabývá nuancemi daňových podvodů, poplatky za pohodlí a strategiemi pro maximalizaci výhod kreditních karet a nabízí komplexní pohled na transakce s kreditními kartami a optimalizaci odměn."
    ],
    "points": 932,
    "commentCount": 599,
    "retryCount": 0,
    "time": 1712226917
  },
  {
    "id": 39936246,
    "title": "Mario Kart 8 Strategie: Maximalizace výkonu s Paretovou efektivitou",
    "originLink": "https://www.mayerowitz.io/blog/mario-meets-pareto",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39936246",
    "commentBody": "",
    "originSummary": [
      "Článek se zabývá výběrem nejlepšího řidiče, karoserie, pneumatik a kluzáku v Mario Kart 8 pro dosažení maximálního výkonu a představuje Paretovu účinnost a Paretovu frontu pro efektivní vyvážení rychlosti a zrychlení.",
      "Hráči mohou využít Paretovu frontu, aby vyloučili horší možnosti, ale konečná volba závisí na osobních preferencích a herním stylu.",
      "Zabývá se také přístupem k víceúčelovým optimalizačním problémům s Paretovou frontou a nabízí další poznatky pro čtenáře, které zaujal autorův výzkum."
    ],
    "commentSummary": [
      "Článek se zabývá Paretovou efektivitou při rozhodování pomocí vizualizací vytvořených pomocí Svelte a Three.js.",
      "Tuto koncepci aplikuje na scénáře, jako je výběr kol, herní kombinace a vylepšení hratelnosti ve hře Mario Kart.",
      "Zahrnuty jsou také postřehy uživatelů ohledně praktičnosti prezentací, taktiky online hraní, tvorby postav a vlivu výběru postavy na přidělování předmětů."
    ],
    "points": 916,
    "commentCount": 110,
    "retryCount": 0,
    "time": 1712267612
  },
  {
    "id": 39930463,
    "title": "AI-Piano Girl Performs Licence MIT",
    "originLink": "https://twitter.com/goodside/status/1775713487529922702",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39930463",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Diskuse se točí kolem technologie umělé inteligence při tvorbě hudby, která zahrnuje vokály, texty a celé písně, a zkoumá její kvalitu, praktické využití a potenciální dopad na hudební průmysl.",
      "Účastníci se podělí o zkušenosti a názory na hudbu generovanou umělou inteligencí a dotknou se role umělé inteligence v tvůrčí práci, jejích omezení ve srovnání s lidskou kreativitou a vývoje umělecké tvorby s umělou inteligencí.",
      "Rozhovor se zaměřuje na spojení technologií a hudby, zkoumá rostoucí vliv umělé inteligence a probíhající transformaci hudebního průmyslu."
    ],
    "points": 604,
    "commentCount": 234,
    "retryCount": 0,
    "time": 1712239071
  },
  {
    "id": 39936284,
    "title": "Přechod německého státu na Linux a LibreOffice",
    "originLink": "https://www.zdnet.com/article/german-state-ditches-microsoft-for-linux-and-libreoffice/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39936284",
    "commentBody": "",
    "originSummary": [
      "Německá spolková země Šlesvicko-Holštýnsko přechází u svých 30 000 zaměstnanců z Microsoftu na Linux a LibreOffice, přičemž klade důraz na náklady, bezpečnost a digitální suverenitu.",
      "To je v souladu s rostoucím trendem v Evropské unii a Číně přijímat software s otevřeným zdrojovým kódem, chránit data a podporovat místní technologickou konkurenci.",
      "K podobnému přechodu došlo i v dalších evropských zemích a také Čína přechází z Windows na Linux pro ovládání desktopů, což je motivováno úsporou nákladů a zvýšením bezpečnosti IT."
    ],
    "commentSummary": [
      "Německý stát přechází od Microsoftu na Linux a kancelářský balík LibreOffice, což vyvolalo diskuse o změnách softwaru, závislosti na cloudu a oživení projektu LiMux.",
      "Uživatelé diskutují o problémech přechodu na řešení s otevřeným zdrojovým kódem, jako jsou StarOffice, LibreOffice a LaTeX, a zároveň vyjadřují své preference vůči Microsoft Office a frustraci z vynucených změn.",
      "Rozhovory se věnují srovnání Microsoft Office a open-source nástrojů, efektivitě programovacích jazyků, konfiguračním systémům a převaze Linuxu ve správě softwaru nad Windows, což odráží neustálý vývoj open-source technologií v oboru."
    ],
    "points": 405,
    "commentCount": 279,
    "retryCount": 0,
    "time": 1712267849
  },
  {
    "id": 39933833,
    "title": "Odhalení vývoje datových tabulek",
    "originLink": "https://posit-dev.github.io/great-tables/blog/design-philosophy/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39933833",
    "commentBody": "",
    "originSummary": [
      "Kniha Filozofie návrhu velkých tabulek se zabývá historickým vývojem tabulek a zdůrazňuje význam strukturovaných sloupců a řádků pro efektivní prezentaci dat.",
      "Kniha sleduje vývoj tabulek od dávných dob až po moderní nástroje, jako je Excel, a propaguje důkladný přístup k analýze dat pomocí jazyka Python.\"",
      "Skvělé tabulky popisují rámec jazyka Python pro tvorbu přehledných a vizuálně přitažlivých tabulek, včetně možností přizpůsobení a formátovacích technik pro zvýšení kvality statických souhrnných tabulek pro různé účely.\""
    ],
    "commentSummary": [
      "Příspěvek se zabývá koncepcí designu projektu Great Tables a soustředí se na tabulky v jazyce Python/Jupyter a vytvoření \"gramatiky tabulek\" pro efektivní prezentaci dat.",
      "Je zde uveden úvod do knihovny tabulek Buckaroo pro interaktivní zkoumání datových tabulek, kritizovány funkce print() a display() Jupyteru a zdůrazněn význam standardizace \"gramatiky tabulek\" pro analýzu dat.",
      "Nabízíme poznatky o uspořádání tabulek, čitelnosti, zásadách vizualizace dat, tvorbě historických tabulek, efektivním vykreslování pomocí knihoven jako ag-grid a arrow a nástrojů jako Mito pro vylepšené formátování dat a vizuálně atraktivní tabulky v jazyce Python."
    ],
    "points": 400,
    "commentCount": 72,
    "retryCount": 0,
    "time": 1712253628
  },
  {
    "id": 39930195,
    "title": "Pokročilý radar s kompresí pulzů pro aplikace s velkým dosahem",
    "originLink": "https://hforsten.com/homemade-6-ghz-pulse-compression-radar.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39930195",
    "commentBody": "",
    "originSummary": [
      "Článek porovnává konstrukce FMCW a pulzních radarů a zaměřuje se na výhody a překážky pulzních radarů ve scénářích s velkým dosahem.",
      "Popisuje vývoj současného radarového systému pro kompresi pulzů a zahrnuje klíčové prvky, jako jsou ADC, D/A převodníky, filtry a FPGA pro zvýšení výkonu.",
      "Radarový systém, jehož celková cena činí 570 USD, překonává problémy, jako je stejnosměrný posun a šum, a umožňuje detekci cílů na vzdálenost až 400 metrů, přičemž poskytuje pokročilé funkce, které jsou u radarů stejné cenové kategorie neobvyklé."
    ],
    "commentSummary": [
      "Příspěvek se zabývá stavbou radaru typu \"udělej si sám\" na frekvenci 6 GHz pro detekci srdečního tepu a dýchání s využitím dopplerovských radarových jednotek na frekvenci 10 GHz, přičemž se zabývá bezpečnostními otázkami týkajícími se zahřívání tkání a limitů expozice, včetně rizik spojených s vojenskými radary.",
      "Témata zahrnují návrh desek plošných spojů, směrování signálů, komponenty jako AFE7225 a Zynq a zpoždění FPGA, spolu s pokroky v radarové technice, jako jsou radary AESA a SAR, potenciál automobilových radarových systémů a překračování možností LIDARu.",
      "Původní tvůrce zkonstruoval radar jako osobní výzvu bez konkrétního použití, přičemž se zabýval výrobou desek plošných spojů pro SAR a používáním softwaru s otevřeným zdrojovým kódem."
    ],
    "points": 342,
    "commentCount": 87,
    "retryCount": 0,
    "time": 1712237523
  },
  {
    "id": 39928558,
    "title": "Zranitelnost CSS v e-mailech HTML vyvolává obavy o bezpečnost",
    "originLink": "https://lutrasecurity.com/en/articles/kobold-letters/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39928558",
    "commentBody": "",
    "originSummary": [
      "Útočníci zneužívají CSS v e-mailech HTML k manipulaci s viditelností obsahu, což představuje bezpečnostní riziko a umožňuje podvody, které se týkají uživatelů Thunderbirdu, Outlooku na webu a Gmailu.",
      "Někteří e-mailoví klienti nabízejí ochranná opatření, ale uživatelé by měli být u e-mailů HTML opatrní, například zakázat HTML nebo používat omezené režimy, aby se riziko snížilo.",
      "Vzhledem k tomu, že implementace silných ochranných prvků v e-mailových klientech je obtížná, je v boji proti těmto zranitelnostem důležitá ostražitost uživatelů a preventivní opatření."
    ],
    "commentSummary": [
      "Diskuzní vlákno se zabývá riziky phishingových útoků prostřednictvím HTML e-mailů a skepticismem vůči účinnosti služeb simulujících phishing.",
      "Objevují se obavy ohledně bezpečnostních zranitelností při přeposílání e-mailů, diskutuje se o používání HTML vs. Markdown v e-mailech a upozorňuje se na problémy při kódování HTML e-mailů.",
      "Témata se týkají optimalizace pro mobilní zařízení, nejednoznačnosti formátu data, formátu ISO 8601, možností písma, dvoufaktorového schvalování pro fakturační systémy a opatření pro zabezpečení e-mailů, přičemž se řeší kompatibilita e-mailů v různých e-mailových klientech."
    ],
    "points": 316,
    "commentCount": 133,
    "retryCount": 0,
    "time": 1712226439
  },
  {
    "id": 39930809,
    "title": "Sandbox V8 v prohlížeči Chrome: zvýšení bezpečnosti a stability",
    "originLink": "https://v8.dev/blog/sandbox",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39930809",
    "commentBody": "",
    "originSummary": [
      "V8 Sandbox, bezpečnostní funkce pro engine V8, je nyní součástí programu odměn za zranitelnosti v prohlížeči Chrome a zaměřuje se na řešení problémů s poškozením paměti, které často vedou ke zneužití Chrome.",
      "Jeho cílem je omezit poškození paměti v rámci V8, aby se zabránilo dopadu na celý systém, s nízkým dopadem na výkon, který již funguje na kompatibilních platformách pro testování.",
      "Sandbox V8 má zásadní význam pro zvýšení bezpečnosti paměti v systému V8 a představuje významný pokrok v zabezpečení enginu proti zranitelnostem."
    ],
    "commentSummary": [
      "Diskuse se soustředí na zranitelnosti v enginu V8, zejména pokud jde o jeho kompilátory, garbage collector, interpret a parser.",
      "Mezi návrhy na zmírnění patří vypnutí překladačů JIT, používání jazyků pro bezpečné zacházení s pamětí pro konkrétní komponenty a prosazování postupů pro bezpečné zacházení s pamětí.",
      "Je zdůrazněn význam jazyků s paměťovou bezpečností, jako je jazyk Rust, problémy při odstraňování paměťových chyb a logických problémů a potenciální výhody použití jazyka Rust pro paměťovou bezpečnost v implementacích sandboxů."
    ],
    "points": 260,
    "commentCount": 89,
    "retryCount": 0,
    "time": 1712240693
  },
  {
    "id": 39930919,
    "title": "HTTP/2 Pokračování záplavy: Zranitelnost a dopady.",
    "originLink": "https://nowotarski.info/http2-continuation-flood-technical-details/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39930919",
    "commentBody": "",
    "originSummary": [
      "HTTP/2 CONTINUATION Flood je kritická zranitelnost protokolu HTTP/2, která vede k pádům serveru a problémům s výkonem v důsledku přetečení hlaviček.",
      "Nesprávná implementace ochrany v hlavních serverech HTTP/2 umožňuje, aby útoky zůstaly nepovšimnuty, což může způsobit výpadky procesoru a paměti.",
      "Zneužití Golangu a Node.js v reálném světě narušilo internetové služby, což vedlo ke spolupráci s technologickými giganty a open source projekty s cílem zmírnit široký dopad této zranitelnosti."
    ],
    "commentSummary": [
      "Článek se zabývá problémem Continuation Flood v protokolu HTTP/2 a jeho dopady na webové servery a reverzní proxy servery.",
      "Diskuse v komentářích zdůrazňují, že je důležité vyhnout se nadměrnému inženýrství, obavám o škálovatelnost a významu postupů bezpečného kódování pro vývojáře.",
      "Uživatelé diskutují o dopadu na servery, jako je Caddy, o rozdílech mezi HTTP/1.1 a HTTP/2 a o složitostech a výzvách HTTP/2, pokud jde o škálovatelnost a využití zdrojů, spolu s řešeními pro zranitelné servery."
    ],
    "points": 246,
    "commentCount": 26,
    "retryCount": 0,
    "time": 1712241170
  },
  {
    "id": 39933076,
    "title": "JetMoE-8B: Nákladově efektivní model AI překonává LLaMA2",
    "originLink": "https://research.myshell.ai/jetmoe",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39933076",
    "commentBody": "",
    "originSummary": [
      "Model JetMoE-8B, který stál méně než 0,1 milionu dolarů a byl vycvičen pomocí veřejných datových sad a grafických procesorů spotřebitelské třídy, překonává model LLaMA2-7B od společnosti Meta AI, který stál několik miliard dolarů.",
      "JetMoE-8B, který je vhodný pro akademickou sféru a má otevřený zdrojový kód, se může pochlubit 2,2 miliardami aktivních parametrů během inference a byl vycvičen na 1,25 bilionech tokenů pomocí clusteru GPU během dvou týdnů.",
      "Podrobná technická zpráva a benchmarky pro JetMoE-8B jsou k dispozici na jejich stránkách Github a HuggingFace, kde jsou k dispozici kontaktní údaje pro spolupráci."
    ],
    "commentSummary": [
      "Model JetMoE, jehož trénink stál méně než 0,1 milionu dolarů, překonává model LLaMA2 od společnosti Meta AI, přestože využívá méně zdrojů.",
      "Inovativní konstrukce JetMoE s dvojitou směsí expertů snižuje náklady na výpočet při zachování vysoké přesnosti.",
      "Diskuse se zabývá také tématy, jako je efektivita modelů \"klaunských aut\", porovnání nákladů na servery AWS s vlastním hardwarem, možnosti GPU pro AI, tréninkové stroje s více GPU a výzvy při vytváření a trénování společností BigModel."
    ],
    "points": 231,
    "commentCount": 82,
    "retryCount": 0,
    "time": 1712250261
  },
  {
    "id": 39934696,
    "title": "Pozor: Falešné právnické firmy využívají hrozby DMCA pro zvýšení SEO",
    "originLink": "https://arstechnica.com/gadgets/2024/04/fake-ai-law-firms-are-sending-fake-dmca-threats-to-generate-fake-seo-gains/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39934696",
    "commentBody": "",
    "originSummary": [
      "Falešné právní firmy zabývající se umělou inteligencí vydávají falešné hrozby DMCA majitelům stránek, aby podpořily SEO pomocí zpětných odkazů.",
      "Terčem tohoto schématu se stal novinář Ernie Smith, který obdržel falešné oznámení DMCA kvůli fotografii klíčenky.",
      "Údajná advokátní kancelář Commonwealth Legal, která je pravděpodobně fiktivní, používá obrázky advokátů generované umělou inteligencí a pochybné životopisy k manipulaci se SEO pomocí zpětných odkazů."
    ],
    "commentSummary": [
      "Falešné právnické firmy s umělou inteligencí využívají hrozby DMCA ke zlepšení pozic v SEO a zneužívají složitosti právního systému, což se týká zejména jednotlivců a malých/středních podniků.",
      "Kritizuje americký soudní systém za to, že upřednostňuje kapitál před spravedlností, což vede k systémovým právním problémům ovlivněným peněžními faktory.",
      "Diskutuje o významu prověřování právníků, problémech při posuzování kvality právníků v občanskoprávních věcech a o tom, jak náklady na právní služby ovlivňují přístup ke spravedlnosti."
    ],
    "points": 210,
    "commentCount": 100,
    "retryCount": 0,
    "time": 1712258580
  },
  {
    "id": 39938703,
    "title": "FFmpeg 7.0 přináší nové funkce a vylepšení výkonu",
    "originLink": "https://ffmpeg.org//index.html#pr7.0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39938703",
    "commentBody": "",
    "originSummary": [
      "FFmpeg je univerzální nástroj pro nahrávání, konverzi a streamování zvuku a videa v různých operačních systémech.",
      "Software pravidelně vydává aktualizace s novými funkcemi, jako jsou kodéry, dekodéry, filtry a optimalizace výkonu, a těží z účasti v programu Google Summer of Code.",
      "Uživatelům se doporučuje aktualizovat na nejnovější verzi, aby využili nejnovější dostupná vylepšení a opravy chyb."
    ],
    "commentSummary": [
      "Uživatelé diskutují o vydání FFmpeg 7.0 a jeho závislostech, alternativách a kodecích, jako je VVC, a porovnávají jej s AV1 z hlediska snížení datového toku a kvality.",
      "Někteří zmiňují použití obalů Rust pro FFmpeg, zkoumání problémů při přepisování v různých jazycích, používání grafických rozhraní, frustraci ze složitosti a potřebu jednodušších návodů.",
      "Aktualizace v XMedia Recode, Permute a FFmpeg CLI, diskuse o podpoře ambisonic, vylepšení DirectX, kódování s různými knihovnami a hledání vysvětlení k různým tématům s návrhy nástrojů jako LosslessCut a XMedia Recode pro snadnější editaci videa."
    ],
    "points": 208,
    "commentCount": 52,
    "retryCount": 0,
    "time": 1712291464
  },
  {
    "id": 39930887,
    "title": "Velká americká železniční stezka: Spojení 3 700 mil napříč USA",
    "originLink": "https://www.railstotrails.org/site/greatamericanrailtrail/content/route/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39930887",
    "commentBody": "",
    "originSummary": [
      "Velká americká železniční stezka se táhne přes 3700 mil od Washingtonu po stát Washington a propojuje více než 150 stávajících železničních stezek a tras, čímž podporuje nemotorové cestování a místní ekonomiku.",
      "Klíčová kritéria zaručují špičkový zážitek z trasy, která je již z více než 52 % hotová a prochází různými státy s ikonickými branami.",
      "Zásadní roli při ochraně a údržbě těchto stezek hraje propagace, dobrovolnictví a dárcovství, přičemž podporu lze získat prostřednictvím darů pro RTC."
    ],
    "commentSummary": [
      "Velká americká železniční stezka se táhne v délce 3 800 mil a nedávno byly dokončeny mosty umožňující přejezd řeky Mississippi, přičemž železniční koridory byly přebudovány na stezky.",
      "Probíhající diskuse se týkají dálkových tras, přínosů lehkých železničních systémů, porovnání amerických a evropských tras a možnosti propojení tras, jako je Pacific Crest Trail a Appalačská stezka.",
      "Rozhovory se týkají také problémů ve Wyomingu, potenciálních národních systémů stezek, debat o optimálních cyklistických trasách v USA, konkrétních tras, zkušeností ze států a odlehčených vtipů o státech jako Iowa a Indiana."
    ],
    "points": 208,
    "commentCount": 86,
    "retryCount": 0,
    "time": 1712241032
  },
  {
    "id": 39929842,
    "title": "Ministerstvo energetiky USA podporuje pilotní projekt skladování energie z vyhřívaného písku",
    "originLink": "https://www.pv-magazine.com/2024/04/04/us-government-funds-pilot-project-for-heated-sand-energy-storage/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39929842",
    "commentBody": "",
    "originSummary": [
      "Americké ministerstvo energetiky podporuje pilotní projekt, který má ukázat, že je možné ukládat energii do zahřátého písku, který dokáže po dobu pěti dnů vyrábět 135 MW.",
      "Výzkumníci z Národní laboratoře pro obnovitelné zdroje energie vytvořili prototyp systému využívajícího vyhřívaný písek, který dokáže udržet teplo více než pět dní.",
      "Tento projekt, financovaný částkou 4 miliony dolarů, bude mít kapacitu vybíjení 100 kW a dobu trvání 10 hodin, což poukazuje na potenciál této technologie. Pracuje se také na dalších metodách skladování energie s delší dobou trvání, jako je skladování energie ve stlačeném vzduchu a skladování vodíku v solných jeskyních."
    ],
    "commentSummary": [
      "Písek je zvažován pro skladování energie, zejména pro tepelné účely, prostřednictvím metod, jako je skladování energie z vyhřívaného písku a pískové baterie.",
      "V diskusi se zkoumá účinnost a praktičnost použití písku ve srovnání s materiály, jako jsou lithiové baterie nebo voda pro skladování.",
      "Zaměřuje se především na hledání ekonomických a efektivních způsobů skladování a využívání tepelné energie v různých aplikacích a technologiích."
    ],
    "points": 207,
    "commentCount": 116,
    "retryCount": 0,
    "time": 1712235566
  },
  {
    "id": 39929416,
    "title": "AI závada vytváří porno uživatele loterie, Washington je stránka stažena",
    "originLink": "https://mynorthwest.com/3956403/rantz-washingtons-lottery-ai-porn-user/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39929416",
    "commentBody": "",
    "originSummary": [
      "Webové stránky washingtonské loterie poháněné umělou inteligencí vygenerovaly nevhodný obsah pomocí fotografie uživatele, což vedlo k jejich odstranění.",
      "Uživatelka Megan, matka, incident nahlásila, což vedlo k potvrzení problému washingtonskou loterií.",
      "Byly vzneseny obavy týkající se hranic a předpisů systému umělé inteligence, přičemž byl zdůrazněn význam zajištění vhodných parametrů."
    ],
    "commentSummary": [
      "Washingtonská loterie se ocitla pod palbou kritiky za to, že pomocí umělé inteligence vytvořila pornografický obsah s podobiznou uživatele, což vyvolalo debaty o etické reklamě, manipulaci a odpovědnosti.",
      "Mezi obavy patří dopady reklamy na společnost, nerovnost v bohatství a nevhodné využívání technologie umělé inteligence.",
      "Diskutuje se o morálních důsledcích loterií, cenzuře umělé inteligence, odpovědnosti vývojářů za ochranu před škodlivými nástroji, společenských názorech na technologie a potřebě souhlasu a soukromí v obsahu vytvářeném umělou inteligencí."
    ],
    "points": 202,
    "commentCount": 242,
    "retryCount": 0,
    "time": 1712232909
  }
]
