[
  {
    "title": "Truflation: The Blockchain-Based Index Potentially Revolutionizing U.S. Inflation Forecasting",
    "originLink": "https://cointelegraph.com/news/blockchain-us-inflation-forecasting",
    "originBody": "ANDREW SINGER 2 HOURS AGO Can blockchain solutions disrupt US inflation forecasting? New blockchain-based apps like Truflation could be a “healthy development,” given that gauging inflation is more art than science. 236 Total views 9 Total shares Listen to article 0:00 ANALYSIS Join us on social networks So much of the world’s economic steam depends on interest rates, which in turn are tied to inflation, i.e., the rate at which producer and consumer prices are rising. But measuring inflation isn’t easy. It is as much art as it is science. The world’s number one inflation index, arguably, is the United States Bureau of Labor Statistics (BLS) Consumer Price Index (CPI), which has been around for over 100 years. Not all economists and business leaders are happy with the CPI, however. Its methodology sometimes seems antiquated, and it publishes only once a month. It also relies on a workforce of 477 people who canvas supermarkets, department stores, gas stations and hospitals, often simply jotting down retail prices — not exactly 21st century. “Basically, they go to stores — whether it’s electronically or in person — and write down prices,” Nationwide insurance chief economist David Berson told Marketplace. “They compare those prices to a month earlier.” This may be why Truflation.com, a blockchain-based inflation index, is now attracting some attention. It gathers digital data from some 40 “partners” or sources that collectively offer up to around 18 million data points, compared with the CPI’s relatively modest 80,000 data points. Truflation also has a United Kingdom version. The new inflation index is also updated daily. If rising consumer prices are finally plateauing or beginning to drop, it should be able to pick up changes earlier than the government gauge. Economist Paul Krugman wrote in a New York Times column in late October: “I’ve been having some fun with a project called Truflation, which supposedly uses the blockchain and was backed in part by crypto types and which I suspect was intended to show that official inflation was greatly understated. What its numbers actually show is a steep decline in inflation over the past year.” Never mind the dig at “crypto types” — Krugman is a noted crypto skeptic. What’s noteworthy is that this Nobel laureate was taking blockchain-based inflation analytics seriously. Commenting on Truflation last year, David Harris, chairman of Rockefeller Capital Management, noted: “Their inflation data last fall seemed prescient, as it signaled an upturn before the BLS did. I expect more websites like this which will provide increased ways for investors to assess inflation trends.” Elsewhere, Base Ecosystem Fund, which invests “in the next generation of on-chain projects building on Base,” Coinbase’s layer-2 blockchain, announced in September that Truflation was among its first six investment recipients out of 800 applications. Its digital data sources include NielsenIQ, Big Mac Index, Amazon, Walmart, Zillow, Trulia, Penn State University MRI (Marginal Rent Inflation) Index, Real Capital Analytics, Yahoo, Energy Information Administration, OPIS, AAA Gas prices, JD Powers, CarGurus, Numbeo, Statista, CoreLogic, and Kantar, among others. Cleveland Fed’s Nowcasts Truflation isn’t the first to venture into real-time inflation prediction. The Federal Reserve Bank of Cleveland created a real-time inflation index called “Nowcasts” back in 2014, and today, the bank issues inflation forecasts each month before the official CPI or personal consumption expenditures (PCE) inflation data are released. Its index is updated every morning at 10:00 am. Inflation Nowcasting for Q4 2023. Source: Cleveland Fed The idea is to provide consumers, businesses, financial markets and others a sense of where inflation is now and “where it is likely to be in the future.” For example: “If a consumer is thinking about taking out a loan, it helps to know how quickly wages and prices will be rising during the life of the loan — after all, it will be much easier to service the loan with stronger wage and price growth.” The Nowcast model makes use of a small number of available data series “at different frequencies, including daily oil prices, weekly gasoline prices, and monthly CPI and PCE inflation readings,” according to the bank. It’s had some success, claiming to be “more accurate than the consensus (average) nowcasts from the Blue Chip Economic Indicators survey” and also “more accurate than the median nowcasts from the Federal Reserve Bank of Philadelphia’s Survey of Professional Forecasters.” A need for real-time gauges Real-time inflation indexes like Nowcast and Truflation are long overdue, in the view of many. “There’s an important need for independent measures of inflation that are calculated more frequently than once a month,” Omid Malekan, author and adjunct professor at Columbia University’s Business School, told Cointelegraph. Magazine: 6 Questions for Lugui Tillier about Bitcoin, Ordinals, and the future of crypto “Today, we have millions of prices that we can observe in real-time, and there is absolutely no reason to first publish inflation data with a delay — so we can see them real-time if we want,” said Lars Christensen, an economist and associate professor at the Copenhagen Business School in a recent LinkedIn post. The view that the BLS’ CPI is antiquated and ripe for disruption “is the main reason we founded Truflation,” the firm’s founder and CEO Stefan Rust told Cointelegraph. The new protocol tracks 18 million items with three price feeds per item, he explained, compared with the government’s 80,000 items gathered “manually,” adding: “Rather than tracking household expenses via rotating panels, Truflation uses a census-based model to track these.” There’s no clear “right way” to track inflation, of course, but that’s arguably another reason why new approaches might be welcomed. “There is a lot of discretion in any formulation when answering questions like how much weight to give to different goods or services,” said Malekan, adding: “The Labor Department claims to be an independent observer, but there is a serious conflict of interest in its formula because billions of dollars in TIPS payments [which protect against inflation] and cost of living adjustments for services like Social Security ride on how we calculate inflation.” Rust echoed this sentiment that the government’s methodology is not only antiquated but also biased, telling Cointelegraph the methodology that the government set up “is vertically integrated, biased and editable. They can change methodology and time sets on a whim while they are working with old data sets.” A 97% correlation with the CPI Overall, the emergence of apps like Truflation is “a very healthy development,” Danielle DiMartino Booth, CEO and chief strategist for QI Research, told Cointelegraph. Booth, who worked at the Dallas Fed for a number of years, was among those who “stressed tested” Truflation’s model; the firm supplied her with raw data so QI could conduct a correlation analysis. Since 2012, the index’s correlation with the CPI is 97%, Booth said, which is very high. As noted, Truflation is accessible on-chain — it’s a node on the Chainlink oracle network that feeds its inflation data into smart contracts across four blockchains: Ethereum, Avalanche, BNB Chain and Fantom. Cointelegraph asked Booth whether it mattered to her that Truflation’s data is on-chain. “What matters to me is the end product,” she answered. Is it accurate? Does it correlate with the CPI? Democratizing economic information Sam Friedman, principal solutions architect at Chainlink Labs, sees things somewhat differently. Truflation’s updated inflation calculation methodology, which is verifiable, refreshed daily and is also accessible on-chain, “represents the world we live in today,” he told Cointelegraph. The app isn’t just for economic forecasters but also for consumers looking to “understand the impact that inflation has on their lives.” Many are already attracted by the firm’s catchy online dashboard and personalized inflation calculator. Friedman said: “This type of bottom-up education will drive adoption and is very much in line with the philosophy of decentralized systems. Of course, people who work at large institutions, SMEs [small and medium enterprises], and smaller enterprises are also consumers.” Software developers, too, will now be able to access real-time inflation data as they design smart contracts for their decentralized applications. “They can reference Truflation with confidence as an independent data provider and help provide end-users with a cryptographic guarantee that the data has not been manipulated,” said Friedman. Asked by Cointelegraph if Truflation envisions an audience/market beyond professional economic forecasters and institutional investors, Truflation’s Rust answered, “Yes, 100%.” He pointed out that worldwide, there were perhaps 500 million accredited investors — “but what about the remaining 8.5 billion people on the planet? “How can they get access to inflation-related information and protect themselves against inflation?” Does Truflation really need a blockchain? Truflation’s methodology may not absolutely require a blockchain. For some users like Booth, its on-chain availability is largely irrelevant. Still, Rust went to some pains to explain that what separates Truflation’s methodology from others is the fact that it is “transparent, continuously tested, and validated using multiple sources in real time. The blockchain allows us to achieve this.” The technology also provides immutability, censorship resistance, lower costs and “accessibility to all.” Consider immutability. Governments can sometimes “edit up to six months of historical data and reports,” said Rust. By comparison, “once data is written on the blockchain, it’s logged forever.” In addition, the project makes use of blockchain-enabled tokenization that significantly reduces costs. Data providers, hosting companies and software and data builders can earn Truflation tokens (TFI), “which represent their ownership and utility in the network.” This ensures transparency in terms of governance, too, because tokenholders have voting rights in various protocol activities, including data category selection, market strategies and token rewards. This contrasts with government models, “where the government can change the methodology at the whim of an administration,” Rust told Cointelegraph. Could it supplant the CPI? Could Truflation’s real-time inflation index — or one like it — replace the CPI someday as the dominant inflation index? That’s unlikely, according to Booth. Professional forecasters like herself will still want a way to compare what is happening today with what happened in the past, and the CPI has been published regularly since the early 1920s. It isn’t static, either. Its methodology has changed over the years, sometimes in major ways. A more likely outcome would be that Truflation is eventually integrated into the CPI, she opined. Recent: Help or hindrance: Is Web3 really improving mainstream industry and products? Moreover, many mainstream economists seem to be just hearing about Truflation, so it may take some time before the app gains real traction. In early September, Ed Yardeni, president of Yardeni Research, wrote in his “Quick Takes” newsletter: “The headline CPI inflation rate was 3.2% in July. Truflation is tracking that rate at around 2.60% in August, down from July’s 2.73% tracking….” But when Cointelegraph contacted Yardeni, a well-known Wall Street economist, he declined to comment on the new model: “I’ve just recently started to track them. So I don’t have a strong opinion about them yet,” he said. “The ultimate test” for Truflation, according to Booth, is whether it can prove useful to practitioners whose careers depend on making accurate inflation forecasts. If it can achieve that, then it might eventually be adopted by government agencies. #Blockchain #Federal Reserve #Government #Adoption #Hyperinflation #US Government #United States #Inflation Add reaction READ MORE How to manage crypto losses on tax returns in the US, UK and Canada Bitcoin price could hit $750K to $1M by 2026 — Arthur Hayes IRS proposes unprecedented data-collection on crypto users",
    "originSummary": [
      "Truflation, a blockchain-based inflation index, generates up to around 18 million data points from about 40 sources, offering a much broader data size compared to the 80,000 by the US Bureau of Labor Statistics' Consumer Price Index (CPI).",
      "It updates daily, potentially detecting changes in inflation quicker than the monthly-reported CPI. Blockchain technology also lends transparency, immutability, and cost-effectiveness to Truflation's operation.",
      "While it's doubtful that Truflation will replace the CPI, it shows potential to eventually be incorporated into it, showcasing its capability to disrupt traditional inflation forecasting methods."
    ],
    "commentBody": "",
    "commentSummary": [
      "Truflation, a blockchain-based inflation index, is challenging conventional inflation forecasting techniques in the US by offering a larger data scope, with around 18 million data points from approximately 40 sources.",
      "Unlike the monthly updates of the United States Bureau of Labor Statistics' Consumer Price Index (CPI) that uses 80,000 data points, Truflation's index updates daily, enabling faster detection of inflation changes.",
      "Employing blockchain technology, Truflation promotes transparency, immutability, and cost efficiency, and while it's doubtful to replace the CPI, it may be integrated into it in the future."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699460702530
  },
  {
    "title": "Lukso Blockchain Introduces Universal Profiles Feature Supporting Variety of Decentralized Applications",
    "originLink": "https://www.coindesk.com/tech/2023/11/08/lukso-blockchain-releases-universal-profiles-on-mainnet/",
    "originBody": "Technology Lukso Blockchain Releases Universal Profiles on Mainnet The feature went live on main network blockchain two months after it was released on testnet. By Margaux Nijkerk Nov 8, 2023 at 2:00 p.m. UTC Co-founders of LUKSO Fabian Vogelsteller & Marjorie Hernandez (LUKSO) 10 Years of Decentralizing the Future May 29-31, 2024 - Austin, Texas The biggest and most established global hub for everything crypto, blockchain and Web3. Register Now Lukso, a layer 1 blockchain for creatives co-founded by blockchain veterans Fabian Vogelsteller and Marjorie Hernandez, is going live with \"Universal Profiles\" on the main network. The feature is at the core of the blockchain’s ecosystem, and can be used for all sorts of decentralized applications (for example social media, NFTs, payments), integrating the activity of creators under one smart contract based-account that is supposed to be more than just a wallet address. Hernandez said in a press release that Universal Profiles could be compared with a Swiss Army knife: “multifunctional and essential.” “Universal Profiles will become adopted across creative industries and used not only for people and creators, but also for AI’s, objects and more,” Hernandez said. Lukso launched its main network earlier this year, and Universal Profiles were on a test network since September. Vogelsteller is known as the godfather of the ERC-20 token, since he helped to invent the ubiquitous standard while at the Ethereum Foundation, prior to leaving in 2018 to pursue Lukso. “The problem we're solving is multifaceted,” Vogelsteller told CoinDesk in an interview. “This is not just a new kind of fancy wallet, this is a full on very flexible account system that on the one hand has a face, but you can also interact with any smart contract whatsoever people create.” Read more: Inventor of Ethereum’s ERC-20 Token Standard Plans New Blockchain ‘LUKSO’ for Creative Types A D V E R T I S E M E N T A D V E R T I S E M E N T DISCLOSURE Please note that our privacy policy, terms of use, cookies, and do not sell my personal information has been updated. The leader in news and information on cryptocurrency, digital assets and the future of money, CoinDesk is a media outlet that strives for the highest journalistic standards and abides by a strict set of editorial policies. CoinDesk is an independent operating subsidiary of Digital Currency Group, which invests in cryptocurrencies and blockchain startups. As part of their compensation, certain CoinDesk employees, including editorial employees, may receive exposure to DCG equity in the form of stock appreciation rights, which vest over a multi-year period. CoinDesk journalists are not allowed to purchase stock outright in DCG. Margaux Nijkerk Margaux Nijkerk reports on the Ethereum protocol and L2s. A graduate of Johns Hopkins and Emory universities, she has a masters in International Affairs & Economics. She holds a small amount of ETH and other altcoins. Follow @cryptauxmargaux on Twitter Learn more about Consensus 2024, CoinDesk’s longest-running and most influential event that brings together all sides of crypto, blockchain and Web3. Head to consensus.coindesk.com to register and buy your pass now. Read more about Lukso Fabian vogelsteller ERC-20 Blockchain",
    "originSummary": [
      "Lukso, a creative-focused blockchain founded by Fabian Vogelsteller and Marjorie Hernandez, has introduced \"Universal Profiles\" on its primary network.",
      "This multipurpose feature supports diverse decentralized applications, ranging from social media, NFTs (Non-Fungible Tokens), to payments, compiling all creator's actions under one smart contract-based account.",
      "Described as a \"Swiss Army knife,\" the Universal Profiles are expected to gain wide acceptance across creative sectors due to their versatility and usability."
    ],
    "commentBody": "",
    "commentSummary": [
      "Lukso, a blockchain designed for creative industries by Fabian Vogelsteller and Marjorie Hernandez, has launched a feature called \"Universal Profiles\" on its main network.",
      "Universal Profiles, initially tested from September, acts as a hub supporting various decentralized applications such as social media, NFTs, and payment systems, all under a single smart contract-based account.",
      "Hernandez equates the Universal Profiles to a \"Swiss Army knife\" for its multifunctionality, indicating promising potential for widespread adoption in the creative sectors."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699460702530
  },
  {
    "title": "Global Blockchain Market Estimated to Soar to $227.99 Billion by 2028: The Insight Partners Report",
    "originLink": "https://finance.yahoo.com/news/blockchain-market-growth-hit-72-110700677.html",
    "originBody": "GlobeNewswire Blockchain Market Growth to Hit 72.9% CAGR, Globally, by 2028 - Exclusive Report by The Insight Partners Read full article The Insight Partners Wed, November 8, 2023 at 6:07 AM EST·6 min read The Insight Partners The global blockchain market share worth $227.99 billion by 2028, at a growing CAGR of 72.9% from 2021 to 2028. Pune, India, Nov. 08, 2023 (GLOBE NEWSWIRE) -- According to a new report on “Blockchain Market Size and Forecast (2021–2028), Global and Regional Share, Trends, and Growth Opportunity Analysis – by Component (Solutions and Services), Application (Payments, Exchanges, Smart Contracts, Documentation, Digital Identity, Governance, Risk and Compliance, and Others), and Industry Vertical (BFSI, Retail, Government, Transportation and Logistics, Healthcare, Automotive, Media and Entertainment, and Others)” the market in terms of revenue was estimated to be worth $4.93 billion in 2021 and is poised to reach $227.99 billion by 2028, growing at a CAGR of 72.9% from 2021 to 2028. The growth of the blockchain market is driven by the extensive adoption of blockchain solutions in the BFSI industry vertical and high transparency and operational efficiency with substantial cost savings. However, a combination of blockchain and artificial intelligence for advanced applications and application of blockchain in vaccine manufacture and tracking. Download Sample PDF Brochure: https://www.theinsightpartners.com/sample/TIPTE100002172/ Global Blockchain Market Scope: Report Coverage Details Market Size Value in US$ 4.93 billion in 2021 Market Size Value by US$ 227.99 billion by 2028 Growth rate CAGR of 72.9% from 2021 to 2028 Forecast Period 2021-2028 Base Year 2021 Segments covered Component, Application, Industry Vertical, and Geography Regional scope North America; Europe; Asia Pacific; Latin America; MEA Country scope US, UK, Canada, Germany, France, Italy, Australia, Russia, China, Japan, South Korea, Saudi Arabia, Brazil, Argentina Report coverage Revenue forecast, company ranking, competitive landscape, growth factors, and trends Blockchain technology and its applications in the banking, financial services, and insurance (BFSI) sector have attracted a lot of attention in the past few years, majorly due to its ability to transform existing industries' foundations and business models. Presently, apart from cryptocurrency applications, the other major practical applications of Blockchain are still in the banking and financial sector; however, various companies and institutions are now rapidly developing Blockchain-based solutions to solve complex business problems. In general terms, Blockchain is a subset of a broader distributed ledger technology (DLT), and it combines three significant concepts – cryptography, smart contracts, and distributed ledger design. Distributed ledger technology (DLT) is a fast-emerging approach that records and shares data across various data stores/ledgers. DLT facilitates the recording, sharing, and synchronization of transactions and data across a distributed network of different network participants. Story continues Blockchain can be classified into three major categories – public blockchains, federated blockchains or consortium blockchains, and private blockchains. Some examples of public blockchains are Bitcoin, Ethereum, Monero, Dash, Litecoin, and Dogecoin, among others. Federated blockchains or consortium blockchains include R3 (Banks), EWF (Energy), B3i (Insurance), Corda, and others. Private blockchains' examples include MONAX and Multichain. Private Blockchains allow companies to solve efficiency, security, and fraud problems in traditional financial institutions, but only at an incremental level. Due to this, private blockchains presently are not expected to revolutionize the traditional banking and financial system. However, public blockchains hold great potential to reshape the existing financial system by replacing most functions of financial institutions with software. Global Blockchain Market: Application Overview The global blockchain market is segmented into payments, exchanges, smart contracts, documentation, digital identity, governance, risk and compliance, and others in terms of application segment. The others segment include digital voting, ride-sharing, advertising, and many others. Blockchain reduces cost, increases security and transparency, and decreases transaction time while reducing the need for a trusted third party. Blockchain handles a varying set of rules and configurations. Applications such as smart contracts can greatly improve process efficiency, reliability, and transparency, and reduce risk. The prospective uses of blockchain are varied and wide, and the technology is becoming more prevailing. The blockchain will be adopted by the largest companies that drive innovation and solutions due to blockchain's global and collaborative nature. Blockchain has strengthened the BFSI industry globally. Blockchain technology can enhance the infrastructure to deal with issues more efficiently than current systems. The future market growth of blockchain is expected to be phenomenal, mainly due to the interest of major market players such as IBM, Microsoft, Oracle, HPE, and Intel. In 2020, the payments segment led the market and accounted for a larger market share. Order a Copy of this Report at: https://www.theinsightpartners.com/buy/TIPTE100002172/ Global Blockchain Market: Competitive Landscape and Key Developments IBM Corporation, Accenture, Amazon Web Services, Oracle Corporation, and Intel Corporation are among the key players profiled during the study of the global blockchain market. In addition, several other essential market players were studied and analyzed to get a holistic view of the market and its ecosystem. Recent Developments: In 2019: Bitfury partnered with the Astana International Financial Centre (AIFC), a Kazakhstan-based financial hub, to apply blockchain technology across several industries. The Astana International Financial Centre (AIFC) would apply the company's blockchain expertise in creating projects and promoting new startups on an international scale. In 2019: Ripple and Forte announced an ambitious project to integrate blockchain technology into video games. The plan features US$ 100 million funds for developers. This project would expand its blockchain services beyond its core business. In 2019: Carrefour and Nestle Partnered with IBM to use blockchain technology in food categories. The partnership would enable a rapid expansion of a blockchain-based network that brings more transparency to the global food supply chain of retailers, growers, wholesalers, processors, distributors, and manufacturers ambitions. Summit will partner with Turn/River Capital, which made its initial investment in Invicti in 2017 both these company are forecasted to be a key stakeholder to build strong strategic alliance. In 2019: IBM blockchain solution used by Volkswagen Group to track minerals supply chain. The solution would help Volkswagen Group meet the reliable sourcing standards plan by the Organization for Economic Cooperation and Development by offering a permanent record of mineral movements to help the compliance process. Go through further research published by The Insight Partners: Blockchain in Smart Home Market - Global Analysis and Forecast to 2030 Blockchain Government Market - Global Analysis and Forecast to 2030 Blockchain AI Market - Global Analysis and Forecast to 2030 About Us: The Insight Partners is a one stop industry research provider of actionable intelligence. We help our clients in getting solutions to their research requirements through our syndicated and consulting research services. We specialize in industries such as Semiconductor and Electronics, Aerospace and Defense, Automotive and Transportation, Biotechnology, Healthcare IT, Manufacturing and Construction, Medical Device, Technology, Media and Telecommunications, Chemicals and Materials. Contact Us: If you have any queries about this report or if you would like further information, please contact us: Contact Person: Ankit Mathur E-mail: sales@theinsightpartners.com Phone: +1-646-491-9876 Press Release: https://www.theinsightpartners.com/pr/blockchain-technology-market TRENDING 1. Investors spurn options hedges as U.S. stock rally crushes fear 2. Why the Raymond James CEO sees a soft landing ahead 3. Cleveland Fed President Loretta Mester to retire next June 4. Jeffrey Gundlach on Fed, interest rates, economy, and more 5. Texas businessman at center of Attorney General Ken Paxton’s impeachment facing new charges",
    "originSummary": [
      "The global blockchain market is predicted to grow significantly, with a compound annual growth rate (CAGR) of 72.9% anticipated by 2028, as stated by The Insight Partners.",
      "Initially valued at $4.93 billion in 2021, the blockchain market is forecasted to soar to $227.99 billion by 2028, primarily due to its broadening application in industries such as banking, financial services, and insurance (BFSI) for enhanced transparency and operational efficiency.",
      "The fusion of blockchain technology and artificial intelligence is also propelling this market expansion, with major contributors being IBM, Microsoft, Oracle, HPE, and Intel."
    ],
    "commentBody": "",
    "commentSummary": [
      "The global blockchain market is predicted to grow at a compound annual growth rate (CAGR) of 72.9% by 2028, as reported by The Insight Partners.",
      "Revenue from the blockchain market, valued at $4.93 billion in 2021, is expected to rise dramatically to $227.99 billion by 2028 with key players such as IBM, Microsoft, Oracle, HPE, and Intel.",
      "This swift expansion is attributed to the escalating adoption of blockchain solutions across various sectors, specifically banking, financial services, and insurance (BFSI) sector, due to its capability to enhance transparency and operational efficiency."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699460702530
  },
  {
    "title": "HSBC Partners with Metaco to Launch Custody Service for Blockchain-based Assets by 2024",
    "originLink": "https://www.reuters.com/technology/hsbc-plans-custody-service-non-crypto-digital-assets-2023-11-08/",
    "originBody": "Future of Money HSBC plans custody service for non-crypto digital assets By Elizabeth Howcroft November 8, 202311:16 AM UTCUpdated 5 hours ago HSBC Bank logo is seen in this illustration taken March 12, 2023. REUTERS/Dado Ruvic/Illustration/File Photo Acquire Licensing Rights LONDON, Nov 8 (Reuters) - HSBC (HSBA.L) plans to launch in 2024 a custody service for storing blockchain-based assets excluding cryptocurrency, the bank said on Wednesday. The service, which is a partnership with Swiss digital asset firm Metaco, will allow institutional clients to store blockchain-based tokens representing traditional financial assets, as opposed to crypto or stablecoins, HSBC said. HSBC said last week it had made tokens representing physical gold held in its London vault. The bank last year launched a digital asset platform, HSBC Orion, which allows financial institutions to issue blockchain-based versions of financial assets, also known as tokenised securities. Advertisement · Scroll to continue \"We’re seeing increasing demand for custody and fund administration of digital assets from asset managers and asset owners, as this market continues to evolve,\" said Zhu Kuang Lee, chief digital, data and innovation officer at HSBC. Blockchain is a digital ledger that records ownership of tokens. It has not seen widespread adoption but proponents say it has the potential to make trading more efficient and transparent. Advertisement · Scroll to continue So far, its main use-case has been cryptocurrencies, which remain a relatively small part of the global financial system. The value of all cryptocurrencies is around $1.4 trillion, down from a peak above $3 trillion in late 2021, according to CoinGecko data. HSBC did not give a figure for the size of the market for blockchain-based assets excluding cryptocurrencies. Banks and other financial firms have invested billions of dollars into finding uses for blockchain. Advertisement · Scroll to continue In 2019, HSBC announced a platform called Digital Vault, which allows investors to access digital records of securities bought on private markets. Reporting by Elizabeth Howcroft Editing by Sinead Cruise and Mark Potter Our Standards: The Thomson Reuters Trust Principles. Acquire Licensing Rights , opens new tab Elizabeth Howcroft Thomson Reuters Reports on the intersection of finance and technology, including cryptocurrencies, NFTs, virtual worlds and the money driving \"Web3\". Read Next Future of Money category Cryptoverse: Bitcoin miners get stuck in a bear pit Spare a thought for the beleaguered bitcoin miner. Future of Money category Cryptoverse: Ether snaps at bitcoin's heels in race for crypto crown For years, ether could barely dream of challenging its big brother bitcoin. Now, its ambitions may be becoming more realistic. Future of Money category Cryptoverse: Blockchain bridges fall into troubled waters Another day, another hack - and another blockchain bridge burned. Future of Money category Cryptoverse: What crisis? Venture capitalists bet big on crypto It's not all doom and gloom. Future of Money category How crypto giant Binance became a hub for hackers, fraudsters and drug traffickers For five years, the world’s largest cryptocurrency exchange Binance served as a conduit for the laundering of at least $2.35 billion in illicit funds, a Reuters investigation has found. Future of Money category Crypto giant Binance kept weak money-laundering checks even as it promised tougher compliance, documents show",
    "originSummary": [
      "HSBC is poised to introduce a blockchain-based asset custody service in 2024, excluding cryptocurrency, in partnership with Swiss firm Metaco.",
      "The service will cater to institutional clients, enabling them to store tokens that symbolize conventional financial assets such as the tokens HSBC recently created representing physical gold.",
      "Last year, HSBC launched the Orion platform that allows the issuance of tokenized versions of financial assets or securities, as part of their wider commitment towards blockchain technology."
    ],
    "commentBody": "",
    "commentSummary": [
      "HSBC is planning to launch a custody service for blockchain-based assets, excluding cryptocurrency, by 2024. This service is in partnership with the Swiss digital asset company, Metaco.",
      "The upcoming custody service will allow institutional clients to store tokens representing traditional financial assets, reflecting a trend towards tokenization in the financial industry.",
      "The bank has already taken steps in this direction, with initiatives like the creation of tokens representing physical gold and the launch of the HSBC Orion platform for issuing tokenized securities."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699460702530
  },
  {
    "title": "HSBC Partners with Metaco to Launch Custody Service for Tokenized Securities Amidst Rising Digital Asset Demand",
    "originLink": "https://www.cnbc.com/2023/11/08/hsbc-to-launch-custody-services-for-tokenized-securities.html",
    "originBody": "SKIP NAVIGATION MARKETS BUSINESS INVESTING TECH POLITICS CNBC TV INVESTING CLUB PRO MAKE IT SELECT USA INTL WATCH LIVE Search quotes, news & videos WATCHLIST SIGN IN TECH HSBC to launch storage services for tokenized securities as more big banks warm to blockchain PUBLISHED WED, NOV 8 20239:08 AM ESTUPDATED 1 MIN AGO Ryan Browne @RYAN_BROWNE_ KEY POINTS HSBC on Wednesday said it is launching custody services for the safe storage of tokenized securities, digital assets that represent regulated securities like bonds. The bank is the latest institution to embrace digital asset custody, after U.S. banking giant BNY Mellon announced a similar move in 2021. HSBC is \"seeing increasing demand for custody and fund administration of digital assets from asset managers and asset owners, as this market continues to evolve.\" In this article HSBA-GB Follow your favorite stocks CREATE FREE ACCOUNT HSBC is the largest bank in Europe by total assets. Nicolas EconomouNurphotoGetty Images HSBC on Wednesday announced it will offer custody services for tokenized securities, making the British bank the latest major institution to embrace digital assets. HSBC is using technology from Swiss crypto custody firm Metaco, which was recently acquired by blockchain startup Ripple, to store bonds and other securities. In a press release, the bank said that the service would complement its HSBC Orion platform for issuing digital assets, as well as a recently-launched offering for tokenized physical gold. HSBC will use Harmonize, Metaco's platform for institutions, which \"helps unify security and management of digital asset operations,\" according to the press release. HSBC is the latest institution to embrace digital asset custody, after U.S. banking giant BNY Mellon announced a similar move in 2021. Tokenized securities are effectively regulated assets, like bonds and equities, in the form of tokens issued on a blockchain. In turn, a blockchain can be considered a shared ledger on which assets are recorded digitally. The technology served as the foundation upon which bitcoin was built, but its applications in the banking world are very different to those of bitcoin and other cryptocurrencies. In the case of banks, these institutions are leveraging blockchain for payments, trading, and other purposes, often without a digital token being involved. Banks are finding utility in tokens by digitizing equities, bonds and other assets. HSBC is \"seeing increasing demand for custody and fund administration of digital assets from asset managers and asset owners, as this market continues to evolve,\" Zhu Kuang Lee, chief digital, data and innovation officer for securities services at HSBC, said in a statement. Metaco CEO Adrien Treccani told CNBC via email that the partnership reinforces \"continued momentum working with top tier financial institutions.\" \"Financial institutions are ready to scale digital assets pilots to real use cases around custody, issuance, trading and settlement of tokenized assets, and in so doing, unlocking economic benefits and new revenue streams.\" It marks another step from HSBC toward embracing digital assets. The bank, which holds about $3 trillion in assets globally, already lets its Hong Kong clients trade in bitcoin and ether exchange-traded funds. Subscribe to CNBC PRO Licensing & Reprints CNBC Councils Select Personal Finance CNBC on Peacock Join the CNBC Panel Supply Chain Values Select Shopping Closed Captioning Digital Products News Releases Internships Corrections About CNBC Ad Choices Site Map Podcasts Careers Help Contact News Tips Got a confidential news tip? We want to hear from you. GET IN TOUCH Advertise With Us PLEASE CONTACT US CNBC Newsletters Sign up for free newsletters and get more CNBC delivered to your inbox SIGN UP NOW Get this delivered to your inbox, and more info about our products and services. Privacy Policy| CA NoticeTerms of Service © 2023 CNBC LLC. All Rights Reserved. A Division of NBCUniversal Data is a real-time snapshot *Data is delayed at least 15 minutes. Global Business and Financial News, Stock Quotes, and Market Data and Analysis. Market Data Terms of Use and Disclaimers Data also provided by",
    "originSummary": [
      "On November 8, 2023, HSBC, Europe's largest bank, announced the launching of a service to store tokenized securities like bonds, partnering with Metaco, a Swiss crypto custody firm now owned by blockchain startup Ripple.",
      "The new service comes in response to rising demand from asset managers and owners for digital asset custody and fund administration.",
      "HSBC, which holds nearly $3 trillion in global assets, already facilitates trade in Bitcoin and Ether exchange-traded funds for its clients in Hong Kong."
    ],
    "commentBody": "",
    "commentSummary": [
      "HSBC, Europe's largest bank, announced the launch of a custody service for storing tokenized securities such as bonds on November 8, 2023.",
      "This service, formed in collaboration with Swiss crypto custody firm Metaco, recently bought by the blockchain startup Ripple, caters to the rising demand from asset managers and owners for digital asset custody and fund administration.",
      "Apart from this, HSBC already enables its Hong Kong clients to trade in bitcoin and ether exchange-traded funds. Globally, the bank holds about $3 trillion in assets."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699460702530
  },
  {
    "title": "Essential Skills for Aspiring Blockchain Developers: More than Just Programming",
    "originLink": "https://www.dice.com/career-advice/blockchain-developer-skills-what-do-you-need-to-know",
    "originBody": "Blockchain Developer Skills: What Do You Need to Know? by Nate Swanner Nov 8, 2023 7 min read Blockchain, the decentralized ledger technology that allows users to create a permanent record of transactions, has drawn a good deal of hype over the past several years thanks to its connections to cryptocurrency. However, blockchain’s uses also extend to other functions, including “smart contracting.” If these things interest you, you should consider a career or sideline as a blockchain developer—but what blockchain developer skills do you need to succeed? While the blockchain may seem like a complicated concept, it’s attracted a sizable community of passionate tech pros who are only too happy to share their learnings with you. Many people who specialize in blockchain developer skills start out as software engineers or developers before gravitating toward blockchain tech. What do you need to learn to become a blockchain developer, and how can you tell if it’s right for you? We asked several experts for their take on blockchain development. How can you tell if being a blockchain developer is right for you? “Identifying if a career as a Blockchain Developer aligns with one's aspirations involves both technical inclination and an appreciation for decentralized ideologies,” says Igor Abrosimov, General Manager at AmberSoft. “Fundamentally, if someone has a penchant for cryptography, and data structures, and is intrigued by the marriage of finance and technology, they're off to a good start. However, what truly distinguishes blockchain from other fields is its inherent decentralized ethos. It's not merely about writing code, but understanding the profound implications of creating trustless, permissionless systems that challenge traditional centralized authorities.” What technical skills does a blockchain developer need? Blockchain developers need to have a strong foundation in the following technical skills: Programming languages: Blockchain developers must be proficient in at least one programming language, such as Solidity, Rust, or Go, commonly used to develop smart contracts, the self-executing programs that power blockchain applications. Cryptography: Blockchain developers need to have a good understanding of cryptography, especially in the context of securing data in blockchain transactions and protecting smart contracts from attack. Distributed systems: Blockchain developers must master distributed systems spread across multiple computers. Distributed systems make blockchain networks scalable and secure. Data structures: Blockchain developers should master data structures, which are ways of organizing data efficiently and storing blockchain data to implement smart contracts. Blockchain architecture: Blockchain developers need a working knowledge of blockchain architecture, which is how blockchain networks are designed and implemented. The architecture includes knowledge of consensus algorithms, blockchain security, and blockchain scalability. In addition to these technical skills, blockchain developers must have strong problem-solving and analytical skills. They need to be able to think creatively and come up with solutions to complex problems. They also need to be able to debug code and identify and fix security vulnerabilities—which is especially important given the much-publicized breaches within the cryptocurrency industry. “Critical technical skills for a Blockchain developer include proficiency in programming languages such as Solidity, C++, or Java. Understanding data structures, algorithms, cryptography, smart contract development, and distributed ledger technologies is essential,” adds Ramy Daas, President and Founder at VTS. “Familiarity with blockchain platforms like Ethereum and Hyperledger, as well as version control systems and APIs, is also crucial.” What additional skills do blockchain developers need? Here are some additional technical skills that can be beneficial for blockchain developers: Web development: Many blockchain applications are web-based. As a result, knowledge of web development frameworks such as React and Django can benefit blockchain developers. Cloud computing: Many blockchain applications deploy on platforms such as Amazon Web Services (AWS) and Google Cloud Platform (GCP). As a result, knowledge of cloud computing can be beneficial for blockchain developers. Machine learning: Machine learning can be used to develop new blockchain applications, such as decentralized exchanges and predictive markets. As a result, knowledge of machine learning can be beneficial for blockchain developers. By developing these technical skills, blockchain developers can become more versatile and marketable to potential employers. What disciplines beyond crypto should blockchain developers focus on? “Apart from cryptography and cryptocurrency concepts, Blockchain developers should master disciplines like computer science, software engineering, data structures, algorithms, and networking,” Daas notes. “Understanding economics, finance, and legal aspects of blockchain and smart contracts can also be beneficial.” “Don't just hang out in the crypto corner,” Sudhir Khatwani, President and CEO at TheMoneyMongers, tells Dice. “Smart contracts are huge and not just about money changing hands. They're changing business, law, you name it. And don't forget about beefing up on cybersecurity. You don’t want to be the one who left the door open for hackers.” Do you need a degree to be a blockchain developer? Short answer: it depends. “Degrees in computer science or software engineering sound impressive, and they teach you a lot. But the blockchain beast isn’t tamed by degrees alone,” notes Khatwani. “It respects skill and street smarts. Stay curious, keep tinkering, and absorb all you can—blockchain is more street fight than textbook study.” In other words, as with many tech professions, becoming a Blockchain developer can come down to your capacity for self-learning. Keep in mind that the more skills you master, the bigger compensation you can demand from clients and potential employers, depending on your choice of career route. Daas adds: “While there's no specific degree requirement, a bachelor's or master's degree in computer science, information technology, software engineering, or a related field is commonly preferred by employers. Additionally, specialized certifications in blockchain technologies can enhance your credentials and marketability.” It is possible to get a job as a Blockchain developer without a degree, Daas continues. “Demonstrating a solid portfolio of projects, gaining relevant certifications, showcasing your technical skills through open-source contributions, and networking within the blockchain community can help you secure opportunities in this field.” What are some questions blockchain developers might face in an interview? We asked experts what questions they might ask in an interview for a blockchain developer role. Here are some of the questions you might encounter when interviewing: Describe the consensus algorithms commonly used in blockchain and their advantages and disadvantages. How would you design a secure smart contract to handle a decentralized voting system on the blockchain? Explain the hashing process in blockchain and its role in ensuring data integrity. What are the potential scalability challenges in blockchain technology, and how can they be mitigated? Discuss the differences between public and private blockchains and their use cases. What is a smart contract, and how does it work? What are the different types of consensus mechanisms used in blockchain networks? What are some of the potential applications of blockchain technology outside of the financial industry? Describe a situation where you optimized an intelligent contract's gas usage. What techniques or tools did you employ? Given a use case like supply chain tracking, how would you leverage blockchain technology to ensure transparency and security? How many minimum BIP 39 vocabulary words would you need to create a wallet? A group of people can get funds by Claim method from a single, smart contract. Give the most efficient way to distribute the funds. You have users who have NFTs in the ETH blockchain, and the product marketing manager asks you to distribute rewards via claim at another blockchain; how will you make it? As our experts point out, it’s essential to embrace blockchain as a concept, not a means to an end. Blockchain is relatively new technology, and very much finding its way. If you master the core skills related to it, you have a shot at contributing to its evolution.",
    "originSummary": [
      "Blockchain developers need an array of technical skills including proficiency in programming languages, cryptography, distributed systems, data structures, and understanding of blockchain architecture.",
      "Other useful skills for blockchain developers encompass web development, cloud computing, and machine learning. Although a degree is common, practical skills, self-teaching, a convincing project portfolio, relevant certifications and networking are equally appreciated.",
      "For job interviews, candidates can expect technical questions about the core principles of blockchain, its technology, and related applications."
    ],
    "commentBody": "",
    "commentSummary": [
      "Blockchain developers need a mix of technical and non-technical skills such as proficiency in programming languages, cryptography, distributed systems, data structures, and understanding of blockchain architecture.",
      "Beyond formal education, practical skills like web development, cloud computing, and machine learning, as well as self-teaching are highly valued in the blockchain technology field.",
      "To land in a blockchain developer job without a college degree, one may build a strong portfolio of projects, acquire relevant certifications, contribute to open-source projects, and familiarize with effective networking techniques."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699460702530
  },
  {
    "title": "Blockchain Technology Poised to Transform Banking Sector, Offering Speed, Security and Cost-Efficiency",
    "originLink": "https://www.financemagnates.com/cryptocurrency/blockchain-revolution-a-race-for-bankings-survival/",
    "originBody": "In the rapidly shifting landscape of modern finance, one technology has the potential to reshape the very essence of banking. Blockchain technology, with its decentralized architecture, is taking center stage, and it's time for banks to recognize the urgency of the situation. Blockchain's Banking Revolution But how exactly is blockchain poised to revolutionize the world of banking? It does so by addressing some of the industry's most pressing challenges: Expediting International Transfers: The capital markets are on the cusp of transformation, with blockchain's potential to eliminate operational hazards, reduce counterparty risks, and promote global inclusivity. The digitization and tokenization of financial products simplify trading, cutting capital costs and increasing liquidity. Creating an Unshakable Audit Trail: Blockchain's security extends to the realm of banking transactions. The immutability of blockchain ledgers makes it incredibly challenging for hackers to breach and compromise sensitive information. Reducing Costs for Banks and Customers: The key lies in the substantial cost reduction that blockchain offers. Blockchain streamlines banking processes, leading to faster payment processing, seamless transactions, and reduced costs. Traditional overheads and paperwork vulnerable to fraud are no longer acceptable in our fast-paced world. Ensuring Regulatory Compliance: Regulatory compliance is paramount in the financial sector, and time is of the essence. Blockchain simplifies financial operations, streamlining reporting and transaction verification, while the immutability of ledgers eliminates the risk of fraud and enables faster settlements. Securing Messaging and Infrastructure: Blockchain's security extends to communications, making it incredibly difficult for unauthorized parties to tamper with financial transactions. It safeguards data integrity and prevents unauthorized access. Decentralization is Key But what is the driving force behind the blockchain revolution, and why is it an imperative necessity? The answer lies in the core principle of decentralization. While blockchain technology empowers individuals by decentralizing control, traditional banking systems have thrived on centralization and intermediaries. The rise of cryptocurrencies, such as Bitcoin, demonstrates the unrelenting pursuit of decentralization. These digital assets, underpinned by blockchain technology, are designed to circumvent central authority. They promise financial autonomy, security, and privacy, concepts that are clearly resonating with consumers. Keep Reading Binance's Web3 Wallet: Is Multi-Party Computation the Solution? 2023 Digital Banking Trends and the Future of Banking Crypto Wallet Adoption as a Game-Changer One of the most remarkable trends in recent years is the surging adoption of crypto wallets. These digital wallets, essential for managing cryptocurrencies, are increasingly becoming a part of daily life for millions. With growing adoption rates, they have transcended their role in the world of crypto investments and become a norm for digital transactions. As crypto wallets become a daily tool for individuals, the shift becomes evident. With unparalleled benefits, including cheaper and faster cross-border payments, more integrated financial markets, and increased financial inclusion, cryptocurrencies are no longer the future; they are a reality. From our Directory Platforms Which are the platforms available out there for trading? See all here cTrader UTIP Trading Platform Find more The Battle for Deposits in a New Era As the surge in crypto wallet adoption continues to reshape financial landscapes, another impending battle for deposits is on the horizon. Traditional banks and tech giants are about to face an existential challenge. Cryptocurrencies and DeFi platforms have unlocked new avenues for users to earn interest on their digital assets. Crypto enthusiasts can now stake their holdings, participate in liquidity pools, or simply store their assets in wallets that offer attractive yields. These emerging trends are driving a wedge between banks and their customers, as depositors explore alternative avenues to make their money work for them. The Implications for Traditional Banks: Urgency Strikes Home This shift towards crypto wallet adoption brings forth a massive challenge for traditional banks. The convenience, security, and efficiency offered by cryptocurrencies are reshaping the way individuals perceive banking. With banks historically at the center of financial transactions, crypto assets are now presenting a decentralized alternative. Urgency is inescapable as we ask: Why would people need to use a bank with so many crypto alternatives doing faster and more efficient tasks? Banks must acknowledge the changing landscape of financial services. While they have long been the gatekeepers of financial activities, they now face competition from decentralized alternatives. The centralization model that has been the backbone of banking for centuries is being challenged by the decentralized nature of blockchain technology. Embracing Blockchain or Facing Irrelevance The race is on, and the future of banking hinges on how well traditional institutions can adapt and integrate blockchain into their value proposition. Those that embrace this transformative technology will not only survive but thrive in a decentralized world. Blockchain technology is the driving force behind decentralization, and cryptocurrencies are its real-world embodiment. The world of finance is evolving, and the transformation is happening faster than ever. To remain relevant, banks must become the vanguard of blockchain adoption, securing a future where the decentralization of financial transactions becomes a norm. In this fast-evolving landscape, banks that fail to adapt may find themselves relegated to history, as the world moves forward into a decentralized financial future. The urgency is clear: embrace blockchain or face the possibility of irrelevance. The revolution is here, and it's decentralization that's leading the way.",
    "originSummary": [
      "Blockchain technology can revolutionize the finance industry by speeding up international transfers, providing secure audit trails, and lowering costs.",
      "The rise of cryptocurrencies and crypto wallets pose a challenge to traditional financial systems as they draw consumers toward decentralized alternatives.",
      "Institutions that fail to adopt blockchain risk becoming obsolete amidst evolving finance landscape. Blockchain's enhanced security for transactions makes it hard for hackers to access sensitive information, offering autonomy, security, and privacy to consumers."
    ],
    "commentBody": "",
    "commentSummary": [
      "Blockchain technology can transform the financial industry with its potential to fast-track international transfers, establish secure audit trails, and decrease costs for banks and customers.",
      "Banks that adopt and adjust to blockchain technology have a high chance of success, while those that do not may struggle to remain relevant as the finance sector evolves.",
      "Blockchain's security notably enhances the protection of banking transactions, making it very challenging for hackers to compromise critical information. The decentralized nature of blockchain provides financial autonomy and privacy to consumers, potentially threatening traditional centralized banking systems."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699460702530
  },
  {
    "title": "Unconventional Crypto Stocks: AMD, Meta Platforms, and Shopify Show Strong Potential for Blockchain Integration",
    "originLink": "https://investorplace.com/2023/11/bullish-on-blockchain-3-compelling-crypto-stocks-beyond-the-usual-suspects/",
    "originBody": "Home / Crypto & Blockchain / SPECIAL REPORT 5 Artificial Intelligence Stocks to Buy Before They Skyrocket Bullish on Blockchain: 3 Compelling Crypto Stocks Beyond the Usual Suspects These three lesser-known crypto stocks exhibit hidden potential for stellar gains 15h ago · November 7, 2023 By Muslim Farooque, InvestorPlace Contributor Advertisement Buy these crypto stocks beyond the familiar and brace for a potential boom alongside Bitcoin’s $50,000 quest. Advanced Micro Devices, Inc. (AMD): With projected AI chip sales hitting $2 billion by 2024, AMD is a compelling pick for savvy investors. Meta Platforms (META): Meta’s impressive rally of a 152% stock increase YTD and revenue surpassing $34 billion positions it as a forerunner. Shopify (SHOP): Shopify capitalizing on crypto’s rise and pushing merchandise volume beyond $56 billion indicate robust platform growth. Source: Chinnapong / Shutterstock Bitcoin’s (BTC-USD) has been eye-catching, with a notable 23% rally over the past month. Moreover, some analysts predict the crypto to eclipse the $50,000 mark in the near future. Then, it’s most likely to have a knock-on effect on crypto stocks. Moreover, the bullish sentiment is partly driven by the U.S. Securities and Exchange Commission (SEC) green-lighting a Bitcoin ETF. That would surely serve as a significant catalyst for the crypto market. As a result, it may be wise for investors to take these crypto stocks into account when diversifying their portfolios beyond the current offerings. Advanced Micro Devices, Inc. (AMD) Source: Pamela Marciano / Shutterstock.com While not a cryptocurrency stock in the traditional sense, Advanced Micro Devices, Inc. (NASDAQ:AMD) high-performance GPUs are a linchpin in the crypto mining industry. As AMD charts its future, it anticipates substantial growth in AI microchip sales. It projects revenues of $400 million in the upcoming fourth quarter. Then, it expects to go beyond $2 billion by 2024. This growth is paralleled by the introduction of new GPU microchips. These are specifically designed to meet the demands of cryptocurrency mining. Even though the market is still led by Nvidia (NASDAQ:NVDA), AMD is positioning itself as a strong competitor. Furthermore, hopes are high with the strategic release of the MI300A and MI300X GPUs. AMD is not only answering the crypto market call but also setting the stage to capture market share from Nvidia. This strategic move, combined with an 86.7% bump in stock value year over year (YOY), points to a company on the prowl. Meta Platforms (META) Source: Ascannio / Shutterstock.com After a challenging 2022, Meta Platforms (NASDAQ:META) has staged an impressive rebound, with its stock value soaring by 152% year to date (YTD). Meta’s foray into virtual and augmented reality (VR/AR) realms offers fertile ground for blockchain applications. The possibilities range from authenticating digital assets to potentially launching a native cryptocurrency for its virtual ecosystem. This strategic expansion signals potential upsides for the broader crypto-mining industry. Moreover, the robustness of Meta’s financial health is evident in its recent quarterly report. The print showcases earnings per share of $4.39, eclipsing estimates by a whopping 76 cents. Also, revenues have surged to an impressive $34.15 billion, a 23.2% increase YOY. META comfortably exceeded analyst expectations by $590 million. These numbers reflect Meta’s successful navigation through a competitive market landscape. Shopify (SHOP) Source: Burdun Iliya / Shutterstock.com Shopify (NYSE:SHOP) may not be a direct player in the crypto mining industry. Yet, it has adeptly woven blockchain into its e-commerce fabric. The platform now enables merchants to accept cryptocurrencies, broadening payment options for users. In August, this capability advanced with the integration of Solana Pay. It allows transactions in USD Coin (USDC-USD) via blockchain-enabled wallets like Phantom, simplifying on-chain payments. Shopify has launched blockchain tools aimed at improving the experience for Web3-focused merchants. This proactive approach is mirrored in Shopify’s financial performance. Its latest earnings report showcases a 24 cents per share profit, outperforming the expected 14 cents. In addition, revenue exceeded expectations at $1.71 billion against the $1.67 billion anticipated by market analysts. Furthermore, Shopify’s incorporation of blockchain pays off as the platform’s merchandise volume swells to $56.2 billion, a 22% increase, exceeding expectations by over $2 billion. As cryptocurrency mining and usage continue to climb, Shopify’s proactive measures poise it to capture a growing customer base. On the date of publication, Muslim Farooque did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Muslim Farooque is a keen investor and an optimist at heart. A life-long gamer and tech enthusiast, he has a particular affinity for analyzing technology stocks. Muslim holds a bachelor’s of science degree in applied accounting from Oxford Brookes University. Artificial Intelligence, E-Commerce, Financial, Fintech, Consumer Discretionary, Retail, Technology Growth Stocks Article printed from InvestorPlace Media, https://investorplace.com/2023/11/bullish-on-blockchain-3-compelling-crypto-stocks-beyond-the-usual-suspects/. ©2023 InvestorPlace Media, LLC Sponsored Headlines More from InvestorPlace Market Analysis Stock Market Signals Tremendous Gains Are On The Way 23h ago · By Luke Lango, InvestorPlace Senior Investment Analyst Market Analysis Bollinger Bands: What Are They… And Do They Work? 18h ago · By Thomas Yeung, CFA, InvestorPlace Markets Analyst Stocks to Buy PLTR Stock Outlook: Why Palantir Technologies Just Might Be Your Best AI Pick 1d ago · By Louis Navellier and the InvestorPlace Research Staff ADVERTISEMENT Most Popular Stocks to Buy 15h ago 3 Smart Stocks to Buy and Hold in 2024 Stocks to Buy 21h ago Billionaire's Blueprint: 3 Under-the-Radar Stocks Ready for Massive Growth Stocks to Buy 18h ago PYPL Stock Can Turn Your $50 Into $200. Here's How. Stocks to Buy 5h ago Nvidia Stock's Bull Run: Lock in Your Position Before the Next Surge Stocks to Buy 13h ago 3 Speculative Stocks for 100% Returns at the Blink of an Eye ADVERTISEMENT ADVERTISEMENT",
    "originSummary": [
      "Advanced Micro Devices (AMD) is emerging as a key player in the cryptocurrency mining industry, expecting its AI chip sales to reach $2 billion by 2024.",
      "Meta Platforms (META) has seen a 152% year-to-date (YTD) stock rally and boasts of revenue exceeding $34 billion. Its ventures into virtual reality/augmented reality (VR/AR) may lead to potential blockchain applications.",
      "Shopify, while not directly involved in crypto mining, allows merchants to accept cryptocurrencies through blockchain integration in its e-commerce platform, leading to a boost in merchandise volume by 22%."
    ],
    "commentBody": "",
    "commentSummary": [
      "Advanced Micro Devices (AMD) is poised as a significant figure in the crypto mining industry, anticipating major growth in AI chip sales to reach $2 billion by 2024.",
      "Meta Platforms (META) has seen a 152% YTD stock rally with revenues eclipsing $34 billion and is exploring blockchain applications in VR/AR, presenting rich possibilities in the crypto landscape.",
      "Shopify (SHOP) has incorporated blockchain into its e-commerce platform, thereby empowering merchants to accept cryptocurrencies and noting a 22% rise in merchandise volume."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699460702530
  }
]
