[
  {
    "id": 39344956,
    "title": "Cloudflare ينتصر على القزم براءات الاختراع السمور في المحاكمة",
    "originLink": "https://blog.cloudflare.com/cloudflare-defeats-patent-troll-sable-at-trial",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39344956",
    "commentBody": "",
    "originSummary": [
      "خرجت Cloudflare منتصرة في محاكمة ضد متصيدي براءات الاختراع Sable IP و Sable Networks.",
      "وخلصت هيئة المحلفين إلى أن Cloudflare لم تنتهك براءة الاختراع المؤكدة وأعلنت أن مطالبات براءات الاختراع الخاصة ب Sable غير صالحة.",
      "يمكن أن يعزى الفوز إلى جهود الفريق القانوني لشركة Cloudflare والمستشار الخارجي والمشاركين في مبادرة Project Jengo ، التي تكافئ الأفراد على تقديم أدلة تبطل مطالبات متصيدي براءات الاختراع.",
      "أدى نجاح Cloudflare في إبطال أجزاء من ثلاث براءات اختراع Sable إلى الحد من قدرتها على رفع دعاوى قضائية ضد شركات أخرى.",
      "تؤكد القضية على التكاليف والمخاطر المرتفعة المرتبطة بالتقاضي بشأن براءات الاختراع وترسل تحذيرا إلى متصيدي براءات الاختراع بأن Cloudflare لن يتم تخويفها بسهولة."
    ],
    "commentSummary": [
      "وتغطي المناقشة جوانب متعددة من نظام البراءات، مثل جودة البراءات، ومتصيدو البراءات، وبراءات البرمجيات، والضرائب على الملكية الفكرية، ومدة البراءات، ودور البراءات في الابتكار.",
      "وتشمل اقتراحات التحسين تحفيز الشركات على الدفاع ضد البراءات غير الصالحة، وزيادة التمويل لمكتب براءات الاختراع، ومعاقبة إيداعات براءات الاختراع بسوء نية، ومعالجة مسألة الشركات التي تنشئ كيانات وهمية.",
      "وهناك مناقشات حول الغرض من البراءات وفعاليتها، حيث يدعو البعض إلى إلغائها ويؤكد البعض الآخر على دورها في حماية المخترعين وتعزيز التنمية. وتناقش أيضا تأثير البراءات على مختلف الصناعات، مثل المستحضرات الصيدلانية والتكنولوجيا."
    ],
    "points": 1001,
    "commentCount": 362,
    "retryCount": 0,
    "time": 1707747282
  },
  {
    "id": 39344815,
    "title": "تمول AMD تنفيذ CUDA مفتوح المصدر لوحدات معالجة الرسومات AMD على ROCm",
    "originLink": "https://www.phoronix.com/review/radeon-cuda-zluda",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39344815",
    "commentBody": "",
    "originSummary": [
      "دعمت AMD ماليا تطوير تطبيق CUDA مفتوح المصدر يسمى ZLUDA ، والذي يمكن تطبيقات NVIDIA CUDA من العمل على وحدات معالجة الرسومات AMD Radeon دون تعديل شفرة المصدر.",
      "تم تطوير ZLUDA في الأصل لرسومات Intel ، وقد تم تكييفه للاستخدام على وحدات معالجة الرسومات AMD ، ولكنه ليس آمنا تماما من الفشل ويفتقر إلى الدعم الكامل ل NVIDIA OptiX.",
      "يسمح الإصدار مفتوح المصدر من ZLUDA بتحديد سلسلة بطاقة رسومات Radeon الفعلية ، بدلا من تسمية \"جهاز الرسومات\" العامة."
    ],
    "commentSummary": [
      "تدور المناقشة حول محاولات AMD للتنافس مع NVIDIA في سوق GPU ، خاصة في التعلم الآلي وتوافق البرامج.",
      "وتثار شواغل بشأن الهيمنة الساحقة ل CUDA والصعوبات في محاكاتها، مع التشديد على الحاجة إلى معايير مفتوحة.",
      "تتناول المحادثة أيضا تحديات دعم البرامج والسائقين من AMD وتؤكد على أهمية أنظمة التشغيل في مجال الذكاء الاصطناعي. يتم إجراء دعوة عامة لزيادة إمكانية الوصول والتعاون والمنافسة في الصناعة."
    ],
    "points": 973,
    "commentCount": 378,
    "retryCount": 0,
    "time": 1707746435
  },
  {
    "id": 39344770,
    "title": "سرقة المليارات في سرقة الأجور في الولايات المتحدة، مما يؤثر بشكل غير متناسب على العمال المهمشين",
    "originLink": "https://www.theguardian.com/us-news/2023/jun/15/wage-theft-us-workers-employees",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39344770",
    "commentBody": "",
    "originSummary": [
      "يتعرض العمال في الولايات المتحدة لسرقة الأجور بأكثر من 50 مليار دولار سنويا ، مما يجعلها أكثر أشكال السرقة انتشارا في البلاد.",
      "تؤثر سرقة الأجور بشكل غير متناسب على العمال ذوي الأجور المنخفضة والنساء والأشخاص الملونين والعمال المهاجرين.",
      "وقد تورطت شركات كبرى مثل أمازون ووول مارت ، وكذلك مقاولي البناء ، في انتهاكات سرقة الأجور."
    ],
    "commentSummary": [
      "يستكشف المقال قضايا سرقة الأجور والدفع في الأوساط الأكاديمية ، ويعالج المخاوف بشأن المدفوعات المتأخرة وسوء معاملة العمال.",
      "ويناقش أجور ومسؤوليات الرؤساء التنفيذيين، ويسلط الضوء على ديناميكيات القوة غير المتكافئة بين أصحاب العمل والموظفين.",
      "كما تمت مناقشة دور النقابات، واللوائح في الأسواق الحرة، وتأثير الكارتلات على المنافسة، والعلاقة بين المالك والمستأجر، مع التأكيد على الحاجة إلى تنظيم فعال وحماية العمال."
    ],
    "points": 362,
    "commentCount": 398,
    "retryCount": 0,
    "time": 1707746224
  },
  {
    "id": 39343746,
    "title": "إزالة الغموض عن مرشح كالمان: فهم وتنفيذ الخوارزمية في مشاريع العالم الحقيقي",
    "originLink": "https://thekalmanfilter.com/kalman-filter-explained-simply/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39343746",
    "commentBody": "",
    "originSummary": [
      "تقدم المقالة مفهوم مرشح كالمان ، وهي خوارزمية تستخدم لتقدير معلمات النظام.",
      "يستكشف مدخلات ومخرجات وتطبيقات مرشح كالمان في مجالات مثل تتبع الكائنات وتقدير الوزن وأنظمة التوجيه والتحكم.",
      "تقدم المقالة نظرة عامة شاملة على خوارزمية Kalman Filter ، وتشرح كل خطوة في العملية ، وتؤكد على أهمية التهيئة وإعادة التهيئة ، وتناقش حساب Kalman Gain وتقدير حالة النظام وتباين الخطأ."
    ],
    "commentSummary": [
      "يستخدم مرشح كالمان على نطاق واسع في مجالات مختلفة مثل الروبوتات والاقتصاد وأنظمة الرادار.",
      "يعبر بعض المشاركين عن إحباطهم من نقص الموارد التي يمكن الوصول إليها والارتباك الناجم عن التدوين الرياضي.",
      "تتم مناقشة وجهات نظر مختلفة حول استخدام المتغيرات المكونة من حرف واحد مقابل أسماء المتغيرات ذات المعنى."
    ],
    "points": 332,
    "commentCount": 85,
    "retryCount": 0,
    "time": 1707737588
  },
  {
    "id": 39354138,
    "title": "عرض صوتي مستقر: توليد موسيقى ستيريو عالية الدقة والتقييمات",
    "originLink": "https://stability-ai.github.io/stable-audio-demo/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39354138",
    "commentBody": "",
    "originSummary": [
      "قد لا يعمل موقع الويب \"التوضيحي الصوتي المستقر\" بشكل صحيح على Safari ، وينصح باستخدام Google Chrome للحصول على الأداء الأمثل.",
      "يقدم موقع الويب رمزا وأدوات تتعلق بالصوت المستقر ، وهو نموذج يمكنه إنتاج موسيقى استريو متغيرة الطول وطويلة الشكل بمعدل أخذ عينات 44.1 كيلو هرتز.",
      "يمكن للمستخدمين استكشاف أمثلة على موسيقى الاستريو التي تم إنشاؤها ومطالبات المؤثرات الصوتية على موقع الويب ، إلى جانب المقارنات مع الطرز المتطورة الأخرى. بالإضافة إلى ذلك ، يتم توفير تقييم لقدرات دقة الصوت في برنامج التشفير التلقائي من خلال عمليات إعادة البناء."
    ],
    "commentSummary": [
      "يغطي موضوع المناقشة موضوعات مثل فرض ضرائب على الإيرادات من الذكاء الاصطناعي التوليدية للفنون ، ومخاوف حقوق النشر في مشروع Stable Audio ، وتأثير رسوم الترخيص على التعلم الآلي مفتوح المصدر.",
      "وتناقش أيضا قوانين حق المؤلف والآثار الأخلاقية فيما يتعلق ببيانات التدريب الذكاء الاصطناعي.",
      "هناك مناقشات حول المتصفحات البديلة ، والموسيقى التي تم إنشاؤها الذكاء الاصطناعي ، والقيود والتحسينات المحتملة في توليد الموسيقى الذكاء الاصطناعي ، والملاحظات على نموذج الموسيقى Suno.ai."
    ],
    "points": 302,
    "commentCount": 100,
    "retryCount": 0,
    "time": 1707796252
  },
  {
    "id": 39353325,
    "title": "نفيديا تتفوق على أمازون وجوجل ، وتصبح شركة التكنولوجيا الأكثر قيمة",
    "originLink": "https://www.forbes.com/sites/dereksaul/2024/02/12/nvidia-is-now-more-valuable-than-amazon-and-google/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39353325",
    "commentBody": "",
    "originSummary": [
      "تفوقت Nvidia على Amazon و Alphabet في القيمة السوقية ، وذلك بفضل مكانتها القوية في سوق الذكاء الاصطناعي ونتائجها المالية المثيرة للإعجاب.",
      "نما سهم Nvidia بأكثر من 17000٪ في العقد الماضي ، مما يجعله أفضل الأسهم أداء على مؤشر S&P 500.",
      "يتوقع المحللون المزيد من الاحتمالات الصعودية لسهم Nvidia ، حيث من المتوقع أن تعلن الشركة عن الربع الثالث على التوالي من المبيعات والأرباح القياسية."
    ],
    "commentSummary": [
      "تعد هيمنة Nvidia في سوق GPU موضوعا رئيسيا للمناقشة ، مما يثير مخاوف بشأن الممارسات الاحتكارية.",
      "تدور مناقشات مختلفة حول أهمية المنافسة وإمكانية حدوث انتهاكات لمكافحة الاحتكار.",
      "دور المطورين ، وربحية مبيعات GPU ، والتحديات التي تواجهها الشركات المنافسة مثل AMD هي أيضا جزء من المحادثة."
    ],
    "points": 287,
    "commentCount": 288,
    "retryCount": 0,
    "time": 1707788916
  },
  {
    "id": 39343919,
    "title": "يتيح حل macOS البديل المزيد من أيقونات التطبيقات دون الاختباء تحت درجة MacBook Pro",
    "originLink": "https://flaky.build/built-in-workaround-for-applications-hiding-under-the-macbook-pro-notch",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39343919",
    "commentBody": "",
    "originSummary": [
      "يتيح الحل البديل المدمج في macOS للمستخدمين ضبط إعدادات المسافة البيضاء في شريط القائمة لعرض المزيد من أيقونات التطبيقات ومنع إخفائها تحت الشق في طرازات MacBook Pro الجديدة.",
      "باستخدام Terminal.app وتنفيذ أوامر محددة ، يمكن للمستخدمين تعديل الحشو والتباعد في شريط القوائم. أثبتت القيمة 6 فعاليتها في استيعاب المزيد من الرموز.",
      "من المهم ملاحظة أن إضافة المزيد من التطبيقات باستمرار إلى شريط القائمة ستظل تسبب نفس المشكلة ، ويمكن للمستخدمين العودة إلى الإعدادات الأصلية إذا رغبت في ذلك."
    ],
    "commentSummary": [
      "يعد وجود النوتش على أجهزة الكمبيوتر المحمولة MacBook Pro موضوعا للنقاش والنقاش في مجتمع التكنولوجيا.",
      "يكره بعض المستخدمين حجم الشق ويقترحون مواضع بديلة لكاميرا الويب ، بينما يرى البعض الآخر أنها مساحة عرض إضافية.",
      "هناك مناقشات حول التطبيق العملي وحلول التصميم للشق ، بالإضافة إلى مناقشات حول الحلول المستقبلية المحتملة مثل تقنية كاميرا الويب تحت الشاشة. يقدر بعض المستخدمين الشاشة الأكبر التي تسمح بها ، بينما ينتقد آخرون شركة Apple لبيعها تصميما معيبا والحاجة إلى حلول من جهات خارجية."
    ],
    "points": 241,
    "commentCount": 213,
    "retryCount": 0,
    "time": 1707739541
  },
  {
    "id": 39351023,
    "title": "يزيل Amazon Prime Video دعم Dolby Vision و Atmos من طبقة الإعلان دون إشعار",
    "originLink": "https://arstechnica.com/gadgets/2024/02/prime-video-cuts-dolby-vision-atmos-support-from-ad-tier-and-didnt-tell-subs/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39351023",
    "commentBody": "",
    "originSummary": [
      "أزالت Amazon Prime Video بهدوء دعم Dolby Vision و Dolby Atmos من مستواها المدعوم بالإعلانات ، مما ترك المشتركين غير مدركين للتغيير.",
      "يقتصر المستخدمون الذين يختارون الطبقة المدعومة بالإعلانات الآن على HDR10+ و Dolby Digital 5.1 ، مما قد يؤدي إلى تقليل رسوم الترخيص المدفوعة إلى Dolby Laboratories والترويج ل HDR10 + كبديل بدون تكلفة.",
      "ليست هذه هي المرة الأولى التي تجري فيها أمازون تغييرات على ميزات Dolby الخاصة بها ، مما يزيد من إحباط العملاء الذين يشعرون أن التحول نحو خدمات البث يشبه تلفزيون الكابل التقليدي. لم تقدم أمازون سببا للإزالة."
    ],
    "commentSummary": [
      "هناك مناقشات ومناقشات مستمرة حول مواضيع مختلفة تتعلق ب Amazon Prime Video وخدمات Amazon.",
      "تشمل الموضوعات إزالة دعم Dolby Vision و Atmos ، وإضافة الإعلانات على خدمة البث ، ورضا العملاء ، واستراتيجيات تجزئة السوق ، ومكبرات الصوت ، وخدمات التوصيل ، وإلغاء اشتراكات Prime ، والراديو عبر الأقمار الصناعية ، وربحية Amazon Prime Video ، والمحتوى الأصلي ، وعرض المحتوى ، والطبيعة السياسية للبرامج التلفزيونية.",
      "تختلف الآراء بين المستخدمين ، حيث يعبر البعض عن رضاهم والبعض الآخر عن عدم رضاهم عن جوانب مختلفة من خدمات أمازون."
    ],
    "points": 199,
    "commentCount": 147,
    "retryCount": 0,
    "time": 1707774704
  },
  {
    "id": 39345618,
    "title": "الدافع الحقيقي وراء فيزياء الكم لماكس بلانك: فضح أسطورة الأشعة فوق البنفسجية",
    "originLink": "http://www.arxiv.org/abs/2402.03405",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39345618",
    "commentBody": "",
    "originSummary": [
      "تفضح هذه الورقة أسطورة شائعة في فيزياء الكم حول دافع ماكس بلانك لإدخال فيزياء الكم.",
      "يجادل المؤلفون بأن القصة الشائعة لكارثة الأشعة فوق البنفسجية غير صحيحة وأن بلانك كان يركز في الواقع على اشتقاق قانون إشعاع الجسم الأسود.",
      "استخدم بلانك الميكانيكا الإحصائية لحساب إنتروبيا المذبذبات الذرية ، مما يسلط الضوء على الحاجة إلى تقديم التطور التاريخي الحقيقي لفيزياء الكم."
    ],
    "commentSummary": [
      "تغطي المناقشة مواضيع مختلفة في فيزياء الكم ، بما في ذلك كارثة الأشعة فوق البنفسجية واكتشاف ماكس بلانك لتكميم الطاقة.",
      "يناقش المشاركون دقة المعلومات في الكتب المدرسية ومقاطع الفيديو على YouTube ، بالإضافة إلى تحديات تدريس المعادلات التفاضلية وفهم المناقشات العلمية التاريخية.",
      "تسلط المحادثة الضوء على الحاجة إلى نهج دقيق لتدريس العلوم وتؤكد على قيمة دراسة تاريخ العلوم كموضوع متميز."
    ],
    "points": 198,
    "commentCount": 86,
    "retryCount": 0,
    "time": 1707750662
  },
  {
    "id": 39349992,
    "title": "الشبكات العصبية تكشف النقاب عن فركتلات جميلة في عملية التدريب",
    "originLink": "https://sohl-dickstein.github.io/2024/02/12/fractal.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39349992",
    "commentBody": "",
    "originSummary": [
      "يكتشف المؤلف وجود صلة بين الفركتلات وتدريب الشبكة العصبية ، ويكشف أن الحدود بين التدريب الناجح وغير الناجح تظهر بنية كسورية.",
      "يؤثر ضبط المعلمات الفائقة، مثل معدل التعلم، على عملية التدريب، حيث توجد المعلمات الفائقة الأفضل أداء عادة بالقرب من حدود التقارب والاختلاف.",
      "تظهر أنماط كسورية عند تكبير تكوينات تدريب محددة ، بسبب التكرار المتكرر للوظائف وحدوث حدود التشعب. تختلف الفركتلات الناتجة عن الشبكة العصبية عن تلك التي تنتجها كثيرات الحدود منخفضة الترتيب من حيث أنها تبدو أكثر عضوية وتفتقر إلى التماثلات الواضحة."
    ],
    "commentSummary": [
      "يمكن أن ينتج تدريب الشبكة العصبية فركتلات جذابة بصريا ، لكن هذه النتائج لا تعكس بدقة التعلم العميق في العالم الحقيقي بسبب استخدام معدلات تعلم عالية للغاية.",
      "تبحث دراسة في الحدود بين التدريب المستقر والمتباعد في الشبكات العصبية عند توليد الفركتلات ، لكن آثارها العملية محدودة.",
      "تؤكد المقالة على الحاجة إلى الاختيار الدقيق لمعدلات التعلم وتتساءل عن فعالية مناهج التعلم التلوي. بالإضافة إلى ذلك ، فإنه يسلط الضوء على أهمية اختيار أحجام الخطوات المناسبة لتحديثات الوزن أثناء عملية توليد الفركتلات باستخدام الشبكات العصبية.",
      "تتعمق المحادثة أيضا في موضوعات مثل السلوك الفوضوي ، والأنماط الكسورية في نماذج الشبكات الرياضية والعصبية ، والشبكات العصبية الضوئية ، وإمكانات العناصر غير الخطية.",
      "بشكل عام ، تسلط المقالة الضوء على متعة استكشاف تدريب الشبكة العصبية وتؤكد على أهمية تحسين المعلمات الفائقة."
    ],
    "points": 193,
    "commentCount": 38,
    "retryCount": 0,
    "time": 1707769547
  },
  {
    "id": 39349389,
    "title": "تطلب لجنة الاتصالات الفيدرالية من شركات الاتصالات الكشف عن انتهاكات المعلومات الشخصية",
    "originLink": "https://www.theregister.com/2024/02/12/fcc_gets_tough_on_telcos/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39349389",
    "commentBody": "",
    "originSummary": [
      "أدخلت لجنة الاتصالات الفيدرالية (FCC) متطلبات إبلاغ جديدة لشركات الاتصالات في الولايات المتحدة ، مما منحها مهلة سبعة أيام للإبلاغ عن الانتهاكات الأمنية إلى لجنة الاتصالات الفيدرالية ومكتب التحقيقات الفيدرالي / الخدمة السرية الأمريكية.",
      "لن تضطر شركات الاتصالات بعد الآن إلى الانتظار سبعة أيام لإخطار المستهلكين بالانتهاكات وسيطلب منها الآن الإبلاغ عن مجموعة واسعة من تسرب البيانات.",
      "ستدخل القواعد المحدثة ، والتي تتضمن \"الوصول غير المقصود إلى معلومات العملاء أو استخدامها أو الكشف عنها\" ، حيز التنفيذ في 13 مارس."
    ],
    "commentSummary": [
      "أدخلت لجنة الاتصالات الفيدرالية (FCC) لوائح جديدة تلزم شركات الاتصالات بإخطار العملاء عند تعرض معلوماتهم الشخصية للخطر.",
      "يجادل النقاد بأن هذه القواعد غير كافية في معالجة القضية الأكبر المتمثلة في خروقات البيانات وتفشل في تحميل الشركات المسؤولية عن عدم كفاية حماية بيانات العملاء.",
      "يتكهن البعض بأن تصرفات لجنة الاتصالات الفيدرالية قد تكون بسبب عدم الكفاءة أو التأثير غير المبرر من الصناعة الخاصة."
    ],
    "points": 193,
    "commentCount": 29,
    "retryCount": 0,
    "time": 1707767058
  },
  {
    "id": 39351195,
    "title": "الفيلسوف دانيال سي دينيت حول قيمة التعاون والتشكيك في المعتقدات",
    "originLink": "https://behavioralscientist.org/ive-been-thinking-daniel-dennett-what-if-im-wrong/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39351195",
    "commentBody": "",
    "originSummary": [
      "يؤمن الفيلسوف دانيال سي دينيت بالسعي للحصول على مدخلات من الآخرين لفهم المفاهيم المعقدة ، بالاعتماد على زملاء موثوق بهم لشرح المقالات أو الكتب الصعبة.",
      "إنه يشرك الطلاب في عملية تحرير كتبه ، ويقدر ملاحظاتهم النقدية ويشجع المخاطرة في البحث والكتابة.",
      "يسلط دينيت الضوء على فوائد استكشاف وجهات نظر بديلة ، باستخدام مثال منشأة أبحاث معهد ديسكفري لدحض التطور. ويشدد على أهمية التواضع والتشكيك في معتقدات المرء والتعاون في المساعي الفكرية."
    ],
    "commentSummary": [
      "تغطي المحادثة مجموعة متنوعة من الموضوعات مثل الحجة عن طريق القياس ، ودور المنطق الرسمي والعواطف في تشكيل وجهات النظر العالمية ، وتحديات تغيير الآراء.",
      "كما يستكشف نقص المعلومات الواقعية في المناقشات العامة ، واستخدام كلمات ابن والمصادر المجهولة ، ومفهوم \"أفضل الممارسات\" في حل المشكلات.",
      "يناقش المشاركون معنى \"ليس حتى خطأ\" ، وصعوبة فهم أنظمة المعتقدات المختلفة ، وحتى التطرق إلى وجود الله. تؤكد المحادثة على تعقيدات وتعقيد هذه الموضوعات."
    ],
    "points": 190,
    "commentCount": 162,
    "retryCount": 0,
    "time": 1707775600
  },
  {
    "id": 39349366,
    "title": "توقف تشريع سلامة السكك الحديدية الأمريكي بعد عام من كارثة شرق فلسطين في أوهايو",
    "originLink": "https://www.wlbt.com/2024/02/02/rail-safety-legislation-still-stalled-one-year-after-east-palestine-disaster/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39349366",
    "commentBody": "",
    "originSummary": [
      "توقف التشريع المقترح الذي يهدف إلى تحسين سلامة السكك الحديدية ومحاسبة شركات السكك الحديدية في ولاية أوهايو بسبب معارضة صناعة السكك الحديدية.",
      "تلقي عضوة الكونجرس مارسي كابتور والسيناتور شيرود براون باللوم على صناعة السكك الحديدية لإعطاء الأولوية للأرباح على السلامة العامة.",
      "لا تزال قضايا مثل تفويضات توظيف الطاقم ومتطلبات التفتيش والمعابر المحظورة دون حل ، مما دفع كابتور إلى دعوة الرئيس بايدن ووزير النقل بيت بوتيجيج لمعالجة مشاكل السكك الحديدية المنهجية وتخصيص تمويل البنية التحتية لتحسين سلامة السكك الحديدية."
    ],
    "commentSummary": [
      "تغطي المناقشات مجموعة من الموضوعات بما في ذلك تشريعات سلامة السكك الحديدية ، والقضايا السياسية ، والبنية التحتية للنقل ، وتأثير الشركات في صناعة السكك الحديدية.",
      "هناك جدل حول فعالية التنظيم في تحسين سلامة السكك الحديدية ودور النقابات والملكية الحكومية في الصناعة.",
      "كما تم ذكر المخاوف بشأن تأثير الشركات في الانتخابات والفساد المحتمل في العملية التشريعية."
    ],
    "points": 169,
    "commentCount": 97,
    "retryCount": 0,
    "time": 1707766983
  },
  {
    "id": 39344786,
    "title": "موثوقية وهتافات Zigbee و Z-Wave في منزلي الذكي",
    "originLink": "https://arstechnica.com/gadgets/2024/02/i-was-wrong-to-ignore-zigbee-and-z-wave-theyre-the-best-part-of-my-smart-home/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39344786",
    "commentBody": "",
    "originSummary": [
      "يعترف المؤلف بخطئهم في تجاهل تقنية Zigbee و Z-Wave في إعداد المنزل الذكي ويثني على موثوقيتهم مقارنة بالمعايير الأخرى.",
      "يسلطون الضوء على مصابيح Philips Hue كمثال على جهاز يعمل باستمرار وسلاسة على شبكته الخاصة.",
      "يشارك المؤلف أيضا تجربة إيجابية في مراجعة مركز Homey Pro ، والذي يستخدم تقنية Zigbee و Z-Wave."
    ],
    "commentSummary": [
      "تدور المناقشة حول إيجابيات وسلبيات استخدام Zigbee و Z-Wave و WiFi و Thread و Matter للأجهزة المنزلية الذكية.",
      "يشارك المستخدمون تجاربهم وآرائهم حول الموثوقية وقابلية التشغيل البيني والتوافق ومخاوف الخصوصية المرتبطة بالبروتوكولات والأجهزة المختلفة.",
      "كما تمت مناقشة عوامل مهمة مثل الشبكات المتداخلة وعمر البطارية والتحكم المحلي ، ولكن لا يوجد اتفاق بالإجماع بين المستخدمين حيث تختلف تفضيلاتهم وتجاربهم مع كل تقنية."
    ],
    "points": 162,
    "commentCount": 151,
    "retryCount": 0,
    "time": 1707746297
  }
]
