[
  {
    "id": 36478206,
    "timestamp": 1687777983,
    "title": "Google has a secret browser hidden inside the settings",
    "url": "https://matan-h.com/google-has-a-secret-browser-hidden-inside-the-settings/",
    "hn_url": "http://news.ycombinator.com/item?id=36478206",
    "content": "Google has a secret browser hidden inside the settingsPosted on June 26, 2023I recently discovered a secret browser located inside the “Manage my account” popup that Android has in various apps (quite important apps, such as Settings, and all Google suite apps). The browser even bypasses parental control!How to get there?Getting there…. takes some work:1. Go into Settings→Google (or any app that lets you choose your account) and click on “Manage my account”.2. Then go to the “Security” tab. In there, scroll down until you find “Password Manager”. Click on it.3. Click on the ‘Settings’ icon in the top-right.4. Scroll down until “Set up on-device encryption” appears. Click on it, then click on “Learn more about on-device encryption”.5. Now you are in the browser. But you want to go to Google.com! So click on the hamburger menu, then click “Privacy Policy”.6. Tap the nine dots at the top, wait 5 seconds (it takes some time to load) and click “Search” (If you don’t find the search icon, you can also scroll down until ‘Google’ and click on that)7. Logout from your Google account.8. You got the secret browser ! You can go anywhere. You can also play YouTube videos (with ads, unfortunately), and all of this is in the settings app (or whatever app you choose) !LiveOverflow in Settings appBrowser overview:Pros: It’s a pretty private browser : it has no history and it auto logs out of all Google accounts that were logged-in, at the end of the session.Cons: the most obvious one is the back key, which means every time you press the back key, instead of going back one address in the history, it goes back into the password manage settings, but I guess it could be considered an advantage – as an emergency key for privacy.The same goes for no address bar. (But look at the glass half full: it still doesn’t advertise itself on the installation page of other browsers).But there are another things that prevent this browser from being a secure browser: The dangerous functions.The dangerous functions:As I was using this browser, I discovered a strange thing. A weird JavaScript object named mm. To see this, go to eruda, (just because it’s the best mobile JavaScript console I know) and type mmScreenshot of eruda expend the mm objectAs you see, there are three functions:Let’s start with closeView() function, because it’s the only clear function: it just closes your browser, as would happen if you press the back key. Not a standard JavaScript function, but nothing to worry about. (you can try it right there by typing into eruda ‘mm.closeView()‘)Then you have two methods which I don’t know what they do, but they sound scary. As this is a secret-browser of the ‘on-device encryption’ feature, I can guess, they are both used to set your local encryption keys. So it looks like a malicious website can put their keys there, and try to make you pay for them!I think this is the time to tell you that I already reported this to Google, and they say this is not a security vulnerability (probably because this secret browser is not very popular), and that the parental control bypass is the “Intended Behavior” 🙂Google’s answer to my reportIf you enjoy using it, please let me know in the comments what you did with it.Hope you enjoy your (new?) browser that you didn’t know you had !There is a cool Hacker News discussion on this article.",
    "summary": "- A secret browser has been discovered hidden inside the settings of Android apps, including Google suite apps.\n- The browser has a private browsing mode with no history and automatically logs out of Google accounts at the end of each session.\n- The browser has some potential security vulnerabilities, including the ability for malicious websites to manipulate local encryption keys.",
    "hn_title": "Google has a secret browser hidden inside the settings",
    "original_title": "Google has a secret browser hidden inside the settings",
    "score": 849,
    "hn_content": "- Google has a hidden browser within its settings app, which is accessed via an embedded activity in Google Play Services.\n- The browser is not the default system webview and appears to be using a custom implementation.\n- Android allows for a JS interface between Android code and Javascript code, which is being used extensively in Google Play Services.\n- The browser has privileged functions for password manager key management and recovery.\n- There are concerns about the security implications of allowing arbitrary browsing with the embedded webviews, as it could bypass parental controls and potentially lead to exploitation.\n- The browser uses WebKit, not Blink as originally speculated.\n- This discovery is not entirely new, as many apps have embedded webviews for various purposes.\n- It is unclear why Google chose to implement a custom browser instead of using the system default webview.\n- The discussion also touches on other topics, such as Google's approach to security and user privacy, as well as personal anecdotes related to bypassing controls in the past.- Kids using bypass methods to circumvent restrictions on devices is common, but only a small percentage actually understand how the bypass works.\n- There is a concern that these bypasses can be used to access restricted content in high-stakes test settings and other secure environments.\n- The embedded browser in some devices is not secure, which could potentially lead to security vulnerabilities and compromised machines.\n- Parents and schools use parental controls to limit screen time and promote healthy device usage, but these controls may not be foolproof.\n- Some individuals believe that parental controls should be placed on networks, rather than devices.\n- Google's approach to security and control measures has been criticized by some for being ineffective.\n- It is argued that kids should have more control over their devices to foster independence and responsibility.\n- The issue of kids bypassing restrictions on devices is seen as a parenting issue rather than a software issue.\n- The potential misuse of bypass methods by kids is seen as a minor concern compared to other security risks.\n- There is a nostalgic sentiment among some commenters who recall their own experiences hacking or bypassing restrictions in the past.\n- Some commenters express frustration with Google's security practices and perceived lack of accountability.\n- The use of bypass methods is not limited to kids, and adults also find ways to circumvent restrictions.\n- Different individuals have varying opinions on the effectiveness of parental controls and the impact of device usage on children's mental health.\n- The discussion highlights the ongoing debate around the balance between device restrictions and personal freedom and responsibility.",
    "hn_summary": "- Google has a hidden browser within its settings app, accessed through an embedded activity in Google Play Services, raising concerns about security implications and potential exploitation.\n- The browser uses WebKit and has privileged functions for password manager key management and recovery, but the reason for implementing a custom browser instead of using the system default webview is unclear.\n- The discussion also touches on Google's approach to security, user privacy, the effectiveness of parental controls, and the balance between device restrictions and personal freedom and responsibility."
  },
  {
    "id": 36485597,
    "timestamp": 1687812347,
    "title": "Discovering that a Bluetooth car battery monitor is siphoning location data",
    "url": "https://doubleagent.net/2023/05/21/a-car-battery-monitor-tracking-your-location",
    "hn_url": "http://news.ycombinator.com/item?id=36485597",
    "content": "Part 1 - Discovering that your Bluetooth car battery monitor is siphoning up your location data12 minute readOn this pageTLDRProduct informationData privacyLocation and Android permissionsThe hardwareThe test setupDynamic analysisIntercepting network trafficMemory analysisStatic analysisDecompilationHello Hacker News, thanks for visiting!Follow @haxrob on Twitter for further developments in this series.TLDRA Bluetooth enabled battery monitor that records car battery voltages. The hardware requires a smartphone for pairingThe product collects GPS co-ordinates, cell phone tower data and nearby Wifi beaconsLocation data is sent over the Internet to servers in Hong Kong and mainland ChinaApp store misleads consumers by stating that no personal data is collected or shared. Since the Android app requires location permissions to use the hardware device, users are effectively forced to continuously broadcast their physical location to 3rd parties in order to use the product.There are no legitimate reason for a car battery monitor application to track it’s user’s location. With over 100,000 downloads on Android alone, this raises significant privacy concernsIn this three part series:Part 1 - This pagePart 2 - Reverse engineering the AMap SDK location tracking featuresPart 3 - Reimplementing BLE functionality and obtaining the firmwareWithin this series of posts, we explore the discovery of an Bluetooth enabled battery voltage product, acquired from a popular electronics retailer in Australia. What started as an initial hunch lead me down rabbit a rabbit hole to discover that the app covertly tracks the users physical location. It collects GPS co-ordinates, neighbouring cell phone tower location data and Wifi access points, sending this data to cloud servers in Hong Kong and mainland China.At the time of writing, location data is sent to servers related to two seperate corporate entities:The product / app developer, Leagend, hosted in Alibaba Cloud, Hong Kongbm2.quicklynks.com / 47.244.125.231The location services SDK developer, AMap, hosted in Alibaba Cloud, Beijingdualstack-cgicol.amap.com / 106.11.130.194Partly responsible for the extensive data collection is an embedded library used, called AMap, which is a “leading provider of digital map in China”.Acquired by Alibaba, it is stated that “In 2018, Amap became the first Chinese maps service to navigate a path to 100 million daily users”. In part 2 we look under the hood at how AMap is not only collecting the GPS co-ordinates, but also every other possible location data the phone can collect - surveying Wifi and telecommunication cell phone tower data.The Android application which connects to the battery monitor device, BM2 100K+ downloads, with 1.55K reviews.The iPhone iOS version can be found here. While I have not peformed any static analysis on the iOS decompilations to date, inspection of the network traffic from the phone reveals that that the Apple iPhone version is also sending location data to remote servers.Feel free to reach out to me on twitter for partially reverse engineered decompilation of the sources referenced. The subsequent posts should provide enough detail for others to independently verify what is being reported.A wireshark trace of mobile trafficProduct informationI acquired the vehicle battery monitoring Bluetooth device sold under the brand PowerTech from a popular Australian electronics retailer, Jaycar Electronics.This appears to be a re-branded Bluetooth 4.0 Battery Monitor by a company called Leagend which is available on Amazon for purchase.It’s resold under local brands, for example another popular auto retailer, Repco, sells it under the Century brand.Other device names are “ZX-1689” and “Li Battery Monitor” which the application looks for in the device name of the advertising BLE beacon which are indentified in part3.The device is quite simple - you connect it to the terminals of a battery and pair it with your phone. It shows the battery voltage/percentage and allows you to run some crank tests. That’s what’s advertised.Jaycar (Powertech) and Repco (Century) branded BM devicesAdditionally, the required application runs in the background, effectively turning a smart phone into location scanning device. Having your phone become a continuous Wifi scanner drains the battery - and this isn’t something legitimate application developers want. People do complain about issues caused. Patrick’s review of the BM2 app would agree:While we can’t explain the legitimate reason a battery voltage monitor would need to know your GPS location, a charitable explanation of the AMap SDK collecting GPS, Wifi and cell tower data is they are attempting to do what Google and Apple already do - build a relational database, mapping phone cell towers and wifi access points to GPS co-ordinates. When a phone has bad GPS signal, knowing the adjacent Wifi access points or phone towers within reception can help increase accuracy.Some terminologyAMap collects the telecomunication provider’s adjacent cell phone tower location data - Specifically the cell global identity. This is an ID that uniquely identifies a cell, unique across the whole world.The CGI is made up of:MCC = Mobile Country CodeMNC = Mobile Network CodeThe MCC + MNC make up the PLMN (Public Land Mobile Network) - Identifies the mobile operator (e.g. Telstra, Australia)LAC = Location Area Code. Set of base stations grouped together in a geographical regionCI = Cell ID. Identifies base station transceiver within a region. Think of this as an ‘antenna’ that your phone is talking toIn 4G, technically TAC (tracking area code) is used.Wifi data collection includes:BSSID MAC address of Wifi access points.SSID - Access point nameThe AMap developers go to lengths to conceal the behaviour, encrypting any data before it touches disk or sent over the Internet. Location data is encrypted with ephemeral AES keys which is then encrypted with a public RSA key. This removes the dependency for certificate pinning and ensures man-in-the-middle inspection of the network traffic is not possible without modifications to the application or obtaining the corresponding private RSA key.Data privacyNote: As of 27th of June 2023, the BM2 app developer have updated the privacy statements on both the Google Play and Apple App stores - now mentioning that precise location data is being collected.The following is stated on the BM2 app Android Play store:One by one, let’s review the statements claimed:1. No data shared with third partiesIn addition to your battery statistics (e.g. voltage), the latitude and longitude co-ordinates of your location is sent to the BM2 application cloud servers, quicklynks.comCrash analytics are sent to a 3rd party Chinese company, umeng.comWifi, cell phone tower and GPS co-ordinates are sent to a Chinese company, AMap2. No data collectedSelf explanatory3. Data is encrypted in transitData sent to the BM2 cloud servers is unencryptedHow about on the Apple store? take a lookThe privacy policy fine print does mention “Hong Kong” and “location information”. We all read the fine print right?Location and Android permissionsFor the application to work, you must give the Android application permissions that let it obtain location information otherwise it won’t work: For Bluetooth scanning, Android requires this permission. At least with the iOS version, you can hit “deny” when it asks for location permissions and the battery monitor device will still work.To expand on the reason cited, it’s best explained from Android’s developer documentation:To provide users with greater data protection, starting in this release, Android removes programmatic access to the device’s local hardware identifier for apps using the Wi-Fi and Bluetooth APIs. To access the hardware identifiers of nearby external devices via Bluetooth and Wi-Fi scans, your app must now have the [ACCESS_FINE_LOCATION] or [ACCESS_COARSE_LOCATION] permissions.I would argue that such a broad permission that covers both Bluetooth, GPS and Cell data offers lower data protections - as it opens up app developers to abuse this permission as we see with the BM2 application that really just requires BLE scanning. BLE scanning can be achieved with just BLUETOOTH_SCAN, available on Android 12+.Update 2023-06-27 Google provide further guidance here. It is possible to specify ACCESS_FINE_LOCATION with android:usesPermissionFlags set to neverForLocation. This is only for when Bluetooth scan results are used to derive physical location. That does not seem to be the case here though.The hardwareOur interest lies mostly in the phone applications that interface with the hardware, although it’s customary to at least take a peek inside and explore what the possibilities are for pulling off the firmware.Not much too it; some voltage regulators and a single SoC - a Texas Instruments CC2541) all in one Bluetooth Low Energy MCU. Datasheet here. Some possible debug ports are spotted:Click to enlargeThe CPU is based on an 8 bit Intel 8051. Later revisions of the CC series use ARM cortex architecture.According to the specifications, the CC series SoCs support on chip debugging via a proprietary interface - No JTAG or SWD to be seen here. This means we will need the CC Debugger or try some custom Arduino implementation, although this specific IC is not supported. As the device supports over-the-air updates, there is a REST endpoint which will return the firmware over HTTP, documented in part 3It appears there is no shunt or other current sensing circuity. Hardware wise, this really is as simple as it gets.The test setupFor testing I’m using a small led acid 12v battery with the BM2 battery monitor and a rooted Android handset which will be used for dynamic instrumentation.Notably, the setup sat on my desk. As we discover in part 2 of this blog post series, the AMap location data is only written to it’s database from memory when it detects you are physically moving. To overcome this and other hurdles, Frida and Objection used extensively to instrument the running software in run time.Dynamic analysisIntercepting network trafficMitmproxy is a defacto “in the middle” proxy software and it now supports a new mode using wireguard. What this means is it’s extremely trivial (and quick) to peek inside mobile application traffic with minimal configuration. Once the Wireguard application is installed on the handset, simply mitmweb --mode=wireguard and take a scan the QR code on screen by taking an image from the handset. Immediately all traffic from the handset will be sent over a Wireguard tunnel to mitmproxy. Browsing to http://mitm.it then allows you to download a certificate to add to the trust store. With iOS the process is trivial. Android has now made it harder to do, and in this case I had to use a rooted handset.Note: Since the BM2 does not use HTTPS, there is no need to even install a certificate. What this means is that anyone can independently identify that their latitude and longitude co-ordinates are being sent on either iOS or Android with no modifications to their phone.After the application connects to the battery monitor device, we see a POST request is sent to http://bm2.quicklynks.com:8080/api/bm2/userDevice/upload?.Latitude and longitude fields are highlighted in green.At the time of writing, this server resolves to a host in Alibaba cloud, HK:$ host bm2.quicklynks.combm2.quicklynks.com has address 47.244.125.231$ curl https://ipinfo.io/47.244.125.231{ \"ip\": \"47.244.125.231\", \"city\": \"Sham Shui Po\", \"region\": \"Sham Shui Po\", \"country\": \"HK\", \"loc\": \"22.3302,114.1595\", \"org\": \"AS45102 Alibaba (US) Technology Co., Ltd.\", \"timezone\": \"Asia/Hong_Kong\",}In this specific request we also see a sample of the battery voltages, the hardware MAC address of the device (nickname and serialNo).Spoofing GPS co-ordinatesGPS co-ordinates can be spoofed by using the following Frida to dynamically hook into android.location.Location.{getLatitude|getLongitude} methods. Frida will be used extensively in our testing. More on this later.location.jsconst lat = 39.1090;const lng = -76.7700;Java.perform(function () {  var hookedClass = \"android.location.Location\" var Location = Java.use(hookedClass); Location.getLatitude.implementation = function() {   console.log(\"[+] \" + hookedClass + \"new lat:\" + lat); return lat; } Location.getLongitude.implementation = function() {   console.log(\"[+] \" + hookedClass + \"new lng:\" + lng); return lng; }})To invoke: $ frida -U -l location.js -f com.dc.battery.monitor2Memory analysisAs stated earlier, GPS, Wifi and cell data is gathered by the embedded AMap library. The code is obsfucated to make reverse engineering more time consuming. Anything that touches disk or the network is encrypted serialized binary blobs. This calls for some quick wins with dynamic instrumentation as the code runs on a handset while paired to the hardware battery monitor.For example, we can peek inside the application’s heap memory. For this we will use a plugin for Objection called Wallbreaker. After some quick analysis of the AMap library we know what class names to find instances in memory (click pictures to expand):GPS data:Telecommuncation provider cell data:Wifi data (toString() enumerated):Static analysisDecompilationFirst let’s grab the APK straight off the handset. We could of course get a copy from APK pure too from hereFirst identify the application name identifier which is com.dc.battery.monitor2:Obtain the path of the APK and pull it from the device with adb shell pm path then pull it off the phone.JADX is our choice for the de-compiler, and it’s just great. Opening the .apk and it handles everything in one shot, from decompression to de-compiling the java bytecode into Java.The very first thing is to check the permissions in AndroidManifest.xml after opening the APK in APK in jadx-guiThe hightlights in green raises a few questions. We have explained why FINE_LOCATION is required, but why would a battery monitor application needs CAMERA, IMAGE_CAPTURE, ACTION_VIDEO_CAPTURE, MODIFY_AUDIO_SETTINGS and RECORD_AUDIO ?At this point it’s possible that this functionality is unused. More investigation is needed here.Very quickly we see that the decompilation of the java bytecode directly from the APK is going to be problematic. The entrypoint is com.stub.StubApp which has methods names obsfucated with xor encryption which indicates there is more work to do.<application android:theme=\"@style/AppTheme\" android:label=\"@string/apk_release_name\" android:icon=\"@mipmap/ic_launcher\" android:name=\"com.stub.StubApp\"Fortunantly it’s obvious that a commercial software packer called qihoo.util has been used. Zimperium has a good writeup on this packer as it’s often found employeed in Chinese based mobile malware. It’s somewhat advanced in the sense that the unpacked software is encrypted and packed into native, compiled library. People have written unpacking tools that claim to handle this packer such as android-unpacker. Given that developers often update and change their packing techniques, the unpacker tools in the public domain can quickly become outdated.As such we will take much easier approach - by using frida-dexdump it’s possible to dump the original (unpacked) mobile application Dalvik executable bytecode from memory after opening the application on the handset.Qihoo 360 is not without their own contraversy, being “placed on the Bureau of Industry and Security’s Entity List due to U.S. national security concerns”.After installing dexdump (e.g. pip3 install frida-dexdump), run it after opening the application:frida-dexdump -U -f com.dc.battery.monitor2 -dUse dex2jar to covert classes.dex to java bytecode:./d2j-dex2jar.sh ./com.sec.android.app.samsungapps/classes.dexWe can the use jadx to then decompile into readable java and now have the original application code, method names, variable names for com.dc.battery.monitor2, as no further obfuscation was done outside of the initial packing/encrypting.The exception here is the amap location services SDK library which was originally obsfucated which will make our time a little harder to reverse these parts. Fortunately class names are recoverable for the AMap related classes by selecting tools -> deobsfucation in JADX.While the variable or method names are random(ish) strings, the recovered class names are descriptive enough that with some effort the function of the classes and methods is identified with method and variables renamed appropriately by hand.Next up, in part 2 we will investigate how the embedded AMap SDK is not only sending the GPS co-ordinates, but Wifi and telecommunication cell tower data.Updated: May 21, 2023PreviousNext",
    "summary": "- A Bluetooth car battery monitor, sold under various brands, is collecting and transmitting users' location data without their knowledge or consent.\n- The monitor records GPS coordinates, cell tower data, and nearby Wi-Fi beacons, sending this information to servers in Hong Kong and mainland China.\n- The app misleads users by stating that no personal data is collected or shared, raising significant privacy concerns.",
    "hn_title": "Discovering that a Bluetooth car battery monitor is siphoning location data",
    "original_title": "Discovering that a Bluetooth car battery monitor is siphoning location data",
    "score": 579,
    "hn_content": "- A Bluetooth car battery monitor app with over 100,000 downloads on the Google Play Store is found to be sending GPS, cell phone tower data, and Wi-Fi beacon data to servers in Hong Kong and mainland China.\n- The app developer originally claimed that no personal data is collected or sent to third parties, but has since updated their app store pages to disclose the collection of location data.\n- The issue of requiring location permission for Bluetooth scanning on Android is highlighted, as this can lead to potential misuse of location data by apps.\n- The disclosure of this behavior by the app developer may have been prompted by the author's research and blog posts, emphasizing the importance of holding companies accountable for their data collection practices.\n- The post raises concerns about the need for more granular app permissions, particularly for internet access, to protect user privacy and prevent unauthorized data collection.\n- This case highlights the broader issue of data privacy and the risks associated with using connected devices and apps that collect personal information.\n- The author provides tips on getting started with reverse engineering apps and encourages readers to be more aware of the data collection practices of the apps and devices they use.\n- The presence of undisclosed location tracking and data collection by apps underscores the need for increased regulation and user protection in the tech industry.- The GPS coordinates sent by a car battery monitor app are being deliberately sent to the app developer's servers.\n- The non-premium version of the app is also sending GPS data, contradicting claims made by the developer.\n- The app uses the AMap services to collect additional data such as cell data and Wi-Fi beacon data.\n- Permissions for apps should be more granular to ensure user privacy.\n- Apple allows users to deny location permissions while still using Bluetooth services, but this is not the case with Android.\n- The app in question does not use HTTPS, making it easy for anyone to identify the GPS data being sent.\n- Certificate pinning can prevent intercepting HTTPS traffic.\n- The issue with privacy is not limited to this app; many connected devices collect and share user data.\n- Open-source hardware, firmware, and software can be inspected for potential privacy issues.\n- Financial and criminal liability for data collection and privacy breaches should be established.\n- Data privacy regulations like GDPR aim to hold companies accountable for data collection practices.\n- Opting out of using connected devices or using offline-only devices can help protect privacy.\n- Cloning products that respect user privacy and data can provide alternatives for consumers.\n- Voting for candidates who prioritize privacy and regulation can promote change.\n- Intellectual property laws can contribute to privacy violations.\n- Being on the network does not justify unauthorized data collection.\n- Considerations for national security and potential breaches of sensitive data should be taken into account.\n- The lack of granular permissions and regulation contributes to privacy issues in the tech industry.\n- This post exposes the concerning data collection practices of a specific app and highlights the broader issue of privacy violations in consumer tech.",
    "hn_summary": "- A Bluetooth car battery monitor app with over 100,000 downloads is sending GPS, cell phone tower data, and Wi-Fi beacon data to servers in Hong Kong and mainland China.\n- The disclosure of this behavior raises concerns about the need for more granular app permissions and highlights the broader issue of data privacy and risks associated with connected devices.\n- The post emphasizes the importance of holding companies accountable for their data collection practices and provides tips on reverse engineering apps to be more aware of data collection practices."
  },
  {
    "id": 36480687,
    "timestamp": 1687792373,
    "title": "Show HN: Mofi – Content-aware fill for audio to change a song to any duration",
    "url": "https://mofi.loud.red/",
    "hn_url": "http://news.ycombinator.com/item?id=36480687",
    "content": "MofiNew AboutLeave feedbackWelcome to MofiContent-aware fill and trim for music! Free and no download needed.FeaturesPerfect length: Shorten and lengthen a song, making it the perfect length to match a video or performance. Keep the vibe of the song with seamless transitions and without cutting off the end too early!Remove seamlessly: Don't like part of a song? Choose parts to remove and have them filled seamlessly, it's basically content-aware fill for audio!On repeat: Make an extended version of your song's favorite part by choosing the catchy part and seamlessly repeating part of it!Get startedSelect a local file or paste a link to start editing. No file or just exploring? Check out this example!Drop, paste, or click to upload a file......or paste a link to a song online:ImportMake sure you have the applicable rights to any audio you submit to Mofi.FAQHow can I shorten a song without cutting it?Submit a song to Mofi and enter the new duration of the song. You can then choose from multiple results that match your requested length. This is helpful if you need to shorten a song to match a video you already edited.How can I make a song longer seamlessly?After you choose a song to edit on Mofi, you can type in the new length and export a new, longer version.How can I make a perfectly looping version of a song for TikTok?After you upload the song to Mofi, you can drag to select the part you want to loop. Click \"prefer\" in the menu and type in how long you want your edit to be and download it.How can I remove a part of a song without it sounding weird?You can use Mofi to remove a part of a song seamlessly! After adding it, select the part or parts that you don't like and the algorithm will remove them and try to keep the edit sound natural and without cuts.How do I shorten a song online for free?Mofi allows you to shorten (or lengthen!) any song to whatever length you want for free. You can use the website without installing or downloading another app or program.How can I remix a song without paying for Adobe Audition?You don't need to pay for Adobe Audition to remix a song. Use Mofi and change the length of a song for free online without downloading anything or creating an account.Legal© 2023 Florian",
    "summary": "- Mofi is a free online tool that allows you to change the length of a song without cutting off the end too early or making it sound weird.\n- You can use Mofi to shorten or lengthen a song to match a video or performance, create an extended version of a favorite part, or make a perfectly looping version for platforms like TikTok.\n- Mofi is convenient because it doesn't require any downloads or installations, and it can be used for free without needing to pay for software like Adobe Audition.",
    "hn_title": "Show HN: Mofi – Content-aware fill for audio to change a song to any duration",
    "original_title": "Show HN: Mofi – Content-aware fill for audio to change a song to any duration",
    "score": 535,
    "hn_content": "Hacker News new | past | comments | ask | show | jobs | submit loginShow HN: Mofi – Content-aware fill for audio to change a song to any duration (loud.red)535 points by jaflo 18 hours ago | hide | past | favorite | 143 commentsI worked on a web service that allows you to import a song and define a target length that the song will be shortened or lengthened to. It does this by analyzing the song and finding repeating audio patterns. This is helpful for making any song match a video or performance with a set duration. You can also specify areas of the song to prefer or avoid. An example is available here: https://mofi.loud.red/edit/8bd3fdf780f8c3927e41029f3b957f8a7...The cool thing is that after the song is analyzed on the server, the client can recompute and preview the results completely client-side through an implementation that uses Web Workers and WebAssembly. The audio previewing uses Tone.js. I am thinking of writing up some more details about the implementation in the future.I'm still working on a way to explain this easily, but I like the idea of carrying over the concept of content-aware fill from images to audio.Please let me know if you have any comments or questions!Philip-J-Fry 17 hours ago | next [–]There used to be something called the eternal jukebox I think. But you could give it a song and it would endlessly loop the audio like you have here. But it would also switch it up and change the parts it looped. And it would have a nice visualisation showing how the parts of the song connect and the different paths it takes.I think it was https://eternalbox.dev/ since that's all I can find on Google. But that site is down.replygffrd 17 hours ago | parent | next [–]Yes! It was \"Infinite Jukebox,\" created by Paul Lamere … it was awesome because it would analyse a track, then visualize its \"components\" and you could watch as the new \"infinite\" track looped back on itself and jumped from point-to-point in the original track to create an everlasting one.He created some excellent products from the Rdio API, and later Spotify … and I believe his analysis engine ended up being the foundation upon which Spotify's _play more tracks like these_ capability is based.Looks like he's moved over to publish on Substack—there's a recent(ish) post reflecting on 10 years of Infinite Jukebox: https://musicmachinery.substack.com/p/the-infinite-jukebox-1...replyrahimnathwani 10 hours ago | root | parent | next [–] However, that wasn’t the end of the Infinite Jukebox. An enterprising developer: Izzy Dahanela made her own hack on top of mine. To make it work without using uploaded content, she matches up the Echo Nest / Spotify music analysis with the corresponding song on YouTube. She hosts this at eternalbox.dev. It runs just as well as it ever did, 10 years later.replyrob74 1 hour ago | root | parent | next [–]unfortunately at some point between November 2022 and today it stopped doing that, currently eternalbox.dev returns a gateway timeout. The source is still available at https://github.com/UnderMybrella/EternalJukebox, and it sounds like you can get it to run locally relatively easily (?)replyrzzzt 17 hours ago | root | parent | prev | next [–]The Echo Nest had lots of cool toys: https://en.wikipedia.org/wiki/The_Echo_NestEdit: I remember a multitrack file format from the past that allowed following both a composer-defined path as well as random/infinite ordering of sequences, it was called digimpro: https://www.kvraudio.com/forum/viewtopic.php?t=102403replyjaflo 16 hours ago | root | parent | next [–]The Echo Nest was really cool... they got bought my Spotify and some of the Echo Nest APIs made it into Spotify I believe: https://developer.spotify.com/documentation/web-api/referenc...replygffrd 15 hours ago | root | parent | prev | next [–]Echo Nest! That's right.Did I over-attribute the above to Paul? I didn't realize he wasn't a founder.replyrzzzt 14 hours ago | root | parent | next [–]Probably not, in the 10 years retrospect post he writes that he built it :) In an Echo Nest company blog post he is referred to as \"The Echo Nest director of developer platform\". I have no first-hand information however.replyJoshTriplett 9 hours ago | root | parent | prev | next [–]Yeah, Infinite Jukebox works surprisingly well, and it's fun to manually tweak some of the probabilistic looping points to create something fun.replyjaflo 16 hours ago | parent | prev | next [–]This project actually builds on the same analysis techniques as the Infinite/Eternal Jukebox! I really liked it when the original was up. I think they also had a version just for Gangnam Style along with a matching infinite video!There is this version now, but it does not allow custom uploads anymore: https://eternalboxmirror.xyz/jukebox_index.htmlreplynpteljes 16 hours ago | parent | prev | next [–]It was Infinite Jukebox. The subreddit is still there: https://www.reddit.com/r/infinitejukebox/replyjosuepeq 17 hours ago | prev | next [–]This is neat, I have wondered if anything of this nature existed, in the past, as a child of the 80s/90s attempting to master the art of the perfect mixtape… 30 minutes a side down to the second the tape runs out, would be a win.But for today’s music, shortening the 2010s/2020 already shorter lengths would mean a song might not be more than a minute in length. On average, full unedited tracks today end up being a bit shorter than they used to be, solely due to the economics of streaming. Rather than paying for the content second by second, it is done by paying per track play. The result is a lot of 2 minute tracks, which were produced with the “verse” parts getting jammed together into the “chorus” with no break in vocals, which also uses pitch adjustments, “the “bridge” is an afterthought that is terrible, or more recently, nonexistent……… Instrumental solo? Anyone? Bueller?Music is no longer anticipated, budgeted for, and purchased on launch day with great fanfare. We have grown accustomed to the idea that we should have everything available at our fingertips, and as a consequence of this we get exactly what we pay for.replyrobinsonb5 16 hours ago | parent | next [–]You're not wrong about modern songs - but that's not really the use case for this tool:A few days ago I was given the task of creating a corporate video - just a rolling slideshow for a shop-window display. Then suddenly it was going to go on YouTube as well - so needed some music! I found a suitable track but needed to edit it for length so its closing chord coincided with the credits card at the end of the video.This tool might have saved me the bother of splicing the music in Audacity.replyTaylorAlexander 6 hours ago | root | parent | next [–]I just did the same thing. I made a promo video for an art project which is a youtube short that is 60 seconds long. I wanted both the opening of the song, where things start slow and pick up, and the ending of the song where things build to a crescendo and then nicely close, so I had to find some place in the middle to blend the two cuts of the track together. I just tried this tool and it appears to work well. I have not A/B tested it against my manual cut yet, but I might swap out my cut for this one. Nice!replyc22 5 hours ago | root | parent | prev | next [–]Couldn't you also just manipulate the slide duration?replyrobinsonb5 42 minutes ago | root | parent | next [–]Yes, if the discrepancy is a few seconds - in this case I needed an extra minute or so of music, and the customer had already requested a specific slide duration so I had limited leeway there.replyNikolaNovak 12 hours ago | root | parent | prev | next [–]I imagine it'd be a particular boon for dance choreographers and intructors tooreplyjorvi 10 hours ago | root | parent | prev | next [–]I mean, I’ll easily concede there’s been a consistent trend for shorter songs, more singles and more solo artists since the… 60s (?), but it is also heavily dependent on your taste.https://youtu.be/OvC-4BixxkYand that’s just the first random 2021 song I can come up with within a second.replyepiccoleman 10 hours ago | root | parent | next [–]Hell yeah, King Buffalo has been consistently great for the last few years.replyasdff 15 hours ago | parent | prev | next [–]Music is a self eating beast these days. Any new artist is competing with not only all contemporary artists but all past artists too, since its so trivial to just go on spotify and find a playlist with the \"best alternative albums of all time\" and find all the usual suspects of the last 25 years or so. It's really unprecedented for old material to be at an even pedestal as new material. These older already monied acts tend to get the bigger venues in town and tour all the time too, so it extends beyond the digital realm. Not to mention how many small act sized venues have closed and no longer exist so there are even fewer potential opportunities for such bands compared to the arena filling acts.replyroywashere 12 hours ago | root | parent | next [–]My local music venue has ‘indie’ size of couple hundred max. But they mostly program ‘tribute’ bands or ‘classic’ acts because apparently that is the most safe to sell.Tonight I was at a Melvins show in Amsterdam. It is their 40th anniversary your, amazing! I’ve also seen Einstürzende Neubauten a few months back. Back in early 90s everybody was talking how the Stones were still playing for so long. But nowadays so many bands are still going.replyefdee 16 hours ago | parent | prev | next [–]I've rewritten this comment ten times already and I guess I don't really know what I _want_ to say, but this really irks me the wrong way. What you are describing is not Music (with a capital M) but rather the very similar product that is available in high abundance and nearly worthless. Real artists still have a considerable following that will absolutely anticipate and purchase physical media on launch day.I'm sorry, that's the best I could do.replyandybak 11 hours ago | root | parent | next [–]> Real artists still have a considerable following that will absolutely anticipate and purchase physical media on launch day.I adore music, always have and follow what I hope are \"real artists\".I haven't bought physical media for several decades and often buy albums weeks or months after release.I think you've sliced this wrong.replyar_lan 7 hours ago | root | parent | next [–]She has a cult following, but Taylor Swift's Midnights broke over 1 million vinyl sales (from late October -> late January).But I mostly agree with you - I get very excited for artists that I really enjoy releasing new work, and \"line up\" so to speak by listening to it the day it releases on Spotify.replyCWuestefeld 15 hours ago | root | parent | prev | next [–]I think you're describing the difference between art and entertainment. Both of these efforts use \"music\" as their medium, and of course there's a lot of gray area between. But it's not necessarily a bad thing that there are many different goals when producing music.replyjosuepeq 15 hours ago | root | parent | prev | next [–]Totally. I should have posted what I had written earlier, had a section on this in my comment, and even spent a half hour trying to explain how this doesn’t apply to all artists and genres. I wrote it about 10 times and I do agree…Identifying the good from the rest in such a place as Apple Music is a miserable experience. To Apple, they also make more revenue from their prioritization of marketing similar sounding two minute tracks in this “nouveau pop” format, backed up by a small amount of older superstar artist anniversary editions. Good original new music never makes it to the featured content sections.And Genres and algorithms are a mess. It applies across the board to all music and is really a problem for the flavors of House, Techno, and other genres that are simply labeled “Electronic” or “Dance.” I’m getting Avalon Emerson one minute, Bicep the next, to be ruined by corporate mass marketed deadmau5, follow by a Bad Bunny remix….worse is the algorithm which thought I might like corporate edc-esque superstars and poorly autotuned remixes- though I have not added a single song to my collection in 20 years of digital music consumption…Can we do better than “Dance” and “Electronic?” Of course they could, they haven’t. One must go elsewhere.For House and Techno, this dearth of music discovery and search-ability methods by streaming companies makes room for independent music station alternatives, like Fault radio, or gives a reason for one to seek out artists via other means, like going to independent music festivals like Sunset Campout, Honcho campout, and other events highlighted on Resident Advisor, a poster in a nightclub, a text message listing the warehouse location.(Apple Music did at least bring back Beats in Space.)I think about the proliferation of streaming, and how it actually makes finding new content difficult for people who are not familiar with those other means of distribution.- We have deprioritized the concept of the local radio station, now what was alternative rock is a rebroadcast of an AM Sports broadcast (i.e KFOG)- the death of the sale of “singles,” made it a cheap entry point for people to experience a new artist. Releasing a track on Spotify doesn’t feel as substantial.- and exclusively agreements contract provisions with corporate entities that engage in predatory practices that force up and coming artists to choose between performing for their fans at local venues, or extending their potential reach by putting their name on the bill for Coachella, sacrificing potential shows for a few hundred of miles away and several months on either side of the festival.- Additionally entertainment conglomerates like AEM and LiveNation are increasingly becoming the owners, or managers of, the entertainment venues in cities around the world. Similar exclusivity agreements can have a significant negative impact on unaffiliated independent venues ability to compete.I can’t speak for anyone in particular from the Gen Z or Alpha generation. I think for them, it’s all Apple or Spotify, music festivals if they can afford them, sharp discerning music choices on TikTok if they feel the need to branch out… and the question is - do they?The norm is now a fully mass market formula that is almost impossible to break through… and the effect of this puts the chill on the ability to link good music with committed audiences.I think I mostly explained how I feel there…replyjakkos 4 minutes ago | root | parent | next [–]> I can’t speak for anyone in particular from the Gen Z or Alpha generation.I'm just barely young enough to be a zoomer, so maybe my view will be interesting. From my perspective my ability to find \"good\" music is better than it ever would have been in the past.I find music suggestions from forums, review sites, subreddits, friends, online people I follow, etc. Then I can immediately listen to it with no effort or expense. I found my favorite album of all time from a random comment someone left on an internet thread.To me the idea of having to wait until a local radio station played a song, and then make a leap of faith on purchasing the album seems like such a worse experience.Similarly, in terms of creating music, it has never been easier to learn, create and distribute your own music. The rise of the internet has made it so much easier to find a niche communities of people making incredibly diverse and experimental music together.In my mind, streaming sites have two roles and do a very good job at both:- make all music as accessible as possible- suggest music for people who want to \"passively\" listen to music, which is how the average person has always listened to music (and that's a completely legitimate thing to want and enjoy)I see a lot of \"the death of cinema\", \"the death of music\", \"the death of video games\" takes around, and I can't help but feel like these views come from people who have lost track of where the \"niche\" communities has moved on to and then feel despair when to them it looks like the \"mainstream\" is all that exists.replyseanthemon 16 hours ago | parent | prev | next [–]I agree, I think another part of it is accessibility to tools and content. Same thing happens with gaming to an extent, when tools became more accessible, so did the content, but the quality dropped significantly, even among AAA games.I think music suffers even more so because we're all so tuned into having the best at our fingertips that if a single moment in a song isn't to our liking we can skip and forget about it completely - i think this fuels the fast-short song market, easier to saturate with many short songs and get listens rather than to work/slave on a longer more intricate piece.Back in the day, mixtapes with songs were slaved on and cherished, today slaving over something is seen as a negative quality.reply_glass 16 hours ago | parent | prev | next [–]Meanwhile the ghost of the bridge lives on as a sample in contemporary songs. Future generations will watch these ruins in awe of what the masters in the past were able to construct. Will we ever be able to surpass the classics?replyasdff 15 hours ago | root | parent | next [–]I think we peaked with music already, maybe in the early 2000s. Popular music was so simple before the 1970s. There were a few chord structures and you just had some generic verses and put it on a record. Take someone like leadbelly or bb king, they were just playing folk music that had been played for at least 100 years before either of them were born, reusing old verses or adding their own, adding a short guitar lick between verses if so inclined (bb admits this was even because he could not sing and play at the same time). A lot of their fame as a result was happenstance of being at the right place at the right time (leadbelly in particular) versus them being a head and shoulders better folk musician than the other musicians of their time. A lot of the Beatles and other such acts in the early 60s were like this too, just basic formulaic rock n roll songs with the artists marketed as heartthrobs more than musicians even. They all even had the same haircuts.Fast forward to something like Radiohead's Kid A and you have orders of magnitude more complexity going on the track. So many different sounds layered in very complicated manners. Its almost like a classical composition how there are motifs, movements, different emotions being evoked, but with any sound imaginable compared to what few are possible from the orchestra ensemble. A song from Kid A is just a part of the greater album itself. Nothing was made to stand on its own between radio advertisements.It seems these days we are reverting to how commercial music was always made. Very commercial studio focused with the artists removed from production. Generic lyrics written by low paid songwriting staff and same old tried and true chord progressions we've heard forever. The artist is a brand and a sexy person meant to sell products versus someone particularly talented with an instrument or with songwriting skills.replydragandj 14 hours ago | root | parent | next [–]And yet the Beatles stood the test of time much better than the alternative hits of the ‘90s (Radiohead included). (IMO of course, but I think its supported by alternative still being an alternative, while Beatles are still THE Beatles after all this year. BTW I’m not a great fan of either, but appreciate both)It is easy to create a supercomlex composition, that’s what classical music have been doing way before 1970s. But to capture the minds and hearts of many people with simple things, now that’s the real mastery.replyasdff 12 hours ago | root | parent | next [–]What does stand the test of time even mean in this case? People still listen to both Radiohead and the Beatles and lesser known \"alternative\" acts from the 1960s like the velvet underground today. All went on to influence others. I'd say they all stood the test of time. Stuff like record sales depends a lot more on how well your label commercialized you versus your musicianship. The mid century media era was also much smaller in terms of competing artists that were actually put in front of listeners. 3 stations on TV, a few radio stations playing music from the same record labels, a shop in town selling records from a few major labels, and that's all the discovery you have. popular acts were far more popular proportionally than popular acts in later years, just because you didn't have much option or choice otherwise back then.replydragandj 56 minutes ago | root | parent | next [–]It means that the Beatles (who the parent mentioned explicitly as a basic formulaic rock in contrast to the \"peak\" from the '90s) is much more well known now than Radiohead, and could even have been more popular than Radiohead even during the peak of Radiohead's popularity (with the general audience, of course). I doubt that the problem of alternative bands was media exposure, because they had plenty in their heyday. The issue is that their music appeal only to a small(ish) subset of people, and that most people would like something else. I don't mean this as a bad thing. It is what it is, but I find amusing how cultish their following is :)replyjosuepeq 15 hours ago | root | parent | prev | next [–]This is another sentiment I could not put into words. I agree 100%. Thank you.replyjollyllama 14 hours ago | parent | prev | next [–]The way this works out in practice is a DJ makes their mix by blending these songs together at the start/end via remixes with similar beats.replyGordonjcp 16 hours ago | parent | prev | next [–]> as a child of the 80s/90s attempting to master the art of the perfect mixtapeI hit upon the plan of taping stuff off the radio onto 1/4\", and then I could splice a not-talked-over beginning onto a not-talked-over ending.Later, I worked out that I could extend or shorten tracks, particularly if I could get a tape of the instrumental version, using the same trick.No-one uses tape and razors these days, but it was good fun.replyjosuepeq 10 hours ago | root | parent | next [–]1/4” is a much better “master” of capturing higher fidelity than my method, a compact cassette using two different cassette tape decks. I remember when I swapped it out and got a dual Pioneer compact cassette deck, which could also be controlled by a remote control. It was fantastic, until the home Compact Disc recorder drive came on to the scene. Alas, compact cassettes are not as effective to splice, and I miss the 90’s.replyGordonjcp 3 hours ago | root | parent | next [–]You can do the same thing with cassettes but they're so fiddly to splice.replylelanthran 14 hours ago | prev | next [–]My word is this impressive.I uploaded Wuthering Heights[1], selected just the trailing guitar solo (3:09 to just before the fade-out starts), and got a bunch of seemless sounding 3m tracks of just that guitar shredding away.All the ones it generated were perfectly cut and pasted, with one exception in track 2 where I could tell where it was cut/pasted.Can't wait to try it with the guitar at the end of Brothers in Arms (Dire Straits), or the flute solo in Locomotive Breath.If anyone is looking for a good use of AI, I wouldn't mind a webpage that lets me say \"complete this solo that was abruptly cut short\" and get something great.[1] This one is especially sad because the sound engineer/producer later lamented that he faded the solo out so quickly because the player was still improving like mad and what he had left after the fadeout was apparently better than what he had done while recording.replyInCityDreams 1 hour ago | parent | next [–]Thanks! I took up guitar because recorded solos were never long enough.replycheschire 17 hours ago | prev | next [–]There's a specific sect of deadmau5 fans that would love to use this to generate multi-hour continuous mixes of a song called Strobe.replyjermeh 17 hours ago | parent | next [–]I feel attackedreplyall2 16 hours ago | root | parent | next [–]The YT 10 hour videos are calling your name.https://www.youtube.com/watch?v=ZYT9vQLxt5chttps://www.youtube.com/watch?v=n88U4n3Z3Iwhttps://www.youtube.com/watch?v=YMF5djy3HNEreplycheschire 14 hours ago | root | parent | next [–]So the difference there is that's just the song on repeat. OP's tool here will try to fill the song in with content-aware filler similar to how Photoshop uses a content-aware fill feature to try to guess what could be in the gaps.For people who know every beat of Strobe, it sounds odd when things don't hit the same way, but at the same time it's kind of like a unique live mix.replySohcahtoa82 16 hours ago | root | parent | prev | next [–]I hate that the frequency of the bass kicks doesn't match the frequency of the eyes flashing, so they go out of sync. The eye flashing feels about 1 bpm slower than the beat.replymmh0000 16 hours ago | prev | next [–]This is the coolest thing ever!I like to have multiple hour continuations of songs which I use to help me fall asleep. In the past I've made my own, but I'm terrible at audio editing. It is a ton of work and, for me, really hard to get right.After a little bit of experimenting with Mofi, it seems to do a very good job and selecting when to repeat a sections.[edit]Here's my first attempt for a 30 minute song:https://mofi.loud.red/edit/ebbf4b410181aa767152945cbb6a2d679...replyjtbayly 15 hours ago | parent | next [–]I wish this worked. I wanted to listen to an example. But all I got was “You haven't imported this file yet. Import it first to use it.”replyjaflo 15 hours ago | root | parent | next [–]Fearing copyright lawyers, I implemented this message so you cannot share audio by just sending a link anymore, but have to import the song yourself to be able to use it :(You can use this example though if you just want to try: https://mofi.loud.red/edit/8bd3fdf780f8c3927e41029f3b957f8a7...replyBonoboIO 15 hours ago | parent | prev | next [–]This gives me\"Not Imported You haven't imported this file yet. Import it first to use it.\"replysuperasn 2 hours ago | prev | next [–]This will be great for my programming music.Though it's just anecdotal but I have seen that the quickest way to enter into the zone is to play repeating loops at 140 bpm.Unfortunately I haven't really found many of these as most of the tracks I love are non looping. I think this can take care of it. Kudos on making this!replydiggum 12 hours ago | prev | next [–]I was fortunate to help bring similar tech to life as a PM for Adobe Audition and Premiere Pro in a feature dubbed Remix. Since we were designing to help music fit the duration of a scene or video project, our goals resulted in a slightly different experience from those of music fans wanting to recut a song for general purpose listening, but it worked like magic for most tracks. Still one of my favorite projects that I worked on.replydiggum 11 hours ago | parent | next [–]And I just realized you acknowledged it at the bottom of the page! ;)replyjaflo 10 hours ago | root | parent | next [–]The tech behind the Remix feature looks really impressive! I haven't used it myself, but while working on this project I had some people mention it to me and I looked at some videos showing how it's used. Very cool feature!replymmh0000 11 hours ago | prev | next [–]After spending all afternoon playing with this. I have two inputs.1] A lot of the heavy lifting is done client side, which is excellent; I have a super fast processor! But, watching the CPU utilization, it seems to spike the CPU for a few milliseconds, then waits for a second or two and, spikes the CPU again, then repeats. I suspect there may be some significant performance improvements to be had on client recomputes.2] While it is doing recomputes, it would be great to get a progress bar or, at least, a message saying, \"This will take a long time, be patient.\" It took me multiple attempts to determine that the service was indeed working, just that my client was taking its sweet time recomputing.replyspaceman_2020 18 hours ago | prev | next [–]Can’t wait to use this to stretch my 19 minute prog rock tracks into 190 minutes :)replySolvency 17 hours ago | prev | next [–]How did you make the animation in the homepage? It's definitely not a screen recording...it feels like something animated in After Effects at 60fps. Is that true? Or did you use something else?replyjasonjmcghee 17 hours ago | parent | next [–]Looks a bit like https://www.screen.studio/replyjaflo 17 hours ago | root | parent | next [–]Correct, this is it! It's basically a blend of screen recording and AE. The recording is made and then the software smoothes cursor movements and creates the zoom effects.replynicexe 2 hours ago | prev | next [–]I tried lengthening Another Day by Dream Theater from 4:26 to 8:00.I set it to avoid the segment that the key changes and to favor the 2 solo segments.It doesn't seem like its doing a good job. Only the first 5 seconds of the intro made it and then is just repeating over and over the big solo. In the end, a very small part of the short solo makes it in as an outro.Maybe it works better at shortening songs or maybe changing duration closer to the original duration.replylcnPylGDnU4H9OF 11 hours ago | prev | next [–]Seeing the domain has me curious, is it a reference to a Pokemon[0] or is it something else? (Sorry for off-topic!)> On repeat: Make an extended version of your song's favorite part by choosing the catchy part and seamlessly repeating part of it!John Mulaney's \"Best Meal I Ever Had\" story[1] had me wanting to do this for Tom Jones' What's New Pussycat so I could play that as an inside joke with some friends. This would definitely have made that easier. (Ultimately, I had a version of the song which started in the middle and \"ended\" right before it \"started\" so the effect could be mimicked if the file was played on loop. This had a short silence manifest as the media player \"loaded a new song\" from its perspective; didn't have that issue in Audacity.)[0] https://www.pokemon.com/us/pokedex/loudred[1] https://www.youtube.com/watch?v=Tv1l1eUhN-E (Usually called \"The Salt and Pepper Diner\")replyjaflo 10 hours ago | parent | next [–]Yes, it is! I wanted a short domain for side projects, and then this one came across and I registered it. I tried to give an homage to the Pokemon in the favicon in the root domain :) https://loud.red/favicon-32x32.pngAnd yes, I had this issue while testing also! A lot of players added a small gap when looping which was a bit annoying to test with...replyMatthewWilkes 18 hours ago | prev | next [–]Surprising that the only mention of intellectual property in the FAQ and the legal terms page is about copyright that the service claims in the outputs, not restrictions on the inputs.replyliminalsunset 16 hours ago | parent | next [–]The ToS for this claims that you have to pay for it to use the results commercially, but I couldn't find the pricing for it anywhere or any way to sign up.Interesting, as the primary use case for this seems to be something along the lines of editing music to fit into video projects.replyjaflo 16 hours ago | root | parent | next [–]I plan to implement paid features later with a basic free tier. I am still trying to figure that out. I've updated the terms to be more clear about that!replyliminalsunset 15 hours ago | root | parent | next [–]Ah, I see. Nitpick: It currently says \"Do not upload rights that you do not have the rights to\".replyjaflo 15 hours ago | root | parent | next [–]Whoops, thank you, will update!replynaltroc 16 hours ago | parent | prev | next [–]since there is no login mechanism, I used the anonymous feedback section to request their agreements with BMI and ASCAP for creating liscenced mechanical renditions of copyrighted materials.replyjaflo 16 hours ago | root | parent | next [–]This is a good point, I have updated the site to only allow you to view content you submitted and also made it clear that you need to have the rights to the audio to edit it.replysd9 17 hours ago | prev | next [–]Infinite roll: https://mofi.loud.red/edit/517b150b00ca475016cd64c2ed0730266...replyyanuzay 1 hour ago | prev | next [–]It's possible to add multiple files and added them at once?replypersonjerry 15 hours ago | prev | next [–]I'm enjoying the results, I can make my favourite tunes 10 minutes long and often it's pretty seamless! I can't wait to get sick of all my songs :)Is the project open-source?replyjaflo 15 hours ago | parent | next [–]Glad you like it! Sadly this version is not, but this project is a rewrite from an old version I created that is open-source! https://github.com/jaflo/snipsnipIf you are interested in audio analysis in general, I would also recommend checking out librosa: https://librosa.org/doc/latest/index.htmlreplycodetrotter 18 hours ago | prev | next [–]> This is helpful for making any song match a video or performance with a set duration.This is perfect for TikTok videos!Will definitely be using your tool. Very cool!> I am thinking of writing up some more details about the implementation in the future.Please do :Dreplyjedberg 15 hours ago | prev | next [–]The way this works is interesting. I asked it to cut 30 seconds from the middle of a song (a spoken word portion without music) and then shorten the track by 30 seconds. I figured it would just cut that out and do some fancy blending of the music before and after the cut to make it sound good. Instead I got:  at 00:00 a 00:16 segment (00:00–00:16)  at 00:16 a 00:51 segment (02:05–02:57)  at 01:07 a 02:31 segment (01:34–04:05)  at 03:39 a 00:11 segment (04:03–04:14)It's adding and repeating chunks of the song and cutting other parts and I'm not sure why.replystu2010 17 hours ago | prev | next [–]What's the maximum length? I can't find it documented anywhere and keep running into it when trying to try this with Tool tracks.replyjaflo 17 hours ago | parent | next [–]There is no enforced maximum length for either input or output right now. In practice, the remote machine times out trying to analyze a song after 10 or so minutes. For output, your machine will take forever to generate really long results.replystu2010 16 hours ago | root | parent | next [–]I see an error saying \"Remote media exceeds maximum duration\" for this track that is 9:24 long: https://www.youtube.com/watch?v=Y7JG63IuaWsI'm guessing that's the timeout?replyjaflo 16 hours ago | root | parent | next [–]I had forgotten about this check actually! I just removed it and deployed the changes. You can try again but am unsure if it will break something (it will spin indefinitely, but I would give it up to 10 minutes). Good luck!replyquickthrower2 17 hours ago | prev | next [–]I can finally see and hear what Bohemian Rapsody would have sounded like had they caved in to make a radio-friendly cut.replyJonathanFly 4 hours ago | prev | next [–]What's the difference between \"Search\" and \"Edit song\"? It seems like Search is just about length, and Edit also considers sections you marked? Or does Edit do the same thing but with many edits, rather than a few?replyConnorMooneyhan 17 hours ago | prev | next [–]I'm a tad disappointed. Cool idea, but I haven't gotten anything to really sound seamless when shortening or lengthening yet.replyjaflo 17 hours ago | parent | next [–]It definitely works better on pop songs or music with repeating choruses or patterns as those can be matched to each other more easily. What kind of music did you try it with?replyedonhametsu 4 hours ago | prev | next [–]If you're stuck on Loading (0 of 19), make sure you have a new enough Firefox version to support dynamic import for workers (https://bugzilla.mozilla.org/show_bug.cgi?id=1540913, i.e. 113 or newer).For example, ESR 102 does not have the feature and it breaks the site.replyredox99 18 hours ago | prev | next [–]Does this create \"new\" music for the filled parts, like some AIs (MusicLM, MusicGen, etc) do? Or just repeat in a more seamless way?replyjaflo 17 hours ago | parent | next [–]It does not create new music from scratch using one of the techniques you mentioned, but just reuses parts from the song, blending the transitions between them. That is a cool idea though!replybenkaiser 8 hours ago | prev | next [–]Interesting how the youtube videos are pulled down in a cloud function and stored on a file host for caching. I know there is a disclaimer about making sure you have the applicable rights, and IANAL, but this is for sure violating some terms and potentially copyright when users are using videos they don't have rights to.replykunalgupta 17 hours ago | prev | next [–]Perfect! You automated my hobby of extending music videos to last up to the max video length available on YouTube in 2008https://youtu.be/XCJs_eAkNS8replydanhau 12 hours ago | prev | next [–]Very cool! It seems to struggle with mixed meter music, though (understandably). I've uploaded a song of mine that's mostly in 6/8, but has some bars of 7/8. It still makes smooth transitions, but on the wrong beat, which is very noticeable. I will try it again with a song in only one odd measure, maybe that works.replypradn 16 hours ago | prev | next [–]This is exciting. It adds to the tools creators have to remix songs. A middle ground between full AI and full human-made songs is a mix, like what Bronze AI has done with one of my favorite songs. (https://bronze.ai/listen/jai-paul/)A less rosy scenario is like Spotify generating music to get around having to pay artists.replypersonjerry 12 hours ago | prev | next [–]It would be cool if you could link to a particular cut (i.e. a five star 10 minute version I really like)replyempyrrhicist 7 hours ago | prev | next [–]Are you worried about trademark infringement?https://mofi.com/replypersonjerry 16 hours ago | prev | next [–]I created a 10 minute version of The Less I know The Better (https://mofi.loud.red/edit/dde278b8c131c1a6e47117ceb29d1ceb6...) but the export doesn't seem to work, it just errors out with \"Invalid Crossfade\" multiple timesreplyjaflo 16 hours ago | parent | next [–]Whoops, looks like there was a bug, just fixed it, could you try again?replypersonjerry 15 hours ago | root | parent | next [–]Looks like it works now, thanks!replycchance 14 hours ago | root | parent | next [–]is it just me or does exporting not work to share it with people, it says i need the original song to view that link above ?replyemmanueloga_ 14 hours ago | prev | next [–]Really nice! Do you use a library or service to find the self similar points, or is it your work?Found a bunch of cool related links here [1].1: https://en.wikipedia.org/wiki/Music_information_retrievalreplycyberax 16 hours ago | prev | next [–]Can we use something like this to remove the laugh track, please? PLEASE?It needs to be generalized to video content, but the task is a bit easier.replyEwanG 14 hours ago | prev | next [–]First thought was that we finally have an answer for Symphony No. 8 (https://en.wikipedia.org/wiki/Symphony_No._8_(Schubert))replyjonathantf2 13 hours ago | prev | next [–]Seems kinda cool but I'm stuck on \"Loading results... (0%, 0 of 19 done)\"replyanon_cow1111 11 hours ago | parent | next [–]Same here, you have any script blocking etc?replyxadoc 4 hours ago | prev | next [–]How do you get the audio from Youtube?replynicexe 2 hours ago | parent | next [–]I use https://github.com/yt-dlp/yt-dlpYou can use -F to get the available formats and find out an audio-only stream then -f FORMAT to download the specified stream.replyWorkaccount2 16 hours ago | prev | next [–]Perhaps tangential to this project, but I have always wanted something that can detect different instruments/sounds and allow me to adjust the volume on them/remix them.There are a few songs I love, but some of the best parts seem to be \"buried\" under other instruments.replyMitPitt 15 hours ago | parent | next [–]This can be done with quite aged AI actually. You can split a song into vocals+instrumental, or even vocals+drums+bass+otherhttps://github.com/Anjok07/ultimatevocalremoverguireplysilon42 3 hours ago | root | parent | next [–]I'd like to simply filter vocals (for listening while work/coding/...)... any tools for that? Preferably local without requirement for AI/nVidia card...replywpietri 15 hours ago | prev | next [–]My big question: what have you learned while working on this (very cool) project?replyjaflo 15 hours ago | parent | next [–]This project brought together a lot of different pieces of engineering and was a larger personal project for me, so there were a lot of parts and making those work together was a challenge at times.For the backend, I found it helpful to implement monitoring proactively to be able to detect and debug issues without having to bug users which has been really helpful so far and allowed me to make some performance improvements too!For the frontend it was interesting to optimize the result searching using the Web Worker + WebAssembly approach. I found some interesting ways to speed up things by parallelizing and, interestingly, manually collecting garbage in the WASM runtime.And of course learning about the entire audio analysis portion and reading on how to find similar sections of audio!replyRyanShook 6 hours ago | root | parent | next [–]Thank you for making this tool. So impressive how many features work well in this initial version.replynetvarun 10 hours ago | prev | next [–][offtopic] Could you share what tool you used to generate the demo gif/video? Very nicely done!replyhkab 8 hours ago | prev | next [–]Cool! It seems to work well with slow songs, the transition is very smoothreplysmokeydoe 17 hours ago | prev | next [–]This works great with the clips made from MusicGen. The loops are seamless. Thank you for making it free. I would love to know more about how you are analyzing the audio.replypeterdigital 8 hours ago | prev | next [–]Would love to sort by most cuts just to see what happensreplyKolmogorovComp 17 hours ago | prev | next [–]Seems really nice, though for some reason after pasting a YouTube link it's stuck when reaching 100%, would have liked to give it a try.replyjaflo 17 hours ago | parent | next [–]Looks like the machine ran out of disk space, I bumped it and it should work. Could you try again?replyKolmogorovComp 24 minutes ago | root | parent | next [–]Works well now, thanks! Overhaul quite impressive even though sometimes the cut is still noticeable.replyboffinAudio 3 hours ago | prev | next [–]I like this but there are a lot of studios in the world where I will never be able to access it, so I'd really like to have a standalone/non-web version if its at all possible. I'd pay for that.replyPr0ject217 10 hours ago | prev | next [–]This is pretty cool! Will you consider open-sourcing it?replyJohnFen 16 hours ago | prev | next [–]Interesting. Is there any chance you would release this to run natively rather than as a web service?replyjaflo 16 hours ago | parent | next [–]I think it could be possible (backend is in Python), but for most users a web service has a lower barrier of entry. Could you share your use case? I am curious.replyJohnFen 14 hours ago | root | parent | next [–]There's nothing special about my use case. It's just that I avoid relying on anything that is only available as SaaS, because it can vanish or change at any time without notice.replyEGreg 3 hours ago | prev | next [–]Pretty soon I can see how people will make a content-aware fill for relationships, heartfelt messages etcreplysundaeofshock 17 hours ago | prev | next [–]I know I’m in the minority here, but I hate it. The artist created created a song of a particular length for a very specific reason. I prefer to listen to a song the way it was meant to be listened too.replyjstanley 17 hours ago | parent | next [–]They created it that length for their reasons. You might want it a different length for your reasons. It's not clear that their reasons trump your reasons, given that your modification has no effect on them whatsoever.replysundaeofshock 17 hours ago | root | parent | next [–]I choose to listen to songs by an artist because I enjoy the choices that artist made.replyMajestic121 17 hours ago | root | parent | next [–]That's fine. Other people make other choices.replywrigby 17 hours ago | root | parent | prev | next [–]That’s fine, as long as you have obtained permission from the copyright holder to create a derivative work. Otherwise, their reasons very much do trump your reasons.replyBlahah 17 hours ago | root | parent | next [–]Sharing a derivative work could breach copyright, but if you are doing it for yourself you don't need permission.replytasty_freeze 16 hours ago | parent | prev | next [–]Do you ever decide to stop playing a song before it is over, or do you refuse to because that would be a violation of the artists intent? Likewise do you ever listen to only some songs on an album, or do you always play all the songs on an album from beginning to end?Where do you draw the line between acceptable \"edits\" vs unacceptable?replyinvokestatic 16 hours ago | parent | prev | next [–]Baffling comment. Practically every trailer has music cut to length.replyralusek 17 hours ago | parent | prev | next [–]Sometimes they create music at a particular length because that's what worked well on radio, or TikTok, or for a club set. I would go so far as to say that song length is probably chosen for some specific non-artistic constraint more often than it is chosen for some reason intrinsic to the art. So changing the music to accommodate your own constraint, i.e. \"this is the part I like when I'm working out and wish it was longer\" seems completely reasonable, and isn't even justified in being considered some sacrilegious act.replyfold3 16 hours ago | root | parent | next [–]adding to this, how streaming made rap songs shorter: https://pitchfork.com/thepitch/considering-the-rise-of-the-s...I don't remember exactly but back in the radio days, songs had to be a very specific length to be a pop single.replyuserbinator 6 hours ago | parent | prev | next [–]You can still do that.replydigging 15 hours ago | parent | prev | next [–]this seems to assume artists are infallible and in total control of the creative process. I would never assume either to be true.replytenebrisalietum 15 hours ago | parent | prev | next [–]This is thinking from a bygone passive-media era--the one of television and radio--where you were forced to be the passive consumer and had no choice but to obey your mass media masters with respect to what they delivered.There are so many tools to customize and make your audio experience your own. Ultimately my ears are my own and I love living in a world where I can precisely control my audio experiences.replysergiotapia 16 hours ago | prev | next [–]Thank you, now I can remove Dababy from Dua Lipa - Levitating. https://www.youtube.com/watch?v=TUVcZfQe-Kw&pp=ygUTZHVhIGxpc...He just butchers an otherwise perfect song!Will report back with results.Edit: Results are great! https://voca.ro/13ar1g88LSKKreplybrennopost 16 hours ago | parent | next [–]Can't you just listen to the version he's not featured on?replysergiotapia 16 hours ago | root | parent | next [–]I'm not sure there's an \"official\" version? I've listened to a few on youtube and it seems like they are all fan-made.replybrennopost 15 hours ago | root | parent | next [–]Track 5 on Future Nostalgia is Levitating without Dababy's verse.replyjonathantf2 14 hours ago | root | parent | prev | next [–]The first thing that comes up on Apple Music when you search for Levitating is the version without DaBaby.replyfrankfrank13 13 hours ago | prev | next [–]super fun to use. very useful right awayreplyomegaworks 15 hours ago | prev | next [–]Getting an SSL error - invalid HTTPS certificate. Site is being tagged as malware.reply71a54xd 17 hours ago | prev | next [–]Do these get tagged by contentID on Youtube?replyljlolel 18 hours ago | prev [–]Cool!replyGuidelines | FAQ | Lists | API | Security | Legal | Apply to YC | ContactSearch:",
    "hn_summary": "- Mofi is a web service that allows users to import a song and define a target length to shorten or lengthen the song.\n- The service analyzes the song and finds repeating audio patterns to create seamless transitions.\n- It can be used to make any song match a video or performance with a set duration.\n\n- The client can recompute and preview the results completely client-side.\n- The audio previewing uses Tone.js.\n- The project builds on similar analysis techniques as the Infinite/Eternal Jukebox.\n\n- Other similar services existed in the past, like the Eternal Jukebox and Infinite Jukebox.\n- The Echo Nest had cool music analysis toys and was acquired by Spotify.\n- The tool can be useful for creating custom mixes or editing songs for specific purposes.\n\n- The service struggles with songs in mixed meter or complex compositions.\n- Users have different opinions on editing songs and staying true to the artist's intent.\n- The tool can be used to modify songs for personal enjoyment or specific needs."
  },
  {
    "id": 36483276,
    "timestamp": 1687802106,
    "title": "Corporate profits account for almost half the increase in Europe's inflation",
    "url": "https://www.imf.org/en/Blogs/Articles/2023/06/26/europes-inflation-outlook-depends-on-how-corporate-profits-absorb-wage-gains",
    "hn_url": "http://news.ycombinator.com/item?id=36483276",
    "content": "Rising corporate profits account for almost half the increase in Europe’s inflation over the past two years as companies increased prices by more than spiking costs of imported energy. Now that workers are pushing for pay rises to recoup lost purchasing power, companies may have to accept a smaller profit share if inflation is to remain on track to reach the European Central Bank’s 2-percent target in 2025, as projected in our most recent World Economic Outlook.Inflation in the euro area peaked at 10.6 percent in October 2022 as import costs surged after Russia’s invasion of Ukraine and companies passed on more than this direct increase in costs to consumers. Inflation has since retreated to 6.1 percent in May, but core inflation—a more reliable measure of underlying price pressures—has proven more persistent. This is keeping the pressure on the ECB to add to recent interest-rate rises even though the euro area slipped into recession at the start of the year. Policymakers raised rates to a 22-year high of 3.5 percent in June.As the Chart of the Week shows, the higher inflation so far mainly reflects higher profits and import prices, with profits accounting for 45 percent of price rises since the start of 2022. That’s according to our new paper, which breaks down inflation, as measured by the consumption deflator, into labor costs, import costs, taxes, and profits. Import costs accounted for about 40 percent of inflation, while labor costs accounted for 25 percent. Taxes had a slightly deflationary impact.In other words, Europe’s businesses have so far been shielded more than workers from the adverse cost shock. Profits (adjusted for inflation) were about 1 percent above their pre-pandemic level in the first quarter of this year. Meanwhile, compensation of employees (also adjusted) was about 2 percent below trend. This is not the same as saying that profitability has increased, as discussed in our paper.Previous episodes of surging energy prices suggest that labor costs’ contribution to inflation should grow going forward. In fact, it has already picked up over recent quarters. At the same time, the contribution from import prices has fallen since its peak in mid-2022.This lag in wage gains makes sense: wages are slower than prices to react to shocks. This is partly because wage negotiations are held infrequently. But after seeing their wages drop by about 5 percent in real terms in 2022, workers are now pushing for pay rises. The key questions are how fast wages will rise and whether companies will absorb higher wage costs without further increasing prices.Assuming that nominal wages rise at a pace of around 4.5 percent over the next two years (slightly below the growth rate seen in the first quarter of 2023) and labor productivity stays broadly flat in the next couple of years, businesses’ profit share would have to fall back to pre-pandemic levels for inflation to reach the ECB’s target by mid-2025. Our calculations assume that commodity prices continue to decline, as projected in April’s World Economic Outlook.Should wages increase more significantly—by, say, the 5.5 percent rate needed to guide real wages back to their pre-pandemic level by end-2024—the profit share would have to drop to the lowest level since the mid-1990s (barring any unexpected increase in productivity) for inflation to return to target.As noted in our recent review of the euro-area economy, macroeconomic policies thus need to remain tight to anchor expectations and maintain subdued demand. This would coax firms to accept a compression of the profit share and real wages could recover at a measured pace.",
    "summary": "- Rising corporate profits have contributed to almost half of the increase in Europe's inflation over the past two years, as companies have increased prices more than their imported energy costs.\n- Workers are now demanding pay raises to regain lost purchasing power, which may require companies to accept smaller profit shares for inflation to reach the European Central Bank's target.\n- Inflation in the euro area peaked in October 2022 due to increased import costs, but core inflation remains persistent, putting pressure on the European Central Bank to raise interest rates.",
    "hn_title": "Corporate profits account for almost half the increase in Europe’s inflation",
    "original_title": "Corporate profits account for almost half the increase in Europe’s inflation",
    "score": 527,
    "hn_content": "- The article discusses the relationship between corporate profits and inflation in Europe.\n- Companies price their goods based on maximizing profits, not the goodness of their hearts.\n- Inflation allows companies to increase prices and generate higher profits.\n- Weaker companies may struggle to raise prices as much as their competitors, leading to decreased profits and potential business closures.\n- Cost-plus pricing, where prices are based on production costs, is not commonly used in retail pricing.\n- Governments sometimes argue that employees should not demand higher wages to avoid inflation spiraling out of control.\n- Workers often demand higher pay and may change jobs to find better-paying opportunities.\n- This discussion is particularly relevant in Europe, where companies generally do not pay higher wages.\n- The UK government has argued for wage restraint in the public sector.\n- Uncompetitive markets and lack of competition can lead to higher prices and reduced consumer power.\n- Competition is necessary to keep prices in check and prevent excessive profits.\n- Consumers have the power to choose where they spend their money and can influence prices by shifting their demand.\n- Consolidation and lack of competition in various industries limit consumer choice and enable companies to increase prices.\n- The role of unions is vital in counterbalancing the power of large companies.\n- Anti-trust laws and stronger regulation can promote competition, level the playing field, and prevent monopolistic practices.\n- Tacit collusion among companies can lead to uncompetitive markets and higher prices.\n- Labor and consumer power are essential for maintaining competitive markets and preventing price increases.- The IMF has released a working paper discussing the factors contributing to inflation in the euro area.\n- The paper argues that import prices and domestic profits are key drivers of rising inflation in the region.\n- Import prices account for around 40% of the increase in the consumption deflator, while domestic profits account for 45%.\n- Sectors benefiting from increasing international commodity prices and those exposed to supply-demand imbalances experienced the largest increases in profits.\n- The data does not suggest a widespread increase in markups, but rather a redistribution of profits.\n- The paper concludes that a normalization of the profit share will be necessary to achieve a convergence of inflation to target levels.\n- The findings challenge the notion that the recent increase in corporate profits is driving inflation, instead suggesting that it is a response to supply-demand imbalances and higher input costs.\n- The paper highlights the need for restrictive monetary policy to anchor expectations and maintain subdued demand in order to achieve price stability.\n- The working paper provides important insights into the factors contributing to inflation in the euro area, shedding light on the role of import prices and domestic profits in driving price increases.\n- The findings highlight the need for policymakers to carefully monitor the impact of higher input costs and supply-demand imbalances on inflation and implement appropriate measures to maintain price stability.",
    "hn_summary": "- The article discusses the relationship between corporate profits and inflation in Europe, highlighting that domestic profits account for almost half of the increase in inflation.\n- Weaker companies may struggle to raise prices as much as their competitors, leading to decreased profits and potential business closures.\n- Lack of competition in various industries can lead to higher prices and reduced consumer power, emphasizing the importance of competition in maintaining price stability."
  },
  {
    "id": 36479882,
    "timestamp": 1687788747,
    "title": "I'm Done with Red Hat (Enterprise Linux)",
    "url": "https://www.jeffgeerling.com/blog/2023/im-done-red-hat-enterprise-linux",
    "hn_url": "http://news.ycombinator.com/item?id=36479882",
    "content": "June 26, 2023Two years ago, Red Hat killed CentOS, a widely-used free version of their Enterprise Linux distribution.The community of CentOS users—myself included—were labeled as 'freeloaders', using the work of the almighty Red Hat corporation, without contributing anything back. Don't mind all the open source developers, Linux kernel contributors, and software devs who used CentOS for testing and building their software. Also ignore the fact that Red Hat builds their product on top of Linux, which they didn't build and don't own.I almost wrote off Red Hat back then. It felt like someone stuck a knife in my back.This past week, Red Hat took that knife and twisted it hard, when they published this blog post. Let there be no mistake: this was meant to destroy the distributions the community built to replace what Red Hat took away.There were only two things that kept me around after Red Hat betrayed us the first time: First, instead of attacking the community of open source users, many Red Hatters reached out and asked, \"How can we do better?\" It didn't heal the wound, but it meant something, knowing someone at Red Hat would at least listen.Second—and more importantly—Rocky Linux and AlmaLinux stepped in. They prevented a mass-exodus from the Red Hat ecosystem, giving developers like me a stable target for my open source work. But Rocky and Alma relied on Red Hat sharing their source code.Here's how it used to work:Red Hat would grab a copy of LinuxThey would add magic sauce that makes it Red Hat Enterprise LinuxThey would release a new versionThey would update a source code repository with all the data required to build it from scratchThat's kinda the status quo because in open source, the source... is open! And it doesn't matter if someone who uses your source benefits from it too... that's kind of what it's all about! We all benefit from sharing our work, and in this case, the GPL license Linux uses legally requires us to share it!Without that sharing, there would be no Debian, Arch, Mint, Ubuntu, PopOS, Fedora... or any of the other hundreds of Linux distros that build on each other and prop up the community.But Red Hat decided to put the source code behind a paywall. Now, this is legal. Technically, the GPL allows it. But it's generally rude and annoying to do that when the code you're locking down is largely based on other people's open source code.But... it's within their rights, so I won't argue that point. What I will argue is the current subscription agreement, which might not be legal. Red Hat currently says they can cancel any user's account if they download the source code and redistribute it.Let's say someone downloads the source through a Red Hat subscription, and uses that to build a new version of Rocky Linux. If Red Hat retailiated by cancelling that subscription, I'd definitely tune into that court case.I don't know if the community could front the money to take on IBM's powerful laywers—maybe that's what Red Hat's banking on. But there's another player in this game who might, and that's Oracle. Wouldn't it be ironic if Oracle were the ones who knocked Red Hat down a peg for being so uppity with their abuse of their community!But let me be clear: everything I've seen points to Red Hat trying to choke out downstream distros like Rocky, Alma, and Oracle Linux. I think their hope is users of those distros would get scared and sign up for a Red Hat subscription. They need this to happen to lock in some short-term profits to please their IBM overlords. That's my cynical take on it.What Red Hat's doing is skirting right on the edge of legality the terms of Linux's GPL License. If you wanna dig into that, read this post from the Software Freedom Conservancy.Red Hat used to be the company of rebels. They used to have edgy ads quoting Gandhi and positioning Red Hat as the plucky underdog, using open source to upend the old proprietary software companies.It's funny they used to be so devoted to that Gandhi quote in particular. In one sense, Red Hat kinda won, they're the default choice for running Linux in big companies.The irony is that Cory Doctorow recently wrote this about a different company, but I think it applies here:HERE IS HOW platforms die: First, they are good to their users; then they abuse their users to make things better for their business customers; finally, they abuse those business customers to claw back all the value for themselves. Then, they die.What a juxtoposition!They built up so much goodwill in the open source community through the years and used to be known as the 'open source company.'But they're throwing away that goodwill—at least as far as Linux is concerned—all in the name of profit.Developers like me, maintainers of the EPEL repository, Fedora maintainers who are rightfully worried about the long-term impacts...We're all being told to go sign up for a Red Hat Developer Account so we can snag our 16 licenses[^1] of Red Hat Enterprise Linux for testing.Oh boy!Thanks, I guess I'll drop doing something actually productive and spend a week retooling my test infrastructure and automation to work with Red Hat licensing.You know who doesn't require me to do that?Debian. Ubuntu. FreeBSD. Not even Rocky Linux!And please tell your employees to stop patronizing me, saying I should just use CentOS Stream. There's a reason Rocky and Alma linux have been downloaded millions of times. Stream is not a substitute for CentOS.So I've dropped support for Enterprise Linux on all my work, effective last Friday.And people are asking me about Ansible. That's the Red Hat Ansible Automation Platform (by IBM), by the way.I don't think Ansible's gonna try locking down access, but the fact I have to spend even a second considering that possibility is insane!Who wants to build around an ecosystem where the open source users are called freeloaders and where massive disruptions are implemented in the middle of a release cycle, two times in a row, with no warning?I don't see this helping Red Hat in any way in the long term.In the end, this is just sad:It's sad for users like me who used CentOS and developed tools on it that on-ramped folks into Red Hat's ecosystem.It's sad for Red Hat, which used to fight for open source, but now puts up barriers around their own source code.It's sad for everyone still in their ecosystem, because they're now forced to deal with Red Hat's licensing shenanigans and the loss of so many in the open source community.Rocky Linux and AlmaLinux both announced they'll find a way forward. I hope they can, if nothing else so people who stuck with Red Hat don't get burned again.But as for me? I'm done with Red Hat Enterprise Linux.I'll keep up support for Rocky Linux and AlmaLinux on a best-effort basis, but I have no confidence I'll be able to support Enterprise Linux moving forward.Fool me once, shame on you. Fool me twice...[^1] Red Hat seemed to be upping the limit to 240 sockets per developer, but now it seems that was just a bug.Further readingCracks are showing in Enterprise Open Source's foundationsDear Red Hat: Are you dumb?Removing official support for Red Hat Enterprise Linuxred hat linux open source video youtubeAdd new commentCommentsTiaan – 17 hours agoSolution could be as simple as drawing up a new GPL that would exclude RedHat practices and campaign to have package maintainers adopt it. Let RedHat fork everything they include and try and maintain it themselvesreply-dsr- – 15 hours agoIn reply to byThe SFC says that the new Red Hat practice violates the current GPL, no changes needed.I can see how a judge might agree or disagree, but I can't see a path to anyone who likes the GPL ever cooperating with IBM again.replyJeff Geerling – 15 hours agoIn reply to bySFC says it might, but that a court case would be needed after someone actually triggers Red Hat's ire.replyMSpreij – 16 hours agohttps://fosstodon.org/@omenos/110602377978605193\"UPDATE 2023.06.26: I can confirm via Red Hat employees the Developer Subscription has not experienced any changes. There is a display bug with the Customer Portal that is being tracked down. The DS4I is still limited to 16 entitlements.\"replyMRC – 15 hours agoThe tweet seems to be a bug unfortunately.replyWill – 15 hours agoPlease post your alternative recommendations more clearly. We're also CentOS users, so what's the best way forward? We just need a LAMP stack really.replyJeff Geerling – 15 hours agoIn reply to byI've been running Debian mostly, lately.replyNathanael – 13 hours agoIn reply to bySince Debian is controlled by a not-for-profit foundation, it's much more robust against this sort of corporate shenanigan. Not *immune*, but more robust.replyLogan – 12 hours agoIn reply to byDebian is good.Debian was very good before the systemd nonsense.replyYeroc – 13 hours agoIn reply to byIf you're looking for a distribution with long term support options your choices are probably either Ubuntu LTS or Suse Enterprise Linux. Particularly if you're looking for distributions that are supported by commercial packages you might need to run in a business.replydebianuser – 11 hours agoIn reply to byDebian has never been better. Come help.replyWill – 10 hours agoIn reply to byThanks to all, lots of good input. Our servers are to support our own businesses, and a few partners, and just use webmin/virtualmin, wp/php stuff, MySQL, python stuff, etc. I want to get this migration done now/soon and to a target that isn't going to change for awhile, and remain non-commercial OSS. Thanks again.replyAGia – 15 hours agoJust a correction in your first sentence\"Two years ago, IBM (which acquired Red Hat) killed CentOS (which It was expected), a widely-used free version of their Enterprise Linux distribution.\"This is not unusual. Remember that Oracle has aquired MySQL (free database) and now MySQL is no longer free (really free) !!!!!That's the flow of things - unfortunately !!!replyEsra Erimez – 14 hours agoWe've moved to Ubuntu over two years ago. We are looking closely at Clear Linux as an alternative to Ubuntu, just in case.replyDrWeevilJammer – 11 hours agoIn reply to byClear Linux is an Intel project. I don't trust them, either.Personally, I'm looking into SUSE's SLES. They've been around longer than RH, have the same business model and customer base, but they exist in an (arguably) better business environment for an open source company: Germany/EU.replysimon – 14 hours agowhat if Linux and all OSS changed their license to prevent Redhat/IBM from using it?replyme – 14 hours ago\"Red Hat currently says they can cancel any user's account if they download the source code and redistribute it.\" - lets see a link please and where it says that. Would also love to see a link to previous versions of the same document to highlight what changed therein.This sounds a bit like it'll revert to something like the ancient White Box Linux days to me.....replyJeff Geerling – 14 hours agoIn reply to bySee Product Appendix 1, which currently reads:Unauthorized Use of Subscription Services. Any unauthorized use of the Subscription Services is a material breach of the Agreement.Unauthorized use of the Subscription Services includes: (a) only purchasing or renewing Subscription Services based on some of the total number of Units, (b) splitting or applying one Software Subscription to two or more Units, (c) providing Subscription Services (in whole or in part) to third parties, (d) using Subscription Services in connection with any redistribution of Software or (e) using Subscription Services to support or maintain any non-Red Hat Software products without purchasing Subscription Services for each such instance (collectively, “Unauthorized Subscription Services Uses”).Redistribution would run afoul of point 1.2 (g) (d), and providing the source from one account to someone else would run afoul of point 1.2 (g) (c), according to my \"IANAL\" understanding of the contract.replyzealot – 12 hours agoIn reply to byOh snap, someone can read on the internet!replyMCB – 12 hours agoIn reply to byI am also not a lawyer, but there has been verbiage for a long time about subscription usage. This does not say that it cannot be redistributed. It does not say that you cannot make copies. It doesn't say that there can be multiple deployments.Red Hat has to pay for its development, testing, integration, support, etc. This says that if one system has an active subscription, all must have an active subscription.Kinda like I cannot buy a single copy of proprietary software and install and use it on 1000 servers.replytadbit – 9 hours agoIn reply to by> This does not say that it cannot be redistributed. It does not say that you cannot make copiesIt says it very explicitly.> Unauthorized use of the Subscription Services includes: ... (d) using Subscription Services in connection with any redistribution of Software...You are 100% wrong.> [IBM] has to pay for its development, testing, integration, support, etc.IBM didn't have to pay for all the development. There's some things that require active development, sure, but the overwhelmingly majourity of the software they sell is just repackaged open source projects.> I cannot buy a single copy of proprietary software and install and use it on 1000 servers.None of the GPL protected code in the RHEL SRPMs is proprietary to Red Hat.replyanonymous – 10 hours agoIn reply to byMy recollection of that clause means you can't download and redistribute the binaries. Obviously lawyers and courts would need to clarify how broad that clause is in real life.replySagar – 14 hours agoThe only OS I can imagine to be viable without Ansible is nixOS. I use it for my homelab and can't recommend it enough, for a number of other reasons too.replyAndrea – 14 hours agoNot the first time IBM are short sighted. They are the same folks who once said OS market would never be profitable (or something along those lines), making room for one of the most profitable businesses ever.Maybe I am reading too much in this but attempting to monetize on CentOS is basically saying they are desperate for cash, even small change. Maybe they are beyond healingreplyDavid Gavin – 13 hours agoI think it's time to change the brand to Big Blue Hat 😔replyDave Acklam – 13 hours agoThe way forward is likely to get sources from Oracle instead....replyRob – 13 hours agoI'll say it again. Switch to FreeBSD and you'll never have any of these issues.replyRedShift – 12 hours agoLooks like all good things really must come to an end...replyFranz – 12 hours agoAny privately owned and autocratically governed GNU/Linux distribution will eventually behave in a manner similar to Red Hat. There is already a precedent on similar behaviors by Ubuntu (using snaps to create a monopoly package distribution mechanism, servers for which are not open source).Debian may be the best bet for a high quality distribution with a large package base.replyMike – 10 hours agoI have a feeling that all the Red Hat-descendants are in trouble. IBM has been a greedy bunch for a long time.I'm very glad my daily driver is not bad on them.Sounds like the industry needs to look at other distros, and Ubuntu and SUSE in particular if SLAs are needed.replyJustin – 9 hours agoPretty bad when Ansibles biggest role contributor is calling them out on their BS.But to be fair, we all know it's IBM pulling their strings. Redhat wouldn't have done this unless forced to do so.reply",
    "summary": "- Red Hat's decision to put the source code behind a paywall is causing backlash in the open-source community, especially among developers who relied on CentOS for testing and building their software.\n- The move is seen as an attempt by Red Hat to push users towards signing up for a Red Hat subscription and generate short-term profits, potentially at the expense of smaller downstream distributions like Rocky Linux and AlmaLinux.\n- The future of enterprise Linux and the role of Red Hat in the open-source community are now uncertain, as users are considering alternative distributions such as Debian and Ubuntu.",
    "hn_title": "I'm Done with Red Hat (Enterprise Linux)",
    "original_title": "I'm Done with Red Hat (Enterprise Linux)",
    "score": 484,
    "hn_content": "- People are expressing their frustration and disappointment with Red Hat's decision to end support for CentOS and move towards CentOS Stream\n- Some believe that Red Hat is prioritizing short-term sales over the open-source community\n- There is debate over the term \"freeloaders\" and its implications for CentOS users\n- Red Hat's contributions to the open-source ecosystem and the value it brings to the industry are acknowledged\n- The impact of this decision on goodwill and trust within the community is a concern\n- The future of the Enterprise Linux community and the ecosystem around RHEL is uncertain\n- There are differences of opinion on the effectiveness of emotional responses versus fact-based arguments\n- The importance of maintaining compatibility with RHEL and its impact on driver support is highlighted\n- The legal implications of Red Hat's actions and the interpretation of the GPL are discussed\n- The potential consequences for the open-source ecosystem and the appeal of alternative distributions like Debian are mentioned- IBM's lawyers and financial resources may make it difficult for users to redistribute GPL software.\n- Red Hat is trying to prevent users from freely redistributing GPL software they received.\n- Open source software, like GPL, is a business tool for individuals and companies.\n- Red Hat's decision may impact the stability and support of CentOS and other similar distributions.\n- Red Hat's actions have sparked controversy among users and developers in the open-source community.\n- The GPL was designed to allow users to redistribute GPL software without restrictions, which Red Hat's actions may conflict with.\n- Red Hat's changes are seen as a hostile and toxic move by some members of the open-source community.\n- Some users and organizations are considering switching to other distributions like Debian or Ubuntu as alternatives to Red Hat.\n- Red Hat's transformation since being acquired by IBM has caused concern and contributed to users' decisions to switch to other distributions.\n- The long-term effects of Red Hat's decisions on the open-source ecosystem and the future adoption of its products are uncertain.",
    "hn_summary": "- Red Hat's decision to end support for CentOS and move towards CentOS Stream has led to frustration and disappointment among users.\n- There are concerns about Red Hat prioritizing short-term sales over the open-source community and the impact on goodwill and trust within the community.\n- The future of the Enterprise Linux community and the ecosystem around RHEL is uncertain, with users considering switching to alternative distributions like Debian or Ubuntu."
  },
  {
    "id": 36475949,
    "timestamp": 1687756223,
    "title": "John Goodenough has died",
    "url": "https://www.thehindubusinessline.com/news/goodenough-nobel-laureate-who-gave-the-world-li-ion-batteries-passes-away/article67010369.ece",
    "hn_url": "http://news.ycombinator.com/item?id=36475949",
    "content": "ADVERTISEMENTCompanies Markets Portfolio Opinion EconomyFREE TRIALSubscribe SIGN UP / LOGINMENUePaperCompaniesNewsHomeNewsObituary. Goodenough, Nobel laureate who gave the world Li-ion batteries, passes awayUpdated - June 27, 2023 at 10:22 AM. | ChennaiGoodenough also played a significant role in the development of Random Access Memory (RAM) for computersBY M RAMESHCOMMENTSSHAREREAD LATERJohn Bannister Goodenough was just a month short of turning 101 | Photo Credit: PETER NICHOLLSJohn Bannister Goodenough, the American co-inventor of Lithium-ion batteries and a co-winner of 2019 Nobel prize for Chemistry, has passed away. He was just a month short of turning 101.Goodenough’s death has been confirmed to businessline by his student Nicholas Grundish.British-American scientist Stan Whittingham, who shared the Nobel prize with Goodenough, was the first to reveal that lithium can be stored within sheets of titanium sulphide. Goodenough perfected it with a cobalt-based cathode to create a product that today touches nearly everyone’s life.John Goodenough: The man who powered the lithium battery revolution Goodenough also played a significant role in the development of Random Access Memory (RAM) for computers.John Goodenough was born to American parents in Jena, Germany, per the Nobel Prize website. After studying mathematics at the Yale University, he served the US Army during the Second World War as a meteorologist.He then studied at the University of Chicago and received a doctorate in physics in 1952. He subsequently worked at the Massachusetts Institute of Technology and Oxford University in the UK.Also read: Goodenough: The man who powered the lithium battery revolutionThen US President Barack Obama presenting the National Medal of Science award to John Goodenough at the White House in February, 2013. | Photo Credit: JASON REEDHe had been a professor at the University of Texas at Austin.In 2008, Goodenough wrote his autobiography, Witness to Grace, which he called “my personal history”. The book touches upon science and spirituality.Prof Preetham Singh of IIT-BHU, who was one of Goodenough’s students, recalls that the Nobel laureate was “a great soul, very humanistic, whose doors were always open to anyone for discussion, suggestion and help.”Prof Ramasamy Murugan of the Pondicherry University, another of Goodenough’s Indian students, speaks highly of the Nobel laureate’s defining qualities — kindness, integrity, sense of humour and, above all, a unique laugh.COMMENTSSHAREPublished on June 26, 2023Related TopicsDeath Electric VehiclesCOMMENT NOW  Open in AppThe Hindu BusinesslineAbout UsArchiveNewsletterRss FeedsContact usNewsroomCustomer careAdvertisementCareersGroup News SitesThe HinduBL on CampusSportstarBusiness Lineஇந்து தமிழ் திசைThe Hindu CentreFrontlineYoung World ClubThe Hindu ePaperBusiness Line ePaperCrossword + Free GamesThe Hindu CouponsOther ProductsRoofandFloorSTEPImagesClassifiedsSpecial PublicationseBooksPopular SectionsCompaniesMarketsEconomySpecialsPortfolioResourcesCompany IndexHome Loan Interest RateFixed Deposit Interest RateIncome Tax Calculator 2022-2023Trending on thehindubusinessline.comGoodenough, Nobel laureate who gave the world Li-ion batteries, passes awayShree Cement share price tanks 10% on ₹23,000-crore tax evasion reportInvestment and vehicle registrations dip in electric two-wheeler segmentZydus Lifesciences picks up equity in Mylab Discovery Solutions for ₹106 croreWin-win for US-India tradeTrending on our Group sitesA new regime: On the Emergency Use Authorisation regime in India and clinical trialsHyderabad Metro Rail for Patancheru announcement leaves Old City residents asking ‘what about us?’What is really behind the violence in Manipur?No, Nehru did not mishandle KashmirHurdles star McLaughlin lethal in 400m flat, Lyles shines again in NYCPrivacy Policy Terms & conditionsCopyright© 2023, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.BACK TO TOP",
    "summary": "- John Bannister Goodenough, the co-inventor of Lithium-ion batteries and Nobel laureate, has passed away at the age of 101.\n- Goodenough played a significant role in the development of Random Access Memory (RAM) for computers.\n- He was known for his kindness, integrity, sense of humor, and unique laugh.",
    "hn_title": "John Goodenough has died",
    "original_title": "John Goodenough has died",
    "score": 453,
    "hn_content": "Hacker News new | past | comments | ask | show | jobs | submit loginJohn Goodenough has died (thehindubusinessline.com)453 points by epistasis 1 day ago | hide | past | favorite | 98 commentsNovaDudely 1 day ago | next [–]It cannot be understated just how much his invention changed the world. Li-ion batteries were the key that allowed us to have truly portable devices that had decent battery life and light weight. It also broke us away from things like Discmans powered by disposable AA batteries. From Laptops, the smart phones and nowadays bikes, cars and trucks - the amount of change that it has brought is astounding. Anyone old enough to have used devices before Li-ion can remember the weird oddities you would have of inconsistent power and odd charging properties.However, from a hyper environmentalist position, this invention unfortunately ended up fueling all manners of wars through the specific material requirements, cobalt being the prime example, it also sort of helped kick off the idea of devices that could be almost disposable (non-replaceable batteries) but these are all secondary flow on impacts of Goodenough's core invention.More a lesson that even things intended to be good can have weird unintended consequences in a chaotic world. It was never his intent to do so it just worked out that way.The John was the living personification of the scientific inventor should be admired, we need more like him and here is hoping that the future will continue in that endeavour of progress.replyepistasis 1 day ago | parent | next [–]Compared to all other basic materials we use in our life, lithium is pretty mundane. No war has been faught over cobalt. It's a byproduct of other mining, and quickly being phased out for cheaper less controversial materials.Lithium mining gets a bad rap not because it's particularly environmentally devastating, but because of political narratives that try to prevent technological change. Lithium is really a mundane material. You never hear people complaining about potash mining or other similar salt extraction, lithium is just targeted because of the industries that it upsets, which are in turn orders of magnitude more damaging.Which isn't to say that we shouldn't make it as environmentally friendly as possible. I'm just saying that if you fill up a tank of gas, you have a hell of a lot more to answer for when it comes to environmental karma than if you fill an equivalent lithium battery.replydefrost 1 day ago | root | parent | next [–]For anyone that would like to go to primary sources for this:  Australia has one of the biggest lithium reserves and is the biggest producer of lithium by weight, with most of its production coming from mines in Western Australia. Most Australian lithium is produced from hard-rock spodumene, in contrast to other major producers like Argentina, Chile and China, which produce it mainly from salt lakes. [1]World’s ten largest lithium mines in 2020 [2]Having established that much of the world's lithium is sourced from my state here in Western Australia, these are the local environmental concerns raised [3] (1997) wrt Greenbushes [4] and the local EPA recommendations wrt Greenbushes expansion (2019) [5].As a state we like clean air, clean beaches, native forrests, traditional ownership | stewardship, protecting the flora and fauna, and making sure mines are cleaned up afterwards.Currently Greenbushes mine is a bloody great hole in the ground, of which we have many, in the near future it will be a large lake surrounded by regrowth.Conditions in Argentina, Chile and China are left as an exercise for the reader .. there is also the matter of processing concentrates which is typically dirtier than mining to export concentrates.Processing can be very polluting, it can also be closely watched and contained with plant wide pads under layed with membranes that are regulalry monitored, inspected, fined for breach, etc.[1] https://en.wikipedia.org/wiki/Lithium_mining_in_Australia[2] https://www.mining-technology.com/marketdata/ten-largest-lit...[3] https://www.bmartin.cc/dissent/documents/Cargill.html[4] https://en.wikipedia.org/wiki/Greenbushes_mine[5] https://www.epa.wa.gov.au/media-statements/expansion-greenbu...replyDrBazza 1 day ago | root | parent | next [–]Just dropped a google pin on the site and the area is greener than I expected. Would a lake the size of that pit fill naturally and actually persist? And would it ever be of any use for drinking water?replydefrost 1 day ago | root | parent | next [–]There's a hell of a question . . .That particular mine pit will probably be fine (for reasons of geology and tailings treatment, etc . . . \" However \"  The Berkeley Pit in Butte, Montana, is the cautionary tale everyone wants to avoid.  The 1.6km-by-800m copper mine closed in 1982 and gradually filled with water irreversibly contaminated with sulphuric acid, copper, arsenic, cadmium and zinc from the surrounding rock.  In 2016, some 3000 migrating snow geese were killed when they landed on the toxic brew. The US Environmental Protection Agency (EPA) must pump out and treat the water – forever.[source] https://cosmosmagazine.com/earth/sustainability/australias-p...It's certainly worth highlighting that past Western Australian mines have not ben rehabbed to any notable standard:Mine rehab in WA is the pits: Inquiry finds few success stories (2017)https://www.watoday.com.au/national/western-australia/mine-r...and worth noting that articles such as the one linked above are part of a swelling campaign by land holders and others with leverage to bake clean up costs into resource licencing.replyhoosieree 19 hours ago | root | parent | next [–]After the geese died, researchers found a microorganism living (and thriving) in the extremely toxic lake. This microorganism was filtering out the toxins 900 times more effectively than any other known organism[1]. The origin of the microbe was the gut of the geese. Radiolab included this story in one episode[2].[1]: https://www.millerwelldrilling.com/miracle-at-the-berkeley-p...[2]: https://radiolab.org/podcast/91721-oopsreplyDrBazza 20 hours ago | root | parent | prev | next [–]At least some countries are learning from previous mistakes.replydefrost 20 hours ago | root | parent | next [–]Local feedback helps, if people want land access they need to promise to respect it and hold to those agreements.https://www.reuters.com/world/asia-pacific/western-australia...Speaking of copper, indigenous land rights, and Anglo-Australian multinational mining ..https://phys.org/news/2023-06-oak-flat-apache-opposition-cop...replyrmm 22 hours ago | root | parent | prev | next [–]Large operations like this, especially those close to coast, generally have to set aside a certain percentage for rehab down the line. Normally part of mining/enviro approvals. The plan needs to be updated every 3-4 years, with updated estimates etc.Greenbushes is miles away from having to worry about that. I’ve been tangentially involved in the mine designs for the new underground mine coming off the pit, so it’s decades away from rehab.A few options for old pits I’ve worked on is backfilling with waste material and then capping with earth. Backfilling with treated Tailings and then capping. Or just letting it flood, but putting protections in. Generally they will be liable to manage if for a decade or so after mining is complete. Again all depends on the permit.Biggest thing you worry about though, especially if you go underground is how to seal it off from other water structures (if required.)Sorry for brain dump but lots of variables here!(I’m a hard rock mining engineer)replydefrost 21 hours ago | root | parent | next [–]G'day :-)You might enjoy this tangential but otherwise Lithium related snippet of news.NASA opposes lithium mining at tabletop flat Nevada desert site used to calibrate satelliteshttps://apnews.com/article/nasa-lithium-mining-nevada-climat...replyDrBazza 20 hours ago | root | parent | prev | next [–]Interesting answer, thanks.replylm28469 1 day ago | root | parent | prev | next [–]Meanwhile... https://www.eurometaux.eu/media/20ad5yza/2022-policymaker-su...replylight_hue_1 1 day ago | root | parent | prev | next [–]This is too rosy of a picture when it comes to cobalt. Wish that it were so.Two thirds of the world's output is from the Congo. There have been multiple wars over the DRC because of its resources. That's at a large scale. At a small scale even today there are over 100 armed groups that control parts of the country to exploit it's resources and people. It was worse in the past. Many people including children work in \"artisanal\" mines that are horrific; these people are often modern day slaves.While lithium production is overall much more mundane, cobalt is very harmful to the people who it should be benefitting.https://www.sciencedirect.com/science/article/pii/S030142072...https://www.npr.org/sections/goatsandsoda/2023/02/01/1152893...replyboxed 1 day ago | root | parent | next [–]Yea, but it's not really a problem with cobolt, it's a problem with Congo. And it's still a good trade compared to oil that finances all manner of stuff, like the Ukraine war, and international islamist terrorism. There's also less money all in all, which means if we replaced all oil production with lithium batteries, there would be less money total going into industry that is easily hijacked for these types of purposes.Let's also remember that avocado production is being hijacked like this. It's in general dangerous to have an industry that can be easily controlled and managed as it can then be taken over by mafia/terrorism/autocrats. I don't think we should argue that high value agriculture like avocados should be banned :Preplydefrost 1 day ago | root | parent | next [–]The problems in the Congo originated with colonialism [1], esp. King Leopold, and continued throughout the Cold War via the USofA's DoE proxy sourcing of very high grade uranium for nuclear weapons [2].It's a region that has been actively destabilised by Europeans, Americans, and Russians since the scamble for Africa [3].[1] https://en.wikipedia.org/wiki/Colonization_of_the_Congo_Basi...[2] https://en.wikipedia.org/wiki/Congo_Crisis  The Congo's rich natural resources, including uranium—much of the uranium used by the U.S. nuclear programme during World War II was Congolese, led to substantial interest in the region from both the Soviet Union and the United States as the Cold War developed.[3] https://en.wikipedia.org/wiki/Scramble_for_Africareplyboxed 22 hours ago | root | parent | next [–]> The problems in the Congo originated with colonialismThat's... overselling it I think. Congo wasn't a single stable and well managed state before colonialism. The Congo has been subject to the most horrible and incompetent management absolutely, but some parts of the world that have been through immense suffering has done very well and some have done very poorly. Just look at Korea!Just blaming colonialism for everything is a bit racist honestly. It is saying that it's only whites that can change the situation and the native populations are not capable of steering their own actions.I think there is something between the far right saying africans can't be trusted because [racism] and the (far?) left saying africans have no agency because [colonialist history].replydefrost 21 hours ago | root | parent | next [–]> Congo wasn't a single stable and well managed state before colonialism.I would like to hear more about this. Do you have a good source on the actual state of the pre colonial Congo basin not written by those who came to colonise?> Just blaming colonialism for everything is a bit racist honestly.Not everything .. but of course anyone familiar with, for example, the Belgian Congo and King Leopold will also be aware of how horrific those decades were.> It is saying that it's only whites that can change the situation and the native populations are not capable of steering their own actions.What I am saying is following a brutal generations long rule the local factions almost immediately had to contend with the two largest global super powers waging a bloody and secret proxy war to retain control over the richest highest grade uranium deposits on the planet. With money no object to provide guns, bribe warlords, sway oppositions, stage coups, etc I doubt any population could survive such outside pressure without being cleaved apart.replyjandrese 20 hours ago | root | parent | next [–]I don't think any of the indigenous tribes had developed writing so such evidence is probably not to be found. It would have to come from early colonizers writing down oral histories, and they were far more interested in oppression than preservation of culture.replydefrost 19 hours ago | root | parent | next [–]Hmmm.What about the pre colonial kingdoms such as, say, the Kingdom of Luba with a million people in fishing, farming and metal-working communities paying taxes to their King?Do you think that they, or their neighbouring kingdoms in the Congo basin, had any works similar to, say, the Ethiopian Kebra Nagast (a 14th Century work)?replyTapWaterBandit 1 day ago | root | parent | prev | next [–]> I don't think we should argue that high value agriculture like avocados should be bannedThat probably would start a war. Western hipsters against the world. Throw in quinoa/kale and nukes would be on the table.replyWorldMaker 17 hours ago | root | parent | prev | next [–]The wars in the Congo were fought over Nickel and Diamonds. No one cared about Cobalt in most centuries. It was the shiny waste product of Nickel mines that sometimes artists enjoyed painting with. (Many blue paints use Cobalt. There are multiple reasons we associate the element Cobalt with \"blue\".) Even at the peak of the worst of Lithium Ion battery formulations \"demand\" for Cobalt almost all of it was sourced from Nickel mining \"waste\".Which isn't to say that it isn't valid to talk about the conditions of mining Nickel and Diamonds, but people are always (in nearly every century) mining Nickel and Diamond. But blaming Cobalt (and in turn Lithium Ion batteries) for all of the worsts excesses of Nickel mines is a bit extreme. Cobalt is the \"waste product\". Nickel was always the primary reason for all the mining. (Nickel will likely always be the primary reason. Especially now as Lithium Ion formulations have mostly eliminated Cobalt in recent years.)replylight_hue_1 14 hours ago | root | parent | next [–]> The wars in the Congo were fought over Nickel and DiamondsThat's why I said the wars were over Congo's resources. Which by the way included its people and rubber.> blaming Cobalt (and in turn Lithium Ion batteries)I'm not blaming anyone.I just reported the truth that there have been wars in the Congo over its resources and that there are armed groups that control its resources like cobalt today. The conditions of which are often horrific. Correcting the original who said cobalt mining is benign.Cobalt can't be blamed, it's not alive.If we're assigning blame, we should be blaming the Western corporate governance where it's trivial to whitewash where resources were extracted and how they were processed. If we insisted that our governments passed laws keeping corporations, and their executives, directly accountable, and requiring that they maintain a full chain of custody, then conditions on the ground in Congo would improve dramatically.It's not nickel's fault, or the fault of diamonds, or that if electric cars or batteries. The fault is and has always been our own.replyelihu 1 day ago | parent | prev | next [–]> \"this invention unfortunately ended up fueling all manners of wars through the specific material requirements, cobalt being the prime example,\"Goodenough was also involved in the invention of lithium iron phosphate batteries, which don't require cobalt or nickel.For most use cases these days, those are the batteries we should be using. (And those are the batteries that the rest of the world needs to catch up with China when it comes to actually making them.)replyNovaDudely 23 hours ago | root | parent | next [–]Absolutely, it was just a unintended side effect of the original chemistry that nobody could have predicted. That they kept going on development to move away from these issues is something that should be commended.replymoffkalast 19 hours ago | root | parent | next [–]The man wasn't perfect, but he was Goodenough.replyjacquesm 1 day ago | parent | prev | next [–]I agree with the first part of your comment but the second part reads as something you could tack on to any inventor if you felt so inclined.From a hyper environmentalist position the best thing you could do is jump off the nearest cliff. John Goodenough's inventions have done more for the environment than most others will and 'all manner of wars' is just complete bullshit.replydumpsterdiver 1 day ago | parent | prev | next [–]Ha, I remember being so impressed with the \"anti-skip protection\" on my Discman because I could mount it on the handlebars of my bicycle and it wouldn't skip nearly as much as my old Discman. What a time to be alive!replyjandrese 19 hours ago | parent | prev | next [–]> However, from a hyper environmentalist position, this invention unfortunately ended up fueling all manners of wars through the specific material requirements, cobalt being the prime example, it also sort of helped kick off the idea of devices that could be almost disposable (non-replaceable batteries) but these are all secondary flow on impacts of Goodenough's core invention.From an environmentalist position nothing else has even come close to getting us away from fossil fuels and enabling renewables. The environment doesn't even care about slave labor and wars have only a minor effect. It is coal, oil, and the like that are the enemy. We are already 20 years late in transitioning away from fossil fuels.replyphpisthebest 23 hours ago | parent | prev | next [–]>>More a lesson that even things intended to be good can have weird unintended consequences in a chaotic world.No that lesson here is that when you look at human history, human will always battle each other, and it is unfair to say Li-Ion batteries \"invention unfortunately ended up fueling all manners of wars \" as war is inevitable.replyNovaDudely 23 hours ago | root | parent | next [–]By that argument, killing is fine because death is inevitable. What I meant was that we live in a world were something that seems so innocuous selecting materials in a laboratory to achieve a set goal can be amplified decades down the road in wild ways that few can predict. I wasn't saying \"Goodenough you careless bastard!\", just that his invention was a great example of how small things can turn into major issues. While it didn't cause it, the use of cobalt turned into an amplifier of the Congo war (the same could be said of gold and diamonds).A good example could be like with LLM's. A brilliant technology that could amplify other issues in weird ways, it is only decades later that we will see what has come of it.replyphpisthebest 22 hours ago | root | parent | next [–]Not in the least bit, you are attempting to apply 3rd 4th or even 5th order effects /liability on an individual invention or group of people.killing in your example is a 1st order event.No different than how it would not blame Ford and GM for a drunk driver, I dont blame the invention of Li Ion for wars over Cobalt.replyatq2119 1 day ago | parent | prev | next [–]Totally agree, but to stick to traditions here, the phrase is \"it cannot be overstated\".replyNovaDudely 23 hours ago | root | parent | next [–]Ah yes, that is fair! Noted for future uses. ;)replyslashdev 21 hours ago | parent | prev | next [–]Sorry, what war has been fought over cobalt, lithium, or nickel? I think that’s just not true.replysubsubzero 18 hours ago | parent | prev | next [–]Good summary of his accomplishments. I remember reading that even he said he was not happy with the LI-ion battery and was actively working on its successor at UT. I would be curious how far he made it and any results he made with this next-gen solution.replyUberFly 1 day ago | parent | prev | next [–]\"hyper environmentalist position\"Can't that be attributed to pretty much everything we do and consume? We're destroying oxygen with every breath.replydigging 18 hours ago | root | parent | next [–]No, because our oxygen consumption is accounted for by the rest of the biosphere (the oxygen producers). We don't consume so much that we could realistically run out.replypanick21_ 20 hours ago | root | parent | prev | next [–]That's why some people call it the 'anti human' movement. Because their primary metrics is 'if humans do its bad, humans are a disease on the planet'.replyadventured 17 hours ago | root | parent | next [–]You're exactly correct. That's why the regression to the primitive never has a stopping point: they're never satisfied, unless humanity is dead. Ultimately in their philosophy any modification of the environment by humanity is bad, and humanity must modify the environment to survive (even at the most basic levels of agriculture, wood, fire, etc).But you can go a step further: it starts with self-hatred, without exception that is where it always begins. That self-hatred is then projected outward as a more generalized hatred for humanity.replyNovaDudely 23 hours ago | root | parent | prev | next [–]To some degree yes, I get your argument from the absurd with the oxygen thing but that is a little bit of a stretch in comparison with the original sentiment.replyadventured 17 hours ago | parent | prev | next [–]> However, from a hyper environmentalist position, this invention unfortunately ended up fueling all manners of wars through the specific material requirements, cobalt being the prime exampleThat's simply not accurate. Very few wars have been fueled by cobalt or the general material requirements of Li-ion batteries. Nearly every other major resource have prompted far more wars than cobalt (oil/gas, gold/silver, water, land, agriculture, etc).replyanarticle 21 hours ago | parent | prev | next [–]Not really sure where you're going in the second half of this comment, I don't think it's even handed.Nearly any invention can be used for many things. This man's life's work absolutely changed humanity for the better. The downsides are not nearly equivalent, even within several orders of magnitude.replyzackmorris 18 hours ago | parent | prev | next [–]I remember talking about lithium and sodium for rechargeable batteries in my junior high or high school chemistry class while covering electron affinity, maybe 1993:https://chem.libretexts.org/Bookshelves/Physical_and_Theoret...As I get older, I see that innovation happens despite the tech industry, not because of it. Because so many ideas are obvious and straightforward to implement that only gatekeeping could work at a scale large enough to prevent them from manifesting.I have not investigated the history of li-ion batteries at all, other than notable dates around the year 2000 that I quote for rants like this. But I would wager that the reason Goodenough's batteries took off is that he went through profitable channels so the military industrial complex and corporate competitors couldn't suppress them.Actually I'm completely wrong:https://en.wikipedia.org/wiki/History_of_the_lithium-ion_bat...1979. So li-ion batteries were suppressed until Obama's reelection around 2012, when the writing was on the wall and car manufacturers were forced to release electric vehicles that weren't terrible. So a 33 year gap where batteries, photovoltaics, etc etc etc could have kept CO2 out of the atmosphere:https://en.wikipedia.org/wiki/Carbon_dioxide_in_Earth%27s_at...So today's 420 ppm minus 340 ppm around 1979 equals 80 ppm, where each ppm is 2.13 gigaton, so about 170 gigatons of CO2 leaked into the atmosphere to preserve the profits of the fossil fuel industry and other moneyed interests of the status quo.Let this be a cautionary tale, but also inspiration for fellow inventors. The thing stopping you from success is probably not the thing itself, but the real-life hurdles conspiring against you. IMHO the best defense against that is each other.replysbeaks 1 day ago | prev | next [–]His 36,500 charge cycles is pretty impressive as well.replymkl 1 day ago | parent | next [–]What battery gets that many? Your comment is the only DDG hit for [\"36,500 charge cycles\"], and is the only relevant Google hit for [\"36,500\" \"goodenough\"].replytiagod 1 day ago | root | parent | next [–]He lived for 100 years. 365 * 100 = 36500replyaembleton 21 hours ago | root | parent | next [–]25 of those years were leap years, so its 36525replymkl 1 day ago | root | parent | prev | next [–]I got that it was 365 * 100, but there aren't any batteries that last that long and I'm apparently too literal.replystavros 23 hours ago | root | parent | next [–]Also presumably he had more charge cycles than that, as I doubt he only had one meal a day.I won't stop until this joke is dead as a doornail.replybmicraft 22 hours ago | root | parent | next [–]I took it to mean sleeping, that wou make it close to the numberreplylcnPylGDnU4H9OF 13 hours ago | root | parent | next [–]Given that he was just a month shy of 101, it still ought to be (with leap years) 365 * 101 + 25 - 30.replysomebody78978 16 hours ago | parent | prev | next [–]You could say that it was good enoughreplyjacquesm 1 day ago | prev | next [–]Ah that's too bad. He was still working on something that he thought might be the next breakthrough in battery technology, and given his reputation I am completely willing to believe him.I doubt his shoes will ever be filled. A true inventor.replyProjectiboga 19 hours ago | prev | next [–]Here is a slightly longer previous article. He had dyslexia, and other major scientific contributions. https://www.thehindubusinessline.com/business-tech/goodenoug... Dr Goodenough was far beyond his name.replytoomuchtodo 1 day ago | prev | next [–]https://en.wikipedia.org/wiki/John_B._Goodenoughreplyjraph 23 hours ago | prev | next [–]This website asks me to enable JavaScript and cookies, here's a link that works.https://web.archive.org/web/20230626074746/https://www.thehi...(Almost) 101 is impressive!replyninesnines 22 hours ago | prev | next [–]Cute interview when he one the Nobel prize; he seemed like such a motivated happy scientist and really was an inspiration.https://m.youtube.com/watch?v=CkIKRoTFogUreplytaejavu 1 day ago | prev | next [–]Dang, wasn't he working on solid state batteries?replyh0l0cube 1 day ago | parent | next [–]HN discussion:94-year-old Lithium-Ion Battery Inventor Introduces Solid State Battery (2017, 1168pts)https://news.ycombinator.com/item?id=13778543replymoffkalast 18 hours ago | root | parent | next [–]Inventing a 94 year old battery is definitely more impressive than inventing a 0 year old one like people usually do. ;)replysaltcured 17 hours ago | root | parent | next [–]Imagine the desk where he neglected his paperwork for so long...replyAm4TIfIsER0ppos 17 hours ago | root | parent | prev | next [–]It is created with 94 years of wear like those deliberately damaged jeans.replyAndrewOMartin 1 day ago | prev | next [–]I struggle to find a definitive source, but I think John Goodenough is also credited with the invention of the try/catch block in programming.replymkl 1 day ago | parent | next [–]You're probably thinking of the two papers referenced here, \"The first papers on structured exception handling\": https://en.wikipedia.org/wiki/Exception_handling#HistoryThese came well after exception handling was first developed, but are by a John B Goodenough. However, I think it's a different John B Goodenough: https://www.sei.cmu.edu/about/leadership/display.cfm?custome...replyPurpleRamen 23 hours ago | root | parent | next [–]This is really strange. How are there two people with the same rare surname who make history, and have not just the same first name, but even the same middle letter? I'm curious if that family name is so rare that they are actually related, and whether it's some custom in that family to name the kids that way.replymkl 21 hours ago | root | parent | next [–]I spent a while trying to find a family connection but didn't succeed. There is an American custom for fathers to name their sons after themselves, as if trying to deny them their own identity; Bill Gates is the third William Henry Gates in a row, for example.replyTade0 19 hours ago | root | parent | prev | next [–]My name is unusual for my generation - so much so that in my extended social circle I have just one namesake roughly my age.One side effect is that I was memorable just by virtue of having such a name.I suspect that in the case of both of the John Goodenoughs people generally never forgot that first impression - and that goes a long way.replyisleyaardvark 21 hours ago | root | parent | prev | next [–]We're in the Buckaroo Banzai dimension.replyhiccuphippo 20 hours ago | root | parent | next [–]Maybe their parents liked rock music from the future. Go Johnny go, go.replystavros 23 hours ago | root | parent | prev | next [–]His name was \"John B Goodenough\"? And John was good enough? You can't make this up.replyjacquesm 1 day ago | parent | prev | next [–]I somewhat doubt that, though he was involved in some of the materials science behind RAM memory.https://stackoverflow.com/questions/1449951/what-language-wa...replyFindecanor 1 day ago | parent | prev | next [–]If it was not him, then it was another John B. Goodenough located not far from him in the mid-1970s (SofTech, Lowell, Massachusetts vs. MIT, Cambridge, Massachusetts)reply1-6 1 day ago | parent | prev | next [–]try/catch, the ultimate goodenough ending.replyilyt 20 hours ago | parent | prev | next [–]\"good enough\" error handlingreplydbcooper 18 hours ago | prev | next [–]The biggest F.So much positive impact on the world.replyjohnsonjo 18 hours ago | parent | next [–]For anyone not getting what this comment means by \"The biggest F.\" this article on wiki explains it as:> \"Press F to pay respects\" or \"Press X to pay respects\" is an Internet meme that originated from Call of Duty: Advanced Warfare, a 2014 first-person shooter in Activision's Call of Duty franchise. It originated as a set of instructions conveyed during an in-game quick time event at a funeral service. Widely mocked by critics and players due to its forced element of interactivity that was not perceived to be tastefully executed, the phrase would later become a notable Internet meme in its own right. It is sometimes used by Internet commenters to convey solidarity and sympathy, either sarcastic or sincere, in response to unfortunate eventshttps://en.wikipedia.org/wiki/Press_F_to_pay_respectsreply1-6 1 day ago | prev | next [–]I wonder how he got his last name. As a perfectionist, I would love to have a last name like that.replyJagat 14 hours ago | parent | next [–]The last name \"Goodenough\" is of English origin. It is an occupational surname derived from the Middle English term \"godenough,\" which means \"good enough\" or \"satisfactory.\" The name likely originated as a nickname or a description for someone who was deemed competent, capable, or satisfactory in their profession or tasks.In some cases, the surname may have also been a locational name, referring to someone who resided in a place called Goodenough or a similar variant. However, this is less common compared to the occupational origin.Like many surnames, the spelling and pronunciation of \"Goodenough\" may have varied over time and across different regions. Variations of the name can be found, such as Goodenow or Goodenowes.It's worth noting that surnames have complex and diverse origins, and multiple factors can contribute to the development of a particular surname. Different branches of a family may have different origins or variations of the name, so it's always recommended to research the specific family history to obtain more accurate information.replyre 12 hours ago | root | parent | next [–]This is straight ChatGPT output, right? It would be polite to tag it as such, especially given its habit of confabulation.replyaskvictor 1 day ago | parent | prev | next [–]I have a colleague who's surname is Toogood.replyPurpleRamen 23 hours ago | parent | prev | next [–]You mean his family name? He was born with it. Seems to be a legit old name from UK.replychoeger 23 hours ago | root | parent | next [–]Yeah, apparently, they migrated to the US after a generation-spanning feud with a neighboring clan, called Perfect.replymaksimur 22 hours ago | root | parent | prev | next [–]According to familysearch.org it was either- bestowed on one who was easily satisfied- in reference to one whose achievements were average, \"good enough\" though not outstanding- a nickname meaning \"good lad\" or \"good servant\"replyM3L0NM4N 1 day ago | prev | next [–]Rest in peace, and Hook 'em.replyJC770 1 day ago | prev | next [–]God bless himreplyzafka 21 hours ago | prev | next [–]I agree with the previous suggestion of a HN black ribbon.replyhelloSirMan 17 hours ago | prev | next [–]A living legend, now a legend. I met him - his laugh was huge and contagious.replymsephton 21 hours ago | prev | next [–]Gonna charge my phone to say thanks.replydtx1 1 day ago | prev | next [–]Truly a sad day. His Batteries changed the world perhaps as much as nuclear tech did. Rest in Peace Mr. Goodenough. Your inventions will outlive you and perhaps play a crucial part in keeping earth habitable for us. Truly a life well lived.replyvijaybritto 1 day ago | prev | next [–]You were good enough John. RIPreplyNoMoreNicksLeft 19 hours ago | prev | next [–]One wonders what he might have accomplished if his name had been John Notgoodenough.replyMizoguchi 20 hours ago | prev | next [–]We will be paying him tribute every time we unplug our chargers half way.replyrvz 23 hours ago | prev | next [–]A magnificent invention from a brilliant mind and lived long enough to see his invention and contribution(s) really change the world.Thank you Dr. Goodenough, RIP.replysgt 1 day ago | prev | next [–]Black ribbon I think, dang?replyjacquesm 1 day ago | parent | next [–]Yes, probably. There isn't a person on HN that isn't using products that have one or more of his inventions embedded in it. Even if none of them are software or software related.replyaaronax 18 hours ago | parent | prev | next [–]To save anyone the few minutes it took me to figure out what this means: https://news.ycombinator.com/item?id=14120362A black bar (mourning band) is sometimes added to the top of HN when an industry figure dies.replyrvz 23 hours ago | parent | prev | next [–]He should indeed get one. RIP.replyswah 23 hours ago | prev [–]OT: I thought this was an article related to OceanGate and how, due to the Titan event, the population could become more vocal against hacks and shortcuts.replyGuidelines | FAQ | Lists | API | Security | Legal | Apply to YC | ContactSearch:",
    "hn_summary": "- John Goodenough, inventor of the Li-ion battery, has passed away.\n- His invention revolutionized technology, enabling portable devices with longer battery life and lighter weight.\n- Goodenough's work had unintended consequences, such as environmental impacts and non-replaceable batteries, but his contributions to the field of battery technology are significant."
  },
  {
    "id": 36479974,
    "timestamp": 1687789293,
    "title": "Oregon finally legalizes pumping your own gas",
    "url": "https://www.thedrive.com/news/oregon-finally-legalizes-pumping-your-own-gas-after-72-years",
    "hn_url": "http://news.ycombinator.com/item?id=36479974",
    "content": "News→CultureOregon Finally Legalizes Pumping Your Own Gas After 72 YearsOregon will prohibit gas stations from charging more for full-service fuel.BYCHRIS ROSALES|PUBLISHED JUN 24, 2023 8:30 PM EDTNEWSClose-up of unrecognizable white man purchasing gas at pump. GettySHARECHRIS ROSALESView Chris Rosales'S ArticleschrishasacamerachrishasacameraAfter a 72-year reign, Oregon’s self-service gas prohibition has been decisively repealed in the state Senate. Though there have been intermediate years and exceptions, notably in rural counties in 2017, and during wildfires or heatwaves since 2020. House Bill 2426 as proposed would require gas stations to staff half of the available pumps, but allows the other half to be self-service.According to a report from The Oregonian, fuel companies have long pushed for the change due to staffing shortages. The Northwest Grocery Association, an advocate for retail and food suppliers, claims that jobs won’t be lost because half of gas pumps are already closed due to understaffing. The provision in the bill to staff half of pumps reflects this statistic, effectively reopening gas stations that are understaffed.Full-service gas stations are a relic of the past, from a time when adding fuel by yourself was dangerous and prohibited by state fire codes, but also inconvenient. One of the first self-service gas stations opened in 1947 in Los Angeles and started a change that caught strongly in the ‘70s. From then, self-service became the new normal, and when pay-at-the-pump proliferated in the ‘80s with the rise of credit cards. From then, there have been staunch holdouts of full-service gas stations, the most famous of which is New Jersey. Oregon was the other.Oregon’s bill crucially prevents stations from charging more for a full-service pump than a self-service, which will effectively eliminate full-service pumps. The economic advantage of self-serve, saving money for the owners of the stations, will shift legislative future pressure surrounding full-service stations. Not to mention, Oregon drivers that would prefer to save time by simply pulling up to an empty pump rather than waiting in line for a forced full-service pump.The bill goes to Oregon Governor Tina Kotek to be signed into immediate effect.Got a tip? Email tips@thedrive.comCULTURE",
    "summary": "- Oregon has repealed its 72-year ban on self-service gas stations, allowing customers to pump their own gas.\n- The change was prompted by fuel companies advocating for the repeal due to staffing shortages.\n- The new bill also prohibits gas stations from charging more for full-service pumps, effectively eliminating full-service options.",
    "hn_title": "Oregon finally legalizes pumping your own gas",
    "original_title": "Oregon finally legalizes pumping your own gas",
    "score": 398,
    "hn_content": "- Oregon has passed legislation legalizing self-service at gas stations.\n- Full service gas stations used to provide additional services like checking oil, air, and other driving essentials.\n- The law was around to create jobs, but it wasn't a good justification as it became government-subsidized jobs.\n- Gasoline fumes are toxic and carcinogenic, and forcing people to work in a gas station all day was not good for their health.\n- Gas stations are complaining about labor levels and are having difficulty finding employees, especially due to the COVID-19 pandemic.\n- Increasing labor prices may lead to fewer gas station attendants as customers prioritize cheaper gas prices over service.\n- Some readers are open to working at gas stations for the right compensation and safety measures.\n- Gas stations in Oregon often only pumped gas, and during the pandemic, service was even more limited.\n- The tradition of full service gas stations is coming to an end in Oregon, which is seen as a positive development by some readers.\n- Discussions about gas station attendants bring up issues of labor levels, market rates, and legislation requiring businesses to hire employees at rates that the market won't bear.\n- There is a debate about the necessity of gas station attendants and the value they provide.\n- Gasoline fumes can be dangerous, and there have been lawsuits and concerns about safety violations at gas stations.\n- Some countries still don't permit self-service gas stations, while others do, depending on local regulations.\n- White gas and kerosene are examples of liquid fuels that can be used in camping stoves.\n- The convenience of self-service gas stations is appreciated by some readers, as it allows greater flexibility in operating hours and reduces wait times.\n- There are concerns about advertising screens and political stickers at gas pumps.\n- Some readers suggest having expiration dates for laws that need to be explicitly renewed.\n- Lawmakers should spend equal time repealing laws as they do creating them.- The discussion on this post centers around the issue of legislative processes and the effectiveness of politicians in enacting sensible policies.\n- There is a mention of a recent bill in Oregon that mandates gas stations to offer self-service options and prevents them from charging more for full-service.\n- The debate revolves around the potential impact of the bill, the viability of full-service pumps, and the preference for self-service.\n- Some individuals argue that laws should have expiration dates and be regularly reviewed and renewed, while others express concerns about the complexity and potential loopholes.\n- The topic of taxation is briefly touched upon, with a mention of the absence of sales tax in Oregon and the implications for government funding.\n- Overall, the conversation highlights different perspectives on political processes and the need for effective governance.",
    "hn_summary": "- Oregon has passed legislation legalizing self-service at gas stations, bringing an end to the tradition of full-service gas stations in the state.\n- The decision to legalize self-service has sparked discussions about labor levels, market rates, and the value of gas station attendants.\n- There are concerns about the impact of the legislation on jobs, safety regulations, and the convenience of self-service for customers."
  },
  {
    "id": 36481693,
    "timestamp": 1687795942,
    "title": "Turmeric's unexpected link to lead poisoning in Bangladesh",
    "url": "https://stanmed.stanford.edu/turmeric-lead-risk-detect/",
    "hn_url": "http://news.ycombinator.com/item?id=36481693",
    "content": "Thespicesellers’secretThe rural areas of Bangladesh are quilted with verdant rice paddies nestled between glittering, blue river tributaries. Women wrapped in fuchsia, pomegranate-red and tangerine-orange saris walk among tan-and-brown cows. Market stalls are piled high with multicolored produce and spices. It is a country of vibrant colors.This is where Jenna Forsyth landed in 2015, during the first summer of her PhD program with the Emmett Interdisciplinary Program in Environment and Resources at Stanford University. Armed with data that showed surprisingly high levels of lead in pregnant women in rural Bangladesh, her mission was to figure out where it was coming from and how to get rid of it.At the start, there weren’t any obvious answers. There were no lead-belching factories in the area. Leaded gasoline had been banned for years. And it couldn’t be lead-based paint because few residents could afford to paint their homes. Her adviser thought the source could be lead-arsenate pesticides, but after spending days wading in muddy rice paddies, she ruled that out. She had hit a scientific dead end.Undaunted, she returned to Stanford University and joined an interdisciplinary team of researchers to look at the problem anew. Ultimately, using old-fashioned detective work and high-tech chemical analysis, the team identified the source and joined government officials in getting the lead out. Now, they hope to use the same approach to reduce lead exposure throughout the world.A heavy metalForsyth’s main PhD adviser was Stephen Luby, MD, an epidemiologist who had been tackling the global lead problem since the early 1990s. His work began in Pakistan, where his research contributed to banning leaded gasoline in that country. But after he read a study (Bergkvist et al., 2010, in Environmental Research) about unexpectedly high levels of lead in pregnant women in rural Bangladesh, he knew his work wasn’t done.“There is no safe level for lead exposure,” said Luby, a Stanford School of Medicine professor of medicine and the director of research for the Stanford Center for Innovation in Global Health. Early in his career, Luby spent eight years focused on improving public health in Bangladesh, so this was personal.Lead is a toxic heavy metal that can seriously damage reproductive, neurological and cardiovascular systems. Exposure to it is a global problem, with an estimated 1 in 3 children with blood lead levels at or above 5 micrograms per deciliter, the level considered unacceptable by the World Health Organization. (In October 2021, the U.S. Centers for Disease Control and Prevention lowered this level to 3.5 micrograms per deciliter.)“There is no safe level for lead exposure.”Stephen Luby, MD, director of research for the Stanford Center for Innovation in Global HealthBetween 24 million and 46 million children and teenagers in Bangladesh are estimated to have lead levels above this threshold, the fourth highest number in this age group behind India, Nigeria and Pakistan. Lead poisoning has lifelong, irreversible effects on the cognitive abilities of children, and the social and economic impacts to a country can be devastating.Children with blood lead levels above 5 micrograms per deciliter may score 3 to 5 points lower on intelligence tests than unaffected peers, limiting their potential. In addition, preschool lead exposure is often associated with juvenile delinquency, violence and crime. In Bangladesh alone, the lower IQ levels caused by lead poisoning are estimated to cost $16 billion annually in lost lifetime productivity, 6% of gross domestic product.After Forsyth returned from Bangladesh, she reviewed her disappointing findings with Luby. But she had a hunch. She’d recently read a lead study from that region (Gleason et al., 2014 in Journal of Environmental and Public Health) hypothesizing turmeric as a potential source of lead. Could it be the powdery, orange-yellow spice that permeates daily life in Bangladesh? Turmeric is used in curries, as a clothing dye, in cosmetics, in medicines and as an insect repellent. Luby was skeptical, but he let her run with it. “Show me the evidence,” he said.So, she analyzed 17 turmeric samples from her Bangladesh trip, and one had exceedingly high levels of lead and chromium. It was a start, and like any good medical detective, she began gathering more clues.The golden spiceForsyth is an environmental scientist with wanderlust. She’s spent nearly 15 years studying health problems in Bangladesh, Kenya, Tanzania, Costa Rica and Australia, looking for ways to reduce contaminants in air, water, soil and food.When she was growing up in Logan, Utah, she loved mysteries. Early on, she decided to become a detective, and for her eighth-grade science fair project she went undercover to swab bathroom doorknobs at local restaurants, culturing bacterial samples to evaluate sanitation levels.This love of evidence-driven puzzles set her on a course to carry on her detective work and, after studying biology as an undergraduate, then earning a master’s in environmental engineering and global health at the University of Washington, she contacted Luby. He recruited her as a PhD candidate, and she joined his initiative to reduce lead exposure in pregnant women, along with icddr,b, a global nonprofit in Bangladesh formerly known as International Centre for Diarrheal Disease Research, Bangladesh.Back in Bangladesh, Forsyth and the team began a deep dive into the workings of the turmeric supply chain. They interviewed the stakeholders in the production, consumption and regulation of turmeric. They went to mills, wholesalers and spice markets, all the while collecting samples of turmeric, colorants, dust and soil in little baggies for analysis.To mask flawed turmeric, some processors began dusting the roots with lead chromate — an orange-yellow industrial pigment used to color plastics and furniture.Turmeric, a member of the ginger family, is made from the rootstalks, aka rhizomes, of Curcuma longa. At the end of the growing season, farmers let the knee-high, leafy green tops dry out, then use hoes to dig up the rhizomes. Next workers, typically women, painstakingly remove dirt clods and break off the feeder roots. Then the naked rhizomes are washed, steamed and laid out to dry for a few weeks.After drying, the rhizomes are polished to remove dirt and the skins, revealing the yellow inner root. This is done manually or, in larger operations, by placing the rhizomes in rotating drums made of an abrasive wire mesh. Next, the rhizomes are cut, crushed and ground into a powder.Color matters to turmeric purchasers, and turmeric that is more vibrantly yellow typically sells for higher prices. The Stanford University team learned that this color-linked perception of quality may have started in the 1980s, when a flood interrupted the drying process, turning rhizomes brown and moldy.To mask flawed turmeric, some processors began dusting the roots with lead chromate — an orange-yellow industrial pigment used to color plastics and furniture. From the interviews, Forsyth learned that this coloration step continued for four decades after the flood and that most processors weren’t aware that the pigments were toxic. But, with Forsyth’s help, this would soon change.Bring on the ray gunsAs a child, Scott Fendorf, PhD, the Terry Huffington Professor and senior associate dean for integrative initiatives in the Stanford Doerr School of Sustainability, liked playing in the dirt. Fortunately for science, his parents encouraged this obsession, and today, he is a leading expert in soil chemistry.Fendorf was one of Forsyth’s PhD thesis advisers and was the first expert she consulted when she returned from Bangladesh with baggies full of spice, dust and dirt.Sitting in his cozy office, overgrown with houseplants thriving on enriched soil, Forsyth presented Fendorf with her challenges: How could she figure out where the lead poisoning was coming from? Was it in food, pesticides, lead-soldered cans, silt from local water supplies, or impurities in the clay/ash pellets that many pregnant women chewed to alleviate mineral cravings? And what technology could be applied to verify that lead from a given source was poisoning the Bangladeshis?Fendorf explained that a metal like lead can be composed of unique mixes of elemental isotopes that vary according to the source. These location-specific ratios can sometimes be used to pinpoint a lead source in the same way detectives use fingerprints to identify criminals. Analyze the lead isotope ratio in a blood sample to see if it matches one of the lead sources; if it does, bingo, you’ve found the culprit.But he warned that this approach doesn’t always work, so they enlisted Katharine Maher, PhD, professor of Earth System Science, and Karrie Weaver, technical director at the SIGMA Shared Lab at the Stanford Doerr School of Sustainability, to evaluate how useful the analysis could be for this application.Turmeric is an orange-yellow spice used in curries, as a clothing dye, in cosmetics, in medicines and as an insect repellent. Close to 50% of Bangladesh’s population is employed in agriculture, and turmeric is an important cash crop and export. (Photography by Timothy Archibald)The SIGMA, or Stanford Isotopic and Geochemical Measurement and Analysis, lab is home to several state-of-the-art devices — inductively coupled plasma mass spectrometers — that can analyze the precise elemental components of just about any material, from water, soil and tissues, to dinosaur bones. How do these mass spectrometers work? A sample is placed into a chamber where hot argon plasma breaks down a substance into its elemental components. Then the components are stripped of impurities, separated and analyzed by molecular weight and identified by custom software.As a first step, Forsyth and Weaver characterized the unique isotope ratios for each Bangladeshi lead source — and they lucked out. The lead-isotope fingerprints varied enough to identify specific sources. After the techs analyzed the blood samples collected during their first trip to Bangladesh, there was a clear signal — the blood-borne lead was coming from the turmeric and the industrial pigments used to color it.Next, the team had to figure out how to quickly identify tainted product in real time in the field; sending samples to a lab for analysis was too expensive and time-consuming to be practical.For this, Alandra Lopez, Fendorf’s PhD student at the time, showed Forsyth a bright yellow plastic device that looked like a toy ray gun. It was a handheld X-ray fluorescent analyzer. Their lab used it for identifying toxins in the soil, and Lopez was tasked with developing a test methodology and training protocol for its use in turmeric testing.Then Forsyth bought one for the team for roughly $40,000, and they went back to Bangladesh, armed and ready.The stingGathering scientific evidence in a foreign country to fix a public health problem is one thing. Getting the country to act on it is another. This is where Luby’s deep understanding and love of the Bangladeshi culture came in handy.“It’s a profoundly hospitable culture, committed to education, with people who really want to make the country better,” said Luby.Bangladesh is one of the most densely populated countries in the world, surrounded by India to the west, north and east, and Myanmar to the southeast. Its soil is fertile, enriched by frequent flooding of the Ganges and Brahmaputra river systems. Close to 50% of Bangladesh’s population is employed in agriculture, and turmeric is an important cash crop and export.The government was highly motivated to do something about the lead problem, and Luby made sure that its Department of Agricultural Authority officials were partners in designing and implementing the lead study from the beginning.“It’s a profoundly hospitable culture, committed to education, with people who really want to make the country better.”Luby, a Stanford School of Medicine professor of medicineIn July 2017, three years into her PhD research, Forsyth and the team shared their stunning findings: Turmeric mixed with lead-chromate pigments contained lead levels up to 500 times the Bangladesh legal limit of 2.5 micrograms per gram, making it the most likely cause of the lead poisonings.Their presentation was attended by 21 governmental and non-governmental organizations, including Bangladesh’s Food Safety Authority. Participants were alarmed, and word quickly spread to the highest levels of the government.From September through December 2019, the Stanford University/icddr,b team and public health officials launched a get-the-lead-out plan, beginning with an effort to inform manufacturers and consumers about the adverse health effects of lead-based pigments. News releases were published, face-to-face meetings were held with key businesspeople, and 50,000 educational posters went up in the markets and public spaces.The government declared that turmeric adulteration was a prosecutable violation, and Bangladesh Prime Minister Sheikh Hasina discussed the problem on national TV. Then, the Stanford University researchers collected blood samples from workers at one of the larger processors to illustrate how the lead was not only poisoning consumers but also their employees.Finally, the officials revealed the most important part of the plan to the Stanford University team — a sting operation.Dusted and bustedFood Safety authority representatives, flanked by soldiers in camouflage uniforms, magenta berets and guns slung over their shoulders, strode down the center of a busy street market in Dhaka, the capital city. The crowds parted.Men riding three-wheeled rickshaws pulled over. Street vendors stopped stirring their aromatic curries. The spice sellers wearing parti-colored lungi skirts fell silent. Some curious merchants, sitting atop stacks of potatoes, ginger, onions and garlic, jumped down to follow the entourage.The spice SWAT team visited six turmeric sellers’ stalls. At each, a Stanford University-trained technician pressed the nose of the X-ray fluorescent analyzer into dusty yellow bags of turmeric roots. After a minute or so, the tech could tell whether the root stalks were lead dusted. If they were, law enforcement officials moved in to confiscate and destroy the bags of tainted product.“It was law enforcement theater.”Jenna Forsyth, PhD, a research scientist with the Stanford School of MedicineBecause the government is understaffed in food safety enforcement and has a slow judicial process, officials opted for a shock-and-awe approach to punishment. Mobile court officials followed the SWAT team and, as soon as a violation was confirmed, they issued on-the-spot fines in the equivalent of $9,288 in U.S. currency, about three years of an average Bangladeshi’s salary.To amplify the message, the whole sting operation was filmed by a Jamuna Television news crew and broadcast across the nation.“It was law enforcement theater,” Forsyth said. But she admitted it was a highly effective way of informing dirty turmeric producers and sellers, “You’re being watched.”After the intervention, the team went back to the study sites to measure changes in lead levels in the turmeric supply chain, and they were amazed at the effectiveness of the campaign. At the markets, incidence of adulterated spice plunged from 47% in September 2019, to 5% in the first quarter of 2020, to no detectable lead in 2021. Evidence of lead-chromate pigment in the processing mills dropped from 30% in 2017 to 0% in 2021. And 16 months after the intervention, lead levels in the blood of sample test subjects dropped by a median of 30%.Getting the lead outBack at his office overlooking Stanford University’s engineering quad, Luby multitasks in front of five computer displays. It gives visitors the impression that his ambitions for tackling our most challenging public health issues are much bigger than can be managed on one or two screens.Luby grew up in Omaha, Nebraska, raised by an OB/GYN father and a nurse mother. As an undergrad, he immersed himself in philosophy, history and political science at Creighton University, a Jesuit school that emphasizes social justice. He went on to get a medical degree, then studied epidemiology and preventive medicine, eventually serving as the head of the U.S. Centers for Disease Control and Prevention agency in Bangladesh.During college, Luby never thought he’d become a scientist, but his unique mix of compassion, determination and scientific rigor is making a significant dent in the global lead problem.“Americans generally think we’ve solved the lead problem, but this is fundamentally not true,” said Luby. “There are 800 million children in the world with lead blood levels greater than recommended standards, and many will go on to suffer permanent brain damage. One million adults die every year because of exposure to lead.”“In Dhaka, we found this important cohort of young children, 2- to 4-year-olds, who have wildly high levels of lead poisoning.”Forsyth, whose research is now focused on finding other sources of lead contamination in BangladeshHe emphasized that lead-dusted turmeric isn’t just a Southeast Asian problem. Worldwide, turmeric is more popular than ever as an ingredient in teas, curries, anti-inflammatory supplements and coloring for processed foods like macaroni and cheese, yogurt, and ice cream. And while the major spice companies that sell it in the U.S. have good quality control procedures, a lot of turmeric is brought in by less conscientious importers, he said.Luby is now looking at using the playbook that worked in Bangladesh — evidence gathering, education, media coverage and law enforcement — to see if it can be applied to other countries.Meanwhile, Forsyth and the lead team are still hunting down other lead sources in Bangladesh.“In Dhaka, we found this important cohort of young children, 2- to 4-year-olds, who have wildly high levels of lead poisoning,” she said.And like any good detective, she’s keeping an open mind about possible culprits.“Right now, we’re exploring lead sources in battery recycling dumps, metal factories, and in pots and pans.”Looking back on the project to date, Forsyth reflected on the most important lesson she’s learned: “Lead is pervasive in our environment, and the toxic effects are profound. This is why we need to keep working this puzzle.”SHAREKris NewbyKris Newby is a freelance science writer. Contact her at medmag@stanford.eduEmail the authorYou may likeGLOBAL HEALTH | WINTER 2019Toward a world without povertyA conversation with Jim Yong Kim, the doctor who led the World BankGLOBAL HEALTH | WINTER 2019No longer neglectedA Zimbabwean clinic’s aim is to vanquish dire ear, nose and throat ailments in childrenGLOBAL HEALTH | WINTER 2019A shared missionLearning together through Stanford-Zimbabwe health care partnerships",
    "summary": "- Researchers from Stanford University have identified turmeric as a potential source of lead poisoning in rural Bangladesh.\n- Turmeric samples from Bangladesh were found to have exceedingly high levels of lead and chromium, which can cause serious health problems.\n- A sting operation involving government officials and law enforcement was conducted to confiscate and destroy tainted turmeric products, resulting in a significant decrease in lead levels in the turmeric supply chain.",
    "hn_title": "Turmeric’s unexpected link to lead poisoning in Bangladesh",
    "original_title": "Turmeric’s unexpected link to lead poisoning in Bangladesh",
    "score": 358,
    "hn_content": "Hacker News new | past | comments | ask | show | jobs | submit loginTurmeric’s unexpected link to lead poisoning in Bangladesh (stanford.edu)358 points by coopernewby 17 hours ago | hide | past | favorite | 168 commentsvalarauko 15 hours ago | next [–]I'm a little surprised at the initial confusion about the source of lead, or perhaps it's the way the article has been written. As someone who grew up in India, our school textbooks in the 90s had a list of common food adulterants, and turmeric adulteration with lead chromate was common knowledge to middle schoolers. I recall the curriculum included how to detect adulteration with simple at home tests. After turmeric, the next suspect probably would be yellow lentils.EDIT: actually the next suspect should be red chillis, adulterated with lead oxide.On an aside, food adulteration used to be such a common social menace in India in the 70s & 80s, such that it was a common theme in the backdrop of Bollywood films, with the hero taking on local mafia bosses who also dabble in food adulteration. India did a mediocre job controlling the rampant food adulteration, with the last major case I recall being an outbreak of Epidemic Dropsy in 1998 due to contamination of mustard oil. There's been cases every once in a while, though I suspect in those cases it is inadvertent contamination with Argemone plants growing in mustard fields.replyhammock 12 hours ago | parent | next [–]How can I test for lead in my tumeric?Edit: found this page which is amazing https://eatrightindia.gov.in/dart/replyTheJoeMan 10 hours ago | root | parent | next [–]This page is fascinating! I love the iodized-vs-non salt test by rubbing on potato and then sprinkling lemon juice to see if blue (iodized).At the same time, it feels so sad this page is necessary.replyhackerlight 10 hours ago | root | parent | prev | next [–]It doesn't list a test for lead in turmeric powder, unfortunately.replySaintGhurka 7 hours ago | root | parent | next [–]Also, the test for lead looks suspicious to me. The shape of the turmeric laying in the bottom of the glass looks absolutely identical between the two glasses. Like they used the same sample, but added some color to the water for the \"adulterated\" picture.Edit: Which I guess is ok, since they're just showing what to look for and they aren't falsifying an actual test.replyYetAnotherNick 9 hours ago | root | parent | prev | next [–]It's below the turmeric whole test, and is more or less the same test.replyhackerlight 8 hours ago | root | parent | next [–]That's described as a test for \"artificial colour\"replyInhibit 7 hours ago | root | parent | next [–]The lead is used to adulterate the product for color if I'm recalling correctly.replyjaggederest 2 hours ago | root | parent | next [–]Lead chromate is an incredibly vivid yellow. Good color, bad health effects, as we learned from years of lead paint.replyakavi 15 hours ago | parent | prev | next [–]As an ABCD, likewise. My mom told me to specifically buy turmeric at western grocery stores (as opposed to other spices, which could be had for better prices at Indian grocery stores) because of concerns around lead.replychucksta 13 hours ago | root | parent | next [–]You would hope, its common to find heavy metals in those seasonings too; https://www.consumerreports.org/health/food-safety/your-herb... IE Oregano is flagged across the board on the report.replyvalarauko 15 hours ago | root | parent | prev | next [–]tbf lead testing is pretty standard in Indian spice brands for a long time now, though for some reason the brands don't really advertise it. Reputable brands like MDH and Everest would be pretty safe.replysidewndr46 15 hours ago | root | parent | prev | next [–]What is an ABCD?replysbierwagen 15 hours ago | root | parent | next [–]https://en.wikipedia.org/wiki/American-Born_Confused_Desireplyprincevegeta89 12 hours ago | root | parent | next [–]Lol, I never knew there was a Wikipedia article for this slang acronym that we use all the time.replysbierwagen 6 hours ago | root | parent | next [–]Wikipedia has been backfilling slang terms lately, in competition with urbandictionary and knowyourmeme. See https://en.wikipedia.org/wiki/Cheugy https://en.wikipedia.org/wiki/OK_boomer https://en.wikipedia.org/wiki/L%2BRatio etcreplysmcin 1 hour ago | root | parent | next [–]Hopefully only the legit subset of urbandictionary.replybrianpan 12 hours ago | root | parent | prev | next [–]See also ABC: https://en.wikipedia.org/wiki/American-born_Chinesereplysidewndr46 15 hours ago | root | parent | prev | next [–]Oh wow, I've seen this without knowing it had a name.replyvictor106 11 hours ago | root | parent | prev | next [–]Is it considered offensive to use that? Just trying to make sure I don’t run into any issues during these “woke” times.replyEisenstein 10 hours ago | root | parent | next [–]'Woke' is a very loaded word. A heads up that if you use it in the way you just did, people will assume certain things about you. Unless you don't care, in which case continue so that everyone knows what assumption they should make.replyCthulhu_ 52 minutes ago | root | parent | next [–]I mean to avoid using it, the parent could have rephrased it as an \"I don't want to offend anyone\". That's not \"woke\", that's decency.replyimran0 19 minutes ago | root | parent | next [–]> I don't want to offend anyone.I like your intention, but that is impossible.replyworthless-trash 8 hours ago | root | parent | prev | next [–]I don't think you can assume someones internal views by use of word, especially such a term with a complex history that means different things to different people.The way you present it seems to have more problems than the 'not care' use case.replyEisenstein 7 hours ago | root | parent | next [–]You can debate all you want the merits of it. I am stating a fact.replyconcordDance 2 hours ago | root | parent | next [–]Some people will assume X and some will assume Y and the majority won't bother to assume anything.replyworthless-trash 2 hours ago | root | parent | prev | next [–]I wasn't debating.replyDropInIn 6 hours ago | root | parent | prev | next [–]The quotation marks denote a very specific form of usage, one that generally implies a disregard/disrespect for those who use the word legitimately.Using the word isn't the issue, it's How you use it.Like using the word Jew. It's fine if you're saying \"I'm a Jew\" but not fine if you say \"Get a load of that Jew over there\".Is that clear enough?replyimran0 4 hours ago | root | parent | next [–]> Like using the word Jew. It's fine if you're saying \"I'm a Jew\" but not fine if you say \"Get a load of that Jew over there\".Very fitting comparison, considering \"wokism\" is a pseudo-religion.replylostlogin 4 hours ago | root | parent | next [–]It’s funny, I’d have said that calling everything woke or seeing wokeness everywhere was a pseudo-religion.Criticising something is fine, but doing it by calling the issue ‘work’ just doesn’t seem to add to any argument.replyinferiorhuman 1 hour ago | root | parent | next [–] doing it by calling the issue ‘work’ just doesn’t seem to add to any argument.Well that's what they get for typing with their fingers covered in pudding.replylynx23 4 hours ago | root | parent | prev | next [–]People will also assume things about you if you are triggered by \"woke\" so easily as to lecture a stranger about its supposed usage.replyEisenstein 2 hours ago | root | parent | next [–]Do you agree that 'woke' is a loaded word?Do you agree that by using that word in that way it signals a certain type of political/ideological viewpoint?Do you agree that if someone did not want to signal that viewpoint it they should know?replylynx23 1 hour ago | root | parent | next [–]No, No, and No. Simply because I dont agree with language police, as a principle.replyEisenstein 1 hour ago | root | parent | next [–]You can call things 'language police' all you want, but assumptions are based on reality and experience, and pushing back when they are obviously true is silly.replylynx23 1 hour ago | root | parent | next [–]> reality ... experience ... obviously true ... sillyAnd you seriously believe this condescending way of talking down to people is great? Your choice, your opinion. Maybe reality will catch up, maybe you will catch up with reality, time will tell.replyEisenstein 54 minutes ago | root | parent | next [–]You call people 'triggered' to make a point. I think I feel the condescension towards you is justified.replylynx23 41 minutes ago | root | parent | next [–]Great, as a person with a disability, I am used to patronizing people like you. Go ahead, and get lost.replyconcordDance 2 hours ago | root | parent | prev | next [–]This has gotten ridiculously meta...replyIggleSniggle 1 hour ago | root | parent | prev | next [–]Whether or not something is offensive almost always depends on context. Knowing your context requires careful listening and respect for those around you. This is true regardless of whether or not you use one particular term or not.If you do not intend to be respectful, then was there ever any issue in the first place? Your disrespect will be conveyed regardless.If you do intend to be respectful, then you will know if using it is offensive or not in your given context.replyaflag 1 hour ago | root | parent | next [–]> If you do intend to be respectful, then you will know if using it is offensive or not in your given context.It's very easy to intend to be respectful but misread the context. Also, there are words that are so taboo they are not ok in any context.I find it particularly hard to navigate the English taboos from a non native perspective. I believe the person asking wants to know how the word is seen by others, which is great in my opinion. Direct communication is much better than trying to guess.replyIggleSniggle 1 hour ago | root | parent | next [–]I agree, and am merely encouraging this direct communication to be used with those you are directly speaking to. When it comes to things like this, there might be some broad understanding, but it doesn’t necessarily apply to the person you are speaking to.replyinferiorhuman 1 hour ago | root | parent | prev | next [–] I believe the person asking wants to know how the word is seen by others, which is great in my opinion. Unlikely. Their tell is: these “woke” timesreplynirav72 7 hours ago | root | parent | prev | next [–]I'm an ABCD and never found it offensive , since I refer to myself as one and it's a non-issue if another ABCD uses to refer to me with that term. But it can be offensive to some if it comes from non-ABCDs. Usually in those cases, its perceived as a pejorative. (Personally it has never bothered me. But some can be sensitive to it)replycortesoft 8 hours ago | root | parent | prev | next [–]I think it is one of those terms that can only be used to refer to yourself.replysidewndr46 15 hours ago | parent | prev | next [–]This reminds me of how scurvy was apparently well known in the age of sail but sort of forgotten with the industrial revolution. It showed back up again in Arctic expeditions from what I understand.replyhinkley 14 hours ago | root | parent | next [–]I don't recall where the the Arctic expeditions slot into this saga, but for ages we understood the lemon link but we hadn't identified Vitamin C yet.So there was a moment in time where the British Royal Navy was carrying around concentrated lime juice to fight scurvy (hence, Limey). Only the vendor that made the lime juice processed it in copper vessels, destroying most of the vitamin C.It doesn't take much vitamin C to prevent scurvy. But it does take some.replydurkie 14 hours ago | root | parent | next [–]There was a competing theory that scurvy was prevented by eating fresh meat, and that's easier to get in the arctic: https://idlewords.com/2010/03/scott_and_scurvy.htmreplysomenameforme 5 hours ago | root | parent | next [–]If it's not clear (as the article also mentions this), fresh meat does prevent scurvy! Many, if not most animals, internally produce their own vitamin C and so fresh meat is often loaded with vitamin C. Here's a table listing vitamin C content for various meats. That site separates fish from meat, so you need to change the combobox to also see those data.[1] - https://tools.myfooddata.com/nutrient-ranking-tool/Vitamin-C...replyhinkley 14 hours ago | root | parent | prev | next [–]> Vitamin C can be destroyed by heat and light. High-heat cooking temperatures or prolonged cook times can break down the vitamin. Because it is water-soluble, the vitamin can also seep into cooking liquid and be lost if the liquids are not eaten.In \"The Terror\" (A supernatural horror story by Dan Simmons, set in the lost Franklin expedition) it is raw meat that saves the indigenous people from scurvy. Which is probably not too inaccurate.replymjan22640 2 hours ago | root | parent | prev | next [–]IIRC the arctic expeditions found it to be 10mg a dayreplyyndoendo 14 hours ago | root | parent | prev | next [–]\"The Accidental Scientist: The Role of Chance and Luck in Scientific Discovery\" talks all about the different substances tried to prevent and cure scurvy. British sailors turned to have a daily ration of rum mixed with the lime juice.replybsder 12 hours ago | root | parent | prev | next [–]I seem to remember that it was also a switch to a different citrus fruit which had way less vitamin C in it so the processing was much mroe important.However, since the switch corresponded to the rise of steam power (ship trips were much faster), nobody noticed that that they weren't protected from scurvy anymore.It wasn't until the artic expeditions that scurvy protection got tested again.replyxaedes 10 hours ago | root | parent | next [–]They believed the scurvy protection came from the sourness of lemons, so they switched to lime which is even more sour than lemon, but contains less vitamin C.replyflyinghamster 9 hours ago | root | parent | prev | next [–]Or, the link between white rice and beriberi: https://www.atlasobscura.com/articles/rice-disease-mystery-e...replyzajio1am 12 hours ago | parent | prev | next [–]> actually the next suspect should be red chillis, adulterated with lead oxide.Why would anyone adulterated red chillis with lead oxide instead of perfectly safe iron oxide, common food colorant?replybastawhiz 12 hours ago | root | parent | next [–]I don't know for sure, but I'd suspect it's the flavor: iron oxide tastes metallic, lead oxide tastes somewhat sweet. That's partially why you hear about kids eating lead paint chips and not bits of rust.replyNatsu 15 hours ago | parent | prev | next [–]What sort of test would you do for this? Did you have to buy a test kit?replyrikelmens 15 hours ago | root | parent | next [–]1. The Water Test: Take a glass of warm water and add a teaspoon of your turmeric powder to it. Let it sit for 10-15 minutes. If the turmeric powder settles down, it is pure. If it doesn’t settle to the bottom and leaves a dark yellow colour, it is adulterated.2. The Palm Test: Take a pinch of your turmeric powder and rub it into the palm of your hand for a few seconds, then turn your palm over. Pure turmeric will stick to your palm and leave a yellow stain, whereas adulterated turmeric will mostly fall off.replyed25519FUUU 14 hours ago | root | parent | next [–]Wouldn’t lead contamination cause the turmeric to sink?replySideburnsOfDoom 14 hours ago | root | parent | next [–]Lead Chromate, not Lead.But apparently it's also not very soluble in water, so the question about sinking stands.Possibly, a chemical powder is much finer than a ground-up plant matter, and takes longer to settle.https://en.wikipedia.org/wiki/Lead(II)_chromate#Safety_hazar...replyliteralAardvark 14 hours ago | root | parent | next [–]I've actually had a successful test with the water method. The lead coloring shows immediately and remains dissolved or in suspension or whatever for days, possibly forever. Turmeric doesn't usually color water at all.replyTozen 13 hours ago | root | parent | next [–]There are youtube videos showing how to do the turmeric test with water. Definitely, everyone that uses it, should know this.https://www.youtube.com/watch?v=tXWPf0HQd5U(Testing Turmeric Powder adulteration with Artificial Color)replycolordrops 12 hours ago | root | parent | next [–]I just tried this test with some turmeric powder I had at home and it failed according to what is shown in the video. I happened to have a lead testing kit, and it doesn't have lead though. The powder does have some ginger and other herbs in it, so apparently harmless adulterants other than lead can cause it to fail this visual test.replyEisenstein 10 hours ago | root | parent | next [–]Have you checked that test with known lead chromate to rule out test error?replycolordrops 10 hours ago | root | parent | next [–]Good idea...replyhackerlight 10 hours ago | root | parent | prev | next [–]Where can I find a source for your first point? This site[1] mentions this test as a way to detect adulteration by artificial coloring in turmeric powder, not adulteration by lead.replysowbug 9 hours ago | root | parent | next [–]I think the point (at least the one I gathered from the article) is that turmeric is sometimes artificially colored to make it the right shade of yellow, and that lead is in the chemical often used for that coloring. Thus, evidence of artificial coloring is a heuristic for presence of lead.I suppose your turmeric could fail the test, and you could decide that the failure is not a sufficient proof of lead presence, because it might be a different lead-free artificial coloring that caused the test failure. That is absolutely your right to decide.replyvalarauko 15 hours ago | root | parent | prev | next [–]I recall we did simple tests like this in school - we had to bring in samples of foodstuffs from home to do the tests, and the school would provide a positive control. This must have been the seventh grade or so?https://www.vasantmasala.com/blog/how-to-check-adulteration-...replyHarryHirsch 13 hours ago | parent | prev | next [–]inadvertent contamination with Argemone plants growing in mustard fieldsYou sometimes still see mustard advertised as \"argemone-free\". To think that some people in the US voluntarily drink yellowroot tea because apparently it helps with diabetes is scary - the chemical similiarity between sanguinarine in argemone and berberine in yellowroot is just too great for it to be a good idea.replyinterroboink 13 hours ago | root | parent | next [–]I don't know anything about the tea you refer to, but \"the chemical is similar\" is not a great signal, IMO. You can even have the exact same chemical with different chirality having dramatically different effects on the body (eg: l- and d- methamphetamine, and plenty of others).Not saying it has 0 relevance, but I wouldn't take it to mean much on its own. It's like people being scared of mercury dental fillings because \"it has mercury in it, which is poisonous.\" That doesn't follow.replycivilitty 12 hours ago | root | parent | next [–]Knee-jerk reactions like that aren't helpful with biological compounds. In this case they're both benzophenanchridine/isoquinoline alkaloids with the same functional groups: a methylenedioxy bridge and at least one methoxy group.L- and D-methamphetamine are a rather unique case because their enantiomeric forms have different effects on the central and peripheral nervous systems. They're much more different from each other structurally than berberine is from sanguinarine.replyvalarauko 13 hours ago | root | parent | prev | next [–]> You sometimes still see mustard advertised as \"argemone-free\"This was a response to the 1998 outbreak. I remember in the early days it was suggested the culprit was argemone poisoning, and honestly that's what I thought it was all this time. Wikipedia suggests it was adulteration with white petroleum.replykazinator 3 hours ago | parent | prev | next [–]It's not real knowledge until some white person from a prestigious foreign university visits and works it into their Ph. D. thesis.replybrabel 3 hours ago | root | parent | next [–]One would think that they could've solved the mystery easily without such white woman if everyone knew about that, but apparently one would be wrong. Generations of people poisoned by this practice and everyone was just fine with it?replyconcordDance 2 hours ago | root | parent | next [–]Don't take an article like this at face value, they will omit any complicating or narrative disruptive facts and will often mislead with regards to cause and effect or timing (via omission or phrase juxtaposition).replynatdempk 16 hours ago | prev | next [–]See also \"Ground Turmeric as a Source of Lead Exposure in the United States\": https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5415259/The problem with lead in tumeric seems to extend beyond Bangladesh.replyCoastalCoder 16 hours ago | parent | next [–]Yikes.Are their any trustworthy, mainstream sources of spices in the U.S.?E.g., if I buy turmeric from Walmart or Whole Foods, can I safely assume that they're monitoring the product streams for lead?EDIT: I just saw a sibling comment about a company named \"American Turmeric\". I'm curious about more mainstream sellers, who might possibly monitor other spices as well. I'd prefer to not play whack-a-mole on a spice-by-spice basis.replyperihelions 15 hours ago | root | parent | next [–]- \"E.g., if I buy turmeric from Walmart or Whole Foods, can I safely assume that they're monitoring the product streams for lead?\"You can safely assume absolutely nothing.https://www.consumerreports.org/health/food-safety/your-herb...https://news.ycombinator.com/item?id=29375003 (\"Herbs and Spices Might Contain Arsenic, Cadmium, and Lead (consumerreports.org)\") (2021)- \"The lack of regulation leaves much of the monitoring of heavy metal levels to companies. [Consumer Reports] contacted all the ones with products in our tests to see how they limited heavy metals.\"- \"Of the companies that replied to our questions—Al Wadi Al Akhdar, Costco, Bolner’s Fiesta, Gebhardt, Litehouse, McCormick, Roland Foods, Spice Islands, Target, and Whole Foods—a few said they require their suppliers to have a program for controlling or testing for heavy metals. But only three—Al Wadi Al Akhdar, Bolner’s Fiesta, and McCormick—specifically said they test products in their manufacturing plants for heavy metals.\"replyzdragnar 10 hours ago | root | parent | next [–]I've always wondered to what extent I've been doing myself a disservice by buying McCormick- surely the cheap powdered stuff isn't able to compete on flavor- but seeing this makes me glad my budget sense beats my foodie sense.replyTedDoesntTalk 13 hours ago | root | parent | prev | next [–]ConsumerLab tested many brands of both spice and supplement for lead, arsenic, cadmium, and mercury, and published the amounts they found in each brand:https://www.consumerlab.com/reviews/turmeric-curcumin-supple...Paywallreplyasdff 9 hours ago | root | parent | next [–]What an article to put behind a paywallreplyperihelions 9 hours ago | root | parent | next [–]If you want food safety inspection results to be paywall-free, make your government do them.replyjorvi 10 hours ago | root | parent | prev | next [–]I don’t understand. If someone gets lead poisoning from regularly using a spiked batch of theirs, can’t they sue the everlasting piss out of these companies?replyautoexec 1 hour ago | root | parent | next [–]It'd be impossible to prove that the poisoning was from the lead in any one manufacturers food. Lead contaminates everything around us. Americans have been spoon feeding lead and other heavy metals directly into the mouths of their infant children for ages (https://www.cbsnews.com/news/baby-food-toxins-government-rep...). Only recently has the FDA even come up with non-binding guidelines on how much poison companies can put into baby food.The harm is cumulative, and so singling out any single company or product as the one who put you over the \"tipping point\" to some set of symptoms is next to impossible and any corporation you tried to take to court would likely have a team of high paid lawyers so good luck convincing a carefully selected jury.I'm not saying we shouldn't be able to sue companies into the ground for mass poisonings, but even when we can prove a company poisoned us, AND can prove that they knew they were doing it, AND even when we can prove they tried to cover that fact up so they could make more money by doing it, companies haven't ever faced meaningful consequences. Not the tobacco industry, not DuPont, certainly not spice manufacturers.replyUberFly 16 hours ago | root | parent | prev | next [–]After reading that article I personally won't trust any I buy from anywhere unless it's from a reputable source and actually states that it's tested/lead-free. Yikes.replyklipt 13 hours ago | root | parent | next [–]\"Lead free\" may be impossible, there is natural levels of lead in the soil that is taken up by plants.However there's orders of magnitude difference between those natural levels, and adulterated spices with lead deliberately added for coloring.Try googling the lead content of an average carrot, for example.replydunham 16 hours ago | root | parent | prev | next [–]I buy from thespicehouse.com - they seem to be careful, but I haven't inquired about turmeric. I should send them an email. (I prefer them over Penzey's, which is the same family, because they have dried fenugreek leaves.)replyRhodesianHunter 12 hours ago | root | parent | next [–]If you don't have or provide any insight into their testing processes, I don't think a recommendation is relevant here.replymarze 2 hours ago | root | parent | prev | next [–]I emailed Bill Penzey a few years ago, asking if they did testing for lead in their turmeric, got no response.replyEricE 14 hours ago | root | parent | prev | next [–]seconded - high quality and friendly service. Hard to ask for more.replyautoexec 1 hour ago | root | parent | next [–]Unless you maybe want to ask for proof that they test their products for lead. That seems pretty easy.replyx0x0 12 hours ago | root | parent | prev | next [–]I buy from there too.Here's their answer and it's disappointing. tl;dr: they import the whole spice and have it ground in the US.https://www.thespicehouse.com/pages/ingredients-and-allergy-...forget trusted suppliers; they should be running lab tests on random samplesreplysalad-tycoon 15 hours ago | root | parent | prev | next [–]Some supplement companies/nootropic companies purport to do 3rd party certificate of analysis with microbe, and heavy metal testing. You can find them on Reddit. Can you believe the companies? I kinda do.replycitruscomputing 10 hours ago | root | parent | prev | next [–]If they don't publish them, email and ask for a COA (certificate of analysis) with heavy metal data. If you know your lot #, include that too. It's not perfect, you're trusting not only the company but wherever they sourced their spices from, but they DO have the info, and it's better than nothing. p.s. \"random\" testing is a joke. Also will second the burlap and barrel rec for turmeric specifically. Source: worked in spices for a bit.replyLetThereBeLight 16 hours ago | root | parent | prev | next [–]Burlap and Barrel I believe has a good reputation with their spice sourcing.https://www.burlapandbarrel.com/products/turmericreplynatdempk 16 hours ago | root | parent | prev | next [–]Yeah I've also been wondering this. Would love it if anyone has similar knowledge, especially about other spices beyond Tumeric.replyTedDoesntTalk 13 hours ago | root | parent | next [–]I posted this above. ConsumerLab does this testing on all sorts of products and foods. They are a non-profit. The annual fee you pay supports the research and testing directly.They tested many brands of both spice and supplement for lead, arsenic, cadmium, and mercury, and published the amounts they found in each brand:https://www.consumerlab.com/reviews/turmeric-curcumin-supple...Of great importance lately was their discovery of benzene in many common sunscreens which forced many product recalls. I used their findings to change brands for my entire family.replyCoastalCoder 8 hours ago | root | parent | next [–]Thanks for the ConsumerLab pointer.The link you provided doesn't work for me. Is [0] the right article?[0] https://www.consumerlab.com/reviews/turmeric-curcumin-supple...replyTedDoesntTalk 8 hours ago | root | parent | next [–]Sorry:https://www.consumerlab.com/reviews/turmeric-curcumin-supple...replyMengerSponge 12 hours ago | root | parent | prev | next [–]Spicewalla (out of Asheville) should be reputablereplybigbillheck 14 hours ago | root | parent | prev | next [–]It's hard to go wrong with Penzey's : https://www.penzeys.com/pages/consumer-reportsreplyEricE 14 hours ago | root | parent | next [–]Only for half of the company, according to their CEOreply_adamb 16 hours ago | root | parent | prev | next [–]If you're consuming it as a supplement it's a lot cheaper (and safer) to just make it yourself. The process is basically: cut it up into thin slices, dry it out in the oven, grind it up.If you're not taking it in supplement quantities, then I'm not sure I'd be tremendously worried about any other contamination...replylisasays 16 hours ago | root | parent | next [–]Doesn't help at all if the roots themselves are dusted, as per the article. Right?reply_adamb 15 hours ago | root | parent | next [–]Good question. Most turmeric roots I've bought aren't nearly as bright orange as the powered stuff. I _assume_ that means they're not applying the same chromate brightening agent but it's not impossible.I guess I'll have to start growing it myself...replytestfoobar 11 hours ago | parent | prev | next [–]A few more:\"Lead in Spices, Herbal Remedies, and Ceremonial Powders Sampled from Home Investigations for Children with Elevated Blood Lead Levels — North Carolina, 2011–2018\": https://www.cdc.gov/mmwr/volumes/67/wr/mm6746a2.htm\"Analysis of Lead in Spices Obtained from Bulk Food Stores\" (PDF): http://libjournals.unca.edu/ncur/wp-content/uploads/2021/02/...\"Heavy Metals in Cultural Products\": https://www.epa.gov/children/heavy-metals-cultural-productsreplycamgunz 15 hours ago | parent | prev | next [–]Yeah! I read this maybe a couple years ago and now lead test anything w/ turmeric in it (tea, actual turmeric, etc.) Haven't come up positive yet though, thank goodness.Can recommend just lead testing things. Test kits are cheap, it's very easy to do, you really want to know if you're eating/drinking lead (especially if you have kids). Also can recommend getting a water filter. It doesn't really fix dishwashing but for drinking or making things w/ water it's very easy -- you can get pretty big tanks where you could conceivably even make a pot of spaghetti and such.replyelzbardico 14 hours ago | root | parent | next [–]Where can I find those test kits?replyTedDoesntTalk 13 hours ago | root | parent | next [–]Amazon. There are even strips. Now can we trust the manufacturer of the tests themselves given amazons sometimes shitty vendor quality? Who knows.replymasfuerte 8 hours ago | root | parent | next [–]I have a gas engineer test my appliances every year. Last year he also fitted a CO alarm and he said he would test it every year. I asked if he had a CO aerosol to test the alarm. No, he said, I just press the button. Who knows if the alarm actually detects CO? Anyway, if you want to test your lead test, introduce it to some lead.replyTozen 13 hours ago | prev | next [–]People and companies knowingly contaminating food products with poisons like lead, should be put in jail. Companies knowingly selling such products, should be at least heavily fined, possibly prosecuted as well. Bottom line, this is clearly poisoning (and killing people) to make a few extra bucks. There should be no leniency whatsoever for this clear evil.replyGigachad 9 hours ago | parent | next [–]https://en.wikipedia.org/wiki/2008_Chinese_milk_scandal54,000 hospitalized and 6 dead from intentional milk contamination> A number of trials were conducted by the Chinese government resulting in two executions, three sentences of life imprisonment, two 15-year prison sentences, and the firing or forced resignation of seven local government officials and the Director of the Administration of Quality Supervision, Inspection and Quarantine (AQSIQ). The former chairwoman of China's Sanlu dairy was sentenced to life in prison.replyautoexec 1 hour ago | root | parent | next [–]China does a lot of things wrong, but they're closer to right than the US on this stuff!replyitsoktocry 12 hours ago | parent | prev | next [–]>There should be no leniency whatsoever for this clear evil.Normally I'd call this sort of language hyperbolic, but in this case I'm not sure it is.You know people are consuming this product. Literally poisoning people to save a few dollars? It's inexplicable.replymkoubaa 12 hours ago | root | parent | next [–]Jail is too lenient, this is the sort of offence where I want to see heads on spikesreplyajmurmann 10 hours ago | root | parent | next [–]This sounds extreme, but someone is destroying the health of and potentially killing thousands of people to safe a small amount of money. It's hard to think of a worse crime. I wonder if this is similar to the old adage that one death is a tragedy and a thousand are a statistic. If someone violently kills a single person and we learn all the details, in some places they'll face capital punishment. You low-key poison thousands of people and jail is suddenly controversial.replycolechristensen 10 hours ago | parent | prev | next [–]A corporation of any size caught doing this with any amount of knowing about it (i.e. not sabotage by a troubled lone wolf) should be seized, sold for parts, and the proceeds from the fire sale going to the victims and if anything is left over afterwards, the state.There is no fine value appropriate that isn't \"considerably more than the company is worth\" for that kind of blatant violation.You should not get to continue to exist after poisoning people for profit margin.replynewaccount74 15 hours ago | prev | next [–]I don't understand how lead pigments are still legal in some parts of the world at all. What kind of things need a bright yellow color that will slowly poison you if you touch it?Also, those handheld XRF spectrometers are amazing tech. I wish they were more affordable.replynotjulianjaynes 6 hours ago | parent | next [–]Lead pigments are still legal in the United States[1], and were only banned in the EU a few years ago[2].[1] https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4434842/[2] https://speciation.net/News/EU-court-rules-Commission-author...replyjabl 2 hours ago | root | parent | next [–]In Europe, many countries banned lead paints for household use already in the 1920'ies or even earlier. In 2003 there was an EU wide harmonization outlawing lead paints. The article you linked to is apparently about some lawsuit where the EU commission had allowed an exception to this.replyadamwong246 14 hours ago | parent | prev | next [–]> \"Why? For the same reason our reactors do not have containment buildings around them, like those in the West. For the same reason we don't use properly enriched fuel in our cores. For the same reason we are the only nation that builds water-cooled, graphite-moderated reactors with a positive void coefficient. It's cheaper.\" ~ Valery Legasov, Chernobylreplyasdff 9 hours ago | root | parent | next [–]USSR could have really been something if only they adopted the US model of just not saving moneyreplyasdff 9 hours ago | parent | prev | next [–]A lot of oil paint for fine art contains heavy metals.replydb48x 5 hours ago | root | parent | next [–]And a layer of varnish over the top so that you can’t even touch the paint, even if you are rude enough to try.replyperihelions 15 hours ago | prev | next [–]The broad outline of these facts has been known for decades (that spice processors intentionally adulterate turmeric with the yellow pigment, lead chromate). These are sold in the First World as well, and are culpable e.g. for acute lead poisoning in children in the USA:https://www.bu.edu/sph/news/articles/2017/high-levels-of-lea... (2017)- \"The study, in Public Health Reports, the official journal of the US Public Health Service and the US Surgeon General, also describes several cases of child lead poisoning in the US that have been linked to consumption of spices, including turmeric.\"replyMathMonkeyMan 16 hours ago | prev | next [–]> To mask flawed turmeric, some processors began dusting the roots with lead chromate — an orange-yellow industrial pigment used to color plastics and furniture.replylondons_explore 13 hours ago | parent | next [–]I don't really want lead in my plastic or my furniture either...In fact, I think there would be a good case for simply banning all mining of lead. Nearly all remaining uses of it (bullets, roof flashing, counterweights, car batteries) seem to still have a pretty high risk of contamination of either the environment or the workers who make or recycle products.replyathenot 8 hours ago | root | parent | next [–]It's used medically, for example for nurses and doctors who work with radioactive tracers; they wear big aprons with lead in it which absorb any radiation that would be ok once in a while but that you don't want exposed to every single day at work.replylondons_explore 1 hour ago | root | parent | next [–]True - but lead doesn't actually perform much better than say steel, per unit weight.replyno_butterscotch 16 hours ago | prev | next [–]I wonder if this turmeric spread and was sold in the West. My mother recently started taking \"golden turmeric\" and insists that it's a cure for a lot of ills. Maybe that's true I don't know, she sent me some articles a couple years ago. It was clear that she was influenced by Facebook groups.Hopefully the turmeric she takes is safe :(replymorsch 15 hours ago | parent | next [–]Fwiw a study done in Germany in 2022 found no traces of lead in 19 turmeric products of all price ranges.https://www.oekotest.de/essen-trinken/Kurkuma-Labor-findet-M...replynatdempk 16 hours ago | parent | prev | next [–]If you want to be extra safe, you can buy some for her from a safer supplier like: https://www.americanturmeric.com/lead-free-turmericreplyperihelions 15 hours ago | root | parent | next [–]They expect us to be swayed by a stock photo of a laboratory?https://www.americanturmeric.com/how-we-test-our-turmeric (\"Laboratory Results - Buy With Confidence\")https://www.dreamstime.com/stock-image-laboratory-image24729... (\"Royalty-Free Stock Photo: Laboratory with many operated science instrument [sic] and computer\")replynatdempk 14 hours ago | root | parent | next [–]It's a stock photo used on a website, did you expect them to go to the actual laboratory they worked with and take one?I have no affiliation here, but they even listed the company they used for testing so presumably you could call/email them if you want further confirmation. None of this seems unreasonable to me, and I don't think a stock photo is a gotcha for product quality.replylondons_explore 13 hours ago | root | parent | next [–]Many online sellers post a photo of their factories and workers as a way to demonstrate quality - ie. \"look, we make out products with big expensive modern machines, not children doing it by hand\". Some aliexpress sellers even post 20-30 pictures of different parts of the production process.Posting a stock photo is trying to defraud buyers who expect to see the factory it is made in.replyperihelions 14 hours ago | root | parent | prev | next [–]There's a lack of forthrightness in publishing a stock photo without a disclaimer. \"Lack of forthrightness\" is an anti-signal. Stock photography on a commercial website is an anti-signal.replymaximinus_thrax 13 hours ago | root | parent | next [–]> Stock photography on a commercial website is an anti-signalWhere do you expect stock photography to be used? Only in mock-ups and design pitches?replypengaru 13 hours ago | root | parent | next [–]> Where do you expect stock photography to be used? Only in mock-ups and design pitches?As if something's existence alone justifies its (mis)use...I'm reminded of the Invader Zim Hamstergeddon episode when the tanks arrive and one of the soldiers shouts \"We've gotta use this stuff on something!\"replyitsoktocry 12 hours ago | root | parent | prev | next [–]>They expect us to be swayed by a stock photo of a laboratory?I don't think any picture of a lab would have any meaning to me, whatsoever. Is the product legit tested? That's all that matters. I don't care what the lab looks like.replyvalarauko 15 hours ago | parent | prev | next [–]I suggest asking your Indian friends where they buy their spices from, and check out your local Indian grocery store - the spices are from major Indian brands and undergo a lot of testing, with additional certification for export to the US.replyitsoktocry 12 hours ago | root | parent | next [–]>check out your local Indian grocery store - the spices are from major Indian brands and undergo a lot of testing, with additional certification for export to the US.Well, uh, I'm no expert, having just read about this here, today. But what you are saying flies in the face of half of the comments here, doesn't it? What makes you sure that the \"local Indian grocery store\" is getting high-quality, tested spices?replyvalarauko 9 hours ago | root | parent | next [–]Let's take one of the source studies linked in other comments and investigate:https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5415259/The product recalls mentioned are all American brands, and their origin is unspecified - other than South Asia, turmeric is also exported from China, SE Asia, the Caribbean and South America. In the absence of FDA guidelines on lead levels in spices, this study has used the lead levels in candy as the threshold (0.1 ppm) The study also highlights a previous case study in Boston where 4 pediatric cases had lead exposure - of the 4, only one had detectable lead in the family's turmeric - at a level of 1.4 ppm. This was a 12-month-old baby, so wasn't consuming the turmeric, and the case study doesn't suggest he was.The Indian food safety standards restrict lead in spices to below 2.5 ppm, with turmeric especially tested for lead chromate (FSSAI standards allow lead upto 10 ppm (!!!) in turmeric, while AGMARK allows only upto 2.5 ppm). Turmeric being exported from India to the USA has several additional mandatory certifications required, for other dyes like Sudan I - IV, aflatoxins, pesticides, etc. Since the FDA has no limits published on lead, the Indian limits of 2.5 ppm probably apply. Is that an acceptable level? Probably not great, and there is no safe level of lead. However, lead will show up in any agricultural product, so we need a reasonable 'acceptable' range. For me and most other Indians who consume turmeric on a daily basis, we defer to the Indian certifications.replymore_corn 16 hours ago | parent | prev | next [–]Just convince her that it’s more magical (er, healthy) if she buys it fresh and grinds it herself.It actually tastes better that way, richer and more earthy.It does leave your fingers stained, but that is actually a benefit since it is a conversation starter.replydenton-scratch 10 minutes ago | prev | next [–]There's too much padding in the article.TL;DR Lead is bad for you; shoppers don't like turmeric that isn't yellow; processors dust off-colour turmeric with lead chromate to make it look yellow.replybakul 15 hours ago | prev | next [–]They could have just asked.... Most who grew up in the subcontinent know this.replyEricE 14 hours ago | parent | next [–]Yeah, but then they couldn't have wrote a multi-page flowery article about how smart they were interspersed with social justice. What fun would that be?replywolpoli 12 hours ago | parent | prev | next [–]So they leveraged the Stanford name and got the government to pay attention and take actions. That's great for the people in Bangladesh but still, it's not groundbreaking research that they made it out to be.replyCoastalCoder 16 hours ago | prev | next [–]Interesting article. One thing I'm left wondering though is: for the offending vendors, how aware were they of the potential harm they were causing?IMHO the punishment should, in some sense, scale with that detail.As a parent, if I found out that someone was knowingly poisoning my children for profit, I'd have some very uncharitable urges.replybee_rider 15 hours ago | parent | next [–]Maybe to some extent it should scale with that detail. However, to some extent everyone in the food processing chain has a responsibility to be diligent and competent, right? If we let people off the hook for not knowing the quality of their suppliers, and finding out is expensive, then we’re applying a filter in favor of incompetence.replyslumberlust 11 hours ago | root | parent | next [–]This behavior is pervasive across all industry. If profit is the sole motivator, public opinion or insubstantial fines are not enough of a deterrent.replyno_butterscotch 16 hours ago | parent | prev | next [–]I do wonder if some of the dirt poor street-vendors were \"in on it\" or just the fall-guys.replyalephnerd 16 hours ago | root | parent | next [–]It's bought wholesale at Mandis/Markets. Any kind of lead adulteration probably happened with the Spice Distributor (either the spice distributor or the wholesaler). If you are a street food vendor, your margins are low so you would probably go for the cheaper alternative.The price of turmeric across SAARC also skyrocketed due to higher than average rainfall in MH+TG along with skyrocketing \"Western Hipster Superfood\" demand, which has a carryover effect to the Bangladesh and Nepal markets.Farms -> Trader -> Wholesale Mandi/Market -> Spice Distributor -> Restaurant/Street Food Vendorreplysnapetom 15 hours ago | prev | next [–]Forsyth's work was submitted here on HN four years ago, if you want to read the study.https://www.sciencedirect.com/science/article/pii/S001393511...They found no elevated lead in Indian samples in their study, but they note Indian tumeric have been subject to lead recalls in the past. And of course, proper and transparent sourcing from manufacturers, is an issue.replyglonq 15 hours ago | prev | next [–]I have a friend who strongly gravitates towards non-traditional solutions for every health & medical problem.Upon hearing that I had developed cancer, she whipped up a batch of turmeric-infused notions and potions for me, which I appreciate. I haven't touched them yet. Maybe I'll get them tested first; the last thing I need right now is lead poisoning!replysn41 9 hours ago | parent | next [–]Oh! I'm sad to hear this... I hope you get well.replybenced 8 hours ago | prev | next [–]I like high quality spices so I buy from places that I have faith can trace their supply chains (all the better if they have testing) but even if you don’t care about quality, you should buy high quality turmeric. Lead poisoning is so bad the amount of money you should be willing to pay to not have it is high.replyyumraj 11 hours ago | prev | next [–]Powdered turmeric can be bright yellow, if the roots are boiled before drying and grinding, or dark/dirty yellow if not boiled since natural color of turmeric is dirty yellow.Costco/Kirkland powered turmeric[0] is one of the rare ones that is dirty yellow, so we generally get that in the hope that it is lead free.[0] https://www.costco.com/kirkland-signature-ground-turmeric,-1...replyhinkley 13 hours ago | prev | next [–]Those who do not learn from history will be exploited by those who do?replymore_corn 16 hours ago | prev | next [–]tl:dr they use a lead based pigment to keep it a vibrant color apparently not knowing that the pigment was lead based.replyTheRealPomax 15 hours ago | prev | next [–]tl;dr: Color matters to turmeric purchasers, and turmeric that is more vibrantly yellow typically sells for higher prices. The Stanford University team learned that this color-linked perception of quality may have started in the 1980s, when a flood interrupted the drying process, turning rhizomes brown and moldy. To mask flawed turmeric, some processors began dusting the roots with lead chromate — an orange-yellow industrial pigment used to color plastics and furniture. From the interviews, Forsyth learned that this coloration step continued for four decades after the flood and that most processors weren’t aware that the pigments were toxicEven tl;dr-er: they color low quality tumeric with lead-based pigments to make it look like high quality tumeric. Like how China spray paints dead grass green. But with more lead.replyWirelessGigabit 13 hours ago | parent | next [–]China? Grass paint is booming business in SoCal. All because they don't realize they live in a desert. People bash on Arizona for spending water when it's super dry but take a look at Southern AZ lawns vs SoCal lawns. The Southern AZ ones are much more adept to the desert.replyTheRealPomax 5 hours ago | root | parent | next [–]Not at the same scale, but sure, I'm perfectly happy to call out SoCal too. Except SoCal sure as hell won't be using lead paint.replyTheRealPomax 5 hours ago | parent | prev | next [–]Fascinating downvotes for a perfectly accurate tl;dr. Not everyone is interested in wading through 1000 words of scene-setting before actually getting to the point.replyheywhatupboys 16 hours ago | prev [–]This article screams \"white american saviour\"WHO in 2023 writes like this??> Food Safety authority representatives, flanked by soldiers in camouflage uniforms, magenta berets and guns slung over their shoulders, strode down the center of a busy street market in Dhaka, the capital city. The crowds parted.> Men riding three-wheeled rickshaws pulled over. Street vendors stopped stirring their aromatic curries. The spice sellers wearing parti-colored lungi skirts fell silent. Some curious merchants, sitting atop stacks of potatoes, ginger, onions and garlic, jumped down to follow the entourage.replyziml77 14 hours ago | parent | next [–]Did you even read the context around that? Everyone involved in the scene described was Bangladeshi. And the point of writing it like a dramatic scene in a movie is made clear in the giant quote and paragraph that follow: it was law enforcement theater. They didn't have the capacity to enforce food safety at the scale necessary, so they used this tactic to instill fear in people who were still using the outlawed lead-based pigment.replyramesh31 14 hours ago | parent | prev | next [–]>WHO in 2023 writes like this??All websites do, as their staff is entirely comprised of 23 year old English majors who equate this style with \"good writing\". The entire internet reads like a C+ sophomore term paper now.replyEricE 14 hours ago | parent | prev [–]So I wasn't the only one that was unimpressed with the flowery anecdotes either?replyGuidelines | FAQ | Lists | API | Security | Legal | Apply to YC | ContactSearch:",
    "hn_summary": "- Turmeric is commonly adulterated with lead chromate, a toxic substance, in Bangladesh.\n- This practice has been known for decades and is a result of the desire for a vibrant yellow color in the spice.\n- The use of lead-based pigments in turmeric poses a health risk, and caution should be exercised when purchasing and consuming turmeric products."
  },
  {
    "id": 36477936,
    "timestamp": 1687775463,
    "title": "JP Morgan fined by SEC for deleting email records",
    "url": "https://www.theregister.com/2023/06/26/jp_morgan_fined_for_deleting/",
    "hn_url": "http://news.ycombinator.com/item?id=36477936",
    "content": "CSOJP Morgan accidentally deletes evidence in multi-million record retention screwup45Fined $4m for Who-Me-esque mess, for which it blames unnamed archiving vendor's retention settingsDan RobinsonMon 26 Jun 2023 // 09:30 UTCJP Morgan has been fined $4 million by America's securities watchdog, the SEC, for deleting millions of email records dating from 2018 relating to its Chase Bank subsidiary.The financial services giant apparently deleted somewhere in the region of 47 million electronic communications records from about 8,700 electronic mailboxes covering the period January 1 through to April 23, 2018.Many of these, it turns out, were business records that were required to be retained under the Securities Exchange Act of 1934, the SEC said in a filing [PDF] detailing its findings.Worse still, the screwup meant that it couldn't produce evidence that that the SEC and others subpoenaed in their investigations. \"In at least 12 civil securities-related regulatory investigations, eight of which were conducted by the Commission staff, JPMorgan received subpoenas and document requests for communications which could not be retrieved or produced because they had been deleted permanently,\" the SEC says.What went wrong?The trouble for JP Morgan can be traced to a project where the company aimed to delete from its systems any older communications and documents that were no longer required to be retained.According to the SEC’s summary, the project experienced “glitches,” with those documents identified for deletion failing to be deleted under the processes implemented by JPMorgan.Troubleshooting? Try trouble overshootingWhen troubleshooting the issue, workers carried out deletion tasks on electronic communications from the first quarter of 2018. This was apparently done under the belief that all the documents were stored in such a way that it would not be possible to permanently delete any records within the 36 month regulatory retention period specified by the Exchange Act.For its part, JP Morgan places the blame squarely on an unnamed archiving vendor that it hired to handle the storage for its communications.The vendor had apparently assured both JP Morgan and the Financial Industry Regulatory Authority (FINRA) on multiple occasions that its media storage complied with the relevant Exchange Act rules regarding the 36 month retention period, and therefore documents falling within that period were protected from deletion.In addition, JP Morgan says that extra coding was applied to mailboxes which were subject to “legal holds” in order to prevent the deletion of documents required to be maintained for other purposes, such as litigation.However, the reality turned out to be otherwise. In June 2019, a team from the Corporate Compliance Technology department was working on the project to delete any electronic communications, which included emails and instant messages that were no longer required to be retained.When the procedures developed by JP Morgan and the vendor failed to delete the appropriate documents, the team tried to troubleshoot the process, running deletion tasks across multiple time periods including emails from January 1 through to April 23, 2018.This was apparently done under the belief that safeguards were in place that would block the deletion of any records that were required to be retained.But it seems the vendor had failed to properly apply the retention setting to the “Chase” domain within JP Morgan, leading to all emails within in it being permanently deleted, save those that were protected by the extra coding on “legal holds.”According to JP Morgan, it only became aware of this in October of 2019 when the company’s legal discovery team found that electronic communications were missing from the early 2018 time period. It reported the incident to the SEC in January 2020.JP Morgan must face suit from Ray-Ban maker after crooks drained $272m from accountsBanks face their 'darkest hour' as malware steps up, maker of antivirus saysEver suspected bankers used WhatsApp comms at work? $1.8b says you're right'Sharp' chip inventory correction looms on horizon, warns investment bankerIn response to the incident, JP Morgan said it had implemented its own 36 month retention coding, and overhauled its operating procedures. These prevent deletion tasks from being run on electronic communications still subject to retention requirements, and also require that any employee seeking to run a deletion task must obtain approval from a senior level information officer.The SEC found that JP Morgan had “wilfully violated Section 17(a) of the Exchange Act and Rule 17a-4(b)(4) thereunder” which require broker-dealers to preserve for at least three years all communications received and copies of all communications sent relating to its business.The company was ordered to cease and desist from committing or causing any future violations, and to pay a penalty of $4 million to the SEC.In a statement, the company told us that: “JP Morgan takes its record keeping obligations seriously. We have taken steps to enhance our process and procedures.” ®Whitepaper: Top 5 Tips For Navigating Your SASE JourneySimilar topicsSysadminMore like these45 COMMENTSTIP US OFFSend us news",
    "summary": "- JP Morgan has been fined $4 million by the SEC for deleting millions of email records dating back to 2018, which were required to be retained under the Securities Exchange Act of 1934.\n- The deletion of these records resulted from a project where JP Morgan aimed to delete older communications and documents that were no longer required to be retained, but glitches in the process caused the deletion of business records that should have been preserved.\n- JP Morgan blames an unnamed archiving vendor for not properly applying retention settings, leading to the permanent deletion of emails within a specific domain. The company has since implemented measures to prevent future violations and enhance its record-keeping procedures.",
    "hn_title": "JP Morgan fined by SEC for deleting email records",
    "original_title": "JP Morgan fined by SEC for deleting email records",
    "score": 331,
    "hn_content": "- JP Morgan has been fined by the SEC for deleting email records that were supposed to be retained for legal reasons.\n- The deletion of the emails was a result of a manual delete request that was made to fix an issue with incomplete deletion.\n- It took 1.5 years for anyone to notice the missing emails, which could have been a bigger problem if they were not retained in backups.\n- The incident raises questions about the handling of data by companies and the lack of enforcement of data handling regulations.\n- The regulatory attention on large companies like JP Morgan is advantageous to startups, as they are not subject to the same scrutiny until they grow.\n- The $4 million fine imposed on JP Morgan has been criticized as a mere slap on the wrist, considering the company's profitability.\n- The incident highlights the need for better data retention policies and practices in the industry, especially for companies that handle sensitive information.\n- This post is special because it sheds light on a major financial institution's data management failure and the potential consequences of such incidents.- JPMorgan Chase accidentally deleted documents that were crucial to ongoing investigations by various regulatory bodies.\n- The deletion occurred due to a mistake made by a third-party vendor responsible for data retention.\n- The incident raises questions about data retention policies and the capabilities of automated deletion tools.\n- The fine imposed on JPMorgan Chase ($4 million) was seen as relatively low compared to the potential damage caused.\n- Some commenters speculate about the possibility of intentional deletion and raise concerns about corruption and lack of punishment in the financial industry.\n- The incident also brings up the controversy surrounding JPMorgan Chase's relationship with Jeffrey Epstein.\n- People are frustrated with the lack of accountability and the perception that large companies can get away with misconduct.\n- Companies should consider implementing better data retention and deletion solutions to avoid these situations in the future.",
    "hn_summary": "- JP Morgan has been fined $4 million by the SEC for deleting email records that were supposed to be retained for legal reasons.\n- The incident raises questions about data handling by companies and the lack of enforcement of data handling regulations.\n- The incident highlights the need for better data retention policies and practices, especially for companies that handle sensitive information."
  },
  {
    "id": 36480122,
    "timestamp": 1687790025,
    "title": "U.S. pedestrian deaths reach a 40-year high",
    "url": "https://text.npr.org/1184034017",
    "hn_url": "http://news.ycombinator.com/item?id=36480122",
    "content": "NPR > NationalU.S. pedestrian deaths reach a 40-year highBy Juliana KimMonday, June 26, 2023 • 5:00 AM EDTA new study paints a grim picture of American roads: every day, 20 people walk outside and end up killed by a moving vehicle.\"There are more pedestrians being killed today than in decades,\" Russ Martin, the senior director of policy and government relations at the Governors Highway Safety Association, told NPR.The organization, which tracks pedestrian deaths in the U.S., estimates that more than 7,500 pedestrians were killed by drivers last year — the highest number since 1981. The final tally may be even greater given that Oklahoma was unable to provide data due to a technical issue.Pedestrian deaths have been climbing since 2010 because of unsafe infrastructure and the prevalence of SUVs, which tend to be more deadly for pedestrians than smaller cars, according to Martin. When the pandemic arrived, there was an even greater surge as empty roads gave way to speeding and distracted driving.The pandemic has waned, but cases of reckless driving — and subsequently the number of Americans killed while walking — has not. The new data, released on Friday, shows the U.S. continues to lag in its effort to improve road safety, even as experts say some solutions are within reach.States below the Sun Belt ranked as having the highest rate of pedestrian deaths in 2022For the seventh year in a row, New Mexico was ranked as the most dangerous state for pedestrians.Arizona and Florida were also placed in the top spots for having high rates of pedestrian deaths in GHSA's estimates.Related Story: A New Jersey city achieved 0 traffic deaths in 4 years with quick, high impact ideasIt is not a coincidence that all three states are situated below the country's Sun Belt. Martin said Southern states tend to see more traffic deaths but it is not exactly clear why.There are multiple theories: in bigger states, communities are more spread out and as a result, people need to drive more to get around, he said. Another possibility is that Southern states have better weather and people spend more time outside.\"This is all just conjecture, but I think it's certainly worthwhile to take a closer look into what's going on in those states,\" he added.Local lawmakers can implement traffic calming measures todayTraffic safety has been an uphill battle in the U.S. for years but there are strategies at lawmakers' disposal to address the crisis today, according to Peter Norton, a professor at the University of Virginia who has studied the history of driving in America.\"The best things we can do will take years, but there are some things we can do now, they don't cost much money and they make a big difference,\" he said.Related Story: America's roads are more dangerous, as police pull over fewer driversFor instance, implementing sharp corners instead of round curves at the end of roads forces drivers to slow down to turn and therefore prevents speeding. That technique, along with adding pedestrian islands and large sidewalk bulb-outs, is known as \"traffic calming.\"Norton said installing speeding and red light cameras can also be effective if they work properly. Adding bike lanes can also keep drivers more alert on the road.Lowering speed limits is also an important step but only if it is enforced and used alongside other safety measures. Norton warned that roads with a mix of different vehicle speeds tend to be more dangerous.There are also some local and regional measures the GHSA pointed to that could help prevent deaths.In Hawaii, police officers are stationed in areas that have seen a higher volume of crashes or foot traffic to look out for reckless driving.And in Idaho, the state's highway safety office gave out walk audits for community members to identify safety concerns on the street. Local officials then use the results to improve the walkability of neighborhoods.",
    "summary": "- Pedestrian deaths in the US have reached a 40-year high, with more than 7,500 pedestrians killed by drivers last year.\n- The increase in pedestrian deaths can be attributed to unsafe infrastructure and the prevalence of SUVs, which are more dangerous for pedestrians.\n- Lawmakers have strategies at their disposal to address the crisis, such as implementing traffic calming measures like sharp corners, pedestrian islands, and bike lanes, as well as enforcing lower speed limits.",
    "hn_title": "U.S. pedestrian deaths reach a 40-year high",
    "original_title": "U.S. pedestrian deaths reach a 40-year high",
    "score": 327,
    "hn_content": "- U.S. pedestrian deaths have reached a 40-year high.\n- The majority of roads are too wide and lack alternative transportation options, leading to frustration and anger from drivers.\n- There have been loopholes in vehicle emission regulations that favor larger SUVs and pickup trucks.\n- The focus on MPG regulations should have been on weight and size rather than fuel efficiency.\n- The rise of SUVs and pickups can be attributed to loopholes in fuel efficiency regulations.\n- Blaming regulations removes agency from people, but manufacturers are also to blame.\n- Individuals have agency, but they behave according to the incentives of the systems they operate within.\n- The size and weight of vehicles are contributing factors to pedestrian fatalities.\n- The weight of a vehicle affects its energy output and potential damage in a collision.\n- It is important to consider the impact of vehicle weight on road infrastructure and maintenance.\n- There are challenges associated with increasing density and creating walkable communities in car-dependent areas.\n- Incremental changes, such as zoning reform, improved public transportation, and active transport options, can make a difference in creating more walkable cities.\n- Convenience stores in different regions offer varied selections, ranging from typical \"convenience store\" items to some grocery and produce options.\n- Densification needs to be done thoughtfully to avoid negative impacts on quality of life.\n- There can be a middle ground between individual houses with gardens and high-rise apartments.\n- Public engagement is important in making changes to zoning laws and infrastructure, but the process can be complicated and slow.\n- Addressing these issues requires a combination of local government actions, public support, and political will.\n- There are cultural differences in how convenience stores are defined and what they offer in different countries.- Increasing rates of pedestrian accidents, injuries, and fatalities in the United States are a cause for concern.\n- SUVs and trucks, with their large size and obstructed visibility, are particularly implicated in pedestrian accidents.\n- Distracted driving, including phone use, is a major contributing factor in pedestrian accidents.\n- Some argue that cities should focus on creating more walkable and bike-friendly environments to ensure pedestrian safety.\n- Zoning regulations and urban planning policies play a role in the design and safety of roadways for pedestrians.\n- The issue of pedestrian safety requires a multi-faceted approach including improved infrastructure, stricter regulations, and increased awareness and education for both drivers and pedestrians.\n- There is a need for further research and data analysis to better understand the factors contributing to pedestrian accidents and develop effective strategies for prevention.",
    "hn_summary": "- U.S. pedestrian deaths have reached a 40-year high.\n- The rise of SUVs and pickups, as well as distracted driving, contribute to pedestrian accidents.\n- To address pedestrian safety, there is a need for improved infrastructure, stricter regulations, and increased awareness and education for both drivers and pedestrians."
  }
]
