[
  {
    "id": 41736903,
    "title": "لماذا يطبع الرجل \"أعطني أعطني أعطني\" في الساعة 00:30؟ (2017)",
    "originLink": "https://unix.stackexchange.com/questions/405783/why-does-man-print-gimme-gimme-gimme-at-0030",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41736903",
    "commentBody": "",
    "originSummary": [
      "اكتشف مستخدم بيضة عيد الفصح في أمر \"man\"، الذي أشار إلى أغنية لفرقة ABBA وتم تفعيله في الساعة 00:30، مما تسبب في فشل الاختبارات.",
      "تمت إزالة هذه البيضة المفاجئة في إصدار man-db 2.8.0 بعد أن وجد بعض المستخدمين أنها تعطل سير عملهم.",
      "تمت إضافة البيضة المفاجئة في الأصل للترفيه ولكن تمت إزالتها للحفاظ على كفاءة سير العمل."
    ],
    "commentSummary": [
      "روى مطور حادثة حيث تُركت عبارة تصحيح فكاهية عن غير قصد في تطبيق الطب عن بعد، واكتشفها مريض، مما أثار نقاشًا حول أهمية وجود علامات تصحيح واضحة وغير مسيئة.",
      "شارك المطورون استراتيجيات لمنع مثل هذه الإغفالات، بما في ذلك استخدام سلاسل محددة أو أدوات أتمتة لتحديد بيانات التصحيح قبل تقديم الكود.",
      "أبرزت المحادثة التوازن بين الاحترافية وإدراج المفاجآت الخفية في البرمجيات، مع وجود آراء متباينة حول مدى ملاءمتها."
    ],
    "points": 772,
    "commentCount": 339,
    "retryCount": 0,
    "time": 1728005151
  },
  {
    "id": 41740965,
    "title": "مولد الأفلام من ميتا",
    "originLink": "https://ai.meta.com/research/movie-gen/?_fb_noscript=1",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41740965",
    "commentBody": "",
    "originSummary": [
      "قدمت Meta AI نموذج Movie Gen، وهو نموذج ذكاء اصطناعي جديد يتيح للمستخدمين إنشاء وتحرير مقاطع الفيديو باستخدام مدخلات نصية بسيطة.",
      "يقدم Movie Gen ميزات مثل توليد مقاطع فيديو عالية الدقة، وتحويل الصور الشخصية إلى مقاطع فيديو، وإنشاء مؤثرات صوتية أو موسيقى تصويرية.",
      "تسلط هذه الابتكارات الضوء على تقدمات Meta AI في إنشاء المحتوى المدفوع بالذكاء الاصطناعي، مما يوفر قدرات دقيقة لتحرير الفيديو وتخصيصه."
    ],
    "commentSummary": [
      "قدمت شركة ميتا أداة Meta Movie Gen، وهي أداة ذكاء اصطناعي مصممة لإنشاء مقاطع فيديو من النصوص المدخلة، مما يعكس تقدمًا كبيرًا في تكنولوجيا الذكاء الاصطناعي.",
      "على الرغم من إمكانياته، هناك مخاوف بشأن إساءة الاستخدام، خاصة في إنشاء التزييف العميق، ويواجه الأداة حاليًا تحديات تتعلق بالاتساق والدقة.",
      "الأداة ليست متاحة للجمهور بعد، ولكن إطلاقها قد يؤثر بشكل كبير على صناعات مثل المؤثرات البصرية (VFX) ولقطات الأرشيف، بينما يثير نقاشات حول تأثير المحتوى الذي يتم إنشاؤه بواسطة الذكاء الاصطناعي على الإبداع البشري."
    ],
    "points": 502,
    "commentCount": 449,
    "retryCount": 0,
    "time": 1728046980
  },
  {
    "id": 41738502,
    "title": "متصفح ويب تجريبي مُحسّن للتعمق في المواضيع",
    "originLink": "https://szymonkaliski.com/projects/cartographist/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41738502",
    "commentBody": "",
    "originSummary": [
      "Cartographist هو متصفح ويب تجريبي يهدف إلى تسهيل البحث المتعمق والاستكشاف من خلال ميزات فريدة مثل الألواح القابلة للتمرير أفقيًا وسجل التصفح المنظم على شكل شجرة.",
      "يسمح للمستخدمين بحفظ وتحميل \"المسارات\" للبحث الجاري، مع التركيز على توليف المعلومات بدلاً من الاحتفاظ بسجل تصفح كامل.",
      "المشروع مفتوح المصدر، مما يشجع على تلقي ملاحظات المجتمع، وهو مستوحى من تصميمات آندي ماتوشاك ونيت باروت، مع التركيز على التصفح بالتفاصيل في السياق."
    ],
    "commentSummary": [
      "كان متصفح ويب تجريبي مصمم للاستكشاف العميق، أو ما يُعرف بـ \"الانغماس في التفاصيل\"، موضوع نقاش على موقع Hacker News، مما يبرز اهتمام المستخدمين بميزات التصفح المتقدمة.",
      "قارن المستخدمون المتصفح بالأدوات الموجودة مثل Tree Style Tabs وSideberry لمتصفح فايرفوكس، مع التركيز على ميزات مثل التصفح المتوازي وإدارة التبويبات الهرمية.",
      "تضمنت المناقشة إمكانية دعم المتصفح للبحث وفهم المعلومات، مع اقتراحات للتعاون مع الباحثين لتعزيز تطويره."
    ],
    "points": 447,
    "commentCount": 89,
    "retryCount": 0,
    "time": 1728024477
  },
  {
    "id": 41735544,
    "title": "روبرت دينارد، رائد ذاكرة DRAM، قد توفي",
    "originLink": "https://spectrum.ieee.org/in-memoriam-oct-2024",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41735544",
    "commentBody": "",
    "originSummary": [
      "روبرت دينارد، مخترع ذاكرة الوصول العشوائي الديناميكية (DRAM)، توفي عن عمر يناهز 91 عامًا، مما يمثل نهاية حقبة لشخصية رئيسية في تكنولوجيا ذاكرة الحاسوب.",
      "كما يعترف معهد مهندسي الكهرباء والإلكترونيات (IEEE) بحياة ومساهمات أعضاء بارزين آخرين، مسلطًا الضوء على تأثير عملهم في صناعة التكنولوجيا."
    ],
    "commentSummary": [
      "روبرت دينارد، شخصية رئيسية في تطوير ذاكرة الوصول العشوائي الديناميكية (DRAM) والمعروف بمقياس دينارد، قد توفي.",
      "كان لتدرج دينارد دور حيوي في تطوير الرقائق، حيث أثر على الصناعة بشكل مشابه لقانون مور، وانخفاضه أثر على تقنيات مثل معالجات بنتيوم 4 ومعالجات سيل.",
      "على الرغم من مساهماته الكبيرة في التكنولوجيا، لم تحظَ وفاة دينارد باهتمام عام واسع، إلا أنه كان يُذكر بلطفه وتواضعه."
    ],
    "points": 318,
    "commentCount": 27,
    "retryCount": 0,
    "time": 1727993007
  },
  {
    "id": 41742210,
    "title": "الحصول على أخباري اليومية من طابعة نقطية",
    "originLink": "https://aschmelyun.com/blog/getting-my-daily-news-from-a-dot-matrix-printer/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41742210",
    "commentBody": "",
    "originSummary": [
      "أنشأ المؤلف صفحة \"واجهة\" مخصصة باستخدام طابعة نقطية لتقليل وقت الشاشة مع البقاء على اطلاع بالأخبار والطقس والأسهم ومنشورات Reddit.",
      "تضمن المشروع استخدام Raspberry Pi، ومحول من تسلسلي إلى USB، وبرمجة PHP لسحب البيانات من واجهات برمجة التطبيقات المجانية وتنسيقها للطابعة.",
      "يشارك المؤلف الشيفرة المصدرية الكاملة على GitHub، داعيًا الآخرين لاستكشاف المشروع أو المساهمة فيه."
    ],
    "commentSummary": [
      "شارك أحد المستخدمين تجربته في استخدام طابعة نقطية لطباعة الأخبار اليومية، مما أثار مناقشات حول الحنين والوظائف لطابعات الزمن القديم. - استذكر المشاركون بساطة طرق الطباعة القديمة واستكشفوا التوافق الحديث مع هذه الطرق، بما في ذلك المشاريع التي تستخدم طابعات الإيصالات للإشعارات. - سلطت المحادثة الضوء على التحديات التي تواجه الطباعة الحديثة عبر أنظمة التشغيل المختلفة والجاذبية المستمرة لتكنولوجيا الزمن القديم."
    ],
    "points": 303,
    "commentCount": 106,
    "retryCount": 0,
    "time": 1728054522
  },
  {
    "id": 41734046,
    "title": "لن تفرض جوجل خطة صارمة للعودة إلى المكتب",
    "originLink": "https://www.entrepreneur.com/business-news/google-recommits-to-hybrid-work-schedule-unlike-amazon/480683",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41734046",
    "commentBody": "",
    "originSummary": [
      "قررت جوجل عدم فرض سياسة صارمة للعودة إلى المكتب، مع الحفاظ على نموذج العمل الهجين الذي يتطلب من الموظفين التواجد في المكتب ثلاثة أيام على الأقل في الأسبوع.",
      "يتناقض هذا النهج مع شركات مثل أمازون وسيلزفورس، التي قامت بتطبيق متطلبات حضور أكثر صرامة في المكاتب.",
      "أشار الرئيس التنفيذي لشركة جوجل، سوندار بيتشاي، إلى أن السياسة المرنة ستستمر طالما ظلت إنتاجية الموظفين مرتفعة."
    ],
    "commentSummary": [
      "تتبنى جوجل نهجًا مرنًا لسياسات العودة إلى المكتب (RTO)، مما يتناقض مع تفويض العودة الكاملة إلى المكتب من أمازون.",
      "يسلط النقاش المستمر الضوء على الإحباط بين موظفي التكنولوجيا بسبب تفويضات العودة إلى المكتب، مشيرين إلى التنقلات الطويلة وقدرات العمل عن بُعد الفعّالة.",
      "قد يجذب موقف جوجل المتساهل بشأن العودة إلى المكتب (RTO) المواهب من الشركات التي لديها متطلبات أكثر صرامة للعمل من المكتب."
    ],
    "points": 265,
    "commentCount": 271,
    "retryCount": 0,
    "time": 1727983525
  },
  {
    "id": 41736215,
    "title": "تقوم شركة كوكس بتقليل سرعات الإنترنت في الأحياء بأكملها لمعاقبة أي مستخدمين كثيفين (2020)",
    "originLink": "https://arstechnica.com/tech-policy/2020/06/cox-slows-internet-speeds-in-entire-neighborhoods-to-punish-any-heavy-users/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41736215",
    "commentBody": "",
    "originSummary": [
      "تقوم شركة كوكس للاتصالات بتقليل سرعات التحميل في بعض الأحياء لإدارة ما تعتبره \"استخدامًا مفرطًا\"، مما يؤثر على المستخدمين الكثيفين وجيرانهم. - أحد العملاء في غينزفيل، فلوريدا، شهد انخفاضًا في سرعة التحميل من 35 ميجابت في الثانية إلى 10 ميجابت في الثانية بعد استخدامه من 8 تيرابايت إلى 12 تيرابايت شهريًا، على الرغم من امتلاكه لخطة بيانات غير محدودة. - تدعي كوكس أن الشبكة تعمل بشكل جيد بشكل عام، مع تأثر عدد قليل من الأحياء فقط، وتدافع عن السرعة المخفضة باعتبارها كافية لمعظم المستخدمين، بينما توفر بيانات غير محدودة مؤقتة خلال الجائحة."
    ],
    "commentSummary": [
      "واجهت شركة كوكس انتقادات بسبب تقليل سرعات الإنترنت في الأحياء لمعاقبة المستخدمين الكثيفين، على الرغم من تقديمها خطط بيانات \"غير محدودة\"، كما ورد في عام 2020.",
      "تسلط هذه الممارسة الضوء على قضايا الإعلان المضلل والاشتراك الزائد في صناعة مزودي خدمات الإنترنت، حيث يشعر المستخدمون بأنهم قد خُدعوا بوعود غير محققة بشأن الإنترنت عالي السرعة.",
      "تؤكد الحالة على نقص المنافسة والرقابة التنظيمية في سوق الإنترنت في الولايات المتحدة، مما يؤدي إلى عدم رضا العملاء والمطالبة بمزيد من الشفافية والممارسات العادلة."
    ],
    "points": 239,
    "commentCount": 173,
    "retryCount": 0,
    "time": 1727998701
  },
  {
    "id": 41738914,
    "title": "بعض موظفي Automattic يقبلون عرض حزمة التعويضات",
    "originLink": "https://techcrunch.com/2024/10/04/159-employees-are-leaving-automattic-as-ceos-fight-with-wp-engine-escalates/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41738914",
    "commentBody": "",
    "originSummary": [
      "أعلن مات مولينويج، الرئيس التنفيذي لشركة Automattic، أن 159 موظفًا، أي ما يقرب من 8.4% من القوة العاملة، قبلوا حزمة تعويضات بسبب خلافات حول اتجاه الشركة وصراع مع WP Engine.",
      "تضمنت حزمة التعويضات، التي أطلق عليها اسم \"عرض التوافق\"، مبلغ 30,000 دولار أو راتب ستة أشهر، بشرط أن الذين يقبلونها لا يمكن إعادة توظيفهم.",
      "يتعلق النزاع مع WP Engine بمنازعات العلامات التجارية، مما أدى إلى اتخاذ إجراءات قانونية، حيث قامت WP Engine بمقاضاة Automattic بتهمة إساءة استخدام السلطة، وهي ادعاءات رفضها مولينويج وAutomattic باعتبارها لا أساس لها من الصحة."
    ],
    "commentSummary": [
      "قبل عدد من موظفي شركة Automattic، وخاصة من قسم WordPress، حزمة تعويضات تضمنت 30,000 دولار أو راتب ستة أشهر، أيهما كان أكبر.",
      "يأتي هذا التطور وسط توترات ونزاعات قانونية بين أوتوماتيك وWP Engine بشأن قضايا العلامات التجارية والمساهمات في ووردبريس.",
      "لقد أدت الحالة إلى مناقشات حول الاستقرار المالي لشركة Automattic وقرارات قيادتها."
    ],
    "points": 233,
    "commentCount": 318,
    "retryCount": 0,
    "time": 1728028549
  },
  {
    "id": 41740568,
    "title": "آلة حاسبة لتقريب تشيبيشيف",
    "originLink": "https://stuffmatic.com/chebyshev/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41740568",
    "commentBody": "",
    "originSummary": [
      "تم تطوير تطبيق ويب جديد لتوليد كود يهدف إلى تقريب الدوال الرياضية بكفاءة، مع التركيز على الأداء بدلاً من الدقة المثالية.",
      "يستخدم التطبيق توسعات تشيبيشيف، وهي تقنية رياضية، لإنشاء كود مضغوط وقابل للقراءة، مما يجعله متاحًا دون الحاجة إلى معرفة نظرية عميقة.",
      "تُعتبر هذه الأداة مفيدة بشكل خاص للأنظمة المدمجة حيث تكون الأداء أمرًا حاسمًا."
    ],
    "commentSummary": [
      "تقوم تطبيق ويب من Stuffmatic بتوليد كود فعال لتقريب الدوال الرياضية باستخدام توسعات تشيبيشيف، مما يفيد التطبيقات التي تتطلب أداءً عاليًا مثل الأنظمة المدمجة. يبسط التطبيق النظرية الرياضية المعقدة إلى كود مضغوط وقابل للقراءة، مما يجعله متاحًا دون الحاجة إلى فهم رياضي عميق. الكود المصدري متاح على GitHub، والمستخدمون يناقشون تجاربهم بنشاط، ويشاركون الموارد، ويقترحون تحسينات، مما يبرز فائدة التطبيق وإمكاناته التعليمية."
    ],
    "points": 176,
    "commentCount": 31,
    "retryCount": 0,
    "time": 1728043758
  },
  {
    "id": 41742278,
    "title": "واحد - إطار عمل React جديد يوحد الويب، والتطبيقات الأصلية، والتطبيقات المحلية أولاً",
    "originLink": "https://onestack.dev",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41742278",
    "commentBody": "",
    "originSummary": [
      "تاماگوي.ون هو إطار عمل جديد لـ React مصمم لتبسيط تطوير الويب والتطبيقات من خلال توحيد React Native وReact للويب، مما يسمح بمشاركة أسهل للكود عبر المنصات.",
      "يتعاون الإطار مع Zero لتعزيز التطوير المحلي أولاً، مما يتيح تفاعلات سلسة بين الخادم والعميل دون مشاكل في الأداء، مستوحى من أطر مثل Rails وMeteor.",
      "قام المبدع نيت بتطوير Tamagui.One لمعالجة التحديات التي تواجه تطوير التطبيقات عبر الأنظمة الأساسية، مقدماً حلاً سريعاً وذو رأي محدد دون التعقيد الذي كانت تتسم به الأطر السابقة."
    ],
    "commentSummary": [
      "\"One\" هو إطار عمل جديد لـ React تم تطويره بواسطة نيت، المعروف بـ Tamagui، مصمم لتوحيد React Native وReact web مع توجيه نظام ملفات مكتوب، مما يسهل مشاركة الكود عبر المنصات.",
      "يتكامل مع Zero لدعم تطوير محلي أول بكفاءة، بهدف تبسيط عملية التطوير من خلال استلهام الأفكار من أطر عمل مثل Rails وMeteor.",
      "حاليًا في المرحلة التجريبية، يخضع \"One\" لتحسينات مستمرة بناءً على ملاحظات المستخدمين الأوائل، على الرغم من بعض المخاوف بشأن التعقيد المحتمل المضاف."
    ],
    "points": 175,
    "commentCount": 47,
    "retryCount": 0,
    "time": 1728054924
  },
  {
    "id": 41742432,
    "title": "12 شهرًا من الماندرين",
    "originLink": "https://isaak.net/mandarin/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41742432",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "تمكن مستخدم من تعلم 2000 كلمة في اللغة الماندرين خلال 4-5 أشهر باستخدام مدخلات مفهومة (CI) وبطاقات أنكي التعليمية، مما يشير إلى أن هذه الأساليب فعالة لاكتساب اللغة.",
      "لقد طورت مجتمع CI موارد مثل plusonechinese.com، الذي يقدم قصصًا صوتية باللغة الماندرين مصممة لمستويات كفاءة مختلفة.",
      "شارك المستخدمون استراتيجيات للحفاظ على الاهتمام بتعلم اللغات، مثل استخدام أنظمة التكرار المتباعد (SRS)، والتفاعل مع محتوى مألوف، ودمج اللغة في الأنشطة اليومية، حيث دعا البعض إلى تجارب غامرة مثل السفر بالتطفل أو التدريس في الخارج."
    ],
    "points": 173,
    "commentCount": 85,
    "retryCount": 0,
    "time": 1728055731
  },
  {
    "id": 41738434,
    "title": "يقول بحث جديد إن \"المناطق الزرقاء\" يمكن تفسيرها ببيانات معيبة",
    "originLink": "https://www.independent.co.uk/life-style/blue-zones-netflix-ignobel-prize-b2622952.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41738434",
    "commentBody": "",
    "originSummary": [
      "الدكتور سول نيومان من معهد أكسفورد لدراسات الشيخوخة قد دحض مفهوم \"المناطق الزرقاء\"، الذي يدعي أن هناك مناطق معينة تحتوي على أعداد غير عادية من المعمرين.",
      "تسلط أبحاث نيومان الضوء على عدم دقة البيانات والأخطاء الإدارية، مثل الوفيات غير المبلغ عنها واحتيال المعاشات، بدلاً من طول العمر الحقيقي.",
      "تسائلت الدراسة عن العوامل المتعلقة بنمط الحياة مثل النظام الغذائي والشبكات الاجتماعية كمساهمين في طول العمر، مشيرة إلى عدم الاتساق في الترويج لاستهلاك الكحول في مناطق مثل لومة ليندا، موطن مجتمع السبتيين الذين لا يشربون الكحول."
    ],
    "commentSummary": [
      "تشير أبحاث جديدة إلى أن مفهوم \"المناطق الزرقاء\"، وهي المناطق التي يُعتقد أن الناس يعيشون فيها لفترة أطول، قد يكون مبنيًا على بيانات غير دقيقة بسبب سوء حفظ السجلات والاحتيال المحتمل.",
      "تُبرز الدراسة أن إدخال شهادات الميلاد في الولايات المتحدة أدى إلى انخفاض في عدد المعمرين الذين تم الإبلاغ عنهم، مما يشير إلى وجود تقديرات مبالغ فيها سابقًا.",
      "تثير النتائج الشكوك حول صحة المناطق الزرقاء وتلمح إلى أن التوصيات المتعلقة بنمط الحياة المستمدة من هذه المناطق قد لا تكون موثوقة."
    ],
    "points": 164,
    "commentCount": 114,
    "retryCount": 0,
    "time": 1728023564
  },
  {
    "id": 41737326,
    "title": "تصحيح السجل لـ Continue و PearAI",
    "originLink": "https://www.ycombinator.com/blog/correcting-the-record/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41737326",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "واجهت شركة PearAI، وهي شركة ناشئة مدعومة من Y Combinator، انتقادات لاستخدامها سوق VSCode الخاص بشركة مايكروسوفت دون اتباع شروط الترخيص وادعاءً بتفرعها من عمل شركة ناشئة أخرى مدعومة من YC.",
      "تم اتهام الشركة باستخدام الذكاء الاصطناعي لتوليد ترخيص، وهو ما اعتُبر تجاهلاً للمعايير القانونية والأخلاقية، مما أدى إلى رد فعل عنيف.",
      "أثار الحادث مناقشات حول عملية التحقق في Y Combinator ونهج ثقافة الشركات الناشئة تجاه السلوك الأخلاقي والاختصارات."
    ],
    "points": 160,
    "commentCount": 117,
    "retryCount": 0,
    "time": 1728010215
  },
  {
    "id": 41734119,
    "title": "وزارة الطاقة الأمريكية تعلن عن 1.5 مليار دولار لتحسينات في شبكة الكهرباء",
    "originLink": "https://www.upi.com/Top_News/US/2024/10/03/energy-department-electric-grid-investment/3631727969828/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41734119",
    "commentBody": "",
    "originSummary": [
      "تستثمر وزارة الطاقة الأمريكية 1.5 مليار دولار لتحسين موثوقية شبكة الكهرباء، بتمويل من قانون البنية التحتية ثنائي الحزب.",
      "سيدعم هذا الاستثمار أربعة مشاريع نقل، مضيفًا ما يقرب من 1000 ميل من خطوط النقل الجديدة و7100 ميغاواط من القدرة عبر عدة ولايات، مما يخلق 9000 وظيفة.",
      "تشير دراسة تخطيط النقل الوطني إلى أن توسيع نظام النقل يمكن أن يؤدي إلى توفير يتراوح بين 270 مليار دولار و490 مليار دولار بحلول عام 2050."
    ],
    "commentSummary": [
      "تستثمر وزارة الطاقة الأمريكية 1.5 مليار دولار في تحسينات شبكة الكهرباء، مع التركيز على تعزيز الموثوقية ودعم دمج الطاقة المتجددة في تكساس وغيرها من الولايات.",
      "يُعتبر هذا الاستثمار جزءًا من مبادرة أكبر لتحديث الشبكة ومكافحة تغير المناخ، رغم أن البعض يجادل بأنه غير كافٍ مقارنةً بالاحتياجات العامة للشبكة.",
      "تؤكد المناقشات على إمكانات تكساس في تصدير الطاقة وضرورة تعزيز مرونة الشبكة ضد الأحداث مثل العواصف الشمسية."
    ],
    "points": 152,
    "commentCount": 82,
    "retryCount": 0,
    "time": 1727984073
  },
  {
    "id": 41738552,
    "title": "الهندسة العكسية وتفكيك سماعات كيكز",
    "originLink": "https://nv1t.github.io/blog/kekz-headphones/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41738552",
    "commentBody": "",
    "originSummary": [
      "تستخدم سماعات كيكز رقائق تُسمى \"كيكز\" أو \"كوكيز\" لتشغيل القصص الصوتية دون الحاجة إلى اتصال بالإنترنت.",
      "كشفت جهود الهندسة العكسية أن سماعات الرأس تحتوي على شريحة Jieli وقارئ NFC وبطاقة SD تحتوي على ملفات مشفرة، مما يسمح باستنساخ ملفات تعريف الارتباط وفك تشفير المحتوى.",
      "يجمع التطبيق المرافق بيانات المستخدم، بما في ذلك الموقع الجغرافي، دون إفصاح شفاف، ولم ترد الشركة على المخاوف الأمنية التي أثارها الباحث."
    ],
    "commentSummary": [
      "تسلط المناقشة حول الهندسة العكسية لسماعات Kekz الضوء على التحدي التقني والمتعة في فك تشفير طرق التشفير والإخفاء.",
      "تُثار مخاوف بشأن قضايا الخصوصية، بما في ذلك جمع بيانات تحديد الموقع الجغرافي، والتي قد تتعارض مع معايير اللائحة العامة لحماية البيانات (GDPR).",
      "يستكشف المشاركون إمكانية إنشاء مشغلات موسيقى صديقة للأطفال باستخدام علامات NFC (الاتصال قريب المدى) ويناقشون الفوائد والعيوب التي تنطوي عليها سماح الشركات بالهندسة العكسية لأغراض التسويق والأمان."
    ],
    "points": 145,
    "commentCount": 28,
    "retryCount": 0,
    "time": 1728024958
  }
]
