[
  {
    "id": 40607442,
    "title": "Se aconseja a los profesionales que cancelen Adobe por problemas de confianza con los acuerdos de confidencialidad",
    "originLink": "https://twitter.com/Stretchedwiener/status/1798153619285708909",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40607442",
    "commentBody": "",
    "originSummary": [
      "Un tuit de Wetterschneider aconseja a los profesionales, en particular a los que están sujetos a acuerdos de confidencialidad (NDA) o trabajan con archivos protegidos, que cancelen los servicios de Adobe y eliminen sus aplicaciones.",
      "El tuit afirma que Adobe no es de fiar, aunque no aporta razones ni pruebas concretas de esta afirmación."
    ],
    "commentSummary": [
      "Los usuarios del foro critican las tasas de cancelación de Adobe y el amplio acceso a los datos en virtud de las nuevas condiciones de servicio, comparten tácticas para evitar las tasas y expresan su preocupación por la privacidad.",
      "Las comparaciones con Google y Microsoft ponen de relieve una tendencia de políticas vagas y extralimitadas, con debates sobre alternativas como GIMP, Krita y Affinity, a pesar de las dificultades para cambiar debido al dominio de Adobe.",
      "Se debaten las implicaciones legales de las condiciones de Adobe, incluidos los posibles conflictos con los acuerdos con los clientes y la aplicabilidad de las cláusulas contractuales, y se hace hincapié en las cuestiones éticas y en la necesidad de mejores soluciones de código abierto."
    ],
    "points": 529,
    "commentCount": 308,
    "retryCount": 0,
    "time": 1717758722
  },
  {
    "id": 40605532,
    "title": "Ice Ice: Gestor de barras de menú de código abierto para macOS con funciones de personalización",
    "originLink": "https://github.com/jordanbaird/Ice",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40605532",
    "commentBody": "",
    "originSummary": [
      "\"Ice Ice\" es una herramienta de gestión de la barra de menús de macOS que permite a los usuarios ocultar, mostrar y reorganizar los elementos de la barra de menús mediante Comando + arrastrar.",
      "Ofrece funciones como el espaciado personalizado y la personalización del aspecto de la barra de menús, con futuras actualizaciones previstas para añadir más funcionalidades.",
      "La herramienta requiere macOS 14 o posterior, puede instalarse manualmente o a través de Homebrew, y está disponible bajo licencia MIT."
    ],
    "commentSummary": [
      "El debate se centra en las herramientas de gestión de la barra de menús de macOS, como Bartender, Ice, Dozer y Hidden Bar, y en las experiencias de los usuarios con estas aplicaciones.",
      "Preocupa la reciente adquisición de Bartender por parte de una empresa menos fiable, lo que puede dar lugar a problemas de privacidad y transparencia.",
      "Los usuarios comparan la usabilidad y la gestión de ventanas de macOS con otros sistemas operativos como Windows y Linux, debatiendo la necesidad de herramientas de terceros para mejorar la productividad y la coherencia de la interfaz de usuario de macOS."
    ],
    "points": 518,
    "commentCount": 147,
    "retryCount": 0,
    "time": 1717737118
  },
  {
    "id": 40610435,
    "title": "Microsoft hace optativa la polémica función de retirada tras los problemas de seguridad",
    "originLink": "https://www.wired.com/story/microsoft-recall-off-default-security-concerns/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40610435",
    "commentBody": "",
    "originSummary": [
      "Microsoft ha cambiado su función Recall, que registra la actividad de los usuarios para el análisis de inteligencia artificial, a una configuración de inclusión voluntaria tras las reacciones negativas por motivos de seguridad.",
      "Los críticos habían tachado a Recall de programa espía en potencia, alegando riesgos de acceso no autorizado a datos sensibles; ahora, se requiere la autenticación del usuario mediante PIN o datos biométricos para activar o acceder a los datos de Recall, que permanecerán cifrados.",
      "A pesar de estos cambios, los riesgos para la privacidad siguen existiendo, especialmente en contextos legales, y este movimiento se produce después de una serie de incidentes de seguridad en Microsoft, con el CEO Satya Nadella haciendo hincapié en la seguridad como prioridad principal."
    ],
    "commentSummary": [
      "Microsoft está desactivando su función Recall por defecto debido a los importantes problemas de privacidad y seguridad planteados por los usuarios.",
      "Los críticos sostienen que Recall captura información sensible, como correos electrónicos y contraseñas, y lo comparan con el invasivo rastreo del historial del navegador, lo que refleja problemas más generales de disminución de la conciencia sobre la privacidad.",
      "El debate pone de relieve la necesidad de que las empresas apliquen normas estrictas de protección de la intimidad y manejen los datos de forma responsable. Los usuarios expresan su desconfianza hacia las prácticas de las empresas tecnológicas en materia de datos y se plantean alternativas como Linux por cuestiones de privacidad."
    ],
    "points": 229,
    "commentCount": 189,
    "retryCount": 0,
    "time": 1717778848
  },
  {
    "id": 40608269,
    "title": "Cómo codifica GPT-4o las imágenes: Una inmersión profunda en las estrategias de tokenización e incrustación",
    "originLink": "https://www.oranlooney.com/post/gpt-cnn/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40608269",
    "commentBody": "",
    "originSummary": [
      "El artículo \"A Picture is Worth 170 Tokens: How Does GPT-4o Encode Images?\", de Oran Looney, explora por qué GPT-4o cobra 170 tokens por procesar cada mosaico de imagen de 512x512, lo que equivale a unas 227 palabras.",
      "Contrasta la avanzada estrategia de codificación de imágenes de GPT-4o con el método más sencillo de CLIP y destaca la eficacia de las redes neuronales convolucionales (CNN) para los datos de imágenes.",
      "El texto analiza el rendimiento de GPT-4o en el análisis de imágenes basado en cuadrículas, propone una estrategia piramidal para mejorarlo y especula sobre sus capacidades de OCR, sugiriendo que podría utilizar un motor externo como Tesseract."
    ],
    "commentSummary": [
      "El debate subraya la necesidad de una solución OCR (reconocimiento óptico de caracteres) moderna y de código abierto, y sugiere alternativas como PaddleOCR para mejorar la velocidad y la precisión en comparación con herramientas anticuadas como Tesseract.",
      "Critica la ineficacia y los elevados costes del uso de grandes modelos lingüísticos (LLM) para tareas de OCR y menciona la API de OCR de Apple como una opción que no es de código abierto, destacando las experiencias de los usuarios con diversas herramientas de OCR y los problemas con la documentación y los costes de los servicios en la nube.",
      "La conversación también profundiza en temas avanzados como la tokenización de imágenes con modelos como VQVAE, la complejidad computacional de las incrustaciones de imágenes y las tendencias futuras en IA, con debates sobre las capacidades de procesamiento de imágenes de GPT-4 y la necesidad de mejorar la precisión del OCR para textos complejos."
    ],
    "points": 218,
    "commentCount": 78,
    "retryCount": 0,
    "time": 1717764867
  },
  {
    "id": 40608413,
    "title": "σ-GPTs: El orden dinámico en modelos autorregresivos mejora la eficiencia",
    "originLink": "https://arxiv.org/abs/2404.09562",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40608413",
    "commentBody": "",
    "originSummary": [
      "El artículo \"σ-GPTs: A New Approach to Autoregressive Models\" introduce un método novedoso que desafía el tradicional orden fijo de izquierda a derecha en modelos autorregresivos como el GPT.",
      "Al utilizar la codificación posicional para las salidas, el modelo puede ajustar dinámicamente el orden de generación por muestra, lo que permite muestrear y condicionar subconjuntos arbitrarios de fichas.",
      "Este enfoque permite un muestreo eficaz de varios tokens con una estrategia de rechazo, lo que reduce significativamente el número de evaluaciones del modelo y los pasos de generación en varios dominios."
    ],
    "commentSummary": [
      "El artículo \"Σ-GPTs: A New Approach to Autoregressive Models\" presenta un novedoso método de entrenamiento para modelos GPT que implica la permutación aleatoria de tokens de entrada y codificaciones posicionales duales.",
      "Este método permite la predicción paralela de los tokens que faltan, el cálculo simultáneo de probabilidades condicionales y utiliza un método de muestreo de rechazo para generar tokens de relleno, lo que mejora potencialmente la eficacia y las capacidades.",
      "Aunque similares a modelos como XLNet, los Σ-GPT introducen elementos únicos como la codificación posicional doble y el muestreo de ráfagas, con debates sobre aplicaciones y limitaciones, incluidos los problemas de coherencia y alucinación de las frases."
    ],
    "points": 174,
    "commentCount": 38,
    "retryCount": 0,
    "time": 1717765951
  },
  {
    "id": 40601711,
    "title": "La actualización de la BIOS de HP deja inoperativos los portátiles ProBook 445 y 455 G7, los usuarios buscan soluciones",
    "originLink": "https://h30434.www3.hp.com/t5/Notebook-Operating-System-and-Recovery/HP-Probook-BIOS-Upgrade-1-17-failed/td-p/9081096/page/3",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40601711",
    "commentBody": "",
    "originSummary": [
      "Un foro de la comunidad en línea en el que se debaten temas de hardware y software, incluida la asistencia sobre productos para diversos dispositivos, como portátiles e impresoras.",
      "Una reciente actualización de la BIOS ha dejado inoperativos los portátiles HP ProBook 445 y 455 G7, provocando la frustración de los usuarios por la falta de respuesta de HP y la preocupación por los costes de reparación de los dispositivos fuera de garantía.",
      "Los usuarios comparten soluciones como flashear el chip de la BIOS, ponerse en contacto con HP para que lo repare y aconsejan desactivar futuras actualizaciones de la BIOS para evitar problemas similares."
    ],
    "commentSummary": [
      "Se critica a HP por brickear portátiles con actualizaciones defectuosas de la BIOS, lo que refleja continuos problemas de calidad y un mal servicio al cliente.",
      "Los usuarios debatieron sobre los riesgos de las actualizaciones de la BIOS, la ausencia de sistemas de doble BIOS y las posibles implicaciones legales en virtud de la Ley de Fraude y Abuso Informático (CFAA).",
      "Se hicieron comparaciones con marcas como Apple y Framework, que son alabadas por su fiabilidad, mientras que la calidad de HP se considera en declive, especialmente tras el liderazgo de Carly Fiorina."
    ],
    "points": 161,
    "commentCount": 114,
    "retryCount": 0,
    "time": 1717704097
  },
  {
    "id": 40610621,
    "title": "OpenSSH añade nuevas funciones para penalizar los repetidos intentos fallidos de autenticación",
    "originLink": "https://undeadly.org/cgi?action=article;sid=20240607042157",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40610621",
    "commentBody": "",
    "originSummary": [
      "El 6 de junio de 2024, Damien Miller introdujo dos nuevas opciones de configuración para sshd(8) de OpenBSD: PerSourcePenalties y PerSourcePenaltyExemptList.",
      "Estas opciones pretenden penalizar comportamientos indeseables de los clientes, como repetidos intentos fallidos de autenticación o acciones que provoquen caídas de sshd, bloqueando temporalmente las direcciones IP infractoras.",
      "PerSourcePenalties estará habilitado por defecto en la próxima versión de OpenBSD 7.6, y se recomienda a los administradores que configuren estos ajustes cuidadosamente para evitar bloquear tráfico legítimo, especialmente cuando se manejen conexiones desde detrás de NATs o proxies."
    ],
    "commentSummary": [
      "El debate se centra en las nuevas opciones de OpenSSH diseñadas para penalizar comportamientos indeseables, con dudas sobre su equidad y eficacia, especialmente con IPv6.",
      "Hay consenso en que las claves SSH son más seguras y cómodas que las contraseñas, y se habla de certificados SSH, gestión de claves y alternativas como PKCS#11 y VPN para mejorar la seguridad.",
      "La conversación también aborda la filosofía de OpenBSD de minimizar la complejidad del código en aras de la seguridad, en contraste con la configurabilidad de OpenSSH, y el impacto potencial de eliminar la autenticación por contraseña."
    ],
    "points": 156,
    "commentCount": 66,
    "retryCount": 0,
    "time": 1717780103
  },
  {
    "id": 40604596,
    "title": "Medidor de energía de la CPU: Monitor Intel CPU Consumo de energía con precisión en Linux",
    "originLink": "https://github.com/sosy-lab/cpu-energy-meter",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40604596",
    "commentBody": "",
    "originSummary": [
      "CPU Energy Meter es una herramienta de Linux diseñada para monitorizar el consumo de energía de la CPU Intel mediante la función RAPL, disponible a partir de la generación Sandy Bridge.",
      "Desarrollado por la LMU de Múnich, rastrea el uso de energía en varios dominios (paquete de CPU, núcleo, no núcleo, memoria y plataforma) con una sobrecarga insignificante y está licenciado bajo la cláusula BSD-3.",
      "La instalación es sencilla a través de un PPA para Debian/Ubuntu o desde un paquete .deb en GitHub, y puede ejecutarse sin acceso root configurando los permisos adecuados."
    ],
    "commentSummary": [
      "La discusión destaca las herramientas y métodos para medir el consumo de energía de las CPU de Intel y AMD, incluyendo \"CPU Energy Meter\", la interfaz RAPL de Intel, `perf`, `turbostat` y uProf de AMD.",
      "La función de medición de energía de AMD se eliminó del kernel de Linux (versión 5.13) por motivos de seguridad, y se recomiendan alternativas como el kit de herramientas de medición de energía de Astron.",
      "La conversación también aborda la precisión de las mediciones de energía de Intel, los desafíos en la medición de energía de todo el sistema y los problemas con el estrangulamiento de la CPU debido a la condición PROCHOT, ofreciendo sugerencias de mitigación."
    ],
    "points": 152,
    "commentCount": 49,
    "retryCount": 0,
    "time": 1717725561
  },
  {
    "id": 40603625,
    "title": "Por qué el multihilo puede ralentizar el código: Ideas de un ingeniero de AWS",
    "originLink": "https://brooker.co.za/blog/2014/12/06/random.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40603625",
    "commentBody": "",
    "originSummary": [
      "Marc Brooker, ingeniero de AWS, analiza las complejidades de la programación multihilo en una entrada de blog, utilizando una simulación de la paradoja del cumpleaños como caso de estudio.",
      "Descubrió que los subprocesos múltiples ralentizaban la simulación debido a los cambios de contexto y las pérdidas de caché L1, identificadas mediante la herramienta perf de Linux.",
      "El cambio a un generador de números aleatorios reentrante (`random_r`) mejoró el rendimiento, ilustrando que los programas multihilo a veces pueden ser menos eficientes que los de un solo hilo."
    ],
    "commentSummary": [
      "La discusión pone de relieve las ineficiencias y complejidades de utilizar hilos en programación, especialmente con estados compartidos globales como `random()`, y las limitaciones de librerías estándar como libc en entornos multihilo.",
      "Los participantes sugieren sustitutos personalizados de libc, mejores abstracciones para gestionar los efectos secundarios, y exploran las ventajas y los retos de la programación funcional y las medidas de seguridad a nivel de sistema operativo.",
      "Se hace hincapié en la importancia del comportamiento determinista en los generadores de números aleatorios (RNG) multihilo, el uso de estados locales en los hilos y el debate sobre los generadores de números pseudoaleatorios (PRNG) globales frente a los independientes."
    ],
    "points": 142,
    "commentCount": 92,
    "retryCount": 0,
    "time": 1717716521
  },
  {
    "id": 40608332,
    "title": "Explorando la \"Maldad 0\": Tres enfoques únicos por Tom 7",
    "originLink": "http://tom7.org/bovex/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40608332",
    "commentBody": "",
    "originSummary": [
      "\"Maldad 0\" puede explorarse a través de las versiones de Knuth y Epsom en las actas de SIGBOVIK 2024, que se ven mejor en Chrome debido a un error de visualización.",
      "La versión de Apostrophe ofrece una experiencia visual en 4k y 60 Hz, lo que atrae a los interesados en imágenes de alta calidad.",
      "El código fuente está disponible bajo licencias GPL o GJPL, con notas de compilación, destinadas a los interesados en los aspectos técnicos."
    ],
    "commentSummary": [
      "Tom7 es un reputado creador de contenidos conocido por sus intrincados y didácticos vídeos, a menudo comparados con disertaciones académicas.",
      "Los aficionados aprecian su creatividad y profundidad, destacando proyectos notables como el de la NES jugando a la SNES.",
      "Su enfoque caprichoso, que incluye errores intencionados para captar la atención de los espectadores, a menudo da lugar a reflexiones profundas y humorísticas, lo que le ha granjeado un gran número de seguidores."
    ],
    "points": 132,
    "commentCount": 22,
    "retryCount": 0,
    "time": 1717765275
  },
  {
    "id": 40602886,
    "title": "Cómo seguir usando Adblockers en Chrome a pesar de la transición a Manifest V3",
    "originLink": "https://gist.github.com/velzie/053ffedeaecea1a801a2769ab86ab376",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40602886",
    "commentBody": "",
    "originSummary": [
      "Los usuarios pueden seguir utilizando adblockers en Chrome y Chromium activando la clave ExtensionManifestV2Availability, a pesar del cambio de Google a Manifest V3, que carece de la API webRequestBlocking.",
      "Las instrucciones para activar esta tecla varían según el sistema operativo: Linux y ChromeOS requieren comandos de terminal, Windows utiliza regedit y MacOS implica un comando de terminal (no probado).",
      "Esta solución utiliza las políticas de la empresa para mantener la funcionalidad de los bloqueadores de anuncios incluso después de que finalice la compatibilidad oficial con las extensiones Manifest V2."
    ],
    "commentSummary": [
      "Un post de GitHub aborda el mantenimiento de la funcionalidad del adblocker en Chrome y Chromium a pesar del cambio de Google a Manifest V3, que limita los adblockers, sugiriendo soluciones temporales para desarrolladores y usuarios expertos en tecnología.",
      "Los usuarios debaten sobre el cambio a Firefox, que aún admite adblockers, a pesar de la desconfianza debida a cambios pasados, y discuten alternativas como Edge, Safari, Pi-hole y el bloqueo a nivel de DNS.",
      "Se plantean preocupaciones sobre la sostenibilidad de las soluciones alternativas, el dominio de los navegadores basados en Chromium y el impacto de los cambios de Google en los bloqueadores de anuncios, con menciones al apoyo de navegadores como Brave y Arc."
    ],
    "points": 124,
    "commentCount": 90,
    "retryCount": 0,
    "time": 1717711466
  },
  {
    "id": 40601776,
    "title": "El Starliner de Boeing atraca con éxito en la ISS a pesar de los problemas con los propulsores",
    "originLink": "https://gizmodo.com/watch-boeing-starliner-dock-iss-astronauts-1851521917",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40601776",
    "commentBody": "",
    "originSummary": [
      "La cápsula Starliner de Boeing despegó con éxito, transportando a los astronautas de la NASA Butch Wilmore y Suni Williams a la órbita terrestre baja, tras múltiples intentos fallidos.",
      "La misión, que forma parte del Programa de Tripulación Comercial de la NASA, dotado con 4.300 millones de dólares, tiene por objeto probar la capacidad del Starliner para transportar tripulaciones a la Estación Espacial Internacional (ISS).",
      "A pesar de los problemas técnicos con sus propulsores, la cápsula se acopló a la ISS, y los astronautas ofrecerán una visita virtual en directo del Starliner el 8 de junio."
    ],
    "commentSummary": [
      "El Starliner de Boeing se acopló con éxito a la ISS a pesar de sufrir múltiples fallos en los propulsores, siguiendo una tendencia de problemas similares en misiones anteriores.",
      "Tras el acoplamiento, los ingenieros descubrieron una cuarta fuga de helio y problemas sin resolver en los propulsores, lo que hizo temer por la fiabilidad de la nave para futuras misiones tripuladas.",
      "El debate destaca una comparación entre el enfoque tradicional de Boeing y la estrategia iterativa y tolerante al riesgo de SpaceX, señalando las críticas al descenso de calidad de Boeing y el impacto de los recortes de financiación en el conocimiento de los vuelos espaciales y la seguridad de las misiones."
    ],
    "points": 117,
    "commentCount": 78,
    "retryCount": 0,
    "time": 1717704393
  },
  {
    "id": 40607889,
    "title": "La pantalla E-Paper de 7 colores muestra las actualizaciones meteorológicas diarias",
    "originLink": "https://github.com/blixt/sol-mate-eink",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40607889",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Un usuario de GitHub, blixt, presentó un proyecto que utiliza una pantalla de papel electrónico de 7 colores para las actualizaciones meteorológicas, utilizando IA para convertir nombres de lugares en coordenadas y generar imágenes del tiempo.",
      "El debate incluyó el uso de varios dispositivos como la Inkplate 6Color y la Raspberry Pi para controlar las pantallas de papel electrónico, haciendo hincapié en la eficiencia energética y la facilidad de uso con interfaces como SPI y GPIO.",
      "Los participantes debatieron sobre la necesidad y eficacia de la IA para desambiguar nombres de lugares y generar imágenes meteorológicas, teniendo en cuenta la disponibilidad de API meteorológicas gratuitas y la aplicación práctica de esa tecnología."
    ],
    "points": 109,
    "commentCount": 62,
    "retryCount": 0,
    "time": 1717762230
  },
  {
    "id": 40609126,
    "title": "Cómo restauré mi HP Envy 17 después de una actualización fallida de la BIOS y de un fallo del servicio técnico",
    "originLink": "https://github.com/ctag/hp_envy_reviver",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40609126",
    "commentBody": "",
    "originSummary": [
      "El documento describe el proceso del autor para reprogramar el chip de memoria de la BIOS en un portátil HP Envy 17-ae110nr después de que una actualización fallida de la BIOS lo dejara inoperativo.",
      "El autor utilizó herramientas como esquemas, una placa de desarrollo STM32 y comunicación SPI para extraer y volver a actualizar el firmware de la BIOS, restaurando finalmente el portátil tras varios intentos.",
      "El documento sirve de guía para otras personas que se enfrenten a problemas similares y pone de manifiesto la preocupación que suscita el servicio de atención al cliente de HP, especialmente en lo que respecta a la anulación de la garantía por culpa de componentes de terceros."
    ],
    "commentSummary": [
      "Un usuario de GitHub compartió su experiencia recuperando un portátil HP dañado, lo que suscitó debates sobre el fraude de la garantía, la reputación de los productos HP y las técnicas de recuperación de la BIOS utilizando herramientas como Bus Pirate y Raspberry Pi.",
      "La conversación puso de relieve los retos de la reparación moderna de hardware, con usuarios que compartían problemas similares en varias marcas y frustraciones con los servicios de garantía, en particular el de Sony.",
      "Se debatieron aspectos técnicos sobre actualizaciones de firmware, soluciones de hardware personalizadas y aspectos legales de las garantías, con opiniones encontradas sobre la fiabilidad y el soporte de HP, haciendo hincapié en la importancia de las copias de seguridad de los datos y de considerar los ordenadores como reemplazables."
    ],
    "points": 108,
    "commentCount": 50,
    "retryCount": 0,
    "time": 1717770785
  }
]
