[
  {
    "id": 40607442,
    "title": "Οι επαγγελματίες συμβουλεύονται να ακυρώσουν την Adobe Over Trust Concerns με NDAs",
    "originLink": "https://twitter.com/Stretchedwiener/status/1798153619285708909",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40607442",
    "commentBody": "",
    "originSummary": [
      "Ένα tweet του Wetterschneider συμβουλεύει τους επαγγελματίες, ιδίως όσους βρίσκονται υπό NDA (συμφωνίες μη αποκάλυψης) ή ασχολούνται με αρχεία ιδιοκτησίας, να ακυρώσουν τις υπηρεσίες της Adobe και να διαγράψουν τις εφαρμογές της.",
      "Το tweet ισχυρίζεται ότι η Adobe δεν είναι αξιόπιστη, χωρίς ωστόσο να παρέχει συγκεκριμένους λόγους ή αποδείξεις για τον ισχυρισμό αυτό."
    ],
    "commentSummary": [
      "Οι χρήστες του φόρουμ επικρίνουν τα τέλη ακύρωσης της Adobe και την εκτεταμένη πρόσβαση σε δεδομένα στο πλαίσιο των νέων όρων χρήσης, μοιράζονται τακτικές για την αποφυγή των τελών και εκφράζουν ανησυχίες για την προστασία της ιδιωτικής ζωής.",
      "Οι συγκρίσεις με τη Google και τη Microsoft αναδεικνύουν μια τάση ασαφών και υπερβολικών πολιτικών, με συζητήσεις για εναλλακτικές λύσεις όπως το GIMP, το Krita και το Affinity, παρά τις προκλήσεις στην αλλαγή λόγω της κυριαρχίας της Adobe.",
      "Συζητούνται οι νομικές επιπτώσεις των όρων της Adobe, συμπεριλαμβανομένων των πιθανών συγκρούσεων με τις συμφωνίες με τους πελάτες και την εκτελεστότητα των συμβατικών ρητρών, με έμφαση στα ηθικά ζητήματα και την ανάγκη για καλύτερες λύσεις ανοικτού κώδικα."
    ],
    "points": 529,
    "commentCount": 308,
    "retryCount": 0,
    "time": 1717758722
  },
  {
    "id": 40605532,
    "title": "Ice Ice: MacOS με δυνατότητες προσαρμογής",
    "originLink": "https://github.com/jordanbaird/Ice",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40605532",
    "commentBody": "",
    "originSummary": [
      "Το \"Ice Ice\" είναι ένα εργαλείο διαχείρισης της γραμμής μενού του macOS που επιτρέπει στους χρήστες να αποκρύπτουν, να εμφανίζουν και να αναδιατάσσουν τα στοιχεία της γραμμής μενού χρησιμοποιώντας Command + drag.",
      "Προσφέρει δυνατότητες όπως προσαρμοσμένο διάστημα και προσαρμογή της εμφάνισης της γραμμής μενού, ενώ προγραμματίζονται μελλοντικές ενημερώσεις για την προσθήκη περισσότερων λειτουργιών.",
      "Το εργαλείο απαιτεί macOS 14 ή νεότερη έκδοση, μπορεί να εγκατασταθεί χειροκίνητα ή μέσω του Homebrew και διατίθεται με την άδεια MIT."
    ],
    "commentSummary": [
      "Η συζήτηση επικεντρώνεται στα εργαλεία διαχείρισης της γραμμής μενού του macOS, συμπεριλαμβανομένων των Bartender, Ice, Dozer και Hidden Bar, και στις εμπειρίες των χρηστών με αυτές τις εφαρμογές.",
      "Εκφράζονται ανησυχίες σχετικά με την πρόσφατη εξαγορά της Bartender από μια λιγότερο αξιόπιστη εταιρεία, η οποία οδηγεί σε πιθανά ζητήματα απορρήτου και διαφάνειας.",
      "Οι χρήστες συγκρίνουν την ευχρηστία και τη διαχείριση παραθύρων του macOS με άλλα λειτουργικά συστήματα όπως τα Windows και το Linux, συζητώντας την ανάγκη για εργαλεία τρίτων για την ενίσχυση της παραγωγικότητας και τη συνοχή της διεπαφής χρήστη του macOS."
    ],
    "points": 518,
    "commentCount": 147,
    "retryCount": 0,
    "time": 1717737118
  },
  {
    "id": 40610435,
    "title": "Η Microsoft κάνει την αμφιλεγόμενη λειτουργία ανάκλησης Opt-In μετά από ανησυχίες για την ασφάλεια",
    "originLink": "https://www.wired.com/story/microsoft-recall-off-default-security-concerns/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40610435",
    "commentBody": "",
    "originSummary": [
      "Η Microsoft άλλαξε τη λειτουργία Recall, η οποία καταγράφει τη δραστηριότητα του χρήστη για ανάλυση AI, σε μια ρύθμιση opt-in μετά από αντιδράσεις σχετικά με τις ανησυχίες για την ασφάλεια.",
      "Οι επικριτές είχαν χαρακτηρίσει το Recall ως δυνητικό λογισμικό κατασκοπείας, επικαλούμενοι κινδύνους μη εξουσιοδοτημένης πρόσβασης σε ευαίσθητα δεδομένα.Τώρα, απαιτείται έλεγχος ταυτότητας του χρήστη μέσω PIN ή βιομετρικών στοιχείων για την ενεργοποίηση ή την πρόσβαση στα δεδομένα του Recall, τα οποία θα παραμείνουν κρυπτογραφημένα.",
      "Παρά τις αλλαγές αυτές, οι κίνδυνοι για την προστασία της ιδιωτικής ζωής παραμένουν, ιδίως σε νομικά πλαίσια, και η κίνηση αυτή ακολουθεί μια σειρά περιστατικών ασφαλείας στη Microsoft, με τον CEO Satya Nadella να τονίζει την ασφάλεια ως κορυφαία προτεραιότητα."
    ],
    "commentSummary": [
      "Η Microsoft απενεργοποιεί τη λειτουργία Ανάκληση από προεπιλογή λόγω σημαντικών ανησυχιών για την ιδιωτικότητα και την ασφάλεια που εκφράζονται από τους χρήστες.",
      "Οι επικριτές υποστηρίζουν ότι το Recall συλλαμβάνει ευαίσθητες πληροφορίες, όπως μηνύματα ηλεκτρονικού ταχυδρομείου και κωδικούς πρόσβασης, παρομοιάζοντάς το με την παρεμβατική παρακολούθηση του ιστορικού του προγράμματος περιήγησης, αντικατοπτρίζοντας ευρύτερα ζητήματα μειωμένης ευαισθητοποίησης σε θέματα ιδιωτικότητας.",
      "Η συζήτηση αναδεικνύει την ανάγκη για υψηλά πρότυπα προστασίας της ιδιωτικής ζωής και υπεύθυνο χειρισμό των δεδομένων από τις εταιρείες, με τους χρήστες να εκφράζουν δυσπιστία απέναντι στις πρακτικές δεδομένων των εταιρειών τεχνολογίας και να εξετάζουν εναλλακτικές λύσεις όπως το Linux λόγω προβλημάτων προστασίας της ιδιωτικής ζωής."
    ],
    "points": 229,
    "commentCount": 189,
    "retryCount": 0,
    "time": 1717778848
  },
  {
    "id": 40608269,
    "title": "Πώς το GPT-4o κωδικοποιεί εικόνες: Tokenization και Στρατηγικές Ενσωμάτωσης",
    "originLink": "https://www.oranlooney.com/post/gpt-cnn/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40608269",
    "commentBody": "",
    "originSummary": [
      "Το άρθρο \"A Picture is Worth 170 Tokens: How Does GPT-4o Encode Images?\" του Oran Looney διερευνά γιατί το GPT-4o χρεώνει 170 tokens για την επεξεργασία κάθε πλακιδίου εικόνας 512x512, που ισοδυναμεί με περίπου 227 λέξεις.",
      "Αντιπαραβάλλει την προηγμένη στρατηγική κωδικοποίησης εικόνων του GPT-4o με την απλούστερη μέθοδο του CLIP και υπογραμμίζει την αποτελεσματικότητα των Συγκεχυμένων Νευρωνικών Δικτύων (CNN) για δεδομένα εικόνων.",
      "Το κείμενο συζητά την απόδοση του GPT-4o στην ανάλυση εικόνων με βάση το πλέγμα, προτείνει μια στρατηγική πυραμίδας για βελτίωση και κάνει εικασίες σχετικά με τις ικανότητές του OCR, υποδεικνύοντας ότι μπορεί να χρησιμοποιεί μια εξωτερική μηχανή όπως η Tesseract."
    ],
    "commentSummary": [
      "Η συζήτηση υπογραμμίζει την ανάγκη για μια σύγχρονη λύση OCR (οπτική αναγνώριση χαρακτήρων) ανοικτού κώδικα, προτείνοντας εναλλακτικές λύσεις όπως το PaddleOCR για καλύτερη ταχύτητα και ακρίβεια σε σύγκριση με ξεπερασμένα εργαλεία όπως το Tesseract.",
      "Ασκεί κριτική στην αναποτελεσματικότητα και το υψηλό κόστος της χρήσης μεγάλων γλωσσικών μοντέλων (LLM) για εργασίες OCR και αναφέρει το OCR API της Apple ως επιλογή μη ανοιχτού κώδικα, υπογραμμίζοντας τις εμπειρίες των χρηστών με διάφορα εργαλεία OCR και τα ζητήματα τεκμηρίωσης και κόστους των υπηρεσιών cloud.",
      "Η συζήτηση εμβαθύνει επίσης σε προηγμένα θέματα, όπως η κωδικοποίηση εικόνων με μοντέλα όπως το VQVAE, η υπολογιστική πολυπλοκότητα των ενσωματώσεων εικόνων και οι μελλοντικές τάσεις στην ΤΝ, με συζητήσεις σχετικά με τις δυνατότητες επεξεργασίας εικόνων του GPT-4 και την ανάγκη για βελτιωμένη ακρίβεια OCR για σύνθετα κείμενα."
    ],
    "points": 218,
    "commentCount": 78,
    "retryCount": 0,
    "time": 1717764867
  },
  {
    "id": 40608413,
    "title": "σ-GPTs: Ενισχύει την αποδοτικότητα",
    "originLink": "https://arxiv.org/abs/2404.09562",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40608413",
    "commentBody": "",
    "originSummary": [
      "Η εργασία \"σ-GPTs: GPT: Μια νέα προσέγγιση στα αυτοπαλίνδρομα μοντέλα\" παρουσιάζει μια νέα μέθοδο που αμφισβητεί την παραδοσιακή σταθερή σειρά από αριστερά προς τα δεξιά σε αυτοπαλίνδρομα μοντέλα όπως το GPT.",
      "Με τη χρήση κωδικοποίησης θέσης για τις εξόδους, το μοντέλο μπορεί να προσαρμόζει δυναμικά τη σειρά παραγωγής ανά δείγμα, επιτρέποντας τη δειγματοληψία και την προετοιμασία σε αυθαίρετα υποσύνολα συμβόλων.",
      "Η προσέγγιση αυτή επιτρέπει την αποτελεσματική δειγματοληψία πολλαπλών συμβόλων με στρατηγική απόρριψης, μειώνοντας σημαντικά τον αριθμό των αξιολογήσεων μοντέλων και των βημάτων δημιουργίας σε διάφορους τομείς."
    ],
    "commentSummary": [
      "Η εργασία \"Σ-GPTs: GPT\" παρουσιάζει μια νέα μέθοδο εκπαίδευσης για τα μοντέλα GPT που περιλαμβάνει τυχαία μετάθεση των tokens εισόδου και διπλή κωδικοποίηση θέσης.",
      "Αυτή η μέθοδος επιτρέπει την παράλληλη πρόβλεψη των ελλειπόντων μαρκών, τον ταυτόχρονο υπολογισμό των υπό συνθήκη πιθανοτήτων και χρησιμοποιεί μια μέθοδο δειγματοληψίας απόρριψης για τη δημιουργία μαρκών συμπλήρωσης, βελτιώνοντας ενδεχομένως την αποτελεσματικότητα και τις δυνατότητες.",
      "Παρόλο που είναι παρόμοια με μοντέλα όπως το XLNet, τα Σ-GPT εισάγουν μοναδικά στοιχεία όπως η διπλή κωδικοποίηση θέσης και η δειγματοληψία ριπής, με συζητήσεις σχετικά με τις εφαρμογές και τους περιορισμούς, συμπεριλαμβανομένων των ζητημάτων συνοχής προτάσεων και ψευδαισθήσεων."
    ],
    "points": 174,
    "commentCount": 38,
    "retryCount": 0,
    "time": 1717765951
  },
  {
    "id": 40601711,
    "title": "Η ενημέρωση του BIOS της HP καθιστά τους φορητούς υπολογιστές ProBook 445 και 455 G7 μη λειτουργικούς, οι χρήστες αναζητούν λύσεις",
    "originLink": "https://h30434.www3.hp.com/t5/Notebook-Operating-System-and-Recovery/HP-Probook-BIOS-Upgrade-1-17-failed/td-p/9081096/page/3",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40601711",
    "commentBody": "",
    "originSummary": [
      "Ένα φόρουμ διαδικτυακής κοινότητας συζητά θέματα υλικού και λογισμικού, συμπεριλαμβανομένης της υποστήριξης προϊόντων για διάφορες συσκευές, όπως φορητούς υπολογιστές και εκτυπωτές.",
      "Μια πρόσφατη ενημέρωση του BIOS κατέστησε τους φορητούς υπολογιστές HP ProBook 445 και 455 G7 μη λειτουργικούς, προκαλώντας την απογοήτευση των χρηστών λόγω της έλλειψης ανταπόκρισης της HP και των ανησυχιών για το κόστος επισκευής των συσκευών εκτός εγγύησης.",
      "Οι χρήστες μοιράζονται λύσεις, όπως η αναλαμπή του τσιπ BIOS, η επικοινωνία με την HP για επισκευές και συμβουλεύουν την απενεργοποίηση μελλοντικών ενημερώσεων BIOS για την αποφυγή παρόμοιων προβλημάτων."
    ],
    "commentSummary": [
      "Η HP δέχεται επικρίσεις για το μπλοκάρισμα φορητών υπολογιστών με ελαττωματικές ενημερώσεις BIOS, γεγονός που αντικατοπτρίζει τα συνεχή προβλήματα ποιότητας και την κακή εξυπηρέτηση πελατών.",
      "Οι χρήστες συζήτησαν τους κινδύνους από τις ενημερώσεις BIOS, την απουσία συστημάτων διπλού BIOS και τις πιθανές νομικές επιπτώσεις βάσει του νόμου περί απάτης και κατάχρησης υπολογιστή (CFAA).",
      "Έγιναν συγκρίσεις με μάρκες όπως η Apple και το Framework, οι οποίες επαινούνται για την αξιοπιστία τους, ενώ η ποιότητα της HP θεωρείται ότι μειώνεται, ιδίως μετά την ηγεσία της Καρλ Φιορίνα."
    ],
    "points": 161,
    "commentCount": 114,
    "retryCount": 0,
    "time": 1717704097
  },
  {
    "id": 40610621,
    "title": "Το OpenSSH προσθέτει νέα χαρακτηριστικά για την τιμωρία επαναλαμβανόμενων αποτυχημένων προσπαθειών αυθεντικοποίησης",
    "originLink": "https://undeadly.org/cgi?action=article;sid=20240607042157",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40610621",
    "commentBody": "",
    "originSummary": [
      "Στις 6 Ιουνίου 2024, ο Damien Miller εισήγαγε δύο νέες επιλογές παραμέτρων για το sshd(8) του OpenBSD: PerSourcePenalties και PerSourcePenaltyExemptList.",
      "Αυτές οι επιλογές στοχεύουν στην τιμωρία ανεπιθύμητων συμπεριφορών του πελάτη, όπως επαναλαμβανόμενες αποτυχημένες προσπάθειες πιστοποίησης ή ενέργειες που προκαλούν συντριβές του sshd, με τον προσωρινό αποκλεισμό των παραβατικών διευθύνσεων IP.",
      "Τα PerSourcePenalties θα είναι ενεργοποιημένα από προεπιλογή στην επερχόμενη έκδοση OpenBSD 7.6 και οι διαχειριστές καλούνται να διαμορφώσουν προσεκτικά αυτές τις ρυθμίσεις για να αποφύγουν το μπλοκάρισμα της νόμιμης κυκλοφορίας, ειδικά όταν χειρίζονται συνδέσεις πίσω από NAT ή proxies."
    ],
    "commentSummary": [
      "Η συζήτηση επικεντρώνεται στις νέες επιλογές του OpenSSH που έχουν σχεδιαστεί για να τιμωρούν ανεπιθύμητες συμπεριφορές, με ανησυχίες σχετικά με τη δικαιοσύνη και την αποτελεσματικότητά τους, ειδικά με το IPv6.",
      "Υπάρχει συναίνεση ότι τα κλειδιά SSH είναι πιο ασφαλή και βολικά από τους κωδικούς πρόσβασης, με συζητήσεις σχετικά με τα πιστοποιητικά SSH, τη διαχείριση κλειδιών και εναλλακτικές λύσεις όπως το PKCS#11 και τα VPN για αυξημένη ασφάλεια.",
      "Η συζήτηση θίγει επίσης τη φιλοσοφία του OpenBSD να ελαχιστοποιεί την πολυπλοκότητα του κώδικα για λόγους ασφαλείας, σε αντίθεση με τη δυνατότητα διαμόρφωσης του OpenSSH, και τις πιθανές επιπτώσεις της κατάργησης του ελέγχου ταυτότητας με κωδικό πρόσβασης."
    ],
    "points": 156,
    "commentCount": 66,
    "retryCount": 0,
    "time": 1717780103
  },
  {
    "id": 40604596,
    "title": "Μετρητής ενέργειας CPU: Intel CPU με ακρίβεια στο Linux",
    "originLink": "https://github.com/sosy-lab/cpu-energy-meter",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40604596",
    "commentBody": "",
    "originSummary": [
      "Το CPU Energy Meter είναι ένα εργαλείο Linux που έχει σχεδιαστεί για την παρακολούθηση της κατανάλωσης ενέργειας της CPU της Intel χρησιμοποιώντας τη λειτουργία RAPL, η οποία είναι διαθέσιμη από τη γενιά Sandy Bridge και μετά.",
      "Αναπτύχθηκε από το LMU του Μονάχου, παρακολουθεί τη χρήση ενέργειας σε διάφορους τομείς (πακέτο CPU, πυρήνας, μη πυρήνας, μνήμη και πλατφόρμα) με αμελητέα επιβάρυνση και διατίθεται με άδεια BSD-3-Clause.",
      "Η εγκατάσταση είναι απλή μέσω ενός PPA για Debian/Ubuntu ή από ένα πακέτο .deb στο GitHub, και μπορεί να εκτελεστεί χωρίς πρόσβαση root, θέτοντας τα κατάλληλα δικαιώματα."
    ],
    "commentSummary": [
      "Η συζήτηση αναδεικνύει εργαλεία και μεθόδους για τη μέτρηση της ενεργειακής κατανάλωσης των CPUs της Intel και της AMD, όπως το \"CPU Energy Meter\", η διεπαφή RAPL της Intel, το `perf`, το `turbostat` και το uProf της AMD.",
      "Η λειτουργία μέτρησης ενέργειας της AMD αφαιρέθηκε από τον πυρήνα Linux (έκδοση 5.13) λόγω ανησυχιών για την ασφάλεια, ενώ συνιστώνται εναλλακτικές λύσεις όπως το Power Measurement Toolkit της Astron.",
      "Η συζήτηση ασχολείται επίσης με την ακρίβεια των ενεργειακών μετρήσεων της Intel, τις προκλήσεις στη μέτρηση της ισχύος ολόκληρου του συστήματος και τα ζητήματα με το throttling της CPU λόγω της κατάστασης PROCHOT, προσφέροντας προτάσεις για τον μετριασμό της."
    ],
    "points": 152,
    "commentCount": 49,
    "retryCount": 0,
    "time": 1717725561
  },
  {
    "id": 40603625,
    "title": "Γιατί το Multi-Threading μπορεί να επιβραδύνει τον κώδικά σας: AWS Engineer",
    "originLink": "https://brooker.co.za/blog/2014/12/06/random.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40603625",
    "commentBody": "",
    "originSummary": [
      "Ο Marc Brooker, ένας μηχανικός της AWS, αναλύει τις πολυπλοκότητες του πολυνηματικού προγραμματισμού σε μια ανάρτηση στο blog, χρησιμοποιώντας ως μελέτη περίπτωσης μια προσομοίωση παράδοξου γενεθλίων.",
      "Διαπίστωσε ότι το multi-threading έκανε την προσομοίωση πιο αργή λόγω των context switches και των misses της L1 cache, που εντοπίστηκαν με τη χρήση του εργαλείου perf του Linux.",
      "Η μετάβαση σε μια επαναλαμβανόμενη γεννήτρια τυχαίων αριθμών (`random_r`) βελτίωσε την απόδοση, δείχνοντας ότι τα πολυνηματικά προγράμματα μπορεί μερικές φορές να είναι λιγότερο αποδοτικά από τα μονονηματικά."
    ],
    "commentSummary": [
      "Η συζήτηση αναδεικνύει την αναποτελεσματικότητα και την πολυπλοκότητα της χρήσης νημάτων στον προγραμματισμό, ειδικά με τις παγκόσμιες κοινές καταστάσεις όπως η `random()`, και τους περιορισμούς των τυποποιημένων βιβλιοθηκών όπως η libc σε περιβάλλοντα με πολλά νήματα.",
      "Οι συμμετέχοντες προτείνουν προσαρμοσμένες αντικαταστάσεις της libc, καλύτερες αφαιρέσεις για τη διαχείριση των παρενεργειών και διερευνούν τα οφέλη και τις προκλήσεις του λειτουργικού προγραμματισμού και των μέτρων ασφαλείας σε επίπεδο λειτουργικού συστήματος.",
      "Έμφαση δίνεται στη σημασία της ντετερμινιστικής συμπεριφοράς σε γεννήτριες τυχαίων αριθμών (RNGs) με πολλά νήματα, στη χρήση τοπικών καταστάσεων νήματος και στη συζήτηση σχετικά με τις παγκόσμιες έναντι των ανεξάρτητων γεννητριών ψευδοτυχαίων αριθμών (PRNGs)."
    ],
    "points": 142,
    "commentCount": 92,
    "retryCount": 0,
    "time": 1717716521
  },
  {
    "id": 40608332,
    "title": "Εξερευνώντας την \"Κακοδαιμονία 0\": 7",
    "originLink": "http://tom7.org/bovex/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40608332",
    "commentBody": "",
    "originSummary": [
      "Το \"Badness 0\" μπορεί να εξερευνηθεί μέσω των εκδόσεων του Knuth και του Epsom στα πρακτικά του SIGBOVIK 2024, τα οποία είναι καλύτερο να προβληθούν στον Chrome λόγω ενός σφάλματος στην οθόνη.",
      "Η έκδοση της Apostrophe προσφέρει μια οπτική εμπειρία 4k, 60Hz, απευθυνόμενη σε όσους ενδιαφέρονται για υψηλής ποιότητας γραφικά.",
      "Ο πηγαίος κώδικας είναι διαθέσιμος υπό τις άδειες GPL ή GJPL, με σημειώσεις μεταγλώττισης που παρέχονται, για όσους ενδιαφέρονται για τις τεχνικές πτυχές."
    ],
    "commentSummary": [
      "Ο Tom7 είναι ένας καταξιωμένος δημιουργός περιεχομένου, γνωστός για τα περίπλοκα και εκπαιδευτικά του βίντεο, που συχνά παρομοιάζονται με ακαδημαϊκές διατριβές.",
      "Οι οπαδοί εκτιμούν τη δημιουργικότητα και το βάθος του, με αξιοσημείωτα έργα όπως τα παιχνίδια NES που παίζουν SNES.",
      "Η ιδιόρρυθμη προσέγγισή του, που περιλαμβάνει σκόπιμα λάθη για να εμπλέξει τους θεατές, οδηγεί συχνά σε βαθιές και χιουμοριστικές ιδέες, κερδίζοντας έτσι ένα αφοσιωμένο κοινό."
    ],
    "points": 132,
    "commentCount": 22,
    "retryCount": 0,
    "time": 1717765275
  },
  {
    "id": 40602886,
    "title": "Πώς να συνεχίσετε να χρησιμοποιείτε Adblockers στο Chrome παρά τη μετάβαση στο Manifest V3",
    "originLink": "https://gist.github.com/velzie/053ffedeaecea1a801a2769ab86ab376",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40602886",
    "commentBody": "",
    "originSummary": [
      "Οι χρήστες μπορούν να συνεχίσουν να χρησιμοποιούν adblockers στο Chrome και το Chromium ενεργοποιώντας το κλειδί ExtensionManifestV2Availability, παρά τη μετάβαση της Google στο Manifest V3, από το οποίο απουσιάζει το API webRequestBlocking.",
      "Οι οδηγίες για την ενεργοποίηση αυτού του κλειδιού διαφέρουν ανάλογα με το λειτουργικό σύστημα: Τα Windows χρησιμοποιούν το regedit και το MacOS περιλαμβάνει μια εντολή τερματικού (δεν έχει δοκιμαστεί).",
      "Αυτή η παράκαμψη χρησιμοποιεί τις εταιρικές πολιτικές για να διατηρήσει τη λειτουργικότητα των adblockers ακόμη και μετά το τέλος της επίσημης υποστήριξης για τις επεκτάσεις Manifest V2."
    ],
    "commentSummary": [
      "Μια δημοσίευση στο GitHub ασχολείται με τη διατήρηση της λειτουργικότητας των adblocker στο Chrome και το Chromium παρά τη μετάβαση της Google στο Manifest V3, το οποίο περιορίζει τα adblocker, προτείνοντας προσωρινές λύσεις για προγραμματιστές και χρήστες με τεχνολογικές γνώσεις.",
      "Οι χρήστες συζητούν για τη μετάβαση στον Firefox, ο οποίος εξακολουθεί να υποστηρίζει adblockers, παρά τη δυσπιστία λόγω προηγούμενων αλλαγών, και συζητούν εναλλακτικές λύσεις όπως ο Edge, ο Safari, το Pi-hole και ο αποκλεισμός σε επίπεδο DNS.",
      "Εκφράζονται ανησυχίες σχετικά με τη βιωσιμότητα των παρακάμψεων, την κυριαρχία των προγραμμάτων περιήγησης που βασίζονται στο Chromium και τον αντίκτυπο των αλλαγών της Google στους αποκλειστές διαφημίσεων, με αναφορές για την υποστήριξη από προγράμματα περιήγησης όπως το Brave και το Arc."
    ],
    "points": 124,
    "commentCount": 90,
    "retryCount": 0,
    "time": 1717711466
  },
  {
    "id": 40601776,
    "title": "Το Starliner της Boeing ελλιμενίζεται επιτυχώς στον ISS παρά τα προβλήματα του προωθητήρα",
    "originLink": "https://gizmodo.com/watch-boeing-starliner-dock-iss-astronauts-1851521917",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40601776",
    "commentBody": "",
    "originSummary": [
      "Η κάψουλα Starliner της Boeing εκτοξεύθηκε με επιτυχία, μεταφέροντας τους αστροναύτες της NASA Butch Wilmore και Suni Williams σε χαμηλή γήινη τροχιά, μετά από πολλές αποτυχημένες προσπάθειες.",
      "Η αποστολή, που αποτελεί μέρος του προγράμματος εμπορικών πληρωμάτων της NASA ύψους 4,3 δισεκατομμυρίων δολαρίων, έχει ως στόχο να δοκιμάσει την ικανότητα του Starliner να μεταφέρει πληρώματα στον Διεθνή Διαστημικό Σταθμό (ISS).",
      "Παρά τα τεχνικά προβλήματα με τους προωθητήρες της, η κάψουλα προσδέθηκε στον ISS και οι αστροναύτες θα πραγματοποιήσουν μια ζωντανή εικονική περιήγηση στο Starliner στις 8 Ιουνίου."
    ],
    "commentSummary": [
      "Το Starliner της Boeing προσδέθηκε με επιτυχία στον ISS παρά τις πολλαπλές βλάβες στους προωθητήρες, συνεχίζοντας μια τάση παρόμοιων προβλημάτων από προηγούμενες αποστολές.",
      "Μετά την πρόσδεση, οι μηχανικοί ανακάλυψαν μια τέταρτη διαρροή ηλίου και άλυτα προβλήματα στους προωθητήρες, εγείροντας ανησυχίες για την αξιοπιστία του διαστημικού σκάφους για μελλοντικές επανδρωμένες αποστολές.",
      "Η συζήτηση αναδεικνύει μια σύγκριση μεταξύ της παραδοσιακής προσέγγισης της Boeing και της επαναληπτικής, ανεκτικής στον κίνδυνο στρατηγικής της SpaceX, σημειώνοντας τις επικρίσεις για την πτώση της ποιότητας της Boeing και τον αντίκτυπο των περικοπών χρηματοδότησης στη γνώση των διαστημικών πτήσεων και την ασφάλεια των αποστολών."
    ],
    "points": 117,
    "commentCount": 78,
    "retryCount": 0,
    "time": 1717704393
  },
  {
    "id": 40607889,
    "title": "Η οθόνη 7-χρωμάτων E-Paper εμφανίζει καθημερινές ενημερώσεις για τον καιρό",
    "originLink": "https://github.com/blixt/sol-mate-eink",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40607889",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Ένας χρήστης του GitHub, ο blixt, παρουσίασε ένα έργο που χρησιμοποιεί μια οθόνη ηλεκτρονικού χαρτιού 7 χρωμάτων για ενημερώσεις καιρού, χρησιμοποιώντας τεχνητή νοημοσύνη για τη μετατροπή των ονομάτων τοποθεσίας σε συντεταγμένες και τη δημιουργία εικόνων καιρού.",
      "Η συζήτηση περιελάμβανε τη χρήση διαφόρων συσκευών όπως το Inkplate 6Color και το Raspberry Pi για την οδήγηση οθονών ηλεκτρονικού χαρτιού, δίνοντας έμφαση στην αποδοτικότητα της ενέργειας και την ευκολία χρήσης με διεπαφές όπως SPI και GPIO.",
      "Οι συμμετέχοντες συζήτησαν την αναγκαιότητα και την αποτελεσματικότητα της τεχνητής νοημοσύνης στην αποσαφήνιση των ονομάτων τοποθεσιών και στη δημιουργία οπτικών εικόνων καιρού, λαμβάνοντας υπόψη τη διαθεσιμότητα δωρεάν APIs καιρού και την πρακτική εφαρμογή αυτής της τεχνολογίας."
    ],
    "points": 109,
    "commentCount": 62,
    "retryCount": 0,
    "time": 1717762230
  },
  {
    "id": 40609126,
    "title": "Πώς επανέφερα το HP Envy 17 μετά από μια αποτυχημένη ενημέρωση BIOS και μια απογοήτευση από την τεχνική υποστήριξη",
    "originLink": "https://github.com/ctag/hp_envy_reviver",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40609126",
    "commentBody": "",
    "originSummary": [
      "Το έγγραφο περιγράφει τη διαδικασία του συγγραφέα για τον επαναπρογραμματισμό του τσιπ μνήμης BIOS σε έναν φορητό υπολογιστή HP Envy 17-ae110nr μετά από μια αποτυχημένη ενημέρωση BIOS που τον κατέστησε μη λειτουργικό.",
      "Ο συγγραφέας χρησιμοποίησε εργαλεία όπως σχηματικές αναπαραστάσεις, μια αναπτυξιακή πλακέτα STM32 και επικοινωνία SPI για να εξαγάγει και να αναβαθμίσει το υλικολογισμικό του BIOS, αποκαθιστώντας τελικά το φορητό υπολογιστή μετά από αρκετές προσπάθειες.",
      "Το έγγραφο χρησιμεύει ως οδηγός για άλλους που αντιμετωπίζουν παρόμοια ζητήματα και υπογραμμίζει τις ανησυχίες σχετικά με την εξυπηρέτηση πελατών της HP, ιδίως όσον αφορά την ακύρωση της εγγύησης λόγω εξαρτημάτων τρίτων κατασκευαστών."
    ],
    "commentSummary": [
      "Ένας χρήστης του GitHub μοιράστηκε την εμπειρία του στην ανάκτηση ενός μπλοκαρισμένου φορητού υπολογιστή HP, προκαλώντας συζητήσεις σχετικά με την απάτη της εγγύησης, τη φήμη των προϊόντων της HP και τις τεχνικές ανάκτησης του BIOS με τη χρήση εργαλείων όπως το Bus Pirate και το Raspberry Pi.",
      "Η συζήτηση ανέδειξε τις προκλήσεις στη σύγχρονη επισκευή υλικού, με τους χρήστες να μοιράζονται παρόμοια προβλήματα σε διάφορες μάρκες και απογοητεύσεις με τις υπηρεσίες εγγύησης, ιδίως της Sony.",
      "Συζητήθηκαν τεχνικές πληροφορίες σχετικά με τις ενημερώσεις υλικολογισμικού, τις προσαρμοσμένες λύσεις υλικού και τις νομικές πτυχές των εγγυήσεων, με ανάμεικτες απόψεις σχετικά με την αξιοπιστία και την υποστήριξη της HP, τονίζοντας τη σημασία της δημιουργίας αντιγράφων ασφαλείας δεδομένων και της θεώρησης των υπολογιστών ως αντικαταστάσιμων."
    ],
    "points": 108,
    "commentCount": 50,
    "retryCount": 0,
    "time": 1717770785
  }
]
