[
  {
    "id": 37215557,
    "title": "uBlock Origin Lite متوفر الآن على Firefox",
    "originLink": "https://addons.mozilla.org/en-US/firefox/addon/ublock-origin-lite/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37215557",
    "commentBody": "",
    "originSummary": [
      "uBlock Origin Lite هو امتداد لحظر المحتوى لمتصفح Firefox يحظر الإعلانات وأجهزة التتبع وعمال المناجم.",
      "يستخدم الملحق نهجا تعريفيا للتصفية الفعالة ولا يتطلب أذونات واسعة عند التثبيت.",
      "لدى المستخدمين خيار منح أذونات موسعة على مواقع محددة لتصفية أكثر دقة."
    ],
    "commentSummary": [
      "تتمحور المناقشات حول استخدام وأخلاقيات إضافات حظر الإعلانات ، مع التركيز على uBlock Origin وإصداراته المختلفة.",
      "تتم مناقشة الفوائد والقيود الأمنية لهذه الامتدادات ، بما في ذلك قدرتها على تقليل نواقل الهجوم المحتملة والمخاوف بشأن التحديثات المخترقة.",
      "كما تتم مناقشة الآثار الأخلاقية لحظر الإعلانات ، والطبيعة الغازية للإعلان عبر الإنترنت ، وتأثير تغييرات وظائف المتصفح على أدوات حظر الإعلانات."
    ],
    "points": 566,
    "commentCount": 276,
    "retryCount": 0,
    "time": 1692653031
  },
  {
    "id": 37208083,
    "title": "غنو موازية، أين كنت طوال حياتي؟",
    "originLink": "https://alexplescan.com/posts/2023/08/20/gnu-parallel/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37208083",
    "commentBody": "",
    "originSummary": [
      "يناقش منشور المدونة تجربة المؤلف في استخدام GNU Parallel لجمع إحصائيات حول معدلات النجاح / الفشل في الاختبار الشامل.",
      "أدى التنفيذ المتوازي باستخدام GNU Parallel إلى تحسين الأداء وتقديم وظائف إضافية.",
      "يؤكد المنشور على ميزات GNU Parallel ، مثل التحكم في التزامن ، والتقاط المخرجات ، والقدرات المتقدمة الموضحة في كتاب المؤلف."
    ],
    "commentSummary": [
      "تستكشف المناقشة مزايا وفائدة GNU Parallel مقارنة بأوامر shell والأدوات البديلة مثل YSH و Nushell و Fish في الحوسبة المتوازية.",
      "تم ذكر لغات بديلة مثل Perl و Python و Haskell بالإضافة إلى أدوات مثل zargs في zsh و DASK في Python للمعالجة المتوازية.",
      "يتضمن النقاش مقارنة بين نوى وحدة المعالجة المركزية ووحدة معالجة الرسومات WGP / SM ، وإدراج إشعار الاقتباس في ترخيص GPL ، ودور ريتشارد ستالمان في تفسير GPL. يتم تناول أهمية الاستشهادات في أبحاث البرمجيات والجدل الدائر حول طلب مؤلف GNU Parallel للاستشهادات أو الدفع. تتم مناقشة إيجابيات وسلبيات استخدام xargs و parallel للتنفيذ المتوازي وفوائد استخدام تجمع الخيط / العامل. يشتهر GNU Parallel بتعدد استخداماته وفعاليته في الحوسبة المتوازية."
    ],
    "points": 432,
    "commentCount": 249,
    "retryCount": 0,
    "time": 1692617475
  },
  {
    "id": 37210953,
    "title": "لا تطرد الرسام الخاص بك",
    "originLink": "https://sambleckley.com/writing/dont-fire-your-illustrator.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37210953",
    "commentBody": "",
    "originSummary": [
      "يستكشف المؤلف استخدام مولدات الصور الذكاء الاصطناعي وكيف يمكن أن تؤثر على مجموعات مختلفة ، بما في ذلك فناني الوسائط المادية والرسامين التجاريين.",
      "يتم شرح مفهوم الانتشار المستقر ، إلى جانب تحديات استخدام النص لتوجيه توليد الصور.",
      "من المتوقع أن يحل الذكاء الاصطناعي محل أنواع معينة من مهام التوضيح والكتابة ، ولكن تحقيق نتائج محددة قد يكون أمرا صعبا ، ويقترح استخدام قيود الصورة. يؤكد المؤلف على أهمية الذكاء الاصطناعي المنتجات التي تندمج بسلاسة في سير عمل الرسام ويعرب عن أمله في منتجات الذكاء الاصطناعي المستقبلية التي تلبي الرسوم التوضيحية التجارية."
    ],
    "commentSummary": [
      "الذكاء الاصطناعي (الذكاء الاصطناعي) لديه القدرة على التأثير بشكل كبير على صناعات الفن والموسيقى.",
      "وتشمل المخاوف انخفاض إيرادات الفنانين وتركيز الثروة في الشركات.",
      "شهدت صناعة الموسيقى بالفعل تغييرات بسبب خدمات البث ، وقد يؤدي الذكاء الاصطناعي إلى تعطيل المساعي البشرية.",
      "تلعب الذكاء الاصطناعي أيضا دورا في إنتاج الموسيقى ، مما يثير تساؤلات حول قيمة وجودة المحتوى الذي يتم إنشاؤه الذكاء الاصطناعي.",
      "قضايا حق المؤلف والحاجة إلى منصات وحلول جديدة هي مواضيع للنقاش.",
      "ولا يزال التأثير العام الذكاء الاصطناعي على هذه الصناعات غير مؤكد، مع ما يترتب على ذلك من عواقب إيجابية وسلبية على حد سواء."
    ],
    "points": 360,
    "commentCount": 291,
    "retryCount": 0,
    "time": 1692631991
  },
  {
    "id": 37211230,
    "title": "إنقاذ الأرواح (2004)",
    "originLink": "https://www.folklore.org/StoryView.py?story=Saving_Lives.txt",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37211230",
    "commentBody": "",
    "originSummary": [
      "حفز ستيف جوبز المهندسين الذين يعملون على كمبيوتر ماكنتوش لتحسين وقت التمهيد من خلال إخبارهم أن كل 10 ثوان يتم توفيرها ستنقذ عشرات الأرواح.",
      "نجح المهندسون في تقليل وقت التمهيد بأكثر من 10 ثوان في الأشهر اللاحقة.",
      "تسلط هذه القصة الضوء على أسلوب قيادة ستيف جوبز وتفاني المهندسين في تلبية توقعاته."
    ],
    "commentSummary": [
      "يعد فهم احتياجات العملاء ومعالجة المشكلات الأساسية أمرا بالغ الأهمية لمطوري البرامج لإعطاء الأولوية لرضا المستخدم.",
      "يمكن أن تؤثر البرامج البطيئة سلبا على تجربة المستخدم ويجب تحسينها للحصول على أداء أسرع.",
      "أدت التطورات في تحسين الأجهزة والبرامج إلى أوقات تمهيد أسرع ، مما أدى إلى تحسين تجربة المستخدم بشكل عام.",
      "تتمتع أنظمة التشغيل المستندة إلى ROM بمزايا وعيوب ويجب مراعاتها بعناية لحالات استخدام محددة.",
      "يمكن أن تعزز الرسوم المتحركة لواجهة المستخدم تجربة المستخدم ، ولكن يجب استخدامها بحكمة لتجنب إرباك المستخدمين أو تشتيت انتباههم.",
      "توفر محركات الأقراص ذات الحالة الثابتة مزايا كبيرة مقارنة بمحركات الأقراص الثابتة ، بما في ذلك أوقات وصول أسرع للبيانات واستجابة محسنة للنظام.",
      "يعد توفير الوقت في تطوير البرامج أمرا ضروريا لتحقيق الكفاءة والإنتاجية.",
      "يمكن أن تؤدي التحديثات البطيئة ومنصات الاتصال غير الكافية إلى الإحباط بين مستخدمي البرامج ومطوريها.",
      "تلقى Stack Overflow انتقادات ومخاوف ، مما يسلط الضوء على الحاجة إلى منصات بديلة واعتدال أفضل.",
      "عند طلب المساعدة ، من المهم تقديم معلومات واضحة وقابلة للتنفيذ لتلقي مساعدة فعالة."
    ],
    "points": 316,
    "commentCount": 283,
    "retryCount": 0,
    "time": 1692633078
  },
  {
    "id": 37211519,
    "title": "لقد جعلت الانتشار المستقر XL أكثر ذكاء من خلال ضبطه على الصور السيئة التي تم إنشاؤها بواسطة الذكاء الاصطناعي",
    "originLink": "https://minimaxir.com/2023/08/stable-diffusion-xl-wrong/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37211519",
    "commentBody": "",
    "originSummary": [
      "يقدم منشور مدونة Max Woolf Stable Diffusion XL 1.0 (SDXL) ، وهو نموذج مفتوح المصدر لتوليد صور عالية الدقة.",
      "يشارك المؤلف عمليته في استخدام جهاز افتراضي سحابي مع وحدة معالجة رسومات L4 متوسطة المدى ويسلط الضوء على الميزات الجديدة في مكتبة Python للناشرين.",
      "يستكشف المنشور استخدام LoRAs لضبط SDXL ، ويعرض أمثلة إنشاء الصور مع وبدون LoRAs ، ويناقش تقنية \"المطالبة الخاطئة\" لتحسين الصور التي تم إنشاؤها بواسطة الذكاء الاصطناعي."
    ],
    "commentSummary": [
      "يشارك المؤلف تجربته في ضبط نموذج Stable Diffusion XL باستخدام الصور التي تم إنشاؤها بواسطة الذكاء الاصطناعي.",
      "تقترح المقالة تنفيذ خيار ملاحظات للتحسينات الشخصية في النموذج.",
      "تم ذكر الذكاء الاصطناعي Horde و LAION كمنصات لاختبار وجمع تفضيلات المستخدم في ضبط النموذج."
    ],
    "points": 301,
    "commentCount": 63,
    "retryCount": 0,
    "time": 1692634167
  },
  {
    "id": 37213479,
    "title": "منذ سنوات 5 أطلق صمام بروتون",
    "originLink": "https://www.gamingonlinux.com/2023/08/5-years-ago-valve-released-proton-forever-changing-linux-gaming/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37213479",
    "commentBody": "",
    "originSummary": [
      "أدى إصدار Valve من Proton ، وهو نسخة معدلة من Wine ، إلى تحويل ألعاب Linux قبل خمس سنوات من خلال تمكين الألعاب الشعبية من العمل على النظام الأساسي.",
      "أثار هذا طفرة في ألعاب Linux وساهم في إنشاء Steam Deck.",
      "أدت التحسينات المستمرة في Proton إلى تحسين التوافق والأداء ، مما يمنح لاعبي Linux إمكانية الوصول إلى مجموعة متنوعة من الألعاب ، مما يؤدي إلى تعليقات المستخدمين المتحمسين."
    ],
    "commentSummary": [
      "اكتسبت منصة ألعاب Proton من Valve شعبية بين المستخدمين كبديل قابل للتطبيق لنظام التشغيل Windows للألعاب على Linux.",
      "تمت الإشادة ب Valve لدعم العملاء وتفانيها في سطح المكتب مفتوح المصدر ، بينما يتم انتقاد Epic لافتقارها إلى هذه المجالات.",
      "تثار مخاوف بشأن صفقات Epic الحصرية وتراجع المنصات الخالية من إدارة الحقوق الرقمية."
    ],
    "points": 274,
    "commentCount": 217,
    "retryCount": 0,
    "time": 1692642517
  },
  {
    "id": 37208211,
    "title": "إطار العرض المثالي غير موجود",
    "originLink": "https://viewports.fyi/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37208211",
    "commentBody": "",
    "originSummary": [
      "تناقش المقالة تجزئة أحجام الشاشة وإطارات عرض المتصفح وأهمية مراعاة ذلك في قرارات التصميم.",
      "أجرى المؤلفون تجربة مع أكثر من 120،000 نقطة بيانات ووجدوا أن أحجام منفذ العرض العليا كانت صغيرة في المقام الأول ، وربما أجهزة محمولة.",
      "تنصح المقالة بعدم استخدام نقاط توقف محددة وقيم ثابتة ، وبدلا من ذلك تدعو إلى المرونة وتسمح للمتصفح بتحديد أفضل النتائج بناء على الظروف."
    ],
    "commentSummary": [
      "يتعمق قسم المقالة والتعليقات في تعقيدات تصميم الويب ، ويناقش موضوعات مثل إطارات العرض والاستجابة وسهولة الاستخدام عبر الأجهزة المختلفة.",
      "تؤكد المحادثة على التحديات التي يواجهها المصممون عند التعامل مع متطلبات العملاء ، وتعطيل قدرات التكبير / التصغير ، وتنفيذ ميزات إمكانية الوصول.",
      "يتم التأكيد على الحاجة إلى تصميمات مدروسة وقابلة للتكيف لتحسين تجربة المستخدم على الأجهزة المختلفة ، إلى جانب قيود أدوات التصميم الحالية وصراعات إنشاء تخطيطات سلسة ومرنة."
    ],
    "points": 264,
    "commentCount": 173,
    "retryCount": 0,
    "time": 1692618570
  },
  {
    "id": 37216647,
    "title": "تزايد حصة الأمريكيين يفضلون المزيد من الطاقة النووية",
    "originLink": "https://www.pewresearch.org/short-reads/2023/08/18/growing-share-of-americans-favor-more-nuclear-power/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37216647",
    "commentBody": "",
    "originSummary": [
      "أظهر استطلاع حديث أجراه مركز بيو للأبحاث أن 57٪ من الأمريكيين يؤيدون الآن توسيع الطاقة النووية في الولايات المتحدة ، ارتفاعا من 43٪ في عام 2020.",
      "ومع ذلك ، تظل الطاقة الشمسية (82٪) وطاقة الرياح (75٪) أكثر تفضيلا من قبل الأمريكيين مقارنة بالطاقة النووية.",
      "وازداد التأييد للطاقة النووية بين الديمقراطيين والجمهوريين على حد سواء، حيث من المرجح أن يدعمها الرجال والجمهوريون ويعتقدون أن الحكومة يجب أن تشجع إنتاجها. وتمتلك الولايات المتحدة حاليا 93 مفاعلا للطاقة النووية يقع معظمها في الجنوب لكن العدد انخفض منذ ذروته في عام 1990 ربما بسبب مخاوف من وقوع حوادث وتوترات دولية."
    ],
    "commentSummary": [
      "الجدل الدائر حول الطاقة النووية متعدد الأوجه، حيث يجادل البعض حول فوائدها والبعض الآخر يدافع عن مصادر الطاقة المتجددة مثل الطاقة الشمسية وطاقة الرياح.",
      "يؤكد مؤيدو القوى النووية على فعاليتها من حيث التكلفة وملاءمتها للبيئة مقارنة بأشكال الطاقة الأخرى.",
      "يثير معارضو الطاقة النووية مخاوف بشأن تكاليفها المرتفعة ، والمخاطر المحتملة ، وقضايا السلامة ، والتنظيم ، وتخزين النفايات النووية ، وتأثير السياسة والصناعة على التصور العام."
    ],
    "points": 221,
    "commentCount": 236,
    "retryCount": 0,
    "time": 1692660086
  },
  {
    "id": 37216800,
    "title": "بودمان سطح المكتب يحتفل 500k التنزيلات",
    "originLink": "https://blog.podman.io/2023/08/celebrating-500k-downloads-the-podman-desktop-journey-%f0%9f%8e%89/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37216800",
    "commentBody": "",
    "originSummary": [
      "حقق Podman Desktop ، وهو مشروع حاوية مفتوح المصدر ، إنجازا مهما مع أكثر من 500000 عملية تنزيل.",
      "يعرب فريق Podman عن امتنانه لمساهمات المستخدمين وملاحظاتهم ويلتزم بتعزيز وظائف الأداة لاستخدام Kubernetes.",
      "يتم تشجيع المستخدمين على المشاركة في المناقشات التي تتمحور حول تحسين دعم Kubernetes، وتبسيط تثبيت الميزات وتكوينها، وتوسيع الوثائق."
    ],
    "commentSummary": [
      "يناقش المستخدمون أدوات إدارة الحاويات المختلفة مثل Podman و OrbStack و Docker Desktop.",
      "وهي تعبر عن الحاجة إلى تنمية محلية أسرع ولديها مخاوف بشأن الترخيص والتسعير.",
      "يشارك المستخدمون تجاربهم وتفضيلاتهم ، ويستكشفون بدائل ل Docker Desktop."
    ],
    "points": 219,
    "commentCount": 94,
    "retryCount": 0,
    "time": 1692661494
  },
  {
    "id": 37211675,
    "title": ".com القادمة وزيادة أسعار نطاقات .xyz",
    "originLink": "https://www.namecheap.com/blog/upcoming-com-and-xyz-domain-price-increase/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37211675",
    "commentBody": "",
    "originSummary": [
      "تقوم Namecheap ، وهي جهة تسجيل نطاقات ، بإخطار العملاء بالزيادات القادمة في الأسعار ل .COM و . نطاقات XYZ في سبتمبر.",
      "ستشهد تجديدات النطاقات .COM زيادة بنسبة 9٪ عبر جميع المسجلين ، بما في ذلك Namecheap.",
      "يتم تشجيع العملاء على تجديد نطاقات .COM الخاصة بهم قبل سبتمبر لتأمين الأسعار الحالية أو استكشاف بدائل لنطاقات .COM."
    ],
    "commentSummary": [
      "رفعت Namecheap مؤخرا أسعار تجديد نطاقات .com ، مما أدى إلى مناقشات حول الآثار المترتبة على الشركات.",
      "تم ذكر مزودي تسجيل النطاقات البديلة مثل Porkbun و Cloudflare ، ولكن أثيرت مخاوف بشأن انخفاض الأسعار والزيادات المحتملة في الأسعار في المستقبل.",
      "تعزى الزيادة في الأسعار إلى إذن Verisign برفع الأسعار ، مما أثار الإحباط والمناقشات حول قيمة مواقع الويب وإمكانية الوصول إليها."
    ],
    "points": 215,
    "commentCount": 313,
    "retryCount": 0,
    "time": 1692634802
  }
]
