[
  {
    "id": 37215557,
    "title": "यूब्लॉक ओरिजिन लाइट अब फ़ायरफ़ॉक्स पर उपलब्ध है",
    "originLink": "https://addons.mozilla.org/en-US/firefox/addon/ublock-origin-lite/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37215557",
    "commentBody": "",
    "originSummary": [
      "यूब्लॉक ओरिजिन लाइट फ़ायरफ़ॉक्स के लिए एक सामग्री अवरोधक एक्सटेंशन है जो विज्ञापनों, ट्रैकर्स और खनिकों को ब्लॉक करता है।",
      "एक्सटेंशन कुशल फ़िल्टरिंग के लिए एक घोषणात्मक दृष्टिकोण का उपयोग करता है और स्थापना पर व्यापक अनुमतियों की आवश्यकता नहीं है।",
      "उपयोगकर्ताओं के पास अधिक सटीक फ़िल्टरिंग के लिए विशिष्ट साइटों पर विस्तारित अनुमतियाँ देने का विकल्प होता है।"
    ],
    "commentSummary": [
      "चर्चा एं विज्ञापन-अवरुद्ध एक्सटेंशन के उपयोग और नैतिकता के आसपास केंद्रित हैं, जिसमें यूब्लॉक ओरिजिन और इसके विभिन्न संस्करणों पर ध्यान केंद्रित किया गया है।",
      "इन एक्सटेंशन ों के सुरक्षा लाभों और सीमाओं पर बहस की जा रही है, जिसमें संभावित हमले वैक्टर को कम करने की उनकी क्षमता और समझौता किए गए अपडेट के बारे में चिंताएं शामिल हैं।",
      "विज्ञापन-ब्लॉकिंग के नैतिक निहितार्थ, ऑनलाइन विज्ञापन की आक्रामक प्रकृति, और विज्ञापन-ब्लॉकर्स पर ब्राउज़र कार्यक्षमता में परिवर्तन के प्रभाव पर भी चर्चा की जा रही है।"
    ],
    "points": 566,
    "commentCount": 276,
    "retryCount": 0,
    "time": 1692653031
  },
  {
    "id": 37208083,
    "title": "जीएनयू समानांतर, आप मेरे पूरे जीवन में कहां रहे हैं?",
    "originLink": "https://alexplescan.com/posts/2023/08/20/gnu-parallel/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37208083",
    "commentBody": "",
    "originSummary": [
      "ब्लॉग पोस्ट में एंड-टू-एंड टेस्ट पास/फेल दरों पर आंकड़े इकट्ठा करने के लिए जीएनयू पैरेलल का उपयोग करने वाले लेखक के अनुभव पर चर्चा की गई है।",
      "जीएनयू समानांतर का उपयोग करके समानांतर निष्पादन ने प्रदर्शन में सुधार किया और अतिरिक्त कार्यक्षमता की पेशकश की।",
      "पोस्ट जीएनयू समानांतर की विशेषताओं पर जोर देती है, जैसे कि कॉनकरेंसी नियंत्रण, आउटपुट कैप्चर और लेखक की पुस्तक में वर्णित उन्नत क्षमताएं।"
    ],
    "commentSummary": [
      "चर्चा समानांतर कंप्यूटिंग में शेल कमांड और वाईएसएच, नुशेल और फिश जैसे वैकल्पिक उपकरणों की तुलना में जीएनयू समानांतर के फायदे और उपयोगिता की पड़ताल करती है।",
      "पर्ल, पायथन और हास्केल जैसी वैकल्पिक भाषाओं के साथ-साथ समानांतर प्रसंस्करण के लिए जेडएसएच में ज़ार्ग और पायथन में डीएस्क जैसे उपकरणों का उल्लेख किया गया है।",
      "बहस में सीपीयू कोर और जीपीयू डब्ल्यूजीपी / एसएम के बीच तुलना, जीपीएल लाइसेंस में उद्धरण नोटिस को शामिल करना और जीपीएल की व्याख्या करने में रिचर्ड स्टॉलमैन की भूमिका शामिल है। सॉफ्टवेयर अनुसंधान में उद्धरणों के महत्व और जीएनयू समानांतर के लेखक के उद्धरण या भुगतान का अनुरोध करने वाले विवाद को संबोधित किया गया है। समानांतर निष्पादन के लिए xargs और समानांतर का उपयोग करने के पेशेवरों और विपक्षों और थ्रेड / कार्यकर्ता पूल का उपयोग करने के लाभों पर चर्चा की जाती है। जीएनयू समानांतर समानांतर कंप्यूटिंग में अपनी बहुमुखी प्रतिभा और प्रभावशीलता के लिए मनाया जाता है।"
    ],
    "points": 432,
    "commentCount": 249,
    "retryCount": 0,
    "time": 1692617475
  },
  {
    "id": 37210953,
    "title": "अपने इलस्ट्रेटर को आग मत लगाओ",
    "originLink": "https://sambleckley.com/writing/dont-fire-your-illustrator.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37210953",
    "commentBody": "",
    "originSummary": [
      "लेखक एआई छवि जनरेटर के उपयोग की पड़ताल करता है और वे भौतिक मीडिया कलाकारों और वाणिज्यिक चित्रकारों सहित विभिन्न समूहों को कैसे प्रभावित कर सकते हैं।",
      "स्थिर प्रसार की अवधारणा को समझाया गया है, साथ ही छवि निर्माण को निर्देशित करने के लिए पाठ का उपयोग करने की चुनौतियों के साथ।",
      "एआई को कुछ प्रकार के चित्रण और लेखन कार्यों को बदलने की भविष्यवाणी की जाती है, लेकिन विशिष्ट परिणाम प्राप्त करना चुनौतीपूर्ण हो सकता है, और छवि बाधाओं के उपयोग का सुझाव दिया जाता है। लेखक एआई उत्पादों के महत्व पर जोर देता है जो एक इलस्ट्रेटर के वर्कफ़्लो में मूल रूप से एकीकृत होते हैं और वाणिज्यिक चित्रण को पूरा करने वाले भविष्य के एआई उत्पादों के लिए आशा व्यक्त करते हैं।"
    ],
    "commentSummary": [
      "आर्टिफिशियल इंटेलिजेंस (एआई) में कला और संगीत उद्योगों को महत्वपूर्ण रूप से प्रभावित करने की क्षमता है।",
      "चिंताओं में कलाकारों के लिए राजस्व में गिरावट और निगमों में धन की एकाग्रता शामिल है।",
      "स्ट्रीमिंग सेवाओं के कारण संगीत उद्योग ने पहले से ही बदलावों का अनुभव किया है, और एआई मानव प्रयासों को और बाधित कर सकता है।",
      "एआई संगीत उत्पादन में भी भूमिका निभा रहा है, जिससे एआई-जनित सामग्री के मूल्य और गुणवत्ता के बारे में सवाल उठ रहे हैं।",
      "कॉपीराइट मुद्दे और नए प्लेटफार्मों और समाधानों की आवश्यकता बहस के विषय हैं।",
      "इन उद्योगों पर एआई का समग्र प्रभाव अनिश्चित बना हुआ है, सकारात्मक और नकारात्मक दोनों परिणामों के साथ।"
    ],
    "points": 360,
    "commentCount": 291,
    "retryCount": 0,
    "time": 1692631991
  },
  {
    "id": 37211230,
    "title": "जीवन बचाना (2004)",
    "originLink": "https://www.folklore.org/StoryView.py?story=Saving_Lives.txt",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37211230",
    "commentBody": "",
    "originSummary": [
      "स्टीव जॉब्स ने मैकिन्टोश कंप्यूटर पर काम करने वाले इंजीनियरों को बूट टाइम में सुधार करने के लिए प्रेरित करते हुए उन्हें बताया कि हर 10 सेकंड में बचाए जाने से एक दर्जन लोगों की जान बच जाएगी।",
      "इंजीनियरों ने बाद के महीनों में बूट समय को 10 सेकंड से अधिक कम करने में सफलता हासिल की।",
      "यह कहानी स्टीव जॉब्स की नेतृत्व शैली और उनकी अपेक्षाओं को पूरा करने में इंजीनियरों के समर्पण पर प्रकाश डालती है।"
    ],
    "commentSummary": [
      "ग्राहक की जरूरतों को समझना और अंतर्निहित मुद्दों को संबोधित करना सॉफ्टवेयर डेवलपर्स के लिए उपयोगकर्ता संतुष्टि को प्राथमिकता देने के लिए महत्वपूर्ण है।",
      "धीमा सॉफ्टवेयर उपयोगकर्ता अनुभव को नकारात्मक रूप से प्रभावित कर सकता है और इसे तेजी से प्रदर्शन के लिए अनुकूलित किया जाना चाहिए।",
      "हार्डवेयर और सॉफ्टवेयर अनुकूलन में प्रगति ने तेजी से बूट समय को जन्म दिया है, जिससे समग्र उपयोगकर्ता अनुभव में सुधार हुआ है।",
      "ROM-आधारित ऑपरेटिंग सिस्टम के फायदे और नुकसान दोनों हैं और विशिष्ट उपयोग के मामलों के लिए सावधानीपूर्वक विचार किया जाना चाहिए।",
      "यूआई एनिमेशन उपयोगकर्ता अनुभव को बढ़ा सकते हैं, लेकिन उपयोगकर्ताओं को भारी या विचलित करने से बचने के लिए उनका विवेकपूर्ण उपयोग किया जाना चाहिए।",
      "एसएसडी एचडीडी पर महत्वपूर्ण लाभ प्रदान करते हैं, जिसमें तेजी से डेटा एक्सेस समय और बेहतर सिस्टम प्रतिक्रिया शामिल है।",
      "दक्षता और उत्पादकता के लिए सॉफ्टवेयर विकास में समय की बचत आवश्यक है।",
      "धीमे अपडेट और अपर्याप्त संचार प्लेटफ़ॉर्म सॉफ़्टवेयर उपयोगकर्ताओं और डेवलपर्स के बीच निराशा पैदा कर सकते हैं।",
      "स्टैक ओवरफ्लो को आलोचना और चिंताएं मिली हैं, जो वैकल्पिक प्लेटफार्मों और बेहतर मॉडरेशन की आवश्यकता पर प्रकाश डालती हैं।",
      "मदद मांगते समय, प्रभावी सहायता प्राप्त करने के लिए स्पष्ट और कार्रवाई योग्य जानकारी प्रदान करना महत्वपूर्ण है।"
    ],
    "points": 316,
    "commentCount": 283,
    "retryCount": 0,
    "time": 1692633078
  },
  {
    "id": 37211519,
    "title": "मैंने खराब एआई-जेनरेटेड छवियों पर इसे ठीक करके स्थिर प्रसार एक्सएल को स्मार्ट बनाया।",
    "originLink": "https://minimaxir.com/2023/08/stable-diffusion-xl-wrong/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37211519",
    "commentBody": "",
    "originSummary": [
      "मैक्स वूल्फ के ब्लॉग पोस्ट में स्टेबल डिफ्यूजन एक्सएल 1.0 (एसडीएक्सएल) पेश किया गया है, जो उच्च-रिज़ॉल्यूशन छवियों को उत्पन्न करने के लिए एक ओपन-सोर्स मॉडल है।",
      "लेखक एक मिडरेंज एल 4 जीपीयू के साथ क्लाउड वर्चुअल मशीन का उपयोग करने की अपनी प्रक्रिया साझा करता है और डिफ्यूज़र पायथन लाइब्रेरी में नई सुविधाओं पर प्रकाश डालता है।",
      "पोस्ट एसडीएक्सएल को ठीक करने के लिए एलओआरए के उपयोग की पड़ताल करता है, एलओआरए के साथ और बिना छवि पीढ़ी के उदाहरणों को दिखाता है, और एआई-जनित छवियों को बेहतर बनाने के लिए \"गलत प्रॉम्प्ट\" तकनीक पर चर्चा करता है।"
    ],
    "commentSummary": [
      "लेखक ने एआई-जनित छवियों का उपयोग करके स्थिर प्रसार एक्सएल मॉडल को ठीक करने में अपने अनुभव को साझा किया है।",
      "लेख मॉडल में व्यक्तिगत सुधार के लिए एक प्रतिक्रिया विकल्प को लागू करने का सुझाव देता है।",
      "एआई होर्डे और एलआईएओएन को मॉडल को ठीक करने में उपयोगकर्ता वरीयताओं के परीक्षण और एकत्र करने के लिए प्लेटफार्मों के रूप में उल्लेख किया गया है।"
    ],
    "points": 301,
    "commentCount": 63,
    "retryCount": 0,
    "time": 1692634167
  },
  {
    "id": 37213479,
    "title": "5 साल पहले वाल्व ने प्रोटॉन जारी किया था",
    "originLink": "https://www.gamingonlinux.com/2023/08/5-years-ago-valve-released-proton-forever-changing-linux-gaming/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37213479",
    "commentBody": "",
    "originSummary": [
      "वाइन के एक संशोधित संस्करण प्रोटॉन के वाल्व की रिलीज ने पांच साल पहले लोकप्रिय गेम को प्लेटफॉर्म पर चलाने में सक्षम करके लिनक्स गेमिंग को बदल दिया।",
      "इसने लिनक्स गेमिंग में उछाल लाया और स्टीम डेक के निर्माण में योगदान दिया।",
      "प्रोटॉन के चल रहे संवर्द्धन ने संगतता और प्रदर्शन में सुधार किया है, जिससे लिनक्स गेमर्स को गेम के विविध चयन तक पहुंच मिलती है, जिससे उत्साही उपयोगकर्ता प्रतिक्रिया मिलती है।"
    ],
    "commentSummary": [
      "वाल्व के प्रोटॉन गेमिंग प्लेटफॉर्म ने लिनक्स पर गेमिंग के लिए विंडोज के व्यवहार्य विकल्प के रूप में उपयोगकर्ताओं के बीच लोकप्रियता हासिल की है।",
      "वाल्व को ओपन सोर्स डेस्कटॉप के लिए अपने ग्राहक समर्थन और समर्पण के लिए प्रशंसा की जाती है, जबकि एपिक की इन क्षेत्रों में कमी के लिए आलोचना की जाती है।",
      "एपिक की विशिष्टता सौदों और डीआरएम-मुक्त प्लेटफार्मों की गिरावट के बारे में चिंताएं उठाई गई हैं।"
    ],
    "points": 274,
    "commentCount": 217,
    "retryCount": 0,
    "time": 1692642517
  },
  {
    "id": 37208211,
    "title": "आदर्श व्यूपोर्ट मौजूद नहीं है",
    "originLink": "https://viewports.fyi/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37208211",
    "commentBody": "",
    "originSummary": [
      "लेख स्क्रीन आकार और ब्राउज़र व्यूपोर्ट के विखंडन और डिजाइन निर्णयों में इस पर विचार करने के महत्व पर चर्चा करता है।",
      "लेखकों ने 120,000 से अधिक डेटा बिंदुओं के साथ एक प्रयोग किया और पाया कि शीर्ष व्यूपोर्ट आकार मुख्य रूप से छोटे, संभावित मोबाइल डिवाइस थे।",
      "लेख विशिष्ट ब्रेकपॉइंट्स और हार्ड मानों का उपयोग करने के खिलाफ सलाह देता है, इसके बजाय लचीलेपन की वकालत करता है और ब्राउज़र को शर्तों के आधार पर सर्वोत्तम परिणाम निर्धारित करने की अनुमति देता है।"
    ],
    "commentSummary": [
      "लेख और टिप्पणी अनुभाग वेब डिज़ाइन की जटिलताओं में उतरता है, विभिन्न उपकरणों में व्यूपोर्ट, जवाबदेही और प्रयोज्यता जैसे विषयों पर चर्चा करता है।",
      "वार्तालाप ग्राहकों की मांगों से निपटने, ज़ूमिंग क्षमताओं को अक्षम करने और पहुंच सुविधाओं को लागू करने के दौरान डिजाइनरों द्वारा सामना की जाने वाली चुनौतियों पर जोर देता है।",
      "विभिन्न उपकरणों पर उपयोगकर्ता अनुभव को बेहतर बनाने के लिए विचारशील और अनुकूलनीय डिजाइनों की आवश्यकता पर जोर दिया जाता है, साथ ही वर्तमान डिजाइन टूल की सीमाओं और द्रव और लचीले लेआउट बनाने के संघर्षों के साथ।"
    ],
    "points": 264,
    "commentCount": 173,
    "retryCount": 0,
    "time": 1692618570
  },
  {
    "id": 37216647,
    "title": "अमेरिकियों का बढ़ता हिस्सा अधिक परमाणु ऊर्जा के पक्ष में है",
    "originLink": "https://www.pewresearch.org/short-reads/2023/08/18/growing-share-of-americans-favor-more-nuclear-power/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37216647",
    "commentBody": "",
    "originSummary": [
      "प्यू रिसर्च सेंटर के एक हालिया सर्वेक्षण से पता चलता है कि 57% अमेरिकी अब संयुक्त राज्य अमेरिका में परमाणु ऊर्जा के विस्तार का समर्थन करते हैं, जो 2020 में 43% से ऊपर है।",
      "हालांकि, सौर ऊर्जा (82%) और पवन ऊर्जा (75%) परमाणु ऊर्जा की तुलना में अमेरिकियों द्वारा अधिक पसंदीदा बने हुए हैं।",
      "डेमोक्रेट और रिपब्लिकन दोनों के बीच परमाणु ऊर्जा के लिए समर्थन बढ़ गया है, पुरुषों और रिपब्लिकन को इसका समर्थन करने की अधिक संभावना है और मानते हैं कि सरकार को इसके उत्पादन को प्रोत्साहित करना चाहिए। संयुक्त राज्य अमेरिका में वर्तमान में 93 परमाणु ऊर्जा रिएक्टर हैं, जो मुख्य रूप से दक्षिण में स्थित हैं, लेकिन 1990 में अपने चरम के बाद से संख्या में गिरावट आई है, संभवतः दुर्घटनाओं और अंतर्राष्ट्रीय तनाव पर चिंताओं के कारण।"
    ],
    "commentSummary": [
      "परमाणु ऊर्जा के आसपास की बहस बहुमुखी है, कुछ इसके लाभों के लिए तर्क देते हैं और अन्य सौर और पवन जैसे नवीकरणीय ऊर्जा स्रोतों की वकालत करते हैं।",
      "परमाणु ऊर्जा के समर्थक ऊर्जा के अन्य रूपों की तुलना में इसकी लागत-प्रभावशीलता और पर्यावरण मित्रता पर जोर देते हैं।",
      "परमाणु ऊर्जा के विरोधी इसकी उच्च लागत, संभावित खतरों, सुरक्षा मुद्दों, विनियमन, परमाणु कचरे के भंडारण और सार्वजनिक धारणा पर राजनीति और उद्योग के प्रभाव के बारे में चिंता व्यक्त करते हैं।"
    ],
    "points": 221,
    "commentCount": 236,
    "retryCount": 0,
    "time": 1692660086
  },
  {
    "id": 37216800,
    "title": "पॉडमैन डेस्कटॉप 500,000 डाउनलोड का जश्न मनाता है",
    "originLink": "https://blog.podman.io/2023/08/celebrating-500k-downloads-the-podman-desktop-journey-%f0%9f%8e%89/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37216800",
    "commentBody": "",
    "originSummary": [
      "पॉडमैन डेस्कटॉप, एक ओपन-सोर्स कंटेनर प्रोजेक्ट, ने 500,000 से अधिक डाउनलोड के साथ एक महत्वपूर्ण मील का पत्थर हासिल किया है।",
      "पॉडमैन टीम उपयोगकर्ता के योगदान और प्रतिक्रिया के लिए आभार व्यक्त करती है और कुबेरनेट्स उपयोग के लिए उपकरण की कार्यक्षमता को बढ़ाने के लिए प्रतिबद्ध है।",
      "उपयोगकर्ताओं को कुबेरनेट्स समर्थन में सुधार, सुविधा स्थापना और कॉन्फ़िगरेशन को सुव्यवस्थित करने और प्रलेखन का विस्तार करने के आसपास केंद्रित चर्चाओं में भाग लेने के लिए प्रोत्साहित किया जाता है।"
    ],
    "commentSummary": [
      "उपयोगकर्ता पॉडमैन, ऑर्बस्टैक और डॉकर डेस्कटॉप जैसे विभिन्न कंटेनर प्रबंधन उपकरणों पर चर्चा कर रहे हैं।",
      "वे त्वरित स्थानीय विकास की आवश्यकता व्यक्त करते हैं और लाइसेंसिंग और मूल्य निर्धारण के बारे में चिंता करते हैं।",
      "उपयोगकर्ता अपने अनुभव और वरीयताओं को साझा कर रहे हैं, डॉकर डेस्कटॉप के विकल्प खोज रहे हैं।"
    ],
    "points": 219,
    "commentCount": 94,
    "retryCount": 0,
    "time": 1692661494
  },
  {
    "id": 37211675,
    "title": "आगामी .com और .xyz डोमेन मूल्य वृद्धि",
    "originLink": "https://www.namecheap.com/blog/upcoming-com-and-xyz-domain-price-increase/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37211675",
    "commentBody": "",
    "originSummary": [
      "Namecheche, एक डोमेन रजिस्ट्रार, ग्राहकों को .COM और  के लिए आगामी मूल्य वृद्धि के बारे में सूचित कर रहा है। XYZ डोमेन सितंबर में।",
      ".COM डोमेन नवीनीकरण सभी रजिस्ट्रारों में 9% की वृद्धि का अनुभव करेगा, जिसमें Namechepe भी शामिल है।",
      "ग्राहकों को वर्तमान दरों को सुरक्षित करने या .COM डोमेन के विकल्पों का पता लगाने के लिए सितंबर से पहले अपने .COM डोमेन को नवीनीकृत करने के लिए प्रोत्साहित किया जाता है।"
    ],
    "commentSummary": [
      "Namechepe ने हाल ही में .com डोमेन को नवीनीकृत करने के लिए कीमतें बढ़ा दीं, जिससे व्यवसायों के लिए निहितार्थ के बारे में चर्चा हुई।",
      "Porkbun और Cloudflare जैसे वैकल्पिक डोमेन पंजीकरण प्रदाताओं का उल्लेख किया गया है, लेकिन कम कीमतों और संभावित भविष्य की मूल्य वृद्धि के बारे में चिंताएं उठाई गई हैं।",
      "मूल्य वृद्धि के लिए वेरिसाइन की कीमतों को बढ़ाने की अनुमति को जिम्मेदार ठहराया जाता है, जिससे वेबसाइटों के मूल्य और पहुंच के बारे में निराशा और चर्चा होती है।"
    ],
    "points": 215,
    "commentCount": 313,
    "retryCount": 0,
    "time": 1692634802
  }
]
