[
  {
    "id": 41929174,
    "title": "Alles wat ik deze week met Claude Artifacts heb gebouwd",
    "originLink": "https://simonwillison.net/2024/Oct/21/claude-artifacts/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41929174",
    "commentBody": "",
    "originSummary": [
      "Simon Willison utforsket Claude's Artifacts-funksjon for å lage 14 interaktive Single Page Apps, og viste frem potensialet for rask prototyping og problemløsning.",
      "Projecten omvatten een URL naar Markdown-converter, een SQLite in WebAssembly (WASM) demo en een QR-code decoder, wat de veelzijdigheid van Artifacts benadrukt.",
      "Ondanks brukervennligheten bemerket Willison begrensninger som manglende evne til å foreta API-anrop og planlegger å utvikle sitt eget alternativ, og oppfordrer andre til å utforske Artifacts for LLM-baserte prosjekter."
    ],
    "commentSummary": [
      "Het integreren van AI-tools zoals Claude Artifacts in bestaande codebasen is uitdagend vanwege de noodzaak om professionele standaarden en conventies te handhaven.",
      "Ontwikkelaars geven er vaak de voorkeur aan om zelf code te schrijven om kwaliteit en compatibiliteit te waarborgen, hoewel AI-tools steeds vaker worden gebruikt voor taken zoals codegeneratie, refactoring en API-integratie.",
      "De betrouwbaarheid en juistheid van door AI gegenereerde code blijven zorgen baren, vooral voor complexe of kritieke toepassingen, ondanks mogelijke productiviteitsverhogingen."
    ],
    "points": 592,
    "commentCount": 417,
    "retryCount": 0,
    "time": 1729716733
  },
  {
    "id": 41936001,
    "title": "Rider is nu gratis voor niet-commercieel gebruik",
    "originLink": "https://www.jetbrains.com/rider/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41936001",
    "commentBody": "",
    "originSummary": [
      "JetBrains Rider is een geïntegreerde ontwikkelomgeving (IDE) die is afgestemd op .NET- en gamedevelopers, en biedt uitgebreide ondersteuning voor verschillende frameworks en game-engines.",
      "Het ondersteunt .NET-frameworks zoals ASP.NET Core en MAUI, evenals populaire game-engines zoals Unity, Unreal Engine en Godot.",
      "Dit maakt JetBrains Rider een veelzijdig hulpmiddel voor ontwikkelaars die werken met verschillende platforms en technologieën in het .NET-ecosysteem en game-ontwikkeling."
    ],
    "commentSummary": [
      "Rider, en integrert utviklingsmiljø (IDE) fra JetBrains, er nå gratis for ikke-kommersiell bruk, samtidig som Microsoft avvikler Visual Studio for Mac.",
      "Rider wordt goed gewaardeerd vanwege de integratie met game-ontwikkelingsplatforms zoals Godot, Unity en Unreal, en staat bekend om zijn snelheid en functies vergeleken met Visual Studio, hoewel sommige gebruikers problemen melden met intellisense in grote projecten.",
      "De gratis beschikbaarheid van Rider, samen met WebStorm en RustRover, is bedoeld om studenten en hobbyisten aan te trekken, wat mogelijk de gebruikersbasis van JetBrains voor toekomstige commerciële licenties kan uitbreiden, ondanks enkele zorgen over telemetrie en gegevensverzameling."
    ],
    "points": 471,
    "commentCount": 221,
    "retryCount": 0,
    "time": 1729781006
  },
  {
    "id": 41931572,
    "title": "Latenties van AWS-datacenters, gevisualiseerd",
    "originLink": "https://benjdd.com/aws/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41931572",
    "commentBody": "",
    "originSummary": [
      "AWS-datacenters latenties zijn gerapporteerd te overschrijden 200 milliseconden, wat een aanzienlijke vertraging is voor clouddiensten.",
      "Deze latentiegegevens werden verstrekt door Ben en zijn afkomstig van CloudPing, een tool die wordt gebruikt om de latentie naar AWS-datacenters te meten.",
      "Een hoge latentie kan de prestaties van applicaties en diensten die afhankelijk zijn van AWS-infrastructuur beïnvloeden, waardoor dit een cruciaal probleem is voor ontwikkelaars en bedrijven."
    ],
    "commentSummary": [
      "AWS-datacenters latencies worden in kaart gebracht om de reistijden van gegevens tussen regio's te tonen, cruciaal voor systeemarchitectuur en cloudmigraties.",
      "Discussies omvatten theoretische grenzen van datatransmissie, zoals de lichtsnelheid in glasvezel, en het gebruik van satellietverbindingen om de latentie te verminderen.",
      "Suggesties voor het verbeteren van de kaartvisualisatie zijn onder meer het toevoegen van een kleurenblindmodus en een optie voor een platte kaart, terwijl regionale infrastructuuruitdagingen bij het bereiken van lage latentie worden benadrukt."
    ],
    "points": 458,
    "commentCount": 184,
    "retryCount": 0,
    "time": 1729739903
  },
  {
    "id": 41929804,
    "title": "Diffusiespiegel voor wandmontage die reflecties in schilderijen verandert",
    "originLink": "https://www.matthieulc.com/posts/pablonet/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41929804",
    "commentBody": "",
    "originSummary": [
      "De discussie over de creativiteit van AI negeert vaak dat kunst gaat over het uitdrukken van iemands innerlijke wereld, niet alleen over technische vaardigheid.",
      "AI-gedreven kunstformer gjør det mulig for ikke-kunstnere å utforske kreativitet, som demonstrert av forfatterens bruk av StreamDiffusion for å forvandle webkamerafeeder til kunstneriske visuelle uttrykk.",
      "De auteur verbeterde hun AI-kunstopstelling door een LCD-frame te bouwen voor een permanente weergave en verbeterde de prestaties met TensorRT, waarbij ze de opstellingsdetails deelden voor anderen die geïnteresseerd zijn in soortgelijke projecten."
    ],
    "commentSummary": [
      "Een aan de muur gemonteerde diffusiespiegel transformeert reflecties in artistieke schilderijen, maar ondervindt uitdagingen met lage framesnelheden.",
      "Suggesties voor verbetering zijn onder andere het gebruik van het Websocket-protocol voor efficiënte gegevensoverdracht, het elimineren van JPEG-compressie en het groeperen van invoerframes.",
      "Het project wordt geprezen om zijn innovatie, wat discussies op gang brengt over kunst, technologie en mogelijke ontwikkelingen zoals gedeelde ervaringen, terwijl het ook zorgen over privacy en hardware oproept."
    ],
    "points": 432,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1729722261
  },
  {
    "id": 41930628,
    "title": "RF Hunter – Vind verborgen camera's en andere apparaten",
    "originLink": "https://github.com/RamboRogers/rfhunter",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41930628",
    "commentBody": "",
    "originSummary": [
      "Het project omvat het maken van een RF-signaalscanner met behulp van een ESP32-microcontroller en een AD8317 RF-detector om radiofrequentiesignalen te detecteren en meten. De gedetecteerde signaalsterkte wordt weergegeven op een OLED-scherm, wat het praktisch maakt voor het opsporen van verborgen camera's en afluisterapparatuur. Dit project is opmerkelijk vanwege de toepassing op het gebied van privacy en beveiliging, en biedt een doe-het-zelfoplossing voor het detecteren van ongeautoriseerde bewakingsapparatuur."
    ],
    "commentSummary": [
      "RF Hunter is een project dat gebruik maakt van een ESP32-microcontroller en een AD8317 RF-detector om naar RF-signalen te zoeken, wat helpt bij het opsporen van verborgen camera's en afluisterapparatuur.",
      "Het project heeft discussies op gang gebracht over alternatieve detectiemethoden, zoals thermische camera's en niet-lineaire junctiedetectoren, en de effectiviteit ervan in omgevingen met veel elektronica.",
      "Er is interesse in vooraf geassembleerde versies en mogelijke verbeteringen, waaronder toepassingen voor drone-detectie en het gebruik van gefaseerde arrays voor verbeterde detectiemogelijkheden."
    ],
    "points": 366,
    "commentCount": 116,
    "retryCount": 0,
    "time": 1729729296
  },
  {
    "id": 41931507,
    "title": "Mooi.c",
    "originLink": "https://github.com/aartaka/pretty.c",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41931507",
    "commentBody": "",
    "originSummary": [
      "Pretty C is een nieuwe scripttaal ontworpen om C-programmering te verbeteren door dynamische typisering, generieke iteratie en resource-tracking toe te voegen, terwijl compatibiliteit met C en zijn bibliotheken behouden blijft.",
      "Inspired by languages like Lua, Python, JavaScript, and Lisp, Pretty C introduces features such as type inference, generic printing, and enhanced for loops to simplify C programming.",
      "De taal is eenvoudig te integreren in bestaande C-projecten, waarbij slechts één headerbestand nodig is, en biedt hulpmiddelen zoals type-aliasen, nieuwe operatoren en macro's voor veelvoorkomende bewerkingen en foutafhandeling."
    ],
    "commentSummary": [
      "Pretty.c is een GitHub-project van aartaka dat syntactische suiker introduceert in C, waardoor het meer lijkt op talen zoals ALGOL, met als doel C-code te vereenvoudigen voor beginners. Het project omvat macro's en functies om compatibiliteit met bestaande C-bibliotheken te behouden, wat discussies op gang brengt over scripttalen, typen en het gebruik van macro's in C. Terwijl sommige gebruikers het project intrigerend vinden, stellen anderen vragen bij de praktische bruikbaarheid ervan voor serieuze projecten, aangezien het inspiratie haalt uit talen zoals Lisp om een leuke, alternatieve manier te bieden om C-code te schrijven."
    ],
    "points": 305,
    "commentCount": 178,
    "retryCount": 0,
    "time": 1729738918
  },
  {
    "id": 41928529,
    "title": "Playstation Vita-architectuur (Deel 1)",
    "originLink": "https://www.copetti.org/writings/consoles/playstation-vita/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41928529",
    "commentBody": "",
    "originSummary": [
      "De PlayStation Vita, uitgebracht tussen december 2011 en februari 2012, combineert videogaming met mobiele technologie en concurreert met multifunctionele apparaten.",
      "Sony introduceerde drie varianten: de originele PSVita, een slank model met een LCD-scherm en de PlayStation TV, elk met verschillende kenmerken.",
      "De PSVita wordt aangedreven door een ARM Cortex-A9 CPU en een PowerVR SGX543MP4+ GPU, die geavanceerde verwerkings- en multimediavermogens ondersteunt, inclusief achterwaartse compatibiliteit met PSP- en PS1-spellen."
    ],
    "commentSummary": [
      "De PlayStation Vita, ondanks geavanceerde hardwarefuncties zoals een OLED-scherm en dubbele analoge sticks, werd gehinderd door Sony's beslissingen, waaronder dure propriëtaire geheugenkaarten en onvoldoende ondersteuning voor games.",
      "De console stond voor zware concurrentie van smartphones en Nintendo's 3DS, wat leidde tot zijn commerciële mislukking, maar hij blijft geliefd bij liefhebbers vanwege zijn draagbaarheid en unieke aanbiedingen.",
      "De homebrew-gemeenschap blijft bloeien, biedt emulatie en aangepaste firmware, en veel gebruikers crediteren de Vita en zijn voorganger, de PSP, voor het wekken van hun interesse in programmeren en homebrew-gaming."
    ],
    "points": 255,
    "commentCount": 75,
    "retryCount": 0,
    "time": 1729711911
  },
  {
    "id": 41934746,
    "title": "2048 werd dit jaar 10, ik heb een bijgewerkte versie gemaakt om het te vieren",
    "originLink": "https://play2048.co",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41934746",
    "commentBody": "",
    "originSummary": [
      "Gabriele Cirulli, skaperen av det virale spillet 2048, har bestemt seg for å fokusere på å oppdatere spillet på heltid, og forlater sin tidligere jobb. - Nye oppdateringer inkluderer tillegg av powerups i samarbeid med Prime Gaming, samtidig som en klassisk modus for tradisjonelle spillere opprettholdes. - Cirulli uttrykker takknemlighet for spillets fortsatte popularitet og søker tilbakemeldinger fra samfunnet om disse utviklingene."
    ],
    "commentSummary": [
      "Gabriele Cirulli, de maker van het virale spel 2048, viert het 10-jarig jubileum met een bijgewerkte versie, waarin nieuwe functies zoals power-ups zijn toegevoegd, terwijl de klassieke modus behouden blijft.",
      "2048 werd oorspronkelijk ontwikkeld in slechts vijf dagen en werd een troostrijke sensatie voor velen, ondanks debatten over de originaliteit ervan vergeleken met het spel Threes.",
      "Cirulli uttrykker takknemlighet overfor samfunnet for deres støtte og inviterer til tilbakemeldinger på den nye versjonen, og fremhever spillets varige popularitet og unike identitet."
    ],
    "points": 229,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1729772127
  },
  {
    "id": 41931035,
    "title": "NetGuard – rootless Android outbound per-app OSS-brannmur, som LittleSnitch",
    "originLink": "https://netguard.me/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41931035",
    "commentBody": "",
    "originSummary": [
      "NetGuard is een Android-firewall-app die gebruikers in staat stelt om internettoegang per applicatie te blokkeren zonder roottoegang nodig te hebben. De app is open-source, ondersteunt Android 5.1 en later, en legt de nadruk op privacy door geen gebruikersgegevens bij te houden. Pro-functies, zoals verkeerslogboeken en netwerkfiltering, kunnen worden verkregen via in-app aankopen of donaties, zonder afhankelijkheid van Google-diensten."
    ],
    "commentSummary": [
      "NetGuard is een rootloze Android-firewall die app-verbindingen blokkeert, waarbij de uitgebreide tracking door apps wordt benadrukt en gebruikers in staat worden gesteld om verbindingen met Google-servers te blokkeren.",
      "Gebruikers merken beperkingen op, zoals de vereiste voor de VPN-service van Android, die de levensduur van de batterij kan beïnvloeden en conflicten kan veroorzaken met andere VPN's, wat discussies oproept over alternatieven zoals RethinkDNS en de netwerktoestemmingen van LineageOS.",
      "Enkele gebruikers geven de voorkeur aan gerootte oplossingen zoals AFWall+, en er zijn discussies over iOS-alternatieven en de afwezigheid van ingebouwde Android-firewall-API's."
    ],
    "points": 215,
    "commentCount": 121,
    "retryCount": 0,
    "time": 1729733476
  },
  {
    "id": 41932225,
    "title": "Vaarwel van een Linux-gemeenschapsvrijwilliger",
    "originLink": "https://lore.kernel.org/netdev/2m53bmuzemamzc4jzk2bj7tli22ruaaqqe34a2shtdtqrd52hp@alifh66en3rj/T/#u",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41932225",
    "commentBody": "",
    "originSummary": [
      "Serge Semin, en Linux-samfunnsfrivillig, kunngjorde sin avgang etter å ha blitt fjernet fra den offisielle listen over kjernevedlikeholdere av Greg Kroah-Hartman, med henvisning til samsvarskrav uten detaljert begrunnelse.",
      "Het gebrek aan uitleg voor de verwijdering heeft frustratie en teleurstelling veroorzaakt onder ontwikkelaars, wat zorgen oproept over de omgang met dergelijke situaties en de mogelijke negatieve impact op de gemeenschap.",
      "Ondanks zijn vertrek uitte Serge dankbaarheid jegens collega's, deelde hij zijn eerdere bijdragen en bood hij hulp aan degenen die informatie over zijn werk nodig hadden, terwijl hij ook zijn toekomstige plannen vermeldde."
    ],
    "commentSummary": [
      "Een Linux-gemeenschapsvrijwilliger van Baikal Electronics, geassocieerd met het Russische leger, werd van de lijst van Linux-kernelonderhouders verwijderd vanwege naleving van sancties.",
      "Deze actie heeft een debat aangewakkerd over de juridische en ethische implicaties, waarbij de afstemming met open-source principes in twijfel wordt getrokken.",
      "De situatie benadrukt de spanningen tussen juridische verplichtingen en de waarden van de open-sourcegemeenschap, wat zorgen oproept over de impact op bijdragen uit gesanctioneerde landen."
    ],
    "points": 192,
    "commentCount": 171,
    "retryCount": 0,
    "time": 1729747790
  },
  {
    "id": 41931392,
    "title": "TSMC snijdt klant af na ontdekking dat chips naar Huawei zijn gestuurd",
    "originLink": "https://www.bloomberg.com/news/articles/2024-10-23/tsmc-cuts-off-client-after-discovering-chips-diverted-to-huawei",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41931392",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "TSMC heeft een klantrelatie beëindigd nadat werd ontdekt dat chips naar Huawei waren gestuurd, wat een schending van internationale sancties betekende.",
      "Dit voorval heeft discussies op gang gebracht over de haalbaarheid van trackingchips en de moeilijkheden bij het handhaven van sancties binnen de wereldmarkt.",
      "De situatie onderstreept de complexiteit van internationale handel en de geopolitieke spanningen rond technologie-export, vooral tussen de VS, China en Taiwan."
    ],
    "points": 192,
    "commentCount": 110,
    "retryCount": 0,
    "time": 1729737563
  },
  {
    "id": 41929826,
    "title": "iOS 18.2 laat EU-gebruikers App Store, Safari, Berichten, Camera en Foto's verwijderen",
    "originLink": "https://www.macrumors.com/2024/10/23/ios-18-2-eu-delete-apps/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41929826",
    "commentBody": "",
    "originSummary": [
      "iOS 18.2 introduceert een functie waarmee EU-gebruikers kernapps zoals de App Store, Safari, Berichten, Camera en Foto's volledig kunnen verwijderen, in overeenstemming met de EU's Digital Markets Act.",
      "De apps Telefoon en Instellingen blijven niet-verwijderbaar, maar verwijderde apps kunnen opnieuw worden geïnstalleerd via de sectie 'App-installatie' in Instellingen.",
      "In tegenstelling kunnen gebruikers i de VS en andre landen alleen deze kernapps verbergen, niet volledig verwijderen."
    ],
    "commentSummary": [
      "iOS 18.2 introduceert een functie waarmee EU-gebruikers standaardapps zoals de App Store, Safari en Berichten kunnen verwijderen, in overeenstemming met EU-regelgeving.",
      "De update vekker debatt om hvorfor lignende forskrifter ikke blir anvendt på spillkonsoller som Xbox og PlayStation, med vekt på rollen til digital tilgang og innflytelsen fra store teknologiselskaper.",
      "De meningen er delte, med noen som ser på EUs handlinger som et løft for økonomiske muligheter og forbrukervalget, mens andre bekymrer seg for de potensielle negative effektene på brukeropplevelsen og markedsdynamikken."
    ],
    "points": 144,
    "commentCount": 192,
    "retryCount": 0,
    "time": 1729722404
  },
  {
    "id": 41929822,
    "title": "Mechanische Satoshi9000 analoge BTC-sleutelgenerator",
    "originLink": "https://news.ycombinator.com/item?id=41929822",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41929822",
    "commentBody": "",
    "originSummary": [
      "Er is en machine ontwikkeld for å generere pålitelige Bitcoin-nøkler ved å bruke analog tilfeldighet, som deretter konverteres til digital, noe som sikrer høy sikkerhet og pålitelighet.",
      "De machine is luchtgedicht, wat betekent dat deze geïsoleerd is van netwerken om ongeautoriseerde toegang te voorkomen, en is ontworpen om eenvoudig en mechanisch te zijn voor gebruiksgemak.",
      "Potentiële toepassingen omvatten gerandomiseerde klinische proeven, niet-technisch management, estate planning en elk scenario dat een intuïtief begrip van willekeur vereist."
    ],
    "commentSummary": [
      "De Satoshi9000 is een mechanische Bitcoin-sleutelgenerator die is ontworpen om veilige sleutels te produceren met behulp van analoge willekeurigheid, wat betrouwbaarheid garandeert.",
      "Het is luchtgedicht, wat betekent dat het werkt zonder een directe verbinding met het internet, waardoor de beveiliging wordt verbeterd door externe toegang te voorkomen.",
      "De enhetens enkelhet og intuitive design gjør den tilgjengelig for ulike bruksområder utover kryptovaluta, som randomiserte kliniske studier og eiendomsplanlegging, og appellerer til brukere i alle aldre."
    ],
    "points": 144,
    "commentCount": 52,
    "retryCount": 0,
    "time": 1729722388
  },
  {
    "id": 41935166,
    "title": "Welke Dier Deelt Jouw Lichaamsvetpercentage?",
    "originLink": "https://animalbodyfatmatch.netlify.app/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41935166",
    "commentBody": "",
    "originSummary": [
      "De forfatter opprettet et prosjekt der de sammenlignet sin egen kroppsfettprosent med ulike dyr, ved å bruke data som ble omgjort til en JSON-fil. De brukte ChatGPT for å utvikle et brukergrensesnitt (UI) og distribuerte prosjektet på Netlify, noe som viser hvor enkelt det er å bygge prosjekter med store språkmodeller (LLMs). Prosjektet fremhever de raske utviklingsmulighetene som moderne AI-verktøy gir, selv for spontane og personlige prosjekter."
    ],
    "commentSummary": [
      "Een gebruiker ontwikkelde een project dat menselijke lichaamsvetpercentages vergelijkt met die van dieren, met behulp van door AI gegenereerde afbeeldingen en gehost op Netlify, geïnspireerd door een YouTube-video. Het project leidde tot discussies over de nauwkeurigheid van lichaamsvetgegevens en meetmethoden, waarbij sommige gebruikers suggereerden om echte dierenfoto's te gebruiken voor betere herkenbaarheid. De maker stelde de GitHub-repository van het project beschikbaar voor verdere bijdragen en moedigde betrokkenheid van de gemeenschap aan."
    ],
    "points": 129,
    "commentCount": 89,
    "retryCount": 0,
    "time": 1729775533
  },
  {
    "id": 41936745,
    "title": "Skyvern (YC S23) – open-source AI-agent for browserautomatiseringer",
    "originLink": "https://github.com/Skyvern-AI/Skyvern",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41936745",
    "commentBody": "",
    "originSummary": [
      "Skyvern is een open-source tool die is ontworpen om browsergebaseerde workflows te automatiseren met behulp van Large Language Models (LLMs), en biedt een alternatief voor traditionele oplossingen zoals UI-Path of Selenium.",
      "De tool is verbeterd met functies zoals realtime actieweergave, livestreaming van browserinstanties, geauthenticeerde sessies en gecachte workflows, en heeft een vermindering van 80% in tokenkosten gezien.",
      "Skyvern heeft met succes klanten aangetrokken voor diverse toepassingen, waaronder het genereren van verzekeringsoffertes, sollicitaties en het automatiseren van e-commerce aankopen, en biedt $5 tegoed aan nieuwe gebruikers om zijn mogelijkheden te verkennen."
    ],
    "commentSummary": [
      "Skyvern, en Y Combinator Summer 2023 startup, biedt een open-source AI-tool die browserworkflows automatiseert met behulp van Large Language Models (LLMs), en helpt bij taken zoals het genereren van offertes en het ophalen van facturen.",
      "Belangrijke kenmerken zijn onder andere real-time actietracking, livestreaming van browserinstanties en workflow chaining, met de flexibiliteit om voorkeursmodellen te kiezen dankzij de open-source aard.",
      "Ondanks de verminderde tokenkosten blijft Skyvern duur, maar nieuwe gebruikers ontvangen $5 tegoed om de mogelijkheden te verkennen, en verdere informatie is toegankelijk op GitHub en hun website."
    ],
    "points": 128,
    "commentCount": 29,
    "retryCount": 0,
    "time": 1729785081
  }
]
