[
  {
    "id": 41877513,
    "title": "Pemindaian 3D rahasia di Mahkamah Agung Prancis",
    "originLink": "https://cosmowenman.substack.com/p/secret-3d-scans-in-the-french-supreme",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41877513",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Mahkamah Agung Prancis telah memutuskan bahwa publik berhak mengakses pemindaian 3D dari museum, menentang argumen museum bahwa akses tersebut akan berdampak negatif pada pendapatan mereka.",
      "Keputusan ini sejalan dengan kasus sebelumnya yang melibatkan Museum Mesir Berlin, di mana kekhawatiran tentang kehilangan pendapatan dari merilis pemindaian 3D patung Nefertiti dianggap menyesatkan.",
      "Putusan tersebut menekankan bahwa pendanaan publik untuk proyek digitalisasi menyiratkan kewajiban untuk menyediakan akses publik, meskipun museum lambat untuk mematuhinya, mencerminkan ketegangan antara akses publik dan kontrol institusional."
    ],
    "points": 453,
    "commentCount": 176,
    "retryCount": 0,
    "time": 1729241400
  },
  {
    "id": 41872813,
    "title": "Permainan catur tingkat grandmaster tanpa pencarian",
    "originLink": "https://github.com/google-deepmind/searchless_chess",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41872813",
    "commentBody": "",
    "originSummary": [
      "Teks ini menjelaskan bahwa repositori tersebut mengimplementasikan model transformer yang dilatih pada 10 juta permainan catur, mencapai Elo blitz Lichess sebesar 2895, melampaui jaringan AlphaZero tanpa menggunakan Monte Carlo Tree Search (MCTS). Ini mencakup skrip untuk pelatihan, evaluasi, dan pemecahan teka-teki, memerlukan Python 3.10, JAX dengan CUDA, Stockfish, dan Leela Chess Zero. Perangkat lunak ini dilisensikan di bawah Apache 2.0, dengan bobot model di bawah CC-BY 4.0, dan menyediakan petunjuk instalasi serta tautan unduhan dataset."
    ],
    "commentSummary": [
      "Teks ini membahas tentang pengembangan mesin catur yang bermain pada tingkat yang bukan Grandmaster, dengan tujuan menciptakan pengalaman yang lebih mirip manusia daripada permainan yang tidak realistis dari mesin tradisional. Alternatif seperti Maia dan KataGo disebutkan karena kemampuannya memberikan pengalaman catur yang lebih mirip manusia, menyoroti potensi jaringan saraf dalam meningkatkan mesin catur. Percakapan ini mengakui kompleksitas catur dan keterbatasan teknologi saat ini dalam sepenuhnya memecahkan permainan, menyarankan kombinasi algoritma pencarian dan jaringan saraf untuk meningkatkan kinerja."
    ],
    "points": 322,
    "commentCount": 146,
    "retryCount": 0,
    "time": 1729192400
  },
  {
    "id": 41874394,
    "title": "Teks C++: Ada tepat 8 bit dalam satu byte",
    "originLink": "https://www.open-std.org/jtc1/sc22/wg21/docs/papers/2024/p3477r0.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41874394",
    "commentBody": "",
    "originSummary": [
      "Teks tersebut mengusulkan bahwa C++ seharusnya secara resmi mensyaratkan byte 8-bit, sejalan dengan praktik perangkat keras dan perangkat lunak saat ini.",
      "Secara historis, makro CHAR_BIT memungkinkan variasi ukuran byte, tetapi sebagian besar sistem dan kompilator utama seperti GCC, LLVM, dan MSVC sekarang menggunakan byte 8-bit secara default.",
      "Menyesuaikan C++ dengan standar byte 8-bit akan menyederhanakan dukungan bahasa dan perpustakaan, karena arsitektur non-8-bit sebagian besar tidak relevan dengan pengembangan C++ modern."
    ],
    "commentSummary": [
      "Telah diajukan sebuah proposal untuk menstandarkan definisi byte sebagai 8 bit dalam bahasa pemrograman C++, yang saat ini sedang dalam pembahasan.",
      "Tawaran tersebut mencakup diskusi tentang standar floating-point IEEE dan semantiknya, menyoroti pentingnya representasi data yang konsisten.",
      "Konteks historis disediakan, mencatat bahwa sistem lama seperti UNIVAC dan Digital Signal Processors (DSPs) menggunakan byte yang bukan 8-bit, memicu perdebatan tentang relevansi modern dan potensi dampaknya terhadap standar C++."
    ],
    "points": 268,
    "commentCount": 305,
    "retryCount": 0,
    "time": 1729203675
  },
  {
    "id": 41873204,
    "title": "Kagi Pembaruan: Filter Gambar AI untuk Hasil Pencarian",
    "originLink": "https://help.kagi.com/kagi/features/exclude-ai-images.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41873204",
    "commentBody": "",
    "originSummary": [
      "Kagi telah memperkenalkan Filter Gambar AI untuk membantu pengguna mengelola gambar yang dihasilkan AI dalam hasil pencarian dengan menurunkan peringkat dan memberi label pada gambar tersebut.",
      "Filter tersebut menggunakan reputasi situs web alih-alih analisis gambar yang tepat, yang berarti beberapa konten AI mungkin masih muncul, tetapi pengguna dapat memblokir situs melalui personalisasi pencarian.",
      "Tampilan ini dikembangkan berdasarkan umpan balik pengguna dan filosofi AI Kagi, dengan perbaikan yang berkelanjutan dan umpan balik pengguna yang didorong untuk peningkatan."
    ],
    "commentSummary": [
      "Kagi telah meluncurkan filter gambar AI untuk hasil pencarian, yang menurunkan peringkat gambar dari situs web dengan persentase tinggi konten yang dihasilkan oleh AI.",
      "Pengguna memiliki opsi untuk menggunakan umpan uBlacklist guna mengecualikan situs gambar AI, sehingga meningkatkan pencarian konten yang autentik.",
      "Walaupun beberapa pengguna menghargai fitur-fitur Kagi, yang lain memperdebatkan efektivitas biaya dan ketergantungan filter AI pada reputasi situs daripada analisis gambar individu."
    ],
    "points": 266,
    "commentCount": 102,
    "retryCount": 0,
    "time": 1729195325
  },
  {
    "id": 41873606,
    "title": "Diabetes tipe 2: Pengobatan baru menghilangkan insulin untuk 86% pasien",
    "originLink": "https://scitechdaily.com/diabetes-breakthrough-new-treatment-eliminates-insulin-for-86-of-patients/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41873606",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Pengobatan baru untuk diabetes tipe 2, yang menggabungkan prosedur endoskopi dan semaglutide, telah menunjukkan hasil yang menjanjikan, menghilangkan kebutuhan akan insulin pada 86% pasien.",
      "Studi tersebut, meskipun dibatasi oleh ukuran sampel kecil yang terdiri dari 14 peserta, menunjukkan manfaat potensial, yang mungkin dipengaruhi oleh penurunan berat badan dan perubahan pola makan.",
      "Tingkat keberlanjutan jangka panjang dan dampak dari perawatan ini terhadap perubahan gaya hidup masih harus ditentukan."
    ],
    "points": 264,
    "commentCount": 118,
    "retryCount": 0,
    "time": 1729198014
  },
  {
    "id": 41876750,
    "title": "Penggunaan situs web statis untuk arsip kecil",
    "originLink": "https://alexwlchan.net/2024/static-websites/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41876750",
    "commentBody": "",
    "originSummary": [
      "Penulis menggunakan situs web statis untuk mengatur arsip digital, menemukan bahwa situs web tersebut lebih efisien daripada sistem file tradisional seperti macOS Finder.",
      "Metode ini melibatkan pembuatan situs HTML sederhana untuk berbagai koleksi file, memungkinkan penjelajahan yang mudah dan penambahan metadata serta tag.",
      "Inspirasi dari platform seperti ekspor akun Twitter, pendekatan ini menekankan keberlanjutan, fleksibilitas, dan pemeliharaan minimal, dengan sumber daya seperti \"HTML for People\" oleh Blake Watson direkomendasikan bagi mereka yang tertarik mengadopsi sistem ini."
    ],
    "commentSummary": [
      "Diskusi berfokus pada penggunaan situs web statis untuk pengarsipan, menyoroti metode untuk mengorganisir dan menyimpan data, seperti file HTML dengan gambar yang disematkan dan Markdown untuk kesederhanaan dan ketahanan di masa depan.",
      "Alat seperti Obsidian dan Syncthing disukai untuk menyinkronkan dan mengelola catatan, dengan skrip yang digunakan untuk mengonversi data menjadi Markdown atau HTML agar mudah diakses.",
      "Teks tersebut menyoroti keuntungan dari teks biasa dan situs statis untuk pengelolaan data pribadi, menekankan kesederhanaan dan aksesibilitas jangka panjang."
    ],
    "points": 253,
    "commentCount": 51,
    "retryCount": 0,
    "time": 1729231959
  },
  {
    "id": 41878290,
    "title": "Format kata sandi kuat yang dihasilkan oleh Apple Passwords",
    "originLink": "https://rmondello.com/2024/10/07/apple-passwords-generated-strong-password-format/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41878290",
    "commentBody": "",
    "originSummary": [
      "Format kata sandi kuat Apple menggunakan \"kata\" dua suku kata untuk membuat kata sandi seperti \"hupvEw-fodne1-qabjyg,\" sehingga lebih mudah untuk diketik dan diingat.",
      "Password ini memiliki panjang 20 karakter, termasuk huruf kecil, tanda hubung, angka, dan memiliki entropi 71 bit, memastikan keamanan dan kompatibilitas dengan banyak situs web.",
      "Tata letak ini menghindari istilah yang menyinggung dan dijelaskan dalam sebuah pembicaraan tahun 2018 oleh Ricky Mondello, menyoroti fokus Apple pada langkah-langkah keamanan yang ramah pengguna."
    ],
    "commentSummary": [
      "Generator kata sandi Apple memprioritaskan kegunaan dengan membuat kata sandi yang kuat tanpa karakter khusus, sehingga lebih mudah untuk diketik di berbagai keyboard.",
      "Perdebatan yang sedang berlangsung berpusat pada menyeimbangkan kompleksitas kata sandi dengan kenyamanan pengguna, karena aturan kata sandi yang ketat dapat menyebabkan frustrasi pengguna dan berpotensi menurunkan keamanan.",
      "Entropi, yang mengukur keacakan, lebih penting untuk keamanan kata sandi daripada variasi karakter, menantang anggapan bahwa kata sandi yang kompleks secara inheren lebih aman."
    ],
    "points": 252,
    "commentCount": 180,
    "retryCount": 0,
    "time": 1729249937
  },
  {
    "id": 41873957,
    "title": "Kenapa semua orang menjalankan versi Postgres yang kuno?",
    "originLink": "https://neon.tech/blog/why-does-everyone-run-ancient-postgres-versions",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41873957",
    "commentBody": "",
    "originSummary": [
      "Banyak pengguna Postgres enggan untuk meningkatkan ke versi terbaru, seperti Postgres 17, karena kompleksitas dan waktu yang terlibat, meskipun versi yang lebih lama dapat diandalkan. Peningkatan menawarkan peningkatan kinerja dan fitur baru, tetapi bisa menjadi tantangan karena potensi masalah kompatibilitas, yang memerlukan perencanaan dan pelaksanaan yang hati-hati. Alat seperti pgversions.com dan inisiatif oleh perusahaan seperti Neon, yang menawarkan fitur seperti replikasi logis dan opsi peningkatan satu klik, bertujuan untuk menyederhanakan proses peningkatan dan mendorong pengguna untuk tetap mengikuti peningkatan kinerja dan kompatibilitas."
    ],
    "commentSummary": [
      "Memperbarui Postgres sering dihindari karena kompleksitasnya, potensi kesalahan, dan waktu henti yang signifikan yang dapat ditimbulkannya.",
      "Tahap peningkatan memerlukan versi sebelumnya untuk diinstal, yang dapat bertentangan dengan kebijakan sistem, terutama di lingkungan Docker.",
      "Pengguna biasanya hanya melakukan upgrade ketika diperlukan, seperti saat sebuah versi mencapai akhir masa pakainya, meskipun versi yang lebih baru menawarkan perbaikan."
    ],
    "points": 206,
    "commentCount": 369,
    "retryCount": 0,
    "time": 1729200209
  },
  {
    "id": 41876821,
    "title": "Factorio – Memvisualisasikan ketergantungan bahan konstruksi",
    "originLink": "https://community.wolfram.com/groups/-/m/t/1793319",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41876821",
    "commentBody": "",
    "originSummary": [
      "Teks: Komunitas Wolfram adalah platform bagi pengguna untuk terhubung, memecahkan masalah, dan berbagi ide tentang topik seperti pengembangan game dan grafik Mathematica.",
      "Sebuah postingan oleh Sander Huisman menyoroti penggunaan Mathematica untuk memvisualisasikan ketergantungan dalam permainan Factorio, yang melibatkan otomatisasi proses untuk menciptakan item-item kompleks.",
      "Komunitas menyediakan sumber daya seperti dokumentasi Wolfram Language dan mendorong partisipasi dalam diskusi untuk mengeksplorasi produk dan layanan Wolfram."
    ],
    "commentSummary": [
      "Penggemar Factorio sedang mendiskusikan alat seperti YAFC dan Foreman2 untuk memvisualisasikan ketergantungan bahan konstruksi, yang sangat penting untuk permainan yang efisien.",
      "Ekspansi DLC Factorio 2.0 yang dinantikan diharapkan menambah kompleksitas, memicu antusiasme di kalangan pemain yang membandingkannya dengan permainan strategi lain seperti Civilization.",
      "Komunitas dengan antusias menantikan mekanik baru dalam ekspansi, dengan diskusi yang menyoroti sifat adiktif dari permainan dan dampaknya terhadap produktivitas."
    ],
    "points": 176,
    "commentCount": 81,
    "retryCount": 0,
    "time": 1729232734
  },
  {
    "id": 41879854,
    "title": "Pergi Memo Plan9",
    "originLink": "https://pehringer.info/go_plan9_memo.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41879854",
    "commentBody": "",
    "originSummary": [
      "Penulis mencapai peningkatan kinerja yang signifikan sebesar 450% dalam perhitungan dengan mengeksplorasi assembly Plan9 saat mengembangkan paket SIMD (Single Instruction, Multiple Data) untuk bahasa pemrograman Go.",
      "Ini menyoroti potensi penggunaan assembly Plan9 untuk mengoptimalkan kinerja dalam pengembangan perangkat lunak, terutama dalam tugas-tugas komputasi.",
      "Tulisan tersebut menekankan pentingnya mengeksplorasi berbagai teknik dan alat pemrograman untuk meningkatkan efisiensi dan kinerja perangkat lunak."
    ],
    "commentSummary": [
      "Seorang pengembang melaporkan peningkatan kinerja yang signifikan sebesar 450% dalam perhitungan SIMD (Single Instruction, Multiple Data) dengan menggunakan assembly Plan9 bersama bahasa pemrograman Go.",
      "Teks tersebut menyoroti bahasa assembly unik Go, yang dipengaruhi oleh Plan9, dan keuntungannya untuk kompilasi silang di berbagai platform.",
      "Teks tersebut juga membahas hubungan historis Go dengan Plan9 dan kompleksitas yang terlibat dalam memasukkan operasi SIMD ke dalam pustaka standar Go."
    ],
    "points": 155,
    "commentCount": 51,
    "retryCount": 0,
    "time": 1729262187
  },
  {
    "id": 41878281,
    "title": "Kerja sama erat antara Microsoft dan OpenAI menunjukkan tanda-tanda keretakan",
    "originLink": "https://www.nytimes.com/2024/10/17/technology/microsoft-openai-partnership-deal.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41878281",
    "commentBody": "",
    "originSummary": [
      "Kerja sama OpenAI dengan Microsoft mengalami ketegangan akibat tekanan finansial dan ketidaksepakatan, meskipun Microsoft telah menginvestasikan $13 miliar.",
      "OpenAI berupaya untuk merundingkan kembali kesepakatannya dengan Microsoft untuk mendapatkan lebih banyak daya komputasi dan mengurangi biaya, sementara Microsoft sedang mendiversifikasi investasinya dalam usaha AI lainnya.",
      "OpenAI juga sedang menjajaki investasi dari perusahaan lain, termasuk kesepakatan komputasi senilai $10 miliar dengan Oracle, dan memiliki klausul kontrak dengan Microsoft yang memungkinkan renegosiasi jika mencapai kecerdasan umum buatan (AGI)."
    ],
    "commentSummary": [
      "Kerja sama antara Microsoft dan OpenAI dilaporkan sedang mengalami ketegangan, dengan para kritikus mempertanyakan kepercayaan terhadap OpenAI dan definisi kesuksesannya.",
      "Terdapat perdebatan yang sedang berlangsung mengenai apakah OpenAI memiliki keunggulan kompetitif yang signifikan dibandingkan perusahaan seperti Google, Meta, dan Anthropic, bersamaan dengan kekhawatiran tentang keberlanjutan dan biaya model AI.",
      "Diskusi mencakup skeptisisme tentang AI yang mencapai Kecerdasan Umum Buatan (AGI) dan ketakutan bahwa ketergantungan pada AI dapat menyebabkan atrofi keterampilan, dengan artikel tersebut mengandalkan banyak sumber anonim untuk klaimnya."
    ],
    "points": 150,
    "commentCount": 201,
    "retryCount": 0,
    "time": 1729249870
  },
  {
    "id": 41875792,
    "title": "Pointer pintar untuk kernel",
    "originLink": "https://lwn.net/Articles/992055/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41875792",
    "commentBody": "",
    "originSummary": [
      "Proyek Rust-for-Linux sedang mengeksplorasi integrasi manfaat smart-pointer Rust ke dalam kernel Linux, yang memerlukan pointer khusus agar sesuai dengan model memori kernel.",
      "Diskusi Xiangfei Ding menyoroti kemampuan penunjuk pintar kustom untuk meniru penunjuk bawaan, dengan fokus pada fitur eksperimental seperti pengubahan ukuran dan pengiriman dinamis, serta adanya RFC (Request for Comments) untuk menstabilkannya.",
      "Artikel tersebut membandingkan pendekatan Rust yang berfokus pada keamanan dengan ketergantungan C pada dokumentasi untuk menangani invarian dan model memori, menekankan relevansi model memori kernel Linux dan interaksinya dengan atomik Rust."
    ],
    "commentSummary": [
      "Proposal plugin GitHub untuk GCC (GNU Compiler Collection) sedang dibahas untuk smart pointers di kernel Linux, dengan saran untuk secara resmi mengusulkannya kepada tim kernel.",
      "Percakapan tersebut membandingkan fitur keamanan Rust, seperti penggunaan `unsafe`, dengan manajemen memori C, menyoroti keseimbangan antara keamanan dan fleksibilitas dalam pemrograman.",
      "Diskusi tersebut menekankan pentingnya memahami baik abstraksi tingkat tinggi maupun operasi tingkat rendah, serta menganjurkan pengetahuan dasar dalam sistem tertanam untuk meningkatkan pengembangan kernel."
    ],
    "points": 144,
    "commentCount": 91,
    "retryCount": 0,
    "time": 1729217409
  },
  {
    "id": 41875108,
    "title": "SOFA - Mulai Sering Selesai Jarang",
    "originLink": "https://tilde.town/~dozens/sofa/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41875108",
    "commentBody": "",
    "originSummary": [
      "SOFA adalah kolektif hacker/seni yang mendorong memulai proyek tanpa tekanan untuk menyelesaikannya, dengan fokus pada pengalaman dan pengembangan keterampilan.",
      "Kelompok ini mempromosikan fleksibilitas dalam identitas dan minat, memungkinkan individu untuk menghentikan aktivitas seperti membaca atau pemrograman kapan pun mereka mau.",
      "SOFA menantang norma-norma masyarakat dengan menganjurkan untuk melepaskan proyek-proyek yang tidak lagi bermanfaat bagi Anda, menekankan nilai perjalanan dibandingkan penyelesaian."
    ],
    "commentSummary": [
      "Konsep \"Mulai Sering Selesai Jarang\" (SOFA) mendorong untuk memulai banyak proyek tanpa kewajiban untuk menyelesaikannya, mempromosikan eksplorasi daripada penyelesaian.",
      "Filosofi ini dikontraskan dengan pernikahan tradisional, menyoroti pandangan yang berbeda tentang komitmen dan kebahagiaan pribadi.",
      "Pendapat bervariasi mengenai apakah SOFA mendorong pertumbuhan pribadi dan eksplorasi minat atau merusak disiplin dan komitmen jangka panjang."
    ],
    "points": 144,
    "commentCount": 89,
    "retryCount": 0,
    "time": 1729210066
  },
  {
    "id": 41878095,
    "title": "Perbaikan Kinerja LINQ di Net 9.0",
    "originLink": "https://blog.ndepend.com/net-9-0-linq-performance-improvements/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41878095",
    "commentBody": "",
    "originSummary": [
      ".NET 9.0 memperkenalkan peningkatan kinerja yang signifikan untuk LINQ (Language Integrated Query), meningkatkan efisiensi dalam berbagai skenario. Peningkatan utama termasuk penggunaan Span untuk iterasi yang lebih cepat dan metode TryGetSpan(), mengoptimalkan iterasi atas array dan daftar. Penggunaan iterator khusus dan SIMD (Single Instruction, Multiple Data) meningkatkan operasi seperti Count(), First(), Last(), dan penjumlahan bilangan bulat, membuat LINQ lebih cepat dan lebih efisien di .NET 9.0."
    ],
    "commentSummary": [
      "Ekstensi IEnumerable dari LINQ memungkinkan C# ditulis dalam gaya fungsional, menawarkan optimasi kinerja yang mirip dengan yang ada di Haskell, tetapi dapat menghasilkan kode yang kompleks jika tidak digunakan dengan bijaksana.",
      "Beberapa pengembang memilih Dapper daripada Entity Framework karena masalah kinerja, dan ada seruan bagi Microsoft untuk meningkatkan sintaks dan kinerja LINQ, terutama terkait alokasi lambda.",
      "Meskipun memiliki kemampuan, LINQ dapat menjadi tantangan bagi tim yang kurang berpengalaman dalam pemrograman fungsional, dan ekosistem .NET kadang-kadang dikritik karena kompleksitasnya dan dokumentasi yang kurang komprehensif dibandingkan dengan bahasa lain."
    ],
    "points": 142,
    "commentCount": 135,
    "retryCount": 0,
    "time": 1729247990
  },
  {
    "id": 41879072,
    "title": "Teks yang Membantu Mengakhiri Apartheid",
    "originLink": "https://www.wired.com/story/plaintext-you-can-now-see-the-code-that-ended-apartheid/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41879072",
    "commentBody": "",
    "originSummary": [
      "John Graham-Cumming, Chief Technology Officer Cloudflare, berhasil mendekripsi sebuah file terenkripsi berusia 30 tahun yang terkait dengan upaya anti-apartheid di Afrika Selatan.",
      "Teks tersebut adalah bagian dari sistem komunikasi aman yang dikembangkan oleh Tim Jenkin untuk Kongres Nasional Afrika (ANC) menggunakan metode enkripsi one-time pad, yang penting untuk komunikasi aman selama Operasi Vula.",
      "Teks yang telah didekripsi sekarang bersifat sumber terbuka di GitHub, menampilkan peran signifikan teknologi dalam aktivisme sejarah dan perjuangan melawan apartheid."
    ],
    "commentSummary": [
      "Tulisan di Wired menyoroti penggunaan kode oleh Tim Jenkin, termasuk one-time pads dan komputer 8-bit, dalam perjuangan melawan apartheid di Afrika Selatan.",
      "Ini mengeksplorasi dampak historis dari teknologi-teknologi ini, bersama dengan peran protes dan tokoh-tokoh seperti Nelson Mandela, dalam mencapai transisi yang damai.",
      "Artikel tersebut dibatasi aksesnya oleh paywall, tetapi tautan arsip tersedia bagi mereka yang tertarik untuk mengakses konten lengkapnya."
    ],
    "points": 133,
    "commentCount": 64,
    "retryCount": 0,
    "time": 1729256721
  }
]
