[
  {
    "id": 38153573,
    "title": "Zkoumání technických problémů a vysokých systémových požadavků měst: Skylines 2.",
    "originLink": "https://blog.paavo.me/cities-skylines-2-performance/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38153573",
    "commentBody": "",
    "originSummary": [
      "Města: Skylines 2, hra založená na simulaci, byla vydána s mnoha problémy, včetně slabého výkonu a herních chyb.",
      "Tato hra má vysoké systémové nároky kvůli náročnosti na grafický procesor a použití implementace Entity Component System a kompilátoru Burst, které jsou součástí technologií DOTS enginu Unity 2022, což je u takových her neobvyklé.",
      "Přestože vývojáři uznávají a uvádějí, že na jejich řešení potřebují hodně času, nabízejí tyto problémy užitečný vhled do složitostí vývoje her."
    ],
    "commentSummary": [
      "Města: Skylines 2 se při svém uvedení na trh potýkala s několika problémy s výkonem a hratelností, které z velké části souvisely s použitím implementace Entity Component System (ECS) a kompilátoru Burst, který je součástí technologií DOTS enginu Unity 2022.",
      "Hra má vysoké systémové požadavky; na simulační hru je náročná na grafický procesor a vyžaduje drahou grafickou kartu pro hraní v 60 FPS, což bylo předmětem kritiky.",
      "Kromě problémů s výkonem jsou problémy způsobeny také experimentálním texturováním a přílišnou detailností modelů postav. Vývojáři si tyto problémy uvědomují, ale zdůrazňují, že jejich řešení vyžaduje značné úsilí."
    ],
    "points": 840,
    "commentCount": 538,
    "retryCount": 0,
    "time": 1699206847
  },
  {
    "id": 38162435,
    "title": "Sbírka zdrojů si klade za cíl zlepšit znalosti vývojářů v oblasti manipulace s DOM pomocí Vanilla JavaScriptu",
    "originLink": "https://phuoc.ng/collection/html-dom/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38162435",
    "commentBody": "",
    "originSummary": [
      "Prostředí pro vývoj webových aplikací se stále vyvíjí a nástroje jako Angular, VueJS, React, Solid a Svelte pomáhají spravovat objektový model dokumentu (DOM), ale vývojáři stále potřebují s DOM přímo pracovat.",
      "Proto byla vytvořena sbírka zdrojů, která vývojářům pomůže zvládnout manipulaci s DOM pomocí jednoduchého jazyka JavaScript. Tyto zdroje obsahují řadu strategií pro úlohy, jako je dynamická aktualizace oblíbených ikon na základě preferencí uživatele a výpočet doby čtení webové stránky.",
      "Zdroje nabízejí živé ukázky, rady, osvědčené postupy a podporu pro různé moderní prohlížeče - včetně Internet Exploreru."
    ],
    "commentSummary": [
      "Prostředí pro vývoj webových aplikací se neustále vyvíjí a moderní nástroje jako Angular, VueJS, React, Solid a Svelte se snaží pomáhat při správě objektového modelu dokumentu (DOM). Vývojáři si však zachovávají úroveň přímé interakce s DOM.",
      "Byla vytvořena sbírka zdrojů, která vývojářům pomůže zvládnout manipulaci s DOM pomocí vanilla JavaScriptu, včetně dynamických aktualizací favikony na základě preferencí uživatele, výpočtu doby čtení webové stránky a vkládání HTML na aktuální pozici prvku contentEditable.",
      "Tyto zdroje nabízejí živé ukázky, tipy, osvědčené postupy a podporu pro různé moderní prohlížeče včetně Internet Exploreru."
    ],
    "points": 277,
    "commentCount": 82,
    "retryCount": 0,
    "time": 1699278090
  },
  {
    "id": 38156030,
    "title": "Lupus cerebritis: Hudebníkův boj se ztrátou a obnovou vnímání času",
    "originLink": "https://www.salon.com/2023/11/05/a-brain-injury-removed-my-ability-to-perceive-time-heres-what-its-like-in-a-world-without-it/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38156030",
    "commentBody": "",
    "originSummary": [
      "Tento příběh se zaměřuje na boj hudebnice s lupus cerebritis, vzácnou formou lupusu, která způsobuje těžký zánět mozku a ovlivňuje její poznávání a vnímání času.",
      "Nemoc vážně ovlivnila její hudební schopnosti, protože ztratila cit v ruce, zhoršila paměť a zhoršila porozumění. Zdůraznila zásadní roli časového smyslu při synchronních hudebních výkonech.",
      "Přestože se jí po uzdravení plně nevrátila paměť, hudebnice si cení navrácené schopnosti provozovat hudbu. Hovoří také o vědeckých výzkumech, které ukazují, že mozek využívá k měření času více smyslových vstupů a epizodických vzpomínek."
    ],
    "commentSummary": [
      "Autorka, hudebnice, se dělí o své zkušenosti s lupusovou cerebritidou, vzácným onemocněním způsobujícím těžký zánět mozku a ovlivňujícím kognitivní schopnosti, včetně vnímání, paměti a chápání času.",
      "Profesionální hráči na smyčcové nástroje potřebují při vystoupeních přesnou synchronizaci, kterou její nemoc narušila. Vysvětluje, že vnímání času v mozku není řízeno jedinou oblastí, ale integruje mnoho smyslových vstupů, přičemž rozhodující roli hraje tvorba epizodické paměti.",
      "Navzdory dlouholetému boji a ne úplnému obnovení dřívější bystrosti paměti autorka oceňuje obnovení svých hudebních schopností."
    ],
    "points": 273,
    "commentCount": 154,
    "retryCount": 0,
    "time": 1699221201
  },
  {
    "id": 38155544,
    "title": "Představujeme WireHub: Nový generátor a správce konfigurace WireGuard, který hledá první zpětnou vazbu",
    "originLink": "https://www.wirehub.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38155544",
    "commentBody": "",
    "originSummary": [
      "Vývojář pracuje na projektu WireHub, který využívá Django a minimální JavaScript. WireHub je spravovaný generátor konfigurace WireGuard, který umožňuje uživatelům přizvat ostatní, aby se stali součástí sítí, a ovládat jejich konfiguraci/zařízení.",
      "Přestože je WireHub stále ve fázi beta, jeho tvůrce aktivně hledá první zpětnou vazbu od technologické komunity.",
      "Jedinečná prodejní nabídka WireHubu spočívá v jeho funkčnosti jako hostovaného a uživatelsky přívětivého správce konfigurace WireGuard, který umožňuje snadnější připojení k síti a správu konfigurace."
    ],
    "commentSummary": [
      "Vývojář pracuje na projektu WireHub, který využívá Django a minimální JavaScript.",
      "WireHub je hostovaný generátor/správce konfigurací WireGuard, který umožňuje uživatelům zvát ostatní do sítí a spravovat jejich vlastní konfigurace nebo zařízení.",
      "Přestože je WireHub v současné době ve fázi beta, snaží se získat od komunity první zpětnou vazbu."
    ],
    "points": 272,
    "commentCount": 66,
    "retryCount": 0,
    "time": 1699217673
  },
  {
    "id": 38156486,
    "title": "Intel 80386: 8086: Procesor, který změnil pravidla hry, ovládl trh a připravil půdu pro moderní výpočetní techniku",
    "originLink": "https://www.xtof.info/intel80386.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38156486",
    "commentBody": "",
    "originSummary": [
      "Procesor Intel 80386, známý také jako 386, využíval plochý paměťový prostor a poskytoval virtuální paměť, což jej označilo za významného inovátora v oblasti procesorů.",
      "Uvedení počítače 386 na trh změnilo prodejní strategii společnosti Intel, která se stala výhradním dodavatelem procesorů a ovládla trh s procesory x86.",
      "Jednotka pro správu paměti 386 umožnila efektivní přístup k paměti a moderní rozšíření výpočetní techniky a její přijetí připravilo půdu pro pokročilý vývoj, jako jsou systémy Windows a Linux."
    ],
    "commentSummary": [
      "Počítač Intel 80386 neboli 386 byl významným technologickým milníkem díky svému transformačnímu vlivu na trh s osobními počítači, především díky využití plochého paměťového prostoru a poskytování virtuální paměti.",
      "Model 386 znamenal změnu v přístupu společnosti Intel k prodeji a umožnil jí monopolizovat trh dodavatelů procesorů, zatímco konkurenti jako IBM a AMD se zaměřili na jiné oblasti.",
      "V počítači 386 se objevila jednotka pro správu paměti (MMU), která způsobila revoluci v přístupu k paměti a připravila půdu pro moderní výpočetní techniku. Její zavedení vedlo k dominanci společnosti Intel na trhu x86 a následnému vývoji platforem, jako jsou Windows a Linux."
    ],
    "points": 261,
    "commentCount": 158,
    "retryCount": 0,
    "time": 1699224482
  },
  {
    "id": 38161016,
    "title": "Společnost Prossimo představila první stabilní verzi sudo-rs, bezpečnější verzi linuxového nástroje sudo, napsanou v jazyce Rust",
    "originLink": "https://www.memorysafety.org/blog/sudo-first-stable-release/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38161016",
    "commentBody": "",
    "originSummary": [
      "Softwarová společnost Prossimo vydala první stabilní verzi sudo-rs, přepracované verze běžného linuxového nástroje sudo, napsané v programovacím jazyce Rust.",
      "Projekt sudo-rs se soustředí na zvýšení bezpečnosti sudo a zaměřuje se na zmírnění chyb souvisejících se správou paměti spolu s komplexní sadou testů pro odhalování chyb.",
      "Nový systém sudo-rs je začleněn do operačního systému Wolfi Linux, přičemž vnější bezpečnostní audit je naplánován na září 2023. Projekt finančně podpořily nadace NLnet Foundation a společnost Amazon Web Services."
    ],
    "commentSummary": [
      "Softwarová společnost Prossimo uvedla na trh první stabilní verzi nástroje sudo-rs, což je upravený model široce používaného linuxového nástroje sudo implementovaný v programovacím jazyce Rust.",
      "Projekt sudo-rs si klade za cíl zvýšit bezpečnost sudo a řešit četné chyby související se správou paměti pomocí zjednodušení a rozsáhlé sady testů, která našla chyby v původním sudo.",
      "sudo-rs je nyní součástí operačního systému Wolfi Linux a v září 2023 projde externí bezpečnostní revizí. Projekt finančně podpořily nadace NLnet Foundation a Amazon Web Services."
    ],
    "points": 235,
    "commentCount": 157,
    "retryCount": 0,
    "time": 1699268304
  },
  {
    "id": 38161452,
    "title": "Představujeme žebřík: a 1ft.io: Nová alternativa k 12ft.io a 1ft.io s otevřeným zdrojovým kódem a možností přizpůsobení",
    "originLink": "https://github.com/kubero-dev/ladder",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38161452",
    "commentBody": "",
    "originSummary": [
      "Autor vyvinul open-source alternativu k některým službám, u kterých zjistil nedostatky ve funkčnosti.",
      "Alternativní řešení je napsáno v jazyce Golang, což je staticky typovaný kompilovaný jazyk původně vyvinutý ve společnosti Google.",
      "Tento nový software je plně přizpůsobitelný, takže uživatelé mohou přizpůsobit jeho chování svým specifickým potřebám."
    ],
    "commentSummary": [
      "Autor vytvořil open-source alternativu k některým službám kvůli nespokojenosti s jejich funkčností.",
      "Alternativní software byl vyvinut pomocí staticky typovaného kompilovaného programovacího jazyka Golang.",
      "Tato nová alternativa je plně přizpůsobitelná, takže si ji uživatelé mohou upravit podle svých konkrétních potřeb."
    ],
    "points": 224,
    "commentCount": 97,
    "retryCount": 0,
    "time": 1699272284
  },
  {
    "id": 38160703,
    "title": "FFmpeg vylepšuje překódování videa zavedením vícevláknových potrubí",
    "originLink": "https://twitter.com/FFmpeg/status/1721275669336707152",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38160703",
    "commentBody": "",
    "originSummary": [
      "Společnost FFmpeg, celosvětově významný transkodér videa, oznámila vylepšení svých služeb, zejména vícevláknové transkódovací pipeline.",
      "Aktualizace byla oficiálně oznámena 5. listopadu 2023."
    ],
    "commentSummary": [
      "FFmpeg, přední světový transkodér videa, vylepšuje své funkce zavedením vícevláknových transkódovacích potrubí.",
      "Cílem této modernizace, která byla oficiálně oznámena 5. listopadu 2023, je zlepšit kvalitu služeb.",
      "Vícevláknová transkódovací linka umožňuje softwaru provádět více transkódování současně, což zvyšuje efektivitu."
    ],
    "points": 221,
    "commentCount": 56,
    "retryCount": 0,
    "time": 1699265554
  },
  {
    "id": 38155541,
    "title": "Zasvěcený průvodce rozhraním příkazového řádku GNU Debugger pro začátečníky",
    "originLink": "https://beej.us/guide/bggdb/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38155541",
    "commentBody": "",
    "originSummary": [
      "\"Beejův stručný průvodce GDB\" je příručka pro začátečníky, která podrobně seznamuje s nástrojem GNU Debugger (gdb), který slouží k ladění programů prostřednictvím příkazového řádku terminálu.",
      "Příručka se zabývá různými aspekty používání gdb, včetně spuštění debuggeru, správy bodů přerušení, sledování proměnných, práce s výpisy jádra a dalších. Je užitečná zejména pro programátory, kteří se rozhodli nepoužívat integrované vývojové prostředí (IDE).",
      "Uživatelům také poskytuje znalosti o vytváření personalizovaného rozhraní front-end pomocí \"strojového interpretu rozhraní\" gdb, GDB/MI, a návod na správu rozvržení oken v režimu textového uživatelského rozhraní (TUI). Tato příručka je licencována pod licencí Creative Commons."
    ],
    "commentSummary": [
      "\"Beejův stručný průvodce GDB\" je příručka pro začátečníky, která je určena těm, kteří se při programování vzdávají integrovaného vývojového prostředí (IDE).",
      "Příručka poskytuje podrobný přehled o gdb a zahrnuje různé příkazy, jako je spuštění debuggeru, konfigurace bodů přerušení, zkoumání proměnných a zpracování výpisů jádra.",
      "Dále vysvětluje, jak vytvářet personalizované front-end rozhraní pomocí \"překladače strojového rozhraní\" gdb, GDB/MI, a správu rozvržení oken v režimu textového uživatelského rozhraní (TUI)."
    ],
    "points": 205,
    "commentCount": 29,
    "retryCount": 0,
    "time": 1699217638
  },
  {
    "id": 38160161,
    "title": "Mozilla přechází při vývoji Firefoxu z Mercurialu na Git: Dvoufázový přístup",
    "originLink": "https://groups.google.com/a/mozilla.org/g/firefox-dev/c/QnfydsDj48o/m/8WadV0_dBQAJ",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38160161",
    "commentBody": "",
    "originSummary": [
      "Společnost Mozilla zveřejnila plány na přesunutí vývoje prohlížeče Firefox z nástroje Mercurial do systému Git, a to kvůli problémům se správou obou nástrojů.",
      "Přestože bude repozitář přesunut na GitHub, Mozilla bude pokračovat v současném procesu přispívání a v tuto chvíli nebude přijímat žádosti o stažení.",
      "Přechod bude probíhat ve dvou fázích: první zahrnuje změny, které se týkají především vývojářů, a druhá se týká převodu back-endové infrastruktury z Mercurialu na Git. Zahájení procesu bude následovat po plánovacím období trvajícím nejméně šest měsíců."
    ],
    "commentSummary": [
      "Společnost Mozilla se rozhodla změnit vývojový proces Firefoxu z Mercurialu na Git kvůli náročnosti údržby obou systémů.",
      "I přes přesunutí repozitáře na GitHub Mozilla plánuje zachovat stávající pracovní postup a prozatím nebude přijímat žádosti o stažení.",
      "Přechod bude probíhat ve dvou fázích: nejprve se zaměříme na změny, které ovlivní vývojáře, a později na migraci backendové infrastruktury. Tento proces, který bude zahájen po minimálně šestiměsíčním plánovacím období, znamená zásadní změnu v přístupu Mozilly ke správě kódu."
    ],
    "points": 201,
    "commentCount": 165,
    "retryCount": 0,
    "time": 1699260604
  },
  {
    "id": 38158529,
    "title": "Chez Schéma sloučení poboček: Připravuje se vydání verze v10.0",
    "originLink": "https://groups.google.com/g/chez-scheme/c/D7g6mIcYLNU",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38158529",
    "commentBody": "",
    "originSummary": [
      "Matthew Flatt a správci Chez Scheme plánují sloučit různé verze Chez Scheme, aby zefektivnili jeho kód a vydali verzi v10.0.",
      "Po sloučení bude kód v racket/ChezScheme téměř totožný s hlavní větví v cisco/ChezScheme, přičemž všechny změny budou provedeny opatrně, aby byla zachována podstata a kvalita Chez Scheme.",
      "Na rozdíl od současné praxe se zaváděcí soubory portable bytecode (pb) již nebudou odkazovat na podmodul Git, ale budou začleněny přímo do úložiště cisco/ChezScheme."
    ],
    "commentSummary": [
      "Matthew Flatt a správci Chez Scheme plánují sloučit stávající větve Chez Scheme, které se nacházejí na dvou odkazech GitHubu, s cílem převést kód v cisco/ChezScheme na verzi v9.9.9-pre-release.20 a pokročit směrem k vydání verze v10.0.",
      "Po sloučení bude obsah větve racket/ChezScheme přesně kopírovat hlavní větev cisco/ChezScheme, přičemž změny budou pečlivě kontrolovány, aby byl zachován charakter a kvalita Chez Scheme.",
      "Pozoruhodné je, že sloučený cisco/ChezScheme nebude odkazovat na podmodul Git pro spouštěcí soubory portable bytecode (pb) a místo toho je začlení do úložiště cisco/ChezScheme."
    ],
    "points": 200,
    "commentCount": 61,
    "retryCount": 0,
    "time": 1699241700
  },
  {
    "id": 38154045,
    "title": "Nový výukový program vysvětluje, jak hostovat webové stránky na systému ESP32",
    "originLink": "https://esp.khalsalabs.com",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38154045",
    "commentBody": "",
    "originSummary": [
      "Webová stránka, vytvořená 1. listopadu 2023, se nachází na ESP32, sérii levných mikrokontrolérů typu system-on-a-chip s nízkou spotřebou energie.",
      "Nabízí návod, jak hostovat webové stránky v systému ESP32, a poskytuje cenné informace zájemcům o využití tohoto systému pro své stránky.",
      "Vytvoření této výukové webové stránky ukazuje praktické využití systému ESP32 a odhaluje jeho potenciál pro hostování webových stránek."
    ],
    "commentSummary": [
      "Webová stránka, založená 1. listopadu 2023, je umístěna na ESP32, což je řada levných mikrokontrolérů s nízkou spotřebou energie a integrovaným rozhraním Wi-Fi a Bluetooth ve dvou režimech.",
      "Tato stránka obsahuje výukový program, který ukazuje, jak hostovat webové stránky na ESP32, a nabízí uživatelům návod, jak tuto technologii využít.",
      "Nabízí praktické příležitosti k technickému vzdělávání pro ty, kteří chtějí porozumět webhostingu na nízkopříkonových mikrokontrolérech, jako je ESP32."
    ],
    "points": 196,
    "commentCount": 160,
    "retryCount": 0,
    "time": 1699209084
  },
  {
    "id": 38158309,
    "title": "milliFORTH: prohlášen za nejmenší skutečný programovací jazyk",
    "originLink": "https://github.com/fuzzballcat/milliForth",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38158309",
    "commentBody": "",
    "originSummary": [
      "milliFORTH, programovací jazyk FORTH, je dosud nejmenší skutečný programovací jazyk, který zabírá pouze 422 bajtů, takže je dostatečně malý, aby se vešel do 512bajtového zaváděcího sektoru.",
      "Ačkoli sektorFORTH toho dosáhl již dříve, milliFORTH je ještě menší a překonává velikost sektoruLISP2 o 14 bajtů. Navzdory své minimalistické povaze neohrožuje efektivitu programování.",
      "Úpravy v milliFORTH zahrnují odstranění 'tib', ořezané zpracování chyb, nefunkční klávesu delete, sestavenou binárku sector.asm, která je kompatibilní s emulátory, a nástroj pro kontrolu velikosti binárky."
    ],
    "commentSummary": [
      "MilliFORTH, který má velikost pouhých 422 bajtů, se prohlašuje za nejmenší existující skutečný programovací jazyk, který je dokonce dostatečně malý na to, aby se vešel do 512bajtového zaváděcího sektoru.",
      "Jazyk FORTH, na kterém je milliFORTH založen, je minimalistický jazyk, který obsahuje jen několik slov pro funkčnost, a přesto si zachovává efektivitu programování.",
      "Nový milliFORTH má oproti svému předchůdci, sectorFORTH, některé změny, včetně absence tib, omezeného zpracování chyb a nefunkční klávesy pro mazání. Obsahuje také sestavenou binárku sector.asm a nástroj pro zobrazení velikosti binárky."
    ],
    "points": 187,
    "commentCount": 47,
    "retryCount": 0,
    "time": 1699239803
  },
  {
    "id": 38155324,
    "title": "Fermentované obilí přitahuje a omamuje medvědy grizzly, což vede k úmrtí ve vlaku v Montaně",
    "originLink": "https://cowboystatedaily.com/2023/11/04/63-grizzlies-some-drunk-on-fermented-grain-killed-by-trains-in-montana/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38155324",
    "commentBody": "",
    "originSummary": [
      "Od 80. let 20. století zahynulo podél železniční trati poblíž národního parku Glacier v Montaně značné množství medvědů grizzly, především v důsledku intoxikace zkvašeným obilím vysypaným z vagonů.",
      "Směs rozsypaného obilí a vlhkosti iniciuje kvašení, které přitahuje medvědy, přičemž v roce 2021 již byla hlášena tři úmrtí v důsledku zásahu vlakem.",
      "Ačkoli jsou navrhována zmírňující opatření, jako je snížení množství obilí v železničních vagonech a stanovení hlukových limitů ve známých \"smrtících zónách\", byla dosud přijata jen omezená opatření k vyřešení tohoto problému."
    ],
    "commentSummary": [
      "Od 80. let minulého století v okolí národního parku Glacier v Montaně tragicky zahynuly desítky medvědů grizzly v důsledku intoxikace zkvašeným obilím uniklým z vagónů.",
      "V roce 2021 zemřeli po srážce s vlakem zatím tři medvědi, což naznačuje, že tento problém přetrvává.",
      "Mezi možná řešení patří snížení množství obilí v železničních vagonech a umístění hlukových spouští v rozpoznaných \"zónách smrti\", ale ke zmírnění počtu mrtvých bylo přijato jen málo opatření."
    ],
    "points": 184,
    "commentCount": 140,
    "retryCount": 0,
    "time": 1699216148
  },
  {
    "id": 38157466,
    "title": "Použití hardwarového klíče RTL-SDR pro příjem digitálních rozhlasových stanic NRSC-5: Komplexní průvodce",
    "originLink": "https://github.com/theori-io/nrsc5",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38157466",
    "commentBody": "",
    "originSummary": [
      "Program nrsc5 využívá klíč RTL-SDR pro příjem digitálních rozhlasových stanic NRSC-5 a nabízí rozhraní příkazového řádku i API.",
      "Uživatel musí program zkompilovat podle uvedeného průvodce, který obsahuje výslovné pokyny pro různé konfigurace systému, jakož i testování ukázkových souborů a řešení problémů.",
      "Další příkazy jsou k dispozici pro přechod a ukončení zvukového programu. Pro bezproblémový provoz v systému Windows se uživatelům doporučuje provést úpravy pomocí Zadig na ovladači USB."
    ],
    "commentSummary": [
      "nrsc5 je program, který využívá klíč RTL-SDR pro příjem digitálních rozhlasových stanic NRSC-5 a poskytuje rozhraní příkazového řádku a API pro vývoj dalších aplikací.",
      "Program je dodáván s komplexními pokyny pro sestavení na různých systémech, jako je Ubuntu, Debian, Raspbian a Windows, s použitím různých možností sestavení, spolu s radami pro řešení problémů a testování s ukázkovým souborem zachycení.",
      "Uživatelům se doporučuje používat program Zadig, aby předešli chybám změnou ovladače USB, zejména v systémech Windows, a jsou jim k dispozici klávesové příkazy pro přepínání zvukových programů, ukončování a volby příkazového řádku."
    ],
    "points": 176,
    "commentCount": 65,
    "retryCount": 0,
    "time": 1699231668
  }
]
