[
  {
    "id": 38153573,
    "title": "Odkrywanie problemów technicznych i wysokich wymagań systemowych Cities: Skylines 2",
    "originLink": "https://blog.paavo.me/cities-skylines-2-performance/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38153573",
    "commentBody": "",
    "originSummary": [
      "Cities: Skylines 2, gra oparta na symulacji, została wydana z licznymi problemami, w tym słabą wydajnością i błędami w rozgrywce.",
      "Ta gra ma wysokie wymagania systemowe ze względu na intensywność GPU, w połączeniu z wykorzystaniem implementacji Entity Component System i kompilatora Burst, będącego częścią technologii DOTS silnika Unity 2022, co jest nietypowe dla takich gier.",
      "Pomimo tego, że deweloperzy przyznają i wskazują na potrzebę poświęcenia znacznej ilości czasu na ich rozwiązanie, kwestie te oferują przydatny wgląd w zawiłości tworzenia gier."
    ],
    "commentSummary": [
      "Cities: Skylines 2 zostało uruchomione z kilkoma problemami z wydajnością i rozgrywką, w dużej mierze związanymi z wykorzystaniem implementacji Entity Component System (ECS) i kompilatora Burst, będącego częścią technologii DOTS silnika Unity 2022.",
      "Gra ma wysokie wymagania systemowe; jak na grę symulacyjną jest wymagająca pod względem GPU i wymaga drogiej karty graficznej do rozgrywki w 60 FPS, co było przedmiotem krytyki.",
      "Poza kwestiami wydajności, problemy wynikają również z eksperymentalnego teksturowania i nadmiernej szczegółowości modeli postaci. Deweloperzy dostrzegli te problemy, ale podkreślają, że ich rozwiązanie wymaga znacznego wysiłku."
    ],
    "points": 840,
    "commentCount": 538,
    "retryCount": 0,
    "time": 1699206847
  },
  {
    "id": 38162435,
    "title": "Kolekcja zasobów ma na celu zwiększenie biegłości programistów w manipulowaniu DOM za pomocą Vanilla JavaScript",
    "originLink": "https://phuoc.ng/collection/html-dom/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38162435",
    "commentBody": "",
    "originSummary": [
      "Środowisko programowania stron internetowych nadal rozwija się dzięki narzędziom takim jak Angular, VueJS, React, Solid i Svelte, które pomagają w zarządzaniu obiektowym modelem dokumentu (DOM), ale programiści nadal muszą wchodzić w bezpośrednią interakcję z DOM.",
      "Uznając to, stworzono zbiór zasobów, aby pomóc programistom w opanowaniu manipulacji DOM przy użyciu prostego JavaScript. Zasoby te obejmują liczne strategie dotyczące zadań, takich jak dynamiczne aktualizowanie ulubionych ikon w oparciu o preferencje użytkownika i obliczanie czasu odczytu strony internetowej.",
      "Zasoby oferują demonstracje na żywo, porady, najlepsze praktyki i wsparcie dla różnych nowoczesnych przeglądarek - w tym Internet Explorer."
    ],
    "commentSummary": [
      "Środowisko programowania stron internetowych stale ewoluuje, a nowoczesne narzędzia, takie jak Angular, VueJS, React, Solid i Svelte, mają na celu pomoc w zarządzaniu obiektowym modelem dokumentu (DOM). Deweloperzy utrzymują jednak poziom bezpośredniej interakcji z DOM.",
      "Zbiór zasobów został opracowany, aby pomóc programistom w opanowaniu manipulacji DOM przy użyciu vanilla JavaScript, obejmując dynamiczne aktualizacje favicon w oparciu o preferencje użytkownika, obliczanie czasu odczytu strony internetowej i wstawianie HTML w bieżącej pozycji elementu contentEditable.",
      "Zasoby te oferują demonstracje na żywo, wskazówki, najlepsze praktyki i wsparcie dla różnych nowoczesnych przeglądarek, w tym Internet Explorer."
    ],
    "points": 277,
    "commentCount": 82,
    "retryCount": 0,
    "time": 1699278090
  },
  {
    "id": 38156030,
    "title": "Toczniowe zapalenie mózgu: Zmagania muzyka z utratą i odzyskaniem percepcji czasu",
    "originLink": "https://www.salon.com/2023/11/05/a-brain-injury-removed-my-ability-to-perceive-time-heres-what-its-like-in-a-world-without-it/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38156030",
    "commentBody": "",
    "originSummary": [
      "Ta relacja skupia się na walce muzyka z toczniowym zapaleniem mózgu, rzadką formą tocznia powodującą poważne zapalenie mózgu, które wpłynęło na jej funkcje poznawcze i postrzeganie czasu.",
      "Choroba poważnie wpłynęła na jej zdolności muzyczne z powodu utraty czucia w ramieniu, upośledzonej pamięci i upośledzonego rozumienia. Podkreśliło to kluczową rolę wyczucia czasu w synchronicznych występach muzycznych.",
      "Pomimo tego, że jej powrót do zdrowia nie skutkował w pełni przywróconą pamięcią, muzyk docenia odzyskaną zdolność do wykonywania muzyki. Omawia również badania naukowe wykazujące, że mózg wykorzystuje wiele bodźców sensorycznych i epizodycznych wspomnień do pomiaru czasu."
    ],
    "commentSummary": [
      "Autorka, muzyk, dzieli się swoimi doświadczeniami z toczniowym zapaleniem mózgu, rzadkim schorzeniem powodującym ciężki stan zapalny mózgu i wpływającym na zdolności poznawcze, w tym odczuwanie, pamięć i rozumienie czasu.",
      "Profesjonalni smyczkowcy potrzebują precyzyjnej synchronizacji podczas występów, a jej choroba zaburzyła tę umiejętność. Jak wyjaśnia, postrzeganie czasu przez mózg nie jest zarządzane przez pojedynczy region, ale integruje liczne bodźce sensoryczne, przy czym kluczową rolę odgrywa tworzenie pamięci epizodycznej.",
      "Pomimo wieloletniej walki i nie odzyskania w pełni dawnej ostrości pamięci, autorka wyraża wdzięczność za odzyskanie umiejętności muzycznych."
    ],
    "points": 273,
    "commentCount": 154,
    "retryCount": 0,
    "time": 1699221201
  },
  {
    "id": 38155544,
    "title": "Przedstawiamy WireHub: Nowy generator i menedżer konfiguracji WireGuard poszukujący wczesnych opinii",
    "originLink": "https://www.wirehub.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38155544",
    "commentBody": "",
    "originSummary": [
      "Deweloper pracuje nad projektem o nazwie WireHub, wykorzystującym Django i minimalny JavaScript. WireHub to zarządzany generator konfiguracji WireGuard, który umożliwia użytkownikom zapraszanie innych do sieci i kontrolowanie ich konfiguracji/urządzeń.",
      "WireHub, choć wciąż znajduje się w fazie beta, twórca aktywnie poszukuje wczesnych opinii od społeczności technologicznej.",
      "Unikalna propozycja sprzedaży WireHub polega na jego funkcjonalności jako hostowanego i przyjaznego dla użytkownika menedżera konfiguracji WireGuard, umożliwiającego łatwiejsze połączenia sieciowe i zarządzanie konfiguracją."
    ],
    "commentSummary": [
      "Deweloper pracuje nad projektem o nazwie WireHub, wykorzystującym Django i minimalny JavaScript.",
      "WireHub to hostowany generator / menedżer konfiguracji WireGuard, który umożliwia użytkownikom zapraszanie innych do dołączania do sieci i zarządzania własnymi konfiguracjami lub urządzeniami.",
      "Mimo że WireHub znajduje się obecnie w fazie beta, firma stara się uzyskać wczesne opinie od społeczności."
    ],
    "points": 272,
    "commentCount": 66,
    "retryCount": 0,
    "time": 1699217673
  },
  {
    "id": 38156486,
    "title": "Intel 80386: Procesor zmieniający zasady gry, który zdominował rynek i utorował drogę nowoczesnym komputerom",
    "originLink": "https://www.xtof.info/intel80386.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38156486",
    "commentBody": "",
    "originSummary": [
      "Intel 80386, znany również jako 386, wykorzystywał płaską przestrzeń pamięci i zapewniał pamięć wirtualną, co oznaczało, że był znaczącym innowatorem w branży procesorów.",
      "Premiera 386 zmieniła strategię sprzedaży Intela, umożliwiając mu stanie się wyłącznym dostawcą procesora i zdominowanie rynku x86.",
      "Jednostka zarządzania pamięcią 386 umożliwiła wydajny dostęp do pamięci i nowoczesną rozbudowę obliczeń, a jej przyjęcie utorowało drogę dla zaawansowanych rozwiązań, takich jak Windows i Linux."
    ],
    "commentSummary": [
      "Intel 80386, czyli 386, był kamieniem milowym technologii ze względu na jego transformacyjny wpływ na rynek komputerów osobistych, głównie ze względu na wykorzystanie płaskiej przestrzeni pamięci i zapewnienie pamięci wirtualnej.",
      "386 oznaczał zmianę w podejściu Intela do sprzedaży, pozwalając mu zmonopolizować rynek dostawców procesorów, podczas gdy konkurenci, tacy jak IBM i AMD, skupili się na innych obszarach.",
      "Dołączenie do 386 jednostki zarządzania pamięcią (MMU) zrewolucjonizowało dostęp do pamięci i utorowało drogę nowoczesnym komputerom. Jego przyjęcie doprowadziło do dominacji Intela na rynku x86 i późniejszego rozwoju platform takich jak Windows i Linux."
    ],
    "points": 261,
    "commentCount": 158,
    "retryCount": 0,
    "time": 1699224482
  },
  {
    "id": 38161016,
    "title": "Prossimo prezentuje pierwsze stabilne wydanie sudo-rs, bezpieczniejszej wersji narzędzia sudo dla Linuksa, napisanej w języku Rust",
    "originLink": "https://www.memorysafety.org/blog/sudo-first-stable-release/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38161016",
    "commentBody": "",
    "originSummary": [
      "Firma programistyczna Prossimo uruchomiła pierwsze stabilne wydanie sudo-rs, przerobionej wersji popularnego narzędzia Linux sudo, napisanej w języku programowania Rust.",
      "Projekt sudo-rs koncentruje się na zwiększeniu bezpieczeństwa sudo, mając na celu złagodzenie błędów związanych z zarządzaniem pamięcią, w połączeniu z kompleksowym zestawem testów do wykrywania błędów.",
      "Nowy sudo-rs został włączony do Wolfi Linux OS, a zewnętrzny audyt bezpieczeństwa zaplanowano na wrzesień 2023 roku. Fundacja NLnet i Amazon Web Services wsparły projekt finansowo."
    ],
    "commentSummary": [
      "Prossimo, firma zajmująca się oprogramowaniem, wprowadziła pierwszą stabilną wersję sudo-rs, poprawionego modelu szeroko stosowanego narzędzia sudo w systemie Linux, zaimplementowanego w języku programowania Rust.",
      "Projekt sudo-rs ma na celu zwiększenie bezpieczeństwa sudo, usunięcie licznych błędów związanych z zarządzaniem pamięcią poprzez uproszczenie i kompleksowy zestaw testów, które znalazły błędy w oryginalnym sudo.",
      "sudo-rs jest teraz częścią Wolfi Linux OS i zostanie poddany zewnętrznemu przeglądowi bezpieczeństwa we wrześniu 2023 roku. Fundacja NLnet i Amazon Web Services wsparły projekt finansowo."
    ],
    "points": 235,
    "commentCount": 157,
    "retryCount": 0,
    "time": 1699268304
  },
  {
    "id": 38161452,
    "title": "Przedstawiamy Ladder: Nowa, otwarta i konfigurowalna alternatywa dla 12ft.io i 1ft.io",
    "originLink": "https://github.com/kubero-dev/ladder",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38161452",
    "commentBody": "",
    "originSummary": [
      "Autor opracował open-source'ową alternatywę dla niektórych usług, którym brakowało funkcjonalności.",
      "Alternatywne rozwiązanie jest napisane w Golang, statycznie typowanym skompilowanym języku pierwotnie opracowanym w Google.",
      "Nowe oprogramowanie jest w pełni konfigurowalne, dzięki czemu użytkownicy mogą dostosować jego działanie do swoich konkretnych potrzeb."
    ],
    "commentSummary": [
      "Autor stworzył open-source'ową alternatywę dla niektórych usług z powodu niezadowolenia z ich funkcjonalności.",
      "Alternatywne oprogramowanie zostało opracowane przy użyciu Golang, statycznie typowanego, kompilowanego języka programowania.",
      "Ta nowa alternatywa jest w pełni konfigurowalna, umożliwiając użytkownikom dostosowanie jej do konkretnych potrzeb."
    ],
    "points": 224,
    "commentCount": 97,
    "retryCount": 0,
    "time": 1699272284
  },
  {
    "id": 38160703,
    "title": "FFmpeg ulepsza transkodowanie wideo dzięki wprowadzeniu wielowątkowych potoków",
    "originLink": "https://twitter.com/FFmpeg/status/1721275669336707152",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38160703",
    "commentBody": "",
    "originSummary": [
      "FFmpeg, znaczący transkoder wideo na świecie, ogłosił ulepszenia swoich usług, w szczególności wielowątkowe potoki transkodowania.",
      "Aktualizacja została oficjalnie ogłoszona 5 listopada 2023 roku."
    ],
    "commentSummary": [
      "FFmpeg, wiodący na świecie transkoder wideo, ulepsza swoje funkcje, wprowadzając wielowątkowe potoki transkodowania.",
      "Aktualizacja ta, oficjalnie ogłoszona 5 listopada 2023 r., ma na celu poprawę jakości usług.",
      "Wielowątkowy potok transkodowania pozwala oprogramowaniu na wykonywanie wielu transkodowań jednocześnie, zwiększając wydajność."
    ],
    "points": 221,
    "commentCount": 56,
    "retryCount": 0,
    "time": 1699265554
  },
  {
    "id": 38155541,
    "title": "Wnikliwy przewodnik dla początkujących po interfejsie wiersza poleceń debuggera GNU",
    "originLink": "https://beej.us/guide/bggdb/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38155541",
    "commentBody": "",
    "originSummary": [
      "\"Beej's Quick Guide to GDB\" to przyjazny dla początkujących przewodnik, który zawiera szczegółowe wprowadzenie do GNU Debuggera (gdb), narzędzia używanego do debugowania programów za pomocą wiersza poleceń terminala.",
      "Przewodnik obejmuje różne aspekty korzystania z gdb, w tym uruchamianie debuggera, zarządzanie punktami przerwania, monitorowanie zmiennych, obsługę zrzutów rdzenia i nie tylko. Jest on szczególnie przydatny dla programistów, którzy nie korzystają ze zintegrowanego środowiska programistycznego (IDE).",
      "Wyposaża również użytkowników w wiedzę na temat tworzenia spersonalizowanego interfejsu front-end przy użyciu \"interpretera interfejsu maszynowego\" GDB/MI oraz wskazówki dotyczące zarządzania układami okien w trybie tekstowego interfejsu użytkownika (TUI). Niniejszy przewodnik jest dostępny na licencji Creative Commons."
    ],
    "commentSummary": [
      "\"Beej's Quick Guide to GDB\" to przyjazna dla początkujących instrukcja korzystania z debuggera GNU (gdb) za pośrednictwem wiersza poleceń terminala, skierowana do tych, którzy rezygnują ze zintegrowanego środowiska programistycznego (IDE) do programowania.",
      "Przewodnik zawiera dogłębny przegląd gdb, obejmujący różne polecenia, takie jak inicjowanie debuggera, konfigurowanie punktów przerwania, badanie zmiennych i obsługa zrzutów rdzenia.",
      "Dodatkowo wyjaśniono, jak wygenerować spersonalizowany interfejs front-end przy użyciu \"interpretera interfejsu maszynowego\" gdb, GDB/MI, oraz zarządzanie układami okien w trybie tekstowego interfejsu użytkownika (TUI)."
    ],
    "points": 205,
    "commentCount": 29,
    "retryCount": 0,
    "time": 1699217638
  },
  {
    "id": 38160161,
    "title": "Mozilla przenosi rozwój Firefoksa z Mercurial do Git: Podejście dwufazowe",
    "originLink": "https://groups.google.com/a/mozilla.org/g/firefox-dev/c/QnfydsDj48o/m/8WadV0_dBQAJ",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38160161",
    "commentBody": "",
    "originSummary": [
      "Mozilla ujawniła plany przeniesienia rozwoju Firefoksa z Mercurial na Git, co wynika z trudności w zarządzaniu obydwoma narzędziami.",
      "Chociaż repozytorium zostanie przeniesione na GitHub, Mozilla będzie kontynuować swój obecny proces wnoszenia wkładu i nie będzie akceptować pull requestów w tym czasie.",
      "Przejście odbędzie się w dwóch etapach: pierwszy obejmuje zmiany dotyczące głównie deweloperów, a drugi przeniesie infrastrukturę zaplecza z Mercurial do Git. Rozpoczęcie procesu nastąpi po co najmniej sześciomiesięcznym okresie planowania."
    ],
    "commentSummary": [
      "Mozilla zdecydowała się zmienić proces rozwoju Firefoksa z Mercurial na Git ze względu na wyzwania związane z utrzymaniem obu systemów.",
      "Pomimo przeniesienia repozytorium na GitHub, Mozilla planuje zachować obecny przepływ pracy i na razie nie będzie przyjmować wniosków o ściągnięcie.",
      "Przejście nastąpi w dwóch etapach: początkowo skupiając się na zmianach, które mają wpływ na programistów, a następnie migrując infrastrukturę zaplecza. Proces, który rozpocznie się po co najmniej sześciomiesięcznym okresie planowania, oznacza istotną zmianę w podejściu Mozilli do zarządzania kodem."
    ],
    "points": 201,
    "commentCount": 165,
    "retryCount": 0,
    "time": 1699260604
  },
  {
    "id": 38158529,
    "title": "Chez Scheme łączy gałęzie: Przygotowuje się do wydania v10.0",
    "originLink": "https://groups.google.com/g/chez-scheme/c/D7g6mIcYLNU",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38158529",
    "commentBody": "",
    "originSummary": [
      "Matthew Flatt i opiekunowie Chez Scheme planują połączyć różne wersje Chez Scheme, aby usprawnić jego kod w celu wydania wersji 10.0.",
      "Po połączeniu kod w racket/ChezScheme będzie prawie identyczny z główną gałęzią w cisco/ChezScheme, a wszystkie zmiany będą wprowadzane ostrożnie, aby zachować istotę i jakość Chez Scheme.",
      "W przeciwieństwie do obecnej praktyki, pliki startowe portable bytecode (pb) nie będą już odnosić się do podmodułu Git, ale zostaną włączone bezpośrednio do repozytorium cisco/ChezScheme."
    ],
    "commentSummary": [
      "Matthew Flatt i opiekunowie Chez Scheme planują połączyć istniejące gałęzie Chez Scheme znajdujące się na dwóch linkach GitHub, mając na celu przeniesienie kodu w cisco/ChezScheme do wersji v9.9.9-pre-release.20 i postęp w kierunku wydania v10.0.",
      "Po połączeniu zawartość gałęzi racket/ChezScheme będzie ściśle odzwierciedlać główną gałąź cisco/ChezScheme, a zmiany będą dokładnie sprawdzane, aby zachować charakter i jakość Chez Scheme.",
      "Warto zauważyć, że scalony cisco/ChezScheme zrezygnuje z odwoływania się do podmodułu Git dla plików rozruchowych portable bytecode (pb), zamiast tego włączając je do repozytorium cisco/ChezScheme."
    ],
    "points": 200,
    "commentCount": 61,
    "retryCount": 0,
    "time": 1699241700
  },
  {
    "id": 38154045,
    "title": "Nowy samouczek wyjaśnia, jak hostować stronę internetową na ESP32",
    "originLink": "https://esp.khalsalabs.com",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38154045",
    "commentBody": "",
    "originSummary": [
      "Strona internetowa, utworzona 1 listopada 2023 r., opiera się na ESP32, serii tanich mikrokontrolerów system-on-a-chip o niskim poborze mocy.",
      "Oferuje samouczek dotyczący hostowania strony internetowej na ESP32, dostarczając cennych informacji osobom zainteresowanym wykorzystaniem tego systemu do swoich witryn.",
      "Utworzenie tej samouczkowej strony internetowej demonstruje praktyczne zastosowanie ESP32, ujawniając jego potencjał do hostowania stron internetowych."
    ],
    "commentSummary": [
      "Strona internetowa, założona 1 listopada 2023 r., jest hostowana na ESP32, serii tanich mikrokontrolerów o niskim poborze mocy ze zintegrowanym Wi-Fi i podwójnym trybem Bluetooth.",
      "Ta strona zawiera samouczek pokazujący, jak hostować stronę internetową na ESP32, oferując użytkownikom przewodnik po wykorzystaniu tej technologii.",
      "Oferuje praktyczne możliwości uczenia się technologii dla tych, którzy chcą zrozumieć hosting w systemach mikrokontrolerów o niskim poborze mocy, takich jak ESP32."
    ],
    "points": 196,
    "commentCount": 160,
    "retryCount": 0,
    "time": 1699209084
  },
  {
    "id": 38158309,
    "title": "milliFORTH: Uznany za najmniejszy rzeczywisty język programowania",
    "originLink": "https://github.com/fuzzballcat/milliForth",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38158309",
    "commentBody": "",
    "originSummary": [
      "milliFORTH, język programowania FORTH, jest najmniejszym jak dotąd prawdziwym językiem programowania, zajmującym zaledwie 422 bajty, dzięki czemu jest wystarczająco mały, aby zmieścić się w 512-bajtowym sektorze rozruchowym.",
      "Chociaż sectorFORTH osiągnął to już wcześniej, milliFORTH jest jeszcze mniejszy, przewyższając rozmiar sectorLISP2 o 14 bajtów. Pomimo swojej minimalistycznej natury, nie wpływa to negatywnie na wydajność programowania.",
      "Modyfikacje w milliFORTH obejmują usunięcie 'tib', okrojoną obsługę błędów, niedziałający klawisz delete, zmontowany plik binarny sector.asm kompatybilny z emulatorami oraz narzędzie do sprawdzania rozmiaru pliku binarnego."
    ],
    "commentSummary": [
      "MilliFORTH, o rozmiarze zaledwie 422 bajtów, twierdzi, że jest najmniejszym istniejącym prawdziwym językiem programowania, który jest nawet wystarczająco mały, aby zmieścić się w 512-bajtowym sektorze rozruchowym.",
      "FORTH, język na którym bazuje milliFORTH, jest minimalistycznym językiem zawierającym tylko kilka słów dla funkcjonalności, ale zachowującym wydajność programowania.",
      "Nowy milliFORTH ma pewne modyfikacje w porównaniu do swojego poprzednika, sectorFORTH, w tym brak tib, ograniczoną obsługę błędów i niedziałający klawisz usuwania. Zawiera również zmontowany plik binarny sector.asm i narzędzie do wyświetlania rozmiaru pliku binarnego."
    ],
    "points": 187,
    "commentCount": 47,
    "retryCount": 0,
    "time": 1699239803
  },
  {
    "id": 38155324,
    "title": "Sfermentowane zboże przyciąga i odurza niedźwiedzie grizzly, prowadząc do ofiar śmiertelnych w pociągach w Montanie",
    "originLink": "https://cowboystatedaily.com/2023/11/04/63-grizzlies-some-drunk-on-fermented-grain-killed-by-trains-in-montana/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38155324",
    "commentBody": "",
    "originSummary": [
      "Znaczna liczba niedźwiedzi grizzly zginęła od lat 80. wzdłuż linii kolejowej w pobliżu Parku Narodowego Glacier w stanie Montana, głównie w wyniku zatrucia sfermentowanym ziarnem rozsypanym z wagonów kolejowych.",
      "Mieszanka rozsypanego zboża i wilgoci inicjuje fermentację, przyciągając niedźwiedzie, a w 2021 r. odnotowano już trzy zgony z powodu uderzeń pociągów.",
      "Chociaż zaproponowano środki łagodzące, takie jak zmniejszenie ilości ziarna w wagonach kolejowych i ustawienie wyzwalaczy hałasu w znanych \"strefach śmierci\", do tej pory podjęto ograniczone działania w celu rozwiązania tej kwestii."
    ],
    "commentSummary": [
      "Dziesiątki niedźwiedzi grizzly zginęło tragicznie od lat 80. w pobliżu Parku Narodowego Glacier w Montanie z powodu zatrucia sfermentowanym ziarnem wyciekającym z wagonów kolejowych.",
      "Jak dotąd w 2021 r. trzy niedźwiedzie zginęły w wyniku potrącenia przez pociągi, co sugeruje, że problem nadal istnieje.",
      "Możliwe rozwiązania obejmują zmniejszenie ilości ziarna w wagonach kolejowych i rozmieszczenie wyzwalaczy hałasu w rozpoznanych \"strefach śmierci\", ale podjęto niewiele działań w celu zmniejszenia wskaźnika śmiertelności."
    ],
    "points": 184,
    "commentCount": 140,
    "retryCount": 0,
    "time": 1699216148
  },
  {
    "id": 38157466,
    "title": "Korzystanie z klucza sprzętowego RTL-SDR do odbioru cyfrowych stacji radiowych NRSC-5: Kompleksowy przewodnik",
    "originLink": "https://github.com/theori-io/nrsc5",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38157466",
    "commentBody": "",
    "originSummary": [
      "Program nrsc5 wykorzystuje klucz sprzętowy RTL-SDR do odbioru cyfrowych stacji radiowych NRSC-5 i oferuje zarówno interfejs wiersza poleceń, jak i API.",
      "Użytkownik jest zobowiązany do skompilowania programu zgodnie z podanym przewodnikiem, który zawiera wyraźne instrukcje dotyczące różnych konfiguracji systemu, a także przykładowe testowanie plików i rozwiązywanie problemów.",
      "Dodatkowe polecenia służą do przełączania i zamykania programów audio. Aby zapewnić płynne działanie w systemie Windows, użytkownicy powinni dokonać regulacji za pomocą Zadig na sterowniku USB."
    ],
    "commentSummary": [
      "nrsc5 to program, który wykorzystuje klucz sprzętowy RTL-SDR do odbioru cyfrowych stacji radiowych NRSC-5, zapewniając interfejs wiersza poleceń i API do tworzenia innych aplikacji.",
      "Program zawiera kompleksowe instrukcje dotyczące budowania go na różnych systemach, takich jak Ubuntu, Debian, Raspbian i Windows, przy użyciu różnych opcji kompilacji, wraz z poradami dotyczącymi rozwiązywania problemów i testowania z przykładowym plikiem przechwytywania.",
      "Użytkownikom zaleca się korzystanie z Zadig, aby zapobiec błędom poprzez zmianę sterownika USB, szczególnie w przypadku systemów Windows, i dostarczanie poleceń klawiaturowych do przełączania programów audio, zamykania i opcji wiersza poleceń."
    ],
    "points": 176,
    "commentCount": 65,
    "retryCount": 0,
    "time": 1699231668
  }
]
