[
  {
    "id": 37125118,
    "title": "HN megjelenítése: Az LLM-ek az esetek 100%-ában képesek érvényes JSON-t generálni",
    "originLink": "https://github.com/normal-computing/outlines",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37125118",
    "commentBody": "",
    "originSummary": [
      "Az Outlines egy Python könyvtár, amely nagyméretű nyelvi modellek felhasználásával történő szöveggenerálásra specializálódott.",
      "Az alkotók egy olyan technikát fejlesztettek ki, amellyel egy reguláris kifejezésnek megfelelő szöveget generatív modellé alakítva generálnak.",
      "A könyvtár képes olyan szöveget is generálni, amely megfelel egy JSON sémának, vagy elemezhető egy Pydantic modellbe, biztosítva a kimenet érvényességét.",
      "Az alkotók aktívan várják a visszajelzéseket és a további fejlesztésekre vonatkozó javaslatokat."
    ],
    "commentSummary": [
      "A résztvevők megvitatták a nagy nyelvi modellek (LLM) használatát az érvényes JSON-szöveg generálásában.",
      "A beszélgetés során szó esett a kódgenerálás és az éles esetek kezelése során felmerülő kihívásokról, valamint a különböző LLM-modellek korlátairól és előnyeiről.",
      "Különböző eszközök és megközelítések kerültek említésre, és a stabilitással, érzékenységgel és hatékonysággal kapcsolatos aggályok merültek fel."
    ],
    "points": 738,
    "commentCount": 236,
    "retryCount": 0,
    "time": 1692039174
  },
  {
    "id": 37119942,
    "title": "HN megjelenítése: Little Rat - Chrome-bővítmény figyeli az összes bővítmény hálózati hívásait",
    "originLink": "https://github.com/dnakov/little-rat",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37119942",
    "commentBody": "",
    "originSummary": [
      "Egy személy kifejlesztett egy Chrome-bővítményt, amely más Chrome-bővítmények által kezdeményezett hálózati hívások megfigyelésére szolgál.",
      "A bővítményt a GitHubon osztották meg, és a felülvizsgálat után a Chrome áruházban is elérhetővé válhat.",
      "A GitHub-tárhelyre és a fejlesztő Twitter-fiókjára mutató linkek is rendelkezésre álltak."
    ],
    "commentSummary": [
      "A Little Rat Chrome-bővítményt úgy tervezték, hogy figyelje a más Chrome-bővítmények által kezdeményezett hálózati hívásokat.",
      "A felhasználók aggodalmukat fejezték ki a biztonsággal és a kiterjesztéssel kapcsolatos lehetséges kockázatokkal kapcsolatban.",
      "Ugyanakkor úgy vélik, hogy ez értékes eszköz lehet a biztonsági rések azonosítására.",
      "A bővítményt jelenleg vizsgálják a Chrome Web Store-ba való felvétel céljából.",
      "A felhasználók javasolták a kiterjesztés biztonságának ellenőrzését."
    ],
    "points": 483,
    "commentCount": 88,
    "retryCount": 0,
    "time": 1692013799
  },
  {
    "id": 37124187,
    "title": "Discord.io megsértették, 760k felhasználói fiókok eladásra a darkneten",
    "originLink": "https://stackdiary.com/the-data-of-760000-discord-io-users-was-put-up-for-sale-on-the-darknet/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37124187",
    "commentBody": "",
    "originSummary": [
      "A Discord.io 760 000 felhasználójának adatai szivárogtak ki a darknetre, köztük e-mail címek, kódolt jelszavak és egyéb, a felhasználóra vonatkozó információk.",
      "A jogsértést a Discord.io megerősítette, de a Discord (a hivatalos alkalmazás) kijelentette, hogy nem áll kapcsolatban a Discord.io-val, és visszavonta a Discord.io-t használó felhasználók hozzáférési tokenjeit.",
      "A betörést egy Akhirah nevű hacker hajtotta végre, aki azt állította, hogy nem pénzért, hanem a Discord.io-n található illegális és káros tartalmak miatt. Kiberbiztonsági szakértők ellenőrizték az adatok hitelességét, kiemelve az adathalász- és spam-támadások kockázatát. A Discord.io azt javasolja a felhasználóknak, hogy változtassák meg jelszavaikat és kapcsolják be a kétfaktoros hitelesítést, emellett mondják fel a meglévő prémium előfizetéseket, és próbáljanak meg kapcsolatot teremteni az elkövetőkkel, hogy kiderítsék, az adatokat nyilvánosan megosztották-e."
    ],
    "commentSummary": [
      "A Discord.io sérülése 760 000 felhasználói fiók eladásához vezetett a darkneten.",
      "A felhasználók tudtukon kívül csatlakoztatták fiókjaikat egy harmadik fél szolgáltatásához, ami a jogsértéshez vezetett.",
      "A Discord-felhasználók aggódnak a vállalat intézkedéseinek elmaradása és a védjegyük potenciális veszélyeztetése miatt."
    ],
    "points": 390,
    "commentCount": 135,
    "retryCount": 0,
    "time": 1692035520
  },
  {
    "id": 37122871,
    "title": "Visszafelé kompatibilitás, Go 1.21 és Go 2",
    "originLink": "https://go.dev/blog/compat",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37122871",
    "commentBody": "",
    "originSummary": [
      "A blogbejegyzés hangsúlyozza a Go programozási nyelv kompatibilitásának fenntartásának fontosságát, és kitér az ezzel járó kihívásokra.",
      "Kiemeli az API-ellenőrzés és -tesztelés használatát a kompatibilitási problémák megelőzése érdekében, ugyanakkor elismeri, hogy a tesztelés nem üzembiztos.",
      "A Go 1.21-es frissítés új megközelítést vezet be a GODEBUG használatával a visszafelé kompatibilitás javítása érdekében, és biztosítja, hogy a Go 1 programokat ne törje össze a Go 2 specifikáció."
    ],
    "commentSummary": [
      "A beszélgetések középpontjában olyan programozási nyelvek állnak, mint a Go, a Java, a C# és a Python.",
      "A résztvevők olyan témákat vitatnak meg, mint a visszafelé kompatibilitás, új funkciók, kódabsztrakció, verziófrissítések és törésváltozások.",
      "E témákról eltérőek a vélemények, egyesek a kompatibilitást és a stabilitást, míg mások az innováció és a nyelvi fejlődés szükségességét hangsúlyozzák. A felhasználók megosztják tapasztalataikat és csalódásaikat is az egyes nyelvekkel és verzióátmenetekkel kapcsolatban."
    ],
    "points": 368,
    "commentCount": 272,
    "retryCount": 0,
    "time": 1692030144
  },
  {
    "id": 37125830,
    "title": "OpenFarm - ingyenes és nyílt adatbázis és webes alkalmazás a kertészeti ismeretekhez",
    "originLink": "https://openfarm.cc",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37125830",
    "commentBody": "",
    "originSummary": [
      "Az OpenFarm egy új projekt és közösség, amelynek célja, hogy a tudásmegosztáson keresztül segítse a kertészkedőket az élelmiszertermelésben.",
      "A tagok kiválaszthatnak egy adott növényt, hozzáférhetnek az útmutatókhoz, és megtanulhatják, hogyan ápolják növényeiket a növekedés különböző szakaszaiban.",
      "A weboldal olyan funkciókat kínál, mint a felhasználó kertészeti típusának meghatározására szolgáló felmérés, a közösségi kedvencek és a felhasználói hozzájárulások lehetőségei. A tagok hozzáférhetnek egy GYIK részhez, egy bloghoz, egy magatartási kódexhez, és az e-mail hírlevéllel naprakészek maradhatnak."
    ],
    "commentSummary": [
      "Az OpenFarm egy ingyenes és nyílt adatbázis és webes alkalmazás a kertészeti ismeretek számára.",
      "A projektet nem tartják fenn aktívan, de a FarmBot továbbra is használja a termésinformációk kezelésére.",
      "A projekt függőségi frissítést és potenciális karbantartókat igényel, és vannak javaslatok a fejlesztésekre, beleértve a Jekyll használatát vagy a projekt Wikimedia Alapítvány alá történő átvételét.",
      "A felhasználók érdeklődésüket és aggodalmukat fejezték ki a projekt hasznosságával, funkcionalitásával és licencelésével kapcsolatban."
    ],
    "points": 366,
    "commentCount": 33,
    "retryCount": 0,
    "time": 1692042137
  },
  {
    "id": 37123572,
    "title": "A visszatetszést követően a Zoom azt mondja, hogy nem fogja felhasználni az ügyféladatokat AI modellek képzéséhez",
    "originLink": "https://www.darkreading.com/analytics/following-pushback-zoom-says-it-won-t-use-customer-data-to-train-ai-models",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37123572",
    "commentBody": "",
    "originSummary": [
      "A Zoom visszavonta döntését, miszerint az ügyféltartalmakat használja fel mesterséges intelligenciamodelljei képzéséhez, miután a közösségi médiában kritikával illették az adatvédelmi aggályok miatt.",
      "Ez rávilágít a folyamatban lévő vitára, amely az ügyféladatokat a mesterséges intelligencia fejlesztéséhez felhasználó technológiai vállalatok adatvédelmi és biztonsági következményeiről szól.",
      "Valószínűleg egyre nagyobb nyomás nehezedik majd a vállalatokra, hogy a felhasználói adatok mesterséges intelligencia célú felhasználása során egyértelmű felhasználói lemondási lehetőséget kínáljanak, és védjék a személyes adatokat."
    ],
    "commentSummary": [
      "A Zoom visszatetszést váltott ki, amiért az ügyféladatokat mesterséges intelligencia képzésre használta fel, ami kétségeket ébresztett az adatvédelmi elkötelezettségével kapcsolatban.",
      "Viták alakultak ki a régi felhasználói adatok pénzzé tételéről és a kifejezett törvények vagy szabályozások szükségességéről.",
      "A különböző platformok, például a Zoom, a Signal és a Whatsapp titkosítási képességeit elemzik, kiemelve a titkosítási definíciók megértésének jelentőségét."
    ],
    "points": 364,
    "commentCount": 173,
    "retryCount": 0,
    "time": 1692032955
  },
  {
    "id": 37120350,
    "title": "Egy kansasi szerkesztőségben tartott rendőrségi razzia riadalmat kelt a sajtószabadság megsértése miatt",
    "originLink": "https://www.npr.org/2023/08/14/1193676139/newspaper-marion-county-kansas-police-raid-first-amendment",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37120350",
    "commentBody": "",
    "originSummary": [
      "A Kansas állambeli Marionban a bűnüldöző szervek munkatársai rajtaütöttek egy helyi újság szerkesztőségén és egy újságíró otthonán, ami a sajtószabadság megsértésével kapcsolatos aggályokat vetett fel.",
      "A házkutatási parancs alapján tartott razzia során számítógépeket, mobiltelefonokat és jelentési anyagokat foglaltak le.",
      "A helyi hatóságok azt állítják, hogy a rajtaütés a személyazonossági lopás kivizsgálásához kapcsolódott, de szakértők szerint ez valószínűleg sérti az újságírókat az ilyen akcióktól védő szövetségi törvényt. A razzia állítólag az újság társtulajdonosának halálához is vezetett.",
      "A szakértők vizsgálatot követelnek az érintett hatóságok ellen, és hangsúlyozzák a sajtószabadság védelmének fontosságát."
    ],
    "commentSummary": [
      "Egy kansasi szerkesztőség elleni rendőrségi razzia országos figyelmet és aggodalmat keltett a sajtószabadság megsértésével és a helyi bűnüldöző szervek esetleges korrupciójával kapcsolatban.",
      "A hozzászólók aggódnak a nem mainstream újságírók kizárása, valamint a dezinformáció és a propaganda befolyása miatt.",
      "A sajtószabadság megsértéséért felelős személyek felelősségre vonását és felelősségre vonását követelik, és aggodalmakat vetnek fel a helyi hatóságok ellenőrizetlen hatalmával és az információk elhallgatásával kapcsolatban."
    ],
    "points": 354,
    "commentCount": 136,
    "retryCount": 0,
    "time": 1692016727
  },
  {
    "id": 37130060,
    "title": "Mondja el a HN-nek: a t.co öt másodperces késleltetést ad egyes domainekhez",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37130060",
    "commentBody": "",
    "originSummary": [
      "A Twitter átirányító szolgáltatása, a t.co szándékosan 5 másodperces késleltetést alkalmaz, amikor a felhasználók a \"NYTimes.com\" vagy \"threads.net\" linkekre kattintanak.",
      "A késés következetesen történik, és a Twitter szándékosan hajtja végre.",
      "A szándékos késedelem oka nem szerepel a szövegben."
    ],
    "commentSummary": [
      "A Twitter öt másodperces késleltetést vezetett be, amikor a felhasználókat bizonyos weboldalakra, például a New York Times-ra irányítja át, ami cenzúráról vagy manipulációról szóló találgatásokhoz vezetett.",
      "A Hacker News weboldalainak kitiltását vitatják meg, és kérdéseket vetnek fel az átláthatósággal és a tartalommoderálás hatékonyságával kapcsolatban.",
      "Aggályok merülnek fel az elfogult bánásmóddal, a lehetséges politikai elfogultsággal és a felhasználók bizalmára gyakorolt hatással kapcsolatban."
    ],
    "points": 333,
    "commentCount": 178,
    "retryCount": 0,
    "time": 1692072543
  },
  {
    "id": 37128293,
    "title": "HN megjelenítése: AI-town, futtasd a saját egyéni AI világodat SIM JavaScript segítségével",
    "originLink": "https://github.com/a16z-infra/ai-town",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37128293",
    "commentBody": "",
    "originSummary": [
      "Az AI-town egy kezdőcsomag, amely lehetővé teszi a felhasználók számára, hogy mesterséges intelligencia szimulációkat hozzanak létre és testre szabjanak.",
      "A készlet tartalmaz egy szerveroldali játékmotort, és többjátékos és telepítésre kész.",
      "Az AI-town Typescript nyelven íródott, és célja, hogy leegyszerűsítse a mesterséges intelligencia szimulációs környezetek építésének folyamatát."
    ],
    "commentSummary": [
      "Az AI-town egy kezdőcsomag, amely lehetővé teszi a felhasználók számára, hogy JavaScript segítségével mesterséges intelligencia-szimulációkat készítsenek, és testre szabják a környezetüket.",
      "A projekt a szimulációs környezetek létrehozásának demokratizálására törekszik, és a közösséget komplex interakciók fejlesztésére ösztönzi.",
      "Különböző technikákat kombinál olyan együttműködő ágensek létrehozására, amelyek absztrakt szemantikai terekben működnek. Szkeptikusak azonban a mesterséges intelligencia karakterek potenciális értékét vagy érdekességét illetően."
    ],
    "points": 333,
    "commentCount": 73,
    "retryCount": 0,
    "time": 1692056762
  },
  {
    "id": 37121180,
    "title": "Szoftverfejlesztés a Google-nál (2020)",
    "originLink": "https://abseil.io/resources/swe-book/html/toc.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37121180",
    "commentBody": "",
    "originSummary": [
      "A \"Site Reliability Engineering: How Google Runs Production Systems\" című könyv a szoftverfejlesztés, a csapatkultúra és a vezetés különböző témáinak átfogó vizsgálatát kínálja.",
      "A Google szemszögéből és tapasztalataiból származó meglátásokat és bevált gyakorlatokat oszt meg, értékes ismereteket nyújtva olyan területeken, mint a mérnöki termelékenység mérése, a kódellenőrzés, a dokumentáció, a tesztelés és az eszközök.",
      "A könyv olyan témákat is tárgyal, mint a függőségkezelés, a nagyszabású változtatások, a folyamatos integráció, a folyamatos szállítás és a szolgáltatásként történő számítás, így értékes forrás a szoftvermérnökök számára, akik készségeiket és ismereteiket szeretnék bővíteni ezeken a területeken."
    ],
    "commentSummary": [
      "A Hacker News beszélgetése a Google szoftverfejlesztésével kapcsolatos különböző témákat érint, többek között a gyakorlatok hatékonyságát, valamint a szoftverrendszerek skálázhatóságát és architektúráját.",
      "Kitér továbbá a Google teljesítményértékelési és előléptetési folyamataira, valamint a Google gyakorlatának és a fejlesztési folyamatnak a Piper és citc munkaterületekre összpontosító utánzásának fontosságára.",
      "A beszélgetés egyéb területeket is érint, például a kód olvashatóságát és karbantarthatóságát, a Google mérnöki gyakorlatáról és termékeiről alkotott véleményeket, valamint olyan kapcsolódó témákat, mint a gcc és a clang, a C++ stdlib korlátai, az abseil könyvtár, a Google keresőmotorja, a Microsoft visszafelé kompatibilitása és egy könyv a Google szoftverfejlesztéséről."
    ],
    "points": 323,
    "commentCount": 320,
    "retryCount": 0,
    "time": 1692021969
  }
]
