[
  {
    "id": 37125118,
    "title": "إظهار HN: يمكن ل LLMs إنشاء JSON صالح بنسبة 100٪ من الوقت",
    "originLink": "https://github.com/normal-computing/outlines",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37125118",
    "commentBody": "",
    "originSummary": [
      "الخطوط العريضة هي مكتبة Python متخصصة في إنشاء النصوص باستخدام نماذج اللغة الكبيرة.",
      "طور المبدعون تقنية لإنشاء نص يتوافق مع التعبير العادي عن طريق تحويله إلى نموذج توليدي.",
      "يمكن للمكتبة أيضا إنشاء نص يلتزم بمخطط JSON أو يمكن تحليله في نموذج Pydantic ، مما يضمن صحة الإخراج.",
      "يسعى منشئو المحتوى بنشاط للحصول على تعليقات واقتراحات لمزيد من التحسينات."
    ],
    "commentSummary": [
      "ناقش المشاركون استخدام نماذج اللغة الكبيرة (LLMs) في إنشاء نص JSON صالح.",
      "تطرقت المحادثة إلى التحديات في إنشاء التعليمات البرمجية والتعامل مع حالات الحافة ، بالإضافة إلى قيود وفوائد نماذج LLM المختلفة.",
      "وأشير إلى أدوات ونهج مختلفة، مع إثارة شواغل بشأن الاستقرار والحساسية والكفاءة."
    ],
    "points": 738,
    "commentCount": 236,
    "retryCount": 0,
    "time": 1692039174
  },
  {
    "id": 37119942,
    "title": "إظهار HN: الجرذ الصغير - تراقب إضافة Chrome مكالمات الشبكة لجميع الإضافات",
    "originLink": "https://github.com/dnakov/little-rat",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37119942",
    "commentBody": "",
    "originSummary": [
      "طور شخص إضافة Chrome لمراقبة مكالمات الشبكة التي تجريها إضافات Chrome الأخرى.",
      "تمت مشاركة الإضافة على GitHub ، مع إمكانية توفرها على متجر Chrome بعد المراجعة.",
      "تم توفير روابط إلى مستودع GitHub وحساب Twitter الخاص بالمطور."
    ],
    "commentSummary": [
      "تم تصميم إضافة Little Rat Chrome لمراقبة مكالمات الشبكة التي تجريها إضافات Chrome الأخرى.",
      "أعرب المستخدمون عن مخاوفهم بشأن الأمان والمخاطر المحتملة المرتبطة بالامتداد.",
      "ومع ذلك ، فإنهم يعتقدون أيضا أنه يمكن أن يكون أداة قيمة لتحديد الثغرات الأمنية.",
      "تتم حاليا مراجعة الإضافة لتضمينها في سوق Chrome الإلكتروني.",
      "اقترح المستخدمون طرقا للتحقق من سلامة الامتداد."
    ],
    "points": 483,
    "commentCount": 88,
    "retryCount": 0,
    "time": 1692013799
  },
  {
    "id": 37124187,
    "title": "Discord.io تم اختراقها ، 760 ألف حساب مستخدم للبيع على الشبكة المظلمة",
    "originLink": "https://stackdiary.com/the-data-of-760000-discord-io-users-was-put-up-for-sale-on-the-darknet/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37124187",
    "commentBody": "",
    "originSummary": [
      "تم تسريب بيانات 760,000 مستخدم على Discord.io على الشبكة المظلمة ، بما في ذلك عناوين البريد الإلكتروني وكلمات المرور المجزأة وغيرها من المعلومات الخاصة بالمستخدم.",
      "تم تأكيد الخرق من قبل Discord.io ، لكن Discord (التطبيق الرسمي) ذكر أنه غير مرتبط Discord.io وألغى رموز الوصول لأي مستخدم استخدم Discord.io.",
      "تم تنفيذ الاختراق من قبل هاكر يدعى الآخرة ، الذي ادعى أنه لم يكن من أجل المال ولكن بسبب وجود محتوى غير قانوني وضار على Discord.io. تحقق خبراء الأمن السيبراني من صحة البيانات ، مما يسلط الضوء على مخاطر هجمات التصيد الاحتيالي والبريد العشوائي. توصي Discord.io المستخدمين بتغيير كلمات المرور الخاصة بهم وتمكين المصادقة الثنائية ، مع إلغاء الاشتراكات المميزة الحالية ومحاولة إقامة اتصال مع الجناة لتحديد ما إذا كانت البيانات قد تمت مشاركتها بشكل عام."
    ],
    "commentSummary": [
      "أدى خرق Discord.io إلى بيع 760،000 حساب مستخدم على الشبكة المظلمة.",
      "ربط المستخدمون حساباتهم عن غير قصد بخدمة جهة خارجية ، مما أدى إلى الخرق.",
      "يشعر مستخدمو Discord بالقلق إزاء عدم اتخاذ الشركة إجراءات والمخاطر المحتملة على علامتهم التجارية."
    ],
    "points": 390,
    "commentCount": 135,
    "retryCount": 0,
    "time": 1692035520
  },
  {
    "id": 37122871,
    "title": "التوافق مع الإصدارات السابقة ، Go 1.21 ، و Go 2",
    "originLink": "https://go.dev/blog/compat",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37122871",
    "commentBody": "",
    "originSummary": [
      "يؤكد منشور المدونة على أهمية الحفاظ على التوافق في لغة برمجة Go ويناقش التحديات التي تنطوي عليها.",
      "يسلط الضوء على استخدام فحص واجهة برمجة التطبيقات واختبارها لمنع مشكلات التوافق ، مع الاعتراف بأن الاختبار ليس مضمونا.",
      "يقدم التحديث على Go 1.21 نهجا جديدا باستخدام GODEBUG لتحسين التوافق مع الإصدارات السابقة ويضمن عدم كسر برامج Go 1 بواسطة مواصفات Go 2."
    ],
    "commentSummary": [
      "تركز المناقشات على لغات البرمجة مثل Go و Java و C # و Python.",
      "يناقش المشاركون موضوعات مثل التوافق مع الإصدارات السابقة ، والميزات الجديدة ، وتجريد التعليمات البرمجية ، وتحديثات الإصدار ، والتغييرات العاجلة.",
      "تختلف الآراء حول هذه الموضوعات ، حيث يؤكد البعض على التوافق والاستقرار ، بينما يؤكد البعض الآخر على الحاجة إلى الابتكار وتحسين اللغة. يشارك المستخدمون أيضا تجاربهم وإحباطاتهم مع لغات محددة وانتقالات الإصدار."
    ],
    "points": 368,
    "commentCount": 272,
    "retryCount": 0,
    "time": 1692030144
  },
  {
    "id": 37125830,
    "title": "OpenFarm – قاعدة بيانات مجانية ومفتوحة وتطبيق ويب لمعرفة البستنة",
    "originLink": "https://openfarm.cc",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37125830",
    "commentBody": "",
    "originSummary": [
      "OpenFarm هو مشروع ومجتمع جديد يهدف إلى مساعدة البستانيين على زراعة الطعام من خلال مشاركة المعرفة.",
      "يمكن للأعضاء اختيار محصول معين ، والوصول إلى الأدلة ، وتعلم كيفية العناية بنباتاتهم خلال مراحل النمو المختلفة.",
      "يقدم موقع الويب ميزات مثل الاستطلاع لتحديد نوع البستنة للمستخدم ، ومفضلات المجتمع ، وفرص مساهمات المستخدم. يمكن للأعضاء أيضا الوصول إلى قسم الأسئلة الشائعة والمدونة ومدونة قواعد السلوك والبقاء على اطلاع دائم بالنشرة الإخبارية عبر البريد الإلكتروني."
    ],
    "commentSummary": [
      "OpenFarm هي قاعدة بيانات مجانية ومفتوحة وتطبيق ويب لمعرفة البستنة.",
      "لا يتم الحفاظ على المشروع بنشاط ولكن لا يزال يتم استخدامه لإدارة معلومات المحاصيل بواسطة FarmBot.",
      "يتطلب المشروع ترقية التبعية والمشرفين المحتملين، وهناك اقتراحات للتحسينات، بما في ذلك استخدام جيكل أو تبني المشروع تحت مؤسسة ويكيميديا.",
      "أعرب المستخدمون عن اهتمامهم ومخاوفهم بشأن فائدة المشروع ووظائفه وترخيصه."
    ],
    "points": 366,
    "commentCount": 33,
    "retryCount": 0,
    "time": 1692042137
  },
  {
    "id": 37123572,
    "title": "بعد التراجع ، تقول Zoom إنها لن تستخدم بيانات العملاء لتدريب نماذج الذكاء الاصطناعي",
    "originLink": "https://www.darkreading.com/analytics/following-pushback-zoom-says-it-won-t-use-customer-data-to-train-ai-models",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37123572",
    "commentBody": "",
    "originSummary": [
      "تراجعت Zoom عن قرارها باستخدام محتوى العملاء لتدريب نماذج الذكاء الاصطناعي بعد أن واجهت انتقادات على وسائل التواصل الاجتماعي بسبب مخاوف تتعلق بالخصوصية.",
      "يسلط هذا الضوء على الجدل الدائر حول الآثار المترتبة على الخصوصية والأمان لشركات التكنولوجيا التي تستخدم بيانات العملاء لتحقيق الذكاء الاصطناعي التقدم.",
      "من المحتمل أن يكون هناك ضغط متزايد على الشركات لتقديم إلغاء اشتراك واضح للمستخدم وحماية المعلومات الشخصية عند استخدام بيانات العملاء لأغراض الذكاء الاصطناعي."
    ],
    "commentSummary": [
      "تلقت Zoom رد فعل عنيف لاستخدام بيانات العملاء للتدريب الذكاء الاصطناعي ، مما أدى إلى شكوك حول التزامها بالخصوصية.",
      "ظهرت مناقشات حول تسييل بيانات المستخدم القديمة وضرورة وجود قوانين أو لوائح صريحة.",
      "يتم تحليل قدرات التشفير لمختلف المنصات ، مثل Zoom و Signal و Whatsapp ، مما يؤكد أهمية فهم تعريفات التشفير الخاصة بهم."
    ],
    "points": 364,
    "commentCount": 173,
    "retryCount": 0,
    "time": 1692032955
  },
  {
    "id": 37120350,
    "title": "مداهمة الشرطة لغرفة أخبار في كانساس تثير الإنذارات بشأن انتهاكات حرية الصحافة",
    "originLink": "https://www.npr.org/2023/08/14/1193676139/newspaper-marion-county-kansas-police-raid-first-amendment",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37120350",
    "commentBody": "",
    "originSummary": [
      "وداهم ضباط إنفاذ القانون مكتبا لصحيفة محلية ومنزل صحفي في ماريون بولاية كانساس، مما أثار مخاوف بشأن انتهاكات حرية الصحافة.",
      "تمت مصادرة أجهزة الكمبيوتر والهواتف المحمولة ومواد الإبلاغ خلال المداهمة، التي أجريت بموجب مذكرة تفتيش.",
      "وتزعم السلطات المحلية أن المداهمة كانت مرتبطة بالتحقيق في سرقة الهوية، لكن الخبراء يجادلون بأنها تنتهك على الأرجح القانون الفيدرالي الذي يحمي الصحفيين من مثل هذه الأعمال. ويزعم أيضا أن المداهمة أسفرت عن مقتل المالك المشارك للصحيفة.",
      "ويطالب الخبراء بإجراء تحقيق مع السلطات المعنية وتسليط الضوء على أهمية حماية حرية الصحافة."
    ],
    "commentSummary": [
      "أثارت مداهمة الشرطة لغرفة أخبار في كانساس اهتماما وطنيا وقلقا بشأن انتهاكات حرية الصحافة والفساد المحتمل من قبل سلطات إنفاذ القانون المحلية.",
      "يشعر المعلقون بالقلق إزاء استبعاد الصحفيين غير السائدين وتأثير المعلومات المضللة والدعاية.",
      "هناك دعوة للمساءلة والملاحقة القضائية للمسؤولين عن انتهاك حرية الصحافة، مما يثير مخاوف بشأن السلطة المطلقة للسلطات المحلية وقمع المعلومات."
    ],
    "points": 354,
    "commentCount": 136,
    "retryCount": 0,
    "time": 1692016727
  },
  {
    "id": 37130060,
    "title": "أخبر HN: t.co يضيف تأخيرا لمدة خمس ثوان إلى بعض المجالات",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37130060",
    "commentBody": "",
    "originSummary": [
      "t.co ، تفرض خدمة إعادة التوجيه في Twitter عن قصد تأخيرا يبلغ حوالي 5 ثوان عندما ينقر المستخدمون على روابط \"NYTimes.com\" أو \"threads.net\".",
      "يحدث التأخير باستمرار ويتم تنفيذه عمدا بواسطة Twitter.",
      "ولم يرد ذكر السبب وراء هذا التأخير المتعمد في النص."
    ],
    "commentSummary": [
      "نفذ تويتر تأخيرا لمدة خمس ثوان عند إعادة توجيه المستخدمين إلى مواقع ويب محددة مثل نيويورك تايمز ، مما أدى إلى تكهنات حول الرقابة أو التلاعب.",
      "تتم مناقشة حظر مواقع الويب على Hacker News ، مما يثير تساؤلات حول الشفافية وفعالية الإشراف على المحتوى.",
      "يتم التعبير عن المخاوف بشأن المعاملة المتحيزة والتحيز السياسي المحتمل والتأثير على ثقة المستخدم."
    ],
    "points": 333,
    "commentCount": 178,
    "retryCount": 0,
    "time": 1692072543
  },
  {
    "id": 37128293,
    "title": "إظهار HN: الذكاء الاصطناعي-town ، قم بتشغيل بطاقة SIM المخصصة الخاصة بك الذكاء الاصطناعي العالم باستخدام JavaScript",
    "originLink": "https://github.com/a16z-infra/ai-town",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37128293",
    "commentBody": "",
    "originSummary": [
      "الذكاء الاصطناعي-town عبارة عن مجموعة بداية تتيح للمستخدمين إنشاء وتخصيص عمليات محاكاة الذكاء الاصطناعي.",
      "تتضمن المجموعة محرك ألعاب من جانب الخادم وهي متعددة اللاعبين وجاهزة للنشر.",
      "تمت كتابة الذكاء الاصطناعي-town بالكتابة المطبوعة وتهدف إلى تبسيط عملية بناء بيئات محاكاة الذكاء الاصطناعي."
    ],
    "commentSummary": [
      "الذكاء الاصطناعي-town عبارة عن مجموعة أدوات بداية تمكن المستخدمين من إنشاء محاكاة الذكاء الاصطناعي باستخدام JavaScript وتخصيص بيئاتهم.",
      "يسعى المشروع إلى إضفاء الطابع الديمقراطي على إنشاء بيئات محاكاة ويشجع المجتمع على تطوير تفاعلات معقدة.",
      "فهو يجمع بين تقنيات مختلفة لإنشاء وكلاء تعاونيين يعملون في مساحات دلالية مجردة. ومع ذلك ، هناك شكوك حول القيمة المحتملة أو الاهتمام بالشخصيات الذكاء الاصطناعي."
    ],
    "points": 333,
    "commentCount": 73,
    "retryCount": 0,
    "time": 1692056762
  },
  {
    "id": 37121180,
    "title": "هندسة البرمجيات في جوجل (2020)",
    "originLink": "https://abseil.io/resources/swe-book/html/toc.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37121180",
    "commentBody": "",
    "originSummary": [
      "يقدم كتاب \"هندسة موثوقية الموقع: كيف تدير Google أنظمة الإنتاج\" استكشافا شاملا لمختلف الموضوعات في هندسة البرمجيات وثقافة الفريق والقيادة.",
      "وهي تشارك الإحصاءات وأفضل الممارسات من منظور Google وخبراتها ، مما يوفر معرفة قيمة في مجالات مثل قياس الإنتاجية الهندسية ومراجعة التعليمات البرمجية والتوثيق والاختبار والأدوات.",
      "يغطي الكتاب أيضا موضوعات مثل إدارة التبعية ، والتغييرات واسعة النطاق ، والتكامل المستمر ، والتسليم المستمر ، والحوسبة كخدمة ، مما يجعله موردا قيما لمهندسي البرمجيات الذين يتطلعون إلى تعزيز مهاراتهم وفهمهم في هذه المجالات."
    ],
    "commentSummary": [
      "تغطي مناقشة Hacker News العديد من الموضوعات المتعلقة بهندسة البرمجيات في Google ، بما في ذلك فعالية ممارساتهم وقابلية التوسع وهندسة أنظمة البرامج الخاصة بهم.",
      "كما يناقش عمليات مراجعة الأداء والترقية في Google ، بالإضافة إلى أهمية محاكاة ممارساتهم وعملية التطوير مع التركيز على مساحات عمل Piper و citc.",
      "تتطرق المحادثة إلى مجالات أخرى مثل قابلية قراءة الكود وإمكانية صيانته ، والآراء حول ممارسات ومنتجات Google الهندسية ، والموضوعات ذات الصلة مثل دول مجلس التعاون الخليجي و clang ، وقيود C ++ stdlib ، ومكتبة abseil ، ومحرك بحث Google ، والتوافق مع الإصدارات السابقة من Microsoft ، وكتاب عن هندسة البرمجيات في Google."
    ],
    "points": 323,
    "commentCount": 320,
    "retryCount": 0,
    "time": 1692021969
  }
]
