[
  {
    "title": "'빈대' 대체 살충제, 정부내일 긴급 사용 승인 계획",
    "originLink": "https://yonhapnewstv.co.kr/news/MYH20231109015600641",
    "originBody": "",
    "originSummary": [
      "남한 정부는 개미페슬리에 저항성을 가진 책목에 맞서 대안적인 농약의 사용을 급히 승인할 계획입니다.",
      "환경과학 국립연구원은 내일부터 모기, 파리 및 바퀴벌레를 죽이는 데 일반적으로 사용되는 '니코틴화 농약'의 책목 통제에 대한 사용을 허용할 것입니다.",
      "그러나 책목이 이미 이들 농약에 대한 저항성을 개발했다는 믿음으로 이 농약의 효과에 대한 논란이 계속되고 있습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "대한민국 정부가 기존의 살충제에 대한 저항성을 가진 책벌레를 효과적으로 퇴치하기 위해 대체 살충제의 사용을 긴급승인하는 계획에 있습니다.",
      "국립환경과학원은 이미 모기, 파리, 바퀴벌레를 죽이는 데에 사용되는 'neonicotinoid 살충제'를 내일부터 책벌레 퇴치에 사용할 수 있게 할 예정입니다.",
      "하지만 이러한 살충제의 효능에 대해 논란이 있으며, 그 중 한 가지 주장은 책벌레가 이미 이들 살충제에 대한 저항성을 개발했다는 것입니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699538349565
  },
  {
    "title": "'대체 살충제' 이르면 내일 긴급 사용승인 가능성",
    "originLink": "https://www.goodnews1.com/news/articleView.html?idxno=427930",
    "originBody": "",
    "originSummary": [
      "긴급사용 승인이 내일 가장 빠를 수 있으며, '대체 곤충 방제제'라는 사회적 살충제에 대한 이슈입니다.",
      "이 살충제는 각종 해충을 방제하는 데 사용됩니다.",
      "이 뉴스는 새로운 곤충 방제원으로서의 '대체 곤충 방제제'의 가용성을 공개적으로 알리는 특별한 점이 있습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "사회적 해충 제거 수단인 '대체성 해충제'에 대한 비상 사용 승인이 내일로부터 최소한 가능할 가능성이 있습니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699538349565
  },
  {
    "title": "대한민국, 내일부터 내성 빈대 타개 위한 '대체 살충제' 긴급 사용 승인 예정",
    "originLink": "https://www.nocutnews.co.kr/news/6043622",
    "originBody": "",
    "originSummary": [
      "남편을 대체하기 위해 대체 살충제의 긴급 사용을 승인할 계획인 한국 정부가 침대버그를 다루고 있습니다. 기존의 살충제에 대한 저항성을 가진 이들입니다.",
      "국립환경연구소는 이 목적을 위해 \"neonicotinoid 살충제\" 사용을 승인할 것으로 보입니다. 이것은 한국 질병관리청의 요청에 따른 것입니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "한국정부는 기존의 살충제에 저항성을 가진 침대벌레를 처리하기 위해 대체 살충제의 긴급 사용을 승인할 계획입니다.",
      "국립환경과학원은 한국질병관리청의 요청에 따라 이 목적을 위해 \"네오니코티노이드 살충제\"의 사용을 승인할 것으로 보입니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699538349565
  },
  {
    "title": "'대체 살충제' 긴급 사용 승인, 빈대 저항성 해결 방안에 초점",
    "originLink": "https://www.ytn.co.kr/_ln/0103_202311092226045475",
    "originBody": "",
    "originSummary": [
      "남한 정부는 농약에 저항력을 가진 파리의 확산을 막기 위해 대체 농약의 긴급 사용을 승인할 계획입니다.",
      "환경과학연구원은 파리 방제를 위해 일반적으로 모기, 파리, 바퀴벌레에 사용되는 농약의 사용을 허가할 계획입니다.",
      "이전에는 피레스로이드류 농약이 사용되었지만, 현재 확산 중인 파리 종은 이에 대한 저항력이 있습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "한국 정부는 농약 내성 파리 확산을 막기 위해 대체 폐피살을 긴급 사용 승인 계획하고 있다.",
      "환경과학연구원은 모기, 파리, 바퀴벌레용으로 일반적으로 사용되는 농약을 파리 제어를 위해 사용하려 한다.",
      "이전에는 퍼레스로이드 유형의 농약이 사용되었지만, 현재 확산되고 있는 파리 종은 이에 내성을 가지고 있다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699538349565
  },
  {
    "title": "'갤럭시 스마트폰에 실시간 통역 서비스 도입'…삼성, 사용자 개인정보 보호 강화 위한 제품개발에 나선다",
    "originLink": "https://www.mk.co.kr/news/business/10870532",
    "originBody": "",
    "originSummary": [
      "삼성전자는 자체 개발한 생성 AI 모델인 온디바이스 AI를 갤럭시 스마트폰에 도입할 계획이다. 이 AI의 주요 기능은 통화 중 실시간 번역 서비스로, 이는 세계 첫 출시이다.",
      "이 온디바이스 AI는 외부 클라우드에 접근하지 않고 기기 내에서 데이터를 수집하고 계산할 수 있어 처리 속도를 향상시킨다. 갤럭시 AI는 통화 상대방이 갤럭시 AI 폰을 사용하지 않더라도 실시간으로 대화를 번역한다.",
      "삼성은 이 온디바이스 AI가 통화 내용이 모바일 폰 밖으로 유출되는 것을 방지하여 개인정보 보호에 이점이 있다고 강조한다. 이 실시간 번역 기능은 다음 세대 플래그십 스마트폰 갤럭시 S24 시리즈에서 최소 1월에 도입될 예정이다."
    ],
    "commentBody": "",
    "commentSummary": [
      "삼성전자는 자체 개발한 생성 AI 모델인 온디바이스 AI를 갤럭시 스마트폰에 도입하려고 계획하고 있습니다. 이 AI의 주요 특징은 전세계에서 처음으로 출시되는 실시간 통화 번역 서비스입니다.",
      "이 온디바이스 AI는 사용자가 외부 클라우드에 접근하지 않고 장치 내에서 데이터를 수집하고 계산하게 하여 처리 속도를 향상시킵니다. 갤럭시 AI는 상대방이 갤럭시 AI 폰을 사용하지 않아도 대화를 실시간으로 수신자의 언어로 번역합니다.",
      "삼성은 이 온디바이스 AI가 통화 내용이 모바일 폰 외부로 유출되는 것을 막아 프라이버시 이점을 강조하고 있습니다. 실시간 통화 번역 기능은 다음 세대 플래그십 스마트폰 갤럭시 S24 시리즈에 최대한 빨리 1월에 도입될 것으로 예상됩니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699538349565
  },
  {
    "title": "대중교통에 출몰하는 침대벌레에 대응...긴급 살충제 사용 승인",
    "originLink": "https://biz.sbs.co.kr/article/20000143477",
    "originBody": "",
    "originSummary": [
      "대중교통에서 침대벌레가 발견되는 보고가 늘어나자 대한민국에서는 살충제 사용에 대한 비상 승인이 내려졌습니다.",
      "기차와 지하철 등의 붐비는 곳에서 특히 대책이 진행 중입니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "한국의 대중교통에서 침대벌레의 출몰에 대한 보고가 늘어나고 공중 우려가 커지면서, 살충제 사용에 대한 긴급 승인이 내려졌습니다.",
      "특히 기차와 지하철과 같은 붐비는 장소에서 대책이 진행 중입니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699538349565
  },
  {
    "title": "'살충제 내성' 빈대 방제 위해 대체 살충제 긴급 사용 승인 요청",
    "originLink": "https://news.kbs.co.kr/news/view.do?ncd=7813981",
    "originBody": "",
    "originSummary": [
      "국립환경과학연구소는 일반적인 살충제에 대한 저항성을 개발한 은어린이 확산을 제어하기 위해 대안 살충제에 대한 긴급 사용 승인을 요구하고 있습니다.",
      "승인된다면, 모기, 파리, 그리고 바퀴벌레에 대해 흔히 사용되는 이 네오니코티노이드 살충제는 다음 날부터 사용될 수 있습니다.",
      "승인 사용은 해충 방제 회사로 제한될 것이며, 가정에서의 사용은 이후의 조사 및 승인에 따라 달라질 것입니다. 이 살충제가 벌에게 해롭다는 우려에도 불구하고, 당국은 그 사용이 실내에 한정되고 인간에게는 해롭지 않다고 확신합니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "국립환경과학원이 은어에 대한 일반적인 살충제에 대한 저항성이 발달한 것을 제어하기 위해 대체 살충제에 대한 긴급 사용 승인을 요구하고 있다.",
      "승인된다면, 모기, 파리, 바퀴벌레 등에게 흔히 사용되는 뉴오니코틴계 살충제는 다음 날부터 사용될 수 있다.",
      "그러나, 뉴오니코틴계 살충제가 벌에 대한 잠재적인 해를 두려워하면서도, 그 사용이 실내로 제한될 것이며 인간에게 해롭지 않을 것이라는 당국의 확신이 있다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699538349565
  },
  {
    "title": "예탁원, CD 대체금리 개발 추진...리스크 프리 비율을 기반으로",
    "originLink": "https://www.sedaily.com/NewsView/29X63JB42D",
    "originBody": "",
    "originSummary": [
      "한국예탁결제원(KSD)은 한국 소비자물가지수 (KOFR)를 기반으로 한 예금증서 (CD) 대체 이자율을 개발 중입니다.",
      "이는 CD 이자율 계산의 종료에 대한 대응책으로, 금융 상품 거래를 촉진하려는 목표를 갖고 있습니다.",
      "이 과정에서는 외부 전문 기관의 상담과 런던 은행간 금리(LIBOR) 대체 이자율 계산 방법론의 분석이 포함되었습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "한국예탁결제원(KSD)이 한국판 무위험금리(KOFR)를 기반으로 한 예금증서(CD) 대체 이자율을 개발 중입니다.",
      "이는 CD 이자율 계산의 종료에 대응하여 금융상품 거래를 촉진하려는 조치입니다.",
      "이 프로젝트는 외부 전문 기관과의 상담 및 LIBOR 대체 이자율 계산 방법을 분석하는 과정을 포함하였습니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699538349565
  }
]
