[
  {
    "id": 38594697,
    "title": "Omg.lol: Um oásis peculiar para entusiastas da web",
    "originLink": "https://blakewatson.com/journal/omg-lol-an-oasis-on-the-internet/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38594697",
    "commentBody": "",
    "originSummary": [
      "O autor compartilha sua experiência com o Twitter e o desligamento de aplicativos de terceiros por Elon Musk, destacando o impacto sobre a comunidade.",
      "Acidentalmente, eles se juntaram ao Mastodon, um serviço exclusivo chamado omg.lol, que oferece vários recursos, como encaminhamento de e-mail, criação de páginas da Web, plataforma de blog, pastebin e hospedagem de imagens.",
      "O autor aprecia o senso de comunidade e o envolvimento ativo do fundador, Adam Newbold, enquanto promove a ideia de criar sites pessoais. O resumo termina com uma menção à contribuição do aplicativo Twitterrific para o mascote do Twitter, o pássaro azul."
    ],
    "commentSummary": [
      "Omg.lol está ganhando popularidade como uma comunidade on-line, mas há preocupações quanto à sua política de privacidade e à conformidade com as leis de privacidade européias.",
      "A conversa aborda vários tópicos, incluindo o declínio das comunidades criativas on-line, a mudança na percepção da liberdade de expressão e a importância de arquivar o conteúdo on-line.",
      "As discussões também giram em torno dos desafios das plataformas descentralizadas, como o Mastodon, o futuro das plataformas de mídia social, como o Twitter, e o impacto do criador do PHP, Taylor Otwell. Além disso, as conversas exploram o armazenamento de mídia em sistemas de armazenamento compartilhado e a acessibilidade dos planos VPS para hospedagem na Web."
    ],
    "points": 578,
    "commentCount": 253,
    "retryCount": 0,
    "time": 1702240002
  },
  {
    "id": 38591584,
    "title": "Usuários do Emacs resolvem o problema com suas próprias mãos",
    "originLink": "https://eshelyaron.com/posts/2023-12-10-bad-news.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38591584",
    "commentBody": "",
    "originSummary": [
      "O autor está frustrado com uma alteração recente na ramificação principal do Emacs que teve um impacto negativo na experiência do usuário.",
      "Eles criticam os mantenedores do Emacs por aceitarem a mudança apesar das objeções dos usuários e desenvolvedores.",
      "O autor criou sua própria bifurcação do Emacs, chamada de ramificação \"principal\", na qual reverteu a alteração problemática e fez suas próprias melhorias. Ele está incentivando outras pessoas a participar e contribuir com sua ramificação."
    ],
    "commentSummary": [
      "A comunidade do Emacs está passando por um debate sobre uma mudança recente no software que alguns usuários consideram prejudicial aos seus fluxos de trabalho e incompatível com as versões anteriores.",
      "Os usuários estão discutindo se o comportamento padrão deve ser revertido ou se o novo comportamento deve ser opcional para os usuários escolherem.",
      "As discussões se aprofundam no processo de desenvolvimento, no valor do feedback do usuário e no comportamento de certos indivíduos, com sugestões que incluem a bifurcação do software ou a busca de um meio-termo para resolver as preocupações."
    ],
    "points": 337,
    "commentCount": 210,
    "retryCount": 0,
    "time": 1702217233
  },
  {
    "id": 38591662,
    "title": "Aprenda a criar seu próprio compilador retro para CP/M no processador Z80",
    "originLink": "http://t3x.org/t3x/0/book.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38591662",
    "commentBody": "",
    "originSummary": [
      "O livro \"Write Your Own Retro Compiler\" fornece o código-fonte de um compilador auto-hospedado para CP/M no processador Z80.",
      "A linguagem usada, T3X/0, é baseada em Pascal e BCPL e é fácil de aprender.",
      "O livro aborda tópicos como análise lexical, análise de sintaxe, geração de código, otimizações, interface BDOS e biblioteca de tempo de execução."
    ],
    "commentSummary": [
      "O autor lançou um novo livro sobre geração de código para CP/M no processador Z80, com foco em questões de visibilidade.",
      "Há uma sugestão para criar um livro sobre o Forth e explorar o uso do Mastodon para aumentar a visibilidade.",
      "As discussões giram em torno de computação retrô, linguagens de programação e construção de compiladores, exigindo conhecimento prévio em construção de compiladores e familiaridade com linguagens procedurais e de montagem.",
      "O livro destaca a simplicidade e a capacidade de transferência do conhecimento em sistemas de computador mais antigos, ao mesmo tempo em que reconhece a complexidade dos compiladores modernos."
    ],
    "points": 303,
    "commentCount": 46,
    "retryCount": 0,
    "time": 1702217905
  },
  {
    "id": 38596953,
    "title": "Remake GPT-4 da demonstração do Google Gemini da Greg Technology: Trazendo a realidade para a ficção",
    "originLink": "https://sagittarius.greg.technology/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38596953",
    "commentBody": "",
    "originSummary": [
      "Um remake da demonstração falsa do Google Gemini foi criado usando o GPT-4, um modelo de linguagem avançado.",
      "O resumo afirma que esse remake é uma demonstração real, com o código-fonte disponível em um repositório específico.",
      "O projeto é creditado a Greg Technology."
    ],
    "commentSummary": [
      "O resumo abrange vários tópicos, incluindo limitações e aprimoramentos necessários para sistemas de reconhecimento de fala, desafios de transmissão de dados de entrada e ceticismo em relação a tecnologias de IA e práticas de marketing enganosas.",
      "Ele discute o papel das práticas enganosas, das Vilas Potemkin e do problema do agente principal.",
      "Os usuários na seção de comentários expressam ceticismo em relação ao Google Gemini e discutem a desconexão entre as declarações de marketing e o valor real do produto. Uma empresa chamada Greg é mencionada, juntamente com uma discussão sobre a autenticidade de uma demonstração ao vivo."
    ],
    "points": 295,
    "commentCount": 70,
    "retryCount": 0,
    "time": 1702261059
  },
  {
    "id": 38593616,
    "title": "Mistral AI levanta 450 milhões de euros e a avaliação sobe para US$ 2 bilhões",
    "originLink": "https://www.unite.ai/paris-based-startup-and-openai-competitor-mistral-ai-valued-at-2-billion/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38593616",
    "commentBody": "",
    "originSummary": [
      "A Mistral AI, uma startup sediada em Paris, garantiu um investimento de 450 milhões de euros, aumentando sua avaliação para US$ 2 bilhões.",
      "Os líderes de investimento incluem Andreessen Horowitz, Nvidia Corp e Salesforce, indicando o potencial da Mistral AI.",
      "O principal produto da Mistral AI, o Mistral 7B, é um modelo avançado de linguagem conhecido por seus recursos de eficiência e personalização."
    ],
    "commentSummary": [
      "A startup francesa Mistral AI alcançou uma avaliação de US$ 2 bilhões e está chamando a atenção por seus modelos de IA.",
      "Espera-se que a disponibilidade de modelos de IA de código aberto no nível do GPT-4 surja em breve, mas há preocupações quanto à falta de conjuntos de dados diversos para o treinamento desses modelos.",
      "As discussões abrangem uma série de tópicos, incluindo a possível automação do trabalho, as possibilidades de redução de custos, diferentes modelos de IA e ferramentas de assistência à codificação, a decisão da Mistral AI de abrir o código-fonte de seu modelo e debates sobre sua avaliação e possível apoio governamental."
    ],
    "points": 285,
    "commentCount": 215,
    "retryCount": 0,
    "time": 1702232756
  },
  {
    "id": 38591437,
    "title": "Procurando cursos práticos de design de interface do usuário? Aqui está uma lista de tutoriais, exemplos e exercícios práticos",
    "originLink": "https://news.ycombinator.com/item?id=38591437",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38591437",
    "commentBody": "",
    "originSummary": [
      "O autor está procurando cursos de design de interface do usuário que sejam práticos e forneçam princípios claros a serem aplicados em seu contexto específico.",
      "Eles conhecem trabalhos de vanguarda como \"Magic Ink\", de Bret Victor, mas estão buscando tutoriais, exemplos, exercícios ou cursos mais \"práticos\".",
      "O autor deseja recomendações de recursos de design de interface do usuário que sejam mais fundamentados e aplicáveis."
    ],
    "commentSummary": [
      "O artigo é uma coleção de discussões e recomendações sobre recursos de design de interface do usuário, abrangendo livros, cursos e sites.",
      "Os tópicos discutidos incluem o valor do espaço em branco no design, a eficácia da leitura de livros para desenvolver habilidades de design e a função e a experiência dos designers em empresas de tecnologia.",
      "O artigo enfatiza a importância da aplicação prática e da prática na aquisição de habilidades de design e menciona recursos pagos e gratuitos para aprender design de interface do usuário."
    ],
    "points": 284,
    "commentCount": 102,
    "retryCount": 0,
    "time": 1702215463
  },
  {
    "id": 38590984,
    "title": "AST-grep: Ferramenta CLI para pesquisa estrutural de código, linting e reescrita",
    "originLink": "https://github.com/ast-grep/ast-grep",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38590984",
    "commentBody": "",
    "originSummary": [
      "O AST-grep é uma ferramenta de linha de comando que permite a pesquisa estrutural, a identificação e a reescrita de códigos, aproveitando as árvores de sintaxe abstratas (AST).",
      "Seu funcionamento é semelhante ao do grep, mas, em vez de corresponder ao texto, ele corresponde aos nós AST.",
      "Os usuários podem escrever padrões semelhantes a códigos para combinar códigos com a mesma estrutura sintática.",
      "O AST-grep oferece manipulação avançada de código, correspondência intuitiva de padrões e uma API semelhante à do jQuery para análise de AST.",
      "Ele pode ser instalado por meio de gerenciadores de pacotes ou compilado a partir da fonte.",
      "A ferramenta tem como objetivo simplificar a programação AST e é particularmente útil para autores de bibliotecas de código aberto, líderes técnicos e pesquisadores de segurança."
    ],
    "commentSummary": [
      "Ast-grep, grep-ast e syntax-searcher são destacados como ferramentas eficazes para pesquisa estrutural de código, linting e reescrita, oferecendo funcionalidade para localizar e exibir correspondências de código.",
      "Há preocupações sobre a documentação e a complexidade dessas ferramentas, indicando áreas que poderiam ser aprimoradas.",
      "Outras ferramentas, como semgrep, Conscat e OpenRewrite, são mencionadas como opções para refatoração de código e identificação de similaridade semântica, expandindo a gama de ferramentas disponíveis para os desenvolvedores.",
      "As limitações da modelagem de linguagem e os desafios de determinar a equivalência semântica são reconhecidos, destacando a complexidade dessas tarefas.",
      "Os possíveis aprimoramentos e melhorias dessas ferramentas são discutidos, demonstrando um compromisso com o desenvolvimento e a inovação contínuos no campo da análise e do refinamento de códigos."
    ],
    "points": 259,
    "commentCount": 70,
    "retryCount": 0,
    "time": 1702209798
  },
  {
    "id": 38590827,
    "title": "Krasue: Rootkit furtivo para Linux invade as telecomunicações tailandesas sem ser detectado por 2 anos",
    "originLink": "https://arstechnica.com/security/2023/12/stealthy-linux-rootkit-found-in-the-wild-after-going-undetected-for-2-years/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38590827",
    "commentBody": "",
    "originSummary": [
      "Um malware para Linux chamado Krasue infectou secretamente empresas de telecomunicações tailandesas por dois anos sem ser detectado.",
      "O Krasue é um trojan de acesso remoto que permite que os invasores controlem remotamente as redes visadas.",
      "O Krasue usa vários rootkits para ocultar suas atividades, disfarça \"pings vivos\" como mensagens RTSP e contém um rootkit que intercepta a chamada de sistema kill() para sobreviver às tentativas de desligamento. Os possíveis vetores de instalação incluem exploração de vulnerabilidades, roubo de credenciais ou atualizações de software trojanizadas."
    ],
    "commentSummary": [
      "A conversa discute vários tópicos relacionados à segurança do Linux, incluindo a descoberta do rootkit Krasue e preocupações sobre a vulnerabilidade dos sistemas Linux.",
      "Ele explora a eficácia do software antivírus e a necessidade de medidas de segurança aprimoradas nos desktops Linux.",
      "A conversa também examina a possível implementação de um sistema de permissão de tempo de execução no Linux e compara os recursos de segurança do Linux com outros sistemas operacionais."
    ],
    "points": 238,
    "commentCount": 106,
    "retryCount": 0,
    "time": 1702207604
  },
  {
    "id": 38595855,
    "title": "Melhore a acessibilidade da Web: Incentivar a integração de RSS em sites",
    "originLink": "https://rknight.me/please-expose-your-rss/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38595855",
    "commentBody": "",
    "originSummary": [
      "O autor teve dificuldade para encontrar links de feeds RSS em diferentes sites.",
      "Descobriu-se que muitos sites não tinham esse recurso, o que dificultava a acessibilidade da Web.",
      "O autor defende que os proprietários de sites incluam links de RSS para dar suporte ao RSS e melhorar a acessibilidade na Web. Eles sugerem o uso de links padrão e métodos de descoberta automática de RSS para facilitar a localização do feed RSS de um site pelos navegadores e softwares. O autor também recomenda a inclusão de várias tags de link para vários feeds e enfatiza a importância de exibir um botão de RSS reconhecível."
    ],
    "commentSummary": [
      "Problemas com a descoberta e o acesso a feeds RSS em sites, devido à falta de visibilidade e suporte dos navegadores.",
      "O desaparecimento do Google Reader afetou a disponibilidade e a popularidade dos feeds RSS.",
      "Falta de suporte nativo para publicidade em feeds RSS, o que os torna uma opção preferida para quem prefere uma experiência sem anúncios.",
      "Inconsistência de conteúdo nos feeds RSS, que podem variar em formato e qualidade.",
      "Vantagens de usar um leitor de RSS para conveniência e agregação de conteúdo personalizado.",
      "Debates sobre raspagem de conteúdo de forma programática, venda de dados de feeds RSS e exposição de contagens de assinantes.",
      "Sugestões para estender o RSS de modo a incluir postagens em fóruns e integrar sites estáticos com feeds de feeds.",
      "Discussões sobre design de sites, configuração e manutenção de feeds RSS e comparações entre leitores de RSS e agregadores sociais.",
      "A presença de anúncios em feeds RSS é um tópico de debate."
    ],
    "points": 237,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1702248775
  },
  {
    "id": 38595245,
    "title": "O impacto do trabalho após o expediente sobre a produtividade e o bem-estar",
    "originLink": "https://slack.com/intl/en-gb/blog/news/the-surprising-connection-between-after-hours-work-and-decreased-productivity?nojsmode=1",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38595245",
    "commentBody": "",
    "originSummary": [
      "Os funcionários que se desconectam no final do dia de trabalho são 20% mais produtivos do que aqueles que continuam trabalhando após o expediente, de acordo com uma pesquisa realizada pelo Índice da força de trabalho do Slack.",
      "Fazer pausas durante o dia de trabalho é fundamental para a produtividade e o bem-estar, mas metade dos trabalhadores de escritório raramente ou nunca faz pausas.",
      "O estudo sugere que cerca de quatro horas de tempo de trabalho concentrado é o ideal, e passar mais de duas horas em reuniões é considerado excessivo. Além disso, o final da tarde (das 15h às 18h) é o horário menos produtivo para o trabalho."
    ],
    "commentSummary": [
      "O artigo examina a conexão entre o trabalho após o expediente e a produtividade, enfatizando a importância de resultados oportunos e confiáveis em relação ao número de horas trabalhadas.",
      "Ele destaca os efeitos negativos do trabalho até tarde sobre a saúde e o bem-estar, usando como exemplo a cultura da Amazon e suas expectativas irrealistas de trabalho após o expediente.",
      "O debate também explora o impacto da fadiga na produtividade e discute vários programas para a criação de currículos e CVs. De modo geral, o debate se aprofunda nas complexidades da produtividade e na importância do equilíbrio entre vida pessoal e profissional."
    ],
    "points": 225,
    "commentCount": 124,
    "retryCount": 0,
    "time": 1702243796
  },
  {
    "id": 38596634,
    "title": "John Carmack e John Romero refletem sobre o 30º aniversário de Doom",
    "originLink": "https://www.pcgamer.com/for-dooms-30th-anniversary-the-johns-romero-and-carmack-reunited-to-celebrate-the-fps-that-changed-everything-i-want-to-thank-everybody-in-the-doom-community-for-keeping-this-game-alive/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38596634",
    "commentBody": "",
    "originSummary": [
      "Os co-fundadores John Carmack e John Romero comemoraram o 30º aniversário do Doom com uma discussão sobre o lendário jogo FPS.",
      "Eles refletiram sobre o desenvolvimento do jogo, reconhecendo suas próprias críticas e desejos de efeitos gráficos mais chamativos.",
      "Os desenvolvedores também discutiram a experiência multijogador e expressaram gratidão à comunidade Doom por seu apoio em manter o jogo vivo."
    ],
    "commentSummary": [
      "O resumo discute discussões e tópicos de fóruns sobre o icônico jogo DOOM e seu impacto no setor de jogos.",
      "Ele aborda tópicos como o processo de desenvolvimento, priorizando a diversão e a experiência do jogador, o lançamento do código-fonte e a influência do DOOM em outros jogos.",
      "As discussões também abordam a IA em jogos, lutas internas entre monstros, aliados controlados por IA, o legado de DOOM, seu impacto no setor de jogos independentes e na comunidade de modding e os avanços tecnológicos no design de jogos."
    ],
    "points": 220,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1702257253
  },
  {
    "id": 38593638,
    "title": "Ratatui: Uma biblioteca leve em Rust para interfaces de usuário de terminal",
    "originLink": "https://github.com/ratatui-org/ratatui",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38593638",
    "commentBody": "",
    "originSummary": [
      "O Ratatui é uma biblioteca leve em Rust para a criação de interfaces de usuário de terminal (TUIs) e é uma bifurcação do crate tui-rs para desenvolvimento contínuo.",
      "Ele usa renderização imediata com buffers intermediários e requer inicialização e restauração de terminal.",
      "O Ratatui oferece suporte a vários backends, como Crossterm, Termion e Termwiz, e oferece recursos para desenho de interface do usuário, manipulação de eventos, criação de layout, estilo de texto e vários widgets integrados. Ele tem uma comunidade ativa com um servidor Discord e um fluxo de trabalho GitHub para contribuições."
    ],
    "commentSummary": [
      "A discussão gira em torno das bibliotecas TUI (Text User Interface), como a Textual para Python e a BubbleTea para Go, comparando-as com a biblioteca Turbo Vision da década de 1990.",
      "As vantagens e limitações das TUIs são examinadas, com foco na experiência do usuário e nas questões de acessibilidade.",
      "A Ratatui, uma biblioteca de interface de usuário de terminal, é elogiada, mas atualmente carece de determinados recursos e suporte a eventos."
    ],
    "points": 219,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1702232930
  },
  {
    "id": 38592243,
    "title": "O governo dos EUA exige dados de notificações push, levantando preocupações sobre vigilância",
    "originLink": "https://www.404media.co/us-government-warrant-monitoring-push-notifications-apple-google-yahoo/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38592243",
    "commentBody": "",
    "originSummary": [
      "O governo dos EUA está solicitando informações de empresas de tecnologia relacionadas a notificações push para identificar dispositivos específicos, conforme revelado em um registro judicial e em uma carta do senador Ron Wyden.",
      "A Apple e o Google recebem vários tipos de informações, incluindo metadados e, às vezes, conteúdo não criptografado, quando as notificações push são enviadas aos telefones dos usuários.",
      "O senador Wyden está defendendo a transparência das empresas de tecnologia em relação às solicitações de vigilância do governo, e a Apple e o Google responderam atualizando seus relatórios de transparência e comprometendo-se a manter os usuários informados."
    ],
    "commentSummary": [
      "A conversa discute a vigilância governamental e as preocupações com a privacidade em várias áreas, como monitoramento de notificações push, criptografia, construção paralela, sniffers de rede de ISPs e análise de inteligência artificial.",
      "Os participantes expressam preocupação com a privacidade, o possível abuso de poder e a importância da conscientização pública e do devido processo legal.",
      "As contramedidas sugeridas incluem a desativação de notificações, o uso de serviços criptografados ou VPNs e a redução da dependência de produtos eletrônicos de consumo."
    ],
    "points": 206,
    "commentCount": 75,
    "retryCount": 0,
    "time": 1702222832
  },
  {
    "id": 38597744,
    "title": "Melhorando o desempenho da Internet: Apresentando a arquitetura L4S para baixa latência, baixa perda e taxa de transferência escalável",
    "originLink": "https://datatracker.ietf.org/doc/rfc9330/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38597744",
    "commentBody": "",
    "originSummary": [
      "A RFC 9330 apresenta a arquitetura L4S, que visa aprimorar os aplicativos da Internet reduzindo o atraso de enfileiramento e permitindo baixa latência e rendimento escalonável.",
      "A arquitetura L4S propõe novos mecanismos de controle de congestionamento que funcionam junto com os controles existentes e usam uma versão modificada da ECN (Explicit Congestion Notification, notificação explícita de congestionamento).",
      "O objetivo é fornecer um serviço de Internet de alta qualidade com desempenho aprimorado para aplicativos interativos, como jogos, streaming e videoconferência.",
      "A arquitetura pode ser implementada de forma incremental e é compatível com diferentes tipos de rede.",
      "O texto inclui discussões sobre considerações de implantação, policiamento de tráfego e considerações de segurança.",
      "Ele enfatiza a importância do feedback preciso do ECN e da escalabilidade nos algoritmos de controle de congestionamento.",
      "O documento fornece referências a recursos adicionais sobre controle de congestionamento, protocolos de rede e serviços diferenciados."
    ],
    "commentSummary": [
      "O Serviço de Internet de Baixa Latência, Baixa Perda e Taxa de Transferência Escalável (L4S) tem como objetivo reduzir a latência e melhorar o desempenho de aplicativos como chamadas de vídeo.",
      "O L4S elimina o inchaço do buffer e melhora a sinalização de congestionamento para aliviar atrasos e interrupções na transmissão de dados.",
      "O L4S pode ser implementado por vários protocolos de transporte, incluindo TCP e QUIC, e tem o potencial de melhorar o desempenho da rede quando adotado pelos ISPs."
    ],
    "points": 201,
    "commentCount": 41,
    "retryCount": 0,
    "time": 1702270232
  },
  {
    "id": 38593008,
    "title": "Ingredientes inertes em pesticidas podem representar uma ameaça maior para as abelhas",
    "originLink": "https://theconversation.com/inert-ingredients-in-pesticides-may-be-more-toxic-to-bees-than-scientists-thought-218005",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38593008",
    "commentBody": "",
    "originSummary": [
      "Ingredientes inertes em pesticidas, anteriormente considerados não tóxicos, podem ser mais prejudiciais às abelhas do que se pensava, de acordo com uma nova pesquisa.",
      "Um estudo expôs as abelhas a um fungicida que continha ingredientes ativos e inertes e descobriu que a formulação completa prejudicava a memória das abelhas, enquanto os ingredientes ativos isolados não prejudicavam.",
      "Os ingredientes inertes têm funções diferentes e são regulamentados de forma diferente dos ingredientes ativos, o que dificulta a determinação de sua toxicidade. São necessários testes abrangentes das formulações de pesticidas para entender seu impacto na saúde das abelhas. Mudanças na regulamentação de pesticidas poderiam ajudar a proteger as abelhas, identificando os ingredientes inertes nos rótulos e exigindo mais testes sobre os efeitos de longo prazo."
    ],
    "commentSummary": [
      "Ingredientes \"inertes\" em pesticidas, que normalmente são considerados não tóxicos, podem ser mais prejudiciais às abelhas do que se acreditava anteriormente.",
      "Um estudo revela que a formulação completa de um fungicida prejudica a memória das abelhas, enquanto os ingredientes ativos isolados não.",
      "O uso de pesticidas tem efeitos negativos diretos sobre as abelhas e afeta indiretamente suas fontes de alimento, tornando-as mais vulneráveis a parasitas e doenças. A regulamentação e a transparência em torno dos ingredientes inertes dos pesticidas geram preocupações quanto aos possíveis danos."
    ],
    "points": 174,
    "commentCount": 36,
    "retryCount": 0,
    "time": 1702228030
  }
]
