[
  {
    "id": 37976309,
    "title": "அமெரிக்காவின் குழப்பமான சுகாதாரப் பாதுகாப்பு அமைப்பிலிருந்து யார் அதிகம் ஆதாயமடைகிறார்கள்?",
    "originLink": "https://www.economist.com/business/2023/10/08/who-profits-most-from-americas-baffling-health-care-system",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37976309",
    "commentBody": "",
    "originSummary": [
      "அமெரிக்க சுகாதார அமைப்பு ஊழியர் பற்றாக்குறை மற்றும் அதிக செலவுகள் போன்ற சிரமங்களை எதிர்கொள்கிறது.",
      "இந்த அமைப்பின் சிக்கலானது ஒரு சில இடைத்தரகர்களுக்கு பெரும் இலாபம் ஈட்டுவது மட்டுமல்லாமல், இந்த சவால்களுக்கு கணிசமாக பங்களிக்கிறது, கைசர் நிரந்தர ஊழியர்களின் வேலைநிறுத்தம் மற்றும் மெடிகேரின் மருந்து விலை பேச்சுவார்த்தைகள் போன்ற நிகழ்வுகளால் விளக்கப்படுகிறது.",
      "அமெரிக்காவில் சுகாதாரத்திற்கான அதிக செலவுகள் இருந்தபோதிலும், மற்ற பணக்கார நாடுகளுடன் ஒப்பிடும்போது சுகாதார விளைவுகள் பின்தங்கியுள்ளதாக கூறப்படுகிறது."
    ],
    "commentSummary": [
      "விவாத நூல் அமெரிக்க சுகாதார அமைப்பின் பல்வேறு அம்சங்களை உள்ளடக்கியது, அதன் சிக்கலான தன்மை, திறமையின்மை மற்றும் அதிக செலவுகளைத் தொடும் தலைப்புகள்.",
      "போதைப்பொருள் மற்றும் புகையிலை அடிமையாதல், எஃப்.டி.ஏ விதிகளை அமல்படுத்துதல், தேசிய சட்டங்களை நிறைவேற்றும் செயல்முறை மற்றும் அமெரிக்க மற்றும் ஐரோப்பிய சுகாதார அமைப்புகளுக்கு இடையிலான ஒப்பீடுகள் ஆகியவை விவாதங்களில் அடங்கும்.",
      "சுகாதார சீர்திருத்தங்கள், ஒழுங்குமுறைகளின் தாக்கம், விலை வெளிப்படைத்தன்மையின்மை மற்றும் காப்பீட்டு நிறுவனங்கள், மருத்துவமனைகள் மற்றும் மருந்து நிறுவனங்களின் பங்குகள் உள்ளிட்ட தீர்வுகளில் மாறுபட்ட கருத்துகளுடன், சுகாதார அமைப்பு குறிப்பிடத்தக்க குறைபாடுகளைக் கொண்டுள்ளது என்பதை பங்கேற்பாளர்கள் ஒப்புக்கொண்டனர்."
    ],
    "points": 266,
    "commentCount": 375,
    "retryCount": 0,
    "time": 1697989182
  },
  {
    "id": 37978483,
    "title": "Nanofiche: சிறிய சேமிப்பகம், என்றென்றும்",
    "originLink": "https://www.archmission.org/nanofiche",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37978483",
    "commentBody": "",
    "originSummary": [
      "ஆர்ச் மிஷன் அறக்கட்டளை ஸ்டாம்பர் டெக்னாலஜியால் வடிவமைக்கப்பட்ட நிக்கல் அடிப்படையிலான திரைப்படமான நானோஃபிச்சேவை விண்வெளி போன்ற தீவிர சூழல்களில் அதன் ஆயுட்காலம் மற்றும் செயல்திறன் காரணமாக அவற்றின் காப்பகத் தேவைகளுக்காக ஏற்றுக்கொண்டுள்ளது.",
      "நானோஃபிச் சிதைவு இல்லாமல் பெரிய அளவிலான அனலாக் தரவைத் தக்கவைக்க முடியும், இது அதன் முன்னோடியான மைக்ரோஃபைச்சை விட அதிக ஆயுட்காலம் மற்றும் விண்வெளி செயல்திறனை வழங்குகிறது, இது சுற்றுச்சூழல் உணர்திறன் கொண்டது மற்றும் விலையுயர்ந்த பராமரிப்பு தேவைப்படுகிறது.",
      "அதன் வலுவான தன்மை மற்றும் கச்சிதமான அளவு தவிர, நானோஃபிச் அதன் உயர் தெளிவுத்திறன், காப்புரிமை பெற்ற பாதுகாப்பு அம்சங்கள் மற்றும் விண்வெளியில் தொந்தரவு இல்லாமல் இருந்தால் பில்லியன் கணக்கான ஆண்டுகள் நீடிக்கும் என்று எதிர்பார்க்கப்படும் ஆயுட்காலம் ஆகியவற்றால் வேறுபடுகிறது."
    ],
    "commentSummary": [
      "அனலாக் உரை, டிஜிட்டல் குறியாக்கம், கண்ணாடி ஊடக ஆப்டிகல் டிஸ்க்குகள், புத்தகங்கள், நானோஃபிச் தொழில்நுட்பம் மற்றும் மைக்ரோசாப்டின் சிலிக்கா தொழில்நுட்பம் உள்ளிட்ட நீண்டகால தரவு சேமிப்பு மற்றும் பாதுகாப்பிற்கான பல்வேறு முறைகளை மையமாகக் கொண்டது.",
      "இந்த சேமிப்பு முறைகளின் நடைமுறை, செலவு மற்றும் அணுகல் பற்றிய கவலைகள் உள்ளன, அத்துடன் அவற்றின் நம்பகத்தன்மையை கேள்விக்குள்ளாக்கும் சந்தேகங்களும் உள்ளன.",
      "உலோகத்தில் நானோ அளவு வடிவங்கள், நுண்ணிய முறையில் செதுக்கப்பட்ட வட்டுகள் மற்றும் நிலவில் பூமிக்கு வெளியே சேமிப்பு ஆகியவற்றை உள்ளடக்கிய புதிய சேமிப்பு தொழில்நுட்பம் விவாதிக்கப்படுகிறது, அவற்றின் தனியுரிம தன்மை, அதிக செலவுகள், வாசிப்புத்திறன், ஆயுட்காலம் மற்றும் சாத்தியக்கூறு பற்றிய பிரச்சினைகள் எழுப்பப்படுகின்றன."
    ],
    "points": 207,
    "commentCount": 119,
    "retryCount": 0,
    "time": 1698004203
  },
  {
    "id": 37977502,
    "title": "வன்பொருள் ஹேக்கிங் ஆய்வகத்தை உருவாக்குவதற்கான தொடக்க வழிகாட்டி",
    "originLink": "https://voidstarsec.com/hw-hacking-lab/vss-lab-guide",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37977502",
    "commentBody": "",
    "originSummary": [
      "குறிப்பிடப்பட்ட வழிகாட்டி ஒரு உட்பொதிக்கப்பட்ட அமைப்புகள் ஆய்வகத்தை உருவாக்குவதற்கான பரிந்துரைகளை வழங்குகிறது, இதில் பணிப்பெட்டிகள், ஈ.எஸ்.டி பாதுகாப்பு, சோல்டரிங் உபகரணங்கள், சூடான காற்று நிலையங்கள் மற்றும் பல போன்ற உள்ளடக்கங்கள் அடங்கும்.",
      "கிட்ஹப் களஞ்சியத்தின் மூலம் அணுகக்கூடிய இந்த வழிகாட்டி, பல்வேறு வரவுசெலவுத் திட்டங்களுக்கு நெகிழ்வானது மற்றும் மேலும் மேம்பாட்டிற்கான பயனர் பங்களிப்புகளையும் ஊக்குவிக்கிறது.",
      "அடிப்படை ஆய்வக அமைப்புக்கு கூடுதலாக, இது சோல்டரிங் கருவிகள், ஆஸிலோஸ்கோப்கள், லாஜிக் பகுப்பாய்வுகள் மற்றும் பிழை ஊசி மற்றும் ஆர்.எஃப் பாதுகாப்பு மதிப்பீட்டிற்கான சிறப்பு பயன்பாடுகள் பற்றியும் விவரிக்கிறது."
    ],
    "commentSummary": [
      "சோல்டரிங் இரும்புகள், நுண்ணோக்கிகள் மற்றும் மல்டிமீட்டர்கள் போன்ற உயர்தர கருவிகளை உள்ளடக்கிய வன்பொருள் ஹேக்கிங் ஆய்வகத்தை அமைப்பதன் முக்கியத்துவத்தை இந்த இடுகை வலியுறுத்துகிறது.",
      "மின்னழுத்தத்தை அளவிடும் நடைமுறைகள், சோல்டரிங் நுட்பங்கள், நிலையான மின்சார சேதத்தைத் தடுப்பது மற்றும் ஈயம் இல்லாத சோல்டரின் நன்மை தீமைகளைப் பற்றி விவாதிக்கிறது.",
      "வன்பொருள் ஹேக்கிங்கில் தொடக்கக்காரர்களுக்கு அத்தியாவசிய கருவிகள் மற்றும் வளங்கள் குறித்த ஆசிரியரின் பரிந்துரைகளும் இதில் அடங்கும்."
    ],
    "points": 207,
    "commentCount": 81,
    "retryCount": 0,
    "time": 1697996863
  },
  {
    "id": 37976894,
    "title": "சிபியு தயாரிப்பது எப்படி - ஒரு எளிய பட அடிப்படையிலான விளக்கம்",
    "originLink": "https://blog.robertelder.org/how-to-make-a-cpu/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37976894",
    "commentBody": "",
    "originSummary": [
      "பாறைகள் மற்றும் மணல் போன்ற அடிப்படை கூறுகளைப் பயன்படுத்தி ஒரு மத்திய செயலாக்க அலகை (சிபியு) உருவாக்குவதற்கான எளிய வழிகாட்டியை கட்டுரை வழங்குகிறது; இது சிலிக்கான் டை ஆக்சைடை சுத்திகரித்தல், சிலிக்கான் மோனோகிரிஸ்டலை உருவாக்குதல் மற்றும் மூலோபாய ரீதியாக சிலிகான் வேஃபர்களை ஊக்குவித்தல் உள்ளிட்ட படிகளை வழங்குகிறது.",
      "நவீன சிபியு உற்பத்தியின் உயர் சிக்கலான மற்றும் தனியுரிம இயல்பை ஆசிரியர் ஒப்புக்கொள்கிறார், மேலும் ஆராய்ச்சி ஆதாரங்களை வழங்குகிறார், மேலும் இந்த செயல்பாட்டில் வேதியியல் பயன்பாட்டுடன் தொடர்புடைய அபாயங்களை வெளிச்சம் போட்டுக் காட்டுகிறார்.",
      "அமெச்சூர் சிப் உற்பத்தியின் சாத்தியக்கூறுகளை கேள்வி கேட்பதன் மூலம் கட்டுரை முடிவடைகிறது மற்றும் தனிப்பயன் சிப் உற்பத்தியின் கருத்தை ஒரு சாத்தியமான பொழுதுபோக்கு வணிகமாக அறிமுகப்படுத்துகிறது."
    ],
    "commentSummary": [
      "இந்த கட்டுரை ஒரு சிபியுவை உருவாக்குவதற்கான விரிவான, படிப்படியான செயல்முறையை எடுத்துக்காட்டுகிறது, இது விளக்க படங்களுடன் இணைக்கப்பட்டுள்ளது.",
      "ஒரு CPU ஐ உருவாக்குவதற்கு தேவையான வளங்களைப் பெறுவது போன்ற தொடர்புடைய தலைப்புகளில் விவாதங்களுடன் கருத்துப் பிரிவு இதைப் பற்றி விரிவடைகிறது.",
      "மேலும், சமகால சிபியுக்களுக்கும் இரண்டு தசாப்தங்களுக்கு முந்தையவற்றுக்கும் இடையிலான வேறுபாடுகள் குறித்து ஒரு ஒப்பீட்டு உரையாடல் தூண்டப்படுகிறது."
    ],
    "points": 203,
    "commentCount": 37,
    "retryCount": 0,
    "time": 1697992885
  },
  {
    "id": 37978118,
    "title": "மகத்தான ஆண் துறவு",
    "originLink": "https://en.wikipedia.org/wiki/Great_Male_Renunciation",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37978118",
    "commentBody": "",
    "originSummary": [
      "கிரேட் ஆண் துறவு என்பது 18 ஆம் நூற்றாண்டின் பிற்பகுதியில் மேற்கத்திய ஆண்களின் பாணியில் துடிப்பான வண்ணங்கள் மற்றும் அலங்கார வடிவமைப்புகளிலிருந்து எளிமை மற்றும் பயன்பாட்டிற்கு ஒரு வரலாற்று மாற்றமாகும்.",
      "1930 ஆம் ஆண்டில் ஜான் ஃப்ளூகல் என்பவரால் முதன்முதலில் அடையாளம் காணப்பட்ட இந்த மாற்றம், அறிவொளி இலட்சியங்கள், பிரெஞ்சுப் புரட்சி மற்றும் ஆண்களை பகுத்தறிவாளர்களாகவும், பெண்களை உணர்ச்சிவசப்படுபவர்களாகவும் சமூக கண்ணோட்டத்தால் குறிப்பாக பாதிக்கப்பட்டது.",
      "இந்த இயக்கம் 1960 களில் எதிர் கலாச்சார இயக்கம் வரை நீடித்து, உயர் குதிகால் மற்றும் இறுக்கமான ஆடைகளை கைவிட்டு, ஆண் ஆடைகளுக்கான தரமாக இருண்ட நிற ஆடைகள், பான்டலூன்கள் மற்றும் சூட்களை அமைத்தது."
    ],
    "commentSummary": [
      "இந்த கட்டுரை 19 ஆம் நூற்றாண்டில் துடிப்பான, சிக்கலான ஆடைகளிலிருந்து எளிய ஆடைகளுக்கு ஆண்களின் பாணியில் ஏற்பட்ட வரலாற்று மாற்றத்தை மதிப்பாய்வு செய்கிறது, மேலும் இது சமகால பாணி போக்குகளுடன் எவ்வாறு எதிரொலிக்கிறது.",
      "இது ஆடைத் தேர்வுகளில் கலாச்சார ஏற்றத்தாழ்வுகள், பல்வேறு நகரங்களில் உடைகளின் முக்கியத்துவம் மற்றும் ஃபேஷன், அதிகாரம் மற்றும் சமூக அந்தஸ்து ஆகியவற்றுக்கு இடையிலான தொடர்பை வலியுறுத்துகிறது.",
      "பங்கேற்பாளர்கள் பாணி வடிவங்கள் மற்றும் பிரத்தியேகமாக வசதி சார்ந்த ஒரு கலாச்சாரத்தை வளர்ப்பதற்கான சாத்தியக்கூறுகள் குறித்த தங்கள் கண்ணோட்டங்களைப் பகிர்ந்து கொள்கிறார்கள்."
    ],
    "points": 193,
    "commentCount": 119,
    "retryCount": 0,
    "time": 1698001513
  },
  {
    "id": 37977530,
    "title": "உலகளாவிய குறியாக்க நாள்: மனித உரிமைகளைப் பாதுகாப்பதில் குறியாக்கத்தின் முக்கிய பங்கு",
    "originLink": "https://blog.torproject.org/global-encryption-day-2023/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37977530",
    "commentBody": "",
    "originSummary": [
      "இன்று உலகளாவிய குறியாக்க நாள், இது உலகளாவிய குறியாக்க கூட்டணியால் ஒருங்கிணைக்கப்பட்ட ஒரு நிகழ்வாகும், இது டோர் திட்டத்தை அதன் உறுப்பினர்களிடையே கணக்கிடுகிறது. குறியாக்கத்தைப் பாதுகாக்கவும், அதை பலவீனப்படுத்தும் அரசாங்க முயற்சிகளை எதிர்க்கவும் அவர்கள் தங்கள் வேலையைப் பற்றி பிரதிபலிக்கிறார்கள்.",
      "டோர் திட்டம் சமீபத்தில் இணைய ஆளுமை மன்றத்தில் 'மனித உரிமைகளைப் பாதுகாப்பதில் குறியாக்கத்தின் முக்கிய பங்கு' என்ற தலைப்பில் ஒரு பட்டறையை நடத்தியது, இது சர்வதேச குழுப்பணி மற்றும் மனித உரிமைக் கொள்கைகளைக் கடைப்பிடிப்பதன் முக்கியத்துவத்தை அடிக்கோடிட்டுக் காட்டுகிறது.",
      "குறியாக்கம் மற்றும் உள்ளடக்க மிதப்படுத்தலில் கொள்கை வகுப்பாளர்களின் கல்வி, பயிற்சி மற்றும் திறனை மேம்படுத்துவதற்காக பேனலிஸ்ட்கள் வாதிட்டனர், இது தனியுரிமை-பாதுகாக்கும் தொழில்நுட்பங்களைப் பாதுகாப்பதற்கான நடவடிக்கைக்கான டோர் திட்டத்தின் அழைப்பை உறுதிப்படுத்தியது. பங்களிப்புகள் செய்வதன் மூலமோ அல்லது உறுப்பினர்களாக பதிவு செய்வதன் மூலமோ தங்கள் பணியை ஆதரிக்குமாறு அவர்கள் மக்களை அழைக்கிறார்கள்."
    ],
    "commentSummary": [
      "மனித உரிமைகளைப் பாதுகாப்பதில் குறியாக்கத்தின் முக்கியத்துவம், குறிப்பாக மின்னஞ்சல் போன்ற தகவல்தொடர்பு தளங்களுக்குள், அத்தகைய பாதுகாப்பு நடவடிக்கைகளின் பலம் மற்றும் பலவீனங்களைக் குறிப்பிடுவதே கட்டுரையின் மைய அடிப்படையாகும்.",
      "சிக்னல் போன்ற பாரம்பரிய தகவல்தொடர்பு தளங்களுக்கு மாற்று வழிகளை இந்த கட்டுரை பரிந்துரைக்கிறது, அதே நேரத்தில் வணிகம் மற்றும் சட்ட அமைப்புகளில் எண்ட்-டு-எண்ட் குறியாக்கத்தின் வரம்புகளையும் விவாதிக்கிறது, அத்துடன் டொமைன்-குறிப்பிட்ட நம்பிக்கை தரநிலைகள் இல்லாதது.",
      "தனியுரிமை மற்றும் பாதுகாப்பில் குறியாக்கத்தின் பங்கு குறித்த விவாதங்களை இந்த கட்டுரை எடுத்துக்காட்டுகிறது, அதன் தேவை மற்றும் சாத்தியமான தவறாகப் பயன்படுத்துவது குறித்த மாறுபட்ட கண்ணோட்டங்களைத் தொடுகிறது, அத்துடன் இந்த விவாதங்களில் அரசாங்கம் மற்றும் பெரிய தொழில்நுட்ப நிறுவனங்களின் பங்குகள்."
    ],
    "points": 182,
    "commentCount": 46,
    "retryCount": 0,
    "time": 1697997113
  },
  {
    "id": 37975090,
    "title": "திருமணமான பெற்றோரின் குழந்தைகள் சிறப்பாக செயல்படுகிறார்கள், ஆனால் அமெரிக்கா வேறு வழியில் நகர்கிறது",
    "originLink": "https://www.npr.org/2023/10/22/1207322878/single-parent-married-good-for-children-inequality",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37975090",
    "commentBody": "",
    "originSummary": [
      "தி டூ-பெற்றோர் பிரிவிலேஜ் என்ற தனது புத்தகத்தில், பொருளாதார வல்லுநர் மெலிசா கியர்னி, ஒற்றைத் தாய்மார்களுடன் ஒப்பிடும்போது, குழந்தைகளின் வெற்றிக்கும் திருமணமான பெற்றோரால் வளர்க்கப்படுவதற்கும் இடையிலான தொடர்பை ஆதரிக்கும் தரவுகளை முன்வைக்கிறார்.",
      "கியர்னியின் திருமணத்தை அங்கீகரிப்பது பல்வேறு எதிர்வினைகளை உருவாக்கியுள்ளது, பழமைவாதிகள் தங்கள் நம்பிக்கைகளை உறுதிப்படுத்துவதைக் கண்டறிந்துள்ளனர், அதே நேரத்தில் முற்போக்காளர்கள் இது ஒற்றைத் தாய்மார்களை களங்கப்படுத்துவதாகக் கருதுகின்றனர்.",
      "கூடுதலாக, கியர்னி ஒற்றைத் தாய்மார்களின் பொருளாதார கஷ்டங்கள் மற்றும் தந்தைகள் அல்லது பிற பெரியவர்களிடமிருந்து உதவி இல்லாதது, குறிப்பாக கல்விப் போராட்டங்கள் மற்றும் குற்றவியல் நீதி அமைப்புடன் சாத்தியமான தொடர்புகளுக்கு பங்களிப்பதன் மூலம் சிறுவர்களை பாதிக்கிறது."
    ],
    "commentSummary": [
      "குழந்தைகள் மீதான அதன் தாக்கங்கள், சமூக விதிமுறைகள், கலாச்சார மாறுபாடுகள், விவாகரத்துக்குப் பிந்தைய விளைவுகள் மற்றும் திருமண விகிதங்களைக் குறைத்தல் உள்ளிட்ட திருமணத்தின் பல கூறுகளை இந்த கட்டுரை ஆராய்கிறது.",
      "பாலின பாத்திரங்கள், வகுப்புவாத குழந்தை பராமரிப்பு, செல்வ ஏற்றத்தாழ்வு, ஒற்றைத் தாய்மார்களின் பொருளாதார தடைகள் மற்றும் திருமண முடிவுகளில் நிதி ஸ்திரத்தன்மையின் முக்கியத்துவம் போன்ற தலைப்புகள் விவாதிக்கப்படுகின்றன.",
      "இந்த சிக்கல்களை சமாளிக்கவும், நிலையான சமூகத்தை வளர்ப்பதற்கும் கூடுதல் ஆராய்ச்சி மற்றும் அணுகுமுறைகளின் அவசியத்தை இது அடிக்கோடிட்டுக் காட்டுகிறது."
    ],
    "points": 174,
    "commentCount": 286,
    "retryCount": 0,
    "time": 1697980610
  },
  {
    "id": 37975944,
    "title": "ஐரோப்பாவின் மிகப்பெரிய தாமிர உற்பத்தியாளர் $ 198 மில்லியன் மதிப்புள்ள உலோக மோசடிக்கு பலியானார்",
    "originLink": "https://fortune.com/2023/09/20/europe-largest-copper-producer-aurubis-victim-metal-heist-worth-198-million-insiders-involved/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37975944",
    "commentBody": "",
    "originSummary": [
      "ஐரோப்பாவின் மிகப் பெரிய தாமிர உற்பத்தியாளரான ஆருபிஸ் ஏஜி சுமார் 198 மில்லியன் டாலர் அளவிலான கணிசமான உலோகத் திருட்டைப் புகாரளித்துள்ளது.",
      "சரக்கு சோதனை மூலம் கண்டறியப்பட்ட இந்த திருட்டு, ஸ்கிராப் உலோக விலைப்பட்டியல்கள் மற்றும் கையாளப்பட்ட மாதிரிகள் மூலம் திட்டமிடப்பட்டதாக நம்பப்படுகிறது. சட்டவிரோத நடவடிக்கைகளில் ஈடுபடவில்லை என்று அந்நிறுவனம் திட்டவட்டமாக தெரிவித்துள்ளது.",
      "இன்சூரன்ஸ் செலுத்துதல் மற்றும் குற்றவாளிகளின் சொத்துக்களை பறிமுதல் செய்தல் ஆகியவற்றின் மூலம் இழப்புகள் ஓரளவு குறைக்கப்பட்டுள்ளன. ஜேர்மனியின் குற்றப்புலனாய்வு இராஜாங்க அலுவலகத்தினால் முன்னெடுக்கப்படும் தற்போதைய விசாரணைகள் உலோக வர்த்தகத் தொழிலில் உள்ள பாதிப்பு மற்றும் பாதுகாப்பு கவலைகளை அடிக்கோடிட்டுக் காட்டுகின்றன."
    ],
    "commentSummary": [
      "ஐரோப்பாவின் முன்னணி தாமிர உற்பத்தியாளர் கணிசமான சரக்கு பற்றாக்குறையை எதிர்கொண்டார், இது 198 மில்லியன் டாலர் மதிப்புள்ள உலோக ஊழலைத் தூண்டியது, இது உலோக சேமிப்புக் கிடங்கு துறையில் மோசடிக்கான சாத்தியத்தைக் குறிக்கிறது.",
      "இந்த சம்பவம் தற்போதைய அமைப்புகளில் பொறுப்புக்கூறல் குறைபாட்டை வலியுறுத்துகிறது, இது ஜேபி மோர்கன் போன்ற பெரிய நிறுவனங்களில் தவறான நடத்தை மற்றும் மோசடி பற்றிய விவாதங்களுக்கு வழிவகுக்கிறது.",
      "இந்த உரையாடலில் பணியிடங்களில் திருட்டு மற்றும் மோசடி மற்றும் ஊதிய ஏற்றத்தாழ்வு பற்றிய தலைப்புகளும் அடங்கும்."
    ],
    "points": 167,
    "commentCount": 70,
    "retryCount": 0,
    "time": 1697986917
  },
  {
    "id": 37974879,
    "title": "Bifrost: செருகக்கூடிய போக்குவரத்துகளைக் கொண்ட பியர்-டு-பியர் தகவல்தொடர்பு இயந்திரம்",
    "originLink": "https://github.com/aperturerobotics/bifrost",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37974879",
    "commentBody": "",
    "originSummary": [
      "பைஃப்ரோஸ்ட் என்பது ஒரு பன்முக பியர்-டு-பியர் தகவல்தொடர்பு இயந்திரமாகும், இது மல்டிபிளெக்சிங், குறியாக்கம் மற்றும் பிற நூலகங்களுடன் பொருந்தக்கூடிய தன்மை ஆகியவற்றைக் கொண்டுள்ளது, பல போக்குவரத்துகள், நெறிமுறைகள் மற்றும் ரூட்டிங் நுட்பங்களுக்கு இடமளிக்கிறது.",
      "பைஃப்ரோஸ்ட் சோதனை மற்றும் உருவகப்படுத்தலுக்கான கருவிகளுடன் வருகிறது. பயனர்கள் அதன் ஏபிஐ, கட்டளை-வரி இடைமுகம் மற்றும் டேமன் மூலம் அதனுடன் தொடர்பு கொள்ளலாம், சகாக்களை நிர்வகித்தல், ஸ்ட்ரீம்களை அனுப்புதல் மற்றும் பப்சப் சேனல்களுக்கு சந்தா செலுத்துதல் போன்ற செயல்பாடுகளை எளிதாக்குகிறது.",
      "சகாக்களுக்கு இடையில் இணைப்புகளை நிறுவுவதற்கும் நெட்வொர்க் போக்குவரத்தை நிர்வகிப்பதற்கும் பைஃப்ரோஸ்ட் அமைக்கப்படலாம், இது பரந்த அளவிலான நெட்வொர்க்கிங் பணிகளைக் கையாள்வதில் அதன் பயன்பாட்டை வலியுறுத்துகிறது."
    ],
    "commentSummary": [
      "பைஃப்ரோஸ்ட் என்பது குறிப்பிட்ட தகவல்தொடர்பு நெறிமுறைகளை ஒருங்கிணைக்க வேண்டிய அவசியத்தை நீக்குவதன் மூலம் இணைய பயன்பாட்டு வளர்ச்சியை எளிதாக்குவதை நோக்கமாகக் கொண்ட பியர்-டு-பியர் நெட்வொர்க்கிங் இயந்திரமாகும். பயன்பாடுகள் பரவலாக்கப்பட்ட அரட்டை அமைப்புகள் முதல் கோப்பு பகிர்வு மென்பொருள் வரை உள்ளன.",
      "ஆன்லைன் விவாதம் பிஃப்ரோஸ்டின் நோக்கம், இலக்கு பார்வையாளர்கள், டைனமிக் கூறு உள்ளமைவு மற்றும் லிப் 2 பி நூலகத்துடன் ஒருங்கிணைப்பு பற்றிய தெளிவின்மையை வெளிப்படுத்துகிறது - பியர்-டு-பியர் பயன்பாடுகளுக்கான நெறிமுறைகளின் குழு.",
      "கருத்து தெரிவிப்பவர்கள் பிளவுபட்டுள்ளனர்; சிலர் பிஃப்ரோஸ்ட்டை குழப்பமாகவும் சரியான ஆவணங்கள் இல்லாமலும் காண்கிறார்கள், மற்றவர்கள் தற்போதுள்ள தொழில்நுட்பங்களுக்கு ஒரு சாத்தியமான மாற்றாக இதைக் கருதுகின்றனர். ஜீரோ-காப்பி நெட்வொர்க்கிங் - தரவை மாற்றுவதற்கான ஒரு திறமையான வழி - மற்றும் தரவு வரிசையின் சிக்கல் ஆகியவை சர்ச்சைக்குரிய புள்ளிகள்."
    ],
    "points": 164,
    "commentCount": 53,
    "retryCount": 0,
    "time": 1697978697
  },
  {
    "id": 37977632,
    "title": "லூகாஸ்பிலிமின் வாழ்விடத்தின் படிப்பினைகள் (1990)",
    "originLink": "https://web.stanford.edu/class/history34q/readings/Virtual_Worlds/LucasfilmHabitat.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37977632",
    "commentBody": "",
    "originSummary": [
      "தொழில்நுட்ப அம்சங்களை விட பயனர் இடைவினைகள் மற்றும் நடத்தைகளில் கவனம் செலுத்தும் ஒரு முன்னோடி பெரிய அளவிலான பல-பயனர் மெய்நிகர் சூழலான லூகாஸ்ஃபில்மின் வாழ்விடத்தின் உருவாக்கத்தை இந்த கட்டுரை மதிப்பாய்வு செய்கிறது.",
      "இது ஹேபிடாட்டின் தொழில்நுட்ப கூறுகளை (அதன் கிராபிக்ஸ், அவதாரங்கள், பிராந்தியங்கள், பொருட்கள் மற்றும் விளையாட்டு பொருளாதாரம் போன்றவை), அதன் வளர்ச்சியில் எதிர்கொள்ளும் சவால்கள் மற்றும் வீரர்களின் நடவடிக்கைகளைக் கவனித்து ஆதரிப்பதன் முக்கியத்துவம் ஆகியவற்றை ஆராய்கிறது.",
      "உள்கட்டமைப்பு மட்டத்திற்கான பயனர் அணுகல் குறித்த எச்சரிக்கையை ஆசிரியர் வலியுறுத்துகிறார், பரவலாக்கப்பட்ட, பரிணாம அணுகுமுறையுடன் ஒரு பொருள் சார்ந்த உலக மாதிரியை ஊக்குவிக்கிறார், மேலும் சைபர்ஸ்பேஸின் வளர்ச்சியில் விவாதங்கள் மற்றும் தரநிலைகளின் அவசியத்தை அடிக்கோடிட்டுக் காட்டுகிறார்."
    ],
    "commentSummary": [
      "ஹேக்கர் நியூஸ் விவாதம் வீடியோ கேம் ஹாபிடாட் மற்றும் கேம் பாதுகாப்பின் கருப்பொருளில் கவனம் செலுத்துகிறது, அத்தகைய திட்டங்களின் நிலைத்தன்மை மற்றும் பாதுகாப்பு குறித்து சிந்திக்கிறது.",
      "தொழில்நுட்ப கலாச்சாரம் மற்றும் பொழுதுபோக்கின் குறுக்கீட்டை பிரதிபலிக்கும் \"ஹால்ட் அண்ட் கேட்ச் ஃபயர்\" என்ற தொலைக்காட்சி நிகழ்ச்சியில் விவரிப்பு தரம் மற்றும் பாத்திரப்படுத்தல் வரை விவாதங்கள் விரிவடைகின்றன.",
      "இந்த உரையாடல் மெய்நிகர் உலகங்களின் வரலாறு மற்றும் பரிணாமம், ஐ.ஆர்.சி (இன்டர்நெட் ரிலே அரட்டை) பல்வேறு தளங்களில் ஒருங்கிணைப்பு மற்றும் மல்டிபிளேயர் விளையாட்டுகளின் சிறந்த பண்புகள் ஆகியவற்றை ஆராய்கிறது."
    ],
    "points": 160,
    "commentCount": 65,
    "retryCount": 0,
    "time": 1697997925
  },
  {
    "id": 37975276,
    "title": "உபர் மைக்ரோ சேவைகளை Kubernetes மற்றும் Mesos இயங்கும் மல்டி-கிளவுட் இயங்குதளத்திற்கு மாற்றுகிறது",
    "originLink": "https://www.uber.com/en-GB/blog/up-portable-microservices-ready-for-the-cloud/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37975276",
    "commentBody": "",
    "originSummary": [
      "உபர் அதன் மைக்ரோ சேவைகளை நெறிப்படுத்துவதன் மூலமும் ஒருங்கிணைப்பதன் மூலமும், ஒற்றை, பெரிய பயன்பாட்டிலிருந்து சிறிய, ஒன்றோடொன்று இணைக்கப்பட்டவற்றுக்கு மாறுவதன் மூலமும் பணியமர்த்தல்கள், திறன் மேலாண்மை, இணக்கம் மற்றும் தினசரி செயல்பாடுகளை மேம்படுத்தியுள்ளது.",
      "'அப்' என்று அழைக்கப்படும் அதன் உள்நாட்டில் உருவாக்கப்பட்ட தளத்தைப் பயன்படுத்தி, உபெர் நாடற்ற சேவைகளை தானியக்கமாக்கியுள்ளது மற்றும் எந்தவொரு கிடைக்கும் மண்டலம் மற்றும் பொது கிளவுட் வழங்குநர்களுக்கும் அவற்றை எடுத்துச் செல்லக்கூடியதாக மாற்றியுள்ளது.",
      "இந்நிறுவனம், 'அப்' மூலம், 4,000க்கும் மேற்பட்ட சேவைகளை, கிளவுடுக்கு மாற்றியுள்ளது.இதன் விளைவாக, கணிசமான செலவு மிச்சமும், செயல்திறனும் கிடைத்துள்ளது. எதிர்கால திட்டங்களில் மேலும் கிளவுட் இடம்பெயர்வு, குறியீட்டு விநியோகத்தை தானியக்கமாக்குதல், பணியமர்த்தல் பாதுகாப்பை மேம்படுத்துதல் மற்றும் அனைத்து நாடற்ற சேவைகளையும் ஒரே தளத்தின் கீழ் ஒழுங்கமைத்தல் ஆகியவை அடங்கும்."
    ],
    "commentSummary": [
      "உபர் தனது மைக்ரோ சேவைகளை குபர்நெட் மற்றும் மெசோஸைப் பயன்படுத்தி மல்டி கிளவுட் இயங்குதளத்திற்கு மாற்றியுள்ளது, இது மேம்பட்ட போர்ட்டபிலிட்டியைக் கொண்டு வருகிறது.",
      "ஊபர் போன்ற உலகளாவிய நிறுவனத்தை இயக்குவதில் உள்ள சிக்கல்களுடன், மைக்ரோ சேவைகளைப் பயன்படுத்துவதன் சவால்கள் மற்றும் நன்மைகள் இந்த விவாதத்தில் அடங்கும். உள்நுழைதல், தடமறிதல் மற்றும் ஏபிஐ பதில்களைத் தட்டுதல் போன்ற தலைப்புகள் உள்ளடக்கப்பட்டுள்ளன.",
      "இந்த இடுகை பயனுள்ள தகவல்தொடர்பு மற்றும் ஒத்துழைப்பின் விமர்சனத்தையும் வலியுறுத்துகிறது மற்றும் ஊபரின் தொழில்நுட்ப அடுக்கின் எதிர்காலம் மற்றும் பயன்படுத்தப்படும் மைக்ரோ சேவைகளின் எண்ணிக்கை பற்றி ஊகிக்கிறது."
    ],
    "points": 156,
    "commentCount": 206,
    "retryCount": 0,
    "time": 1697982176
  },
  {
    "id": 37980323,
    "title": "ரிவியன் ஆர் 1 டி அமெரிக்காவில் மிக நீண்ட ஆஃப்-ரோடு போட்டியில் வென்ற முதல் ஈ.வி.",
    "originLink": "https://techcrunch.com/2023/10/22/rivian-r1t-is-the-first-ev-to-win-the-longest-off-road-competition-in-the-us/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37980323",
    "commentBody": "",
    "originSummary": [
      "எலக்ட்ரிக் வாகனமான ரிவியன் ஆர் 1 டி, அமெரிக்காவின் மிக நீண்ட ஆஃப்-ரோடு பந்தயமான ரெபெல்லி பேரணியில் வெற்றி பெற்ற முதல் ஈவி ஆனது.",
      "பேரணி, இப்போது அதன் எட்டாவது ஆண்டில், இரட்டை பாத்திரங்களுக்கு சேவை செய்கிறது: இது அனைத்து மகளிர் அணிகளுக்கும் ஒரு போட்டி, மற்றும் ரிவியனுக்கு ஒரு சோதனை படுக்கை, அங்கு அவர்கள் தங்கள் வாகன தொழில்நுட்பம் மற்றும் அம்சங்களை மேம்படுத்த விலைமதிப்பற்ற பங்கேற்பாளர் கருத்துக்களைப் பெறுகிறார்கள்.",
      "பேரணிக்காக தொலைதூர பகுதிகளில் ஈ.வி சார்ஜிங் உள்கட்டமைப்பை வழங்குவதற்கான ஒருங்கிணைந்த முயற்சியும் குறிப்பிடத்தக்கது, பாடத்திட்டம் முழுவதும் பசுமை ஹைட்ரஜன் சார்ஜர்களை வழங்க நிறுவனங்களுடன் கூட்டாண்மைகளை உள்ளடக்கியது."
    ],
    "commentSummary": [
      "எலக்ட்ரிக் வாகனமான ரிவியன் ஆர் 1 டி, அமெரிக்காவில் ஆஃப்-ரோடு போட்டிகளில் வெற்றி பெற்றது, இது மின்சார எஸ்யூவிகள் மற்றும் ஆஃப்-ரோடிங்கிற்கான டிரக்குகளின் நன்மைகள் மற்றும் வரம்புகள் குறித்த விவாதங்களைத் தூண்டியது.",
      "ரிவியன் ஆர் 1 டி போன்ற எலெக்ட்ரிக் வாகனங்களின் அதிக பழுதுபார்ப்பு செலவுகள் குறித்து கவலைகள் உள்ளன; இந்த விவாதங்கள் சாத்தியமான கண்டுபிடிப்புகள் மற்றும் பெண்கள் மட்டுமே இயங்கும் மின்சார வாகன போட்டியின் தோற்றம் ஆகியவற்றைத் தொடுகின்றன.",
      "டெஸ்லா வாகனங்களுக்கான தனிப்பயனாக்கல் விருப்பங்களில் ஒரு குறிப்பிட்ட கவனம் செலுத்துவதன் மூலம், புதிய கார் உற்சாகத்தின் தேவை மற்றும் பிரதான வாகனங்களில் பன்முகத்தன்மை இல்லாதது குறித்து கருத்துக்கள் பிரிக்கப்பட்டுள்ளன."
    ],
    "points": 154,
    "commentCount": 104,
    "retryCount": 0,
    "time": 1698021219
  },
  {
    "id": 37978060,
    "title": "அளவுகோலில் திறந்த டெலிமெட்ரி: வெடிக்கும் போக்குவரத்தை கையாள காஃப்காவைப் பயன்படுத்துதல்",
    "originLink": "https://signoz.io/blog/maximizing-scalability-apache-kafka-and-opentelemetry/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37978060",
    "commentBody": "",
    "originSummary": [
      "பயன்பாட்டு செயல்திறனைக் கண்காணிப்பதற்கும் கண்காணிப்பதற்கும் திறந்த மூல தளமான சிக்னோஸ் 6.5 மில்லியன் டாலர் நிதியைப் பெற்றுள்ளது.",
      "அளவிடக்கூடிய தன்மையை மேம்படுத்துவதற்கும், நெட்வொர்க் போக்குவரத்தைக் குறைப்பதற்கும், தரவு வடிகட்டலைச் செய்வதற்கும் பல ஓபன்டெலிமெட்ரி சேகரிப்பாளர்களைப் பயன்படுத்துவதன் நன்மையை நிறுவனம் அடிக்கோடிட்டுக் காட்டுகிறது.",
      "நிகழ்நேரத்தில் தரவைக் கையாளும் ஸ்ட்ரீமிங் தளமான அப்பாச்சி காஃப்காவைப் பயன்படுத்த சிக்னோஸ் பரிந்துரைக்கிறது, தரவு உட்செலுத்துதல் மற்றும் இடையகத்திற்கான நம்பகமான இடைத்தரகராக, இந்த உத்திகளை செயல்படுத்த YAML உள்ளமைவுகளை வழங்குகிறது."
    ],
    "commentSummary": [
      "டேட்டாடாக் மற்றும் நியூ ரெலிக் போன்ற நிறுவனங்கள் பெருமளவிலான போக்குவரத்தை நிர்வகிக்க காஃப்காவை எவ்வாறு பயன்படுத்துகின்றன என்பதை இந்த இடுகை ஆராய்கிறது.",
      "ஓபன்டெலிமெட்ரி கூறுகளில் விகித வரம்பு இல்லாத பிரச்சினையை இது விளக்குகிறது, இது சாத்தியமான பேக்எண்ட் சேமிப்பக சுமைக்கு வழிவகுக்கிறது. இந்த தாக்கத்தைத் தணிப்பதற்கான தீர்வாக கிராஃப்னா மெம்காச்டைப் பயன்படுத்துவது பரிந்துரைக்கப்படுகிறது.",
      "அளவிடுதல், செயல்திறன், செலவு, தரவு தக்கவைத்தல் மற்றும் போக்குவரத்து எழுச்சிகளைக் கையாளும் திறன் போன்ற காரணிகளைக் கருத்தில் கொண்டு, காஃப்காவை சரியாக ஒரு முறை செயலாக்கம் மற்றும் நிர்வகிப்பதற்கான பல்வேறு முறைகள் மற்றும் மாற்று வழிகள் ஆராயப்படுகின்றன."
    ],
    "points": 141,
    "commentCount": 40,
    "retryCount": 0,
    "time": 1698001108
  },
  {
    "id": 37977938,
    "title": "உங்கள் சொந்த பயமுறுத்தும் மேஜிக் கண் படங்களை எவ்வாறு தயாரிப்பது (ஆட்டோஸ்டெரியோகிராம்கள்)",
    "originLink": "https://blog.demofox.org/2023/10/22/how-to-make-your-own-spooky-magic-eye-pictures-autostereograms/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37977938",
    "commentBody": "",
    "originSummary": [
      "சி ++ குறியீட்டைப் பயன்படுத்தி ஆட்டோஸ்டெரியோகிராம் படங்களை உருவாக்குவதற்கான விரிவான வழிகாட்டியை வலைப்பதிவு இடுகை வழங்குகிறது, இதில் செயல்முறையை மேம்படுத்துவதற்கான விரிவான வழிமுறைகள் மற்றும் ஆலோசனைகள் அடங்கும்.",
      "3 டி விளைவைப் பெற வண்ணம் மற்றும் ஆழமான படங்களை எவ்வாறு இணைக்க முடியும் என்பதை இது கோடிட்டுக் காட்டுகிறது, இது விளையாட்டு வளர்ச்சியில் பயனுள்ளதாக இருக்கும்.",
      "மென்மையான சாய்வுகளை அடைவது போன்ற முக்கிய சவால்களை ஆசிரியர் அங்கீகரிக்கிறார், மேலும் சாத்தியமான தீர்வுகளைச் சுற்றி விவாதத்தை அழைக்கிறார். கருத்துரையாளர்கள் தங்கள் தனிப்பட்ட அனுபவங்கள் மற்றும் நுண்ணறிவுகளுடன் உரையாடலில் இணைகிறார்கள்."
    ],
    "commentSummary": [
      "விவாதம் ஆட்டோஸ்டெரியோகிராம்கள் அல்லது மேஜிக் ஐ படங்களைச் சுற்றி சுழல்கிறது, பயனர்கள் மறைக்கப்பட்ட 3 டி படங்களைக் காண அனுபவங்களையும் நுட்பங்களையும் பகிர்ந்து கொள்கிறார்கள்.",
      "உரையாடலின் சில தலைப்புகளில் படங்களைப் புரிந்துகொள்வதில் உள்ள சவால்கள் மற்றும் பிற 3 டி காட்சிப்படுத்தல் முறைகளுடன் ஒப்பீடுகள் ஆகியவை அடங்கும்.",
      "பங்கேற்பாளர்கள் ஸ்டீரியோகிராம்களை வீடியோ கேம்கள் மற்றும் மேஜிக் ஐ படங்கள் மற்றும் ஆடியோவில் ஸ்டீரியோ அகலப்படுத்துதல் போன்ற தொடர்புடைய பாடங்களில் ஒருங்கிணைப்பதற்கான திறனையும் ஆராய்கின்றனர்."
    ],
    "points": 136,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1698000210
  },
  {
    "id": 37980609,
    "title": "அமெரிக்காவில் வரலாறு காணாத அளவில் கொலைகள் குறைந்து வருகின்றன.",
    "originLink": "https://www.latimes.com/politics/newsletter/2023-10-20/killings-in-the-u-s-are-dropping-at-an-historic-rate-will-anyone-notice-essential-politics",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37980609",
    "commentBody": "",
    "originSummary": [
      "யு.எஸ். இல் கொலை விகிதங்கள் கணிசமாகக் குறைந்துவிட்டன, ஆனால் குறைவான அறிக்கையிடல் மற்றும் தொடர்ச்சியான குற்ற விவரிப்புகள் காரணமாக பொதுமக்களின் பார்வை பின்தங்கியுள்ளது.",
      "அச்சம் சார்ந்த அரசியல் இருந்தபோதிலும், வாக்காளர்கள் தடுப்பு மைய குற்ற உத்திகளை நோக்கி நகர்ந்து வருகின்றனர்.",
      "இந்த கட்டுரை கலிபோர்னியாவில் லபோன்சா பட்லரின் செனட் நியமனம் மற்றும் ஆடம் ஷிஃப், கேட்டி போர்ட்டர், பார்பரா லீ போன்ற நபர்களின் பல்வேறு நிதி திரட்டும் பிரச்சாரங்கள் மற்றும் கிறிஸ்டினா பாஸ்குச்சியின் செனட் முயற்சி உள்ளிட்ட பல அரசியல் நடவடிக்கைகளைப் பற்றி விவாதிக்கிறது."
    ],
    "commentSummary": [
      "இந்த கட்டுரை அமெரிக்க கொலை விகிதங்களில் குறைந்து வரும் போக்குக்கும் குற்றம் குறித்த பொதுமக்களின் கண்ணோட்டத்திற்கும் இடையிலான முரண்பாட்டை விவாதிக்கிறது, இந்த இணைப்பை விளக்க பல்வேறு கண்ணோட்டங்களை ஆராய்கிறது.",
      "பிற குற்ற வகைகளைப் பதிவு செய்தல் மற்றும் புகாரளித்தல், குறைந்த ஆக்ரோஷமான காவல்துறையின் தாக்கம், வன்முறைக் குற்றங்களைக் குறைப்பதற்கான வரலாற்று போக்குகள் மற்றும் இந்த கூறுகள் மக்களின் உணர்வுகளை எவ்வாறு வடிவமைக்கின்றன போன்ற காரணிகளை இது குறிப்பிடுகிறது.",
      "ஊடகங்களின் பங்கு, சியாட்டிலின் குற்ற விகிதத்திற்கும் பிற நகரங்களுக்கும் இடையிலான ஒப்பீடு, குற்றங்களில் ஜனாதிபதியின் செல்வாக்கு மற்றும் கூட்டு தண்டனை என்ற கருத்தாக்கம் ஆகியவை குற்றம் உணர்தலின் சிக்கல்களை சுட்டிக்காட்டும் பிற தலைப்புகளில் தொடப்பட்டன."
    ],
    "points": 125,
    "commentCount": 147,
    "retryCount": 0,
    "time": 1698024605
  }
]
