[
  {
    "id": 37976309,
    "title": "Quem lucra mais com o desconcertante sistema de saúde dos Estados Unidos?",
    "originLink": "https://www.economist.com/business/2023/10/08/who-profits-most-from-americas-baffling-health-care-system",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37976309",
    "commentBody": "",
    "originSummary": [
      "O sistema de saúde americano enfrenta dificuldades como a falta de pessoal e os altos custos.",
      "A complexidade do sistema não apenas beneficia imensamente alguns intermediários, mas também contribui significativamente para esses desafios, conforme ilustrado por eventos como a greve dos funcionários da Kaiser Permanente e as negociações de preços de medicamentos do Medicare.",
      "Apesar dos altos gastos com o sistema de saúde nos EUA, os resultados de saúde estão atrasados em comparação com outros países ricos."
    ],
    "commentSummary": [
      "O tópico de discussão abrange vários aspectos do sistema de saúde americano, com tópicos que abordam sua complexidade, ineficiência e altos custos.",
      "Entre os debates estão comparações entre o vício em drogas e em tabaco, a aplicação das regras da FDA, o processo de aprovação de leis nacionais e comparações entre os sistemas de saúde dos EUA e da Europa.",
      "Os participantes reconheceram que o sistema de saúde tem falhas significativas que precisam ser resolvidas, com opiniões diferentes sobre as soluções, incluindo reformas no sistema de saúde, impacto das regulamentações, falta de transparência nos preços e as funções das seguradoras, hospitais e empresas farmacêuticas."
    ],
    "points": 266,
    "commentCount": 375,
    "retryCount": 0,
    "time": 1697989182
  },
  {
    "id": 37978483,
    "title": "Nanoficha: armazenamento pequeno, para sempre",
    "originLink": "https://www.archmission.org/nanofiche",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37978483",
    "commentBody": "",
    "originSummary": [
      "A Arch Mission Foundation adotou o Nanofiche, um filme à base de níquel projetado pela Stamper Technology, para suas necessidades de arquivamento devido à sua durabilidade e eficiência em ambientes extremos como o espaço.",
      "A nanoficha pode sustentar grandes volumes de dados analógicos sem degradação, oferecendo mais durabilidade e eficiência de espaço do que sua antecessora, a microficha, que é sensível ao meio ambiente e exige uma manutenção cara.",
      "Além de sua robustez e tamanho compacto, a Nanofiche se distingue por sua alta resolução, recursos de segurança patenteados e uma vida útil que deve durar bilhões de anos se não for perturbada no espaço."
    ],
    "commentSummary": [
      "A discussão gira em torno de vários métodos de armazenamento e preservação de dados a longo prazo, incluindo, entre outros, texto analógico, codificação digital, discos ópticos de mídia de vidro, livros, tecnologia Nanofiche e tecnologia Silica da Microsoft.",
      "Há preocupações sobre a praticidade, o custo e a acessibilidade desses métodos de armazenamento, além de céticos que questionam sua viabilidade.",
      "A nova tecnologia de armazenamento que inclui padrões em nanoescala no metal, discos gravados microscopicamente e armazenamento fora da Terra, na Lua, é discutida, com questões sobre sua natureza proprietária, altos custos, legibilidade, durabilidade e viabilidade sendo levantadas."
    ],
    "points": 207,
    "commentCount": 119,
    "retryCount": 0,
    "time": 1698004203
  },
  {
    "id": 37977502,
    "title": "Guia para iniciantes sobre como criar um laboratório de hacking de hardware",
    "originLink": "https://voidstarsec.com/hw-hacking-lab/vss-lab-guide",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37977502",
    "commentBody": "",
    "originSummary": [
      "O guia mencionado oferece recomendações para a criação de um laboratório de sistemas incorporados, incluindo conteúdos como bancadas de trabalho, proteção contra ESD, equipamentos de solda, estações de ar quente e muito mais.",
      "O guia, que pode ser acessado por meio de um repositório do GitHub, é flexível para vários orçamentos e também incentiva as contribuições dos usuários para melhorias adicionais.",
      "Além da configuração básica do laboratório, ele também detalha as ferramentas para soldagem, osciloscópios, analisadores lógicos, além de utilitários especializados para injeção de falhas e avaliação de segurança de RF."
    ],
    "commentSummary": [
      "A publicação enfatiza a importância de montar um laboratório de hacking de hardware, com ferramentas de alta qualidade, como ferros de solda, microscópios e multímetros.",
      "A postagem aborda práticas de medição de tensão, técnicas de soldagem, prevenção de danos por eletricidade estática e discute os prós e contras da solda sem chumbo.",
      "Ele também inclui sugestões do autor sobre ferramentas e recursos essenciais para iniciantes em hacking de hardware."
    ],
    "points": 207,
    "commentCount": 81,
    "retryCount": 0,
    "time": 1697996863
  },
  {
    "id": 37976894,
    "title": "Como fazer uma CPU - uma explicação simples baseada em imagens",
    "originLink": "https://blog.robertelder.org/how-to-make-a-cpu/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37976894",
    "commentBody": "",
    "originSummary": [
      "O artigo oferece um guia simplificado para a criação de uma Unidade Central de Processamento (CPU) usando elementos básicos como pedras e areia; ele apresenta etapas que incluem a purificação do dióxido de silício, a criação de um monocristal de silício e a dopagem estratégica de pastilhas de silício.",
      "O autor reconhece a alta complexidade e a natureza proprietária da produção moderna de CPU, oferecendo mais recursos de pesquisa e esclarecendo os riscos associados ao uso de produtos químicos nesse processo.",
      "O artigo conclui questionando a viabilidade da produção amadora de chips e apresenta o conceito de produção de chips personalizados como um possível negócio de hobby."
    ],
    "commentSummary": [
      "O artigo destaca um processo detalhado, passo a passo, de construção de uma CPU, complementado com imagens ilustrativas.",
      "A seção de comentários expande isso com discussões sobre tópicos associados, como a obtenção dos recursos necessários para criar uma CPU.",
      "Além disso, é iniciado um diálogo comparativo sobre as distinções entre as CPUs atuais e as de duas décadas atrás."
    ],
    "points": 203,
    "commentCount": 37,
    "retryCount": 0,
    "time": 1697992885
  },
  {
    "id": 37978118,
    "title": "Grande renúncia masculina",
    "originLink": "https://en.wikipedia.org/wiki/Great_Male_Renunciation",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37978118",
    "commentBody": "",
    "originSummary": [
      "A Grande Renúncia Masculina foi uma mudança histórica na moda masculina ocidental durante o final do século 18, de cores vibrantes e designs ornamentados para simplicidade e utilidade.",
      "Essa mudança, identificada pela primeira vez por John Flügel em 1930, foi notavelmente influenciada pelos ideais do Iluminismo, pela Revolução Francesa e pela percepção social de que os homens são racionais e as mulheres são emocionais.",
      "O movimento estabeleceu roupas de cores escuras, calças e ternos como padrão para o vestuário masculino, abandonando saltos altos e calças justas, persistindo até o movimento de contracultura na década de 1960."
    ],
    "commentSummary": [
      "O artigo analisa a transição histórica da moda masculina, de roupas vibrantes e complexas para peças mais simples no século XIX, e como ela se relaciona com as tendências de estilo contemporâneas.",
      "Ele enfatiza as disparidades culturais na seleção de roupas, a importância dos ternos em diversas cidades e a associação entre moda, autoridade e posição social.",
      "Os participantes compartilham suas perspectivas sobre padrões de estilo e o potencial de promover uma cultura que não seja exclusivamente voltada para a riqueza."
    ],
    "points": 193,
    "commentCount": 119,
    "retryCount": 0,
    "time": 1698001513
  },
  {
    "id": 37977530,
    "title": "Dia Mundial da Criptografia: O papel fundamental da criptografia na proteção dos direitos humanos",
    "originLink": "https://blog.torproject.org/global-encryption-day-2023/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37977530",
    "commentBody": "",
    "originSummary": [
      "Hoje é o Dia Global da Criptografia, um evento coordenado pela Global Encryption Coalition, que conta com o Projeto Tor entre seus membros. Eles estão refletindo sobre seu trabalho para proteger a criptografia e resistir às tentativas do governo de enfraquecê-la.",
      "Recentemente, o Projeto Tor foi co-anfitrião de um workshop chamado 'Encryption's Critical Role in Safeguarding Human Rights' no Fórum de Governança da Internet, ressaltando a importância do trabalho em equipe internacional e a adesão aos princípios de direitos humanos.",
      "Os participantes do painel defenderam a educação, o treinamento e a capacitação dos formuladores de políticas em criptografia e moderação de conteúdo, consolidando o apelo à ação do Projeto Tor para proteger as tecnologias de preservação da privacidade. Eles estão convidando as pessoas a apoiar sua missão fazendo contribuições ou se inscrevendo como membros."
    ],
    "commentSummary": [
      "A premissa central do artigo é a importância da criptografia na proteção dos direitos humanos, especialmente em plataformas de comunicação como o e-mail, observando os pontos fortes e fracos de tais medidas de segurança.",
      "O artigo sugere alternativas às plataformas de comunicação tradicionais, como o Signal, ao mesmo tempo em que discute as limitações da criptografia de ponta a ponta em ambientes comerciais e jurídicos, juntamente com a ausência de padrões de confiança específicos do domínio.",
      "O artigo destaca os debates sobre a função da criptografia na privacidade e na segurança, abordando pontos de vista diferentes em relação à sua necessidade e possível uso indevido, bem como as funções do governo e das grandes empresas de tecnologia nessas discussões."
    ],
    "points": 182,
    "commentCount": 46,
    "retryCount": 0,
    "time": 1697997113
  },
  {
    "id": 37975090,
    "title": "Filhos de pais casados se saem melhor, mas os Estados Unidos estão se movendo na direção oposta",
    "originLink": "https://www.npr.org/2023/10/22/1207322878/single-parent-married-good-for-children-inequality",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37975090",
    "commentBody": "",
    "originSummary": [
      "Em seu livro, The Two-Parent Privilege (O privilégio de dois pais), a economista Melissa Kearney apresenta dados que sustentam a correlação entre o sucesso dos filhos e o fato de serem criados por pais casados, em comparação com mães solteiras.",
      "O fato de Kearney endossar o casamento gerou reações variadas, com os conservadores encontrando confirmação de suas crenças, enquanto os progressistas consideram isso uma estigmatização das mães solteiras.",
      "Além disso, Kearney destaca as dificuldades econômicas das mães solteiras e a ausência de assistência dos pais ou de outros adultos, o que afeta principalmente os meninos, contribuindo para dificuldades educacionais e possíveis interações com o sistema de justiça criminal."
    ],
    "commentSummary": [
      "O artigo explora vários componentes do casamento, inclusive suas implicações para os filhos, normas sociais, variações culturais, consequências do divórcio e queda nas taxas de casamento.",
      "São discutidos tópicos como papéis de gênero, cuidados infantis comuns, disparidade de riqueza, obstáculos econômicos das mães solteiras e a importância da estabilidade financeira nas decisões conjugais.",
      "Ele ressalta a necessidade de pesquisas e abordagens adicionais para lidar com essas questões e promover uma sociedade sustentável."
    ],
    "points": 174,
    "commentCount": 286,
    "retryCount": 0,
    "time": 1697980610
  },
  {
    "id": 37975944,
    "title": "A maior produtora de cobre da Europa é vítima de uma fraude de metal no valor de US$ 198 milhões",
    "originLink": "https://fortune.com/2023/09/20/europe-largest-copper-producer-aurubis-victim-metal-heist-worth-198-million-insiders-involved/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37975944",
    "commentBody": "",
    "originSummary": [
      "A Aurubis AG, a maior produtora de cobre da Europa, relatou um roubo substancial de metais no valor de aproximadamente US$ 198 milhões, levantando suspeitas de envolvimento de pessoas de dentro da empresa.",
      "Acredita-se que o roubo, detectado por meio de uma verificação de inventário, tenha sido orquestrado por meio de faturas de sucata infladas e amostras manipuladas. A empresa afirmou que não participou de nenhuma atividade ilícita.",
      "As perdas foram parcialmente mitigadas por meio do pagamento de seguros e da apreensão de bens dos criminosos. As investigações atuais em andamento pelo Escritório Estadual de Investigação Criminal da Alemanha ressaltam a vulnerabilidade e as preocupações com a segurança no setor de comércio de metais."
    ],
    "commentSummary": [
      "O principal produtor de cobre da Europa enfrentou uma escassez substancial de estoque, instigando uma fraude de metal avaliada em US$ 198 milhões, indicando o potencial de manipulação no setor de armazenamento de metais.",
      "Esse incidente enfatiza a deficiência da responsabilidade nos sistemas atuais, levando a discussões sobre má conduta e fraude em grandes organizações como o JPMorgan.",
      "O diálogo também inclui tópicos sobre roubo e desvio de dinheiro nos locais de trabalho e desigualdade salarial."
    ],
    "points": 167,
    "commentCount": 70,
    "retryCount": 0,
    "time": 1697986917
  },
  {
    "id": 37974879,
    "title": "Bifrost: Um mecanismo de comunicação ponto a ponto com transportes plugáveis",
    "originLink": "https://github.com/aperturerobotics/bifrost",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37974879",
    "commentBody": "",
    "originSummary": [
      "O Bifrost é um mecanismo de comunicação ponto a ponto multifacetado, com multiplexação, criptografia e compatibilidade com outras bibliotecas, acomodando vários transportes, protocolos e técnicas de roteamento.",
      "O Bifrost vem com ferramentas para teste e simulação. Os usuários podem interagir com ele por meio de sua API, interface de linha de comando e daemon, facilitando operações como gerenciamento de pares, encaminhamento de fluxos e assinatura de canais pubsub.",
      "O Bifrost pode ser configurado para estabelecer conexões entre pares e gerenciar o tráfego de rede, enfatizando sua utilidade para lidar com uma ampla gama de tarefas de rede."
    ],
    "commentSummary": [
      "O Bifrost é um mecanismo de rede ponto a ponto que visa simplificar o desenvolvimento de aplicativos da Internet, eliminando a necessidade de integrar protocolos de comunicação específicos. Os aplicativos variam de sistemas de bate-papo descentralizados a software de compartilhamento de arquivos.",
      "A discussão on-line revela uma falta de clareza sobre o objetivo do Bifrost, o público-alvo, a configuração dinâmica dos componentes e a integração com a biblioteca libp2p, um grupo de protocolos para aplicativos ponto a ponto.",
      "Os comentaristas estão divididos; alguns consideram o Bifrost confuso e sem documentação adequada, enquanto outros o veem como uma possível alternativa às tecnologias existentes. A rede de cópia zero - uma maneira eficiente de transferir dados - e a questão da fila de dados são pontos de discórdia."
    ],
    "points": 164,
    "commentCount": 53,
    "retryCount": 0,
    "time": 1697978697
  },
  {
    "id": 37977632,
    "title": "As lições do habitat da Lucasfilm (1990)",
    "originLink": "https://web.stanford.edu/class/history34q/readings/Virtual_Worlds/LucasfilmHabitat.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37977632",
    "commentBody": "",
    "originSummary": [
      "O artigo analisa a criação do Habitat da Lucasfilm, um ambiente virtual multiusuário pioneiro em larga escala, com foco nas interações e comportamentos do usuário mais do que em seus aspectos tecnológicos.",
      "Ele se aprofunda nos componentes técnicos do Habitat (como seus gráficos, avatares, regiões, objetos e economia no jogo), nos desafios enfrentados em seu desenvolvimento e na importância de observar e apoiar as ações dos jogadores.",
      "O autor enfatiza a cautela em relação ao acesso do usuário ao nível da infraestrutura, promove um modelo de mundo orientado a objetos juntamente com uma abordagem descentralizada e evolutiva e ressalta a necessidade de discussões e padrões no desenvolvimento do ciberespaço."
    ],
    "commentSummary": [
      "A discussão do Hacker News se concentra no Habitat dos videogames e no tema da preservação de jogos, contemplando a sustentabilidade e a conservação de tais projetos.",
      "Os debates se estendem à qualidade da narrativa e à caracterização do programa de TV \"Halt and Catch Fire\", refletindo a interseção da cultura tecnológica e do entretenimento.",
      "O diálogo aborda a história e a evolução dos mundos virtuais, a integração do IRC (Internet Relay Chat) em várias plataformas e os atributos ideais dos jogos multijogador."
    ],
    "points": 160,
    "commentCount": 65,
    "retryCount": 0,
    "time": 1697997925
  },
  {
    "id": 37975276,
    "title": "Uber migra microsserviços para uma plataforma multinuvem com Kubernetes e Mesos",
    "originLink": "https://www.uber.com/en-GB/blog/up-portable-microservices-ready-for-the-cloud/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37975276",
    "commentBody": "",
    "originSummary": [
      "A Uber melhorou as implementações, o gerenciamento de capacidade, a conformidade e as operações diárias ao simplificar e consolidar seus microsserviços, fazendo a transição de um aplicativo único e grande para aplicativos menores e interconectados.",
      "Usando sua plataforma desenvolvida internamente chamada 'Up', a Uber automatizou a implantação de serviços sem estado e os tornou portáteis em qualquer zona de disponibilidade e provedores de nuvem pública.",
      "A empresa migrou efetivamente mais de 4.000 serviços para a nuvem usando o 'Up', resultando em economia de custos e eficiência significativas. Os planos futuros incluem mais migração para a nuvem, automatização do fornecimento de código, aumento da segurança da implementação e organização de todos os serviços sem estado em uma única plataforma."
    ],
    "commentSummary": [
      "A Uber fez a transição de seus microsserviços para uma plataforma de várias nuvens utilizando Kubernetes e Mesos, o que trouxe maior portabilidade.",
      "A discussão inclui os desafios e as vantagens do uso de microsserviços, além das complexidades da operação de um empreendimento global como o Uber. Tópicos como registro, rastreamento e respostas de API de stubbing são abordados.",
      "A publicação também enfatiza a importância da comunicação e da colaboração eficazes e especula sobre o futuro da pilha de tecnologia da Uber e o número de microsserviços usados."
    ],
    "points": 156,
    "commentCount": 206,
    "retryCount": 0,
    "time": 1697982176
  },
  {
    "id": 37980323,
    "title": "O Rivian R1T é o primeiro veículo elétrico a vencer a mais longa competição off-road dos EUA",
    "originLink": "https://techcrunch.com/2023/10/22/rivian-r1t-is-the-first-ev-to-win-the-longest-off-road-competition-in-the-us/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37980323",
    "commentBody": "",
    "originSummary": [
      "O Rivian R1T, um veículo elétrico (EV), tornou-se o primeiro EV a conquistar a vitória no Rebelle Rally, a mais longa corrida off-road da América.",
      "O rali, agora em seu oitavo ano, tem duas funções: é uma competição para equipes exclusivamente femininas e um banco de testes para a Rivian, onde eles recebem feedback inestimável dos participantes para ajustar a tecnologia e os recursos de seus veículos.",
      "O esforço conjunto para fornecer infraestrutura de carregamento de veículos elétricos em áreas remotas para o rali também foi notável, envolvendo parcerias com empresas para fornecer carregadores de hidrogênio verde ao longo do percurso."
    ],
    "commentSummary": [
      "O Rivian R1T, um veículo elétrico, triunfou em competições off-road nos EUA, provocando debates sobre os méritos e as limitações dos SUVs e caminhões elétricos para off-road.",
      "Há preocupações com os altos custos de reparo de EVs, como o Rivian R1T; essas discussões abordam inovações em potencial e o surgimento de uma competição de veículos elétricos exclusiva para mulheres.",
      "As opiniões estão divididas sobre a necessidade de entusiasmo com relação a carros novos e a falta de variedade nos veículos convencionais, com foco especial nas opções de personalização disponíveis para os veículos da Tesla."
    ],
    "points": 154,
    "commentCount": 104,
    "retryCount": 0,
    "time": 1698021219
  },
  {
    "id": 37978060,
    "title": "OpenTelemetry em escala: Usando o Kafka para lidar com tráfego intenso",
    "originLink": "https://signoz.io/blog/maximizing-scalability-apache-kafka-and-opentelemetry/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37978060",
    "commentBody": "",
    "originSummary": [
      "A SigNoz, uma plataforma de código aberto para monitorar e acompanhar o desempenho de aplicativos, obteve um financiamento de US$ 6,5 milhões.",
      "A empresa destaca a vantagem de usar vários coletores OpenTelemetry para aumentar a escalabilidade, minimizar o tráfego de rede e realizar a filtragem de dados.",
      "A SigNoz também recomenda o uso do Apache Kafka, uma plataforma de streaming que lida com dados em tempo real, como um intermediário confiável para ingestão e armazenamento em buffer de dados, fornecendo configurações YAML para implementar essas estratégias."
    ],
    "commentSummary": [
      "A postagem explora como empresas como a Datadog e a New Relic utilizam o Kafka para gerenciar o tráfego volumoso de ingestão.",
      "Ele aborda a questão da ausência de um limitador de taxa nos componentes do OpenTelemetry, levando a uma possível sobrecarga do armazenamento de back-end. O uso do memcached pelo Grafana para armazenamento em cache é sugerido como uma solução para aliviar esse impacto.",
      "São examinadas várias metodologias e alternativas para obter o processamento semântico exatamente uma vez e gerenciar o Kafka, levando em conta fatores como escalabilidade, desempenho, custo, retenção de dados e a capacidade de lidar com picos de tráfego."
    ],
    "points": 141,
    "commentCount": 40,
    "retryCount": 0,
    "time": 1698001108
  },
  {
    "id": 37977938,
    "title": "Como criar suas próprias imagens assustadoras de olhos mágicos (autostereogramas)",
    "originLink": "https://blog.demofox.org/2023/10/22/how-to-make-your-own-spooky-magic-eye-pictures-autostereograms/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37977938",
    "commentBody": "",
    "originSummary": [
      "A postagem do blog oferece um guia abrangente sobre a criação de imagens de autostereograma usando código C++, incluindo instruções detalhadas e conselhos para otimizar o processo.",
      "Ele descreve como as imagens coloridas e de profundidade podem ser combinadas para obter um efeito 3D, potencialmente útil no desenvolvimento de jogos.",
      "O autor reconhece os principais desafios, como a obtenção de gradientes suaves, e convida à discussão sobre possíveis soluções. Os comentaristas participam da conversa com suas experiências e percepções pessoais."
    ],
    "commentSummary": [
      "A discussão gira em torno dos autostereogramas, ou imagens do Magic Eye, com usuários compartilhando experiências e técnicas para visualizar as imagens 3D ocultas.",
      "Alguns tópicos da conversa incluem desafios na percepção das imagens e comparações com outros métodos de visualização em 3D.",
      "Os participantes também exploram o potencial de integração de estereogramas em videogames e assuntos associados, como imagens do Magic Eye e amplificadores estéreo em áudio."
    ],
    "points": 136,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1698000210
  },
  {
    "id": 37980609,
    "title": "Os assassinatos nos EUA estão caindo a uma taxa histórica",
    "originLink": "https://www.latimes.com/politics/newsletter/2023-10-20/killings-in-the-u-s-are-dropping-at-an-historic-rate-will-anyone-notice-essential-politics",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37980609",
    "commentBody": "",
    "originSummary": [
      "As taxas de homicídios nos EUA diminuíram consideravelmente, mas a percepção do público está atrasada devido à subnotificação e às narrativas recorrentes de crimes.",
      "Apesar da política orientada pelo medo, os eleitores estão mudando para estratégias de prevenção ao crime centradas na prevenção.",
      "O artigo discute uma série de atividades políticas na Califórnia, incluindo a nomeação de Laphonza Butler para o Senado e várias campanhas de arrecadação de fundos de indivíduos como Adam Schiff, Katie Porter, Barbara Lee e uma candidatura ao Senado de Christina Pascucci."
    ],
    "commentSummary": [
      "O artigo discute a discrepância entre a tendência de queda nas taxas de homicídio dos EUA e a percepção do público sobre o crime, explorando várias perspectivas para explicar essa desconexão.",
      "Ele menciona fatores como o registro e a denúncia de outros tipos de crime, o impacto de um policiamento menos agressivo, tendências históricas de redução de crimes violentos e como esses elementos estão moldando as percepções das pessoas.",
      "O papel da mídia, a comparação entre a taxa de criminalidade de Seattle e de outras cidades, a influência do presidente sobre o crime e o conceito de punição coletiva estão entre outros tópicos abordados, sugerindo as complexidades da percepção do crime."
    ],
    "points": 125,
    "commentCount": 147,
    "retryCount": 0,
    "time": 1698024605
  }
]
