[
  {
    "id": 37976309,
    "title": "Vem tjänar mest på USA:s förvirrande hälsovårdssystem?",
    "originLink": "https://www.economist.com/business/2023/10/08/who-profits-most-from-americas-baffling-health-care-system",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37976309",
    "commentBody": "",
    "originSummary": [
      "Det amerikanska sjukvårdssystemet brottas med problem som personalbrist och höga kostnader.",
      "Systemets komplexitet ger inte bara ett fåtal mellanhänder stora vinster, utan bidrar också i hög grad till dessa utmaningar, vilket illustreras av händelser som strejken bland de anställda på Kaiser Permanente och Medicares förhandlingar om läkemedelspriser.",
      "Trots höga utgifter för hälso- och sjukvård i USA är hälsoresultaten enligt uppgift sämre än i andra rika länder."
    ],
    "commentSummary": [
      "Diskussionstråden omfattar olika aspekter av det amerikanska sjukvårdssystemet, med ämnen som berör dess komplexitet, ineffektivitet och höga kostnader.",
      "Bland debatterna finns jämförelser mellan drog- och tobaksberoende, tillämpningen av FDA:s regler, processen för att anta nationella lagar och jämförelser mellan amerikanska och europeiska sjukvårdssystem.",
      "Deltagarna medgav att hälso- och sjukvårdssystemet har betydande brister som behöver åtgärdas, med olika åsikter om lösningar, inklusive hälso- och sjukvårdsreformer, effekterna av regleringar, brist på pristransparens och försäkringsbolagens, sjukhusens och läkemedelsföretagens roller."
    ],
    "points": 266,
    "commentCount": 375,
    "retryCount": 0,
    "time": 1697989182
  },
  {
    "id": 37978483,
    "title": "Nanofiche: Liten lagring, för evigt",
    "originLink": "https://www.archmission.org/nanofiche",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37978483",
    "commentBody": "",
    "originSummary": [
      "Arch Mission Foundation har valt Nanofiche, en nickelbaserad film som utvecklats av Stamper Technology, för sina arkiveringsbehov på grund av dess hållbarhet och effektivitet i extrema miljöer som rymden.",
      "Nanofiche kan lagra stora mängder analoga data utan nedbrytning, vilket ger bättre hållbarhet och utrymmeseffektivitet än föregångaren mikrofiche, som är miljökänslig och kräver kostsamt underhåll.",
      "Förutom sin robusthet och kompakta storlek utmärker sig Nanofiche genom sin höga upplösning, patenterade säkerhetsfunktioner och en livslängd som förväntas sträcka sig över miljarder år om den inte störs i rymden."
    ],
    "commentSummary": [
      "Diskussionen kretsar kring olika metoder för långtidslagring och bevarande av data, inklusive men inte begränsat till analog text, digital kodning, optiska skivor av glasmedia, böcker, Nanofiche-teknik och Microsofts Silica-teknik.",
      "Det finns farhågor om hur praktiska, kostsamma och lättillgängliga dessa lagringsmetoder är, och det finns skeptiker som ifrågasätter deras genomförbarhet.",
      "Ny lagringsteknik som omfattar nanoskaliga mönster på metall, mikroskopiskt graverade skivor och lagring utanför jorden på månen diskuteras, med frågor om deras proprietära natur, höga kostnader, läsbarhet, hållbarhet och genomförbarhet som tas upp."
    ],
    "points": 207,
    "commentCount": 119,
    "retryCount": 0,
    "time": 1698004203
  },
  {
    "id": 37977502,
    "title": "Nybörjarguide för att bygga ett hackningslabb för hårdvara",
    "originLink": "https://voidstarsec.com/hw-hacking-lab/vss-lab-guide",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37977502",
    "commentBody": "",
    "originSummary": [
      "Den nämnda guiden ger rekommendationer för att skapa ett labb för inbyggda system, inklusive innehåll som arbetsbänkar, ESD-skydd, lödutrustning, varmluftsstationer och mer.",
      "Guiden, som är tillgänglig via ett GitHub-arkiv, är flexibel för olika budgetar och uppmuntrar också användarna att bidra till ytterligare förbättringar.",
      "Förutom grundläggande laboratorieinställningar innehåller den även information om verktyg för lödning, oscilloskop, logikanalysatorer samt specialverktyg för felinjicering och bedömning av RF-säkerhet."
    ],
    "commentSummary": [
      "Inlägget betonar vikten av att skapa ett hackinglabb för hårdvara, med högkvalitativa verktyg som lödkolvar, mikroskop och multimetrar.",
      "Inlägget behandlar metoder för att mäta spänning, lödtekniker, förebyggande av skador orsakade av statisk elektricitet och diskuterar för- och nackdelar med blyfri lödning.",
      "Den innehåller också författarens förslag på viktiga verktyg och resurser för nybörjare inom hårdvaruhackning."
    ],
    "points": 207,
    "commentCount": 81,
    "retryCount": 0,
    "time": 1697996863
  },
  {
    "id": 37976894,
    "title": "Hur man tillverkar en CPU - en enkel bildbaserad förklaring",
    "originLink": "https://blog.robertelder.org/how-to-make-a-cpu/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37976894",
    "commentBody": "",
    "originSummary": [
      "Artikeln innehåller en förenklad guide till hur man skapar en CPU (Central Processing Unit) med hjälp av grundämnen som stenar och sand; den beskriver steg som att rena kiseldioxid, skapa en kiselmonokristall och strategiskt dopa kiselplattor.",
      "Författaren erkänner den höga komplexiteten och äganderätten i modern CPU-produktion, erbjuder ytterligare forskningsresurser och belyser de risker som är förknippade med kemikalieanvändning i denna process.",
      "Artikeln avslutas med ett ifrågasättande av om amatörchipproduktion är genomförbar och introducerar konceptet med specialchipproduktion som en potentiell hobbyverksamhet."
    ],
    "commentSummary": [
      "I artikeln beskrivs steg för steg hur man konstruerar en CPU, med hjälp av illustrativa bilder.",
      "Kommentarsektionen utökar detta med diskussioner om relaterade ämnen som att skaffa nödvändiga resurser för att bygga en CPU.",
      "Dessutom inleds en jämförande dialog om skillnaderna mellan dagens processorer och de som tillverkades för två decennier sedan."
    ],
    "points": 203,
    "commentCount": 37,
    "retryCount": 0,
    "time": 1697992885
  },
  {
    "id": 37978118,
    "title": "Stor manlig försakelse",
    "originLink": "https://en.wikipedia.org/wiki/Great_Male_Renunciation",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37978118",
    "commentBody": "",
    "originSummary": [
      "Den stora manliga försakelsen var en historisk förändring i västerländskt herrmode under slutet av 1700-talet från livfulla färger och utsmyckade mönster till enkelhet och användbarhet.",
      "Denna förändring, som först identifierades av John Flügel 1930, påverkades framför allt av upplysningstidens ideal, den franska revolutionen och samhällets syn på män som rationella och kvinnor som känslomässiga.",
      "Rörelsen satte mörkfärgade kläder, pantalonger och kostymer som standard för manlig klädsel och övergav höga klackar och tajta byxor, vilket kvarstod fram till motkulturrörelsen på 1960-talet."
    ],
    "commentSummary": [
      "I artikeln beskrivs den historiska övergången i herrmodet från livfulla, komplexa kläder till enklare plagg under 1800-talet, och hur den resonerar med dagens modetrender.",
      "Den betonar kulturella skillnader i klädval, betydelsen av kostymer i olika städer och sambandet mellan mode, auktoritet och samhällelig status.",
      "Deltagarna delar med sig av sina perspektiv på stilmönster och möjligheterna att främja en kultur som inte enbart är inriktad på överflöd."
    ],
    "points": 193,
    "commentCount": 119,
    "retryCount": 0,
    "time": 1698001513
  },
  {
    "id": 37977530,
    "title": "Globala krypteringsdagen: Krypteringens kritiska roll i skyddet av mänskliga rättigheter",
    "originLink": "https://blog.torproject.org/global-encryption-day-2023/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37977530",
    "commentBody": "",
    "originSummary": [
      "Idag är det Global Encryption Day, ett evenemang som samordnas av Global Encryption Coalition, som räknar Tor Project bland sina medlemmar. De reflekterar över sitt arbete för att skydda kryptering och motstå statliga försök att försvaga den.",
      "Tor Project var nyligen medarrangör till en workshop med titeln \"Encryption's Critical Role in Safeguarding Human Rights\" vid Internet Governance Forum, där man betonade vikten av internationellt lagarbete och efterlevnad av principerna om mänskliga rättigheter.",
      "Paneldeltagarna förespråkade utbildning och kompetenshöjning av beslutsfattare inom kryptering och innehållsmoderering, vilket cementerar Tor Projects uppmaning till handling för att skydda integritetsbevarande teknik. De uppmanar människor att stödja deras uppdrag antingen genom att ge bidrag eller registrera sig som medlemmar."
    ],
    "commentSummary": [
      "Den centrala utgångspunkten i artikeln är vikten av kryptering för att skydda mänskliga rättigheter, särskilt inom kommunikationsplattformar som e-post, och noterar styrkorna och svagheterna hos sådana säkerhetsåtgärder.",
      "I artikeln föreslås alternativ till traditionella kommunikationsplattformar, som Signal, samtidigt som man diskuterar begränsningarna med end-to-end-kryptering i affärs- och juridiska sammanhang, i kombination med avsaknaden av domänspecifika förtroendestandarder.",
      "Artikeln belyser debatten om krypteringens roll för integritet och säkerhet, och tar upp olika synsätt på dess nödvändighet och eventuella missbruk, samt myndigheternas och de stora teknikföretagens roller i dessa diskussioner."
    ],
    "points": 182,
    "commentCount": 46,
    "retryCount": 0,
    "time": 1697997113
  },
  {
    "id": 37975090,
    "title": "Barn till gifta föräldrar klarar sig bättre, men utvecklingen i USA går åt andra hållet",
    "originLink": "https://www.npr.org/2023/10/22/1207322878/single-parent-married-good-for-children-inequality",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37975090",
    "commentBody": "",
    "originSummary": [
      "I sin bok The Two-Parent Privilege presenterar ekonomen Melissa Kearney data som stöder sambandet mellan barns framgång och att de uppfostras av gifta föräldrar, jämfört med ensamstående mödrar.",
      "Kearneys stöd för äktenskap har väckt olika reaktioner, där konservativa ser en bekräftelse på sin övertygelse, medan progressiva ser det som en stigmatisering av ensamstående mödrar.",
      "Dessutom pekar Kearney på de ekonomiska svårigheterna för ensamstående mödrar och avsaknaden av stöd från fäder eller andra vuxna, vilket särskilt påverkar pojkar genom att bidra till utbildningsproblem och potentiella kontakter med det straffrättsliga systemet."
    ],
    "commentSummary": [
      "Artikeln utforskar flera komponenter i äktenskapet, inklusive dess konsekvenser för barn, samhällsnormer, kulturella variationer, skilsmässa efteråt och sjunkande äktenskapstal.",
      "Ämnen som könsroller, gemensam barnomsorg, förmögenhetsskillnader, ensamstående mödrars ekonomiska hinder och betydelsen av finansiell stabilitet i äktenskapliga beslut diskuteras.",
      "Det understryker behovet av ytterligare forskning och metoder för att ta itu med dessa frågor och främja ett hållbart samhälle."
    ],
    "points": 174,
    "commentCount": 286,
    "retryCount": 0,
    "time": 1697980610
  },
  {
    "id": 37975944,
    "title": "Europas största kopparproducent har utsatts för metallsvindel värd 198 miljoner USD",
    "originLink": "https://fortune.com/2023/09/20/europe-largest-copper-producer-aurubis-victim-metal-heist-worth-198-million-insiders-involved/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37975944",
    "commentBody": "",
    "originSummary": [
      "Aurubis AG, Europas största kopparproducent, har rapporterat en omfattande metallstöld på cirka 198 miljoner dollar, vilket väcker misstankar om insiderinblandning.",
      "Stölden, som upptäcktes genom en inventeringskontroll, tros ha iscensatts genom uppblåsta skrotfakturor och manipulerade prover. Företaget har försäkrat att det inte deltagit i några olagliga aktiviteter.",
      "Förlusterna har delvis begränsats genom försäkringsutbetalningar och beslagtagande av brottslingarnas tillgångar. De utredningar som för närvarande genomförs av den tyska kriminalpolisen understryker sårbarheten och säkerhetsproblemen inom metallhandelsbranschen."
    ],
    "commentSummary": [
      "Europas ledande kopparproducent drabbades av en betydande lagerbrist, vilket ledde till en metallsvindel värd 198 miljoner dollar, vilket visar på potentialen för manipulation inom sektorn för metallager.",
      "Denna händelse understryker bristen på ansvarsskyldighet i nuvarande system, vilket leder till diskussioner om oegentligheter och bedrägerier i stora organisationer som JPMorgan.",
      "Dialogen innehåller också ämnen om stöld och förskingring på arbetsplatser och löneskillnader."
    ],
    "points": 167,
    "commentCount": 70,
    "retryCount": 0,
    "time": 1697986917
  },
  {
    "id": 37974879,
    "title": "Bifrost: En peer-to-peer-kommunikationsmotor med pluggbara transporter",
    "originLink": "https://github.com/aperturerobotics/bifrost",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37974879",
    "commentBody": "",
    "originSummary": [
      "Bifrost är en mångfacetterad peer-to-peer-kommunikationsmotor med multiplexering, kryptering och kompatibilitet med andra bibliotek, som kan hantera många olika transportsätt, protokoll och routningstekniker.",
      "Bifrost levereras med verktyg för testning och simulering. Användare kan interagera med den via dess API, kommandoradsgränssnitt och daemon, vilket underlättar operationer som att hantera peers, vidarebefordra strömmar och prenumerera på pubsub-kanaler.",
      "Bifrost kan konfigureras för att upprätta anslutningar mellan peers och hantera nätverkstrafik, vilket understryker dess användbarhet för att hantera ett brett spektrum av nätverksuppgifter."
    ],
    "commentSummary": [
      "Bifrost är en peer-to-peer-nätverksmotor som syftar till att förenkla utvecklingen av internetapplikationer genom att ta bort behovet av att integrera specifika kommunikationsprotokoll. Applikationerna sträcker sig från decentraliserade chattsystem till fildelningsprogram.",
      "Diskussionen på nätet visar att det råder oklarhet om Bifrosts syfte, målgrupp, dynamiska komponentkonfiguration och integration med libp2p-biblioteket - en grupp protokoll för peer-to-peer-tillämpningar.",
      "Kommentatorerna är splittrade; vissa anser att Bifrost är förvirrande och saknar ordentlig dokumentation, medan andra ser det som ett potentiellt alternativ till befintlig teknik. Zero-copy networking - ett effektivt sätt att överföra data - och frågan om dataköer är kontroversiella frågor."
    ],
    "points": 164,
    "commentCount": 53,
    "retryCount": 0,
    "time": 1697978697
  },
  {
    "id": 37977632,
    "title": "Lärdomarna från Lucasfilms Habitat (1990)",
    "originLink": "https://web.stanford.edu/class/history34q/readings/Virtual_Worlds/LucasfilmHabitat.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37977632",
    "commentBody": "",
    "originSummary": [
      "I artikeln granskas skapandet av Lucasfilms Habitat, en banbrytande storskalig virtuell miljö för flera användare, med fokus på användarinteraktioner och beteenden mer än dess tekniska aspekter.",
      "Den fördjupar sig i de tekniska komponenterna i Habitat (såsom dess grafik, avatarer, regioner, objekt och ekonomi i spelet), de utmaningar som man ställdes inför vid utvecklingen och vikten av att observera och stödja spelarnas handlingar.",
      "Författaren betonar försiktighet när det gäller användarnas tillgång till infrastrukturnivå, främjar en objektorienterad världsmodell tillsammans med ett decentraliserat, evolutionärt tillvägagångssätt och understryker behovet av diskussioner och standarder vid utvecklingen av cyberspace."
    ],
    "commentSummary": [
      "Diskussionen på Hacker News fokuserar på videospelet Habitat och temat spelbevarande, och funderar över hållbarheten och bevarandet av sådana projekt.",
      "Diskussionerna sträcker sig till den narrativa kvaliteten och karaktäriseringen i TV-serien \"Halt and Catch Fire\", vilket återspeglar skärningspunkten mellan teknisk kultur och underhållning.",
      "Dialogen handlar om de virtuella världarnas historia och utveckling, IRC (Internet Relay Chat) integration i olika plattformar och de ideala egenskaperna hos multiplayer-spel."
    ],
    "points": 160,
    "commentCount": 65,
    "retryCount": 0,
    "time": 1697997925
  },
  {
    "id": 37975276,
    "title": "Uber migrerar mikrotjänster till en plattform med flera moln som kör Kubernetes och Mesos",
    "originLink": "https://www.uber.com/en-GB/blog/up-portable-microservices-ready-for-the-cloud/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37975276",
    "commentBody": "",
    "originSummary": [
      "Uber har förbättrat driftsättningar, kapacitetshantering, efterlevnad och daglig drift genom att effektivisera och konsolidera sina mikrotjänster och övergå från en enda, stor applikation till mindre, sammankopplade applikationer.",
      "Med hjälp av sin egenutvecklade plattform \"Up\" har Uber automatiserat distributionen av statslösa tjänster och gjort dem portabla över alla tillgänglighetszoner och offentliga molnleverantörer.",
      "Företaget har effektivt migrerat över 4.000 tjänster till molnet med hjälp av \"Up\", vilket har resulterat i betydande kostnadsbesparingar och effektivitet. Framtidsplanerna omfattar ytterligare molnmigrering, automatisering av kodleverans, förbättrad driftsättningssäkerhet och organisering av alla statslösa tjänster under en enda plattform."
    ],
    "commentSummary": [
      "Uber har flyttat sina mikrotjänster till en multi-cloud-plattform med hjälp av Kubernetes och Mesos, vilket ger ökad portabilitet.",
      "Diskussionen omfattar utmaningarna och fördelarna med att använda mikrotjänster, tillsammans med komplexiteten i att driva ett globalt företag som Uber. Ämnen som loggning, spårning och stubbing av API-svar behandlas.",
      "Inlägget betonar också vikten av effektiv kommunikation och samarbete och spekulerar om framtiden för Ubers teknikstack och antalet mikrotjänster som används."
    ],
    "points": 156,
    "commentCount": 206,
    "retryCount": 0,
    "time": 1697982176
  },
  {
    "id": 37980323,
    "title": "Rivian R1T är den första elbilen som vunnit den längsta offroad-tävlingen i USA",
    "originLink": "https://techcrunch.com/2023/10/22/rivian-r1t-is-the-first-ev-to-win-the-longest-off-road-competition-in-the-us/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37980323",
    "commentBody": "",
    "originSummary": [
      "Rivian R1T, en elbil (EV), blev den första elbilen som tog hem segern i Rebelle Rally, USA:s längsta terränglopp.",
      "Rallyt, som nu är inne på sitt åttonde år, har dubbla funktioner: det är en tävling för kvinnliga team och en testbädd för Rivian, där de får ovärderlig feedback från deltagarna för att finjustera sin fordonsteknik och sina funktioner.",
      "Den samlade insatsen för att tillhandahålla infrastruktur för laddning av elbilar i avlägsna områden för rallyt var också anmärkningsvärd, och omfattade partnerskap med företag för att tillhandahålla gröna vätgasladdare längs hela banan."
    ],
    "commentSummary": [
      "Rivian R1T, ett eldrivet fordon, segrade i terrängtävlingar i USA och väckte debatt om fördelarna och begränsningarna med eldrivna SUV:ar och lastbilar för terrängkörning.",
      "Det finns farhågor om höga reparationskostnader för elbilar som Rivian R1T; dessa diskussioner berör potentiella innovationer och uppkomsten av en elbilstävling för enbart kvinnor.",
      "Åsikterna går isär om behovet av nya spännande bilar och bristen på variation i vanliga fordon, med särskilt fokus på de anpassningsalternativ som finns för Tesla-fordon."
    ],
    "points": 154,
    "commentCount": 104,
    "retryCount": 0,
    "time": 1698021219
  },
  {
    "id": 37978060,
    "title": "OpenTelemetry i stor skala: Använda Kafka för att hantera kraftig trafik",
    "originLink": "https://signoz.io/blog/maximizing-scalability-apache-kafka-and-opentelemetry/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37978060",
    "commentBody": "",
    "originSummary": [
      "SigNoz, en open source-plattform för övervakning och spårning av applikationsprestanda, har säkrat 6,5 miljoner dollar i finansiering.",
      "Företaget understryker fördelen med att använda flera OpenTelemetry-insamlare för att förbättra skalbarheten, minimera nätverkstrafiken och utföra datafiltrering.",
      "SigNoz rekommenderar också att Apache Kafka, en streamingplattform som hanterar data i realtid, används som en pålitlig mellanhand för datainmatning och buffring, och tillhandahåller YAML-konfigurationer för att implementera dessa strategier."
    ],
    "commentSummary": [
      "Inlägget utforskar hur företag som Datadog och New Relic använder Kafka för att hantera omfattande ingest-trafik.",
      "Den behandlar frågan om avsaknaden av en hastighetsbegränsare i OpenTelemetry-komponenter, vilket leder till potentiell överbelastning av backend-lagringen. Grafanas användning av memcached för cachelagring föreslås som en lösning för att lindra denna påverkan.",
      "Olika metoder och alternativ för att uppnå exakt samtidig semantisk bearbetning och hantera Kafka undersöks, med hänsyn till faktorer som skalbarhet, prestanda, kostnad, datalagring och förmågan att hantera trafikökningar."
    ],
    "points": 141,
    "commentCount": 40,
    "retryCount": 0,
    "time": 1698001108
  },
  {
    "id": 37977938,
    "title": "Så gör du dina egna spöklika magiska ögonbilder (autostereogram)",
    "originLink": "https://blog.demofox.org/2023/10/22/how-to-make-your-own-spooky-magic-eye-pictures-autostereograms/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37977938",
    "commentBody": "",
    "originSummary": [
      "Blogginlägget innehåller en omfattande guide till hur man skapar autostereogrambilder med C++-kod, inklusive detaljerade instruktioner och råd om hur man optimerar processen.",
      "Den beskriver hur färg- och djupbilder kan kombineras för att få en 3D-effekt, vilket kan vara användbart vid spelutveckling.",
      "Författaren identifierar viktiga utmaningar, såsom att uppnå jämna gradienter, och inbjuder till diskussion kring möjliga lösningar. Kommentatorer deltar i samtalet med sina personliga erfarenheter och insikter."
    ],
    "commentSummary": [
      "Diskussionen kretsar kring autostereogram, eller Magic Eye-bilder, där användare delar med sig av erfarenheter och tekniker för att se de dolda 3D-bilderna.",
      "Några av samtalsämnena är utmaningar med att uppfatta bilderna och jämförelser med andra 3D-visualiseringsmetoder.",
      "Deltagarna undersöker också möjligheten att integrera stereogram i videospel och tillhörande ämnen som Magic Eye-bilder och stereobreddare i ljud."
    ],
    "points": 136,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1698000210
  },
  {
    "id": 37980609,
    "title": "Antalet mord i USA sjunker i en historisk takt",
    "originLink": "https://www.latimes.com/politics/newsletter/2023-10-20/killings-in-the-u-s-are-dropping-at-an-historic-rate-will-anyone-notice-essential-politics",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37980609",
    "commentBody": "",
    "originSummary": [
      "Mordfrekvensen i USA har minskat markant, men allmänhetens uppfattning släpar efter på grund av underrapportering och återkommande brottsberättelser.",
      "Trots en politik som drivs av rädsla går väljarna över till brottsförebyggande strategier.",
      "I artikeln diskuteras en rad politiska aktiviteter i Kalifornien, inklusive Laphonza Butlers utnämning till senaten och olika insamlingskampanjer av personer som Adam Schiff, Katie Porter, Barbara Lee och Christina Pascuccis kandidatur till senaten."
    ],
    "commentSummary": [
      "I artikeln diskuteras skillnaden mellan den nedåtgående trenden i USA:s mordfrekvens och allmänhetens uppfattning om brott, och olika perspektiv undersöks för att förklara denna skillnad.",
      "Där nämns faktorer som registrering och rapportering av andra brottstyper, effekterna av mindre aggressivt polisarbete, historiska trender med minskad våldsbrottslighet och hur dessa faktorer påverkar människors uppfattningar.",
      "Mediernas roll, jämförelser mellan Seattles brottsfrekvens och andra städer, presidentens inflytande på brottsligheten och begreppet kollektiv bestraffning är några av de ämnen som berörs, vilket ger en antydan om komplexiteten i brottsuppfattningen."
    ],
    "points": 125,
    "commentCount": 147,
    "retryCount": 0,
    "time": 1698024605
  }
]
