[
  {
    "id": 41713063,
    "title": "COBOL est « mort » depuis si longtemps que mon grand-père en a écrit à son sujet",
    "originLink": "https://wumpus-cave.net/post/2024/10/2024-10-01-death-of-cobol/index.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41713063",
    "commentBody": "",
    "originSummary": [
      "Malgré avoir été déclaré « mort » en 1992, Cobol a persisté et survécu à de nombreux langages de programmation de quatrième génération (4GL), démontrant sa résilience et sa pertinence continue.",
      "Le problème de l'an 2000 a joué un rôle significatif dans la relance de Cobol en créant une demande pour des programmeurs familiers avec le langage, soulignant son importance dans les systèmes hérités.",
      "« Le récit suggère de faire preuve de prudence en qualifiant les langages de programmation de \"morts\", en particulier ceux qui ont une base d'utilisateurs substantielle, car ils peuvent continuer à avoir des applications pratiques et une influence. »"
    ],
    "commentSummary": [
      "COBOL, souvent considéré comme obsolète, reste essentiel pour les systèmes hérités dans des secteurs comme la paie et la banque en raison de son intégration avec des systèmes centraux fiables. Bien qu'il soit conçu pour être lisible par l'homme, COBOL nécessite des connaissances approfondies du domaine pour traduire avec précision les processus métier en code. La pertinence continue de ce langage est soulignée par le besoin de programmeurs pour maintenir les systèmes existants, notamment avec des défis comme le problème de l'an 2038 à l'horizon."
    ],
    "points": 404,
    "commentCount": 396,
    "retryCount": 0,
    "time": 1727810738
  },
  {
    "id": 41719531,
    "title": "J'ai créé un jeu auquel vous pouvez jouer sans que personne ne le sache (pas de visuels/son)",
    "originLink": "https://apps.apple.com/us/app/tik/id6720712299",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41719531",
    "commentBody": "",
    "originSummary": [
      "« Un nouveau jeu iOS appelé Tik! a été lancé, proposant un gameplay qui repose uniquement sur le retour haptique, sans visuels ni son. »",
      "Les joueurs doivent reproduire un rythme de vibrations en tapotant l'écran, offrant un défi unique en matière de synchronisation et de coordination.",
      "Le jeu a été conçu pour être une distraction discrète, permettant aux utilisateurs de jouer sans regarder leur téléphone, et les retours sont encouragés."
    ],
    "commentSummary": [
      "« Un nouveau jeu a été développé qui peut être joué discrètement sans visuels ni son, en se concentrant sur un timing strict pour une expérience stimulante. »",
      "« Le développeur envisage des améliorations basées sur les retours des utilisateurs, telles que l'ajout de ticks à intervalles constants, une option de retour au menu et un moyen de visualiser ou de passer les rythmes. »",
      "Le jeu est actuellement disponible sur iOS, avec des plans pour de futures mises à jour, y compris des niveaux de difficulté, de nouvelles fonctionnalités, et une version Android potentielle."
    ],
    "points": 335,
    "commentCount": 223,
    "retryCount": 0,
    "time": 1727869709
  },
  {
    "id": 41712885,
    "title": "Ne construisez pas votre château dans les royaumes des autres (2021)",
    "originLink": "https://howtomarketagame.com/2021/11/01/dont-build-your-castle-in-other-peoples-kingdoms/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41712885",
    "commentBody": "",
    "originSummary": [
      "Les plateformes de médias sociaux modifient souvent les conditions ou introduisent des plans payants de manière inattendue, comme on l'a vu avec le programme \"Boost\" de Twitch et la quasi-interdiction de contenu pour adultes sur OnlyFans, posant des risques pour les créateurs de contenu. Le principal conseil est d'éviter de construire une entreprise uniquement sur des plateformes externes ; au lieu de cela, il faut privilégier le développement de son propre site web, de sa liste de diffusion et de sa propriété intellectuelle. Les créateurs devraient utiliser les médias sociaux pour gagner des abonnés, mais s'assurer de les rediriger vers leurs propres plateformes, afin de maintenir le contrôle sur leur audience et leur contenu malgré les changements de plateforme."
    ],
    "commentSummary": [
      "« Ne construisez pas votre château dans les royaumes des autres » conseille de ne pas dépendre entièrement des grandes plateformes pour votre présence numérique en raison de leur contrôle sur l'accès et de la possibilité de changements soudains des règles. »",
      "« Cela suggère de créer des espaces indépendants, tels qu'un site web personnel ou une liste de diffusion, pour maintenir le contrôle et une connexion directe avec le public. »",
      "« Cette stratégie minimise la dépendance aux plateformes externes et protège contre les changements inattendus qui pourraient affecter les opérations commerciales. »"
    ],
    "points": 331,
    "commentCount": 223,
    "retryCount": 0,
    "time": 1727809856
  },
  {
    "id": 41715762,
    "title": "Les mathématiques de trois à sept ans",
    "originLink": "https://www.thepsmiths.com/p/review-math-from-three-to-seven-by",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41715762",
    "commentBody": "",
    "originSummary": [
      "\"Les mathématiques de trois à sept ans\" par Alexander Zvonkin introduit l'idée des cercles mathématiques pour les enfants d'âge préscolaire, en se concentrant sur la résolution de problèmes plutôt que sur l'apprentissage par cœur traditionnel.",
      "Le livre, structuré comme un journal, partage les expériences de Zvonkin dans l'enseignement de concepts mathématiques complexes à de jeunes enfants par des méthodes ludiques, mettant en lumière leurs capacités cognitives uniques.",
      "Le succès varié de Zvonkin avec différents groupes d'enfants souligne l'individualité du processus d'apprentissage de chaque enfant et l'importance de cultiver un amour pour la résolution de problèmes."
    ],
    "commentSummary": [
      "L'article passe en revue « Les mathématiques de trois à sept ans », en se concentrant sur le maintien de l'intérêt des enfants pour les mathématiques à mesure qu'ils grandissent.",
      "Les commentateurs suggèrent des méthodes engageantes comme l'utilisation de ressources en ligne (par exemple, Khan Academy, 3Blue1Brown) et la participation à des cercles mathématiques pour susciter l'intérêt.",
      "Le débat inclut le rôle de la passion dans l'apprentissage des mathématiques et prend en compte les influences culturelles et éducatives, en faisant référence à l'accent historique mis sur les mathématiques et les sciences dans l'éducation soviétique."
    ],
    "points": 312,
    "commentCount": 176,
    "retryCount": 0,
    "time": 1727827125
  },
  {
    "id": 41714672,
    "title": "Qui fait semblant de recruter ?",
    "originLink": "https://news.ycombinator.com/item?id=41714672",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41714672",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "De nombreuses entreprises maintiennent des offres d'emploi ouvertes pendant les gels d'embauche pour projeter une santé financière aux investisseurs, bien qu'elles n'embauchent pas activement.",
      "« Cette pratique frustre les chercheurs d'emploi, car les entreprises peuvent ignorer les CV recommandés ou mener des entretiens sans intention d'embaucher, ce qui entraîne une perte de temps et des données économiques trompeuses. »",
      "Les startups et les grandes entreprises adoptent ce comportement, utilisant les offres d'emploi pour signaler leur croissance ou maintenir un vivier de candidats, ce qui a un impact négatif sur la santé mentale des chercheurs d'emploi et complique le processus de recrutement."
    ],
    "points": 289,
    "commentCount": 99,
    "retryCount": 0,
    "time": 1727819690
  },
  {
    "id": 41721668,
    "title": "« Les mutex les plus rapides »",
    "originLink": "https://justine.lol/mutex/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41721668",
    "commentBody": "",
    "originSummary": [
      "« La bibliothèque de mutex de Cosmopolitan Libc démontre une performance supérieure dans des scénarios fortement contestés, surpassant le SRWLOCK de Microsoft par 2,75 fois et Cygwin par 65 fois sous Windows, et glibc par 3 fois et musl libc par 11 fois sous Linux. »",
      "« L'efficacité de la bibliothèque est attribuée à son intégration avec la bibliothèque nsync, qui utilise des techniques avancées telles que le Compare-And-Swap (CAS) optimiste et les futexes pour réduire l'utilisation du CPU et la contention. »",
      "Le projet est soutenu par divers sponsors, dont GitHub, Patreon, le programme MIECO de Mozilla et la communauté des développeurs, soulignant son développement collaboratif et le soutien de la communauté."
    ],
    "commentSummary": [
      "« La discussion se concentre sur les implémentations de mutex, avec des critiques sur les méthodes de benchmarking, suggérant que la performance réelle devrait être testée dans de grands programmes multithreadés. Il y a un débat sur les mérites des différents types de mutex, tels que les spinlocks, et l'importance de la performance sans contention, mettant en avant les améliorations des mutex de la bibliothèque Cosmopolitan C. La conversation explore également l'utilisation de la transmission de messages par rapport aux mutex pour la concurrence, certains préconisant des abstractions comme les files d'attente pour une meilleure compréhension et un débogage plus facile. »"
    ],
    "points": 277,
    "commentCount": 108,
    "retryCount": 0,
    "time": 1727883105
  },
  {
    "id": 41715277,
    "title": "Comment le CERN sert 1EB de données via FUSE [vidéo]",
    "originLink": "https://kernel-recipes.org/en/2024/schedule/how-cern-serves-1eb-of-data-via-fuse/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41715277",
    "commentBody": "",
    "originSummary": [
      "CERN gère un énorme exaoctet (EB) de données provenant du Grand collisionneur de hadrons, en utilisant des projets open source tels que CERNBox et EOS pour une gestion efficace des données.",
      "« Le groupe de gestion du stockage et des données au CERN est responsable de l'archivage des données, de leur distribution et de garantir un accès sécurisé pour plus de 30 000 utilisateurs. »",
      "« FUSE (Filesystem in Userspace) est utilisé pour faciliter l'accès global aux données, améliorant ainsi l'accessibilité et l'utilisabilité des données. »"
    ],
    "commentSummary": [
      "CERN gère un énorme 1 exaoctet (EB) de données en utilisant FUSE (Filesystem in Userspace), faisant face à des défis tels que des problèmes d'inotify dans les conteneurs Docker.",
      "Ils utilisent Rucio pour une gestion efficace des données à travers divers systèmes de stockage, assurant une distribution mondiale des données avec des sauvegardes sur bande et des répliques hors site.",
      "« Malgré les contraintes budgétaires et les récents changements de gestion en faveur de Microsoft, le CERN continue d'être un centre d'innovation scientifique, contribuant de manière significative à la science et à la technologie ouvertes, et est très apprécié pour ses découvertes scientifiques et ses avancées en science des données. »"
    ],
    "points": 210,
    "commentCount": 94,
    "retryCount": 0,
    "time": 1727823922
  },
  {
    "id": 41714750,
    "title": "Archive des catalogues Radio Shack (1939-2011)",
    "originLink": "https://www.radioshackcatalogs.com/?_hsenc=p2ANqtz-9H5PQMgh6cUobaKL8FZ3-Ib1lk2jXz-BBrutnvv14LwcLObCTepV_IHs6nj83QW1bzJZzkyQpOm2OVPZbBmOmtzIMoRw&_hsmi=327012423",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41714750",
    "commentBody": "",
    "originSummary": [
      "RadioShackCatalogs.com est une archive numérique qui préserve l'histoire de RadioShack de 1921 à 2011, présentant des catalogues de 1939 à 2011.",
      "« Le site présente une variété de produits, y compris des stéréos haute fidélité, des équipements de communication, des ordinateurs et des composants électroniques, mettant en avant des marques comme Tandy, Realistic et TRS-80. »",
      "« Les catalogues sont affichés dans un format de feuilletage de pages, offrant une expérience nostalgique de l'évolution technologique de RadioShack, et le site invite à contribuer des catalogues manquants ou un soutien financier pour l'entretien. »"
    ],
    "commentSummary": [
      "Les archives du catalogue Radio Shack (1939-2011) ont suscité de la nostalgie et des discussions sur son influence auprès des passionnés d'électronique.",
      "« Le passage de l'électronique DIY à un magasin de téléphones portables est considéré comme une mauvaise décision, contribuant au déclin de Radio Shack. »",
      "Le catalogue était une source d'inspiration, offrant une liste soigneusement sélectionnée de pièces et d'outils, une expérience physique qui manque désormais à l'ère des magasins en ligne comme Digikey et Mouser."
    ],
    "points": 199,
    "commentCount": 80,
    "retryCount": 0,
    "time": 1727820297
  },
  {
    "id": 41715747,
    "title": "« Un homme du nord de l'Ontario résout une légende locale et trouve de l'alcool vintage au fond d'un lac »",
    "originLink": "https://www.cbc.ca/news/canada/sudbury/larder-lake-local-legend-sunken-taxi-vintage-liquor-1.7332124",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41715747",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Un homme du nord de l'Ontario a découvert une voiture REO Flying Cloud de 1929 avec six bouteilles de whisky au fond d'un lac, résolvant ainsi une légende locale.",
      "« La découverte a suscité des discussions sur la couverture de la Canadian Broadcasting Corporation (CBC) et son biais politique perçu, les commentateurs partageant des expériences personnelles et des opinions. »",
      "La voiture reste sous l'eau pour que les plongeurs puissent l'explorer, car elle est considérée comme trop fragile pour être retirée."
    ],
    "points": 193,
    "commentCount": 54,
    "retryCount": 0,
    "time": 1727826988
  },
  {
    "id": 41714285,
    "title": "« Juno pour YouTube a été retiré de l'App Store »",
    "originLink": "https://christianselig.com/2024/10/juno-removed/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41714285",
    "commentBody": "",
    "originSummary": [
      "Juno for YouTube, une application de vue web qui modifiait le site de YouTube pour un aspect \"visionOS\", a été retirée de l'App Store le 1er octobre 2024 en raison de violations des directives revendiquées par YouTube.",
      "Le retrait de l'application était le résultat de désaccords non résolus entre le développeur et YouTube, sans aucun plan d'escalade supplémentaire de la part du développeur.",
      "Les utilisateurs existants peuvent continuer à utiliser Juno jusqu'à ce que de potentielles mises à jour futures de YouTube le rendent non-fonctionnel, et le développeur a exprimé sa gratitude pour le soutien des utilisateurs de Vision Pro."
    ],
    "commentSummary": [
      "« Juno pour YouTube, une application développée par le créateur de l'application Apollo pour Reddit, a été retirée de l'App Store en raison de violations présumées des directives par YouTube. »",
      "« L'application, qui était une vue web et ne bloquait pas les publicités, souligne les difficultés rencontrées par les développeurs avec les grandes entreprises technologiques et leurs politiques strictes. »",
      "« Cette situation souligne l'appel croissant en faveur de magasins d'applications alternatifs, car de nombreux utilisateurs et développeurs estiment que les plateformes privilégient leur contrôle au détriment des avantages pour les utilisateurs. »"
    ],
    "points": 175,
    "commentCount": 132,
    "retryCount": 0,
    "time": 1727817525
  },
  {
    "id": 41717050,
    "title": "NixOS est un bon système d'exploitation pour serveur, sauf quand il ne l'est pas",
    "originLink": "https://sidhion.com/blog/posts/nixos_server_issues/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41717050",
    "commentBody": "",
    "originSummary": [
      "L'auteur aborde le défi de réduire la taille d'installation par défaut de NixOS, un système d'exploitation pour serveurs, qui occupe initialement environ 900 Mo d'espace disque. Les efforts pour minimiser NixOS ont impliqué la suppression de composants inutiles comme Nix, Perl, Python, et certains services, permettant une réduction d'environ 300 Mo. Malgré ces réductions, l'auteur conclut que créer un système NixOS minimal est complexe et suggère qu'un \"fork\" dédié de NixOS pour les scénarios de serveurs pourrait être plus efficace."
    ],
    "commentSummary": [
      "NixOS est reconnu comme un système d'exploitation serveur robuste, mais sa dépendance au langage Nix est considérée comme un inconvénient en raison de sa complexité et de son manque de fonctionnalités conviviales.",
      "« Les utilisateurs apprécient NixOS pour ses capacités de remplacement et de restauration faciles du système, mais certains sont passés à des systèmes plus simples comme Debian ou Proxmox en raison des défis de maintenance. »",
      "NixOS propose des versions stables tous les six mois mais n'offre pas de support à long terme, ce qui peut être une préoccupation pour les utilisateurs recherchant la stabilité sur de longues périodes."
    ],
    "points": 163,
    "commentCount": 158,
    "retryCount": 0,
    "time": 1727841977
  },
  {
    "id": 41716975,
    "title": "Nvidia publie le modèle NVLM 1.0 72B à poids ouvert",
    "originLink": "https://huggingface.co/nvidia/NVLM-D-72B",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41716975",
    "commentBody": "",
    "originSummary": [
      "« La collection NVLM 1.0 introduit des modèles de langage multimodal de classe frontière qui excellent à la fois dans les tâches de vision-langage et les tâches uniquement textuelles. »",
      "« Cette collection représente une avancée significative dans l'intégration du traitement des données visuelles et textuelles, mettant en lumière les capacités évolutives des modèles d'IA. »",
      "« La mise à jour, effectuée il y a seulement deux jours, suggère des améliorations continues et un intérêt pour le développement de ces modèles sophistiqués. »"
    ],
    "commentSummary": [
      "« Nvidia a lancé le modèle NVLM 1.0 72B open weight sur Hugging Face, dérivé du Qwen2-72B-Instruct LLM et de l'encodeur de vision InterViT, avec un accent sur la qualité plutôt que sur l'échelle. Le modèle est disponible en trois variantes : uniquement décodeur, attention croisée et hybride, mais seule la version uniquement décodeur est disponible sur Hugging Face. Il est sous licence non commerciale cc-by-nc-4.0, permettant l'évaluation mais pas l'utilisation commerciale, et nécessite une RAM GPU substantielle, environ 164 Go, pour une précision complète. »"
    ],
    "points": 145,
    "commentCount": 53,
    "retryCount": 0,
    "time": 1727840933
  },
  {
    "id": 41714361,
    "title": "Le guide simple pour construire et briser des habitudes",
    "originLink": "https://alexy.tech/posts/the-simple-guide-to-building-and-breaking-habits/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41714361",
    "commentBody": "",
    "originSummary": [
      "Habit formation can be either goal-oriented or identity-focused, requiring consistency to become automatic.- \"Limbic friction\" refers to the effort needed to start a new behavior, which can be reduced by minimizing stress and fatigue.- Strategies for building and breaking habits include task bracketing, optimizing your day, leveraging dopamine, and trying a 21-day trial with flexible goals."
    ],
    "commentSummary": [],
    "points": 142,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1727817995
  },
  {
    "id": 41714858,
    "title": "SlateDB – Une base de données embarquée construite sur le stockage d'objets",
    "originLink": "https://slatedb.io/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41714858",
    "commentBody": "",
    "originSummary": [
      "« SlateDB offre une durabilité extrêmement élevée (99,999999999 %) en utilisant la durabilité de votre magasin d'objets existant, éliminant ainsi le besoin de disques et les pannes associées. »",
      "Il offre des options de performance ajustables pour une faible latence, une efficacité économique ou une durabilité améliorée, et prend en charge un seul rédacteur avec plusieurs lecteurs, évitant ainsi les problèmes avec les rédacteurs zombies.",
      "Développé en Rust, SlateDB est une bibliothèque intégrable compatible avec plusieurs langages de programmation, et peut être facilement intégrée en l'ajoutant à vos dépendances dans Cargo.toml."
    ],
    "commentSummary": [
      "SlateDB est une base de données intégrée conçue pour le stockage d'objets, ressemblant à une « architecture de lakehouse » similaire à Apache Iceberg, et est utilisée pour le traitement de flux et les fonctions sans serveur.",
      "Il met en mémoire tampon les écritures dans un journal en mémoire avant de les valider dans le stockage d'objets, ce qui peut entraîner une perte de données si l'écrivain échoue, bien qu'il offre des options de durabilité configurables, y compris des écritures synchrones.",
      "Les critiques soutiennent que SlateDB est davantage une fine abstraction sur le stockage d'objets qu'une véritable base de données, et qu'il nécessite actuellement Rust pour son implémentation, manquant de support pour d'autres langages de programmation."
    ],
    "points": 138,
    "commentCount": 42,
    "retryCount": 0,
    "time": 1727821083
  },
  {
    "id": 41721567,
    "title": "Une bombe américaine de la Seconde Guerre mondiale explose à l'aéroport japonais, causant un grand cratère sur la voie de circulation",
    "originLink": "https://www.cnn.com/2024/10/02/travel/wwii-bomb-miyazaki-airport-japan-scli-intl/index.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41721567",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Une bombe américaine non explosée de la Seconde Guerre mondiale a explosé dans un aéroport japonais, provoquant un grand cratère sur une voie de circulation, mais heureusement, aucune blessure n'a été signalée.",
      "L'incident a ravivé les discussions sur les défis liés à la récupération des images numériques des caméras de sécurité et sur le problème généralisé des munitions non explosées dans des pays comme le Japon, Londres, l'Allemagne et la France.",
      "Des préoccupations ont été soulevées concernant la stabilité des vieux explosifs, car ils peuvent devenir plus sensibles avec le temps, posant des risques importants."
    ],
    "points": 136,
    "commentCount": 115,
    "retryCount": 0,
    "time": 1727882531
  }
]
