[
  {
    "id": 41713063,
    "title": "COBOL đã “chết” từ lâu, ông tôi đã viết về nó",
    "originLink": "https://wumpus-cave.net/post/2024/10/2024-10-01-death-of-cobol/index.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41713063",
    "commentBody": "",
    "originSummary": [
      "Mặc dù bị tuyên bố là \"chết\" vào năm 1992, Cobol vẫn tồn tại và vượt qua nhiều ngôn ngữ lập trình thế hệ thứ tư (4GLs), chứng tỏ sự bền bỉ và tầm quan trọng liên tục của nó.",
      "Vấn đề Y2K đã đóng một vai trò quan trọng trong việc hồi sinh Cobol bằng cách tạo ra nhu cầu cho các lập trình viên quen thuộc với ngôn ngữ này, nhấn mạnh tầm quan trọng của nó trong các hệ thống cũ.",
      "Quan điểm này khuyên nên thận trọng khi gán nhãn các ngôn ngữ lập trình là \"đã chết,\" đặc biệt là những ngôn ngữ có lượng người dùng đáng kể, vì chúng có thể tiếp tục có ứng dụng thực tiễn và ảnh hưởng."
    ],
    "commentSummary": [
      "COBOL, thường bị coi là lỗi thời, vẫn rất cần thiết cho các hệ thống cũ trong các lĩnh vực như bảng lương và ngân hàng do sự tích hợp của nó với các hệ thống máy tính lớn đáng tin cậy. Mặc dù được thiết kế để dễ đọc đối với con người, COBOL đòi hỏi kiến thức chuyên môn đáng kể để dịch chính xác các quy trình kinh doanh thành mã. Sự tiếp tục tồn tại của ngôn ngữ này được nhấn mạnh bởi nhu cầu về các lập trình viên để duy trì các hệ thống hiện có, đặc biệt là với những thách thức như vấn đề năm 2038 đang đến gần."
    ],
    "points": 404,
    "commentCount": 396,
    "retryCount": 0,
    "time": 1727810738
  },
  {
    "id": 41719531,
    "title": "Tôi đã tạo ra một trò chơi mà bạn có thể chơi mà không ai biết (không có hình ảnh/âm thanh)",
    "originLink": "https://apps.apple.com/us/app/tik/id6720712299",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41719531",
    "commentBody": "",
    "originSummary": [
      "Đã ra mắt một trò chơi iOS mới có tên là Tik!, với lối chơi hoàn toàn dựa vào phản hồi xúc giác, không có hình ảnh hay âm thanh.",
      "Người chơi phải tái tạo nhịp điệu của các rung động bằng cách chạm vào màn hình, mang đến một thử thách độc đáo về thời gian và sự phối hợp.",
      "Trò chơi được thiết kế để trở thành một sự phân tâm kín đáo, cho phép người dùng chơi mà không cần nhìn vào điện thoại của họ, và phản hồi được khuyến khích."
    ],
    "commentSummary": [
      "Một trò chơi mới đã được phát triển có thể chơi một cách kín đáo mà không cần hình ảnh hay âm thanh, tập trung vào thời gian nghiêm ngặt để mang lại trải nghiệm đầy thách thức.",
      "Nhà phát triển đang xem xét cải tiến dựa trên phản hồi của người dùng, chẳng hạn như thêm các dấu tích khoảng cách cố định, tùy chọn quay lại menu và cách để hình dung hoặc bỏ qua nhịp điệu.",
      "Trò chơi hiện có sẵn trên iOS, với kế hoạch cập nhật trong tương lai, bao gồm các mức độ khó, tính năng mới và có thể có phiên bản Android."
    ],
    "points": 335,
    "commentCount": 223,
    "retryCount": 0,
    "time": 1727869709
  },
  {
    "id": 41712885,
    "title": "Đừng xây lâu đài của bạn trong vương quốc của người khác (2021)",
    "originLink": "https://howtomarketagame.com/2021/11/01/dont-build-your-castle-in-other-peoples-kingdoms/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41712885",
    "commentBody": "",
    "originSummary": [
      "Những nền tảng mạng xã hội thường thay đổi điều khoản hoặc giới thiệu các gói trả phí một cách bất ngờ, như đã thấy với chương trình \"Boost\" của Twitch và việc gần như cấm nội dung người lớn trên OnlyFans, gây rủi ro cho những người sáng tạo nội dung. Lời khuyên chính là tránh xây dựng doanh nghiệp chỉ dựa trên các nền tảng bên ngoài; thay vào đó, hãy ưu tiên phát triển trang web riêng, danh sách email và tài sản trí tuệ của bạn. Những người sáng tạo nên sử dụng mạng xã hội để thu hút người theo dõi nhưng đảm bảo họ chuyển hướng họ đến các nền tảng riêng của mình, duy trì quyền kiểm soát đối với khán giả và nội dung của mình bất chấp những thay đổi của nền tảng."
    ],
    "commentSummary": [
      "\"Đừng xây lâu đài của bạn trong vương quốc của người khác\" khuyên không nên hoàn toàn dựa vào các nền tảng lớn cho sự hiện diện kỹ thuật số của bạn do họ kiểm soát quyền truy cập và khả năng thay đổi quy tắc đột ngột.",
      "Điều này gợi ý việc tạo ra các không gian độc lập, chẳng hạn như một trang web cá nhân hoặc danh sách gửi thư, để duy trì quyền kiểm soát và kết nối trực tiếp với khán giả.",
      "Chiến lược này giảm thiểu sự phụ thuộc vào các nền tảng bên ngoài và bảo vệ chống lại những thay đổi bất ngờ có thể ảnh hưởng đến hoạt động kinh doanh."
    ],
    "points": 331,
    "commentCount": 223,
    "retryCount": 0,
    "time": 1727809856
  },
  {
    "id": 41715762,
    "title": "Toán học từ Ba đến Bảy",
    "originLink": "https://www.thepsmiths.com/p/review-math-from-three-to-seven-by",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41715762",
    "commentBody": "",
    "originSummary": [
      "Cuốn sách 'Toán học từ Ba đến Bảy' của Alexander Zvonkin giới thiệu ý tưởng về các vòng tròn toán học dành cho trẻ mẫu giáo, tập trung vào giải quyết vấn đề thay vì học thuộc lòng truyền thống.",
      "Cuốn sách, được cấu trúc như một cuốn nhật ký, chia sẻ những trải nghiệm của Zvonkin trong việc dạy các khái niệm toán học phức tạp cho trẻ nhỏ thông qua các phương pháp vui chơi, nhấn mạnh khả năng nhận thức độc đáo của chúng.",
      "Thành công đa dạng của Zvonkin với các nhóm trẻ khác nhau nhấn mạnh tính cá nhân trong quá trình học tập của mỗi đứa trẻ và tầm quan trọng của việc nuôi dưỡng tình yêu giải quyết vấn đề."
    ],
    "commentSummary": [
      "Đánh giá bài viết \"Toán học từ Ba đến Bảy,\" tập trung vào việc duy trì sự hứng thú của trẻ em với toán học khi chúng lớn lên.",
      "Những người bình luận đề xuất các phương pháp hấp dẫn như sử dụng các tài nguyên trực tuyến (ví dụ: Khan Academy, 3Blue1Brown) và tham gia vào các câu lạc bộ toán học để khơi dậy sự hứng thú.",
      "Cuộc thảo luận bao gồm vai trò của đam mê trong việc học toán và xem xét các ảnh hưởng văn hóa và giáo dục, tham chiếu đến sự nhấn mạnh lịch sử vào toán học và khoa học trong giáo dục Liên Xô."
    ],
    "points": 312,
    "commentCount": 176,
    "retryCount": 0,
    "time": 1727827125
  },
  {
    "id": 41714672,
    "title": "Ai đang giả vờ tuyển dụng?",
    "originLink": "https://news.ycombinator.com/item?id=41714672",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41714672",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Rất nhiều công ty duy trì các thông báo tuyển dụng mở trong thời gian đóng băng tuyển dụng để thể hiện tình hình tài chính tốt với các nhà đầu tư, mặc dù không thực sự tuyển dụng.",
      "Thực hành này gây khó chịu cho những người tìm việc, vì các công ty có thể bỏ qua CV được đề xuất hoặc tiến hành phỏng vấn mà không có ý định tuyển dụng, dẫn đến lãng phí thời gian và dữ liệu kinh tế sai lệch.",
      "Hành vi này được thực hiện bởi cả các công ty khởi nghiệp và các công ty lớn, sử dụng các bài đăng tuyển dụng để báo hiệu sự phát triển hoặc duy trì một nguồn ứng viên, gây ảnh hưởng tiêu cực đến sức khỏe tinh thần của người tìm việc và làm phức tạp quá trình tuyển dụng."
    ],
    "points": 289,
    "commentCount": 99,
    "retryCount": 0,
    "time": 1727819690
  },
  {
    "id": 41721668,
    "title": "Những Mutexes Nhanh Nhất",
    "originLink": "https://justine.lol/mutex/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41721668",
    "commentBody": "",
    "originSummary": [
      "Thư viện mutex của Cosmopolitan Libc thể hiện hiệu suất vượt trội trong các tình huống tranh chấp nặng, vượt qua SRWLOCK của Microsoft với tỷ lệ 2.75 lần và Cygwin với tỷ lệ 65 lần trên Windows, và glibc với tỷ lệ 3 lần và musl libc với tỷ lệ 11 lần trên Linux.",
      "Hiệu quả của thư viện được cho là nhờ vào sự tích hợp với thư viện nsync, sử dụng các kỹ thuật tiên tiến như so sánh và hoán đổi lạc quan (CAS) và futexes để giảm mức sử dụng CPU và tranh chấp.",
      "Đề án được hỗ trợ bởi nhiều nhà tài trợ khác nhau, bao gồm GitHub, Patreon, chương trình MIECO của Mozilla và cộng đồng nhà phát triển, nhấn mạnh sự phát triển hợp tác và sự ủng hộ từ cộng đồng."
    ],
    "commentSummary": [
      "Cuộc thảo luận tập trung vào các triển khai mutex, với những phê bình về phương pháp đo lường hiệu suất, đề xuất rằng hiệu suất thực tế nên được kiểm tra trong các chương trình đa luồng lớn. - Có một cuộc tranh luận về ưu điểm của các loại mutex khác nhau, chẳng hạn như spinlocks, và tầm quan trọng của hiệu suất không bị tranh chấp, nhấn mạnh các cải tiến mutex của thư viện Cosmopolitan C. - Cuộc trò chuyện cũng khám phá việc sử dụng truyền thông điệp so với mutexes cho tính đồng thời, với một số người ủng hộ các trừu tượng như hàng đợi để dễ dàng suy luận và gỡ lỗi."
    ],
    "points": 277,
    "commentCount": 108,
    "retryCount": 0,
    "time": 1727883105
  },
  {
    "id": 41715277,
    "title": "Viện Nghiên cứu Hạt nhân Châu Âu (CERN) phục vụ 1EB dữ liệu thông qua FUSE [video]",
    "originLink": "https://kernel-recipes.org/en/2024/schedule/how-cern-serves-1eb-of-data-via-fuse/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41715277",
    "commentBody": "",
    "originSummary": [
      "CERN quản lý một lượng dữ liệu khổng lồ lên đến 1 exabyte (EB) từ Máy gia tốc hạt lớn, sử dụng các dự án mã nguồn mở như CERNBox và EOS để xử lý dữ liệu hiệu quả.",
      "Nhóm Quản lý Lưu trữ và Dữ liệu tại CERN chịu trách nhiệm về việc lưu trữ, phân phối dữ liệu và đảm bảo truy cập an toàn cho hơn 30.000 người dùng.",
      "FUSE (Filesystem in Userspace) được sử dụng để hỗ trợ truy cập dữ liệu toàn cầu, nâng cao khả năng truy cập và sử dụng dữ liệu."
    ],
    "commentSummary": [
      "CERN quản lý một lượng dữ liệu khổng lồ lên đến 1 exabyte (EB) bằng cách sử dụng FUSE (Filesystem in Userspace), đối mặt với các thách thức như các vấn đề inotify trong các container Docker.",
      "Họ sử dụng Rucio để quản lý dữ liệu hiệu quả trên các hệ thống lưu trữ khác nhau, đảm bảo phân phối dữ liệu toàn cầu với các bản sao lưu băng từ và các bản sao ngoài trang.",
      "Mặc dù có những hạn chế về ngân sách và những thay đổi gần đây trong quản lý ủng hộ Microsoft, CERN vẫn tiếp tục là một trung tâm đổi mới khoa học, đóng góp đáng kể cho khoa học và công nghệ mở, và được đánh giá cao về những khám phá khoa học và tiến bộ trong khoa học dữ liệu."
    ],
    "points": 210,
    "commentCount": 94,
    "retryCount": 0,
    "time": 1727823922
  },
  {
    "id": 41714750,
    "title": "Kho Lưu Trữ Danh Mục Radio Shack (1939-2011)",
    "originLink": "https://www.radioshackcatalogs.com/?_hsenc=p2ANqtz-9H5PQMgh6cUobaKL8FZ3-Ib1lk2jXz-BBrutnvv14LwcLObCTepV_IHs6nj83QW1bzJZzkyQpOm2OVPZbBmOmtzIMoRw&_hsmi=327012423",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41714750",
    "commentBody": "",
    "originSummary": [
      "RadioShackCatalogs.com là một kho lưu trữ kỹ thuật số bảo tồn lịch sử của RadioShack từ năm 1921 đến năm 2011, bao gồm các danh mục từ năm 1939 đến năm 2011.",
      "Trang web trưng bày nhiều loại sản phẩm, bao gồm dàn âm thanh hi-fi, thiết bị liên lạc, máy tính và linh kiện điện tử, nổi bật với các thương hiệu như Tandy, Realistic và TRS-80.",
      "Những cuốn danh mục được hiển thị dưới dạng lật trang, mang lại trải nghiệm hoài niệm về sự phát triển công nghệ của RadioShack, và trang web mời gọi đóng góp các danh mục còn thiếu hoặc hỗ trợ tài chính cho việc duy trì."
    ],
    "commentSummary": [
      "Kho Lưu Trữ Danh Mục Radio Shack (1939-2011) đã khơi dậy nỗi nhớ và các cuộc thảo luận về ảnh hưởng của nó đối với những người đam mê điện tử.",
      "Việc chuyển từ kinh doanh thiết bị điện tử tự làm sang cửa hàng điện thoại di động được xem là một quyết định tồi, góp phần vào sự suy giảm của Radio Shack.",
      "Cuốn danh mục là một nguồn cảm hứng, cung cấp một danh sách các bộ phận và công cụ được chọn lọc, một trải nghiệm vật lý mà giờ đây đã bị lãng quên trong thời đại của các cửa hàng trực tuyến như Digikey và Mouser."
    ],
    "points": 199,
    "commentCount": 80,
    "retryCount": 0,
    "time": 1727820297
  },
  {
    "id": 41715747,
    "title": "Bắc Ontario: Người đàn ông giải mã huyền thoại địa phương, tìm thấy rượu cổ dưới đáy hồ",
    "originLink": "https://www.cbc.ca/news/canada/sudbury/larder-lake-local-legend-sunken-taxi-vintage-liquor-1.7332124",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41715747",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Một người đàn ông ở Bắc Ontario đã phát hiện ra một chiếc xe REO Flying Cloud năm 1929 với sáu chai rượu whisky dưới đáy hồ, giải đáp một huyền thoại địa phương.",
      "Khám phá này đã làm dấy lên các cuộc thảo luận về việc đưa tin của Đài Phát thanh Truyền hình Canada (CBC) và sự thiên vị chính trị được cho là của nó, với những người bình luận chia sẻ kinh nghiệm cá nhân và ý kiến của họ.",
      "Chiếc xe vẫn nằm dưới nước để các thợ lặn khám phá, vì nó được coi là quá mong manh để di chuyển."
    ],
    "points": 193,
    "commentCount": 54,
    "retryCount": 0,
    "time": 1727826988
  },
  {
    "id": 41714285,
    "title": "Juno for YouTube đã bị gỡ khỏi App Store",
    "originLink": "https://christianselig.com/2024/10/juno-removed/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41714285",
    "commentBody": "",
    "originSummary": [
      "Juno for YouTube, một ứng dụng web view đã chỉnh sửa trang web của YouTube để có giao diện \"visionOS\", đã bị gỡ khỏi App Store vào ngày 1 tháng 10 năm 2024, do vi phạm hướng dẫn mà YouTube tuyên bố.",
      "Việc gỡ bỏ ứng dụng là kết quả của những bất đồng chưa được giải quyết giữa nhà phát triển và YouTube, mà không có kế hoạch leo thang thêm từ phía nhà phát triển.",
      "Người dùng hiện tại có thể tiếp tục sử dụng Juno cho đến khi các bản cập nhật tiềm năng trong tương lai từ YouTube làm cho nó không còn hoạt động, và nhà phát triển đã bày tỏ lòng biết ơn đối với sự ủng hộ từ người dùng Vision Pro."
    ],
    "commentSummary": [
      "Juno for YouTube, một ứng dụng được phát triển bởi người tạo ra ứng dụng Apollo cho Reddit, đã bị gỡ khỏi App Store do bị cáo buộc vi phạm hướng dẫn của YouTube.",
      "Ứng dụng, vốn là một web view và không chặn quảng cáo, nhấn mạnh những khó khăn mà các nhà phát triển gặp phải với các công ty công nghệ lớn và các chính sách nghiêm ngặt của họ.",
      "Điều này nhấn mạnh sự kêu gọi ngày càng tăng đối với các cửa hàng ứng dụng thay thế, khi nhiều người dùng và nhà phát triển cảm thấy rằng các nền tảng ưu tiên kiểm soát của họ hơn là lợi ích của người dùng."
    ],
    "points": 175,
    "commentCount": 132,
    "retryCount": 0,
    "time": 1727817525
  },
  {
    "id": 41717050,
    "title": "NixOS là một hệ điều hành máy chủ tốt, trừ khi nó không phải vậy",
    "originLink": "https://sidhion.com/blog/posts/nixos_server_issues/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41717050",
    "commentBody": "",
    "originSummary": [
      "Theo tác giả, thách thức trong việc giảm kích thước cài đặt mặc định của NixOS, một hệ điều hành máy chủ, ban đầu chiếm khoảng 900MB dung lượng đĩa. Nỗ lực tối ưu hóa NixOS bao gồm việc loại bỏ các thành phần không cần thiết như Nix, Perl, Python và một số dịch vụ, đạt được mức giảm khoảng 300MB. Mặc dù đã giảm bớt, tác giả kết luận rằng việc tạo ra một hệ thống NixOS tối giản là phức tạp và đề xuất rằng một \"nhánh\" chuyên biệt của NixOS cho các kịch bản máy chủ có thể hiệu quả hơn."
    ],
    "commentSummary": [
      "NixOS được công nhận là một hệ điều hành máy chủ mạnh mẽ, nhưng sự phụ thuộc vào ngôn ngữ Nix được coi là một nhược điểm do tính phức tạp và thiếu các tính năng thân thiện với người dùng.",
      "Người dùng đánh giá cao NixOS vì khả năng thay thế và khôi phục hệ thống dễ dàng, tuy nhiên một số đã chuyển sang các hệ thống đơn giản hơn như Debian hoặc Proxmox do những thách thức trong việc bảo trì.",
      "NixOS cung cấp các phiên bản ổn định mỗi sáu tháng nhưng không cung cấp hỗ trợ dài hạn, điều này có thể là mối quan ngại cho người dùng tìm kiếm sự ổn định trong thời gian dài."
    ],
    "points": 163,
    "commentCount": 158,
    "retryCount": 0,
    "time": 1727841977
  },
  {
    "id": 41716975,
    "title": "Nvidia phát hành mô hình trọng số mở NVLM 1.0 72B",
    "originLink": "https://huggingface.co/nvidia/NVLM-D-72B",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41716975",
    "commentBody": "",
    "originSummary": [
      "NVLM 1.0 Collection giới thiệu các mô hình ngôn ngữ lớn đa phương thức tiên tiến, hoạt động xuất sắc trong cả nhiệm vụ ngôn ngữ-thị giác và chỉ văn bản.",
      "Việc sưu tập này đại diện cho một bước tiến quan trọng trong việc tích hợp xử lý dữ liệu hình ảnh và văn bản, nhấn mạnh khả năng phát triển của các mô hình AI.",
      "Việc cập nhật, được thực hiện chỉ hai ngày trước, cho thấy những cải tiến liên tục và sự quan tâm đến việc phát triển các mô hình tinh vi này."
    ],
    "commentSummary": [
      "Nvidia đã ra mắt mô hình NVLM 1.0 72B với trọng số mở trên Hugging Face, được phát triển từ Qwen2-72B-Instruct LLM và bộ mã hóa hình ảnh InterViT, tập trung vào chất lượng hơn là quy mô. Mô hình có ba biến thể: chỉ giải mã, chú ý chéo và lai, nhưng chỉ có phiên bản chỉ giải mã có sẵn trên Hugging Face. Nó được cấp phép dưới giấy phép cc-by-nc-4.0 không thương mại, cho phép đánh giá nhưng không sử dụng thương mại, và yêu cầu RAM GPU đáng kể, khoảng 164GB, để đạt độ chính xác đầy đủ."
    ],
    "points": 145,
    "commentCount": 53,
    "retryCount": 0,
    "time": 1727840933
  },
  {
    "id": 41714361,
    "title": "Cuốn Hướng Dẫn Đơn Giản về Xây Dựng và Phá Vỡ Thói Quen",
    "originLink": "https://alexy.tech/posts/the-simple-guide-to-building-and-breaking-habits/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41714361",
    "commentBody": "",
    "originSummary": [
      "Hình thành thói quen có thể hướng đến mục tiêu hoặc tập trung vào bản sắc, đòi hỏi sự nhất quán để trở nên tự động. - \"Ma sát limbic\" đề cập đến nỗ lực cần thiết để bắt đầu một hành vi mới, có thể được giảm bớt bằng cách giảm thiểu căng thẳng và mệt mỏi. - Các chiến lược để xây dựng và phá vỡ thói quen bao gồm phân khung nhiệm vụ, tối ưu hóa ngày của bạn, tận dụng dopamine, và thử nghiệm 21 ngày với các mục tiêu linh hoạt."
    ],
    "commentSummary": [],
    "points": 142,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1727817995
  },
  {
    "id": 41714858,
    "title": "SlateDB – Một cơ sở dữ liệu nhúng được xây dựng trên lưu trữ đối tượng",
    "originLink": "https://slatedb.io/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41714858",
    "commentBody": "",
    "originSummary": [
      "SlateDB cung cấp độ bền cực kỳ cao (99,999999999%) bằng cách tận dụng độ bền của kho đối tượng hiện có của bạn, loại bỏ nhu cầu sử dụng đĩa và các lỗi liên quan.",
      "Đó là các tùy chọn hiệu suất có thể điều chỉnh cho độ trễ thấp, hiệu quả chi phí hoặc độ bền nâng cao, và hỗ trợ một người viết với nhiều người đọc, ngăn chặn các vấn đề với người viết zombie.",
      "Được phát triển bằng Rust, SlateDB là một thư viện có thể nhúng tương thích với nhiều ngôn ngữ lập trình, và có thể dễ dàng tích hợp bằng cách thêm nó vào các phụ thuộc của bạn trong Cargo.toml."
    ],
    "commentSummary": [
      "SlateDB là một cơ sở dữ liệu nhúng được thiết kế cho lưu trữ đối tượng, giống như một \"kiến trúc lakehouse\" tương tự như Apache Iceberg, và được sử dụng cho xử lý luồng và các hàm không máy chủ.",
      "Trước khi cam kết vào lưu trữ đối tượng, nó đệm các ghi chép trong một nhật ký trong bộ nhớ, điều này có thể dẫn đến mất dữ liệu nếu người ghi thất bại, mặc dù nó cung cấp các tùy chọn độ bền có thể cấu hình, bao gồm ghi chép đồng bộ.",
      "Những người chỉ trích cho rằng SlateDB giống như một lớp trừu tượng mỏng trên bộ nhớ đối tượng hơn là một cơ sở dữ liệu thực sự, và hiện tại nó yêu cầu Rust để triển khai, thiếu hỗ trợ cho các ngôn ngữ lập trình khác."
    ],
    "points": 138,
    "commentCount": 42,
    "retryCount": 0,
    "time": 1727821083
  },
  {
    "id": 41721567,
    "title": "Bom Thế chiến II của Mỹ phát nổ tại sân bay Nhật Bản, gây ra hố lớn trên đường lăn",
    "originLink": "https://www.cnn.com/2024/10/02/travel/wwii-bomb-miyazaki-airport-japan-scli-intl/index.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41721567",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Bom chưa nổ từ Thế chiến II của Mỹ phát nổ tại một sân bay Nhật Bản, gây ra một hố lớn trên đường lăn, nhưng may mắn thay, không có thương vong nào được báo cáo.",
      "Vụ việc đã làm dấy lên các cuộc thảo luận về những thách thức trong việc thu hồi cảnh quay kỹ thuật số từ các camera an ninh và vấn đề phổ biến của đạn chưa nổ ở các quốc gia như Nhật Bản, London, Đức và Pháp.",
      "Những lo ngại đã được nêu ra về sự ổn định của các chất nổ cũ, vì chúng có thể trở nên nhạy cảm hơn theo thời gian, gây ra những rủi ro đáng kể."
    ],
    "points": 136,
    "commentCount": 115,
    "retryCount": 0,
    "time": 1727882531
  }
]
