[
  {
    "id": 41713063,
    "title": "COBOL 'இறந்தது' மிகவும் நீண்ட காலமாக உள்ளது, என் தாத்தா அதைப் பற்றி எழுதினார்",
    "originLink": "https://wumpus-cave.net/post/2024/10/2024-10-01-death-of-cobol/index.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41713063",
    "commentBody": "",
    "originSummary": [
      "1992 இல் \"இறந்தது\" என்று அறிவிக்கப்பட்டபோதிலும், Cobol பல நான்காவது தலைமுறை நிரலாக்க மொழிகளை (4GLs) கடந்து நீடித்து, அதன் நிலைத்தன்மையையும் தொடர்ந்த முக்கியத்துவத்தையும் நிரூபித்துள்ளது.",
      "Y2K பிரச்சனை, மொழியை நன்கு அறிந்த நிரலாளர்களுக்கான தேவையை உருவாக்குவதன் மூலம் Cobol ஐ மீண்டும் உயிர்ப்பிக்க முக்கிய பங்கு வகித்தது, பழைய கணினி அமைப்புகளில் அதன் முக்கியத்துவத்தை வெளிப்படுத்தியது.",
      "நரேட்டிவ், குறிப்பாக பெரிய பயனர் அடிப்படையைக் கொண்டுள்ளவற்றை, \"இறந்த\" எனக் குறிக்கும்போது எச்சரிக்கையாக இருக்க வேண்டும் என்று பரிந்துரைக்கிறது, ஏனெனில் அவை நடைமுறையான பயன்பாடுகளையும் செல்வாக்கையும் தொடரக்கூடும்."
    ],
    "commentSummary": [
      "COBOL, பெரும்பாலும் பழமையானது என்று கருதப்படுகிறது, ஆனால் சம்பள பட்டியல் மற்றும் வங்கி போன்ற துறைகளில் பழைய கணினி அமைப்புகளுடன் ஒருங்கிணைந்திருப்பதால் இன்றும் முக்கியமாக உள்ளது.- மனிதர்களால் படிக்கக்கூடியதாக வடிவமைக்கப்பட்டிருந்தாலும், COBOL க்கு வணிக செயல்முறைகளை சரியாகக் குறியாக்குவதற்கு முக்கியமான துறை அறிவு தேவைப்படுகிறது.- 2038 பிரச்சனை போன்ற சவால்களுடன், குறிப்பாக தற்போதுள்ள அமைப்புகளை பராமரிக்க நிரலாக்குநர்கள் தேவைப்படுவதால், இந்த மொழியின் தொடர்ந்துள்ள முக்கியத்துவம் வலியுறுத்தப்படுகிறது."
    ],
    "points": 404,
    "commentCount": 396,
    "retryCount": 0,
    "time": 1727810738
  },
  {
    "id": 41719531,
    "title": "நான் யாரும் அறியாமல் (காட்சி/ஒலி இல்லாமல்) நீங்கள் விளையாடக்கூடிய ஒரு விளையாட்டை உருவாக்கினேன்",
    "originLink": "https://apps.apple.com/us/app/tik/id6720712299",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41719531",
    "commentBody": "",
    "originSummary": [
      "ஒரு புதிய iOS விளையாட்டு Tik! அறிமுகமாகியுள்ளது, இது காட்சிகள் அல்லது ஒலி இல்லாமல், முழுமையாக ஹாப்டிக் பின்னூட்டத்தை மட்டுமே நம்பியுள்ள விளையாட்டு அம்சங்களை கொண்டுள்ளது.",
      "Players must replicate a rhythm of vibrations by tapping the screen, offering a unique challenge in timing and coordination.",
      "விளையாட்டு ஒரு மறைமுகமான கவனச்சிதறலை ஏற்படுத்தும் வகையில் வடிவமைக்கப்பட்டது, பயனர்கள் தங்கள் தொலைபேசியைப் பார்க்காமல் விளையாட அனுமதிக்கிறது, மேலும் கருத்துக்களை ஊக்குவிக்கப்படுகிறது."
    ],
    "commentSummary": [
      "ஒரு புதிய விளையாட்டு உருவாக்கப்பட்டுள்ளது, இது காட்சிகள் அல்லது ஒலியின்றி மறைமுகமாக விளையாட முடியும், கடுமையான நேரத்தை மையமாகக் கொண்டு சவாலான அனுபவத்தை வழங்குகிறது.",
      "டெவலப்பர் பயனர் கருத்துக்களை அடிப்படையாகக் கொண்டு மேம்பாடுகளை பரிசீலிக்கிறார், உதாரணமாக, நிலையான இடைவெளி டிக்ஸ், மெனு திரும்பும் விருப்பம், மற்றும் ரிதம்களை காட்சிப்படுத்த அல்லது தவிர்க்கும் வழி சேர்த்தல் போன்றவை.",
      "இந்த விளையாட்டு தற்போது iOS இல் கிடைக்கிறது, எதிர்கால புதுப்பிப்புகளுக்கான திட்டங்களுடன், அதில் சிரம நிலைகள், புதிய அம்சங்கள் மற்றும் ஒரு சாத்தியமான Android பதிப்பு அடங்கும்."
    ],
    "points": 335,
    "commentCount": 223,
    "retryCount": 0,
    "time": 1727869709
  },
  {
    "id": 41712885,
    "title": "மற்றவர்களின் ராஜ்யங்களில் உங்கள் கோட்டை கட்டாதீர்கள் (2021)",
    "originLink": "https://howtomarketagame.com/2021/11/01/dont-build-your-castle-in-other-peoples-kingdoms/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41712885",
    "commentBody": "",
    "originSummary": [
      "சமூக ஊடக தளங்கள் அடிக்கடி விதிமுறைகளை மாற்றவோ அல்லது எதிர்பாராத விதமாக கட்டண திட்டங்களை அறிமுகப்படுத்தவோ செய்கின்றன, இது Twitch இன் \"Boost\" திட்டம் மற்றும் OnlyFans இல் உள்ளடக்கத்தை தடை செய்யும் முயற்சியால் காணப்படுகிறது, இது உள்ளடக்க உருவாக்குநர்களுக்கு ஆபத்துகளை ஏற்படுத்துகிறது. - முக்கிய ஆலோசனை என்பது வெளிப்புற தளங்களில் மட்டுமே ஒரு வணிகத்தை உருவாக்குவதை தவிர்க்க வேண்டும்; அதற்கு பதிலாக, உங்கள் சொந்த இணையதளம், மின்னஞ்சல் பட்டியல் மற்றும் அறிவுசார் சொத்துக்களை மேம்படுத்துவதற்கு முன்னுரிமை கொடுக்க வேண்டும். - உருவாக்குநர்கள் சமூக ஊடகங்களைப் பயன்படுத்தி பின்தொடர்பவர்களைப் பெற வேண்டும், ஆனால் தங்கள் சொந்த தளங்களுக்கு அவர்களை திருப்பி அனுப்புவதை உறுதிசெய்ய வேண்டும், தள மாற்றங்களுக்குப் பிறகும் தங்கள் பார்வையாளர்கள் மற்றும் உள்ளடக்கத்தின் மீது கட்டுப்பாட்டை பராமரிக்க வேண்டும்."
    ],
    "commentSummary": [
      "\"மற்றவர்களின் ராஜ்யங்களில் உங்கள் கோட்டை கட்டாதீர்கள்\" என்ற சொற்றொடர், அணுகல் மற்றும் திடீர் விதிமாற்றங்களுக்கான அவர்களின் கட்டுப்பாட்டினால், டிஜிட்டல் இருப்பிற்காக பெரிய தளங்களில் முழுமையாக நம்புவதற்கு எதிராக அறிவுறுத்துகிறது.",
      "தனிப்பட்ட வலைத்தளம் அல்லது மின்னஞ்சல் பட்டியல் போன்ற சுயாதீன இடங்களை உருவாக்குவதன் மூலம் கட்டுப்பாட்டை பராமரித்து, நேரடி பார்வையாளர் தொடர்பை ஏற்படுத்த வேண்டும் என்று இது பரிந்துரைக்கிறது.",
      "இந்த உத்தியோகம் வெளிப்புற தளங்களின் மீது சார்ந்திருப்பதை குறைத்து, வணிக செயல்பாடுகளை பாதிக்கக்கூடிய எதிர்பாராத மாற்றங்களிலிருந்து பாதுகாக்கிறது."
    ],
    "points": 331,
    "commentCount": 223,
    "retryCount": 0,
    "time": 1727809856
  },
  {
    "id": 41715762,
    "title": "மூன்றிலிருந்து ஏழு வரை கணிதம்",
    "originLink": "https://www.thepsmiths.com/p/review-math-from-three-to-seven-by",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41715762",
    "commentBody": "",
    "originSummary": [
      "\"மூன்றிலிருந்து ஏழு வரை கணிதம்\" என்ற அலெக்சாண்டர் ஸ்வோன்கின் எழுதிய நூல், பாரம்பரிய முறைப்படி கற்றலுக்கு பதிலாக சிக்கல்களை தீர்க்கும் திறனை மையமாகக் கொண்டு, முன்பள்ளி குழந்தைகளுக்கான கணித வட்டங்களின் கருத்தை அறிமுகப்படுத்துகிறது.",
      "புத்தகம், ஒரு நாள்குறிப்பாக அமைக்கப்பட்டு, விளையாட்டுத்தனமான முறைகளின் மூலம் இளம் குழந்தைகளுக்கு சிக்கலான கணிதக் கருத்துகளை கற்பிப்பதில் ஜ்வோன்கின் அனுபவங்களை பகிர்ந்து, அவர்களின் தனித்துவமான அறிவாற்றலை வெளிப்படுத்துகிறது.",
      "Zvonkin இன் பல்வேறு குழந்தைகள் குழுக்களுடன் பெற்ற வெற்றிகள் ஒவ்வொரு குழந்தையின் கற்றல் செயல்முறையின் தனித்துவத்தையும், பிரச்சினைகளைத் தீர்க்கும் ஆர்வத்தை வளர்ப்பதன் முக்கியத்துவத்தையும் வலியுறுத்துகின்றன."
    ],
    "commentSummary": [
      "கட்டுரை 'மூன்றிலிருந்து ஏழு வரை கணிதம்' என்ற புத்தகத்தை மதிப்பீடு செய்கிறது, குழந்தைகள் வயதுக்கு வரும்போது கணிதத்தில் அவர்களின் ஆர்வத்தை பராமரிப்பதில் கவனம் செலுத்துகிறது.",
      "கருத்துரையாளர்கள் ஆர்வத்தை ஊக்குவிக்க ஆன்லைன் வளங்களை (எ.கா., கான் அகாடமி, 3ப்ளூ1ப்ரவுன்) பயன்படுத்துவது மற்றும் கணித வட்டங்களில் பங்கேற்பது போன்ற ஈர்க்கும் முறைகளை பரிந்துரைக்கின்றனர்.",
      "சர்ச்சையில் கணிதத்தை கற்றலில் ஆர்வத்தின் பங்கு மற்றும் கலாச்சார மற்றும் கல்வி தாக்கங்களைப் பற்றி விவாதிக்கப்படுகிறது, சோவியத் கல்வியில் கணிதம் மற்றும் அறிவியலின் வரலாற்று முக்கியத்துவத்தை குறிப்பிடுகிறது."
    ],
    "points": 312,
    "commentCount": 176,
    "retryCount": 0,
    "time": 1727827125
  },
  {
    "id": 41714672,
    "title": "யார் வேலைக்கு ஆட்களை எடுப்பது போல நடிக்கிறார்கள்?",
    "originLink": "https://news.ycombinator.com/item?id=41714672",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41714672",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "பல நிறுவனங்கள் வேலைக்கு ஆட்கள் சேர்க்கும் செயல்முறையை நிறுத்தியிருந்தாலும், முதலீட்டாளர்களுக்கு நிதி நிலைமை நன்றாக உள்ளது என்பதை காட்டுவதற்காக வேலைவாய்ப்பு அறிவிப்புகளை திறந்தவையாக வைத்திருக்கின்றன.",
      "இந்த நடைமுறை வேலை தேடுபவர்களை விரக்தியடையச் செய்கிறது, ஏனெனில் நிறுவனங்கள் பரிந்துரைக்கப்பட்ட சி.வி.க்களை புறக்கணிக்கலாம் அல்லது வேலைக்கு எடுக்க வேண்டிய நோக்கமின்றி நேர்காணல்களை நடத்தலாம், இதனால் நேரம் வீணாகிறது மற்றும் தவறான பொருளாதார தரவுகளை உருவாக்குகிறது.",
      "இரு தொடக்க நிறுவனங்களும் பெரிய நிறுவனங்களும் இந்த நடத்தைப் பின்பற்றுகின்றன, வேலைவாய்ப்பு அறிவிப்புகளை வளர்ச்சி அல்லது வேட்பாளர் குளத்தை பராமரிக்க சிக்னல் செய்ய பயன்படுத்தி, வேலை தேடுபவர்களின் மனநலத்தை பாதிக்கவும், வேலைவாய்ப்பு செயல்முறையை சிக்கலாக்கவும் செய்கின்றன."
    ],
    "points": 289,
    "commentCount": 99,
    "retryCount": 0,
    "time": 1727819690
  },
  {
    "id": 41721668,
    "title": "அதிவேக மியூட்டெக்ஸ்கள்",
    "originLink": "https://justine.lol/mutex/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41721668",
    "commentBody": "",
    "originSummary": [
      "Cosmopolitan Libc இன் mutex நூலகம் மிகுந்த போட்டி நிலைகளில் சிறந்த செயல்திறனை வெளிப்படுத்துகிறது, Windows இல் Microsoft's SRWLOCK ஐ 2.75 மடங்கு மற்றும் Cygwin ஐ 65 மடங்கு முந்துகிறது, மேலும் Linux இல் glibc ஐ 3 மடங்கு மற்றும் musl libc ஐ 11 மடங்கு முந்துகிறது.",
      "நூலகத்தின் செயல்திறன் nsync நூலகத்துடன் ஒருங்கிணைக்கப்பட்டதற்கு காரணமாகும், இது CPU பயன்பாடு மற்றும் மோதல்களை குறைக்க நம்பகமான Compare-And-Swap (CAS) மற்றும் futexes போன்ற மேம்பட்ட நுட்பங்களைப் பயன்படுத்துகிறது.",
      "திட்டம் பல்வேறு ஆதாரகர்களால் ஆதரிக்கப்படுகிறது, இதில் GitHub, Patreon, Mozilla இன் MIECO திட்டம் மற்றும் டெவலப்பர் சமூகமும் அடங்கும், இது அதன் கூட்டுறவு மேம்பாடு மற்றும் சமூக ஆதரவை வெளிப்படுத்துகிறது."
    ],
    "commentSummary": [
      "இந்த விவாதம் மியூடெக்ஸ் செயலாக்கங்களை மையமாகக் கொண்டு, பெஞ்ச்மார்க்கிங் முறைகளின் விமர்சனங்களுடன், பெரிய மல்டித்ரெடட் திட்டங்களில் உண்மையான செயல்திறனை சோதிக்க வேண்டும் என்று பரிந்துரைக்கிறது.- மியூடெக்ஸ் வகைகளின் பலன்கள் குறித்து விவாதம் உள்ளது, உதாரணமாக ஸ்பின்லாக்ஸ் போன்றவை, மற்றும் மியூடெக்ஸ் மேம்பாடுகளை மையமாகக் கொண்டு Cosmopolitan C நூலகத்தின் முக்கியத்துவத்தை விளக்குகிறது.- இந்த உரையாடல், ஒருங்கிணைப்பிற்காக செய்தி பரிமாற்றம் மற்றும் மியூடெக்ஸ்கள் பயன்படுத்துவது குறித்தும், சிலர் எளிதாகக் கருத்தாக்கம் மற்றும் பிழைத்திருத்தம் செய்யும் வகையில் க்யூஸ் போன்ற அப்ஸ்ட்ராக்ஷன்களை ஆதரிக்கின்றனர்."
    ],
    "points": 277,
    "commentCount": 108,
    "retryCount": 0,
    "time": 1727883105
  },
  {
    "id": 41715277,
    "title": "எப்படி CERN 1EB தரவுகளை FUSE மூலம் வழங்குகிறது [வீடியோ]",
    "originLink": "https://kernel-recipes.org/en/2024/schedule/how-cern-serves-1eb-of-data-via-fuse/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41715277",
    "commentBody": "",
    "originSummary": [
      "CERN, பெரிய ஹாட்ரான் கொல்லைடரிலிருந்து 1 எக்ஸாபைட் (EB) அளவிலான தரவுகளை நிர்வகிக்கிறது, திறந்த மூல திட்டங்கள் போன்ற CERNBox மற்றும் EOS ஆகியவற்றைப் பயன்படுத்தி தரவுகளை திறம்பட கையாளுகிறது.",
      "செர்னில் உள்ள சேமிப்பு மற்றும் தரவுக் கையாளல் குழு தரவுகளை காப்பாற்றுதல், விநியோகம் மற்றும் 30,000 க்கும் மேற்பட்ட பயனர்களுக்கு பாதுகாப்பான அணுகலை உறுதிப்படுத்துதல் ஆகியவற்றிற்கு பொறுப்பாக உள்ளது.",
      "FUSE (பயனர் இடத்தில் கோப்பு முறைமை) உலகளாவிய தரவுகளின் அணுகலை எளிதாக்க பயன்படுத்தப்படுகிறது, இது தரவுகளின் அணுகல் மற்றும் பயன்பாட்டை மேம்படுத்துகிறது."
    ],
    "commentSummary": [
      "CERN FUSE (Filesystem in Userspace) பயன்படுத்தி 1 எக்சாபைட் (EB) அளவிலான பெரும் தரவுகளை நிர்வகிக்கிறது, Docker கொண்டெய்னர்களில் inotify சிக்கல்களை போன்ற சவால்களை எதிர்கொள்கிறது.",
      "அவர்கள் பல்வேறு சேமிப்பு அமைப்புகளுக்கு மத்தியில் தரவுகளை திறம்பட மேலாண்மை செய்ய Rucio ஐ பயன்படுத்துகிறார்கள், உலகளாவிய தரவுப் பகிர்வை டேப் காப்பு நகல்கள் மற்றும் வெளியிட நகல்களுடன் உறுதி செய்கிறார்கள்.",
      "பட்ஜெட் கட்டுப்பாடுகள் மற்றும் சமீபத்திய மேலாண்மை மாற்றங்கள் மைக்ரோசாஃப்டை ஆதரிக்கும் போதிலும், செர்ன் அறிவியல் புதுமைகளுக்கான மையமாகவே தொடர்கிறது, திறந்த அறிவியல் மற்றும் தொழில்நுட்பத்திற்கு முக்கியமான பங்களிப்புகளை வழங்குகிறது, மேலும் அதன் அறிவியல் கண்டுபிடிப்புகள் மற்றும் தரவியல் அறிவியலில் முன்னேற்றங்களுக்காக மிகுந்த மதிப்பீடு செய்யப்படுகிறது."
    ],
    "points": 210,
    "commentCount": 94,
    "retryCount": 0,
    "time": 1727823922
  },
  {
    "id": 41714750,
    "title": "ரேடியோ ஷாக் பட்டியல் காப்பகம் (1939-2011)",
    "originLink": "https://www.radioshackcatalogs.com/?_hsenc=p2ANqtz-9H5PQMgh6cUobaKL8FZ3-Ib1lk2jXz-BBrutnvv14LwcLObCTepV_IHs6nj83QW1bzJZzkyQpOm2OVPZbBmOmtzIMoRw&_hsmi=327012423",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41714750",
    "commentBody": "",
    "originSummary": [
      "RadioShackCatalogs.com என்பது 1921 முதல் 2011 வரை RadioShack இன் வரலாற்றை பாதுகாக்கும் ஒரு டிஜிட்டல் காப்பகம் ஆகும், 1939 முதல் 2011 வரை உள்ள கையேடுகளை கொண்டுள்ளது.",
      "இந்த தளம் பல்வேறு தயாரிப்புகளை, அதாவது உயர் நம்பகத்தன்மை ஸ்டீரியோக்கள், தொடர்பு உபகரணங்கள், கணினிகள் மற்றும் மின்னணு கூறுகள் ஆகியவற்றை காட்சிப்படுத்துகிறது, Tandy, Realistic, மற்றும் TRS-80 போன்ற பிராண்டுகளை முன்னிலைப்படுத்துகிறது.",
      "கேட்டலாக்கள் பக்கத்தைத் திருப்பும் வடிவத்தில் காட்சிப்படுத்தப்படுகின்றன, இது RadioShack இன் தொழில்நுட்ப முன்னேற்றத்தின் நினைவூட்டும் அனுபவத்தை வழங்குகிறது, மேலும் இத்தளம் காணாமல் போன கேட்டலாக்கள் அல்லது பராமரிப்பிற்கான நிதி ஆதரவை வழங்குமாறு அழைக்கிறது."
    ],
    "commentSummary": [
      "ரேடியோ ஷேக் கையேடு காப்பகம் (1939-2011) மின்சாதன ஆர்வலர்களின் நினைவுகளைத் தூண்டி, அதன் தாக்கத்தைப் பற்றிய விவாதங்களை ஏற்படுத்தியுள்ளது.",
      "DIY மின்னணுவிலிருந்து செல்போன் கடைக்கு மாறுதல் ஒரு மோசமான முடிவாகக் கருதப்படுகிறது, இது ரேடியோ ஷாக்கின் வீழ்ச்சிக்கு காரணமாகும்.",
      "கட்டளைப் புத்தகம் ஒரு ஊக்கமளிக்கும் ஆதாரமாக இருந்தது, பாகங்கள் மற்றும் கருவிகளின் தேர்ந்தெடுக்கப்பட்ட பட்டியலை வழங்கியது, இப்போது Digikey மற்றும் Mouser போன்ற ஆன்லைன் கடைகளின் காலத்தில் இழந்த ஒரு உடல் அனுபவமாகும்."
    ],
    "points": 199,
    "commentCount": 80,
    "retryCount": 0,
    "time": 1727820297
  },
  {
    "id": 41715747,
    "title": "வட ஒன்டாரியோ மனிதர் உள்ளூர் புராணத்தை தீர்க்கிறார், ஏரியின் அடியில் பழமையான மதுபானத்தை கண்டுபிடிக்கிறார்",
    "originLink": "https://www.cbc.ca/news/canada/sudbury/larder-lake-local-legend-sunken-taxi-vintage-liquor-1.7332124",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41715747",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "வடக்கு ஒன்டாரியோவில் ஒரு மனிதர் 1929 ஆம் ஆண்டின் REO பறக்கும் மேகக் காரை ஏரியின் அடியில் ஆறு விஸ்கி பாட்டில்களுடன் கண்டுபிடித்து, ஒரு உள்ளூர் புராணத்தை தீர்த்தார்.",
      "கண்டுபிடிப்பு கனடிய ஒளிபரப்புக் கழகத்தின் (CBC) செய்தி வழங்கல் மற்றும் அதன் அரசியல் பாகுபாட்டை பற்றிய விவாதங்களைத் தூண்டியுள்ளது, கருத்துரையாளர்கள் தங்கள் தனிப்பட்ட அனுபவங்கள் மற்றும் கருத்துகளைப் பகிர்ந்து கொள்கின்றனர்.",
      "கார் நீருக்குள் நீர்மூழ்கி ஆராய்ச்சியாளர்கள் ஆராய்வதற்காக உள்ளது, ஏனெனில் அதை அகற்றுவது மிகவும் நाजுகமானதாக கருதப்படுகிறது."
    ],
    "points": 193,
    "commentCount": 54,
    "retryCount": 0,
    "time": 1727826988
  },
  {
    "id": 41714285,
    "title": "\"Juno for YouTube\" ஆப் ஸ்டோரிலிருந்து நீக்கப்பட்டுள்ளது",
    "originLink": "https://christianselig.com/2024/10/juno-removed/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41714285",
    "commentBody": "",
    "originSummary": [
      "\"Juno for YouTube\" என்ற, YouTube இன் வலைத்தளத்தை \"visionOS\" தோற்றத்திற்கு மாற்றிய ஒரு வலைப் பார்வை பயன்பாடு, YouTube கூறிய வழிகாட்டி மீறல்களால் 2024 அக்டோபர் 1 அன்று ஆப் ஸ்டோரிலிருந்து நீக்கப்பட்டது.",
      "அப்பிளிகேஷன் நீக்கம், டெவலப்பர் மற்றும் யூடியூப் இடையிலான தீர்க்கப்படாத கருத்து வேறுபாடுகளின் விளைவாக இருந்தது, மேலும் டெவலப்பரின் பக்கம் இருந்து மேலும் எதுவும் செய்ய திட்டமில்லை.",
      "நடப்பு பயனர்கள் YouTube இன் எதிர்கால புதுப்பிப்புகள் Juno ஐ செயலிழக்கச் செய்யும் வரை அதை தொடர்ந்து பயன்படுத்தலாம், மேலும் Vision Pro பயனர்களின் ஆதரவுக்கு டெவலப்பர் நன்றி தெரிவித்தார்."
    ],
    "commentSummary": [
      "Juno for YouTube, ரெடிட் பயன்பாட்டிற்கான அப்போலோ பயன்பாட்டின் உருவாக்குனரால் உருவாக்கப்பட்ட ஒரு பயன்பாடு, YouTube இன் குறிக்கோள் மீறல்களால் App Store இல் இருந்து நீக்கப்பட்டுள்ளது.",
      "அப்பிளிக்கேஷன், இது ஒரு வலைப் பார்வையாக இருந்தது மற்றும் விளம்பரங்களைத் தடுக்கவில்லை, முக்கிய தொழில்நுட்ப நிறுவனங்களின் கடுமையான கொள்கைகளுடன் டெவலப்பர்கள் சந்திக்கும் சிரமங்களை வலியுறுத்துகிறது.",
      "இந்த நிலைமை பல பயனர்கள் மற்றும் டெவலப்பர்கள் தளங்கள் பயனர் நன்மைகளை விட தங்களின் கட்டுப்பாட்டை முன்னுரிமை செய்கின்றன என்று உணருவதால் மாற்று ஆப் ஸ்டோர்களுக்கான அழைப்பை அதிகரிக்கிறது."
    ],
    "points": 175,
    "commentCount": 132,
    "retryCount": 0,
    "time": 1727817525
  },
  {
    "id": 41717050,
    "title": "நிக்ஸ்OS ஒரு நல்ல சர்வர் OS ஆகும், அது இல்லாத போது தவிர",
    "originLink": "https://sidhion.com/blog/posts/nixos_server_issues/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41717050",
    "commentBody": "",
    "originSummary": [
      "நிக்ஸ்ஓஎஸ், ஒரு சர்வர் இயக்க முறைமையின், இயல்புநிலை நிறுவல் அளவை குறைப்பதற்கான சவால்களை ஆசிரியர் விவரிக்கிறார், இது ஆரம்பத்தில் சுமார் 900MB டிஸ்க் இடத்தை எடுத்துக்கொள்கிறது.- நிக்ஸ்ஓஎஸை குறைப்பதற்கான முயற்சிகள், நிக்ஸ், பெர்ல், பைதான் மற்றும் சில சேவைகள் போன்ற தேவையற்ற கூறுகளை நீக்குவதன் மூலம் சுமார் 300MB குறைப்பை அடைந்தன.- இந்த குறைப்புகளுக்கு பிறகும், குறைந்தபட்ச நிக்ஸ்ஓஎஸ் முறைமையை உருவாக்குவது சிக்கலானது என்று ஆசிரியர் முடிவெடுக்கிறார் மற்றும் சர்வர் சூழலுக்கான ஒரு தனித்த \"பிளவு\" நிக்ஸ்ஓஎஸ் அதிக பயனுள்ளதாக இருக்கலாம் என்று பரிந்துரைக்கிறார்."
    ],
    "commentSummary": [
      "நிக்ஸ் ஓஎஸ் ஒரு வலுவான சர்வர் இயக்க முறைமையாகக் கருதப்படுகிறது, ஆனால் நிக்ஸ் மொழியின் மீது அதன் சார்பு அதன் சிக்கலான தன்மை மற்றும் பயனர் நட்பு அம்சங்களின் பற்றாக்குறை காரணமாக ஒரு குறையாகக் காணப்படுகிறது.",
      "பயனர்கள் NixOS ஐ அதன் எளிய அமைப்பு மாற்றம் மற்றும் ரோல்பேக் திறன்களுக்கு மதிக்கின்றனர், ஆனால் பராமரிப்பு சவால்களால் சிலர் டெபியன் அல்லது ப்ராக்ஸ்மாக்ஸ் போன்ற எளிய அமைப்புகளுக்கு மாறியுள்ளனர்.",
      "நிக்ஸ்OS ஒவ்வொரு ஆறு மாதங்களுக்கும் நிலையான வெளியீடுகளை வழங்குகிறது, ஆனால் நீண்டகால ஆதரவை வழங்குவதில்லை, இது நீண்டகாலத்திற்கு நிலைத்தன்மையை நாடும் பயனர்களுக்கு ஒரு கவலைக்குரிய விஷயமாக இருக்கலாம்."
    ],
    "points": 163,
    "commentCount": 158,
    "retryCount": 0,
    "time": 1727841977
  },
  {
    "id": 41716975,
    "title": "நிவிடியா NVLM 1.0 72B திறந்த எடை மாதிரியை வெளியிடுகிறது",
    "originLink": "https://huggingface.co/nvidia/NVLM-D-72B",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41716975",
    "commentBody": "",
    "originSummary": [
      "NVLM 1.0 தொகுப்பு முன்னணி வகுப்பின் பன்முகப்பாட மொழி மாதிரிகளை அறிமுகப்படுத்துகிறது, அவை பார்வை-மொழி மற்றும் உரை மட்டும் பணிகளில் மிகச் சிறப்பாக செயல்படுகின்றன.",
      "இந்த தொகுப்பு, காட்சி மற்றும் உரை தரவுகளை ஒருங்கிணைக்கும் செயல்முறையில் முக்கிய முன்னேற்றத்தை பிரதிபலிக்கிறது, AI மாதிரிகளின் வளர்ந்து வரும் திறன்களை வெளிப்படுத்துகிறது.",
      "மூன்று நாட்களுக்கு முன்பு செய்யப்பட்ட மேம்பாடு, இந்த நுண்ணறிவு மாதிரிகளின் மேம்பாடு மற்றும் அவற்றில் ஆர்வம் தொடர்ந்து இருப்பதை குறிக்கிறது."
    ],
    "commentSummary": [
      "Nvidia, Qwen2-72B-Instruct LLM மற்றும் InterViT பார்வை குறியாக்கி ஆகியவற்றிலிருந்து பெறப்பட்ட NVLM 1.0 72B திறந்த எடை மாதிரியை Hugging Face இல் வெளியிட்டுள்ளது, அளவுக்கு மாறாக தரத்தை மையமாகக் கொண்டு. - இந்த மாதிரி மூன்று மாறுபாடுகளில் வருகிறது: டிகோடர் மட்டும், குறுக்கு கவனம், மற்றும் கலப்பு, ஆனால் Hugging Face இல் டிகோடர் மட்டும் பதிப்பு மட்டுமே கிடைக்கிறது. - இது வணிகமற்ற cc-by-nc-4.0 உரிமத்தின் கீழ் உரிமம் பெற்றுள்ளது, மதிப்பீட்டிற்காக அனுமதிக்கப்படுகிறது ஆனால் வணிக பயன்பாட்டிற்கு அனுமதிக்கப்படாது, மற்றும் முழு துல்லியத்திற்காக சுமார் 164GB GPU RAM தேவைப்படுகிறது."
    ],
    "points": 145,
    "commentCount": 53,
    "retryCount": 0,
    "time": 1727840933
  },
  {
    "id": 41714361,
    "title": "சாதாரண வழிகாட்டி: பழக்கங்களை உருவாக்குவது மற்றும் உடைப்பது",
    "originLink": "https://alexy.tech/posts/the-simple-guide-to-building-and-breaking-habits/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41714361",
    "commentBody": "",
    "originSummary": [
      "பழக்கத்தை உருவாக்குவது இலக்கு நோக்கமாகவோ அல்லது அடையாளத்தை மையமாகக் கொண்டவையாகவோ இருக்கலாம், தானாகவே ஆகிவிடுவதற்கு நிலைத்தன்மை தேவைப்படுகிறது.- \"லிம்பிக் ஒட்டுதல்\" என்பது புதிய நடத்தை ஒன்றைத் தொடங்க தேவையான முயற்சியை குறிக்கிறது, இது மன அழுத்தம் மற்றும் சோர்வை குறைப்பதன் மூலம் குறைக்கப்படலாம்.- பழக்கங்களை உருவாக்குவதற்கும் உடைக்குவதற்கும் உத்திகள், பணிகளை பிராக்கெட்டிங் செய்வது, உங்கள் நாளை மேம்படுத்துவது, டோபமைனை பயன்படுத்துவது, மற்றும் நெகிழ்வான இலக்குகளுடன் 21 நாள் சோதனையை முயற்சிப்பது ஆகியவற்றை உள்ளடக்கியவை."
    ],
    "commentSummary": [],
    "points": 142,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1727817995
  },
  {
    "id": 41714858,
    "title": "SlateDB – பொருள் சேமிப்பகத்தில் உருவாக்கப்பட்ட ஒரு உட்பொதிக்கப்பட்ட தரவுத்தொகுப்பு",
    "originLink": "https://slatedb.io/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41714858",
    "commentBody": "",
    "originSummary": [
      "SlateDB உங்கள் தற்போதைய பொருள் சேமிப்பகத்தின் நிலைத்தன்மையைப் பயன்படுத்தி, வட்டு மற்றும் தொடர்புடைய தோல்விகளின் தேவையை நீக்கி, மிக உயர்ந்த நிலைத்தன்மையை (99.999999999%) வழங்குகிறது.",
      "இது குறைந்த தாமதம், செலவுக் குறைவு, அல்லது மேம்பட்ட நீடித்த தன்மை ஆகியவற்றிற்கான மாறுபடும் செயல்திறன் விருப்பங்களை வழங்குகிறது, மற்றும் பல வாசிப்பாளர்களுடன் ஒரு எழுத்தாளரை ஆதரிக்கிறது, மிருதக்கள எழுத்தாளர்களுடன் தொடர்புடைய பிரச்சினைகளைத் தடுக்கிறது.",
      "ரஸ்ட் மொழியில் உருவாக்கப்பட்ட SlateDB என்பது பல நிரலாக்க மொழிகளுடன் இணக்கமான ஒரு உட்பொதிக்கக்கூடிய நூலகமாகும், மேலும் அதை உங்கள் Cargo.toml இல் சார்புகளுக்கு சேர்ப்பதன் மூலம் எளிதாக ஒருங்கிணைக்கலாம்."
    ],
    "commentSummary": [
      "SlateDB என்பது ஒரு பொருள் சேமிப்பிற்காக வடிவமைக்கப்பட்ட உட்பொதிக்கப்பட்ட தரவுத்தொகுப்பாகும், இது Apache Iceberg போன்ற 'ஏரிக்கரை கட்டமைப்பு' போன்றது, மற்றும் ஸ்ட்ரீம் செயலாக்கம் மற்றும் சர்வர்லெஸ் செயல்பாடுகளுக்காக பயன்படுத்தப்படுகிறது.",
      "இது எழுதுகைகளை ஆவண சேமிப்பகத்திற்கு ஒப்படைக்கும்முன் நினைவகத்தில் உள்ள ஒரு பதிவேட்டில் தற்காலிகமாக சேமிக்கிறது, இது எழுதுபவர் தோல்வியடைந்தால் தரவிழப்பிற்கு வழிவகுக்கலாம், ஆனால் இது ஒத்திசைவு எழுதுகைகள் உட்பட கட்டமைக்கக்கூடிய நிலைத்தன்மை விருப்பங்களை வழங்குகிறது.",
      "விமர்சகர்கள் SlateDB ஒரு உண்மையான தரவுத்தொகுப்பாக இல்லாமல் பொருள் சேமிப்பகத்தின் மீது ஒரு மெல்லிய அப்ஸ்ட்ராக்ஷன் மட்டுமே என்று வாதிடுகின்றனர், மேலும் இது தற்போது செயலாக்கத்திற்கு Rust ஐ தேவைப்படுத்துகிறது, மற்ற நிரலாக்க மொழிகளுக்கு ஆதரவு இல்லாமல் உள்ளது."
    ],
    "points": 138,
    "commentCount": 42,
    "retryCount": 0,
    "time": 1727821083
  },
  {
    "id": 41721567,
    "title": "அமெரிக்க இரண்டாம் உலகப் போரின் குண்டு ஜப்பான் விமான நிலையத்தில் வெடித்து, டாக்ஸிவேவில் பெரிய குழியை உருவாக்கியது",
    "originLink": "https://www.cnn.com/2024/10/02/travel/wwii-bomb-miyazaki-airport-japan-scli-intl/index.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41721567",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "அமெரிக்காவின் இரண்டாம் உலகப் போரின் வெடிக்காத குண்டு ஜப்பானிய விமான நிலையத்தில் வெடித்தது, ஒரு டாக்ஸிவேவில் பெரிய குழியை ஏற்படுத்தியது, ஆனால் அதிர்ஷ்டவசமாக, எந்தக் காயங்களும் பதிவாகவில்லை.",
      "இந்த சம்பவம் பாதுகாப்பு கேமராக்களிலிருந்து டிஜிட்டல் காட்சிகளை மீட்டெடுப்பதில் உள்ள சவால்கள் மற்றும் ஜப்பான், லண்டன், ஜெர்மனி, பிரான்ஸ் போன்ற நாடுகளில் வெடிக்காத ஆயுதங்கள் பரவலாக உள்ள பிரச்சினையைப் பற்றிய விவாதங்களை மீண்டும் தூண்டியுள்ளது.",
      "பழைய வெடிபொருட்களின் நிலைத்தன்மை குறித்து கவலைகள் எழுந்தன, ஏனெனில் அவை காலப்போக்கில் அதிகம் உணர்திறன் கொண்டதாக மாறி, முக்கியமான ஆபத்துகளை ஏற்படுத்தக்கூடும்."
    ],
    "points": 136,
    "commentCount": 115,
    "retryCount": 0,
    "time": 1727882531
  }
]
