[
  {
    "id": 41713063,
    "title": "COBOL está “morto” há tanto tempo que meu avô escreveu sobre isso",
    "originLink": "https://wumpus-cave.net/post/2024/10/2024-10-01-death-of-cobol/index.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41713063",
    "commentBody": "",
    "originSummary": [
      "Apesar de ter sido declarado \"morto\" em 1992, o Cobol persistiu e superou muitas linguagens de programação de quarta geração (4GLs), demonstrando sua resiliência e relevância contínua.",
      "As consequências do problema do Y2K desempenharam um papel significativo na revitalização do Cobol, criando uma demanda por programadores familiarizados com a linguagem e destacando sua importância em sistemas legados.",
      "A narrativa sugere cautela ao rotular linguagens de programação como 'mortas', especialmente aquelas com uma base de usuários substancial, pois elas podem continuar a ter aplicações práticas e influência."
    ],
    "commentSummary": [
      "COBOL, muitas vezes considerado obsoleto, continua essencial para sistemas legados em setores como folha de pagamento e bancos devido à sua integração com sistemas mainframe confiáveis. Apesar de ter sido projetado para ser legível por humanos, o COBOL exige um conhecimento significativo do domínio para traduzir com precisão os processos de negócios em código. A relevância contínua da linguagem é sublinhada pela necessidade de programadores para manter os sistemas existentes, especialmente com desafios como o problema do ano 2038 no horizonte."
    ],
    "points": 404,
    "commentCount": 396,
    "retryCount": 0,
    "time": 1727810738
  },
  {
    "id": 41719531,
    "title": "Eu criei um jogo que você pode jogar sem que ninguém saiba (sem visuais/som)",
    "originLink": "https://apps.apple.com/us/app/tik/id6720712299",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41719531",
    "commentBody": "",
    "originSummary": [
      "A new iOS game called Tik! has been launched, featuring gameplay that relies solely on haptic feedback, with no visuals or sound.",
      "Os jogadores devem replicar um ritmo de vibrações tocando na tela, oferecendo um desafio único em termos de tempo e coordenação.",
      "Ao ser projetado, o jogo foi pensado para ser uma distração discreta, permitindo que os usuários joguem sem olhar para o telefone, e o feedback é incentivado."
    ],
    "commentSummary": [
      "A new game has been developed that can be played discreetly without visuals or sound, focusing on strict timing for a challenging experience.",
      "Os desenvolvedores estão considerando melhorias com base no feedback dos usuários, como adicionar intervalos constantes, uma opção de retorno ao menu e uma maneira de visualizar ou pular ritmos.",
      "O jogo está atualmente disponível no iOS, com planos para futuras atualizações, incluindo níveis de dificuldade, novos recursos e uma possível versão para Android."
    ],
    "points": 335,
    "commentCount": 223,
    "retryCount": 0,
    "time": 1727869709
  },
  {
    "id": 41712885,
    "title": "Não construa seu castelo nos reinos de outras pessoas (2021)",
    "originLink": "https://howtomarketagame.com/2021/11/01/dont-build-your-castle-in-other-peoples-kingdoms/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41712885",
    "commentBody": "",
    "originSummary": [
      "Plataformas de mídia social frequentemente alteram termos ou introduzem planos pagos inesperadamente, como visto com o programa \"Boost\" da Twitch e a quase proibição de conteúdo adulto no OnlyFans, representando riscos para criadores de conteúdo. - O principal conselho é evitar construir um negócio exclusivamente em plataformas externas; em vez disso, priorize o desenvolvimento de seu próprio site, lista de e-mails e propriedade intelectual. - Criadores devem usar as mídias sociais para ganhar seguidores, mas garantir que os redirecionem para suas próprias plataformas, mantendo controle sobre seu público e conteúdo, apesar das mudanças nas plataformas."
    ],
    "commentSummary": [
      "A frase 'Não construa seu castelo nos reinos de outras pessoas' aconselha a não depender inteiramente de grandes plataformas para presença digital devido ao seu controle sobre o acesso e ao potencial para mudanças repentinas de regras.",
      "Ele sugere a criação de espaços independentes, como um site pessoal ou uma lista de e-mails, para manter o controle e a conexão direta com o público.",
      "Essa estratégia minimiza a dependência de plataformas externas e protege contra mudanças inesperadas que poderiam afetar as operações comerciais."
    ],
    "points": 331,
    "commentCount": 223,
    "retryCount": 0,
    "time": 1727809856
  },
  {
    "id": 41715762,
    "title": "Matemática dos Três aos Sete",
    "originLink": "https://www.thepsmiths.com/p/review-math-from-three-to-seven-by",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41715762",
    "commentBody": "",
    "originSummary": [
      "\"Matemática dos Três aos Sete\" de Alexander Zvonkin introduz a ideia de círculos matemáticos para pré-escolares, focando na resolução de problemas em vez do aprendizado tradicional por repetição.",
      "O livro, estruturado como um diário, compartilha as experiências de Zvonkin ao ensinar conceitos matemáticos complexos a crianças pequenas por meio de métodos lúdicos, destacando suas habilidades cognitivas únicas.",
      "Os variados sucessos de Zvonkin com diferentes grupos de crianças destacam a individualidade do processo de aprendizagem de cada criança e a importância de cultivar o amor pela resolução de problemas."
    ],
    "commentSummary": [
      "O artigo analisa 'Matemática dos Três aos Sete', com foco em manter o interesse das crianças pela matemática à medida que envelhecem.",
      "Comentadores sugerem métodos envolventes, como usar recursos online (por exemplo, Khan Academy, 3Blue1Brown) e participar de círculos de matemática para fomentar o interesse.",
      "A discussão inclui o papel da paixão na aprendizagem de matemática e considera influências culturais e educacionais, referenciando a ênfase histórica em matemática e ciência na educação soviética."
    ],
    "points": 312,
    "commentCount": 176,
    "retryCount": 0,
    "time": 1727827125
  },
  {
    "id": 41714672,
    "title": "Quem está fingindo estar contratando?",
    "originLink": "https://news.ycombinator.com/item?id=41714672",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41714672",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Muitas empresas mantêm vagas de emprego abertas durante congelamentos de contratações para projetar saúde financeira aos investidores, apesar de não estarem contratando ativamente.",
      "Essa prática frustra os candidatos a emprego, pois as empresas podem ignorar currículos recomendados ou conduzir entrevistas sem a intenção de contratar, levando a perda de tempo e dados econômicos enganosos.",
      "Ambas as startups e grandes empresas se envolvem nesse comportamento, usando anúncios de emprego para sinalizar crescimento ou manter um banco de candidatos, impactando negativamente a saúde mental dos candidatos e complicando o processo de contratação."
    ],
    "points": 289,
    "commentCount": 99,
    "retryCount": 0,
    "time": 1727819690
  },
  {
    "id": 41721668,
    "title": "As Mutexes Mais Rápidas",
    "originLink": "https://justine.lol/mutex/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41721668",
    "commentBody": "",
    "originSummary": [
      "Biblioteca de mutex do Cosmopolitan Libc demonstra desempenho superior em cenários de alta contenção, superando o SRWLOCK da Microsoft em 2,75x e o Cygwin em 65x no Windows, e o glibc em 3x e o musl libc em 11x no Linux.",
      "A eficiência da biblioteca é atribuída à sua integração com a biblioteca nsync, que emprega técnicas avançadas como Compare-And-Swap (CAS) otimista e futexes para reduzir o uso da CPU e a contenção.",
      "O projeto é apoiado por vários patrocinadores, incluindo GitHub, Patreon, o programa MIECO da Mozilla e a comunidade de desenvolvedores, destacando seu desenvolvimento colaborativo e o apoio da comunidade."
    ],
    "commentSummary": [
      "A discussão foca nas implementações de mutex, com críticas aos métodos de benchmarking, sugerindo que o desempenho no mundo real deve ser testado em grandes programas multithread. Há um debate sobre os méritos de diferentes tipos de mutex, como spinlocks, e a importância do desempenho sem contenção, destacando as melhorias de mutex da biblioteca Cosmopolitan C. A conversa também explora o uso de passagem de mensagens versus mutexes para concorrência, com alguns defendendo abstrações como filas para facilitar o raciocínio e a depuração."
    ],
    "points": 277,
    "commentCount": 108,
    "retryCount": 0,
    "time": 1727883105
  },
  {
    "id": 41715277,
    "title": "Como o CERN serve 1EB de dados via FUSE [vídeo]",
    "originLink": "https://kernel-recipes.org/en/2024/schedule/how-cern-serves-1eb-of-data-via-fuse/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41715277",
    "commentBody": "",
    "originSummary": [
      "CERN gerencia um enorme 1 exabyte (EB) de dados do Grande Colisor de Hádrons, utilizando projetos de código aberto como CERNBox e EOS para um manuseio eficiente dos dados.",
      "O Grupo de Armazenamento e Gestão de Dados do CERN é responsável pelo arquivamento de dados, distribuição e garantia de acesso seguro para mais de 30.000 usuários.",
      "FUSE (Filesystem in Userspace) é utilizado para facilitar o acesso global aos dados, melhorando a acessibilidade e a usabilidade dos dados."
    ],
    "commentSummary": [
      "CERN gerencia um enorme 1 exabyte (EB) de dados usando FUSE (Filesystem in Userspace), enfrentando desafios como problemas de inotify dentro de contêineres Docker.",
      "Asseguram a utilização do Rucio para uma gestão eficiente de dados em diversos sistemas de armazenamento, garantindo a distribuição global de dados com backups em fita e réplicas fora do local.",
      "Apesar das restrições orçamentárias e das recentes mudanças na gestão favorecendo a Microsoft, o CERN continua a ser um centro de inovação científica, contribuindo significativamente para a ciência e tecnologia abertas, e é altamente valorizado por suas descobertas científicas e avanços em ciência de dados."
    ],
    "points": 210,
    "commentCount": 94,
    "retryCount": 0,
    "time": 1727823922
  },
  {
    "id": 41714750,
    "title": "Arquivo de Catálogos da Radio Shack (1939-2011)",
    "originLink": "https://www.radioshackcatalogs.com/?_hsenc=p2ANqtz-9H5PQMgh6cUobaKL8FZ3-Ib1lk2jXz-BBrutnvv14LwcLObCTepV_IHs6nj83QW1bzJZzkyQpOm2OVPZbBmOmtzIMoRw&_hsmi=327012423",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41714750",
    "commentBody": "",
    "originSummary": [
      "RadioShackCatalogs.com é um arquivo digital que preserva a história da RadioShack de 1921 a 2011, apresentando catálogos de 1939 a 2011.",
      "A página exibe uma variedade de produtos, incluindo estéreos de alta fidelidade, equipamentos de comunicação, computadores e componentes eletrônicos, destacando marcas como Tandy, Realistic e TRS-80.",
      "Os catálogos são exibidos em um formato de virar páginas, proporcionando uma experiência nostálgica da evolução tecnológica da RadioShack, e o site convida contribuições de catálogos faltantes ou apoio financeiro para manutenção."
    ],
    "commentSummary": [
      "O Arquivo de Catálogos da Radio Shack (1939-2011) despertou nostalgia e discussões sobre sua influência nos entusiastas de eletrônicos.",
      "A mudança de eletrônicos DIY para uma loja de celulares é vista como uma decisão ruim, contribuindo para o declínio da Radio Shack.",
      "Ao oferecer uma lista selecionada de peças e ferramentas, o catálogo era uma fonte de inspiração, uma experiência física agora perdida na era das lojas online como Digikey e Mouser."
    ],
    "points": 199,
    "commentCount": 80,
    "retryCount": 0,
    "time": 1727820297
  },
  {
    "id": 41715747,
    "title": "Norte de Ontário: homem desvenda lenda local e encontra bebida alcoólica vintage no fundo do lago",
    "originLink": "https://www.cbc.ca/news/canada/sudbury/larder-lake-local-legend-sunken-taxi-vintage-liquor-1.7332124",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41715747",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Um homem no norte de Ontário descobriu um carro REO Flying Cloud de 1929 com seis garrafas de uísque no fundo de um lago, resolvendo uma lenda local.",
      "A descoberta gerou discussões sobre a cobertura da Canadian Broadcasting Corporation (CBC) e seu viés político percebido, com comentaristas compartilhando experiências pessoais e opiniões.",
      "O carro permanece submerso para que os mergulhadores possam explorá-lo, pois é considerado muito frágil para ser removido."
    ],
    "points": 193,
    "commentCount": 54,
    "retryCount": 0,
    "time": 1727826988
  },
  {
    "id": 41714285,
    "title": "Juno para YouTube foi removido da App Store",
    "originLink": "https://christianselig.com/2024/10/juno-removed/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41714285",
    "commentBody": "",
    "originSummary": [
      "Juno for YouTube, um aplicativo de visualização web que modificava o site do YouTube para um visual 'visionOS', foi removido da App Store em 1º de outubro de 2024, devido a violações das diretrizes alegadas pelo YouTube.",
      "A remoção do aplicativo foi resultado de desentendimentos não resolvidos entre o desenvolvedor e o YouTube, sem planos de escalonamento adicional por parte do desenvolvedor.",
      "Os usuários existentes podem continuar usando o Juno até que possíveis atualizações futuras do YouTube o tornem não funcional, e o desenvolvedor expressou gratidão pelo apoio dos usuários do Vision Pro."
    ],
    "commentSummary": [
      "Juno para YouTube, um aplicativo desenvolvido pelo criador do aplicativo Apollo para Reddit, foi removido da App Store devido a supostas violações de diretrizes pelo YouTube.",
      "A aplicação, que era uma visualização web e não bloqueava anúncios, destaca as dificuldades que os desenvolvedores enfrentam com as grandes empresas de tecnologia e suas políticas rigorosas.",
      "Esta situação enfatiza o crescente apelo por lojas de aplicativos alternativas, à medida que muitos usuários e desenvolvedores sentem que as plataformas priorizam seu controle em detrimento dos benefícios dos usuários."
    ],
    "points": 175,
    "commentCount": 132,
    "retryCount": 0,
    "time": 1727817525
  },
  {
    "id": 41717050,
    "title": "NixOS é um bom sistema operacional para servidores, exceto quando não é.",
    "originLink": "https://sidhion.com/blog/posts/nixos_server_issues/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41717050",
    "commentBody": "",
    "originSummary": [
      "O autor discute o desafio de reduzir o tamanho padrão de instalação do NixOS, um sistema operacional de servidor, que inicialmente ocupa cerca de 900MB de espaço em disco. Os esforços para minimizar o NixOS envolveram a remoção de componentes desnecessários como Nix, Perl, Python e certos serviços, alcançando uma redução de aproximadamente 300MB. Apesar dessas reduções, o autor conclui que criar um sistema NixOS mínimo é complexo e sugere que um 'fork' dedicado do NixOS para cenários de servidor pode ser mais eficaz."
    ],
    "commentSummary": [
      "NixOS é reconhecido como um sistema operacional de servidor robusto, mas sua dependência da linguagem Nix é vista como uma desvantagem devido à sua complexidade e falta de recursos amigáveis ao usuário.",
      "Os usuários apreciam o NixOS por suas capacidades fáceis de substituição e reversão do sistema, mas alguns migraram para sistemas mais simples como Debian ou Proxmox devido aos desafios de manutenção.",
      "NixOS fornece lançamentos estáveis a cada seis meses, mas não oferece suporte de longo prazo, o que pode ser uma preocupação para os usuários que buscam estabilidade por períodos prolongados."
    ],
    "points": 163,
    "commentCount": 158,
    "retryCount": 0,
    "time": 1727841977
  },
  {
    "id": 41716975,
    "title": "Nvidia lança o modelo de peso aberto NVLM 1.0 72B",
    "originLink": "https://huggingface.co/nvidia/NVLM-D-72B",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41716975",
    "commentBody": "",
    "originSummary": [
      "NVLM 1.0 Collection introduz modelos de linguagem multimodal de classe fronteiriça que apresentam desempenho excepcional tanto em tarefas de visão-linguagem quanto em tarefas apenas de texto.",
      "Esta coleção representa um avanço significativo na integração do processamento de dados visuais e textuais, destacando as capacidades em evolução dos modelos de IA.",
      "A atualização, feita há apenas dois dias, sugere melhorias contínuas e interesse no desenvolvimento desses modelos sofisticados."
    ],
    "commentSummary": [
      "Nvidia lançou o modelo de peso aberto NVLM 1.0 72B no Hugging Face, derivado do Qwen2-72B-Instruct LLM e do codificador de visão InterViT, com foco na qualidade em vez da escala. O modelo vem em três variantes: apenas decodificador, atenção cruzada e híbrido, mas apenas a versão apenas decodificador está disponível no Hugging Face. Ele é licenciado sob uma licença cc-by-nc-4.0 não comercial, permitindo avaliação, mas não uso comercial, e requer uma quantidade substancial de RAM de GPU, aproximadamente 164GB, para precisão total."
    ],
    "points": 145,
    "commentCount": 53,
    "retryCount": 0,
    "time": 1727840933
  },
  {
    "id": 41714361,
    "title": "O Guia Simples para Construir e Quebrar Hábitos",
    "originLink": "https://alexy.tech/posts/the-simple-guide-to-building-and-breaking-habits/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41714361",
    "commentBody": "",
    "originSummary": [
      "Hábito formação pode ser orientada por objetivos ou focada na identidade, exigindo consistência para se tornar automática. - \"Atrito límbico\" refere-se ao esforço necessário para iniciar um novo comportamento, que pode ser reduzido minimizando o estresse e a fadiga. - Estratégias para construir e quebrar hábitos incluem delimitação de tarefas, otimização do seu dia, aproveitamento da dopamina e experimentação de um teste de 21 dias com metas flexíveis."
    ],
    "commentSummary": [],
    "points": 142,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1727817995
  },
  {
    "id": 41714858,
    "title": "SlateDB – Um banco de dados embutido construído em armazenamento de objetos",
    "originLink": "https://slatedb.io/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41714858",
    "commentBody": "",
    "originSummary": [
      "SlateDB oferece uma durabilidade extremamente alta (99,999999999%) ao utilizar a durabilidade do seu armazenamento de objetos existente, eliminando a necessidade de discos e falhas associadas.",
      "Oferece opções de desempenho ajustáveis para baixa latência, eficiência de custos ou durabilidade aprimorada, e suporta um único escritor com múltiplos leitores, prevenindo problemas com escritores zumbis.",
      "Desenvolvido em Rust, o SlateDB é uma biblioteca incorporável compatível com várias linguagens de programação, e pode ser facilmente integrada adicionando-a às suas dependências no Cargo.toml."
    ],
    "commentSummary": [
      "SlateDB é um banco de dados embutido projetado para armazenamento de objetos, assemelhando-se a uma 'arquitetura lakehouse' similar ao Apache Iceberg, e é usado para processamento de fluxo e funções serverless.",
      "Ele armazena temporariamente as gravações em um log na memória antes de confirmar no armazenamento de objetos, o que pode levar à perda de dados se o escritor falhar, embora ofereça opções de durabilidade configuráveis, incluindo gravações síncronas.",
      "Críticos argumentam que o SlateDB é mais uma abstração leve sobre armazenamento de objetos do que um banco de dados verdadeiro, e atualmente requer Rust para implementação, não oferecendo suporte para outras linguagens de programação."
    ],
    "points": 138,
    "commentCount": 42,
    "retryCount": 0,
    "time": 1727821083
  },
  {
    "id": 41721567,
    "title": "Uma bomba americana da Segunda Guerra Mundial explode em aeroporto japonês, causando grande cratera na pista de táxi",
    "originLink": "https://www.cnn.com/2024/10/02/travel/wwii-bomb-miyazaki-airport-japan-scli-intl/index.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41721567",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Uma bomba americana não detonada da Segunda Guerra Mundial explodiu em um aeroporto japonês, causando uma grande cratera em uma pista de táxi, mas felizmente, não foram relatados feridos.",
      "A ocorrência reacendeu discussões sobre os desafios de recuperar imagens digitais de câmeras de segurança e o problema generalizado de artefatos explosivos não detonados em países como Japão, Londres, Alemanha e França.",
      "Preocupações foram levantadas sobre a estabilidade de explosivos antigos, pois eles podem se tornar mais sensíveis com o tempo, representando riscos significativos."
    ],
    "points": 136,
    "commentCount": 115,
    "retryCount": 0,
    "time": 1727882531
  }
]
