[
  {
    "id": 41713063,
    "title": "COBOL ha estado \"muerto\" durante tanto tiempo, que mi abuelo escribió sobre ello",
    "originLink": "https://wumpus-cave.net/post/2024/10/2024-10-01-death-of-cobol/index.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41713063",
    "commentBody": "",
    "originSummary": [
      "A pesar de haber sido declarado \"muerto\" en 1992, Cobol ha persistido y ha superado a muchos lenguajes de programación de cuarta generación (4GL), demostrando su resistencia y relevancia continua.",
      "La problemática del Y2K desempeñó un papel significativo en la revitalización de Cobol al crear una demanda de programadores familiarizados con el lenguaje, destacando su importancia en los sistemas heredados.",
      "La narrativa sugiere precaución al etiquetar los lenguajes de programación como 'muertos', especialmente aquellos con una base de usuarios sustancial, ya que pueden seguir teniendo aplicaciones prácticas e influencia."
    ],
    "commentSummary": [
      "COBOL, a menudo considerado obsoleto, sigue siendo esencial para los sistemas heredados en sectores como la nómina y la banca debido a su integración con sistemas mainframe confiables. A pesar de estar diseñado para ser legible por humanos, COBOL requiere un conocimiento significativo del dominio para traducir con precisión los procesos empresariales en código. La relevancia continua del lenguaje se subraya por la necesidad de programadores para mantener los sistemas existentes, especialmente con desafíos como el problema del año 2038 en el horizonte."
    ],
    "points": 404,
    "commentCount": 396,
    "retryCount": 0,
    "time": 1727810738
  },
  {
    "id": 41719531,
    "title": "Hice un juego que puedes jugar sin que nadie lo sepa (sin imágenes/sonido)",
    "originLink": "https://apps.apple.com/us/app/tik/id6720712299",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41719531",
    "commentBody": "",
    "originSummary": [
      "Se ha lanzado un nuevo juego para iOS llamado Tik!, que presenta una jugabilidad que se basa únicamente en la retroalimentación háptica, sin imágenes ni sonido.",
      "Los jugadores deben replicar un ritmo de vibraciones tocando la pantalla, ofreciendo un desafío único en cuanto a tiempo y coordinación.",
      "La idea del juego era ser una distracción discreta, permitiendo a los usuarios jugar sin mirar su teléfono, y se fomenta la retroalimentación."
    ],
    "commentSummary": [
      "Se ha desarrollado un nuevo juego que se puede jugar discretamente sin imágenes ni sonido, centrándose en un estricto control del tiempo para una experiencia desafiante.",
      "El desarrollador está considerando mejoras basadas en los comentarios de los usuarios, como agregar intervalos constantes, una opción para volver al menú y una forma de visualizar o saltar ritmos.",
      "La aplicación está actualmente disponible en iOS, con planes para futuras actualizaciones, incluyendo niveles de dificultad, nuevas características y una posible versión para Android."
    ],
    "points": 335,
    "commentCount": 223,
    "retryCount": 0,
    "time": 1727869709
  },
  {
    "id": 41712885,
    "title": "No construyas tu castillo en los reinos de otras personas (2021)",
    "originLink": "https://howtomarketagame.com/2021/11/01/dont-build-your-castle-in-other-peoples-kingdoms/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41712885",
    "commentBody": "",
    "originSummary": [
      "Las plataformas de redes sociales a menudo alteran los términos o introducen planes de pago inesperadamente, como se vio con el programa \"Boost\" de Twitch y la casi prohibición de contenido para adultos en OnlyFans, lo que representa riesgos para los creadores de contenido.- El consejo principal es evitar construir un negocio únicamente en plataformas externas; en su lugar, priorice desarrollar su propio sitio web, lista de correo y propiedad intelectual.- Los creadores deben usar las redes sociales para ganar seguidores, pero asegurarse de redirigirlos a sus propias plataformas, manteniendo el control sobre su audiencia y contenido a pesar de los cambios en las plataformas."
    ],
    "commentSummary": [
      "La frase 'No construyas tu castillo en los reinos de otras personas' aconseja no depender completamente de grandes plataformas para la presencia digital debido a su control sobre el acceso y el potencial de cambios repentinos en las reglas.",
      "Propone crear espacios independientes, como un sitio web personal o una lista de correo, para mantener el control y la conexión directa con la audiencia.",
      "Esta estrategia minimiza la dependencia de plataformas externas y protege contra cambios inesperados que podrían afectar las operaciones comerciales."
    ],
    "points": 331,
    "commentCount": 223,
    "retryCount": 0,
    "time": 1727809856
  },
  {
    "id": 41715762,
    "title": "Matemáticas de tres a siete",
    "originLink": "https://www.thepsmiths.com/p/review-math-from-three-to-seven-by",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41715762",
    "commentBody": "",
    "originSummary": [
      "El libro 'Math from Three to Seven' de Alexander Zvonkin introduce la idea de círculos matemáticos para niños en edad preescolar, centrándose en la resolución de problemas en lugar del aprendizaje tradicional de memoria.",
      "La obra, estructurada como un diario, comparte las experiencias de Zvonkin al enseñar conceptos matemáticos complejos a niños pequeños mediante métodos lúdicos, destacando sus habilidades cognitivas únicas.",
      "El éxito variado de Zvonkin con diferentes grupos de niños subraya la individualidad del proceso de aprendizaje de cada niño y la importancia de fomentar el amor por la resolución de problemas."
    ],
    "commentSummary": [
      "La reseña del artículo \"Matemáticas de tres a siete\" se centra en mantener el interés de los niños en las matemáticas a medida que crecen.",
      "Los comentaristas sugieren métodos atractivos como el uso de recursos en línea (por ejemplo, Khan Academy, 3Blue1Brown) y la participación en círculos de matemáticas para fomentar el interés.",
      "La discusión incluye el papel de la pasión en el aprendizaje de las matemáticas y considera las influencias culturales y educativas, haciendo referencia al énfasis histórico en las matemáticas y las ciencias en la educación soviética."
    ],
    "points": 312,
    "commentCount": 176,
    "retryCount": 0,
    "time": 1727827125
  },
  {
    "id": 41714672,
    "title": "¿Quién está fingiendo estar contratando?",
    "originLink": "https://news.ycombinator.com/item?id=41714672",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41714672",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Muchas empresas mantienen ofertas de trabajo abiertas durante las congelaciones de contratación para proyectar salud financiera a los inversores, a pesar de no estar contratando activamente.",
      "Esta práctica frustra a los buscadores de empleo, ya que las empresas pueden ignorar los CV recomendados o realizar entrevistas sin la intención de contratar, lo que lleva a una pérdida de tiempo y a datos económicos engañosos.",
      "Ambas, las startups y las grandes empresas, participan en este comportamiento, utilizando ofertas de trabajo para señalar crecimiento o mantener una reserva de candidatos, lo que impacta negativamente en la salud mental de los buscadores de empleo y complica el proceso de contratación."
    ],
    "points": 289,
    "commentCount": 99,
    "retryCount": 0,
    "time": 1727819690
  },
  {
    "id": 41721668,
    "title": "Los mutexes más rápidos",
    "originLink": "https://justine.lol/mutex/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41721668",
    "commentBody": "",
    "originSummary": [
      "Cosmopolitan Libc's mutex library demuestra un rendimiento superior en escenarios de alta contención, superando a SRWLOCK de Microsoft por 2.75 veces y a Cygwin por 65 veces en Windows, y a glibc por 3 veces y a musl libc por 11 veces en Linux.",
      "La eficiencia de la biblioteca se atribuye a su integración con la biblioteca nsync, que emplea técnicas avanzadas como Compare-And-Swap (CAS) optimista y futexes para reducir el uso de CPU y la contención.",
      "El proyecto cuenta con el apoyo de varios patrocinadores, incluidos GitHub, Patreon, el programa MIECO de Mozilla y la comunidad de desarrolladores, lo que destaca su desarrollo colaborativo y el respaldo de la comunidad."
    ],
    "commentSummary": [
      "La discusión se centra en las implementaciones de mutex, con críticas a los métodos de evaluación comparativa, sugiriendo que el rendimiento en el mundo real debe probarse en programas grandes y multihilo. Hay un debate sobre los méritos de diferentes tipos de mutex, como los spinlocks, y la importancia del rendimiento sin contención, destacando las mejoras de mutex de la biblioteca Cosmopolitan C. La conversación también explora el uso de paso de mensajes frente a mutexes para la concurrencia, con algunos abogando por abstracciones como colas para facilitar el razonamiento y la depuración."
    ],
    "points": 277,
    "commentCount": 108,
    "retryCount": 0,
    "time": 1727883105
  },
  {
    "id": 41715277,
    "title": "Cómo CERN sirve 1EB de datos a través de FUSE [video]",
    "originLink": "https://kernel-recipes.org/en/2024/schedule/how-cern-serves-1eb-of-data-via-fuse/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41715277",
    "commentBody": "",
    "originSummary": [
      "CERN gestiona un enorme exabyte (EB) de datos del Gran Colisionador de Hadrones, utilizando proyectos de código abierto como CERNBox y EOS para un manejo eficiente de los datos.",
      "El Grupo de Almacenamiento y Gestión de Datos en el CERN es responsable del archivo de datos, su distribución y de garantizar el acceso seguro para más de 30,000 usuarios.",
      "FUSE (Filesystem in Userspace) se utiliza para facilitar el acceso global a los datos, mejorando la accesibilidad y usabilidad de los mismos."
    ],
    "commentSummary": [
      "CERN gestiona un enorme exabyte (EB) de datos utilizando FUSE (Filesystem in Userspace), enfrentando desafíos como problemas de inotify dentro de contenedores Docker.",
      "Utilizan Rucio para una gestión eficiente de datos a través de varios sistemas de almacenamiento, asegurando la distribución global de datos con copias de seguridad en cinta y réplicas fuera del sitio.",
      "A pesar de las restricciones presupuestarias y los recientes cambios en la gestión que favorecen a Microsoft, el CERN sigue siendo un centro de innovación científica, contribuyendo significativamente a la ciencia y la tecnología abiertas, y es altamente valorado por sus descubrimientos científicos y avances en ciencia de datos."
    ],
    "points": 210,
    "commentCount": 94,
    "retryCount": 0,
    "time": 1727823922
  },
  {
    "id": 41714750,
    "title": "Archivo de Catálogos de Radio Shack (1939-2011)",
    "originLink": "https://www.radioshackcatalogs.com/?_hsenc=p2ANqtz-9H5PQMgh6cUobaKL8FZ3-Ib1lk2jXz-BBrutnvv14LwcLObCTepV_IHs6nj83QW1bzJZzkyQpOm2OVPZbBmOmtzIMoRw&_hsmi=327012423",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41714750",
    "commentBody": "",
    "originSummary": [
      "RadioShackCatalogs.com es un archivo digital que preserva la historia de RadioShack desde 1921 hasta 2011, con catálogos desde 1939 hasta 2011.",
      "El sitio exhibe una variedad de productos, incluidos estéreos de alta fidelidad, equipos de comunicación, computadoras y componentes electrónicos, destacando marcas como Tandy, Realistic y TRS-80.",
      "Los catálogos se muestran en un formato de pasar páginas, proporcionando una experiencia nostálgica de la evolución tecnológica de RadioShack, y el sitio invita a contribuciones de catálogos faltantes o apoyo financiero para el mantenimiento."
    ],
    "commentSummary": [
      "La Radio Shack Catalog Archive (1939-2011) ha despertado nostalgia y debates sobre su influencia en los entusiastas de la electrónica.",
      "La transición de la electrónica DIY a una tienda de teléfonos celulares se considera una mala decisión, contribuyendo al declive de Radio Shack.",
      "La revista era una fuente de inspiración, ofreciendo una lista seleccionada de piezas y herramientas, una experiencia física que ahora se extraña en la era de las tiendas en línea como Digikey y Mouser."
    ],
    "points": 199,
    "commentCount": 80,
    "retryCount": 0,
    "time": 1727820297
  },
  {
    "id": 41715747,
    "title": "Norteño de Ontario resuelve leyenda local y encuentra licor vintage en el fondo del lago",
    "originLink": "https://www.cbc.ca/news/canada/sudbury/larder-lake-local-legend-sunken-taxi-vintage-liquor-1.7332124",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41715747",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Un hombre en el norte de Ontario descubrió un coche REO Flying Cloud de 1929 con seis botellas de whisky en el fondo de un lago, resolviendo una leyenda local.",
      "La revelación ha generado debates sobre la cobertura de la Canadian Broadcasting Corporation (CBC) y su percibido sesgo político, con comentaristas compartiendo experiencias y opiniones personales.",
      "La carro permanece bajo el agua para que los buzos la exploren, ya que se considera demasiado frágil para retirarla."
    ],
    "points": 193,
    "commentCount": 54,
    "retryCount": 0,
    "time": 1727826988
  },
  {
    "id": 41714285,
    "title": "Juno para YouTube ha sido eliminado de la App Store",
    "originLink": "https://christianselig.com/2024/10/juno-removed/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41714285",
    "commentBody": "",
    "originSummary": [
      "Juno para YouTube, una aplicación de vista web que modificaba el sitio web de YouTube para un aspecto \"visionOS\", fue eliminada de la App Store el 1 de octubre de 2024, debido a violaciones de las directrices reclamadas por YouTube.",
      "La eliminación de la aplicación fue el resultado de desacuerdos no resueltos entre el desarrollador y YouTube, sin planes de una mayor escalada por parte del desarrollador.",
      "Los usuarios existentes pueden seguir usando Juno hasta que posibles futuras actualizaciones de YouTube lo hagan no funcional, y el desarrollador expresó su gratitud por el apoyo de los usuarios de Vision Pro."
    ],
    "commentSummary": [
      "Juno para YouTube, una aplicación desarrollada por el creador de la aplicación Apollo para Reddit, ha sido eliminada de la App Store debido a supuestas violaciones de las directrices por parte de YouTube.",
      "La aplicación, que era una vista web y no bloqueaba anuncios, subraya las dificultades que los desarrolladores encuentran con las grandes empresas tecnológicas y sus estrictas políticas.",
      "Esta situación enfatiza la creciente demanda de tiendas de aplicaciones alternativas, ya que muchos usuarios y desarrolladores sienten que las plataformas priorizan su control sobre los beneficios para los usuarios."
    ],
    "points": 175,
    "commentCount": 132,
    "retryCount": 0,
    "time": 1727817525
  },
  {
    "id": 41717050,
    "title": "NixOS es un buen sistema operativo para servidores, excepto cuando no lo es",
    "originLink": "https://sidhion.com/blog/posts/nixos_server_issues/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41717050",
    "commentBody": "",
    "originSummary": [
      "El autor discute el desafío de reducir el tamaño de instalación predeterminado de NixOS, un sistema operativo para servidores, que inicialmente ocupa alrededor de 900MB de espacio en disco. Los esfuerzos para minimizar NixOS involucraron la eliminación de componentes innecesarios como Nix, Perl, Python y ciertos servicios, logrando una reducción de aproximadamente 300MB. A pesar de estas reducciones, el autor concluye que crear un sistema NixOS mínimo es complejo y sugiere que un \"fork\" dedicado de NixOS para escenarios de servidores podría ser más efectivo."
    ],
    "commentSummary": [
      "NixOS es reconocido como un sistema operativo de servidor robusto, pero su dependencia del lenguaje Nix se considera una desventaja debido a su complejidad y falta de características amigables para el usuario.",
      "Los usuarios aprecian NixOS por sus capacidades de fácil reemplazo y reversión del sistema, aunque algunos han hecho la transición a sistemas más simples como Debian o Proxmox debido a los desafíos de mantenimiento.",
      "NixOS proporciona versiones estables cada seis meses, pero no ofrece soporte a largo plazo, lo que puede ser una preocupación para los usuarios que buscan estabilidad durante períodos prolongados."
    ],
    "points": 163,
    "commentCount": 158,
    "retryCount": 0,
    "time": 1727841977
  },
  {
    "id": 41716975,
    "title": "Nvidia lanza el modelo de pesos abiertos NVLM 1.0 72B",
    "originLink": "https://huggingface.co/nvidia/NVLM-D-72B",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41716975",
    "commentBody": "",
    "originSummary": [
      "NVLM 1.0 Collection introduce modelos de lenguaje multimodal de clase frontera que funcionan excepcionalmente bien tanto en tareas de visión-lenguaje como en tareas solo de texto.",
      "Esta colección representa un avance significativo en la integración del procesamiento de datos visuales y textuales, destacando las capacidades en evolución de los modelos de IA.",
      "La actualización, realizada hace solo dos días, sugiere mejoras continuas e interés en el desarrollo de estos modelos sofisticados."
    ],
    "commentSummary": [
      "Nvidia ha lanzado el modelo de peso abierto NVLM 1.0 72B en Hugging Face, derivado del Qwen2-72B-Instruct LLM y el codificador de visión InterViT, con un enfoque en la calidad sobre la escala. El modelo viene en tres variantes: solo decodificador, atención cruzada e híbrido, pero solo la versión de solo decodificador está disponible en Hugging Face. Está licenciado bajo una licencia no comercial cc-by-nc-4.0, que permite la evaluación pero no el uso comercial, y requiere una cantidad sustancial de RAM de GPU, aproximadamente 164GB, para una precisión completa."
    ],
    "points": 145,
    "commentCount": 53,
    "retryCount": 0,
    "time": 1727840933
  },
  {
    "id": 41714361,
    "title": "La guía simple para construir y romper hábitos",
    "originLink": "https://alexy.tech/posts/the-simple-guide-to-building-and-breaking-habits/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41714361",
    "commentBody": "",
    "originSummary": [
      "Formar hábitos puede ser orientado a objetivos o enfocado en la identidad, requiriendo consistencia para volverse automático.- \"Fricción límbica\" se refiere al esfuerzo necesario para comenzar un nuevo comportamiento, que puede reducirse minimizando el estrés y la fatiga.- Las estrategias para construir y romper hábitos incluyen la delimitación de tareas, la optimización de tu día, aprovechar la dopamina y probar un ensayo de 21 días con objetivos flexibles."
    ],
    "commentSummary": [],
    "points": 142,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1727817995
  },
  {
    "id": 41714858,
    "title": "SlateDB: una base de datos incrustada construida sobre almacenamiento de objetos",
    "originLink": "https://slatedb.io/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41714858",
    "commentBody": "",
    "originSummary": [
      "SlateDB proporciona una durabilidad extremadamente alta (99.999999999%) al utilizar la durabilidad de su almacén de objetos existente, eliminando la necesidad de discos y fallos asociados.",
      "Ofrece opciones de rendimiento ajustables para baja latencia, eficiencia de costos o durabilidad mejorada, y admite un solo escritor con múltiples lectores, previniendo problemas con escritores zombis.",
      "Desarrollado en Rust, SlateDB es una biblioteca embebible compatible con múltiples lenguajes de programación, y se puede integrar fácilmente añadiéndola a tus dependencias en Cargo.toml."
    ],
    "commentSummary": [
      "SlateDB es una base de datos incrustada diseñada para el almacenamiento de objetos, que se asemeja a una \"arquitectura de lakehouse\" similar a Apache Iceberg, y se utiliza para el procesamiento de flujos y funciones sin servidor.",
      "Almacena temporalmente las escrituras en un registro en memoria antes de comprometerse con el almacenamiento de objetos, lo que puede llevar a la pérdida de datos si el escritor falla, aunque ofrece opciones de durabilidad configurables, incluidas las escrituras sincrónicas.",
      "Los críticos argumentan que SlateDB es más una abstracción ligera sobre el almacenamiento de objetos que una verdadera base de datos, y actualmente requiere Rust para su implementación, careciendo de soporte para otros lenguajes de programación."
    ],
    "points": 138,
    "commentCount": 42,
    "retryCount": 0,
    "time": 1727821083
  },
  {
    "id": 41721567,
    "title": "Una bomba estadounidense de la Segunda Guerra Mundial explota en un aeropuerto japonés, causando un gran cráter en la pista de rodaje",
    "originLink": "https://www.cnn.com/2024/10/02/travel/wwii-bomb-miyazaki-airport-japan-scli-intl/index.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41721567",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Una bomba estadounidense sin explotar de la Segunda Guerra Mundial detonó en un aeropuerto japonés, causando un gran cráter en una calle de rodaje, pero afortunadamente, no se reportaron heridos.",
      "La incidencia ha reavivado las discusiones sobre los desafíos de recuperar imágenes digitales de cámaras de seguridad y el problema generalizado de municiones sin detonar en países como Japón, Londres, Alemania y Francia.",
      "Se plantearon preocupaciones sobre la estabilidad de los explosivos antiguos, ya que pueden volverse más sensibles con el tiempo, lo que representa riesgos significativos."
    ],
    "points": 136,
    "commentCount": 115,
    "retryCount": 0,
    "time": 1727882531
  }
]
