[
  {
    "id": 41713063,
    "title": "COBOL har varit \"död\" så länge att min farfar skrev om det",
    "originLink": "https://wumpus-cave.net/post/2024/10/2024-10-01-death-of-cobol/index.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41713063",
    "commentBody": "",
    "originSummary": [
      "Trots att det förklarades \"dött\" 1992 har Cobol överlevt och varat längre än många fjärde generationens programmeringsspråk (4GL), vilket visar dess motståndskraft och fortsatta relevans.",
      "Millenniebuggen spelade en betydande roll i att återuppliva Cobol genom att skapa en efterfrågan på programmerare som var bekanta med språket, vilket betonade dess betydelse i äldre system.",
      "Berättelsen föreslår försiktighet med att märka programmeringsspråk som \"döda,\" särskilt de med en betydande användarbas, eftersom de kan fortsätta att ha praktiska tillämpningar och inflytande."
    ],
    "commentSummary": [
      "COBOL, ofta betraktat som föråldrat, förblir oumbärligt för äldre system inom sektorer som lönehantering och bankverksamhet på grund av dess integration med pålitliga stordatorsystem. Trots att det är utformat för att vara lättläst för människor, kräver COBOL betydande domänkunskap för att korrekt översätta affärsprocesser till kod. Språkets fortsatta relevans understryks av behovet av programmerare för att underhålla befintliga system, särskilt med utmaningar som 2038-problemet i horisonten."
    ],
    "points": 404,
    "commentCount": 396,
    "retryCount": 0,
    "time": 1727810738
  },
  {
    "id": 41719531,
    "title": "Jag har gjort ett spel som du kan spela utan att någon vet (inga visuella/ljud)",
    "originLink": "https://apps.apple.com/us/app/tik/id6720712299",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41719531",
    "commentBody": "",
    "originSummary": [
      "En ny iOS-spel kallad Tik! har lanserats, med spelmekanik som enbart förlitar sig på haptisk feedback, utan visuella eller ljudmässiga inslag.",
      "Spelare måste återskapa en rytm av vibrationer genom att trycka på skärmen, vilket erbjuder en unik utmaning i timing och koordination.",
      "Spelet var utformat för att vara en diskret distraktion, vilket gör det möjligt för användare att spela utan att titta på sin telefon, och feedback uppmuntras."
    ],
    "commentSummary": [
      "En ny spel har utvecklats som kan spelas diskret utan visuella eller ljud, med fokus på strikt timing för en utmanande upplevelse.",
      "Utvecklaren överväger förbättringar baserade på användarfeedback, såsom att lägga till konstanta intervallticks, en menyåtergångsalternativ och ett sätt att visualisera eller hoppa över rytmer.",
      "Spelet är för närvarande tillgängligt på iOS, med planer för framtida uppdateringar, inklusive svårighetsgrader, nya funktioner och en potentiell Android-version."
    ],
    "points": 335,
    "commentCount": 223,
    "retryCount": 0,
    "time": 1727869709
  },
  {
    "id": 41712885,
    "title": "Bygg inte ditt slott i andras kungariken (2021)",
    "originLink": "https://howtomarketagame.com/2021/11/01/dont-build-your-castle-in-other-peoples-kingdoms/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41712885",
    "commentBody": "",
    "originSummary": [
      "Sociala medieplattformar ändrar ofta villkor eller introducerar betalplaner oväntat, som sett med Twitchs \"Boost\"-program och OnlyFans nästan-förbud mot vuxeninnehåll, vilket utgör risker för innehållsskapare. Huvudrådet är att undvika att bygga en verksamhet enbart på externa plattformar; istället bör man prioritera att utveckla sin egen webbplats, e-postlista och immateriella rättigheter. Skapare bör använda sociala medier för att få följare men se till att de omdirigerar dem till sina egna plattformar, vilket bibehåller kontrollen över sin publik och sitt innehåll trots plattformsändringar."
    ],
    "commentSummary": [
      "Uttrycket 'Bygg inte ditt slott i andras kungariken' råder mot att förlita sig helt på stora plattformar för digital närvaro på grund av deras kontroll över tillgång och potential för plötsliga regeländringar.",
      "Det föreslår att skapa oberoende utrymmen, såsom en personlig webbplats eller e-postlista, för att behålla kontrollen och direktkontakt med publiken.",
      "Denna strategi minimerar beroendet av externa plattformar och skyddar mot oväntade förändringar som kan påverka affärsverksamheten."
    ],
    "points": 331,
    "commentCount": 223,
    "retryCount": 0,
    "time": 1727809856
  },
  {
    "id": 41715762,
    "title": "Matematik från tre till sju",
    "originLink": "https://www.thepsmiths.com/p/review-math-from-three-to-seven-by",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41715762",
    "commentBody": "",
    "originSummary": [
      "\"Matematik från tre till sju\" av Alexander Zvonkin introducerar idén om matematiska cirklar för förskolebarn, med fokus på problemlösning snarare än traditionell utantillinlärning.",
      "Boken, som är strukturerad som en dagbok, delar Zvonkins erfarenheter av att lära ut komplexa matematiska koncept till små barn genom lekfulla metoder, och lyfter fram deras unika kognitiva förmågor.",
      "Zvonkis varierade framgångar med olika grupper av barn understryker varje barns individuella inlärningsprocess och vikten av att vårda en kärlek till problemlösning."
    ],
    "commentSummary": [
      "Artikeln recenserar \"Matematik från tre till sju\", med fokus på att bibehålla barns intresse för matematik när de blir äldre.",
      "Kommentatorer föreslår engagerande metoder som att använda online-resurser (t.ex. Khan Academy, 3Blue1Brown) och delta i matematikcirklar för att främja intresse.",
      "Diskussionen inkluderar passionens roll i att lära sig matematik och tar hänsyn till kulturella och utbildningsmässiga influenser, med hänvisning till den historiska betoningen på matematik och vetenskap i sovjetisk utbildning."
    ],
    "points": 312,
    "commentCount": 176,
    "retryCount": 0,
    "time": 1727827125
  },
  {
    "id": 41714672,
    "title": "Vem låtsas anställa?",
    "originLink": "https://news.ycombinator.com/item?id=41714672",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41714672",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Många företag upprätthåller öppna jobbannonser under anställningsstopp för att projicera finansiell hälsa till investerare, trots att de inte aktivt anställer.",
      "Denna praxis frustrerar arbetssökande, eftersom företag kan ignorera rekommenderade CV:n eller genomföra intervjuer utan avsikt att anställa, vilket leder till bortkastad tid och missvisande ekonomiska data.",
      "Såväl startups som stora företag ägnar sig åt detta beteende, genom att använda jobbannonser för att signalera tillväxt eller upprätthålla en kandidatpool, vilket påverkar arbetssökandes mentala hälsa negativt och komplicerar anställningsprocessen."
    ],
    "points": 289,
    "commentCount": 99,
    "retryCount": 0,
    "time": 1727819690
  },
  {
    "id": 41721668,
    "title": "De snabbaste mutexarna",
    "originLink": "https://justine.lol/mutex/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41721668",
    "commentBody": "",
    "originSummary": [
      "Cosmopolitan Libc:s mutex-bibliotek visar överlägsen prestanda i scenarier med hög konkurrens, och överträffar Microsofts SRWLOCK med 2,75 gånger och Cygwin med 65 gånger på Windows, samt glibc med 3 gånger och musl libc med 11 gånger på Linux.",
      "Bibliotekets effektivitet tillskrivs dess integration med nsync-biblioteket, som använder avancerade tekniker som optimistisk Compare-And-Swap (CAS) och futexar för att minska CPU-användning och konkurrens.",
      "Projektet stöds av olika sponsorer, inklusive GitHub, Patreon, Mozillas MIECO-program och utvecklargemenskapen, vilket understryker dess samarbetsutveckling och gemenskapsstöd."
    ],
    "commentSummary": [
      "Diskussionen fokuserar på mutex-implementationer, med kritik av benchmarkmetoder, och föreslår att verklig prestanda bör testas i stora multitrådade program. Det finns en debatt om fördelarna med olika typer av mutexar, såsom spinlocks, och vikten av prestanda utan konkurrens, med betoning på förbättringar i Cosmopolitan C-bibliotekets mutexar. Samtalet utforskar också användningen av meddelandeöverföring kontra mutexar för samtidighet, där vissa förespråkar abstraktioner som köer för enklare resonemang och felsökning."
    ],
    "points": 277,
    "commentCount": 108,
    "retryCount": 0,
    "time": 1727883105
  },
  {
    "id": 41715277,
    "title": "Så här tillhandahåller CERN 1EB data via FUSE [video]",
    "originLink": "https://kernel-recipes.org/en/2024/schedule/how-cern-serves-1eb-of-data-via-fuse/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41715277",
    "commentBody": "",
    "originSummary": [
      "CERN hanterar enorma 1 exabyte (EB) data från Large Hadron Collider, och använder sig av öppen källkodsprojekt som CERNBox och EOS för effektiv datahantering.",
      "Gruppen för lagring och datahantering på CERN ansvarar för dataarkivering, distribution och att säkerställa säker åtkomst för över 30 000 användare.",
      "FUSE (Filesystem in Userspace) används för att underlätta global dataåtkomst, vilket förbättrar tillgängligheten och användbarheten av data."
    ],
    "commentSummary": [
      "CERN hanterar enorma 1 exabyte (EB) data med hjälp av FUSE (Filesystem in Userspace), och står inför utmaningar som inotify-problem inom Docker-containrar.",
      "De använder Rucio för effektiv datahantering över olika lagringssystem, vilket säkerställer global datadistribution med bandbackuper och repliker utanför platsen.",
      "Trots budgetbegränsningar och nyliga ledningsförändringar som gynnar Microsoft fortsätter CERN att vara ett centrum för vetenskaplig innovation, bidra avsevärt till öppen vetenskap och teknik, och är högt värderat för sina vetenskapliga upptäckter och framsteg inom datavetenskap."
    ],
    "points": 210,
    "commentCount": 94,
    "retryCount": 0,
    "time": 1727823922
  },
  {
    "id": 41714750,
    "title": "Radio Shack Katalogarkiv (1939-2011)",
    "originLink": "https://www.radioshackcatalogs.com/?_hsenc=p2ANqtz-9H5PQMgh6cUobaKL8FZ3-Ib1lk2jXz-BBrutnvv14LwcLObCTepV_IHs6nj83QW1bzJZzkyQpOm2OVPZbBmOmtzIMoRw&_hsmi=327012423",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41714750",
    "commentBody": "",
    "originSummary": [
      "RadioShackCatalogs.com är ett digitalt arkiv som bevarar RadioShacks historia från 1921 till 2011, med kataloger från 1939 till 2011.",
      "Webbplatsen visar upp en mängd olika produkter, inklusive hi-fi-stereosystem, kommunikationsutrustning, datorer och elektroniska komponenter, med varumärken som Tandy, Realistic och TRS-80 i fokus.",
      "De kataloger visas i ett bläddringsformat, vilket ger en nostalgisk upplevelse av RadioShacks teknologiska utveckling, och webbplatsen inbjuder till bidrag av saknade kataloger eller ekonomiskt stöd för underhåll."
    ],
    "commentSummary": [
      "Radio Shack-katalogarkivet (1939-2011) har väckt nostalgi och diskussioner om dess inflytande på elektronikentusiaster.",
      "Skiftet från gör-det-själv-elektronik till en mobiltelefonbutik ses som ett dåligt beslut, vilket bidrog till Radio Shacks nedgång.",
      "Den katalogen var en inspirationskälla, som erbjöd en noggrant utvald lista över delar och verktyg, en fysisk upplevelse som nu saknas i eran av nätbutiker som Digikey och Mouser."
    ],
    "points": 199,
    "commentCount": 80,
    "retryCount": 0,
    "time": 1727820297
  },
  {
    "id": 41715747,
    "title": "Norrontarioman löser lokal legend, hittar gammal sprit på sjöbotten",
    "originLink": "https://www.cbc.ca/news/canada/sudbury/larder-lake-local-legend-sunken-taxi-vintage-liquor-1.7332124",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41715747",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "En man i norra Ontario upptäckte en REO Flying Cloud-bil från 1929 med sex flaskor whisky på botten av en sjö, vilket löste en lokal legend.",
      "Upptäckten har väckt diskussioner om Canadian Broadcasting Corporations (CBC) rapportering och dess uppfattade politiska partiskhet, där kommentatorer delar personliga erfarenheter och åsikter.",
      "Bilens förblir under vatten för dykare att utforska, eftersom den anses vara för ömtålig för att flyttas."
    ],
    "points": 193,
    "commentCount": 54,
    "retryCount": 0,
    "time": 1727826988
  },
  {
    "id": 41714285,
    "title": "Juno för YouTube har tagits bort från App Store",
    "originLink": "https://christianselig.com/2024/10/juno-removed/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41714285",
    "commentBody": "",
    "originSummary": [
      "Juno for YouTube, en webbvy-app som modifierade YouTubes webbplats för ett \"visionOS\"-utseende, togs bort från App Store den 1 oktober 2024 på grund av riktlinjebrott som påståtts av YouTube.",
      "Appens borttagning var ett resultat av olösta meningsskiljaktigheter mellan utvecklaren och YouTube, utan några planer på ytterligare eskalering från utvecklarens sida.",
      "Existerande användare kan fortsätta använda Juno tills eventuella framtida uppdateringar från YouTube gör det obrukbart, och utvecklaren uttryckte tacksamhet för stödet från Vision Pro-användare."
    ],
    "commentSummary": [
      "Juno för YouTube, en app utvecklad av skaparen av Apollo-appen för Reddit, har tagits bort från App Store på grund av påstådda riktlinjebrott av YouTube.",
      "Appen, som var en webbläsarvy och inte blockerade annonser, understryker de svårigheter som utvecklare stöter på med stora teknikföretag och deras strikta policyer.",
      "Denna situation betonar det växande kravet på alternativa appbutiker, eftersom många användare och utvecklare känner att plattformar prioriterar sin kontroll över användarfördelar."
    ],
    "points": 175,
    "commentCount": 132,
    "retryCount": 0,
    "time": 1727817525
  },
  {
    "id": 41717050,
    "title": "NixOS är ett bra serveroperativsystem, förutom när det inte är det",
    "originLink": "https://sidhion.com/blog/posts/nixos_server_issues/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41717050",
    "commentBody": "",
    "originSummary": [
      "Författaren diskuterar utmaningen med att minska standardinstallationsstorleken för NixOS, ett serveroperativsystem, som initialt tar upp cirka 900MB diskutrymme. - Ansträngningar för att minimera NixOS innebar att ta bort onödiga komponenter som Nix, Perl, Python och vissa tjänster, vilket resulterade i en minskning med ungefär 300MB. - Trots dessa minskningar drar författaren slutsatsen att det är komplext att skapa ett minimalt NixOS-system och föreslår att en dedikerad \"fork\" av NixOS för serverscenarier kan vara mer effektiv."
    ],
    "commentSummary": [
      "NixOS erkänns som ett robust serveroperativsystem, men dess beroende av Nix-språket ses som en nackdel på grund av dess komplexitet och brist på användarvänliga funktioner.",
      "Användare uppskattar NixOS för dess enkla systemersättning och återställningsmöjligheter, men vissa har övergått till enklare system som Debian eller Proxmox på grund av underhållsutmaningar.",
      "NixOS tillhandahåller stabila utgåvor var sjätte månad men erbjuder inte långsiktigt stöd, vilket kan vara en oro för användare som söker stabilitet över längre perioder."
    ],
    "points": 163,
    "commentCount": 158,
    "retryCount": 0,
    "time": 1727841977
  },
  {
    "id": 41716975,
    "title": "Nvidia släpper NVLM 1.0 72B öppen viktmodell",
    "originLink": "https://huggingface.co/nvidia/NVLM-D-72B",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41716975",
    "commentBody": "",
    "originSummary": [
      "NVLM 1.0 Collection introducerar multimodala språkmodeller av frontier-klass som presterar exceptionellt bra i både vision-språk och textbaserade uppgifter.",
      "Denna samling representerar ett betydande framsteg i integrationen av visuell och textuell databehandling, vilket belyser de utvecklande kapaciteterna hos AI-modeller.",
      "Uppdateringen, som gjordes för bara två dagar sedan, tyder på pågående förbättringar och intresse för utvecklingen av dessa sofistikerade modeller."
    ],
    "commentSummary": [
      "Nvidia har lanserat NVLM 1.0 72B open weight-modellen på Hugging Face, härledd från Qwen2-72B-Instruct LLM och InterViT vision encoder, med fokus på kvalitet över skala. Modellen finns i tre varianter: endast dekoder, korsuppmärksamhet och hybrid, men endast dekoder-varianten är tillgänglig på Hugging Face. Den är licensierad under en icke-kommersiell cc-by-nc-4.0-licens, vilket tillåter utvärdering men inte kommersiell användning, och kräver betydande GPU RAM, cirka 164GB, för full noggrannhet."
    ],
    "points": 145,
    "commentCount": 53,
    "retryCount": 0,
    "time": 1727840933
  },
  {
    "id": 41714361,
    "title": "Den enkla guiden till att bygga och bryta vanor",
    "originLink": "https://alexy.tech/posts/the-simple-guide-to-building-and-breaking-habits/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41714361",
    "commentBody": "",
    "originSummary": [
      "Habit formation can be either goal-oriented or identity-focused, requiring consistency to become automatic.- \"Limbic friction\" refers to the effort needed to start a new behavior, which can be reduced by minimizing stress and fatigue.- Strategies for building and breaking habits include task bracketing, optimizing your day, leveraging dopamine, and trying a 21-day trial with flexible goals."
    ],
    "commentSummary": [],
    "points": 142,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1727817995
  },
  {
    "id": 41714858,
    "title": "SlateDB – En inbäddad databas byggd på objektlagring",
    "originLink": "https://slatedb.io/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41714858",
    "commentBody": "",
    "originSummary": [
      "SlateDB erbjuder extremt hög hållbarhet (99.999999999%) genom att utnyttja hållbarheten hos din befintliga objektlagring, vilket eliminerar behovet av diskar och tillhörande fel.",
      "Den erbjuder justerbara prestandaalternativ för låg latens, kostnadseffektivitet eller förbättrad hållbarhet, och stöder en enda skribent med flera läsare, vilket förhindrar problem med zombie-skribenter.",
      "Utvecklad i Rust, är SlateDB ett inbäddningsbart bibliotek kompatibelt med flera programmeringsspråk, och kan enkelt integreras genom att lägga till det i dina beroenden i Cargo.toml."
    ],
    "commentSummary": [
      "SlateDB är en inbäddad databas designad för objektlagring, som liknar en \"lakehouse-arkitektur\" liknande Apache Iceberg, och används för strömbehandling och serverlösa funktioner.",
      "Den buffrar skrivningar i en logg i minnet innan den begår till objektlagring, vilket kan leda till dataförlust om skrivaren misslyckas, även om den erbjuder konfigurerbara hållbarhetsalternativ, inklusive synkrona skrivningar.",
      "Enligt kritiker är SlateDB mer av en tunn abstraktion över objektlagring än en riktig databas, och den kräver för närvarande Rust för implementering, vilket innebär att den saknar stöd för andra programmeringsspråk."
    ],
    "points": 138,
    "commentCount": 42,
    "retryCount": 0,
    "time": 1727821083
  },
  {
    "id": 41721567,
    "title": "Amerikansk bomb från andra världskriget exploderar på japansk flygplats och orsakar stort krater i taxibanan",
    "originLink": "https://www.cnn.com/2024/10/02/travel/wwii-bomb-miyazaki-airport-japan-scli-intl/index.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41721567",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "En oexploderad amerikansk bomb från andra världskriget detonerade på en japansk flygplats, vilket orsakade en stor krater på en taxibana, men lyckligtvis rapporterades inga skador.",
      "Incidenten har återupplivat diskussioner om utmaningarna med att hämta digitala bilder från säkerhetskameror och det utbredda problemet med oexploderad ammunition i länder som Japan, London, Tyskland och Frankrike.",
      "Det uttrycktes oro över stabiliteten hos gamla sprängämnen, eftersom de kan bli mer känsliga med tiden och utgöra betydande risker."
    ],
    "points": 136,
    "commentCount": 115,
    "retryCount": 0,
    "time": 1727882531
  }
]
