[
  {
    "id": 41713063,
    "title": "COBOL è stato \"morto\" per così tanto tempo che mio nonno ne ha scritto",
    "originLink": "https://wumpus-cave.net/post/2024/10/2024-10-01-death-of-cobol/index.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41713063",
    "commentBody": "",
    "originSummary": [
      "Nonostante sia stato dichiarato \"morto\" nel 1992, Cobol è sopravvissuto e ha superato molti linguaggi di programmazione di quarta generazione (4GL), dimostrando la sua resilienza e continua rilevanza.",
      "Il problema Y2K ha svolto un ruolo significativo nel rivitalizzare Cobol creando una domanda di programmatori esperti in questo linguaggio, evidenziando la sua importanza nei sistemi legacy.",
      "Il racconto suggerisce cautela nel definire i linguaggi di programmazione come \"morti\", specialmente quelli con una base di utenti sostanziale, poiché potrebbero continuare ad avere applicazioni pratiche e influenza."
    ],
    "commentSummary": [
      "COBOL, spesso considerato obsoleto, rimane essenziale per i sistemi legacy in settori come la gestione stipendi e il settore bancario grazie alla sua integrazione con sistemi mainframe affidabili. - Nonostante sia stato progettato per essere leggibile dall'uomo, COBOL richiede una conoscenza significativa del dominio per tradurre accuratamente i processi aziendali in codice. - La continua rilevanza del linguaggio è sottolineata dalla necessità di programmatori per mantenere i sistemi esistenti, specialmente con sfide come il problema del 2038 all'orizzonte."
    ],
    "points": 404,
    "commentCount": 396,
    "retryCount": 0,
    "time": 1727810738
  },
  {
    "id": 41719531,
    "title": "Ho creato un gioco che puoi giocare senza che nessuno lo sappia (niente immagini/suoni)",
    "originLink": "https://apps.apple.com/us/app/tik/id6720712299",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41719531",
    "commentBody": "",
    "originSummary": [
      "È stato lanciato un nuovo gioco iOS chiamato Tik!, caratterizzato da un gameplay che si basa esclusivamente sul feedback aptico, senza immagini o suoni.",
      "Giocatori devono replicare un ritmo di vibrazioni toccando lo schermo, offrendo una sfida unica in termini di tempismo e coordinazione.",
      "Il gioco è stato progettato per essere una distrazione discreta, permettendo agli utenti di giocare senza guardare il telefono, e il feedback è incoraggiato."
    ],
    "commentSummary": [
      "È stato sviluppato un nuovo gioco che può essere giocato discretamente senza immagini o suoni, concentrandosi su un tempismo rigoroso per un'esperienza impegnativa.",
      "Io sviluppatore sta considerando miglioramenti basati sul feedback degli utenti, come l'aggiunta di intervalli costanti, un'opzione per tornare al menu e un modo per visualizzare o saltare i ritmi.",
      "Il gioco è attualmente disponibile su iOS, con piani per futuri aggiornamenti, inclusi livelli di difficoltà, nuove funzionalità e una possibile versione per Android."
    ],
    "points": 335,
    "commentCount": 223,
    "retryCount": 0,
    "time": 1727869709
  },
  {
    "id": 41712885,
    "title": "Non costruire il tuo castello nei regni degli altri (2021)",
    "originLink": "https://howtomarketagame.com/2021/11/01/dont-build-your-castle-in-other-peoples-kingdoms/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41712885",
    "commentBody": "",
    "originSummary": [
      "Le piattaforme di social media spesso modificano i termini o introducono piani a pagamento inaspettatamente, come visto con il programma \"Boost\" di Twitch e il quasi divieto di contenuti per adulti su OnlyFans, ponendo rischi per i creatori di contenuti. Il consiglio principale è di evitare di costruire un'attività esclusivamente su piattaforme esterne; invece, è meglio dare priorità allo sviluppo del proprio sito web, lista di contatti e proprietà intellettuale. I creatori dovrebbero utilizzare i social media per ottenere follower ma assicurarsi di reindirizzarli alle proprie piattaforme, mantenendo il controllo sul proprio pubblico e contenuto nonostante i cambiamenti delle piattaforme."
    ],
    "commentSummary": [
      "Il detto 'Non costruire il tuo castello nei regni degli altri' consiglia di non fare affidamento esclusivamente su grandi piattaforme per la presenza digitale a causa del loro controllo sull'accesso e del potenziale per improvvisi cambiamenti delle regole.",
      "Si suggerisce di creare spazi indipendenti, come un sito web personale o una mailing list, per mantenere il controllo e una connessione diretta con il pubblico.",
      "Questa strategia minimizza la dipendenza da piattaforme esterne e protegge da cambiamenti imprevisti che potrebbero influire sulle operazioni aziendali."
    ],
    "points": 331,
    "commentCount": 223,
    "retryCount": 0,
    "time": 1727809856
  },
  {
    "id": 41715762,
    "title": "Matematica dai tre ai sette anni",
    "originLink": "https://www.thepsmiths.com/p/review-math-from-three-to-seven-by",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41715762",
    "commentBody": "",
    "originSummary": [
      "\"Matematica dai tre ai sette anni\" di Alexander Zvonkin introduce l'idea dei circoli matematici per i bambini in età prescolare, concentrandosi sulla risoluzione dei problemi piuttosto che sull'apprendimento mnemonico tradizionale.",
      "Il libro, strutturato come un diario, condivide le esperienze di Zvonkin nell'insegnare concetti matematici complessi ai bambini piccoli attraverso metodi ludici, mettendo in evidenza le loro capacità cognitive uniche.",
      "Il variegato successo di Zvonkin con diversi gruppi di bambini sottolinea l'individualità del processo di apprendimento di ciascun bambino e l'importanza di coltivare l'amore per la risoluzione dei problemi."
    ],
    "commentSummary": [
      "Il articolo recensisce \"La matematica dai tre ai sette anni\", concentrandosi sul mantenere l'interesse dei bambini per la matematica man mano che crescono.",
      "Commentatori suggeriscono metodi coinvolgenti come l'uso di risorse online (ad esempio, Khan Academy, 3Blue1Brown) e la partecipazione a circoli matematici per stimolare l'interesse.",
      "Il dibattito include il ruolo della passione nell'apprendimento della matematica e considera le influenze culturali ed educative, facendo riferimento all'enfasi storica sulla matematica e la scienza nell'educazione sovietica."
    ],
    "points": 312,
    "commentCount": 176,
    "retryCount": 0,
    "time": 1727827125
  },
  {
    "id": 41714672,
    "title": "Chi finge di assumere?",
    "originLink": "https://news.ycombinator.com/item?id=41714672",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41714672",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Molte aziende mantengono annunci di lavoro aperti durante i blocchi delle assunzioni per proiettare salute finanziaria agli investitori, nonostante non stiano assumendo attivamente.",
      "Questa pratica frustra i cercatori di lavoro, poiché le aziende possono ignorare i CV raccomandati o condurre colloqui senza l'intenzione di assumere, portando a una perdita di tempo e a dati economici fuorvianti.",
      "Le startup e le grandi aziende si impegnano in questo comportamento, utilizzando gli annunci di lavoro per segnalare crescita o mantenere un bacino di candidati, influenzando negativamente la salute mentale dei cercatori di lavoro e complicando il processo di assunzione."
    ],
    "points": 289,
    "commentCount": 99,
    "retryCount": 0,
    "time": 1727819690
  },
  {
    "id": 41721668,
    "title": "I mutex più veloci",
    "originLink": "https://justine.lol/mutex/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41721668",
    "commentBody": "",
    "originSummary": [
      "Cosmopolitan Libc's mutex library dimostra prestazioni superiori in scenari fortemente contesi, superando SRWLOCK di Microsoft di 2,75 volte e Cygwin di 65 volte su Windows, e glibc di 3 volte e musl libc di 11 volte su Linux.",
      "La efficienza della biblioteca è attribuita alla sua integrazione con la libreria nsync, che impiega tecniche avanzate come il Compare-And-Swap (CAS) ottimistico e i futex per ridurre l'uso della CPU e la contesa.",
      "Il progetto è supportato da vari sponsor, tra cui GitHub, Patreon, il programma MIECO di Mozilla e la comunità degli sviluppatori, evidenziando il suo sviluppo collaborativo e il sostegno della comunità."
    ],
    "commentSummary": [
      "Il dibattito si concentra sulle implementazioni dei mutex, con critiche sui metodi di benchmarking, suggerendo che le prestazioni nel mondo reale dovrebbero essere testate in grandi programmi multithread.- C'è un dibattito sui meriti dei diversi tipi di mutex, come gli spinlock, e sull'importanza delle prestazioni non contese, evidenziando i miglioramenti dei mutex nella libreria Cosmopolitan C.- La conversazione esplora anche l'uso del passaggio di messaggi rispetto ai mutex per la concorrenza, con alcuni che sostengono astrazioni come le code per una più facile comprensione e debug."
    ],
    "points": 277,
    "commentCount": 108,
    "retryCount": 0,
    "time": 1727883105
  },
  {
    "id": 41715277,
    "title": "Come il CERN gestisce 1EB di dati tramite FUSE [video]",
    "originLink": "https://kernel-recipes.org/en/2024/schedule/how-cern-serves-1eb-of-data-via-fuse/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41715277",
    "commentBody": "",
    "originSummary": [
      "CERN gestisce un enorme 1 exabyte (EB) di dati dal Large Hadron Collider, utilizzando progetti open-source come CERNBox ed EOS per una gestione efficiente dei dati.",
      "Il Gruppo di Gestione dei Dati e dell'Archiviazione del CERN è responsabile dell'archiviazione dei dati, della distribuzione e della garanzia di un accesso sicuro per oltre 30.000 utenti.",
      "FUSE (Filesystem in Userspace) è utilizzato per facilitare l'accesso globale ai dati, migliorando l'accessibilità e l'usabilità dei dati."
    ],
    "commentSummary": [
      "CERN gestisce un enorme 1 exabyte (EB) di dati utilizzando FUSE (Filesystem in Userspace), affrontando sfide come i problemi di inotify all'interno dei container Docker.",
      "Utilizzano Rucio per una gestione efficiente dei dati attraverso vari sistemi di archiviazione, garantendo la distribuzione globale dei dati con backup su nastro e repliche fuori sede.",
      "Nonostante i vincoli di bilancio e i recenti cambiamenti nella gestione a favore di Microsoft, il CERN continua a essere un centro di innovazione scientifica, contribuendo in modo significativo alla scienza e alla tecnologia aperte, ed è altamente apprezzato per le sue scoperte scientifiche e i progressi nella scienza dei dati."
    ],
    "points": 210,
    "commentCount": 94,
    "retryCount": 0,
    "time": 1727823922
  },
  {
    "id": 41714750,
    "title": "Archivio del Catalogo Radio Shack (1939-2011)",
    "originLink": "https://www.radioshackcatalogs.com/?_hsenc=p2ANqtz-9H5PQMgh6cUobaKL8FZ3-Ib1lk2jXz-BBrutnvv14LwcLObCTepV_IHs6nj83QW1bzJZzkyQpOm2OVPZbBmOmtzIMoRw&_hsmi=327012423",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41714750",
    "commentBody": "",
    "originSummary": [
      "RadioShackCatalogs.com è un archivio digitale che preserva la storia di RadioShack dal 1921 al 2011, con cataloghi dal 1939 al 2011.",
      "Il sito presenta una varietà di prodotti, tra cui stereo ad alta fedeltà, apparecchiature di comunicazione, computer e componenti elettronici, mettendo in evidenza marchi come Tandy, Realistic e TRS-80.",
      "I cataloghi sono visualizzati in un formato a sfogliare le pagine, offrendo un'esperienza nostalgica dell'evoluzione tecnologica di RadioShack, e il sito invita a contribuire con cataloghi mancanti o supporto finanziario per la manutenzione."
    ],
    "commentSummary": [
      "Il Radio Shack Catalog Archive (1939-2011) ha suscitato nostalgia e discussioni sulla sua influenza sugli appassionati di elettronica.",
      "Il passaggio dall'elettronica fai-da-te a un negozio di telefoni cellulari è visto come una decisione sbagliata, contribuendo al declino di Radio Shack.",
      "Il catalogo era una fonte di ispirazione, offrendo una lista curata di parti e strumenti, un'esperienza fisica ora mancata nell'era dei negozi online come Digikey e Mouser."
    ],
    "points": 199,
    "commentCount": 80,
    "retryCount": 0,
    "time": 1727820297
  },
  {
    "id": 41715747,
    "title": "Uomo dell'Ontario settentrionale risolve leggenda locale, trova liquore d'epoca sul fondo del lago",
    "originLink": "https://www.cbc.ca/news/canada/sudbury/larder-lake-local-legend-sunken-taxi-vintage-liquor-1.7332124",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41715747",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Un uomo nel nord dell'Ontario ha scoperto un'auto REO Flying Cloud del 1929 con sei bottiglie di whisky sul fondo di un lago, risolvendo una leggenda locale.",
      "Il ritrovamento ha suscitato discussioni sulla copertura della Canadian Broadcasting Corporation (CBC) e sul suo percepito bias politico, con commentatori che condividono esperienze personali e opinioni.",
      "Il veicolo rimane sott'acqua per essere esplorato dai subacquei, poiché è considerato troppo fragile per essere rimosso."
    ],
    "points": 193,
    "commentCount": 54,
    "retryCount": 0,
    "time": 1727826988
  },
  {
    "id": 41714285,
    "title": "Juno per YouTube è stato rimosso dall'App Store",
    "originLink": "https://christianselig.com/2024/10/juno-removed/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41714285",
    "commentBody": "",
    "originSummary": [
      "Juno for YouTube, un'app di visualizzazione web che modificava il sito web di YouTube per un aspetto \"visionOS\", è stata rimossa dall'App Store il 1° ottobre 2024 a causa di violazioni delle linee guida rivendicate da YouTube.",
      "Il ritiro dell'app è stato il risultato di disaccordi irrisolti tra lo sviluppatore e YouTube, senza piani per ulteriori escalation da parte dello sviluppatore.",
      "Gli utenti esistenti possono continuare a utilizzare Juno fino a quando eventuali futuri aggiornamenti di YouTube lo renderanno non funzionale, e lo sviluppatore ha espresso gratitudine per il supporto degli utenti di Vision Pro."
    ],
    "commentSummary": [
      "Juno per YouTube, un'app sviluppata dal creatore dell'app Apollo per Reddit, è stata rimossa dall'App Store a causa di presunte violazioni delle linee guida da parte di YouTube.",
      "Questa app, che era una visualizzazione web e non bloccava gli annunci, sottolinea le difficoltà che gli sviluppatori incontrano con le grandi aziende tecnologiche e le loro rigide politiche.",
      "Questa situazione sottolinea la crescente richiesta di app store alternativi, poiché molti utenti e sviluppatori ritengono che le piattaforme diano priorità al loro controllo rispetto ai benefici per gli utenti."
    ],
    "points": 175,
    "commentCount": 132,
    "retryCount": 0,
    "time": 1727817525
  },
  {
    "id": 41717050,
    "title": "NixOS è un buon sistema operativo per server, tranne quando non lo è",
    "originLink": "https://sidhion.com/blog/posts/nixos_server_issues/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41717050",
    "commentBody": "",
    "originSummary": [
      "Il autore discute la sfida di ridurre la dimensione dell'installazione predefinita di NixOS, un sistema operativo per server, che inizialmente occupa circa 900MB di spazio su disco. Gli sforzi per minimizzare NixOS hanno comportato la rimozione di componenti non necessari come Nix, Perl, Python e alcuni servizi, ottenendo una riduzione di circa 300MB. Nonostante queste riduzioni, l'autore conclude che creare un sistema NixOS minimale è complesso e suggerisce che un \"fork\" dedicato di NixOS per scenari server potrebbe essere più efficace."
    ],
    "commentSummary": [
      "NixOS è riconosciuto come un robusto sistema operativo per server, ma la sua dipendenza dal linguaggio Nix è vista come uno svantaggio a causa della sua complessità e della mancanza di funzionalità user-friendly.",
      "Gli utenti apprezzano NixOS per le sue capacità di facile sostituzione e rollback del sistema, tuttavia alcuni sono passati a sistemi più semplici come Debian o Proxmox a causa delle sfide di manutenzione.",
      "NixOS fornisce versioni stabili ogni sei mesi ma non offre supporto a lungo termine, il che può essere una preoccupazione per gli utenti che cercano stabilità per periodi prolungati."
    ],
    "points": 163,
    "commentCount": 158,
    "retryCount": 0,
    "time": 1727841977
  },
  {
    "id": 41716975,
    "title": "Nvidia rilascia il modello NVLM 1.0 72B a pesi aperti",
    "originLink": "https://huggingface.co/nvidia/NVLM-D-72B",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41716975",
    "commentBody": "",
    "originSummary": [
      "NVLM 1.0 Collection introduce modelli di linguaggio multimodali di classe frontiera che offrono prestazioni eccezionali sia nei compiti di visione-linguaggio che in quelli solo testuali.",
      "Questa collezione rappresenta un significativo avanzamento nell'integrazione dell'elaborazione dei dati visivi e testuali, evidenziando le capacità in evoluzione dei modelli di intelligenza artificiale.",
      "Il recente aggiornamento, effettuato solo due giorni fa, suggerisce continui miglioramenti e interesse nello sviluppo di questi modelli sofisticati."
    ],
    "commentSummary": [
      "Nvidia ha lanciato il modello open weight NVLM 1.0 72B su Hugging Face, derivato dal Qwen2-72B-Instruct LLM e dall'encoder visivo InterViT, con un focus sulla qualità piuttosto che sulla scala. Il modello è disponibile in tre varianti: solo decoder, cross-attention e ibrido, ma solo la versione solo decoder è disponibile su Hugging Face. È concesso in licenza sotto una licenza non commerciale cc-by-nc-4.0, che consente la valutazione ma non l'uso commerciale, e richiede una notevole quantità di RAM GPU, circa 164GB, per la massima accuratezza."
    ],
    "points": 145,
    "commentCount": 53,
    "retryCount": 0,
    "time": 1727840933
  },
  {
    "id": 41714361,
    "title": "Guida semplice per costruire e rompere abitudini",
    "originLink": "https://alexy.tech/posts/the-simple-guide-to-building-and-breaking-habits/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41714361",
    "commentBody": "",
    "originSummary": [
      "Formare abitudini può essere orientato agli obiettivi o focalizzato sull'identità, richiedendo coerenza per diventare automatico. La \"frizione limbica\" si riferisce allo sforzo necessario per iniziare un nuovo comportamento, che può essere ridotto minimizzando lo stress e la fatica. Le strategie per costruire e rompere abitudini includono il raggruppamento dei compiti, l'ottimizzazione della giornata, l'uso della dopamina e la prova di 21 giorni con obiettivi flessibili."
    ],
    "commentSummary": [],
    "points": 142,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1727817995
  },
  {
    "id": 41714858,
    "title": "SlateDB – Un database incorporato basato su archiviazione di oggetti",
    "originLink": "https://slatedb.io/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41714858",
    "commentBody": "",
    "originSummary": [
      "SlateDB fornisce un'estrema durabilità (99,999999999%) utilizzando la durabilità del tuo archivio oggetti esistente, eliminando la necessità di dischi e dei relativi guasti.",
      "Offre opzioni di prestazioni regolabili per bassa latenza, efficienza dei costi o durata migliorata, e supporta un singolo scrittore con più lettori, prevenendo problemi con scrittori zombie.",
      "Realizzato in Rust, SlateDB è una libreria incorporabile compatibile con diversi linguaggi di programmazione e può essere facilmente integrata aggiungendola alle tue dipendenze in Cargo.toml."
    ],
    "commentSummary": [
      "SlateDB è un database incorporato progettato per l'archiviazione di oggetti, simile a un'architettura \"lakehouse\" come Apache Iceberg, ed è utilizzato per l'elaborazione di flussi e funzioni serverless.",
      "Memorizza temporaneamente le scritture in un registro in memoria prima di impegnarle nello storage degli oggetti, il che può portare a una perdita di dati se il writer fallisce, sebbene offra opzioni di durabilità configurabili, inclusa la scrittura sincrona.",
      "Alcuni critici sostengono che SlateDB sia più una sottile astrazione rispetto allo storage di oggetti che un vero e proprio database, e attualmente richiede Rust per l'implementazione, mancando di supporto per altri linguaggi di programmazione."
    ],
    "points": 138,
    "commentCount": 42,
    "retryCount": 0,
    "time": 1727821083
  },
  {
    "id": 41721567,
    "title": "Una bomba americana della Seconda Guerra Mondiale esplode all'aeroporto giapponese, causando un grande cratere sulla pista di rullaggio",
    "originLink": "https://www.cnn.com/2024/10/02/travel/wwii-bomb-miyazaki-airport-japan-scli-intl/index.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41721567",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Una bomba inesplosa della Seconda Guerra Mondiale americana è esplosa in un aeroporto giapponese, causando un grande cratere su una pista di rullaggio, ma fortunatamente non sono stati segnalati feriti.",
      "L'incidente ha riacceso le discussioni sulle sfide del recupero delle riprese digitali dalle telecamere di sicurezza e sul diffuso problema degli ordigni inesplosi in paesi come il Giappone, Londra, la Germania e la Francia.",
      "Si sono sollevate preoccupazioni riguardo alla stabilità degli esplosivi vecchi, poiché possono diventare più sensibili nel tempo, comportando rischi significativi."
    ],
    "points": 136,
    "commentCount": 115,
    "retryCount": 0,
    "time": 1727882531
  }
]
