[
  {
    "id": 38199355,
    "title": "El fundador de Omegle expresa su decepción por el cierre de la plataforma debido a ataques maliciosos",
    "originLink": "https://www.omegle.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38199355",
    "commentBody": "",
    "originSummary": [
      "Omegle, una plataforma de chat en línea, cierra debido a los ataques de usuarios malintencionados.",
      "El fundador Leif K-Brooks expresa su decepción y destaca los aspectos positivos de la plataforma.",
      "K-Brooks subraya la importancia de no atacar a usuarios inocentes y de apoyar a organizaciones como la Electronic Frontier Foundation para proteger los derechos en línea."
    ],
    "commentSummary": [
      "Omegle, una plataforma de chat en línea, cierra debido a los ataques de usuarios malintencionados, lo que ha provocado la decepción de su fundador, Leif K-Brooks.",
      "K-Brooks destaca los aspectos positivos de Omegle, como la posibilidad de conocer gente nueva y la seguridad que proporcionaba a algunos usuarios.",
      "Insta a no apuntar a usuarios inocentes o posibles víctimas de delitos a la hora de imponer restricciones y pide el apoyo de organizaciones como la Electronic Frontier Foundation para proteger los derechos en línea."
    ],
    "points": 1489,
    "commentCount": 584,
    "retryCount": 0,
    "time": 1699490425
  },
  {
    "id": 38188689,
    "title": "Realidades y retos de un ingeniero de software: Habilidades interpersonales, errores, aprendizaje constante y conciliación de la vida laboral y personal",
    "originLink": "https://www.mensurdurakovic.com/hard-to-swallow-truths-they-wont-tell-you-about-software-engineer-job/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38188689",
    "commentBody": "",
    "originSummary": [
      "Las competencias interpersonales son importantes para los ingenieros de software, junto con las técnicas.",
      "Los errores son habituales en el desarrollo de software y deben tratarse con regularidad.",
      "Los ingenieros de software necesitan aprender continuamente y estar al día de las nuevas tecnologías.",
      "Desconectar del trabajo puede ser un reto para los ingenieros de software.",
      "La ingeniería de software ofrece oportunidades de innovación y opciones de trabajo a distancia.",
      "En esta profesión hay flexibilidad en cuanto a la ubicación y el código de vestimenta."
    ],
    "commentSummary": [
      "Las competencias interpersonales, como la comunicación y el trabajo en equipo, son cruciales para los ingenieros de software, además de las técnicas.",
      "Hacer frente a los errores es un reto habitual para los ingenieros de software.",
      "El aprendizaje continuo es necesario en el campo de la ingeniería de software, en constante evolución.",
      "Desconectar del trabajo puede ser difícil para los ingenieros de software.",
      "La ingeniería de software ofrece oportunidades para la innovación.",
      "Las opciones de trabajo a distancia y la flexibilidad en cuanto a ubicación y código de vestimenta son ventajas del puesto."
    ],
    "points": 738,
    "commentCount": 728,
    "retryCount": 0,
    "time": 1699440095
  },
  {
    "id": 38189878,
    "title": "Cómo las disputas y la pérdida de población determinan el cambio institucional en Wikipedia",
    "originLink": "https://www.cambridge.org/core/journals/american-political-science-review/article/rule-ambiguity-institutional-clashes-and-population-loss-how-wikipedia-became-the-last-good-place-on-the-internet/FC3F7B9CBF951DD30C2648E7DEFB65EE",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38189878",
    "commentBody": "",
    "originSummary": [
      "El artículo analiza el cambio institucional en Wikipedia, centrándose en la pérdida de población y las disputas sobre la interpretación de las normas.",
      "El análisis cualitativo y el seguimiento del proceso se utilizan para aportar pruebas del cambio institucional endógeno.",
      "Se destacan los sesgos que favorecen la estabilidad y la toma de decisiones por consenso dentro de Wikipedia, junto con el papel de los actores en la configuración de las normas."
    ],
    "commentSummary": [
      "Este artículo explora cómo se produce el cambio institucional en Wikipedia, centrándose en la pérdida de población y las disputas sobre la interpretación de las normas.",
      "El estudio utiliza el análisis cualitativo y el seguimiento de procesos para aportar pruebas del cambio institucional endógeno en Wikipedia.",
      "El documento pone de relieve los sesgos que favorecen la estabilidad y la toma de decisiones por consenso en Wikipedia y subraya el papel de los actores en la configuración de las normas."
    ],
    "points": 495,
    "commentCount": 582,
    "retryCount": 0,
    "time": 1699449221
  },
  {
    "id": 38190401,
    "title": "Resuelta la grave interrupción de los servicios ChatGPT y API",
    "originLink": "https://status.openai.com/incidents/00fpy0yxrx1q",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38190401",
    "commentBody": "",
    "originSummary": [
      "OpenAI experimentó una importante interrupción que afectó a sus servicios ChatGPT y API, provocando elevadas tasas de error.",
      "El problema se identificó y resolvió en un lapso de casi 2 horas, entre las 5:42AM y las 7:16AM PT.",
      "OpenAI ha implementado una solución y actualmente está supervisando los servicios para garantizar una recuperación continua del incidente."
    ],
    "commentSummary": [
      "OpenAI experimentó una importante interrupción en sus servicios ChatGPT y API, lo que provocó elevadas tasas de error.",
      "El problema se identificó y resolvió entre las 5:42 y las 7:16 PT, y después se observaron respuestas normales.",
      "OpenAI ha implementado una solución y está supervisando de cerca los servicios para garantizar una recuperación continua."
    ],
    "points": 491,
    "commentCount": 507,
    "retryCount": 0,
    "time": 1699452159
  },
  {
    "id": 38189840,
    "title": "Vivir en vertical: La evolución de los edificios altos y la densidad urbana en España",
    "originLink": "https://especiales.eldiario.es/spain-lives-in-flats/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38189840",
    "commentBody": "",
    "originSummary": [
      "El artículo profundiza en la historia y evolución de los edificios en altura y la densidad de población en las ciudades españolas.",
      "Examina cómo las tendencias urbanísticas han influido en la construcción de edificios más altos, especialmente durante la urbanización y el éxodo rural.",
      "El artículo hace hincapié en el auge de las viviendas unifamiliares y apartamentos en las zonas suburbanas y en el interés actual por crear ciudades compactas y cohesionadas en la planificación urbana."
    ],
    "commentSummary": [
      "El artículo examina la historia y el crecimiento de los edificios altos y la densidad de población en las ciudades españolas.",
      "Las tendencias urbanísticas han visto un aumento de los edificios más altos, especialmente durante los periodos de urbanización y éxodo rural.",
      "Cada vez se hace más hincapié en la creación de ciudades compactas y cohesionadas, pero la cuestión de la altura y la densidad adecuadas sigue siendo objeto de debate."
    ],
    "points": 459,
    "commentCount": 405,
    "retryCount": 0,
    "time": 1699448883
  },
  {
    "id": 38188614,
    "title": "Chamberlain bloquea el acceso de terceros a los mandos de garaje inteligentes y se enfrenta a una reacción violenta",
    "originLink": "https://arstechnica.com/gadgets/2023/11/chamberlain-blocks-smart-garage-door-opener-from-working-with-smart-homes/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38188614",
    "commentBody": "",
    "originSummary": [
      "El Grupo Chamberlain ha bloqueado el acceso de aplicaciones domésticas inteligentes de terceros a sus mandos de garaje inteligentes myQ, alegando una mejora de la experiencia de usuario y del rendimiento.",
      "Los críticos sostienen que la decisión de Chamberlain obedece al deseo de mostrar anuncios y vender servicios a través de su propia aplicación.",
      "La plataforma de código abierto para el hogar inteligente Home Assistant está eliminando la integración myQ en respuesta y aconseja a los consumidores que eviten apoyar a las empresas que restringen el acceso de los clientes."
    ],
    "commentSummary": [
      "El Grupo Chamberlain, propietario de marcas tan populares como LiftMaster y Chamberlain, ha bloqueado el acceso de aplicaciones domésticas inteligentes de terceros a sus mandos de garaje inteligentes myQ.",
      "Chamberlain afirma que esta decisión mejora la experiencia del usuario y el rendimiento, pero los críticos sostienen que está motivada por el deseo de mostrar anuncios y vender servicios a través de su propia aplicación.",
      "La plataforma de código abierto para el hogar inteligente Home Assistant está eliminando la integración myQ de su sistema y aconseja a los consumidores que no apoyen a las empresas que restringen el acceso de los clientes."
    ],
    "points": 454,
    "commentCount": 179,
    "retryCount": 0,
    "time": 1699439145
  },
  {
    "id": 38196412,
    "title": "SciPy para Python 3.12 en Windows: Superar los desafíos y alcanzar el éxito",
    "originLink": "https://labs.quansight.org/blog/building-scipy-with-flang",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38196412",
    "commentBody": "",
    "originSummary": [
      "La creación de versiones compatibles de paquetes como SciPy para Python 3.12 presenta desafíos, especialmente con el empaquetado de Python y el uso de código Fortran.",
      "El gestor de paquetes Conda y la comunidad conda-forge desempeñan un papel crucial a la hora de afrontar estos retos.",
      "Las herramientas de empaquetado de Python como distutils y setuptools tienen limitaciones, y se discute el uso de Meson como herramienta de compilación.",
      "Se destacan las dificultades para crear y empaquetar paquetes basados en Fortran para Windows.",
      "El artículo menciona el éxito de la construcción a medida de una cadena de herramientas para SciPy en Windows y expresa su gratitud a los colaboradores.",
      "Se recomienda precaución a la hora de realizar cambios significativos en la configuración de LLVM debido al impacto potencial en otros paquetes."
    ],
    "commentSummary": [
      "La creación de versiones compatibles de paquetes como SciPy para Python 3.12 plantea problemas relacionados con el empaquetado de Python y el uso de código Fortran.",
      "Conda y la comunidad conda-forge desempeñan un papel importante a la hora de afrontar estos retos.",
      "Las herramientas de empaquetado de Python como distutils y setuptools tienen limitaciones, y Meson se utiliza como herramienta de compilación. Construir y empaquetar paquetes basados en Fortran para Windows es particularmente difícil.",
      "Se construyó con éxito una cadena de herramientas personalizada para SciPy en Windows, y se expresa gratitud a los colaboradores.",
      "Los cambios significativos en la configuración de LLVM deben abordarse con cautela debido al impacto potencial en otros paquetes."
    ],
    "points": 375,
    "commentCount": 180,
    "retryCount": 0,
    "time": 1699475056
  },
  {
    "id": 38189790,
    "title": "La UE acusada de \"mala administración\" por ocultar la lista de empresas consultadas sobre el Reglamento CSAM",
    "originLink": "https://www.iccl.ie/news/ombudsman-european-commissions-concealment-of-secret-expert-list-on-csam-regulation-constitutes-maladministration/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38189790",
    "commentBody": "",
    "originSummary": [
      "La Comisión Europea ha sido criticada por ocultar una lista de empresas consultadas sobre la detección de material de abuso sexual infantil (CSAM) sin menoscabo de la encriptación, lo que ha dado lugar a acusaciones de \"mala administración\" por parte del Defensor del Pueblo Europeo.",
      "La negativa de la Comisión a divulgar la lista ha suscitado dudas sobre la transparencia y la influencia de los grupos de presión en la elaboración del Reglamento CSAM.",
      "Los expertos han expresado opiniones divergentes sobre la viabilidad actual de detectar el CSAM en los contenidos cifrados, y algunos advierten de la posibilidad de una vigilancia masiva y de violaciones de la legislación de la UE sobre control de las comunicaciones."
    ],
    "commentSummary": [
      "La Comisión Europea ha sido acusada de \"mala administración\" por retener una lista de empresas consultadas sobre la detección de material de abuso sexual infantil (CSAM) sin comprometer la encriptación.",
      "Se ha expresado preocupación por la transparencia y la influencia de los grupos de presión en la redacción del reglamento CSAM.",
      "Los expertos tienen opiniones divergentes sobre la viabilidad y necesidad de detectar CSAM en contenidos cifrados, y algunos abogan por ello como herramienta para combatir la explotación infantil. La propuesta de reglamento también ha recibido críticas por su potencial vigilancia masiva y violación de la legislación de la UE sobre control de las comunicaciones."
    ],
    "points": 368,
    "commentCount": 173,
    "retryCount": 0,
    "time": 1699448453
  },
  {
    "id": 38191319,
    "title": "Un proyecto cartográfico muestra interpretaciones únicas del Brutalismo en Quake Brutalist Jam II",
    "originLink": "https://www.slipseer.com/index.php?resources/quake-brutalist-jam-2.278/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38191319",
    "commentBody": "",
    "originSummary": [
      "Un proyecto de mapeado centrado en la arquitectura del Brutalismo ha dado lugar a 30 niveles creados por múltiples maperos.",
      "El proyecto incluye un mod de juego llamado Copper y presenta mapas realizados tanto por maperos noveles como experimentados.",
      "Los mapas muestran diversas interpretaciones del Brutalismo, desde paisajes infernales de hormigón hasta vacíos liminales."
    ],
    "commentSummary": [
      "Un proyecto de mapeado centrado en la arquitectura del Brutalismo ha dado lugar a 30 niveles creados por distintos maperos, entre los que hay tanto novatos como experimentados.",
      "El proyecto incluye un mod de juego llamado Copper y ofrece diversas e impresionantes interpretaciones del Brutalismo, desde paisajes infernales de hormigón hasta vacíos liminales.",
      "Para instalar el proyecto, los usuarios deben descomprimir la carpeta qbj2 en el directorio de Quake e iniciar un sourceport de su preferencia."
    ],
    "points": 340,
    "commentCount": 94,
    "retryCount": 0,
    "time": 1699455749
  },
  {
    "id": 38195509,
    "title": "Los votantes de Maine aprueban la ley sobre el derecho a reparación de automóviles, que plantea retos a los fabricantes de automóviles",
    "originLink": "https://www.404media.co/voters-overwhelmingly-pass-car-right-to-repair-law-in-maine/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38195509",
    "commentBody": "",
    "originSummary": [
      "Los votantes de Maine han aprobado una medida electoral que otorga a los consumidores el derecho a reparar los coches, a pesar de la oposición de los fabricantes de automóviles.",
      "La medida obliga a los fabricantes de vehículos a normalizar los sistemas de diagnóstico y dar acceso a los datos a propietarios y talleres de reparación independientes.",
      "Esta victoria sigue a una medida similar aprobada en Massachusetts el año pasado y refuerza el movimiento nacional en favor de la protección del derecho a reparación."
    ],
    "commentSummary": [
      "Los votantes de Maine han aprobado una medida electoral que otorga a los propietarios de automóviles y a los talleres de reparación independientes el derecho a acceder a los datos y sistemas de diagnóstico normalizados de los fabricantes de vehículos.",
      "Esto supone un revés para los fabricantes de automóviles, que se han opuesto a este tipo de legislación.",
      "La ley se considera necesaria porque los fabricantes utilizan cada vez más el acceso inalámbrico a los diagnósticos de los coches, lo que restringe el acceso de las reparaciones independientes."
    ],
    "points": 323,
    "commentCount": 101,
    "retryCount": 0,
    "time": 1699471202
  },
  {
    "id": 38194818,
    "title": "Los Fire TV de Amazon ahora están repletos de más anuncios, lo que podría comprometer la experiencia del usuario",
    "originLink": "https://arstechnica.com/gadgets/2023/11/after-luring-customers-with-low-prices-amazon-stuffs-fire-tvs-with-ads/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38194818",
    "commentBody": "",
    "originSummary": [
      "Amazon está ampliando el número de anuncios en sus televisores Fire TV, ofreciendo a los anunciantes acceso a millones de espectadores mensuales.",
      "Los anuncios estarán vinculados al asistente de inteligencia artificial Alexa, a consultas de búsqueda y a géneros de contenido.",
      "Sin embargo, a algunos usuarios les preocupa que el aumento de anuncios pueda afectar negativamente a la experiencia del usuario y priorizar a los anunciantes sobre los clientes de Fire TV."
    ],
    "commentSummary": [
      "Amazon está añadiendo más anuncios a sus televisores Fire TV, ampliando el alcance para los anunciantes a millones de espectadores mensuales.",
      "Los anuncios se integrarán con la IA generativa Alexa, las consultas de búsqueda y los géneros de contenido.",
      "Sin embargo, la mayor presencia de anuncios podría alterar potencialmente la experiencia del usuario y priorizar a los anunciantes sobre los clientes de Fire TV."
    ],
    "points": 321,
    "commentCount": 268,
    "retryCount": 0,
    "time": 1699468559
  },
  {
    "id": 38188734,
    "title": "Ferrocene: El primer compilador Rust cualificado para entornos críticos de seguridad",
    "originLink": "https://ferrous-systems.com/blog/officially-qualified-ferrocene/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38188734",
    "commentBody": "",
    "originSummary": [
      "Ferrocene es una cadena de herramientas de compilación de Rust que ha sido cualificada conforme a las normas ISO 26262 e IEC 61508.",
      "Es el primer compilador Rust cualificado y es apto para su uso en entornos de seguridad y misión crítica.",
      "El ferroceno ha obtenido la certificación para su uso en los sectores de automoción e industrial y está disponible para su compra con diferentes opciones de licencia."
    ],
    "commentSummary": [
      "Ferrocene es una cadena de herramientas de compilación de Rust que ha obtenido las certificaciones ISO 26262 e IEC 61508, lo que la hace apta para aplicaciones de seguridad y misión crítica.",
      "Es el primer compilador de Rust que recibe tales calificaciones y ha sido certificado para su uso en los sectores de la automoción y la industria.",
      "Ferrocene ya está disponible para su compra con diferentes opciones de licencia, proporcionando a desarrolladores y organizaciones una cadena de herramientas fiable y certificada para sus proyectos."
    ],
    "points": 314,
    "commentCount": 103,
    "retryCount": 0,
    "time": 1699440548
  },
  {
    "id": 38194359,
    "title": "La producción de petróleo y gas de Texas libera el doble de metano que la de Nuevo México, lo que exige una normativa más estricta.",
    "originLink": "https://www.theguardian.com/us-news/2023/nov/08/texas-methane-oil-and-gas-study-climate",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38194359",
    "commentBody": "",
    "originSummary": [
      "Los datos obtenidos por satélite revelan que la producción de petróleo y gas en Texas emite el doble de metano que en Nuevo México, debido a una normativa más estricta en este último estado.",
      "Texas ha estado liberando tasas más altas de metano por unidad de producción desde 2019, lo que potencialmente lo convierte en un sitio \"superemisor\" para el que los ecologistas piden regulaciones más estrictas.",
      "La Agencia de Protección del Medio Ambiente de Estados Unidos (EPA) está ultimando nuevas normas federales para reducir las emisiones de metano, cuyo anuncio está previsto para finales de este mes. Se insta a los gobiernos a tomar medidas rápidas para reducir las emisiones de metano, ya que tendría un impacto significativo en la ralentización del cambio climático."
    ],
    "commentSummary": [
      "Los datos obtenidos por satélite revelan que la producción de petróleo y gas en Texas emite el doble de metano que en Nuevo México, donde la normativa es más estricta.",
      "Texas tiene tasas más altas de emisiones de metano por unidad de producción desde 2019, lo que indica un problema significativo con las fugas de metano.",
      "Los ecologistas piden una normativa más estricta para los \"superemisores\" de Texas a fin de hacer frente al aumento de las emisiones de metano, que suponen una grave amenaza para la lucha contra el cambio climático."
    ],
    "points": 257,
    "commentCount": 102,
    "retryCount": 0,
    "time": 1699466663
  },
  {
    "id": 38191972,
    "title": "La policía de Nueva York, obligada a permitir filmaciones en comisarías tras una demanda",
    "originLink": "https://hellgatenyc.com/you-can-now-film-in-nypd-precincts-thanks-to-this-youtuber",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38191972",
    "commentBody": "",
    "originSummary": [
      "El YouTuber SeanPaul Reyes ha obtenido una orden judicial temporal que le permite filmar en las comisarías de policía de Nueva York tras demandar al departamento por detenerle dos veces por filmar en zonas públicas de las comisarías.",
      "La demanda argumentaba que la política de la policía de Nueva York violaba la Primera Enmienda y las leyes estatales y municipales que protegen el derecho a grabar a la policía.",
      "El juez falló a favor de Reyes, dictando una medida cautelar y ordenando a la policía de Nueva York que retirara los carteles que prohíben filmar en las comisarías. El NYPD tiene previsto apelar la orden y solicita la suspensión de la medida cautelar."
    ],
    "commentSummary": [
      "El YouTuber SeanPaul Reyes, que fue detenido dos veces por la policía de Nueva York por filmar en zonas públicas de comisarías, ha conseguido una orden judicial temporal que le permite filmar en comisarías de la policía de Nueva York.",
      "Reyes celebró la victoria retransmitiendo en directo desde la comisaría 75 con una copia de la orden judicial.",
      "La demanda argumentaba que la política de la policía de Nueva York violaba la Primera Enmienda y las leyes estatales y municipales que garantizan el derecho a grabar a la policía. El juez falló a favor de Reyes, dictando una medida cautelar y ordenando al NYPD que retirara los carteles que prohibían filmar en las comisarías."
    ],
    "points": 243,
    "commentCount": 108,
    "retryCount": 0,
    "time": 1699458194
  }
]
