[
  {
    "id": 38199355,
    "title": "Omegle Kurucusu, Platformun Kötü Niyetli Saldırılar Nedeniyle Kapanmasından Duyduğu Hayal Kırıklığını Dile Getirdi",
    "originLink": "https://www.omegle.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38199355",
    "commentBody": "",
    "originSummary": [
      "Çevrimiçi bir sohbet platformu olan Omegle, kötü niyetli kullanıcıların saldırıları nedeniyle kapatılıyor.",
      "Kurucu Leif K-Brooks hayal kırıklığını dile getiriyor ve platformun olumlu yönlerini vurguluyor.",
      "K-Brooks, masum kullanıcıların hedef alınmamasının ve çevrimiçi hakların korunması için Electronic Frontier Foundation gibi kuruluşların desteklenmesinin önemini vurguluyor."
    ],
    "commentSummary": [
      "Çevrimiçi bir sohbet platformu olan Omegle, kötü niyetli kullanıcıların saldırıları nedeniyle kapatılıyor ve kurucusu Leif K-Brooks'un hayal kırıklığına uğramasına yol açıyor.",
      "K-Brooks, Omegle'ın yeni insanlarla tanışma olanağı ve bazı kullanıcılar için sağladığı güvenlik gibi olumlu yönlerini vurguluyor.",
      "Kısıtlamalar getirilirken masum kullanıcıların ya da potansiyel suç mağdurlarının hedef alınmaması çağrısında bulunuyor ve çevrimiçi hakların korunması için Electronic Frontier Foundation gibi kuruluşların desteklenmesi çağrısında bulunuyor."
    ],
    "points": 1489,
    "commentCount": 584,
    "retryCount": 0,
    "time": 1699490425
  },
  {
    "id": 38188689,
    "title": "Bir Yazılım Mühendisinin Gerçekleri ve Zorlukları: Yumuşak Beceriler, Hatalar, Sürekli Öğrenme ve İş-Yaşam Dengesi",
    "originLink": "https://www.mensurdurakovic.com/hard-to-swallow-truths-they-wont-tell-you-about-software-engineer-job/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38188689",
    "commentBody": "",
    "originSummary": [
      "Yazılım mühendisleri için teknik becerilerin yanı sıra sosyal beceriler de önemlidir.",
      "Yazılım geliştirmede hatalar yaygındır ve düzenli olarak ele alınmalıdır.",
      "Yazılım mühendislerinin sürekli öğrenmesi ve yeni teknolojilerle güncel kalması gerekir.",
      "İşle bağlantıyı kesmek yazılım mühendisleri için zorlayıcı olabilir.",
      "Yazılım mühendisliği, inovasyon ve uzaktan çalışma seçenekleri için fırsatlar sunar.",
      "Bu meslekte yer ve kıyafet açısından esneklik vardır."
    ],
    "commentSummary": [
      "Yazılım mühendisleri için teknik becerilerin yanı sıra iletişim ve ekip çalışması gibi sosyal beceriler de çok önemlidir.",
      "Hatalarla başa çıkmak yazılım mühendisleri için ortak bir zorluktur.",
      "Sürekli gelişen yazılım mühendisliği alanında sürekli öğrenme gereklidir.",
      "İşle bağlantıyı kesmek yazılım mühendisleri için zor olabilir.",
      "Yazılım mühendisliği inovasyon için fırsatlar sunar.",
      "Uzaktan çalışma seçenekleri, konum ve kıyafet esnekliği işin avantajlarıdır."
    ],
    "points": 738,
    "commentCount": 728,
    "retryCount": 0,
    "time": 1699440095
  },
  {
    "id": 38189878,
    "title": "Anlaşmazlıklar ve Nüfus Kaybı Wikipedia'daki Kurumsal Değişimi Nasıl Şekillendiriyor?",
    "originLink": "https://www.cambridge.org/core/journals/american-political-science-review/article/rule-ambiguity-institutional-clashes-and-population-loss-how-wikipedia-became-the-last-good-place-on-the-internet/FC3F7B9CBF951DD30C2648E7DEFB65EE",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38189878",
    "commentBody": "",
    "originSummary": [
      "Makale, nüfus kaybı ve kural yorumlama anlaşmazlıklarına odaklanarak Wikipedia'daki kurumsal değişimi analiz ediyor.",
      "İçsel kurumsal değişime dair kanıt sağlamak için nitel analiz ve süreç takibi kullanılmıştır.",
      "Vikipedi'de istikrar ve uzlaşı ile karar almayı destekleyen önyargılar ve aktörlerin kuralları şekillendirmedeki rolü vurgulanmaktadır."
    ],
    "commentSummary": [
      "Bu makale, nüfus kaybı ve kural yorumları üzerindeki anlaşmazlıklara odaklanarak Wikipedia'da kurumsal değişimin nasıl gerçekleştiğini araştırmaktadır.",
      "Çalışma, Wikipedia'daki içsel kurumsal değişime dair kanıt sağlamak için nitel analiz ve süreç izleme yöntemlerini kullanmaktadır.",
      "Makale, Wikipedia'da istikrar ve fikir birliği ile karar almayı destekleyen önyargıların altını çizmekte ve aktörlerin kuralları şekillendirmedeki rolünü vurgulamaktadır."
    ],
    "points": 495,
    "commentCount": 582,
    "retryCount": 0,
    "time": 1699449221
  },
  {
    "id": 38190401,
    "title": "ChatGPT ve API Hizmetleri için Büyük Kesinti Çözüldü",
    "originLink": "https://status.openai.com/incidents/00fpy0yxrx1q",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38190401",
    "commentBody": "",
    "originSummary": [
      "OpenAI, hem ChatGPT hem de API hizmetlerini etkileyen ve yüksek hata oranlarına neden olan önemli bir kesinti yaşadı.",
      "Sorun yaklaşık 2 saat içinde, TSİ 5:42 - 7:16 arasında tespit edilmiş ve çözülmüştür.",
      "OpenAI bir düzeltme uyguladı ve şu anda olaydan sonra iyileşmenin devam etmesini sağlamak için hizmetleri izliyor."
    ],
    "commentSummary": [
      "OpenAI, ChatGPT ve API hizmetlerinde önemli bir kesinti yaşadı ve bu da yüksek hata oranlarına yol açtı.",
      "Sorun TSİ 5:42 - 7:16 arasında tespit edilip çözülmüş ve sonrasında normal yanıtlar gözlemlenmiştir.",
      "OpenAI bir düzeltme uygulamıştır ve iyileşmenin devam etmesini sağlamak için hizmetleri yakından izlemektedir."
    ],
    "points": 491,
    "commentCount": 507,
    "retryCount": 0,
    "time": 1699452159
  },
  {
    "id": 38189840,
    "title": "Dikey Yaşam: İspanya'da Yüksek Binaların ve Kentsel Yoğunluğun Evrimi",
    "originLink": "https://especiales.eldiario.es/spain-lives-in-flats/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38189840",
    "commentBody": "",
    "originSummary": [
      "Makale, İspanyol şehirlerindeki yüksek binaların ve nüfus yoğunluğunun tarihini ve gelişimini incelemektedir.",
      "Kentsel planlama eğilimlerinin, özellikle kentleşme ve kırsal göç sırasında daha yüksek binaların inşasını nasıl etkilediğini incelemektedir.",
      "Makale, banliyö bölgelerindeki müstakil evler ve apartman dairelerindeki artışa ve şehir planlamasında kompakt ve uyumlu şehirler yaratmaya odaklanılmasına vurgu yapıyor."
    ],
    "commentSummary": [
      "Makale, İspanyol şehirlerindeki yüksek binaların ve nüfus yoğunluğunun tarihini ve büyümesini incelemektedir.",
      "Kentsel planlama eğilimleri, özellikle kentleşme ve kırsaldan göç dönemlerinde daha yüksek binalarda bir artışa tanık olmuştur.",
      "Kompakt ve uyumlu şehirler yaratma konusuna giderek daha fazla vurgu yapılmakta, ancak uygun yükseklik ve yoğunluk konusu hala tartışılmaktadır."
    ],
    "points": 459,
    "commentCount": 405,
    "retryCount": 0,
    "time": 1699448883
  },
  {
    "id": 38188614,
    "title": "Chamberlain Akıllı Garaj Kapısı Açıcılarına Üçüncü Taraf Erişimini Engelledi, Tepkiyle Karşılaştı",
    "originLink": "https://arstechnica.com/gadgets/2023/11/chamberlain-blocks-smart-garage-door-opener-from-working-with-smart-homes/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38188614",
    "commentBody": "",
    "originSummary": [
      "Chamberlain Group, gelişmiş kullanıcı deneyimi ve performansını gerekçe göstererek üçüncü taraf akıllı ev uygulamalarının myQ akıllı garaj kapısı açıcılarına erişimini engelledi.",
      "Eleştirmenler, Chamberlain'in kararının, kendi uygulaması aracılığıyla reklam gösterme ve hizmet satma arzusundan kaynaklandığını savunuyor.",
      "Açık kaynaklı akıllı ev platformu Home Assistant buna karşılık olarak myQ entegrasyonunu kaldırıyor ve tüketicilere müşteri erişimini kısıtlayan şirketleri desteklemekten kaçınmalarını tavsiye ediyor."
    ],
    "commentSummary": [
      "LiftMaster ve Chamberlain gibi popüler garaj kapısı açıcı markalarının sahibi Chamberlain Group, üçüncü taraf akıllı ev uygulamalarının myQ akıllı garaj kapısı açıcılarına erişimini engelledi.",
      "Chamberlain bu kararın kullanıcı deneyimini ve performansını iyileştirdiğini iddia ediyor, ancak eleştirmenler bunun kendi uygulaması aracılığıyla reklam gösterme ve hizmet satma arzusundan kaynaklandığını savunuyor.",
      "Açık kaynaklı akıllı ev platformu Home Assistant, myQ entegrasyonunu sisteminden kaldırıyor ve tüketicilere, müşteri erişimini kısıtlayan şirketleri desteklememelerini tavsiye ediyor."
    ],
    "points": 454,
    "commentCount": 179,
    "retryCount": 0,
    "time": 1699439145
  },
  {
    "id": 38196412,
    "title": "Windows üzerinde Python 3.12 için SciPy: Zorlukların Üstesinden Gelmek ve Başarıya Ulaşmak",
    "originLink": "https://labs.quansight.org/blog/building-scipy-with-flang",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38196412",
    "commentBody": "",
    "originSummary": [
      "Python 3.12 için SciPy gibi paketlerin uyumlu sürümlerini oluşturmak, özellikle Python paketlemesi ve Fortran kodunun kullanımı ile ilgili zorluklar ortaya çıkarmaktadır.",
      "Conda paket yöneticisi ve conda-forge topluluğu bu zorlukların aşılmasında çok önemli bir rol oynamaktadır.",
      "Distutils ve setuptools gibi Python paketleme araçlarının sınırlamaları vardır ve Meson'un bir derleme aracı olarak kullanımı tartışılmaktadır.",
      "Windows için Fortran tabanlı paketlerin oluşturulması ve paketlenmesindeki zorluklar vurgulanmaktadır.",
      "Makalede, Windows üzerinde SciPy için başarılı bir özel araç zinciri oluşturulmasından bahsedilmekte ve katkıda bulunanlara teşekkür edilmektedir.",
      "Diğer paketler üzerindeki olası etkileri nedeniyle LLVM kurulumunda önemli değişiklikler yaparken dikkatli olunması önerilir."
    ],
    "commentSummary": [
      "Python 3.12 için SciPy gibi paketlerin uyumlu sürümlerini oluşturmak, Python paketlemesi ve Fortran kodunun kullanımı ile ilgili zorluklarla birlikte gelir.",
      "Conda ve conda-forge topluluğu bu zorlukların ele alınmasında önemli bir rol oynamaktadır.",
      "Distutils ve setuptools gibi Python paketleme araçlarının sınırlamaları vardır ve Meson bir derleme aracı olarak kullanılır. Windows için Fortran tabanlı paketleri oluşturmak ve paketlemek özellikle zordur.",
      "Windows üzerinde SciPy için özel bir araç zinciri başarıyla oluşturuldu ve katkıda bulunanlara teşekkür edildi.",
      "LLVM kurulumundaki önemli değişikliklere, diğer paketler üzerindeki potansiyel etkisi nedeniyle ihtiyatlı yaklaşılmalıdır."
    ],
    "points": 375,
    "commentCount": 180,
    "retryCount": 0,
    "time": 1699475056
  },
  {
    "id": 38189790,
    "title": "AB, CSAM Tüzüğü Konusunda Danışılan Şirketlerin Listesini Gizlediği İçin \"Kötü Yönetimle\" Suçlanıyor",
    "originLink": "https://www.iccl.ie/news/ombudsman-european-commissions-concealment-of-secret-expert-list-on-csam-regulation-constitutes-maladministration/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38189790",
    "commentBody": "",
    "originSummary": [
      "Avrupa Komisyonu, şifrelemeye zarar vermeden çocuklara yönelik cinsel istismar materyallerini (CSAM) tespit etme konusunda danışılan şirketlerin listesini sakladığı için eleştirildi ve Avrupa Ombudsmanı tarafından \"kötü yönetim\" suçlamalarına yol açtı.",
      "Komisyon'un listeyi açıklamayı reddetmesi nedeniyle şeffaflık ve CSAM yönetmeliğinin hazırlanmasında lobicilerin etkisine ilişkin endişeler gündeme gelmiştir.",
      "Uzmanlar, şifrelenmiş içerikte CSAM tespitinin şu anda mümkün olup olmadığı konusunda farklı görüşler dile getirmiş, bazıları potansiyel kitlesel gözetleme ve AB iletişim izleme yasalarının ihlaline karşı uyarıda bulunmuştur."
    ],
    "commentSummary": [
      "Avrupa Komisyonu, şifrelemeyi tehlikeye atmadan çocuk cinsel istismarı materyalini (CSAM) tespit etme konusunda danışılan şirketlerin listesini sakladığı için \"kötü yönetimle\" suçlandı.",
      "CSAM yönetmeliğinin hazırlanmasında şeffaflık ve lobicilerin etkisi konusunda endişeler dile getirilmiştir.",
      "Uzmanlar şifrelenmiş içerikte CSAM tespitinin uygulanabilirliği ve gerekliliği konusunda farklı görüşlere sahipken, bazıları bunun çocuk istismarıyla mücadele için bir araç olduğunu savunuyor. Önerilen düzenleme, potansiyel kitlesel gözetim ve AB iletişim izleme yasalarının ihlali nedeniyle de eleştirilere maruz kalmıştır."
    ],
    "points": 368,
    "commentCount": 173,
    "retryCount": 0,
    "time": 1699448453
  },
  {
    "id": 38191319,
    "title": "Haritalama Projesi Quake Brutalist Jam II'de Brütalizmin Benzersiz Yorumlarını Sergiliyor",
    "originLink": "https://www.slipseer.com/index.php?resources/quake-brutalist-jam-2.278/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38191319",
    "commentBody": "",
    "originSummary": [
      "Brütalizm mimarisine odaklanan bir haritalama projesi, birden fazla haritalayıcı tarafından oluşturulan 30 seviye üretti.",
      "Proje, Copper adlı bir oyun modunu içeriyor ve hem yeni hem de deneyimli haritacılar tarafından yapılan haritaları içeriyor.",
      "Haritalar, beton cehennem manzaralarından liminal boşluklara kadar Brütalizm'in çeşitli yorumlarını sergiliyor."
    ],
    "commentSummary": [
      "Brütalizm mimarisine odaklanan bir haritalama projesi, hem yeni başlayanlar hem de deneyimli kişiler dahil olmak üzere farklı haritalayıcılar tarafından oluşturulan 30 seviye üretti.",
      "Copper adında bir oyun modu içeren proje, beton cehennem manzaralarından liminal boşluklara kadar Brütalizm'in çeşitli ve etkileyici yorumlarını sunuyor.",
      "Projeyi yüklemek için, kullanıcıların qbj2 klasörünü Quake dizinine açmaları ve tercih ettikleri bir kaynak portu başlatmaları gerekir."
    ],
    "points": 340,
    "commentCount": 94,
    "retryCount": 0,
    "time": 1699455749
  },
  {
    "id": 38195509,
    "title": "Maine Seçmenleri Otomobil Tamir Hakkı Yasasını Onayladı, Otomobil Üreticileri İçin Zorluklar Ortaya Çıktı",
    "originLink": "https://www.404media.co/voters-overwhelmingly-pass-car-right-to-repair-law-in-maine/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38195509",
    "commentBody": "",
    "originSummary": [
      "Maine seçmenleri, otomobil üreticilerinin muhalefetine rağmen, tüketicilere otomobillerini tamir etme hakkı tanıyan bir oy pusulasını onayladı.",
      "Önlem, araç üreticilerinin arıza tespit sistemlerini standart hale getirmelerini ve araç sahipleri ile bağımsız onarım tesislerinin verilere erişimini sağlamalarını zorunlu kılıyor.",
      "Bu zafer, geçen yıl Massachusetts'te kabul edilen benzer bir önlemin ardından geldi ve onarım hakkı korumaları için ülke çapındaki hareketi güçlendirdi."
    ],
    "commentSummary": [
      "Maine seçmenleri, araç sahiplerine ve bağımsız onarım tesislerine araç üreticilerinin verilerine ve standartlaştırılmış teşhis sistemlerine erişim hakkı tanıyan bir oylama önlemini onayladı.",
      "Bu durum, bu tür bir mevzuata karşı çıkan otomobil üreticileri için bir gerileme anlamına gelmektedir.",
      "Yasanın gerekli görülmesinin nedeni, üreticilerin araç arıza tespitinde giderek daha fazla kablosuz erişim kullanması ve bunun da bağımsız onarımlara erişimi kısıtlamasıdır."
    ],
    "points": 323,
    "commentCount": 101,
    "retryCount": 0,
    "time": 1699471202
  },
  {
    "id": 38194818,
    "title": "Amazon'un Fire TV'leri artık kullanıcı deneyimini tehlikeye atabilecek daha fazla reklamla dolu",
    "originLink": "https://arstechnica.com/gadgets/2023/11/after-luring-customers-with-low-prices-amazon-stuffs-fire-tvs-with-ads/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38194818",
    "commentBody": "",
    "originSummary": [
      "Amazon, Fire TV'lerindeki reklam sayısını artırarak reklamverenlere aylık milyonlarca izleyiciye erişim imkanı sunuyor.",
      "Reklamlar yapay zeka asistanı Alexa, arama sorguları ve içerik türleriyle bağlantılı olacak.",
      "Ancak bazı kullanıcılar, artan reklamların kullanıcı deneyimini olumsuz etkileyebileceğinden ve Fire TV müşterileri yerine reklamverenlere öncelik verebileceğinden endişe ediyor."
    ],
    "commentSummary": [
      "Amazon, Fire TV'lerine daha fazla reklam ekleyerek reklamverenlerin erişim alanını aylık milyonlarca izleyiciye genişletiyor.",
      "Reklamlar, üretici yapay zeka Alexa, arama sorguları ve içerik türleriyle entegre edilecek.",
      "Bununla birlikte, artan reklam varlığı potansiyel olarak kullanıcı deneyimini bozabilir ve reklamverenlere Fire TV müşterileri yerine öncelik verebilir."
    ],
    "points": 321,
    "commentCount": 268,
    "retryCount": 0,
    "time": 1699468559
  },
  {
    "id": 38188734,
    "title": "Ferrocene: Güvenlik Açısından Kritik Ortamlar için İlk Nitelikli Rust Derleyicisi",
    "originLink": "https://ferrous-systems.com/blog/officially-qualified-ferrocene/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38188734",
    "commentBody": "",
    "originSummary": [
      "Ferrocene, ISO 26262 ve IEC 61508 standartlarına göre kalifiye edilmiş bir Rust derleyici araç zinciridir.",
      "İlk nitelikli Rust derleyicisidir ve güvenlik ve görev açısından kritik ortamlarda kullanım için uygundur.",
      "Ferrocene, otomotiv ve endüstriyel sektörlerde kullanım için sertifika almıştır ve farklı lisanslama seçenekleriyle satın alınabilir."
    ],
    "commentSummary": [
      "Ferrocene, ISO 26262 ve IEC 61508 sertifikalarına sahip bir Rust derleyici araç zinciridir, bu da onu güvenlik ve görev açısından kritik uygulamalar için uygun hale getirir.",
      "Bu tür niteliklere sahip ilk Rust derleyicisidir ve otomotiv ve sanayi sektörlerinde kullanım için onaylanmıştır.",
      "Geliştiricilere ve kuruluşlara projeleri için güvenilir ve sertifikalı bir araç zinciri sağlayan Ferrocene artık farklı lisanslama seçenekleriyle satın alınabilir."
    ],
    "points": 314,
    "commentCount": 103,
    "retryCount": 0,
    "time": 1699440548
  },
  {
    "id": 38194359,
    "title": "Teksas Petrol ve Gaz Üretimi, New Mexico'ya Kıyasla İki Kat Daha Fazla Metan Salınımına Yol Açarak Daha Sıkı Düzenlemeler Getirilmesi Çağrısında Bulunulmasına Neden Oldu",
    "originLink": "https://www.theguardian.com/us-news/2023/nov/08/texas-methane-oil-and-gas-study-climate",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38194359",
    "commentBody": "",
    "originSummary": [
      "Uydu verileri, Teksas'taki petrol ve gaz üretiminin, New Mexico'daki daha katı düzenlemeler nedeniyle bu eyalete kıyasla iki kat daha fazla metan gazı yaydığını ortaya koymaktadır.",
      "Teksas, 2019'dan bu yana birim üretim başına daha yüksek oranlarda metan salıyor ve bu da onu çevrecilerin daha sert düzenlemeler talep ettiği bir \"süper yayıcı\" saha haline getiriyor.",
      "ABD Çevre Koruma Ajansı (EPA) metan emisyonlarını azaltmaya yönelik yeni federal kurallara son şeklini veriyor ve bu kuralların bu ay içinde açıklanması bekleniyor. Hükümetler, iklim değişikliğinin yavaşlatılmasında önemli bir etkiye sahip olacağı için metan emisyonlarını azaltmak üzere hızla harekete geçmeye çağırılıyor."
    ],
    "commentSummary": [
      "Uydu verileri, Teksas'taki petrol ve gaz üretiminin, daha sıkı düzenlemelere sahip olan New Mexico'ya kıyasla iki kat daha fazla metan gazı yaydığını ortaya koymaktadır.",
      "Teksas, 2019'dan bu yana birim üretim başına daha yüksek metan emisyonu oranlarına sahiptir ve bu da metan sızıntılarıyla ilgili önemli bir soruna işaret etmektedir.",
      "Çevreciler, iklim değişikliğiyle mücadelede büyük bir tehdit oluşturan metan emisyonlarındaki artışı ele almak için Teksas'taki \"süper emitör\" sahalarına yönelik daha sert düzenlemeler yapılması çağrısında bulunuyor."
    ],
    "points": 257,
    "commentCount": 102,
    "retryCount": 0,
    "time": 1699466663
  },
  {
    "id": 38191972,
    "title": "NYPD Açılan Dava Sonucunda Karakollarda Film Çekimine İzin Verdi",
    "originLink": "https://hellgatenyc.com/you-can-now-film-in-nypd-precincts-thanks-to-this-youtuber",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38191972",
    "commentBody": "",
    "originSummary": [
      "YouTuber SeanPaul Reyes, karakolların kamuya açık alanlarında çekim yaptığı için kendisini iki kez tutuklayan polis teşkilatına açtığı davanın ardından New York Polis Teşkilatı karakollarında çekim yapmasına izin veren geçici bir tedbir kararı aldı.",
      "Dava, NYPD'nin politikasının Birinci Anayasa Değişikliği'ni ve polisi kaydetme hakkını koruyan eyalet ve şehir yasalarını ihlal ettiğini savunuyordu.",
      "Yargıç Reyes lehine karar vererek geçici bir tedbir kararı aldı ve NYPD'ye polis karakollarında film çekmeyi yasaklayan işaretleri kaldırmasını emretti. NYPD kararı temyize götürmeyi planlıyor ve tedbir kararının durdurulmasını talep ediyor."
    ],
    "commentSummary": [
      "Polis karakollarının kamuya açık alanlarında çekim yaptığı için NYPD tarafından iki kez tutuklanan YouTuber SeanPaul Reyes, NYPD karakollarında çekim yapmasına izin veren geçici bir tedbir kararı aldı.",
      "Reyes zaferini 75. Bölgeden mahkeme kararının bir kopyasıyla canlı yayın yaparak kutladı.",
      "Dava, NYPD'nin politikasının Birinci Değişikliği ve polisi kaydetme hakkını garanti altına alan eyalet ve şehir yasalarını ihlal ettiğini savunuyordu. Yargıç Reyes lehine karar vererek geçici bir tedbir kararı aldı ve NYPD'ye polis karakollarında çekim yapılmasını yasaklayan tabelaları kaldırması talimatını verdi."
    ],
    "points": 243,
    "commentCount": 108,
    "retryCount": 0,
    "time": 1699458194
  }
]
