[
  {
    "id": 38199355,
    "title": "ক্ষতিকারক আক্রমণের কারণে প্ল্যাটফর্ম বন্ধ হয়ে যাওয়ায় ওমেগল প্রতিষ্ঠাতা হতাশা প্রকাশ করেছেন",
    "originLink": "https://www.omegle.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38199355",
    "commentBody": "",
    "originSummary": [
      "দূষিত ব্যবহারকারীদের আক্রমণের কারণে বন্ধ হয়ে যাচ্ছে অনলাইন চ্যাট প্ল্যাটফর্ম ওমেগল।",
      "প্রতিষ্ঠাতা লেইফ কে-ব্রুকস হতাশা প্রকাশ করেছেন এবং প্ল্যাটফর্মের ইতিবাচক দিকগুলি তুলে ধরেছেন।",
      "কে-ব্রুকস নিরপরাধ ব্যবহারকারীদের টার্গেট না করার এবং অনলাইন অধিকার রক্ষার জন্য ইলেকট্রনিক ফ্রন্টিয়ার ফাউন্ডেশনের মতো সংস্থাগুলিকে সমর্থন করার গুরুত্বের উপর জোর দেয়।"
    ],
    "commentSummary": [
      "দূষিত ব্যবহারকারীদের আক্রমণের কারণে অনলাইন চ্যাট প্ল্যাটফর্ম ওমেগল বন্ধ হয়ে যাচ্ছে, যার ফলে প্রতিষ্ঠাতা লিফ কে-ব্রুকস হতাশা প্রকাশ করেছেন।",
      "কে-ব্রুকস ওমেগলের ইতিবাচক দিকগুলির উপর জোর দেয়, যেমন নতুন লোকের সাথে দেখা করার ক্ষমতা এবং এটি কিছু ব্যবহারকারীদের জন্য সরবরাহ করা সুরক্ষা।",
      "তিনি বিধিনিষেধ আরোপের সময় নিরপরাধ ব্যবহারকারী বা অপরাধের সম্ভাব্য শিকারদের টার্গেট না করার আহ্বান জানান এবং অনলাইন অধিকার রক্ষায় ইলেকট্রনিক ফ্রন্টিয়ার ফাউন্ডেশনের মতো সংস্থার সমর্থনের আহ্বান জানান।"
    ],
    "points": 1489,
    "commentCount": 584,
    "retryCount": 0,
    "time": 1699490425
  },
  {
    "id": 38188689,
    "title": "একটি সফ্টওয়্যার ইঞ্জিনিয়ারের বাস্তবতা এবং চ্যালেঞ্জ: নরম দক্ষতা, বাগ, ধ্রুবক শিক্ষা এবং কর্ম-জীবন ভারসাম্য",
    "originLink": "https://www.mensurdurakovic.com/hard-to-swallow-truths-they-wont-tell-you-about-software-engineer-job/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38188689",
    "commentBody": "",
    "originSummary": [
      "প্রযুক্তিগত দক্ষতার পাশাপাশি সফ্টওয়্যার ইঞ্জিনিয়ারদের জন্য নরম দক্ষতা গুরুত্বপূর্ণ।",
      "সফ্টওয়্যার ডেভেলপমেন্টে বাগগুলি সাধারণ এবং নিয়মিত মোকাবেলা করা আবশ্যক।",
      "সফটওয়্যার প্রকৌশলীদের ক্রমাগত শিখতে হবে এবং নতুন প্রযুক্তির সাথে আপডেট থাকতে হবে।",
      "কাজ থেকে সংযোগ বিচ্ছিন্ন করা সফ্টওয়্যার ইঞ্জিনিয়ারদের জন্য চ্যালেঞ্জিং হতে পারে।",
      "সফ্টওয়্যার ইঞ্জিনিয়ারিং উদ্ভাবন এবং দূরবর্তী কাজের বিকল্পগুলির জন্য সুযোগ সরবরাহ করে।",
      "এই পেশায় অবস্থান এবং ড্রেস কোডের ক্ষেত্রে নমনীয়তা রয়েছে।"
    ],
    "commentSummary": [
      "প্রযুক্তিগত দক্ষতা ছাড়াও সফ্টওয়্যার প্রকৌশলীদের জন্য যোগাযোগ এবং টিমওয়ার্কের মতো নরম দক্ষতা অত্যন্ত গুরুত্বপূর্ণ।",
      "সফ্টওয়্যার ইঞ্জিনিয়ারদের জন্য বাগগুলি মোকাবেলা করা একটি সাধারণ চ্যালেঞ্জ।",
      "সফ্টওয়্যার ইঞ্জিনিয়ারিংয়ের ক্রমাগত বিকশিত ক্ষেত্রে ক্রমাগত শেখা প্রয়োজন।",
      "কাজ থেকে সংযোগ বিচ্ছিন্ন করা সফ্টওয়্যার ইঞ্জিনিয়ারদের জন্য কঠিন হতে পারে।",
      "সফটওয়্যার ইঞ্জিনিয়ারিং উদ্ভাবনের সুযোগ দেয়।",
      "দূরবর্তী কাজের বিকল্প এবং অবস্থান এবং ড্রেস কোডে নমনীয়তা কাজের সুবিধা।"
    ],
    "points": 738,
    "commentCount": 728,
    "retryCount": 0,
    "time": 1699440095
  },
  {
    "id": 38189878,
    "title": "বিরোধ এবং জনসংখ্যা হ্রাস কীভাবে উইকিপিডিয়ায় প্রাতিষ্ঠানিক পরিবর্তনকে আকার দেয়",
    "originLink": "https://www.cambridge.org/core/journals/american-political-science-review/article/rule-ambiguity-institutional-clashes-and-population-loss-how-wikipedia-became-the-last-good-place-on-the-internet/FC3F7B9CBF951DD30C2648E7DEFB65EE",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38189878",
    "commentBody": "",
    "originSummary": [
      "নিবন্ধটি উইকিপিডিয়ায় প্রাতিষ্ঠানিক পরিবর্তন বিশ্লেষণ করে, জনসংখ্যা হ্রাস এবং নিয়ম ব্যাখ্যা বিরোধের উপর দৃষ্টি নিবদ্ধ করে।",
      "গুণগত বিশ্লেষণ এবং প্রক্রিয়া ট্রেসিং এন্ডোজেনাস প্রাতিষ্ঠানিক পরিবর্তনের প্রমাণ সরবরাহ করতে ব্যবহৃত হয়।",
      "উইকিপিডিয়ার মধ্যে স্থিতিশীলতা এবং সর্বসম্মত সিদ্ধান্ত গ্রহণের পক্ষে পক্ষপাতিত্বগুলি তুলে ধরা হয়েছে, পাশাপাশি নিয়ম গঠনে অভিনেতাদের ভূমিকাও তুলে ধরা হয়েছে।"
    ],
    "commentSummary": [
      "এই নিবন্ধটি উইকিপিডিয়ার মধ্যে প্রাতিষ্ঠানিক পরিবর্তন কীভাবে ঘটে তা অন্বেষণ করে, জনসংখ্যা হ্রাস এবং নিয়ম ব্যাখ্যা নিয়ে বিরোধের উপর দৃষ্টি নিবদ্ধ করে।",
      "অধ্যয়নটি উইকিপিডিয়ায় এন্ডোজেনাস প্রাতিষ্ঠানিক পরিবর্তনের প্রমাণ সরবরাহ ের জন্য গুণগত বিশ্লেষণ এবং প্রক্রিয়া অনুসন্ধান ব্যবহার করে।",
      "নিবন্ধটি উইকিপিডিয়ায় স্থিতিশীলতা এবং সর্বসম্মত সিদ্ধান্ত গ্রহণের পক্ষে পক্ষপাতিত্বকে তুলে ধরেছে এবং নিয়মগঠনে অভিনেতাদের ভূমিকার উপর জোর দিয়েছে।"
    ],
    "points": 495,
    "commentCount": 582,
    "retryCount": 0,
    "time": 1699449221
  },
  {
    "id": 38190401,
    "title": "ChatGPT এবং API পরিষেবাগুলির জন্য প্রধান বিভ্রাটের সমাধান করা হয়েছে",
    "originLink": "https://status.openai.com/incidents/00fpy0yxrx1q",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38190401",
    "commentBody": "",
    "originSummary": [
      "ওপেনএআই একটি উল্লেখযোগ্য বিভ্রাটের সম্মুখীন হয়েছিল যা তাদের চ্যাটজিপিটি এবং এপিআই পরিষেবা উভয়কেই প্রভাবিত করেছিল, যার ফলে উচ্চ ত্রুটির হার হয়েছিল।",
      "সমস্যাটি সনাক্ত করা হয়েছিল এবং প্রায় 2 ঘন্টার ব্যবধানে, ভোর 5:42 থেকে সকাল 7:16 এর মধ্যে সমাধান করা হয়েছিল।",
      "ওপেনএআই একটি ফিক্স বাস্তবায়ন করেছে এবং বর্তমানে ঘটনাটি থেকে অব্যাহত পুনরুদ্ধার নিশ্চিত করার জন্য পরিষেবাগুলি পর্যবেক্ষণ করছে।"
    ],
    "commentSummary": [
      "ওপেনএআই তার চ্যাটজিপিটি এবং এপিআই পরিষেবাগুলিতে একটি উল্লেখযোগ্য বিভ্রাটের সম্মুখীন হয়েছিল, যার ফলে উচ্চ ত্রুটির হার হয়েছিল।",
      "সমস্যাটি সনাক্ত করা হয়েছিল এবং সকাল 5:42 টা থেকে 7:16 এএম পিটি এর মধ্যে সমাধান করা হয়েছিল এবং পরে স্বাভাবিক প্রতিক্রিয়া দেখা গেছে।",
      "ওপেনএআই একটি ফিক্স বাস্তবায়ন করেছে এবং ক্রমাগত পুনরুদ্ধার নিশ্চিত করার জন্য পরিষেবাগুলি নিবিড়ভাবে পর্যবেক্ষণ করছে।"
    ],
    "points": 491,
    "commentCount": 507,
    "retryCount": 0,
    "time": 1699452159
  },
  {
    "id": 38189840,
    "title": "উল্লম্ব জীবনযাপন: স্পেনে উঁচু বিল্ডিং এবং শহুরে ঘনত্বের বিবর্তন",
    "originLink": "https://especiales.eldiario.es/spain-lives-in-flats/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38189840",
    "commentBody": "",
    "originSummary": [
      "নিবন্ধটি স্প্যানিশ শহরগুলিতে বহুতল ভবন এবং জনসংখ্যার ঘনত্বের ইতিহাস এবং বিবর্তনের দিকে নজর দেয়।",
      "এটি পরীক্ষা করে দেখেছে যে নগর পরিকল্পনার প্রবণতাগুলি কীভাবে উঁচু বিল্ডিং নির্মাণকে প্রভাবিত করেছে, বিশেষত নগরায়ন এবং গ্রামীণ প্রস্থানের সময়।",
      "নিবন্ধটি শহরতলি অঞ্চলে একক-পরিবারের বাড়ি এবং অ্যাপার্টমেন্টগুলির উত্থান এবং নগর পরিকল্পনায় কম্প্যাক্ট এবং সমন্বিত শহর তৈরির উপর বর্তমান ফোকাসের উপর জোর দেয়।"
    ],
    "commentSummary": [
      "নিবন্ধটি স্প্যানিশ শহরগুলিতে বহুতল ভবনের ইতিহাস এবং বৃদ্ধি এবং জনসংখ্যার ঘনত্ব পরীক্ষা করে।",
      "নগর পরিকল্পনার প্রবণতাগুলি লম্বা বিল্ডিংগুলিতে বৃদ্ধি পেয়েছে, বিশেষত নগরায়ণ এবং গ্রামীণ প্রস্থানের সময়কালে।",
      "কম্প্যাক্ট এবং সংহত শহর তৈরির উপর ক্রমবর্ধমান জোর দেওয়া হচ্ছে, তবে উপযুক্ত উচ্চতা এবং ঘনত্বের প্রশ্নটি এখনও বিতর্কিত।"
    ],
    "points": 459,
    "commentCount": 405,
    "retryCount": 0,
    "time": 1699448883
  },
  {
    "id": 38188614,
    "title": "চেম্বারলাইন স্মার্ট গ্যারেজ ডোর ওপেনারগুলিতে তৃতীয় পক্ষের অ্যাক্সেস ব্লক করে, প্রতিক্রিয়ার মুখোমুখি",
    "originLink": "https://arstechnica.com/gadgets/2023/11/chamberlain-blocks-smart-garage-door-opener-from-working-with-smart-homes/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38188614",
    "commentBody": "",
    "originSummary": [
      "উন্নত ব্যবহারকারীর অভিজ্ঞতা এবং পারফরম্যান্সের কথা উল্লেখ করে চেম্বারলেইন গ্রুপ তৃতীয় পক্ষের স্মার্ট হোম অ্যাপ্লিকেশনগুলিকে তাদের মাইকিউ স্মার্ট গ্যারেজ ডোর ওপেনারগুলিতে অ্যাক্সেস করতে বাধা দিয়েছে।",
      "সমালোচকরা যুক্তি দেখান যে চেম্বারলাইনের সিদ্ধান্তটি বিজ্ঞাপন প্রদর্শন এবং নিজস্ব অ্যাপের মাধ্যমে পরিষেবা গুলি বিক্রি করার আকাঙ্ক্ষা দ্বারা চালিত।",
      "ওপেন-সোর্স স্মার্ট হোম প্ল্যাটফর্ম হোম অ্যাসিস্ট্যান্ট প্রতিক্রিয়াহিসাবে মাইকিউ ইন্টিগ্রেশনটি সরিয়ে ফেলছে এবং গ্রাহকদের গ্রাহকঅ্যাক্সেস সীমাবদ্ধ করে এমন সংস্থাগুলিকে সমর্থন করা এড়াতে পরামর্শ দেয়।"
    ],
    "commentSummary": [
      "লিফটমাস্টার এবং চেম্বারলাইনের মতো জনপ্রিয় গ্যারেজ ডোর ওপেনার ব্র্যান্ডের মালিক চেম্বারলেইন গ্রুপ তৃতীয় পক্ষের স্মার্ট হোম অ্যাপ্লিকেশনগুলিকে তাদের মাইকিউ স্মার্ট গ্যারেজ ডোর ওপেনারগুলিতে অ্যাক্সেস করতে বাধা দিয়েছে।",
      "চেম্বারলেইন দাবি করেছেন যে এই সিদ্ধান্তটি ব্যবহারকারীর অভিজ্ঞতা এবং কর্মক্ষমতা উন্নত করে, তবে সমালোচকরা যুক্তি দেন যে এটি নিজস্ব অ্যাপের মাধ্যমে বিজ্ঞাপন এবং আপসেল পরিষেবাগুলি প্রদর্শনের আকাঙ্ক্ষা দ্বারা চালিত হয়।",
      "ওপেন-সোর্স স্মার্ট হোম প্ল্যাটফর্ম হোম অ্যাসিস্ট্যান্ট তার সিস্টেম থেকে মাইকিউ ইন্টিগ্রেশন সরিয়ে ফেলছে এবং গ্রাহকদের গ্রাহকদের অ্যাক্সেস সীমাবদ্ধ করে এমন সংস্থাগুলিকে সমর্থন না করার পরামর্শ দিচ্ছে।"
    ],
    "points": 454,
    "commentCount": 179,
    "retryCount": 0,
    "time": 1699439145
  },
  {
    "id": 38196412,
    "title": "উইন্ডোজে পাইথন 3.12 এর জন্য SciPy: চ্যালেঞ্জগুলি অতিক্রম করা এবং সাফল্য অর্জন করা",
    "originLink": "https://labs.quansight.org/blog/building-scipy-with-flang",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38196412",
    "commentBody": "",
    "originSummary": [
      "পাইথন 3.12 এর জন্য SciPy এর মতো প্যাকেজগুলির সামঞ্জস্যপূর্ণ রিলিজ তৈরি করা চ্যালেঞ্জগুলি উপস্থাপন করে, বিশেষত পাইথন প্যাকেজিং এবং ফোরট্রান কোড ব্যবহারের সাথে।",
      "কনডা প্যাকেজ ম্যানেজার এবং কনডা-ফোর্জ সম্প্রদায় এই চ্যালেঞ্জগুলি মোকাবেলায় গুরুত্বপূর্ণ ভূমিকা পালন করে।",
      "ডিস্টুটিলস এবং সেটআপটুলের মতো পাইথন প্যাকেজিং সরঞ্জামগুলির সীমাবদ্ধতা রয়েছে এবং বিল্ড সরঞ্জাম হিসাবে মেসনের ব্যবহার নিয়ে আলোচনা করা হয়েছে।",
      "উইন্ডোজের জন্য ফোরট্রান-ভিত্তিক প্যাকেজগুলি তৈরি এবং প্যাকেজিংয়ে অসুবিধাগুলি তুলে ধরা হয়েছে।",
      "নিবন্ধটি উইন্ডোজে সাইপির জন্য একটি টুলচেইনের সফল কাস্টম-বিল্ডের উল্লেখ করে এবং অবদানকারীদের প্রতি কৃতজ্ঞতা প্রকাশ করে।",
      "অন্যান্য প্যাকেজগুলিতে সম্ভাব্য প্রভাবের কারণে এলএলভিএম সেটআপে উল্লেখযোগ্য পরিবর্তন করার সময় সাবধানতা অবলম্বন করার পরামর্শ দেওয়া হয়।"
    ],
    "commentSummary": [
      "পাইথন 3.12 এর জন্য SciPy এর মতো প্যাকেজগুলির সামঞ্জস্যপূর্ণ রিলিজ গুলি পাইথন প্যাকেজিং এবং ফোরট্রান কোডের ব্যবহার সম্পর্কিত চ্যালেঞ্জগুলির সাথে আসে।",
      "কন্ডা এবং কনডা-ফোর্জ সম্প্রদায় এই চ্যালেঞ্জগুলি মোকাবেলায় গুরুত্বপূর্ণ ভূমিকা পালন করে।",
      "পাইথন প্যাকেজিং সরঞ্জাম যেমন ডিস্টুটিলস এবং সেটআপটুলগুলির সীমাবদ্ধতা রয়েছে এবং মেসন একটি বিল্ড সরঞ্জাম হিসাবে ব্যবহৃত হয়। উইন্ডোজের জন্য ফোরট্রান-ভিত্তিক প্যাকেজগুলি তৈরি এবং প্যাকেজিং বিশেষত কঠিন।",
      "উইন্ডোজে SciPy এর জন্য একটি কাস্টম টুলচেইন সফলভাবে নির্মিত হয়েছিল, এবং অবদানকারীদের প্রতি কৃতজ্ঞতা প্রকাশ করা হয়।",
      "অন্যান্য প্যাকেজগুলিতে সম্ভাব্য প্রভাবের কারণে এলএলভিএম সেটআপে উল্লেখযোগ্য পরিবর্তনগুলি সতর্কতার সাথে করা উচিত।"
    ],
    "points": 375,
    "commentCount": 180,
    "retryCount": 0,
    "time": 1699475056
  },
  {
    "id": 38189790,
    "title": "ইইউ'র বিরুদ্ধে CSAM প্রবিধান সম্পর্কিত পরামর্শপ্রাপ্ত কোম্পানির তালিকা গোপন করার জন্য \"অপশাসনের\" অভিযোগ",
    "originLink": "https://www.iccl.ie/news/ombudsman-european-commissions-concealment-of-secret-expert-list-on-csam-regulation-constitutes-maladministration/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38189790",
    "commentBody": "",
    "originSummary": [
      "এনক্রিপশনকে অবজ্ঞা না করে শিশু যৌন নিপীড়নের উপাদান (CSAM) সনাক্ত করার বিষয়ে পরামর্শ দেওয়া সংস্থাগুলির একটি তালিকা আটকে রাখার জন্য ইউরোপীয় কমিশন সমালোচিত হয়েছে, যার ফলে ইউরোপীয় ওম্বুডসম্যান কর্তৃক \"অপশাসনের\" অভিযোগ উঠেছে।",
      "CSAM বিধিমালার খসড়া প্রণয়নে স্বচ্ছতা এবং লবিস্টদের প্রভাব নিয়ে উদ্বেগ প্রকাশ করা হয়েছে কারণ কমিশন তালিকা প্রকাশ করতে অস্বীকার করেছে।",
      "এনক্রিপ্টেড সামগ্রীতে CSAM সনাক্ত করা বর্তমানে সম্ভব কিনা তা নিয়ে বিশেষজ্ঞরা ভিন্ন মত প্রকাশ করেছেন, সম্ভাব্য গণ নজরদারি এবং ইইউ যোগাযোগ পর্যবেক্ষণ আইন লঙ্ঘনের বিরুদ্ধে কিছু সতর্কতা সহ।"
    ],
    "commentSummary": [
      "এনক্রিপশনের সাথে আপস না করে শিশু যৌন নির্যাতনের উপাদান (CSAM) সনাক্তকরণের বিষয়ে পরামর্শ নেওয়া সংস্থাগুলির একটি তালিকা আটকে রাখার জন্য ইউরোপীয় কমিশনের বিরুদ্ধে \"অপশাসনের\" অভিযোগ আনা হয়েছে।",
      "CSAM বিধিমালার খসড়া প্রণয়নে স্বচ্ছতা এবং লবিস্টদের প্রভাব নিয়ে উদ্বেগ প্রকাশ করা হয়েছে।",
      "এনক্রিপ্টেড সামগ্রীতে CSAM সনাক্ত করণের সম্ভাব্যতা এবং প্রয়োজনীয়তা সম্পর্কে বিশেষজ্ঞদের বিভিন্ন মতামত রয়েছে, কেউ কেউ শিশু শোষণের বিরুদ্ধে লড়াইয়ের সরঞ্জাম হিসাবে এটির পক্ষে যুক্তি দিয়েছেন। প্রস্তাবিত বিধিটি সম্ভাব্য গণ নজরদারি এবং ইইউ যোগাযোগ পর্যবেক্ষণ আইন লঙ্ঘনের জন্যও সমালোচনার মুখোমুখি হয়েছে।"
    ],
    "points": 368,
    "commentCount": 173,
    "retryCount": 0,
    "time": 1699448453
  },
  {
    "id": 38191319,
    "title": "ম্যাপিং প্রজেক্ট ভূমিকম্পের নৃশংসতাবাদী জ্যাম ২-এ নৃশংসতার অনন্য ব্যাখ্যা প্রদর্শন করে",
    "originLink": "https://www.slipseer.com/index.php?resources/quake-brutalist-jam-2.278/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38191319",
    "commentBody": "",
    "originSummary": [
      "নৃশংসতা আর্কিটেকচারের উপর দৃষ্টি নিবদ্ধ করে একটি ম্যাপিং প্রকল্প একাধিক ম্যাপার দ্বারা তৈরি 30 টি স্তর তৈরি করেছে।",
      "প্রকল্পটিতে কপার নামে একটি গেমপ্লে মোড অন্তর্ভুক্ত রয়েছে এবং নতুন এবং অভিজ্ঞ উভয় ম্যাপারদের দ্বারা তৈরি মানচিত্র রয়েছে।",
      "মানচিত্রগুলি কংক্রিট নরকস্কেপ থেকে লিমিনাল শূন্যতা পর্যন্ত নৃশংসতার বিভিন্ন ব্যাখ্যা প্রদর্শন করে।"
    ],
    "commentSummary": [
      "নৃশংসতা আর্কিটেকচারের উপর দৃষ্টি নিবদ্ধ করে একটি ম্যাপিং প্রকল্প নতুন এবং অভিজ্ঞ ব্যক্তি উভয়ই সহ বিভিন্ন ম্যাপারদের দ্বারা তৈরি 30 টি স্তর তৈরি করেছে।",
      "প্রকল্পটিতে কপার নামে একটি গেমপ্লে মোড অন্তর্ভুক্ত রয়েছে এবং কংক্রিট নরকস্কেপ থেকে শুরু করে লিমিনাল শূন্যতা পর্যন্ত নৃশংসতার বৈচিত্র্যময় এবং চিত্তাকর্ষক ব্যাখ্যা সরবরাহ করে।",
      "প্রকল্পটি ইনস্টল করতে, ব্যবহারকারীদের কিউবিজে 2 ফোল্ডারটি কোয়েক ডিরেক্টরিতে আনজিপ করতে হবে এবং তাদের পছন্দের একটি সোর্সপোর্ট চালু করতে হবে।"
    ],
    "points": 340,
    "commentCount": 94,
    "retryCount": 0,
    "time": 1699455749
  },
  {
    "id": 38195509,
    "title": "মেইন ভোটাররা গাড়ি মেরামতের অধিকার আইন অনুমোদন করেছে, অটো নির্মাতাদের জন্য চ্যালেঞ্জ তৈরি করেছে",
    "originLink": "https://www.404media.co/voters-overwhelmingly-pass-car-right-to-repair-law-in-maine/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38195509",
    "commentBody": "",
    "originSummary": [
      "মেইন ভোটাররা একটি ব্যালট ব্যবস্থা অনুমোদন করেছেন যা অটো নির্মাতাদের বিরোধিতা সত্ত্বেও ভোক্তাদের গাড়ি মেরামত করার অধিকার দেয়।",
      "এই পরিমাপটি যানবাহন নির্মাতাদের ডায়াগনস্টিক সিস্টেমগুলিকে স্ট্যান্ডার্ডাইজ করতে এবং মালিকদের এবং স্বতন্ত্র মেরামত সুবিধাগুলির জন্য ডেটা অ্যাক্সেস দেওয়ার আদেশ দেয়।",
      "এই বিজয় গত বছর ম্যাসাচুসেটসে পাস হওয়া অনুরূপ একটি পদক্ষেপ অনুসরণ করে এবং মেরামতের অধিকারের সুরক্ষার জন্য দেশব্যাপী আন্দোলনকে শক্তিশালী করে।"
    ],
    "commentSummary": [
      "মেইন ভোটাররা একটি ব্যালট ব্যবস্থা অনুমোদন করেছেন যা গাড়ির মালিক এবং স্বতন্ত্র মেরামত সুবিধাগুলিকে যানবাহন নির্মাতাদের কাছ থেকে ডেটা এবং স্ট্যান্ডার্ডাইজড ডায়াগনস্টিক সিস্টেমঅ্যাক্সেস করার অধিকার দেয়।",
      "এই ধরনের আইনের বিরোধিতা কারী অটো নির্মাতাদের জন্য এটি একটি ধাক্কা।",
      "আইনটি প্রয়োজনীয় হিসাবে দেখা হচ্ছে কারণ নির্মাতারা গাড়ি ডায়াগনস্টিকগুলিতে ক্রমবর্ধমান ওয়্যারলেস অ্যাক্সেস ব্যবহার করছেন, যা স্বাধীন মেরামতের অ্যাক্সেসকে সীমাবদ্ধ করে।"
    ],
    "points": 323,
    "commentCount": 101,
    "retryCount": 0,
    "time": 1699471202
  },
  {
    "id": 38194818,
    "title": "অ্যামাজনের ফায়ার টিভিগুলি এখন আরও বিজ্ঞাপনে ভরা, সম্ভাব্য ব্যবহারকারীর অভিজ্ঞতার সাথে আপস করা",
    "originLink": "https://arstechnica.com/gadgets/2023/11/after-luring-customers-with-low-prices-amazon-stuffs-fire-tvs-with-ads/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38194818",
    "commentBody": "",
    "originSummary": [
      "অ্যামাজন তার ফায়ার টিভিতে বিজ্ঞাপনের সংখ্যা প্রসারিত করছে, বিজ্ঞাপনদাতাদের লক্ষ লক্ষ মাসিক দর্শকদের অ্যাক্সেস দিচ্ছে।",
      "বিজ্ঞাপনগুলি এআই সহকারী অ্যালেক্সা, অনুসন্ধান ের প্রশ্ন এবং সামগ্রীর শৈলীর সাথে লিঙ্ক করা হবে।",
      "যাইহোক, কিছু ব্যবহারকারী উদ্বিগ্ন যে বর্ধিত বিজ্ঞাপনগুলি ব্যবহারকারীর অভিজ্ঞতাকে নেতিবাচকভাবে প্রভাবিত করতে পারে এবং ফায়ার টিভি গ্রাহকদের চেয়ে বিজ্ঞাপনদাতাদের অগ্রাধিকার দিতে পারে।"
    ],
    "commentSummary": [
      "অ্যামাজন তার ফায়ার টিভিতে আরও বিজ্ঞাপন যুক্ত করছে, বিজ্ঞাপনদাতাদের জন্য লক্ষ লক্ষ মাসিক দর্শকের কাছে প্রসারিত করছে।",
      "বিজ্ঞাপনগুলি জেনারেটরি এআই অ্যালেক্সা, অনুসন্ধান প্রশ্ন এবং সামগ্রীর শৈলীর সাথে একীভূত করা হবে।",
      "যাইহোক, বর্ধিত বিজ্ঞাপন উপস্থিতি সম্ভাব্যভাবে ব্যবহারকারীর অভিজ্ঞতা ব্যাহত করতে পারে এবং ফায়ার টিভি গ্রাহকদের চেয়ে বিজ্ঞাপনদাতাদের অগ্রাধিকার দিতে পারে।"
    ],
    "points": 321,
    "commentCount": 268,
    "retryCount": 0,
    "time": 1699468559
  },
  {
    "id": 38188734,
    "title": "ফেরোসিন: নিরাপত্তা-সমালোচনামূলক পরিবেশের জন্য প্রথম যোগ্যতাসম্পন্ন রাস্ট কম্পাইলার",
    "originLink": "https://ferrous-systems.com/blog/officially-qualified-ferrocene/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38188734",
    "commentBody": "",
    "originSummary": [
      "ফেরোসিন একটি রাস্ট কম্পাইলার টুলচেইন যা আইএসও 26262 এবং আইইসি 61508 মান অনুযায়ী যোগ্যতা অর্জন করেছে।",
      "এটি প্রথম যোগ্যতাসম্পন্ন রাস্ট কম্পাইলার এবং সুরক্ষা- এবং মিশন-সমালোচনামূলক পরিবেশে ব্যবহারের জন্য উপযুক্ত।",
      "ফেরোসিন অটোমোটিভ এবং শিল্প খাতে ব্যবহারের জন্য শংসাপত্র পেয়েছে এবং বিভিন্ন লাইসেন্সিং বিকল্পগুলির সাথে ক্রয়ের জন্য উপলব্ধ।"
    ],
    "commentSummary": [
      "ফেরোসিন একটি রাস্ট কম্পাইলার টুলচেইন যা আইএসও 26262 এবং আইইসি 61508 সার্টিফিকেশন অর্জন করেছে, এটি সুরক্ষা- এবং মিশন-সমালোচনামূলক অ্যাপ্লিকেশনগুলির জন্য উপযুক্ত করে তোলে।",
      "এটি এই ধরনের যোগ্যতা প্রাপ্ত প্রথম রাস্ট কম্পাইলার এবং অটোমোটিভ এবং শিল্প খাতে ব্যবহারের জন্য প্রত্যয়িত হয়েছে।",
      "ফেরোসিন এখন বিভিন্ন লাইসেন্সিং বিকল্পগুলির সাথে ক্রয়ের জন্য উপলব্ধ, ডেভেলপার এবং সংস্থাগুলিকে তাদের প্রকল্পগুলির জন্য একটি নির্ভরযোগ্য এবং প্রত্যয়িত টুলচেইন সরবরাহ করে।"
    ],
    "points": 314,
    "commentCount": 103,
    "retryCount": 0,
    "time": 1699440548
  },
  {
    "id": 38194359,
    "title": "টেক্সাস তেল ও গ্যাস উত্পাদন নিউ মেক্সিকোর তুলনায় দ্বিগুণ পরিমাণে মিথেন নিঃসরণ করে, কঠোর বিধিমালার আহ্বান জানিয়েছে",
    "originLink": "https://www.theguardian.com/us-news/2023/nov/08/texas-methane-oil-and-gas-study-climate",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38194359",
    "commentBody": "",
    "originSummary": [
      "স্যাটেলাইট ডেটা প্রকাশ করে যে টেক্সাসে তেল ও গ্যাস উত্পাদন নিউ মেক্সিকোর তুলনায় দ্বিগুণ পরিমাণে মিথেন নির্গত করে।",
      "টেক্সাস ২০১৯ সাল থেকে উৎপাদনের প্রতি ইউনিটে উচ্চ হারে মিথেন নিঃসরণ করছে, সম্ভবত এটি একটি \"সুপার-এমিটার\" সাইট ে পরিণত হয়েছে যা পরিবেশবিদরা কঠোর বিধিমালার আহ্বান জানিয়েছেন।",
      "মার্কিন পরিবেশ সুরক্ষা সংস্থা (ইপিএ) মিথেন নির্গমন কমাতে নতুন ফেডারেল নিয়ম চূড়ান্ত করছে, যা এই মাসের শেষের দিকে ঘোষণা করা হবে বলে আশা করা হচ্ছে। মিথেন নিঃসরণ কমাতে সরকারকে দ্রুত পদক্ষেপ নেওয়ার আহ্বান জানানো হয়েছে, কারণ এটি জলবায়ু পরিবর্তনের ধীরগতিতে উল্লেখযোগ্য প্রভাব ফেলবে।"
    ],
    "commentSummary": [
      "স্যাটেলাইট ডেটা প্রকাশ করে যে টেক্সাসে তেল ও গ্যাস উত্পাদন নিউ মেক্সিকোর তুলনায় দ্বিগুণ পরিমাণে মিথেন নির্গত করে, যেখানে কঠোর নিয়ম রয়েছে।",
      "টেক্সাসে 2019 সাল থেকে উত্পাদনের প্রতি ইউনিটে মিথেন নির্গমনের উচ্চ হার রয়েছে, যা মিথেন লিকের সাথে একটি উল্লেখযোগ্য সমস্যা নির্দেশ করে।",
      "পরিবেশবিদরা মিথেন নিঃসরণের বৃদ্ধি মোকাবেলায় টেক্সাসের \"সুপার-এমিটার\" সাইটগুলিতে কঠোর বিধিবিধানের আহ্বান জানিয়েছেন, যা জলবায়ু পরিবর্তনমোকাবেলায় একটি বড় হুমকি।"
    ],
    "points": 257,
    "commentCount": 102,
    "retryCount": 0,
    "time": 1699466663
  },
  {
    "id": 38191972,
    "title": "এনওয়াইপিডি-কে মামলা করার পরে প্রিসিন্ট স্টেশনগুলিতে চিত্রগ্রহণের অনুমতি দেওয়ার নির্দেশ দেওয়া হয়েছে",
    "originLink": "https://hellgatenyc.com/you-can-now-film-in-nypd-precincts-thanks-to-this-youtuber",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38191972",
    "commentBody": "",
    "originSummary": [
      "ইউটিউবার শনপল রেয়েস এনওয়াইপিডি প্রাঙ্গণে চিত্রগ্রহণের জন্য দু'বার গ্রেপ্তার ের জন্য বিভাগের বিরুদ্ধে মামলা করার পরে তাকে এনওয়াইপিডি প্রাঙ্গণে চিত্রগ্রহণের অনুমতি দিয়ে একটি অস্থায়ী নিষেধাজ্ঞা জিতেছেন।",
      "মামলায় যুক্তি দেওয়া হয়েছিল যে এনওয়াইপিডির নীতিটি প্রথম সংশোধনী এবং রাজ্য ও নগর আইন লঙ্ঘন করেছে যা পুলিশকে রেকর্ড করার অধিকার রক্ষা করে।",
      "বিচারক রেয়েসের পক্ষে রায় দিয়েছিলেন, একটি অস্থায়ী আদেশ জারি করেছিলেন এবং এনওয়াইপিডিকে পুলিশ স্টেশনগুলিতে চিত্রগ্রহণ নিষিদ্ধ করার চিহ্নগুলি সরানোর নির্দেশ দিয়েছিলেন। এনওয়াইপিডি এই আদেশের বিরুদ্ধে আপিল করার পরিকল্পনা করেছে এবং নিষেধাজ্ঞাস্থগিত করার অনুরোধ করছে।"
    ],
    "commentSummary": [
      "ইউটিউবার শনপল রেয়েস, যাকে এনওয়াইপিডি কর্তৃক দুইবার গ্রেপ্তার করা হয়েছিল, তিনি এনওয়াইপিডি প্রাঙ্গণে চিত্রগ্রহণের অনুমতি দিয়ে একটি অস্থায়ী নিষেধাজ্ঞা জিতেছেন।",
      "আদালতের আদেশের একটি অনুলিপি নিয়ে ৭৫ তম প্রাঙ্গণ থেকে লাইভ স্ট্রিমিংয়ের মাধ্যমে রেয়েস বিজয় উদযাপন করেছিলেন।",
      "মামলায় যুক্তি দেওয়া হয়েছিল যে এনওয়াইপিডির নীতিটি প্রথম সংশোধনী এবং রাজ্য ও নগর আইন লঙ্ঘন করেছে যা পুলিশকে রেকর্ড করার অধিকার নিশ্চিত করে। বিচারক রেয়েসের পক্ষে রায় দেন, একটি অস্থায়ী আদেশ জারি করেন এবং এনওয়াইপিডিকে পুলিশ স্টেশনগুলিতে চিত্রগ্রহণ নিষিদ্ধ করার চিহ্নগুলি সরানোর নির্দেশ দেন।"
    ],
    "points": 243,
    "commentCount": 108,
    "retryCount": 0,
    "time": 1699458194
  }
]
