[
  {
    "id": 38199355,
    "title": "Omeglen perustaja ilmaisee pettymyksensä, kun alusta sulkeutuu pahantahtoisten hyökkäysten vuoksi",
    "originLink": "https://www.omegle.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38199355",
    "commentBody": "",
    "originSummary": [
      "Omegle, verkkokeskustelualusta, suljetaan pahantahtoisten käyttäjien hyökkäysten vuoksi.",
      "Perustaja Leif K-Brooks ilmaisee pettymyksensä ja korostaa alustan myönteisiä puolia.",
      "K-Brooks korostaa, että on tärkeää olla kohdistumatta viattomiin käyttäjiin ja tukea Electronic Frontier Foundationin kaltaisia järjestöjä, jotka suojelevat verkko-oikeuksia."
    ],
    "commentSummary": [
      "Verkkokeskustelualusta Omegle suljetaan pahantahtoisten käyttäjien tekemien hyökkäysten vuoksi, ja perustaja Leif K-Brooks on pettynyt.",
      "K-Brooks korostaa Omeglen myönteisiä puolia, kuten mahdollisuutta tavata uusia ihmisiä ja sen tarjoamaa turvallisuutta joillekin käyttäjille.",
      "Hän kehottaa olemaan kohdistamatta rajoituksia viattomiin käyttäjiin tai mahdollisiin rikoksen uhreihin ja kehottaa tukemaan Electronic Frontier Foundationin kaltaisia järjestöjä verkko-oikeuksien suojelemiseksi."
    ],
    "points": 1489,
    "commentCount": 584,
    "retryCount": 0,
    "time": 1699490425
  },
  {
    "id": 38188689,
    "title": "Ohjelmistoinsinöörin todellisuus ja haasteet: Jatkuva oppiminen ja työelämän tasapaino: pehmeät taidot, virheet, jatkuva oppiminen ja työelämän tasapaino",
    "originLink": "https://www.mensurdurakovic.com/hard-to-swallow-truths-they-wont-tell-you-about-software-engineer-job/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38188689",
    "commentBody": "",
    "originSummary": [
      "Ohjelmistoinsinöörien pehmeät taidot ovat tärkeitä teknisten taitojen ohella.",
      "Virheet ovat yleisiä ohjelmistokehityksessä, ja niitä on käsiteltävä säännöllisesti.",
      "Ohjelmistoinsinöörien on jatkuvasti opittava ja pysyttävä ajan tasalla uusista teknologioista.",
      "Ohjelmistoinsinööreille voi olla haastavaa irrottautua työstä.",
      "Ohjelmistotekniikka tarjoaa mahdollisuuksia innovointiin ja etätyöskentelyyn.",
      "Tässä ammatissa on joustavuutta sijainnin ja pukeutumisen suhteen."
    ],
    "commentSummary": [
      "Pehmeät taidot, kuten viestintä ja tiimityöskentely, ovat teknisten taitojen lisäksi ratkaisevan tärkeitä ohjelmistosuunnittelijoille.",
      "Virheiden käsittely on ohjelmistosuunnittelijoiden yleinen haaste.",
      "Jatkuva oppiminen on välttämätöntä jatkuvasti kehittyvällä ohjelmistotekniikan alalla.",
      "Ohjelmistoinsinööreille voi olla vaikeaa irrottautua työstä.",
      "Ohjelmistotekniikka tarjoaa mahdollisuuksia innovointiin.",
      "Etätyömahdollisuudet sekä joustavuus sijainnin ja pukeutumiskoodin suhteen ovat työn etuja."
    ],
    "points": 738,
    "commentCount": 728,
    "retryCount": 0,
    "time": 1699440095
  },
  {
    "id": 38189878,
    "title": "Miten kiistat ja väestökato muokkaavat institutionaalista muutosta Wikipediassa?",
    "originLink": "https://www.cambridge.org/core/journals/american-political-science-review/article/rule-ambiguity-institutional-clashes-and-population-loss-how-wikipedia-became-the-last-good-place-on-the-internet/FC3F7B9CBF951DD30C2648E7DEFB65EE",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38189878",
    "commentBody": "",
    "originSummary": [
      "Artikkelissa analysoidaan Wikipedian institutionaalista muutosta keskittyen väestökatoon ja sääntötulkintakiistoihin.",
      "Laadullisen analyysin ja prosessien jäljittämisen avulla saadaan näyttöä endogeenisesta institutionaalisesta muutoksesta.",
      "Wikipediassa korostetaan vakautta ja konsensuspäätöksentekoa suosivia ennakkoluuloja sekä toimijoiden roolia sääntöjen muokkaamisessa."
    ],
    "commentSummary": [
      "Tässä artikkelissa tutkitaan, miten institutionaalinen muutos tapahtuu Wikipediassa, ja keskitytään väestön vähenemiseen ja sääntöjen tulkintakiistoihin.",
      "Tutkimuksessa käytetään laadullista analyysia ja prosessien jäljittämistä, jotta saadaan näyttöä endogeenisesta institutionaalisesta muutoksesta Wikipediassa.",
      "Kirjoituksessa tuodaan esiin vakautta ja konsensuspäätöksentekoa suosivia ennakkoluuloja Wikipediassa ja korostetaan toimijoiden roolia sääntöjen muokkaamisessa."
    ],
    "points": 495,
    "commentCount": 582,
    "retryCount": 0,
    "time": 1699449221
  },
  {
    "id": 38190401,
    "title": "ChatGPT:n ja API-palveluiden merkittävä katkos korjattu",
    "originLink": "https://status.openai.com/incidents/00fpy0yxrx1q",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38190401",
    "commentBody": "",
    "originSummary": [
      "OpenAI:ssa oli merkittävä katkos, joka vaikutti sekä ChatGPT- että API-palveluihin, mikä aiheutti suuria virhemääriä.",
      "Ongelma tunnistettiin ja ratkaistiin lähes kahden tunnin kuluessa, 5:42AM - 7:16AM PT välisenä aikana.",
      "OpenAI on ottanut käyttöön korjauksen ja tarkkailee parhaillaan palveluita varmistaakseen, että palautuminen tapahtumasta jatkuu."
    ],
    "commentSummary": [
      "OpenAI:n ChatGPT- ja API-palveluissa oli merkittävä katkos, joka johti suuriin virhetasoihin.",
      "Ongelma tunnistettiin ja ratkaistiin 5:42AM - 7:16AM PT välisenä aikana, ja sen jälkeen vastaukset olivat normaalit.",
      "OpenAI on ottanut käyttöön korjauksen ja tarkkailee palveluja tiiviisti varmistaakseen, että toipuminen jatkuu."
    ],
    "points": 491,
    "commentCount": 507,
    "retryCount": 0,
    "time": 1699452159
  },
  {
    "id": 38189840,
    "title": "Vertikaalinen asuminen: The Evolution of High-Rise Buildings and Urban Density in Spain: The Evolution of High-Rise Buildings and Urban Density in Spain",
    "originLink": "https://especiales.eldiario.es/spain-lives-in-flats/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38189840",
    "commentBody": "",
    "originSummary": [
      "Artikkelissa tarkastellaan kerrostalojen ja asukastiheyden historiaa ja kehitystä Espanjan kaupungeissa.",
      "Siinä tarkastellaan, miten kaupunkisuunnittelun suuntaukset ovat vaikuttaneet korkeampien rakennusten rakentamiseen erityisesti kaupungistumisen ja maaltamuuton aikana.",
      "Artikkelissa korostetaan omakotitalojen ja asuntojen lisääntymistä esikaupunkialueilla ja sitä, että kaupunkisuunnittelussa keskitytään nykyisin tiiviiden ja yhtenäisten kaupunkien luomiseen."
    ],
    "commentSummary": [
      "Artikkelissa tarkastellaan kerrostalojen ja asukastiheyden historiaa ja kasvua Espanjan kaupungeissa.",
      "Kaupunkisuunnittelun suuntauksissa on havaittu korkeampien rakennusten lisääntyminen erityisesti kaupungistumisen ja maaltapakoinnin aikana.",
      "Yhä enemmän painotetaan tiiviiden ja yhtenäisten kaupunkien luomista, mutta sopivasta korkeudesta ja tiheydestä keskustellaan edelleen."
    ],
    "points": 459,
    "commentCount": 405,
    "retryCount": 0,
    "time": 1699448883
  },
  {
    "id": 38188614,
    "title": "Chamberlain estää kolmannen osapuolen pääsyn älykkäisiin autotallinovien avaimiin ja kohtaa vastareaktion.",
    "originLink": "https://arstechnica.com/gadgets/2023/11/chamberlain-blocks-smart-garage-door-opener-from-working-with-smart-homes/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38188614",
    "commentBody": "",
    "originSummary": [
      "Chamberlain Group on estänyt kolmannen osapuolen älykotisovelluksia käyttämästä myQ-älykkäitä autotallinovien avaajia vedoten parempaan käyttökokemukseen ja suorituskykyyn.",
      "Kriitikot väittävät, että Chamberlainin päätöksen taustalla on halu näyttää mainoksia ja myydä palveluja oman sovelluksensa kautta.",
      "Avoimen lähdekoodin älykotialusta Home Assistant poistaa myQ-integraation vastauksena tähän ja kehottaa kuluttajia välttämään sellaisten yritysten tukemista, jotka rajoittavat asiakkaiden pääsyä."
    ],
    "commentSummary": [
      "Chamberlain Group, joka omistaa suosittuja autotallinovien avaajamerkkejä, kuten LiftMaster ja Chamberlain, on estänyt kolmansien osapuolten älykotisovelluksia pääsemästä käsiksi sen myQ-älykkääseen autotallinovien avaajaan.",
      "Chamberlain väittää, että tämä päätös parantaa käyttäjäkokemusta ja suorituskykyä, mutta kriitikot väittävät, että sen taustalla on halu näyttää mainoksia ja myydä palveluja oman sovelluksensa kautta.",
      "Avoimen lähdekoodin älykotialusta Home Assistant poistaa myQ-integraation järjestelmästään ja kehottaa kuluttajia olemaan tukematta yrityksiä, jotka rajoittavat asiakkaiden pääsyä."
    ],
    "points": 454,
    "commentCount": 179,
    "retryCount": 0,
    "time": 1699439145
  },
  {
    "id": 38196412,
    "title": "SciPy Python 3.12:lle Windowsissa: Haasteiden voittaminen ja onnistuminen",
    "originLink": "https://labs.quansight.org/blog/building-scipy-with-flang",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38196412",
    "commentBody": "",
    "originSummary": [
      "SciPyn kaltaisten pakettien yhteensopivien versioiden rakentaminen Python 3.12:lle aiheuttaa haasteita erityisesti Python-pakettien ja Fortran-koodin käytön kanssa.",
      "Conda-paketinhallinta ja conda-forge-yhteisö ovat ratkaisevassa asemassa näiden haasteiden ratkaisemisessa.",
      "Python-pakkaustyökaluilla, kuten distutilsilla ja setuptoolsilla, on rajoituksia, ja Mesonin käyttöä rakennustyökaluna käsitellään.",
      "Fortran-pohjaisten pakettien rakentamisessa ja pakkaamisessa Windowsille esiintyviä vaikeuksia korostetaan.",
      "Artikkelissa mainitaan onnistuneesti rakennettu työkaluketju SciPy:tä varten Windowsille ja kiitetään osallistujia.",
      "LLVM-asetuksiin tehtäviä merkittäviä muutoksia tehtäessä on syytä olla varovainen, koska ne voivat vaikuttaa muihin paketteihin."
    ],
    "commentSummary": [
      "SciPyn kaltaisten pakettien yhteensopivien versioiden, kuten SciPy Python 3.12:lle, rakentamiseen liittyy haasteita, jotka liittyvät Python-pakettien pakkaamiseen ja Fortran-koodin käyttöön.",
      "Condalla ja conda-forge-yhteisöllä on merkittävä rooli näiden haasteiden ratkaisemisessa.",
      "Python-pakkaustyökaluilla, kuten distutilsillä ja setuptoolsilla, on rajoituksia, ja Mesonia käytetään rakennustyökaluna. Fortran-pohjaisten pakettien rakentaminen ja pakkaaminen Windowsille on erityisen vaikeaa.",
      "SciPy-ohjelmalle Windowsille rakennettiin menestyksekkäästi mukautettu työkaluketju, ja kiitokset osoitetaan tekijöille.",
      "Merkittäviin muutoksiin LLVM:n asetuksissa tulisi suhtautua varovaisesti, koska ne voivat vaikuttaa muihin paketteihin."
    ],
    "points": 375,
    "commentCount": 180,
    "retryCount": 0,
    "time": 1699475056
  },
  {
    "id": 38189790,
    "title": "EU:ta syytetään hallinnollisesta epäkohdasta, koska se on salannut luettelon yrityksistä, joita on kuultu CSAM-asetuksesta.",
    "originLink": "https://www.iccl.ie/news/ombudsman-european-commissions-concealment-of-secret-expert-list-on-csam-regulation-constitutes-maladministration/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38189790",
    "commentBody": "",
    "originSummary": [
      "Euroopan komissiota on arvosteltu siitä, että se on salannut luettelon yrityksistä, joita on kuultu lasten seksuaalista hyväksikäyttöä koskevan aineiston havaitsemisesta salausta heikentämättä, mikä on johtanut Euroopan oikeusasiamiehen syytöksiin hallinnollisesta epäkohdasta.",
      "Avoimuudesta ja lobbaajien vaikutuksesta CSAM-asetuksen laatimiseen on esitetty epäilyjä, koska komissio on kieltäytynyt julkistamasta luetteloa.",
      "Asiantuntijat ovat ilmaisseet eriäviä mielipiteitä siitä, onko CSAM-tietojen havaitseminen salatusta sisällöstä tällä hetkellä mahdollista, ja jotkut ovat varoittaneet mahdollisesta massavalvonnasta ja EU:n viestinnän valvontaa koskevan lainsäädännön rikkomisesta."
    ],
    "commentSummary": [
      "Euroopan komissiota on syytetty \"hallinnollisesta epäkohdasta\", koska se on pidättänyt luottamuksellisena luettelon yrityksistä, joita on kuultu lasten seksuaalista hyväksikäyttöä koskevan aineiston havaitsemisesta salausta vaarantamatta.",
      "Avoimuudesta ja lobbaajien vaikutuksesta CSAM-asetuksen laatimiseen on esitetty huolenaiheita.",
      "Asiantuntijoilla on eriäviä mielipiteitä salatun sisällön CSAM-tunnisteiden havaitsemisen toteuttamiskelpoisuudesta ja tarpeellisuudesta, ja jotkut kannattavat sitä lasten hyväksikäytön torjunnan välineenä. Ehdotettua asetusta on myös arvosteltu mahdollisesta massavalvonnasta ja EU:n viestinnän valvontaa koskevan lainsäädännön rikkomisesta."
    ],
    "points": 368,
    "commentCount": 173,
    "retryCount": 0,
    "time": 1699448453
  },
  {
    "id": 38191319,
    "title": "Kartoitusprojekti esittelee ainutlaatuisia tulkintoja brutalismista Quake Brutalist Jam II:ssa",
    "originLink": "https://www.slipseer.com/index.php?resources/quake-brutalist-jam-2.278/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38191319",
    "commentBody": "",
    "originSummary": [
      "Brutalismi-arkkitehtuuriin keskittyvä kartoitusprojekti on tuottanut 30 tasoa, jotka ovat useiden kartoittajien luomia.",
      "Projekti sisältää pelimodin nimeltä Copper ja sisältää sekä uusien että kokeneiden kartoittajien tekemiä karttoja.",
      "Kartat esittelevät erilaisia brutaalisuuden tulkintoja betonisista helvettimaisemista liminaalisiin tyhjiöihin."
    ],
    "commentSummary": [
      "Brutalismi-arkkitehtuuriin keskittyvä kartoitusprojekti on tuottanut 30 tasoa, jotka on luonut eri kartoittajat, joiden joukossa on sekä vasta-alkajia että kokeneita henkilöitä.",
      "Projekti sisältää pelimodin nimeltä Copper, ja se tarjoaa monipuolisia ja vaikuttavia tulkintoja brutalismista, betonisista helvettimaisemista rajamailla sijaitseviin tyhjiöihin.",
      "Asennusta varten käyttäjien on purettava qbj2-kansio Quake-hakemistoon ja käynnistettävä haluamansa lähdeportti."
    ],
    "points": 340,
    "commentCount": 94,
    "retryCount": 0,
    "time": 1699455749
  },
  {
    "id": 38195509,
    "title": "Mainen äänestäjät hyväksyivät auton korjausoikeuden, mikä asettaa haasteita autonvalmistajille",
    "originLink": "https://www.404media.co/voters-overwhelmingly-pass-car-right-to-repair-law-in-maine/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38195509",
    "commentBody": "",
    "originSummary": [
      "Mainen äänestäjät ovat hyväksyneet äänestystoimenpiteen, joka antaa kuluttajille oikeuden korjata autoja autonvalmistajien vastustuksesta huolimatta.",
      "Toimenpiteessä ajoneuvojen valmistajat velvoitetaan standardoimaan diagnostiikkajärjestelmät ja antamaan omistajille ja riippumattomille korjaamoille pääsy tietoihin.",
      "Tämä voitto on jatkoa Massachusettsissa viime vuonna hyväksytylle vastaavalle toimenpiteelle, ja se vahvistaa valtakunnallista liikettä, joka ajaa oikeutta korjaussuojaan."
    ],
    "commentSummary": [
      "Mainen äänestäjät ovat hyväksyneet äänestystoimenpiteen, joka antaa auton omistajille ja riippumattomille korjaamoille oikeuden saada ajoneuvovalmistajien tietoja ja standardoituja diagnostiikkajärjestelmiä.",
      "Tämä on takaisku autonvalmistajille, jotka ovat vastustaneet tällaista lainsäädäntöä.",
      "Lakia pidetään tarpeellisena, koska valmistajat käyttävät yhä useammin langatonta pääsyä autojen diagnostiikkaan, mikä rajoittaa riippumattomien korjaamojen pääsyä."
    ],
    "points": 323,
    "commentCount": 101,
    "retryCount": 0,
    "time": 1699471202
  },
  {
    "id": 38194818,
    "title": "Amazonin Fire-televisiot ovat nyt täynnä mainoksia, mikä saattaa vaarantaa käyttäjäkokemuksen",
    "originLink": "https://arstechnica.com/gadgets/2023/11/after-luring-customers-with-low-prices-amazon-stuffs-fire-tvs-with-ads/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38194818",
    "commentBody": "",
    "originSummary": [
      "Amazon laajentaa mainosten määrää Fire-televisioissaan ja tarjoaa mainostajille pääsyn miljoonille kuukausittaisille katsojille.",
      "Mainokset yhdistetään tekoälyavustaja Alexaan, hakukyselyihin ja sisällön lajityyppeihin.",
      "Jotkut käyttäjät ovat kuitenkin huolissaan siitä, että lisääntyneet mainokset voivat vaikuttaa kielteisesti käyttäjäkokemukseen ja asettaa mainostajat etusijalle Fire TV -asiakkaisiin nähden."
    ],
    "commentSummary": [
      "Amazon lisää mainoksia Fire-televisioihinsa, mikä laajentaa mainostajien tavoittavuutta miljooniin kuukausittaisiin katsojiin.",
      "Mainokset integroidaan generatiiviseen tekoälyyn Alexa, hakukyselyihin ja sisällön lajityyppeihin.",
      "Lisääntynyt mainosten läsnäolo saattaa kuitenkin häiritä käyttäjäkokemusta ja asettaa mainostajat etusijalle Fire TV -asiakkaisiin nähden."
    ],
    "points": 321,
    "commentCount": 268,
    "retryCount": 0,
    "time": 1699468559
  },
  {
    "id": 38188734,
    "title": "Ferroseeni: Ensimmäinen pätevöity ruoste-kääntäjä turvallisuuskriittisiin ympäristöihin.",
    "originLink": "https://ferrous-systems.com/blog/officially-qualified-ferrocene/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38188734",
    "commentBody": "",
    "originSummary": [
      "Ferrocene on Rust-kääntäjätyökaluketju, joka on hyväksytty ISO 26262- ja IEC 61508 -standardien mukaisesti.",
      "Se on ensimmäinen hyväksytty Rust-kääntäjä, ja se soveltuu käytettäväksi turvallisuus- ja tehtäväkriittisissä ympäristöissä.",
      "Ferroseeni on saanut sertifioinnin käytettäväksi autoteollisuudessa ja teollisuudessa, ja se on ostettavissa eri lisenssivaihtoehdoilla."
    ],
    "commentSummary": [
      "Ferrocene on Rust-kääntäjätyökaluketju, joka on saanut ISO 26262- ja IEC 61508 -sertifioinnit, joten se soveltuu turvallisuus- ja toimintakriittisiin sovelluksiin.",
      "Se on ensimmäinen Rust-kääntäjä, joka on saanut tällaisen pätevyyden, ja se on sertifioitu käytettäväksi autoteollisuudessa ja teollisuudessa.",
      "Ferrocene on nyt ostettavissa eri lisenssivaihtoehdoilla, ja se tarjoaa kehittäjille ja organisaatioille luotettavan ja sertifioidun työkaluketjun projektejaan varten."
    ],
    "points": 314,
    "commentCount": 103,
    "retryCount": 0,
    "time": 1699440548
  },
  {
    "id": 38194359,
    "title": "Teksasin öljy- ja kaasutuotannosta vapautuu metaania kaksinkertainen määrä New Mexicoon verrattuna, mikä vaatii tiukempia säännöksiä.",
    "originLink": "https://www.theguardian.com/us-news/2023/nov/08/texas-methane-oil-and-gas-study-climate",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38194359",
    "commentBody": "",
    "originSummary": [
      "Satelliittitiedot paljastavat, että Teksasin öljy- ja kaasutuotanto tuottaa kaksinkertaisen määrän metaania New Mexicoon verrattuna, mikä johtuu New Mexicon tiukemmista säädöksistä.",
      "Texasista on vapautunut enemmän metaania tuotantoyksikköä kohti vuodesta 2019 lähtien, mikä saattaa tehdä siitä \"superpäästöpaikan\", jota varten ympäristöaktivistit vaativat tiukempia säännöksiä.",
      "Yhdysvaltain ympäristönsuojeluvirasto (EPA) on viimeistelemässä uusia liittovaltion sääntöjä metaanipäästöjen vähentämiseksi, ja niistä odotetaan ilmoitettavan myöhemmin tässä kuussa. Hallituksia kehotetaan ryhtymään pikaisiin toimiin metaanipäästöjen vähentämiseksi, koska sillä olisi merkittävä vaikutus ilmastonmuutoksen hidastamiseen."
    ],
    "commentSummary": [
      "Satelliittitiedot paljastavat, että Teksasin öljy- ja kaasutuotanto tuottaa kaksinkertaisen määrän metaania verrattuna New Mexicoon, jossa on tiukemmat säännökset.",
      "Teksasin metaanipäästöt tuotantoyksikköä kohti ovat olleet korkeammat vuodesta 2019 lähtien, mikä osoittaa, että metaanivuodot ovat merkittävä ongelma.",
      "Ympäristöaktivistit vaativat tiukempia määräyksiä Teksasin \"superpäästöpaikoille\", jotta voitaisiin puuttua metaanipäästöjen kasvuun, joka on suuri uhka ilmastonmuutoksen torjumiselle."
    ],
    "points": 257,
    "commentCount": 102,
    "retryCount": 0,
    "time": 1699466663
  },
  {
    "id": 38191972,
    "title": "NYPD velvoitettiin sallimaan kuvaaminen piirin asemilla oikeusjutun jälkeen",
    "originLink": "https://hellgatenyc.com/you-can-now-film-in-nypd-precincts-thanks-to-this-youtuber",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38191972",
    "commentBody": "",
    "originSummary": [
      "YouTuber SeanPaul Reyes on saanut väliaikaisen kieltomääräyksen, joka sallii hänen kuvata NYPD:n poliisiasemilla haettuaan poliisilaitoksen oikeuteen, koska se oli pidättänyt hänet kahdesti kuvaamisesta poliisiasemien julkisilla alueilla.",
      "Kanteessa väitettiin, että NYPD:n politiikka rikkoi ensimmäistä lisäystä sekä osavaltion ja kaupungin lakeja, jotka suojelevat oikeutta nauhoittaa poliisin toimintaa.",
      "Tuomari päätti Reyesin eduksi, antoi väliaikaisen kieltomääräyksen ja määräsi NYPD:n poistamaan kyltit, jotka kieltävät kuvaamisen poliisiasemilla. NYPD aikoo valittaa määräyksestä ja pyytää määräyksen lykkäämistä."
    ],
    "commentSummary": [
      "YouTuber SeanPaul Reyes, jonka NYPD pidätti kahdesti kuvaamisesta poliisiasemien julkisilla alueilla, on saanut väliaikaisen kiellon, joka sallii hänen kuvata NYPD:n poliisiasemilla.",
      "Reyes juhlisti voittoa lähettämällä livestriimauksen 75. piiristä kopion oikeuden määräyksestä mukanaan.",
      "Kanteessa väitettiin, että NYPD:n politiikka rikkoi ensimmäistä lisäystä sekä osavaltion ja kaupungin lakeja, jotka takaavat oikeuden nauhoittaa poliisin toimintaa. Tuomari antoi Reyesin eduksi väliaikaisen määräyksen ja määräsi NYPD:n poistamaan poliisiasemilla kuvaamisen kieltävät kyltit."
    ],
    "points": 243,
    "commentCount": 108,
    "retryCount": 0,
    "time": 1699458194
  }
]
