[
  {
    "id": 38199355,
    "title": "악의적인 공격으로 플랫폼이 중단되자 실망감을 표출한 Omegle 설립자",
    "originLink": "https://www.omegle.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38199355",
    "commentBody": "",
    "originSummary": [
      "온라인 채팅 플랫폼인 Omegle이 악의적인 사용자의 공격으로 인해 종료되고 있습니다.",
      "설립자 레이프 케이브룩스는 아쉬움을 표하며 플랫폼의 긍정적인 측면을 강조합니다.",
      "K-브룩스는 무고한 사용자를 표적으로 삼지 않고 전자 프론티어 재단과 같은 단체를 지원하여 온라인 권리를 보호하는 것이 중요하다고 강조합니다."
    ],
    "commentSummary": [
      "온라인 채팅 플랫폼인 Omegle이 악의적인 사용자의 공격으로 인해 서비스를 중단하고 있어 창업자 레이프 케이브룩스가 실망감을 감추지 못하고 있습니다.",
      "케이브룩스는 새로운 사람을 만날 수 있는 능력과 일부 사용자에게 제공한 안전성과 같은 오메글의 긍정적인 측면을 강조합니다.",
      "그는 제한을 가할 때 무고한 사용자나 잠재적 범죄 피해자를 표적으로 삼지 말 것을 촉구하고 온라인 권리를 보호하기 위해 전자 프론티어 재단과 같은 단체의 지원을 촉구합니다."
    ],
    "points": 1489,
    "commentCount": 584,
    "retryCount": 0,
    "time": 1699490425
  },
  {
    "id": 38188689,
    "title": "소프트웨어 엔지니어의 현실과 도전 과제: 소프트 스킬, 버그, 끊임없는 학습, 일과 삶의 균형",
    "originLink": "https://www.mensurdurakovic.com/hard-to-swallow-truths-they-wont-tell-you-about-software-engineer-job/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38188689",
    "commentBody": "",
    "originSummary": [
      "소프트웨어 엔지니어에게 소프트 스킬은 기술력과 함께 중요한 요소입니다.",
      "버그는 소프트웨어 개발에서 흔히 발생하며 정기적으로 처리해야 합니다.",
      "소프트웨어 엔지니어는 지속적으로 새로운 기술을 배우고 최신 정보를 습득해야 합니다.",
      "소프트웨어 엔지니어에게 업무와의 연결을 끊는 것은 어려운 일이 될 수 있습니다.",
      "소프트웨어 엔지니어링은 혁신과 원격 근무 옵션을 위한 기회를 제공합니다.",
      "이 직업은 근무 장소와 복장 규정이 유연합니다."
    ],
    "commentSummary": [
      "소프트웨어 엔지니어에게는 기술적인 능력 외에도 커뮤니케이션 및 팀워크와 같은 소프트 스킬이 매우 중요합니다.",
      "버그를 처리하는 것은 소프트웨어 엔지니어에게 흔한 과제입니다.",
      "끊임없이 진화하는 소프트웨어 엔지니어링 분야에서는 지속적인 학습이 필요합니다.",
      "소프트웨어 엔지니어에게 업무와의 연결을 끊는 것은 어려울 수 있습니다.",
      "소프트웨어 엔지니어링은 혁신의 기회를 제공합니다.",
      "원격 근무 옵션과 근무 장소 및 복장 규정의 유연성은 재택근무의 장점입니다."
    ],
    "points": 738,
    "commentCount": 728,
    "retryCount": 0,
    "time": 1699440095
  },
  {
    "id": 38189878,
    "title": "분쟁과 인구 감소가 위키백과에서 제도적 변화를 형성하는 방법",
    "originLink": "https://www.cambridge.org/core/journals/american-political-science-review/article/rule-ambiguity-institutional-clashes-and-population-loss-how-wikipedia-became-the-last-good-place-on-the-internet/FC3F7B9CBF951DD30C2648E7DEFB65EE",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38189878",
    "commentBody": "",
    "originSummary": [
      "이 글에서는 인구 감소와 규칙 해석 분쟁에 초점을 맞춰 위키백과의 제도적 변화를 분석합니다.",
      "정성적 분석과 프로세스 추적은 내생적인 제도적 변화에 대한 증거를 제공하는 데 사용됩니다.",
      "위키백과 내에서 안정성과 합의에 의한 의사 결정을 선호하는 편견과 규칙을 형성하는 행위자의 역할이 강조됩니다."
    ],
    "commentSummary": [
      "이 문서에서는 인구 감소와 규칙 해석을 둘러싼 분쟁에 초점을 맞춰 위키백과 내에서 제도적 변화가 어떻게 일어나는지 살펴봅니다.",
      "이 연구는 질적 분석과 프로세스 추적을 사용하여 위키백과에서 내생적인 제도적 변화에 대한 증거를 제공합니다.",
      "이 논문은 위키백과에서 안정성과 합의에 의한 의사 결정을 선호하는 편견을 강조하고 규칙을 형성하는 데 있어 행위자의 역할을 강조합니다."
    ],
    "points": 495,
    "commentCount": 582,
    "retryCount": 0,
    "time": 1699449221
  },
  {
    "id": 38190401,
    "title": "ChatGPT 및 API 서비스의 주요 중단 문제 해결",
    "originLink": "https://status.openai.com/incidents/00fpy0yxrx1q",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38190401",
    "commentBody": "",
    "originSummary": [
      "OpenAI는 ChatGPT와 API 서비스 모두에 영향을 미치는 심각한 중단을 경험했으며, 이로 인해 높은 오류율이 발생했습니다.",
      "이 문제는 오전 5시 42분부터 오전 7시 16분까지(태평양 표준시 기준) 약 2시간 이내에 확인되어 해결되었습니다.",
      "OpenAI는 수정 사항을 구현했으며, 현재 사고로부터 지속적으로 복구할 수 있도록 서비스를 모니터링하고 있습니다."
    ],
    "commentSummary": [
      "OpenAI는 ChatGPT 및 API 서비스에서 심각한 장애를 경험했으며, 이로 인해 높은 오류율이 발생했습니다.",
      "이 문제는 오전 5시 42분부터 오전 7시 16분(태평양 표준시) 사이에 확인 및 해결되었으며, 이후 정상적인 응답이 관찰되었습니다.",
      "OpenAI는 수정 사항을 구현했으며 지속적인 복구가 이루어질 수 있도록 서비스를 면밀히 모니터링하고 있습니다."
    ],
    "points": 491,
    "commentCount": 507,
    "retryCount": 0,
    "time": 1699452159
  },
  {
    "id": 38189840,
    "title": "수직적 생활: 스페인의 고층 빌딩과 도시 밀도의 진화",
    "originLink": "https://especiales.eldiario.es/spain-lives-in-flats/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38189840",
    "commentBody": "",
    "originSummary": [
      "이 기사에서는 스페인 도시의 고층 건물과 인구 밀도의 역사와 진화에 대해 자세히 설명합니다.",
      "도시 계획 트렌드가 고층 건물 건설에 어떤 영향을 미쳤는지, 특히 도시화와 농촌 이주의 과정에서 어떤 영향을 미쳤는지 살펴봅니다.",
      "이 기사는 교외 지역에 단독주택과 아파트가 급증하고 있으며, 현재 도시 계획에서 작고 응집력 있는 도시를 만드는 데 중점을 두고 있음을 강조합니다."
    ],
    "commentSummary": [
      "이 기사에서는 스페인 도시의 고층 건물과 인구 밀도의 역사와 성장에 대해 살펴봅니다.",
      "도시 계획 추세는 특히 도시화와 농촌 이주의 시기에 고층 건물이 증가하는 추세를 보였습니다.",
      "작고 응집력 있는 도시를 만드는 것이 점점 더 강조되고 있지만, 적절한 높이와 밀도에 대한 문제는 여전히 논쟁의 여지가 있습니다."
    ],
    "points": 459,
    "commentCount": 405,
    "retryCount": 0,
    "time": 1699448883
  },
  {
    "id": 38188614,
    "title": "챔벌린, 스마트 차고 도어 오프너에 대한 타사 액세스 차단, 반발 직면",
    "originLink": "https://arstechnica.com/gadgets/2023/11/chamberlain-blocks-smart-garage-door-opener-from-working-with-smart-homes/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38188614",
    "commentBody": "",
    "originSummary": [
      "챔벌린 그룹은 사용자 경험과 성능 향상을 이유로 타사 스마트 홈 앱이 myQ 스마트 차고 도어 오프너에 액세스하지 못하도록 차단했습니다.",
      "비평가들은 체임벌린의 결정이 자체 앱을 통해 광고를 표시하고 서비스를 판매하려는 욕구에서 비롯된 것이라고 주장합니다.",
      "오픈 소스 스마트 홈 플랫폼인 홈 어시스턴트는 이에 대응하여 myQ 통합 기능을 제거하고 있으며, 소비자들에게 고객 액세스를 제한하는 회사를 지원하지 말 것을 권고하고 있습니다."
    ],
    "commentSummary": [
      "LiftMaster 및 Chamberlain과 같은 인기 차고 도어 오프너 브랜드의 소유주인 Chamberlain Group은 타사 스마트 홈 앱이 자사 myQ 스마트 차고 도어 오프너에 액세스하는 것을 차단했습니다.",
      "체임벌린은 이러한 결정이 사용자 경험과 성능을 개선하기 위한 것이라고 주장하지만, 비평가들은 자체 앱을 통해 광고를 표시하고 서비스를 상향 판매하려는 욕구에서 비롯된 결정이라고 주장합니다.",
      "오픈 소스 스마트 홈 플랫폼인 홈 어시스턴트는 시스템에서 myQ 통합 기능을 제거하고 소비자들에게 고객 액세스를 제한하는 회사를 지원하지 말 것을 권고하고 있습니다."
    ],
    "points": 454,
    "commentCount": 179,
    "retryCount": 0,
    "time": 1699439145
  },
  {
    "id": 38196412,
    "title": "윈도우용 파이썬 3.12 SciPy: 도전 과제 극복 및 성공 달성하기",
    "originLink": "https://labs.quansight.org/blog/building-scipy-with-flang",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38196412",
    "commentBody": "",
    "originSummary": [
      "Python 3.12용 SciPy와 같은 호환 가능한 패키지 릴리스를 빌드하는 데는 특히 Python 패키징 및 Fortran 코드 사용과 관련된 문제가 있습니다.",
      "콘다 패키지 관리자와 콘다 포지 커뮤니티는 이러한 문제를 해결하는 데 중요한 역할을 합니다.",
      "배포 도구 및 설정 도구와 같은 Python 패키징 도구에는 한계가 있으며, 빌드 도구로 Meson을 사용하는 방법에 대해 설명합니다.",
      "Windows용 포트란 기반 패키지를 빌드하고 패키징하는 데 따르는 어려움이 강조되어 있습니다.",
      "이 기사에서는 Windows에서 SciPy용 툴체인을 성공적으로 커스텀 빌드한 사례를 언급하며 기여자들에게 감사를 표합니다.",
      "다른 패키지에 영향을 미칠 수 있으므로 LLVM 설정을 크게 변경할 때는 주의가 필요합니다."
    ],
    "commentSummary": [
      "Python 3.12용 SciPy와 같은 호환 가능한 패키지 릴리스를 빌드하는 데에는 Python 패키징 및 Fortran 코드 사용과 관련된 문제가 있습니다.",
      "콘다와 콘다 포레스트 커뮤니티는 이러한 문제를 해결하는 데 중요한 역할을 합니다.",
      "distutils 및 setuptools와 같은 Python 패키징 도구에는 한계가 있으며, Meson은 빌드 도구로 사용됩니다. Windows용 Fortran 기반 패키지를 빌드하고 패키징하는 것은 특히 어렵습니다.",
      "Windows에서 SciPy를 위한 커스텀 툴체인이 성공적으로 구축되었으며, 기여자들에게 감사를 표합니다.",
      "LLVM 설정에 대한 중대한 변경은 다른 패키지에 영향을 미칠 수 있으므로 신중하게 접근해야 합니다."
    ],
    "points": 375,
    "commentCount": 180,
    "retryCount": 0,
    "time": 1699475056
  },
  {
    "id": 38189790,
    "title": "EU, CSAM 규정 관련 협의 기업 명단 은폐에 대해 '잘못된 행정' 혐의로 고발당하다",
    "originLink": "https://www.iccl.ie/news/ombudsman-european-commissions-concealment-of-secret-expert-list-on-csam-regulation-constitutes-maladministration/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38189790",
    "commentBody": "",
    "originSummary": [
      "유럽위원회는 암호화를 훼손하지 않고 아동 성적 학대 자료(CSAM) 탐지에 대해 자문을 구한 기업 명단을 공개하지 않아 유럽 옴부즈맨으로부터 '잘못된 행정'이라는 비난을 받고 있습니다.",
      "위원회가 명단 공개를 거부하면서 CSAM 규정 초안 작성에 있어 로비스트의 영향력과 투명성에 대한 우려가 제기되었습니다.",
      "전문가들은 암호화된 콘텐츠에서 CSAM을 탐지하는 것이 현재 가능한지에 대해 다양한 의견을 제시하고 있으며, 일부에서는 대량 감시 및 EU 통신 감시법 위반 가능성에 대해 경고하고 있습니다."
    ],
    "commentSummary": [
      "유럽연합 집행위원회는 아동 성적 학대 자료(CSAM) 감지와 관련하여 자문을 구한 기업 명단을 암호화하지 않고 보류한 것에 대해 '잘못된 행정'이라는 비난을 받았습니다.",
      "CSAM 규정 초안 작성 과정에서 투명성과 로비스트의 영향력에 대한 우려가 제기되었습니다.",
      "전문가들은 암호화된 콘텐츠에서 CSAM을 탐지할 수 있는 가능성과 필요성에 대해 다양한 의견을 제시하고 있으며, 일부 전문가들은 아동 착취에 대응하기 위한 도구로 이를 주장하고 있습니다. 또한 제안된 규정은 잠재적인 대량 감시 및 EU 통신 모니터링 법 위반에 대한 비판에 직면해 있습니다."
    ],
    "points": 368,
    "commentCount": 173,
    "retryCount": 0,
    "time": 1699448453
  },
  {
    "id": 38191319,
    "title": "매핑 프로젝트, 지진 잔혹주의에 대한 독특한 해석을 선보이는 '퀘이크 잔혹주의자 잼 II'",
    "originLink": "https://www.slipseer.com/index.php?resources/quake-brutalist-jam-2.278/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38191319",
    "commentBody": "",
    "originSummary": [
      "브루탈리즘 아키텍처에 초점을 맞춘 매핑 프로젝트에서 여러 매퍼가 30개의 레벨을 제작했습니다.",
      "이 프로젝트에는 Copper라는 게임플레이 모드가 포함되어 있으며, 신규 및 숙련된 매퍼가 만든 맵이 포함되어 있습니다.",
      "이 지도는 콘크리트 지옥 풍경부터 한계선 공허에 이르기까지 브루탈리즘에 대한 다양한 해석을 선보입니다."
    ],
    "commentSummary": [
      "브루탈리즘 아키텍처에 초점을 맞춘 매핑 프로젝트에서는 초보자부터 숙련자까지 다양한 매퍼가 30개의 레벨을 제작했습니다.",
      "이 프로젝트에는 Copper라는 게임플레이 모드가 포함되어 있으며, 콘크리트 지옥 풍경부터 한계선 공허에 이르기까지 브루탈리즘에 대한 다양하고 인상적인 해석을 제공합니다.",
      "프로젝트를 설치하려면, 사용자는 Quake 디렉터리에 qbj2 폴더의 압축을 풀고 원하는 소스포트를 실행해야 합니다."
    ],
    "points": 340,
    "commentCount": 94,
    "retryCount": 0,
    "time": 1699455749
  },
  {
    "id": 38195509,
    "title": "메인 주 유권자, 자동차 수리 권리 법안 승인, 자동차 제조업체에 도전 과제 제기",
    "originLink": "https://www.404media.co/voters-overwhelmingly-pass-car-right-to-repair-law-in-maine/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38195509",
    "commentBody": "",
    "originSummary": [
      "메인주 유권자들은 자동차 제조업체의 반대에도 불구하고 소비자에게 자동차 수리 권리를 부여하는 투표 법안을 승인했습니다.",
      "이 법안은 차량 제조업체가 진단 시스템을 표준화하고 소유자 및 독립 수리 시설에 데이터 액세스 권한을 부여하도록 의무화합니다.",
      "이번 승리는 지난해 매사추세츠주에서 통과된 유사한 법안에 이은 것으로, 전국적인 수리 권리 보호 운동에 힘을 실어줄 것입니다."
    ],
    "commentSummary": [
      "메인주 유권자들은 자동차 소유자와 독립 수리 시설에 차량 제조업체의 데이터와 표준화된 진단 시스템에 액세스할 수 있는 권한을 부여하는 투표 법안을 승인했습니다.",
      "이는 이러한 법안에 반대해 온 자동차 제조업체에 큰 타격이 될 것입니다.",
      "이 법은 제조업체가 자동차 진단에 무선 액세스를 점점 더 많이 사용하고 있기 때문에 독립적인 수리를 위한 액세스를 제한하기 위해 필요한 것으로 간주됩니다."
    ],
    "points": 323,
    "commentCount": 101,
    "retryCount": 0,
    "time": 1699471202
  },
  {
    "id": 38194818,
    "title": "이제 더 많은 광고로 가득 찬 Amazon의 Fire TV, 잠재적으로 사용자 경험을 저하시킬 수 있습니다.",
    "originLink": "https://arstechnica.com/gadgets/2023/11/after-luring-customers-with-low-prices-amazon-stuffs-fire-tvs-with-ads/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38194818",
    "commentBody": "",
    "originSummary": [
      "Amazon은 광고주에게 월 수백만 명의 시청자에게 접근할 수 있는 기회를 제공하기 위해 Fire TV의 광고 수를 확대하고 있습니다.",
      "광고는 AI 비서 Alexa, 검색어 및 콘텐츠 장르에 연결됩니다.",
      "그러나 일부 사용자는 광고 증가가 사용자 경험에 부정적인 영향을 미치고 Fire TV 고객보다 광고주를 우선시할 수 있다고 우려하고 있습니다."
    ],
    "commentSummary": [
      "Amazon은 Fire TV에 더 많은 광고를 추가하여 광고주의 도달 범위를 월간 시청자 수백만 명으로 확대하고 있습니다.",
      "광고는 제너레이티브 AI Alexa, 검색 쿼리 및 콘텐츠 장르와 통합됩니다.",
      "그러나 광고 노출이 증가하면 잠재적으로 사용자 경험을 방해하고 Fire TV 고객보다 광고주가 우선순위를 차지할 수 있습니다."
    ],
    "points": 321,
    "commentCount": 268,
    "retryCount": 0,
    "time": 1699468559
  },
  {
    "id": 38188734,
    "title": "페로센: 안전이 중요한 환경을 위한 최초의 인증된 러스트 컴파일러",
    "originLink": "https://ferrous-systems.com/blog/officially-qualified-ferrocene/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38188734",
    "commentBody": "",
    "originSummary": [
      "페로센은 ISO 26262 및 IEC 61508 표준에 따라 인증을 받은 Rust 컴파일러 툴체인입니다.",
      "이 컴파일러는 최초로 인증된 Rust 컴파일러로, 안전 및 미션 크리티컬 환경에서 사용하기에 적합합니다.",
      "페로센은 자동차 및 산업 분야에서 사용할 수 있는 인증을 획득했으며 다양한 라이선스 옵션으로 구매할 수 있습니다."
    ],
    "commentSummary": [
      "Ferrocene은 ISO 26262 및 IEC 61508 인증을 획득한 Rust 컴파일러 툴체인으로, 안전 및 미션 크리티컬 애플리케이션에 적합합니다.",
      "이 컴파일러는 이러한 인증을 받은 최초의 Rust 컴파일러이며 자동차 및 산업 분야에서 사용할 수 있도록 인증되었습니다.",
      "이제 다양한 라이선스 옵션으로 페로센을 구매할 수 있으며, 개발자와 조직은 프로젝트를 위한 신뢰할 수 있고 인증된 툴체인을 사용할 수 있습니다."
    ],
    "points": 314,
    "commentCount": 103,
    "retryCount": 0,
    "time": 1699440548
  },
  {
    "id": 38194359,
    "title": "텍사스 석유 및 가스 생산량, 뉴멕시코에 비해 두 배 많은 메탄 배출, 더 엄격한 규제 요구 촉발",
    "originLink": "https://www.theguardian.com/us-news/2023/nov/08/texas-methane-oil-and-gas-study-climate",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38194359",
    "commentBody": "",
    "originSummary": [
      "위성 데이터에 따르면 텍사스의 석유 및 가스 생산은 뉴멕시코주의 엄격한 규제로 인해 뉴멕시코주에 비해 두 배나 많은 양의 메탄을 배출하는 것으로 나타났습니다.",
      "텍사스는 2019년부터 생산 단위당 더 높은 비율의 메탄을 배출하고 있어 환경운동가들이 더 강력한 규제를 요구하고 있는 '슈퍼 배출 지역'이 될 가능성이 있습니다.",
      "미국 환경보호청(EPA)은 메탄 배출을 줄이기 위한 새로운 연방 규정을 확정 중이며, 이달 말 발표될 예정입니다. 각국 정부는 기후 변화를 늦추는 데 큰 영향을 미칠 수 있는 메탄 배출을 줄이기 위한 신속한 조치를 취할 것을 촉구합니다."
    ],
    "commentSummary": [
      "위성 데이터에 따르면 텍사스의 석유 및 가스 생산량은 규제가 더 엄격한 뉴멕시코에 비해 두 배나 많은 메탄을 배출하는 것으로 나타났습니다.",
      "텍사스는 2019년 이후 생산 단위당 메탄 배출량이 증가하여 메탄 누출에 심각한 문제가 있음을 나타냅니다.",
      "환경운동가들은 기후 변화 대응에 큰 위협이 되는 메탄 배출량 급증 문제를 해결하기 위해 텍사스의 '슈퍼 배출자' 사이트에 대한 규제를 강화할 것을 촉구하고 있습니다."
    ],
    "points": 257,
    "commentCount": 102,
    "retryCount": 0,
    "time": 1699466663
  },
  {
    "id": 38191972,
    "title": "소송 후 경찰서 내 촬영 허용 명령 받은 뉴욕 경찰청",
    "originLink": "https://hellgatenyc.com/you-can-now-film-in-nypd-precincts-thanks-to-this-youtuber",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38191972",
    "commentBody": "",
    "originSummary": [
      "유튜버 션폴 레예스는 경찰서 공공장소에서 촬영을 했다는 이유로 두 차례나 체포된 뉴욕경찰청을 상대로 소송을 제기하여 경찰서 내에서 촬영을 허용하는 가처분 결정을 받아냈습니다.",
      "이 소송은 뉴욕 경찰의 정책이 수정헌법 제1조와 경찰의 기록 권리를 보호하는 주 및 시 법률을 위반했다고 주장했습니다.",
      "판사는 Reyes의 손을 들어주며 가처분 명령을 내리고 경찰서에서 촬영을 금지하는 표지판을 철거하라고 명령했습니다. 뉴욕 경찰은 이 명령에 항소할 계획이며 금지 명령의 집행정지를 요청하고 있습니다."
    ],
    "commentSummary": [
      "경찰서 공공장소에서 촬영하다 뉴욕 경찰에 두 차례 체포된 유튜버 션폴 레예스(SeanPaul Reyes)가 뉴욕 경찰서 내에서 촬영할 수 있도록 허용하는 가처분 결정을 받아냈습니다.",
      "레예스는 법원 명령서 사본을 들고 75번 구역에서 라이브 스트리밍을 하며 승리를 축하했습니다.",
      "이 소송에서는 뉴욕 경찰의 정책이 수정헌법 제1조와 경찰의 녹화 권리를 보장하는 주 및 시 법률을 위반했다고 주장했습니다. 판사는 레이예스의 손을 들어주며 가처분 명령을 내리고 경찰서에서 촬영을 금지하는 표지판을 철거하라고 지시했습니다."
    ],
    "points": 243,
    "commentCount": 108,
    "retryCount": 0,
    "time": 1699458194
  }
]
