[
  {
    "title": "GA-ASI Successfully Demonstrates UAS STOL Capability on UK Carrier",
    "originLink": "https://www.ga-asi.com/ga-asi-demonstrates-short-takeoff-landing-of-uas-on-uk-carrier",
    "originBody": "",
    "originSummary": [
      "General Atomics Aeronautical Systems, Inc. (GA-ASI) successfully demonstrated the short takeoff and landing (STOL) capability of its Mojave Unmanned Aircraft System (UAS) on the HMS Prince of Wales.",
      "The demonstration showcased the UAS' ability to operate from warships, opening up new possibilities for supporting naval operations.",
      "GA-ASI is planning to incorporate STOL wing set options into its larger MQ-9B aircraft, which is being considered by the Royal Navy and other navies for aircraft operations on large flat-deck warships."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700314218412
  },
  {
    "title": "County Seeks Feedback on Drone Policies for Public Safety and Emergency Responses",
    "originLink": "https://www.arlnow.com/2023/11/17/county-seeks-feedback-on-policies-for-using-drones-during-public-safety-and-emergency-responses/",
    "originBody": "",
    "originSummary": [
      "Arlington County is soliciting public feedback on its draft policies for using drones in public safety and emergency situations.",
      "The county's police and fire departments, Sheriff's Office, and Dept. of Public Safety Communications and Emergency Management are collaborating on the development of an \"Unmanned Aircraft Systems program\" for purposes such as situational awareness, evidence collection, search and rescue operations, and monitoring public events.",
      "The draft policies include provisions that prohibit the use of weapons on drones and require proper training for operators. They will be evaluated and refined based on community feedback and are expected to be implemented in early 2024. Monthly audits and public reporting will ensure adherence to the policies and relevant laws. The use of drones is viewed as a means of enhancing efficiency and safety for law enforcement agencies, especially given staffing challenges. The policies are guided by best practices from various organizations and aim to ensure compliance with applicable regulations and laws."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700314218412
  },
  {
    "title": "UK Navy Achieves Milestone as Mojave UAV Takes Off from Aircraft Carrier",
    "originLink": "https://www.eurasiantimes.com/a-glimpse-into-the-future-mammoth-mojave-uav-takes-of/",
    "originBody": "",
    "originSummary": [
      "The HMS Prince of Wales, a British carrier, successfully launched and landed the General Atomics 'Mojave' unmanned aerial vehicle (UAV) from its deck.",
      "The Mojave is the largest unmanned aircraft to be flown on a British carrier and can carry four Hellfire missiles.",
      "This test paves the way for the integration of unmanned and crewed aircraft in future naval operations, and could lead to further advancements in short takeoff and landing UAV capabilities."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700314218412
  },
  {
    "title": "Increasing Autonomous Operations in Drone Traffic Management Systems Can Improve Airspace Safety",
    "originLink": "https://dronelife.com/2023/11/17/autonomous-operations-in-future-drone-traffic-management-systems/",
    "originBody": "",
    "originSummary": [
      "A recent study from Johns Hopkins University suggests that increasing autonomous operations in drone traffic management systems can enhance safety as drone usage expands.",
      "The study concludes that replacing human-in-the-loop operations with autonomy is the best approach to ensure airspace safety in the face of projected congestion.",
      "By 2035, experts estimate 65,000 UAS takeoffs and landings per hour, which exceeds the capacity of the current air traffic management system. The study also explores the potential of a UAS traffic management system relying on semi-autonomous operations and highlights the effectiveness of autonomy algorithms in reducing collisions and addressing rogue drones."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700314218412
  },
  {
    "title": "Unleashing the Potential of Unmanned Systems: Overcoming Connectivity Challenges",
    "originLink": "https://www.c4isrnet.com/opinion/2023/11/17/unmanned-systems-are-only-as-capable-as-their-networks/",
    "originBody": "",
    "originSummary": [
      "Unmanned systems offer benefits such as reducing reliance on human assets for tactical missions and providing real-time data gathering capabilities.",
      "The current discussion on drones and robotic unmanned systems often overlooks the challenges of connectivity, especially in tactical scenarios.",
      "Wi-Fi and 3GPP 5G technology are not suitable for tactical scenarios, but private 5G networks and V-Band mmWave technology show promise.",
      "Private 5G networks offer better suitability for military operations, but the detectability of devices connected to these networks is still a challenge.",
      "V-Band mmWave technology, which uses license-exempt spectrum, provides advantages like low probability of detection and interception, jam resistance, and low latency.",
      "However, mmWave technology has limitations in terms of penetration and transmission distances.",
      "To fully unlock the potential of unmanned systems, military forces need high-performing low probability of detection (LPD) tactical networks."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700314218412
  },
  {
    "title": "Feasibility of Ukraine's Air Defense Shield Against Russian Attacks",
    "originLink": "https://news.yahoo.com/feasible-cover-ukraine-air-defense-201000765.html",
    "originBody": "",
    "originSummary": [
      "The article explores the possibility of establishing an air defense shield in Ukraine to safeguard against Russian missile and drone strikes.",
      "A multifunctional system comprising air defense assets, radar intelligence, and electronic warfare systems is deemed necessary.",
      "Challenges such as integrating disparate air defense systems and countering drone threats are discussed. The author underscores the importance of being prepared for different attack scenarios and acknowledges the difficulty of achieving complete coverage. Ultimately, they recommend that Ukraine adopt a comprehensive set of measures to protect their facilities."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700314218412
  }
]
