[
  {
    "id": 38519012,
    "title": "هارفارد تحل فريقا يحلل ملفات فيسبوك بعد تبرع زوكربيرج بمبلغ 500 مليون دولار",
    "originLink": "https://live-whistleblower-aid.pantheonsite.io/joan-donovan-press-release/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38519012",
    "commentBody": "",
    "originSummary": [
      "قامت جامعة هارفارد بحل فريقها من خبراء المعلومات المضللة ، بقيادة الدكتورة جوان دونوفان ، بعد تلقي تبرع بقيمة 500 مليون دولار من مبادرة تشان زوكربيرج.",
      "كان الفريق في مشروع أبحاث التكنولوجيا والتغيير الاجتماعي بجامعة هارفارد يحقق في وعي فيسبوك بالضرر الناجم عن منصته.",
      "يؤكد الكشف عن المبلغين عن المخالفات على أهمية حماية أبحاث المصلحة العامة من مصالح الشركات القوية ويدعو إلى إجراء تحقيق في التأثير غير المناسب المحتمل في جامعة هارفارد."
    ],
    "commentSummary": [
      "قلصت جامعة هارفارد فريقها الذي يحقق في ملفات فيسبوك بعد تلقي تبرع بقيمة 500 مليون دولار من مارك زوكربيرج.",
      "أثار قرار خفض الموارد مخاوف بشأن استقلالية الجامعة في التدقيق في عملاق وسائل التواصل الاجتماعي.",
      "وأثارت هذه الخطوة تساؤلات حول تضارب المصالح المحتمل وتأثيرها على موضوعية التحقيق."
    ],
    "points": 1127,
    "commentCount": 11,
    "retryCount": 0,
    "time": 1701706198
  },
  {
    "id": 38519257,
    "title": "عقد من مراقبة بياناتك: التفكير في هل تعرضت للخداع",
    "originLink": "https://www.troyhunt.com/a-decade-of-have-i-been-pwned/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38519257",
    "commentBody": "",
    "originSummary": [
      "Have I Been Pwned هو موقع ويب يساعد المستخدمين على التحقق مما إذا كانت معلوماتهم الشخصية قد تم اختراقها في خروقات البيانات.",
      "يحتفل الموقع ، الذي أنشأه تروي هانت ، بمرور 10 سنوات على تأسيسه.",
      "تؤكد المقالة على أهمية كلمات المرور الآمنة والخصوصية عبر الإنترنت في المشهد الرقمي الحالي."
    ],
    "commentSummary": [
      "تعد الحماية من هجمات حشو بيانات الاعتماد أمرا بالغ الأهمية للحفاظ على الأمان عبر الإنترنت.",
      "يمكن أن توفر قاعدة بيانات كلمات المرور المجزأة في Troy Hunt طبقة إضافية من الأمان.",
      "النقاش حول تجزئات كلمة المرور ، API مقابل المتجر الداخلي ، والعواطف المحيطة بكلمات المرور الضعيفة مستمر.",
      "كما تتم مناقشة التعقيدات القانونية المحيطة باستخدام كلمة المرور.",
      "تم ذكر لوائح خصوصية الإنترنت ، والعقاب على الأعمال الصالحة ، وإحباط المستخدم من التسعير على موقع Have I Been Pwned.",
      "يتم تغطية تجارب الأمان عبر الإنترنت وشعبية كلمات مرور Pwned.",
      "يتم تسليط الضوء على مخاطر رسائل البريد الإلكتروني الاحتيالية."
    ],
    "points": 603,
    "commentCount": 149,
    "retryCount": 0,
    "time": 1701707215
  },
  {
    "id": 38517099,
    "title": "تقديم Django 5.0: ميزات جديدة وترقيات ملحة",
    "originLink": "https://www.djangoproject.com/weblog/2023/dec/04/django-50-released/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38517099",
    "commentBody": "",
    "originSummary": [
      "تم إصدار Django 5.0 ، ويضم وظائف جديدة مثل القيم الافتراضية المحسوبة لقاعدة البيانات ، وحقول النموذج التي تم إنشاؤها ، ومجموعات الحقول لعرض حقل النموذج.",
      "وصل Django 4.2 إلى نهاية الدعم الأساسي ، لذلك من الأهمية بمكان أن يقوم المستخدمون بالترقية لضمان تلقيهم إصلاحات الأمان.",
      "وصل Django 4.1 أيضا إلى نهاية الدعم الموسع ، مما يجعل من الضروري للمستخدمين الترقية إلى Django 4.2 أو إصدار أحدث.",
      "تم تحديد موعد DjangoCon Europe 2024 في 5 يونيو 2024 في فيغو ، إسبانيا."
    ],
    "commentSummary": [
      "Django هو إطار عمل شائع معروف ببساطته وإنتاجيته وميزاته المضمنة مثل نظام الإدارة.",
      "يقترح بعض المستخدمين بدائل مثل Wagtail و FastAPI ، مما يسلط الضوء على عيوب Django.",
      "تغطي المناقشات أيضا موضوعات مثل استخدام htmx للعرض من جانب العميل ، ومشكلات الأداء مع استعلامات قاعدة البيانات ، وأهمية مراقبة الأداء وتحسينه."
    ],
    "points": 518,
    "commentCount": 195,
    "retryCount": 0,
    "time": 1701697489
  },
  {
    "id": 38517550,
    "title": "هارفارد متهمة بالرضوخ لميتا ، والإطاحة بباحث المعلومات المضللة",
    "originLink": "https://www.washingtonpost.com/technology/2023/12/04/joan-donovan-harvard-dismissal-complaint/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38517550",
    "commentBody": "",
    "originSummary": [
      "تتهم الباحثة في مجال المعلومات المضللة جوان دونوفان جامعة هارفارد بفصلها لاسترضاء فيسبوك وانتهاك حقها في حرية التعبير.",
      "تدعي دونوفان أن فصلها كان بسبب تلقي هارفارد تعهدا بقيمة 500 مليون دولار من الذراع الخيرية لمارك زوكربيرج ومشاركتها في أوراق فيسبوك.",
      "تنفي جامعة هارفارد طرد دونوفان وتؤكد أنه عرض عليها منصب محاضر مساعد بدوام جزئي ، مما دفع دونوفان إلى تقديم بيان قانوني إلى وزارة التعليم والمدعي العام في ماساتشوستس لإجراء تحقيق في فصلها وخداع هارفارد المزعوم للمتبرعين."
    ],
    "commentSummary": [
      "أثارت المناقشات والحوادث الأخيرة في جامعة هارفارد مخاوف بشأن تمويل البحوث وتأثير المانحين الرئيسيين.",
      "تم تسليط الضوء على مزاعم قمع البحوث وتضارب المصالح والإجراءات غير الأخلاقية من قبل مسؤولي الجامعة.",
      "كما تستكشف المناقشات موضوعات مثل الحرية الأكاديمية، وأخلاقيات قبول التمويل المقيد، ودور الرشوة في النظم الاقتصادية، مع التأكيد على الحاجة إلى الشفافية والنزاهة في المؤسسات البحثية."
    ],
    "points": 460,
    "commentCount": 456,
    "retryCount": 0,
    "time": 1701699637
  },
  {
    "id": 38520487,
    "title": "مستكشف فك الترجمة: أداة مفتوحة المصدر لتحليل الملفات الثنائية",
    "originLink": "https://dogbolt.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38520487",
    "commentBody": "",
    "originSummary": [
      "Decompiler Explorer هي أداة مفتوحة المصدر تمكن المستخدمين من تحميل وتحليل الملفات الثنائية.",
      "وهو يدعم عينات متعددة ويوفر العديد من برامج فك التحويل لاستكشاف التعليمات البرمجية.",
      "يتم استضافة الأداة على GitHub ويمكن تقسيمها بسهولة للتخصيص والتعاون."
    ],
    "commentSummary": [
      "تدور المحادثة حول مستكشف Dogbolt Decompiler Explorer وأدائه ، إلى جانب أدوات تفكيك وفك التعليمات البرمجية الأخرى مثل Binary Ninja و Ghidra.",
      "تعرض Hex-Rays و Vector 35 قدراتها في فك التحويل البرمجي في HexRays Online ، وهي منصة برعاية.",
      "تشير المحادثة أيضا إلى \"agoprev\" ، وهو موقع ويب لمشاركة الثنائيات وإجراء مقارنات مع منصات مماثلة ، وشعبية أداة GCC Explorer. ينفي خالق Godbolt أي تأثير متعمد من Dogpile."
    ],
    "points": 399,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1701712375
  },
  {
    "id": 38523704,
    "title": "يحصل مستخدم YouTube على 6 أشهر في السجن لعرقلة التحقيق في تحطم طائرة",
    "originLink": "https://www.justice.gov/usao-cdca/pr/santa-barbara-county-man-sentenced-6-months-prison-obstructing-federal-probe-plane",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38523704",
    "commentBody": "",
    "originSummary": [
      "حكم على طيار يوتيوبر تريفور دانيال جاكوب بالسجن لمدة ستة أشهر في السجن الفيدرالي لعرقلة تحقيق فيدرالي في حادث تحطم طائرة تسبب فيه عمدا للمشاهدات عبر الإنترنت.",
      "دمر جاكوب حطام الطائرة وكذب على المحققين بشأن موقعها ، بينما كان يحقق الدخل من الحادث من خلال مقطع فيديو على YouTube يروج لمحفظة.",
      "تم إجراء التحقيق من قبل وزارة النقل الأمريكية - مكتب المفتش العام ، بمساعدة من المجلس الوطني لسلامة النقل (NTSB) وإدارة الطيران الفيدرالية (FAA)."
    ],
    "commentSummary": [
      "حكم على أحد مستخدمي YouTube بالسجن لمدة ستة أشهر لعرقلة تحقيق فيدرالي في حادث تحطم طائرة ، مما يلقي الضوء على تداعيات التستر.",
      "يمكن أن تجذب عمليات التستر الفاشلة الانتباه وتوفر المزيد من الأدلة للمقاضاة، مع التركيز على المخاطر المحتملة التي تنطوي عليها.",
      "تتعمق المحادثة في انتهاكات لوائح صيانة الطيران ، والأفعال المتعمدة التي تسبب حوادث تحطم الطائرات ، والتداعيات القانونية ، والعقوبات المحتملة ، والسيطرة على الطيران ، والتنفيذ المحدود ل \"التبرؤ\"."
    ],
    "points": 388,
    "commentCount": 216,
    "retryCount": 0,
    "time": 1701726975
  },
  {
    "id": 38518994,
    "title": "قم بإيقاف تشغيل الإعدادات التي تدمر تجربة التلفزيون",
    "originLink": "https://practicalbetterments.com/switch-off-bad-tv-settings/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38518994",
    "commentBody": "",
    "originSummary": [
      "يمكن أن تؤدي بعض الإعدادات على أجهزة التلفزيون الذكية ، مثل استيفاء الحركة والتباين الديناميكي ، إلى تشويه الصور وجعل الأفلام تبدو وكأنها مسلسلات تلفزيونية.",
      "توفر المقالة أسماء بديلة لهذه الإعدادات وتوصي بإيقاف تشغيلها للحصول على تجربة مشاهدة أفضل.",
      "يقترح استخدام وضع صانع الأفلام إذا كان متاحا ويوفر موارد لتحسين إعدادات التلفزيون ومعرفة المزيد حول الموضوع."
    ],
    "commentSummary": [
      "تغطي المناقشة إعدادات وميزات التلفزيون المختلفة ، بما في ذلك التعتيم المحلي ، ومسح HDMI الزائد ، والميكروفونات ، واستيفاء الإطار ، والرسوم المتحركة ، وعرض الفيديو ، واستيفاء الحركة ، ومعدلات الإطارات العالية في الأفلام.",
      "تختلف الآراء حول معدلات الإطارات العالية ، حيث يجدها بعض المشاهدين غير طبيعية وغير مريحة ، بينما يستمتع بها الآخرون.",
      "تم ذكر إدخال الإطار الأسود كبديل لتقليل التأتأة ولكنه يؤدي إلى فقدان السطوع. قد يعاني بعض الأفراد من الصداع أو الصداع النصفي عند مشاهدة مقاطع الفيديو ذات معدلات الإطارات المنخفضة.",
      "كما تتم مناقشة نماذج التلفزيون المختلفة وقدراتها ، إلى جانب حظر الإعلانات والإعلانات غير القابلة للتخطي.",
      "يتم التطرق إلى النقاش حول الحفاظ على القصد الفني الأصلي للمبدعين."
    ],
    "points": 360,
    "commentCount": 427,
    "retryCount": 0,
    "time": 1701706112
  },
  {
    "id": 38519277,
    "title": "التوقعات بدون أشرطة خطأ تعيق التفسير الدقيق",
    "originLink": "https://andrewpwheeler.com/2023/11/19/forecasts-need-to-have-error-bars/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38519277",
    "commentBody": "",
    "originSummary": [
      "يقدم المقال الأكاديمي الذي انتقده المؤلف تنبؤات بمعدل الجريمة دون تضمين فترات التنبؤ.",
      "يوضح المؤلف مع نماذج ARIMA في Python كيف يجب تضمين فترات خطأ التنبؤ المعقولة لتفسير دقيق للاتجاهات.",
      "يسلط المؤلف الضوء على أهمية تضمين أشرطة الخطأ وينتقد المقالة الأصلية بسبب الإفراط في تجهيز النماذج وإساءة تفسير الارتباطات. وخلصوا إلى أن التنبؤات بالجريمة على المستوى الكلي ليست مفيدة للاستجابة السياساتية واقترحوا طرائق بديلة لتخصيص الموارد للتصدي للجريمة."
    ],
    "commentSummary": [
      "يعد دمج أشرطة الخطأ أو فترات عدم اليقين في التنبؤ والتحليلات الإحصائية أمرا بالغ الأهمية لتحسين موثوقية النماذج والتنبؤات العلمية.",
      "تسلط المناقشات الضوء على قيمة التنبؤ في صنع القرار وتحديات القياس الدقيق والتنبؤ بنتائج معينة.",
      "كما غطت المناقشات تفضيل الأفكار الاقتصادية غير التقليدية في الأوساط الأكاديمية، والمصطلحات المختلفة لتمثيل فترات عدم اليقين، وصعوبة تقدير الكميات الشرطية."
    ],
    "points": 306,
    "commentCount": 125,
    "retryCount": 0,
    "time": 1701707289
  },
  {
    "id": 38525978,
    "title": "كشف النقاب عن استغلال منطق بوت في Magic: The Gathering Arena ، مما يؤدي إلى تنازلات تلقائية",
    "originLink": "https://www.mayer.cool/writings/I-Hacked-Magic-the-Gathering/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38525978",
    "commentBody": "",
    "originSummary": [
      "وجد مؤلف المنشور طريقة لجعل المعارضين يتنازلون في لعبة Magic: The Gathering Arena وأبلغ مطوري اللعبة بذلك.",
      "يشرح المنشور سبب كون ألعاب الورق مثل Magic: The Gathering أكثر مقاومة للقرصنة بشكل عام.",
      "اكتشف المؤلف منطق بوت داخل اللعبة يعمل محليا على جهاز اللاعب واستخدمه لجعل الخصوم يتنازلون تلقائيا في مباراة عادية. شاركوا الكود وأبلغوا مطوري اللعبة بالمشكلة."
    ],
    "commentSummary": [
      "تستكشف المقالة تجربة المستخدم في اختراق Magic the Gathering: Arena لتحقيق معدل فوز بنسبة 100٪.",
      "يناقش استنشاق حركة مرور الشبكة وتشفيرها كتدابير لمنع الغش في اللعبة.",
      "تتعمق المقالة أيضا في القدرة على تحمل تكاليف اللعبة وتعقيدها ، بما في ذلك الحلقات اللانهائية وحالات اللعبة غير القابلة للحل والقواعد المحيطة بها."
    ],
    "points": 294,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1701740955
  },
  {
    "id": 38519719,
    "title": "حساب رقم فيبوناتشي بناء على مدخلات المستخدم",
    "originLink": "https://html-lang.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38519719",
    "commentBody": "",
    "originSummary": [
      "يطالب البرنامج المستخدم بإدخال رقم بين 0 و 20.",
      "ينصح المستخدمون باختيار رقم أقل من 20 لمنع أي تأخير.",
      "ثم يطلب البرنامج من المستخدم إدخال رقم أكبر من 0.",
      "ناتج البرنامج هو رقم فيبوناتشي n ، حيث n هو إدخال المستخدم."
    ],
    "commentSummary": [
      "تدور المناقشات حول فكرة استخدام HTML كلغة برمجة والفوائد والعيوب المحتملة لهذا النهج.",
      "يتم تقديم اقتراحات لدمج الكتابة الثابتة أو استخدام TypeScript لتحسين HTML كلغة برمجة.",
      "هناك أيضا نقاش حول قابلية التشغيل البيني ل HTML مع JavaScript واستخدامه على كل من الواجهة الأمامية والخلفية."
    ],
    "points": 280,
    "commentCount": 127,
    "retryCount": 0,
    "time": 1701709044
  },
  {
    "id": 38518473,
    "title": "نقد جوجل: أداة مراجعة رمز الرضا العالي",
    "originLink": "https://engineercodex.substack.com/p/how-google-takes-the-pain-out-of",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38518473",
    "commentBody": "",
    "originSummary": [
      "تحظى أداة مراجعة الكود من Google ، Critique ، بتقدير كبير ولديها معدل رضا مرتفع بين مهندسي البرمجيات.",
      "يناقش المقال إرشادات Google لمراجعات التعليمات البرمجية الفعالة ويسلط الضوء على ميزات Critique، بالإضافة إلى التطورات الحديثة في أدوات مراجعة التعليمات البرمجية التي تعمل بنظام الذكاء الاصطناعي.",
      "يقدم رؤى حول عملية مراجعة الكود في Google ، بما في ذلك إحصائيات حول مراجعة الكود في الشركة ، ويختتم بتسليط الضوء على الأسباب التي تجعل Critique يحظى بتقدير كبير من قبل موظفي Google."
    ],
    "commentSummary": [
      "تستكشف هذه المقالة الجوانب المختلفة لمراجعات التعليمات البرمجية ، بما في ذلك استخدام الأدوات المختلفة وأهمية اصطلاحات تسمية المتغيرات المتسقة.",
      "يناقش التعليقات الذاتية ، وقابلية قراءة الكود ، والمنطق ، واصطلاحات التسمية ، بالإضافة إلى الانتقاء في الترميز.",
      "تغطي المقالة أيضا دور مراجعات التعليمات البرمجية في الحفاظ على جودة التعليمات البرمجية ، بما في ذلك استخدام اقتراحات الذكاء الاصطناعي ، والنقاش حول مدى صرامة مراجعات التعليمات البرمجية ، وتقييم المهندسين بناء على كمية التعليقات."
    ],
    "points": 274,
    "commentCount": 274,
    "retryCount": 0,
    "time": 1701703894
  },
  {
    "id": 38522650,
    "title": "القاضي يرفض طلب أمازون برفض دعوى تجسس الحمام",
    "originLink": "https://arstechnica.com/tech-policy/2023/12/amazon-faces-trial-after-selling-bathroom-spycam-used-to-abuse-minor/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38522650",
    "commentBody": "",
    "originSummary": [
      "رفض قاض في ولاية فرجينيا الغربية طلب أمازون برفض دعوى قضائية مرفوعة ضد الشركة بشأن كاميرا تجسس تباع على منصتها.",
      "تزعم المدعية أن أمازون فحصت الكاميرا عدة مرات لكنها فشلت في منع استخدامها لالتقاط الصور في حمامها الخاص.",
      "حكم القاضي بأن أمازون لا يمكنها الادعاء بالصدمة لأن أوصاف المنتج اقترحت استخدامها لتسجيل اللحظات الخاصة في الحمام."
    ],
    "commentSummary": [
      "يتم بيع كاميرات التجسس الخفية المتخفية في زي العناصر اليومية على أمازون ، مما يسبب الجدل ويثير تساؤلات حول الشرعية والأخلاق والمسؤولية.",
      "هناك جدل حول تنظيم بائعي الطرف الثالث وانخفاض جودة المنتج ، فضلا عن المخاوف بشأن انتهاك الخصوصية وتسهيل الأنشطة غير القانونية المحتملة.",
      "توجد وجهات نظر مختلفة ، مع تقديم حجج للاستخدامات المشروعة لهذه الأجهزة بالإضافة إلى مخاوف بشأن إساءة استخدامها المحتملة."
    ],
    "points": 233,
    "commentCount": 145,
    "retryCount": 0,
    "time": 1701721992
  },
  {
    "id": 38524599,
    "title": "Zen: مانع إعلانات مفتوح المصدر وحارس خصوصية لأجهزة Mac و Windows و Linux",
    "originLink": "https://github.com/anfragment/zen",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38524599",
    "commentBody": "",
    "originSummary": [
      "Zen هو مانع إعلانات مفتوح المصدر وحارس خصوصية متاح لنظام التشغيل Windows و MacOS و Linux.",
      "يعترض طلبات HTTP ويحظر الإعلانات وتتبع البرامج النصية والبرامج الضارة والمحتوى غير المرغوب فيه.",
      "يمكن للمستخدمين تخصيص عوامل التصفية الخاصة بهم ويوفر حماية على مستوى النظام. يتطلب تثبيت شهادة جذر لاعتراض HTTPS."
    ],
    "commentSummary": [
      "Zen هو مانع إعلانات مفتوح المصدر يناقشه المستخدمون.",
      "أعرب المستخدمون عن مخاوفهم الأمنية واقترحوا تحسينات مثل قسم الأسئلة الشائعة والقدرة على اختيار خوادم DNS المنبع.",
      "هناك آراء متباينة حول حظر حركة مرور الإعلانات على مستوى الشبكة ، وتغطي المناقشات أيضا تحديات حظر حركة مرور الشبكة وأهمية الوكلاء غير الآمنين الذين يحددهم المستخدم.",
      "إن مصداقية مطوري البرامج وفعالية طرق حظر الإعلانات على منصات مثل YouTube هي أيضا مواضيع للمناقشة.",
      "تم ذكر أدوات حظر الإعلانات المختلفة وأدائها في الملخص."
    ],
    "points": 215,
    "commentCount": 143,
    "retryCount": 0,
    "time": 1701731842
  },
  {
    "id": 38522031,
    "title": "ترفع DoorDash الحد الأدنى للأجور إلى 29.93 دولارا في الساعة لعمال التوصيل في مدينة نيويورك",
    "originLink": "https://about.doordash.com/en-us/news/nyc-platform-experience",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38522031",
    "commentBody": "",
    "originSummary": [
      "تقوم DoorDash بتنفيذ تغييرات تشغيلية استجابة لمتطلبات الحد الأدنى للأجور الجديدة للعاملين في توصيل الطعام في مدينة نيويورك.",
      "سيحصل Dashers الآن على ما لا يقل عن 29.93 دولارا في الساعة ، باستثناء الإكراميات ، وهو ما يقرب من ضعف الحد الأدنى للأجور في مدينة نيويورك.",
      "سيتم تغيير خيار الإكرامية في التطبيق بعد الخروج لاستيعاب الرسوم المتزايدة ، وسيتم إيقاف برنامج Dasher Priority Access مؤقتا. ستواصل DoorDash أيضا التعامل مع صانعي السياسات وتتوقع المزيد من التعديلات التشغيلية."
    ],
    "commentSummary": [
      "تتمحور المناقشة حول خدمات توصيل الطعام ، وخاصة DoorDash و Uber Eats.",
      "تشمل الموضوعات الحد الأدنى للأجور لعمال التوصيل ، والمخاطر الصحية لراكبي الدراجات ، والآثار الضريبية على عمال الوظائف المؤقتة ، والمخاوف بشأن ممارسات سائقي التوصيل ، وتأثير البقشيش على صناعة المطاعم ، وتوافر واستدامة توصيل الطعام.",
      "تشمل نقاط النقاش الأخرى نماذج التوصيل البديلة ، وجدوى وربحية منصات توصيل الطعام ، والتحديات التي تواجهها هذه المنصات ، والوضع المالي لشركات مثل أوبر."
    ],
    "points": 213,
    "commentCount": 286,
    "retryCount": 0,
    "time": 1701718643
  },
  {
    "id": 38516717,
    "title": "تنفيذ الدعم طويل الأجل (LTS) ل Kubernetes: تبسيط ترقيات المجموعات وإدارتها",
    "originLink": "https://matduggan.com/why-kubernetes-needs-an-lts/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38516717",
    "commentBody": "",
    "originSummary": [
      "يمكن أن تكون ترقية مجموعات Kubernetes صعبة ومعقدة، مما يدفع إلى فكرة تنفيذ إصدار دعم طويل الأجل (LTS) مع فترة دعم ثابتة.",
      "يمكن أن يوفر إصدار LTS للمؤسسات دورة ترقية أكثر قابلية للإدارة ويشجع على ممارسات إدارة مجموعة أفضل.",
      "إن إحياء مجموعة عمل LTS يجلب توقعا للتقدم المحتمل في هذا المجال، مما قد يفيد مشغلي Kubernetes على مستوى العالم ويبسط النظام البيئي للطرف الثالث."
    ],
    "commentSummary": [
      "هناك نقاش مستمر حول ما إذا كان Kubernetes يحتاج إلى إصدار دعم طويل الأجل (LTS).",
      "يجادل البعض بالترقيات المتكررة لمنع البرامج القديمة وغير المدعومة ، بينما يؤكد البعض الآخر على الحاجة إلى الاستقرار وإصدارات LTS بسبب القيود التنظيمية.",
      "تتضمن المناقشة أيضا الحلول البديلة ، وتحديات الصيانة والتشغيل المستمر ، وإدارة النظام ، والأساليب المختلفة للتحديثات ، وتشغيل Kubernetes على منصات مختلفة ، وأهمية التوافق والتخطيط الدقيق."
    ],
    "points": 199,
    "commentCount": 162,
    "retryCount": 0,
    "time": 1701694903
  }
]
