[
  {
    "id": 38519012,
    "title": "Harvard dissolve equipe que analisa arquivos do Facebook após doação de US$ 500 milhões de Zuckerberg",
    "originLink": "https://live-whistleblower-aid.pantheonsite.io/joan-donovan-press-release/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38519012",
    "commentBody": "",
    "originSummary": [
      "A Universidade de Harvard dissolveu sua equipe de especialistas em desinformação, liderada pela Dra. Joan Donovan, depois de receber uma doação de US$ 500 milhões da Iniciativa Chan Zuckerberg.",
      "A equipe do Projeto de Pesquisa sobre Tecnologia e Mudança Social de Harvard estava investigando a conscientização do Facebook sobre os danos causados por sua plataforma.",
      "A revelação do denunciante enfatiza a importância de proteger a pesquisa de interesse público dos poderosos interesses corporativos e solicita uma investigação sobre possíveis influências inadequadas em Harvard."
    ],
    "commentSummary": [
      "A Universidade de Harvard reduziu sua equipe de investigação dos arquivos do Facebook após receber uma doação de US$ 500 milhões de Mark Zuckerberg.",
      "A decisão de reduzir os recursos gerou preocupações sobre a independência da universidade na análise do gigante da mídia social.",
      "A medida levantou questões sobre possíveis conflitos de interesse e o impacto sobre a objetividade da investigação."
    ],
    "points": 1127,
    "commentCount": 11,
    "retryCount": 0,
    "time": 1701706198
  },
  {
    "id": 38519257,
    "title": "Uma década de monitoramento de seus dados: Refletindo sobre o Have I Been Pwned",
    "originLink": "https://www.troyhunt.com/a-decade-of-have-i-been-pwned/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38519257",
    "commentBody": "",
    "originSummary": [
      "O Have I Been Pwned é um site que ajuda os usuários a verificar se suas informações pessoais foram comprometidas em violações de dados.",
      "O site, criado por Troy Hunt, comemora seu aniversário de 10 anos.",
      "O artigo enfatiza a importância das senhas seguras e da privacidade on-line no atual cenário digital."
    ],
    "commentSummary": [
      "A proteção contra ataques de preenchimento de credenciais é fundamental para manter a segurança on-line.",
      "O banco de dados de senhas com hash do Troy Hunt pode fornecer uma camada adicional de segurança.",
      "O debate sobre hashes de senha, API versus armazenamento interno e as emoções que envolvem senhas fracas é contínuo.",
      "As complexidades jurídicas relacionadas ao uso de senhas também são discutidas.",
      "São mencionadas as normas de privacidade da Internet, a punição por boas ações e a frustração dos usuários com os preços no site Have I Been Pwned.",
      "As experiências de segurança on-line e a popularidade das Pwned Passwords são abordadas.",
      "Os perigos dos e-mails fraudulentos são destacados."
    ],
    "points": 603,
    "commentCount": 149,
    "retryCount": 0,
    "time": 1701707215
  },
  {
    "id": 38517099,
    "title": "Apresentando o Django 5.0: Novos recursos e atualizações urgentes",
    "originLink": "https://www.djangoproject.com/weblog/2023/dec/04/django-50-released/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38517099",
    "commentBody": "",
    "originSummary": [
      "O Django 5.0 foi lançado, apresentando novas funcionalidades, como valores padrão calculados pelo banco de dados, campos de modelo gerados e grupos de campos para renderização de campos de formulário.",
      "O Django 4.2 chegou ao fim do suporte principal, portanto, é crucial que os usuários façam a atualização para garantir que recebam as correções de segurança.",
      "O Django 4.1 também chegou ao fim do suporte estendido, tornando necessário que os usuários atualizem para o Django 4.2 ou uma versão posterior.",
      "A DjangoCon Europe 2024 foi agendada para 5 de junho de 2024, em Vigo, Espanha."
    ],
    "commentSummary": [
      "O Django é uma estrutura popular conhecida por sua simplicidade, produtividade e recursos integrados, como o sistema de administração.",
      "Alternativas como Wagtail e FastAPI são sugeridas por alguns usuários, destacando as desvantagens do Django.",
      "As discussões também abrangem tópicos como o uso de htmx para renderização no lado do cliente, problemas de desempenho com consultas a bancos de dados e a importância de monitorar e otimizar o desempenho."
    ],
    "points": 518,
    "commentCount": 195,
    "retryCount": 0,
    "time": 1701697489
  },
  {
    "id": 38517550,
    "title": "Harvard é acusada de ceder ao Meta e demitir um acadêmico de desinformação",
    "originLink": "https://www.washingtonpost.com/technology/2023/12/04/joan-donovan-harvard-dismissal-complaint/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38517550",
    "commentBody": "",
    "originSummary": [
      "A acadêmica de desinformação Joan Donovan acusa a Universidade de Harvard de demiti-la para agradar o Facebook e violar seu direito à liberdade de expressão.",
      "Donovan alega que sua demissão se deveu ao fato de Harvard ter recebido uma promessa de US$ 500 milhões do braço filantrópico de Mark Zuckerberg e ao seu envolvimento com o Facebook Papers.",
      "Harvard nega ter demitido Donovan e afirma que foi oferecido a ela um cargo de professora adjunta de meio período, o que levou Donovan a apresentar uma declaração legal ao Departamento de Educação e ao procurador-geral de Massachusetts para que seja feita uma investigação sobre sua demissão e sobre a suposta fraude de Harvard em relação aos doadores."
    ],
    "commentSummary": [
      "Discussões e incidentes recentes na Universidade de Harvard levantaram preocupações sobre o financiamento de pesquisas e a influência de grandes doadores.",
      "Foram reveladas alegações de supressão de pesquisas, conflitos de interesse e ações antiéticas por parte de funcionários da universidade.",
      "As discussões também exploram tópicos como a liberdade acadêmica, a ética de aceitar financiamento restrito e o papel do suborno nos sistemas econômicos, enfatizando a necessidade de transparência e integridade nas instituições de pesquisa."
    ],
    "points": 460,
    "commentCount": 456,
    "retryCount": 0,
    "time": 1701699637
  },
  {
    "id": 38520487,
    "title": "Decompiler Explorer: Ferramenta de código aberto para análise de arquivos binários",
    "originLink": "https://dogbolt.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38520487",
    "commentBody": "",
    "originSummary": [
      "O Decompiler Explorer é uma ferramenta de código aberto que permite aos usuários fazer upload e analisar arquivos binários.",
      "Ele oferece suporte a várias amostras e fornece vários descompiladores para exploração de código.",
      "A ferramenta está hospedada no GitHub e pode ser facilmente bifurcada para personalização e colaboração."
    ],
    "commentSummary": [
      "A conversa gira em torno do Dogbolt Decompiler Explorer e seu desempenho, juntamente com outras ferramentas de desmontagem e descompilação de código, como Binary Ninja e Ghidra.",
      "O Hex-Rays e o Vector 35 apresentam seus recursos de descompilação no HexRays Online, uma plataforma patrocinada.",
      "A conversa também menciona o \"agoprev\", um site para compartilhar binários e fazer comparações com plataformas semelhantes, e a popularidade da ferramenta GCC Explorer. O criador do Godbolt nega qualquer influência intencional do Dogpile."
    ],
    "points": 399,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1701712375
  },
  {
    "id": 38523704,
    "title": "YouTuber pega 6 meses de prisão por obstruir investigação de acidente aéreo",
    "originLink": "https://www.justice.gov/usao-cdca/pr/santa-barbara-county-man-sentenced-6-months-prison-obstructing-federal-probe-plane",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38523704",
    "commentBody": "",
    "originSummary": [
      "O piloto do YouTuber Trevor Daniel Jacob foi condenado a seis meses de prisão federal por obstruir uma investigação federal sobre um acidente de avião que ele deliberadamente causou para obter visualizações on-line.",
      "Jacob destruiu os destroços do avião e mentiu para os investigadores sobre sua localização, além de monetizar o acidente por meio de um vídeo no YouTube promovendo uma carteira.",
      "A investigação foi conduzida pelo Departamento de Transportes dos Estados Unidos - Escritório do Inspetor Geral, com a assistência do National Transportation Safety Board (NTSB) e da Federal Aviation Administration (FAA)."
    ],
    "commentSummary": [
      "Um YouTuber foi condenado a seis meses de prisão por atrapalhar uma investigação federal sobre um acidente de avião, esclarecendo as repercussões de encobrimentos.",
      "Os encobrimentos fracassados podem atrair a atenção e fornecer mais evidências para a acusação, enfatizando os possíveis riscos envolvidos.",
      "A conversa se aprofunda nas violações das normas de manutenção da aviação, atos intencionais que causam acidentes aéreos, ramificações legais, possíveis penalidades, controle na aviação e a implementação limitada da \"restituição\"."
    ],
    "points": 388,
    "commentCount": 216,
    "retryCount": 0,
    "time": 1701726975
  },
  {
    "id": 38518994,
    "title": "Desative as configurações que prejudicam sua experiência com a TV",
    "originLink": "https://practicalbetterments.com/switch-off-bad-tv-settings/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38518994",
    "commentBody": "",
    "originSummary": [
      "Determinadas configurações das smart TVs, como interpolação de movimento e contraste dinâmico, podem distorcer as imagens e fazer com que os filmes pareçam novelas.",
      "O artigo fornece nomes alternativos para essas configurações e recomenda desativá-las para uma melhor experiência de visualização.",
      "Ele sugere o uso do modo filmmaker, se disponível, e fornece recursos para otimizar as configurações da TV e aprender mais sobre o assunto."
    ],
    "commentSummary": [
      "A discussão abrange várias configurações e recursos de TV, incluindo escurecimento local, overscan HDMI, microfones, interpolação de quadros, animação, exibição de vídeo, interpolação de movimento e altas taxas de quadros em filmes.",
      "As opiniões sobre as altas taxas de quadros variam, com alguns espectadores achando-as antinaturais e desconfortáveis, enquanto outros gostam delas.",
      "A inserção de quadros pretos é mencionada como uma alternativa para reduzir a gagueira, mas resulta em uma perda de brilho. Algumas pessoas podem sentir dores de cabeça ou enxaquecas ao assistir a vídeos com baixas taxas de quadros.",
      "Os diferentes modelos de TV e seus recursos também são discutidos, juntamente com o bloqueio de anúncios e os anúncios que não podem ser pulados.",
      "O debate sobre a preservação da intenção artística original dos criadores é abordado."
    ],
    "points": 360,
    "commentCount": 427,
    "retryCount": 0,
    "time": 1701706112
  },
  {
    "id": 38519277,
    "title": "As previsões sem barras de erro dificultam a interpretação precisa",
    "originLink": "https://andrewpwheeler.com/2023/11/19/forecasts-need-to-have-error-bars/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38519277",
    "commentBody": "",
    "originSummary": [
      "O artigo acadêmico criticado pelo autor fornece previsões de taxas de criminalidade sem incluir intervalos de previsão.",
      "O autor demonstra com modelos ARIMA em Python como intervalos de erro de previsão razoáveis devem ser incluídos para uma interpretação precisa das tendências.",
      "O autor destaca a importância da inclusão de barras de erro e critica o artigo original por modelos de ajuste excessivo e interpretação errônea das correlações. Eles concluem que as previsões de criminalidade em nível macro não são úteis para a resposta de políticas e sugerem métodos alternativos para a alocação de recursos para combater a criminalidade."
    ],
    "commentSummary": [
      "A incorporação de barras de erro ou intervalos de incerteza em previsões e análises estatísticas é fundamental para melhorar a confiabilidade de modelos e previsões científicas.",
      "As discussões destacam o valor da previsão na tomada de decisões e os desafios de medir e prever com precisão determinados resultados.",
      "A preferência por ideias econômicas não tradicionais na academia, a terminologia diferente para representar intervalos de incerteza e a dificuldade de estimar quantis condicionais também são abordadas nas discussões."
    ],
    "points": 306,
    "commentCount": 125,
    "retryCount": 0,
    "time": 1701707289
  },
  {
    "id": 38525978,
    "title": "Revelando uma exploração da lógica de bots em Magic: The Gathering Arena, acionando concessões automáticas",
    "originLink": "https://www.mayer.cool/writings/I-Hacked-Magic-the-Gathering/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38525978",
    "commentBody": "",
    "originSummary": [
      "O autor da postagem encontrou uma maneira de fazer com que os oponentes concedessem no jogo Magic: The Gathering Arena e informou os desenvolvedores do jogo sobre isso.",
      "A postagem explica por que jogos de cartas como Magic: The Gathering são geralmente mais resistentes a hackers.",
      "O autor descobriu uma lógica de bot dentro do jogo que é executada localmente na máquina do jogador e a utilizou para fazer com que os oponentes concedessem automaticamente a vitória em uma partida normal. Ele compartilhou o código e relatou o problema aos desenvolvedores do jogo."
    ],
    "commentSummary": [
      "O artigo explora a experiência de um usuário em hackear o Magic the Gathering: Arena para obter uma taxa de vitória de 100%.",
      "Ele discute a detecção e a criptografia do tráfego de rede como medidas para impedir a trapaça no jogo.",
      "O artigo também aborda a acessibilidade e a complexidade do jogo, incluindo loops infinitos, estados de jogo sem solução e as regras que os envolvem."
    ],
    "points": 294,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1701740955
  },
  {
    "id": 38519719,
    "title": "Cálculo do número de Fibonacci com base na entrada do usuário",
    "originLink": "https://html-lang.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38519719",
    "commentBody": "",
    "originSummary": [
      "O programa solicita que o usuário insira um número entre 0 e 20.",
      "Os usuários são aconselhados a escolher um número menor que 20 para evitar atrasos.",
      "Em seguida, o programa solicita que o usuário insira um número maior que 0.",
      "O resultado do programa é o enésimo número de Fibonacci, em que n é a entrada do usuário."
    ],
    "commentSummary": [
      "As discussões giram em torno da ideia de usar o HTML como uma linguagem de programação e as possíveis vantagens e desvantagens dessa abordagem.",
      "São feitas sugestões para incorporar a digitação estática ou usar o TypeScript para aprimorar o HTML como uma linguagem de programação.",
      "Há também uma discussão sobre a interoperabilidade do HTML com o JavaScript e seu uso tanto no front-end quanto no back-end."
    ],
    "points": 280,
    "commentCount": 127,
    "retryCount": 0,
    "time": 1701709044
  },
  {
    "id": 38518473,
    "title": "Crítica do Google: Uma ferramenta de revisão de código de alta satisfação",
    "originLink": "https://engineercodex.substack.com/p/how-google-takes-the-pain-out-of",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38518473",
    "commentBody": "",
    "originSummary": [
      "A ferramenta de revisão de código do Google, Critique, é altamente conceituada e tem um alto índice de satisfação entre os engenheiros de software.",
      "O artigo discute as diretrizes do Google para revisões de código eficientes e destaca os recursos do Critique, bem como os avanços recentes nas ferramentas de revisão de código com tecnologia de IA.",
      "Ele fornece insights sobre o processo de revisão de código do Google, incluindo estatísticas sobre a revisão de código na empresa, e conclui destacando os motivos pelos quais o Critique é tão bem conceituado pelos Googlers."
    ],
    "commentSummary": [
      "Este artigo explora diferentes aspectos das revisões de código, incluindo o uso de várias ferramentas e a importância de convenções consistentes de nomenclatura de variáveis.",
      "Ele discute o feedback subjetivo, a legibilidade do código, a lógica e as convenções de nomenclatura, bem como a nitpicking na codificação.",
      "O artigo também aborda a função das revisões de código na manutenção da qualidade do código, incluindo o uso de sugestões de IA, o debate sobre o grau de rigor das revisões de código e a avaliação dos engenheiros com base na quantidade de comentários."
    ],
    "points": 274,
    "commentCount": 274,
    "retryCount": 0,
    "time": 1701703894
  },
  {
    "id": 38522650,
    "title": "Juiz nega a moção da Amazon para rejeitar o processo de câmera espiã do banheiro",
    "originLink": "https://arstechnica.com/tech-policy/2023/12/amazon-faces-trial-after-selling-bathroom-spycam-used-to-abuse-minor/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38522650",
    "commentBody": "",
    "originSummary": [
      "Um juiz da Virgínia Ocidental negou a moção da Amazon para rejeitar um processo movido contra a empresa por causa de uma câmera espiã vendida em sua plataforma.",
      "A autora alega que a Amazon inspecionou a câmera várias vezes, mas não conseguiu impedir que ela fosse usada para capturar fotos em seu banheiro particular.",
      "O juiz determinou que a Amazon não pode alegar choque, pois as descrições do produto sugeriam seu uso para registrar momentos privados no banheiro."
    ],
    "commentSummary": [
      "Câmeras espiãs ocultas disfarçadas de itens de uso diário estão sendo vendidas na Amazon, causando polêmica e levantando questões sobre legalidade, ética e responsabilidade.",
      "Há um debate sobre a regulamentação de vendedores terceirizados e o declínio na qualidade do produto, bem como preocupações sobre a invasão de privacidade e a facilitação de possíveis atividades ilegais.",
      "Existem diferentes perspectivas, com argumentos a favor do uso legítimo desses dispositivos, bem como preocupações sobre seu possível uso indevido."
    ],
    "points": 233,
    "commentCount": 145,
    "retryCount": 0,
    "time": 1701721992
  },
  {
    "id": 38524599,
    "title": "Zen: Bloqueador de anúncios de código aberto e protetor de privacidade para Mac, Windows e Linux",
    "originLink": "https://github.com/anfragment/zen",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38524599",
    "commentBody": "",
    "originSummary": [
      "O Zen é um bloqueador de anúncios de código aberto e um protetor de privacidade disponível para Windows, MacOS e Linux.",
      "Ele intercepta solicitações HTTP e bloqueia anúncios, scripts de rastreamento, malware e conteúdo indesejado.",
      "Os usuários podem personalizar seus filtros e ele oferece proteção em nível de sistema. Ele requer a instalação de um certificado raiz para interceptação de HTTPS."
    ],
    "commentSummary": [
      "O Zen é um bloqueador de anúncios de código aberto que está sendo discutido pelos usuários.",
      "Os usuários expressaram preocupações com a segurança e sugeriram melhorias, como uma seção de perguntas frequentes e a possibilidade de escolher servidores DNS upstream.",
      "Há opiniões divergentes sobre o bloqueio do tráfego de anúncios no nível da rede, e as discussões também abordam os desafios do bloqueio do tráfego de rede e a importância de proxies não seguros definidos pelo usuário.",
      "A confiabilidade dos desenvolvedores de software e a eficácia dos métodos de bloqueio de anúncios em plataformas como o YouTube também são tópicos de discussão.",
      "Várias ferramentas de bloqueio de anúncios e seu desempenho são mencionados no resumo."
    ],
    "points": 215,
    "commentCount": 143,
    "retryCount": 0,
    "time": 1701731842
  },
  {
    "id": 38522031,
    "title": "DoorDash aumenta o salário mínimo para US$ 29,93 por hora para os entregadores de Nova York",
    "originLink": "https://about.doordash.com/en-us/news/nyc-platform-experience",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38522031",
    "commentBody": "",
    "originSummary": [
      "A DoorDash está implementando mudanças operacionais em resposta às novas exigências de pagamento mínimo para os trabalhadores de entrega de alimentos na cidade de Nova York.",
      "Os Dashers agora receberão um mínimo de US$ 29,93 por hora, excluindo gorjetas, o que é quase o dobro do salário mínimo de Nova York.",
      "A opção de dar gorjeta no aplicativo será deslocada após o checkout para acomodar o aumento das taxas, e o programa Dasher Priority Access será temporariamente pausado. A DoorDash também continuará a se envolver com os formuladores de políticas e espera mais ajustes operacionais."
    ],
    "commentSummary": [
      "A discussão gira em torno dos serviços de entrega de alimentos, especialmente o DoorDash e o Uber Eats.",
      "Os tópicos incluem o pagamento mínimo para entregadores, riscos à saúde dos ciclistas, implicações fiscais para os trabalhadores autônomos, preocupações com as práticas dos entregadores, o impacto da gorjeta no setor de restaurantes e a disponibilidade e sustentabilidade da entrega de alimentos.",
      "Outros pontos de debate incluem modelos alternativos de entrega, a viabilidade e a lucratividade das plataformas de entrega de alimentos, os desafios enfrentados por essas plataformas e a situação financeira de empresas como a Uber."
    ],
    "points": 213,
    "commentCount": 286,
    "retryCount": 0,
    "time": 1701718643
  },
  {
    "id": 38516717,
    "title": "Implementando o suporte de longo prazo (LTS) para o Kubernetes: Simplificando as atualizações e o gerenciamento do cluster",
    "originLink": "https://matduggan.com/why-kubernetes-needs-an-lts/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38516717",
    "commentBody": "",
    "originSummary": [
      "A atualização dos clusters do Kubernetes pode ser desafiadora e complexa, o que levou à ideia de implementar uma versão de suporte de longo prazo (LTS) com um período de suporte fixo.",
      "Uma versão LTS poderia oferecer às organizações um ciclo de atualização mais gerenciável e incentivar melhores práticas de gerenciamento de clusters.",
      "O renascimento do grupo de trabalho LTS traz a expectativa de um possível progresso nessa área, o que poderia beneficiar os operadores do Kubernetes globalmente e simplificar o ecossistema de terceiros."
    ],
    "commentSummary": [
      "Há um debate contínuo sobre se o Kubernetes precisa de uma versão de suporte de longo prazo (LTS).",
      "Alguns defendem atualizações frequentes para evitar softwares desatualizados e sem suporte, enquanto outros enfatizam a necessidade de estabilidade e edições LTS devido a restrições organizacionais.",
      "A discussão também inclui soluções alternativas, desafios de manutenção e operação contínua, gerenciamento de sistemas, diferentes abordagens para atualizações, execução do Kubernetes em diferentes plataformas e a importância da compatibilidade e do planejamento cuidadoso."
    ],
    "points": 199,
    "commentCount": 162,
    "retryCount": 0,
    "time": 1701694903
  }
]
