[
  {
    "id": 40906148,
    "title": "״הנדסה לאחור של הברקודים המסתובבים של Ticketmaster״",
    "originLink": "https://conduition.io/coding/ticketmaster/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40906148",
    "commentBody": "",
    "originSummary": [
      "TicketMaster's SafeTix משתמש במערכת ברקודים מסתובבים המוצגים באפליקציה ניידת, מה שמסבך את תהליך הכרטוס ומונע הדפסה או צילומי מסך בקלות.",
      "בעיות מתעוררות כאשר אין חיבור לאינטרנט במקום, מה שמקשה על טעינת הברקוד, והמערכת שואפת להפחית מכירת כרטיסים מחדש ולאסוף נתוני משתמשים.",
      "הנדסה לאחור מגלה שהברקודים משתמשים בפורמט PDF417 עם אסימון נושא ושני TOTPs, שניתן לחלץ באמצעות Chrome DevTools, מה שמאפשר שמירה לא מקוונת של כרטיסים עד 20 שעות לפני האירוע."
    ],
    "commentSummary": [
      "״הפוסט דן בהנדסה לאחור של הברקודים המסתובבים של Ticketmaster, ומדגיש את הפוטנציאל למכירת כרטיסים מצד שלישי ללא הונאה אם Ticketmaster ו-AXS יתעדו את הקריפטוגרפיה של קודי ה-QR שלהם ויחשפו אפליקציות/API לאימות.״",
      "השיחה מבקרת את המונופול של Ticketmaster על מכירת כרטיסים מחדש, ומציעה כי חוסר הרצון שלהם לתמוך באימות מצד שלישי מועיל לשליטתם בשוק.",
      "״הוויכוח מתרחב לשיקולים אתיים עבור מפתחים וחברות, כאשר יש הטוענים שמבנים חברתיים וכשלים ממשלתיים תורמים לפרקטיקות מונופוליסטיות, ולא המפתחים עצמם.״"
    ],
    "points": 565,
    "commentCount": 199,
    "retryCount": 0,
    "time": 1720451646
  },
  {
    "id": 40902012,
    "title": "סימולציה של 20 מיליון חלקיקים ב-JavaScript",
    "originLink": "https://dgerrells.com/blog/how-fast-is-javascript-simulating-20-000-000-particles",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40902012",
    "commentBody": "",
    "originSummary": [
      "המחבר בילה מספר חודשים בניסויים עם מאגרי מערכים משותפים, תכונה ב-JavaScript שמאפשרת למספר תהליכונים לשתף זיכרון ביעילות.",
      "״הם פיתחו יישום סופי המציג את הניסויים הללו ומזמינים משוב ורעיונות לסימולציות נוספות ב-JavaScript.״",
      "״הפוסט מדגיש את הפוטנציאל של מאגרי מערכים משותפים ליצירת סימולציות מורכבות ויעילות יותר בפיתוח אתרים.״"
    ],
    "commentSummary": [
      "מתכנת הצליח לדמות 20 מיליון חלקיקים באמצעות JavaScript, תוך ניצול מאגרי מערכים משותפים במשך מספר חודשים של זמן פנוי.",
      "הפוסט כולל הדגמה סופית של האפליקציה ומזמין הצעות לסימולציה של עוד יותר חלקיקים ב-JavaScript.",
      "״הקהילה סיפקה משוב מגוון, כולל הטמעת הסימולציה לגישה קלה יותר, אופטימיזציה של הביצועים ושימוש בטכנולוגיות שונות כמו WebGL ו-WebGPU לצורך רינדור.״"
    ],
    "points": 464,
    "commentCount": 61,
    "retryCount": 0,
    "time": 1720403574
  },
  {
    "id": 40902749,
    "title": "בואינג תודה באשמת הונאה פלילית הנובעת מהתרסקויות מטוסי 737 MAX",
    "originLink": "https://www.cnbc.com/2024/07/08/boeing-to-plead-guilty-to-criminal-fraud-charge-stemming-from-737-max-crashes.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40902749",
    "commentBody": "",
    "originSummary": [
      "בואינג תודה באשמת הונאה בקשר לקונספירציה הקשורה להתרסקויות של מטוסי 737 מקס, ותסכים לשלם קנס של 243.6 מיליון דולר ולהתקין מפקח ציות חיצוני.",
      "״העסקה, שנמנעת ממשפט, דורשת אישור של שופט פדרלי ויכולה להשפיע על יכולתה של בואינג למכור לממשלת ארה\"ב.״",
      "בואינג חייבת גם להשקיע 455 מיליון דולר בתוכניות ציות ובטיחות, ולגרום לדירקטוריון שלה להיפגש עם משפחות קורבנות ההתרסקות."
    ],
    "commentSummary": [
      "בואינג תודיע על הודאה באשמת הונאה פלילית בנוגע להתרסקויות ה-737 MAX, כאשר משפחות הקורבנות דורשות משפט פומבי לחשיפת כל העובדות.",
      "״הסדר הטיעון כולל קנס של 243.6 מיליון דולר ומפקח חיצוני לשלוש שנים, אך מבקרים טוענים שזה לא מספיק וקוראים לאחריות אישית.״",
      "״המקרה מדגיש בעיות מתמשכות עם אחריות תאגידית ומעלה שאלות לגבי היעילות של עונשים בשינוי תרבות החברה.״"
    ],
    "points": 456,
    "commentCount": 472,
    "retryCount": 0,
    "time": 1720415194
  },
  {
    "id": 40900648,
    "title": "״אני מממן את ליידיבירד כי אני לא יכול לממן את פיירפוקס״",
    "originLink": "http://jackkelly.name/blog/archives/2024/07/06/im_funding_ladybird_because_i_cant_fund_firefox/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40900648",
    "commentBody": "",
    "originSummary": [
      "מחבר מממן את יוזמת דפדפן Ladybird מכיוון שמוזילה אינה מאפשרת מימון ישיר של משתמשים עבור פיירפוקס.",
      "מגוון דפדפנים הוא חיוני כדי למנוע מכל ספק יחיד, כמו כרום, לשלוט בסטנדרטים של הרשת ולדחוף תכונות שפוגעות במשתמשים.",
      "ליידיבירד, במקור חלק מ-SerenityOS, הוא כעת פרויקט נפרד השואף לשחרור אלפא ראשון בשנת 2026 ופתוח למימון משתמשים."
    ],
    "commentSummary": [
      "מחבר מממן את Ladybird כי מוזילה מעדיפה פרסום מקוון על פני פיתוח Firefox, מה שהופך את מוזילה יותר לפרויקט תמיכה בפרסום.",
      "מעבר של מוזילה מקרן לתאגיד הפך אותה לתלויה בהכנסות מפרסום, במיוחד מגוגל, והיא אינה מקבלת תרומות המיועדות לפיתוח פיירפוקס.",
      "חלופות כמו מנוע הרינדור Servo ו-Ladybird, שמתכננת לעבור מ-C++ לשפה בטוחה יותר, מוצעות כראויות לתמיכה."
    ],
    "points": 255,
    "commentCount": 214,
    "retryCount": 0,
    "time": 1720388332
  },
  {
    "id": 40899761,
    "title": "האינטרנט כבר נגמר (2022)",
    "originLink": "https://samkriss.substack.com/p/the-internet-is-already-over",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40899761",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "״האינטרנט מתפתח בשל גורמים כמו פרסום, פוליטיקה ובינה מלאכותית, מה שמוביל לגרסאות מוגבלות ומצונזרות יותר.״",
      "יש ויכוח בין שמירה על שליטה באמצעות צנזורה לבין שמירה על הפוטנציאל של האינטרנט לתקשורת פתוחה.",
      "״המעבר מחללים ציבוריים לפורומים פרטיים כמו דיסקורד וסלאק מצביע על התרחקות מהאינטרנט הפתוח, אך קהילות נישה עדיין מציעות ערך.״"
    ],
    "points": 225,
    "commentCount": 223,
    "retryCount": 0,
    "time": 1720379876
  },
  {
    "id": 40902826,
    "title": "זד אדיטור מוריד אוטומטית בינאריים וחבילות NPM ללא הסכמה",
    "originLink": "https://old.reddit.com/r/programming/comments/1dxmroj/zed_editor_automatically_downloads_binaries_and/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40902826",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "זד אדיטור מוריד בינאריים וחבילות NPM ללא הסכמת המשתמש, מה שמעלה חששות בנוגע לאבטחה ולתקיפות בשרשרת האספקה.",
      "משתמשים משווים את זה ל-VSCode, שמבקש הרשאה, ומדגישים את הצורך בשליטה וביטחון של המשתמש ב-IDEs.",
      "זד וצוותו מכירים בבעיה ומתכננים לטפל בה, מה שמעורר דיון על איזון בין נוחות לאבטחה בכלי פיתוח."
    ],
    "points": 218,
    "commentCount": 156,
    "retryCount": 0,
    "time": 1720416369
  },
  {
    "id": 40902740,
    "title": "האם מגלשי סקי מתקהים?",
    "originLink": "https://brooker.co.za/misc-blog/2024/01/23/skis.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40902740",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "״מגלשי סקי יכולים להפוך לקהים, במיוחד כאשר משתמשים בהם על שלג קשה או קרחי, מה שהופך את החדות של הקצוות והזוויות הנכונות לקריטיות לביצועים.״",
      "תחזוקה שוטפת עם אבן יהלום בדרך כלל מספיקה אלא אם כן הסקי ניזוקו מאבנים או חלודה.",
      "בעוד שגולשי סקי בעלי נטייה טכנית יכולים להפיק תועלת מלמידת תחזוקת המגלשיים שלהם, רבים מוצאים שזה יותר מעשי לתת אותם לכיוון מקצועי, במיוחד אלו עם משפחות."
    ],
    "points": 218,
    "commentCount": 161,
    "retryCount": 0,
    "time": 1720415098
  },
  {
    "id": 40904862,
    "title": "Webflow בקוד פתוח עבור האפליקציה שלך",
    "originLink": "https://github.com/onlook-dev/studio",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40904862",
    "commentBody": "",
    "originSummary": [
      "סטודיו Onlook הציג אפליקציה שמאפשרת למפתחים לערוך באופן חזותי את יישומי React שרצים מקומית ולכתוב את הקוד בחזרה בזמן אמת.",
      "האפליקציה פועלת באופן מקומי, דורשת רק הוספת תוסף פשוט, וכוללת תכונות כמו מפרש React, מעבד מקדים, והמרת CSS ל-Tailwind.",
      "פיתוחים עתידיים כוללים בדיקה ובחירה של שכבות, סידור מחדש של אלמנטים, ובדיקת A/B של שינויים לפני התחייבות לקוד."
    ],
    "commentSummary": [
      "סטודיו Onlook מציג כלי קוד פתוח לעריכת אפליקציות React באופן מקומי, המבטיח למפתחים שמירה מלאה על בעלות הקוד.",
      "האפליקציה כוללת מפרש React, מעבד מקדים, והמרת CSS ל-Tailwind, פועלת כאפליקציית Electron לעדכוני קוד בזמן אמת.",
      "״תוכניות עתידיות כוללות תכונות הוכחת-קונספט כמו בדיקת שכבות ובדיקות A/B, עם אפשרות למונטיזציה דרך גרסה מתארחת לשיתוף פעולה צוותי.״"
    ],
    "points": 213,
    "commentCount": 47,
    "retryCount": 0,
    "time": 1720442170
  },
  {
    "id": 40901623,
    "title": "מסך מיני עבור פאי",
    "originLink": "https://noamzeise.com/2024/07/05/mini-monitor.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40901623",
    "commentBody": "",
    "originSummary": [
      "פוסט זה מפרט שימוש בתצוגה בגודל 2 אינץ' כמסך עבור Raspberry Pi, במטרה ליצור קונסולה ניידת עם מקלדת.",
      "צג המופעל על ידי בקר ST7789 ומחובר באמצעות SPI, צורך 2.5 מגה-בייט של זיכרון RAM וכ-2% מעבד, מה שמבטיח יעילות סוללה.",
      "כוללות הוראות ההתקנה חיווט, הפעלת SPI, הגדרת גודל framebuffer ותצוגת X, והתקנת תוכנת השיקוף כשירות מערכת."
    ],
    "commentSummary": [
      "פרויקט מיני מסך עבור Raspberry Pi זוכה לתשומת לב, עם דיונים על אופטימיזציה של חיבורי חומרה ואפשרויות תצוגה.",
      "משתמשים משתפים טיפים לשימוש בהדפסת תלת-ממד למארזים מותאמים אישית, עם הצעות לבדוק בספריות מקומיות או להשתמש בשירותי הדפסת תלת-ממד לתוצאות באיכות גבוהה.",
      "״נבדקות אפשרויות תצוגה ותצורות שונות, כולל שימוש במסכי טאבלט קטנים, תצוגות Waveshare, ויישום מנהלי התקנים נכונים לניהול זכויות דיגיטליות (DRM) בליבת המערכת לשיפור הביצועים.״"
    ],
    "points": 162,
    "commentCount": 50,
    "retryCount": 0,
    "time": 1720398478
  },
  {
    "id": 40903870,
    "title": "״Xpra: יישומים מרוחקים מתמשכים עבור X11״",
    "originLink": "https://github.com/Xpra-org/xpra",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40903870",
    "commentBody": "",
    "originSummary": [
      "״Xpra, כלי קוד פתוח, מאפשר להריץ תוכניות X11 על מארח מרוחק ולהציג אותן באופן מקומי, עם היכולת להתחבר מחדש מבלי לאבד מצב.״",
      "זה תומך בפלטפורמות שונות ומשלב תכונות כמו אודיו, מדפסות, לוח גזירים, מגשי מערכת, התראות ומצלמות רשת, תוך התאמה לתנאי רשת שונים.",
      "״ההתקנה זמינה עבור Windows, MacOS ו-Linux, עם תיעוד נרחב ותמיכה דרך שאלות נפוצות, דיונים ב-GitHub, IRC ו-Discord.״"
    ],
    "commentSummary": [
      "״Xpra הוא כלי ליישומים מרוחקים מתמשכים על X11, המאפשר למשתמשים לשמור על מצבי יישומים בין הפעלות.״",
      "דיון זה מדגיש פתרונות שונים לשולחן עבודה מרוחק, כולל Xpra, NoMachine, RustDesk ו-NICE DCV, כל אחד עם תכונות ייחודיות והעדפות משתמשים.",
      "״ישנו ויכוח מתמשך בין השימוש ב-X11 וב-Wayland, כאשר המשתמשים מציינים את היתרונות והחסרונות של כל אחד מהם, כולל תמיכה בחומרה, אבטחה, ונושאי תאימות.״"
    ],
    "points": 160,
    "commentCount": 87,
    "retryCount": 0,
    "time": 1720430147
  },
  {
    "id": 40905706,
    "title": "פעם ראשונה מזה יותר מ-150 שנה, החשמל באלברטה נקי מפחם",
    "originLink": "https://www.theglobeandmail.com/canada/alberta/article-for-the-first-time-in-more-than-150-years-albertas-electricity-is-coal/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40905706",
    "commentBody": "",
    "originSummary": [
      "תחנת הכוח האחרונה באלברטה, יחידה 2 בתחנת הכוח ג'נסי, הפסיקה לפעול ב-16 ביוני, מה שמסמן את סיום השימוש בפחם לייצור חשמל במחוז.",
      "״הפסקת השימוש בפחם הואצה תחת הנהגת המפלגה הדמוקרטית החדשה לאחר 2015, עם מדיניות כמו תמחור פחמן חזק יותר והתחייבות ל-30% אנרגיות מתחדשות עד 2030.״",
      "״למרות אבן הדרך, אתגרים כמו הצורך ביותר אנרגיה מרוח ושמש, פתרונות אחסון ותשתיות מעודכנות עדיין קיימים, במיוחד עם המורטוריום האחרון על אנרגיות מתחדשות באלברטה והמבנה מחדש של השוק.״"
    ],
    "commentSummary": [
      "אלברטה עברה להיות חופשית מפחם לראשונה מזה יותר מ-150 שנה, מה שמעורר ויכוח על העלויות והיתרונות של המהלך הזה.",
      "מבקרים מציינים שבעוד שאלברטה עברה לגז טבעי, הממשלה הנוכחית זוכה לביקורת על כך שאינה תומכת בהשקעות באנרגיה מתחדשת.",
      "״הדיון כולל השוואות עם מדינות כמו סין, אשר למרות העלייה בשימוש בפחם, משקיעה גם רבות באנרגיה מתחדשת ובאנרגיה גרעינית, מה שמדגיש את המורכבות הגלובלית של התמודדות עם משבר האקלים.״"
    ],
    "points": 158,
    "commentCount": 146,
    "retryCount": 0,
    "time": 1720448597
  },
  {
    "id": 40899778,
    "title": "ICANN's רשימת סיומות TLD אישיות שננטשו",
    "originLink": "https://www.icann.org/resources/pages/gtld-registry-agreement-termination-2015-10-09-en",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40899778",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "״ICANN (תאגיד האינטרנט להקצאת שמות ומספרים) פרסם רשימה של סיומות TLD (סיומות עליונות) נטושות, שהן סיומות דומיין מותאמות אישית כמו .brandname.״",
      "״הייתה נהירה משמעותית ל-gTLDs (דומיינים כלליים ברמה העליונה) בסוף שנות ה-2000, אך חברות רבות הבינו שהן לא זקוקות להם לאחר ששילמו עמלות גבוהות, כמו עמלת ההערכה של $185,000.״",
      "״רבים מה-TLDs הראוותניים כעת אינם בשימוש או ננטשו, מה שמדגיש את ההערכה המוגזמת הראשונית של ערכם ואת השינוי בשימוש באינטרנט לכיוון מנועי חיפוש ואפליקציות.״"
    ],
    "points": 124,
    "commentCount": 126,
    "retryCount": 0,
    "time": 1720380111
  },
  {
    "id": 40900029,
    "title": "Unit הוא מערכת תכנות חזותית למטרות כלליות",
    "originLink": "https://unit.software/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40900029",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Unit הוא מערכת תכנות חזותית רב-תכליתית המתמודדת עם בעיות קנה מידה קוגניטיביות וחיבורים מסובכים, מה שהופך את התכנות החזותי למאתגר.",
      "משתמשים מעריכים תכונות עיצוב מסוימות, כגון ווידג'טים ממוקדי משימות, אך משווים זאת לכלים כמו LabVIEW ו-OpenSCAD Graph Editor, ומדגישים הן את היתרונות והן את המגבלות.",
      "״דיונים מדגישים את הקושי בארגון קוד ויזואלי, את הצורך בשיפור חוויית המשתמש (UX), ואת הפוטנציאל של סביבות מחשוב מעורבות-מודלים.״"
    ],
    "points": 105,
    "commentCount": 56,
    "retryCount": 0,
    "time": 1720382302
  },
  {
    "id": 40902604,
    "title": "'זה כמו שציירתי דלת ונעלמתי דרכה' (2021)",
    "originLink": "https://meduza.io/en/feature/2021/04/01/it-s-like-i-drew-a-door-and-disappeared-through-it",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40902604",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "המאמר דן בירידה החמורה בתרומות לארגוני צדקה כמו נוכלז'קי בעקבות פלישה בקנה מידה מלא, מה שהוביל לכך שמארגנים רבים נאלצו לעזוב.",
      "המצב צפוי להחמיר לאחר השחרור בשל טיפול לקוי ב-PTSD, עלייה בשיעורי הפשיעה, ומיתון כלכלי.",
      "״המאמר מדגיש את ההשפעה העמוקה של חוסר בית ואת האתגרים העומדים בפני הנפגעים, תוך הדגשת החשיבות של אכיפת חוק וצדק הוגנים.״"
    ],
    "points": 102,
    "commentCount": 13,
    "retryCount": 0,
    "time": 1720412899
  },
  {
    "id": 40907155,
    "title": "״העקשנות הנכונה״",
    "originLink": "https://paulgraham.com/persistence.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40907155",
    "commentBody": "",
    "originSummary": [
      "עקשנות ועקשנות יתר כוללות שתיהן נחישות, אך הן נבדלות באופן מהותי בגישה ובתוצאה.",
      "״אנשים עקשנים מתאימים את האסטרטגיות שלהם על בסיס משוב, ומפגינים חוסן, שיקול דעת טוב ומיקוד במטרות.״",
      "״אנשים עקשנים נצמדים בעקשנות לרעיונותיהם הראשוניים, מה שלעיתים קרובות מוביל לכישלון, במיוחד במצבים מורכבים.״"
    ],
    "commentSummary": [
      "מאמרו של פול גרהם מבדיל בין אנשים עקשנים לאנשים מתמידים, ומציין כי אנשים עקשנים נראים בטוחים יותר אך פחות פתוחים למשוב, בעוד שאנשים מתמידים גמישים יותר ומוכנים ללמוד.",
      "״הציבור לעיתים קרובות מבלבל בין עקשנות לביטחון עצמי, במיוחד בפורומים ציבוריים, מה שמוביל לאי הבנות.״",
      "״המאמר גם חוקר את המושגים של חשיבה מתפתחת וחשיבה מקובעת, עם תגובות מעורבות מצד המגיבים שחלקם מסכימים עם דעותיו של גרהם ואחרים מוצאים את ההגדרות שלו פשטניות מדי או חופפות.״"
    ],
    "points": 100,
    "commentCount": 55,
    "retryCount": 0,
    "time": 1720458308
  }
]
