[
  {
    "id": 37703291,
    "title": "Preťahovateľné objekty",
    "originLink": "https://www.redblobgames.com/making-of/draggable/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37703291",
    "commentBody": "",
    "originSummary": [
      "Príspevok na blogu obsahuje návod, ako implementovať funkcie preťahovania pre interaktívne diagramy pomocou udalostí myši a dotyku, spolu s príkladmi kódu a vysvetleniami.",
      "Venuje sa bežným problémom, ako je zabránenie posúvaniu, kontextové ponuky a výber textu počas ťahania, a objasňuje testovanie kompatibility a obmedzenia súvisiace so vstupnými metódami.",
      "Samostatná diskusia o komponente Vue na preťahovanie prvkov SVG je k dispozícii spolu s príkladmi kódu a pokynmi na použitie."
    ],
    "commentSummary": [
      "Diskusné vlákno sa zaoberá najmä prekážkami a možnými riešeniami pri implementácii objektov s možnosťou preťahovania vo webovom dizajne vrátane výpočtu rozloženia a spracovania odľahlých hodnôt.",
      "Diskusia poukazuje na obmedzenia rozhrania HTML drag and drop API a naznačuje potrebu alternatívnych prostriedkov.",
      "Účastníci vlákna vysoko oceňujú webovú stránku Amita Patela, RedBlobGames, za jej prínosný obsah o vývoji hier, algoritmoch a umelej inteligencii a navrhujú ju ako tému budúcich diskusií na Hacker News."
    ],
    "points": 906,
    "commentCount": 107,
    "retryCount": 0,
    "time": 1695991882
  },
  {
    "id": 37702095,
    "title": "Všetko, čo overuje spoločnosť Microsoft, je skazené",
    "originLink": "https://graz.social/@publicvoit/111147782761723981",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37702095",
    "commentBody": "",
    "originSummary": [
      "V zhrnutí sa zdôrazňujú obavy týkajúce sa bezpečnosti spoločnosti Microsoft po nedávnom hackerskom útoku na cloud Azure vrátane potenciálnej zraniteľnosti služieb, ako je GitHub.",
      "Zdôrazňuje význam plánu pre prípad havárie a opatrení na zmiernenie jej následkov, najmä v prípade platforiem, ako je NixOS, ktoré sa vo veľkej miere spoliehajú na GitHub.",
      "Nakoniec upozorňuje na potrebu používateľsky prívetivých alternatív k službe GitHub a na širšiu otázku kontroly údajov v cloude, čo naznačuje, že sa očakáva rozšírenie potenciálnych útočníkov."
    ],
    "commentSummary": [
      "Účastníci fóra diskutujú o rôznych otázkach vrátane najnovšieho narušenia bezpečnosti spoločnosti Microsoft, úrovne dôvery v spoločnosť Microsoft a bezpečnostných postupov spoločnosti.",
      "Existujú obavy z rizík v oblasti cloud computingu, ochrany súkromia a bezpečnosti online, pričom účastníci sa podelili o rôzne pohľady na možné dôsledky a výzvy.",
      "Analyzujú sa aj témy ako bezpečnosť operačných systémov a vzťah medzi spotrebiteľmi a predajcami, čo naznačuje širšiu diskusiu o dynamike technologického trhu."
    ],
    "points": 736,
    "commentCount": 334,
    "retryCount": 0,
    "time": 1695986541
  },
  {
    "id": 37708292,
    "title": "RealFill: Doplnenie obrazu pomocou difúznych modelov",
    "originLink": "https://realfill.github.io/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37708292",
    "commentBody": "",
    "originSummary": [
      "RealFill, generatívny model, zlepšuje doplnenie obrazu vyplnením chýbajúcich oblastí obrazu vhodným obsahom pomocou modelu vyladeného na referenčných obrazoch.",
      "RealFill prekonáva iné metódy pri riešení náročných scenárov, ako sú rôzne uhly pohľadu, podmienky osvetlenia, nastavenia kamery a štýly obrazu, čím zlepšuje dokončenie obrazu.",
      "RealFill má však aj nevýhody vrátane nižšej operačnej rýchlosti a neschopnosti zvládnuť extrémne zmeny pohľadu."
    ],
    "commentSummary": [
      "Rozhovor sa točí predovšetkým okolo využívania umelej inteligencie na manipuláciu a vylepšovanie obrazu s aplikáciami v odvetviach, ako je fotografia, film a televízia.",
      "Spomínajú sa najmä pokroky spoločnosti Google v oblasti počítačovej fotografie a úpravy obrázkov, ako aj obavy týkajúce sa autenticity a etických otázok.",
      "Ľudia diskutujú o potenciáli upscalingu pomocou umelej inteligencie na zlepšenie kvality starších televíznych programov a o diskusii o správnej terminológii pre generované obrázky."
    ],
    "points": 511,
    "commentCount": 169,
    "retryCount": 0,
    "time": 1696012075
  },
  {
    "id": 37706302,
    "title": "Facebook/Meta blokuje účty za zverejnenie odkazu na tipy EFF o ochrane súkromia",
    "originLink": "https://techhub.social/@kirbstr/111148950526108155",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37706302",
    "commentBody": "",
    "originSummary": [
      "Používateľ @kirbstr upozornil na Facebooku na prítomnosť obmedzení pri pokuse o zdieľanie odkazu na odhlásenie, ktoré pôvodne spomenul vo vlákne @pluralistic.",
      "Mnohí používatelia Facebooku vyjadrili obavy týkajúce sa kontroly Facebooku nad šírením informácií a spochybnili zákonnosť týchto obmedzení.",
      "Používateľ @RealGene potvrdil, že príslušný odkaz pomáha vypnúť funkciu sledovania reklamy \"Privacy Sandbox\" spoločnosti Google."
    ],
    "commentSummary": [
      "Facebook/Meta zakázal účty za šírenie odkazu na tipy o ochrane súkromia od Electronic Frontier Foundation, čo vyvolalo obavy z nesprávneho blokovania a potreby kontroly online moderovania.",
      "Podujatie podnietilo diskusiu o kontroverziách týkajúcich sa ochrany súkromia na Facebooku, metódach mediácie a podiele sociálnych médií na podnecovaní kultúry pohoršenia.",
      "Používatelia na portáli Hacker News uznali nedostatky v algoritmoch moderovania obsahu a vyjadrili obavy z taktiky Facebooku v oblasti ochrany súkromia."
    ],
    "points": 362,
    "commentCount": 86,
    "retryCount": 0,
    "time": 1696003863
  },
  {
    "id": 37705368,
    "title": "Pranie súkromia: Google tvrdí, že podporuje súkromie, a zároveň lobuje proti nemu",
    "originLink": "https://proton.me/blog/google-lobbying",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37705368",
    "commentBody": "",
    "originSummary": [
      "Spoločnosť Google je obviňovaná z \"vymývania súkromia\", t. j. presadzovania ochrany súkromia, ale lobovania proti právnym predpisom zameraným na ochranu používateľov pred online dohľadom.",
      "Lobistické úsilie spoločnosti Google zamerané na zastavenie oficiálnej regulácie využívania údajov sa rozprestieralo po celom svete a stálo milióny. Tvrdí, že kontrolu nad rozhodnutiami o údajoch majú mať spoločnosti, a nie jednotlivci.",
      "Spoločnosť sa údajne pokúsila oslabiť zákony o ochrane osobných údajov v regiónoch, ako je Kalifornia a Európa, a v súčasnosti sa snaží do obchodnej dohody zahrnúť klauzulu, ktorá by členským krajinám obmedzovala prijímanie zákonov o ochrane osobných údajov."
    ],
    "commentSummary": [
      "Zameriava sa predovšetkým na postupy spoločnosti Google v oblasti ochrany osobných údajov, cielenú reklamu a aktívne lobovanie proti právnym predpisom o ochrane osobných údajov, pričom uvádza kritiku aj podporu.",
      "Diskurz zahŕňa diskusie o etických aspektoch cielených reklám a marketingu, o úlohe kapitalizmu v týchto praktikách a o manipulatívnych technikách často spojených s reklamou.",
      "Vyjadrujú sa obavy z potenciálneho monopolu spoločnosti Google, z neexistencie úplného súkromia v digitálnej oblasti a zo zjavného nedostatku nadšenia zo strany zákonodarcov pri presadzovaní ochrany súkromia."
    ],
    "points": 355,
    "commentCount": 163,
    "retryCount": 0,
    "time": 1696000074
  },
  {
    "id": 37704760,
    "title": "Stolová spoločenská hra RISC-V (hacknite svojho súpera)",
    "originLink": "https://punkx.org/overflow/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37704760",
    "commentBody": "",
    "originSummary": [
      "Autorka vytvorila hru na výučbu svojej dcéry o pretečení buffera a na podporu experimentovania s programami.",
      "Hra inšpirovaná článkom \"Smashing the Stack for Fun and Profit\" si vyžaduje objavovanie rôznych exploitov, učenie sa z chýb a radosť zo spolupráce.",
      "Autor sa zmienil o vytvorení pomocníka ESP32 pre kolaboratívnu hru a zároveň zvažuje možnosť použitia webovej verzie."
    ],
    "commentSummary": [
      "Programátor navrhol stolnú spoločenskú hru, aby svoju dcéru poučil o pretečení vyrovnávacej pamäte a o vzrušujúcej manipulácii s počítačovými programami.",
      "Hra založená na assembleri RISC-V umožňuje hráčom využívať zraniteľnosti a \"hackovať\" súperov, čím sa snaží obnoviť praktické skúmanie starších počítačových systémov.",
      "Stolová hra získala pozitívnu spätnú väzbu a je považovaná za vhodnú pre osoby od 10 rokov s nádejou, že inšpiruje novú generáciu hackerov."
    ],
    "points": 298,
    "commentCount": 34,
    "retryCount": 0,
    "time": 1695997535
  },
  {
    "id": 37707119,
    "title": "Testoval som adaptér HDMI, ktorý vyžaduje vašu polohu a rozosiela reklamy",
    "originLink": "https://www.404media.co/i-tested-an-hdmi-adapter-that-demands-your-location-browsing-data-photos-and-spams-you-with-ads/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37707119",
    "commentBody": "",
    "originSummary": [
      "Nezávislá technologická stránka 404 Media zverejnila vyšetrovanie adaptéra HDMI, ktorý sa vydáva za produkt spoločnosti Apple a ktorý tajne zhromažďuje údaje používateľov a poskytuje reklamy.",
      "Adaptér vyzýva používateľov, aby si stiahli aplikáciu prostredníctvom kódu QR, čím získajú prístup k osobným údajom, ktoré sa potom zdieľajú s inzerentmi a posielajú do Číny.",
      "Odhalenia zdôrazňujú pretrvávajúce obavy o ochranu súkromia v súvislosti so spotrebnou elektronikou a upriamujú pozornosť na úlohu spoločnosti Amazon pri predaji takýchto produktov v súvislosti so žalobou FTC proti spoločnosti za umiestňovanie nevyžiadaných reklám."
    ],
    "commentSummary": [],
    "points": 244,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1696007145
  },
  {
    "id": 37706596,
    "title": "Ako funguje štvordňový pracovný týždeň podľa spoločností, ktoré ho zaviedli",
    "originLink": "https://www.wsj.com/lifestyle/careers/how-a-4-day-workweek-actually-works-from-the-companies-pulling-it-off-1a5c0e2a",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37706596",
    "commentBody": "",
    "originSummary": [
      "Viac podnikov skúša štvordňové pracovné týždne, pričom zamestnanci hlásia zvýšenie produktivity a lepšiu rovnováhu medzi pracovným a súkromným životom.",
      "Spoločnosti, ako napríklad ThredUp, zefektívnili kratší týždeň tým, že obmedzili stretnutia a zamerali sa na dôležitú prácu. Niektoré firmy však nezaznamenali zvýšenú efektivitu, najmä väčšie firmy s celosvetovou pôsobnosťou, ktoré môžu mať problémy s nájdením jednotného harmonogramu.",
      "Napriek týmto výzvam pretrváva príťažlivosť kratších pracovných týždňov a niektorí štátni zákonodarcovia predkladajú návrhy zákonov, aby presvedčili viac podnikov, aby prijali tento štvordňový program."
    ],
    "commentSummary": [
      "Zbierka analyzuje výhody a potenciálne nevýhody štvordňového pracovného týždňa a uvádza argumenty, podľa ktorých by mohol zvýšiť produktivitu, rovnováhu medzi pracovným a súkromným životom a duševnú pohodu.",
      "Niektorí však vyjadrujú výhrady k jeho praktickej realizovateľnosti a pravdepodobnému vplyvu na produktivitu.",
      "Diskurz zahŕňa otázky, ako je prerušenie práce, nahraditeľnosť práce a význam individuálnych zručností, a uzatvára sa rôznymi názormi na zavedenie kratšieho pracovného týždňa a nevyhnutnosťou zmeny pracovnej kultúry a efektívnosti pred jeho prijatím."
    ],
    "points": 238,
    "commentCount": 235,
    "retryCount": 0,
    "time": 1696005052
  },
  {
    "id": 37702059,
    "title": "Vizuálny graf uzlov pomocou ImGui",
    "originLink": "https://gboisse.github.io/posts/node-graph/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37702059",
    "commentBody": "",
    "originSummary": [
      "Autor podrobne opisuje vytvorenie systému uzlových grafov pre \"RogueEngine\", grafický engine, ktorý vytvoril s cieľom vytvoriť ľahko použiteľné rozhranie na interakciu obsahu, editáciu a spoluprácu medzi umelcom a dizajnérom.",
      "Systém obsahuje len dve kategórie uzlov, koreňový uzol, dátový uzol a uzol komponentov, pričom sa inšpiruje softvérom ako Blender, Notch a Godot.",
      "Implementácia bola dosiahnutá prostredníctvom aplikácie Dear ImGui pre používateľské rozhranie, oddelením dátových modelov od kódu grafického rozhrania a poskytnutím vlastností kľúčových snímok a uzlov kódu na zvýšenie poddajnosti."
    ],
    "commentSummary": [
      "Článok sa venuje téme vizuálneho programovania, konkrétne systému vizuálnych grafov uzlov a rôznym súvisiacim nástrojom a knižniciam.",
      "Prebieha živá diskusia o výhodách a nevýhodách vizuálneho programovania, pričom sa poukazuje na problémy, ako je náročnosť reprezentácie algoritmov a problémy s čitateľnosťou a štruktúrou.",
      "Príspevok potvrdzuje účinnosť knižnice imgui v hernom priemysle a upozorňuje na dôležitosť štandardizovaných nástrojov v textovom programovaní."
    ],
    "points": 237,
    "commentCount": 78,
    "retryCount": 0,
    "time": 1695986300
  },
  {
    "id": 37706893,
    "title": "Je dvojfázové blokovanie po 50 rokoch to najlepšie, čo môžeme urobiť?",
    "originLink": "http://concurrencyfreaks.blogspot.com/2023/09/50-years-later-is-two-phase-locking.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37706893",
    "commentBody": "",
    "originSummary": [
      "V článku sa analyzujú nedostatky algoritmu dvojfázového uzamykania (2PL) na riadenie súbežnosti databáz vrátane slabej škálovateľnosti a priebehu živého uzamykania.",
      "Navrhuje pokročilú verziu, Two-Phase Locking Starvation-Free (2PLSF), ktorá je navrhnutá na riešenie týchto obmedzení pomocou škálovateľných indikátorov čítania.",
      "Článok sa zaoberá vývojom a výzvami 2PL a predstavuje 2PLSF ako lepšiu alternatívu pre riadenie súbežnosti v databázach."
    ],
    "commentSummary": [
      "Článok hodnotí obmedzenia prístupu dvojfázového uzamykania (2PL) v distribuovaných systémoch a navrhuje alternatívne metódy - konkrétne Raft a serializovateľnú izoláciu snímok - na dosiahnutie konzistencie v distribuovanej architektúre mikroslužieb.",
      "Venuje sa využívaniu rôznych mechanizmov a protokolov, ako sú ULID na identifikáciu, TL2 a 2PL na riadenie súbežnosti a Paxos a Raft na konsenzus v distribuovaných transakciách.",
      "V závere článku sa poukazuje na ťažkosti s komunikáciou v distribuovaných systémoch v dôsledku nespoľahlivých sietí a na používanie protokolov podobných Calvinovmu protokolu v systémoch s viacerými replikátormi."
    ],
    "points": 226,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1696006292
  },
  {
    "id": 37709284,
    "title": "Meta v Mjanmarsku",
    "originLink": "https://erinkissane.com/meta-in-myanmar-part-i-the-setup",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37709284",
    "commentBody": "",
    "originSummary": [
      "Toto zhrnutie poukazuje na príspevok spoločnosti Meta (predtým známej ako Facebook) k šíreniu nenávistných prejavov a násilia voči Rohingom v Mjanmarsku, kde sa táto platforma stala dominantnou.",
      "Napriek opakovaným varovaniam aktivistov a odborníkov článok zdôrazňuje, že spoločnosť Facebook tento problém nerieši.",
      "Príspevok naznačuje významný vzťah medzi úlohou hlavných platforiem sociálnych médií a násilím v reálnom svete a vyvoláva otázky týkajúce sa ich zodpovednosti."
    ],
    "commentSummary": [
      "Konverzácia sa zameriava na úlohu Facebooku pri šírení nenávistných prejavov a podpore násilia v Mjanmarsku, konkrétne proti menšine Rohingov.",
      "Algoritmy Facebooku a nedostatočné moderovanie obsahu sú kritizované za to, že umožňujú šírenie škodlivého obsahu, ktorý vedie k úmrtiam a vysídleniu.",
      "Dialóg sa týka morálnej zodpovednosti Facebooku, prekážok pri moderovaní obsahu a širšej problematiky regulácie prejavov na platformách sociálnych médií."
    ],
    "points": 217,
    "commentCount": 106,
    "retryCount": 0,
    "time": 1696017061
  },
  {
    "id": 37704859,
    "title": "Nórsko chce zakázať behaviorálnu reklamu na Facebooku v celej Európe",
    "originLink": "https://www.theregister.com/2023/09/29/norway_facebook_behavioral_ads/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37704859",
    "commentBody": "",
    "originSummary": [
      "Nórsko sa zasadzuje za trvalý celoeurópsky zákaz spoločnosti Meta (predtým Facebook) používať údaje používateľov na behaviorálnu reklamu na Facebooku a Instagrame.",
      "Zákaz iniciovaný z dôvodu nedodržiavania predpisov o ochrane údajov spoločnosťou Meta a zhromažďovania chránených údajov narazil na odpor, keďže spoločnosť Meta tvrdí, že už má súhlas používateľov na cielenú reklamu.",
      "Zatiaľ čo Spojené kráľovstvo nie je do tejto problematiky zahrnuté kvôli vlastnému zákonu o ochrane údajov, nórsky úrad na ochranu údajov chce, aby sa GDPR vykladalo jednotne v celej EÚ/EHP."
    ],
    "commentSummary": [
      "Nórsko presadzuje zákaz behaviorálnej reklamy na Facebooku v Európe, čo vyvolalo diskusiu o negatívnych vplyvoch reklám a ich nevyhnutnosti.",
      "Diskusia sa dotýka etických aspektov reklamy, vládnej regulácie a úlohy reklamy v kapitalizme vrátane obáv z psychologických techník v reklamách a ich vplyvu na obraz tela.",
      "Používatelia Redditu diskutujú o prideľovaní zdrojov v technologickom a marketingovom sektore, vyjadrujú roztrpčenie nad nadmerným množstvom funkcií telefónu a manipulatívnym marketingom, ako aj nad vplyvom online reklamy na súkromie a malé podniky."
    ],
    "points": 217,
    "commentCount": 152,
    "retryCount": 0,
    "time": 1695997897
  },
  {
    "id": 37702632,
    "title": "Architektúra MMO: Zdroj pravdy, dátové toky, úzke miesta I/O a ich riešenie",
    "originLink": "https://prdeving.wordpress.com/2023/09/29/mmo-architecture-source-of-truth-dataflows-i-o-bottlenecks-and-how-to-solve-them/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37702632",
    "commentBody": "",
    "originSummary": [
      "V článku sa dôkladne rozoberajú zložitosti návrhu a architektúry spojené s hrami MMO (Massively Multiplayer Online), pričom sa zdôrazňuje náročnosť správy vstupov a výstupov (I/O) a prekonávania úzkych miest I/O.",
      "Autor zdôrazňuje význam stavu sveta v pamäti, ktorý je zdrojom pravdy, a nie databázy v hrách MMO, a predstavuje vzor sprostredkovateľa údajov, ktorý pomáha udržiavať stav sveta v pamäti a umožňuje herným službám s ním komunikovať prostredníctvom RPC (Remote Procedure Call).",
      "V článku sa zdôrazňuje potreba strategického plánovania a analýzy na zefektívnenie dátových tokov, pričom sa diskutuje o kritických aspektoch, ako je vytrvalosť údajov, škálovateľnosť a použitie inštrukcií CAS (Compare-and-swap) na zabránenie pretekov s cieľom zvýšiť výkon systému."
    ],
    "commentSummary": [
      "Tento príspevok sa zaoberá zložitosťou návrhu architektúry pre masovo multiplayerové online hry (MMO), ako je napríklad synchronizácia, ukladanie do vyrovnávacej pamäte, optimalizácia a správa stavu.",
      "Ukazuje vývoj fanúšikovskej MMO hry FOnline, potenciál súkromných serverov ako Trinitycore pre hry ako World of Warcraft a technické aspekty prevádzky súkromných serverov.",
      "Príspevok tiež poskytuje zdroje a rady pre návrh architektúry MMO a zaoberá sa výzvami, ako je získavanie hráčov, rozhodovanie a optimalizácia."
    ],
    "points": 205,
    "commentCount": 61,
    "retryCount": 0,
    "time": 1695989344
  },
  {
    "id": 37703885,
    "title": "Šifrovaný klient Hello",
    "originLink": "https://blog.cloudflare.com/announcing-encrypted-client-hello/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37703885",
    "commentBody": "",
    "originSummary": [
      "Spoločnosť Cloudflare navrhla nový štandard Encrypted Client Hello (ECH), ktorý má posilniť súkromie používateľov tým, že zabráni sieťam zistiť, aké webové stránky používateľ navštevuje.",
      "ECH ukrýva označenie názvu servera (SNI), ktoré je súčasťou procesu podania protokolu TLS, čím zabezpečuje, že sledovanie aktivity používateľa je obmedzené na používateľa, spoločnosť Cloudflare a vlastníka webu.",
      "Spoločnosť Cloudflare zaviedla ECH vo všetkých svojich plánoch a zasadzuje sa za jeho širšie prijatie s cieľom posilniť ochranu súkromia na internete."
    ],
    "commentSummary": [
      "Diskusia sa točí okolo integrácie a účinkov šifrovaného klientskeho hlásenia (ECH) v protokoloch TLS (Transport Layer Security), pričom sa zdôrazňujú obavy z vládnych zásahov a hrozby kvantových počítačov pre šifrovanie.",
      "Účastníci diskutujú o dôsledkoch zamedzenia prístupu k doméne, o neschopnosti ECH brániť analýze prevádzky a o témach, ako sú cenzúra, bezpečnosť siete, virtuálne súkromné siete (VPN) a DNS cez HTTPS (DoH).",
      "Hlavný dôraz sa kladie na súkromie a kontrolu internetu, pričom názory na optimálny plán na dosiahnutie týchto cieľov sa líšia."
    ],
    "points": 189,
    "commentCount": 172,
    "retryCount": 0,
    "time": 1695994020
  },
  {
    "id": 37710683,
    "title": "Vlaky na inej úrovni",
    "originLink": "https://factorio.com/blog/post/fff-378",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37710683",
    "commentBody": "",
    "originSummary": [
      "Najnovšia aktualizácia hry Factorio zavádza vyvýšené koľajnice, ktorých cieľom je zlepšiť priepustnosť vlakov vo väčších továrňach a zlepšiť hrateľnosť.",
      "Aktualizácia obsahuje koľajnicové rampy, vyvýšené koľajnice, podpery koľajníc a ploty. Vývoj tejto grafiky trval približne deväť mesiacov.",
      "Zvýšené koľajnice, ktoré sú prístupné len s rozširujúcim spustiteľným programom, možno skúmať pomocou vedeckých balíkov Production. Táto funkcia bude spustená aj ako samostatný oficiálny mód. Vývojári uvítajú spätnú väzbu na novú funkciu."
    ],
    "commentSummary": [
      "Nová aktualizácia hry Factorio vyvolala medzi hráčmi rôzne názory, niektorí sa z vylepšení tešia, iní vyjadrujú obavy.",
      "Diskusie sa točia okolo návykovej povahy hry, potenciálnej konkurencie zo strany podobných hier a pozitívnych reakcií na pripravovanú hru zameranú na vlaky.",
      "Popri kritike niektorých prvkov hry Factorio sa komentátori delia o svoje nadšenie z rozšírenia hry, ponúkajú návrhy na podobné herné zážitky a diskutujú o stratégiách prieskumu a hľadania zdrojov v hre."
    ],
    "points": 176,
    "commentCount": 87,
    "retryCount": 0,
    "time": 1696025336
  },
  {
    "id": 37708582,
    "title": "Insomnium - Miestne rozvetvenie klienta API Insomnia zamerané na ochranu súkromia",
    "originLink": "https://github.com/ArchGPT/insomnium",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37708582",
    "commentBody": "",
    "originSummary": [
      "Insomnium, odnož klienta API Insomnia, je open-source aplikácia zameraná na ochranu súkromia, ktorá podporuje technológie ako GraphQL, REST, WebSockets, udalosti odosielané serverom a gRPC.",
      "Spoločnosť Insomnium vznikla ako odpor voči aktualizácii produktu, ktorá vyžadovala povinné prihlásenie do účtu. Odstraňuje prihlasovanie používateľov, sledovanie a analýzu s cieľom optimalizovať rýchlosť aplikácie.",
      "Softvér je kompatibilný so systémami Mac, Windows a Linux a umožňuje vývoj na ktorejkoľvek z týchto platforiem pomocou Node.js a Git. V štádiu vývoja je zásuvný modul s názvom Code Llama, ktorý umožňuje lepšie prispôsobenie a rozšírenie. Projekt sa riadi licenciou MIT."
    ],
    "commentSummary": [
      "Insomnium je fork klienta API Insomnia zameraný na ochranu súkromia, ktorý vznikol v dôsledku obáv zo spracovania údajov používateľov pôvodným klientom, čo viedlo k odporu komunity.",
      "Boli spomenuté alternatívy k Insomnii, ako Restfox, Bruno, ezy, Step CI a Hurl. Niektorí používatelia odporúčali aj Thunder, REST Client v JetBrains IDE a restclient.el pre Emacs.",
      "Medzi kritické pripomienky patrí hlad po údajoch a účtoch v klientoch HTTP, ako aj nedostatok nástrojov na tímovú spoluprácu. Bola tiež navrhnutá požiadavka na funkciu klientov HTTP na generovanie príkazov curl a úryvkov kódu."
    ],
    "points": 173,
    "commentCount": 34,
    "retryCount": 0,
    "time": 1696013356
  },
  {
    "id": 37704537,
    "title": "Jamboard Google za 5k dolárov zomrie v roku 2024 - prestanú fungovať aj cloudové aplikácie",
    "originLink": "https://arstechnica.com/gadgets/2023/09/5000-google-jamboard-dies-in-2024-cloud-based-apps-will-stop-working-too/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37704537",
    "commentBody": "",
    "originSummary": [
      "Spoločnosť Google odhalila plány na ukončenie prevádzky digitálnej tabule Google Jamboard do konca roka 2024 vrátane podpory súvisiacich cloudových aplikácií.",
      "Existujúci používatelia budú mať možnosť preniesť svoje údaje do konkurenčných aplikácií na tabule a tí, ktorí potrebujú podobný produkt, si budú musieť kúpiť novú dotykovú obrazovku.",
      "Toto rozhodnutie je v súlade so zámerom spoločnosti Google opustiť trh s bielymi tabuľami a posilniť svoj partnerský ekosystém pre biele tabule v rámci služby Google Workspace, pretože dopyt nie je dostatočný na to, aby si spoločnosť Jamboard udržala napriek vyššej cene a dodatočným nákladom."
    ],
    "commentSummary": [
      "Predpokladá sa, že interaktívna tabuľa Google Jamboard za 5 tisíc dolárov a s ňou spojené cloudové aplikácie budú do roku 2024 zastarané.",
      "Toto oznámenie vyvolalo diskusie na rôznych platformách, čo podčiarkuje jeho význam pre celé odvetvie.",
      "V rámci týchto diskusií sú uvedené odkazy na ďalšie čítanie, ktoré vyzývajú používateľov, aby sa zapojili a získali úplnejšie pochopenie situácie."
    ],
    "points": 169,
    "commentCount": 3,
    "retryCount": 0,
    "time": 1695996664
  },
  {
    "id": 37705328,
    "title": "Vytvorenie hudobnej knižnice bez SPA",
    "originLink": "https://begin.com/blog/posts/2023-09-28-introducing-enhance-music",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37705328",
    "commentBody": "",
    "originSummary": [
      "Tím Enhance vyvinul aplikáciu Enhance Music, zvukový prehrávač vytvorený pomocou HTML, CSS a minimálneho množstva JavaScriptu, aby demonštroval potenciál interaktívnych rozhraní bez závislosti od knižníc alebo rámcov JavaScriptu.",
      "Tím podrobne rozpracoval štruktúru aplikácie, postupné vylepšovanie a funkcie, ako sú aktualizácie vlastností a vizualizácia priebehu, na základe prvkov HTMLMediaElement a webových komponentov, pričom sa zaoberal aj faktormi, ako sú webové štandardy, výkon a prístupnosť.",
      "Ukázali tiež, ako sa vysporiadali s atribútmi prístupnosti a obmedzeniami, ako je napríklad problém s automatickým prehrávaním v prehliadači Safari; vyzvali čitateľov, aby preskúmali zdrojový kód, a na záver priznali autorské práva a pôvod obsahu."
    ],
    "commentSummary": [
      "V tomto vlákne sa diskutuje o vytváraní hudobných knižníc bez použitia jednostránkových aplikácií (SPA), pričom účastníci vyjadrujú obavy z pomalšieho načítavania, obmedzených funkcií používateľského prostredia, ťažkostí s navigáciou a závislosti od jazyka JavaScript.",
      "O používaní JavaScriptu pri vývoji webových stránok sa vedú diskusie, pričom niektorí sa snažia o väčšiu funkčnosť v jazyku HTML, zatiaľ čo iní vyjadrujú obavy z problémov pri udržiavaní kódových báz s veľkými stromami závislostí.",
      "Časť používateľov diskutuje o alternatívnych možnostiach, ako je používanie súborov rámcov namiesto SPA a potenciálne použitie iframe na dynamickú výmenu komponentov v prehrávačoch hudby. Názory na výhody a nevýhody hudobných knižníc bez SPA sa medzi účastníkmi líšia."
    ],
    "points": 151,
    "commentCount": 58,
    "retryCount": 0,
    "time": 1695999853
  },
  {
    "id": 37709876,
    "title": "Na sovietsky počítač sa zabudlo na 30 rokov [video]",
    "originLink": "https://www.youtube.com/watch?v=lVCS99Zep9w",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37709876",
    "commentBody": "",
    "originSummary": [
      "Moderátori série videí obnovujú a predvádzajú počítač zo sovietskej éry, ktorý sa našiel v černobyľskej ochrannej zóne, a diskutujú o jeho jedinečných vlastnostiach a funkčnosti.",
      "Uvádzajú výzvy, ktorým čelili počas procesu obnovy, oceňujú pomoc komunity retro počítačov a prezentujú staré softvérové aplikácie a hry na ukrajinskom počítači.",
      "Okrem technického skúmania sa podelia aj o osobné zážitky a možno prisľúbia bonusové video o historickom artefakte, ktorý vyzdvihuje širšie historické súvislosti. Na záver zaangažujú svoje publikum štandardnou výzvou na akciu na YouTube - žiadosťou o lajky a odbery."
    ],
    "commentSummary": [
      "Článok pripomína historický sovietsky počítač ES-1841, zdôrazňuje jeho využitie na hranie a kódovanie a venuje sa aj ďalším retro hrám.",
      "Venuje sa významnému vplyvu kybernetiky na sovietsku informatiku, pričom sa dotýka rôznych aspektov histórie sovietskej informatiky.",
      "Diskusia sa rozširuje o historickú výpočtovú techniku, konektory v starších počítačoch a hru Digger, pričom sa naznačuje možnosť prevádzkovania iPhonu na takýchto systémoch v budúcnosti."
    ],
    "points": 142,
    "commentCount": 56,
    "retryCount": 0,
    "time": 1696020242
  },
  {
    "id": 37705563,
    "title": "Spoluzakladateľ spoločnosti Three Arrows Capital Zhu zatknutý na letisku v Singapure",
    "originLink": "https://techcrunch.com/2023/09/29/three-arrows-capital-co-founder-zhu-arrested-in-singapore-airport-sentenced-four-months-in-prison/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37705563",
    "commentBody": "",
    "originSummary": [
      "Su Zhu, spoluzakladateľ spoločnosti Three Arrows Capital (3AC), bol v Singapure zatknutý a odsúdený na štyri mesiace odňatia slobody za nedodržanie súdnych príkazov v súvislosti s vyšetrovaním likvidácie zaniknutého krypto hedžového fondu.",
      "Tento vývoj nasleduje po vyhlásení konkurzu spoločnosti 3AC v roku 2022.",
      "Miesto pobytu druhého spoluzakladateľa, Kylea Daviesa, je v súčasnosti neznáme."
    ],
    "commentSummary": [
      "V článku sa rozoberajú rôzne aspekty kryptomien, napríklad dôsledky zatknutia spoluzakladateľa kapitálovej spoločnosti a hodnotový potenciál stablecoinov.",
      "Zdôrazňuje zraniteľnosť Bitcoinu, rôzne prípady použitia kryptomien a odkazuje na historický scenár vojnového zajateckého tábora.",
      "V článku sa poukazuje na potrebu zvýšenej kontroly v kryptografickom odvetví a zdôrazňuje sa, že názory na budúce vyhliadky a realizovateľnosť kryptomien sa rôznia."
    ],
    "points": 141,
    "commentCount": 120,
    "retryCount": 0,
    "time": 1696000900
  }
]
