[
  {
    "id": 37703291,
    "title": "Draggable objektumok",
    "originLink": "https://www.redblobgames.com/making-of/draggable/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37703291",
    "commentBody": "",
    "originSummary": [
      "A blogbejegyzés útmutatót ad arról, hogyan lehet az egér- és érintéses események felhasználásával húzható funkciókat megvalósítani interaktív diagramokhoz, kódpéldákkal és magyarázatokkal kiegészítve.",
      "Olyan gyakori problémákkal foglalkozik, mint a görgetés, a kontextusmenü és a szövegkiválasztás megakadályozása húzás közben, valamint rávilágít a kompatibilitás tesztelésére és a beviteli módszerekkel kapcsolatos korlátozásokra.",
      "Az SVG-elemek húzására szolgáló Vue-komponensről külön tárgyalást tartunk, a kódpéldákkal és a használati utasításokkal együtt."
    ],
    "commentSummary": [
      "A vitafolyamat elsősorban a húzható objektumok webes tervezésben való megvalósításának akadályaival és lehetséges megoldásaival foglalkozik, beleértve az elrendezések kiszámítását és a kiugró értékek kezelését.",
      "A vita rávilágít a HTML drag and drop API korlátaira, és alternatív eszközök szükségességét sugallja.",
      "A résztvevők nagyra értékelik Amit Patel RedBlobGames nevű weboldalát a játékfejlesztéssel, algoritmusokkal és mesterséges intelligenciával kapcsolatos hasznos tartalma miatt, és a Hacker News jövőbeli vitáinak témájaként javasolják."
    ],
    "points": 906,
    "commentCount": 107,
    "retryCount": 0,
    "time": 1695991882
  },
  {
    "id": 37702095,
    "title": "Minden, amit a Microsoft hitelesített, szennyezett",
    "originLink": "https://graz.social/@publicvoit/111147782761723981",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37702095",
    "commentBody": "",
    "originSummary": [
      "Az összefoglaló rávilágít a Microsoft biztonságával kapcsolatos aggodalmakra a közelmúltban történt Azure felhő hackelés után, beleértve a GitHubhoz hasonló szolgáltatások potenciális sebezhetőségét.",
      "Hangsúlyozza a katasztrófaelhárítási terv és az enyhítő intézkedések fontosságát, különösen az olyan platformok esetében, mint a NixOS, amelyek nagymértékben támaszkodnak a GitHubra.",
      "Végül felveti a GitHub felhasználóbarát alternatíváinak szükségességét, valamint az adatok felhőn belüli ellenőrzésének nagyobb kérdését, jelezve a potenciális támadók bővülésének előrejelzését."
    ],
    "commentSummary": [
      "A fórum résztvevői különböző témákat vitatnak meg, többek között a Microsoft legutóbbi biztonsági réséről, a Microsoftba vetett bizalom mértékéről és a vállalat biztonsági gyakorlatáról.",
      "Aggályok merültek fel a felhőalapú számítástechnika, a magánélet és az online biztonság kockázataival kapcsolatban, a résztvevők pedig különböző nézőpontokat osztottak meg a lehetséges következményekkel és kihívásokkal kapcsolatban.",
      "Olyan témákat is elemeznek, mint az operációs rendszerek biztonsága, valamint a fogyasztók és a gyártók közötti kapcsolat, ami a technológiai piac dinamikájának szélesebb körű megvitatására utal."
    ],
    "points": 736,
    "commentCount": 334,
    "retryCount": 0,
    "time": 1695986541
  },
  {
    "id": 37708292,
    "title": "RealFill: Képkiegészítés diffúziós modellekkel",
    "originLink": "https://realfill.github.io/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37708292",
    "commentBody": "",
    "originSummary": [
      "A RealFill, egy generatív modell, javítja a kép kiegészítését azáltal, hogy a kép hiányzó területeit a megfelelő tartalommal tölti ki, egy referenciaképeken finomhangolt modell segítségével.",
      "A RealFill felülmúlja a többi módszert az olyan kihívást jelentő helyzetek kezelésében, mint a különböző nézőpontok, fényviszonyok, kamera beállítások és képstílusok, ezáltal javítva a kép kitöltését.",
      "A RealFillnek azonban vannak hátrányai, többek között a lassabb működési sebesség és a szélsőséges nézőpontváltozások kezelésére való képtelenség."
    ],
    "commentSummary": [
      "A beszélgetés elsősorban a mesterséges intelligencia képmanipulációra és -javításra való felhasználása körül forog, és olyan iparágakban alkalmazható, mint a fotózás, a film és a televíziózás.",
      "Megemlítik a Google számítógépes fotózás és képszerkesztés terén elért eredményeit, valamint a hitelességgel és etikai kérdésekkel kapcsolatos aggályokat.",
      "Az emberek megvitatják a mesterséges intelligencia felskálázásának lehetőségét a régebbi tévéműsorok minőségének javítására, valamint a generált képek helyes terminológiájáról szóló vitát."
    ],
    "points": 511,
    "commentCount": 169,
    "retryCount": 0,
    "time": 1696012075
  },
  {
    "id": 37706302,
    "title": "A Facebook/Meta blokkolja a fiókokat az EFF adatvédelmi tippjeire mutató link közzétételéért",
    "originLink": "https://techhub.social/@kirbstr/111148950526108155",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37706302",
    "commentBody": "",
    "originSummary": [
      "@kirbstr felhasználó a Facebookon kiemelte a korlátozások jelenlétét, amikor megpróbálnak megosztani egy opt-out linket, amelyet eredetileg @pluralistic említett egy szálon.",
      "Sok Facebook-felhasználó aggodalmát fejezte ki a Facebook információterjesztés feletti ellenőrzésével kapcsolatban, és megkérdőjelezte e korlátozások jogszerűségét.",
      "@RealGene felhasználó megerősítette, hogy a kérdéses link segítségével kikapcsolható a Google \"Privacy Sandbox\", a hirdetések nyomon követésének funkciója."
    ],
    "commentSummary": [
      "A Facebook/Meta letiltotta a fiókokat az Electronic Frontier Foundation adatvédelmi tippjeire mutató link terjesztése miatt, ami aggodalmakat keltett a helytelen blokkolással és az online moderációs ellenőrzések szükségességével kapcsolatban.",
      "Az esemény beszélgetést váltott ki a Facebook adatvédelmi vitáiról, a közvetítési módszerekről és a közösségi média szerepéről a felháborodás kultúrájának táplálásában.",
      "A Hacker News felhasználói elismerték a tartalommoderációs algoritmusok hibáit, és aggodalmukat fejezték ki a Facebook adatvédelmi taktikájával kapcsolatban."
    ],
    "points": 362,
    "commentCount": 86,
    "retryCount": 0,
    "time": 1696003863
  },
  {
    "id": 37705368,
    "title": "Adatvédelmi mosakodás: A Google azt állítja, hogy támogatja az adatvédelmet, miközben ellene lobbizik",
    "originLink": "https://proton.me/blog/google-lobbying",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37705368",
    "commentBody": "",
    "originSummary": [
      "A Google-t \"adatvédelmi mosással\" vádolják, azaz azzal, hogy a magánélet védelmét támogatja, de lobbizik a felhasználók online megfigyeléstől való védelmét célzó jogszabályok ellen.",
      "A Google lobbitevékenysége, amelynek célja az volt, hogy megállítsa az adatok kiaknázásának hivatalos szabályozását, világszerte kiterjedt és milliókba került. Azzal érvel, hogy az adatokkal kapcsolatos döntések felett a vállalatoknak, nem pedig az egyéneknek kell rendelkezniük.",
      "A cég a hírek szerint megpróbálta gyengíteni az adatvédelmi törvényeket olyan régiókban, mint Kalifornia és Európa, és jelenleg egy olyan záradékot kíván beépíteni egy kereskedelmi megállapodásba, amely korlátozza a tagországokat az adatvédelmi törvények meghozatalában."
    ],
    "commentSummary": [
      "A fő hangsúly a Google adatvédelmi gyakorlatán, a célzott hirdetéseken és az adatvédelmi törvények elleni aktív lobbizáson van, a kritikák és a támogatás mellett.",
      "A diskurzus magában foglalja a célzott hirdetések és a marketing etikai aspektusairól, a kapitalizmus szerepéről ezekben a gyakorlatokban, valamint a reklámokkal gyakran összefüggésbe hozott manipulatív technikákról szóló vitákat.",
      "Aggodalmak merülnek fel a Google potenciális monopóliumával, a teljes magánélet digitális területen való nem létezésével és a jogalkotók lelkesedésének nyilvánvaló hiányával kapcsolatban, hogy az adatvédelmi ügyekért küzdjenek."
    ],
    "points": 355,
    "commentCount": 163,
    "retryCount": 0,
    "time": 1696000074
  },
  {
    "id": 37704760,
    "title": "RISC-V összeszerelő asztali társasjáték (hackeld meg az ellenfeled)",
    "originLink": "https://punkx.org/overflow/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37704760",
    "commentBody": "",
    "originSummary": [
      "A szerző azért fejlesztette ki a játékot, hogy a lányát tanítsa a puffer túlcsordulásokról, és hogy elősegítse a programokkal való kísérletezést.",
      "A játék, amelyet a \"Smashing the Stack for Fun and Profit\" című cikk ihletett, különböző exploitok felfedezését, a hibákból való tanulást és a közös munka élvezetét igényli.",
      "A szerző megemlítette egy ESP32 segédprogram létrehozását a közös játékhoz, miközben fontolóra vette egy webes verzió használatának lehetőségét."
    ],
    "commentSummary": [
      "Egy programozó asztali társasjátékot tervezett, hogy lányát a puffer túlcsordulásról és a számítógépes programok manipulálásának izgalmáról oktassa.",
      "A RISC-V assembly nyelven alapuló játék lehetővé teszi a játékosok számára, hogy kihasználják a sebezhetőségeket és \"feltörjék\" ellenfeleiket, és ezzel a korábbi számítástechnikai rendszerek gyakorlati felfedezésének újjáélesztését célozza.",
      "A társasjáték pozitív visszajelzéseket kapott, és 10 éves kortól alkalmasnak ítélték meg, abban a reményben, hogy a hackerek új generációját inspirálja."
    ],
    "points": 298,
    "commentCount": 34,
    "retryCount": 0,
    "time": 1695997535
  },
  {
    "id": 37707119,
    "title": "Teszteltem egy HDMI-adaptert, amely követeli a helyét, és hirdetésekkel spammeli Önt",
    "originLink": "https://www.404media.co/i-tested-an-hdmi-adapter-that-demands-your-location-browsing-data-photos-and-spams-you-with-ads/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37707119",
    "commentBody": "",
    "originSummary": [
      "A 404 Media független technológiai oldal nyilvánosságra hozott egy vizsgálatot egy Apple-terméknek álcázott HDMI-adapterrel kapcsolatban, amely titokban felhasználói adatokat gyűjt és hirdetéseket közvetít.",
      "Az adapter arra készteti a felhasználókat, hogy egy QR-kód segítségével töltsenek le egy alkalmazást, amely hozzáférést biztosít a személyes adatokhoz, amelyeket aztán megosztanak a hirdetőkkel és elküldenek Kínába.",
      "A leleplezések hangsúlyozzák a fogyasztói elektronikai termékekkel kapcsolatos folyamatos adatvédelmi aggályokat, és ráirányítják a figyelmet az Amazon szerepére az ilyen termékek értékesítésében, miközben az FTC pert indított a vállalat ellen spam-hirdetések elhelyezése miatt."
    ],
    "commentSummary": [],
    "points": 244,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1696007145
  },
  {
    "id": 37706596,
    "title": "Hogyan működik a négynapos munkahét, az azt megvalósító vállalatoktól",
    "originLink": "https://www.wsj.com/lifestyle/careers/how-a-4-day-workweek-actually-works-from-the-companies-pulling-it-off-1a5c0e2a",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37706596",
    "commentBody": "",
    "originSummary": [
      "Egyre több vállalkozás teszteli a négynapos munkahetet, és az alkalmazottak a termelékenység növekedéséről és a munka és a magánélet jobb egyensúlyáról számolnak be.",
      "Az olyan cégek, mint a ThredUp, az értekezletek csökkentésével és a létfontosságú munkára való összpontosítással tették hatékonnyá a rövidebb hetet. Egyes cégek azonban nem tapasztaltak hatékonyságnövekedést, különösen a nagyobb, világszerte működő cégek, amelyeknek nehézséget okozhat az egységes időbeosztás megtalálása.",
      "E kihívások ellenére a rövidebb munkahét vonzereje továbbra is fennáll, és néhány állami törvényhozó törvényjavaslatokat terjeszt elő, hogy több vállalkozást is rávegyen a négynapos program bevezetésére."
    ],
    "commentSummary": [
      "A gyűjtemény a négynapos munkahét előnyeit és lehetséges hátrányait vizsgálja, és érvekkel alátámasztja, hogy ez javíthatná a termelékenységet, a munka és a magánélet egyensúlyát és a mentális jólétet.",
      "Egyesek azonban fenntartásokat fogalmaznak meg a gyakorlati megvalósíthatósággal és a termelékenységre gyakorolt valószínűsíthető hatással kapcsolatban.",
      "A vita olyan kérdéseket érint, mint a munka megszakítása, a munka helyettesíthetősége és az egyéni készségek jelentősége, és a rövidebb munkahét bevezetéséről, valamint a munkakultúra és a hatékonyság megváltoztatásának szükségességéről szóló különböző véleményekkel zárul."
    ],
    "points": 238,
    "commentCount": 235,
    "retryCount": 0,
    "time": 1696005052
  },
  {
    "id": 37702059,
    "title": "Vizuális csomópontgráf ImGui-val",
    "originLink": "https://gboisse.github.io/posts/node-graph/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37702059",
    "commentBody": "",
    "originSummary": [
      "A szerző részletezi a \"RogueEngine\" csomópontgráf rendszerének létrehozását, egy grafikus motorhoz, amelyet azzal a céllal építettek, hogy könnyen használható felületet hozzanak létre a tartalom interakciójához, szerkesztéséhez és a művészek és tervezők együttműködéséhez.",
      "A rendszer csak kétféle csomópontot tartalmaz, egy gyökércsomópontot, egy adatcsomópontot és egy komponenscsomópontot, olyan szoftverekből merítve ihletet, mint a Blender, a Notch és a Godot.",
      "A megvalósítást a Dear ImGui for UI, az adatmodellek és a GUI-kód szétválasztása, valamint a billentyűzetkeretezési tulajdonságok és kódcsomópontok biztosítása révén értük el a fokozott hajlékonyság érdekében."
    ],
    "commentSummary": [
      "A cikk a vizuális programozás témakörét járja körül, konkrétan a vizuális csomópontgráf-rendszert és a különböző kapcsolódó eszközöket és könyvtárakat tárgyalja.",
      "Élénk vita folyik a vizuális programozás előnyeiről és hátrányairól, rámutatva az olyan kihívásokra, mint az algoritmusok ábrázolásának nehézsége, valamint az olvashatósággal és a struktúrával kapcsolatos problémák.",
      "A bejegyzés elismeri az imgui könyvtár hatékonyságát a játékiparban, és felhívja a figyelmet a szabványosított eszközök fontosságára a szöveges programozásban."
    ],
    "points": 237,
    "commentCount": 78,
    "retryCount": 0,
    "time": 1695986300
  },
  {
    "id": 37706893,
    "title": "50 évvel később a kétfázisú zárás a legjobb, amit tehetünk?",
    "originLink": "http://concurrencyfreaks.blogspot.com/2023/09/50-years-later-is-two-phase-locking.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37706893",
    "commentBody": "",
    "originSummary": [
      "A cikk elemzi a kétfázisú zárolási (2PL) algoritmus hiányosságait az adatbázisok párhuzamossági vezérlésére, beleértve a gyenge skálázhatóságot és az élő zárolás előrehaladását.",
      "Javasol egy továbbfejlesztett változatot, a Two-Phase Locking Starvation-Free (2PLSF) elnevezésű rendszert, amely skálázható olvasási indikátorok segítségével kívánja kezelni ezeket a korlátokat.",
      "A cikk a 2PLSF fejlődését és kihívásait tárgyalja, és a 2PLSF-et az adatbázisok egyidejűség-szabályozásának továbbfejlesztett alternatívájaként helyezi előtérbe."
    ],
    "commentSummary": [
      "A cikk értékeli a kétfázisú zárolás (2PL) megközelítésének korlátait az elosztott rendszerekben, és alternatív módszereket - nevezetesen a Raft és a szerializálható pillanatfelvétel-izoláció - javasol a konzisztencia elérésére az elosztott mikroszolgáltatás-architektúrában.",
      "Különböző mechanizmusok és protokollok, például az ULID-k azonosítására, a TL2 és a 2PL az egyidejűség-szabályozásra, valamint a Paxos és a Raft az elosztott tranzakciókban való konszenzusra való felhasználását vizsgálja.",
      "A cikk zárásként kiemeli az elosztott rendszerekben a megbízhatatlan hálózatok miatt felmerülő kommunikációs nehézségeket, valamint a Calvin-szerű protokollok használatát a többszörözött rendszerekben."
    ],
    "points": 226,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1696006292
  },
  {
    "id": 37709284,
    "title": "Meta Mianmarban",
    "originLink": "https://erinkissane.com/meta-in-myanmar-part-i-the-setup",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37709284",
    "commentBody": "",
    "originSummary": [
      "Ez az összefoglaló kiemeli a Meta (korábbi nevén Facebook) hozzájárulását a gyűlöletbeszéd és a rohingya nép elleni erőszak terjedéséhez Mianmarban, ahol a platform meghatározóvá vált.",
      "Az aktivisták és szakértők többszöri riasztása ellenére a cikk kiemeli, hogy a Facebook nem foglalkozik ezzel a kérdéssel.",
      "A poszt azt sugallja, hogy jelentős kapcsolat áll fenn a nagy közösségi médiaplatformok és a valós erőszak szerepe között, és kérdéseket vet fel a felelősségükkel és elszámoltathatóságukkal kapcsolatban."
    ],
    "commentSummary": [
      "A beszélgetés középpontjában a Facebook szerepe áll a gyűlöletbeszéd terjesztésében és az erőszak bátorításában Mianmarban, különösen a rohingya kisebbség ellen.",
      "A Facebook algoritmusait és a nem kielégítő tartalommoderálást kritizálják, amiért lehetővé teszi a káros tartalmak terjesztését, ami halálesetekhez és kitelepítésekhez vezet.",
      "A párbeszéd kiterjed a Facebook erkölcsi felelősségére, a tartalommoderálás akadályaira és a közösségi médiaplatformokon való beszéd szabályozásának nagyobb kérdésére."
    ],
    "points": 217,
    "commentCount": 106,
    "retryCount": 0,
    "time": 1696017061
  },
  {
    "id": 37704859,
    "title": "Norvégia azt akarja, hogy a Facebook viselkedésalapú hirdetéseket Európa-szerte betiltsák",
    "originLink": "https://www.theregister.com/2023/09/29/norway_facebook_behavioral_ads/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37704859",
    "commentBody": "",
    "originSummary": [
      "Norvégia azt szorgalmazza, hogy a Meta (korábban Facebook) számára Európa-szerte tartósan tiltsák meg a felhasználói adatok Facebookon és Instagramon történő viselkedésalapú reklámozásra történő felhasználását.",
      "A Meta adatvédelmi előírások be nem tartása és védett adatok gyűjtése miatt kezdeményezett tiltás ellenállásba ütközött, mivel a Meta azzal érvel, hogy már rendelkezik a felhasználók hozzájárulásával a célzott reklámozáshoz.",
      "Míg az Egyesült Királyság saját adatvédelmi törvénye miatt nem szerepel ebben a kérdésben, a norvég adatvédelmi hatóság azt szeretné, ha a GDPR-t az EU/EGT egész területén egységesen értelmeznék."
    ],
    "commentSummary": [
      "Norvégia a Facebook viselkedésalapú hirdetések betiltását szorgalmazza Európában, vitát indítva a hirdetések negatív hatásairól és szükségességéről.",
      "A vita érinti a reklámozás etikai megfontolásait, a kormányzati szabályozást és a reklámnak a kapitalizmusban betöltött szerepét, beleértve a reklámokban alkalmazott pszichológiai technikákkal és a testképre gyakorolt hatásukkal kapcsolatos aggályokat.",
      "A Reddit-felhasználók a tech- és marketingszektoron belüli erőforrás-elosztást vitatják meg, bosszúságukat fejezik ki a túlzott telefonfunkciók és a manipulatív marketing miatt, valamint az online reklámoknak a magánéletre és a kisvállalkozásokra gyakorolt hatásáról."
    ],
    "points": 217,
    "commentCount": 152,
    "retryCount": 0,
    "time": 1695997897
  },
  {
    "id": 37702632,
    "title": "MMO-architektúra: I/O szűk keresztmetszetek és azok megoldása",
    "originLink": "https://prdeving.wordpress.com/2023/09/29/mmo-architecture-source-of-truth-dataflows-i-o-bottlenecks-and-how-to-solve-them/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37702632",
    "commentBody": "",
    "originSummary": [
      "A cikk alaposan elemzi az MMO (Massively Multiplayer Online) játékokkal kapcsolatos tervezési és architekturális bonyodalmakat, kiemelve az adatok input/output (I/O) kezelésének nehézségeit és az I/O szűk keresztmetszetek leküzdését.",
      "A szerző kiemeli a memórián belüli világállapot jelentőségét, amely az igazság forrása, és nem az adatbázis az MMO-játékokban, és bemutatja az adatbróker mintát, amely segít fenntartani a világállapotot a memóriában, és lehetővé teszi a játékszolgáltatások számára, hogy RPC (Remote Procedure Call) segítségével kölcsönhatásba lépjenek vele.",
      "A cikk hangsúlyozza a stratégiai tervezés és elemzés szükségességét az adatáramlás racionalizálása érdekében, és olyan kritikus szempontokat tárgyal, mint az adatok kitartása, a skálázhatóság és a CAS (Compare-and-swap) utasítások alkalmazása a versenyfeltételek megelőzésére a rendszer teljesítményének növelése érdekében."
    ],
    "commentSummary": [
      "Ez a bejegyzés a masszívan multiplayer online (MMO) játékok architektúrájának tervezésével kapcsolatos összetett kérdéseket tárgyalja, például a szinkronizálás, a gyorsítótárazás, az optimalizálás és az állapotkezelés kezelését.",
      "Fényt derít egy rajongók által készített MMO, a FOnline fejlesztésére, a Trinitycore-hoz hasonló privát szerverekben rejlő lehetőségekre az olyan játékokban, mint a World of Warcraft, és a privát szerverek működtetésének technikai kérdéseire.",
      "A poszt forrásokat és tanácsokat is nyújt az MMO-architektúra tervezéséhez, és olyan kihívásokkal foglalkozik, mint a játékosok megszerzése, a döntéshozatal és az optimalizálás."
    ],
    "points": 205,
    "commentCount": 61,
    "retryCount": 0,
    "time": 1695989344
  },
  {
    "id": 37703885,
    "title": "Titkosított ügyfél Hello",
    "originLink": "https://blog.cloudflare.com/announcing-encrypted-client-hello/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37703885",
    "commentBody": "",
    "originSummary": [
      "A Cloudflare egy új szabványt javasolt, a titkosított ügyfél-hallgatást (ECH), amely a felhasználók adatvédelmének megerősítésére szolgál azáltal, hogy megakadályozza, hogy a hálózatok felismerjék a felhasználó által látogatott weboldalakat.",
      "Az ECH elrejti a szerver névjelzést (SNI), amely a TLS kézfogási folyamat része, biztosítva, hogy a felhasználói tevékenység nyomon követése a felhasználóra, a Cloudflare-re és a webhely tulajdonosára korlátozódjon.",
      "A Cloudflare minden tervében bevezette az ECH-t, és támogatja annak szélesebb körű elfogadását az internetes adatvédelem javítása érdekében."
    ],
    "commentSummary": [
      "A vita a titkosított ügyfélhívás (ECH) integrálása és hatásai körül forog a szállítási szintű biztonsági protokollokba (TLS), kiemelve a kormányzati beavatkozással és a titkosítást fenyegető kvantumszámítógépes veszélyekkel kapcsolatos aggodalmakat.",
      "A résztvevők megvitatják a domain-hozzáférés akadályozásának következményeit, az ECH képtelenségét a forgalomelemzés akadályozására, valamint olyan témákat, mint a cenzúra, a hálózati biztonság, a virtuális magánhálózatok (VPN) és a DNS HTTPS-en keresztül (DoH).",
      "A fő hangsúly az internetes adatvédelemre és ellenőrzésre helyeződik, az e célok eléréséhez szükséges optimális útitervről pedig eltérő álláspontok alakultak ki."
    ],
    "points": 189,
    "commentCount": 172,
    "retryCount": 0,
    "time": 1695994020
  },
  {
    "id": 37710683,
    "title": "Vonatok egy másik szinten",
    "originLink": "https://factorio.com/blog/post/fff-378",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37710683",
    "commentBody": "",
    "originSummary": [
      "A Factorio legújabb frissítésében bevezetik a magasított síneket, amelyek célja, hogy javítsák a vonatok áteresztőképességét a nagyobb gyárakban és fokozzák a játékmenetet.",
      "A frissítés sínrámpákat, magasított síneket, síntámaszokat és kerítéseket tartalmaz. A grafikák kifejlesztése körülbelül kilenc hónapot vett igénybe.",
      "Az emelt szintű sínek, amelyek csak a bővítmény futtatható változatával érhetők el, a Termelési tudományos csomagok segítségével kutathatók. A funkció önálló hivatalos modként is megjelenik majd. Az új funkcióval kapcsolatos visszajelzéseket szívesen fogadják a fejlesztők."
    ],
    "commentSummary": [
      "A Factorio játék új frissítése eltérő véleményeket váltott ki a játékosok körében, egyesek izgatottak a fejlesztések miatt, mások pedig aggodalmukat fejezték ki.",
      "A viták a játék addiktív jellege, a hasonló játékok potenciális konkurenciája és egy közelgő, vonatokkal foglalkozó játékra adott pozitív visszajelzések körül forognak.",
      "A Factorio egyes elemeit ért kritikák közepette a kommentelők megosztják a játék bővítésével kapcsolatos izgatottságukat, javaslatokat tesznek hasonló játékélményekre, és megvitatják a játékon belüli felfedezés és erőforráskeresés stratégiáit."
    ],
    "points": 176,
    "commentCount": 87,
    "retryCount": 0,
    "time": 1696025336
  },
  {
    "id": 37708582,
    "title": "Insomnium - Az Insomnia API kliens helyi, adatvédelmi fókuszú forkja",
    "originLink": "https://github.com/ArchGPT/insomnium",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37708582",
    "commentBody": "",
    "originSummary": [
      "Az Insomnium, az Insomnia API-kliens elágazása, egy adatvédelemre összpontosító, nyílt forráskódú alkalmazás, amely olyan technológiákat támogat, mint a GraphQL, a REST, a WebSockets, a szerver által küldött események és a gRPC.",
      "Az Insomnium egy olyan termékfrissítés ellenében jött létre, amely kötelező fiókbejelentkezést igényelt. Eltávolítja a felhasználói bejelentkezést, a nyomon követést és az analitikát azzal a küldetéssel, hogy optimalizálja az alkalmazás sebességét.",
      "A szoftver kompatibilis Mac, Windows és Linux rendszerekkel, és lehetővé teszi a fejlesztést ezen platformok bármelyikén a Node.js és a Git segítségével. A fokozott testreszabhatóság és bővíthetőség érdekében fejlesztés alatt áll egy Code Llama nevű bővítmény. A projektet az MIT licenc szabályozza."
    ],
    "commentSummary": [
      "Az Insomnium az Insomnia API kliens adatvédelmi fókusza, amelyet az eredeti kliens felhasználói adatok kezelésével kapcsolatos aggályok miatt hoztak létre, ami a közösség ellenérzéseit váltotta ki.",
      "Az Insomnia alternatívái, mint a Restfox, Bruno, ezy, Step CI és Hurl, kerültek szóba. Néhány felhasználó a Thunder-t, a JetBrains IDE-kben lévő REST klienst és a restclient.el-t az Emacs-hoz is ajánlotta.",
      "A kritikák közé tartozik a HTTP-kliensek adat- és fiókéhsége, valamint a saját tárhelyű csoportos együttműködési eszközök hiánya. Javasoltak egy olyan funkciókérést is, hogy a HTTP-kliensek curl-parancsokat és kódrészleteket generáljanak."
    ],
    "points": 173,
    "commentCount": 34,
    "retryCount": 0,
    "time": 1696013356
  },
  {
    "id": 37704537,
    "title": "Az 5 ezer dolláros Google Jamboard 2024-ben meghal - a felhőalapú alkalmazások is leállnak majd",
    "originLink": "https://arstechnica.com/gadgets/2023/09/5000-google-jamboard-dies-in-2024-cloud-based-apps-will-stop-working-too/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37704537",
    "commentBody": "",
    "originSummary": [
      "A Google nyilvánosságra hozta, hogy 2024 végéig megszünteti a Google Jamboard, a digitális tábla termékét, beleértve a kapcsolódó felhőalapú alkalmazások támogatását is.",
      "A meglévő felhasználóknak lehetőségük lesz arra, hogy átvigyék adataikat a versenytársak táblaalkalmazásaira, a hasonló terméket igénylőknek pedig új érintőképernyőt kell vásárolniuk.",
      "Ez a döntés összhangban van a Google azon szándékával, hogy elhagyja a tábla piacot, és a Google Workspace-ben a táblázáshoz szükséges partneri ökoszisztémát fejleszti, mivel a Jamboard fenntartásához nem volt elegendő kereslet a magasabb árcédula és a többletköltségek ellenére."
    ],
    "commentSummary": [
      "A Google 5 ezer dolláros interaktív táblája, a Google Jamboard és a hozzá kapcsolódó felhőalapú alkalmazások az előrejelzések szerint 2024-re elavulttá válnak.",
      "Ez a bejelentés különböző platformokon vitákat váltott ki, kiemelve az egész iparágra kiterjedő jelentőségét.",
      "A vitákban további olvasnivalókra mutató linkek találhatók, amelyek arra ösztönzik a felhasználókat, hogy vegyenek részt a vitában, és teljesebb képet kapjanak a helyzetről."
    ],
    "points": 169,
    "commentCount": 3,
    "retryCount": 0,
    "time": 1695996664
  },
  {
    "id": 37705328,
    "title": "Zenei könyvtár készítése SPA nélkül",
    "originLink": "https://begin.com/blog/posts/2023-09-28-introducing-enhance-music",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37705328",
    "commentBody": "",
    "originSummary": [
      "Az Enhance csapata kifejlesztette az Enhance Music-ot, egy HTML, CSS és minimális JavaScript használatával készült hanglejátszó alkalmazást, hogy bemutassa az interaktív felületekben rejlő lehetőségeket JavaScript könyvtárak és keretrendszerek nélkül.",
      "A csapat részletesen kidolgozta az alkalmazás szerkezetét, progresszív fejlesztését és funkcionalitását, például a tulajdonságok frissítését és a hullámforma megjelenítését a HTMLMediaElement és a webkomponensek körül, miközben olyan tényezőkkel is foglalkozott, mint a webes szabványok, a teljesítmény és a hozzáférhetőség.",
      "Azt is bemutatták, hogyan kezelték a hozzáférhetőségi jellemzőket és korlátozásokat, például a Safari automatikus lejátszási problémáját; arra ösztönözték az olvasókat, hogy vizsgálják meg a forráskódot, és a végén elismerték a szerzői jogokat és a tartalom eredetét."
    ],
    "commentSummary": [
      "A téma a zenei könyvtárak egyoldalas alkalmazások (SPA-k) használata nélkül történő építéséről szóló vitát foglalja magában, ahol a résztvevők a lassabb betöltési időkkel, a korlátozott felhasználói élményfunkciókkal, a navigációs nehézségekkel és a JavaScript függőséggel kapcsolatos aggodalmaknak adnak hangot.",
      "Vita folyik a JavaScript használatáról a webfejlesztésben: egyesek több funkcionalitást keresnek a HTML-ben, míg mások aggodalmukat fejezik ki a nagy függőségi fákkal rendelkező kódbázisok karbantartásának kihívásai miatt.",
      "A felhasználók egy része olyan alternatív lehetőségeket vitat meg, mint a keretkészletek használata SPA-k helyett, valamint az iframes lehetséges használata a dinamikus komponenscserére a zenelejátszókban. A résztvevők véleménye a nem-SPA zenei könyvtárak előnyeiről és hátrányairól eltérő."
    ],
    "points": 151,
    "commentCount": 58,
    "retryCount": 0,
    "time": 1695999853
  },
  {
    "id": 37709876,
    "title": "A szovjet számítógép 30 éve feledésbe merült [videó]",
    "originLink": "https://www.youtube.com/watch?v=lVCS99Zep9w",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37709876",
    "commentBody": "",
    "originSummary": [
      "Egy videósorozat házigazdái helyreállítanak és bemutatnak egy szovjet korabeli számítógépet, amelyet a csernobili zónában találtak, és bemutatják annak egyedi jellemzőit és működését.",
      "Bemutatják a restaurálás során felmerült kihívásokat, elismerik a retro számítástechnikai közösség segítségét, és bemutatják az ukrán számítógépen futó régi szoftveralkalmazásokat és játékokat.",
      "A technikai feltárás mellett személyes élményeket is megosztanak, esetleg egy bónusz videót ígérnek egy tágabb történelmi kontextust kifejtő történelmi műtárgyról. Zárásként a közönségüket egy szokásos YouTube-felhívással hívják fel a cselekvésre - lájkok és feliratkozások kérése."
    ],
    "commentSummary": [
      "A cikk felidézi a régi szovjet ES-1841-es számítógép emlékeit, kiemelve annak játékra és kódolásra való használatát, és más retro játékokat is bemutat.",
      "A könyv a kibernetika szovjet számítástechnikára gyakorolt jelentős hatását vizsgálja, érintve a szovjet számítástechnika történetének különböző aspektusait.",
      "A beszélgetés kitér a régi számítástechnikai technológiákra, a régebbi számítógépek csatlakozóira és a Digger játékra is, utalva arra, hogy a jövőben az iPhone-t ilyen rendszereken is működtetni lehetne."
    ],
    "points": 142,
    "commentCount": 56,
    "retryCount": 0,
    "time": 1696020242
  },
  {
    "id": 37705563,
    "title": "A Three Arrows Capital társalapítóját, Zhu-t letartóztatták a szingapúri repülőtéren",
    "originLink": "https://techcrunch.com/2023/09/29/three-arrows-capital-co-founder-zhu-arrested-in-singapore-airport-sentenced-four-months-in-prison/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37705563",
    "commentBody": "",
    "originSummary": [
      "Su Zhu-t, a Three Arrows Capital (3AC) társalapítóját letartóztatták és négy hónap börtönbüntetésre ítélték Szingapúrban, mert nem teljesítette a bírósági végzéseket a megszűnt kripto fedezeti alap felszámolási vizsgálatával kapcsolatban.",
      "Ez a fejlemény a 3AC 2022-es csődbejelentését követi.",
      "A másik társalapító, Kyle Davies tartózkodási helye jelenleg ismeretlen."
    ],
    "commentSummary": [
      "A cikk a kriptopénz különböző aspektusait tárgyalja, például egy tőkecég társalapítójának letartóztatásának következményeit és a stabilcoinok értékpotenciálját.",
      "Kiemeli a Bitcoin sebezhetőségét, a kriptovaluták különböző felhasználási eseteit, és utal egy történelmi hadifogolytábor forgatókönyvére.",
      "A cikk megállapítja, hogy a kriptoiparban fokozott ellenőrzésre van szükség, és kiemeli, hogy a kriptovaluták jövőbeli kilátásairól és megvalósíthatóságáról eltérőek a vélemények."
    ],
    "points": 141,
    "commentCount": 120,
    "retryCount": 0,
    "time": 1696000900
  }
]
