[
  {
    "id": 37703291,
    "title": "Objetos arrastáveis",
    "originLink": "https://www.redblobgames.com/making-of/draggable/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37703291",
    "commentBody": "",
    "originSummary": [
      "A publicação do blog fornece um guia sobre como implementar a funcionalidade arrastável para diagramas interativos usando eventos de mouse e toque, com exemplos de código e explicações.",
      "Ele aborda problemas comuns, como impedir a rolagem, os menus de contexto e a seleção de texto durante o arrastamento, e esclarece os testes de compatibilidade e as limitações relacionadas aos métodos de entrada.",
      "Uma discussão separada sobre um componente Vue para arrastar elementos SVG é fornecida, juntamente com os exemplos de código e as instruções de uso."
    ],
    "commentSummary": [
      "O tópico de discussão aborda principalmente os obstáculos e as possíveis soluções na implementação de objetos arrastáveis no design da Web, incluindo o cálculo de layouts e o tratamento de exceções.",
      "O debate destaca as limitações da API de arrastar e soltar do HTML, sugerindo a necessidade de meios alternativos.",
      "Os participantes do tópico elogiam muito o site de Amit Patel, RedBlobGames, por seu conteúdo benéfico sobre desenvolvimento de jogos, algoritmos e IA, sugerindo-o como um tópico para futuras discussões no Hacker News."
    ],
    "points": 906,
    "commentCount": 107,
    "retryCount": 0,
    "time": 1695991882
  },
  {
    "id": 37702095,
    "title": "Tudo o que é autenticado pela Microsoft está contaminado",
    "originLink": "https://graz.social/@publicvoit/111147782761723981",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37702095",
    "commentBody": "",
    "originSummary": [
      "O resumo destaca as preocupações com relação à segurança da Microsoft após a recente invasão da nuvem do Azure, incluindo a possível vulnerabilidade de serviços como o GitHub.",
      "Ele enfatiza a importância de um plano de desastre e de medidas de mitigação, especialmente para plataformas como o NixOS, que dependem muito do GitHub.",
      "Por fim, ele levanta a necessidade de alternativas fáceis de usar para o GitHub e a questão mais ampla do controle de dados na nuvem, indicando uma antecipação da expansão de possíveis invasores."
    ],
    "commentSummary": [
      "Os participantes do fórum discutem diversas questões, incluindo a mais recente violação de segurança da Microsoft, o nível de confiança na Microsoft e as práticas de segurança da empresa.",
      "Há preocupações sobre os riscos da computação em nuvem, da privacidade e da segurança on-line, com os participantes compartilhando várias perspectivas sobre possíveis implicações e desafios.",
      "Tópicos como a segurança dos sistemas operacionais e a relação entre consumidores e fornecedores também são analisados, indicando uma discussão mais ampla sobre a dinâmica do mercado de tecnologia."
    ],
    "points": 736,
    "commentCount": 334,
    "retryCount": 0,
    "time": 1695986541
  },
  {
    "id": 37708292,
    "title": "RealFill: preenchimento de imagens usando modelos de difusão",
    "originLink": "https://realfill.github.io/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37708292",
    "commentBody": "",
    "originSummary": [
      "O RealFill, um modelo generativo, aprimora o preenchimento de imagens ao preencher as regiões ausentes de uma imagem com conteúdo adequado, usando um modelo ajustado em imagens de referência.",
      "O RealFill supera outros métodos ao lidar com cenários desafiadores, como vários pontos de vista, condições de iluminação, configurações de câmera e estilos de imagem, melhorando assim a conclusão da imagem.",
      "No entanto, o RealFill tem desvantagens, incluindo uma velocidade operacional mais lenta e a incapacidade de lidar com mudanças extremas de ponto de vista."
    ],
    "commentSummary": [
      "A conversa gira principalmente em torno do uso de IA para manipulação e aprimoramento de imagens, com aplicações em setores como fotografia, cinema e TV.",
      "Notadamente, os avanços do Google em fotografia computacional e edição de imagens são mencionados, juntamente com preocupações sobre autenticidade e questões éticas.",
      "As pessoas estão discutindo o potencial do upscaling de IA para melhorar a qualidade de programas de TV mais antigos e o debate sobre a terminologia correta para as imagens geradas."
    ],
    "points": 511,
    "commentCount": 169,
    "retryCount": 0,
    "time": 1696012075
  },
  {
    "id": 37706302,
    "title": "Facebook/Meta bloqueia contas por postarem links para dicas de privacidade da EFF",
    "originLink": "https://techhub.social/@kirbstr/111148950526108155",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37706302",
    "commentBody": "",
    "originSummary": [
      "O usuário @kirbstr destacou no Facebook a presença de limitações ao tentar compartilhar um link de desativação, inicialmente mencionado em um tópico por @pluralistic.",
      "Muitos usuários do Facebook expressaram preocupação em relação ao controle do Facebook sobre a disseminação de informações e questionaram a legalidade dessas restrições.",
      "O usuário @RealGene confirmou que o link em questão ajuda a desativar o \"Privacy Sandbox\" do Google, um recurso de rastreamento de anúncios."
    ],
    "commentSummary": [
      "O Facebook/Meta barrou contas por disseminarem um link para as dicas de privacidade da Electronic Frontier Foundation, gerando preocupações sobre o bloqueio incorreto e a necessidade de verificações de moderação on-line.",
      "O evento gerou uma conversa sobre as controvérsias de privacidade do Facebook, os métodos de mediação e o papel da mídia social em alimentar a cultura da indignação.",
      "Os usuários do Hacker News reconheceram as falhas nos algoritmos de moderação de conteúdo e levantaram preocupações sobre as táticas de privacidade do Facebook."
    ],
    "points": 362,
    "commentCount": 86,
    "retryCount": 0,
    "time": 1696003863
  },
  {
    "id": 37705368,
    "title": "Lavagem de privacidade: o Google afirma apoiar a privacidade enquanto faz lobby contra ela",
    "originLink": "https://proton.me/blog/google-lobbying",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37705368",
    "commentBody": "",
    "originSummary": [
      "O Google é acusado de \"lavagem de privacidade\", ou seja, promover a privacidade, mas fazer lobby contra a legislação destinada a proteger os usuários da vigilância on-line.",
      "Os esforços de lobby do Google, com o objetivo de interromper a regulamentação oficial da exploração de dados, se estenderam por todo o mundo e custaram milhões. Ele defende que as empresas, e não os indivíduos, tenham controle sobre as decisões relativas aos dados.",
      "Há relatos de que a empresa tentou enfraquecer as leis de privacidade em regiões como a Califórnia e a Europa e, atualmente, pretende incorporar uma cláusula em um acordo comercial que limita os países membros a promulgarem leis de privacidade."
    ],
    "commentSummary": [
      "O foco principal são as práticas de privacidade do Google, a publicidade direcionada e o lobby ativo contra a legislação de privacidade, relatando críticas e apoio.",
      "O discurso inclui debates sobre os aspectos éticos dos anúncios e do marketing direcionados, o papel do capitalismo nessas práticas e as técnicas de manipulação frequentemente associadas à publicidade.",
      "São levantadas preocupações sobre o possível monopólio do Google, a inexistência de privacidade total no domínio digital e a aparente falta de entusiasmo dos legisladores para defender questões de privacidade."
    ],
    "points": 355,
    "commentCount": 163,
    "retryCount": 0,
    "time": 1696000074
  },
  {
    "id": 37704760,
    "title": "Jogo de tabuleiro de montagem RISC-V (hackear seu oponente)",
    "originLink": "https://punkx.org/overflow/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37704760",
    "commentBody": "",
    "originSummary": [
      "O autor desenvolveu o jogo para ensinar sua filha sobre estouro de buffer e promover a experimentação de programas.",
      "O jogo, inspirado no artigo \"Smashing the Stack for Fun and Profit\", requer a descoberta de várias explorações, o aprendizado com os erros e o aproveitamento do processo colaborativo.",
      "O autor mencionou a criação de um auxiliar ESP32 para jogos colaborativos enquanto considerava a possibilidade de usar uma versão da Web."
    ],
    "commentSummary": [
      "Um programador projetou um jogo de tabuleiro de mesa para educar sua filha sobre estouro de buffer e a emoção de manipular programas de computador.",
      "O jogo, baseado na linguagem de montagem RISC-V, permite que os jogadores explorem vulnerabilidades e \"hackeiem\" seus adversários, com o objetivo de reacender a exploração prática dos sistemas de computação anteriores.",
      "O jogo de tabuleiro recebeu feedback positivo e é considerado apropriado para pessoas a partir de 10 anos de idade, com a esperança de inspirar uma nova geração de hackers."
    ],
    "points": 298,
    "commentCount": 34,
    "retryCount": 0,
    "time": 1695997535
  },
  {
    "id": 37707119,
    "title": "Testei um adaptador HDMI que exige sua localização e envia spam para você com anúncios",
    "originLink": "https://www.404media.co/i-tested-an-hdmi-adapter-that-demands-your-location-browsing-data-photos-and-spams-you-with-ads/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37707119",
    "commentBody": "",
    "originSummary": [
      "O site de tecnologia independente 404 Media divulgou uma investigação sobre um adaptador HDMI disfarçado de produto da Apple, que coleta secretamente dados de usuários e exibe anúncios.",
      "O adaptador solicita que os usuários baixem um aplicativo por meio de um código QR, concedendo a ele acesso a dados pessoais, que são compartilhados com anunciantes e enviados para a China.",
      "As revelações enfatizam as preocupações contínuas com a privacidade em torno dos produtos eletrônicos de consumo e trazem o foco para o papel da Amazon na venda desses produtos em meio a um processo da FTC contra a empresa por hospedar anúncios de spam."
    ],
    "commentSummary": [],
    "points": 244,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1696007145
  },
  {
    "id": 37706596,
    "title": "Como funciona uma semana de trabalho de quatro dias, segundo as empresas que a realizam",
    "originLink": "https://www.wsj.com/lifestyle/careers/how-a-4-day-workweek-actually-works-from-the-companies-pulling-it-off-1a5c0e2a",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37706596",
    "commentBody": "",
    "originSummary": [
      "Mais empresas estão testando semanas de trabalho de quatro dias, com funcionários relatando aumentos na produtividade e um melhor equilíbrio entre vida pessoal e profissional.",
      "Empresas, como a ThredUp, tornaram a semana mais curta eficaz diminuindo as reuniões e concentrando-se no trabalho vital. No entanto, algumas empresas não viram o aumento da eficiência, especialmente as maiores, com operações em todo o mundo, que podem ter dificuldades para encontrar um cronograma uniforme.",
      "Apesar desses desafios, a atração por semanas de trabalho mais curtas persiste, com alguns legisladores estaduais apresentando projetos de lei para persuadir mais empresas a adotar esse programa de quatro dias."
    ],
    "commentSummary": [
      "A coleção examina as vantagens e as possíveis desvantagens de uma semana de trabalho de quatro dias, com argumentos que afirmam que ela poderia aumentar a produtividade, o equilíbrio entre vida pessoal e profissional e o bem-estar mental.",
      "No entanto, alguns expressam reservas com relação à sua praticidade e ao provável impacto sobre a produtividade.",
      "O discurso abrange questões como interrupções no trabalho, substituibilidade de empregos e a importância das habilidades individuais, concluindo com opiniões diversas sobre a implementação de uma semana de trabalho mais curta e a necessidade de alterações na cultura e na eficiência do trabalho antes dessa adoção."
    ],
    "points": 238,
    "commentCount": 235,
    "retryCount": 0,
    "time": 1696005052
  },
  {
    "id": 37702059,
    "title": "Visual Node Graph com o ImGui",
    "originLink": "https://gboisse.github.io/posts/node-graph/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37702059",
    "commentBody": "",
    "originSummary": [
      "O autor detalha a criação de um sistema de gráfico de nós para o \"RogueEngine\", um mecanismo gráfico que eles desenvolveram com a intenção de criar uma interface fácil de usar para interação de conteúdo, edição e colaboração entre artistas e designers.",
      "O sistema abriga apenas duas categorias de nós, um nó raiz, um nó de dados e um nó de componente, inspirando-se em softwares como Blender, Notch e Godot.",
      "A implementação foi realizada por meio do Dear ImGui para a interface do usuário, separando os modelos de dados do código da GUI e fornecendo propriedades de enquadramento de teclas e nós de código para maior flexibilidade."
    ],
    "commentSummary": [
      "O artigo se aprofunda no tópico de programação visual, discutindo especificamente um sistema gráfico de nós visuais e várias ferramentas e bibliotecas relacionadas.",
      "Há um debate animado sobre os prós e os contras da programação visual, apontando desafios como a dificuldade de representação de algoritmos e problemas de legibilidade e estrutura.",
      "A postagem reconhece a eficácia da biblioteca imgui no setor de jogos e chama a atenção para a importância de ferramentas padronizadas na programação textual."
    ],
    "points": 237,
    "commentCount": 78,
    "retryCount": 0,
    "time": 1695986300
  },
  {
    "id": 37706893,
    "title": "50 anos depois, o bloqueio bifásico é o melhor que podemos fazer?",
    "originLink": "http://concurrencyfreaks.blogspot.com/2023/09/50-years-later-is-two-phase-locking.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37706893",
    "commentBody": "",
    "originSummary": [
      "O artigo analisa as deficiências do algoritmo Two-Phase Locking (2PL) para o controle de simultaneidade do banco de dados, incluindo a baixa escalabilidade e o progresso do live-lock.",
      "Ele propõe uma versão avançada, Two-Phase Locking Starvation-Free (2PLSF), projetada para resolver essas limitações usando indicadores de leitura dimensionáveis.",
      "O artigo discute a evolução e os desafios do 2PL, posicionando o 2PLSF como uma alternativa aprimorada para o controle de simultaneidade em bancos de dados."
    ],
    "commentSummary": [
      "O artigo avalia as restrições da abordagem de bloqueio de duas fases (2PL) em sistemas distribuídos e propõe métodos alternativos, como o Raft e o isolamento de instantâneos serializáveis, para obter consistência na arquitetura de microsserviços distribuídos.",
      "Ele se aprofunda na utilização de diferentes mecanismos e protocolos, como ULIDs para identificação, TL2 e 2PL para controle de simultaneidade, e Paxos e Raft para consenso em transações distribuídas.",
      "O artigo conclui destacando as dificuldades de comunicação enfrentadas em sistemas distribuídos devido a redes não confiáveis e o uso de protocolos do tipo Calvin em sistemas com várias réplicas."
    ],
    "points": 226,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1696006292
  },
  {
    "id": 37709284,
    "title": "Meta em Myanmar",
    "originLink": "https://erinkissane.com/meta-in-myanmar-part-i-the-setup",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37709284",
    "commentBody": "",
    "originSummary": [
      "Este resumo destaca a contribuição do Meta (anteriormente conhecido como Facebook) para a disseminação do discurso de ódio e da violência contra o povo Rohingya em Mianmar, onde a plataforma se tornou dominante.",
      "Apesar dos repetidos alarmes de ativistas e especialistas, o artigo ressalta a falha do Facebook em lidar com esse problema.",
      "A publicação sugere uma relação significativa entre o papel das principais plataformas de mídia social e a violência no mundo real e levanta questões sobre sua responsabilidade e prestação de contas."
    ],
    "commentSummary": [
      "A conversa está centrada no papel do Facebook na propagação do discurso de ódio e no incentivo à violência em Mianmar, especificamente contra a minoria Rohingya.",
      "Os algoritmos do Facebook e a moderação insuficiente de conteúdo são criticados por permitir a disseminação de conteúdo prejudicial, resultando em mortes e deslocamentos.",
      "O diálogo se estende às responsabilidades morais do Facebook, aos obstáculos na moderação de conteúdo e à questão mais ampla da regulamentação do discurso em plataformas de mídia social."
    ],
    "points": 217,
    "commentCount": 106,
    "retryCount": 0,
    "time": 1696017061
  },
  {
    "id": 37704859,
    "title": "A Noruega quer que a publicidade comportamental do Facebook seja banida em toda a Europa",
    "originLink": "https://www.theregister.com/2023/09/29/norway_facebook_behavioral_ads/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37704859",
    "commentBody": "",
    "originSummary": [
      "A Noruega está defendendo uma proibição permanente em toda a Europa para que a Meta (antiga Facebook) use dados de usuários para publicidade comportamental no Facebook e no Instagram.",
      "A proibição, iniciada devido à não conformidade da Meta com os regulamentos de proteção de dados e à coleta de dados protegidos, encontrou resistência, pois a Meta argumenta que já tem o consentimento dos usuários para publicidade direcionada.",
      "Embora o Reino Unido não esteja incluído nessa questão devido à sua própria lei de proteção de dados, a Autoridade de Proteção de Dados da Noruega deseja que o GDPR seja interpretado de maneira uniforme em toda a UE/EEE."
    ],
    "commentSummary": [
      "A Noruega está pressionando por uma proibição da publicidade comportamental do Facebook na Europa, provocando uma discussão sobre os impactos negativos dos anúncios e sua necessidade.",
      "O debate aborda as considerações éticas da publicidade, a regulamentação governamental e o papel da publicidade no capitalismo, incluindo preocupações sobre técnicas psicológicas em anúncios e seus efeitos sobre a imagem corporal.",
      "Os usuários do Reddit estão discutindo a alocação de recursos nos setores de tecnologia e marketing, expressando irritação com o excesso de recursos dos telefones e com o marketing manipulador, além do impacto da publicidade on-line sobre a privacidade e as pequenas empresas."
    ],
    "points": 217,
    "commentCount": 152,
    "retryCount": 0,
    "time": 1695997897
  },
  {
    "id": 37702632,
    "title": "Arquitetura MMO: Fonte da verdade, fluxos de dados, gargalos de E/S e como resolver",
    "originLink": "https://prdeving.wordpress.com/2023/09/29/mmo-architecture-source-of-truth-dataflows-i-o-bottlenecks-and-how-to-solve-them/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37702632",
    "commentBody": "",
    "originSummary": [
      "O artigo disseca minuciosamente as complexidades de design e arquitetura associadas aos jogos MMO (Massively Multiplayer Online), destacando a dificuldade de gerenciar a entrada/saída (E/S) de dados e superar os gargalos de E/S.",
      "O autor ressalta a importância de um estado do mundo na memória, que é a fonte da verdade, e não o banco de dados em jogos MMO, apresentando o padrão de corretor de dados que ajuda a manter o estado do mundo na memória e permite que os serviços do jogo interajam com ele por meio de RPC (Remote Procedure Call).",
      "O artigo enfatiza a necessidade de planejamento e análise estratégicos para agilizar os fluxos de dados, discutindo considerações essenciais como perseverança de dados, escalabilidade e aplicação de instruções CAS (Compare-and-swap) para evitar condições de corrida e melhorar o desempenho do sistema."
    ],
    "commentSummary": [
      "Esta postagem discute as complexidades de projetar a arquitetura para jogos on-line multijogador em massa (MMO), como lidar com sincronização, armazenamento em cache, otimização e gerenciamento de estado.",
      "Ele esclarece o desenvolvimento de um MMO criado por fãs, o FOnline, o potencial de servidores privados como o Trinitycore para jogos como World of Warcraft e os aspectos técnicos da execução de servidores privados.",
      "A postagem também oferece recursos e conselhos para o projeto de arquitetura de MMO e enfrenta desafios como aquisição de jogadores, tomada de decisões e otimização."
    ],
    "points": 205,
    "commentCount": 61,
    "retryCount": 0,
    "time": 1695989344
  },
  {
    "id": 37703885,
    "title": "Olá cliente criptografado",
    "originLink": "https://blog.cloudflare.com/announcing-encrypted-client-hello/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37703885",
    "commentBody": "",
    "originSummary": [
      "A Cloudflare propôs um novo padrão, o Encrypted Client Hello (ECH), para reforçar a privacidade do usuário, impedindo que as redes detectem os sites que um usuário visita.",
      "O ECH oculta a Indicação do Nome do Servidor (SNI), uma parte do processo de handshake TLS, garantindo que o rastreamento da atividade do usuário seja limitado ao usuário, à Cloudflare e ao proprietário do site.",
      "A Cloudflare implementou o ECH em todos os seus planos e defende sua adoção mais ampla para aumentar a privacidade na Internet."
    ],
    "commentSummary": [
      "A discussão gira em torno da integração e dos efeitos do Encrypted Client Hello (ECH) nos protocolos Transport Layer Security (TLS), destacando as preocupações com a intervenção do governo e as ameaças da computação quântica à criptografia.",
      "Os participantes debatem as repercussões da obstrução do acesso ao domínio, a incapacidade do ECH de impedir a análise de tráfego e tópicos como censura, segurança de rede, redes privadas virtuais (VPNs) e DNS sobre HTTPS (DoH).",
      "A ênfase principal está na privacidade e no controle da Internet, com diferentes pontos de vista sobre o roteiro ideal para atingir esses objetivos."
    ],
    "points": 189,
    "commentCount": 172,
    "retryCount": 0,
    "time": 1695994020
  },
  {
    "id": 37710683,
    "title": "Trens em outro nível",
    "originLink": "https://factorio.com/blog/post/fff-378",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37710683",
    "commentBody": "",
    "originSummary": [
      "A última atualização do Factorio apresenta trilhos elevados, com o objetivo de melhorar o rendimento dos trens em fábricas maiores e aprimorar a jogabilidade.",
      "A atualização apresenta rampas de trilhos, trilhos elevados, suportes de trilhos e cercas. Esses gráficos levaram aproximadamente nove meses para serem desenvolvidos.",
      "Os trilhos elevados, acessíveis apenas com o executável da expansão, podem ser pesquisados usando os pacotes científicos de produção. O recurso também será lançado como um mod oficial autônomo. Os desenvolvedores agradecem o feedback sobre o novo recurso."
    ],
    "commentSummary": [
      "A nova atualização do jogo Factorio gerou opiniões divergentes entre os jogadores, com alguns animados com os aprimoramentos e outros expressando apreensão.",
      "As discussões giram em torno da natureza viciante do jogo, da possível concorrência de jogos semelhantes e das respostas positivas a um futuro jogo focado em trens.",
      "Em meio a críticas a certos elementos do Factorio, os comentaristas estão compartilhando sua empolgação com a expansão do jogo, oferecendo sugestões para experiências de jogo semelhantes e discutindo estratégias de exploração e busca de recursos no jogo."
    ],
    "points": 176,
    "commentCount": 87,
    "retryCount": 0,
    "time": 1696025336
  },
  {
    "id": 37708582,
    "title": "Insomnium - Bifurcação local, com foco na privacidade, do cliente da API Insomnia",
    "originLink": "https://github.com/ArchGPT/insomnium",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37708582",
    "commentBody": "",
    "originSummary": [
      "O Insomnium, uma bifurcação do cliente de API Insomnia, é um aplicativo de código aberto voltado para a privacidade que oferece suporte a tecnologias como GraphQL, REST, WebSockets, eventos enviados pelo servidor e gRPC.",
      "O Insomnium foi criado em oposição a uma atualização de produto que exigia o login obrigatório da conta. Ele remove o login do usuário, o rastreamento e a análise com a missão de otimizar a velocidade do aplicativo.",
      "O software é compatível com Mac, Windows e Linux e permite o desenvolvimento em qualquer uma dessas plataformas usando Node.js e Git. Um plug-in chamado Code Llama está sendo desenvolvido para aprimorar a personalização e a extensibilidade. A licença MIT rege o projeto."
    ],
    "commentSummary": [
      "O Insomnium é uma bifurcação focada na privacidade do cliente da API Insomnia, criada devido a preocupações com o tratamento de dados do usuário pelo cliente original, o que levou a uma reação negativa da comunidade.",
      "Foram apresentadas alternativas ao Insomnia, como Restfox, Bruno, ezy, Step CI e Hurl. Alguns usuários também recomendaram o Thunder, o REST Client nos IDEs da JetBrains e o restclient.el para o Emacs.",
      "As críticas incluem a falta de dados e de contas nos clientes HTTP, bem como a falta de ferramentas de colaboração em equipe auto-hospedadas. Também foi proposta uma solicitação de recurso para que os clientes HTTP gerem comandos curl e trechos de código."
    ],
    "points": 173,
    "commentCount": 34,
    "retryCount": 0,
    "time": 1696013356
  },
  {
    "id": 37704537,
    "title": "O Google Jamboard de US$ 5 mil morre em 2024 - os aplicativos baseados na nuvem também deixarão de funcionar",
    "originLink": "https://arstechnica.com/gadgets/2023/09/5000-google-jamboard-dies-in-2024-cloud-based-apps-will-stop-working-too/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37704537",
    "commentBody": "",
    "originSummary": [
      "O Google revelou planos para descontinuar o Google Jamboard, seu produto de quadro branco digital, até o final de 2024, incluindo o suporte para aplicativos relacionados baseados em nuvem.",
      "Os usuários existentes terão a oportunidade de migrar seus dados para aplicativos de quadro branco da concorrência, e aqueles que precisarem de um produto semelhante precisarão comprar uma nova tela sensível ao toque.",
      "Essa decisão está alinhada com a intenção do Google de sair do mercado de quadros brancos e aprimorar seu ecossistema de parceiros para quadros brancos no Google Workspace, devido à demanda insuficiente para sustentar o Jamboard, apesar de seu preço superior e dos custos adicionais."
    ],
    "commentSummary": [
      "O quadro interativo de US$ 5 mil do Google, o Google Jamboard, e seus aplicativos associados baseados em nuvem devem se tornar obsoletos até 2024.",
      "Esse anúncio gerou discussões em várias plataformas, ressaltando sua importância para todo o setor.",
      "Nessas discussões, são fornecidos links para leitura adicional, convidando os usuários a se envolverem e obterem uma compreensão mais completa da situação."
    ],
    "points": 169,
    "commentCount": 3,
    "retryCount": 0,
    "time": 1695996664
  },
  {
    "id": 37705328,
    "title": "Criando uma biblioteca de música sem um SPA",
    "originLink": "https://begin.com/blog/posts/2023-09-28-introducing-enhance-music",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37705328",
    "commentBody": "",
    "originSummary": [
      "A equipe do Enhance desenvolveu o Enhance Music, um aplicativo reprodutor de áudio criado com HTML, CSS e JavaScript mínimo, para demonstrar o potencial das interfaces interativas sem depender de bibliotecas ou estruturas JavaScript.",
      "A equipe detalhou a estrutura, o aprimoramento progressivo e a funcionalidade do aplicativo, como atualizações de propriedades e visualização de formas de onda, em torno de HTMLMediaElement e Web Components, além de abordar fatores como padrões da Web, desempenho e acessibilidade.",
      "Eles também mostraram como lidaram com atributos e limitações de acessibilidade, como o problema de reprodução automática do Safari; incentivaram os leitores a examinar o código-fonte e reconheceram os direitos autorais e a origem do conteúdo na conclusão."
    ],
    "commentSummary": [
      "O tópico envolve uma discussão sobre a criação de bibliotecas de música sem o uso de aplicativos de página única (SPAs), com os participantes expressando preocupações sobre tempos de carregamento mais lentos, recursos limitados de experiência do usuário, dificuldades de navegação e dependência de JavaScript.",
      "Há um debate sobre o uso de JavaScript no desenvolvimento da Web, com alguns buscando mais funcionalidade em HTML, enquanto outros expressam preocupação com os desafios de manter bases de código com grandes árvores de dependência.",
      "Um segmento de usuários discute opções alternativas como o uso de conjuntos de quadros em vez de SPAs e o uso potencial de iframes para troca dinâmica de componentes nos reprodutores de música. As opiniões sobre as vantagens e desvantagens das bibliotecas de música sem SPA variam entre os participantes."
    ],
    "points": 151,
    "commentCount": 58,
    "retryCount": 0,
    "time": 1695999853
  },
  {
    "id": 37709876,
    "title": "O computador soviético foi esquecido por 30 anos [vídeo]",
    "originLink": "https://www.youtube.com/watch?v=lVCS99Zep9w",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37709876",
    "commentBody": "",
    "originSummary": [
      "Os apresentadores de uma série de vídeos restauram e demonstram um computador da era soviética encontrado na zona de exclusão de Chernobyl, discutindo seus recursos e funcionalidades exclusivos.",
      "Eles ilustram os desafios enfrentados durante o processo de restauração, reconhecendo a assistência da comunidade de computação retrô, e apresentam aplicativos de software e jogos antigos no computador ucraniano.",
      "Além da exploração técnica, eles também compartilham experiências pessoais, talvez prometendo um vídeo bônus sobre um artefato histórico que exerça um contexto histórico mais amplo. Eles encerram envolvendo o público com uma chamada à ação padrão do YouTube - pedindo curtidas e assinaturas."
    ],
    "commentSummary": [
      "O artigo traz reminiscências do antigo computador soviético ES-1841, enfatizando seu uso para jogos e codificação, e também discorre sobre outros jogos retrô.",
      "Ele investiga a influência significativa da cibernética na computação soviética, abordando diferentes facetas da história da computação soviética.",
      "A discussão se expande para a tecnologia de computação antiga, conectores em computadores antigos e o jogo Digger, sugerindo o potencial de operar um iPhone em tais sistemas no futuro."
    ],
    "points": 142,
    "commentCount": 56,
    "retryCount": 0,
    "time": 1696020242
  },
  {
    "id": 37705563,
    "title": "Zhu, cofundador da Three Arrows Capital, é preso no aeroporto de Cingapura",
    "originLink": "https://techcrunch.com/2023/09/29/three-arrows-capital-co-founder-zhu-arrested-in-singapore-airport-sentenced-four-months-in-prison/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37705563",
    "commentBody": "",
    "originSummary": [
      "Su Zhu, cofundador da Three Arrows Capital (3AC), foi preso e condenado a quatro meses de prisão em Cingapura devido ao não cumprimento de ordens judiciais em relação à investigação de liquidação do extinto fundo de hedge de criptografia.",
      "Esse desenvolvimento ocorre após o pedido de falência da 3AC em 2022.",
      "A localização do outro cofundador, Kyle Davies, é desconhecida no momento."
    ],
    "commentSummary": [
      "O artigo discute diversos aspectos da criptomoeda, como as implicações da prisão do cofundador de uma empresa de capital e o potencial de valor das stablecoins.",
      "Ele destaca as vulnerabilidades do Bitcoin, vários casos de uso de criptomoedas e faz referência a um cenário histórico de campo de prisioneiros de guerra.",
      "O artigo observa a necessidade de maiores controles no setor de criptografia e destaca que as opiniões sobre as perspectivas futuras e a viabilidade das criptomoedas são variadas."
    ],
    "points": 141,
    "commentCount": 120,
    "retryCount": 0,
    "time": 1696000900
  }
]
