[
  {
    "id": 40496858,
    "title": "المؤسس المشارك ل WordPress يتأمل في 21 عاما من الابتكار والمشاركة المجتمعية",
    "originLink": "https://ma.tt/2024/05/wp21/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40496858",
    "commentBody": "",
    "originSummary": [
      "يتأمل مات ، المؤسس المشارك ل WordPress ، في رحلة المنصة التي استمرت 21 عاما ، مع التركيز على مبادئ مثل البساطة والمحتوى الديناميكي والمشاركة المجتمعية والبنية التحتية القوية للمكونات الإضافية والسمات.",
      "ويشدد على أهمية الحفاظ على هذه العناصر مع الابتكار في الوظائف والتصميم.",
      "يشارك مات حكاية شخصية عن الأيام الأولى ويسلط الضوء على الدور الحاسم لتعليقات المستخدمين في تشكيل WordPress."
    ],
    "commentSummary": [
      "يجادل النقاد بأن التوافق مع الإصدارات السابقة والأساليب القديمة في WordPress يعيق التقدم التقني ، مما يحبط المطورين بتحديات الصيانة والترحيل.",
      "على الرغم من عيوبه ، يظل WordPress مهيمنا بسبب نظامه البيئي الشامل للمكونات الإضافية والسمات ، والتوافق مع الإصدارات السابقة ، ودعم المجتمع ، على الرغم من استمرار مشكلات الأمان والأداء.",
      "يوصى باستخدام بدائل مثل أنظمة إدارة المحتوى المستندة إلى Directus و Astro و Laravel ، حيث يقترح المستخدمون تفسيرات أفضل للميزات والأدوات الأساسية أثناء التثبيت لتحسين قابلية الاستخدام."
    ],
    "points": 409,
    "commentCount": 153,
    "retryCount": 0,
    "time": 1716864029
  },
  {
    "id": 40497106,
    "title": "المجمع الصناعي غير الربحي: الفساد وسوء الإدارة في المدن الأمريكية",
    "originLink": "https://americanaffairsjournal.org/2024/05/the-nonprofit-industrial-complex-and-the-corruption-of-the-american-city/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40497106",
    "commentBody": "",
    "originSummary": [
      "يجادل مقال جوناثان إيرلندا بأن مصطلح \"غير ربحي\" يمكن أن يكون مضللا ، وغالبا ما يخفي سوء السلوك والفساد داخل هذه المنظمات.",
      "يقدم أمثلة مثل TODCO في سان فرانسيسكو والمنظمات غير الربحية في سياتل ، ويسلط الضوء على قضايا مثل زيادة الأجور التنفيذية ، وجهود الضغط ، وممارسات التوظيف التي تؤدي إلى العودة إلى الإجرام.",
      "تنتقد أيرلندا عدم الكفاءة والتكاليف المرتفعة للاستعانة بمصادر خارجية للخدمات الحكومية للمنظمات غير الربحية ، مما يشير إلى أن القضايا الحضرية مثل التشرد ومخاطر الصحة العامة تتفاقم بسبب الافتقار إلى التدخل والرقابة الحكومية الفعالة."
    ],
    "commentSummary": [
      "ينتقد المقال بعض المنظمات غير الربحية ، باستخدام \"مشروع الحرية\" في سياتل كدراسة حالة ، ويستكشف النقاش حول ما إذا كان تشويه سمعة الأفراد بسبب جرائم الماضي يشكل تشهيرا.",
      "يناقش أصول وتأثير قوانين التشهير والقذف ، ودور المنظمات غير الربحية في السياسة العامة ، والحاجة إلى الشفافية والمساءلة في العمليات غير الربحية.",
      "يقارن النص نموذج \"الإسكان أولا\" الناجح في فنلندا مع تنفيذه الأقل فعالية في سان فرانسيسكو ، ويقيم القدرة على تحمل تكاليف الإسكان من خلال نماذج مختلفة ، بما في ذلك الإسكان الاجتماعي وإصلاحات تقسيم المناطق."
    ],
    "points": 246,
    "commentCount": 210,
    "retryCount": 0,
    "time": 1716867509
  },
  {
    "id": 40497623,
    "title": "لماذا يفشل تقدير البرامج: الواقع اللوغاريتمي الطبيعي لمهام التطوير",
    "originLink": "https://hiandrewquinn.github.io/til-site/posts/doing-is-normally-distributed-learning-is-log-normal/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40497623",
    "commentBody": "",
    "originSummary": [
      "يسلط المقال الضوء على تحديات تقدير البرمجيات ، مشيرا إلى أن إدارة المشاريع التقليدية غالبا ما تفترض بشكل غير صحيح أن المهام تتبع التوزيع الطبيعي.",
      "في الواقع ، غالبا ما تتبع مهام تطوير البرامج توزيعا طبيعيا للسجل ، حيث تكون الانحرافات الكبيرة شائعة بسبب الطبيعة غير المتوقعة للتعلم في الوقت المناسب.",
      "يؤكد المقال على أهمية الخبرة ذات الصلة ومعرفة الأدوات المحددة في التوظيف ، حيث يمكن أن يختلف تعلم أدوات جديدة بشكل كبير في الوقت والتكلفة ، مما يجعل التقدير الدقيق للجدول الزمني أمرا صعبا."
    ],
    "commentSummary": [
      "تسلط المناقشة الضوء على التحديات الاحتمالية في تقدير مشروع البرمجيات ، ولا سيما الاختلافات بين التوزيعات العادية واللوغاريتمية العادية في تنفيذ المهام والتعلم.",
      "ينتقد أساليب إدارة المشاريع التقليدية ، مع التركيز على إساءة استخدام منهجيات Agile وأهمية التقدير الدقيق على الرغم من عدم اليقين.",
      "تستكشف المحادثة الاختلافات بين أنماط الاكتشاف والهندسة في إدارة المشاريع ، وضرورة التطوير التكراري ، والأهمية الدائمة ل \"شهر الرجل الأسطوري\" لفريد بروكس."
    ],
    "points": 225,
    "commentCount": 69,
    "retryCount": 0,
    "time": 1716874349
  },
  {
    "id": 40496150,
    "title": "gh-dash: لوحة معلومات GitHub CLI القابلة للتخصيص للعلاقات العامة والمشكلات",
    "originLink": "https://github.com/dlvhdr/gh-dash",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40496150",
    "commentBody": "",
    "originSummary": [
      "** gh-dash ** هو امتداد GitHub CLI يقدم لوحة معلومات قابلة للتخصيص لإدارة طلبات السحب (PRs) والمشكلات.",
      "تشمل الميزات الرئيسية الأقسام القابلة للتكوين وخيارات البحث والتخصيص والسمات والتخطيطات وطرق العرض التفصيلية والتكوينات المتعددة وفترات التحديث التلقائي.",
      "خطوات التثبيت: قم بتثبيت GitHub CLI (v2.0.0+) ، وقم بتثبيت الامتداد باستخدام \"gh extension install dlvhdr / gh-dash\" ، وقم بتثبيت خط Nerd لعرض الرمز."
    ],
    "commentSummary": [
      "تسلط المناقشة الضوء على \"Gh-dash\" ، وهي لوحة معلومات CLI ل GitHub بواسطة dlvhdr ، مع التركيز على الاتجاه المتزايد نحو واجهات مستخدم النص المصممة جيدا (TUIs) وكفاءة أدوات واجهة سطر الأوامر (CLI) عبر واجهات الويب.",
      "يعبر المستخدمون عن اهتمامهم بميزات مثل طرق العرض على مستوى المؤسسة والحلول المستضافة ذاتيا لإدارة المستودعات عبر الأنظمة الأساسية مثل GitHub وGitLab وAzure DevOps.",
      "تغطي المحادثة أيضا المفارقة المتمثلة في إنشاء CLI لأداة قائمة على الويب ، وأهمية المرونة واللامركزية في التكنولوجيا ، والمناقشات حول قابلية استخدام TUIs دون تثبيت خطوط إضافية ، بما في ذلك استخدام Nerd Fonts وأدوات مثل Wezterm."
    ],
    "points": 214,
    "commentCount": 55,
    "retryCount": 0,
    "time": 1716855927
  },
  {
    "id": 40495149,
    "title": "تكشف الدراسة أن المحولات تظهر قدرات التفكير الضمني من خلال اللمس",
    "originLink": "https://arxiv.org/abs/2405.15071",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40495149",
    "commentBody": "",
    "originSummary": [
      "تستكشف ورقة \"Grokked Transformers are Implicit Reasoners\" ما إذا كان بإمكان المحولات التفكير ضمنيا على المعرفة البارامترية ، مع التركيز على أنواع التفكير في التركيب والمقارنة.",
      "تشير النتائج إلى أن المتحولين يمكنهم تعلم التفكير الضمني من خلال التدريب المكثف الذي يتجاوز الإفراط في التجهيز ، والمعروف باسم grokking ، لكن قدرتهم على التعميم تختلف: فهم يكافحون مع التكوين ولكنهم ينجحون في المقارنة في أمثلة خارج التوزيع.",
      "تقترح الدراسة تحسينات في إعدادات البيانات والتدريب ، والتحسينات المعمارية المحتملة مثل مشاركة المعرفة عبر الطبقات ، وتظهر أن المحولات التي تم تلمسها بالكامل تتفوق على نماذج مثل GPT-4-Turbo و Gemini-1.5-Pro في مهام التفكير المعقدة."
    ],
    "commentSummary": [
      "تؤكد المناقشة على أهمية الذكاء الاصطناعي النماذج التي تعمم بدلا من الحفظ ، وتنتقد الاتجاه الحالي لتفضيل الحفظ بسبب الحوافز الاقتصادية.",
      "تقترح الورقة تقنيات مثل تسوس الوزن الأقوى لمعاقبة الحفظ وتسلط الضوء على الحاجة إلى مطالبات مفصلة في اختبار التفكير المعقد في نماذج اللغة.",
      "كما يقدم التتبع السببي كطريقة لتحليل حسابات النماذج ، موضحا كيف يساعد في نقل النماذج من الحفظ إلى التعميم."
    ],
    "points": 199,
    "commentCount": 53,
    "retryCount": 0,
    "time": 1716847112
  },
  {
    "id": 40494793,
    "title": "علامة التبويب \"المفكرة\": أداة آمنة لتدوين الملاحظات تحفظ الملاحظات في شريط عنوان المتصفح",
    "originLink": "https://notepadtab.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40494793",
    "commentBody": "",
    "originSummary": [
      "Notepad Tab هي أداة لتدوين الملاحظات التي تحفظ الملاحظات مباشرة في شريط عنوان المتصفح وتاريخه، مما يجعلها بسيطة وخاصة.",
      "يمكن للمستخدمين نسخ الملاحظات احتياطيا أو مشاركتها عن طريق نسخ عنوان URL ولصقه ، والاستفادة من JavaScript لاستمرار الملاحظة وضغطها وإلغاء ضغطها بكفاءة.",
      "تؤكد هذه الأداة على الأمان والخصوصية ، مما يضمن تخزين الملاحظات واسترجاعها بكفاءة دون تخزين خارجي."
    ],
    "commentSummary": [
      "تدرس مناقشة Hacker News استضافة تطبيقات الويب الثابتة محليا كبديل لتطبيقات Electron ، مع التركيز على الأمان والتطبيق العملي والتقنيات مثل Redbean و SQLite وعمال الخدمة.",
      "يناقش المستخدمون الحلول المستندة إلى المستعرض مقابل التطبيقات الأصلية لتدوين الملاحظات والتطبيقات خفيفة الوزن ، ويناقشون الدور المتطور للمتصفحات وقيود الأمان الحديثة.",
      "تشمل المخاوف سرقة البيانات ، وحدود طول عناوين URL ، وتلوث سجل المتصفح ، والآثار المترتبة على الخصوصية ، حيث يتبادل المشاركون الخبرات مع التخزين المحلي ، والإشارات المرجعية ، ودفاتر الملاحظات المستندة إلى المتصفح."
    ],
    "points": 176,
    "commentCount": 134,
    "retryCount": 0,
    "time": 1716844540
  },
  {
    "id": 40496967,
    "title": "تكشف مستندات واجهة برمجة تطبيقات بحث Google المسربة عن عوامل الترتيب المخفية وممارسات البيانات",
    "originLink": "https://sparktoro.com/blog/an-anonymous-source-shared-thousands-of-leaked-google-search-api-documents-with-me-everyone-in-seo-should-see-them/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40496967",
    "commentBody": "",
    "originSummary": [
      "تكشف مستندات واجهة برمجة تطبيقات بحث Google المسربة ، التي تم التحقق منها من قبل موظفي Google السابقين ، عن استخدام إشارات المستخدم التي تركز على النقر ، واعتبارات النطاق الفرعي المنفصلة ، وصندوق رمل لمواقع الويب الجديدة ، مما يتناقض مع بيانات Google العامة.",
      "تفصل المستندات نظاما يسمى \"NavBoost\" ، والذي يستخدم بيانات تدفق النقر من شريط أدوات Google و Chrome لتحسين نتائج البحث ، ومناقشة العقوبات المفروضة على نطاقات المطابقة التامة ، وبيانات النقر على المبارزة الجغرافية ، والقوائم البيضاء أثناء الأحداث المهمة.",
      "يتضمن التسريب ، على الأرجح من التعرض العام العرضي على GitHub ، أكثر من 2,500 صفحة من الوثائق الداخلية ، مما يسلط الضوء على ممارسات جمع البيانات المكثفة ويشير إلى أن Google تفضل العلامات التجارية الكبرى على المواقع الأصغر في تصنيفاتها."
    ],
    "commentSummary": [
      "تؤكد مستندات واجهة برمجة تطبيقات بحث Google المسربة على GitHub تتبع المستخدم على نطاق واسع من خلال Chrome ، مما يثير مخاوف كبيرة تتعلق بالخصوصية.",
      "تسلط المناقشات على Reddit الضوء على الشكوك تجاه دوافع Google ، وتقترح إجراءات مدفوعة بالربح بدلا من فوائد المستخدم ، وتناقش فعالية الأطر التنظيمية مثل DMA و GDPR.",
      "يعبر المستخدمون عن عدم ثقتهم تجاه شركات التكنولوجيا ، وينتقدون هيمنة Chrome ، ويظهرون اهتماما بالبدائل التي تركز على الخصوصية مثل Firefox ، بينما يثيرون أيضا مخاوف بشأن تعامل Rand Fishkin مع هوية مصدر مجهول في تسريبات."
    ],
    "points": 175,
    "commentCount": 71,
    "retryCount": 0,
    "time": 1716865651
  },
  {
    "id": 40501027,
    "title": "Mobifree: النظام البيئي للجوال مفتوح المصدر يتحدى هيمنة التكنولوجيا الكبرى",
    "originLink": "https://f-droid.org/2024/05/24/mobifree.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40501027",
    "commentBody": "",
    "originSummary": [
      "Mobifree هو نظام بيئي مفتوح المصدر للجوال مصمم لتقديم بديل لشركات التكنولوجيا الكبرى مثل Apple و Google ، مع التركيز على الخصوصية والديمقراطية والممارسات الأخلاقية.",
      "يتضمن النظام البيئي أنظمة التشغيل ومتاجر التطبيقات والخدمات السحابية ، مع مساهمة F-Droid في نظام توزيع التطبيقات اللامركزي الذي يعزز المنافسة واختيار المستخدم.",
      "بدعم من قانون الأسواق الرقمية للاتحاد الأوروبي ومنحة Horizon Europe ، تهدف Mobifree إلى إنشاء تجربة جوال عادلة ومستدامة وشاملة ، وتشجيع مشاركة المجتمع لتحدي هيمنة شركات التكنولوجيا الكبرى."
    ],
    "commentSummary": [
      "يواجه F-Droid ، وهو مستودع تطبيقات مفتوح المصدر ، تحديات في أن يصبح بديلا سائدا لمتجر Google Play بسبب ضعف وظائف البحث واستبعاد التطبيقات الاحتكارية ، مما يحد من جاذبيته للتطبيقات الأساسية مثل الخدمات المصرفية.",
      "تغطي المناقشة التحديات الأخلاقية والتمويلية بين البرمجيات الاحتكارية والمفتوحة المصدر ، والتعقيدات في تطوير الألعاب ، والصعوبات في توزيع التطبيقات خارج المنصات الرئيسية.",
      "على الرغم من هذه المشكلات ، يعد F-Droid ذا قيمة للتطبيقات المقيدة بسياسات Google ، وتستكشف المحادثة أنظمة توزيع التطبيقات اللامركزية ، ولوائح الاتحاد الأوروبي بشأن التكنولوجيا الكبيرة ، والمخاوف البيئية المتعلقة بعمر الهواتف الذكية."
    ],
    "points": 164,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1716906264
  },
  {
    "id": 40502090,
    "title": "إعادة إنتاج نموذج GPT-2 في 90 دقيقة مقابل 20 دولارا باستخدام llm.c",
    "originLink": "https://twitter.com/karpathy/status/1795484547267834137",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40502090",
    "commentBody": "",
    "originSummary": [
      "قام Andrej Karpathy بالتغريد حول إعادة إنتاج أصغر طراز GPT-2 بنجاح (معلمات 124M) باستخدام llm.c في 90 دقيقة فقط بتكلفة 20 دولارا.",
      "أصبح نموذج GPT-2 ، الذي تم إصداره في الأصل بواسطة OpenAI في عام 2019 ، متاحا الآن للأفراد ذوي موارد GPU المحدودة ، مما يجعل الذكاء الاصطناعي المتقدمة أكثر ديمقراطية.",
      "يسلط هذا الإنجاز الضوء على إمكانية استنساخ نموذج الذكاء الاصطناعي الفعال من حيث التكلفة والكفاءة ، وتوسيع نطاق الوصول إلى أدوات الذكاء الاصطناعي القوية."
    ],
    "commentSummary": [
      "يقوم Andrej Karpathy بتطوير \"llm.c\" ، وهو الحد الأدنى من تطبيق C / CUDA ل GPT-2 ، مع التركيز على القيمة الجمالية والتعليمية.",
      "رمز C / CUDA الحالي أسرع بنسبة 6٪ تقريبا من PyTorch ، مع وجود مجال لمزيد من التحسين ، بهدف تبسيط عملية التدريب على غرار nanoGPT من PyTorch.",
      "يخطط كارباثي لإصدار سلسلة فيديو حول هذا المشروع ، ومناقشة التحسينات المعمارية المحتملة والتحديات في الوصول إلى مجموعات البيانات الكبيرة ، مما يولد اهتماما كبيرا من المجتمع."
    ],
    "points": 161,
    "commentCount": 36,
    "retryCount": 0,
    "time": 1716911926
  },
  {
    "id": 40501021,
    "title": "مخدد: تطبيق مجاني لمعايرة القرص الدوار باستخدام ميكروفون هاتفك",
    "originLink": "https://grooved.okat.best/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40501021",
    "commentBody": "",
    "originSummary": [
      "أنشأ إيفان تطبيقا مجانيا يسمى Grooved ، والذي يمكن المستخدمين من معايرة الأقراص الدوارة الخاصة بهم باستخدام ميكروفون هواتفهم ، مما يلغي الحاجة إلى المواد المطبوعة أو وضع الهاتف على الطبق.",
      "يتوفر Grooved حاليا على متجر التطبيقات ، مع إصدار Android المتوقع في يونيو.",
      "يسعى إيفان للحصول على تعليقات المستخدمين وقد شارك رابطا تجريبيا على Twitter."
    ],
    "commentSummary": [
      "أصدر أحد المطورين تطبيقا مجانيا يسمى Grooved ، والذي يستخدم ميكروفون الهاتف لمعايرة سرعة القرص الدوار دون مواد إضافية أو وضع الهاتف على الطبق.",
      "تم الإشادة بالتطبيق ، المتاح على App Store مع إصدار Android المتوقع ، لبساطته وفعاليته في اكتشاف مشكلات سرعة القرص الدوار وتصحيحها.",
      "يقدر المستخدمون تصميم التطبيق الذي يركز على الخصوصية ، على الرغم من أن المطور متردد في جعله مفتوح المصدر بسبب سوء الاستخدام المحتمل."
    ],
    "points": 159,
    "commentCount": 117,
    "retryCount": 0,
    "time": 1716906208
  },
  {
    "id": 40503202,
    "title": "تقدم مكتبة تأثيرات النص المرئي أنماطا متنوعة للرسوم المتحركة لشاشات اللوحة القماشية",
    "originLink": "https://chrisbuilds.github.io/terminaltexteffects/showroom/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40503202",
    "commentBody": "",
    "originSummary": [
      "يفصل المستند مكتبة من التأثيرات المرئية المضمنة لعرض النص على لوحة قماشية ، ولكل منها نمط رسوم متحركة فريد.",
      "تتضمن أمثلة هذه التأثيرات أشعة الضوء والمسارات الثنائية والثقوب السوداء والكرات النطاطة والفقاعات والنص المحترق والمزيد.",
      "يأتي كل تأثير مع تكوين مرجعي ووسيطات سطر الأوامر للتخصيص ، مما يسمح بالعروض التقديمية المرئية المخصصة."
    ],
    "commentSummary": [
      "TTE: تأثيرات النص الطرفي هو مشروع يوفر تأثيرات نصية متنوعة للمخرجات الطرفية ، ويتلقى تعليقات إيجابية من المستخدم.",
      "يقدر المستخدمون إبداعها وحنينها إلى الماضي ، حيث يرون الاستخدامات المحتملة لتحميل الشاشات أو تسليط الضوء على الأخطاء في السجلات ، على الرغم من أن البعض يحذر من استخدامها في الإنتاج.",
      "تمت الإشادة بالمشروع لتحسين مخرجات CLI (واجهة سطر الأوامر) ووظائفها كمكتبة Python ، مع مقارنات بأدوات مماثلة في Emacs ولغات البرمجة الأخرى."
    ],
    "points": 145,
    "commentCount": 16,
    "retryCount": 0,
    "time": 1716917508
  },
  {
    "id": 40501739,
    "title": "تظهر المستندات المسربة أن الرئيس التنفيذي لشركة OpenAI سام ألتمان ضغط على الموظفين السابقين باتفاقيات تقييدية",
    "originLink": "https://futurism.com/sam-altman-silencing-former-employees",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40501739",
    "commentBody": "",
    "originSummary": [
      "تشير الوثائق المسربة إلى أن الرئيس التنفيذي لشركة OpenAI سام ألتمان ضغط على الموظفين المغادرين لتوقيع اتفاقيات تقييدية من خلال التهديد باستعادة أسهمهم المكتسبة ، وهي ممارسة نادرة في وادي السيليكون.",
      "على الرغم من اعتذار ألتمان العلني ومزاعم الجهل، تظهر الأدلة أنه وقع على وثائق تجيز هذه الأحكام، مما أدى إلى خروج تنفيذي كبير وقضايا قانونية.",
      "الجدل ، بما في ذلك الخلاف مع الممثلة سكارليت جوهانسون حول الاستخدام غير المصرح به لصوتها ، يقوض مصداقية OpenAI ويتناقض مع مهمتها المتمثلة في الشفافية وإفادة البشرية."
    ],
    "commentSummary": [
      "تظهر الوثائق المسربة من OpenAI وعي الرئيس التنفيذي سام ألتمان بالجهود المبذولة لإسكات الموظفين السابقين من خلال اتفاقيات صارمة ، مما يثير مخاوف أخلاقية.",
      "ويدور الجدل حول مصطلح \"قاسية\" فيما يتعلق بالضغط لتوقيع العقود تحت تهديد فقدان الفوائد، مع توقيع ألتمان الذي يؤكد هذه الممارسات.",
      "يسلط الجدل ، بما في ذلك اتهامات بالإثارة ضد مقال Vox ، الضوء على الانحرافات عن معايير وادي السيليكون ، مما قد يضر بالثقة وتوظيف المواهب في المستقبل."
    ],
    "points": 141,
    "commentCount": 50,
    "retryCount": 0,
    "time": 1716910389
  },
  {
    "id": 40498092,
    "title": "Gleam 1.2.0 يعزز التسامح مع الأخطاء وتجربة المطور",
    "originLink": "https://gleam.run/news/fault-tolerant-gleam/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40498092",
    "commentBody": "",
    "originSummary": [
      "أصدرت Gleam ، وهي لغة آمنة للنوع وقابلة للتطوير لأوقات تشغيل Erlang VM و JavaScript ، الإصدار 1.2.0 ، مع التركيز على تحسين خادم اللغة وتجربة المطور.",
      "تتضمن التحديثات الرئيسية التحويل البرمجي المتسامح مع الأخطاء ، والإكمال التلقائي لبيان الاستيراد بشكل أفضل ، وخطوط الأنابيب أحادية السطر في منسق التعليمات البرمجية ، ورسائل الخطأ المكررة ، والإصلاح التلقائي لمطابقة الأنماط الزائدة.",
      "تساعد رسالة خطأ جديدة مبرمجي JavaScript على تصحيح استخدام \"===\" إلى \"==\" ، ويقر الإصدار بمساهمات العديد من المطورين ، مما يشجع على رعاية التطوير المستمر."
    ],
    "commentSummary": [
      "يعمل إصدار Gleam 1.2.0 على تحسين التسامح مع الأخطاء وتجربة المطور ، ويتميز ببناء جملة حديث ونظام نوع Hindley-Milner قوي.",
      "يجمع Gleam إلى كل من Beam VM وجافا سكريبت من Erlang ، مما يوفر أداء جيدا ويقارن ب Elixir ، الذي يتجه نحو الكتابة التدريجية.",
      "يدعم المجتمع النشط مشاريع مثل إطار عمل الواجهة الأمامية Lustre وتطبيق الويب Nestful ، على الرغم من أن بعض المستخدمين يجدون أن الوثائق تفتقر إلى مناطق أمان النوع والتزامن."
    ],
    "points": 140,
    "commentCount": 48,
    "retryCount": 0,
    "time": 1716879335
  },
  {
    "id": 40502956,
    "title": "Openkoda: منصة مفتوحة المصدر لتطوير تطبيقات الأعمال بسرعة",
    "originLink": "https://github.com/openkoda/openkoda",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40502956",
    "commentBody": "",
    "originSummary": [
      "Openkoda عبارة عن منصة تطوير تهدف إلى تسريع إنشاء تطبيقات الأعمال والأدوات الداخلية من خلال توفير وظائف مسبقة الصنع وميزات خارج الصندوق.",
      "وهو يدعم الكيانات الديناميكية ، ونماذج متعددة الإيجارات ، ويستخدم تقنيات مألوفة مثل Java و Spring Boot و JavaScript و HTML و Hibernate و PostgreSQL ، مما يسمح بالتخصيص والتكامل الشاملين.",
      "Openkoda مفتوح المصدر بموجب ترخيص معهد ماساتشوستس للتكنولوجيا ، ويتضمن ميزات مثل إدارة المستخدم ، ونظام إدارة المحتوى ، وجدولة الوظائف ، ويقدم خدمات سحابية مدارة لسهولة النشر والتوسع."
    ],
    "commentSummary": [
      "Openkoda عبارة عن منصة مفتوحة المصدر لبناء تطبيقات الأعمال الأساسية ، حيث تقدم ملكية كاملة لشفرة المصدر وتجنب القيود التجارية ، على عكس Salesforce.",
      "تتم مقارنته ب FOSS (البرمجيات الحرة والمفتوحة المصدر) ERPs الأخرى مثل Odoo ، ولكن مع مخاوف أقل بشأن تحقيق الدخل ، وينظر إليه على أنه بديل فعال من حيث التكلفة ل Salesforce.",
      "يستخدم Openkoda Java لأدائه ونظامه البيئي الناضج ، على الرغم من المناقشات حول إسهابه ، ويوفر صور Docker لتسهيل التكامل للمؤسسات غير التابعة ل Java."
    ],
    "points": 138,
    "commentCount": 53,
    "retryCount": 0,
    "time": 1716916316
  }
]
