[
  {
    "id": 40496858,
    "title": "வேர்ட்பிரஸ் இணை நிறுவனர் 21 ஆண்டுகள் கண்டுபிடிப்பு மற்றும் சமூக ஈடுபாட்டை பிரதிபலிக்கிறது",
    "originLink": "https://ma.tt/2024/05/wp21/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40496858",
    "commentBody": "",
    "originSummary": [
      "வேர்ட்பிரஸ் இணை நிறுவனர் மாட் தளத்தின் 21 ஆண்டு பயணத்தை பிரதிபலிக்கிறது, எளிமை, மாறும் உள்ளடக்கம், சமூக ஈடுபாடு மற்றும் செருகுநிரல்கள் மற்றும் கருப்பொருள்களுக்கான வலுவான உள்கட்டமைப்பு போன்ற கொள்கைகளை வலியுறுத்துகிறது.",
      "செயல்பாடு மற்றும் வடிவமைப்பில் புதுமைப்படுத்தும் போது இந்த கூறுகளை பராமரிப்பதன் முக்கியத்துவத்தை அவர் வலியுறுத்துகிறார்.",
      "மாட் ஆரம்ப நாட்களைப் பற்றிய ஒரு தனிப்பட்ட நிகழ்வைப் பகிர்ந்து கொள்கிறார் மற்றும் வேர்ட்பிரஸ் வடிவமைப்பதில் பயனர் கருத்துக்களின் முக்கிய பங்கை எடுத்துக்காட்டுகிறது."
    ],
    "commentSummary": [
      "விமர்சகர்கள் வாதிடுகின்றனர் வேர்ட்பிரஸ் பின்தங்கிய பொருந்தக்கூடிய தன்மை மற்றும் காலாவதியான முறைகள் தொழில்நுட்ப முன்னேற்றத்தைத் தடுக்கின்றன, பராமரிப்பு மற்றும் இடம்பெயர்வு சவால்களுடன் டெவலப்பர்களை விரக்தியடையச் செய்கின்றன.",
      "அதன் குறைபாடுகள் இருந்தபோதிலும், வேர்ட்பிரஸ் அதன் விரிவான சொருகி மற்றும் தீம் சுற்றுச்சூழல் அமைப்பு, பின்தங்கிய பொருந்தக்கூடிய தன்மை மற்றும் சமூக ஆதரவு காரணமாக ஆதிக்கம் செலுத்துகிறது, இருப்பினும் பாதுகாப்பு மற்றும் செயல்திறன் சிக்கல்கள் நீடிக்கின்றன.",
      "Directus, Astro மற்றும் Laravel அடிப்படையிலான CMS கள் போன்ற மாற்றுகள் பரிந்துரைக்கப்படுகின்றன, பயன்பாட்டினை மேம்படுத்த நிறுவலின் போது பயனர்கள் சிறந்த அம்ச விளக்கங்கள் மற்றும் அத்தியாவசிய கருவிகளை பரிந்துரைக்கின்றனர்."
    ],
    "points": 409,
    "commentCount": 153,
    "retryCount": 0,
    "time": 1716864029
  },
  {
    "id": 40497106,
    "title": "இலாப நோக்கற்ற தொழில்துறை வளாகம்: அமெரிக்க நகரங்களில் ஊழல் மற்றும் தவறான நிர்வாகம்",
    "originLink": "https://americanaffairsjournal.org/2024/05/the-nonprofit-industrial-complex-and-the-corruption-of-the-american-city/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40497106",
    "commentBody": "",
    "originSummary": [
      "ஜொனாதன் அயர்லாந்தின் கட்டுரை \"இலாப நோக்கற்ற\" என்ற சொல் தவறாக வழிநடத்தக்கூடும் என்று வாதிடுகிறது, பெரும்பாலும் இந்த அமைப்புகளுக்குள் தவறான நடத்தை மற்றும் ஊழலை மறைக்கிறது.",
      "சான் பிரான்சிஸ்கோவின் டோட்கோ மற்றும் சியாட்டிலின் இலாப நோக்கற்ற நிறுவனங்கள் போன்ற எடுத்துக்காட்டுகளை அவர் வழங்குகிறார், அதிகரித்த நிர்வாக ஊதியம், பரப்புரை முயற்சிகள் மற்றும் மறுபரிசீலனைக்கு வழிவகுக்கும் பணியமர்த்தல் நடைமுறைகள் போன்ற சிக்கல்களை முன்னிலைப்படுத்துகிறார்.",
      "அரசாங்க சேவைகளை இலாப நோக்கற்ற நிறுவனங்களுக்கு அவுட்சோர்சிங் செய்வதில் திறமையின்மை மற்றும் அதிக செலவுகள் ஆகியவற்றை அயர்லாந்து விமர்சிக்கிறது, வீடற்ற நிலை மற்றும் பொது சுகாதார அபாயங்கள் போன்ற நகர்ப்புற பிரச்சினைகள் திறமையான அரசாங்க தலையீடு மற்றும் மேற்பார்வை இல்லாததால் அதிகரிக்கின்றன என்று கூறுகிறது."
    ],
    "commentSummary": [
      "சியாட்டிலின் \"ஃப்ரீடம் ப்ராஜெக்ட்\" ஐ ஒரு வழக்கு ஆய்வாகப் பயன்படுத்தி, சில இலாப நோக்கற்ற நிறுவனங்களை இந்த கட்டுரை விமர்சிக்கிறது, மேலும் கடந்த கால குற்றங்களுக்காக தனிநபர்களை இழிவுபடுத்துவது அவதூறாக இருக்கிறதா என்ற விவாதத்தை ஆராய்கிறது.",
      "இது அவதூறு மற்றும் அவதூறு சட்டங்களின் தோற்றம் மற்றும் தாக்கம், பொதுக் கொள்கையில் இலாப நோக்கற்ற நிறுவனங்களின் பங்கு மற்றும் இலாப நோக்கற்ற செயல்பாடுகளில் வெளிப்படைத்தன்மை மற்றும் பொறுப்புக்கூறலின் தேவை பற்றி விவாதிக்கிறது.",
      "இந்த உரை பின்லாந்தின் வெற்றிகரமான \"வீட்டுவசதி முதல்\" மாதிரியை சான் பிரான்சிஸ்கோவில் அதன் குறைவான செயல்திறன் கொண்ட செயல்படுத்தலுடன் வேறுபடுத்துகிறது, மேலும் சமூகமயமாக்கப்பட்ட வீட்டுவசதி மற்றும் மண்டல சீர்திருத்தங்கள் உள்ளிட்ட பல்வேறு மாதிரிகள் மூலம் வீட்டுவசதி மலிவை மதிப்பிடுகிறது."
    ],
    "points": 246,
    "commentCount": 210,
    "retryCount": 0,
    "time": 1716867509
  },
  {
    "id": 40497623,
    "title": "மென்பொருள் மதிப்பீடு ஏன் தோல்வியடைகிறது: வளர்ச்சிப் பணிகளின் பதிவு-இயல்பான யதார்த்தம்",
    "originLink": "https://hiandrewquinn.github.io/til-site/posts/doing-is-normally-distributed-learning-is-log-normal/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40497623",
    "commentBody": "",
    "originSummary": [
      "கட்டுரை மென்பொருள் மதிப்பீட்டின் சவால்களை எடுத்துக்காட்டுகிறது, பாரம்பரிய திட்ட மேலாண்மை பெரும்பாலும் ஒரு சாதாரண விநியோகத்தைப் பின்பற்றும் பணிகளை தவறாக கருதுகிறது என்பதைக் குறிப்பிடுகிறது.",
      "உண்மையில், மென்பொருள் மேம்பாட்டுப் பணிகள் பெரும்பாலும் பதிவு-இயல்பான விநியோகத்தைப் பின்பற்றுகின்றன, அங்கு சரியான நேரத்தில் கற்றலின் கணிக்க முடியாத தன்மை காரணமாக குறிப்பிடத்தக்க விலகல்கள் பொதுவானவை.",
      "புதிய கருவிகளைக் கற்றுக்கொள்வது நேரம் மற்றும் செலவில் பரவலாக மாறுபடும் என்பதால், பணியமர்த்தலில் தொடர்புடைய அனுபவம் மற்றும் குறிப்பிட்ட கருவி அறிவின் முக்கியத்துவத்தை கட்டுரை வலியுறுத்துகிறது, இது துல்லியமான காலவரிசை மதிப்பீட்டை கடினமாக்குகிறது."
    ],
    "commentSummary": [
      "விவாதம் மென்பொருள் திட்ட மதிப்பீட்டில் உள்ள நிகழ்தகவு சவால்களை எடுத்துக்காட்டுகிறது, குறிப்பாக பணி செயல்படுத்தல் மற்றும் கற்றலில் சாதாரண மற்றும் பதிவு-சாதாரண விநியோகங்களுக்கு இடையிலான வேறுபாடுகள்.",
      "இது பாரம்பரிய திட்ட மேலாண்மை முறைகளை விமர்சிக்கிறது, சுறுசுறுப்பான முறைகளின் தவறான பயன்பாடு மற்றும் நிச்சயமற்ற தன்மை இருந்தபோதிலும் துல்லியமான மதிப்பீட்டின் முக்கியத்துவத்தை வலியுறுத்துகிறது.",
      "இந்த உரையாடல் திட்ட நிர்வாகத்தில் டிஸ்கவரி மற்றும் பொறியியல் முறைகளுக்கு இடையிலான வேறுபாடுகள், மறுசெயல் வளர்ச்சியின் அவசியம் மற்றும் ஃப்ரெட் ப்ரூக்ஸின் \"தி மித்திகல் மேன்-மன்த்\" இன் நீடித்த பொருத்தத்தை ஆராய்கிறது."
    ],
    "points": 225,
    "commentCount": 69,
    "retryCount": 0,
    "time": 1716874349
  },
  {
    "id": 40496150,
    "title": "gh-dash: PRகள் மற்றும் சிக்கல்களுக்கான தனிப்பயனாக்கக்கூடிய GitHub CLI டாஷ்போர்டு",
    "originLink": "https://github.com/dlvhdr/gh-dash",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40496150",
    "commentBody": "",
    "originSummary": [
      "**gh-dash** என்பது GitHub CLI நீட்டிப்பாகும், இது இழு கோரிக்கைகள் (PRகள்) மற்றும் சிக்கல்களை நிர்வகிப்பதற்கான தனிப்பயனாக்கக்கூடிய டாஷ்போர்டை வழங்குகிறது.",
      "முக்கிய அம்சங்களில் கட்டமைக்கக்கூடிய பிரிவுகள், தேடல் மற்றும் தனிப்பயனாக்குதல் விருப்பங்கள், கருப்பொருள்கள் மற்றும் தளவமைப்புகள், விரிவான காட்சிகள், பல உள்ளமைவுகள் மற்றும் தானாக புதுப்பிப்பு இடைவெளிகள் ஆகியவை அடங்கும்.",
      "நிறுவல் படிகள்: GitHub CLI (v2.0.0+) ஐ நிறுவி, 'gh extension install dlvhdr/gh-dash' உடன் நீட்டிப்பை நிறுவி, ஐகான் ரெண்டரிங்கிற்கான Nerd எழுத்துருவை நிறுவவும்."
    ],
    "commentSummary": [
      "விவாதம் \"Gh-dash,\" dlvhdr மூலம் GitHub க்கான CLI டாஷ்போர்டை எடுத்துக்காட்டுகிறது, இது நன்கு வடிவமைக்கப்பட்ட உரை பயனர் இடைமுகங்கள் (TUIs) மற்றும் இணைய இடைமுகங்களில் கட்டளை-வரி இடைமுகம் (CLI) கருவிகளின் செயல்திறனை நோக்கி வளர்ந்து வரும் போக்கை வலியுறுத்துகிறது.",
      "GitHub, GitLab மற்றும் Azure DevOps போன்ற தளங்களில் களஞ்சியங்களை நிர்வகிப்பதற்கான நிறுவன அளவிலான காட்சிகள் மற்றும் சுய-ஹோஸ்ட் செய்யப்பட்ட தீர்வுகள் போன்ற அம்சங்களில் பயனர்கள் ஆர்வத்தை வெளிப்படுத்துகின்றனர்.",
      "இணைய அடிப்படையிலான கருவிக்கு CLI ஐ உருவாக்குவதன் முரண்பாடு, தொழில்நுட்பத்தில் நெகிழ்வுத்தன்மை மற்றும் பரவலாக்கத்தின் முக்கியத்துவம் மற்றும் Nerd எழுத்துருக்கள் மற்றும் Wezterm போன்ற கருவிகளின் பயன்பாடு உட்பட கூடுதல் எழுத்துரு நிறுவல்கள் இல்லாமல் TUI களின் பயன்பாட்டினை பற்றிய விவாதங்களையும் உரையாடல் உள்ளடக்கியது."
    ],
    "points": 214,
    "commentCount": 55,
    "retryCount": 0,
    "time": 1716855927
  },
  {
    "id": 40495149,
    "title": "மின்மாற்றிகள் மறைமுக பகுத்தறிவு திறன்களை க்ரோக்கிங் மூலம் காட்டுகின்றன, ஆய்வில் அம்பலம்",
    "originLink": "https://arxiv.org/abs/2405.15071",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40495149",
    "commentBody": "",
    "originSummary": [
      "\"Grokked Transformers are Implicit Reasoners\" என்ற கட்டுரை மின்மாற்றிகள் அளவுரு அறிவை விட மறைமுகமாக பகுத்தறிவு செய்ய முடியுமா என்பதை ஆராய்கிறது, கலவை மற்றும் ஒப்பீட்டு பகுத்தறிவு வகைகளில் கவனம் செலுத்துகிறது.",
      "கண்டுபிடிப்புகள் மின்மாற்றிகள் க்ரோக்கிங் எனப்படும் மிகைப்படுத்தலுக்கு அப்பாற்பட்ட விரிவான பயிற்சியின் மூலம் மறைமுக பகுத்தறிவைக் கற்றுக்கொள்ள முடியும் என்று குறிப்பிடுகின்றன, ஆனால் அவற்றின் பொதுமைப்படுத்தல் திறன் மாறுபடும்: அவை கலவையுடன் போராடுகின்றன, ஆனால் விநியோகத்திற்கு வெளியே உள்ள எடுத்துக்காட்டுகளில் ஒப்பீட்டுடன் வெற்றி பெறுகின்றன.",
      "தரவு மற்றும் பயிற்சி அமைப்புகளில் மேம்பாடுகள், குறுக்கு-அடுக்கு அறிவுப் பகிர்வு போன்ற சாத்தியமான கட்டடக்கலை மேம்பாடுகளை ஆய்வு பரிந்துரைக்கிறது, மேலும் சிக்கலான பகுத்தறிவுப் பணிகளில் GPT-4-Turbo மற்றும் Gemini-1.5-Pro போன்ற மாடல்களை முழுமையாக க்ரோக் செய்யப்பட்ட மின்மாற்றிகள் சிறப்பாக செயல்படுகின்றன என்பதைக் காட்டுகிறது."
    ],
    "commentSummary": [
      "இந்த விவாதம் மனப்பாடம் செய்வதை விட பொதுமைப்படுத்தும் AI மாதிரிகளின் முக்கியத்துவத்தை வலியுறுத்துகிறது, பொருளாதார ஊக்கத்தொகைகள் காரணமாக மனப்பாடம் செய்வதை ஆதரிக்கும் தற்போதைய போக்கை விமர்சிக்கிறது.",
      "மனப்பாடம் செய்வதைத் தண்டிக்க வலுவான எடை சிதைவு போன்ற நுட்பங்களை இந்த கட்டுரை பரிந்துரைக்கிறது மற்றும் மொழி மாதிரிகளில் சிக்கலான பகுத்தறிவை சோதிப்பதில் விரிவான தூண்டுதல்களின் அவசியத்தை எடுத்துக்காட்டுகிறது.",
      "மாதிரி கணக்கீடுகளை பகுப்பாய்வு செய்வதற்கான ஒரு முறையாக காரண தடமறிதலை இது அறிமுகப்படுத்துகிறது, இது மாதிரிகளை மனப்பாடம் செய்வதிலிருந்து பொதுமைப்படுத்தலுக்கு எவ்வாறு உதவுகிறது என்பதை விளக்குகிறது."
    ],
    "points": 199,
    "commentCount": 53,
    "retryCount": 0,
    "time": 1716847112
  },
  {
    "id": 40494793,
    "title": "நோட்பேட் தாவல்: பாதுகாப்பான குறிப்பு எடுக்கும் கருவி உலாவியின் முகவரிப் பட்டியில் குறிப்புகளைச் சேமிக்கிறது",
    "originLink": "https://notepadtab.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40494793",
    "commentBody": "",
    "originSummary": [
      "நோட்பேட் தாவல் என்பது குறிப்பு எடுக்கும் கருவியாகும், இது குறிப்புகளை உலாவியின் முகவரிப் பட்டி மற்றும் வரலாற்றில் நேரடியாகச் சேமிக்கிறது, இது எளிமையானதாகவும் தனிப்பட்டதாகவும் இருக்கும்.",
      "பயனர்கள் URL ஐ நகலெடுத்து ஒட்டுவதன் மூலம் குறிப்புகளை காப்புப் பிரதி எடுக்கலாம் அல்லது பகிரலாம், திறமையான குறிப்பு நிலைத்தன்மை, சுருக்கம் மற்றும் டிகம்பரஷ்ஷனுக்காக ஜாவாஸ்கிரிப்டை மேம்படுத்தலாம்.",
      "இந்த கருவி பாதுகாப்பு மற்றும் தனியுரிமையை வலியுறுத்துகிறது, வெளிப்புற சேமிப்பகம் இல்லாமல் குறிப்புகள் சேமிக்கப்பட்டு திறமையாக மீட்டெடுக்கப்படுவதை உறுதி செய்கிறது."
    ],
    "commentSummary": [
      "எலக்ட்ரான் பயன்பாடுகளுக்கு மாற்றாக நிலையான வலை பயன்பாடுகளை உள்நாட்டில் ஹோஸ்ட் செய்வதை ஒரு ஹேக்கர் செய்தி விவாதம் ஆராய்கிறது, பாதுகாப்பு, நடைமுறை மற்றும் ரெட்பீன், எஸ்கியூலைட் மற்றும் சேவை தொழிலாளர்கள் போன்ற தொழில்நுட்பங்களில் கவனம் செலுத்துகிறது.",
      "குறிப்பு எடுக்கும் மற்றும் இலகுரக பயன்பாடுகளுக்கான சொந்த பயன்பாடுகளுக்கு எதிராக உலாவி அடிப்படையிலான தீர்வுகளை பயனர்கள் விவாதிக்கின்றனர், உலாவிகளின் வளர்ந்து வரும் பங்கு மற்றும் நவீன பாதுகாப்பு வரம்புகள் பற்றி விவாதிக்கின்றனர்.",
      "கவலைகளில் தரவு திருட்டு, URL நீள வரம்புகள், உலாவி வரலாறு மாசுபாடு மற்றும் தனியுரிமை தாக்கங்கள் ஆகியவை அடங்கும், பங்கேற்பாளர்கள் உள்ளூர் சேமிப்பு, புக்மார்க்லெட்டுகள் மற்றும் உலாவி அடிப்படையிலான நோட்பேட்களுடன் அனுபவங்களைப் பகிர்ந்து கொள்கிறார்கள்."
    ],
    "points": 176,
    "commentCount": 134,
    "retryCount": 0,
    "time": 1716844540
  },
  {
    "id": 40496967,
    "title": "கசிந்த Google தேடல் API டாக்ஸ் மறைக்கப்பட்ட தரவரிசை காரணிகள் மற்றும் தரவு நடைமுறைகளை வெளிப்படுத்துகிறது",
    "originLink": "https://sparktoro.com/blog/an-anonymous-source-shared-thousands-of-leaked-google-search-api-documents-with-me-everyone-in-seo-should-see-them/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40496967",
    "commentBody": "",
    "originSummary": [
      "முன்னாள் கூகிள் ஊழியர்களால் சரிபார்க்கப்பட்ட கசிந்த கூகிள் தேடல் ஏபிஐ ஆவணங்கள், கிளிக் மைய பயனர் சமிக்ஞைகள், தனி துணை டொமைன் பரிசீலனைகள் மற்றும் புதிய வலைத்தளங்களுக்கான சாண்ட்பாக்ஸ் ஆகியவற்றின் பயன்பாட்டை வெளிப்படுத்துகின்றன, இது கூகிளின் பொது அறிக்கைகளுக்கு முரணானது.",
      "தேடல் முடிவுகளை மேம்படுத்த கூகிள் கருவிப்பட்டி மற்றும் குரோமில் இருந்து கிளிக்ஸ்ட்ரீம் தரவைப் பயன்படுத்தும் \"நவ்பூஸ்ட்\" என்ற அமைப்பை ஆவணங்கள் விவரிக்கின்றன, மேலும் குறிப்பிடத்தக்க நிகழ்வுகளின் போது துல்லியமான-பொருந்தக்கூடிய களங்கள், ஜியோ-ஃபென்சிங் கிளிக் தரவு மற்றும் அனுமதிப்பட்டியல்களுக்கான அபராதங்களைப் பற்றி விவாதிக்கின்றன.",
      "கிட்ஹப்பில் தற்செயலாக பொது வெளிப்பாட்டிலிருந்து ஏற்பட்ட கசிவு, 2,500 க்கும் மேற்பட்ட பக்கங்கள் உள் ஆவணங்களை உள்ளடக்கியது, விரிவான தரவு சேகரிப்பு நடைமுறைகளை முன்னிலைப்படுத்துகிறது மற்றும் கூகிள் அதன் தரவரிசையில் சிறிய தளங்களை விட பெரிய பிராண்டுகளை ஆதரிக்கிறது என்று பரிந்துரைக்கிறது."
    ],
    "commentSummary": [
      "GitHub இல் கசிந்த Google தேடல் API ஆவணங்கள் Chrome மூலம் விரிவான பயனர் கண்காணிப்பை உறுதிப்படுத்துகின்றன, இது குறிப்பிடத்தக்க தனியுரிமை கவலைகளை எழுப்புகிறது.",
      "ரெடிட்டில் விவாதங்கள் கூகிளின் உந்துதல்கள் குறித்த சந்தேகத்தை எடுத்துக்காட்டுகின்றன, பயனர் நன்மைகளை விட லாப உந்துதல் நடவடிக்கைகளை பரிந்துரைக்கின்றன, மேலும் டி.எம்.ஏ மற்றும் ஜி.டி.பி.ஆர் போன்ற ஒழுங்குமுறை கட்டமைப்புகளின் செயல்திறனை விவாதிக்கின்றன.",
      "பயனர்கள் தொழில்நுட்ப நிறுவனங்கள் மீது அவநம்பிக்கையை வெளிப்படுத்துகிறார்கள், குரோமின் ஆதிக்கத்தை விமர்சிக்கிறார்கள், மேலும் பயர்பாக்ஸ் போன்ற தனியுரிமையை மையமாகக் கொண்ட மாற்றுகளில் ஆர்வம் காட்டுகிறார்கள், அதே நேரத்தில் ஒரு கசிவில் அநாமதேய மூலத்தின் அடையாளத்தை ராண்ட் ஃபிஷ்கின் கையாளுவது குறித்தும் கவலைகளை எழுப்புகிறது."
    ],
    "points": 175,
    "commentCount": 71,
    "retryCount": 0,
    "time": 1716865651
  },
  {
    "id": 40501027,
    "title": "மொபிஃப்ரீ: பிக் டெக் ஆதிக்கத்திற்கு சவால் விடும் திறந்த மூல மொபைல் சுற்றுச்சூழல் அமைப்பு",
    "originLink": "https://f-droid.org/2024/05/24/mobifree.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40501027",
    "commentBody": "",
    "originSummary": [
      "மொபிஃப்ரீ என்பது ஆப்பிள் மற்றும் கூகிள் போன்ற முக்கிய தொழில்நுட்ப நிறுவனங்களுக்கு மாற்றாக வடிவமைக்கப்பட்ட ஒரு திறந்த மூல மொபைல் சுற்றுச்சூழல் அமைப்பாகும், இது தனியுரிமை, ஜனநாயகம் மற்றும் நெறிமுறை நடைமுறைகளில் கவனம் செலுத்துகிறது.",
      "சுற்றுச்சூழல் அமைப்பில் இயக்க முறைமைகள், ஆப் ஸ்டோர்கள் மற்றும் கிளவுட் சேவைகள் ஆகியவை அடங்கும், எஃப்-டிராய்டு போட்டி மற்றும் பயனர் தேர்வை ஊக்குவிக்கும் பரவலாக்கப்பட்ட பயன்பாட்டு விநியோக முறைக்கு பங்களிக்கிறது.",
      "ஐரோப்பிய ஒன்றியத்தின் டிஜிட்டல் சந்தைகள் சட்டம் மற்றும் ஹொரைசன் ஐரோப்பா மானியத்தால் ஆதரிக்கப்படும் மொபிஃப்ரீ, நியாயமான, நிலையான மற்றும் உள்ளடக்கிய மொபைல் அனுபவத்தை உருவாக்குவதை நோக்கமாகக் கொண்டுள்ளது, பிக் டெக்கின் ஆதிக்கத்தை சவால் செய்ய சமூக பங்கேற்பை ஊக்குவிக்கிறது."
    ],
    "commentSummary": [
      "எஃப்-டிராய்டு, ஒரு திறந்த மூல பயன்பாட்டு களஞ்சியம், மோசமான தேடல் செயல்பாடு மற்றும் தனியுரிம பயன்பாடுகளை விலக்குதல் காரணமாக கூகிள் பிளே ஸ்டோருக்கு முக்கிய மாற்றாக மாறுவதில் சவால்களை எதிர்கொள்கிறது, இது வங்கி போன்ற அத்தியாவசிய பயன்பாடுகளுக்கான முறையீட்டைக் கட்டுப்படுத்துகிறது.",
      "விவாதம் தனியுரிம மற்றும் திறந்த மூல மென்பொருளுக்கு இடையிலான நெறிமுறை மற்றும் நிதி சவால்கள், விளையாட்டு வளர்ச்சியில் உள்ள சிக்கல்கள் மற்றும் முக்கிய தளங்களுக்கு வெளியே பயன்பாட்டு விநியோகத்தில் உள்ள சிரமங்களை உள்ளடக்கியது.",
      "இந்த சிக்கல்கள் இருந்தபோதிலும், கூகிளின் கொள்கைகளால் கட்டுப்படுத்தப்பட்ட பயன்பாடுகளுக்கு எஃப்-டிராய்டு மதிப்புமிக்கது, மேலும் உரையாடல் பரவலாக்கப்பட்ட பயன்பாட்டு விநியோக அமைப்புகள், பெரிய தொழில்நுட்பத்தில் ஐரோப்பிய ஒன்றிய விதிமுறைகள் மற்றும் ஸ்மார்ட்போன் ஆயுட்காலம் குறித்த சுற்றுச்சூழல் கவலைகளை ஆராய்கிறது."
    ],
    "points": 164,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1716906264
  },
  {
    "id": 40502090,
    "title": "lm.c ஐப் பயன்படுத்தி GPT-2 மாடலை 90 நிமிடங்களில் $20க்கு இனப்பெருக்கம் செய்தல்",
    "originLink": "https://twitter.com/karpathy/status/1795484547267834137",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40502090",
    "commentBody": "",
    "originSummary": [
      "Andrej Karpathy சிறிய GPT-2 மாடலை (124M அளவுருக்கள்) llm.c ஐப் பயன்படுத்தி வெறும் 90 நிமிடங்களில் $20 செலவில் வெற்றிகரமாக இனப்பெருக்கம் செய்வது பற்றி ட்வீட் செய்தார்.",
      "GPT-2 மாடல், முதலில் OpenAI ஆல் 2019 இல் வெளியிடப்பட்டது, இப்போது வரையறுக்கப்பட்ட GPU வளங்களைக் கொண்ட நபர்களுக்கு அணுகக்கூடியது, மேம்பட்ட AI ஐ மேலும் ஜனநாயகமயமாக்குகிறது.",
      "இந்த சாதனை செலவு குறைந்த மற்றும் திறமையான AI மாதிரி இனப்பெருக்கத்திற்கான திறனை எடுத்துக்காட்டுகிறது, சக்திவாய்ந்த AI கருவிகளுக்கான அணுகலை விரிவுபடுத்துகிறது."
    ],
    "commentSummary": [
      "Andrej Karpathy \"llm.c\" ஐ உருவாக்கி வருகிறார், இது GPT-2 இன் குறைந்தபட்ச C/CUDA செயல்படுத்தல், அழகியல் மற்றும் கல்வி மதிப்பில் கவனம் செலுத்துகிறது.",
      "தற்போதைய C/CUDA குறியீடு PyTorch ஐ விட தோராயமாக 6% வேகமானது, மேலும் தேர்வுமுறைக்கு இடமளிக்கிறது, PyTorch இன் nanoGPT போன்ற பயிற்சி செயல்முறையை எளிதாக்குவதை நோக்கமாகக் கொண்டுள்ளது.",
      "இந்த திட்டம் குறித்த வீடியோ தொடரை வெளியிட கர்பாத்தி திட்டமிட்டுள்ளார், பெரிய தரவுத்தொகுப்புகளை அணுகுவதில் சாத்தியமான கட்டிடக்கலை மேம்பாடுகள் மற்றும் சவால்களைப் பற்றி விவாதிக்கிறது, இது குறிப்பிடத்தக்க சமூக ஆர்வத்தை உருவாக்குகிறது."
    ],
    "points": 161,
    "commentCount": 36,
    "retryCount": 0,
    "time": 1716911926
  },
  {
    "id": 40501021,
    "title": "Grooved: உங்கள் தொலைபேசியின் மைக்ரோஃபோனைப் பயன்படுத்தி டர்ன்டபிள் அளவுத்திருத்தத்திற்கான இலவச பயன்பாடு",
    "originLink": "https://grooved.okat.best/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40501021",
    "commentBody": "",
    "originSummary": [
      "இவான் க்ரூவ் என்ற இலவச பயன்பாட்டை உருவாக்கியுள்ளார், இது பயனர்கள் தங்கள் தொலைபேசியின் மைக்ரோஃபோனைப் பயன்படுத்தி தங்கள் டர்ன்டேபிள்களை அளவீடு செய்ய உதவுகிறது, அச்சிடப்பட்ட பொருட்களின் தேவையை நீக்குகிறது அல்லது தொலைபேசியை தட்டில் வைக்கிறது.",
      "Grooved தற்போது App Store இல் கிடைக்கிறது, Android பதிப்பு ஜூன் மாதத்தில் எதிர்பார்க்கப்படுகிறது.",
      "இவான் பயனர் கருத்துக்களைக் கோருகிறார் மற்றும் ட்விட்டரில் ஒரு டெமோ இணைப்பைப் பகிர்ந்துள்ளார்."
    ],
    "commentSummary": [
      "ஒரு டெவலப்பர் க்ரூவ் என்ற இலவச பயன்பாட்டை வெளியிட்டார், இது கூடுதல் பொருட்கள் இல்லாமல் அல்லது தொலைபேசியை தட்டில் வைக்காமல் டர்ன்டபிள் வேகத்தை அளவீடு செய்ய தொலைபேசியின் மைக்ரோஃபோனைப் பயன்படுத்துகிறது.",
      "எதிர்பார்க்கப்படும் ஆண்ட்ராய்டு பதிப்புடன் ஆப் ஸ்டோரில் கிடைக்கும் இந்த பயன்பாடு, டர்ன்டபிள் வேக சிக்கல்களைக் கண்டறிந்து சரிசெய்வதில் அதன் எளிமை மற்றும் செயல்திறனுக்காக பாராட்டப்பட்டது.",
      "பயன்பாட்டின் தனியுரிமையை மையமாகக் கொண்ட வடிவமைப்பை பயனர்கள் பாராட்டுகிறார்கள், இருப்பினும் டெவலப்பர் தவறான பயன்பாடு காரணமாக அதை திறந்த மூலமாக மாற்ற தயங்குகிறார்."
    ],
    "points": 159,
    "commentCount": 117,
    "retryCount": 0,
    "time": 1716906208
  },
  {
    "id": 40503202,
    "title": "காட்சி உரை விளைவுகளின் நூலகம் கேன்வாஸ் காட்சிகளுக்கு பல்வேறு அனிமேஷன் பாணிகளை வழங்குகிறது",
    "originLink": "https://chrisbuilds.github.io/terminaltexteffects/showroom/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40503202",
    "commentBody": "",
    "originSummary": [
      "ஆவணம் ஒரு கேன்வாஸில் உரை காட்சிக்கான உள்ளமைக்கப்பட்ட காட்சி விளைவுகளின் நூலகத்தை விவரிக்கிறது, ஒவ்வொன்றும் ஒரு தனித்துவமான அனிமேஷன் பாணியுடன்.",
      "இந்த விளைவுகளின் எடுத்துக்காட்டுகளில் ஒளியின் கற்றைகள், பைனரி பாதைகள், கருந்துளைகள், துள்ளல் பந்துகள், குமிழ்கள், எரியும் உரை மற்றும் பல அடங்கும்.",
      "ஒவ்வொரு விளைவும் தனிப்பயனாக்கத்திற்கான குறிப்பு உள்ளமைவு மற்றும் கட்டளை வரி வாதங்களுடன் வருகிறது, இது வடிவமைக்கப்பட்ட காட்சி விளக்கக்காட்சிகளை அனுமதிக்கிறது."
    ],
    "commentSummary": [
      "TTE: டெர்மினல் டெக்ஸ்ட் எஃபெக்ட்ஸ் என்பது டெர்மினல் வெளியீடுகளுக்கான பல்வேறு உரை விளைவுகளை வழங்கும் ஒரு திட்டமாகும், இது நேர்மறையான பயனர் கருத்துக்களைப் பெறுகிறது.",
      "பயனர்கள் அதன் படைப்பாற்றல் மற்றும் ஏக்கத்தைப் பாராட்டுகிறார்கள், திரைகளை ஏற்றுவதற்கான சாத்தியமான பயன்பாடுகளைக் காண்கிறார்கள் அல்லது பதிவுகளில் பிழைகளை முன்னிலைப்படுத்துகிறார்கள், இருப்பினும் சிலர் அதை உற்பத்தியில் பயன்படுத்துவதற்கு எதிராக எச்சரிக்கிறார்கள்.",
      "சி.எல்.ஐ (கட்டளை வரி இடைமுகம்) வெளியீடுகள் மற்றும் பைதான் நூலகமாக அதன் செயல்பாட்டை மேம்படுத்தியதற்காக இந்த திட்டம் பாராட்டப்படுகிறது, ஈமாக்ஸ் மற்றும் பிற நிரலாக்க மொழிகளில் உள்ள ஒத்த கருவிகளுடன் ஒப்பிடுகிறது."
    ],
    "points": 145,
    "commentCount": 16,
    "retryCount": 0,
    "time": 1716917508
  },
  {
    "id": 40501739,
    "title": "OpenAI CEO சாம் ஆல்ட்மேன் முன்னாள் ஊழியர்களுக்கு கட்டுப்பாட்டு ஒப்பந்தங்களுடன் அழுத்தம் கொடுத்ததாக கசிந்த ஆவணங்கள் காட்டுகின்றன",
    "originLink": "https://futurism.com/sam-altman-silencing-former-employees",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40501739",
    "commentBody": "",
    "originSummary": [
      "OpenAI தலைமை நிர்வாக அதிகாரி சாம் ஆல்ட்மேன் வெளியேறும் ஊழியர்களுக்கு சிலிக்கான் பள்ளத்தாக்கில் ஒரு அரிய நடைமுறையான அவர்களின் சொந்த பங்குகளை மீட்டெடுப்பதாக அச்சுறுத்துவதன் மூலம் கட்டுப்படுத்தப்பட்ட ஒப்பந்தங்களில் கையெழுத்திட அழுத்தம் கொடுத்ததாக கசிந்த ஆவணங்கள் குறிப்பிடுகின்றன.",
      "ஆல்ட்மேனின் பகிரங்க மன்னிப்பு மற்றும் அறியாமை கூற்றுக்கள் இருந்தபோதிலும், இந்த விதிகளை அங்கீகரிக்கும் ஆவணங்களில் அவர் கையெழுத்திட்டார் என்பதை சான்றுகள் காட்டுகின்றன, இது குறிப்பிடத்தக்க நிர்வாக வெளியேற்றங்கள் மற்றும் சட்ட சிக்கல்களுக்கு வழிவகுத்தது.",
      "நடிகை ஸ்கார்லெட் ஜோஹன்சனுடன் அவரது குரலை அங்கீகரிக்கப்படாத முறையில் பயன்படுத்துவது தொடர்பான சர்ச்சை உட்பட இந்த சர்ச்சை, OpenAI இன் நம்பகத்தன்மையை குறைமதிப்பிற்கு உட்படுத்துகிறது மற்றும் வெளிப்படைத்தன்மை மற்றும் மனிதகுலத்திற்கு பயனளிக்கும் அதன் நோக்கத்திற்கு முரணானது."
    ],
    "commentSummary": [
      "OpenAI இலிருந்து கசிந்த ஆவணங்கள், CEO சாம் ஆல்ட்மேனின் கடுமையான ஒப்பந்தங்கள் மூலம் முன்னாள் ஊழியர்களை மௌனமாக்குவதற்கான முயற்சிகள் குறித்த விழிப்புணர்வைக் காட்டுகின்றன, இது நெறிமுறை கவலைகளை எழுப்புகிறது.",
      "\"கொடூரமான\" என்ற சொல் நன்மைகளை இழக்கும் அச்சுறுத்தலின் கீழ் ஒப்பந்தங்களில் கையெழுத்திடுவதற்கான அழுத்தம் குறித்து விவாதிக்கப்படுகிறது, ஆல்ட்மேனின் கையொப்பம் இந்த நடைமுறைகளை உறுதிப்படுத்துகிறது.",
      "வோக்ஸ் கட்டுரைக்கு எதிரான பரபரப்பான குற்றச்சாட்டுகள் உட்பட இந்த சர்ச்சை, சிலிக்கான் வேலி விதிமுறைகளிலிருந்து விலகல்களை எடுத்துக்காட்டுகிறது, இது நம்பிக்கை மற்றும் எதிர்கால திறமை ஆட்சேர்ப்புக்கு தீங்கு விளைவிக்கும்."
    ],
    "points": 141,
    "commentCount": 50,
    "retryCount": 0,
    "time": 1716910389
  },
  {
    "id": 40498092,
    "title": "க்ளீம் 1.2.0 தவறு சகிப்புத்தன்மை மற்றும் டெவலப்பர் அனுபவத்தை மேம்படுத்துகிறது",
    "originLink": "https://gleam.run/news/fault-tolerant-gleam/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40498092",
    "commentBody": "",
    "originSummary": [
      "Gleam, Erlang VM மற்றும் JavaScript இயக்க நேரங்களுக்கான வகை-பாதுகாப்பான மற்றும் அளவிடக்கூடிய மொழி, பதிப்பு 1.2.0 ஐ வெளியிட்டுள்ளது, இது மொழி சேவையகம் மற்றும் டெவலப்பர் அனுபவத்தை மேம்படுத்துவதில் கவனம் செலுத்துகிறது.",
      "முக்கிய புதுப்பிப்புகளில் தவறு-சகிப்புத்தன்மை தொகுப்பு, சிறந்த இறக்குமதி அறிக்கை தானியங்கு நிறைவு, குறியீடு வடிவமைப்பில் ஒற்றை-வரி குழாய்கள், சுத்திகரிக்கப்பட்ட பிழை செய்திகள் மற்றும் தேவையற்ற முறை பொருத்தத்திற்கான தானாக திருத்தம் ஆகியவை அடங்கும்.",
      "ஒரு புதிய பிழை செய்தி ஜாவாஸ்கிரிப்ட் புரோகிராமர்களுக்கு '===' பயன்பாட்டை '==' ஆக சரிசெய்ய உதவுகிறது, மேலும் வெளியீடு பல்வேறு டெவலப்பர்களின் பங்களிப்புகளை ஒப்புக்கொள்கிறது, இது தற்போதைய வளர்ச்சிக்கு ஸ்பான்சர்ஷிப்பை ஊக்குவிக்கிறது."
    ],
    "commentSummary": [
      "க்ளீம் 1.2.0 வெளியீடு தவறு சகிப்புத்தன்மை மற்றும் டெவலப்பர் அனுபவத்தை மேம்படுத்துகிறது, இதில் நவீன தொடரியல் மற்றும் வலுவான ஹிண்ட்லி-மில்னர் வகை அமைப்பு உள்ளது.",
      "க்ளீம் எர்லாங்கின் பீம் வி.எம் மற்றும் ஜாவாஸ்கிரிப்ட் இரண்டையும் தொகுக்கிறது, இது நல்ல செயல்திறனை வழங்குகிறது மற்றும் படிப்படியாக தட்டச்சு செய்வதை நோக்கி நகரும் எலிக்சருடன் ஒப்பிடப்படுகிறது.",
      "செயலில் உள்ள சமூகம் லஸ்ட்ரே ஃப்ரான்டெண்ட் கட்டமைப்பு மற்றும் நெஸ்ட்ஃபுல் வலை பயன்பாடு போன்ற திட்டங்களை ஆதரிக்கிறது, இருப்பினும் சில பயனர்கள் ஆவணங்களை வகை பாதுகாப்பு மற்றும் ஒத்திசைவான பகுதிகளில் இல்லாததைக் காண்கின்றனர்."
    ],
    "points": 140,
    "commentCount": 48,
    "retryCount": 0,
    "time": 1716879335
  },
  {
    "id": 40502956,
    "title": "Openkoda: விரைவான வணிக பயன்பாட்டு மேம்பாட்டிற்கான திறந்த மூல தளம்",
    "originLink": "https://github.com/openkoda/openkoda",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40502956",
    "commentBody": "",
    "originSummary": [
      "Openkoda என்பது முன் கட்டமைக்கப்பட்ட செயல்பாடுகள் மற்றும் பெட்டிக்கு வெளியே உள்ள அம்சங்களை வழங்குவதன் மூலம் வணிக பயன்பாடுகள் மற்றும் உள் கருவிகளை உருவாக்குவதை விரைவுபடுத்துவதை நோக்கமாகக் கொண்ட ஒரு மேம்பாட்டு தளமாகும்.",
      "இது டைனமிக் நிறுவனங்கள், பல பல குத்தகை மாதிரிகளை ஆதரிக்கிறது மற்றும் Java, Spring Boot, JavaScript, HTML, Hibernate மற்றும் PostgreSQL போன்ற பழக்கமான தொழில்நுட்பங்களைப் பயன்படுத்துகிறது, இது விரிவான தனிப்பயனாக்கம் மற்றும் ஒருங்கிணைப்பை அனுமதிக்கிறது.",
      "Openkoda MIT உரிமத்தின் கீழ் திறந்த மூலமாகும், பயனர் மேலாண்மை, CMS, வேலை திட்டமிடல் போன்ற அம்சங்களை உள்ளடக்கியது மற்றும் எளிதான வரிசைப்படுத்தல் மற்றும் அளவிடுதலுக்காக நிர்வகிக்கப்பட்ட கிளவுட் சேவைகளை வழங்குகிறது."
    ],
    "commentSummary": [
      "Openkoda என்பது முக்கிய வணிக பயன்பாடுகளை உருவாக்குவதற்கான ஒரு திறந்த மூல தளமாகும், இது முழு மூல குறியீடு உரிமையை வழங்குகிறது மற்றும் சேல்ஸ்ஃபோர்ஸ் போலல்லாமல், வணிக வரம்புகளைத் தவிர்க்கிறது.",
      "இது Odoo போன்ற பிற FOSS (இலவச மற்றும் திறந்த மூல மென்பொருள்) ERP களுடன் ஒப்பிடப்படுகிறது, ஆனால் பணமாக்குதல் பற்றிய குறைவான கவலைகளுடன், மேலும் இது சேல்ஸ்ஃபோர்ஸுக்கு செலவு குறைந்த மாற்றாகக் காணப்படுகிறது.",
      "ஓபன்கோடா அதன் செயல்திறன் மற்றும் முதிர்ந்த சுற்றுச்சூழல் அமைப்புக்காக ஜாவாவைப் பயன்படுத்துகிறது, அதன் சொற்களஞ்சியத்தைப் பற்றிய விவாதங்கள் இருந்தபோதிலும், ஜாவா அல்லாத நிறுவனங்களுக்கான ஒருங்கிணைப்பை எளிதாக்க டோக்கர் படங்களை வழங்குகிறது."
    ],
    "points": 138,
    "commentCount": 53,
    "retryCount": 0,
    "time": 1716916316
  }
]
