[
  {
    "id": 42084588,
    "title": "العديد من الثغرات الجديدة للهروب من صندوق الرمل في نظام macOS",
    "originLink": "https://jhftss.github.io/A-New-Era-of-macOS-Sandbox-Escapes/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42084588",
    "commentBody": "",
    "originSummary": [
      "يلخص منشور المدونة عرضًا تقديميًا في POC2024، مسلطًا الضوء على اكتشاف أكثر من 10 ثغرات جديدة للهروب من صندوق الرمل في نظام macOS، بما في ذلك CVE-2023-27944 وCVE-2023-32414.",
      "حدد المؤلف سطح هجوم مهم تم التغاضي عنه وتقنية جديدة، مما أدى إلى اكتشاف العديد من الثغرات الجديدة للهروب من الصندوق الرملي، مما يبرز أهمية العثور على مثل هذه الثغرات لتعزيز قدرات المهاجمين.",
      "يتناول المنشور مختلف الثغرات والاستغلالات، بما في ذلك CVE-2023-41077 وCVE-2023-42961، ويشير إلى تصحيحات أبل، كما يوفر موارد لمزيد من القراءة حول الهروب من صندوق الرمل في macOS."
    ],
    "commentSummary": [
      "تم تحديد ثغرات جديدة للهروب من صندوق حماية macOS، مما يبرز عيوبًا محتملة في تصميم بنية صندوق الحماية. - خدمات XPC، التي من المفترض أن تكون خاصة بالتطبيق، يمكن الوصول إليها من التطبيقات المحمية بصندوق الحماية، مما يشير إلى الحاجة إلى استراتيجية تصحيح أكثر كفاءة. - تشمل الاقتراحات تبني نظام حاويات قائم على القدرات، مشابه لأنظمة التشغيل الأخرى، لتحقيق توازن أفضل بين الأمان والوظائف."
    ],
    "points": 341,
    "commentCount": 93,
    "retryCount": 0,
    "time": 1731046214
  },
  {
    "id": 42083559,
    "title": "بعد عقود، تتحرك إدارة الغذاء والدواء لسحب مزيل الاحتقان غير الفعال من الرفوف",
    "originLink": "https://arstechnica.com/health/2024/11/fda-proposes-ditching-common-decongestant-for-being-completely-useless/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42083559",
    "commentBody": "",
    "originSummary": [
      "تخطط إدارة الغذاء والدواء (FDA) لإزالة الفينيلفرين الفموي من المنتجات التي تُباع بدون وصفة طبية بسبب عدم فعاليته كمزيل للاحتقان، وذلك بعد تصويت بالإجماع من قبل مستشاري إدارة الغذاء والدواء.",
      "أصبح الفينيلفرين شائعًا بعد أن واجه السودوإيفيدرين قيودًا في عام 2006، لكن الدراسات تشير إلى أنه ليس أكثر فعالية من الدواء الوهمي.",
      "ستسمح إدارة الغذاء والدواء بفترة تعليق عامة قبل اتخاذ القرار النهائي، مما يمنح شركات الأدوية الوقت لإعادة صياغة منتجاتها، على الرغم من أن جمعية منتجات الرعاية الصحية للمستهلكين لا تتفق مع موقف إدارة الغذاء والدواء."
    ],
    "commentSummary": [
      "تتخذ إدارة الغذاء والدواء (FDA) إجراءات لإزالة مزيل احتقان من السوق، مشيرة إلى عدم فعاليته بعد أن كان متاحًا لعقود.",
      "يبرز هذا القرار أهمية التقييم المستمر وتنظيم الأدوية التي تُصرف بدون وصفة طبية لضمان سلامة وفعالية المستهلك.",
      "مزيد من المعلومات والإعلان الرسمي متاحان على موقع الأخبار المرتبط، مما يشير إلى تحديث تنظيمي كبير في صناعة الأدوية."
    ],
    "points": 297,
    "commentCount": 3,
    "retryCount": 0,
    "time": 1731033422
  },
  {
    "id": 42081764,
    "title": "سيارة إسعاف تصدم دراجًا، تنقله بسرعة إلى المستشفى، ثم تلزمه بدفع فاتورة بقيمة 1800 دولار",
    "originLink": "https://www.oregonlive.com/pacific-northwest-news/2024/11/ambulance-hits-oregon-cyclist-rushes-him-to-hospital-then-sticks-him-with-1800-bill-lawsuit-says.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42081764",
    "commentBody": "",
    "originSummary": [
      "في أكتوبر 2022، تعرض الدراج ويليام هوش لحادث تصادم مع سيارة إسعاف تابعة لخدمات الإطفاء والإنقاذ لنهر كولومبيا في مدينة رينيير بولاية أوريغون، مما أدى إلى إصابات كبيرة ورفع دعوى قضائية. يطالب هوش بتعويض قدره 997,000 دولار، يشمل 900,000 دولار للألم والمعاناة، وقد تكبد 47,000 دولار كنفقات طبية، مع توقع 50,000 دولار إضافية. يبرز الحادث ندرة ولكن إمكانية وقوع حوادث تصادم لسيارات الإسعاف في أوريغون، دون تعليقات من خدمات الإطفاء والإنقاذ لنهر كولومبيا أو شركة التأمين Allstate Fire and Casualty Insurance Co. بشأن الأمر."
    ],
    "commentSummary": [
      "اصطدمت سيارة إسعاف في ولاية أوريغون بدراج، ونقلته إلى المستشفى، ثم قامت بفاتورته بمبلغ 1,800 دولار، مما أدى إلى رفع دعوى قضائية بقيمة 997,000 دولار من قبل الدراج ضد مزود خدمة الإسعاف.",
      "أشعل الحادث نقاشات حول سلامة الطرق، لا سيما المخاطر التي تشكلها السيارات على راكبي الدراجات، وإمكانية تحسين البنية التحتية والقوانين لتعزيز السلامة.",
      "تؤكد القضية على التعقيدات المحيطة بالتأمين والمسؤولية في الحوادث التي تشمل راكبي الدراجات."
    ],
    "points": 293,
    "commentCount": 344,
    "retryCount": 0,
    "time": 1731018178
  },
  {
    "id": 42084080,
    "title": "تثبيت عملية التظليل بنمط 1-بت في لعبة أوبرا دين (2017)",
    "originLink": "https://forums.tigsource.com/index.php?topic=40832.msg1363742#msg1363742",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42084080",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "تركز المناقشة على عملية التدرج ببت واحد في لعبة \"عودة أوبرا دين\"، مسلطة الضوء على جاذبيتها الحنينية وأسلوبها الفريد في حل الألغاز التعاوني. - يوصي المستخدمون بألعاب مشابهة لغير اللاعبين، مثل \"قضية الأيقونة الذهبية\" و\"أغاني سنار\"، مع معالجة قضايا الوصول في ألعاب مثل \"الشاهد\". - يؤكد الموضوع على قيمة تصميم الألعاب المبتكر ومساهمة المجتمع في إثراء تجربة الألعاب من خلال تبادل الرؤى التطويرية."
    ],
    "points": 267,
    "commentCount": 49,
    "retryCount": 0,
    "time": 1731039359
  },
  {
    "id": 42083547,
    "title": "Rust لتقسيم الرموز والتحليل",
    "originLink": "https://xnacly.me/posts/2024/rust-pldev/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42083547",
    "commentBody": "",
    "originSummary": [
      "يستخدم المشروع \"sqleibniz\" لغة Rust لإجراء تحليل ثابت على مدخلات SQL، مع التركيز على فحص الصياغة والتحقق من وجود الجداول والأعمدة والوظائف، خاصة بالنسبة للهجة SQLite.",
      "تعمل ميزات لغة Rust، مثل الماكرو لتقليل تكرار الكود والمطابقة النمطية، على تعزيز الكفاءة وتجربة التطوير في بناء أدوات تحليل SQL.",
      "على الرغم من التحديات المتعلقة بالماكرو ومعالجة الأخطاء، فإن قدرات لغة Rust تجعلها خيارًا مناسبًا لتطوير أدوات قوية لتحليل وتفسير SQL."
    ],
    "commentSummary": [
      "شارك مستخدم تجربته مع لغة Rust، معربًا عن تقديره لميزاتها مثل أنواع البيانات الجبرية ومطابقة الأنماط، لكنه واجه تحديات مع مدقق الاقتراض وإدارة الذاكرة.",
      "استكشف المستخدم لغات أخرى مثل F# وZig وC وGo، ووجد في النهاية أن OCaml جذابة بسبب بناء جملها وغياب مفهوم الأعمار.",
      "سلطت المناقشة الضوء على التحديات والتفضيلات الشخصية في اختيار لغات البرمجة للمهام مثل التحليل والتجميع، مشيرة إلى عملية وشعبية لغة Go رغم بعض الانتقادات."
    ],
    "points": 258,
    "commentCount": 193,
    "retryCount": 0,
    "time": 1731033326
  },
  {
    "id": 42080012,
    "title": "كاجي ترانسليت",
    "originLink": "https://blog.kagi.com/kagi-translate",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42080012",
    "commentBody": "",
    "originSummary": [
      "كاجي ترانسليت هي خدمة ترجمة جديدة تدعي أنها تتفوق على جوجل ترانسليت وديب إل، حيث تدعم 244 لغة وتقدم ترجمات عالية الجودة، بما في ذلك ترجمة صفحات الويب.",
      "الخدمة مجانية، مع وجود كابتشا لغير الأعضاء لمنع سوء الاستخدام، بينما يتمتع الأعضاء بوصول سلس؛ ولا تقوم بترجمة المحتوى الذي يتم إنشاؤه ديناميكيًا أو المحتوى المحمي بجدار دفع.",
      "يستخدم Kagi Translate نماذج لغوية متقدمة لترجمات دقيقة ويتكامل مع Kagi Search، مع التركيز على أدوات تحافظ على الخصوصية والترحيب بتعليقات المستخدمين للتحسين المستمر."
    ],
    "commentSummary": [
      "أبلغ المستخدمون في منتدى Kagi Translate عن مشكلات مع نظام الكابتشا الخاص بـ Cloudflare، الذي فشل في التعرف عليهم كـ \"بشر\"، مما أثر على قدرتهم على استخدام الخدمة وتقديم الملاحظات.",
      "أعرب بعض المستخدمين عن عدم رضاهم عن جودة الترجمة في Kagi، خاصة بالنسبة للغات الأقل شيوعًا، وأشاروا إلى وجود حالات من الرقابة في الترجمات.",
      "أوضح فريق Kagi أن Cloudflare يُستخدم لمنع إساءة استخدام الروبوتات، وعلى الرغم من أن الخدمة مجانية، إلا أنها قد تحتوي على بعض القيود؛ وقد اقترح المستخدمون إعطاء الأولوية لتحسين ميزات البحث والترجمة."
    ],
    "points": 250,
    "commentCount": 107,
    "retryCount": 0,
    "time": 1731007924
  },
  {
    "id": 42080747,
    "title": "خمس دقائق من التمارين يوميًا يمكن أن تخفض ضغط الدم",
    "originLink": "https://www.sydney.edu.au/news-opinion/news/2024/11/07/five-minutes-of-exercise-a-day-could-lower-blood-pressure.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42080747",
    "commentBody": "",
    "originSummary": [
      "تشير دراسة في مجلة Circulation إلى أن خمس دقائق من التمارين اليومية، مثل صعود السلالم أو المشي صعودًا، يمكن أن تخفض ضغط الدم بشكل فعال. - أجريت الدراسة من قبل اتحاد ProPASS وشملت أكثر من 14,000 مشارك، وتقترح استبدال السلوك الجلوس بـ 20-27 دقيقة من التمارين يوميًا لتقليل خطر الإصابة بأمراض القلب والأوعية الدموية. - تؤكد الدراسة على أهمية التمارين القصيرة والمكثفة في إدارة ارتفاع ضغط الدم، وهو مصدر قلق صحي عالمي حاسم."
    ],
    "commentSummary": [
      "تشير الدراسات، بما في ذلك بحث تدريب تاباتا عالي الكثافة، إلى أن خمس دقائق فقط من التمارين اليومية يمكن أن تخفض ضغط الدم بشكل فعال.",
      "إن الروتينات القصيرة والمتسقة للتمارين الرياضية أسهل في الحفاظ عليها ويمكن أن تحسن بشكل كبير من مؤشرات الصحة، حتى لو كانت النشاطات بسيطة مثل المشي.",
      "من المهم تخصيص برامج التمارين الرياضية لتلبية الاحتياجات الصحية الفردية، حيث يمكن أن تختلف النتائج من شخص لآخر."
    ],
    "points": 234,
    "commentCount": 161,
    "retryCount": 0,
    "time": 1731012130
  },
  {
    "id": 42079768,
    "title": "مشتريات غيرت الحياة منذ عام 2020؟ (تحت 100 دولار وتحت 1000 دولار)",
    "originLink": "https://news.ycombinator.com/item?id=42079768",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42079768",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "تسلط المشاركة الضوء على المشتريات التي غيرت الحياة منذ عام 2020، مصنفة حسب نطاق السعر: تحت 100 دولار وتحت 1000 دولار. - تشمل العناصر تحت 100 دولار بيديه، ماكينة حلاقة آمنة، وفرشاة أسنان كهربائية، والتي حسنت النظافة والكفاءة. - المشتريات الأكثر تكلفة، مثل طابعة ثلاثية الأبعاد ومكنسة روبوت، ساهمت في زيادة الكفاءة وتطوير هوايات جديدة."
    ],
    "points": 231,
    "commentCount": 502,
    "retryCount": 0,
    "time": 1731006374
  },
  {
    "id": 42084753,
    "title": "مبادئ لسرعة المنتج",
    "originLink": "https://ssoready.com/blog/from-the-founders/methodology-is-bullshit/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42084753",
    "commentBody": "",
    "originSummary": [
      "تبسيط تطوير المنتجات من خلال التخلص من العمليات غير الضرورية والتركيز على المبادئ الأساسية يمكن أن يسرع من بناء المنتج المناسب. - تشمل الاستراتيجيات الرئيسية تبسيط المتطلبات، واعتماد الحلول البسيطة، والاستعانة بمصادر خارجية لتوفير الوقت والموارد. - فهم احتياجات العملاء والحفاظ على فريق قوي أمران حاسمان لتحقيق سرعة المنتج دون تعقيد العمليات."
    ],
    "commentSummary": [
      "تركز المناقشة على فعالية منهجيات تطوير البرمجيات، مثل أجايل وسكروم، مع وجود آراء متباينة حول ضرورتها والعيوب المحتملة. - تؤكد المحادثة على أهمية السياق وحجم الفريق وطبيعة العمل، مشيرة إلى أن الفرق الصغيرة قد تستفيد من العمليات البسيطة، بينما قد تحتاج المنظمات الكبيرة إلى المزيد من الهيكلية. - كما يتناول النقاش دور الإدارة، وضرورة وجود فرق ماهرة، والمخاطر المرتبطة بتطبيق المنهجيات بشكل صارم دون مراعاة احتياجات المشروع أو الفريق الفريدة."
    ],
    "points": 206,
    "commentCount": 123,
    "retryCount": 0,
    "time": 1731048528
  },
  {
    "id": 42080377,
    "title": "Draw.Audio – لوحة رسم موسيقية باستخدام واجهة برمجة تطبيقات الصوت على الويب",
    "originLink": "https://draw.audio",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42080377",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Draw.Audio هو مُسلسل صوتي مجاني تم تطويره بواسطة StreamGobbler باستخدام واجهة برمجة تطبيقات الصوت على الويب، ويقدم ميزات مثل المقاييس القابلة للاختيار، وأشكال الموجات، والتأثيرات.",
      "تم تصميم التطبيق ليكون خفيف الوزن، مناسب للأطفال، ومحسن للشاشات التي تعمل باللمس، مما يسمح للمستخدمين بمشاركة إبداعاتهم عبر روابط مباشرة.",
      "قد تتضمن التحديثات المستقبلية دروسًا تعليمية، وإعدادات مسبقة للأنماط، وتأثيرات إضافية، وإمكانية فتح المصدر، مع طلبات المستخدمين لتصدير MIDI وتحسين حساسية التحكم."
    ],
    "points": 202,
    "commentCount": 71,
    "retryCount": 0,
    "time": 1731009999
  },
  {
    "id": 42079758,
    "title": "تشكيل مجموعة اهتمام الويب المستدامة",
    "originLink": "https://www.w3.org/blog/2024/sustainable-web-interest-group-is-formed/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42079758",
    "commentBody": "",
    "originSummary": [
      "أنشأت W3C مجموعة اهتمام الويب المستدام لتعزيز الاستدامة الرقمية، لمعالجة المساهمة الكبيرة لصناعة الرقمية في الانبعاثات العالمية، والتي تتجاوز تلك الخاصة بقطاع الطيران.",
      "ستقوم المجموعة بتقديم إرشادات استدامة الويب (WSG) للمساعدة في إنشاء منتجات رقمية صديقة للبيئة، بما يتماشى مع بيان الويب المستدام ومعايير GRI وأهداف التنمية المستدامة للأمم المتحدة.",
      "تهدف المبادرة، التي يقودها تيم فريك وإينيس أكرب ومايك جيفورد، إلى تحسين قياس الاستدامة والموارد التعليمية والامتثال من خلال التعاون مع الهيئات التنظيمية."
    ],
    "commentSummary": [
      "تم إنشاء مجموعة اهتمام الويب المستدامة لمعالجة التأثير البيئي لتقنيات الويب، مع التركيز على تقليل استهلاك الطاقة.",
      "يقترح النقاد أن العودة إلى التقنيات الأبسط وتقليل استخدام JavaScript يمكن أن يخفض استهلاك الطاقة، بينما يبرز آخرون دور الإعلانات والتحليلات والأطر الثقيلة.",
      "تخطط المجموعة لتطوير إرشادات لممارسات الويب المستدامة، على الرغم من أن البعض يشكك في فعاليتها المحتملة بسبب المصالح الراسخة وتعقيد نظام الويب البيئي."
    ],
    "points": 202,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1731006311
  },
  {
    "id": 42082998,
    "title": "تقترح إدارة الغذاء والدواء الأمريكية إنهاء استخدام الفينيلفرين الفموي كدواء مزيل للاحتقان الأنفي المتاح دون وصفة طبية.",
    "originLink": "https://www.fda.gov/news-events/press-announcements/fda-proposes-ending-use-oral-phenylephrine-otc-monograph-nasal-decongestant-active-ingredient-after",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42082998",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "تقترح إدارة الغذاء والدواء الأمريكية وقف استخدام الفينيلفرين الفموي كدواء مزيل للاحتقان الأنفي يُصرف بدون وصفة طبية بسبب عدم فعاليته.",
      "يعتبر السودوإيفيدرين بديلاً أكثر فعالية، ولكنه مقيد لأنه يمكن استخدامه في إنتاج الميثامفيتامين، مما أدى إلى زيادة استخدام الفينيل إيفرين.",
      "على الرغم من هذه القيود، لم ينخفض إنتاج الميثامفيتامين، مما دفع البعض إلى الجدال من أجل رفع قيود السودوإيفيدرين لتحسين الوصول لأولئك الذين يحتاجون إلى تخفيف فعال للاحتقان."
    ],
    "points": 181,
    "commentCount": 348,
    "retryCount": 0,
    "time": 1731027409
  },
  {
    "id": 42080821,
    "title": "تم اختطاف الرئيس التنفيذي لشركة كريبتو في تورونتو واحتجازه مقابل فدية قدرها مليون دولار قبل أن يتم إطلاق سراحه",
    "originLink": "https://www.cbc.ca/news/canada/toronto/kidnapping-toronto-businessman-cryptocurrency-1.7376679",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42080821",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "تم اختطاف الرئيس التنفيذي لشركة عملات رقمية مقرها في تورونتو وأُطلق سراحه بعد دفع فدية قدرها مليون دولار إلكترونيًا، مما يبرز المخاطر المرتبطة بالثروة المعروفة علنًا في صناعة العملات الرقمية. - يثير هذا الحادث مخاوف بشأن زيادة الجريمة العنيفة في كندا والتحديات المحيطة بقوانين الدفاع عن النفس. - تسلط القضية الضوء على إمكانية جذب العملات الرقمية للنشاط الإجرامي بسبب قدرتها على تسهيل نقل مبالغ كبيرة من المال بسهولة."
    ],
    "points": 181,
    "commentCount": 158,
    "retryCount": 0,
    "time": 1731012528
  },
  {
    "id": 42085036,
    "title": "أصبح الآن بإمكانك لعب Asterogue، لعبتي الخيال العلمي من نوع roguelike، على الويب",
    "originLink": "https://asterogue.com",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42085036",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "أصبح الآن بإمكان اللاعبين الوصول إلى لعبة Asterogue، وهي لعبة خيال علمي من نوع roguelike مستوحاة من لعبة Rogue الأصلية، عبر الويب، بعد أن كانت متاحة في البداية على منصات أندرويد وويندوز.",
      "تتميز اللعبة بإعداد فريد حيث يستكشف اللاعبون 17 مستوى من كويكب، مستخدمين تقنيات مثل عناصر النانو تكنولوجي بدلاً من السحر، لتعزيز تجربة اللعب.",
      "تقدم النسخة الويب نموذج دفع جديد، مما يسمح للاعبين بتجربة بعض المستويات مجانًا قبل شراء اللعبة الكاملة، وقد نجح ذلك في زيادة تفاعل اللاعبين اليومي."
    ],
    "points": 174,
    "commentCount": 47,
    "retryCount": 0,
    "time": 1731051782
  },
  {
    "id": 42082892,
    "title": "راديو الهواة 101: ما هو WSPR؟",
    "originLink": "https://www.onallbands.com/ham-radio-101-what-is-wspr/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42082892",
    "commentBody": "",
    "originSummary": [
      "تشرح إليزابيث كلينك، KE8FMJ، في منشور مدونتها بروتوكول WSPR (مراسل انتشار الإشارة الضعيفة)، وهو بروتوكول للاتصالات الراديوية ذات الإشارة الضعيفة يستخدمه مشغلو الراديو الهواة. تم تطوير WSPR بواسطة جو تايلور، K1JT، ويسمح بإرسال إشارات منخفضة الطاقة لاختبار مسارات الانتشار في الترددات المتوسطة (MF) والترددات العالية (HF)، باستخدام تنسيق بيانات مضغوط مع تصحيح خطأ قوي. يبرز المنشور أن WSPR يعمل بفعالية عند نسب إشارة إلى ضوضاء منخفضة ويتطلب راديو وجهاز كمبيوتر مع اتصال بالإنترنت، ويدعو القراء لطرح الأسئلة والبقاء على اطلاع بمواضيع الراديو الهواة."
    ],
    "commentSummary": [
      "يُعتبر WSPR (مراسل انتشار الإشارة الضعيفة) وضعًا رقميًا في الراديو الهواة يُستخدم لاختبار مسارات انتشار الإشارة من خلال إرسال واستقبال إشارات مشفرة.",
      "يمكنه فك تشفير الإشارات الضعيفة جدًا، مما يتيح التواصل لمسافات طويلة بقدرة طاقة منخفضة، مما يجعله مفيدًا للتجارب والاتصالات الطارئة بدون إنترنت أو خدمة هاتف محمول.",
      "هواية الراديو للهواة متنوعة، حيث تشمل أنشطة مثل الحدائق على الهواء وبناء معدات مخصصة، مما يجذب المهتمين بتكنولوجيا الترددات الراديوية (RF) والاستعداد للطوارئ."
    ],
    "points": 160,
    "commentCount": 64,
    "retryCount": 0,
    "time": 1731026672
  }
]
