[
  {
    "id": 42084588,
    "title": "Birden fazla yeni macOS sandbox kaçış güvenlik açığı",
    "originLink": "https://jhftss.github.io/A-New-Era-of-macOS-Sandbox-Escapes/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42084588",
    "commentBody": "",
    "originSummary": [
      "Blog yazısı, POC2024'teki bir sunumu özetleyerek, CVE-2023-27944 ve CVE-2023-32414 dahil olmak üzere 10'dan fazla yeni macOS sandbox kaçış güvenlik açığının keşfini vurguluyor.",
      "Yazar, önemli bir gözden kaçan saldırı yüzeyini ve yeni bir tekniği belirleyerek, birden fazla yeni sanal alan kaçış zafiyetine yol açtı ve bu tür zafiyetlerin bulunmasının saldırganların yeteneklerini artırmak için önemini vurguladı.",
      "Yazı, CVE-2023-41077 ve CVE-2023-42961 dahil olmak üzere çeşitli güvenlik açıkları ve istismarları tartışıyor ve Apple'ın yamalarından bahsediyor, ayrıca macOS sandbox kaçışları hakkında daha fazla okuma için kaynaklar sağlıyor."
    ],
    "commentSummary": [
      "Yeni macOS sandbox kaçış açıkları tespit edildi ve bu durum, sandbox mimarisindeki potansiyel tasarım kusurlarını vurguluyor.- Uygulama özelinde olması gereken XPC hizmetleri, sandbox içindeki uygulamalardan erişilebilir durumda, bu da daha etkili bir yama stratejisine ihtiyaç olduğunu gösteriyor.- Öneriler, güvenlik ve işlevselliği daha iyi dengelemek için diğer işletim sistemlerine benzer şekilde yetenek tabanlı bir konteyner sistemi benimsemeyi içeriyor."
    ],
    "points": 341,
    "commentCount": 93,
    "retryCount": 0,
    "time": 1731046214
  },
  {
    "id": 42083559,
    "title": "On yıllar sonra, FDA etkisiz dekonjestanı raflardan çekmek için harekete geçti.",
    "originLink": "https://arstechnica.com/health/2024/11/fda-proposes-ditching-common-decongestant-for-being-completely-useless/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42083559",
    "commentBody": "",
    "originSummary": [
      "FDA, danışmanlarının oybirliğiyle aldığı kararın ardından, oral fenilefrinin dekonjestan olarak etkisizliği nedeniyle reçetesiz satılan ürünlerden çıkarılmasını planlıyor.",
      "Fenilefrin, 2006 yılında psödoefedrin kısıtlamalarla karşılaştıktan sonra popüler hale geldi, ancak çalışmalar bunun plasebodan daha etkili olmadığını göstermektedir.",
      "FDA, kararı kesinleştirmeden önce bir kamuoyu yorum dönemi tanıyacak ve bu, ilaç üreticilerine yeniden formüle etme zamanı verecek, ancak Tüketici Sağlık Ürünleri Derneği, FDA'nın tutumuna katılmıyor."
    ],
    "commentSummary": [
      "FDA (Gıda ve İlaç Dairesi), onlarca yıldır piyasada bulunan bir dekonjestanın etkisizliğini öne sürerek piyasadan kaldırılması için harekete geçiyor.",
      "Bu karar, tüketici güvenliği ve etkinliğini sağlamak için reçetesiz satılan ilaçların sürekli değerlendirilmesi ve düzenlenmesinin önemini vurgulamaktadır.",
      "İlaç endüstrisinde önemli bir düzenleyici güncellemeyi belirten daha fazla bilgi ve resmi duyuru, bağlantılı haber sitesinde mevcuttur."
    ],
    "points": 297,
    "commentCount": 3,
    "retryCount": 0,
    "time": 1731033422
  },
  {
    "id": 42081764,
    "title": "Ambulans bisikletçiye çarptı, onu hastaneye götürdü, ardından 1.800 dolarlık faturayı ona kesti.",
    "originLink": "https://www.oregonlive.com/pacific-northwest-news/2024/11/ambulance-hits-oregon-cyclist-rushes-him-to-hospital-then-sticks-him-with-1800-bill-lawsuit-says.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42081764",
    "commentBody": "",
    "originSummary": [
      "2022 Ekim ayında bisikletçi William Hoesch, Rainier, Oregon'da Columbia River Fire & Rescue ambulansı ile çarpıştı ve bu olay ciddi yaralanmalara ve bir davaya yol açtı. Hoesch, 900.000 doları acı ve ıstırap için olmak üzere toplam 997.000 dolar talep ediyor ve 47.000 dolar tıbbi masraf yapmış olup, ek olarak 50.000 dolar daha bekleniyor. Olay, Oregon'da ambulans kazalarının nadir ama mümkün olduğunu vurguluyor ve Columbia River Fire & Rescue veya Allstate Fire and Casualty Insurance Co.'dan konu hakkında bir yorum yapılmadı."
    ],
    "commentSummary": [
      "Bir ambulans Oregon'da bir bisikletliyle çarpıştı, onu hastaneye taşıdı ve ardından bisikletliye 1.800 dolar fatura kesti, bu da bisikletlinin ambulans sağlayıcısına karşı 997.000 dolarlık bir dava açmasına yol açtı.",
      "Bu olay, yol güvenliği, özellikle arabaların bisikletlilere oluşturduğu riskler ve güvenliği artırmak için altyapı ve yasaların iyileştirilme potansiyeli üzerine tartışmaları ateşledi.",
      "Bu vaka, bisikletçileri içeren kazalarda sigorta ve sorumluluk konularının karmaşıklığını vurgulamaktadır."
    ],
    "points": 293,
    "commentCount": 344,
    "retryCount": 0,
    "time": 1731018178
  },
  {
    "id": 42084080,
    "title": "Obra Dinn 1-bit tarama sürecini dengeleme (2017)",
    "originLink": "https://forums.tigsource.com/index.php?topic=40832.msg1363742#msg1363742",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42084080",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Metin, \"Return of the Obra Dinn\" oyunundaki 1-bit ditherleme sürecine odaklanarak, bu sürecin nostaljik çekiciliğini ve benzersiz işbirlikçi bulmaca çözme oyun tarzını vurguluyor. Kullanıcılar, oyuncu olmayanlar için \"The Case of the Golden Idol\" ve \"Chants of Sennaar\" gibi benzer oyunlar önerirken, \"The Witness\" gibi oyunlardaki erişilebilirlik sorunlarına da değiniyor. Konu, yenilikçi oyun tasarımının değerini ve topluluğun, paylaşılan geliştirme içgörüleri aracılığıyla oyun deneyimini zenginleştirmeye katkısını vurguluyor."
    ],
    "points": 267,
    "commentCount": 49,
    "retryCount": 0,
    "time": 1731039359
  },
  {
    "id": 42083547,
    "title": "Tokenleştirme ve ayrıştırma için Rust",
    "originLink": "https://xnacly.me/posts/2024/rust-pldev/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42083547",
    "commentBody": "",
    "originSummary": [
      "Proje \"sqleibniz\", SQL girdileri üzerinde statik analiz yapmak için Rust kullanır ve özellikle SQLite lehçesi için sözdizimi denetimi ile tabloların, sütunların ve fonksiyonların varlığını doğrulamaya odaklanır.",
      "Rust'ın kod tekrarlamasını önlemek için makrolar ve desen eşleştirme gibi özellikleri, SQL analiz araçları geliştirmede verimliliği ve geliştirme deneyimini artırır.",
      "Makrolar ve hata yönetimi ile ilgili zorluklara rağmen, Rust'ın yetenekleri, SQL ayrıştırma ve analiz için sağlam araçlar geliştirmek adına uygun bir seçim haline getiriyor."
    ],
    "commentSummary": [
      "Kullanıcı, Rust ile ilgili deneyimlerini paylaştı; cebirsel veri türleri ve desen eşleştirme gibi özelliklerini takdir etti ancak ödünç alma denetleyicisi ve bellek yönetimi ile ilgili zorluklarla karşılaştı.",
      "Kullanıcı, F#, Zig, C ve Go gibi diğer dilleri keşfetti ve sonunda OCaml'ı, sözdizimi ve ömür sürelerinin olmaması nedeniyle çekici buldu.",
      "Bu tartışma, Go'nun bazı eleştirilere rağmen pratikliği ve popülaritesine dikkat çekerek, ayrıştırma ve derleme gibi görevler için programlama dilleri seçerken karşılaşılan zorlukları ve kişisel tercihleri vurguladı."
    ],
    "points": 258,
    "commentCount": 193,
    "retryCount": 0,
    "time": 1731033326
  },
  {
    "id": 42080012,
    "title": "Kagi Çeviri",
    "originLink": "https://blog.kagi.com/kagi-translate",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42080012",
    "commentBody": "",
    "originSummary": [
      "Kagi Translate, Google Translate ve DeepL'den daha iyi performans gösterdiğini iddia eden, 244 dili destekleyen ve yüksek kaliteli çeviriler sunan, web sayfası çevirisi de dahil olmak üzere yeni bir çeviri hizmetidir.",
      "Bu hizmet, kötüye kullanımı önlemek için üye olmayanlar için bir captcha ile ücretsizdir, üyeler ise sorunsuz erişime sahiptir; dinamik olarak oluşturulan veya ücretli içerikleri çevirmemektedir.",
      "Kagi Translate, hassas çeviriler için gelişmiş dil modelleri kullanır ve sürekli iyileştirme için kullanıcı geri bildirimlerini memnuniyetle karşılayarak gizlilik odaklı araçları vurgulayan Kagi Search ile entegre edilmiştir."
    ],
    "commentSummary": [
      "Kagi Translate forumundaki kullanıcılar, Cloudflare'ın captcha sisteminde, kendilerini \"insan\" olarak tanımakta başarısız olan sorunlar bildirdi. Bu durum, hizmeti kullanma ve geri bildirim gönderme yeteneklerini etkiledi.",
      "Bazı kullanıcılar, özellikle daha az yaygın diller için Kagi'nin çeviri kalitesinden memnuniyetsizliklerini dile getirdiler ve çevirilerde sansür vakalarına dikkat çektiler.",
      "Kagi'nin ekibi, bot kötüye kullanımını önlemek için Cloudflare'in kullanıldığını ve hizmetin ücretsiz olmasına rağmen bazı sınırlamaları olabileceğini açıkladı; kullanıcılar, arama ve çeviri özelliklerindeki iyileştirmelere öncelik verilmesini önerdi."
    ],
    "points": 250,
    "commentCount": 107,
    "retryCount": 0,
    "time": 1731007924
  },
  {
    "id": 42080747,
    "title": "Her gün beş dakika egzersiz yapmak kan basıncını düşürebilir.",
    "originLink": "https://www.sydney.edu.au/news-opinion/news/2024/11/07/five-minutes-of-exercise-a-day-could-lower-blood-pressure.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42080747",
    "commentBody": "",
    "originSummary": [
      "Circulation dergisinde yayımlanan bir çalışma, merdiven çıkma veya yokuş yukarı yürüme gibi günlük beş dakikalık egzersizin kan basıncını etkili bir şekilde düşürebileceğini belirtmektedir. ProPASS Konsorsiyumu tarafından yürütülen araştırma, 14.000'den fazla katılımcıyı içermekte olup, hareketsiz davranışların yerine günlük 20-27 dakikalık egzersiz yapılmasının kardiyovasküler hastalık riskini azaltabileceğini önermektedir. Çalışma, hipertansiyon yönetiminde kısa ve yoğun egzersizin önemini vurgulamakta olup, bu durum küresel bir sağlık sorunu olarak kabul edilmektedir."
    ],
    "commentSummary": [
      "Tabata'nın yüksek yoğunluklu antrenman araştırması da dahil olmak üzere yapılan çalışmalar, günde sadece beş dakikalık egzersizin kan basıncını etkili bir şekilde düşürebileceğini göstermektedir.",
      "Kısa, tutarlı egzersiz rutinleri sürdürülmesi daha kolaydır ve yürüyüş gibi minimal bir aktivite olsa bile sağlık göstergelerini önemli ölçüde iyileştirebilir.",
      "Egzersiz rutinlerini bireysel sağlık ihtiyaçlarına göre uyarlamak önemlidir, çünkü sonuçlar kişiden kişiye farklılık gösterebilir."
    ],
    "points": 234,
    "commentCount": 161,
    "retryCount": 0,
    "time": 1731012130
  },
  {
    "id": 42079768,
    "title": "2020'den beri hayat değiştiren satın alımlar? (100 doların altında ve 1000 doların altında)",
    "originLink": "https://news.ycombinator.com/item?id=42079768",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42079768",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Yazı, 2020'den bu yana yapılan ve fiyat aralığına göre kategorize edilen hayat değiştiren satın alımları vurguluyor: 100 doların altında ve 1000 doların altında.- 100 doların altındaki ürünler arasında hijyen ve verimliliği artıran bide, güvenlik tıraş bıçağı ve elektrikli diş fırçası bulunuyor.- Daha pahalı satın alımlar, örneğin 3D yazıcı ve robot süpürge, verimliliği artırmış ve yeni hobilerin gelişimine katkıda bulunmuştur."
    ],
    "points": 231,
    "commentCount": 502,
    "retryCount": 0,
    "time": 1731006374
  },
  {
    "id": 42084753,
    "title": "Ürün hızı için prensipler",
    "originLink": "https://ssoready.com/blog/from-the-founders/methodology-is-bullshit/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42084753",
    "commentBody": "",
    "originSummary": [
      "Ürün geliştirmeyi gereksiz süreçleri ortadan kaldırarak ve temel ilkelere odaklanarak hızlandırmak, doğru ürünü inşa etmeyi hızlandırabilir.- Ana stratejiler arasında gereksinimleri basitleştirmek, basit çözümleri benimsemek ve zaman ve kaynak tasarrufu sağlamak için tedarikçilere dış kaynak sağlamak yer alır.- Müşteri ihtiyaçlarını anlamak ve güçlü bir ekip oluşturmak, süreçleri karmaşıklaştırmadan ürün hızını elde etmek için çok önemlidir."
    ],
    "commentSummary": [
      "Bu tartışma, Agile ve Scrum gibi yazılım geliştirme metodolojilerinin etkinliğine odaklanıyor ve bunların gerekliliği ile potansiyel sakıncaları hakkında farklı görüşler sunuyor. Konuşma, bağlamın, ekip büyüklüğünün ve işin doğasının önemini vurguluyor; daha küçük ekiplerin minimal süreçlerden fayda sağlayabileceğini, daha büyük organizasyonların ise daha fazla yapıya ihtiyaç duyabileceğini öne sürüyor. Tartışma ayrıca yönetimin rolünü, yetenekli ekiplere duyulan ihtiyacı ve bir projenin veya ekibin benzersiz ihtiyaçları göz önünde bulundurulmadan metodolojilerin katı bir şekilde uygulanmasının risklerini de ele alıyor."
    ],
    "points": 206,
    "commentCount": 123,
    "retryCount": 0,
    "time": 1731048528
  },
  {
    "id": 42080377,
    "title": "Draw.Audio – Web Audio API kullanarak müzikal bir eskiz defteri",
    "originLink": "https://draw.audio",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42080377",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Draw.Audio, StreamGobbler tarafından Web Audio API kullanılarak geliştirilen, seçilebilir ölçekler, dalga formları ve efektler gibi özellikler sunan ücretsiz bir ses sıralayıcısıdır.",
      "Uygulama, hafif, çocuk dostu ve dokunmatik ekranlar için optimize edilmiş şekilde tasarlanmıştır, kullanıcıların oluşturduklarını doğrudan bağlantılar aracılığıyla paylaşmalarına olanak tanır.",
      "Gelecekteki güncellemeler, öğreticiler, desen ön ayarları, ek efektler ve potansiyel olarak açık kaynak haline getirme gibi özellikleri içerebilir; kullanıcı geri bildirimleri ise MIDI dışa aktarma ve geliştirilmiş kontrol hassasiyetleri talep etmektedir."
    ],
    "points": 202,
    "commentCount": 71,
    "retryCount": 0,
    "time": 1731009999
  },
  {
    "id": 42079758,
    "title": "Sürdürülebilir Web İlgi Grubu Kuruldu",
    "originLink": "https://www.w3.org/blog/2024/sustainable-web-interest-group-is-formed/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42079758",
    "commentBody": "",
    "originSummary": [
      "W3C, dijital sürdürülebilirliği teşvik etmek amacıyla Sürdürülebilir Web İlgi Grubu'nu kurdu ve bu grup, dijital endüstrinin küresel emisyonlara olan önemli katkısını ele alıyor; bu katkı, havacılık sektörünün katkısını aşmaktadır.",
      "Grup, Sürdürülebilir Web Manifestosu, GRI Standartları ve BM Sürdürülebilir Kalkınma Hedefleri ile uyumlu, çevre dostu dijital ürünler oluşturulmasına yardımcı olmak için Web Sürdürülebilirlik Yönergeleri'ni (WSG) tanıtacak.",
      "Tim Frick, Ines Akrap ve Mike Gifford tarafından yönetilen girişim, sürdürülebilirlik ölçülebilirliğini, eğitim kaynaklarını ve uyumluluğu, düzenleyici kurumlarla işbirliği yaparak geliştirmeyi amaçlıyor."
    ],
    "commentSummary": [
      "Sürdürülebilir Web İlgi Grubu, web teknolojilerinin çevresel etkisini ele almak ve enerji tüketimini azaltmaya odaklanmak amacıyla kurulmuştur.",
      "Eleştirmenler, daha basit teknolojilere dönmenin ve JavaScript kullanımını azaltmanın enerji tüketimini düşürebileceğini öne sürerken, diğerleri reklamlar, analizler ve ağır çerçevelerin rolünü vurguluyor.",
      "Grup, sürdürülebilir web uygulamaları için yönergeler geliştirmeyi planlıyor, ancak bazıları köklü çıkarlar ve web ekosisteminin karmaşıklığı nedeniyle bunun potansiyel etkinliğini sorguluyor."
    ],
    "points": 202,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1731006311
  },
  {
    "id": 42082998,
    "title": "FDA, oral fenilefrinin reçetesiz satılan burun tıkanıklığı giderici olarak kullanımına son verilmesini öneriyor.",
    "originLink": "https://www.fda.gov/news-events/press-announcements/fda-proposes-ending-use-oral-phenylephrine-otc-monograph-nasal-decongestant-active-ingredient-after",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42082998",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "FDA, oral fenilefrinin etkisizliği nedeniyle reçetesiz satılan bir burun tıkanıklığı giderici olarak kullanımını durdurmayı önermektedir.",
      "Metamfetamin üretiminde kullanılabileceği için kısıtlanan daha etkili bir alternatif olan psödoefedrin, fenilefrin kullanımının artmasına yol açtı.",
      "Bu kısıtlamalara rağmen, metamfetamin üretimi azalmamıştır, bu da bazılarını etkili tıkanıklık gidericiye ihtiyaç duyanların erişimini iyileştirmek için psödoefedrin kısıtlamalarının kaldırılmasını savunmaya yöneltmiştir."
    ],
    "points": 181,
    "commentCount": 348,
    "retryCount": 0,
    "time": 1731027409
  },
  {
    "id": 42080821,
    "title": "Toronto kripto şirketi CEO'su kaçırıldı, serbest bırakılmadan önce 1 milyon dolar fidye istendi",
    "originLink": "https://www.cbc.ca/news/canada/toronto/kidnapping-toronto-businessman-cryptocurrency-1.7376679",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42080821",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Toronto merkezli bir kripto para şirketinin CEO'su, elektronik olarak ödenen 1 milyon dolarlık fidyenin ardından kaçırıldı ve serbest bırakıldı, bu durum kripto endüstrisinde kamuya açık bilinen servetin risklerini vurguluyor.- Bu olay, Kanada'da artan şiddet suçları ve öz savunma yasaları etrafındaki zorluklar hakkında endişeleri artırıyor.- Olay, büyük miktarda paranın kolayca transfer edilmesini sağlama yeteneği nedeniyle kripto paranın suç faaliyetlerini çekme potansiyelini gözler önüne seriyor."
    ],
    "points": 181,
    "commentCount": 158,
    "retryCount": 0,
    "time": 1731012528
  },
  {
    "id": 42085036,
    "title": "Asterogue, bilim kurgu roguelike oyunum, artık web üzerinde oynanabilir.",
    "originLink": "https://asterogue.com",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42085036",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Asterogue, orijinal Rogue'dan esinlenen bir bilim kurgu roguelike oyunu, başlangıçta Android ve Windows platformlarından genişleyerek artık web üzerinde erişilebilir durumda.",
      "Oyun, oyuncuların büyü yerine nanoteknoloji gibi teknolojileri kullanarak oynanışı geliştirdiği bir asteroitin 17 seviyesini keşfettiği benzersiz bir ortam sunuyor.",
      "Web versiyonu, oyuncuların tam oyunu satın almadan önce birkaç seviyeyi ücretsiz denemelerine olanak tanıyan yeni bir ödeme modeli sunuyor ve bu da günlük oyuncu katılımını başarılı bir şekilde artırdı."
    ],
    "points": 174,
    "commentCount": 47,
    "retryCount": 0,
    "time": 1731051782
  },
  {
    "id": 42082892,
    "title": "Amatör Radyo 101: WSPR Nedir?",
    "originLink": "https://www.onallbands.com/ham-radio-101-what-is-wspr/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42082892",
    "commentBody": "",
    "originSummary": [
      "Elizabeth Klinc, KE8FMJ tarafından yazılan blog yazısı, amatör radyo operatörleri tarafından kullanılan zayıf sinyal radyo iletişimi için bir protokol olan WSPR'yi (Weak Signal Propagation Reporter) açıklıyor. Joe Taylor, K1JT tarafından geliştirilen WSPR, güçlü hata düzeltme ile sıkıştırılmış bir veri formatı kullanarak orta frekans (MF) ve yüksek frekans (HF) yayılım yollarını test etmek için düşük güçlü iletimlere olanak tanır. Yazı, WSPR'nin düşük sinyal-gürültü oranlarında etkili bir şekilde çalıştığını ve internet erişimi olan bir radyo ve bilgisayar gerektirdiğini vurguluyor, okuyucuları sorular sormaya ve amatör radyo konularında güncel kalmaya davet ediyor."
    ],
    "commentSummary": [
      "WSPR (Zayıf Sinyal Yayılım Raporlayıcısı), amatör radyoda sinyal yayılım yollarını test etmek için kodlanmış sinyallerin iletilmesi ve alınması yoluyla kullanılan bir dijital moddur.",
      "Çok zayıf sinyalleri çözebilir, bu da uzun mesafeli iletişimi minimal güçle mümkün kılarak, internet veya cep telefonu hizmeti olmadan deneysel ve acil durum iletişimi için faydalı hale getirir.",
      "Amatör radyo hobisi, Radyo Frekansı (RF) teknolojisi ve acil durum hazırlığına ilgi duyanları çeken, Havadaki Parklar ve özel ekipman yapımı gibi etkinlikleri içeren çeşitli bir uğraştır."
    ],
    "points": 160,
    "commentCount": 64,
    "retryCount": 0,
    "time": 1731026672
  }
]
