[
  {
    "id": 42191228,
    "title": "Let's Encrypt הוא בן 10 עכשיו",
    "originLink": "https://letsencrypt.org/2014/11/18/announcing-lets-encrypt/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42191228",
    "commentBody": "",
    "originSummary": [
      "Let's Encrypt היא רשות אישורים חינמית שמפשטת את תהליך השגת וניהול אישורי שרתים, תוך התמודדות עם האתגרים של עלות ומורכבות.",
      "בתמיכת ארגונים גדולים כמו מוזילה, סיסקו וקרן החזית האלקטרונית (EFF), היא שואפת להפוך את אבטחת האינטרנט לנגישה ופתוחה לכולם.",
      "עקרונות המפתח של Let's Encrypt כוללים היותו חינמי, אוטומטי, מאובטח, שקוף, פתוח ושיתופי, עם הזדמנויות לחסות או תרומה לתמיכה ביוזמה."
    ],
    "commentSummary": [
      "Let's Encrypt, החוגגת את יום השנה ה-10 שלה, שינתה את אבטחת האינטרנט על ידי הצעת תעודות HTTPS חינמיות, מה שהפך חיבורים מאובטחים לנגישים לכולם.",
      "על אף האימוץ הנרחב שלה, ישנם מגזרים מסוימים, כמו בנקאות, שדורשים תוקף תעודה ארוך יותר, מה שמציב אתגרים לשימוש ב-Let's Encrypt.",
      "השירות שיפר את אבטחת הרשת באמצעות הפרוטוקול הפתוח והאוטומציה שלו, אם כי הוא עדיין נשען על תרומות, מה שמדגיש את משימתו ללא מטרות רווח."
    ],
    "points": 448,
    "commentCount": 166,
    "retryCount": 0,
    "time": 1732083220
  },
  {
    "id": 42190541,
    "title": "Epic מאפשרת לארכיון האינטרנט להפיץ את Unreal ו-Unreal Tournament לנצח",
    "originLink": "https://www.techdirt.com/2024/11/18/epic-allows-internet-archive-to-distribute-for-free-unreal-unreal-tournament-forever/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42190541",
    "commentBody": "",
    "originSummary": [
      "ישנה הצעה שאם HR 9495, הצעת חוק מוצעת, תעבור, היא עשויה לסווג את ארכיון האינטרנט כארגון טרור ללא הצדקה ברורה.",
      "החשש הועלה על ידי מקור אנונימי, המצביע על כך שסיווג זה עשוי שלא להיות מוקד או עדיפות עיקרית של הצעת החוק.",
      "ההשלכות של סיווג כזה עשויות להיות השלכות משמעותיות עבור ארכיון האינטרנט, ספרייה דיגיטלית המציעה גישה חופשית לאוסף עצום של תוכן דיגיטלי."
    ],
    "commentSummary": [
      "Epic Games התירה לארכיון האינטרנט להפיץ את Unreal ו-Unreal Tournament ללא הגבלת זמן, מה שמעורר תקוות לשחרורים בקוד פתוח פוטנציאליים בדומה ל-Quake.",
      "הקהילה של Unreal Tournament נשארת תוססת, עם דיונים על שימור ועדכון משחקים קלאסיים, במיוחד לאחר ההחלטה של Epic להסיר כותרים ישנים מחנויות.",
      "פתיחת קוד המקור של Unreal Engine 1 עשויה להתבצע בסופו של דבר, אך היא דורשת ניקוי משמעותי, ומהלך זה יכול להועיל ללמידה, פיתוח ושימור ההיסטוריה של משחקי מחשב."
    ],
    "points": 445,
    "commentCount": 104,
    "retryCount": 0,
    "time": 1732072550
  },
  {
    "id": 42190065,
    "title": "״Tiny Glade 'בנתה' את דרכה ליותר מ-600 אלף מכירות בחודש״",
    "originLink": "https://newsletter.gamediscover.co/p/how-tiny-glade-built-its-way-to-600k",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42190065",
    "commentBody": "",
    "originSummary": [
      "גלייד הקטנה, משחק בנייה מרגיע מאת Pounce Light, מכר מעל 600,000 עותקים בתוך חודש מהשקתו ב-Steam, מה שמצביע על הצלחה מסחרית משמעותית.",
      "המשחק צבר פופולריות באמצעות סרטונים ויראליים והשתתפות ב-Steam's Next Fest, מה שהוביל ליותר מ-1.3 מיליון רשימות משאלות, מה שמדגים אסטרטגיות שיווק יעילות.",
      "הצלחתו מיוחסת לחוויית הסנדבוקס השלווה והחסרת מטרות שלו ולטכנולוגיית יצירת התוכן הפרוצדורלית המרתקת שלו, שמושכת חובבי משחקים נינוחים ובניית ערים."
    ],
    "commentSummary": [
      "״טייני גלייד מכרה מעל 600,000 עותקים בחודש, מה שמיוחס למנוע התאורה המתקדם שלה ולמומחיות של המפתחים תומאש סטחוביאק ואנסטסיה אופר״.",
      "המשחק, שפותח באמצעות Rust ו-Vulkan, הפך לפופולרי בזכות שיווק יעיל ומעורבות קהילתית, והציג את הפוטנציאל של Rust בפיתוח משחקים.",
      "על אף ביקורת מסוימת על חוסר בעומק, Tiny Glade מציעה חוויית בנייה בסגנון זן, המדגישה את חשיבות בניית הקהילה לפני השקת המשחק."
    ],
    "points": 391,
    "commentCount": 95,
    "retryCount": 0,
    "time": 1732067113
  },
  {
    "id": 42191709,
    "title": "AAA – החלקה אנטי-אנליטית",
    "originLink": "https://blog.frost.kiwi/analytical-anti-aliasing/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42191709",
    "commentBody": "",
    "originSummary": [
      "נוגד-שינון אנליטי הוא טכניקה שנועדה להסיר קצוות משוננים (שינונים) בתמונות מרוסטר על ידי חישוב מוקדם של דהיית גבולות הצורות, מה שמבטיח קצוות חלקים ללא ארטיפקטים. שיטה זו יעילה מכיוון שהיא אינה דורשת מאגרים נוספים או חומרה והיא תואמת ל-WebGL 1.0 בסיסי, מה שהופך אותה לנגישה ליישומים שונים. היא מודגשת לשימוש מקצועי בפלטפורמות כמו Unity ו-Valve Software, ומציעה בהירות וחדות ללא הטשטוש הנפוץ בשיטות נוגד-שינון אחרות, כגון SSAA (נוגד-שינון על-דגימה), SMAA (נוגד-שינון מורפולוגי תת-פיקסלי) ו-DLAA (נוגד-שינון בלמידה עמוקה)."
    ],
    "commentSummary": [
      "המאמר 'AAA – ניתוח אנטי-אליאסינג' מתעמק בטכניקות אנטי-אליאסינג, תוך הדגשה על שיטות ניתוחיות ויישומן בתכנות גרפי.",
      "זה דן בוויכוח בין מרחבי הצבע הליניארי ו-sRGB, במגבלות של WebGL, ובאתגרים עם צורות חופפות, ומספק חקירה מקיפה של נושאים אלו.",
      "המאמר נודע בעומקו, באלמנטים האינטראקטיביים ובמשוב על הצגתו, תוך הדגשת המורכבות של הגדרות גרפיקה במשחקים."
    ],
    "points": 321,
    "commentCount": 37,
    "retryCount": 0,
    "time": 1732089800
  },
  {
    "id": 42193771,
    "title": "המקור של תמונת הטנק באגם שהפכה למם (2021)",
    "originLink": "https://history.stackexchange.com/questions/57033/what-is-the-origin-of-the-lake-tank-image-that-has-become-a-meme",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42193771",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "המם 'טנק האגם' מציג טנק פאנצר IV ששקע בנהר המז בבלגיה מתקופת מלחמת העולם השנייה, והוא פופולרי בקרב חובבי צבא וגיימרים.",
      "זה שואב הומור מהרעיון של קבלת חוכמה ממקורות בלתי צפויים, בדומה ל\"גברת האגם\" מהאגדה הארתוריאנית ולמם \"הסנפאי של הבריכה\".",
      "המשיכה הנישתית של המם נובעת בחלקה מהקשר שלו להקשרים היסטוריים ומשחקיים, מהדהדת עם קהילות מקוונות ספציפיות."
    ],
    "points": 306,
    "commentCount": 58,
    "retryCount": 0,
    "time": 1732109403
  },
  {
    "id": 42191394,
    "title": "יי פנג 3 חצה את שני הכבלים C-Lion 1 ו-BSC בזמנים התואמים לזמנים שבהם הם נשברו",
    "originLink": "https://bsky.app/profile/auonsson.bsky.social/post/3lbc5va7f722p",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42191394",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "ספינת מטען סינית, Yi Peng 3, לכאורה חתכה כבלים תת-ימיים בים הבלטי, מה שהוביל לחשדות לחבלה מכוונת.",
      "התנועות של הספינה, בפיקודו של קפטן ממוצא רוסי, התרחשו במקביל לשבירת הכבל, מה שהעלה חששות גיאופוליטיים.",
      "אירוע זה, בעקבות אירוע דומה באוקטובר 2023, הוביל להגברת הבדיקה והחקירות המתמשכות על ידי הצי הדני."
    ],
    "points": 289,
    "commentCount": 356,
    "retryCount": 0,
    "time": 1732085807
  },
  {
    "id": 42187506,
    "title": "מאימתי הפכו הערכות למועדים סופיים?",
    "originLink": "https://domainanalysis.io/p/architecture-modernization-execution",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42187506",
    "commentBody": "",
    "originSummary": [
      "בתוכניות מודרניזציה של תוכנה, יש לראות בהערכות כהנחיות גמישות ולא כמועדים קשיחים, בשל האופי הבלתי צפוי של פרויקטים כאלה.",
      "אנדו אלאגרסאמי משווה את המודרניזציה של אדריכלות לתיקון רכב, ומדגישה את הצורך בהתאמה ובאישורים נוספים כאשר מתעוררות בעיות בלתי צפויות.",
      "מנהיגות אפקטיבית בפרויקטים אלו כוללת שאילת שאלות מעמיקות, אימוץ ניסויים ושימוש במסגרות מתאימות כדי לנווט במורכבויות ולהשיג הצלחה."
    ],
    "commentSummary": [
      "הפוסט דן בבעיה הנפוצה שבה הנהלה מתייחסת להערכות פרויקטים כמועדים קשיחים, תוך התעלמות מגורמים כמו שינוי במפרטים שיכולים לגרום לעיכובים.",
      "נוהג זה מוביל להערכות מנופחות כאמצעי הגנה כדי להימנע מהאשמה על החמצת מה שנקרא \"מועדים\", מה שיכול לדכא חדשנות ועבודה כנה.",
      "הפתרון המוצע הוא לטפח תרבות ארגונית שמקבלת טעויות ומתמקדת בשיפור מתמיד במקום להטיל אשמה, ובכך לקדם סביבה חדשנית ופרודוקטיבית יותר."
    ],
    "points": 282,
    "commentCount": 207,
    "retryCount": 0,
    "time": 1732046590
  },
  {
    "id": 42188687,
    "title": "ספייס אקס סופר הבי נוחת במפרץ, מבטל נחיתה עם צ'ופסטיקס",
    "originLink": "https://twitter.com/spacex/status/1858995009384837380",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42188687",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "מאיץ הסופר כבד של SpaceX ביצע נחיתה רכה במפרץ מקסיקו כאמצעי בטיחות לאחר שבדיקות בריאות אוטומטיות עצרו את ניסיון הנחיתה על ה\"צ'ופסטיקס\" באתר השיגור. - טיסת המבחן הדגימה בהצלחה הדלקת מנוע מחדש בחלל, מה שמסמן אבן דרך משמעותית לטיסות מסלוליות עתידיות ולמטרת SpaceX לשימוש חוזר מהיר עם הסטארשיפ. - בעוד SpaceX שואפת לשיגורים תכופים ולמשימות כמו יישוב מאדים, לוח הזמנים להשגת מטרות אלו אינו ודאי בשל אתגרים טכניים ורגולטוריים פוטנציאליים."
    ],
    "points": 260,
    "commentCount": 390,
    "retryCount": 0,
    "time": 1732054534
  },
  {
    "id": 42187761,
    "title": "באמצעות עדכוני קוד חם של ארלנג",
    "originLink": "https://underjord.io/how-i-use-erlang-hot-code-updates.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42187761",
    "commentBody": "",
    "originSummary": [
      "אנדריורד, צוות ייעוץ של אליקסיר, חוקר את עדכוני הקוד החמים של ארלנג, תכונה ייחודית המאפשרת שינויי קוד מבלי לעצור את המערכת.",
      "על אף שאליקסיר, המבוססת על ארלנג, תומכת בעדכוני קוד חמים, המהדורה הסטנדרטית של mix חסרה את הקבצים הנדרשים, מה שמוביל מומחים להמליץ ללמוד מיומנות זו.",
      "עדכוני קוד חמים הם שימושיים במיוחד בפיתוח עם Nerves עבור מכשירים משובצים, ויותר כלים ב-Elixir יכולים לשפר את התהליך הזה."
    ],
    "commentSummary": [
      "עדכוני קוד חם של ארלנג מאפשרים פריסה מהירה של תיקונים מבלי לנתק משתמשים, מה שמועיל במיוחד למערכות עם חיבורים ארוכי טווח, כמו טלפוניה.",
      "על אף שהעדכונים הללו יכולים להיות מורכבים ומסוכנים, ויכולים להוביל למצבים שאינם ניתנים לשחזור, הם חיוניים לשמירה על חיבורים רציפים במערכות בזמן אמת.",
      "בעוד שיש הממליצים על פריסות מתגלגלות פשוטות יותר, עדכוני קוד חמים מספקים יתרונות ייחודיים במצבים שבהם שירות בלתי מופרע הוא קריטי, למרות האתגרים שהם מציבים."
    ],
    "points": 254,
    "commentCount": 47,
    "retryCount": 0,
    "time": 1732048143
  },
  {
    "id": 42189581,
    "title": "Apple מאשרת התקפות יום אפס הפוגעות במערכות macOS",
    "originLink": "https://www.securityweek.com/apple-confirms-zero-day-attacks-hitting-intel-based-macs/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42189581",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Apple הכירה במתקפות יום אפס על מערכות macOS והמליצה למשתמשים לעדכן לגרסאות האחרונות: iOS 18.1.1, macOS Sequoia 15.1.1, ו-iOS 17.7.2.",
      "הפגיעויות כוללות תוכן אינטרנט זדוני שעלול לאפשר ביצוע קוד שרירותי, מה שמדגיש את הצורך הקריטי בעדכוני תוכנה בזמן.",
      "תקלה זו היא חלק מבעיה חוזרת עם מכשירי אייפון, אשר בעבר חוו פגיעויות אבטחה שניתן לנצל דרך האינטרנט, כולל פריצות מבוססות רשת."
    ],
    "points": 251,
    "commentCount": 92,
    "retryCount": 0,
    "time": 1732062390
  },
  {
    "id": 42190650,
    "title": "להבין את אלגוריתם החיפוש בטקסט מלא BM25",
    "originLink": "https://emschwartz.me/understanding-the-bm25-full-text-search-algorithm/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42190650",
    "commentBody": "",
    "originSummary": [
      "BM25, או Best Match 25, הוא אלגוריתם נפוץ לחיפוש טקסט מלא, המיושם במערכות כמו Lucene/Elasticsearch ו-SQLite, ולעיתים קרובות משולב עם חיפוש דמיון וקטורי במערכות חיפוש היברידיות.",
      "זה מדרג מסמכים על פי הרלוונטיות לשאילתה באמצעות גורמים כמו מונחי השאילתה, תדירות מסמכים הפוכה (IDF), תדירות מונחים ונרמול אורך המסמך, בהתאם לעקרון דירוג ההסתברות.",
      "ציוני BM25 הם תלויי הקשר, כלומר הם ניתנים להשוואה בתוך אותה אוסף מסמכים אך לא בין אוספים שונים או לאורך זמן, בשל שינויים פוטנציאליים באוסף המשפיעים על הציונים."
    ],
    "commentSummary": [
      "הדיון מתמקד באלגוריתם החיפוש BM25 ובשילובו עם טכנולוגיות חיפוש מודרניות, כמו מערכות היברידיות כגון Typesense שמשלבות את BM25 עם חיפוש סמנטי מבוסס וקטורים. המשתתפים דנים ביעילות של BM25 בהשוואה למודלים לימודיים חדשים יותר, כאשר חלקם תומכים בהמשך השימוש בו ואחרים מציעים מודלים סטטיסטיים מתקדמים יותר. השיחה גם חוקרת כלים ושיטות כמו Reciprocal Rank Fusion (RRF) ותפקיד הלמידה החישובית בשיפור יכולות החיפוש."
    ],
    "points": 236,
    "commentCount": 45,
    "retryCount": 0,
    "time": 1732074190
  },
  {
    "id": 42190863,
    "title": "בלנדר 4.3",
    "originLink": "https://www.blender.org/download/releases/4-3/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42190863",
    "commentBody": "",
    "originSummary": [
      "בלנדר 4.3, ששוחרר ב-19 בנובמבר 2024, מביא עדכונים משמעותיים, כולל קישור אור וצל של EEVEE, צומת BSDF מתכתי חדש וצומת טקסטורת רעש גאבור.",
      "השיפורים כוללים קומפוזיציה אינטראקטיבית מרובת-מעברים, עריכת UV משופרת, ועדכונים משמעותיים ל-Geometry Nodes ול-Grease Pencil לשיפור הביצועים וכלים חדשים.",
      "השחרור כולל גם שיפורים בממשק המשתמש, שיפורים בעורך הווידאו, תמיכה ב-Vulkan backend, ונשאר חינמי, נתמך על ידי תרומות מהקהילה."
    ],
    "commentSummary": [
      "בלנדר 4.3, במיוחד עם התוסף בונסאי, מומלץ לשיפוץ ביתי בשל יכולות התכנון המפורטות שלו.",
      "התוכנה זוכה לשבחים על המודל הקוד הפתוח שלה, התמיכה החזקה מהקהילה וקרן הפיתוח, התורמים להצלחתה ולשיפורה המתמשך.",
      "משתמשים מדגישים את הרבגוניות של בלנדר באמנות והדפסת תלת מימד, ומציעים מדריכים כמו מדריך הסופגניה למתחילים כדי להתגבר על עקומת הלמידה שלו."
    ],
    "points": 232,
    "commentCount": 106,
    "retryCount": 0,
    "time": 1732077552
  },
  {
    "id": 42187766,
    "title": "Riak פתוח – מזלג Riak פתוח ומודרני",
    "originLink": "https://github.com/OpenRiak",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42187766",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "OpenRiak הוא מזלג מודרני של מסד הנתונים Riak, המנוהל על ידי מהנדסים מלקוחותיו הגדולים, ומתמקד בשיפור היציבות בתרחישי כשל מורכבים.",
      "בתמיכת קרן אקוסיסטם ארלנג, OpenRiak נשאר מוצר נישה אך עשוי למשוך משתמשים עם דרישות לא-פונקציונליות ספציפיות.",
      "הקהילה של OpenRiak מתמקדת כרגע ב-Riak KV, כאשר מזלגות אחרים מתוחזקים על ידי TI Tokyo, ויש תוכניות לשתף פיתוחים עתידיים בקרוב."
    ],
    "points": 203,
    "commentCount": 69,
    "retryCount": 0,
    "time": 1732048170
  },
  {
    "id": 42190395,
    "title": "Webvm: מכונה וירטואלית עבור האינטרנט",
    "originLink": "https://github.com/leaningtech/webvm",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42190395",
    "commentBody": "",
    "originSummary": [
      "WebVM היא מכונה וירטואלית של לינוקס שפועלת בתוך דפדפן אינטרנט באמצעות HTML5 ו-WebAssembly, תוך שימוש במנוע הווירטואליזציה CheerpX לתמיכה בקבצים בינאריים של x86.",
      "זה מציע סביבה ללא שרת, בצד הלקוח, עם יכולות רשת המופעלות באמצעות Tailscale, רשת VPN, מה שהופך אותה לנגישה ללא תשתית שרת מסורתית.",
      "WebVM הוא קוד פתוח תחת רישיון Apache 2.0, עם מגבלות ספציפיות לשימוש ארגוני, וניתן לפרוס אותו על ידי יצירת פיצול (fork) של המאגר, הפעלת GitHub Pages והתאמת Dockerfiles."
    ],
    "commentSummary": [
      "WebVM, שפותחה על ידי Leaning Technologies, היא מכונה וירטואלית המיועדת לשימוש באינטרנט, עם יישומים פוטנציאליים בוירטואליזציה של אפליקציות ארגוניות ותוכניות לתמוך במכולות Docker.",
      "CheerpX, רכיב קנייני, הוא חיוני להצעות של WebVM, ומספק תמיכה ל-Flash ו-Java, למרות ש-WebVM עצמו הוא קוד פתוח.",
      "על אף חוסר היכולת שלו לפעול במצב לא מקוון בשל הצורך בנתונים גדולים, WebVM תומך ב-Tailscale לצורכי רשת, ויש עניין מצד המשתמשים בהיתכנות ובביצועים של מכונות וירטואליות מבוססות רשת."
    ],
    "points": 190,
    "commentCount": 50,
    "retryCount": 0,
    "time": 1732070723
  },
  {
    "id": 42193549,
    "title": "בלוסקיי מביאה עידן של בחירת אלגוריתם אישי במדיה החברתית",
    "originLink": "https://www.newscientist.com/article/2456782-bluesky-is-ushering-in-a-pick-your-own-algorithm-era-of-social-media/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42193549",
    "commentBody": "",
    "originSummary": [
      "בלוסקיי, רשת חברתית עם למעלה מ-20 מיליון משתמשים, מספקת שליטה מותאמת אישית על אלגוריתמים של מדיה חברתית, ומאפשרת למשתמשים לבחור את התוכן שלהם.",
      "בניגוד לפלטפורמות כמו X (לשעבר טוויטר), שבהן אלגוריתמים מכתיבים את התוכן, Bluesky מציעה \"שוק של אלגוריתמים\" שבו משתמשים יכולים לבחור פידים על פי תחומי עניין.",
      "גישה זו מעצימה את המשתמשים לעצב את חוויית המדיה החברתית שלהם ויכולה לקבוע סטנדרט חדש בתעשייה, למרות האתגרים במציאת או יצירת הפיד הנכון."
    ],
    "commentSummary": [
      "בלוסקיי משיקה אלגוריתמים מותאמים אישית למדיה חברתית, המאפשרים למשתמשים לבחור כיצד הם רואים תוכן, בין אם בסדר כרונולוגי או באמצעות מיון אלגוריתמי.",
      "הצגת התכונות הללו מעוררת ויכוח האם אלגוריתמים משפרים או מפחיתים את חוויית המשתמש, כאשר הדעות חלוקות בין הצורך בשליטת המשתמש לבין היתרונות של תוכן מותאם אישית.",
      "בלוסקיי שואפת לאזן בין העדפות המשתמשים למעורבות על ידי הצעת פיד כרונולוגי כברירת מחדל תוך מתן אפשרויות לצפייה בתוכן מותאם אישית."
    ],
    "points": 175,
    "commentCount": 185,
    "retryCount": 0,
    "time": 1732107595
  }
]
