[
  {
    "id": 41574844,
    "title": "एप्पल मोबाइल प्रोसेसर अब अमेरिका में टीएसएमसी द्वारा बनाए जाते हैं",
    "originLink": "https://timculpan.substack.com/p/apple-mobile-processors-are-now-made",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41574844",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "एप्पल मोबाइल प्रोसेसर अब टीएसएमसी द्वारा अमेरिका में निर्मित किए जा रहे हैं, जो अमेरिकी विनिर्माण और राष्ट्रीय सुरक्षा के लिए एक महत्वपूर्ण जीत है।",
      "यह कदम TSMC से अमेरिकी कार्यबल में मूल्यवान ज्ञान को स्थानांतरित करता है, भले ही CHIPS अधिनियम जैसी सरकारी हस्तक्षेपों की प्रभावशीलता पर बहस हो रही हो।",
      "आलोचकों का तर्क है कि जबकि अमेरिकी विनिर्माण में वृद्धि हुई है, इसका जीडीपी और कार्यबल में हिस्सा स्वचालन और उच्च मूल्य वाली वस्तुओं के कारण घट गया है, जिससे टैरिफ और सब्सिडी के दीर्घकालिक प्रभाव पर सवाल उठते हैं।"
    ],
    "points": 1367,
    "commentCount": 656,
    "retryCount": 0,
    "time": 1726623481
  },
  {
    "id": 41578483,
    "title": "वर्डफ्रीक को अपडेट क्यों नहीं किया जाएगा",
    "originLink": "https://github.com/rspeer/wordfreq/blob/master/SUNSET.md",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41578483",
    "commentBody": "",
    "originSummary": [
      "वर्डफ्रेक डेटा, जो 2021 तक विभिन्न ऑनलाइन स्रोतों से भाषा का एक स्नैपशॉट है, कई प्रमुख कारणों से अपडेट नहीं किया जाएगा।",
      "2021 के बाद की भाषा डेटा अविश्वसनीय है क्योंकि एआई-जनित सामग्री की बाढ़ के कारण शब्द आवृत्तियों में विकृति आती है, जैसे कि ChatGPT द्वारा कुछ शब्दों का अत्यधिक उपयोग।",
      "पहले मुफ्त में उपलब्ध स्रोतों जैसे ट्विटर और रेडिट तक पहुंच अब उच्च लागत पर होती है, और प्राकृतिक भाषा प्रसंस्करण (NLP) के क्षेत्र ने अब जनरेटिव एआई पर ध्यान केंद्रित कर लिया है, जिससे नैतिक चिंताएं उत्पन्न हो रही हैं और पारंपरिक पाठ डेटा संग्रह में रुचि कम हो रही है।"
    ],
    "commentSummary": [
      "वर्डफ्रीक को अब अपडेट नहीं किया जाएगा क्योंकि एआई-जनित सामग्री ने वेब को प्रदूषित कर दिया है, जिससे मानव भाषा का विश्लेषण करना अविश्वसनीय हो गया है।",
      "एआई-जनित सामग्री का मुद्दा एसईओ प्रथाओं के कारण उत्पन्न मौजूदा समस्याओं को बढ़ा देता है, जिससे भाषा मॉडलों के प्रशिक्षण डेटा की गुणवत्ता प्रभावित होती है और पक्षपाती शब्द आवृत्तियों का कारण बनता है।",
      "चर्चा मानव-लिखित सामग्री और एआई-जनित पाठ के बीच अंतर करने की चुनौतियों और भाषा और संचार के लिए इसके व्यापक प्रभावों को रेखांकित करती है।"
    ],
    "points": 992,
    "commentCount": 312,
    "retryCount": 0,
    "time": 1726659715
  },
  {
    "id": 41573034,
    "title": "23andMe के स्वतंत्र निदेशकों ने बोर्ड से इस्तीफा दिया",
    "originLink": "https://investors.23andme.com/news-releases/news-release-details/independent-directors-23andme-resign-board/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41573034",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "23andMe के स्वतंत्र निदेशकों ने दो एंटी-कैंसर दवाओं के सकारात्मक चरण 2 नैदानिक परिणामों की प्रस्तुति के बाद इस्तीफा दे दिया।",
      "सीईओ ऐन वोजिकी का कंपनी को $0.40 प्रति शेयर पर निजी बनाने का प्रयास, जो इसके deSPAC मूल्य से काफी कम है, उनकी प्रबंधन और कॉर्पोरेट गवर्नेंस के बारे में चिंताएं बढ़ाता है।",
      "23andMe का बाजार पूंजीकरण $172 मिलियन है, जो इसके प्रतिस्पर्धी Ancestry.com से बिल्कुल विपरीत है, जिसे $4.7 बिलियन में अधिग्रहित किया गया था।"
    ],
    "points": 572,
    "commentCount": 311,
    "retryCount": 0,
    "time": 1726608709
  },
  {
    "id": 41571862,
    "title": "macOS Sequoia 15 DNS एन्क्रिप्शन को बायपास कर सकता है",
    "originLink": "https://www.obdev.at/blog/warning-macos-sequoia-15-may-bypass-dns-encryption/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41571862",
    "commentBody": "",
    "originSummary": [
      "लिटिल स्निच 6.1 में एक DNS एन्क्रिप्शन समस्या थी जहां कुछ DNS अनुरोध एन्क्रिप्टेड प्रॉक्सी को बायपास कर अनएन्क्रिप्टेड भेजे जा रहे थे, जिससे निम्न-स्तरीय लेगसी एपीआई प्रभावित हो रहे थे।",
      "समस्या विशेष रूप से macOS 15 Sequoia से संबंधित थी और Firefox जैसे ब्राउज़रों को प्रभावित कर रही थी, लेकिन Safari या Chrome को नहीं; इसे Little Snitch संस्करण 6.1.1 में ठीक कर दिया गया है।",
      "यह बग कम से कम macOS 14.5 Sonoma से मौजूद है, और उपयोगकर्ता इसे Little Snitch में DNS एन्क्रिप्शन सक्षम करके और Wireshark के साथ पोर्ट 53 ट्रैफिक को कैप्चर करके पुन: उत्पन्न कर सकते हैं।"
    ],
    "commentSummary": [
      "प्रारंभिक चिंताएँ कि macOS Sequoia 15 DNS एन्क्रिप्शन को बायपास कर रहा है, यह पाया गया कि वे Little Snitch 6.1 के लिए विशिष्ट थीं, न कि सामान्य macOS समस्या।",
      "समस्या को Little Snitch के एक अपडेट में संबोधित किया जाएगा, जो सॉफ़्टवेयर-विशिष्ट समस्या निवारण के महत्व को उजागर करता है।",
      "चर्चा DNS समाधान एपीआई की जटिलता और पारंपरिक POSIX कार्यों जैसे `getaddrinfo()` की तुलना में उच्च-स्तरीय फ्रेमवर्क के प्रति Apple की प्राथमिकता को रेखांकित करती है।"
    ],
    "points": 518,
    "commentCount": 185,
    "retryCount": 0,
    "time": 1726602365
  },
  {
    "id": 41571606,
    "title": "स्विफ्ट 6",
    "originLink": "https://www.swift.org/blog/announcing-swift-6/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41571606",
    "commentBody": "",
    "originSummary": [
      "स्विफ्ट 6 जारी कर दिया गया है, जिससे इसका उपयोग अधिक प्लेटफार्मों और क्षेत्रों में विस्तारित हो गया है, जिसमें पुस्तकालय, इंटरनेट-स्तरीय सेवाएं, और प्रदर्शन-महत्वपूर्ण कोड शामिल हैं।",
      "मुख्य विशेषताओं में नए समवर्ती उपकरण, टाइप्ड थ्रो, गैर-प्रतिलिप्य प्रकारों के लिए समर्थन, उन्नत C++ इंटरऑपरेबिलिटी, और माइक्रोकंट्रोलर्स के लिए एम्बेडेड स्विफ्ट का पूर्वावलोकन शामिल हैं।",
      "प्लेटफ़ॉर्म समर्थन को विस्तारित किया गया है जिसमें लिनक्स के लिए स्थिर SDKs, नई लिनक्स वितरणों के लिए आधिकारिक समर्थन, और विंडोज के लिए बेहतर निर्माण प्रदर्शन शामिल हैं।"
    ],
    "commentSummary": [
      "स्विफ्ट स्विफ्ट वर्किंग ग्रुप™ ओपन-सोर्स समुदाय और एप्पल के बीच तनाव का सामना कर रहा है, जिसके परिणामस्वरूप तकनीकी ऋण और अधूरी विशेषताएं जैसे परिणाम बिल्डर्स हो रही हैं।",
      "भाषा की जटिलता और संस्करण-विशिष्ट समस्याएं नए उपयोगकर्ताओं को हतोत्साहित कर रही हैं, इसके बावजूद कि इसमें क्रॉस-प्लेटफॉर्म क्षमताएं और Swift 6 में आने वाले सुधार जैसे मजबूत पक्ष हैं।",
      "स्विफ्ट के विकास के बारे में मिश्रित राय हैं, कुछ लोग इसकी विशेषताओं की प्रशंसा करते हैं जबकि अन्य इसकी बढ़ती जटिलता और शासन चुनौतियों की आलोचना करते हैं।"
    ],
    "points": 379,
    "commentCount": 316,
    "retryCount": 0,
    "time": 1726600858
  },
  {
    "id": 41575323,
    "title": "स्क्रैम्बल: ग्रामरली के लिए ओपन-सोर्स विकल्प",
    "originLink": "https://github.com/zlwaterfield/scramble",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41575323",
    "commentBody": "",
    "originSummary": [
      "स्क्रैम्बल एक ओपन-सोर्स क्रोम एक्सटेंशन है जो गोपनीयता का सम्मान करने वाले विकल्प के रूप में कार्य करता है, और ब्राउज़र में सीधे लेखन को सुधारने के लिए एआई का उपयोग करता है।",
      "उपयोगकर्ताओं को स्रोत कोड को क्लोन/डाउनलोड करना होगा और इसे मैन्युअल रूप से Chrome में लोड करना होगा क्योंकि यह Chrome वेब स्टोर पर समीक्षा के लिए लंबित है।",
      "एक्सटेंशन को एक OpenAI API कुंजी की आवश्यकता होती है और यह विभिन्न टेक्स्ट संवर्धन विकल्प प्रदान करता है, भविष्य में और अधिक सुविधाओं और अतिरिक्त भाषा मॉडलों के समर्थन की योजना के साथ।"
    ],
    "commentSummary": [
      "स्क्रैम्बल एक ओपन-सोर्स क्रोम एक्सटेंशन है जिसे गोपनीयता-सम्मानजनक विकल्प के रूप में डिज़ाइन किया गया है, जो लेखन सुधार के लिए एक ओपनएआई एपीआई कुंजी का उपयोग करता है।",
      "लेखक गोपनीयता चिंताओं को दूर करने के लिए स्थानीय एआई मॉडलों के समर्थन को जोड़ने की योजना बना रहे हैं, क्योंकि वर्तमान कार्यान्वयन कीस्ट्रोक्स को OpenAI को भेजता है।",
      "मुख्य विशेषताओं में पूर्व-निर्धारित प्रॉम्प्ट्स, सुझावों के लिए टेक्स्ट हाइलाइटिंग, और भविष्य की योजनाओं में अनुकूलन योग्य प्रॉम्प्ट्स और LLM (बड़ा भाषा मॉडल) प्रदाता विकल्प शामिल हैं।"
    ],
    "points": 372,
    "commentCount": 151,
    "retryCount": 0,
    "time": 1726628374
  },
  {
    "id": 41571454,
    "title": "क्रेज़म: उच्च एजेंसी व्यक्तिगत योगदानकर्ता [वीडियो]",
    "originLink": "https://www.youtube.com/watch?v=dLTUqPue9sQ",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41571454",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Krazam ने एक नया वीडियो जारी किया है जिसका शीर्षक है 'हाई एजेंसी इंडिविजुअल कॉन्ट्रिब्यूटर,' जिसने टेक समुदाय के भीतर काफी ध्यान और चर्चा प्राप्त की है।",
      "वीडियो की प्रशंसा इसकी विस्तृत निर्माण प्रक्रिया के लिए की जाती है, जिसमें एक व्हाइटबोर्ड पर बनाई गई भित्ति चित्र शामिल है जिसे बनाने में घंटों लगे, और इसके हास्यपूर्ण और तकनीकी पेशेवरों के लिए संबंधित सामग्री के लिए की जाती है।",
      "दर्शकों ने वीडियो से विभिन्न पसंदीदा क्षणों और संदर्भों को साझा किया है, जो इसकी व्यापक अपील और इसकी सामग्री की गहराई को दर्शाता है, जो उद्योग में कई लोगों के साथ मेल खाती है।"
    ],
    "points": 260,
    "commentCount": 53,
    "retryCount": 0,
    "time": 1726600043
  },
  {
    "id": 41571971,
    "title": "उच्च-स्तरीय प्रोग्रामरों के लिए असेंबली का एक मैत्रीपूर्ण परिचय",
    "originLink": "https://shikaan.github.io/assembly/x86/guide/2024/09/08/x86-64-introduction-hello.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41571971",
    "commentBody": "",
    "originSummary": [
      "लेख उच्च-स्तरीय प्रोग्रामरों को असेंबली भाषा से परिचित कराता है, जिसका उद्देश्य इसे सरल और सुलभ बनाना है।",
      "यह x86-64 असेंबली में Intel सिंटैक्स का उपयोग करते हुए एक \"Hello World\" उदाहरण प्रदान करता है, जो निर्देशों, रजिस्टरों और सिस्टम कॉल्स जैसे प्रमुख अवधारणाओं को समझाता है।",
      "यह सामग्री अनुभवी प्रोग्रामरों को सरल असेंबली प्रोग्राम समझने और लिखने में मदद करने के लिए डिज़ाइन की गई है, और भविष्य के लेखों में अधिक जटिल उदाहरणों का वादा किया गया है।"
    ],
    "commentSummary": [
      "यह पोस्ट उच्च-स्तरीय प्रोग्रामरों को असेंबली भाषा से परिचित कराती है, एक शुरुआती-अनुकूल ट्यूटोरियल प्रदान करती है।",
      "चर्चा में MIPS, 6502, ARM, और RISC-V जैसी विभिन्न असेंबली भाषाओं पर प्रकाश डाला गया है, जिसमें उपयोगकर्ता अपनी सीखने की अनुभव और पसंद साझा कर रहे हैं।",
      "ट्यूटोरियल की पहुंच और स्पष्टता की प्रशंसा की जाती है, साथ ही सुधारों और आधुनिक निर्देश सेट सीखने के लिए अतिरिक्त संसाधनों के सुझाव दिए जाते हैं।"
    ],
    "points": 239,
    "commentCount": 48,
    "retryCount": 0,
    "time": 1726602999
  },
  {
    "id": 41571911,
    "title": "डबल आयरिश डच सैंडविच: एक कर चोरी रणनीति का अंत",
    "originLink": "https://conversableeconomist.com/2024/09/12/the-double-irish-dutch-sandwich-end-of-a-tax-evasion-strategy/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41571911",
    "commentBody": "",
    "originSummary": [
      "डबल आयरिश डच सैंडविच, एक कर चोरी रणनीति, कर समझौतों और सुधारों में बदलाव के कारण काफी हद तक समाप्त हो गई है।",
      "2015 में आयरिश कर सुधार और 2017 के अमेरिकी टैक्स कट्स एंड जॉब्स एक्ट ने इस रणनीति को अप्रभावी बना दिया, जिससे आयरिश कंपनियों से अमेरिकी मूल कंपनियों को रॉयल्टी भुगतान में महत्वपूर्ण वृद्धि हुई।",
      "रॉयल्टी भुगतान में बदलाव कर रणनीतियों के विकास को दर्शाता है और इसमें शामिल लागतों को भी उजागर करता है, जिसमें सरकारी राजस्व का नुकसान और कर चोरी की ओर प्रतिभा का मोड़ शामिल है।"
    ],
    "commentSummary": [
      "\"डबल आयरिश डच सैंडविच,\" एक कर चोरी रणनीति, को धीरे-धीरे समाप्त किया जा रहा है, जिससे कॉर्पोरेट कर योजना और सरकारी राजस्व पर प्रभाव पड़ रहा है।",
      "अमेरिकी नागरिक जो विदेशी निगमों के मालिक हैं, उन्हें जटिल कर रिपोर्टिंग आवश्यकताओं का सामना करना पड़ता है, जिसमें जटिल प्रश्नों वाले फॉर्म और संभावित दोहरे कराधान के मुद्दे शामिल हैं।",
      "करों से बचने के लिए अमेरिकी नागरिकता का त्याग करना महत्वपूर्ण चुनौतियों को शामिल करता है, जैसे निकास कर और संभावित स्थायी रूप से अमेरिका में प्रवेश न कर पाने की स्थिति।"
    ],
    "points": 226,
    "commentCount": 213,
    "retryCount": 0,
    "time": 1726602664
  },
  {
    "id": 41581687,
    "title": "CUNY ने अपने एचआर सॉफ्टवेयर के लिए Oracle को $600M का भुगतान किया (2013)",
    "originLink": "http://pscbc.blogspot.com/2013/03/cuny-first-computer-system-to-aid.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41581687",
    "commentBody": "",
    "originSummary": [
      "CUNYFirst को सभी विश्वविद्यालय व्यापार प्रक्रियाओं को एक प्रणाली में एकीकृत करने के लिए डिज़ाइन किया गया था, जिसका उद्देश्य लागत बचत करना और सूचना तक पहुंच में सुधार करना है।",
      "सीयूएनवाई सेंट्रल का मुख्य लक्ष्य कॉलेज गतिविधियों, जिसमें पाठ्यक्रम और विवेकाधीन निधियाँ शामिल हैं, पर नियंत्रण प्राप्त करना था, न कि दक्षता पर ध्यान केंद्रित करना।",
      "अपर्याप्त वित्तपोषण के कारण, Oracle-PeopleSoft ने केवल सिस्टम को कॉन्फ़िगर किया, जिससे अक्षमताएं, बढ़ी हुई लागतें, कर्मचारियों के लिए अतिरिक्त कार्यभार, एक पुराना इंटरफ़ेस, और अपर्याप्त सुरक्षा उत्पन्न हुई।"
    ],
    "commentSummary": [
      "CUNY द्वारा 2013 में Oracle HR सॉफ़्टवेयर की $600 मिलियन की खरीद ने इस बात पर बहस छेड़ दी है कि ऑफ-द-शेल्फ टूल्स के अनुरूप व्यावसायिक प्रक्रियाओं को अनुकूलित करने की लागत और प्रभावशीलता बनाम सॉफ़्टवेयर को अनुकूलित करने की तुलना में क्या है।",
      "आलोचकों का तर्क है कि ओरेकल की 'केवल कॉन्फ़िगर' सीमा ने क्षमताओं की हानि की और कर्मचारियों, संकाय और छात्रों को समायोजित करने के लिए मजबूर किया, जिससे दक्षता और अनुकूलनशीलता के बारे में चिंताएँ बढ़ गईं।",
      "विशेष रूप से शैक्षणिक सेटिंग्स में, बड़े पैमाने पर सॉफ्टवेयर सौदों की उच्च लागत और संभावित अक्षमता विवादास्पद बनी रहती है और अनुकूलन और मानकीकरण के बीच चल रही बहस को उजागर करती है।"
    ],
    "points": 223,
    "commentCount": 134,
    "retryCount": 0,
    "time": 1726675684
  },
  {
    "id": 41575908,
    "title": "26 वर्षीय ईवाई कर्मचारी 'कार्य तनाव' के कारण शामिल होने के चार महीने बाद निधन हो गया",
    "originLink": "https://old.reddit.com/r/CharteredAccountants/comments/1fj08v9/ey_employee_died_of_work_pressure",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41575908",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "एक 26 वर्षीय ईवाई कर्मचारी 'काम के तनाव' से सिर्फ चार महीने बाद ही मर गया, जो कई भारतीय कंपनियों में तीव्र दबाव और विषाक्त कार्य संस्कृति को उजागर करता है।",
      "भारतीय शिक्षा प्रणाली की प्रतिस्पर्धात्मक प्रकृति, जो कम उम्र से ही शुरू होती है, पेशेवर जीवन तक विस्तारित होती है, जिससे गंभीर तनाव और कभी-कभी दुखद परिणाम उत्पन्न होते हैं।",
      "इसी तरह की समस्याएं अन्य देशों जैसे अमेरिका और जापान में भी देखी जाती हैं, जहां अत्यधिक प्रतिस्पर्धी वातावरण और खराब प्रबंधन प्रथाएं भी कर्मचारियों में उच्च तनाव स्तर में योगदान करती हैं।"
    ],
    "points": 179,
    "commentCount": 102,
    "retryCount": 0,
    "time": 1726635022
  },
  {
    "id": 41577156,
    "title": "स्वयं-होस्टिंग के लिए सौम्य मार्गदर्शिका",
    "originLink": "https://knhash.in/gentle-guide-to-self-hosting/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41577156",
    "commentBody": "",
    "originSummary": [
      "लेख एकाधिकार के खिलाफ विद्रोह के रूप में और बौद्धिक संतोष के लिए स्व-होस्टिंग सॉफ़्टवेयर को पुनः देखने के लिए प्रोत्साहित करता है, जो क्लाउड कंप्यूटिंग की सुविधा के विपरीत है।",
      "यह साझा वेब होस्टिंग के लिए उबर्स्पेस की सिफारिश करता है, जो SSH एक्सेस, 10GB स्टोरेज, और 1.5GB RAM प्रदान करता है, लेकिन यह नोट करता है कि मेमोरी सीमाओं के कारण Docker समर्थित नहीं है।",
      "स्वयं-होस्टेड सॉफ़्टवेयर के रूप में सुझाए गए विकल्पों में वित्त प्रबंधन के लिए Actual Budget और RSS फ़ीड पढ़ने के लिए Miniflux शामिल हैं, साथ ही सेवाओं को प्रदर्शित करने के लिए एक व्यक्तिगत डोमेन प्राप्त करने की सलाह भी दी गई है।"
    ],
    "commentSummary": [
      "एक हैकर न्यूज़ चर्चा 'स्वयं-होस्टिंग' की बदलती परिभाषा और इसके प्रभावों का अन्वेषण करती है, यह बहस करते हुए कि क्या साझा होस्टिंग या प्रबंधित सेवाएं योग्य हैं।",
      "मुख्य बिंदुओं में स्व-होस्टिंग के लाभ शामिल हैं, जैसे डेटा का स्वामित्व और विक्रेता लॉक-इन से बचना, और तकनीकी पहलू जैसे होम सर्वर सेटअप और सुरक्षा चिंताएँ।",
      "सुरक्षित पहुंच के लिए Tailscale और WireGuard जैसे उपकरणों का उल्लेख किया गया है, जिसमें उपयोगकर्ता अपने व्यक्तिगत सेटअप और अनुभव साझा करते हैं, आत्म-होस्टिंग से मिलने वाली खुशी और सीख को उजागर करते हैं।"
    ],
    "points": 178,
    "commentCount": 72,
    "retryCount": 0,
    "time": 1726647365
  },
  {
    "id": 41573550,
    "title": "दांतों की गुहाओं की मृत्यु की रिपोर्टें अत्यधिक बढ़ा-चढ़ाकर पेश की गई हैं",
    "originLink": "https://www.mcgill.ca/oss/article/medical-critical-thinking-technology/reports-death-dental-cavities-are-greatly-exaggerated",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41573550",
    "commentBody": "",
    "originSummary": [
      "लुमिना, एक आनुवंशिक रूप से संशोधित बैक्टीरिया जिसे दंत क्षय को रोकने के लिए डिज़ाइन किया गया है, की सुरक्षा और प्रभावशीलता के लिए पूरी तरह से परीक्षण नहीं किया गया है।",
      "दंत क्षय मौखिक बैक्टीरिया के असंतुलन के कारण होते हैं, न कि केवल स्ट्रेप्टोकोकस म्यूटन्स (एस. म्यूटन्स) के कारण।",
      "कैविटी को रोकने के सिद्ध तरीकों में शुगर का सेवन कम करना और फ्लोराइड टूथपेस्ट का उपयोग करना शामिल है।"
    ],
    "commentSummary": [
      "लुमिना, एक उत्पाद जो दंत गुहाओं को कम करने के लिए डिज़ाइन किया गया है, पूर्ण रोकथाम की गारंटी नहीं दे सकता है लेकिन गुहाओं की दर को काफी हद तक कम कर सकता है।",
      "आलोचक मानते हैं कि कैविटी में 50% की कमी भी एक महत्वपूर्ण सुधार होगी, हालांकि हानिकारक मोनो-संस्कृतियों और अधिक शोध की आवश्यकता को लेकर चिंताएँ बनी हुई हैं।",
      "बहस एक व्यापक प्रवृत्ति को उजागर करती है जिसमें नई समाधानों को उनके संभावित लाभों के बावजूद केवल इसलिए खारिज कर दिया जाता है क्योंकि वे पूर्ण नहीं हैं, और यह भी नोट करती है कि एफडीए विनियमों ने परीक्षण और विकास में बाधा डाली है।"
    ],
    "points": 178,
    "commentCount": 133,
    "retryCount": 0,
    "time": 1726612018
  },
  {
    "id": 41579355,
    "title": "कनाडाई अध्ययन के अनुसार, एआई उपकरण अस्पताल में अप्रत्याशित मौतों को 26% तक कम करता है",
    "originLink": "https://www.cbc.ca/news/health/ai-health-care-1.7322671",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41579355",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "एक कनाडाई अध्ययन ने खुलासा किया कि एक एआई उपकरण ने अप्रत्याशित अस्पताल मौतों को 26% तक कम कर दिया, लेकिन कुल जोखिम में कमी केवल 0.69% थी, जिससे 156 में से 1 मरीज को लाभ हुआ।",
      "एआई उपकरण में उच्च झूठी चेतावनी दर थी, जो अनावश्यक हस्तक्षेपों का कारण बन सकती थी, जिससे इसकी समग्र प्रभावशीलता पर बहस छिड़ गई।",
      "समर्थकों का तर्क है कि एआई की प्रारंभिक चेतावनियाँ नर्सों को महत्वपूर्ण मामलों को प्राथमिकता देने में मदद कर सकती हैं, जिससे स्वास्थ्य सेवा में इसकी संभावित उपयोगिता को उजागर किया जा सकता है।"
    ],
    "points": 176,
    "commentCount": 142,
    "retryCount": 0,
    "time": 1726665455
  },
  {
    "id": 41580853,
    "title": "हिज़्बुल्लाह के हाथ में पकड़े गए रेडियो फट गए, जिससे तीन लोगों की मौत हो गई, एक दिन बाद पेजर विस्फोट हुए।",
    "originLink": "https://www.reuters.com/world/hezbollah-pager-explosions-live-2024-09-17/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41580853",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "हिज़्बुल्लाह के हाथ में पकड़े जाने वाले रेडियो विस्फोट हो गए, जिसके परिणामस्वरूप तीन व्यक्तियों की मौत हो गई, इससे पहले के दिन पेजर विस्फोट की एक समान घटना के बाद।",
      "इस घटना ने इस पर बहस छेड़ दी है कि क्या यह आतंकवाद के रूप में योग्य है, जिसमें यह भिन्न विचार हैं कि क्या यह वैध सैन्य लक्ष्यों को निशाना बनाता है या यह अंधाधुंध और नागरिकों के लिए हानिकारक है।",
      "चर्चा इन रणनीतियों के व्यापक प्रभावों और आतंकवाद की परिभाषाओं तक विस्तृत होती है।"
    ],
    "points": 175,
    "commentCount": 259,
    "retryCount": 0,
    "time": 1726672792
  }
]
