[
  {
    "id": 41075766,
    "title": "ஒரு சுவிஸ் நகரம் விளம்பர பலகைகளை தடை செய்தது. சூரிச், பெர்ன் விரைவில் பின்பற்றலாம்",
    "originLink": "https://www.bloomberg.com/news/articles/2024-07-26/zurich-bern-consider-billboard-bans-after-vernier-outlaws-visual-pollution",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41075766",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "ஒரு சுவிஸ் நகரம் விளம்பர பலகைகளை தடை செய்துள்ளது, சூரிச் மற்றும் பெர்ன் இதே போன்ற நடவடிக்கைகளை பரிசீலிக்கின்றன, இரண்டு ஆண்டுகளுக்கு முன்பு போலந்து நாட்டின் கிராகோவ் நகரின் வெற்றிகரமான தடைக்கு பின்பாக.",
      "Vermont மற்றும் Hawaii நீண்டகால விளம்பர பலகை தடை கொண்டுள்ளன, இது அவற்றின் கண்ணுக்கு இனிமையான சூழலுக்கு பங்களிக்கின்றன.",
      "இந்த விவாதம் நகர அழகியலில் காட்சிப் பரபரப்பை குறைப்பதன் நேர்மறை தாக்கத்தை மற்றும் பொது போக்குவரத்தை ஊக்குவிப்பதன் சாத்தியமான நன்மைகளை முக்கியமாகக் குறிப்பிடுகிறது."
    ],
    "points": 488,
    "commentCount": 487,
    "retryCount": 0,
    "time": 1721968013
  },
  {
    "id": 41072549,
    "title": "AI க்ராலர்கள் மேலும் மரியாதையாக இருக்க வேண்டும்",
    "originLink": "https://about.readthedocs.com/blog/2024/07/ai-crawlers-abuse/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41072549",
    "commentBody": "",
    "originSummary": [
      "AI தயாரிப்புகள் மூலம் துஷ்பிரயோகம் செய்யப்பட்ட தளக் குரல் அதிகரித்துள்ளது, இது அதிகமான பரந்தவெளி பயன்பாடு மற்றும் செலவுகளால் Read the Docs போன்ற தளங்களுக்கு சிக்கல்களை ஏற்படுத்துகிறது.",
      "உதாரணமாக, 2024 மே மாதத்தில் ஒரு கிராலர் 73 டெராபைட் தரவுகளை பதிவிறக்கம் செய்தது, இதற்கான செலவு $5,000 க்கும் அதிகமாக இருந்தது, மேலும் மற்றொன்று 2024 ஜூன் மாதத்தில் Facebook இன் உள்ளடக்க பதிவிறக்கியை பயன்படுத்தி 10 டெராபைட் தரவுகளைப் பெற்றது.",
      "IP அடிப்படையிலான வீதக் கட்டுப்பாட்டை மீறியும், இந்தக் க்ராலர்கள் பல IP முகவரிகளைப் பயன்படுத்துகின்றன, இதனால் அது பயனற்றதாகிறது; எடுக்கப்பட்ட நடவடிக்கைகள் அடையாளம் காணப்பட்ட AI க்ராலர்களைத் தடுக்கவும், CDN கேஷிங்கை மேம்படுத்தவும் உள்ளடக்கியவை."
    ],
    "commentSummary": [
      "AI க்ராலர்கள் மிகுந்த தாக்கத்துடன் செயல்படுவதற்காக விமர்சிக்கப்பட்டுள்ளன, ஒரு நிகழ்வில் ஒரு க்ராலர் ReadTheDocs இலிருந்து ஒரு மாதத்தில் 73TB சுருக்கப்பட்ட HTML கோப்புகளை பதிவிறக்கம் செய்தது, இது முக்கியமான பரந்தவெளி செலவுகளை ஏற்படுத்தியது.",
      "அதிகப்படியான தரவுத் திருட்டு ReadTheDocs க்கு $5,000 க்கும் மேற்பட்ட பாண்ட்விட்த் கட்டணங்களை ஏற்படுத்தியது, மேலும் மரியாதையான மற்றும் ஒழுங்குபடுத்தப்பட்ட கிராலிங் நடைமுறைகளின் தேவையை வெளிப்படுத்தியது.",
      "இந்த சம்பவம், கணினி மோசடி மற்றும் தவறான செயல்கள் சட்டத்தின் (CFAA) கீழ் இத்தகைய நடத்தைப் பைத்தியமாகக் கருதப்படுவதற்கான சாத்தியங்களைப் பற்றி கேள்விகளை எழுப்புகிறது மற்றும் இத்தகைய செயல்களுக்கு பொறுப்பான நிறுவனங்களுக்கு அரசு அபராதங்கள் பொருத்தமானதாக இருக்கலாம் என்பதைக் குறிக்கிறது."
    ],
    "points": 217,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1721936386
  },
  {
    "id": 41073264,
    "title": "பைதானில் எழுதப்பட்ட டீலக்ஸ் பேன்ட் II இன் ஒரு நகல்",
    "originLink": "https://github.com/mriale/PyDPainter",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41073264",
    "commentBody": "",
    "originSummary": [
      "PyDPainter என்பது PyGame பயன்படுத்தி Python இல் உருவாக்கப்பட்ட பிக்சல் கலைத் திட்டமாகும், இது 1985 ஆம் ஆண்டில் Electronic Arts இன் Deluxe Paint இன் Commodore Amiga பதிப்பால் ஈர்க்கப்பட்டது.",
      "நிகழ்ச்சி, பழமையான டீலக்ஸ் பேன்ட் கருவியை புதிய அம்சங்களுடன் நவீனமயமாக்குவதைக் குறிக்கிறது, ரெட்ரோ போக்கின் காரணமாக பிக்சல் கலை மீதான புதுப்பிக்கப்பட்ட ஆர்வத்தைப் பூர்த்தி செய்யும்.",
      "PyDPainter இன் சமீபத்திய வெளியீடு GitHub இல் கிடைக்கிறது, மேலும் இது GPLv3 அல்லது அதற்குப் பிறகு உள்ள உரிமத்தின் கீழ் வழங்கப்படுகிறது."
    ],
    "commentSummary": [
      "GitHub இல் Deluxe Paint II இன் Python நகல் வெளியிடப்பட்டுள்ளது, இது நிறமாற்றம் மற்றும் அனிமேஷன்கள் போன்ற சிறப்பம்சங்களை வெளிப்படுத்துகிறது.",
      "பயனர்கள் டீலக்ஸ் பேயிண்ட் மற்றும் பிற பழைய கிராபிக்ஸ் திட்டங்களைப் பற்றி நினைவுகூர்ந்து, கலைஞர் மார்க் பெராரியின் பணியை சிறப்பிக்கின்றனர்.",
      "சர்ச்சைகள் DPaint.js மற்றும் Aseprite போன்ற பிற கருவிகளுடன் ஒப்பீடுகளை மற்றும் பிக்சல் கலை மென்பொருளை மீண்டும் உருவாக்கும் தொழில்நுட்ப சவால்களை உள்ளடக்கியவை."
    ],
    "points": 166,
    "commentCount": 48,
    "retryCount": 0,
    "time": 1721940830
  },
  {
    "id": 41074002,
    "title": "ஸ்டார்ட்அப் நிதி நிறுவுநர்களுக்காக – பகுதி I, கணக்கியல் (2016)",
    "originLink": "https://rein.pk/startup-finance-for-founders-part-i-accounting",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41074002",
    "commentBody": "",
    "originSummary": [
      "கட்டுரை தொடக்க நிதி குறித்த இரண்டு பகுதிகளைக் கொண்ட தொடர் கட்டுரையின் ஒரு பகுதியாகும், இதில் முதல் பகுதியில் கணக்கியல் மற்றும் இரண்டாவது பகுதியில் மூலதன நிதி குறித்துப் பேசப்படுகிறது.",
      "முக்கிய தலைப்புகள் உள்ளடக்கியவை பாதுகாப்பான வங்கி கணக்கு அமைப்பை அமைத்தல், கிரெடிட் கார்டு வரம்புகளை நிர்வகித்தல், மற்றும் வாடிக்கையாளர் அடிப்படை அதிகரித்தபோது ஸ்ட்ரைப் இருந்து காகித ஒப்பந்தங்கள் மற்றும் விலைப்பட்டியல் நோக்கி மாறுதல் ஆகியவை.",
      "எழுத்தாளர், $44 மில்லியன் நிதி திரட்டிய மற்றும் குறிப்பிடத்தக்க வளர்ச்சியடைந்த Segment இல் தங்கள் அனுபவத்திலிருந்து நடைமுறை அறிவுரைகளை பகிர்ந்து கொள்கிறார், தொடக்க நிறுவனர்களுக்கு அடிப்படை கணக்கியல் புரிந்துகொள்வது முக்கியம் என்பதை வலியுறுத்துகிறார்."
    ],
    "commentSummary": [
      "தொடர்பு: \"துவக்க நிறுவன நிறுவனர்களுக்கான நிதி – பகுதி I, கணக்கியல்\" என்ற கட்டுரை துவக்க நிறுவன நிறுவனர்களுக்கான முக்கியமான கணக்கியல் கொள்கைகளை விவரிக்கிறது, ஆனால் இதில் விரிவான கணக்கியல் தகவல்கள் குறைவாக உள்ளன.",
      "ஒரு முக்கியமான அம்சம் குறிப்பிடப்பட்டது, அது முதலீட்டு பேச்சுவார்த்தைகளின் போது கடன் வரம்புகளை பேச்சுவார்த்தை நடத்தும் உத்தியோ அல்லது படிப்படியாக கிரெடிட் கார்டு வரம்புகளை அதிகரிக்கும் உத்தியோ.",
      "இந்த விவாதம், குறிப்பாக ஐரோப்பாவுடன் ஒப்பிடுகையில் அமெரிக்காவில் கார் வாடகைக்கு போன்ற பரிவர்த்தனைகளுக்கு டெபிட் கார்டுகளைப் பயன்படுத்துவதில் உள்ள கட்டுப்பாடுகள் மற்றும் ஆபத்துகளைப் பற்றியும் பேசுகிறது."
    ],
    "points": 154,
    "commentCount": 16,
    "retryCount": 0,
    "time": 1721946028
  },
  {
    "id": 41072616,
    "title": "அட்டவணை தரவுக்கான பயன்பாட்டு இயந்திரக் கற்றல்",
    "originLink": "https://aml4td.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41072616",
    "commentBody": "",
    "originSummary": [
      "\"அப்ளைட் மெஷின் லெர்னிங் ஃபார் டேப்யூலர் டேட்டா\" என்ற நூல் மேக்ஸ் குஹ்ன் மற்றும் க்ஜெல் ஜான்சன் ஆகியோரால் எழுதப்பட்டு, டேப்யூலர் தரவிலிருந்து கணிப்பீட்டு மாதிரிகளை உருவாக்குவதற்கான நடைமுறை வழிகாட்டியாகும், இது ஜூன் 2024 இல் வெளியிடப்படும்.",
      "புத்தகம் முழு கணிப்பீட்டு மாதிரியாக்க செயல்முறையை, அம்ச பொறியியல் மற்றும் மாதிரி உருவாக்கல் பிந்தைய செயல்பாடுகளை உள்ளடக்கியது, மேலும் CC BY-NC-SA 4.0 இன் கீழ் உரிமம் பெற்றுள்ளது, இது வணிகமற்ற பயன்பாடு மற்றும் மாற்றத்திற்கான அனுமதியை வழங்குகிறது.",
      "தரவுப் பகுப்பாய்வாளர்கள், புள்ளியியல் நிபுணர்கள் மற்றும் தரவுப் விஞ்ஞானிகளை நோக்கமாகக் கொண்டு, இந்தப் புத்தகம் R இன் tidymodels கட்டமைப்பைப் பயன்படுத்தி பயிற்சிகள் மற்றும் கணினி துணைப்பொருட்களை வழங்குகிறது மற்றும் GitHub மூலம் சமூக பங்களிப்புகளை வரவேற்கிறது."
    ],
    "commentSummary": [
      "பயன்படுத்தப்பட்ட இயந்திரக் கற்றல் (ML) பற்றிய விவாதம், குறிப்பாக தரவுத்தொகுப்புகளுக்கானது, பொதுவான சவால்களை எடுத்துக்காட்டுகிறது, உதாரணமாக தரவுச்செலுத்தல், புத்திசாலித்தனமான தரவுப் பிரிப்பு, மற்றும் மாதிரி தேர்வு.",
      "சமீபத்திய முன்னேற்றங்களை அடைய XGBoost பயன்படுத்துவதில் முக்கியத்துவம், சில நிபுணர்கள் LightGBM, CatBoost, மற்றும் Random Forests போன்ற மாற்றுகளை பரிந்துரைக்கின்றனர்.",
      "ஒரு புதிய கைக்கூலி பாடநூலை ஒரு ஓ'ரெய்லி ஆசிரியர் குறிப்பிடுகிறார், இது ஒரு அம்சக் கடை மற்றும் நடைமுறை திட்டங்களுடன் எம்.எல். அமைப்புகளை உருவாக்குவதில் கவனம் செலுத்துகிறது."
    ],
    "points": 143,
    "commentCount": 16,
    "retryCount": 0,
    "time": 1721936915
  },
  {
    "id": 41076190,
    "title": "பிகேச்செஃப்ஸ், ஒரு அறிமுகம்/ஆராய்ச்சி",
    "originLink": "http://blog.asleson.org/2024/07/24/bcachefs-an-introduction/exploration/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41076190",
    "commentBody": "",
    "originSummary": [
      "பகாசெஃப்ஸ் என்பது தற்போதைய கோப்பக அமைப்புகளில் உள்ள குறைபாடுகளை சமாளிக்க உருவாக்கப்பட்ட புதிய கோப்பக அமைப்பாகும், இது தனித்துவமான அம்சங்கள் மற்றும் மேம்பாடுகளை வழங்குகிறது.",
      "இது பரிசோதனை ரெய்டு நிலைகள் (0, 1, 5, 6) மற்றும் அழிப்பு குறியீட்டுகளை ஆதரிக்கிறது, ஆனால் சிலவற்றை இன்னும் பயன்படுத்த பரிந்துரை செய்யப்படவில்லை.",
      "பகாசெஃப்ஸ் இன்னும் மேம்பாட்டில் உள்ளது, பல சாதன மேலாண்மை மற்றும் அமைப்பு ஒருங்கிணைப்புக்கு தொடர்ந்து மேம்பாடுகள் மற்றும் சமூக உதவி தேவைப்படுகிறது."
    ],
    "commentSummary": [
      "பிகேஷ்எஃப்எஸ், ஒரு புதிய கோப்பு முறைமை, அதன் பிழை கையாளும் திறன்கள் குறித்து விவாதிக்கப்படுகிறது, குறிப்பாக அதன் சுய-மருத்துவமளிப்பு அம்சம் வாசிப்பு IO/சமச்சீர் பிழைகளில், இது லினக்ஸ் 6.11 இல் செயல்படுத்தப்படும்.",
      "சில்பகுதிகள், குறிப்பாக RAM போன்றவை பழுதானால், நல்ல தரவுகளை கெடுக்கக்கூடிய சாத்தியக்கூறுகள் போன்ற சுய-மருத்துவத்தின் சாத்தியமான ஆபத்துகள் குறித்து விவாதம் நடைபெறுகிறது.",
      "ஒப்பீடுகள் Bcachefs மற்றும் ZFS மற்றும் btrfs போன்ற பிற கோப்பக அமைப்புகளுக்கு இடையில் செய்யப்படுகின்றன, பயனர்கள் தங்கள் அனுபவங்கள் மற்றும் நம்பகத்தன்மை மற்றும் தரவின் முழுமை பற்றிய கவலைகளை பகிர்ந்து கொள்கின்றனர்."
    ],
    "points": 137,
    "commentCount": 164,
    "retryCount": 0,
    "time": 1721974452
  },
  {
    "id": 41075934,
    "title": "Zulip 9.0: பகிர்ந்துள்ள குழுக்களுக்கு ஒழுங்கமைக்கப்பட்ட உரையாடல்",
    "originLink": "https://blog.zulip.com/2024/07/25/zulip-9-0-released/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41075934",
    "commentBody": "",
    "originSummary": [
      "Zulip Server 9.0 வெளியிடப்பட்டுள்ளது, இது நூற்றுக்கணக்கான புதுப்பிப்புகள் மற்றும் பிழை திருத்தங்களை கொண்டுள்ளது, தொலைதூர மற்றும் கலப்பு வேலைக்கு அதன் பயன்பாட்டை மேம்படுத்துகிறது.",
      "முக்கிய புதுப்பிப்புகளில் UI மறுவடிவமைப்பு, மேம்படுத்தப்பட்ட செய்தி உருவாக்கம், சொற்களஞ்சிய மாற்றங்கள், மேம்படுத்தப்பட்ட தேடல், மற்றும் சிறந்த பயனர் அறிமுகம் ஆகியவை அடங்கும்.",
      "புதிய ஒருங்கிணைப்புகள், Ubuntu 24.04 க்கான ஆதரவு, மற்றும் Flutter மூலம் உருவாக்கப்பட்ட அடுத்த தலைமுறை மொபைல் பயன்பாடுகள் முக்கியமான மேம்பாடுகளில் அடங்கும்."
    ],
    "commentSummary": [
      "Zulip 9.0 வெளியிடப்பட்டுள்ளது, புதிய குறைவான அடர்த்தியுள்ள இயல்புநிலை அமைப்பு மற்றும் மேலும் தனிப்பயனாக்கத்திற்கான திட்டங்களுடன்.",
      "Zulip இன் ஒழுங்கமைக்கப்பட்ட இடங்கள் மற்றும் உள்ளுணர்வு வடிவமைப்பு, குறிப்பாக பகிர்ந்துள்ள குழுக்களின் உற்பத்தித்திறனை மேம்படுத்துவதற்காக பாராட்டப்படுகிறது.",
      "புதிய மொபைல் பயன்பாடு அதன் செயல்திறன் மற்றும் மீளுருவாக்க வேகத்திற்காக அறியப்படும் திறந்த மூல கட்டமைப்பான ஃப்ளட்டர் மூலம் உருவாக்கப்பட்டுள்ளது."
    ],
    "points": 133,
    "commentCount": 77,
    "retryCount": 0,
    "time": 1721970859
  },
  {
    "id": 41072795,
    "title": "சுவிட்சர்லாந்து அரசு நிறுவனங்கள் திறந்த மூல மென்பொருளைப் பயன்படுத்த வேண்டும் என்று கட்டாயமாக்குகிறது",
    "originLink": "https://www.tomshardware.com/software/switzerland-mandates-government-agencies-use-open-source-software",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41072795",
    "commentBody": "",
    "originSummary": [
      "சுவிட்சர்லாந்து அரசு நிறுவனங்கள் திறந்த மூல மென்பொருளைப் (OSS) பயன்படுத்த வேண்டும் மற்றும் புதிய அரசாங்க குறியீடுகளை திறந்த மூல உரிமங்களின் கீழ் வெளியிட வேண்டும் என்ற சட்டத்தை நிறைவேற்றியுள்ளது, இது \"அரசாங்க பணிகளை நிறைவேற்றுவதற்கான மின்னணு வழிமுறைகளின் பயன்பாட்டுக்கான கூட்டாட்சி சட்டம்\" (EMBAG) என அழைக்கப்படுகிறது.",
      "இந்த முயற்சி, தனிப்பட்ட மற்றும் பாதுகாப்பு உணர்வுகளைத் தாண்டிய அரசாங்க தரவுகளை பொதுமக்களுக்கு அணுகக்கூடியதாக மாற்றுவதன் மூலம் வெளிப்படைத்தன்மை, பாதுகாப்பு மற்றும் செயல்திறனை மேம்படுத்துவதை நோக்கமாகக் கொண்டுள்ளது.",
      "சுவிட்சர்லாந்தின் நடவடிக்கை இதே போன்ற ஐரோப்பிய முயற்சிகளுடன் ஒத்துப்போகிறது மற்றும் ஐரோப்பாவிலும் அமெரிக்காவிலும் OSS-ஐ மேலும் ஏற்க ஊக்குவிக்கக்கூடும்."
    ],
    "commentSummary": [
      "சுவிட்சர்லாந்து அரசாங்க முகமைகள் திறந்த மூல மென்பொருளைப் பயன்படுத்த வேண்டும் என்று கட்டாயமாக்குகிறது, இது வெளிப்படைத்தன்மையை அதிகரிக்கவும், உரிமம் பெற்ற விற்பனையாளர்களின் மீது சார்ந்திருப்பதை குறைக்கவும் நோக்கமாகக் கொண்டுள்ளது.",
      "திறந்த மூல மென்பொருள் அரசுகளுக்கு குறியீட்டை மாற்றவும், கண்காணிக்கவும் அனுமதிக்கிறது, இது விற்பனையாளர் பூட்டலை தவிர்த்து மேம்பட்ட பாதுகாப்பு மற்றும் செலவுக் குறைப்புக்கு வழிவகுக்கலாம்.",
      "இந்த நடவடிக்கை உள்ளூர் திறன்களை மேம்படுத்தும் முதலீடாகவும், சாத்தியமான குறுகிய கால செலவுகளைப் பொருட்படுத்தாமல், முறையான, நீண்டகால டிஜிட்டல்மயமாக்கலின் நோக்கில் எடுக்கப்பட்ட ஒரு படியாகவும் பார்க்கப்படுகிறது."
    ],
    "points": 126,
    "commentCount": 31,
    "retryCount": 0,
    "time": 1721937944
  },
  {
    "id": 41073688,
    "title": "அமெரிக்க பாதுகாப்பு துறை – நுண்ணிய BS கண்டறிதல் [pdf] (2018)",
    "originLink": "https://media.defense.gov/2018/Oct/09/2002049591/-1/-1/0/DIB_DETECTING_AGILE_BS_2018.10.05.PDF",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41073688",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "அமெரிக்க பாதுகாப்புத் துறையின் 2018 ஆவணம், எஜில் மென்பொருள் மேம்பாட்டில் உள்ள செயல்திறனின்மைகளை குறிப்பிடுகிறது, இறுதி பயனர் தொடர்பின்欠பாடு மற்றும் நடுவிலானவர்கள் மூலம் நிதி தவறான மேலாண்மை போன்ற பிரச்சினைகளை வெளிப்படுத்துகிறது.",
      "ஆவணம், ஆஜைல் நடைமுறைகள் அடிக்கடி தவறாகப் பயன்படுத்தப்படுகின்றன, இது வளங்களை வீணாக்குவதற்கும், தரமான மென்பொருளை நேரத்தில் வழங்க முடியாததற்கும் வழிவகுக்கிறது என்று பரிந்துரைக்கிறது.",
      "இது மேம்பாட்டு குழுக்கள் மற்றும் இறுதி பயனர்கள் இடையிலான சிறந்த ஒத்திசைவை தேவையாகக் கூறுகிறது மற்றும் கருவிகள் மற்றும் செயல்முறைகளின் மீதான அதிக நம்பிக்கையை எச்சரிக்கிறது."
    ],
    "points": 122,
    "commentCount": 40,
    "retryCount": 0,
    "time": 1721943649
  },
  {
    "id": 41079901,
    "title": "Intel இன் 13வது/14வது தலைமுறை CPUக்கள் மோதுவதற்கு எந்த சரிசெய்தலும் இல்லை – சேதம் நிரந்தரமாகும்",
    "originLink": "https://www.theverge.com/2024/7/26/24206529/intel-13th-14th-gen-crashing-instability-cpu-voltage-q-a",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41079901",
    "commentBody": "",
    "originSummary": [
      "Intel இன் 13வது மற்றும் 14வது தலைமுறை CPUகளில் உயர்ந்த மின்னழுத்தங்கள் மற்றும் உற்பத்தி குறைபாடுகள் காரணமாக ஒரு சிக்கல் உள்ளது, இது ஏற்கனவே சேதம் ஏற்பட்டிருந்தால் சரி செய்ய முடியாது.",
      "ஒரு பிழையைத் தடுக்க ஒரு திருத்தம் ஆகஸ்ட் மாதத்தின் நடுப்பகுதியில் எதிர்பார்க்கப்படுகிறது, ஆனால் சேதமடைந்த CPUs மாற்றப்பட வேண்டும்; இன்டெல் திரும்பப் பெறவோ அல்லது உத்தரவாதங்களை நீட்டிக்கவோ செய்யாது.",
      "பாதிக்கப்பட்ட பயனர்கள் தங்கள் BIOS ஐ புதுப்பிக்கவும், Intel வாடிக்கையாளர் ஆதரவை தொடர்பு கொள்ளவும் வேண்டும், ஏனெனில் இந்த பிரச்சனை 65W அல்லது அதற்கு மேற்பட்ட மின்சாரத்தை நுகரும் எந்தவொரு 13வது அல்லது 14வது தலைமுறை டெஸ்க்டாப் செயலி மீதும் பாதிப்பை ஏற்படுத்தக்கூடும்."
    ],
    "commentSummary": [
      "Intel இன் 13வது/14வது தலைமுறை CPU களுக்கு தற்போதைய சரிசெய்ய முடியாத நிலையான முறைமற்ற பிரச்சனை உள்ளது, இது 65W அல்லது அதற்கு மேல் மின்சாரம் பயன்படுத்தும் CPU களை பாதிக்கிறது.",
      "MicroCenter இப்போது இவை போன்ற CPUs-ஐ தங்களின் தொகுப்புகளில் சேர்ப்பதை நிறுத்தியுள்ளது, மேலும் ஆகஸ்ட் மாதத்தின் நடுப்பகுதியில் எதிர்பார்க்கப்படும் மைக்ரோ கோடு புதுப்பிப்பு செயல்திறனை குறைக்கக்கூடும்.",
      "பிரச்சினை இருந்தபோதிலும், இன்டெல் பங்குகள் குறிப்பிடத்தக்க அளவில் குறையவில்லை, மேலும் நிறுவனம் விற்பனையை நிறுத்தவோ அல்லது திரும்பப் பெற திட்டமிடவோ இல்லை, மாறாக மைக்ரோ கோடு திருத்தங்களில் கவனம் செலுத்துகிறது."
    ],
    "points": 116,
    "commentCount": 45,
    "retryCount": 0,
    "time": 1722010954
  },
  {
    "id": 41080018,
    "title": "ஸ்ட்ரைப் லெமன் ஸ்க்வீஸியை கைப்பற்றுகிறது",
    "originLink": "https://www.lemonsqueezy.com/blog/stripe-acquires-lemon-squeezy",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41080018",
    "commentBody": "",
    "originSummary": [
      "Stripe 2021 இல் தொடங்கப்பட்ட உலகளாவிய அளவில் டிஜிட்டல் தயாரிப்புகளை விற்பனை செய்வதை எளிதாக்கும் Lemon Squeezy என்ற தளத்தை கைப்பற்றியுள்ளது.",
      "லெமன் ஸ்க்வீசி அதன் துவக்கத்திலிருந்து ஒன்பது மாதங்களில் ஆண்டுதோறும் மீண்டும் வருவாய் (ARR) $1 மில்லியனை மீறியது.",
      "இந்தக் கையகப்படுத்தல், ஸ்ட்ரைப் நிறுவனத்தின் கட்டண திறன்களை கொண்டு லெமன் ஸ்க்வீஸியின் சேவைகளை மேம்படுத்துவதற்காக நோக்கமாகக் கொண்டுள்ளது, இது வாடிக்கையாளர் அனுபவத்தையும் நம்பகத்தன்மையையும் மேம்படுத்தும் என்று வாக்குறுதி அளிக்கிறது."
    ],
    "commentSummary": [
      "Stripe, VAT செலுத்தலை எளிதாக்கும் Merchant of Record (MoR) அம்சத்திற்காக அறியப்படும் Lemon Squeezy என்ற தளத்தை கைப்பற்றியுள்ளது.",
      "பயனர்கள் கட்டணங்களில் ஏற்படக்கூடிய மாற்றங்கள் மற்றும் MoR அம்சத்தின் எதிர்காலம் குறித்து கவலைப்படுகின்றனர், مما mixed உணர்வுகளை ஏற்படுத்துகிறது.",
      "சிலர் இந்தக் கையகப்படுத்தலை கட்டணத் துறையில் போட்டியை குறைப்பதாகக் கருதுகின்றனர், மற்றவர்கள் வரி கையாளுதல் ஒருங்கிணைப்பில் மேம்பாடு ஏற்படும் என நம்புகின்றனர்."
    ],
    "points": 114,
    "commentCount": 62,
    "retryCount": 0,
    "time": 1722011999
  },
  {
    "id": 41076831,
    "title": "பிரான்ஸ் அதிவேக ரயில் போக்குவரத்து ஒலிம்பிக் விழாவில் 'தீங்கிழைக்கும் செயல்கள்' மூலம் பாதிக்கப்பட்டது",
    "originLink": "https://www.lemonde.fr/en/france/article/2024/07/26/france-s-high-speed-trains-struck-by-malicious-acts_6699471_7.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41076831",
    "commentBody": "",
    "originSummary": [
      "பாரிஸ் ஒலிம்பிக்ஸுக்கு முந்தைய நாட்களில், தீவைத்தல் போன்ற 'தீங்கிழைக்கும் செயல்கள்' காரணமாக, பிரான்சின் அதிவேக ரயில் பிணையம், TGV உட்பட, முக்கியமான இடையூறுகளை சந்தித்தது.",
      "தாக்குதல்கள் ரயில் பாதுகாப்புக்கு அத்தியாவசியமான ஃபைபர்-ஆப்டிக் கேபிள்களை சேதப்படுத்தின, 800,000 பயணிகளுக்கு பாதிப்பை ஏற்படுத்தி, பரவலான ரத்து மற்றும் தாமதங்களை ஏற்படுத்தின, சீரமைப்புகள் முழு வார இறுதிக்கும் நீடிக்கும் என எதிர்பார்க்கப்படுகிறது.",
      "பிரஞ்சு அதிகாரிகள் இந்த தாக்குதல்களை 'குற்றவியல் செயல்கள்' என்று கண்டித்தனர் மற்றும் 20 ஆண்டுகள் சிறை தண்டனை மற்றும் பெரும் அபராதங்கள் ஆகியவற்றை உள்ளடக்கிய விசாரணையை தொடங்கினர்."
    ],
    "commentSummary": [
      "பிரான்சின் அதிவேக ரயில் போக்குவரத்து ஒலிம்பிக் விழாவின் போது \"தீங்கிழைக்கும் செயல்கள்\" மூலம் பாதிக்கப்பட்டது, இது பொதுப் போக்குவரத்து அமைப்புகள் சபோட்டாஜுக்கு எவ்வளவு பாதிக்கப்படக்கூடியவை என்பதை வெளிப்படுத்துகிறது.",
      "வெளிநாட்டு நடிகர்கள், குறிப்பாக ரஷ்யா, ஈடுபட்டிருக்கலாம் என்ற ஊகங்கள், ஜெர்மனி மற்றும் ஐரோப்பாவின் பிற பகுதிகளில் நடந்த 유사மான நிகழ்வுகளுடன் ஒப்பிடுகின்றன.",
      "இந்த சம்பவம் போக்குவரத்து முறைகளின் பொறுமை, தேசிய பாதுகாப்பு விளைவுகள் மற்றும் முக்கியமான அடிப்படை வசதிகளை பாதுகாக்கும் நடவடிக்கைகளின் தேவையைப் பற்றிய விவாதங்களைத் தூண்டியுள்ளது."
    ],
    "points": 90,
    "commentCount": 325,
    "retryCount": 0,
    "time": 1721982188
  },
  {
    "id": 41077798,
    "title": "பாரிஸ் ஒலிம்பிக்ஸுக்கு முன் 'தீங்கிழைக்கும் செயல்கள்' காரணமாக பிரெஞ்சு ரயில் நெட்வொர்க் பாதிக்கப்பட்டது",
    "originLink": "https://www.aljazeera.com/news/2024/7/26/french-rail-network-hit-by-malicious-acts-ahead-of-olympic-ceremony",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41077798",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "பாரிஸ் ஒலிம்பிக்ஸுக்கு முந்தைய நாட்களில் பிரஞ்சு ரயில் நெட்வொர்க் 'தீங்கிழைக்கும் செயல்கள்' மூலம் இலக்காகியுள்ளது, இது பாதுகாப்பு மற்றும் உள்கட்டமைப்பு நிலைத்தன்மை குறித்து கவலைகளை எழுப்புகிறது.",
      "இந்தச் செயல்களின் நேரம் மிகவும் முக்கியமானது, ஏனெனில் பிரான்ஸ் ஒரு முக்கியமான சர்வதேச நிகழ்வை நடத்தத் தயாராகி வருகிறது, இது சாத்தியமான பலவீனங்களை வெளிப்படுத்துகிறது.",
      "விவாதங்கள் மற்றும் மேலதிக விவரங்கள் பல்வேறு மன்றங்களில் நடைபெற்று வருகின்றன, இந்த சம்பவத்தில் பொது மக்கள் மற்றும் ஊடகங்களின் அதிகமான ஆர்வத்தை பிரதிபலிக்கின்றன."
    ],
    "points": 89,
    "commentCount": 3,
    "retryCount": 0,
    "time": 1721994194
  },
  {
    "id": 41076252,
    "title": "நிதி பெற்ற அனைத்து தொடக்க நிறுவனங்களின் தரவுத்தொகுப்பு",
    "originLink": "https://old.reddit.com/r/b2b_sales/comments/1ecgw9g/a_database_of_all_startups_who_received_funding/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41076252",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "அனைத்து நிதியுதவி பெற்ற தொடக்க நிறுவனங்களின் தரவுத்தொகுப்பு ரெடிட் இல் பகிரப்பட்டுள்ளது, 81 புள்ளிகளுடன் குறிப்பிடத்தக்க கவனத்தை பெற்றுள்ளது.",
      "இந்த பதிவானது விவாதங்களை தூண்டியுள்ளது, சில பயனர்கள் இதை மீண்டும் மீண்டும் பகிர்வதின் அடிக்கடி தன்மையை கேள்வி எழுப்புகின்றனர்."
    ],
    "points": 81,
    "commentCount": 1,
    "retryCount": 0,
    "time": 1721975192
  }
]
