[
  {
    "id": 41075766,
    "title": "En sveitsisk by forbød reklametavler. Zürich, Bern kan snart følge etter",
    "originLink": "https://www.bloomberg.com/news/articles/2024-07-26/zurich-bern-consider-billboard-bans-after-vernier-outlaws-visual-pollution",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41075766",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "En sveitsisk by har forbudt reklameplakater, og Zürich og Bern vurderer lignende tiltak, etter at Krakow i Polen innførte et vellykket forbud for to år siden.",
      "Vermont og Hawaii har langvarige forbud mot reklametavler, noe som bidrar til deres visuelt behagelige miljøer.",
      "Diskusjonen understreker den positive effekten av å redusere visuell rot på byens estetikk og de potensielle fordelene ved å fremme offentlig transport."
    ],
    "points": 488,
    "commentCount": 487,
    "retryCount": 0,
    "time": 1721968013
  },
  {
    "id": 41072549,
    "title": "AI-gjennomsøkere må være mer respektfulle",
    "originLink": "https://about.readthedocs.com/blog/2024/07/ai-crawlers-abuse/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41072549",
    "commentBody": "",
    "originSummary": [
      "Det har vært en betydelig økning i misbrukende nettsidegjennomgang av AI-produkter, noe som skaper problemer for nettsteder som Read the Docs på grunn av overdreven båndbreddebruk og kostnader.",
      "Eksempler inkluderer en crawler som lastet ned 73 TB med data i mai 2024, noe som kostet over $5 000, og en annen som brukte Facebooks innholdsnedlaster til å hente 10 TB i juni 2024.",
      "Til tross for IP-basert hastighetsbegrensning, bruker disse crawlerne flere IP-adresser, noe som gjør det ineffektivt; tiltak som er tatt inkluderer blokkering av identifiserte AI-crawlere og forbedring av CDN-caching."
    ],
    "commentSummary": [
      "AI-crawlere har blitt kritisert for å være altfor aggressive, med ett tilfelle der en crawler lastet ned 73TB med zippede HTML-filer fra ReadTheDocs på en måned, noe som forårsaket betydelige båndbreddekostnader.",
      "Den overdrevne dataskrapingen førte til over $5 000 i båndbreddekostnader for ReadTheDocs, noe som understreker behovet for mer respektfulle og regulerte gjennomgangspraksiser.",
      "Den hendelsen reiser spørsmål om potensialet for slik oppførsel til å bli ansett som hensynsløs under Computer Fraud and Abuse Act (CFAA) og antyder at statlige bøter kan være passende for selskaper som er ansvarlige for slike handlinger."
    ],
    "points": 217,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1721936386
  },
  {
    "id": 41073264,
    "title": "En klone av Deluxe Paint II skrevet i Python",
    "originLink": "https://github.com/mriale/PyDPainter",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41073264",
    "commentBody": "",
    "originSummary": [
      "PyDPainter er et pixelkunstprogram utviklet i Python ved bruk av PyGame, inspirert av 1985 Commodore Amiga-versjonen av Deluxe Paint av Electronic Arts.",
      "Programmet har som mål å modernisere det klassiske Deluxe Paint-verktøyet med nye funksjoner, for å imøtekomme den gjenopplivede interessen for pikselkunst på grunn av retrotrenden.",
      "Den nyeste utgivelsen av PyDPainter er tilgjengelig på GitHub, og den er lisensiert under GPLv3 eller senere."
    ],
    "commentSummary": [
      "En Python-klone av Deluxe Paint II har blitt utgitt på GitHub, og viser imponerende funksjoner som palettesyklus og animasjoner.",
      "Brukere mimrer om Deluxe Paint og andre retro grafikkprogrammer, og fremhever arbeidet til kunstneren Mark Ferrari.",
      "Diskusjoner inkluderer sammenligninger med andre verktøy som DPaint.js og Aseprite, og de tekniske utfordringene ved å gjenskape programvare for pikselkunst."
    ],
    "points": 166,
    "commentCount": 48,
    "retryCount": 0,
    "time": 1721940830
  },
  {
    "id": 41074002,
    "title": "Startup Finance for Founders – Del I, Regnskap (2016)",
    "originLink": "https://rein.pk/startup-finance-for-founders-part-i-accounting",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41074002",
    "commentBody": "",
    "originSummary": [
      "Artikkelen er en del av en todelt serie om oppstartsfinansiering, med fokus på regnskap i del I og strategisk finans i del II.",
      "Viktige emner som dekkes inkluderer oppsett av en sikker bankkontostruktur, håndtering av kredittkortgrenser og overgang fra Stripe til papiravtaler og fakturaer etter hvert som kundebasen vokste.",
      "Forfatteren deler praktiske innsikter fra sin erfaring hos Segment, som vokste betydelig og hentet inn 44 millioner dollar, og fremhever viktigheten av å forstå grunnleggende regnskap for oppstartsgründere."
    ],
    "commentSummary": [
      "Artikkelen \"Startup Finance for Founders – Part I, Accounting\" diskuterer essensielle regnskapsprinsipper for oppstartsgründere, selv om den mangler detaljerte regnskapsopplysninger.",
      "Et viktig poeng som ble tatt opp er strategien med å forhandle om kredittlinjer under investeringssamtaler i stedet for gradvis å øke kredittkortgrensene.",
      "Diskusjonen berører også begrensningene og risikoene forbundet med bruk av debetkort til transaksjoner som bilutleie, spesielt i USA sammenlignet med Europa."
    ],
    "points": 154,
    "commentCount": 16,
    "retryCount": 0,
    "time": 1721946028
  },
  {
    "id": 41072616,
    "title": "Anvendt maskinlæring for tabulære data",
    "originLink": "https://aml4td.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41072616",
    "commentBody": "",
    "originSummary": [
      "«Applied Machine Learning for Tabular Data» av Max Kuhn og Kjell Johnson er en praktisk guide for å utvikle prediktive modeller fra tabulære data, som skal publiseres i juni 2024.",
      "Den dekker hele prosessen med prediktiv modellering, inkludert feature engineering og aktiviteter etter modellering, og er lisensiert under CC BY-NC-SA 4.0, som tillater ikke-kommersiell bruk og tilpasning.",
      "Rettet mot dataanalytikere, statistikere og dataforskere, gir boken øvelser og datatillegg, hovedsakelig ved bruk av R's tidymodels-rammeverk, og ønsker bidrag fra samfunnet velkommen via GitHub."
    ],
    "commentSummary": [
      "Diskusjon om anvendt maskinlæring (ML) for tabulære data, med vekt på vanlige utfordringer som datalekkasjer, intelligent datasplitting og modellvalg.",
      "Vektlegging på bruk av XGBoost for toppmoderne resultater, med noen eksperter som anbefaler alternativer som LightGBM, CatBoost og Random Forests.",
      "En omtale av en ny praktisk lærebok av en O'Reilly-forfatter, med fokus på å bygge ML-systemer med en funksjonsbutikk og praktiske prosjekter."
    ],
    "points": 143,
    "commentCount": 16,
    "retryCount": 0,
    "time": 1721936915
  },
  {
    "id": 41076190,
    "title": "Bcachefs, en introduksjon/utforskning",
    "originLink": "http://blog.asleson.org/2024/07/24/bcachefs-an-introduction/exploration/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41076190",
    "commentBody": "",
    "originSummary": [
      "Bcachefs er et nytt filsystem designet for å overvinne begrensninger i eksisterende filsystemer, og tilbyr unike funksjoner og forbedringer.",
      "Den støtter eksperimentelle RAID-nivåer (0, 1, 5, 6) og slettingskoding, selv om noen ennå ikke anbefales for bruk.",
      "Bcachefs er fortsatt under utvikling, med pågående forbedringer og behov for samfunnshjelp for håndtering av flere enheter og systemintegrasjon."
    ],
    "commentSummary": [
      "Det diskuteres et nytt filsystem, Bcachefs, for dets feilhåndteringsevner, spesielt dets selvhelbredende funksjon ved lesefeil/ sjekksumfeil, som vil bli implementert i Linux 6.11.",
      "Det er en debatt om de potensielle risikoene ved selvhelbredelse, som muligheten for å ødelegge gode data hvis systemkomponenter som RAM er defekte.",
      "Det gjøres sammenligninger mellom Bcachefs og andre filsystemer som ZFS og btrfs, med brukere som deler sine erfaringer og bekymringer om pålitelighet og dataintegritet."
    ],
    "points": 137,
    "commentCount": 164,
    "retryCount": 0,
    "time": 1721974452
  },
  {
    "id": 41075934,
    "title": "Zulip 9.0: Organisert chat for distribuerte team",
    "originLink": "https://blog.zulip.com/2024/07/25/zulip-9-0-released/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41075934",
    "commentBody": "",
    "originSummary": [
      "Zulip Server 9.0 er utgitt, med hundrevis av oppdateringer og feilrettinger som forbedrer brukervennligheten for fjern- og hybridarbeid.",
      "Viktige oppdateringer inkluderer en ny design for brukergrensesnittet, forbedret meldingskomposisjon, terminologiendringer, forbedret søk og bedre brukeropplæring.",
      "Ny integrasjoner, støtte for Ubuntu 24.04, og neste generasjons mobilapper bygget med Flutter er blant de betydelige forbedringene."
    ],
    "commentSummary": [
      "Zulip 9.0 har blitt lansert, med en ny mindre tett standardlayout og planer for mer tilpasning.",
      "Zulips organiserte rom og intuitive design blir rost for å øke produktiviteten, spesielt for distribuerte team.",
      "Den nye mobilappen er bygget med Flutter, et åpen kildekode-rammeverk kjent for sin ytelse og iterasjonshastighet."
    ],
    "points": 133,
    "commentCount": 77,
    "retryCount": 0,
    "time": 1721970859
  },
  {
    "id": 41072795,
    "title": "Sveits pålegger offentlige etater å bruke åpen kildekode-programvare",
    "originLink": "https://www.tomshardware.com/software/switzerland-mandates-government-agencies-use-open-source-software",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41072795",
    "commentBody": "",
    "originSummary": [
      "Sveits har vedtatt en lov som krever at offentlige etater bruker åpen kildekode-programvare (OSS) og publiserer ny offentlig kode under åpne kildekodelisenser, kjent som \"Federal Law on the Use of Electronic Means for the Fulfillment of Government Tasks\" (EMBAG).",
      "Dette initiativet har som mål å forbedre åpenhet, sikkerhet og effektivitet ved å gjøre ikke-personlige, ikke-sikkerhetsfølsomme offentlige data offentlig tilgjengelige.",
      "Schweiz' tiltak er i tråd med lignende europeiske initiativer og kan potensielt inspirere til ytterligere adopsjon av OSS i Europa og USA."
    ],
    "commentSummary": [
      "Sveits pålegger at offentlige etater bruker åpen kildekode-programvare, med mål om å øke åpenhet og redusere avhengighet av proprietære leverandører.",
      "Åpen kildekode-programvare lar myndigheter endre og revidere koden, noe som potensielt kan føre til bedre sikkerhet og kostnadsbesparelser ved å unngå leverandørinnlåsing.",
      "Dette trekket blir sett på som en investering i lokale kapasiteter og et skritt mot systematisk, langsiktig digitalisering, til tross for potensielle kortsiktige kostnader."
    ],
    "points": 126,
    "commentCount": 31,
    "retryCount": 0,
    "time": 1721937944
  },
  {
    "id": 41073688,
    "title": "U.S. Department of Defense – Oppdage smidig BS [pdf] (2018)",
    "originLink": "https://media.defense.gov/2018/Oct/09/2002049591/-1/-1/0/DIB_DETECTING_AGILE_BS_2018.10.05.PDF",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41073688",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Det amerikanske forsvarsdepartementets dokument fra 2018 tar for seg ineffektivitet i smidig programvareutvikling, og fremhever problemer som mangel på samhandling med sluttbrukere og feil forvaltning av midler av mellommenn.",
      "Dokumentet antyder at Agile-praksiser ofte blir feilaktig anvendt, noe som fører til sløsing med ressurser og manglende evne til å levere programvare av høy kvalitet i tide.",
      "Det understreker behovet for bedre samsvar mellom utviklingsteam og sluttbrukere og advarer mot overdreven avhengighet av verktøy og prosesser."
    ],
    "points": 122,
    "commentCount": 40,
    "retryCount": 0,
    "time": 1721943649
  },
  {
    "id": 41079901,
    "title": "Det finnes ingen løsning for Intels krasjende 13./14. generasjons CPUer – skaden er permanent",
    "originLink": "https://www.theverge.com/2024/7/26/24206529/intel-13th-14th-gen-crashing-instability-cpu-voltage-q-a",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41079901",
    "commentBody": "",
    "originSummary": [
      "Intels 13. og 14. generasjons CPU-er har et krasjproblem på grunn av forhøyede spenninger og produksjonsfeil, som ikke kan fikses hvis skaden allerede har oppstått.",
      "En oppdatering for å forhindre fremtidige problemer forventes i midten av august, men skadede CPU-er må byttes ut; Intel vil ikke tilbakekalle eller forlenge garantiene.",
      "Berørte brukere bør oppdatere BIOS og kontakte Intel kundestøtte, da problemet potensielt påvirker alle 13. eller 14. generasjons stasjonære prosessorer som bruker 65W eller mer strøm."
    ],
    "commentSummary": [
      "Intels 13./14. generasjons CPU-er har et permanent krasjproblem uten noen nåværende løsning, som påvirker CPU-er som bruker 65W eller mer.",
      "MicroCenter har sluttet å inkludere disse CPU-ene i sine pakker, og en mikrokodeoppdatering som forventes i midten av august kan redusere ytelsen.",
      "Til tross for problemet har ikke Intels aksje falt betydelig, og selskapet har verken stoppet salget eller planlagt en tilbakekalling, men fokuserer i stedet på mikroprogramvareoppdateringer."
    ],
    "points": 116,
    "commentCount": 45,
    "retryCount": 0,
    "time": 1722010954
  },
  {
    "id": 41080018,
    "title": "Stripe kjøper opp Lemon Squeezy",
    "originLink": "https://www.lemonsqueezy.com/blog/stripe-acquires-lemon-squeezy",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41080018",
    "commentBody": "",
    "originSummary": [
      "Stripe har kjøpt opp Lemon Squeezy, en plattform lansert i 2021 for å forenkle salg av digitale produkter globalt.",
      "Sitronsqueezy oppnådde over $1M i årlig tilbakevendende inntekt (ARR) innen ni måneder etter lanseringen.",
      "Oppkjøpet har som mål å forbedre Lemon Squeezy sine tilbud med Stripes betalingsmuligheter, og lover en bedre kundeopplevelse og pålitelighet."
    ],
    "commentSummary": [
      "Stripe har kjøpt opp Lemon Squeezy, en plattform kjent for sin Merchant of Record (MoR)-funksjon som forenkler MVA-innbetaling.",
      "Brukere er bekymret for potensielle endringer i gebyrer og fremtiden til MoR-funksjonen, noe som fører til blandede følelser om oppkjøpet.",
      "Enkelte ser på oppkjøpet som en reduksjon av konkurransen innen betalingsområdet, mens andre håper på bedre integrasjon av skattehåndtering."
    ],
    "points": 114,
    "commentCount": 62,
    "retryCount": 0,
    "time": 1722011999
  },
  {
    "id": 41076831,
    "title": "Frankrikes høyhastighetstogtrafikk forstyrret av 'ondsinnede handlinger' under OL-seremoni",
    "originLink": "https://www.lemonde.fr/en/france/article/2024/07/26/france-s-high-speed-trains-struck-by-malicious-acts_6699471_7.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41076831",
    "commentBody": "",
    "originSummary": [
      "Frankrikes høyhastighetsjernbanenettverk, inkludert TGV, møtte betydelige forstyrrelser på grunn av «ondsinnede handlinger» som brannstiftelse, rett før OL i Paris.",
      "Angrepene skadet fiberoptiske kabler som er essensielle for togsikkerheten, noe som påvirket 800 000 passasjerer og forårsaket omfattende kanselleringer og forsinkelser, med reparasjoner som forventes å vare hele helgen.",
      "Franske tjenestemenn fordømte angrepene som «kriminelle handlinger» og igangsatte en etterforskning, med potensielle straffer på opptil 20 års fengsel og betydelige bøter."
    ],
    "commentSummary": [
      "Frankrikes høyhastighetstogtrafikk ble forstyrret av «ondsinnede handlinger» under den olympiske seremonien, noe som fremhever sårbarheter i kollektivtransportsystemer for sabotasje.",
      "Spekulasjoner antyder mulig involvering av utenlandske aktører, inkludert Russland, og trekker paralleller til lignende hendelser i Tyskland og andre deler av Europa.",
      "Den hendelsen har utløst debatter om motstandsdyktigheten til transportmidler, nasjonale sikkerhetsimplikasjoner og behovet for tiltak for å beskytte kritisk infrastruktur."
    ],
    "points": 90,
    "commentCount": 325,
    "retryCount": 0,
    "time": 1721982188
  },
  {
    "id": 41077798,
    "title": "Det franske jernbanenettet rammet av 'ondsinnede handlinger' i forkant av OL i Paris",
    "originLink": "https://www.aljazeera.com/news/2024/7/26/french-rail-network-hit-by-malicious-acts-ahead-of-olympic-ceremony",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41077798",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Det franske jernbanenettet har blitt utsatt for 'ondsinnede handlinger' like før OL i Paris, noe som vekker bekymring for sikkerhet og infrastrukturens motstandskraft.",
      "Timingen av disse handlingene er spesielt betydningsfull ettersom Frankrike forbereder seg på å være vert for en stor internasjonal begivenhet, noe som fremhever potensielle sårbarheter.",
      "Diskusjoner og ytterligere detaljer pågår i ulike fora, noe som gjenspeiler den høye graden av offentlig og medieinteresse i hendelsen."
    ],
    "points": 89,
    "commentCount": 3,
    "retryCount": 0,
    "time": 1721994194
  },
  {
    "id": 41076252,
    "title": "Database over alle finansierte oppstartsselskaper",
    "originLink": "https://old.reddit.com/r/b2b_sales/comments/1ecgw9g/a_database_of_all_startups_who_received_funding/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41076252",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "En database over alle finansierte oppstartsselskaper har blitt delt på Reddit, og har fått betydelig oppmerksomhet med 81 poeng.",
      "Innlegget har utløst diskusjoner, med noen brukere som stiller spørsmål ved hvor ofte det blir postet på nytt."
    ],
    "points": 81,
    "commentCount": 1,
    "retryCount": 0,
    "time": 1721975192
  }
]
