[
  {
    "id": 41075766,
    "title": "Eräs sveitsiläinen kaupunki kielsi mainostaulut. Zürich ja Bern saattavat pian seurata perässä",
    "originLink": "https://www.bloomberg.com/news/articles/2024-07-26/zurich-bern-consider-billboard-bans-after-vernier-outlaws-visual-pollution",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41075766",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Eräs sveitsiläinen kaupunki on kieltänyt mainostaulut, ja Zürich sekä Bern harkitsevat samanlaisia toimenpiteitä, seuraten Puolan Krakovaa, joka onnistuneesti kielsi mainostaulut kaksi vuotta sitten.",
      "Vermontilla ja Havaijilla on pitkään ollut voimassa olevat mainostaulukieltolait, jotka edistävät niiden visuaalisesti miellyttäviä ympäristöjä.",
      "Keskustelu korostaa visuaalisen sekavuuden vähentämisen positiivista vaikutusta kaupunkien estetiikkaan ja julkisen liikenteen edistämisen mahdollisia hyötyjä."
    ],
    "points": 488,
    "commentCount": 487,
    "retryCount": 0,
    "time": 1721968013
  },
  {
    "id": 41072549,
    "title": "AI-robotit tarvitsevat enemmän kunnioitusta",
    "originLink": "https://about.readthedocs.com/blog/2024/07/ai-crawlers-abuse/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41072549",
    "commentBody": "",
    "originSummary": [
      "AI-tuotteiden aiheuttama haitallinen sivustojen indeksointi on lisääntynyt merkittävästi, mikä on aiheuttanut ongelmia sivustoille, kuten Read the Docs, liiallisen kaistanleveyden käytön ja kustannusten vuoksi.",
      "Esimerkkejä ovat muun muassa yksi crawler, joka latasi 73 TB dataa toukokuussa 2024, mikä maksoi yli 5 000 dollaria, ja toinen, joka käytti Facebookin sisällönlataajaa ladatakseen 10 TB kesäkuussa 2024.",
      "IP-pohjaisesta nopeusrajoituksesta huolimatta nämä indeksoijat käyttävät useita IP-osoitteita, mikä tekee siitä tehottoman; toimenpiteisiin kuuluu tunnistettujen tekoälyindeksoijien estäminen ja CDN-välimuistin parantaminen."
    ],
    "commentSummary": [
      "AI-robotteja on kritisoitu liiallisesta aggressiivisuudesta, ja eräässä tapauksessa robotti latasi kuukauden aikana 73 teratavua pakattuja HTML-tiedostoja ReadTheDocs-sivustolta, mikä aiheutti merkittäviä kaistakustannuksia.",
      "Liiallinen datan kerääminen johti yli 5 000 dollarin kaistalevyysmaksuihin ReadTheDocsille, mikä korostaa tarvetta kunnioittavammille ja säännellymmille indeksointikäytännöille.",
      "Tapaus herättää kysymyksiä siitä, voidaanko tällaista käyttäytymistä pitää huolimattomana Computer Fraud and Abuse Act (CFAA) -lain nojalla ja viittaa siihen, että hallituksen sakot saattavat olla aiheellisia tällaisista toimista vastuussa oleville yrityksille."
    ],
    "points": 217,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1721936386
  },
  {
    "id": 41073264,
    "title": "Deluxe Paint II:n klooni kirjoitettuna Pythonilla",
    "originLink": "https://github.com/mriale/PyDPainter",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41073264",
    "commentBody": "",
    "originSummary": [
      "PyDPainter on Pythonilla ja PyGamella kehitetty pikselitaideohjelma, joka on saanut inspiraationsa Electronic Artsin vuonna 1985 julkaisemasta Commodore Amiga -versiosta Deluxe Paint.",
      "Ohjelman tavoitteena on modernisoida klassinen Deluxe Paint -työkalu uusilla ominaisuuksilla, vastaten retrotrendin myötä elpyneeseen kiinnostukseen pikselitaidetta kohtaan.",
      "Uusin versio PyDPainterista on saatavilla GitHubissa, ja se on lisensoitu GPLv3:n tai myöhemmän version mukaisesti."
    ],
    "commentSummary": [
      "Python-klooni Deluxe Paint II:sta on julkaistu GitHubissa, ja siinä on vaikuttavia ominaisuuksia, kuten palettien kierrätys ja animaatiot.",
      "Kayttäjät muistelevat Deluxe Paintia ja muita retro-grafiikkaohjelmia, korostaen taiteilija Mark Ferrarin töitä.",
      "Keskusteluihin sisältyy vertailuja muihin työkaluihin, kuten DPaint.js ja Aseprite, sekä teknisiä haasteita pikselitaideohjelmiston uudelleenluomisessa."
    ],
    "points": 166,
    "commentCount": 48,
    "retryCount": 0,
    "time": 1721940830
  },
  {
    "id": 41074002,
    "title": "Startup-rahoitus perustajille – Osa I, kirjanpito (2016)",
    "originLink": "https://rein.pk/startup-finance-for-founders-part-i-accounting",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41074002",
    "commentBody": "",
    "originSummary": [
      "Artikkeli on osa kaksiosaista sarjaa startup-rahoituksesta, keskittyen kirjanpitoon osassa I ja strategiseen rahoitukseen osassa II.",
      "Keskeisiä käsiteltyjä aiheita ovat turvallisen pankkitilitietorakenteen luominen, luottokorttirajojen hallinta ja siirtyminen Stripestä paperisopimuksiin ja -laskuihin asiakaskunnan kasvaessa.",
      "Kirjoittaja jakaa käytännön näkemyksiä kokemuksistaan Segmentissä, joka kasvoi merkittävästi ja keräsi 44 miljoonaa dollaria, korostaen peruskirjanpidon ymmärtämisen tärkeyttä startup-yritysten perustajille."
    ],
    "commentSummary": [
      "Artikkeli \"Startup Finance for Founders – Osa I, Kirjanpito\" käsittelee startup-yritysten perustajille olennaisia kirjanpidon periaatteita, vaikka se ei sisälläkään yksityiskohtaista kirjanpitotietoa.",
      "Merkittävä esille nostettu seikka on strategia neuvotella luottolimiittejä sijoitusneuvottelujen aikana sen sijaan, että luottokorttien limiittejä kasvatettaisiin vähitellen.",
      "Keskustelu käsittelee myös rajoituksia ja riskejä, jotka liittyvät maksukorttien käyttöön esimerkiksi autonvuokrauksessa, erityisesti Yhdysvalloissa verrattuna Eurooppaan."
    ],
    "points": 154,
    "commentCount": 16,
    "retryCount": 0,
    "time": 1721946028
  },
  {
    "id": 41072616,
    "title": "Sovellettu koneoppiminen taulukkodatalle",
    "originLink": "https://aml4td.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41072616",
    "commentBody": "",
    "originSummary": [
      "\"Applied Machine Learning for Tabular Data\" Max Kuhnin ja Kjell Johnsonin kirjoittama käytännön opas ennustemallien kehittämiseen taulukkotiedoista, julkaistaan kesäkuussa 2024.",
      "Kirja kattaa koko ennustemallinnusprosessin, mukaan lukien piirteiden suunnittelun ja mallinnuksen jälkeiset toimet, ja se on lisensoitu CC BY-NC-SA 4.0 -lisenssillä, joka sallii ei-kaupallisen käytön ja mukauttamisen.",
      "Kirja on suunnattu data-analyytikoille, tilastotieteilijöille ja data-tieteilijöille, ja se tarjoaa harjoituksia ja laskentalisäosia, pääasiassa käyttäen R:n tidymodels-kehystä, ja toivottaa yhteisön panokset tervetulleiksi GitHubin kautta."
    ],
    "commentSummary": [
      "Keskustelu sovelletusta koneoppimisesta (ML) taulukkodatan osalta, korostaen yleisiä haasteita kuten datavuoto, älykäs datan jakaminen ja mallin valinta.",
      "Painotus XGBoostin käytössä huipputulosten saavuttamiseksi, vaikka jotkut asiantuntijat suosittelevat vaihtoehtoja kuten LightGBM, CatBoost ja satunnaismetsät.",
      "Maininta uudesta käytännönläheisestä oppikirjasta, jonka on kirjoittanut O'Reilly-kustantamon kirjailija ja joka keskittyy koneoppimisjärjestelmien rakentamiseen ominaisuustallennuksen ja käytännön projektien avulla."
    ],
    "points": 143,
    "commentCount": 16,
    "retryCount": 0,
    "time": 1721936915
  },
  {
    "id": 41076190,
    "title": "Johdatus Bcachefs-tiedostojärjestelmään",
    "originLink": "http://blog.asleson.org/2024/07/24/bcachefs-an-introduction/exploration/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41076190",
    "commentBody": "",
    "originSummary": [
      "Bcachefs on uusi tiedostojärjestelmä, joka on suunniteltu voittamaan olemassa olevien tiedostojärjestelmien rajoitukset ja tarjoamaan ainutlaatuisia ominaisuuksia ja parannuksia.",
      "Tämä tukee kokeellisia RAID-tasoja (0, 1, 5, 6) ja virheenkorjauskoodausta, vaikka joidenkin käyttöä ei vielä suositella.",
      "Bcachefs on edelleen kehitteillä, ja jatkuvia parannuksia sekä yhteisön apua tarvitaan monilaitteiden hallintaan ja järjestelmäintegraatioon."
    ],
    "commentSummary": [
      "Uutta tiedostojärjestelmää Bcachefs keskustellaan sen virheenkäsittelyominaisuuksien, erityisesti sen itsekorjautuvan ominaisuuden osalta luku-IO/tarkistussumma-virheissä, joka otetaan käyttöön Linux 6.11:ssä.",
      "On käynnissä keskustelu itsekorjautuvuuden mahdollisista riskeistä, kuten mahdollisuudesta vahingoittaa hyviä tietoja, jos järjestelmän komponentit, kuten RAM-muisti, ovat viallisia.",
      "Vertailuja tehdään Bcachefs:n ja muiden tiedostojärjestelmien, kuten ZFS:n ja btrfs:n, välillä, kun käyttäjät jakavat kokemuksiaan ja huoliaan luotettavuudesta ja tietojen eheydestä."
    ],
    "points": 137,
    "commentCount": 164,
    "retryCount": 0,
    "time": 1721974452
  },
  {
    "id": 41075934,
    "title": "Zulip 9.0: Järjestetty keskustelu hajautetuille tiimeille",
    "originLink": "https://blog.zulip.com/2024/07/25/zulip-9-0-released/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41075934",
    "commentBody": "",
    "originSummary": [
      "Zulip Server 9.0 on julkaistu, ja se sisältää satoja päivityksiä ja virheenkorjauksia, jotka parantavat sen käytettävyyttä etä- ja hybridityössä.",
      "Keskeisiä päivityksiä ovat käyttöliittymän uudistus, parannettu viestien kirjoittaminen, terminologian muutokset, tehostettu haku ja parempi käyttäjien perehdytys.",
      "Uudet integraatiot, tuki Ubuntu 24.04:lle ja seuraavan sukupolven mobiilisovellukset, jotka on rakennettu Flutterilla, ovat merkittäviä parannuksia."
    ],
    "commentSummary": [
      "Zulip 9.0 on julkaistu, ja siinä on uusi vähemmän tiivis oletusasettelu sekä suunnitelmia lisää mukautusmahdollisuuksia varten.",
      "Zulipin järjestetyt tilat ja intuitiivinen suunnittelu saavat kiitosta tuottavuuden parantamisesta, erityisesti hajautetuille tiimeille.",
      "Uusi mobiilisovellus on rakennettu Flutterilla, avoimen lähdekoodin kehityskehyksellä, joka tunnetaan suorituskyvystään ja iterointinopeudestaan."
    ],
    "points": 133,
    "commentCount": 77,
    "retryCount": 0,
    "time": 1721970859
  },
  {
    "id": 41072795,
    "title": "Sveitsi määrää valtion virastojen käyttävän avoimen lähdekoodin ohjelmistoja",
    "originLink": "https://www.tomshardware.com/software/switzerland-mandates-government-agencies-use-open-source-software",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41072795",
    "commentBody": "",
    "originSummary": [
      "Sveitsi on hyväksynyt lain, joka vaatii valtion virastoja käyttämään avoimen lähdekoodin ohjelmistoja (OSS) ja julkaisemaan uudet hallituksen koodit avoimen lähdekoodin lisenssien alaisuudessa. Laki tunnetaan nimellä \"Laki sähköisten keinojen käytöstä hallituksen tehtävien täyttämiseksi\" (EMBAG).",
      "Tämän aloitteen tavoitteena on parantaa läpinäkyvyyttä, turvallisuutta ja tehokkuutta tekemällä ei-henkilökohtaiset, ei-turvallisuusherkät hallituksen tiedot julkisesti saataville.",
      "Sveitsin toimenpide on linjassa vastaavien eurooppalaisten aloitteiden kanssa ja saattaa mahdollisesti inspiroida avoimen lähdekoodin ohjelmistojen laajempaa käyttöönottoa Euroopassa ja Yhdysvalloissa."
    ],
    "commentSummary": [
      "Sveitsi määrää, että valtion virastojen on käytettävä avoimen lähdekoodin ohjelmistoja, pyrkien lisäämään avoimuutta ja vähentämään riippuvuutta suljetuista toimittajista.",
      "Avoimen lähdekoodin ohjelmisto mahdollistaa hallituksille koodin muokkaamisen ja tarkastamisen, mikä voi johtaa parempaan turvallisuuteen ja kustannussäästöihin välttämällä toimittajalukon.",
      "Tätä siirtoa pidetään investointina paikallisiin kykyihin ja askeleena kohti systemaattista, pitkäaikaista digitalisaatiota, huolimatta mahdollisista lyhyen aikavälin kustannuksista."
    ],
    "points": 126,
    "commentCount": 31,
    "retryCount": 0,
    "time": 1721937944
  },
  {
    "id": 41073688,
    "title": "Yhdysvaltain puolustusministeriö – Ketterän BS:n havaitseminen [pdf] (2018)",
    "originLink": "https://media.defense.gov/2018/Oct/09/2002049591/-1/-1/0/DIB_DETECTING_AGILE_BS_2018.10.05.PDF",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41073688",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Yhdysvaltain puolustusministeriön vuoden 2018 asiakirja käsittelee ketterän ohjelmistokehityksen tehottomuuksia, korostaen ongelmia, kuten loppukäyttäjien vuorovaikutuksen puutetta ja välikäsien varojen väärinkäyttöä.",
      "Dokumentti ehdottaa, että ketterät käytännöt ovat usein väärin sovellettuja, mikä johtaa resurssien tuhlaamiseen ja epäonnistumiseen toimittaa laadukasta ohjelmistoa ajallaan.",
      "Se korostaa tarvetta parempaan kehitystiimien ja loppukäyttäjien väliseen yhteistyöhön ja varoittaa liiallisesta riippuvuudesta työkaluihin ja prosesseihin."
    ],
    "points": 122,
    "commentCount": 40,
    "retryCount": 0,
    "time": 1721943649
  },
  {
    "id": 41079901,
    "title": "Intelillä ei ole korjausta 13. ja 14. sukupolven suorittimien kaatumisongelmiin – vaurio on pysyvä",
    "originLink": "https://www.theverge.com/2024/7/26/24206529/intel-13th-14th-gen-crashing-instability-cpu-voltage-q-a",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41079901",
    "commentBody": "",
    "originSummary": [
      "Intelin 13. ja 14. sukupolven suorittimissa on kaatumisongelma kohonneiden jännitteiden ja valmistusvirheiden vuoksi, eikä sitä voida korjata, jos vahinko on jo tapahtunut.",
      "Korjauspäivitys tulevien ongelmien estämiseksi odotetaan elokuun puolivälissä, mutta vaurioituneet suorittimet on vaihdettava; Intel ei aio tehdä takaisinvetoa tai pidentää takuita.",
      "Vaikuttavien käyttäjien tulisi päivittää BIOS ja ottaa yhteyttä Intelin asiakastukeen, sillä ongelma voi mahdollisesti koskea kaikkia 13. tai 14. sukupolven pöytätietokoneiden prosessoreita, jotka kuluttavat 65W tai enemmän tehoa."
    ],
    "commentSummary": [
      "Intelin 13./14. sukupolven suorittimilla on pysyvä kaatumisongelma, johon ei ole tällä hetkellä ratkaisua, ja se vaikuttaa suorittimiin, jotka kuluttavat 65W tai enemmän.",
      "MicroCenter on lopettanut näiden suorittimien sisällyttämisen paketteihinsa, ja elokuun puolivälissä odotettavissa oleva mikrokoodipäivitys saattaa heikentää suorituskykyä.",
      "Huolimatta ongelmasta, Intelin osake ei ole pudonnut merkittävästi, eikä yhtiö ole keskeyttänyt myyntiä tai suunnitellut takaisinvetoa, vaan keskittyy sen sijaan mikrokoodikorjauksiin."
    ],
    "points": 116,
    "commentCount": 45,
    "retryCount": 0,
    "time": 1722010954
  },
  {
    "id": 41080018,
    "title": "Stripe ostaa Lemon Squeezy -yrityksen",
    "originLink": "https://www.lemonsqueezy.com/blog/stripe-acquires-lemon-squeezy",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41080018",
    "commentBody": "",
    "originSummary": [
      "Stripe on hankkinut Lemon Squeezy -alustan, joka lanseerattiin vuonna 2021 helpottamaan digitaalisten tuotteiden myyntiä maailmanlaajuisesti.",
      "Yhtiö Lemon Squeezy saavutti yli miljoonan dollarin vuotuisen toistuvan liikevaihdon (ARR) yhdeksän kuukauden kuluessa lanseerauksestaan.",
      "Yrityskaupan tavoitteena on parantaa Lemon Squeezy:n tarjontaa Stripesin maksukyvykkyyksillä, mikä lupaa parempaa asiakaskokemusta ja luotettavuutta."
    ],
    "commentSummary": [
      "Stripe on hankkinut Lemon Squeezy -alustan, joka tunnetaan Merchant of Record (MoR) -ominaisuudestaan, joka yksinkertaistaa arvonlisäveron maksamista.",
      "Kayttäjät ovat huolissaan mahdollisista maksujen muutoksista ja MoR-ominaisuuden tulevaisuudesta, mikä johtaa sekaviin tunteisiin yritysoston suhteen.",
      "Jotkut pitävät yritysostoa kilpailua vähentävänä maksualalla, kun taas toiset toivovat parannuksia verojen käsittelyn integroinnissa."
    ],
    "points": 114,
    "commentCount": 62,
    "retryCount": 0,
    "time": 1722011999
  },
  {
    "id": 41076831,
    "title": "Ranskan nopean junaliikenteen häiriöt 'pahantahtoisten tekojen' vuoksi olympialaisten seremonian aikana",
    "originLink": "https://www.lemonde.fr/en/france/article/2024/07/26/france-s-high-speed-trains-struck-by-malicious-acts_6699471_7.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41076831",
    "commentBody": "",
    "originSummary": [
      "Ranskan nopea junaverkosto, mukaan lukien TGV, kohtasi merkittäviä häiriöitä \"pahantahtoisten tekojen\" kuten tuhopolton vuoksi juuri ennen Pariisin olympialaisia.",
      "Hyökkäykset vahingoittivat junaturvallisuuden kannalta välttämättömiä valokuitukaapeleita, mikä vaikutti 800 000 matkustajaan ja aiheutti laajoja peruutuksia ja viivästyksiä. Korjausten odotetaan kestävän koko viikonlopun.",
      "Ranskalaiset viranomaiset tuomitsivat hyökkäykset \"rikollisina tekoina\" ja käynnistivät tutkinnan, jonka mahdollisina rangaistuksina voi olla jopa 20 vuoden vankeustuomio ja huomattavat sakot."
    ],
    "commentSummary": [
      "Ranskan nopean junaliikenteen häirintää aiheuttivat \"pahantahtoiset teot\" olympialaisten seremonian aikana, mikä korostaa julkisen liikenteen järjestelmien haavoittuvuutta sabotaasille.",
      "Spekulaatiot viittaavat mahdolliseen ulkomaisten toimijoiden, mukaan lukien Venäjän, osallisuuteen, ja vetävät yhtäläisyyksiä vastaaviin tapauksiin Saksassa ja muissa osissa Eurooppaa.",
      "Tapauksen johdosta on käynnistynyt keskusteluja liikennemuotojen kestävyydestä, kansallisen turvallisuuden vaikutuksista ja tarpeesta suojata kriittistä infrastruktuuria."
    ],
    "points": 90,
    "commentCount": 325,
    "retryCount": 0,
    "time": 1721982188
  },
  {
    "id": 41077798,
    "title": "Ranskan rautatieverkkoa koettelevat 'pahantahtoiset teot' ennen Pariisin olympialaisia",
    "originLink": "https://www.aljazeera.com/news/2024/7/26/french-rail-network-hit-by-malicious-acts-ahead-of-olympic-ceremony",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41077798",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Ranskan rautatieverkkoa on kohdistettu 'pahantahtoisilla teoilla' juuri ennen Pariisin olympialaisia, mikä herättää huolta turvallisuudesta ja infrastruktuurin kestävyydestä.",
      "Ajankohta näille teoille on erityisen merkittävä, kun Ranska valmistautuu isännöimään suurta kansainvälistä tapahtumaa, mikä korostaa mahdollisia haavoittuvuuksia.",
      "Keskustelut ja lisätiedot jatkuvat eri foorumeilla, mikä heijastaa tapauksen suurta julkista ja median kiinnostusta."
    ],
    "points": 89,
    "commentCount": 3,
    "retryCount": 0,
    "time": 1721994194
  },
  {
    "id": 41076252,
    "title": "Tietokanta kaikista rahoitetuista startup-yrityksistä",
    "originLink": "https://old.reddit.com/r/b2b_sales/comments/1ecgw9g/a_database_of_all_startups_who_received_funding/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41076252",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Tietokanta kaikista rahoitetuista startup-yrityksistä on jaettu Redditissä, saaden merkittävää huomiota 81 pisteellä.",
      "Julkaisu on herättänyt keskustelua, ja jotkut käyttäjät kyseenalaistavat sen uudelleenjulkaisun tiheyden."
    ],
    "points": 81,
    "commentCount": 1,
    "retryCount": 0,
    "time": 1721975192
  }
]
