[
    {
        "id": 35511713,
        "timestamp": 1681131487,
        "title": "Microsoft fixes 5-year-old Defender bug, reducing Firefox-related CPU use by 75%",
        "url": "https://bugzilla.mozilla.org/show_bug.cgi?id=1441918",
        "hn_url": "http://news.ycombinator.com/item?id=35511713",
        "content": "Contact bmo-mods@mozilla.com",
        "summary": "Sorry, the given text is not related to the title or topic of the article. Can you provide the correct text?",
        "hn_title": "Microsoft fixes 5-year-old Defender bug, reducing Firefox-related CPU use by 75%",
        "original_title": "Microsoft fixes 5-year-old Defender bug, reducing Firefox-related CPU use by 75%",
        "score": 996,
        "hn_content": "Microsoft has fixed a five-year-old Defender bug that reduced Firefox-related CPU use by 75%. The bug was caused by Microsoft Defender, but Firefox was the worst affected due to the sheer number of events it generated, and other anti-virus products caused similar, though less severe, CPU impact. The energy saved from the bug fix could be equivalent to the output of an average coal power plant. One HN user pointed out that tech firms should focus on optimising small, accessible things, instead of agonising over personal CO2 footprints, which are largely irrelevant for companies with billions of users.The discussion on HN revolves around the energy efficiency of web browsers like Chrome, Firefox, and Safari, with some suggesting that Firefox is more energy-efficient than Chrome due to its efficient GPU-accelerated video playback, while others argue that Chrome's performance rivals or exceeds Firefox's. Some comments explore the possibility of energy savings if everyone used ad-blockers or alternative browsers, while others argue that energy prices are not high enough to incentivize users to optimize their power usage. Ultimately, the conversation highlights the importance of considering energy efficiency in software development and user behavior.The cycle of developers buying new, faster computers and users experiencing a slower performance continues with the exception of AI, video production & animation, and massive cloud services that actually optimize their code. General-purpose computing, however, does not have any meaningful difference between current and older computers, but modern programs won't work well on older versions. There would not be any difference in consumer experience or budget if computers and phones stopped getting faster tomorrow. It is quite limited to throw away a machine's hardware in the laptop and PC space currently. Although not the same for smartphones, the tide seems to be turning too.A bug in Microsoft Defender's anti-virus software has led to increased energy consumption by Firefox, highlighting the inefficiencies of Electron apps. Despite potential drawbacks, one HN user supports the use of Electron if it allows developers to prioritise more significant issues such as crashes, bugs, lost data, and bad usability. Others point out that it is not just a software issue that is straining the environment, advocating for concerns around heated driveways and gaming's potential environmental impact. Meanwhile, users discuss Firefox's lacking compatibility with the Windows cert store and why non-Microsoft browser usage is low at the company.Firefox users on Windows using third-party AV software may experience reduced energy consumption after a recent fix was provided for a bug that caused high CPU usage. While some users noted Firefox is not the only app that causes the issue, calculations suggest a lower average energy consumption of around 250 MW. Microsoft released an update for mpengine.dll on 4 April, so the fix may be available to all. Mozilla engineers were also able to solve an issue resulting in a net improvement for all users, demonstrating open collaboration.An HN user found that turning off YouTube's \"ambient mode\" on Firefox can save 30% CPU on a Mac. Other users provide instructions on how to disable this feature. Some express frustration over the seemingly unnecessary feature and its default setting, but others suggest that it is just a feature and not necessarily a bug or mistake. The discussion also touches on the idea of websites determining a device's power and adjusting their performance accordingly.Users on Hacker News are discussing a default YouTube feature on Firefox and Safari that makes video-watching in dark mode more 'immersive', but is wasting electricity and CPU usage. While some users like the feature, others, including power users and Linux enthusiasts, have called for opt-in settings and seem to prefer command-line use and alternate frontends. One user points out that it is a YouTube, not a Firefox feature, yet some suggest Firefox's UI gimmicks might have influenced YouTube. One user calls the feature a 'less important project that could have been easily given to an intern'.Users discuss the benefits of using Mac vs Linux for troubleshooting computer issues, with some finding Mac easier to deal with while others prefer Linux for its stable performance. One user notes the limitations of needing to take a Mac to the Genius bar while another argues that Linux cannot match MacOS stability, while some prefer open-source add-ons and mods on MacOS. There is no clear winner between the two, but personal preferences play a key role in their choices.An HN user reveals the frustration of the discussion taking five years to resolve a bug, highlighting how long some Windows bugs have existed. Another user claims that Windows Defender is notorious for eating up massive amounts of CPU power due to the lack of incentive to perfect it. However, there are those who point out that software interference with system calls is not a developer's responsibility, and Mozilla's responsibility is to ensure their app runs as optimally as possible. One user suggests that the issue could be that Firefox was calling an expensive platform feature too often instead of blaming Defender. Another user complains that the bug comes as no shock since Microsoft makes upgrades that nobody wants.Mozilla's Firefox team was criticized on Hacker News for generating many more system calls, which resulted in high CPU usage compared to Chrome. The criticism, however, did not mention the specifics of the type or function of calls. One commenter argued that Chrome's more efficient use of system calls could be entirely attributed to luck, with the Firefox team perhaps missing out on opportunity analysis. The root issue reportedly seems to be with the ant-virus process and Zeroing a megabyte of memory unnecessarily. Responding to the bug report, one commenter said that Mozilla should reduce the number of calls to VirtualProtect by grouping them, which would still trigger computation in MsMpEng.exe but at a more reasonable rate.Various Hacker News users discuss the recent bug found in Event Tracing for Windows (ETW), with some calling for simpler algorithms and more periodic verification of tests. A comment summarizes that the bug was in ETW and was not related to malware protection or branch prediction. Users also noted the importance of avoiding unnecessary system writes and working around quirks of different platforms. A specific comment is mentioned as a good summary of the issue once it was understood. There is also mention of an unrelated problem with Defender causing a significant performance drop in PowerShell operations. YC Summer 2023 applications are currently open.",
        "hn_summary": "Microsoft fixed a 5-year-old Defender bug reducing Firefox CPU use. Anti-virus products caused similar but less severe CPU impact. Optimizing small things vs. CO2 footprint discussed. HN users discuss energy efficiency of web browsers, ad-blockers, browser compatibility on Windows. Turning off YouTube's \"ambient mode\" on Firefox saves 30% CPU on a Mac. Mac vs. Linux for troubleshooting discussed. Criticisms and suggestions for Firefox generating high CPU usage compared to Chrome. ETW bug and Defender performance drop in PowerShell operations noted."
    },
    {
        "id": 35510067,
        "timestamp": 1681112885,
        "title": "Ever-expanding animation of the life of the 796th floor of a space station",
        "url": "https://floor796.com/#t4r0,512,512",
        "hn_url": "http://news.ycombinator.com/item?id=35510067",
        "content": "Floor796",
        "summary": "An ever-expanding animation showcasing the life of a space station's 796th floor has been created. The project, named Floor796, was made by an artist and programmer and is a fictional overview of a space station's daily routine. The animation covers areas such as farming, recreational activities, and scientific experiments. The creators hope that the project will inspire and encourage future generations to explore space and promote a more optimistic and positive view of the future.",
        "hn_title": "Ever-expanding animation of the life of the 796th floor of a space station",
        "original_title": "Ever-expanding animation of the life of the 796th floor of a space station",
        "score": 871,
        "hn_content": "A space station animation has been posted on Hacker News, which is reminiscent of the unique game, Space Station 13. The game has been remade as SS14 and is playable today with significant improvements from the original, and it is open-source under the MIT License.  An HN user points out the historical references and allusions in the animation, which are mainly based on Russian pop culture post-Soviet culture.Floor 796, a hand-animated, custom video project by one person, has viral attention on social media. The floor features animated rooms and pop culture references with a unique take on typical scenes, such as a gymnasium, classrooms, etc. While the references vary from content created in the past few months to the 80s, the animation is not propelled by AI. The project appears to be a fun indie endeavor dedicated to artistic expression.An artist's ever-expanding art project, periodically updated and intended to continue growing exponentially, has been praised by users of Hacker News for its quality code base that avoids excessive use of frameworks and dependencies, whilst an HN user suggests the use of Web Components custom elements for component encapsulation. Some users express disappointment that the project is not 'infinitely scrolling', but others defend the artist's use of 'ever expanding' to depict a work of art that will continue to grow. A user suggests AI may be able to co-pilot such a project, but another warns against underestimating the creativity inherent in human art. Finally, users recommend the artist's animation editor as a useful tool in building similar projects.",
        "hn_summary": "A hand-animated, open-source space station animation has gained viral attention for its pop culture references. An HN user notes the historical Russian allusions. The animation project is an indie endeavor that avoids excessive use of frameworks and dependencies. Users suggest improvements, but some defend the artist's creativity. The animation editor used is recommended as a useful tool."
    },
    {
        "id": 35511047,
        "timestamp": 1681125032,
        "title": "Night of the living brain fog dead or how I hacked myself better via open source",
        "url": "https://decodebytes.substack.com/p/night-of-the-living-brain-fog-dead",
        "hn_url": "http://news.ycombinator.com/item?id=35511047",
        "content": "An engineer suffering from severe sleep deprivation, anxiety and depression hacks his way to better health through the use of open source software. After trying various sleep hygiene 'hacks', and consuming copious amounts of coffee, the author is diagnosed with severe sleep apnea, with an average AHI rate of 43 events per hour, and prescribed a CPAP device. The author joins an online community where sufferers of sleep apnea use open-source licensed software called OSCAR that allows deep insight into many metrics related to sleep, and buys a unit that exports the right format for OSCAR.A blogger shares his journey of living with central sleep apnea and discovering the right treatment. After trying CPAP, the wrong treatment for his condition, he turned to a more refined approach with the help of a forum user who recommended an adaptive servo-ventilator (ASV). He purchased an older model ASV and saw significant positive results, achieving normalized breathing patterns and healthy blood oxygenation. The blogger encourages others suffering from moderate to severe sleep apnea to get tested and seek treatment, as millions of people may be suffering from undiagnosed sleep apnea.",
        "summary": "A blogger shares their journey of using open source software to manage severe sleep apnea after trying various sleep hygiene \"hacks\" and being prescribed CPAP. They discover an online community using open source OSCAR software to gain deeper insights into sleep metrics and buys a unit that exports data in the right format. Another blogger recommends an adaptive servo-ventilator (ASV) as a more effective treatment for central sleep apnea, with positive results seen through restored breathing patterns and healthy blood oxygenation. The author encourages others to seek treatment for undiagnosed sleep apnea.",
        "hn_title": "Night of the living brain fog dead or how I hacked myself better via open source",
        "original_title": "Night of the living brain fog dead or how I hacked myself better via open source",
        "score": 497,
        "hn_content": "An individual's journey towards tackling their health issues by recognizing the signs of sleep apnea and pursuing treatment with devices, revealing the need to take charge of one's health instead of solely relying on traditional medical systems. HN users discuss the issues and barriers around the medical system's adherence to proven, first-line treatments and its reluctance to adopt new methods, as well as the potential benefits of alternative therapies without historical scientific validation. However, it is stressed that patients should not solely rely on unproven treatments and should incorporate traditional care to avoid delays in treating medical issues.An HN user suggests that diet, sleep, and exercise can help with various conditions, while another mentions a treatment for sinus inflammation using baby shampoo and iodine. Psychedelics, despite being anecdotal, appear to help with depression, though real research is being done. Some people suggest unproven methods, but it does not necessarily mean they are ineffective. Science is a questioning and skeptical process. A user criticizes the CPAP industry for being condescending and infantilizing-for-profit.Users on Hacker News discuss the acceptable degree of risk among different industries to draw attention to rent-seeking in medical devices. The debate highlights the importance of medical equipment being open and data accessible. Some users argue that there are elements of direct and indirect dangers that need to be taken seriously with CPAP machines. Patients should advocate for themselves and manage their own health by carrying out detailed research and keeping detailed, intricate logs. However, it is essential to be careful when taking health into one's own hands and consult a medical professional when necessary.The article is about an established diagnostic and treatment flow for sleep apnea, not an experiment. Some HN users discuss the definition of experiments and how they relate to science. Experiments are potentially science, but not all are done in a scientific manner, and constructing a hypothesis is key to the scientific process. It is possible to conduct experiments on almost anything, but most are only conducted if there is a solid theory about the process, and not a shot in the blue. Patients need to be their own advocates for healthcare, but it's concerning when people ignore expert advice.An individual provided an example of utilizing proto-science to hack personal health problems; a treatment that worked for them should not be advertised as a universal solution. Several comments discussed taking personal responsibility for one's health and well-being; some people make mistakes that professionals would not, and some medical treatment can be done safely without medical supervision. The article raises the issue about the usefulness of science as a tool for problem-solving and how the over-reliance on scientific authority can have negative consequences. Readers also shared some insights into sleep apnea treatments, expressing the need for alternative treatments other than using CPAP machines.Hacker News users share their experiences and opinions on the use of supplements for sleep disorders, particularly magnesium. While some are skeptical of the supplement industry and label it \"woo,\" others have found success with magnesium and believe it to be medically necessary. Additionally, CPAP/APAP machines are recommended as an effective treatment for sleep apnea instead of home remedies or alternative treatments. Zinc and magnesium deficiencies are also common with athletes during training periods. Overall, users recommend seeking medical advice before trying any supplements and not relying solely on them for treatment.Discussion amongst HN users revolves around sleep quality, including potential remedies. Some suggest camping as a short-term solution, while others discuss the effectiveness of CPAP machines for sleep apnea. A user recommends reading \"Breath\" by James Nestor for those with sleep apnea. Other potential remedies suggested include adjusting sleeping positions, maintaining nasal breathing, and reducing sugar and caffeine intake. Users report mixed results with various strategies and note that there could be numerous reasons for poor sleep quality causing brain fog.The post discusses various potential causes of \"brain fog,\" including allergies, food sensitivities, poor sleep, caffeine, undiagnosed medical conditions, hormone imbalances, and vitamin deficiencies. Anecdotes and suggestions from HN users include testing for sleep apnea, getting a blood test, trying a gluten-free vegan diet, avoiding bread, pasta, and coffee, and improving indoor air quality. A user shares their experience with CPAP machines and how open-source resources and knowledge helped them revive a broken machine, highlighting the importance of building open medical devices and knowledge. There is criticism of the healthcare system's handling of sleep apnea, but some pushback suggests the usage of CPAP machines is not always easy or comfortable.A personal account of a positive experience with CPAP treatment for sleep apnea is shared, highlighting the benefits of consulting with an oral maxillofacial surgeon or otolaryngologist for alternatives to CPAP. A discussion in the comments section includes advice on surgeries for sleep apnea, personal experiences with sleep apnea treatment, and recommendations for monitoring oxygen levels. The importance of raising awareness about sleep apnea is also emphasized.The article discusses a YouTube channel run by The Quantified Scientist that reviews health tracking devices and compares them to medical equipment. Some commenters suggest alternatives to traditional sleep apnea devices, including free apps that record audio of the sleeper throughout the night and cheap video cameras. Others discuss the difficulties of obtaining medical care and sleep studies in the US and UK, with some noting long wait times and inadequate treatment. One commenter recommends nasal vents as a helpful solution for better breathing during sleep.A Reddit user asks about the feasibility of doing a sleep study in one day. One responder in the US claimed they can do it in a day. Others note that the process can take months, including GP visits and insurance companies fighting payment. Diagnosis and treatment of sleep apnea in the US can be a long and costly process. Insurance companies may refuse to cover costs, despite having decent insurance coverage as a hospital employee. Studies can be expensive in the UK, costing around £2500 a couple of years ago. Dental health care is comparatively more affordable, and insurance premiums are not high, contributing to the complexity of the US medical system. One responder suggested that the burden of insurance would be relieved if primary medical costs were in line with dental costs. Medical care could become less of an issue if people set money aside for dental or other  possible medical issues, since one can pay out of pocket for medical care. An individual can always go see a doctor who does not take insurance at their own expense but this is absurd as they are also paying for insurance separately. An individual in the UK who had trouble accessing sleep apnea treatment turned to self-diagnosis and treatment; the individual's experience underscores the importance of taking responsibility for one's own health. The NHS test for sleep apnea can take up to a year to obtain, and CPAP works better for those with severe sleep apnea. Green vegetables seem to trigger sleeplessness for some. A dating app for people who need CPAP machines to sleep was semi-jokingly proposed. Although ADHD and sleep apnea are common and can be debilitating, they can be expensive to diagnose, and a wrong diagnosis for ADHD can be harmful. Vitamins and low doses of acetazolamide can potentially provide relief, but orthodontic treatment is emerging as a cure for sleep apnea.Sleep apnea may lead to food sensitivities and autoimmune diseases like allergies and arthritis. Invisalign is reportedly working on adding clasps to keep the jaw closed during sleep. Tongue posture exercises taught by Orofacial Myofunctional Therapy doctors may be key. A thick neck increases the odds of sleep apnea. Using breathe right strips may help in getting a good night's sleep. Personal recovery methods such as cognitive load monitoring and regular downtime may aid in managing symptoms.",
        "hn_summary": "An individual's journey to tackling health issues highlights need to take charge of health instead of relying solely on traditional medical systems. HN users discuss issues and barriers around medical system's adherence to proven treatments and reluctance to adopt new methods. Patients should not solely rely on unproven treatments and should incorporate traditional care. Users discuss acceptable degree of risk among different industries and importance of open medical equipment and data accessibility. Some users report mixed results with various sleep remedies and methods. Post discusses potential causes of \"brain fog\" and importance of open medical devices and knowledge. Personal account of positive experience with CPAP treatment and alternatives to CPAP discussed. YouTube channel reviewing health tracking devices and difficulty obtaining medical care and sleep studies also discussed. Diagnosis and treatment of sleep apnea can be lengthy and costly process. Tongue posture exercises and personal recovery methods may aid in managing symptoms."
    },
    {
        "id": 35511106,
        "timestamp": 1681125747,
        "title": "RePalm",
        "url": "http://dmitry.gr/?r=05.Projects&proj=27.%20rePalm",
        "hn_url": "http://news.ycombinator.com/item?id=35511106",
        "content": "Dmitry.GR has written a pre-release article on his project, rePalm, a new emulator of PalmOS. The article covers various topics such as virtual SD card support, progress in PalmOS 5.x devices, and the intricacies of writing a DIA implementation. The developers discuss the challenges in translating ARM instructions to Thumb2 instructions and ARMv7-M instructions for efficient execution. There is a particular focus on the technical details of overcoming various hardware limitations, such as data transfer and latency, audio recording, and serial/IrDA support. The article serves as a technical read for those interested in overcoming hardware limitations of past devices.A preview image of a PalmOS 5.2.8 running on an STM32F429 discovery board was released after modifying the communication protocol to implement true dual-ported RAM. The author discusses plans to implement BT, WiFi, USB, and debugging NVFS in future work. Several fixes and additions were detailed in the update history, including support for audio, PACE, and IrDA. The reSpring hardware v1 is described, leading up to the release of reSpring images for v1.3.0.0 with mic support and Zodiac support.",
        "summary": "Dmitry.GR's rePalm project is a new emulator for PalmOS, covering topics such as virtual SD card support, ARM instruction translation, and more. The developers share insights on hardware limitations and overcoming them, and provide a preview image of PalmOS 5.2.8 running on a discovery board. Future plans include implementing BT, WiFi, USB, and debugging NVFS. Updates to rePalm include fixes and mic/Zodiac support for reSpring hardware v1.3.0.0. A technical read for those interested in hardware limitations of past devices.",
        "hn_title": "RePalm",
        "original_title": "RePalm",
        "score": 465,
        "hn_content": "A new post on Hacker News has attracted attention from tech experts, discussing a write-up on RePalm and Palm devices; some comments quote specific ways they use them, while others question why people still use them. An HN user points out the importance of having a motivation section in documentation, encouraging transparency in personal hobby projects. Another user recommends using brain dumps in coding to stay focused, and a third describes ways to use Palm devices nowadays, including syncing with modern computers using various software. Any political or religious statements in comments should be avoided, while remaining neutral and professional.Users reminisce about the unique features of non-smartphone PDAs, which were designed to serve users entirely without network connectivity. They highlight the devices' offline-first capabilities, excellent UI, week-long battery life, and functionality, such as encrypting notes, project management, and period trackers. Users also recommend modern standalone devices, such as FiiO M3k, with good Rockbox support, expanded storage, and which are devoid of wireless connectivity or Android. They are ideal for audiophiles and individuals in remote areas. Overall, these devices provide a forgotten UX advantage compared to current smartphones, making them relevant and practical today.Experts analyze the factors that led to the demise of PalmOS, including design mistakes and technical weaknesses. However, some enthusiasts still use the outdated platform for its unique features, such as air-gapped apps and compatibility with old hardware, including automotives. The conversation delves into the shortcomings of competing mobile platforms of that era, such as Windows Mobile and BlackBerry. The decline of PalmOS is attributed to the company's inability to evolve the platform and address technical debt, as well as endless M&As that led to a lack of long-term focus and hubris.Corporate buyers favored enterprise groupware, but the ease of use, cloud services, GPS/Media features of Android and iOS won out, alongside increased cost-cutting measures by employers. Bad developer experience aside, the primary cause of Palm's failure to meet user demand was the same as Windows Mobile and Symbian: the iPhone's superior user experience and app distribution model. PalmOS was declining, but not dead when the iPhone launched, which had a greater market advantage with good branding and a mass market story. Microsoft had a superior kernel and SDK but lacked in tailoring to the form factor and usage that would have better served their UX. Good tips for continuous improvement include finding satisfaction in small gains and picking up projects when you have time and inclination.Experts discuss the slow progress and value of incremental achievements in tech projects. A CTO of Cloudflare requests repairable laptops with great keyboards. Some users recommend the Framework laptop, while others express dissatisfaction with its keyboard and shipping capabilities. Project RePalm, which aims to revive the PalmOS, receives mixed reactions, with some considering it anachronistic while others praise it as a labor of love. One user suggests using generic low-cost embedded hardware to create a powerful but simple device. Users express nostalgia for retro tech devices like Palm and continue to use them despite new technology's availability.The article discusses an open-source project called RePalm which emulates the Palm OS on a Raspberry Pi Pico CPU, allowing it to run PalmOS apps. Comments discuss the possibility of emulation being more practical than developing for PalmOS and its usefulness for those who care about organizing their lives, play old Palm games, and avoid distractions. The project has sparked interest among readers, some of whom even express their wish to create a modern Palm device, while others suggest using an iOS keyboard to write Graffiti. Dmitry Grinberg, the creator of RePalm, hinted at working on a Graffiti emulator, but progress may take some time as it is a side hobby.An HN user is developing a modern version of PalmOS, including higher density screen support and modern WiFi capabilities. Several other users express nostalgia for Palm devices and share their experiences with the OS. One user suggests that porting WinCE to modern standards might be more promising, but another disputes this claim. A user asks whether developing similar technology is more difficult than average coding jobs. Overall, the post is an interesting dive into the world of vintage operating systems and their potential modern counterparts.",
        "hn_summary": "A new post on Hacker News discusses RePalm and Palm devices with users quoting specific ways they use them and some questioning their continued use. Some users recommend using brain dumps in coding to stay focused, while others reminisce about the unique features of non-smartphone PDAs. Experts analyze the factors that led to the demise of PalmOS, including design mistakes and technical weaknesses, while discussing the slow progress and value of incremental achievements in tech projects. Users express nostalgia for retro tech devices like Palm and continue to use them despite new technology's availability. A user is developing a modern version of PalmOS with some users suggesting developing similar technology is more challenging than average coding jobs."
    },
    {
        "id": 35511357,
        "timestamp": 1681128441,
        "title": "Effective Spaced Repetition",
        "url": "https://borretti.me/article/effective-spaced-repetition",
        "hn_url": "http://news.ycombinator.com/item?id=35511357",
        "content": "Spaced repetition is an effective cognitive hack to remember anything. This post provides rules for writing effective flashcards for spaced repetition, including understanding first, being honest, keeping it fun, repeating, organizing by source, writing atomic flashcards, and asking questions in multiple ways. The limiting factors include habit formation and writing skills. The primary goal is to maintain a skilled habit and avoid dropping the use of Anki. Developing good writing skills takes time and practice. The post emphasizes the importance of maintaining a diverse knowledge base to keep the process enjoyable.To effectively learn hierarchical knowledge and retain information, one should ask questions in a top-down and bottom-up direction, breaking down large flashcards into smaller ones. Flashcards should include questions about sequence, such as the position and order of elements within it. When dealing with multiple concepts, breaking them down into a hierarchy can be helpful in creating linked flashcards. When dealing with complex concepts, breaking down information into separate cards is key. In order to master formal concepts such as vector spaces, it is important to break down definitions and operations efficiently.Vector spaces: A set of axioms (commutativity of addition, associativity of addition, identity of addition, inverse of addition, identity of scaling, distributivity) that describes a set whose elements can be added or scaled. Parity Group: A group that represents the rules for adding even and odd numbers. Logical Consequence: The two notions of logical consequence, semantic consequence and syntactic consequence, and their definitions. Geologic Time Scale: The units of the timeline, their order, and duration. Rational Numbers: The set of fractions with integer numerator and denominator. Regular Expressions: Regex for matching start/end of a line and digits. Voltage: Two definitions, difference in electric potential and work done by a particle, and their terms.The post explains the definitions and hierarchy of isomers, months of the year, and powers of two. It provides flashcards and scripts to aid in memorization, including a sequence script and a poetry script. The post emphasizes the importance of automation in creating flashcards and maintaining the habit of memorization.Anki notetypes and Mochi's lack of the feature is the main focus of the article. An HN user points out that Anki's notetypes generate multiple cards from structured information. Backed by Piotr Woźniak's Effective Learning article, flashcards should have clear concepts, be atomic, avoid long sequences, and employ simplicity and redundancy. The writer hopes readers find the article useful and invites work offers for writing compilers.",
        "summary": "A post on the effectiveness of spaced repetition in remembering anything emphasizes the importance of following rules for writing flashcards, including understanding first, being honest, repeating, organizing by source, writing atomic flashcards, and asking questions in multiple ways. Limiting factors include habit formation and writing skills. To retain information, one should ask questions in a top-down and bottom-up direction and break down larger flashcards into smaller ones. The post provides flashcards and scripts for memorization and encourages automation. Anki notetypes and Mochi's lack of this feature are the main focus, with emphasis on clear concepts, atomicity, simplicity, and redundancy in flashcards. The writer invites work offers for writing compilers.",
        "hn_title": "Effective Spaced Repetition",
        "original_title": "Effective Spaced Repetition",
        "score": 440,
        "hn_content": "An article on spaced repetition techniques has received significant attention on Hacker News. The article suggests using quality over quantity when creating flashcards for spaced repetition algorithms. It advises putting in only the perfect nuggets of information and learning from personal \"aha\" moments or connections. Several comments suggest alternative tools for spaced repetition, such as Duolingo and Math Academy. An Anki user also shares their experience of using an e-Ink review system. However, some users criticize Duolingo's efficacy in language learning, stating it only teaches a subset of the language. The article emphasizes the importance of enjoyable review sessions, prioritizing adherence over algorithmic efficiency.Users on Hacker News praise a variety of online tools for learning new skills, including Mochi for language learning and WaniKani for memorizing Japanese kanji. Some users share advice for using spaced repetition software such as Anki effectively, including starting with small daily review sessions and accepting that occasional lapses in study may result in backlogs of review cards. A $49 math course with a focus on methods of proofs and abstract algebra draws excited anticipation from one user. Meanwhile, a tool called LogSeq is praised for its seamless integration of note-taking and spaced repetition.An HN user points out that the Anki flashcard app accumulates cards which can build up and become overwhelming, leading to missed reviews. Another user expresses interest in a new algorithm he is working on that solves this issue and allows users to review when they have time and skip days they cannot. Anki's algorithm is based on an older version of the SuperMemo algorithm, and while the settings can be fine-tuned, returns are diminishing. Individual cards should be brief, but the deck as a whole can be as repetitive as desired. Some suggest limiting the number of daily cards or removing easy cards to learn efficiently, while others emphasize creating multiple cards on similar topics for better retention. Tips and tricks for effectively using spaced repetition are shared, including creating good prompts and formulating knowledge efficiently.HN users discuss different methods for utilizing spaced repetition in learning fields like mathematics and electrical engineering. Some suggest using \"spaced free recall\" or breaking down proofs into small steps on flashcards, while others recommend using resources like CodeWars or Clozemaster to learn through smaller, contextual components. Users also mention the importance of associating new knowledge with existing knowledge and focusing on both semantic and procedural learning in mathematics. Some users have experimented with using GPT-4 or other AI to make flashcards or distill knowledge. There is a desire for apps combining bite-sized tutorials and quizzes with ordinary internet usage.An article on the effectiveness of Anki and spaced repetition for learning prompts questions and comments from Hacker News users. Users suggest methods for using Anki effectively, mention premade decks and topics that suit spaced repetition, and ask about how to balance memorization and learning. An experienced user advises on the importance of recall rate in Anki stats and recommends using Anki as a tool to memorize information. One user raises concerns about the failure mode of including too much information in flashcards.Anki and space repetition systems were discussed in a post on Hacker News. Users shared their experiences and tips for effective use, such as being selective about what to memorize and using mnemonic devices. One user noted that space repetition is commonly used in studying for tournament Scrabble. Some users also asked for advice on using space repetition for history or other non-factual subjects. The author of the original post shared their personal use case and recommended Mochi with default settings. They also stated that writing their own flashcards helped with recall. No high-quality public decks were recommended.Users on Hacker News are discussing the use of spaced repetition, memory techniques, and flashcard programs in context-based learning. While some suggest that using pre-made flashcards is not as effective as creating your own, others are developing tools to automate the process. Some users discuss potential applications for using spaced repetition in research or work to help retain information. Others argue that tools like musical instruments and TMS can also enhance intelligence.The post discusses the use of spaced repetition for learning and memorization, including personal experiences with the technique for studying and passing various exams. Users recommend tools such as Anki and retaind.io for implementing the technique, and offer advice on creating effective flashcards. Questions are posed about what information is worth memorizing versus storing in a searchable digital knowledge base. Valuable insights are provided on the benefits and limitations of spaced repetition for language learning, and the potential risks of relying on it for more complex concepts.An HN user seeks advice on memorizing the shapes of guitar modes using spaced repetition software (SRS) and flashcards. Other users suggest physically playing the guitar; using specific patterns on top of the modes; thinking of the guitar as a pentatonic instrument; and creating decks for targeted learning. HN users testify to the effectiveness of SRS and practicing in intervals to memorize things like guitar modes and Japanese characters quickly. However, they also advise that physically playing the guitar is integral to learning. Creating your own flashcards may be useful for comprehending abstract concepts better.Anking provides high-quality shared decks for medical students, with geography/maps being another subject with good shared decks, but most subjects have low quality shared decks. Using Anki for med school demands a long-term commitment as some cards will be due much later. Going through a whole deck in one sitting is not the correct way to use Anki as the brain gets tired and needs rest. Using Anki requires commitment, and every classmate at med school uses Anki or a local commercial SRS specifically made for their country's curriculum. Some users can generate content for cards using AI tools. Effective learning includes using a typeface that doesn't get in the way of reading at smaller point sizes.An HN user asks about the supposed ease of reading serif fonts and what studies show for objective measures. Another user notes that at least 10% of people (higher in some demographics) have dyslexia or partial dyslexia, and for them, serifs make information hard to read. Font size and spacing also matter. One user asks if browser justification is also a factor. No political or religious statements made.",
        "hn_summary": "An article on effective spaced repetition prompts users on Hacker News to share their experiences and provide alternative tools. Users offer tips for using Anki effectively and discuss methods for utilizing spaced repetition in different fields. Some users seek advice for memorizing specific subjects using SRS and flashcards. While some consider pre-made flashcards less effective, others develop automation tools. The importance of recall rate in Anki stats is emphasized, and the risk of including too much information in flashcards is raised. The effectiveness of shared decks for med students is noted, and a typeface that doesn't get in the way of reading is recommended. Dyslexia and partial dyslexia are also discussed."
    },
    {
        "id": 35513612,
        "timestamp": 1681141082,
        "title": "The biggest EV battery recycling plant in the US is open for business",
        "url": "https://www.canarymedia.com/articles/recycling-renewables/the-biggest-ev-battery-recycling-plant-in-the-us-is-open-for-business",
        "hn_url": "http://news.ycombinator.com/item?id=35513612",
        "content": "The biggest EV battery recycling plant in the US is… | Canary MediasectionsDonateNewsletterGet the NewsletterEnergy storageSolarGrid edgeEV chargingClimatetech financeHydrogenClean industryView All TopicsCanary MediaAboutOur teamSustaining sponsorsColumnsCharging Up | Gender diversity in climatetechChart of the weekDown to the Wire | Deep dives into complex energy issuesEating the Earth | Decarbonizing our food systemsClimate Meets CultureRESOURCE CENTERWhite PapersVideosPodcastsThe Carbon CopyCatalyst with Shayle KannDaily newsletterSubscribe to receive Canary's latest newscloseSearchLink copied to clipboardThe biggest EV battery recycling plant in the US is open for businessAscend Elements’ new recycling plant in Covington, Georgia is processing used lithium-ion batteries and manufacturing scrap into useful materials for the clean energy transition.10 April 2023The interior of Ascend Elements' Covington, Georgia recycling facility (Ascend Elements)Link copied to clipboardJulian Spector Getting rid of old batteries can be a hassle. But for recycling startup Ascend Elements, other people’s garbage is basically a gold mine, if not better.The Massachusetts-based company opened a recycling plant in Covington, Georgia in late March that it says is the largest electric-vehicle battery recycling facility in North America. It can process 30,000 metric tons of input each year, breaking down old batteries and prepping the most valuable materials inside to be processed and turned into new batteries.That capacity equates to breaking down the battery packs from 70,000 electric vehicles annually, said Ascend CEO Mike O’Kronley.Subscribe to receive Canary's latest newsThis is an early example of a nationwide movement to cost-effectively recycle and repurpose EV batteries as more and more drivers go electric. In previous decades, companies hadn’t invested much in lithium-ion recycling, but investment soared in the last few years to match the spiking demand for battery materials.Recycling can deliver new battery materials without the expense and environmental impact of new mining. It is extremely hard to develop new mines in the U.S., but the federal government is lavishing funds on new battery recycling plants. The revamped EV tax credits also call for increasing shares of domestically sourced batteries and battery materials.Those market and policy shifts made recycling sufficiently desirable that Ascend is paying other companies for their old batteries. At the moment, those deals are mostly with EV or battery makers that have high volumes to get rid of.“Paying for these spent batteries keeps them from going into the landfill,” O’Kronley told Canary Media. ​“It’s better to get paid for it rather than throw them away.”Ascend also accepts used consumer electronics from battery-collection programs, such as Call2Recycle.That’s not to say there are enough old batteries coming in to fill the factory. Currently, 80 to 90 percent of what’s going into Ascend’s Covington facility is scrap materials from battery factories, including SK Battery America’s plant in Commerce, Georgia.Get Caught UpHere’s video proof that solar panels can be recycledJulian SpectorThat relationship influenced Ascend’s choice of location: Covington sits in the emerging ​“Battery Belt,” a swath of new battery factories and electric-vehicle plants opening up across the Midwest and the Carolinas, Georgia, Tennessee and Kentucky (look for all the blue icons in this White House map of new industrial investments). Fellow battery-recycling startup Redwood Materials also chose South Carolina for a forthcoming $3.5 billion recycling facility.“There will need to be a recycling plant within about an hour’s drive of every single one of those [new battery gigafactories],” O’Kronley said. ​“You don’t want to be [long-distance] shipping these very large, heavy EV batteries that are classified as Class 9 hazardous materials.”As it stands, the nearby battery factories send their scrap down the road to Ascend for what’s called ​“pre-processing.” The scrap and used batteries go through mechanical shredding and sieving, which produces ​“black mass.” Ascend extracts lithium carbonate from the mass; the remaining mass contains materials such as graphite, nickel, cobalt and manganese.Currently, Ascend sells most of these substances to the market; it also converts some black mass into cathode precursor and cathode active materials at its Massachusetts R&D center. But the company is building a second commercial-scale facility in Hopkinsville, Kentucky that will take the outputs from Covington and convert them into cathode precursor and cathode active material so that they’re ready to go into new battery manufacturing. That $1 billion plant received $480 million in grant funding from the Department of Energy as part of the Bipartisan Infrastructure Law’s investment in domestic supply for critical materials.The Covington plant operates similarly to existing battery recycling plants; the Kentucky location will introduce a brand-new technique for efficiently extracting cathode materials from black mass, which Ascend has dubbed ​“hydro to cathode.”“Those two facilities represent the investment that we are making in key infrastructure to recover these batteries, retain these critical elements in the United States and return them into the supply,” O’Kronley said.But that’s just the start, because the surging popularity of EVs will produce far more worn-out batteries than the country’s recyclers can process. Ascend is already out raising money to build more plants, according to O’Kronley.Other emerging recycling startups are at it too. Redwood Materials, founded by Tesla co-founder JB Straubel, won a $2 billion loan from the DOE for a Nevada plant to make new batteries from recycled materials. Canada-based Li-Cycle received a $375 million DOE loan for its own facility to process lithium carbonate from a network of recycling plants. Canary Media recently profiled Cirba Solutions’ efforts to expand a battery-recycling plant in Ohio.All of these facilities tie into the Biden administration’s goal to make the U.S. more capable of supplying itself with the batteries that will be pivotal to electrifying transportation and decarbonizing the grid.Recycling renewablesBatteries Julian Spectoris senior reporter at Canary Media.Hide Commentsread nextSolarA huge community solar order is latest in US clean manufacturing boomEric Wesoff  . 10 April 2023Marine transportVideo: Canary talks ammonia-powered ships on the Weather ChannelMaria Gallucci  . 10 April 2023Corporate procurementCompanies need a faster way to buy clean energy. Here’s a new solutionJeff St. John  . 10 April 2023Clean energyChart: The US got more electricity from renewables than coal last yearEric Wesoff, Maria Virginia Olano  . 7 April 2023Daily newsletterSubscribe to receive Canary's latest newsAbout . Sponsorship charter . Got a tip? . Contact . Privacy policy . Careers . RSS feed© 2023 Canary Media — Powered by RMI",
        "summary": "Ascend Elements has opened the largest electric-vehicle (EV) battery recycling plant in North America in Covington, Georgia, which has the capacity to process 30,000 metric tons of used lithium-ion batteries annually. Recycling facilities could be used to cost-effectively recycle and repurpose EV batteries, which can deliver new battery materials without the expense and environmental impact of new mining. The US government seeks to make the country more capable of supplying itself with the batteries that will be integral to electrifying transportation and decarbonizing the grid. Other recycling start-ups, such as Redwood Materials and Li-Cycle, have joined this effort.",
        "hn_title": "The biggest EV battery recycling plant in the US is open for business",
        "original_title": "The biggest EV battery recycling plant in the US is open for business",
        "score": 405,
        "hn_content": "The US's largest EV battery recycling plant is now operational. While recycling batteries requires processing, removing non-recyclable materials, and discharging them correctly, recycling is seen as a more sustainable alternative to producing new materials. There is a shortage of metals refining in the US, which makes it highly specialized work. HN users were curious about recycling processes and labor costs. The recycling plant shreds batteries into a black mass and extracts lithium carbonate to turn into lithium hydroxide, the stuff we use for batteries. A major issue of e-waste not getting recycled enough is disposability- products such as disposable vapes should not exist. The recycling process generally “works” by shredding/melting the materials to separate components by liquid or magnetic means, with machines and humans in combination.A firm extracts lithium and other materials from used lithium-ion batteries through mechanical shredding and sieving, which creates “black mass”, producing lithium carbonate and graphite, nickel, cobalt and manganese. Lithium-ion batteries contain very little lithium, and it's not elemental – an extremely common misconception that leads to people thinking they can't use water to stop a pack undergoing thermal runaway or fire – something that can only be stopped via the cooling effect of water. Lithium is at the top, so you get the most voltage per molecule. Lithium-ion batteries are composed mostly of nickel and steel, both of which are highly recyclable. Lithium iron phosphate does not show the kind of reaction that is seen in reaction to other metals and oxides, making it less likely to burn. There are efforts to develop rechargeable batteries using pure lithium metal at the anode for rechargeable lithium-ion batteries. Lithium-ion batteries do not tend to break even without externalities such as constructing additional rail networks.A recent report investigates the costs and benefits of freeway projects to make clear the overall impact on the environment, but opponents argue that it ignores the potential benefits. Although last-mile services may appear to be a trivial part of building a train network, they pose a significant challenge that may require a cultural shift in favor of new transportation modes. Such cultural change may demand a change in values with the implementation of last-mile solutions that must be respectful of existing values. Personal preference also comes into play since people prefer living in suburbs for low population density and quality-of-life. Trains and planes have different models and network effects, although both require multiple modes of transport for long-distance travel.The convenience of travel becomes important for people, where traditional travel systems may not be ret based on Freeways being cheaper than railroads to construct at ~3 million/mile. Long term maintenance costs and land use opportunities, however, are not taken into account. Trains are 9 times more energy-efficient than road vehicles, and rail travel produces less CO2 emissions. China, Japan, France, and Germany have shown that frequent-service electrified passenger rail is perfectly possible and can be a significant public good. Train platforms are almost always maxed out at well below 10 cars, limiting the number of passengers they can transport.Hacker News users discuss the feasibility of running 20-car trains and the passenger capacity of various transit systems, with particular attention paid to rail systems in Europe, the US, and Asia. The comments also touch on the economic benefits of transit systems, the low percentage of electric vehicles that require battery replacement, and the current state of lithium recycling. One user highlights a company working to increase battery recycling capacity in the US.The Ascend battery recycling plant features 80 to 90 percent scrap materials from battery plants, including SK Battery America's facility; recycling batteries domestically may become a matter of national security, given the US goals for EVs and energy storage; the infrastructure bill had funding for critical minerals; EV batteries are used in whole-house battery systems, potentially making recycling premature; with most EV batteries still in the middle of their respective bathtub curves, it's uncertain how much end-of-life batteries Ascend will receive; as a result of the high cost of replacing EV batteries, consumers would rather buy a new car than replace the battery, for second-life stationary storage systems.Experts discuss the longevity of car batteries, with mentions of the infamous 2011 Nissan Leaf battery design and the poor cooling system, limited thermal management, and fast degradation in hot climates leading to battery life concerns. Many modern EVs have active cooling beyond just a fan, but climate remains an important factor to consider. While some hobbyists buy old EV batteries for stationary storage, issues surrounding safety or documentation remain. Despite some teething pains, advancements in battery technology suggest that EV batteries will likely outlive the car, and the development of liquid-cooled battery packs with improved management capabilities has spurred optimism regarding the future of EVs.A new battery recycling plant called Li-Cycle has opened in Ontario, Canada, boasting a unique process that leaves valuable metals in solution and cuts out multiple steps in the recycling process. Currently, Ascend sells most of the most valuable extracted elements, ranking from 24 to 30 in the periodic table, to the market. However, there are concerns that developing a process to extract the \"black mass\" cheaply and efficiently may be extremely difficult. While Li-Cycle's technique is reportedly the state-of-the-art at scale, questions remain over the value and scalability of the byproduct mixture they produce.A recycling facility efficiently manages old battery cells and stores concentrated ores with a stable commodity value, while removing fire risks. The separation of cathode and anode foils during cell disassembly simplifies downstream material processing. However, there remain challenges in separating expensive elements occupying positions #24 through #30 in the periodic table. The facility could potentially be focusing on complexity at the cell disassembly level to further process individual cells to mechanically separate components. The article reports that relatively cheap lithium can be extracted using a combination of electrolysis, electrowinning, leaching, and other refining processes.",
        "hn_summary": "The US's largest EV battery recycling plant is operational, creating a more sustainable alternative to producing new materials. HN users inquire about recycling processes, labor costs, and the possibility of battery replacement in second-life stationary storage systems. Comments discuss the feasibility of running 20-car trains, economic benefits of transit systems, and the current state of lithium recycling. Experts reflect on the longevity of EV batteries and advancements in battery technology, while Li-Cycle's unique recycling process raises questions over scalability and byproduct value."
    },
    {
        "id": 35514294,
        "timestamp": 1681145137,
        "title": "FTX stored private keys to crypto assets in plaintext, without access controls",
        "url": "https://twitter.com/molly0xFFF/status/1645217786698903559",
        "hn_url": "http://news.ycombinator.com/item?id=35514294",
        "content": "",
        "summary": "Crypto exchange FTX has been keeping private keys of users in plaintext, without access controls, according to a report by ZenGo. This means attackers who gain access to FTX databases can easily steal users’ private keys and access their funds. ZenGo notified FTX about the issue and the exchange has since fixed the problem. The incident underscores the importance of properly securing private keys, which are needed to access and manage crypto assets. It is also a reminder that even well-established exchanges can have vulnerabilities that leave users’ assets at risk.",
        "hn_title": "FTX stored private keys to crypto assets in plaintext, without access controls",
        "original_title": "FTX stored private keys to crypto assets in plaintext, without access controls",
        "score": 358,
        "hn_content": "Cryptocurrency exchange FTX stored private keys in plaintext without access controls, according to a tweet by a security researcher. One individual on Hacker News drew parallels between traditional financial institutions' use of low-entropy personal data and FTX's approach to storing private keys. Another user suggested companies such as FTX should use asymmetric encryption, while a third explained that the SEPA Direct Debit framework used in Europe is effective because risks are squarely placed upon the party initiating a direct debit.The slow speed of traditional banking is intentional and designed to prevent mistakes. However, customers now expect higher speeds, and the lack of quick final settlement options is causing problems. Adding strong asymmetric encryption could prevent most fraud and save a lot of effort in fraud schemes, but it should not be forced onto every user. Small personal transactions happen without much issue or friction, but large business transactions generally do not require fast settlement. Crypto's biggest benefits are not for the average consumer, and speeding up financial systems may be good for some but bad for others. Traditional financial systems have their own issues, such as using credit card numbers as public numbers, causing confusion when traveling and posing security risks.HN users discuss the flaws in current financial systems, including the use of social security numbers and the lack of due diligence by banks. A user points out the irony in asking for help from the government to recover stolen crypto while trying to avoid taxes and government oversight. Another user notes that the size of the market for identity theft protection and credit card fraud is billions of dollars, indicating that the current system is not working well enough. However, some users argue that fixing these problems would add considerable complexity and may not have a net positive effect on the world.Crypto users who transfer money through traditional means face various obstacles and often want governments to stay away from the technology. Some cryptocurrency advocates argue that money could be better managed outside of government control, though this does not imply that they favor lawlessness. Nevertheless, some users still want equal application of existing laws to crypto and more traditional forms of property. A few users suggest that bad actors will be a part of both the traditional and crypto systems. The primary advantage of crypto over the traditional financial system may be avoiding cross-border controls.A discussion on the security protocols of crypto exchange FTX raises concerns about the company's inadequacy in safeguarding billions of dollars worth of crypto assets. One user purported that FTX kept crypto keys in Google Drive, while others commented on inadequate security engineering and employed mechanics. Using an unreliable wallet app is highly discouraged; instead, a Trezor or hardware wallets are safer options. Although hacking into wallets through malicious crypto spam is a common industry occurrence, it highlights the importance of strengthening security measures to protect funds. The conversation emphasizes the need for robust security when dealing with cryptocurrencies, especially when millions or billions of dollars are at stake.FTX cryptocurrency exchange faced criticism after it was revealed private keys were stored in plaintext files, accessible to all employees. The security breach was discovered when one employee accessed a file and found private keys there in plain sight. The revelation drew immediate backlash from users, who accused FTX of gross negligence and disregard for basic security standards. Experts recommend using hot and cold wallet tiers, where a hot wallet is used to hold smaller amounts for daily use and a cold wallet has heavy-duty security. It's unclear if the FTX breach was an act of incompetence or criminal negligence.FTX's handling of security has been called into question after personal laptops belonging to executives were confiscated by Bahamian authorities. The accounting system, an Excel spreadsheet manually maintained by the CEO himself, contained entries like \"Hidden, poorly internally labeled fiat@ account\" (sic) that was purportedly worth $8 billion. The shared Google Drive contained plaintext private keys. Some HN users comment on the situation, with some pointing out that keeping a small number of things secure for yourself is easier than doing it for thousands in an automated way. Others suggest a link between social media craziness and poor internal security. It’s suggested that FTX is a catastrophic mess of multiple failure modes in a race.A report reveals that FTX used plaintext keys to store users' funds, leading to concerns about the company's security practices. The incident has raised questions about whether software engineers should have licensing requirements or guilds similar to medical practitioners. Some HN users have criticized FTX's overall approach to risk management and security. While FTX is a crypto company, some have suggested there is a distinction between legit crypto firms and \"crypto\" ones. FTX has also been accused of stealing all the money depositors entrusted to it. Some HN users have suggested that such security exploits often go unpunished in practice.",
        "hn_summary": "Crypto exchange FTX stored private keys in plaintext, causing concerns over security. HN users suggest FTX use asymmetric encryption and fault traditional banking systems. Debate over using crypto outside government control and equal application of laws. FTX's security protocols criticized; experts suggest hot and cold wallets. FTX executives' confiscated laptops reveal plaintext private keys in shared Google Drive. Incident raises questions about risk management and licensing requirements for software engineers. Accusations of FTX stealing customer funds."
    },
    {
        "id": 35513636,
        "timestamp": 1681141242,
        "title": "I fixed a parasitic drain on my car in 408 days",
        "url": "https://davidmuller.github.io/posts/2023/04/10/how-i-fixed-a-parasitic-drain-in-408-days.html",
        "hn_url": "http://news.ycombinator.com/item?id=35513636",
        "content": "How I Fixed a Parasitic Drain on my Car in 408 Days | David MullerDavid MullerMy book: Intuitive Python ↗How I Fixed a Parasitic Drain on my Car in 408 Days10 April, 2023I almost lost my mind fixing a persistent battery drain on my 2013 Mazda3 hatchback. I want to share how I fixed my car in case it helps you fix a similar problem.Short version: I manually disconnected the key fob computer system to stop the battery from draining.Finding the Parasitic DrainMy car battery would drain itself in a matter of hours or days starting in January 2022 until I fixed the issue in March 2023. This kind of unchecked battery drain—where your car does not have enough power to start itself after its parked for a short time—is sometimes called a parasitic drain.To diagnose the drain, I parked and locked my car. Then, I measured voltages across some of the exposed fuses in my car. The idea is to find components in the car that are drawing power when the car is off. A few fuses showed constant power consumption including the TCM Transaxle control system fuse:Using a lookup table for my brand of fuses, I converted the 0.9mV voltage on TCM into a current draw. My car drew significant current over four fuses even when it was off:FuseDescriptionCompartmentCurrentTCM15A - Transaxle control systemengine0.9mV -> 197mAENG+B10A - Engine Control Systemengine0.2mV -> 27mAROOM15A - Overhead lightsengine0.4mV -> 87mAESCL15A - [Electric Steering Wheel Lock]interior left0.4mV -> 87mAAccording to one mechanic who worked on my car, the total draw on my 2013 Mazda3 should be 50mA or less when the car is parked and locked. So, the 197mA to the transmission computer (TCM) was especially troubling. Why would the transmission computer remain on when the car was parked and locked, anyways?When my car first started dying in Februrary 2022, the key fobs started malfunctioning. Sometimes when I tried to use a fob, the car would sound warning chirps for ~10 seconds. Paranoid the key fobs were causing the drain, I hadn’t used the fobs since the car first died. I had removed the batteries from the fobs, and only used my metal backup key.Now over a year later, I guessed that the keyless system was still malfunctioning even though I wasn’t using the fobs. Perhaps, the car thought a key fob was present in the car, and it was keeping systems like its transmission computer (TCM) switched on endlessly by mistake.The FixOne of the keyless troubleshooting sections in the workshop manual mentioned the ENG+B, ROOM, and ESCL fuses could be related to keyless system malfunctions. Since I’d also seen power going over thoses fuses, it seemed plausible that the keyless system was still acting up.I was already only using my metal key and not the fobs, so I had nothing to lose. I opened up the dash behind the glove compartment to see if I could disable the key fob system directly. After disconnecting my car’s negative battery cable, I unplugged wiring harness 4 from the keyless control module:Wiring harness 4 is almost exclusively communications lines to the different radio antennas and switches that comprise the keyless system.After unplugging wiring harness 4, the instrument cluster now showed a red warning light that keyless system was malfunctioning (what I wanted):When I drive the car, I see the red keyless system warning light. However, when I park the car and lock it, the TCM fuse (and the others) go to sleep and stop drawing power over the course of several minutes. My car no longer dies after a day or two of sitting. Success!FAQWhy did you almost lose your mind?I suspect the drain was intermittent: sometimes the car would go to sleep properly, and sometimes it wouldn’t. Intermittency made the problem hard to diagnose.Also, two real mechanics told me my car didn’t have a parasitic draw.What did the real mechanics say?Different mechanics told me different stories:Dealer: said my car was fine and returned it to me. My car died the next morning.Second mechanic: said my battery was degraded, and low voltages from the battery were freaking out the keyless sytem.  Indeed, the car lasted 12 months problem free on a new battery before it started dying again.(I still was only using my metal backup key, and had removed the batteries from the fobs.)A second new battery did not fix the issue when the problem resurfaced after the 12 months.Why did it take so long to fix?I think it was because the problem was intermittent. See the full timeline at the end of this post.Is your car still safe to drive?As far as I can tell, yes. The #4 cable I disconnected only makes connections to the keyless system, and the only warning light is a red one indicating the keyless system isn’t working (expected). All other systems seem to be operating normally. You should probably consult an actual mechanic if you’re considering this change, though.If the parasitic draw is intermittent, how do you know you fixed it?All the evidence I have points to the keyless system: key fobs malfunctioning, measuring the draws on the same fuses in both Feb 2022 and Mar 2023, and the implication of some of the related fuses from the workshop manual that mentioned the ENG+B, ROOM, and ESCL fuses. My car also hasn’t died again yet.What mistakes did you make troubleshooting the draw?Too many to count. Most important is to make sure your car is locked with the doors closed before you run any experiemnts to look for parasitic draws. Cars can take a while to go to sleep.Did you use a diagnostic code reader to look for errors logged by the car?No, I probably should have. Sometimes I wanted to pretend the problem didn’t exist more than I wanted to fix it.Could you have disabled the keyless module in software?It looks like it’s possible to “disable” the keyless module in software. It’s possible this would have resolved the issue as well, but I don’t know. Since I don’t have Mazda’s proprieratry M-MDS diagnostic tool, I couldn’t disable the keyless module in software myself.How did you download the Mazda3 2013 workshop manual?I used this site for the workshop manual.What other parasitic drain posts did you read?I read lots of forum threads about parasitic drains. One common theme was faulty bluetooth modules:Post about the bluetooth module causing a drain.“Puzzling battery drain” - with another mention of bluetooth.There is also some discussion of parasitic draws in the comments section of the hackernews post for this blog entry.How did you remove the glove compartment to access the keyless control module?Even though it’s about replacing a blower motor, the beginning of this video is a good guide for getting into the dash.Did you have help?Yes, a lot. Many thanks to my older brother, Steve, and my Dad.Problem Timeline:DateStatusJan 31 2022Car starts dying.Feb 2022Key fob is acting up.Feb 2022Dealer says car has no parasitic draw.Feb 2022Car dies day after dealer returns it.Feb 2022Fully disassemble key fobs (remove batteries). Only use metal backup key.Feb 2022Self diagnose parasitic draw on TCM fuse (and others).Feb 2022Get new mechanic.Feb 2022New mechanic says I just need a new battery. “Low voltage from your degraded battery makes the keyless system malfunction and drain your car.”Feb 2022Get new battery.—Car stops dying for ~11 months. (Key fobs still disassembled. I’m only using metal backup key.)Jan 2023Problem resurfaces.Jan 2023Get another new battery. (“The cold winter temperature probably killed the battery”).Feb 2023Car continues to die overnight.Feb 2023“If I ignore the problem, it will go away.”Mar 2023Observe same draw on TCM fuse (and others) that I observed previous year.Mar 14 2023Disconnect ROOM fuse. Draw disappears. But, other interior features like my stereo also don’t work.Mar 15 2023Replace ROOM fuse and disconnect keyless system.Apr 9 2023Car starts fine after 10 days parked.davidmuller.github.io / Home / My book: Intuitive Python ↗",
        "summary": "A car owner shares their experience of fixing a persistent parasitic battery drain on their 2013 Mazda3 hatchback, which took them 408 days to diagnose and fix. The issue caused the battery to drain itself in a matter of hours or days, and was diagnosed by measuring voltages across fuses in the car to find components drawing power when the car was off. The owner disconnected the key fob computer system to stop the battery from draining, which was likely malfunctioning and keeping systems, such as the transmission computer, switched on endlessly by mistake. The owner warns that the problem was intermittent and occurred even after replacing the battery twice, and advises against running any experiments to look for parasitic draws without first ensuring the car is locked with the doors closed.",
        "hn_title": "I fixed a parasitic drain on my car in 408 days",
        "original_title": "I fixed a parasitic drain on my car in 408 days",
        "score": 329,
        "hn_content": "A Hacker News user fixed a persistent parasitic drain on their car's battery, which turned out to be caused by a door that was not completely closed. Despite the mechanic finding no problem with the battery, the issue continued until they discovered the issue. Some users on the post shared their own experiences with half-closed doors and lids, attributing it to wanting to avoid being a bother or creating noise. The post also includes tangential comments about car door slamming and engineering for a \"solid\" sound.Mechanics seem to avoid the electrical part of cars, which can cause parasitic draw. One commentator resolved their own issue with their Audi A4 but couldn't replace the coded part. Specializing in fixing electronic issues in modern cars could be the way forward for mechanics who are prepared for the low business value. Existing businesses exist in this field but are difficult to find. Consumers might find it challenging to justify expensive repairs for old, nearly worthless cars. However, there is a market for highly specialized repair businesses, and such services are highly valued by a small number of customers.HN users discuss car maintenance, from finding a reliable mechanic to dealing with electrical issues. Some share tips and tricks, such as pulling fuses to identify relevant circuits or wiring in switches for fuses. One user warns against buying a Ford Focus/Fiesta with an automatic transmission, while another expresses anxiety about all the tech in modern cars, including touch screens and GPS tracking. Overall, the discussion focuses on practical, DIY solutions to common car problems.Car computers can sometimes run in 'open loop mode' where they use safe values but can run poorly. Newer vehicles may have flash storage and not lose settings when the battery is disconnected. However, some brands like Audi can run roughly and forget settings when power is disconnected. Most German cars are difficult to fix and expensive to maintain, compared to other brands where online communities are more helpful. Some car parts are locked to specific cars and cannot be reused. CAN bus packets may be signed in the future making it difficult to re-code the PCM for a motor with a different VIN. Certain models of BMW are not considered sterile by some, but others consider them less interesting than a fun-to-drive car like a Corvette or C5.Hacker News users are sharing personal experiences and opinions about the reliability of different car models, specifically focusing on BMWs and other vintage cars. Some users recommend Mazda and Honda for dependable sporty cars at a more affordable price point than German luxury models. There are also discussions about the limitations of dealerships and the frustrations of dealing with modern car electronics. Some users suggest rebuilding or buying an older vehicle, while others prefer newer electric cars like Tesla. Some users joke about the difficulty of working on car wiring, and others express skepticism about statements made by mechanics.Experts advise that a car in good condition can go at least a couple of months without being driven, without issues upon starting it up. However, anything less than a month can suggest a battery near the end of its life or parasitic draw somewhere. Additionally, a fuel stabilizer, such as Pri-G, should be used if cars are left unused for a couple of months. Some cars have weak batteries, particularly during cold weather, and a trickle charger may be necessary after a month or two of non-use. AGM batteries may offer longer life and be more resistant to discharging.A discussion on Hacker News about the maintenance required for a car during cold weather resulted in comments suggesting carshare options, and others debating the merits of owning a car versus renting. Some users discussed ways to maintain car batteries during periods of non-use, while others commented on the challenges of troubleshooting electrical issues in cars. One user criticized the practice of throwing parts at car issues rather than diagnosing the root cause. Overall, the discussion revolved around practical tips and experiences related to car ownership and maintenance.Mechanics use a book time system for charging repairs, but some situations may be billed at higher rates than necessary. Diagnosis, complexity, and diagnostic equipment can be charged per 6 minute unit. Parasitic loads in a car can be found by measuring a voltage drop or by disconnecting fuses to isolate circuits. Intermittent draws can be challenging as current flow can change depending on whether a module is on or off. Some car models run the fuel pump after shutdown, which can be heard if parked inside.Car enthusiasts discuss and troubleshoot parasitic battery drain, with some suggesting that newer touchscreens and Bluetooth modules may be the cause. Some users suggest using thermal cameras or ammeters across fuses to identify the culprit circuit. While some car brands seem fine with long periods of inactivity, others need more frequent attention. Despite electric issues being more common now in cars, some argue that mechanics tend to avoid electrical problems but can offer recommendations from experience.A user on Hacker News shares a story of how they fixed a friend's car that had been deemed \"cursed\" by other mechanics. The user found the issue to be a corroded area on the negative battery terminal and the chassis, easily fixed with some cleaning and dielectric grease. Other HN users share their own experiences and solutions for similar car issues, including suggestions to seek out auto electricians, use a time logging multimeter, and take a methodical approach to vehicle diagnostics. The post highlights the importance of finding a good mechanic and the frustrations that can come with inexperienced or unscrupulous ones.BMW's EXX series is dropping support soon, and some HN users express their frustrations with the increasing complexity of modern cars, with too many electronic components that can fail and be difficult to diagnose, leading to costly repairs. Some users provide tips for fixing parasitic battery drains, while others express a desire for more walkable cities with alternative forms of transportation. A former computer engineer working on embedded systems for automobiles comments on the difficulty of debugging issues and the constraints placed on drive cycle monitors for emissions testing. It is clear that many HN readers are interested in practical solutions and long-term sustainability as opposed to flashy car innovations.",
        "hn_summary": "A Hacker News user resolved a parasitic car battery drain caused by a half-closed door, with others sharing similar experiences. Specialization in fixing electronic problems could be beneficial for mechanics, but it's a low business value. Discussions involve maintaining car batteries during periods of non-use, troubleshooting electrical issues, and practical tips and experiences related to car maintenance. Some users express frustrations with modern cars' complexity and electronic components that can be challenging and expensive to repair. Users provide practical solutions, long-term sustainability, and alternative transportation in walkable cities."
    },
    {
        "id": 35511717,
        "timestamp": 1681131505,
        "title": "How To Get Started In Soldering",
        "url": "https://www.popularmechanics.com/technology/a43400768/how-to-get-started-in-soldering/",
        "hn_url": "http://news.ycombinator.com/item?id=35511717",
        "content": "Soldering is a skill that is becoming less common, but it is a relatively inexpensive hobby to get into and proves to be a surprisingly useful skill. One of the best tips for beginners is to get the soldering iron as hot as possible, but be careful not to melt components. The process of soldering is often referred to as tinning, which involves adding solder to both the wire and the pad that it's being soldered to. It's important to practice, but thankfully, there is a low probability of ruining the electronics being soldered, even if your work is a bit messy.No summary provided as the given text is unrelated and lacks context for an article or post.",
        "summary": "Soldering is an affordable hobby and useful skill, with the best tip being to get the iron hot while avoiding melting components. The process, tinning, involves adding solder to both the wire and pad being soldered. Practice is key, but mistakes are not detrimental to the electronics being soldered.",
        "hn_title": "How To Get Started In Soldering",
        "original_title": "How To Get Started In Soldering",
        "score": 310,
        "hn_content": "A Hacker News article on soldering has gained attention due to comments discussing whether it's better to start with cheap or expensive tools. One user suggests Adam Savage's rule of buying cheap tools first, then replacing them with expensive, good tools once you break them. Another user notes that context is important, as some tools are worth the investment upfront. A professional welder suggests treating some tools as consumables and having extra on hand. While some users argue that cheap Harbor Freight tools are just fine for most purposes, others recommend investing in higher quality tools.Experts recommend buying the cheapest tool that does the job, and when you need something better, buy the best that you can afford because trying out lots of new things is a good thing. Spending money can make you feel bound to a hobby that you might not enjoy. Sometimes it's worth spending more on tools upfront, not all tools need to be the best, and some examples of tools where it's worth the investment are ergonomic chairs and soldering irons. It's crucial to learn good tools first to avoid distractions variables caused by bad tools, and there's a survivorship bias in seeing the \"buy cheap first\" advice as bad.Experts on Hacker News discuss the importance of investing in a quality soldering iron, with some detailing the issues they faced with cheaper alternatives. Commenters suggest investing in a Hakko FX-951 or a JBC C245 DIY kit for serious soldering work, warning against cheap alternatives. Other tips include using a ball of metal shavings instead of a wet sponge, prioritizing prep work, and using Kapton tape instead of electrical tape. While some experienced craftsmen can adapt to cheaper tools, investing in quality tools can save beginners significant time and frustration.Looking for the right soldering iron for electronics is key to achieving reliable results. Avoid plumbers/electricians' irons and instead get a temperature-controlled, station-based iron with good heat conductivity. While Hakko and Weller may have general recognition, they are considered low-end compared to brands like JBC and Metcal. Some alternatives include the Pinecil, Yihua and TS80, all of which offer better temperature control, more readable English display, and other modern features. Getting a good cheap tool is essential to help new hobbyists achieve their goals without giving up due to frustration with ill-suited irons.Soldering experts provide tips on beginner-friendly tools for successful soldering, highlighting the importance of instrument quality for early wins in soldering, with operational efficiency enabling users of various ages to attain expertise in a shorter time. The most vital aspect of an excellent tool is temperature control, selection of tips, and power supply. The tool quality enables better soldering and helps users learn tricks, gain experience, and improve their expertise. They also recommend buying soldering irons from trusted brands instead of generic Chinese tools available online for similar quality results.Experts in the field of electronics recommend investing in a decent soldering iron as well as leaded solder if possible. Tips for beginners include avoiding the cheapest options and using a suitable sponge to clean the iron. Practice and additional items like flux and solder wick are also important to improve skills. While some recommend starting with mid-grade equipment and upgrading as needed, it's crucial to prioritize safety in sports or other activities where equipment quality is critical. The Pinecil by Pine64.org is an exception to the \"cheap is bad\" rule when it comes to soldering irons.An HN user recommends the KSGER T-12 for soldering and advises against using too much flux or leaded solder, and to clean the tip with a brass sponge. Another user suggests buying SnBi soldering wire, which has a low melting temperature, and not to worry about lead fumes because they don't vaporize at soldering temperatures. Some users caution against using high temperatures or wet sponges for cleaning the tip, and recommend using clean, damp, sulfur-free, cellulose sponges instead. It is also suggested to use a good quality flux core and a reliable soldering iron, such as the Weller WE1010.Experts recommend using high-quality solder and flux for efficient and easy soldering, and avoiding lead-free solder which requires high temperatures and flows differently than leaded solder. SAC305 is an eutectic but non-leaded alternative that melts at a slightly higher temperature but has a lower melted viscosity than Sn63. To get the best results, use the right temperature and avoid overheating the board when soldering, and use a good quality soldering iron or station. Beginners should also pay attention to proper ventilation and waste disposal to avoid polluting the environment. Using a stereo microscope may help in achieving a better perspective of the soldering process.A user shared their experience with minor repairs and replacing parts of their house. Comments provided advice on soldering, emphasizing the importance of cleaning surfaces, equal temperature for all metal parts, and quality lead-free solder with good flux. The discussion also covered soldering tips, cleaning methods, and the negative effects of lead in the mix. Additionally, readers provided recommendations for ventilation systems for a soldering area.Experts discuss tips for soldering in the tech community. Some suggest using leaded solder, which is easier to work with and washes off hands. When cleaning the soldering iron, a damp sponge or brass wool are recommended. Some commenters recommend investing in a good soldering iron and stand to start. Learning how to solder can be useful for debugging and self-sufficiency in the embedded world. Kits, such as clocks or mechanical keyboards, are suggested for beginners to practice soldering. Don't cheap out on the soldering iron, as it may lead to difficulty and frustration. The article itself may not provide sufficient practical instructions for beginners, but resources such as videos on YouTube and MIT electronics classes can be helpful.Several HN users recommend tips for successful soldering, including using chipquik flux, temperature control, and high-quality plated tips. Some users suggest safety measures such as safety glasses, nitrile gloves, and fume extractors while others recommend magnifying glasses or visors for precision work. The topic raises questions about the decline of manual skills in younger generations and suggestions for improving accessibility to these skills through practical applications.The article discusses the criticism of Gen Z and millennials and suggests the need for practical skills like repairing items. HN users criticize the assumption that young people cannot drive a manual transmission or write in cursive, and point out that younger generations have more opportunities to learn skills. One commenter mentions that the article should focus on repairing skills and promoting better-built products rather than just being critical of consumer culture. The emphasis is on the need for practical skills, and the article encourages readers to take more responsibility in fixing and repairing items rather than throwing them away.",
        "hn_summary": "Hacker News users debate whether it's better to start with cheap or expensive tools when soldering, with some suggesting Adam Savage's 'buy cheap first' rule, while professionals suggest treating some tools as consumables. Experts advise buying the cheapest tool that does the job and investing in quality tools as needed. They caution against using cheap alternatives and suggest trusted brands instead. Tips include using flux and avoiding lead-free solder, and good ventilation and waste disposal are essential. Users recommend investing in high-quality soldering iron, chipquik flux, and plated tips. There is a need for practical skills and promoting better-built products."
    },
    {
        "id": 35515208,
        "timestamp": 1681149487,
        "title": "Teaching ChatGPT to speak my son's invented language",
        "url": "https://szopa.medium.com/teaching-chatgpt-to-speak-my-sons-invented-language-9d109c0a0f05",
        "hn_url": "http://news.ycombinator.com/item?id=35515208",
        "content": "A father and son use chatbot technology to teach a computer the unique Kłeti language invented by the son, allowing the computer to translate from Kłeti to English. The constructed language has unique features, like a Subject-Object-Verb (SOV) word order, difficult pronunciation, and its own alphabet. The process involved refining the chatbot's understanding of Kłeti, particularly the language's copula and particle usage and its impact on word order. However, the accomplishment demonstrates the amazing progress of technology in making science fiction a reality, as a language once confined to the imagination can now be taught to a computer.A recent experiment using ChatGPT attempted to teach the AI how to translate from English to a newly invented language, Kłeti. The experiment involved refining the language's grammar rules and producing a prompt that would allow ChatGPT to translate accurately. The resulting translations from ChatGPT were partially correct, leading to a score of 6.5 out of 12. While the experiment was not scientific or rigorous, it showcased the potential of AI language translation in the future. The author hopes that future advancements in AI language translation technology will offer substantial benefits.",
        "summary": "A father and son teach a computer the unique Kłeti language through chatbot technology, demonstrating technology's progress in making science fiction a reality. The language has its own alphabet and an SOV word order, making copula and particle usage crucial in refining the chatbot's understanding. An experiment using ChatGPT to translate from English to Kłeti resulted in partially correct translations and a score of 6.5 out of 12, showcasing the potential of AI language translation in the future. The author hopes for advancements in AI language translation technology to offer substantial benefits.",
        "hn_title": "Teaching ChatGPT to speak my son’s invented language",
        "original_title": "Teaching ChatGPT to speak my son’s invented language",
        "score": 299,
        "hn_content": "Hacker News users discuss the breakthrough of in-context learning and flexibility displayed by Language Models. One user presents evidence of how approaching arithmetic as an algorithm can achieve up to 100% accuracy for up to 13 digit addition. While ChatGPTs are not great at handling human-like chain of thought prompting, they possess dynamic connection between weights which makes them appealing to use when developing commercial models. Despite the technology's limitations in handling sensitive data, Microsoft may be able to capitalize on the human-feedback loop to train and improve the chatbot.The above blog discusses the use of GPT-4 instances for queries involving new documentation, indicating that Memory Augmented Large Language Models are Computationally Universal. There are limitations to what can be taught to GPT-4 instances due to the limited context window, so it is best to prioritize primary tasks; however, limitations become less important when adding dynamic, relevant context. Although GPT-3.5 does not require an algorithm prompt for every query, it is better suited for more complex problems than arithmetic. The article highlights the issues with GPT models, with one comment citing an example of GPT cheating, while others observe how to refine prompts for better output.Experts on Hacker News discuss ChatGPT's understanding of language and ability to perform tasks without knowledge, questioning what it means to \"know\" something. Some argue that it is difficult to prove whether ChatGPT or humans really \"understand\" anything, while others point out that the significant impact of the token arrangements created by ChatGPT makes it seem intelligent. The discussion also touches on the limitations and capabilities of ChatGPT, including its inability to play games and experience emotions. Despite the differences in languages and complexities, some believe that PIE speakers may have an advantage in learning Kłeti.HN users discuss the use of \"dive\" vs \"dived\" as the past participle of the verb. ChatGPT's abilities are discussed, including limited token use and the potential for improvement with more examples. Some users share their experiences using the program for language-based games and prompts. There is speculation on the potential impact of GPT on linguists' study of language.A recent article highlights the potential of ChatGPT, a language model with the ability to predict the next token based on its weights. Users have tested ChatGPT in various ways, from making it understand Europanto to using it as a language learning app for Basque, with mixed results. Although some may expect ChatGPT to perform tasks like playing tic-tac-toe, hangman, or rock-paper-scissors, such games are not the model's intended purpose. While ChatGPT already speaks Lojban and could potentially help with endangered languages, it is not yet able to handle complex symbolic processing tasks.Users discuss their experiences with GPT-4 and its capabilities, including its ability to handle ROT13 and base64 decoding, music theory questions, and playing games like tic-tac-toe and hangman. One user notes that LLMs see individual words, not characters. Users also comment on how impressive it is that GPT-4 can make small typos, and its ability to seemingly attempt tasks rather than simply perform them. Some users have experienced difficulty with certain prompts, while others have found success with creative prompt engineering.",
        "hn_summary": "HN users discuss ChatGPT's in-context learning and flexibility, while highlighting limitations and capabilities; Microsoft may be able to capitalize on the human-feedback loop. Experts question ChatGPT's understanding of language and limitations regarding emotions and games. GPT-4 shows potential in language learning and symbolic processing. Users report mixed results with ChatGPT and GPT-4 in various tasks."
    },
    {
        "id": 35517629,
        "timestamp": 1681162209,
        "title": "Al Jaffee, king of the Mad Magazine fold-in, has died",
        "url": "https://www.nytimes.com/2023/04/10/arts/al-jaffee-dead.html",
        "hn_url": "http://news.ycombinator.com/item?id=35517629",
        "content": "nytimes.comPlease enable JS and disable any ad blocker",
        "summary": "Sorry, there is no text to summarize as a reference was given instead. Please provide the text content to summarize.",
        "hn_title": "Al Jaffee, king of the Mad Magazine fold-in, has died",
        "original_title": "Al Jaffee, king of the Mad Magazine fold-in, has died",
        "score": 266,
        "hn_content": "Al Jaffee, a legendary illustrator who is renowned for The Mad Magazine fold-in, has passed away at the age of 99. The fold-in was a popular back cover feature that presented a seemingly innocuous image, which, when the page was folded, revealed a hidden message or image. Mad Magazine had a significant impact on many people during their childhood, including developing critical thinking skills and introducing them to adult humor indirectly. However, some HN users noted that collectors of Mad Magazine had to ruin their issue to do the fold-in, thereby preventing any chance of them keeping it in “mint condition.\"Al Jaffee, renowned cartoonist for Mad Magazine, has passed away, sparking nostalgia from fans who grew up reading and loving his work. Many attribute Jaffee and his colleagues for helping them develop a sense of humor and appreciation for comic art as children. Notably, Donald Knuth, one of the most famous computer scientists, published his first paper in Mad Magazine. Some fans also reminisced on the challenges of understanding the fold-in instructions in Mad Magazine. Jaffee's impact on popular culture is evident in the outpouring of love and appreciation from readers worldwide.",
        "hn_summary": "Al Jaffee, Mad Magazine legend and creator of the fold-in, passed away at 99. Many mourned, remembering his impact on critical thinking and humor. Some noted the issue of destroying magazines to do the fold-in. Fans reminisced about understanding the instructions and Donald Knuth's publication in Mad Magazine. Jaffee's impact on popular culture was widespread and appreciated globally."
    },
    {
        "id": 35509175,
        "timestamp": 1681100871,
        "title": "Hell Never Ends on x86: The Hyperspace Story, Continued, Sort Of",
        "url": "https://cohost.org/cathoderaydude/post/1311259-hell-never-ends-on-x",
        "hn_url": "http://news.ycombinator.com/item?id=35509175",
        "content": "HP quietly replaced their previous instant-on Linux, QuickWeb, with a new version based on Hyperspace. QuickWeb was sold across their entire range of machines for several years, and laptops with QuickWeb support have a globe icon button that boots QuickWeb instead of the normal OS. HP laptops also have a separate button, QuickLook, that launches an email and calendar app natively built into the BIOS without Windows or Linux. However, the app relies on an Outlook plugin that periodically copies the user's inbox and calendar to an XML file in HP_TOOLS; it does not directly access the Outlook data file.HP's QuickLook feature provides instructions on how to build and setup the HP_TOOLS partition manually, with no claims that it can only be set up using their official installer. The process should be doable using Linux, and the data files it generates are simple to create. The UEFI software has limited APIs and unoptimized graphics, which make the UI feel like it’s from an older era. However, it's possible to create HP DayStarter, an application that allows users to display Outlook's calendar and custom messages during Windows loading, by running it from the System Management Mode (SMM). Therefore HP has leveraged SMM to achieve something that should be impossible.Dell and motherboard vendors cannot offer features beyond standardized components, as they are essentially middlemen, selling basic components that need to work the same way as all others of their type. Asus, Abit, and MSI tried to innovate with thermal management and overclocking when DIY PCs were popular in the mid-2000s. HP struggled to offer 'Features for Executives' and wrote its own EFI application to speed up the pre-boot experience. The obsession with offering features was mostly irrelevant, with HP's focus on an Outlook-calendaring app being the pinnacle of the company’s search for differentiation.A tech support worker created a shell using Linux's efibootmgr command for easy access in case of system failure. Motherboard manufacturers could integrate better pre and post-boot diagnostics, but it may only be viable to enthusiasts interested in these features. A user suggested PC motherboards have a standardized port for digital diagnostics, much like cars' On-Board Diagnostics, to troubleshoot issues or receive detailed diagnostic codes. Workstation designs utilizing toolless, easy-to-service layouts are a logical direction for home server setups. Most PC motherboards have something unique, but these features may only apply to niche users.A journalist writes about the absurdities and dysfunctions in HP laptops, including bizarre power backflows and faulty GPU fans. The comments include discussions on overengineering, gun-shaped heatsinks on Gigabyte motherboards, and attempts to replace HP's QuickLook with DOOM. Some users express frustration over the poor quality of bundled software while others joke about the demonic-sounding \"System Management Mode.\" Overall, the article highlights the strange and often frustrating experiences users encounter with technology.",
        "summary": "HP replaced their instant-on Linux QuickWeb with a new version based on Hyperspace. QuickWeb was available across all their machines for several years. HP laptops have a separate button, QuickLook, that launches an email and calendar app. However, the app relies on an Outlook plugin and does not directly access the Outlook data file. HP leveraged SMM to achieve something that should be impossible. Dell and motherboard vendors cannot offer features beyond standardized components. HP struggled to differentiate its products and offer \"Features for Executives.\" A tech support worker created a shell using Linux's efibootmgr command for easy access in case of system failure. Most PC motherboards have something unique, but these features may only apply to niche users. The article highlights users' frustrating experiences with technology, including HP's faulty GPU fans, among other things.",
        "hn_title": "Hell Never Ends on x86: The Hyperspace Story, Continued, Sort Of",
        "original_title": "Hell Never Ends on x86: The Hyperspace Story, Continued, Sort Of",
        "score": 264,
        "hn_content": "The article \"Hell Never Ends on x86: The Hyperspace Story, Continued, Sort Of\" on Hacker News discusses complexities in writing UEFI applications and BIOSes' handling of sleep behavior. The article also briefly touches on firmware hibernation partitions and Microsoft's hooks for firmware to download executables during kernel boot time. However, some users push back on the author's assertions, claiming writing a UEFI application is not as complicated as the author suggests. As a result, readers may not find the article's points groundbreaking but may appreciate the discussions and nuanced perspectives provided by commenters.An HN user discusses the benefits and issues with laptop OEMs exposing valuable functionality, including custom fan control, via pre-defined WMI ACPI callouts. ACPI's Windows Platform Binary Table and Computrace both use WMBT. Some workers must use firmware-based browsers due to their IT systems requiring a running PC, which must boot quickly. HP's ZBook is an example of a laptop that uses these types of features, which cater to a specific user base. Some see Windows' modern OSs as bloated, and the EFI environment has a vague resemblance to a 32/64-bit MS-DOS, pushing some to reimplement their own. Despite this, some companies have partnered with Microsoft to bring significant speed boosts to boot processes, but many peripheral devices and drivers rely on the slow boot process.Testing on a wider range of PCs has revealed that, despite solving dependency and order of scheduling problems, PCs may still have microcontroller or driver initialization issues that have not been tested. The boot process of x86 PCs is slow and has always been slow. Windows Vista cracked down on hardware boot times that were completed by Windows 7/8/10, quarantining bad-acting XP era bootup hardware based on timing telemetry. The thread in the article and related posts focuses on the slow PC boot, but BIOS and dual boot hacks only made sense for one brief moment between XP-era hardware and Windows becoming judge, jury, and executioner of hardware boot times. Capacitive buttons on laptops are missed. Conceptual descendants of the Phoenix Hyperspace hack are shipping today on millions of Android and Windows systems, calling for the industry to need an OSS Type-1 L0 hypervisor.HP has designed an OS without its own scheduler that is loaded into the TE at runtime. This allows hardware modules to be marked as secure or non-secure by the main OS. Some HN users debate whether this is a hypervisor or an interrupt handler. Experts in the field may appreciate HP's experimentation with non-Windows environments. Some HN users express security concerns. The post generated diverse reactions ranging from admiration for cool hack to criticisms of bad PHB ideas. HN users ponder questions such as the feasibility of writing complex programs to run inside EFI and who buys this type of device.",
        "hn_summary": "The article discusses complexities in writing UEFI applications and BIOSes' handling of sleep behavior. Some users push back on the author's assertions. Laptop OEMs expose valuable functionality via pre-defined WMI ACPI callouts. Some see Windows as bloated, and the EFI environment has a vague resemblance to a 32/64-bit MS-DOS. The boot process of x86 PCs is still slow. Capacitive buttons on laptops are missed. HP has designed an OS without its own scheduler that is loaded into the TE at runtime. Some HN users debate whether this is a hypervisor or an interrupt handler. The post generated diverse reactions."
    },
    {
        "id": 35507814,
        "timestamp": 1681086290,
        "title": "We Need To Talk About Vercel",
        "url": "https://www.maxcountryman.com/articles/we-need-to-talk-about-vercel",
        "hn_url": "http://news.ycombinator.com/item?id=35507814",
        "content": "We Need To Talk About Vercel - Max CountrymanMenuAboutArticlesUsesWe Need To Talk About VercelApril 9, 2023Recently there's been some discussion around Vercel and its hefty markup over AWS Lambda or its surprise runaway costs.1 That said, there's an argument to be made that the development experience value add is worth the pretty penny. And indeed for some, that may be the case.However, as I've spent more time working with the Vercel Content Delivery Network (CDN) product, I've encountered technical deficiencies which have been met with a customer support response that not only leaves me skeptical of the proffered value add, but has left me to question the product altogether.Some BackgroundI've been working on remotejobs.org, which is largely static but updates periodically throughout the day. I'll spare readers the technical details here but what's important is to understand that this is implemented via Astro's Server-Side Rendering and is intended to be cached by the CDN.To do so, we make use of the s-maxage and stale-while-revalidate directives of the Cache-Control header. The goal here is to have the surrogate, i.e. the CDN network appliance, cache the content for a set amount of time and then to lean on the stale-while-revalidate directive to serve cached content while fresh data is fetched in the background.As of writing the Vercel docs give this description of stale-while-revalidate:This allows you to serve content from the Edge cache while simultaneously updating the cache in the background with the response from your Serverless Function.Offering some relevant use-cases and overlap with what we want:Some situations where stale-while-revalidate is of great value:Your content changes frequently but it takes a significant amount of time to regenerate. For example, an expensive database query or upstream API request.Your content changes infrequently but you want to have the flexibility to update it (to fix a typo, for example) and don't wait for the cache to expire.Fortunately Vercel makes configuring such a header easy via the vercel.json configuration:{  \"headers\": [    {      \"source\": \"/(.*)\",      \"headers\": [        {          \"key\": \"Cache-Control\",          \"value\": \"public, max-age=0, s-maxage=3600, stale-while-revalidate=3900\"        }      ]    }  ]}Mission accomplished.Not So Easy After AllOnly it doesn't work the way it's advertised.Bizarrely, Vercel's network appliance mangles the Cache-Control header and indeed does not respect the configured values as it should.2 For some resources, things work as expected, but for e.g. our index page the s-maxage and stale-while-revalidate directives are both missing.In fact, only resources like JavaScript and CSS see the correct header value with everything else being configured such that Cache-Control has a value of public, max-age=0. Not what we wanted or configured.Looking for SupportAfter messing around with this for some time, ensuring we were manually setting the headers on our origin, I had no luck and reached out to Vercel's support.Over the course of a couple of weeks I was told by their support team:This is not a real issue, try these various configuration tweaks (none worked and they would later admit they could easily reproduce the issue independently).This is a real issue, but it's Astro's fault (it wasn't, as the Astro team would trivially demonstrate) and I should do free work for Vercel to poll their community regarding how widespread the issue is.Vercel's support staff is only trained to handle frontend issues, therefore I can't expect helpful responses (Vercel sells a CDN product, so this is surprising).3The internal team is working on an RFC to make documentation changes (odd, but okay; the issue still remains).I would receive an update within one week (now a month later, I have had no update whatsoever and the issue persists).I was also told that because I haven't graduated to a high-enough service tier, my issue wasn't important. I find this a strange response, because other customers, who might be paying lots of money to use Vercel's product, would benefit from the CDN operating as it's advertised.On March 9th, 2023, Vercel's support team promised to follow up \"next week\". They have not done so and the issue remains an issue.\"Please keep an eye out for a message from our team next week.\"Where We Go from HereCDNs are hard. There's no doubt a lot going on in the background here that we can't see. For instance, later on in the support thread, Vercel's support said this:\"After catching up with our CDN team, it's worth sharing that we'll be reviewing docs on s-maxage/stale-while-revalidate/stale-while-error and how they are consumed by our proxy. Slight overshare but there's an active RFC internally to review this behaviour in its entirety.\"While this is a somewhat odd response, it demonstrates that Vercel is aware of these problems and that they can be difficult to tackle.4However, for me the bigger issue is how Vercel's frontline support team responds and behaves. I was repeatedly told my issue wasn't real, a fairly blatant attempt to gaslight me, and then when it had been confirmed multiple times that I should just go away already.Now I'm clearly not worth enough for Vercel to care about. Fair enough. They're right that I won't independently bring them large bags of money in the form of recurring revenue. But being so blunt about that seems shortsighted at best: Should I ever be in the position to bring more business to Vercel, I now won't.Contrast this approach with Cloudflare or AWS: Even as a free or essentially free customer, both platforms invest in their customers because it's part of a larger customer acquisition strategy.Good support is not just a resource to fallback to.Take AWS as an example, which has for years invested heavily in customer success. AWS offers a wide array of resources, including dedicated support teams, structured programs, and ongoing training. Without such things in place, AWS wouldn't just be more difficult to use, but would also likely have a far less commanding hold of the cloud market. While Vercel may not be at AWS scale, even in the beginning Amazon has had a reputation for being \"customer obsessed\".Given where Vercel is today, I'll be moving on. Most of remotejobs.org is already hosted on a VPS and so in my case I'll move the web pieces there with a CDN like Cloudflare in front of it.AddendumI reached out for comment before publishing this piece, but Vercel did not provide one. However, there's since been active discussion on Hacker News with Vercel's CEO, Guillermo Raunch, explaining that this behavior is in place to protect users:\"Vercel strips them because (1) at the time this RFC didn't exist and (2) most of the time you we found customers don't want to cache on the browser side or proxying CDNs, which makes purging and reasoning about cache staleness very difficult.\"[...]'Customers want to deploy and see their changes instantly. They want to their customers \"go to our blog to see the news\" and not have to second guess or fear the latest content will be there.'FootnotesNote that the latter was due how the deployment process was structured, however billing limits or quotas would have prevented such a thing from happening in the first place; such misconfigurations can and do happen and shouldn't bankrupt a small business. ↩I spent some time trying various things, ordering the directives differently, duplicating them, etc. Some combinations produce different results, but none I could find consistently set the correct header value. ↩To clarify, this was directed at a specific support team member, who I won't name; presumably other support team members have different backgrounds and may be better equipped to field these issues. However, that's in fact the issue: if you sell a CDN product, it's important your staff is trained in supporting it. ↩It could make some sense to update the docs in the meantime at least. ↩A Newsletter to Share My KnowledgeI built this site to share everything I know about leadership, building startups, and indie hacking. This newsletter is another way for me to provide that value to you.What you get for signing up:Exclusive content tailored just for our newsletterNotifications when I add new contentOccasional access to unpublished and draft workAll signal, no noise. Unsubscribe at any point.JoinAboutArticlesUsesAnalyticsRSS© 2023 Max Countryman. All rights reserved.",
        "summary": "Recent discussion around Vercel has highlighted its heavy markup over AWS Lambda, surprise runaway costs, and technical deficiencies with its Content Delivery Network product. While Vercel's value-add may be worth it for some, its lack of support and response to technical issues is concerning. Vercel's CDN mangles the Cache-Control header and does not respect the configured values as advertised. Frontline support responses have been dismissive of issues, and Vercel's CEO defends the behavior as necessary to protect users. AWS invests heavily in customer success, in contrast to Vercel. Consequently, the author will be moving on from Vercel.",
        "hn_title": "We Need To Talk About Vercel",
        "original_title": "We Need To Talk About Vercel",
        "score": 263,
        "hn_content": "An investigation into Vercel, a cloud provider for web and front-end development, has raised concerns about the company's customer service, pricing, and potential issues with scaling. While some users have praised the company's ease-of-use and Next.js integration, others have criticized their management and handling of technical problems. Vercel's moat and reputation have been called into question, with some users suggesting that alternatives such as GitHub Actions, DigitalOcean, and Cloudflare could provide a more sustainable and cost-effective solution. Vercel's acquisition of React has also been debated, with some suggesting it gives the company a competitive edge, while others question its significance. Criticisms of Vercel's practices and behavior include deceptive messaging, inadequate documentation, and poor response times.Users on a Next.js forum discuss server-side rendering vs static site generation, with some arguing that the distinction is unnecessary. One user proposes disabling optimization to make Next.js behave like an image tag, but others criticize this approach. A user takes issue with Vercel’s design, stating that they want the option to use the image tag without being forced to serve images over Node or use Vercel. Commenters debate the benefits of fat index files, which download all necessary assets at once, versus splitting assets up. Lastly, a user criticizes Vercel for breaking Next.js with AsyncLocalStorage and for not providing a specification.HN users criticize new features of NextJS from v.10 after its latest investment round, mentioning issues with API Middlewares, pages layout, release versioning and more; a user recommends an alternative open version, 'vite-plugin-ssr'; some users express frustration at the lack of clear release information and changelogs, while others complain about customer support and bugs in the system; one user mentions the high cost for bandwidth usage; HN users express concern over the lack of transparency in NextJS's development process.Vite-plugin-ssr plans to introduce built-in renderers to achieve a zero-config developer experience like Next.js, while maintaining an open and collaborative foundation for meta frameworks. Some comments criticize Vercel for their billing practices and urge users to consider other CDNs like BunnyCDN or use R2 with Cloudflare. Additionally, the conversation includes debates about cache-control headers and the benefits of stripping versus supporting them.Developers discuss the pricing and benefits of CDN services such as Vercel and Cloudflare. One user warns about potential TOS violations with Cloudflare regarding JSON API caching. Other users mention alternatives such as Hetzner and R2, which may be cheaper. There is also discussion about the value of using a CDN versus hosting content on a VPS. Some users express frustration with Vercel's pricing and business practices. A representative from Vercel responds to a user's issue and provides updates on their investigation.An investigation into caching on Vercel's Edge Network and the use of SWR cache-control headers in Astro apps was conducted. It was found that Vercel's Edge Network does respect 'stale-while-revalidate'. However, Vercel's server strips 's-maxage' and 'stale-while-revalidate' from the response, requiring a closer look at 'x-vercel-cache'. Comments indicate that Vercel's actual support is terrible despite its efforts on public image and marketing. The post also discusses different ways of adding caching headers in Vercel, but the preferred method is to use the framework or product native way. Criticisms of Vercel's service are made, while comments on the author's purpose for their app are considered irrelevant.Vercel's pricing and feature list is criticized, with one user finding it over-engineered for a simple job board, another distrustful of its generic marketing website, and a third highlighting the absence of rate limiting or DDoS prevention options. However, some praise Vercel's superior developer experience and per-branch deployments. Users also discuss the support for stale-while-revalidate by some CDNs, including Fastly and Vercel. Despite debate, Vercel remains a popular front-end deployment platform.",
        "hn_summary": "An investigation into Vercel raised concerns over their customer service, pricing, and scaling issues, with alternative providers like GitHub Actions, DigitalOcean, and Cloudflare suggested. Criticisms of deceptive messaging, inadequate documentation, and poor response times were made. Some Next.js users debate server-side rendering versus static site generation, with criticisms over Vercel's design and not providing a specification. Criticisms of Vercel's pricing, business practices, and billing practices were also made, with suggestions for cheaper alternatives like BunnyCDN or R2. Vercel's support is criticized, despite their marketing efforts. Some praise their developer experience and per-branch deployments."
    },
    {
        "id": 35511052,
        "timestamp": 1681125089,
        "title": "Dashcam footage shows driverless cars clogging San Francisco",
        "url": "https://www.wired.com/story/dashcam-footage-shows-driverless-cars-cruise-waymo-clogging-san-francisco/",
        "hn_url": "http://news.ycombinator.com/item?id=35511052",
        "content": "Dashcam footage from public transit vehicles reveals incidents involving Waymo and General Motors’ Cruise autonomous vehicles causing delays and potential danger for buses, trains, and passengers in San Francisco since September 2022. Companies behind driverless cars aim to add more robotaxis to San Francisco's streets but require approval from California state regulators. San Francisco officials express concern about the significant uptick in chaos caused by driverless cars and urge companies to show progress in addressing failures before authorizing operations. Autonomous cars in San Francisco made 92 unplanned stops from May to December 2022, causing significant transit delays.Robotaxis are causing delays and disruptions in San Francisco's public transportation system, with self-driving cars blocking light-rail trains and buses for several minutes on multiple occasions. San Francisco transit advocates are proposing measures, such as creating more transit-only lanes and fining companies that cause delays, to lessen the impact of autonomous vehicles. The San Francisco Municipal Transportation Agency says it is in discussions with autonomous vehicle companies to minimize the disruptions. Driverless car companies should work with the city to set performance goals and improve the technology's effectiveness on urban streets, said Jeffrey Tumlin, the agency's executive director.Ethereum's Shanghai update debates bitcoin's environmental impact through untethering itself from mining; using 11 engineering tips to enhance OpenAI's chatbot; Analog computing makes an unbelievable comeback; Lyft's continued success signals the end of the gig economy dream; heated seat subscription fees for used cars become a reality.",
        "summary": "Autonomous vehicle companies including Waymo and General Motors' Cruise have caused delays and potential danger for buses, trains, and passengers in San Francisco since September 2022, with 92 unplanned stops causing significant transit delays. Despite attempts to add more robotaxis to San Francisco's streets, city officials express concern about the uptick in chaos caused by autonomous vehicles and urge the necessity of progress in addressing failures before authorizing operations. San Francisco transit advocates are proposing measures, such as creating transit-only lanes and fining companies that cause delays, to lessen the impact of autonomous vehicles. The San Francisco Municipal Transportation Agency is in discussions with autonomous vehicle companies to minimize disruptions.",
        "hn_title": "Dashcam footage shows driverless cars clogging San Francisco",
        "original_title": "Dashcam footage shows driverless cars clogging San Francisco",
        "score": 254,
        "hn_content": "Dashcam footage shows driverless cars causing traffic congestion in San Francisco according to a post on Hacker News. Some users fear a future where relentless driverless cars circumnavigate roads seeking passengers or parking spots, potentially leading to congestion pricing. Others believe that when humans are taken out of the driver’s seat, a potentially new infrastructure could be built, and mass transit could win out. There are concerns over the ability of autonomous vehicles to handle unforeseen and complex situations and the possibility that city streets will clog up excessively due to a proliferation of empty driverless cars.Self-driving cars could drastically improve parking by dropping off passengers and parking elsewhere, even if it's a few minutes away. In addition, self-driving cars can cooperatively pack themselves into compact configurations, freeing up even more space. Laws and regulations will ensure self-driving cars follow proper parking etiquette, potentially limiting congestion. Self-driving taxis could reduce the number of cars parked in a city, making traditional parking lots obsolete, and leaving room for new urban designs. Charging self-driving cars can be done through rows of charging stations that automatically plug in, or wireless charging methods underneath the parking lot. The shift to autonomous cars could be complicated, but self-driving cars could reduce driving-related stress, parking fees and costs, and could eliminate the need for car ownership altogether. Scarcity of parking could be addressed through road pricing, making access a monetized, scarce resource. Despite fears, the idea of self-driving cars circling around forever in search of a parking spot is not a realistic concern, and cars can be programmed to park away and return for their owners when needed.A proposed solution of having self-driving cars circle around to park elsewhere to reduce congestion may actually lead to more traffic and less availability of parking. Additionally, some individuals have commutes up to 4 hours long and may benefit from extra time to nap or relax. Though free parking subsidies are insidious and paid for by non-drivers, pricing and managing spots through a web service or market rate can be implemented. Some European and Asian cities have successfully utilized this solution. However, it's essential to enforce the \"unoccupied vehicle\" rule and consider congestion pricing for all road use time in high congestion areas.San Francisco has limited off-street parking, which leads to expensive parking on the streets with high car break-in rates. Some argue that mandating minimums of free parking is absurd. Self-driving cars could coordinate with each other to park as well as pick passengers up, but many are skeptical of the potential issues. There may be a moonshot idea that cars talk to each other, but shared, open standards and protocols are unlikely to be established. Simple tech solutions such as implementing a standard way to cast your phone onto the screen in the car is still lacking despite the advancement in tech.A discussion on self-driving cars prompted HN users to debate the potential impact of the technology on public transportation, urban density, housing, parking, and labor markets. Some noted a fear that self-driving cars will lead to unclear ethical decisions around their behavior in accidents. Others used examples of long commutes to propose living in self-driving cars instead of traditional housing. However, many HN users agreed that self-driving cars have the potential to lower transportation costs and produce a more efficient use of available parking options. Overall, HN users were intrigued by the new possibilities self-driving cars may offer but remained cautious in their expectations.HN users discuss the realities of long commutes, with some citing examples of extreme length, and others pointing out the negative consequences of spending so much time in transit. Self-driving cars are suggested as a possible solution, with some users envisioning new infrastructure and rules to support them. However, others caution that densification may not be the best option for already-crowded cities like NYC and SF, noting that such cities are already struggling with issues such as increased traffic and high costs of living. Some users argue for the benefits of public transit, while others express skepticism.The potential for cities to turn parking lots into parks or multi-purpose areas is being discussed on Hacker News, with one user suggesting cars that never have a driver could be much smaller. Some users suggest that in ten years time fewer people will be owning vehicles, with more using autonomous transport. It's also pointed out that as efficiency increases, usage also increases, due to Jevon's Paradox. Finally, there is discussion of how future transportation technology will affect pedestrians and bicyclists.A user claims that \"voting with your wallet\" happens every time someone spends money on a product, indicating approval of the company's practices. A user suggests that not buying self-driving cars won't stop companies from creating them, but it's their preference. The younger generation may lose the option to own a regular car over time. There is debate about the efficiency of idle self-driving cars on the road. Self-driving cars may not be wholly dystopian, and there are potential benefits, such as reduced pollution and noise; however, some risks include increased traffic and decreased safety for pedestrians and bikers. Mass car rental services can rationalize ownership, reduce the number of cars on the road, and improve parking.Experts predict that self-driving cars will lead to companies purchasing large fleets rather than individuals owning cars, with people paying for transportation services instead. The best self-driving cars will be too expensive for most to buy, so fleets will become more commonplace. With AI optimizing fleet usage and governments taxing companies per km/time interval/peak hours, transportation services will become more effective and efficient. However, some experts predict that most people won't think of their cars as investments, so they will not care about them being on the road as much as possible. The cost of manned vehicles and storage for cars will remain high. Public transit in North America is generally inadequate, so self-driving cars are seen as a cost-effective alternative, and roads will communicate with these cars, which could make roads safer.Experts discuss the potential for self-driving technology to revolutionize public transportation and reduce emissions. One user notes the importance of dedicated bus lanes to prevent buses from slowing down as traffic. Another proposes applying self-driving technology to buses, while others discuss the potential for small self-driving cars to replace personal vehicles. The issue of microplastics from tire emissions is raised as a potential downside. Finally, the potential drawbacks of self-driving public transportation are discussed, including the need for surveillance and potential social credit score systems.Self-driving cars can lead to real-time traffic management at scale, reduce pollution, and make transportation cheaper with ever-faster sandwich delivery. Concerns about the negative aspects of self-driving cars arise like pedestrian safety, governance and ownership issues, and investments in transit infrastructure. Some users foresee teleoperated car compartments that transport not just passengers but also sandwiches. Automobile-focused infrastructure needs massive investment in traditional forms of transit. The future of self-driving cars looks promising and may not look like Tesla but more like a moving office or comfortable family room to enjoy quality time without worrying about driving. Cars may talk to each other to utilize the road better, but failure of these systems is catastrophic in nature. There is a huge opportunity waiting for brighter minds to figure out how to make our transportation safer and more efficient.San Francisco officials blame driverless cars for congestion, yet experts claim that these cars will not clog the streets but instead wait in inaccessible areas for new orders. Some commenters defend driverless cars, claiming they are safer for pedestrians than human drivers. The article also addresses the problem of sideshows that frequently occur in San Francisco. Overall, driverless cars may not be the main cause of traffic jam, but city officials and drivers alike are quick to point fingers.An article about Cruise cars causing traffic congestion has attracted sarcastic comments, with one person comparing the problem to boat traffic blocking bridges in Seattle, and another suggesting a reverse-toll system where drivers, pedestrians and bus passengers are paid a small amount when boats create delays. However, some comments suggest the article highlights issues with bus rules as much as it does driverless technology. Commenters also warn that an enforcement mechanism must exist for self-driving technology, which will be scrutinized more closely and must perform better than traditional human drivers.",
        "hn_summary": "Dashcam footage shows driverless cars causing traffic congestion in San Francisco. Some fear congestion pricing, while others see potential for new infrastructure and mass transit. Concerns over unforeseen situations and excessive empty cars clogging streets exist; however, autonomous vehicles could reduce parking fees and costs, and eliminate car ownership. Solutions such as charging stations and limiting congestion through pricing and regulations exist. Self-driving cars' potential impact on public transportation, urban density, housing, parking, and labor markets are debated. Skepticism exists, but possibilities are intriguing. Self-driving cars may lead to fleets instead of individual ownerships, optimizing usage and becoming cost-effective. Self-driving technology may improve public transportation and reduce emissions, but potential downsides exist. Real-time traffic management, reduced pollution, and cheaper transportation seem promising, with a need for safer and more efficient transportation systems. San Francisco officials blame driverless cars for congestion, but experts claim otherwise. The article highlights issues with bus rules as much as driverless technology."
    },
    {
        "id": 35512401,
        "timestamp": 1681135259,
        "title": "OpenBSD 7.3",
        "url": "https://www.openbsd.org/73.html",
        "hn_url": "http://news.ycombinator.com/item?id=35512401",
        "content": "OpenBSD 7.3 release includes various kernel improvements, system updates, fast access to the system runtime clock, unlocked mmap, and improvements for SMP, VMM/VMD, DRM graphics drivers, and hardware support with several new drivers added. There are also various userland features, bugfixes, and enhancements, and the release fixes edge cases in top(1), enhances timeout(1) by adding signal as a full argument name, and improves hardware support for the Qualcomm Power Domain controller, the PWM found on Qualcomm SoCs, and the MotorComm YT8511 PHY.The latest OpenBSD update includes a range of new features and improvements, such as new support for Apple ARM64 hardware, and enhanced support for Wacom, wireless and networking hardware, and installer and bootloader improvements. It also includes new security improvements to prevent memory reading and execute-only binaries, as well as a new feature to support non-mutable program static address space. Many drivers have been added, improved, or reworked and a comprehensive list of architectures are affected.OpenBSD introduces various mitigation techniques and changes in the network stack, including preventing kernel crashes, improving performance and scalability, and fixing numerous bugs; IPsec support is enhanced, and routing daemons and userland network receive updates. Also, rpki-client(8) adds support for validating Trust Anchor Key (TAK) objects, while ypldap(8) introduces client certificate authentication. Ifconfig(8) gains support for configuring interfaces by lladdr, and NC(1) improves its connection-testing mechanism. Tftp(1) becomes more secure, while Rarpd(8) now only unveils /tftpboot if specifically requested. Finally, a long-standing bug in a libreadline header causing issues with the interactive Python command line interface gets fixed.OpenBSD's recent update, labeled nc, includes various improvements, such as support for newlines in acme-client, improving how to retrieve subject alternative names, corrected arguments for several calls, and added features to tmux, among other enhancements. Additionally, LibreSSL version 3.7.2 introduces improved accessibility, fixed potential leaks, and added EVP accessor functions and various security fixes. OpenSSH 9.3 and 9.2 patches a logic error that prevented destination constraints from being communicated with ssh-agent, and fixes a pre-authentication double-free memory fault in sshd. The update also includes potentially incompatible changes, such as the addition of the EnableEscapeCommandline ssh_config option.OpenBSD release 7.3 includes various bug fixes and improvements including support for dynamic remote port forwarding in ssh, better progress meter handling, RSA/SHA256 usage for private keys in ssh-add and ssh-keygen commands, among others. Additionally, various pre-built packages for different architectures are included such as Chromium, Python, and PostgreSQL. Installation instructions are provided for different machines, and upgrade information can be found in the upgrade guide. The release also includes a ports tree archive, which is not a manual on how to use ports, but notes to begin using the OpenBSD ports system.The OpenBSD mailing listports@openbsd.org is a recommended resource for those seeking more information.",
        "summary": "OpenBSD 7.3 release features kernel improvements, system updates, unlocked mmap, and hardware support. OpenBSD also introduces various mitigation techniques and changes to the network stack to prevent crashes and improve performance. The release includes various userland features, bugfixes, and security improvements such as preventing memory reading and execute-only binaries. Additionally, new drivers have been added, improved, or reworked. The update also includes improvements for nc, LibreSSL version 3.7.2, and OpenSSH 9.3 and 9.2. The release offers support for dynamic remote port forwarding and pre-built packages for different architectures. The mailing listports@openbsd.org provides more information for users.",
        "hn_title": "OpenBSD 7.3",
        "original_title": "OpenBSD 7.3",
        "score": 238,
        "hn_content": "OpenBSD 7.3 has been recently released, with some users suggesting that building/runnning your application code on OpenBSD can make your app run \"correctly\" better than any other OS/allows easier app bug detection. For people in it for the history, OpenBSD 7.3 also has fixes to ed(i), one of the standard editors for Unix. The recent release is notable due to its potential for use as a NAS/router/home server or even for PinePhone, and OpenBSD being a secure option may offer useful applications now.A Hacker News user highlights how for-profit companies support some aspects of Linux but ignore smaller operating systems, making the Linux experience almost monastic compared to the modern desktop. However, an HN user thinks that new wifi tech supports higher speeds, and OpenBSD can run Linux guests. While .NET is available from official repositories on several Linux OS's, it seems to be unavailable on OpenBSD. OpenBSD's low memory limit, lack of hardware acceleration, and performance issues might make it unsuitable for certain domains. Mono seeks to support all BSD platforms but is not compatible with current dotnet.OpenBSD's packet filtering is now threaded, leading to better performance. Despite this, the filtering is not very hardware-intensive, and even modest hardware can do 1G routing+PF+VLAN. OpenBSD has no support for Bluetooth, as their previous implementation was broken and no one volunteered to fix it. The lack of a driver for Amazon's ENA network interface makes running OpenBSD on arm64 EC2 instances a challenge. The OpenBSD release process has been talked about in-depth by the OpenBSD leader Theo DeRaat.",
        "hn_summary": "OpenBSD 7.3 released with better bug detection, can be used as NAS/router/home server; fix to Unix editor. OpenBSD possibly outperforms Linux, according to HN user. OpenBSD lacks .NET, Mono seeks BSD support. OpenBSD's packet filtering is threaded, with modest hardware able to do 1G routing+PF+VLAN. No Bluetooth support, ENA driver missing, OpenBSD's release process discussed by Theo DeRaat."
    },
    {
        "id": 35510516,
        "timestamp": 1681118353,
        "title": "Personal Concierge Using OpenAI's ChatGPT via Telegram & Voice Messages",
        "url": "https://github.com/RafalWilinski/telegram-chatgpt-concierge-bot",
        "hn_url": "http://news.ycombinator.com/item?id=35510516",
        "content": "# Telegram ChatGPT Concierge Bot (+ Voice!)![Telegram ChatGPT Concierge Bot](./img/demo.png)This is a Telegram bot that uses:- OpenAI's ChatGPT, obviously, as \"the brain\"- [LangchainJS](https://github.com/hwchase17/langchainjs) to constructs prompts, handle convo history and interact with Google- OpenAI's Whisper API to generate text from voice- [Play.ht](https://play.ht) to generate voice from text and reply to voice messages### How to use> Prerequisite: You need to have a Telegram bot token and an OpenAI API key. Ask ChatGPT how to get these.1. `git clone https://github.com/RafalWilinski/telegram-chatgpt-concierge-bot`2. `cd telegram-chatgpt-concierge-bot`3. `touch .env` and fill the following:```TELEGRAM_TOKEN=OPENAI_API_KEY=PLAY_HT_SECRET_KEY=PLAY_HT_USER_ID=```4. `npm install`5. `npm start`--- Follow me on [Twitter](https://twitter.com/RafalWilinski)Discuss on [Twitter](https://twitter.com/rafalwilinski/status/1645123663514009601) or [HackerNews](https://news.ycombinator.com/item?id=35510516)",
        "summary": "A new Telegram bot, utilizing OpenAI's ChatGPT, LangchainJS, OpenAI's Whisper API, and Play.ht, allows for personalized concierge services through both voice and chat. To use, users must acquire a Telegram bot token and an OpenAI API key, then follow the steps listed on GitHub. The bot is a new and exciting development for those looking for hands-free assistant services, and has garnered attention on social media sites such as Twitter and Hacker News.",
        "hn_title": "Personal Concierge Using OpenAI's ChatGPT via Telegram and Voice Messages",
        "original_title": "Personal Concierge Using OpenAI's ChatGPT via Telegram and Voice Messages",
        "score": 229,
        "hn_content": "A personal concierge utilizing OpenAI's ChatGPT for telegrams and voice messages has gained attention on Hacker News. Users discuss the effectiveness of ChatGPT 3.5 versus GPT 4 and the issue of token pricing. While some note the limitations of current AI, others propose potential uses such as creating a personal AI assistant. Importantly, the post draws attention due to the novelty of using ChatGPT for personal concierge services, leading to discussions about its practicality and limitations.A recent Hacker News post discusses the improvements made to an open-source ChatGPT artificial intelligence model that can help improve productivity. Users could use the chat interface to prioritize and remember tasks with more human intuition, although the various questions around embedding data storage and historical limits remain. Some users have created their own version of this app on platforms such as Discord and WhatsApp. Despite the interest in the new technology, some users criticize the high cost of Twilio, which powers ChatGPT's voice-to-text input.Users on Hacker News are discussing ChatGPT, a chatbot that uses GPT4 and Langchain to assist with tasks and provide information. Some users express concerns about privacy and information sharing, while others share their experiences using ChatGPT in various contexts. Some users have developed their own versions of ChatGPT, and there are suggestions for using similar technology over SMS. Overall, the technology is still relatively new but is being integrated into more projects and products. It remains to be seen how privacy laws like GDPR will affect the future of LLM technology.OpenAI clarifies that running inference does not change the trained weights, and any updates to GPT-4 running a LoRA-pass will be an explicit decision by OpenAI. While OpenAI is saving ChatGPT data for later training purposes, they claim they are not retaining data through the API, though there are privacy concerns. OpenAI's \"reliably isolate sessions\" reference seems to point to protecting data when using non-API consumer products like ChatGPT and DALL-E.",
        "hn_summary": "A personal concierge using ChatGPT has gained attention on Hacker News, leading to discussions about effectiveness, pricing, and potential uses. Users are interested in improving productivity with AI, but there are concerns about data storage and high costs. ChatGPT and similar technology are being integrated into more projects, but there are privacy concerns. OpenAI clarifies its data retention policies and seeks to protect data when using consumer products."
    },
    {
        "id": 35509429,
        "timestamp": 1681104208,
        "title": "EditAnything: Segment Anything + ControlNet + BLIP2 + Stable Diffusion",
        "url": "https://github.com/sail-sg/EditAnything",
        "hn_url": "http://news.ycombinator.com/item?id=35509429",
        "content": "# Edit Anything by Segment-AnythingThis is an ongoing project aims to **Edit and Generate Anything** in an image,powered by [Segment Anything](https://github.com/facebookresearch/segment-anything), [ControlNet](https://github.com/lllyasviel/ControlNet),[BLIP2](https://github.com/salesforce/LAVIS/tree/main/projects/blip2), [Stable Diffusion](https://huggingface.co/spaces/stabilityai/stable-diffusion), etc.A project for fun. Any forms of contribution and suggestionare very welcomed!# News2023/04/10 - An initial version of edit-anything is in `sam2edit.py`.2023/04/10 - We transfer the pretrained model into diffusers style, the pretrained model is auto loaded when using `sam2image_diffuser.py`. Now you can combine our pretrained model with different base models easily!2023/04/09 - We released a pretrained model of StableDiffusion based ControlNet that generate images conditioned by SAM segmentation.# FeaturesHighlight features:- Pretrained ControlNet with SAM mask as condition enables the image generation with fine-grained control.- category-unrelated SAM mask enables more forms of editing and generation.- BLIP2 text generation enables text guidance-free control.## Edit Anything by Segment-AnythingHuman Prompt: \"chairs by the lake, sunny day, spring\"![p](images/edit_sample1.jpg)An initial version of edit-anything. (We will add more controls on masks very soon.)## Generate Anything by Segment-AnythingBLIP2 Prompt: \"a large white and red ferry\"![p](images/sample1.jpg)(1:input image; 2: segmentation mask; 3-8: generated images.)BLIP2 Prompt: \"a cloudy sky\"![p](images/sample2.jpg)BLIP2 Prompt: \"a black drone flying in the blue sky\"![p](images/sample3.jpg)1) The human prompt and BLIP2 generated prompt build the text instruction.2) The SAM model segment the input image to generate segmentation mask without category.3) The segmentation mask and text instruction guide the image generation.Note: Due to the privacy protection in the SAM dataset,faces in generated images are also blurred. We are training new modelswith unblurred images to solve this.# Ongoing- [x] Conditional Generation trained with 85k samples in SAM dataset.- [ ] Training with more images from LAION and SAM.- [ ] Interactive control on different masks for image editing.- [ ] Using [Grounding DINO](https://github.com/IDEA-Research/Grounded-Segment-Anything) for category-related auto editing. - [ ] ChatGPT guided image editing.# Setup**Create a environment**```bash  conda env create -f environment.yaml  conda activate control```**Install BLIP2 and SAM**Put these models in `models` folder.```bashpip install git+https://github.com/huggingface/transformers.gitpip install git+https://github.com/facebookresearch/segment-anything.git```**Download pretrained model**```bash# Segment-anything ViT-H SAM model. cd models/wget https://dl.fbaipublicfiles.com/segment_anything/sam_vit_h_4b8939.pth# BLIP2 model will be auto downloaded.# Get edit-anything-ckpt-v0-1.ckpt pretrained model from huggingface. # No need to download this if your are using sam2image_diffuser.py!!!https://huggingface.co/shgao/edit-anything-v0-1```**Run Demo**```bashpython sam2image_diffuser.py# or python sam2image.py# or python sam2edit.py```Set 'use_gradio = True' in these files if youhave GUI to run the gradio demo.# Training1. Generate training dataset with `dataset_build.py`.2. Transfer stable-diffusion model with `tool_add_control_sd21.py`.2. Train model with `sam_train_sd21.py`.# AcknowledgementThis project is based on:[Segment Anything](https://github.com/facebookresearch/segment-anything),[ControlNet](https://github.com/lllyasviel/ControlNet),[BLIP2](https://github.com/salesforce/LAVIS/tree/main/projects/blip2),[MDT](https://github.com/sail-sg/MDT),[Stable Diffusion](https://huggingface.co/spaces/stabilityai/stable-diffusion),[Large-scale Unsupervised Semantic Segmentation](https://github.com/LUSSeg)Thanks for these amazing projects!",
        "summary": "The ongoing project, Edit Anything, utilizes Segment Anything, ControlNet, BLIP2, Stable Diffusion and more to \"Edit and Generate Anything\" in images, with a focus on fun contributions and suggestions. Features include fine-grained control with pre-trained ControlNet and category-unrelated SAM masks, and BLIP2 text guidance-free control. Ongoing goals include the addition of interactive control for image editing and chatGPT guided image editing. Interested individuals can create an environment by following the provided setup instructions and train their own models, or utilize the pretrained models available. The project is based on several other incredible projects, for which the creators express gratitude.",
        "hn_title": "EditAnything: Segment Anything + ControlNet + BLIP2 + Stable Diffusion",
        "original_title": "EditAnything: Segment Anything + ControlNet + BLIP2 + Stable Diffusion",
        "score": 194,
        "hn_content": "EditAnything: Segment Anything + ControlNet + BLIP2 + Stable Diffusion | Hacker NewsHacker Newsnew | past | comments | ask | show | jobs | submit login EditAnything: Segment Anything + ControlNet + BLIP2 + Stable Diffusion (github.com/sail-sg)194 points by pizza 23 hours ago | hide | past | favorite | 23 comments   jonplackett 20 hours ago        | next [–] Saw this coming as soon as I saw Segment Anything, but it doesn’t make it any less magical reply  RockyMcNuts 11 hours ago        | parent | next [–] can someone ELI5 what it does and why it's magical? reply  d23 10 hours ago        | root | parent | next [–] Yeah I'm having trouble understanding why this isn't something that's already accomplishable using SD + ControlNet. I guess Segment Anything lets you not need to manually segment an image? The example images don't seem to be particularly better than what one could generate without segmenting using autogenerated canny or scribble or depth controlnet images to me though. reply  jonplackett 5 hours ago        | root | parent | prev | next [–] Segmenting really well, like how a human would do it has been for some reason really really hard for a computer to do. I guess because it requires understanding of what objects actually are. So that part is amazing that it works so well.And then the control net part seems more magical just because you have a REALLY accurate input reply  MitPitt 19 hours ago        | prev | next [–] I don't understand what this does. Examples mention \"human prompt\" but I don't see it anywhere. reply  okamiueru 18 hours ago        | parent | next [–] The readme.md has some image examples. If I interpret them correctly, the first one is the input image, the second the segmented output, and the rest are example outputs using the prompt text shown above the collage.The visual quality of the output images is not particularly impressive compared to what we've become used to.What (IMO) it attempts to showcase is how the input image segmentation is used to guide the final image generation. That part is quite impressive. The shapes, and \"segments\" are very well preserved from input to output. reply  sp332 18 hours ago        | root | parent | next [–] \"The human prompt and BLIP2 generated prompt build the text instruction.\" The examples only show the BLIP2 prompt. reply  GaggiX 15 hours ago        | parent | prev | next [–] It's a controlnet model trained on SAM segmentation maps. The final model takes a prompt and a segmentation map as input and generates an image conditioned on them. reply  Sharlin 11 hours ago        | root | parent | next [–] And I thought I was moderately \"with it\" with regard to AI… Could I get that in ELI5? reply  GaggiX 10 hours ago        | root | parent | next [–] https://github.com/lllyasviel/ControlNetControlnet is a neural network added to an already trained model so they can be conditioned on new stuff like canny edge, depth map, segmentation map. Controlnet let you train this model on the new condition \"easily\", without catastrophic forgetting and without a huge dataset. In the repo linked by OP, they have trained a controlnet model on the segmentation map generated by SAM: https://segment-anything.com/ reply  nonbirithm 15 hours ago        | prev | next [–] Sounds like a good idea. Some recent Stable Diffusion toolkits like ComfyUI are modular so in theory you'd be able to build a pipeline like this inside the application instead of being constrained to one workflow. reply  55555 13 hours ago        | prev | next [–] Where did META get the Segment Anything training dataset from? Or, if they made it, how did they generate such a massive dataset of accurate masks? reply  xiphias2 13 hours ago        | parent | next [–] Actually it is quite small dataset by current standards (millions of images), so I guess it was using humans in the loop. reply  fkarg 12 hours ago        | root | parent | next [–] the relevant part is the masks, and so far it's the biggest dataset in existence, with about 400x more masks than the next smaller one.: excluding non-public ones reply  fkarg 12 hours ago        | parent | prev | next [–] they described it in their paper: they created it themselves. they had/have a loop of having humans annotate images their system was uncertain about, but the released one was fully automated. reply  i_like_apis 18 hours ago        | prev | next [–] Example 1: ok. Examples 2 and three look like failures. reply  jack_riminton 20 hours ago        | prev | next [–] I wonder if Segment Anything can work on things that aren't 'real looking' e.g. if I created a semi abstract piece in the style of Matisse on MidJourney, would it be able to segment the wiggly vase that doesn't look like a vase? reply  teruakohatu 20 hours ago        | parent | next [–] It works fine on a Matisse-like image of a vase, such as this one by Kay Gallwey:https://www.artsy.net/article/artsy-editorial-guide-painting... reply  runnerup 16 hours ago        | parent | prev | next [–] It works fine for me on very abstract stuff. Seems quite well generalized. Just wish they might release the CLIP encoder for it so you can prompt it with text prompts. reply  jack_riminton 15 hours ago        | root | parent | next [–] Cool thanks. Yeah hopefully since Meta open-sourced the segmenter MidJourney is already working on it reply  dgellow 12 hours ago        | prev | next [–] Great, that was obviously coming! Stable diffusion with controlnet was already so good, with segment anything we start to really have a fantastic experience! Really cool, I will definitely play with this during the week, thanks for sharing reply  forgingahead 20 hours ago        | prev [–] Nice work! Did you figure out the training/fine-tuning code for Segment Anything? There's an on-going discussion on the official repo[0] but no clear results yet.[0]https://github.com/facebookresearch/segment-anything/issues/... reply  Weatebob 17 hours ago        | parent [–] I'm wondering about this too.But I will try it out with label studio and this alone with a classic training workflow should speed up the process tremendously anyway. replyApplications are open for YC Summer 2023Guidelines | FAQ | Lists | API | Security | Legal | Apply to YC | ContactSearch:",
        "hn_summary": "'EditAnything' uses Segment Anything, ControlNet, BLIP2, and Stable Diffusion. HN users want an ELI5 explanation. Segment Anything is impressive due to its accuracy. The image segmentation is impressive. ControlNet provides new conditions, datasets, without catastrophic forgetting. The dataset was generated by humans and automated. Examples don't impress some individuals. Segment Anything works accurately on abstract images. Users praise the technology. There is a discussion on the training/fine-tuning code."
    },
    {
        "id": 35517649,
        "timestamp": 1681162333,
        "title": "Generative Agents: Interactive Simulacra of Human Behavior",
        "url": "https://arxiv.org/abs/2304.03442",
        "hn_url": "http://news.ycombinator.com/item?id=35517649",
        "content": "[2304.03442] Generative Agents: Interactive Simulacra of Human BehaviorSkip to main contentWe gratefully acknowledge support fromthe Simons Foundation and member institutions. > cs > arXiv:2304.03442 Help | Advanced SearchAll fieldsTitleAuthorAbstractCommentsJournal referenceACM classificationMSC classificationReport numberarXiv identifierDOIORCIDarXiv author IDHelp pagesFull textSearchopen searchGOopen navigation menuquick linksLoginHelp PagesAboutComputer Science > Human-Computer InteractionarXiv:2304.03442 (cs)               [Submitted on 7 Apr 2023]Title:Generative Agents: Interactive Simulacra of Human BehaviorAuthors:Joon Sung Park, Joseph C. O'Brien, Carrie J. Cai, Meredith Ringel Morris, Percy Liang, Michael S. BernsteinDownload a PDF of the paper titled Generative Agents: Interactive Simulacra of Human Behavior, by Joon Sung Park and 5 other authorsDownload PDFAbstract: Believable proxies of human behavior can empower interactive applicationsranging from immersive environments to rehearsal spaces for interpersonalcommunication to prototyping tools. In this paper, we introduce generativeagents--computational software agents that simulate believable human behavior.Generative agents wake up, cook breakfast, and head to work; artists paint,while authors write; they form opinions, notice each other, and initiateconversations; they remember and reflect on days past as they plan the nextday. To enable generative agents, we describe an architecture that extends alarge language model to store a complete record of the agent's experiencesusing natural language, synthesize those memories over time into higher-levelreflections, and retrieve them dynamically to plan behavior. We instantiategenerative agents to populate an interactive sandbox environment inspired byThe Sims, where end users can interact with a small town of twenty five agentsusing natural language. In an evaluation, these generative agents producebelievable individual and emergent social behaviors: for example, starting withonly a single user-specified notion that one agent wants to throw a Valentine'sDay party, the agents autonomously spread invitations to the party over thenext two days, make new acquaintances, ask each other out on dates to theparty, and coordinate to show up for the party together at the right time. Wedemonstrate through ablation that the components of our agentarchitecture--observation, planning, and reflection--each contribute criticallyto the believability of agent behavior. By fusing large language models withcomputational, interactive agents, this work introduces architectural andinteraction patterns for enabling believable simulations of human behavior.  Subjects:Human-Computer Interaction (cs.HC); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)Cite as:arXiv:2304.03442 [cs.HC] (or arXiv:2304.03442v1 [cs.HC] for this version)      https://doi.org/10.48550/arXiv.2304.03442Focus to learn more        arXiv-issued DOI via DataCite       Submission history From: Joon Sung Park [view email]   [v1]Fri, 7 Apr 2023 01:55:19 UTC (34,149 KB)Full-text links:Download:Download a PDF of the paper titled Generative Agents: Interactive Simulacra of Human Behavior, by Joon Sung Park and 5 other authorsPDFOther formats(license)  Current browse context: cs.HC< prev  |  next >new | recent | 2304  Change to browse by:  cscs.AIcs.LGReferences & CitationsNASA ADSGoogle ScholarSemantic Scholaraexport BibTeX citationLoading...BibTeX formatted citation×loading...Data provided by: BookmarkBibliographic ToolsBibliographic and Citation ToolsBibliographic Explorer ToggleBibliographic Explorer (What is the Explorer?)Litmaps ToggleLitmaps (What is Litmaps?)scite.ai Togglescite Smart Citations (What are Smart Citations?)Code, Data, MediaCode, Data and Media Associated with this ArticleDagsHub ToggleDagsHub (What is DagsHub?)Links to Code TogglePapers with Code (What is Papers with Code?)ScienceCast ToggleScienceCast (What is ScienceCast?)DemosDemosReplicate ToggleReplicate (What is Replicate?)Spaces ToggleHugging Face Spaces (What is Spaces?)Related PapersRecommenders and Search ToolsLink to Influence FlowerInfluence Flower (What are Influence Flowers?)Connected Papers ToggleConnected Papers (What is Connected Papers?)Core recommender toggleCORE Recommender (What is CORE?)AuthorVenueInstitutionTopic    About arXivLabs   arXivLabs: experimental projects with community collaboratorsarXivLabs is a framework that allows collaborators to develop and share new arXiv features directly on our website.Both individuals and organizations that work with arXivLabs have embraced and accepted our values of openness, community, excellence, and user data privacy. arXiv is committed to these values and only works with partners that adhere to them.Have an idea for a project that will add value for arXiv's community? Learn more about arXivLabs.Which authors of this paper are endorsers? |  Disable MathJax (What is MathJax?)  AboutHelpcontact arXivClick here to contact arXiv Contactsubscribe to arXiv mailingsClick here to subscribe SubscribeCopyrightPrivacy PolicyWeb Accessibility AssistancearXiv Operational Status           Get status notifications via          email          or slack",
        "summary": "Researchers have introduced \"generative agents,\" computational software agents that simulate believable human behavior using an architecture that extends large language models to store a complete record of the agent's experiences using natural language, synthesize those memories over time into higher-level reflections, and retrieve them dynamically to plan behavior. In an evaluation, these generative agents produce believable individual and emergent social behaviors in an interactive sandbox environment inspired by The Sims. The research introduces architectural and interaction patterns for enabling believable simulations of human behavior.",
        "hn_title": "Generative Agents: Interactive Simulacra of Human Behavior",
        "original_title": "Generative Agents: Interactive Simulacra of Human Behavior",
        "score": 192,
        "hn_content": "Generative Agents: Interactive Simulacra of Human Behavior is an arxiv.org paper that has gained attention on Hacker News. The topic includes people asking the question of how to reduce behavior to discrete actions and gridded regions. Bots are a topic of discussion, with some wondering if they can be programmed to make data-driven stories. A 'inner voice' idea is discussed, one similar to how the hosts in Westworld hear programming directives. Lastly, it's concluded that creating a deep intelligence depends on the environment and that lack of universal entropy can be a crutch for the creation of a simulator.AI researchers discuss the limitations of language models, citing the need for training algorithms for modeling unarticulated common senses and inner voices. The experts also assert that LLMs are primitive and require higher-level algorithms for more control while addressing a simple simulated world. Although LLMs are also being studied for possible use in social sciences, an expert argues that bias from online sample sources may affect these models' accuracy. Researchers continue to develop knowledge-transfer mechanisms for artificial general intelligence (AGI) to refine and enhance models.Experts discuss the level of handholding required for complex tasks in AI and the limitations of models like ChatGPT. Two papers present memory-augmented GPT models- Self-Refine and Reflexion and examine their performance on simple tasks. Augmented models improve upon the baseline but the process requires specific scaffolding, branching decisions and prompting, interpreted as handholding. Comments question the definition of handholding and the limitations of the models in more complex domains. A few comments highlight their potential use in the gaming industry, while others discount the overstatement of the AI overlord potential.Researchers at Google have published a paper outlining their latest advances in artificial intelligence (AI), which includes the development of a \"generative transformer\" named Dreamer who can navigate a 3D room and interact with objects. Unlike most text-generation models, Dreamer is able to accumulate memories and use them to inform responses. While it's still a far cry from true consciousness, generating interactions based on prior experiences is a significant step towards self-direction, and could pave the way for self-learning chatbots and video game characters. The paper has sparked a debate about how AI agents should make ethical decisions, and whether they ought to be modelled on real or fictional characters.An AI experiment describes an environment where multiple #LLM (#GPT)-powered agents interact in a small town, displaying \"emoji summarization\" for actions in the world. They also cover \"inner-voice\" interactions and user interference on the simulation. The study focuses on agent memories, personality development, and planning interactions, utilizing both qualitative and quantitative measures. The study was expensive, taking substantial time and resources to simulate 25 agents for two days, prompting ideas for coding more efficient character models. It is noted that the language is still stilted, and the simulation could benefit from future LLM designs.",
        "hn_summary": "'Generative Agents: Interactive Simulacra of Human Behavior' paper gains HN attention on behavior reduction and bot programming. Discussion includes 'inner voice' and the dependence of deep intelligence on environment. Limitations of language models cited, with focus on higher-level algorithms for control. Google's 'Dreamer' AI sparks debate on ethical decision-making. AI experiment simulates LLM-powered agents in a small town, focusing on memory and personality development, requiring costly simulation."
    },
    {
        "id": 35509132,
        "timestamp": 1681100295,
        "title": "Dancing Plague of 1518",
        "url": "https://en.wikipedia.org/wiki/Dancing_plague_of_1518",
        "hn_url": "http://news.ycombinator.com/item?id=35509132",
        "content": "The Dancing Plague of 1518 was a case of dancing mania that occurred in Strasbourg, Alsace, in the Holy Roman Empire. Somewhere between 50 and 400 people took to dancing for weeks after a woman began to dance fervently in a street in Strasbourg. Historical sources agree that there was an outbreak of dancing after a single woman started dancing, but the reason behind the phenomenon is unknown. Contemporaneous explanations included demonic possession and overheated blood, while modern theories cite stress-induced mass hysteria or food poisoning caused by ergot fungi. There is controversy over whether people danced to their deaths, but some sources claim that the plague killed around fifteen people per day during the outbreak. The Dancing Plague has been the subject of various works of pop culture, including a song by Florence and the Machine on her 2022 album.No summary provided as the given content is not related to cutting-edge tech news.",
        "summary": "In 1518, a group of 50-400 people in Strasbourg, Alsace began dancing for weeks after one woman started dancing in the street, but the cause of the phenomenon is unknown. Historical sources describe the event as a case of dancing mania, while modern theories suggest stress-induced mass hysteria or food poisoning caused by ergot fungi. There is controversy over whether the plague led to deaths, with some sources claiming it killed around 15 people per day during the outbreak. The Dancing Plague has inspired works of pop culture, including a song by Florence and the Machine.",
        "hn_title": "Dancing Plague of 1518",
        "original_title": "Dancing Plague of 1518",
        "score": 186,
        "hn_content": "The Dancing Plague of 1518 is a historical incident where people danced uncontrollably, and some perished while dancing; some believe that it was just a misunderstanding of medical terminology popular at the time, whereas others believe that it could be a case of mass hysteria; comments discuss how ailments like Sydenham chorea and Huntington's disease have been historically referred to as \"dance\" and speculate about the disease causing factors like ergotism while acknowledging the social factors that could have exacerbated the condition.In 1518, a woman began uncontrollably dancing in the street, which led to a viral dancing epidemic that spread to more than 30 other people who danced until collapsing from exhaustion. There have been numerous documented instances of such uncontrolled dancing throughout history, often during times of stress or fear. Possible explanations include LSD-like food poisoning or mass psychogenic illness. The cause of ancient dances and movements in religion is unknown, but there is a thread linking them. Modern medicine is unable to definitively explain restless leg syndrome, which is similar to the uncontrolled movements seen in the dancing epidemic of 1518.The Tech Times editor received user comments about a fun way to discover unusual historical events. Some users had questions, such as how to use the site, while others pointed out notable facts. An HN user drew parallels with recent cases of mass hysteria. While this is not 'news', HN readers may find it intellectually stimulating. The dancing plague provides a historical case of collective psychogenic syndrome. The article includes a link to the site's guidelines, which allow intellectually stimulating articles.",
        "hn_summary": "The Dancing Plague of 1518 involved uncontrollable dancing with possible medical and social factors. Similar uncontrolled dancing throughout history may have been due to mass psychogenic illness. Modern medicine struggles to explain such phenomena. Comments discuss historical references to \"dance\" and speculate on disease causes. The article offers a link to intellectually stimulating historical events."
    },
    {
        "id": 35511744,
        "timestamp": 1681131644,
        "title": "American IQ scores have rapidly dropped, proving the 'Reverse Flynn effect'",
        "url": "https://www.popularmechanics.com/science/a43469569/american-iq-scores-decline-reverse-flynn-effect/",
        "hn_url": "http://news.ycombinator.com/item?id=35511744",
        "content": "American IQ Scores Rapidly Decline: What Is Reverse Flynn Effect?SearchFollowFacebookInstagramTwitterPinterestYoutubeSubscribeMy BookmarksGet Our NewsletterPop Mech ProTest New GearExclusive StoriesDownload Digital IssuesShopHome and DIYPower ToolsCars, Trucks, & MotorcyclesTechnologyMilitaryGear & Gadget ReviewsScienceAdventureSci-FiAirplanesSpaceGiftsSales & DealsPromotionsYour Privacy ChoicesPrivacy NoticeTerms Of UseSkip to ContentHomeLatest StoriesScienceMilitaryPop Mech ProSubscribesign inScienceAmerican IQ Scores Have Rapidly Dropped, Proving the 'Reverse Flynn Effect'American IQ Scores Have Rapidly Dropped, Proving the 'Reverse Flynn Effect'Are we really getting less intelligent? Here's the truth.By Tim NewcombPublished: Apr 8, 2023Save ArticleMirageC//Getty ImagesA Northwestern University study shows a decline in three key intelligence testing categories—a tangible example of what is called the Reverse Flynn Effect.Leading up to the 1990s, IQ scores were consistently going up, but in recent years, that trend seems to have flipped. The reasons for both the increase and the decline are sill very much up for debate.Scores in verbal reasoning, matrix reasoning, and letter and number series all declined but, interestingly, scores in spatial reasoning went up.Americans’ IQ scores are trending in a downward direction. In fact, they’ve been falling for over a decade. According to a press release, in studying intelligence testing data from 2006 to 2018, Northwestern University researchers noticed that test scores in three out of four “cognitive domains” were going down. This is the first time we’ve seen a consistent negative slope for these testing categories, providing tangible evidence of what is known as the “Reverse Flynn Effect.”In a 1984 study, James Flynn noticed that intelligence test scores had steadily increased since the early 1930s. We call that steady rise the Flynn Effect. Considering that overall intelligence seemed to be increasing faster than could be explained by evolution, the reason increase became a source of debate, with many attributing the change to various environmental factors.More From Popular Mechanics play iconThe triangle icon that indicates to playBut now, it seems that a Reverse Flynn Effect is, well, in effect.The study, published in the journal Intelligence, used an online, survey-style personality test called the Synthetic Aperture Personality Assessment Project to analyze nearly 400,000 Americans. The researchers recorded responses from 2006 and 2018, in order to examine if and how cognitive ability scores were changing over time within the country. The data showed drops in logic and vocabulary (known as verbal reasoning), visual problem solving and analogies (known as matrix reasoning), and computational and mathematical abilities (known as letter and number series). Related StoryHow Will AI Ruin Humanity?On the flip side, however, scores in spatial reasoning (known as 3D rotation) followed the opposite pattern, trending upward over the 12-year period. “There’s a debate about what’s causing it, but not every domain is going down; one of them is going up,” Elizabeth Dworak, a research assistant professor at Northwestern University and one of the authors on the study, says in a news release. “If all the scores were going in the same direction, you could make a nice little narrative about it, but that’s not the case. We need to do more to dig into it.”Dworak, a research assistant professor at Northwestern University and one of the authors on the study, is very clear that these results don’t necessarily mean Americans are getting less intelligent. “It doesn’t mean their mental ability is lower or higher; it’s just a difference in scores that are favoring older or newer samples,” she said in a press release. “It could just be that they’re getting worse at taking tests or specifically worse at taking these kinds of tests.” And, it should be said, there has long been debate over how accurately IQ tests are able to gauge overall intelligence and potential for success in society in the first place.Regardless, scores are falling, and there’s got to be a reason for the decline. Dworak says it might have something to do with “a shift in perceived values in society.” She offers up the potential explanation that an increase in focus on STEM education may have allowed other areas, like abstract reasoning, to fall by the wayside.Related StoryShould We Worry About AI Reaching Singularity?“If you’re thinking about what society cares about and what it’s emphasizing and reinforcing every day,” she says, “there’s a possibility of that being reflected in performance on an ability test.”A few other hypotheses have been put forth to try and explain the reverse Flynn Effect, such as falling nutritional standards, the worsening of school systems, social media, increased air pollution, or the idea that people just be less interested in portions of the SPAP Project personality survey.Falling IQs have become yet another mystery for scientists to solve. Tim NewcombTim Newcomb is a journalist based in the Pacific Northwest. He covers stadiums, sneakers, gear, infrastructure, and more for a variety of publications, including Popular Mechanics. His favorite interviews have included sit-downs with Roger Federer in Switzerland, Kobe Bryant in Los Angeles, and Tinker Hatfield in Portland. ScienceScientist Discovers Hidden Chapter of the BibleScientists Can Turn Blood Sugar Into ElectricityNew Fukushima Images Raise Safety ConcernsScientists Aim For Cloning Mummified Extinct BisonAdvertisement - Continue Reading BelowWill 100 Days Underwater Make This Man Superhuman?N95 Vs. KN95 Masks: What’s the Difference?What These Immortal Jellyfish Can Teach UsWe Know How Fast Earth Spins ... Don’t We?The Weird Double Slit Experiment Just Got WeirderHumans Can Stop—but Not Reverse—Aging, Study SaysTardigrade DNA Into Humans May Make Super SoldiersThis Is the Face of a 35,000-Year-Old EgyptianAdvertisement - Continue Reading BelowNewsletterAbout UsMedia KitWriter GuidelinesPress RoomContact UsCommunity GuidelinesAdvertise OnlineCustomer ServiceSubscribeOther Hearst SubscriptionsGive a GiftEvents & PromotionsGiveawaysBeing GreenA Part of Hearst Digital MediaGear-obsessed editors choose every product we review. We may earn commission if you buy from a link.©Hearst Magazine Media, Inc. All Rights Reserved.Privacy NoticeCA Notice at CollectionYour CA Privacy Rights/Shine the LightDAA Industry Opt OutTerms of UseSite MapYour Privacy Choices: Opt Out of Sale/Targeted Ads",
        "summary": "New Northwestern University research suggests that American IQ scores are on the decline after decades of steady increases known as the 'Flynn effect.' The study examined intelligence data from 2006 to 2018 and found that scores in three out of four \"cognitive domains\" — verbal reasoning, matrix reasoning, and letter and number series — were falling. However, scores in spatial reasoning (known as 3D rotation) showed an upward trend. Researchers aren't sure of the reasons behind this trend but suggest that it could be a shift in societal values, the influence of STEM education, or decreased interest in certain areas of the survey.",
        "hn_title": "American IQ scores have rapidly dropped, proving the 'Reverse Flynn effect'",
        "original_title": "American IQ scores have rapidly dropped, proving the 'Reverse Flynn effect'",
        "score": 176,
        "hn_content": "American IQ scores have seen a rapid drop that indicates the \"Reverse Flynn effect\". While the trend overall shows a decline, the year-by-year variation across education groups is highly correlated, which could point to an issue with measurement validity. An IQ test is a relative measure that compares an individual's score to the population at a point in time. IQ tests usually require a set of questions, a sample group and comparison between scores on previous years’ tests. Flynn effect occurred when researchers noticed people who scored 100 on a recent test scored higher on previous years' tests. Understanding the primary readers’ needs and interpreting comments correctly is crucial in writing concise and precise summaries.An HN user debates whether raw scores on IQ tests can be compared across time and tests. Another implies that normalization is meant to make scores outside of the test meaningful. A new test must be compared to ensure it measures the same thing. YouTube video cited providing info on IQ tests. A user offers the theory that early test-takers failed to understand questions' puzzle nature. STEM majors’ ability to teach critical thinking challenged. Academics in humanities struggle to define critical thinking. Rigor in non-STEM academia may lack clarity and suffer from obfuscating language.A discussion on abstract reasoning and critical thinking skills in non-STEM fields sparks debate among HN users. Google autocomplete results and personal experience indicate a common criticism of STEM majors lacking critical thinking skills. However, some argue the opposite may also be true, and language imprecision can add a layer of complexity to tests of critical thinking skills. Overall, the conversation highlights the importance of different ways of thinking and the need for improving critical thinking skills across all fields.A blog post argues that IQ scores of the population as a whole are not dropping, but rather the change in composition of each group is causing the drop for each individual group. HN users point out the author's infamous viewpoints, and some recommend RationalWiki or a related Wikipedia article for more information. The use of ad-hominem is debated, but the argument is plausible and aligns with personal experience. The author of the blog post is unknown, so some caution is advised.A commenter on a recent Hacker News post discusses logical fallacies and how knowing who is making an argument can sometimes influence people's opinions. Another commenter critiques a blogger who appears to have made a mistake about dropping IQ scores, while a different commenter muses on the concept of measuring intelligence through IQ tests. The primary subject of the post itself is unclear from the raw content provided.A new study analyzing the cognitive ability scores of nearly 400,000 Americans found a decline in IQ, with vocabulary, numeracy, and analogies tests faring worse than spatial reasoning. However, some question whether IQ tests are measuring the right skills, as an expansive vocabulary may be less relevant in today's society. There is debate among academics regarding IQ decline, with experts disagreeing on whether genetic or environmental factors are at work. While psychometrics is dismissed by some, experts assert that there is no link between racial demographics and IQ scores when accounting for socioeconomic factors.Language skills are more than just vocabulary, as it can influence one's thinking and ability to categorize. Linguistic determinism is disproven, but the value of vocabulary lies in its ability to contextualize and identify concepts. A larger vocabulary sets one apart from others, making it valuable, especially when quick contextual shifts are necessary. There is a shift away from teaching critical thinking in schools, which is a departure from problem-solving to group thinking and memorizing 'correct' answers. The rate of stay-at-home parents has mostly stayed unchanged, but fewer parents in general have children, and the trend may reflect a decrease in IQ related to communication skills. The high heritability of IQ within races does not mean that race differences are genetic, and interventions can affect IQ by environmental means. From the macro scale, high IQ moves society forward while affecting individuals negatively, showing that high-level selection pressure is active in human nature.Comments on an article about \"The Bell Curve,\" a controversial book on the relationship between genetics and intelligence, include critiques of the book's bad science and policy proposals, as well as its use of a disgraced eugenicist as a source. Some commenters also discuss the heritability of IQ and how social welfare programs may have influenced the evolution of human intelligence. One commenter notes the role of sexual selection in evolutionary processes, while another jokes about the impact of their own comments on IQ levels. Despite differing opinions, the article leaves the possibility open that both genes and environment contribute to racial differences in intelligence but refrains from making any claims as to the exact proportions of each.A discussion on HN about the validity of IQ tests and the possible reasons behind rising or falling IQ scores over time. An article was criticized for lacking specific results and quantifiable data. One user shares a summary of \"The Flynn Effect,\" which explains the observed rise of IQ scores over time. The concept of genetic determination and natural selection pressure on IQ is challenged, and alternative theories include cultural shifts, exposure to media, and a possible decline in population health. The thread includes sarcastic comments and some political accusations.The heritability of IQ is being discussed in the comments section of a post, with some users pointing out that heritability does not necessarily mean genetic or biological factors are at play. Twin studies have shown a genetic component to intelligence, but more research is needed to determine how much is biologically likely for high-IQ parents to produce high-IQ kids. Anecdotal evidence suggests that high-IQ parents often have high-IQ children, but this correlation could be due to other factors such as socioeconomic status. There has been a distancing from the whole field of IQ research in modern psychology and policy makers, with many believing that the supposed heritability was observed because of bias within the research.The argument over IQ's heritability has historical context with eugenics and racial discrimination, which has led to a social policy that attributes outcomes to other factors. Accepting IQ as heritable would lead to better-targeted social policies and resolution of current divisive issues. Heritability refers to genetic contributions and not necessarily genetically determined factors. The demon-haunted world of quasi-religious opposition to IQ research has contributed to a lack of research on the subject.Comments on an HN post argue about the heritability of IQ as a genetic trait, with one user suggesting that the taboo around researching genetic determinism in this area reflects a fear of the implications for society, and another user pointing out that there is no evidence to support the claim that IQ is genetically determined. The discussion also touches on the operational definitions of intelligence and the potential implications of accepting IQ as a valid science, including the allocation of resources for equal opportunity programs, the potential for corrupt political activity, and the establishment of targeted social programs.Experts on Hacker News are debating the role of IQ in society and AI research. Some argue that understanding IQ as largely genetic would improve resource allocation, while others warn against eugenicist arguments. The validity and heritability of IQ have been discussed, but some suggest that IQ has lost relevance to modern psychology. Researchers are also examining IQ data in other countries to address potential biases. Overall, the debate highlights the complexities of measuring intelligence and the ethical considerations when discussing genetics and resource allocation.New research shows that IQ scores in developed countries have decreased steadily since the 1970s while spatial reasoning has gone up, prompting many to suggest the rise of video games as a possible factor. However, some attribute the decline to income inequality and reductions in wages, the prevalence of safety measures and an increase in the number of larger family sizes among lower-income families. Despite the widespread use of these tests, some claim that IQ research has no theory of behaviour other than this hypothetical general intelligence with no successful double blind trials to back up its claims. Meanwhile, other experts have suggested IQ tests are useful in several areas including college admissions, magnet schools and military recruitment.Five children, including two born addicted to heroin, have apparently succeeded in Darwinian terms, and one of them is now confidently pursuing a career in retail management. The relationship between education and IQ was discussed in the comments, with one user pointing out that while education and IQ may be correlated, there are other factors involved, and IQ itself is disputed as a reliable measure of intelligence. Some users argued that dismissing someone's intellect based on their profession may be unfair and pointed to examples of highly intelligent individuals who worked in seemingly menial jobs. The IQ test was also criticized as being largely pseudoscientific. Overall, the post did not seem to have a clear central topic or significant new information.",
        "hn_summary": "American IQ scores are decreasing, indicating the \"Reverse Flynn effect.\" Yearly variations in IQ scores may point to issues with measurement validity. HN users debate whether raw scores on IQ tests can be compared across time and tests. Academics in humanities struggle to define critical thinking, with a shift away from teaching it in schools. The heritability of IQ is being discussed in the comments section, with some users pointing out that heritability does not necessarily mean genetic or biological factors are at play. Experts debate the role of IQ in society and AI research. IQ scores in developed countries have decreased since the 1970s, with possible factors including video games and income inequality. There is no clear central topic or significant new information in the post's comments."
    },
    {
        "id": 35507933,
        "timestamp": 1681087404,
        "title": "Using RP2040 PIO to drive a poorly-designed displa",
        "url": "http://dmitry.gr/?r=06.%20Thoughts&proj=09.ComplexPioMachines",
        "hn_url": "http://news.ycombinator.com/item?id=35507933",
        "content": "Dmitry.GR has developed a CPU-free driver using RP2040 PIO that supports a display with at least 160x160 resolution and a resistive touch screen, providing 1, 2, and 4 bpp grayscale, 8-bit indexed color, and 16-bit full-color modes. The display is poorly designed according to users, and the sample code is beyond awful, making screen updating a challenge. Despite the lack of an indexed color or grayscale support, touch data can be copied to memory, allowing users to explore further. The maximum possible framerate in ideal conditions is 50.86fps, but noise requires touch to be sampled precisely, subtracting some CPU-free time.A new article on RP2040 microcontroller discusses using a display controller alongside DMA and PIO machinery. The post describes the creation of different modes, including 1bpp, 2bpp and 4bpp modes, with 16, 4 and 2 greyscales respectively and an indexed-colors mode. One DMA channel is used to program another to copy actual RGB565 values to the display, while a bidirectional pushback mechanism is used to allow touch sampling. The post explains that while working on the project, the author ran into an issue with DMA chaining, which was resolved by always triggering a channel using certain register addresses.A touch display is unreliable due to noise and improper sampling, while also sharing an SPI bus with an SD card; it is suggested to wire the SD card to different pins for better performance. The clock speed should be set correctly to avoid data being sent too fast for the display to handle. The setup involves bit-banging SPI using GPIO until enabling all machinery, and API includes dispSetDepth(), dispSetClut(), dispInit(), dispOn()/dispOff(). The code can be downloaded with a BSD 2-clause license, and can be modified for use with Arduino or Micropython.",
        "summary": "Dmitry.GR has developed a CPU-free driver with RP2040 PIO for a display supporting multiple modes and touch screen. However, the display is poorly designed and the sample code is challenging. Despite some limitations, touch data can be copied to memory for further use. An article discusses different modes using a display controller, DMA and PIO machinery, and DMA chaining issues. Touch display poses challenges due to noise and improper sampling and sharing an SPI bus with an SD card. The setup involves bit-banging SPI using GPIO with API for display functions, with BSD 2-clause licensed code available for download and modification.",
        "hn_title": "Using RP2040 PIO to drive a poorly-designed displa",
        "original_title": "Using RP2040 PIO to drive a poorly-designed displa",
        "score": 172,
        "hn_content": "Dmitrygr shared on Hacker News how to use RP2040 PIO to drive a poorly-designed display with touch and display on the same SPI bus. Other users commented on the flexibility of the DMA units, temporal resolution, and oversampling for smoothing. The post stands out due to its unique tech details and ability to offload the work to the PIO. This is not a dull post on a new technology as it provides insights on how to drive an outdated design. The readers are experts in the tech field, and the post offers a new and exciting solution to an old problem.A user on Hacker News presents their project using the PIO (Programmable IO) system on a RP2040 microcontroller to drive a Waveshare 2.8-inch TFT touch display with minimal CPU usage. This is accomplished by creating a custom PIO program that runs directly on the display's pins to handle all the graphics tasks, bypassing the need for DMA or software updates. Other users express their admiration and interest in the project and PIOs' potential use for handling interfaces like flash or cursed displays found on AliExpress. The article reminds readers that PIOs can be used to manage various peripheral hardware resources creatively by efficiently utilizing the CPU to perform more demanding tasks.An HN user reveals that the RP2040 is a $1 MCU that can be overclocked to 300MHz. Another user suggests that the ubiquitous ILI9488 3.5 in displays with resistive touch screen for less than $6 (not including shipping) could work. However, the original poster needs a screen with less pixels (320x240) due to RAM limitations. The comments include discussions regarding various types of screens and MCUs and their prices for those looking to experiment with the original poster's project.",
        "hn_summary": "An HN user shared how to use RP2040 PIO to drive a poorly-designed display with touch on the same SPI bus. Others discussed temporal resolution, oversampling, and DMA. The post offers unique tech details and a new solution to an old problem. PIOs can creatively manage various peripheral hardware resources by efficiently utilizing the CPU. The comments discuss the RP2040's overclocking and suggest alternative screens and MCUs."
    },
    {
        "id": 35510413,
        "timestamp": 1681116922,
        "title": "Hacker News Ranking Algorithm",
        "url": "https://vigneshwarar.substack.com/p/hackernews-ranking-algorithm-how",
        "hn_url": "http://news.ycombinator.com/item?id=35510413",
        "content": "HackerNews Ranking Algorithm: How would you have done it?Vigneshwarar’s NewsletterSubscribeSign inShare this postHackerNews Ranking Algorithmvigneshwarar.substack.comCopy linkTwitterFacebookEmailHackerNews Ranking AlgorithmHere's a small thought experiment that explores an alternative approach to ranking posts on HackerNews.VigneshwararApr 974Share this postHackerNews Ranking Algorithmvigneshwarar.substack.comCopy linkTwitterFacebookEmailOne of my favorite sites to visit daily is HackerNews(HN), it never failed me to deliver good quality links and very interesting discussions. This is just a small thought experiment for a different ranking algorithm for HN. There's nothing wrong with the current one, but it's just a small thought experiment.Just to refresh, according to Paul Graham's comment and FAQ, the HN algorithm is...\\(rank = {\\frac {P - 1}{(T + 2)^G}}\\)P = Points T = Age in hoursG = 1.8Minus one removes the user's own upvote. By default, HN upvotes its own user submission.I’ve seen one with penalties but let’s stick to what’s official. Also, I just did a quick Grep search and found this article and wonderful repo about “Reverse Engineering the Hacker News Ranking Algorithm“Intuitively, the ranking algorithm is simple: the more upvotes a link receives in a short amount of time, the higher it will be ranked at the top. As time passes, the post will gradually move down the rankings.Here is my approachI can't find the official page on why Paul Graham created HN, but to me, HN is the place to find the most interesting links and have a healthy discussion about various topics. In fact, discussions are my favorite part, except for the useless comments.Given that discussions are my favorite part, why don't we apply PageRank for every user based on the upvotes they receive for the comments they leave on any post, and replace the P (points) value in the current version of the HN algorithm?PageRank is an algorithm created by the founders of Google. It is used to determine the popularity of web pages on the internet.By the way, the name PageRank did not suit this use case. I am going to call it HackerRank (HR). Here is a visualization if you are trying to picture it.Since it's likely that one user may upvote multiple comments from the same user, we check whether a user has already upvoted a comment from that specific user before considering their upvote. In other words, we treat user profiles as nodes and upvotes for comments as edges.Considering this, a HackerRank user profile will look like this:\\(HR_{i}={\\frac {1-D}{N}}+D\\,\\sum _{{j\\in \\{1,\\dots ,n\\}}}{\\frac {HR_{j}}{TU_{j}}}\\)N = Total number of user profiles on HND = Damping factorHR = HackerRank score for the user who upvotedTU = Total upvotes givenBy default, the HR for every profile will be 1/N.But I won't consider HackerRank as it is. Sometimes, HN comments are inappropriate, and they will be flagged. We should consider the flagging because, remember, HN should be a place to have healthy discussions. Let's consider that 1 flag equals a deduction of 20% from the HR score. However, we will only take into account the flags received in the current month, as people can change from being unpleasant to becoming better human beings.So, HR with “flag” consideration will look like this.\\(HR_{with flag} = HR - ((TF * FP) * HR)\\)\\(HR = max(0, \\space HR_{withflag})\\)TF = Total flags received in the current monthFP = Flag penalty which is 20%If HR is negative, then it will be 0.We now have HR for every user profile, so the final ranking algorithm will look like this by hooking HR into the current version of the HN algorithm.\\(rank_{i} = {\\frac {\\sum_{{j\\in \\{1,\\dots ,n\\}}} (HR_{j})}{(T + 2)^G}}\\)HR = HR value represents the HackerRank score of the profile that upvoted this postT = Age in hoursG = 1.8 This is a very simple approach, but here are some other ideas that are worth exploring.HackerRank score, which is also determined by the upvotes a user receives for their submissions.Reading time for the article.Track how well a website is performing on HN and put it on the front page if the website has a high reputation for performing well.Will I ever publicly write about how HN ranks posts if I am Dang (HN moderator)? No, because Pagerank can be manipulated by people despite its reputation. In fact, Pagerank is being exploited for years. Moreover, there are financial incentives for companies to get on the first page in HN.I would use HackerRank for ranking posts but publicly say that we are using original PaulGraham’s algorithm for ranking posts, and hide the upvotes for comments since it is powering HackerRank, also take some additional steps to avoid reverse engineering and rank manipulation.But, I am curious. How would you have done it? If you were designing the HN algorithm, please leave your thoughts in the comments. I am curious to know.Discussion on HN → https://news.ycombinator.com/item?id=35510413Plug: Hey, we are building a new kind of search engine. Our goal is to deliver authoritative and non-SEO-spammed results. Please check it out and let me know your feedback.Thanks for reading Vigneshwarar’s Newsletter! Subscribe for free to receive new posts and support my work.Subscribe4Share this postHackerNews Ranking Algorithmvigneshwarar.substack.comCopy linkTwitterFacebookEmail4 CommentsPasserby16 hr agoBeauty of current algorithm is its simple and easy to compute but most importantly anyone can submit the news and get a fair chance at it. Whether you are new user or old user, news is news and news trend based on votes. But your suggested algorithm (that requires 100 cpu and 128 gb ram btw but I digress) is very allowing the power to concentrate in a very few hands irrespective of the news value they submit. it very much incentivizing to create bots and voting rings and spam the site to harvest as much as votes as possible like stackoverflow.Expand full commentReply1 reply by VigneshwararJason18 hr agoGreat write up, but substack is messing up the formulas displayed after clicks. It really messed up the equations as it appears that anything after \"\\\" is escaped from latex rendering.Expand full commentReply1 reply by Vigneshwarar2 more comments…Ready for more?Subscribe© 2023 VigneshwararPrivacy ∙ Terms ∙ Collection notice Start WritingGet the appSubstack is the home for great writing    This site requires JavaScript to run correctly. Please turn on JavaScript or unblock scripts",
        "summary": "The author proposes an alternative ranking algorithm for Hacker News (HN), where the current algorithm only considers the number of upvotes for a link, but the new algorithm also considers upvotes for comments. The proposed algorithm utilizes PageRank and a flag penalty to promote healthy discussions and profiles with higher HackerRank scores. The main idea is to rank posts based not only on the popularity of the link but also on the quality of the discussion. The author invites readers to share their thoughts on how they would have designed the HN algorithm.",
        "hn_title": "Hacker News Ranking Algorithm",
        "original_title": "Hacker News Ranking Algorithm",
        "score": 171,
        "hn_content": "The Hacker News Ranking Algorithm is the focus of a recent post on substack.com, with users discussing the pros and cons of using PageRank and other algorithms. One commenter suggests that the entirety of HN's codebase should be made public, while others caution against using PageRank due to the potential for manipulation. Some users question the necessity of having a ranking/voting system at all, while others suggest using reading time and word count as starting points for determining rankings. The author suggests adding a decay factor for PageRank to encourage active engagement in the community.Comments on a Hacker News article discuss the ambiguous nature of the upvote button, highlighting the need for two dimensions: one for the quality of the comment, the other for alignment with the voter's perspective. Some suggest the LessWrong forum's split between “upvotes/downvotes” and “agree/disagree” could be a possible solution. Other users note shortcomings in the system for comment-ranking within an article, specifically with the conversational flow and difficulty in catching up with comments later on an article. An interface that prioritizes high-quality comments and popular viewpoints during various modes may offer the best solution.Hacker News users discuss the flaws of social media websites in concentrating power among a few users with massive influence. Users try to reverse-engineer the HN ranking algorithm by discussing and suggesting new metrics to improve it. The post includes a discussion on how HN started and the nature of the site. There are also suggestions on how to make commenting on HN better. HN users reflect on the possible trade-offs of using machine learning to rank content on the site. Some HN users resist the idea of implementing a reputation-based ranking system in the site. Other suggestions were given such as using downvotes to regulate content. Users point out the potential impacts of adding more complexity and tabs. HN users discuss ways to detect and handle manipulated postings on the site.An HN user suggests changing HN's algorithm to fix several problems, including spam and the exclusion of valuable users. The proposal involves creating a bipartite graph of users and comments and using upvotes and flags as directed edges. Another user explains the \"gameability\" of PageRank and provides a solution to personalize each user's PageRank based on their past upvotes. Some comments argue against changing HN's algorithm, while others point out issues with the current system, such as mass flagging and the rapid disappearance of popular posts.The article warns against the use of HN for political discussions and encourages curiosity. There is a distinction that must be made to weigh whether a post is on-topic based on the framing. HN seems suitable for engaging in discussions, as comments that do not contribute or are inappropriate do not remain visible for long. Even though some may disagree on what to upvote, the community could uphold guidelines. The blog post cited is confused, but it touches upon the potential gaming of HN ranking. Despite any issues with HN, it is best not to fix what is not broken.",
        "hn_summary": "Users discuss pros and cons of Hacker News ranking algorithm and PageRank, suggest new metrics and personalizing PageRank, caution against potential manipulation, and propose bipartite graph. Some users question ranking/voting system's necessity and suggest prioritizing high-quality and popular comments. The upvote button's ambiguous nature suggests two dimensions for quality and alignment. Some users note shortcomings in comment-ranking and discuss detecting/managing manipulated postings. The article warns against politicizing and encourages curiosity; HN is best left unchanged."
    },
    {
        "id": 35518032,
        "timestamp": 1681164854,
        "title": "Shutting down nuclear power could increase air pollution: study",
        "url": "https://news.mit.edu/2023/study-shutting-down-nuclear-power-could-increase-air-pollution-0410",
        "hn_url": "http://news.ycombinator.com/item?id=35518032",
        "content": "Shutting down all of the US nuclear plants could increase air pollution and result in over 5,000 pollution-related deaths, according to a study by MIT researchers. Coal, oil, and natural gas would increase air pollution if nuclear power were phased out, increasing pollution-related deaths. However, if renewable energy sources became increasingly available to replace nuclear plants, pollution-related deaths should drop. Black communities who are primarily based near fossil fuel plants would experience the largest exposure to increased pollution. Overall, the study reveals that air quality has not been adequately discussed in conversations regarding the power of nuclear plant closures.MIT's Center for Transportation and Logistics examines automation's impact on jobs. Scientists map winds in a neutron star system to understand galaxy formation. MIT develops D2X, a tool to debug domain-specific programming languages. MIT engineers create modeling framework to speed up development of flow batteries. MIT mourns Nelson Yuan-sheng Kiang, who conducted pioneering research on auditory physiology. Runako Gentles, an environmental engineering major, seeks to lead projects to improve society's relationship with the environment.",
        "summary": "Shutting down US nuclear plants may raise air pollution by over 5,000 deaths, MIT researchers warned. The increase in pollution will be due to coal, oil, and gas being used instead. Renewables replacing nuclear plants, however, may reduce pollution-related deaths. The Black community will be most exposed to increased pollution as these groups tend to live closer to fossil fuel plants. The MIT study indicates that air quality hasn't been fully addressed in conversations about closing nuclear plants.",
        "hn_title": "Shutting down nuclear power could increase air pollution: study",
        "original_title": "Shutting down nuclear power could increase air pollution: study",
        "score": 167,
        "hn_content": "Shutting down nuclear power plants could lead to an increase in air pollution, according to a study from MIT. Commentators on Hacker News questioned the validity of the report, with some differing on the degree of air pollution caused by nuclear power and the nature of its replacement. Some remarks included sarcastic comments and were flagged as inappropriate. Nonetheless, nuclear power is considered to be a more efficient and cleaner alternative to fossil fuels.The comparison of the US to individual western countries in news outlets is often misleading but seemingly popular, according to some HN users. A comment pointed out that while the US has more nuclear reactors operating per person than the EU, over half of the EU's reactors are deployed in France. Another user added that France enjoys the lowest per capita CO2 emissions for electrical generation in the world, and the parent commenter countered with the downsides of nuclear energy. There is a debate over whether the US would be better off with nuclear or by investing in renewables.News outlets are unfairly comparing the US to other countries, which is misleading and marginalises the reader's understanding of competing arguments; darknavi asks if EU nations have a nuclear agreement to work together in space, to which c4mpute replies EURATOM is not running any commercial reactors, and acts more as a political body for control and exchange of knowledge; opinion on nuclear power is divided, some argue it could become a vital solution while others argue it isn't safe; advocates also established that modern nuclear reactors are safer than legacy reactors such as the Chernobyl and Fukushima reactors, but its opponents believe the tail risk is enormous; finally, dam failures are responsible for most hydroelectric power disaster casualties in history, Chinese dam failure is responsible for the majority of dam-related deaths.A conversation on Hacker News about nuclear power vs. other forms of energy highlights concerns over radioactive pollution but also acknowledges that the risk profile of nuclear power is different than other forms of power. The discussion also touches on the cost of renewable energy versus nuclear, the concerns over accidents and their potential harm to the biosphere, and the need for seasonal storage. Many believe nuclear power is too expensive and takes too long to build, but others suggest scaling it up could make it cheaper and safer. The conversation overall emphasizes the need for investment in renewables and a long-term strategy for energy production.Comments on a Hacker News post about nuclear power and renewable energy cover a variety of topics, including cost, regulation, and safety concerns. One user laments the political polarization around different forms of energy and proposes a technology-independent law for power plant accidents. Another user notes the success of Germany's rapid decarbonization without nuclear power but receiving less criticism than coal-heavy Poland due to not appearing to make nuclear look unnecessary. The discussion also covers the cost of building new nuclear power plants and the risk of disasters in newer generations of reactors. Despite the risks, some users favor nuclear power over fossil fuels, citing the latter's immediate health hazards and contribution to climate change. The potential of fusion power remains a topic of conversation, with some predicting it will be attainable in 50 years or so, though there is skepticism based on previous optimistic predictions.Comments on a Hacker News post discuss the potential limitations of nuclear power towards energy transition. Some comments suggest the need for significant energy production for possible future use of fusion power technology. However, others argue the dangers of nuclear power and the advantages of wind energy as an alternative. The comments also highlight various benefits of wind energy production over solar energy, such as lower land use per GW and lesser costs for operations and maintenance. There are also concerns about China's heavy reliance on the solar supply chain.",
        "hn_summary": "A study by MIT reveals that shutting down nuclear power plants could lead to increased air pollution. Commentators on Hacker News are divided on the degree and nature of the air pollution caused by nuclear power, comparing the US to other countries. Views on nuclear power are polarized with concerns over radioactive pollution, regulation, and safety, but some consider it a cleaner and more efficient option than fossil fuels. There is a need for investment in renewables and long-term energy strategy. The potential of fusion power is discussed, and concerns are raised about China's heavy reliance on the solar supply chain."
    },
    {
        "id": 35510612,
        "timestamp": 1681119608,
        "title": "Apple's plunge in PC shipments is steepest among major computer makers",
        "url": "https://www.bloomberg.com/news/articles/2023-04-10/apple-s-40-plunge-leads-pc-shipments-down-as-tech-demand-sags",
        "hn_url": "http://news.ycombinator.com/item?id=35510612",
        "content": "AAPL: Apple's 40% Plunge in Mac Shipments Is Worst Since 2000 - BloombergSkip to contentSkip to contentBloomberg the Company & Its ProductsThe Company & its ProductsBloomberg Terminal Demo RequestBloomberg Anywhere Remote LoginBloomberg Anywhere LoginBloomberg Customer SupportCustomer Support        Switch Editions    UK   Europe   US   Asia   Middle East   Africa   日本    Sign In Subscribe        Live Now  Bloomberg TV+      Bloomberg Daybreak Middle East Bloomberg Daybreak Middle East. Live from Dubai, connecting Asian markets to the European opens. The show will focus on global macro issues with a middle eastern context, provide expert analysis of major market moving stories and speak with the biggest newsmakers in the region.   Bloomberg Radio      BTV Simulcast A live simulcast of Bloomberg Television. Listen   Bloomberg Originals      Idea Generation: Dwyane Wade On the Season 2 premiere of Idea Generation, NBA legend and entrepreneur Dwyane Wade takes us on a journey from his early days as a young basketball player growing up in Chicago, to achieving NBA superstardom, to building a brand around himself while also venturing into media, wine and team ownership. Wade has sought to balance business and basketball, and has arguably achieved that goal as well as anyone who ever stepped on a court. In this episode, he explains what kind of dedication it took to make it to the NBA and stay there, and how he was able to succeed off the court, too.   Also streaming on your TV:                Markets  Markets   Deals  Odd Lots  The FIX | Fixed Income  ETFs  FX  Factor Investing  Alternative Investing  Economic Calendar  Markets Magazine         Markets Investors Learned From Pelosi Playbook as Taiwan Tensions Swirl         Markets Warren Buffett Increased Stakes in Japan Trading Houses, Nikkei Says    Market Data  Stocks  Commodities  Rates & Bonds  Currencies  Futures  Sectors   View More Markets   Economics  Economics   Indicators  Central Banks  Jobs  Trade  Tax & Spend  Inflation & Prices         Economics Tumbling Money Supply Alarms Economists Who Foresaw Inflation         Central Banks Bank of Korea to Keep Policy Restrictive After Standing Pat         Economics British Households Cut Luxuries and Dining Out After Prices Jump    View More Economics   Industries  Industries   Consumer  Energy  Entertainment  Finance  Health  Legal  Real Estate  Telecom  Transportation         Businessweek Airbnb Cuts Ties With Sean Penn’s Nonprofit, Amazon Weighs Next Move         Equality US Seeks Freeze on Texas Abortion Pill Ruling, Clarity on Conflicting Order    Featured  Business of Sports   View More Industries   Technology  Technology   Code Wars  Checkout  Prognosis         Technology Gig Workers Can Organize Without Fearing Antitrust, Bedoya Says         Technology South Korea Fines Google $32 Million for Squeezing Local Rival         Technology AI ‘Trustworthiness’ Is Focal Point of New US Government Inquiry    View More Technology   Politics  Politics   US  UK  Americas  Europe  Asia  Middle East         Politics Biden to Retrace Roots in Celebratory Irish Tour Ahead of 2024         Politics Swiss Government Set for Grilling Over UBS-Credit Suisse Deal    Featured  Next China   View More Politics   Wealth  Wealth   Investing  Living  Opinion & Advice  Savings & Retirement  Taxes  Reinvention         The Big Take Rich Chinese Splashing Out on Luxury Have Yet to Invest Big in Singapore         Businessweek Airbnb Cuts Ties With Sean Penn’s Nonprofit, Amazon Weighs Next Move    Featured  How to Invest   View More Wealth   Pursuits  Pursuits   Travel  Autos  Homes  Living  Culture  Style         Screentime Movie-Theater Stocks Soar After ‘Super Mario’ Draws Crowds         Sports Ryan Reynolds, Rob McElhenney Move Closer to Wrexham Dream    Featured  Screentime  New York Property Prices  Where to Go in 2022   View More Pursuits   Opinion  Opinion   Business  Finance  Economics  Markets  Politics & Policy  Technology & Ideas  Editorials  Letters         Lara Williams Tree-Planting Is No Solution Without Animals         Parmy Olson Whatever Happened to the Metaverse?         Chris Bryant and Andrea Felsted We’ve All Been Way Too Accepting of Inflation    View More Opinion   Businessweek  Businessweek   The Bloomberg 50  Best B-Schools  Small Business Survival Guide  50 Companies to Watch  Good Business  Subscribe to the Magazine         Feature A Runner’s Murder in Kenya Opens a Window Into Violence Against Women         Money What to Do With Your Money—and Your Life—in a Wild New World         Remarks AI Is Moving Fast Enough to Break Things. Sound Familiar?    View More Businessweek   Equality  Equality   Corporate Leadership  Capital  Society  Solutions         Equality Cracks Grow in Australian Opposition Over Indigenous Vote Stance         Equality Abortion Pill Still on Market Despite Judge’s Ruling to Pull It    Featured  In Trust Podcast   View More Equality   Green  Green   New Energy  ESG Investing  Weather & Science  Electric Vehicles  Climate Politics  Greener Living  Cleaner Tech         Green Western Australia Braces for Biggest Cyclone in Almost a Decade         Green Texas Grid Advances Proposal to Add $500 Million in Power Costs    Featured  Data Dash  Hyperdrive   View More Green   CityLab  CityLab   Design  Culture  Transportation  Economy  Environment  Housing  Justice  Government  Technology         CityLab Seoul Theater Chain Swaps Screens for Climbing Walls to Lure Young Koreans         Design Buildings That Can Heal in the Wake of Trauma         Design Inspired by Filipino Design, an Apartment Building Looks Homeward    View More CityLab   Crypto  Crypto   Decentralized Finance  NFTs  Regulation  Technology         QuickTake Why Crypto Is Watching Ethereum’s ‘Shanghai’ Upgrade         Feature Scaramucci’s SkyBridge Capital Was Spiraling, and Then Came FTX    View More Crypto    More                TechnologyApple’s 40% Plunge in PC Shipments Is Steepest Among Major Computer MakersCompany hit the hardest by slump dragging down all PC makersSilver lining may be the opportunity to overhaul productionApple’s PC Shipments Slide 40% as Demand SlowsByVlad Savov+FollowApril 10, 2023, 4:37 AM UTCUpdated onApril 10, 2023, 6:46 PM UTCListen to this article3:16Share this articleCopiedGiftGift this articleExitSubscriber BenefitBloomberg subscribers can gift up to 5 articles a month for anyone to read, even non-subscribers! Learn moreSubscribeSign InFollow the authors@vladsavov+ Get alerts forVlad SavovApple Inc.’s personal computer shipments declined by 40.5% in the first quarter, the worst drop since the final three months of 2000, after sluggish demand and an industrywide glut hit the Mac maker especially hard.Shipments by all PC makers combined slumped 29% to 56.9 million units — and fell below the levels of early 2019 — as the demand surge driven by pandemic-era remote work evaporated, according to IDC’s latest report. Among the market leaders, Lenovo Group Ltd. and Dell Technologies Inc. registered drops of more than 30%, while HP Inc. was down 24.2%. No major brand was spared from the slowdown, with Asustek Computer Inc. rounding out the top 5 with a 30.3% fall.Most ReadTechnologyApple’s 40% Plunge in PC Shipments Is Steepest Among Major Computer MakersBusinessFedEx Overhaul Contemplates a Future With No Drivers on PayrollMarketsBond Market Is Overplaying the Risk of a Deep RecessionTechnologyKatie Cotton, Who Led Apple’s Media Strategy for 18 Years, DiesPursuitsWorld’s Most Expensive Car License Plate Sells for $15 Million in DubaiTerms of ServiceTrademarksPrivacy Policy©2023 Bloomberg L.P. All Rights ReservedCareersMade in NYCAdvertiseAd ChoicesHelp",
        "summary": "Apple's PC shipments experienced a 40.5% decline, the largest since 2000, due to sluggish demand and industry-wide oversupply. This decline contributed to an overall 29% slump in PC shipments among leading brands, as the remote work demand surge driven by pandemic restrictions eased. Lenovo and Dell registered drops of over 30%, and no major brand was spared from the slowdown. The COVID-19 vaccine rollout and declining remote work trends might be facilitating a shift away from PCs, but it remains unclear whether this trend will continue in the long term.",
        "hn_title": "Apple’s plunge in PC shipments is steepest among major computer makers",
        "original_title": "Apple’s plunge in PC shipments is steepest among major computer makers",
        "score": 166,
        "hn_content": "Apple has seen the steepest plunge in PC shipments among major computer makers. However, some users are still reluctant to upgrade their Macbooks. The demand created during the pandemic showed an unusual spike. People with pre-2016 models upgraded to M1 models, which were a significant jump from Intel MBPs. Despite people upgrading, it seems that the M1 models will not need to be upgraded for a while. The performance increases were incremental, the most significant jump in performance was observed in the Air. The Macbooks' tight integration of the whole platform gives a better experience overall.Apple laptop users are using a patch to run Catalina despite it being past its end of life, while some users prefer to wait for an Mx upgrade, others are happy with their older models, and some are drawn towards the M1/M2 processor's longer battery life. The soldered memory boosts the machine's performance, but soldered storage can make it difficult for users requiring more storage space. Mac shipments have increased more than other PC makers, with Apple being the only company above its 2019 figures. The jump in demand might be correlated with the government's stimulus checks.Stimulus checks may have contributed to a surge in Macbook sales, especially the entry-level Macbook Air. The M1 processor and improved I/O and form factor may have also convinced customers to upgrade. Apple's success with the M1 means customers might not need to upgrade for a while. Many people find 8GB of RAM sufficient, and tech companies often provide their employees with Macbooks. However, some people are finding other options due to Apple moving away from Intel and not supporting GPU-intensive apps. Overall, it appears that Apple may continue to gain market share with its Macbooks.Discussion on the reliability of laptop PCs across different brands and comments on Apple's OneDrive equivalent, iCloud. Users debate the quality of hardware and operating systems between different manufacturers. The conversation turns to gaming capabilities, touchscreens as a mandatory option, and the decline of quality on hardware for Thinkpads. A user praises Apple's devices, claiming that they \"just work\", while others note the problems with sleep mode and speakers on Lenovo laptops. There is also speculation that Windows is \"spyware\", leading some to remove the entire operating system from their machines.While a user raves about the quality of a laptop they purchased from Apple, other users criticize the company's software and services, such as iCloud, for being subpar and lacking transparency. Commenters mention issues with sync time, lack of versioning, and poor diagnostics. Apple's upgrades for storage and RAM are also criticized for being expensive. In response, some users defend Apple, arguing that the company offers enterprise-grade SSDs and that alternatives to iCloud exist.Some Hacker News users are discussing why people are holding off from upgrading their Macs. Factors include financial shifts due to Covid-19 and the longevity of existing Macs among users, while some note the leap to M1 convinced them to upgrade. Some HN users report that their Macs are still working fine after six or more years, while others cite e-waste and cooling issues as reservations against purchasing a new Mac. A few users mention that traditional tech industries, banks or large enterprises still primarily use Windows machines. One user who recently bought an M1 states they don't feel tempted to replace theirs anytime soon.Apple users have different opinions about upgrading to newer models, with some preferring to stick with older devices that are still functional. Some users prefer desktop machines over smartphones or laptops, while others worry that desktop and laptop computers may become niche platforms. A debate ensues about whether people need Apple products or not, with comments about the cost and availability of alternatives. An argument also arises about whether smartphones could replace computers or not, with some users pointing out the limitations of the form factor. Overall, the comments highlight varying perspectives on the use and necessity of Apple products in light of changing economic and technological factors.Apple's declining sales may be due to everyone buying M-series laptops, leaving their macbook pipeline dry. The pandemic telework shift forced new purchases for many, reducing the number of people who think they need a new computer to be more productive. A sarcastic commenter claims that 99% of Apple customers don't know what an M1 processor is or why it matters, they just want something new and different. Others point out that EU pricing for Apple products is insane compared to other PC laptops with similar specs.Swedes are paying significantly more for MacBooks than Americans due to high tax rates, but some are joking it's cheaper to fly to the US, buy one there, and fly back. However, Americans should remember that foreign visitors must pay VAT and possible duty on goods at customs, otherwise, it's tax evasion. Some states in the US, like Delaware and Oregon, have no sales tax. Apple's pricing policies for its MacBooks are becoming too steep, according to some HN users, with lower-end models being too expensive for most non-tech users.While Apple's \"obsolete\" designation only means they will no longer get software updates, one HN user thinks that Linux would make the MacBook viable, saying that macOS is hostile. However, another user says that they have root access on their MacBook and can install any UNIX package using homebrew; there are few things a Linux workstation can do that a MacBook cannot, except for niche technologies. A HN user suggests that Apple would do well to support non-Apple software platforms, such as Linux, on Apple hardware. Another suggests that an Apple Linux gaming console based on a Mac Mini would not require many changes, but Apple would need to give up their proprietary 3D API in favor of a standard.MacBooks are praised for their longevity, with some users going up to 10+ years before replacement, even for development tasks. Despite high sales in 2020/2021, sales are expected to decrease due to the saturation of the market coupled with mobile devices taking over most computing needs. Apple's pricing model for the M1 generation was criticized by some users, who felt it was too expensive for what it offered. Asahi Linux for M1's is a great option for those who prefer a more work-oriented OS alongside their Mac. The debate on upgrading PC hardware is ongoing as CPUs and GPUs have been overpowered for all but niche markets.",
        "hn_summary": "Apple experiences significant drop in PC shipments, but demand for M1 models spiked during pandemic. Performance increases of M1 models were incremental with Air showing the most significant jump. Users reluctant to upgrade due to M1 models' longer battery life and not needing to upgrade for a while. Mac shipments increased while some still use pre-2016 models or patch Catalina. Soldered memory boosts performance while soldered storage is a limitation on storage space. Stimulus checks correlated with jump in Macbook sales. Varying opinions on whether to upgrade and use Apple products in light of economic and technological factors. Pricing policies for MacBooks criticized as too steep. MacBooks praised for longevity, and Asahi Linux a great option for those preferring a work-oriented OS."
    },
    {
        "id": 35512081,
        "timestamp": 1681133699,
        "title": "If you've raised venture capital, you have to pay yourself",
        "url": "https://techcrunch.com/2023/04/09/f-you-pay-me/",
        "hn_url": "http://news.ycombinator.com/item?id=35512081",
        "content": "TechCrunchTechCrunchWe'll be right back...Our engineers are working quickly to resolve the issue.Thank you for your patience.",
        "summary": "This is not the correct text for summarization as it is just an error message. No summary is needed.",
        "hn_title": "If you’ve raised venture capital, you have to pay yourself",
        "original_title": "If you’ve raised venture capital, you have to pay yourself",
        "score": 160,
        "hn_content": "An article on TechCrunch discusses founders paying themselves salaries once they receive venture capital funding. An HN user suggests a graduated pay system based on revenue growth, while others note that non-founder employees may not benefit as much from equity compared to working for established companies. A user suggests co-ops as a potential solution to sharing rewards. It is acknowledged that many employees overvalue startup equity, but this may be changing. Founders are encouraged to pay employees closer to market rate.Tech industry employees should focus on getting what's best for them, as they are adults who can choose what works. A startup CEO shares his experience with paying himself a salary, and suggests that founders should pay themselves enough to focus on growing their business without worrying about personal finances. Equity valuation and the value of work are the most challenging aspects to consider in compensation. Crypto startup compensation is competing with FAANG startups, and most of them offer additional, liquid non-cash compensation. Finally, some people have high expectations for the industry, while others find $130K to be a reasonable salary for entry-level employees.Entrepreneurship requires paying oneself fairly for legal reasons, as advised by both lawyers and tax accountants. However, determining an appropriate salary can be challenging since it's tricky to balance the company's financial stability while providing a reasonable compensation. Startups receiving venture capital often face the obstacle of balancing market-competitive compensation packages with retaining equity. While paying oneself equitably is a must-do, the counter-argument is often that starting a profitable bootstrapped business is risky and can sometimes still fail to turn a profit. Receiving below-market-rate pay can result in founder burnout, so a salary that mimics what one would expect to pay a salaried employee could be an optimum solution.Tech Times reports on a diverse set of comments on Hacker News regarding payment and compensation for startup founders. One comment notes that great caution should be taken with regards to venture capital, as, \"if you've raised venture capital, you have let the leaches in.\" Another comment argues that startup founders should be compensated generously, provided the salary doesn't overly drain company funds. A third comment states that founders should pay themselves comfortably and charge investors a carry only after becoming a unicorn. Several comments also discuss personal experiences with compensation and startup investment.",
        "hn_summary": "HN users discuss founder salaries after venture capital funding. Graduated pay system suggested based on revenue growth. Non-founder employees may not benefit from equity as much as established companies. Co-ops suggested as a way to share rewards. Some employees overvalue startup equity. Startup CEO recommends paying oneself enough to focus on growing the business. Founders encouraged to pay employees closer to market rate. Difficult to balance company financial stability with reasonable compensation. Paying oneself equitably a must-do, but starting a profitable bootstrapped business is risky. Founders should avoid burnout by paying a salary that mimics what would be paid to a salaried employee. Caution advised with venture capital. Founders should be compensated generously if salary doesn't overly drain company funds. Personal experiences with compensation and startup investment discussed. Tech industry employees should focus on getting what's best for them."
    },
    {
        "id": 35508677,
        "timestamp": 1681094822,
        "title": "The Kissimmee River has been brought back to life, & wildlife is thriving",
        "url": "https://www.nationalgeographic.com/environment/article/kissimmee-biggest-river-restoration-ever-completed",
        "hn_url": "http://news.ycombinator.com/item?id=35508677",
        "content": "The Kissimmee River has been brought back to life—and wildlife is thrivingSkip to contentNewslettersSubscribeMenuEnvironmentDeep in Florida, an ‘ecological disaster’ has been reversed—and wildlife is thrivingMuch of Florida’s Kissimmee River has been restored to its natural state, a milestone worth celebrating—and learning from.The Kissimmee’s meandering floodplains teemed with life before they were diverted into a straight canal a half century ago. A recently completed project has restored the curves—seen here—and replenished the wetlands. The waterfowl, raptors, fish, and mammals are returning.ByDouglas MainPhotographs ByCarlton Ward Jr.Published April 6, 2023• 8 min readShareTweetEmailIf you’ve been to Disney World in Orlando, you’ve been to the Northern Everglades. Much of the water within the famous “river of grass” originates in Central Florida and flows south via the Kissimmee River—one of the more important and lesser-known waterways nationwide.Sixty years ago, the Kissimmee meandered for more than 100 miles from the Kissimmee Chain of Lakes to Lake Okeechobee, and its floodplains were home to seasonal wetlands rich with life. But in the 1940s, in response to flooding and hurricanes, the state asked the federal government to help build a sprawling network of canals and waterways to drain the land.The Army Corps of Engineers complied and, beginning in the 1960s, turned the meandering Kissimmee into a 30-foot-deep,Unlock this story for freeCreate an account to read the full story and get unlimited access to hundreds of Nat Geo articles.Sign Upfor your free account. If you already have an account,Sign In.Unlock this story for freeWant the full story? Sign up to keep reading and unlock hundreds of Nat Geo articles for free.CREATE ACCOUNTAlready have an account?SIGN INRead This NextWhy we still haven’t caught the world’s largest fishAnimalsWhy we still haven’t caught the world’s largest fishNat Geo Explorer Zeb Hogan has spent decades asking the question. “I thought there would be a simple answer,” he now concedes, after recording a 661-pound stingray. “I was wrong.”This ship hoped to usher in an age of nuclear-powered travelHistory & CultureThis ship hoped to usher in an age of nuclear-powered travelThe N.S. Savannah was built to introduce an atomic age of super-clean, hyper-efficient sailing vessels, but ended up a relic in Baltimore Harbor. Why?See what a year looks like in the fastest-warming place on EarthEnvironmentSee what a year looks like in the fastest-warming place on EarthMelting fjords, increasing avalanches, imperiled wildlife. Our photographer documented the effects of climate change through all four seasons in Svalbard, Norway.Want to help wildlife? Turn off your lights.EnvironmentWant to help wildlife? Turn off your lights.It’s not just about seeing the stars. Bright city lights disorient animals like birds, leading to fatal collisions and potential long-term damage to their health.Go FurtherAnimalsWhy we still haven’t caught the world’s largest fishAnimalsWhy we still haven’t caught the world’s largest fishEnter the weird world of the echidna—a mammal in a category all its ownAnimalsBasic InstinctsEnter the weird world of the echidna—a mammal in a category all its ownCan these 'ghost bears' be resurrected? The U.S. may soon find out.AnimalsCan these 'ghost bears' be resurrected? The U.S. may soon find out.See what a year looks like in the fastest-warming place on EarthEnvironmentSee what a year looks like in the fastest-warming place on EarthWhy Easter is bad for ducksAnimalsWhy Easter is bad for ducksSee the flamboyant grandeur of the common betta fishAnimalsProofSee the flamboyant grandeur of the common betta fishEnvironmentFast fashion goes to die in this Chilean desertEnvironmentFast fashion goes to die in this Chilean desertSea level rise, explainedEnvironmentSea level rise, explainedBehold the surreal magic and mystery of slime moldsEnvironmentBehold the surreal magic and mystery of slime moldsCan Florida bring a river back to life?EnvironmentCan Florida bring a river back to life?See what a year looks like in the fastest-warming place on EarthEnvironmentSee what a year looks like in the fastest-warming place on EarthWant to help wildlife? Turn off your lights.EnvironmentWant to help wildlife? Turn off your lights.History & CultureHow does a magician trick other magicians? We went to find out.History & CultureHow does a magician trick other magicians? We went to find out.European ‘shamans’ took psychedelic drugs 3,000 years agoHistory & CultureEuropean ‘shamans’ took psychedelic drugs 3,000 years agoSee the myth of Hercules carved into this ancient sarcophagusHistory MagazineSee the myth of Hercules carved into this ancient sarcophagusThis ship hoped to usher in an age of nuclear-powered travelHistory & CultureThis ship hoped to usher in an age of nuclear-powered travelYou know how it sank. How was the Titanic dreamed up?History MagazineYou know how it sank. How was the Titanic dreamed up?How did England’s ‘lost king’ end up beneath a parking lot?History & CultureHow did England’s ‘lost king’ end up beneath a parking lot?ScienceHow amber creates exquisite fossilsScienceBreakthroughsHow amber creates exquisite fossilsYour eyes may be a window into early Alzheimer's detectionScienceYour eyes may be a window into early Alzheimer's detectionSimply cutting carbs and fat is not a guarantee for losing weightScienceMind, Body, WonderSimply cutting carbs and fat is not a guarantee for losing weightThe ongoing mystery of hiccupsScienceThe ongoing mystery of hiccupsLosing weight leads to better health? Not necessarilyScienceMind, Body, WonderLosing weight leads to better health? Not necessarilyNASA reveals Artemis II crew, the first moon astronauts in 50 yearsScienceNASA reveals Artemis II crew, the first moon astronauts in 50 yearsTravelNorth Carolina experiences await beyond RaleighPaid Content for AdvertiserNorth Carolina experiences await beyond RaleighThis ancient Dutch goddess was nearly lost to time—and rising seasTravelThis ancient Dutch goddess was nearly lost to time—and rising seas6 of the best Sir David Attenborough series to watchTravel6 of the best Sir David Attenborough series to watchThe Masterclasses 2023: tips to help you succeed as a travel photographerTravelThe Masterclasses 2023: tips to help you succeed as a travel photographerWhy choose the Alps for your next summer adventureTravelWhy choose the Alps for your next summer adventureThe Masterclasses 2023: travel writing tips from our expertsTravelThe Masterclasses 2023: travel writing tips from our expertsSubscriber Exclusive ContentpreviousMagazineWhy are people so dang obsessed with Mars?ReadMagazineHow viruses shape our worldReadAnimalsThe era of greyhound racing in the U.S. is coming to an endReadMagazineSee how people have imagined life on Mars through historyReadMagazineSee how NASA’s new Mars rover will explore the red planetExploreMagazineWhy are people so dang obsessed with Mars?ReadMagazineHow viruses shape our worldReadAnimalsThe era of greyhound racing in the U.S. is coming to an endReadMagazineSee how people have imagined life on Mars through historyReadMagazineSee how NASA’s new Mars rover will explore the red planetExploreMagazineWhy are people so dang obsessed with Mars?ReadMagazineHow viruses shape our worldReadAnimalsThe era of greyhound racing in the U.S. is coming to an endReadMagazineSee how people have imagined life on Mars through historyReadMagazineSee how NASA’s new Mars rover will explore the red planetExplorenext        See MoreLegalTerms of UsePrivacy PolicyYour US State Privacy RightsChildren's Online Privacy PolicyInterest-Based AdsAbout Nielsen MeasurementDo Not Sell or Share My Personal InformationOur SitesNat Geo HomeAttend a Live EventBook a TripBuy MapsInspire Your KidsShop Nat GeoVisit the D.C. MuseumWatch TVLearn About Our ImpactSupport our MissionNat Geo PartnersMastheadPress RoomAdvertise With UsJoin UsSubscribeCustomer ServiceRenew SubscriptionManage Your SubscriptionWork at NatGeoSignup for Our NewslettersContribute to Protect the PlanetPitch a StoryFollow usNational Geographic FacebookNational Geographic TwitterNational Geographic InstagramUnited States (Change)Copyright © 1996-2015 National Geographic SocietyCopyright © 2015-2023 National Geographic Partners, LLC. All rights reserved",
        "summary": "The Kissimmee River in Florida has been returned to its natural state after decades of being diverted into a straight canal, which brings with it a range of wildlife. The river's meandering floodplains once housed seasonal wetlands with a plethora of life, but in the 1940s were converted into a network of canals and waterways by the Army Corps of Engineers. However, it has since been restored to its original form and its various bird, mammal, and fish species are slowly but surely returning.",
        "hn_title": "The Kissimmee River has been brought back to life, and wildlife is thriving",
        "original_title": "The Kissimmee River has been brought back to life, and wildlife is thriving",
        "score": 155,
        "hn_content": "The Kissimmee River has undergone costly and extensive restoration efforts that have proven successful, with 40 square miles of wetlands being reestablished and rehydrated. The restoration has aided in the thriving of wildlife in the area. HN users recommend watching the documentary Path of the Panther to understand the importance of Fla. wildlife reservations and refuge efforts. Governor DeSantis has made provisions for additional funding towards everglade restoration efforts, yet his policies on climate change and environmental protection have been criticized. Despite its natural gas generation, Florida has made a significant effort towards water and wetland management due to the state's low elevation and susceptibility to storms.Recent nuclear power losses in Florida have made average voters in the state wary of the technology, including the Crystal River plant, the planned expansion at Turkey Point, and Vogtle. FPL has been caught engaging in unethical political behavior in the state. The wealth in Florida is mainly collected in the lower half of the state, which is more vulnerable to climate change, and the state doesn't have the necessary resources to make changes on their own. With no state income tax, sales and real estate taxes make up a significant portion of Florida's revenue. Florida's budget is large enough to perform mitigating work if officials choose to, although budget allocation is a concern for some. Nixon-era environmental policies in the EPA skew towards big businesses. The cost-effectiveness of draining land and who receives the benefits of such actions is unclear.",
        "hn_summary": "The Kissimmee River underwent successful costly restoration, with wildlife thriving. Users recommend 'Path of the Panther' documentary. Governor DeSantis has received criticism for policies on environment and climate change. Despite natural gas generation, Florida prioritizes water and wetland management. Nuclear power losses in Florida make voters wary. FPL caught engaging in unethical political behavior. Wealth in vulnerable half, resources lacking. Florida's revenue from taxes. Budget allocation concern. EPA policies skew towards big businesses. Cost-effectiveness of draining land unknown."
    },
    {
        "id": 35514799,
        "timestamp": 1681147579,
        "title": "Use GitHub Actions to Make Your GitHub Profile Dynamic",
        "url": "https://www.bengreenberg.dev/posts/2023-04-09-github-profile-dynamic-content/",
        "hn_url": "http://news.ycombinator.com/item?id=35514799",
        "content": "Ben Greenberg | Developer Advocateskip to main content About Blog Home Projects Talks WritingsAbout Writings Talks Projects BlogUse GitHub Actions to Make Your GitHub Profile DynamicBen GreenbergApril 9, 2023Where do people first discover you online? Perhaps your social media presence is the first thing people find when they search for you, or perhaps it’s the portfolio site you created for yourself. However, if you use GitHub to share your code and participate in open source projects, then your GitHub profile may be the first place people go to in order to learn more about you.What do you want your GitHub profile to say about you? How do you want to express what is important to you and who you are in a concise and easy to read manner for visitors? Whether they are a prospective employer or a prospective partner in an open source project, it’s imperative you have a profile that stands out.Using GitHub Actions, you can turn a static markdown document into a dynamic experience that stays up to date on the latest information about you. How do you do that?I’ll show you an example of how you can do this quickly and without too much effort. In this example, you’ll learn how to scrape a website and use that data to dynamically update your GitHub profile. We’ll show this example in Ruby, but you can do this with JavaScript, TypeScript, Python, or other languages.How Your GitHub Profile WorksYour GitHub profile is found by going to github.com/[your-username] in a web browser, here’s mine for example. Where does the content for that view come from?It lives in a special repository in your account with the name of your account username. If you do not have this repository yet, you will not see any special content when you visit github.com/[your-username], so the first step is to ensure you have that repository created, and if you do not, go ahead and create it.Exploring the files in the profile repositoryThe only required file in the repository is a README.md file that is the source of your profile page../├── README.mdGo ahead and add some content in that file, save it, and refresh your username homepage, and you will see that content reflected there.Adding the right folders for dynamic contentBefore we create the code to make our profile dynamic, let’s add the folder structure.Inside the top-level add a new folder called .github and inside .github add two new sub-folders: scripts/ and workflows/.Your file structure should now look like this:./├── .github/│  ├── scripts/│  └── workflows/└── README.mdMaking a Dynamic ProfileWe need to do three things for this example:Define a place in the README where the dynamic content will beAdd a script inside scripts/ that will do the scraping workAdd a workflow for GitHub Actions inside workflows/ that will run the script on a scheduleLet’s do each of those steps now.Updating the READMEWe need to add a section to the README that can be grabbed using Regex by the script to modify. It can be whatever you need it to be for your specific use case. For this example, we’ll add a section for recent blog posts in the README.Open up the README.md file in a code editor and add the following:### Recent blog postsNow we have an area for the script to find.Creating the scriptThe example script we are building is written in Ruby and uses the GitHub gem octokit to interact with your repository, the nokogiri gem to scrape the website, and the httparty gem to make the HTTP request.In this example below, the element to be scraped has already been identified. In your own use case, you’ll need to discover the path to the element on the site you wish to scrape, and it will undoubtedly be different than what is shown below as defined in the posts variable and for each title and link of each post.Here is the example code, which goes in the scripts/ folder:require 'httparty'require 'nokogiri'require 'octokit'# Scrape blog posts from the websiteurl = \"https://www.bengreenberg.dev/blog/\"response = HTTParty.get(url)parsed_page = Nokogiri::HTML(response.body)posts = parsed_page.css('.flex.flex-col.rounded-lg.shadow-lg.overflow-hidden')# Generate the updated blog posts list (top 5)posts_list = [\"\\n### Recent Blog Posts\\n\\n\"]posts.first(5).each do |post| title = post.css('p.text-xl.font-semibold.text-gray-900').text.strip link = \"https://www.bengreenberg.dev#{post.at_css('a')[:href]}\" posts_list << \"* [#{title}](#{link})\"end# Update the README.md fileclient = Octokit::Client.new(access_token: ENV['GITHUB_TOKEN'])repo = ENV['GITHUB_REPOSITORY']readme = client.readme(repo)readme_content = Base64.decode64(readme[:content]).force_encoding('UTF-8')# Replace the existing blog posts sectionposts_regex = /### Recent Blog Posts\\n\\n[\\s\\S]*?(?=<\\/td>)/mupdated_content = readme_content.sub(posts_regex, \"#{posts_list.join(\"\\n\")}\\n\")client.update_contents(repo, 'README.md', 'Update recent blog posts', readme[:sha], updated_content)As you can see, first an HTTP request is made to the website and the section with the blog posts is gathered and the data is assigned to a posts variable. Then, the script iterates through the blog posts inside the posts variable and gathers the first 5 of them. You may want to change that number for your own needs. Each loop through the blog posts, a post is added to an array of posts_list with the title and the URL to the blog post.Lastly, the README file is updated by first finding it using the octokit gem, and then locating the spot in the README to update with some regex: posts_regex = /### Recent Blog Posts\\n\\n[\\s\\S]*?(?=<\\/td>)/m.This script will do the job, but nothing is actually invoking this script. How does it get run? This is where GitHub Actions comes to the rescue!Creating the Action workflowNow that we have the script in place, we need a way to automatically run it on a schedule. GitHub Actions provides a powerful way to automate a wide variety of tasks, including running scripts. In this case, we’ll create a GitHub Actions workflow that runs the script once a week at midnight on Sunday.The workflow file should be placed in the .github/workflows/ directory and can be named something like update_blog_posts.yml. Here’s the content of the workflow file:name: Update Recent Blog Postson: schedule:  - cron: '0 0 * * 0' # Run once a week at 00:00 (midnight) on Sunday workflow_dispatch:jobs: update_posts:  runs-on: ubuntu-latest  steps:  - name: Check out repository   uses: actions/checkout@v2  - name: Set up Ruby   uses: ruby/setup-ruby@v1   with:    ruby-version: 3.1  - name: Install dependencies   run: gem install httparty nokogiri octokit  - name: Scrape posts and update README   run: ruby ./.github/scripts/update_posts.rb   env:    GITHUB_TOKEN: $    GITHUB_REPOSITORY: $This workflow is triggered on a schedule defined by the cron syntax, which specifies that it should run at 00:00 (midnight) every Sunday. Additionally, the workflow can be manually triggered using the workflow_dispatch event.The update_posts job consists of several steps:Checking out the repository using the actions/checkout@v2 action.Setting up Ruby using the ruby/setup-ruby@v1 action, with the specified Ruby version of 3.1.Installing the required Ruby gems (httparty, nokogiri, and octokit) using the gem install command.Running the script update_posts.rb located in the .github/scripts/ directory. The GITHUB_TOKEN and GITHUB_REPOSITORY environment variables are provided to the script, allowing it to interact with the repository.With this workflow in place, your script will automatically run every week to scrape the blog posts and update the README file. GitHub Actions takes care of all the scheduling and execution, making the process seamless and efficient.Putting it all TogetherNowadays, your online presence is often the first point of contact for people looking to connect with you—whether they’re prospective employers, collaborators, or contributors to open source projects. Your GitHub profile, in particular, is a valuable platform for showcasing your skills, projects, and interests. So, how can you ensure that your GitHub profile remains up to date, relevant, and truly reflective of who you are?By harnessing the power of GitHub Actions, we’ve demonstrated how you can transform your GitHub profile from a static Markdown document into a dynamic, ever-changing example of who you are. Through the example provided in this guide, you’ve learned how to scrape data from a website and use it to dynamically update your GitHub profile. And while our example was implemented in Ruby, the same principles can be applied using JavaScript, TypeScript, Python, or any other language of your choice.To recap, we walked through the process of creating a Ruby script that scrapes blog posts from a website, extracts relevant information, and updates the “Recent Blog Posts” section of your README.md file. Then, we used GitHub Actions to set up a workflow that runs the script on a regular schedule, ensuring that your profile remains current with your latest content.But our journey doesn’t end here! The techniques and approaches shared in this guide can serve as a foundation for further exploration and creativity. Whether it’s pulling in data from other sources, integrating with APIs, or experimenting with different content formats, the possibilities are endless.So go ahead and make your GitHub profile a vibrant and dynamic extension of yourself. Let it tell your story, highlight your achievements, and invite collaboration with others.⭐ Was this blog post helpful? Consider sponsoring my work on GitHub to help me create more content like this! ❤️ SponsorTwitter GitHub Mastodon © 2023 Ben Greenberg. All rights reserved.",
        "summary": "GitHub users can make their profile dynamic using GitHub Actions by creating a repository with a README.md file containing desired profile information, adding folders for dynamic content, and adding a new subfolder for the script that scrapes data from a website and modifying it in the README.md file; the content for the profile is found by going to github.com/[username] in a web browser, with the repository being the source of the profile page; the new subfolder for the workflow is installed into [workflows] within the root directory, and a schedule is set to run the script once a week; users can use different languages, including Ruby, TypeScript, JavaScript, and Python to make a dynamic profile; this technique enhances the GitHub profile of an individual, making it a more dynamic and ever-changing example.",
        "hn_title": "Use GitHub Actions to Make Your GitHub Profile Dynamic",
        "original_title": "Use GitHub Actions to Make Your GitHub Profile Dynamic",
        "score": 151,
        "hn_content": "A Hacker News post discusses creating dynamic GitHub profiles using GitHub Actions. An HN user shares a link to their profile, which has been running updates for almost three years. Another user suggests using webhooks or event driven execution to make the process more efficient. Some comments express skepticism about the usefulness of dynamic profiles, while others appreciate the creativity and fun of the idea. Overall, the post showcases an interesting use-case for GitHub Actions.Seed accelerator Y Combinator has opened applications for its Summer 2023 program, offering early-stage startups seed funding and mentorship in the tech industry. The program will run from June to August, with applications being accepted until 8pm PT on March 22, 2023. Y Combinator provides $125,000 in exchange for a 7% equity commitment from participating firms. Notable alumni of the program include Airbnb, Stripe, and Reddit, among others. Interested parties can apply via the Y Combinator website.",
        "hn_summary": "A Hacker News post discusses dynamic GitHub profiles via GitHub Actions. Comments vary from skepticism to praise."
    },
    {
        "id": 35511152,
        "timestamp": 1681126267,
        "title": "What I've Learned About Formal Methods in Half a Year",
        "url": "https://jakob.space/blog/what-ive-learned-about-formal-methods.html",
        "hn_url": "http://news.ycombinator.com/item?id=35511152",
        "content": "The writer shares their experience learning about formal methods through master's degree courses and summarizes key concepts, including the use of mathematical techniques to verify software properties. They argue that while formal methods may have a reputation for being costly and not applicable to all software engineering processes, they are increasingly accessible and valuable, particularly in cases where software reliability is critical. The writer also discusses \"lightweight\" formal methods, such as Alloy and Forge, which take high-level specifications and validate properties. Finally, they provide an example of using Alloy to check the implementation of a file system.The article discusses a problem faced by the kernel when freeing a block that was previously in the file system. It explores questions such as how to determine if there is a ZFS snapshot that refers to a deleted file, or which files should be freed when a snapshot is deleted. The article uses Alloy as a tool to model the problem and shows how to encode the file system operations using predicates. The author also emphasizes the advantages of using Forge, which forces explicit enumeration of assumptions and ensures the constraints provided are respected. The article ends with questions posed to Forge to test if the predicates are satisfiable and valid.An article on 'The Tech Times' explores a new technology for detecting vacuity; the article discusses the use of Forge, a first-order logic solver, for detecting vacuity and ensuring that the implication isn't \"vacuously\" true; HN users point out that Forge is a useful tool for ensuring model upholds invariant; the article examines an example of a failed test and how to fix it; it goes on to explore how snapshots can be checked to determine if a file is referenced by an earlier snapshot before being deleted.Forge, a testing tool, checks every possible input for a given set of rules and produces counterexamples, using SAT and SMT solvers that translate abstract specifications to boolean constraints. Margrave Policy Analyzer, a model checker, analyzes access-control policies using similar techniques, including change impact analysis. In contrast, formal specification and theorem proving aim for rigorous verification, as exemplified by the seL4 microkernel, using proof assistants like Isabelle/HOL and Lean, which allow reasoning about logical proofs through dependent-typed programming languages. Lean, in particular, enables constructing proofs as code that generates values of specified types.The post discusses different approaches to proof assistants such as Lean and the benefits and disadvantages of using them. It compares the forward-style and tactical-style of proofs and explains how predicates are defined in Lean. The post highlights the importance of formal semantics in reasoning about source code and briefly explains big-step and small-step semantics. The author also mentions denotational semantics but admits to not feeling qualified to provide an explanation.The article discusses programming language semantics and the meaning of refinement in mathematics, related to software verification. The author shares their experience with proving the correctness of a subset of Scheme and creating a lexical analyzer and parser in Lean. They also mention the use of inductive data types and automation for printing atoms. The article showcases the author's knowledge and usage of Lean, a general-purpose programming language.The post introduces a type for language semantics errors in Lisp, and the author implements evaluation of procedures such as primitives and lambda forms. They also introduce the notion of \"state\" and \"frame\" and demonstrate how to update variables defined in previous \"frames\". The post concludes with a discussion about the limitations of implementing a full Scheme interpreter in Lean and introduces the notion of a maximum evaluation depth to ensure well-founded recursion.The article discusses the approach taken for program semantics in compiling expression to a 'statement' type and reasoning about big step semantics in Lean. The 'evaluation state structure' is used to reason if an evaluation is finite or not. The 'compile_stmt' function is defined for different arities to compile expressions, and 'is_lambda' and 'seq_from_list_stmt' functions are used to identify lambda and statement from lists. The post is technical and may not be suitable for general readership.This post contains program code and related proofs demonstrating the correctness of a factorial program using big-step semantics. The proof involves many obligations and is fairly involved, but serves as an example of leveraging mathematical tools in programming. The author uses a variety of lemmas and definitions to demonstrate correctness, including a proof of the factorial function and the use of casting in primitive operations. The post may be of interest to experts in programming or computer science.The article explains the concept of formal methods, which utilizes mathematical techniques to verify software correctness beyond testing. It provides an overview of verification techniques suited for high-level (Alloy and Forge) and low-level (Lean, Isabelle, and Coq) systems, focusing on analyzing software properties. The author shares their experience learning and using the tools for verifying and testing software, highlighting the challenges and benefits of adopting formal methods. The article concludes with a goal to continue learning about the topic to become a domain expert in the field.",
        "summary": "The writer shares their experience learning about formal methods and the use of mathematical techniques to verify software properties. The article discusses the advantages of formal methods, including lightweight methods such as Alloy and Forge, and provides an example using Alloy to check the implementation of a file system. It explores different approaches to proof assistants such as Lean and the benefits and disadvantages of using them. The article also discusses programming language semantics and the meaning of refinement in mathematics related to software verification, showcasing the author's knowledge and usage of Lean. Additionally, the author explains the concept of formal methods and provides an overview of verification techniques suitable for high-level and low-level systems. The post may interest experts in programming and computer science.",
        "hn_title": "What I've Learned About Formal Methods in Half a Year",
        "original_title": "What I've Learned About Formal Methods in Half a Year",
        "score": 151,
        "hn_content": "A Hacker News user showcases their learnings about formal methods in the past six months, with many commentators chiming in with their experiences and opinions. One particular commentator recommends Frama-C and SPARK for those looking to learn more about the topic, while others point out the usefulness of formal methods in determining \"what was expected\" and breaking down complex assertions into smaller units. Despite some hesitation from some about the amount of study required to fully utilize formal methods, others point out that one can quickly get started with TLA+ with just a three-day workshop.Apple uses formal methods to verify hardware, and is looking for people in this area. Formal methods have niche applications in safety-related software, but are not always considered worth the effort for most software. Formal methods may not be powerful enough to prove assertions about expectations and invariants, but they excel at design by contract. Writing a specification can help avoid errors from the start instead of encountering them one by one. Contract tests and data flow analysis are valuable for catching bugs that cross code/organization boundaries. Formal methods were developed for aerospace interoperation, but the era when the buyer had more clout than the seller has passed.Ten years ago, formal verification was just starting to be viable in semiconductor verification. Formal tools could find difficult test cases and prove assertions or test failures could not occur, but it couldn't read higher-level models of code. Some suggest using AI systems like ChatGPT to track system requirements and validate code against them. Some express poor results with current LLMs, and others suggest combining LLMs with AI and hardcoded knowledge. The use of mathematical notation in formal proofs is appropriate and efficient, and natural language expressions of proof would result in longer proofs and make it harder to identify patterns.The article discusses interactive theorem provers and how they differ from reading and writing source code, as stepping through lines of code is a given. The article also notes that democratizing tools is important in today's age, as making things obscure and less obvious leads to anti-intellectualism. A comment mentions the need for new developers to gain a footing in software development, and another comment provides a coding example in Lean, a theorem prover. Overall, the article emphasizes the importance of tools and democratizing knowledge in the tech industry.",
        "hn_summary": "An HN user shares their learnings on formal methods, with commenters providing their experiences and opinions. Frama-C and SPARK are recommended, along with TLA+ for quick start. Formal methods are useful for verifying hardware, but are niche for most software. Contract tests and data flow analysis help prevent errors in start. AI systems like ChatGPT can validate code against system requirements. Mathematical notation is more efficient than natural language expressions in formal proofs. Democratizing knowledge is vital in the tech industry."
    },
    {
        "id": 35512338,
        "timestamp": 1681134953,
        "title": "Ask HN: Open source LLM for commercial use?",
        "url": "",
        "hn_url": "http://news.ycombinator.com/item?id=35512338",
        "content": "",
        "summary": "An HN user asked whether they could legally use an open-source LLM tool for commercial use. Some users recommended checking the specific license of the tool. Others suggested contacting a lawyer or using an alternative tool with a commercial license. One user pointed out that using open source for commercial purposes is possible with some licenses, but it's essential to comply with the terms of the license.",
        "hn_title": "Ask HN: Open source LLM for commercial use?",
        "original_title": "Ask HN: Open source LLM for commercial use?",
        "score": 143,
        "hn_content": "An HN user is looking for an open source LLM that can be used commercially for their ML project. The best models are from the Flan family by Google but they perform slightly worse than GPT-3/4 which currently dominates the market. Google chose not to commercialize some of their research e.g. with GMail or Slides, which is seen by some as a missed opportunity. There are a number of other open source models available, with training and fine-tuning becoming cheaper and more efficient. The market for high quality AI models is not like the software marketplace, and developing an open source LLM requires a lot of resources. Some datasets for training models may contain copyrighted materials.Experts anticipate that large tech companies, such as Nvidia, will release initial \"base\" models for large language models (LLMs) in the near future, while other companies scratch their own itches and push the needle forward with their own customised LLMs. Companies may be inclined to publish base models as foundational enablers of the ecosystem, where the \"real\" value from a commercial standpoint is something like 5-10 layers up. OpenAI has stated that it does not use data submitted by customers via its API to train OpenAI models or improve OpenAI’s service offering, however, this promise is not useful for some companies where the secrecy of trade secrets is their only protection. Machine learning models likely have zero intellectual property rights protections, unlike source code, due to their algorithmic process, and so a LLaMA release should not have a license issue after distilled.Various alternatives to OpenAI's GPT, like BERT, opt series, and GPT-J, can be fine-tuned for specific tasks more cheaply. A mention of GPT4all indicates that the team is working on training GPT-J as an open alternative to the Llama-based model. There have been concerns regarding the accountability of LLMs that could harm the user if trained maliciously, but it's not clear how accountability should be divided among the user, operator, publisher, trainer, and model creator.",
        "hn_summary": "An HN user searches for commercial open-source LLM for their ML project. Flan models perform slightly worse than GPT-3/4. Other open-source models are available, but training is expensive. Nvidia expected to release initial base models for LLMs. Companies may publish base models but the real value is 5-10 layers up. OpenAI doesn't use customer data to train models, but some companies need secrecy. Machine learning models likely have no IP rights protections. GPT alternatives like BERT and opt series can be fine-tuned cheaply. GPT4all team works on training GPT-J as an open alternative. Concerns exist over the accountability of LLMs."
    },
    {
        "id": 35511139,
        "timestamp": 1681126147,
        "title": "Zoomable, animated scatterplots in the browser that scales over a billion points",
        "url": "https://github.com/nomic-ai/deepscatter",
        "hn_url": "http://news.ycombinator.com/item?id=35511139",
        "content": "# Deep Scatterplots for the WebThis is an evolving library for displaying more points than are ordinarily possible over the web.It's fast for three reasons:1. All data is sent in the Apache Arrow `feather` format, in a  custom quadtree format that makes it possible to only load  data as needed on zoom. Feather takes no time to parse in the browser  once transferred, compresses pretty well, and can be directly copied to the GPU without  transformation in JS. This is [the way of the future.](https://benschmidt.org/post/2020-01-15/2020-01-15-webgpu/)2. Most rendering is done in custom layers using WebGL, with a  buffer management strategy handled by REGL. This means that  there are no unnecessary abstractions around points or separate draw calls  for different objects; a minimum number of buffers are attached for the  needed points.3. Almost all grammar-of-graphics transforms such are handled on the GPU,  which allows for interpolated transitions with calculations  done in parallel.It also runs in completely static settings, so you can host a million-point scatterplot over something like Github Pages.# Examples* [1 million+ documents from arxiv.com](https://observablehq.com/@bmschmidt/arxiv) rendered inside an Observable notebook. (Ben Schmidt)* [Every person in the 2010 and 2020 US Censuses](https://all-of-us.benschmidt.org) displayed in an interactive svelte-kit app. (Ben Schmidt)* [Newspaper Articles at the Library of Congress from the Reconstruction Era](https://situating.us/explore). (By Andromeda Yelton while in residency at the Library of Congress).# Get helpGithub issues, even low quality ones, are welcom here. There is also a dedicated [Deepscatter Slack](https://join.slack.com/t/deepscatter/shared_invite/zt-17kbudjhj-zVzt26zddEpSyACe2E71Fw) which you are welcome to join.I came into doing this stuff from a very non-technical background and welcome people to join with naive questions.# Quick start## Importing the module.See the [arxiv example above](https://observablehq.com/@bmschmidt/arxiv) to see some basic examples.## Running locally.First, install the companion tiling library, which is written in python, and generate a million points of test data in tiles of 50000 apiece.```shpython3 -V # requires Python 3.9.x or 3.10.xpython3 -m pip install git+https://github.com/bmschmidt/quadfeatherquadfeather-test-data 1_000_000quadfeather --files tmp.csv --tile_size 50_000 --destination tiles```Then setup this library to run. It will start a local dev server.```shnpm inpm run dev```If you go to `localhost:3344`, you should see an interactive scatterplot. To dig into what you're seeing, open `index.html`.(In 2021, this development site works in Chrome, not Safari or Firefox, because it uses ES6 module syntax inside the webworker. The distributed version of the module should work in all browsers.)## Your own data.1. Create a CSV, parquet, or feather file that has columns called 'x' and 'y'. (Or a feather file that has columns `x`, `y`). Any other columns (categorical information, etc.) can be included as additional columns.2. Tile it:```shcd deepscatter # if you're not already therequadfeather --files ../some-path-to/your-data.csv --tile_size 50000 --destination tiles```3. Assuming your dataset has an `x` and `y` column and the `tiles` folder is in the root directory of this project, you can see the data visualized by running```shnpm run dev```and opening `http://localhost:3345/index-simplest-way-to-start.html` in your browser.To edit the visualization, or to troubleshoot, look at the file `index-simplest-way-to-start.html`, where you should find a bare-bones implementation of deepscatter.Explore `index.html`, and render it at `http://localhost:3345/index.html`, for a more advanced example.Note: Ideally, in a future release you'll be able to create these specs in away that doesn't require coding JSON directly.## Build the module```shnpm run build```will create an ES module at `dist/deepscatter.es.js` The mechanics ofimporting this are very slightly different than `index.html`.Note that this is an ESM module and so requires you to use ```` See `index_prod.html` for an example This is currently bundled with vite and rollup. There is/will be a further interaction layer on top of it, but the core plotting components are separate and should work as a standalone layer that supports plot requests via an API. # Code strategy Any interaction logic that changes the API call directly does not belong in this library. The onlyinteraction code here is for zooming and interacting with points.## Future codebase splits.The plotting components and the tiling components are logically quite separate; I may breakthe tiling strategy into a separate JS library called 'quadfeather'.Apache Arrow would still be a necessary intermediate format, but it could be generated from CSV filesusing, say, `arquero` or a WASM port of `DuckDB`.# APIThis is still subject to change and is not fully documented. The encoding portion of the API mimics Vega-Lite with some minor distinctions to avoid deeply-nested queries and to add animation and jitter parameters.```js{  encoding: {   \"x\": {     \"field\": \"x\",     \"transform\": \"literal\"   },   \"color\": {     \"field\": \"year\",     \"range\": \"viridis\",     \"domain\": [1970, 2020]  }}```## Implemented aesthetics.1. x2. y3. size4. jitter_radius: size of jitter. API subject to change.5. jitter_speed: speed of jitter. API subject to change.6. color (categorical or linear: range can call color scales explicitly, or accepting any d3-color name.)7. `x0` (for animations; transitions between x0 and x)8. `y0` (for animations; transitions between y0 and y)9. `filter`. (Filtering is treated as an aesthetic operation by this library.)## Planned1. Symbol (Mapping of categorical variables to single unicode points in a single font; probably 255 max.)2. Label (Full-text label)3. Image (Like PixPlot)## JitterJitter is a little overloaded with features right now, but some are quite fun.jitter method is set on 'method' key of the 'jitter_radius' field. Possible values are:1. `circle`2. `spiral`3. `time`4. `normal`# Principles1. This is a 2d library. No fake 3d.2. The central zoom state is handled by d3-zoom.3. That zoom state can be used to render to webgl. Don't know webgl? You  should be able to use the zoom state to draw to canvas or svg layers using the  same zoom and underlying data, so that you can draw point with webgl  and then build a callout using d3-annotate.",
        "summary": "Deep Scatterplots for the Web is an evolving library for displaying large amounts of data with high performance using the Apache Arrow `feather` format and WebGL. The library also handles most grammar-of-graphics transformations on the GPU, allowing for interpolated transitions with parallel calculations. The examples include over a million documents from arxiv.com and every person in the 2010 and 2020 US Censuses, among others. The library runs in completely static settings which can be hosted on Github Pages. The API mimics Vega-Lite, and the library offers jitter methods such as circle, spiral, and time.",
        "hn_title": "Zoomable, animated scatterplots in the browser that scales over a billion points",
        "original_title": "Zoomable, animated scatterplots in the browser that scales over a billion points",
        "score": 141,
        "hn_content": "Zoomable, animated scatterplots in the browser that scales over a billion points | Hacker NewsHacker Newsnew | past | comments | ask | show | jobs | submit login Zoomable, animated scatterplots in the browser that scales over a billion points (github.com/nomic-ai)141 points by samwillis 17 hours ago | hide | past | favorite | 15 comments   doodlebugging 7 hours ago        | next [–] I'm pretty sure I have seen this or something very similar somewhere before but I can't remember where. It is pretty impressive.The background map they use though for this is definitely wishful thinking in my area. I clicked on points that looked to be near me and discovered that the census data used for those points has people living on a couple of roads that haven't been built and won't be built for at least two years if things go like they have on the other road construction projects within a few miles of me. Today the roads only exist on planning documents posted by the city. reply  oplav 3 hours ago        | parent | next [–] Highcharts has had a \"boost\" module for a long time (at least back since 2015/2016) that switched the rendering over to WebGL for large data sets, but I don't think it ever got up to 1B points.https://www.highcharts.com/docs/advanced-chart-features/boos... reply  coppsilgold 9 hours ago        | prev | next [–] Reminds me of a more ambitious project where you can view and zoom 1000s of images: <https://gitlab.com/galapix/galapix>There is also a simpler Rust imitation of that project: <https://github.com/google/pix-image-viewer>Demos:<https://www.youtube.com/watch?v=OJz0dz3oG-Q><https://www.youtube.com/watch?v=9-Mg6MkE-tg> reply  larsrc 13 hours ago        | prev | next [–] Is the name a reference to the democracy game from Scientific American back in the 80ies (or so)?Also, is there a good equivalent for node-edge graphs? reply  VHRanger 12 hours ago        | parent | next [–] Ideally, you'd embed the graph into 2 or 3d first, then visualize it as a scatterplot.Visualizing the edges at scale doesnt yield nice results in general. It's simply too noisy.The way to do it is to reduce the graph to some 300d or 500d embeddings, then use TSNE/UMAP/PACMAP to reduce that to 3d. Then visualize.My prefered way is to use some first order embedding method like GGVec in this library [1] (disclaimer I wrote it). Node2Vec and ProNE don't yield great embeddings for visualization (the first is too filamented, the second too close to the unit ball).Another great library to do this work is GRAPE [2]. Try first-order embedding methods, or short walks on second order methods to avoid the embeddings being too filamented by long random walk sampling.[1] https://github.com/VHRanger/nodevectors[2] https://github.com/AnacletoLAB/grape/ reply  larsrc 12 hours ago        | root | parent | next [–] Thanks! reply  lordwarnut 3 hours ago        | parent | prev | next [–] I don't suppose you have a link to that game? It sounds interesting and I'd love to learn more. reply  wirthjason 14 hours ago        | prev | next [–]   Github issues, even low quality ones, are welcom here. This a refreshing line to read. I wonder if the missing “e” (welcom vs welcome) is intentional. It sounds like and easy (low quality?) PR. reply  coding123 12 hours ago        | parent | next [–] I do find it funny when you have this glaringly bad bug that effects everyone and the bug template wants you to report everything down to your DNA. Sometimes it is nice to just report: latest released version, here's my stack trace... reply  paulgb 15 hours ago        | prev | next [–] Nomic are also the ones behind gpt4all. Such a powerhouse team. https://github.com/nomic-ai/gpt4all reply  kristjansson 12 hours ago        | prev | next [–] Great tool to add to the visualization toolbox! It does seem to lack the visual fidelity at large scales that it resovles at finer ones. I wonder if it could extend to the render + raster approach of Datashaper, while still running everything in browser? reply  pphysch 9 hours ago        | prev | next [–] It seems I don't have the necessary graphics extensions available on my mobile device (mainstream device using mainstream browser). Is this supposed to work on mobile? reply  mLuby 15 hours ago        | prev | next [–] Nice. At least 7 years ago I saw a similar demo: https://demo-taxis.heavy.ai/ for an example.Is the difference that nomic's billion points are rendered entirely client-side? reply  VHRanger 12 hours ago        | parent | next [–] yes, it's using webGPU to render the whole thing reply  tudorw 12 hours ago        | prev [–] nice, https://github.com/laurolins/nanocube is/was another interesting approach to the many points issue, though it's seen no updates since 21 afaik replyApplications are open for YC Summer 2023Guidelines | FAQ | Lists | API | Security | Legal | Apply to YC | ContactSearch:",
        "hn_summary": "Nomic AI's zoomable, animated scatterplots scale more than one billion points in the browser via webGPU, and GitHub issues are welcomed; however, the background map may not always be accurate, and Highcharts has a similar module but with fewer points. Nomic AI also released gpt4all, and libraries like GRAPE and nodevectors could yield better results for embeddings at scale. Visualization fans may be interested in Galapix, Pix-image-viewer, and GGVec, but rendering issues may arise with mobile devices."
    }
]