[
  {
    "id": 36283249,
    "timestamp": 1686503410,
    "title": "Reddit Strike Has Started",
    "url": "https://reddark.untone.uk/",
    "hn_url": "http://news.ycombinator.com/item?id=36283249",
    "content": "Watch a 24/7 stream of this site at twitch.tv/reddark_247!✊ ReddarkThese subreddits are going dark or read-only on June 12th and after. Some already are. Click here to find out why.Like the website? Contribute here!Notes:Due to slow rollout on reddit's side, some subreddits may flash public and private, if this is happening, it means that the subreddit just changed their publicity type.Any subreddits which have just disabled posting will still be displayed as \"Public\".Third party instances:These are instances of Reddark hosted by individuals unrelated with UNTONE. If the main server isn't working, these may be a good choice, though click with caution.https://reddark-digitalocean-7lhfr.ondigitalocean.app/https://reddark.rewby.archivete.am/https://reddark.nextflow.cloud/https://reddark.jghuff.com/Hide public subredditsLarge counterEnable sound alertsLoading...Code Source is here - Join Lemmy for less Reddit shenanigans.",
    "summary": "- Many subreddits are going dark or read-only on June 12th and after as part of a strike.\n- The strike is in response to Reddit's lack of action against hate speech and racism on the platform.\n- Reddark is a site providing a 24/7 stream of darkened subreddits and third-party instances are available if the main server isn't working.",
    "hn_title": "Reddit Strike Has Started",
    "original_title": "Reddit Strike Has Started",
    "score": 1576,
    "hn_content": "Reddit users have gone on strike against the company's senior executives over subreddits that were banned due to the fact that they had hosted hateful content or violated site rules, including r/The_Donald. While some users are returning to the site, others remain opposed to it until the millions of users who create content are happy with the site's policies. Opinions on Reddit's future are mixed, with some arguing that its changes have already hurt its business model. Despite this, many consider Reddit and other network effect businesses to be of great value and, as such, there are emerging proposals to change the definition of \"growth\" to encompass more nuanced, non-quantifiable things such as user and employee happiness.The discussion revolves around the influence of VCs and investors on the decisions of private and public companies, as well as the challenges of monetizing social media platforms. Users highlight the importance of retaining talented CEOs and founders, the impact of investor pressure on companies, and the struggles of creating profitable business models for social media. Some users draw comparisons between successful companies like Facebook and Twitter and discuss the dangers of mission creep and profit-maximization. Another user highlights the difficulty of monetizing user-generated content platforms and maintaining a healthy balance between economic interests and community values.The discussion revolves around the toxic culture within Wikipedia and StackOverflow that drives away potential users and drives down the quality of content. The cancerous moderation system in both platforms has resulted in an \"ingrown\" culture that is unlikely to change, leading to stagnating user growth and reduced contributions. Some users suggest implementing new policies to improve content quality and user experience, but this is unlikely to address the root causes of toxicity. The larger issue is that these companies are built upon network effects and two-sided markets, but the non-profit structure struggles to generate enough revenue to meet their expenses.Twitter is experiencing a decline in traffic and revenue, as well as an increase in outages, bugs, and abuse. Many users have left the platform, and the value of the company has fallen significantly. Twitter has also lost staff, with a lot of core functionality being handled by people who are trapped in their jobs by visas. Elon Musk's feuds with vendors and public support of extreme-right views are causing many to protest and leave the platform. Some users find Twitter better now, notably with the Community Notes feature, but others have experienced suspicious and inappropriate content. Despite the decline, some believe that Twitter is faster and more fun than ever, especially for users outside the US where they are adding capacity.A discussion on Reddit's recent changes and how users might resist change since the site belongs to them, along with a comparison to landscapers and painters. Some commenters express dissatisfaction with moderation tools, censorship, and various aspects of the site. Others discuss the difficulty of finding alternatives and the impact of market effects on users. The conversation also touches on the profitability of Reddit and the potential for sustainability over aggressive revenue-seeking.The discussion revolves around Reddit's business model and profit maximization goals, with some users suggesting that moderation and community-generated content are undervalued. There are criticisms of the platform's recent API changes and efforts to compete with video-focused platforms like TikTok. Some users argue that Reddit moderators are essential to the platform's success, while others believe they are a negative influence. There is a debate about the relationship between profit and sustainability, with arguments for both sides. Overall, the discussion highlights tensions between users' desire for community-driven platforms and the financial demands of running a public company.This comments thread discusses recent changes to Reddit's API and the impact on third-party app developers. Some users express concern that the changes will negatively affect the platform and lead to a loss of users, while others feel that Reddit is justified in trying to monetize its platform and reduce dependence on third-party apps. Many users express frustration with the platform's design and moderation policies. Some users are planning a subreddit blackout in protest, which may affect the site's popularity. Overall, the thread highlights the tension between monetizing a user-generated content platform and maintaining a strong user community.Reddit's decision to introduce pricing for its API has been met with criticism from users, who see the move as placing the site's community at risk. Critics argue that this new approach prioritizes monetization over maintaining a quality community and could lead to censorship of unpopular viewpoints. Reddit's new pricing model has prompted an outcry among third-party developers who argue that the charges will make their projects unsustainable. It remains to be seen if the move will stick and impact revenue growth. App makers noted the change is unsustainable for them; some believe it's just a move by Reddit to generate more revenue, while others see it as an attack on third-party clients, which have always been popular with the Reddit community.",
    "hn_summary": "- Reddit users are on strike against senior executives due to banned subreddits hosting hateful content or violating site rules\n- There is a debate on Reddit's future, with some arguing that changes to the platform have already hurt its business model\n- The discussion revolves around monetizing user-generated content platforms and maintaining a healthy balance between economic interests and community values."
  },
  {
    "id": 36277814,
    "timestamp": 1686455290,
    "title": "Thousands of subreddits pledge to go dark after the Reddit CEO's recent remarks",
    "url": "https://www.theverge.com/2023/6/10/23756476/reddit-protest-api-changes-apollo-third-party-apps",
    "hn_url": "http://news.ycombinator.com/item?id=36277814",
    "content": "INTERNET CULTURE/CULTURE/ENTERTAINMENTThousands of subreddits pledge to go dark after the Reddit CEO’s recent remarks/ Fallout from the unpopular API pricing change and disastrous AMA with CEO Steve Huffman is turning out the lights on some of Reddit’s most prominent communities.By Wes Davis, a weekend editor who covers the latest in tech and entertainment. He has written news, reviews, and more as a tech journalist since 2020.Jun 10, 2023, 4:58 PM PDT|CommentsShare this storyReddits user and moderator community are very peeved at its CEO right now. Illustration by Alex Castro / The VergeThe version of Reddit we’ll see over the next few days may be a shell of itself. More than 100 subreddits have already gone dark, and thousands more plan to follow in protest of Reddit’s coming API changes, according to the website Reddark, which is tracking the protests.The protests are happening over API changes that will force many third-party apps, like Apollo and rif is fun for Reddit, to shut down. Frustration was already brewing in the community as developers began reacting to the changes this week, but Reddit CEO Steve Huffman’s responses in recent days have only escalated the community’s pushback.In a Reddit AMA on Friday, Huffman was met with seemingly universal anger. There were a lot of f-bombs from commenters. A lot of people called him a coward. If there are positive comments, I didn’t find them.Subreddit moderators and third-party Reddit app developers say they’ve lost trust in Huffman and Reddit’s leadership. Apollo developer Christian Selig accused Huffman of “blatantly lying” in a phone call to some subreddit moderators. The moderators of r/videos wrote that Huffman’s AMA performance was “a collage of inappropriate responses.” r/funny suggested the company was “aim[ing] solely at your looming IPO.”Most of the subreddits have pledged to go private — preventing outside access — for 48 hours, though some, like the 26 million-member community r/videos, have said they’ll remain private indefinitely. According to this post on r/ModCoord, protests will end when Reddit addresses issues with the API, improves accessibility for blind people, and creates “parity in access to NSFW content.”RelatedReddit’s API updates: all the news about changes that have infuriated RedditorsApollo for Reddit is shutting downAmong the complaints are how Reddit’s leadership has, or mostly hasn’t, communicated the details of changes to its API pricing or incoming restrictions, including prohibiting third-party apps from showing NSFW content that’s already viewable on the site. ReddPlanet developer Tony Lupeski said it was a “blatant lie” that Reddit leadership was keeping dialogue open with impacted third-party developers, as Huffman wrote. “That’s not an answer and you know it,” said user Anacharsis to the same Huffman reply.When moderator Merari01 asked why the site hadn’t tested the new changes with users and moderators, Huffman said the company “started sharing this information in April.” A few responses pointed out the earlier announcement didn’t include any pricing information and left out details like the ban on third-party apps showing NSFW content.One user pointed to a post on r/AskHistorians listing times Reddit had reneged on promises.Since the AMA, some subreddits have escalated their response. Over at r/iPhone, the moderators posted early morning that their original plan was to go dark for just 48 hours, but Huffman’s behavior changed their minds:Originally, the protest was planned to be 48 hours. However, after a shambolic AMA held by Reddit’s CEO, it has become clear to us that Reddit doesn’t intend to act in good faith. When the CEO is willing to lie and spread libellous claims about another third-party developer, and then try double down by vilifying them, again, in an AMA, despite being proven as a liar by the developer through audio recordings, that’s when we knew what we were up against.Now /iPhone will be going private, severely restricting access to the sub. As will r/Music, a default subscription for new accounts and one of the largest subreddits on the site. Mods of that community put it right in the title of the post announcing its participation, which says it will close starting June 12th “Until Reddit Takes Back Their API Policy Change.”r/iPhone, which has 3.8 million users, echoed r/Music’s sentiment, saying, “in the (somewhat unlikely) scenario that Reddit’s leadership has a change of direction that sees the reversal [of] the recent API policy change, we will reopen the subreddit.” r/Gaming says its shutdown will begin on the 12th, and it will be set to private “for 48 hours or longer.”At the time of publishing, a pinned bot post on the r/ModCoord sub’s post about the protest says nearly 4,500 communities are pledging to go dark, while Reddark, a site tracking the protesting subreddits, says over 200 already have.Correction June 11th, 2023, 8:47AM EST: A previous version of this headline said thousands of subreddits had gone dark. That is inaccurate, they are currently planning to go dark. r/videos also has not yet gone private, as previously stated. Lastly, a mention of r/History should have read r/AskHistorians. We sincerely regret the error.Most PopularThousands of subreddits pledge to go dark after the Reddit CEO’s recent remarksStar Wars: Outlaws is a new open-world Star Wars game from UbisoftXbox Games Showcase 2023 and Starfield Direct: all the news and trailersHow to watch Microsoft’s 2023 Xbox and Starfield showcaseWatch 45 minutes of new Starfield gameplay",
    "summary": "- Over 100 subreddits have gone dark in protest of upcoming API changes that would force many third-party apps to shut down.\n- The protests stem not only from the API changes but also from a lack of transparency and communication from the Reddit CEO and leadership.\n- Subreddit moderators and third-party app developers have lost trust in Reddit's leadership and are calling for improvement in API issues, accessibility for blind people, and parity in access to NSFW content.",
    "hn_title": "Thousands of subreddits pledge to go dark after the Reddit CEO’s recent remarks",
    "original_title": "Thousands of subreddits pledge to go dark after the Reddit CEO’s recent remarks",
    "score": 582,
    "hn_content": "Thousands of subreddits are pledging to go dark after the Reddit CEO's recent remarks, indicating an overwhelmingly negative response from the community. Some have speculated about the leadership’s true motivations and criticized their ineptitude. There are concerns regarding third-party apps that moderators rely on for moderation. Reddit is trying to control its user base by pushing through changes and capturing revenue from those users, while the most interesting content creators, those using third-party apps, are not valued. The majority of users are readers, with few commenters and fewer interactors, contributing to content churn. Some believe that without Apollo users and similar dedicated moderators, the quality of content and comments on Reddit will fall through the floor. Reddit's natural level of user base seems to have been reached in the US, although there is potential for growth among international audiences.The CEO of Reddit faced negative feedback during a recent ask-me-anything session, with his net karma reaching a low of -111,199 and comments approaching the negative infinity. Several users expressed dissatisfaction with his non-answers and copy-pasting detailed statements. In addition, comments on Reddit can be manipulated to show more positive votes by following the comment link from a user's profile. Community members revolted against Reddit management in the past, achieving banning of subs and changes, but some doubt whether current protests against Reddit's monitization strategy will be successful. The CEO defended the company's profit-making focus, citing profit as the reason third-party apps are more profitable and that despite an 'eat-the-rich' narrative adopted by some users, Reddit just wants to earn enough to keep growing.Reddit's relationship with Imgur has cooled off due to Imgur's redirecting of direct image links to non-direct wrapper pages to show banner ads, making it difficult for Reddit to display images on its site. Imgur was initially created as an image hosting service for Reddit. Reddit has faced user backlash over the UI changes and pushing of its mobile client. There are concerns that Reddit will lose its cultural relevance over the next 5-10 years. The comment section features a discussion on the need for a decentralized internet with user-friendly publishing tools to replace centralized platforms. Advertisers have become the backbone of the web as users become their captive audiences.The article discusses the evolution of web publishing tools and how they have failed to bring non-technical users to publish their content. It argues that the decentralized model of the internet could have made scaling a centralized service easy. However, centralized platforms require complex operations, which have resulted in many issues. The decentralized model could have created a more user-friendly web had it been adopted from the start. The article also includes comments on the CEO of Reddit's response to third-party developers. Nevertheless, the comments are mostly criticizing the CEO's lack of professionalism.The CEO of Reddit, Steve Huffman, hosted an Ask Me Anything (AMA) where he addressed the company's profitability and the role of their free/cheap API in their success. Critics suggested that the company's behavior towards their community has caused a breakdown in trust, and that the company is essentially a freeloader on the community's value creation. There is debate on whether for-profit entities are the only ones capable of running and sustaining large online communities or if non-profit organizations and open protocols could also do so. Some are pointing to the demise of Reddit and the need for profit sharing mechanisms to ensure the sustainability of online communities. The community members have also discussed alternatives to Reddit, such as Usenet and Lemmy.- The value of large online communities comes from infrastructure, network effects, and brand recognition rather than \"the community\" as commonly claimed.\n- Reddit-like companies provide little to no unique value to the world, and if they shut down, another company would rise to do the same thing.\n- Without a Reddit-like company, the communities on Reddit wouldn't all be on the same site.\n- Investors have a right to expect profit from their investment in Reddit.\n- Reddit's primary motive is profit, but for long-term survival, it's essential to become profitable.\n- Reddit depends on the existence of the communities on its site and vice versa.\n- Reddit's costs are at least $400M per year, and they get over $400M from ads.\n- The good apps are free and don't show any ads, which makes it difficult for Reddit to compete and make money.The controversy surrounding Reddit's decision to limit access to its API, which has led to third-party apps going dark, has sparked a variety of opinions on the platform. Some users feel that Reddit exploits its communities, while others argue that the company needs to make money to keep the platform viable. Critics also point out that Reddit's API pricing structure, which is comparatively expensive, is part of the problem. Despite the backlash, it remains to be seen whether the boycott will have any lasting impact on Reddit's user base. Some users are deleting their accounts, while others believe that the vast majority of users won't care and that Reddit will continue to thrive despite the controversy.No meaningful content provided.",
    "hn_summary": "- Thousands of subreddits are planning to go dark in response to negative community feedback towards Reddit's leadership.\n- There are concerns about Reddit's monitization strategy, including accusations of undervaluing third-party apps and pushing changes that negatively impact moderators and user-generated content.\n- The article explores debates on the need for a decentralized internet and profit sharing mechanisms to ensure sustainability of online communities, as well as criticisms towards Reddit's API pricing and lack of professionalism from the CEO during an AMA session."
  },
  {
    "id": 36279639,
    "timestamp": 1686475329,
    "title": "Before he was the Unabomber, Ted Kaczynski was a mind-control test subject",
    "url": "https://www.washingtonpost.com/history/2023/06/11/unabomber-ted-kaczynski-harvard-experiment/",
    "hn_url": "http://news.ycombinator.com/item?id=36279639",
    "content": "Ted Kaczynski, the anti-technology anarchist who came to be known as the Unabomber, is led from the federal courthouse in Helena, Mont., in 1996. (John Youngbear/AP)Listen4 minComment473Gift ArticleTed Kaczynski, the anarchist and so-called Unabomber who died in a federal prison medical facility on Saturday, transformed from boy genius to terrorist, going from a star mathematics student to a feared assailant who targeted academics, scientists and industrialized society as a whole.Ted Kaczynski, who planted fear and death as the Unabomber, dies at 81Kaczynski entered Harvard University as a 16-year-old on a scholarship, after skipping the sixth and 11th grades. It was there that he was subjected to an experiment run by Harvard psychologist Henry A. Murray that was backed by the Central Intelligence Agency. Though he graduated with a mathematics degree, later completing a doctorate in the field before becoming a professor, questions remain over whether — or to what extent — he was affected by the experiment, which reportedly involved mock interrogations in which participants’ beliefs were harshly disparaged.Murray’s study was widely reported to be part of a CIA program code-named Project MK-Ultra, inspired by the use of mind-control techniques on U.S. prisoners of war in Korea by the Soviet Union, China and North Korea. The program sought to understand how to control subjects’ minds, sometimes using substances such as LSD, according to a document the CIA made publicly available in 2018. (There has not been evidence to suggest LSD or similar substances were used at Harvard on Kaczynski.)“The project attempted to produce a perfect truth drug for use in interrogating suspected Soviet spies during the Cold War,” the document says. “And generally to explore any other possibilities of mind control.”CIA Director Richard Helms ordered the destruction of many files related to MK-Ultra in 1973. Nevertheless, Kaczynski disclosed some of his apparent involvement in the study in correspondence from prison with the professor Alston Chase, who later wrote a book about the Unabomber.Chase argued in a June 2000 article in the Atlantic magazine that Kaczynski’s experiences at Harvard — his studies, overlapping with his roughly three-year participation in Murray’s experiment — helped create the Unabomber.“Thus did Kaczynski’s Harvard experiences shape his anger and legitimize his wrath,” wrote Chase, who died in 2022. “By the time he graduated, all the elements that would ultimately transform him into the Unabomber were in place …”In 1995, The Post weighed whether to print the Unabomber’s manifestoWhile working for what was a precursor to the CIA, Murray conducted an experiment that put subjects under mock interrogations, with blinding spotlights and verbal abuse, Chase wrote, citing a report by the psychologist and his colleagues. The Harvard study also involved asking the participants to write essays explaining their worldviews, which were then picked apart by interrogators, according to the History Channel, which cited Murray’s description of the sessions as “vehement, sweeping, and personally abusive.”Harvard did not immediately respond to a request for comment regarding the study.Though there has not been a definitive link between the study and Kaczynski’s actions, which killed three people and injured 23 others, some have suggested that the program may have exacerbated his schizophrenia.“The Harvard experiment was stressful and stress aggravates the symptoms of schizophrenia,” the psychologist Nigel Barber told History. “Otherwise, it would be a mistake to exaggerate the importance of this experience, or to see it as a major determinant of his anti-science and anti-technology political views.”Yes, Trump could run for president from prison. This candidate did it in 1920.Others argued against placing too much importance on the influence of the study on Kaczynski. The sociologist Todd Gitlin wrote in a Washington Post review of Chase’s book, “Harvard and the Unabomber: The Education of an American Terrorist,” that the “effect of Murray’s dubious, unethical experiment on Kaczynski is unknown.”With many of the records regarding the study restricted or destroyed, and with questions about peculiar behavior in Kaczynski’s childhood, it is unclear whether the study can be clearly tied to Kaczynski’s transformation into a domestic terrorist, Gitlin wrote.In his manifesto — published by The Post in 1995 with the encouragement of federal officials — Kaczynski likened science to a “surrogate activity” that is “directed toward an artificial goal that people set up for themselves merely in order to have some goal to work toward” or some sense of fulfillment.“Scientists work mainly for the fulfillment they get out of the work itself,” he wrote. “… Thus science marches on blindly, without regard to the real welfare of the human race or to any other standard, obedient only to the psychological needs of the scientists and of the government officials and corporation executives who provide the funds for research.”473CommentsGift ArticleMORE FROM RETROPOLISHAND CURATEDWhite supremacists attacked Johnny Cash for marrying a ‘Negro’ woman. But was his first wife Black?May 16, 2021He won Powerball’s $314 million jackpot. It ruined his life.October 23, 2018Two prominent men died on the Titanic. Were they secretly a couple?August 7, 2022View more",
    "summary": "- Ted Kaczynski, also known as the Unabomber, was a mathematics genius who entered Harvard University at the age of 16 on a scholarship.\n- Kaczynski participated in an experiment run by Harvard psychologist Henry A. Murray, which was backed by the Central Intelligence Agency and reportedly involved mock interrogations that criticized participants' beliefs.\n- There have been debates over whether or to what extent Kaczynski's participation in the experiment contributed to his transformation into a domestic terrorist, with some suggesting it may have exacerbated his schizophrenia.",
    "hn_title": "Before he was the Unabomber, Ted Kaczynski was a mind-control test subject",
    "original_title": "Before he was the Unabomber, Ted Kaczynski was a mind-control test subject",
    "score": 380,
    "hn_content": "The story reports on a new revelation that Ted Kaczynski (the Unabomber) had participated in a series of mind-control experiments while he was a student at Harvard. The experiments were part of a CIA-funded program known as MKUltra and were aimed at finding new ways to control human behavior. Participants were subjected to various techniques, including sensory deprivation, sleep deprivation, and drug-induced hallucinations, in an attempt to break down their personalities. The story also contains discussion between commenters, who bring up the issue of personalized training in military basic training and share their own experiences. Some comments discuss the broader topic of government experimentation and the potential for such programs to run amok.The comments section diverges from the topic of China's handling of the pandemic to discuss American imperialism and atrocities committed by the US. Some argue that the US has allowed for a level of open public discussion of its wrongdoings not found in other major imperial powers. The discussion touches on topics such as torture, the Guantanamo Bay prison, and the invasion of Iraq. Sarcasm and whataboutism are present in some comments. Some commenters also provide historical context for the discussion. There is no new information or a specific release mentioned in the text.The comments in this forum discuss several topics, but the common thread is the questioning of widely held assumptions. The writers argue that specific biases influence scientific research funding, which in turn affects the relevance and effectiveness of scientific research. They also discuss the power of language to shape and guide our thinking. The discussion touches on the validity of conspiracy theories and the marketability of sensational ideas. However, there is no clear consensus on any of these topics.The post discusses conspiracy theories and the tendency of conspiracy theorists to move on to new, more far-fetched theories once one is debunked. Examples of popular conspiracy theories include the moon landing being faked and Jeffrey Epstein's death being a murder. However, the post argues that there is little scientific evidence to support most conspiracy theories and that actual conspiracies tend to be more mundane. A discussion about gun control and access to mental health care is also included, with some users arguing that psychiatric medications may contribute to mass shootings. Overall, the post emphasizes the importance of critical thinking and finding scientific evidence to support claims.The post includes discussions on mass shootings and psychological experiments run by the CIA, as well as theories on the factors behind school shootings in the US. The author of the post expresses skepticism about the possibility of the CIA using psychological experiments to create sleeper agents. The comments include discussions on the dangers of conspiracy theories and the role of media in influencing social behaviors. Additionally, the comments touch upon factors such as access to firearms, healthcare, and societal decay that may contribute to the frequency of school shootings in the US.The comments section revolves around the topic of MKULTRA and the possibility of it being connected to recent mass shootings. Some commenters are skeptical about the effectiveness of these mind control experiments, while others argue that the government has a history of manipulating individuals. A podcast recommendation on the subject is given. The article itself focuses on the potential involvement of Ted Kaczynski, the Unabomber, in Murray's unethical experiment, but concludes that there is no known proof of this.No meaningful content to summarize. The discussion thread on the article includes a debate on unsubstantiated claims of Ted Kaczynski's involvement in MK-Ultra, as well as his views on industrialization and the environment. Some commenters express agreement with his perspective, while others criticize it. There is no particular news or recent development that prompted the conversation.No meaningful content to provide a summary.",
    "hn_summary": "- The article reports on Ted Kaczynski's participation in mind-control experiments while at Harvard, funded by the CIA's MKUltra program.\n- Commenters discuss government experimentation and question widely held assumptions about scientific research and language's power to shape thinking.\n- The post emphasizes critical thinking and finding scientific evidence to support claims, while also discussing mass shootings in the US and debunking conspiracy theories."
  },
  {
    "id": 36281543,
    "timestamp": 1686492636,
    "title": "The Dutch government wants automatic permission to target victims of hackers",
    "url": "https://berthub.eu/articles/posts/dutch-intel-law-about-intel/",
    "hn_url": "http://news.ycombinator.com/item?id=36281543",
    "content": "The Dutch government wants to automatically and administratively gain permission to target victims of hackersPosted onJun 07 2023This is a mirror of the original about:intel post, since the about:intel server is sadly overloaded.The Dutch government is proposing adding a lex specialis to its existing intelligence and security services act. This addition significantly changes the scope of many powers and also extends who they can be applied to.A draft of an English summary of this proposed law can be found here. A far longer summary in Dutch is here.On this page I’d like to go over just one specific element of this new law: automatic extension of warrants to hacking victims (’non-targets’). Under the new law, the criteria for targeting non-targets actually become more lenient than for targeting actual targets. I would also hope to hear from experts on what the ECtHR might imply for this automatic extension and the newly proposed oversight. At the very end of this article you will find the original text of the articles, and my best stab at a translation.Current situationThe Dutch law (’Wet op de inlichtingen – en veiligheidsdiensten 2017’) has articles on special powers like targeted interception, bulk interception and hacking. In addition, there is a list of interests the services have to protect, and a list of intelligence they should be gathering. Crucially, the powers and the interests are not tied to each other directly.This means that the law makes it possible to perform targeted operations on organizations or people that are not themselves targets. One of the two oversight bodies (CTIVD, ex-post) has written in 2017 that such ’non-target’ activities have to meet an elevated standard.Translated, this states (in two places):“When hacking non-targets, a heightened proportionality test applies: there must be compelling operational interests that outweigh the importance of protecting fundamental rights and the interests of the non-target.”“The use of special powers against a non-target is a serious measure that must be used very sparingly. An elevated proportionality test must be met. In order for the use to be proportional, the services must demonstrate that the interest in infringing upon the privacy of the non-target is so great that this infringement is justified. The privacy of the non-target is given extra weight, because as mentioned, the target does not itself provide a reason for investigation by the services. She or he is only a means to the actual target. To maintain balances, the interest that the services have in using special measures against the non-target must be greater than usual. If this is not the case, the scales are not balanced, and the application is not proportional and therefore not lawful. Situations where there are one or more concrete indications of a direct threat to national security can be considered as compelling operational interests.”Currently, the independent ex-ante regulator (TIB) reviews the lawfulness of hacking and interception requests/warrants. The conclusion of this review is binding. This mode of operation corresponds to the ECHR/ECtHR standard for independent authorization (Convention 108+ Article 11(3)).New situation: automatic extensionIn the new situation, hacking, targeted interception and data access operations get an automatic extension beyond the actual target of the warrant. If a warrant is requested to intercept the communications of a specific hacking organization, the warrant now also extends to victims of this hacking group. Or, more concretely, if your computer gets hacked by group X and there was a warrant to intercept the traffic of group X, the Dutch services now gain automatic approval to also intercept your communications or hack you.In the law is it worded that any automated works ’taken into use’ by the original targeted organization are also automatically in scope of the warrant.Enlarging the warrant in this way is an administrative addition which involves no further approval process, not internally, nor externally. This in contrast to the original warrant which had to go past internal review, the head of service and the minister.The ex-post regulator (CTIVD), however, does get notified of such an administrative addition. The CTIVD can optionally launch an investigation to find if it agreed with this addition. If it disagrees, it can inform the minister and the Dutch parliament, and demand that the operation be halted. The services can also appeal this demand with one of the many Dutch supreme courts, and this court (the Council of State) can stay the order if so requested. This is a complicated procedure which is very different than ex-ante authorization.Some initial analysisThere is a tension in these new powers. A warrant on ‘organization X’ may now administratively also be enlarged to target internet subscriptions or devices from entirely unrelated people. This creates the fiction that organization X now extends to random other people.In addition, whereas previously there was an elevated standard for applying powers to non-targets, there is now actually a vastly reduced standard compared to actual targets. The ex-ante regulator TIB will need to be convinced that it is proportional to target organization X. However, any non-targets now no longer benefit from an elevated standard. The non-targets in fact benefit from no standards at all anymore.It appears that Dutch legislators are laboring under the assumption that they can apply powers to the non-target, but are actually targeting organization X alone. The warrants however directly impact all communications or the entire device, and not just the parts used by organization X.Implications for Article 8 ECHRI would be very interested in hearing thoughts from experts on how Article 8 ECHR bears on all this. Specifically, is the administrative addition of non-targets, with only the possibility of a binding but very heavy handed review afterwards, in line with recent jurisprudence? And perhaps this might differ for the three specific powers, targeted interception, hacking and requesting a copy of all stored customer data. This last article can be used to retrieve the contents from any servers or computers.Original textDutch laws come with a large ’explanatory memorandum’, which while not actually part of the law, is taken very seriously by courts, to the point that any understanding of the law must involve reading this memorandum. The memorandum can significantly alter the interpretation of a law.Article 5, sixth member:“In aanvulling op het bepaalde in artikel 45, achtste lid, van de Wiv 2017, omvat de verleende toestemming tevens de bevoegdheid om, voor de duur van de verleende toestemming, binnen te dringen in een ander geautomatiseerd werk dat door de desbetreffende persoon of organisatie in gebruik is voor zover dat in de plaats treedt van of een aanvulling is op het geautomatiseerde werk waar oorspronkelijk de toestemming voor is verleend”Or:“In addition to article 45, eighth member of the Wiv 2017, the permission granted also contains authorization for, during the validity of the warrant, to also enter automated works of the person or organization targeted by the warrant, in so far as this new automated work is in addition to or replacement of an automated work the original authorization applied to.”An ‘automated work’ in this specific Dutch law has an extremely broad interpretation and includes such things as phones, computers, servers, websites, databases and mailboxes.",
    "summary": "- The Dutch government is proposing an addition to its intelligence and security services act that would automatically extend warrants to hacking victims.\n- This means that if group X is being targeted, the warrant would also extend to victims who were hacked by group X.\n- The addition, which involves no further approval process, raises questions about privacy and whether it complies with Article 8 of the ECHR.",
    "hn_title": "The Dutch government wants automatic permission to target victims of hackers",
    "original_title": "The Dutch government wants automatic permission to target victims of hackers",
    "score": 242,
    "hn_content": "The Dutch government has passed a law that automatically extends the scope of warrants for hacking, targeted interception, and data access operations, to the victims of the targeted organizations. The warrant for intercepting the communication of a specific hacking organization now also extends to targets of that group. Critics suggest it is a backdoor route for government agencies to hack into the computers of innocent victims, and would be a test case for authoritarianism. Others believe it is a practical step for law enforcements to act on cyberattacks, and cases would only proceed if it’s proportional and non-targets are considered.\nThe Netherlands has introduced a new national security law that provides intelligence and security services with legal rights to conduct surveillance on all Dutch citizens without obtaining a warrant. The law, which grants automatic permission for targeted surveillance, covers everything from phones, computers and servers to mailboxes and databases. Its advocates believe it will reduce the time needed to track terrorists, catch cyber criminals, prevent the misuse of funds and detect and combat other security threats. However, critics argue that surveillance without a warrant amounts to little more than a violation of privacy and will result in widespread abuses similar to the DMCA. Concerns have also been raised that the law will be used to target political opponents.",
    "hn_summary": "- Dutch government passes law allowing warrants for hacking, targeted interception, and data access operations to extend to victims of targeted organizations, leading to concerns about potential government overreach and infringement on innocent victims' privacy. \n- Advocates argue this is a practical step for law enforcement to combat cyberattacks, and targets would only be pursued if proportional and non-targets are considered. \n- The Netherlands has also introduced a new national security law that grants automatic permission for targeted surveillance but has been met with criticism for violating privacy and potentially being used to target political opponents."
  },
  {
    "id": 36286370,
    "timestamp": 1686522444,
    "title": "Intel is all-in on backside power delivery",
    "url": "https://spectrum.ieee.org/backside-power-delivery",
    "hn_url": "http://news.ycombinator.com/item?id=36286370",
    "content": "SEMICONDUCTORSNEWSIntel Is All-In on Backside Power DeliveryThe company’s PowerVia interconnect tech demonstrated a 6 percent performance gainSAMUEL K. MOORE08 JUN 20235 MIN READIntel’s Power Via demo chip shows that there will be very little silicon left in future chips. The slim silicon part [center white line] contains all the transistors. Power-delivering interconnects sit below them and data-slinging interconnects above. INTEL",
    "summary": "- Intel showcased its PowerVia interconnect technology, which delivers power through the backside of a chip, leading to a 6% performance gain. \n- The technology allows for more compact and efficient chips with little need for silicon, as power-delivering interconnects sit below the transistors and data-slinging interconnects above. \n- The demonstration suggests Intel's commitment to innovative chip technology that prioritizes performance and efficiency.",
    "hn_title": "Intel is all-in on backside power delivery",
    "original_title": "Intel is all-in on backside power delivery",
    "score": 226,
    "hn_content": "Intel is heavily invested in backside power delivery technology, which involves placing the silicon area of the chip upside-down on the motherboard to boost heat dissipation. The technology features wiring on both sides of the chip with transistors buried underneath, which presents challenges for debugging, and Intel is investing billions in research and development to fine-tune the system. The change marks a significant industry shift that could improve efficiency for portables and desktop devices. As for competitors, Intel aims to lead the pack with a two-year head start over TSMC, with new nanosheet transistors on the horizon. The company has recently seen a changing of the guard, with new CEO Pat Gelsinger taking the helm and promising greater engineering focus.Intel's AVX-512 is disabled on Lake, Meteor Lake is not happening on the desktop, and 2.5GbE is returning with its sixth stepping. Despite its underperformance, Intel is making a turnaround with their surprisingly competitive GPU performance and hopefully Intel Foundry Services. Intel is lagging behind AMD, but their APUs are still plenty fast, although the new P's are judged as way too big and hot. It is challenging to compare Intel and AMD because the former is a fab technology and the latter is fabless. Chlorine trifluoride is used in cleaning chemical vapor deposition chambers, and it is hypergolic with anything, which makes it quite dangerous. Chip-making technology is fascinating.There does not appear to be any meaningful content in this text for a tech news summary.",
    "hn_summary": "- Intel invested heavily in backside power delivery technology to improve heat dissipation, with wiring on both sides of the chip and buried transistors.\n- The system presents challenges for debugging, but could improve efficiency for portables and desktop devices.\n- Intel aims to lead competitors with a two-year head start over TSMC and new nanosheet transistors on the horizon, while also seeing a changing of the guard with new CEO Pat Gelsinger."
  },
  {
    "id": 36279129,
    "timestamp": 1686468974,
    "title": "CS:GO: From Zero to 0-Day",
    "url": "https://neodyme.io/blog/csgo_from_zero_to_0day/",
    "hn_url": "http://news.ycombinator.com/item?id=36279129",
    "content": "A team of researchers discovered three remote code execution (RCE) vulnerabilities in the popular game, Counter-Strike: Global Offensive, which can be triggered when the game client connects to a malicious python CS:GO server. The vulnerabilities were identified by combining four different logic bugs. The researchers present a proof of concept (POC) exploit that explains how the bugs led to RCE on the client. The post discusses the game's history, security research approach, and specific tactics used to obtain information about the target. The post also explains issues within the game, such as arbitrary file download due to extension stripping, arbitrary text file write in the game directory, and privilege escalation. Additionally, the post discusses the discovery of four logic bugs and the full bug chain that allowed attackers to execute privileged commands on the client.- A new exploit chain for the game Counter-Strike: Global Offensive (CS:GO) has been discovered.\n- The exploit chain involves a series of logic bugs that allow an attacker to execute privileged commands on a client connecting to a malicious server.\n- The bugs were discovered through the bug bounty program run by Valve, the company that develops CS:GO.\n- The researchers who found the bugs invested a significant amount of time in building a full-chain exploit demonstrating RCE impact, which was required for the bug bounty program.\n- The bugs were eventually fixed by Valve after a long process, and the researchers received a bounty of 7.5k per bug.\n- The researchers learned important lessons about bug hunting, including the importance of chaining bugs together to maximize their impact.",
    "summary": "- Researchers found three critical vulnerabilities in the game Counter-Strike: Global Offensive (CS:GO).\n- The vulnerabilities can be triggered by connecting to a malicious python server, and allow attackers to execute privileged commands on the client.\n- The bugs were found through Valve's bug bounty program, and the researchers received a bounty of 7.5k per bug.",
    "hn_title": "CS:GO: From Zero to 0-Day",
    "original_title": "CS:GO: From Zero to 0-Day",
    "score": 215,
    "hn_content": "Valve took over a year to fix a full remote code execution (RCE) vulnerability in Counter-Strike: Global Offensive (CS:GO), which could have had catastrophic effects for users, and offered a low payout to the person who discovered it. The security of networked games, often built-in memory-unsafe languages with shortcuts taken for performance, does not receive special attention from developers, leading to many other potential vulnerabilities. Many of the games are implemented with unsafe C++, often have complex anti-cheats with built-in scripting languages, and involve constantly parsing inputs from the network. Valve is currently working on CS2, which is a rewrite of CS:GO using the Source 2 engine, to be released this summer. Debug symbols are a way to decompile debug data from a binary, but make it easier for attackers to reverse engineer a binary.Valve's popular game, Counter-Strike: Global Offensive (CS:GO), was found to have a critical vulnerability that could be exploited to take over computers running the game. This flaw existed due to an old remote code execution (RCE) vulnerability in the game's Source game engine that allows for attackers to execute arbitrary code on players' machines when they connect to a server. The flaw was discovered by security researchers who submitted it to Valve's bug bounty program, which took over a year to fix, suggesting a lack of prioritization of security by the gaming giant. This case highlights the frequent presence of exploitable vulnerabilities in games and the importance of prioritizing security measures during game development.-The debate about the importance of security practices in game development.\n-Lack of security practices results in cheating and daily frustration.\n-Streaming may become a norm for competitive online games.\n-Hacks can rely on visual/audio cues and latency is an issue for competitive games.\n-The debate also includes Linux clients and a specific bug in CSGO source code is mentioned.",
    "hn_summary": "- Valve took over a year to fix a full RCE vulnerability in CS:GO, indicating a lack of prioritization of security by the company.\n- Networked games, particularly those built with C++, are vulnerable to potential security weaknesses due to shortcutting for performance and lack of attention from developers.\n- The discovery of the vulnerability and Valve's response highlight the importance of prioritizing security measures during game development."
  },
  {
    "id": 36283395,
    "timestamp": 1686504367,
    "title": "JPEG XL against AVIF tested on ImageEngine",
    "url": "https://mastodon.online/@jonarnes/110514451857948151",
    "hn_url": "http://news.ycombinator.com/item?id=36283395",
    "content": "Jon Arne S.@jonarnes@mastodon.onlineSo Safari will support jxl . When Chrome announce AVIF support the internets had high expectations! Reality showed that AVIF was not as good as the hype.Will this also be the case with #jxl ?I've done some quick initial tests with ImageEngine to see what to expect when using large scale services (not handcrafting every single image). Comparing avif to jxl, jxl reduces file size by an additional 11%.Still, visual quality (dssim) is 13% better with jxl.Jun 09, 2023, 06:18 · · Web ·23·302dJim@jimbo2150@mastodon.social@jonarnes Next will be getting more developers to learn about and test to see if it fits their own needs. However, it has the best chance of replacing all the existing JPEGs, still GIFs (mostly memes), PNGs, and WebPs (both lossy and lossless) with smaller files at the same or better quality. It has huge potential.13hidahoBLM@idahoBLM@jimbo2150 @jonarnes I have found a lot of resistance to webp among communities I frequent. To be fair I often go to a share an image somewhere and it's unsupported, which is annoying, but otherwise seems a serviceable file type for my own uses. I wonder if we will see similair resistance going forward.010htxt.file@txt_file@chaos.social@jonarnes What do these diagrams show?09hsadmin@sadmin@social.tchncs.de@jonarnes why is original equivalent to jpeg? Was the source material encoded with jpeg? I think sources should be uncompressed to avoid double compression and give comparable results.0Jon Arne S.@jonarnes@mastodon.onlineSo Safari will support jxl . When Chrome announce AVIF support the internets had high expectations! Reality showed that AVIF was not as good as the hype.Will this also be the case with #jxl ?I've done some quick initial tests with ImageEngine to see what to expect when using large scale services (not handcrafting every single image). Comparing avif to jxl, jxl reduces file size by an additional 11%.Still, visual quality (dssim) is 13% better with jxl.Jun 09, 2023, 06:18 · · Web ·23·302dJim@jimbo2150@mastodon.social@jonarnes Next will be getting more developers to learn about and test to see if it fits their own needs. However, it has the best chance of replacing all the existing JPEGs, still GIFs (mostly memes), PNGs, and WebPs (both lossy and lossless) with smaller files at the same or better quality. It has huge potential.13hidahoBLM@idahoBLM@jimbo2150 @jonarnes I have found a lot of resistance to webp among communities I frequent. To be fair I often go to a share an image somewhere and it's unsupported, which is annoying, but otherwise seems a serviceable file type for my own uses. I wonder if we will see similair resistance going forward.010htxt.file@txt_file@chaos.social@jonarnes What do these diagrams show?09hsadmin@sadmin@social.tchncs.de@jonarnes why is original equivalent to jpeg? Was the source material encoded with jpeg? I think sources should be uncompressed to avoid double compression and give comparable results.0",
    "summary": "- Safari is set to support JPEG XL, raising expectations like the hype that surrounded AVIF, but recent tests suggest that JPEG XL can go one step further by reducing file sizes by an additional 11%, while visual quality is 13% better than AVIF.\n- There is a need for more developers to test using JPEG XL for their needs, as it has the potential to replace all existing JPEGs, still GIFs (mostly memes), PNGs, and WebPs (both lossy and lossless) while delivering smaller file sizes with a better quality.\n- However, there may be resistance to JPEG XL among some communities, as seen in the current response to WebPs, where sharing unsupported images is a common issue.",
    "hn_title": "JPEG XL against AVIF tested on ImageEngine",
    "original_title": "JPEG XL against AVIF tested on ImageEngine",
    "score": 206,
    "hn_content": "- JPEG XL and AVIF have been tested on ImageEngine, with differing results in terms of detail preservation and artifacting.\n- One advantage of JPEG XL is its universality and ability to handle a variety of image formats and compression rates.\n- Both JPEG XL and AVIF have strengths and weaknesses, and the best format depends on the specific image being compressed.\n- Human perception and psychology play a role in how images are judged, making objective metrics less reliable in determining the best compression format.\n- JPEG XL and AVIF can coexist alongside other image formats in HTML, with modern browsers allowing for \"best fit\" image selection.A real-world benchmark comparing AVIF and JPEG XL image formats revealed that AVIF on average shows better quality results at lower file sizes in the lowest quality setting. JPEG XL supports lossless recompression of JPEG images, advanced features like 16-bit color support, YUV444, and progressive rendering. However, benchmarking is limited to visual quality, file size, compression time, decompression time, browser support, toolchain support, patent restrictions, and use cases. Notably, using smaller images via changing format can significantly improve page load time, and the html picture tag makes it easy to serve the same image in multiple formats. Moreover, the ability of JXL to \"upgrade library\" is an incredible achievement. Image decoders are easily distributed, and most image formats are patent-free or expired.- Webp provides an easy migration path for existing sites without high-resolution masters that can be re-encoded into AV1 or webp.\n- HE-AAC is recommended as the audio format for podcasts due to universal support on modern media platforms and operating systems for over a decade.\n- Opus has wide support and can sound better than MP3 at less than half the bitrate for audio files.\n- WebP images are smaller and can significantly reduce page load time, but some argue that JPEG and PNG are good enough for most use cases.\n- Lossless webp is typically smaller and compresses faster than optimized PNG encoders, making it a good option in 2023 for most images.\n- Neither PNG nor JPEG is a good choice because each has its own restrictions, unless the user knows all their images fall into a category where either format will provide efficient compression.\n- Higher-quality HDR at reasonable bitrates still presents a challenge.",
    "hn_summary": "- JPEG XL and AVIF were tested on ImageEngine, with varying results in terms of detail preservation and artifacting.\n- JPEG XL has the advantage of universality and handling a variety of image formats and compression rates.\n- Both formats have strengths and weaknesses, making the best format choice dependent on the specific image being compressed."
  },
  {
    "id": 36279375,
    "timestamp": 1686471768,
    "title": "CIA 2010 covert communication websites",
    "url": "https://cirosantilli.com/cia-2010-covert-communication-websites",
    "hn_url": "http://news.ycombinator.com/item?id=36279375",
    "content": "An article discussing covert communication channel websites used by the CIA in the late 2000s to early 2010s has been released. These websites led to the imprisonment and execution of several assets in Iran and China. The existence of such websites was first reported in November 2018 by Yahoo News. The article discusses the methodology used to identify some of these websites and lists probable candidates found so far. The article also includes a call for assistance to find more such websites. Methodologies, including IP range searches, JavaScript reverse engineering, and Google searches, were used to identify the websites. It is worth noting that the network fell in 2013, and there have been fully public disclosures in 2018 and 2022.",
    "summary": "- The CIA used covert communication channel websites in the late 2000s to early 2010s which led to the imprisonment and execution of several assets in Iran and China.\n- The article examines the methodology used to identify these websites and provides a list of probable candidates, calling for further assistance.\n- The network fell in 2013, and the existence of these websites was first reported in 2018, with fully public disclosures in 2018 and 2022.",
    "hn_title": "CIA 2010 covert communication websites",
    "original_title": "CIA 2010 covert communication websites",
    "score": 201,
    "hn_content": "Hacker News is discussing a recent post regarding 2010 CIA covert communication websites and the mistakes made in their design, including the use of subsequent IP numbers/same file layouts on sites; some have criticized the agency for this. The post sparked conversations about techniques used by intelligence services, including the faking of Soviet passports and the methods used to gather intelligence on allies and other countries. Some users attempted to decompile .jar files used for covert communication, discovering swing (gui) drawing code, references to flash, activex, and more; however, the code is obfuscated. The Wayback Machine being used and crawled upon by others and the speculation about log of who instigated has also been discussed. An expert journalist discovered the CIA's covert communication websites by doing some vacuum-cleaning work. The technology used to obtain these sites involves some technical details. Some commentators believe that TOR is a bad tradeoff for single agents, and a larger group like opposition movements or rebel groups would benefit from using it. An individual mentions that using commercial browser fingerprinting and broad geolocation with certain behavior sequences could help identify the assets trying to make contact; once detected, the NSA or partner's interception could be taken over. Overall, the discussion revolves around the implications of the CIA's covert communication websites and possible ways to make them better and avoid detection.",
    "hn_summary": "- CIA's mistakes in designing covert communication websites criticized on HN.\n- Some users attempted to decompile .jar files and found swing (gui) drawing code and references to flash, activex, and more.\n- TOR is criticized as a bad tradeoff for single agents, and commercial browser fingerprinting and geolocation are suggested to detect the assets."
  },
  {
    "id": 36280772,
    "timestamp": 1686486694,
    "title": "Mental Liquidity",
    "url": "https://collabfund.com/blog/mental-liquidity/",
    "hn_url": "http://news.ycombinator.com/item?id=36280772",
    "content": "Mental LiquidityMAR 29, 2023SHARE ↓by Morgan Housel@morganhouselI recently heard a phrase I love: Mental liquidity. It’s the ability to quickly abandon previous beliefs when the world changes or when you come across new information.It shouldn’t be controversial. But mental liquidity is so rare. Changing your mind is hard because it’s easier to fool yourself into believing a falsehood than admit a mistake.Albert Einstein hated the idea of quantum physics.His own brand of physics was an extension of classic Newtonian physics, which viewed the universe as working in clean, rational, ways that could be measured with precision. Then quantum theory came along with the wild idea that some parts of the physical world could not be measured, because the very act of measuring a subatomic particle changed its movement. The best we could do when trying to measure parts of the world was to come up with probabilities and likelihoods.That was practically heresy to Einstein, who let his quantum theory peers know how he felt.“One cannot make a theory out of a lot of ‘maybes,’” he once told a group of physicists in 1927. God, he said, “does not play dice.”Even when he remained professional about his misgivings, Einstein stood firm. “I admire to the highest degree the achievements of the younger generation of physicists that goes by the name quantum mechanics,” he once told an interviewer, “But I believe that the restriction to statistical laws will be a passing one.”His peers were disappointed. “Einstein, I’m ashamed of you,” said quantum physicist Paul Ehrenfest, who felt the great physicist was being as stubborn as those who once doubted Einstein’s theory of relativity.Within five years, a group of quantum physicists would win the Nobel Prize, solidifying their contributions and validating quantum theory.Left unmentioned during the award ceremony was that the group was nominated by Einstein himself.“I am convinced that this [quantum] theory undoubtedly contains a part of the ultimate truth,” he wrote in his nomination.He had come around.So much of what people call “conviction” is actually a willful disregard for facts that might change their minds. It’s dangerous because conviction feels like a good attribute, while its opposite – being wishy-washy – makes you feel and sound like an idiot.There’s this thing in psychology called the end of history illusion, which is the idea that people are aware of how much their personality has changed in the past, but they assume it will be stable in the future. I laugh at who I was at age 20, but I assume that by age 60 I’ll roughly be the same person I am today. Part of the reason it occurs is because it’s too painful to accept that the beliefs I hold today might be wrong, temporary, or subjective.Beliefs take effort and investment, and it hurts to realize that there may be limited ROI on your hard-fought convictions. For a lot of things in life – particularly politics, investing, and relationships – people don’t necessarily want the truth; they want certainty. Changing your mind is hard because it’s an admission that the certainty you once thought you held was an illusion. The path of least resistance is to cling to beliefs for dear life.A question I love to ask people is, “What have you changed your mind about in the last decade?” I use “decade” because it pushes you into thinking about big things, not who you think will win the Super Bowl.I am always so suspicious of people who say, “nothing.” They act like it’s a sign of intelligence – that their beliefs are so accurate that they couldn’t possibly need to change. But I think it’s the surest sign of ignorance and stubbornness.Visa founder Dee Hock had a great saying: “A belief is not dangerous until it turns absolute.” That’s when you start ignoring information that might require you to update your beliefs. It might sound crazy, but I think a good rule of thumb is that your strongest convictions have the highest chance of being wrong or incomplete, if only because they are the hardest beliefs to challenge, update, and abandon when necessary.Two critical things to keep in mind here:Be careful what beliefs you let become part of your identity. Religion and politics are contentious because almost by definition your beliefs are part of your identity – you’re not just dealing with ideas and philosophies, but tribes and belonging. Another Dee Hock quote applies here: “We are built with an almost infinite capacity to believe things because the beliefs are advantageous for us to hold, rather than because they are even remotely related to the truth.” Things get dangerous when people let their investing and economic beliefs fall into the same category.Most fields have lots of rules, theories, ideas, and hunches. But laws – things that are unimpeachable and cannot ever change – are extremely rare. Some fields only have a handful. A big problem arises when you try to force rules and theories to become laws. The few laws tend to be the most important things in any field. But everything else, like Einstein said, is just a theory of maybes.SHARESign up for more Collab Fund content",
    "summary": "- Mental liquidity is the ability to quickly abandon previous beliefs when the world changes or when new information is available.\n- Changing your mind is hard because it's easier to fool yourself into believing a falsehood than admit a mistake, but it's important to allow room for the possibility that your convictions might be wrong or incomplete.\n- People tend to cling to their beliefs because it's too painful to accept that their beliefs might be wrong, temporary, or subjective. Therefore, it's crucial to be careful what beliefs become a part of your identity, and understand that most fields only have a handful of laws, while everything else is just a theory of maybes.",
    "hn_title": "Mental Liquidity",
    "original_title": "Mental Liquidity",
    "score": 199,
    "hn_content": "The article on Hacker News discusses the concept of \"mental liquidity,\" which is the ability to entertain new ideas without adopting them permanently, increasing your knowledge over time. There is a debate on whether this method is sufficient for creating knowledge or not, as it can lead to false reasoning and confirmation bias. The issue of growing ideological filter bubbles is closely related to this concept. Death is suggested as a solution, forcing us to reconstruct our beliefs and behaviors. The importance of learning through challenging beliefs is highlighted, and avoiding echo chambers is encouraged. The difference between beliefs and hypotheses is discussed, with both being upgradeable to a higher level of truth. The article concludes with a personal anecdote about finishing an Einstein biography.No meaningful content to summarize.The article discusses the challenges of changing one's mind and the importance of mental flexibility or \"mental liquidity.\" Einstein is cited as an example of someone who was able to change his mind, despite his initial dislike of quantum physics. The concept of mental liquidity is compared to the clinical framework of Acceptance and Commitment Therapy. The article references Dee Hock's quote, \"A belief is not dangerous until it turns absolute.\" The author emphasizes the need for intellectual integrity and encourages readers to ask themselves what they have changed their mind about in the last decade. Various commenters provide additional insights and references to related concepts such as value rigidity and self-authorship.The conversation on an online forum discusses mental flexibility, the ability to change beliefs and ideas. The community shares various perspectives and experiences, including the importance of cognitive flexibility, not being emotionally attached to ideas, and avoiding sunk cost fallacy. Participants also suggest cultivating humility, not letting beliefs become part of identity, and being willing to change. One user recommends debating and exploring issues from multiple perspectives, while another advises avoiding becoming too rigid in thinking. Overall, the discussion emphasizes the value of openness and adaptability in various contexts, including personal growth, scientific inquiry, and building a successful startup culture.",
    "hn_summary": "- The article discusses \"mental liquidity,\" the ability to entertain new ideas without permanently adopting them, and the importance of intellectual integrity and challenging beliefs.\n\n- The need for cognitive flexibility, cultivating humility, avoiding sunk cost fallacy, and exploring issues from multiple perspectives are highlighted in the online forum discussion.\n\n- The importance of openness and adaptability for personal growth, scientific inquiry, and building a successful startup culture is emphasized in both the article and online forum discussion."
  },
  {
    "id": 36283003,
    "timestamp": 1686502130,
    "title": "One man's 8-bit quest to finish his teenage Commodore 64 RPG",
    "url": "https://arstechnica.com/gaming/2023/06/one-mans-40-year-8-bit-quest-to-finish-the-c64-rpg-he-started-in-1984/",
    "hn_url": "http://news.ycombinator.com/item?id=36283003",
    "content": "EPIC QUEST —One man’s nearly 40-year, 8-bit quest to finish his teenage Commodore 64 RPGDisks and tapes are fallible, so it's back to assembly code and pencil notes.KEVIN PURDY - 6/9/2023, 10:28 AMEnlarge / The disks and diagrams Mike Brixius has to work with in finishing his 1984 CRPG project.YouTube/RavenWolf Retro Tech106WITHThere are stories that some of us, at a certain stage of adulthood, should never hear. Not if we value our time or our storage space. I regret to inform you that Mike Brixius, on his RavenWolf Retro Tech channel, offers just such a story about his quest to finish his own Commodore 64 CRPG from 1984. He will be able to do it, too, because he kept all the disks, tapes, notes, and hand-documented assembly code print-outs ever since his teenage project.\"It's one of those loose threads in my life that I deeply regret,\" Brixius says in his video. He hopes his Patreon supporters and YouTube community can give him the \"moral support and accountability\" he needs to complete his game after all these years.RavenWolf Retro Tech's video, launching his campaign to restore his 1984 C64 CRPG, Digital Dungeon Master (DDM), to its proper glory.Digital Dungeon Master (DDM) was based partly on the Avalon Hill tabletop games Brixius loved at the time, but more so on Avalon Hill's foray into dungeon-crawling RPGs, Telengard. Brixius wanted to re-create Telengard's limited line of sight but add in a surface world, akin to that of another favorite of his, Ultima IV.EnlargeBrixius was working without an assembler back then, something he deeply regrets. He does not, however, regret his pack-rat tendencies, which have left him with these pieces to pull together:Executable machine code, mostly from May 1985, but some from as late as 1989, with hand-written notes on itA printed-out memory dump of all 4K of RAM from the game at some pointCassettes and disks, some of which load, but none with an uncorrupted game runningListings of the code from 1986, used to test machine language routinesExtensive handwritten and drawn notes, maps, and other explanations of the game's design.So far, Brixius has, by hand-typing in his old code, gotten a facsimile of a simple overworld and dungeon working. He has already figured out one memory-saving fix, setting a single bit to define each wall space (wall, open door, closed door, secret door) rather than the two-bit system he originally devised. The game takes up 12K of RAM, split roughly evenly between code and data. Brixius figures his dungeons can be about 64×64 squares before he hits the C64's limits.Enlarge / A hand-drawn map that Brixius is relying on to help him finish his C64-era CRPG.YouTube/RavenWolf Retro TechPatrons and YouTube followers can help Brixius decide which projects and game aspects to tackle next in each of his planned quarterly sprints. At the moment, he has—with nearly 40 years' hindsight—decided to make source control his first priority, followed by completing his map code and fixing the color scheme in dungeons. He cautions that he intends to keep the project true to its early days CRPG roots; it \"won't be as elaborate as something like The Bard's Tale.\"We first saw Brixius' quest at Hackaday, and we'll keep an eye on his progress. He plans to finish it by 2024, but let's all cut him some slack on that.READER COMMENTS106WITHKEVIN PURDYKevin is a senior technology reporter at Ars Technica, covering a variety of technology topics and reviewing products. He started his writing career as a newspaper reporter, covering business, crime, and other topics. He has written about technology and computing for more than 15 years.Channel Ars Technica← PREVIOUS STORYNEXT STORY →Related StoriesToday on Ars",
    "summary": "- Mike Brixius is attempting to finish his Commodore 64 CRPG project from 1984, Digital Dungeon Master, almost 40 years later with the help of his supporters.\n- The game is based on Telengard, with Brixius wanting to re-create its limited line of sight while adding a surface world similar to Ultima IV, and he's working with executable machine code, printed-out memory dumps, handwritten notes, maps, and other explanations of the game's design.\n- Brixius has already accomplished creating a facsimile of a simple overworld and dungeon working and has committed to finishing the project by 2024.",
    "hn_title": "One man’s 8-bit quest to finish his teenage Commodore 64 RPG",
    "original_title": "One man’s 8-bit quest to finish his teenage Commodore 64 RPG",
    "score": 196,
    "hn_content": "A man has successfully completed his Commodore 64 RPG game that he started as a teenager in 1984. He achieved this using all his disks, tapes, notes, and hand-documented assembly code print-outs. Some comments reflect on similar experiences and reminiscences with old technology, from Garry Kitchen’s GameMaker to TI 99/4A cassettes, Spectrum 48K database systems to floppy disc data from the early ‘90s. However, some are mixed in their memories of old games, such as Ultima IV, which was known for its arbitrarily punishing design. Some readers recommend looking at the Commander X16 computer as possible hardware for similar creative projects.No meaningful content to provide a summary.",
    "hn_summary": "- A man completed his Commodore 64 RPG game that he started in 1984\n- Some comments reflect on similar experiences with old technology\n- Some recommend looking at the Commander X16 computer for creative projects."
  }
]
