[
  {
    "id": 39230513,
    "title": "Viimeisimmät jutut Hacker Newsissa: Breathing Techniques, USA:n työpaikkojen kasvu ja paljon muuta.",
    "originLink": "https://github.com/vitoplantamura/HackerNewsRemovals",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39230513",
    "commentBody": "",
    "originSummary": [
      "Tiivistelmiä erilaisista artikkeleista ja keskusteluista, jotka käsittelevät useita aiheita, kuten sähköautoteollisuutta, uusia putkikarttoja, hengitystekniikoita, työpaikkojen kasvua Yhdysvalloissa, amerikkalaisen oligarkian nousua ja Boeing 737 MAX-7/-10 -lentokoneen pysähtynyttä sertifiointiprosessia.",
      "Keskustellaan vanhemmuuden opettamisen kyseenalaistamisesta ja käydään filosofista keskustelua lapsen uhraamisesta.",
      "Muita käsiteltyjä aiheita ovat muun muassa Temun lisääntynyt mainoskulutus, Joe Roganin tuottoisa Spotify-sopimus, Raspberry Pi:n virallisen käsikirjan julkaisu vuodelle 2024, rankaisemattomuus merkittävänä ongelmana ja Jaron Lanierin tuleva puheenvuoro virtuaalitodellisuuden tulevaisuudesta."
    ],
    "commentSummary": [
      "Hacker Newsin keskustelussa käsitellään erilaisia aiheita, kuten sisällön moderointia, merkitsemistä, avoimuutta ja tiettyjen aiheiden merkityksellisyyttä.",
      "Käyttäjät ilmaisevat sekä kiitosta että kritiikkiä moderoinnista ja esittävät parannusehdotuksia, kuten kiistakapulan havaitsemisalgoritmin päivittämistä ja tieteenvastaisten viestien raportointijärjestelmän käyttöönottoa.",
      "Keskustelussa käydään myös keskusteluja läpinäkyvyydestä, merkitsemisen käytöstä alaspäin äänestämisen painikkeena ja heikkolaatuisten kommenttien hallintaan liittyvistä haasteista."
    ],
    "points": 628,
    "commentCount": 442,
    "retryCount": 0,
    "time": 1706891129
  },
  {
    "id": 39227831,
    "title": "Tailwind Color Palette Generator: Helposti nimetä, muokata ja mukauttaa väripaletteja.",
    "originLink": "https://www.tints.dev/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39227831",
    "commentBody": "",
    "originSummary": [
      "Tekstissä kuvataan ominaisuus, jonka avulla käyttäjät voivat nimetä ja muokata väripaletteja.",
      "Käyttäjät voivat avata värivalitsimen, kopioida paletin URL-osoitteen leikepöydälle, tarkastella API-URL-osoitetta, näyttää kaavioita ja poistaa tiettyjä väripaletteja.",
      "Ominaisuus sisältää myös säädöt, joilla voidaan säätää paletin värien sävyä, kylläisyyttä, vaaleutta ja luminanssia."
    ],
    "commentSummary": [
      "Keskustellaan esteettömyyden merkityksestä verkkosuunnittelussa, erityisesti värikontrastin merkityksestä vammaisille käyttäjille.",
      "WCAG:n kontrastialgoritmin rajoitukset tunnustetaan, minkä vuoksi on etsittävä vaihtoehtoisia värityökaluja ja kirjastoja.",
      "Käyttäjät jakavat omia värityökalujaan ja keskustelevat erilaisista lähestymistavoista värien luomiseen ja säätämiseen, ja korostavat tarvetta parantaa saavutettavuutta ja esteettisesti miellyttäviä ratkaisuja henkilöille, joilla on erilainen värinäkö."
    ],
    "points": 467,
    "commentCount": 71,
    "retryCount": 0,
    "time": 1706876797
  },
  {
    "id": 39231663,
    "title": "Binääristen suoritettavien tiedostojen organisaation ymmärtäminen: Kokonaisvaltainen tutkimus",
    "originLink": "https://jvns.ca/blog/2014/09/06/how-to-read-an-executable/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39231663",
    "commentBody": "",
    "originSummary": [
      "Artikkelissa perehdytään suoritettavien binääritiedostojen analyysiin ja organisointiin ja käsitellään symboleja, osioita ja segmenttejä.",
      "Siinä esitellään \"readelf\"-työkalu keinona tutkia binäärejä ja korostetaan esimerkkejä symbolien tunnistamisesta binäärissä.",
      "Lisäksi käsitellään \"_start\"-funktion merkitystä, binääritiedoston eri osioita ja segmenttien roolia muistin organisoinnissa."
    ],
    "commentSummary": [
      "Keskusteluketju pyörii binääristen suoritettavien tiedostojen, erityisesti ELF-tiedostojen, organisoinnin ja analysoinnin ympärillä.",
      "Osallistujat jakavat henkilökohtaisia kokemuksiaan ja antavat ehdotuksia ELF-tiedostojen manuaalista luomista varten, jotta saadaan käsitys niiden rakenteesta.",
      "He keskustelevat myös monimutkaisista ja huonosti dokumentoiduista ELF-latureista aiheutuvista haasteista sekä ELF:n mukautuvuudesta eri prosessoriympäristöihin."
    ],
    "points": 418,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1706895813
  },
  {
    "id": 39230263,
    "title": "EPA ehdottaa \"ikuisuuskemikaalien\" luokittelua vaarallisiksi aineiksi.",
    "originLink": "https://www.npr.org/2024/02/02/1228540721/forever-chemicals-pfas-epa-hazardous",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39230263",
    "commentBody": "",
    "originSummary": [
      "EPA ehdottaa, että yhdeksän PFAS-kemikaalia, jotka tunnetaan myös nimellä \"ikuisuuskemikaalit\", luokitellaan ihmisten terveydelle vaarallisiksi.",
      "PFAS-yhdisteet on yhdistetty haitallisiin vaikutuksiin, kuten syöpään ja lisääntymishäiriöihin, ja niitä esiintyy arkipäiväisissä tuotteissa, kuten tarttumattomissa keittoastioissa ja sammutusvaahdossa.",
      "Nämä kemikaalit hajoavat hitaasti ja voivat kerääntyä ympäristöön ja vesilähteisiin, kuten tutkimus osoittaa, jonka mukaan PFAS-yhdisteitä löytyi lähes puolesta Yhdysvaltojen vesijohtovedestä.",
      "EPA:n ehdotus on avoinna yleisön kommentoitavaksi, jotta yleisö voi antaa lausuntoja ja palautetta."
    ],
    "commentSummary": [
      "Keskustelussa käsitellään erilaisia aiheita, kuten EPA:n \"ikuisten kemikaalien\" luokittelua ja sääntelyä.",
      "PFAS-kemikaalien käytöstä ja hävittämisestä käydään keskustelua, joka herättää huolta mahdollisista terveysriskeistä.",
      "Keskustelussa korostetaan kemikaalien ja muovien tuotantoon ja käyttöön liittyviä monimutkaisia seikkoja ja kehotetaan selkeämpään kielenkäyttöön, lisätutkimuksiin sekä riskien ja hyötyjen tarkasteluun."
    ],
    "points": 416,
    "commentCount": 187,
    "retryCount": 0,
    "time": 1706890184
  },
  {
    "id": 39235336,
    "title": "Rocky-tähti Carl Weathers menehtyy 76-vuotiaana, tähtiystävät ja fanit muistavat hänet lämpimästi",
    "originLink": "https://www.bbc.co.uk/news/world-us-canada-68188746",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39235336",
    "commentBody": "",
    "originSummary": [
      "Näyttelijä Carl Weathers, joka tunnetaan Rocky-elokuvien Apollo Creedin roolista, on kuollut 76-vuotiaana.",
      "Hän teki menestyksekkään uran toiminta- ja komediaelokuvissa, kuten Predator ja Happy Gilmore, sekä tv-sarjoissa, kuten Arrested Development ja The Mandalorian.",
      "Weathersia arvostettiin suuresti hänen näyttelijätovereidensa, kuten Arnold Schwarzeneggerin ja Sylvester Stallonen, keskuudessa, ja hän sai Emmy-ehdokkuuden roolistaan The Mandalorianissa. Hän sai tunnustusta myös ohjaustyöstään. Adam Sandler ja Giancarlo Esposito osoittivat hänelle kunnioitusta sosiaalisessa mediassa.",
      "Weathers aloitti uransa NFL:n linebackerina ennen kuin siirtyi näyttelemään. Hänet muistetaan rakkaana perheenjäsenenä ja ystävänä."
    ],
    "commentSummary": [
      "Näyttelijä Carl Weathers on kuollut, mikä on herättänyt keskustelua nettifoorumilla.",
      "Käyttäjät muistelevat hänen merkittäviä roolejaan muun muassa Arrested Development -ohjelmissa ja Predator-elokuvassa.",
      "Monet ilmaisevat surunsa ja kertovat muistojaan hänen lahjakkuudestaan, monipuolisuudestaan, huumoristaan ja karismastaan ja toteavat, että he tulevat kaipaamaan häntä."
    ],
    "points": 301,
    "commentCount": 49,
    "retryCount": 0,
    "time": 1706913050
  },
  {
    "id": 39235001,
    "title": "Miksi elementti ei ole täysin tuettu CanIUse.comissa?",
    "originLink": "https://anderegg.ca/2024/02/02/why-isnt-the-html-element-100-supported",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39235001",
    "commentBody": "",
    "originSummary": [
      "Kirjoittaja kyseenalaistaa sen, miksi CanIUse.com-sivuston html-elementtiä ei ole lueteltu 100-prosenttisesti tuettuna.",
      "Kaksi vanhentunutta ja standardoimatonta ominaisuutta, jotka on lueteltu html-elementin alla MDN-sivulla, eivät selitä puuttuvaa 2,66 prosentin tukea.",
      "Pyöristysvirheiden tai vanhempien selainten käsittelyn on arveltu olevan syynä, kuten eräs toinen Mastodonin käyttäjä ehdotti."
    ],
    "commentSummary": [
      "Caniuse.com-sivustolla käytävä keskustelu keskittyy siihen, että \"html\"-elementille ei ole raportoitu 100-prosenttista tukea, ja se herättää keskustelua terminologiasta, kuten \"selain\" ja \"käyttäjäagentit\".",
      "Muita keskustelun aiheita ovat muun muassa rekursiiviset lyhenteet, Mozilla Developer Network (MDN) -brändäys ja siirtyminen webplatform.orgista MDN:ään.",
      "Käyttäjät esittävät erilaisia mielipiteitä MDN:n hyödyllisyydestä, mahdollisesta puolueellisuudesta Google Chromea kohtaan, avoimesta dokumentaatiosta sekä HTML-elementin pätevyydestä ja tuesta."
    ],
    "points": 257,
    "commentCount": 71,
    "retryCount": 0,
    "time": 1706911001
  },
  {
    "id": 39230244,
    "title": "Flipperikartta: Pinball Machines Worldwide: The Ultimate Guide to Public Pinball Machines Worldwide",
    "originLink": "https://pinballmap.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39230244",
    "commentBody": "",
    "originSummary": [
      "Pinball Map on käyttäjien ja ylläpitäjien ylläpitämä maailmanlaajuinen kartta julkisista flippereistä.",
      "Mobiilisovellus on saatavilla sekä Android- että iOS-käyttäjille.",
      "Projekti ei ole monetisoitu eikä siinä ole mainoksia tai premium-jäsenyyttä, mutta käyttäjät voivat tukea sitä Patreonin kautta."
    ],
    "commentSummary": [
      "Keskusteluissa keskitytään flippereiden omistamiseen ja pelaamiseen liittyviin eri näkökohtiin, kuten koneiden löytämiseen eri kaupungeista ja virtuaalisten flipperivaihtoehtojen hyviin ja huonoihin puoliin.",
      "Osallistujat jakavat henkilökohtaisia kokemuksia, suosittelevat verkkosivustoja ja sovelluksia koneiden löytämiseksi ja keskustelevat koneiden huollon tärkeydestä.",
      "Keskustelussa käsitellään myös klassisten peliautomaattien vähenemistä ja vanhojen osien saatavuutta."
    ],
    "points": 250,
    "commentCount": 118,
    "retryCount": 0,
    "time": 1706890131
  },
  {
    "id": 39232572,
    "title": "Haastavan käänteen luominen: Minesweeper epäsäännöllisellä ruudukolla",
    "originLink": "https://polyreplay.com/minesweepertwist",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39232572",
    "commentBody": "",
    "originSummary": [
      "Tekijä kehittää peliä, joka on saanut vaikutteita Minesweeperistä, mutta jossa on epäsäännöllinen ruudukko, mikä lisää monimutkaisuutta pelattavuuteen.",
      "Epäsäännöllinen ruudukko tuo vaihtelua naapurisolujen määrään, mikä tekee pelistä haastavamman ja mukaansatempaavamman.",
      "Kirjoittaja aikoo luoda samanlaisia muunnelmia myös muihin suosittuihin peleihin, kuten nappulaan, shakkiin, Othelloon ja Go:hon, mikä voi laajentaa haastavien pelikokemusten valikoimaa."
    ],
    "commentSummary": [
      "Artikkelissa ja kommenttiketjuissa käsitellään erilaisia Minesweeperiin liittyviä aiheita, kuten pelaamista epäsäännöllisillä ruuduilla, käyttäjän ohjauksen parantamista, uusien ominaisuuksien lisäämistä sekä vikojen ja näyttöongelmien ratkaisemista.",
      "Käyttäjät jakavat henkilökohtaisia kokemuksiaan pelin eri versioista ja antavat ehdotuksia pelattavuuden parantamiseksi.",
      "Pelin luoja ottaa aktiivisesti huomioon käyttäjien palautteen ja harkitsee ehdotettujen muutosten toteuttamista. Keskustelua käydään myös muista Minesweeperiä muistuttavista peleistä sekä huolenaiheista, jotka liittyvät tietojen keräämiseen ja huijaamiseen korkeissa pistemäärissä."
    ],
    "points": 240,
    "commentCount": 117,
    "retryCount": 0,
    "time": 1706899733
  },
  {
    "id": 39235593,
    "title": "SeaweedFS: Skaalautuva ja tehokas avoimen lähdekoodin tiedostojärjestelmä hajautettuun tallennukseen",
    "originLink": "https://github.com/seaweedfs/seaweedfs",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39235593",
    "commentBody": "",
    "originSummary": [
      "SeaweedFS on avoimen lähdekoodin hajautettu tiedostojärjestelmä, joka on suunniteltu suurten tiedostomäärien tallentamiseen ja palvelemiseen.",
      "Se tukee hakemistoja, POSIX-attribuutteja, hajautettujen avainarvosäilöjen kuormituksen purkamista ja se voidaan integroida pilvitallennukseen.",
      "SeaweedFS tarjoaa nopeita käyttönopeuksia, skaalautuvaa kapasiteettia ja ominaisuuksia, kuten tietomäärän hallintaa, välimuistitallennusta, replikointia, salausta, räätälöintiä ja paljon muuta."
    ],
    "commentSummary": [
      "SeaweedFS on nopea hajautettu tallennusjärjestelmä, jossa yhdistyvät tietokantojen ja tiedostojärjestelmien ominaisuudet tehokkaaseen tietojenkäsittelyyn ja palautumiseen sähkökatkoksista ja tietojen korruptoitumisesta.",
      "Se on kirjoitettu Goohjelmointikielellä, mikä on yllättävää, mutta sen suorituskykyä arvostetaan.",
      "Keskustelussa käsitellään muun muassa virheiden käsittelyä Go:ssa, yhden tiedoston tallentamisen etuja ja haittoja objektia kohti, ehdotuksia muista tallennusratkaisuista ja viittauksia Microsoftin aiempiin yrityksiin luoda vastaavia järjestelmiä.",
      "Keskustelussa käsitellään myös Seaweed Filerin tehokkuutta, Cassandran ja Redisin kaltaisia tilapäisiä arkistointivarastoja sekä vertailua ZFS:ään.",
      "Kaiken kaikkiaan SeaweedFS tarjoaa ei-hierarkkisen hajautetun avainarvosäilön, jolla on etuja perinteisiin tallennusjärjestelmiin verrattuna."
    ],
    "points": 225,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1706914633
  },
  {
    "id": 39229070,
    "title": "Japani tarjoaa 6 kuukauden viisumin etätyötä tekeville nomadeille",
    "originLink": "https://asia.nikkei.com/Spotlight/Japan-immigration/Japan-to-introduce-six-month-residency-visa-for-digital-nomads",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39229070",
    "commentBody": "",
    "originSummary": [
      "Japani on ottamassa käyttöön korkeasti koulutetuille työntekijöille, kuten tietotekniikan insinööreille, uuden viisumin, joka mahdollistaa etätyön tekemisen enintään kuuden kuukauden ajan tutustumalla maahan.",
      "Viisumin tarkoituksena on houkutella ulkomaisia työntekijöitä ja konsulttiyritysten omistajia sekä YouTubettajia, jotka saavat mainostuloja kansainvälisiltä yrityksiltä.",
      "Aloitteella pyritään hyödyntämään Japanin vetovoimaa matkailukohteena ja kannustamaan samalla erikoistuneiden lahjakkuuksien tuloa maahan."
    ],
    "commentSummary": [
      "Keskustelussa keskitytään Japanin maahanmuutto- ja väestökysymysten haasteisiin ja vaikutuksiin, erityisesti digitaalisten nomadien osalta.",
      "Keskustellaan viisumien kestosta, asumisesta, kulttuurin säilyttämisestä ja talouskasvusta.",
      "Keskustelussa tarkastellaan myös turistiviisumilla etätyöskentelyn laillisuutta ja täytäntöönpanoa, digitaalisten nomadien vaikutusta paikallisiin yhteisöihin ja talouksiin sekä ulkomailla työskentelyn mahdollisia veroseuraamuksia. Digitaalisia nomadeja koskevien selkeiden viisumisäännösten tarvetta korostetaan, ja mainitaan, että tulevaisuudessa digitaalisten nomadien viisumeja voitaisiin lisätä."
    ],
    "points": 224,
    "commentCount": 281,
    "retryCount": 0,
    "time": 1706885015
  },
  {
    "id": 39232004,
    "title": "Luopuminen epäonnistuneesta hankkeesta: Varoittava tarina",
    "originLink": "https://www.preethamrn.com/posts/when-should-you-give-up",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39232004",
    "commentBody": "",
    "originSummary": [
      "Kirjoittaja kertoo matkastaan Wikipedia-artikkeleiden karttapohjaisen hakuprojektin parissa innostuneena ja edistyneenä.",
      "Lopulta he kuitenkin kohtasivat haasteita, kuten viive, epätarkka artikkelien lajittelu ja epäkiinnostavat ehdotukset, mikä johti siihen, että he lisäsivät ominaisuuksia satunnaisesti ilman selkeää visiota.",
      "Sen jälkeen, kun hän huomasi, että hanke ei onnistunut, kirjoittaja kertoo kokemuksestaan varoittavana esimerkkinä ja korostaa, että tulevissa hankkeissa on tärkeää pysyä keskittyneenä ja säilyttää selkeä tavoite."
    ],
    "commentSummary": [
      "Artikkelissa käsitellään pienten, keskeneräisten projektien tekemisen merkitystä oppimiselle ja intohimon ylläpitämiselle.",
      "Hankekehitykseen suositellaan 2/2/2-sääntöä ja keskeneräisen työn jakamisen arvoa.",
      "Keskustellaan erilaisista näkökulmista, jotka liittyvät hankkeiden hylkäämiseen, henkilökohtaisten hankkeiden motiiveihin, epäonnistumisista oppimiseen ja riskinottoon."
    ],
    "points": 211,
    "commentCount": 107,
    "retryCount": 0,
    "time": 1706897235
  },
  {
    "id": 39229476,
    "title": "AWS:n IPv4-käyttömaksujen odotetaan tuottavan 1 miljardia dollaria vuodessa ja edistävän IPv6:n käyttöönottoa.",
    "originLink": "https://www.tomshardware.com/networking/amazons-aws-new-charge-for-using-ipv4-is-expected-to-rake-in-up-to-dollar1b-per-year-change-should-speed-ipv6-adoption",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39229476",
    "commentBody": "",
    "originSummary": [
      "AWS ottaa käyttöön uuden maksun, joka on 0,005 dollaria IP-osoitetta kohden tunnissa asiakkaille, joilla on julkisia IPv4-osoitteita, edistääkseen IPv6:n käyttöönottoa.",
      "Uuden maksun arvioidaan tuottavan Amazonille vuosittain jopa miljardi dollaria.",
      "Tämä toimenpide on vastaus IPv4-osoitteiden niukkuuteen ja hallinnointiin liittyviin haasteisiin, ja IPv6:aa mainostetaan ratkaisuna, koska siinä on runsaasti osoitteita."
    ],
    "commentSummary": [
      "AWS:ää on kritisoitu IPv4-käytöstä perittävästä maksusta, mikä aiheuttaa turhautumista käyttäjien keskuudessa.",
      "Internet-palveluntarjoajien mahdollisuudet tarjota IPv6-tukea ovat rajalliset, mikä vaikeuttaa IPv6:n käyttöönottoa.",
      "Pelkästään IPv4-liikenteen prosenttiosuudesta syntyy kiistoja, mikä korostaa IPv4:n jatkuvaa yleisyyttä.",
      "Osallistujat keskustelevat IPv6:n käyttöönotosta, mukaan lukien IP-osoitteiden aliverkkojen jakaminen ja sen vaikutus hinnoitteluun ja käyttöönottoon.",
      "Keskustellaan IPv6:n eduista ja haitoista, vaihtoehtoisista ratkaisuista ja IPv4:n tulevaisuudesta.",
      "IPv6:n käyttöönottoa ja tukea on yleisesti kehotettu lisäämään, jotta IPv4:n haasteisiin ja rajoituksiin voitaisiin puuttua."
    ],
    "points": 197,
    "commentCount": 174,
    "retryCount": 0,
    "time": 1706886738
  },
  {
    "id": 39227184,
    "title": "EU:n sääntelyviranomaiset käsittelevät avoimen lähdekoodin huolenaiheita kyberkestävyyslaissa ja tuotevastuudirektiivissä.",
    "originLink": "https://blog.opensource.org/the-european-regulators-listened-to-the-open-source-communities/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39227184",
    "commentBody": "",
    "originSummary": [
      "Avoimen lähdekoodin aloite (Open Source Initiative, OSI) ja muut avoimen lähdekoodin yhteisöt ovat osallistuneet keskusteluihin eurooppalaisten sääntelyviranomaisten kanssa kyberkestävyyslaista (Cyber Resilience Act, CRA) ja tuotevastuudirektiivistä (Product Liability Directive, PLD) vuonna 2023.",
      "Aluksi oltiin huolissaan sopimuksen mahdollisista vaikutuksista avoimen lähdekoodin kehitykseen, mutta laajamittaisen sitoutumisen jälkeen lopullisessa tekstissä on käsitelty suurinta osaa yksittäisten kehittäjien ja avoimen lähdekoodin säätiöiden riskeistä.",
      "On vielä haasteita, jotka on ratkaistava, kuten CRA:n ja PLD:n mukaisten vastuiden selventäminen, ja OSI suosittelee, että Euroopan komissio pyytää asiantuntija-apua avoimen lähdekoodin yhteisöiltä.",
      "Tulevaisuudessa on kehotettu sitoutumaan lainsäädäntötyöhön, jossa neljäs sektori on mukana, ja FOSDEM 2024 -tapahtumassa järjestetään sarja työpajoja, joissa keskustelua jatketaan."
    ],
    "commentSummary": [
      "EU:n kyberkestävyyslaki (Cyber Resilience Act, CRA) on herättänyt huolta avoimen lähdekoodin ohjelmistoja käyttävien pienyritysten vaatimustenmukaisuudesta ja kustannuksista.",
      "Jotkut uskovat, että lainsäädäntö voi estää avoimen lähdekoodin ohjelmistojen käyttöönottoa ja innovointia.",
      "Keskustelua käydään avoimen lähdekoodin ohjelmistojen vastuusta ja vastuusta sekä pienten hankkeiden haasteista sertifioinnin saamisessa.",
      "Säännökset voivat vaikuttaa EU:n yrityksiin, jotka kilpailevat EU:n ulkopuolisten yritysten sertifioimattomien sovellusten kanssa.",
      "Euroopan komission on tehtävä parannuksia ja annettava ohjeita näiden huolenaiheiden ratkaisemiseksi."
    ],
    "points": 186,
    "commentCount": 70,
    "retryCount": 0,
    "time": 1706870114
  },
  {
    "id": 39232838,
    "title": "Bitcoin Mining Yhdysvalloissa vastaa 2 % sähköntuotannosta",
    "originLink": "https://arstechnica.com/science/2024/02/over-2-percent-of-the-uss-electricity-generation-now-goes-to-bitcoin/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39232838",
    "commentBody": "",
    "originSummary": [
      "Suurten kryptovaluuttatoimintojen arvioidaan Yhdysvalloissa kuluttavan yli 2 prosenttia maan sähköstä, mikä on saanut hallituksen seuraamaan bitcoinin louhinnan energiavaikutuksia.",
      "Bitcoinin louhinta lisää fossiilisten polttoaineiden käyttöä, sillä louhijat toimivat lähellä vajaakäytössä olevia voimalaitoksia, mikä lisää sähköntuotantoa.",
      "Jotkin kaivostoiminnot ovat liittyneet kysyntäjousto-ohjelmiin mahdollisten energiapulmien kompensoimiseksi, ja Yhdysvaltain energiatietovirasto tekee kuukausittaisia analyysejä arvioidakseen vaikutuksia sähköverkkoon."
    ],
    "commentSummary": [
      "Bitcoin-louhinnan ympäristövaikutukset ja sen energiankulutus ovat keskustelun aiheena.",
      "Kannattajat väittävät, että suurin osa käytetystä energiasta on peräisin uusiutuvista energialähteistä tai kannustaa niiden käyttöönottoon, kun taas kriitikot väittävät, että se edistää energian tuhlailevaa kulutusta.",
      "Keskustelua käydään Bitcoin-louhinnan mahdollisuuksista vakauttaa sähköverkkoa ja lisätä uusiutuvan energian käyttöä sekä tarpeesta kannustaa siirtymään pois hiilidioksidipäästöistä kryptovaluutan louhinnassa."
    ],
    "points": 147,
    "commentCount": 233,
    "retryCount": 0,
    "time": 1706900998
  },
  {
    "id": 39233080,
    "title": "Uusi Euroopan yhteisöjen tuomioistuin panee täytäntöön salaiset päätökset ja rajoitetun edustuksen.",
    "originLink": "https://www.techdirt.com/2024/02/02/we-shouldnt-allow-a-new-super-secret-surveillance-court-cover-up-the-civil-liberties-problems-of-the-old-super-secret-surveillance-court/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39233080",
    "commentBody": "",
    "originSummary": [
      "Euroopan yhteisöjen tuomioistuimen päätökset eivät ole EU:n asukkaiden tai liittovaltion virastojen saatavilla.",
      "Kantajat eivät voi henkilökohtaisesti osallistua tuomioistuimeen, vaan heitä edustaa Yhdysvaltain oikeusministerin valitsema erityisasiamies.",
      "Kommentoija ehdottaa, että heidän toimistaan olisi enemmän hyötyä, jos he rakentaisivat kissanpennuille huoneen emonsa taloon."
    ],
    "commentSummary": [
      "Vastikään perustettu valvontatuomioistuin on joutunut tarkastelun kohteeksi, koska sen toiminnassa on havaittu eturistiriitaisia tuomareita ja avoimuuden puutetta.",
      "Tuomioistuimen vaikutusta EU:n asukkaisiin ja sen turvaluokiteltujen tietojen käsittelyä arvostellaan, mikä herättää kysymyksiä sen tarkoituksesta ja vastuullisuudesta.",
      "Presidentti Bidenin määräys tuomioistuimen perustamisesta herättää huolta siitä, että valituksen tekijöillä ei ole edustusta, ja herättää keskustelua oikeuslaitoksesta, oikeudenmukaisesta oikeudenkäynnistä ja transatlanttisesta datakaupasta."
    ],
    "points": 139,
    "commentCount": 49,
    "retryCount": 0,
    "time": 1706902351
  }
]
