[
  {
    "title": "중고 경제의 재정의: Facebook의 마켓플레이스 영향력 살펴보기",
    "originLink": "https://ticker.tv/news/how-has-facebooks-marketplace-feature-influenced-second-hand-economies/136228/",
    "originBody": "",
    "originSummary": [
      "2016년에 출시된 Facebook의 '마켓플레이스' 기능은 사용자의 접근성과 도달 범위를 넓혀 중고 경제에 상당한 영향을 미치고 변화를 가져왔습니다.",
      "사용 편의성, 개인 사용자를 위한 무료 리스팅, 페이스북 메신저를 통한 잠재 구매자와의 직접적인 연결 등의 이점이 있습니다.",
      "마켓플레이스의 도입이 계속됨에 따라 지역 커뮤니티 내에서 중고 상품을 거래하는 방식이 더욱 변화할 것으로 예상됩니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "Facebook's \"Marketplace\" feature, launched in 2016, has greatly influenced and transformed the used-goods economies by integrating this feature into Facebook's main app.",
      "The Marketplace provides increased accessibility and reach for users to trade used items like clothing, electronics, and furniture locally with added benefits like convenience, ease of use, free listings, and direct connections with buyers via Facebook Messenger.",
      "As adoption continues, Facebook's Marketplace is projected to further define how used items are transacted within local communities."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699367914693
  },
  {
    "title": "빈티드의 부상 살펴보기: 온라인 중고품 시장의 수익과 중독성",
    "originLink": "https://inews.co.uk/inews-lifestyle/im-selling-my-entire-life-on-vinted-im-addicted-and-cant-stop-2735414",
    "originBody": "",
    "originSummary": [
      "특히 영국에서 중고 물품 온라인 마켓플레이스인 Vinted는 사용자가 옷과 기타 물품을 판매하여 추가 수입을 얻고 쓰레기를 최소화하면서 인기가 급상승했습니다.",
      "상업적 판매를 금지하는 빈티드 정책에도 불구하고 몇몇 사용자는 수익성 있는 재판매 비즈니스를 운영할 수 있었으며, 한 프리랜서는 월평균 439파운드의 수익을 올리고 있습니다.",
      "2008년 리투아니아에서 출시된 이 앱은 Depop과 같은 경쟁사와 달리 사용자에게 판매 수수료를 부과하지 않습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "Vinted, an online marketplace for second-hand items, is gaining popularity, especially in the UK, as individuals sell clothes to earn extra income and minimize waste.",
      "Users have reported considerable profits, with one freelancer averaging £439 per month, demonstrating the platform's potential for income generation.",
      "Despite Vinted's regulations against commercial selling, many have created successful reselling businesses on the app, which was founded in 2008 in Lithuania and does not charge selling fees, unlike its competitors."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699367914693
  },
  {
    "title": "테일러 스위프트의 2024 에라스 투어의 프런트 로 티켓을 확보하세요: 구매 가이드라인 및 새 앨범 발표",
    "originLink": "https://www.express.co.uk/entertainment/music/1794825/taylor-swift-resale-tickets-uk-eras-tour-viagogo",
    "originBody": "",
    "originSummary": [
      "테일러 스위프트의 2024 영국 시대 투어 재판매 티켓은 비아고고와 비비드 시트에서 구매할 수 있으며, 가격은 원래 구매자가 더 높게 책정할 수 있지만 구매는 안전하고 검증된 방식으로 이루어집니다.",
      "이 콘서트 티켓의 공인 재판매는 2023년 8월 1일부터 시작되며, 티켓마스터, AXS 등 공인 대리점을 통하거나 공연장 웹사이트에서 직접 구매해야 유효합니다.",
      "스위프트가 2023년 10월 27일에 발매될 '1989' 앨범의 리메이크 소식을 발표하고 현재 예약 주문이 가능하다는 또 다른 흥미로운 소식도 전해졌습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "Resale tickets for Taylor Swift's 2024 UK Eras Tour are now available on Viagogo and Vivid Seats, with prices set by the original buyers.",
      "The tour includes venues such as Wembley and Murrayfield Stadiums, and tickets must be bought from approved agents or directly from the venue's website to be valid.",
      "Taylor Swift has also announced that she is remaking her \"1989\" album, which is set to release on October 27, 2023, and is available for preorder."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699367914693
  }
]
