[
  {
    "id": 40662176,
    "title": "Japani säätää lain edistääkseen kilpailua älypuhelinten sovelluskaupoissa",
    "originLink": "https://english.kyodonews.net/news/2024/06/bc2d7f45d456-japan-enacts-law-to-curb-apple-googles-app-dominance.html#google_vignette",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40662176",
    "commentBody": "",
    "originSummary": [
      "Japani on säätänyt uuden lain, jonka tavoitteena on parantaa lastenhoitoa maan laskevan syntyvyyden ratkaisemiseksi. Laki astuu voimaan 5. kesäkuuta 2024.",
      "Lainsäädäntö on osa laajempia pyrkimyksiä luoda perheille tukevampi ympäristö ja kannustaa korkeampiin syntyvyyslukuihin.",
      "Tämä siirto korostaa Japanin ennakoivaa lähestymistapaa demografisten haasteiden ratkaisemiseksi ja kestävän väestönkasvun varmistamiseksi."
    ],
    "commentSummary": [
      "Japani on säätänyt lain edistääkseen kilpailua älypuhelinten sovelluskaupoissa, estäen yrityksiä kuten Apple ja Google estämästä kilpailevien sovellusten ja palveluiden myyntiä.",
      "Laki voisi vaatia Applea sallimaan kolmansien osapuolten sovelluskaupat ja suorat maksutavat, mikä herättää kysymyksiä Applen palveluehtojen noudattamisesta.",
      "Tämä lainsäädäntö pyrkii haastamaan IT-jättien hallitsevan aseman ja edistämään kilpailukykyisempää markkinaa, mikä voi hyödyttää sekä kuluttajia että kehittäjiä."
    ],
    "points": 436,
    "commentCount": 291,
    "retryCount": 0,
    "time": 1718221430
  },
  {
    "id": 40665721,
    "title": "Poista sensuuri mistä tahansa LLM:stä abliteration-menetelmällä",
    "originLink": "https://huggingface.co/blog/mlabonne/abliteration",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40665721",
    "commentBody": "",
    "originSummary": [
      "Artikkeli esittelee \"abliterationin,\" tekniikan, jolla Llama-mallit voidaan sensuroida uudelleen ilman uudelleenkoulutusta poistamalla niiden kieltäytymismekanismi.",
      "Poistaminen tunnistaa ja poistaa \"kieltäytymissuunnan\" mallin jäännösvirrasta, mikä mahdollistaa sen vastaamisen kaikkiin kehotteisiin.",
      "Tekniikkaa sovellettiin Daredevil-8B-malliin, mikä johti NeuralDaredevil-8B:hen, sensuroimattomaan LLM:ään, joka saavutti huipputulokset 8B-kategoriassa, vaikka se vaati lisäkoulutusta suorituskyvyn laskujen palauttamiseksi."
    ],
    "commentSummary": [
      "Teksti käsittelee käyttäjän kokemusta uudesta tekoälymallista, joka antaa spekulatiivisia vastauksia suorien kieltäytymisten sijaan, mitä käyttäjä pitää virkistävänä ja miellyttävänä.",
      "Väittely keskittyy tekoälymallien etiikkaan ja turvallisuustoimenpiteisiin, joissa esitetään argumentteja sensuurin puolesta ja sitä vastaan sekä sensuroimattomien mallien mahdollisesta väärinkäytöstä haitallisiin toimintoihin.",
      "Teksti korostaa haasteita tasapainottaa tekoälyn turvallisuus ja tiedonvapaus, painottaen eettisten ohjeiden tarvetta ja tekoälyn tuottaman sisällön mahdollisia oikeudellisia seurauksia."
    ],
    "points": 426,
    "commentCount": 221,
    "retryCount": 0,
    "time": 1718250159
  },
  {
    "id": 40664339,
    "title": "Kuinka Meta kouluttaa suuria kielimalleja laajassa mittakaavassa TULOS:",
    "originLink": "https://engineering.fb.com/2024/06/12/data-infrastructure/training-large-language-models-at-scale-meta/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40664339",
    "commentBody": "",
    "originSummary": [
      "Meta keskittyy tekoälytutkimukseen käsitelläkseen suurimittaisen laskennan tarpeet suurten kielimallien (LLM) kouluttamisessa, mikä vaatii ohjelmistojen, laitteistojen ja verkko-infrastruktuurin uudelleenajattelua.",
      "He mukauttivat olemassa olevaa laitteistoa, mukaan lukien muokkaamalla Grand Teton -alustaa NVIDIA H100 GPU:illa, ja optimoivat datakeskuksen layoutin maksimoidakseen laskentatehon samalla säilyttäen ilmajäähdytetyn ympäristön.",
      "Meta rakensi kaksi 24k GPU -klusteria käyttäen RoCE- ja InfiniBand-verkkokankaita kouluttaakseen Llama 3:a, optimoiden verkkoviestinnän ja kuormantasauksen varmistaakseen korkean suorituskyvyn ja tehokkaan tiedonsiirron."
    ],
    "commentSummary": [
      "Meta joutui mukauttamaan mekaanisia ja lämpösuunnitelmiaan pysyäkseen ilmalla jäähdytetyssä ympäristössä aikarajoitteiden vuoksi, mikä johti validointisykliin laajamittaista käyttöönottoa varten.",
      "Kysymyksiä on edelleen siitä, miten Meta kerää ja valmistelee dataa koulutusta varten, erityisesti koskien henkilötietoja (PII), jotka ovat oletuksena saavuttamattomissa ja vaativat erityistä pääsyä.",
      "Teksti käsittelee kilpailua teknologiayritysten, kuten Googlen, Microsoftin ja Metan, välillä omien sirujensa kehittämisessä, korostaen Nvidian GPU:iden suorituskykyä ja kustannustehokkuutta verrattuna Googlen TPU:ihin."
    ],
    "points": 368,
    "commentCount": 184,
    "retryCount": 0,
    "time": 1718235308
  },
  {
    "id": 40667976,
    "title": "Microsoft valitsi voiton turvallisuuden sijaan, väittää ilmiantaja",
    "originLink": "https://www.propublica.org/article/microsoft-solarwinds-golden-saml-data-breach-russian-hackers",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40667976",
    "commentBody": "",
    "originSummary": [
      "Ilmiantaja Andrew Harris väittää, että Microsoft jätti huomiotta varoitukset kriittisestä tietoturva-aukosta välttääkseen hallituksen liiketoiminnan menettämisen, mikä myöhemmin hyödynnettiin venäläisten hakkerien toimesta SolarWinds-hyökkäyksessä.",
      "Harris, kyberturvallisuuden asiantuntija, löysi haavoittuvuuden Microsoftin pilvipohjaisesta ohjelmasta, joka voisi mahdollistaa huomaamattoman pääsyn arkaluonteisiin tietoihin, mutta hänen varoituksensa sivuutettiin mahdollisten taloudellisten seurausten vuoksi.",
      "Huolimatta Harrisin ponnisteluista ja myöhemmistä tietomurroista, Microsoft väitti, ettei mitään tuotetta tai palvelua hyödynnetty, mikä johti kritiikkiin yhtiön asettaessa voitot asiakasturvallisuuden edelle."
    ],
    "commentSummary": [
      "Ilmiantaja Andrew Harris, entinen Microsoftin kyberturvallisuusasiantuntija, paljasti, että Microsoft viivästytti vakavan virheen korjaamista Active Directory Federation Services (AD FS) -palvelussa varmistaakseen tuottoisan hallitussopimuksen, mikä johti SolarWinds-kyberhyökkäykseen.",
      "ProPublican tutkimus korostaa Microsoftin sisällä vallitsevaa kulttuuria, joka asettaa liiketoiminnan kasvun välittömien turvallisuushuolien edelle, mikä heijastaa laajempia teknologiateollisuuden ongelmia tasapainottaa voitto ja asiakasturvallisuus.",
      "Teksti käsittelee ilmiantajien ja kyberturvallisuusammattilaisten kohtaamia haasteita, kun he pyrkivät edistämään nopeita toimia turvallisuuskysymyksissä voittoa tavoittelevissa yrityksissä, korostaen tarvetta kulttuurimuutokseen, joka asettaa turvallisuuden etusijalle."
    ],
    "points": 343,
    "commentCount": 162,
    "retryCount": 0,
    "time": 1718275185
  },
  {
    "id": 40661703,
    "title": "ChromeOS tullaan pian kehittämään suurilta osin Android-pinoon perustuen",
    "originLink": "https://blog.chromium.org/2024/06/building-faster-smarter-chromebook.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40661703",
    "commentBody": "",
    "originSummary": [
      "12. kesäkuuta 2024 Chromium Blog ilmoitti, että ChromeOS integroi suuria osia Android-pinoista nopeuttaakseen Google AI -ominaisuuksien ja -innovaatioiden toimitusta.",
      "Tämä integraatio sisältää komponentteja, kuten Android Linux -ytimen ja Android-kehykset, joiden tavoitteena on nopeuttaa tekoälyinnovaatioita, yksinkertaistaa suunnittelua ja parantaa laitteiden yhteensopivuutta.",
      "Huolimatta näistä muutoksista, ChromeOS säilyttää turvallisuutensa, johdonmukaisuutensa ja hallintakykynsä, ja säännölliset päivitykset ja uudet innovaatiot jatkuvat väliaikana."
    ],
    "commentSummary": [
      "ChromeOS tullaan pian kehittämään käyttäen suuria osia Android-pinoista, hyödyntäen Androidin arkkitehtuuria käyttöjärjestelmän pirstoutumisen vähentämiseksi ja päivitysten johdonmukaisuuden parantamiseksi.",
      "Chromebookeilla on pidemmät tukijaksot verrattuna Android-laitteisiin, ja ChromeOS käsittelee pirstoutumista paremmin, vaikka se ei sovellu älypuhelimille.",
      "ChromeOS:n ja Androidin integrointi voisi johtaa yhtenäisempään alustaan, mikä saattaisi parantaa työpöytäkokemusta mobiililaitteilla ja ratkaista nykyisiä suorituskykyongelmia."
    ],
    "points": 302,
    "commentCount": 404,
    "retryCount": 0,
    "time": 1718218966
  },
  {
    "id": 40663704,
    "title": "Gerald Sussman: Ohjelmoinnin tulisi olla hauskaa (2022) [video]",
    "originLink": "https://www.youtube.com/watch?v=2MYzvQ1v8Ww",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40663704",
    "commentBody": "",
    "originSummary": [
      "Kirjoittajalla on laaja kokemus ohjelmoinnista, joka alkoi vuonna 1962, ja hän on työskennellyt useiden varhaisten tietokoneiden, kuten IBM 790, 650 ja 1620, parissa.",
      "Teksti korostaa ohjelmoinnin luovaa ja abstraktia luonnetta, vertaamalla sitä taidemuotoihin kuten runouteen, arkkitehtuuriin ja musiikkiin, ja tuo esiin monimutkaisuuden ymmärtämisen ja hallinnan tärkeyden.",
      "Kirjoittaja käsittelee merkittäviä ohjelmoinnin ja tietojenkäsittelytieteen käsitteitä, kuten eval- ja apply-prosessia Lispissä, virheenkorjausta sekä identiteetin ja mutaation filosofisia näkökohtia tietorakenteissa."
    ],
    "commentSummary": [
      "Gerald Sussman korostaa ohjelmoinnin merkitystä tiedon tallentamisessa ja ymmärtämisessä matematiikan, fysiikan ja biologian aloilla, painottaen sen syvempää kasvatuksellista arvoa.",
      "Teksti korostaa hauskuuden säilyttämisen tärkeyttä tietojenkäsittelytieteessä, kuten Alan J. Perlis on suositellut, ja varoittaa tulemasta tietojenkäsittelytieteen tiedon portinvartijoiksi.",
      "Keskustelussa käsitellään siirtymistä Lispin opettamisesta Pythonin opettamiseen yliopistoissa, todeten, että vaikka Python on kaupallisesti suosittu, koulutuksen ensisijaisena tavoitteena tulisi olla abstraktin ajattelun kehittäminen sen sijaan, että keskityttäisiin pelkästään kaupallisesti merkityksellisiin kieliin."
    ],
    "points": 272,
    "commentCount": 87,
    "retryCount": 0,
    "time": 1718229747
  },
  {
    "id": 40668088,
    "title": "Intialainen startup 3D-tulostaa rakettimoottorin 72 tunnissa",
    "originLink": "https://spectrum.ieee.org/3d-printed-rocket",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40668088",
    "commentBody": "",
    "originSummary": [
      "Intialainen startup-yritys Agnikul 3D-tulosti onnistuneesti rakettimoottorin 72 tunnissa, mikä osoittaa nopean valmistuksen edistysaskeleita avaruusteknologiassa.",
      "Tiimi saavutti ensimmäisen onnistuneen laukaisunsa Satish Dhawanin avaruuskeskuksessa, mikä osoittaa edistystä kohti \"on-demand\" rakettilaukaisuja.",
      "Tämä virstanpylväs korostaa mahdollisuuksia joustavampiin ja kustannustehokkaampiin avaruusoperaatioihin tulevaisuudessa."
    ],
    "commentSummary": [
      "Intialainen startup on onnistuneesti 3D-tulostanut rakettimoottorin 72 tunnissa, mikä on merkittävästi lyhentänyt tuotantoaikaa.",
      "Kone, jota käytetään tulostamiseen, tuottaa automaattisesti raportin, jossa yksityiskohtaisesti kerrotaan mahdollisista poikkeamista, mikä saattaa poistaa tarpeen jälkituotannon tarkastuksille, vaikka jotkut asiantuntijat kiistävät tämän väitteen.",
      "Kehitys korostaa Intian kasvavaa teknologiasektoria ja 3D-tulostuksen potentiaalia monimutkaisessa valmistuksessa, huolimatta jatkuvista keskusteluista laadunvarmistuksesta ja jälkituotannon testauksen tarpeellisuudesta."
    ],
    "points": 268,
    "commentCount": 164,
    "retryCount": 0,
    "time": 1718276531
  },
  {
    "id": 40667102,
    "title": "AMD:n MI300X päihittää Nvidian H100:n LLM-päätelmissä",
    "originLink": "https://www.blog.tensorwave.com/amds-mi300x-outperforms-nvidias-h100-for-llm-inference/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40667102",
    "commentBody": "",
    "originSummary": [
      "AMD:n MI300X-kiihdytin ylittää NVIDIA:n H100 SXM:n suorituskyvyn todellisissa tekoälytehtävissä saavuttaen 33 % suuremman läpäisykyvyn chat-käyttötapauksessa.",
      "Huolimatta NVIDIA:n kypsästä ohjelmistoekosysteemistä, AMD:n MI300X on vahva kilpailija, joka tarjoaa paremman suorituskyvyn, kustannustehokkuuden ja saatavuuden laajamittaiseen pilvilaskentaan.",
      "Vertailutulokset osoittavat, että MI300X suoriutuu erinomaisesti sekä offline- että online-päätöksentekotehtävissä, mikä tekee siitä ihanteellisen AI-päätöksentekokyvyn laajentamiseen suuremmalla läpäisykyvyllä ja nopeammilla vasteajoilla."
    ],
    "commentSummary": [
      "AMD:n MI300X päihittää Nvidian H100:n LLM (Large Language Model) -päättelyssä, kertoo tekoälytehtäviin erikoistunut pilvipalveluntarjoaja TensorWave.",
      "Raportin pätevyyttä kyseenalaistetaan, koska AMD:n sirussa on kaksinkertainen määrä transistoreja ja muistia, mutta se suoriutuu vain 33 % paremmin, ja AMD:n kokoonpano on huomattavasti halvempi.",
      "Keskustelu korostaa Nvidian hallitsevaa asemaa tekoälytehtävissä, heidän markkina-asemaansa ja mahdollisia kilpailijoita AMD:ltä, painottaen mikroarkkitehtuurin suunnittelutaitojen ja ohjelmistojen merkitystä laitteiston suorituskyvyn parantamisessa."
    ],
    "points": 264,
    "commentCount": 224,
    "retryCount": 0,
    "time": 1718265476
  },
  {
    "id": 40668504,
    "title": "Southwest Airlinesin Boeing 737-8 Max koki hollantilaisen rullauksen",
    "originLink": "https://avherald.com/h?article=519ce679",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40668504",
    "commentBody": "",
    "originSummary": [
      "Toukokuun 25. päivänä 2024 Southwest Airlinesin Boeing 737-8 MAX koki Dutch Roll -ilmiön kesken lennon, mikä johti merkittäviin rakenteellisiin vaurioihin, vaikka miehistö laskeutui turvallisesti Oaklandiin, Kaliforniaan.",
      "FAA luokitteli tapahtuman onnettomuudeksi, ja lentokone siirrettiin Everettiin, Washingtoniin, jatkokorjauksia varten väliaikaisen korjauksen jälkeen Oaklandissa.",
      "Keskustelut käyttäjien keskuudessa korostavat teknisiä näkökohtia, mahdollisia matkustajien hälytyksiä ja ehdotuksia siitä, että Boeing lisäisi toisen itsenäisen Yaw Damper -järjestelmän turvallisuuden parantamiseksi."
    ],
    "commentSummary": [
      "Southwest Airlinesin Boeing 737-8 Max koki hollantilaisen rullauksen, ilmiön, jossa esiintyy värähtelyjä johtuen kallistus- ja sivuttaisdynamiikan yhteisvaikutuksesta.",
      "Hollantilaisten rullausonnettomuuksien historiallinen tausta sisältää merkittäviä tapauksia eri lentokonemalleilla, mukaan lukien Japan Airlinesin Boeing 747SR:n kuolemaan johtanut onnettomuus vuonna 1985.",
      "Keskustelussa tuodaan esiin huolenaiheita Boeingin insinööristandardeista, johdon päätösten vaikutuksista ja kaupallisen ilmailun turvallisuudesta, huolimatta viimeaikaisista ongelmista 737 Maxin kanssa."
    ],
    "points": 241,
    "commentCount": 207,
    "retryCount": 0,
    "time": 1718279591
  },
  {
    "id": 40670612,
    "title": "MLow: Metan matalan bittinopeuden äänikoodekki",
    "originLink": "https://engineering.fb.com/2024/06/13/web/mlow-metas-low-bitrate-audio-codec/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40670612",
    "commentBody": "",
    "originSummary": [
      "Meta on kehittänyt Meta Low Bitrate (MLow) -koodekin parantaakseen äänenlaatua käyttäjille, joilla on hitaat yhteydet ja alemman tason laitteet, tarjoten kaksinkertaisen laadun Opus-koodekkiin verrattuna samalla käyttäen 10 % vähemmän laskentatehoa.",
      "MLow on lanseerattu Instagramissa ja Messenger-puheluissa, ja se otetaan käyttöön myös WhatsAppissa, parantaen käyttäjien sitoutumista ja äänenlaatua erityisesti matalan bittinopeuden olosuhteissa.",
      "MLow, CELP-koodekki, tukee SuperWideBand-ääntä ja parempaa eteenpäin suuntautuvaa virheenkorjausta, parantaen äänenlaatua jopa pakettihäviötilanteissa, ja pyrkii parantamaan äänen palautumista tulevissa päivityksissä."
    ],
    "commentSummary": [
      "Meta on esitellyt uuden matalan bittinopeuden äänikoodekin, joka ei välttämättä ole ihanteellinen reaaliaikaisiin viestintöihin korkean pakettinopeuden ja yläkulujen vuoksi, mutta voi olla hyödyllinen piirikytkentäisissä tai VoIP-järjestelmissä, jotka käyttävät otsikkopakkausta.",
      "Koodekki on suunniteltu vähentämään kaistanleveyden kulutusta samalla kun se ylläpitää tai parantaa luotettavuutta ja koettua äänenlaatua, mikä tekee siitä sopivan alustoille kuten Facebook, Instagram ja WhatsApp.",
      "Koodekin suorituskyky todellisissa sovelluksissa riippuu sen kyvystä käsitellä bittivirheitä ja vähentynyttä kanavakapasiteettia, jolloin eteenpäin suuntautuvalla virheenkorjauksella (FEC) on keskeinen rooli puhelun laadun ylläpitämisessä."
    ],
    "points": 197,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1718291118
  },
  {
    "id": 40667606,
    "title": "Arm sanoo haluavansa kaikki Snapdragon X Elite -kannettavat tuhottaviksi",
    "originLink": "https://www.xda-developers.com/arm-says-it-wants-all-snapdragon-x-elite-laptops-destroyed/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40667606",
    "commentBody": "",
    "originSummary": [
      "Arm yrittää poistaa Qualcommin Windows-markkinoilta tuodakseen oman Cortex-suunnittelunsa, mikä on johtanut oikeuskiistaan mukautettujen Arm-sirujen lisensointioikeuksista.",
      "Huhujen mukaan Nvidia, MediaTek ja AMD saattavat tulla Windows-ekosysteemiin Arm-siruilla, mahdollisesti CES 2025 -tapahtumaan mennessä, ja MediaTek saattaa käyttää Armin Cortex-ytimiä.",
      "Arm väittää, että Qualcommin Nuvia-suunnitelmien käyttö rikkoo sopimusvelvoitteita, ja pyrkii pysäyttämään toimitukset ja tuhoamaan Snapdragon X -sarjan sirut, vaikka tällaiset kiistat päättyvät yleensä taloudellisiin sovintoihin."
    ],
    "commentSummary": [
      "Arm vaatii kaikkien Snapdragon X Elite -kannettavien tuhoamista lisenssikiistan vuoksi Qualcommin kanssa Nuvian palvelinytimien käytöstä Snapdragon X Elite SoC:ssa.",
      "Keskeinen kysymys on, mitätöikö Qualcommin Nuvian hankinta Nuvian erityisen lisenssin Armin kanssa, joka oli alun perin tarkoitettu vain palvelin/datakeskus käyttöön.",
      "Tämän oikeustaistelun lopputulos voisi merkittävästi vaikuttaa tuleviin lisensointisopimuksiin ja laajempaan teknologia-alaan, mahdollisesti muuttaen tapaa, jolla immateriaalioikeuksia (IP) siirretään ja käytetään yritysostojen jälkeen."
    ],
    "points": 175,
    "commentCount": 143,
    "retryCount": 0,
    "time": 1718271192
  },
  {
    "id": 40669337,
    "title": "Shpool, kevyt Tmux-vaihtoehto",
    "originLink": "https://github.com/shell-pool/shpool",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40669337",
    "commentBody": "",
    "originSummary": [
      "Google on avannut lähdekoodin Shpool-työkalulle, joka alun perin kehitettiin pysyvien pääteistuntojen ylläpitämiseen etätyöskentelyssä.",
      "Shpool pyrkii parantamaan etätyön tehokkuutta mahdollistamalla jatkuvat pääteistunnot ilman keskeytyksiä.",
      "Tämä julkaisu on merkittävä, sillä se tarjoaa kehittäjille vankan ratkaisun etäpäätelaitteiden hallintaan, mikä voi parantaa tuottavuutta hajautetuissa tiimeissä."
    ],
    "commentSummary": [
      "Shpool, Googlen kehittämä pääteistunnon pysyvyystyökalu, on avattu avoimeen lähdekoodiin kevyenä vaihtoehtona Tmuxille.",
      "Shpool on suunniteltu hallitsemaan pysyviä istuntoja ilman ylimääräisiä ominaisuuksia, mikä tekee siitä sopivan pitkäkestoisille prosesseille ja järjestelmäpalveluille.",
      "Työkalu jäljittelee konsolia tilan tarkastelua ja uudelleenrenderöintiä varten liitettäessä, mutta ei tällä hetkellä tue useita terminaaliemulaattoreita tai raskasta terminaalipakokoodien käyttöä."
    ],
    "points": 154,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1718284949
  },
  {
    "id": 40672215,
    "title": "Voit auttaa Anna's Archivea jakamalla torrentteja",
    "originLink": "https://annas-archive.org/torrents",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40672215",
    "commentBody": "",
    "originSummary": [
      "Anna’s Archive, Library Genesis ja Sci-Hub ovat luoneet yhtenäisen torrent-listan säilyttääkseen valtavan määrän ihmistietoa, yhteensä 521,1 teratavua, josta 60 % on jo kopioitu vähintään neljään paikkaan.",
      "Käyttäjiä kannustetaan jakamaan torrentteja, erityisesti niitä, joilla on vähän jakajia, auttaakseen saavuttamaan 100% säilytyksen. Suuret avustajat (50TB tai enemmän) voivat ottaa yhteyttä tiimiin saadakseen päivityksiä vanhentuneista torrenteista.",
      "Lista on jaettu kolmeen osaan: Anna’s Archiven hallinnoimat, muiden kuten Library Genesis ja Sci-Hub hallinnoimat sekä sekalaiset torrentit. Jotkut torrentit saattavat olla tilapäisesti estettyjä."
    ],
    "commentSummary": [
      "Anna's Archive, Library Genesiksen ja Sci-Hubin peili, pyytää apua yli 500 TB:n kirjojen ja julkaisujen säilyttämiseen, joista 40 % on tällä hetkellä jaettu alle neljän solmun toimesta.",
      "Projekti kohtaa merkittäviä tekijänoikeusrikkomushaasteita, samanlaisia kuin muutkin verkkokirjastot, kuten LibGen, Sci-Hub ja Z-Library, jotka ovat kohdanneet oikeustoimia ja verkkotunnusten takavarikointeja.",
      "Siirtyminen IPFS:stä BitTorrentiin säilyttämistä varten johtuu BitTorrentin helppokäyttöisyydestä ja alhaisemmista infrastruktuurivaatimuksista, ja yhteisö keskustelee torrent-seedauksen eettisistä ja oikeudellisista vaikutuksista pitkän aikavälin tietojen säilyttämisessä."
    ],
    "points": 136,
    "commentCount": 95,
    "retryCount": 0,
    "time": 1718299214
  },
  {
    "id": 40670898,
    "title": "AMD:n toimitusjohtaja Lisa Su muistelee PS3:n pahamaineisen Cell-prosessorin suunnittelua",
    "originLink": "https://www.tomshardware.com/tech-industry/amd-ceo-lisa-su-reminisces-on-helping-design-the-ps3s-infamous-cell-processor-at-ibm",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40670898",
    "commentBody": "",
    "originSummary": [
      "Ennen kuin Lisa Suista tuli AMD:n toimitusjohtaja, hän työskenteli IBM:llä ja osallistui PlayStation 3:n Cell-prosessorin suunnitteluun. Prosessori perustui IBM:n PowerPC-arkkitehtuuriin ja keskittyi rinnakkaistamiseen.",
      "Vaikka PlayStation 3 oli yksi Sonyn vähiten menestyneistä konsoleista, se myi 87,4 miljoonaa kappaletta maaliskuuhun 2017 mennessä ja johti visuaalisesti upeisiin peleihin, kuten Uncharted 3.",
      "Lisa Sun johdolla AMD on toimittanut laitteistoa sekä PlayStationille että Xboxille kahden peräkkäisen konsolisukupolven ajan, mikä on merkittävä saavutus yhtiölle peliteollisuudessa."
    ],
    "commentSummary": [
      "AMD:n toimitusjohtaja Lisa Su jakoi näkemyksiään PS3:n Cell-prosessorin suunnittelusta, korostaen sen edistynyttä arkkitehtuuria ja pelikehityksen haasteita.",
      "PS3:n Cell-prosessori oli tehokas, mutta vaikea ohjelmoida, mikä johti vaihtelevaan menestykseen ja rajoitettuun markkinoiden omaksumiseen verrattuna X86_64- ja ARM-suorittimiin.",
      "PS3:n ainutlaatuinen laitteisto, mukaan lukien Cell-prosessori ja Nvidia GPU, teki siitä monimutkaisen mutta innovatiivisen konsolin, joka vaikutti pelikonsoleiden ja niiden kehitysympäristöjen kehitykseen."
    ],
    "points": 128,
    "commentCount": 96,
    "retryCount": 0,
    "time": 1718292690
  },
  {
    "id": 40668803,
    "title": "iTerm 3.5.1 poistaa automaattisen OpenAI-integraation, vaatii käyttäjän suostumuksen",
    "originLink": "https://iterm2.com/downloads.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40668803",
    "commentBody": "",
    "originSummary": [
      "iTerm2 3.5.2 on uusin vakaa julkaisu, suositeltu macOS 10.15:lle ja uudemmille, rakennettu 13. kesäkuuta 2024.",
      "Uusin beta-versio, iTerm2 3.5.1beta4, on saatavilla testattavaksi. Se on rakennettu 3. kesäkuuta 2024, ja siihen tulee usein päivityksiä, mutta se voi olla ajoittain epävakaa.",
      "Yön yli rakennettuja versioita luodaan päivittäin, jos muutoksia on tehty, mutta ne saattavat sisältää vakavia virheitä; uusimmat ja vanhemmat versiot ovat saatavilla arkistossa."
    ],
    "commentSummary": [
      "iTerm 3.5.1 -päivitys poistaa automaattisen OpenAI-integraation, ja nyt käyttäjien on valittava se erikseen, mikä on herättänyt keskustelua käyttäjien keskuudessa.",
      "Huolenaiheita heräsi mahdollisista tietoturvariskeistä yritysympäristöissä, jopa valinnaisen ominaisuuden kanssa, mikä korostaa tiukkojen verkon tason valvontatoimien tarvetta.",
      "Vastareaktio tekoälyn integrointia vastaan johti IT-ammattilaisten kritisointiin siitä, etteivät he olleet asianmukaisesti tarkistaneet ohjelmistopäivityksiä ja sallineet automaattipäivitykset ilman riittävää valvontaa."
    ],
    "points": 125,
    "commentCount": 131,
    "retryCount": 0,
    "time": 1718281642
  }
]
