[
  {
    "id": 40662176,
    "title": "ஜப்பான் ஸ்மார்ட்போன் ஆப் ஸ்டோர்களில் போட்டியை ஊக்குவிக்கும் சட்டத்தை அமல்படுத்துகிறது",
    "originLink": "https://english.kyodonews.net/news/2024/06/bc2d7f45d456-japan-enacts-law-to-curb-apple-googles-app-dominance.html#google_vignette",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40662176",
    "commentBody": "",
    "originSummary": [
      "ஜப்பான், நாட்டின் குறைந்து வரும் பிறப்புறையை சமாளிக்க குழந்தை பராமரிப்பை மேம்படுத்தும் நோக்கில் புதிய சட்டத்தை அமல்படுத்தியுள்ளது, இது ஜூன் 5, 2024 முதல் அமலுக்கு வரும்.",
      "சட்டம் குடும்பங்களுக்கு அதிக ஆதரவு வழங்கும் சூழலை உருவாக்கவும், அதிக பிறப்பு விகிதங்களை ஊக்குவிக்கவும் விரிவான முயற்சிகளின் ஒரு பகுதியாகும்.",
      "இந்த நடவடிக்கை ஜப்பானின் மக்கள் தொகை சவால்களை சமாளிக்கும் மற்றும் நிலையான மக்கள் தொகை வளர்ச்சியை உறுதிப்படுத்தும் முன்முயற்சியைக் குறிப்பிடுகிறது."
    ],
    "commentSummary": [
      "ஜப்பான் ஸ்மார்ட்போன் ஆப் ஸ்டோர்களில் போட்டியை ஊக்குவிக்கும் சட்டத்தை அமல்படுத்தியுள்ளது, ஆப்பிள் மற்றும் கூகுள் போன்ற நிறுவனங்கள் போட்டி ஆப்கள் மற்றும் சேவைகளை விற்பனை செய்ய தடுப்பதைத் தடுக்கிறது.",
      "சட்டம் ஆப்பிளை மூன்றாம் தரப்பு பயன்பாட்டு கடைகள் மற்றும் நேரடி கட்டண முறைகளை அனுமதிக்க வேண்டியிருக்கும், இது ஆப்பிளின் சேவை விதிமுறைகளுடன் இணக்கமாக இருப்பது குறித்து கேள்விகளை எழுப்புகிறது.",
      "இந்த சட்டம் ஐடி மாபெருமைகளின் ஆதிக்கத்தை சவாலுக்கு உட்படுத்தி, மேலும் போட்டியாளரான சந்தையை உருவாக்குவதற்காக, நுகர்வோரும் டெவலப்பர்களும் பயனடையக்கூடிய வகையில் உள்ளது."
    ],
    "points": 436,
    "commentCount": 291,
    "retryCount": 0,
    "time": 1718221430
  },
  {
    "id": 40665721,
    "title": "எந்த LLM-ஐயும் அழித்தல் மூலம் சென்சார் நீக்கவும்",
    "originLink": "https://huggingface.co/blog/mlabonne/abliteration",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40665721",
    "commentBody": "",
    "originSummary": [
      "\"abliteration\" என்ற தொழில்நுட்பத்தை அறிமுகப்படுத்துகிறது, இது மறுபயிற்சி இல்லாமல் Llama மாதிரிகளை சென்சார் செய்யாமல் செய்யும் முறையாகும், அவற்றின் மறுப்பு செயல்முறையை நீக்குவதன் மூலம்.",
      "அப்லிடரேஷன் மாடலின் மீதமுள்ள ஸ்ட்ரீமில் உள்ள 'மறுப்பு திசையை' அடையாளம் கண்டு அகற்றுகிறது, இதனால் அது அனைத்து உத்தேசங்களுக்கு பதிலளிக்க முடியும்.",
      "தந்திரம் Daredevil-8B மாதிரிக்கு பயன்படுத்தப்பட்டது, இதன் விளைவாக NeuralDaredevil-8B உருவானது, இது 8B வகையில் சிறந்த செயல்திறனுடன் கூடிய சென்சார் செய்யப்படாத LLM ஆகும், ஆனால் செயல்திறன் குறைவுகளை மீட்டெடுக்க மேலும் பயிற்சி தேவைப்பட்டது."
    ],
    "commentSummary": [
      "இந்த உரை, நேரடியாக மறுப்புகளை வழங்குவதற்குப் பதிலாக ஊகிக்கத்தக்க பதில்களை வழங்கும் புதிய செயற்கை நுண்ணறிவு மாதிரியின் பயனர் அனுபவத்தைப் பற்றி விவரிக்கிறது, இது பயனருக்கு புத்துணர்ச்சியையும் மகிழ்ச்சியையும் அளிக்கிறது.",
      "",
      "உரை, தகவல் சுதந்திரத்துடன் AI பாதுகாப்பை சமநிலைப்படுத்தும் சவால்களை விளக்குகிறது, நெறிமுறைகள் மற்றும் AI உருவாக்கிய உள்ளடக்கத்தின் சட்ட விளைவுகளை வலியுறுத்துகிறது."
    ],
    "points": 426,
    "commentCount": 221,
    "retryCount": 0,
    "time": 1718250159
  },
  {
    "id": 40664339,
    "title": "மெட்டா பெரிய மொழி மாதிரிகளை எவ்வாறு அளவிலான முறையில் பயிற்சி செய்கிறது",
    "originLink": "https://engineering.fb.com/2024/06/12/data-infrastructure/training-large-language-models-at-scale-meta/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40664339",
    "commentBody": "",
    "originSummary": [
      "Meta பெரிய அளவிலான மொழி மாதிரிகளை (LLMs) பயிற்சியிட தேவையான பெரிய அளவிலான கணக்கீடுகளை சமாளிக்க AI ஆராய்ச்சியில் கவனம் செலுத்துகிறது, இது மென்பொருள், வன்பொருள் மற்றும் நெட்வொர்க் உள்கட்டமைப்பை மறுபரிசீலனை செய்ய தேவையாகிறது.",
      "அவர்கள் ஏற்கனவே உள்ள ஹார்ட்வேர்களை மாற்றி அமைத்தனர், அதில் NVIDIA H100 GPUகளுடன் Grand Teton தளத்தை மாற்றியமைத்ததும் அடங்கும், மேலும் கம்ப்யூட் திறனை அதிகரிக்கவும், காற்றால் குளிரூட்டப்பட்ட சூழலை பராமரிக்கவும் தங்களின் தரவுத்தொகுப்பு மைய அமைப்பை மேம்படுத்தினர்.",
      "மெட்டா, Llama 3 ஐ பயிற்சி செய்ய RoCE மற்றும் InfiniBand துணி அமைப்புகளைப் பயன்படுத்தி இரண்டு 24k GPU களங்களை உருவாக்கியது, உயர் செயல்திறன் மற்றும் திறமையான தரவுப் பரிமாற்றத்தை உறுதிப்படுத்த நெட்வொர்க் தொடர்பு மற்றும் சுமை சமநிலையை மேம்படுத்தியது."
    ],
    "commentSummary": [
      "மெட்டா நேரக் கட்டுப்பாடுகள் காரணமாக காற்றால் குளிரூட்டும் சூழலில் தங்கியிருக்க தனது இயந்திர மற்றும் வெப்ப வடிவமைப்புகளை மாற்ற வேண்டியிருந்தது, இது பெரிய அளவிலான பயன்பாட்டிற்கான சரிபார்ப்பு சுழற்சியை ஏற்படுத்தியது.",
      "",
      "உரையில் Google, Microsoft, மற்றும் Meta போன்ற தொழில்நுட்ப நிறுவனங்கள் தங்களின் சொந்த சிப்களை உருவாக்குவதில் போட்டியிடுவது குறித்து விவாதிக்கப்படுகிறது, Nvidia இன் GPU கள் மற்றும் Google இன் TPU களின் செயல்திறன் மற்றும் செலவுக் குறைவுத்தன்மையை முக்கியமாகக் குறிப்பிடுகிறது."
    ],
    "points": 368,
    "commentCount": 184,
    "retryCount": 0,
    "time": 1718235308
  },
  {
    "id": 40667976,
    "title": "Microsoft லாபத்தை பாதுகாப்புக்கு மேல் தேர்ந்தெடுத்தது, விசில்போக்கர் கூறுகிறார்",
    "originLink": "https://www.propublica.org/article/microsoft-solarwinds-golden-saml-data-breach-russian-hackers",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40667976",
    "commentBody": "",
    "originSummary": [
      "ஒரு விசிலடிப்பவர், ஆண்ட்ரூ ஹாரிஸ், மைக்ரோசாஃப்ட் முக்கியமான பாதுகாப்பு குறைபாட்டைப் பற்றி எச்சரிக்கைகளை புறக்கணித்தது, அரசாங்க வணிகத்தை இழக்காமல் இருக்க, பின்னர் ரஷ்ய ஹேக்கர்களால் சோலார்விண்ட்ஸ் தாக்குதலில் பயன்படுத்தப்பட்டது என்று கூறுகிறார்.",
      "Harris, ஒரு மையவழி பாதுகாப்பு நிபுணர், Microsoft இன் மேக அடிப்படையிலான திட்டத்தில் ஒரு பாதிப்பை கண்டுபிடித்தார், இது உணரப்படாத அணுகலை உணர்த்தாமல் முக்கியமான தகவல்களை அணுக அனுமதிக்கலாம், ஆனால் அவரது எச்சரிக்கைகள் நிதி விளைவுகளால் நிராகரிக்கப்பட்டன.",
      "ஹாரிஸின் முயற்சிகள் மற்றும் பின்னர் ஏற்பட்ட மீறல்கள் இருந்தபோதிலும், மைக்ரோசாஃப்ட் எந்த தயாரிப்பு அல்லது சேவையும் சுரண்டப்படவில்லை என்று நிலைநிறுத்தியது, இதனால் வாடிக்கையாளர் பாதுகாப்பை விட லாபத்தை முன்னுரிமைப்படுத்தும் நிறுவனத்தின் செயல்பாடுகள் விமர்சனத்திற்கு உள்ளானது."
    ],
    "commentSummary": [
      "\"Whistleblower Andrew Harris, a former Microsoft cybersecurity specialist, revealed that Microsoft delayed addressing a serious flaw in Active Directory Federation Services (AD FS) to secure a lucrative government deal, leading to the SolarWinds cyberattack.\" 결과:",
      "ProPublica இன் விசாரணை, உடனடி பாதுகாப்பு கவலைகளை விட வணிக வளர்ச்சியை முன்னுரிமை அளிக்கும் மைக்ரோசாஃப்ட் உள்ளேயுள்ள கலாச்சாரத்தை வெளிப்படுத்துகிறது, இது லாபத்தையும் வாடிக்கையாளர் பாதுகாப்பையும் சமநிலைப்படுத்தும் பரந்த தொழில்நுட்ப தொழில்துறையின் பிரச்சினைகளை பிரதிபலிக்கிறது.",
      "பாசாங்கு செய்பவர்கள் மற்றும் சைபர் பாதுகாப்பு நிபுணர்கள் லாபத்தை முதன்மையாகக் கொண்ட நிறுவனங்களில் பாதுகாப்பு பிரச்சினைகளில் விரைவான நடவடிக்கையை வலியுறுத்துவதில் எதிர்கொள்ளும் சவால்களை விவரிக்கிறது, பாதுகாப்பை முன்னுரிமைப்படுத்த ஒரு கலாச்சார மாற்றத்தின் தேவையை வலியுறுத்துகிறது."
    ],
    "points": 343,
    "commentCount": 162,
    "retryCount": 0,
    "time": 1718275185
  },
  {
    "id": 40661703,
    "title": "ChromeOS விரைவில் Android அடுக்கின் பெரிய பகுதிகளில் உருவாக்கப்படும்",
    "originLink": "https://blog.chromium.org/2024/06/building-faster-smarter-chromebook.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40661703",
    "commentBody": "",
    "originSummary": [
      "2024 ஜூன் 12 அன்று, குரோமியம் வலைப்பதிவு, கூகுள் ஏ.ஐ அம்சங்கள் மற்றும் புதுமைகளை விரைவாக வழங்க குரோம் ஓ.எஸ், ஆண்ட்ராய்டு ஸ்டாக்கின் பெரும் பகுதிகளை ஒருங்கிணைக்கும் என்று அறிவித்தது.",
      "இந்த ஒருங்கிணைப்பு, Android Linux kernel மற்றும் Android frameworks போன்ற கூறுகளை உள்ளடக்கியதாக இருக்கும், AI புதுமையை வேகமாக்க, பொறியியல் செயல்முறையை எளிமையாக்க, மற்றும் சாதனங்களின் இணக்கத்தை மேம்படுத்தும் நோக்கத்துடன் அமைக்கப்பட்டுள்ளது.",
      "இந்த மாற்றங்களுக்குப் பிறகும், ChromeOS அதன் பாதுகாப்பு, நிலைத்தன்மை மற்றும் மேலாண்மை திறன்களை பராமரிக்கும், இடைக்காலத்தில் வழக்கமான புதுப்பிப்புகள் மற்றும் புதிய புதுமைகள் தொடரும்."
    ],
    "commentSummary": [
      "ChromeOS விரைவில் Android குவியலின் பெரும் பகுதிகளைப் பயன்படுத்தி உருவாக்கப்படும், OS பிளவுகளை குறைத்து, புதுப்பிப்பு நிலைத்தன்மையை மேம்படுத்த Android இன் கட்டமைப்பை பயன்படுத்தும்.",
      "Chromebooks களுக்கு Android சாதனங்களுடன் ஒப்பிடும்போது நீண்ட கால ஆதரவு ஆயுள்காலம் உள்ளது, மேலும் ChromeOS பிளவுகளைச் சிறப்பாக கையாளுகிறது, ஸ்மார்ட்போன்களுக்கு ஏற்றதல்ல என்றாலும்.",
      "ChromeOS மற்றும் Android இன் ஒருங்கிணைப்பு, மொபைல் சாதனங்களில் டெஸ்க்டாப் அனுபவத்தை மேம்படுத்துவதோடு, தற்போதைய செயல்திறன் சிக்கல்களை தீர்க்கக்கூடிய ஒருங்கிணைந்த தளத்தை உருவாக்கக்கூடும்."
    ],
    "points": 302,
    "commentCount": 404,
    "retryCount": 0,
    "time": 1718218966
  },
  {
    "id": 40663704,
    "title": "ஜெரால்ட் சஸ்மேன்: நிரலாக்கம் (இருக்க வேண்டும்) மகிழ்ச்சியானது (2022) [வீடியோ]",
    "originLink": "https://www.youtube.com/watch?v=2MYzvQ1v8Ww",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40663704",
    "commentBody": "",
    "originSummary": [
      "இந்த எழுத்தாளர் 1962 ஆம் ஆண்டில் தொடங்கி, பல்வேறு ஆரம்பகால கணினிகளான IBM 790, 650, மற்றும் 1620 போன்றவற்றுடன் பணியாற்றிய, நிரலாக்கத்தில் விரிவான அனுபவம் கொண்டவர்.",
      "இந்த உரை, கவிதை, கட்டிடக்கலை மற்றும் இசை போன்ற கலை வடிவங்களுடன் ஒப்பிடப்பட்டு, நிரலாக்கத்தின் படைப்பாற்றல் மற்றும் சுருக்கமான தன்மையை வலியுறுத்துகிறது மற்றும் சிக்கல்களை புரிந்து கொண்டு மேலாண்மை செய்வதின் முக்கியத்துவத்தை குறிப்பிடுகிறது.",
      "ஆசிரியர் லிஸ்பில் eval மற்றும் apply செயல்முறை, பிழைத்திருத்தம், மற்றும் தரவுத்தொகுப்புகளில் அடையாளம் மற்றும் மாற்றம் போன்ற தத்துவ அம்சங்களைப் போன்ற முக்கியமான கருத்துக்களை நிரலாக்கம் மற்றும் கணினி அறிவியலில் விவரிக்கிறார்."
    ],
    "commentSummary": [
      "ஜெரால்ட் சஸ்மேன் கணிதம், இயற்பியல் மற்றும் உயிரியல் போன்ற துறைகளில் அறிவை சேமிக்கவும் புரிந்துகொள்ளவும் ஒரு வழியாக நிரலாக்கத்தை வலியுறுத்துகிறார், இதன் ஆழமான கல்வி மதிப்பை சிறப்பிக்கிறார்.",
      "உரை கணினி அறிவியலில் மகிழ்ச்சியை பராமரிப்பதின் முக்கியத்துவத்தை, ஆலன் ஜே. பெர்லிஸ் பரிந்துரைத்தது போல, வலியுறுத்துகிறது மற்றும் கணினி அறிவு பற்றிய கதவுகாப்பாளர்களாக மாறுவதை எதிர்க்கிறது.",
      "விவாதத்தில் பல பல்கலைக்கழகங்களில் Lisp கற்றலை Python கற்றலாக மாற்றியமைத்ததைப் பற்றி குறிப்பிடப்பட்டுள்ளது, Python வணிக ரீதியாக பிரபலமாக இருந்தாலும், கல்வியின் முதன்மை நோக்கம் வணிக ரீதியாக தொடர்புடைய மொழிகளின் மீது மட்டும் கவனம் செலுத்தாமல் 추상 சிந்தனையை வளர்ப்பதாக இருக்க வேண்டும்."
    ],
    "points": 272,
    "commentCount": 87,
    "retryCount": 0,
    "time": 1718229747
  },
  {
    "id": 40668088,
    "title": "இந்திய ஸ்டார்ட்அப் 72 மணி நேரத்தில் 3டி பிரிண்ட் ராக்கெட் என்ஜினை உருவாக்கியது",
    "originLink": "https://spectrum.ieee.org/3d-printed-rocket",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40668088",
    "commentBody": "",
    "originSummary": [
      "இந்திய ஸ்டார்ட்அப் ஆக்னிகுல் 72 மணி நேரத்தில் 3D அச்சிடப்பட்ட ராக்கெட் என்ஜினை வெற்றிகரமாக உருவாக்கியது, விண்வெளி தொழில்நுட்பத்திற்கான விரைவான உற்பத்தியில் முன்னேற்றங்களை வெளிப்படுத்துகிறது.",
      "அணி சதீஷ் தவான் விண்வெளி மையத்தில் தங்கள் முதல் வெற்றிகரமான ஏவுதலை அடைந்தது, 'தேவைப்படும் நேரத்தில்' ராக்கெட் ஏவுதல்களின் முன்னேற்றத்தை குறிக்கிறது.",
      ""
    ],
    "commentSummary": [
      "ஒரு இந்திய தொடக்க நிறுவனம் 72 மணி நேரத்தில் ஒரு ராக்கெட் இயந்திரத்தை 3D அச்சிட επιτυχώς முடித்துள்ளது, உற்பத்தி நேரத்தை குறிப்பிடத்தக்க அளவில் குறைத்துள்ளது.",
      "அச்சிடுவதற்காக பயன்படுத்தப்படும் இயந்திரம் தானாகவே எந்தவொரு சீர்கேடுகளையும் விவரிக்கும் ஒரு அறிக்கையை உருவாக்குகிறது, இது உற்பத்தி பிந்தைய சோதனைகளின் தேவையை நீக்கக்கூடும், ஆனால் சில நிபுணர்கள் இந்தக் கூற்றை எதிர்க்கின்றனர்.",
      "இந்த வளர்ச்சி இந்தியாவின் வளர்ந்து வரும் தொழில்நுட்ப துறையையும், சிக்கலான உற்பத்தியில் 3D அச்சிடுதலின் சாத்தியத்தையும் வெளிப்படுத்துகிறது, தர உறுதிப்படுத்தல் மற்றும் உற்பத்தி பிந்தைய பரிசோதனையின் அவசியம் பற்றிய தொடர்ந்த விவாதங்கள் இருந்தபோதிலும்."
    ],
    "points": 268,
    "commentCount": 164,
    "retryCount": 0,
    "time": 1718276531
  },
  {
    "id": 40667102,
    "title": "AMD இன் MI300X, LLM முன்னறிவிப்பு செயல்பாட்டில் Nvidia இன் H100 ஐ முந்துகிறது முடிவு:",
    "originLink": "https://www.blog.tensorwave.com/amds-mi300x-outperforms-nvidias-h100-for-llm-inference/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40667102",
    "commentBody": "",
    "originSummary": [
      "AMD இன் MI300X வேகமூட்டியை நிஜ உலக AI பணிகளில் NVIDIA இன் H100 SXM விட 33% அதிக தள்ளுபடி மூலம் ஒரு உரையாடல் பயன்பாட்டில் மேம்படுத்துகிறது.",
      "",
      "மாதிரிகள் MI300X ஆனது ஆஃப்லைன் மற்றும் ஆன்லைன் முன்னறிவிப்பு பணிகளில் சிறப்பாக செயல்படுகிறது என்பதை காட்டுகின்றன, இது அதிக தள்ளுபடி மற்றும் விரைவான பதில் நேரங்களுடன் AI முன்னறிவிப்பு திறன்களை விரிவாக்குவதற்கு சிறந்ததாகும்."
    ],
    "commentSummary": [
      "AMD இன் MI300X, LLM (பெரிய மொழி மாதிரி) முன்னறிவிப்பில் Nvidia இன் H100 ஐ முந்துகிறது, AI வேலைப்பளுவில் சிறப்பு பெற்ற மேக வழங்குநரான TensorWave இன் படி.",
      "அறிக்கையின் நம்பகத்தன்மை கேள்விக்குள்ளாகிறது, ஏனெனில் AMD இன் சிப் இரட்டிப்பு டிரான்சிஸ்டர்கள் மற்றும் நினைவகத்தை கொண்டிருந்தாலும், 33% மட்டுமே சிறப்பாக செயல்படுகிறது, மேலும் AMD அமைப்பு குறிப்பிடத்தக்க வகையில் மலிவாக உள்ளது.",
      "இந்த விவாதம் Nvidia வின் AI பணிச்சுமைகளில் ஆதிக்கம், அவர்களின் சந்தை நிலை மற்றும் AMD யின் சாத்தியமான போட்டியை முக்கியமாகக் குறிப்பிடுகிறது, மைக்ரோஆர்கிடெக்சர் வடிவமைப்பு திறன்கள் மற்றும் மென்பொருள் ஆகியவை ஹார்ட்வேர் செயல்திறனை முன்னெடுக்க முக்கியமானவை என்பதை வலியுறுத்துகிறது."
    ],
    "points": 264,
    "commentCount": 224,
    "retryCount": 0,
    "time": 1718265476
  },
  {
    "id": 40668504,
    "title": "தெற்கு மேற்கு விமானங்கள் போயிங் 737-8 மேக்ஸ் டச்சு ரோல் அனுபவித்தது",
    "originLink": "https://avherald.com/h?article=519ce679",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40668504",
    "commentBody": "",
    "originSummary": [
      "2024 மே 25ஆம் தேதி, சவுத் வெஸ்ட் ஏர்லைன்ஸ் போயிங் 737-8 மேக்ஸ் விமானம் நடுவானில் டச்சு ரோல் அனுபவித்தது, இதனால் பெரும் கட்டமைப்பு சேதம் ஏற்பட்டது, ஆனால் குழுவினர் ஓக்லாந்து, CA இல் பாதுகாப்பாக தரையிறங்கினர்.",
      "FAA இந்த நிகழ்வை ஒரு விபத்தாக வகைப்படுத்தியது, மற்றும் விமானம் ஒக்லாந்தில் தற்காலிக சரிசெய்தலுக்குப் பிறகு எவரெட்டுக்கு (WA) மேலும் பழுது பார்க்கக் கொண்டு செல்லப்பட்டது.",
      "பயனர்களிடையே நடந்த விவாதங்கள் தொழில்நுட்ப அம்சங்களை, பயணிகளின் அச்சத்தை, மற்றும் பாதுகாப்பை மேம்படுத்துவதற்காக போயிங் ஒரு இரண்டாவது சுயாதீன Yaw Damper அமைப்பை சேர்க்க வேண்டும் என்ற பரிந்துரைகளை வெளிப்படுத்துகின்றன."
    ],
    "commentSummary": [
      "சவுத் வெஸ்ட் ஏர்லைன்ஸ் போயிங் 737-8 மேக்ஸ் ஒரு டச்சு ரோல் அனுபவித்தது, இது ரோல் மற்றும் யா டைனமிக் முறைகளின் இணைப்பால் ஏற்படும் அதிர்வுகளை உள்ளடக்கிய ஒரு நிகழ்வாகும்.",
      "",
      "இந்த விவாதம் போயிங் நிறுவனத்தின் பொறியியல் தரநிலைகள், மேலாண்மை முடிவுகளின் தாக்கம் மற்றும் வணிக விமானப் பாதுகாப்பு குறித்த கவலைகளை எடுத்துக்காட்டுகிறது, சமீபத்திய 737 மேக்ஸ் பிரச்சினைகள் இருந்தபோதிலும்."
    ],
    "points": 241,
    "commentCount": 207,
    "retryCount": 0,
    "time": 1718279591
  },
  {
    "id": 40670612,
    "title": "MLow: மெட்டாவின் குறைந்த பிட்டரேட் ஆடியோ குறியாக்கி",
    "originLink": "https://engineering.fb.com/2024/06/13/web/mlow-metas-low-bitrate-audio-codec/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40670612",
    "commentBody": "",
    "originSummary": [
      "மெட்டா மெட்டா லோ பிட்ரேட் (எம் லோ) கோடெக்கை மெதுவான இணைப்புகள் மற்றும் குறைந்த அளவிலான சாதனங்களைக் கொண்ட பயனர்களுக்கான ஆடியோ தரத்தை மேம்படுத்த உருவாக்கியுள்ளது, இது ஓபஸ் கோடெக்கின் தரத்தை விட இருமடங்கு தரத்தை வழங்குகிறது, அதேசமயம் 10% குறைவான கணினி சக்தியை பயன்படுத்துகிறது.",
      "MLow இன்ஸ்டாகிராம் மற்றும் மெசஞ்சர் அழைப்புகளில் அறிமுகப்படுத்தப்பட்டுள்ளது, வாட்ஸ்அப்பில் விரிவாக்கத்துடன், பயனர் ஈடுபாட்டையும், குறிப்பாக குறைந்த பிட்ட்ரேட் நிலைகளில் ஆடியோ தரத்தையும் மேம்படுத்துகிறது.",
      "MLow, ஒரு CELP குறியீட்டு முறை, SuperWideBand ஆடியோ மற்றும் மேம்பட்ட முன்னேற்றக் குறைபாடுகளை திருத்தும் முறையை ஆதரிக்கிறது, பாக்கெட் இழப்பு நிலைகளிலும் ஆடியோ தரத்தை மேம்படுத்துகிறது, மேலும் எதிர்கால புதுப்பிப்புகளில் ஆடியோ மீட்பை மேம்படுத்துவதை நோக்கமாகக் கொண்டுள்ளது."
    ],
    "commentSummary": [
      "Meta ஒரு புதிய குறைந்த பிட்டரேட் ஆடியோ கோடெக்கை அறிமுகப்படுத்தியுள்ளது, இது அதிக பாக்கெட் வீதங்கள் மற்றும் மேலதிக செலவினால் நேரடி தொடர்புகளுக்கு சிறந்ததாக இருக்காது, ஆனால் தலைப்பு சுருக்கத்தைப் பயன்படுத்தும் சுற்று-மாற்று அல்லது VoIP அமைப்புகளில் பயனுள்ளதாக இருக்கலாம்.",
      "கோடெக், நம்பகத்தன்மையையும் உணரப்படும் ஆடியோ தரத்தையும் பராமரிக்க அல்லது மேம்படுத்துவதுடன், வலையமைப்பு பயன்பாட்டை குறைக்க வடிவமைக்கப்பட்டுள்ளது, இதனால் இது Facebook, Instagram, மற்றும் WhatsApp போன்ற தளங்களுக்கு ஏற்றதாகும்.",
      "கோடெக்கின் செயல்திறன் நிஜ உலக பயன்பாடுகளில் அதன் பிட்டுத் தவறுகளை கையாளும் திறன் மற்றும் குறைந்த சேனல் திறனை கையாளும் திறனைப் பொறுத்தது, இதில் முன்னேற்ற பிழை திருத்தம் (FEC) அழைப்பு தரத்தை பராமரிக்க முக்கிய பங்கு வகிக்கிறது."
    ],
    "points": 197,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1718291118
  },
  {
    "id": 40667606,
    "title": "Arm கூறுகிறது அனைத்து Snapdragon X Elite மடிக்கணினிகளும் அழிக்கப்பட வேண்டும்",
    "originLink": "https://www.xda-developers.com/arm-says-it-wants-all-snapdragon-x-elite-laptops-destroyed/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40667606",
    "commentBody": "",
    "originSummary": [
      "Arm, Qualcomm ஐ Windows சந்தையில் இருந்து நீக்கி, தனது சொந்த Cortex வடிவமைப்பை அறிமுகப்படுத்த முயற்சிக்கிறது, இது தனிப்பயன் Arm சிப்களுக்கான உரிமம் வழங்கும் உரிமைகள் குறித்த சட்டப்போராட்டத்திற்கு வழிவகுக்கிறது.",
      "வதந்திகள் Nvidia, MediaTek, மற்றும் AMD ஆகியவை Arm சிப்களுடன் Windows சூழலுக்குள் நுழையலாம் என்று கூறுகின்றன, 2025 CES க்குள் MediaTek Arm இன் Cortex கோர்களைப் பயன்படுத்தக்கூடும்.",
      "Arm Qualcomm இன் Nuvia வடிவங்களைப் பயன்படுத்துவது ஒப்பந்தக் கடமைகளை மீறுகிறது என்று கூறி, கப்பல்களை நிறுத்தவும் Snapdragon X தொடர் சிப்களை அழிக்கவும் முயற்சிக்கிறது, ஆனால் இத்தகைய தகராறுகள் பொதுவாக நிதி உடன்படிக்கைகளில் முடிவடைகின்றன."
    ],
    "commentSummary": [
      "Arm Qualcomm உடன் உள்ள உரிமம் தொடர்பான சர்ச்சையால் Snapdragon X Elite SoC இல் Nuvia இன் சர்வர் கோர்களைப் பயன்படுத்தியதற்காக அனைத்து Snapdragon X Elite மடிக்கணினிகளையும் அழிக்க வேண்டும் என்று கோருகிறது.",
      "முதன்மை பிரச்சினை என்னவென்றால் Qualcomm இன் Nuvia வாங்குதல், Nuvia வின் குறிப்பிட்ட உரிமத்தை Arm உடன் செல்லாததாக ஆக்கியதா, இது முதலில் சேவையகம்/தரவுத்தொகுப்பு மைய பயன்பாட்டிற்காக மட்டுமே இருந்தது.",
      "இந்த சட்டப் போராட்டத்தின் முடிவு எதிர்கால உரிமம் வழங்கும் ஒப்பந்தங்கள் மற்றும் பரந்த தொழில்நுட்பத் துறையை முக்கியமாக பாதிக்கக்கூடும், குறிப்பாக அறிவுசார் சொத்து (IP) எவ்வாறு பரிமாறப்பட்டு, வாங்கிய பிறகு பயன்படுத்தப்படுகிறது என்பதில் சாத்தியமான விளைவுகளை ஏற்படுத்தக்கூடும்."
    ],
    "points": 175,
    "commentCount": 143,
    "retryCount": 0,
    "time": 1718271192
  },
  {
    "id": 40669337,
    "title": "Shpool, ஒரு இலகுரக Tmux மாற்று",
    "originLink": "https://github.com/shell-pool/shpool",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40669337",
    "commentBody": "",
    "originSummary": [
      "Google துவக்கத்தில் தொலைதூர வேலைகளில் நிலைத்திருக்கும் டெர்மினல் அமர்வுகளை பராமரிக்க உருவாக்கப்பட்ட Shpool என்ற கருவியை திறந்த மூலமாக வெளியிட்டுள்ளது.",
      "Shpool தொலைதூர வேலை திறனை மேம்படுத்துவதற்காக இடையூறுகள் இல்லாமல் தொடர்ச்சியான டெர்மினல் அமர்வுகளை அனுமதிக்கிறது.",
      "இந்த வெளியீடு முக்கியமானது, ஏனெனில் இது டெவலப்பர்களுக்கு தொலைநிலை டெர்மினல் அமர்வுகளை நிர்வகிக்க ஒரு வலுவான தீர்வை வழங்குகிறது, இது பரவலாக உள்ள குழுக்களில் உற்பத்தித்திறனை மேம்படுத்தும் சாத்தியத்தை கொண்டுள்ளது."
    ],
    "commentSummary": [
      "Shpool, ஒரு டெர்மினல் செஷன் நிலைத்தன்மை கருவி, கூகிளால் உருவாக்கப்பட்டது, Tmux க்கு ஒரு இலகுரக மாற்றாக திறந்த மூலமாக வெளியிடப்பட்டுள்ளது.",
      "Shpool நீண்டநாள் செயல்முறைகள் மற்றும் அமைப்பு சேவைகளுக்கு ஏற்றவாறு கூடுதல் அம்சங்கள் இல்லாமல் நிலைத்திருக்கும் அமர்வுகளை நிர்வகிக்க வடிவமைக்கப்பட்டுள்ளது.",
      "கருவி ஒரு கன்சோலை பின்பற்றுகிறது, நிலையைப் பார்க்கவும் இணைக்கும் போது மீண்டும் வரையவும், ஆனால் தற்போது பல டெர்மினல் எமுலேட்டர்களை அல்லது டெர்மினல் எஸ்கேப் குறியீடுகளின் அதிகப்படியான பயன்பாட்டை ஆதரிக்கவில்லை."
    ],
    "points": 154,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1718284949
  },
  {
    "id": 40672215,
    "title": "நீங்கள் அன்னாவின் ஆவணத்திற்கு உதவ, டோரண்டுகளை விதைக்கலாம்",
    "originLink": "https://annas-archive.org/torrents",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40672215",
    "commentBody": "",
    "originSummary": [
      "அன்னாவின் காப்பகம், லைப்ரரி ஜெனசிஸ், மற்றும் சை-ஹப் ஆகியவை 521.1TB அளவிலான மனித அறிவின் பெரும் தொகுப்பை பாதுகாக்க ஒருங்கிணைந்த டோரண்ட் பட்டியலை உருவாக்கியுள்ளன, இதில் 60% ஏற்கனவே குறைந்தது நான்கு இடங்களில் நகலெடுக்கப்பட்டுள்ளது.",
      "பயனர்கள் டோரண்டுகளை விதைக்க ஊக்கப்படுத்தப்படுகிறார்கள், குறிப்பாக குறைந்த விதைவிதைகள் உள்ளவற்றை, 100% பாதுகாப்பை அடைய உதவ. பெரிய பங்களிப்பாளர்கள் (50TB அல்லது அதற்கு மேல்) காலாவதியான டோரண்டுகள் பற்றிய புதுப்பிப்புகளுக்கு குழுவை தொடர்பு கொள்ளலாம்.",
      "பட்டியல் மூன்று பகுதிகளாகப் பிரிக்கப்பட்டுள்ளது: அன்னாவின் ஆவணகத்தால் நிர்வகிக்கப்படும், லைப்ரரி ஜெனிசிஸ் மற்றும் சை-ஹப் போன்ற பிறரால் நிர்வகிக்கப்படும், மற்றும் பலவிதமான டோரண்டுகள். சில டோரண்டுகள் தற்காலிகமாக தடையிடப்பட்டிருக்கலாம்."
    ],
    "commentSummary": [
      "",
      "இந்த திட்டம் முக்கியமான காப்புரிமை மீறல் சவால்களை எதிர்கொள்கிறது, இது LibGen, Sci-Hub, மற்றும் Z-Library போன்ற பிற ஆன்லைன் நூலகங்கள் சந்தித்த சட்ட நடவடிக்கைகள் மற்றும் டொமைன் பறிமுதல் போன்றவற்றுக்கு ஒத்ததாகும்.",
      "IPFS இலிருந்து BitTorrent க்கு மாற்றம் BitTorrent இன் எளிதான பயன்பாடு மற்றும் குறைந்த உள்கட்டமைப்பு தேவைகளால் ஏற்படுகிறது, நீண்டகால தரவுப் பாதுகாப்பிற்கான torrent விதைத்தலின் நெறிமுறை மற்றும் சட்ட விளைவுகளை சமூகத்தில் விவாதிக்கின்றனர்."
    ],
    "points": 136,
    "commentCount": 95,
    "retryCount": 0,
    "time": 1718299214
  },
  {
    "id": 40670898,
    "title": "AMD தலைமை நிர்வாக அதிகாரி லிசா சு PS3 இன் பிரபலமான செல் செயலியை வடிவமைத்ததைப் பற்றி நினைவுகூர்கிறார்",
    "originLink": "https://www.tomshardware.com/tech-industry/amd-ceo-lisa-su-reminisces-on-helping-design-the-ps3s-infamous-cell-processor-at-ibm",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40670898",
    "commentBody": "",
    "originSummary": [
      "லிசா சு, ஏஎம்டி தலைமை நிர்வாக அதிகாரியாக ஆகும்முன், ஐபிஎமில் வேலை செய்தார் மற்றும் பிளேஸ்டேஷன் 3 இன் செல் செயலி வடிவமைப்பில் பங்களித்தார், இது ஐபிஎமின் பவர்பிசி அடிப்படையில் இருந்தது மற்றும் இணைச்செயலாக்கத்தை மையமாகக் கொண்டது.",
      "PlayStation 3 Sony-யின் மிகக் குறைவான வெற்றிகரமான கன்சோல்களில் ஒன்றாக இருந்தாலும், 2017 மார்ச் மாதத்திற்குள் 87.4 மில்லியன் யூனிட்கள் விற்பனையாகி, Uncharted 3 போன்ற கண்ணுக்கு கவர்ச்சியான விளையாட்டுகளை உருவாக்கியது.",
      "லிசா சுவின் தலைமையில், ஏஎம்டி இரண்டு தொடர்ச்சியான கன்சோல் தலைமுறைகளுக்கு பிளேஸ்டேஷன் மற்றும் எக்ஸ்பாக்ஸ் இரண்டிற்கும் ஹார்ட்வேரை வழங்கியுள்ளது, இது கேமிங் துறையில் நிறுவனத்திற்கு முக்கியமான சாதனையாகும்."
    ],
    "commentSummary": [
      "AMD தலைமை நிர்வாக அதிகாரி லிசா சு PS3 இன் செல் செயலியின் வடிவமைப்பில் உள்ள பார்வைகளை பகிர்ந்து கொண்டார், அதன் மேம்பட்ட கட்டமைப்பு மற்றும் விளையாட்டு மேம்பாட்டில் உள்ள சவால்களை விளக்கினார்.",
      "",
      ""
    ],
    "points": 128,
    "commentCount": 96,
    "retryCount": 0,
    "time": 1718292690
  },
  {
    "id": 40668803,
    "title": "iTerm 3.5.1 தானியங்கி OpenAI ஒருங்கிணைப்பை நீக்குகிறது, தேர்வுசெய்து இணைவதை தேவைப்படுத்துகிறது",
    "originLink": "https://iterm2.com/downloads.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40668803",
    "commentBody": "",
    "originSummary": [
      "iTerm2 3.5.2 என்பது 2024 ஜூன் 13 அன்று உருவாக்கப்பட்ட, macOS 10.15 மற்றும் அதற்குப் புதியவற்றிற்கு பரிந்துரைக்கப்படும் சமீபத்திய நிலையான வெளியீடு ஆகும்.",
      "சமீபத்திய பீட்டா பதிப்பு, iTerm2 3.5.1beta4, சோதனைக்காக கிடைக்கிறது, இது ஜூன் 3, 2024 அன்று உருவாக்கப்பட்டது, அடிக்கடி புதுப்பிப்புகள் உள்ளன ஆனால் சில சமயங்களில் நிலைத்தன்மையற்றது.",
      "நள்ளிரவு கட்டமைப்புகள் தினசரி உருவாக்கப்படுகின்றன, மாற்றங்கள் உறுதிப்படுத்தப்பட்டால், ஆனால் அவை கடுமையான பிழைகளை கொண்டிருக்கலாம்; சமீபத்திய மற்றும் பழைய கட்டமைப்புகள் காப்பகங்களில் கிடைக்கின்றன."
    ],
    "commentSummary": [
      "iTerm 3.5.1 புதுப்பிப்பு தானியங்கி OpenAI ஒருங்கிணைப்பை நீக்குகிறது, இப்போது பயனர்கள் இணைவதைத் தேர்ந்தெடுக்க வேண்டும், இது பயனர்களிடையே விவாதத்தை ஏற்படுத்துகிறது.",
      "நிறுவன சூழல்களில், குறிப்பாக தேர்வு செய்யும் அம்சத்துடன் கூட, சாத்தியமான தரவுப் பாதுகாப்பு ஆபத்துகள் குறித்து கவலைகள் எழுந்தன, இது கடுமையான நெட்வொர்க் நிலை கட்டுப்பாடுகளின் தேவையை வலியுறுத்துகிறது.",
      "AI ஒருங்கிணைப்புக்கு எதிரான எதிரொலி, மென்பொருள் புதுப்பிப்புகளை சரியாக பரிசோதிக்காமல், போதுமான மேற்பார்வையின்றி தானியங்கி புதுப்பிப்புகளை அனுமதித்ததற்காக ஐடி நிபுணர்களை விமர்சிக்க வழிவகுத்தது."
    ],
    "points": 125,
    "commentCount": 131,
    "retryCount": 0,
    "time": 1718281642
  }
]
