[
  {
    "id": 40662176,
    "title": "Nhật Bản ban hành luật thúc đẩy cạnh tranh trong các cửa hàng ứng dụng điện thoại thông minh",
    "originLink": "https://english.kyodonews.net/news/2024/06/bc2d7f45d456-japan-enacts-law-to-curb-apple-googles-app-dominance.html#google_vignette",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40662176",
    "commentBody": "",
    "originSummary": [
      "Nhật Bản đã ban hành một luật mới nhằm cải thiện chăm sóc trẻ em để giải quyết tình trạng tỷ lệ sinh giảm của đất nước, có hiệu lực từ ngày 5 tháng 6 năm 2024.",
      "Luật pháp là một phần của những nỗ lực rộng lớn hơn nhằm tạo ra một môi trường hỗ trợ hơn cho các gia đình và khuyến khích tỷ lệ sinh cao hơn.",
      "Động thái này nhấn mạnh cách tiếp cận chủ động của Nhật Bản trong việc giải quyết các thách thức về nhân khẩu học và đảm bảo tăng trưởng dân số bền vững."
    ],
    "commentSummary": [
      "Nhật Bản đã ban hành một luật để thúc đẩy cạnh tranh trong các cửa hàng ứng dụng trên điện thoại thông minh, ngăn chặn các công ty như Apple và Google cản trở việc bán các ứng dụng và dịch vụ cạnh tranh.",
      "Luật có thể yêu cầu Apple cho phép các cửa hàng ứng dụng của bên thứ ba và các phương thức thanh toán trực tiếp, đặt ra câu hỏi về việc tuân thủ các điều khoản dịch vụ của Apple.",
      "Luật này nhằm thách thức sự thống trị của các tập đoàn công nghệ thông tin lớn và thúc đẩy một thị trường cạnh tranh hơn, có thể mang lại lợi ích cho cả người tiêu dùng và nhà phát triển."
    ],
    "points": 436,
    "commentCount": 291,
    "retryCount": 0,
    "time": 1718221430
  },
  {
    "id": 40665721,
    "title": "Loại bỏ kiểm duyệt bất kỳ LLM nào bằng cách xóa bỏ",
    "originLink": "https://huggingface.co/blog/mlabonne/abliteration",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40665721",
    "commentBody": "",
    "originSummary": [
      "Trong bài viết, kỹ thuật \"abliteration\" được giới thiệu như một phương pháp để bỏ kiểm duyệt các mô hình Llama mà không cần huấn luyện lại bằng cách loại bỏ cơ chế từ chối của chúng.",
      "Abliteration xác định và loại bỏ \"hướng từ chối\" trong dòng dư của mô hình, cho phép nó phản hồi tất cả các lời nhắc.",
      "Phương pháp này đã được áp dụng cho mô hình Daredevil-8B, tạo ra NeuralDaredevil-8B, một mô hình ngôn ngữ lớn không bị kiểm duyệt với hiệu suất hàng đầu trong danh mục 8B, mặc dù nó cần được đào tạo thêm để phục hồi các sụt giảm hiệu suất."
    ],
    "commentSummary": [
      "Văn bản thảo luận về trải nghiệm của người dùng với một mô hình AI mới cung cấp các câu trả lời mang tính suy đoán thay vì từ chối thẳng thừng, điều mà người dùng thấy mới mẻ và thú vị.",
      "Cuộc tranh luận xoay quanh các biện pháp an toàn và đạo đức của các mô hình AI, với các lập luận ủng hộ và phản đối việc kiểm duyệt, cũng như khả năng lạm dụng các mô hình không kiểm duyệt cho các hoạt động gây hại.",
      "Văn bản nêu bật những thách thức trong việc cân bằng an toàn AI với tự do thông tin, nhấn mạnh sự cần thiết của các hướng dẫn đạo đức và những tác động pháp lý tiềm tàng của nội dung do AI tạo ra."
    ],
    "points": 426,
    "commentCount": 221,
    "retryCount": 0,
    "time": 1718250159
  },
  {
    "id": 40664339,
    "title": "Meta huấn luyện các mô hình ngôn ngữ lớn ở quy mô lớn như thế nào",
    "originLink": "https://engineering.fb.com/2024/06/12/data-infrastructure/training-large-language-models-at-scale-meta/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40664339",
    "commentBody": "",
    "originSummary": [
      "Meta đang tập trung vào nghiên cứu AI để giải quyết việc tính toán quy mô lớn cần thiết cho việc huấn luyện các mô hình ngôn ngữ lớn (LLMs), đòi hỏi phải suy nghĩ lại về phần mềm, phần cứng và cơ sở hạ tầng mạng.",
      "Họ đã điều chỉnh phần cứng hiện có, bao gồm việc sửa đổi nền tảng Grand Teton với các GPU NVIDIA H100, và tối ưu hóa bố trí trung tâm dữ liệu của họ để tối đa hóa khả năng tính toán trong khi vẫn duy trì môi trường làm mát bằng không khí.",
      "Meta đã xây dựng hai cụm GPU 24k sử dụng các kết cấu RoCE và InfiniBand để huấn luyện Llama 3, tối ưu hóa giao tiếp mạng và cân bằng tải để đảm bảo hiệu suất cao và truyền dữ liệu hiệu quả."
    ],
    "commentSummary": [
      "Meta đã phải điều chỉnh các thiết kế cơ khí và nhiệt để duy trì trong môi trường làm mát bằng không khí do hạn chế về thời gian, dẫn đến một chu kỳ xác nhận cho việc triển khai quy mô lớn.",
      "Vẫn còn nhiều câu hỏi về cách Meta thu thập và chuẩn bị dữ liệu để đào tạo, đặc biệt là liên quan đến Thông tin Nhận dạng Cá nhân (PII), vốn không thể truy cập theo mặc định và yêu cầu quyền truy cập đặc biệt.",
      "Văn bản thảo luận về sự cạnh tranh giữa các công ty công nghệ như Google, Microsoft và Meta trong việc phát triển chip riêng của họ, nhấn mạnh hiệu suất và hiệu quả chi phí của GPU Nvidia so với TPU của Google."
    ],
    "points": 368,
    "commentCount": 184,
    "retryCount": 0,
    "time": 1718235308
  },
  {
    "id": 40667976,
    "title": "Microsoft chọn lợi nhuận thay vì bảo mật, người tố giác nói",
    "originLink": "https://www.propublica.org/article/microsoft-solarwinds-golden-saml-data-breach-russian-hackers",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40667976",
    "commentBody": "",
    "originSummary": [
      "Người tố giác, Andrew Harris, tuyên bố rằng Microsoft đã phớt lờ các cảnh báo về một lỗ hổng bảo mật nghiêm trọng để tránh mất các hợp đồng kinh doanh với chính phủ, lỗ hổng này sau đó đã bị tin tặc Nga khai thác trong cuộc tấn công SolarWinds.",
      "Harris, một chuyên gia an ninh mạng, đã phát hiện ra một lỗ hổng trong chương trình dựa trên đám mây của Microsoft có thể cho phép truy cập không bị phát hiện vào thông tin nhạy cảm, nhưng những cảnh báo của anh đã bị bác bỏ do các tác động tài chính tiềm ẩn.",
      "Mặc dù Harris đã nỗ lực và có những vi phạm sau đó, Microsoft vẫn khẳng định rằng không có sản phẩm hay dịch vụ nào bị khai thác, dẫn đến sự chỉ trích về việc công ty ưu tiên lợi nhuận hơn là an ninh của khách hàng."
    ],
    "commentSummary": [
      "Người tố giác Andrew Harris, một cựu chuyên gia an ninh mạng của Microsoft, tiết lộ rằng Microsoft đã trì hoãn việc khắc phục một lỗ hổng nghiêm trọng trong Dịch vụ Liên kết Thư mục Hoạt động (AD FS) để đảm bảo một hợp đồng béo bở với chính phủ, dẫn đến cuộc tấn công mạng SolarWinds.",
      "Cuộc điều tra của ProPublica nêu bật một văn hóa bên trong Microsoft ưu tiên tăng trưởng kinh doanh hơn các mối quan tâm an ninh tức thời, phản ánh các vấn đề rộng hơn của ngành công nghệ về việc cân bằng lợi nhuận với an ninh khách hàng.",
      "Văn bản thảo luận về những thách thức mà những người tố giác và các chuyên gia an ninh mạng phải đối mặt trong việc kêu gọi hành động nhanh chóng về các vấn đề an ninh trong các tập đoàn hướng lợi nhuận, nhấn mạnh sự cần thiết của một sự thay đổi văn hóa để ưu tiên an ninh."
    ],
    "points": 343,
    "commentCount": 162,
    "retryCount": 0,
    "time": 1718275185
  },
  {
    "id": 40661703,
    "title": "ChromeOS sẽ sớm được phát triển trên các phần lớn của nền tảng Android",
    "originLink": "https://blog.chromium.org/2024/06/building-faster-smarter-chromebook.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40661703",
    "commentBody": "",
    "originSummary": [
      "Vào ngày 12 tháng 6 năm 2024, Chromium Blog đã thông báo rằng ChromeOS sẽ tích hợp các phần lớn của ngăn xếp Android để đẩy nhanh việc cung cấp các tính năng và đổi mới của Google AI.",
      "Việc tích hợp này sẽ bao gồm các thành phần như nhân Linux của Android và các khung Android, nhằm thúc đẩy đổi mới AI, đơn giản hóa kỹ thuật và nâng cao khả năng tương thích của thiết bị.",
      "Mặc dù có những thay đổi này, ChromeOS sẽ duy trì tính bảo mật, tính nhất quán và khả năng quản lý của mình, với các bản cập nhật thường xuyên và những đổi mới mới tiếp tục trong thời gian tạm thời."
    ],
    "commentSummary": [
      "ChromeOS sẽ sớm được phát triển bằng cách sử dụng các phần lớn của ngăn xếp Android, tận dụng kiến trúc của Android để giảm sự phân mảnh của hệ điều hành và cải thiện tính nhất quán của các bản cập nhật.",
      "Chromebook có vòng đời hỗ trợ dài hơn so với các thiết bị Android, và ChromeOS xử lý phân mảnh tốt hơn, mặc dù không phù hợp cho điện thoại thông minh.",
      "Việc tích hợp ChromeOS và Android có thể dẫn đến một nền tảng thống nhất hơn, tiềm năng cải thiện trải nghiệm máy tính để bàn trên các thiết bị di động và giải quyết các vấn đề hiệu suất hiện tại."
    ],
    "points": 302,
    "commentCount": 404,
    "retryCount": 0,
    "time": 1718218966
  },
  {
    "id": 40663704,
    "title": "Gerald Sussman: Lập trình là (nên là) niềm vui (2022) [video]",
    "originLink": "https://www.youtube.com/watch?v=2MYzvQ1v8Ww",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40663704",
    "commentBody": "",
    "originSummary": [
      "Người tác giả có kinh nghiệm rộng rãi trong lập trình, bắt đầu từ năm 1962, và đã làm việc với nhiều máy tính đời đầu như IBM 790, 650 và 1620.",
      "Văn bản nhấn mạnh tính sáng tạo và trừu tượng của lập trình, so sánh nó với các hình thức nghệ thuật như thơ ca, kiến trúc và âm nhạc, và nêu bật tầm quan trọng của việc hiểu và quản lý sự phức tạp.",
      "Người tác giả thảo luận về các khái niệm quan trọng trong lập trình và khoa học máy tính, chẳng hạn như quá trình eval và apply trong Lisp, gỡ lỗi, và các khía cạnh triết học của danh tính và sự thay đổi trong các cấu trúc dữ liệu."
    ],
    "commentSummary": [
      "Gerald Sussman nhấn mạnh lập trình như một phương tiện để lưu trữ và hiểu biết kiến thức trong các lĩnh vực như toán học, vật lý và sinh học, nhấn mạnh giá trị giáo dục sâu sắc của nó.",
      "Văn bản nhấn mạnh tầm quan trọng của việc duy trì sự vui vẻ trong khoa học máy tính, như được Alan J. Perlis ủng hộ, và cảnh báo chống lại việc trở thành những người gác cổng của tri thức máy tính.",
      "Cuộc thảo luận bao gồm sự chuyển đổi từ việc dạy Lisp sang Python trong các trường đại học, lưu ý rằng mặc dù Python phổ biến trong thương mại, mục tiêu chính của giáo dục nên là phát triển tư duy trừu tượng thay vì chỉ tập trung vào các ngôn ngữ có liên quan đến thương mại."
    ],
    "points": 272,
    "commentCount": 87,
    "retryCount": 0,
    "time": 1718229747
  },
  {
    "id": 40668088,
    "title": "Startup Ấn Độ in 3D động cơ tên lửa trong 72 giờ",
    "originLink": "https://spectrum.ieee.org/3d-printed-rocket",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40668088",
    "commentBody": "",
    "originSummary": [
      "Startup Ấn Độ Agnikul đã thành công in 3D một động cơ tên lửa trong 72 giờ, thể hiện những tiến bộ trong sản xuất nhanh cho công nghệ không gian.",
      "Đội đã đạt được lần phóng thành công đầu tiên tại Trung tâm Vũ trụ Satish Dhawan, cho thấy tiến bộ hướng tới các lần phóng tên lửa \"theo yêu cầu\".",
      "Thành tựu này nhấn mạnh tiềm năng cho các sứ mệnh không gian linh hoạt và tiết kiệm chi phí hơn trong tương lai."
    ],
    "commentSummary": [
      "Một công ty khởi nghiệp Ấn Độ đã thành công trong việc in 3D một động cơ tên lửa trong 72 giờ, giảm đáng kể thời gian sản xuất.",
      "Máy in tự động tạo ra một báo cáo chi tiết về bất kỳ sai lệch nào, có thể loại bỏ nhu cầu kiểm tra sau sản xuất, mặc dù một số chuyên gia tranh cãi về tuyên bố này.",
      "Diễn biến này làm nổi bật cảnh quan công nghệ đang phát triển của Ấn Độ và tiềm năng của in 3D trong sản xuất phức tạp, mặc dù vẫn còn những tranh luận về đảm bảo chất lượng và sự cần thiết của việc kiểm tra sau sản xuất."
    ],
    "points": 268,
    "commentCount": 164,
    "retryCount": 0,
    "time": 1718276531
  },
  {
    "id": 40667102,
    "title": "AMD's MI300X vượt trội hơn Nvidia's H100 trong suy luận LLM",
    "originLink": "https://www.blog.tensorwave.com/amds-mi300x-outperforms-nvidias-h100-for-llm-inference/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40667102",
    "commentBody": "",
    "originSummary": [
      "Trong các tác vụ AI thực tế, bộ tăng tốc MI300X của AMD vượt trội hơn H100 SXM của NVIDIA, đạt hiệu suất cao hơn 33% trong trường hợp sử dụng trò chuyện.",
      "Mặc dù hệ sinh thái phần mềm của NVIDIA đã trưởng thành, MI300X của AMD là một đối thủ mạnh, cung cấp hiệu suất tốt hơn, hiệu quả chi phí và khả năng sẵn có cho suy luận đám mây quy mô lớn.",
      "Thử nghiệm cho thấy MI300X vượt trội trong cả các tác vụ suy luận ngoại tuyến và trực tuyến, làm cho nó trở nên lý tưởng để mở rộng khả năng suy luận AI với thông lượng cao hơn và thời gian phản hồi nhanh hơn."
    ],
    "commentSummary": [
      "AMD's MI300X vượt trội hơn Nvidia's H100 trong suy luận mô hình ngôn ngữ lớn (LLM), theo TensorWave, một nhà cung cấp dịch vụ đám mây chuyên về khối lượng công việc AI.",
      "Độ tin cậy của báo cáo bị đặt câu hỏi do chip của AMD có gấp đôi số lượng bóng bán dẫn và bộ nhớ nhưng chỉ hoạt động tốt hơn 33%, và cấu hình của AMD lại rẻ hơn đáng kể.",
      "Cuộc thảo luận nêu bật sự thống trị của Nvidia trong các khối lượng công việc AI, vị trí thị trường của họ và sự cạnh tranh tiềm năng từ AMD, nhấn mạnh tầm quan trọng của kỹ năng thiết kế vi kiến trúc và phần mềm trong việc thúc đẩy hiệu suất phần cứng."
    ],
    "points": 264,
    "commentCount": 224,
    "retryCount": 0,
    "time": 1718265476
  },
  {
    "id": 40668504,
    "title": "Máy bay Boeing 737-8 Max của Southwest Airlines gặp hiện tượng lắc ngang",
    "originLink": "https://avherald.com/h?article=519ce679",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40668504",
    "commentBody": "",
    "originSummary": [
      "Vào ngày 25 tháng 5 năm 2024, một chiếc Boeing 737-8 MAX của hãng hàng không Southwest Airlines đã gặp phải hiện tượng lắc ngang (Dutch Roll) giữa chuyến bay, dẫn đến thiệt hại cấu trúc đáng kể, tuy nhiên phi hành đoàn đã hạ cánh an toàn tại Oakland, CA.",
      "FAA đã phân loại sự kiện này là một tai nạn, và máy bay đã được chuyển đến Everett, WA, để sửa chữa thêm sau khi đã tạm thời khắc phục ở Oakland.",
      "Thảo luận giữa các người dùng nêu bật các khía cạnh kỹ thuật, khả năng gây hoảng sợ cho hành khách, và đề xuất Boeing thêm một hệ thống Yaw Damper độc lập thứ hai để tăng cường an toàn."
    ],
    "commentSummary": [
      "Máy bay Boeing 737-8 Max của Southwest Airlines đã trải qua hiện tượng lắc lư kiểu Hà Lan, một hiện tượng liên quan đến dao động do sự kết hợp giữa các chế độ động học lăn và quay.",
      "Dạng lắc kiểu Hà Lan đã có tiền lệ lịch sử, với các trường hợp đáng chú ý liên quan đến các mẫu máy bay khác nhau, bao gồm cả vụ tai nạn chết người của một chiếc Boeing 747SR của Japan Airlines vào năm 1985.",
      "Cuộc thảo luận nêu bật những lo ngại về tiêu chuẩn kỹ thuật của Boeing, tác động của các quyết định quản lý và sự an toàn của hàng không thương mại, mặc dù có những vấn đề gần đây với 737 Max."
    ],
    "points": 241,
    "commentCount": 207,
    "retryCount": 0,
    "time": 1718279591
  },
  {
    "id": 40670612,
    "title": "MLow: Bộ mã hóa âm thanh bitrate thấp của Meta",
    "originLink": "https://engineering.fb.com/2024/06/13/web/mlow-metas-low-bitrate-audio-codec/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40670612",
    "commentBody": "",
    "originSummary": [
      "Meta đã phát triển codec Meta Low Bitrate (MLow) để cải thiện chất lượng âm thanh cho người dùng có kết nối chậm và thiết bị cấp thấp, cung cấp chất lượng gấp đôi so với codec Opus trong khi sử dụng ít hơn 10% công suất tính toán.",
      "MLow đã được ra mắt trên các cuộc gọi Instagram và Messenger, với việc triển khai trên WhatsApp, nâng cao sự tương tác của người dùng và chất lượng âm thanh, đặc biệt trong điều kiện băng thông thấp.",
      "MLow, một codec CELP, hỗ trợ âm thanh SuperWideBand và cải thiện Sửa Lỗi Tiến, nâng cao chất lượng âm thanh ngay cả trong các tình huống mất gói, và nhằm mục đích cải thiện khôi phục âm thanh trong các bản cập nhật tương lai."
    ],
    "commentSummary": [
      "Meta đã giới thiệu một codec âm thanh mới với bitrate thấp, có thể không lý tưởng cho các giao tiếp thời gian thực do tỷ lệ gói tin cao và chi phí phụ, nhưng có thể có lợi trong các hệ thống chuyển mạch kênh hoặc VoIP sử dụng nén tiêu đề.",
      "Codec được thiết kế để giảm tiêu thụ băng thông trong khi vẫn duy trì hoặc cải thiện độ tin cậy và chất lượng âm thanh cảm nhận, làm cho nó phù hợp với các nền tảng như Facebook, Instagram và WhatsApp.",
      "Hiệu suất của codec trong các ứng dụng thực tế phụ thuộc vào khả năng xử lý lỗi bit và giảm dung lượng kênh, với Sửa lỗi Tiến (FEC) đóng vai trò quan trọng trong việc duy trì chất lượng cuộc gọi."
    ],
    "points": 197,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1718291118
  },
  {
    "id": 40667606,
    "title": "Arm nói rằng họ muốn tất cả các laptop Snapdragon X Elite bị tiêu hủy",
    "originLink": "https://www.xda-developers.com/arm-says-it-wants-all-snapdragon-x-elite-laptops-destroyed/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40667606",
    "commentBody": "",
    "originSummary": [
      "Arm đang cố gắng loại bỏ Qualcomm khỏi thị trường Windows để giới thiệu thiết kế Cortex của riêng mình, dẫn đến một tranh chấp pháp lý về quyền cấp phép cho các chip Arm tùy chỉnh.",
      "Tin đồn cho rằng Nvidia, MediaTek và AMD có thể tham gia vào hệ sinh thái Windows với các chip Arm, có khả năng vào CES 2025, với MediaTek có thể sử dụng các lõi Cortex của Arm.",
      "Arm tuyên bố việc Qualcomm sử dụng các thiết kế của Nuvia vi phạm các nghĩa vụ hợp đồng, tìm cách ngừng vận chuyển và tiêu hủy các chip dòng Snapdragon X, mặc dù các tranh chấp như vậy thường kết thúc bằng các thỏa thuận tài chính."
    ],
    "commentSummary": [
      "Arm đang yêu cầu tiêu hủy tất cả các laptop Snapdragon X Elite do tranh chấp về giấy phép với Qualcomm liên quan đến việc sử dụng lõi máy chủ của Nuvia trong SoC Snapdragon X Elite.",
      "Vấn đề cốt lõi là liệu việc Qualcomm mua lại Nuvia có làm vô hiệu hóa giấy phép cụ thể của Nuvia với Arm, vốn ban đầu chỉ dành cho việc sử dụng trong máy chủ/trung tâm dữ liệu hay không.",
      "Kết quả của cuộc chiến pháp lý này có thể ảnh hưởng đáng kể đến các thỏa thuận cấp phép trong tương lai và ngành công nghệ rộng lớn hơn, với những tác động tiềm tàng đến cách chuyển giao và sử dụng tài sản trí tuệ (IP) sau khi mua lại."
    ],
    "points": 175,
    "commentCount": 143,
    "retryCount": 0,
    "time": 1718271192
  },
  {
    "id": 40669337,
    "title": "Shpool, một lựa chọn thay thế nhẹ cho Tmux",
    "originLink": "https://github.com/shell-pool/shpool",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40669337",
    "commentBody": "",
    "originSummary": [
      "Google đã mã nguồn mở Shpool, một công cụ ban đầu được phát triển để duy trì các phiên làm việc trên terminal liên tục trong các quy trình làm việc từ xa.",
      "Shpool nhằm nâng cao hiệu quả làm việc từ xa bằng cách cho phép các phiên làm việc trên terminal liên tục mà không bị gián đoạn.",
      "Phiên bản này có ý nghĩa quan trọng vì nó cung cấp cho các nhà phát triển một giải pháp mạnh mẽ để quản lý các phiên làm việc từ xa, có khả năng cải thiện năng suất trong các nhóm làm việc phân tán."
    ],
    "commentSummary": [
      "Shpool, một công cụ duy trì phiên làm việc trên terminal được phát triển bởi Google, đã được mã nguồn mở như một giải pháp thay thế nhẹ cho Tmux.",
      "Shpool được thiết kế để quản lý các phiên làm việc liên tục mà không có các tính năng bổ sung, làm cho nó phù hợp với các quy trình chạy dài và các dịch vụ hệ thống.",
      "Công cụ này mô phỏng một bảng điều khiển để xem trạng thái và tái hiển thị khi đính kèm, nhưng hiện tại không hỗ trợ nhiều trình giả lập terminal hoặc sử dụng nhiều mã thoát terminal."
    ],
    "points": 154,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1718284949
  },
  {
    "id": 40672215,
    "title": "Bạn có thể giúp Anna's Archive bằng cách seeding các torrent",
    "originLink": "https://annas-archive.org/torrents",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40672215",
    "commentBody": "",
    "originSummary": [
      "Anna’s Archive, Library Genesis và Sci-Hub đã tạo ra một danh sách torrent thống nhất để bảo tồn một lượng lớn kiến thức của nhân loại, tổng cộng 521,1TB, với 60% đã được sao chép ít nhất tại bốn địa điểm.",
      "Người dùng được khuyến khích seed torrent, đặc biệt là những torrent có ít seeders, để giúp đạt được 100% bảo tồn. Những người đóng góp lớn (50TB trở lên) có thể liên hệ với đội ngũ để cập nhật về các torrent đã ngừng hỗ trợ.",
      "Danh sách được chia thành ba phần: do Anna’s Archive quản lý, do các tổ chức khác như Library Genesis và Sci-Hub quản lý, và các torrent khác. Một số torrent có thể tạm thời bị cấm."
    ],
    "commentSummary": [
      "Anna's Archive, một bản sao của Library Genesis và Sci-Hub, đang tìm kiếm sự giúp đỡ để gieo hơn 500 TB sách và tài liệu để bảo tồn, với 40% hiện đang được gieo bởi ít hơn 4 nút.",
      "Đề án đang đối mặt với những thách thức lớn về vi phạm bản quyền, tương tự như các thư viện trực tuyến khác như LibGen, Sci-Hub và Z-Library, những nơi đã từng phải đối mặt với các hành động pháp lý và việc tịch thu tên miền.",
      "Việc chuyển từ IPFS sang BitTorrent để bảo tồn dữ liệu là do BitTorrent dễ sử dụng hơn và yêu cầu hạ tầng thấp hơn, với cộng đồng đang tranh luận về các tác động đạo đức và pháp lý của việc gieo hạt torrent cho việc bảo tồn dữ liệu lâu dài."
    ],
    "points": 136,
    "commentCount": 95,
    "retryCount": 0,
    "time": 1718299214
  },
  {
    "id": 40670898,
    "title": "Giám đốc điều hành AMD Lisa Su hồi tưởng về việc thiết kế bộ vi xử lý Cell khét tiếng của PS3",
    "originLink": "https://www.tomshardware.com/tech-industry/amd-ceo-lisa-su-reminisces-on-helping-design-the-ps3s-infamous-cell-processor-at-ibm",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40670898",
    "commentBody": "",
    "originSummary": [
      "Trước khi trở thành CEO của AMD, Lisa Su đã làm việc tại IBM và đóng góp vào việc thiết kế bộ vi xử lý Cell của PlayStation 3, dựa trên PowerPC của IBM và tập trung vào việc song song hóa.",
      "Mặc dù PlayStation 3 là một trong những máy chơi game ít thành công nhất của Sony, nhưng nó đã bán được 87,4 triệu chiếc tính đến tháng 3 năm 2017 và dẫn đến những trò chơi có hình ảnh tuyệt đẹp như Uncharted 3.",
      "Dưới sự lãnh đạo của Lisa Su, AMD đã cung cấp phần cứng cho cả PlayStation và Xbox trong hai thế hệ console liên tiếp, đánh dấu một thành tựu đáng kể cho công ty trong ngành công nghiệp game."
    ],
    "commentSummary": [
      "Giám đốc điều hành AMD Lisa Su đã chia sẻ những hiểu biết về việc thiết kế bộ vi xử lý Cell của PS3, nhấn mạnh kiến trúc tiên tiến của nó và những thách thức trong phát triển trò chơi.",
      "Vi xử lý Cell của PS3 mạnh mẽ nhưng khó lập trình, dẫn đến thành công không đồng đều và sự chấp nhận thị trường hạn chế so với các CPU X86_64 và ARM.",
      "Phần cứng độc đáo của PS3, bao gồm bộ xử lý Cell và GPU của Nvidia, đã khiến nó trở thành một máy chơi game phức tạp nhưng sáng tạo, ảnh hưởng đến sự phát triển của các máy chơi game và môi trường phát triển của chúng."
    ],
    "points": 128,
    "commentCount": 96,
    "retryCount": 0,
    "time": 1718292690
  },
  {
    "id": 40668803,
    "title": "iTerm 3.5.1 loại bỏ tích hợp tự động OpenAI, yêu cầu người dùng tự chọn",
    "originLink": "https://iterm2.com/downloads.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40668803",
    "commentBody": "",
    "originSummary": [
      "iTerm2 3.5.2 là phiên bản ổn định mới nhất, được khuyến nghị cho macOS 10.15 và mới hơn, được xây dựng vào ngày 13 tháng 6 năm 2024.",
      "Phiên bản beta mới nhất, iTerm2 3.5.1beta4, có sẵn để thử nghiệm, được xây dựng vào ngày 3 tháng 6 năm 2024, với các bản cập nhật thường xuyên nhưng đôi khi không ổn định.",
      "Những bản dựng hàng đêm được tạo ra hàng ngày nếu có thay đổi được cam kết, nhưng chúng có thể chứa lỗi nghiêm trọng; các bản dựng mới nhất và cũ hơn đều có sẵn trong kho lưu trữ."
    ],
    "commentSummary": [
      "Theo bản cập nhật iTerm 3.5.1, tính năng tích hợp tự động với OpenAI đã bị loại bỏ, giờ đây người dùng phải tự chọn tham gia, gây ra tranh luận trong cộng đồng người dùng.",
      "Những lo ngại đã được nêu ra về các rủi ro tiềm ẩn đối với an ninh dữ liệu trong môi trường doanh nghiệp, ngay cả với tính năng chọn tham gia, nhấn mạnh sự cần thiết của các biện pháp kiểm soát ở cấp độ mạng nghiêm ngặt.",
      "Phản ứng dữ dội đối với việc tích hợp AI đã dẫn đến sự chỉ trích các chuyên gia CNTT vì không kiểm tra kỹ lưỡng các bản cập nhật phần mềm và cho phép cập nhật tự động mà không có sự giám sát đầy đủ."
    ],
    "points": 125,
    "commentCount": 131,
    "retryCount": 0,
    "time": 1718281642
  }
]
