[
  {
    "id": 40662176,
    "title": "Япония принимает закон для продвижения конкуренции в магазинах приложений для смартфонов",
    "originLink": "https://english.kyodonews.net/news/2024/06/bc2d7f45d456-japan-enacts-law-to-curb-apple-googles-app-dominance.html#google_vignette",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40662176",
    "commentBody": "",
    "originSummary": [
      "Япония приняла новый закон, направленный на улучшение ухода за детьми, чтобы решить проблему снижения рождаемости в стране, который вступит в силу 5 июня 2024 года.",
      "Законодательство является частью более широких усилий по созданию более благоприятной среды для семей и поощрению более высоких показателей рождаемости.",
      "Этот шаг подчеркивает проактивный подход Японии к решению демографических проблем и обеспечению устойчивого роста населения."
    ],
    "commentSummary": [
      "Япония приняла закон для содействия конкуренции в магазинах приложений для смартфонов, запрещающий компаниям, таким как Apple и Google, блокировать продажу конкурирующих приложений и услуг.",
      "Закон может потребовать от Apple разрешить сторонние магазины приложений и прямые методы оплаты, что вызывает вопросы о соответствии условиям обслуживания Apple.",
      "Это законодательство направлено на то, чтобы бросить вызов доминированию IT-гигантов и способствовать созданию более конкурентного рынка, что может принести пользу как потребителям, так и разработчикам."
    ],
    "points": 436,
    "commentCount": 291,
    "retryCount": 0,
    "time": 1718221430
  },
  {
    "id": 40665721,
    "title": "Снимите цензуру с любого LLM с помощью аблитерации",
    "originLink": "https://huggingface.co/blog/mlabonne/abliteration",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40665721",
    "commentBody": "",
    "originSummary": [
      "Статья представляет «аблитерацию», технику для снятия цензуры с моделей Llama без повторного обучения путем удаления их механизма отказа.",
      "Аблитерация выявляет и удаляет «направление отказа» в остаточном потоке модели, позволяя ей отвечать на все запросы.",
      "Техника была применена к модели Daredevil-8B, в результате чего получилась NeuralDaredevil-8B, нецензурированная LLM с высшей производительностью в категории 8B, хотя для восстановления падений производительности требовалась дополнительная тренировка."
    ],
    "commentSummary": [
      "Текст обсуждает опыт пользователя с новой моделью ИИ, которая предоставляет предположительные ответы, а не прямые отказы, что пользователь находит освежающим и приятным.",
      "Дебаты сосредоточены на этике и мерах безопасности моделей ИИ, с аргументами за и против цензуры, а также на потенциальном злоупотреблении нецензурированными моделями для вредоносной деятельности.",
      "Текст подчеркивает трудности в обеспечении безопасности ИИ при сохранении свободы информации, акцентируя внимание на необходимости этических руководящих принципов и возможных юридических последствий контента, созданного ИИ."
    ],
    "points": 426,
    "commentCount": 221,
    "retryCount": 0,
    "time": 1718250159
  },
  {
    "id": 40664339,
    "title": "Как Meta обучает крупные языковые модели в масштабе",
    "originLink": "https://engineering.fb.com/2024/06/12/data-infrastructure/training-large-language-models-at-scale-meta/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40664339",
    "commentBody": "",
    "originSummary": [
      "Meta сосредотачивается на исследовании ИИ, чтобы решить проблему масштабных вычислений, необходимых для обучения больших языковых моделей (LLM), что требует пересмотра программного обеспечения, аппаратного обеспечения и сетевой инфраструктуры.",
      "Они адаптировали существующее оборудование, включая модификацию платформы Grand Teton с использованием графических процессоров NVIDIA H100, и оптимизировали компоновку своего дата-центра для максимизации вычислительных возможностей при сохранении воздушного охлаждения.",
      "Meta построила два кластера по 24k GPU, используя RoCE и InfiniBand, для обучения Llama 3, оптимизируя сетевую коммуникацию и балансировку нагрузки для обеспечения высокой производительности и эффективной передачи данных."
    ],
    "commentSummary": [
      "Из-за временных ограничений Meta пришлось адаптировать свои механические и тепловые конструкции для работы в воздушно-охлаждаемой среде, что привело к циклу валидации для крупномасштабного развертывания.",
      "Остаются вопросы о том, как Meta собирает и подготавливает данные для обучения, особенно касающиеся персонально идентифицируемой информации (PII), которая по умолчанию недоступна и требует специального доступа.",
      "Текст обсуждает конкуренцию между технологическими компаниями, такими как Google, Microsoft и Meta, в разработке собственных чипов, подчеркивая производительность и экономическую эффективность графических процессоров Nvidia по сравнению с тензорными процессорами Google."
    ],
    "points": 368,
    "commentCount": 184,
    "retryCount": 0,
    "time": 1718235308
  },
  {
    "id": 40667976,
    "title": "Microsoft выбрала прибыль вместо безопасности, утверждает информатор",
    "originLink": "https://www.propublica.org/article/microsoft-solarwinds-golden-saml-data-breach-russian-hackers",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40667976",
    "commentBody": "",
    "originSummary": [
      "Информатор Эндрю Харрис утверждает, что Microsoft проигнорировала предупреждения о критической уязвимости в целях избежания потери государственных контрактов, что впоследствии было использовано российскими хакерами в атаке на SolarWinds.",
      "Харрис, эксперт по кибербезопасности, обнаружил уязвимость в облачной программе Microsoft, которая могла бы позволить незаметный доступ к конфиденциальной информации, но его предупреждения были отклонены из-за возможных финансовых последствий.",
      "Несмотря на усилия Харриса и последующие нарушения, Microsoft утверждала, что ни один продукт или услуга не были скомпрометированы, что привело к критике компании за приоритет прибыли над безопасностью клиентов."
    ],
    "commentSummary": [
      "Информатор Эндрю Харрис, бывший специалист по кибербезопасности Microsoft, раскрыл, что Microsoft задержала устранение серьезного недостатка в службах федерации Active Directory (AD FS), чтобы обеспечить выгодную сделку с правительством, что привело к кибератаке SolarWinds.",
      "Расследование ProPublica подчеркивает культуру внутри Microsoft, которая ставит приоритет на рост бизнеса над немедленными проблемами безопасности, отражая более широкие проблемы технологической индустрии в балансировании прибыли и безопасности клиентов.",
      "Текст обсуждает проблемы, с которыми сталкиваются информаторы и специалисты по кибербезопасности, выступая за оперативные меры по вопросам безопасности в корпорациях, ориентированных на прибыль, подчеркивая необходимость культурного сдвига в сторону приоритета безопасности."
    ],
    "points": 343,
    "commentCount": 162,
    "retryCount": 0,
    "time": 1718275185
  },
  {
    "id": 40661703,
    "title": "ChromeOS вскоре будет разрабатываться на больших частях стека Android",
    "originLink": "https://blog.chromium.org/2024/06/building-faster-smarter-chromebook.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40661703",
    "commentBody": "",
    "originSummary": [
      "12 июня 2024 года в блоге Chromium было объявлено, что ChromeOS интегрирует значительные части стека Android для ускорения внедрения функций и инноваций Google AI.",
      "Эта интеграция будет включать компоненты, такие как ядро Linux для Android и фреймворки Android, с целью ускорения инноваций в области ИИ, упрощения инженерных процессов и улучшения совместимости устройств.",
      "«Несмотря на эти изменения, ChromeOS сохранит свою безопасность, стабильность и управляемость, с регулярными обновлениями и новыми инновациями, продолжающимися в промежутке.»"
    ],
    "commentSummary": [
      "ChromeOS вскоре будет разрабатываться с использованием значительных частей стека Android, используя архитектуру Android для уменьшения фрагментации ОС и улучшения согласованности обновлений.",
      "У Chromebook более длительные циклы поддержки по сравнению с устройствами на Android, и ChromeOS лучше справляется с фрагментацией, несмотря на то, что не подходит для смартфонов.",
      "Интеграция ChromeOS и Android может привести к более унифицированной платформе, что потенциально улучшит работу на настольных устройствах и решит текущие проблемы с производительностью."
    ],
    "points": 302,
    "commentCount": 404,
    "retryCount": 0,
    "time": 1718218966
  },
  {
    "id": 40663704,
    "title": "Джеральд Сассман: Программирование - это (должно быть) весело (2022) [видео]",
    "originLink": "https://www.youtube.com/watch?v=2MYzvQ1v8Ww",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40663704",
    "commentBody": "",
    "originSummary": [
      "Автор имеет обширный опыт в программировании, начиная с 1962 года, и работал с различными ранними компьютерами, такими как IBM 790, 650 и 1620.",
      "Текст подчеркивает творческую и абстрактную природу программирования, сравнивая его с такими видами искусства, как поэзия, архитектура и музыка, и акцентирует внимание на важности понимания и управления сложностью.",
      "Автор обсуждает важные концепции в программировании и компьютерных науках, такие как процесс eval и apply в Lisp, отладка, а также философские аспекты идентичности и мутации в структурах данных."
    ],
    "commentSummary": [
      "Джеральд Сассман подчеркивает программирование как средство хранения и понимания знаний в таких областях, как математика, физика и биология, отмечая его глубокую образовательную ценность.",
      "Текст подчеркивает важность сохранения веселья в информатике, как это пропагандировал Алан Дж. Перлис, и предостерегает от превращения в хранителей знаний о вычислениях.",
      "Обсуждение включает переход от преподавания Lisp к Python в университетах, отмечая, что хотя Python коммерчески популярен, основной целью образования должно быть развитие абстрактного мышления, а не сосредоточение исключительно на коммерчески значимых языках."
    ],
    "points": 272,
    "commentCount": 87,
    "retryCount": 0,
    "time": 1718229747
  },
  {
    "id": 40668088,
    "title": "Индийский стартап напечатал ракетный двигатель на 3D-принтере за 72 часа",
    "originLink": "https://spectrum.ieee.org/3d-printed-rocket",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40668088",
    "commentBody": "",
    "originSummary": [
      "Индийский стартап Agnikul успешно напечатал на 3D-принтере ракетный двигатель за 72 часа, демонстрируя достижения в области быстрого производства для космических технологий.",
      "Команда достигла своего первого успешного запуска в Космическом центре Сатиша Дхавана, что свидетельствует о прогрессе в направлении запусков ракет «по требованию».",
      "Эта веха подчеркивает потенциал для более гибких и экономически эффективных космических миссий в будущем."
    ],
    "commentSummary": [
      "Индийский стартап успешно напечатал ракетный двигатель на 3D-принтере за 72 часа, значительно сократив время производства.",
      "Машина, используемая для печати, автоматически генерирует отчет, детализирующий любые отклонения, что потенциально устраняет необходимость в послепроизводственных проверках, хотя некоторые эксперты оспаривают это утверждение.",
      "Развитие подчеркивает растущую технологическую сцену Индии и потенциал 3D-печати в сложном производстве, несмотря на продолжающиеся дебаты о контроле качества и необходимости послепроизводственных испытаний."
    ],
    "points": 268,
    "commentCount": 164,
    "retryCount": 0,
    "time": 1718276531
  },
  {
    "id": 40667102,
    "title": "MI300X от AMD превосходит H100 от Nvidia в выводе LLM",
    "originLink": "https://www.blog.tensorwave.com/amds-mi300x-outperforms-nvidias-h100-for-llm-inference/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40667102",
    "commentBody": "",
    "originSummary": [
      "Ускоритель AMD MI300X превосходит NVIDIA H100 SXM в реальных рабочих нагрузках ИИ, достигая на 33% более высокой пропускной способности в случае использования чата.",
      "Несмотря на зрелую программную экосистему NVIDIA, MI300X от AMD является сильным конкурентом, предлагая лучшую производительность, экономическую эффективность и доступность для крупномасштабного облачного вывода.",
      "Тесты показывают, что MI300X превосходит в задачах как оффлайн, так и онлайн-инференции, что делает его идеальным для масштабирования возможностей ИИ-инференции с более высокой пропускной способностью и более быстрым временем отклика."
    ],
    "commentSummary": [
      "MI300X от AMD превосходит H100 от Nvidia в выводах LLM (модели большого языка), согласно данным TensorWave, облачного провайдера, специализирующегося на рабочих нагрузках ИИ.",
      "Достоверность отчета ставится под сомнение, так как чип AMD имеет вдвое больше транзисторов и памяти, но производительность выше только на 33%, при этом конфигурация AMD значительно дешевле.",
      "Обсуждение подчеркивает доминирование Nvidia в рабочих нагрузках ИИ, их рыночное положение и потенциальную конкуренцию со стороны AMD, акцентируя внимание на важности навыков проектирования микроархитектуры и программного обеспечения для повышения производительности оборудования."
    ],
    "points": 264,
    "commentCount": 224,
    "retryCount": 0,
    "time": 1718265476
  },
  {
    "id": 40668504,
    "title": "Самолет Boeing 737-8 Max авиакомпании Southwest Airlines испытал голландский шаг",
    "originLink": "https://avherald.com/h?article=519ce679",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40668504",
    "commentBody": "",
    "originSummary": [
      "25 мая 2024 года самолет Boeing 737-8 MAX авиакомпании Southwest Airlines испытал голландский шаг в середине полета, что привело к значительным структурным повреждениям, хотя экипаж благополучно приземлился в Окленде, Калифорния.",
      "Федеральное управление гражданской авиации классифицировало это событие как аварию, и самолет был перевезен в Эверетт, штат Вашингтон, для дальнейшего ремонта после временного исправления в Окленде.",
      "Обсуждения среди пользователей подчеркивают технические аспекты, возможную тревогу пассажиров и предложения для Boeing добавить вторую независимую систему демпфирования рыскания для повышения безопасности."
    ],
    "commentSummary": [
      "Самолет Boeing 737-8 Max авиакомпании Southwest Airlines испытал голландский шаг, явление, связанное с колебаниями из-за связи между динамическими режимами крена и рыскания.",
      "Случаи голландского шага имеют исторические прецеденты, с заметными случаями, связанными с различными моделями самолетов, включая смертельную аварию Boeing 747SR авиакомпании Japan Airlines в 1985 году.",
      "Обсуждение подчеркивает обеспокоенность по поводу инженерных стандартов Boeing, влияния управленческих решений и безопасности коммерческой авиации, несмотря на недавние проблемы с 737 Max."
    ],
    "points": 241,
    "commentCount": 207,
    "retryCount": 0,
    "time": 1718279591
  },
  {
    "id": 40670612,
    "title": "MLow: аудиокодек с низким битрейтом от Meta",
    "originLink": "https://engineering.fb.com/2024/06/13/web/mlow-metas-low-bitrate-audio-codec/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40670612",
    "commentBody": "",
    "originSummary": [
      "Meta разработала кодек Meta Low Bitrate (MLow), чтобы улучшить качество звука для пользователей с медленным подключением и устройствами начального уровня, предлагая вдвое лучшее качество по сравнению с кодеком Opus при использовании на 10% меньше вычислительной мощности.",
      "MLow был запущен в Instagram и звонках Messenger, с последующим внедрением в WhatsApp, улучшая взаимодействие с пользователями и качество звука, особенно в условиях низкого битрейта.",
      "MLow, кодек CELP, поддерживает аудио SuperWideBand и улучшенную прямую коррекцию ошибок, улучшая качество звука даже в условиях потери пакетов, и стремится улучшить восстановление аудио в будущих обновлениях."
    ],
    "commentSummary": [
      "Meta представила новый аудиокодек с низким битрейтом, который может быть не идеален для коммуникаций в реальном времени из-за высокой частоты пакетов и накладных расходов, но может быть полезен в системах с коммутацией каналов или VoIP-системах, использующих сжатие заголовков.",
      "Кодек разработан для снижения потребления пропускной способности при сохранении или улучшении надежности и воспринимаемого качества звука, что делает его подходящим для таких платформ, как Facebook, Instagram и WhatsApp.",
      "Производительность кодека в реальных приложениях зависит от его способности справляться с битовыми ошибками и уменьшенной пропускной способностью канала, при этом коррекция ошибок с упреждением (FEC) играет решающую роль в поддержании качества связи."
    ],
    "points": 197,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1718291118
  },
  {
    "id": 40667606,
    "title": "Arm заявляет, что хочет уничтожить все ноутбуки Snapdragon X Elite",
    "originLink": "https://www.xda-developers.com/arm-says-it-wants-all-snapdragon-x-elite-laptops-destroyed/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40667606",
    "commentBody": "",
    "originSummary": [
      "Arm пытается вытеснить Qualcomm с рынка Windows, чтобы представить собственный дизайн Cortex, что привело к юридическому спору о правах на лицензирование пользовательских чипов Arm.",
      "Слухи предполагают, что Nvidia, MediaTek и AMD могут войти в экосистему Windows с чипами Arm, возможно, к CES 2025, при этом MediaTek, возможно, будет использовать ядра Cortex от Arm.",
      "Arm утверждает, что использование Qualcomm дизайнов Nuvia нарушает контрактные обязательства, стремясь остановить поставки и уничтожить чипы серии Snapdragon X, хотя такие споры обычно заканчиваются финансовыми урегулированиями."
    ],
    "commentSummary": [
      "Arm требует уничтожения всех ноутбуков Snapdragon X Elite из-за лицензионного спора с Qualcomm по поводу использования серверных ядер Nuvia в Snapdragon X Elite SoC.",
      "Основной вопрос заключается в том, аннулировало ли приобретение Nuvia компанией Qualcomm конкретную лицензию Nuvia с Arm, которая изначально предназначалась только для использования в серверах/центрах обработки данных.",
      "Результат этой юридической битвы может существенно повлиять на будущие лицензионные соглашения и более широкую технологическую отрасль, с возможными последствиями для того, как интеллектуальная собственность (ИС) передается и используется после приобретения."
    ],
    "points": 175,
    "commentCount": 143,
    "retryCount": 0,
    "time": 1718271192
  },
  {
    "id": 40669337,
    "title": "Shpool, легковесная альтернатива Tmux",
    "originLink": "https://github.com/shell-pool/shpool",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40669337",
    "commentBody": "",
    "originSummary": [
      "Google открыла исходный код Shpool, инструмента, изначально разработанного для поддержания постоянных терминальных сессий в удаленных рабочих процессах.",
      "Shpool стремится повысить эффективность удаленной работы, обеспечивая непрерывные сеансы терминала без перебоев.",
      "Этот выпуск значим, так как он предоставляет разработчикам надежное решение для управления удаленными терминальными сессиями, что потенциально может повысить продуктивность в распределенных командах."
    ],
    "commentSummary": [
      "Shpool, инструмент для сохранения сессий терминала, разработанный Google, был открыт как легковесная альтернатива Tmux.",
      "Shpool предназначен для управления постоянными сессиями без дополнительных функций, что делает его подходящим для длительных процессов и системных служб.",
      "Инструмент эмулирует консоль для просмотра состояния и повторного рендеринга при подключении, но в настоящее время не поддерживает несколько эмуляторов терминала или интенсивное использование управляющих последовательностей терминала."
    ],
    "points": 154,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1718284949
  },
  {
    "id": 40672215,
    "title": "Вы можете помочь архиву Анны, раздавая торренты",
    "originLink": "https://annas-archive.org/torrents",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40672215",
    "commentBody": "",
    "originSummary": [
      "Архив Анны, Library Genesis и Sci-Hub создали единый список торрентов для сохранения огромного объема человеческих знаний, общим объемом 521,1 ТБ, из которых 60% уже скопированы как минимум в четырех местах.",
      "Пользователям рекомендуется раздавать торренты, особенно те, у которых мало раздающих, чтобы помочь достичь 100% сохранности. Крупные участники (50 ТБ или более) могут связаться с командой для получения обновлений по устаревшим торрентам.",
      "Список разделен на три части: управляемые Архивом Анны, управляемые другими, такими как Library Genesis и Sci-Hub, и различные торренты. Некоторые торренты могут быть временно заблокированы."
    ],
    "commentSummary": [
      "Архив Анны, зеркало Library Genesis и Sci-Hub, ищет помощь в распространении более 500 ТБ книг и статей для сохранения, при этом 40% в настоящее время распространяются менее чем 4 узлами.",
      "Проект сталкивается с серьезными проблемами нарушения авторских прав, аналогичными другим онлайн-библиотекам, таким как LibGen, Sci-Hub и Z-Library, которые подвергались судебным искам и изъятию доменов.",
      "Переход от IPFS к BitTorrent для сохранения данных обусловлен простотой использования BitTorrent и меньшими требованиями к инфраструктуре, при этом сообщество обсуждает этические и правовые последствия раздачи торрентов для долгосрочного сохранения данных."
    ],
    "points": 136,
    "commentCount": 95,
    "retryCount": 0,
    "time": 1718299214
  },
  {
    "id": 40670898,
    "title": "Генеральный директор AMD Лиза Су вспоминает о проектировании печально известного процессора Cell для PS3",
    "originLink": "https://www.tomshardware.com/tech-industry/amd-ceo-lisa-su-reminisces-on-helping-design-the-ps3s-infamous-cell-processor-at-ibm",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40670898",
    "commentBody": "",
    "originSummary": [
      "Лиза Су, до того как стать генеральным директором AMD, работала в IBM и внесла вклад в разработку процессора Cell для PlayStation 3, который был основан на PowerPC от IBM и ориентирован на параллелизацию.",
      "Несмотря на то, что PlayStation 3 была одной из наименее успешных консолей Sony, к марту 2017 года было продано 87,4 миллиона единиц, и она привела к появлению визуально потрясающих игр, таких как Uncharted 3.",
      "Под руководством Лизы Су компания AMD предоставила оборудование как для PlayStation, так и для Xbox на протяжении двух поколений консолей подряд, что является значительным достижением для компании в игровой индустрии."
    ],
    "commentSummary": [
      "Генеральный директор AMD Лиза Су поделилась своими мыслями о разработке процессора Cell для PS3, отметив его передовую архитектуру и трудности в разработке игр.",
      "Процессор Cell в PS3 был мощным, но сложным для программирования, что привело к смешанным успехам и ограниченному принятию на рынке по сравнению с процессорами X86_64 и ARM.",
      "Уникальное оборудование PS3, включая процессор Cell и графический процессор Nvidia, сделало её сложной, но инновационной консолью, повлиявшей на эволюцию игровых консолей и их среды разработки."
    ],
    "points": 128,
    "commentCount": 96,
    "retryCount": 0,
    "time": 1718292690
  },
  {
    "id": 40668803,
    "title": "iTerm 3.5.1 удаляет автоматическую интеграцию с OpenAI, требует согласия на участие",
    "originLink": "https://iterm2.com/downloads.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40668803",
    "commentBody": "",
    "originSummary": [
      "iTerm2 3.5.2 — это последняя стабильная версия, рекомендованная для macOS 10.15 и новее, выпущенная 13 июня 2024 года.",
      "Последняя бета-версия, iTerm2 3.5.1beta4, доступна для тестирования, создана 3 июня 2024 года, с частыми обновлениями, но иногда нестабильная.",
      "Ночные сборки создаются ежедневно, если вносятся изменения, но они могут содержать серьезные ошибки; последние и более старые сборки доступны в архивах."
    ],
    "commentSummary": [
      "Обновление iTerm 3.5.1 удаляет автоматическую интеграцию с OpenAI, теперь требуя от пользователей согласия на участие, что вызвало споры среди пользователей.",
      "Были высказаны опасения по поводу потенциальных рисков безопасности данных в корпоративных средах, даже с функцией опционального подключения, что подчеркивает необходимость строгого контроля на уровне сети.",
      "Обратная реакция на интеграцию ИИ привела к критике ИТ-специалистов за недостаточную проверку обновлений программного обеспечения и разрешение автоматических обновлений без достаточного контроля."
    ],
    "points": 125,
    "commentCount": 131,
    "retryCount": 0,
    "time": 1718281642
  }
]
