[
  {
    "title": "Rising AI-powered phishing tactics deceive individuals, highlight innovation in cyber threats",
    "originLink": "https://securityintelligence.com/posts/operationalize-cyber-risk-quantification/",
    "originBody": "Offensive Security October 24, 2023 AI vs. human deceit: Unravelling the new age of phishing tactics 7 min read - Attackers seem to innovate nearly as fast as technology develops. Day by day, both technology and threats surge forward. Now, as we enter the AI era, machines not only mimic human behavior but also permeate nearly every facet of our…",
    "originSummary": [
      "The article focuses on the increasing use of AI in phishing attacks, where attackers use technology to imitate human behavior and trick people.",
      "It emphasizes the ongoing innovation in technology and the evolving nature of cybersecurity threats, especially in the era of AI.",
      "The article highlights the need for individuals and organizations to stay vigilant and implement robust security measures to protect themselves against these sophisticated phishing tactics."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700491112799
  },
  {
    "title": "Navigating the Path to a Career in Network Security - A Comprehensive Guide",
    "originLink": "https://www.eccouncil.org/cybersecurity-exchange/cybersecurity-technician/cct-cyber-security-lab/",
    "originBody": "How to Start Your Career in Network Security September 27, 2023",
    "originSummary": [
      "The article offers guidance on starting a career in network security as of September 27, 2023.",
      "It can be helpful for individuals who are interested in pursuing a career in this field and want some initial direction.",
      "The article may provide insights into the current trends and requirements in network security, offering valuable information for newcomers."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700491112799
  },
  {
    "title": "SmartPM Strengthens Data Security with ISO 27001 Certification",
    "originLink": "https://www.businesswire.com/news/home/20231120874488/en/SmartPM-Continues-Data-Security-Initiative-With-ISO-27001-Certification",
    "originBody": "SmartPM Continues Data Security Initiative With ISO 27001 Certification Download SmartPM's ISO 27001 certification ensures that their customers do not have to worry about the security of their data in the company's schedule-analysis platform. November 20, 2023 09:00 AM Eastern Standard Time ATLANTA--(BUSINESS WIRE)--SmartPM Technologies, Inc., a leader in construction schedule analytics, today announced its attainment of ISO/IEC 27001:2022 certification. Achieving this certification attests to SmartPM’s unwavering commitment to data privacy, confidentiality, integrity, and availability. “The combination of our ISO 27001 certification and SOC 2 Type II compliance demonstrates our leadership in adopting and maintaining the highest standards in data security and privacy.” Post this ISO 27001, developed by the International Organization for Standardization (ISO) and the International Electrotechnical Commission (IEC), is a globally recognized standard. It specifies the requirements for establishing, implementing, operating, monitoring, reviewing, and maintaining an Information Security Management System (ISMS). Rohit Sinha, CTO and leader of SmartPM’s data privacy initiatives, remarked: “In today's digital world, every piece of information is stored on some form of remote system. It is the service provider's responsibility to ensure they take appropriate measures to protect their customer's data. Our ISO 27001 certification marks another milestone in our commitment to ensure that our customers do not have to worry about the security of their data in SmartPM.” To validate conformity and certify SmartPM’s ISMS against the ISO 27001 standard, SmartPM engaged its Certification Body, Sensiba LLP (Sensiba), to perform the certification audit. The audit not only validates the company’s security posture but also demonstrates its commitment to information security for both customers and stakeholders. SmartPM’s Data Security Initiatives Building upon the recent SOC 2 Type II compliance, SmartPM’s expanded data security initiative reinforces its position at the forefront of data integrity and privacy. As part of this initiative, regular audits are planned to maintain the highest standards of data security. “Our clients trust us with their most valuable data, and it’s our responsibility to honor that trust with unparalleled security and privacy,” added Michael Pink, SmartPM CEO. “The combination of our ISO 27001 certification and SOC 2 Type II compliance demonstrates our leadership in adopting and maintaining the highest standards in data security and privacy.” For more information about SmartPM’s data security measures, please visit https://trust.smartpmtech.com/. About SmartPM Technologies, Inc. Based in Atlanta, Georgia, SmartPM stands out for providing an intuitive project management software solution. Central to its ethos is equipping teams with actionable, data-centric insights to flawlessly execute projects within stipulated timelines and budgets. SmartPM’s unwavering commitment to data integrity and security remains pivotal in solidifying its industry vanguard status. Contacts Press: Jaime Buice SmartPM Technologies Phone: 404.329.3000 Email: jbuice@smartpmtech.com",
    "originSummary": [
      "SmartPM Technologies has obtained ISO/IEC 27001:2022 certification, showcasing its dedication to data privacy and security.",
      "This certification guarantees that SmartPM's schedule-analysis platform prioritizes the security of customer data.",
      "The company also adheres to SOC 2 Type II compliance and conducts regular audits to uphold stringent data security standards, solidifying its reputation as an industry leader."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700491112799
  },
  {
    "title": "ISC attains ISO/IEC 27001 certification for enhanced information security",
    "originLink": "https://www.proactiveinvestors.com/companies/news/1033670/isc-achieves-international-information-security-certification-1033670.html",
    "originBody": "This website uses cookies We use cookies to personalise content and ads, to provide social media features and to analyse our traffic. We also share information about your use of our site with our social media, advertising and analytics partners who may combine it with other information that you’ve provided to them or that they’ve collected from your use of their services. Allow cookies Change settings Cookie Policy Overview This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping us understand which sections of the website you find most interesting and useful. See our Cookie Policy for more information. Strictly Necessary and Functional These cookies are used to deliver our website and content. Strictly necessary cookies relate to our hosting environment, and functional cookies are used to facilitate social logins, social sharing and rich-media content embeds. On Off Advertising Advertising Cookies collect information about your browsing habits such as the pages you visit and links you follow. These audience insights are used to make our website more relevant. On Off Performance Performance Cookies collect anonymous information designed to help us improve the site and respond to the needs of our audiences. We use this information to make our site faster, more relevant and improve the navigation for all users. On Off Save Settings Accept all USA Watch MyProactive News Topics Insights Companies Events Sign Up What are you searching for? Companies News See all companies matching See all news matching Industry & servicesBusiness & education services Written by: Emily Jarvie About this content About this content × About Emily Jarvie Emily began her career as a political journalist for Australian Community Media in Hobart, Tasmania. After she relocated to Toronto, Canada, she reported on business, legal, and scientific developments in the emerging psychedelics sector before joining Proactive in 2022. She brings a strong journalism background with her work featured in newspapers, magazines, and digital publications across Australia, Europe, and North America, including The Examiner, The Advocate, The Canberra Times, and... Read more About the publisher Proactive financial news and online broadcast teams provide fast, accessible, informative and actionable business and finance news content to a global investment audience. All our content is produced independently by our experienced and qualified teams of news journalists. Proactive news team spans the world’s key finance and investing hubs with bureaus and studios in London, New York, Toronto, Vancouver, Sydney and Perth. We are experts in medium and small-cap markets, we also keep our community up to date with blue-chip companies, commodities and broader investment stories. This is content that excites and engages motivated private investors. The team delivers news and unique insights across the market including but not confined to: biotech and pharma, mining and natural resources, battery metals, oil and gas, crypto and emerging digital and EV technologies. Use of technology Proactive has always been a forward looking and enthusiastic technology adopter. Our human content creators are equipped with many decades of valuable expertise and experience. The team also has access to and use technologies to assist and enhance workflows. Proactive will on occasion use automation and software tools, including generative AI. Nevertheless, all content published by Proactive is edited and authored by humans, in line with best practice in regard to content production and search engine optimisation. viewInformation Services Corporation ( TSX:ISV ) ISC achieves international information security certification Published: 08:27 20 Nov 2023 Information Services Corporation (TSX:ISV) announced Monday that the company and its subsidiaries ESC Corporate Services, Enterprise Registry Resolutions, Reamined Systems, and UpLevel have achieved ISO/IEC 27001 certification, an internationally recognized standard for managing information security. The company said that an audit by third-party firm BSI Group Canada verified that it met all the requirements of the ISO/IEC 27001 standard. Compliance with the ISO/IEC 27001 means an organization has a system in place to manage the risks related to the security of data owned or handled by the company and that this system upholds best practices and principles. ISC said that the achievement reinforces its commitment to maintaining the highest levels of information security and can give its customers increased confidence in its products and services. “As a trusted partner of choice to governments, industries and communities around the world, data and information security is at the forefront of everything we do. Achieving ISO/IEC 27001 certification gives them even more trust in our company,” ISC CEO Shawn Peters said in a statement. “Furthermore, the investment we have made in 2023 to become certified not only benefits our current customers, it is also expected to help generate new revenue and earnings before interest, taxes, depreciation and amortization (EBITDA) growth in the future.” Headquartered in Canada, ISC is a leading provider of registry and information management services for public data and records. Contact the author at emily.jarvie@proactiveinvestors.com Follow her on X, formerly known as Twitter, @emilyjjarvie View Price & Profile Add related topics to MyProactive Industry & services Business & education services Small caps Information Services Corporation Micro caps NO INVESTMENT ADVICE The Company is a publisher. You understand and agree that no content published on the Site constitutes a recommendation that any particular security, portfolio of securities,... In exchange for publishing services rendered by the Company on behalf of Information Services Corporation named herein, including the promotion by the Company of Information... FOR OUR FULL DISCLAIMER CLICK HERE Most read Tech OpenAI CEO Sam Altman out in shocking move after board loses confidence in... 2 days, 16 hours ago Tech Microsoft signs up OpenAI pair Sam Altman and Greg Brockman 6 hours, 10 minutes ago Retail & consumer Early Black Friday sales could offer clues for retailers concerned about... 2 days, 17 hours ago Energy Helium One's CEO describes Tanzania drill data as 'very encouraging' 6 hours, 50 minutes ago Sign up to receive alerts and news direct to your inbox Sign up for Newsletter More on this story Industry & services ISC CEO Shawn Peters on 3Q's positive revenue growth, strategic... 1 week, 3 days ago 04.51 Industry & services ISC’s 3rd quarter financial numbers shows a 12% increase in... 1 week, 4 days ago Industry & services ISC reports 2Q revenue increase driven by strong services and... on 08/03/2023 06.36 Industry & services Information Services Corp secures Saskatchewan extension of master... on 07/10/2023 Watch 04.51 ISC’s 3rd quarter financial numbers shows a 12% increase in Revenue year... ISC CEO Shawn Peters joined Steve Darling from Proactive to share the company's financial results for the third quarter ending on September 30, 2023. The report contains some noteworthy highlights that reflect ISC's continued growth and success. One of the key highlights from the financial... 1 week, 4 days ago 06.36 Industry & services Information Services Corp secures Saskatchewan extension of master... on 07/10/2023 04.10 Industry & services ISC first-quarter financial numbers shows an 11% increase in revenue on 05/05/2023 03.56 Industry & services ISC releases fourth-quarter and yearend 2022 financials seeing... on 03/16/2023 04.35 Industry & services ISC releases strong 3rd quarter financial numbers showing 18%... on 11/04/2022 Editor's picks Retail & consumer Early Black Friday sales could offer clues for retailers concerned... 2 days, 17 hours ago Industry & services Agilent Technologies is overexposed to China headwinds prompts... 2 days, 17 hours ago Retail & consumer Gap positioned for turnaround under new CEO's leadership 2 days, 21 hours ago Health Weight loss drugs Wegovy and Zepbound to debut in pill form 2 days, 22 hours ago Tech OpenAI's move to pause new ChatGPT signups positive for AI... 3 days ago Retail & consumer Gap shares pop as 3Q sales and profits beat expectations 3 days, 3 hours ago Tech Applied Materials stock drops as export probe overshadows upbeat... 3 days, 3 hours ago Industry & services SpaceX delays Starship rocket launch until Saturday 3 days, 17 hours ago Mining Glencore-Teck saga closes with both emerging as winners, analysts say 3 days, 17 hours ago Industry & services Elon Musk swiftly denies Starlink IPO report 3 days, 20 hours ago Add Information Services Corporation to alerts Bookmark 2 min read Prev article Mining Argentina Lithium outlines accelerated exploration plan following Stellantis investment 3 min read Next article Only registered members can use this feature. Register or Login About Meet the team Contact T&C Work for us Cookie Preferences Follow us on: Copyright © Proactive Group Holdings Inc, 2023 All Rights Reserved - Proactive North America Inc., Proactive Investors LLC. Market Indices, Commodities and Regulatory News Headlines copyright © Morningstar. Data delayed 15 minutes unless otherwise indicated. Terms of use.",
    "originSummary": [
      "Information Services Corporation (ISC) and its subsidiaries have received ISO/IEC 27001 certification, a globally recognized standard for information security management.",
      "The certification showcases ISC's dedication to maintaining strong information security practices and enhances customer trust in their products and services.",
      "This achievement is projected to drive future revenue and earnings growth for ISC, a renowned provider of registry and information management services."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700491112799
  },
  {
    "title": "Australian government invests $18.2m to boost cybersecurity for SMBs",
    "originLink": "https://www.csoonline.com/article/1248570/australian-federal-government-announces-cybersecurity-support-for-smbs.html",
    "originBody": "Government announces $18 million package as part of cybersecurity strategy to support small and medium businesses understand what they need to respond to cyber-attacks. Credit: Shutterstock / Rawpixel.com The Australian federal government announced an $18.2-million investment to help small and medium businesses to improve cybersecurity resilience and response to cyber-attacks. The support is part of the forthcoming 2023-2030 Australian Cyber Security Strategy, expected to be released this week. According to the Australian Small Business and Family Enterprise Ombudsman, there are more than 2.5 million small businesses in Australia, making it 97% of all businesses, with medium businesses making 2.5% of all businesses and large enterprises 0.2%. To allow businesses to undertake a free, tailored self-assessment of their cyber security maturity, $7.2 million will be put towards establishing a voluntary cyber health check program. This health check can be used to determine the strength of their cyber security measures, and access educational tools and materials they need to upskill, according to a joint announcement by Minister for Cyber Security Clare O'Neil and Minister for Small Business Julie Collins. Although details have not been provided, the government also said that SMBs with higher risk exposure will have access to \"a more sophisticated, third-party assessment to provide additional security across national supply chains.\" The remaining $11 million will go towards the Small Business Cyber Resilience Service that aims to provide one-on-one assistance to help small businesses navigate their cyber challenges, including walking them through the steps to recover from a cyber-attack. \"Uplifting the cyber security of our small businesses is integral to a cyber secure and resilient nation, and this dedicated support will make a huge difference in their preparedness and resilience,” O'Neil said in a statement. Concerns for SMBs' cybersecurity Last week, the Australian Signals Directorate’s Australian Cyber Security Centre (ASD’s ACSC) and the US Cybersecurity and Infrastructure Security Agency (CISA) announced a step-by-step business continuity plan for business to maintain communications and continuity of critical applications following a cyber incident. The instructions are better suited for small to medium-sized organisations (10-300 people) who require an interim ICT solution to deliver minimal services. Professionals with a basic level of computing knowledge would be able to implement the communications package but the applications package requires someone with intermediate level of knowledge of cloud services. Australia's cybersecurity strategy After the three major cybersecurity breaches that put most of the Australian population on alert around their data and personally identifiable information that was stolen and, in some cases, published on the dark web, the then-new federal government rushed to take charge of the cybersecurity issues the country has been facing for years. In February 2023, the government launched a discussion paper seeking public views that would be used to help the appointed expert advisory board to develop the country's new cybersecurity strategy. More than 200 responses were received during the consultation period that ended on 15 April. In mid-September, O’Neil revealed the first plan for the strategy which included six cyber shields with the goal to educate citizens and businesses, invest in cyber skills and collaborate with national and international partners. At the time, the National Office for Cyber Security was led by the national cybersecurity coordinator. That was the job of Air Marshal Darren Goldie from 3 July until 15 November when he was \"recalled\" to deal with a workplace matter related to his time in Defence and then was on leave. Department of Home Affairs deputy secretary of cyber and infrastructure security Hamish Hansford was appointed interim national cyber security coordinator. Related content opinion Why the DOD's Replicator should be a model for cybersecurity The Replicator program adopts the mosaic warfare concept that favors simple, low-cost options designed to overwhelm and disrupt an adversary. By Christopher Whyte Nov 20, 2023 12 mins CSO and CISO Security news analysis Ransomware gang files SEC complaint against company that refused to negotiate New US Securities and Exchange Commission rules require reporting of breaches that are material, giving cyber extortionists a new tactic to coerce payments. By Lucian Constantin Nov 17, 2023 4 mins Ransomware Compliance Cybercrime news analysis Cloud Security Alliance announces new zero-trust security credential The first authoritative certificate aims to set standards and promote best practices for hot security technology. By John Mello Jr. Nov 17, 2023 4 mins Zero Trust Certifications Careers Podcasts Videos Resources Events",
    "originSummary": [
      "The Australian federal government is investing $18.2 million to help small and medium businesses improve their cybersecurity resilience and response to cyber-attacks.",
      "The investment includes a voluntary cyber health check program and one-on-one assistance through the Small Business Cyber Resilience Service.",
      "This support is part of the upcoming Australian Cyber Security Strategy, with the goal of enhancing cybersecurity for small businesses and creating a cyber secure nation."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700491112799
  },
  {
    "title": "Defining SOC 2 Audit Scope: Striking the Balance for Assurance and Efficiency",
    "originLink": "https://securityboulevard.com/2023/11/soc-2-scope-how-its-defined/?utm_source=sbwebsite&utm_medium=marquee&utm_campaign=marquee",
    "originBody": "Security Bloggers Network Home » Security Bloggers Network » SOC 2 Scope: How it’s Defined SOC 2 Scope: How it’s Defined by Lee Govender, Compliance Success Manager, Scytale on November 20, 2023 One of the reasons SOC 2 is widely praised is due to its flexibility in terms of how organizations implement the relevant controls. However, when defining your SOC 2 scope, many organizations need help navigating what exactly to include in their audit. Why the uncertainty? Well, define the scope too narrowly, and you may not portray the needed assurance your clients look for. A too-narrow scope may also mean you could overlook security risks and leave your business vulnerable. Sponsorships Available On the other hand, if your scope is defined too broadly, you may waste essential resources on auditing processes that aren’t all that necessary – not ideal. This could mean that you’re wasting critical resources on implementing controls for threats and vulnerabilities that may not even exist in your organization. Additionally, a too-broad scope significantly lengthens the auditing process and costs more money. So, is there a ‘right’ way to define your SOC 2 scope? Let’s take a look. But first, let’s refresh and go back to some basics. The SOC 2 Bible Everything you need to know about compliance! Download the Whitepaper What is a SOC 2 Scope? Defining your SOC 2 scope is a significant step in preparing for your SOC 2 audit. It refers to determining the specific parameters of your internal controls by which you will be assessed under the SOC 2 audit. This scope aims to bring much-needed clarity on controls and systems and lay out everything that should be evaluated to ensure your data security. Your scope will also stand as the essential reference that clients and potential clients will use to satisfy their evolving requirements and set their minds at ease regarding your security posture. It’s a big deal. Benefits of a Comprehensive SOC 2 Scope What’s important to note here is that creating a comprehensive SOC 2 scope doesn’t automatically mean broadening your scope. Simply put, it means including the correct information with enough detail to answer the right questions. Easier said than done, right? No worries, we’ll get there in a second. First, let’s touch on how creating a comprehensive SOC 2 scope can benefit your business. Increased Customer Trust and Confidence This is probably the most apparent benefit, but it is still one of the main motivations behind achieving a comprehensive SOC 2 scope. It demonstrates that your business has a rock-solid foundation and a solid commitment to security and compliance. It builds trust and confidence amongst potential customers about how their data is handled and protected. Improved Vendor and Partner Relationships Security compliance doesn’t end with internal processes. Third-party risk management is crucial for getting (and staying) compliant. A comprehensive SOC 2 scope helps facilitate more transparent relationships with vendors and business partners and holds all parties accountable for their roles and responsibilities to data security. Market Expansion and Business Growth A comprehensive SOC 2 scope is a great advantage for businesses operating in global markets. It facilitates entry into new markets with strict data protection requirements and helps showcase your commitment to several key areas of security compliance. These benefits only scratch the surface regarding how a comprehensive scope and SOC 2 compliance can propel your business while helping you mitigate risk and improve incident response and management. But how do you get this ideal comprehensive scope we keep going on about? Let’s dive in! How to Define Your SOC 2 Scope Although each organization will have its own unique SOC 2 scope, each scope should include a few key elements to ensure that it provides enough information on your internal controls and security processes. This should ideally include information on an organization’s services, systems, policies, processes and people. Remember that you should only have information pertaining to the relevant SOC 2 requirements, which needs to be evaluated against the applicable trust principles – security, availability, processing integrity, confidentiality, and privacy. Step One: Choose Your Fighters (Trust Services Criteria) The first step when defining your scope is choosing the relevant trust services criteria that will be included in your SOC 2 audit. Think of it as picking the best players that apply to your specific business operations and industry. These chosen criteria will then serve as the basis for evaluation. The SOC 2 trust service criteria consist of: Security, Availability, Processing Integrity, Confidentiality and Privacy. Each principle includes specific objectives that must be met for an organization to achieve compliance with the standard. However, choosing which TSPs to include in your scope can feel tricky. To help gauge which TSPs to prioritize, look at each principle and how it aligns with your unique security objectives and priority client concerns. Remember, though, that there’s no debating here when it comes to the Security TSP. The security TSP is the only mandatory principle and must be included in your scope. Step Two: Identify the Services Included in the Scope As part of the SOC 2 audit preparation, businesses must specify which services will be included in the audit scope. This entails any service that comes into contact with sensitive data, including collecting, storing, processing and transmitting information. For example, if a business offers services such as cloud computing, managed IT services or data hosting, these must all be included in the scope and how they comply with your relevant TSPs. Step Three: Include Policies, Procedures, Systems, and Personnel Another critical component of a comprehensive SOC 2 scope includes the relevant policies, procedures, systems and people associated with collecting, processing, storing or transmitting data. Anything that could affect SOC 2 compliance should be included here. To help create some structure around the process, it’s essential to look at each of these elements a little closer. Policies Include well-documented policies and guidelines that dictate security practices. This includes crucial SOC 2 policies such as vendor management policies and data privacy policies. Procedures Include your Standing Operating Procedures (SOPs). This refers to the sequential guidance and references for specific operations related to security tasks. An example of this is your company incident response plans and remediation procedures. Systems Include all technical and physical information systems relevant to chosen trust principles. This includes all devices, software, and network components that collect or process data that are evaluated for managing information security risks. PersonnelYour people are still your first line of defense – include them. Your scope should clearly state all Personnel that are directly responsible for managing particular controls as well as the roles and responsibilities of every employee involved in the process. Step Four: What’s your Type? There are two types of SOC 2 reports: type I and type II. While both SOC 2 reports have similar aims – to identify areas of improvement and tighten the security environment of the organization, they differ in scope. Type 2 is generally preferred for organizations looking to provide a higher level of assurance and includes reporting on the design and operating effectiveness of security controls to meet one or more of the chosen TSC over a specified period. Type 1, offers a point in time evaluation and serves as a snapshot only of the design of controls. GET COMPLIANT 90% FASTER WITH AUTOMATION From Nope to Perfect Scope with Scytale Instead of spending time worrying about the dos and don’ts of compliance, replace the heavy-lifting with our automated SOC 2 compliance. Our power duo of tech excellence and human expertise helps you get (and stay) compliant. Our experts will guide you step-by-step of the compliance process and fully prepare you for your audit. Oh, and don’t forget to check out our podcast! The post SOC 2 Scope: How it’s Defined appeared first on Scytale. *** This is a Security Bloggers Network syndicated blog from BlogScytale authored by Lee Govender, Compliance Success Manager, Scytale. Read the original post at: https://scytale.ai/resources/soc-2-scope-how-its-defined/ Lee Govender, Compliance Success Manager, Scytale All, Blog, SOC 2",
    "originSummary": [
      "The article explores the process of defining the scope for a SOC 2 audit, which involves determining the specific parameters and controls that will be assessed.",
      "Finding the right balance for the scope is important to ensure that it provides sufficient assurance to clients and identifies vulnerabilities without wasting resources or prolonging the audit.",
      "A well-defined scope can enhance customer trust, strengthen vendor relationships, and support market expansion.",
      "The article suggests steps for defining the SOC 2 scope, such as selecting relevant trust services criteria, identifying included services and resources, and deciding between a type I or type II SOC 2 report."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700491112799
  },
  {
    "title": "Implementing Zero Trust Security: Protecting Businesses Against Cyber Threats",
    "originLink": "https://medium.com/technology-hits/why-business-organizations-must-implement-the-zero-trust-security-strategy-and-execute-it-9f5652799cb3",
    "originBody": "BUSINESS, TECHNOLOGY, AND ENTERPRISE SECURITY Why Business Organizations Must Implement the Zero Trust Security Strategy and Execute It Diligently An overview of the problems, market trends, and practical tips to implement security solutions in enterprise architecture and digital transformation initiatives David Pui · Follow Published in Technology Hits · 15 min read · 5 hours ago -- 1 Photo by Pixabay from Pexels This is my first article on this platform written in a white paper style to make it valuable for enterprise architects and business decision-makers, including CTOs, CIOs, CDOs, CISOs, R&D directors, and other executive-level stakeholders of prominent business and government organizations. My goal is to share my experiences gained working as a Trusted Advisor (Enterprise Architect and Senior Solutions Architect) across various industries and business verticals — mainly focusing on Digital Transformation, Data Architecture, Cloud Solutions, and Security Transformation Business Initiatives. I leveraged credible industry and academic white papers I reviewed and used during my R&D on Zero Trust Security Strategy Implementation to articulate my points. As a seasoned enterprise architect in the industry, firstly, I want to highlight that enterprise architecture is not just about technology solutions. We must also consider People, Processes, Business, Security, and Data. I will explain these critical points in this article. Cybersecurity Threats are continuing to increase, exploring any opportunities to seek vulnerability endpoints within organizations’ ICT infrastructure. Cyber Threat Actors continue to launch attacks such as faking login pages, running persistent campaigns, introducing advanced malware, and consistently executing phishing in any possible touchpoints — endpoints, cloud applications, and network infrastructure. According to the Zscaler Ransomware Report, between April 2022 and April 2023, the number of ransomware attacks has surged by 37.75%. With ransomware extortion attacks, the number of infected victims soared by 36.68%. There is also an emergence of encryption-less ransom attacks. With increasing Cloud Adoption across the globe due to a new paradigm shift of market trends in the provision of highly resilient, highly scalable, highly performance, and highly performant Cloud Platforms, Security, Networks, and Infrastructure, the business systems ecosystems have changed from the traditional On-Premises Data Centres solutions to Multi-Cloud Multi Tenanted on Premise Ecosystems. Added to the complexities of Digital Transformation, user devices such as Mobile Phones, Tablets, and Laptops across different geographical locations are becoming an increasing norm for a single user. Because of the diverse users’ devices and touchpoints, how do you properly supply safe and secure access to the organization’s mission-critical business systems and access to personal SAAS applications? Users and Customers all want the flexibility of BYOD (Bring Your Own Device) and CYOD (Choose Your Own Device), so how do you develop a secure E2E Authentication and Authorisation Security Implementation Strategy, Controls, and Policy and at the same time adhere to PIM Privileged Identity Management and PAM Privileged Access Management to secure Business Sensitive Information as well as Private and Confidential information. This gives rise to the need for organizations to define, develop, and implement Zero Trust Architecture Strategy and re-think a roadmap to achieving the Digital Security Transformation. It is an Enterprise Architecture initiative where Enterprise Architects and Business Architects need to work closely with C Level Executives, Board of Directors, Business Sponsors, Business Leads, and Key Business and Technology Stakeholders to get all stakeholders to understand the issues and complexities of the problem and the difficulties in executing the digital security transformation. However, it is still a Business Decision whether the organization can embark on the Zero Trust Strategy Implementation journey, as many business program initiatives need funding, and the Zero Trust Strategy initiative needs to be on the priority list. Hence, it needs to be driven by the C-Level Executives and Buy-In from the Board of Directors to ensure full organizational support, commitment, and alignment with strategic & operational drivers. The total costs of shifting to a Zero Trust paradigm are incredibly high, and the approach to tackling the problems needs to be discussed and focus on Enterprise Security Planning. The Approach to the realization of Zero Trust Network Architecture ZTNA is critical to the success of the modernization goals. According to R&D companies such as Grand View Research, the global market size of Zero Trust Security is estimated to be USD 24.84 Billion, and the expected Compound Annual Growth Rate (CAGR) is 16.6% from 2023 to 2030. This also stems from the COVID-19 pandemic, where remote working is becoming a norm, and organizations are seeing this as a significant advantage for organizations to reduce procurement infrastructure costs by moving towards BYOD or CYOD strategy and hence driving the growth of zero trust security. The rise of BYOD and CYOD allows employees to access business-critical information and Cloud SAAS applications, thereby increasing the chances of data theft and loss. This new user landscape increases the number of potential threat actors continuously watching and finding ways to penetrate corporate networks. Hence, implementing BYOD and CYOD security strategies, solutions, standards, and policies is particularly important. Importance of Data and Information Classifications The Traditional Approach to Enterprise Security is all about setting up Perimeter Security and safeguarding data and information from Cyber Attacks and inadvertent network infrastructure penetrations. Most organizations are too busy to keep the lights on and continue to work on Digital Transformation Business Strategies to enhance their business through increasing ROI Return on Investment, improving CX Customer Experiences, improving business operations through business automation, and improving EX Employee Experiences to improve productivity as well as keeping them happy. Data and information from all data sources, different systems, from B2B, Government Agencies, Consumers, Customers, IOT Streaming, social media, and Regulatory Compliance Bodies. Some are Commercial Business Sensitive Information, some are consumer private and confidential information, and some are shareable between business partners only, whilst some are shareable between customers only, and others are publicly available information. Data and Information are available in all shapes and forms — Structured Data, Semi Structured Data, and Unstructured Data and come with different Variety, Velocity, and Volume. Many organizations are struggling to know where they are clearly and often must spend time discovering which assets and what type of data to be compliance with regulatory compliance bodies such as ASD ACSC ISM, NIST, ISO27001, GDPR, CDR, Open Banking PSD2, PII, HIPAA, HL7, PCI/DSS, FATCA/CRS, AML/CTF, KYC, etc. Data and Information are from business systems and in Emails, MS Access, Share Points, Content Management Systems, Files, Archives, and many more. Do all organizations have a clear snapshot of all their assets and mapping to all their data and information? I would say NO. Many Data and Information Classification tools use AI and ML to help classify the massive Data and information Landscape and, therefore, implement better and more granular data security controls depending on their classifications and adhere to the Data Security Regulatory Compliance mandates. Implementing Zero Trust Security Strategy and Transformation This image was created by the author. Developing an organization’s Zero Trust Security Strategy and Transformation is not as easy as one would think. You need to carefully analyze, learn, and devise a strategy to replace your current security technology solutions stacks or overlay the legacy security solutions — would this create a monster and introduce more complexities, or do you start from nothing? What’s the ROI? Why do we need to do this? Implementing Zero Trust Security Strategy still requires all the existing implementations of security controls such as Enterprise IAM, SSO, MFA, Phishing Prevention and Awareness, Intrusion Detection Prevention IDP, IPS Intrusion Prevention Systems, Data Security, DLP Data Loss Prevention, SOC 1 & 2 and other compliance mandates. Below is an informative diagram from Gartner showing a High-Level Zero Trust Security System — A Simplistic Viewpoint for Architects and Business Decision Makers. Image Courtesy of Gartner from Public Domain An Overview of the Current State · Heavily focused on perimeter security controls · Organisations’ Culture of “Implicit Allow” · Lack of Enterprise Corporate Policies which enforce Least Privileged Access · Coarse-grained security access · Network segmentation is at a high level broadly segmented between network tiers. · Applications are allowed to be rolled out in Production with limited security controls. · Authentication is still based on weak single-factor authentication. In many cases, applications are still being developed using basic username and password authentication. · Traditional network connectivity is still being used. · “Implicit Allow” access across different business systems workloads (East-West Traffic) · Some application securities are still not using Enterprise Users Directories such as Azure AD or Microsoft AD despite best practices that are widely available. · Islands of disparate security directories, LDAP directories as legacy systems are still not being decommissioned. An Overview of the Target State · Finer grain access and authorization to resources after Authentication · Continually performing trust assessments to minimize risks. · Micro-segmentation of access boundaries between users, applications, and workloads · Full encryption of network connections to protect data on transit. · Explicit allow access to applications and workloads for fully authenticated and authorized users. · Full logging and monitoring of user activities across all devices and locations · Strict adherence to the latest Top 10 OWASPs Security Vulnerabilities and ensure proper DevSecOps principles and standards are being applied. · Use of Confidential Computing environment for highly commercially sensitive information in particular accounting and finance · Start implementing decentralization of databases and distributed data ecosystems security solutions as new Digital Ecosystems such as Microservices Containerisation Style Architecture and Distributed Digital Block Chain Ledgers have been developed across new DEFI Decentralised Finance and NFTs Digital Platforms · Start collaboration with Multi-Cloud Multi Tenanted Hybrid on Premise Ecosystems Data Exchange Fabric Providers such as Equinox to take advantage of their E2E security controls capabilities in the Next Generation landscape. Strategic Core Technologies for Zero Trust Strategy Enablement Data Classifications and Information Security Protection Technologies Limiting the scope of data security protection will help organizations speed up and enhance their protection from malicious attacks, stealing sensitive information, and exposing customer privacy information. By applying data and information classifications, organizations can first focus on these Data/Information Classes and ensure that these classes are well-protected, continuously watched, and risks are constantly being assessed, providing business confidence to both the organizations and the customers. Varonis, Enterprise Data Security Platform solutions, set one of the popular data security platform products in the marketplace. According to Forrester, Varonis was named the Leader in Data Security Platforms in Q1, 2023. Here are key features provided by the Varonis Data Security Platform: · DSPM — Data Security Posture Management · Data Discovery & Classification · Data Activity & Auditing · Data-Centric UEBA · SSPM — SAAS Security Posture Management Software · Automated Data Remediation · Data Access Governance · Compliance Management · DLP Data Loss Protection · Active Directory Security · Insider Risks Management Amazon Web Services AWS supplies a data classification service called AWS Macie. This service provides discovery, data cataloging, assessments of data types, labeling, handling classification tiers, and continuous monitoring of the labeled datasets. ZTNA Zero Trust Network Architecture Cloud-based solutions such as Zscaler provide Zero Trust Network Access (ZTNA), where users of any organization’s business applications can be accessed from anywhere in the world, with apps moving from inside the data center to outside the network perimeter. Network and security teams must now shift their focus to the fact that it is not about protecting their networks but about protecting users, devices, and business resources. ZTNA solutions such as Zscaler ZTNA provide controlled access to organizations’ resources by reducing the surface area for attack. The isolation afforded by ZTNA improves connectivity, removing the need to directly expose applications to the internet, which is an untrusted transport. Instead, application access occurs via an intermediary, a cloud service controlled by a third-party provider, or a self-hosted service. Here is a summary of the standard features of ZTNA solutions 1 — Verify Identity Instead of trusting an IP address, establish the identity of the user and device using an identity provider (IDP) first 2 — Set Contextual Policies Access policies are defined based on user, device posture, location, and app, and they all rely on a cloud service to enforce them. 3 — Improve Visibility and Adapt Logs are used to determine which users are accessing which apps and auto-adapt based on any changes in context. 3 — SASE Secure Access Service Edge Security Access Service Edge solutions provide secure access to the web, mobile, cloud services, and private applications always, anywhere the users are and no matter what devices are used and irrespective of where the applications are hosted — On-Premises, Private Cloud, and Public Cloud. SSE Security Service Edge can be implemented as part of the SASE framework and usually includes integrated or separate ZTNA Zero Trust Network Architecture capability. This means that hybrid workers can connect at any location branch, and the extended workforce can connect via allowable devices connecting from any location. SSE and SASE services provide advanced analytics and risk-trust scoring capabilities that enable the implementation of an identity and context-based logical access boundary around private applications and SAAS services. Remote browser isolation capabilities can also be enabled via this SASE framework. CASB Cloud Access Security Broker Using Netskope CASB, a core part of Netskope Security Service Edge (SSE), can give organizations and businesses more confidence in adopting cloud applications and services without compromising security. Ability to manage unintentional or unapproved movement of sensitive data between cloud app instances and in the context of app and user risks. CASB prevents sensitive data from being exfiltrated from your environment by risky insiders or external cyber criminals who have breached your perimeter security boundaries. For example, it can stop malicious insiders from copying sensitive content from business email to personal email accounts. In short, CASB provides the visibility and control needed to mitigate the risks in using Public and Private Cloud Applications and Services. CASB also supplies capabilities to automatically audit your application traffic and discover the overall risk profile across tens of thousands of applications used within your Production environment. Risk scores are based on 50 Cloud Security Alliance (CSA) defined attributes and cover seven profiles, including security, risks, privacy, and compliance, and have a +99% accuracy rate for accessing risks in applications. Next Generation Zero Trust IAM With the increase in Digital Transformation business initiatives globally, organizations have shifted their paradigm from the traditional closed-loop network perimeter to the modern, open-loop perimeter where apps, mobile, and tablets can be accessed anywhere globally. In addition, organizations also need to establish trust relationships to securely enable access for various people such as contractors, employees, partners, supply chain providers, etc). This new modern perimeter needs to be protected, starting with Security Identity. Solutions such as OKTA IAM is an example of an IAM technology solutions provider that provides comprehensive solutions set for organizations to enable Zero Trust Secure Identity. More importantly, the world has just emerged from the COVID-19 pandemic; organizations are forced to shift to the hybrid working model and distributed workforce globally. The resources working from anywhere are now increasing, and they are all accessing resources and data (in the Cloud and On-Premises) from more devices and locations than ever before. IAM security features such as SSO Single Sign-On and MFA Multi-Factor Authentication are becoming more of a “Have” for most organizations and with the new modern workforce frontier, according to Gartner in 2017, mentioned in a paper published on CARTA Continuous Adaptive Risks and Trust Assessment, that the new modern frontier requires more than just authentication and authorization but it necessitates continuous monitoring and assessments of the customer experience through adaptive risk-based assessments to identify potential threats. Micro-segmentation Logical or identity-based segmentation, now known as micro-segmentation, provides a more granular, fine-grain access and dynamic policies for controlling East-West traffic within a particular macro segmentation segment. Micro-segmentation can have software packages, hardware, or infrastructure overlays such as Hypervisor and IAAS, where the workloads are segmented from other systems/assets. Typically, dynamic security policies are enforced at Layer 7 of the OSI model, which follows the “Explicit Allow” Zero Trust model and thereby helps reduce the risk of lateral movement of information. Advanced Analytics, Identification, Detection and Response Technologies — SIEM, IDR, EDR, NDR, XDR and SOAR With an increasing number of users and customer touchpoints and the ever-changing users and customer behaviors, security monitoring and analytics are evolving as more and more data and information to be captured through API integration, Event-Based Streaming, IOT Streaming, Data Replication, Publish and Subscribed Messaging, Hub and Spoke Integration and Point to Point Integration. SIEM Security information and event management technologies are maturing, and more options are available in the marketplace for EDR Endpoint Detection and Response, NDR Network detection and response and XDR extended detection and response. These advanced security intelligence analytics platforms provide comprehensive user behavior analytics, alert correlation, and incident responses, and most of the higher-end security intelligence platforms now include SOAR Security Orchestration, Automation, and Response tools. Endpoints Applications Integrations touch points and infrastructure posture can now be readily and easily assessed, and IOT telemetry data can be streamed into context-based access controls for further context-based sentiment analytics, which ultimately forms the E2E foundation of Zero Trust Architecture. Common Organisations Problems and Challenges for Digital Security Transformation — especially Zero Trust Security Strategy Implementation — An Overview of Technical Debt Legacy security solutions architecture and its implementation, such as traditional network segmentation and Layer 4 Firewall Filtering and the traditional On-Premises security principles of classifying users as “Trusted” and “Untrusted* are proven to be insecure. The assumption that everything operating in the internal organization environment is considered safe and secure is no longer viable and valid. This is because of increased attack sophistication and increased insider threats. In today’s new Digital Era, we must go into the “Zero Trust World” where the key principle of “Never Trust, Always Verify” must apply to every user, device, location, context, and situation. Zero Trust Network Security Approach differs from the traditional On-Premises Security Controls Implementation. A more granular Micro-segmentation of networks, compute, and resources with finer grain perimeter security controls implementation of Authentication and authorization are necessary. With the implementation of Zero Trust Security, we need to think of the Inside Out Security Strategy instead of the Outside-In Security Strategy. Lack of Single Source of Truths from Use Identities Perspectives So many IDAM solutions are being deployed, some On-Premises and new ones in the Multi-Cloud Ecosystems. Lack of federation between security directories. This opens more potential security vulnerabilities, endpoints, and touchpoints. With employees constantly changing roles, security policies and enforcement need to be properly updated and often violate the fundamental principles of least privileged access and least privileged Identity management. Organizations Resistance to Change The exercise where External Security Providers are brought in to determine excessive security privileges for VIP end users, Senior IT Specialists, and Power Users and mitigating and changing access and authorization controls often proven to introduce lots of friction, especially from those who are used to have ownership of highly privileged accounts and suddenly getting their privileges being removed and they ended up feeling the loss of control. This enormously impacts Change Management Workflows and Access Policies; therefore, careful planning and approach must be employed. Lack of Skilled, Talented Resources Most organizations will not have sufficient staff with the knowledge, skills, and capabilities to shift to the new Zero Trust Security Posture Paradigm. Even if there exists one or two who may be capable, internal resistance will prevent these internal staff from being usefully deployed. Primarily, if Insider Threats exist, an External Security Provider or contractor engagement will be more favorable and more accessible to start. Takeaways A well-defined scope for Zero Trust Strategy Implementation is necessary to be successful in the Enterprise Security Transformation Program. Full Buy-In from CISO, C Level Executives, and the Board of Directors will be needed so that full support and commitment will be given to the Program. Top-down communications at all levels “Must Be” made by all Senior Managers from both Business and Technology to get everyone on board with the “Business and Enterprise Architecture Vision.” Develop strategies to overcome organizational “Roadblocks” through People and Culture, instilling new mindsets, getting people to embrace change, and providing education & training. Identify business use cases based on clear “Threat Modelling” techniques and conduct workshops to brainstorm potential security vulnerabilities and threat models that pose greater risks from financial loss, reputation loss, data breaches, damages to assets, etc. Identify legacy security solutions that can be decommissioned for obsolescence and replace them with the new Zero Trust Strategy Security Controls. Build an HCM Human Capital Management Strategy on acquiring new Digital Talents and uplifting the existing employees’ capabilities through training, seminars, and hands-on experiences. Identify trusted co-sourcing business partners and advisory into the journey to realize the complex business initiatives. Conclusions Considering the global impact and cost of cybersecurity crimes, business and government organizations need to start thinking about developing a Zero Trust Security Strategy as soon as possible with the increasing global risks of the growing number of “Bad Actors” both externally and “Insider Threats.” You may seek an External Security Provider or Trusted-Advisor such as an Enterprise Enterprise Security Architect or Enterprise Security Advisor, to conduct thorough Current State Assessments and work with C-Level Executives and critical business and technology stakeholders to produce a comprehensive Zero Trust Enablement Strategy Paper first. Thereafter, you can work collaboratively on the priorities, the budget, the resources, and the scope of the security transformation initiatives. References Mentioned in This Article How Organizations Can Adapt to Digital Transformation — IEEE Coherent Market Insights — Zero Trust Global Market Trends AWS Macie — Data Classification Gartner Zero Trust Strategy and Roadmap Gartner, 2017, CARTA Framework Zscaler, Zero Trust Strategy, and Solutions Okta, Zero Trust Framework in the Modern Perimeter Frontier Data Security Platform — Varonis Thank you for reading my first article. I look forward to your feedback. I will be sharing your experience in upcoming articles. You may connect with me on LinkedIn, where I write articles on Enterprise Architecture.",
    "originSummary": [
      "Implementing a Zero Trust Security Strategy is vital for businesses to protect against cybersecurity threats.",
      "The COVID-19 pandemic has increased the importance of IAM solutions for secure identity management.",
      "Traditional security solutions are no longer effective, and organizations need to shift towards a Zero Trust Security Strategy."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700491112799
  },
  {
    "title": "Guarding Against the Dangers of AI in Cybersecurity",
    "originLink": "https://www.technologyrecord.com/article/how-to-guard-against-the-dangers-of-ai-according-to-theo-zafirakos",
    "originBody": "InterviewSecurity How to guard against the dangers of AI, according to Theo Zafirakos Fortra’s Terranova Security’s chief information security officer explains the dangers associated with the advancement of AI and how businesses can better prepare against attacks Alice Chambers20 November 2023 The rise of artificial intelligence is being accompanied by a rise in consciousness of the risks to cybersecurity. “Hackers are utilising AI to develop more advanced attacks and evade detection from security tools,” says Theo Zafirakos, chief information security officer at Fortra’s Terranova Security. “Businesses need to be aware of the various ways that hackers may manipulate them, from malware designed to bypass detection to more sophisticated and targeted phishing attacks.” For instance, scammers are now exploiting AI technology to impersonate people by creating voices that convincingly portray victims’ coworkers. This phishing technique can deceive employees into providing sensitive information. AI can also be used to gather sensitive data. “Every industry is grappling with an enormous amount of data,” says Zafirakos. “Attackers are employing AI to analyse and collect data more quickly. Healthcare providers, manufacturers and financial services organisations handle large amounts of data to drive innovation and inform decision-making. Bad actors will target that sensitive data to either disrupt operations or gather further information.” There are steps that organisations can take to protect themselves. One of the most important is cybersecurity awareness training, which can enhance an enterprise’s ability to identify and mitigate AI-related security threats. “As with any other cybersecurity concern, knowledge and proper employee education are the best defence,” says Zafirakos. And AI can be put to good use here. “Chatbots can be employed to educate users on how to protect their devices and personal information. Similarly, machine learning on employee awareness levels can be utilised by team leaders to identify gaps in employee knowledge of security awareness.” Furthermore, employees can learn to detect AI-enabled or AI-generated attacks and avoid falling victim. They can also learn about the acceptable use of AI tools for business operations in the process, such as enhancing productivity. For example, they can learn to fact-check emails through phishing awareness training and avoid opening unsolicited software that could be AI-generated malware. “Detection and prevention technologies, such as intrusion protection systems and intrusion detection systems, and user-behaviour analysis can monitor and alert users to any suspicious activity on their networks or devices in real time,” explains Zafirakos. “AI can also be used to automate threat responses to swiftly mitigate damage and prevent its spread to other infrastructure components. This will significantly reduce the costs associated with data protection, awareness training and data-breach responses.” As AI continues to evolve, organisations must take proactive measures to stay ahead of emerging threats and vulnerabilities. “Understanding how AI can disrupt or improve an organisation is essential for successful operations,” says Zafirakos. “I urge business leaders to establish an internal acceptable use policy for AI tools so that employees can enhance their workloads, and to incorporate content related to AI risks and threats within their security awareness programmes so that everyone is equipped to protect against AI-related attacks.” This article was originally published in the Autumn 2023 issue of Technology Record. To get future issues delivered directly to your inbox, sign up for a free subscription",
    "originSummary": [
      "Hackers are utilizing AI to create sophisticated cyber attacks, including targeted phishing and impersonation techniques.",
      "Chief Information Security Officer Theo Zafirakos emphasizes the importance of cybersecurity awareness training and the use of AI tools like chatbots to educate employees and identify AI-enabled attacks.",
      "Implementing detection and prevention technologies, as well as AI-driven threat responses, can help minimize the impact and expenses associated with data protection. Zafirakos urges organizations to establish acceptable use policies for AI tools and incorporate AI-related risks into their security awareness programs."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700491112799
  },
  {
    "title": "NTRA Achieves ISO 27001 Certification for Information Security",
    "originLink": "https://www.telecompaper.com/news/ntra-obtains-iso-27001-of-information-security-systems--1482941",
    "originBody": "TelecompaperFollow Telecompaper onTwitterLinkedInFree Headlines TelecompaperWe have been keeping professionals in the telecoms industry up-to-date since 2000. Telecompaper is a well respected, independent research and publishing company focussed on the telecommunications industry. tp:news tp:research tp:eventsThis Site My account Alerts Subscriptions FAQ / Help Advertise Press Jobs Industry events Contact Information Standerdmolen 20-III3995 AA HoutenThe Netherlands Phone: +31 30 6349600 Legal Information© 2000 - 2023 Telecom.paper BV. All rights reserved. Telecompaper is a trademark of Telecom.paper BV. No part of this site can be reproduced without the expressed permission of Telecom.paper BV. Our General Terms and Conditions can be found here.Privacy Policy GDPR Information Cookie Statement Terms and Conditions !function(){var t,e=document,n=e.createElement(\"script\");!(\"noModule\"in n)&&\"onbeforeload\"in n&&(t=!1,e.addEventListener(\"beforeload\",function(e){if(e.target===n)t=!0;else if(!e.target.hasAttribute(\"nomodule\")||!t)return;e.preventDefault()},!0),n.type=\"module\",n.src=\".\",e.head.appendChild(n),n.remove())}()",
    "originSummary": [
      "Telecompaper is an independent research and publishing company specializing in the telecommunications industry.",
      "The company has been delivering updates to telecom professionals for over two decades, starting in 2000.",
      "Telecompaper provides a range of services, including news, research, and event coverage."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700491112799
  }
]
