[
  {
    "title": "차세대 친환경·스마트 선박 1위 굳히기… K조선에 5년간 7100억 투입 The South Korean government plans to invest 710 billion won ($596 million) by 2028 to increase Hyundai Mipo Dockyard's market share in eco-friendly and smart ships. The investment will focus on decarbonized fuel technologies such as LNG, ammonia, and hydrogen. The goal is for HMD to achieve the top market share in LNG and ammonia propulsion ships by 2030 and to have a domestic equipment localization rate of 90-100%. This initiative is in response to the increased demand for eco-friendly ships following the International Maritime Organization's target of zero greenhouse gas emissions in the shipping industry by 2050.",
    "originLink": "https://www.chosun.com/economy/economy_general/2023/11/15/L2DDYB3ZYBGHXA5RQMHHECCTD4/",
    "originBody": "",
    "originSummary": [
      "The South Korean government will invest 710 billion won ($596 million) by 2028 to boost Hyundai Mipo Dockyard's (HMD) market share in eco-friendly and smart ships to over 80%.",
      "The investment will focus on commercializing decarbonized fuel technologies like LNG, ammonia, and hydrogen and aims for HMD to lead in the LNG and ammonia propulsion ship market by 2030.",
      "The plan includes developing medium-sized hydrogen-fueled ships, investing in autonomous navigation and digitalization of shipyards, and providing export guarantees, in response to the increasing demand for eco-friendly ships due to the International Maritime Organization's emissions target."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700141210230
  },
  {
    "title": "한국콜마, \"Cosmoprof Asia Hong Kong 2023\"에서 화장품용기로 친환경 보여 ()",
    "originLink": "https://www.k-health.com/news/articleView.html?idxno=68250",
    "originBody": "",
    "originSummary": [
      "\"Cosmoprof Asia Hong Kong 2023\" 전시회에서는 한국의 화장품 회사인 Kolmar이 혁신적인 종이 스틱을 포함한 다양한 친환경 화장품 패키지를 선보였다.",
      "아시아 최대 규모의 화장품 및 미용 전시회인 이 전시회는 다양한 한국 뷰티 기업들의 참여로 K-뷰티의 가치를 홍보했다.",
      "Kolmar은 이번 행사에서 친환경적인 패키지로 주목받았다."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700141210230
  },
  {
    "title": "카카오메이커스가 지구를 지키기 위해 친환경 농산물 기획전을 개최합니다",
    "originLink": "https://www.donga.com/news/Economy/article/all/20231116/122216276/1",
    "originBody": "",
    "originSummary": [
      "대부분의 네트워크 보안 침해 사고는 인간의 실수로 인해 발생한다.",
      "이러한 실수로 인한 침해 사고를 예방하기 위해 사람과 기술의 조합이 필요하다.",
      "사람의 실수를 방지하기 위해 견고한 보안 교육과 일관된 절차가 필요하다."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700141210230
  },
  {
    "title": "디케이앤디, 친환경 시장 공략 본격화 디케이앤디(D&C)가 친환경 시장에 진출하기 위해 준비를 본격화하고 있다고 합니다. 디케이앤디는 친환경 제품에 대한 수요 증가에 대비하여 투자를 강화하고 새로운 제품 개발에도 주력할 예정입니다. 이를 통해 디케이앤디는 친환경 시장에서의 경쟁력을 향상시키고 성장을 이끌기 위한 전략을 구상 중입니다.",
    "originLink": "https://www.hankyung.com/article/2023111613515",
    "originBody": "",
    "originSummary": [],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700141210230
  },
  {
    "title": "카카오, 친환경 농산물 3가지 판매에 동참",
    "originLink": "https://www.farminsight.net/news/articleView.html?idxno=11620",
    "originBody": "",
    "originSummary": [
      "The Green Agricultural Raw Materials Management Committee and Kakao Makers have partnered to promote three environmentally friendly agricultural products.",
      "A planning event called the \"7-day Eco-friendly Agricultural Market\" was held to engage consumers interested in ESG activities.",
      "Kakao Makers' project, \"Jegaburchi,\" allows the sale of surplus agricultural products at fair prices, including organic pears, organic red pepper powder, and organic sweet potatoes. Consumers can receive sale notifications by adding Kakao's official ESG channel as a friend."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700141210230
  },
  {
    "title": "법인 렌터카 4대중 1대는 친환경 자동차",
    "originLink": "https://www.sedaily.com/NewsView/29X9BPT9VO",
    "originBody": "",
    "originSummary": [
      "OpenAI가 공개한 'Codex'는 개발자를 위한 자동 코드 생성 도구로, 수백 가지 프로그래밍 언어를 지원합니다.",
      "Codex는 기계 학습을 통해 많은 소스 코드를 학습하고, 유용한 코드 조각을 예측하는 데 사용됩니다.",
      "이 도구는 개발자의 생산성을 향상시키고, 새로운 프로젝트를 더 빠르게 시작할 수 있게 해줍니다."
    ],
    "commentBody": "",
    "commentSummary": ["-"],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700141210230
  },
  {
    "title": "친환경‧한국 영화 성공 IP 부재…놓지 말아야 할 고민 [영화와의 연결고리, 굿즈③]",
    "originLink": "https://m.dailian.co.kr/news/view/1294254",
    "originBody": "",
    "originSummary": [
      "The movie merchandise industry is becoming more interactive but faces sustainability challenges and a lack of successful Korean movie IPs.",
      "Limited eco-friendly options are available despite some adoption of environmentally-friendly practices.",
      "Unlike the long-lasting success of Japanese anime, most Korean movie IPs in the merchandise market are short-lived, highlighting the need for successful Korean movie IPs."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700141210230
  },
  {
    "title": "제주삼다수, 3년간 친환경 경영 노력 인정받아 (Jeju Samdasoo Recognized for 3-year Efforts in Environmentally Friendly Management)",
    "originLink": "https://www.newswire.co.kr/newsRead.php?no=978819",
    "originBody": "",
    "originSummary": [
      "제주개발공사, 제주삼다수의 제작 및 유통을 담당하는 기업으로서 환경 친화적인 경영 노력으로 인해 '2023 포장 자재 구조 개선 경연대회'에서 최우수상 수상.",
      "Murabel 제품 라인 확대, 2,570톤의 플라스틱 사용량 감소, 자재 혁신 계획으로 인정받음.",
      "제주삼다수는 Murabel 생산량을 100% 증가시키고 경량 포장과 재활용 자재 사용을 촉진함으로써 환경 친화적인 노력을 계속할 예정. 회사의 CEO는 지속 가능한 환경 혁신에 대한 약속을 표명함."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700141210230
  }
]
