[
  {
    "id": 40329388,
    "title": "Immersive Linear Algebra: Interactive Figures & Essential Topics.",
    "originLink": "http://immersivemath.com/ila/index.html",
    "originBody": "Home About Contact immersivemath This will be replaced with browser width stuff! immersive linear algebra by J. Ström, K. Åström, and T. Akenine-Möller v1.1. ISBN: 978-91-637-9354-7 The world's first linear algebra book with fully interactive figures. Learn More Check us out on Twitter and Facebook Table of Contents Preface A few words about this book. Chapter 1: Introduction How to navigate, notation, and a recap of some math that we think you already know. Chapter 2: Vectors The concept of a vector is introduced, and we learn how to add and subtract vectors, and more. Chapter 3: The Dot Product A powerful tool that takes two vectors and produces a scalar. Chapter 4: The Vector Product In three-dimensional spaces you can produce a vector from two other vectors using this tool. Chapter 5: Gaussian Elimination A way to solve systems of linear equations. Chapter 6: The Matrix Enter the matrix. Chapter 7: Determinants A fundamental property of square matrices. Chapter 8: Rank Discover the behaviour of matrices. Chapter 9: Linear Mappings Learn to harness the power of linearity... Chapter 10: Eigenvalues and Eigenvectors This chapter has a value in itself. © immersivemath 2015-2020",
    "commentLink": "https://news.ycombinator.com/item?id=40329388",
    "commentBody": "Immersive Linear Algebra (2015) (immersivemath.com)649 points by oumua_don17 16 hours agohidepastfavorite54 comments WillAdams 13 hours agoVery cool! Does anyone have a list of other similar texts? There's: - Geometry: Joyce's Java version of Euclid's _Elements_: https://mathcs.clarku.edu/~djoyce/java/elements/elements.htm... - Physics: https://www.motionmountain.net/ - Chemistry: The Elements by Theodore Gray https://apps.apple.com/us/app/the-elements-by-theodore-gray/... A nifty thing my kids enjoyed was the website version of the book, _Bembo's Zoo_ (which sadly is no longer on-line: https://soundeffects.fandom.com/wiki/Bembo%27s_Zoo_(Websites... ) reply vitalnodo 12 hours agoparenthttps://schoolyourself.org/ with different ideas about https://www.youtube.com/watch?v=4cQIbZa7P80 Computer-Assisted Instruction http://dmentrard.free.fr/GEOGEBRA/Maths/export4.25/golf.html some people manage to create some applets in geogebra https://xenaproject.wordpress.com/2022/07/29/teaching-formal... a way to teach theorem proving maybe I'll remember something else and add it here reply vitalnodo 9 hours agorootparenthttps://explorabl.es/ https://github.com/blob42/awesome-explorables reply __rito__ 3 hours agoparentprevYou might like these- - Matrix Arcade (https://yizhe-ang.github.io/matrix-explorable//) - Computational Discovery on Jupyter (https://computational-discovery-on-jupyter.github.io/Computa...) - Nature Inspired Programming Recipes (https://github.com/clever-algorithms/CleverAlgorithms) - A Little Calculus (https://papl.cs.brown.edu/2018/func-as-data.html#%28part._.A...) - The Matrix in Computer Science (https://cs.brown.edu/courses/cs053/current/lectures.htm) - Discrete Mathematics and Functional Programming (https://cs.wheaton.edu/~tvandrun/dmfp/) - A Programmer's Introduction to Mathematics (https://pimbook.org/) - Complexity Explorer (https://www.complexityexplorer.org/) - Learn Physics with Functional Programming (https://nostarch.com/learn-physics-functional-programming) - Seeing Theory (https://seeing-theory.brown.edu/) - Coding The Matrix (https://codingthematrix.com/) reply nutanc 6 hours agoparentprevThis was the core premise on which Innings2 books was made. In this day and age textbooks can be made interactive. So, the CBSE math syllabus (main syllabus in India) was made interactive for 6th to 10 grades. https://books.innings2.com/demo reply akdas 8 hours agoparentprevI started on two resources on different topics. One day, I want you invest a good amount of time into building them out. https://cstheory.avikdas.com/ https://nesdev.avikdas.com/ reply doubloon 5 hours agoparentprevits not animated but its really nicely illustrated in html friendly layout https://www.c82.net/euclid/book1/ and this is animated, and interactive, for polyhedra https://polyhedra.tessera.li/dodecahedron/operations reply jovial_cavalier 7 hours agoparentprevOne on complex analysis - https://complex-analysis.com/ reply brnaftr361 12 hours agoprevThank God people are moving towards this modality. I have a fervent hatred for textbooks and publishers. The former are antiquated, static, badly formatted, and often ride with distracting garbage in the margin, or worse inline. It makes actually reading them far more difficult than needs be, with unremarkable asides that may span pages and that are easy to get pulled into. While I understand that they have a purpose, they aren't for everyone so having a platform with the dynamism of a webpage is something that I hope will inevitably lend itself to future development along this course. Not to mention being able to have interactive questions that give quick feedback rather than requiring turning through pages to find out if you're on the right track... And this interactive stuff is just an excellent means to drive meaning from terse and difficult to explain systems. Cheers to the folks that put this together, a thousand thanks for the travails you've been through to blaze these trails! reply smburdick 13 hours agoprevMy undergrad math professor created one of the first fully online linear algebra texts: http://linear.ups.edu/html/fcla.html It's integrated with Sage, a Python library for studying (among other things) number theory. Another prof at the same university also wrote his own linear book, using a lot more illustrations, but as a traditional textbook. I see this book as a solid evolution in both directions. Nicely done! reply citizen_friend 7 hours agoprevMy gut reaction to this sort of thing is that textbooks work great and have a timeless quality. But with a little more thought, they certainly aren't optimal. Being able to see a video, hear a sound, or play with a figure can be powerful learning. I think my hesitation comes from the fact that this stuff just doesn't seem to have longevity (think educational java applets) and tends to be proprietary (shitty Pearson learning hw). How can we get newer media as robust as text and pngs? reply nutanc 6 hours agoparentIt does not have to do with the book or any other medium. It comes from the learner. You are right about the problems mentioned. 1. Stuff does not have longevity. This is because most of the new tools are outside curriculum. This does not encourage students to learn something extra. 2. Proprietary. Books providing add ons have a different goal. They want to sell their books. So the addons or just that. Add ons. They are not complete. These were some of the thoughts which encouraged us to build [1]. Keep it curriculum focused so kids don't learn anything extra. No books to sell :) [1] https://books.innings2.com/ reply huygens6363 5 hours agoparentprevIf only there was some kind of magic device that has basic input facilities coupled with some kind of simple graphics output. I jest, but I think a very basic computational platform - think 6502-style - with simple graphics could be standardized upon and anointed as universal educational computation base. If you don’t touch the instruction set this can go a long way. The outputs of course need to be universal, but we have some experience with outputting stuff on machines. I think we are able to come to some sort of useable situation. Think PDF or whatever with built-in NES emulator. Is that what you have in mind? reply citizen_friend 3 hours agorootparentYes. And the latest iteration of JavaScript/canvas has had longevity, but it doesn’t have the robustness of a JPEG. What you describe would be interesting. reply hannofcart 5 hours agoprevIt's not really a textbook but at this stage, 3Blue1Brown courses almost needs an obligatory mention for how fantastic they are. https://www.3blue1brown.com/ reply teleforce 13 hours agoprevPrevious posts on HN: 1) 2015 (78 comments): https://news.ycombinator.com/item?id=10183725 2) 2019 (140 comments): https://news.ycombinator.com/item?id=19264048 reply dang 3 hours agoparentThanks! Macroexpanded: Immersive Linear Algebra - https://news.ycombinator.com/item?id=26294588 - Feb 2021 (3 comments) Immersive Linear Algebra (2016) - https://news.ycombinator.com/item?id=19264048 - Feb 2019 (140 comments) Immersive Linear Algebra – textbook with fully interactive figures (2015) - https://news.ycombinator.com/item?id=13904881 - March 2017 (74 comments) Immersive Linear Algebra – A free interactive online book - https://news.ycombinator.com/item?id=10183725 - Sept 2015 (78 comments) reply ethanholt1 9 hours agoprevI hope that this sets a standard for future textbooks/publications. I haven’t been able to grasp several concepts in math unless I was able to properly visualize it, which most modern textbooks do with a terribly compressed and unsaturated JPG. reply ubj 14 hours agoprevThis looks like a fantastic resource. After a quick scan, I couldn't find any information on how this book was programmed / created. Does anyone know if a particular framework was used, or if this was all coded by hand? reply ayhanfuat 14 hours agoparentLooks like the authors rolled out their own https://immersivemath.com/ila/javascript/samillustration3d.j... reply tunnuz 13 hours agoprevI studied physics-based rendering from a book by one of the two authors (T. A-M), and it was written excellently. I'll have a look at this for sure, as I need a refresher every now and again. reply akam4n4n 15 hours agoprevlooks like the future of education. especially with VR reply lambdaba 15 hours agoparentI remember Jaron Lanier describing this vision of learning through VR, where a student in class would \"become the triangle\" in learning trig, etc. reply fuzztester 10 hours agoprevThe navigation links at the bottom of the home page are too small on my phone. Maybe a CSS issue ... reply fuzztester 10 hours agoprevThe web site says math, but it seems to be only about linear algebra. reply gerdesj 10 hours agoparentWhich \"subject\" would you normally ascribe linear algebra to? It looks like this is a first module within the Immersive math system. No doubt there will be more. Why not look at what is presented rather than what is not? reply fuzztester 9 hours agorootparentnext [2 more] [flagged] fuzztester 8 hours agorootparent>I have a degree in math, boyyyy. ;) But more importantly, I try to use my brains, unlike what you seem to have done in your first comment to me. reply nutanc 6 hours agoprevCool to see stuff like this which makes math fun for everyone. I love stuff like this because it brings together two things I love, math and programming. I mean textbooks are cool. But with the tools available to us we should be able to make almost any textbook interactive. It will need effort, pedagogy, programming skills and design. But it's certainly worth it. Making an effort with this. Started with 6th to 10th grade math. Let's see how this goes. reply doctorhandshake 9 hours agoprevHell yeah. Linear algebra was a hole in my math education and has turned out to be far more relevant to my work than the calculus I spent so much time on. I’ve been teaching myself piecemeal on an as-needed basis but this looks like a great opportunity to finally get a cohesive overview. reply javajosh 10 hours agoprevWould love to see this done with geometric algebra AKA Clifford algebra. reply flandish 9 hours agoprevI like this. I feel like I’m too old, at 45, to relearn and this may help! reply bbor 15 hours agoprevLooks incredible! All this needs is a little bit of conversational AI magic in the background to filter and modulate the content according to plain-English student questions and its go time. Note that this was finished in 2019, so now would be the perfect time for someone to polish this up and expand it to the rest of math! Assuming this is threeJS, you could get an open-source file format going for simulations, and even host crowdsourced applications of it to existing popular math textbooks by Figure/page #. I mean, linear algebra is cool, but the market for good free geometry education is limitless Does anyone know if the big names in math education offer simulations yet, or is it all animations/images/videos still? EDIT: definitely ThreeJS — love the vector chapter. What this needs is true spatial computing support - not pages with nested simulations, but site-wide (SPA-wide) simulated objects. What if every student in geometry class could have their own simulation on their Chromebook as they read/follow along? I can’t wait. reply jimmySixDOF 36 minutes agoparent+1 for Spatial Computing here -- I see immersive here and just think 2D animations of 3D concepts, good start though it may be, is leaving possibilities on the table. 3D consumed inside a fully 6DOF 3D animated space is a better environment to transfer meaning. These collections of links could be piped into WebXR with just a little tweaking and really be immersive. reply fallingsquirrel 15 hours agoparentprevIt really pains me to see someone suggesting adding AI to a book like this. Current AIs are infamously bad at math. The last thing we need is ChatGPT misplacing a minus sign and confusing readers or setting back their understanding by weeks. reply dhosek 15 hours agorootparentI remember a friend reviewing some math before starting grad school was stymied by a typo in her textbook for an inordinate amount of time. It’s really vital that instructional materials avoid errors as much as humanly possible. AI right now ain’t it. reply lanstin 14 hours agorootparentTrue tho detecting untrue maths is a key skill. Unlike software there is no compiler tests whatever step to filter out your own minds flagrant errors. reply skirmish 8 hours agorootparentIn a graduate course, we used a horrible Russian translation of Jacques Neveu, Mathematical Foundations of the Calculus of Probability https://www.amazon.com/dp/B0006BNQSQ with a huge amount of misprints in formulas. I spent lots of time hunting for those misprints, and I think it really helped me understand and remember the material. reply lanstin 5 hours agorootparentIn my last homework the professor omitted a required assumption and I nevertheless proved the false assertion. Extremely embarrassing. This happened earlier in the semester and I correctly failed to finish the homework problem. I am getting tired I guess. reply CamperBob2 11 hours agorootparentprevYou clearly have no idea how effective an interactive conversation with a text can be. An AI doesn't have to be \"good at math\" to be useful. People (and programs) who are \"good at math\" are a dime a dozen. To be useful to a student, a language model just has to be good at answering questions about math. That part works, right now. Try it. Go to ChatGPT4 and pretend you're a student who is having trouble grasping, say, what a determinant is. See how the conversation unfolds, then come back and tell us all how \"infamously bad\" the experience was. Better still, ask it about something you've had trouble understanding yourself. reply p1esk 8 hours agorootparentThe key is to use GPT4, not the free version. reply CamperBob2 7 hours agorootparentYes, that makes a big difference. Many people on HN formed their opinions on the basis of GPT3.x-generation models, though. They asked it a question, they got the nonsensical or hallucinated answer they expected, they drew the conclusion they wanted to draw all along, and by golly, that settles it, once and for all. reply lupire 14 hours agorootparentprevPlease read the comment carefully before parroting a canned retort. It doesn't say what you think it says. reply scubbo 14 hours agorootparent(Not the person you replied to, but) I just re-read it, and the \"canned retort\" still looks completely accurate and relevant. Can you elaborate on why you think that AI's (known, admitted, and inherent) propensity for hallucination _wouldn't_ be disastrous in the context of pedagogy? If the original comment had _just_ proposed to direct students to locations _within_ the original content (\"filter\"), it would have been less-impactful - being directed to the wrong part of a (non-hallucinated) textbook would still be confusing, but in the \"this doesn't look right...?\" sense, rather than the \"this looks plausible (but is actually incorrect)\" sense. But given that the comment referred to \"Conversational AI\", and to \"modulat[ing]\" the content (i.e. _giving_ answers, not just providing pointers to the original content), hallucination is still a problem. reply fallingsquirrel 14 hours agorootparentprevGP's comment has been edited since my post. The original said something like \"regenerate diagrams according to student questions\". It's obviously a bad idea if you're trying to learn vectors and the entire diagram is flipped over the X axis, for example. Nonetheless, today's AIs still regularly contradict themselves from one sentence to the next. Even if they're only generating text and \"modulating\" (which I take to mean rephrasing/summarizing), mistakes can and will happen. I stand by my comment even as it applies to the edited GP. reply boomskats 14 hours agoparentprevJust taking something like the threejs GLTFExporter and combining it with modelviewer.dev on the fly could enable a 'view in AR' button compatible with both SceneViewer and Quick Look (i.e. most mobile devices available today). reply jgalt212 13 hours agoprevLove the bootstrap 3. Clean, it works, and embraces the principle of least surprise. reply whereismyacc 15 hours agoprevah sick people from my uni it's pretty messy tbh but it's a good idea reply greymalik 15 hours agoparentWhat’s messy about it? reply whereismyacc 15 hours agorootparentmaybe the layout just messed up on the resolution I looked at it with, there were boxes all over the place, the spinny thing on the main page scaled out of its bounding box. also I think it would be helpful to have some consistent design cues for which elements are interactive or what you can do with them. if nothing else I feel each interactive canvas should have some kind of description of what you can do with it so you don't have to trial & error reply pimanrules 14 hours agorootparentI found if I resize my browser window the spinny thing on the landing page starts spinning really fast. I like it :) reply whereismyacc 14 hours agorootparentoh interesting it actually works that way whether you zoom in or out reply bbor 15 hours agorootparentprevIt’s possible I’m alone in this, but the textbook / vaguely “academic” style of site always comes across as messy to me. That said, I think we’re spoiled by vaporware that invests huge money into style and flashy visuals — as anyone who’s been in school during the Blackboard/Piazza era knows, education software does not have to be pretty to be popular. reply wdh505 2 hours agoprev [–] One critique that glares in my face is \"you changed the textbooks via hackers and now my children's development is your fault\". These accusations fly when money (e.g. big textbook starts a media campaign) is on the line. As such, these interactive apps need to be able to handle that level of criticism if in a public school (before college). These applications probably need to be client side only enabled and a hash that agrees to the hash of the \"approved curriculum\" for most parents to think that this might be okay, or a read-only USB rental from the school library that gets verified when it is checked back in. I will not let the government install unknown tech on my computer, but I am willing to download a read only file. I do not want to have my children learning \"new math\" and be able to point at the technology as the problem \"because hackers\" or some other BS that has sounds true but has a high amount of effort to disprove coming while chatting with parents at a bus stop or PTA meeting. https://en.wikipedia.org/wiki/Brandolini%27s_law reply oivey 2 hours agoparent [–] It’s a web page. reply GuidelinesFAQListsAPISecurityLegalApply to YCContact Search:",
    "originSummary": [
      "A linear algebra book authored by J. Ström, K. Åström, and T. Akenine-Möller introduces fully interactive figures to enhance learning.",
      "It includes fundamental topics like vectors, dot product, matrix operations, and linear mappings along with advanced concepts such as Gaussian elimination, determinants, rank, eigenvalues, and eigenvectors.",
      "The incorporation of interactive figures distinguishes the book and offers a unique approach to understanding complex linear algebra concepts."
    ],
    "commentSummary": [
      "The post delves into interactive resources and websites covering geometry, physics, chemistry, mathematics, and programming, weighing the advantages and disadvantages of traditional textbooks versus online platforms.",
      "Participants discuss the future of education, including VR technology, AI models, and the utilization of simulation and AI in educational materials.",
      "Users share perspectives on the design and usability of a canvas webpage and express worries about the influence of interactive apps on children's education."
    ],
    "points": 649,
    "commentCount": 54,
    "retryCount": 0,
    "time": 1715447768
  },
  {
    "id": 40327631,
    "title": "PeaZip: Your Ultimate Free File Archiver and Encryption Tool",
    "originLink": "https://peazip.github.io/",
    "originBody": "DOWNLOAD PEAZIP ONLINE SUPPORT SCREENSHOTS BENCHMARKS DONATEPeaZip free file archiver utility. Open, extract RAR TAR ZIP files. 9.8.0 PeaZip for Linux Supported operating systems: Linux x86_64, x86. Experimental support: Linux ARM, aarch64 PeaZip for macOS and BSD Supported operating systems: Darwin, macOS aarch64 M1 & Intel, BSD family PeaZip for Windows Supported operating systems: MS Windows, ReactOS, Wine. PeaZip sources Requires Lazarus / FreePascal ALL DOWNLOADSPEAZIP LINUXPEAZIP MACOSPEAZIP WINDOWSSOURCESPLUGINSTHEMES OPEN SOURCE FILE COMPRESSION AND ENCRYPTION SOFTWARE PEAZIP FREE ARCHIVER DOWNLOAD NOTES Open Source file compression and encryption software What is PeaZip free file archiver utility PeaZip is a free file archiver utility, similar to WinRar, WinZip, and 7-Zip (or File Roller, and Ark on Linux), based on Open Source technologies of 7-Zip / p7zip archiver, Facebook Zstandard compressor, FreeArc, Google Brotli compressor, PAQ family of compressors, PEA (archiving and encryption) project, and other Free Software file compression tools. PeaZip on Facebook PeaZip on Reddit What is different in PeaZip? The project started aiming to provide features often overlooked in applications of the same type. Be CLI-friendly: bridge the gap between GUI and CLI applications to offer the best of the two worlds, blending the archive manager into a scripting engine to automate compression / archiving / backup / extraction... tasks. From \"Console\" tab in archiving and extraction screens, the tasks defined in the GUI can be exported as CLI scripts, i.e. for reuse, syntax learning or inspection purpose, of for refining the tasks beyond the capabilities of the GUI. Offer two factor authentication (password + keyfile) for all formats supporting encryption, to increase security against guessing and dictionary based attacks on weak passwords. Provide a GUI for less commonly supported compression formats - which comes from very interesting research threads in compression field, like the very powerful compressor zpaq or very fast ones as brotli, and zstandard - and provide a platform-agnostic GUI for 7z/p7zip on non-Windows systems. Provide multiple file management features each of whom meeting the needs of different use cases, like verification of a wide array of checksum and hash functions, find duplicates, convert archives, search in archives, bookmarks, tabbed browsing, etc. Deploy all the above in a tool which is natively portable, can be used from removable devices or shared on a network / cloud, without installation, and offers the same UX on all operating systems and desktop environments. PeaZip screenshot running on Windows in light mode, default theme. Click the image to see screenshots on different Operating Systems, alternative themes and dark mode. Main features of PeaZip free archiver Open Source, released under LGPLv3 license which allows to easily integrate it in any licensing environment Cross-platform and cross-architecture, same full featured GUI application on Linux, macOS, and Windows, providing full featured file manager and archive manager on all platforms, also available as portable application Supports over 200 archive formats, ranging from very powerful compressors like 7Z and ZPAQ, to extremely fast compressors like Brotli and Zstandard, with option to easily convert archives Supports strong encryption, optionally two factor authentication and authenticated encryption Can easily export tasks defined in the GUI as command line scripts Safety of Open Source software PeaZip is Free Software, employing technologies from state of art 7-Zip, p7zip, Brotli, FreeArc, PAQ, PEA, Zstandard open source file compression and archiving projects. This software is released under Open Source GNU LGPLv3 copyleft license: the application is free for any use (private and professional). All PeaZip packages are safe downloads, do not contain advertising or harmful software, and are identified with cryptographically secure SHA256 hash published on official download site. Advantages of Portable packages Portable packages, available for Linux, macOS, and Windows operating systems as alternative to installable packages, does not need installation: simply extract and use the application for maximum ease of deployment. PeaZip free archiver in details Cross-platform (Linux, macOS, Windows), full-featured but user-friendly alternative to WinRar, WinZip and similar general purpose archive manager applications, open and extract 200+ archive formats: 001, 7Z, ACE (*), ARC, ARJ, BR, BZ2, CAB, DMG, GZ, ISO, LHA, PAQ, PEA, RAR (**), TAR, UDF, WIM, XZ, ZIP, ZIPX, ZST. View full list of supported archive file formats for archiving / compression, and for extraction. As archive manager utility, PeaZip provides fast, high compression ratio multi-format archiving to 7Z, ARC, Brotli, BZ2, GZ, PEA, TAR, WIM, Zstandard and ZIP archives (write supported formats), and works as opener / extractor tool for 200+ archive types including ACE, ISO, RAR, ZIPX files, including ability to manage encrypted archives for supported formats. This software deploys a powerful and complete file manager for editing, viewing, browsing and searching archive files, featuring a wide set of data security functions: strong encryption (AES, Twofish, Serpent), encrypted password manager, optional two-factor authentication (encryption / decryption with password and keyfile), secure delete, and file hashing tools, easily export tasks defined in the GUI to create command line scripts. For more information about archive creation and extraction performances compared with other popular file archivers tools, read file compression and decompression PeaZip benchmarks page. (*) To use the application to open and extract ACE files it is needed to install WinACE's UNACE plugin from PLUGINS page, otherwise the program will lack the (proprietary) component to read .ace format. (**) RAR files creation with PeaZip is possible if WinRar is installed on the system (autonomous support to rar compression is not possible due to rar licensing limitations). Please note RAR and RAR5 format opening / extraction is supported out of the box: an optional plugin based on official RarLab's unrar code is provided as alternative .rar extraction engine on PLUGINS page, if preferred by user over 7-Zip / p7zip's Open Source unrar implementation. GitHubSourceForgeFlathub PeaZip free archiver download notes Download repositories Official repositories of PeaZip are available on GitHub , and Sourceforge Legacy releases can be downloaded from aforementioned repositories; each release contains program's packages for different supported operating systems, documentation, and sources. Change log and release notes See complete change log and release notes for list of updates and new features of the application, and for SHA256 hash values of each package published in the current release. TOS and Privacy PeaZip is Open Source software, released under GNU LGPLv3 license, documentation is released under GNU FDL license. Neither PeaZip software, nor PeaZip's website collects user data. See complete TOS and Privacy page. Verify integrity of downloaded packages PeaZip free archiver packages are currently not signed, but SHA256 is a cryptographically strong hash, and it is served here through a secure TLS/SSL website, so it can be used for check integrity and autenticity of the packages you are downloading. Download pages of Win64 and Win32 installers also shows SHA256 hash value of each packages for increased security of users. Please note that websites as peazip.com, as well as some Microsoft Store publisher listing alleged PeaZip packages, are in no way involved in PeaZip project: it is not recommended to download PeaZip from sources outside the aforementioned official project's repositories, and it is absolutley not recommended to install PeaZip packages not matching the officially published hash values. Synopsis: All downloads page of PeaZip free archiver utility, freeware file compression and encryption software. Download Open Source, cross platform file archiver software for Linux, macOS, and Windows. Open, extract RAR TAR ZIP files and many other archive types, 200+ formats supported. Topics: PeaZip free archiver all downloads, Linux, macOS, Windows, sources PeaZip > Free file archiver utility, open, extract RAR TAR ZIP filesAll downloads RECOMMENDED PAGES FREE RAR UTILITYFREE ZIP FILES SOFTWAREEXTRACT TAR FILES OPEN ENCRYPTED ARCHIVES MACOS ARCHIVE MANAGERLINUX ARCHIVE MANAGER FREE ENCRYPTION SOFTWARE PORTABLE FILE ARCHIVER UTILITY DOWNLOADS All PeaZip downloads PeaZip for Linux PeaZip for macOS PeaZip for Windows PeaZip sources SUPPORT Online help Frequently Asked Questions ABOUT PeaZip project: TOS, Privacy Releases FeedPeaZip WikiDeveloper emailSearch knowledge-base",
    "commentLink": "https://news.ycombinator.com/item?id=40327631",
    "commentBody": "PeaZip: Open-source file compression and encryption software (peazip.github.io)270 points by thunderbong 21 hours agohidepastfavorite78 comments Dwedit 19 hours agoPrograms like 7-zip and PeaZip both have an unusual feature: Ability to explore NT paths that Windows Explorer will refuse to load. You can go to a path like \"\\\\?\\Harddisk0Partition2\\\" in 7-zip file manager or PeaZip. On my PC, that happens to be the EFI partition. (Need to run as Admin before it lets you access the EFI partition) Sysinternals WinObj will let you see all the paths in the NT Object Namespace. To convert an NT Object Namespace path into a standard Windows path, put \"\\\\?\\GLOBALROOT\\\" at the beginning of the path. Windows Explorer and the File Dialogs will refuse to open such paths, but many Win32 applications will accept those paths as command line arguments. reply chungy 19 hours agoparentNot so much \"refuse\", but lacking code to go down those paths. ReactOS includes built-in shell extensions to browse native NT device paths and the registry right in Explorer. Its same shell extensions can even be installed on Windows to achieve the same thing in Microsoft's Windows Explorer :) reply jasomill 4 hours agoparentprevInteresting. Also note that, while File Explorer and Windows file/open dialog boxes don't accept \"\\\\?\"-style paths at all, you can use the \"Run\" command (Windows Key+R or choose \"Run\" from the Start Menu) to open any available (connected and online) volume in File Explorer using a path of the form \"\\\\?\\Volume{UUID}\\\"[1], even if it hasn't been assigned a drive letter or mount point. Note that, if UAC is enabled, this won't work for EFI system partitions unless you're running Explorer elevated, which can be tricky. You used to be able to kill the explorer.exe process and start a new one from an elevated command prompt or Task Manager, but this no longer works in Windows 11 (Explorer starts, but not elevated). [1] For GPT disks, this UUID is the GPT partition's unique ID. I have no idea how the ID is calculated for non-GPT disks, though I have noticed a few interesting properties: • For volumes on MBR-partitioned disks, all but the first eight bytes of the UUID are zero. • The UUID is not obviously related to a FAT filesystem's serial number. • UUIDs are assigned to devices with removable media like optical drives and SD card readers even when empty, and do not change when media is inserted or removed. In any case, the easiest way I know of find this is using PowerShell: use \"Get-Disk\" to find the disk number (and if this doesn't give you enough information to identify the correct disk, use \"Get-DiskFormat-List\" for more information), \"Get-Partition -DiskNumber n\" to find the partition number (if the disk is partitioned), and, finally, \"Get-Partition -DiskNumber n -PartitionNumber mGet-Volumeselect Path\" to get the desired path. In the case of non-hard disk devices like optical drives, \"Get-Disk\" and/or \"Get-Partition\" may not be available, so use \"Get-DiskFormat-List\" for detailed information on all available volumes, including all volume paths and, hopefully, enough additional information to identify the volume you want. You can also find volume paths with WinObj or the fsutil command, but PowerShell provides more useful information to help identify the correct volume. reply supriyo-biswas 19 hours agoparentprevTIL, thanks! To add to this list of unusual features, 7-zip can also parse many self-extracting PE executables and display the executable sections of ELFs and PEs. I'm not sure if this has been documented anywhere, though. reply Dwedit 15 hours agorootparent7-zip version 15.05 will also decompile NSIS scripts (Nullsoft Installation System), but the feature was taken out of newer versions. reply panzi 19 hours agoparentprevReminds me of when I used WinZip to copy files from a shared directory that had non-ASCII (non latin even!) characters in the file names over 20 years ago. Windows Explorer refused to do it. Can't remember the error message, WinZip did the job. reply NetOpWibby 1 hour agorootparentTo this day I still don’t put special characters in my file names. I’ve been on macOS for years but who knows if I’ll need a Windows machine? reply Qem 18 hours agoprevCurrently using it under Linux because it's able to extract the malformed large zip files generated by onedrive, that give a corrupted file error when you try to open them using the native file extractor. See https://www.bitsgalore.org/2020/03/11/does-microsoft-onedriv... reply c0l0 19 hours agoprevPeaZip is great software, and doubly so because it is written using Lazarus and compiled with Free Pascal. I highly recommend giving it a try, if only to experience that high quality software can be built using tools that lead you somewhat off the beaten path. Unfortunately, its lead developer has recently posted[0] that he has to undergo what seems to be complicated, major eye surgery, and that he will probably be unable to continue development :( [0]: https://old.reddit.com/r/PeaZip/comments/1bn7pu0/communicati... reply MaxBarraclough 16 hours agoparentSomewhat related: GID (for Generic Image Decoder) is written in Ada and significantly outperforms ImageMagick (written in C) in some benchmarks. https://gautiersblog.blogspot.com/2024/03/benchmarking-gener... reply stefanos82 18 hours agoparentprevSeems like he's doing OK, thank goodness! https://old.reddit.com/r/PeaZip/comments/1cpdvum/peazip_980_... reply cxr 12 hours agorootparentNeither the existence of this link nor anything in it contradicts the developer's earlier post. It looks like the situation was inaccurately summarized by the HN user with the top comment here—the PeaZip developer didn't announce that he or she was going to stop working on PeaZip. reply parhamn 11 hours agorootparentprev> Drag & drop from app to system is certainly a mayor usability boost, but it is not simple to implement as it requires a dedicated solution for each supported OS and desktop environment. Off topic, but this is why many devs choose electron. reply NavinF 10 hours agorootparent> and desktop environment Off topic, but this is why many devs choose not to support Linux. Every distro is its own special snowflake reply arp242 8 hours agorootparentThat's just not true; I've been using the relatively obscure Void Linux for almost 10 years, and rarely have distro-specific issues, including with Linux-native games from gog.com. Nor do people report distro-specific issues in software I develop on Void. And it's doubly not true for something like drag-and-drop, which exists on the Desktop Environment level rather than distro level. reply patrickaljord 10 hours agorootparentprev> Off topic, but this is why many devs choose not to support Linux. Every distro is its own special snowflake most DE use the same standards (dbus etc) so no reply bozey07 17 hours agoparentprevI like seeing software written in Free Pascal, they tend to be small and performant. Cheat Engine[0] is another example. [0] https://github.com/cheat-engine/cheat-engine reply r-w 16 hours agorootparentI searched around and found this tutorial[0] on the official wiki. Seems like a decent intro to the history & syntax of the language. There’s also another tutorial[1] on the more modern iteration of the language, as well as some video tutorials[2] on using the IDE for GUI development. [0]: https://wiki.freepascal.org/Basic_Pascal_Tutorial/Introducti... [1]: https://castle-engine.io/modern_pascal [2]: https://wiki.freepascal.org/Lazarus_videos reply deaddodo 12 hours agoparentprevYeah, PeaZip is the best example of what Lazarus is capable of, if you feel like using it. I remember back in my Pascal-loving days, especially after the .NET release of VB, looking at PeaZip+Lazarus and being inspired. reply zoom6628 8 hours agoparentprev+100 for Lazarus and FreePascal reply theandrewbailey 20 hours agoprevI've been using this for over a decade. I keep using it because it extracts files directly where you want them, instead of extracting to a temp folder, then copying to where you want, multiplying IO traffic by up to 2. It also lets me use 7z files with zstd compression, though I'm not sure which other software supports it. reply shawnz 20 hours agoparentMoving files from one directory to another directory on the same filesystem doesn't actually result in any data getting moved, only the directory entries are changed reply maccard 20 hours agorootparentYou’ve made a big assumption about being on the same file system there. We had a CI job that was spending an awful lot of time in fetching cached artifacts. We investigated and it turns out that CI was pulling to %TMP%, but we were actual executing the builds on a separate EBS volume meaning we downloaded and wrote to an EBS volume, then had to copy it to another remote volume, it was super easy to spot on windows, but I’m not sure I would have twigged it as easily if we were moving from /tmp to /data/dira reply shawnz 19 hours agorootparentSure, but you're probably not using PeaZip (which is primarily a GUI front-end for existing compression tools) in CI or containerized environments. For those situations there are specialized tools which are more appropriate. reply maccard 19 hours agorootparentI’m not in this case, but if something writes to /tmp and then copies it to /data, there is no guarantee that they are on the same device or even network. reply bravetraveler 17 hours agorootparentprevLet's start slicing the pie, everyone. On Linux this is becoming a rarity; '/tmp' (the usual $TMPDIR) is mounted using tmpfs, a distinct memory-backed filesystem. Windows on the other hand is happy for this to reside on your physical disk, persistently. I think - this isn't my area. This almost guarantees your \"yes, but\" doesn't apply for anyone using Fedora Linux, for example. I dare say nearly any distribution that includes systemd, and probably/consequently, 'tmp.mount'. While it is memory backed, one can only copy/read from this as fast as the destination can write. reply dataflow 16 hours agorootparent/tmp is often not tmpfs, in fact. /dev/shm or /var/run are. reply bravetraveler 16 hours agorootparentYes, and? It still is very common to find. Turns out things aren't homogeneous. People often both die forever-alone and happily married, too. I already said it's up to the distribution. I wasn't really interested in splitting it more than I have, I hoped to avoid it... but let's go. It's been upstream over a decade https://github.com/systemd/systemd/commits/main/units/tmp.mo... Participation, as always, has been/remains optional. Anything using 'systemd' will likely have this be 'tmpfs', unless 'ConditionPathIsSymbolicLink' is violated. Anything not using 'systemd' is a niche that most of the industry ignores. See how uninsightful/unhelpful these statements are? More specifically, this leaves the one directive/condition to consider... and a subset of a subset that's relevant - systems using runit/s6/whatever. Anyway, that's the fun thing about 'often'. It both often is and isn't. Put simply, word games. We're both right, '/tmp' often is and isn't 'tmpfs'. It's an implementation detail. It's codified into some standards, and it turns out some distributions are more prepared/cognizant than others. The inconsistency in applying this makes the assertion that lead to this whole thread off base. edit: I originally mistook the last edit two years ago for the creation time - adjusted. This has been established for ~14 years! reply dataflow 3 hours agorootparent> Anything not using 'systemd' is a niche that most of the industry ignores. See how uninsightful/unhelpful these statements are? Ubuntu uses systemd. And yet it doesn't use tmpfs for /tmp. I literally just even installed 24.04 right now (new LTS from 3 weeks ago!) just to verify this hadn't somehow changed since the last time I had checked, and it still hadn't. I'm not here to argue or play word games, I was just trying to point out that this isn't some kind of niche setup. The way you make it sound when you talk about Fedora or s6 or whatever gives readers the impression that they can assume /tmp is on tmpfs on anything mainstream & modern, but that's simply not the case -- it's not the case on the second(?) most popular distro. That's all I was trying to convey. reply edflsafoiewq 17 hours agorootparentprevYou shouldn't use /tmp for that for that reason. aunpack for example extracts into a temp directory in the same directory as the final destination. reply bravetraveler 17 hours agorootparentI'm fine with either, I think you and Andrew at the top of the thread agree - PeaZip does as you suggest. I'm just piling on :D Things that naively use temporary directories otherwise may run into an extra copy... because it's not necessarily on the same filesystem. It's rare, in fact, on modern Linux reply iwwr 20 hours agorootparentprevIn some restricted environments (e.g. containers in CI, build servers or AWS Lambda) you may have limited disk space or no write access at all, so it is useful to have a tool that can stream to memory while decompressing on the fly, and discarding what you don't need. reply Adj_and_Styles 3 hours agoparentprevThe atool script is just a wrapper around many compression tools. Try atool -x which creates the temp folder under final destination. https://www.nongnu.org/atool/ Edit: just noticed it was mentioned in other reply, but as aunpack, a symlink to atool. I got used to the -x|-l|-a|... style and rarely remember the alternative names. reply baal80spam 19 hours agoparentprevThe trick to do it using the default 7zip file manager is to open the .7z file in the manager (double clicking it, not right clicking it), and extract the archive whenever you want it - it will be extracted straight there with no transition using temporary folder. reply exposition 15 hours agoprevThere’s also pzip[1], which lets you create zip files and extract them in parallel. [1] https://github.com/ybirader/pzip Disclaimer: I’m the author reply hgyjnbdet 13 hours agoprevGenuine question: why would I use this over 7zip? reply ies7 10 hours agoparentI really don't remember well, long long time ago in Window (XP?) either you can select multiple folders and zip each of them separately and/or you can select multiple zip files and extract them to separate folders within a single context menu reply UberFly 11 hours agoparentprevNo reason to if you like 7zip. They all do the same thing just look different for the most part. reply pennybanks 5 hours agoparentprevdoesnt windows now have all the similar tools default? reply croemer 9 hours agoprevNitpicks: 1. Command to unquarantine in docs is wrong. It should be `xattr -d com.apple.quarantine /Applications/peazip.app` not `xattr -dr com.apple.quarantine /Applications/peazip.app` 2. Not available via homebrew 3. Can't open issues, neither on Github nor sourceforge reply someonehere 9 hours agoparent1. Right click on the app and choose open. When prompted, click open 2. https://github.com/rogeriopradoj/homebrew-cask-peazip/blob/m... reply sigzero 8 hours agoparentprevThere is noting wrong and it is probably better to use 'xattr -d -r' since an .app file is just a directory structure. reply teo_zero 11 hours agoprevThe fact that GTK3 is considered the new thing still in alpha is a red flag for me. reply bobbob1921 17 hours agoprevLOVE peaZip! What I especially like about it is in my experience it’s been very portable on linux, and the gui has always been portable as well. (it works on Tails - so it’s great for putting onto a USB stick that contains encrypted zip / veracrypt archives for when you need to access those on an air gap d machine.) reply causality0 20 hours agoprevCan anyone explain why this is better than 7zip? reply jsheard 20 hours agoparentI don't know if this is better, but 7zips developer has an unnerving track record when it comes to security practices. He resisted adopting basic mitigations like DEP and ASLR for a long time, only relenting after a security researcher basically begged him to after finding arbitrary code execution exploits, and he still doesn't want to use any more advanced hardening techniques because they (slightly) bloat the binary size or have a (tiny) performance overhead. I'm all for lean software but breaking ASLR by stripping the relocation tables, just to shave a few kilobytes off an executable which is primarily intended to parse untrusted files is just reckless. reply lobito14 19 hours agorootparentCan you please provide the source of this thread? reply tylerritchie 19 hours agorootparenthttps://landave.io/2018/01/7-zip-multiple-memory-corruptions... but also see: https://news.ycombinator.com/item?id=16986377 reply tux21b 18 hours agoparentprevI hate that PeaZip does not support passwords with a quotation mark (\") in the UI. I haven't reviewed the code, but I am assuming that they are neither passing the password via a variable (linked library) nor via an execve call (less secure), but via some sub-shell which is a common attack vector and bad security practice. But as I said, I haven't reviewed the code. reply chungy 18 hours agorootparentI haven't ran nor looked at the code for PeaZip, but the website describes the program as a GUI wrapper around command line utilities. I highly suspect it's the sub-shell thing. reply fallingsquirrel 16 hours agorootparentThat's concerning. What if your archive password is ;rm -rf --no-preserve-root /? There might be an easy CVE for the taking here. reply ementally 19 hours agoparentprevMOTW support enabled by default https://github.com/nmantani/archiver-MOTW-support-comparison... reply Sakos 19 hours agoparentprevI've sworn by 7zip since forever and I still use it primarily, but I'd recommend peazip to anybody who wants 7zip but with a better, more convenient GUI (and workflow/behavior). I still think about switching back to peazip (only used it for a few months), but old habits die hard. reply eviks 19 hours agoparentprevZstd support and x-platform reply delfinom 18 hours agorootparent7zip 24 supports Zstd reply canistel 20 hours agoparentprevCross-platform - works on Linux (with GUI). reply Tijdreiziger 14 hours agoparentprevPrettier UI (IMHO) reply user20180120 11 hours agoprevCan it do lrzip? Did a quickish search https://github.com/nakijun/peazip/issues/149 reply synergy20 15 hours agoprevhow is the GUI done for cross platform? not familiar with Pascal ecosystem reply gattilorenz 11 hours agoparentLazarus/FreePascal compile to a native binary for more platforms than you will realistically need reply aquova 15 hours agoprevI've been using Ark on Linux for some time now, but have always heard people sing PeaZip's praises, curious if anyone has any experience or preference between the two. reply seam_carver 13 hours agoprevIf your needs are basic I just use tar. It's built into macOS and Windows 10. It even supports rar! reply jojohohanon 13 hours agoprevIt blends the CLI by incorporating scripting engine?! That’s not what mean by cli friendly. reply tahoeskibum 15 hours agoprevCan't wait to see an irreverent logo reply sneak 20 hours agoprev> Offer two factor authentication (password + keyfile) for all formats supporting encryption, to increase security against guessing and dictionary based attacks on weak passwords. uhhh, that’s not how symmetric encryption works. We have salted password-based (PB) KDFs for exactly this purpose. Encryption probably doesn’t belong in the compression container format. reply lucb1e 18 hours agoparentThe quote is correct. It does not say they're not using a KDF or salting, which you seem to read into it? The keyfile is the \"something you have\" and the password \"something you know\", so two-factor checks out, even if it's not a time-based token that people expect nowadays (though TOTP is essentially the same but on another device, extracting time-based short codes from the long key to make it convenient to type over). No matter how good your KDF, a weak or reused password can still be crackable, so a key file can make sense even if you use a salted KDF reply sneak 17 hours agorootparentHow is this different from just a keyfile? reply gkbrk 15 hours agorootparentSomeone with the keyfile but without the password cannot decrypt? reply sneak 11 hours agorootparentDo people usually store key material without encryption at rest? You're not writing the naked bytes of the key directly in a file. Anyway, authentication refers to communication between systems. That's not what this is. Decryption is not authentication (except perhaps of the decrypted plaintext, which is not what we are discussing). reply rakoo 6 hours agorootparent> Do people usually store key material without encryption at rest? As usual, depending on the threat model, yes, it can be very valid to store key material on a disk without encryption. Not everyone is Snowden. reply Retr0id 20 hours agoparentprevPeaZip also uses a PBKDF (PBKDF2). No longer the latest and greatest, but fine. reply lucb1e 18 hours agorootparentI guess I agree with calling PBKDF2 fine, but it may be good to know the caveats: - Just because it says it uses PBKDF2 doesn't mean it is strong. The strength fully depends on the number of rounds it uses, and especially in legacy (>10 years old) software I see it a lot that some amount of rounds are hardcoded which can now be computed in a few milliseconds on a CPU - PBKDF2 gives the attacker a ~1000x speedup. If your CPU spends 2 seconds on computing the hash every time, an attacker with a run-of-the-mill GPU spends 2 milliseconds per guess (500 guesses per second). Using something like Bcrypt or Argon2, that speedup gets to iirc \"only\" 12x (so if you spend 2 seconds, the attacker spends ~170 milliseconds or 6 guesses per second). Iirc this speedup is due to GPU RAM being faster than the main RAM. So while PBKDF2 isn't great, it's also not like it's broken: this has been a known property since forever and it's still orders of magnitude better than a plain hash reply lobito14 19 hours agoprev [7 more] [flagged] pheatherlite 18 hours agoparentLooks fine in portrait on my Samsung galaxy s20 on Firefox. Sure, it's not \"mobile first class\" websit, but it's a desktop application after all reply gkbrk 15 hours agoparentprevWhy? Were you planning to use it on mobile? reply cess11 19 hours agoparentprev [–] Looks fine in landscape on my hand-held. reply efilife 18 hours agorootparent [–] Do you use your phone in landscape mode? reply mickeyr 17 hours agorootparentI do when it makes sense to reply cess11 14 hours agorootparentprev [–] Yes, there's a neat button in a pull-down-menu where I can lock and unlock automatic switching based on some gyro-sensor or whatnot, it's kind of nice for when I'm watching Вампиры средней полосы or reading a technical manual. reply GuidelinesFAQListsAPISecurityLegalApply to YCContact Search:",
    "originSummary": [
      "PeaZip is a free file archiver tool compatible with Linux, macOS, and Windows, offering encryption, cross-platform support, and extraction of over 200 archive formats.",
      "The software is open source, ensuring user privacy without data collection, available for download from official repositories with package integrity verification using SHA256 hash values.",
      "PeaZip allows users to securely manage their files while supporting a wide range of operating systems."
    ],
    "commentSummary": [
      "The discussion explores file compression and encryption software like PeaZip and 7-Zip, focusing on features, compatibility, and security aspects.",
      "It highlights the significance of understanding temporary directories, file extraction procedures, and the behavior of varied operating systems.",
      "Users exchange insights on security concerns like password storage, authentication via keyfiles and PBKDF2, as well as utilizing mobile devices for tasks like watching videos or reading technical documents."
    ],
    "points": 270,
    "commentCount": 78,
    "retryCount": 0,
    "time": 1715429940
  },
  {
    "id": 40331968,
    "title": "Portfolio Project: Free and Open-Source Browser Video Editor",
    "originLink": "https://news.ycombinator.com/item?id=40331968",
    "originBody": "Hey everyone, for the past like six months I&#x27;ve been working on a portfolio project. I got tired of doing easy projects, so I decided to tackle something bigger and more challenging. That&#x27;s when I came up with the idea of a video editor. This piece of work is intended to showcase my skills and land me a job, but I like to think when working on projects that my idea is so cool that people will like to use it, and I treat every project like a startup idea. Also I havent seen many open source video editors especially on web so that was one of the points why I decided to make that and not something else, but in the end its learning experience and im not expecting much if at all.A bit about the video editor itself:-website: https:&#x2F;&#x2F;omniclip.app&#x2F;-its free-its open source (MIT Licensed)-its using Webcodecs API for quick rendering-works fully inside browser, client side, no private data is kept-I made some readme with more details, im not expecting contributions but I added bit about it: https:&#x2F;&#x2F;github.com&#x2F;aegir-assembly&#x2F;omni-clipFeatures:-Trimming-Splitting-Supports - Text, Audio, Video (mp4) and Images-Clip editing on preview - rotating, resizing, text styling and more-Undo&#x2F;Redo-Render in different resolutions, up to 4k.Things to know before using this editor:-it is simple editor, but its my main project im working on and improving it.-right now it only works with videos 25 fps and more but not less-only 4 tracks -- its something I could improve quickly but forgot-bug here and there (eg. filmstrip not rendering until timeline scroll moved)-its not working on phones yet (drag and drop API problems)I&#x27;d love to hear your thoughts and feedback on it.",
    "commentLink": "https://news.ycombinator.com/item?id=40331968",
    "commentBody": "Open-Source Video Editor Web App222 points by zenkyu 7 hours agohidepastfavorite38 comments Hey everyone, for the past like six months I've been working on a portfolio project. I got tired of doing easy projects, so I decided to tackle something bigger and more challenging. That's when I came up with the idea of a video editor. This piece of work is intended to showcase my skills and land me a job, but I like to think when working on projects that my idea is so cool that people will like to use it, and I treat every project like a startup idea. Also I havent seen many open source video editors especially on web so that was one of the points why I decided to make that and not something else, but in the end its learning experience and im not expecting much if at all. A bit about the video editor itself: -website: https://omniclip.app/ -its free -its open source (MIT Licensed) -its using Webcodecs API for quick rendering -works fully inside browser, client side, no private data is kept -I made some readme with more details, im not expecting contributions but I added bit about it: https://github.com/aegir-assembly/omni-clip Features: -Trimming -Splitting -Supports - Text, Audio, Video (mp4) and Images -Clip editing on preview - rotating, resizing, text styling and more -Undo/Redo -Render in different resolutions, up to 4k. Things to know before using this editor: -it is simple editor, but its my main project im working on and improving it. -right now it only works with videos 25 fps and more but not less -only 4 tracks -- its something I could improve quickly but forgot -bug here and there (eg. filmstrip not rendering until timeline scroll moved) -its not working on phones yet (drag and drop API problems) I'd love to hear your thoughts and feedback on it. fauigerzigerk 12 minutes agoSorry for responding to relatively unimportant usability details rather than to the core of of what must be a tremendously difficult project. But as one purpose of this app is to showcase your work, perhaps my feedback isn't completely useless and certainly not meant to offend. When I open the home page, I see almost nothing right out of the gate. There's no contrast at all. It's all tiny dark symbols on a vast black back background. After I let my eyes adjust for a bit, I see an empty timeline with absolutely no indication of how to load anything into it. I tried closing the timeline by clicking on the X in the upper right corner, but nothing happens. Clicking on some faint squares in the upper right produces more nested panes. Contrary to the main pane they do have a menu (with labels, which is great). Clicking on the text menu produces uneditable example text in that pane. Hovering the mouse over the example text makes a plus icon appear. Clicking it creates a big red bar below the timeline in the original pane. I can change its size horizontally, but I can't find a way to enter any text. I think someone who works with video editors a lot wouldn't be quite as confused by this user interface as I am. But a web app like this is probably aimed at casual users like me. So my suggestions are: a) More contrast! If you absolutely must do dark mode then you must also make everything on that black background big, fat and very bright, or people like me will think they just turned blind. b) Better discoverability! All those tiny faint controls that appear only when the mouse is hovering over them are making it extremely hard for video editing newbies like me to understand what's going on. c) Do some more testing. Besides not being able to enter any text, the plus icon in the text editor that normally produces those red bars stopped responding for me after a while. Refreshing the page brought it back to life. I'm using Chrome on Mac with a not too great external monitor, which might make some of the contrast issues worse than it would appear to others. Congrats to actually releasing something! reply thatandyrose 3 hours agoprevHey this is awesome! I'd love to hear more about some big issues you had, and how you solved them. For example, you mentioned using the webcodecs API for quick rendering. What do you mean by that? What was the slower alternative? Also when did you choose ffmpeg Vs webcodecs API and what were the differences? A lot questions, sorry just really impressed! reply zenkyu 3 hours agoparentSo basically webcodecs API is the best thing to happen in video processing, decoding and encoding are the most demanding parts of rendering, honestly there werent any good alternatives at all and If it wasnt for webcodecs api I wouldnt even bother trying to do it fully clientside, it would be slow and all, here is a bit about the alternatives: https://github.com/w3c/webcodecs/blob/main/explainer.md none of those alternatvies were specifically just for decoding and encoding, usually you had to work around it and get average results at best which I really wasnt satisfied with. When it comes to ffmpeg vs webcodecs API, honestly ffmpeg is slow as decoder and encoder I really dont recommend using it when theres webcodecs api, obviously depends what you are trying to do, but my god I dont remember exacly how fast it was but ive got like 10 fps when decoding or something like that, you would be better off just playing the video and drawing it in real time reply zenkyu 4 hours agoprevFor anyone wondering why you are getting black screen, sorry for that, I completely forgot about handling it correctly, mine project was already cached so i forgot about this problem, basically you need to wait until it loads about 50-80mb PS: thanks to anyone for giving me github stars :) reply endofreach 4 hours agoparentIf i was you, i would at least say zenkyu for the github stars, but i guess thanks is fine too... reply chompychop 3 hours agoprevAwesome work! Could you tell us a little about how you went about building this? What resources would you recommend for learning to build something like this? reply zenkyu 2 hours agoparenthonestly when starting this project I knew that the rendering is most expensive, thats what I started digging into first and I found webcodecs API, it was like dream come true for my project, but that was just a start of my painful journey :D theres little tutorials how to use it, fortunately most of the issues I faced I could find solution on just github issues. Webcodecs is just decoding and encoding, but part of rendering is also muxing and demuxing, I recommend using ffmpeg wasm for that, or build your own webassembly version which should be leaner if you really need that. Generally the rendering process consists of a canvas that you need to draw things on in right order and place and time. First you demux your video file and decode its frames using webcodecs decoder, decoder is doing its work inside worker, you push those frames as they are decoded to some array and in the same time you draw those frames and other stuff on canvas and dispose/close the frames that are already drawn and are not needed, at the end of each canvas draw you send that canvas to another worker with encoder, encoder is doing its work encoding frames, and you push those encoded frames to some binary array, at the end of the work you just mux those frames and save the file :) I dont know if it makes sense, might not because i know those stuff may sound confusing .. but If you take it bit by bit i assure you will make it I did watched this video to get some broad idea how all that works, https://portal.gitnation.org/contents/pushing-the-limits-of-... reply SillyUsername 2 hours agoprevHow did you get around the Chrome tab max memory 4GB (\"32 bit optimisation\") limit? reply zenkyu 1 hour agoparentwell ... I didnt :D some of the stuff you just need to live with .. reply moffkalast 1 hour agorootparentCould potentially use the indexedDB as a swap of sorts, iirc it's typically unlimited. It would probably be quite slow though. reply zenkyu 1 hour agorootparentI did tried that and yes it was slow, like it almost didnt make sense to use webcodecs api because there was too big of a bottleneck reply steren 3 hours agoprevI love that it's 100% client side. I tried to drag and drop a .PNG but it didn't work. reply zenkyu 3 hours agoparentooh theres that super confusing bug .. well another bug that im finding out about too late ..., if you tried to drag and drop file from explorer to the website then it wont work, but in the same time it will show that drop indicator which is confusing, I completely forgot to implement the importing on drop and in the same time I didnt remove that indicator, well stupid me, honestly I havent got many people to test it so it is what it is ;/ reply anonzzzies 1 hour agoprevThis is excellent work! Let’s see if I can contribute to the open parts as they seem more in my boring dev experience :) Anyone know of a feature rich MIT (or similar; no (a)gpl) license based web based image editor I can use in my saas app? reply zenkyu 1 hour agoparentI forgot I created discord server, if you want you can join: https://discord.gg/Nr8t9s5wSM reply zenkyu 1 hour agoparentprevcool! im a bit not prepared, I havent got any issues per se to work on, those 2 I have are old and I will remove them, to be honest I didnt expect that much reception, but I will try to figure something out for you if you are willing to contribute reply chreniuc 3 hours agoprevI've noticed that having a screen recording or tab recording feature is very useful. I wanted to do a demo of my web app and looked for a while for a tool to be simple, I ended up using clipchamp.com. reply zenkyu 2 hours agoparentI will definitely add that, I have a lot of cool things too add so stay tuned :D Psst, i havent mention that anywhere, but I want to add 3d animations, so your video will look like its in 3d, that will make those marketing kind of videos about websites or someting else that look flat look super cool, like some sliding animation from bottom to top, some zoom in and out, close ups from different points of views etc .. reply wonger_ 5 hours agoprevNice, seems like a good learning project. Black screen on mobile was disappointing, but oh well. I've thought about video editing in the browser before. I understand there's a memory limit, something like 5GB iirc. Have you experienced that yet? reply bjano 7 minutes agoparentYou don't need to keep the video files in memory, it's enough to have the javascript File object and then you can read the packets you need on the fly. This way the app's memory usage should be okay. This is what I did in my similar project (vidmix.app) and seems to be what OP's project is doing, except that they also copy the file to indexedDB to keep it around after the browser tab is closed. reply zenkyu 5 hours agoparentprevhmm yeah you will probably get black screen when its still loading, it is pretty big because of ffmpeg, probably about 50-80mb to load, ive noticed it myself but its usually couple of seconds, thats error on my end because im handling that loading not right because it should show loading indicator but its not ... but it wont work on mobile anyways, i need to fix problem with drag and drop because its simply not working, i dont exacly remember what was the memory limit, but it depends on the browser, i havent experienced the memory limit yet btw reply wonger_ 5 hours agorootparentAh yep! I just didn't wait long enough. Very cool. Seems like it took a lot of work. And it seems better than other browser-based video editors I've seen in the past, so kudos. TIL about the webcodecs API to get frames of video and chunks of audio: https://caniuse.com/?search=webcodecs https://developer.chrome.com/docs/web-platform/best-practice... reply zenkyu 4 hours agorootparentyeah sorry for that long loading and not properly showing indicator, it took long time for me to develop especially because I was trying to learn as much so I usually tried doing something myself for weeks and then finally thinking that was idiot move and using library, webcodecs API is super cool, im hoping they will also add muxing and demuxing to api, though I like ffmpeg because im using it more than just muxing and demuxing in this project reply esafak 4 hours agorootparentprevMake your loader indicate progress or something. Show what you will be able to do after it is finished loading... do something useful with that time. I thought you got hugged so I backed out after a few seconds. reply zenkyu 4 hours agorootparentyeah i will, sorry for that, i thought im handling it correctly but im not, and i was deceived becuase mine was already downloaded and cached so it no longer loaded for that long ... reply zenkyu 1 hour agoprevbtw shoutout to great frontend framework I built this project with: https://github.com/benevolent-games/slate Im sure he would be happy with some stars :D reply johnwheeler 4 hours agoprevThat’s funny - I created one as well, but it took me a bit longer. It’s not as full featured as yours in the non linear editing sense, but it’s for a different use case I’m trying to launch it on Show HN right now but not having your success :-( It was hard as shit to build. mine is commercial You can see my editor in action here: https://www.demo.fun/d/lSVixyJOZeZ1ugT It’s specialized for its use case—editing product demos, but, I had to virtualize the timeline events to support cutting and nested cuts. In other words, when a cut in placed in the video, I jump to the point in time at the end of the cut and adjust all surrounding events. It doesn’t do join and split, but I would know how to do that. Also lots of FFmpeg stuff on AWS Lambda Love to chat sometime about what you learned! Yours is very impressive! reply pvg 3 hours agoparentbut not having your success A couple of ideas to consider: Include a blurb in your submission like you did here: https://news.ycombinator.com/item?id=40234611 But maybe take the salesy-ness down a little and add a bit of technical or other interesting detail. Think of a way to make it easier for HN readers to try - right now, there's no way to try the full thing without a credit card which is a massive barrier for most casual evaluators. Watermark but more of the full feature set could be an option, for example. reply ldenoue 1 hour agorootparentI also built ScreenRun, a video editor with zooms and fake clicks running 100% client side with web codecs. You can try for free https://screenrun.app/ reply zenkyu 4 hours agoparentprevthanks im glad you think its impressive it means a lot for me after working on it so hard for so long and after endless destroyed sleeping schedules ... I did learn a lot about the tools like ffmpeg or mp4boxjs, and general idea about video processing and codecs to make it work .. in other words tons of different things to learn to pull it off, but thats what I wanted :D I needed to challenge myself because im not confident in my abilities as programmer so hearing some nice words about my project is all I need now reply zenkyu 1 hour agoprevfor anyone willing to contribute, perhaps join my discord so we could somehow communicate: https://discord.gg/Nr8t9s5wSM reply skykooler 4 hours agoprevFirefox is not supported apparently. reply zenkyu 4 hours agoparentyep webcodecs api is not supported in firefox .. any non based chromium browsers reply koito17 4 hours agorootparentFirefox supports the WebCodecs API behind a feature flag. Set dom.media.webcodecs.enabled to true. I am able to use your app this way -- the media import, timeline, and player functionality seems to work fine. reply zenkyu 4 hours agorootparentgood to know, hopefully they will add it soon to work without flags reply padenot 2 hours agorootparentWe're aiming to release this half, so in a month or so, on all desktop platforms, mobile will follow shortly after. Then we'll gradually optimize (e.g. enable the use of more hardware encoders, decoding being generally in hardware at launch of supported) release after release, but generally almost everything will be supported at launch. reply zenkyu 2 hours agorootparentGreat! thanks for letting me know, users will finally no longer be faced with sad info that its not supported :D reply GalaxyNova 1 hour agoprev [2 more] [flagged] zenkyu 1 hour agoparent [–] sorry it doesnt work on firefox yet, webcodecs api is not supported here, but you can enable this flag: Set dom.media.webcodecs.enabled to true to make it work reply GuidelinesFAQListsAPISecurityLegalApply to YCContact Search:",
    "originSummary": [
      "The author developed a free and open-source video editor in the browser over six months, offering features like trimming, splitting, and support for various media types.",
      "The editor, intended for learning and enhancement, has constraints like only operating with videos at 25 fps or above and not being compatible with phones currently.",
      "Feedback and comments are encouraged by the author for further project development."
    ],
    "commentSummary": [
      "Zenkyu created Omni Clip, an open-source web app video editor, running in-browser without storing private data, receiving feedback on usability problems like contrast lack.",
      "Users are engaging in discussions around features such as the webcodecs API and memory constraints, sharing their encounters with different video editors, and proposing enhancements.",
      "The author hints at another video editor, ScreenRun, and outlines upcoming releases aimed at enhancing platform compatibility."
    ],
    "points": 222,
    "commentCount": 38,
    "retryCount": 0,
    "time": 1715481303
  },
  {
    "id": 40328616,
    "title": "Key Metabolic Changes Link to Autism Development",
    "originLink": "https://medicalxpress.com/news/2024-05-metabolism-autism-reveals-developmental.html",
    "originBody": "May 10, 2024 Editors' notes This article has been reviewed according to Science X's editorial process and policies. Editors have highlighted the following attributes while ensuring the content's credibility: fact-checked peer-reviewed publication trusted source proofread Metabolism of autism reveals developmental origins by University of California - San Diego Credit: Pixabay/CC0 Public Domain Researchers at the University of California San Diego School of Medicine have shed new light on the changes in metabolism that occur between birth and the presentation of autism spectrum disorder (ASD) later in childhood. The researchers discovered that a small number of biochemical pathways are responsible for the majority of these changes, which could help inform new early detection and prevention strategies for autism. \"At birth, the physical appearance and behavior of a child who will develop autism over the next few years are indistinguishable from that of a neurotypical child. Indeed, in most cases the fate of the child with regard to autism is not set at birth,\" said Robert Naviaux, M.D., Ph.D., professor in the Departments of Medicine, Pediatrics and Pathology at UC San Diego School of Medicine. \"We're starting to learn about the governing dynamics that regulate the transition from risk to the actual appearance of the first symptoms of ASD. Early diagnosis opens the possibility of early intervention and optimal outcomes.\" ASD is a developmental disorder characterized by difficulties in socializing and communication, as well as repetitive and/or restrictive behaviors. For the majority of people with ASD, the condition is a significant disability, with only 10–20% of children diagnosed before 5 years of age able to live independently as adults. While autism is known to have strong genetic risk factors, there are also environmental risk factors that play a role in the development and severity of ASD. Naviaux and other researchers are discovering that the development of autism is governed by the real-time interaction of these varied factors. By studying the developmental biology of metabolism and how it differs in autism, new insights are emerging in ASD and other complex developmental disorders. \"Behavior and metabolism are linked—you cannot separate them,\" added Naviaux. To learn more about the early metabolic changes that occur in children with autism, researchers studied two cohorts of children. One cohort consisted of newborn children, in whom autism can't be detected. The second cohort consisted of 5-year-old children, some of whom had been diagnosed with autism. When comparing the metabolic profiles of children in the cohort who were eventually diagnosed with autism to those who developed neurotypically, they found striking differences. Of the 50 different biochemical pathways the researchers investigated, just 14 were responsible for 80% of the metabolic impact of autism. The pathways that were most changed are related to the cell danger response, a natural and universal cellular reaction to injury or metabolic stress. The body has biochemical safeguards in place that can shut down the cell danger response once the threat has passed, and Naviaux hypothesizes that autism occurs when these safeguards fail to develop normally. The result is heightened sensitivity to environmental stimuli, and this effect contributes to sensory sensitivities and other symptoms associated with autism. \"Metabolism is the language that the brain, gut and immune system use to communicate, and autism occurs when the communication between these systems is changed,\" added Naviaux. The cell danger response is primarily regulated by adenosine triphosphate (ATP) the body's chemical energy currency. While these ATP-signaling pathways do not develop normally in autism, they may be partially restorable with existing pharmaceutical drugs. In 2017, Naviaux and his team completed early clinical testing for suramin, the only drug approved in humans that can target ATP signaling and which is normally used to treat African sleeping sickness. Now, the researchers hope that by revealing the specific ATP-related pathways that are altered in autism, their work will help scientists develop more drugs that target these pathways to manage the symptoms of ASD. \"Suramin is just one drug that targets the cell danger response,\" he said. \"Now that we're closely interrogating how metabolism changes in ASD, we could be at the beginning of a drug renaissance that will create new options for treatment that never existed before.\" The study is published in the journal Communications Biology. More information: Communications Biology (2024). www.nature.com/articles/s42003-024-06102-y Journal information: Communications Biology Provided by University of California - San Diego Citation: Metabolism of autism reveals developmental origins (2024, May 10) retrieved 12 May 2024 from https://medicalxpress.com/news/2024-05-metabolism-autism-reveals-developmental.html This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.",
    "commentLink": "https://news.ycombinator.com/item?id=40328616",
    "commentBody": "Metabolism of autism reveals developmental origins (medicalxpress.com)143 points by wglb 18 hours agohidepastfavorite267 comments grumpy-de-sre 16 hours agoOn the topic of metabolic disturbances in Autism, huge fan of the work Dr. Randy Blakely is doing on the links between Serotonin metabolism and Autism. One of the most surprising, and strongest (25-30% of patients), biomarkers for Autism is actually Platelet Hyperserotonemia (high levels of bound Serotonin in the blood). For decades it's been without explanation but recently Dr Blakely has described a bunch of cases where it was narrowed down to SERT transporter polymorphisms and inflammation. Worth a watch for those interested in the weeds of this stuff: https://www.youtube.com/watch?v=cpDtuKV5CJs I've got a pet hypothesis that differences in Serotonin metabolism (and receptor hypersensitivity) might play a role in why SSRIs aren't generally considered a first line treatment for ASD symptoms, https://www.pnas.org/doi/abs/10.1073/pnas.1112345109 reply asdfman123 3 hours agoparentGenuine question: how do we know that's not just a side effect instead of a driver? reply grumpy-de-sre 7 minutes agorootparentDr. Blakelys lab has produced knock-in mice with the rare SERT variants described, and they have exhibited the behavioral and biochemical markers of ASD. It's actually a very remarkable finding. They also saw a reduction in ASD symptoms by pharmaceutically blocking the offending inflammatory pathways. So I think at-least for the tiny fraction of ASD patients with these rare SERT variants there's actually a chance that they are a major driver of the disorder. Regardless it provides a tantalizing look at some of the upstream pathways that could be involved more generally. I think we're going to find the disorder is very heterogenous and there will be many different subtypes and pathways involved. reply squigz 17 hours agoprevActual paper: https://www.nature.com/articles/s42003-024-06102-y reply huijzer 14 hours agoparentSo there is a clear result found and then post hoc there is an explanation made for why this makes sense. That's a bit of a red flag since you preferably hypothesize first, but let's look at the analysis. If I'm not mistaken, then these are the most important parts: - 467 measured metabolites (features) - 136 males and 69 females = 205 (data points) - \"To minimize overfitting, only correlations with q valuesSo there is a clear result found and then post hoc there is an explanation made for why this makes sense. That's a bit of a red flag since you preferably hypothesize first, but let's look at the analysis. Eh, this doesn’t look to be a P-hacking attempt. Scientific exploration doesn’t always hit the hypothesis first model. Ideally this paper should be a source of future specific hypothesis and experiments. Though, IMHO, their implicit hypothesis is that metabolism is a core feature of ASD. The points about the predictive power in fig 3 are interesting. reply m00x 16 hours agoparentprev^^^^ Better to read the paper instead of the pop journals. Most writers don't understand the issues fully and make mistakes, or sensationalize the discovery. reply cwillu 42 minutes agorootparent“This ^” style comments work very poorly on a site that doesn't maintain temporal ordering of comments. reply Animats 6 hours agoparentprev\"Of 50 biochemical pathways and 450 polar and lipid metabolites examined, the developmental regulation of the purine network was most changed. Purine network hub analysis revealed a 17-fold reversal in typically developing children. This purine network reversal did not occur in ASD.\" That's a strong statement, and one which can be checked by others. Anyone trying to replicate this yet? reply ta988 6 hours agorootparentThe article was published today, and study like that take months to do and then months again to be published especially in this kind of journals (thankfully they don't accept replications most of the time so it can get published by more reasonable venues). reply Animats 4 hours agorootparentRight. This is a result which indicates a research direction worth pursuing. That's about it for now. reply quodestabsurdum 15 hours agoparentprevThe paper is a super fascinating read, and lines up with several key features I've noticed in both of my professionally diagnosed autistic children (good luck getting access to a competent diagnostician who understands how the ASD criteria manifest in passing adults). It's really enlightening to see the association between Xanthine, one of the end-stage products of eATP metabolization, and the anxiety that is so prevalent within my own family. From the Discussion[1] section of the paper: > These self-calming connections in metabolism failed to develop in ASD. The natural consequence of the loss of these metabolic safeguards to overexcitation is for children with ASD to seek sameness to avoid the anxiety produced by change91, and to be more sensitive to environmental changes across many sensory domains. And a bit further on: > In the current study, xanthine was the purine that gained the most stimulatory (+r) correlations in 5-year-olds with ASD. Xanthine is one of the end-products of eATP metabolism97. Xanthine is known to trigger a cascade of events that leads to mitochondrial network fragmentation, reactive oxygen species and reactive nitrogen species (ROS and RNS), eicosanoid (e.g., leukotriene, HETE, and prostaglandin) signaling, immune activation, anxiety-associated behaviors, and consolidates long-term aversive memories that make the animal hypersensitive to future environmental changes that warn of environmental danger, cause fear, and trigger anxiety in mice, and is elevated in the blood of adults with anxiety disorders98. Anxiety is a common but under-recognized problem in autism99. Another really important observation: > A major result of this research was that the developmental differences observed in ASD were not the result of an increase or decrease of one causal metabolite, or an isolated change in the gut-brain axis, or neuroendocrine, autonomic, cytokine, or immunologic circuits. Instead, it was the interconnectedness and developmental state of the metabolic network that underlies all these systems that was fundamentally changed. In the last year, the All Brains Belong VT organization has been working on a collection of information they call \"All The Things\" [2], which lines up with the paper's observation that there is an underlying metabolic network at play. As a side note, All Brains Belong VT is a fantastic organization that focuses heavily on validation and support in a healthcare industry which often feels incredibly invalidating for individuals who have been reporting symptoms across a wide variety of siloed physician specialties. [1]: https://www.nature.com/articles/s42003-024-06102-y#Sec25 [2]: https://allbrainsbelong.org/all-the-things/ reply zazazache 3 hours agoprevAs some one who is let’s say “autism adjacent” it really bothers me when people discuss a cure or prevention. I mean I get it, but this is also who I am and I wouldn’t want to be someone else. reply Perenti 3 hours agoparentI'm on the spectrum (diagnosed), and also like being me (most of the time). But what about the poor sods who have so much happening all the time that they don't get the chance to learn to speak, or read, and scream in terror continually at the unending sensory deluge they try to live through? If there was a way to prevent that kind of presentation of ASD I think everyone would be better off. I took \"prevention\" to be about prevention of the life restricting developments of the condition. On the other hand, if \"prevention\" is about culling the gene pool, I'm dead set against that. reply Thorrez 3 hours agoparentprevThe article seems to be focused on people who are unable to live independently. >For the majority of people with ASD, the condition is a significant disability, with only 10–20% of children diagnosed before 5 years of age able to live independently as adults. reply cwillu 38 minutes agoparentprevAs someone who has been diagnosed, it really bothers me when people tell me I'm not allowed to want to not be this way. For some people, it's a hell. reply RCitronsBroker 1 hour agoparentprevas someone who’s also autism adjacent and content with it, let’s still recognize that it’s not called spectrum for nothing. Yes, one’s norm of \"functioning\" can be more dependent on society than you’re own opinion, but I’ve witnessed several individuals on the \"lower functioning\" end of the spectrum who really didn’t seem like they were content with the way they’re living life. I’m not infallible, but it definitely seemed that way. reply bratbag 1 hour agoparentprevHow much of that is rational and how much of that is because of you being unable to handle change due to the side effects of what you are enduring? reply Log_out_ 2 hours agoparentprevIts also missing how speacalists with traits and hyperfocus are the driving force behind a ton of research. Then again having a retarded kid is like having a 60 ton weight attached to you for life. Yes, yes, we are not allowed to say this, but thats easily said by those who don't wear the weights. reply ModernMech 3 hours agoparentprevI have no problem with discussion about making some issues people face better with medication, although I think autistic people should be centered in those discussion. However “prevention” talk is a whole separate issue and that one does give me eugenics vibes. reply mrangle 7 hours agoprev>suramin They're investigating the use of a drug that they don't understand to treat a condition that they don't understand, through the lens of one model that variously competes with or incompletely conforms to a myriad of other models of the condition. In order to what? Nebulously \"manage\" a complex neurological difference that will always defy reversion to anything else? It sounds like they want something that they can prescribe, period. And it sounds like it has the potential to further complicate already difficult lives. Type 1 Autism may serve a general human gene pool function in terms of edge-dripping a specific intelligence trait into it (low probability of reproduction, protecting general social skill in the pool, but adding a divergent pattern solving skill at the edges). While autism is difficult, I'm not sure that solving for it in the context of industrial medicine is wise. We don't want to solve for Nicola Tesla, for example. Type 2 and 3 Autism could be genetically unsuccessful attempts at Type 1 autism development, to spitball. Assuming they are actually related, in most cases. Such management theoretically could be helpful here, but I think that these people deserve a lot better than injected parasite medicine with a lot of side effects. Besides, try getting an autistic child used to regular injections. Though a low-side effect oral or transdermal medication that would, say, specifically enhance energy support to the Autistic PFC with few side effects could be game changing. Likely for many more conditions than autism. Inventing such a medication that doesn't lead to a worse baseline would be critical and perhaps unlikely. Then again its possible that the unique pattern solving ability of the Autistic mind is related to the relative lack of energy supply to an increased volume of PFC neurons; and the subsequent failure of inhibition. Possibly accounting for increased environmental information perception, at least in-part. Which may in turn be mirrored in expanded cognition involved in pattern identification. The ideal, which again I think is unlikely, would be a PRN medication that could \"quiet\" the autistic mind via providing more energy to the PFC; while having no withdrawal semi-permanent side effects. reply Broken_Hippo 2 hours agoparentThey're investigating the use of a drug that they don't understand to treat a condition that they don't understand... You'd probably be shocked to figure out how often this happens - and it used to happen a lot more in no small part because we didn't have the tools we have today: MRIs and better microscopes and other tech has really helped our understanding of the body. We are still figuring out how exactly the body works, after all, to the point that we occasionally discover a new body part. Of course we are going to do things we don't understand. Yet. This isn't limited to medicine, either. Maybe they want something to prescribe. For a lot of diseases, that's better than nothing. For example, I have MS. They know more than they used to about MS, but most of my life they've not known enough. I have medicine that isn't a cure, but I'll take it. Modern medicines mean that modern folks with MS have a much better quality of life than folks that didn't have medications. I'm more likely to have mobility and things like that. I'll take it. My ex was schizophrenic. Medicine gave them a life. They still couldn't work, but they weren't suffering as much either. Again, not a cure, but help. Imperfect cures or medicines that treat the symptoms are so much better than no help at all. This is where a lot of medicine starts - treating a symptom, and by doing so learning a bit more about the disease or affliction. reply bloqs 1 hour agoparentprevThats exactly what existing psychomotor stimulants do for adhd reply whimsicalism 17 hours agoprevReveals developmental origins or merely an observational study of metabolites in children? reply Der_Einzige 16 hours agoprevI know of at least one book written by and for autistic people who advocates for a gluten free diet. They claim in the book that this significantly reduces their symptoms. I don’t know if I believe it or not, but the notion of gut-brain axis seems to imply that a good diet should help a bit, right? reply r3trohack3r 15 hours agoparentAnecdotal, but we grow a heritage strain of wheat here in PHX (Sonoran White). Its appearance gives me pause. Common commercial wheat is very short in comparison. I have a friend who can’t eat “common” wheat products from the grocery store, having been diagnosed with severe gluten intolerance, but can eat Sonoran White without symptoms. You can follow the same exact recipe but substitute Sonoran White flour for standard flower, and they can eat the final product. I have absolutely no research to support my stance here. But given gluten intolerance is, from my understanding, a microbiome disorder. And Sonoran White grows tall and requires less pesticide/herbicide/fungicide, while common commercial wheat grows low to the ground and the head of wheat sits stewing in a bath of herbicide/pesticide/fungicide - I suspect the difference between the two strains’ impact on the microbiome is less genetic and more environmental. ADHD research is showing similar early correlation between a mothers’ diet and the rate of ADHD (particularly caffeine consumption). I have a similar belief here that ADHD correlates with caffeine consumption because caffeine is often consumed in liquids containing additives that disrupt the mother’s microbiome. I strongly suspect that, over the next 100 years, we are going to find that we’ve been waging war on the human biome through food preservatives and environmental contaminants. And that many common chronic disorders/illnesses (including ADHD, Autism, weight gain, etc) in our generation are actually attributable to a disfunctioning microbiome. reply squigz 12 hours agorootparent> And that many common chronic disorders/illnesses (including ADHD, Autism, weight gain, etc) in our generation are actually attributable to a disfunctioning microbiome All of those things have existed for ... ever reply asdfman123 3 hours agorootparentThat's absolutely not true. Diabetes for instance used to be extremely rare and limited to the elites. And, for instance, ADHD probably isn't a disorder if you live a very simple life and do manual labor all day. No hyperactivity, no DMV appointments, and your life is decided for you. Remember, all the lines are drawn arbitrarily and something is labeled a disorder when it doesn't work with our (very strange) modern world. Can't comment on autism though, and this is not directly about micro biome obviously. reply cja 3 hours agorootparent\"ADHD probably isn't a disorder if you live a very simple life and do manual labor all day\" Why? reply ikiris 3 hours agorootparentprevBecause they died... This is like reading that seatbelts cause head injuries. reply r3trohack3r 12 hours agorootparentprevThey have. But I do not believe they were as common prior to the 1960s as they are in the 2020s. reply superb_dev 8 hours agorootparentWere they less common, or unknown/heavily stigmatized? reply TylerE 5 hours agorootparentAnother confounding variable is that we got so much better at testing many things that we have people living long enough to clearly manifest problems that may not have decades or centuries ago. Sort of like how a big part of the increase in cancer deaths are people living long enough to die of cancer. reply yareal 3 hours agorootparentprevIn the 1960s you had to learn to mask your differences or you would suffer violence directed at you. We used to beat kids for not behaving in the ways we expect. Get enough beatings, you learn to hide the thing that gets you beat. I'm not at all convinced it was less common back then, just more hidden. reply squigz 9 hours agorootparentprevDo you have data to inform that belief? reply r3trohack3r 7 hours agorootparenthttps://www.econstor.eu/bitstream/10419/80491/1/cesifo_wp436... https://pubmed.ncbi.nlm.nih.gov/37156255/ https://www.ncbi.nlm.nih.gov/pmc/articles/PMC9947250/ reply aitchnyu 14 hours agorootparentprevWhat is referred to cuisine today is partly preserving food in bacteria killing chemicals. Do you mean to hypothesize people ingesting more (traditonal) bactericide are sicker? reply imtringued 2 hours agorootparentPeople who take antibiotics usually have to temporarily take probiotics afterwards to restore the bacteria they lost. reply mandmandam 14 hours agorootparentprev> I strongly suspect that, over the next 100 years, we are going to find that we’ve been waging war on the human biome through food preservatives and environmental contaminants. And that many common chronic disorders/illnesses (including ADHD, Autism, weight gain, etc) in our generation are actually attributable to a disfunctioning microbiome. I suspect you're very right, and I further suspect that there's already research proving this that has been shelved and hidden behind NDAs by the people profiting from this, just as with big tobacco and big oil and big agri etc. reply __turbobrew__ 6 hours agorootparentThere is a very strong inverse correlation between obesity and elevation above sea level, the higher you go the thinner the people. One of the thoughts is that environmental contaminates are in higher concentrations the further down the water cycle you go, and these contaminants cause obesity. reply TylerE 5 hours agorootparentThere’s a much much simpler reason. Living at altitude is hard. People who are out of shape move away. reply steve_adams_86 5 hours agorootparentI’m not sure it’s so simple. Socioeconomic studies indicate that the worse shape you’re in, the less social mobility you are likely to have. Moving on a whim might not be possible for many of these people. On the other hand, contaminants concentrating further down stream is a known phenomenon and we known we’ve inundated many places with hormone disrupting substances. It doesn’t seem all that complicated or far fetched. Both could be factors, and I’m not aiming to be contrarian so much as investigate the possibilities a bit. It’s an interesting topic reply kridsdale3 12 hours agorootparentprevI fully intend to get my new kid on Kimchi once he moves to solid food-eating. reply Aurornis 6 hours agoparentprevThe short answer is: No, there isn’t a simple treatment for Autism based on simple diet, lifestyle, or supplement changes. There are countless books, blogs, and social media influencers claiming to have unlocked something, but it never translates to something broadly useful. There’s a long history of these claimed fixes. They follow popular trends that come and go. They’ve been attached to everything from eliminating dyes and food colorings to every possible alternate diet out there. Placebo effect is a large part of it. People feel better when they feel like they have some control over their condition. They buy into the popular narrative and then they really do feel better, even if nothing has actually changed physically. It’s also common for people with major medical diagnoses like Autism to start thinking that every one of their symptoms is attributable to Autism. Some of these people might have gluten intolerance as a separate issue, so going gluten free improves a number of issues for them. Instead of attributing the improvement to improving their gut problem, they assume they have treated their Autism. reply carom 8 hours agoparentprevThere are studies showing positive health outcomes for ASD on a gluten free diet, as well as for epilepsy and schizophrenia. Here [1] is a comment with some links, the featured article might also be interesting. I have a lot of food allergies and a restaurant in Maryland that specializes in restricted diets pointed some of the research out to me. You can find scores of families with ASD children who have found dietary interventions to be beneficial. The studies I have seen talk about something called exorphins, it sounded like people with ASD's bodies treat gluten like an opiate. 1. https://news.ycombinator.com/item?id=39194978 reply asdfman123 3 hours agoparentprevI'm hardly an expert on autism but I've fought ADHD for years, and good diet/lifestyle is essential. Not sure how certain you are of your autism diagnosis, and I'm still not even sure where the line of demarcation is, but it may actually be ADHD. Worth considering. reply jl6 16 hours agoparentprevA gluten free diet may or may not help but it’s not synonymous with “a good diet”. reply 0xcde4c3db 16 hours agorootparentAnd it might also help for reasons that have nothing to do with gluten. Almost any major dietary restriction tends to cause broader changes in diet than just the thing that is restricted. reply dkga 15 hours agorootparentprevIndeed. ASD or not, everyone would surely benefit from following a nutritionist-set diet based on the person’s own requirements. reply nradov 6 hours agorootparentNah. Most \"nutritionists\" are clowns. Anyone can call themselves a nutritionist with no formal training or certification. The whole field is mostly filled with frauds and grifters. There are some legitimate people with a Registered Dietician credential who can work as part of a care team to treat medical conditions. But most of us don't need them either. We know what we're supposed to eat, we just don't do it. reply TylerE 5 hours agorootparentExactly. No point in playing someone to tell me to eat more leafy greens. reply Der_Einzige 16 hours agorootparentprevThat’s what I thought too. It seems that the only general lesson we have in dieting which js reliable is “refined sugar bad” and that intermittent fasting works for getting blood sugar under control. reply RobotToaster 16 hours agoparentprevGut issues are a common comorbidity with autism, it could just be he had some kind of gluten sensitivity and treating it allowed more energy to compensate for autism. reply TylerE 5 hours agorootparentThe other really big comorbidity one is ADHD - I’ve seen claims that the rate is high as 80%, maybe even 100% if you allow for very mild cases that probably wouldn’t be independently diagnosable. reply Waterluvian 15 hours agorootparentprevWhen “comorbidity” is used in this context, are we actually referring to people dying because of it? Or does it just mean “are found together when discussing this disease?” reply RobotToaster 15 hours agorootparent> Or does it just mean “are found together when discussing this disease?” this. \"morbid\" is from the Latin root \"morbus\", meaning sickness. reply Waterluvian 15 hours agorootparentAhhh okay. My mind had catalogued it to mean death. reply toasterlovin 14 hours agorootparentIn common use (\"don't be morbid\", \"that's morbid\") I agree that 'morbid' has a connotation of death, so I don't think your understanding is wrong. In this case, a 'co-morbidity' is a term of art in the medical literature with the specific meaning of \"occurring with\". reply selimthegrim 14 hours agorootparentprevHence’s the CDC’s “Morbidity and Mortality Weekly Report” reply discretion22 15 hours agorootparentprevThe Latin morbus is disease and mortis is [of] death but my experience - and perhaps yours too - is that when discussions of morbidity (i.e. using the word morbid/morbidity) arise, they are often in the context where someone is near death or has died so it is a natural linguistic connection to make. Remarkably often I find my partner has a different understanding of English words from me - she was schooled in French and can communicate in Italian and Spanish, but is also fluent in English (though spoken with French mannerisms which seem odd to me as a native English speaker). We often find we descend into discussions of the most correct meaning of a word in English which has a Latin root. The dictionary agrees with her mostly but I have an occasional win. reply lynguist 3 hours agorootparentWhat are some of your word examples? I recently learned that we use triumph to mean victory, but triumph was originally the ceremonial parade after a military victory. reply quodestabsurdum 15 hours agorootparentprevComorbidity is a commonly used term to denote that a condition occurs with another condition. In this case you can think of it more like \"co-occurs\". reply zeroonetwothree 15 hours agorootparentprevMorbidity doesn’t mean dying… reply dkga 16 hours agoparentprevAsperger here, who doesn’t eat gluten at all for almost 3 years now (due to allergy). I cant say it improved symptoms of autism but my life is divided between before/after stopping gluten consumption. I feel like I just started living for real. reply switch007 16 hours agorootparentInteresting. Could you expand? reply m00x 16 hours agorootparentprevCeliac is an awful disease. My ex has it and it wrecked her life for years until she found out. reply pfannkuchen 9 hours agorootparentI didn’t realize that gluten could use the internet. reply anon84873628 16 hours agoparentprevWell as the article says: \"Metabolism is the language that the brain, gut and immune system use to communicate, and autism occurs when the communication between these systems is changed\" So it's not unreasonable that for some people, dietary interventions can have some effect on this interplay between systems. Mostly a just a random \"YMMV\" shot in the dark at this point. But hopefully as this research advances, more targeted and predictable treatments will emerge. reply zamalek 13 hours agoparentprevGluten-free only makes a difference for those with an intolerance. Source: I am HF-ASD, my wife is gluten intolerant so my gluten intake is sporadic but bingey, gluten does nothing at all to me. The only food that is objectively bad for every single human is processed food. Gluten tends to be processed, so people who needlessly go gluten-free may be incorrectly attributing improvements to that. Also: if you're not actually intolerant, there is a high chance you're eating gluten without knowing it. Treat yourself to fast food fries? How sure are you that gluten (crumbed chicken) wasn't fried in the oil? reply faeriechangling 12 hours agoparentprevI'll incidentally mention that gluten-free diets tend to incidentally be lower in FODMAPs which are another gut intervention, and autism has LONG correlated to digestive and dietary issues. Ketogenic/low-carb is also popular. The gut-brain link I'm aware of three major theories. Gut issues could be causing a disorder of the brain. A disorder of the brain could be causing disordered lifestyle habits (Diet, exercise) causing digestive issues. A disorder of the brain could directly impacting digestive function. I will however say, I would treat claims about the gut-brain axis and autism with the utmost scepticism as disgraced doctor Andrew Wakefield, who popularised the link between the MMR vaccine and autism to personally financially benefit from an undisclosed patent on a measles vaccine using fraudulent research, was a gastroenterologist and later anti-vax influencer who ended up popularising the gut-brain link of autism particularly among those who distrust scientific institutions. He notably influenced Jenny McCarthy who became a noted alt-medicine momfluencer in the '00s/'10s pushing gluten-free and anti-vax. Which is to say, research on the gut-brain link is done quite a lot by legitimate scientific researchers, quacks, and frauds alike so you have to be discriminating. Additionally there have been various scientific reviews of dietary interventions, gluten-free being one of the most researched, and the evidence hasn't been shown ANY dietary intervention or gut intervention like fecal transplants is a silver bullet. This isn't to say that there isn't anything to the idea that some people we've diagnosed as autistic or believe they're autistic, cannot be helped by dietary interventions. I would dare speculate, that a significant portion of those called \"autistic\" could make autistic symptoms fall into the sub-clinical range through gut interventions (diet AND exercise), and that such people may even be clinically distinct from other people considered autistic other than through their similar behaviour. reply imtringued 2 hours agoparentprevDigestive issues like IBS probably make anxiety worse but they don't cause the problem. reply yareal 3 hours agoparentprevAs an autistic person, professionally diagnosed, this sounds like nonsense woo. Yes, gut bio can influence moods and managing your health can improve symptoms from autism (e.g. meditation might help manage anxiety). But no amount of \"don't eat bread\" is going to help me understand faces or social cues. A good diet might help with self esteem, overall energy levels, and resilience to my symptoms (if I'm healthier, I shut down less). But that's it, it's not going to change the way I experience the world, just stretch my tolerance for it. reply AnEro 17 hours agoprevI feel like this is going to be used by pseudo-science influencers to push trendy diets to prevent autism when this study is observations stage at best. reply throwup238 16 hours agoparentThose people often link to papers that directly contradict the claims they make, assuming no one is going to check them. This won't make a difference. reply AnEro 13 hours agorootparentyea example now there are guys in this comment section claiming keto has cured their adhd/autism. Helped reduce symptoms, sure, but cure? (I've got both of them been on keto, like crazy strict ensuring i was in ketosis every two days type, and it only reduced brain fog personally) reply ryandrake 13 hours agorootparentWhenever you get an HN story that even remotely brushes up against health, fitness, or nutrition, you inevitably get all the wacky exercise, supplements, and diet commenters coming out of the woodwork to tell you all about \"what worked for me\". It's a constant that you can 100% count on every time. reply grumpy-de-sre 22 minutes agorootparentYou can also add agriculture to that list, apparently we should give up the wins of the green revolution and go back to living in this idealized world of Permaculture food forests and tree houses (George Monbiot has some great takes on these ideas). I really wonder why HN goes off the rails when these topics come up. Is it just a weak science education, combined with the relative accessibility (and acceptability) of health/fitness/exercise self experimentation? Though I also see gut microbiome discussions being shoehorned to any discussion in this space aswell. I guess I just don't get it, probably the 'tism. reply asdfman123 17 hours agoparentprevFor stuff like this, overfitting is a given. reply 0xcde4c3db 16 hours agoparentprevProbably, but it's hardly a requirement. There have been some doing it for decades, partly fueled by Wakefield's \"autistic enterocolitis\" pseudoscience and partly the usual organic/vegan/raw/paleo/keto bullshit. reply drewcon 16 hours agoparentprevMy only and immediate reaction as well. reply dylan604 16 hours agoparentprevDoes this mean that they'll start getting their kids vaccinated? reply AnEro 13 hours agorootparentI fear it will be both that crowd and the anti-covid vaccine blind trust of joe rogan guest crowd reply lettergram 9 hours agoprevYou know… this sounds a lot like “vaccines cause autism” crowd is up to something. Most vaccines are effectively laced with a chemical or biologic that the body will respond aggressively to. In turn, this teaches the body to respond to the virus that’s injected at the same time in an aggressive way. That same mechanism would by definition trigger the cell danger response. reply imtringued 1 hour agoparentMeanwhile African countries are still waiting for a vaccine against Malaria to be delivered to them. The only people who dislike vaccines are those who live in a world where vaccines are so successful they no longer have to care about the problem the vaccine is solving. reply bloqs 1 hour agorootparentI think this is a true statement, but the lack of further comment is in itself a value judgement. The only people who dislike vaccines, are people who felt lied to, or were forced to take them. Their concerns may have been invalid in some instances, or even most instances, but the fact remains that at least a few of their concerns were valid. reply greenavocado 9 hours agoparentprev> Most vaccines are effectively laced with a chemical or biologic that the body will respond aggressively to Aluminum, btw https://www.educate-yourself.org/cn/Aluminum-Toxicity-Is-Wel... reply lettergram 9 hours agorootparentYeah that’s one of them. There’s also often mercury - https://www.cdc.gov/vaccinesafety/concerns/thimerosal/index.... I actually had a similar theory as to where egg allergies come from. Many vaccines have egg in them https://www.cdc.gov/flu/prevent/how-fluvaccine-made.htm reply greenavocado 9 hours agorootparentI thought mercury isn't used anymore in vaccines? reply lettergram 8 hours agorootparentStill used, just not recommended in vaccines for children under 6 https://www.fda.gov/vaccines-blood-biologics/safety-availabi... reply thsksbd 8 hours agoparentprev\"Most vaccines are effectively laced with a chemical or biologic that the body will respond aggressively to\" Adjuvants to be exact. They're actually what Im annoyed at the most with (traditional) vaccines. reply ldjkfkdsjnv 16 hours agoprevUsed to have a mix of what could be considered ADHD/light asperbergers. I dont eat carbs and mostly stick to a keto diet, it resolved many symptoms. Our food is poison reply ffjffsfr 15 hours agoparent> what could be considered ADHD/light asperbergers could be considered, or did you get a diagnosis from a specialist? Self diagnosis is not reliable. If you don't have an official diagnosis you can't be certain you really have ADHD. There may be several differe tfactors relevant for YOU that make keto diet work for you. Same diet can be harmful for similar people who have ADHD. reply throwaway092323 14 hours agorootparent> Self diagnosis is not reliable Professional diagnosis is not reliable either. ADHD and autism are often misdiagnosed as one-another, especially in girls. > If you don't have an official diagnosis you can't be certain you really have ADHD A lot of the time, the mental health professional making the determination doesn't have specialty in ADHD/Autism. All they're doing is looking at symptoms and making their best guess. Which is exactly what people are doing when they make a self-determination. In many cases, people with high-functioning autism know more about autism than the people who are supposed to know. And it's not like the diagnoses can be validated when we're still figuring out what autism even is. reply cja 3 hours agorootparentProfessional assessors should know much more about the condition for which they are assessing and its signs than any one person who may or may not have the condition. A professional should also know the other conditions with similar symptoms. I learned about ADHD for six months until I first consulted an expert about the possibility of my having it. He was able to recognise symptoms in me that I hadn't noticed. reply bluecalm 13 hours agorootparentprevIf you knew anything about how \"diagnosis from specialist\" works in practice you wouldn't dismiss self dismiss diagnosis so easily. \"The specialist\" usually spend a few hours at most on the diagnosis (if even that) while people who self diagnose live with the symptoms their whole life. It would be such an easy world of you could go to a doctor and get answers but it's not the world we live in unless it's common cold (and even then a lot of doctors can't be bothered and prescribe antibiotics just in case). reply ldjkfkdsjnv 15 hours agorootparentprevI have a diagnosis, i just dont trust doctors. please stop gaslighting me reply imtringued 1 hour agorootparentYou gaslighted yourself by claiming you don't have ADHD/aspergers anymore. The only explanation is that you either never had it, which is closer to what you said or that you still have it, which is ignoring what you said. reply 2four2 16 hours agoparentprevLots of carbs make me fall asleep and kill my motivation. My lunches at work are light and carb-free for that reason. reply manmal 16 hours agoparentprevDo you have microbiome dysbiosis? A keto diet might improve things (eg lower LPS production), but long term can diminish microbial diversity. I’m not saying keto is bad at all - it’s just that microbial diversity is an important predictor in GI health and one should keep an eye on that too. reply ldjkfkdsjnv 16 hours agorootparentYeah i mean i know that keto isnt great, but it has changed my life to some degree. When in ketosis, i feel like i have \"agency\", otherwise i am this foggy headed, sloth reply hailruda 13 hours agorootparentI can relate to this. Could you point me to any resources about keto diets? reply eadz 2 hours agorootparenthttps://www.metabolicmind.org is a non profit, with many MDs and PHDs dedicated to researching the link between metabolism and mental health, with a focus on keto diets. reply electrondood 16 hours agoparentprevI'm Broad Autism Phenotype (BAP) and prefer low carb because I feel better, but it doesn't change my personality traits or cognitive tendencies one iota. reply ldjkfkdsjnv 16 hours agorootparentI have a noticable ability to react quicker in social situations, im more \"normal\". Otherwise my brain is sluggish and i struggle to maintain conversation/things go over my head reply b800h 16 hours agoprev\"with only 10–20% of children diagnosed before 5 years of age able to live independently as adults\" > Well this is nonsense for starters - circular logic. Doctors won't diagnose autism in most cases before the age of eight. For the diagnosis to have happened before the age of five would imply that the case is profound in the first place. reply willsmith72 16 hours agoparentThat's the whole point. It's not like they took the age 5 at random, it's literally what was used in the study reply ffjffsfr 15 hours agoparentprevthere are other factors here. Children diagnosed with autism at the age of 5 must be adults now to determine if they can live alone. So they were diagnosed at minimum 13 years ago, with many diagnosed much earlier. Autism diagnostics is much more common now than it used to be, especially in families with higher economic status. Diagnostics tools evolved, more kids are tested and tests capture more kids. So I think this number will be completely different in 10-20 years from now. In my experience as a parent of ASD kid, many kids now considered ASD would not be considered ASD 20 or 30 years ago. reply piker 16 hours agoparentprevThe stat seems accurate on that basis. True, it may be read to imply more. reply hcfman 3 hours agoprevYay! We can prevent another brilliant scientist from coming into existence. Nice work fellows! reply ModernMech 16 hours agoprev\"Prevention strategies\" As an autistic person, no thanks. Let people be autistic. reply shipman05 15 hours agoparentI understand the sentiment, but there's a reason it's called the autism spectrum. I work with several software engineers with autism who are as capable as their peers. Sure they may have behavioral quirks, but not significantly more so than the normal variation in human behavior. Their brains don't seem to work in an inferior or problematic way, just different. On the other hand, I have a close relative with more severe autism who could never read and understand this article, could never type a comment such as yours. She's incapable of holding a job or living on her own without assistance. Her mother passed away young, and her older sister, just 19 at the time, had to take on the responsibility of being her sole caregiver, and she will have that burden for the rest of their lives. For some it may be a different variation of the human experience, but for cases as severe as my relative's, I find it hard to believe that a cure or prevention for autism wouldn't be a massive quality of life improvement for all involved. reply mewpmewp2 8 hours agorootparentThe problem is there's no such thing as \"Autism\". It's a survey and observation of behaviors that \"oh you don't quite behave like we see 90%+ of people to behave socially, so you must have a disease. Let's call it autism.\" You are talking as if Autism was some sort of virus that you catch and it disables some people a bit, and others a lot. Some people have hard time, then deal with those people and help them, based on the symptoms, but don't say you have to prevent some made up label to group certain set of behaviors which many are perfectly happy to be with those set of behaviors and perhaps even proud to be thinking differently than most. reply jskdndbwkd 8 hours agorootparentprevor maybe your successful coworkers and your close relative have two completely distinct conditions that don’t actually exist along a continuum reply ModernMech 15 hours agorootparentprevIndeed, my ex wife was incapable of living on her own or holding a job. I have a whole social circle of autistic friends of different abilities. Some still live with their parents. Men in their 40s living with their parents. Women who left home for the first time at 30 only to have to move back within months. My one friend is a sex worker because she can't hold down a real job. She sells her meds and her body to get by. I lived with my parents last year, at 36, but I moved out and got a 1 bedroom. It was touch and go for a while, I still can't cook for myself, but at least I can take care of my cats. I'm never going to have children. I'm never going to have a house. A family like my parents had. My sister as well, well she just got a boy friend so maybe not. The through line problem here is not autism. Despite the range of (dis)ability, the thing that makes it a problem is how autistic needs are unmet by a society that expects us to be worker bees. My ability to type this message and read is not a constant. There are times when I am non verbal. There are times when I cannot read because the letters are all jumbled in my head. When I'm able to read and write and speak, society values me. When I'm not, society devalues me. You want to take autism out of the equation so that I can be valuable to society. What I'm saying is that society needs to be reoriented so that autistic people are valued whether or not they can read or write or speak. Although I have to say I'm unsettled by you speaking for someone who can't speak, and deciding unilaterally that \"curing\" them would be a massive quality of life improvement for \"all involved\". Did you ask them? reply MajimasEyepatch 13 hours agorootparent> My ability to type this message and read is not a constant. There are times when I am non verbal. There are times when I cannot read because the letters are all jumbled in my head. When I'm able to read and write and speak, society values me. When I'm not, society devalues me. You want to take autism out of the equation so that I can be valuable to society. > What I'm saying is that society needs to be reoriented so that autistic people are valued whether or not they can read or write or speak. People like to say stuff like this on social media, but I can never quite figure out what they actually mean. Society emerges from interactions between people. If someone can’t communicate, how exactly are they supposed to participate fully in society? All people deserve love and support and dignity regardless of their ability to contribute economically, but I’m curious what this “reorientation” would actually mean in practice. reply ModernMech 9 hours agorootparent> If someone can’t communicate, how exactly are they supposed to participate fully in society? It's not that autistic people cannot communicate, it's that we communicate differently. For example, I cannot talk on the phone. I just can't. I could explain all the reasons why, but I feel very dismissed here so I'm not going to be vulnerable anymore, but suffice it to say it's something I cannot do, and a lot of autistic people cannot do. This means people like us can't have jobs which require a lot of phone communication. Accommodations that would allow autistic people to communicate in their preferred way would lead to greater employment of autistic people, but such accommodations are rarely offered for various reasons. It's other things too. For some people it's lights. For others it's a uniform. For others its noises. For instance, I can hardly go into grocery stores because they play loud music, there's a lot of noises from beeping registers, and the lights are bright and garish. All retailers are like this, and that's where many entry level jobs are. If I can hardly shop there without wearing sunglasses and headphones, then I could never work there because workers are not allowed to wear noise canceling headphones. Then there are people who require service dogs. You'd think that would be a solved issue, but my friend was just denied entry to a place because of her legit service dog, not even an emotional support dog. They said she couldn't have one because she didn't look blind. Then what, she has to explain to some putz about her autism, expecting he'll understand? No, she backed off and went home and now she won't go out again. It took her that much just to go outside and she was turned away by some busybody, so it's back to being a recluse for a bit. And that's another thing, is the world could be a lot more accepting of how ND people identify, that would go a long way too. My friend I just mentioned says that her experience as a transgender person is inextricable from her autism. I'm not sure what she means 100%, but also I do, autistic people have a complicated relationship with gender and sexual identity, and a lot of people are very very against those feelings. Autistic people who are transgender (there are many) have a hard time existing in public life because they are shamed, ridiculed, vilified, beaten, and even murdered for who they are. Do you think it's easy for someone who faces those dangers to be employed? There are many transgender homeless people who suffer as a result. I could go on and on, but all of these things I've listed are ways in which autistic people are marginalized in society, and they don't necessitate \"curing\" autism to fix, or even really reorienting society as a whole. It's not because they cannot communicate, it's because they cannot participate fully in public life. The solution is to just let them participate in public life. To make things better for everyone involved, we can just be accepting of people's differences and not force them all to be one way, and support them when those differences mean they need help to survive. We can afford to do that as a society I think, why not, isn't that the point of the whole exercise? reply sureglymop 4 hours agorootparentI have ASD and a lot of this rings true. For me personally, I can get to quite high levels of \"socialness\" depending on mood and practice. I can get to muster up the courage to do calls, interact more socially, flirt with someone etc. It does take an extreme amount of energy though. Where I think it differs for me, is in that if I don't do this type of \"social training\" constantly, it completely goes away again. If I didn't call my doctor/the post office/relatives in a few months, the ability to just do it normally is gone again and I start from 0. Everytime. My psychiatrist helps me get to that point again but over time has realized that \"exposure therapy\" doesn't really work because every few months we have to start from 0 again. Now having all of that said, for most people these types of interactions and things in life are just... normal. They don't require even a second thought. And that, I would imagine, removes a lot of friction from their lives because these interactions are needed to be a self standing, emancipated, contributing member of society. reply MajimasEyepatch 4 hours agorootparentprevThank you for sharing that. I’m not going to address every example in your comment, and I agree that there are many ways society could be more accommodating. But I also think that not every difference can be accommodated in every situation, even if disability advocates don’t always want to admit it. Some jobs require you to talk on the phone, just like some jobs require you to lift heavy boxes. Not everyone can do that, and that’s ok. I can tell you with absolute certainty that I could not do my job as an engineering executive if I could not talk on the phone or video calls, since so much of my job is about making emotional connections with other people, understanding subtle cues and subtext, and influencing people. I have colleagues who I know are on the spectrum, and I greatly respect them and do try to accommodate them where possible. But some things require a level of social skills they simply don’t have. Beyond that, I have to be honest: reading about your struggles with communication, lights, noise, etc. it’s frankly hard me to fathom why anyone would not want medication that can alleviate those symptoms. I was diagnosed with ADHD in my 30s, and my whole life suddenly made more sense. Stimulant medication dramatically improved my executive function, attention, concentration, impulsivity, etc. but I am still in every way myself while medicated. I am just more in control of myself. I realize there is no medication like that for autism yet, but if there was, I simply can’t imagine someone not wanting it when my life was improved so dramatically by treating my much-less-severe condition. reply fragmede 9 hours agorootparentprevThank you for sharing your story, that's heartbreaking. reply somenameforme 15 hours agorootparentprevThen people should stop conflating the two. This whole \"spectrum\" nonsense is nonsense. Your coworkers are not autistic - they are weird or whatever other more PC term you might want to use, and that's great - many, if not most, great engineers are!. There is no need to pathologize differences in people. Your relative, by contrast, is. If you have a habit of feeling sleepy at work, it's not like we say you're on the narcolepsy spectrum. It's just a completely dumb concept. People like your relative, or the kid who sits around flapping his hand and starts freaking out if anybody interacts with him - those people are obviously not just 'weird'. They clearly have severe mental disorders, and if we want to call whatever it is that they have autism - fine. But if we do, then we need to stop calling people like your coworkers, Bill Gates, or whoever else also autistic. reply Tijdreiziger 14 hours agorootparentI got my autism diagnosis in my early 20s (from a licensed psychologist, before you ask). It was a life-changing experience for me. Suddenly I was able to understand and validate my experiences and shortcomings, and to improve myself based on that understanding, instead of resigning myself to the fact that I’ll always just be a ‘weird’ human with ‘weird’ opinions, feelings and experiences. I suppose though that since a random guy on HN said so, this is actually impossible, and I should just go back to having the entirety of my lived experience dismissed as ‘weird’. Gee, I’m sure glad we cleared that up. reply sureglymop 4 hours agorootparentSame here. After a diagnosis, one is able to give in and learn how to cope with it instead of fighting it, struggling and letting it lead to self deprecation. Strategies and research about it aside, the fact that one can come to \"accept\" oneself despite that condition is very important for general mental health. I still wouldn't wish it on anyone but personally I'd always accept my self as a valid human with a valid life despite that. reply MajimasEyepatch 13 hours agorootparentprevThere’s this thing people online tend to do where they’ll take a well-defined word or phrase like autism spectrum disorder and just decide that it actually should mean something else and get mad when everyone else uses the word in the “wrong” way. It consistently derails conversations, and it almost never brings anyone around to a place of greater understanding. reply cubefox 15 hours agorootparentprev> Autism is known as a “spectrum” disorder because there is wide variation in the type and severity of symptoms people experience. https://www.nimh.nih.gov/health/topics/autism-spectrum-disor... reply rjmunro 15 hours agorootparentprevThere is a continuous range of people in between. Where do you draw the line? reply somenameforme 15 hours agorootparentThis is like asking where to draw the line when somebody is bald. Are you bald if you have 1 hair? Yes. 2? 3? 137? There's of course reasonable room for discretion in saying what is or isn't bald. But it isn't reasonable to say somebody with a full-on afro is on the spectrum of being bald. Literally some of the most high functioning and successful individuals are being diagnosed as \"on the spectrum\" of what is, in its \"real\" form, a completely crippling and disabling condition that yields individuals who would have simply been classified as mentally retarded in the past. This is just completely nonsensical. reply pseudalopex 12 hours agorootparentMany people are on the balding spectrum. reply shermantanktop 12 hours agorootparentYou could say that we all lose our hair eventually. Some of us are just temporarily hirsute. reply cubefox 13 hours agorootparentprevWhat you call \"real\" form is just a strong form, and there is no clear line to draw between real and not real autism, or between \"completely crippling\" and \"not completely crippling\", etc. reply abigail95 8 hours agorootparentprevAutism is defined by social communication and restrictive behavior - not functioning, why are you so caught up on the functioning side of it? reply Perenti 2 hours agoparentprevI'm diagnosed ASD as well and I strongly disagree with your statement as it stands. There are people who are profoundly impacted by autism. I _can_ go to a shopping center. I don't like it. I may have to hide in the bathrooms for a while a few times while visiting but I _can_ do it. But I know people who spend most of their lives in fear, because there is just so damn much going on around them all the time. Their senses are turned up to the point that the sound of their own breath is like a lion roaring. The splash of light across the curtains as a car turns into the street is like a lightning flash. Sounds, sights, flavours, smells, tactile sensations all turned up to 15 on a scale of 1 to 10. Often these kinds of people never learn to talk, or read. They end up living in homes (modern asylums) because they need constant care. And inside they're screaming in terror all the time. Sometimes they scream aloud. I believe these people deserve better. Helping prevent the development of severe disability is what I believe the article is talking about, not eugenics. reply 2four2 16 hours agoparentprevAutistic as an identity and autism as a disease are different things that are difficult to uncouple. Similarly to obesity, it's difficult to talk about the health aspect without people being sensitive about the identity aspect. I find it's useful when reading about research to empathize with the authors and realize their work is an attempt to be constructive instead of providing social commentary. reply ModernMech 15 hours agorootparentI'm being productive by pushing back and saying that when people say that autism needs to be cured and prevented, that they shouldn't say that, because autism doesn't need to be cured and prevented. It's not a disease, but in this society it is a disability, and there's a stigma and lack of understanding around autism in general. What we can do today to make life better for autistic people everywhere is to spread awareness and acceptance of autism. Not talk about curing and preventing it. That's stigmatizing. reply anon84873628 15 hours agorootparentOf course society should become more accepting and accommodating of differently-abled people of all types. But can you really look at the extreme end of the Autism spectrum and say that isn't a disease or disorder? One reason we need this fundamental research is to disentangle the different types of afflictions and give them different names. reply MajimasEyepatch 13 hours agorootparentYou don’t even have to go to the extreme end. Ask people with milder presentations, and they’ll be able to tell you about all sorts of confusing interactions and frustrating situations they’ve experienced that wouldn’t have happened if they were neurotypical. Hard to say that doesn’t impact their quality of life. reply mewpmewp2 8 hours agorootparent> You don’t even have to go to the extreme end. Ask people with milder presentations, and they’ll be able to tell you about all sorts of confusing interactions and frustrating situations they’ve experienced that wouldn’t have happened if they were neurotypical. Hard to say that doesn’t impact their quality of life. Sure, I had rough childhood, but looking back, I wouldn't want to be someone else. The way my brain focuses and optimises for certain ideas actually benefits society if the environment is correct. There's only limited amount of processing power anyone can have. I just have less points for social and more for other areas that others don't have. Yet society expects us to normalize or consider it a disease. I'm now very successful and extremely proud where I have reached in life. In my childhood I used to question why people didn't like me, if I had myself from now to guide myself, and create an environment for myself, I'm sure I would have had 100% happy childhood. And I know what and how to do if I ever had someone like myself as a kid, and it's not a disease. The reason my childhood was terrible was EXACTLY because of expectation that everyone should behave like X, and that was just not me. So everyone tells me I have disease that needs to be fixed. It's disgusting. I didn't finish high school because of all the issues I had, and spent years in depression, but as I happened to finally land in an environment that appreciated my differing thinking I was able to do exactly what my brain is suited for and make 8x+ average income in my area. I had passion as a kid, interest in weird things, but school and the social environment killed every little bit of it. reply WA 1 hour agorootparent> I had passion as a kid, interest in weird things, but school and the social environment killed every little bit of it. As a parent of an autistic kid: How would you cultivate that? Our son is autistic, he is 8 years old. He started to hate school. All he cares for is Minecraft and Magic: The Gathering. It's a bit sad to see that he seemingly drowns his curiosity by immersing himself mentally only in these two topics. I wonder if there's a way to guide him to develop interest in other topics. Any recommendations? reply imtringued 1 hour agorootparentMake him play a Minecraft mod pack like Nomifactory or Gregtech horizons and an economic simulation game like prosperous universe. Use that as a stepping stone to increase his interest in architecture, computer science, mechanical engineering, chemistry or aerospace. https://m.youtube.com/watch?v=jYSfDcbY0w0&pp=ygULbm9taWZhY3R... reply ModernMech 9 hours agorootparentprevIt's true, miscommunication and misunderstanding, as well as stigmatization can lead to situations where autistic people are hurt or even killed. This happened recently with Ryan Gainer, who was killed by police after he charged at them with a gardening tool during an autistic meltdown. But as you said, we should ask people with milder presentations, and listen. While they may impact quality of life, I don't see any autistic people here or in my communities calling for a \"cure\" to deal with such problems. We made a big deal of Autism Acceptance and Awareness Month, which was April. There is no autism prevention movement, unless you count Autism Speaks, which is considered a hate group within the autistic community. reply squigz 9 hours agorootparent> I don't see any autistic people here or in my communities calling for a \"cure\" to deal with such problems. Then you should step a bit outside of your bubble. It's very common in the autistic community - and the neurodivergent community at large. reply wizzwizz4 8 hours agorootparentWhich \"autistic community\" are you talking about? Do you mean \"parents of\" Facebook groups? reply squigz 7 hours agorootparentObviously I'm a spokesman for Autism Speaks. reply ModernMech 5 hours agorootparentI agree, I'm always happy to step out my bubble. That's why I'm here on HN -- this is not a safe place for autistic people. That said, it was not obvious to me you are a spokesperson for Autism Speaks. reply yareal 3 hours agorootparentPretty sure the person you are responding to is just being an asshole, inadvertently demonstrating your point that this isn't a safe place for autistic people. reply squigz 1 hour agorootparentI was only responding in kind. And I'm autistic myself, so. Honestly, the only hostility toward austitic people I see around here is the person invalidating and ignoring the opinions of others within the autistic community. reply selimthegrim 5 hours agorootparentprevI believe their tongue is firmly planted in their cheek. reply pseudalopex 11 hours agorootparentprevThose experiences wouldn't have happened if the autistic people were medicated to neurotypical or neurotypical people were more accepting of autistic people. And many autistic people would reject being medicated to neurotypical despite those experiences. reply yareal 3 hours agorootparentprevWhy is that the autistic person's problem? I'm autistic, I broadly agree that eliminating autism is a negative for individuals and for society. Maybe the difficulties are things we should address as a society, rather than seeking to eliminate a class of people. reply faeriechangling 10 hours agorootparentprevI can. When I look at extremely functional autistics like Elon Musk, the idea he has a condition which makes him diseased and disordered is absurd. I think the natural reaction to that is that either diagnostic criteria should be narrowed and/or it should be possible for people to lose their diagnosis if they achieve Elon Musk levels of functioning. -OR- Autism should be viewed more neutrally, as people of a certain type who are more susceptible to disease or disorders but to not necessarily have them. reply fragmede 8 hours agorootparentDo you have a personal relationship with the man? We're all well aware of his public persona but that has nothing to do with how it is to actually interact with him as a person. Or any other autistic person. Watch Hannah Gadsby: Nanette and realize that you don't see the failures, only the successes. reply ModernMech 9 hours agorootparentprevElon Musk is highly functional but he also has a wide and deep support network unlike most other autistic people. He self immolates all the time and he's propped up by his great wealth. He self medicates with drugs. He has a team of people who handle his every need. When normal autistic people self immolate as such, they are cast from society forever - fired, locked up, abandoned, or even killed. And just because someone is high functioning today, it doesn't mean they will always be or always have been. reply AnthonyMouse 7 hours agorootparentNot only that, consider the societal advantage of this behavior. Many social rules are wrong and group-level maladaptive. Having a subset of the population that doesn't adhere to those rules benefits society by allowing it to break out of local maxima. It's not a tendency we should suppress. Punishing people for non-conformity is the act of a villain. And yet we do, so that only people with wealth can survive doing it. reply Scarblac 15 hours agorootparentprevThis is about people diagnosed before the age of 5, they're almost all cases of severe autism. That's very different from the kind of autism you're talking about. People who are permanently unable to live independently have a condition that should be prevented if possible. reply faeriechangling 10 hours agorootparentI was diagnosed at 4, I have legal paperwork proving I permanently cannot live independently, as such paperwork is necessary for impoverished families and adults to access certain social and financial benefits. I currently live independently. Despite me being in this category you describe, I do not believe I have a condition that should be prevented if possible. I see researchers like FTA as having a conflict of interest - as wanting to portray themselves as the saviours of those shackled by their metabolism - which is best done by painting the saved in as negative a light as possible. I believe that I've been unfairly defamed and stigmatised by the medical establishment spreading lies and half-truths of convenience to promote the need for the general public to finance schemes to cure this horrible condition and take care of desperate children and families. I've dedicated my life towards enabling others from a trap of dependance caused by poverty specifically, because what else can I really fucking do to change perceptions besides being one person who enabled several others to live independently? Yet it's not enough. So that's why I come into hacker news threads, throwing shade on the general concept of \"Autism\", a homogenous condition which caused by concrete biological phenomenon, and our need to cure it. Since to me, it was and always has been, a behaviourist diagnosis of clinical convenience there to serve social ends which gets reified into essentialist bullshit featuring an overbroad label defined by \"deficits\" that is taken far more seriously than the science warrants which dooms people to stereotyped perceptions, pathologisation, stigmatisation, segregation, eugenics, and warped medical care. If something should be prevented it's doctors inane, fatalistic, and biased prophecies that somebody will never be able to live independently. It's not proven somebody cannot live independently until they die as dependants, what you describe are only opinions. I have refuted N=1 such opinions already and that won't be the last one. reply Perenti 2 hours agorootparentThe level of severity being discussed here is non-verbal, screaming all the time, just in a state of abject terror. These people have _severe_ ASD. reply ModernMech 15 hours agorootparentprevAs a spectrum, autism presents in many ways, but it's all considered \"autism\" at this point. There are not different \"kinds\". Sometimes \"severe\" autism at an early age calms down as a person grows. Sometimes \"mild\" autism gets worse as someone becomes dysregulated and overstimulated. Many times autism is missed in women and POC because they mask more readily than boys. Sometimes it's missed in boys because it's explained as \"boys being boys\". Either way, why don't you ask autistic people if they want to be \"cured\" or \"accommodated\"? I think you'll find the answer is \"accommodation\". It seems like, to me at least, it's only not autistic people who talk about \"curing\" autism, as if they'd be doing the world a favor if there were no more autistic people. reply Scarblac 12 hours agorootparentI have autism myself and so do both my kids, I would love it if there was some way to lessen it. It's a great hindrance for me, all the time I want to do things that I feel I should be able to do, but then run into various walls. My children (15 and 10) are learning about themselves but they haven't found an advantage of their autism yet. But, we function well enough, I can hold down jobs and so will they, it's a set of things we're not good at but we can deal. The severe cases I know, I have never heard them utter a word, or leave the house on their own. They live in a world inside their heads. I really can't see what they have as the same as what I have. reply ModernMech 9 hours agorootparentThank you for sharing your experience, I agree there are so many walls! I guess for me, I can't even perceive of a state of mind which would not see the walls. And I worry... what would change about me if I could see through the walls? Would I still be me? Because I like me, so I wonder what would happen. My great fear when I hear talks of a \"cure\" is that it will be used as an excuse to cleanse ahem I mean \"cure\" people like me and you and your sons. So you can understand why I don't want to go down that road. It's been done before. Although I can't conceive of a world where I can see through the walls, I can picture a world where the walls are not there, and that's what I advocate for. > I have never heard them utter a word, or leave the house on their own. They live in a world inside their heads. I really can't see what they have as the same as what I have. It's true, we often wonder what those people would want. People have opinions as to whether they should have existed at all in the first place. I have a friend with Down's syndrome, and she's awesome, and I'm not sure what she would say in this situation, but I know as far as I'm concerned I don't want to live in a world where she doesn't exist exactly the way she is. So as far as autistic people who cannot advocate for themselves, I'm not going to make the decision for them, and I don't think anyone else should either. reply zwaps 14 hours agorootparentprevWhy not ask autistic people Have you ever even seen someone with severe autism? reply robocat 13 hours agorootparentStrongly yes as per other comment: https://news.ycombinator.com/item?id=40329772 reply Perenti 2 hours agorootparentBut she could talk? And touch another person without screaming? Because _severe_ autism is non-tactile and non-verbal. reply selimthegrim 14 hours agorootparentprevI don’t see why POC would mask this easier reply spondylosaurus 13 hours agorootparentIIRC it's not really masking, more that children of color are more likely to get labeled \"disruptive\" or \"defiant\" than diagnosed as autistic, at least compared to their white peers. Two kids could exhibit the same behavior, but one is correctly recognized as having a meltdown and the other is written off as a troublemaker. reply pseudalopex 12 hours agorootparentprev- reply Scarblac 12 hours agorootparentNo, 10% - 20%. The article says: > For the majority of people with ASD, the condition is a significant disability, with only 10–20% of children diagnosed before 5 years of age able to live independently as adults. reply mewpmewp2 16 hours agorootparentprevAutism is not a disease. It's a diverging feature. reply munchler 15 hours agorootparentSome people are severely disabled by autism. Are you suggesting that we should just let them suffer? reply mewpmewp2 8 hours agorootparentIt's not the autism that does any sort of disabling. If there are some sort of issues that are disabling someone's way to live normally, deal with them, but don't use autism as a label or call it a disease. There's no \"autism\" as a \"disease\" that causes those symptoms. reply Perenti 2 hours agorootparentSo what's the issue with non-verbal \"autistic\" people then? All those people with the same symptoms and presentation, if that's not a disease or better, a disorder, then what is it? reply anon84873628 15 hours agorootparentprevSaying this doesn't make you hip, woke, or cool. Autism is clearly a \"spectrum\" disorder that is not fully understood or categorized yet, which is exactly why we need this type of research to reach a conclusive, testable biological basis. To portray severely afflicted people as simply \"neurodiverse\" and dismiss treatment options for them, is far more bigoted than the reverse. reply mewpmewp2 9 hours agorootparentI don't care about being hip, woke or cool. It's just my perspective of the World. Also speaking of experience, I don't see how I have a disease for example. In my view, it's mostly the environment provided that's at fault. E.g. social expectations. I think it's a good thing for there to be variance of the way people perceive the World. I had a rough childhood, but I wouldn't have wanted someone to change who I am. I had a rough childhood because of the expected standards for how a person should behave or be socially. Now as I am older, and more confident, successful and have proven that given good environment I can do amazing, I understand how ridiculous people are being with their social requirements. None of it is needed. Also I find it quite funny how people treat labels in psychiatry as some sort of gospel or an actual thing. reply dukeyukey 15 hours agorootparentprevHow do you square that with the severe cases of autism? The people who will never be able to live independently? reply mewpmewp2 8 hours agorootparentThere are specific challenges every person in the World faces. Deal with these specific challenges. But don't group bunch of people as autistic and then go on to call it a disease. Many of the challenges are caused by the environment or flawed social expectations. reply Tijdreiziger 14 hours agorootparentprevThere are also non-autistic people who aren’t able to live independently. reply dukeyukey 13 hours agorootparentAbsolutely, but nobody tries to dissuade people from finding a cure to most conditions that stop independent living. reply the_plus_one 9 hours agoparentprevSpeak for yourself. As an autistic person, if I could get rid of it, I absolutely would. reply squigz 12 hours agoparentprevIf you don't mind being on the spectrum, that's great for you. Some of us are looking forward to more research like this. Many of us don't want to go through this struggle forever, or make another generation go through it, all while waiting for society to get its shit together and completely reorient itself to be neurodivergent-friendly? No thanks. reply oblio 13 hours agoparentprevThis is just ridiculous, just like some deaf people wanting their kids to be deaf to be part of the deaf community. We were born with ears for a reason, same thing, our brains are to a huge percentage built for social skills for a reason. We can call them however we want but all these are basically diseases of various forms. People can choose their hair color, to grow their nails long, their clothes or the myriad other things that allow us to express our uniqueness, without making life stupidly difficult for no reason when it's already super hard. reply john01dav 16 hours agoprevPathologizing autistic behaviors is not the right approach here. Most autistic behaviors are harmless except insofar as allistic (non-autistic) people provide unnecessary consequences for it and through incompatibilities. We don't say that a Linux workstation in a network of Windows computers is broken or needs to be fixed (or visa-versa), but rather we recognize that the problems are due to the differences. As such, attempts to \"cure\" or \"prevent\" autism are actually an eugenic attempt to remove harmless variation that many people irrationally deem to be objectionable. For example, it is commonly stated that autistic people have communication deficits, but this is just a communication difference. We can see this because if a communication task is given to a group of only autistic people they perform comparably to when the same task is given to a group of allistic people. Problems only take place when the group is mixed with both autistic and allistic people being present. The keyword \"double empathy problem\" can be used to find more information about this. (https://doi.org/10.1177/1362361320919286) As another example, allistic people tend to very harshly judge autistic people for extremely subtle cues that they are different. When allistic people are shown recordings of autistic people communicating and of allistic people doing similiar tasks they, within less than a second, judge the autistic people very harshly. This effect persists when controlling for the content of the communication. (https://doi.org/10.1038/srep40700) Of course, doing anything that actually warrants such a judgement in a context like that is impossible so this is a bias against autistic people. I think that this can be compared to implicit racial bias: it is something that most people need to learn to consciously identify and then not perpetuate and is not due to any faults with the victim. Good resource on this: https://www.youtube.com/watch?v=A1AUdaH-EPM There are higher support needs autistic people who need help with activities of daily living. In my opinion, though, in many cases this is not autism but rather autism with an accompanying intellectual disability and the intellectual disability is the reason for higher supports needs. In some cases this could also be caregivers unnecessarily pathologizing behavior and then convincing someone that they need more support than they really do, which I have seen in real life. reply shutupnerd0000 15 hours agoparent> In my opinion, though, in many cases this is not autism but rather autism with an accompanying intellectual disability That's just like, your opinion, man. If autism warrants needing help with daily living then it's a disorder by definition. reply john01dav 15 hours agorootparentThere are two ways that something can lead to needing help with daily living: - society rejects the trait without good reason, so then someone needs help to deal with this rejection - the trait leads to an inability to do something that the person wants to do, irrespective of any societal concerns I am okay with calling the latter a disorder, but not the former. The traits that are recognized as part of autism (social incompatibilities, stimming, special interests, hyper or hyposensitivity — these are the DSM traits for autism rephrased more politely) are clearly in the former case. Traits that lead to being unable to function (such as an inability to feed one's self) are not on this list, but rather are characterized by intellectual disability. reply shutupnerd0000 11 hours agorootparentDo you always reply with definitions you invented on the spot to justify your view of reality? reply john01dav 9 hours agorootparentIt wasn't invented on the spot. In the past, I have thought extensively about what should be considered a disorder, if the concept of \"disorder\" is even coherent, and how this applies to what treatments should be performed, available, and researched. reply AnthonyMouse 9 hours agorootparentprevIs it unreasonable in your view to distinguish between an intrinsic limitation and an externally culturally imposed one? reply anon84873628 15 hours agoparentprevThere is a big difference between \"neurodiverse\" people and severely autistic people facing huge challenges in their life. Are you seriously dismissing the idea of helping treat that latter group? \" this is not autism but rather autism with an accompanying intellectual disability and the intellectual disability is the reason for higher supports needs. \" This is a self-contradictory statement. But what do you think people are researching if not those intellectual disabilities -- why they occur and how they can be prevented. reply john01dav 15 hours agorootparent> There is a big difference between \"neurodiverse\" people and severely autistic people facing huge challenges in their life. Are you seriously dismissing the idea of helping treat that latter group? The people who you are referring to as neurodiverse also face huge challenges. When everyone hates you just for being yourself and not hurting anyone, that is a huge challenge. This can threaten peoples ability to make a living. This can result in people having to live in abusive situations due to lack of financial — not practical — ability to live on their own. When you need to do stimming to feel internally at piece but most other people will perceive this as a threat, that is a challenge. When you need protection (e.g., headphones) from sensory input in the outside world, but the world does not allow this in some cases (for example a job may deem it to be \"unprofessional\") that is also a threat. Supports are needed in this case, and these supports are for the world to lighten up about allowing these things. Also, there are, perhaps more challenging, problems that what you call \"severely autistic\" people face. We should also support these people. For these people, the supports could be similar as above (the world lightening up, perhaps about the requirement that everyone be productively employed) or they could be different (a medical treatment that increases intelligence). Such a medical treatment needs to be performed ONLY with the informed consent of the patient, to the degree that that is possible with the communication difficulties. > This is a self-contradictory statement. But what do you think people are researching if not those intellectual disabilities -- why they occur and how they can be prevented. I think that this type of research is unnecessarily lumping intellectual disabilities with the traits in what you call neurodiverse people. I am much more open to helping people with intellectual disabilities, to the extent that these people want that help, than I am to treatments that attempt to normalize neurodiverse people. The word \"autism\" refers to both groups, so research that is about \"curing autism\" is at least in part about normalizing neurodiverse people. reply anon84873628 15 hours agorootparentThanks for you comment. I was only splitting the spectrum into the two broadest categories for rhetorical simplicity. Of course I also agree that society needs to become more accepting and supportive of all types of people. To put it simply, we should not become a bioengineered dystopia. We can do two things at once though. >I think that this type of research is unnecessarily lumping intellectual disabilities with the traits in what you call neurodiverse people. This is an unfair and unsubstantiated view that you are projecting onto the researchers. I give benefit of the doubt that these professionals have a far better understanding of the science, sociology, and ethics of the topic than any of us. We need better understanding and improvement in all the areas right now. reply john01dav 15 hours agorootparentThe medical system has a history of mistreating marginalized groups (of which neurodiverse people are definitely an example), and there are a huge number of people who fund and perform research aimed solely at eradicating all forms of autism. Autism Speaks is one such group (which is an ironic name since the views of the organization differ greatly from those of most autistic people), and they are quite active in autism research and well-funded. As such, I do not think that giving the benefit of the doubt is reasonable. Furthermore, even if the researchers have an excellent and completely ethical view of autism, many people reading about the research will not so giving such a perspective remains valuable. If can be easy to say that we should simply explore all avenues of research, and in an ideal world this would be true, but we do not live in an ideal world. There are two concerns with this type of research: - it has an opportunity cost of research that might be more effective (for example medical treatments that could help with sensory hypersensitivity under an informed consent model could be a good result, or research that helps us understand what, exactly, leads allistic people to hate autistic people so much so that we can improve communication in both directions) - it creates new abilities for those who would do eugenicist harm, even if they are well-meaning reply jprete 15 hours agoparentprevI think you're engaging in the no-true-Scotsman fallacy with the claim that highly autistic people with a lot of special needs are really \"autistic with intellectual disabilities\". I disagree. They're simply more autistic and more impacted than either of us. reply pseudalopex 11 hours agorootparentThey did not say no true autistic person are intellectually disabled. They said they are overlapping groups. Like Scotsmen and people who put sugar in porridge. reply jprete 6 hours agorootparentThey're saying that no true definition of autism can contain intellectual disability by classifying any intellectual disability in an autistic person as a distinct, totally independent condition. reply ModernMech 5 hours agorootparentThey said: > In my opinion, though, in many cases this is not autism but rather autism with an accompanying intellectual disability and the intellectual disability is the reason for higher supports needs. Which does not imply \"no true definition of autism can contain intellectual disability\". reply john01dav 15 hours agorootparentprevSee here for why I think that it is different: https://news.ycombinator.com/item?id=40329752 reply jprete 6 hours agorootparentBehaviors that you think are harmless to others are not necessarily so. reply softfalcon 16 hours agoprevIs anyone else reading this and seeing the worrying, “we can just medicate away the autism”? They’re talking about a possible pharmaceutical “fix” for autism in children under 5. Seems a bit premature for just recently finding a metabolic difference in a cohort of children. reply m00x 16 hours agoparentThat's not what the article suggests at all. It's during the developmental stage, which is by nature temporary. reply somenameforme 15 hours agorootparentYes it is. It's exactly what the article suggests: --- ... Naviaux and his team completed early clinical testing for suramin. ... Now, the researchers hope that by revealing the specific ATP-related pathways that are altered in autism, their work will help scientists develop more drugs that target these pathways to manage the symptoms of ASD. \"Suramin is just one drug that targets the cell danger response,\" he said. \"Now that we're closely interrogating how metabolism changes in ASD, we could be at the beginning of a drug renaissance that will create new options for treatment that never existed before.\" --- This study [literally] brought to you by Pannex Therapeutics, Yuva Biosciences, Kuzani, and Paxmedica, MaraBio Systems, Inc and undoubtedly numerous other big pharma interests that were able to keep the study at arm's length enough to avoid disclosure requirements. [1] [1] - https://www.nature.com/articles/s42003-024-06102-y#Sec36 reply softfalcon 11 hours agorootparentThanks, appreciate you backing up my thoughts on this. I’ve already received several down votes from folks who seem to disagree with my concern. reply tsoukase 14 hours agoprevAutism is rooted during fetal brain development. Behavioural and metabolic changes show up later. There is no an egg and chicken problem. The primary disease starts in the CNS and everything else follows reply computerphage 14 hours agoparentHow do you know that? reply tsoukase 11 hours agorootparentSchizophrenia, Alzheimer's, Parkinson's have links with the gut too. But I \"know\" they start from the brain. No advanced or complicated hypothesis reply kelseyfrog 11 hours agorootparentHow would you prove or disprove this theory? reply tsoukase 10 hours agorootparentThe gut hypothesis hype is trendy right now. There is some correlation but when things settle down, some of the effect will be attributed to \"picky eating\". Proving that the source of mental disorders is the brain and not the gut (as it was believed in the distant past) is easy: 100% of patients show brain damage while a fraction of them have an abnormal gut reply kelseyfrog 9 hours agorootparentHow do you eliminate models where brain damage is a proximate cause? reply tsoukase 3 hours agorootparentExclusion of either cause directions is impossible by definition. This is science not mathematics. But saying that the primary mechanism of mental disease lies outside the brain must not contradict decades of research and simple observation (eg a small brain damage leads to a profound behavioural image while cutting 5 meters of small intestine to none) Extraordinary claims require extraordinary evidence. reply MajimasEyepatch 13 hours agoparentprevThere’s so much brain development that happens in the first few years after birth that there’s absolutely no way you can say that with confidence. reply tsoukase 12 hours agorootparentNo developmental anomaly can start after birth. It must preexist but is not detected. Proof: heavy cases of autism are diagnosed at birth, so the beginning lies sometime in uterus. The same holds for the lighter cases too. reply MajimasEyepatch 4 hours agorootparentNonsense. Developmental disorders can be caused by any number of factors in early childhood, like stress, neglect, infection, injury, and exposure to substances in the environment like lead. A multifactorial disorder like autism may have many different causes, and we don’t know enough to say for certain that they all originate before birth. I’d wager they do not. reply yareal 3 hours agorootparentprevWhat the fuck? Of course developmental anomalies can start after birth. Yeah, many initially develop in the womb, but like, the time in the womb is a trivial percentage of a child's development. reply faeriechangling 17 hours agoprev [–] > The researchers discovered that a small number of biochemical pathways are responsible for the majority of these changes, which could help inform new early detection and prevention strategies for autism. It won’t. Autism is a socioculturally bound diagnosis, not a single disease that exists in biology. It’s a label for those perceived by others in a certain light, defined in such a way that two with the same label can have remarkably little overlap in terms of observed behaviour. You diagnose autism based on how people act, not who they are. Any biological markers for autism are politically suspect as it would imply those without those markers are invalid, while also raising the spectre of eugenics for those with the markers. More likely and productivity it might eventually REPLACE autism as a diagnosis with something scientifically valid and treatable, as if somebody displays no autistic behaviours as a result of treatment of a metabolic disorder, why diagnose them with autism? reply m00x 16 hours agoparentThat's completely incorrect. Autism has clear physiological differences in the brain. It's not just a personality difference. People like to call themselves autistic when it's just social awkwardness, and some doctors might even improperly diagnose them, but these are separate from the condition. https://www.healthcentral.com/condition/autism/autism-brain-... This could help us prevent autism completely. reply faeriechangling 16 hours agorootparent>People like to call themselves autistic when it's just social awkwardness, and some doctors might even improperly diagnose them, but these are separate from the condition. What makes such a diagnosis incorrect when various forms of social awkwardness satisfy criteria A and D of the diagnostic criteria [1], and all of the criteria for social pragmatic disorder[2]? In the DSM-V-TR era psychiatrists are instructed to not just judge somebody to not be autistic if they do not appear socially awkward, and to additionally ask if they find social interactions distressing, and observe them for longer in more naturalistic settings to find the deficit in social functioning[3] as part of a thus far continuously lowering diagnostic bar as to what is considered sufficient social awkwardness to be diagnosable. >Autism has clear physiological differences in the brain. Which physiological changes in the brain make you autistic, or put another way, which physiological changes in the brain must you lack to NOT be autistic? I've heard of any autism diagnosis's and self-diagnosis's and I've never heard of any of them being based on a brain scan and yet people go around calling others and themselves autistic. I've never heard of a diagnosis being lost or gained due to a brain scan. I've heard this insistence that we can infer the territory, the neurological conditions of peoples brains, from the map, the behaviourist diagnosis, and there may be a correlation but it can't be said that any given person with an autism diagnosis has any given specific neurological change. The only thing we test for IS behaviour, and infer biology from it. [1] https://www.cdc.gov/ncbddd/autism/hcp-dsm.html [2] https://en.wikipedia.org/wiki/Social_(pragmatic)_communicati... [3] https://www.reddit.com/r/aspergirls/comments/th9hku/dsm5tr_n... reply m00x 15 hours agorootparentDiagnosis for autism is complicated because some people act the same as people with clear physiological changes, but without those changes. This puts medical boards in a sticky situation where they have to be inclusive since there's not enough research to say the latter group are definitely not autistic. I'm in the camp that you shouldn't diagnose an issue without clear physiological or chemistry differences, but I'm not in control of the medical boards. I think we all agree that you shouldn't self-diagnose. reply StressedDev 15 hours agorootparentprevYou cannot self-diagnose, and only a trained medical professional can diagnose autism. By trained medical professional, I mean an autism expert who is either a therapist (PHD, PsyD, LMFT, etc.) or a psychiatrist. Most people who use terms like autistic, bi-polar, sociopath, narcist, etc. are using the terms incorrectly. Also, I suspect you are correct that most ASD diagnoses do not use brain scans and rely on a trained professional's judgement and observations. That fact does not mean that autism does not exist or that some autistic people may have physical differences from neurotypical people. reply yareal 3 hours agorootparentYou absolutely can self diagnose. Your self diagnosis is not as reliable, thorough, or trustworthy as a professional diagnosis. Self diagnosis is often the first step towards a professional diagnosis. You can choose to believe self diagnosis is low or zero value, but that's your own value judgement, which is separate from \"can\" and \"cannot\". reply zeroonetwothree 15 hours agorootparentprevI’m not sure you think the word “cannot” means what most people think it means. reply throwaway2562 16 hours agorootparentprevHere’s hoping. Autism is pure hell for some families. Unless of course self-declared leaders of the ‘neurodivergent community’ declare such efforts to be genocidal, modern eugenics, and so on. Relatedly, I was struck to see the recent breakthrough in curing congenital deafness condemned by members of the ‘deaf community’ on Twitter. So we unfortunately have good reason to expect the same kinds of folly here. reply jeroenhd 15 hours agorootparentI've seen the same protests among certain deaf communities and it baffles me that someone would oppose a cure to what is obviously a medical condition. In the same vein, I wouldn't oppose a cure for autism, despite my own diagnosis. Why go through the pain and suffering that comes with autism in a world of non-autists? I've seen more than enough of the lives of people with non-high functioning autism to realise the absolute living hell a cure like this could prevent. I'm wary of the \"cures\" people have tried, most of them based on fake psychology or pseudoscience, but I have no reason to expect the authors of this paper to be in it to show how their kid is \"normal\", like most people looking for \"cures\" seem to be. I expect this article to be quoted many times in the terrible Facebook groups that will also recommend things like bleach enemas to desperate parents, but I also expect good developments from the real scientists trying to understand and perhaps cure (the worst cases of) autism. reply Perenti 2 hours agorootparentRemember, the article is talking about people with profound disability, not people who can comment in forums. I think it would be fantastic _if_ there's a set of markers in a young infant that can be acted on preventing non-verbal, constantly in terror, withdrawn inmates of special hospitals. I don't think they're talking about my dislike of telephones, or fear of shopping centers, or frequent confusion with figurative versus literal language. Even though the last thing has got me in fights more than once. Fights that are sudden, surprising and unwarranted to me, but completely expected given how I reacted to what someone said. reply filleduchaos 14 hours agorootparentprev> it baffles me that someone would oppose a cure to what is obviously a medical condition Ultimately, not everybody seeks to be \"normal\", and there is plenty of reason to fear the imposition of normalness when simply being functional would have done just fine. reply shermantanktop 7 hours agorootparentWhen you are close to the norm, it’s much easier to ignore your differences. When you are farther away, you have to decide what to do: deny them, accept them, mask them, amplify them. None of us are truly normal. reply filleduchaos 14 hours agorootparentprevMmm, that sounds rather uncharitable. While obviously Deaf people aren't a hivemind, I think people who are not Deaf (and fully-abled people in particular) should listen when they each speak for themselves instead of coming to broad conclusions of \"folly\". For me it began to click due to somewhat similar discussions I've had about my sight (I'm moderately myopic in both eyes and significantly astigmatic in one), where I've explained that: - yes I actually like wearing glasses, and am not interested in contact lenses at all - yes I also like my uncorrected vision: I like the softness and the smoothing over of details, and the way that lights scatter, and the fact that I can focus on things that are right in front of my nose - no it isn't anxiety that's stopping me from getting the likes of LASIK; I actually like having both corrected and uncorrected vision And it is astonishing how much people who are caught up in their own complexes about vision deficiencies try to convince me that I'm stupid or even lying because I don't share their aversion. It was rather off-putting, to be honest. So yeah, that was how I began to see how people whose condition (for lack of a better term) is much more strongly linked to their identity[0] would end up with their hackles permanently raised against the idea of a cure for a life experience that they find n",
    "originSummary": [
      "Researchers at the University of California San Diego School of Medicine have pinpointed metabolic changes from birth to later in childhood associated with autism spectrum disorder (ASD) onset.",
      "Studying children evolving into ASD revealed a few key biochemical pathways driving most of these alterations, paving the way for early detection, prevention approaches, and novel symptom management drugs.",
      "The study underscores the significance of metabolism in ASD progression, potentially shaping future research and treatment possibilities."
    ],
    "commentSummary": [
      "The discussion covers aspects of autism such as its potential links to serotonin metabolism and the gut-brain axis, challenges individuals with autism encounter in society, and debates surrounding seeking a cure.",
      "It also emphasizes the significance of acceptance and support for neurodiverse individuals, the complexities of diagnosing autism, varying treatment perspectives, and worries about stigmatization and mistreatment.",
      "Topics extend to self-diagnosis validity, societal expectations, and the importance of individual choice in managing autism spectrum disorder, providing a comprehensive view on the subject."
    ],
    "points": 143,
    "commentCount": 267,
    "retryCount": 0,
    "time": 1715440712
  },
  {
    "id": 40329675,
    "title": "Registers Revolutionize Vision Transformers",
    "originLink": "https://openreview.net/forum?id=2dnO3LLiJ1",
    "originBody": "Vision Transformers Need Registers Timothée Darcet, Maxime Oquab, Julien Mairal, Piotr Bojanowski Published: 16 Jan 2024, Last Modified: 12 Apr 2024ICLR 2024 oralEveryoneRevisionsBibTeX Code Of Ethics: I acknowledge that I and all co-authors of this work have read and commit to adhering to the ICLR Code of Ethics. Keywords: representation, vision, transformer, register, SSL, CLIP, attention, attention map, interpretability, DINO, DINOv2 Submission Guidelines: I certify that this submission complies with the submission instructions as described on https://iclr.cc/Conferences/2024/AuthorGuide. TL;DR: We find artifacts in ViT features. We add new tokens (“registers”) that fix this issue. Abstract: Transformers have recently emerged as a powerful tool for learning visual representations. In this paper, we identify and characterize artifacts in feature maps of both supervised and self-supervised ViT networks. The artifacts correspond to high-norm tokens appearing during inference primarily in low-informative background areas of images, that are repurposed for internal computations. We propose a simple yet effective solution based on providing additional tokens to the input sequence of the Vision Transformer to fill that role. We show that this solution fixes that problem entirely for both supervised and self-supervised models, sets a new state of the art for self-supervised visual models on dense visual prediction tasks, enables object discovery methods with larger models, and most importantly leads to smoother feature maps and attention maps for downstream visual processing. Anonymous Url: I certify that there is no URL (e.g., github page) that could be used to find authors' identity. No Acknowledgement Section: I certify that there is no acknowledgement section in this submission for double blind review. Primary Area: unsupervised, self-supervised, semi-supervised, and supervised representation learning Submission Number: 3647 Loading",
    "commentLink": "https://news.ycombinator.com/item?id=40329675",
    "commentBody": "Vision Transformers Need Registers (openreview.net)133 points by cscurmudgeon 15 hours agohidepastfavorite16 comments ttul 14 hours agoAccording to the paper, the \"registers\" are additional learnable tokens that are appended to the input sequence of a Vision Transformer model during training. They are added after the patch embedding layer, with a learnable value, similar to the [CLS] token and then at the end of the Vision Transformer, the register tokens are discarded, and only the [CLS] token and patch tokens are used as image representations. The register tokens provide a place for the model to store, process and retrieve global information during the forward pass, without repurposing patch tokens for this role. Adding register tokens removes the artifacts and high-norm \"outlier\" tokens that otherwise appear in the feature maps of trained Vision Transformer models. Using register tokens leads to smoother feature maps, improved performance on dense prediction tasks, and enables better unsupervised object discovery compared to the same models trained without the additional register tokens. This is a neat result. For just a 2% increase in inference cost, you can significantly improve ViT model performance. Close to a free lunch. reply larodi 9 hours agoparentThis all token business is very shady, and the whole probability theory. You add token here and there and magic happens. Discreet math people can not take this lightly. Stochastic regexes is one thing, but this on a completely different level of mathematical debauchery. Absolutely amazing this works. reply programjames 9 hours agorootparentVision transformers are essentially just JPEG but with learned features rather than the Fourier transform. reply Zacharias030 54 minutes agorootparentInteresting! Can you elaborate? reply samus 5 hours agorootparentprevI find it wild that the training process can do such things as forcing it repurpose background areas to begin with. The authors just observed abd optimized what the model was already doing by itself. reply akomtu 9 hours agorootparentprevThe modern Alchemy. reply macleginn 13 hours agoparentprevThere was an attempt to add several CLS tokens to BERT, with less spectacular results: https://arxiv.org/pdf/2210.05043 reply swyx 12 hours agoparentprevare there lessons here for regular (non vision) transformers? sounds close to attention sinks/pause tokens? reply johntb86 12 hours agoparentprevFor these tokens you first need to unembed the result of the final layer, the re-embed the resulting token on the next pass. Has anyone investigated passing the raw output of one pass to the input of the next? reply hasmanean 9 hours agoparentprevSo is that what all the visual cues are in real life, things like fashion accessories, uniforms etc.? reply kadushka 13 hours agoparentprevInteresting. One other potential benefit is an easier quantization of the activations. reply richdougherty 14 hours agoprevRelated? \"Let's Think Dot by Dot: Hidden Computation in Transformer Language Models\" https://arxiv.org/abs/2404.15758 > Chain-of-thought responses from language models improve performance across most benchmarks. However, it remains unclear to what extent these performance gains can be attributed to human-like task decomposition or simply the greater computation that additional tokens allow. We show that transformers can use meaningless filler tokens (e.g., '......') in place of a chain of thought to solve two hard algorithmic tasks they could not solve when responding without intermediate tokens. However, we find empirically that learning to use filler tokens is difficult and requires specific, dense supervision to converge. We also provide a theoretical characterization of the class of problems where filler tokens are useful in terms of the quantifier depth of a first-order formula. For problems satisfying this characterization, chain-of-thought tokens need not provide information about the intermediate computational steps involved in multi-token computations. In summary, our results show that additional tokens can provide computational benefits independent of token choice. The fact that intermediate tokens can act as filler tokens raises concerns about large language models engaging in unauditable, hidden computations that are increasingly detached from the observed chain-of-thought tokens. > In this work, we demonstrate that transformers trained on the next-token prediction objective can achieve improved performance on certain tasks when given filler tokens, achieving perfect accuracy whereas the no-filler, immediate-answer setting achieves only low accuracy. -- I wonder if we could get benefits from adding special computation/register tokens to text LLMs? More discussion: - https://news.ycombinator.com/item?id=40182695 - https://www.reddit.com/r/LocalLLaMA/comments/1cf2w5a/transfo... reply ashvardanian 3 hours agoprevWe tested dozens (maybe >100) of papers/ideas over the last years in vision and multimodal perception and this is one of the rare cases, where everything worked well! Neat idea and paper! This model, for example, uses 4 register tokens, and combines them with Matryoshka-style losses for training, resulting in super-compact 64-dimensional embeddings, in case anyone is looking for CLIP alternatives: https://huggingface.co/unum-cloud/uform3-image-text-english-... reply joaquincabezas 13 hours agoprevI was at ICLR and this was one of the best of this year, it was also evident during the poster session. Congrats to the authors!! reply barbolo 9 hours agoprevI’ve been using DinoV2 for some months now. I’ve tried the models with 4 register tokens along with CLS + patch tokens. I’ve several embeddings (tokens) from previous model (no registers) which are part of my solution, so I didn’t adopt the newer “register” models because the CLS tokens are not aligned between 0 registers and 4 registers models. It would be nice if the CLS and patch tokens were somehow aligned between those models. reply superkuh 15 hours agoprev [–] \"Attention sinks\" for vision models? reply GuidelinesFAQListsAPISecurityLegalApply to YCContact Search:",
    "originSummary": [
      "Registers are presented as a remedy for artifacts in Vision Transformers (ViT) features, enhancing both supervised and self-supervised models.",
      "This advancement establishes a new state of the art in self-supervised visual models and facilitates object discovery with more extensive models.",
      "Consequently, registers contribute to creating more refined feature and attention maps for subsequent visual processing tasks."
    ],
    "commentSummary": [
      "Adding registers as learnable tokens in Vision Transformer models enhances performance on dense prediction tasks and facilitates better unsupervised object discovery.",
      "Register tokens, placed after the patch embedding layer, store and access global information, improving feature maps' smoothness and eliminating outlier tokens.",
      "The inclusion of register tokens significantly boosts model performance with minimal impact on inference cost, garnering positive community feedback and suggesting potential benefits for text Language Models (LLMs)."
    ],
    "points": 133,
    "commentCount": 16,
    "retryCount": 0,
    "time": 1715450898
  }
]
