[
  {
    "id": 41903616,
    "title": "मिस्र ने 100 साल के प्रयास के बाद मलेरिया-मुक्त होने की घोषणा की",
    "originLink": "https://www.bbc.com/news/articles/cm2yl8pjgn2o",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41903616",
    "commentBody": "",
    "originSummary": [
      "विश्व स्वास्थ्य संगठन (WHO) ने लगभग एक सदी की उन्मूलन प्रयासों के बाद मिस्र को मलेरिया-मुक्त घोषित किया है, जो एक महत्वपूर्ण सार्वजनिक स्वास्थ्य उपलब्धि को दर्शाता है।",
      "मिस्र विश्व स्वास्थ्य संगठन के पूर्वी भूमध्यसागरीय क्षेत्र में इस स्थिति को प्राप्त करने वाला तीसरा देश है, संयुक्त अरब अमीरात और मोरक्को के बाद।",
      "प्रमाणपत्र के लिए कम से कम तीन लगातार वर्षों के लिए मलेरिया संचरण के बाधित होने के प्रमाण की आवश्यकता होती है, और डब्ल्यूएचओ इस स्थिति को बनाए रखने के लिए निरंतर सतर्कता के महत्व पर जोर देता है।"
    ],
    "commentSummary": [
      "मिस्र को विश्व स्वास्थ्य संगठन (WHO) द्वारा मलेरिया-मुक्त प्रमाणित किया गया है, जो एक सदी लंबी प्रयास के बाद हुआ है, और यह रोग संचरण और पारिस्थितिकी को समझने के महत्व को रेखांकित करता है।",
      "उपलब्धि में रणनीतियाँ शामिल थीं जैसे निगरानी, परीक्षण, और पड़ोसी देशों के साथ सहयोग, साथ ही मच्छर के लार्वा को लक्षित करने वाले कीटनाशकों और जैविक नियंत्रण जैसी तकनीकें।",
      "डब्ल्यूएचओ प्रमाणन के लिए तीन वर्षों तक मलेरिया संचरण के बाधित होने के प्रमाण और इसके पुनः स्थापना को रोकने के उपायों की आवश्यकता होती है, जिसमें मिस्र की मजबूत निगरानी प्रणाली एक महत्वपूर्ण भूमिका निभाती है।"
    ],
    "points": 313,
    "commentCount": 32,
    "retryCount": 0,
    "time": 1729515068
  },
  {
    "id": 41898723,
    "title": "माइक्रोसॉफ्ट ने कहा कि उसने अपने ग्राहकों के क्लाउड उत्पादों के लिए सुरक्षा लॉग्स के हफ्तों का डेटा खो दिया है।",
    "originLink": "https://techcrunch.com/2024/10/17/microsoft-said-it-lost-weeks-of-security-logs-for-its-customers-cloud-products/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41898723",
    "commentBody": "",
    "originSummary": [
      "माइक्रोसॉफ्ट ने अपने आंतरिक निगरानी एजेंटों में एक बग का अनुभव किया, जिसके परिणामस्वरूप 2 सितंबर से 19 सितंबर तक कुछ क्लाउड उत्पादों के लिए सुरक्षा लॉग्स में दो सप्ताह से अधिक की कमी हो गई।",
      "प्रभावित उत्पादों में Microsoft Entra, Sentinel, Defender for Cloud, और Purview शामिल हैं, जो नेटवर्क रक्षकों की घुसपैठ का पता लगाने की क्षमता को प्रभावित करते हैं।",
      "माइक्रोसॉफ्ट ने समस्या का समाधान कर दिया है और प्रभावित ग्राहकों को सूचित कर दिया है, जबकि पहले अमेरिकी सरकारी विभागों से सुरक्षा लॉग्स को रोकने के लिए आलोचना का सामना करना पड़ा था।"
    ],
    "commentSummary": [
      "माइक्रोसॉफ्ट ने अपने क्लाउड उत्पादों के लिए हफ्तों की सुरक्षा लॉग्स के नुकसान का अनुभव किया, जिससे माइक्रोसॉफ्ट की क्लाउड कंप्यूटिंग सेवा, एज़्योर की विश्वसनीयता के बारे में चिंताएं उत्पन्न हुईं।",
      "उपयोगकर्ताओं ने Azure की इंटरफ़ेस, सुरक्षा, लॉगिन समस्याओं और असंगत प्रदर्शन के लिए आलोचना की है, यह सुझाव देते हुए कि Microsoft की क्लाउड सेवाएँ शायद खराब तरीके से एकीकृत हो सकती हैं।",
      "यह घटना माइक्रोसॉफ्ट के उत्पाद गुणवत्ता पर बिक्री के फोकस और सुरक्षित और विश्वसनीय क्लाउड सेवाएं प्रदान करने की क्षमता के बारे में व्यापक चिंताएं उठाती है, भले ही Azure की प्रतिस्पर्धी मूल्य निर्धारण हो।"
    ],
    "points": 269,
    "commentCount": 142,
    "retryCount": 0,
    "time": 1729460547
  },
  {
    "id": 41898736,
    "title": "आज उबंटू की 20वीं वर्षगांठ है",
    "originLink": "https://lists.ubuntu.com/archives/ubuntu-announce/2004-October/000003.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41898736",
    "commentBody": "",
    "originSummary": [
      "उबंटू 4.10 \"द वार्टी वार्थोग रिलीज़\" एक नए लिनक्स वितरण की शुरुआत को चिह्नित करता है, जो डेबियन की व्यापक विशेषताओं के साथ एक उपयोगकर्ता-मित्रवत स्थापना प्रक्रिया और नियमित अपडेट का संयोजन प्रदान करता है।",
      "यह रिलीज़ x86, amd64, और ppc प्रोसेसर का समर्थन करती है, और इसमें GNOME 2.8, Firefox 0.9, Evolution 2.0, और OpenOffice.org 1.1.2 जैसी प्रमुख विशेषताएं शामिल हैं, साथ ही उन्नत हार्डवेयर समर्थन भी शामिल है।",
      "उबंटू मुफ्त सॉफ़्टवेयर के प्रति अपनी प्रतिबद्धता पर जोर देता है, वितरण को बिना किसी लागत के प्रदान करता है, जिसमें डाउनलोड करने या मुफ्त सीडी का अनुरोध करने के विकल्प शामिल हैं, और भविष्य के संस्करणों के लिए सामुदायिक भागीदारी को प्रोत्साहित करता है।"
    ],
    "commentSummary": [
      "उबंटू अपनी 20वीं वर्षगांठ मना रहा है, जो लिनक्स को अधिक सुलभ बनाने में इसके महत्वपूर्ण योगदान को उजागर करता है, विशेष रूप से उपयोगकर्ता के अनुकूल स्थापना प्रक्रिया के माध्यम से।",
      "हाल के बदलावों जैसे स्नैप्स (एक सॉफ्टवेयर पैकेजिंग और डिप्लॉयमेंट सिस्टम) और उबंटू प्रो विज्ञापनों के संबंध में कुछ आलोचनाओं के बावजूद, उबंटू को लिनक्स को लोकप्रिय बनाने में उसके योगदान के लिए अभी भी सराहा जाता है।",
      "उबंटू द्वारा मुफ्त सीडी का प्रारंभिक वितरण उन उपयोगकर्ताओं के लिए एक महत्वपूर्ण भूमिका निभाता था जिनकी इंटरनेट तक सीमित पहुंच थी, जिससे उन्हें लिनक्स का अन्वेषण करने का अवसर मिला और इसे नए उपयोगकर्ताओं के लिए एक अनुशंसित विकल्प के रूप में स्थापित किया।"
    ],
    "points": 235,
    "commentCount": 100,
    "retryCount": 0,
    "time": 1729460648
  },
  {
    "id": 41903864,
    "title": "ईपब्लिफायर – ऑफलाइन पढ़ने के लिए पृष्ठों (पुस्तकें, मैनुअल) को स्क्रैप करें",
    "originLink": "https://github.com/maoserr/epublifier",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41903864",
    "commentBody": "",
    "originSummary": [
      "Epublifier एक उपकरण है जो वेबसाइटों को ePub पुस्तकों में परिवर्तित करता है, जिससे वे eReaders के लिए सुलभ हो जाती हैं। यह HTML पृष्ठों को निकालकर और उन्हें ePub प्रारूप में संकलित करके करता है।",
      "यह उन्नत उपयोगकर्ताओं को जावास्क्रिप्ट का उपयोग करके पार्सिंग प्रक्रिया को अनुकूलित करने की अनुमति देता है और नोवेल अपडेट और वूक्सिया वर्ल्ड जैसे लोकप्रिय साइटों के साथ-साथ विशिष्ट तत्वों वाली कस्टम साइटों का समर्थन करता है।",
      "इस उपकरण को बनाने के लिए विंडोज 10 वातावरण और NPM 8.1.2 की आवश्यकता होती है, और यह अपने विकास में jEpub के उपयोग को स्वीकार करता है।"
    ],
    "commentSummary": [
      "ईपब्लिफायर एक उपकरण है जिसे वेब पृष्ठों, जैसे कि किताबें और मैनुअल, को स्क्रैप करने के लिए डिज़ाइन किया गया है ताकि ऑफ़लाइन पढ़ने की सुविधा मिल सके। इसे इसके उपयोगकर्ता-मित्रवत ग्राफिकल यूजर इंटरफेस (GUI) के लिए सराहा जाता है, जो सामग्री निष्कर्षण की लचीलापन को बढ़ाता है।",
      "यह जटिल वेबसाइटों को संभालने और पॉपअप्स को हटाने में सक्षम है, ब्राउज़िंग और पेजों को प्राप्त करने के लिए मोड्स प्रदान करता है, जो इसे सामान्य वेब स्क्रैपर्स से अलग बनाता है।",
      "हालांकि कानूनी चिंताएं स्थान के अनुसार भिन्न होती हैं, निजी प्रतियां आमतौर पर अनुमत होती हैं, और इस उपकरण को ई-रीडर की कार्यक्षमता और ऑफलाइन पढ़ने के अनुभवों को सुधारने के लिए मूल्यवान माना जाता है।"
    ],
    "points": 187,
    "commentCount": 32,
    "retryCount": 0,
    "time": 1729516688
  },
  {
    "id": 41898076,
    "title": "एआई का उपयोग करके नई चीजें सीखने के लिए माइंड मैप्स बनाएं",
    "originLink": "https://github.com/aotakeda/learn-thing",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41898076",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "एक नया एआई उपकरण उपयोगकर्ताओं को एक विषय दर्ज करके मन मानचित्र बनाने की अनुमति देता है, जो प्रत्येक उपविषय के लिए लिंक के साथ एक शिक्षण मानचित्र उत्पन्न करता है।",
      "उपकरण का उपयोग स्थानीय और बाहरी दोनों मॉडलों के साथ किया जा सकता है, और उपयोगकर्ताओं से प्रतिक्रिया को प्रोत्साहित किया जाता है।",
      "हालांकि इसके सीखने की क्षमता के लिए प्रशंसा की जाती है, कुछ उपयोगकर्ता सुधारों का सुझाव देते हैं, जैसे बेहतर लिंक सत्यापन और अन्य प्लेटफार्मों के साथ एकीकरण, यह ध्यान देते हुए कि एआई-जनित मानचित्र पारंपरिक माइंड मैप्स से भिन्न हो सकते हैं।"
    ],
    "points": 169,
    "commentCount": 73,
    "retryCount": 0,
    "time": 1729454479
  },
  {
    "id": 41899873,
    "title": "पूरी तरह से 3डी-प्रिंटेड सक्रिय इलेक्ट्रॉनिक्स की दिशा में एक कदम",
    "originLink": "https://news.mit.edu/2024/mit-team-takes-major-step-toward-fully-3d-printed-active-electronics-1015",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41899873",
    "commentBody": "",
    "originSummary": [
      "एमआईटी के शोधकर्ताओं ने 3डी-प्रिंटेड कॉपर-डोप्ड पॉलिमर का उपयोग करके अर्धचालक-मुक्त लॉजिक गेट्स बनाए हैं, जो इलेक्ट्रॉनिक्स निर्माण को सरल बना सकते हैं।",
      "यह नवाचार पारंपरिक विनिर्माण केंद्रों के बाहर स्मार्ट हार्डवेयर निर्माण को सक्षम करके इलेक्ट्रॉनिक्स उत्पादन को लोकतांत्रिक बना सकता है, भले ही यह अभी तक अर्धचालक प्रदर्शन से मेल नहीं खाता हो।",
      "यह परियोजना चुंबकीय कॉइल्स के साथ काम पर आधारित है और तांबे से मिश्रित पॉलिमर की एक अनूठी प्रतिरोध विशेषता का उपयोग करती है, जिसका भविष्य में उद्देश्य पूरी तरह से कार्यात्मक इलेक्ट्रॉनिक्स को प्रिंट करना और अधिक कार्यक्षमताओं का अन्वेषण करना है।"
    ],
    "commentSummary": [
      "एमआईटी के शोधकर्ताओं ने 3डी प्रिंटिंग तकनीक को उन्नत किया है, जिसमें उन्होंने कॉपर-इनफ्यूज्ड पीएलए (पॉलीलैक्टिक एसिड) फिलामेंट का उपयोग करके एक रिसेटेबल फ्यूज और एक ट्रांजिस्टर-जैसे उपकरण का निर्माण किया है।",
      "यह नवाचार एकल सामग्री के उपयोग के कारण महत्वपूर्ण है, लेकिन यह अभी तक पूरी तरह से कार्यात्मक सक्रिय इलेक्ट्रॉनिक्स प्राप्त नहीं करता है।",
      "फिलामेंट के पॉजिटिव टेम्परेचर कोएफिशिएंट (PTC) प्रभाव की खोज महत्वपूर्ण है, हालांकि यह तकनीक अभी अपने प्रारंभिक चरण में है और व्यापक अनुप्रयोग के लिए तैयार नहीं है।"
    ],
    "points": 168,
    "commentCount": 69,
    "retryCount": 0,
    "time": 1729473434
  },
  {
    "id": 41898603,
    "title": "जावास्क्रिप्ट टूल्स को \"तेज़\" भाषाओं में फिर से लिखने के प्रति संदेहपूर्ण",
    "originLink": "https://nolanlawson.com/2024/10/20/why-im-skeptical-of-rewriting-javascript-tools-in-faster-languages/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41898603",
    "commentBody": "",
    "originSummary": [
      "नोलन लॉसन जावास्क्रिप्ट टूल्स को रस्ट, ज़िग और गो जैसी भाषाओं में फिर से लिखने की प्रवृत्ति पर सवाल उठाते हैं, यह सुझाव देते हुए कि जावास्क्रिप्ट अक्सर पर्याप्त रूप से तेज़ होता है।",
      "वह बताते हैं कि प्रदर्शन में सुधार वर्तमान जावास्क्रिप्ट टूल्स को अनुकूलित करके, इसके बाइटकोड कैश और JIT (जस्ट-इन-टाइम) कंपाइलर का लाभ उठाकर किया जा सकता है।",
      "लॉसन चेतावनी देते हैं कि नए भाषाओं का उपयोग करने से एक विभाजन उत्पन्न हो सकता है, जिससे पहुंच और डिबग करने की क्षमता सीमित हो सकती है, और संभवतः औसत डेवलपर्स को योगदान देने से अलग कर सकता है।"
    ],
    "commentSummary": [
      "बहस इस बात पर केंद्रित है कि क्या जावा स्क्रिप्ट टूल्स को तेज भाषाओं जैसे रस्ट या गो में फिर से लिखना फायदेमंद है, कुछ का तर्क है कि जावा स्क्रिप्ट की गति पर्याप्त है जबकि अन्य स्थिर रूप से टाइप की गई भाषाओं का उपयोग करने में प्रदर्शन लाभ देखते हैं।",
      "रस्ट या गो जैसी भाषाओं में पुनर्लेखन से महत्वपूर्ण प्रदर्शन सुधार हो सकते हैं, जैसा कि esbuild जैसे उपकरणों द्वारा प्रदर्शित किया गया है।",
      "चर्चा में जावास्क्रिप्ट निर्भरताओं को संशोधित करने की सरलता और भाषा की परिचितता पर भी विचार किया गया है, और इनका तुलनात्मक विश्लेषण तेज़ भाषाओं के उपयोग के संभावित लाभों के साथ किया गया है।"
    ],
    "points": 147,
    "commentCount": 265,
    "retryCount": 0,
    "time": 1729459502
  }
]
