[
  {
    "id": 35813322,
    "timestamp": 1683195553,
    "title": "Google \"We have no moat, & neither does OpenAI\"",
    "url": "https://www.semianalysis.com/p/google-we-have-no-moat-and-neither",
    "hn_url": "http://news.ycombinator.com/item?id=35813322",
    "content": "A leaked internal Google document claims that open source AI is outcompeting Google and OpenAI in terms of speed, customization, privacy protection, and capability. The Google employee who penned the document argues that the company does not have a \"secret sauce\" and that open-source AI models are doing things with much fewer resources and in much less time. The document warns that Google's large models are slowing the company down, and the best models are those that can be iterated upon quickly. The document encourages Google to make small variations of models more than an afterthought and focus on enabling third-party integrations. The document also suggests that Google should be more collaborative with the broader open-source AI community, including publishing smaller ULM variants' model weights. The effects of open-source AI models' recent progress have direct implications for big tech companies' business strategies.- LLaMA-Adapter introduces instruction tuning and multimodality in just one hour of training using Parameter Efficient Fine Tuning (PEFT) technique with only 1.2M learnable parameters and achieves a new SOTA on multimodal ScienceQA.\n- Berkeley launches Koala, a dialogue model trained entirely using freely available data, and measures real human preferences between their model and ChatGPT, with more than 50% of users either preferring Koala or having no preference, at a training cost of $100.\n- Open Assistant launches a model and dataset for Alignment via RLHF, which is close (48.3% vs 51.7%) to ChatGPT in terms of human preference and can be applied to Pythia-12B, making it easy and cheap for small experimenters. The dataset is publicly available, making RLHF more accessible.",
    "summary": "- A leaked internal Google document claims that open source AI is doing better than Google and OpenAI in terms of speed, customization, privacy protection, and capability.\n- The document suggests that Google should focus on enabling third-party integrations, collaborate with the open-source AI community, and make small variations of models more than an afterthought.\n- Recent progress in open-source AI models has implications for big tech companies' business strategies.",
    "hn_title": "Google “We have no moat, and neither does OpenAI”",
    "original_title": "Google “We have no moat, and neither does OpenAI”",
    "score": 1574,
    "hn_content": "The Hacker News thread discusses the future of AI and its integration in everyday software. Google and other big tech companies have an advantage in AI reach due to their control over billion-user platforms. However, while OpenAI may face an existential risk, Google currently faces financial challenges regarding the cost of implementing AI everywhere. There is ongoing work to make AI more accessible, with new methods such as sparsity, and promising benchmarks for running LLMs on CPUs alone. It's predicted that portable AI devices with LLMs will become more prevalent and powerful in the future.Specialized hardware unlikely to overtake general computing devices for mass-market usage, according to a Tech Times editor. A discussion about how AI can run on more affordable hardware ensues, including kernel fusion and memory access optimization. Google needs technology that's cheaper to provide to maintain their ad-supported business model, and specialized, lower-cost hardware for LLMs is likely to emerge with enough demand. Low-level models (LLMs) are getting cheaper to run, which could lead to more affordable AI models on consumer hardware. Within a decade, it's likely mid-level consumer cards will be as powerful as high-end cards that cost up to $40k. Aging UIs and frequent technology changes can make it challenging for users to stay ahead of technological advancements, according to some users, but others believe these users are over-investing in skills. An AI interface that's seamlessly integrated into everyday software could make it easier for users.Comments on a recent HN post include discussions on artificial intelligence (AI), natural language models (LLMs), and open-source software. Some commenters express concerns about anthropomorphism in cars and the potential for fake news with AI. Others argue about the nature of open-source AI models and their \"obtainable\" rather than \"open source\" status. The article being referred to discusses the lack of a \"moat\" for AI, meaning there is no clear strategy to maintain a competitive advantage. However, commenters also note that LLMs are likely to become ubiquitous and invisible features in many products. Certain commenters express skepticism toward OpenAI's business model and the potential for Google to acquire leading startups in the AI space.OpenAI may not be as vital to Microsoft as previously thought, as the tech giant holds the power in their partnership. Microsoft does have the advantage of having existing platforms to integrate OpenAI into. People in the open-source community work to make AI models usable by anyone and feasible on their desktop. Whichever model improves faster will win, and users will go to whoever has the best model. Closed-source software tends to be more successful in areas where users are not software developers and cannot make improvements. GPT-4 is significantly better than its predecessor, and while LoRA may help individual people close the gap, OpenAI is still expected to improve its models more quickly.The conversation revolves around the benefits and limitations of OpenAI's GPT-4 model, including its API and waitlist status. Users have differing opinions on the quality of different AI-generated art tools, with some preferring Midjourney over Stable Diffusion and vice versa. The main takeaway is the potential of AI-generated art and the benefits it can bring across different industries.Consumer-level image generation tools can quickly yield appealing results but abstract away controls that matter in professional work, which are precise, reliable, capable of repeated results, and easily serviceable. Novices who are overwhelmed by the technicalities might love these tools, but they are hit-or-miss at best for serious professional work. Doing a rough mock-up in a modelling program takes FAR less time than trying to wrangle exactly what is needed from one of those generators. Professional artists and designers rely on a fundamental understanding of what communicates with whom and in what way, and assume the machines will \"finish what they started\" rather than doing all the work. MidJourney is a new AI-driven tool which allows users to type keywords and generate visually impressive art. There's a higher skill ceiling with a similar platform called StableDiffusion, which is more suitable for precise and professional-level work. Having a tool generate millions of pretty images from one's imagination quickly is not enough for communication or anything else, but changes will arrive soon.The post discusses the use of Stable Diffusion (SD) in generating AI art, which requires knowledge of Python, cloning Automatic1111 from Git, and running the installer. However, access to SD has become more difficult due to Google's crackdown on SD web-UI. Colab is a more accessible option, and users can auto-generate their own SD instance that costs $0.35/hr. There are several tutorials on YouTube and Reddit that beginners can use to learn how to use SD. Companies like OpenAI and Microsoft have APIs that provide customers access to their LLMs, but they are expensive and have long waitlists. The post cautions that users will only pay for the best LLM if it is significantly better than the next best option or has better privacy policies.There is a discussion about the use of different models, such as ChatGPT and Koala, in open source software. Some argue that the success of open source is due to the efforts of dedicated engineers rather than market forces. The best model size for optimal performance is still uncertain, but many popular devices run on Linux. Discussion around using the right tool for the right job, as GPT-4 is not always the best option due to its slow speed and expense. Some alternative options, such as Midjourney and Bing Image Creator, are popular due to their ease of use and impressive results. Crowdfunding and compensation for developing open source technology are also debated in terms of accelerating progress in this area.",
    "hn_summary": "- LLMs are getting cheaper to run, potentially leading to more affordable AI models on consumer hardware.\n- A discussion about the use and accessibility of different AI models in open source software, and the potential for crowdfunding and compensation to accelerate progress."
  },
  {
    "id": 35811741,
    "timestamp": 1683180296,
    "title": "Scaling up the Prime Video audio/video monitoring service & reducing costs",
    "url": "https://www.primevideotech.com/video-streaming/scaling-up-the-prime-video-audio-video-monitoring-service-and-reducing-costs-by-90",
    "hn_url": "http://news.ycombinator.com/item?id=35811741",
    "content": "Skip to main contentHomepageOur InnovationOur PeopleOur StoryShow SearchVideo StreamingScaling up the Prime Video audio/video monitoring service and reducing costs by 90%The move from a distributed microservices architecture to a monolith application helped achieve higher scale, resilience, and reduce costs.Marcin KolnyMar 22, 2023EmailAt Prime Video, we offer thousands of live streams to our customers. To ensure that customers seamlessly receive content, Prime Video set up a tool to monitor every stream viewed by customers. This tool allows us to automatically identify perceptual quality issues (for example, block corruption or audio/video sync problems) and trigger a process to fix them.Our Video Quality Analysis (VQA) team at Prime Video already owned a tool for audio/video quality inspection, but we never intended nor designed it to run at high scale (our target was to monitor thousands of concurrent streams and grow that number over time). While onboarding more streams to the service, we noticed that running the infrastructure at a high scale was very expensive. We also noticed scaling bottlenecks that prevented us from monitoring thousands of streams. So, we took a step back and revisited the architecture of the existing service, focusing on the cost and scaling bottlenecks.The initial version of our service consisted of distributed components that were orchestrated by AWS Step Functions. The two most expensive operations in terms of cost were the orchestration workflow and when data passed between distributed components. To address this, we moved all components into a single process to keep the data transfer within the process memory, which also simplified the orchestration logic. Because we compiled all the operations into a single process, we could rely on scalable Amazon Elastic Compute Cloud (Amazon EC2) and Amazon Elastic Container Service (Amazon ECS) instances for the deployment.Distributed systems overheadOur service consists of three major components. The media converter converts input audio/video streams to frames or decrypted audio buffers that are sent to detectors. Defect detectors execute algorithms that analyze frames and audio buffers in real-time looking for defects (such as video freeze, block corruption, or audio/video synchronization problems) and send real-time notifications whenever a defect is found. For more information about this topic, see our How Prime Video uses machine learning to ensure video quality article. The third component provides orchestration that controls the flow in the service.We designed our initial solution as a distributed system using serverless components (for example, AWS Step Functions or AWS Lambda), which was a good choice for building the service quickly. In theory, this would allow us to scale each service component independently. However, the way we used some components caused us to hit a hard scaling limit at around 5% of the expected load. Also, the overall cost of all the building blocks was too high to accept the solution at a large scale.The following diagram shows the serverless architecture of our service.The initial architecture of our defect detection system.The main scaling bottleneck in the architecture was the orchestration management that was implemented using AWS Step Functions. Our service performed multiple state transitions for every second of the stream, so we quickly reached account limits. Besides that, AWS Step Functions charges users per state transition.The second cost problem we discovered was about the way we were passing video frames (images) around different components. To reduce computationally expensive video conversion jobs, we built a microservice that splits videos into frames and temporarily uploads images to an Amazon Simple Storage Service (Amazon S3) bucket. Defect detectors (where each of them also runs as a separate microservice) then download images and processed it concurrently using AWS Lambda. However, the high number of Tier-1 calls to the S3 bucket was expensive.From distributed microservices to a monolith applicationTo address the bottlenecks, we initially considered fixing problems separately to reduce cost and increase scaling capabilities. We experimented and took a bold decision: we decided to rearchitect our infrastructure.We realized that distributed approach wasn’t bringing a lot of benefits in our specific use case, so we packed all of the components into a single process. This eliminated the need for the S3 bucket as the intermediate storage for video frames because our data transfer now happened in the memory. We also implemented orchestration that controls components within a single instance.The following diagram shows the architecture of the system after migrating to the monolith.The updated architecture for monitoring a system with all components running inside a single Amazon ECS task.Conceptually, the high-level architecture remained the same. We still have exactly the same components as we had in the initial design (media conversion, detectors, or orchestration). This allowed us to reuse a lot of code and quickly migrate to a new architecture.In the initial design, we could scale several detectors horizontally, as each of them ran as a separate microservice (so adding a new detector required creating a new microservice and plug it in to the orchestration). However, in our new approach the number of detectors only scale vertically because they all run within the same instance. Our team regularly adds more detectors to the service and we already exceeded the capacity of a single instance. To overcome this problem, we cloned the service multiple times, parametrizing each copy with a different subset of detectors. We also implemented a lightweight orchestration layer to distribute customer requests.The following diagram shows our solution for deploying detectors when the capacity of a single instance is exceeded.Our approach for deploying more detectors to the service.Results and takeawaysMicroservices and serverless components are tools that do work at high scale, but whether to use them over monolith has to be made on a case-by-case basis.Moving our service to a monolith reduced our infrastructure cost by over 90%. It also increased our scaling capabilities. Today, we’re able to handle thousands of streams and we still have capacity to scale the service even further. Moving the solution to Amazon EC2 and Amazon ECS also allowed us to use the Amazon EC2 compute saving plans that will help drive costs down even further.Some decisions we’ve taken are not obvious but they resulted in significant improvements. For example, we replicated a computationally expensive media conversion process and placed it closer to the detectors. Whereas running media conversion once and caching its outcome might be considered to be a cheaper option, we found this not be a cost-effective approach.The changes we’ve made allow Prime Video to monitor all streams viewed by our customers and not just the ones with the highest number of viewers. This approach results in even higher quality and an even better customer experience.EmailTags:Prime VideoAWSLive eventsLarge-scale distributed systemsVideo quality analysisMarcin KolnySenior SDE – Prime VideoMost popular“We’re just beginning to build the future of live sports streaming”Feb 07, 2023Prime Video announces Amazon Research Awards recipients for fall 2022Apr 17, 2023Empathetic by design: How Amélie Werner prioritizes her team to drive innovation for customersApr 05, 2023Innovating live video streaming for a VOD-only worldApr 13, 2023HomepageOur InnovationOur PeopleOur StoryAmazon ScienceAbout AmazonAmazon Studios DEIAmazon.com | Conditions of Use | Privacy | © 1996-2023 Amazon.com, Inc. or its affiliatesAmazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status.twitterfacebookyoutubelinkedin",
    "summary": "- Prime Video's tool for monitoring every stream viewed by customers helps identify perceptual quality issues and triggers a process to fix them.\n- The move from a distributed microservices architecture to a monolith application helped achieve higher scale, resilience, and reduced costs for the Video Quality Analysis (VQA) team at Prime Video.\n- The new architecture reduced infrastructure costs by over 90%, increased scaling capabilities to handle thousands of streams, and allowed for even higher quality and a better customer experience.",
    "hn_title": "Scaling up the Prime Video audio/video monitoring service and reducing costs",
    "original_title": "Scaling up the Prime Video audio/video monitoring service and reducing costs",
    "score": 903,
    "hn_content": "Amazon Prime Video's tech team has shared how it scaled up its audio-video monitoring service and reduced costs through optimization of its Amazon Web Services (AWS) system. The team found that by keeping things simple and avoiding elaborate third-party technologies, the system became more stable and saved costs. It optimized instance types, managed the usage of instances around user behavior and upgraded some instances to GPU-powered ones to improve monitoring. While cloud services might incur monthly recurring costs, resulting in some long-term cost pressures, the team believes that since the cloud scales flexibly with businesses, it keeps costs under control and is economically efficient for everyone. Tech experts discuss various strategies and approaches to server management, ranging from the cloud to on-prem options. Some prefer serverless compute options with \"scale to zero\" features, while others opt for renting servers instead of buying racks. A hybrid approach and server replacement schedules are also considered. AWS's efforts to optimize workloads are mentioned, but management may choose on-prem options for cost-effectiveness. Some users note the limitations of switching to other languages for a performance boost, while others discuss the practicalities of migrating a large database and the potential lock-in with AWS products. The article provides a valuable discussion of different server management options and their benefits and drawbacks.An internal AWS team found that microservices and serverless components were too expensive for their workflow-driven tasks and opted to move to a monolith structure on EC2 and ECS rather than using AWS Step Functions and Lambda functions. The move resulted in significant cost savings, and the team found they didn't need many of the services they previously relied on. However, it should be noted that not all applications are suited for a monolith structure and that decisions should be made on a case-by-case basis. Furthermore, while microservices and serverless components have their advantages, they may not always be the most cost-effective solution for every use case. AWS actively works with customers to optimize their spend and has introduced the Compute Savings Plan as a cost-saving measure.An internal Amazon team found that using AWS Lambda was more expensive and less efficient than traditional architectures like EC2, largely due to the increased complexity of Lambda. The team recommended using Lambda only when necessary and stated that customer satisfaction and problem-solving should be the focus, not increasing revenue at the expense of customer experience. The article sparked discussion on the effectiveness of microservices, with some commentators noting that it depends on the specific use case and organizational structure. Ultimately, the article serves as a reminder to carefully consider the appropriate technology for a given project and prioritize the end-user experience over profit.- Monolithic repositories with many independent targets for testing and deployment work best at large scales\n- Merging breaking code is generally unacceptable and can block other teams from deployment\n- There are extreme circumstances where pushing broken tests to production makes sense, but it should be fixed ASAP\n- Requiring a passing integration branch before merging to master or using a merge queue can prevent failures caused by merging working branches together\n- Monoliths can cause problems when a single person causes other teams' tests to fail, even long after they've left the company\n- Microservices can dilute responsibility and create trust issues if teams don't act as \"maintainers\" instead of \"sole developers\" of a service\n- Trust issues don't justify microservices, but traditional libraries with clear API contracts and separate ownership can still work with a monolith \n- Profiling can identify slow parts in a monolith \n- Microservices can cost more to develop and maintain, and it can be difficult to separate responsibility when the number of microservices grows beyond the number of teamsExperts in the tech industry comment on the challenges and misconceptions surrounding microservices. Some programmers criticize the hype around microservices, citing issues with communication between services, difficulty in implementation, and the potential for unnecessary complexity. Others argue that microservices can be useful in large, distributed systems with multiple development teams. There is also a debate on what constitutes a microservice and how to properly divide responsibilities. Ultimately, the experts agree that the decision to use microservices should be based on the specific needs of a project rather than an industry trend.The debate surrounding the benefits and drawbacks of microservices versus monolithic architecture continues in this online discussion. Some argue that microservices offer organizational benefits at a large scale, while others remain unconvinced and see microservices as a way to extract billable hours. The use of serverless architecture and the potential to allow developers to write functions in a language of their choosing is also discussed. Ultimately, there is recognition that there are trade-offs to be made in both approaches, and that teams should carefully consider the complexity they are willing to take on.",
    "hn_summary": "- Some prefer serverless compute options with \"scale to zero\" features, while others rent servers instead of buying racks, but these options may not always be the most cost-effective solution for every use case.\n- AWS teams found that microservices and serverless components were too expensive for their workflow-driven tasks and opted to move to a monolith structure on EC2 and ECS rather than using AWS Step Functions and Lambda functions."
  },
  {
    "id": 35820368,
    "timestamp": 1683226496,
    "title": "So this guy is now S3. All of S3",
    "url": "https://chaos.social/@jonty/110307532009155432",
    "hn_url": "http://news.ycombinator.com/item?id=35820368",
    "content": "429 Too Many Requestsnginx",
    "summary": "- This website is best experienced by visiting the website directly.\n- Please visit the website to read the article.",
    "hn_title": "So this guy is now S3. All of S3",
    "original_title": "So this guy is now S3. All of S3",
    "score": 468,
    "hn_content": "This post is a discussion on the tech and security considerations behind creating and implementing the Bluesky Social platform, an alternative to Twitter that allows users to use a domain name they own as a user handle. The post includes comments on topics such as the use of bucket names in S3, the use of the AT Protocol for federation, and the potential vulnerabilities created by the design of bespoke domain ownership verification mechanisms. The post also highlights the limitations and issues facing the FediVerse, made up of various Mastodon/Pleroma/Pixelfed/Friendica/whatever instances, and addresses questions about how Bluesky compares to Mastodon. While the post may be of interest to those following the development of Bluesky, it is not yet a mature platform, and all development should be viewed as a work in progress and treated as a \"playground.\"Bespoke domain ownership verification method is not the primary use case for AT Protocol API endpoint. It wasThe post discusses the need for a fediverse URL protocol to solve linking problems on decentralized platforms like Mastodon. The current problem is that many users have trouble accessing the content from the central location. Journalists and media could also run their own server and mirror the post there. A particular user story involves people who don't have accounts on any server but wants to access the content from a central location. There's no clarity on how these features are exposed in the UI and how users experience it. Webfinger solves the problem of verifying links, and it should be helpful in cases like this. The Mastodon platform can link user -> webpage. In contrast, if you allow user-generated content on the homepage of your site, there's not a distinction (from a Mastodon user's point of view) between the two. One of the concerns mentioned was the platform's ability to handle the load of a large number of users.The post discusses the importance of domain verification and the different methods used. It highlights the issues with some domain verification methods, such as the friction caused by DNS changes. The use of \".well-known\" as a folder to serve verification proof is discussed, with some debate on its intuitive nature. An alternative solution that stores a hashed verifiable identifier in subdomains and is populated by domain registrars is proposed. The discussion also covers the potential cyber-security risks related to domain verification and the need for a better, registrar-level proof solution. Finally, some comments stray from the topic, discussing the impact of the post on a social media platform, and the shortcomings of the internet industry in general.The post discusses issues related to domain ownership verification and SSL certificates, commenting on the vulnerabilities of the current system. Several suggestions are made, including the use of published tokens rather than certificates. The article also mentions the controversy around Bluesky, Jack Dorsey's new Twitter, which allows domain hijacking through the upload of a custom file. The post also delves into the low adoption rates of DNSSEC and the difficulty of automating DNS compared to HTTP. The use of a signed request to prove ownership is suggested as a more secure alternative to the current system. Overall, the article highlights common issues in domain ownership and SSL certificate verification and proposes potential solutions.Bluesky developer team faces an embarrassing bug when the platform mistakenly verifies any custom web domain, including public suffixes. The problem surfaced when a user uploaded his custom file to the Amazon s3 bucket. The verification method uses TXT records for verification, leaving the domain open to scammers and imposters who pass through the Bluesky verification process. Several errors have surfaced as part of the Bluesky testing process, such as users that figured out he could pack 1000 mentions into one \"@everyone\" and cause others to get notified, but developers suggest the problems are fixable and provide necessary feedback to improve the protocol.",
    "hn_summary": "- The article highlights issues related to domain ownership verification, SSL certificate verification, and potential solutions to increase security.\n- The Bluesky developer team faces several errors in the verification process, but suggests that they are fixable and provide necessary feedback to improve the protocol."
  },
  {
    "id": 35814081,
    "timestamp": 1683202149,
    "title": "Facebook has not been doing enough to comply with a 2020 privacy order: FTC",
    "url": "https://arstechnica.com/tech-policy/2023/05/ftc-says-facebook-violated-privacy-order-proposes-ban-on-monetizing-youth-data/",
    "hn_url": "http://news.ycombinator.com/item?id=35814081",
    "content": "BROKEN PROMISES —Facebook furious at FTC after agency proposes ban on monetizing youth dataMeta has 30 days to respond to allegations about its Messenger Kids product.ASHLEY BELANGER - 5/3/2023, 10:44 AMEnlargeJOSH EDELSON / Contributor | AFP115WITHFacebook has not been doing enough to comply with a 2020 privacy order, the Federal Trade Commission (FTC) announced Wednesday. On top of \"continuing to give app developers access to users’ private information\" that Meta claimed had been cut off, the FTC alleges that Facebook has caused new harm. Perhaps most alarming, the FTC alleges that Facebook's Messenger Kids product misled parents on who could connect to chat with minors and misrepresented who had access to private youth data.Now, the FTC has proposed changes to the 2020 order that would prohibit Facebook owner Meta from launching new products on any of its platforms without procuring written FTC compliance confirmation and prevent the company from monetizing any of the youth data it collects across Facebook, Instagram, WhatsApp, and Oculus.“Facebook has repeatedly violated its privacy promises,” Samuel Levine, director of the FTC’s Bureau of Consumer Protection, said in a press release.The FTC confirmed that it has asked Meta to respond to allegations first reported by The Verge in 2019 that \"from late 2017 until mid-2019, Facebook misrepresented that parents could control whom their children communicated with through its Messenger Kids product.\" Quite the opposite, instead of providing adequate parental controls to prevent strange adults from contacting kids, a Facebook bug allowed \"children in certain circumstances\" to \"communicate with unapproved contacts in group text chats and group video calls.\" In 2019, Facebook confirmed to The Verge that the technical issue had occurred and thousands of users were notified about the bug, which affected \"a small number of group chats.\"According to the FTC, this is the third time that Facebook has violated a privacy order. Facebook has also violated the FTC Act and the Children’s Online Privacy Protection Act Rule, the FTC alleged.“The company’s recklessness has put young users at risk, and Facebook needs to answer for its failures,” Levine said in the press release.A Meta spokesperson told Ars that the FTC's proposed changes are \"a political stunt,\" saying that the FTC gave Meta \"no opportunity to discuss this new, totally unprecedented theory.\" Meta considers the FTC's proposed changes to the privacy order \"a new low.\"\"Let’s be clear about what the FTC is trying to do: usurp the authority of Congress to set industry-wide standards and instead single out one American company while allowing Chinese companies, like TikTok, to operate without constraint on American soil,\" Meta's spokesperson said. \"FTC Chair Lina Khan’s insistence on using any measure—however baseless—to antagonize American business has reached a new low.\" [Update: Facebook says that the assessor's report did not find violations of the 2020 privacy order and noted that the two privacy concerns that the FTC raised were already discovered, fixed, and publicly disclosed.]The FTC's proposed changes were drafted in response to a report from an independent assessor who reviewed Facebook's privacy program and concluded that there were \"several gaps and weaknesses\" in it. Some of these deficiencies, the FTC alleges, \"pose substantial risks to the public.\"Among the most drastic proposed changes are a blanket prohibition against monetizing data of users under 18 and a pause on launching new products, services, or features \" without written confirmation from the assessor\" confirming full compliance with the FTC's order. The FTC has also proposed additional limitations on Meta's uses of facial recognition technology and an extension of the 2020 order's compliance requirements to encompass all companies merged under Meta. Finally, the FTC proposes going back to the drawing board on the 2020 privacy order and strengthening many of the existing requirements, including \"those related to privacy review, third-party monitoring, data inventory and access controls, and employee training.\"Meta's spokesperson told Ars that the company contends that it has \"spent vast resources building and implementing an industry-leading privacy program under the terms of our FTC agreement.\"\"We will vigorously fight this action and expect to prevail,” Meta's spokesperson told Ars.Meta has 30 days to officially respond to the proposed changes, but ultimately, the FTC says it will \"determine whether modification of the 2020 order is in the public interest or justified by changed conditions of fact or law.\"READER COMMENTS115WITHASHLEY BELANGERAshley is a senior policy reporter for Ars Technica, dedicated to tracking social impacts of emerging policies and new technologies. She is a Chicago-based journalist with 20 years of experience.Channel Ars TechnicaSITREP: F-16 replacement search a signal of F-35 fail?Footage courtesy of Dvids, Boeing, and The United States Navy.SITREP: F-16 replacement search a signal of F-35 fail?Sitrep: Boeing 707The F-35's next tech upgradeUS Navy Gets an Italian AccentSITREP: DOD Resets Ballistic Missile Interceptor programSITREP: DOD's New Long-Range Air-to-Air Missile Aims to \"Outstick\" ChinaArmy's New Pistol Has Had Some MisfiresArmy's Next (Vertical) Lift En RouteSITREP: President Trump's Missile Defense StrategyHybrid Options for US's Next Top FighterThe Air Force’s Senior Citizen Chopper Can’t Retire YetArs Live #23: The History and Future of Tech LawPolice re-creation of body camera evidence - Pueblo, CO | Ars TechnicaVisual Labs body camera software with the Dos Palos PD | Ars TechnicaHe knew his rights; he got tased anywayMore videos← PREVIOUS STORYNEXT STORY →Related StoriesToday on Ars",
    "summary": "- The Federal Trade Commission (FTC) alleges that Facebook has failed to comply with a 2020 privacy order and has caused new harm, including misrepresenting Messenger Kids' access to private youth data.\n- The FTC has proposed changes to the 2020 order, including prohibiting Meta from launching new products on its platforms without written FTC compliance confirmation and preventing the company from monetizing any youth data it collects.\n- Meta has 30 days to respond to the proposed changes, but the FTC will determine whether modification of the 2020 order is in the public interest or justified by changed conditions of fact or law.",
    "hn_title": "Facebook has not been doing enough to comply with a 2020 privacy order: FTC",
    "original_title": "Facebook has not been doing enough to comply with a 2020 privacy order: FTC",
    "score": 465,
    "hn_content": "The US Federal Trade Commission (FTC) has accused Facebook of not complying with a privacy order put forward in 2020. The scale of remediation from Facebook does not match the scale of the accusations in the press release. The FTC’s order to show cause (OSC) has almost entirely been redacted, which raises questions about what Facebook has done to result in this response. The comment section mainly discusses Facebook’s quality of stewardship of FOSS and OSS projects. There are debates over root reactions to defend Meta and ideas of faux-pen source, which can make a meaningful act at the scale of the person whose job, it is and the community, while the company can switch projects when they become useless.The post discusses the power that tech companies have over society, even if they claim not to force users to use their products. It highlights three unethical pillars of Facebook: data privacy, depleting mental health, and spreading fake news. The post includes comments from users discussing Facebook's violation of privacy and the company's harmful impact on society, including the manipulation of children. Users also mention concerns about other tech companies, such as Roblox, and the need for informed consent for advertising. Overall, the post sheds light on the negative consequences of tech companies' practices.Facebook violated a 2012 FTC consent decree that required the social media platform not to misuse user data, by using phone numbers provided for security purposes to target ads; The FTC has imposed a $5bn fine, the largest ever levied against any tech company; Critics argue that the fine is insufficient and doesn't touch the fundamental issues surrounding Facebook's business model; Some compare Facebook's ad practices to the tobacco industry, pointing out the addictive nature of social media and the harm caused to mental health; There are debates over how to regulate social media, given the First Amendment; Critics say that it's not possible to regulate a single company, and that regulation should focus on the entire industry rather than a single player.Currently, there is discussion around the need for balanced discussions and age verification to solve social media issues such as echo chambers and manipulation of users by a small number of bots. There is no entity currently that people trust to provide comprehensive solutions to these issues, and TikTok's ban is not seen as a comprehensive solution. Social media platforms such as Facebook are continually under fire by regulators due to repeated privacy violations. However, some argue that bad press is good for these companies, which prioritize monetization of user data. Ultimately, there are concerns that social media has become too addicting and that more regulation is necessary to address these issues.The FTC has proposed changes to its 2020 order against Facebook owner Meta to prohibit the launching of new products on any of its platforms without written compliance confirmation and prevent the monetization of youth data collected across Facebook, Instagram, WhatsApp, and Oculus. The order would enforce Facebook’s compliance with 2012 and 2019 orders. However, depictions of the FTC as having total regulatory power are inaccurate, and some commentators have questioned whether its proposed penalties would be enough. Text includes sarcastic comments advocating the use of force for data privacy, a defense of targeted advertising, discussion of Facebook's past FTC violations, and a call for new personal property rights and protections for data privacy.The US FTC alleged that Meta has violated an existing privacy order with regards to data collection on children. The proposed changes to the privacy order call for a ban on monetizing youth data, limit the ability to collect data from under-13s on apps and websites developed for adult users, and strip companies of data they previously collected on users turning 13. In a statement, Meta vowed to fight the proposal. Users' opinions on the effectiveness and relevancy of ad targeting on Facebook vary, but effective ad targeting is critical for niche businesses. Some suggest targeting children may be harmful and manipulative. Despite the potential harm, the future of ad targeting is important to the internet economy, as is respecting basic human liberties.The discussion revolves around the use of the term \"furious\" to describe a corporation's reaction to a ban. Some argue that corporations cannot feel emotions, and the term is anthropomorphizing.\n\nOthers suggest that emotions can be expressed through PR and media on behalf of the corporation.\n\nSome commenters propose the use of AI trained on employee conversations to determine the corporation's emotions.\n\nThere is sarcasm and humor in some of the comments, but the crux of the discussion is around whether a corporation can feel emotions or express them.",
    "hn_summary": "- FTC's order to show cause (OSC) almost entirely redacted, raising questions about Facebook's actions\n- Discussions around Facebook's violation of privacy, harmful impact on society, and need for regulation"
  },
  {
    "id": 35809570,
    "timestamp": 1683158784,
    "title": "The money spent on lotteries doesn't go to the park",
    "url": "https://outdoorstatus.com/articles/recreation-gov-lottery-fees/",
    "hn_url": "http://news.ycombinator.com/item?id=35809570",
    "content": "DestinationsCancellation AlertsDeadlinesUnited StatesNo, the money you spend on lotteries doesn’t go to the parkFrom January to September 2022, permit fees for The Wave amounted to $958,020. Of this amount, Recreation.gov made $487,180. The park? $470,840.To protect the sensitive landscape around The Wave, the Bureau of Land Management set up a lottery to limit access. It costs $9 to enter the lottery, $5 which goes to the BLM. These $5 go right into Recreation.gov’s pockets — which is managed by Booz Allen Hamilton, a 12 billion dollar government and military contractor. The BLM on the other end collects a $4 lottery application fee plus a $9/person fee, but only on successful applications. Because The Wave lottery has a 3% success rate, you can imagine how Recreation.gov can make more money than the BLM.This is not a unique situation. For all lotteries managed by Recreation.gov, Recreation.gov charges $6 to $10 per application.Angels Landing LotteryJan-Sep 2022 revenue$721k$423kRec.govPark$6 per lottery application goes to recreation.gov.$3/person per successful lottery application goes to the park.Half Dome LotteryJan-Sep 2022 revenue$628k$325kRec.govPark$10 per lottery application goes to recreation.gov.$10/person per successful lottery application goes to the park.The Wave LotteryJan-Sep 2022 revenue$487k$471kRec.govPark$5 per lottery application goes to recreation.gov.$4 per lottery application and $9/person per successful lottery application goes to the park.Yosemite LotteryJan-Sep 2022 revenue$276k$143kRec.govPark$10 per lottery application goes to recreation.gov.$6/person per successful lottery application goes to the park.Enchantment LotteryJan-Sep 2022 revenue$215k$161kRec.govPark$6 per lottery application goes to recreation.gov.$5/person/night per successful lottery application goes to the park.Mt. Whitney LotteryJan-Sep 2022 revenue$158k$256kRec.govPark$6 per lottery application goes to recreation.gov.$15/person per successful lottery application goes to the park.Mt. Rainier LotteryJan-Sep 2022 revenue$71k$186kRec.govPark$6 per lottery application goes to recreation.gov.$20 per successful lottery application goes to the park.North Cascades LotteryJan-Sep 2022 revenue$43k$26kRec.govPark$6 per lottery application goes to recreation.gov.$20 per successful lottery application goes to the park.Yellowstone LotteryJan-Sep 2022 revenue$32k$128kRec.govPark$10 per lottery application goes to recreation.gov.$5/person/night per successful lottery application goes to the park.If you want to maximize your chances of winning the lottery, have a look at my analysis of The Wave, Mt. Whitney, Half Dome, and Enchantment lotteries.Some permits like Yosemite, Mt. Whitney, Enchantment, Mt. Rainier, North Cascades, and Yellowstone allow you to book outside of the lottery. Permits run out quickly, but you can use Outdoor Status to notify you when we find canceled permits.Next issue on the 25thNever miss a permit deadline ever again!Once a month, receive the list of top permits that are opening upTry it1,000+ backpackers already enjoy itLast issueThe charts where created using historical reservation data from Recreation.gov.Corrected on May 4. An earlier version of this article showed that Recreation.gov received $9 for every to The Wave. This was incorrect, for every lottery application, $4 goes to the BLM.DestinationsCancellation AlertsUpcoming deadlinesLast IssueArticlesContactCreated by Jordan Vincent",
    "summary": "- Recreation.gov charges fees for managing lotteries for access to national parks and destinations, such as The Wave, Angels Landing, Half Dome, and more.\n- The fees charged range from $5 to $10 for every lottery application, with varying fees for successful applications going to both the Recreation.gov and specific parks or destinations.\n- Recreation.gov earns more revenue from lotteries than the parks or destinations, and some permits can be booked outside of the lottery through Outdoor Status.",
    "hn_title": "The money spent on lotteries doesn’t go to the park",
    "original_title": "The money spent on lotteries doesn’t go to the park",
    "score": 439,
    "hn_content": "The article discusses the issue of limited availability of permits for popular national parks, causing an \"automation arms race\" among those trying to reserve them. The author proposes disrupting the monopoly of Booz Allen Hamilton, who profits off the permit acquisition systems, and eliminating the junk fees. The post also highlights the controversy surrounding the legality of Booz Allen Hamilton's role. Some commenters suggest alternative systems, such as a raffle or auction, to make the process more equitable. However, others criticize these options, as they may disadvantage poorer individuals. The article raises concerns about accessibility to public lands, which should not be dependent on one's programming skills or financial resources.The article discusses the controversy surrounding the lottery system for obtaining tickets to popular national parks and raises questions about the fairness of the system. It discusses possible solutions such as giving poor people money and raising the tax ceiling, but argues that auctions are not feasible for national parks because of limited supply. Some people criticize the current system for being exploited by private companies like Booz Allen Hamilton that keep the fees. The article suggests charging nominal fees to enter the lottery and making tickets non-transferable as solutions.The article discusses the use of photo ID verification to combat ticket scalpers for national parks and other outdoor attractions. It highlights the issues that arise when resellers are able to buy up spots and the negative impact it has on people wanting to attend. Some readers suggest alternative solutions, including the use of reverse auctions or large fees for access. Overall, the article sheds light on the ongoing challenges of managing access to public spaces, particularly as interest increases and technology enables new forms of abuse.The discussion centers on the issue of how difficult it is to reserve campsites through Rec.gov, which is run by Booz Allen Hamilton. The system is slow and complex, causing frustration among potential campers and leading some to go camping on public land instead. Some commenters argue that camping should be a lottery system to prevent wealthier people from having an advantage. Others suggest exploring public land for campsites and leaving no trace. Some express concern about the effect of social media and advertising on nature sites, which leads to overcrowding and damage to the environment. The issue of fees going to a private company is also raised.Recreation.gov uses a lottery system to manage reservations for popular National Park sites, with a $9 lottery fee. $5 of this fee goes to Booz Allen Hamilton, the contractor managing the Recreation.gov website, and $4 goes to the Bureau of Land Management. The website has a complex data model with a mix of different response structures for various land management agencies. The JSON request for campsites is standardized for different campgrounds under different agencies. The permit system has a lot of free text fields and manual processes that take hours to weeks. Congressman Ryan Zinke has criticized the permit system. There is skepticism about why the government isn't doing the work themselves, or why they can't use existing services like the United States Digital Service.No meaningful content to summarize.",
    "hn_summary": "- Some commenters suggest alternative systems such as raffles or auctions, while others criticize these options as potentially disadvantaging poorer individuals. \n- The article raises concerns about accessibility to public lands, which should not be dependent on one's programming skills or financial resources, and suggests solutions such as charging nominal fees and making tickets non-transferable."
  },
  {
    "id": 35814113,
    "timestamp": 1683202435,
    "title": "EARN IT Act undermines the privacy, security, & safety of law-abiding users",
    "url": "https://techfreedom.org/earn-it-act-remains-a-threat-to-liberty-security-safety-of-children/",
    "hn_url": "http://news.ycombinator.com/item?id=35814113",
    "content": "Yesterday, TechFreedom sent a letter to the Senate Judiciary Committee raising concerns about the Eliminating Abusive and Rampant Neglect of Interactive Technologies Act of 2023 (EARN IT Act). As it did when introduced in each of the past two sessions of Congress, the EARN IT Act undermines the privacy, security, and safety of law-abiding users while making prosecution of child sexual abuse crimes more difficult.“As reintroduced, EARN IT dramatically increases the risk of liability for any service that offers end-to-end encryption,” said Ari Cohn, TechFreedom’s Free Speech Counsel. “The bill pretends to allow companies to offer encrypted services but in reality ensures that offering those services will be considered as evidence in cases brought under state laws. No rational business will offer end-to-end encryption if it can be evidence that they were reckless or negligent because they were unable to detect or block offending communications.”“If lawmakers are truly concerned that foreign adversaries and rogue government agencies are snooping on private communications, undermining encryption is the last thing they should do,” Cohn continued. Last month, Elon Musk sparked outrage by alleging that the federal government previously had access to Twitter users’ private direct messages. Access, Musk added, that was possible only because DMs are not encrypted. And buried under concerns about TikTok is a report that a state-sponsored Chinese hacking group is actively targeting companies—including social media and telecommunications companies—to collect intelligence. “Coercing services to abandon encryption only makes us more vulnerable to government overreach and attacks from hostile foreign adversaries,” Cohn noted.“EARN IT shoots itself in the other foot, too: it will undermine, not assist, prosecutions for CSE and CSAM offenses,” Cohn continued. EARN IT supporters have admitted that their goal is to force companies to do more to combat CSAM, including by monitoring user communications and searching for offending content—facilitated by the abandonment of strong encryption. But that coercion likely transforms companies’ efforts into state action subject to the Fourth Amendment. Because private companies cannot obtain a warrant, evidence obtained from such activities would be inadmissible in court—allowing predators to go free. “There simply is no upside to EARN IT,” Cohn concluded. “For three years now we have explained the harms of this legislation; it’s time Congress listened.”In our letter sent prior to EARN IT’s markup last year, we addressed these and other concerns in more detail, suggesting revisions that may ameliorate them to some degree.###We can be reached for comment at media@techfreedom.org. Read our related work, including:Our coalition letter explaining the harmful effects of the EARN IT Act of 2022 (Mar. 3, 2023)The Top Ten Mistakes Senators Made During Today’s EARN IT Markup, Techdirt (Feb. 10, 2022)Our letter proposing five amendments to the EARN IT Act of 2022 (Feb. 8, 2022)Appearance on the Ross Kaminsky Show to discuss the EARN IT Act of 2022 (Feb 3, 2023)Our letter on the markup of the EARN IT Act of 2020 (June 30, 2020)The Unconstitutional, Unworkable EARN IT Act (Jun 29, 2020)Our statement on the introduction of the of the EARN IT Act of 2020 (Mar 5, 2020)About TechFreedom: TechFreedom is a nonprofit, nonpartisan technology policy think tank. We work to chart a path forward for policymakers towards a bright future where technology enhances freedom, and freedom enhances technology.",
    "summary": "- The EARN IT Act undermines the privacy, security, and safety of law-abiding users while making child sexual abuse crime prosecutions more difficult.\n- The bill increases the risk of liability for any service that offers end-to-end encryption and ensures that offering those services will be considered as evidence in cases brought under state laws.\n- Coercing services to abandon encryption only makes us more vulnerable to government overreach and attacks from hostile foreign adversaries, and will undermine, not assist, prosecutions for CSE and CSAM offenses.",
    "hn_title": "EARN IT Act undermines the privacy, security, and safety of law-abiding users",
    "original_title": "EARN IT Act undermines the privacy, security, and safety of law-abiding users",
    "score": 337,
    "hn_content": "The Tech Freedom website claims that the EARN IT Act undermines privacy, security, and safety. Many comments are focused on legal and moral philosophy, debating whether or not pornography should be regulated or banned. One comment suggests that generative AI could replace the entire industry of pornography. Another commenter expresses frustration that many laws are dressed in the \"WON'T SOMEBODY THINK OF THE CHILDREN?!\" sheepskin.A discussion thread on Hacker News covers a wide range of topics, including the moral acceptability of pornography, end-to-end encryption, Tor exit nodes, children's issues, and the state of politics. Some users suggest banning child marriage to protect children, while others propose laws requiring bills to be read out loud in Congress to ensure comprehension. The thread includes references to sources such as a Gallup poll on pornography, a news article on TechFreedom, and the Turpin case.The EARN IT bill, which aims to regulate tech companies to combat child sexual abuse material, is being criticized for weakening encryption. The bill is seen as a threat to privacy and the constitutional rights of tech companies. Experts suggest that voluntary guidelines may lead to legal liabilities for tech firms, but the bill can still be stopped with public outrage. The rise in self-generated imagery has opened discussions around the age of consent, while critics argue that targeted investigation by federal prosecutors would be more effective than domestic mass surveillance. The debate around regulating tech and balancing privacy with safety continues.A discussion on the role of end-to-end encryption in criminal investigations has divided opinions among experts. Some argue that even with a lawful warrant, the US government cannot access data protected by E2EE in criminal or counterintelligence investigations. However, others suggest that the end devices could be seized if necessary. The discussion also touched upon the issue of child sexual abuse material (CSAM), which some argue is being used as an excuse by state security establishments to restrict civil liberties using scare tactics. It is noted that CSAM is a serious issue, but case numbers can be misleading, with some cases arising from teenage couples sharing explicit images between themselves. The conversation highlights the ongoing debate about how to balance privacy and security concerns in the digital age.",
    "hn_summary": "- Discussions on Hacker News cover a wide range of topics, including the moral acceptability of pornography, end-to-end encryption, Tor exit nodes, children's issues, and the state of politics.\n- The conversation highlights the ongoing debate about how to balance privacy and security concerns in the digital age, including the role of end-to-end encryption in criminal investigations."
  },
  {
    "id": 35813496,
    "timestamp": 1683197263,
    "title": "The seven programming ur-languages (2021)",
    "url": "https://madhadron.com/programming/seven_ur_languages.html",
    "hn_url": "http://news.ycombinator.com/item?id=35813496",
    "content": "The article discusses seven \"ur-languages\" in programming: ALGOL, Lisp, ML, Self, Forth, APL, and Prolog. While fundamentals are the same across programming languages, different ur-languages have distinct collections of fundamentals. These ur-languages form the basis for different programming paradigms. ALGOL is the oldest ur-language and is known for its sequence of assignments, conditionals, and loops. Lisp uses prefix expressions enclosed in parentheses and has a built-in representation of lists as a data structure. ML is characterized by functions as first-class values and recursion for iteration. Self focuses on object orientation in which all behavior is implemented by objects sending messages to each other. Forth is a stack-based language with arithmetic done backwards. APL is an array language where everything is an array and operators are one to two symbols long. Finally, Prolog is a logic language for programming based on first-order logic. The article recommends branching out from the fundamental ALGOL language to learn other ur-languages for a broader understanding of programming.- Building Forths is integral in understanding the language, and can be done fairly quickly by a single person.\n- gForth is a good ANS Forth implementation to learn the language.\n- McCabe's book FORTH Fundamentals, Volume 1 is a preferred resource for building Forths.\n- Other good Forths to study include PygmyForth, eForth, and Chuck Moore's colorForth.",
    "summary": "- The article introduces seven \"ur-languages\" in programming that serve as the basis for different programming paradigms: ALGOL, Lisp, ML, Self, Forth, APL, and Prolog.\n- Each ur-language has distinct collections of fundamentals, such as ALGOL's sequence of assignments, conditionals, and loops, and Lisp's prefix expressions enclosed in parentheses.\n- The article recommends branching out from fundamental ALGOL to learn other ur-languages for a broader understanding of programming, with Forth being an integral language to study, especially through McCabe's book FORTH Fundamentals, Volume 1.",
    "hn_title": "The seven programming ur-languages (2021)",
    "original_title": "The seven programming ur-languages (2021)",
    "score": 331,
    "hn_content": "The post on Hacker News discusses an interesting selection of macro-based programming languages and their evolution. The discussion mentions how macro programming languages such as m4 and TeX, as well as graphical programming languages used in industrial control like ladder logic deserve their own category. SQL is also mentioned as an accidentally general-purpose language. Reactive/synchronous languages also deserve their own category, and Verilog and VHDL are considered hardware definition languages that differ from traditional software programming languages.A discussion thread on Hacker News explores the idea of \"ur-languages\", languages that are influential in shaping future programming languages. The thread includes commentary from individuals who recommend languages like VHDL/Verilog for lower-level programmers, and advocate for the inclusion of Erlang as an \"ultra-scaling actor model\". Some commenters question the narrowness of the \"OO\" category and call for inclusion of message-passing languages like Ruby and Smalltalk. The thread also discusses the uselessness of the expression/statement distinction and how it's implemented in different languages. Overall, the thread provides interesting insights into the different opinions and experiences of programmers on foundational programming languages.The post discusses differences between methods and blocks in the context of programming languages, particularly in Ruby, and critiques the categorization of programming languages as ALGOL, Lisp, ML, or Self/Smalltalk. The article argues that Self is a purer form of object-oriented programming than Smalltalk and that every programmer should know a language in the ALGOL family well before branching out to new languages. Additionally, readers share their own experiences with learning Lisp, Scheme, and Forth, and recommend them as important ur-languages to learn.The article discusses different language families and their defining characteristics. The writer suggests seven \"ur-languages\" exist in software today. The comments section debates which languages should be included, with some suggesting Simula as the first object-oriented language and Smalltalk as a more influential object-oriented language. The concept of \"value semantics\" and \"copyable and move-only values\" is mentioned but deemed contradictory. Lastly, the comment section suggests adding probabilistic languages, shell languages, and languages like Coq to the list. The article and comments section may interest intermediate programmers looking to expand their language knowledge.This post discusses the concept of \"ur-languages,\" which are programming languages considered to be fundamental to the development of others. It provides a list of examples from different language families and discusses their unique features. The post also touches on the practical differences between languages designed for programming versus those designed for specification. There is no new or exciting product release or development covered in this post.A discussion on programming vs. proof languages including TLA+ and Agda. \nTLA+ code is similar to Prolog owing to first-order logic roots but is more \"imperative.\" \nExcel and Spin could be added to the classification. \nObjective C is a Smalltalk-derived language that is still heavily used. \nLucid is a dataflow ur-language akin to ALGOL, Lisp, and ML.",
    "hn_summary": "- The comments section discusses the inclusion of hardware definition languages, message-passing languages, and probabilistic languages into the list of ur-languages.\n- The post and discussions provide insights and recommendations for intermediate programmers looking to expand their language knowledge."
  },
  {
    "id": 35809658,
    "timestamp": 1683159494,
    "title": "Mojo might be the biggest thing to happen in programming for decades",
    "url": "https://www.fast.ai/posts/2023-05-03-mojo-launch.html",
    "hn_url": "http://news.ycombinator.com/item?id=35809658",
    "content": "- Mojo is a new programming language that is based on Python but offers improved performance and deployment options.\n- Python has limitations in terms of performance, and the process of converting models to a faster implementation can be difficult and requires using a subset of the language that matches the deployment target.\n- Mojo builds on powerful foundations, such as MLIR, which has been developed for many years, and using Python as the syntax makes it easier to develop the language.\n- Mojo allows developers to opt into a faster mode by using \"fn\" instead of \"def\" to create a function, and using \"struct\" instead of \"class\" can help optimize memory usage.\n- Mojo is designed to work with modern accelerators and offers Python programmers access to features that allow languages like C to be fast.Mojo is a new programming language developed by Chris and his team, specifically designed to improve Python's performance and deployment issues. It allows for easy deployment like C but offers an elegant Python-like language for developers. Mojo is not limited to AI/ML applications and can produce fast, small, easily-deployed applications that take advantage of all available cores and accelerators. Other solutions, like Julia, Jax, and Numba, have attempted to solve the same problems but fall short in some areas. Julia relies on garbage collection, and Jax creates a domain-specific language (DSL), limiting developers' flexibility. Numba and Cython exist as band-aid solutions to Python's performance problems and are unable to generate standalone binaries like Mojo. Mojo's deployment story is much like C's, providing small programs that launch and run quickly.",
    "summary": "- Mojo is a programming language based on Python that offers improved performance and deployment options.\n- It allows developers to opt into a faster mode and optimize memory usage.\n- Mojo is designed to work with modern accelerators and can produce fast, small, easily-deployed applications.",
    "hn_title": "Mojo might be the biggest thing to happen in programming for decades",
    "original_title": "Mojo might be the biggest thing to happen in programming for decades",
    "score": 313,
    "hn_content": "Chris Lattner, the creator of Swift, is working on a new programming language called Mojo that prioritizes compile speed and predictability. Mojo's type system is simple and fast by design, avoiding the exponential behavior that plagues some languages. Mojo also has core compiler improvements that address issues with LLVM and scaling of zero cost abstractions. The language is currently only available in an online playground and is not yet open source. While some commenters express skepticism due to past issues with Swift, others are excited about Mojo and its potential for modern accelerators. Some also hope that Mojo could solve Python's package management issues.The programming language Julia is criticized for its lack of ahead-of-time (AOT) compilation capabilities, which are necessary for time-sensitive applications like robotics and autonomous systems. However, some believe that the newer programming language Mojo could fill the gap with easier-to-understand and concise syntax. Julia's syntax is considered to be less popular among software engineers more familiar with languages like Python, MATLAB, and Fortran, and the language is often regarded as being geared towards mathematicians, scientists, and engineers interested in number crunching and less so with good software engineering practices. Despite Julia's growing usage, software developers note that a more accessible and unified systems language is necessary to help build and deploy machine learning models to production environments.Modular's new programming language, Mojo, aims to give developers control over static behavior while providing predictable and controllable performance. Mojo is built on a minimal Python-like core and is designed to work with the Python ecosystem while giving programmers the ability to adopt it incrementally where it makes sense. Mojo's more advanced ownership system than Rust or Swift and the fact that it was developed on its own help set it apart. However, it remains to be seen whether it can compete with established projects such as Graal/Truffle, which have already yielded significant speedups for existing code and could be further optimized for running untyped Python at high speeds.Mojo is a new programming language that is a superset of Python with a faster runtime which aims to solve the \"two languages\" problem in machine learning. It is developed by a team including Chris Lattner, who created LLVM, Clang, and Swift, and Jeremy Howard, who co-founded fast.ai. Mojo features optional strong typing, tight performance integration with LLVM-based MLIR, manual memory management, and tightly-packed structs. It is currently in the early stages of development, and there is no public release or license yet. Mojo aims to offer a deployment story to compete with web assembly. Some developers are excited about the promising idea, while others find it complicated and prefer using other languages with powerful libraries and an existing ecosystem.- Mojo has a full ownership system based on Rust and Swift.\n- Memory management can be handled manually or through Python ref counting.\n- Borrow-checking is still under development.\n- Mojo consumes Python to build on top of it.\n- Some comments debate the need for a new programming language.\n- Chris Lattner, one of Mojo's creators, has a controversial history with Objective-C.",
    "hn_summary": "- The language is built on a minimal Python-like core and features optional strong typing and tight performance integration with LLVM-based MLIR.\n- Some developers are excited about Mojo's potential for modern accelerators and its ability to solve the \"two languages\" problem in machine learning, while others express skepticism due to past issues with Swift and debate the need for a new programming language."
  },
  {
    "id": 35813763,
    "timestamp": 1683199319,
    "title": "Shopify will be smaller by about 20% & Flexport will buy Shopify Logistics",
    "url": "https://news.shopify.com/important-team-and-business-changes",
    "hn_url": "http://news.ycombinator.com/item?id=35813763",
    "content": "COMPANY NEWSImportant team and business changesMay 4, 2023Share this story:Team - We are changing the shape of Shopify significantly today to pay unshared attention to our mission. There are a number of consequences to this, and I don’t want to bury the lede: after today Shopify will be smaller by about 20% and Flexport will buy Shopify Logistics; this means some of you will leave Shopify today. I recognize the crushing impact this decision has on some of you, and did not make this decision lightly. In the next 5 minutes you’ll get a follow up that tells you if you are affected. There’s no way to make this good news, but we designed a package that will attempt to make it the best possible version of a bad day. I've included details below on how we will support you. Our main questsShopify finds it useful to talk about the difference between main quests and side quests internally. The main quest of the company is its mission, the reason for the company to exist. Side quests are everything else. Side quests are always distracting because the company has to split focus. Sometimes this can be worth it, especially when engaging the side quest creates the conditions by which the main quest can become more successful. In the beginning, as a small startup, companies are intensely focused. It’s often said that larger companies are more sluggish but this is not because of their size, it's because of all the side quests and distractions they accumulate along the way. This happens because larger companies can afford to be somewhat inefficient, especially during stable economic boom times. But once they need to adapt to some new paradigm they can’t. They will get replaced by more focused competitors, or collapse outright.For the past year we’ve been subtracting everything that’s in the way of making the best possible product. This is extremely important, because we are heading into a decade of high velocity and massive change. We will require speed, agility, and a great deal of innovation. Shopify’s main quest is to make commerce simpler, easier, more democratized, more participatory, and more common. I think that we have built the best commerce platform in the world for that. Technological progress always arcs towards simplicity, and entrepreneurs succeed more when we simplify. But now we are at the dawn of the AI era and the new capabilities that are unlocked by that are unprecedented. Shopify has the privilege of being amongst the companies with the best chances of using AI to help our customers. A copilot for entrepreneurship is now possible. Our main quest demands from us to build the best thing that is now possible, and that has just changed entirely. Shopify LogisticsBuilding logistics infrastructure is a side quest every ecommerce entrepreneur is eventually pulled into because of the way the logistics industry works: a series of disparate players, all focused on different aspects. To run your store you work with extremely carefully designed software. To run logistics, you will use pen, paper, and phone calls a lot. And most of the time your service providers don’t talk to each other. Coordinating them to act together is your burden.Instead of every merchant individually taking on their own side quest, Shopify decided to accept it on their behalf. We set to work building software addressable logistics that didn’t exist before.Logistics was clearly a worthwhile side quest for us, and started to create the conditions for our main quest to succeed. From the beginning, we worked with lots of partners on all aspects of this same problem: warehouses, robotics, transportation, crossdock, freight. We iteratively built a solution, step by step, through software, leases, and M&A deals, that could be an independent company one day. Shopify was the perfect place to bootstrap this effort from 0 to 1 and we have done this. The next step is to take what we have and take it from 1 to N as a main quest. Today we are announcing that Flexport will buy Shopify Logistics, becoming the preferred logistics partner for Shopify. Flexport, led by CEO Dave Clark and Founder Ryan Petersen, is the best builder and operator in the world of logistics. Contributing our work to Flexport, under the leadership of Harish Abbott, allows everything about Shopify Logistics to be more ambitious and global in nature. Making the global supply chains efficient and software addressable is Flexport’s main quest and so this is the perfect home for this part of Shopify. Managers and Crafters Shopify thinks of itself as a crafter-centric vocational company. It’s the crafters that cause the words, bytes, pixels, and floating point weights which allow millions of entrepreneurs to build their businesses and hundreds of millions of buyers transacting on the platform. Crafters are experts in their domains and are trusted to be self motivated. We don’t rely on management to be the task masters. The role of a crafter is to bring everything they uniquely have to build something wonderful. The role of managers is different. Great managers take individuals and turn them into teams, snowplow obstacles, remove ambiguity, help crafters do their best and most creative work and, most importantly, ensure that the wonderful work of crafters aligns with the roadmap and is of impact for merchants. Management track and crafter tracks are held separately at Shopify. The balance of crafter to manager numbers is a tricky one to strike. Too few and you risk misalignment on the most important things, too many and you add heavy layers of process, approvals, meetings and… side quests. Our numbers were unhealthy, just like it is in much of the tech industry. One of the insidious consequences of this is that it leads to the company increasingly celebrating activities rather than crafter driven outcomes. With the right numbers we’ll fully focus on outcomes and impact. A more fit for purpose Shopify centered on its main quest has less scope creep, fewer meetings, and more shipping great features for our merchants. To those leaving todayEveryone will process this in their own way, and it’s hard for everyone, affected or not. For those leaving us today, you will receive a minimum of 16 weeks severance plus a week for every year of tenure at Shopify. Medical benefits and access to our employee assistance program (EAP) will be covered through this same period. We’ll also offer outplacement services if you want them, all office furniture we provided is yours to keep. We legally need the work laptop back, but we’ll help pay for a new one to replace it. You’ll have continued free access to the advanced Shopify plan should you opt to take an entrepreneurial path in future. You’ll have a chance to talk more about this when you meet with a leader later today. We will also keep Slack and internal email open today for everyone so we can share farewells. My sincere thanks go out to each of you for everything you’ve done for Shopify and our merchants. Fit for purposeThis is a consequential and hard week. It’s the right thing for Shopify but it negatively affects many team members who we admire and love working with. This is one of those times where both right and hard are true at the same time. My belief is that any enduring company makes a habit of doing the right thing, even if easy outs present themselves. Yet it doesn’t get easier to make a decision like this, and I hope it never does.Shopify is stacked with exceptionally talented, merchant obsessed people. Crafters thrive in the best environment, given the best technology and tools with which to grow and develop their skills. Managers are deeply committed to the craft of management, all in on building incredible teams. Inspired tooling and systems will reduce the coordination tax. And everyone at Shopify is pursuing a singular, focused main quest - our ambition is greater than ever.- tobi CEO Shopify“The most important thing is to keep the most important thing the most important thing”Company newsShare this story:",
    "summary": "- Shopify is undergoing significant changes to refocus on its main quest of making commerce simpler, easier, more democratized, more participatory, and more common.\n- As a result, Shopify will be smaller by about 20%, with some team members leaving.\n- Flexport will buy Shopify Logistics, becoming the preferred logistics partner for Shopify, allowing everything about Shopify Logistics to be more ambitious and global in nature.",
    "hn_title": "Shopify will be smaller by about 20% and Flexport will buy Shopify Logistics",
    "original_title": "Shopify will be smaller by about 20% and Flexport will buy Shopify Logistics",
    "score": 299,
    "hn_content": "E-commerce platform Shopify will be downsizing by about 20%, and logistics company Flexport has acquired Shopify Logistics. The announcement has sparked discussions on Hacker News about interview processes at Shopify, with one user sharing a negative experience, and others cautioning job applicants to take care of themselves and stand up for themselves during the process. Some debate arose over the issue of whiteboard coding sessions during interviews, with some calling it a waste of time. Overall, the post mainly covers the Shopify logistics acquisition and generates discussions about company culture and job interviews.Shopify has faced criticisms over a letter sent to employees allegedly written by CEO Tobi Lütke detailing \"substantial changes at Shopify.\" Reports suggest that these will include significant cuts to the company's workforce and the sale of Shopify Logistics to Flexport. Among the letter's content was a reference to the board of directors' belief that Shopify had begun to lose its focus, which it said required paying \"unshared attention\" to its core mission. Critics lambasted the sometimes-quirky language used in the letter, while industry watchers drew comparisons to Amazon, whose former CEO Jeff Bezos fought to keep revenues in the business rather than paying out dividends.Shopify's recent layoff decision sparks debate on the current state of capitalism and its focus on profits over employee satisfaction and morale. Some argue that doing more with less can benefit society, while others worry about the impact on the skilled workforce and the need for wealth redistribution. The discussion highlights the challenge of reallocating skilled workers to new areas and the potential drawbacks of laying off employees. Ultimately, the conversation touches upon the responsibility of companies towards society and the impact of technology on the labor market.No meaningful content related to tech news. Most of the comments are discussing capitalism, layoffs, and society. One comment suggests that there are \"bullshit jobs\" in large corporations. Another comment argues for balancing creative destruction and moral obligations. Overall, this post does not contain any new or exciting information related to cutting-edge tech news.Shopify employees express disappointment and loss of trust after layoffs despite positive previous experiences working with the company. The layoffs imply a contradiction with company culture and values, leading to a possible loss in loyalty. Former employees opening up about their experiences reveal Shopify's efficient and empathic interviewing experience, with recruiters keen to optimize for nice and talented colleagues. Critics of capitalism argue that shareholder profits should not come at the expense of employees' job security, while defenders argue that efficient capital deployment is crucial to the market's long-term success. The interview process at Shopify includes a \"life story\" interview designed to assess a candidate's empathy and self-awareness. Cultural fit is an essential aspect of the interview process.Shopify CEO Tobias Lütke claimed in a tweet that the company is hiring aggressively, aiming to double its team size again in 2021, following a doubling of the engineering team in 2020. Many responses were positive, though a few were more skeptical about the reasons behind growth. Shopify has had a history of laying off employees, causing some to be concerned that new hires may just be temporary. Others question corporate practices like over-hiring followed by layoffs to cut costs or to answer investor pressure about high salaries. Regardless, Shopify is still growing fast and presents excellent job opportunities for engineers in the industry.- The talent pool for software engineers has dropped while salaries have exploded, with leet code, systems design, and other commodified skills becoming the most important for high-paying jobs\n- Software engineers today are not as skilled on average compared to what they think, similar to the dotcom bubble\n- Shopify has laid off a significant number of employees, leading to speculation about their ability to compete for talent in the future\n- AI will likely cause a concentration of wealth and create revolutionary conditions, although the form will differ by context\n- Unionizing is one possible solution, but there are limited options to address the challenges posed by capitalism and automation\n- The overhiring of employees can be seen as a long-term decision and not a mistake, as demonstrated by the high-inflation period\n- The CEO of Shopify has profited from the layoffs and has fallen down the crypto rabbit hole",
    "hn_summary": "- The layoffs imply a contradiction with Shopify's company culture and values, leading to a possible loss in loyalty. Critics argue that efficient capital deployment should not come at the expense of employees' job security.\n- Shopify CEO Tobias Lütke claimed in a tweet that the company is hiring aggressively and aiming to double its team size again in 2021, following a doubling of the engineering team in 2020, leading to positive responses but also skepticism about the company's ability to compete for talent in the future."
  },
  {
    "id": 35821927,
    "timestamp": 1683233682,
    "title": "Googlers angry about CEO's $226M pay after cuts in perks & 12,000 layoffs",
    "url": "https://arstechnica.com/tech-policy/2023/05/googlers-angry-about-ceos-226m-pay-after-cuts-in-perks-and-12000-layoffs/",
    "hn_url": "http://news.ycombinator.com/item?id=35821927",
    "content": "THE MEMES OF GOOGLERS' DISCONTENT —Googlers angry about CEO’s $226M pay after cuts in perks and 12,000 layoffsSundar Pichai compared to Lord Farquaad as employees share memes about CEO pay.JON BRODKIN - 5/4/2023, 12:47 PMEnlarge / Google CEO Sundar Pichai speaks at Vox Media's Code Conference on September 6, 2022, in Beverly Hills, California.Getty Images | Jerod Harris262WITHFollowing Google's layoff of 12,000 employees and other cost-cutting moves, employees are reportedly expressing anger about CEO Sundar Pichai's $226 million pay package.\"In the weeks since Pichai's annual compensation was made public, internal Google platforms have filled with conversations and memes slamming the CEO for taking a pay bump while slashing costs elsewhere,\" CNBC reported yesterday. CNBC's report said internal memes shared by employees also criticized Google owner Alphabet's recent authorization of a $70 billion stock repurchase program, the same amount as last year. Pichai is the CEO of both Alphabet and Google.According to CNBC, one \"popular meme showed an image of Shrek character Lord Farquaad with the text 'Sundar accepting $226 million while laying off 12k Googlers, cutting perks, and destroying morale and culture.'\" It also included the Farquaad quote, \"some of you may die, but that is a sacrifice I am willing to make.\"The median Alphabet employee was paid $279,802 in 2022. Although Alphabet lists Pichai's 2022 compensation as $226 million, most of it will vest over three years, and the amount could change. The total value is lower than the triennial award he got for the previous three-year period.“We respect shareholders more than Googlers”One meme with over 700 likes read, \"$70 billion in buybacks shows we respect external shareholders more than Googlers,\" according to CNBC. There were also reportedly memes \"comparing Pichai to Apple CEO Tim Cook, who in January received over a 40 percent cut from his 2022 target total compensation.\"Cook requested a pay cut that dropped his target compensation to $49 million in 2023. In 2022, Cook's target compensation was $84 million, but he ended up receiving $99.4 million.CNBC said it viewed over a dozen memes shared in Google's internal discussion forums, including one \"with more than 1,200 likes [that] referred to comments from finance chief Ruth Porat, who wrote last month in a rare companywide email that the company is making 'multi-year' cuts to employee services.\"\"Ruth's cost savings applied to everyone… except our hardworking VPs and CEO,\" the meme reportedly said. The spending cuts announced by Porat reportedly target office supplies, laptop replacements, fitness classes, snack bars, cafeterias, and more.When contacted by Ars, a Google spokesperson declined to comment on the report of employee complaints.After Google's January announcement of 12,000 layoffs, Pichai reportedly said in a meeting with staff that Google executives would take a \"very significant reduction in their annual bonus.\" Pichai wrote in an email to employees that \"I take full responsibility for the decisions that led us here,\" saying that over the past two years the company \"hired for a different economic reality than the one we face today.\" Alphabet had 190,234 employees at the end of 2022.In Q1 2023, Alphabet reported revenue of $69.8 billion and net income of $15.1 billion, outperforming analysts' expectations.CEO-to-worker pay ratio of 808:1Pichai's compensation includes a $218 million stock award that was granted in December 2022 and will vest over three years, according to a regulatory filing. The amount could change in value depending on the company's stock performance. Pichai's total pay in 2021 was listed as $6.3 million, and in 2020 it was $7.4 million.Pichai's listed annual pay varies significantly because of the large stock awards he's granted once every three years. His 2019 pay was $280.6 million and his 2016 pay was about $200 million.Alphabet reported that Pichai's 2022 compensation was 808 times more than the median employee's. \"Given that CEO equity awards are currently made on a triennial cadence, while our broad-based employee equity awards are typically made on an annual cadence, the pay ratio can fluctuate significantly across years. For example, our 2020 pay ratio was 27:1; our 2021 pay ratio was 21:1; and our 2022 pay ratio is 808:1,\" Alphabet's filing said.Alphabet's CEO-to-employee ratio was 1,085:1 in 2019, when Pichai was awarded $280.6 million and the median salary was $258,708. Apple reported a pay ratio in 2022 of 1,177:1. Apple's ratio is likely to drop in 2023 because of Cook's pay cut.In a December 2022 filing, Alphabet said that the \"vesting of a significant portion of the award will depend on Alphabet's total shareholder return (relative to S&P 100 companies), and this performance-based equity may not vest at all.\" Alphabet also said it increased the proportion of \"performance stock units\" in Pichai's pay package from 43 percent to 60 percent, and changed the S&P 100 percentile target from the 50th percentile to the 55th percentile.These changes will \"further align Mr. Pichai's compensation to long-term shareholder value creation and Alphabet's stock performance relative to the S&P 100 over the applicable performance periods,\" the company said.READER COMMENTS262WITHJON BRODKINJon has been a reporter for Ars Technica since 2011 and covers a wide array of telecom and tech policy topics. Jon graduated from Boston University with a degree in journalism and has been a full-time journalist for over 20 years.Channel Ars TechnicaSITREP: F-16 replacement search a signal of F-35 fail?Footage courtesy of Dvids, Boeing, and The United States Navy.SITREP: F-16 replacement search a signal of F-35 fail?Sitrep: Boeing 707The F-35's next tech upgradeUS Navy Gets an Italian AccentSITREP: DOD Resets Ballistic Missile Interceptor programSITREP: DOD's New Long-Range Air-to-Air Missile Aims to \"Outstick\" ChinaArmy's New Pistol Has Had Some MisfiresArmy's Next (Vertical) Lift En RouteSITREP: President Trump's Missile Defense StrategyHybrid Options for US's Next Top FighterThe Air Force’s Senior Citizen Chopper Can’t Retire YetArs Live #23: The History and Future of Tech LawPolice re-creation of body camera evidence - Pueblo, CO | Ars TechnicaVisual Labs body camera software with the Dos Palos PD | Ars TechnicaHe knew his rights; he got tased anywayMore videos← PREVIOUS STORYNEXT STORY →Related StoriesToday on Ars",
    "summary": "- Google employees express anger over CEO Sundar Pichai's $226 million compensation package following layoffs and cost-cutting measures.\n- Internal memes have circulated comparing Pichai to Shrek's Lord Farquaad, criticizing Alphabet's authorized $70 billion stock repurchase program, and emphasizing that Pichai's compensation is 808 times higher than the median employee's.\n- These memes and complaints have sparked discussions about the balance between executive compensation and employee benefits within large tech companies.",
    "hn_title": "Googlers angry about CEO’s $226M pay after cuts in perks and 12,000 layoffs",
    "original_title": "Googlers angry about CEO’s $226M pay after cuts in perks and 12,000 layoffs",
    "score": 283,
    "hn_content": "Google's CEO, Sundar Pichai, is facing criticism for his $226 million pay after significant cuts in perks and 12,000 layoffs. Larry Page and Sergey Brin control ~51% of voting power with shares thanks to owning ~85% of class B shares, and they hired someone else to run the company. Apple shareholders even requested a pay cut of their CEO, Tim Cook, in the past. Sundar Pichai's pay is on a 3 year cycle, and it is controlled by the board, but some argue that he still has agency in negotiating his compensation. Google's market cap increased by ~$890B since Pichai took over, and Google's exec compensation is oddly structured. Despite the outrage, Google's workers are some of the highest-paid in tech, including many contractors.Google CEO Sundar Pichai receives a $226 million pay package in 2021, sparking backlash from employees and the public. Some argue that Pichai's compensation is unreasonably high, while others suggest that it is commensurate with the responsibilities of a CEO in a highly competitive market. The discussion also touches on the issue of income inequality, with some advocating for higher wages for all employees and others arguing for a market-based approach to CEO compensation. The post also touches on accusations of hypocrisy on Google's part for running low-paid coffee shops while paying its CEO millions. The conversation features different perspectives on CEO pay and its relation to employee compensation, corporate responsibility, and market dynamics.Google CEO Sundar Pichai's recent compensation package of $226 million over the next three years has caused controversy among Google employees, with some arguing that engineers should earn more of the company's profits. While engineering salaries are relatively high in the tech industry, some argue that they are still not commensurate with the massive profits generated by their work. Others argue that CEOs are similarly overpaid, with Sundar's compensation package exceeding that of most other CEOs. Additionally, some have pointed out the low pay rates for Google's \"raters,\" who work to moderate and test Google's platforms and earn significantly less than engineers. Ultimately, the issue of fair compensation in the tech industry remains a contentious one.The topic of the discussion is the high salaries of software engineers and how they compare to other professions. Some argue that software engineering is a difficult job that requires constant learning, while others feel that engineers are not intrinsically worth more than other professions. The conversation also touches upon CEO pay and the wealth disparity in the industry. Google's recent layoffs and the importance of maximizing profits for shareholders is also discussed, with some arguing for the need for a more significant focus on a company's vision and future offerings. There is no new or exciting development or product release discussed in the conversation.Google employees express frustration over layoffs and CEO pay. Some former employees speculate that perks became entitlements that led to a decrease in productivity. Others argue that Sundar Pichai's salary of $226 million is a distraction from bigger issues like layoffs and job insecurity. Suggestions arise to unionize or pay workers higher salaries to counter the loss of jobs. However, some say that CEOs are paid according to market rates and should not be criticized for their salaries. Overall, the discussion highlights a growing concern about income inequality in the tech industry.Google employees are questioning the $226 million compensation package for CEO Sundar Pichai, especially as the company lays off workers and cuts costs. Some have compared Pichai's pay to that of pop artists, but others argue that the comparison is unfair and not applicable. OpenAI is reportedly paying researchers between $5 and $20 million, prompting the question of whether Pichai deserves 20 times more compensation. However, some have pointed out that there is a middle ground between $200,000 and $226 million. The debate centers on whether Pichai's contributions warrant such a high level of pay and what shareholders are receiving in return for the compensation package. The controversy reflects growing scrutiny on CEO pay and income inequality in the tech industry.",
    "hn_summary": "- The discussion also focuses on income inequality and whether engineers should earn more of the company's profits, while some argue that CEOs are excessively overpaid.\n- The controversy surrounding Pichai's compensation package reflects growing scrutiny on CEO pay and income inequality in the tech industry."
  }
]
