[
  {
    "id": 38180477,
    "title": "प्रौद्योगिकी के माध्यम से बैंकों की परिचालन दक्षता में सुधार: वर्तमान चुनौतियों और संभावित सुधारों का विश्लेषण",
    "originLink": "https://www.bitsaboutmoney.com/archive/seeing-like-a-bank/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38180477",
    "commentBody": "",
    "originSummary": [
      "पैट्रिक मैकेंजी एक अव्यवस्थित संरचना और उप-प्रणालियों के बीच अप्रभावी संचार के कारण अपनी परिचालन अक्षमताओं के लिए बैंकों की आलोचना करते हैं, जिससे खाता बंद होने और क्रेडिट कार्ड धोखाधड़ी जैसी समस्याएं होती हैं।",
      "वह बताते हैं कि कैसे बैंकों के समय और संसाधनों को बचाने के उद्देश्य से स्तरीय ग्राहक सेवा प्रणाली, अक्सर ग्राहकों की निराशा और अक्षमताओं को बढ़ाती है। इसके अतिरिक्त, वह कुछ कानूनी दायित्वों का आह्वान करता है, जैसे कि गैर-प्रकट संदिग्ध गतिविधि रिपोर्ट, जो अचानक खाता बंद कर सकती है और ग्राहकों के लिए भ्रम पैदा कर सकती है।",
      "मैकेंजी का सुझाव है कि तकनीकी सुधार बैंकिंग संचालन और ग्राहक सेवा को बढ़ा सकते हैं, लेकिन इसके सिस्टम-व्यापी अपनाने के लिए आवश्यक समय को स्वीकार करते हैं। वह ग्राहकों को अनावश्यक नुकसान पहुंचाने वाले कुछ नियमों के पुनर्मूल्यांकन के लिए भी कहता है।"
    ],
    "commentSummary": [
      "पैट्रिक मैकेंजी उप-प्रणालियों के भीतर खराब संचार और संगठन के परिणामस्वरूप परिचालन अक्षमताओं के लिए बैंकों की जांच करते हैं, जिससे खाता बंद होने और क्रेडिट कार्ड धोखाधड़ी जैसे मुद्दे होते हैं।",
      "वह समस्या के हिस्से के रूप में बैंकों की स्तरीय ग्राहक सेवा संरचना और कुछ भ्रामक कानूनी दायित्वों जैसे कि गैर-प्रकट संदिग्ध गतिविधि रिपोर्ट की ओर इशारा करते हैं।",
      "मैकेंजी का मानना है कि बेहतर तकनीक बैंकों की परिचालन क्षमता और ग्राहक अनुभवों को बढ़ा सकती है, लेकिन स्वीकार करती है कि पूरे वित्तीय प्रणाली में कार्यान्वयन धीरे-धीरे हो सकता है। वह विशिष्ट नियमों पर पुनर्विचार करने की आवश्यकता पर भी जोर देता है जो ग्राहकों को अनावश्यक नुकसान और भ्रम पहुंचाते हैं।"
    ],
    "points": 519,
    "commentCount": 373,
    "retryCount": 0,
    "time": 1699380475
  },
  {
    "id": 38180846,
    "title": "एलन वेक 2 में गेमिंग अनुभव को बढ़ावा देने के लिए नॉर्थलाइट टेक्नोलॉजी में सुधार",
    "originLink": "https://www.remedygames.com/article/how-northlight-makes-alan-wake-2-shine",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38180846",
    "commentBody": "",
    "originSummary": [
      "एलन वेक 2 के लिए नॉर्थलाइट डेवलपमेंट टीम ने कई प्रौद्योगिकी सुधार पेश किए हैं जैसे बेहतर मेमोरी दक्षता और तेज प्रदर्शन के लिए एक नया डेटा-ओरिएंटेड गेम ऑब्जेक्ट मॉडल, और बेहतर नेविगेशन के लिए वोक्सेल-आधारित चरित्र नियंत्रण।",
      "डेवलपर्स ने रोबोक्स द्वारा लुआ से ली गई भाषा लुआउ को अपनाया है, जिससे लगभग 80,000 लाइनें अनावश्यक कोड समाप्त हो गई हैं। उन्होंने प्रामाणिक भौतिकी प्रभावों के लिए एक नई पवन प्रणाली और बड़े पैमाने पर पर्यावरण डिजाइनों के लिए एक प्रकीर्णन उपकरण भी पेश किया।",
      "सीक्वल में एक नई जीपीयू-संचालित रेंडरिंग पाइपलाइन, एचडीआर समर्थन, और बेहतर कलात्मक लचीलेपन के लिए बढ़ी हुई पारदर्शिता प्रतिपादन और वीएफएक्स टूल शामिल हैं। इसके अलावा, इसमें रे-ट्रेस्ड डायरेक्ट लाइटिंग के लिए समर्थन शामिल है।"
    ],
    "commentSummary": [
      "एलन वेक 2 के लिए नॉर्थलाइट डेवलपमेंट टीम ने कई तकनीकी सुधार किए हैं, जैसे कि एक स्मृति-कुशल डेटा-उन्मुख गेम ऑब्जेक्ट मॉडल और एक चिकनी नेविगेशन अनुभव के लिए वोक्सेल-आधारित चरित्र नियंत्रण।",
      "यथार्थवादी भौतिकी प्रभावों के लिए एक नई पवन प्रणाली पेश की गई थी, साथ ही बड़े पैमाने पर पर्यावरण डिजाइन के लिए एक स्कैटरिंग टूल भी था। इसके अलावा, मालिकाना स्क्रिप्टिंग भाषा को लुआउ (रोबोक्स द्वारा लुआ से व्युत्पन्न) के साथ बदल दिया गया था, जिससे अनावश्यक कोड की लगभग 80,000 लाइनें कम हो गईं।",
      "सीक्वल में गेम वर्ल्ड के समृद्ध विवरण, बेहतर पारदर्शिता प्रतिपादन और वीएफएक्स टूल के लिए एक नया जीपीयू-संचालित रेंडरिंग पाइपलाइन है। यह एचडीआर और रे-ट्रेस्ड डायरेक्ट लाइटिंग का भी समर्थन करता है, जिससे कलाकारों को अधिक रचनात्मक लचीलापन मिलता है।"
    ],
    "points": 398,
    "commentCount": 198,
    "retryCount": 0,
    "time": 1699381976
  },
  {
    "id": 38176750,
    "title": "ईएसए के यूक्लिड अंतरिक्ष मिशन ने ब्रह्मांड की पहली विस्तृत रंगीन छवियों का अनावरण किया, ब्रह्मांड के सबसे बड़े 3 डी मानचित्र के लिए तैयारी की",
    "originLink": "https://www.esa.int/Science_Exploration/Space_Science/Euclid/Euclid_s_first_images_the_dazzling_edge_of_darkness",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38176750",
    "commentBody": "",
    "originSummary": [
      "ईएसए के यूक्लिड मिशन ने अपनी पहली पूर्ण-रंगीन ब्रह्माण्ड संबंधी छवियों का अनावरण किया है, जो एक बड़े आकाश भाग पर अद्वितीय स्पष्टता प्रदर्शित करता है।",
      "यूक्लिड टेलीस्कोप सबसे व्यापक 3 डी ब्रह्मांड मानचित्र उत्पन्न करने और अंधेरे पदार्थ और अंधेरे ऊर्जा की जांच करने के लिए तैयार है, जो हमारे ब्रह्मांड का 95% हिस्सा है।",
      "यूक्लिड की प्रारंभिक छवियां एक बार में व्यापक आकाश वर्गों में तेज दृश्य और अवरक्त छवियों का उत्पादन करने की अपनी अनूठी क्षमता प्रदर्शित करती हैं। मिशन यूरोपीय उत्कृष्टता और वैश्विक सहयोग का प्रतीक है।"
    ],
    "commentSummary": [
      "यूरोपीय अंतरिक्ष एजेंसी (ईएसए) के यूक्लिड अंतरिक्ष मिशन ने आकाश के एक बड़े हिस्से पर उल्लेखनीय स्पष्टता के साथ ब्रह्मांड की अपनी पहली पूर्ण-रंगीन छवियों का खुलासा किया है।",
      "यूक्लिड टेलीस्कोप, जिसे ब्रह्मांड के सबसे व्यापक 3 डी मानचित्र को उत्पन्न करने के लिए डिज़ाइन किया गया है, डार्क मैटर और डार्क एनर्जी की जांच करेगा जो हमारे ब्रह्मांड का 95% हिस्सा है।",
      "अगले छह वर्षों में, यूक्लिड 10 अरब प्रकाश वर्ष दूर अरबों आकाशगंगाओं की जांच करेगा, जो एक ही सत्र में एक बड़े आकाश के हिस्से में तेज दृश्यमान और अवरक्त छवियों को वितरित करने की अपनी अनूठी क्षमता का प्रदर्शन करेगा।"
    ],
    "points": 382,
    "commentCount": 92,
    "retryCount": 0,
    "time": 1699365532
  },
  {
    "id": 38186190,
    "title": "इंटरएक्टिव गेम एंटीडिपेंटेंट्स और टोल्किन वर्णों के ज्ञान का परीक्षण करता है",
    "originLink": "https://antidepressantsortolkien.vercel.app/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38186190",
    "commentBody": "",
    "originSummary": [
      "खेल खिलाड़ियों को यह भेद करने के लिए चुनौती देता है कि क्या दिया गया शब्द एक अवसादरोधी दवा है या जेआरआर टोल्किन के कार्यों से एक चरित्र है।",
      "यह साहित्य और फार्मास्युटिकल नामकरण के एक चौराहे को रेखांकित करता है, जिससे खिलाड़ियों को एक अनूठा सीखने का अनुभव मिलता है।",
      "खेल की अजीब अवधारणा सामने आती है, जिससे यह टोल्किन उत्साही और दवा शर्तों से चिंतित लोगों दोनों के लिए एक दिलचस्प विषय बन जाता है।"
    ],
    "commentSummary": [
      "लेख में एंटीडिप्रेसेंट दवाओं के नामों और जेआरआर टोल्किन के कार्यों के पात्रों के बीच अंतर करने की चुनौती के आसपास केंद्रित एक दिलचस्प खेल पर चर्चा की गई है।",
      "यह पॉप संस्कृति और दवा शब्दावली दोनों की एक विचित्र लेकिन सम्मोहक परीक्षा के रूप में कार्य करता है।",
      "यह दो अलग-अलग क्षेत्रों के बीच एक अप्रत्याशित समानांतर खींचता है: साहित्यिक कल्पना और चिकित्सा विज्ञान।"
    ],
    "points": 381,
    "commentCount": 80,
    "retryCount": 0,
    "time": 1699412000
  },
  {
    "id": 38181346,
    "title": "कंटेनरों में गो अनुप्रयोगों का अनुकूलन: लिनक्स शेड्यूलर और सीपीयू सीमाओं की भूमिका",
    "originLink": "https://www.riverphillips.dev/blog/go-cfs/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38181346",
    "commentBody": "",
    "originSummary": [
      "ब्लॉग पोस्ट होस्ट की सभी सीपीयू शक्ति का उपयोग करने से बचने के लिए एप्लिकेशन चलाते समय कंटेनर ऑर्केस्ट्रेटर्स में सीपीयू सीमा निर्धारित करने की आवश्यकता पर प्रकाश डालता है।",
      "गो गार्बेज कलेक्टर प्रक्रिया, लिनक्स शेड्यूलर की भूमिका और GOMAXPROCS पर्यावरण चर के माध्यम से सीपीयू थ्रेड्स को नियंत्रित करने के महत्व के बारे में गहराई से जानकारी प्रदान की गई है।",
      "उबर ने 'ऑटोमैक्सप्रोक्स' लाइब्रेरी पेश की है, जो कंटेनर के समूहों से गोमैक्सप्रोक्स मूल्य की स्वचालित रूप से गणना करती है, कंटेनरीकृत अनुप्रयोगों में गो चलाने के दौरान इसके सेटअप को सरल बनाती है।"
    ],
    "commentSummary": [
      "ब्लॉग में गो डेवलपर होस्ट पर उच्च सीपीयू खपत से बचने के लिए कंटेनर ऑर्केस्ट्रेटर्स में सीपीयू सीमा निर्धारित करने के महत्व पर जोर देता है, क्योंकि गो रनटाइम सभी उपलब्ध सीपीयू पावर का उपयोग करता है, संभावित रूप से उच्च विलंबता पैदा करता है।",
      "लेखक गोमैक्सप्रोक्स पर्यावरण चर का उपयोग करके गो रनटाइम द्वारा बनाए जा सकने वाले सीपीयू थ्रेड्स की संख्या को नियंत्रित करने की सलाह देता है, जो सीपीयू कोटा के साथ संरेखित होता है।",
      "उबर ने 'ऑटोमैक्सप्रोक्स' लाइब्रेरी बनाई है जो कंटेनर के समूहों से स्वचालित रूप से इस पर्यावरण चर मूल्य की गणना करती है, जो कंटेनरीकृत अनुप्रयोगों में गो चलाने के दौरान समझदार गोमैक्सप्रोक्स असाइनमेंट की आवश्यकता को पूरा करती है।"
    ],
    "points": 295,
    "commentCount": 107,
    "retryCount": 0,
    "time": 1699384204
  },
  {
    "id": 38183454,
    "title": "चमक का परिचय: एरलांग रनटाइम पर एक समवर्ती, उपयोगकर्ता के अनुकूल प्रोग्रामिंग भाषा",
    "originLink": "https://gleam.run/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38183454",
    "commentBody": "",
    "originSummary": [
      "चमक एरलांग रनटाइम पर आधारित एक मजबूत कार्यक्रम है, जिसमें एक आधुनिक वाक्यविन्यास और एक शक्तिशाली प्रकार प्रणाली है, जो किसी भी आकार के वर्कलोड को संभालने के लिए सुसज्जित है।",
      "कार्यक्रम मल्टी-कोर संचालन का समर्थन करता है, एक समवर्ती कचरा कलेक्टर का उपयोग करता है, और अपने स्वयं के कंपाइलर, बिल्ड टूल, फॉरमैटर, संपादक एकीकरण और पैकेज प्रबंधक प्रदान करता है। यह एरलांग और एलिक्सिर जैसी अन्य बीम भाषाओं के पैकेज के साथ इंटरऑपरेबल है।",
      "मुख्य विशेषताओं से परे, चमक जावास्क्रिप्ट को संकलित करती है, कुशल बाहरी इंटरैक्शन के लिए टाइपस्क्रिप्ट परिभाषाएं उत्पन्न करती है और बहुसांस्कृतिक समावेशिता के उद्देश्य से उपयोगकर्ता के अनुकूल त्रुटि संदेशों को प्राथमिकता देती है।"
    ],
    "commentSummary": [
      "चमक एरलांग रनटाइम पर आधारित एक मजबूत कार्यक्रम है, जिसमें एक आधुनिक वाक्यविन्यास और एक शक्तिशाली प्रकार प्रणाली है, जो अपनी कंकरेन्सी प्रणाली और तेजी से अपरिवर्तनीय डेटा संरचनाओं के कारण किसी भी आकार के कार्यभार को संभालने में सक्षम है।",
      "यह अपने स्वयं के कंपाइलर, बिल्ड टूल, फॉरमैटर, संपादक एकीकरण और पैकेज मैनेजर के साथ आता है, और एर्लांग और एलिक्सिर जैसी अन्य बीम भाषाओं के पैकेजों के साथ बातचीत कर सकता है। यह जावास्क्रिप्ट को भी संकलित करता है और कुशल बाहरी इंटरैक्शन के लिए टाइपस्क्रिप्ट परिभाषाएं उत्पन्न करता है।",
      "उपयोगकर्ता के अनुकूल त्रुटि संदेश और बहुसांस्कृतिक समावेशिता चमक के उच्च प्राथमिकता वाले पहलू हैं, क्योंकि इसका उद्देश्य विभिन्न उपयोगकर्ता समूहों के लिए सुलभ और कुशल होना है।"
    ],
    "points": 266,
    "commentCount": 138,
    "retryCount": 0,
    "time": 1699394009
  },
  {
    "id": 38182869,
    "title": "आईफोन 15 प्रो मैक्स पर शूट किए गए ऐप्पल के 'डरावने फास्ट' इवेंट में पेशेवर कैमरा क्षमताओं का प्रदर्शन किया गया",
    "originLink": "https://prolost.com/blog/scarybts",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38182869",
    "commentBody": "",
    "originSummary": [
      "ऐप्पल ने अक्टूबर में पूरे \"डरावनी फास्ट\" घटना को फिल्माने के लिए अपने आईफोन 15 प्रो मैक्स का इस्तेमाल किया, जिसने एम 3 सिलिकॉन के साथ नए मैक का अनावरण किया, जो इसकी पेशेवर वीडियो रिकॉर्डिंग क्षमता का प्रदर्शन करता है।",
      "ऐप्पल का प्रो वर्कफ़्लोज़ ग्रुप ऐप्पल उपकरणों के पेशेवर उपयोग को प्रोत्साहित करता है और विशेष ऐप्स और तकनीकों का उपयोग करके एक एक्शन शॉर्ट फिल्माकर गुणवत्ता का प्रदर्शन करता है।",
      "\"शॉट ऑन आईफोन\" अभियान का उद्देश्य रचनात्मकता को प्रेरित करना है और दिखाता है कि इन उपकरणों का उपयोग करने का निर्णय किसी व्यक्ति के इरादों और जरूरतों के साथ संरेखित होता है।"
    ],
    "commentSummary": [
      "ऐप्पल ने अक्टूबर में पूरे \"डरावनी फास्ट\" घटना को फिल्माने के लिए अपने आईफोन 15 प्रो मैक्स का उपयोग किया, जो फोन की पेशेवर स्तर की कैमरा क्षमताओं का प्रदर्शन करता है। इवेंट में एम3 सिलिकॉन के साथ नए मैक पेश किए गए।",
      "इवेंट की शूटिंग के अलावा, ऐप्पल ने उच्च-गुणवत्ता वाले परिणाम प्राप्त करने के लिए ब्लैकमैजिक कैमरा ऐप और विशेष शटर तकनीकों जैसे विभिन्न उपकरणों का उपयोग करके एक एक्शन शॉर्ट भी रिकॉर्ड किया।",
      "ऐप्पल प्रो वर्कफ़्लोज़ ग्रुप द्वारा समर्थित \"शॉट ऑन आईफोन\" अभियान का उद्देश्य उपयोगकर्ताओं को रचनात्मक प्रयासों के लिए अपने आईफोन का लाभ उठाने के लिए प्रेरित करना है, इस बात पर प्रकाश डालते हुए कि ऐसे उपकरणों का उपयोग करने का विकल्प किसी व्यक्ति के रचनात्मक इरादों और आवश्यकताओं पर निर्भर है।"
    ],
    "points": 263,
    "commentCount": 131,
    "retryCount": 0,
    "time": 1699391338
  },
  {
    "id": 38176113,
    "title": "GodotCon 2023: रेंडरिंग, इंडी गेम डेवलपमेंट और अधिक के भविष्य में गहरी गोता लगाएं",
    "originLink": "https://media.ccc.de/c/godotcon2023",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38176113",
    "commentBody": "",
    "originSummary": [
      "पाठ गोडोटकॉन 2023 से चर्चाओं और पॉडकास्ट फीड की एक व्यापक सूची प्रदान करता है, जो गोडोट में भविष्य के प्रतिपादन पर ध्यान केंद्रित करता है, एक स्वतंत्र गेम डेवलपमेंट स्टूडियो चलाता है, और गोडोट में गेम डेवलपमेंट के तकनीकी पहलुओं पर ध्यान केंद्रित करता है।",
      "सम्मेलन से रिकॉर्डिंग एमपी 4 और वेबएम जैसे विभिन्न प्रारूपों में उपलब्ध हैं, जो वरीयताओं की एक विस्तृत श्रृंखला को पूरा करते हैं।",
      "हाइलाइट की गई वार्ताओं में 'वॉटरकलर्स से मेच: गोडोट में शैलीबद्ध रेंडरिंग और एसेट पाइपलाइन' और 'गोडोट एडऑन के साथ सुपर-चार्जिंग कंटेंट प्रोडक्शन' शामिल हैं, जो चर्चा किए गए विषयों की विविधता को प्रदर्शित करते हैं।"
    ],
    "commentSummary": [
      "पाठ गोडोटकॉन 2023 से पॉडकास्ट फीड और वार्ता का एक व्यापक अवलोकन प्रदान करता है, जो गोडोट गेम इंजन को समर्पित एक सम्मेलन है।",
      "चर्चा किए गए विषयों में गोडोट के प्रतिपादन में संभावित विकास से लेकर एक स्वतंत्र गेम डेवलपमेंट स्टूडियो के संचालन की गतिशीलता और गोडोट के भीतर गेम डेवलपमेंट पर तकनीकी चर्चा शामिल है।",
      "'वॉटरकलर्स से मेच्स तक: गोडोट में शैलीबद्ध रेंडरिंग और एसेट पाइपलाइन' और 'गोडोट एडऑन के साथ सुपर-चार्जिंग सामग्री उत्पादन' सहित विभिन्न रिकॉर्ड की गई चर्चाएं एमपी 4 और वेबएम जैसे प्रारूपों में सुलभ हैं।"
    ],
    "points": 242,
    "commentCount": 43,
    "retryCount": 0,
    "time": 1699360951
  },
  {
    "id": 38176592,
    "title": "मेन 2023 चुनाव मतपत्र में मूल राज्य संविधान के पूर्ण प्रिंट के लिए प्रस्ताव शामिल होगा",
    "originLink": "https://www.mitsc.org/news/maine-2023-election-ballot-question-6-fact-sheet",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38176592",
    "commentBody": "",
    "originSummary": [
      "मेन राज्य ने 2023 के चुनाव मतपत्र में एक विधायी प्रस्ताव के माध्यम से अपने संविधान में संशोधन करने का प्रस्ताव रखा है, यह सुनिश्चित करते हुए कि इसके सभी प्रावधान राज्य सचिव द्वारा बनाई गई आधिकारिक मुद्रित प्रतियों में दिखाई दें।",
      "एक 'हां' वोट 1876 के संशोधन के कारण छोड़े गए दस्तावेज़ के मूल वर्गों को बहाल करेगा, जैसे कि वाबानाकी लोगों के लिए मेन के संधि दायित्व।",
      "प्रस्ताव का उद्देश्य वाबनाकी राष्ट्रों के लिए मौजूदा प्रतिबद्धताओं को बदलना नहीं है, बल्कि नागरिकों को संविधान की मूल भाषा तक व्यापक पहुंच प्रदान करना है।"
    ],
    "commentSummary": [
      "मेन राज्य के संविधान में संशोधन करने के लिए अपने 2023 के चुनाव मतपत्र पर एक विधायी प्रस्ताव (प्रश्न # 6) पेश करेगा, यह सुनिश्चित करते हुए कि सभी प्रावधानों को राज्य सचिव द्वारा तैयार आधिकारिक मुद्रित प्रतियों में शामिल किया जाए।",
      "\"हां\" वोट देने से 1876 के संशोधन के कारण मुद्रित प्रतियों में छोड़े गए मूल वर्गों को बहाल किया जाएगा, जिसमें वाबनाकी लोगों के लिए मेन के संधि दायित्व भी शामिल हैं। ये खंड उनकी मुद्रित अनुपस्थिति के बावजूद प्रभावी रहे हैं।",
      "प्रस्ताव वाबनाकी राष्ट्रों के प्रति मेन के मौजूदा \"कर्तव्यों और दायित्वों\" को बदले बिना, संविधान की पूर्ण मूल भाषा तक नागरिकों की पहुंच बढ़ाने का प्रयास करता है।"
    ],
    "points": 228,
    "commentCount": 223,
    "retryCount": 0,
    "time": 1699364592
  },
  {
    "id": 38181114,
    "title": "eIDAS 2.0 का अनुच्छेद 45: यूरोपीय संघ में वेब सुरक्षा मानकों के लिए एक संभावित झटका",
    "originLink": "https://www.eff.org/deeplinks/2023/11/article-45-will-roll-back-web-security-12-years",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38181114",
    "commentBody": "",
    "originSummary": [
      "यूरोपीय संघ (ईयू) ईआईडीएएस 2.0 पर चर्चा कर रहा है, एक नया विनियमन जो सरकारों को एन्क्रिप्टेड ट्रैफ़िक की निगरानी में प्रमाणपत्र अधिकारियों के साथ काम करने की अनुमति दे सकता है।",
      "यह विनियमन यूरोपीय संघ के सदस्य सरकार की मंजूरी के बिना कुछ प्रमाणपत्र अधिकारियों की आधुनिक सुरक्षा आवश्यकताओं को प्रभावित कर सकता है, जिससे संभावित गोपनीयता के मुद्दे बढ़ सकते हैं।",
      "विशेष रूप से, इस विनियमन का अनुच्छेद 45 विशेष चिंता पैदा कर रहा है, क्योंकि यह यूरोपीय इंटरनेट उपयोगकर्ताओं के लिए वेब ब्राउज़र सुरक्षा मानकों को कम कर सकता है। औपचारिक पाठ को 8 नवंबर को अंतिम रूप दिए जाने की उम्मीद है।"
    ],
    "commentSummary": [
      "यूरोपीय संघ एक नए विनियमन, ईआईडीएएस 2.0 की पुष्टि करने की योजना बना रहा है, जिससे सरकारों को एन्क्रिप्टेड ट्रैफ़िक की संभावित निगरानी के लिए प्रमाणपत्र अधिकारियों के साथ सहयोग करने की अनुमति मिलती है।",
      "विनियमन यूरोपीय संघ के सदस्य सरकार की सहमति के बिना प्रमाणपत्र अधिकारियों पर समकालीन सुरक्षा पूर्वापेक्षाओं को कमजोर कर सकता है।",
      "विनियमन में शामिल अनुच्छेद 45 गोपनीयता की चिंता पैदा कर रहा है, मुख्य रूप से यूरोपीय इंटरनेट उपयोगकर्ताओं के लिए, क्योंकि इससे वेब ब्राउज़र सुरक्षा मानकों में कमी हो सकती है। विनियमन के अंतिम पाठ की पुष्टि 8 नवंबर को की जाएगी।"
    ],
    "points": 226,
    "commentCount": 118,
    "retryCount": 0,
    "time": 1699383141
  },
  {
    "id": 38182461,
    "title": "x86-64 असेंबली कोड के साथ कंपाइलर लेखन की जटिलता को डिकोड करना",
    "originLink": "http://sebmestre.blogspot.com/2023/11/en-writing-compiler-is-surprisingly.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38182461",
    "commentBody": "",
    "originSummary": [
      "ब्लॉग पोस्ट एक कंपाइलर लिखने की प्रक्रिया को सरल बनाता है, उच्च-स्तरीय भाषा के x86-64 मशीन कोड में अनुवाद को लक्षित करता है, पूर्णांक शाब्दिक, चर, निषेध और जोड़ पर ध्यान केंद्रित करता है।",
      "लेखक दर्शाता है कि पूर्णांक शाब्दिक, चर का प्रतिनिधित्व और संकलन कैसे करें, विभिन्न x86-64 निर्देशों का उपयोग करके निषेधों को संकलित करें, और इस प्रक्रिया में रजिस्टर उपयोग का महत्व।",
      "स्लॉट पुन: उपयोग को रोकने के लिए स्टैक और एक सरल काउंटर का उपयोग करके अतिरिक्त कमांड संकलित किए जाते हैं, जिसका समापन अंकगणितीय अभिव्यक्तियों के संकलन में होता है। भविष्य के पोस्ट नियंत्रण प्रवाह संरचनाओं और फ़ंक्शन कॉल और पॉइंटर्स को संकलित करने पर मार्गदर्शन करने की योजना बनाते हैं।"
    ],
    "commentSummary": [
      "ब्लॉग पोस्ट लेखक का वर्णन है कि एक कंपाइलर लिखना, जबकि शुरू में जटिल प्रतीत होता है, कुछ मान्यताओं के साथ कुछ सप्ताहांत में सरलता से प्राप्त किया जा सकता है।",
      "चर, निषेध और जोड़ का उपयोग करके उच्च-स्तरीय भाषा को x86-64 मशीन कोड में अनुवाद करने पर वैचारिक जोर दिया जाता है, जिसे पहले से मौजूद कोडांतरक के माध्यम से x86-64 असेंबली कोड में अनुवादित किया जाता है।",
      "x86-64 निर्देशों का उपयोग करते हुए, पोस्ट पूर्णांक शाब्दिक, चर, निषेध और जोड़ को संकलित करने पर उदाहरण प्रदान करता है, अंकगणितीय अभिव्यक्तियों के संकलन के साथ समाप्त होता है। भविष्य के पोस्ट नियंत्रण प्रवाह संरचनाओं और फ़ंक्शन कॉल को संकलित करने से निपटने का वादा करते हैं।"
    ],
    "points": 208,
    "commentCount": 83,
    "retryCount": 0,
    "time": 1699389403
  },
  {
    "id": 38176062,
    "title": "सेक्टर सी का परिचय: एक्स 86 मशीन के बूट सेक्टर में दुनिया का सबसे छोटा सी कंपाइलर",
    "originLink": "https://github.com/xorvoid/sectorc",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38176062",
    "commentBody": "",
    "originSummary": [
      "सेक्टर सी, एक्स 86-16 असेंबली में लिखा गया एक सी कंपाइलर, संभावित रूप से एक्स 86 मशीन के बूट सेक्टर के भीतर फिट होने की क्षमता के कारण सबसे छोटा सी कंपाइलर होने का खिताब रखता है।",
      "सी भाषा के एक पर्याप्त उप-समूह का समर्थन करते हुए, सेक्टरसी जटिल कार्यक्रमों को तैयार करने में सक्षम बनाता है, जैसे कि इसके कॉम्पैक्ट आकार के बावजूद, एक चलती साइन-वेव के एनीमेशन को शामिल करना।",
      "हालांकि एक आला उपयोग-केस होने का सुझाव दिया गया है, सेक्टरसी एक्स 86 असेंबली के पर्याप्त ज्ञान की आवश्यकता के बिना एक्स 86-16 बायोस फ़ंक्शन और मशीन मॉडल को समझने के इच्छुक व्यक्तियों के लिए एक सहायक उपकरण हो सकता है।"
    ],
    "commentSummary": [
      "सेक्टर सी एक सी कंपाइलर है, जिसे अब तक विकसित सबसे छोटा कहा जाता है, जिसे एक्स 86-16 असेंबली में लिखा गया है। कंपाइलर अद्वितीय है क्योंकि यह एक्स 86 मशीन के बूट सेक्टर के भीतर फिट हो सकता है।",
      "अपने कॉम्पैक्ट आकार के बावजूद, सेक्टरसी सी भाषा के एक उल्लेखनीय उप-समूह का समर्थन करता है, जिसमें फ़ंक्शन, यदि कथन, कथन और अन्य विशेषताएं शामिल हैं। यह एक चलती साइन-वेव एनीमेशन जैसे जटिल कार्यक्रमों के निर्माण की अनुमति देता है।",
      "यह उन लोगों पर ध्यान केंद्रित करने के साथ विकसित किया गया है जो एक्स 86-16 बायोस फ़ंक्शन और मशीन मॉडल को समझना चाहते हैं, जिससे उन्हें व्यापक एक्स 86 असेंबली सीखने की आवश्यकता के बिना पता लगाने के लिए एक पुल प्रदान किया जाता है।"
    ],
    "points": 203,
    "commentCount": 58,
    "retryCount": 0,
    "time": 1699360435
  },
  {
    "id": 38178592,
    "title": "एसिंक रस्ट को आगे बढ़ाना: एक व्यापक चार साल की विकास योजना",
    "originLink": "https://without.boats/blog/a-four-year-plan/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38178592",
    "commentBody": "",
    "originSummary": [
      "लेखक एसिंक रस्ट में नई सुविधाओं की वकालत करता है, जैसे कि एसिंकइटेरेटर, एसिंक जनरेटर, और \"रिटर्न टाइप नोटेशन\", साथ ही एसिंक क्लोजर को 'इंपल फ्यूचर' को वापस करने वाले क्लोजर के रूप में मानते हैं।",
      "वे ऑब्जेक्ट-सेफ कोरूटीन विधियों और एसिंक डिस्ट्रक्टर्स जैसी जटिल अवधारणाओं को छूते हैं, और उन्नत प्रकारों के एकीकरण पर चर्चा करते हैं जैसे कि अपरिवर्तनीय, अविस्मरणीय और अनड्रॉपेबल।",
      "लेखक रस्ट परियोजना के निर्णय लेने और संचार प्रक्रिया की आलोचना करता है, परियोजना टीम और समुदाय के बीच अधिक समझ और खुले संवाद के लिए आग्रह करता है।"
    ],
    "commentSummary": [
      "लेखक एसिंक्रोनस रस्ट प्रोग्रामिंग के लिए भविष्य के संवर्द्धन को स्पष्ट करता है, जिसमें एसिंक इटेरेटर, एसिंक जनरेटर और एक उपन्यास \"रिटर्न टाइप नोटेशन\" सहित नई सुविधाओं की शुरूआत पर ध्यान केंद्रित किया गया है।",
      "पोस्ट में अतुल्यकालिक क्लोजर को 'अनिश्चित भविष्य' को वापस करने वाले क्लोजर के रूप में मानने का सुझाव दिया गया है, और ऑब्जेक्ट-सेफ कोरूटीन विधियों और अतुल्यकालिक विध्वंसकों जैसी जटिल अवधारणाओं पर प्रकाश डाला गया है।",
      "लेखक रस्ट परियोजना के निर्णय लेने और संचार प्रथाओं की आलोचना करता है और परियोजना डेवलपर्स और समुदाय के बीच बेहतर समझ और संचार के लिए अपील करता है।"
    ],
    "points": 201,
    "commentCount": 220,
    "retryCount": 0,
    "time": 1699373577
  },
  {
    "id": 38177250,
    "title": "एडिटर-इन-चीफ निक कैलेंड्रा की बर्खास्तगी के बाद द एस्केपिस्ट में सामूहिक इस्तीफा",
    "originLink": "https://www.gamesindustry.biz/the-escapist-staff-resign-following-termination-of-editor-in-chief-nick-calandra",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38177250",
    "commentBody": "",
    "originSummary": [
      "एक गेमिंग वेबसाइट एस्केपिस्ट ने संपादक-इन-चीफ निक कैलेंड्रा की समाप्ति के बाद शून्य विराम चिह्न से बेन \"याहत्ज़ी\" क्रोशॉ सहित इस्तीफों की एक लहर का अनुभव किया है।",
      "कैलेंड्रा को कथित तौर पर गैमर्स ग्रुप द्वारा \"लक्ष्यों को पूरा नहीं करने\" के लिए बर्खास्त कर दिया गया था, जिसने पिछले साल अस्पष्ट उद्देश्यों और मंच के पाठकों की समझ की कमी का हवाला देते हुए अस्पष्ट उद्देश्यों और मंच के पाठकों की समझ की कमी को चल रहे मुद्दों के रूप में उद्धृत किया था।",
      "अन्य उल्लेखनीय प्रस्थान में योगदानकर्ता एमी कैंपबेल, पार्क्स हरमन, डैरेन मूनी, मैट लाफलिन और जेएम 8 शामिल हैं, जो कैलिंड्रा की समाप्ति के लिए एक कर्मचारी-व्यापक एकता और प्रतिक्रिया का सुझाव देते हैं।"
    ],
    "commentSummary": [
      "शून्य विराम चिह्न से जाने जाने वाले बेन \"याहतज़ी\" क्रोशॉ सहित द एस्केपिस्ट के कई स्टाफ सदस्यों ने साइट के प्रधान संपादक निक कैलेंड्रा की बर्खास्तगी के बाद इस्तीफा दे दिया।",
      "पिछले साल द एस्केपिस्ट को खरीदने वाले गामुर्स ग्रुप ने कथित तौर पर \"लक्ष्यों को प्राप्त नहीं करने\" के लिए कैलेंड्रा को समाप्त कर दिया, हालांकि उन्होंने लक्ष्य अस्पष्टता और अपने दर्शकों की समझ की कमी को चल रहे मुद्दों के रूप में इंगित किया।",
      "यह सामूहिक इस्तीफा कैलेंड्रा के साथ एकजुटता का एक कार्य है, और एमी कैंपबेल, पार्क्स हरमन, डैरेन मूनी, मैट लाफलिन और डिजाइन डेलवे के जेएम 8 सहित उल्लेखनीय निकास के साथ उनकी समाप्ति की प्रतिक्रिया है।"
    ],
    "points": 189,
    "commentCount": 101,
    "retryCount": 0,
    "time": 1699368025
  }
]
