[
  {
    "id": 38180477,
    "title": "การปรับปรุงประสิทธิภาพการดําเนินงานของธนาคารผ่านเทคโนโลยี: การวิเคราะห์ความท้าทายในปัจจุบันและการปรับปรุงที่อาจเกิดขึ้น",
    "originLink": "https://www.bitsaboutmoney.com/archive/seeing-like-a-bank/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38180477",
    "commentBody": "",
    "originSummary": [
      "Patrick McKenzie วิพากษ์วิจารณ์ธนาคารถึงความไร้ประสิทธิภาพในการดําเนินงานเนื่องจากโครงสร้างที่ไม่เป็นระเบียบและการสื่อสารที่ไม่มีประสิทธิภาพระหว่างระบบย่อยซึ่งนําไปสู่ปัญหาเช่นการปิดบัญชีและการฉ้อโกงบัตรเครดิต",
      "เขาชี้ให้เห็นว่าระบบการบริการลูกค้าแบบฉัตรซึ่งมีวัตถุประสงค์เพื่อประหยัดเวลาและทรัพยากรของธนาคารมักจะทําให้ความหงุดหงิดและความไร้ประสิทธิภาพของลูกค้ารุนแรงขึ้น นอกจากนี้เขายังเรียกภาระผูกพันทางกฎหมายบางอย่างเช่นรายงานกิจกรรมที่น่าสงสัยที่ไม่เปิดเผยซึ่งอาจนําไปสู่การปิดบัญชีอย่างกะทันหันและเพิ่มความสับสนให้กับลูกค้า",
      "McKenzie แนะนําว่าการปรับปรุงทางเทคโนโลยีสามารถปรับปรุงการดําเนินงานของธนาคารและการบริการลูกค้า แต่รับทราบถึงเวลาที่จําเป็นสําหรับการยอมรับทั่วทั้งระบบ เขายังขอให้มีการประเมินกฎระเบียบบางอย่างที่ก่อให้เกิดอันตรายต่อลูกค้าโดยไม่จําเป็น"
    ],
    "commentSummary": [
      "Patrick McKenzie ตรวจสอบธนาคารสําหรับความไร้ประสิทธิภาพในการดําเนินงานอันเป็นผลมาจากการสื่อสารที่ไม่ดีและการจัดระเบียบภายในระบบย่อยซึ่งนําไปสู่ปัญหาต่างๆเช่นการปิดบัญชีและการฉ้อโกงบัตรเครดิต",
      "เขาชี้ไปที่โครงสร้างการบริการลูกค้าแบบแบ่งชั้นของธนาคารและภาระผูกพันทางกฎหมายที่สับสนเช่นรายงานกิจกรรมที่น่าสงสัยที่ไม่เปิดเผยซึ่งเป็นส่วนหนึ่งของปัญหา",
      "แมคเคนซีเชื่อว่าเทคโนโลยีที่ได้รับการปรับปรุงสามารถช่วยเพิ่มความสามารถในการดําเนินงานและประสบการณ์ของลูกค้าของธนาคาร แต่ยอมรับว่าการนําไปปฏิบัติทั่วทั้งระบบการเงินอาจค่อยเป็นค่อยไป เขายังเน้นย้ําถึงความจําเป็นในการพิจารณากฎระเบียบเฉพาะที่ก่อให้เกิดอันตรายและความสับสนโดยไม่จําเป็นต่อลูกค้า"
    ],
    "points": 519,
    "commentCount": 373,
    "retryCount": 0,
    "time": 1699380475
  },
  {
    "id": 38180846,
    "title": "การปรับปรุงเทคโนโลยี Northlight เพื่อเพิ่มประสบการณ์การเล่นเกมใน Alan Wake 2",
    "originLink": "https://www.remedygames.com/article/how-northlight-makes-alan-wake-2-shine",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38180846",
    "commentBody": "",
    "originSummary": [
      "ทีมพัฒนา Northlight สําหรับ Alan Wake 2 ได้แนะนําการปรับปรุงเทคโนโลยีหลายอย่างเช่นโมเดลวัตถุเกมที่มุ่งเน้นข้อมูลใหม่เพื่อประสิทธิภาพหน่วยความจําที่ดีขึ้นและประสิทธิภาพที่เร็วขึ้นและการควบคุมตัวละครที่ใช้ Voxel เพื่อการนําทางที่ดีขึ้น",
      "นักพัฒนาได้นํา Luau ซึ่งเป็นภาษาที่มาจาก Lua โดย Roblox มาใช้โดยกําจัดโค้ดฟุ่มเฟือยประมาณ 80,000 บรรทัด พวกเขายังแนะนําระบบลมใหม่สําหรับเอฟเฟกต์ฟิสิกส์ที่แท้จริงและเครื่องมือกระเจิงสําหรับการออกแบบสภาพแวดล้อมขนาดใหญ่",
      "ภาคต่อมีไปป์ไลน์การเรนเดอร์ที่ขับเคลื่อนด้วย GPU ใหม่การสนับสนุน HDR และการเรนเดอร์ความโปร่งใสที่เพิ่มขึ้นและเครื่องมือ VFX เพื่อความยืดหยุ่นทางศิลปะที่ดีขึ้น นอกจากนี้ยังรวมถึงการสนับสนุนแสงโดยตรงที่ติดตามรังสี"
    ],
    "commentSummary": [
      "ทีมพัฒนา Northlight สําหรับ Alan Wake 2 ได้ทําการปรับปรุงทางเทคโนโลยีหลายอย่าง เช่น โมเดลวัตถุเกมที่มุ่งเน้นข้อมูลที่มีประสิทธิภาพด้านหน่วยความจํา และการควบคุมตัวละครที่ใช้ Voxel เพื่อประสบการณ์การนําทางที่ราบรื่นยิ่งขึ้น",
      "มีการแนะนําระบบลมใหม่สําหรับเอฟเฟกต์ฟิสิกส์ที่สมจริงพร้อมกับเครื่องมือกระเจิงสําหรับการออกแบบสภาพแวดล้อมขนาดใหญ่ นอกจากนี้ภาษาสคริปต์ที่เป็นกรรมสิทธิ์ยังถูกแทนที่ด้วย Luau (มาจาก Lua โดย Roblox) ลดโค้ดที่ไม่จําเป็นประมาณ 80,000 บรรทัด",
      "ภาคต่อมีไปป์ไลน์การเรนเดอร์ที่ขับเคลื่อนด้วย GPU ใหม่สําหรับรายละเอียดโลกของเกมที่สมบูรณ์ยิ่งขึ้นการเรนเดอร์ความโปร่งใสที่ได้รับการปรับปรุงและเครื่องมือ VFX นอกจากนี้ยังรองรับ HDR และแสงโดยตรงที่ติดตามรังสีทําให้ศิลปินมีความยืดหยุ่นในการสร้างสรรค์มากขึ้น"
    ],
    "points": 398,
    "commentCount": 198,
    "retryCount": 0,
    "time": 1699381976
  },
  {
    "id": 38176750,
    "title": "ภารกิจอวกาศแบบยุคลิดของ ESA เปิดตัวภาพสีที่มีรายละเอียดครั้งแรกของจักรวาลเตรียมแผนที่ 3 มิติที่ใหญ่ที่สุดของจักรวาล",
    "originLink": "https://www.esa.int/Science_Exploration/Space_Science/Euclid/Euclid_s_first_images_the_dazzling_edge_of_darkness",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38176750",
    "commentBody": "",
    "originSummary": [
      "ภารกิจ Euclid ของ ESA ได้เปิดตัวภาพจักรวาลวิทยาแบบเต็มสีเป็นครั้งแรกซึ่งแสดงความคมชัดที่ไม่มีใครเทียบได้เหนือส่วนท้องฟ้าขนาดใหญ่",
      "กล้องโทรทรรศน์ยุคลิดถูกตั้งค่าให้สร้างแผนที่จักรวาล 3 มิติที่ครอบคลุมที่สุดและกลั่นกรองสสารมืดและพลังงานมืดซึ่งคิดเป็น 95% ของจักรวาลของเรา",
      "ภาพเริ่มต้นของ Euclid แสดงให้เห็นถึงความสามารถพิเศษในการสร้างภาพคมชัดและอินฟราเรดในส่วนท้องฟ้าที่กว้างขวางในครั้งเดียว ภารกิจนี้แสดงให้เห็นถึงความเป็นเลิศของยุโรปและความร่วมมือระดับโลก"
    ],
    "commentSummary": [
      "ภารกิจอวกาศแบบยุคลิดขององค์การอวกาศยุโรป (ESA) ได้เปิดเผยภาพสีเต็มรูปแบบครั้งแรกของจักรวาลที่มีความชัดเจนอย่างน่าทึ่งเหนือส่วนสําคัญของท้องฟ้า",
      "กล้องโทรทรรศน์ยุคลิดที่ออกแบบมาเพื่อสร้างแผนที่ 3 มิติที่ครอบคลุมที่สุดของจักรวาลจะเจาะลึกการตรวจสอบสสารมืดและพลังงานมืดที่คิดเป็น 95% ของจักรวาลของเรา",
      "ในอีกหกปีข้างหน้า ยูคลิดจะกลั่นกรองกาแล็กซีหลายพันล้านกาแล็กซีที่อยู่ห่างออกไปถึง 10 พันล้านปีแสง ซึ่งแสดงให้เห็นถึงความสามารถพิเศษในการส่งมอบภาพที่คมชัดและอินฟราเรดผ่านส่วนท้องฟ้าขนาดใหญ่ในเซสชั่นเดียว"
    ],
    "points": 382,
    "commentCount": 92,
    "retryCount": 0,
    "time": 1699365532
  },
  {
    "id": 38186190,
    "title": "การทดสอบเกมแบบโต้ตอบความรู้เกี่ยวกับยากล่อมประสาทและตัวละครโทลคีน",
    "originLink": "https://antidepressantsortolkien.vercel.app/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38186190",
    "commentBody": "",
    "originSummary": [
      "เกมดังกล่าวท้าทายผู้เล่นให้แยกแยะว่าคําที่กําหนดเป็นยาต้านอาการซึมเศร้าหรือตัวละครจากผลงานของ J.R.R. Tolkien",
      "มันเน้นจุดตัดของวรรณคดีและระบบการตั้งชื่อทางเภสัชกรรมทําให้ผู้เล่นได้รับประสบการณ์การเรียนรู้ที่ไม่เหมือนใคร",
      "แนวคิดที่แปลกประหลาดของเกมโดดเด่นทําให้เป็นหัวข้อที่น่าสนใจสําหรับทั้งผู้ที่ชื่นชอบโทลคีนและผู้ที่หลงใหลในคําศัพท์ทางเภสัชกรรม"
    ],
    "commentSummary": [
      "บทความนี้กล่าวถึงเกมที่น่าสนใจซึ่งมีศูนย์กลางอยู่ที่ความท้าทายในการแยกแยะระหว่างชื่อของยาต้านอาการซึมเศร้าและตัวละครจากผลงานของ J.R.R. Tolkien",
      "มันทําหน้าที่เป็นการตรวจสอบที่แปลกประหลาด แต่น่าสนใจของทั้งวัฒนธรรมป๊อปและคําศัพท์ทางเภสัชกรรม",
      "มันวาดเส้นขนานที่ไม่คาดคิดระหว่างสองอาณาจักรที่แตกต่างกันอย่างมากมาย: จินตนาการทางวรรณกรรมและวิทยาศาสตร์การแพทย์"
    ],
    "points": 381,
    "commentCount": 80,
    "retryCount": 0,
    "time": 1699412000
  },
  {
    "id": 38181346,
    "title": "การเพิ่มประสิทธิภาพแอปพลิเคชัน Go ในคอนเทนเนอร์: บทบาทของ Linux Scheduler และขีด จํากัด CPU",
    "originLink": "https://www.riverphillips.dev/blog/go-cfs/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38181346",
    "commentBody": "",
    "originSummary": [
      "โพสต์บล็อกเน้นถึงความจําเป็นในการตั้งค่าขีด จํากัด CPU ในตัวประสานคอนเทนเนอร์เมื่อเรียกใช้แอปพลิเคชันเพื่อหลีกเลี่ยงการใช้พลังงาน CPU ทั้งหมดของโฮสต์",
      "ข้อมูลเชิงลึกเกี่ยวกับกระบวนการ Go Garbage Collector บทบาทของ Linux Scheduler และความสําคัญของการควบคุมเธรด CPU ผ่านตัวแปรสภาพแวดล้อม GOMAXPROCS",
      "Uber ได้เปิดตัวไลบรารี 'automaxprocs' ซึ่งจะคํานวณค่า GOMAXPROCS โดยอัตโนมัติจาก cgroups ของคอนเทนเนอร์ ทําให้การตั้งค่าง่ายขึ้นในขณะที่เรียกใช้ Go ในแอปพลิเคชันที่มีคอนเทนเนอร์"
    ],
    "commentSummary": [
      "นักพัฒนา Go ในบล็อกเน้นย้ําถึงความสําคัญของการตั้งค่าขีด จํากัด CPU ในตัวประสานคอนเทนเนอร์เพื่อหลีกเลี่ยงการใช้ CPU สูงบนโฮสต์เนื่องจากรันไทม์ Go มีแนวโน้มที่จะใช้พลังงาน CPU ที่มีอยู่ทั้งหมดซึ่งอาจทําให้เกิดเวลาแฝงสูง",
      "ผู้เขียนแนะนําให้ควบคุมจํานวนเธรด CPU ที่รันไทม์ Go สามารถสร้างได้โดยใช้ตัวแปรสภาพแวดล้อม GOMAXPROCS ซึ่งสอดคล้องกับโควต้า CPU",
      "Uber ได้สร้างไลบรารี 'automaxprocs' ที่คํานวณค่าตัวแปรสภาพแวดล้อมนี้จาก cgroups ของคอนเทนเนอร์โดยอัตโนมัติ เพื่อรองรับความจําเป็นของการกําหนด GOMAXPROCS ที่สมเหตุสมผลเมื่อเรียกใช้ Go ในแอปพลิเคชันที่มีคอนเทนเนอร์"
    ],
    "points": 295,
    "commentCount": 107,
    "retryCount": 0,
    "time": 1699384204
  },
  {
    "id": 38183454,
    "title": "ขอแนะนํา Gleam: ภาษาการเขียนโปรแกรมพร้อมกันและใช้งานง่ายบน Erlang Runtime",
    "originLink": "https://gleam.run/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38183454",
    "commentBody": "",
    "originSummary": [
      "Gleam เป็นโปรแกรมที่แข็งแกร่งตามรันไทม์ของ Erlang ซึ่งมีไวยากรณ์ที่ทันสมัยและระบบประเภทที่ทรงพลังซึ่งติดตั้งเพื่อจัดการกับปริมาณงานทุกขนาดด้วยระบบการทํางานพร้อมกันและโครงสร้างข้อมูลที่ไม่เปลี่ยนรูปอย่างรวดเร็ว",
      "โปรแกรมรองรับการทํางานแบบมัลติคอร์ใช้ตัวเก็บขยะพร้อมกันและมีคอมไพเลอร์เครื่องมือสร้างตัวจัดรูปแบบการรวมตัวแก้ไขและตัวจัดการแพ็คเกจ สามารถทํางานร่วมกับแพ็คเกจจากภาษา BEAM อื่น ๆ เช่น Erlang และ Elixir",
      "นอกเหนือจากคุณสมบัติหลักแล้ว Gleam ยังคอมไพล์เป็น JavaScript สร้างคําจํากัดความ TypeScript สําหรับการโต้ตอบภายนอกที่มีประสิทธิภาพและจัดลําดับความสําคัญของข้อความแสดงข้อผิดพลาดที่ใช้งานง่ายโดยมีเป้าหมายเพื่อการรวมความหลากหลายทางวัฒนธรรม"
    ],
    "commentSummary": [
      "Gleam เป็นโปรแกรมที่แข็งแกร่งตามรันไทม์ Erlang ซึ่งมีไวยากรณ์ที่ทันสมัยและระบบประเภทที่มีประสิทธิภาพสามารถจัดการปริมาณงานได้ทุกขนาดเนื่องจากระบบพร้อมกันและโครงสร้างข้อมูลที่ไม่เปลี่ยนรูปได้อย่างรวดเร็ว",
      "มันมาพร้อมกับคอมไพเลอร์ของตัวเองเครื่องมือสร้างตัวจัดรูปแบบการรวมตัวแก้ไขและตัวจัดการแพ็คเกจและสามารถโต้ตอบกับแพ็คเกจจากภาษา BEAM อื่น ๆ เช่น Erlang และ Elixir นอกจากนี้ยังคอมไพล์เป็น JavaScript และสร้างคําจํากัดความ TypeScript สําหรับการโต้ตอบภายนอกที่มีประสิทธิภาพ",
      "ข้อความแสดงข้อผิดพลาดที่ใช้งานง่ายและการรวมกลุ่มทางวัฒนธรรมเป็นแง่มุมที่มีความสําคัญสูงของ Gleam เนื่องจากมีจุดมุ่งหมายเพื่อให้สามารถเข้าถึงได้และมีประสิทธิภาพสําหรับกลุ่มผู้ใช้ที่หลากหลาย"
    ],
    "points": 266,
    "commentCount": 138,
    "retryCount": 0,
    "time": 1699394009
  },
  {
    "id": 38182869,
    "title": "กิจกรรม 'Scary Fast' ของ Apple ซึ่งถ่ายด้วย iPhone 15 Pro Max แสดงความสามารถของกล้องระดับมืออาชีพ",
    "originLink": "https://prolost.com/blog/scarybts",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38182869",
    "commentBody": "",
    "originSummary": [
      "Apple ใช้ iPhone 15 Pro Max เพื่อถ่ายทํากิจกรรม \"Scary Fast\" ทั้งหมดในเดือนตุลาคม ซึ่งเปิดตัว Mac ใหม่ที่มีซิลิคอน M3 ซึ่งแสดงให้เห็นถึงความสามารถในการบันทึกวิดีโอระดับมืออาชีพ",
      "Pro Workflows Group ของ Apple ส่งเสริมการใช้อุปกรณ์ Apple อย่างมืออาชีพและแสดงคุณภาพด้วยการถ่ายทําแอ็คชั่นสั้นโดยใช้แอพและเทคนิคพิเศษ",
      "แคมเปญ \"Shot on iPhone\" มีจุดมุ่งหมายเพื่อจุดประกายความคิดสร้างสรรค์และแสดงให้เห็นว่าการตัดสินใจใช้เครื่องมือเหล่านี้สอดคล้องกับความตั้งใจและความต้องการของแต่ละบุคคล"
    ],
    "commentSummary": [
      "Apple ใช้ iPhone 15 Pro Max เพื่อถ่ายทํากิจกรรม \"Scary Fast\" ทั้งหมดในเดือนตุลาคม ซึ่งแสดงให้เห็นถึงความสามารถของกล้องระดับมืออาชีพของโทรศัพท์ งานนี้เปิดตัว Mac ใหม่พร้อมซิลิคอน M3",
      "นอกจากการถ่ายภาพเหตุการณ์แล้ว Apple ยังบันทึกภาพแอ็คชั่นสั้น ๆ โดยใช้เครื่องมือต่างๆ เช่น แอพกล้อง Blackmagic และเทคนิคชัตเตอร์พิเศษเพื่อให้ได้ผลลัพธ์คุณภาพสูง",
      "แคมเปญ \"Shot on iPhone\" ซึ่งได้รับการสนับสนุนจาก Apple Pro Workflows Group มีจุดมุ่งหมายเพื่อสร้างแรงบันดาลใจให้ผู้ใช้ใช้ประโยชน์จาก iPhone ของตนเพื่อความพยายามในการสร้างสรรค์ โดยเน้นว่าการเลือกใช้เครื่องมือดังกล่าวขึ้นอยู่กับความตั้งใจและข้อกําหนดในการสร้างสรรค์ของบุคคล"
    ],
    "points": 263,
    "commentCount": 131,
    "retryCount": 0,
    "time": 1699391338
  },
  {
    "id": 38176113,
    "title": "GodotCon 2023: เจาะลึกอนาคตของการเรนเดอร์ การพัฒนาเกมอินดี้ และอีกมากมาย",
    "originLink": "https://media.ccc.de/c/godotcon2023",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38176113",
    "commentBody": "",
    "originSummary": [
      "ข้อความนี้มีแคตตาล็อกการอภิปรายและฟีดพอดคาสต์มากมายจาก GodotCon 2023 โดยมุ่งเน้นไปที่การเรนเดอร์ในอนาคตใน Godot ดําเนินการสตูดิโอพัฒนาเกมอิสระและด้านเทคนิคของการพัฒนาเกมใน Godot",
      "การบันทึกจากการประชุมมีให้บริการในรูปแบบต่างๆเช่น mp4 และ webm ซึ่งตอบสนองความต้องการที่หลากหลาย",
      "การเสวนาไฮไลต์ ได้แก่ 'From watercolors to mechs: Stylized rendering and asset pipelines in Godot' และ 'Super-charging content production with Godot addons' ซึ่งแสดงให้เห็นถึงความหลากหลายของหัวข้อที่กล่าวถึง"
    ],
    "commentSummary": [
      "ข้อความให้ภาพรวมที่ครอบคลุมของฟีดพอดคาสต์และการพูดคุยจาก GodotCon 2023 ซึ่งเป็นการประชุมที่อุทิศให้กับเอ็นจิ้นเกม Godot",
      "หัวข้อที่กล่าวถึงมีตั้งแต่การพัฒนาในอนาคตในการเรนเดอร์ของ Godot ไปจนถึงพลวัตของการดําเนินงานสตูดิโอพัฒนาเกมอิสระและการอภิปรายทางเทคนิคเกี่ยวกับการพัฒนาเกมภายใน Godot",
      "การอภิปรายที่บันทึกไว้ต่างๆ รวมถึง 'From watercolors to mechs: Stylized rendering and asset pipelines in Godot' และ 'Super-charging content production with Godot addons' สามารถเข้าถึงได้ในรูปแบบต่างๆ เช่น mp4 และ webm"
    ],
    "points": 242,
    "commentCount": 43,
    "retryCount": 0,
    "time": 1699360951
  },
  {
    "id": 38176592,
    "title": "บัตรลงคะแนนเลือกตั้งเมน 2023 เพื่อรวมข้อเสนอสําหรับการพิมพ์รัฐธรรมนูญฉบับดั้งเดิมอย่างเต็มรูปแบบ",
    "originLink": "https://www.mitsc.org/news/maine-2023-election-ballot-question-6-fact-sheet",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38176592",
    "commentBody": "",
    "originSummary": [
      "รัฐเมนเสนอให้แก้ไขรัฐธรรมนูญผ่านข้อเสนอทางกฎหมายในบัตรลงคะแนนเลือกตั้งปี 2023 เพื่อให้แน่ใจว่าบทบัญญัติทั้งหมดปรากฏในสําเนาที่พิมพ์อย่างเป็นทางการซึ่งสร้างโดยรัฐมนตรีว่าการกระทรวงการต่างประเทศ",
      "การลงคะแนน 'ใช่' จะคืนสถานะส่วนดั้งเดิมของเอกสารที่ละเว้นเนื่องจากการแก้ไขในปี 1876 เช่น พันธกรณีตามสนธิสัญญาของเมนที่มีต่อชาววาบานากิ",
      "ข้อเสนอนี้ตั้งใจที่จะไม่เปลี่ยนแปลงคํามั่นสัญญาที่มีอยู่ต่อประเทศวาบานากิ แต่เพื่อให้ประชาชนสามารถเข้าถึงภาษาดั้งเดิมของรัฐธรรมนูญได้อย่างครอบคลุม"
    ],
    "commentSummary": [
      "เมนจะนําเสนอข้อเสนอทางกฎหมาย (คําถาม #6) เกี่ยวกับบัตรลงคะแนนเลือกตั้งปี 2023 เพื่อแก้ไขรัฐธรรมนูญของรัฐเพื่อให้แน่ใจว่าบทบัญญัติทั้งหมดจะรวมอยู่ในสําเนาที่พิมพ์อย่างเป็นทางการซึ่งจัดทําโดยรัฐมนตรีว่าการกระทรวงการต่างประเทศ",
      "การลงคะแนน \"ใช่\" จะเรียกคืนส่วนเดิมที่ละเว้นในสําเนาที่พิมพ์ออกมาเนื่องจากการแก้ไขในปี 1876 รวมถึงพันธกรณีตามสนธิสัญญาของเมนที่มีต่อชาววาบานากิ ข้อสัญญาเหล่านี้ยังคงมีผลบังคับใช้แม้ว่าจะไม่มีการพิมพ์ก็ตาม",
      "ข้อเสนอนี้พยายามที่จะเพิ่มการเข้าถึงภาษาต้นฉบับที่สมบูรณ์ของรัฐธรรมนูญโดยไม่เปลี่ยนแปลง \"หน้าที่และภาระผูกพัน\" ที่มีอยู่ของเมนที่มีต่อประเทศวาบานากิ"
    ],
    "points": 228,
    "commentCount": 223,
    "retryCount": 0,
    "time": 1699364592
  },
  {
    "id": 38181114,
    "title": "บทความ 45 ของ eIDAS 2.0: ความพ่ายแพ้ที่อาจเกิดขึ้นสําหรับมาตรฐานความปลอดภัยของเว็บในสหภาพยุโรป",
    "originLink": "https://www.eff.org/deeplinks/2023/11/article-45-will-roll-back-web-security-12-years",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38181114",
    "commentBody": "",
    "originSummary": [
      "สหภาพยุโรป (EU) กําลังหารือเกี่ยวกับ eIDAS 2.0 ซึ่งเป็นกฎระเบียบใหม่ที่อาจอนุญาตให้รัฐบาลทํางานร่วมกับหน่วยงานออกใบรับรองในการตรวจสอบการรับส่งข้อมูลที่เข้ารหัส",
      "กฎระเบียบนี้อาจส่งผลกระทบต่อข้อกําหนดด้านความปลอดภัยที่ทันสมัยของหน่วยงานออกใบรับรองบางแห่งโดยไม่ได้รับอนุมัติจากรัฐบาลสมาชิกสหภาพยุโรป",
      "โดยเฉพาะมาตรา 45 ของระเบียบนี้ทําให้เกิดความกังวลเป็นพิเศษเนื่องจากอาจลดมาตรฐานความปลอดภัยของเว็บเบราว์เซอร์สําหรับผู้ใช้อินเทอร์เน็ตในยุโรป คาดว่าจะสรุปข้อความอย่างเป็นทางการได้ในวันที่ 8 พฤศจิกายน"
    ],
    "commentSummary": [
      "สหภาพยุโรปกําลังวางแผนที่จะให้สัตยาบันกฎระเบียบใหม่ eIDAS 2.0 ทําให้รัฐบาลสามารถให้ความร่วมมือกับหน่วยงานออกใบรับรองเพื่อตรวจสอบการรับส่งข้อมูลที่เข้ารหัสได้",
      "กฎระเบียบดังกล่าวอาจบ่อนทําลายข้อกําหนดเบื้องต้นด้านความปลอดภัยร่วมสมัยเกี่ยวกับหน่วยงานออกใบรับรองโดยไม่ได้รับความยินยอมจากรัฐบาลสมาชิกสหภาพยุโรป",
      "มาตรา 45 ที่รวมอยู่ในกฎระเบียบนี้ก่อให้เกิดความกังวลเรื่องความเป็นส่วนตัวส่วนใหญ่สําหรับผู้ใช้อินเทอร์เน็ตในยุโรปเนื่องจากอาจทําให้มาตรฐานความปลอดภัยของเว็บเบราว์เซอร์ลดลง ข้อความสุดท้ายของกฎระเบียบจะได้รับการยืนยันในวันที่ 8 พฤศจิกายน"
    ],
    "points": 226,
    "commentCount": 118,
    "retryCount": 0,
    "time": 1699383141
  },
  {
    "id": 38182461,
    "title": "ถอดรหัสความซับซ้อนของการเขียนคอมไพเลอร์ด้วยรหัสแอสเซมบลี x86-64",
    "originLink": "http://sebmestre.blogspot.com/2023/11/en-writing-compiler-is-surprisingly.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38182461",
    "commentBody": "",
    "originSummary": [
      "โพสต์บล็อกช่วยลดความยุ่งยากในกระบวนการเขียนคอมไพเลอร์โดยกําหนดเป้าหมายการแปลภาษาระดับสูงเป็นรหัสเครื่อง x86-64 โดยเน้นที่ตัวอักษรจํานวนเต็มตัวแปรการปฏิเสธและการเพิ่มเติม",
      "ผู้เขียนสาธิตวิธีการแสดงและรวบรวมตัวอักษรจํานวนเต็มตัวแปรรวบรวมการปฏิเสธโดยใช้คําแนะนํา x86-64 ที่แตกต่างกันและความสําคัญของการใช้การลงทะเบียนในกระบวนการนี้",
      "คําสั่งเพิ่มเติมจะถูกคอมไพล์โดยใช้สแต็คและตัวนับอย่างง่ายเพื่อป้องกันการนําสล็อตกลับมาใช้ใหม่ซึ่งนําไปสู่การรวบรวมนิพจน์เลขคณิต โพสต์ในอนาคตวางแผนที่จะเป็นแนวทางในการรวบรวมโครงสร้างโฟลว์ควบคุมและการเรียกฟังก์ชันและตัวชี้"
    ],
    "commentSummary": [
      "ผู้เขียนบล็อกโพสต์อธิบายว่าการเขียนคอมไพเลอร์ในขณะที่ในตอนแรกดูเหมือนจะซับซ้อนสามารถทําได้อย่างเรียบง่ายในช่วงสุดสัปดาห์ด้วยสมมติฐานบางอย่าง",
      "เน้นแนวคิดในการแปลภาษาระดับสูงเป็นรหัสเครื่อง x86-64 โดยใช้ตัวแปรการปฏิเสธและการเพิ่มซึ่งแปลเพิ่มเติมเป็นรหัสแอสเซมบลี x86-64 ผ่านแอสเซมเบลอร์ที่มีอยู่ก่อน",
      "การใช้คําแนะนํา x86-64 โพสต์ให้ตัวอย่างในการรวบรวมตัวอักษรจํานวนเต็มตัวแปรการปฏิเสธและการบวกสรุปด้วยการรวบรวมนิพจน์เลขคณิต โพสต์ในอนาคตสัญญาว่าจะจัดการกับการรวบรวมโครงสร้างโฟลว์การควบคุมและการเรียกฟังก์ชัน"
    ],
    "points": 208,
    "commentCount": 83,
    "retryCount": 0,
    "time": 1699389403
  },
  {
    "id": 38176062,
    "title": "ขอแนะนํา SectorC: คอมไพเลอร์ C ที่เล็กที่สุดในโลกใน Boot Sector ของเครื่อง x86",
    "originLink": "https://github.com/xorvoid/sectorc",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38176062",
    "commentBody": "",
    "originSummary": [
      "SectorC ซึ่งเป็นคอมไพเลอร์ C ที่เขียนในแอสเซมบลี x86-16 อาจถือได้ว่าเป็นคอมไพเลอร์ C ที่เล็กที่สุดเนื่องจากความสามารถในการใส่ลงในบูตเซกเตอร์ของเครื่อง x86",
      "รองรับชุดย่อยที่สําคัญของภาษา C SectorC ช่วยให้สามารถสร้างโปรแกรมที่ซับซ้อนเช่นโปรแกรมที่เกี่ยวข้องกับภาพเคลื่อนไหวของคลื่นไซน์ที่เคลื่อนที่แม้จะมีขนาดกะทัดรัดก็ตาม",
      "แม้ว่าจะแนะนําให้มีกรณีการใช้งานเฉพาะกลุ่ม แต่ SectorC สามารถเป็นเครื่องมือที่มีประโยชน์สําหรับบุคคลที่ต้องการทําความเข้าใจฟังก์ชั่น x86-16 bios และรุ่นเครื่องโดยไม่จําเป็นต้องมีความรู้มากมายเกี่ยวกับการประกอบ x86"
    ],
    "commentSummary": [
      "SectorC เป็นคอมไพเลอร์ C ซึ่งกล่าวกันว่าเป็นหนึ่งในคอมไพเลอร์ที่เล็กที่สุดเท่าที่เคยมีมาซึ่งเขียนขึ้นในแอสเซมบลี x86-16 คอมไพเลอร์มีเอกลักษณ์เฉพาะตัวเนื่องจากสามารถใส่ได้ภายในบูตเซกเตอร์ของเครื่อง x86",
      "แม้จะมีขนาดกะทัดรัด แต่ SectorC ก็รองรับชุดย่อยที่โดดเด่นของภาษา C รวมถึงฟังก์ชัน if statements ในขณะที่คําสั่ง และคุณสมบัติอื่น ๆ สิ่งนี้ช่วยให้สามารถสร้างโปรแกรมที่ซับซ้อนเช่นภาพเคลื่อนไหวคลื่นไซน์ที่เคลื่อนไหวได้",
      "ดูเหมือนว่าได้รับการพัฒนาโดยมุ่งเน้นไปที่ผู้ที่ต้องการเข้าใจฟังก์ชั่นไบออส x86-16 และรุ่นเครื่องทําให้พวกเขาเป็นสะพานเชื่อมในการสํารวจโดยไม่จําเป็นต้องเรียนรู้การประกอบ x86 ที่กว้างขวาง"
    ],
    "points": 203,
    "commentCount": 58,
    "retryCount": 0,
    "time": 1699360435
  },
  {
    "id": 38178592,
    "title": "ความก้าวหน้าของ Async Rust: แผนพัฒนาสี่ปีที่ครอบคลุม",
    "originLink": "https://without.boats/blog/a-four-year-plan/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38178592",
    "commentBody": "",
    "originSummary": [
      "ผู้เขียนสนับสนุนคุณสมบัติใหม่ใน async Rust เช่น AsyncIterator, async generators และ \"Return Type Notation\" พร้อมกับถือว่าการปิด async เป็นการปิดที่ส่งคืน 'impl Future'",
      "พวกเขาสัมผัสกับแนวคิดที่ซับซ้อนเช่นวิธีการ coroutine ที่ปลอดภัยต่อวัตถุและตัวทําลาย async และหารือเกี่ยวกับการรวมประเภทขั้นสูงเช่น Immoveable, Unforgettable และ Undroppable",
      "ผู้เขียนวิพากษ์วิจารณ์กระบวนการตัดสินใจและการสื่อสารของโครงการ Rust กระตุ้นให้เกิดความเข้าใจและการสนทนาที่เปิดกว้างระหว่างทีมโครงการและชุมชน"
    ],
    "commentSummary": [
      "ผู้เขียนกล่าวถึงการปรับปรุงในอนาคตสําหรับการเขียนโปรแกรม Rust แบบอะซิงโครนัสโดยมุ่งเน้นไปที่การแนะนําคุณสมบัติใหม่ ๆ รวมถึง AsyncIterator เครื่องกําเนิดไฟฟ้าแบบอะซิงโครนัสและนวนิยาย \"Return Type Notation\"",
      "โพสต์แนะนําให้ปฏิบัติต่อการปิดแบบอะซิงโครนัสเป็นการปิดที่ส่งคืน 'impl Future' และเจาะลึกแนวคิดที่ซับซ้อนเช่นวิธีการ coroutine ที่ปลอดภัยต่อวัตถุและตัวทําลายแบบอะซิงโครนัส",
      "ผู้เขียนวิพากษ์วิจารณ์การตัดสินใจและการสื่อสารของโครงการ Rust และอุทธรณ์เพื่อความเข้าใจและการสื่อสารที่ดีขึ้นระหว่างนักพัฒนาโครงการและชุมชน"
    ],
    "points": 201,
    "commentCount": 220,
    "retryCount": 0,
    "time": 1699373577
  },
  {
    "id": 38177250,
    "title": "การลาออกจํานวนมากที่ The Escapist หลังจากการสิ้นสุดของ Nick Calandra หัวหน้าบรรณาธิการ",
    "originLink": "https://www.gamesindustry.biz/the-escapist-staff-resign-following-termination-of-editor-in-chief-nick-calandra",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38177250",
    "commentBody": "",
    "originSummary": [
      "The Escapist เว็บไซต์เกมประสบกับกระแสการลาออกรวมถึง Ben \"Yahtzee\" Croshaw จาก Zero Punctuation หลังจากการสิ้นสุดของ Nick Calandra หัวหน้าบรรณาธิการ",
      "มีรายงานว่า Calandra ถูกไล่ออกเนื่องจาก \"ไม่เป็นไปตามเป้าหมาย\" โดย Gamurs Group ซึ่งเข้าซื้อกิจการ The Escapist เมื่อปีที่แล้ว โดยอ้างถึงวัตถุประสงค์ที่ไม่ชัดเจนและการขาดความเข้าใจเกี่ยวกับผู้อ่านของแพลตฟอร์มว่าเป็นประเด็นต่อเนื่อง",
      "การออกเดินทางที่โดดเด่นอื่น ๆ ได้แก่ ผู้สนับสนุน Amy Campbell, Parkes Harman, Darren Mooney, Matt Laughlin และ JM8 จาก Design Delve ซึ่งบ่งบอกถึงความสามัคคีของพนักงานและการตอบสนองต่อการยุติของ Calandra"
    ],
    "commentSummary": [
      "พนักงานหลายคนจาก The Escapist รวมถึง Ben \"Yahtzee\" Croshaw ซึ่งรู้จักจาก Zero Punctuation ลาออกหลังจากการยิง Nick Calandra หัวหน้าบรรณาธิการของเว็บไซต์",
      "มีรายงานว่า Gamurs Group ซึ่งซื้อ The Escapist เมื่อปีที่แล้วได้ยุติ Calandra เนื่องจาก \"ไม่บรรลุเป้าหมาย\" แม้ว่าเขาจะชี้ไปที่ความคลุมเครือของเป้าหมายและการขาดความเข้าใจของผู้ชมว่าเป็นประเด็นต่อเนื่อง",
      "การลาออกจํานวนมากนี้เป็นการแสดงความเป็นน้ําหนึ่งใจเดียวกันกับ Calandra และเป็นการตอบสนองต่อการเลิกจ้างของเขาด้วยทางออกที่โดดเด่น เช่น Amy Campbell, Parkes Harman, Darren Mooney, Matt Laughlin และ JM8 ของ Design Delve"
    ],
    "points": 189,
    "commentCount": 101,
    "retryCount": 0,
    "time": 1699368025
  }
]
