[
  {
    "title": "JD.com reports higher Q3 profit as supply chain issues ease",
    "originLink": "https://www.reuters.com/technology/chinas-jdcom-posts-third-quarter-revenue-below-estimates-2023-11-15/",
    "originBody": "Technology China's JD.com posts higher Q3 profit as supply snarls ease Reuters November 15, 202310:07 AM UTCUpdated 3 hours ago A sign of China's e-commerce company JD.com is seen at CES (Consumer Electronics Show) Asia 2016 in Shanghai, China, May 12, 2016. REUTERS/Aly Song/File Photo Acquire Licensing Rights Nov 15 (Reuters) - Chinese e-commerce firm JD.com reported quarterly revenue below estimates on Wednesday, but posted a surge in profit as supply chain problems eased. U.S.-listed shares of the firm rose 5.6% to around $28 in premarket trading. The company also said that CEO Xu Ran will take up the role of chief executive of JD Retail, its retail business. The company has seen challenges in China's rapidly changing e-commerce landscape, with the joining of livestream players and short video social networking service providers such as Douyin, which is China's TikTok, and Xiaohongshu. Advertisement · Scroll to continue JD.com has fewer popular livestreamers than its competitors, such as Austin Li, who exclusively streams on Alibaba Group's (9988.HK) platform. The company's shares were trading at about $60 at the beginning of this year but ended at $26.71 on Tuesday. In October, several banks and brokers including Citi, Daiwa and Jefferies cut price targets and revenue growth forecasts for the firm. read more JD.com and Alibaba both reported year-on-year sales growth for China's largest shopping festival, Singles Day, which ended at midnight on Saturday. Advertisement · Scroll to continue However, according to third-party data provider Syntun, the cumulative gross merchandise volume (GMV) across major traditional e-commerce platforms -- including Alibaba's Tmall, JD.com and Pinduoduo of PDD Holdings -- was 923.5 billion yuan ($127.42 billion), a 1% decline from the previous year. The company reported net revenue of 247.7 billion yuan ($34.19 billion) for the third quarter, missing analysts' average estimate of 249.26 billion yuan according to LSEG data. Advertisement · Scroll to continue But it posted net income attributable to shareholders of 7.94 billion yuan, up 33% from 5.96 billion yuan a year earlier. ($1 = 7.2446 Chinese yuan renminbi) Reporting by Arsheeya Bajwa and Akash Sriram in Bengaluru, Sophie Yu in Beijing; Editing by Varun H K and Kim Coghill Our Standards: The Thomson Reuters Trust Principles. Acquire Licensing Rights , opens new tab Read Next Technology category China receives US equipment to make advanced chips despite new rules-report A US congressional report takes aim at the Biden administration's Oct. 2022 export curbs. White Collar Crime category FBI struggled to disrupt dangerous casino hacking gang, cyber responders say The U.S. Federal Bureau of Investigation (FBI) has struggled to stop a hyper-aggressive cybercrime gang that's been tormenting corporate America over the last two years, according to nine cybersecurity responders, digital crime experts and victims. Technology category Tencent logs robust revenue growth as games, advertising sales shine China's Tencent Holdings said third-quarter revenue climbed 10%, as its games business staged a robust recovery from a regulatory crackdown on the country's tech sector and online advertising sales surged. Technology category Baidu CEO warns China's rush to develop AI models risks wasting resources The head of one of China's leading AI firms, Baidu , warned on Wednesday that the fervor rushing to develop large language models in China could lead to a waste of resources, saying firms needed to focus their efforts on developing practical applications. Technology category Alphabet CEO, in Play store trial, acknowledges some materials not retained Alphabet CEO Sundar Pichai acknowledged in federal court on Tuesday that he sometimes marked documents as \"privileged\" and never turned off a setting that caused internal chats to delete automatically after one day.",
    "originSummary": [
      "JD.com's Q3 profit increased due to improvements in supply chain issues.",
      "The company's quarterly revenue fell short of expectations.",
      "JD.com's CEO will now oversee the company's retail business.",
      "The rise of livestream and short video platforms poses challenges for JD.com in the competitive e-commerce landscape.",
      "Despite a decline in overall e-commerce sales during China's Singles Day shopping festival, both JD.com and Alibaba reported year-on-year growth.",
      "JD.com's shares have experienced a notable decline throughout the year."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700053715937
  },
  {
    "title": "China's Youth Favors Domestic Brands in Double 11 Sales Festival",
    "originLink": "https://www.manilatimes.net/2023/11/15/business/foreign-business/chinas-youth-prefers-domestic-brands-in-double-11-sales-fest/1919773",
    "originBody": "Wednesday, November 15, 2023 Today's Paper China's youth prefers domestic brands in Double 11 sales fest Sign In New user? Click Here Follow us Watch Now Subscribe Sign In New user? Click Here OPINION NEWS REGIONS WORLD BUSINESS SPORTS ENTERTAINMENT LIFESTYLE THE SUNDAY TIMES SPECIAL FEATURES SPECIAL SECTIONS PUBLIC SQUARE LEGAL ADVICE FAST TIMES CAMPUS PRESS VIDEOS EXPATS & DIPLOMATS PHOTOS PODCASTS GAMES BUSINESS FORUM RESOURCES MARKET OVERVIEW EXAM RESULTS WEATHER CLASSIFIEDS TMT CSI TMT DIGITAL EDITION TMT TV TMT 125TH ANNIVERSARY more OPINION NEWS REGIONS WORLD BUSINESS SPORTS ENTERTAINMENT LIFESTYLE THE SUNDAY TIMES SPECIAL FEATURES SPECIAL SECTIONS PUBLIC SQUARE LEGAL ADVICE FAST TIMES CAMPUS PRESS VIDEOS EXPATS & DIPLOMATS PHOTOS PODCASTS GAMES BUSINESS FORUM RESOURCES MARKET OVERVIEW EXAM RESULTS WEATHER CLASSIFIEDS TMT CSI TMT DIGITAL EDITION TMT TV TMT 125TH ANNIVERSARY OPINION NEWS REGIONS WORLD BUSINESS SPORTS ENTERTAINMENT LIFESTYLE THE SUNDAY TIMES SPECIAL FEATURES SPECIAL SECTIONS PUBLIC SQUARE LEGAL ADVICE FAST TIMES CAMPUS PRESS VIDEOS EXPATS & DIPLOMATS PHOTOS PODCASTS GAMES BUSINESS FORUM RESOURCES MARKET OVERVIEW EXAM RESULTS WEATHER CLASSIFIEDS TMT CSI TMT DIGITAL EDITION TMT TV TMT 125TH ANNIVERSARY Business Foreign Business China's youth prefers domestic brands in Double 11 sales fest Read Next UK's Charles 3rd celebrates 75th birthday By Global Times November 15, 2023 30 THE \"Double 11\" shopping festival in China has been held 15 times since 2009 and has evolved from a flash sale event with a few participating brands to a window reflecting China's overall consumption vitality and habits. According to data from major Chinese shopping platforms, domestic brands were highly popular with consumers during the 2023 Double 11 shopping festival. Double 11, also known as Singles' Day, was previously a one-day online shopping festival that fell each year on November 11 in China. Over time, the event has been extended to several weeks. For this year's festival, domestic brands in China have exploded in popularity. According to the data provided by domestic e-commerce platform Tmall, 243 domestic brands achieved sales exceeding 100 million yuan, and over 70,000 domestic brands doubled their first-day sales compared to last year. Data from JD.com, another domestic e-commerce giant, showed that on November 11, domestic smartphone brands such as Xiaomi, Honor, Huawei, OPPO, OnePlus and vivo achieved sales of over 100 million yuan within 1 second. Get the latest news delivered to your inbox Sign up for The Manila Times newsletters By signing up with an email address, I acknowledge that I have read and agree to the Terms of Service and Privacy Policy. According to data from Tmall, both new and established domestic brands have shown strong momentum in various sectors, particularly in the beauty industry. During this year's festival, sales for Herborist increased by 315 percent, for Hua Zhi Xiao by 689 percent and for Kefumei by 1,745 percent. In the home furnishing sector, established domestic brands such as Linsy and Yeswood were the first to achieve sales exceeding 100 million yuan. Data from Pinduoduo showed that promotions boosted sales for domestic beauty and fashion brands such as Bee & Flower, Yu Mei Jing, Shanghai Soap, Kong Feng Chun, Bai Que Ling and Pechoin. Some popular products saw sales growth of over 20 times. In the past few years, domestic brands have gradually gained greater appeal among young people. This trend is expected to continue, with established domestic brands such as Feng Hua, Yu Mei Jing and Lian Hua frequently appearing in trending searches and hitting high sales. According to a survey report released by AlixPartners ahead of the Double 11 festival, 66 percent of consumers planned to increase their consumption of Chinese brands, indicating a growing loyalty toward domestic brands. The popularity of domestic brands and the rise of Generation Z as the main consumer force are closely related, said Wang Xianqing, president of the Guangdong Business Economics Association, according to Zhejiang News. Wang noted that the generation no longer holds excessive admiration and fascination for foreign brands. In addition, domestic products speak for themselves in terms of quality, and are more in line with their consumption habits. \"I believe this trend will become more apparent in the future,\" he said. A 23-year-old female consumer from Beijing told the Global Times that she bought many domestic brands during this year's Double 11 shopping festival. \"I used to prefer foreign brands, but in recent years, I have become more aware of the premium effect of those brands,\" she said. \"Domestic brands are usually priced lower but are still good quality.\" She also hopes to support more domestic brands through her purchases, allowing them to invest more in product development. Another 25-year-old shopper from Hangzhou told the Global Times that she believes domestic brands offer better value for money. After comparing domestic and foreign cosmetics brands, she thought there was not a significant difference in terms of quality. However, she mentioned the \"Li Jiaqi incident,\" which made her realize that domestic brands also invest heavily in marketing. This makes her think about the actual value of the product more before making a purchase, she said. \"Our domestic products now have considerable product quality and cost-effectiveness,\" said Tian Xuan, associate dean and chair professor of finance with the PBC School of Finance at Tsinghua University. He said that although the popularity of domestic brands is related to marketing to some extent, there are other underlying reasons for it. \"Chinese brands that are well established have the foundations for market competition,\" he said. \"It is necessary to seize this opportunity, continuously innovate, grasp new consumer trends, constantly enrich products, and maintain product quality. At the same time, it is important for them to ensure reasonable prices, operate with integrity, strengthen market competitiveness, and achieve long-term development.\" Meanwhile, the overall strong sales momentum of domestic e-commerce platforms shows an optimistic outlook for recovery of consumption in the fourth quarter, Zhang Yi, CEO of iiMedia Research Institute, told the Global Times. TRY THE MANILA TIMES PREMIUM FREE FOR 14 DAYS SUBSCRIBE NOW ALREADY A SUBSCRIBER? LOGIN HERE DOWNLOAD THE DIGITAL EDITION APP News Nation Regions World Sports Entertainment Lifestyle The Sunday Times Opinion Editorial Editorial Cartoon OP-ED Columns From our Readers Legal Advice Business Top Business Corporate News Foreign Business Sunday Business & IT Company Announcements Financial Times Special Sections Special Features Public Square Videos Podcasts Market Overview Weather Exam Results The Manila Times Home Delivery Subscription Subscribe to our Digital Edition The Manila Times College The Manila Times TV The Manila Times Forum The Manila Times Coffee Break The Manila Times Classifieds Twitter Youtube Facebook Instagram DailyMotion Spotify Subscribe Now Copyright © The Manila Times – All Rights Reserved. Advertise Contact Us About Us Privacy Policy This website uses cookies. By continuing to browse the website, you are agreeing to our use of cookies. Read More. Close",
    "originSummary": [
      "Chinese consumers exhibited a strong preference for domestic brands during China's Double 11 shopping festival.",
      "Sales for 243 domestic brands exceeded 100 million yuan, and over 70,000 brands doubled their first-day sales compared to last year.",
      "This trend is driven by the growing appeal of domestic brands among young people, who are finding domestic products to be of good quality and aligned with their consumption habits."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700053715937
  },
  {
    "title": "Chinese E-commerce Platform Temu Faces Scrutiny over Data Protection and Alleged Black Market Activities",
    "originLink": "https://www.ohmymag.co.uk/lifestyle/tech/temu-the-new-affordable-e-commerce-with-potentially-hidden-consequences_art20016.html",
    "originBody": "LifestyleTech Temu: The new affordable e-commerce with potentially hidden consequences Published on November 14, 2023 at 5:28 PM by Noamane Ragane Temu is now one of the most successful online retailers on the planet promising borderline impossibly low prices. However, what is the true cost of these 'affordable products'. © Future Publishing/Getty Images temu data leak Temu is one of the most successful Chinese platforms in the e-commerce space. Its success in Western countries saw exponential growth since its launch in the US in 2022 and Europe in 2023. However, this success has seen increased scrutiny over data protection, specifically aimed at Chinese companies, with TikTok being the prime example. As applications are collecting heaps of data on users and with the pricing of the products sold on Temu one can’t help but imagine that the profit margins can’t be big. So, the question remains, how is this company profitable? Data as a commodity As technology has evolved, the consumer has also become a product. While you purchase products from companies, in the process, they collect data on you which can then be repackaged and sold. In the case of Temu, the Office of the United States Trade Representative thoroughly examined Pinduoduo, a retailer owned by Temu’s parent company. Pinduoduo was removed from Google’s Play Store for containing hidden malware that allowed it to access more data than normal undetected which raises red flags. It was also given its own section in the 'Notorious Markets for Counterfeiting and Piracy' report of 2022. This unwanted attention has led Temu to distance itself from its parent company by moving its headquarters to Boston for US operations and Ireland for the rest of the world. However, some users on social media have reported that their bank details were stolen after purchasing from Temu, some going as far as saying that their data was sold on the black market as they have seen their bank account slowly drained from funds to not be suspicious. Other users have reported similar concerns on Reddit which proves at least that this is not an isolated incident however no proof with regards to Temu's involvement has surfaced. @pheveya Replying to @user899262 I have reason to believe this happened through TEMU , however, this could have happened from any apps i entered my details into. Be safe and use paypal, apple pay etc x ♬ original sound - Pheveya Data as a strategic asset The US government has been making sure that the data of its citizens does not fall into the hands of outside parties that could use it to influence political outcomes or manipulate its citizens in any way similar to what happened with the Facebook–Cambridge Analytica data scandal. Some Chinese apps have been known to hand over their users' data to the government which is used for mass surveillance. Now if the Chinese apps that have seen immense success do the same for Western data, then that could be seen as a new form of strategic advantage for China which could exploit these vulnerabilities in many ways. Read more: ⋙ Millions of android users warned over Google Chrome - check if your phone will be affected ⋙ Google bans shopping app with over 900 million users over security issues, delete it immediately Sources: The Times: What is Temu and is it legit? DW: Is China's Temu a data security threat for shoppers? Politico: Booming Chinese shopping app faces Western scrutiny over data security Apple: New leak reveals production problems with new iPhone 14 just days before launch Read more News, news Asda is trialing a new vegan butcher counter! News, news COVID: New version of Omicron variant has been discovered News, news Omicron: Reinfection 'considerably higher' with new variant News, news New Covid-19 variant Centaurus: Should we be worried? More News, uk WhatsApp users: Beware of costly new scam that will put your money and data at risk Earth & Space, Explore NASA reveals new 'potentially dangerous' asteroid, twice the size of a football field News, technology WhatsApp: 500 million phone numbers leaked according to new report, tech giant denies claims News, news Whipped cream cans banned for those under 21 in New York due to this troubling reason Tech, Lifestyle WhatsApp: This new feature gives you extra privacy when you're online Tech, Lifestyle WhatsApp: This new feature will change the way you keep track of your chats Tech, Lifestyle Google warns millions of Android users to delete these apps today News, news Has a New Coronavirus Symptom Been Identified? News, news E-Cigarettes Could Be Dangerous For Your Health News, news Omicron: Two new symptoms to look out for Read more News, news Omicron: Should we really be so concerned about the new variant? News, news There has been a new outbreak of this deadly infectious disease News, news COVID-19: Here are all the new restrictions in the UK News, news COVID: Has a new variant been detected in France? News, health A new COVID variant has emerged, should we be worried? News, news Aldi Announces Their New Plans For Christmas News, news Potential heatwaves predicted this summer, here's what you need to know News, health There‘s a new Covid-19 vaccine: Here's what we know News, news This is the new shortage that 'no one is talking about' News, news New virus discovered in rodents in Europe, should we be worried?",
    "originSummary": [
      "Temu, a Chinese e-commerce platform, is under scrutiny for its data protection practices and potential involvement in selling user data on the black market.",
      "Pinduoduo, Temu's parent company, has been flagged for hidden malware and listed in reports on counterfeiting and piracy.",
      "Some users have reported stolen bank details after purchasing from Temu, although there is no direct evidence of the company's involvement. The US government is concerned about Chinese apps accessing its citizens' data, which could give China a strategic advantage. Temu has distanced itself by relocating its headquarters."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700053715937
  },
  {
    "title": "Bilibili Doubles Down on E-Commerce Success During Double 11, Leading to Significant Growth",
    "originLink": "http://www.itnewsonline.com/PRNewswire/Bilibili-Cements-Status-as-E-Commerce-Growth-Engine-This-Double-11/957758",
    "originBody": "☰ About Us Partners Bilibili Cements Status as E-Commerce Growth Engine This Double 11 Copyright 2023 PR Newswire. All Rights Reserved 2023-11-15 251% YoY Increase in Gross Merchandise Volume from Video and Live Broadcasting commerce SHANGHAI, Nov. 15, 2023 /PRNewswire/ -- Bilibili Inc. (\"Bilibili\" or the \"Company\"), an iconic brand and a leading video community for young people in China, announced outstanding performance for this year's Double 11 shopping festival in China. The platform's Gross Merchandise Volume (GMV) generated from video and live broadcasting commerce rose 251% compared to the same period last year. Backed by its thriving community engagement, Bilibili saw the amount of video commerce during China's biggest online shopping festival increase 233% year-over-year, and live broadcasting commerce sessions grow 105% year-over-year. An increasing number of brands and merchants are leveraging Bilibili's comprehensive marketing solutions, cementing its status as a significant driver for incremental growth for both e-commerce platforms and brands. Cultivating User Mindshare and Strong Conversion Capabilities This year, the number of users on Bilibili who searched for Double 11-related keywords achieved a 25% year-over-year increase, demonstrating that more users are relying on the platform for their consumption decisions. The fastest-growing searched categories during the period were Pets, Electronics, Household Items, Baby and Maternity Products, as well as Automotive. User interest in commodities on Bilibili ultimately translated into transactions. Starting from last year, Bilibili began to explore video and live broadcasting commerce. Double 11-related video commerce GMV on the platform swelled 376% year-over-year, and live broadcasting commerce GMV grew rapidly at 186%. These reaffirm Bilibili's status as a powerhouse of youth-driven consumer dynamics and emphasize the platform's prowess in combining content and commerce seamlessly. In terms of video commerce, one Chinese home appliance brand achieved ROI of nearly 15 by working with content creators on high-quality reviews. For live broadcasting commerce, top Bilibili content creator @MrMiDeng accumulated a total GMV of RMB 1.68 billion across all channels on Double 11, a 500% year-on-year increase. Deep Collaborations with E-commerce Platforms to Drive Consumption As part of an open and collaborative strategy, Bilibili formed deep strategic partnerships with e-commerce leaders including Taobao & Tmall, JD.com, and Pinduoduo. Leveraging its popularity among young Chinese consumers, Bilibili rolled out integrated marketing campaigns, app updates, and live broadcasting promotions to create a celebratory Double 11 atmosphere, as well as recruit creators to join live broadcasting and video commerce, providing users with more shopping opportunities. In partnership with Tmall, Bilibili launched an integrated marketing campaign to stimulate and attract young consumers on the platform through heart-touching videos. The Bilibili app temporarily rebranded its \"Membership Store\" tab as the \"Double 11 Store\" tab and added a designated \"Tmall Double 11\" subsection on the platform to showcase more products and create more consumption scenarios for its users. Tmall Double 11-related content creation on the platform also rose 133% year-over-year. Bilibili also worked closely with JD.com and Pinduoduo on traffic-sharing programs and consumption insights-sharing initiatives, to encourage Bilibili content creators to direct its users to these platforms and brands, while enhancing efficiency and conversion rates. Bilibili launched the \"Jinghuo Plan\" campaign with JD.com during the pre-sale period, helping merchants better understand consumers' purchase intentions. In addition, the number of influencers collaborating with Pinduoduo on Bilibili increased over 140% compared to last year's Double 11, further boosting traffic and conversion for Pinduoduo. Providing Strong Incremental Value By leveraging its youth community and directing traffic to e-commerce sites, Bilibili provided brand partners access to new shoppers this Double 11. Over 50% of new users brought to brand partners across 8 verticals originated from Bilibili, reaching 89% for mother and baby brands. One Chinese cosmetics brand reached over 20 million target users on Bilibili during the pre-sale period of Double 11, and significantly lowered the brand's customer acquisition cost. Bilibili has been actively exploring diverse monetization avenues to drive commercialization, while upholding its commitment to empowering content creators. Bilibili provides brands with abundant options for quality content collaborations via its Sparkle Platform, which matches brands with creators. Furthermore, Bilibili launched the incubation program Supernova for aspiring e-commerce creators to enhance their live broadcasting commerce capability. Bilibili continues to explore tailored strategies for key verticals including cosmetics, food, appliances, education, automotive, e-commerce, healthcare, and gaming. Among those verticals, e-commerce ads have become a new engine for Bilibili's revenue growth. In Q2 this year, e-commerce ads grew 140% and gaming ads 40% year-on-year. ABOUT BILIBILI INC Bilibili is an iconic brand and a leading video community with a mission to enrich the everyday life of young generations in China. Bilibili offers a wide array of video-based content with All the Videos You Like as its value proposition. Bilibili builds its community around aspiring users, high-quality content, talented content creators, and the intense emotional bond among them. Bilibili pioneered the \"bullet chatting\" feature, a live commenting function that has transformed the viewing experience by displaying the thoughts and feelings of other audiences viewing the same video. It has now become the welcoming home of diverse interests for young generations in China and the frontier to promote Chinese culture worldwide. View original content to download multimedia:https://www.prnewswire.com/news-releases/bilibili-cements-status-as-e-commerce-growth-engine-this-double-11-301988989.html SOURCE BILIBILI Press Releases via PR Newswire Study Finds Autonomous AI Boosts Medical Caregivers' Productivity by 40% in Bangladesh Nabors Announces Offering of $550 Million Senior Priority Guaranteed Notes Introducing Access-a-Seat: The Hot Desk and Parking Booking Software Powered by Accesa Appian Enhances \"One Appian\" Global Partner Program Strategy for 2024 Dotmatics Launches GraphPad Prism 10 with a More Open File Format, Plus New Collaboration and Integration Capabilities Garmin introduces premium quatix 7 Pro marine smartwatch New Research Finds 87% of Medtechs Lack Consistent Methods to Share Product Information Across Global Regulatory Teams Westbrooke completes investment in UK nursery schools buy-and-build platform HSBC Next Client to Go Live on Broadridge's Newly Launched Distributed Ledger Sponsored Repo Solution RapidScale Research Reveals 90 Percent of IT Leaders Rely on Service Provider Assistance for Successful Cloud Migrations more... Press Releases via Business Wire India Ant Group Digital Technologies Presents Products and Solutions for International Markets to Facilitate Digital Transformation and Collaboration Ant International Unveils Web3 Technology-Powered Next-Generation Treasury Solutions ‘Hallucinate' is Cambridge Dictionary's Word of the Year 2023 Ant International Unveils Strategy to Drive Inclusive Global Commerce with Payment and Digitalization Technologies more... Press Releases via Globe Newswire New DISQO Insights: Customer Experience More Effective Than Influencers In Driving Social Shopping HEALWELL AI Reports Q3-2023 Financial Results KVH Crew Wellbeing Solutions Honored with 2023 CAREER4SEA Europort Award Global-e Reports Third Quarter 2023 Results more... Press Releases via RealWire Speedcast Delivers First Live Deployment for OneWeb’s Maritime LEO Service Infinigate Group Appoints Simon England as Chief Growth Officer neXat expands further East with KT SAT partnership Upgraded RADOX® EV-C with high-voltage Flex cable to ease harness preparation and installation for electric vehicles more... Press Releases via PR.com The GENE-RAP6 - A 3.5” Board with 13th Gen Intel Core Processing, 8K Displays, and Iris Xe Graphics Quantum Healing Room Opens in Jenkintown, Bringing the Innovative Energy Enhancement System to the Greater Philadelphia Area Principled Technologies Study Compares Storage-as-a-Service Solutions: Dell APEX Private Cloud with Dell APEX Data Storage Services Block and an Amazon EBS io2 Solution SDA Appoints Greg Arakelian to CTO more... Latest on IT News Online Kaspersky opens its first Transparency Center in the African region Africa Newsroom Black Friday bargains or fraud traps: The risks of tap and go payments Africa Newsroom Alstari Corporation Launched to Focus on AI and Security ACCESSWIRE Molex Reveals Global State of Reliability and Hardware Design Survey Results Media OutReach more...",
    "originSummary": [
      "Bilibili, a prominent video community in China, saw a significant increase in Gross Merchandise Volume (GMV) during the Double 11 shopping festival.",
      "The GMV rose by 251% compared to the previous year, with video commerce increasing by 233% and live broadcasting commerce growing by 105%.",
      "Bilibili's partnerships with e-commerce platforms like Taobao & Tmall, JD.com, and Pinduoduo have contributed to the growth by driving consumption and attracting new users."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700053715937
  }
]
