[
  {
    "id": 41031998,
    "title": "जेलीफिन: हम अच्छे हैं, सच में",
    "originLink": "https://forum.jellyfin.org/t-we-re-good-seriously",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41031998",
    "commentBody": "",
    "originSummary": [
      "जेलीफिन के पास $24,000 से अधिक का बजट है, जो 40 महीनों के खर्चों को कवर करता है, और यह उपयोगकर्ताओं से अनुरोध कर रहा है कि वे अपने द्वारा उपयोग किए जाने वाले क्लाइंट्स के लेखकों को दान पुनर्निर्देशित करें।",
      "यह अनुरोध Jellyfin की \"कोई भुगतान विकास नहीं\" नीति के अनुरूप है, क्योंकि दान स्वैच्छिक हैं, और परियोजना तब पुनर्मूल्यांकन करेगी जब धनराशि 12 महीने की रनवे तक गिर जाएगी।",
      "समुदाय के सदस्य सकारात्मक प्रतिक्रिया दे रहे हैं, क्लाइंट लेखकों का समर्थन करने और WebOS जैसे विशिष्ट क्लाइंट समर्थन के बारे में पूछताछ करने की योजनाओं के साथ।"
    ],
    "commentSummary": [
      "जेलीफिन, एक ओपन-सोर्स मीडिया सर्वर प्रोजेक्ट, ने घोषणा की कि उनके पास पर्याप्त धनराशि है और दाताओं को सुझाव दिया कि वे अन्य पारिस्थितिकी तंत्र परियोजनाओं का समर्थन करें।",
      "समुदाय इस दृष्टिकोण पर विभाजित है; कुछ का मानना है कि धनराशि को पारिस्थितिकी तंत्र के डेवलपर्स को वितरित किया जाना चाहिए, जबकि अन्य जेलीफिन के अतिरिक्त प्रशासनिक बोझ से बचने के निर्णय से सहमत हैं।",
      "चर्चा में ओपन-सोर्स परियोजनाओं के भीतर दान प्रबंधन की जटिलताओं और संभावित मुद्दों पर प्रकाश डाला गया है, जिसमें पारदर्शिता, प्रशासनिक बोझ और मुख्य विकास पर ध्यान केंद्रित बनाए रखना शामिल है।"
    ],
    "points": 511,
    "commentCount": 264,
    "retryCount": 0,
    "time": 1721636767
  },
  {
    "id": 41029287,
    "title": "पिन",
    "originLink": "https://without.boats/blog/pin/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41029287",
    "commentBody": "",
    "originSummary": [
      "पिन प्रकार और पिनिंग की अवधारणा रस्ट के असिंक्रोनस पारिस्थितिकी तंत्र के महत्वपूर्ण लेकिन अक्सर गलत समझे जाने वाले घटक हैं।",
      "Pin को async Rust में आत्म-संदर्भित प्रकारों का समर्थन करने के लिए पेश किया गया था, यह सुनिश्चित करते हुए कि वस्तुएं एक बार आत्म-संदर्भित होने के बाद नहीं हिलतीं, जबकि Mojo स्वाभाविक रूप से वस्तु पहचान को संभालता है।",
      "हालांकि इसकी आवश्यकता है, पिन उपयोगकर्ताओं के लिए महत्वपूर्ण जटिलता पेश करता है क्योंकि इसमें सिंटैक्टिक शुगर और समर्थन की कमी है, जिससे पुनः उधार लेना, पिन की गई प्रोजेक्शंस और ड्रॉप ट्रेट के साथ इंटरैक्शन जैसी समस्याएं उत्पन्न होती हैं।"
    ],
    "commentSummary": [
      "चर्चा का केंद्र बिंदु Rust प्रोग्रामिंग भाषा का `Pin` प्रकार है, जिसे अक्सर अस्पष्ट दस्तावेज़ीकरण के कारण गलत समझा जाता है।",
      "‘पिन’ यह सुनिश्चित करता है कि कुछ ऑब्जेक्ट्स को मेमोरी में नहीं हटाया जा सकता है, जो आत्म-संदर्भित स्ट्रक्चर्स के लिए महत्वपूर्ण है, लेकिन इस अवधारणा को आधिकारिक दस्तावेजों में अच्छी तरह से समझाया नहीं गया है।",
      "यह बातचीत बेहतर दस्तावेज़ीकरण और उपमाओं की आवश्यकता को उजागर करती है ताकि `Pin` और `Unpin` की अवधारणा को रस्ट डेवलपर्स, विशेष रूप से नए डेवलपर्स के लिए अधिक सुलभ बनाया जा सके।"
    ],
    "points": 421,
    "commentCount": 93,
    "retryCount": 0,
    "time": 1721604216
  },
  {
    "id": 41031037,
    "title": "जिफ़: रस्ट के लिए डेटटाइम लाइब्रेरी",
    "originLink": "https://github.com/BurntSushi/jiff",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41031037",
    "commentBody": "",
    "originSummary": [
      "जिफ एक नया रस्ट डेटटाइम लाइब्रेरी है जो उपयोग में आसानी और प्रदर्शन पर केंद्रित है, और यह जावास्क्रिप्ट के टेम्पोरल प्रस्ताव से प्रेरित है।",
      "यह उच्च-स्तरीय दिनांक-समय प्राइमिटिव्स, सहज टाइम ज़ोन डेटाबेस एकीकरण, डीएसटी-संवेदनशील अंकगणित, स्वरूपण, पार्सिंग, और वैकल्पिक सेरडे समर्थन जैसी सुविधाएँ प्रदान करता है।",
      "जिफ MIT या UNLICENSE के तहत द्वैध-लाइसेंस प्राप्त है, Unix और Windows का समर्थन करता है, और Rust 1.70.0 या नए संस्करण की आवश्यकता होती है।"
    ],
    "commentSummary": [
      "जिफ़ एक नई डेटटाइम लाइब्रेरी है जो रस्ट के लिए बनाई गई है, जिसे बर्न्टसुशी द्वारा विकसित किया गया है, जो उच्च-गुणवत्ता वाले उपकरण जैसे रिपग्रेप बनाने के लिए जाने जाते हैं।",
      "पुस्तकालय का उद्देश्य दिनांक और समय प्रबंधन में जटिलताओं को संबोधित करना है, जैसे कि डीएसटी (डेलाइट सेविंग टाइम) अंकगणित, समय क्षेत्र-सचेत गणनाएँ, और पिछली समय क्षेत्र संघर्ष का पता लगाना।",
      "जिफ़ मौजूदा मानक, क्रोनो, की तुलना में अधिक उपयोगकर्ता-मित्रवत और लचीला एपीआई प्रदान करता है, जबकि दिनांक और समय संचालन में शुद्धता और क्षमता बनाए रखता है।"
    ],
    "points": 407,
    "commentCount": 183,
    "retryCount": 0,
    "time": 1721624266
  },
  {
    "id": 41033579,
    "title": "अब और नीले शुक्रवार नहीं",
    "originLink": "https://www.brendangregg.com/blog/2024-07-22/no-more-blue-fridays.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41033579",
    "commentBody": "",
    "originSummary": [
      "19 जुलाई को एक कर्नेल ड्राइवर अपडेट के कारण एक बड़ी रुकावट हुई, जिससे वैश्विक विंडोज सिस्टम क्रैश हो गए, जो सुरक्षित अपडेट तंत्र की आवश्यकता को उजागर करता है।",
      "eBPF (विस्तारित बर्कले पैकेट फ़िल्टर), जो पहले से ही लिनक्स में उपयोग किया जाता है, एक सुरक्षित कर्नेल निष्पादन वातावरण है जो इस तरह के क्रैश को रोक सकता है और जल्द ही विंडोज़ द्वारा समर्थित होगा।",
      "eBPF प्रोग्राम सुरक्षा-जांच और सैंडबॉक्स किए जाते हैं, जो उन्नत सुरक्षा और कम संसाधन उपयोग जैसे लाभ प्रदान करते हैं। इन्हें सुरक्षा और अवलोकन के लिए Cisco, Google, और Meta जैसी कंपनियों द्वारा अपनाया गया है।"
    ],
    "commentSummary": [
      "माइक्रोसॉफ्ट का eBPF (विस्तारित बर्कले पैकेट फ़िल्टर) समर्थन विंडोज के लिए वर्तमान में केवल पैकेट फ़िल्टरिंग तक सीमित है, जबकि क्राउडस्ट्राइक के व्यापक कर्नेल मॉनिटरिंग ड्राइवरों के विपरीत।",
      "Windows के मौजूदा फ्रेमवर्क में eBPF को एकीकृत करना चुनौतीपूर्ण है, और यह अनिश्चित है कि माइक्रोसॉफ्ट इसे एक मानक बनाने का लक्ष्य रखता है या नहीं।",
      "eBPF कर्नेल कोड को अलग करके सुरक्षा को बढ़ा सकता है, लेकिन यह एक पूर्ण समाधान नहीं है, जैसा कि हाल ही में हुए Crowdstrike घटना से स्पष्ट होता है, जो बेहतर तैनाती प्रथाओं और सुरक्षा उपायों की आवश्यकता को रेखांकित करता है।"
    ],
    "points": 310,
    "commentCount": 194,
    "retryCount": 0,
    "time": 1721650866
  },
  {
    "id": 41031585,
    "title": "पार्स करें, सत्यापन न करें (2019)",
    "originLink": "https://lexi-lambda.github.io/blog/2019/11/05/parse-don-t-validate/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41031585",
    "commentBody": "",
    "originSummary": [
      "पोस्ट 'पार्स करें, मान्य न करें' के सिद्धांत पर जोर देती है, जो डेटा को पार्स करने की वकालत करती है ताकि जानकारी को टाइप सिस्टम में संरक्षित किया जा सके बजाय इसे मान्यकरण के माध्यम से त्यागने के।",
      "यह बताता है कि कैसे Haskell जैसी भाषाओं में प्रकार-चालित डिज़ाइन आंशिक कार्यों को कुल कार्यों में बदल सकता है, तर्क प्रकारों को मजबूत करके, `NonEmpty` सूचियों का उदाहरण उपयोग करते हुए।",
      "व्यावहारिक सलाह में सटीक डेटा संरचनाओं का उपयोग करना, प्रूफ बोझ को ऊपर की ओर धकेलने के लिए पुनर्गठन करना, और प्रोग्राम की विश्वसनीयता और सुरक्षा में सुधार के लिए डीनॉर्मलाइज्ड डेटा प्रतिनिधित्व से बचना शामिल है।"
    ],
    "commentSummary": [
      "लेख 'पार्स करें, मान्य न करें' डेटा की शुद्धता सुनिश्चित करने के लिए इसे बार-बार मान्य करने के बजाय पार्स करने के महत्व पर जोर देता है।",
      "यह दृष्टिकोण, जो अनुबंध द्वारा डिज़ाइन और डोमेन-ड्रिवन डिज़ाइन (DDD) जैसे अवधारणाओं में निहित है, मजबूत प्रकार प्रणालियों का उपयोग करके गारंटियों को लागू करता है और त्रुटियों को कम करता है, जिससे कोड को समझना और बनाए रखना आसान हो जाता है।",
      "चर्चा में व्यावहारिक उदाहरणों और लाभों पर प्रकाश डाला गया है, जैसे कि विभिन्न सत्यापन चरणों के लिए अलग-अलग प्रकारों का उपयोग करना और यह सुनिश्चित करना कि डेटा हमेशा एक वैध स्थिति में हो, जो जटिल अनुप्रयोगों को सरल बना सकता है और विश्वसनीयता में सुधार कर सकता है।"
    ],
    "points": 296,
    "commentCount": 99,
    "retryCount": 0,
    "time": 1721631439
  },
  {
    "id": 41027658,
    "title": "जब ChatGPT सारांश बनाता है, तो यह ऐसा कुछ भी नहीं करता है।",
    "originLink": "https://ea.rna.nl/2024/05/27/when-chatgpt-summarises-it-actually-does-nothing-of-the-kind/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41027658",
    "commentBody": "",
    "originSummary": [
      "लेखक ने ChatGPT और अन्य जनरेटिव एआई की नींव का अन्वेषण और चर्चा की है, जिसका उद्देश्य प्रचलित प्रचार के खिलाफ यथार्थवादी दृष्टिकोण प्रदान करना है।",
      "एक महत्वपूर्ण समझ यह है कि ChatGPT वास्तव में सामग्री का सारांश नहीं बनाता बल्कि केवल इसे संक्षिप्त करता है, अक्सर आवश्यक विवरण और प्रस्तावों को छोड़ देता है, जैसा कि 50-पृष्ठ के पेपर के मानव-निर्मित सारांश की तुलना से स्पष्ट होता है।",
      "यह सीमा इसलिए उत्पन्न होती है क्योंकि सारांश बनाने के लिए समझ की आवश्यकता होती है, जो ChatGPT में नहीं है, जिससे व्यावहारिक व्यावसायिक अनुप्रयोगों के लिए LLMs (बड़े भाषा मॉडल) की विश्वसनीयता के बारे में संदेह उत्पन्न होता है।"
    ],
    "commentSummary": [
      "लेखक का तर्क है कि ChatGPT का पाठ संक्षेपण सच्ची समझ का अभाव रखता है, जिसके परिणामस्वरूप अधूरे और कभी-कभी भ्रामक संक्षेपण होते हैं।",
      "आलोचना इस बात की ओर इशारा करती है कि मूल विश्लेषण में GPT मॉडल, प्रॉम्प्ट और प्रयासों की संख्या के बारे में विवरण अनुपस्थित हैं।",
      "उपयोगकर्ता अनुभव और राय भिन्न-भिन्न होते हैं, कुछ लोग ChatGPT और अन्य LLMs को सहायक पाते हैं, जबकि अन्य उनकी सीमाओं और बेहतर प्रॉम्प्टिंग और संदर्भ प्रबंधन की आवश्यकता को उजागर करते हैं।"
    ],
    "points": 243,
    "commentCount": 167,
    "retryCount": 0,
    "time": 1721591800
  },
  {
    "id": 41031960,
    "title": "रायनएयर ने यूएस कोर्ट के फैसले में बुकिंग.कॉम के खिलाफ स्क्रीन स्क्रैपिंग मामले में जीत हासिल की",
    "originLink": "https://www.rte.ie/news/business/2024/0719/1460807-ryanair-wins-us-court-case-against-bookingcom/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41031960",
    "commentBody": "",
    "originSummary": [
      "एक अमेरिकी अदालत ने फैसला सुनाया कि बुकिंग.कॉम ने रयानएयर की वेबसाइट को बिना अनुमति के एक्सेस करके कंप्यूटर धोखाधड़ी और दुरुपयोग अधिनियम का उल्लंघन किया, जिससे रयानएयर के अनधिकृत स्क्रीन स्क्रैपिंग के खिलाफ रुख को समर्थन मिला।",
      "डेलावेयर जिला न्यायालय की जूरी ने बुकिंग.कॉम को धोखाधड़ी के इरादे से अनधिकृत पहुंच के लिए दोषी पाया और बुकिंग.कॉम के मानहानि और अनुचित प्रतिस्पर्धा के प्रतिदावों को खारिज कर दिया।",
      "रायनएयर के सीईओ माइकल ओ'लेरी को उम्मीद है कि यह निर्णय अवैध स्क्रीन स्क्रैपिंग और अधिक शुल्क वसूलने को कम करेगा, जबकि बुकिंग.कॉम अपील करने की योजना बना रहा है, यह तर्क देते हुए कि किराया तुलना उपभोक्ता विकल्प को लाभ पहुंचाती है।"
    ],
    "commentSummary": [
      "रायनएयर ने एक अमेरिकी अदालत में बुकिंग.कॉम के खिलाफ अवैध रूप से टिकटों को पुनर्विक्रय करने के लिए अनधिकृत पहुंच के मामले में कानूनी जीत हासिल की, जो कंप्यूटर धोखाधड़ी और दुरुपयोग अधिनियम का उल्लंघन था।",
      "यह निर्णय अन्य ऑनलाइन यात्रा एजेंटों को प्रभावित कर सकता है जो समान प्रथाओं का उपयोग कर रहे हैं, जिससे वेब स्क्रैपिंग कानूनों की जटिलताओं को उजागर किया जा सकता है।",
      "ऐसी अटकलें हैं कि परस्पर विरोधी कानूनी मिसालों के कारण निर्णय को पलटा जा सकता है।"
    ],
    "points": 210,
    "commentCount": 195,
    "retryCount": 0,
    "time": 1721636405
  },
  {
    "id": 41032918,
    "title": "कोई भी युवा पुरुषों से कुछ करने की उम्मीद नहीं करता और वे कुछ नहीं करके इसका जवाब देते हैं (2022)",
    "originLink": "https://www.robkhenderson.com/p/no-one-expects-young-men-to-do-anything",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41032918",
    "commentBody": "",
    "originSummary": [
      "रॉब हेंडरसन की पोस्ट युवा पुरुषों के लिए सामाजिक अपेक्षाओं की कमी और इसके नकारात्मक परिणामों, जैसे बढ़ती बेरोजगारी और कारावास दरों पर चर्चा करती है।",
      "वह कैथरीन एडिन और मारिया केफालस द्वारा लिखित 'प्रॉमिसेज आई कैन कीप' का उल्लेख करते हैं, जो यह जांच करता है कि कम आय वाली महिलाएं अक्सर मातृत्व को विवाह से अधिक प्राथमिकता क्यों देती हैं, इसे युवा पुरुषों के खराब व्यवहार के कारण मानते हुए।",
      "Henderson उच्च वर्ग की आलोचना करते हैं कि वे परिवार की स्थिरता के मानदंडों को कमजोर कर रहे हैं जबकि अपने बच्चों को स्थिर घरों का लाभ सुनिश्चित कर रहे हैं, यह तर्क देते हुए कि युवा पुरुषों को फलने-फूलने के लिए उच्च अपेक्षाओं की आवश्यकता होती है।"
    ],
    "commentSummary": [
      "लेख 'कुछ न करने वाले युवा पुरुषों' की घटना को धन असमानता और पुराने अभिजात वर्ग के बीच धन की सांद्रता से जोड़ता है, जो आवश्यकताओं की कीमतें बढ़ाता है और नए उपक्रमों की मांग को दबा देता है।",
      "यह पारिवारिक संरचनाओं की अस्थिरता पर भी चर्चा करता है, यह देखते हुए कि सामाजिक परिवर्तन और आर्थिक दबावों ने पारंपरिक पारिवारिक गतिशीलता को बदल दिया है।",
      "लेख पर टिप्पणियाँ अनुपस्थित पिताओं के प्रभाव, परिवार की स्थिरता में महिलाओं की भूमिका, और इन मुद्दों में योगदान देने वाले व्यापक सामाजिक और आर्थिक कारकों पर बहस करती हैं।"
    ],
    "points": 201,
    "commentCount": 397,
    "retryCount": 0,
    "time": 1721645031
  },
  {
    "id": 41028887,
    "title": "जेम्स सी. स्कॉट, 'सीइंग लाइक ए स्टेट' के लेखक, का निधन हो गया है",
    "originLink": "https://nitter.poast.org/GerardoMunck/status/1815059432382067053",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41028887",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "जेम्स सी. स्कॉट, 'सीइंग लाइक ए स्टेट' के लेखक, का निधन हो गया है, जिससे तकनीकी समुदाय में उनके प्रभावशाली विचारों पर चिंतन शुरू हो गया है।",
      "स्कॉट का कार्य यह उजागर करता है कि राज्य और प्रौद्योगिकी कैसे एकरूपता को लागू कर सकते हैं, जिससे चिकित्सा, शिक्षा और सामाजिक सहभागिता जैसे क्षेत्रों में विविधता कम हो जाती है।",
      "हैकर न्यूज़ पर चर्चाएँ स्कॉट की अवधारणाओं का अन्वेषण करती हैं, विशेष रूप से सॉफ़्टवेयर में सुरक्षा और लचीलेपन के बीच संतुलन और तकनीकी समानता के व्यापक प्रभावों पर।"
    ],
    "points": 197,
    "commentCount": 39,
    "retryCount": 0,
    "time": 1721601209
  },
  {
    "id": 41031112,
    "title": "Eza: ls के लिए एक आधुनिक, सुव्यवस्थित प्रतिस्थापन",
    "originLink": "https://github.com/eza-community/eza",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41031112",
    "commentBody": "",
    "originSummary": [
      "eza यूनिक्स और लिनक्स में ls कमांड के लिए एक आधुनिक विकल्प है, जो उन्नत सुविधाएँ और बेहतर डिफ़ॉल्ट सेटिंग्स प्रदान करता है।",
      "मुख्य विशेषताओं में रंग-कोडित फ़ाइल प्रकार, सिमलिंक समर्थन, विस्तारित विशेषताएँ, गिट एकीकरण, और मानव-पठनीय तिथियाँ शामिल हैं।",
      "ईज़ा का उद्देश्य अधिक उपयोगकर्ता-मित्रवत और विशेषता-समृद्ध होना है, जिसमें हाइपरलिंकिंग, माउंट पॉइंट विवरण, SELinux संदर्भ, और चमकीले टर्मिनल रंगों के लिए अतिरिक्त समर्थन शामिल है।"
    ],
    "commentSummary": [
      "Eza को एक आधुनिक और सक्रिय रूप से बनाए रखा जाने वाला पारंपरिक `ls` कमांड का प्रतिस्थापन के रूप में प्रस्तुत किया गया है, जो Unix-जैसे ऑपरेटिंग सिस्टम में निर्देशिका की सामग्री को सूचीबद्ध करता है।",
      "चर्चा में निर्देशिका सूची में 'मानव-पठनीय तिथियों' के साथ उपयोगकर्ता की निराशाओं को उजागर किया गया है, और '1 दिन पहले' जैसे सापेक्ष समय प्रारूपों के बजाय सटीक समय मुहरों की वकालत की गई है।",
      "पोस्ट में अन्य आधुनिक कमांड-लाइन टूल्स का भी उल्लेख किया गया है जिन्हें उपयोगकर्ता पारंपरिक टूल्स की तुलना में अधिक पसंद करते हैं, जैसे `bat` (एक `cat` का प्रतिस्थापन जिसमें सिंटैक्स हाइलाइटिंग होती है) और `rg` (ripgrep, जो `grep` का एक तेज़ विकल्प है)।"
    ],
    "points": 194,
    "commentCount": 162,
    "retryCount": 0,
    "time": 1721625443
  },
  {
    "id": 41036844,
    "title": "हम पारदर्शी रूप से मूर्खतापूर्ण स्टार्टअप्स के लिए कितनी धनराशि जुटा सकते हैं?",
    "originLink": "https://www.smbc-comics.com/comic/investment-2",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41036844",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "यह पोस्ट उन स्टार्टअप्स के लिए धन जुटाने की प्रक्रिया पर चर्चा करती है जिनके विचार देखने में बेतुके लगते हैं, और यह बताती है कि ऐसे उपक्रमों के लिए पूंजी प्राप्त करना कितना आसान हो सकता है।",
      "यह स्टार्टअप इकोसिस्टम की आलोचना करता है, यह सुझाव देते हुए कि यह एक 'पंप और डंप' योजना की तरह काम करता है, जो एक ट्रेंडी क्षेत्र से दूसरे में स्थानांतरित होता रहता है, अक्सर संसाधनों की बर्बादी करता है।",
      "बातचीत में सफल स्टार्टअप्स के उदाहरण शामिल हैं और उत्पाद विकास में फोकस समूहों और एमवीपी (न्यूनतम व्यवहार्य उत्पाद) के मूल्य और प्रभाव पर बहस की जाती है।"
    ],
    "points": 171,
    "commentCount": 86,
    "retryCount": 0,
    "time": 1721668554
  },
  {
    "id": 41031975,
    "title": "एक स्रोत-उपलब्ध बिलिंग प्रणाली जिसे बनाने में मैंने 18 महीने लगाए हैं",
    "originLink": "https://billabear.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41031975",
    "commentBody": "",
    "originSummary": [
      "यह प्लेटफ़ॉर्म स्ट्राइप के साथ गहरी एकीकरण प्रदान करता है, जिससे बिलिंग, कर प्रबंधन, और स्वचालित वर्कफ़्लो पर व्यापक नियंत्रण संभव होता है।",
      "विशेषताओं में विभिन्न स्तरों पर कर दरों का प्रबंधन, कस्टम सदस्यता योजनाएँ बनाना, और स्लैक और ईमेल प्रदाताओं जैसे उपकरणों के साथ एकीकरण शामिल हैं।",
      "सिस्टम स्केलेबिलिटी, स्व-होस्टिंग का समर्थन करता है और सब्सक्रिप्शन चर्न और जीवनकाल मूल्य जैसी विस्तृत व्यावसायिक अंतर्दृष्टि प्रदान करता है।"
    ],
    "commentSummary": [
      "18 महीनों के विकास के बाद, एक नया स्रोत-उपलब्ध बिलिंग सिस्टम, बिलाबियर, लॉन्च किया गया है, जो स्ट्राइप के समान सुविधाएँ प्रदान करता है लेकिन स्रोत कोड फेयर सोर्स लाइसेंस (FSL) के तहत उपलब्ध है।",
      "FSL उपयोगकर्ताओं को स्रोत कोड तक पहुंचने की अनुमति देता है, जो दो साल बाद Apache 2.0 लाइसेंस में परिवर्तित हो जाता है, जिससे Stripe के बंद-स्रोत मॉडल की तुलना में अधिक लचीलापन और नियंत्रण मिलता है।",
      "चर्चाओं में कुछ उपयोगकर्ताओं के लिए स्रोत उपलब्धता के महत्व, विभिन्न भाषाओं में बेहतर स्थानीयकरण की आवश्यकता, और अमेरिकी राज्य बिक्री कर और जीडीपीआर अनुपालन को संभालने के बारे में चिंताओं को उजागर किया गया है।"
    ],
    "points": 167,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1721636536
  },
  {
    "id": 41037097,
    "title": "कर्मचारियों ने अपनी बात कह दी है: वे घर पर ही रह रहे हैं",
    "originLink": "https://www.computerworld.com/article/2520794/the-workers-have-spoken-theyre-staying-home.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41037097",
    "commentBody": "",
    "originSummary": [
      "डेल की पदोन्नति के लिए कार्यालय में उपस्थिति की आवश्यकता वाली नीति को बड़े पैमाने पर नजरअंदाज किया गया, कई कर्मचारी घर पर रहने का विकल्प चुन रहे थे।",
      "एक गार्टनर रिपोर्ट के अनुसार, 48% कर्मचारी मानते हैं कि कंपनी के आदेश नेताओं की प्राथमिकताओं को उनके स्वयं के आवश्यकताओं पर प्राथमिकता देते हैं।",
      "दूरस्थ कार्य इसके लाभों के कारण तेजी से पसंद किया जा रहा है, जिसमें यात्रा की आवश्यकता नहीं, बेहतर कार्य-जीवन संतुलन, लागत बचत, और लचीलापन शामिल हैं, और उच्च प्रदर्शन करने वाले लोग दूरस्थ अवसरों की तलाश कर रहे हैं।"
    ],
    "commentSummary": [
      "कर्मचारी खराब वातावरण, स्थायी डेस्क की कमी, और खुले योजना सेटअप में उत्पादकता के मुद्दों के कारण कार्यालयों में वापस लौटने से हिचकिचा रहे हैं।",
      "कई कर्मचारी दूरस्थ कार्य को अधिक कुशल पाते हैं और कम प्रभावी कार्यालय स्थितियों में लौटने का विरोध करते हैं, जिसमें आवागमन एक महत्वपूर्ण कारक है।",
      "कुछ कंपनियाँ कर्मचारियों की संख्या को कम करने के लिए कार्यालय में वापसी के आदेशों का उपयोग कर रही हैं, बिना छंटनी का सहारा लिए, जिससे आदर्श कार्य व्यवस्थाओं पर चल रही बहस को और बल मिल रहा है।"
    ],
    "points": 158,
    "commentCount": 145,
    "retryCount": 0,
    "time": 1721669795
  },
  {
    "id": 41029987,
    "title": "अपोलो DN10000: क्वाड सीपीयू/128एमबी रैम वर्कस्टेशन 1988 से [पीडीएफ]",
    "originLink": "https://jim.rees.org/apollo-archive/marketing/1988-ApolloDN10000ProductBrochure.pdf",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41029987",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "1988 में 128MB RAM के साथ चार CPU वाला वर्कस्टेशन, अपोलो DN10000, अपनी ऐतिहासिक महत्वता और तकनीकी क्षमताओं के लिए नॉस्टैल्जिक रूप से चर्चा में है।",
      "उपयोगकर्ता इसे विश्वविद्यालय प्रयोगशालाओं में इसके उपयोग और प्रारंभिक ग्राफिक्स प्रोग्रामिंग में इसकी भूमिका के लिए याद करते हैं, इसके जटिल यूनिक्स वातावरण और विन्यास चुनौतियों के बावजूद।",
      "1980 के दशक में मशीन की उच्च लागत, जो $250,000 तक थी (आज के लगभग $660,000 के बराबर), इसकी प्रीमियम स्थिति और तब से अब तक के महत्वपूर्ण तकनीकी प्रगति को दर्शाती है।"
    ],
    "points": 156,
    "commentCount": 122,
    "retryCount": 0,
    "time": 1721610732
  },
  {
    "id": 41030352,
    "title": "क्राउडस्ट्राइक का फाल्कन सेंसर भी लिनक्स कर्नेल पैनिक्स और क्रैश से जुड़ा हुआ है",
    "originLink": "https://www.theregister.com/2024/07/21/crowdstrike_linux_crashes_restoration_tools/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41030352",
    "commentBody": "",
    "originSummary": [
      "CrowdStrike के फाल्कन सेंसर सॉफ़्टवेयर ने विंडोज़ और लिनक्स दोनों पर सिस्टम क्रैश का कारण बना है, जिसमें रेड हैट एंटरप्राइज लिनक्स 9.4, डेबियन, और रॉकी लिनक्स शामिल हैं।",
      "फाल्कन सेंसर को अस्थायी रूप से अक्षम करने से प्रभावित सिस्टम स्थिर हो जाते हैं, और क्राउडस्ट्राइक इस समस्या को हल करने के लिए एक त्वरित पुनर्प्राप्ति उपकरण का परीक्षण कर रहा है।",
      "इस व्यवधान का वैश्विक स्तर पर महत्वपूर्ण प्रभाव पड़ा है, जिसमें उड़ान रद्दीकरण और स्वास्थ्य सेवा में देरी शामिल हैं, और माइक्रोसॉफ्ट का अनुमान है कि 8.5 मिलियन विंडोज मशीनें प्रभावित हुई हैं।"
    ],
    "commentSummary": [
      "क्राउडस्ट्राइक के फाल्कन सेंसर को लिनक्स कर्नेल पैनिक्स और क्रैश के साथ जोड़ा गया है, जो विंडोज बीएसओडी (ब्लू स्क्रीन ऑफ डेथ) समस्याओं से अलग हैं।",
      "लिनक्स कर्नेल पैनिक्स संभवतः कर्नेल के eBPF (एक्सटेंडेड बर्कले पैकेट फिल्टर) इम्प्लीमेंटेशन में एक बग के कारण हो रहे हैं, जो संभवतः रेड हैट-विशिष्ट पैच से उत्पन्न हो सकता है, यह एक कर्नेल बग को इंगित करता है न कि विक्रेता समस्या को।",
      "चर्चा में कई ऑपरेटिंग सिस्टम संस्करणों का समर्थन करने की चुनौतियों और कर्नेल मॉड्यूल परीक्षण में शामिल जटिलताओं को उजागर किया गया है, जिसमें लिनक्स और विंडोज के बीच कर्नेल विश्वसनीयता इंजीनियरिंग में अंतर पर जोर दिया गया है।"
    ],
    "points": 154,
    "commentCount": 141,
    "retryCount": 0,
    "time": 1721614932
  }
]
