[
  {
    "id": 38166420,
    "title": "تكشف OpenAI النقاب عن GPT-4 Turbo ، وواجهة برمجة تطبيقات المساعدين الجديدة ، والقدرات متعددة الوسائط ، وتحديثات لنماذج فك ترميز الهمس والاتساق",
    "originLink": "https://openai.com/blog/new-models-and-developer-products-announced-at-devday",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38166420",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "كشفت OpenAI عن تحديثات متعددة مثل الأسعار المخفضة ، وإدخال GPT-4 Turbo الذي يعد بتحسين كفاءة التكلفة والأداء ، وواجهة برمجة تطبيقات Assistants جديدة لتبسيط بناء التطبيقات الذكاء الاصطناعي.",
      "تشمل العروض الإضافية قدرات متعددة الوسائط للرؤية وإنشاء الصور وتحويل النص إلى كلام. أطلقت OpenAI أيضا DALL · E 3 لإنشاء الصور من التطبيقات وواجهة برمجة تطبيقات تحويل النص إلى كلام وبرنامج النماذج المخصصة.",
      "تم تطوير \"درع حقوق الطبع والنشر\" لحماية المستخدمين من مطالبات حقوق النشر. كما تم إجراء تعديلات على نماذج وحدة فك ترميز الهمس والاتساق."
    ],
    "points": 995,
    "commentCount": 477,
    "retryCount": 0,
    "time": 1699294678
  },
  {
    "id": 38166431,
    "title": "تقدم OpenAI روبوتات محادثة قابلة للتخصيص \"GPTs\" لتخصيص تجارب الذكاء الاصطناعي",
    "originLink": "https://openai.com/blog/introducing-gpts",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38166431",
    "commentBody": "",
    "originSummary": [
      "أطلقت OpenAI إصدارات مخصصة من أداة الذكاء الاصطناعي ChatGPT ، التي يطلق عليها GPTs ، والتي تتيح للمستخدمين تخصيص الذكاء الاصطناعي وفقا لاحتياجاتهم الخاصة دون الحاجة إلى خبرة في الترميز.",
      "تتضمن الوظيفة البحث على الويب وتحليل البيانات وإنشاء الصور ، وهي متاحة للتطبيقات الشخصية أو تطبيقات الشركات ، مع خطط لتوسيع نطاق الوصول لمزيد من المستخدمين قريبا.",
      "تخطط OpenAI لفتح متجر GPT يعرض إبداعات بناة معتمدين ويعزز التزامه بخصوصية بيانات المستخدم ، واعدا بعدم مشاركة التفاعلات مع البناة."
    ],
    "commentSummary": [
      "أعلنت OpenAI عن تقديم إصدارات قابلة للتخصيص من ChatGPT تعرف باسم GPTs ، والتي تسمح للمستخدمين بتكييف الأداة الذكاء الاصطناعي مع احتياجات محددة دون مهارات برمجة متقدمة.",
      "تم تصميم GPTs للتطبيقات الفردية أو تطبيقات الشركة ويمكن تخصيصها لمهام مختلفة ، مثل البحث على الويب وتحليل البيانات وإنشاء الصور.",
      "تخطط OpenAI لإطلاق متجر GPT ، الذي يضم إبداعات من بناة معتمدين ، وقد نفذت تدابير خصوصية قوية ، مما يضمن التحكم في بيانات المستخدم وسرية التفاعلات مع GPTs."
    ],
    "points": 509,
    "commentCount": 284,
    "retryCount": 0,
    "time": 1699294724
  },
  {
    "id": 38169504,
    "title": "أبلغ الحاضرون في ApeFest عن ألم في العين وفقدان البصر بسبب أداء الليزر",
    "originLink": "https://www.404media.co/bored-ape-yacht-club-conference-eye-pain-vision-loss-yuga-labs/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38169504",
    "commentBody": "",
    "originSummary": [
      "أدى ApeFest ، وهو مؤتمر في هونغ كونغ لأصحاب Bored Ape NFTs ، إلى إبلاغ الحاضرين عن ألم شديد في العين وفقدان البصر وحروق جلدية بسبب التعرض لليزر والعروض الثقيلة للضوء الأسود.",
      "اضطر بعض رواد المؤتمر إلى طلب العلاج في المستشفى بسبب الإصابات التي لحقت بهم في هذا الحدث.",
      "استضافت هذا الحدث Yuga Labs ، الشركة الأم لنادي Bored Ape Yacht Club ، وهو مشروع تشفير NFT شهد مؤخرا انخفاضا كبيرا إلى أدنى مستوى له منذ عامين."
    ],
    "commentSummary": [
      "أبلغ الحاضرون في ApeFest ، وهو مؤتمر لأصحاب Bored Ape NFT (الرمز غير القابل للاستبدال) في هونغ كونغ ، عن آثار صحية ضارة مثل آلام العين الشديدة وفقدان البصر وحروق الجلد بسبب التعرض من الليزر والعروض الثقيلة للضوء الأسود.",
      "وقد سعى المشاركون المصابون إلى الحصول على العلاج في المستشفى من إصاباتهم.",
      "قامت Yuga Labs ، الشركة الأم ل Bored Ape Yacht Club ، وهو مشروع عملة NFT المشفرة الذي شهد مؤخرا انخفاضا كبيرا ، بتنظيم الحدث."
    ],
    "points": 500,
    "commentCount": 360,
    "retryCount": 0,
    "time": 1699307326
  },
  {
    "id": 38162435,
    "title": "فهم أهمية التلاعب DOM مع الفانيليا جافا سكريبت لمطوري الويب",
    "originLink": "https://phuoc.ng/collection/html-dom/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38162435",
    "commentBody": "",
    "originSummary": [
      "يسلط المؤلف الضوء على ضرورة أن يتقن مطورو الويب معالجة نموذج كائن المستند (DOM) باستخدام JavaScript العادي ، على الرغم من توفر الأدوات الحديثة مثل Angular و VueJS و React و Solid و Svelte التي تبسط إدارة DOM المباشرة.",
      "تقوم الأدوات الحديثة بتغليف تفاعلات DOM المباشرة وتجريدها ، ولكن لا يزال يتعين على مطوري الويب التفاعل مع DOM على مستوى ما.",
      "لمساعدة المطورين في إتقان معالجة DOM ، يوفر المؤلف موارد مثل الأمثلة البسيطة والعروض التوضيحية الحية والنصائح وأفضل الممارسات."
    ],
    "commentSummary": [
      "يؤكد المؤلف على ضرورة أن يكتسب مطورو الويب الكفاءة في معالجة نموذج كائن المستند (DOM) باستخدام جافا سكريبت الفانيليا ، حتى في عصر الأدوات الحديثة مثل Angular و VueJS و React و Solid و Svelte.",
      "على الرغم من أن هذه الأدوات تلتف وتستخلص الكثير من إدارة DOM المباشرة ، فقد تمت الإشارة إلى أنه لا يزال هناك مستوى معين من التفاعل مع DOM في تطوير الويب.",
      "يقدم المؤلف موارد مثل الأمثلة البسيطة والعروض الحية والنصائح وأفضل الممارسات لمساعدة المطورين في إتقان فن التلاعب بالعقارات."
    ],
    "points": 392,
    "commentCount": 127,
    "retryCount": 0,
    "time": 1699278090
  },
  {
    "id": 38161452,
    "title": "تقديم سلم: بديل مفتوح المصدر قابل للتخصيص في Golang لخدمات 12ft.io و 1ft.io",
    "originLink": "https://github.com/kubero-dev/ladder",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38161452",
    "commentBody": "",
    "originSummary": [
      "طور المتحدث بديلا مفتوح المصدر لخدمات محددة بسبب الشكوك حول فعاليتها وعملياتها.",
      "النظام الجديد مكتوب بلغة Golang ، وهي لغة برمجة مكتوبة بشكل ثابت ومجمعة مصممة في Google.",
      "من خلال تسليط الضوء على تعدد استخدامات النظام الجديد وقدرته على التكيف ، فهو قابل للتخصيص بالكامل لسيناريوهات الاستخدام المختلفة."
    ],
    "commentSummary": [
      "طور المتحدث حلا مفتوح المصدر كبديل لخدمات محددة بسبب عدم الثقة في عملياتها.",
      "يوفر النظام المصمم حديثا ، الذي تم إنشاؤه باستخدام Golang ، تخصيصا كاملا."
    ],
    "points": 346,
    "commentCount": 134,
    "retryCount": 0,
    "time": 1699272284
  },
  {
    "id": 38161016,
    "title": "Prossimo تطلق نسخة مستقرة من Sudo-RS ، وهي أداة Linux محسنة أمنيا تم تطويرها في Rust",
    "originLink": "https://www.memorysafety.org/blog/sudo-first-stable-release/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38161016",
    "commentBody": "",
    "originSummary": [
      "أصدرت Prossimo أول إصدار مستقر من sudo-rs ، وهو تجديد محسن للأمان لأداة sudo في Linux ، مشفرة في Rust ، وهي لغة آمنة للذاكرة تساعد على الحد من التهديدات الأمنية المحتملة.",
      "يستفيد المشروع ، الذي تم دمجه بالفعل في نظام التشغيل Wolfi Linux OS ، من مجموعة ميزات مخفضة ومجموعة اختبار شاملة ، والتي تهدف إلى تعزيز الأمان. ومن المقرر أن تخضع لتدقيق أمني خارجي في سبتمبر 2023.",
      "تم إنجاز المشروع من خلال التعاون مع Tweede Golf و Ferrous Systems ، مع مدخلات استشارية من مبتكر الأداة المساعدة sudo الأصلي Todd C. Miller. تم توفير الدعم المالي من قبل مؤسسة NLnet و Amazon Web Services وغيرها."
    ],
    "commentSummary": [
      "أعلنت Prossimo عن أول إصدار مستقر من sudo-rs ، وهو إصدار أكثر أمانا من أداة Linux sudo المستخدمة على نطاق واسع ، والتي تم تطويرها باستخدام لغة البرمجة الآمنة للذاكرة Rust.",
      "ويسعى المشروع، الذي أدرج بالفعل في نظام التشغيل Wolfi Linux، إلى مواجهة التهديدات الأمنية المحتملة من خلال استخدام لغات آمنة للذاكرة؛ ساهم مطورو Twoede Golf و Ferrous Systems بشكل كبير.",
      "من المقرر إجراء تدقيق أمني خارجي في سبتمبر 2023 ، وتلقى المشروع تمويلا من مصادر مختلفة بما في ذلك مؤسسة NLnet و Amazon Web Services. قدم مبتكر الأداة المساعدة الأصلي للسودو ، تود سي ميلر ، إرشادات مهمة أثناء تطوير sudo-rs."
    ],
    "points": 335,
    "commentCount": 235,
    "retryCount": 0,
    "time": 1699268304
  },
  {
    "id": 38160703,
    "title": "يعزز FFmpeg قدرات تحويل ترميز الفيديو من خلال إدخال خطوط أنابيب متعددة مؤشرات الترابط",
    "originLink": "https://twitter.com/FFmpeg/status/1721275669336707152",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38160703",
    "commentBody": "",
    "originSummary": [
      "تم تعيين FFmpeg ، وهو محول فيديو قوي للغاية على مستوى العالم ، لتعزيز قدراته من خلال إدخال خطوط أنابيب تحويل الشفرة متعددة مؤشرات الترابط.",
      "تم الكشف عن هذا التقدم كجزء من مجموعة تصحيح جديدة.",
      "ستمكن خطوط أنابيب تحويل الشفرة متعددة مؤشرات الترابط من معالجة المهام المتزامنة ، مما يحسن كفاءة وسرعة محول الشفرة."
    ],
    "commentSummary": [
      "من المقرر أن يصبح FFmpeg ، الذي يوصف بأنه أقوى محول ترميز فيديو في العالم ، أكثر فاعلية مع تحديث يقدم خطوط أنابيب تحويل الترميز متعددة مؤشرات الترابط.",
      "تم توضيح هذا التحسين في مجموعة تصحيحات تم إصدارها مؤخرا.",
      "تتضمن خطوط أنابيب تحويل الشفرة متعددة مؤشرات الترابط القدرة على معالجة أجزاء مختلفة من المهمة في وقت واحد ، مما قد يؤدي إلى تحسين سرعة وكفاءة تحويل ترميز الفيديو."
    ],
    "points": 323,
    "commentCount": 82,
    "retryCount": 0,
    "time": 1699265554
  },
  {
    "id": 38167363,
    "title": "يقوم المطور بإنشاء ميزة الإكمال التلقائي الطرفي لنظامي التشغيل Windows و Linux: يسعى للحصول على تعليقات المستخدمين",
    "originLink": "https://github.com/microsoft/inshellisense",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38167363",
    "commentBody": "",
    "originSummary": [
      "أنشأ المطور وقت تشغيل أصلي لميزة الإكمال التلقائي في Fig والتي تتوافق الآن مع كل من أنظمة Windows و Linux.",
      "يسعى المنشئ بنشاط للحصول على تعليقات لتقييم وتحسين أداء النظام وفعاليته."
    ],
    "commentSummary": [
      "طور أحد المطورين وقت تشغيل أصلي لمحطة طرفية لميزة الإكمال التلقائي في Fig ، والتي تتوافق مع أنظمة Windows و Linux الأساسية.",
      "يسعى المطور بنشاط للحصول على تعليقات حول وظائف وفعالية هذا النظام المطور حديثا.",
      "يمثل هذا التطور توسع Fig من دعم macOS السابق فقط إلى دعم منصات متعددة الآن."
    ],
    "points": 313,
    "commentCount": 128,
    "retryCount": 0,
    "time": 1699298132
  },
  {
    "id": 38164735,
    "title": "يحتج المطورون على مساعد ملاحظات Apple: دعوة لتحسين نظام الإبلاغ عن الأخطاء",
    "originLink": "https://lapcatsoftware.com/articles/2023/11/2.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38164735",
    "commentBody": "",
    "originSummary": [
      "بدأ جيف جونسون مقاطعة ضد مساعد التعليقات من Apple ، وحث المطورين على تقديم تعليقات جديدة حول المشكلات الحالية ، لكنهم يرفضون الرد على المشكلات الحالية حتى يتم إجراء تحسينات.",
      "تشمل المشكلات المهمة التي تم تسليط الضوء عليها عدم استجابة Apple ، والإغلاق العشوائي للتعليقات ، وتجاهل تقارير أخطاء المطورين ، والمطالبة بتقارير مفصلة لتشخيص النظام ، وإهمال الطرق الأصغر لتشخيص الأخطاء ، ونقص وظيفة البحث عن الأخطاء ، وتفويض لتقديم جميع التعليقات عبر macOS أو iOS.",
      "تؤكد المقاطعة ، مقارنة بالإضراب العمالي ، على المساهمة غير المعترف بها وغير المدفوعة للمطورين في اختبار وتحسين برامج ومنتجات Apple. لا ينتقد مهندسي Apple الفرديين ولكنه يتحدى قيادة الشركة."
    ],
    "commentSummary": [
      "يقوم جيف جونسون بحشد مطوري Apple لمقاطعة مساعد ملاحظات Apple حتى يتم إجراء تحسينات على العديد من المشكلات المهمة بما في ذلك عدم استجابة Apple ، ورفض تقارير الأخطاء ، وعدم القدرة على البحث عن الأخطاء.",
      "تشجع المقاطعة المقصودة المطورين على تقديم تعليقات جديدة حول مشكلات النظام ، لكنهم يمتنعون عن الرد على المشكلات الحالية ، مع التأكيد على المساهمات الحاسمة ولكن غير المدفوعة التي يقدمها المطورون في اختبار منتجات Apple وتحسينها.",
      "وأوضح جونسون أن المقاطعة لا تستهدف مهندسي أبل، بل تهدف إلى إجبار قيادة أبل على الاعتراف بنظام الإبلاغ عن الأخطاء وتعزيزه."
    ],
    "points": 302,
    "commentCount": 119,
    "retryCount": 0,
    "time": 1699288243
  },
  {
    "id": 38164046,
    "title": "فهم المخاطر والاستخدام السليم لأوامر git rebase و git push",
    "originLink": "https://jvns.ca/blog/2023/11/06/rebasing-what-can-go-wrong-/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38164046",
    "commentBody": "",
    "originSummary": [
      "يوضح المؤلف المشكلات المحتملة التي يجب وضعها في الاعتبار أثناء استخدام أوامر \"git rebase\" و \"git push --force\" في الفروع الجماعية ، مثل حل النزاعات المتكرر ، وفقدان البيانات الوصفية للالتزام ، والتحديات في التراجع عن إعادة الأساس.",
      "يقترحون الاستخدام الحذر لإعادة التأسيس في الفروع المشتركة ويؤكدون على الحفاظ على انضباط الالتزام الأنيق.",
      "يقترحون سير عمل \"الاسكواش والدمج\" كبديل ، ويثبطون القوة التي تدفع إلى فرع مشترك وتعيد تأسيس فرع مدفوع ، مع الاعتراف بفائدة إعادة الأساس."
    ],
    "commentSummary": [
      "يناقش المؤلف المشاكل المحتملة مع git rebase و git push - أوامر القوة في الفروع المشتركة ، بما في ذلك تكرار الصراع ، وفقدان البيانات الوصفية للالتزام ، والصعوبات في التراجع عن إعادة التأسيس وإعادة تأسيس عدد كبير من الالتزامات.",
      "هناك توصية لممارسة ضبط النفس عند استخدام rebase في الفروع التعاونية ، مع التأكيد على أهمية الحفاظ على انضباط التزام نظيف.",
      "تقترح المقالة النظر في سير عمل \"الاسكواش والدمج\" كبديل. لا يشجع المؤلف الدفع بالقوة إلى فرع مشترك وإعادة تأسيس فرع مدفوع ، على الرغم من الاعتراف بفائدة rebase."
    ],
    "points": 279,
    "commentCount": 348,
    "retryCount": 0,
    "time": 1699285343
  },
  {
    "id": 38162837,
    "title": "Elgato تبتكر مع كابلات USB-C: عرض النطاق الترددي والنوع مطبوع بوضوح لراحة المستخدم",
    "originLink": "https://www.theverge.com/2023/11/6/23948486/usb-c-cables-marking-speed-power-delivery-elgato",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38162837",
    "commentBody": "",
    "originSummary": [
      "قدمت Elgato ، وهي شركة تكنولوجيا ، كابل USB-C يحتوي على عرض النطاق الترددي ونوعه على الموصل لسهولة التعرف عليه.",
      "تهدف هذه الميزة إلى تقليل الالتباس عند تحديد موقع كبلات USB-C معينة ، مما يلغي الحاجة إلى الاختبار للتأكد من مواصفات الكابل.",
      "تعتزم Elgato دمج ميزة التصميم هذه في جميع كابلات USB و HDMI القادمة."
    ],
    "commentSummary": [
      "قدمت Elgato ، وهي شركة تقنية ، كابل USB-C مع عرض النطاق الترددي ونوع USB مطبوعا على الموصل ، مما يساعد المستخدمين في تحديد قدرات الكابل بسرعة.",
      "تعتبر هذه الميزة عملية ومفيدة في التخفيف من الارتباك العام عند تحديد كبل USB-C معين من بين العديد.",
      "لدى Elgato خطط أخرى لدمج بيانات المواصفات هذه على جميع كابلات USB و HDMI القادمة."
    ],
    "points": 277,
    "commentCount": 220,
    "retryCount": 0,
    "time": 1699280115
  },
  {
    "id": 38169816,
    "title": "الاحتفال بعقدين من Inkscape: يثني المستخدمون على محرر الرسومات المتجهة مفتوح المصدر",
    "originLink": "https://inkscape.gitlab.io/inkscape-docs/awesome-web-pages/20th_anniversary/#frame4804",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38169816",
    "commentBody": "",
    "originSummary": [
      "يحتفل Inkscape ، محرر الرسومات المتجهة مفتوح المصدر ، بالذكرى السنوية ال 20 لتأسيسه ، ويحظى بالتقدير والامتنان من مستخدميه ومساهميه.",
      "ويشيد مستخدمو المنصة بدورها في العديد من المجالات الإبداعية مثل التصميم الاحترافي والتطريز وإنشاء الأيقونات، مشيدين بمرونتها وميزاتها المميزة وتحسينها المستمر.",
      "يعرب المجتمع عن شكره لمطوري Inkscape والمساهمين فيه ، ويأمل في مزيد من النجاح والنمو للمنصة في العقود القادمة."
    ],
    "commentSummary": [
      "يتم الاحتفال ب Inkscape ، محرر الرسومات المتجهة المجاني مفتوح المصدر ، في الذكرى السنوية ال 20 من قبل مستخدميه والمساهمين فيه.",
      "يشيد المستخدمون ب Inkscape لدورها المحوري في مختلف المجالات الإبداعية مثل أعمال التصميم الاحترافية وتصميمات التطريز وإنشاء الأيقونات ، مشيدين بتعدد استخداماتها وميزاتها الفريدة والتحسينات المتسقة.",
      "يتلقى المساهمون والمطورون في Inkscape الامتنان لالتزامهم وعملهم الجاد ، حيث يأمل المهنئون في استمرار النمو والنجاح خلال العقدين المقبلين."
    ],
    "points": 257,
    "commentCount": 31,
    "retryCount": 0,
    "time": 1699308759
  },
  {
    "id": 38171322,
    "title": "يقوم Bluesky بإعادة بناء PDS ل SQLite أحادي المستأجر ، وتقديم ملفات مستخدم منفصلة ، وفئات تفاعل جديدة ، ونسخ متماثل للتدفق",
    "originLink": "https://github.com/bluesky-social/atproto/pull/1705",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38171322",
    "commentBody": "",
    "originSummary": [
      "تم تجديد مخزن بيانات المنتج (PDS) لاستخدام قاعدة بيانات SQLite ذات مستأجر واحد ، حيث سيكون لكل مستخدم ملف SQLite الخاص به للحفاظ على حالة الريبو والحساب الخاص.",
      "تم تقديم ActorStore للتفاعل مع بيانات المستخدم ، لتحل محل الخدمات السابقة ، وتتضمن فئات محددة للقراءة والكتابة. أي تغيير في المتجر يتطلب \"معاملة\" مميزة.",
      "لإدارة حالة الخدمة، تمت إضافة ثلاث قواعد بيانات SQLite منفصلة. من المقرر أن يتم حزم PDS مع Litestream لتسهيل عمليات القراءة المتزامنة والنسخ المتماثل في الوقت الفعلي. تضمنت هذه الترقية العديد من الالتزامات والإصلاحات ، والتي اجتازت جميع الاختبارات."
    ],
    "commentSummary": [
      "خضع PDS لإعادة البناء لتنفيذ مخزن بيانات SQLite أحادي المستأجر ، حيث يمتلك كل مستخدم ملف SQLite فريدا لتخزين بيانات المستودع والحساب الخاص.",
      "تم دمج ActorStore لتفاعل بيانات المستخدم ، ليحل محل الخدمات السابقة ، ويستخدم فئات مختلفة لأداء عمليات القراءة والكتابة.",
      "تتضمن البنية الآن ثلاث قواعد بيانات SQLite منفصلة لإدارة حالة الخدمة ، مع \"معاملات\" إلزامية لتغييرات المتجر. سيتم توزيع PDS مع Litestream مما يتيح عمليات القراءة المتزامنة والنسخ المتماثل المتدفق."
    ],
    "points": 251,
    "commentCount": 144,
    "retryCount": 0,
    "time": 1699316559
  },
  {
    "id": 38161369,
    "title": "الاحتفال بتنوع المصالح في مجتمع أخبار القراصنة: منشور تأملي",
    "originLink": "https://news.ycombinator.com/item?id=38161369",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38161369",
    "commentBody": "",
    "originSummary": [
      "يبدأ المؤلف منشورا جديدا للاحتفال بالذكرى السنوية لمنشور تم تقديره سابقا ، ويعرض الاهتمامات المتنوعة لمجتمع Hacker News.",
      "يعد المنشور بمثابة بادرة امتنان تجاه مستخدم يدعى McKirk.",
      "يوضح هذا العلاقات الدافئة والشعور بالمجتمع داخل موقع Hacker News."
    ],
    "commentSummary": [
      "بدأ المؤلف منشورا جديدا للاحتفال بالذكرى السنوية لمنشور سابق وجدوه ممتعا.",
      "يهدف هذا الإجراء إلى التأكيد على الاهتمامات المتنوعة الموجودة داخل مجتمع Hacker News (HN).",
      "لقد أعربوا أيضا عن تقديرهم لمستخدم يحمل اسم \"McKirk\"."
    ],
    "points": 251,
    "commentCount": 558,
    "retryCount": 0,
    "time": 1699271679
  }
]
