[
  {
    "id": 36341941,
    "timestamp": 1686842989,
    "title": "Reddit's blackout protest is set to continue indefinitely",
    "url": "https://old.reddit.com/r/technology/comments/149zmar/reddits_blackout_protest_is_set_to_continue/",
    "hn_url": "http://news.ycombinator.com/item?id=36341941",
    "content": "MY SUBREDDITSpopularallrandomusers | askredditfunnyworldnewspicstodayilearnedmildlyinterestingnewsgamingmoviesexplainlikeimfiveawwtifuvideostwoxchromosomesjokesartlifeprotipsoldschoolcoolmusicnottheonionfuturologyshowerthoughtsdataisbeautifulbooksiamaasksciencescienceMORE » Technologycommentsother discussions (4)Want to join? Log in or sign up in seconds.|English39,159 points (87% upvoted)shortlink:remember mereset passwordloginSUBMIT A NEW LINKSUBMIT A NEW TEXT POSTTechnologyjoin14,330,414 readers9,305 users here now/r/technology is a place to share and discuss the latest developments, happenings and curiosities in the world of technology; a broad spectrum of conversation as to the innovations, aspirations, applications and machinations that define our age and shape our future.Browse categories:Artificial Intelligence BusinessBiotechnology CryptoEnergy HardwareMachine Learning Nanotech/MaterialsNetworking/Telecom Net NeutralityPolitics PrivacyRobotics/Automation SecuritySocial Media SocietySoftware SpaceTransportation Legacy *Pure Tech* FilterWeekly Support Thread ArchivesHide popular topics:No Net Neutrality-Remove FilterRULES:1. SUBMISSIONS2. BEHAVIOUR3. TITLES4. FLAIR5. REDDIT-WIDE RULES.MISCELLANEARelated SubredditsTECHNOLOGYPROGRAMMINGOS'SSOFTWAREPOPULAR COMPANIESCRYPTOCURRENCIESCAMPAIGNSMODERATORSMESSAGE THE MODSdiscussions in r/technology<>X2036 · 159 commentsTesla battery material supplier tops list of human rights abuses for second year in a row39.2kSocial MediaReddit’s blackout protest is set to continue indefinitely (independent.co.uk)submitted 20 hours ago by cata8903& 2 more5482 commentssharesavehidereporttop 200 commentsshow 500sorted by: bestWant to add to the discussion?Post a comment!CREATE AN ACCOUNT[–]blurplethenurple 3532 points 15 hours ago One thing I didn't think of in regards to this blackout is how much it ducks up google searches that used to lead to years old threads that are now leading to private subreddits. So this affects people that wouldn't say they use reddit as well.permalinkembedsavereportreply[–]iloveatingmycum 1226 points 14 hours ago My friend was trying to troubleshoot a computer issue on Tuesday and he went to click the Reddit thread that talked about his issue and it was locked. He ree’d hard.permalinkembedsaveparentreportreply[–]lkeltner 444 points 13 hours ago I've already experienced this troubleshooting issues. I expected it, but man it still sucks.permalinkembedsaveparentreportreply[–]20127010603170562316 205 points 12 hours ago If you use Chrome (maybe other browsers too), just put cache: before the URLpermalinkembedsaveparentreportreply[–]Bear-Bull-Pig 83 points 11 hours ago I need to remember this tip before the sub goes dark again.permalinkembedsaveparentreportreply[–]redcalcium 82 points 10 hours ago You can also paste the url in the Wayback Machine: https://archive.org/web/permalinkembedsaveparentreportreply[–]blewpah 69 points 8 hours ago Worth noting that the nonprofit that runs the wayback machine, Internet Archive, has also been under fire recently facing legal action from publishers.Depending on how that or further legal action goes there's potential risk of losing that resource too.permalinkembedsaveparentreportreply[–]lunaticneko 30 points 8 hours ago Let's make a wayback machine for the wayback machine.permalinkembedsaveparentreportreplyload more comments (5 replies)load more comments (2 replies)[–]decimus5 12 points 9 hours ago It's a Google Search feature. It works anywhere that you can search Google.permalinkembedsaveparentreportreplyload more comments (5 replies)[–]Arn4r64890 39 points 12 hours ago Well there are two options that you can hope for. When you see the Google Search result, if you click the three dots, and then click the down arrow under the x (the down arrow is next to where it says Remove result), you can hope it says Cached. The other thing is you can go to https://www.archive.org and hope the Wayback Machine has the Reddit page saved.permalinkembedsaveparentreportreplyload more comments (5 replies)load more comments (5 replies)[–]gerd50501 393 points 14 hours ago if they stay private, reddit will go down in google search and be off the first page.permalinkembedsaveparentreportreply[–]slime-in-a-bottle 202 points 12 hours ago And hopefully tank reddit stock prices. It is an inconvenience for sure but that's the company's faultpermalinkembedsaveparentreportreplyload more comments (33 replies)[–]Stranded_In_A_Desert 40 points 13 hours ago And all that knowledge will be lost for time. I’m trying to debug some pretty niche code at the moment, and all my searches are pointing me to private subs too. Fml.permalinkembedsaveparentreportreply[–]gerd50501 24 points 13 hours ago reddit comes up before stack overflow? id just go search there. i use that more often. its much better organized for tech questions.permalinkembedsaveparentreportreply[–]Notsomebeans 12 points 11 hours ago stack overflow is good for like, programming questions.if you're trying to resolve some issue with windows on your old laptop or whatever in my experience stack overflow doesn't often have much to offerpermalinkembedsaveparentreportreplyload more comments (2 replies)load more comments (7 replies)load more comments (57 replies)[–]vj4486 8 points 14 hours ago I keep looking up advice on Stable Diffusion and this has been my issue for the last few days. Reddit is the only site people discuss it onpermalinkembedsaveparentreportreplyload more comments (1 reply)[–]xposedbones 37 points 14 hours ago if that happens again, you can click on the cached version in google to get access to the informationpermalinkembedsaveparentreportreplyload more comments (6 replies)[–]NotAHost 18 points 13 hours ago Used a cached version, if you can. Won't work forever but gives a quick temp solution. Can't participate in discussion.permalinkembedsaveparentreportreply[–]Ardbert_The_Fallen 5 points 11 hours ago Yep, this is how I got through on maybe 6 of the 45 searches I did the past few days. I always add 'reddit' at the end of my searches, might have to break that habit.permalinkembedsaveparentreportreplyload more comments (1 reply)load more comments (41 replies)[–]ssmsti 270 points 14 hours ago Click the three dots next to the search result and click on cached. It will load the cached version of the page and you will still get your answer.permalinkembedsaveparentreportreply[–]patrickstox 235 points 14 hours ago That won't continue to work. When the subs are private, Reddit has the pages marked with a noindex tag that will cause them to drop out of search engines. These threads will no longer be found and Google will drop their cache as well.permalinkembedsaveparentreportreplyload more comments (16 replies)[–]FrogMasterX 81 points 14 hours ago This isn't a solution. All of these pages will disappear from the Google Index as Google recrawls them and sees they don't exist any longer. You won't be able to find them at all after another few weeks.permalinkembedsaveparentreportreplyload more comments (27 replies)[–]lycheedorito 32 points 14 hours ago* Alternatively there's wayback machine which should be more reliable. Either way there's no guarantee the page you searched for got indexed.The API changes kill Unditt so that's no longer viable.permalinkembedsaveparentreportreply[–]mods_r_jobbernowl 18 points 14 hours ago Wayback machine doesn't work for a site of links. It works for pages you don't really click off.permalinkembedsaveparentreportreplyload more comments (1 reply)load more comments (1 reply)load more comments (7 replies)[–]Laladelic 12 points 13 hours ago I was searching to troubleshoot some issue with a 10+ y/o motherboard and it was very challenging indeed....permalinkembedsaveparentreportreply[–]gerd50501 36 points 14 hours ago if it goes on too long, one of two things will happen. reddit will fire mods and just make the subreddits public again. or new subs will be created and they will promote those in /r/all and then ignore the old subs.permalinkembedsaveparentreportreply[–]Osric250 20 points 11 hours ago reddit will fire mods and just make the subreddits public again.It's already happening.https://www.reddit.com/r/SubredditDrama/comments/149bvky/admins_have_taken_over_radviceanimals_reopened/permalinkembedsaveparentreportreplyload more comments (3 replies)load more comments (19 replies)load more comments (101 replies)[–]nijuu 640 points 17 hours ago Which big subs havent come back up yet?permalinkembedsavereportreply[–]AccomplishedAd3484 774 points 15 hours ago r/science, r/nba, r/nfl are three I'm aware of.permalinkembedsaveparentreportreply[–]museproducer 372 points 14 hours ago Seems like most of the sports subreddits really, r/formula1 is also down too. r/soccer is back online though.permalinkembedsaveparentreportreply[–]Alltheweed 1676 points 14 hours ago Soccer only faking to be down.permalinkembedsaveparentreportreply[–]Skunkyfratz666 53 points 14 hours ago I'm imagining David Luiz winking to the camera hahapermalinkembedsaveparentreportreply[–]Ballefjongballe 50 points 12 hours ago Look at that, a fun comment on reddit!permalinkembedsaveparentreportreply[–]MassXavkas 17 points 10 hours ago That'll be $150 in API fees for the pleasure and convenience of reading the comment.-Spezobviously /s just incase some admin doesn't realisepermalinkembedsaveparentreportreplyload more comments (1 reply)load more comments (14 replies)[–]RandomComputerFellow 103 points 14 hours ago I think sports subreddits do this because they absolutely rely on third party apps to fight spam. For some reason sports subreddit are the main target for spammers.permalinkembedsaveparentreportreply[–]RonnieFromTheBlock 67 points 12 hours ago That is probably true but the fact that the NFL and NBA are in the off season now can't be understated.Its much easier for them to stay shut down compared to /r/baseballNow, r/NBA deciding to go dark on the day of their championship was certainly a choice. And I imagine they aren't rushing to get back to the inevitable vitriol.permalinkembedsaveparentreportreply[–]EiKommentteja 44 points 11 hours ago While true, there are also millions of users on /r/nba and even during the off-season the subreddit is full of posts. Usually some weird shit like whether LeBron would still be the best player if he had to wear sandals. But still, loads of stuff even if the games are done.And, the draft is just around the corner, that's a major event for NBA.permalinkembedsaveparentreportreply[–]Islandmov3s 13 points 11 hours ago Plus the Ja Morant update toopermalinkembedsaveparentreportreply[–]EiKommentteja 3 points 10 hours ago ESPN (Jay Williams) already claimed that he can be \"one of the greatest redemption stories ever\", that he can still be the face of the NBA and, and I quote: \"and that's the most important thing for him to hear.\"Jesus Christ. The most important thing for him to hear is to fucking stop acting like a 5 cent thug and start behaving like a grownup with responsibilities. Who gives a shit whether someone can be the face of the league? The narrative ESPN is trying to produce annoys the hell out of me.permalinkembedsaveparentreportreply[–]Islandmov3s 5 points 10 hours ago Abso-fucking-lutely! ESPN has been shit for years, and just keeps getting worse.permalinkembedsaveparentreportreply[–]crystalmerchant 4 points 9 hours ago Yo do ya think LeBron would be the best player if he word sandals? Just curiouspermalinkembedsaveparentreportreplyload more comments (1 reply)load more comments (2 replies)[–]CapsicumIsWoeful 3 points 9 hours ago The Formula1 subreddit staying dark over a North American Grand Prix weekend is a really solid effort from the mods there.permalinkembedsaveparentreportreplyload more comments (4 replies)[–]a141abc 15 points 13 hours ago Also I assume they use them to post mirrors, comment bots, stop people linking streams that would get them banned, and stuff like thatpermalinkembedsaveparentreportreplyload more comments (12 replies)load more comments (4 replies)load more comments (22 replies)[–]Hypohamish 179 points 14 hours ago r/videos is huge and still down.permalinkembedsaveparentreportreply[–]LegacyLemur 84 points 11 hours ago /r/Showerthoughts, /r/pics and /r/gifs all still downpermalinkembedsaveparentreportreply[–]TheScottymo 13 points 8 hours ago r/Minecraft has decided to black out indefinitelypermalinkembedsaveparentreportreplyload more comments (2 replies)load more comments (4 replies)load more comments (14 replies)[–]khube 133 points 14 hours ago I'm having withdrawals without r/NFL. Where can I make shitty Kelvin Benjamin memes?permalinkembedsaveparentreportreply[–]enjoytheshow 88 points 14 hours ago And where can I make posts that will be deleted by the mods and then re-posted by one of their alt accounts?permalinkembedsaveparentreportreply[–]Badloss 20 points 14 hours ago There is absolutely no surprise to me that r/nfl mods think they're a force for change in the worldpermalinkembedsaveparentreportreplyload more comments (2 replies)[–]frexistential 8 points 14 hours ago Have you tried out this reddit alternative yet? The NFL community there is really great and open to new members right now.permalinkembedsaveparentreportreply[–]ObeyCoffeeDrinkSatan 5 points 8 hours ago Thanks, looks promising. Quite a lot of knowledgeable people and in-depth discussion, but it's welcoming and not snobbish in the slightest.permalinkembedsaveparentreportreplyload more comments (1 reply)[–]the_Archmage 47 points 14 hours ago Mr. Bereft Community 😔permalinkembedsaveparentreportreply[–]Problematique_ 40 points 14 hours ago Mr. Blocked Commenting 😔permalinkembedsaveparentreportreply[–]jimmyhoffasbrother 39 points 14 hours ago Mr. Blackout Continuingpermalinkembedsaveparentreportreplyload more comments (1 reply)[–]dolphone 4 points 13 hours ago Doing the lord's work. Respect.permalinkembedsaveparentreportreply[–]Thechosenjon 41 points 14 hours ago we over at r/GreenBayPackers came back from our darkness retreat (no bullshit, the mods called it that, LOL) and welcome any and all memespermalinkembedsaveparentreportreply[–]SheriffComey[🍰] 25 points 14 hours ago darkness retreatAs a Jets fan I just call that the regular season.permalinkembedsaveparentreportreplyload more comments (1 reply)load more comments (29 replies)[–]Actually-Yo-Momma 38 points 14 hours ago Not having NBA during the finals finale was tough. It’s hard to get hyped about sports alone at home :(permalinkembedsaveparentreportreplyload more comments (22 replies)load more comments (40 replies)[–]GoreSeeker 334 points 15 hours ago As of this posting, Minecraft, Funny, Awww, Music, Science, quite a lot:https://reddark.untone.uk/permalinkembedsaveparentreportreply[–]wOlfLisK 95 points 14 hours ago And a lot of the ones that are up are in read only mode. So you can access it but there won't be any new memes or cat pictures for a while.permalinkembedsaveparentreportreply[–]knokout64 53 points 14 hours ago This is enough for me. Fuck has it been annoying to not be able to read advice/info on more niche hobbies. I'm trying to figure out some good mods for my first modded playthrough of KOTOR damnit!permalinkembedsaveparentreportreply[–]lodum 38 points 14 hours ago Yeah, nearly two decades of users have made this place a great repository of information like that, it'll be a shame to lose it.permalinkembedsaveparentreportreply[–]HerbertWest 61 points 14 hours ago Yeah, nearly two decades of users have made this place a great repository of information like that, it'll be a shame to lose it.Tell that to spez and the IPO vultures.permalinkembedsaveparentreportreply[–]Semi-Hemi-Demigod 38 points 13 hours ago Phase 2 of enshittification starts when the value stops being given to the user and starts going to the advertiser. Advertisers want better metrics, so they stop third party apps and free APIs.Just like phase 1 is a trap for users, phase 2 is a trap for advertisers. Eventually they'll be reliant on Reddit for ads, and then Reddit can squeeze them for value for the shareholderspermalinkembedsaveparentreportreply[–]EarthRester 16 points 13 hours ago Yeah, regardless of how this blackout ends up. Reddit will be a walking corpse once it goes public.permalinkembedsaveparentreportreply[–]Semi-Hemi-Demigod 16 points 12 hours ago I'm sure that In a year or two they'll get rid of the porn. I'd use RemindBot but I won't be here after the 30thpermalinkembedsaveparentreportreply[–]G00b3rb0y 6 points 9 hours ago Plus that bot doesn’t even work atmpermalinkembedsaveparentreportreplyload more comments (8 replies)load more comments (9 replies)load more comments (3 replies)load more comments (1 reply)load more comments (11 replies)load more comments (3 replies)load more comments (25 replies)[–]Zcrash 10 points 13 hours ago r/publicfreakoutpermalinkembedsaveparentreportreply[–]PC509 51 points 13 hours ago Looking at the list, r/amateurcumsluts is still private.I knew I felt something was off...permalinkembedsaveparentreportreply[–]Donghoon 57 points 15 hours ago r/programmerhumorpermalinkembedsaveparentreportreply[–]routefire 36 points 14 hours ago Oh no, where will Fireship steal his memes frompermalinkembedsaveparentreportreplyload more comments (1 reply)[–]ZealousidealGap577 8 points 9 hours ago I miss this sub more than I care to admit it to myselfpermalinkembedsaveparentreportreplyload more comments (2 replies)load more comments (1 reply)[–]oldsch0olsurvivor 100 points 15 hours ago r/miakhalifapermalinkembedsaveparentreportreply[–]liberalvenery 75 points 15 hours ago The true tragedypermalinkembedsaveparentreportreply[–]Snitsie 49 points 14 hours ago Not a stranger to going darkpermalinkembedsaveparentreportreplyload more comments (1 reply)load more comments (3 replies)[–]Sennomo 41 points 15 hours ago r/de and r/ich_iel, the big German subs. basically no German content anymore.permalinkembedsaveparentreportreplyload more comments (5 replies)[–]Megatronian 42 points 15 hours ago Woodworking. :(permalinkembedsaveparentreportreplyload more comments (12 replies)[–]poppyisrealmetal 34 points 15 hours ago Hiphopheads 😥permalinkembedsaveparentreportreplyload more comments (3 replies)load more comments (95 replies)[–]GoodGuyRunar 148 points 13 hours ago* I started to realize on Tuesday just one day after the blackout how dependent I am using Reddit to find threads to issues that I encounter while on workpermalinkembedsavereportreplyload more comments (3 replies)[–]IM_INSIDE_YOUR_HOUSE 5916 points 17 hours ago I read about this on Reddit.permalinkembedsavereportreply[–]Sad_Damage_1194 1603 points 17 hours ago I wouldn’t even know about this protest if it wasn’t for Reddit promoting it.permalinkembedsaveparentreportreply[–]Veggie 608 points 17 hours ago That's the point, isn't it?permalinkembedsaveparentreportreply[–]f7f7z 1012 points 16 hours ago Lemme shove myself under the first comment thread... I am on reddit constantly, it's apparent more and more that its too much. But this blackout ( brown out really, partial blackout ) has the content getting weaker and I am wondering off it more... It is effective, thx.permalinkembedsaveparentreportreply[–]dogmatic69 581 points 16 hours ago I only view r/all since joining and the content is way different. It’s defo hitting the bottom line. And when Apollo stops working I’m gone.permalinkembedsaveparentreportreply[–]salsashark99 177 points 16 hours ago Baconreader for mepermalinkembedsaveparentreportreply[–]pickle_sandwich 313 points 15 hours ago Reddit Is No Longer Funpermalinkembedsaveparentreportreply[–]613663141 11 points 12 hours ago Reddit Is No Longer FunReddit is trademarked, you best refer to it as RINLF or you might get sued.permalinkembedsaveparentreportreplyload more comments (1 reply)[–]the_ThreeEyedRaven 27 points 14 hours ago* Reddit no longer Boosts my dopamine levelspermalinkembedsaveparentreportreply[–]CeramicTeaSet 20 points 15 hours ago Reddit Is Fubar.permalinkembedsaveparentreportreply[–]theWonderslug 15 points 15 hours ago I need the boost, without I just won't reddit, oh well, returning to the blackout now, maybe I'll be back n a few dayspermalinkembedsaveparentreportreplyload more comments (1 reply)[–]brettboy01 12 points 14 hours ago I Relay similar thoughtspermalinkembedsaveparentreportreply[–]Sm00th0per8or 6 points 12 hours ago Relay is so smoothpermalinkembedsaveparentreportreply[–]Golisten2LennyWhite 6 points 11 hours ago Literally the only way I can stand it now.permalinkembedsaveparentreportreplycontinue this threadload more comments (1 reply)[–]jimbob320 16 points 15 hours ago Reddit Sinkspermalinkembedsaveparentreportreplyload more comments (4 replies)[–]AnukkinEarthwalker 78 points 15 hours ago Same.Quite a few subs I'm active in have came back but a many still have not...But for those 48 hours my feed was trash.The offical app has always been trash. Has never much improved. Unless you consider useless clutter improving.Have always used baconreader.. if I dont totally bail at the end of the month I'll definitely be using other more streamlined platforms more than reddit.The 3rd party apps used to view and moderate the content here are what makes me chose reddit over other things so when those are gone...yea.Have a feeling once they shut off 3rd party stuff it will become a lawless wasteland for bots and trollspermalinkembedsaveparentreportreply[–]njones3318 4 points 14 hours ago What other platforms? I need ideas.permalinkembedsaveparentreportreplyload more comments (3 replies)load more comments (19 replies)[–]Tischlampe 43 points 14 hours ago Baconreader is so good. I'm Muslim and still use it!permalinkembedsaveparentreportreplyload more comments (1 reply)[–]electron_god 9 points 15 hours ago BaconBoys for Life!Or until Reddit fucks everything up...permalinkembedsaveparentreportreplyload more comments (16 replies)load more comments (77 replies)[–]DrunkChinPube 52 points 16 hours ago Yep. Post content and quality has taken a nose-dive. Honestly the blackout is making it easier to move on by forcibly weaning me off 😂. I use Sync for reddit and if that goes, I'm out. I'll use reddit on my pc for research purposes but I'm 100% not getting their shitty app. Reddit fucked this up, so badly. It's comical.permalinkembedsaveparentreportreplyload more comments (12 replies)load more comments (34 replies)load more comments (5 replies)[–]Searchlights 44 points 16 hours ago I wouldn’t even know about this protest if it wasn’t for Reddit promoting it.Almost all of my favorite subreddits are down. I'm spending less and less time on the site.permalinkembedsaveparentreportreply[–]AceAndre 9 points 11 hours ago Same, all of my niche subreddits are dark, and I hope it stays that waypermalinkembedsaveparentreportreplyload more comments (2 replies)load more comments (1 reply)load more comments (33 replies)[–]HahGHEEEEY 294 points 16 hours ago I read about it on RIF, which will be forced to close. Once it does, that's pretty much it for me.permalinkembedsaveparentreportreply[–]Rustysaurus-rex 62 points 15 hours ago Same. I started with bacon reader over a decade ago and switched to rif. Ive no joke used Reddit in a browser less than a dozen times since having a smartphone. RIF not only makes it easier to use reddit but its integrated browser actually makes using reddit safer and more private. I have 0 interest in using the reddit app, it looks like Instagram. I have no interest in using a web browser for reddit. The page is messing unorganized busy and difficult to look at. I personally will be ending my reddit use once RIF is offline.permalinkembedsaveparentreportreply[–]580083351 21 points 14 hours ago I really enjoy the old.reddit.com interface.. I find it easy to read. It's not an interface where the whole screen is blank white and perhaps a single paragraph of triple-spaced text in the center.permalinkembedsaveparentreportreply[–]JoeCasella 20 points 13 hours ago Old reddit is the only way to view reddit in a browser. The new reddit site is an abomination. Absolutely revolting.permalinkembedsaveparentreportreplyload more comments (4 replies)load more comments (33 replies)[–]jackwritespecs 196 points 17 hours ago On a shitty sub I don’t care about as I desperately seek for content I do care aboutOnce my muscle memory fades… so will my Reddit participationpermalinkembedsaveparentreportreply[–]DebateGullible8618 181 points 16 hours ago* Yeah people are coping hard, my front page is so much worse, I noticed my subscribed front page has even stared recommending me posts from subs I have not even subscribed to. Reddit is trying to fill in the void lolEDIT: I want to add as well that the people saying its fine dont seem to realize that people have separate interests. The subs for your hobbies and stuff may be fine but mine sure as hell isnt.permalinkembedsaveparentreportreply[–]geezer1234 13 points 15 hours ago I mostly don't use the front page, just go directly to 3-4 specific subs I like. They're all down lolpermalinkembedsaveparentreportreply[–]Malarowski 56 points 16 hours ago Same approach as Twitter with recommended Tweets. That's what used to make Twitter good, I could choose what I saw. I don't want suggestions and more stuff unless I look for it.Youtube also slipping pretty hard that way. Show me my subs rather than random, barely adjacent content.permalinkembedsaveparentreportreply[–]MagicTheAlakazam 25 points 14 hours ago I'm sorry you watched a gaming video. Your feed will now consist of nothing but Ben Shapiro.What people who watched that video also like Ben Shapiro so now we will recommend nothing but right wing content to you. Because you watched a funny gaming video.permalinkembedsaveparentreportreply[–]FuzzyBacon 17 points 14 hours ago You watched a video about WWII? Let me serve up twelve hours of content about how misunderstood Hitler really was.permalinkembedsaveparentreportreplyload more comments (2 replies)load more comments (1 reply)load more comments (7 replies)[–]Hazbuzan 3 points 15 hours ago Seriously, i started getting recommended r/makeupaddiction …..permalinkembedsaveparentreportreplyload more comments (28 replies)load more comments (16 replies)[–]AccountNumber478 5 points 15 hours ago Eventually the big subs will wind up like abandoned gas stations littering vast tracts of the midwest.permalinkembedsaveparentreportreplyload more comments (3 replies)load more comments (39 replies)[–]Yonutz33 127 points 16 hours ago Louis Rossman made a good video on it. Blackout is no good if ppl come backpermalinkembedsavereportreplyload more comments (19 replies)[–]PhamilyTrickster 1116 points 18 hours ago If reddit's average daily user metric isn't affected they won't care. Subs going black just means users are just seeing more from other subs when we all still log on. Unless users of 3rd party apps protest and show reddit the effect on actual user rates I can't see this helping at allpermalinkembedsavereportreply[–]praefectus_praetorio 270 points 16 hours ago June 30th 3rd party apps are gone. That's when (if anything) we'll see an effect.permalinkembedsaveparentreportreply[–]polseriat 67 points 14 hours ago That's the thing for me. A lot of the communities I used reddit to browse are on perma-private, so I'm not going to feel an incentive to use the app when RiF is gone.permalinkembedsaveparentreportreply[–]S_A_N_D_ 177 points 15 hours ago This is going to be the key indicator.I have no intention of using the reddit app. So once third party apps die, I'll stop browsing reddit on mobile and my screen time will go elsewhere.I'm sure I'm not alone, the question is whether enough people are the same as me to make a difference. I'm not sure, but we'll see.permalinkembedsaveparentreportreply[–]WilhelmScreams 26 points 14 hours ago Personal experience:I don't use any of the apps because I simply don't like the idea of a dedicated Reddit app (I'm aware I'm the exception) but I DID use the .compact (or i.reddit) for years - maybe a decade? And a few months ago they killed it off \"to streamline the experience\" [Translation: .compact did not display ads]The mobile website is god awful. Everything about it feels bad to use. I can't believe a major website has such an awful website other than to force you to use their app which also isn't very good.And so I just barely go on Reddit on my phone anymore. My PC usage hasn't increased because of it, and I only use the PC because RES makes the site tolerable to look at.permalinkembedsaveparentreportreply[–]S_A_N_D_ 8 points 12 hours ago Yup, This is how I see things going for myself as well. When old.reddit is killed, my usage will just slowly stagnate until I just use it for very specific or niche things instead of browsing.permalinkembedsaveparentreportreplyload more comments (2 replies)[–]Medium-Grapefruit891 97 points 14 hours ago Same. I'll just switch to using different sites on my phone. I've been using RIF for a decade, I have no interest in switching to the official app considering just how bad modern reddit UI designers are. Hell if it wasn't for old.reddit I wouldn't be using it on PC, either.permalinkembedsaveparentreportreply[–]RicketyNarwhal 6 points 9 hours ago As someone who’s only ever used the Reddit App on IOS, care to share what I’m missing out on?permalinkembedsaveparentreportreplyload more comments (1 reply)load more comments (17 replies)load more comments (31 replies)load more comments (35 replies)[–]boxofrabbits 112 points 16 hours ago I'm still using Reddit as I did before using Relay on android and haven't really felt a change. If they don't change their API plans though and it gets cut off at the end of the month I won't be seeking another way to use Reddit though. That'll be me done.permalinkembedsaveparentreportreply[–]uconnboston 10 points 16 hours ago Is the app UI that horrible in android? I’m on the iOS app, maybe it’s just me but it’s a simple, bland UI that’s more that adequate for a mostly text-based medium.permalinkembedsaveparentreportreply[–]BulbusDumbledork 20 points 16 hours ago have you used apollo, or any other 3rd party app? even ignoring the other ux issues, of which the stock app has innumerable, the fact that videos actually work on 3pa's vs the dogshit reddit video player is a huge issue. reddit hasn't been a mostly text-based platform for years nowpermalinkembedsaveparentreportreplyload more comments (12 replies)load more comments (7 replies)[–]ynthrepic 27 points 16 hours ago Most likely me too. Boost is too good. The Reddit mobile app sucks. If I keep using Reddit, I will just continue to block ads anyway. I was a paid subscriber at one point. I wanted to support the platform. Not any longer. Fuck em'permalinkembedsaveparentreportreply[–]Schlengge 15 points 15 hours ago Check the work of the ReVanced team, they already have a solution on how we will be able to keep using 3rd party apps after July 1st.permalinkembedsaveparentreportreplyload more comments (1 reply)load more comments (12 replies)[–]HerbertWest 57 points 16 hours ago If reddit's average daily user metric isn't affected they won't care. Subs going black just means users are just seeing more from other subs when we all still log on. Unless users of 3rd party apps protest and show reddit the effect on actual user rates I can't see this helping at allDead links when people who are not already regular users Google specific info should lead to a decrease in usage metrics and, potentially, a decrease in growth of the userbase.permalinkembedsaveparentreportreplyload more comments (24 replies)[–]TheyCallMeStone 317 points 17 hours ago This is what everyone seems to be missing. Everyone using the reddit app will still see the same amount of ads. There will still be a front page, whether or not r/videos and r/music are on it.permalinkembedsaveparentreportreply[–]wewladdies 375 points 16 hours ago Not everyone on reddit uses /r/all or /r/popular. A ton of my gaming hobby subs are still closed and im def spending a decent amount of my phone screen time elsewhere this weekpermalinkembedsaveparentreportreply[–]paco-ramon 87 points 16 hours ago I just use Reddit for the dank, Pokémon, European politics and football subs, without them this is just a twitter where you can get banned for a Harambe joke.permalinkembedsaveparentreportreply[–]Sincost121 19 points 15 hours ago Reddit is great for niche interests. I hate it, but I absolutely also love r/BoxOfficepermalinkembedsaveparentreportreply[–]wOlfLisK 20 points 14 hours ago That's the thing I'm gonna miss the most, you can find memes and cat pictures anywhere but if you want to see photos of, say, trees with a slice of bread stapled to it then /r/breadstapledtotrees has you covered. Even the most niche hobbies, interests and kinks have an active subreddit and I have no clue where I'd find my breaded trees or weird porn off of this site.permalinkembedsaveparentreportreply[–]Gloomy-Buffaloo 7 points 14 hours ago yeah, reddit has the biggest niche porn forums on the internet people are already getting upset about itpermalinkembedsaveparentreportreplyload more comments (1 reply)load more comments (7 replies)[–]moreexclamationmarks 3 points 14 hours ago I'm one, I only use my front page tab, I really only use a few subreddits.Popular or all just gives too much content that plays on clickbait, emotion, or conflict. Reminds me too much of why I stopped using Twitter years ago.permalinkembedsaveparentreportreplyload more comments (17 replies)load more comments (78 replies)[–]primus202 4 points 16 hours ago I wonder what percent of users use third party apps. I would assume it’s not a big enough percent for them to care or they wouldn’t have made this move in the first place. However I am much more concerned about the impact on third party moderation tools.permalinkembedsaveparentreportreplyload more comments (2 replies)load more comments (104 replies)[–]uCry_iLoL 548 points 16 hours ago Reddit’s blackout protest is set to continue indefinitely**Only on some subreddits.permalinkembedsavereportreply[–]Athosphere 155 points 16 hours ago Nothing says united front as massive confusion as soon as two days pass. Blackout one day a week? Indefinitely? Back to public? Polls on polls on polls?permalinkembedsaveparentreportreply[–]nyxian-luna 59 points 14 hours ago Internet activism is nothing if not a disorganized, inconsistent mess.permalinkembedsaveparentreportreply[–]MagentaHawk 16 points 12 hours ago And yet, if the mods all agreed to indefinite beforehand there would be continual complaints that they did it without consulting their communities. People love to complain about protests. There's no more favorite privileged past time.permalinkembedsaveparentreportreplyload more comments (5 replies)load more comments (2 replies)load more comments (3 replies)[–]trippinonsomething 88 points 16 hours ago I keep seeing people saying they’re done with Reddit. I don’t believe it. And I bet they don’t realize how addicted they are. I’m guilty.permalinkembedsaveparentreportreply[–]POD80 18 points 15 hours ago Yeah, taking a couple days off in support of the mods illustrated how much time I waste.I KNOW i need to cut back... guess what I'm doing everytime I have my hands free...permalinkembedsaveparentreportreplyload more comments (3 replies)load more comments (30 replies)load more comments (46 replies)[–]Taint_Skeetersburg 11 points 9 hours ago Honestly it's been sort of nice, the front page is actually getting some fresh stuff from subs that otherwise wouldn't make it on therepermalinkembedsavereportreply[–]MoirasPurpleOrb 10 points 13 hours ago Except a LOT of subs have already posted about being back onlinepermalinkembedsavereportreplyload more comments (3 replies)[–]blsrx10 93 points 15 hours ago When digg f**ked up, there was a mass exodus that destroyed digg. This time, there isn’t an alternative (yet) and these blackouts don’t mean much. But I can guarantee the Reddit folks that, when most of us pick one as an alternative, Reddit will be a graveyardpermalinkembedsavereportreply[–]Serito 15 points 10 hours ago It's such a dangerous game for Reddit, short term nothing changes but it injects growth into all the alternatives that most of us probably don't know about yet. Then a year or two down the line when it happens again, the same thing, except maybe now you've heard of the alternatives name.Eventually it happens again and, uh oh, suddenly the alternative actually seems just more convenient and the new trendy place. Once that happens it'll be too late for Reddit to do damage control or come to the table. The handling of this whole issue is incredibly short sighted.permalinkembedsaveparentreportreplyload more comments (35 replies)[–]KBDFan42 70 points 18 hours ago I didn’t feel it the first two days but searching for info on things is harder. I usually search what I’m looking for and add Reddit to the end, but with the blackout, the subs are closed.permalinkembedsavereportreply[–]kipl33 37 points 13 hours ago It's killing me. I always add reddit to the end of my Google searches, because I get straight answers. Not some BS article on a topic that is vague and full of ads and prompts to get my email.permalinkembedsaveparentreportreply[–]jonquest 16 points 13 hours ago Just add “forum” like I used to before “reddit”permalinkembedsaveparentreportreply[–]kipl33 6 points 13 hours ago I never knew. Thanks.permalinkembedsaveparentreportreplyload more comments (2 replies)[–]mrswordhold 1591 points 18 hours ago* I’ve literally never. EVER. Fucked a crab in its dick.permalinkembedsavereportreply[–]Turbojelly 156 points 17 hours ago* Like r/adviceanimals who have had the top mods removed and replaced with admins that delete any post mentioning it?EDIT: Admins have taken over r/AdviceAnimals, re-opened the sub to the public, bans any mentioning of it.https://i.imgur.com/sFQwrLp.pnghttps://i.imgur.com/UpylPGD.pnghttps://www.reddit.com/r/AdviceAnimals/comments/149al7q/well_this_place_is_compromised/EDIT:More context: https://lemmy.intai.tech/comment/31833https://www.reddit.com/r/SubredditDrama/comments/149bvky/admins_have_taken_over_radviceanimals_reopened/permalinkembedsaveparentreportreply[–]SnackThisWay 105 points 17 hours ago I never would have guessed that Advice Animals was of vital importance to Reddit's financial stabilitypermalinkembedsaveparentreportreply[–]zeussays 38 points 17 hours ago It isnt now but 10 years ago it was one of the top subs. The memes are what brought me to reddit.permalinkembedsaveparentreportreplyload more comments (5 replies)[–]junkit33 21 points 17 hours ago I'm not going to even begin to pretend to understand the people who hang out in that sub. But my guess is it's a lot of default app type users who are totally cool with heavy advertising.permalinkembedsaveparentreportreplyload more comments (1 reply)[–]Ignisami 6 points 16 hours ago it's a default sub IIRC, so it gets several hundred million eyeballs per monthpermalinkembedsaveparentreportreplyload more comments (7 replies)load more comments (21 replies)[–]jauggy 54 points 17 hours ago They already have processes in place where you can request to take over a sub that has been abandoned for 30 days. See /r/redditrequest There's plenty of people who want to mod even with the new policy changes.In the past 24 hours there's 50-100 requests in that sub. In 30 days time, any privated subs will be up for grabs and I'm sure many will try and take them. The mods of those privated subs probably have a calendar reminder to open the sub before that time limit.permalinkembedsaveparentreportreply[–]Todd-The-Wraith 17 points 16 hours ago So only go private for say 28 days at a time. On the 29th open up for 24 hours then go private again for another 28permalinkembedsaveparentreportreplyload more comments (5 replies)load more comments (32 replies)[–]takingphotosmakingdo 390 points 17 hours ago* They stole subreddit control before, they'll do it again if it keeps the lights on.Edit: Cough bird app coughpermalinkembedsaveparentreportreply[–]SkullRunner 82 points 15 hours ago They stole subreddit control before,They can't steal something they own... mods are not gods... hate to break it to them... but they have no real power here.If they abuse their power to hurt the platform they can be nuked by Reddit which is pretty much policy on any social media platform that you can take out a problem user at any time for any reason.permalinkembedsaveparentreportreplyload more comments (35 replies)load more comments (279 replies)[–]Now__Hiring 193 points 17 hours ago The only leverage the users actually have at this point is for mods to strike.Attempts to convince people not to buy awards has failed, as rubes keep doing it (and reddit likely props this up to keep greasing the wheel).The one thing they can't afford to replace is the hundreds of thousands of hours of free labor that mods provide making these communities functional.If mods get replaced, users in those subs need to constantly harp on this fact and keep others aware. Surely there are scab moderators willing to steal control of beloved subreddits, but users should revolt in those instances in support of the larger strategy.permalinkembedsaveparentreportreplyload more comments (131 replies)load more comments (80 replies)[–]CthulhuSpawn 36 points 15 hours ago Hey Digg.com, why don't you roll your site back to the old version and take advantage of Reddit making your same mistake?permalinkembedsavereportreply[–]yeahburyme 9 points 15 hours ago Kevin Rose offered to do that about a year or two ago (to pre v4) but they didn't take.permalinkembedsaveparentreportreplyload more comments (2 replies)load more comments (1 reply)[–]cool_slowbro 6 points 11 hours ago My browsing experience is almost the exact same, minus gifs/pics. lolpermalinkembedsavereportreply[–]throwawayfordumbqs1 26 points 16 hours ago rolling brown outspermalinkembedsavereportreply[–]FishingFreddy 20 points 14 hours ago The only way you are going to ever have an impact on the decision process at Reddit is if you take pageviews away from the subreddits that shut down/blacked out/read only.Make the top sticky post on each of the subreddits a link to a forum somewhere else on the internet, or get the mod-teams to make a new site with a forum. It's about time to go full circle and return to the old VBulletin days, Reddit ruined the internet for too long.permalinkembedsavereportreplyload more comments (1 reply)[–]emohipster 24 points 14 hours ago Mods should just leave their subs open and stop moderating, disable automod etc. Let the place turn into a total shitshow.permalinkembedsavereportreply[–]xtilexx 6 points 7 hours ago Some subs that went dark had moderators removed by admins and replaced I believepermalinkembedsaveparentreportreplyload more comments (1 reply)load more comments (3 replies)[–]epicblitz 875 points 18 hours ago2 As a dev, always risky to use a 3rd party API as the backbone of your business.permalinkembedsavereportreply[–]Ilyketurdles 292 points 17 hours ago Honestly I get it, but Reddit should just invest more time and money into not having terrible apps, thinking about accessibility, building tools for mods who are willingly volunteering to run communities, and not fueling all this drama.Do I get wanting to get rid of 3rd party apps? Absolutely, but they aren’t offering a good alternative.permalinkembedsaveparentreportreply[–]Smoothsmith 187 points 17 hours ago I mostly don't get why you'd go straight to insane fees from nothing - Why not put in a low fee and increase it over time so the app developers have time to adjust accordingly.I can't see that it's a problem at all to have those 3rd party apps if they're giving you money, but for some reason \"No they must die swiftly\" is the approach being taken 🤷‍♂️permalinkembedsaveparentreportreply[–]Ilyketurdles 111 points 16 hours ago I think you answered your own question. They clearly said that API cost also incorporated the “opportunity cost” Of users not using the official app. So they want to push ads and gather user data, which again, I get (even though it sounds bogus, they are a business after all). So yes, they want to kill all 3rd party apps.But the way It’s being handled is just a dumpster fire.permalinkembedsaveparentreportreply[–]LOSS35 36 points 15 hours ago \"Our app can't compete with 3rd party apps because we refuse to invest in talent or infrastructure, so we'll kill off the 3rd party apps to force users to use our shitty one instead.\"Wouldn't it make more sense to hire some talented developers to improve their own app by incorporating what users like about the 3rd party apps? Then increase API fees gradually so they make money off the 3rd party apps too? This poison-pill API fee move seems shortsighted and anti-competitive.permalinkembedsaveparentreportreply[–]BUchub 16 points 14 hours ago Not if you're salty about them making money when you are not. This all has the feel of a 'thou shalt' order coming down from the top to achieve this goal by whatever means necessary.permalinkembedsaveparentreportreplyload more comments (4 replies)load more comments (3 replies)load more comments (1 reply)load more comments (8 replies)[–]jauggy 10 points 16 hours ago One of the reasons the protest won't work is that the alternatives are significantly worse. I've been to /r/RedditAlternatives and every alternative has either no mobile app or one that has even worse UI/UX. It makes no sense to protest the loss of your app to go to an alternative that has an even worse one.permalinkembedsaveparentreportreplyload more comments (5 replies)[–]redpachyderm 6 points 16 hours ago They actually bought a decent 3rd party app and then promptly ruined it.permalinkembedsaveparentreportreplyload more comments (47 replies)load more comments (352 replies)[–]Drs83 109 points 17 hours ago By indefinitely they mean, \"until Reddit gets around to replacing all the mods.\"permalinkembedsavereportreply[–]Athalos124 41 points 14 hours ago And nothing of value was lostpermalinkembedsaveparentreportreply[–]bonesnaps 15 points 12 hours ago After being banned from a few subs by moronic mods (one quick example is permabanned from /r/frugalmalefashion for asking why $50 pants is considered \"frugal\"), we do in fact need a mass mod purging.permalinkembedsaveparentreportreplyload more comments (1 reply)load more comments (25 replies)[–]andronicus_14 3714 points 19 hours ago My favorite part is the protestors who log in every day to post about how they’re protesting. The irony is palpable.permalinkembedsavereportreply[–]oZiix 1327 points 18 hours ago Not coming to Reddit and trying to convince others not to go to Reddit would be a boycott, not a protest. I haven't seen anyone say Reddit shouldn't make money.permalinkembedsaveparentreportreply[–]SuperSocrates 959 points 17 hours ago People are determined not to understand what’s going onpermalinkembedsaveparentreportreply[–]GhostlyRuse 652 points 17 hours ago Purposely misunderstanding what people are mad about and mocking them for being mad? Why would Redditors do such a thingpermalinkembedsaveparentreportreply[–]MIGsalund 359 points 17 hours ago Astroturfing campaigns have never happened on Reddit, and Reddit is completely above using them on its own users.permalinkembedsaveparentreportreply[–]AnonymousFan2281 25 points 15 hours ago Plus, have you seen the astroturfing on reddit alternatives? The top threads always follow the same comment structure.Someone has a complaint about the platform > someone chimes in to say that they were banned unreasonably > someone else then insults the mods there of being the same as reddit's powertrippy ones.permalinkembedsaveparentreportreplyload more comments (2 replies)[–]ParanoidArtemus 32 points 15 hours ago The rhetoric changed immediately and I'm seeing more and more anti-protest posting. I fully believe it's astroturfing.permalinkembedsaveparentreportreply[–]LegacyLemur 7 points 11 hours ago One of the top posts on adviceanimals is this right now and its patheticpermalinkembedsaveparentreportreplyload more comments (9 replies)[–]pegothejerk 32 points 17 hours ago There’s a lot of lawn supply salespersons around here for surepermalinkembedsaveparentreportreply[–]poopellar 4 points 14 hours ago This is a conspiracy by BIG LAWNpermalinkembedsaveparentreportreplyload more comments (1 reply)load more comments (1 reply)[–]mudman13 16 points 17 hours ago We are witnessing reddit consume itself its like a civil warpermalinkembedsaveparentreportreply[–]IAMA_Plumber-AMA 8 points 16 hours ago All Reddit admins had to do was make the users hate the mods just a little bit more than they already did, and *poof*, API problem gone.permalinkembedsaveparentreportreplyload more comments (10 replies)load more comments (3 replies)load more comments (12 replies)load more comments (83 replies)[–]morphinapg 71 points 17 hours ago Also, how are you going to try to influence the remaining mods to take action if you don't talk to them?permalinkembedsaveparentreportreplyload more comments (1 reply)load more comments (38 replies)[–]aryeh56 38 points 17 hours ago I'm not participating in protesting because I compulsively browse reddit, but I use a small third party app. On July 1st it sounds like I will be quitting cold turkey. Honestly I can't wait.permalinkembedsaveparentreportreplyload more comments (23 replies)[–]TheMikeyMac13 48 points 17 hours ago You do know a protest involves advertising your grievances don’t you?permalinkembedsaveparentreportreply[–]F3z345W6AY4FGowrGcHt 7 points 13 hours ago \"Look at all these protestors showing up at work with picket signs. If they really wanted to protest, they'd just quit and go work elsewhere\"permalinkembedsaveparentreportreplyload more comments (7 replies)[–]0ldpenis 257 points 18 hours ago My favorite part is the people commenting about the protestors who log in every day to post about how they’re protesting to make that point on every post about the protest.permalinkembedsaveparentreportreply[–]Exile714 81 points 17 hours ago That was the same for me, until I saw your post and now my favorite part is people who respond to the people who posts comments about the posters who log in every day to post about how they’re protesting to make that point on every comment making that point on every post about the protest.permalinkembedsaveparentreportreplyload more comments (10 replies)load more comments (4 replies)load more comments (402 replies)[–]animals_y_stuff 37 points 17 hours ago I feel incomplete without my daily dose of drama from /r/bestofredditorupdatespermalinkembedsavereportreply[–]okay_but_what 4 points 16 hours ago That’s the only sub I really miss from this blackout. Where’s my chaos???permalinkembedsaveparentreportreplyload more comments (6 replies)[–]crackerjam 24 points 14 hours ago But not /r/technology apparently.permalinkembedsavereportreplyload more comments (2296 replies)aboutblogaboutadvertisingcareershelpsite rulesReddit help centerreddiquettemod guidelinescontact usapps & toolsReddit for iPhoneReddit for Androidmobile website<3reddit premiumreddit coinsUse of this site constitutes acceptance of our User Agreement and Privacy Policy. © 2023 reddit inc. All rights reserved.REDDIT and the ALIEN Logo are registered trademarks of reddit inc.Advertise - localπ",
    "summary": "- Reddit's blackout protest is continuing indefinitely, with many popular subreddits still inaccessible.\n- The blackout is affecting Google searches, as old threads that used to lead to Reddit are now leading to private subreddits.\n- Users are finding it challenging to troubleshoot issues or find specific information due to the blackout. They are resorting to using cached versions of pages and alternative websites like the Wayback Machine.",
    "hn_title": "Reddit’s blackout protest is set to continue indefinitely",
    "original_title": "Reddit’s blackout protest is set to continue indefinitely",
    "score": 658,
    "hn_content": "- Reddit blackout protest continues indefinitely\n- Lemmy identified as a potential replacement for Reddit with federated system of communities\n- Reddit noted as an important repository of text-based knowledge\n- Challenges faced by Usenet and web-based forums solved by Reddit and potentially solved by Lemmy\n- Lemmy needs a more user-friendly client to improve discoverability and usability\n- Opportunity for Reddit clients to transition to Lemmy and bring their userbase\n- Lemmy needs an interoperability layer and UI improvements to enhance adoption\n- The fediverse offers a vision of how to manage communications as a society\n- Fediverse requires user involvement and participation in decision-making\n- User onboarding process for the fediverse needs improvement and simplification\n- Beehaw instance defederated from lemmy.world due to trolls and moderation concerns\n- Beehaw's defederation seen as a feature rather than drama\n- Average users want an easy-to-use platform with good governance\n- Criticism of federation model due to confusion and inconvenience for non-technical users\n- Federation model compared to email and diversity of email servers\n- Users have identities on the server they register with, can interact with users on other servers\n- Lemmy.world recommended as a starter server, but issues with rapid growth and low-effort content\n- Lemmy.world currently experiencing technical issues and performance problems\n- Challenges of federation related to spam, moderation, and governance are ongoing concerns\n- User-friendly clients and improved UI expected as the technology evolves\n- The fediverse offers a decentralized alternative to traditional social media platforms- The user discusses the usability of Lemmy and the challenges it currently faces.\n- They mention that Lemmy has improved since they first encountered it and that they've found the effort to learn something new rewarding.\n- There is a debate about the advantages of centralized versus decentralized platforms, with some arguing that centralization is convenient and user-friendly, while others emphasize the importance of decentralized services to avoid dependency on corporations.\n- The potential for a centralized \"sink\" or client in the federated model is discussed as a way to bridge the gap between centralized and decentralized platforms. \n- Some users express skepticism about the mass adoption of federated services and highlight the challenges of discoverability and onboarding for non-technical users.\n- The importance of meeting the needs of users and providing a seamless user experience is emphasized, particularly in relation to the migration from Reddit to alternative platforms like Lemmy.\n- The potential for growth and community building within the federated model is acknowledged, but the need for better user interfaces, discoverability, and cross-instance interaction is highlighted.\n- The limitations of centralized platforms are discussed, including issues of control, censorship, and the concentration of power in the hands of a few companies.\n- The challenges faced by federated services in terms of development, adoption, and scalability are acknowledged, along with concerns about moderation and content control.\n- The potential for online communities to find alternatives to centralized platforms like Reddit is seen as a positive step towards more user control and meaningful interactions.- The post discusses the concept of federation and its implications for online communities.\n- The expectation is that different communities in different instances will compete and become the primary places for specific topics.\n- There is no built-in solution to aggregate different communities on the federated network, similar to how subreddits on Reddit compete against each other.\n- Many servers have explicit federation block lists, allowing them to control which instances they federate with.\n- There is a discussion about the legality and feasibility of scraping and re-populating posts from Reddit to create a baseline of content for new communities on platforms like Lemmy.\n- The topic of copyright infringement and fair use is brought up in relation to this idea.\n- The issue of funding and moderation is addressed, with various suggestions for how independent servers can handle costs and moderation responsibilities.\n- There are mixed opinions about the user experience and practicality of the federated network, with some users expressing concerns about the complexity and lack of mainstream appeal.\n- The potential for an aggregator that combines content from different instances is discussed, with suggestions for how it could improve the user experience.\n- Some users mention issues with logging in and accessing the Lemmy platform.\n- A comparison is made between Lemmy and Reddit, with some users expressing a preference for the simplicity and familiarity of the Reddit platform.\n- Questions about RSS feeds, browsing without logging in, and mobile apps are raised by users.\n- The potential for monetization and revenue-sharing models on federated platforms is mentioned, with suggestions for how servers can cover costs and generate income.\n- There is a discussion about the challenges and possibilities of creating a more decentralized and versatile social network using federation.\n- The concept of identity and portability within the federated network is brought up, with suggestions for how it can be improved.\n- The importance of moderation, community funding, and server scalability are mentioned as key considerations for the success of federated platforms.\n- Some users express skepticism about the feasibility and widespread adoption of the federated network, while others highlight its potential benefits and alternatives to centralized platforms.",
    "hn_summary": "- Lemmy is seen as a potential replacement for Reddit with its federated system of communities.\n- Challenges faced by Usenet and web-based forums that were solved by Reddit could potentially be solved by Lemmy.\n- There is a discussion about the advantages and disadvantages of centralized versus decentralized platforms, with some emphasizing the importance of decentralized services to avoid dependency on corporations."
  },
  {
    "id": 36347711,
    "timestamp": 1686868713,
    "title": "Reddit Threatens to Remove Moderators from Subreddits Continuing Blackouts",
    "url": "https://www.macrumors.com/2023/06/15/reddit-threatens-to-remove-subreddit-moderators/",
    "hn_url": "http://news.ycombinator.com/item?id=36347711",
    "content": "Reddit Threatens to Remove Moderators From Subreddits Continuing Apollo-Related BlackoutsThursday June 15, 2023 3:20 pm PDT by Juli CloverAs some subreddits continue blackouts to protest Reddit's plans to charge high prices for its API, Reddit has informed the moderators of those subreddits that it has plans to replace resistant moderation teams to keep spaces \"open and accessible to users.\"In a comment shared by r/Apple moderator @aaronp613, Reddit cited its Moderator Code of Conduct and said that it has a duty to keep communities \"relied upon by thousands or even millions of users\" operational. Mods who do not agree to reopen subreddits that have gone private will be removed.If a moderator team unanimously decides to stop moderating, we will invite new, active moderators to keep these spaces open and accessible to users. If there is no consensus, but at least one mod wants to keep the community going, we will respect their decisions and remove those who no longer want to moderate from the mod team.Between Monday and Wednesday of this week, the majority of popular subreddits on the Reddit site participated in a \"blackout\" and went private or stopped allowing new posts to be made in order to protest planned API changes that will cause the shutdown of popular third-party Reddit apps like Apollo.Reddit is just digging the hole deeper and deeper. They are essentially threatening moderators of subreddits that are blacking out indefinitely that they will be removed. https://t.co/IeU3inmyf4 pic.twitter.com/HF4t3EO1JS — Aaron (@aaronp613) June 15, 2023The move was aimed at pushing Reddit to enact fairer pricing for developers and to give developers more time to adopt the API changes, but Reddit opted to wait out the protests rather than make adjustments.As a result, some subreddits such as r/Apple made the decision to continue the blackout indefinitely, which means millions of Reddit users no longer have access to those communities. It seems Reddit plans to forcibly end further blackouts by removing entire moderation teams that are participating.On Monday, Reddit CEO Steve Huffman said that the blackouts had not caused \"any significant revenue impact so far\" and that while there was a \"lot of noise\" amid the planned two-day protest, it would \"pass.\" In an interview with The Verge today, Huffman further said that Reddit's API was \"never designed to support third-party apps\" and that the apps don't add much value to the site. Reddit created its API for \"tools, bots and enhancements to Reddit,\" according to Huffman.Huffman confirmed that the blackouts have made no change to Reddit's API pricing plan. \"That's our business decision, and we're not undoing that business decision,\" said Huffman. Huffman said in the interview that Reddit will not force communities to reopen, which contradicts the messaging that moderators are receiving.Reddit also just published a blog post with \"key facts\" about the API updates. In the post, Reddit says that \"dissent, debate, and discussions are foundational parts of Reddit,\" and that it respects the right of its community to protest, so long as mods follow the Moderator Code of Conduct. The Moderator Code of Conduct is what Reddit is citing in messaging to moderators about moderation teams being removed from closed communities.Moderators and Reddit users are unhappy with Reddit's decision to charge an unreasonable amount for its API, and for the short 30-day timeline that third-party developers have been given to adopt the new API fees.Apollo developer Christian Selig determined that adopting the API would cost him $20 million per year, leading him to decide to shut down his app on June 30, a day before Reddit begins charging. As of July 1, there will be few if any third-party apps for viewing Reddit content, pushing Reddit users to either the Reddit website or the Reddit app.Tags: Apollo, Reddit[ 290 comments ]",
    "summary": "- Reddit threatens to remove moderators from subreddits that continue blackouts protesting the company's plans to charge high prices for its API.\n- Reddit cites its Moderator Code of Conduct and states that it has a duty to keep communities operational.\n- Some subreddits, such as r/Apple, have decided to continue the blackout indefinitely, resulting in millions of users losing access to those communities.",
    "hn_title": "Reddit Threatens to Remove Moderators from Subreddits Continuing Blackouts",
    "original_title": "Reddit Threatens to Remove Moderators from Subreddits Continuing Blackouts",
    "score": 629,
    "hn_content": "- Internet communities created on sites like Facebook, Twitter, and Reddit are only allowed to exist as long as they generate profit for the intermediaries.\n- Users are realizing that they are less dependent on social media than they imagine and can disengage from it.\n- Reddit successfully centralized forums and made it convenient, but now suffers from issues like subtle advertising campaigns and difficulty finding valuable conversation and folk knowledge.\n- The problem with social media is that it reduces human connection to profitability and can be toxic, exploitative, and manipulative.\n- New networks and platforms, such as federated social media and self-hosted forums, are emerging as alternatives to centralized platforms.\n- The cost of running social media platforms is relatively small compared to the value they provide, and there are potential models for non-profit alternatives.\n- The current state of social media is a reflection of the profit-driven nature of capitalism and the need for constant growth and monetization.\n- Creating a public, non-profit alternative to social media could offer a more sustainable and user-centric platform.\n- The closure of API access and restrictions on third-party Reddit clients may negatively impact user experience and communities.\n- The future of social media lies in exploring alternative models and platforms that prioritize user control and privacy.- Subreddit moderators are protesting against Reddit's recent changes and policies.\n- Some users are considering finding alternative web communities for specific interests.\n- The CEO's statements about the impact of third-party apps and the importance of keeping subreddits open are contradictory.\n- The blackout of subreddits may impact the quality of moderation and content in the short term.\n- The disagreement between Reddit admins and moderators highlights the power dynamics and tensions within the platform.\n- The future of Reddit and its implications for the future of the internet are being discussed.",
    "hn_summary": "- Internet communities reliant on social media platforms like Facebook, Twitter, and Reddit are realizing their dependence on profit-driven intermediaries.\n- Emerging alternatives to centralized platforms, such as federated social media and self-hosted forums, are gaining traction.\n- The tension between Reddit admins and moderators highlights power dynamics and the need for user-centric platforms."
  },
  {
    "id": 36346254,
    "timestamp": 1686861754,
    "title": "My 24 year old HP Jornada can do things an iPhone still can't do",
    "url": "https://raymii.org/s/blog/My_24_year_old_HP_Jornada_can_do_things_your_modern_iPhone_still_cant_do.html",
    "hn_url": "http://news.ycombinator.com/item?id=36346254",
    "content": "Raymii.orgQuis custodiet ipsos custodes?Home | About | All pages | Cluster Status | RSS Feed | GopherMy 24 year old HP Jornada can do things your modern iPhone still can't do!Published: 15-06-2023 01:30 | Author: Remy van Elst | Text only version of this articleTable of ContentsBow for me for I am rootLinux on the Jornada 720 in 2023Users should be in control of their devicesI like to tinker with old hardware. The DEC PDP-8 is my favorite retro computer and Office 2003 is the best version ever released IMHO. One of my other favorite retro devices is the HP Jornada 720. A small handheld PC (smaller than a netbook) running Windows CE or in my case, Linux. It has a decent keyboard, CFL backlit screen, 32 MB of RAM(!), a compact Flash card for storage and a stylus for the resistive touchscreen. Oh and I got a 10Mbit PCMCIA network card, but wireless cards are also still available. It might be old, released in 1999, but can do one thing your modern iPhone can't.You can develop, compile and run native software on it. It has a C and C++ compiler, Python is available as well as Perl so it is a full fledged development workstation. Not only can you develop software on it, it can run that software as well.Recently I removed all Google Ads from this site due to their invasive tracking, as well as Google Analytics. Please, if you found this content useful, consider a small donation using any of the options below:I'm developing an open source monitoring app called Leaf Node Monitoring, for windows, linux & android. Go check it out!Consider sponsoring me on Github. It means the world to me if you show your appreciation and you'll help pay the server costs.You can also sponsor me by getting a Digital Ocean VPS. With this referral link you'll get $100 credit for 60 days.Screenshot of GCC compiling my codeScreenshot of my compiled code runningHere is a review of the device running standard Windows CE and here is an other review including a comparison to its predecessor, the Jornada 680. NCommander has an excellent video on the 680e and the use of the device at the Dutch Railways (NS). In the past I also had a NS 680e but the battery went bad, bricking the entire unit, so I sadly had to throw that away. The Jornada 720 cost me 80 EUR on the Dutch CraigsList (marktplaats), used, but boxed including the manual and software CD-ROM.Gaming on the HP Jornada, OpenTTD is my favorite game. Doom is also available.Bow for me for I am rootI have a rule that I try to adhere to for devices I own. They must allow a means of root or administrative actions. The Nintendo Switch I got second hand is old enough to be jailbroken. The two Apple devices I own (a first gen iPad Air and first-gen iPhone SE) have vulnerabilities that give me root access. All Android phones I owned I've specifically bought because the bootloader can be unlocked. Once I buy a device, it is mine and I decide what to do with it. Not the manufacturer. Otherwise it is e-waste the moment it leaves the factory.Being able to develop software on a device is almost a must have as well for me. Missing functionality, otherwise known as stuff the manufacturer does not make (enough) money on, can be programmed back in as long as you can develop on a device and are willing to put in enough time and/or money.Or, using a very much capable computer for things the manufacturer did not think of or were no apps for. Remember the Polish garage that still uses a Commodore 64 for their business?Modern phones, both Android and iPhone devices, cannot easily program applications on the device itself, they require a second device, namely a computer (Mac or hackingtosh for iPhones even) that can develop and compile software for the device. And in the case of Apple, it is even up to them to allow you to run software on the device. Such a monopoly should be forbidden by law.Back in the day the Commodore 64 and other home computers booted up into Basic and the only thing you could do was program the device (or start a game). I might be an outlier because my main PC is a Raspberry Pi and my backup Windows laptop is a 2014 Medion model, but with an upgraded SSD and more RAM. The Intel Core i7 in that beast is more than capable, so why replace it?Linux on the Jornada 720 in 2023This HP Jornada, a device released in 1999, allows you to develop and run software on it. A third party linux distro is available, JLime, even in 2023 thanks to HPCfactor. JLime was released around 2008.The JLime desktopSomeone else has a modern Debian working on it. With the full size mini keyboard and 5 hours of battery life mine still has (or more if you replace the cells) it's a perfect little pocket-able device.JLime build version infoI've uploaded the working JLime I use to Archive.org. The HPCFactor version had issues unpacking for me, I think my tar version is too new, it complained about not finding the next header file.A bit of fiddling is required in 2023 to get Linux running. The modern Debian/Devuan is way to slow in my opinion (although a marvel of engineering, getting such a modern distro running on an old device).Mini Mozilla browser on JLimeThe JLime distro, with a 2.6.25 kernel is much faster. For jotting down notes or Pocket Paint or a game of SimCity, Windows CE is fine. Pocket Word is more than capable as is Abiword or your favorite terminal text editor.Jotting down some notes in AbiWordFor software development, Linux is a must. To develop for Windows CE you'll need a PC with Visual Studio, the same issue as modern iPhone's have. There are some GCC versions for Pocket PC lingering online but I couldn't get them to work.Dillo, a text based browser on JLimePartitioning your compact flash card isn't that hard, nor is copying some files to it to run Linux. With the JLime build I'm using GCC is included but the development headers were not, so I couldn't include <iostream> or stdio.h.However, because I have the PCMCIA network card and because HPCfactor still runs an online repository, installing packages is easy, in my case just an ipkg install libstdc++-dev away:Users should be in control of their devicesSo is this realistic? Would I prefer this Jornada over a modern iPhone? Probably not. Would I like an iPhone or iPad that can develop software on it, for itself? Yes absolutely.Is it a technical issue? Totally no, those new devices are more than capable computers. It's purely a management / money issue. Apple does not get their 30% or 15% cut, so they prefer selling you e-waste in the hope that you buy a new one after a year. And of course that accompanying Mac for app development.On the Android side this is a bit better. Often bootloaders can be unlocked allowing for things like PostmarketOS being installed when the device reached its manufacturer-decided end of life (no more software updates on otherwise capable hardware).I have the same Poco F1 as Drew DeVault, also running PostmarketOS. It runs Qt Creator just fine allowing me to program on the device.You can even run Clion (a C++ ide) on Android, or just about any other Linux distro / application on most Android devices via a bunch of different apps. This allows for most Android to surpass the manufacturers end of life due to them no longer providing software updates.Boy do I miss the good old days, where devices were programmable by their owners instead of just e-waste consumption slabs.How many devices do you have lying in a drawer somewhere that are just fine hardware wise, but lack the software updates or development capabilities to be useful today?Tags: apple , blog , c++ , cpp , debian , development , historical , hp , ipad , iphone , jlime , jornada , mobile , openttd , outlook , pda , pocket-pc , windows-ce , windows-mobileHome | About | All pages | Cluster Status | Generated by ingsoc.",
    "summary": "- The author discusses their favorite retro device, the HP Jornada 720, which is a small handheld PC released in 1999 and runs Windows CE or Linux.\n- Unlike modern iPhones, the Jornada 720 can be used for software development - it has a C and C++ compiler, Python, and Perl, making it a full-fledged development workstation.\n- The Jornada 720 can run native software and has the ability to develop, compile, and run software on the device itself, unlike modern phones that require a separate computer for development.\n- The author emphasizes the importance of users being in control of their devices and being able to develop and program on them instead of just being consumers of e-waste.\n- The author also mentions the availability of third-party Linux distros for the Jornada 720, such as JLime, which allows for a faster and more versatile experience.",
    "hn_title": "My 24 year old HP Jornada can do things an iPhone still can't do",
    "original_title": "My 24 year old HP Jornada can do things an iPhone still can't do",
    "score": 616,
    "hn_content": "- The debate around Apple's walled garden and user control of devices\n- Some users prefer the walled garden for security and ease of use\n- Others argue for more openness and the ability to install alternative software\n- Historical context of Apple's approach and comparisons to other platforms like Android and Mac\n- The potential trade-offs between security and user freedom\n- The current market dominance of Apple and the impact of their decisions on the industry\n- The discussion touches on different perspectives and experiences with different tech products- Illumos camp is separate from Solaris but evolving in its own direction\n- Oracle's closure of OpenSolaris led to the formation of Illumos\n- Users in the community have a negative view of Oracle\n- Apple is seen as a Unix vendor due to licensing the Unix trademark\n- Apple's tight control over their ecosystem allowed them to restrict Facebook's app\n- Governments could potentially regulate apps like Apple did to Facebook\n- Alternative platforms exist but may not have the same level of mass appeal\n- The debate about walled gardens vs. open platforms is ongoing\n- Some readers may prefer the convenience and security of a walled garden, while others value the freedom of open platforms\n- The limitations of iOS and Android platforms are discussed\n- The Steam Deck is mentioned as an alternative option with more flexibility\n- Personal preferences play a role in the choice between walled gardens and open platforms\n- Some users want a device that \"just works\" without the need for configuration or customization- Android offers a variety of choices and customization options, but this can lead to decision overload and data loss when trying different ROMs, SMS clients, and browsers.\n- iOS, on the other hand, offers a simpler experience with just iMessage, Safari, and the iOS operating system.\n- Some users prefer the walled garden approach of Apple because it ensures a curated and well-maintained ecosystem, reducing the risk of encountering malicious apps or privacy violations.\n- Android, while also having a level of security, allows for more flexibility with the ability to install APK files from the web or use alternative app stores like F-Droid.\n- Apple's App Store policies and enforcement help protect users from scams and low-quality apps, although there are still some issues with the store's content.\n- Walled gardens like Apple's ecosystem can provide higher-quality applications, improved security, longer support lifecycles, consistent user experiences, and better interoperability with other Apple devices.\n- Some users appreciate the simplicity and reliability of Apple devices, especially for tasks like making calls, reading websites, checking weather, and using maps.\n- The walled garden approach may not appeal to everyone, but it can be seen as a trade-off between customization and stability/security.\n- The discussion also touches on the lawsuits and controversies surrounding Apple, including their control over software and hardware, lightning cables, and right-to-repair infringements.\n- It isn't just Apple that implements a walled garden approach, as Google has been moving towards locking down Android as well.\n- The debate highlights the differing opinions and preferences among technically-minded individuals regarding the benefits and drawbacks of walled gardens.",
    "hn_summary": "- The debate centers around Apple's walled garden and user control of devices.\n- Some users prefer the walled garden for security and ease of use, while others argue for more openness and the ability to install alternative software.\n- The discussion also includes historical context, comparisons to other platforms like Android and Mac, trade-offs between security and user freedom, and the current market dominance of Apple."
  },
  {
    "id": 36342931,
    "timestamp": 1686846463,
    "title": "Sequence diagrams, the only good thing UML brought to software development",
    "url": "https://www.mermaidchart.com/blog/posts/sequence-diagrams-the-good-thing-uml-brought-to-software-development",
    "hn_url": "http://news.ycombinator.com/item?id=36342931",
    "content": "Sequence diagrams, the only good thing UML brought to software development15 June 2023·12 minsSequence diagrams really shine when you’re documenting different parts of a system and the various ways these parts interact with each other.A sequence diagram describes the operations within a system and maps what and when messages are sent.In its simplest form, a sequence diagram could model the messages and flow between a user and their bank as they log in to the banking app. In more complex forms, sequence diagrams could include alternatives, options, and loops to model conditional and divergent flows if, say, a login process also includes security, verification, and other user actions.If you haven’t used them extensively, you’ve likely heard of them in one of two contexts: One, in isolation, as a useful type of diagram to consider when writing documentation, or two, as an artifact of the now rarely used Unified Modelling Language (UML) from the late 1990s.In this article, I’m going to briefly dig into the history of UML so we can see how and why sequence diagrams survived despite most of UML getting consigned to the dustbin of software history. Then, I’ll show why sequence diagrams are still valuable and how you can make the best use of them.My interest comes from two sources: I think sequence diagrams are underrated and underused, and I think sequence diagrams are an ideal use case for MermaidChart because it allows users to choose informal simplicity over the rigid complexity that results from using older tools like IBM’s Rational Rose.The rise and fall of UMLUML originally came out in 1997 and as Martin Fowler wrote in the preceding years, the primary purpose was to “eliminate the bedlam that had overtaken graphical modeling languages in the object-oriented world.” The basic problem – one that has been repeated many times throughout the history of software – is that there was chaos and confusion and a real desire to introduce a standard that would provide clarity.Rational Software started developing UML in 1994; the Object Management Group (OMG) accepted it as a standard in 1997; and the International Organization for Standardization (ISO) adopted it as an accepted standard in 2005.The rise of UML saw excitement and criticism even as it became a standard (at least on paper). Many loved it but many either had problems with UML itself or with how people were using it. Death by UML Fever, a 2004 piece from a Boeing software architect, captures some of the complaints.Here, the author writes that “No other technology has so quickly and deeply permeated the software-engineering life cycle quite like UML” and argues that UML had become a vehicle for people without software experience to design and control the software development process.In the years since, a few obituaries have been written, including a 2018 piece from Ivar Jacobson (who was VP at Rational Software when UML was becoming a standard), a 2021 piece from Hillel Wayne (who interviewed some of the major people from those days, such as Grady Booch and Bertrand Meyer), and a 2022 piece from Laurence Tratt (who was directly involved in UML’s standardization).These pieces are all worth reading but they all settle on an essentially similar explanation: UML got too complex (the UML 2.2 documentation, for example, was over 1,000 pages long and UML became associated with burdensome and often wasteful pre-work.UML’s life beyond deathWe’re talking, at this point, about a methodology that’s almost 30 years old – a methodology that its proponents and its detractors agree is essentially dead.And yet, as a 2014 study showed – contrary to the researchers’ own expectations – most of the developers and software architects they served were creating sketches and diagrams that “contained at least some UML elements.” The researchers noted that “most of them were informal,” but still, this is a surprisingly powerful life beyond death.Occasionally, the topic comes up directly and we can see how people talk about modern-day UML. In this HackerNews thread, for example, a user asks whether learning UML is worth their time, and while most users agree UML itself is useless, many also suggest learning a few UML techniques (sequence diagrams chief among them).One user even wrote that “The reward of the clarity of sequence diagrams is worth the pain and boredom of learning all the others at university,” which is a pretty strong recommendation if I’ve ever seen one. An even stronger recommendation comes from Mark Watson, who co-wrote an entire book about UML but now says that “Sequence diagrams are the only type of diagrams I use anymore.”We can trace the survivability of sequence diagrams back to UML’s origins. In the heyday of UML, Martin Fowler identified three use cases for UML: sketching, blueprinting, and programming.The programming use case died because, according to Hillell Wayne, “even most proponents of UML considered it a terrible idea.” The blueprinting use case actually appeared to be the strongest one but died out too because the use case had been tied to Rational Software and to CASE tools – both of which died and took UML with them.The first use case – sketching – survived but it “drifted into multiple, mutually unintelligible dialects,” according to Wayne. Tratt agrees, writing that with hindsight, UML had reached its peak in 2000 “as a medium for software sketching.”A medium for sketching is a much humbler vision than what UML proponents had imagined but we shouldn’t let that undervalue what remains – especially when it comes to sequence diagrams.Sequence diagrams out of the ashesSequence diagrams survived not just because they were the best of a bad bunch but because they’re genuinely useful. As I wrote above, the gist of sequence diagrams is that you can use them to easily map and visualize the dynamic flow of messages across a system.Message flows can get really complex but sequence diagrams provide two main components that create the backbone of the diagram:Lifelines, which represent objects and the processes between them.Messages, which represent the information exchanged over time.The base components have to be simple because a sequence diagram is meant to represent a system in action, meaning the represented components will be running simultaneously, in order, and in parallel. A good sequence diagram shows the flow, the messages exchanged between objects, and the function performed before the lifeline “dies.”The primary use cases for sequence diagrams are:Sketching and designing how a system is supposed to work before building it.Documenting the requirements of a new system.Breaking down and understanding an existing (often legacy) system.A sequence diagram can’t (and shouldn’t) capture an entire system so in these use cases, the best methods involve using them to visualize how a system is used, diagram the logical flow of a particular process, or map out the functionality of a service.Sequence diagrams really shine when you’re documenting different parts of a system and the various ways these parts interact with each other. Sequence diagrams don’t work as well when you’re trying to, for example, model an algorithm in a specific system. If you get too granular and too detailed, sequence diagrams become too much trouble than they’re worth. But when you use them to map out different “black boxes” and show how they talk to each other, they can be really helpful.But like other diagrams, sequence diagrams succeed in proportion to how well you make them. Their quality, however, isn’t dependent on sheer effort but requires a careful, thoughtful approach based on starting from the core process and working outward toward the edge cases.Design sequence diagrams from the inside outThere are many reasons why you might want to make a sequence diagram, but no matter the inspiration, the best way to make a sequence diagram and solve the original problem is to start from the inside and work your way out and through.Start with the happy path and work to the edge casesWhen you sit down to create a sequence diagram, might be tempting to begin with the edge cases because the edge cases are often the most complex and the most in need of clarification.Often, it’s the possibility of an edge case (if you’re creating a sequence diagram to support architecture design) or an already present, already troublesome edge case (if you’re creating a sequence diagram to better understand legacy software) that inspires the creation of a sequence design. But even if your primary goal is to clarify those edge cases, you’ll create a better sequence diagram if you start from the happy path first.When you start, identify the happy path – the ideal way messages flow from beginning to end. Once you diagram this core sequence, you can work outward to other routes and more infrequent message flows.For example, using the banking application login example, it’s best to start with the happy path – customers requesting access and the bank granting that access. Starting from this core flow ensures that as you think through and document divergent flows and edge cases, the happy path remains your anchor.From there, you can layer in more complexity to the happy path. In the below example, we’ve added a few more components, including an authentication service and a database, but the core happy path remains central.Starting with the happy path provides clarity, ensuring that when you shift to the edge cases, you know how the sequence is supposed to run and know why a user might be encountering an edge case. Building up and out from the happy path is also the best way to avoid overcomplicating the final diagram.Comprehensibility > ComprehensivenessThe most common failure mode for sequence diagrams is over-complication. (This also is the failure mode for most diagrams, as I wrote in an article on flow charts).One of the best people to refer to here is Martin Fowler, who wrote (almost twenty years ago) that the primary value of drawing diagrams is communication. “Effective communication,” Fowler writes, “means selecting important things and neglecting the less important.”The neglect is the tough part. Because the purpose of diagramming is communication, it’s essential to strip away some information so as to clarify other information. Fowler reminds us that “the code is the best source of comprehensive information,” so diagrams – by nature – shouldn’t be comprehensive (that’s what the code is for). Fowler puts it well, writing that “comprehensiveness is the enemy of comprehensibility.”You can see this well in the sequence diagram below, which a developer cited in a PR to request that the team “consider abstracting away less important information from the diagram so that the reading developer can focus on the important ideas.”In his article on the death of UML, Thomas Beale writes that the main reason UML became overly complex is that the creators tried to “define a single meta-model” that could provide all the elements necessary for over a dozen diagram types. Beale argues that “Each type of diagram in fact represents a specific conceptual space, which needs its own specific model.”UML itself died, in part, because it added complexity instead of providing clarity. This is useful to remember today because – just as UML died – so will any given sequence diagram fail if it gets overly complex.Big picture > DetailsIf the former problem is a result of being too comprehensive and too broad, the next problem is a result of being too detailed and too narrow.In Alex Bell’s article on UML Fever, one of the many “strains” he describes is “Gnat’s eyebrow fever” and it’s one of the most likely problems to afflict your sequence diagrams. He describes this fever as the “very strong desire to create UML diagrams that are extremely detailed” and argues it results from the belief that diagramming granular details “increases the probability that the resulting code will be more correct.”Implementation is where the rubber meets the road, however, so if you’re building a sequence diagram so as to better inform design requirements, there’s a point in the process where it’s more efficient to stop diagraming and start coding.That said, this principle extends beyond that use case. If you’re building a sequence diagram to communicate a process in your documentation, for example, visualizing the big picture will be more useful for readers than digging deep into the details. It’s not that the details are unimportant but that too many details will impair the ability to see the big picture sequence (which is the primary goal of sequence diagrams).The same principle applies to analyzing and documenting legacy code – the detail is in the code itself so the sequence diagram will only be useful if you use it to visualize the big picture.Embrace an architectural mindset with sequence diagramsThe point of this article isn’t to look at sequence diagrams out of sheer historical curiosity. Sequence diagrams are not only an artifact of UML but an artifact of a software design mindset that emphasized rigorous designing and planning.Fowler explains that the association between diagrams and “heavyweight” processes is a result of diagramming poorly – not a result of diagramming itself. The advice throughout this article is meant to help you create better sequence diagrams but in the process, hopefully, help you better see the possibilities that result from having diagramming skills in your design and documentation arsenal.The best work comes from cycling between designing and coding – creating an upfront design, coding based on the design, and feeding what you learned from the coding work back into the design. If a diagram helps you understand a sequence, it’s “perfectly reasonable,” as Fowler writes, to throw it away after. (“Throwing it away,” however, doesn’t necessarily mean deleting it forever; it’s often helpful to put it aside so that you can return to it later if, for example, you want to think through previous work).“The point,” which Jacobson emphasizes in his article about the death of UML, “is for every sprint to lead with architectural thinking.” With sequence diagrams, in particular, you can better understand the processes at hand – making it easier to build or improve their components.AUTHORKnut SveidqvistCreator of MermaidJS and founder of Mermaid Chart←subhash-halder contributed quadrant charts so you can show your manager what to select - just like the strategy consultants at BCG do8 June 2023",
    "summary": "- Sequence diagrams are a useful way to document how different parts of a system interact with each other.\n- They are a type of diagram that maps the flow of messages and operations within a system.\n- Sequence diagrams can be used to model simple processes, like logging in to a banking app, or more complex scenarios with conditional flows.\n- Despite the decline in popularity of the Unified Modeling Language (UML), sequence diagrams have remained valuable and widely used.\n- Sequence diagrams are especially valuable for sketching and designing systems, documenting system requirements, and understanding existing systems.\n- When creating a sequence diagram, it's important to start with the main flow (the \"happy path\") and then add complexity and edge cases.\n- The key to creating a good sequence diagram is to prioritize comprehensibility over comprehensiveness.\n- Sequence diagrams should focus on the big picture and the flow of messages, rather than excessive details.\n- By embracing an architectural mindset and using sequence diagrams, software engineers can improve their design and documentation skills.",
    "hn_title": "Sequence diagrams, the only good thing UML brought to software development",
    "original_title": "Sequence diagrams, the only good thing UML brought to software development",
    "score": 522,
    "hn_content": "- Sequence diagrams are considered the most useful type of UML diagram by many developers.\n- Other UML diagrams such as class, component, package, activity, and state machine diagrams still have value in modeling system structure and behavior.\n- The popularity of different UML diagram types have shifted due to changes in development methodologies, such as the shift from Waterfall to Agile.\n- Agile development emphasizes just-in-time design and empowering developers, which can lead to less use of UML diagrams.\n- Sequence diagrams are particularly useful in a wide range of use cases and are easier to comprehend, even for non-technical audiences.\n- Some developers argue that UML is useless, but this can be seen as overlooking the benefits of having a standardized visual language for sharing design decisions.\n- UML diagrams can be enlightening for university students, as they provide a way to visually learn abstract concepts without getting caught up in practical implementation details.\n- UML can be valuable in the early phases of a project for sketching out ideas and facilitating discussion, but it may not always be necessary to maintain formal UML diagrams throughout the project.\n- Automated tools for generating UML diagrams from code can help keep them in sync, but limitations in current tools may hinder their effectiveness.\n- Different diagram types within UML, such as data flow diagrams, may be more appropriate for certain use cases than others.\n- Some developers prefer to use whiteboards or other informal visual tools for quick, ad-hoc diagramming, rather than strict adherence to UML.\n- The choice of using UML diagrams or other visual tools ultimately depends on the needs and preferences of the development team, as well as the specific requirements of the project.\n- The inclusion of UML in university curricula may vary, but it can serve as a useful teaching tool for introducing concepts of software design and modeling.\n- The post sparked discussion on the relevance and value of UML in modern software development practices.- The article discusses the usefulness of sequence diagrams in UML for understanding complex software systems.\n- Sequence diagrams allow developers to visualize the flow of interactions between different components in a system.\n- The simplicity of sequence diagrams makes them more comprehensible than other types of UML diagrams.\n- UML, while beneficial for documentation purposes, can be bloated and overwhelming if not used effectively.\n- The article raises the point that the industry went overboard with UML and instead emphasizes the value of sequence diagrams for practical purposes.\n- The author suggests that software developers should focus on creating simple and readable sequence diagrams rather than getting caught up in the larger UML framework.",
    "hn_summary": "- Sequence diagrams are considered the most useful type of UML diagram by many developers.\n- UML diagrams can be enlightening for university students, as they provide a way to visually learn abstract concepts without getting caught up in practical implementation details.\n- The post sparked discussion on the relevance and value of UML in modern software development practices."
  },
  {
    "id": 36339777,
    "timestamp": 1686833755,
    "title": "Our Plan for Python 3.13",
    "url": "https://github.com/faster-cpython/ideas/blob/main/3.13/README.md",
    "hn_url": "http://news.ycombinator.com/item?id=36339777",
    "content": "Our plan for Python 3.13Author: Mark Shannon, Michael DroettboomOverviewThe plan for 3.13 is similar to early plans for 3.12.The big difference is that we have now finished the foundational work that we need:Low impact monitoring (PEP 669) is implemented.The bytecode compiler is a much better state.The interpreter generator is working.Experiments on the register machine are complete.We have a viable approach to create a low-overhead maintainable machine code generator, based on copy-and-patch.We plan three parallelizable pieces of work for 3.13:The tier 2 optimizerEnabling subinterpreters from Python code (PEP 554).Memory managementThe tier 2 optimizerSee Tier 2 optimizer for an explanation of what the tier2 optimizer is.The workplan is roughly as follows:Get the tier 2 interpreter workingGenerate (poor quality) superblocksImplement basic superblock managementIn parallel:Add support for deoptimization to superblocksEnhance the superblock creation codeImplement the specializerImplement the partial evaluatorImplement the copy-and-patch machine code generatorBuild-time integrationGeneration of tier 2 codeOur goal for 3.13 is to reduce the time spent in the interpreter by at least 50%.Detailed plan. Detailed plan for copy-and-patch.Enabling subinterpreters from PythonUnlike the other tasks, which are mainly focused on single-threaded performance, this work builds on the per-interpreter GIL work that shipped in Python 3.12 to allow Python programmers to take advantage of better parallelism in subinterpreters from Python code (without the need to write a C extension).A draft PEP 554 already exists for this work. The first step will be to get it updated and push for an early approval, so we can change course if necessary.Detailed plan.Better memory managementThe profiling data shows that quite a large amount of time spent is spent in memory management and cycle GC. That fraction will only get larger as we speed up the rest of the VM.Unlike the tasks above, we are less certain about the appropriate solutions, so some more research and experimentation is required first. We plan to do this as a side project based on what we learn from the Tier 2 work above.We want to:Do fewer allocations by improving data structures*Spend less time doing cycle GCs. This could be as simple as doing fewer collections, or as complex as implementing a new, incremental cycle finder.TODO: Create issues for investigationList our detailed strategy and workplan for improving allocation/deallocation speed and reducing cycle GC overhead.* We also hope that partial evaluation will reduce the number of temporary objects, but that is in the scope of the tier 2 optimizer, not memory management.",
    "summary": "- The plan for Python 3.13 is similar to the previous plan for 3.12, but with some important differences.\n- Key improvements have been made in low impact monitoring, bytecode compiler, interpreter generator, and register machine experiments.\n- Three main areas of focus for Python 3.13 are the tier 2 optimizer, enabling subinterpreters from Python code, and better memory management.",
    "hn_title": "Our Plan for Python 3.13",
    "original_title": "Our Plan for Python 3.13",
    "score": 489,
    "hn_content": "- The Python community is divided on the issue of removing the GIL (global interpreter lock) from CPython.\n- The \"Faster Python\" team wants to maintain the GIL to focus on their own goals, while the \"No GIL\" project aims to remove it for improved concurrency.\n- Removing the GIL could have a performance impact on single-threaded code but could open up new opportunities for concurrency APIs.\n- The Python community has experienced similar controversies before (e.g., the switch from Python 2 to Python 3) and has overcome them.\n- There are concerns about compatibility with existing C extensions and the potential impacts on the wider ecosystem.\n- Some propose a hybrid approach, with both GIL and no-GIL options available, while others argue that removing the GIL would be too complex and disruptive for the community.\n- Overall, the post highlights the ongoing debate and the potential future developments related to Python 3.13.- The Python GIL (Global Interpreter Lock) has been a long-standing issue for Python developers, limiting performance and concurrency.\n- The PyO3 project aims to address the limitations of the GIL by introducing sub-interpreters, which allow for parallel execution within Python.\n- Removing the GIL would require significant changes to Python, including modifying static declarations and introducing locks.\n- The impact of removing the GIL on single-threaded performance is estimated to be around 10%.\n- There are concerns about the potential fragmentation of the Python community if the no-GIL project is merged.\n- Python's packaging and distribution ecosystem has historically been challenging, with no single source of truth or standardized approach.\n- The Faster Python project aims to improve the performance of Python in various ways, including optimizing the interpreter and introducing new features.\n- Single-threaded performance is still important for many applications, and Python's ease of development is a significant advantage.\n- There is ongoing discussion and debate within the Python community about the best approach to address issues with the GIL and improve performance and concurrency.",
    "hn_summary": "- The Python community is divided on whether to remove the GIL from CPython.\n- Removing the GIL could impact single-threaded code performance but could enhance concurrency APIs.\n- There are concerns about compatibility with existing C extensions and potential impacts on the wider ecosystem."
  },
  {
    "id": 36338529,
    "timestamp": 1686824956,
    "title": "Effective Rust (2021)",
    "url": "https://www.lurklurk.org/effective-rust/",
    "hn_url": "http://news.ycombinator.com/item?id=36338529",
    "content": "1. Cover2. Introduction3. Types3.1. Item 1: Use the type system to express your data structures3.2. Item 2: Use the type system to express common behaviour3.3. Item 3: Avoid matching Option and Result3.4. Item 4: Prefer idiomatic Error variants3.5. Item 5: Familiarize yourself with standard traits3.6. Item 6: Understand type conversions3.7. Item 7: Embrace the newtype pattern3.8. Item 8: Use builders for complex types3.9. Item 9: Familiarize yourself with reference and pointer types3.10. Item 10: Consider using iterator transforms instead of explicit loops3.11. Item 11: Implement the Drop trait for RAII patterns3.12. Item 12: Prefer generics to trait objects3.13. Item 13: Use default implementations to minimize required trait methods4. Concepts4.1. Item 14: Understand lifetimes4.2. Item 15: Understand the borrow checker4.3. Item 16: Avoid writing unsafe code4.4. Item 17: Be wary of shared-state parallelism4.5. Item 18: Don't panic4.6. Item 19: Avoid reflection4.7. Item 20: Avoid the temptation to over-optimize5. Dependencies5.1. Item 21: Understand what semantic versioning promises5.2. Item 22: Minimize visibility5.3. Item 23: Avoid wildcard imports5.4. Item 24: Re-export dependencies whose types appear in your API5.5. Item 25: Manage your dependency graph5.6. Item 26: Be wary of feature creep6. Tooling6.1. Item 27: Document public interfaces6.2. Item 28: Use macros judiciously6.3. Item 29: Listen to Clippy6.4. Item 30: Write more than unit tests6.5. Item 31: Take advantage of the tooling ecosystem6.6. Item 32: Set up a continuous integration (CI) system7. Beyond Standard Rust7.1. Item 33: Consider making library code no_std compatible7.2. Item 34: Control what crosses FFI boundaries7.3. Item 35: Prefer bindgen to manual FFI mappings8. IndexEffective RustEffective Rust35 Specific Ways to Improve Your Rust CodeDavid Drysdale",
    "summary": "- This post is about improving your Rust code and using best practices.\n- It covers various aspects including types, concepts, dependencies, and tooling.\n- The post provides specific tips and recommendations to write more efficient and optimized Rust code.",
    "hn_title": "Effective Rust (2021)",
    "original_title": "Effective Rust (2021)",
    "score": 374,
    "hn_content": "- This post discusses the concept of effective Rust programming.\n- Some readers have pointed out potential flaws or disagreements with the author's recommendations, particularly regarding the use of panic! and Result<T,E>.\n- The author uses examples and comparisons with C++ to explain Rust concepts, which may be useful for readers familiar with C++.\n- There may be errors or inconsistencies in the content, which could impact its overall credibility.\n- The post focuses on the importance of writing readable and maintainable Rust code, even if it means sacrificing some of the language's more advanced features.\n- It emphasizes that you can still benefit from Rust's type safety and performance without using the full breadth of the language's capabilities.- Rust is a programming language that has been around since 1995 and is currently in a good state overall.\n- Rust is not just suitable for specific use cases, such as embedded systems, but also for scenarios where fast, low-level, bare-metal, or standalone executable code is needed.\n- Some people compare Rust to C and consider Rust to be a better alternative.\n- Rust books and resources, like the one mentioned in the comments, can provide helpful guidance for writing more effective Rust code.\n- There are discussions and debates about certain recommendations in the book, such as avoiding matching Option and Result and embracing the newtype pattern.\n- The use of smart pointers like Rc and RefCell can be useful in certain cases, but their usage should be considered carefully, as they can be overused or lead to issues if not used properly.\n- Iterators and iterator transforms are recommended as an alternative to explicit loops, but it's important to balance readability and complexity when using these methods.\n- Panicking should generally be avoided, but there are cases where panicking can be a useful tool, especially when the program is in an unpredictable state or cannot recover from an error.\n- Minimizing visibility of data in structures is a common practice, but it can also limit the potential for other programmers to use the API creatively and find new uses for it.\n- Clippy, a linting tool for Rust, provides useful warnings and suggestions to improve code quality, but some of the lints are based on opinions and may not always align with individual preferences.\n- Rust fatigue, or feeling tired or overwhelmed by Rust, is a sentiment that some people may experience due to the learning curve or the complexity of the language.",
    "hn_summary": "- The post discusses effective Rust programming and addresses potential flaws and disagreements with the author's recommendations.\n- Comparisons with C++ are made to explain Rust concepts, which can be helpful for readers familiar with C++.\n- Rust is a versatile language suitable for various use cases, including embedded systems and scenarios requiring fast, low-level code.\n- People consider Rust a better alternative to C.\n- Resources like books provide guidance for writing effective Rust code, but there are debates over certain recommendations.\n- Careful consideration is needed when using smart pointers like Rc and RefCell to avoid misuse or issues.\n- Iterators are recommended as an alternative to loops, balancing readability and complexity.\n- Panicking should generally be avoided but can be useful in certain cases.\n- Minimizing visibility of data in structures is common practice but can limit creativity and potential uses of the API.\n- Clippy, a linting tool, provides suggestions for code improvement but may not align with individual preferences.\n- Some people experience Rust fatigue due to the learning curve and complexity of the language."
  },
  {
    "id": 36341287,
    "timestamp": 1686840513,
    "title": "Unihiker, an $80 single-board PC with 2.8\" touchscreen, quad-core ARM Cortex-A35",
    "url": "https://www.unihiker.com/",
    "hn_url": "http://news.ycombinator.com/item?id=36341287",
    "content": "HomeDocumentationNewsCommunityBuyUNIHIKERA Single Board Computer brings brand new experience.Built-in 2.8-inchtouchscreenNothing special, it's touchableNot monotonous, it's colorfulIncredibly fast and easy start01Connect to a computer02Start to play· Coding· Configure network· Run linux commandsUsing Python to senseand controlSoftwareThe integrated PinPong control library allows developers to directly control hundreds of sensors and actuators using Python.HardwareWith built-in co-processor, it is able to communicate with various analog/digital/I2C/UART/SPI sensors and actuators.Built-in IoT serviceIoT serviceOn-Device data01The built-in IoT service on UNIHIKER allowsusers to store data through the MQTT protocoland provides real-time data access via webbrowser.Play.Code.Debug.WirelesslyUNIHIKER can be programmed from a computer, an iPad, evena phone. It also supports Hotspot, you can play it fromanywhere.Supports popular coding softwareVS CodeMind+Node-RedCodeVisualProgrammingData Flow DiagramRich Interfaces and High ExpandabilityApplicationsMore ➜AIoTRobotSTEMSpecificationProductUNIHIKER™CPUQuad-Core ARM Cortex- A35, up to 1.2GHzRAM512MBFlash16GBOSDebianWi-Fi2.4GBTBluetooth 4.0Screen2.8inch, 240x320, Touch ScreenMCUGD32VF103SensorButtonMicrophoneLight SensorAccelerometer SensorGyroscope SensorActuatorLed, BuzzerPortUSB Type-C, USB-AMicroSDGravity 3pin/4pin portEdge connectorPower5V 2A for USB Type-CSize51.6mmx83mmx13mmUNIHIKER is a single-board computer(SBC) that features a 2.8-inch touchscreen, Wi-Fi and Bluetooth. It is equipped with light sensor, accelerometer, gyroscope and microphone. With built-in co-processor, it is able to communicate with various analog/digital/I2C/UART/SPI sensors and actuators.UNIHIKER brings whole new experience for you with its pre-installed software, allowing for an incredibly fast and easy start. With the built-in Jupyter Notebook, a browser-based programming environment, you can even program UNIHIKER using a smartphone or tablet.Just like other single-board computers, UNIHIKER also supports VS Code, VIM, and Thonny. The integrated PinPong control library allows you to directly control UNIHIKER's built-in sensors and hundreds of connected sensors and actuators using Python.The built-in IoT service on UNIHIKER allows you to store data using the MQTT protocol and provides real-time web data access. All data is stored on device.Compact, feature-rich, and user-friendly, UNIHIKER offers innovative development experience for learning, coding, and creating.Unleash your imagination and embrace a new journey with UNIHIKER.SupportForumDocumentationEmailunihiker@dfrobot.comWhere to BuyDistributorsPowered By DFRobot ©English 简体中文",
    "summary": "- Unihiker is a single-board computer (SBC) with a 2.8-inch touchscreen, Wi-Fi, and Bluetooth.\n- It has built-in sensors like a light sensor, accelerometer, gyroscope, and microphone, and can communicate with various analog/digital/I2C/UART/SPI sensors and actuators.\n- Unihiker offers a pre-installed software for an easy and fast start, and supports programming with Python using Jupyter Notebook, even from a smartphone or tablet.",
    "hn_title": "Unihiker, an $80 single-board PC with 2.8“ touchscreen, quad-core ARM Cortex-A35",
    "original_title": "Unihiker, an $80 single-board PC with 2.8“ touchscreen, quad-core ARM Cortex-A35",
    "score": 353,
    "hn_content": "The Unihiker is an $80 single-board PC with a 2.8\" touchscreen and a quad-core ARM Cortex-A35 processor.\n\nSome users on Hacker News believe that the Unihiker lacks ecosystem support and has an outdated software stack, making it dead on arrival.\n\nOthers suggest that used Intel NUCs or similar devices offer better value and more support at a similar price point.\n\nNUCs and other devices are available for as low as $35 on eBay, offering better performance and driver support.\n\nThe NUCs, Optiplexes, and ThinkCentres are also recommended due to their low cost and reliability, but their power consumption is higher than modern SoCs.\n\nSome users have had negative experiences with non-Raspberry Pi boards, citing broken software and lack of support. Raspberry Pi is praised for its powerful hardware and regular updates.\n\nSoftware support is crucial for long-term projects, as software vulnerabilities and changing requirements can render a device useless over time.\n\nThe Unihiker board is compatible with micro:bit, which provides an existing ecosystem for developers.\n\nThe board is seen as a potential solution for home automation, IoT projects, and personalized devices like arcade cabinets.\n\nThe Unihiker board presents itself as a versatile and affordable option, although the lack of software support and ecosystem integration raises concerns.\n\nIt is essential to consider future software updates and support when choosing a single-board computer for long-term projects.\n\nThe Unihiker board relies on Windows for flashing the OS, which limits its accessibility to those with Windows machines.\n\nThe board has a 240x320 display and 512MB of RAM, making it less powerful compared to other single-board computers on the market.\n\nUsers suggest using external memory or flash storage to store data, as internal storage may be limited.\n\nThe Unihiker board's bottom connector is compatible with micro:bit, offering potential for expansion modules and additional functionality.\n\nIt is important to carefully consider the Unihiker's specifications and limitations before purchasing it for specific projects.- The post discusses a homeserver board with low energy consumption, M.2/SATA ports, USB 3.0, and fast Ethernet.\n- There is also mention of a lightweight desktop with HDMI/DP, USB-C, M.2, and good software support.\n- The author is considering cheap Raspberry Pi 4 compute module boards but feels they are always just short of being good enough.\n- A user mentions buying a used Lenovo ThinkCentre with Intel 7th gen, 8GB RAM, and 256GB NVMe for a cheaper price than a Raspberry Pi.\n- Some users express interest in boards with ARM or RISC-V architecture and low power consumption.\n- There are concerns about the software support for Raspberry Pi alternatives from China.\n- The post also includes discussions about cheap touchscreens with CPUs and batteries for use as a control panel for Home Assistant.\n- Various suggestions are given, including using ESP32-S3 devices, STM32F103 as an IO extender, and Kindle tablets.\n- The discussion also includes mentions of M5Stack, Pine64, and other devices.\n- Some users express concerns about clutter and e-waste from constantly buying new devices.\n- There are debates about the performance, modularity, and documentation of the mentioned board.\n- Users question whether the board is open source and express cynicism towards small computer products.\n- Someone mentions that the board resembles a $20 Android phone without the case or battery.\n- A user reflects on the enthusiasm around these tiny computer products and how they often end up unused.\n\nThe most important thing people should know about this post is that it discusses alternatives to Raspberry Pi for home servers and lightweight desktops. It also explores various options for cheap touchscreens for Home Assistant control panels. The post captures the interest of readers by discussing different hardware options, software support concerns, and potential cost savings compared to Raspberry Pi.",
    "hn_summary": "- Some users believe the Unihiker lacks ecosystem support and has an outdated software stack, making it dead on arrival.\n- Users suggest that used Intel NUCs or similar devices offer better value and more support at a similar price point.\n- Raspberry Pi is praised for its powerful hardware and regular updates, while non-Raspberry Pi boards are criticized for broken software and lack of support."
  },
  {
    "id": 36340671,
    "timestamp": 1686837858,
    "title": "Archaeologists find 3000-year-old sword, exceptionally well preserved",
    "url": "https://newsingermany.com/archaeologists-find-3000-year-old-sword/",
    "hn_url": "http://news.ycombinator.com/item?id=36340671",
    "content": "newsingermany.comChecking if the site connection is securenewsingermany.com needs to review the security of your connection before proceeding.Ray ID: 7d816d20ffc515bcPerformance & security by Cloudflare",
    "summary": "N/A",
    "hn_title": "Archaeologists find 3000-year-old sword, exceptionally well preserved",
    "original_title": "Archaeologists find 3000-year-old sword, exceptionally well preserved",
    "score": 341,
    "hn_content": "Hacker News new | past | comments | ask | show | jobs | submit loginArchaeologists find 3000-year-old sword, exceptionally well preserved (newsingermany.com)341 points by janpot 17 hours ago | hide | past | favorite | 166 commentsneonate 12 hours ago | next [–]https://archive.ph/xqqOxhttp://web.archive.org/web/20230615154129/https://newsingerm...Luc 16 hours ago | prev | next [–]More nice pictures here, very metal: https://www.welt.de/geschichte/article245860994/Archaeologie...replyidiotsecant 15 hours ago | parent | next [–]Wow! That really does look like it's in good shape. I understand it's because bronze doesn't oxidize as readily but it's not what I picture when someone says 3000 year old sword.replyrurp 12 hours ago | root | parent | next [–]Same here. With something that old I was expecting \"well preserved\" to mean that I could probably make out that it has the shape of a sword.replymasklinn 15 hours ago | root | parent | prev | next [–]Fwiw bronze does oxidise quite readily, but the copper oxide is not porous, and becomes a resilient copper carbonate.Which is why bronze and other copper-alloy artefacts are extremely resilient, unless they come in contact with chlorides and get bronze disease.replyPaul-Craft 9 hours ago | root | parent | next [–]I can tell you have some experience with old bronze/copper. Most people do not even know what \"bronze disease\" is.replybrohee 8 hours ago | root | parent | next [–]A lot of people learned about it when tutorials on inducing it on statues of questionable personnalities sprouted up.replymikewarot 9 hours ago | root | parent | prev | next [–]The arrow points are pretty amazing tooreplyisametry 9 hours ago | parent | prev | next [–]https://archive.is/RccA2replyhot_gril 8 hours ago | root | parent | next [–]Thank goodness, the German cookies prompt scared me.replyhackernewds 8 hours ago | parent | prev | next [–]wow many heavy metal music to be made in its tribute surelyreplyChuckMcM 13 hours ago | prev | next [–]I collect swords, and this is a nice example. When researching swords from the medieval period I found this technique of starting with an octagonal \"bar\" of stock material and then using a hammer to shape the blade while leaving a round segment for the handle to be interesting. It makes sense of course, although it can make for an uncomfortable handle (hence the wrapped handles in more modern swords.)replytrilbyglens 12 hours ago | parent | next [–]The article mentions that the handles were often cast over the blade.replycontingencies 11 hours ago | parent | prev | next [–]Cool, what's your oldest sword and where does it come from? Do you display them or just collect them? I have a friend in Australia with a fairly significant knife (not sword) collection which will be for sale shortly (aged owner), let me know if interested.replyChuckMcM 7 hours ago | root | parent | next [–]I too have knives in my collection, and would be interested but generally shipping things from Australia is hecka expensive too. Generally, I add things, with interesting stories to my collection. My oldest sword is privileged information but my favorite is the first one I got.In 1990 I was visiting Edinburgh on business for Sun, and I wanted a Claymore in celebration of my Scottish ancestry. At the Haymarket, I met an antique salesperson who let me in on the sad truth that a \"real\" one would set me back $40,000+ in 1990 dollars. But he mentioned that the British Museum sometimes sold \"extras\", swords which weren't particularly significant or not something they were going to add to the collection but selling them raised funds to cover costs. And he gave me the number of a curator of the Arms and Armor section of the museum.I called and spoke to the curator who told me that no, they didn't have, nor would they sell me a sword from their collection, but they did do business with a swordsmith in Whitburn who they sometimes used to make copies of swords in their collection so that they could display the copy and preserve the original. This smith had worked with them for years and made a point about re-creating the original process as closely as possible. The curator gave me contact information for the swordsmith[1].I called the swordsmith and explained to him what I was trying to accomplish and he understood right away but explained that it would be expensive. Making these copies often took months to make. I told him that was okay and asked what he would charge me, his answer was 1,500 pounds[2], 750 up front and 750 on completion. He had a sword he was making for the museum and it would make a good template for the one he would make me. I agreed to his terms and across a bunch of timezones on two different continents managed to arrange a wire transfer to his account for the 750 pounds.I returned from Scotland and told my wife the whole thing and she was skeptical and thought I had burned up $2,000 on a silly idea. About five and a half months letter I get a telegram (yes, honest to goodness \"YOUR SWORD IS READY STOP SEND BALANCE STOP ...\" etc kind of thing. I called him on the phone and he agreed to make a crate for it and to ship it via counter to counter service of British Airlines (they had a couple of different non-stop flights to SFO). We had a discussion about customs and duties and whether or not I wanted the sword tempered as it would have been in the 15th century, or not. The plan was to not temper it, making it somewhat useless as a \"real\" sword, and declaring it as a \"Work of art, made of metal\" (no duty required). He gave me the flight number they would ship it on and I wired him the rest of the funds.A few days later I went to SFO to pick it up, inquired at the BA desk and they redirected me to customs. I went to customs and they said, \"This isn't a work of art, this is a sword. You owe 10% duty on it.\" I tried to explain to them that the Venus de Milo was just some pottery with no arms but they were having none of it. They stuck firm and asked what I paid for it. I told them \"1,500\" so they charged me $150 duty.He didn't ask the units, and I didn't offer :-).A bit less than a year later, the smith called me and explained that he had thrown out his rotator cup (shoulder injury) which made it impossible for him to make swords. He had someone looking for a Claymore and they would pay 5,000 pounds for it, would I be interested in selling mine. And I said \"No, this is something I want my kids to inherit.\"[1] A place called Whitburn Arms.[2] The exchange rate at the time made this somewhere between $3,000 and $4,000 USD.replyfuzztester 6 hours ago | root | parent | next [–]You could have both made a profit and let him make one, helping with his life after his injury. Your call though, of course.replyChuckMcM 6 hours ago | root | parent | next [–]That's an interesting take on it. On the one hand, it wasn't presented as \"this would help my recovery/treatment,\" rather it was presented as \"I threw out my rotator cup so I'm not doing swords, but if you wanted to sell, I can connect you with someone who wants to buy one.\"I am acutely aware that one never knows what is going on in the other person's head in a conversation, so I have to accept the possibility that he was hoping to generate another sale to me, but I feel pretty strongly that if that was what he was hoping for he would have mentioned it.replycontingencies 5 hours ago | root | parent | prev | next [–]Great story. Do send me an email, the owner will need to share their catalog and price, but I don't think the shipping would pose an issue as three of us are flying in a couple of months and could bring it over then.replyprox 16 hours ago | prev | next [–]This is really impressive, like it was made yesterday and put in the mud!Side note, I read this domain as “New Singer Many.com” at first :Preplyjdwithit 8 hours ago | parent | next [–]Same, I had to facepalm when the logo loaded indicating the correct name heh.replyleobg 11 hours ago | prev | next [–]This is mindblowing. Here we are, 3000 years in the future. But how many of us could make such a “primitive” thing?replymcbutterbunz 10 hours ago | parent | next [–]How many people could make them 3000 years ago? Im curious how many blacksmiths there were back then with the appropriate skill and resources to learn it and do it well. I feel as if there are still a surprising number of people that could make a sword today, although maybe not from raw resources.replyfoobar1962 5 hours ago | root | parent | next [–]> Im curious how many blacksmiths there were back then...The sword is bronze, blacksmiths work with iron. Bronze is usually cast, iron is usually forged (heated and hit with a hammer).replystinkbutt 10 hours ago | root | parent | prev | next [–]it was one of the most popular and widespread occupationsreplyfnordpiglet 10 hours ago | root | parent | next [–]I think it’s more accurate to say most communities had a blacksmith. “Farmer” was the most popular and widespread occultations. A community at that time didn’t require a ton of specialized labor, they needed more people using the output of a blacksmith.replyz3phyr 3 hours ago | root | parent | next [–]Unlike how popular culture depicts, blacksmiths seldom operated alone. A village would have a big team of blacksmiths, including many acolytes.replyIG_Semmelweiss 5 hours ago | parent | prev | next [–]Its more than simply making the thing.There's advancement in several fields of study and industry that need to happen before you can make the thing, especially circa 3000. Geography, Mining, Manpower, Logistics, Science... to name a few!This post covers it quite well.https://acoup.blog/2020/09/18/collections-iron-how-did-they-...replyhackernewds 8 hours ago | parent | prev | next [–]We can do and learn things that require further intellectual ability though ;)How many \"primitives\" could pass a 8year olds Spelling Bee?replyTrueSlacker0 4 hours ago | root | parent | next [–]How many people can really spell that many words correctly today? Without a red squiggly line that is. I know I personally am terrible at it. Like really, really bad. So are most people I know well enough to admit it. English for example is a terrible language with so many edge cases and tons of inconsistency that to me as a layman make zero sense.For example I try to sound out words with my kids as they learn to read. But it's not that simple. So many words are pronounced \"incorrectly\". It makes it very frustrating for all parties involved.So.. is mass memorizing how to spell complicated words truly a sign of intelligence or just applied memorization to a field.I would simply say I hate spelling but I loathe it so I can seem smarter even though they mean the same thing. English...replyASalazarMX 5 hours ago | root | parent | prev | next [–]How many 8-year olds could pass a spelling bee of a 3,000-year old language, though?replymtrower 10 hours ago | parent | prev | next [–]To be fair, how many of the populace 3000 years ago could make such a thing?replystickfigure 7 hours ago | parent | prev | next [–]With the right youtube videos and enough practice, I'll bet most mechanically inclined people could work it out.reply93po 2 hours ago | root | parent | next [–]I imagine the information you could fit on a single piece of printer paper with 12 point font would net someone something much better than this sword. Metallurgy has come a long wayreplyArchelaos 16 hours ago | prev | next [–]The article is somewhat sensationalistic. Finding an octagonal type bronze sword (\"Achtkantschwert\" in German) from that period is rare, but we have quite a couple of them. Since bronze does not rust, the conditions of such swords are often quite good (and typically far better than that of medieval iron swords, for instance).Here is a map of the distribution of octagonal-hilted swords in Europe:https://www.researchgate.net/figure/Map-showing-the-distribu...As you can easily see, there are two clearly separated areas where these swords were found.The following article (PDF, in German, including an English abstract and some nice photos) explores the possible (dis-)connection between the two areas:https://goedoc.uni-goettingen.de/bitstream/handle/1/8646/pz....replyTSiege 13 hours ago | parent | next [–]The \"exceptional\" part is literally a quote from the top expert of preservation for the region.> The sword and the burial still need to be examined, said Conservator General Mathias Pfeil, head of the Bavarian State Office for the Preservation of Monuments. “But we can already say: the state of preservation is exceptional!”This article has more photos and compared to the sources mentioned here does seem much better preserved. The entire sword doesn't even look corroded https://www.welt.de/geschichte/article245860994/Archaeologie...replyhzay 11 hours ago | parent | prev | next [–]My knowledge of bronze vs iron comes purely from playing dwarf fortress. Are they fairly comparable in the damage they can cause?replyQuercusMax 10 hours ago | root | parent | next [–]I've just started listening to the Fall of Civilizations podcast (https://fallofcivilizationspodcast.com/), and their second episode is on the Late Bronze Age collapse. The theory they put forward as to one of the reasons the big successful Bronze age civilizations got out-competed is that bronze is very expensive / hard to acquire, primarily because of the need for tin. (Copper is very common but unsuitable for weaponry without turning it into bronze.)Iron is extremely common and cheap, but requires much much higher temperatures to work with than bronze. Once the furnace technology was out there to make smelting iron and creation of steel feasible, poorer / less complicated civilizations were able to make iron weaponry and go up against their richer neighbors.replyGravitasFailure 9 hours ago | root | parent | prev | next [–]Bronze is superior to iron, but not to steel. Both bronze and steel can take very sharp edges while only steel can be tempered to be springy and tough and therefore can make much lighter weapons. Iron is soft, weak, prone to rusting, can't easily take or hold an edge, and requires a lot of fuel to process from ore, but you can get it anywhere in large quantities if you have the fuel, while bronze needs the much harder to find tin.replycredit_guy 6 hours ago | root | parent | prev | next [–]I think they are comparable. A blow from a bronze sword will kill you just as well as a blow from an iron sword. The most widespread weapon of all times prior to the American Revolutionary War and the Napoleonic wars were spears. A spear with a bronze tip and one with an iron tip will also kill you with equal probability. If you have a shield, the damage to the spear is much more likely to come from a broken shaft than from a cracked tip. The shield itself generally had a metallic part (a \"boss\") that could be made of bronze or iron. Both were equally effective.Swords were generally not used in battle. But if used, a bronze sword was a bit more likely to crack than an iron sword. Bronze weapons were resistant to corrosion though. So that meant they did a better job in their secondary role: that of provider of status. A warrior with shiny armor, shield and sword is much more imposing and frightening than one with a rusty armor, shield and sword. Of course, in the bronze age, war was more ritualistic than war during the Roman empire, when war was much more like an industrial operation. For the purposes of the Roman empire, iron was probably doing a better job than bronze.replyplewd 5 hours ago | root | parent | next [–]What were swords used for if not for battle?replycredit_guy 5 hours ago | root | parent | next [–]People often compare sword with handguns. Handguns nowadays are deadly weapons, but they are not used in war, where people use assault rifles instead, or other heavier weapons. Swords were sidearms. Warriors carried them around every day, they could be used for self defense (in those times there was not police or law enforcement). Or they could be used for intimidating opponents, and if needed, for chopping someone's head or limb.In combat though, spears were much, much more effective.With one exception. As far as I can tell only one exception, but a big one. The Romans have figured out that all other people are quite bad at close quarters combat. Since soldiers were used to using spears, very few soldiers knew what to do if someone got in a close range than the length of a spear. The Romans then would bull-rush the enemy using their shield, and when close they would use their (quite short) swords. Without training, their opponents didn't stand a chance. Of course, this type of battle tactic required an enormous amount of training. The Romans did that because they were a very war-oriented society. Others couldn't match their level of training.Even for the Romans though, who were regularly using swords, the choice of bronze versus iron would have made little difference. Although bronze is a bit more brittle than iron, and a bronze sword is more likely to break when it strikes a hard object, the Romans were trained to thrust the sword, not to use slashing moves. Thrusting is much more deadly, but less instinctive. It's another thing that requires extensive training, which the Romans were great at. For thrusting, I think a bronze and an iron sword do equally well.replylenkite 1 hour ago | root | parent | next [–]Nice explanation, but the Romans did use spears - the 7-foot heavy pilum. They just threw them. It was effectively used to disrupt a threat in a mass volley before swords were drawn and the zerg rugh. Several battles were won by the pilum - the battle of Telamon for example.replybombcar 10 hours ago | root | parent | prev | next [–]Any real difference in damage would be weight based, as swords were more used for beating than cutting. It's likely that one metal could hold a better edge, and one (perhaps the same) would be more resilient to breaking.It's not quite like the D&D \"this metal is higher ranking and does more damage\".replyAngryData 6 hours ago | root | parent | prev | next [–]Depends on the quality of the iron. Poor quality iron is often inferior, but of course actual steel is much better. Bronze can take a great edge but is a a bit softer and can get edge damage in battle/usage quicker. However bronze does have one big benefit over iron/steel, repairability. If a bronze item is damaged it can be cold worked and annealed repeatedly over a simple wood fire. With iron or steel you need a more proper forge and charcoal to repair it and it has to be worked while hot which requires more tools on hand to do properly. A \"cheap\" bronze sword can be smashed over dozens of heads until it is basically a bronze club, but then later with a campfire and some rocks or simple hammer can be reworked and sharpened into a sword again.replywutangson1 7 hours ago | root | parent | prev | next [–]I was under the impression that iron causes more damage- hence, why the Iron Age followed the Bronze Age, because the people with the iron armor and swords would pierce through the armor of the peoples wearing the bronze armor, but not vice-versa.replyzulban 14 hours ago | parent | prev | next [–]>somewhat sensationalisticWhat a cynical comment. The title doesn't even say rare, and there's only a few dozen found in \"all of Europe\", ever. What could possibly be seen as sensationalist here? Thanks for your excellent sources, however.I know it's trendy to say sensationalist, and it's often true. Just seems like a lazy thing to write in this case.replyArchelaos 13 hours ago | root | parent | next [–]> What could possibly be seen as sensationalist here?I wrote \"somewhat\" on purpose, meaning something in the middle between \"really sensationalistic\" and \"quite interesting\". The sensationalist aspect of the article is that it gives the uninformed reader the impression that it is something like the find of the year, which it really isn't. Yes, it is a nice find and well-preserved, but in the end, everything is rare if one only narrows down the area enough. Instead, the author should have informed the reader that bronze swords are often quite well-preserved and why this is the case, and that \"rare\" does not mean \"one or two others\", but \"about 200 others of this specific type and thousands of others considering all types\".replypessimizer 13 hours ago | root | parent | prev | next [–]\"Somewhat sensationalistic\" ranks somewhere around \"slightly uncomfortable\" or \"a little misleading\" on the cynicism scale. I know it's trendy to write entire comments responding to a single, passing word usage in someone else's comment, but...replymtrower 11 hours ago | root | parent | next [–]I wouldn't say it's used in passing. I'd say it's the entire point of their comment.Whether the usage was reasonable I don't feel qualified to comment on.replylordleft 16 hours ago | prev | next [–]It's funny to think that the fantasy/speculative fiction trope of \"precursor civilization that has advanced tech\" was probably grounded in the historical memory of people happening upon ruins, weapons and artifacts of extraordinary craftsmanship.replybeloch 16 hours ago | parent | next [–]Such myths are likely based on classical Rome rather than bronze age discoveries.For several centuries after the Western empire fell apart, Europeans lacked the capability to build settlements or structures anywhere close to the size typical of classical Roman civilization. Populations were depressed by pestilence, social order had declined, and most Europeans were within a short distance from a former Roman settlement of a size larger than they'd ever seen populated in their lives. The Eastern empire was a little different, but Western Europe was pretty much fubar in the early middle ages.Although technology steadily progressed throughout the middle ages, it took centuries for population and social organization to return to anywhere near classical levels. If you lived during the early middle age, it was an unmistakable fact that a great \"precursor civilization\" capable of wonders far beyond what your own civilization was capable of had lived and fallen long before you were born. With colossal roman ruins scattered across Europe, there was no need to look to the bronze age for a fallen civilization.replyspaceman_2020 13 hours ago | root | parent | next [–]My YouTube feed has been (pleasantly) taken over by ancient Rome videos where historians and archaeologists cover how various Roman inventions and buildings worked.I don't think people realize how far ahead of everyone else Rome was at that time.Like most people know that Rome had aqueducts bringing in water to the city, but they probably don't know that water was supplied to different buildings directly, and you could pay to get a line installed straight to your house. Running water in your house, 2000 years ago!replymitchdoogle 12 hours ago | root | parent | next [–]Sounds interesting. Do you have any channels or particular videos you'd recommend?replyspaceman_2020 11 hours ago | root | parent | next [–]Look up “Ancient Rome Live” on YouTube and then go down the recommendations rabbithole.replyusrusr 15 hours ago | root | parent | prev | next [–]That trope is about something so forgotten that any discoveries would be entirely unexpected. But awareness of Rome was never lost, quite the opposite. Even bureaucratic connections survived, they just shifted back a gear from political to spiritual authority. Most nominal titles like count or duke assumed by european nobility derive their names from some role in Roman administration, they all considered themselves as continuation of something that never disappeared but merely changed shape.replycmrdporcupine 14 hours ago | root | parent | next [–]Came here to say much the same thing. A great book that gets into the details of this is https://www.amazon.com/Inheritance-Rome-Illuminating-Dark-40...TLDR; people considered themselves \"Roman\", or something adjacent to it, long after the western empire officially disintegrated, and of course in the east it didn't really die.Even on the outskirts (e.g. Romano-British) people held onto Roman, Christian, and Latin culture at a very deep level. And even when the Anglo-Saxons invaded they were extremely aware of who and what the Roman ruins etc. were, even if they chose not to settle in them in many cases.replyInitialLastName 12 hours ago | root | parent | next [–]> Even on the outskirts (e.g. Romano-British) people held onto Roman, Christian, and Latin culture at a very deep level.Three of the 10 most common languages on Earth boil down to \"Latin with a bad accent\".replycmrdporcupine 12 hours ago | root | parent | next [–]Exactly, and the most popular religion in the world is basically cultural continuity with late western Roman culture and its largest most organized official form even uses the Latin language and maintains political institutions with continuous lineage back to Rome.I don't think there's a real timeline where Europeans were wandering around the ruins of the suddenly collapsed empire wondering who these people were. They knew fully, but the economic and political (and physical! plague!) situation meant they were unable to reconstruct the Pax Romana.But they certainly tried, even when they were former \"outsiders\" like the Franks (who, in the west half of their realm, even dropped their native tongue to speak a form of Latin!).In fact I feel it's possible that actual \"progress\" wasn't possible in Europe until philosophical thought moved beyond late-Roman neo-Platonic & neo-Aristotelian boundaries, and into new radical enlightenment era concepts.replylabster 9 hours ago | root | parent | next [–]Knowing fully what happened to Rome, if it’s even possible, would have been limited to the educated class. Stories would still have come out of the peasant class, whose folk memory of Rome couldn’t match what the clergy had.Eventually we did remake the Pax Romana, but it took two utterly ruinous wars, humanism, and a working knowledge of free trade to recreate the system that Rome had managed to create almost by accident.replycmrdporcupine 5 hours ago | root | parent | next [–]What has been created with modern global capitalism is extremely different from the Roman form of commerce and administration. Not just in technology but in complete ideological foundations. Not only was slavery fundamental to its whole foundation, its accepted and normal practices for doing business would today, in the west, be considered forms of absolute extreme corruption, and their justice system would absolutely horrify us.I'd posit that today's world is what it is because it is partially on built enlightenment values that stepped away from the old Roman model, not back to it.replylrem 10 hours ago | root | parent | prev | next [–]Polish nobility, stretching well into today’s Ukraine, was inventing ways in which they were continuation of imaginary outskirts of said empire.replycmrdporcupine 6 hours ago | root | parent | next [–]Russian Orthodox nationalists have this fantasy still. Including Putin.https://brill.com/view/journals/joah/4/1-2/article-p28_4.xmlreplyboomboomsubban 15 hours ago | root | parent | prev | next [–]Most of what you wrote was true for the most of the Mediterranean after the Bronze Age collapse too. That is why the Greeks and Romans also had such myths, remember Atlantis is something that seemingly originated with Plato.replyWalterBright 13 hours ago | root | parent | prev | next [–]There was also the Minoan civilization, wiped out by the eruption of Santorini. Probably inspired the Atlantis legend.replyoh_sigh 15 hours ago | root | parent | prev | next [–]It goes further back than that. In 400BC, Xenophon, while retreating from a failed attempt at taking Babylon, came across the abandoned ruins of a bunch of Assyrian cities, like Nineveh and wrote about them. 200 years after being abandoned, they were far more impressive than anything Xenophon would have seen in his home country. For example, Athens at that point had a city wall(the Themistoclean wall) approximately 5 miles circumference, made of rubble, 30' tall, 10' thick at the baseCompare to what Xenophon saw at Nineveh: A city wall 7.5 miles circumference, made of stone and brick, 55' tall and up to 50' thick. The most impressive structures he would have ever seen - just out in the middle of nowhere, absolutely abandoned.replythom 6 hours ago | root | parent | next [–]Just a quick plug for the marvellous Landmark edition of Xenophon’s Anabasis:https://www.amazon.co.uk/Landmark-Xenophons-Anabasis-Shane-B...Beautiful book with lots of maps and illustrations covering the journey mentioned above, if that’s anyone’s bag.replypfdietz 7 hours ago | root | parent | prev | next [–]The Fall of Civilizations podcast episode on the Assyrians starts with Xenophon's experience.replycubefox 15 hours ago | root | parent | prev | next [–]There was also purely intellectual evidence from an advanced civilization, in form of surviving books by Greek philosophers, mathematicians and astronomers.replydetourdog 14 hours ago | root | parent | next [–]The epic of Gilgamesh starts out talking about the distant past.replyTuna-Fish 15 hours ago | parent | prev | next [–]Almost everywhere on earth, there have been many regional collapses in different times. This is enough for a corpus of stories about mythical, great past to be created, survive through the highwater mark of the next cycle of civilization (which was usually higher than the previous great past), and provide context during the next collapse and it's aftermath.When Roman power in the West collapsed, and, for example, the remaining population of Arles retreated into the amphitheater of their previously much greater and more prosperous city, building a fortification in the middle and from the ruins of what used to be before, there were almost certainly people among them who could recite Hesiod. I just for some reason find this so trippy.replysvachalek 15 hours ago | parent | prev | next [–]And oral history I'm sure. We will probably never know how advanced and widespread some of these ancient technologies are but the existence of artifacts that are far, far ahead of anything we would expect historically (e.g. Antikythera Mechanism, Gobekli Tepe) suggests there are some big, big holes in our records of the past.replyholoduke 12 hours ago | root | parent | next [–]I find the ancient stone works the best evidence for some kind of advanced civilization in the far past. (No not aliens). Some date back 10.000 years ago. The precision and similarities between different sites all over the world is incredible. We are just in the beginning of this research field.replyGeorge83728 12 hours ago | root | parent | prev | next [–]I don't think anybody really thought much about it before the discovery of the Antikythera Mechanism, but at least in retrospect there seem to be clear reference to such devices in ancient contemporary literature. Particularly, Cicero described such devices and attributed them to Archimedes.replyautomatic6131 16 hours ago | parent | prev | next [–]I think it might be a general bias in the human psyche. When you're born, you're utterly dependent on the gods that are your parents (and extended village, to a greater or lesser extent) and this has selected for a bias in the human brain that expresses itself as \"older people good, oldest people better\".I base this only on finding the trope of \"precursor civilisation/society with the best tech\" in literature from across the globe.replyspaceman_2020 12 hours ago | root | parent | next [–]Before written text and easy access to books and knowledge, you also relied on the experience and skills of older people to learn and make your way in the world.replybeanjuice 16 hours ago | prev | next [–]Is there a website where you can view chronologically interesting archaelogical finds? Like a timeline of what has popped up from the ground made by human hands?replywnissen 14 hours ago | parent | next [–]I highly, highly recommend A History of the World in 100 Objects (particularly the out of print 2011 hardback, which is not available from any non-Amazon sources I could find.) As you can guess from the title, it tells the story of human history through archaeological finds. They are all from the British Museum, so it wouldn't include something like the sword from the OP, but given that independence from the British is the most widely celebrated holiday in the world, it's nearly comprehensive.https://www.amazon.com/History-World-100-Objects/dp/06700227...replyct0 15 hours ago | parent | prev | next [–]https://www.archaeology.org/newsreplyOJFord 15 hours ago | root | parent | next [–]I think GP means chronologically as in (best estimate) age of the artefact, not the time of discovery.reply12907835202 3 hours ago | prev | next [–]Odd that it says 3000 years ago. The start of the Wikipedia entry on bronze swords says they appeared in 17BC which is of course only 2000 years ago.reply12907835202 3 hours ago | parent | next [–]I've realised my mistake there. Embarrassing. I've no ability to edit though, never noticed that before. I guess I never had the need.reply404mm 14 hours ago | prev | next [–]The level of details and craftsmanship is amazing considering how old it is.replycsomar 4 hours ago | parent | next [–]It’s german quality!replymistrial9 14 hours ago | parent | prev | next [–]plenty of earlier civilizations had better crafts than we do now.. Second, existing society has lost its crafts.. example 17th century French goldsmithing that is not reproducible todayreply404mm 14 hours ago | root | parent | next [–]I completely agree. A few hundred years ago is somewhat understandable. It’s the peak before electricity allowed further progression (and demise). To me, 3k years ago is a bit more shocking, when I compare it with items from 5-10th century.replyautomatic6131 16 hours ago | prev | next [–]What stands out to me is the pommel with the large handhold. That makes me think that it's a slashing sword, not a stabbing one. Then there's the fact that it's all metal, unlike how most ancient and medieval swords which were made with an handle of organic material around the tang of the blade. Probably not intended (ever) for use in fighting? Since it doesn't have a replacable handle.replyArchelaos 15 hours ago | parent | next [–]Generally speaking, shorter swords from that period (as the current one), which are more like large daggers, were typically cast in one piece with the handhold. For larger swords, we often find some with separately attached handles, too.Here you can see a selection of Danish swords of both types alongside each other from the same period: https://www.researchgate.net/figure/Images-of-Danish-swords-...replyadrian_b 15 hours ago | parent | prev | next [–]The handle seems to be a separate piece of metal from the blade, and it appears to have been riveted to the blade (with two pairs of lateral rivets), so it might have been replaceable, even if there should have been little need to replace a bronze handle.The blade seems thick, so even with a bronze handle the sword might have been balanced well enough to be usable.Just from the pictures it cannot be guessed whether the sword was too heavy to be easily handled by a normal human.replyftxbro 15 hours ago | parent | prev | next [–]> \"What stands out to me is the pommel with the large handhold. That makes me think that it's a slashing sword, not a stabbing one.\"it looks like the pommel of a rondel dagger which is as stabby as it getsreplyEVa5I7bHFq9mnYK 13 hours ago | parent | prev | next [–]A pommel is supposed to be small, this one is so large and protruding, how do you even slash or stab with this thing? The only thing this seems good for is for beating your opponent on the head with its handle.replyhotpotamus 15 hours ago | parent | prev | next [–]I was under the impression that bronze swords' lifespans were limited by the metal; they can't be sharpened, but would need to be re-cast. A replaceable handle probably wouldn't help much.replyprotocolture 7 hours ago | root | parent | next [–]Bronze can be resharpened that much is fine.But other damage was limited. Bends and dents andd the like can only be repaired so often before the metal becomes brittle. Work Hardening is sort of the application of this process just to the surface/edge.replyLoughla 12 hours ago | root | parent | prev | next [–]Wait, can you really not sharpen bronze? From what I know it takes a good edge, just not quite as fine as steel would. But I don't know anything about not being able to sharpen it.Am I wrong? Can you really not sharpen bronze?replyhotpotamus 11 hours ago | root | parent | next [–]I have been told that, but I really don't know. It's a tech that's been obsolete for a couple millenia now, so I hadn't put much actual research into it.replyyetanotherloser 11 hours ago | root | parent | next [–]You can definitely resharpen bronze. The castings are not perfectly sharp, the edges are further worked (and can be hammered and work hardened). I don't think you can redo work hardening indefinitely but you can a bit and can scrape and grind and hone repeatedly. There are (or were last I looked) some people supplying cast blanks these days for re-enactors to try sharpening up. Always wanted to try that one day.replyAnimalMuppet 15 hours ago | parent | prev | next [–]If the handle is metal, why would it ever need to be replaced? It's not going to rot, and it's not going to break.replycivilitty 15 hours ago | root | parent | next [–]It’s not that the handle is going to rot, it’s that there’s zero shock absorption. The fact that it doesn’t have a replaceable handle probably means that it’s for ceremonial purposes, not fighting. Hitting another sword with it would be exhausting and painful.replyadrian_b 15 hours ago | root | parent | next [–]I doubt that \"shock absorption\" would have been a problem.This kind of sword would not have been used like a hammer.The wavy pattern on the bronze handle would have ensured a firm grip even with a sweaty or wet hand. I have some Japanese Tojiro kitchen knives, which have stainless steel handles with a similar pattern on the handle, and they are more comfortable than most of the knife handles made of wood or plastic, especially when used with a dirty hand.So based on this experience, I do not believe that such a bronze handle would have been a serious disadvantage, even if it is possible that the sword was purely ceremonial.replybee_rider 14 hours ago | root | parent | next [–]I have found though that my kitchen knife is not very good when I have to parry, or when I have to bash my way through a shield.replyadrian_b 14 hours ago | root | parent | next [–]Nobody would have parried with a sword, except in desperate situations, because of the risk of breaking the sword or damaging its edge. That's what the shield was for.However you have a valid point that anyone wielding a sword had to resist the shock of a successful parry with the shield done by the opponent.For thrusting movements, I do not believe that such a bronze handle would have been worse than any other handle, because it is unlikely to have been more slippery.Only for cutting movements you are right that a handle wrapped in leather or cords should have been better at absorbing shocks.replycivilitty 4 hours ago | root | parent | next [–]The reason I bring it up is a (minuscule) amount of personal experience: I've had the chance to practice/play fight with a replica bronze sword & shield against an opponent. We were expressly forbidden from parrying with the swords and it surprised me just how physically demanding the parries were against the shield, largely I think due to the ringing. Regaining control after the impact of the sword was hard.That said, the craftsmanship of the sword I used was nothing like the one in the TFA and it didn't have a handle cast onto the blade, nor such an intricate design. I don't know how accurate the shield were to the time period (one was leather bound, the tower shield was not) but they didn't have metal rims and shield bosses.replyGeorge83728 15 hours ago | root | parent | prev | next [–]If the blade breaks, that handle is fancy enough that somebody might want it fitted with a new blade.replytechwiz137 14 hours ago | prev | next [–]The shape, intricate detail, not something I would have expected from a civilization 3000 years ago. The more you know.replyspaceman_2020 12 hours ago | parent | next [–]Well, the famous mask of Tutankhamun was dated to 1323 BCE. Plenty of older artefacts than 3000 years ago that are equally impressive.https://en.wikipedia.org/wiki/Mask_of_Tutankhamunreplyfoobar1962 5 hours ago | prev | next [–]A question for the metallurgists: how would a bronze sword compare to an iron sword, even if the iron is low quality (ie, impurities, not heat treated etc)?replyhacoo 5 hours ago | parent | next [–]Not a metallurgist but — my understanding is that pure iron weapons are quite inferior to bronze. Pure iron is very soft and ductile. It would not hold an edge well and is easily bent - to the point that some sources say they would need to be repeatedly un-bent during battle.Another advantage of bronze weapons is they could be cast in a mold instead of forged.Iron was much more plentiful than copper and tin however (especially as they were mined out), which was the main reason bronze fell out of use.Good steel was superior to both, but much harder to make.replykitd 15 hours ago | prev | next [–]Shame. Missed opportunity to editorialise it to \"Ineffective Rust\" ;)replyfuzztester 6 hours ago | prev | next [–]Had to enable JavaScript to be able to view the images on the original site.Is there any technical reason why this is needed, or they just did it that way?replytaylorbuley 14 hours ago | prev | next [–]Here's the original source: https://www.faz.net/aktuell/gesellschaft/menschen/3000-jahre...replyAHOHA 13 hours ago | prev | next [–]Now that valuable piece must be saved and taken care of, and there’s no where else except the British museum!! ;)replyjdlyga 16 hours ago | prev | next [–]Callandor... The sword that is not a sword.replyavereveard 8 hours ago | prev | next [–]You'd think a civilization 3000 years in the future would take more than a couple questionable resolution pictures.replybarrenko 10 hours ago | prev | next [–]Umm there can be only one?replycoldpie 15 hours ago | prev | next [32 more]dabluecaboose 15 hours ago | prev | next [–]>A man, a woman and a youth were buried in it. It is still unclear what relationship the people may have had to one another.Yeah, real puzzler that onereplyInitialLastName 12 hours ago | parent | next [–]There may be a single, overwhelmingly likely option, but absent DNA testing or further context clues we can't know for sure. Let's not snark the one science journalist who isn't adding baseless speculation to their article.replyyamazakiwi 15 hours ago | parent | prev | next [–]Rag tag group of friends obviouslyreplywerds 13 hours ago | root | parent | next [–]skiffle bandreplycivilitty 14 hours ago | parent | prev | next [–]The woman and child were clearly put there for ceremonial purposes.replylalos 12 hours ago | root | parent | next [–]Vikings used to that - https://en.wikipedia.org/wiki/Norse_funeral as described by Ahmad ibn Fadlanreplydeely3 13 hours ago | parent | prev | next [–]Probably roommates.replywebbdiscoveries 12 hours ago | prev | next [2 more]excalibur 16 hours ago | prev | next [–]It's my buddy Klauss! I haven't seen him in ages!replyApreche 16 hours ago | prev [–]What kind of news site is this? Seems fake. Not reported anywhere else.replycheese_van 16 hours ago | parent | next [–]Not fake but rather breaking news. Bavarian State Office for the Care of Monuments official press release was yesterday, the 14th: https://www.blfd.bayern.de/mam/blfd/presse/pi_bronzezeitlich...But what a beautiful sword!replyApreche 15 hours ago | root | parent | next [–]Glad to be wrong!replymc32 16 hours ago | root | parent | prev | next [–]It is! Why is the hilt at the end instead of the end of the blade?replysephlietz 16 hours ago | root | parent | next [–]With the caveat that I'm not an expert, that's the pommel (hilt is the entire handle) and it is at the bottom to prevent the sword from slipping out of your hand.https://en.wikipedia.org/wiki/Hiltreplymc32 15 hours ago | root | parent | next [–]Heh, you're right on both counts; thanks! Looks like the pommel at the end acts as a counterweight for heavy swords.replymtrower 11 hours ago | root | parent | next [–]Yeah, think about how leverage works, those things really suck to swing around and manipulate if you just bang them out without consideration for balance. Especially the larger ones...replythrowaway_20357 16 hours ago | parent | prev | next [–]Was all over the news in Germany today: https://www.welt.de/geschichte/article245860994/Archaeologie... https://www.faz.net/aktuell/gesellschaft/menschen/3000-jahre... https://www.schwaebische.de/regional/ostalb/archaeologen-fin...replymarginalia_nu 16 hours ago | parent | prev | next [–]> Alle Artikel sind aus der Originalquelle übersetzt. Wir betreiben einen Übersetzungsdienst, um Englischsprachigen in Deutschland zu helfen, zu verstehen, was in ganz Deutschland passiert.All articles are translated from the original source. We run a translation service to help English speakers in Germany understand what's happening across Germany.But yeah, it has strong freebooting energy.replyconstantcrying 15 hours ago | root | parent | next [–]>But yeah, it has strong freebooting energy.The FAZ and Zeit articles are just copy pasted from the dpa, which is why they are identical. I am sure they payed for them, but I can't say I am particularly sorry for them.Welt was the one article I saw which included some more info and a few more pictures.replyGys 16 hours ago | parent | prev [–]The link is a translation. At the bottom is a source link: https://www.faz.net/aktuell/gesellschaft/menschen/3000-jahre...replyroelschroeven 16 hours ago | root | parent [–]That's the website of the Frankfurter Algemeine, which (as far as I know) is a reputable German newspaper.replyGuidelines | FAQ | Lists | API | Security | Legal | Apply to YC | ContactSearch:",
    "hn_summary": "- A 3000-year-old sword has been discovered in Germany, exceptionally well preserved.\n- The sword is made of bronze, which does not rust, making it more resilient than medieval iron swords.\n- The discovery has generated interest because of the level of craftsmanship and detail on the sword, as well as the rarity of finding such well-preserved artifacts from this era."
  },
  {
    "id": 36335104,
    "timestamp": 1686791086,
    "title": "On the slow productivity of John Wick",
    "url": "https://calnewport.com/on-the-slow-productivity-of-john-wick/",
    "hn_url": "http://news.ycombinator.com/item?id=36335104",
    "content": "On the Slow Productivity of John WickJune 13, 2023I found myself recently, as one does, watching the mini-documentary featurettes included on the DVD for the popular 2014 Keanu Reeves movie, John Wick — an enjoyably self-aware neon noir revenge-o-matic, filmed cinematically on anamorphic lenses.At the core of John Wick‘s success are the action sequences. The movie’s director, Chad Stahelski, is a former stuntman who played Reeve’s double in The Matrix trilogy and subsequently made a name for himself as a second unit director specializing in filming fights. When Reeves asked Stahelski to helm Wick, he had exactly this experience in mind. Stahelski rose to the challenge, making the ambitious choice to feature a visually-arresting blend of judo, jiu-jitsu, and tactical 3-gun shooting. In contrast to the hand-held, chaotic, quick-cutting style that defines the Bourne and Taken franchises, Stahelski decided to capture his sequences in long takes that emphasized the balletic precision of the fighting.The problem with this plan, of course, is that it required Keanu Reeves to become sufficiently good at judo, jiu-jitsu, and tactical 3-gun shooting so as not to look clumsy for Stahelski’s stable camera. Reeves was game. According to the featurette I watched, to prepare for production, he trained eight hours a day, four months in a row. The effort paid off. The action set pieces in the movie were show-stopping, and after initially struggling to find a distributor, the film, made on a modest budget, went on to earn $86 million, kicking off a franchise that has since brought in hundreds of millions more.What struck me as I watched this behind-the-scenes feature is how differently creatives who work in the arts think about productivity as compared to creatives who work in office jobs. For Keanu Reeves, it was obvious that the most productive path was to focus all of his attention on a single goal: becoming really good at Stahelski’s innovative brand of gun fu. Doing this, and basically only this, month after month, materialized hundreds of millions of dollar of profit out of the entertainment ether.In office jobs, by contrast, productivity remains rooted in notions of busyness and multi-faceted activity. The most productive knowledge workers are those who stay on top of their inboxes and somehow juggle the dozens of obligations, from the small tasks to major projects, hurled in their direction every week. Movie-making is of course different than, say, being a marketing executive, or professor, or project manager, but creating things that are too good to be ignored, regardless of the setting, is an activity that almost without exception requires undivided attention. Are we so sure that the definition of “productive” that defines knowledge work really is the most profitable use of our talents?John Wick may be shallow entertainment, but the story of its success highlights some deep lessons about what the rest of us might be missing in our pursuit of a job well done.Receive Cal's Essays Directly In Your InboxSubscribeWe respect your privacy. Unsubscribe at anytime.The End of Screens?",
    "summary": "- The success of the movie John Wick is attributed to its visually-arresting action sequences.\n- The director, Chad Stahelski, used long takes to capture the balletic precision of the fighting, in contrast to the chaotic, quick-cutting style of other action franchises.\n- Keanu Reeves trained extensively to become proficient in judo, jiu-jitsu, and tactical 3-gun shooting for the film.\n- The productivity mindset in the arts, such as filmmaking, differs from traditional office jobs where busyness and multitasking are valued.\n- The story of John Wick's success raises questions about whether the definition of productivity in knowledge work is the most profitable use of talents.",
    "hn_title": "On the slow productivity of John Wick",
    "original_title": "On the slow productivity of John Wick",
    "score": 327,
    "hn_content": "- The post discusses the slow productivity of John Wick and how it relates to the concept of deep work.\n- The author refers to a quote from Donald Knuth about the need for uninterrupted concentration and discusses their own aspirations for their career.\n- Commenters debate the attainability of a career focused on deep work and the trade-offs involved.\n- Some commenters discuss the differences between deep work and multitasking in various industries, such as filmmaking and software development.\n- The article prompts readers to consider the balance between busyness and productivity in their own work.\n- The post is special because it challenges the cultural emphasis on constant busyness and highlights the benefits of deep work.\n- The concept of deep work is relevant to those in the industry as it encourages productivity and focus, which are vital skills in a tech career.- Squidward demonstrates his ability to use both instinctive and logical thinking in different situations, such as painting, managing a restaurant, and playing music.\n- He uses System 1 thinking for tasks that he has practiced and mastered, allowing him to perform effortlessly.\n- Squidward switches to System 2 thinking when faced with more challenging tasks that require careful analysis and decision-making.\n- By integrating both thinking systems, Squidward consistently achieves success in his endeavors.\n- Some commenters suspect that the post may have been written by a language model like ChatGPT.\n- The post raises questions about the differences in productivity between the film industry and office jobs.\n- It highlights the importance of focus and dedicated attention in creating high-quality work.\n- The post suggests that in office jobs, productivity is often associated with busyness and multitasking.\n- It mentions the potential benefits of dedicating time to becoming an expert in new technologies before starting a project.\n- The post emphasizes the need for undivided attention when creating things that are too good to be ignored.",
    "hn_summary": "- The post discusses the slow productivity of John Wick and how it relates to the concept of deep work.\n- Commenters debate the attainability of a career focused on deep work and the trade-offs involved.\n- The post challenges the cultural emphasis on constant busyness and highlights the benefits of deep work."
  },
  {
    "id": 36336748,
    "timestamp": 1686806688,
    "title": "11 years of hosting a SaaS",
    "url": "https://ghiculescu.substack.com/p/11-years-of-hosting-a-saas",
    "hn_url": "http://news.ycombinator.com/item?id=36336748",
    "content": "11 years of hosting a SaaSLots of mistakes, some uptime too.ALEX GHICULESCUJUN 14, 2023131Tanda will be turning 11 pretty soon. A reader suggested it would be fun to reflect on things I’ve learned in running the app on the internet during that time.I sat on this post for ages because deployment, hosting, and infrastructure management in general was possibly the most challenging and frustrating part of my job for a decade. Mostly that’s because I constantly dove into the deep end and didn’t know what I was doing a lot of the time. Unfortunately when you have a production app that lots of people use, you don’t always have the time to learn things properly.This post is the story of some of the phases we went through, written in the hope if you see yourself on the same path you can skip a few of the worst bits.Phase 1: HerokuWe started on Heroku, because in 2012 if you did any Ruby on Rails tutorial that included deploying your app, you ended up with a Heroku account.Heroku’s ease of use was unparalleled. But this didn’t mean much to somebody who’d never deployed a web app before. I knew that internet guide authors thought it was the simplest way to deploy an app, but I didn’t understand how big an improvement it was over what came before it.1What I did understand were its weaknesses:PrescriptivenessCostsPrescriptiveness: Heroku worked very well, as long you used it exactly as intended. We were pretty close to this; a web app with a database, some background workers, and a cache.For us there was one slight difference, which is that our app needed to occasionally handle long requests (file uploads) from slow clients (phones or tablets running in places with bad signal). We didn’t pioneer mobile file uploads, but the right way to configure Unicorn to handle them was just different enough from the defaults that it caused me a lot of grief.2 Because I knew nothing about deploying web applications, I decided this was Heroku’s fault.These days I know a little better and can appreciate the complexity of what they were trying to do, but I doubt I was the only person to take their elevator pitch of being everything you need to deploy an app a bit too literally.Costs: Heroku cost a lot more than alternatives like running your own VPS. Of course - it did a lot more! But because this was my first time deploying anything myself I didn’t appreciate the second part of that, and just saw dollar signs when comparing it to alternatives.I imagine this is similar to the experience of newcomers to Rails today, vs those who discovered it (as DHH did) after coming from Java or something else in the bad old days. Your appreciation of how much better this is than what used to be there will not be the same. Luckily, these days you could easily get that same appreciation by trying to build a full stack Javascript app and then coming back to Rails.Anyway, cost is what eventually led to us migrating off Heroku. Our last Heroku invoice was… $104.95. 🤦‍♂️Phase 2: Digital OceanAbout a year into Tanda I had an intern from my university who was super interested in infrastructure and cost optimisation. He basically convinced me that paying for Heroku was like setting money on fire. He was a lovely guy, and I really appreciated his help at the time, but 10 years later I can honestly say this was awful advice (the buck stops with me for listening to it).Moving off Heroku meant replacing all the bits that Heroku did. We didn’t do it in a fully automated way, because we were sub-scale! We were so small, there would be no point. Instead, we just point and clicked a servers in Digital Ocean’s UI. Then we set up some Capistrano scripts to deploy to them. Over a weekend, we took the site offline for some ridiculously short period of time, downloaded the database from Heroku, uploaded it to a Digital Ocean “droplet” (aka server), and changed the DNS records. We had migrated over!Our first Digital Ocean invoice was for $28.93, and our second (the first full month) was for $39.23. I thought I was so smart saving $2 a day. For a while it worked okay; it turns out $40/month bought a lot more servers than we actually needed to run our very small app.The cracks started to show when we started to grow faster. We were doubling the size of our customer base every 9 months, and pretty soon this meant we needed more servers. The process of adding them was manual, finicky, and easy to get wrong. I worked out how to do it but I always had a bad feeling in my stomach when adding extra “hardware”.The cracks really started to show when our database server started getting overloaded. Pretty consistently if we didn’t deploy the site for more than a day, Postgres would run out of memory and get killed by the operating system. Sometimes it would fix itself, but more often it would require someone to SSH into app servers and restart them all. This was an annoying part of the workday during the business hours, but I have more than a few memories of restarting servers on my phone from the toilets of bars during this time.3But the worst Digital Ocean incident we ever had was when they turned all our droplets off all at once. The credit card entered into the account had expired, there was no way to enter a backup card, and the contact email on the account went to a shared inbox that was not monitored. So for probably a month we were getting and ignoring billing alerts, until we really paid attention when everything was offline and not responding to SSH. This wasn’t totally their fault, but at the time it just all felt like a dodgy, shaky setup.Writing all this nearly 10 years later feels very cringe, it’s shocking how little we knew and a bit of a miracle we got away with it. If I had a time machine I’d go back and tell myself to spend 10x more on Digital Ocean ($500/month really wouldn’t have broken the bank) and sleep properly.After about 3 years on Digital Ocean, we decided that the platform was too simple for our growing needs. We were starting to sign bigger customers on, and we thought we needed a more enterprisey approach to hosting our app. We wanted a managed database instead of managing our own Postgres our own server. We wanted less platform downtime.4 We needed to be able to autoscale in response to fluctuations in demand, and we needed to be able to load balance different routes to different groups of resources (… of our monorepo). We thought we needed all these things to be legitimate.In hindsight, most of this logic was backwards. Auto scaling is a technique, not a product monopolised by AWS. Instead of seeking more challenges, we should have found a platform that was simple enough that we could actually master it. (The managed database thing was a good idea though.)The only reasonable reason to move off DO was that they didn’t have an Australian data center, and we had some customers that really cared about that. At the time it was just around the corner; it launched in late 2022. So it’s good we didn’t wait for that.Anyway. We needed to level up. And if you want to level up your hosting, who you gonna call?Phase 3: AWSWe needed to be a real business, and real businesses hosted their apps on AWS. So that’s what we did. Specifically, we ported our exact Digital Ocean infrastructure onto AWS EC2. We didn’t take advantage of any other platform features, we just treated AWS like any other VPS.A few months later I learned that we were entitled to an AWS account manager. I learned this from a customer, who also did an intro. I was pretty excited - I thought an account manager would be able to help us grow very quickly and get to a nirvana where we didn’t have constant fear about scaling.At our first meeting our account manager brought along his solutions architect. I had never met a solutions architect, so I didn’t really know what they did. All this guy did was answer every question we asked about anything with “how would that work in a world without servers?”. I didn’t really understand how AWS Lambda would help us (still don’t) but he didn’t have anything useful to contribute except for reminding us it existed.5 I had been so excited about having an account manager, so for a while I felt dumb for not understanding Lambda and not being smart enough to make AWS work. Eventually I realised that I wasn’t the problem.Another fun incident about a year later was that we ran out of integers. Our Rails app was pretty old, and almost every table used integer as its primary key type. Newer versions of Rails created new tables as bigints, but nobody in our team realised this was a problem until one Friday (you can’t make this stuff up - it was Friday the 13th!) we couldn’t insert any new rows into the mostly commonly written table. Luckily everyone was still at the office drinking, so we were able to respond to the incident pretty quickly. This story really resonates.This incident prompted us to put a lot more effort into monitoring so we could respond more quickly when things break (this was a silver lining). It also gave me a lifelong paranoia about other hidden gotchas in PostgreSQL that I have never been able to fully shake (I’m not sure if this was a silver lining).In more recent times, major projects in AWS land have mostly been compliance related things. Making sure we tick every box for GDRP and equivalents in other countries led to getting SOC-2 certified. For all these things, being able to point to the Amazon logo made things a little bit easier, but it’s not the case that anything we wanted to do was made possible or impossible by being on a specific cloud.A few years into AWS we started to feel stable on it, infrastructure wise. We hadn’t architectured our stack for a while, and we didn’t see a big need to - two big achievements! The next major challenge we faced was institutional knowledge, or lack thereof. Over Tanda’s history, less than 10 people had worked in “DevOps” (very broadly defined). But people come and go. 2 were around at the moment, 1 was finishing up soon, so the idea of having only a single Site Reliability Engineer in the team was not very appealing.Not that the SREs were working entirely alone. We’d had an oncall rotation for engineers for a while too, but we weren’t very good at training people on tricky parts of the stack beyond the Rails app. So oncall folks spent a lot of time acknowledging alerts and monitoring them, but only on a few occasions did they successfully get in the weeds and fix issues or improve systems significantly.Basically, the system was being held together by string and random bursts of individual brilliance. That’s a bad long term strategy. We needed a proper team structure so that we never depended on one person being able to debug any issue.Phase 4: Platform Infrastructure Team (PIT)To do this, about a year ago we created a Platform Infrastructure Team, reporting to the CTO. The team had several people in every time zone so we had 24 hour coverage for Ops, Infrastructure, and related work.This was a big highlight personally - I finally stopped being on call!It also was the first time I really felt like we had a team that was building expertise. After a decade of worrying we didn’t know enough, having things break in embarrassing ways, and changing platforms a lot, it felt great to have a roadmap to stability and professionalism.The first thing the PIT did was end a bunch of half-done ongoing infrastructure projects and trim as much unused infrastructure as possible. Between that and documenting the oncall process properly they got rid of a lot complexity very quickly. This made everyone in the team more productive right away, and also gave them ownership over the system.The official Platform Infrastructure Team hat, on the head of our CTO, Leon.It’s still a work in progress, because building expertise in complex domains takes a long time. But for the first time ever I’m really confident in the team, and really proud of what they’ve achieved in a year.By the way, we’re still on AWS, but this doesn’t mean we don’t want to change platform ever again. It’s always good to explore what’s out there, and we’ve spent a bit of time learning more about moving off the cloud to a managed data center. But the nice thing is not feeling like we need to.If I had a time machineIf I had a time machine to go back to 2012 and give myself a few pointers, what would I say?Lots of little tips, and three big ones. Both boil down to spending a bit more money, to avoid a lot of headaches.Use managed services for as long as possible. We did ourselves a big disservice by leaving Heroku after only a few months. We should have stayed on it for years - there was so much time wasted managing servers that could have been done for us during critical early days.Set up a PIT sooner. I should have set up a team of professionals who wanted to work in this space much much earlier. Not in the Heroku days, but once it became untenable as we hit real scale.Look after yourself just a bit more. For some reason I always found it really hard to prioritise projects that would decrease alerts, simplify oncall, or help me get more sleep. Until suddenly one day I snapped and reallocated a lot of budget to set up the PIT team. Getting decent sleep has many commercial benefits and it’s not selfish to prioritise that over other things the team could work on.Thanks to Austin and Dave for reading drafts of this. Bigger thanks to those two, and to everyone else who’s worked on keeping us online and clocking over the years. I only take credit for the stuff we got wrong.1I think products like Twilio and Stripe face a similar challenge as we head into less frothy economic times.2For the exact details on what went wrong, you can read Heroku’s guide to Deploying Unicorn, specifically the Slow Clients section. That section appeared some time after I had a call with a Heroku support engineer about our issues. I ended up replacing Unicorn with Puma.3Eventually I came across an issue with prepared statements on Rails 4.2 which seemed to cause exactly the issue we had. Here is a blast from the past. I slept well that night!4At the time we thought DO was really unstable and constantly taking us offline while they did maintenance things. That was true sometimes, but these days I’m not so sure it wasn’t us being a bit incompetent too.5By the way, most people I know still use servers.131",
    "summary": "- The author reflects on their experiences hosting a SaaS app for 11 years and shares the lessons they've learned.\n- They started on Heroku but found it had limitations and was costly.\n- They then moved to Digital Ocean, which initially worked well but had issues with scalability and downtime.\n- Eventually, they migrated to AWS, but faced challenges in understanding and using all the features available.\n- They formed a Platform Infrastructure Team (PIT) to improve stability and professionalism in managing their infrastructure.\n- The author offers advice to their past self, including using managed services, setting up a PIT sooner, and prioritizing self-care.\n- They express gratitude to their team members for their efforts in keeping the app running over the years.",
    "hn_title": "11 years of hosting a SaaS",
    "original_title": "11 years of hosting a SaaS",
    "score": 307,
    "hn_content": "- Using managed services can save time and resources when building a product\n- Choosing the right database depends on the specific needs of your project\n- SQLite is gaining popularity due to its low barrier of entry and simplicity\n- Cloudflare D1 and other similar services can provide cost reduction and simplicity\n- Managed services like RDS can be a good option for scalability and simplicity\n- Self-hosting can be a viable option for certain use cases, but it requires more maintenance and expertise\n- Heroku was a popular choice for Rails developers in the past\n- Infrastructure and incident management are essential for a successful SaaS application\n- It's important to have a backup strategy and be prepared for downtime\n- The development landscape has evolved, and now there are more options available for deploying and managing applications.- Azure App Service is often overlooked, despite its capabilities and revenue.\n- Railway, a similar service, is praised for its user experience but has reliability issues.\n- Other alternatives mentioned include Render, Fly.io, and Qovery.\n- Fly.io is considered the least bad option.\n- Heroku is still regarded as the best option for putting something online effortlessly.\n- Vercel is recommended for serverless apps.\n- Some suggest that people are DIYing their solutions more often with tools like Docker and DigitalOcean.\n- Coherence, Digital Ocean App Platform, and Render are mentioned as good options.\n- Flightcontrol.dev is a new PaaS-like platform that operates on AWS accounts.\n- Other new options include FL0.com and Railway.app.\n- The importance of choosing the right tool and considering simplicity and performance is emphasized.\n- The benefits and drawbacks of using managed services, like AWS, are discussed.\n- K8s is seen as both a helpful and potentially complex solution.\n- The article author's mistakes are criticized, but they are commended for creating a successful business.\n- The value of thinking ahead and making informed decisions is emphasized.\n- The discussion touches on topics like database scalability, choosing a suitable language, and infrastructure management.\n- Managed hosting options like Meteor Galaxy are recommended for ease of use and reduced devops work.\n- The tradeoff between cost and infrastructure management is acknowledged.",
    "hn_summary": "- Using managed services can save time and resources when building a product.\n- Choosing the right database depends on the specific needs of your project.\n- Cloudflare D1 and other similar services can provide cost reduction and simplicity."
  }
]
