[
  {
    "id": 37778496,
    "title": "Odkiaľ môj počítač berie čas?",
    "originLink": "https://dotat.at/@/2023-05-26-whence-time.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37778496",
    "commentBody": "",
    "originSummary": [
      "Príspevok na blogu poskytuje podrobný prehľad zdrojov a systémov, ktoré počítače využívajú na udržiavanie presného času, počnúc servermi sieťového časového protokolu (NTP) až po medzinárodné meracie systémy na vysokej úrovni.",
      "Diskusia sa zaoberá aj históriou merania času a objasňuje prechod od astronomického merania času k presnejším atómovým hodinám.",
      "Autor objasňuje, že na rozdiel od všeobecného presvedčenia počítače nezískavajú čas z Kráľovského greenwichského observatória."
    ],
    "commentSummary": [
      "Diskusie sa venujú najmä technickým aspektom vrátane zdroja času pre počítače, využitia blockchainu a výziev súvisiacich so synchronizáciou času.",
      "Skúma presnosť hodín v automobiloch a nepohodlie pri ich ručnom nastavovaní, ako aj podrobnosti o inštitúciách a technológiách, ktoré sa podieľajú na meraní času.",
      "V závere sa venuje skúmaniu toho, ako vreckové zariadenia, ako napríklad smartfóny, určujú a synchronizujú čas, a prostredníctvom anekdot o domácich zvieratách sa krátko dotkne témy vnímania času zvieratami."
    ],
    "points": 713,
    "commentCount": 217,
    "retryCount": 0,
    "time": 1696513357
  },
  {
    "id": 37777050,
    "title": "Zavádzanie protokolu HTTP/3 rýchlo rastie",
    "originLink": "https://blog.apnic.net/2023/09/25/why-http-3-is-eating-the-world/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37777050",
    "commentBody": "",
    "originSummary": [
      "HTTP/3, nová verzia protokolu HTTP (Hypertext Transfer Protocol), sa po štandardizácii pracovnou skupinou pre internetové inžinierstvo (IETF) rýchlo stala súčasťou verejného webu.",
      "Protokol HTTP/3 spolu so súvisiacim protokolom QUIC vo veľkej miere využívajú veľké spoločnosti ako Google a Meta a nahrádza protokol TCP (Transport Control Protocol) protokolom QUIC, ktorý ponúka vylepšené šifrovanie a zvýšenie výkonu.",
      "Nový protokol poskytuje vyššiu rýchlosť načítavania webových stránok a streamovania videa, čo prispelo k jeho rýchlemu prijatiu v odvetví."
    ],
    "commentSummary": [
      "Diskusie sa točia okolo niekoľkých tém, ako je používanie protokolu QUIC na prekonávanie obmedzení internetu v Číne, výhody a prekážky protokolu QUIC a implementácia QoS v protokole QUIC.",
      "Súčasťou dialógu je nespokojnosť podnikov so službou zabezpečenia siete Zscaler, používanie protokolu SSL na zachytávanie v podnikových sieťach a stratégie balenia a kódovania videa.",
      "Nakoniec sa diskutuje o potrebe štandardného rozhrania API QUIC a o výhodách použitia funkcie mmap() namiesto funkcie read() na spracovanie veľkých súborov údajov."
    ],
    "points": 564,
    "commentCount": 431,
    "retryCount": 0,
    "time": 1696503592
  },
  {
    "id": 37777347,
    "title": "Bitmagnet: DHT crawler a vyhľadávač torrentov",
    "originLink": "https://bitmagnet.io/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37777347",
    "commentBody": "",
    "originSummary": [
      "Bitmagnet je samostatne hostovaný indexer BitTorrent s jedinečnými funkciami, ako je prehľadávač distribuovanej tabuľky DHT (Distributed Hash Table), klasifikátor obsahu a vyhľadávač torrentov; tie umožňujú používateľom vyhľadávať torrenty bez toho, aby sa spoliehali na externé subjekty.",
      "Projekt je stále vo fáze alfa, ale už teraz má niekoľko sľubných funkcií, ako napríklad všeobecný indexátor BitTorrent, klasifikátor obsahu, vyhľadávač torrentov a rozhranie GraphQL API - technológiu, ktorá uľahčuje získavanie údajov zo servera do klienta.",
      "Tím pracuje na prioritných funkciách, ktoré ešte neboli implementované, ako sú klasifikátory pre iné typy obsahu, zoraďovanie výsledkov vyhľadávania, optimalizácia výkonu vyhľadávania a ďalšie užitočné funkcie, napríklad overovanie, uložené vyhľadávania a podpora protokolu BitTorrent v2. Je otvorený pre podporu na GitHub."
    ],
    "commentSummary": [
      "Diskusia sa zameriava na rôzne prvky prehľadávania DHT, konkrétne na jeho implementáciu a optimalizáciu jeho nástrojov.",
      "Medzi ďalšie naliehavé problémy patrí nezákonný a falšovaný obsah, požiadavka na moderovanie a systémy reputácie.",
      "Diskutuje sa aj o možnostiach vlád kontrolovať zašifrovaný obsah."
    ],
    "points": 416,
    "commentCount": 93,
    "retryCount": 0,
    "time": 1696506257
  },
  {
    "id": 37782493,
    "title": "Ako rýchle sú vlastne linuxové potrubia? (2022)",
    "originLink": "https://mazzo.li/posts/fast-pipes.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37782493",
    "commentBody": "",
    "originSummary": [
      "Článok sa zaoberá fungovaním unixových potrubí v Linuxe s dôrazom na optimalizáciu testovacieho programu pre zápis a čítanie dát cez potrubie.",
      "Venuje sa používaniu techník, ako sú vmsplice a splice, na zvýšenie priepustnosti znížením kopírovania údajov a používaniu nástroja perf na analýzu výkonu.",
      "Rozoberá tiež úlohu stránkovania, virtuálnej pamäte pri prenose dát, preklad virtuálnych adries na fyzické a použitie obrovských stránok na zníženie počtu zlyhaní TLB (Translation Lookaside Buffer)."
    ],
    "commentSummary": [
      "Článok podrobne opisuje implementáciu a výkonnosť linuxových potrubí a zdôrazňuje potenciálne výhody mechanizmu zdieľanej pamäte vmsplice napriek problémom pri optimalizácii jeho verzií.",
      "Venuje sa knižniciam, API na spracovanie údajov a optimalizáciu, nepredvídateľnému správaniu linuxových potrubí a rozoberá dôsledky porušených potrubí.",
      "Skúmajú sa alternatívne metódy prenosu dát, ako je zdieľaná pamäť alebo fronty správ, a optimalizačné techniky, ako sú io_uring a mmap. Diskutuje sa aj o použití potrubí v shell skriptovaní pre vysoko výkonné úlohy, ako aj o kompromisoch a výsledkoch výkonu pri výbere medzi vláknami a potrubiami."
    ],
    "points": 391,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1696531769
  },
  {
    "id": 37782513,
    "title": "Obchod s aplikáciami len pre inštalovateľné webové aplikácie",
    "originLink": "https://store.app",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37782513",
    "commentBody": "",
    "originSummary": [
      "Store.app, mobilná aplikácia vyvinutá spoločnosťou PWA Labs, Inc, poskytuje funkcie, ktoré umožňujú používateľom prihlásiť sa, zaregistrovať, navigovať, vytvárať profily, upravovať nastavenia, vytvárať zoznamy a ukladať obľúbené položky.",
      "Aplikácia ponúka širokú škálu kategórií vrátane umelej inteligencie, šifrovania, hier, produktivity, nakupovania a sociálnych sietí a umožňuje používateľom inštalovať a ovládať rôzne aplikácie v rámci týchto skupín.",
      "Medzi obľúbené aplikácie patria Wordi Games, Replit Dev Tools, friend.tech, Canva a mnohé aplikácie umelej inteligencie."
    ],
    "commentSummary": [
      "Hlavnou témou diskusie sú progresívne webové aplikácie (PWA) a ich potenciálne výhody oproti natívnym aplikáciám, pokiaľ ide o použiteľnosť a funkčnosť.",
      "Spätná väzba sa zdieľa v konkrétnom obchode s aplikáciami pre PWA a zahŕňa funkcie, ako sú filtre, proces inštalácie, dojmy používateľov a obavy o bezpečnosť spolu s návrhmi na zlepšenie.",
      "Pokrytá je aj pripravovaná platforma Store.app, ktorá je zameraná na pomoc webovým vývojárom. Poskytuje užitočné nástroje a widgety, ale niektorí používatelia hlásia problémy s inštaláciou a aktualizáciou. Upozorňuje sa aj na prebiehajúcu diskusiu o výhodách a nevýhodách aplikácií v porovnaní s webovými stránkami."
    ],
    "points": 377,
    "commentCount": 173,
    "retryCount": 0,
    "time": 1696531810
  },
  {
    "id": 37784499,
    "title": "NIST Elliptic Curves Seeds Bounty",
    "originLink": "https://words.filippo.io/dispatches/seeds-bounty/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37784499",
    "commentBody": "",
    "originSummary": [
      "Odmena 12 000 dolárov je ponúkaná každému, kto dokáže dekódovať päť hashov prispievajúcich k eliptickým krivkám NIST, ktoré sú rozšírené v súčasnej kryptografii.",
      "Ak sa príjemca rozhodne darovať odmenu na charitatívne účely, sľubuje sa jej zvýšenie na 36 000 USD. Považuje sa to za stimul, ktorý má podporiť väčšiu účasť na riešení kryptografického problému.",
      "Cieľom tejto iniciatívy je rozptýliť akékoľvek podozrenia alebo obavy týkajúce sa bezpečnosti kriviek NIST, ktoré údajne vytvoril jeden už zosnulý výskumník na základe zaheslovaných anglických viet."
    ],
    "commentSummary": [
      "Za objavenie reťazca, ktorý sa používa na generovanie náhodných semien pre krivky P NIST, čo je typ kryptografie s eliptickými krivkami, sa ponúka odmena.",
      "Diskusia sa zameriava na možnosť \"zadných dverí\" v kryptografických algoritmoch a na problém ich bezpečnej integrácie, pričom sa vyjadruje skepsa k bezpečnosti kriviek NIST.",
      "Diskutuje sa aj o pôvode semien, ktoré poskytuje NSA (Národná bezpečnostná agentúra), a o možných alternatívnych metódach ich tvorby."
    ],
    "points": 345,
    "commentCount": 69,
    "retryCount": 0,
    "time": 1696541212
  },
  {
    "id": 37778069,
    "title": "Výkonnosť databázy v mierke - kniha zadarmo",
    "originLink": "https://www.scylladb.com/2023/10/02/introducing-database-performance-at-scale-a-free-open-source-book/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37778069",
    "commentBody": "",
    "originSummary": [
      "Nová open-source kniha \"Database Performance at Scale\", ktorej autormi sú zamestnanci a prispievatelia spoločnosti ScyllaDB, poskytuje praktické rady na zvýšenie výkonu databáz.",
      "Hoci ju napísali členovia tímu ScyllaDB, jej zásady sa vzťahujú na používateľov akejkoľvek databázy a pokrývajú rôzne prvky ovplyvňujúce výkon.",
      "Kniha, ktorá ponúka jedinečný pohľad autora na kompromisy a odporúčania, je k dispozícii zadarmo v digitálnom formáte a je možné si ju zakúpiť v tlačenej podobe. Je pod medzinárodnou licenciou Creative Commons Attribution 4.0."
    ],
    "commentSummary": [
      "Spoločnosť ScyllaDB poskytuje bezplatnú knihu s názvom \"Database Performance at Scale\", ktorá sa zaoberá viacerými aspektmi optimalizácie a škálovateľnosti databáz.",
      "V knihe sa rozoberá niekoľko tém vrátane ťažkostí pri používaní Elasticsearch, výhod denormalizácie údajov a úvah o výbere databázy s vysokou kapacitou zápisu.",
      "Zdôrazňuje tiež význam dôkladného hodnotenia pri výbere databázy a rozoberá problémy, ktoré vznikajú pri používaní databázy ako primárneho úložiska systému, pričom zdôrazňuje potrebu efektívnej optimalizácie databázových dotazov."
    ],
    "points": 321,
    "commentCount": 108,
    "retryCount": 0,
    "time": 1696510944
  },
  {
    "id": 37781862,
    "title": "Spoločnosť HP nedokázala vyvrátiť tvrdenia, že pri nedostatku atramentu blokuje skenery v tlačiarňach",
    "originLink": "https://abcnews.go.com/Technology/wireStory/hp-fails-derail-claims-bricks-scanners-multifunction-printers-102286365",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37781862",
    "commentBody": "",
    "originSummary": [
      "Spoločnosť HP Inc. čelí hromadnej žalobe, v ktorej sa tvrdí, že pri vyčerpaní atramentu deaktivuje funkcie skenovania a faxovania vo svojich tlačiarňach.",
      "Žaloba obviňuje spoločnosť HP z úmyselného zatajovania týchto informácií pred spotrebiteľmi s cieľom zvýšiť predaj drahých atramentových kaziet.",
      "Federálny sudca povolil pokračovanie v súdnom konaní a zamietol žiadosť spoločnosti HP o zamietnutie prípadu. Ide o opakujúci sa problém, pričom iná skupina zažalovala spoločnosť Canon Inc. v roku 2021 za podobné praktiky."
    ],
    "commentSummary": [
      "Používatelia vyjadrujú frustráciu z tlačiarní HP, pretože sa domnievajú, že sú navrhnuté tak, aby prestali fungovať, keď je hladina atramentu nízka, čo vyvoláva diskusie o spoľahlivých a úsporných alternatívach tlače.",
      "Laserové tlačiarne Brother a tlačiarne Canon Pixma s plniteľnými nádržkami na toner sa spomínajú pre svoju cenovú výhodnosť, hoci v zmiešaných recenziách sa uvádzajú problémy, ako napríklad problémy s pripojením WiFi v prípade tlačiarní Brother.",
      "Okrem typu tlačiarne sa v diskusiách objavujú problémy s dostupnosťou cenovo dostupných skenerov, komplikácie s náplňami do tlačiarní, potreba tlačených kópií v rôznych kontextoch a výzvy na zlepšenie predpisov a etiky v odvetví tlačiarní."
    ],
    "points": 298,
    "commentCount": 156,
    "retryCount": 0,
    "time": 1696529002
  },
  {
    "id": 37777301,
    "title": "Fond Krita nemá žiadnu firemnú podporu",
    "originLink": "https://fund.krita.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37777301",
    "commentBody": "",
    "originSummary": [
      "Vývojový fond Krita sa uchádza o finančnú pomoc na zamestnanie viac ako desiatich vývojárov na plný úväzok pre Krita, populárny open-source softvér na digitálne maľovanie.",
      "Jednotlivci a spoločnosti sa môžu do fondu zapojiť výberom úrovne členstva a prísľubom mesačného príspevku. K dispozícii sú rôzne možnosti členstva, ktoré ponúkajú rôzne úrovne verejného alebo súkromného potvrdenia.",
      "V súčasnosti má fond 349 individuálnych prispievateľov, ale žiadnych firemných prispievateľov, pričom celková výška jeho mesačných príspevkov predstavuje 4426 EUR."
    ],
    "commentSummary": [
      "Diskusia sa týkala rôznych aspektov softvéru s otvoreným zdrojovým kódom, napríklad financovania, potenciálnych regulačných požiadaviek a výhod a nevýhod takýchto nástrojov.",
      "Rozhovor sa zameral aj na softvér Krita, pričom sa podrobne opísali prípady jeho použitia, obmedzenia, licenčné a finančné modely, ako aj konštruktívna kritika a jeho úloha v podnikoch.",
      "Ďalšími širšími témami boli rozdiely v odmeňovaní vývojárov softvéru a vplyv úspor z rozsahu na úspech podniku."
    ],
    "points": 292,
    "commentCount": 211,
    "retryCount": 0,
    "time": 1696505898
  },
  {
    "id": 37777440,
    "title": "Vláda USA udelila spoločnosti Dish Network vôbec prvú pokutu za vesmírny odpad",
    "originLink": "https://www.theguardian.com/science/2023/oct/02/fcc-space-debris-fine-dish-network-satellite",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37777440",
    "commentBody": "",
    "originSummary": [
      "Americká Federálna komunikačná komisia (FCC) uložila spoločnosti Dish Network pokutu 150 000 USD za porušenie predpisov proti vesmírnemu odpadu.",
      "Spoločnosť Dish Network je potrestaná za nesprávne vyradenie svojej družice EchoStar-7 z obežnej dráhy, čo môže viesť k zvýšenému množstvu orbitálneho odpadu.",
      "Tento prípad predstavuje vôbec prvú pokutu za vesmírny odpad, ktorú vymáha vláda USA, čo poukazuje na zámer FCC dodržiavať svoje pravidlá týkajúce sa vesmírneho odpadu v podmienkach rýchlo sa rozvíjajúceho vesmírneho hospodárstva."
    ],
    "commentSummary": [
      "Americká vláda udelila prvú pokutu za vesmírny odpad, pričom spoločnosti Dish Network vyrubila 150 000 USD za porušenie predpisov a ďalšiu pokutu vo výške 126 miliónov USD od FCC za nesprávnu likvidáciu satelitov.",
      "Ďalšej satelitnej spoločnosti Swarm Technologies bola uložená pokuta 900 000 USD za neoprávnené vypúšťanie satelitov.",
      "Sankcie podnietili diskusie o problémoch pri záchrane uviaznutých satelitov, o význame plánov likvidácie a dodržiavaní právnych predpisov na zmiernenie vesmírneho odpadu a o potenciálnej ziskovosti pri riešení problémov s vesmírnym odpadom."
    ],
    "points": 265,
    "commentCount": 99,
    "retryCount": 0,
    "time": 1696506873
  },
  {
    "id": 37776854,
    "title": "September bol najhorúcejším mesiacom v histórii",
    "originLink": "https://www.scientificamerican.com/article/september-was-the-most-anomalously-hot-month-ever/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37776854",
    "commentBody": "",
    "originSummary": [
      "September 2023 bol najteplejším mesiacom v histórii, pričom teplotná anomália bola o 0,5 stupňa Celzia vyššia ako predchádzajúci rekord.",
      "V roku 2023 môže teplota prvýkrát v histórii prekročiť 1,5 stupňa Celzia v porovnaní s teplotou v predindustriálnom období, a to v dôsledku rastúcich emisií skleníkových plynov zo spaľovania fosílnych palív a javu El Niño.",
      "Tieto rekordné teploty zdôrazňujú potrebu okamžitých opatrení na obmedzenie globálneho otepľovania."
    ],
    "commentSummary": [
      "Rozhovor sa týka rôznych aspektov zmeny klímy, ako sú jej príčiny, dôsledky, obmedzenia vedeckého poznania, úloha vlády, hospodárske dôsledky a nevyhnutná potreba alternatívnych zdrojov energie.",
      "Diskurz sa zaoberá aj spoločenským vplyvom, pričom sa diskutuje o správaní a výbere stravy, vplyve výroby plastov, potrebe vládnych zásahov a rôznych reakciách na krízu.",
      "Rozdielne názory a pohľady na jednotlivé témy vyvolali diskusie a spory, ktoré zdôrazňujú zložitosť klimatickej krízy a náročnosť hľadania účinných riešení."
    ],
    "points": 245,
    "commentCount": 380,
    "retryCount": 0,
    "time": 1696501671
  },
  {
    "id": 37781022,
    "title": "Booking.com zarába majetok - tak prečo necháva svoje účty hotelom nezaplatené?",
    "originLink": "https://www.theguardian.com/business/2023/oct/03/bookingcom-makes-a-fortune-so-why-is-it-leaving-its-bills-to-small-hotels-unpaid",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37781022",
    "commentBody": "",
    "originSummary": [
      "Mnohé malé hotely a partneri spoločnosti Booking.com hlásili od júla oneskorenie platieb, čo týmto podnikom spôsobilo finančný stres.",
      "Napriek tomu, že spoločnosť Booking.com hlási rekordné zisky, na otázky partnerov týkajúce sa dlžných platieb zväčša nereaguje a mlčí.",
      "Nedostatok platieb a zlá komunikácia viedli k značným finančným ťažkostiam týchto podnikov, čo malo vplyv na ich schopnosť pokryť náklady a splácať dlhy. Partneri naliehajú na spoločnosť Booking.com, aby okamžite konala, zabezpečila transparentnosť a včasné platby."
    ],
    "commentSummary": [
      "Hlavná diskusia sa týka kritiky a negatívnych skúseností so spoločnosťou Booking.com a zameriava sa na problémy, ako sú oneskorené platby, oneskorené úhrady a zákaznícka podpora.",
      "Diskutuje sa o výhodách a nevýhodách používania rezervačných stránok tretích strán v porovnaní s priamymi rezerváciami hotelov, pričom sa pridávajú obavy týkajúce sa bezpečnosti kreditných kariet a hľadania vhodného ubytovania.",
      "V rozhovore sa tiež vyzýva na posilnenie ochrany spotrebiteľov a potrebu riešiť dominantné postavenie na trhu v odvetví cestovného ruchu."
    ],
    "points": 229,
    "commentCount": 214,
    "retryCount": 0,
    "time": 1696525016
  },
  {
    "id": 37781231,
    "title": "Generatívna umelá inteligencia by mohla sťažiť dôveryhodnosť vyhľadávania",
    "originLink": "https://www.wired.com/story/fast-forward-chatbot-hallucinations-are-poisoning-web-search/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37781231",
    "commentBody": "",
    "originSummary": [
      "Vyhľadávač Bing spoločnosti Microsoft neúmyselne zobrazoval falošné fakty generované chatbotmi ako presné informácie, čo poukázalo na problémy so spoľahlivosťou umelej inteligencie vo výsledkoch webového vyhľadávania.",
      "Tento náhodný experiment odhalil, ako môžu systémy poháňané umelou inteligenciou potenciálne posilniť šírenie dezinformácií na webe.",
      "Tento problém by sa mohol vystupňovať s nárastom obsahu generovaného umelou inteligenciou na platformách vyhľadávania a v sociálnych médiách, čo vyvoláva vážne otázky o ich spoľahlivosti."
    ],
    "commentSummary": [
      "Hlavnou témou sú obavy zo šírenia dezinformácií v dôsledku používania umelej inteligencie (AI) pri vytváraní obsahu výsledkov vyhľadávania.",
      "Na fóre sa diskutuje o obmedzeniach umelej inteligencie pri vytváraní presných informácií a o ťažkostiach pri rozlišovaní falošných naratívov, pričom sa navrhujú rôzne platformy a nástroje na overovanie zdrojov.",
      "Nechýba ani dialóg o vplyve umelej inteligencie na rôzne priemyselné odvetvia a kritika spravodajstva časopisu Wired o technologickom sektore, pričom sa zdôrazňuje potreba zlepšiť kurátorstvo a prístup k dôveryhodným zdrojom informácií."
    ],
    "points": 214,
    "commentCount": 207,
    "retryCount": 0,
    "time": 1696526024
  },
  {
    "id": 37778531,
    "title": "Volkswagen Beetle Rona Patricka s prúdovým motorom (2006)",
    "originLink": "https://www.ronpatrickstuff.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37778531",
    "commentBody": "",
    "originSummary": [
      "Ron Patrick skonštruoval osobný projekt Volkswagen Beetle s cestnou premávkou a prúdovým pohonom, ktorý obsahuje benzínový motor na bežnú jazdu aj prúdový motor na adrenalínovú jazdu.",
      "Hoci vozidlo vyzerá ako štandardný Beetle a je registrované v Kalifornii, úpravy motora by mohli zabrániť tomu, aby prešlo smogovou kontrolou nového vozidla. Na svoj prúdový pohon využíva repasovaný turbohriadeľový motor z vrtuľníka.",
      "Napriek svojmu netradičnému dizajnu bol na autosalónoch dobre prijatý a vzbudil značnú pozornosť. Kalifornský úrad pre motorové vozidlá skúma, či toto dvojmotorové vozidlo nepredstavuje bezpečnostné riziko."
    ],
    "commentSummary": [
      "Diskusia zahŕňa rôzne témy, ako napríklad využitie prúdových motorov a turbín v rôznych oblastiach vrátane hybridných automobilov a úprav vozidiel.",
      "Medzi hlavné témy patrí účinnosť a obmedzenosť turbín, ako aj právne a bezpečnostné problémy spojené s montážou prúdového motora do automobilu.",
      "Venuje sa aj príkladom vozidiel s turbínovým pohonom, ich komerčnému triumfu, kultúrnym rozdielom v predpisoch a technickým detailom úpravy auta s prúdovým motorom."
    ],
    "points": 201,
    "commentCount": 121,
    "retryCount": 0,
    "time": 1696513528
  },
  {
    "id": 37778771,
    "title": "Šéf spoločnosti Lenovo PC: Do roku 2025 bude možné opraviť 4 z 5 našich zariadení",
    "originLink": "https://www.theregister.com/2023/10/05/lenovo_pc_boss_4_in/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37778771",
    "commentBody": "",
    "originSummary": [
      "Spoločnosť Lenovo, popredný svetový výrobca osobných počítačov, odhalila plány, podľa ktorých bude do roku 2025 možné opraviť 80 % jej zariadení vrátane opravovaných dielov.",
      "Táto iniciatíva je súčasťou záväzku spoločnosti dosiahnuť do roku 2050 nulové čisté emisie a je v súlade s úsilím Európskej rady o revíziu nariadení EÚ o práve na opravu.",
      "Spoločnosť Lenovo tvrdí, že zdôrazňovanie opraviteľnosti nebude brániť podnikaniu a je nevyhnutným krokom k udržateľnosti a informovaniu spotrebiteľov o životnosti produktov."
    ],
    "commentSummary": [
      "Spoločnosť Lenovo plánuje, že do roku 2025 bude 80 % jej zariadení opraviteľných, čo ocenia zákazníci, ktorí sa obávajú neopraviteľnosti súčasných zariadení.",
      "Niektorí používatelia vyjadrujú obavy v súvislosti s predchádzajúcimi incidentmi spoločnosti Lenovo, ktoré sa týkali škodlivého softvéru a zadných vrát, a varujú ostatných, aby zostali ostražití.",
      "Tento plán pozitívne reaguje na nespokojnosť vyjadrenú v súvislosti so spájkovanou pamäťou RAM a vylúčením aktualizácií, čo poukazuje na dopyt po opraviteľných a aktualizovateľných zariadeniach na súčasnom trhu."
    ],
    "points": 194,
    "commentCount": 163,
    "retryCount": 0,
    "time": 1696514670
  }
]
