[
  {
    "title": "한화생명 드림플러스, UX/UI 분야 우수 인재 육성 'DX 멤버십' 참가자 모집 한화생명 드림플러스가 UX/UI 분야에서 우수한 인재를 육성하기 위한 연례 멤버십 프로그램 'DX 멤버십'에 참가자를 모집하고 있다. 이 프로그램은 국내외 대학생과 대학원생 중 UX/UI 전공자를 대상으로 한다. 참가자들은 12개월 동안 집중적인 아카데미 과정과 앰배서더 활동에 참여하며, 즉각적으로 실무에 활용 가능한 고급 전문가가 되는 것을 목표로 한다. 이 프로그램은 인간-컴퓨터 상호작용(Human-Computer Interaction, HCI)에 초점을 맞춘 커리큘럼을 제공하며, 프로젝트 실행 및 전시회 참여의 기회를 제공하며 산업 전문가들로부터 지식과 지도를 받을 수 있다. 또한, 참가자들은 한화생명 드림플러스의 공간과 네트워크를 통해 다양한 혜택을 누릴 수 있다. 이 프로그램의 신청 기간은 2023년 11월 15일부터 29일까지이며, 프로그램은 2023년 12월에 시작될 예정이다.",
    "originLink": "http://m.ceoscoredaily.com/page/view/2023111616200706963",
    "originBody": "",
    "originSummary": [
      "Hanwha Life Dreamplus is seeking participants for its \"DX Membership\" program, targeting undergraduate and graduate students in the UX/UI field.",
      "The program spans 12 months and involves intensive academy courses, ambassador activities, and a focus on Human-Computer Interaction (HCI).",
      "Participants will have opportunities for project execution, exhibitions, and guidance from industry experts, as well as access to Hanwha Life Dreamplus' space and network. Application period: November 15-29, 2023. Program start: December 2023."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700141135089
  },
  {
    "title": "리버네트워크, 큐냅 제품 최대 40% 할인 블랙프라이데이 이벤트 진행",
    "originLink": "https://www.datanet.co.kr/news/articleView.html?idxno=188786",
    "originBody": "",
    "originSummary": [
      "Liver Network, the distributor of QNAP products in Korea, is offering a maximum discount of 40% during the Black Friday event.",
      "The event will run from November 16th to November 30th and includes discounts on QNAP NAS, DAS products, network peripherals, and Seagate HDD.",
      "The event aims to cater to the increasing demand for personal NAS and offers tower-type products suitable for homes and small businesses. QNAP Korea representatives are committed to providing various benefits and quality products to their domestic customers."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700141135089
  },
  {
    "title": "한화생명 드림플러스, UX·UI 특화 'DX-멤버십' 모집",
    "originLink": "https://www.seoulfn.com/news/articleView.html?idxno=501349",
    "originBody": "",
    "originSummary": [
      "Hanwha Life Dreamplus is offering a \"DX-Membership\" program for undergraduates and graduate students interested in the field of user experience and user interfaces (UX/UI).",
      "The program is a 12-month intensive training program that aims to develop participants into advanced professionals who can make immediate contributions to practical work.",
      "The curriculum will focus on Human-Computer Interaction (HCI), with participants engaging in team projects and exhibitions, as well as receiving insights and guidance from industry experts through special lectures and mentoring. Successful applicants will also enjoy access to Dreamplus community lounges and shared workspaces. Applications can be submitted online, with the final selection taking place in December."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700141135089
  },
  {
    "title": "한화생명 드림플러스, DX 멤버십 모집 ()",
    "originLink": "http://www.whitepaper.co.kr/news/articleView.html?idxno=229916",
    "originBody": "",
    "originSummary": [
      "한화생명 드림플러스가 DX-멤버십 프로그램을 모집 중이며, 사용자 경험 및 사용자 인터랙티브 분야에 탁월한 인재를 육성한다.",
      "이 프로그램은 국내외 UX·UI 전공 학부생 및 대학원생을 대상으로하며 1년 동안 인텐시브 과정과 앰버서더 활동을 통해 참가자들이 고급 인재로 성장하도록 지원한다.",
      "프로그램은 HCI 분야에 중점을 두며 프로젝트 수행, 전시 개최, 전문가 강연 및 멘토링 등이 포함되어 있다. 참가자들은 드림플러스 공간 및 네트워크 혜택을 받을 수 있으며, 수료 후에는 다양한 네트워킹 이벤트와 프로그램에 선참여 할 수 있다. 모집은 이달 29일까지 진행되며 최종 선발은 12월 중에 이루어진다."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700141135089
  },
  {
    "title": "한화생명 드림플러스, DX-멤버십 프로그램으로 UX/UI 분야 신규 인재 모집",
    "originLink": "https://www.thebigdata.co.kr/view.php?ud=20231116092209220162abca1943_23",
    "originBody": "",
    "originSummary": [
      "한화 생명의 Dreamplus는 \"DX 멤버십\" 프로그램을 위해 UX/UI 분야의 젊은 인재를 모집하고 있습니다.",
      "이 프로그램은 12개월 동안 집중적인 훈련과 앰배서더 활동을 통해 참가자들을 숙련된 전문가로 양성하기 위해 설계되었습니다.",
      "이 프로그램에서는 HCI에 초점을 맞추는 커리큘럼을 제공하며, 팀 프로젝트에 참여하고 네트워킹 기회를 제공합니다. 지원은 이번 달 29일까지 받고 있습니다."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700141135089
  },
  {
    "title": "\"What's Up Salida\" 커피와 네트워킹 행사는 제공하는 Salida 상공회의소에 의해 후원됩니다. 이 행사는 11월 16일 목요일 오전 8시 30분부터 9시 30분까지 Salida 커뮤니티 센터에서 열릴 예정입니다. 지역 주민, 지역 사업가 및 선출된 공무원들은 지역 사건에 대해 논의하기 위해 초대됩니다. 행사 및 커피는 무료이지만 참석자들은 재사용 가능한 머그컵을 가져오도록 요청됩니다.",
    "originLink": "https://heartoftherockiesradio.com/whats-up-salida-coffee-and-networking-event-is-thursday/",
    "originBody": "",
    "originSummary": [
      "\"What's Up Salida\"는 살리다 상공회의소가 주최한 커피와 네트워킹 행사입니다.",
      "행사는 11월 16일 목요일 오후 8시 30분부터 9시 30분까지 살리다 커뮤니티 센터에서 열릴 예정입니다.",
      "주민, 지역 사업가 및 선출 관리들이 지역 동향에 대해 토론하기 위해 초대됩니다. 행사와 커피는 무료이며 참석자들은 재사용 가능한 머그컵을 가져오라는 요청이 있습니다."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700141135089
  },
  {
    "title": "Connect Live!: The Ultimate Business Event for Meaningful Networking",
    "originLink": "https://www.journalism.co.uk/press-releases/get-your-networking-game-on-connect-live-is-the-ultimate-business-event/s66/a1087327/",
    "originBody": "",
    "originSummary": [
      "Stefan Thomas, a networking coach and public speaker, is organizing Connect Live! - a business conference in Chipping Norton, Oxfordshire.",
      "The conference, scheduled for May 2024, will focus on facilitating meaningful networking opportunities for a limited number of 120 attendees.",
      "Stefan aims to create an environment where attendees can connect with businesses that align with their own interests and goals."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700141135089
  }
]
