[
  {
    "id": 37955264,
    "title": "Jabber hizmetini hedefleyen Hetzner ve Linode üzerinde şifreli trafik durdurma",
    "originLink": "https://notes.valdikss.org.ru/jabber.ru-mitm/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37955264",
    "commentBody": "",
    "originSummary": [
      "Bir XMPP mesajlaşma hizmeti olan Jabber.ru, saldırganın Almanya'daki Hetzner ve Linode barındırma sağlayıcılarında 6 aya kadar şifrelenmiş trafiği ele geçirdiği bir ortadaki adam saldırısının kurbanı oldu.",
      "Saldırının uzun sürmesine rağmen, sunucu ihlalleri ya da sahtekarlık saldırılarına dair herhangi bir kanıt bulunamamıştır. Ancak, bağlantıları ele geçirmek için Let's Encrypt kullanılarak sahte TLS sertifikalarından yararlanıldı.",
      "Saldırı öncelikle XMPP hizmetinin STARTTLS portu 5222'ye olan bağlantıları etkilemiştir. Dinlemenin ya yasal olarak yapıldığından ya da barındırma sağlayıcılarının ağlarına izinsiz girişin bir sonucu olduğundan şüpheleniliyordu."
    ],
    "commentSummary": [
      "Hacker News başlığı, Jabber mesajlaşma hizmetini hedef alan barındırma hizmetlerinde şifrelenmiş trafik müdahalesini tartışıyor ve ek kimlik doğrulama, SSL/TLS sertifikalarının izlenmesi, RIPE Atlas ölçümleri ve DLT tabanlı sistemler gibi çeşitli hafifletme stratejilerine değiniyor.",
      "Tartışmada sertifika kimlik doğrulaması için DANE kullanımı ve Sertifika Yetkililerinin (CA'lar) sınırlamaları ele alınmaktadır. Diğer konular arasında potansiyel SSL altyapısı güvenlik açıkları, SSL sertifikası verilmesinin olası tehlikeleri ve DNSSEC, CAA kayıtları ve PGP ve OMEMO/OpenPGP gibi şifreleme yöntemlerinin önemi yer almaktadır.",
      "Konu başlığı, aynı alan adı için birden fazla sertifikaya duyulan ihtiyacı, SSL sertifikalarının güvenilirliğini, potansiyel yasal müdahaleyi ve barındırma hizmetlerinde güvenliği sağlamanın zorluklarını tartışıyor."
    ],
    "points": 589,
    "commentCount": 237,
    "retryCount": 0,
    "time": 1697805653
  },
  {
    "id": 37957152,
    "title": "Healthcare.gov'un kurtarılmasının onuncu yıl dönümü",
    "originLink": "https://www.pauladamsmith.com/blog/2023/10/the-10-year-anniversary-of-the-healthcare.gov-rescue.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37957152",
    "commentBody": "",
    "originSummary": [
      "On yıl önce, çalışmayan HealthCare.gov web sitesindeki sorunları çözmek için Todd Park liderliğinde \"tech surge\" adı verilen deneyimli bir ekip oluşturuldu.",
      "Hükümet içinden ve dışından kişilerden oluşan ekip, kod, test, sürümler ve izleme dahil ancak bunlarla sınırlı olmamak üzere sitenin zorluklarını analiz etti.",
      "Yoğun tartışmalar ve toplantıların ardından, kritik performans sorunlarını ortaya çıkaran bir izleme sistemini başarıyla kurdular ve siteyi iyileştirmek ve milyonlarca kişinin sağlık sigortasına kaydolmasını sağlamak için sürekli çabalarının başlangıcını işaret ettiler."
    ],
    "commentSummary": [
      "Tartışmalar, Healthcare.gov'un geliştirilmesi sırasında yaşanan sıkıntılar, Uygun Bakım Yasası (ACA) üzerindeki siyasi etkiler ve Medicaid'in yeterliliği de dahil olmak üzere ABD'deki sağlık reformu etrafında şekilleniyor.",
      "Yolsuzluk, kayırmacılık, federal fonların dağıtımı, federal çalışanlara eksik ödeme yapılması ve şirketlerin sağlık hizmetleriyle ilgili BT projelerine katılımı gibi konulara dikkat çekilmektedir.",
      "Genel olarak söylem, sağlık reformunun karmaşık zorluklarının altını çizmekte, gelişmiş sistemlere ve siyasi müdahaleye duyulan ihtiyacı vurgulamaktadır."
    ],
    "points": 368,
    "commentCount": 290,
    "retryCount": 0,
    "time": 1697814381
  },
  {
    "id": 37956714,
    "title": "Polisler, Yanlış Tutuklama Videosunun Viral Olmasının Ardından Bir Genci Özel Hayatın Gizliliğini İhlalden Dava Ediyor",
    "originLink": "https://www.vice.com/en/article/jg5a88/cops-sue-teen-invasion-of-privacy-false-arrest",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37956714",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Metin, polis davranışları, mahremiyet, hakaret ve yasal prosedürler gibi çeşitli hukuk konularına ilişkin tartışmaları kapsamaktadır.",
      "İncelenen temel konular arasında koruma kararlarının etkinliği, kolluk kuvvetlerinin rolü, sosyal medyanın hesap verebilirlik üzerindeki etkisi, küçük topluluklardaki polis memurlarının davranışları, hakaret iddiaları ve sınır ajanlarının yetkisi yer almaktadır.",
      "Bu geniş konu yelpazesi, çağdaş toplumla ilgili kolluk kuvvetleri ve yasal konuların derinlemesine incelenmesini önermektedir."
    ],
    "points": 367,
    "commentCount": 243,
    "retryCount": 0,
    "time": 1697812645
  },
  {
    "id": 37955600,
    "title": "Vikipedi'de en az görüntülenen makale arayışı (2022)",
    "originLink": "http://colinmorris.github.io/blog/unpopular-wiki-articles",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37955600",
    "commentBody": "",
    "originSummary": [
      "Blog yazısı, Wikipedia'da en az görüntülenen makalelerin araştırmasını inceliyor ve bunların çoğu böcekler ve belirsiz coğrafi konumlar hakkında.",
      "En çok görüntülenen ilk 500 sayfada işletmeler veya gruplar hakkında makale bulunmamasına neden olan kayda değerlik kavramına ilişkin topluluk politikaları ve uygulamalarını inceliyor.",
      "Bu az görüntülenen makaleler, gelecekteki editörlerin geliştirmesi ve üzerine inşa etmesi için bir temel oluşturması açısından önemlidir."
    ],
    "commentSummary": [
      "Tartışma, bir konunun kayda değerliğini belirleme, platform sınırlamalarıyla başa çıkma ve silme işlemlerini yönetme gibi Wikipedia editörlerinin karşılaştığı zorlukları vurgulamaktadır.",
      "Platformda toplumsal cinsiyet önyargısı ve kadın düşmanlığının varlığına, kayda değerlik kriterlerindeki önyargıya ve katkı sağlamadaki diğer zorluklara ışık tutuyor.",
      "Wikipedia'nın arama sonuçları üzerindeki etkisinin yanı sıra platformdaki bilgilerin doğruluğu ve güvenilirliği ile ilgili endişeleri de gündeme getiriyor."
    ],
    "points": 350,
    "commentCount": 196,
    "retryCount": 0,
    "time": 1697808035
  },
  {
    "id": 37955402,
    "title": "Nakatomi Uzay",
    "originLink": "https://www.bldgblog.com/2010/01/nakatomi-space/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37955402",
    "commentBody": "",
    "originSummary": [
      "Makale, Zor Ölüm filmindeki karakterlerin mimaride gezinmek için kullandıkları benzersiz mekânsal yöntemleri inceliyor ve İsrail Savunma Kuvvetleri'nin Nablus işgali sırasında kullandığı stratejilerle paralellikler kuruyor.",
      "Zor Ölüm gibi filmlerdeki değiştirilmiş mimari navigasyonun bir tasviri olan \"Nakatomi alanı\" kavramını tanıtıyor ve daha geniş bir kentsel uygulamayı ele alıyor.",
      "Ayrıca, duvarların içinden geçmek, mekânın akışkanlığı ve özel alanın ihlali gibi çeşitli mimari kavramları inceliyor ve bunların film ve edebiyattaki güç dinamikleri ve etkileri üzerine düşünüyor."
    ],
    "commentSummary": [
      "bldgblog.com'daki sohbet, şehir planlamasının suç oranları üzerindeki etkisi ve modern video oyunlarındaki açık uçlu oyunlarda algılanan eksiklik gibi bir dizi konuyu kapsıyor.",
      "Tartışma aynı zamanda James Bond serisinin belirgin düşüşünü de kapsamakta ve filmlerde romantizmin tasvirini analiz etmektedir.",
      "Tartışmaya katılanlar farklı bakış açılarıyla katkıda bulunuyor, alternatif oyunlar ve filmler öneriyor ve tartışılan konuların çok yönlü yönlerini inceliyor."
    ],
    "points": 326,
    "commentCount": 118,
    "retryCount": 0,
    "time": 1697806608
  },
  {
    "id": 37958473,
    "title": "Dış müdahalenin çifte ajanı olarak AB Komiseri",
    "originLink": "https://www.patrick-breyer.de/en/breyer-on-chat-control-investigative-research-eu-commissioner-as-double-agent-of-foreign-interference/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37958473",
    "commentBody": "",
    "originSummary": [
      "Yakın zamanda yapılan bir araştırma, teknoloji endüstrisi ve güvenlik hizmetlerine bağlı kuruluşların, AB'nin çocukların cinsel istismarıyla mücadele etmeyi amaçlayan \"Sohbet Kontrolü\" düzenlemesini destekleyen bir kampanyayı finanse ettiğini ortaya koyuyor.",
      "Bu düzenleme, şüpheli özel mesaj ve fotoğrafların servis sağlayıcılar tarafından zorunlu olarak taranmasını ve ifşa edilmesini öngörüyor. AB Parlamentosu milletvekili Patrick Breyer, AB İçişleri Komiseri Ylva Johansson'un konuya müdahil olmasını eleştiriyor.",
      "Kampanyayı savunanlar, dijital mahremiyet ve şifreleme için bir tehdit olarak gördükleri özel mesajların ve fotoğrafların ayrım gözetmeksizin taranması için bir baskı olarak görüyorlar. Şu anda ABD'de böyle bir yasa mevcut değil."
    ],
    "commentSummary": [
      "Pasajda, yolsuzluk ve dış müdahale suçlamaları, egemenlik tartışmaları ve AB düzenlemeleri eleştirileri gibi AB ile ilgili çeşitli konular vurgulanmaktadır.",
      "Bu durum, AB'nin bütünlüğüne ve gizlilik haklarını koruma kapasitesine ilişkin endişelerin altını çizmekte ve AB'nin düzenlemelerine ve yönetişimine yönelik bir şüphecilik düzeyine işaret etmektedir.",
      "Metinde ayrıca, kapitalizm ve komünizm bağlamında devlet müdahalesi ve düzenlemelerinin artıları ve eksileri üzerine tartışmalara da değinilmektedir."
    ],
    "points": 312,
    "commentCount": 158,
    "retryCount": 0,
    "time": 1697820407
  },
  {
    "id": 37959540,
    "title": "Sevdiğiniz her şeyi mahvedebilirler ve mahvedecekler",
    "originLink": "https://www.welcometohellworld.com/they-can-and-will-ruin-everything-you-love/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37959540",
    "commentBody": "",
    "originSummary": [
      "Bağımsız sanatçılara verdiği destekle tanınan müzik sitesi Bandcamp, içerik lisanslama ve hizmet şirketi Songtradr tarafından satın alındı.",
      "Bandcamp'in editör kadrosunu ve vinil ekibini etkileyen işten çıkarmalar duyurulduğundan, bu satın alma sanatçılar ve hayranlar arasında endişeleri tetikledi.",
      "Satış, Bandcamp'in geleceği ve bağımsız sanatçıları desteklemeye devam etme taahhüdü konusunda belirsizliklere yol açtı ve sitenin bağımsız bir müzik platformu olarak itibarının yeni sahiplik altında tehlikeye girebileceği korkusunu ateşledi."
    ],
    "commentSummary": [
      "Tartışmalar Bandcamp çalışanlarının iş kaybı, Bandcamp'in bir müzik platformu olarak önemi ve Epic Games tarafından satın alınmasına ilişkin endişeler etrafında yoğunlaşıyor.",
      "Kâr amacı güden dijital oyun mağazalarının sakıncaları, kâr amacı gütmeyen kuruluşların toplulukları geliştirme ihtiyacı ve işveren-çalışan ilişkisi hakkında derinlemesine tartışmalar yapılıyor.",
      "Diğer konular arasında emek ve sermaye değeri arasındaki denge, web mülkleri için sürdürülebilirlik sorunları, Internet Archive gibi kuruluşlar tarafından kültürel içeriğin korunması, kişisel gizlilik hakları ve MySpace ve Twitter gibi sosyal medya platformlarının düşüşü yer alıyor."
    ],
    "points": 299,
    "commentCount": 245,
    "retryCount": 0,
    "time": 1697825450
  },
  {
    "id": 37959904,
    "title": "Bilgisayar korsanları Okta'nın destek biriminden erişim jetonlarını çaldı",
    "originLink": "https://krebsonsecurity.com/2023/10/hackers-stole-access-tokens-from-oktas-support-unit/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37959904",
    "commentBody": "",
    "originSummary": [
      "Ticari kimlik araçları sağlayıcısı Okta, müşteri destek biriminde bir güvenlik ihlali yaşadı ve bilgisayar korsanlarına yaklaşık iki hafta boyunca erişim izni verdi.",
      "İhlal, saldırganların belirli müşteriler tarafından yüklenen dosyaları görüntülemesine izin vererek çerezler ve oturum belirteçleri gibi hassas verileri açığa çıkarma potansiyeline sahipti.",
      "Az sayıda müşteriyi etkileyen bu olaya rağmen Okta, tüm müşterilerine paylaşmadan önce dosyaların içindeki kimlik bilgilerini ve jetonları temizlemelerini tavsiye ediyor ve tanıdık bir tehdit aktörünün bunları hedef almış olabileceğini düşünüyor."
    ],
    "commentSummary": [
      "Merkezi bir kimlik sağlayıcısı olan Okta, bir çalışanın hassas verileri Okta'nın destek aracına yüklemesinin ardından bilgisayar korsanlarının destek biriminden erişim belirteçlerini çaldığı bir güvenlik ihlali yaşadı.",
      "Bu olay, Okta'nın önemli BT sistemlerini yönetmedeki bütünlüğü ve güvenilirliği, güvenlik protokollerinin etkinliği ve kimlik doğrulama için şirket içi sistemler ile bulut hizmetleri arasındaki sürekli tartışma zıtlığı hakkında tartışmalara yol açtı.",
      "Sağlam güvenlik önlemlerinin uygulanması, proaktif siber güvenlik teyakkuzunun sürdürülmesi ve alternatif kimlik doğrulama sağlayıcılarının dikkate alınması gerekliliği vurgulanmaktadır."
    ],
    "points": 280,
    "commentCount": 138,
    "retryCount": 0,
    "time": 1697827588
  },
  {
    "id": 37960941,
    "title": "No-GIL CPython'da İlerleme",
    "originLink": "https://lwn.net/Articles/947138/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37960941",
    "commentBody": "",
    "originSummary": [
      "Python yönlendirme konseyi, birden fazla yerel iş parçacığının Python bayt kodlarını aynı anda yürütmesini engelleyen bir mekanizma olan küresel yorumlayıcı kilidini (GIL) Python'un gelecekteki sürümlerinde isteğe bağlı hale getirmeyi düşünüyor.",
      "Uzantılarla uyumluluk, API değişiklikleri önerme ve GIL olmayan sürüm için \"free-threading\" ve \"nogil\" gibi potansiyel isimlerle ilgili tartışmalar devam etmektedir. Ayrıca 'abi4' olarak adlandırılan yeni bir Uygulama İkili Arayüzü (ABI) sunmayı da düşünüyorlar.",
      "Bu değişikliklerle ilgili Python Geliştirme Teklifinin (PEP) nihai onayı beklenmektedir. Yönlendirme konseyi, geçiş ve algı üzerindeki potansiyel etkiyi tartışırken kabul kriterlerini tanımlama sürecindedir."
    ],
    "commentSummary": [
      "Tartışma, Python'da paralel programlamanın çeşitli yönleri hakkındadır. Buna üniversite müfredatında daha açık paralelliğe duyulan ihtiyaç ve Python bayt kodlarının birden fazla iş parçacığı tarafından aynı anda yürütülmesini engelleyen bir mekanizma olan Global Interpreter Lock'un (GIL) potansiyel olarak kaldırılması da dahildir.",
      "Katılımcıların farklı görüşleri var; bazıları yan etkileri olmayan işlevsel kodu teşvik ederken, diğerleri sanal makineler (VM'ler) ve görevlerin kütüphanelere yüklenmesi gibi alternatif yaklaşımlar öneriyor.",
      "Python'un tek iş parçacıklı performansı ve Python 2'den 3'e geçişle ilgili endişeler var, ancak GIL'i kaldırmanın ve paralelliği artırmanın potansiyel yansımaları ve faydaları da kabul ediliyor."
    ],
    "points": 278,
    "commentCount": 158,
    "retryCount": 0,
    "time": 1697832652
  },
  {
    "id": 37961166,
    "title": "Hetzner/Linode XMPP.ru MitM müdahale olayını hafifletme",
    "originLink": "https://www.devever.net/~hl/xmpp-incident",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37961166",
    "commentBody": "",
    "originSummary": [
      "jabber.ru ve xmpp.ru'nun sahibi, trafiğin otomatik olarak kesilmesini ve yetkisiz bir sertifika verilmesini içeren, muhtemelen Almanya kaynaklı bir ortadaki adam saldırısı bildirdi.",
      "Rapor, Taşıma Katmanı Güvenliği (TLS) altyapısındaki kusurları vurgulamakta ve Otomatik Sertifika Yönetim Ortamı (ACME)-Sertifika Yetkilisi Yetkilendirmesi (CAA) ve Alan Adı Sistemi Güvenlik Uzantıları (DNSSEC) kullanımı gibi gelişmiş güvenlik önlemleri önermektedir.",
      "Makale, üçüncü taraf çözümlere güvenilmemesini tavsiye ediyor, uçtan uca şifrelemeyi savunuyor ve \"gizli bilgi işlem\" teknolojilerinin sağlam güvenlik sağlamadaki etkinliğini sorguluyor."
    ],
    "commentSummary": [
      "Hetzner/Linode ağındaki XMPP trafiğinin durdurulmasını içeren ve özellikle XMPP STARTTLS bağlantı noktasını hedef alan yeni bir güvenlik ihlali tespit edildi.",
      "Saldırı hafifletildi, ancak güvenlik açıklarını ortaya çıkardı ve veri merkezleri ve potansiyel tedarik zinciri tehlikeleriyle ilişkili güvenlik risklerini vurguladı.",
      "Tartışmalarda kullanıcıların Cloudflare kullanımına ilişkin endişeleri ile avantaj ve dezavantajları ele alındı. XMPP, bir iletişim protokolü olan Genişletilebilir Mesajlaşma ve Varlık Protokolü anlamına gelir ve STARTTLS, şifrelenmemiş bir bağlantıyı alıp şifrelenmiş (TLS veya SSL) bir bağlantıya yükseltmenin bir yoludur."
    ],
    "points": 248,
    "commentCount": 94,
    "retryCount": 0,
    "time": 1697833889
  },
  {
    "id": 37957397,
    "title": "\"[31M\"? 2023'te ANSI Terminal güvenliği ve 10 CVE'nin bulunması",
    "originLink": "https://dgl.cx/2023/09/ansi-terminal-security",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37957397",
    "commentBody": "",
    "originSummary": [
      "Bu makalede, terminal emülatörlerinde bulunan güvenlik açıkları ve potansiyel istismar zincirleri, kaçış dizilerine vurgu yapılarak tartışılmaktadır.",
      "Popüler terminal emülatörlerindeki riskleri tanımlar ve bu güvenlik açıklarına karşı uygun kullanım ve azaltma önlemlerinin uygulanmasının önemini vurgular.",
      "Çalışma aynı zamanda terminaller için bir test aracının geliştirilmesine işaret etmekte ve bu alandaki önceki araştırmacıların katkılarını kabul etmektedir."
    ],
    "commentSummary": [
      "Makale, güvenlik risklerini azaltmak için metin tabanlı araçlardaki kontrol karakterlerini sterilize etmenin önemini vurgulamakta ve bazı terminal sistemlerindeki sorunlara dikkat çekmektedir.",
      "Özellikle standardizasyon eksikliği nedeniyle terminal emülasyonu ile ilgili zorluklara ve zorluklara dikkat çekmekte ve yeni bir metin terminali protokolüne ihtiyaç duyulduğunu öne sürmektedir.",
      "İçerik ayrıca terminal emülatörleri ve kontrol dizileri ile ilgili konuları da kapsamakta, kaçış tuşunun tarihsel bağlamına, Lisp programlarında PostScript kullanımına ve ilgili projelere değinmektedir."
    ],
    "points": 247,
    "commentCount": 126,
    "retryCount": 0,
    "time": 1697815372
  },
  {
    "id": 37962152,
    "title": "F-Droid: Android FOSS uygulama mağazası",
    "originLink": "https://f-droid.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37962152",
    "commentBody": "",
    "originSummary": [
      "F-Droid, Android için ücretsiz ve açık kaynaklı yazılım (FOSS) uygulamalarından oluşan bir depodur ve cihazlarda kolay gezinme, yükleme ve güncelleme için bir istemci sunar.",
      "En son güncelleme yeni uygulamalar ve geliştirilmiş özellikler sunarak F-Droid'in kullanılabilirliğini ve işlevselliğini artırdı.",
      "F-Droid, hizmetlerini sürdürmek ve Android topluluğuna sunduklarını sunmaya devam etmek için kamu bağışlarına bağlı olan kar amacı gütmeyen bir kuruluştur."
    ],
    "commentSummary": [
      "Makale, ücretsiz ve açık kaynaklı Android uygulamaları için bir mağaza olan F-Droid'i inceliyor. Aurora Droid ve Neo Store gibi alternatif istemciler, gelişmiş işlevsellik ve uygulama yükleme için kullanıcılar tarafından önerilmektedir.",
      "Makalede F-Droid'in kullanım istatistiklerinin eksikliği, uygulamadaki olası engeller ve yeni yazılımların yavaş eklenmesi tartışılıyor. Kullanıcılar daha iyi erişim için ekstra depoların eklenmesini öneriyor ve F-Droid'in bir sürümü olan F-Droid Basic'ten bahsediyor.",
      "F-Droid'in hem olumlu hem de olumsuz yönleri kullanıcılar tarafından vurgulanmakta, bazıları platformu severken, diğerleri yıllardır güncellenmeyen birkaç uygulama içerdiği için eleştirmektedir."
    ],
    "points": 243,
    "commentCount": 70,
    "retryCount": 0,
    "time": 1697840530
  },
  {
    "id": 37954600,
    "title": "Altıgen Izgaralar (2013)",
    "originLink": "https://www.redblobgames.com/grids/hexagons/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37954600",
    "commentBody": "",
    "originSummary": [
      "Kılavuz, altıgen ızgaraların nasıl oluşturulacağını ve bunlarla nasıl çalışılacağını, çeşitli koordinat sistemlerini, algoritmaları ve formülleri programlama kodu örnekleriyle birlikte ayrıntılarıyla anlatıyor.",
      "Altıgen ızgaralar için mesafelerin hesaplanması, çizgilerin çizilmesi ve hareket aralıklarının belirlenmesinin yanı sıra engel işleme, harita depolama, sarmal haritalar ve yol bulma algoritmaları ele alınmaktadır.",
      "Yazar, Unity'deki GameLogic Grids kütüphanesi, Hex-Grid Utilities kütüphanesi, örnek kod, bir PDF makalesi ve web sitesi kullanımı için prosedürel üretim kodu gibi ilgili kaynakları önermektedir."
    ],
    "commentSummary": [
      "Makale, altıgen ızgaralarla başa çıkmak için kaynaklar ve kılavuzlar sunan bir web sayfası olan Red Blob Games'e ışık tutuyor.",
      "Sivri ve düz üst altıgenler arasındaki farkları açıklar ve kodlamada kullanımlarını anlamaya yardımcı olur.",
      "Tartışma, koordinat sistemlerini ve oyun tasarımında altıgen ızgaraların kullanılmasının artılarını ve eksilerini kapsamaktadır."
    ],
    "points": 234,
    "commentCount": 53,
    "retryCount": 0,
    "time": 1697800080
  },
  {
    "id": 37955952,
    "title": "Rapora göre kâr amacı gütmeyen hastaneler hayır işlerinde cimrilik yaparken CEO'lar milyonlar kazanıyor",
    "originLink": "https://arstechnica.com/health/2023/10/nonprofit-hospitals-skimp-on-charity-while-ceos-reap-millions-report-finds/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37955952",
    "commentBody": "",
    "originSummary": [
      "ABD'de kar amacı gütmeyen hastaneler, düşük gelirli hastalara yardım sağlamak yerine yönetici tazminatlarını tercih ettikleri için incelemeye alınıyor.",
      "Senato Sağlık, Eğitim, Çalışma ve Emeklilik Komitesi'nin bir raporuna göre, kar amacı gütmeyen birçok hastane, gelirlerinin %2'sinden daha azını hayır işlerine harcarken, hastane CEO'ları milyonlarca dolar maaş almaktadır.",
      "Rapor, hastaneleri fiyat kırmakla ve kar amacı gütmeme yükümlülüklerini ihlal etmekle suçluyor. Amerikan Hastaneler Birliği ise raporun hastanelerin topluma sağladığı faydaları göz ardı etmesini protesto ediyor."
    ],
    "commentSummary": [
      "Rapor, kâr amacı gütmeyen hastanelerin, yüksek CEO maaşlarına rağmen nispeten düşük hayırseverlik hizmetleri nedeniyle mercek altına alındığını ve kamu tarafından finanse edilen kuruluşlara yönelik adalet sorularını gündeme getirdiğini ortaya koyuyor.",
      "Bu tartışma, hastanenin Medicaid ve Medicare hastalarına hizmet verme konusundaki zorluklarına, devlet ödemelerinin sağlık hizmetleri maliyetleri üzerindeki etkisine ve yönetici ücretlerine ilişkin görüşlere değinerek bu konunun ele alınması gerektiğini ortaya koymaktadır.",
      "Raporda ayrıca kar amacı gütmeyen kuruluşların doğası ve mali faaliyetlerine ilişkin şeffaflık, gizli anlaşma iddiaları, kampanya finansmanı yasalarında değişiklik yapılması ihtiyacı ve hastane fonlarının hayır işlerine tahsis edilmesinin önemi de ele alınmaktadır."
    ],
    "points": 233,
    "commentCount": 137,
    "retryCount": 0,
    "time": 1697809749
  },
  {
    "id": 37956856,
    "title": "TypeScript türlerinde uygulanan Flappy Bird",
    "originLink": "https://zackoverflow.dev/writing/flappy-bird-in-type-level-typescript/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37956856",
    "commentBody": "",
    "originSummary": [
      "Yazar, yalnızca TypeScript tür ek açıklamalarını kullanarak bir 2D Flappy Bird oyunu geliştirdi ve bu ek açıklamalardan TypeScript derleyicisinin dışında yararlanma potansiyelini gösterdi.",
      "Oyun durumu, fonksiyonel programlama ve çizim komutlarıyla dolu bir komut tamponu aracılığıyla işleme ilkelerine dayalı olarak güncelleniyor ve projenin teknik yeterliliğini sergiliyor.",
      "Rust ve Zig'de oluşturulan çalışma zamanı, oyun yürütme için bytecode ve web canvas API'sini kullanır ve gelecekteki planları bu tip seviyesindeki TypeScript çalışma zamanını yüksek performanslı bir tip denetleyicisi olarak kullanmak ve şemalar oluşturmak için yetkin bir Alana Özgü Dil (DSL) geliştirmektir."
    ],
    "commentSummary": [
      "Makale, TypeScript'in tip sisteminin Flappy Bird oyununun uygulanmasındaki faydasını araştırıyor ve karşılaştırma için sudoku çözmede Ocaml kullanımına atıfta bulunuyor.",
      "TypeScript'in tip sisteminin gücü ve karmaşıklığı, karmaşık arayüzler oluşturma kapasitesi ve gelişmiş bir tip sisteminin faydaları tartışılmaktadır.",
      "Yazı, TypeScript'in tip sisteminin esnekliğine ve kısıtlamalarına dikkat çekiyor ve yeterli zaman ve kaynak verildiğinde herhangi bir hesaplama problemini çözebilen bir sistemi tanımlayan bir terim olan Turing tamlığının sonuçlarına değiniyor."
    ],
    "points": 219,
    "commentCount": 49,
    "retryCount": 0,
    "time": 1697813272
  }
]
