[
  {
    "id": 40982118,
    "title": "Google Docs में मार्कडाउन आयात और निर्यात करें",
    "originLink": "https://workspaceupdates.googleblog.com/2024/07/import-and-export-markdown-in-google-docs.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40982118",
    "commentBody": "",
    "originSummary": [
      "Google Docs अब उन्नत मार्कडाउन सुविधाओं का समर्थन करता है, जिसमें मार्कडाउन को पेस्ट करने पर Docs सामग्री में बदलना, Docs सामग्री को मार्कडाउन के रूप में कॉपी करना, एक Doc को मार्कडाउन के रूप में निर्यात करना, और मार्कडाउन को एक Doc के रूप में आयात करना शामिल है।",
      "यह अपडेट तकनीकी सामग्री लेखकों के लिए लाभकारी है, जिससे सहयोग और दस्तावेज़ीकरण के लिए डॉक्स और मार्कडाउन के बीच आसान रूपांतरण संभव हो सकेगा।",
      "रोलआउट 16 जुलाई, 2024 से रैपिड रिलीज़ और शेड्यूल्ड रिलीज़ डोमेन के लिए शुरू होता है, और यह सभी Google Workspace ग्राहकों, Workspace व्यक्तिगत ग्राहकों और व्यक्तिगत Google खाता उपयोगकर्ताओं के लिए उपलब्ध है।"
    ],
    "commentSummary": [
      "Google Docs अब मार्कडाउन के पूर्ण आयात/निर्यात का समर्थन करता है, जिससे तकनीकी लेखकों और मार्कडाउन दस्तावेज़ों पर सहयोग करने वालों के लिए इसकी उपयोगिता बढ़ जाती है।",
      "यह सुविधा धीरे-धीरे जारी की जा रही है ताकि गंभीर बग्स को जल्दी पकड़ा जा सके, इसलिए उपयोगकर्ता इसे तुरंत नहीं देख सकते हैं।",
      "Google ड्राइव और इसकी एपीआई भी इस नए मार्कडाउन क्षमता का समर्थन करेंगे, हालांकि कुछ उपयोगकर्ताओं को धीमी रोलआउट और कोड ब्लॉक्स और टिप्पणियों जैसे तत्वों के अधूरे समर्थन के बारे में चिंताएं हैं।"
    ],
    "points": 486,
    "commentCount": 96,
    "retryCount": 0,
    "time": 1721184291
  },
  {
    "id": 40986894,
    "title": "नौकरी बाजार में घबराहट",
    "originLink": "https://matt.sh/panic-at-the-job-market",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40986894",
    "commentBody": "",
    "originSummary": [
      "बढ़ती ब्याज दरों, सट्टा वित्तपोषण, और त्रुटिपूर्ण भर्ती प्रक्रियाओं के कारण तकनीकी नौकरी बाजार में उथल-पुथल मची हुई है।",
      "उच्च ब्याज दरें कंपनियों को जोखिम भरे उपक्रमों के बजाय सुरक्षित सरकारी समर्थित खातों में निवेश करने के लिए प्रेरित करती हैं, जिससे तकनीकी क्षेत्र में नौकरियों का नुकसान होता है।",
      "भर्ती प्रक्रिया अक्सर अप्रासंगिक कोडिंग परीक्षणों और व्यवहारिक साक्षात्कारों पर केंद्रित होती है, जिससे उम्मीदवारों के वास्तविक अनुभव और क्षमताओं का मूल्यांकन करने में असफल रहती है।"
    ],
    "commentSummary": [
      "नौकरी बाजार कई उद्योगों में चुनौतीपूर्ण है, जिसमें तकनीक भी शामिल है, जहां जटिल भर्ती प्रक्रियाएं व्यक्तिगत प्रोफाइल और योगदान को नजरअंदाज कर देती हैं।",
      "नेटवर्किंग आवश्यक है क्योंकि जॉब पोर्टल अक्सर रिज्यूमे को छिपा देते हैं, और तकनीकी नौकरी बाजार में अवसर कम हो रहे हैं क्योंकि कंपनियां अप्रासंगिक कौशल और मनमाने आवश्यकताओं पर ध्यान केंद्रित कर रही हैं।",
      "अप्रभावी भर्ती प्रथाएं खराब कार्यस्थल वातावरण का संकेत दे सकती हैं, और नौकरी बाजार की अव्यवहारिकता व्यक्तियों की वित्तीय स्थिरता से अधिक समय तक बनी रह सकती है, जिससे उपयुक्त रोजगार की खोज जटिल हो जाती है।"
    ],
    "points": 429,
    "commentCount": 367,
    "retryCount": 0,
    "time": 1721229911
  },
  {
    "id": 40987730,
    "title": "रैबिटओएस को जेलब्रेक करना: गुप्त लॉग्स का खुलासा और जीपीएल उल्लंघन",
    "originLink": "https://www.da.vidbuchanan.co.uk/blog/r1-jailbreak.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40987730",
    "commentBody": "",
    "originSummary": [
      "डेविड बुकानन ने रैबिट R1 के लिए एक 'टेदरड जेलब्रेक' विकसित किया है, जो बूटलोडर को अनलॉक किए बिना या आंतरिक स्टोरेज को बदले बिना रूट एक्सेस की अनुमति देता है।",
      "रैबिट R1, जो मीडियाटेक MT6765 SoC का उपयोग करता है, को व्यापक उपयोगकर्ता डेटा लॉगिंग और GPL उल्लंघनों के लिए आलोचना का सामना करना पड़ा है, जिसे हाल ही में एक अपडेट में आंशिक रूप से संबोधित किया गया।",
      "बुचैनन के निष्कर्ष बताते हैं कि रैबिटओएस एक अत्यधिक संशोधित एंड्रॉइड 13 एओएसपी है, जो मुख्य रूप से एकल-ऐप कियोस्क मोड को लागू करता है, और उन्होंने डिवाइस की आगे की खोज में सहायता के लिए एक उपकरण जारी किया है।"
    ],
    "commentSummary": [
      "रैबिटओएस को जेलब्रेक करने से गुप्त लॉग और संभावित जीपीएल (जनरल पब्लिक लाइसेंस) उल्लंघन सामने आए हैं, जिससे गोपनीयता और कानूनी चिंताएं बढ़ गई हैं।",
      "लॉग्स में संवेदनशील डेटा शामिल होता है जैसे सटीक जीपीएस स्थान, वाईफाई नेटवर्क के नाम, पास के सेल टावरों के आईडी और उपयोगकर्ता टोकन, जिनमें से कुछ को रैबिट के सर्वरों पर भेजा जाता है।",
      "रैबिट इंक. ने इन लॉगिंग समस्याओं को संबोधित करते हुए एक अपडेट (v0.8.112) जारी किया, लेकिन यह विवाद तकनीकी उत्पादों में डेटा गोपनीयता और पारदर्शिता के बारे में चल रही चिंताओं को उजागर करता है।"
    ],
    "points": 326,
    "commentCount": 82,
    "retryCount": 0,
    "time": 1721234498
  },
  {
    "id": 40983734,
    "title": "सबसे बड़ा शैक्षिक जीवन हैक: समय से पहले गणित सीखना",
    "originLink": "https://www.justinmath.com/the-greatest-educational-life-hack-learning-math-ahead-of-time/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40983734",
    "commentBody": "",
    "originSummary": [
      "समय से पहले गणित सीखने से बेहतर ग्रेड, खराब शिक्षण से सुरक्षा, और इंटर्नशिप, शोध परियोजनाओं, और मजबूत सिफारिश पत्रों तक पहुंच मिल सकती है, जो कॉलेज और करियर के अवसरों के लिए महत्वपूर्ण हैं।",
      "कैलकुलस से परे उन्नत गणित पाठ्यक्रम, जैसे कि रैखिक बीजगणित और अवकल समीकरण, कई मात्रात्मक क्षेत्रों के लिए आवश्यक हैं और छात्रों को विशेषीकृत क्षेत्रों में तेजी से प्रवेश दिला सकते हैं, जिससे करियर की उपलब्धियों में वृद्धि होती है।",
      "अनुसंधान से संकेत मिलता है कि शैक्षिक त्वरितीकरण मानसिक स्वास्थ्य को नुकसान नहीं पहुंचाता है और सामान्य भ्रांतियों और तार्किक चुनौतियों के बावजूद अधिक शैक्षणिक और पेशेवर सफलता की ओर ले जाता है।"
    ],
    "commentSummary": [
      "एक उपयोगकर्ता ने अपने 30 के दशक में गणित-भय को दूर करने की अपनी यात्रा साझा की, यह बताते हुए कि गणित सीखने में कभी देर नहीं होती और यह समस्या-समाधान और प्रोग्रामिंग में अंतर्दृष्टि के लिए लाभकारी है।",
      "जीवन में बाद में गणित सीखने के लिए सुझावों में बुनियादी गणित की किताबों से शुरुआत करना, सामुदायिक कॉलेज संसाधनों का उपयोग करना, और धीरे-धीरे उन्नत विषयों की ओर बढ़ना शामिल है।",
      "चर्चा में प्रारंभिक गणित शिक्षा, माता-पिता की भागीदारी, और कुमोन जैसी बाहरी संसाधनों के महत्व पर भी जोर दिया गया, साथ ही व्यापक शैक्षिक प्रणाली की भूमिका पर भी ध्यान दिया गया जो आत्म-अध्ययन और प्रेरणा को बढ़ावा देती है।"
    ],
    "points": 171,
    "commentCount": 131,
    "retryCount": 0,
    "time": 1721206015
  },
  {
    "id": 40981067,
    "title": "स्कैमर्स का स्वर्ण युग: एआई-संचालित फ़िशिंग",
    "originLink": "https://www.mailgun.com/blog/email/ai-phishing/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40981067",
    "commentBody": "",
    "originSummary": [
      "जनरेटिव एआई स्कैमर्स को अत्यधिक व्यक्तिगत और विश्वसनीय फ़िशिंग ईमेल भेजने में सक्षम बनाता है, जिससे भाषा की बाधाओं को पार किया जा सकता है और बड़े पैमाने पर अभियानों को स्वचालित किया जा सकता है।",
      "एआई उपकरण जैसे WormGPT और FraudGPT फ़िशिंग ईमेल और स्पूफिंग वेबसाइट बनाने में सहायता करते हैं, जिससे प्रभावी हमले तैयार करने में लगने वाला समय काफी कम हो जाता है।",
      "रक्षा रणनीतियों में DMARC (डोमेन-आधारित संदेश प्रमाणीकरण, रिपोर्टिंग और अनुरूपता) को लागू करना, एआई फ़िशिंग प्रयासों को पहचानना, बहु-स्तरीय सुरक्षा का उपयोग करना, और एक मजबूत प्रेषक प्रतिष्ठा बनाए रखना शामिल है।"
    ],
    "commentSummary": [
      "एआई-संचालित फ़िशिंग घोटाले अधिक परिष्कृत होते जा रहे हैं, जो टेक्स्ट के लिए लामा, आवाज के लिए व्हिस्पर/टॉरटॉइस, और छवियों के लिए स्टेबल डिफ्यूजन जैसी तकनीकों का उपयोग कर रहे हैं, हालांकि उनका उपयोग अभी भी सीमित है।",
      "हालांकि फ़िशिंग को बढ़ाने के लिए एआई की संभावनाएं हैं, पारंपरिक तरीकों जैसे भारतीय कॉल सेंटर घोटाले अभी भी अत्यधिक प्रभावी और आर्थिक रूप से लाभदायक हैं, जैसा कि हाल ही में एक मामले में देखा गया जहां एक बुजुर्ग व्यक्ति से $25,000 की ठगी की गई।",
      "बैंक और अन्य संस्थान अपनी धोखाधड़ी पहचान क्षमताओं में सुधार कर रहे हैं, लेकिन एआई-संचालित धोखाधड़ी के बढ़ते मामलों के कारण विशेष रूप से बुजुर्गों जैसी संवेदनशील आबादी के लिए जागरूकता और शिक्षा में वृद्धि की आवश्यकता है।"
    ],
    "points": 167,
    "commentCount": 121,
    "retryCount": 0,
    "time": 1721170466
  },
  {
    "id": 40987402,
    "title": "टाइनीपॉड – स्क्रॉल व्हील के साथ एप्पल वॉच केस",
    "originLink": "https://thetinypod.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40987402",
    "commentBody": "",
    "originSummary": [
      "टाइनीपॉड का परिचय, एक कॉम्पैक्ट डिवाइस जो आपके एप्पल वॉच द्वारा संचालित फोन, संगीत, मैसेजिंग और अन्य आवश्यक सुविधाएँ प्रदान करता है।",
      "मुख्य विशेषताओं में एक स्पर्शनीय स्क्रॉल व्हील, त्वरित चुंबकीय चार्जिंग, बहु-दिवसीय बैटरी जीवन, एप्पल पे, और मीडिया के लिए 32GB स्टोरेज शामिल हैं।",
      "दो मॉडलों में उपलब्ध: स्क्रॉल व्हील के साथ tinyPod $79.99 में और स्क्रॉल व्हील के बिना tinyPod lite $29.99 में, विभिन्न Apple Watch श्रृंखलाओं के साथ संगत, इस गर्मी में शिपिंग।"
    ],
    "commentSummary": [
      "टाइनीपॉड एक एप्पल वॉच केस है जिसमें एक स्क्रॉल व्हील शामिल है, जो आईपॉड के क्लिकव्हील की याद दिलाता है, और यह डिजिटल क्राउन के साथ एक यांत्रिक संबंध बनाता है।",
      "उत्पाद को एक मजेदार, विशिष्ट हार्डवेयर विचार के रूप में देखा जाता है, जो उन लोगों को आकर्षित करता है जो अनोखे और विचित्र तकनीकी गैजेट्स की सराहना करते हैं, भले ही यह अव्यावहारिक हो।",
      "उत्पाद की वेबपेज कार्यक्षमता के बारे में मिश्रित समीक्षाएँ हैं, कुछ उपयोगकर्ताओं को Firefox पर समस्याओं का सामना करना पड़ता है, जबकि अन्य को डिज़ाइन आकर्षक लगता है।"
    ],
    "points": 160,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1721232502
  },
  {
    "id": 40984589,
    "title": "जिया तान \"JiaT75\": bsdtar के साथ अनटारिंग करते समय चेतावनी में त्रुटि पाठ जोड़ा (2021)",
    "originLink": "https://github.com/libarchive/libarchive/pull/1609",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40984589",
    "commentBody": "",
    "originSummary": [
      "लिबआर्काइव ने एक कमिट को मर्ज किया ताकि bsdtar का उपयोग करते समय चेतावनियों में त्रुटि पाठ जोड़ा जा सके, जिससे मुद्दा #1561 का समाधान हो सके, लेकिन safe_fprintf को असुरक्षित fprintf से बदलने के बारे में चिंताएं उठाई गईं।",
      "एक सुधार लागू किया गया ताकि safe_fprintf पर वापस जाया जा सके और सही errno हैंडलिंग का उपयोग किया जा सके, साथ ही आगे के ऑडिट और इस मुद्दे के लिए एक CVE (सामान्य कमजोरियाँ और एक्सपोज़र) के सुझाव दिए गए।",
      "चर्चा ने विस्तृत कोड समीक्षाओं और ओपन-सोर्स परियोजनाओं में सुरक्षा बनाए रखने के महत्व को रेखांकित किया, और मुद्दे को बातचीत को लॉक करके हल किया गया।"
    ],
    "commentSummary": [
      "जिया तान \"JiaT75\" ने 2021 में bsdtar में एक चेतावनी में त्रुटि पाठ जोड़ा, जिससे टिप्पणी की गुणवत्ता और कोड परिवर्तन की जांच के बारे में GitHub पर एक गरमागरम चर्चा शुरू हो गई।",
      "बहस ने बड़े सॉफ्टवेयर परियोजनाओं को बनाए रखने की चुनौतियों और सुरक्षा समीक्षाओं में सुधार के लिए एआई की संभावित भूमिका को उजागर किया।",
      "इस घटना ने दुर्भावनापूर्ण कोड का पता लगाने की कठिनाई को उजागर किया, विशेष रूप से ज्ञात योगदानकर्ताओं से, और जिया तान को xz टूल पर राज्य प्रायोजित हमले से जोड़ा।"
    ],
    "points": 156,
    "commentCount": 86,
    "retryCount": 0,
    "time": 1721214218
  },
  {
    "id": 40986213,
    "title": "प्यूर्टो रिको ने जीवाश्म ईंधन कंपनियों के खिलाफ $1 बिलियन का मुकदमा दायर किया",
    "originLink": "https://www.theverge.com/2024/7/16/24199686/puerto-rico-fossil-fuel-industry-lawsuit-climate-change",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40986213",
    "commentBody": "",
    "originSummary": [
      "प्यूर्टो रिको ने प्रमुख जीवाश्म ईंधन कंपनियों, जिनमें एक्सॉनमोबिल, बीपी, शेवरॉन, शेल और कोनोकोफिलिप्स शामिल हैं, के खिलाफ $1 बिलियन का मुकदमा दायर किया है, जिसमें उन पर जलवायु परिवर्तन के बारे में जनता को गुमराह करने और स्वच्छ ऊर्जा की ओर संक्रमण में देरी करने का आरोप लगाया गया है।",
      "सैन जुआन में दायर मुकदमे में दावा किया गया है कि इन कंपनियों ने जीवाश्म ईंधनों को उनके खतरों के बारे में पर्याप्त चेतावनी दिए बिना बढ़ावा देकर व्यापार कानूनों का उल्लंघन किया है, और हरीकेन मारिया जैसी जलवायु आपदाओं से बचाव के लिए हर्जाने की मांग की है।",
      "यह कानूनी कार्रवाई जीवाश्म ईंधन उद्योग के खिलाफ इसी तरह के मुकदमों की व्यापक प्रवृत्ति का हिस्सा है, जो जलवायु से संबंधित प्रभावों के लिए बढ़ती जवाबदेही प्रयासों को उजागर करती है।"
    ],
    "commentSummary": [
      "प्यूर्टो रिको ने जीवाश्म ईंधन कंपनियों के खिलाफ $1 बिलियन का मुकदमा दायर किया है, उन पर जलवायु परिवर्तन से संबंधित क्षति पहुंचाने का आरोप लगाते हुए और कड़े पर्यावरणीय नियमों की मांग की है।",
      "यह मुकदमा जीवाश्म ईंधनों के आर्थिक लाभ और सतत प्रथाओं तथा कॉर्पोरेट जवाबदेही की आवश्यकता के बीच चल रही बहस को उजागर करता है।",
      "राय विभाजित हैं, कुछ लोग प्रदूषण और गलत जानकारी के लिए कॉर्पोरेट जिम्मेदारी के महत्व पर जोर देते हैं, जबकि अन्य जलवायु परिवर्तन से निपटने में व्यक्तिगत कार्यों और सरकारी नीतियों की भूमिका पर बल देते हैं।"
    ],
    "points": 155,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1721225798
  },
  {
    "id": 40983486,
    "title": "गिटलैब बिक्री की संभावनाएं तलाश रहा है",
    "originLink": "https://www.reuters.com/markets/deals/google-backed-software-developer-gitlab-explores-sale-sources-say-2024-07-17/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40983486",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "गिटलैब बिक्री पर विचार कर रहा है, जिससे उपयोगकर्ताओं के बीच संभावित शटडाउन या सेवा मॉडल में बदलाव को लेकर चिंताएं बढ़ रही हैं, जो रेडहैट और सेंटओएस के साथ हुई पिछली समस्याओं की याद दिलाती हैं।",
      "उपयोगकर्ता Gitlab जैसे ओपन-सोर्स विकल्पों के लाभों पर बहस करते हैं, आसान माइग्रेशन और सामुदायिक समर्थन का हवाला देते हुए, जबकि संभावित खरीदारों जैसे Datadog या IBM पर अटकलें लगाते हैं।",
      "Gitlab की मूल्य निर्धारण और उद्यम केंद्रितता की आलोचनाओं ने कुछ उपयोगकर्ताओं को GitHub जैसे विकल्पों पर स्विच करने पर विचार करने के लिए प्रेरित किया है, जो भविष्य की स्थिरता और लागतों के बारे में मिश्रित भावनाओं को दर्शाता है।"
    ],
    "points": 146,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1721203046
  },
  {
    "id": 40981068,
    "title": "डार्विन मशीनें",
    "originLink": "https://vedgie.net/writing/darwin_machines.md",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40981068",
    "commentBody": "",
    "originSummary": [
      "यह पोस्ट विलियम कैल्विन के 'द सेरेब्रल कोड' में प्रस्तुत सिद्धांत पर चर्चा करती है, जो सुझाव देता है कि मस्तिष्क मिनीकॉलम्स के भीतर विकासवादी प्रक्रियाओं का उपयोग करके संवेदी इनपुट्स को संसाधित करता है और सबसे 'योग्य' पैटर्न खोजता है।",
      "यह सिद्धांत यह मानता है कि मस्तिष्क की संरचना, विशेष रूप से नियोकोर्टेक्स के कॉलम और मिनीकोलम, कुशल समस्या-समाधान और समानांतर प्रसंस्करण की अनुमति देते हैं, जिसे एआई और मशीन लर्निंग (एमएल) में लागू किया जा सकता है।",
      "लेखक इस विकासात्मक प्रक्रिया की नकल करने के लिए न्यूरल नेटवर्क के साथ प्रयोग कर रहे हैं और इस क्षेत्र में अनुसंधान और शैक्षणिक अंतर्दृष्टि पर सलाह चाहते हैं, जो एआई की गहन सोच क्षमताओं में संभावित प्रगति को उजागर करता है।"
    ],
    "commentSummary": [
      "पोस्ट में डार्विन मशीनों की अवधारणा पर चर्चा की गई है, जहां विभिन्न संवेदी डेटा रूपों को मस्तिष्क के मिनीकॉलम्स द्वारा संसाधित किया जाता है, प्रत्येक अद्वितीय फायरिंग पैटर्न उत्पन्न करता है जो प्रतिस्पर्धा करते हैं और प्रमुख पैटर्न को सुदृढ़ करते हैं, जिससे सीखने में सहायता मिलती है।",
      "कैप्सूल-रूटिंग एल्गोरिदम, जिन्हें ज्यॉफ्री हिंटन द्वारा प्रस्तावित किया गया था, इस विचार को अपेक्षा-अधिकतमकरण (ईएम) प्रक्रियाओं का उपयोग करके लागू करने का लक्ष्य रखते हैं, लेकिन एआई अनुसंधान में ट्रांसफॉर्मर्स की सफलता के कारण यह छाया में आ गए हैं।",
      "चर्चा मस्तिष्क के कार्य और तंत्रिका नेटवर्क को समझने के महत्व को उजागर करती है, जिसमें हेब्बियन लर्निंग और तंत्रिका गतिविधि में समयगत गतिशीलता की गहन खोज की आवश्यकता का उल्लेख किया गया है।"
    ],
    "points": 145,
    "commentCount": 71,
    "retryCount": 0,
    "time": 1721170466
  },
  {
    "id": 40980715,
    "title": "मैजिक-क्लि – आपके कमांड लाइन के लिए एक सहायक",
    "originLink": "https://github.com/guywaldman/magic-cli",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40980715",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "मैजिक-क्लि, जो कि गाइ वाल्डमैन द्वारा विकसित एक कमांड लाइन कोपायलट है, ने अपने डिफ़ॉल्ट \"असुरक्षित-निष्पादन\" मोड के कारण चर्चाओं को जन्म दिया है, जिसमें \"क्लिपबोर्ड\" मोड जैसे एक सुरक्षित डिफ़ॉल्ट के लिए सुझाव दिए गए हैं।",
      "उपयोगकर्ताओं ने राय और अनुभव साझा किए हैं, जिसमें zsh_codex, aichat, और Warp टर्मिनल जैसे वैकल्पिक उपकरणों का उल्लेख किया है।",
      "यह परियोजना रस्ट में बनाई गई है, जिससे इसकी जटिलता के बारे में सवाल उठते हैं, खासकर अन्य भाषाओं में सरल कार्यान्वयन की तुलना में।"
    ],
    "points": 139,
    "commentCount": 89,
    "retryCount": 0,
    "time": 1721167101
  },
  {
    "id": 40983585,
    "title": "गूगल ने टैग मैनेजर के स्वचालित अवरोधन को दरकिनार करने की विधि प्रस्तुत की",
    "originLink": "https://developers.google.com/tag-platform/tag-manager/first-party/setup-guide",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40983585",
    "commentBody": "",
    "originSummary": [
      "Google एक बीटा फीचर पेश कर रहा है जो टैग को फर्स्ट-पार्टी मोड में डिप्लॉय करने के लिए है, जिससे टैग की प्रदर्शन और डेटा गोपनीयता में सुधार होगा क्योंकि यह वेबसाइट के डोमेन का उपयोग होस्टिंग के लिए करेगा।",
      "सेटअप में डोमेन पर एक अद्वितीय पथ आरक्षित करना, ट्रैफिक को Google Cloud या Cloudflare जैसी सेवाओं के माध्यम से रूट करना, और वेबसाइट स्क्रिप्ट्स को नए मापन पथ का उपयोग करने के लिए अपडेट करना शामिल है।",
      "उपयोगकर्ताओं को टैग असिस्टेंट का उपयोग करके सेटअप का परीक्षण करने और निर्दिष्ट फीडबैक फॉर्म या संपर्क ईमेल के माध्यम से प्रतिक्रिया देने के लिए प्रोत्साहित किया जाता है।"
    ],
    "commentSummary": [
      "गूगल ने अपने टैग मैनेजर के स्वचालित अवरोधन को बायपास करने की एक विधि पेश की है, जिससे गोपनीयता और विज्ञापन अवरोधकों की प्रभावशीलता के बारे में चिंताएं बढ़ गई हैं।",
      "उपयोगकर्ता ट्रैकिंग को ब्लॉक करने की रणनीतियों पर चर्चा करते हैं, जैसे कि uBlock Origin का उपयोग करना और डिफ़ॉल्ट रूप से जावास्क्रिप्ट को अक्षम करना, और उपयोग में आसानी और गति लाभ के लिए इसे चयनात्मक रूप से सक्षम करना।",
      "Google की नई विधि ने व्यापारिक उद्देश्यों के लिए डेटा संग्रहण और उपयोगकर्ता गोपनीयता के संतुलन पर बहस छेड़ दी है, जिसमें कुछ उपयोगकर्ता Google की ट्रैकिंग प्रथाओं पर नाराजगी व्यक्त कर रहे हैं।"
    ],
    "points": 133,
    "commentCount": 74,
    "retryCount": 0,
    "time": 1721204193
  },
  {
    "id": 40979539,
    "title": "12 वर्षों तक रेस्तरां की समीक्षा करने के बाद, मैं अब इस काम को छोड़ रहा हूँ",
    "originLink": "https://www.nytimes.com/2024/07/16/dining/pete-wells-steps-down-food-critic.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40979539",
    "commentBody": "",
    "originSummary": [
      "पीट वेल्स, 12 वर्षों तक द न्यूयॉर्क टाइम्स के रेस्तरां समीक्षक के रूप में काम करने के बाद, स्वास्थ्य संबंधी चिंताओं, जिनमें उच्च कोलेस्ट्रॉल, रक्त शर्करा और उच्च रक्तचाप शामिल हैं, के कारण पद छोड़ रहे हैं।",
      "हालांकि उनकी भूमिका का पुरस्कृत करने वाला स्वभाव है, बार-बार रेस्तरां जाने का शारीरिक बोझ वेल्स के लिए असहनीय हो गया है।",
      "वेल्स द टाइम्स में बने रहेंगे लेकिन अब साप्ताहिक समीक्षाओं की मांगों को नहीं संभालेंगे, इसके बजाय वे अपने स्वास्थ्य और एक अधिक संतुलित जीवनशैली पर ध्यान केंद्रित करने का विकल्प चुन रहे हैं।"
    ],
    "commentSummary": [
      "एक लंबे समय से रेस्तरां समीक्षक 12 वर्षों के बाद पद छोड़ रहे हैं, जिससे उनके प्रभाव और रेस्तरां समीक्षाओं के भविष्य के बारे में चर्चाएं शुरू हो गई हैं।",
      "समीक्षक अपने विविध रेस्तरां विकल्पों और अपनी अनूठी, कभी-कभी अलग-थलग रहने वाली, समीक्षा शैली के लिए जाने जाते थे।",
      "इस घोषणा ने आने वाली समीक्षक मेलिसा क्लार्क के लिए उत्साह पैदा किया है और रेस्तरां उद्योग में काम करने वालों के अनुभवों पर विचार किया है।"
    ],
    "points": 133,
    "commentCount": 164,
    "retryCount": 0,
    "time": 1721158414
  },
  {
    "id": 40982011,
    "title": "बाश स्क्रिप्टिंग का परिचय",
    "originLink": "https://github.com/bobbyiliev/introduction-to-bash-scripting",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40982011",
    "commentBody": "",
    "originSummary": [
      "बाश स्क्रिप्टिंग पर एक ओपन-सोर्स गाइड/ईबुक जारी की गई है, जिसका उद्देश्य डेवलपर्स, सिस्टम प्रशासकों और देवऑप्स इंजीनियरों के लिए कार्यों को स्वचालित करना है।",
      "ईबुक में बुनियादी बैश संरचना से लेकर उन्नत स्क्रिप्टिंग तकनीकों तक के विभिन्न विषय शामिल हैं, जिनमें एपीआई के साथ काम करना और पासवर्ड जनरेट करना भी शामिल है।",
      "अतिरिक्त संसाधनों में एक मिनी वीडियो कोर्स, कटाकोडा के माध्यम से इंटरैक्टिव प्रशिक्षण, और लिनक्स देवऑप्स इंजीनियर बॉबी इलियेव के योगदान शामिल हैं।"
    ],
    "commentSummary": [
      "Bash स्क्रिप्टिंग की अक्सर तुलना टर्मिनल कार्यों के लिए Python से की जाती है, जिसमें Bash फाइल सिस्टम संचालन और सरल कमांड अनुक्रमों के लिए अधिक कुशल होती है क्योंकि यह स्वाभाविक रूप से टर्मिनल के साथ एकीकृत होती है।",
      "आलोचक बुनियादी कार्यों के लिए पायथन की जटिलता और बैश की असुविधाजनक सिंटैक्स पर ध्यान देते हैं, लेकिन बैश उन वातावरणों में आवश्यक बना रहता है जहां पायथन पहले से इंस्टॉल नहीं होता।",
      "रूबी का शेल या टेक्स्ट पार्सिंग के लिए पर्ल जैसे विकल्प मौजूद हैं, और चैटजीपीटी जैसे उपकरण स्क्रिप्ट जनरेशन में सहायता कर सकते हैं, लेकिन बाश की मूल बातें समझना अभी भी मूल्यवान है।"
    ],
    "points": 109,
    "commentCount": 95,
    "retryCount": 0,
    "time": 1721182562
  },
  {
    "id": 40983717,
    "title": "कार्यालय में वापसी के आदेश प्रतिभा के जोखिम के लायक नहीं हैं",
    "originLink": "https://www.gartner.com/en/articles/the-data-is-in-return-to-office-mandates-aren-t-worth-the-talent-risks",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40983717",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "कार्यालय में वापसी (RTO) के आदेशों से शीर्ष प्रतिभाओं को खोने का जोखिम है, क्योंकि जिन कर्मचारियों के पास विकल्प हैं, वे पहले जा सकते हैं, जिससे संभावित रूप से एक डोमिनो प्रभाव हो सकता है।",
      "लचीले विकल्प, जैसे यात्रा मुआवजा या बेहतर कार्यालय सुविधाएं, सख्त RTO आदेशों के बेहतर विकल्प के रूप में सुझाए गए हैं।",
      "बहस में उत्पादकता, मार्गदर्शन, और व्यक्तिगत प्राथमिकताओं पर विचार शामिल हैं, जिसमें कुछ लोग RTO को पुराने प्रबंधन दृष्टिकोण या आर्थिक दबावों से प्रेरित मानते हैं।"
    ],
    "points": 102,
    "commentCount": 106,
    "retryCount": 0,
    "time": 1721205855
  }
]
