[
  {
    "id": 37626273,
    "title": "iCloud Drive poistaa sisällön äänettömästi",
    "originLink": "https://www.dominikmayer.com/2023/09/icloud-drive-silently-deletes-your-content/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37626273",
    "commentBody": "",
    "originSummary": [
      "Artikkelissa käsitellään iCloud Driven ongelmaa, jossa se poistaa hiljaa käyttäjän sisältöä tiedostoristiriitojen vuoksi.",
      "Kirjoittaja hyödyntää henkilökohtaisia kokemuksiaan tärkeiden tiedostojen menettämisestä ja suosittelee käyttäjiä siirtämään tärkeät tiedot iCloud Drivesta, kunnes ongelma on korjattu.",
      "Ehdotettu lieventämisstrategia on Git-tietovaraston, versionhallintajärjestelmän, perustaminen, joka auttaa seuraamaan tiedostojen muutoksia ja estämään tietojen katoamisen."
    ],
    "commentSummary": [
      "Käyttäjät ovat ilmaisseet huolensa iCloud Drivesta ja raportoineet ongelmista, kuten sisällön perusteettomasta poistamisesta ja mahdollisista tietoturva-aukoista.",
      "Keskustelua käydään Applen Switch Control -ominaisuuden käytön tehokkuudesta etätukeen, Applen ohjelmistojen ongelmista, Git-tietovarastojen tietojen synkronointiin liittyvistä ongelmista ja puutteista päästä päähän -salauksen ja konfliktien hallintamekanismien osalta.",
      "Käyttäjät ehdottavat tietojen synkronointiin ja tallentamiseen vaihtoehtoja, kuten syncthingiä, mikä kuvastaa yleistä tyytymättömyyttä ja luottamuspulaa iCloud Driveen ja vahvistaa tietojen luotettavuuden ja turvallisuuden merkitystä."
    ],
    "points": 314,
    "commentCount": 233,
    "retryCount": 0,
    "time": 1695495423
  },
  {
    "id": 37623562,
    "title": "Visual Studio Code -ohjelman sulautetun käänteisen kuoren estäminen ennen kuin on liian myöhäistä",
    "originLink": "https://ipfyx.fr/post/visual-studio-code-tunnel/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37623562",
    "commentBody": "",
    "originSummary": [
      "Artikkelissa käsitellään Microsoftin Visual Studio Code -ohjelman käänteisen kuoren ominaisuuteen liittyviä tietoturvariskejä.",
      "Se neuvoo käyttämään verkkotunnusten esto- ja valkoluettelointitekniikkaa näiden riskien minimoimiseksi, vaikka Applockerin sääntö ei ehkä olekaan sovellettavissa, jolloin hash-ehdot ovat mahdollisesti välttämättömiä.",
      "Siinä korostetaan, että Visual Studio Codessa ei tällä hetkellä ole sisäänrakennettuja ohjaimia tätä ominaisuutta varten, ja kehotetaan tehostettuihin turvatoimiin."
    ],
    "commentSummary": [
      "Pääaiheena ovat Visual Studio Codeen, suosittuun tekstieditoriin ja integroituun kehitysympäristöön (IDE), sulautetun reverse shell -ominaisuuden tietoturva-aukot.",
      "Tämän ominaisuuden aiheuttamat riskit vaihtelevat, ja jotkut osallistujat ovat huolissaan mahdollisesta luvattomasta käytöstä ja tietovarkauksista.",
      "Keskustelussa käsitellään lisäksi tekstieditoreiden ja IDE-ohjelmien laajempia tietoturva-asioita ja korostetaan tietoturvatoimien tehokkuutta ja tietoturvaloukkausten välttämisen merkitystä."
    ],
    "points": 295,
    "commentCount": 80,
    "retryCount": 0,
    "time": 1695479395
  },
  {
    "id": 37626731,
    "title": "Bottlerocket - Minimaalinen, muuttumaton Linux-käyttöjärjestelmä varmistetulla käynnistyksellä.",
    "originLink": "https://bottlerocket.dev",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37626731",
    "commentBody": "",
    "originSummary": [
      "Bottlerocket on Linux-pohjainen käyttöjärjestelmä, joka on suunniteltu erityisesti konttien isännöintiin, ja se sopii erinomaisesti Kubernetesin kaltaisille konttiorkestraattoreille.",
      "Käyttöjärjestelmälle on ominaista minimaalinen yleiskustannus, turvalliset päivitykset ja voimakas keskittyminen tietoturvaominaisuuksiin, kuten käännettyjen kielten käyttöön, muuttumattomaan juuritiedostojärjestelmään ja pakotettuihin SELinux-käytäntöihin.",
      "Se tarjoaa erilaisia räätälöityjä muunnelmia, jotka soveltuvat erilaisiin ympäristöihin, ja sitä voidaan hallita etuoikeutettujen isäntäkonttien avulla. Päivitykset toimitetaan kuvien kautta, ja ne voidaan tarvittaessa palauttaa."
    ],
    "commentSummary": [
      "Bottlerocket on AWS:n kehittämä Linux-pohjainen käyttöjärjestelmä, joka on suunniteltu erityisesti konttien käyttämiseen ja muistuttaa CoreOS:ää ja Flatcar Linuxia.",
      "Bottlerocketin ainutlaatuisiin ominaisuuksiin kuuluvat haavoittuvuuksien skannaus ja A/B-jakojärjestelmä päivityksiä varten, mutta tällä hetkellä siitä ei kuitenkaan ole näkyvää tietä itsenäiseksi tuotteeksi, ja FIPS-tuen sisällyttäminen siihen on haasteellista.",
      "Bottlerocketia koskevissa keskusteluissa korostetaan myös epävarmuustekijöitä, jotka koskevat sen käyttöönottoa AWS:n ulkopuolella, yhteensopivuutta AWS-ympäristössä, isäntäkoneen komentotulkin puuttumista, tietoturvaominaisuuksia ja vertailua NixOS:ään."
    ],
    "points": 287,
    "commentCount": 53,
    "retryCount": 0,
    "time": 1695498296
  },
  {
    "id": 37628337,
    "title": "SpamChannel: Spoofing emails from 2M domains and virtually becoming Satan [pdf]",
    "originLink": "https://media.defcon.org/DEF%20CON%2031/DEF%20CON%2031%20presentations/byt3bl33d3r%20-%20SpamChannel%20Spoofing%20Emails%20From%202%20Million%20Domains%20and%20Virtually%20Becoming%20Satan.pdf",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37628337",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Keskustelussa keskitytään hakkeriin, joka väärensi huomaamattomalla tekniikalla sähköpostiviestejä kahdesta miljoonasta verkkotunnuksesta, mikä herättää kysymyksiä tavanomaisten sähköpostin todentamismenetelmien tehokkuudesta.",
      "Siinä suositellaan DKIM:n ja DMARC:n käytön lisäämistä ja keskustellaan verkkotunnuksen tarkistamisen standardoinnin tarpeesta, mikä korostaa sähköpostin tietoturvan haavoittuvuuksia.",
      "Lisäksi keskustellaan ARC-teknologian mahdollisista hyödyistä ja ongelmista roskapostin suodatuksen tehostamisessa ja korostetaan tarvetta parantaa strategioita roskapostin torjumiseksi."
    ],
    "points": 286,
    "commentCount": 89,
    "retryCount": 0,
    "time": 1695509612
  },
  {
    "id": 37624070,
    "title": "Älä laita muovia mikroaaltouuniin",
    "originLink": "https://www.bonappetit.com/story/can-you-put-plastic-in-the-microwave",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37624070",
    "commentBody": "",
    "originSummary": [
      "Nebraska-Lincolnin yliopiston tutkimus osoitti, että muovipakkausten mikrossa lämmittäminen vapauttaa mikromuoveja ja nanomuoveja elintarvikkeisiin, mikä saattaa häiritä hormonitoimintaa ja aiheuttaa terveysriskejä.",
      "Muovipakkausten \"mikroaaltouuninkestävä\" -merkintä kertoo vain muovin lämmönkestävyydestä, ei sen turvallisuudesta. Tällaisista astioista voi silti vapautua haitallisia hiukkasia, kuten bisfenoleja ja ftalaatteja.",
      "Muovityypit yksi ja kuusi aiheuttavat suurempia terveysriskejä mikroaaltouunissa, kun taas tyypit kaksi ja viisi ovat turvallisempia. Asiantuntijat suosittelevat lasiastioiden käyttöä muovien sijasta ruoan mikroaaltouunissa."
    ],
    "commentSummary": [
      "Keskustelu pyörii pääasiassa muovipakkausten mikroaaltouunissa käyttämiseen liittyvien turvallisuusongelmien ympärillä, ja siinä tarkastellaan vaihtoehtoja, kuten lasiastioita.",
      "Tässä postauksessa tutkitaan muovin käytön, syöpätapausten lisääntymisen ja mikromuovien terveysvaikutusten välistä mahdollista yhteyttä.",
      "Siinä arvioidaan myös mikroaaltokeittämisen käytännöllisyyttä ja tehokkuutta sekä punnitaan muovin käytön terveysriskejä ja hyötyjä."
    ],
    "points": 273,
    "commentCount": 313,
    "retryCount": 0,
    "time": 1695482501
  },
  {
    "id": 37627745,
    "title": "EU sakottaa Inteliä 400 miljoonan dollarin sakolla AMD:n markkinoillepääsyn estämisestä.",
    "originLink": "https://www.neowin.net/news/eu-fines-intel-400-million-for-blocking-amds-market-access-through-payments-to-pc-makers/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37627745",
    "commentBody": "",
    "originSummary": [
      "Euroopan komissio on määrännyt Intelille 400 miljoonan dollarin sakon, koska se on estänyt AMD:n markkinoille tulon maksamalla PC-valmistajille vuosina 2002-2007.",
      "Todettiin, että Intel lahjoi PC-valmistajia viivästyttämään AMD:n prosessoreita käyttävien tuotteiden valmistusta tai rajoittamaan sitä, mikä vaikutti kielteisesti kilpailuun x86-suorittimien markkinoilla.",
      "Vaikka Intelille määrättiin vuonna 2009 1,13 miljardin dollarin sakko määräävän markkina-aseman väärinkäytöstä, sitä uhkaavat vielä mahdolliset lisäsakot, sillä komissio on valittanut alennusta koskevan osan hylkäämisestä."
    ],
    "commentSummary": [
      "Euroopan unioni on määrännyt Intelille 400 miljoonan dollarin sakon AMD:n markkinoillepääsyn estämisestä, mikä on herättänyt keskustelua kilpailua rajoittavista käytännöistä teknologiateollisuudessa.",
      "Jatkuvaa keskustelua käydään tällaisen käyttäytymisen vaikutuksesta AMD:n kasvuun, markkinoiden manipulointisyytöksistä sekä AMD:n kannettavien tietokoneiden saatavuuden ja vaihtoehtojen puutteesta Inteliin verrattuna.",
      "Keskustelussa spekuloidaan myös Intelin osakekurssin pysähtyneellä kehityksellä viimeisten 15 vuoden aikana, tuotteiden myynnin mahdollisilla seurauksilla alle omakustannushinnan, AMD:n paremman tuen vaatimuksella ja Taiwanin geopoliittista kohtelua koskevilla huolenaiheilla."
    ],
    "points": 260,
    "commentCount": 110,
    "retryCount": 0,
    "time": 1695504623
  },
  {
    "id": 37629874,
    "title": "Alusta, joka mahdollistaa Windows-ajurien kehittämisen Rustilla",
    "originLink": "https://github.com/microsoft/windows-drivers-rs",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37629874",
    "commentBody": "",
    "originSummary": [
      "\"windows-drivers-rs\" on Rust-pohjainen arkisto, joka mahdollistaa Windows-ajureiden kehittämisen tukemalla sekä WDM (Windows Driver Model) että WDF (Windows Driver Framework) -malleja.",
      "Arkisto tarjoaa useita laatikoita, jotka yhdistävät yhteydet Windows Development Kitiin (WDK), mukaan lukien sidokset, kirjastot ja makrot.",
      "Vielä alkuvaiheessa oleva \"windows-drivers-rs\" tukee WDM-, KMDF- (Kernel-Mode Driver Framework) ja UMDF- (User-Mode Driver Framework) -ajureiden konfiguraatioita, ja siihen on tarkoitus lisätä lisää konfiguraatioita tulevaisuudessa. Sitä ei kuitenkaan tällä hetkellä suositella kaupalliseen käyttöön."
    ],
    "commentSummary": [
      "Microsoft on luonut foorumin, jolla edistetään Rustin käyttöä Windows-ajurikehityksessä ja korostetaan haasteita ja hyötyjä, jotka liittyvät ajurien kirjoittamiseen Rustilla sekä Windows- että Linux-järjestelmiin.",
      "Keskustelussa tuodaan esiin C#:n kaltaisen muistinhallintakielen valinnan edut laiteajurien kehittämisessä ja yhdistetään argumentti ohjelmiston suorituskyvyn merkitykseen.",
      "Keskustelussa tarkastellaan myös Rustin etuja ytimen kehityksessä, roskienkeräyksen roolia ajurien kehityksessä sekä hahmotellaan mikroytimen lähestymistavan ja Midori-projektin mahdollisuuksia."
    ],
    "points": 232,
    "commentCount": 91,
    "retryCount": 0,
    "time": 1695525570
  },
  {
    "id": 37623955,
    "title": "Miksi salakauppiaat voivat saada lippuja",
    "originLink": "https://www.404media.co/why-scalpers-can-get-olivia-rodrigo-tickets-and-fans-cannot/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37623955",
    "commentBody": "",
    "originSummary": [
      "Ticketmasterin \"Verified Fan\" -järjestelmää, joka oli alun perin suunniteltu hillitsemään skalpeerausta, manipuloivat skalpeeraajat omaksi edukseen.",
      "Huijarit käyttävät useita tilejä, erikoistuneita internet-selaimia ja irtotavarana ostettuja puhelinnumeroita lisätäkseen mahdollisuuksiaan saada lippuja suosittuihin konsertteihin.",
      "He voivat myydä lippuja jo ennen kuin ne ovat virallisesti myynnissä ja korvata aiemmin myydyt liput paremmilla lipuilla, mikä osoittaa, että järjestelmä suosii ammattimaisia lipunostajia tavallisten fanien sijaan."
    ],
    "commentSummary": [
      "Keskustelussa keskitytään lipunmyynnin ongelmaan, tarkastellaan sen taustalla olevia erilaisia motiiveja ja ehdotetaan mahdollisia ratkaisuja.",
      "Osallistujat pohtivat erilaisia strategioita, kuten lippujen yhdistämistä ostajan nimeen ja henkilöllisyyden tarkistamista, dynaamista hinnoittelua ja arpajaisia, ja kannattivat merkittäviä innovaatioita Ticketmasterin kaltaisissa lipunmyyntijärjestelmissä.",
      "Vuoropuhelussa korostetaan sääntelyn tehostamisen tarvetta ja käsitellään samalla lippualan rakenteellisia ongelmia, ja korostetaan sekä faneihin että taiteilijoihin kohdistuvia vaikutuksia."
    ],
    "points": 226,
    "commentCount": 389,
    "retryCount": 0,
    "time": 1695481822
  },
  {
    "id": 37628525,
    "title": "IPFS-tuki yhdistettiin curliin",
    "originLink": "https://twitter.com/bmann/status/1705572964068930010",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37628525",
    "commentBody": "",
    "originSummary": [
      "IPFS (InterPlanetary File System), hajautettuun tiedostojen tallennukseen ja jakamiseen suunniteltu protokolla, on nyt sisällytetty curl-ohjelmistoon.",
      "Tämä integrointi on osoitus IPFS:n ja sisällön osoitustekniikan jatkuvuudesta ja pysyvästä merkityksestä verkkoinfrastruktuurissa.",
      "curl, laajalti käytetty työkalu tietojen siirtämiseen eri verkkoprotokollien välityksellä, laajentaa IPFS:n ulottuvuutta ja hyödyllisyyttä tukemalla sen hajautettua, sisältöpohjaista osoitemallia."
    ],
    "commentSummary": [
      "Curl on lisännyt IPFS-tuen (InterPlanetary File System) järjestelmäänsä, vaikka keskustelua käydäänkin siitä, onko tämä toteutus todellinen IPFS-tuki vai vain uudelleenkirjoitettuja URL-osoitteita.",
      "Nykyisestä toteutuksesta puuttuu tarkistusominaisuus, jonka avulla voidaan tarkistaa, että tuloste vastaa IPFS-osoitetta. Parannuksena ehdotetaan jatkuvaa tarkistusta IPFS-yhdyskäytävien kautta.",
      "Keskustelua käydään IPFS:n käyttöönoton mahdollisista riskeistä ja siitä, miksi käyttäjät yleensä käyttävät mieluummin IPFS-yhdyskäytäviä kuin IPFS-solmuja, sekä harkitaan tuen lisäämistä magneetti- ja .onion-URL-osoitteille curl-työkaluun."
    ],
    "points": 220,
    "commentCount": 62,
    "retryCount": 0,
    "time": 1695510879
  },
  {
    "id": 37624201,
    "title": "Elintärkeä taito puhua vieraille ihmisille (2021)",
    "originLink": "https://www.economist.com/books-and-arts/2021/07/10/the-vital-art-of-talking-to-strangers",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37624201",
    "commentBody": "",
    "originSummary": [
      "Artikkelissa syvennytään tuntemattomien ihmisten kanssa toimimisen merkitykseen ja mahdollisiin haasteisiin, joita käsitellään yksityiskohtaisesti kolmessa kirjassa.",
      "Siinä keskitytään vieraisiin kohdistuvien asenteiden kehitykseen, joka etenee lapsuuden varovaisuudesta vuorovaikutuksen kaipuuseen nuoruudessa ja varhaisessa aikuisuudessa.",
      "Jännitys ja mahdollisuus eskapismiin, joka syntyy vieraiden ihmisten kanssa toimimisesta, on artikkelin keskeinen painopiste."
    ],
    "commentSummary": [
      "Kommenttiosassa käsitellään asenteita, jotka liittyvät vuorovaikutukseen vieraiden ihmisten kanssa eri alueilla, ja verrataan kaupunkien ja maaseudun ystävällisyyttä.",
      "Käsiteltäviä aiheita ovat muun muassa sosiaalisen ahdistuksen voittaminen, lentokoneessa käytävien keskustelujen hankaluus, odottamattomien kohtaamisten hyödyt ja neuvoja keskustelujen aloittamiseen.",
      "Keskustelussa korostetaan myönteisten vuorovaikutussuhteiden merkitystä ja tuodaan esiin yksilöllisiä eroja mieltymyksissä ja prioriteeteissa, kun ollaan tekemisissä vieraiden ihmisten kanssa."
    ],
    "points": 178,
    "commentCount": 148,
    "retryCount": 0,
    "time": 1695483299
  },
  {
    "id": 37623479,
    "title": "Vakoiluohjelmat voivat tartuttaa puhelimen tai tietokoneen verkossa näkemiesi mainosten kautta - raportti",
    "originLink": "https://theconversation.com/spyware-can-infect-your-phone-or-computer-via-the-ads-you-see-online-report-213685",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37623479",
    "commentBody": "",
    "originSummary": [
      "Israelilainen teknologiayritys Insanet on luonut Sherlock-nimisen vakoiluohjelman, jota levitetään verkkomainosverkkojen kautta ja joka muuttaa tietyt mainokset troijalaisiksi hevosiksi.",
      "Toisin kuin perinteiset puhelimen haavoittuvuuksia hyödyntävät vakoiluohjelmat, Sherlock käyttää mainosverkkoja asentaakseen itsensä salaa, jolloin se pääsee käsiksi kohteen laitteen sisältöön.",
      "Sherlock voi tartuttaa tietokoneita ja Android-puhelimia sekä iPhoneja, ja sen epäillään olevan samankaltainen aiemmin tunnistetun Pegasus-vakoiluohjelman kanssa, mikä herättää huolta siviilivalvonnasta ja mahdollisesta väärinkäytöstä."
    ],
    "commentSummary": [
      "Artikkelissa käsitellään vakoiluohjelmia, erityisesti \"Sherlockia\", jotka käyttävät verkkomainoksia hyväkseen tartuttaakseen laitteita mahdollisesti selaimen tai käyttöjärjestelmän haavoittuvuuksien kautta.",
      "Mainosteknologian muuttamista suositellaan, ja otetaan käyttöön uusi malli nimeltä Sellff Offers. Suositellaan suojatoimia, kuten JavaScriptin poistamista käytöstä ja mainosten estolaitteiden käyttöä.",
      "Keskustelussa käsitellään eettisiä vaikutuksia, sisällöntuottajien tukemista ja vaihtoehtoisia rahanmuodostusmenetelmiä, ja kirjoittaja suosii mieluummin suoraa tukea sisällöntuottajille kuin mainosteknologian käyttöä."
    ],
    "points": 168,
    "commentCount": 114,
    "retryCount": 0,
    "time": 1695478912
  },
  {
    "id": 37623405,
    "title": "Intia ei onnistu palauttamaan yhteyttä kuun luotaimensa kanssa",
    "originLink": "https://efe.com/en/science-and-technology/2023-09-22/india-fails-to-re-establish-communication-with-its-moon-probe/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37623405",
    "commentBody": "",
    "originSummary": [
      "Intian avaruustutkimusjärjestö (ISRO) ei ole onnistunut palauttamaan yhteydenpitoa kuun luotaimensa Vikram-laskeutumisaluksen ja Pragyan-maasturin kanssa, mikä on lopettanut toiveet niiden toiminnan jatkumisesta.",
      "Vikram-laskeutuja ja Pragyan-matkaaja lähetettiin Kuun etelänavalle, mikä teki ISRO:sta neljännen kokonaisuuden maailmanlaajuisesti, joka onnistui laskeutumisessa, vaikka oli epäilyjä ajoneuvojen kestävyydestä Kuun äärimmäisiä lämpötiloja vastaan.",
      "Ponnistelut yhteyden palauttamiseksi kuun kulkuneuvoihin jatkuvat, mikä on merkki ISRO:n sinnikkäästä tahdosta voittaa avaruustutkimuksen haasteet."
    ],
    "commentSummary": [
      "Intian pyrkimys palauttaa yhteys kuun luotaimen kanssa ei ole onnistunut, mutta tehtävää pidetään silti onnistuneena.",
      "Keskustelussa tuodaan esiin tekniset haasteet ja kuun äärimmäisen kylmien lämpötilojen vaikutukset, jotka vaikuttavat ajoneuvojen ja laitteiden suorituskykyyn.",
      "Radioisotooppilämpögeneraattorit, jotka ovat olennainen avaruustutkimuksessa käytettävä teknologia, mainitaan tällaisten vastakkaisten olosuhteiden voittamisen yhteydessä."
    ],
    "points": 166,
    "commentCount": 72,
    "retryCount": 0,
    "time": 1695478533
  },
  {
    "id": 37624400,
    "title": "Kirjoitin uudelleen 1990-luvun LambdaMOO-palvelimen...",
    "originLink": "https://github.com/rdaum/moor",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37624400",
    "commentBody": "",
    "originSummary": [
      "Henkilö on ollut mukana käyttämässä ja kehittämässä LambdaMOO:ta, monikäyttäjän virtuaaliympäristöä ja ohjelmointijärjestelmää, 90-luvun alusta lähtien.",
      "He ryhtyivät uudistamaan LambdaMOO:ta hyödyntääkseen nykyteknologian etuja ja parantaakseen sen yhteensopivuutta.",
      "Lähes valmis toteutus on nyt kirjoitettu Rust-kielellä (moderni järjestelmäohjelmointikieli), ja he toivovat tukea henkilöiltä, jotka ovat kiinnostuneita tällaisesta virtuaalisesta sosiaalisesta ympäristöstä."
    ],
    "commentSummary": [
      "Keskustelun pääaiheena on henkilö, joka loi LambdaMOO-palvelimen uudelleen Rust-ohjelmointikielellä parantaakseen sosiaaliseen vuorovaikutukseen ja jaettuun ohjelmointiin keskittyvää virtuaalista sosiaalitilajärjestelmää.",
      "Hankkeesta vastannut henkilö pyytää apua ja palautetta erityisesti järjestelmän taaksepäin yhteensopivuuteen liittyvistä haasteista.",
      "Osallistujat keskustelevat MOO-moottoreista, vaihtoehtoisista ohjelmointikielistä ja olemassa olevien LambdaMOO-instanssien säilyttämiseen liittyvistä vaikeuksista, ilmaisevat innostusta ja jakavat LambdaMOO-resursseja."
    ],
    "points": 163,
    "commentCount": 53,
    "retryCount": 0,
    "time": 1695484608
  },
  {
    "id": 37630914,
    "title": "Google tappaa Gmailin Basic HTML View -näkymän vuoden 2024 alussa.",
    "originLink": "https://support.google.com/mail/answer/15049?hl=en",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37630914",
    "commentBody": "",
    "originSummary": [
      "Gmail-käyttäjät voivat käyttää Basic HTML -näkymää tammikuuhun 2024 asti, minkä jälkeen järjestelmä siirtyy automaattisesti Standard-näkymään.",
      "Jos käyttäjillä on ongelmia vakionäkymän lataamisessa, he voivat etsiä vikoja selaimestaan, internet-yhteydestään tai laitteestaan.",
      "Basic HTML -näkymästä puuttuu joitakin ominaisuuksia, jotka ovat saatavilla Standard-näkymässä, ja käyttäjiä kehotetaan siirtymään Gmail-sovellukseen tai toiseen sähköpostiohjelmaan, jos ongelmat jatkuvat."
    ],
    "commentSummary": [
      "Google on ilmoittanut lopettavansa Gmailin Basic HTML View -näkymän, mikä on herättänyt keskustelua webmailin tulevaisuudesta, sähköpostin luotettavuudesta verrattuna viestisovelluksiin ja Googlen roolista mainosliiketoimintana.",
      "Keskusteluissa käsitellään suosituksia vaihtoehtoisista sähköpostipalveluista, pelkoja JavaScriptin runsaasta käytöstä ja siitä johtuvista hitaista latausajoista sekä alhaisen kaistanleveyden skenaarioiden huomioon ottamisen korostamista.",
      "Lisäksi mainitaan huolenaiheet, jotka liittyvät tietorajoitteisiin ympäristöihin, yritysten velvollisuuteen vastata erilaisiin asiakasvaatimuksiin ja erilaisiin aiheisiin, kuten risteilyalusten monopoleihin ja saavutettavuuteen ääritapauksissa."
    ],
    "points": 142,
    "commentCount": 135,
    "retryCount": 0,
    "time": 1695540701
  },
  {
    "id": 37624506,
    "title": "Mato, joka hyppää rotista etanoihin ja ihmisten aivoihin, on vallannut Kaakkois-Yhdysvallat.",
    "originLink": "https://arstechnica.com/health/2023/09/worm-that-jumps-from-rats-to-slugs-to-human-brains-has-invaded-southeast-us/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37624506",
    "commentBody": "",
    "originSummary": [
      "Emerging Infectious Diseases -lehdessä julkaistussa tutkimuksessa vahvistetaan, että rotan keuhkomato, loinen, joka voi tarttua ihmisen aivoihin, on levinnyt Yhdysvaltojen kaakkoisosiin.",
      "Atlantan eläintarhassa testatuista 33 rotasta seitsemässä havaittiin merkkejä loisesta. Rotan keuhkomato elää tyypillisesti rotissa, siirtyy etanoihin tai etanoihin ja voi nieltynä tarttua ihmiseen aiheuttaen vakavia neurologisia toimintahäiriöitä ja jopa kuoleman.",
      "Tutkimus osoittaa, että loinen leviää alueella nopeasti."
    ],
    "commentSummary": [
      "Yhdysvaltojen kaakkoisosassa yleinen mato, Angiostrongylus cantonensis, on tartuttanut rottia, etanoita ja jopa ihmisiä, mikä voi aiheuttaa oireita, kuten päänsärkyä, unettomuutta ja vakavissa tapauksissa aivokalvontulehdusta.",
      "Madon tartunta voi tarttua syömällä liian vähän kypsennettyjä etanoita tai tartunnan saaneita etanoita, minkä vuoksi ihmisten on pestävä ja valmistettava vihannekset huolellisesti mahdollisen tartunnan välttämiseksi.",
      "Etanoiden ja loisten esiintyminen viherkasveissa, tautien leviäminen näiden saastuneiden resurssien välityksellä ja mahdolliset vaikutukset paikallisiin asuntomarkkinoihin herättävät yhä enemmän huolta."
    ],
    "points": 137,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1695485314
  },
  {
    "id": 37627129,
    "title": "Cambridge Law Corpus: Korpus oikeudellista tekoälytutkimusta varten",
    "originLink": "https://arxiv.org/abs/2309.12269",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37627129",
    "commentBody": "",
    "originSummary": [
      "Cambridge Law Corpus on uusi tekoälyn oikeudelliseen tutkimukseen tarkoitettu tietokokonaisuus, joka sisältää yli 250 000 brittiläistä oikeustapausta 1500-luvulta nykypäivään.",
      "Raakatekstin ja metatietojen lisäksi korpus sisältää 638 tapauksen lopputuloksia koskevia merkintöjä, ja artikkelissa kuvataan tapausten lopputulosten louhintamallien harjoittelu- ja testausprosessia annotoitujen tietojen avulla.",
      "Vaikka GPT-3:n, GPT-4:n ja RoBERTan kaltaisten mallien suorituskykyä vertaillaan, korpuksen saatavuus on eettisten näkökohtien vuoksi rajoitettu tutkimukseen."
    ],
    "commentSummary": [
      "Cambridge Law Corpus, kattava kokoelma lakitekstejä, on luotu nimenomaan oikeudellista tekoälytutkimusta varten.",
      "Harvardin oikeustieteellisen kirjaston kirjastoinnovaatiolaboratorio on perustanut Caselaw Access Project -hankkeen, jonka avulla on mahdollista saada käyttöönsä koko Yhdysvaltain oikeuskäytäntö, mikä on ollut haastavaa maksumuurien vuoksi.",
      "Laboratorio on myös julkaisemassa Collaborative Open Legal Dataset (COLD-tapauksia) tekoäly- ja koneoppimishankkeita varten, mutta pääsy Cambridgen lakikorpukseen on tällä hetkellä rajoitettu tunnustettujen laitosten tutkijoille."
    ],
    "points": 127,
    "commentCount": 33,
    "retryCount": 0,
    "time": 1695500573
  },
  {
    "id": 37623314,
    "title": "CRISPR-silkkimadot tekevät hämähäkkisilkkiä, joka uhmaa rajoituksia.",
    "originLink": "https://www.genengnews.com/topics/genome-editing/crispr-silkworms-make-spider-silk-that-defies-scientific-constraints/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37623314",
    "commentBody": "",
    "originSummary": [
      "Tutkijat ovat onnistuneet manipuloimaan silkkiäistoukkia CRISPR-teknologian avulla ja tuottamaan ensimmäisen täyspitkän hämähäkkisilkin, mikä tasoittaa tietä kestävien ja kevyiden materiaalien kestävälle tuotannolle.",
      "Hämähäkkisilkki on yli kuusi kertaa vahvempaa kuin kevlar, ja sillä on suuri vetolujuus, joka on parempi kuin useimmilla muilla luonnon- ja synteettisillä kuiduilla, mikä tekee siitä vihreämmän vaihtoehdon synteettisille kuiduille, kuten nailonille ja kevlarille.",
      "Saavutus tarjoaa mahdollisuuksia hämähäkkisilkin kaupallistamiselle, sillä se tarjoaa kestävän vaihtoehdon erilaisiin sovelluksiin ja edistää samalla \"supermateriaalien\" kehittämistä."
    ],
    "commentSummary": [
      "Tutkijat ovat käyttäneet CRISPR-geeninmuokkaustekniikkaa kehittäessään silkkiäistoukkia, jotka tuottavat hämähäkkisilkkiä, joka on 160 prosenttia vahvempaa materiaalia kuin perinteinen silkkiäistoukka.",
      "Tätä edistystä voitaisiin käyttää monilla eri aloilla, kuten valmistettaessa tukevampia materiaaleja avaruushissejä varten tai kudottaessa säiliöitä vedyn varastointiin.",
      "Hämähäkkisilkin käyttöä voidaan kuitenkin rajoittaa tilanteissa, joissa tarvitaan suurta jäykkyyttä, koska se ei luonnostaan ole jäykkää."
    ],
    "points": 122,
    "commentCount": 39,
    "retryCount": 0,
    "time": 1695477809
  },
  {
    "id": 37625283,
    "title": "CRM henkilökohtaisia suhteita varten",
    "originLink": "https://www.elim.app/eng/home",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37625283",
    "commentBody": "",
    "originSummary": [
      "\"Uusi Elim-sovellus, jonka tarkoituksena on torjua yksinäisyyttä ja asettaa ihmissuhteet etusijalle, on lanseerattu.",
      "Sovellus tarjoaa ominaisuuksia, joiden avulla käyttäjät voivat tunnistaa ja pitää yhteyttä elämänsä tärkeisiin henkilöihin, päivittäisiä muistutuksia yhteyden pitämisestä ja virtuaalisten postikorttien lähettämistä erilaisilla malleilla.",
      "The New Elim on tällä hetkellä alkuvaiheessa, ja sen kehittäjät pyytävät käyttäjiltä palautetta tulevien parannusten ohjaamiseksi."
    ],
    "commentSummary": [
      "Elim.app on julkaissut MVP-tuotteen (Minimum Viable Product), joka on suunniteltu auttamaan yksilöitä keskittymään olennaisiin suhteisiin, ja se sisältää muun muassa ilmoituksia ja digitaalisia postikortteja.",
      "Käyttäjät ovat ehdottaneet parannuksia, kuten manuaalista yhteystietojen syöttämistä ja integrointia viestisovelluksiin. Kehittäjät ovat osoittaneet, että he eivät aio näyttää mainoksia tai myydä käyttäjien tietoja, mutta harkitsevat premium-tilausmallia.",
      "Sovelluksen verkkosivuston saksankielisyys on herättänyt huolta, mikä on johtanut keskusteluihin sovelluksen mahdollisuuksista ja parannuksista sekä rajoituksista, joita liittyy siihen, että yhteiskunnallisten kysymysten ratkaisemisessa ei pidä tukeutua liiaksi teknologiaan."
    ],
    "points": 113,
    "commentCount": 83,
    "retryCount": 0,
    "time": 1695489677
  },
  {
    "id": 37625291,
    "title": "Rouva Agatha Christien outo katoaminen (2022)",
    "originLink": "https://blog.nationalarchives.gov.uk/20speople-investigating-the-strange-disappearance-of-mrs-agatha-christie/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37625291",
    "commentBody": "",
    "originSummary": [
      "Tässä postauksessa tarkastellaan tunnetun rikoskirjailijan Agatha Christien arvoituksellista katoamista vuonna 1926, sitä seurannutta poliisitutkintaa ja tapauksen aiheuttamaa julkista juonittelua.",
      "Artikkelissa pohditaan erilaisia teorioita ja arvailuja hänen katoamisestaan sekä kritisoidaan poliisin toimintaa ja etsintöjen kustannuksia.",
      "Kirjoittaja tuo esiin joitakin epätarkkuuksia tiedotusvälineiden uutisoinnissa tuona aikana."
    ],
    "commentSummary": [
      "Ensimmäisessä artikkelissa tarkastellaan Agatha Christien selittämättömään katoamiseen liittyviä teorioita, mukaan luettuna mahdollisuus, että katoaminen tapahtui julkisuuden vuoksi, ja tarjotaan historiallinen konteksti.",
      "Toisessa teoksessa tarkastellaan Sherlock Holmesin tarinoissa esiintyviä epäjohdonmukaisuuksia ja tutkitaan Arthur Conan Doylen uskomuksia.",
      "Kolmannessa ja neljännessä keskustelussa käsitellään laajasti alkemiaa, uskontoa ja tunnettujen kirjailijoiden teoksia, keskustellaan poliisin roolista Agatha Christien katoamisessa ja lasketaan myydyimpiä kirjoja ja kirjailijoita."
    ],
    "points": 107,
    "commentCount": 81,
    "retryCount": 0,
    "time": 1695489716
  },
  {
    "id": 37624112,
    "title": "Valosapeleita koskeva TSA:n politiikka",
    "originLink": "https://www.tsa.gov/travel/security-screening/whatcanibring/items/light-saber",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37624112",
    "commentBody": "",
    "originSummary": [
      "Liikenteen turvallisuusviranomainen (TSA) sallii matkustajien kuljettaa leluvalosapeleita sekä käsimatkatavaroissa että kirjattavissa laukuissa.",
      "Lopullinen päätös siitä, voiko esine kulkea turvatarkastuksen läpi, on TSA:n virkailijan käsissä.",
      "Nämä tiedot ovat julkisesti saatavilla TSA:n virallisella verkkosivustolla, joka on osa Yhdysvaltojen sisäisen turvallisuuden ministeriötä."
    ],
    "commentSummary": [
      "Keskustelujen keskeisenä aiheena on TSA:n lentoasemilla soveltamien turvamenettelyjen tehokkuus ja rooli.",
      "Näkemykset vaihtelevat: jotkut osallistujat kyseenalaistavat näiden käytäntöjen tehokkuuden ja toiset puolustavat niiden merkitystä.",
      "Lisäksi keskustelussa käsitellään muun muassa valtion tukijärjestelmiä, työn kehittyvää luonnetta, TSA:n epäjohdonmukaisuutta sääntöjen soveltamisessa ja yksityiskohtia TSA:n sallimista tai kieltämistä tavaroista."
    ],
    "points": 104,
    "commentCount": 115,
    "retryCount": 0,
    "time": 1695482745
  }
]
