[
  {
    "id": 37626273,
    "title": "iCloud Drive içeriğinizi sessizce siler",
    "originLink": "https://www.dominikmayer.com/2023/09/icloud-drive-silently-deletes-your-content/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37626273",
    "commentBody": "",
    "originSummary": [
      "Makale, iCloud Drive'ın dosya çakışmaları nedeniyle kullanıcı içeriğini sessizce sildiği bir sorunu ele alıyor.",
      "Yazar, önemli dosyaların kaybedilmesiyle ilgili kişisel deneyimlerinden yola çıkıyor ve kullanıcılara sorun giderilene kadar önemli verileri iCloud Drive'dan taşımalarını öneriyor.",
      "Önerilen bir hafifletme stratejisi, dosyalardaki değişiklikleri izlemeye ve veri kaybını önlemeye yardımcı olan bir sürüm kontrol sistemi olan Git deposunun kurulmasıdır."
    ],
    "commentSummary": [
      "Kullanıcılar iCloud Drive ile ilgili endişelerini dile getiriyor, yersiz içerik silme ve olası güvenlik açıkları gibi sorunları bildiriyorlar.",
      "Uzaktan destek için Apple'ın Switch Control özelliğini kullanmanın etkinliği, Apple'ın yazılımıyla ilgili sorunlar, git depolarıyla veri senkronizasyonu sorunları ve uçtan uca şifreleme ve çakışma yönetimi mekanizmaları açısından eksiklikler konusunda bir tartışma var.",
      "Kullanıcıların veri senkronizasyonu ve depolaması için syncthing gibi alternatifler önermesi, iCloud Drive'a yönelik genel bir memnuniyetsizliği ve güven eksikliğini yansıtıyor ve veri güvenilirliği ve güvenliğinin önemini pekiştiriyor."
    ],
    "points": 314,
    "commentCount": 233,
    "retryCount": 0,
    "time": 1695495423
  },
  {
    "id": 37623562,
    "title": "Çok geç olmadan Visual Studio Code gömülü ters kabuğu engelleme",
    "originLink": "https://ipfyx.fr/post/visual-studio-code-tunnel/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37623562",
    "commentBody": "",
    "originSummary": [
      "Makale, Microsoft'un Visual Studio Code'undaki ters kabuk özelliği ile ilişkili güvenlik risklerini tartışmaktadır.",
      "Bu riskleri en aza indirmek için alan adı engelleme ve beyaz listeye alma teknolojisinin kullanılmasını tavsiye ediyor, ancak Applocker'ın kuralının uygulanamayabileceğini ve karma koşulların olası bir gereklilik haline gelebileceğini belirtiyor.",
      "Visual Studio Code'un şu anda bu özellik için dahili denetimlere sahip olmadığını vurguluyor ve gelişmiş güvenlik önlemlerini savunuyor."
    ],
    "commentSummary": [
      "Ana konu, popüler bir metin editörü ve Entegre Geliştirme Ortamı (IDE) olan Visual Studio Code'daki gömülü ters kabuk özelliğinin güvenlik açıklarıdır.",
      "Bu özelliğin yaratabileceği risklere ilişkin farklı bakış açıları mevcut olup, bazı katılımcılar potansiyel yetkisiz erişim ve veri hırsızlığına ilişkin endişelerini dile getirmiştir.",
      "Tartışma ayrıca metin editörleri ve IDE'lerdeki daha geniş güvenlik konularını da kapsamakta, güvenlik önlemlerinin etkinliğinin ve ihlallerden kaçınmanın öneminin altını çizmektedir."
    ],
    "points": 295,
    "commentCount": 80,
    "retryCount": 0,
    "time": 1695479395
  },
  {
    "id": 37626731,
    "title": "Bottlerocket - Doğrulanmış önyükleme ile minimal, değişmez Linux işletim sistemi",
    "originLink": "https://bottlerocket.dev",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37626731",
    "commentBody": "",
    "originSummary": [
      "Bottlerocket, Kubernetes gibi konteyner orkestratörleri için ideal olan konteynerleri barındırmak için özel olarak tasarlanmış Linux tabanlı bir işletim sistemidir.",
      "İşletim sistemi, minimum ek yük, güvenli güncellemeler ve derlenmiş dillerin kullanımı, değişmez bir kök dosya sistemi ve zorunlu SELinux politikaları dahil olmak üzere güvenlik özelliklerine belirgin bir şekilde odaklanma ile karakterize edilir.",
      "Farklı ortamlara uygun çeşitli özelleştirilmiş varyantlar sunar ve ayrıcalıklı ana bilgisayar kapsayıcıları aracılığıyla yönetilebilir. Güncellemeler imajlar aracılığıyla iletilir ve gerektiğinde geri alınabilir."
    ],
    "commentSummary": [
      "Bottlerocket, AWS tarafından geliştirilen, CoreOS ve Flatcar Linux ile benzerlikler taşıyan, konteynerleri çalıştırmak için özel olarak tasarlanmış Linux tabanlı bir işletim sistemidir.",
      "Bottlerocket'in benzersiz özellikleri arasında güvenlik açığı taraması ve güncellemeler için bir A/B bölümleme şeması bulunmaktadır, ancak şu anda bağımsız bir ürün haline gelmek için belirgin bir yolu yoktur ve FIPS desteğini dahil etmede zorluklar yaşamaktadır.",
      "Bottlerocket ile ilgili tartışmalar, AWS dışında dağıtımı, AWS ortamındaki uyumluluğu, ana makine kabuğunun olmaması, güvenlik özellikleri ve NixOS ile karşılaştırılması konusundaki belirsizlikleri de vurgulamaktadır."
    ],
    "points": 287,
    "commentCount": 53,
    "retryCount": 0,
    "time": 1695498296
  },
  {
    "id": 37628337,
    "title": "SpamChannel: 2M alan adından gelen e-postaları taklit etmek ve neredeyse Şeytan olmak [pdf]",
    "originLink": "https://media.defcon.org/DEF%20CON%2031/DEF%20CON%2031%20presentations/byt3bl33d3r%20-%20SpamChannel%20Spoofing%20Emails%20From%202%20Million%20Domains%20and%20Virtually%20Becoming%20Satan.pdf",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37628337",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Söylem, fark edilmeyen bir teknik kullanarak iki milyon alan adından gelen e-postaları taklit eden ve böylece geleneksel e-posta kimlik doğrulama yöntemlerinin etkinliği hakkında soru işaretleri yaratan bir bilgisayar korsanına odaklanıyor.",
      "DKIM ve DMARC'a olan güvenin artırılmasını tavsiye eden rapor, e-posta güvenliğindeki açıkların altını çizerek alan adı doğrulamasında standardizasyon ihtiyacını tartışıyor.",
      "Spam filtrelemenin geliştirilmesinde ARC teknolojisinin potansiyel faydaları ve sorunları da tartışılmakta ve spam ile mücadele için geliştirilmiş stratejilere duyulan ihtiyaç pekiştirilmektedir."
    ],
    "points": 286,
    "commentCount": 89,
    "retryCount": 0,
    "time": 1695509612
  },
  {
    "id": 37624070,
    "title": "Mikrodalgaya plastik koymayın",
    "originLink": "https://www.bonappetit.com/story/can-you-put-plastic-in-the-microwave",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37624070",
    "commentBody": "",
    "originSummary": [
      "Nebraska-Lincoln Üniversitesi'nde yapılan bir araştırma, plastik kapların mikrodalgada pişirilmesinin mikroplastik ve nanoplastiklerin gıdalara karışmasına yol açarak endokrin sistemlerini bozabileceğini ve sağlık riskleri oluşturabileceğini ortaya koydu.",
      "Plastik kapların üzerindeki \"mikrodalgaya uygun\" etiketi plastiğin sadece ısıya dayanıklılığını gösterir, güvenliğini değil. Bu tür kaplar yine de bisfenoller ve ftalatlar dahil olmak üzere zararlı partiküller salabilir.",
      "Birinci ve altıncı tip plastikler mikrodalgada pişirildiğinde daha yüksek sağlık riskleri oluştururken, ikinci ve beşinci tipler daha güvenli kabul edilmektedir. Uzmanlar, yiyecekleri mikrodalgada pişirmek için plastik yerine cam kapların kullanılmasını önermektedir."
    ],
    "commentSummary": [
      "Tartışma esas olarak mikrodalgalarda plastik kap kullanımının güvenlik endişeleri etrafında dönmekte ve cam kaplar gibi alternatifleri araştırmaktadır.",
      "Bu yazı, plastik kullanımı ile kanser oranlarındaki artış arasındaki potansiyel bağlantıyı ve mikroplastiklerin sağlık üzerindeki etkilerini araştırmaktadır.",
      "Ayrıca, mikrodalga fırında pişirmenin pratikliğini ve verimliliğini değerlendirirken, plastik kullanımının sağlık risklerini ve faydalarını tartıyor."
    ],
    "points": 273,
    "commentCount": 313,
    "retryCount": 0,
    "time": 1695482501
  },
  {
    "id": 37627745,
    "title": "AB, AMD'nin pazara erişimini engellediği için Intel'e 400 milyon dolar ceza verdi",
    "originLink": "https://www.neowin.net/news/eu-fines-intel-400-million-for-blocking-amds-market-access-through-payments-to-pc-makers/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37627745",
    "commentBody": "",
    "originSummary": [
      "Avrupa Komisyonu, 2002-2007 yılları arasında PC üreticilerine ödeme yaparak AMD'nin pazara girişini engellediği gerekçesiyle Intel'e 400 milyon dolar para cezası verdi.",
      "Intel'in PC üreticilerine AMD işlemcileri kullanan ürünleri geciktirmeleri veya kısıtlamaları için rüşvet verdiği ve x86 CPU pazarındaki rekabeti olumsuz etkilediği belirlendi.",
      "Intel 2009 yılında hakimiyeti kötüye kullanmaktan 1.13 milyar dolar para cezasına çarptırılmış olsa da, Komisyon'un davanın indirim bileşeninin reddini temyize götürmesi nedeniyle hala potansiyel ek para cezalarıyla karşı karşıya."
    ],
    "commentSummary": [
      "Avrupa Birliği, AMD'nin pazara erişimini engellediği gerekçesiyle Intel'e 400 milyon dolar ceza verdi ve teknoloji endüstrisindeki rekabete aykırı uygulamalarla ilgili bir tartışmayı tetikledi.",
      "Bu tür davranışların AMD'nin büyümesi üzerindeki etkisi, pazar manipülasyonu iddiaları ve Intel'e kıyasla AMD dizüstü bilgisayarların bulunabilirliği ve seçeneklerinin azlığı konusunda devam eden tartışmalar var.",
      "Söylemde ayrıca Intel'in son 15 yıldaki durgun hisse senedi performansı, maliyetin altında ürün satmanın olası yansımaları ve AMD'den daha iyi destek çağrısı ve Tayvan'ın jeopolitik muamelesine ilişkin endişeler de yer alıyor."
    ],
    "points": 260,
    "commentCount": 110,
    "retryCount": 0,
    "time": 1695504623
  },
  {
    "id": 37629874,
    "title": "Rust'ta Windows sürücüsü geliştirmeyi sağlayan platform",
    "originLink": "https://github.com/microsoft/windows-drivers-rs",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37629874",
    "commentBody": "",
    "originSummary": [
      "\"windows-drivers-rs\", hem WDM (Windows Sürücü Modeli) hem de WDF (Windows Sürücü Çerçevesi) modellerini destekleyen Windows sürücülerinin geliştirilmesini sağlayan Rust tabanlı bir depodur.",
      "Depo, bağlayıcılar, kitaplıklar ve makrolar dahil olmak üzere Windows Geliştirme Kiti (WDK) ile bağlantıları köprüleyen birkaç sandık sunar.",
      "Hala erken geliştirme aşamalarında olan \"windows-drivers-rs\" WDM, KMDF (Kernel-Mode Driver Framework) ve UMDF (User-Mode Driver Framework) sürücüleri için konfigürasyonları destekler ve gelecekte daha fazla konfigürasyon ekleme niyetindedir. Ancak, şu anda ticari kullanım için önerilmemektedir."
    ],
    "commentSummary": [
      "Microsoft, Windows sürücü geliştirme için Rust kullanımını teşvik eden ve hem Windows hem de Linux sistemleri için Rust ile sürücü yazmanın zorluklarını ve faydalarını vurgulayan bir platform oluşturdu.",
      "Tartışma, aygıt sürücüsü geliştirmede C# gibi bellek yönetimli bir dili tercih etmenin avantajlarına işaret etmekte ve bu argümanı yazılım performansının önemiyle birleştirmektedir.",
      "Söylem ayrıca Rust'ın çekirdek geliştirmedeki avantajlarını, çöp toplamanın sürücü geliştirmedeki rolünü araştırmakta ve mikro çekirdek yaklaşımının ve Midori projesinin potansiyelini ana hatlarıyla ortaya koymaktadır."
    ],
    "points": 232,
    "commentCount": 91,
    "retryCount": 0,
    "time": 1695525570
  },
  {
    "id": 37623955,
    "title": "Karaborsacılar neden bilet alabiliyor?",
    "originLink": "https://www.404media.co/why-scalpers-can-get-olivia-rodrigo-tickets-and-fans-cannot/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37623955",
    "commentBody": "",
    "originSummary": [
      "Ticketmaster'ın başlangıçta karaborsayı engellemek için tasarladığı \"Doğrulanmış Taraftar\" sistemi, karaborsacılar tarafından kendi çıkarları doğrultusunda manipüle ediliyor.",
      "Dolandırıcılar, popüler konserlere bilet bulma şanslarını artırmak için birden fazla hesap, özel internet tarayıcıları ve toplu satın alınan telefon numaraları kullanmaktadır.",
      "Biletleri resmi olarak satışa çıkmadan önce bile satabiliyor ve daha önce satılanların yerine daha iyi biletler koyabiliyorlar, bu da sistemin ortalama taraftarlardan ziyade profesyonel bilet alıcılarını desteklediğini gösteriyor."
    ],
    "commentSummary": [
      "Konuşma, bilet karaborsacılığı sorununa odaklanıyor, bunun arkasındaki çeşitli motivasyonları araştırıyor ve potansiyel çözümler öneriyor.",
      "Katılımcılar, biletlerin alıcı isimleri ve kimlik doğrulaması ile ilişkilendirilmesi, dinamik fiyatlandırma ve piyangolar gibi çeşitli stratejileri değerlendirmekte ve Ticketmaster gibi biletleme platformlarında önemli yenilikler yapılmasını savunmaktadır.",
      "Diyalog, bilet endüstrisinin yapısal sorunlarını ele alırken, hem taraftarlar hem de sanatçılar üzerindeki etkinin altını çizerek, daha iyi bir düzenlemeye duyulan ihtiyacın altını çiziyor."
    ],
    "points": 226,
    "commentCount": 389,
    "retryCount": 0,
    "time": 1695481822
  },
  {
    "id": 37628525,
    "title": "IPFS desteği curl ile birleştirildi",
    "originLink": "https://twitter.com/bmann/status/1705572964068930010",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37628525",
    "commentBody": "",
    "originSummary": [
      "Merkezi olmayan dosya depolama ve paylaşımı için tasarlanmış bir protokol olan IPFS (InterPlanetary File System) artık curl yazılımına dahil edilmiştir.",
      "Bu entegrasyon, IPFS ve içerik adresleme teknolojisinin web altyapısındaki sürekliliğini ve kalıcı önemini göstermektedir.",
      "Çeşitli ağ protokolleri üzerinden veri aktarımı için yaygın olarak kullanılan bir araç olan curl, merkezi olmayan, içerik tabanlı adresleme modelini destekleyerek IPFS'nin erişimini ve kullanım alanını genişletecek."
    ],
    "commentSummary": [
      "Curl sistemine IPFS (InterPlanetary File System) desteği eklemiştir, ancak bu uygulamanın gerçek IPFS desteği mi yoksa sadece yeniden yazılmış URL'ler mi olduğu konusunda tartışmalar devam etmektedir.",
      "Mevcut uygulama, çıktının IPFS adresiyle eşleşip eşleşmediğini çapraz kontrol etmek için bir doğrulama özelliğinden yoksundur; IPFS ağ geçitleri aracılığıyla sürekli doğrulama bir geliştirme olarak önerilmektedir.",
      "IPFS'yi benimsemenin içerdiği potansiyel riskler ve kullanıcıların neden genellikle IPFS düğümlerini çalıştırmak yerine IPFS ağ geçitlerini kullanmayı tercih ettiklerinin yanı sıra curl aracına magnet ve .onion URL'leri için destek eklemeyi düşündükleri hakkında tartışmalar var."
    ],
    "points": 220,
    "commentCount": 62,
    "retryCount": 0,
    "time": 1695510879
  },
  {
    "id": 37624201,
    "title": "Yabancılarla konuşmanın hayati sanatı (2021)",
    "originLink": "https://www.economist.com/books-and-arts/2021/07/10/the-vital-art-of-talking-to-strangers",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37624201",
    "commentBody": "",
    "originSummary": [
      "Makale, üç kitapta ayrıntılı olarak ele alınan yabancılarla etkileşimin önemini ve olası zorluklarını inceliyor.",
      "Yabancılara yönelik tutumların çocukluktaki temkinlilikten ergenlik ve erken yetişkinlik dönemindeki etkileşim özlemine doğru evrimine odaklanmaktadır.",
      "Yabancılarla etkileşime girmenin yarattığı heyecan ve kaçış olasılığı, makalenin temel vurgularından biridir."
    ],
    "commentSummary": [
      "Yorumlar bölümü, kentsel ve kırsal samimiyeti karşılaştırarak, farklı bölgelerdeki yabancılarla etkileşime yönelik tutumları tartışmaktadır.",
      "Ele alınan konular arasında sosyal kaygının üstesinden gelmek, uçak sohbetlerinin garipliği, beklenmedik karşılaşmaların faydaları ve sohbet başlatmak için tavsiyeler yer alıyor.",
      "Tartışma, olumlu etkileşimlerin öneminin altını çizmekte ve yabancılarla iletişim kurarken tercih ve önceliklerdeki bireysel farklılıkları vurgulamaktadır."
    ],
    "points": 178,
    "commentCount": 148,
    "retryCount": 0,
    "time": 1695483299
  },
  {
    "id": 37623479,
    "title": "Casus yazılımlar internette gördüğünüz reklamlar aracılığıyla telefonunuza veya bilgisayarınıza bulaşabilir - rapor",
    "originLink": "https://theconversation.com/spyware-can-infect-your-phone-or-computer-via-the-ads-you-see-online-report-213685",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37623479",
    "commentBody": "",
    "originSummary": [
      "İsrailli teknoloji şirketi Insanet, çevrimiçi reklam ağları aracılığıyla dağıtılan ve belirli reklamları Truva atlarına dönüştüren Sherlock adlı bir casus yazılım yarattı.",
      "Telefon açıklarından yararlanan geleneksel casus yazılımların aksine Sherlock, kendisini gizlice yüklemek için reklam ağlarını kullanır ve hedefin cihaz içeriğine erişim sağlar.",
      "Bilgisayarlara ve Android telefonların yanı sıra iPhone'lara da bulaşabilen Sherlock'un daha önce tespit edilen Pegasus casus yazılımıyla benzerlik taşıdığından şüpheleniliyor ve böylece sivil gözetim ve potansiyel kötüye kullanımla ilgili endişeleri artırıyor."
    ],
    "commentSummary": [
      "Makale, özellikle \"Sherlock\" olmak üzere, potansiyel olarak tarayıcı veya işletim sistemi açıkları yoluyla cihazlara bulaşmak için çevrimiçi reklamlardan yararlanan casus yazılım sorununu tartışıyor.",
      "Reklam teknolojisinde bir değişiklik yapılması ve Sellff Offers adı verilen yeni bir modelin tanıtılması savunulmaktadır. JavaScript'in devre dışı bırakılması ve reklam engelleyicilerin kullanılması gibi savunma önlemleri önerilmektedir.",
      "Tartışmada etik sonuçlar, içerik oluşturucuların desteklenmesi ve alternatif para kazanma yöntemleri ele alınıyor ve yazar, reklam teknolojisi kullanmak yerine içerik oluşturuculara doğrudan destek vermeyi tercih ettiğini belirtiyor."
    ],
    "points": 168,
    "commentCount": 114,
    "retryCount": 0,
    "time": 1695478912
  },
  {
    "id": 37623405,
    "title": "Hindistan Ay sondası ile yeniden iletişim kurmayı başaramadı",
    "originLink": "https://efe.com/en/science-and-technology/2023-09-22/india-fails-to-re-establish-communication-with-its-moon-probe/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37623405",
    "commentBody": "",
    "originSummary": [
      "Hindistan Uzay Araştırmaları Örgütü (ISRO), Ay sondası Vikram lander ve Pragyan rover ile iletişimi yeniden kurmayı başaramayarak, bu araçların çalışmaya devam etmesi yönündeki umutları fiilen sona erdirdi.",
      "Vikram iniş aracı ve Pragyan keşif aracı Ay'ın güney kutbuna gönderilerek, araçların Ay'ın aşırı sıcaklıklarına karşı dayanıklılığı konusundaki şüphelere rağmen ISRO'yu dünya çapında iniş başarısı elde eden dördüncü kuruluş haline getirdi.",
      "Söz konusu Ay araçlarıyla yeniden temas kurma çabaları devam edecek ve ISRO'nun uzay araştırmalarında karşılaşılan zorlukların üstesinden gelme konusundaki ısrarlı iradesine işaret edecektir."
    ],
    "commentSummary": [
      "Hindistan'ın bir Ay sondasıyla yeniden iletişim kurma çabası başarısız oldu, ancak görev hala başarılı sayılıyor.",
      "Tartışma, mühendislik zorluklarını ve Ay'daki aşırı soğuk sıcaklıkların araç ve ekipman performansını etkileyen etkilerini vurgulamaktadır.",
      "Uzay araştırmalarında kullanılan önemli bir teknoloji olan radyoizotop termoelektrik jeneratörler, bu tür olumsuz koşulların üstesinden gelme bağlamında ele alınmaktadır."
    ],
    "points": 166,
    "commentCount": 72,
    "retryCount": 0,
    "time": 1695478533
  },
  {
    "id": 37624400,
    "title": "1990'ların LambdaMOO sunucusunu yeniden yazdım.",
    "originLink": "https://github.com/rdaum/moor",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37624400",
    "commentBody": "",
    "originSummary": [
      "Kişi, 90'lı yılların başından beri çok kullanıcılı bir sanal ortam ve programlama sistemi olan LambdaMOO'nun kullanımı ve geliştirilmesiyle ilgilenmektedir.",
      "LambdaMOO'yu çağdaş teknolojilerin avantajlarından yararlanacak ve uyumluluğunu artıracak şekilde elden geçirme görevini üstlendiler.",
      "Neredeyse tamamlanan uygulama şu anda Rust (modern bir sistem programlama dili) ile yazılıyor ve bu tür bir sanal sosyal ortamdan etkilenen bireylerin desteğini teşvik ediyorlar."
    ],
    "commentSummary": [
      "Tartışmanın ana konusu, sosyal etkileşim ve paylaşılan programlamaya odaklanan sanal sosyal alan sistemini geliştirmek için Rust programlama dilini kullanarak LambdaMOO sunucusunu yeniden yaratan bir kişi hakkındadır.",
      "Bu projeyi üstlenen kişi, özellikle sistemin geriye dönük uyumluluğuyla ilgili zorluklar konusunda yardım ve geri bildirim arıyor.",
      "Katılımcılar MOO motorları, alternatif programlama dilleri ve mevcut LambdaMOO örneklerini koruma mücadeleleri hakkında sohbet ediyor, heyecanlarını dile getiriyor ve ilgili LambdaMOO kaynaklarını paylaşıyorlar."
    ],
    "points": 163,
    "commentCount": 53,
    "retryCount": 0,
    "time": 1695484608
  },
  {
    "id": 37630914,
    "title": "Google, Gmail'in Temel HTML Görünümünü 2024'ün başlarında kaldırıyor",
    "originLink": "https://support.google.com/mail/answer/15049?hl=en",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37630914",
    "commentBody": "",
    "originSummary": [
      "Gmail kullanıcıları Ocak 2024'e kadar Temel HTML görünümünü kullanabilecek ve bu tarihten sonra platform otomatik olarak Standart görünüme geçecek.",
      "Kullanıcılar Standart görünümün yüklenmesiyle ilgili sorunlarla karşılaşırlarsa tarayıcılarında, internet bağlantılarında veya cihazlarında sorun giderebilirler.",
      "Temel HTML görünümü, Standart görünümde bulunan bazı özelliklerden yoksundur ve kullanıcıların sorunlar devam ederse Gmail uygulamasına veya farklı bir e-posta istemcisine geçmeleri önerilir."
    ],
    "commentSummary": [
      "Google'ın Gmail'in Temel HTML Görünümünü durduracağını açıklaması, webmail'in geleceği, mesajlaşma uygulamalarına karşı e-posta güvenilirliği ve Google'ın bir reklam şirketi olarak rolü üzerine tartışmalara yol açtı.",
      "Tartışmalar, alternatif e-posta hizmetleri için önerileri, yoğun JavaScript kullanımı ve ardından gelen yavaş yükleme süreleriyle ilgili endişeleri ve düşük bant genişliği senaryolarına uyum sağlama vurgusunu kapsamaktadır.",
      "Ayrıca, veri sınırlı ortamlar, işletmelerin çeşitli müşteri gereksinimlerini karşılama zorunluluğu ve yolcu gemilerindeki tekeller ve uç durumlarda erişilebilirlik gibi çeşitli konulara da değinilmiştir."
    ],
    "points": 142,
    "commentCount": 135,
    "retryCount": 0,
    "time": 1695540701
  },
  {
    "id": 37624506,
    "title": "Sıçandan sümüklü böceğe, oradan da insan beynine sıçrayan solucan Güneydoğu ABD'yi istila etti",
    "originLink": "https://arstechnica.com/health/2023/09/worm-that-jumps-from-rats-to-slugs-to-human-brains-has-invaded-southeast-us/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37624506",
    "commentBody": "",
    "originSummary": [
      "Emerging Infectious Diseases dergisinde yayınlanan çalışma, insan beynini enfekte edebilen bir parazit olan sıçan akciğer kurdunun Güneydoğu ABD'de görüldüğünü doğruluyor.",
      "Atlanta hayvanat bahçesinde test edilen 33 sıçandan yedisinde parazitin kanıtları tespit edilmiştir. Sıçan akciğer kurdu tipik olarak sıçanlarda yaşar, sümüklü böceklere veya salyangozlara geçer ve yutulması halinde insanlara bulaşarak ciddi nörolojik işlev bozukluğuna ve hatta ölüme neden olabilir.",
      "Çalışma, parazitin bölgede hızla yayıldığına işaret ediyor."
    ],
    "commentSummary": [
      "ABD'nin güneydoğusunda yaygın olan Angiostrongylus cantonensis adlı bir solucan sıçanlara, sümüklü böceklere ve hatta insanlara bulaşarak potansiyel olarak baş ağrısı, uykusuzluk ve ciddi vakalarda menenjit gibi semptomlara yol açmaktadır.",
      "Solucandan kaynaklanan enfeksiyon, az pişmiş salyangozların veya enfekte sümüklü böceklerin tüketilmesiyle bulaşabilir, bu da bireylerin olası enfeksiyonu önlemek için sebzeleri iyice yıkamasını ve hazırlamasını gerektirir.",
      "Yeşilliklerdeki salyangoz ve parazitlerin varlığı, hastalıkların bu kirli kaynaklar yoluyla bulaşması ve yerel konut piyasaları üzerindeki potansiyel etkileri konusunda artan endişeler var."
    ],
    "points": 137,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1695485314
  },
  {
    "id": 37627129,
    "title": "Cambridge Hukuk Külliyatı: Yasal yapay zeka araştırmaları için bir derlem",
    "originLink": "https://arxiv.org/abs/2309.12269",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37627129",
    "commentBody": "",
    "originSummary": [
      "Hukuki yapay zeka araştırmaları için 16. yüzyıldan günümüze kadar uzanan 250.000'den fazla Birleşik Krallık mahkeme davasından oluşan yeni bir veri seti olan Cambridge Law Corpus tanıtıldı.",
      "Derlem, ham metin ve meta verilerin yanı sıra 638 vakanın vaka sonuçlarına ilişkin ek açıklamaları da içeriyor ve makale, ek açıklamalı verileri kullanarak vaka sonucu çıkarma modellerini eğitme ve test etme sürecini gösteriyor.",
      "GPT-3, GPT-4 ve RoBERTa gibi modeller için karşılaştırmalı performans ölçütleri sağlanırken, külliyatın erişilebilirliği etik hususlar nedeniyle araştırmalarla sınırlıdır."
    ],
    "commentSummary": [
      "Kapsamlı bir hukuki metin koleksiyonu olan Cambridge Law Corpus, özellikle hukuki Yapay Zeka (AI) araştırmaları için oluşturulmuştur.",
      "Harvard Hukuk Kütüphanesi İnovasyon Laboratuvarı, ödeme duvarları nedeniyle zor olan ABD içtihatlarının tamamına erişim sağlayan İçtihat Erişim Projesi'ni kurdu.",
      "Laboratuvar ayrıca Yapay Zeka ve Makine Öğrenimi (ML) projeleri için Collaborative Open Legal Dataset'i (COLD cases) yayınlama sürecindedir, ancak Cambridge Law Corpus'a erişim şu anda tanınmış kurumlardan araştırmacılarla sınırlıdır."
    ],
    "points": 127,
    "commentCount": 33,
    "retryCount": 0,
    "time": 1695500573
  },
  {
    "id": 37623314,
    "title": "CRISPR ipekböcekleri kısıtlamalara meydan okuyan örümcek ipeği yapıyor",
    "originLink": "https://www.genengnews.com/topics/genome-editing/crispr-silkworms-make-spider-silk-that-defies-scientific-constraints/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37623314",
    "commentBody": "",
    "originSummary": [
      "Araştırmacılar, CRISPR teknolojisi aracılığıyla ipekböceklerini başarılı bir şekilde manipüle ederek ilk tam uzunlukta örümcek ipeğini üretti ve sağlam hafif malzemelerin sürdürülebilir üretiminin önünü açtı.",
      "Üretilen örümcek ipeği Kevlar'dan altı kat daha güçlüdür ve yüksek gerilme mukavemetine sahiptir, diğer doğal ve sentetik liflerin çoğundan daha iyi performans göstererek naylon ve Kevlar gibi sentetik liflere daha çevreci bir alternatif oluşturur.",
      "Elde edilen başarı, örümcek ipeğinin ticarileştirilmesi için potansiyel taşıyor ve çeşitli uygulamalar için sürdürülebilir bir seçenek sunarken 'süper malzemelerin' geliştirilmesini de ilerletiyor."
    ],
    "commentSummary": [
      "Bilim insanları CRISPR gen düzenleme teknolojisini kullanarak geleneksel ipekböceği ipeğinden %160 daha güçlü bir malzeme olan örümcek ipeği üreten ipekböcekleri tasarladı.",
      "Bu ilerleme, uzay asansörleri için daha sağlam malzemeler üretmek veya hidrojen depolamak için tanklar dokumak gibi çeşitli alanlarda kullanılabilir.",
      "Bununla birlikte, örümcek ipeğinin uygulanması, doğasında bulunmaması nedeniyle yüksek sertlik gerektiren senaryolarda kısıtlanabilir."
    ],
    "points": 122,
    "commentCount": 39,
    "retryCount": 0,
    "time": 1695477809
  },
  {
    "id": 37625283,
    "title": "Kişisel ilişkiler için bir \"CRM\"",
    "originLink": "https://www.elim.app/eng/home",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37625283",
    "commentBody": "",
    "originSummary": [
      "Yalnızlıkla mücadele etmeyi ve kişisel ilişkilere öncelik vermeyi amaçlayan yeni bir uygulama olan \"The New Elim\" başlatıldı.",
      "Uygulama, kullanıcıların hayatlarındaki önemli kişileri tanımlamalarına ve onlarla bağlantı kurmalarına olanak tanıma, bağlantıda kalmak için günlük hatırlatıcılar ve farklı tasarımlara sahip sanal kartpostallar gönderme gibi özellikler sunuyor.",
      "Şu anda ilk aşamasında olan \"The New Elim\" geliştiricileri, gelecekteki geliştirmelere rehberlik etmek için kullanıcı geri bildirimi arıyor."
    ],
    "commentSummary": [
      "Elim.app, bildirimler ve dijital kartpostallar gibi özelliklerle bireylerin temel ilişkilerine odaklanmalarına yardımcı olmak için tasarlanan bir MVP (Minimum Viable Product) yayınladı.",
      "Kullanıcılar, manuel kişi girişi ve mesajlaşma uygulamalarıyla entegrasyon gibi geliştirmeler önerdiler. Geliştiriciler reklam göstermeme ya da kullanıcıların verilerini satmama niyetinde olduklarını gösterdiler, ancak premium bir abonelik modeli düşünüyorlar.",
      "Uygulamanın web sitesinin Almanca olmasıyla ilgili endişeler dile getirilmiş, bu da uygulamanın potansiyeli ve iyileştirmelerinin yanı sıra sosyal meseleleri ele almak için teknolojiye aşırı derecede yaslanmanın sınırlamaları hakkında tartışmalara yol açmıştır."
    ],
    "points": 113,
    "commentCount": 83,
    "retryCount": 0,
    "time": 1695489677
  },
  {
    "id": 37625291,
    "title": "Bayan Agatha Christie'nin Tuhaf Kayboluşu (2022)",
    "originLink": "https://blog.nationalarchives.gov.uk/20speople-investigating-the-strange-disappearance-of-mrs-agatha-christie/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37625291",
    "commentBody": "",
    "originSummary": [
      "Bu yazı, ünlü polisiye roman yazarı Agatha Christie'nin 1926 yılında esrarengiz bir şekilde ortadan kayboluşunu, bunu takip eden polis soruşturmasını ve kamuoyunun davayla ilgili merakını inceliyor.",
      "Makale, kayboluşuyla ilgili farklı teori ve varsayımların yanı sıra polisin müdahalesi ve arama maliyetiyle ilgili eleştirileri de ele alıyor.",
      "Yazar, o dönemde medyada yer alan bazı yanlışlıklara dikkat çekiyor."
    ],
    "commentSummary": [
      "İlk makale, Agatha Christie'nin açıklanamayan ortadan kayboluşunu çevreleyen teorileri inceliyor ve bunun reklam amaçlı olma ihtimali de dahil olmak üzere tarihsel bir bağlam sunuyor.",
      "İkinci parça Sherlock Holmes hikayelerinde bulunan tutarsızlıkları araştırıyor ve Arthur Conan Doyle'un inançlarını inceliyor.",
      "Üçüncü ve dördüncü tartışmalar simya, din ve ünlü yazarların eserlerine değinerek; Agatha Christie'nin kayboluşunda polisin rolünü tartışarak ve en çok satan kitapları ve yazarları sayarak geniş bir yelpazeye yayılıyor."
    ],
    "points": 107,
    "commentCount": 81,
    "retryCount": 0,
    "time": 1695489716
  },
  {
    "id": 37624112,
    "title": "Işıklı Kılıçlara İlişkin TSA Politikası",
    "originLink": "https://www.tsa.gov/travel/security-screening/whatcanibring/items/light-saber",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37624112",
    "commentBody": "",
    "originSummary": [
      "Ulaştırma Güvenlik İdaresi (TSA), yolcuların oyuncak ışın kılıçlarını hem el bagajlarında hem de kontrol edilen çantalarda taşımalarına izin vermektedir.",
      "Bir eşyanın güvenlikten geçip geçemeyeceğine ilişkin nihai karar TSA görevlisinin elindedir.",
      "Bu bilgiler, ABD İç Güvenlik Bakanlığı'nın bir parçası olan TSA'nın resmi internet sitesinde kamuya açık olarak sunulmaktadır."
    ],
    "commentSummary": [
      "Tartışmaların ana teması, havaalanlarında TSA tarafından uygulanan güvenlik prosedürlerinin etkinliği ve rolü etrafında şekilleniyor.",
      "Bazı katılımcıların bu uygulamaların verimliliğini sorguladığı, bazılarının ise önemini savunduğu farklı bakış açıları mevcuttur.",
      "Görüşmede ayrıca devlet destek programları, işin değişen doğası, TSA'nın kuralları uygulamadaki tutarsızlıkları ve TSA tarafından izin verilen veya yasaklanan belirli eşyalara ilişkin ayrıntılar gibi konular da ele alınıyor."
    ],
    "points": 104,
    "commentCount": 115,
    "retryCount": 0,
    "time": 1695482745
  }
]
