[
  {
    "id": 37626273,
    "title": "iCloud Drive молча удаляет содержимое",
    "originLink": "https://www.dominikmayer.com/2023/09/icloud-drive-silently-deletes-your-content/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37626273",
    "commentBody": "",
    "originSummary": [
      "В статье рассматривается проблема с iCloud Drive, когда он спокойно удаляет содержимое пользователя из-за конфликтов файлов.",
      "Автор опирается на личный опыт потери важных файлов и рекомендует пользователям перенести важные данные из iCloud Drive до устранения проблемы.",
      "Предлагаемая стратегия снижения рисков заключается в создании репозитория Git - системы контроля версий, которая позволяет отслеживать изменения в файлах и предотвращать потерю данных."
    ],
    "commentSummary": [
      "Пользователи высказывают опасения по поводу iCloud Drive, сообщая о таких проблемах, как необоснованное удаление контента и возможные уязвимости в системе безопасности.",
      "Ведутся споры об эффективности использования функции Switch Control компании Apple для удаленной поддержки, о проблемах с программным обеспечением Apple, о проблемах синхронизации данных с git-репозиториями, о недостатках сквозного шифрования и механизмов управления конфликтами.",
      "Пользователи предлагают такие альтернативы, как syncthing, для синхронизации и хранения данных, что отражает общую неудовлетворенность и дефицит доверия к iCloud Drive, а также подчеркивает важность надежности и безопасности данных."
    ],
    "points": 314,
    "commentCount": 233,
    "retryCount": 0,
    "time": 1695495423
  },
  {
    "id": 37623562,
    "title": "Блокирование встроенной обратной оболочки Visual Studio Code до того, как станет слишком поздно",
    "originLink": "https://ipfyx.fr/post/visual-studio-code-tunnel/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37623562",
    "commentBody": "",
    "originSummary": [
      "В статье рассматриваются риски безопасности, связанные с функцией обратной оболочки в Microsoft Visual Studio Code.",
      "Для минимизации этих рисков он рекомендует использовать технологии блокировки и \"белого списка\" доменов, хотя и отмечает, что правило Applocker может быть неприменимо, что делает хэш-условия возможной необходимостью.",
      "В нем подчеркивается, что в настоящее время Visual Studio Code не имеет встроенных средств управления этой функцией, и высказывается мнение о необходимости усиления мер безопасности."
    ],
    "commentSummary": [
      "Основная тема - уязвимости в безопасности встроенной функции reverse shell в Visual Studio Code, популярном текстовом редакторе и интегрированной среде разработки (IDE).",
      "Риски, которые может нести эта функция, оцениваются по-разному: некоторые участники высказывают опасения по поводу возможного несанкционированного доступа и кражи данных.",
      "Кроме того, обсуждаются более широкие вопросы безопасности текстовых редакторов и IDE, подчеркивается эффективность мер защиты и важность предотвращения нарушений."
    ],
    "points": 295,
    "commentCount": 80,
    "retryCount": 0,
    "time": 1695479395
  },
  {
    "id": 37626731,
    "title": "Bottlerocket - минимальная, неизменяемая ОС Linux с верифицированной загрузкой",
    "originLink": "https://bottlerocket.dev",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37626731",
    "commentBody": "",
    "originSummary": [
      "Bottlerocket - это операционная система на базе Linux, специально разработанная для размещения контейнеров и идеально подходящая для таких контейнерных оркестров, как Kubernetes.",
      "ОС характеризуется минимальными накладными расходами, безопасными обновлениями и ярко выраженной направленностью на обеспечение безопасности, включая использование компилируемых языков, неизменяемую корневую файловую систему и принудительное применение политик SELinux.",
      "Он предлагает различные варианты, подходящие для различных сред, и может управляться через контейнеры привилегированных хостов. Обновления поставляются в виде образов и при необходимости могут быть отменены."
    ],
    "commentSummary": [
      "Bottlerocket - это операционная система на базе Linux, разработанная AWS специально для запуска контейнеров и имеющая сходство с CoreOS и Flatcar Linux.",
      "Уникальными особенностями Bottlerocket являются сканирование уязвимостей и схема A/B-разделов для обновлений, однако в настоящее время он не имеет четкого пути к превращению в самостоятельный продукт и испытывает трудности с включением поддержки FIPS.",
      "В дискуссиях вокруг Bottlerocket также отмечается неопределенность в отношении его развертывания за пределами AWS, совместимости в среде AWS, отсутствия оболочки хост-машины, средств безопасности и сравнения с NixOS."
    ],
    "points": 287,
    "commentCount": 53,
    "retryCount": 0,
    "time": 1695498296
  },
  {
    "id": 37628337,
    "title": "SpamChannel: Подмена писем с 2 млн доменов и превращение в Сатану [pdf]",
    "originLink": "https://media.defcon.org/DEF%20CON%2031/DEF%20CON%2031%20presentations/byt3bl33d3r%20-%20SpamChannel%20Spoofing%20Emails%20From%202%20Million%20Domains%20and%20Virtually%20Becoming%20Satan.pdf",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37628337",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "В центре внимания - хакер, подделавший с помощью незаметной техники электронные письма с двух миллионов доменов и поставивший тем самым под сомнение эффективность традиционных методов аутентификации электронной почты.",
      "В нем рекомендуется все больше полагаться на DKIM и DMARC и обсуждается необходимость стандартизации проверки доменов, подчеркиваются уязвимые места в защите электронной почты.",
      "Также обсуждаются потенциальные преимущества и проблемы использования технологии ARC для усиления фильтрации спама, что усиливает необходимость совершенствования стратегий борьбы со спамом."
    ],
    "points": 286,
    "commentCount": 89,
    "retryCount": 0,
    "time": 1695509612
  },
  {
    "id": 37624070,
    "title": "Не помещайте пластик в микроволновую печь",
    "originLink": "https://www.bonappetit.com/story/can-you-put-plastic-in-the-microwave",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37624070",
    "commentBody": "",
    "originSummary": [
      "Исследование Университета Небраски-Линкольна показало, что при микроволновой обработке пластиковых контейнеров в пищу попадают микропластики и нанопластики, которые могут нарушать работу эндокринной системы и представлять опасность для здоровья.",
      "Надпись \"безопасно для микроволновой печи\" на пластиковых контейнерах указывает лишь на термостойкость пластика, но не на его безопасность. Такие контейнеры все равно могут выделять вредные частицы, включая бисфенолы и фталаты.",
      "Пластмассы первого и шестого типов представляют повышенный риск для здоровья при микроволновой обработке, в то время как пластмассы второго и пятого типов считаются более безопасными. Эксперты рекомендуют использовать для приготовления пищи в микроволновой печи не пластик, а стеклянную тару."
    ],
    "commentSummary": [
      "В основном обсуждение ведется вокруг проблем безопасности использования пластиковых контейнеров в микроволновых печах, а также рассматриваются альтернативные варианты, например, стеклянные контейнеры.",
      "В этой заметке исследуется потенциальная связь между использованием пластмасс, ростом заболеваемости раком и влиянием микропластика на здоровье.",
      "В нем также оценивается практичность и эффективность приготовления пищи в микроволновой печи, взвешиваются риски для здоровья и преимущества использования пластика."
    ],
    "points": 273,
    "commentCount": 313,
    "retryCount": 0,
    "time": 1695482501
  },
  {
    "id": 37627745,
    "title": "ЕС оштрафовал Intel на 400 млн. долл. за блокирование доступа AMD на рынок",
    "originLink": "https://www.neowin.net/news/eu-fines-intel-400-million-for-blocking-amds-market-access-through-payments-to-pc-makers/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37627745",
    "commentBody": "",
    "originSummary": [
      "Европейская комиссия наложила штраф в размере 400 млн. долл. на компанию Intel за препятствование выходу AMD на рынок путем выплат производителям ПК в период с 2002 по 2007 год.",
      "Было установлено, что Intel подкупала производителей ПК, заставляя их откладывать или ограничивать выпуск продукции с процессорами AMD, что негативно сказывалось на конкуренции на рынке процессоров x86.",
      "Хотя в 2009 году Intel была оштрафована на 1,13 млрд. долл. за злоупотребление доминирующим положением, ей все еще грозят дополнительные штрафы, поскольку Комиссия подала апелляцию на отказ в рассмотрении дела о скидках."
    ],
    "commentSummary": [
      "Европейский союз наложил штраф в размере 400 млн. долл. на компанию Intel за ограничение доступа AMD на рынок, что вызвало дискуссию об антиконкурентной практике в технологической отрасли.",
      "Продолжаются споры о влиянии такого поведения на рост компании AMD, обвинения в манипулировании рынком, а также о недостаточной доступности ноутбуков AMD и их опциях по сравнению с Intel.",
      "Далее в дискуссию включаются рассуждения о стагнации акций Intel за последние 15 лет, о возможных последствиях продажи продукции ниже себестоимости, а также призывы к улучшению поддержки со стороны AMD и опасения по поводу геополитической ситуации на Тайване."
    ],
    "points": 260,
    "commentCount": 110,
    "retryCount": 0,
    "time": 1695504623
  },
  {
    "id": 37629874,
    "title": "Платформа, позволяющая разрабатывать драйверы Windows на языке Rust",
    "originLink": "https://github.com/microsoft/windows-drivers-rs",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37629874",
    "commentBody": "",
    "originSummary": [
      "\"windows-drivers-rs\" - это основанный на Rust репозиторий, позволяющий разрабатывать драйверы Windows, поддерживающий модели WDM (Windows Driver Model) и WDF (Windows Driver Framework).",
      "В репозитории представлено несколько крейтов, обеспечивающих связь с Windows Development Kit (WDK), включая связки, библиотеки и макросы.",
      "Находясь на ранних стадиях разработки, \"windows-drivers-rs\" поддерживает конфигурации для драйверов WDM, KMDF (Kernel-Mode Driver Framework) и UMDF (User-Mode Driver Framework), и в будущем планируется включить больше конфигураций. Однако в настоящее время он не рекомендуется для коммерческого использования."
    ],
    "commentSummary": [
      "Компания Microsoft создала платформу, пропагандирующую использование Rust для разработки драйверов для Windows, подчеркивая проблемы и преимущества, связанные с написанием драйверов на Rust для систем Windows и Linux.",
      "В дискуссии приводятся аргументы в пользу использования при разработке драйверов устройств языка C#, управляемого памятью, и подкрепляется аргументация значимостью производительности программного обеспечения.",
      "Также рассматриваются преимущества Rust при разработке ядра, роль сборки мусора при разработке драйверов, описывается потенциал микроядерного подхода и проекта Midori."
    ],
    "points": 232,
    "commentCount": 91,
    "retryCount": 0,
    "time": 1695525570
  },
  {
    "id": 37623955,
    "title": "Почему скальперы могут получить билеты",
    "originLink": "https://www.404media.co/why-scalpers-can-get-olivia-rodrigo-tickets-and-fans-cannot/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37623955",
    "commentBody": "",
    "originSummary": [
      "Система \"Verified Fan\" компании Ticketmaster, изначально созданная для борьбы с скальпингом, используется скальперами в своих интересах.",
      "Мошенники используют несколько учетных записей, специализированные интернет-браузеры и массово приобретаемые телефонные номера, чтобы увеличить шансы на получение билетов на популярные концерты.",
      "Они могут продавать билеты еще до их официального поступления в продажу и заменять проданные ранее билеты более выгодными, что свидетельствует о том, что система благоприятствует профессиональным покупателям билетов, а не рядовым болельщикам."
    ],
    "commentSummary": [
      "В центре беседы - проблема билетного скальпинга, изучение различных мотивов его возникновения и предложение возможных решений.",
      "Участники рассматривают различные стратегии, такие как привязка билетов к имени покупателя и проверка его личности, динамическое ценообразование и лотереи, выступая за существенные инновации в платформах по продаже билетов, таких как Ticketmaster.",
      "Диалог подчеркивает необходимость усиления регулирования и решения структурных проблем индустрии продажи билетов, подчеркивая их влияние как на поклонников, так и на артистов."
    ],
    "points": 226,
    "commentCount": 389,
    "retryCount": 0,
    "time": 1695481822
  },
  {
    "id": 37628525,
    "title": "Поддержка IPFS была включена в curl",
    "originLink": "https://twitter.com/bmann/status/1705572964068930010",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37628525",
    "commentBody": "",
    "originSummary": [
      "Протокол IPFS (InterPlanetary File System), предназначенный для децентрализованного хранения и обмена файлами, теперь включен в состав программы curl.",
      "Эта интеграция свидетельствует о преемственности и непреходящем значении IPFS и технологии адресации контента в веб-инфраструктуре.",
      "curl, широко используемый инструмент для передачи данных по различным сетевым протоколам, позволит расширить сферу применения IPFS за счет поддержки децентрализованной модели адресации на основе контента."
    ],
    "commentSummary": [
      "Curl добавил в свою систему поддержку IPFS (InterPlanetary File System), хотя до сих пор ведутся споры о том, является ли эта реализация настоящей поддержкой IPFS или это просто переписанные URL.",
      "В текущей реализации отсутствует функция проверки соответствия выходных данных IPFS-адресу; в качестве дополнения предлагается непрерывная проверка через IPFS-шлюзы.",
      "Обсуждаются потенциальные риски, связанные с переходом на IPFS, и причины, по которым пользователи обычно предпочитают использовать шлюзы IPFS, а не запускать узлы IPFS, а также рассматривается возможность добавления поддержки URL-адресов magnet и .onion в инструмент curl."
    ],
    "points": 220,
    "commentCount": 62,
    "retryCount": 0,
    "time": 1695510879
  },
  {
    "id": 37624201,
    "title": "Жизненно важное искусство общения с незнакомыми людьми (2021)",
    "originLink": "https://www.economist.com/books-and-arts/2021/07/10/the-vital-art-of-talking-to-strangers",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37624201",
    "commentBody": "",
    "originSummary": [
      "В статье рассматриваются значимость и возможные трудности взаимодействия с незнакомыми людьми, о чем подробно рассказывается в трех книгах.",
      "В центре внимания - эволюция отношения к незнакомым людям, которая проходит путь от осторожности в детстве до стремления к взаимодействию в подростковом и раннем взрослом возрасте.",
      "Острые ощущения и возможность эскапизма, возникающие при общении с незнакомыми людьми, являются ключевым акцентом статьи."
    ],
    "commentSummary": [
      "В разделе комментариев рассматривается отношение к общению с незнакомыми людьми в разных регионах, сравнивается дружелюбие в городе и деревне.",
      "Рассматриваются такие темы, как преодоление социальной тревоги, неловкость при разговоре в самолете, преимущества непредвиденных встреч и советы по завязыванию разговоров.",
      "В ходе дискуссии подчеркивается значимость позитивных взаимодействий и выявляются индивидуальные различия в предпочтениях и приоритетах при общении с незнакомыми людьми."
    ],
    "points": 178,
    "commentCount": 148,
    "retryCount": 0,
    "time": 1695483299
  },
  {
    "id": 37623479,
    "title": "Шпионские программы могут заразить ваш телефон или компьютер через рекламу, которую вы видите в Интернете - отчет",
    "originLink": "https://theconversation.com/spyware-can-infect-your-phone-or-computer-via-the-ads-you-see-online-report-213685",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37623479",
    "commentBody": "",
    "originSummary": [
      "Израильская технологическая компания Insanet создала программу-шпион под названием Sherlock, которая распространяется через рекламные сети в Интернете, превращая конкретные объявления в троянских коней.",
      "В отличие от традиционных программ-шпионов, использующих уязвимости телефонов, Sherlock использует рекламные сети для скрытой установки, позволяющей получить доступ к содержимому устройства пользователя.",
      "Sherlock может заражать компьютеры и телефоны на базе Android, а также iPhone. Предполагается, что он имеет сходство с ранее выявленной шпионской программой Pegasus, что вызывает опасения по поводу слежки за гражданскими лицами и возможного нецелевого использования."
    ],
    "commentSummary": [
      "В статье рассматривается проблема шпионского ПО, в частности \"Шерлока\", использующего рекламу в Интернете для заражения устройств, в том числе через уязвимости в браузере или операционной системе.",
      "Предлагается изменить рекламные технологии, внедрив новую модель Sellff Offers. Рекомендуются такие защитные меры, как отключение JavaScript и использование блокировщиков рекламы.",
      "В ходе дискуссии обсуждаются этические аспекты, поддержка создателей контента и альтернативные методы монетизации, причем автор высказался за прямую поддержку создателей контента, а не за использование рекламных технологий."
    ],
    "points": 168,
    "commentCount": 114,
    "retryCount": 0,
    "time": 1695478912
  },
  {
    "id": 37623405,
    "title": "Индии не удается восстановить связь с лунным зондом",
    "originLink": "https://efe.com/en/science-and-technology/2023-09-22/india-fails-to-re-establish-communication-with-its-moon-probe/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37623405",
    "commentBody": "",
    "originSummary": [
      "Индийская организация космических исследований (ISRO) не смогла восстановить связь с лунным зондом \"Викрам\" и марсоходом \"Прагьян\", что фактически лишило надежды на их дальнейшую работу.",
      "На южный полюс Луны были отправлены посадочный аппарат Vikram и ровер Pragyan. Таким образом, ISRO стала четвертой организацией в мире, добившейся успешной посадки, несмотря на сомнения в устойчивости аппаратов к экстремальным лунным температурам.",
      "Усилия по восстановлению связи с указанными лунными аппаратами будут продолжены, что свидетельствует об упорном стремлении ISRO к преодолению трудностей, возникающих при освоении космоса."
    ],
    "commentSummary": [
      "Попытки Индии восстановить связь с лунным зондом оказались безуспешными, однако миссия по-прежнему считается успешной.",
      "Обсуждаются инженерные проблемы и влияние экстремально низких температур на Луне, сказывающееся на работе транспортных средств и оборудования.",
      "В контексте преодоления таких враждебных условий упоминаются радиоизотопные термоэлектрические генераторы - важнейшая технология, используемая при освоении космоса."
    ],
    "points": 166,
    "commentCount": 72,
    "retryCount": 0,
    "time": 1695478533
  },
  {
    "id": 37624400,
    "title": "Я переписал сервер LambdaMOO 1990-х годов.",
    "originLink": "https://github.com/rdaum/moor",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37624400",
    "commentBody": "",
    "originSummary": [
      "Человек занимается использованием и совершенствованием многопользовательской виртуальной среды и системы программирования LambdaMOO с начала 90-х годов.",
      "Они взялись за модернизацию LambdaMOO с целью использования преимуществ современных технологий и повышения ее совместимости.",
      "Реализация, практически завершенная, написана на Rust (современный язык системного программирования), и они надеются на поддержку со стороны людей, увлеченных подобной виртуальной социальной средой."
    ],
    "commentSummary": [
      "Основная тема обсуждения - человек, воссоздавший сервер LambdaMOO с помощью языка программирования Rust для улучшения системы виртуального социального пространства, ориентированного на социальное взаимодействие и совместное программирование.",
      "Человек, взявшийся за этот проект, просит помощи и обратной связи, особенно в части проблем с обратной совместимостью системы.",
      "Участники обсуждают движки MOO, альтернативные языки программирования, проблемы сохранения существующих экземпляров LambdaMOO, выражают энтузиазм и делятся соответствующими ресурсами LambdaMOO."
    ],
    "points": 163,
    "commentCount": 53,
    "retryCount": 0,
    "time": 1695484608
  },
  {
    "id": 37630914,
    "title": "Google ликвидирует базовый HTML-вид Gmail в начале 2024 года",
    "originLink": "https://support.google.com/mail/answer/15049?hl=en",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37630914",
    "commentBody": "",
    "originSummary": [
      "Пользователи Gmail смогут использовать представление Basic HTML до января 2024 года, после чего платформа автоматически перейдет на представление Standard.",
      "Если у пользователей возникают проблемы с загрузкой стандартного представления, они могут устранить неполадки в браузере, подключении к Интернету или на устройстве.",
      "В представлении Basic HTML отсутствуют некоторые функции, доступные в представлении Standard, и пользователям рекомендуется перейти на приложение Gmail или другой почтовый клиент, если проблемы сохраняются."
    ],
    "commentSummary": [
      "Компания Google объявила о прекращении использования функции Basic HTML View в Gmail, что вызвало дискуссии о будущем веб-почты, надежности электронной почты в сравнении с приложениями для обмена сообщениями и роли Google как рекламного бизнеса.",
      "Обсуждались рекомендации по использованию альтернативных почтовых сервисов, опасения по поводу интенсивного использования JavaScript и последующего медленного времени загрузки, а также акцент на возможности работы в условиях низкой пропускной способности.",
      "Также упоминаются проблемы, связанные с ограничением объема данных, обязанностью предприятий удовлетворять различные требования клиентов, а также различные темы, такие как монополия на круизные суда и доступность в крайних случаях."
    ],
    "points": 142,
    "commentCount": 135,
    "retryCount": 0,
    "time": 1695540701
  },
  {
    "id": 37624506,
    "title": "Червь, перепрыгивающий с крыс на слизней и в человеческий мозг, захватил юго-восток США",
    "originLink": "https://arstechnica.com/health/2023/09/worm-that-jumps-from-rats-to-slugs-to-human-brains-has-invaded-southeast-us/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37624506",
    "commentBody": "",
    "originSummary": [
      "Исследование, опубликованное в журнале Emerging Infectious Diseases, подтверждает факт появления крысиного легочного червя - паразита, способного поражать мозг человека, - на юго-востоке США.",
      "Признаки паразита были обнаружены у семи из 33 крыс, протестированных в зоопарке Атланты. Крысиный легочный червь обычно живет в крысах, переходит в слизней или улиток и при попадании в организм человека может заразить его, вызывая тяжелые неврологические нарушения и даже смерть.",
      "Исследование свидетельствует о быстром распространении паразита в регионе."
    ],
    "commentSummary": [
      "Червь Angiostrongylus cantonensis, распространенный на юго-востоке США, заражает крыс, слизней и даже людей, что может привести к таким симптомам, как головная боль, бессонница, а в тяжелых случаях - к менингиту.",
      "Заразиться этим червем можно при употреблении в пищу недоваренных улиток или зараженных слизней, что побуждает людей тщательно мыть и готовить овощи, чтобы избежать возможного заражения.",
      "Растут опасения по поводу наличия улиток и паразитов в зелени, передачи заболеваний через эти загрязненные ресурсы и потенциального влияния на местные рынки жилья."
    ],
    "points": 137,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1695485314
  },
  {
    "id": 37627129,
    "title": "Кембриджский юридический корпус: Корпус для исследования правового ИИ",
    "originLink": "https://arxiv.org/abs/2309.12269",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37627129",
    "commentBody": "",
    "originSummary": [
      "Представлен Кембриджский юридический корпус (Cambridge Law Corpus) - новый набор данных для исследований в области правового искусственного интеллекта, включающий более 250 тыс. судебных дел Великобритании, начиная с XVI века и до наших дней.",
      "Помимо исходного текста и метаданных, корпус содержит аннотации к исходам дел по 638 делам, и в статье показан процесс обучения и тестирования моделей извлечения исходов дел с использованием аннотированных данных.",
      "Несмотря на то, что приводятся сравнительные характеристики производительности таких моделей, как GPT-3, GPT-4 и RoBERTa, доступность корпуса ограничена для исследований по этическим соображениям."
    ],
    "commentSummary": [
      "Кембриджский юридический корпус (Cambridge Law Corpus), представляющий собой обширную коллекцию юридических текстов, был создан специально для исследований в области искусственного интеллекта (ИИ).",
      "Библиотечная инновационная лаборатория Гарвардского университета создала проект Caselaw Access Project, позволяющий получить доступ к полному набору американских судебных решений, что ранее было затруднительно из-за платных стен.",
      "Лаборатория также находится в процессе выпуска Collaborative Open Legal Dataset (COLD cases) для проектов ИИ и машинного обучения (ML), однако доступ к Cambridge Law Corpus в настоящее время ограничен исследователями из признанных институтов."
    ],
    "points": 127,
    "commentCount": 33,
    "retryCount": 0,
    "time": 1695500573
  },
  {
    "id": 37623314,
    "title": "CRISPR-шелкопряды создают паутинный шелк, не поддающийся ограничениям",
    "originLink": "https://www.genengnews.com/topics/genome-editing/crispr-silkworms-make-spider-silk-that-defies-scientific-constraints/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37623314",
    "commentBody": "",
    "originSummary": [
      "Исследователи успешно манипулировали шелкопрядом с помощью технологии CRISPR для получения первого полноразмерного паучьего шелка, что открывает путь к устойчивому производству прочных легких материалов.",
      "Созданный паутинный шелк более чем в шесть раз прочнее кевлара и обладает высокой прочностью на разрыв, превосходя большинство других натуральных и синтетических волокон, что делает его более экологичной альтернативой синтетическим волокнам, таким как нейлон и кевлар.",
      "Это достижение открывает перспективы для коммерциализации паучьего шелка, предлагая устойчивый вариант для различных применений и способствуя развитию \"суперматериалов\"."
    ],
    "commentSummary": [
      "Ученые использовали технологию редактирования генов CRISPR для создания шелкопряда, который дает паутинный шелк - материал, на 160% превосходящий по прочности традиционный шелк тутового шелкопряда.",
      "Это достижение может быть использовано в различных областях, например, в производстве более прочных материалов для космических лифтов или в изготовлении резервуаров для хранения водорода.",
      "Однако применение паучьего шелка может быть ограничено в сценариях, требующих высокой жесткости, из-за присущего ему ее недостатка."
    ],
    "points": 122,
    "commentCount": 39,
    "retryCount": 0,
    "time": 1695477809
  },
  {
    "id": 37625283,
    "title": "CRM для личных отношений",
    "originLink": "https://www.elim.app/eng/home",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37625283",
    "commentBody": "",
    "originSummary": [
      "Запущено новое приложение \"Новый Элим\", направленное на борьбу с одиночеством и приоритет личных отношений.",
      "Приложение предлагает такие функции, как идентификация и связь со значимыми людьми в своей жизни, ежедневные напоминания о необходимости оставаться на связи, а также отправка виртуальных открыток с различным дизайном.",
      "В настоящее время \"Новый Элим\" находится на начальной стадии разработки, и разработчики стремятся получить отзывы пользователей, чтобы использовать их в дальнейших усовершенствованиях."
    ],
    "commentSummary": [
      "Компания Elim.app выпустила MVP (минимальный жизнеспособный продукт), который призван помочь людям сосредоточиться на важных взаимоотношениях с помощью таких функций, как уведомления и цифровые открытки.",
      "Пользователи предложили такие усовершенствования, как включение ручного ввода контактов и интеграция с приложениями для обмена сообщениями. Разработчики заявили о намерении не показывать рекламу и не продавать данные пользователей, но рассматривают возможность создания модели премиум-подписки.",
      "Высказывались опасения, что сайт приложения выполнен на немецком языке, что привело к дискуссии о возможностях и улучшениях приложения, а также об ограничениях, связанных с чрезмерной опорой на технологии в решении социальных проблем."
    ],
    "points": 113,
    "commentCount": 83,
    "retryCount": 0,
    "time": 1695489677
  },
  {
    "id": 37625291,
    "title": "Странное исчезновение миссис Агаты Кристи (2022)",
    "originLink": "https://blog.nationalarchives.gov.uk/20speople-investigating-the-strange-disappearance-of-mrs-agatha-christie/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37625291",
    "commentBody": "",
    "originSummary": [
      "В этой заметке мы рассмотрим загадочное исчезновение известной писательницы Агаты Кристи в 1926 году, последующее полицейское расследование и интригу в обществе, связанную с этим делом.",
      "В статье рассматриваются различные теории и предположения относительно ее исчезновения, а также критические замечания по поводу реакции полиции и стоимости поисков.",
      "Автор указывает на некоторые неточности в освещении событий в СМИ в этот период."
    ],
    "commentSummary": [
      "В первой статье рассматриваются теории, связанные с необъяснимым исчезновением Агаты Кристи, в том числе возможность того, что это было сделано в рекламных целях, приводится исторический контекст.",
      "Во втором материале рассматриваются несоответствия, встречающиеся в рассказах о Шерлоке Холмсе, и изучаются убеждения Артура Конан Дойла.",
      "Третья и четвертая дискуссии имеют широкий диапазон: они затрагивают вопросы алхимии, религии, творчества известных писателей, обсуждают роль полиции в исчезновении Агаты Кристи, подсчитывают книги-бестселлеры и авторов."
    ],
    "points": 107,
    "commentCount": 81,
    "retryCount": 0,
    "time": 1695489716
  },
  {
    "id": 37624112,
    "title": "Политика TSA в отношении световых сабель",
    "originLink": "https://www.tsa.gov/travel/security-screening/whatcanibring/items/light-saber",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37624112",
    "commentBody": "",
    "originSummary": [
      "Управление транспортной безопасности (TSA) разрешает пассажирам провозить игрушечные световые мечи как в ручной клади, так и в зарегистрированных сумках.",
      "Окончательное решение о том, может ли тот или иной предмет пройти через досмотр, принимает сотрудник TSA.",
      "Эта информация находится в открытом доступе на официальном сайте TSA, входящего в состав Министерства внутренней безопасности США."
    ],
    "commentSummary": [
      "Центральная тема дискуссий - эффективность и роль процедур безопасности, применяемых TSA в аэропортах.",
      "Существуют разные точки зрения: одни участники сомневаются в эффективности этих практик, другие отстаивают их значимость.",
      "Кроме того, в беседе затрагиваются такие темы, как схемы государственной поддержки, меняющийся характер работы, непоследовательность TSA в применении правил, а также подробности о конкретных предметах, разрешенных или запрещенных TSA."
    ],
    "points": 104,
    "commentCount": 115,
    "retryCount": 0,
    "time": 1695482745
  }
]
