[
  {
    "id": 39865810,
    "title": "Kriittinen takaovi löydetty xz/liblzma-ohjelmassa uhkaamassa SSH-palvelimia",
    "originLink": "https://www.openwall.com/lists/oss-security/2024/03/29/4",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39865810",
    "commentBody": "",
    "originSummary": [
      "Openwall-projekti tarjoaa ilmaisia ja avoimen lähdekoodin tuotteita palvelinten tietoturvaan, kuten Linux-käyttöjärjestelmä, salasanamurto- ja salasanahakkerityökalut.",
      "xz/liblzma-paketista löydettiin takaovi, joka vaikuttaa glibc-pohjaisten x86-64-Linux-järjestelmien SSH-palvelimiin ja aiheuttaa luvattoman pääsyn tai etäkoodin suorittamisen riskin.",
      "Hyökkäyskoodi kohdistuu tiettyihin kirjastoihin, mikä saa Debianin ja Red Hatin kaltaiset jakelijat puuttumaan ongelmaan; haavoittuvat järjestelmät on päivitettävä kiireellisesti."
    ],
    "commentSummary": [
      "Takaportti xz/liblzma-ohjelmassa johti SSH-palvelimien vaarantamiseen, mikä johti tilien sulkemiseen ja tekijän avaimen poistamiseen arkistoista, mikä herätti keskustelua koodin monimutkaisuudesta ja valtion toimijoiden mahdollisesta osallisuudesta avoimen lähdekoodin hankkeisiin.",
      "Huoli XZ-tiedostomuodon tietoturvasta yritysten Linux-jakeluissa, joista puuttuvat välittömät päivitykset, ja korostetaan monitekijätodennuksen tärkeyttä YubiKeysin kaltaisilla menetelmillä ja TOTP-palautussalasanojen tallentamista hätätilanteita varten.",
      "Keskusteluja kaksitekijätodennuksen tehokkuudesta, MFA:n rajoituksista, salasanojen ja tunnisteiden tallentamisen riskeistä samassa laitteessa, keskusteluja Passkeys-toteutuksesta, laitteistoavaimista todentamista varten ja koodauskäytäntöjen avoimuudesta sekä yhteisön kehotus valppauteen ja nopeaan tietoturva-aukkojen käsittelyyn."
    ],
    "points": 3513,
    "commentCount": 1252,
    "retryCount": 0,
    "time": 1711729010
  },
  {
    "id": 39864412,
    "title": "Filantrooppi luo \"Euroopan Yellowstonen\" Romaniaan",
    "originLink": "https://english.elpais.com/international/2024-03-29/philanthropist-group-buys-up-large-tracts-of-land-in-romania-to-create-european-yellowstone.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39864412",
    "commentBody": "",
    "originSummary": [
      "Hansjörg Wyssin filantrooppiryhmä on hankkimassa Romaniasta laajoja maa-alueita, jotta Karpaattien vuoristoon voitaisiin perustaa \"eurooppalainen Yellowstone\", jonka tavoitteena on suojella luontoa, lisätä ekomatkailua ja parantaa alueen taloutta.",
      "Säätiö on ostanut 27 027 hehtaaria, ja sen tavoitteena on 200 000 hehtaarin suojelualue, mutta se on kohdannut asukkaiden ja metsästysryhmien vastustusta ja kamppailuja kansallispuiston perustamisesta.",
      "Ponnisteluihin kuuluu metsänistutusta, luonnonvaraisen eläimistön suojelua ja yhteisön osallistumista esteiden poistamiseksi ja elinkelpoisen suojelukehyksen luomiseksi."
    ],
    "commentSummary": [
      "Keskusteluissa keskitytään eurooppalaisen Yellowstonen kansallispuiston perustamiseen Romaniaan biisonien palauttamiseksi, ja niissä korostetaan villieläinten käyttäytymistä, ihmisen läsnäoloa luonnollisissa elinympäristöissä, matkailua, luonnonsuojelua, Romanian taloudellisia vaikeuksia ja kapitalismin vaikutuksia luonnonvaroihin.",
      "Korostaa luonnonvaraisen eläimistön kanssa rinnakkaiselon, vastuullisen toiminnan ja luonnon säilyttämisen keskeisiä teemoja."
    ],
    "points": 268,
    "commentCount": 216,
    "retryCount": 0,
    "time": 1711721936
  },
  {
    "id": 39867160,
    "title": "Huippuosaajat saattavat irtisanoutua, jos uusille työntekijöille maksetaan enemmän.",
    "originLink": "https://hbr.org/2024/03/when-new-hires-get-paid-more-top-performers-resign-first",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39867160",
    "commentBody": "",
    "originSummary": [
      "Palkkojen avoimuus lisääntyy eri toimialoilla, mikä saa nykyiset työntekijät huomaamaan palkkaerot uusiin työntekijöihin nähden.",
      "Tutkimukset osoittavat, että jos nykyisen henkilöstön palkkoja ei mukauteta uusien työntekijöiden palkkaamisen jälkeen, huippuosaajat saattavat irtisanoutua.",
      "Työnantajia kehotetaan suorittamaan johdonmukaisia palkkatasa-arvon arviointeja ja muuttamaan palkkoja viipymättä, jotta estetään mahdollinen kykyjen menettäminen."
    ],
    "commentSummary": [
      "Keskustelussa tuodaan esiin palkkaerojen aiheuttamat haasteet, erityisesti kun uudet työntekijät ansaitsevat enemmän kuin kokeneet työntekijät, mikä johtaa siihen, että huippuosaajat lähtevät ja nykyiset työntekijät tuntevat itsensä aliarvostetuiksi.",
      "Korostetaan palkkojen avoimuuden merkitystä, korkeammista palkoista neuvottelemista ja markkinaolosuhteiden vaikutusta palkkaukseen.",
      "Keskustelussa käsitellään myös työntekijöiden sitouttamisstrategioita, urakehitystä, työvoiman väestörakenteen muutosta, perhesuunnittelua, tiedonsiirtoa, vanhempien taloudellisia vaikeuksia Yhdysvalloissa ja sukupolvien välisten erojen vaikutusta työpaikoilla."
    ],
    "points": 245,
    "commentCount": 196,
    "retryCount": 0,
    "time": 1711735674
  },
  {
    "id": 39868630,
    "title": "Santa Barbaran digitaalisen historian säilyttäminen konkurssiuhan keskellä",
    "originLink": "https://www.independent.com/2024/03/29/santa-barbaras-collective-memory-sold-for-kindling/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39868630",
    "commentBody": "",
    "originSummary": [
      "Santa Barbara News-Press, historiallinen sanomalehti, on ilmoittanut konkurssista, jolloin sen digitaalinen arkisto on vaarassa joutua myyntiin ulkomaiselle yritykselle, jolla on ollut tapana muuttaa hyvämaineisia verkkosivuja \"takalinkkifarmeiksi\" hakukoneoptimointia varten.",
      "Tämä epäeettinen hakukoneoptimointikäytäntö sisältää maksullisen sisällön lisäämisen hakukoneiden sijoitusten manipuloimiseksi, mikä saattaa vaarantaa yhteisön tietueiden historiallisen tarkkuuden.",
      "Kansalaisia kehotetaan osallistumaan arkistosta järjestettäviin tarjouskilpailuihin, jotta sen sisältö voidaan turvata ja estää sen osallistuminen hyväksikäyttöön tähtäävään verkkotoimintaan."
    ],
    "commentSummary": [
      "Deadspin myytiin verkkopelien affiliate-alan sijoittajille, mikä aiheutti riskejä yhteisön historialle.",
      "Työntekijät perustivat Defector-nimisen osuustoimintaryhmän, koska ammattiyhdistysten edustus ja paikalliset uutissivustot Santa Barbarassa olivat haastavia.",
      "Artikkelissa käsitellään yritysten varojen ja velkojen erottamista toisistaan, sisäpiirikauppaa, hintojen vahvistamista ja kulttuuriperinnön säilyttämisen merkitystä arkistojen avulla."
    ],
    "points": 206,
    "commentCount": 42,
    "retryCount": 0,
    "time": 1711743955
  },
  {
    "id": 39867702,
    "title": "Apache Guacamole: Clientless Gateway: Pääsy työasemiin missä tahansa Clientless Gatewayn avulla",
    "originLink": "https://guacamole.apache.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39867702",
    "commentBody": "",
    "originSummary": [
      "Apache Guacamole on asiakaskohtainen etätyöpöytäyhdyskäytävä, joka tukee protokollia, kuten VNC, RDP ja SSH, ja johon pääsee käsiksi etätyöpöydän kautta verkkoselaimella.",
      "Ohjelmisto on Apache-lisenssin alainen avoimen lähdekoodin ohjelmisto, jota kehittäjäyhteisö kehittää jatkuvasti, ja sillä on dokumentoitu sovellusrajapinta, joka mahdollistaa saumattoman integroinnin eri sovelluksiin.",
      "Apache Guacamolelle tarjotaan sekä yhteisön että kaupallisia tukivaihtoehtoja."
    ],
    "commentSummary": [
      "Apache Guacamole on asiakaskohtainen etätyöpöytäyhdyskäytävä, jonka avulla etätyöpöytiä voi käyttää verkkoselaimen kautta. Se on saanut kiitosta toiminnallisuudestaan ja mukautettavuudestaan.",
      "Käyttäjät ovat raportoineet ongelmista, kuten viiveestä ja äänenlaadusta Guacamolea käytettäessä, mutta he ovat kertoneet myönteisistä kokemuksista koulutuksessa ja työpaikoilla.",
      "Vaihtoehtoisista projekteista, kuten BrowserBox, xpra ja KasmWeb, on keskusteltu, ja jotkut käyttäjät etsivät Java-riippumattomia ratkaisuja, mikä osoittaa Guacamolen arvon etätyöpöydän käytön kannalta."
    ],
    "points": 193,
    "commentCount": 40,
    "retryCount": 0,
    "time": 1711738790
  },
  {
    "id": 39870402,
    "title": "Iowan lannoitevuoto tuhoaa kaloja 60 mailin pituisella jokiosuudella.",
    "originLink": "https://www.nytimes.com/2024/03/29/us/iowa-spill-fish-kill.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39870402",
    "commentBody": "",
    "originSummary": [
      "Iowassa tapahtunut lannoitevuoto johti lähes 800 000 kalan kuolemaan Iowan ja Missourin joissa, koska nestemäinen typpilannoite vuoti avoimesta venttiilistä.",
      "Tämä tapaus, joka on yksi Iowan suurimmista kalakuolemista, voi viedä vuosia, ennen kuin ekosysteemi palautuu täysin, mikä korostaa veden jatkuvaa saastumista.",
      "Vuoto korostaa vaikeuksia tiukempien säännösten täytäntöönpanossa maatalousvaltioissa ja valottaa vesien pilaantumisen jatkuvia haasteita."
    ],
    "commentSummary": [
      "Iowassa tapahtunut lannoitevuoto tuhosi suurimman osan kaloista 60 meripeninkulman pituisella jokiosuudella, ja ammoniakki oli tärkein haitallinen ainesosa, joka vaikutti vesieliöstöön.",
      "Tapaus korostaa maatalouskäytäntöihin liittyviä ympäristöhaittoja ja on herättänyt keskustelua ankarampien rangaistusten määräämisestä tällaisten katastrofien aiheuttajille.",
      "Joissakin keskusteluissa siirrytään rinnastamaan ympäristövahingot ja ohjelmistojen turvallisuuteen liittyvät huolenaiheet toisiinsa ja korostetaan, että näiden kysymysten käsittelyyn on puututtava eri tavoin kiireellisesti."
    ],
    "points": 158,
    "commentCount": 20,
    "retryCount": 0,
    "time": 1711757083
  },
  {
    "id": 39868673,
    "title": "XZ:n takaoven paljastaminen: XZX: Yksittäisten rahoittajien riskit",
    "originLink": "https://boehs.org/node/everything-i-know-about-the-xz-backdoor",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39868673",
    "commentBody": "",
    "originSummary": [
      "Xz-ohjelmistosta löydettiin takaovi, ja Jia Tan, epäilyttävä tekijä, oli keskeisessä asemassa tekemässä haitallisia muutoksia koodiin ja siirtämässä vaarallisia versioita arkistoihin.",
      "Kirjoituksessa korostetaan riskejä, joita liittyy siihen, että Jia Tanin kaltaisten yksittäisten tekijöiden varassa on paljon riskiä ilman riittävää tukea, ja se herättää koko toimialan turvallisuusongelmia.",
      "Blogikirjoituksessa käsitellään myös epäilyttäviä LinkedIn-profiileja ja mahdollisia Jia Taniin liittyviä identiteettivarkauksia."
    ],
    "commentSummary": [
      "Mahdollinen takaovi xz-pakkausohjelmistossa herättää huolta siitä, että tiedustelupalvelu ottaa kohteekseen OpenSSH:n.",
      "Epäilyt viittaavat siihen, että ohjelmisto on pyritty vaarantamaan koordinoidusti, mahdollisesti jonkin valtiollisen tahon toimesta, mikä korostaa vankkojen turvatoimien tarvetta.",
      "Postaus korostaa, että on tärkeää, että kriittisillä avoimen lähdekoodin projekteilla on useita ylläpitäjiä, jotta tietoturvariskejä voidaan vähentää tehokkaasti."
    ],
    "points": 152,
    "commentCount": 26,
    "retryCount": 0,
    "time": 1711744237
  },
  {
    "id": 39872686,
    "title": "DDoS-myrskystä selviytyminen yksinkertaisella suunnittelulla ja suorituskykyisillä kehyksillä",
    "originLink": "https://tableplus.com/blog/2024/03/how-we-deal-with-ddos.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39872686",
    "commentBody": "",
    "originSummary": [
      "Blogissa käsitellään DDoS-hyökkäystä yrityksen palvelimelle ja korostetaan yrityksen päätöstä olla puuttumatta tilanteeseen, koska järjestelmä kesti hyökkäyksen.",
      "Niiden kestävyys hyökkäyksen aikana perustuu niiden mutkattomaan, monoliittiseen palvelurakenteeseen ja tehokkaiden kehysten, kuten Golangin ja Rustin, käyttöön.",
      "He korostavat järkevien käyttöönottostrategioiden merkitystä ja suosittelevat binäärikoodien käyttämistä konttien sijaan ja suorituskyvyn parantamista välikerroksia kiertämällä."
    ],
    "commentSummary": [
      "Tableplus.com käsittelee DDoS-hyökkäyksiä, verkkosivustojen haavoittuvuuksia, liikennepiikkejä, sovellusten käyttöönottoa konteissa ja turvatoimia, kuten \"Under Attack\" -tilaa.",
      "Aiheita ovat muun muassa monoliittisten palveluiden rakentaminen Golangilla, suurten pyyntömäärien hallinta ja monoliittinen vs. mikropalveluarkkitehtuurikeskustelu.",
      "Arkkitehtuuristrategioita valittaessa jaetaan mielipiteitä tietoturvan parantamisesta, käyttöönoton yksinkertaistamisesta ja organisaation haasteisiin vastaamisesta."
    ],
    "points": 139,
    "commentCount": 82,
    "retryCount": 0,
    "time": 1711784130
  },
  {
    "id": 39869614,
    "title": "Raspberry Pi:n käyttöiän maksimointi: Juuritiedostojärjestelmän lukukielto: Käyttäminen",
    "originLink": "https://www.dzombak.com/blog/2024/03/Running-a-Raspberry-Pi-with-a-read-only-root-filesystem.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39869614",
    "commentBody": "",
    "originSummary": [
      "Raspberry Pi -tietokoneen käyttäminen vain lukuoikeudellisella päätiedostojärjestelmällä voi pidentää SD-kortin käyttöikää vähentämällä kirjoitusoperaatioita.",
      "Oppaassa on yksityiskohtaiset ohjeet eri vaiheista, kuten tarpeettomien ohjelmistojen poistamisesta, vain lukuoikeuden piiriin kuuluvan tiedostojärjestelmän määrittämisestä, snapin kautta asennettujen ohjelmien hallinnasta, tmpfs:n käyttämisestä RAM-tietojen tallentamiseen ja journaldin käyttämän tilan rajoittamisesta.",
      "Siinä käsitellään myös sellaisten prosessien virheiden käsittelyä, jotka eivät ehkä toimi oikein vain lukuoikeudellisessa tiedostojärjestelmässä, ja tarjotaan kattava lähestymistapa Raspberry Piin suorituskyvyn ja tehokkuuden optimointiin."
    ],
    "commentSummary": [
      "Artikkelissa tarkastellaan Raspberry Pi:n käyttämistä vain lukemiseen perustuvalla juuritiedostojärjestelmällä ja ehdotetaan SquashFS- ja EROFS-tiedostojärjestelmiä.",
      "Käyttäjät jakavat kokemuksiaan erilaisista käyttöjärjestelmistä ja asetuksista vain lukukäyttöön tarkoitetun Pi:n toimintaa varten ja suosittelevat Alpine Linuxin kaltaisia työkaluja.",
      "Suosituksia ovat muun muassa teolliset SD-kortit, luotettavat virtalähteet ja SD-kortin pitkäikäisyysstrategiat tietojen korruptoitumisen välttämiseksi sekä overlayfs-tiedostojärjestelmien, kuten overlayfs ja tmpfs, käyttö kuvatuotannossa."
    ],
    "points": 138,
    "commentCount": 47,
    "retryCount": 0,
    "time": 1711750782
  },
  {
    "id": 39866325,
    "title": "Werons WebRTC Overlay -verkkojen tutkiminen",
    "originLink": "https://github.com/pojntfx/weron",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39866325",
    "commentBody": "",
    "originSummary": [
      "Weron on WebRTC-pohjainen päällekkäisverkko, joka mahdollistaa pääsyn NAT:n takana oleviin solmuihin, suojattujen kotiverkkojen käytön ja sensuurin kiertämisen ja tarjoaa suoraviivaisen API:n vertaisverkkoprotokollia varten.",
      "Käyttäjät voivat asentaa Weronin konttipohjaisilla OCI-kuvilla tai staattisilla binääritiedostoilla, jotka kuvaavat yksityiskohtaisesti signalointipalvelimen käyttöä vertaisten yhdistämiseen, yhteisöjen hallintaan sekä viiveen ja läpäisykyvyn mittaamiseen verkossa.",
      "Tekstissä käsitellään Layer 3- ja Layer 2 -ylikerrosverkkojen luomista Weronin VPN:llä, Layer 2 Ethernet -ylikerrosverkon perustamista ja mukautettujen protokollien luomista wrtcconnilla sekä weronin käytön opastusta, mukaan lukien komentoriviargumentit, ympäristömuuttujat ja lisensointitiedot."
    ],
    "commentSummary": [
      "Keskustelussa keskitytään WebRTC:hen vertaisverkkoviestinnässä ja mainitaan SimplePeerin, GCM:n, MLS:n ja WebTorrentin kaltaiset tekniikat sekä palvelin- ja selaintukeen liittyvät haasteet.",
      "Spekulaatioita herättää se, että Apple ei halua tukea WebTransportin ja WebRTC:n kaltaisia verkkotekniikoita, mahdollisesti edistääkseen sovelluskauppaansa, mikä on herättänyt keskustelua vertaisneuvottelujen yksinkertaistamisesta ja turvallisuuden parantamisesta avoimen lähdekoodin WebRTC-videoneuvotteluratkaisujen avulla.",
      "Kehittäjät punnitsevat STUNin ja WebRTC:n tehokkuutta NAT:n ylittämisessä ja herättävät samalla huolta turvallisuudesta ja käytettävyydestä."
    ],
    "points": 138,
    "commentCount": 35,
    "retryCount": 0,
    "time": 1711731607
  },
  {
    "id": 39866795,
    "title": "Demis Hassabis: Hassabis Hassabis: Googlen tekoälyn johtaminen",
    "originLink": "https://www.bigtechnology.com/p/can-demis-hassabis-save-google",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39866795",
    "commentBody": "",
    "originSummary": [
      "DeepMindin perustaja Demis Hassabis johtaa Googlen tekoälytutkimusta säilyttääkseen kilpailukykynsä alalla.",
      "DeepMindin läpimurrot, kuten AlphaGo ja AlphaFold, ovat vakiinnuttaneet sen tekoälyasiantuntemuksen, mutta kommunikointikuilu OpenAI:n kanssa aiheutti haasteita generatiivisissa malleissa.",
      "Hassabis työskentelee Geminin parissa, joka on kielimalli, joka kilpailee OpenAI:n GPT-mallien kanssa, ja kehittää autonomisia agenttijärjestelmiä, mikä osoittaa, että hän on sitoutunut tutkimukseen enemmän kuin mahdolliseen Googlen toimitusjohtajuuteen."
    ],
    "commentSummary": [
      "Artikkelissa käsitellään haasteita, jotka liittyvät puuhakualgoritmien toteuttamiseen suurissa kielimalleissa Googlessa, ja korostetaan uutuusharjoittelun merkitystä.",
      "Siinä tarkastellaan Googlen johtoasemaa, yleisen tekoälyn (AGI) tavoittelua ja huolta yritysten vaikutusvallasta sekä tekoälyn mahdollisia vaikutuksia eri toimialoihin.",
      "Tekstissä tuodaan esiin myös tekoälyteknologian rajoitukset ja toteutettavuus, Googlen toimitusjohtajan koetut epäonnistumiset ja DeepMindin rooli yrityksessä."
    ],
    "points": 128,
    "commentCount": 117,
    "retryCount": 0,
    "time": 1711733720
  },
  {
    "id": 39869068,
    "title": "xz-utils-taustaoven paljastaminen: Kiireellinen tietoturvaohje",
    "originLink": "https://gist.github.com/thesamesam/223949d5a074ebc3dce9ee78baad9e27",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39869068",
    "commentBody": "",
    "originSummary": [
      "Takaportti löytyi xz-utils-ohjelmasta 29. maaliskuuta 2024, ja se vaikuttaa järjestelmiin, joissa on xz- tai liblzma-ohjelmien versiot 5.6.0 tai 5.6.1. Takaportin laukaisivat etäyhteyden käyttämättömät järjestelmät, jotka ovat yhteydessä julkisiin SSH-portteihin.",
      "Hyödyntämisohjelma käyttää glibc:tä, systemd:tä ja tiettyjä kokoonpanoja kohdistaakseen OpenSSH:n todennusmenettelyt, jolloin todennusprosessit voidaan mahdollisesti ohittaa.",
      "xz-utilsin ylläpitäjät työskentelevät aktiivisesti korjausten parissa ja korostavat, että käyttäjien, joilla on julkisesti saatavilla oleva SSH, on kiireellisesti päivitettävä järjestelmänsä nopeasti."
    ],
    "commentSummary": [
      "xz/liblzma-kirjastosta löytyi takaovi, xz-utils, joka saattaa vaarantaa SSH-palvelimet, kun prosessin nimi vastaa /usr/bin/sshd:tä.",
      "Hyökkääjä sijoitti hyväksikäytön pakkauskirjaston testikansioon, mikä herätti keskustelua avoimen ja suljetun lähdekoodin ohjelmistojen tietoturvakäytännöistä.",
      "Käynnissä olevissa keskusteluissa keskitytään aiempien komitusten vaikutuksiin ja korostetaan jatkuvaa tarvetta valppaaseen ohjelmistokehitykseen ja jakelumenetelmiin tällaisten vaaratilanteiden estämiseksi."
    ],
    "points": 120,
    "commentCount": 24,
    "retryCount": 0,
    "time": 1711746713
  },
  {
    "id": 39867632,
    "title": "Bannerisokeuden torjunta: Käyttäjäkäyttäytymisen ja mainonnan tehokkuuden ymmärtäminen: Käyttäjäkäyttäytymisen ja mainonnan tehokkuuden ymmärtäminen",
    "originLink": "https://en.wikipedia.org/wiki/Banner_blindness",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39867632",
    "commentBody": "",
    "originSummary": [
      "Bannerisokeus, josta puhuttiin ensimmäisen kerran vuonna 1998, tarkoittaa sitä, että kävijät jättävät huomiotta sivustojen bannerin kaltaiset tiedot, mikä johtuu muun muassa siitä, että he eivät halua käyttää sivustoa ja että he tuntevat sen.",
      "Käyttäjien vuorovaikutukseen bannerimainosten kanssa vaikuttaa suuresti verkkosivuston tunnettuus, joka vaikuttaa katseluihin ja klikkauksiin.",
      "Verkkomainonnan tehokkuuteen vaikuttavat muun muassa yhteneväisyys, toimintakutsut, animaatio ja personointi, sillä personoidut mainokset saavat enemmän huomiota, mutta epäolennaiset mainokset aiheuttavat turhautumista."
    ],
    "commentSummary": [
      "Foorumilla keskustellaan bannerisokeudesta, jossa ihmiset jättävät varoitusmerkit huomiotta erityisesti hätätilanteissa autopilottikäyttäytymisen tai tahallisen sääntörikkomuksen vuoksi.",
      "Ehdotuksia ovat esimerkiksi opasteiden näkyvyyden lisääminen fyysisten esteiden avulla tai ovien muotoilun muuttaminen huomion kiinnittämiseksi.",
      "Käyttäjät käsittelevät myös sukupuolten välisiä eroja, turvallisuusrikkomuksista annettuja moitteita, mainosten vaikutusta verkkosisältöön ja mainosten estolaitteiden käyttöä itsesuojeluun."
    ],
    "points": 118,
    "commentCount": 97,
    "retryCount": 0,
    "time": 1711738413
  }
]
