[
  {
    "id": 39865810,
    "title": "تم اكتشاف الباب الخلفي الحرج في xz / liblzma الذي يهدد خوادم SSH",
    "originLink": "https://www.openwall.com/lists/oss-security/2024/03/29/4",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39865810",
    "commentBody": "",
    "originSummary": [
      "يوفر مشروع Openwall منتجات مجانية ومفتوحة المصدر لأمان الخادم ، مثل نظام التشغيل Linux ، وتكسير كلمات المرور ، وأدوات تجزئة كلمة المرور.",
      "تم اكتشاف باب خلفي في حزمة xz / liblzma ، مما أثر على خوادم SSH على أنظمة Linux x86-64 المستندة إلى glibc ، مما يخلق خطر الوصول غير المصرح به أو تنفيذ التعليمات البرمجية عن بعد.",
      "يستهدف رمز الاستغلال مكتبات محددة ، مما يدفع التوزيعات مثل Debian و Red Hat إلى معالجة المشكلة ؛ تحتاج الأنظمة الضعيفة إلى ترقيات عاجلة."
    ],
    "commentSummary": [
      "أدى الباب الخلفي في المنبع xz / liblzma إلى تنازلات لخوادم SSH ، مما أدى إلى تعليق الحساب وإزالة مفتاح المؤلف من المستودعات ، مما أثار مناقشات حول تعقيد الكود ومشاركة الجهات الفاعلة المحتملة للدولة في مشاريع مفتوحة المصدر.",
      "المخاوف التي أثيرت حول أمان تنسيق ملف XZ في توزيعات Linux للمؤسسات تفتقر إلى التحديثات الفورية ، مع التأكيد على أهمية المصادقة متعددة العوامل باستخدام طرق مثل YubiKeys وتخزين كلمات مرور استرداد TOTP لحالات الطوارئ.",
      "مناقشات حول فعالية المصادقة الثنائية ، وقيود المصادقة متعددة العوامل ، ومخاطر تخزين كلمات المرور والرموز المميزة على نفس الجهاز ، ومناقشات حول تنفيذ مفاتيح المرور ، ومفاتيح الأجهزة للمصادقة ، والشفافية في ممارسات الترميز ، إلى جانب دعوة المجتمع إلى اليقظة ومعالجة الثغرات الأمنية الفورية."
    ],
    "points": 3513,
    "commentCount": 1252,
    "retryCount": 0,
    "time": 1711729010
  },
  {
    "id": 39864412,
    "title": "فاعل خير يبتكر \"يلوستون الأوروبي\" في رومانيا",
    "originLink": "https://english.elpais.com/international/2024-03-29/philanthropist-group-buys-up-large-tracts-of-land-in-romania-to-create-european-yellowstone.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39864412",
    "commentBody": "",
    "originSummary": [
      "تستحوذ مجموعة Hansjörg Wyss الخيرية على أراض واسعة في رومانيا لإنشاء \"يلوستون الأوروبي\" في جبال الكاربات ، بهدف الحفاظ على الطبيعة وتعزيز السياحة البيئية وتعزيز اقتصاد المنطقة.",
      "اشترت المؤسسة 27027 هكتارا وتستهدف منطقة محمية تبلغ مساحتها 200000 هكتار ، وتواجه معارضة من السكان ومجموعات الصيد والصراعات في إنشاء حديقة وطنية.",
      "وتشمل الجهود إعادة التحريج والحفاظ على الحياة البرية وإشراك المجتمع المحلي لمعالجة العقبات وإنشاء إطار حفظ قابل للتطبيق."
    ],
    "commentSummary": [
      "تركز المحادثات على إنشاء حديقة يلوستون الوطنية الأوروبية في رومانيا لإعادة إدخال البيسون ، وتسليط الضوء على سلوك الحياة البرية ، والوجود البشري في الموائل الطبيعية ، والسياحة ، والحفظ ، والصراعات الاقتصادية في رومانيا ، وتأثيرات الرأسمالية على الموارد الطبيعية.",
      "يؤكد على جوهر التعايش مع الحياة البرية ، والتصرف بمسؤولية ، والحفاظ على الطبيعة كمواضيع مركزية في الخطاب."
    ],
    "points": 268,
    "commentCount": 216,
    "retryCount": 0,
    "time": 1711721936
  },
  {
    "id": 39867160,
    "title": "قد يستقيل أصحاب الأداء الأفضل إذا تم دفع رواتب أكثر للموظفين الجدد",
    "originLink": "https://hbr.org/2024/03/when-new-hires-get-paid-more-top-performers-resign-first",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39867160",
    "commentBody": "",
    "originSummary": [
      "تتزايد شفافية الأجور في مختلف الصناعات ، مما يجعل الموظفين الحاليين يلاحظون فجوات في الرواتب مع الموظفين الجدد.",
      "تشير الأبحاث إلى أنه بدون تعديل رواتب الموظفين الحاليين بعد التوظيف الجديد ، قد يستقيل أصحاب الأداء الأفضل.",
      "ينصح أصحاب العمل بإجراء تقييمات متسقة للمساواة في الأجور وتعديل الأجور على الفور لمنع فقدان المواهب المحتمل."
    ],
    "commentSummary": [
      "وتسلط المناقشة الضوء على تحديات التفاوت في الرواتب، خاصة عندما يكسب الموظفون الجدد أكثر من العمال ذوي الخبرة، مما يؤدي إلى مغادرة أصحاب الأداء الأفضل وشعور الموظفين الحاليين بالتقليل من قيمتهم.",
      "يتم التأكيد على أهمية الشفافية في الرواتب ، والتفاوض على زيادة الأجور ، وتأثير ظروف السوق على التعويضات.",
      "يغطي النقاش أيضا استراتيجيات الاستبقاء ، والتطوير الوظيفي ، وتغيير التركيبة السكانية للقوى العاملة ، وتنظيم الأسرة ، ونقل المعرفة ، والصراعات الاقتصادية للآباء في الولايات المتحدة ، وتأثير الفجوات بين الأجيال في مكان العمل."
    ],
    "points": 245,
    "commentCount": 196,
    "retryCount": 0,
    "time": 1711735674
  },
  {
    "id": 39868630,
    "title": "الحفاظ على تاريخ سانتا باربرا الرقمي وسط تهديد الإفلاس",
    "originLink": "https://www.independent.com/2024/03/29/santa-barbaras-collective-memory-sold-for-kindling/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39868630",
    "commentBody": "",
    "originSummary": [
      "أعلنت صحيفة سانتا باربرا نيوز برس ، وهي صحيفة تاريخية ، إفلاسها ، مما يعرض أرشيفها الرقمي لخطر بيعه لشركة أجنبية لها تاريخ في تحويل مواقع الويب ذات السمعة الطيبة إلى \"مزارع روابط خلفية\" لتحسين محركات البحث.",
      "تتضمن ممارسة تحسين محركات البحث غير الأخلاقية هذه إضافة محتوى مدفوع للتلاعب بتصنيفات محرك البحث ، مما قد يعرض الدقة التاريخية لسجلات المجتمع للخطر.",
      "يتم حث المواطنين على المشاركة في تقديم العطاءات على الأرشيف لحماية محتواه وإحباط مشاركته في الأنشطة الاستغلالية عبر الإنترنت."
    ],
    "commentSummary": [
      "تم بيع Deadspin للمستثمرين في صناعة الشركات التابعة للألعاب عبر الإنترنت ، مما أدى إلى مخاطر على تاريخ المجتمع.",
      "أنشأ العمال تعاونية تسمى Defector بسبب التحديات مع التمثيل النقابي والمواقع الإخبارية المحلية في سانتا باربرا.",
      "يغطي المقال فصل الأصول عن الخصوم في الشركات ، والتداول من الداخل ، وتحديد الأسعار ، وأهمية الحفاظ على التراث الثقافي من خلال المحفوظات."
    ],
    "points": 206,
    "commentCount": 42,
    "retryCount": 0,
    "time": 1711743955
  },
  {
    "id": 39867702,
    "title": "Apache Guacamole: الوصول إلى أجهزة سطح المكتب في أي مكان باستخدام بوابة بدون عميل",
    "originLink": "https://guacamole.apache.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39867702",
    "commentBody": "",
    "originSummary": [
      "Apache Guacamole هي بوابة سطح مكتب بعيد بدون عميل تدعم بروتوكولات مثل VNC و RDP و SSH ، ويمكن الوصول إليها عبر متصفح الويب للوصول إلى سطح المكتب البعيد.",
      "البرنامج مفتوح المصدر بموجب ترخيص Apache ، ويتم تحسينه باستمرار بواسطة مجتمع المطورين ، مع واجهة برمجة تطبيقات موثقة للتكامل السلس مع التطبيقات المختلفة.",
      "يتم تقديم كل من خيارات الدعم المجتمعي والتجاري ل Apache Guacamole."
    ],
    "commentSummary": [
      "Apache Guacamole هي بوابة سطح مكتب بعيد بدون عميل للوصول إلى أجهزة سطح المكتب البعيدة عبر متصفح الويب ، وتتلقى الثناء على وظائفها وتخصيصها.",
      "أبلغ المستخدمون عن مشكلات مثل تأخر الإدخال وجودة الصوت أثناء استخدام Guacamole ولكنهم شاركوا تجارب إيجابية في التعليم وإعدادات مكان العمل.",
      "تمت مناقشة مشاريع بديلة مثل BrowserBox و xpra و KasmWeb ، حيث يبحث بعض المستخدمين عن حلول مستقلة عن Java ، مما يعرض قيمة Guacamole للوصول إلى سطح المكتب البعيد."
    ],
    "points": 193,
    "commentCount": 40,
    "retryCount": 0,
    "time": 1711738790
  },
  {
    "id": 39870402,
    "title": "تسرب الأسمدة في ولاية أيوا يدمر الأسماك في امتداد النهر الذي يبلغ طوله 60 ميلا",
    "originLink": "https://www.nytimes.com/2024/03/29/us/iowa-spill-fish-kill.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39870402",
    "commentBody": "",
    "originSummary": [
      "أدى تسرب الأسمدة في ولاية أيوا إلى نفوق ما يقرب من 800000 سمكة في نهري أيوا وميسوري بسبب تسرب الأسمدة النيتروجينية السائلة من صمام مفتوح.",
      "قد يستغرق هذا الحادث ، وهو أحد أكبر عمليات نفوق الأسماك في ولاية أيوا ، سنوات حتى يستعيد النظام البيئي عافيته بالكامل ، مما يؤكد المخاوف المستمرة من تلوث المياه.",
      "ويؤكد التسرب على الصعوبات في تطبيق لوائح أكثر صرامة في الولايات الزراعية، وتسليط الضوء على التحديات المستمرة لتلوث المياه."
    ],
    "commentSummary": [
      "أدى تسرب الأسمدة في ولاية أيوا إلى القضاء على معظم الأسماك على طول امتداد نهر يبلغ طوله 60 ميلا ، حيث كانت الأمونيا هي العنصر الضار الرئيسي الذي يؤثر على الحياة المائية.",
      "ويسلط الحادث الضوء على الضرر البيئي المرتبط بالممارسات الزراعية وأثار مناقشات حول فرض عقوبات أشد على أولئك الذين يتسببون في مثل هذه الكوارث.",
      "تتحول بعض المناقشات إلى رسم أوجه تشابه بين الأضرار البيئية ومخاوف أمن البرمجيات ، مما يسلط الضوء على الإلحاح المختلف في معالجة هذه القضايا."
    ],
    "points": 158,
    "commentCount": 20,
    "retryCount": 0,
    "time": 1711757083
  },
  {
    "id": 39868673,
    "title": "الكشف عن الباب الخلفي XZ: مخاطر المساهمين الأفراد",
    "originLink": "https://boehs.org/node/everything-i-know-about-the-xz-backdoor",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39868673",
    "commentBody": "",
    "originSummary": [
      "تم اكتشاف باب خلفي في برنامج Xz ، حيث لعب Jia Tan ، وهو مساهم مشبوه ، دورا مركزيا في إجراء تغييرات ضارة على التعليمات البرمجية ودفع الإصدارات المخترقة إلى المستودعات.",
      "يسلط المنشور الضوء على مخاطر الاعتماد بشكل كبير على المساهمين الأفراد مثل جيا تان دون دعم كاف ، مما يثير مخاوف أمنية على مستوى الصناعة.",
      "يتم أيضا تناول ملفات تعريف LinkedIn المشبوهة ومشكلات سرقة الهوية المحتملة المرتبطة ب Jia Tan في منشور المدونة."
    ],
    "commentSummary": [
      "يثير الباب الخلفي المحتمل في برنامج ضغط xz مخاوف بشأن وكالة استخبارات تستهدف OpenSSH.",
      "وتشير الشكوك إلى وجود جهد منسق لاختراق البرمجيات، ربما من قبل وكالة تابعة للدولة القومية، مع التأكيد على الحاجة إلى تدابير أمنية قوية.",
      "يؤكد المنشور على أهمية وجود العديد من المشرفين على المشاريع مفتوحة المصدر الهامة للتخفيف من المخاطر الأمنية بشكل فعال."
    ],
    "points": 152,
    "commentCount": 26,
    "retryCount": 0,
    "time": 1711744237
  },
  {
    "id": 39872686,
    "title": "التغلب على عاصفة DDoS بتصميم بسيط وأطر عمل عالية الأداء",
    "originLink": "https://tableplus.com/blog/2024/03/how-we-deal-with-ddos.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39872686",
    "commentBody": "",
    "originSummary": [
      "تتناول المدونة هجوم DDoS على خادم الشركة ، وتسلط الضوء على اختيارهم عدم التدخل بسبب قدرة نظامهم على تحمل الهجوم.",
      "وتعزى مرونتهم أثناء الهجوم إلى هيكل خدمتهم غير المعقد والمتجانس واستخدام أطر عمل فعالة مثل Golang و Rust.",
      "وتأكيدا على أهمية استراتيجيات النشر السليمة، يدعون إلى استخدام الثنائيات على الحاويات وتعزيز الأداء عن طريق التحايل على الطبقات الوسيطة."
    ],
    "commentSummary": [
      "يناقش Tableplus.com هجمات DDoS ، ونقاط الضعف في موقع الويب ، وارتفاع حركة المرور ، ونشر التطبيقات في الحاويات ، والتدابير الأمنية مثل وضع \"تحت الهجوم\".",
      "تشمل الموضوعات بناء خدمات متجانسة باستخدام Golang ، وإدارة أحجام الطلبات العالية ، ومناقشة بنية الخدمات المتجانسة مقابل الخدمات المصغرة.",
      "يتم مشاركة الآراء حول تعزيز الأمان وتبسيط النشر ومعالجة التحديات التنظيمية عند اختيار الاستراتيجيات المعمارية."
    ],
    "points": 139,
    "commentCount": 82,
    "retryCount": 0,
    "time": 1711784130
  },
  {
    "id": 39869614,
    "title": "تعظيم عمر Raspberry Pi: يعمل باستخدام نظام ملفات الجذر للقراءة فقط",
    "originLink": "https://www.dzombak.com/blog/2024/03/Running-a-Raspberry-Pi-with-a-read-only-root-filesystem.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39869614",
    "commentBody": "",
    "originSummary": [
      "يمكن أن يؤدي تشغيل Raspberry Pi باستخدام نظام ملفات جذر للقراءة فقط إلى إطالة عمر بطاقة SD عن طريق تقليل عمليات الكتابة.",
      "يقدم الدليل إرشادات مفصلة حول الخطوات المختلفة ، بما في ذلك إزالة البرامج غير الضرورية ، وتكوين نظام الملفات للقراءة فقط ، وإدارة البرامج المثبتة عبر snap ، واستخدام tmpfs لتخزين بيانات ذاكرة الوصول العشوائي ، والحد من المساحة المستخدمة من قبل دفتر اليومية.",
      "كما يغطي معالجة الأخطاء من العمليات التي قد لا تعمل بشكل صحيح على نظام ملفات للقراءة فقط ، مما يوفر نهجا شاملا لتحسين أداء وكفاءة Raspberry Pi."
    ],
    "commentSummary": [
      "تستكشف المقالة تشغيل Raspberry Pi باستخدام نظام ملفات جذر للقراءة فقط ، مما يقترح SquashFS و EROFS لأنظمة الملفات.",
      "يشارك المستخدمون تجاربهم مع العديد من أنظمة التشغيل والإعدادات لتشغيل Pi للقراءة فقط ، والتوصية بأدوات مثل Alpine Linux.",
      "تتضمن التوصيات بطاقات SD الصناعية ، وإمدادات الطاقة الموثوقة ، واستراتيجيات طول عمر بطاقة SD لتجنب تلف البيانات ، إلى جانب استخدام أنظمة ملفات التراكب مثل التراكبات مع tmpfs لإنتاج الصور."
    ],
    "points": 138,
    "commentCount": 47,
    "retryCount": 0,
    "time": 1711750782
  },
  {
    "id": 39866325,
    "title": "استكشاف شبكات تراكب Werons WebRTC",
    "originLink": "https://github.com/pojntfx/weron",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39866325",
    "commentBody": "",
    "originSummary": [
      "Weron هي شبكة تراكب قائمة على WebRTC تتيح الوصول إلى العقد خلف NAT ، والشبكات المنزلية الآمنة ، والتحايل على الرقابة ، وتقدم واجهة برمجة تطبيقات مباشرة لبروتوكولات نظير إلى نظير.",
      "يمكن للمستخدمين تثبيت Weron عبر صور OCI المعبأة في حاويات أو الثنائيات الثابتة ، مع تفصيل استخدام خادم الإشارات لربط الأقران وإدارة المجتمعات وإجراء قياسات زمن الوصول والإنتاجية على الشبكة.",
      "يغطي النص إنشاء شبكات تراكب الطبقة 3 والطبقة 2 باستخدام Werons VPN ، وإنشاء شبكة تراكب Layer 2 Ethernet ، وصياغة بروتوكولات مخصصة باستخدام wrtcconn ، إلى جانب إرشادات حول استخدام weron ، بما في ذلك وسيطات سطر الأوامر ومتغيرات البيئة وتفاصيل الترخيص."
    ],
    "commentSummary": [
      "تركز المناقشة على WebRTC للاتصال عبر الإنترنت من نظير إلى نظير ، مع ذكر تقنيات مثل SimplePeer و GCM و MLS و WebTorrent ، إلى جانب التحديات في دعم الخادم والمتصفح.",
      "تنشأ تكهنات حول نفور Apple من دعم تقنيات الويب مثل WebTransport و WebRTC ، ربما للترويج لمتجر التطبيقات الخاص بها ، مما أثار مناقشات حول تبسيط مفاوضات الأقران وتعزيز الأمان من خلال حلول مؤتمرات الفيديو WebRTC مفتوحة المصدر.",
      "يزن المطورون كفاءة STUN و WebRTC في اجتياز NAT ، مما يثير مخاوف بشأن الأمان وسهولة الاستخدام في هذه العملية."
    ],
    "points": 138,
    "commentCount": 35,
    "retryCount": 0,
    "time": 1711731607
  },
  {
    "id": 39866795,
    "title": "ديميس هاسابيس: قيادة دفعة الذكاء الاصطناعي من Google",
    "originLink": "https://www.bigtechnology.com/p/can-demis-hassabis-save-google",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39866795",
    "commentBody": "",
    "originSummary": [
      "يقود ديميس هاسابيس ، مؤسس DeepMind ، أبحاث Google الذكاء الاصطناعي للحفاظ على القدرة التنافسية في هذا المجال.",
      "أثبتت اختراقات DeepMind مثل AlphaGo و AlphaFold خبرتها الذكاء الاصطناعي ، لكن فجوة الاتصال مع OpenAI شكلت تحديات في النماذج التوليدية.",
      "يعمل حسابيس على Gemini ، وهو نموذج لغوي للتنافس مع نماذج GPT من OpenAI ، إلى جانب تطوير أنظمة الوكيل المستقل ، مما يشير إلى التزامه بالبحث حول احتمال أن يصبح الرئيس التنفيذي لشركة Google."
    ],
    "commentSummary": [
      "يناقش المقال التحديات في تنفيذ خوارزميات البحث الشجري في نماذج اللغات الكبيرة في Google ويؤكد على أهمية التدريب من أجل الحداثة.",
      "يستكشف قيادة Google ، والسعي وراء الذكاء الاصطناعي العام (AGI) ، والمخاوف بشأن تأثير الشركات ، إلى جانب التأثير الذكاء الاصطناعي المحتمل على الصناعات المختلفة.",
      "يسلط النص الضوء أيضا على قيود وجدوى التكنولوجيا الذكاء الاصطناعي ، والإخفاقات المتصورة للرئيس التنفيذي لشركة Google ، ودور DeepMind داخل الشركة."
    ],
    "points": 128,
    "commentCount": 117,
    "retryCount": 0,
    "time": 1711733720
  },
  {
    "id": 39869068,
    "title": "الكشف عن xz-utils الباب الخلفي: استشارات أمنية عاجلة",
    "originLink": "https://gist.github.com/thesamesam/223949d5a074ebc3dce9ee78baad9e27",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39869068",
    "commentBody": "",
    "originSummary": [
      "تم العثور على باب خلفي في xz-utils في 29 مارس 2024 ، مما أثر على الأنظمة ذات الإصدارات 5.6.0 أو 5.6.1 من xz أو liblzma ، والتي تم تشغيلها بواسطة أنظمة غير مميزة عن بعد متصلة بمنافذ SSH العامة.",
      "يستخدم الاستغلال تكوينات glibc و systemd وتكوينات محددة لاستهداف إجراءات مصادقة OpenSSH ، مما قد يسمح بتجاوز عمليات المصادقة.",
      "يعمل مشرفو xz-utils بنشاط على التصحيحات ، مع التأكيد على الحاجة الملحة للمستخدمين الذين لديهم SSH يمكن الوصول إليها بشكل عام لتحديث أنظمتهم على الفور."
    ],
    "commentSummary": [
      "تم العثور على باب خلفي ، xz-utils ، في مكتبة xz / liblzma ، مما يخاطر باختراق خوادم SSH عندما يتطابق اسم العملية مع / usr / bin / sshd.",
      "قام المهاجم بزرع الثغرة في مجلد اختبار مكتبة الضغط ، مما أثار مناقشات حول ممارسات أمان البرامج في إعدادات المصدر المفتوح والمغلق.",
      "وتركز المحادثات الجارية على الآثار المترتبة على الالتزامات السابقة وتشدد على الحاجة المستمرة إلى أساليب يقظة لتطوير البرمجيات وتوزيعها لمنع مثل هذه التنازلات."
    ],
    "points": 120,
    "commentCount": 24,
    "retryCount": 0,
    "time": 1711746713
  },
  {
    "id": 39867632,
    "title": "مكافحة عمى الشعارات: فهم سلوك المستخدم وفعالية الإعلان",
    "originLink": "https://en.wikipedia.org/wiki/Banner_blindness",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39867632",
    "commentBody": "",
    "originSummary": [
      "عمى اللافتات ، الذي أطلق عليه لأول مرة في عام 1998 ، هو عندما يتجاهل الزوار المعلومات الشبيهة بالشعارات على مواقع الويب بسبب عوامل مثل النفور من الفوضى ومعرفة المستخدم بالموقع.",
      "يتأثر تفاعل المستخدم مع إعلانات البانر بشكل كبير بمعرفة موقع الويب ، مما يؤثر على المشاهدات والنقرات.",
      "تؤثر عوامل مثل التطابق والعبارات التي تحث المستخدم على اتخاذ إجراء والرسوم المتحركة والتخصيص على فعالية الإعلانات عبر الإنترنت ، حيث تحظى الإعلانات المخصصة بمزيد من الاهتمام ولكن الإعلانات غير الملائمة تسبب الإحباط."
    ],
    "commentSummary": [
      "يناقش المنتدى عمى الشعارات ، حيث يتجاهل الناس علامات التحذير ، خاصة في حالات الطوارئ ، بسبب سلوك الطيار الآلي أو خرق القواعد المتعمد.",
      "تتضمن الاقتراحات جعل اللافتات أكثر وضوحا بصريا باستخدام الحواجز المادية أو التغيير والتبديل في تصميمات الأبواب لجذب الانتباه.",
      "يتطرق المستخدمون أيضا إلى الاختلافات بين الجنسين ، والتوبيخ لانتهاكات السلامة ، وتأثير الإعلانات على المحتوى عبر الإنترنت ، واستخدام أدوات حظر الإعلانات للحماية الذاتية."
    ],
    "points": 118,
    "commentCount": 97,
    "retryCount": 0,
    "time": 1711738413
  }
]
