[
  {
    "id": 37857417,
    "title": "CS 학생이 미개봉 헤라클레니움 두루마리에서 발견한 첫 단어",
    "originLink": "https://scrollprize.org/firstletters",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37857417",
    "commentBody": "",
    "originSummary": [
      "기술 기업가 냇 프리드먼과 다니엘 그로스가 시작한 베수비오 챌린지는 폼페이 인근 사립 도서관의 고대 두루마리를 머신러닝 모델을 사용해 해독하는 대회입니다.",
      "컴퓨터 공학도인 루크 패리터는 2천 년 전 미개봉 두루마리에서 전체 단어를 찾아낸 최초의 개인이 되어 4만 달러의 상금을 받았습니다. 이와 별도로 유세프 네이더(Youssef Nader)도 같은 단어를 발견하여 1만 달러의 상금을 받았습니다.",
      "이번에 발굴된 용어는 '보라색'을 의미하는 '포르피라스'로, 고대 사본에서는 드물게 발견되는 단어입니다. 이 대회는 현재 진행 중이며 70만 달러의 상금이 걸려 있습니다."
    ],
    "commentSummary": [
      "한 컴퓨터 공학 학생이 머신러닝을 활용하여 미개봉 헤라클레니움 두루마리의 첫 단어를 해독함으로써 고전 문학에 대한 관심을 불러일으키고 발굴 및 고대 텍스트에 대한 잠재적 의미를 밝혀냈습니다.",
      "베수비오 챌린지를 통해 잠니아 공의회 이전의 주요 자료에서 고대 문명에 대한 핵심적인 통찰력을 발견할 수 있는 등 인문학 및 학계에서는 이러한 발전이 상당한 잠재력을 지닌 것으로 보고 있습니다.",
      "이 방법은 역사적 문서를 밝혀냄으로써 기독교의 기원을 밝히고, 머신러닝이 두루마리 분석에 가져올 수 있는 심오한 의미와 진전을 보여줄 수 있는 잠재력을 보여줍니다."
    ],
    "points": 754,
    "commentCount": 158,
    "retryCount": 0,
    "time": 1697119878
  },
  {
    "id": 37864867,
    "title": "스크롤바가 문제가 되고 있습니다.",
    "originLink": "https://artemis.sh/2023/10/12/scrollbars.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37864867",
    "commentBody": "",
    "originSummary": [
      "이 게시물은 스크롤바 크기가 작아지면 미세한 운동 제어에 문제가 있거나 포인팅 장치가 부정확한 사람들에게 어려움을 초래하는 문제를 강조합니다.",
      "저자는 GTK, Qt, Firefox, Chrome과 같은 다양한 소프트웨어 플랫폼에서 스크롤바 너비를 조정하는 솔루션을 제공하지만, 전자식 앱 구성의 문제점을 강조합니다.",
      "미니맵은 스크롤바가 줄어드는 추세로 인해 발생하는 문제를 해결하기 때문에 기존 스크롤바를 대체할 수 있는 사용자 친화적인 대안으로 평가받고 있습니다."
    ],
    "commentSummary": [
      "사용자들은 제한된 사용자 지정 옵션, 열등한 사용성, 기능보다 외관이 우선시되는 소프트웨어 및 운영 체제의 현재 UI 디자인에 대해 불만을 표합니다.",
      "참가자들은 UI 품질 저하, 이전 버전에 대한 선호도, 보다 사용자 친화적이고 시각적으로 만족스러운 인터페이스에 대한 열망에 대해 논의했습니다.",
      "특히 스크롤바의 문제를 언급하며 UI를 디자인할 때 사용자 선호도, 접근성, 개인정보 보호를 고려하는 것의 중요성과 다양한 입력 방법으로 인해 발생하는 문제를 강조합니다."
    ],
    "points": 462,
    "commentCount": 432,
    "retryCount": 0,
    "time": 1697156243
  },
  {
    "id": 37859085,
    "title": "데스모스 3D 그래프 계산기",
    "originLink": "https://www.desmos.com/3d",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37859085",
    "commentBody": "",
    "originSummary": [
      "Desmos 3D(베타)는 사용자가 3차원 범위에서 그래프를 생성하고 계산할 수 있는 새로운 도구입니다.",
      "고급 수학 계산을 위한 위첨자 및 기준선을 포함하여 다양한 함수와 수학 기호가 통합되어 있습니다.",
      "이 소프트웨어에는 사용자가 버그를 신고하고 개선 사항을 제안할 수 있는 블로그도 포함되어 있습니다."
    ],
    "commentSummary": [
      "온라인 그래프 계산기인 Desmos는 뛰어난 애니메이션 제작 기능으로 유튜버들 사이에서 인기가 급증하고 있습니다.",
      "Desmos와 다른 그래프 계산기인 지오지브라(GeoGebra)를 비교한 결과, 사용자들은 더 부드러운 사용자 인터페이스(UI)를 제공하는 Desmos를 더 선호했습니다.",
      "이 토론에서는 상업용 사용자는 라이선스를 취득해야 한다는 점을 강조하는 GeoGebra의 라이선싱과 성능 문제 및 애니메이션 변수에 대한 솔루션을 제공하는 Desmos의 팀에 대해서도 다룹니다."
    ],
    "points": 386,
    "commentCount": 81,
    "retryCount": 0,
    "time": 1697126723
  },
  {
    "id": 37859437,
    "title": "미치광이 집",
    "originLink": "https://dynomight.substack.com/p/midwit-home",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37859437",
    "commentBody": "",
    "originSummary": [
      "이 기사에서는 스마트 홈 구축의 복잡성에 대해 자세히 알아보고 쉽고 편리하게 사용할 수 있는 보다 간단한 대안을 제안합니다.",
      "스마트 홈 환경에서 조명, 콘센트, 가전 제품을 관리하는 데 사용되는 다양한 원격 제어 장치에 대해 논의합니다.",
      "홈 오토메이션에서 조명의 역할이 특별히 강조됩니다. 새로운 원격 제어 장치의 개발 가능성을 제시하여 스마트 홈 기술의 미래 트렌드를 제시합니다."
    ],
    "commentSummary": [
      "이 토론에서는 스마트 잠금장치, 스위치, 과제, 홈 유틸리티 제어에 스마트 기기를 적용하는 방법 등 홈 오토메이션과 관련된 주제를 다룹니다.",
      "사용자는 다양한 스마트 홈 장치 및 시스템의 편의성, 보안, 안정성 및 호환성에 대한 경험과 생각을 교환합니다.",
      "개인정보 보호 문제, 백업 옵션의 중요성, 홈 오토메이션에서 더 간단하고 사용자 친화적인 솔루션에 대한 수요와 같은 주제에 대해서도 논의합니다."
    ],
    "points": 374,
    "commentCount": 262,
    "retryCount": 0,
    "time": 1697128277
  },
  {
    "id": 37857544,
    "title": "열두 요인 앱 (2011)",
    "originLink": "https://12factor.net/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37857544",
    "commentBody": "",
    "originSummary": [
      "12요소 앱은 서비스형 소프트웨어 애플리케이션을 만들기 위한 프레임워크로 자동화, 이식성, 클라우드 배포, 지속적인 배포 및 확장성에 중점을 둡니다.",
      "이 방법론은 모든 프로그래밍 언어 및 다양한 지원 서비스와 함께 사용할 수 있으며 코드베이스 구성, 종속성 관리, 구성, 빌드 및 실행 단계, 동시성, 개발-프로덕션 동등성 유지 등 다양한 측면에 대한 가이드라인을 제공합니다.",
      "기여자들의 경험과 관찰을 바탕으로 만들어진 이 프로젝트는 애플리케이션 개발의 시스템적 문제를 해결하는 것을 목표로 합니다."
    ],
    "commentSummary": [
      "이 대화는 구성 저장소, 비밀 관리, 로그 처리, 이벤트 스트림 사용과 같은 영역을 다루는 소프트웨어 애플리케이션 개발을 위한 12요소 앱 방법론과 권장 사례를 중심으로 진행됩니다.",
      "참가자들은 12가지 원칙의 효과와 적용 가능성에 대해 다양한 의견을 제시했으며, 그 실용성과 보안 측면에 대한 토론이 이어졌습니다.",
      "컨테이너화 및 Kubernetes와 같은 주제와 실제 시나리오에서 원칙을 실행하는 데 따르는 어려움에 대해서도 논의하여 이러한 원칙이 최신 개발 관행과의 관련성을 나타냅니다."
    ],
    "points": 358,
    "commentCount": 229,
    "retryCount": 0,
    "time": 1697120386
  },
  {
    "id": 37859311,
    "title": "절대 안 됩니다: 기술 부채의 과소평가된 원인",
    "originLink": "https://jesseduffield.com/Can%27t-Be-Fcked/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37859311",
    "commentBody": "",
    "originSummary": [
      "이 블로그 게시물은 동기 부여 부족이나 게으름이 종종 기술 부채로 이어질 수 있다고 주장합니다.",
      "저자는 지속적으로 코드를 개선하는 부지런한 개발자와 특정 작업을 지연시키는 자신의 성향이 대조적이라고 지적합니다.",
      "저자는 동기부여 소실에 대처할 때 자기 인식과 정직함이 중요하다고 강조하며, '조기 최적화'나 '공격적인 범위 축소'와 같은 핑계로 기술 부채를 유발하지 않기 위해 필요한 경우 휴식을 취할 것을 제안하기도 합니다."
    ],
    "commentSummary": [
      "이 기사에서는 기술 부문에서 기술 부채의 잠재적 원인으로 \"망할 수 없다\"(CBF)에 대해 논의하며 고금리 기술 부채를 관리하기 위한 더 나은 인식과 동기 부여의 필요성을 강조합니다.",
      "코드 위생 유지, 다양한 유형의 기술 부채에 대한 이해, 레거시 시스템의 문제 해결의 중요성도 강조됩니다.",
      "또한 장인 정신의 핵심 역할, 개발자와 비즈니스 간의 단절, 소프트웨어 개발에서 품질 우선순위를 정하는 데 있어 조직 문화가 미치는 영향에 대해서도 논의합니다."
    ],
    "points": 351,
    "commentCount": 323,
    "retryCount": 0,
    "time": 1697127670
  },
  {
    "id": 37860819,
    "title": "OpenAI는 너무 저렴해서 이길 수 없습니다.",
    "originLink": "https://generatingconversation.substack.com/p/openai-is-too-cheap-to-beat",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37860819",
    "commentBody": "",
    "originSummary": [
      "OpenAI와 같은 주요 언어 모델(LLM) 제공업체는 모델 품질과 대규모 모델 서비스 효율성 측면에서 우위를 점하고 있습니다.",
      "이 기사는 개인 하드웨어에서 모델을 미세 조정하고 제공하는 것보다 OpenAI의 플랫폼을 사용하여 비용 효율을 높이는 방법을 옹호합니다.",
      "비용과 복잡성 때문에 조직이 자체 오픈소스 LLM을 배포하는 것을 권장하지 않지만, 오픈소스 모델이 더욱 간소화될 것이라는 점을 고려하면 오픈소스 모델의 미래를 인정합니다."
    ],
    "commentSummary": [
      "이 기사에서는 저비용 모델의 지속 가능성, AI 산업에서의 경쟁력, 언어 모델의 한계, 스마트폰 시장으로의 확장 계획 등 OpenAI의 다양한 측면을 다루고 있습니다.",
      "이 글에서는 Uber와 Google을 비롯한 다양한 기업의 가격 전략, 효율성, OpenAI 모델 사용과 관련된 비용, AI 모델 실행을 위한 하드웨어 요구 사항, 시스템 한계에 대해 설명합니다.",
      "이 보고서는 OpenAI 서비스의 신뢰성 및 보안과 관련된 우려 사항과 서버에서 실행되는 것이 아니라 최종 사용자의 디바이스에서 실행되는 로컬 AI-AI의 이점을 강조합니다."
    ],
    "points": 348,
    "commentCount": 375,
    "retryCount": 0,
    "time": 1697134569
  },
  {
    "id": 37857765,
    "title": "던전 앤 드래곤을 플레이하기 위한 가상 테이블탑을 만들었습니다.",
    "originLink": "https://www.diceright.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37857765",
    "commentBody": "",
    "originSummary": [
      "다이서라이트는 루비 온 레일을 사용하여 개발된 던전 앤 드래곤을 플레이할 수 있는 온라인 플랫폼으로, 액션 케이블을 사용하여 모든 플레이어의 맵과 토큰을 동기화합니다.",
      "HTML 캔버스와 fabric.js로 구축된 인터페이스를 통해 사용자는 지도와 상호 작용할 수 있습니다. 이 웹사이트는 모바일 사용에도 최적화되어 있습니다.",
      "사용자 경험을 디자인한 크리에이터가 사이드 프로젝트로 함께 만들었으며, 플랫폼에 대한 피드백과 문의에 열려 있습니다."
    ],
    "commentSummary": [
      "저자는 온라인 던전 앤 드래곤(D&D) 게임 플레이를 위한 가상 테이블탑을 개발했으며, 특히 모바일 장치용으로 설계되었습니다.",
      "사용자들의 피드백을 바탕으로 모바일 스크린샷과 동영상 추가 등의 개선이 이루어졌으며, 플랫폼은 RPG 게임의 혁신이라는 찬사를 받고 있습니다.",
      "이 토론에서는 테이블탑과 컴퓨터 RPG를 비교하고 D&D의 커뮤니티 스토리텔링 측면을 강조합니다. 또한 게임을 즐기기 위해 호환되는 던전 마스터(DM)를 갖는 것의 중요성도 강조합니다."
    ],
    "points": 342,
    "commentCount": 101,
    "retryCount": 0,
    "time": 1697121356
  },
  {
    "id": 37859905,
    "title": "무단횡단 범죄는 자동차 회사들이 발명했다 (2015)",
    "originLink": "https://www.vox.com/2015/1/15/7551873/jaywalking-history",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37859905",
    "commentBody": "",
    "originSummary": [
      "이 기사는 1920년대 자동차 단체와 제조업체가 사고의 책임을 운전자에서 보행자로 돌리기 위해 주로 영향을 받은 도로 이용 규범의 변화를 추적합니다.",
      "자동차 보급률이 증가하면서 보행자 사망자가 증가하자 업계 단체들은 보행자를 횡단보도로 제한하는 법률을 효과적으로 옹호하고 무단횡단자를 조롱하는 전략을 전개했습니다.",
      "'무단횡단'이라는 용어는 이러한 새로운 법을 무시하는 사람들을 무식하고 공공 안전에 위험한 사람으로 분류하기 위해 만들어졌으며, 이는 자동차 업계가 도로를 보행자가 아닌 차량 전용 구역으로 인식하는 데 성공했음을 보여줍니다."
    ],
    "commentSummary": [
      "무단횡단 법규와 자동차 중심의 도시 계획이 보행자 안전에 미치는 영향 등 보행자 안전에 영향을 미치는 다양한 요인에 대해 자세히 설명합니다.",
      "교통수단과 인종 차별을 연관 짓는 역사적 맥락과 함께 보행자 우선순위 지정, 대체 교통수단 옹호 등의 잠재적 개선 방안이 언급됩니다.",
      "무단횡단 법 집행, 보행자와 운전자의 행동 패턴, 더 안전한 규제와 인프라에 대한 요구 등에 대한 논의도 이루어집니다."
    ],
    "points": 334,
    "commentCount": 272,
    "retryCount": 0,
    "time": 1697130303
  },
  {
    "id": 37865941,
    "title": "내 찾기 미설정으로 인해 내 MacBook이 벽돌이 되었습니다.",
    "originLink": "https://www.tokyodev.com/articles/not-setting-up-find-my-bricked-my-macbook",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37865941",
    "commentBody": "",
    "originSummary": [
      "저자는 공항 보안 검색대에서 실수로 새 MacBook Air를 다른 사람에게 맡겼다가 다시 찾은 후 활성화 잠금이 활성화된 것을 발견한 경험에 대해 이야기합니다.",
      "거듭된 요청에도 불구하고 Apple은 활성화 잠금을 해제하는 데 도움을 주지 않았고, 이로 인해 작성자는 Apple의 엄격한 정책과 부적절한 고객 지원에 대해 비판했습니다.",
      "한 가지 조언을 드리자면, 저자는 MacBook 사용자에게 유사한 문제가 발생하지 않도록 기기에서 '내 찾기' 기능을 활성화할 것을 권장합니다."
    ],
    "commentSummary": [
      "에어팟 소프트웨어 결함, 블루투스 헤드폰의 장단점, 고객 지원 경험 등 Apple 제품에 대한 다양한 주제를 다룹니다.",
      "또한 사용자들은 Apple의 정품 인증 잠금 기능의 효과와 불편함을 포함하여 MacBook의 정품 인증 잠금, 수입 관세 및 세금과 같은 보안 조치에 대해 논의합니다.",
      "이러한 토론은 사용자가 이러한 문제에 대한 불만, 개인적인 경험 및 의견을 공유할 수 있는 플랫폼입니다."
    ],
    "points": 279,
    "commentCount": 377,
    "retryCount": 0,
    "time": 1697164993
  },
  {
    "id": 37857231,
    "title": "반쯤 구워진 프로젝트를 보여주세요",
    "originLink": "https://news.ycombinator.com/item?id=37857231",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37857231",
    "commentBody": "",
    "originSummary": [
      "이 성명서는 개인이 프로젝트의 완성도나 준비 상태에 관계없이 프로젝트를 조기에 자주 시작해야 한다고 주장합니다.",
      "이는 빠른 실패와 그에 따른 개선을 통해 학습을 촉진하는 개념인 '빠른 실패'와 반복의 중요성을 강조합니다.",
      "또한, 프로젝트, 스타트업 또는 아이디어에 대한 지원과 도움을 확대하여 혁신과 발전을 위한 지원을 약속합니다."
    ],
    "commentSummary": [
      "이 게시물은 사람들이 소프트웨어 프로젝트에 대한 피드백과 잠재적인 개선 사항을 교환하는 포럼 스레드의 디지털 참여 내용을 모아놓은 것입니다.",
      "소개된 프로젝트는 디지털 개미 농장 게임, 우쿨렐레 코드 학습 앱, 다양한 웹 기반 도구 및 확장 프로그램, 스트리밍 서비스 사용자 인터페이스, 법률 문서 검색 엔진 등 다양합니다.",
      "대화는 프로젝트의 특징과 목표를 논의하고 개선 및 잠재적 협업 기회를 모색하는 데 중점을 둡니다."
    ],
    "points": 270,
    "commentCount": 477,
    "retryCount": 0,
    "time": 1697119118
  },
  {
    "id": 37862606,
    "title": "6개의 플랫폼에서 한 사람이 하나의 게임을 개발합니다: 좋은 게임, 나쁜 게임, 추악한 게임",
    "originLink": "https://ruoyusun.com/2023/10/12/one-game-six-platforms.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37862606",
    "commentBody": "",
    "originSummary": [
      "저자는 게임 인더스트리 아이들에서 웹, 윈도우, 맥OS, 리눅스 등 다양한 플랫폼을 지원한 경험과 각 플랫폼이 가져다주는 뚜렷한 도전과제를 공유했습니다.",
      "Valve가 카운터 스트라이크 2에서 macOS를 더 이상 지원하지 않기로 한 결정의 영향과 부정 행위 및 플랫폼별 문제 해결에 대해 논의합니다.",
      "여러 플랫폼을 지원할 때 비용과 수익에 미치는 영향, 1인 인디 개발자로서 겪었던 어려움, 향후 프로젝트에서 더 나은 선택을 하고 작업량 균형을 맞추기 위한 포부에 대한 인사이트를 제공합니다."
    ],
    "commentSummary": [
      "이 스레드는 웹 브라우저, 브라우저 기반 기술 및 네이티브 애플리케이션을 적용하는 크로스 플랫폼 게임 개발의 장애물과 한계를 다룹니다.",
      "HTML5 게임의 로컬 저장소 관련 문제, iOS Safari에서의 디버깅, Linux 및 macOS와 같은 플랫폼으로 게임을 포팅할 때의 어려움에 대해 설명합니다.",
      "마지막으로, 다양한 플랫폼에서 게임을 위한 Steam과 Proton의 사용법과 게임 유지 관리에 대한 우려에 대해 논의합니다."
    ],
    "points": 261,
    "commentCount": 107,
    "retryCount": 0,
    "time": 1697141686
  },
  {
    "id": 37859402,
    "title": "EU \"채팅 제어\" 및 필수 클라이언트 측 검사",
    "originLink": "https://berthub.eu/articles/posts/client-side-scanning-dutch-parliament/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37859402",
    "commentBody": "",
    "originSummary": [
      "네덜란드 의회는 사적인 메시지를 스캔하여 잠재적으로 부당한 수사로 이어질 수 있는 클라이언트 측 스캐닝과 관련된 EU의 '채팅 제어' 제안에 대한 청문회를 개최했습니다.",
      "두 차례에 걸친 의회의 반대에도 불구하고 네덜란드 정부는 이를 무시하고 해당 기술에 대한 추구를 계속하기로 결정했습니다.",
      "청문회에서 제기된 우려는 사적인 대화에 대한 침입뿐만 아니라 기술의 입증되지 않은 효과에 대한 것이었으며, 이 분야에서 중국과의 협력 가능성에 대한 추가 경고도 있었습니다."
    ],
    "commentSummary": [
      "EU는 아동 성학대 자료(CSAM)에 대한 디바이스 검색을 의무화하는 '채팅 제어' 법안을 검토 중이며, 이는 잠재적인 개인정보 침해 논란을 불러일으킬 수 있습니다.",
      "비평가들은 이것이 확대 검색의 전조일 수 있다고 우려하며, 유로폴이 이 데이터에 접근하고 통제되지 않은 경찰 AI에 사용하는 것에 대한 우려를 제기합니다.",
      "논의는 메시징 플랫폼에 미치는 영향, 업계의 책임, 자율 주행 차량의 통제까지 확대되어 개인정보 보호, 정부의 과도한 권한, 범죄 행위 억제에 대한 다양한 업계의 각자의 역할에 대한 광범위한 우려를 반영합니다."
    ],
    "points": 249,
    "commentCount": 93,
    "retryCount": 0,
    "time": 1697128114
  },
  {
    "id": 37856895,
    "title": "10억 달러에 가까운 금액에 Loom을 인수하는 Atlassian",
    "originLink": "https://www.reuters.com/markets/deals/atlassian-agrees-buy-video-messaging-provider-loom-nearly-1-bln-2023-10-12/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37856895",
    "commentBody": "",
    "originSummary": [
      "소프트웨어 회사인 Atlassian은 팀 협업 도구를 강화하고 워크플로에 비디오를 통합할 수 있도록 비디오 메시징 플랫폼 Loom을 약 9억 7,500만 달러에 인수한다고 발표했습니다.",
      "전 세계 2,500만 명 이상의 사용자를 보유한 Loom은 2024년 3월에 인수가 완료될 것으로 예상되며, Jira 및 Confluence와 같은 Atlassian 소프트웨어에 통합될 예정입니다.",
      "기존 현금 잔고로 자금을 조달하지만, Atlassian은 이번 인수로 인해 2024년 6월과 2025년 6월에 끝나는 회계연도의 영업 마진이 희석될 것으로 예상합니다."
    ],
    "commentSummary": [
      "소프트웨어 개발 회사인 Atlassian은 비디오 메시징 서비스인 Loom을 인수할 계획입니다.",
      "인수 금액은 약 10억 달러로 추정됩니다.",
      "이 개발은 Atlassian이 비디오 메시징 분야로 확장되었음을 의미합니다."
    ],
    "points": 229,
    "commentCount": 3,
    "retryCount": 0,
    "time": 1697117638
  },
  {
    "id": 37861589,
    "title": "Nginx 제품에 영향을 미치는 HTTP/2 빠른 재설정 공격",
    "originLink": "https://www.nginx.com/blog/http-2-rapid-reset-attack-impacting-f5-nginx-products/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37861589",
    "commentBody": "",
    "originSummary": [
      "HTTP/2 프로토콜에서 NGINX 오픈 소스, NGINX Plus 및 관련 제품에 대한 서비스 거부 공격을 실행하는 데 사용될 수 있는 취약점이 발견되어 NGINX HTTP/2 모듈에 영향을 미칠 수 있습니다.",
      "이 취약점을 통해 공격자는 수많은 HTTP/2 스트림을 빠르게 취소하여 설정된 임계값을 트리거하지 않고도 서버에 과부하를 일으킬 수 있습니다.",
      "NGINX는 이 취약점을 해결하기 위해 패치를 발표했으며, 하나의 이벤트 루프 내에서 새 스트림의 수를 제한하여 시스템 안정성을 개선했습니다. 또한 사용자들에게 최신 패키지로 업데이트하고 구성 파일을 조정하여 보호 기능을 강화할 것을 권고하고 있습니다. 단일 클라이언트의 연결 및 요청을 제한하는 것도 권장됩니다. 이 취약점을 완화하는 데 Cloudflare, Amazon, Google이 도움을 주었습니다."
    ],
    "commentSummary": [
      "HTTP/2 빠른 재설정 공격은 Nginx 제품에 영향을 미치고 있지만, 기본적으로 Nginx는 특정 구성을 변경하지 않는 한 이 공격에 대한 안전장치를 갖추고 있습니다.",
      "이 취약점이 NGINX 및 기타 웹 서버에 미치는 영향에 대한 담론이 확산되고 있으며, 그 영향에 대해 우려하는 의견과 비표준 설정에 주로 영향을 미친다고 생각하는 의견이 엇갈리고 있습니다.",
      "이 대화는 HTTP 버전, 서버 제한, 광고 차단기 사용, 시기적절한 업데이트 및 패치의 중요성 등으로 확장되어 다양한 설정에서 이 취약점이 미칠 수 있는 잠재적 영향에 초점을 맞춥니다."
    ],
    "points": 217,
    "commentCount": 48,
    "retryCount": 0,
    "time": 1697137490
  }
]
