[
  {
    "id": 37857417,
    "title": "Az első szót a CS hallgató fedezte fel a Herculaneum fel nem bontott tekercsében",
    "originLink": "https://scrollprize.org/firstletters",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37857417",
    "commentBody": "",
    "originSummary": [
      "A Vesuvius Challenge, amelyet Nat Friedman és Daniel Gross technológiai vállalkozók kezdeményeztek, egy olyan verseny, amelynek célja a Pompeji közelében található magánkönyvtárból származó ókori tekercsek megfejtése gépi tanulási modellek segítségével.",
      "Luke Farritor informatikus hallgató lett az első olyan személy, aki egy teljes szót azonosított egy két évezreddel ezelőtti, felbontatlan tekercsben, és ezzel 40 000 dollárt nyert. Ettől függetlenül Youssef Nader is felfedezte ugyanezt a szót, és 10 000 dolláros díjat nyert.",
      "A feltárt kifejezés a \"porphyras\", ami \"bíbor\", ami szokatlan előfordulást jelent az ókori kéziratokban. A verseny még tart, és a 700 000 dolláros fődíj még mindig elérhető."
    ],
    "commentSummary": [
      "Egy informatikus hallgató gépi tanulást alkalmazva megfejtette az első szót egy fel nem bontott herculaneumi tekercsből, ami felkeltette az érdeklődést a klasszikus irodalom iránt, és az ásatásokra és az ókori szövegekre gyakorolt lehetséges hatásokat.",
      "Ezek az előrelépések a humán tudományok és az akadémiai szféra számára jelentős potenciállal bírnak, a Vesuvius Challenge pedig a Jamniai Tanácsot megelőző elsődleges forrásokból kulcsfontosságú ismereteket tárhat fel az ókori civilizációkról.",
      "A módszer megmutatja, hogy a történelmi dokumentumok feltárásával a kereszténység eredetét is meg lehet világítani, rámutatva arra, hogy a gépi tanulás milyen mélyreható következményekkel és előrelépéssel járhat a tekercselemzésben."
    ],
    "points": 754,
    "commentCount": 158,
    "retryCount": 0,
    "time": 1697119878
  },
  {
    "id": 37864867,
    "title": "A görgetősávok problémássá válnak",
    "originLink": "https://artemis.sh/2023/10/12/scrollbars.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37864867",
    "commentBody": "",
    "originSummary": [
      "A bejegyzés kiemeli a görgetősáv méretének csökkenésével kapcsolatos problémát, amely nehézségeket okoz a finommotoros problémákkal vagy pontatlan mutatóeszközökkel rendelkező egyének számára.",
      "A szerző megoldásokat kínál a görgetősáv szélességének beállítására különböző szoftverplatformokon, például GTK, Qt, Firefox és Chrome esetén, de kiemeli az Electron alkalmazások konfigurációjának kihívásait.",
      "A minimapokat a hagyományos görgetősávok felhasználóbarát alternatívájaként dicsérik, mivel megoldják a zsugorodó görgetősávok trendje által okozott problémákat."
    ],
    "commentSummary": [
      "A felhasználók elégedetlenségüket fejezik ki a szoftverek és operációs rendszerek jelenlegi felhasználói felületének kialakításával a korlátozott testreszabási lehetőségek, a rosszabb használhatóság és a megjelenésnek a funkcionalitással szembeni elsőbbsége miatt.",
      "A résztvevők megvitatják a felhasználói felület minőségének romlását, a korábbi verziók előnyben részesítését, valamint a felhasználóbarátabb és vizuálisan kellemesebb felületek iránti vágyat.",
      "A hangsúlyt a felhasználói felület tervezésekor a felhasználói preferenciák, a hozzáférhetőség és az adatvédelem figyelembevételének fontosságára, valamint a különböző beviteli módszerek által támasztott kihívásokra helyezi, különös tekintettel a görgetősávokkal kapcsolatos problémákra."
    ],
    "points": 462,
    "commentCount": 432,
    "retryCount": 0,
    "time": 1697156243
  },
  {
    "id": 37859085,
    "title": "Desmos 3D grafikus számológép",
    "originLink": "https://www.desmos.com/3d",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37859085",
    "commentBody": "",
    "originSummary": [
      "A Desmos 3D (Beta) egy új eszköz, amely lehetővé teszi a felhasználók számára, hogy grafikonokat készítsenek és számítsanak három dimenzióban.",
      "Számos funkciót és matematikai szimbólumot tartalmaz, beleértve a felsőjeleket és alapvonalakat a fejlett matematikai számításokhoz.",
      "A szoftver egy blogot is tartalmaz, ahol a felhasználók hibákat jelenthetnek és fejlesztési javaslatokat tehetnek."
    ],
    "commentSummary": [
      "Az online grafikus számológép, a Desmos, a YouTuberek körében egyre nagyobb népszerűségnek örvend a nagyszerű animációkészítési funkciói miatt.",
      "A Desmos és egy másik grafikus számológép, a GeoGebra összehasonlítása során, amelyet a LaTeX integráció és a Tikz export funkciói miatt részesítettek előnyben, a felhasználók a Desmos-t a gördülékenyebb felhasználói felület (UI) miatt részesítették előnyben.",
      "A beszélgetés kitér a GeoGebra licencelésére is, kiemelve, hogy a kereskedelmi felhasználóknak licencet kell szerezniük, valamint a Desmos csapata megoldásokat kínál a teljesítményproblémákra és az animációs változókra."
    ],
    "points": 386,
    "commentCount": 81,
    "retryCount": 0,
    "time": 1697126723
  },
  {
    "id": 37859437,
    "title": "A midwit otthon",
    "originLink": "https://dynomight.substack.com/p/midwit-home",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37859437",
    "commentBody": "",
    "originSummary": [
      "A cikk az intelligens otthon kialakításának bonyolultságát vizsgálja, és egyszerűbb alternatívákat javasol a könnyebbség és a kényelem érdekében.",
      "A megbeszélés során szó esik a különböző távirányítású eszközökről, amelyeket az intelligens otthonokban a világítás, a konnektorok és a készülékek kezelésére használnak.",
      "Különös hangsúlyt kap a világítás szerepe az otthoni automatizálásban. Felveti az új, távirányítású eszközök fejlesztésének lehetőségeit, jelezve az intelligens otthonok technológiájának lehetséges jövőbeli trendjeit."
    ],
    "commentSummary": [
      "A megbeszélések az otthoni automatizálás körüli témákról szólnak, beleértve az intelligens zárakat, kapcsolókat, kihívásokat és az intelligens eszközök alkalmazását az otthoni közművek vezérlésében.",
      "A felhasználók tapasztalatokat és gondolatokat cserélnek a különböző intelligens otthoni eszközök és rendszerek kényelméről, biztonságáról, megbízhatóságáról és kompatibilitásáról.",
      "Olyan témák is szóba kerülnek, mint az adatvédelmi kérdések, a biztonsági mentési lehetőségek jelentősége, valamint az egyszerűbb, felhasználóbarátabb megoldások iránti igény az otthoni automatizálásban."
    ],
    "points": 374,
    "commentCount": 262,
    "retryCount": 0,
    "time": 1697128277
  },
  {
    "id": 37857544,
    "title": "A tizenkét faktoros alkalmazás (2011)",
    "originLink": "https://12factor.net/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37857544",
    "commentBody": "",
    "originSummary": [
      "A tizenkétfaktoros alkalmazás egy keretrendszer a szoftver-az-a-szolgáltatás alkalmazások létrehozásához, amely az automatizálásra, a hordozhatóságra, a felhőalapú telepítésre, a folyamatos telepítésre és a skálázhatóságra összpontosít.",
      "Ez a módszertan bármilyen programozási nyelvvel és a háttérszolgáltatások bármilyen kombinációjával használható, és számos szempontra vonatkozóan ad útmutatást, többek között a kódbázis szervezésére, a függőségek kezelésére, a konfigurációra, az építési és futtatási szakaszokra, az egyidejűségre, valamint a fejlesztés és a gyártás közötti paritás fenntartására vonatkozóan.",
      "A közreműködők tapasztalatai és megfigyelései alapján készült, és célja az alkalmazásfejlesztés rendszerszintű problémáinak megoldása."
    ],
    "commentSummary": [
      "A beszélgetés középpontjában a Tizenkét-tényezős alkalmazás módszertan és az abban javasolt gyakorlatok állnak a szoftveralkalmazások fejlesztéséhez, olyan területeket érintve, mint a konfiguráció tárolása, a titkok kezelése, a naplók kezelése és az eseményfolyam használata.",
      "A résztvevők eltérő véleményeket fogalmaztak meg a tizenkét faktoros elvek hatékonyságáról és alkalmazhatóságáról, ami vitát eredményezett a gyakorlati megvalósíthatóságról és a biztonsági szempontokról.",
      "Olyan témák is szóba kerülnek, mint a konténerizáció és a Kubernetes, valamint az elvek valós forgatókönyvekben történő végrehajtásának kihívásai, ami jelzi ezen elvek relevanciáját a modern fejlesztési gyakorlatok szempontjából."
    ],
    "points": 358,
    "commentCount": 229,
    "retryCount": 0,
    "time": 1697120386
  },
  {
    "id": 37859311,
    "title": "Nem lehet elbaszni: Alulértékelt oka a tech adósság",
    "originLink": "https://jesseduffield.com/Can%27t-Be-Fcked/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37859311",
    "commentBody": "",
    "originSummary": [
      "A blogbejegyzés szerint a motiváció vélt hiánya vagy lustaság gyakran vezethet technológiai adóssághoz.",
      "A szerző rámutat a szorgalmas, a kódjukat következetesen javító fejlesztők és a saját, bizonyos feladatok halogatására való hajlamuk közötti ellentétre.",
      "A szerző hangsúlyozza az önismeret és az őszinteség jelentőségét a motivációs visszaesések kezelésében, sőt, szükség esetén szüneteket javasol, hogy elkerülje a technikai adósságok kialakulását olyan kifogásokon keresztül, mint az \"idő előtti optimalizálás\" vagy az \"agresszívan csökkentett hatókör\"."
    ],
    "commentSummary": [
      "A cikk a \"Nem lehet kibaszni\" (CBF) mint a technikai adósság lehetséges okát tárgyalja a technológiai szektorban, hangsúlyozva, hogy a magas kamatozású technikai adósságok kezeléséhez jobb megbecsülésre és motivációra van szükség.",
      "Kiemelik a kódhigiénia fenntartásának fontosságát, a különböző típusú technikai adósságok megértését és a régi rendszerek problémáinak kezelését is.",
      "A cikk kitér a kézművesség kulcsszerepére, a fejlesztők és a vállalkozások közötti kapcsolat megszakadására, valamint a szervezeti kultúra hatására a minőség prioritásként való kezelésére a szoftverfejlesztésben."
    ],
    "points": 351,
    "commentCount": 323,
    "retryCount": 0,
    "time": 1697127670
  },
  {
    "id": 37860819,
    "title": "Az OpenAI túl olcsó ahhoz, hogy legyőzzék",
    "originLink": "https://generatingconversation.substack.com/p/openai-is-too-cheap-to-beat",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37860819",
    "commentBody": "",
    "originSummary": [
      "A fő nyelvi modellek (LLM) szolgáltatói, mint például az OpenAI, dominálnak a modellek minősége és a modellek nagy léptékű kiszolgálásának hatékonysága tekintetében.",
      "A cikk az OpenAI platformjának használata a költséghatékonyság mellett érvel a személyes hardveren történő finomhangolással és a modellek kiszolgálásával szemben.",
      "Miközben elriasztja a szervezeteket attól, hogy saját nyílt forráskódú LLM-et telepítsenek a költségek és a bonyolultság miatt, elismeri a nyílt forráskódú modellek jövőjét, mivel azok egyre tömörebbé válnak."
    ],
    "commentSummary": [
      "A cikk az OpenAI különböző aspektusait tárgyalja, például az alacsony költségű modell fenntarthatóságát, a mesterséges intelligencia iparban való versenyképességét, a nyelvi modellek korlátait és az okostelefonok piacán való terjeszkedés lehetséges terveit.",
      "A cikk kitér a különböző vállalatok árképzési stratégiáira, köztük az Uber és a Google árképzési stratégiájára, az OpenAI modelljeinek hatékonyságára és használatához kapcsolódó költségekre, az AI-modellek futtatásához szükséges hardverkövetelményekre és a rendszer korlátaira.",
      "Rávilágít az OpenAI szolgáltatásainak megbízhatóságával és biztonságával kapcsolatos aggályokra, valamint a végfelhasználói eszközön futó, és nem szervereken futó helyi AI-AI előnyeire."
    ],
    "points": 348,
    "commentCount": 375,
    "retryCount": 0,
    "time": 1697134569
  },
  {
    "id": 37857765,
    "title": "Építettem egy virtuális asztallapot a Dungeons and Dragons játékhoz.",
    "originLink": "https://www.diceright.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37857765",
    "commentBody": "",
    "originSummary": [
      "A Diceright egy online platform a Dungeons and Dragons játékhoz, amelyet Ruby on Rails segítségével fejlesztettek ki, és akciókábel segítségével szinkronizálja a pályákat és a tokeneket minden játékos számára.",
      "A HTML canvas és fabric.js segítségével létrehozott felület lehetővé teszi a felhasználók számára, hogy interakcióba lépjenek a térképekkel. A weboldal mobil használatra is optimalizált.",
      "Az alkotó, aki a felhasználói élményt is megtervezte, mellékprojektként állította össze, és nyitott a platformmal kapcsolatos visszajelzésekre és érdeklődésekre."
    ],
    "commentSummary": [
      "A szerző kifejlesztett egy virtuális asztallapot az online Dungeons and Dragons (D&D) játékhoz, amelyet kifejezetten mobileszközökre terveztek.",
      "A felhasználók visszajelzései olyan fejlesztésekhez vezettek, mint a mobil képernyőképek és videók, és a platformot az RPG-játékok terén elért innovációjáért dicsérik.",
      "A beszélgetés kiemeli a táblás és a számítógépes szerepjátékok összehasonlítását, és hangsúlyozza a D&D közösségi történetmesélési aspektusát. Azt is kiemeli, hogy a játék élvezete szempontjából fontos, hogy a játéknak legyen egy kompatibilis Dungeon Master (DM)."
    ],
    "points": 342,
    "commentCount": 101,
    "retryCount": 0,
    "time": 1697121356
  },
  {
    "id": 37859905,
    "title": "Az autógyártók találták ki a szabálytalan gyalogos átkelés bűncselekményét (2015)",
    "originLink": "https://www.vox.com/2015/1/15/7551873/jaywalking-history",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37859905",
    "commentBody": "",
    "originSummary": [
      "A cikk nyomon követi az úthasználati normák átalakulását, amelyet az 1920-as években elsősorban az autógyártó csoportok és gyártók befolyásoltak, hogy a balesetekért való felelősséget a járművezetőkről a gyalogosokra hárítsák.",
      "Ahogy az autók elterjedtsége nőtt, és ezzel együtt a gyalogosok halálos áldozatainak száma is emelkedett, az iparági csoportok hatékonyan támogatták a gyalogosokat a zebrákra korlátozó törvényeket, és a zebrán közlekedők nevetségessé tételére irányuló stratégiákat alkalmaztak.",
      "A \"szabálytalan gyalogos-átkelés\" kifejezést azért alkották meg, hogy az új törvények megszegőit tudatlan és a közbiztonságra veszélyes embereknek bélyegezzék, ami azt mutatja, hogy az autóipar sikeresen megváltoztatta az utcák felfogását, hogy azok a járművek és nem a gyalogosok zónái."
    ],
    "commentSummary": [
      "A szakaszok a gyalogosok biztonságát befolyásoló különböző tényezőkkel foglalkoznak, többek között a szabálytalan gyalogos-átkelésre vonatkozó törvényekkel és az autóközpontú várostervezés hatásával.",
      "A történelmi összefüggéseket megemlítik, és összekapcsolják a közlekedést a faji szegregációval, valamint a lehetséges megoldásokat, például a gyalogosok előnyben részesítését és az alternatív közlekedési módszerek támogatását.",
      "Szó esik továbbá a szabálytalan átkelésre vonatkozó jogszabályok végrehajtásáról, a gyalogosok és az autósok viselkedési mintáiról, valamint a biztonságosabb szabályozás és infrastruktúra iránti felhívásról."
    ],
    "points": 334,
    "commentCount": 272,
    "retryCount": 0,
    "time": 1697130303
  },
  {
    "id": 37865941,
    "title": "A Find My beállítása nem tette tönkre a MacBookomat",
    "originLink": "https://www.tokyodev.com/articles/not-setting-up-find-my-bricked-my-macbook",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37865941",
    "commentBody": "",
    "originSummary": [
      "A szerző elmeséli, hogy a reptéri biztonsági ellenőrzésen véletlenül elcserélte új MacBook Air készülékét valakivel, és miután visszaszerezte, felfedezte, hogy aktiválva van rajta egy aktiválási zár.",
      "Többszöri kérés ellenére az Apple nem reagált az aktiválási zár letiltásához nyújtott segítségre, ami a szerzőt arra késztette, hogy kritizálja az Apple szigorú irányelveit és a nem megfelelő ügyfélszolgálatot.",
      "Egy jó tanácsként a szerző azt javasolja a MacBook felhasználóknak, hogy engedélyezzék a \"Find My\" funkciót a készülékeiken, hogy elkerüljék a hasonló problémákat."
    ],
    "commentSummary": [
      "A beszélgetések az Apple termékekkel kapcsolatos különböző témákat ölelnek fel, például az AirPods szoftverhibáit, a Bluetooth fejhallgatók előnyeit és hátrányait, valamint az ügyfélszolgálattal kapcsolatos tapasztalatokat.",
      "A felhasználók olyan biztonsági intézkedéseket is megvitatnak, mint az aktiválási zár, a Macbookokra vonatkozó importvámok és adók, beleértve az Apple Activation Lock funkciójának hatékonyságát és kényelmetlenségét.",
      "Ezek a viták olyan platformok, amelyeken a felhasználók megoszthatják egymással frusztrációikat, személyes tapasztalataikat és véleményüket a fenti kérdésekkel kapcsolatban."
    ],
    "points": 279,
    "commentCount": 377,
    "retryCount": 0,
    "time": 1697164993
  },
  {
    "id": 37857231,
    "title": "Mutasd meg a félkész projekted",
    "originLink": "https://news.ycombinator.com/item?id=37857231",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37857231",
    "commentBody": "",
    "originSummary": [
      "A nyilatkozat azt szorgalmazza, hogy az egyének korán és gyakran indítsák el projektjeiket, függetlenül azok tökéletességétől vagy felkészültségétől.",
      "Ez aláhúzza a \"gyors kudarc\" és az iteráció jelentőségét, egy olyan koncepciót, amely a gyors kudarcok és az ebből következő fejlesztések révén történő tanulás bajnoka.",
      "Az üzenet továbbá támogatást és segítséget nyújt a projekteknek, induló vállalkozásoknak vagy ötleteknek, megerősítve az innováció és a fejlesztés támogatását."
    ],
    "commentSummary": [
      "Ez a bejegyzés egy fórumtéma digitális bevonásainak gyűjteménye, ahol az emberek visszajelzés és lehetséges fejlesztések céljából cserélik ki szoftverprojektjeiket.",
      "A bemutatott projektek változatosak, többek között egy digitális hangyafarm-játék, egy ukulele akkordokat tanuló alkalmazás, különböző webalapú eszközök és bővítmények, egy streaming szolgáltatás felhasználói felülete és egy jogi dokumentumok keresőmotorja.",
      "A beszélgetések középpontjában a projektek jellemzőinek és céljainak megvitatása, valamint a finomítási lehetőségek és a lehetséges együttműködések feltárása áll."
    ],
    "points": 270,
    "commentCount": 477,
    "retryCount": 0,
    "time": 1697119118
  },
  {
    "id": 37862606,
    "title": "Egy játék, egy ember által, hat platformon: A jó, a rossz és a csúnya",
    "originLink": "https://ruoyusun.com/2023/10/12/one-game-six-platforms.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37862606",
    "commentBody": "",
    "originSummary": [
      "A szerző megosztotta tapasztalatait a különböző platformok, köztük a web, a Windows, a macOS és a Linux támogatásával kapcsolatban az Industry Idle című játékukkal kapcsolatban, valamint az egyes platformok által támasztott kihívásokról.",
      "Megvitatja a Valve azon döntésének hatását, hogy a Counter-Strike 2 nem támogatja tovább a macOS-t, valamint a csalással és a platformspecifikus problémákkal kapcsolatos kérdéseket.",
      "Betekintést nyújt a több platform támogatásának költség- és bevételi vonzataiba, a küzdelmekbe, amelyekkel egyszemélyes indie fejlesztőként szembesültek, valamint a jobb döntések meghozatalára és a munkaterhelés kiegyensúlyozására irányuló törekvéseikbe a jövőbeli projektek során."
    ],
    "commentSummary": [
      "A téma a platformok közötti játékfejlesztés akadályaival és korlátaival foglalkozik, beleértve a webböngészők, a böngészőalapú technológiák és a natív alkalmazások alkalmazását.",
      "Kitér a HTML5-ös játékok helyi tárolásával kapcsolatos problémákra, az iOS Safari rendszerben történő hibakeresésre, valamint a játékok Linux és macOS platformokra való átültetésének kihívásaira.",
      "Végül a Steam és a Proton különböző platformokon történő játékhasználatáról, valamint a játék karbantartásával kapcsolatos aggályokról is szó esik."
    ],
    "points": 261,
    "commentCount": 107,
    "retryCount": 0,
    "time": 1697141686
  },
  {
    "id": 37859402,
    "title": "EU \"Chat Control\" és kötelező ügyféloldali szkennelés",
    "originLink": "https://berthub.eu/articles/posts/client-side-scanning-dutch-parliament/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37859402",
    "commentBody": "",
    "originSummary": [
      "A holland parlament meghallgatást tartott az EU \"Chatcontrol\" javaslatáról, amely a kliensoldali szkennelésre vonatkozik; ez a vitatott technológia a magánüzeneteket vizsgálja, ami esetleg indokolatlan vizsgálatokhoz vezethet.",
      "A holland kormány a parlamenti ellenállás ellenére két indítványt is benyújtott, és úgy döntött, hogy figyelmen kívül hagyja azokat, így továbbra is törekszik az említett technológiára.",
      "A meghallgatáson elhangzott aggályok nemcsak a magánbeszélgetésekbe való behatolással, hanem a technológia nem bizonyított hatékonyságával kapcsolatban is felmerültek, és további figyelmeztetés hangzott el a Kínával való esetleges együttműködéstől ezen a területen."
    ],
    "commentSummary": [
      "Az EU fontolgatja a \"Chat Control\" elnevezésű törvényjavaslatot, amely előírja a gyermekek szexuális zaklatását tartalmazó anyagok (CSAM) keresését, ami potenciális vitákat vált ki a magánélet védelmének megsértéséről.",
      "A kritikusok attól tartanak, hogy ez az eszkalálódott szkennelés előfutára lehet, és aggodalmakat vet fel az Europol ezen adatokhoz való hozzáférése és azok ellenőrizetlen rendőrségi mesterséges intelligencia felhasználása miatt.",
      "A viták kiterjednek az üzenetküldő platformokra gyakorolt hatásokra, az iparági felelősségre és az autonóm járművek ellenőrzésére is, tükrözve a magánélet védelmével, a kormányzati túlkapásokkal és a különböző iparágak szerepével kapcsolatos széles körű aggodalmakat a bűnözés megfékezésében."
    ],
    "points": 249,
    "commentCount": 93,
    "retryCount": 0,
    "time": 1697128114
  },
  {
    "id": 37856895,
    "title": "Az Atlassian közel 1 milliárd dollárért megvásárolja a Loom-ot",
    "originLink": "https://www.reuters.com/markets/deals/atlassian-agrees-buy-video-messaging-provider-loom-nearly-1-bln-2023-10-12/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37856895",
    "commentBody": "",
    "originSummary": [
      "Az Atlassian szoftvercég bejelentette, hogy mintegy 975 millió dollárért felvásárolta a Loom videó üzenetküldő platformot, amely megerősíti a csoportos együttműködés eszközeit, és lehetővé teszi a videó integrálását a munkafolyamatokba.",
      "A több mint 25 millió globális felhasználóval rendelkező Loom beépül az Atlassian szoftverekbe, mint például a Jira és a Confluence, és a felvásárlás várhatóan 2024 márciusáig lezárul.",
      "Bár a meglévő készpénzállományból finanszírozzák, az Atlassian előrejelzése szerint az akvizíció a 2024 és 2025 júniusában végződő pénzügyi évekre vonatkozóan a működési árrés felhígulását fogja okozni."
    ],
    "commentSummary": [
      "Az Atlassian szoftverfejlesztő cég a Loom, egy videó üzenetküldő szolgáltatás megvásárlását tervezi.",
      "A felvásárlás becsült értéke körülbelül 1 milliárd dollár.",
      "Ez a fejlesztés az Atlassian terjeszkedését jelenti a videó üzenetküldés területén."
    ],
    "points": 229,
    "commentCount": 3,
    "retryCount": 0,
    "time": 1697117638
  },
  {
    "id": 37861589,
    "title": "Az Nginx termékeket érintő HTTP/2 rapid reset támadás",
    "originLink": "https://www.nginx.com/blog/http-2-rapid-reset-attack-impacting-f5-nginx-products/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37861589",
    "commentBody": "",
    "originSummary": [
      "A HTTP/2 protokollban olyan sebezhetőséget találtak, amely az NGINX Open Source, NGINX Plus és a kapcsolódó termékek ellen irányuló, az NGINX HTTP/2 modult érintő szolgáltatásmegtagadási támadásra használható.",
      "A sebezhetőség lehetővé teszi a támadó számára, hogy gyorsan töröljön számos HTTP/2 adatfolyamot, és ezáltal túlterhelje a kiszolgálót anélkül, hogy a konfigurált küszöbértéket elérné.",
      "Az NGINX kiadott egy javítást ennek a sebezhetőségnek a kezelésére, amely javítja a rendszer stabilitását azáltal, hogy korlátozza az új adatfolyamok számát egy eseményhurokban. Azt tanácsolják a felhasználóknak, hogy frissítsenek a legújabb csomagokra, és a további védelem érdekében módosítsák a konfigurációs fájlokat. Az egyes kliensek kapcsolatainak és kéréseinek korlátozása is javasolt. A Cloudflare, az Amazon és a Google segített a sebezhetőség enyhítésében."
    ],
    "commentSummary": [
      "A HTTP/2 rapid reset támadás az Nginx termékeket is érinti, de alapértelmezés szerint az Nginx védelmet nyújt ellene, hacsak bizonyos konfigurációkat nem módosítanak.",
      "A diskurzus az NGINX-re és más webszerverekre gyakorolt hatása körül kering, a vélemények megoszlanak: egyesek aggódnak a következményei miatt, míg mások úgy vélik, hogy elsősorban a nem szabványos beállításokat befolyásolja.",
      "A beszélgetés kiterjed a HTTP-verziókra, a kiszolgálói korlátozásokra, a reklámblokkolók használatára, valamint az időben történő frissítések és javítások jelentőségére, a sebezhetőség különböző beállítások közötti lehetséges hatására összpontosítva."
    ],
    "points": 217,
    "commentCount": 48,
    "retryCount": 0,
    "time": 1697137490
  }
]
