[
  {
    "id": 41484991,
    "title": "QUIC không đủ nhanh trên mạng internet tốc độ cao",
    "originLink": "https://dl.acm.org/doi/10.1145/3589334.3645323",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41484991",
    "commentBody": "",
    "originSummary": [
      "Một nghiên cứu gần đây tiết lộ rằng QUIC, một giao thức được thiết kế để cải thiện hiệu suất internet, cho thấy mức giảm tốc độ dữ liệu lên đến 45,2% so với TCP+TLS+HTTP/2 truyền thống trên các mạng tốc độ cao.",
      "Khoảng cách hiệu suất được cho là do chi phí xử lý cao ở phía nhận, đặc biệt là do gói dữ liệu quá nhiều và các xác nhận (ACKs) trong không gian người dùng của QUIC.",
      "Những phát hiện này có ý nghĩa quan trọng đối với các ứng dụng như chuyển tập tin, phát trực tuyến video và duyệt web, với các khuyến nghị được đưa ra để giảm thiểu những vấn đề này."
    ],
    "commentSummary": [
      "QUIC gặp phải các vấn đề về hiệu suất trên internet nhanh do giao diện syscall không hiệu quả, chi phí syscall cao từ việc giảm thiểu spectre, bộ đệm UDP mặc định nhỏ và tối ưu hóa ngăn xếp UDP phức tạp.",
      "GSO (Generic Segmentation Offload) có thể cải thiện hiệu suất nhưng không tối ưu cho các máy chủ quy mô lớn, cho thấy cần có các API tốt hơn để thay thế BSD sockets/POSIX.",
      "Thảo luận nhấn mạnh sự phức tạp của việc tích hợp io_uring và những lợi ích tiềm năng của các API cấp cao được xây dựng trên nó, làm nổi bật sự cân bằng giữa tính linh hoạt của không gian người dùng và hiệu quả ở mức nhân."
    ],
    "points": 605,
    "commentCount": 276,
    "retryCount": 0,
    "time": 1725849255
  },
  {
    "id": 41483675,
    "title": "Đòi lại Ngăn xếp",
    "originLink": "https://reclaim-the-stack.com",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41483675",
    "commentBody": "",
    "originSummary": [
      "Trang web Mynewsdesk.com đã phát triển một nền tảng dựa trên Kubernetes để thay thế Heroku, dẫn đến giảm 90% chi phí và cải thiện 30% hiệu suất cho sản phẩm SaaS của họ.",
      "Những nền tảng mới đã nâng cao trải nghiệm của nhà phát triển với thời gian triển khai nhanh hơn và công cụ cải tiến.",
      "Ngăn xếp đã được mã nguồn mở, cho phép người khác nhanh chóng tái tạo thành công của họ bằng cách làm theo tài liệu được cung cấp và tham gia vào máy chủ Discord của họ."
    ],
    "commentSummary": [
      "Reclaim the Stack báo cáo giảm 90% chi phí và tăng 30% hiệu suất bằng cách chuyển từ Heroku sang Kubernetes.",
      "Người dùng cho rằng những khoản tiết kiệm này đi kèm với sự phức tạp gia tăng, đòi hỏi nhiều bảo trì, giám sát và chuyên môn đặc biệt hơn trong việc quản lý Kubernetes và các hệ thống liên quan.",
      "Những người phê bình đề xuất xem xét các thiết lập VM đơn giản hơn, các dịch vụ được quản lý, hoặc các nhà cung cấp PaaS khác như Render hoặc Fly.io, nhấn mạnh sự đánh đổi giữa chi phí, độ phức tạp và kiến thức quản lý hạ tầng."
    ],
    "points": 463,
    "commentCount": 289,
    "retryCount": 0,
    "time": 1725833462
  },
  {
    "id": 41483581,
    "title": "FBI khuyến nghị sử dụng trình chặn quảng cáo (2022)",
    "originLink": "https://www.ic3.gov/Media/Y2022/PSA221221",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41483581",
    "commentBody": "",
    "originSummary": [
      "FBI đã đưa ra cảnh báo về việc tội phạm mạng sử dụng quảng cáo trên công cụ tìm kiếm để giả mạo các thương hiệu, dẫn người dùng đến các trang web độc hại chứa ransomware và đánh cắp thông tin nhạy cảm.",
      "Tin tặc mua quảng cáo giả mạo các doanh nghiệp hợp pháp, xuất hiện ở đầu kết quả tìm kiếm, lừa người dùng truy cập vào các trang web giả và tải xuống phần mềm độc hại.",
      "Biện pháp phòng ngừa bao gồm xác minh URL, sử dụng trình chặn quảng cáo, và các doanh nghiệp giáo dục người dùng về các trang web giả mạo và URL chính xác."
    ],
    "commentSummary": [
      "FBI đã khuyến nghị sử dụng các trình chặn quảng cáo để tăng cường bảo mật trực tuyến và cải thiện trải nghiệm người dùng bằng cách ngăn chặn các quảng cáo xâm nhập và có thể gây hại.",
      "Mặc dù có những lợi ích, một số người cho rằng các trình chặn quảng cáo làm suy yếu mô hình doanh thu của nhiều trang web, vốn phụ thuộc vào thu nhập từ quảng cáo.",
      "Những người dùng am hiểu công nghệ đồng ý rằng lợi ích của việc sử dụng trình chặn quảng cáo vượt trội hơn so với những nhược điểm tiềm ẩn."
    ],
    "points": 281,
    "commentCount": 202,
    "retryCount": 0,
    "time": 1725832677
  },
  {
    "id": 41483434,
    "title": "Thời lượng giấc ngủ, kiểu giấc ngủ, các yếu tố sức khỏe và lối sống ảnh hưởng đến nhận thức [pdf]",
    "originLink": "https://bmjpublichealth.bmj.com/content/bmjph/2/1/e001000.full.pdf",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41483434",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Một nghiên cứu chỉ ra rằng thời gian ngủ bình thường (7-9 giờ) có liên quan đến hiệu suất nhận thức tốt hơn, trong khi ngủ quá nhiều có thể gây ra các tác động tiêu cực.",
      "Việc tiêu thụ rượu có mối quan hệ phức tạp với nhận thức; những người kiêng rượu thường có điểm số thấp hơn trong các bài kiểm tra nhận thức so với những người uống rượu vừa phải.",
      "Cuộc thảo luận cũng khám phá cách tuổi tác, sức khỏe và trải nghiệm cá nhân ảnh hưởng đến quá trình chuyển hóa rượu và chức năng nhận thức."
    ],
    "points": 254,
    "commentCount": 170,
    "retryCount": 0,
    "time": 1725831432
  },
  {
    "id": 41483654,
    "title": "Việc sạc pin lithium-ion với dòng điện cao trước tiên làm tăng tuổi thọ lên 50%",
    "originLink": "https://www.eurekalert.org/news-releases/1056171",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41483654",
    "commentBody": "",
    "originSummary": [
      "Những nhà nghiên cứu tại Trung tâm Pin SLAC-Stanford đã phát hiện rằng sạc pin lithium-ion với dòng điện cao trước khi chúng rời khỏi nhà máy nhanh hơn 30 lần và tăng tuổi thọ của chúng lên 50%.",
      "Cuộc nghiên cứu, được công bố trên tạp chí Joule, nhấn mạnh rằng quá trình sạc hình thành, lần sạc đầu tiên mà pin nhận được, là rất quan trọng đối với hiệu suất và tuổi thọ của nó.",
      "Bằng cách sử dụng học máy khoa học, nghiên cứu đã xác định nhiệt độ và dòng điện là những yếu tố then chốt, với những tác động đáng kể đến việc nâng cao hiệu quả và hiệu suất sản xuất pin."
    ],
    "commentSummary": [
      "Việc sạc pin lithium-ion với dòng điện cao ban đầu có thể tăng tuổi thọ của chúng lên 50%, mặc dù tuyên bố này đang được tranh luận giữa các chuyên gia trong ngành.",
      "Những mối quan ngại bao gồm tác động đến trở kháng của pin, dung lượng và hiệu quả của quản lý nhiệt trong các thương hiệu xe điện khác nhau.",
      "Cuộc thảo luận cũng khám phá những lợi ích tiềm năng của các kiến trúc điện áp cao hơn và sự đánh đổi giữa tuổi thọ pin và tốc độ sạc."
    ],
    "points": 237,
    "commentCount": 97,
    "retryCount": 0,
    "time": 1725833204
  },
  {
    "id": 41484981,
    "title": "Đã xác nhận: API chính thức của Reflection 70B là một lớp bao bọc cho Sonnet 3.5",
    "originLink": "https://old.reddit.com/r/LocalLLaMA/s/4Ly2yj78aM",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41484981",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "API chính thức của Reflection 70B chỉ là một lớp bao bọc cho mô hình Sonnet 3.5 hiện có, không phải là một mô hình AI mới.",
      "Việc phát hành đã không có tổ chức, với các trọng lượng bị dán nhãn sai, các đánh giá không nhất quán, và cuối cùng sử dụng Sonnet 3.5 và sau đó là GPT-4o.",
      "Việc Sahil Chaudhary và Matt Shumer tham gia, với Shumer quảng bá mô hình mặc dù có vấn đề, đã gây ra sự nhầm lẫn và lãng phí thời gian trong cộng đồng AI."
    ],
    "points": 224,
    "commentCount": 61,
    "retryCount": 0,
    "time": 1725849054
  },
  {
    "id": 41483216,
    "title": "Ngôn ngữ lập trình Fennel",
    "originLink": "https://fennel-lang.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41483216",
    "commentBody": "",
    "originSummary": [
      "Fennel là một ngôn ngữ lập trình kết hợp sự đơn giản và tốc độ của Lua với cú pháp và hệ thống macro của Lisp, cung cấp khả năng tương thích hoàn toàn với Lua và không có chi phí phụ trội.",
      "Đa năng, phù hợp cho các ứng dụng như trò chơi điện tử, máy chủ web và vi điều khiển, và hỗ trợ các macro thời gian biên dịch.",
      "Đã có sẵn tài liệu toàn diện và các nguồn tài nguyên cộng đồng, bao gồm hướng dẫn cài đặt, hướng dẫn sử dụng và quy tắc ứng xử, với các phiên bản từ v0.1.0 đến v1.5.1."
    ],
    "commentSummary": [
      "Ngôn ngữ lập trình Fennel được công nhận vì những tiến bộ kỹ thuật và cải tiến so với Lua, đặc biệt là đối với các dự án lớn.",
      "Fennel giới thiệu các tính năng như khớp mẫu và hệ thống macro mạnh mẽ, tăng cường tính linh hoạt và dễ sử dụng, đặc biệt trong các cơ sở mã cũ.",
      "Its integration with Lua's module loader allows seamless mixing of tables and functions, and its Lisp syntax with a minimal learning curve makes it popular among developers."
    ],
    "points": 224,
    "commentCount": 71,
    "retryCount": 0,
    "time": 1725829600
  },
  {
    "id": 41489167,
    "title": "ESPN tóm tắt trận đấu cuối cùng của cầu thủ giải nghệ do AI tạo ra không đề cập đến họ",
    "originLink": "https://awfulannouncing.com/espn/alex-morgan-ai-generated-recap-mention.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41489167",
    "commentBody": "",
    "originSummary": [
      "ESPN đã tạo ra một bản tóm tắt bằng AI về trận đấu chuyên nghiệp cuối cùng của Alex Morgan nhưng ban đầu lại không đề cập đến cô, thay vào đó tập trung vào đồng đội Kennedy Wesley.",
      "Việc bỏ sót nhấn mạnh những hạn chế của AI trong việc nắm bắt đầy đủ bối cảnh cảm xúc và lịch sử của các sự kiện quan trọng.",
      "ESPN sau đó đã cập nhật bản tóm tắt để bao gồm Morgan và đăng một bài viết riêng, ít nổi bật hơn về trận đấu cuối cùng của cô ấy."
    ],
    "commentSummary": [
      "Phần tóm tắt trận đấu cuối cùng của một cầu thủ sắp giải nghệ do AI của ESPN tạo ra đã không đề cập đến cầu thủ này, dẫn đến sự chỉ trích và làm nổi bật những thiếu sót trong nội dung do AI tạo ra.",
      "Vụ việc này nhấn mạnh rằng mặc dù AI có thể tạo ra nội dung nhanh chóng, nhưng nó thường thiếu bối cảnh và chiều sâu cảm xúc mà các nhà văn con người mang lại.",
      "Việc này nhấn mạnh sự cần thiết của sự giám sát của con người để duy trì chất lượng và độ chính xác trong các bài viết do AI tạo ra."
    ],
    "points": 223,
    "commentCount": 135,
    "retryCount": 0,
    "time": 1725894152
  },
  {
    "id": 41490161,
    "title": "Vì sao GitHub chiến thắng",
    "originLink": "https://blog.gitbutler.com/why-github-actually-won/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41490161",
    "commentBody": "",
    "originSummary": [
      "Thành công của GitHub được cho là nhờ vào việc ra mắt kịp thời trong thời kỳ phát triển của các công cụ kiểm soát phiên bản phân tán và tập trung vào việc nâng cao trải nghiệm của nhà phát triển hơn là lợi ích thương mại.",
      "Phương pháp tiếp cận người dùng của GitHub, nhấn mạnh vào các yêu cầu kéo và sự hấp dẫn về mặt thẩm mỹ đã làm cho nó khác biệt so với các đối thủ cạnh tranh như Google Code và BitBucket.",
      "Việc cộng đồng Linux chấp nhận Git và sự hỗ trợ sớm từ cộng đồng Ruby đã đóng vai trò quan trọng trong việc phổ biến GitHub."
    ],
    "commentSummary": [
      "Google Code được tạo ra để ngăn chặn SourceForge độc quyền thị trường, không phải để thống trị nó.",
      "Google Code đã bị đóng cửa sau khi đạt được mục tiêu thúc đẩy cạnh tranh, mở đường cho các nền tảng như GitHub phát triển mạnh mẽ.",
      "Cuộc thảo luận nhấn mạnh những lo ngại về tuổi thọ của các sản phẩm của Google và tầm quan trọng của thời gian và trải nghiệm người dùng trong sự thành công của GitHub."
    ],
    "points": 200,
    "commentCount": 197,
    "retryCount": 0,
    "time": 1725899249
  },
  {
    "id": 41484337,
    "title": "ATProto cho các kỹ sư hệ thống phân tán",
    "originLink": "https://atproto.com/articles/atproto-for-distsys-engineers",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41484337",
    "commentBody": "",
    "originSummary": [
      "AT Protocol, được phát triển bởi Bluesky, được thiết kế cho mạng xã hội mở, tập trung vào kỹ thuật backend phi tập trung.",
      "Những backend web truyền thống gặp phải vấn đề về khả năng mở rộng với các cơ sở dữ liệu SQL, dẫn đến việc áp dụng các cụm NoSQL và kiến trúc xử lý luồng.",
      "AT Protocol phi tập trung hóa các backend quy mô lớn bằng cách sử dụng các API công khai cho các dịch vụ nội bộ và thiết lập một mô hình dữ liệu chia sẻ gọi là \"kho dữ liệu người dùng,\" chứa các tài liệu JSON được ký mã hóa."
    ],
    "commentSummary": [
      "ATProto là một đặc tả toàn diện, từ dưới lên cho các hệ thống phi tập trung, trái ngược với ActivityPub, vốn để lại nhiều khía cạnh cho việc triển khai.",
      "ATProto sử dụng mô hình dữ liệu riêng thay vì JSON-LD, điều này có thể là một trở ngại đối với một số nhà phát triển.",
      "Đã phát hành một hướng dẫn mới về việc tạo ứng dụng tối giản với ATProto, nêu bật hệ sinh thái đang phát triển và các ứng dụng thực tiễn của nó."
    ],
    "points": 191,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1725840241
  },
  {
    "id": 41483789,
    "title": "Thói Quen Trước Khi Ngủ Của Linux",
    "originLink": "https://tookmund.com/2024/09/hibernation-preparation",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41483789",
    "commentBody": "",
    "originSummary": [
      "Bài viết giải thích quá trình ngủ đông trong Linux, tập trung vào phiên bản 6.9.9, từ việc khởi động chế độ ngủ đông đến việc đồng bộ hóa hệ thống tệp vào đĩa.",
      "Những điểm nhập chính để kiểm soát chế độ ngủ và chế độ ngủ đông là `/sys/power/state` và `/sys/power/disk`, với các giá trị cụ thể được ghi vào các tệp này để khởi tạo các trạng thái ngủ.",
      "Hệ thống ngủ đông bao gồm nhiều bước, bao gồm cấu hình nhân, kiểm tra tính khả dụng, kiểm tra nén, thu nhận khóa, chuẩn bị bảng điều khiển, thông báo quản lý năng lượng, và đồng bộ hóa hệ thống tệp."
    ],
    "commentSummary": [
      "Những vấn đề quản lý năng lượng của Linux đã được khám phá, đặc biệt tập trung vào các cơ chế ngủ đông và tạm dừng, theo các đường dẫn mã khác nhau.",
      "Đã xác định một sự cố do không đủ RAM hệ thống trống để chứa toàn bộ VRAM, dẫn đến việc phân bổ bộ nhớ thất bại trong quá trình ngủ hoặc tiếp tục, gây ra các trạng thái hệ thống không xác định.",
      "Bài thảo luận nêu bật những phức tạp và các vấn đề tiềm ẩn với quản lý năng lượng của Linux, bao gồm việc xử lý VRAM và vai trò của systemd trong việc quản lý các quy trình này."
    ],
    "points": 188,
    "commentCount": 24,
    "retryCount": 0,
    "time": 1725834680
  },
  {
    "id": 41482679,
    "title": "Htmx, Raku và Pico CSS",
    "originLink": "https://rakujourney.wordpress.com/2024/09/08/htmx-raku-and-pico-css/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41482679",
    "commentBody": "",
    "originSummary": [
      "Đây là một phần của loạt bài tập trung vào việc giảm tải nhận thức trong các dự án web bằng cách sử dụng các phương pháp phát triển web đơn giản hơn, cụ thể là HTMX, Raku và Cro cho việc lắp ráp HTML backend và các API RESTful, loại bỏ nhu cầu sử dụng JavaScript trong nội dung động.",
      "HTMX rất linh hoạt cho hầu hết các dự án nhưng không phù hợp cho các ứng dụng web phức tạp; Pico CSS được khuyến nghị cho việc tạo kiểu do nhấn mạnh vào HTML ngữ nghĩa, điều này đơn giản hóa quá trình phát triển.",
      "Đoạn bài viết bao gồm các ví dụ mã sử dụng Pico CSS để tái tạo các ví dụ HTMX cho Raku/Cro, với mã cuối cùng có sẵn trên GitHub, và nhấn mạnh chế độ tối tích hợp sẵn của Pico CSS."
    ],
    "commentSummary": [
      "HTMX được nhấn mạnh vì khả năng đơn giản hóa các ứng dụng web bằng cách giữ quản lý trạng thái ở phía máy chủ, giảm nhu cầu sử dụng JavaScript (JS) phía khách hàng một cách rộng rãi.",
      "Người dùng thảo luận về những đánh đổi giữa HTMX và các framework frontend hiện đại như React, lưu ý rằng HTMX có thể hiệu quả hơn cho các ứng dụng kinh doanh đơn giản nhưng có thể thiếu một số chức năng giao diện người dùng.",
      "Cuộc trò chuyện bao gồm các so sánh với các công nghệ khác như Next.js, Blazor và Phoenix LiveView, nhấn mạnh rằng HTMX cung cấp một cách tiếp cận khác có thể có lợi cho các trường hợp sử dụng cụ thể, đặc biệt là đối với các nhà phát triển fullstack ưa thích logic backend."
    ],
    "points": 177,
    "commentCount": 136,
    "retryCount": 0,
    "time": 1725825080
  },
  {
    "id": 41482661,
    "title": "Jd – So sánh và vá JSON",
    "originLink": "https://github.com/josephburnett/jd",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41482661",
    "commentBody": "",
    "originSummary": [
      "JSON diff and patch (jd) là một tiện ích dòng lệnh và thư viện Go để so sánh và chỉnh sửa các giá trị JSON và YAML, hỗ trợ nhiều định dạng như jd, JSON Merge Patch (RFC 7386), và một phần của JSON Patch (RFC 6902).",
      "Tuỳ chọn cài đặt bao gồm Homebrew, Go install, GitHub releases, và Docker, với giao diện web có sẵn tại jd-tool.io hoặc cục bộ qua `jd -port 8080`.",
      "Những tính năng chính bao gồm so sánh màu, áp dụng bản vá, chuyển hướng đầu ra, xử lý mảng dưới dạng tập hợp hoặc đa tập hợp, hỗ trợ YAML và dịch định dạng."
    ],
    "commentSummary": [
      "Jd là một công cụ để so sánh và vá các tệp JSON, được tạo ra bởi Joseph Burnett, và nhằm bổ sung cho `jq` bằng cách xử lý thứ tự của các mảng JSON.",
      "Đã cập nhật công cụ để giải quyết các vấn đề liên quan đến việc phát hiện các phần tử bị thiếu trong các tệp JSON lớn, với API v2 mới tính toán dãy con chung dài nhất của hai mảng.",
      "Người dùng đã thấy Jd hữu ích cho các nhiệm vụ như kiểm tra snapshot thủ công, gỡ lỗi phản hồi API, và so sánh các tệp JSON lớn, với các đề xuất cải tiến thêm như thêm cú pháp truy vấn jq và tạo một tiện ích mở rộng cho VSCode."
    ],
    "points": 173,
    "commentCount": 28,
    "retryCount": 0,
    "time": 1725824916
  },
  {
    "id": 41488353,
    "title": "Kim cương tổng hợp hiện nay tinh khiết hơn, đẹp hơn và rẻ hơn so với kim cương khai thác",
    "originLink": "https://worksinprogress.co/issue/lab-grown-diamonds/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41488353",
    "commentBody": "",
    "originSummary": [
      "Kim cương nhân tạo, lần đầu tiên được tổng hợp vào những năm 1950, hiện nay rẻ hơn, tinh khiết hơn và chiếm lĩnh thị trường công nghiệp, mang lại một sự thay thế hiệu quả về chi phí và chất lượng cao so với kim cương khai thác.",
      "Hóa hơi lắng đọng hóa học (CVD) là một phương pháp được phát triển vào những năm 1950 để sản xuất kim cương, cho phép kiểm soát chính xác và tùy chỉnh các tính chất của kim cương, làm cho chúng phù hợp với nhiều ứng dụng công nghiệp khác nhau.",
      "Những tiến bộ trong sản xuất kim cương tiếp tục mở ra những ứng dụng mới và cải thiện các ứng dụng hiện có, thể hiện sự sáng tạo của con người trong việc nâng cao các quá trình tự nhiên."
    ],
    "commentSummary": [
      "Sự phát triển công nghệ đã làm cho kim cương tổng hợp trở nên tinh khiết hơn, đẹp mắt hơn và có giá cả phải chăng hơn so với kim cương tự nhiên.",
      "Máy móc để sản xuất kim cương tổng hợp hiện có giá khoảng 200.000 đô la, và các công ty như Element Six của De Beers đang bán chúng cho các mục đích công nghiệp.",
      "Kim cương nhân tạo và moissanite có giá rẻ hơn đáng kể, với kim cương nhân tạo có giá dưới $200 mỗi carat và moissanite dưới $5 mỗi carat, làm cho kim cương trở nên dễ tiếp cận hơn và mở rộng các ứng dụng công nghiệp của chúng."
    ],
    "points": 170,
    "commentCount": 107,
    "retryCount": 0,
    "time": 1725888642
  },
  {
    "id": 41491121,
    "title": "Apple Hearing Study chia sẻ những hiểu biết sơ bộ về chứng ù tai",
    "originLink": "https://www.apple.com/newsroom/2024/05/apple-hearing-study-shares-preliminary-insights-on-tinnitus/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41491121",
    "commentBody": "",
    "originSummary": [
      "Nhà nghiên cứu từ Đại học Michigan đã công bố dữ liệu từ một cuộc khảo sát lớn về chứng ù tai với sự tham gia của hơn 160.000 người, nhằm cải thiện sự hiểu biết và quản lý tình trạng này.",
      "Những phát hiện chính bao gồm 77,6% người tham gia đã trải qua chứng ù tai, với 15% trải qua hàng ngày, và tỷ lệ phổ biến tăng theo tuổi, đặc biệt là ở những người từ 55 tuổi trở lên.",
      "Cuộc nghiên cứu, một phần của ứng dụng Nghiên cứu của Apple, nêu bật các phương pháp quản lý phổ biến và nguyên nhân, và nhằm mục đích nâng cao hiểu biết về tiếp xúc âm thanh và tác động của nó đến sức khỏe thính giác."
    ],
    "commentSummary": [
      "Cuộc nghiên cứu về thính giác của Apple cung cấp những hiểu biết sơ bộ về chứng ù tai, nhấn mạnh các khía cạnh tâm lý và trải nghiệm cá nhân của người dùng.",
      "Những lời khuyên quan trọng bao gồm tránh suy nghĩ quá nhiều, sử dụng các biện pháp phân tâm, và quản lý căng thẳng và căng cơ, với một số người dùng tìm thấy sự nhẹ nhõm thông qua máy trợ thính hoặc giải quyết các vấn đề sức khỏe.",
      "Cuộc nghiên cứu cũng khám phá các tác động tiềm năng của các thiết bị âm thanh hiện đại như AirPods đối với chứng ù tai, với những ý kiến trái chiều từ người dùng."
    ],
    "points": 132,
    "commentCount": 64,
    "retryCount": 0,
    "time": 1725903382
  }
]
