[
  {
    "id": 41146239,
    "title": "نفدت لدينا الأعمدة",
    "originLink": "https://jimmyhmiller.github.io/ugliest-beautiful-codebase",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41146239",
    "commentBody": "",
    "originSummary": [
      "يصف كتاب جيمي ميلر \"نفدت لدينا الأعمدة\" أول وظيفة له في مجال البرمجيات وقاعدة الشيفرة الفوضوية ولكن المثيرة للاهتمام، مسلطًا الضوء على جدول قاعدة البيانات المسمى Merchants الذي نفدت لديه الأعمدة، مما أدى إلى إنشاء Merchants2.",
      "كانت قاعدة الشيفرة مزيجًا من VB وC# ومختلف أطر عمل JavaScript والعديد من خدمات SOAP، مع وجود مشكلات ملحوظة مثل عدم قيام أحد المطورين بإدخال الشيفرة، مما تسبب في أخطاء يصعب تتبعها.",
      "على الرغم من الفوضى، أتاح الكود الأساسي حل المشكلات بطرق إبداعية، حيث قام المطورون بابتكار حلولهم الخاصة، مما أدى إلى نظام مفكك واتصال فريد ومباشر مع المستخدمين."
    ],
    "commentSummary": [
      "شارك مطور تجربته مع قاعدة شيفرة غير منظمة في شركته الأولى، والتي كانت تفتقر إلى التحكم في الإصدارات وتحتوي على العديد من المتغيرات العالمية.",
      "تم إصلاح الأخطاء عن طريق تثبيت Visual Studio في مواقع العملاء وتشغيل التطبيق في وضع التصحيح، مما أدى إلى وجود نسخ متعددة بأسماء غير متسقة مخزنة على قرص مشترك.",
      "قام المطور في النهاية بإدخال ممارسات حديثة مثل git وLinux والتكامل المستمر (CI) للمشاريع الجديدة، لكن المشروع القديم بقي دون تغيير، مما يبرز التحديات في تحسين قواعد الأكواد غير الفعالة."
    ],
    "points": 515,
    "commentCount": 181,
    "retryCount": 0,
    "time": 1722687963
  },
  {
    "id": 41144755,
    "title": "p5.js",
    "originLink": "https://p5js.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41144755",
    "commentBody": "",
    "originSummary": [
      "تقدم مكتبة p5.js مجموعة من الأمثلة والرسومات المجتمعية لمساعدة المستخدمين على التعلم واستكشاف إمكانياتها.",
      "تشمل المشاريع البارزة نسج البيانات الجغرافية، العفن اللزج، النباتات العصارية التوليدية، النمط الهندسي، أواني الزن، والرسوم المتحركة المتقطعة، مما يعرض تنوع المكتبة.",
      "يمكن للمستخدمين دعم مكتبة p5.js من خلال التبرعات أو عن طريق تنزيلها لاستخدامهم الشخصي."
    ],
    "commentSummary": [
      "حصلت p5.js على منحة قدرها 450 ألف يورو من صندوق التكنولوجيا السيادية في عام 2023 لتحسين وثائقها وإمكانية الوصول إليها، مما أدى إلى إنشاء موقع ويب جديد وسهل الاستخدام.",
      "يقدر المستخدمون مكتبة p5.js لطبيعتها الملائمة للمبتدئين، لكنهم يلاحظون وجود قيود في الأداء مقارنة بمكتبات مثل d3 أو three.js.",
      "تم استقبال الموقع الجديد بشكل إيجابي، على الرغم من أن بعض المستخدمين يفتقدون الإشارات إلى أصول p5.js من مشروع Processing، الذي واجه انتقادات بشأن تخصيص الميزانية."
    ],
    "points": 311,
    "commentCount": 43,
    "retryCount": 0,
    "time": 1722660790
  },
  {
    "id": 41141962,
    "title": "المرشح للإصدار Tauri 2.0",
    "originLink": "https://v2.tauri.app/blog/tauri-2-0-0-release-candidate/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41141962",
    "commentBody": "",
    "originSummary": [
      "تم الإعلان عن إصدار المرشح Tauri 2.0، ومن المتوقع إصدار النسخة المستقرة بحلول نهاية أغسطس، مع التركيز على إنهاء التوثيق وإصلاح الأخطاء الحرجة.",
      "تقدم Tauri 2.0 دعمًا أساسيًا لتطوير التطبيقات المحمولة، على الرغم من أنها لم تصل بعد إلى مستوى التكافؤ في الميزات مع سطح المكتب، وتشمل تغييرات جذرية مثل مساحة أسماء ثابتة للإضافات الأساسية وإعادة هيكلة واجهة برمجة التطبيقات بلغة Rust.",
      "تم الانتهاء من تدقيق أمني خارجي مع إصلاح جميع المشكلات، وسيتم نشر التقرير الكامل قريبًا؛ يُشجع المجتمع على المساهمة في التوثيق وحل المشكلات."
    ],
    "commentSummary": [
      "تم الإعلان عن الإصدار المرشح Tauri 2.0، مما أثار نقاشًا كبيرًا بين المستخدمين حول ميزاته والتحسينات المحتملة.",
      "تاوري هو إطار عمل لإنشاء ملفات تنفيذية صغيرة وسريعة للمنصات الرئيسية باستخدام أطر العمل الخاصة بالواجهة الأمامية التي تُترجم إلى HTML وJavaScript وCSS، مع منطق الخلفية بلغات مثل Rust وSwift وKotlin.",
      "قارن المستخدمون بين Tauri و Electron، مشيرين إلى بصمة Tauri الأخف وتكاملها الأصلي، بينما ناقشوا أيضًا تركيزها على الأمان، وواجهة المستخدم عبر الأنظمة الأساسية، والتحديات مثل مشاكل مكونات الويب في Linux والحاجة إلى توثيق أفضل."
    ],
    "points": 198,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1722627856
  },
  {
    "id": 41143764,
    "title": "مستقبل kdb+؟",
    "originLink": "https://www.timestored.com/b/the-future-of-kdb/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41143764",
    "commentBody": "",
    "originSummary": [
      "تعد kdb+ تقنية قوية لتخزين وتحليل بيانات السوق التاريخية، ولكن البدائل مثل Clickhouse وQuestDB وBigquery وRedshift أصبحت الآن تنافسية من حيث السرعة.",
      "لتحليل البيانات الكمي المحلي، يُفضل استخدام بايثون مع DuckDB أو Polars أو PyKX نظرًا لإمكانية الوصول والتكلفة الفعالة.",
      "قدرات kdb+ في البث المباشر والحوسبة الموزعة غير مستغلة بشكل كافٍ، في حين أن تقنيات مثل Kafka وFlink تكتسب المزيد من الشعبية."
    ],
    "commentSummary": [
      "تتمحور المناقشة حول مستقبل kdb+، وهي قاعدة بيانات عالية الأداء للسلاسل الزمنية، وخلفائها المحتملين.",
      "بدائل مثل TimeScale (امتداد PostgreSQL)، وDuckDB، وClickHouse تبرز لأدائها وفعاليتها من حيث التكلفة.",
      "الطبيعة الاحتكارية والتكاليف العالية لـ kdb+ تعتبر عوائق رئيسية، مما يدفع البعض للنظر في الحلول مفتوحة المصدر مثل بايثون مع DuckDB و Polars لتحليل السلاسل الزمنية."
    ],
    "points": 195,
    "commentCount": 54,
    "retryCount": 0,
    "time": 1722644293
  },
  {
    "id": 41144826,
    "title": "هانون برو – تقنية البيانو والتمارين لعصر الرقمنة",
    "originLink": "https://furnacecreek.org/hanon/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41144826",
    "commentBody": "",
    "originSummary": [
      "هانون برو هو تطبيق حديث لتدريب البيانو لأجهزة الآيفون والآيباد والماك، ويقدم ميزات مثل تتبع التقدم، التغذية الراجعة، وبناء عادات التدريب.",
      "تشمل الوظائف المتقدمة تحليل الأداء، وتقليب الصفحات تلقائيًا، والميزات التفاعلية عند الاتصال بلوحة مفاتيح MIDI عبر البلوتوث أو USB.",
      "يدعم التطبيق المزامنة مع iCloud، وتذكيرات الممارسة اليومية، والإنجازات، وهو مبني باستخدام SwiftUI وCore MIDI، ومتوافق مع iOS 17."
    ],
    "commentSummary": [
      "هانون برو هو تطبيق لتقنيات البيانو يوفر تمارين وتغذية راجعة، مصمم للعصر الرقمي.",
      "أفاد المستخدمون بحدوث أعطال في التطبيق عند استخدام وحدات التحكم MIDI وأعربوا عن رغبتهم في تشغيل MIDI وخيارات ممارسة أكثر مرونة.",
      "يتطلب التطبيق نظام iOS 17 أو أحدث، مما يسبب إحباطًا بين المستخدمين الذين يمتلكون أجهزة قديمة، وتشمل الاقتراحات لتحسينه توافقًا أفضل مع الأجهزة وإضافة ميزات مثل تتبع التقدم وتحميل الدرجات المخصصة."
    ],
    "points": 184,
    "commentCount": 74,
    "retryCount": 0,
    "time": 1722662469
  },
  {
    "id": 41142121,
    "title": "ليسب مع جامع القمامة في 436 بايت",
    "originLink": "https://justine.lol/sectorlisp2/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41142121",
    "commentBody": "",
    "originSummary": [
      "يتضمن SectorLISP الآن جمع القمامة، مما يتيح تضمين لغة برمجة عالية المستوى مع جمع القمامة في قطاع الإقلاع بسعة 512 بايت من قرص مرن، باستخدام 436 بايت فقط.",
      "هذا يجعل LISP أصغر لغة برمجة، متفوقة على FORTH وBASIC، وهي متوافقة مع جميع نماذج الحواسيب الشخصية منذ عام 1981 بشرط أن تحتوي على 64 كيلوبايت من الذاكرة العشوائية على الأقل.",
      "يعرض المشروع تحسينات كبيرة، حيث يقلل من تنفيذ تجميع i8086 بمقدار مئة بايت إضافية، ويتضمن جامع قمامة بحجم 40 بايت، مع توفر الملفات التنفيذية والشيفرة المصدرية على GitHub."
    ],
    "commentSummary": [
      "تم تنفيذ مترجم Lisp مع جمع القمامة (GC) في 436 بايت فقط، مما يعرض إنجازًا رائعًا في التبسيط في البرمجة.",
      "لقد حظي المشروع، المستضاف على justine.lol، باهتمام وإعجاب كبيرين لتصميمه المدمج والفعال، مشيرًا إلى الأعمال السابقة ومقدمًا رؤى تعليمية.",
      "تسلط المناقشات الضوء على التوازن بين إنشاء مترجم برمجي بسيط والحفاظ على وظائف لغة Lisp \"الحقيقية\"، مما يثير جدلاً حول طبيعة لغات البرمجة مثل Brainfuck وتطبيقاتها العملية."
    ],
    "points": 162,
    "commentCount": 24,
    "retryCount": 0,
    "time": 1722628956
  },
  {
    "id": 41144843,
    "title": "لقد صنعت نسخة موسعة من Vimtutor – أقدم لكم Vimtutor Sequel",
    "originLink": "https://github.com/micahkepe/vimtutor-sequel",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41144843",
    "commentBody": "",
    "originSummary": [
      "يقدم \"Vimtutor Sequel\" دروسًا متقدمة في Vim، بما في ذلك الأوامر والتقنيات والدروس التوضيحية خطوة بخطوة والتمارين التفاعلية.",
      "يمكن إجراء التثبيت عبر Homebrew أو عن طريق استنساخ المستودع من GitHub، مع توفير تعليمات مفصلة لكلتا الطريقتين.",
      "الأداة مرخصة بموجب رخصة MIT، ويتم الترحيب بالمساهمات وفقًا للإرشادات الموجودة في CONTRIBUTING.md."
    ],
    "commentSummary": [
      "Vimtutor Sequel هو نسخة موسعة من Vimtutor الأصلي، موجهة للمستخدمين الذين يعرفون الأوامر الأساسية في Vim ويرغبون في تعلم الميزات المتقدمة.",
      "تشمل الميزات الرئيسية دروسًا حول التقسيمات، والتدقيق الإملائي، والبحث والاستبدال المتقدم، والماكرو، وبرمجة Vim، والإضافات، والجلسات، والسجلات، بالإضافة إلى تكوين vimrc مخصص لتجربة تعلم متسقة.",
      "تُقدَّم تعليمات التثبيت لأنظمة ماك وويندوز ولينكس، ويبحث المُنشئ عن تعليقات ومساهمات عبر مستودع GitHub."
    ],
    "points": 152,
    "commentCount": 24,
    "retryCount": 0,
    "time": 1722662997
  },
  {
    "id": 41141676,
    "title": "تنفيذ WWW-NeXT عام 1991",
    "originLink": "https://github.com/simonw/1991-WWW-NeXT-Implementation",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41141676",
    "commentBody": "",
    "originSummary": [
      "يُظهر هذا المستودع على GitHub تطبيق WorldWideWeb الأصلي لتيم بيرنرز لي على نظام NeXT، ويعرض أول نموذج أولي لمتصفح/محرر النص الفائق.",
      "يتيح التطبيق الوصول إلى خوادم النص الفائق والملفات والأخبار، مما يوفر لمحة عن وظائف الويب المبكر.",
      "يتضمن المستودع سجل تغييرات تاريخي، مع تواريخ الالتزام التي تم تعديلها لتتوافق مع آخر يوم تم فيه تعديل كل ملف، مما يحافظ على الجدول الزمني الأصلي."
    ],
    "commentSummary": [
      "تم توفير تنفيذ WWW-NeXT لعام 1991 على GitHub، مما أثار اهتمام عشاق التكنولوجيا وعلماء الآثار الرقمية.",
      "تسلط هذه النسخة الضوء على الطبيعة الرسومية المبكرة للويب، مما يتناقض مع المتصفحات النصية التي كانت أكثر شيوعًا في ذلك الوقت.",
      "يعرض المشروع استخدام لغة البرمجة Objective-C ونظام NeXTStep، مع التركيز على قدرات التطوير السريع للتطبيقات التي كانت حاسمة لمتصفح/محرر الويب الأصلي لتيم بيرنرز لي."
    ],
    "points": 142,
    "commentCount": 42,
    "retryCount": 0,
    "time": 1722625841
  },
  {
    "id": 41144021,
    "title": "باحثون يطورون علاجًا يمكنه قتل خلايا الورم الأرومي الدبقي في مسار الدماغ",
    "originLink": "https://medicalxpress.com/news/2024-08-therapy-treatment-glioblastoma-cells-newly.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41144021",
    "commentBody": "",
    "originSummary": [
      "حدد باحثون من جامعة ماكماستر ومؤسسات أخرى مسارًا جديدًا في الدماغ تستخدمه خلايا الورم الأرومي الدبقي وطوروا علاجًا واعدًا لحجب وقتل هذه الأورام.",
      "تُظهر الدراسة، التي نُشرت في مجلة نيتشر ميديسن في 2 أغسطس 2024، أن استهداف هذا المسار باستخدام خلايا CAR T وعقار يحسن بشكل كبير البقاء على قيد الحياة في النماذج قبل السريرية.",
      "ركزت العلاج على بروتين ROBO1، مما ضاعف وقت البقاء على قيد الحياة في ثلاثة نماذج من السرطان وقضى على الأورام في 50% من الحالات لاثنين من الأمراض، مما يوفر الأمل لمرضى الورم الأرومي الدبقي وأنواع أخرى من سرطانات الدماغ الغازية."
    ],
    "commentSummary": [
      "طور الباحثون علاجًا جديدًا يمكنه قتل خلايا الورم الأرومي الدبقي، وهو نوع عدواني للغاية من سرطان الدماغ الذي يتميز تاريخيًا بمعدلات بقاء منخفضة.",
      "الدكتور ريتشارد سكولير، الذي يعالج ورم الغليوبلاستوما الخاص به، أظهر نتائج واعدة بدون تكرار للورم لأكثر من عام، مما يبرز إمكانيات هذا النهج الجديد.",
      "تؤكد المناقشة على تعقيد وصعوبة علاج السرطان، مشيرة إلى أنه في حين أن العلاج المناعي فعال لبعض أنواع السرطان، إلا أنه لا يعمل مع جميع الأورام، ولا تزال العلاجات البديلة مثل العلاج الكيتوني محل نقاش."
    ],
    "points": 136,
    "commentCount": 17,
    "retryCount": 0,
    "time": 1722648290
  },
  {
    "id": 41142737,
    "title": "مهام الإدخال/الإخراج الشائعة في جافا الحديثة",
    "originLink": "https://dev.java/learn/modernio/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41142737",
    "commentBody": "",
    "originSummary": [
      "تناقش المقالة التي كتبها كاي هورستمان المهام الشائعة للإدخال/الإخراج في جافا، خاصة لتطبيقات الويب، مثل قراءة/كتابة ملفات النصوص، التعامل مع JSON، والعمل مع ملفات ZIP.",
      "يسلط الضوء على تحسينات واجهة برمجة التطبيقات منذ Java 8، بما في ذلك UTF-8 كترميز افتراضي بدءًا من Java 18 وتحسينات على فئات `java.nio.file.Files` و `java.io.InputStream`.",
      "تقدم المقالة أمثلة عملية على كتابة وقراءة ملفات النصوص، والتعامل مع تدفقات الإدخال، والعمل مع الأدلة وملفات ZIP، مع التأكيد على استخدام أساليب `Files` الحديثة بدلاً من فئة `File` القديمة."
    ],
    "commentSummary": [
      "تتمحور المناقشة حول العيوب والمشكلات في فئات `URL` و `URI` في جافا، خاصة فيما يتعلق بفحوصات المساواة وحل نظام أسماء النطاقات (DNS).",
      "يسلط الضوء على تطور إدخال/إخراج Java من `java.io.File` إلى `java.nio.file.Path`، مع التركيز على الإدخال/الإخراج غير المحظور وتحسين التجريد.",
      "يذكر نصائح عملية وأخطاء شائعة في استخدام واجهات برمجة التطبيقات لإدخال/إخراج في جافا، مثل التعامل مع الاستثناءات في التدفقات واستخدام `var`."
    ],
    "points": 128,
    "commentCount": 21,
    "retryCount": 0,
    "time": 1722633142
  },
  {
    "id": 41142710,
    "title": "القضاة يعلقون قاعدة استعادة حيادية الإنترنت الخاصة بلجنة الاتصالات الفيدرالية",
    "originLink": "https://www.inc.com/bruce-crumley/judges-suspend-fcc-net-neutrality-restoration-rule.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41142710",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "قام قاضٍ بتعليق قاعدة استعادة حيادية الإنترنت الخاصة بلجنة الاتصالات الفيدرالية، مما يزيد من تصاعد النزاعات القانونية المحيطة بحيادية الإنترنت.",
      "يأتي هذا التعليق بعد قرار المحكمة العليا الذي قلص من السلطة التنظيمية الفيدرالية، مما أدى إلى بيئة تنظيمية متقلبة.",
      "يجادل النقاد بأن عدم الاستقرار يفيد الشركات الراسخة ويعقد العمليات بالنسبة للوافدين الجدد إلى السوق، مما يشير إلى أن الكونغرس يجب أن يعالج هذه القضايا بدلاً من المحاكم."
    ],
    "points": 124,
    "commentCount": 165,
    "retryCount": 0,
    "time": 1722632998
  },
  {
    "id": 41142125,
    "title": "مصعد فضائي مرتفع مغناطيسيًا إلى مدار الأرض المنخفض (2001) [ملف PDF]",
    "originLink": "https://publications.anl.gov/anlpubs/2001/07/39886.pdf",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41142125",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "يتناقش مستخدمو Hacker News حول ورقة بحثية من عام 2001 عن المصاعد الفضائية المعلقة مغناطيسيًا إلى مدار الأرض المنخفض، مستذكرين مفاهيم مشابهة في مجلة Popular Science.",
      "تغطي المناقشة التحديات التقنية، بما في ذلك الحاجة إلى مواد متقدمة مثل أنابيب الكربون النانوية والموصلات الفائقة ذات درجات الحرارة العالية، ومخاطر انقطاع الحبل.",
      "يتم اقتراح بدائل مثل المدافع الكهرومغناطيسية وحلقات الإطلاق، مع مناقشات حول الجدوى الاقتصادية والعملية للمصاعد الفضائية، إلى جانب التقدم في المواد فائقة التوصيل."
    ],
    "points": 118,
    "commentCount": 93,
    "retryCount": 0,
    "time": 1722628992
  },
  {
    "id": 41141779,
    "title": "عام على حظر الأخبار من قبل شركة ميتا في كندا",
    "originLink": "https://www.mediaecosystemobservatory.com/press-releases/old-news-new-reality-a-year-of-metas-news-ban-in-canada",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41141779",
    "commentBody": "",
    "originSummary": [
      "حظر الأخبار من قبل شركة ميتا في كندا، استجابةً لمشروع القانون C-18، أدى إلى انخفاض بنسبة 85% في التفاعل مع وسائل الإعلام الكندية على فيسبوك وإنستغرام، مما أسفر عن انخفاض إجمالي بنسبة 43% في التفاعل.",
      "حوالي 30% من وسائل الإعلام المحلية أصبحت غير نشطة على وسائل التواصل الاجتماعي، وفقط 22% من الكنديين على دراية بالحظر.",
      "على الرغم من الحظر، لا يزال 36% من المستخدمين يواجهون محتوى الأخبار من خلال الحلول البديلة، لكن الكنديين يشاهدون 11 مليون مشاهدة أقل للأخبار يوميًا على هذه المنصات، مما يؤدي إلى استهلاك أقل للأخبار بشكل عام ومن خلال عدسة أكثر تحيزًا."
    ],
    "commentSummary": [
      "حظر الأخبار من ميتا في كندا، الذي تأثر بجماعات الضغط من الصحف والسياسيين، يفرض على المنصات دفع مقابل المحتوى الإخباري، مما أدى إلى قيام ميتا بحظر روابط الأخبار.",
      "يجادل النقاد بأن الحظر يضر بالمنظمات الإخبارية من خلال إزالة الروابط المجانية المفيدة على وسائل التواصل الاجتماعي، على الرغم من أن المحتوى الإخباري لا يزال يظهر من خلال الحلول البديلة مثل لقطات الشاشة.",
      "النقاش المستمر يتساءل عما إذا كان يجب على شركة ميتا دفع مقابل المحتوى الإخباري، مع مخاوف بشأن تقليل استهلاك الأخبار، وزيادة المعلومات المتحيزة، وتأثير ذلك على إيرادات وبقاء المؤسسات الإخبارية."
    ],
    "points": 113,
    "commentCount": 126,
    "retryCount": 0,
    "time": 1722626637
  },
  {
    "id": 41142686,
    "title": "نحو تحويل POSIX إلى مساحة المستخدم – الجزء الأول: معالجة الإشارات والإدخال/الإخراج",
    "originLink": "https://www.redox-os.org/news/kernel-11/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41142686",
    "commentBody": "",
    "originSummary": [
      "حصل نظام Redox OS على منحة NGI Zero لتنفيذ معالجة إشارات POSIX وإدارة العمليات في مساحة المستخدم، مما يسمح بتركيز لمدة عام على تحسينات النواة والمكونات.",
      "تحسينات في تنسيق حزمة المخطط واستدعاءات النظام الجديدة (SYS_PREAD2 و SYS_PWRITE2) قد زادت من أداء نسخ RedoxFS بنسبة 63%، مما يجعله مشابهًا لكفاءة io_uring.",
      "يهدف المشروع إلى نقل المزيد من منطق POSIX إلى مساحة المستخدم، مع تحسينات في معالجة الإشارات وخطط مستقبلية لتطوير مدير عمليات في مساحة المستخدم وإجراء تحسينات إضافية على النواة."
    ],
    "commentSummary": [
      "يسمح POSIX بمشاركة واصفات الملفات (FDs) بين عمليات متعددة، وهو أمر ضروري لأنظمة شبيهة بـ Unix والأمان الموجه نحو القدرات، ولكن يمكن نقل هذه المشاركة إلى مساحة المستخدم.",
      "المؤشر العالمي في ملفات الوصف (FDs) يعقد الوصول المتزامن، مما يتطلب التزامن، وبينما تعالج واجهة برمجة التطبيقات `std::fs::File` في لغة Rust هذا الأمر بمتطلبات القابلية للتغيير، قد تواجه لغات أخرى أخطاء أو تحتاج إلى واجهات برمجة تطبيقات معقدة.",
      "تتطور تطبيقات وبرامج الأنظمة الحديثة لتحقيق التوازن بين التصميم التاريخي لـ POSIX والحاجة إلى واجهات أكثر تجزئة وأمانًا، باستخدام أدوات مثل D-Bus ومساحات الأسماء plan9 في نظام Linux لتحقيق عزل وأمان أفضل."
    ],
    "points": 107,
    "commentCount": 45,
    "retryCount": 0,
    "time": 1722632845
  },
  {
    "id": 41146278,
    "title": "الدوال التكرارية البدائية للمبرمج العامل",
    "originLink": "https://matklad.github.io/2024/08/01/primitive-recursive-functions.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41146278",
    "commentBody": "",
    "originSummary": [
      "تؤكد المقالة على أهمية فهم اكتمال تورينغ والدوال التكرارية البدائية، التي غالبًا ما يتم التغاضي عنها في تعليم علوم الحاسوب.",
      "يشير إلى أن العديد من المشاكل العملية يمكن تنفيذها في لغات غير مكتملة تورينج، والتي تقدم فوائد مثل الحتمية والأمان.",
      "تتضمن المناقشة الفروقات بين الآلات ذات الحالات المحدودة، وآلات تورينج، والدوال الأولية التكرارية، مشيرة إلى أن الدوال الأولية التكرارية تنتهي دائمًا ويمكنها حساب العديد من الدوال العملية."
    ],
    "commentSummary": [
      "تستكشف المقالة الدوال التكرارية البدائية وأهميتها في ضمان إنهاء الكود، بما يتماشى مع مبادئ البرمجة الهيكلية.",
      "يناقش قيود اكتمال تورينغ وفوائد لغات مثل CUE وDhall التي يمكنها ضمان الإنهاء.",
      "تتناول المحادثة التحديات العملية لإثبات انتهاء الوظيفة والآثار المترتبة على لغات التكوين، مع موازنة القوة الحسابية والسلامة."
    ],
    "points": 83,
    "commentCount": 28,
    "retryCount": 0,
    "time": 1722688321
  }
]
