[
  {
    "id": 38792446,
    "title": "A szövegalapú IDE-k fejlődése: Összehasonlítás a modern IDE-kkel",
    "originLink": "https://blogsystem5.substack.com/p/the-ides-we-had-30-years-ago-and",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38792446",
    "commentBody": "",
    "originSummary": [
      "Ez a cikk a szövegalapú IDE-k átalakulását vizsgálja három évtized alatt, és összehasonlítja őket a mai IDE-kkel.",
      "A szerző megosztja első kézből szerzett tapasztalatait a régebbi IDE-kkel, mint a SideKick Plus és a Turbo Pascal, kiemelve azok jellemzőit és felhasználóbarátságát.",
      "Annak ellenére, hogy a grafikus operációs rendszerek miatt a szövegalapú felhasználói felületek (TUI-k) népszerűsége a szoftverfejlesztésben egyre csökken, a TUI IDE-k a Language Server Protocol (LSP) bevezetésével újjáéledőben vannak.",
      "Bár a modern IDE-kben megvalósítottak néhány fejlesztést, az alapvető funkciók nagyrészt ugyanazok maradtak."
    ],
    "commentSummary": [
      "A vita résztvevői frusztrációjukat fejezik ki a modern IDE-kkel kapcsolatban, és dicsérik a régebbi eszközök, például a Visual Basic 6 és a Delphi egyszerűségét és hatékonyságát.",
      "A web- és mobilfejlesztés kihívásait tárgyalja, beleértve a felhasználói felület könyvtárak széttöredezettségét és az operációs rendszerek gyártóinak nehézségeit az integrált IDE-k létrehozásában.",
      "Az olyan alacsony kódú eszközöket, mint az Excel, előnyösként említik, míg a Python és a JavaScript alkalmazáskészítésre vonatkozó korlátait szintén megvitatják. További témák a dokumentáció, a távoli fejlesztés, a kódszerkesztés és az IDE teljesítménye."
    ],
    "points": 547,
    "commentCount": 456,
    "retryCount": 0,
    "time": 1703763537
  },
  {
    "id": 38794068,
    "title": "Amazon figyelmeztetett az FDA által a be nem jelentett összetevők kiegészítőkben",
    "originLink": "https://www.fda.gov/inspections-compliance-enforcement-and-criminal-investigations/warning-letters/amazoncom-inc-662503-12202023",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38794068",
    "commentBody": "",
    "originSummary": [
      "Az FDA figyelmeztető levelet küldött az Amazonnak a szövetségi előírásokat sértő termékek forgalmazása miatt.",
      "A termékek nem nyilvános gyógyszerösszetevőket tartalmaznak, köztük szildenafilt és tadalafilt, amelyeknek veszélyes mellékhatásai lehetnek.",
      "Az FDA úgy véli, hogy ezek a termékek nem engedélyezett gyógyszerek, mivel nem felelnek meg az étrend-kiegészítők definíciójának, és írásbeli választ kért az Amazontól a jogsértésekkel kapcsolatban. Ezen túlmenően az Amazon teljesítő központjaiban tárolt bizonyos termékeket, például a WeFun kapszulákat, nem bejelentett gyógyszer-összetevők jelenléte miatt visszahívták."
    ],
    "commentSummary": [
      "A termékbiztonság jobb szabályozásának és felügyeletének szükségességét vitatják, különösen a táplálékkiegészítő iparban.",
      "Az Amazon kifejezetten olyan platformként van megemlítve, ahol nem nyilvános összetevőkkel rendelkező kiegészítőket értékesítenek.",
      "Aggályokat vet fel az iparág szabályozásának hiánya, valamint az Amazonhoz hasonló platformok felelőssége az általuk értékesített termékek biztonságának és jogszerűségének biztosítása tekintetében."
    ],
    "points": 478,
    "commentCount": 382,
    "retryCount": 0,
    "time": 1703776044
  },
  {
    "id": 38793206,
    "title": "A stabilitás megtalálása: Hogyan alkalmazkodnak és gyarapodnak a hidegvérű szoftverprojektek",
    "originLink": "https://dubroy.com/blog/cold-blooded-software/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38793206",
    "commentBody": "",
    "originSummary": [
      "A szerző a hidegvérű állatok környezetükhöz való alkalmazkodási képességét a stabil és megbízható technológiát használó szoftverprojektekhez hasonlítja.",
      "A szerző személyes tapasztalatot oszt meg egy sikeres szoftverprojektről, amely hosszú ideig működőképes maradt, és várhatóan a jövőben is működni fog.",
      "A párhuzam rávilágít arra, hogy a szoftverfejlesztés során a hosszú távú siker érdekében fontos a stabil technológia használata."
    ],
    "commentSummary": [
      "A megbeszélések számos programozási nyelvvel és szoftverrel kapcsolatos témát érintenek, mint például a nyelvek népszerűsége, stabilitása és a kód karbantartásának kihívásai.",
      "Hangsúlyozzák a rendszeres frissítések fontosságát a biztonság és a funkcionalitás szempontjából, valamint a stabil és megbízható technológiák előnyben részesítését.",
      "Viták folynak az elavult szoftverek használatának kockázatairól is, és beszélgetések zajlanak a konkrét eszközökről, könyvtárakról, nyelvekről, valamint a kód karbantartása és a jövőbeni újraírás közötti egyensúlyról."
    ],
    "points": 454,
    "commentCount": 161,
    "retryCount": 0,
    "time": 1703769776
  },
  {
    "id": 38795308,
    "title": "Emelkedik a Mozilla vezérigazgatói kompenzációja, csökken a Firefox piaci részesedése, mivel a vállalat az AI-szolgáltatásokra helyezi át a hangsúlyt",
    "originLink": "https://lunduke.locals.com/post/5053290/mozilla-2023-annual-report-ceo-pay-skyrockets-while-firefox-marketshare-nosedives",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38795308",
    "commentBody": "",
    "originSummary": [
      "A Mozilla Alapítvány 2023-as éves jelentéséből kiderül, hogy a vezérigazgatói javadalmazás nőtt, miközben a bevétel és a Firefox piaci részesedése csökkent, ami a mesterséges intelligencia szolgáltatások irányába történő elmozdulást jelezheti.",
      "A cikk különböző témákat tárgyal, többek között a Lunduke.Locals.com-hoz való csatlakozást a független technológiai újságírásért, a Linux Foundation Linuxra fordított kiadásainak csökkentését, az Internet Archive jövőjét, valamint az openSUSE elutasítását, hogy a szerző nem engedélyezi a közreműködést.",
      "A Linux Alapítvány több pénzt fordít blokklánc- és mesterséges intelligencia projektekre, ami aggodalmakat vet fel a prioritásaikkal kapcsolatban, míg a The Lunduke Journal ajándék előfizetéseket és egy útmutatót kínál az anonim információszivárgásról. Emellett az összefoglaló megemlíti a fájlok küldésének lehetőségeit, és ajánl egy anonim fájlmegosztó eszközt."
    ],
    "commentSummary": [
      "A Mozilla 2023-as éves jelentéséből kiderül, hogy a vezérigazgatói fizetések növekedtek, ami egybeesik a Firefox piaci részesedésének csökkenésével.",
      "A felhasználók a piaci részesedés csökkenését az adatvédelmi funkcióknak, a mobilhasználatnak, valamint a Google és az Apple dominanciájának tulajdonítják.",
      "A megbeszélések a böngészési élmény bővítményekkel és bővítményekkel történő javítása, a bevételek csökkenésének kezelése, a finanszírozás fenntarthatósága és a Firefox adatvédelmi alternatívájának lehetőségei körül forognak."
    ],
    "points": 341,
    "commentCount": 300,
    "retryCount": 0,
    "time": 1703781874
  },
  {
    "id": 38792753,
    "title": "A Lode Runner Web Game Canvas pozíciójának és a Google Analytics nyomon követésének konfigurálása",
    "originLink": "https://loderunnerwebgame.com/game/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38792753",
    "commentBody": "",
    "originSummary": [
      "A kódrészlet a Lode Runner webes játék vászonjának pozícióját \"abszolútra\" állítja, ami azt jelenti, hogy a legközelebbi elődjéhez képest lesz pozicionálva.",
      "A vászon a weboldal bal felső sarkában helyezkedik el, így biztosítva, hogy a kívánt helyen jelenjen meg.",
      "A vászon pozicionálásán kívül a kód tartalmazza a Google Analytics nyomon követésének inicializálását és konfigurálását is a weboldalhoz, ami lehetővé teszi a felhasználói interakciók és a weboldal teljesítményének elemzését."
    ],
    "commentSummary": [
      "A felhasználók a számítógépes játékokkal, különösen a Lode Runnerrel kapcsolatos tapasztalataikról, valamint a játékmechanikáról, a pályatervezésről és a betöltési időkről szóló beszélgetésen vesznek részt.",
      "Néhány felhasználó megosztja tapasztalatait más klasszikus játékokkal kapcsolatban a Windows 95 korszakból, és aggodalmát fejezi ki az ilyen játékoknak otthont adó webhelyek technikai problémáival kapcsolatban.",
      "A viták közé tartozik a játék betöltési idejét befolyásoló késleltetés és a modern gépeken elfogadhatónak tartott betöltési időkkel kapcsolatos eltérő vélemények."
    ],
    "points": 299,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1703766246
  },
  {
    "id": 38794625,
    "title": "Mesterséges élet szimulálása: A komplexitás az egyszerűségből fakad",
    "originLink": "https://github.com/hunar4321/particle-life",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38794625",
    "commentBody": "",
    "originSummary": [
      "Az összefoglaló egy olyan programot tárgyal, amely a részecskék közötti vonzás és taszítás szabályainak felhasználásával szimulálja a mesterséges életet.",
      "A program önszerveződő, életszerű mintákat generál, és C++, JavaScript és Python nyelven érhető el.",
      "Hiányzik az ütközésérzékelés, ami lehetővé teszi számos részecske valós idejű szimulációját, és lehetővé teszi a paraméterek feltárását és finomhangolását.",
      "A tervezett frissítések között szerepelnek olyan funkciók, mint a paraméterek mentése és betöltése, további részecsketípusok és a számítási hatékonyság javítása.",
      "A program célja annak bemutatása, hogy az egyszerűségből hogyan születhet komplexitás."
    ],
    "commentSummary": [
      "A cikk a \"Particle Life\" nevű kódolási projektet vizsgálja, amely Conway életjátékára épül, és a színkombinációk RGB \"génjeit\" vezeti be.",
      "A vita középpontjában a részecskeélet-szimuláció optimalizálása és frissítései állnak, valamint olyan fogalmak, mint az intelligens élet ritkasága az univerzumban, az űrutazás lehetősége és a szennyezéssel járó potenciális ökológiai kockázatok.",
      "A cikk az egyszerű szabályokból születő élet filozófiai következményeit is megvizsgálja, és a szimuláció bemutatásának méltatásával zárul."
    ],
    "points": 278,
    "commentCount": 71,
    "retryCount": 0,
    "time": 1703778737
  },
  {
    "id": 38796870,
    "title": "Liero: A végső párbajjáték modokkal, térképekkel és online többjátékos móddal",
    "originLink": "http://www.liero.be/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38796870",
    "commentBody": "",
    "originSummary": [
      "A Liero egy népszerű párbajjáték, amely eredetileg 1998-ban jelent meg, és ma már négy különböző funkciójú változata érhető el.",
      "A Liero 1.33 az eredeti, 2000-es verzió, míg a Liero 1.36 egy magas színvonalú klón, amely a hibákat javítja és új funkciókat vezet be.",
      "A WebLiero online multiplayer élményt kínál, a lierolibre pedig egy olyan projekt, amely a Liero szabad terjesztését szolgálja. A játékban fegyvereket kell választani és különböző pályákon harcolni. Élénk moddolói közösséggel rendelkezik, és modern számítógépeken és népszerű webböngészőkben játszható. További érdeklődés esetén elérhetőségeket adunk meg."
    ],
    "commentSummary": [
      "A vita középpontjában a Liero és más finn shareware játékok népszerűsége és nosztalgikus vonzereje áll.",
      "A résztvevők megosztják a játékokkal kapcsolatos tapasztalataikat és emlékeiket, és megvitatják egyedi jellemzőiket és játékmechanizmusukat.",
      "Más játékok, mint a Scorched Earth, a Worms, valamint ezek utódai és klónjai is szóba kerülnek, valamint a nyílt forráskódú alternatívákról és a játékok fejlődéséről ebben a műfajban."
    ],
    "points": 245,
    "commentCount": 102,
    "retryCount": 0,
    "time": 1703788830
  },
  {
    "id": 38802086,
    "title": "Ideális képernyőforgatás programozók számára: A 22°-os szög előnyeinek felfedezése a kódolásban",
    "originLink": "https://sprocketfox.io/xssfox/2021/12/02/xrandr/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38802086",
    "commentBody": "",
    "originSummary": [
      "A szerző különböző képernyőorientációkkal kísérletezik a szoftverfejlesztés során, mint például a portré mód és a különböző forgatási szögek.",
      "Az előnyök és hátrányok feltárása után megállapítják, hogy a 22°-os elfordítás kínálja a legoptimálisabb vonalhosszúságot a kódoláshoz.",
      "A szerző bemutatja az xrandr nevű eszközt a képernyő elforgatásához, és transzformációs mátrix példákat ad különböző szögekre. Egy számológépet is kínálnak, amellyel az xrandr parancsot generálhatjuk bizonyos bemenetekhez."
    ],
    "commentSummary": [
      "A 2021-ben a programozók számára optimális monitorbeállításokat tárgyaljuk, a nagy 4K monitorokra vonatkozó ajánlásokkal és a hüvelykenkénti képpontok figyelembevételével.",
      "A javaslatok a méret, a képarány és a tájolás tekintetében eltérőek, egyes felhasználók a négyzet vagy a 3:2 képarányt, illetve bizonyos monitor modelleket javasolnak.",
      "További javaslatok közé tartozik az ultraszéles képernyők, az egyedi elrendezések és a képernyőbeállítások testreszabására szolgáló eszközök használata, valamint az olyan találmányok, mint az automatikusan forgó tartók és a forgásálló kábelek. A megbeszélés kitér a kódolás és a webfejlesztés beállításainak sorhosszára is."
    ],
    "points": 195,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1703828357
  },
  {
    "id": 38792631,
    "title": "Az xkcd véletlenszerűségének vizsgálata: Az elfogulatlanság és a minta észlelése",
    "originLink": "https://hardmath123.github.io/xkcd-random.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38792631",
    "commentBody": "",
    "originSummary": [
      "Ennek a blogbejegyzésnek a szerzője statisztikai tesztek segítségével vizsgálja az xkcd weboldalon található \"random\" gomb véletlenszerűségét.",
      "Az xkcd által használt véletlenszám-generátorról bebizonyosodott, hogy elfogulatlan és kiszámíthatatlan.",
      "A torzítás érzékelése a generátor véletlenszerűsége ellenére a minták meglátására való emberi hajlamnak tudható be."
    ],
    "commentSummary": [
      "A viták a véletlenszerűség körül forognak különböző kontextusokban, mint például az xkcd webcomic, a Spotify és az olyan videojátékok, mint a Civilization, megkérdőjelezve az elfogult keverési algoritmusokat és az ismétlődő dalokat a zenei streaming platformokon.",
      "A felhasználók kifejezik, hogy változatosabb hallgatási élményre van szükségük, és javaslatokat tesznek a keverési algoritmusok javítására.",
      "A véletlenszerűség fogalmát vizsgálják, a felhasználók megkérdőjelezik a valódi véletlenszerűség feltételezését, és rávilágítanak a különböző rendszerekben való hatékony megvalósítás összetettségére és kihívásaira."
    ],
    "points": 194,
    "commentCount": 123,
    "retryCount": 0,
    "time": 1703765207
  },
  {
    "id": 38797908,
    "title": "A fejlesztők elutasítása a felhasználói kérések támogatására frusztrációt okoz, és rávilágít a jobb iránymutatás szükségességére",
    "originLink": "https://bvisness.me/you-cant/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38797908",
    "commentBody": "",
    "originSummary": [
      "A szerző frusztrációját fejezi ki a programozási tapasztalatokkal kapcsolatban, amelyeket sértőnek és lekezelőnek talál.",
      "A Python kilépési parancsa, a Rust fájlok formázása és a Rust függőségek eladásakor felmerülő konfliktusok olyan példák, ahol a fejlesztők nem engedték meg a felhasználóknak, hogy azt tegyék, amit akartak, így a felhasználók úgy érezték, hogy nem kapnak támogatást és frusztráltak.",
      "A szerző felszólítja a fejlesztőket, hogy vagy teljes mértékben támogassák a funkciókat, vagy adjanak útmutatást az alternatív megoldásokhoz."
    ],
    "commentSummary": [
      "A beszélgetés a szoftverfejlesztők frusztrációi és kihívásai körül forog, amelyekkel a programozási nyelvek és eszközök, például a Rust, a Python és a JavaScript kezelése során szembesülnek.",
      "Olyan kérdések merülnek fel, mint az alapértelmezett beállítások, a testreszabás, a funkciók stabilitása, a felhasználóbarát felületek és a fejlesztési prioritások.",
      "Néhány résztvevő csalódottságát fejezte ki a fejlesztők empátiájának hiánya és a komplex rendszerek megértésének kihívásai miatt. A beszélgetés rávilágít a szoftverfejlesztéssel kapcsolatos általános problémákra és összetettségre."
    ],
    "points": 186,
    "commentCount": 156,
    "retryCount": 0,
    "time": 1703793663
  },
  {
    "id": 38793249,
    "title": "Alapítványok: Egan gyűjteményében a fizika és a science fiction felfedezése",
    "originLink": "https://www.gregegan.net/FOUNDATIONS/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38793249",
    "commentBody": "",
    "originSummary": [
      "Az \"Alapok\" Greg Egan cikkeinek gyűjteménye, amely a huszadik századi fizikai elméletek hatását tárgyalja a sci-fire.",
      "A cikkek elmagyarázzák az egyes elméletek fő fogalmait és azok valós előrejelzéseit, és olyan laikus olvasóknak szólnak, akiknek nincs haladó matematikai hátterük.",
      "A tárgyalt témák között szerepel a speciális relativitáselmélet, az általános relativitáselmélet, a fekete lyukak és a kvantummechanika. A gyűjteményben Egan fiktív művei is szerepelnek."
    ],
    "commentSummary": [
      "Greg Egan egy sci-fi író, aki koncepcióközpontú történetmeséléséről ismert, amelyet dicséretek és kritikák egyaránt érnek.",
      "Egyes olvasók értékelik elgondolkodtató ötleteit, míg mások úgy találják, hogy írásaiból hiányzik a lebilincselő történetmesélés.",
      "A beszélgetés során megvizsgálják, hogy a sci-fi íróknak milyen kihívásokkal kell szembenézniük az egyedi helyszínek megteremtése során, és összehasonlítják a sci-fit a hagyományos irodalommal.",
      "Egan novelláit egyes olvasók jobban kedvelik, mint regényeit.",
      "Egan műveinek olvasására vonatkozó ajánlásokat említ.",
      "Egan döntése, hogy névtelen marad, aggályokat vet fel a magánélet védelmével és az online zaklatással kapcsolatban.",
      "Az időutazás és az éghajlatváltozás témáit különböző szerzők művei kapcsán vitatják meg.",
      "A \"Vörös Mars\" és a \"Timescape\" című könyvek összehasonlítása.",
      "Megemlítik a \"Red Mars\" filmes adaptációjának lehetőségét."
    ],
    "points": 181,
    "commentCount": 51,
    "retryCount": 0,
    "time": 1703770090
  }
]
