[
  {
    "id": 38792446,
    "title": "تطور IDEs المستندة إلى النص: مقارنة مع IDEs الحديثة",
    "originLink": "https://blogsystem5.substack.com/p/the-ides-we-had-30-years-ago-and",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38792446",
    "commentBody": "",
    "originSummary": [
      "تبحث هذه المقالة في تحول IDEs المستندة إلى النص على مدار ثلاثة عقود وتقارنها ب IDEs المعاصرة.",
      "يشارك المؤلف لقاءاتهم المباشرة مع IDEs القديمة مثل SideKick Plus و Turbo Pascal ، مع التركيز على خصائصها وسهولة استخدامها.",
      "على الرغم من انخفاض شعبية واجهات المستخدم النصية (TUIs) في تطوير البرامج بسبب أنظمة التشغيل الرسومية ، فإن TUI IDEs تعود إلى الظهور مع إدخال بروتوكول خادم اللغة (LSP).",
      "في حين تم تنفيذ بعض التحسينات في IDEs الحديثة ، ظلت الوظيفة الأساسية كما هي إلى حد كبير."
    ],
    "commentSummary": [
      "يعبر المشاركون في المناقشة عن إحباطهم من IDEs الحديثة ويمدحون بساطة وكفاءة الأدوات القديمة مثل Visual Basic 6 و Delphi.",
      "تتم مناقشة تحديات تطوير الويب والجوال ، بما في ذلك تجزئة مكتبات واجهة المستخدم والصعوبات التي يواجهها بائعو أنظمة التشغيل في إنشاء IDEs متكاملة.",
      "تم ذكر الأدوات منخفضة التعليمات البرمجية مثل Excel على أنها مفيدة ، بينما تتم مناقشة قيود Python و JavaScript لإنشاء التطبيق. تشمل الموضوعات الأخرى التوثيق والتطوير عن بعد وتحرير التعليمات البرمجية وأداء IDE."
    ],
    "points": 547,
    "commentCount": 456,
    "retryCount": 0,
    "time": 1703763537
  },
  {
    "id": 38794068,
    "title": "حذرت إدارة الغذاء والدواء الأمريكية من أمازون من المكونات غير المعلنة في المكملات الغذائية",
    "originLink": "https://www.fda.gov/inspections-compliance-enforcement-and-criminal-investigations/warning-letters/amazoncom-inc-662503-12202023",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38794068",
    "commentBody": "",
    "originSummary": [
      "أصدرت إدارة الغذاء والدواء الأمريكية خطاب تحذير إلى أمازون لتوزيع المنتجات التي تنتهك اللوائح الفيدرالية.",
      "تحتوي المنتجات على مكونات صيدلانية غير معلنة ، بما في ذلك السيلدينافيل وتادالافيل ، والتي يمكن أن يكون لها آثار جانبية خطيرة.",
      "تعتبر إدارة الغذاء والدواء الأمريكية هذه المنتجات أدوية غير معتمدة ، لأنها لا تفي بتعريف المكملات الغذائية ، وقد طلبت ردا مكتوبا من أمازون يتناول الانتهاكات. بالإضافة إلى ذلك، تم استدعاء منتجات محددة مخزنة في مراكز الوفاء التابعة لشركة أمازون، مثل كبسولات WeFun، بسبب وجود مكونات دوائية لم يتم الكشف عنها."
    ],
    "commentSummary": [
      "وتجري مناقشة الحاجة إلى تحسين التنظيم والإشراف على سلامة المنتجات، ولا سيما في صناعة المكملات الغذائية.",
      "تم ذكر Amazon على وجه التحديد كمنصة حيث يتم بيع المكملات الغذائية بمكونات غير معلنة.",
      "تثار مخاوف بشأن عدم وجود تنظيم في الصناعة ومسؤولية منصات مثل أمازون لضمان سلامة وشرعية المنتجات التي تبيعها."
    ],
    "points": 478,
    "commentCount": 382,
    "retryCount": 0,
    "time": 1703776044
  },
  {
    "id": 38793206,
    "title": "إيجاد الاستقرار: كيف تتكيف مشاريع البرمجيات بدم بارد وتزدهر",
    "originLink": "https://dubroy.com/blog/cold-blooded-software/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38793206",
    "commentBody": "",
    "originSummary": [
      "يقارن المؤلف قدرة الحيوانات ذات الدم البارد على التكيف مع بيئتها بمشاريع البرمجيات التي تستخدم تقنية مستقرة وموثوقة.",
      "يشارك المؤلف تجربة شخصية مع مشروع برمجي ناجح ظل يعمل لفترة طويلة ومن المتوقع أن يستمر في العمل في المستقبل.",
      "يسلط الرسم الموازي الضوء على أهمية استخدام التكنولوجيا المستقرة في تطوير البرمجيات لتحقيق النجاح على المدى الطويل."
    ],
    "commentSummary": [
      "تغطي المناقشات مجموعة من الموضوعات المتعلقة بلغة البرمجة والبرامج مثل شعبية اللغة والاستقرار والتحديات في صيانة التعليمات البرمجية.",
      "يتم التأكيد على أهمية التحديثات المنتظمة للأمان والوظائف ، إلى جانب تفضيل التقنيات المستقرة والموثوقة.",
      "هناك أيضا مناقشات حول مخاطر استخدام البرامج القديمة والمحادثات حول أدوات ومكتبات ولغات محددة والتوازن بين الحفاظ على التعليمات البرمجية وإعادة كتابتها في المستقبل."
    ],
    "points": 454,
    "commentCount": 161,
    "retryCount": 0,
    "time": 1703769776
  },
  {
    "id": 38795308,
    "title": "ارتفاع تعويضات الرئيس التنفيذي لشركة Mozilla ، وانخفاض حصة سوق Firefox ، حيث تحول الشركة تركيزها إلى خدمات الذكاء الاصطناعي",
    "originLink": "https://lunduke.locals.com/post/5053290/mozilla-2023-annual-report-ceo-pay-skyrockets-while-firefox-marketshare-nosedives",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38795308",
    "commentBody": "",
    "originSummary": [
      "يكشف التقرير السنوي لمؤسسة موزيلا لعام 2023 أن تعويضات الرئيس التنفيذي زادت بينما انخفضت الإيرادات وحصة سوق فايرفوكس ، مما قد يشير إلى تحول في التركيز نحو خدمات الذكاء الاصطناعي.",
      "يناقش المقال مواضيع مختلفة بما في ذلك الانضمام إلى Lunduke.Locals.com للصحافة التقنية المستقلة ، وانخفاض إنفاق مؤسسة Linux على Linux ، ومستقبل أرشيف الإنترنت ، ورفض openSUSE السماح للمؤلف بالمساهمة.",
      "وقد خصصت مؤسسة لينكس المزيد من التمويل لمشاريع بلوكتشين والمشاريع الذكاء الاصطناعي، مما أثار مخاوف بشأن أولوياتها، في حين تقدم مجلة Lunduke Journal اشتراكات هدايا ودليلا حول تسرب المعلومات المجهولة. بالإضافة إلى ذلك ، يذكر الملخص خيارات إرسال الملفات ويوصي بأداة مشاركة ملفات مجهولة."
    ],
    "commentSummary": [
      "يكشف تقرير موزيلا السنوي لعام 2023 عن زيادة في أجور الرئيس التنفيذي ، بالتزامن مع انخفاض حصة فايرفوكس في السوق.",
      "يعزو المستخدمون الانخفاض في الحصة السوقية إلى ميزات الخصوصية واستخدام الهاتف المحمول وهيمنة Google و Apple.",
      "تدور المناقشات حول تحسين تجربة التصفح باستخدام المكونات الإضافية والإضافات ، ومعالجة انخفاض الإيرادات ، واستدامة التمويل ، وإمكانية وجود بديل يركز على الخصوصية لمتصفح Firefox."
    ],
    "points": 341,
    "commentCount": 300,
    "retryCount": 0,
    "time": 1703781874
  },
  {
    "id": 38792753,
    "title": "تكوين Lode Runner موضع لوحة لعبة الويب وتتبع تحليلات Google",
    "originLink": "https://loderunnerwebgame.com/game/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38792753",
    "commentBody": "",
    "originSummary": [
      "يحدد مقتطف الشفرة موضع لوحة لعبة الويب Lode Runner على \"مطلق\" ، مما يعني أنه سيتم وضعها بالنسبة إلى أقرب سلف لها.",
      "يتم وضع اللوحة القماشية في الزاوية العلوية اليسرى من صفحة الويب ، مما يضمن عرضها في الموقع المطلوب.",
      "بالإضافة إلى تحديد موضع اللوحة ، يتضمن الرمز أيضا تهيئة وتكوين تتبع Google Analytics لصفحة الويب ، مما يسمح بتحليل تفاعلات المستخدم وأداء موقع الويب."
    ],
    "commentSummary": [
      "يشارك المستخدمون في مناقشة يتذكرون تجاربهم في لعب ألعاب الكمبيوتر ، وخاصة Lode Runner ، ويناقشون آليات اللعب وتصميم المستوى وأوقات التحميل.",
      "يشارك بعض المستخدمين تجاربهم مع الألعاب الكلاسيكية الأخرى من عصر Windows 95 ويعبرون عن مخاوفهم بشأن المشكلات الفنية على مواقع الويب التي تستضيف هذه الألعاب.",
      "تتضمن المناقشات مناقشات حول وقت تحميل اللعبة الذي يتأثر بزمن انتقال الرحلة ذهابا وإيابا والآراء المختلفة حول ما يعتبر مقبولا لأوقات التحميل على الأجهزة الحديثة."
    ],
    "points": 299,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1703766246
  },
  {
    "id": 38794625,
    "title": "محاكاة الحياة الاصطناعية: التعقيد ينشأ من البساطة",
    "originLink": "https://github.com/hunar4321/particle-life",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38794625",
    "commentBody": "",
    "originSummary": [
      "يناقش الملخص برنامجا يحاكي الحياة الاصطناعية باستخدام قواعد الجذب والتنافر بين الجسيمات.",
      "يولد البرنامج أنماطا تشبه الحياة ذاتية التنظيم ومتوفر في C ++ و JavaScript و Python.",
      "إنه يفتقر إلى اكتشاف الاصطدام ، مما يتيح محاكاة في الوقت الفعلي للعديد من الجسيمات ، ويسمح باستكشاف المعلمات وضبطها.",
      "تتضمن التحديثات المخطط لها إضافة ميزات مثل حفظ وتحميل المعلمات وأنواع الجسيمات الإضافية وتحسين الكفاءة الحسابية.",
      "يهدف البرنامج إلى عرض كيف يمكن أن ينشأ التعقيد من البساطة."
    ],
    "commentSummary": [
      "يستكشف المقال مشروع ترميز يسمى \"حياة الجسيمات\" يعتمد على لعبة كونواي للحياة ، ويقدم \"جينات\" RGB لمجموعات الألوان.",
      "تركز المناقشة على التحسينات والتحديثات لمحاكاة حياة الجسيمات ، بالإضافة إلى مفاهيم مثل ندرة الحياة الذكية في الكون ، وإمكانية السفر إلى الفضاء ، والمخاطر البيئية المحتملة المرتبطة بالتلوث.",
      "يدرس المقال أيضا الآثار الفلسفية للحياة الناشئة عن القواعد البسيطة ، ويختتم بتقدير لعرض المحاكاة."
    ],
    "points": 278,
    "commentCount": 71,
    "retryCount": 0,
    "time": 1703778737
  },
  {
    "id": 38796870,
    "title": "Liero: لعبة المبارزة النهائية مع التعديلات والخرائط واللاعبين المتعددين عبر الإنترنت",
    "originLink": "http://www.liero.be/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38796870",
    "commentBody": "",
    "originSummary": [
      "Liero هي لعبة مبارزة شهيرة تم إصدارها في الأصل في عام 1998 ولديها الآن أربعة إصدارات متوفرة بميزات مختلفة.",
      "Liero 1.33 هو الإصدار الأصلي من عام 2000 ، بينما Liero 1.36 هو استنساخ عالي الدقة يعالج الأخطاء ويقدم ميزات جديدة.",
      "يقدم WebLiero تجربة متعددة اللاعبين عبر الإنترنت ، و lierolibre هو مشروع مخصص لتوزيع Liero بحرية. تتضمن اللعبة اختيار الأسلحة والانخراط في القتال على خرائط مختلفة. يحتوي على مجتمع تعديل نابض بالحياة ، ويمكن تشغيله على أجهزة الكمبيوتر الحديثة ومتصفحات الويب الشائعة. يتم توفير تفاصيل الاتصال للاستفسارات الإضافية."
    ],
    "commentSummary": [
      "تتمحور المناقشة حول الشعبية والجاذبية الحنين إلى Liero والألعاب الأخرى من مشهد البرامج التجريبية الفنلندية.",
      "يشارك المشاركون تجاربهم وذكرياتهم عن لعب هذه الألعاب ويناقشون ميزاتها الفريدة وآليات اللعب.",
      "كما تم ذكر ألعاب أخرى مثل Scorched Earth و Worms وخلفائها واستنساخها ، إلى جانب مناقشات حول بدائل مفتوحة المصدر وتطور الألعاب في هذا النوع."
    ],
    "points": 245,
    "commentCount": 102,
    "retryCount": 0,
    "time": 1703788830
  },
  {
    "id": 38802086,
    "title": "دوران الشاشة المثالي للمبرمجين: استكشاف فوائد زاوية 22 درجة في الترميز",
    "originLink": "https://sprocketfox.io/xssfox/2021/12/02/xrandr/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38802086",
    "commentBody": "",
    "originSummary": [
      "يقوم المؤلف بتجربة اتجاهات الشاشة المختلفة لتطوير البرامج ، مثل الوضع الرأسي وزوايا الدوران المختلفة.",
      "بعد استكشاف المزايا والعيوب ، قرروا أن الدوران بزاوية 22 درجة يوفر أطوال الأسطر المثلى للترميز.",
      "يقدم المؤلف أداة تسمى xrandr لتدوير الشاشة ويوفر أمثلة لمصفوفة التحويل لزوايا مختلفة. كما أنها توفر آلة حاسبة لإنشاء الأمر xrandr لمدخلات محددة."
    ],
    "commentSummary": [
      "تمت مناقشة الإعداد الأمثل للشاشة للمبرمجين في عام 2021 ، مع توصيات لشاشات 4K الكبيرة والنظر في وحدات البكسل في البوصة.",
      "تختلف الاقتراحات حول الحجم ونسبة العرض إلى الارتفاع والاتجاه ، حيث يدافع بعض المستخدمين عن نسب العرض إلى الارتفاع المربعة أو 3: 2 ونماذج شاشات محددة.",
      "تشمل الاقتراحات الأخرى استخدام الشاشات فائقة الاتساع والتخطيطات الفريدة واستخدام الأدوات لتخصيص إعدادات الشاشة ، بالإضافة إلى الاختراعات مثل حوامل الدوران التلقائي والكابلات المقاومة للدوران. تغطي المناقشة أيضا طول السطر في إعدادات الترميز وتطوير الويب."
    ],
    "points": 195,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1703828357
  },
  {
    "id": 38792631,
    "title": "التحقيق في عشوائية xkcd: عدم التحيز وإدراك النمط",
    "originLink": "https://hardmath123.github.io/xkcd-random.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38792631",
    "commentBody": "",
    "originSummary": [
      "يحقق مؤلف منشور المدونة هذا في عشوائية الزر \"العشوائي\" على موقع xkcd باستخدام الاختبارات الإحصائية.",
      "تم التأكيد على أن مولد الأرقام العشوائية الذي يستخدمه xkcd غير متحيز ولا يمكن التنبؤ به.",
      "قد يكون تصور التحيز بسبب ميل الإنسان لرؤية الأنماط ، على الرغم من عشوائية المولد."
    ],
    "commentSummary": [
      "تدور المناقشات حول العشوائية في سياقات مختلفة مثل xkcd webcomic و Spotify وألعاب الفيديو مثل Civilization ، والتشكيك في خوارزميات المراوغة المتحيزة والأغاني المتكررة في منصات بث الموسيقى.",
      "يعبر المستخدمون عن الحاجة إلى تجربة استماع أكثر تنوعا ويقدمون اقتراحات لتحسين خوارزميات المراوغة.",
      "يتم استكشاف مفهوم العشوائية ، حيث يتساءل المستخدمون عن افتراض العشوائية الحقيقية ويسلطون الضوء على التعقيد والتحديات في تنفيذها بفعالية في أنظمة مختلفة."
    ],
    "points": 194,
    "commentCount": 123,
    "retryCount": 0,
    "time": 1703765207
  },
  {
    "id": 38797908,
    "title": "رفض المطورين دعم طلبات المستخدمين يسبب الإحباط ويسلط الضوء على الحاجة إلى إرشادات أفضل",
    "originLink": "https://bvisness.me/you-cant/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38797908",
    "commentBody": "",
    "originSummary": [
      "يعبر المؤلف عن إحباطه من تجارب البرمجة التي يجدونها مهينة ومتعالية.",
      "يتم تقديم أمثلة مثل أمر الخروج من Python وتنسيق ملفات Rust والتعارضات عند بيع تبعيات Rust كحالات رفض فيها المطورون السماح للمستخدمين بفعل ما يريدون ، مما يجعلهم يشعرون بعدم الدعم والإحباط.",
      "يدعو المؤلف المطورين إما إلى دعم الميزات بشكل كامل أو تقديم إرشادات للحلول البديلة."
    ],
    "commentSummary": [
      "يدور النقاش حول الإحباطات والتحديات التي يواجهها مطورو البرامج في التعامل مع لغات وأدوات البرمجة مثل Rust و Python و JavaScript.",
      "يتم طرح مشكلات مثل الإعدادات الافتراضية والتخصيص واستقرار الميزات والواجهات سهلة الاستخدام وتحديد أولويات التطوير.",
      "يعبر بعض المشاركين عن إحباطهم من عدم وجود تعاطف بين المطورين وتحديات فهم الأنظمة المعقدة. تسلط المحادثة الضوء على المشاكل والتعقيدات الشائعة المرتبطة بتطوير البرمجيات."
    ],
    "points": 186,
    "commentCount": 156,
    "retryCount": 0,
    "time": 1703793663
  },
  {
    "id": 38793249,
    "title": "الأسس: استكشاف الفيزياء والخيال العلمي في مجموعة جريج إيجان",
    "originLink": "https://www.gregegan.net/FOUNDATIONS/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38793249",
    "commentBody": "",
    "originSummary": [
      "\"المؤسسات\" هي مجموعة من المقالات التي كتبها جريج إيغان تناقش تأثير نظريات الفيزياء في القرن العشرين على الخيال العلمي.",
      "تشرح المقالات المفاهيم الرئيسية لكل نظرية وتنبؤاتها في العالم الحقيقي ، والتي تستهدف القراء العاديين الذين ليس لديهم خلفية رياضية متقدمة.",
      "تشمل الموضوعات التي يتم تناولها النسبية الخاصة والنسبية العامة والثقوب السوداء وميكانيكا الكم. تتضمن المجموعة أيضا أعمال إيجان الخيالية."
    ],
    "commentSummary": [
      "جريج إيجان هو كاتب خيال علمي معروف بسرد القصص الذي يركز على المفاهيم ، والذي يتلقى الثناء والنقد.",
      "يقدر بعض القراء أفكاره المثيرة للتفكير ، بينما يجد آخرون أن كتاباته تفتقر إلى سرد القصص المقنع.",
      "تستكشف المناقشة التحديات التي يواجهها كتاب الخيال العلمي في إنشاء بيئات فريدة وتقارن الخيال العلمي بالأدب التقليدي.",
      "يفضل بعض القراء قصص إيجان القصيرة على رواياته.",
      "تم ذكر توصيات لقراءة عمل إيجان.",
      "يثير قرار إيجان بعدم الكشف عن هويته مخاوف بشأن الخصوصية والمضايقات عبر الإنترنت.",
      "تتم مناقشة موضوعات السفر عبر الزمن وتغير المناخ فيما يتعلق بأعمال المؤلفين المختلفة.",
      "يتم إجراء مقارنة بين كتابي \"المريخ الأحمر\" و \"Timescape\".",
      "تم ذكر إمكانية تكييف \"المريخ الأحمر\" في فيلم."
    ],
    "points": 181,
    "commentCount": 51,
    "retryCount": 0,
    "time": 1703770090
  }
]
