[
  {
    "id": 39563618,
    "title": "Az Apple támogatja a progresszív webes alkalmazásokat az EU-ban az iOS 17.4-ben",
    "originLink": "https://appleinsider.com/articles/24/03/01/apple-reverses-course-on-death-of-progressive-web-apps-in-eu",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39563618",
    "commentBody": "",
    "originSummary": [
      "Az Apple a fogyasztói visszajelzések és az EU digitális piaci törvénye alapján úgy döntött, hogy az iOS 17.4-ben támogatja a Progressive Web Apps-t az EU-ban.",
      "Ez a változtatás a webes alkalmazások biztonsági és adatvédelmi kihívásait kezeli, és magában foglalja az iOS-alkalmazások közjegyzői hitelesítését, a díjak csökkentését és a több böngészőmotor támogatásának lehetővé tételét.",
      "Olyan vállalatok, mint a Spotify és az Epic Games elégedetlenségüket fejezték ki ezekkel a módosításokkal kapcsolatban."
    ],
    "commentSummary": [
      "Az Apple kezdetben letiltotta a Progressive Web Apps (PWA-k) támogatását a Safariban az EU-ban, de az alkalmazásboltok jutalékdíjaival kapcsolatos jogi fenyegetések miatt megfordult.",
      "Fennáll a gyanú, hogy az Apple a potenciális profit és az ellenőrzés miatt előnyben részesíti a natív alkalmazásokat a PWA-kkal szemben, ami kérdéseket vet fel a PWA-támogatás iránti elkötelezettségükkel kapcsolatban.",
      "A vita kiterjed az Apple uniós szabályozásoknak való megfelelésére, a harmadik féltől származó böngészőmotorok PWA-k iOS-en való támogatásával kapcsolatos aggályokra, valamint a fejlesztőkre és a felhasználókra gyakorolt hatására, és vitákat vált ki az alkalmazás-ökoszisztéma átláthatóságáról és választási lehetőségeiről."
    ],
    "points": 655,
    "commentCount": 350,
    "retryCount": 0,
    "time": 1709311725
  },
  {
    "id": 39561021,
    "title": "Jan Marsalek, a Wirecard szökevény vezérigazgatója évtizedes GRU-kémnek bizonyult",
    "originLink": "https://theins.ru/en/politics/269612",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39561021",
    "commentBody": "",
    "originSummary": [
      "A Wirecard vezérigazgatójáról, Jan Marsalekről kiderült, hogy tíz éven át az orosz GRU kémjeként dolgozott - jelentette Roman Dobrokhotov, Christo Grozev és Michael Weiss 2024. március 1-jén."
    ],
    "commentSummary": [
      "A vita a Wirecard-botrányról szól, amelybe olyan könyvvizsgáló cégek, mint az EY és a KPMG is belekeveredtek, valamint Jan Marsalek orosz hírszerzéssel való kapcsolatainak gyanújáról.",
      "A témák az orosz politikától kezdve az orosz ortodox egyházon át az olyan személyiségek, mint Alekszej Navalnij regionális hatásaiig terjednek, érintve különböző, egymással összefüggő kérdéseket, mint a biztonság, az energiapolitika és az európai geopolitikai dinamika.",
      "Az aggodalmak és témák széles skálájára világít rá, hangsúlyozva a pénzügyi csalás, a kémkedés, a politika és a regionális hatások közötti összetett összefüggéseket."
    ],
    "points": 488,
    "commentCount": 255,
    "retryCount": 0,
    "time": 1709295211
  },
  {
    "id": 39562760,
    "title": "A brit cégek a 4 napos munkahetet választják, és tartós előnyökről számolnak be",
    "originLink": "https://www.npr.org/2024/02/27/1234271434/4-day-workweek-successful-a-year-later-in-uk",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39562760",
    "commentBody": "",
    "originSummary": [
      "Számos vállalat alkalmazza a négynapos munkahetet, ami boldogabb alkalmazottakhoz, alacsonyabb fluktuációhoz és jobb hatékonysághoz vezet, valamint tartós előnyökkel jár az egészség és a munka-magánélet egyensúlya terén.",
      "A siker a vállalatspecifikus követelményektől és a végrehajtási terv hatékonyságától függően változik, egyes cégek állandóvá teszik a politikát, míg mások felmérik annak hatását.",
      "A kihívások közé tartozik az ügyfelek elvárásainak kiegyensúlyozása, az alkalmazkodóképesség fenntartása kihívást jelentő helyzetekben, valamint a munkaerő rugalmasságának biztosítása."
    ],
    "commentSummary": [
      "A 4 napos munkahét bevezetése 61 brit cégnél a munkavállalók megtartásának növekedését, a mentális egészség javulását és potenciálisan jobb munkaminőséget eredményezett, de a hatékonyságra és termelékenységre gyakorolt hatása továbbra is bizonytalan.",
      "A megvitatott kihívások között szerepelnek a távmunkával kapcsolatos kérdések, az informatikai támogatás, a szervezeti problémák és a munkavállalók motivációja, miközben a tudásalapú munkavállalók rövidebb munkahétje mellett és ellen szóló érvek is megvitatásra kerülnek.",
      "A beszélgetés kitér a szakszervezetekkel kapcsolatos aggályokra, a távmunka megvalósíthatóságára és a hagyományos munkahét-modellek megváltoztatásával szembeni ellenállásra, és vitát kezdeményez a munkaidő, a termelékenység és a jólét egyensúlyáról a mai változó munkakörülmények között."
    ],
    "points": 351,
    "commentCount": 254,
    "retryCount": 0,
    "time": 1709307580
  },
  {
    "id": 39566766,
    "title": "WhatsApp nyer Pegasus Spyware kód jogi győzelemben",
    "originLink": "https://arstechnica.com/tech-policy/2024/03/whatsapp-finally-forces-pegasus-spyware-maker-to-share-its-secret-code/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39566766",
    "commentBody": "",
    "originSummary": [
      "A WhatsApp egy jogi vitát követően hozzáférést kapott az NSO Group Pegasus kémprogramjának kódjához, ami lehetővé tette számukra, hogy a kémprogram teljes funkcionalitásába beleássák magukat.",
      "A bíróság elutasította az NSO azon törekvését, hogy kizárólag a telepítési rétegre vonatkozó adatokat szolgáltasson, és szélesebb körű hozzáférést biztosított a WhatsAppnak a kémprogram képességeinek feltárásához.",
      "Az NSO-nak nem kell felfednie ügyfeleit vagy szerverstruktúráját, a kísérlet a tervek szerint 2025-ben kezdődik."
    ],
    "commentSummary": [
      "A WhatsApp jogi csatát folytat a Pegasus kémprogram gyártójával a titkos kód megosztásáról, ami aggodalmakat vet fel a nemzetbiztonsággal és a FISA bírósági rendszer felügyeletével kapcsolatban.",
      "Szó lesz a nyelvtanról, az USA globális banki befolyásáról, a kormányzati ellenőrzést megkerülő kriptovalutákról és az amerikai jogrendszer külföldi szervezetek feletti joghatóságáról is.",
      "A beszélgetés a kiberbiztonság etikai dilemmáiról és a Project Zero ellentmondásos munkájáról szól, amely a különböző rendszerek sebezhetőségének azonosítására irányul."
    ],
    "points": 328,
    "commentCount": 95,
    "retryCount": 0,
    "time": 1709326979
  },
  {
    "id": 39560705,
    "title": "CSS-Tricks: A felemelkedés, a bukás és az elvesztett lehetőség",
    "originLink": "https://chriscoyier.net/2024/02/28/where-im-at-on-the-whole-css-tricks-thing/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39560705",
    "commentBody": "",
    "originSummary": [
      "A szerző, aki eladta a CSS-Tricks-et a DigitalOcean-nek, a reményteljes kezdet után látta, hogy az oldal tartalma és közössége szétesett.",
      "Annak ellenére, hogy a DigitalOcean megpróbálta visszaszerezni a tulajdonjogot a webhely újraélesztése érdekében, elutasította a szerző javaslatát.",
      "A szerző által javasolt terv, miszerint a honlapot újraindítják, nem valósult meg."
    ],
    "commentSummary": [
      "A DigitalOcean felvásárlása a CSS-Tricks, egy népszerű, frontend fejlesztők számára létrehozott weboldal felvásárlására vegyes reakciókat váltott ki a közösségből.",
      "Néhányan dicsérték a CSS-Tricks értékes erőforrásait, míg mások kritizálták a DigitalOceant, amiért eltávolította a lényeges tartalmakat és nem kommunikált az alapítóval.",
      "Aggályok merültek fel a független fejlesztői blogok nagyvállalatoknak történő eladásának hatásaival kapcsolatban, a minőség és a tartalom esetleges elvesztése miatti aggodalmakkal, a Tailwind CSS kritikájával és a webfejlesztés rövidítéseinek az iparág hosszú távú kilátásaira gyakorolt hatásával kapcsolatos aggodalmakkal együtt."
    ],
    "points": 322,
    "commentCount": 47,
    "retryCount": 0,
    "time": 1709291734
  },
  {
    "id": 39561356,
    "title": "Atlanta Magnet Man: Egyszerre csak egy út: az utak biztonságban tartása",
    "originLink": "https://www.wabe.org/the-atlanta-magnet-man-is-saving-our-car-tires-one-bike-ride-at-a-time/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39561356",
    "commentBody": "",
    "originSummary": [
      "Alex Benigno, akit az \"atlantai mágnesember\" néven ismernek, mágnesekkel felszerelt utánfutóval tisztítja Atlanta utcáit, és több mint 410 kilónyi fémet gyűjt össze, hogy megelőzze az autók gumiabroncsainak sérülését.",
      "A közösségi médiában elismert kezdeményezése rámutat a biztonságos közterületek fenntartásának fontosságára, mivel a közszolgáltatások e tekintetben hiányosságokat mutatnak.",
      "Az olyan szervezetek, mint a PropelATL, üdvözlik Benigno erőfeszítéseit, hangsúlyozva, hogy a városoknak a biztonság érdekében be kell fektetniük a nyilvános infrastruktúra karbantartásába."
    ],
    "commentSummary": [
      "Az \"atlantai mágnesember\" azt mutatja be, hogy az egyének milyen pozitív hatást gyakorolhatnak az úttörmelék eltakarításával, és ezzel ösztönzik a közösségi szerepvállalást.",
      "Az olyan társadalmi problémák, mint a szemetelés kezelése során kiemelik az apró jócselekedeteket, a motivációs kihívásokat, valamint az együttérzés, az empátia és a kollektív cselekvés jelentőségét.",
      "A vita olyan témákat is érint, mint a városi területeken tapasztalható korrupció, a gumiabroncsok biztonsága és a fenntartható közlekedési infrastruktúra jelentősége."
    ],
    "points": 310,
    "commentCount": 196,
    "retryCount": 0,
    "time": 1709298110
  },
  {
    "id": 39562986,
    "title": "Technikai munkára vonatkozó iránymutatások: Helyszín, távoli munkavégzés, gyakornok, vízum - Csak kölcsönző cégek.",
    "originLink": "https://news.ycombinator.com/item?id=39562986",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39562986",
    "commentBody": "",
    "originSummary": [
      "Az adott platformon közzétett álláshirdetésekre vonatkozó iránymutatások tartalmazzák a helymeghatározás részleteit, a távoli lehetőségek, valamint a gyakornokokra vagy vízumkérelmezőkre vonatkozó preferenciákat.",
      "Kizárólag a felvételt végző cégek tehetik közzé álláshirdetéseiket, az olvasóknak pedig azt tanácsoljuk, hogy érdeklődés esetén küldjenek e-mailt.",
      "További segítségként további álláskeresési forrásokat biztosítunk."
    ],
    "commentSummary": [
      "A technológiai vállalatok világszerte olyan különböző pozíciókba keresnek munkatársakat, mint a szoftvermérnökök, termékmenedzserek, mesterséges intelligencia mérnökök és adattudósok, akiknek különböző programozási nyelvek és technológiák ismeretére van szükségük.",
      "A pozíciókat távolról és meghatározott helyszíneken is meg lehet tölteni olyan iparágakban, mint a fintech, az egészségügy és a gyártás, hangsúlyt fektetve az innovációra, a fejlett technológiára és a jövőbeli növekedésre.",
      "A bilbaói All Iron Ventures, a New York-i Radartech és az amerikai Trustle olyan cégek, amelyek aktívan bővítik csapataikat, és lehetőséget kínálnak a hozzáértőknek."
    ],
    "points": 307,
    "commentCount": 297,
    "retryCount": 0,
    "time": 1709308803
  },
  {
    "id": 39562530,
    "title": "Régi vs. új növekedésű fa: Minőség és hosszú élettartam összehasonlítva",
    "originLink": "https://hullworks.com/wood/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39562530",
    "commentBody": "",
    "originSummary": [
      "A 100 éves vagy annál idősebb fákból kitermelt öreg faanyag stabilabb és tartósabb, mivel tömörebb évgyűrűkkel, több szívfával és kevesebb csomóval rendelkezik.",
      "Ezzel szemben a gyorsabban növő fákból származó új faanyag kevésbé tartós, hajlamos a vetemedésre és a korhadásra, így a régi faanyag jobb minőségű.",
      "A régi faanyagból készült történelmi ablakok megfelelő gondoskodással akár több mint 100 évig is eltarthatnak, ami kiemeli a megőrzésük és helyreállításuk értékét az új faanyagú alternatívákkal való helyettesítéssel szemben."
    ],
    "commentSummary": [
      "Az építőiparban az öreg és az új termesztésű faanyagok közötti vita a fenntarthatóság, a minőség és a tartósság szempontjaira terjed ki.",
      "A megbeszélések rávilágítanak az erdőgazdálkodási gyakorlatok fakészletre gyakorolt hatására, valamint az idős faanyag felhasználásának kihívásaira és előnyeire.",
      "A beszélgetés kitér a megfelelő építési gyakorlatok fontosságára és az idős erdők fenntarthatóságának megőrzésére is."
    ],
    "points": 283,
    "commentCount": 213,
    "retryCount": 0,
    "time": 1709306113
  },
  {
    "id": 39562467,
    "title": "A cURL biztonságának növelése fejlett fuzzing technikákkal",
    "originLink": "https://blog.trailofbits.com/2024/03/01/toward-more-effective-curl-fuzzing/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39562467",
    "commentBody": "",
    "originSummary": [
      "A Trail of Bits elvégezte a cURL és a libcurl biztonsági értékelését, és a fuzzing technikák fejlesztésével növelte az OSTIF kódlefedettségét. Kiemelték a figyelmen kívül hagyott kódterületeket, új magfájlokat adtak hozzá, és kibővítették a fuzzy protokollok körét.",
      "Ajánlásokat tettek a HSTS és az Alt-Svc kezelési fedezetének bővítésére. Javaslatokat tettek a támogatott protokollok szótárainak létrehozására és a struktúratudatos fuzzing megvalósítására a hibakeresés hatékonyságának javítása érdekében.",
      "A kritikus biztonsági fájlok alacsony lefedettségével a lefedettségi jelentések alapján foglalkoztak, és a 2023-as auditot követően várhatóan frissítésekre kerül sor."
    ],
    "commentSummary": [
      "A cURL-szoftvereknél a fuzzing technikákat alkalmazzák a tesztelés hatékonyságának és a hibák felderítésének növelése érdekében, hangsúlyozva az átfogó tesztelés jelentőségét a széles körben használt programok esetében.",
      "A cikk kiemeli a tesztelés, a formális verifikáció és az automatizált tesztelés fontosságát a szoftverfejlesztésben a kód stabilitásának és megbízhatóságának garantálása érdekében.",
      "A cURL használata során a biztonsági gyakorlatok javítására vonatkozó ajánlásokat fogalmazunk meg, hangsúlyozva, hogy a szigorú tesztelés, beleértve a fuzzingot is, létfontosságú az olyan elterjedt szoftverek megbízhatóságának fenntartásához, mint a cURL."
    ],
    "points": 258,
    "commentCount": 50,
    "retryCount": 0,
    "time": 1709305794
  },
  {
    "id": 39560862,
    "title": "A Noether-elv feltárása az ML-ben: kapcsolat a megőrzési törvényekkel",
    "originLink": "https://cgad.ski/blog/where-is-noethers-principle-in-machine-learning.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39560862",
    "commentBody": "",
    "originSummary": [
      "A szöveg elmélyül Noether elvének fizikai és gépi tanulásban való alkalmazásában, hangsúlyozva a megőrzési törvényeket és az invarianciákat mindkét területen.",
      "Az adatklaszterek transzformációi megőrizhetik a gradienseket és más értékeket, hasonlóan a fizikában található megőrzési törvényekhez.",
      "A szimmetria döntő szerepet játszik a rendszerek stabilitásának és optimális működésének fenntartásában, amint azt a vita is kiemeli."
    ],
    "commentSummary": [
      "A vita a gépi tanulásban a Noether-elvvel foglalkozik, párhuzamot vonva a fizika és a neurális hálózatok megőrzési törvényeivel.",
      "A legfontosabb pontok közé tartozik a szimmetria és a tanulási invarianciák közötti kapcsolat, az idő szerepe a konzervált mennyiségek meghatározásában, valamint az információáramlás és a fizikai információmegőrzési törvények alkalmazása a gépi tanulásban.",
      "A könyv a neurális hálózatok fizikai tulajdonságainak megjelenését, a szimmetriák jelentőségét a gépi tanulási modellekben, valamint a Noether-tétel és a neurális hálózatok közötti lehetséges kapcsolatokat vizsgálja."
    ],
    "points": 250,
    "commentCount": 58,
    "retryCount": 0,
    "time": 1709293650
  },
  {
    "id": 39560887,
    "title": "A véletlen törlés tanulságokat tár fel az adatbázisok hibáiról",
    "originLink": "https://www.mistys-internet.website/blog/blog/2024/03/01/that-time-i-accidentally-deleted-a-game-from-mame/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39560887",
    "commentBody": "",
    "originSummary": [
      "A szerző tévedésből eltávolított egy játékot a MAME-ből, miközben megpróbálta hozzáadni a Martial Masters tajvani változatának megfelelő dumpját, rájött, hogy a játék nem egy különálló revízió, és rávilágított az alapos adatellenőrzés szükségességére.",
      "Ez az eset kiemelte az adatbázisokban lévő adatok kétszeres és háromszoros ellenőrzésének jelentőségét az észrevétlenül megrongált információk kiszűrése érdekében.",
      "A tapasztalat értékes tanulsággal szolgált az adatbázisok fejlődéséről és hiányosságairól."
    ],
    "commentSummary": [
      "A poszt olyan technikákat mutat be, amelyekkel meg lehet kerülni a játékkonzolok, például a PS1 és a PS2 másolásellenőrzését kalóz- vagy egyedi játékok lejátszásához, például a blu-tack vagy a lemezcsere segítségével.",
      "Foglalkozik a CD-k cseréjének biztonságával, a retro játékok ROM-fájljainak ellenőrző összegével, valamint a szoftverek megőrzésével kapcsolatos pontatlan dumps kihívásaival.",
      "A beszélgetés kiterjed a reverse engineering, a videoemuláció és a MAME és a NES/SNES emulátorok ROM-jainak frissítése során felmerülő nehézségekre is, hogy megőrizzék és javítsák a játék pontosságát."
    ],
    "points": 247,
    "commentCount": 65,
    "retryCount": 0,
    "time": 1709293871
  },
  {
    "id": 39561594,
    "title": "A JSR bemutatása: A JavaScript nyilvántartás",
    "originLink": "https://jsr.io",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39561594",
    "commentBody": "",
    "originSummary": [
      "A JSR egy nyílt forráskódú, modern JavaScript és TypeScript csomagregiszter, amely API-dokumentációkat, .d.ts fájlokat és transzpilálást biztosít a futásidejű kompatibilitás érdekében.",
      "A Node, Deno és Cloudflare Workerekkel kompatibilis JSR együttműködik bármely JavaScript csomagkezelővel, és erősen tipizált modulokkal és szerkesztőtámogatással bővíti az npm-et.",
      "A JSR nem helyettesíti az npm-et, hanem kiegészítő eszközként funkcionál, biztosítva a fejlesztők számára a zökkenőmentes élményt a robusztus tipizálással és a futásidejű képességekkel."
    ],
    "commentSummary": [
      "A JavaScript Registry (JSR) egy új csomagregisztert vezet be, amely olyan funkciókat helyez előtérbe, mint az API-dokumentumok, .d.ts fájlok generálása és a futásidejű kompatibilitás transzpilálással, és célja az npm kiegészítése, nem pedig helyettesítése.",
      "A JavaScript (JS) ökoszisztéma széttöredezettségével kapcsolatos szkepticizmus ellenére a JSR olyan előnyöket kínál, mint a TypeScript és a JavaScript kompatibilitása, a központi csomagtár létrehozása, valamint a hatókörök és tartományok kezelése, ami megkülönbözteti az npm-től, a Denótól és a Node-tól.",
      "A JSR körül kialakult viták rávilágítanak a hasznosságáról alkotott megosztott véleményekre, egyesek a csomagok szerzői és fogyasztói számára előnyöket hangsúlyoznak, míg mások megkérdőjelezik a kompatibilitást és a lehetséges hátrányokat."
    ],
    "points": 229,
    "commentCount": 164,
    "retryCount": 0,
    "time": 1709300003
  },
  {
    "id": 39566732,
    "title": "FastUI: Python-alapú gyors webes felhasználói felület építése",
    "originLink": "https://github.com/pydantic/FastUI",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39566732",
    "commentBody": "",
    "originSummary": [
      "A FastUI egy hamarosan megjelenő eszköz webes alkalmazások felületének deklaratív Python kóddal történő létrehozására, amely lehetővé teszi a fejlesztők számára, hogy React-alapú webes alkalmazásokat készítsenek JavaScript nélkül.",
      "Hangsúlyozza a backend logika és a front-end felhasználói felület tervezése közötti egyértelmű szétválasztást, elősegítve a komponensek újrafelhasználását és a RESTful architektúrát.",
      "A FastUI egységes séma létrehozásával egyszerűsíti a backend és a frontend közötti kommunikációt, megkönnyítve a különböző technológiák zökkenőmentes integrálásának rugalmasságát."
    ],
    "commentSummary": [
      "A FastUI lehetővé teszi a backend-fejlesztők számára, hogy frontend-fejlesztés nélkül bővítsék az alkalmazásokat, hasonlóan a GraphQL-hez, megkönnyítve a gyors üzleti értékteremtést.",
      "A felhasználók vitatják a hatékonyságát az olyan eszközökhöz képest, mint a Streamlit, hangsúlyozva a TypeScript szerepét a webfejlesztésben és a nem műszaki szakemberek számára felhasználóbarát felhasználói felületeket.",
      "A megbeszélések kiterjednek a FastAPI csapat stratégiáira, a benchmarking akadályaira és az olyan eszközök jelentőségére, mint a Streamlit a gépi tanulási modellek bemutatásában."
    ],
    "points": 217,
    "commentCount": 71,
    "retryCount": 0,
    "time": 1709326758
  },
  {
    "id": 39569843,
    "title": "Az etikus FOSS csevegőeszközök választása a Discord felett",
    "originLink": "https://drewdevault.com/2021/12/28/Dont-use-Discord-for-FOSS.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39569843",
    "commentBody": "",
    "originSummary": [
      "A szerző szerint a Discordot kritizálják, mert kizár bizonyos felhasználókat, korlátozza a csevegési naplók és a moderálás feletti ellenőrzést, és ellentétes a FOSS értékekkel.",
      "A cikk olyan FOSS-alternatívákat népszerűsít, mint a SourceHut, a Matrix és a Zulip, és a FOSS-ökoszisztéma fenntartása érdekében etikus szoftverválasztás mellett érvel.",
      "A Discorddal kapcsolatos akadálymentesítési problémákkal foglalkoznak, és az utóbbi években a látássérült felhasználók számára is kiemelnek néhány előrelépést."
    ],
    "commentSummary": [
      "A cikk a Discord nyílt forráskódú projektekben betöltött szerepét vizsgálja, és összehasonlítja annak korlátait az olyan platformokkal, mint a GitHub, a nyitottság és a kereshetőség szempontjából.",
      "A kötet a szabad és nyílt forráskódú szoftverek (FOSS) alapelveinek vizsgálatával foglalkozik, és a jobb gyakorlatok, az irányítás és a nem fejlesztők szélesebb körű bevonása mellett száll síkra.",
      "A felhasználók megvitatják a nem szabad szoftverek FOSS-projektekbe való beépítésének hatását, és megvitatják az olyan platformok használatát, mint a Discord a közösségi interakcióhoz, mérlegelve a használhatósággal, fenntarthatósággal és befogadással kapcsolatos előnyöket és hátrányokat. A vitában gyakran elhangzanak alternatív platformokra vonatkozó javaslatok és a nyílt forráskódú eszközök előnyben részesítése."
    ],
    "points": 194,
    "commentCount": 148,
    "retryCount": 0,
    "time": 1709354197
  }
]
