[
  {
    "id": 40774277,
    "title": "Microcaractéristiques que j'adore dans les blogs et les sites personnels",
    "originLink": "https://danilafe.com/blog/blog_microfeatures/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40774277",
    "commentBody": "",
    "originSummary": [
      "« Le post met en avant diverses micro-fonctionnalités qui peuvent améliorer l'expérience utilisateur sur les blogs et les sites personnels, inspirées par l'article de Hillel Wayne sur les langages de programmation. »",
      "Les principales caractéristiques incluent des notes de bas de page, des tables des matières, des titres cliquables, des regroupements en séries, des dialogues, des blocs de code avec origine et liens cliquables, des marqueurs pour les liens externes, des aperçus de liens et des flux RSS.",
      "Ces fonctionnalités, bien que non essentielles, améliorent la navigation, l'engagement et l'accessibilité, rendant l'expérience de lecture plus agréable et efficace."
    ],
    "commentSummary": [
      "« La discussion tourne autour des microfonctionnalités dans les blogs et les sites personnels, en mettant en lumière à la fois les aspects positifs et négatifs. »",
      "« Les principaux points de discorde incluent l'utilisation de barres de progression, de décorations de liens et de fenêtres contextuelles de prévisualisation, certains utilisateurs les trouvant distrayants et inutiles. »",
      "« La conversation aborde également la réduction des barres de défilement natives et les avantages potentiels des aides à la navigation alternatives comme les tables des matières et les index toujours visibles. »"
    ],
    "points": 630,
    "commentCount": 270,
    "retryCount": 0,
    "time": 1719224711
  },
  {
    "id": 40773883,
    "title": "« Apple reconnu en infraction aux règles de concurrence de l'UE »",
    "originLink": "https://www.theguardian.com/technology/article/2024/jun/24/apple-breach-eu-competition-rules-digital-markets-act",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40773883",
    "commentBody": "",
    "originSummary": [
      "« La Commission européenne a constaté qu'Apple enfreint les nouvelles lois de l'UE visant à protéger les plus petits concurrents et à permettre aux consommateurs de trouver des applications moins chères. »",
      "« Apple a 12 mois pour se conformer aux réglementations ou faire face à des amendes pouvant atteindre 10 % de ses revenus mondiaux, à la suite d'une enquête initiée en mars. »",
      "« Cela marque la troisième enquête pour non-conformité concernant Apple depuis l'adoption de la loi sur les marchés numériques (DMA), se concentrant sur les frais et les pratiques d'Apple qui restreignent les développeurs de diriger les consommateurs vers des options d'achat alternatives. »"
    ],
    "commentSummary": [
      "Apple a été reconnu en violation des règles de concurrence de l'UE, suscitant des appels à des actions similaires aux États-Unis.",
      "« Les critiques soutiennent que le contrôle d'Apple sur la publication des applications et les frais des développeurs étouffe la concurrence, avec une préoccupation particulière concernant les règles anti-orientation qui empêchent les développeurs d'informer les utilisateurs sur des options de paiement moins chères en dehors de l'App Store. »",
      "« Apple attend une décision de la Cour de l'UE sur la constitutionnalité des dispositions exigeant des API iOS gratuites pour les développeurs, au milieu des affirmations selon lesquelles sa conformité avec les lois de l'UE est superficielle. »"
    ],
    "points": 509,
    "commentCount": 493,
    "retryCount": 0,
    "time": 1719220256
  },
  {
    "id": 40773151,
    "title": "« Les procureurs américains recommandent au ministère de la Justice d'inculper pénalement Boeing »",
    "originLink": "https://www.voanews.com/a/us-prosecutors-recommend-justice-department-criminally-charge-boeing-as-deadline-looms/7667194.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40773151",
    "commentBody": "",
    "originSummary": [
      "« Les procureurs américains suggèrent des accusations criminelles contre Boeing pour avoir prétendument violé un accord de 2021 concernant deux crashs mortels de 737 MAX. »",
      "« Le ministère de la Justice a jusqu'au 7 juillet pour décider des poursuites, Boeing contestant les allégations de violation et des discussions étant en cours. »",
      "Des accusations criminelles pourraient aggraver la crise de Boeing, affectant ses contrats avec le gouvernement américain, tandis que les familles des victimes plaident pour une amende de 25 milliards de dollars et des poursuites judiciaires."
    ],
    "commentSummary": [
      "« Les procureurs américains recommandent des accusations criminelles contre Boeing, certains suggérant des mesures drastiques comme l'expropriation de 51 % de l'entreprise, le licenciement des hauts dirigeants et l'imposition d'amendes. »",
      "« Les critiques soutiennent que les actionnaires n'ont pas le pouvoir d'imposer une surveillance adéquate, et que les investisseurs institutionnels ne parviennent souvent pas à surveiller efficacement le comportement des entreprises. »",
      "« L'affaire Boeing souligne des problèmes systémiques plus larges dans la gouvernance d'entreprise et la surveillance réglementaire. »"
    ],
    "points": 429,
    "commentCount": 332,
    "retryCount": 0,
    "time": 1719211984
  },
  {
    "id": 40773139,
    "title": "Cosmopolitan v3.5.0",
    "originLink": "https://github.com/jart/cosmopolitan/releases/tag/3.5.0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40773139",
    "commentBody": "",
    "originSummary": [
      "« Cosmopolitan Libc v3.5.0 a été publié, faisant du C un langage à compiler une fois et exécuter partout sans avoir besoin d'un interprète ou d'une machine virtuelle. »",
      "« Les améliorations clés incluent une mise en œuvre de carte mémoire de meilleure qualité, une réécriture du gestionnaire de mémoire et une mise à jour de Lua vers la version 5.4.6. »",
      "De nouvelles fonctionnalités de la STL C++ ont été introduites, telles que l'optimisation des petites chaînes de caractères ctl::string, ctl::set, ctl::map et ctl::unique_ptr, ainsi que diverses corrections de bogues et optimisations."
    ],
    "commentSummary": [
      "« Cosmopolitan v3.5.0 a été publié, suscitant un intérêt considérable en raison de sa capacité à créer des exécutables hautement portables qui fonctionnent sur plusieurs systèmes d'exploitation et architectures sans modification. »",
      "« La nouvelle version offre des performances améliorées, avec des affirmations selon lesquelles Cosmopolitan Libc est deux fois plus rapide que Musl Libc pour de nombreux programmes en ligne de commande (CLI) et propose un support robuste des threads, ce qui la rend adaptée aux logiciels d'IA haute performance. »",
      "« La version inclut la prise en charge de WebAssembly (WASM) et des fonctionnalités telles que l'en-tête \"Actually Portable Executable\" (APE), qui améliore la compatibilité multiplateforme, y compris la prise en charge d'Android. »"
    ],
    "points": 301,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1719211800
  },
  {
    "id": 40773136,
    "title": "Le laboratoire secret de fabrication de silicium d'Apple à côté de milliers de maisons",
    "originLink": "https://www.ashleygjovik.com/3250scott.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40773136",
    "commentBody": "",
    "originSummary": [
      "« En 2015, Apple a commencé la fabrication secrète de semi-conducteurs dans une installation à Santa Clara, en Californie, qui a émis des gaz toxiques affectant les résidents à proximité. »",
      "Ashley M. Gjovik, résidente en 2020, a souffert de graves problèmes de santé et a découvert les émissions de l'usine dans sa maison et son corps, ce qui a conduit à de multiples plaintes et enquêtes.",
      "« Apple a été confrontée à des violations concernant les déchets dangereux et les problèmes de sécurité, avec des inspections et des enquêtes en cours sur les nuisances publiques et les activités ultra-dangereuses causant des dommages importants à Gjovik et à l'environnement. »"
    ],
    "commentSummary": [],
    "points": 269,
    "commentCount": 2,
    "retryCount": 0,
    "time": 1719211763
  },
  {
    "id": 40770171,
    "title": "« LINQPad – Le terrain de jeu du programmeur .NET »",
    "originLink": "https://www.linqpad.net/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40770171",
    "commentBody": "",
    "originSummary": [
      "LINQPad est un outil polyvalent pour les programmeurs .NET permettant de tester instantanément des extraits de code C#/F#/VB, d'interroger des bases de données et d'automatiser des scripts avec les avantages du REPL (Read-Eval-Print Loop).",
      "« Il prend en charge C# 12 et .NET 8, permettant des requêtes interactives de base de données en LINQ ou SQL, et inclut des pilotes pour plusieurs bases de données comme SQL Server, Oracle et MySQL. »",
      "« LINQPad offre des fonctionnalités avancées telles que l'autocomplétion par IA, le débogage intégré et un formatage de sortie riche, en faisant un outil puissant pour le codage rapide et le développement dynamique. »"
    ],
    "commentSummary": [
      "« LINQPad est très apprécié pour sa facilité d'utilisation, en particulier parmi les développeurs .NET, pour le scripting, le débogage et l'exécution de requêtes LINQ. »",
      "« Les utilisateurs apprécient ses fonctionnalités comme les connexions à la base de données SQL Server, mais expriment leur frustration quant à son exclusivité Windows et son coût. »",
      "Les alternatives mentionnées incluent winmerge, NetPad, dotnetfiddle.net et RoslynPad, certains utilisateurs souhaitant une prise en charge multiplateforme et une intégration dans Visual Studio."
    ],
    "points": 261,
    "commentCount": 116,
    "retryCount": 0,
    "time": 1719172953
  },
  {
    "id": 40776951,
    "title": "Les concessionnaires automobiles reviennent aux stylos et au papier après des cyberattaques contre le fournisseur de logiciels",
    "originLink": "https://apnews.com/article/car-dealerships-cyberattack-cdk-outage-3f7c81f6be0e212172b33cdc9f49feba",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40776951",
    "commentBody": "",
    "originSummary": [
      "Les concessionnaires automobiles en Amérique du Nord ont connu des perturbations importantes en raison de cyberattaques contre CDK Global, un fournisseur de logiciels clé pour les concessionnaires automobiles.",
      "« Les attaques du 19 juin 2024 ont provoqué des pannes continues, entraînant des retards et un traitement manuel dans les concessions touchées. »",
      "Les grandes entreprises automobiles comme Stellantis, Ford et BMW ont confirmé l'impact mais continuent leurs opérations en utilisant des méthodes alternatives, tandis que CDK Global travaille à la restauration de ses systèmes."
    ],
    "commentSummary": [
      "Les concessionnaires automobiles reviennent à l'utilisation de stylos et de papier après des cyberattaques sur leur fournisseur de logiciels, CDK Global, perturbant leurs opérations numériques.",
      "« Les cyberattaques ont gravement impacté les départements des pièces et des services plus que les ventes de véhicules neufs, car leurs informations d'inventaire sont stockées dans le système CDK compromis. »",
      "« L'incident met en évidence la vulnérabilité des industries fortement dépendantes d'un seul fournisseur de logiciels, soulignant la nécessité de meilleures mesures de cybersécurité et peut-être de solutions logicielles plus diversifiées. »"
    ],
    "points": 178,
    "commentCount": 260,
    "retryCount": 0,
    "time": 1719241762
  },
  {
    "id": 40772224,
    "title": "« Application et conformité de l'EPA des États-Unis sur la fabrication d'Apple »",
    "originLink": "https://www.dropbox.com/scl/fo/312oqvretg7yyhfx0ohx4/AGZduVXs0_1geqIyi0NA9nE?e=1&preview=2024_04_30_RCRA_Insp_Report_REPORT_Apple_3250_Scott_Redacted.pdf&rlkey=3aa2tw15ek3trqlbdh7pw9erh&st=4b364mkx&dl=0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40772224",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "« L'EPA des États-Unis enquête sur Apple pour d'éventuelles violations environnementales dans une installation de Santa Clara, en se concentrant sur la gestion et le rejet inappropriés de déchets dangereux. »",
      "Ancienne employée d'Apple, Ashley Gjovik a exprimé des préoccupations concernant les impacts sur la santé personnelle dus aux émissions de l'installation, bien que ses affirmations soient accueillies avec scepticisme.",
      "« L'affaire souligne les complexités de la régulation industrielle et de la responsabilité des entreprises, en établissant des comparaisons avec d'autres incidents industriels et des préoccupations concernant l'application des réglementations. »"
    ],
    "points": 163,
    "commentCount": 219,
    "retryCount": 0,
    "time": 1719195635
  },
  {
    "id": 40769880,
    "title": "Le bruit de la circulation nuit au cerveau des enfants",
    "originLink": "https://www.bbc.com/future/article/20240621-how-traffic-noise-pollution-harms-childrens-health-and-development",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40769880",
    "commentBody": "",
    "originSummary": [
      "Les enfants sont très vulnérables à la pollution sonore due à la circulation, ce qui affecte négativement leur santé et leurs capacités d'apprentissage.",
      "Des études, y compris une étude de 1975 par Arline Bronzaft et une étude de 2022 à Barcelone, montrent que la pollution sonore peut nuire à la performance en lecture, à la mémoire de travail et à la capacité d'attention chez les enfants.",
      "« Les villes comme Buenos Aires et Barcelone mettent en œuvre des mesures telles que l'amélioration des espaces verts et la réduction des limites de vitesse pour lutter contre la pollution sonore, avec des initiatives comme les \"superblocks\" de Barcelone qui donnent la priorité aux piétons et aux espaces verts plutôt qu'aux voitures. »"
    ],
    "commentSummary": [
      "« Une étude révèle que le bruit de la circulation routière aux abords des écoles est lié à un développement plus lent de la mémoire de travail et de l'attention chez les enfants. »",
      "« Les solutions potentielles incluent la réduction du trafic autour des écoles et l'insonorisation des salles de classe pour atténuer l'impact du bruit environnemental. »",
      "« La discussion aborde également des questions plus larges telles que la dépendance à la voiture, la pollution sonore et les avantages des environnements urbains plus calmes et propices à la marche. »"
    ],
    "points": 162,
    "commentCount": 127,
    "retryCount": 0,
    "time": 1719170425
  },
  {
    "id": 40775301,
    "title": "« Le guide de conversion de compte Microsoft en compte local a été supprimé du guide de Windows 11 »",
    "originLink": "https://www.tomshardware.com/software/windows/microsoft-account-to-local-account-conversion-guide-erased-from-official-windows-11-guide-instructions-redacted-earlier-this-week",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40775301",
    "commentBody": "",
    "originSummary": [
      "« Microsoft a supprimé le guide pour convertir un compte Microsoft en compte local de sa page de support Windows 11, à compter du 17 juin 2024. »",
      "Les utilisateurs peuvent toujours passer à un compte local manuellement via Paramètres > Comptes > Vos informations et en sélectionnant « Se connecter avec un compte local à la place. »",
      "« Cette action met en évidence la volonté de Microsoft d'inciter les utilisateurs à adopter des comptes Microsoft, en soulignant des avantages tels que l'intégration des services et une sécurité renforcée, s'alignant ainsi sur les stratégies de Google et Apple. »"
    ],
    "commentSummary": [
      "« Microsoft a supprimé le guide de conversion d'un compte Microsoft en compte local de la documentation de Windows 11. »",
      "Les utilisateurs discutent d'alternatives comme l'utilisation de la version LTSC (Long-Term Servicing Channel) de Windows 11, qui est généralement un produit destiné aux entreprises mais qui peut être activé via des scripts GitHub.",
      "« La conversation met en lumière le débat en cours sur l'éthique et la légalité de l'utilisation des scripts d'activation et les compromis entre Windows et Linux pour les jeux et l'informatique générale. »"
    ],
    "points": 161,
    "commentCount": 235,
    "retryCount": 0,
    "time": 1719232686
  },
  {
    "id": 40773749,
    "title": "CentOS Linux 7 atteindra sa fin de vie (EOL) dimanche",
    "originLink": "https://www.redhat.com/en/topics/linux/centos-linux-eol",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40773749",
    "commentBody": "",
    "originSummary": [
      "« CentOS Linux 7 atteindra sa fin de vie (EOL) le 30 juin 2024, ce qui signifie qu'il ne recevra plus de mises à jour ni de correctifs de sécurité après cette date. »",
      "« Red Hat propose plusieurs outils et services de migration, tels que Convert2RHEL, Red Hat Insights et Red Hat Consulting, pour aider les utilisateurs à passer à Red Hat Enterprise Linux (RHEL). »",
      "« RHEL offre une expérience utilisateur similaire à CentOS, avec des fonctionnalités supplémentaires, un support et une sécurité accrus, et est compatible avec les principaux fournisseurs de cloud et les déploiements de cloud hybride. »"
    ],
    "commentSummary": [
      "« CentOS Linux 7 atteindra sa fin de vie (EOL) dimanche, incitant les utilisateurs à chercher des alternatives. »",
      "« SUSE propose une solution en remplaçant les dépôts de mise à jour de CentOS 7 par ceux de SUSE, évitant ainsi des migrations perturbatrices, tandis qu'Oracle Linux est une autre option, bien que certains utilisateurs soient prudents à son égard. »",
      "« De nombreux utilisateurs passent à des alternatives comme Rocky Linux, AlmaLinux ou Debian, certains rencontrant des défis lors de la mise à niveau et envisageant des conteneurs pour atténuer les changements de système d'exploitation. »"
    ],
    "points": 142,
    "commentCount": 115,
    "retryCount": 0,
    "time": 1719218720
  },
  {
    "id": 40769867,
    "title": "« Dériver la POO typée dépendamment à partir des premiers principes »",
    "originLink": "https://arxiv.org/abs/2403.06707",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40769867",
    "commentBody": "",
    "originSummary": [
      "« L'article aborde le problème de l'expression, qui implique le défi d'étendre les types avec de nouveaux producteurs et consommateurs en programmation. »",
      "« Il explore la programmation orientée objet à types dépendants en la dérivant des premiers principes en utilisant la dualité, fournissant un calcul à types dépendants avec des fragments de langage dual. »",
      "« Cette version étendue comprend des annexes supplémentaires et fera partie du numéro PACMPL pour OOPSLA 2024, démontrant l'importance et la recherche continue dans ce domaine. »"
    ],
    "commentSummary": [
      "« L'article \"Deriving Dependently-Typed OOP from First Principles\" a suscité une discussion significative, recevant 141 points sur arxiv.org. »",
      "« Les discussions clés incluent l'essence de la programmation orientée objet (POO) par rapport à la programmation fonctionnelle (PF), certains utilisateurs notant que les exemples du document semblent plus fonctionnels que orientés objet. »",
      "« Diverses ressources et références ont été partagées, y compris l'article de William Cook sur l'abstraction des données, la conférence de Noel Welsh sur la programmation fonctionnelle et orientée objet, et le livre \"A Little Java, A Few Patterns\" pour comprendre les liens entre la programmation fonctionnelle et orientée objet. »"
    ],
    "points": 141,
    "commentCount": 14,
    "retryCount": 0,
    "time": 1719170341
  },
  {
    "id": 40774270,
    "title": "« Convertir une sonnette filaire existante en une sonnette intelligente en utilisant ESPHome »",
    "originLink": "https://frenck.dev/diy-smart-doorbell-for-just-2-dollar/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40774270",
    "commentBody": "",
    "originSummary": [
      "Cet article explique comment convertir une sonnette traditionnelle en une sonnette intelligente avec WiFi pour environ 2 $, sans nécessiter de soudure ni d'expertise en électronique.",
      "Le projet utilise une puce ESP-01S et un module relais, alimentés par un ancien chargeur de téléphone, et s'intègre avec Home Assistant et ESPHome pour diverses automatisations.",
      "« Des étapes détaillées sont fournies pour modifier la puce ESP-01S, flasher le firmware, câbler et intégrer avec Home Assistant, démontrant la facilité et l'abordabilité des projets de maison intelligente DIY. »"
    ],
    "commentSummary": [
      "« L'article traite de la conversion d'une sonnette filaire en une sonnette intelligente en utilisant ESPHome, en soulignant à la fois les points de défaillance potentiels et les avantages tels que les notifications à distance et l'intégration à l'automatisation domestique. »",
      "« Des exemples incluent l'utilisation d'une sonnette Amcrest AD110 pour le streaming vidéo local uniquement et des notifications personnalisées, ainsi que des suggestions pour utiliser des boutons Zigbee ou Z-Wave pour plus de simplicité. »",
      "« L'objectif principal est de démontrer la facilité et le plaisir des projets de maison intelligente en bricolage avec ESPHome et Home Assistant. »"
    ],
    "points": 135,
    "commentCount": 64,
    "retryCount": 0,
    "time": 1719224655
  },
  {
    "id": 40773957,
    "title": "EPA publie un rapport sur les violations des déchets dangereux d'Apple dans une usine de fabrication de silicium en milieu urbain",
    "originLink": "https://mastodon.social/@ashleygjovik/112668309100333232/?",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40773957",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "« Le rapport de l'EPA met en évidence les violations des déchets dangereux par Apple, en particulier le dégazage illégal de produits chimiques dangereux dans une usine de fabrication de silicium en milieu urbain. »",
      "« Apple n'a pas pris en compte tous les déchets passant par les filtres à charbon, rendant impossible l'évaluation du \"temps de percée\" des filtres, ce qui pourrait entraîner des fuites environnementales depuis décembre 2020. »",
      "« La discussion sur ce sujet a été déplacée vers un nouveau fil sur Hacker News, indiquant un intérêt significatif de la communauté. »"
    ],
    "points": 132,
    "commentCount": 4,
    "retryCount": 0,
    "time": 1719221000
  },
  {
    "id": 40770358,
    "title": "« L'économie du sac Birkin »",
    "originLink": "https://www.wsj.com/style/fashion/hermes-birkin-bag-investment-031c215c",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40770358",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "« Le marché des sacs à main Birkin prospère grâce à l'exclusivité et à la forte demande, les acheteurs disposant de 24 heures pour acheter, créant une excitation semblable à une loterie. »",
      "Les ventes sont limitées aux clients fidèles qui dépensent de manière significative sur d'autres articles, maintenant ainsi le statut du sac en tant que symbole et investissement.",
      "« Semblable au marché des baskets, ce modèle de disponibilité limitée et de service personnalisé assure le succès du marché du luxe grâce à la rareté et au prestige, attirant les consommateurs fortunés. »"
    ],
    "points": 126,
    "commentCount": 222,
    "retryCount": 0,
    "time": 1719174368
  }
]
