[
  {
    "id": 40774277,
    "title": "الميزات الصغيرة التي أحبها في المدونات والمواقع الشخصية",
    "originLink": "https://danilafe.com/blog/blog_microfeatures/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40774277",
    "commentBody": "",
    "originSummary": [
      "تسلط المشاركة الضوء على ميزات صغيرة متنوعة يمكن أن تعزز تجربة المستخدم على المدونات والمواقع الشخصية، مستوحاة من مقال هليل واين عن لغات البرمجة.",
      "تشمل الميزات الرئيسية الحواشي الجانبية، جداول المحتويات، العناوين القابلة للربط، تجميع السلاسل، الحوارات، كتل الأكواد مع المصدر والروابط القابلة للنقر، علامات الروابط الخارجية، معاينات الروابط، وتغذيات RSS.",
      "هذه الميزات، رغم أنها ليست أساسية، تحسن التنقل والتفاعل وسهولة الوصول، مما يجعل تجربة القراءة أكثر متعة وكفاءة."
    ],
    "commentSummary": [
      "تدور المناقشة حول الميزات الدقيقة في المدونات والمواقع الشخصية، مع تسليط الضوء على الجوانب الإيجابية والسلبية.",
      "تشمل النقاط الرئيسية للخلاف استخدام أشرطة التقدم، وزخارف الروابط، والنوافذ المنبثقة للمعاينة، حيث يجدها بعض المستخدمين مشتتة وغير ضرورية.",
      "تتناول المحادثة أيضًا تقلص أشرطة التمرير الأصلية والفوائد المحتملة لوسائل التنقل البديلة مثل جداول المحتويات والفهارس المرئية دائمًا."
    ],
    "points": 630,
    "commentCount": 270,
    "retryCount": 0,
    "time": 1719224711
  },
  {
    "id": 40773883,
    "title": "وجدت شركة آبل في انتهاك لقواعد المنافسة في الاتحاد الأوروبي",
    "originLink": "https://www.theguardian.com/technology/article/2024/jun/24/apple-breach-eu-competition-rules-digital-markets-act",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40773883",
    "commentBody": "",
    "originSummary": [
      "وجدت المفوضية الأوروبية أن شركة آبل انتهكت قوانين الاتحاد الأوروبي الجديدة التي تهدف إلى حماية المنافسين الأصغر وتمكين المستهلكين من العثور على تطبيقات أرخص.",
      "أمام شركة آبل 12 شهرًا للامتثال للوائح أو مواجهة غرامات تصل إلى 10% من إيراداتها العالمية، وذلك بعد تحقيق بدأ في مارس.",
      "يمثل هذا التحقيق الثالث في عدم الامتثال لشركة آبل منذ سن قانون الأسواق الرقمية (DMA)، ويركز على رسوم آبل وممارساتها التي تقيد المطورين من توجيه المستهلكين إلى خيارات شراء بديلة."
    ],
    "commentSummary": [
      "تم العثور على شركة آبل في انتهاك لقواعد المنافسة في الاتحاد الأوروبي، مما أثار دعوات لاتخاذ إجراءات مماثلة في الولايات المتحدة.",
      "يجادل النقاد بأن سيطرة شركة آبل على نشر التطبيقات ورسوم المطورين تخنق المنافسة، مع قلق خاص بشأن قواعد منع التوجيه التي تمنع المطورين من إبلاغ المستخدمين بخيارات الدفع الأرخص خارج متجر التطبيقات.",
      "تنتظر شركة آبل حكم محكمة الاتحاد الأوروبي بشأن دستورية الأحكام التي تتطلب توفير واجهات برمجة تطبيقات iOS مجانية للمطورين، وسط ادعاءات بأن امتثالها لقوانين الاتحاد الأوروبي سطحي."
    ],
    "points": 509,
    "commentCount": 493,
    "retryCount": 0,
    "time": 1719220256
  },
  {
    "id": 40773151,
    "title": "المدعون الأمريكيون يوصون وزارة العدل بتوجيه تهم جنائية لشركة بوينغ",
    "originLink": "https://www.voanews.com/a/us-prosecutors-recommend-justice-department-criminally-charge-boeing-as-deadline-looms/7667194.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40773151",
    "commentBody": "",
    "originSummary": [
      "المدعون العامون في الولايات المتحدة يقترحون توجيه تهم جنائية ضد شركة بوينغ بزعم انتهاكها لتسوية عام 2021 المتعلقة بحادثي تحطم طائرتين من طراز 737 ماكس.",
      "لدى وزارة العدل حتى السابع من يوليو لاتخاذ قرار بشأن الملاحقة القضائية، مع اعتراض بوينغ على ادعاءات الانتهاك واستمرار المناقشات.",
      "قد تؤدي التهم الجنائية إلى تفاقم أزمة بوينغ، مما يؤثر على عقودها مع الحكومة الأمريكية، بينما تدعو عائلات الضحايا إلى فرض غرامة قدرها 25 مليار دولار وملاحقة قضائية."
    ],
    "commentSummary": [
      "يوصي المدعون العامون في الولايات المتحدة بتوجيه تهم جنائية ضد شركة بوينغ، حيث يقترح البعض اتخاذ تدابير جذرية مثل مصادرة 51% من الشركة، وإقالة كبار التنفيذيين، وفرض غرامات.",
      "يجادل النقاد بأن المساهمين يفتقرون إلى القوة اللازمة لفرض الرقابة المناسبة، وغالبًا ما يفشل المستثمرون المؤسسيون في مراقبة سلوك الشركات بفعالية.",
      "تؤكد قضية بوينغ على قضايا نظامية أوسع في الحوكمة المؤسسية والإشراف التنظيمي."
    ],
    "points": 429,
    "commentCount": 332,
    "retryCount": 0,
    "time": 1719211984
  },
  {
    "id": 40773139,
    "title": "كوزموبوليتان v3.5.0",
    "originLink": "https://github.com/jart/cosmopolitan/releases/tag/3.5.0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40773139",
    "commentBody": "",
    "originSummary": [
      "تم إصدار Cosmopolitan Libc v3.5.0، مما يجعل لغة C لغة تُبنى مرة واحدة وتعمل في أي مكان دون الحاجة إلى مترجم أو آلة افتراضية.",
      "تشمل التحسينات الرئيسية تنفيذ خريطة ذاكرة بجودة أعلى، وإعادة كتابة مدير الذاكرة، وتحديث لغة Lua إلى الإصدار 5.4.6.",
      "تم تقديم ميزات جديدة في مكتبة القوالب القياسية (STL) في لغة C++، مثل تحسين السلاسل النصية الصغيرة في ctl::string، وctl::set، وctl::map، وctl::unique_ptr، بالإضافة إلى إصلاحات للأخطاء وتحسينات متنوعة."
    ],
    "commentSummary": [
      "تم إصدار Cosmopolitan v3.5.0، مما أثار اهتمامًا كبيرًا بسبب قدرته على إنشاء ملفات تنفيذية عالية النقل تعمل عبر أنظمة تشغيل وهياكل متعددة دون تعديل.",
      "تتميز النسخة الجديدة بأداء محسن، مع ادعاءات بأن مكتبة Cosmopolitan Libc أسرع بمرتين من مكتبة Musl Libc للعديد من برامج واجهة سطر الأوامر (CLI) وتوفر دعمًا قويًا للخيوط، مما يجعلها مناسبة لبرامج الذكاء الاصطناعي عالية الأداء.",
      "تشمل النسخة الجديدة دعم WebAssembly (WASM) وميزات مثل رأس \"Actually Portable Executable\" (APE)، الذي يعزز التوافق عبر الأنظمة الأساسية، بما في ذلك دعم نظام أندرويد."
    ],
    "points": 301,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1719211800
  },
  {
    "id": 40773136,
    "title": "مصنع السيليكون السري لشركة آبل بجوار آلاف المنازل",
    "originLink": "https://www.ashleygjovik.com/3250scott.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40773136",
    "commentBody": "",
    "originSummary": [
      "في عام 2015، بدأت شركة آبل في تصنيع أشباه الموصلات بشكل سري في منشأة في سانتا كلارا، كاليفورنيا، مما أدى إلى انبعاث غازات سامة أثرت على السكان القريبين.",
      "آشلي إم. جيوفيك، مقيمة في عام 2020، عانت من مشاكل صحية خطيرة واكتشفت وجود عوادم المصنع في منزلها وجسدها، مما أدى إلى تقديم شكاوى متعددة وإجراء تحقيقات.",
      "واجهت شركة آبل انتهاكات تتعلق بالنفايات الخطرة وقضايا السلامة، مع استمرار عمليات التفتيش والتحقيقات في الإزعاج العام والأنشطة فائقة الخطورة التي تسبب أضرارًا كبيرة لجوفك والبيئة."
    ],
    "commentSummary": [],
    "points": 269,
    "commentCount": 2,
    "retryCount": 0,
    "time": 1719211763
  },
  {
    "id": 40770171,
    "title": "LINQPad – ملعب مبرمج .NET",
    "originLink": "https://www.linqpad.net/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40770171",
    "commentBody": "",
    "originSummary": [
      "LINQPad هو أداة متعددة الاستخدامات لمبرمجي .NET لاختبار مقتطفات C#/F#/VB على الفور، واستعلام قواعد البيانات، وأتمتة النصوص البرمجية مع فوائد REPL (حلقة القراءة والتقييم والطباعة).",
      "يدعم C# 12 و .NET 8، مما يتيح استعلامات قاعدة البيانات التفاعلية في LINQ أو SQL، ويتضمن برامج تشغيل لعدة قواعد بيانات مثل SQL Server و Oracle و MySQL.",
      "يقدم LINQPad ميزات متقدمة مثل الإكمال التلقائي بالذكاء الاصطناعي، وتصحيح الأخطاء المدمج، وتنسيق الإخراج الغني، مما يجعله أداة قوية للبرمجة السريعة والتطوير الديناميكي."
    ],
    "commentSummary": [
      "يُعتبر LINQPad موضع تقدير كبير لسهولة استخدامه، خاصة بين مطوري .NET، في كتابة السكريبتات وتصحيح الأخطاء وتشغيل استعلامات LINQ.",
      "يقدر المستخدمون ميزاته مثل اتصالات قاعدة بيانات SQL Server لكنهم يعبرون عن إحباطهم بسبب حصرية استخدامه على نظام Windows وتكلفته.",
      "تشمل البدائل المذكورة WinMerge وNetPad وdotnetfiddle.net وRoslynPad، مع رغبة بعض المستخدمين في دعم عبر الأنظمة الأساسية والتكامل مع Visual Studio."
    ],
    "points": 261,
    "commentCount": 116,
    "retryCount": 0,
    "time": 1719172953
  },
  {
    "id": 40776951,
    "title": "تعود وكالات السيارات إلى الأقلام والورق بعد الهجمات الإلكترونية على مزود البرمجيات",
    "originLink": "https://apnews.com/article/car-dealerships-cyberattack-cdk-outage-3f7c81f6be0e212172b33cdc9f49feba",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40776951",
    "commentBody": "",
    "originSummary": [
      "شهدت وكالات السيارات في أمريكا الشمالية اضطرابات كبيرة بسبب الهجمات الإلكترونية على شركة CDK Global، وهي مزود رئيسي للبرمجيات لوكلاء السيارات.",
      "تسببت الهجمات في 19 يونيو 2024 في انقطاعات مستمرة، مما أدى إلى تأخيرات ومعالجة يدوية في الوكالات المتضررة.",
      "أكدت شركات السيارات الكبرى مثل ستيلانتس وفورد وبي إم دبليو تأثير الحادث لكنها تواصل العمليات باستخدام طرق بديلة، بينما تعمل شركة CDK Global على استعادة أنظمتها."
    ],
    "commentSummary": [
      "تعود وكالات السيارات إلى استخدام الأقلام والورق بعد الهجمات الإلكترونية على مزود البرمجيات الخاص بها، CDK Global، مما أدى إلى تعطيل عملياتها الرقمية.",
      "لقد أثرت الهجمات الإلكترونية بشكل كبير على أقسام الأجزاء والخدمات أكثر من مبيعات السيارات الجديدة، حيث يتم تخزين معلومات مخزونها في نظام CDK المخترق.",
      "تسلط الحادثة الضوء على ضعف الصناعات التي تعتمد بشكل كبير على مزود برمجيات واحد، مما يؤكد الحاجة إلى تحسين تدابير الأمن السيبراني وربما حلول برمجية أكثر تنوعًا."
    ],
    "points": 178,
    "commentCount": 260,
    "retryCount": 0,
    "time": 1719241762
  },
  {
    "id": 40772224,
    "title": "إنفاذ وكالة حماية البيئة الأمريكية والامتثال في تصنيع أبل",
    "originLink": "https://www.dropbox.com/scl/fo/312oqvretg7yyhfx0ohx4/AGZduVXs0_1geqIyi0NA9nE?e=1&preview=2024_04_30_RCRA_Insp_Report_REPORT_Apple_3250_Scott_Redacted.pdf&rlkey=3aa2tw15ek3trqlbdh7pw9erh&st=4b364mkx&dl=0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40772224",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "تقوم وكالة حماية البيئة الأمريكية بالتحقيق مع شركة آبل بشأن انتهاكات بيئية محتملة في منشأة سانتا كلارا، مع التركيز على التعامل غير السليم وإطلاق النفايات الخطرة.",
      "أثارت الموظفة السابقة في شركة آبل، آشلي جيوفيك، مخاوف بشأن التأثيرات الصحية الشخصية الناجمة عن انبعاثات المنشأة، على الرغم من أن ادعاءاتها قوبلت بالتشكيك.",
      "تؤكد القضية على تعقيدات التنظيم الصناعي والمسؤولية الشركاتية، مما يثير مقارنات مع حوادث صناعية أخرى ومخاوف بشأن تنفيذ اللوائح التنظيمية."
    ],
    "points": 163,
    "commentCount": 219,
    "retryCount": 0,
    "time": 1719195635
  },
  {
    "id": 40769880,
    "title": "ضوضاء المرور تؤذي أدمغة الأطفال",
    "originLink": "https://www.bbc.com/future/article/20240621-how-traffic-noise-pollution-harms-childrens-health-and-development",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40769880",
    "commentBody": "",
    "originSummary": [
      "الأطفال معرضون بشدة لتلوث الضوضاء المرورية، مما يؤثر سلبًا على صحتهم وقدراتهم التعليمية.",
      "تُظهر الدراسات، بما في ذلك دراسة أجرتها أرلين برونزافت في عام 1975 ودراسة أخرى في برشلونة عام 2022، أن التلوث الضوضائي يمكن أن يؤثر سلبًا على أداء القراءة والذاكرة العاملة ومدى الانتباه لدى الأطفال.",
      "مدن مثل بوينس آيرس وبرشلونة تقوم بتنفيذ تدابير مثل تحسين المساحات الخضراء وتقليل حدود السرعة لمكافحة التلوث الضوضائي، مع مبادرات مثل \"الكتل الفائقة\" في برشلونة التي تعطي الأولوية للمشاة والمساحات الخضراء على حساب السيارات."
    ],
    "commentSummary": [
      "تكشف دراسة أن ضوضاء حركة المرور على الطرق بالقرب من المدارس مرتبطة بتطور أبطأ لذاكرة العمل والانتباه لدى الأطفال.",
      "تشمل الحلول المحتملة تقليل حركة المرور حول المدارس وعزل الفصول الدراسية صوتيًا للتخفيف من تأثير الضوضاء البيئية.",
      "تناقش المناقشة أيضًا قضايا أوسع مثل الاعتماد على السيارات، والتلوث الضوضائي، ومزايا البيئات الحضرية الهادئة والقابلة للمشي."
    ],
    "points": 162,
    "commentCount": 127,
    "retryCount": 0,
    "time": 1719170425
  },
  {
    "id": 40775301,
    "title": "تم حذف دليل تحويل حساب Microsoft إلى حساب محلي من دليل Windows 11",
    "originLink": "https://www.tomshardware.com/software/windows/microsoft-account-to-local-account-conversion-guide-erased-from-official-windows-11-guide-instructions-redacted-earlier-this-week",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40775301",
    "commentBody": "",
    "originSummary": [
      "أزالت مايكروسوفت الدليل الخاص بتحويل حساب مايكروسوفت إلى حساب محلي من صفحة دعم ويندوز 11، وذلك اعتبارًا من 17 يونيو 2024.",
      "لا يزال بإمكان المستخدمين التبديل إلى حساب محلي يدويًا عبر الإعدادات > الحسابات > معلوماتك واختيار \"تسجيل الدخول باستخدام حساب محلي بدلاً من ذلك\".",
      "تسلط هذه الخطوة الضوء على دفع مايكروسوفت للمستخدمين لاعتماد حسابات مايكروسوفت، مع التأكيد على فوائد مثل تكامل الخدمات وتعزيز الأمان، بما يتماشى مع استراتيجيات جوجل وآبل."
    ],
    "commentSummary": [
      "أزالت مايكروسوفت الدليل الخاص بتحويل حساب مايكروسوفت إلى حساب محلي من وثائق ويندوز 11.",
      "يناقش المستخدمون بدائل مثل استخدام إصدار LTSC (قناة الخدمة طويلة الأجل) من ويندوز 11، والذي يكون عادة منتجًا مخصصًا للمؤسسات ولكنه يمكن تفعيله من خلال سكريبتات GitHub.",
      "تسلط المحادثة الضوء على النقاش المستمر حول أخلاقيات وقانونية استخدام نصوص التفعيل والمفاضلات بين نظامي التشغيل ويندوز ولينكس للألعاب والحوسبة العامة."
    ],
    "points": 161,
    "commentCount": 235,
    "retryCount": 0,
    "time": 1719232686
  },
  {
    "id": 40773749,
    "title": "سوف يصل نظام CentOS Linux 7 إلى نهاية عمره الافتراضي يوم الأحد",
    "originLink": "https://www.redhat.com/en/topics/linux/centos-linux-eol",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40773749",
    "commentBody": "",
    "originSummary": [
      "سوف يصل نظام CentOS Linux 7 إلى نهاية عمره الافتراضي (EOL) في 30 يونيو 2024، مما يعني أنه لن يتلقى أي تحديثات أو تصحيحات أمنية بعد هذا التاريخ.",
      "تقدم Red Hat العديد من أدوات وخدمات الهجرة، مثل Convert2RHEL وRed Hat Insights وRed Hat Consulting، لمساعدة المستخدمين في الانتقال إلى Red Hat Enterprise Linux (RHEL).",
      "يوفر RHEL تجربة مستخدم مشابهة لـ CentOS، مع ميزات إضافية ودعم وأمان، وهو متوافق مع مزودي الخدمات السحابية الرئيسيين ونشر السحابة الهجينة."
    ],
    "commentSummary": [
      "سيصل نظام CentOS Linux 7 إلى نهاية عمره الافتراضي (EOL) يوم الأحد، مما يدفع المستخدمين للبحث عن بدائل.",
      "تقدم SUSE حلاً من خلال تحويل مستودعات تحديث CentOS 7 إلى مستودعات SUSE، مما يتجنب عمليات الترحيل المزعجة، بينما يُعتبر Oracle Linux خيارًا آخر، على الرغم من أن بعض المستخدمين يتوخون الحذر بشأنه.",
      "ينتقل العديد من المستخدمين إلى بدائل مثل Rocky Linux وAlmaLinux وDebian، حيث يواجه البعض تحديات في الترقية ويفكرون في استخدام الحاويات للتخفيف من تغييرات نظام التشغيل."
    ],
    "points": 142,
    "commentCount": 115,
    "retryCount": 0,
    "time": 1719218720
  },
  {
    "id": 40769867,
    "title": "اشتقاق البرمجة الكائنية المعتمدة على الأنواع من المبادئ الأولى",
    "originLink": "https://arxiv.org/abs/2403.06707",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40769867",
    "commentBody": "",
    "originSummary": [
      "تتناول الورقة مشكلة التعبير، التي تتضمن تحدي توسيع الأنواع بمنتجين ومستهلكين جدد في البرمجة.",
      "يستكشف البرمجة الكائنية التوجه ذات الأنواع المعتمدة من خلال اشتقاقها من المبادئ الأولى باستخدام الثنائية، مما يوفر حسابًا ذا أنواع معتمدة مع شظايا لغوية ثنائية.",
      "تتضمن هذه النسخة الموسعة ملاحق إضافية وستكون جزءًا من إصدار PACMPL لمؤتمر OOPSLA 2024، مما يوضح الأهمية والأبحاث المستمرة في هذا المجال."
    ],
    "commentSummary": [
      "أثارت الورقة البحثية \"اشتقاق البرمجة الكائنية المعتمدة على الأنواع من المبادئ الأولى\" نقاشًا كبيرًا، حيث حصلت على 141 نقطة على موقع arxiv.org.",
      "تشمل المناقشات الرئيسية جوهر البرمجة الكائنية (OOP) مقابل البرمجة الوظيفية (FP)، مع ملاحظة بعض المستخدمين أن أمثلة الورقة تبدو أكثر وظيفية من كونها كائنية.",
      "تمت مشاركة موارد ومراجع متنوعة، بما في ذلك ورقة ويليام كوك حول تجريد البيانات، ومحاضرة نويل ويلش عن البرمجة الوظيفية والبرمجة الكائنية، وكتاب \"قليل من جافا، بعض الأنماط\" لفهم الروابط بين البرمجة الوظيفية والبرمجة الكائنية."
    ],
    "points": 141,
    "commentCount": 14,
    "retryCount": 0,
    "time": 1719170341
  },
  {
    "id": 40774270,
    "title": "تحويل جرس الباب السلكي الحالي إلى جرس باب ذكي باستخدام ESPHome",
    "originLink": "https://frenck.dev/diy-smart-doorbell-for-just-2-dollar/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40774270",
    "commentBody": "",
    "originSummary": [
      "تشرح المقالة كيفية تحويل جرس الباب التقليدي إلى جرس ذكي يعمل بتقنية الواي فاي بتكلفة تقارب 2 دولار، دون الحاجة إلى لحام أو خبرة في الإلكترونيات.",
      "يستخدم المشروع شريحة ESP-01S ووحدة تتابع، ويعمل بواسطة شاحن هاتف قديم، ويتكامل مع Home Assistant وESPHome للقيام بمختلف الأتمتة.",
      "تُقدَّم خطوات مفصلة لتعديل شريحة ESP-01S، وتثبيت البرامج الثابتة، والتوصيل، والتكامل مع Home Assistant، مما يُظهر سهولة وفعالية تكلفة مشاريع المنازل الذكية التي يمكن تنفيذها بنفسك."
    ],
    "commentSummary": [
      "تناقش المقالة تحويل جرس الباب السلكي إلى جرس باب ذكي باستخدام ESPHome، مسلطة الضوء على نقاط الفشل المحتملة والفوائد مثل الإشعارات عن بُعد وتكامل أتمتة المنزل.",
      "تشمل الأمثلة استخدام جرس الباب Amcrest AD110 لبث الفيديو المحلي فقط والإشعارات المخصصة، واقتراحات لاستخدام أزرار Zigbee أو Z-Wave للبساطة.",
      "الهدف الرئيسي هو إظهار سهولة ومتعة مشاريع المنزل الذكي التي تقوم بها بنفسك باستخدام ESPHome وHome Assistant."
    ],
    "points": 135,
    "commentCount": 64,
    "retryCount": 0,
    "time": 1719224655
  },
  {
    "id": 40773957,
    "title": "وكالة حماية البيئة تصدر تقريرًا عن انتهاكات آبل للنفايات الخطرة في مصنع السيليكون الحضري",
    "originLink": "https://mastodon.social/@ashleygjovik/112668309100333232/?",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40773957",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "تقرير وكالة حماية البيئة يسلط الضوء على انتهاكات آبل للنفايات الخطرة، وخاصة التهوية غير القانونية للمواد الكيميائية الخطرة في مصنع السيليكون الحضري.",
      "فشلت شركة آبل في حساب جميع النفايات التي تمر عبر مرشحات الكربون، مما جعل من المستحيل تقييم \"وقت الاختراق\" للمرشحات، مما قد يؤدي إلى تسربات بيئية منذ ديسمبر 2020.",
      "تم نقل النقاش حول هذا الموضوع إلى سلسلة جديدة على Hacker News، مما يشير إلى اهتمام كبير من المجتمع."
    ],
    "points": 132,
    "commentCount": 4,
    "retryCount": 0,
    "time": 1719221000
  },
  {
    "id": 40770358,
    "title": "اقتصاديات حقيبة بيركن",
    "originLink": "https://www.wsj.com/style/fashion/hermes-birkin-bag-investment-031c215c",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40770358",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "يزدهر سوق حقائب بيركن على الحصرية والطلب العالي، حيث يُمنح المشترون 24 ساعة للشراء، مما يخلق إثارة تشبه اليانصيب.",
      "تقتصر المبيعات على العملاء المخلصين الذين ينفقون بشكل كبير على عناصر أخرى، مما يحافظ على مكانة الحقيبة كرمز واستثمار.",
      "على غرار سوق الأحذية الرياضية، يضمن هذا النموذج من التوافر المحدود والخدمة الشخصية نجاح سوق الرفاهية من خلال الندرة والهيبة، مما يجذب المستهلكين الأثرياء."
    ],
    "points": 126,
    "commentCount": 222,
    "retryCount": 0,
    "time": 1719174368
  }
]
