[
  {
    "id": 40774277,
    "title": "Микрофункции, которые мне нравятся в блогах и личных сайтах",
    "originLink": "https://danilafe.com/blog/blog_microfeatures/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40774277",
    "commentBody": "",
    "originSummary": [
      "«Пост подчеркивает различные микрофункции, которые могут улучшить пользовательский опыт на блогах и персональных сайтах, вдохновленные статьей Хиллеля Уэйна о языках программирования.»",
      "Ключевые особенности включают сноски, оглавления, заголовки с возможностью перехода по ссылкам, группировку серий, диалоги, блоки кода с указанием источника и кликабельными ссылками, маркеры для внешних ссылок, предварительный просмотр ссылок и RSS-ленты.",
      "Эти функции, хотя и не являются обязательными, улучшают навигацию, вовлеченность и доступность, делая процесс чтения более приятным и эффективным."
    ],
    "commentSummary": [
      "Обсуждение касается микрофункций в блогах и личных веб-сайтах, подчеркивая как положительные, так и отрицательные аспекты.",
      "Ключевые моменты разногласий включают использование индикаторов прогресса, украшений ссылок и всплывающих окон предварительного просмотра, которые некоторые пользователи считают отвлекающими и ненужными.",
      "Разговор также касается уменьшения размеров родных полос прокрутки и потенциальных преимуществ альтернативных средств навигации, таких как оглавления и всегда видимые указатели."
    ],
    "points": 630,
    "commentCount": 270,
    "retryCount": 0,
    "time": 1719224711
  },
  {
    "id": 40773883,
    "title": "Apple признана нарушившей правила конкуренции ЕС",
    "originLink": "https://www.theguardian.com/technology/article/2024/jun/24/apple-breach-eu-competition-rules-digital-markets-act",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40773883",
    "commentBody": "",
    "originSummary": [
      "«Европейская комиссия признала Apple нарушившей новые законы ЕС, направленные на защиту меньших конкурентов и предоставление потребителям возможности находить более дешевые приложения.»",
      "У Apple есть 12 месяцев, чтобы соответствовать требованиям регуляторов, иначе ей грозят штрафы до 10% от ее глобальных доходов, в результате расследования, начатого в марте.",
      "Это отмечает третье расследование несоблюдения в отношении Apple с момента принятия Закона о цифровых рынках (DMA), сосредоточенное на комиссиях Apple и практиках, которые ограничивают разработчиков в направлении потребителей к альтернативным вариантам покупки."
    ],
    "commentSummary": [
      "Apple признана нарушившей правила конкуренции ЕС, что вызвало призывы к аналогичным действиям в США.",
      "«Критики утверждают, что контроль Apple над публикацией приложений и сбором платы с разработчиков подавляет конкуренцию, особенно беспокоят правила, запрещающие разработчикам информировать пользователей о более дешевых вариантах оплаты вне App Store.»",
      "Apple ожидает решения суда ЕС о конституционности положений, требующих бесплатных API для разработчиков iOS, на фоне заявлений о том, что ее соблюдение законов ЕС является поверхностным."
    ],
    "points": 509,
    "commentCount": 493,
    "retryCount": 0,
    "time": 1719220256
  },
  {
    "id": 40773151,
    "title": "Прокуроры США рекомендуют Министерству юстиции предъявить уголовные обвинения компании Boeing",
    "originLink": "https://www.voanews.com/a/us-prosecutors-recommend-justice-department-criminally-charge-boeing-as-deadline-looms/7667194.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40773151",
    "commentBody": "",
    "originSummary": [
      "Прокуроры США предлагают выдвинуть уголовные обвинения против Boeing за якобы нарушение соглашения 2021 года, касающегося двух смертельных аварий 737 MAX.",
      "Министерство юстиции должно принять решение о возбуждении уголовного дела до 7 июля, при этом Boeing оспаривает обвинения в нарушениях, и продолжаются обсуждения.",
      "Уголовные обвинения могут усугубить кризис Boeing, повлияв на его контракты с правительством США, в то время как семьи жертв выступают за штраф в размере 25 миллиардов долларов и судебное преследование."
    ],
    "commentSummary": [
      "Прокуроры США рекомендуют выдвинуть уголовные обвинения против Boeing, при этом некоторые предлагают радикальные меры, такие как экспроприация 51% компании, увольнение высших руководителей и наложение штрафов.",
      "Критики утверждают, что акционеры не обладают достаточной властью для обеспечения надлежащего контроля, а институциональные инвесторы часто не справляются с эффективным мониторингом корпоративного поведения.",
      "Дело Boeing подчеркивает более широкие системные проблемы в корпоративном управлении и регуляторном надзоре."
    ],
    "points": 429,
    "commentCount": 332,
    "retryCount": 0,
    "time": 1719211984
  },
  {
    "id": 40773139,
    "title": "«Cosmopolitan v3.5.0»",
    "originLink": "https://github.com/jart/cosmopolitan/releases/tag/3.5.0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40773139",
    "commentBody": "",
    "originSummary": [
      "«Выпущена Cosmopolitan Libc v3.5.0, превращающая C в язык, который можно собрать один раз и запускать где угодно, без необходимости в интерпретаторе или виртуальной машине.»",
      "«Ключевые улучшения включают реализацию карты памяти более высокого качества, переписывание менеджера памяти и обновление Lua до версии 5.4.6.»",
      "«Новые функции STL C++ введены, такие как оптимизация малых строк в ctl::string, ctl::set, ctl::map и ctl::unique_ptr, а также различные исправления ошибок и оптимизации.»"
    ],
    "commentSummary": [
      "«Вышла версия Cosmopolitan v3.5.0, вызвав значительный интерес благодаря своей способности создавать высокопереносимые исполняемые файлы, которые работают на различных операционных системах и архитектурах без модификации.»",
      "«Новая версия отличается улучшенной производительностью, утверждается, что Cosmopolitan Libc в два раза быстрее, чем Musl Libc для многих программ с интерфейсом командной строки (CLI), и предлагает надежную поддержку потоков, что делает его подходящим для высокопроизводительного программного обеспечения ИИ.»",
      "Релиз включает поддержку WebAssembly (WASM) и такие функции, как заголовок \"Actually Portable Executable\" (APE), который улучшает кроссплатформенную совместимость, включая поддержку Android."
    ],
    "points": 301,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1719211800
  },
  {
    "id": 40773136,
    "title": "Секретная фабрика по производству кремния Apple рядом с тысячами домов",
    "originLink": "https://www.ashleygjovik.com/3250scott.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40773136",
    "commentBody": "",
    "originSummary": [
      "В 2015 году Apple начала секретное производство полупроводников на предприятии в Санта-Кларе, Калифорния, что привело к выбросу токсичных газов, повлиявших на жителей ближайших районов.",
      "Ашли М. Гьовик, проживавшая в 2020 году, страдала от серьезных проблем со здоровьем и обнаружила выхлопы завода в своем доме и организме, что привело к многочисленным жалобам и расследованиям.",
      "Apple столкнулась с нарушениями в области опасных отходов и вопросов безопасности, с продолжающимися проверками и расследованиями по поводу общественных неудобств и ультраопасных действий, наносящих значительный вред Гёвик и окружающей среде."
    ],
    "commentSummary": [],
    "points": 269,
    "commentCount": 2,
    "retryCount": 0,
    "time": 1719211763
  },
  {
    "id": 40770171,
    "title": "LINQPad – Площадка для программистов .NET",
    "originLink": "https://www.linqpad.net/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40770171",
    "commentBody": "",
    "originSummary": [
      "LINQPad — это универсальный инструмент для программистов .NET, позволяющий мгновенно тестировать фрагменты кода на C#/F#/VB, выполнять запросы к базам данных и автоматизировать скрипты с преимуществами REPL (Read-Eval-Print Loop).",
      "Он поддерживает C# 12 и .NET 8, позволяя выполнять интерактивные запросы к базе данных на LINQ или SQL, и включает драйверы для нескольких баз данных, таких как SQL Server, Oracle и MySQL.",
      "LINQPad предлагает расширенные функции, такие как автозаполнение с использованием ИИ, интегрированная отладка и богатое форматирование вывода, что делает его мощным инструментом для быстрого кодирования и динамической разработки."
    ],
    "commentSummary": [
      "LINQPad высоко ценится за его простоту использования, особенно среди разработчиков .NET, для написания скриптов, отладки и выполнения запросов LINQ.",
      "Пользователи ценят его функции, такие как подключения к базе данных SQL Server, но выражают разочарование из-за эксклюзивности для Windows и стоимости.",
      "В качестве альтернатив упоминаются winmerge, NetPad, dotnetfiddle.net и RoslynPad, при этом некоторые пользователи хотят поддержки кроссплатформенности и интеграции в Visual Studio."
    ],
    "points": 261,
    "commentCount": 116,
    "retryCount": 0,
    "time": 1719172953
  },
  {
    "id": 40776951,
    "title": "Автосалоны возвращаются к ручкам и бумаге после кибератак на поставщика программного обеспечения",
    "originLink": "https://apnews.com/article/car-dealerships-cyberattack-cdk-outage-3f7c81f6be0e212172b33cdc9f49feba",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40776951",
    "commentBody": "",
    "originSummary": [
      "Автосалоны в Северной Америке столкнулись с серьезными перебоями из-за кибератак на CDK Global, ключевого поставщика программного обеспечения для автодилеров.",
      "Нападения 19 июня 2024 года вызвали продолжающиеся перебои, что привело к задержкам и ручной обработке в пострадавших автосалонах.",
      "Крупные автопроизводители, такие как Stellantis, Ford и BMW, подтвердили влияние, но продолжают работу, используя альтернативные методы, в то время как CDK Global работает над восстановлением своих систем."
    ],
    "commentSummary": [
      "Автосалоны возвращаются к использованию ручек и бумаги после кибератак на их поставщика программного обеспечения, CDK Global, что нарушило их цифровые операции.",
      "Кибератаки серьезно повлияли на отделы запчастей и обслуживания больше, чем на продажи новых автомобилей, так как информация об их запасах хранится в скомпрометированной системе CDK.",
      "Инцидент подчеркивает уязвимость отраслей, сильно зависящих от одного поставщика программного обеспечения, акцентируя необходимость улучшения мер кибербезопасности и, возможно, более диверсифицированных программных решений."
    ],
    "points": 178,
    "commentCount": 260,
    "retryCount": 0,
    "time": 1719241762
  },
  {
    "id": 40772224,
    "title": "Принудительное исполнение и соблюдение требований Агентства по охране окружающей среды США в отношении производства Apple",
    "originLink": "https://www.dropbox.com/scl/fo/312oqvretg7yyhfx0ohx4/AGZduVXs0_1geqIyi0NA9nE?e=1&preview=2024_04_30_RCRA_Insp_Report_REPORT_Apple_3250_Scott_Redacted.pdf&rlkey=3aa2tw15ek3trqlbdh7pw9erh&st=4b364mkx&dl=0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40772224",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "EPA США расследует возможные экологические нарушения Apple на объекте в Санта-Кларе, сосредотачиваясь на неправильном обращении и выбросе опасных отходов.",
      "Бывший сотрудник Apple Эшли Гьовик выразила обеспокоенность по поводу влияния выбросов с предприятия на личное здоровье, хотя её утверждения встречают с недоверием.",
      "Этот случай подчеркивает сложность промышленного регулирования и корпоративной ответственности, вызывая сравнения с другими промышленными инцидентами и опасениями по поводу соблюдения нормативных требований."
    ],
    "points": 163,
    "commentCount": 219,
    "retryCount": 0,
    "time": 1719195635
  },
  {
    "id": 40769880,
    "title": "Шум от дорожного движения вредит мозгу детей",
    "originLink": "https://www.bbc.com/future/article/20240621-how-traffic-noise-pollution-harms-childrens-health-and-development",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40769880",
    "commentBody": "",
    "originSummary": [
      "Дети особенно уязвимы к шумовому загрязнению от транспорта, что негативно сказывается на их здоровье и способности к обучению.",
      "Исследования, включая исследование Арлайн Бронзафт 1975 года и исследование в Барселоне 2022 года, показывают, что шумовое загрязнение может ухудшать навыки чтения, рабочую память и концентрацию внимания у детей.",
      "Такие города, как Буэнос-Айрес и Барселона, внедряют меры по улучшению зеленых зон и снижению скоростных ограничений для борьбы с шумовым загрязнением, с инициативами, такими как «суперкварталы» в Барселоне, которые отдают приоритет пешеходам и зеленым зонам вместо автомобилей."
    ],
    "commentSummary": [
      "«Исследование показывает, что шум дорожного движения возле школ связан с более медленным развитием рабочей памяти и внимания у детей.»",
      "Возможные решения включают уменьшение трафика вокруг школ и звукоизоляцию классов для снижения воздействия шума окружающей среды.",
      "Обсуждение также затрагивает более широкие вопросы, такие как зависимость от автомобилей, шумовое загрязнение и преимущества более тихих, пригодных для пеших прогулок городских сред."
    ],
    "points": 162,
    "commentCount": 127,
    "retryCount": 0,
    "time": 1719170425
  },
  {
    "id": 40775301,
    "title": "Руководство по преобразованию учетной записи Microsoft в локальную учетную запись удалено из руководства по Windows 11",
    "originLink": "https://www.tomshardware.com/software/windows/microsoft-account-to-local-account-conversion-guide-erased-from-official-windows-11-guide-instructions-redacted-earlier-this-week",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40775301",
    "commentBody": "",
    "originSummary": [
      "Microsoft удалила руководство по преобразованию учетной записи Microsoft в локальную учетную запись со страницы поддержки Windows 11, начиная с 17 июня 2024 года.",
      "Пользователи все еще могут вручную переключиться на локальную учетную запись через Настройки > Учетные записи > Ваша информация и выбрав «Войти с локальной учетной записью вместо этого».",
      "Этот шаг подчеркивает стремление Microsoft побудить пользователей к использованию учетных записей Microsoft, акцентируя внимание на таких преимуществах, как интеграция сервисов и повышенная безопасность, что соответствует стратегиям Google и Apple."
    ],
    "commentSummary": [
      "Microsoft удалила руководство по преобразованию учетной записи Microsoft в локальную учетную запись из документации Windows 11.",
      "Пользователи обсуждают альтернативы, такие как использование версии Windows 11 LTSC (Long-Term Servicing Channel), которая обычно является корпоративным продуктом, но может быть активирована с помощью скриптов на GitHub.",
      "«Разговор подчеркивает продолжающиеся дебаты об этике и законности использования активационных скриптов, а также о компромиссах между Windows и Linux для игр и общего использования компьютера.»"
    ],
    "points": 161,
    "commentCount": 235,
    "retryCount": 0,
    "time": 1719232686
  },
  {
    "id": 40773749,
    "title": "CentOS Linux 7 достигнет конца срока службы в воскресенье",
    "originLink": "https://www.redhat.com/en/topics/linux/centos-linux-eol",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40773749",
    "commentBody": "",
    "originSummary": [
      "CentOS Linux 7 достигнет конца срока службы (EOL) 30 июня 2024 года, что означает, что после этой даты он больше не будет получать обновления или исправления безопасности.",
      "Red Hat предлагает несколько инструментов и услуг для миграции, таких как Convert2RHEL, Red Hat Insights и Red Hat Consulting, чтобы помочь пользователям перейти на Red Hat Enterprise Linux (RHEL).",
      "RHEL предоставляет аналогичный пользовательский опыт с CentOS, с дополнительными функциями, поддержкой и безопасностью, и совместим с основными облачными провайдерами и гибридными облачными развертываниями."
    ],
    "commentSummary": [
      "CentOS Linux 7 достигнет конца срока службы (EOL) в воскресенье, что побуждает пользователей искать альтернативы.",
      "Компания SUSE предлагает решение, переключая репозитории обновлений CentOS 7 на свои, избегая разрушительных миграций, в то время как Oracle Linux является еще одним вариантом, хотя некоторые пользователи относятся к нему с осторожностью.",
      "Многие пользователи переходят на альтернативы, такие как Rocky Linux, AlmaLinux или Debian, сталкиваясь с трудностями при обновлении и рассматривая контейнеры для смягчения изменений в операционной системе."
    ],
    "points": 142,
    "commentCount": 115,
    "retryCount": 0,
    "time": 1719218720
  },
  {
    "id": 40769867,
    "title": "Выведение объектно-ориентированного программирования с зависимыми типами из первых принципов",
    "originLink": "https://arxiv.org/abs/2403.06707",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40769867",
    "commentBody": "",
    "originSummary": [
      "«В статье рассматривается проблема выражения, которая связана с задачей расширения типов новыми производителями и потребителями в программировании.»",
      "Он исследует объектно-ориентированное программирование с зависимыми типами, выводя его из первых принципов с использованием двойственности, предоставляя исчисление с зависимыми типами с двойными языковыми фрагментами.",
      "«Эта расширенная версия включает дополнительные приложения и будет частью выпуска PACMPL для OOPSLA 2024, демонстрируя значимость и продолжающиеся исследования в этой области.»"
    ],
    "commentSummary": [
      "Статья «Выведение объектно-ориентированного программирования с зависимыми типами из первых принципов» вызвала значительные обсуждения, набрав 141 балл на arxiv.org.",
      "Ключевые обсуждения включают суть объектно-ориентированного программирования (ООП) по сравнению с функциональным программированием (ФП), при этом некоторые пользователи отмечают, что примеры в статье кажутся более функциональными, чем объектно-ориентированными.",
      "Были поделены различные ресурсы и ссылки, включая статью Уильяма Кука о абстракции данных, доклад Ноэля Уэлша о функциональном и объектно-ориентированном программировании, а также книгу «Немного Java, несколько паттернов» для понимания связей между функциональным и объектно-ориентированным программированием."
    ],
    "points": 141,
    "commentCount": 14,
    "retryCount": 0,
    "time": 1719170341
  },
  {
    "id": 40774270,
    "title": "Преобразуйте существующий проводной дверной звонок в умный дверной звонок с помощью ESPHome",
    "originLink": "https://frenck.dev/diy-smart-doorbell-for-just-2-dollar/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40774270",
    "commentBody": "",
    "originSummary": [
      "Статья объясняет, как преобразовать традиционный дверной звонок в умный, подключенный к WiFi звонок примерно за 2 доллара, без необходимости пайки или знаний в области электроники.",
      "Проект использует чип ESP-01S и модуль реле, питается от старого зарядного устройства для телефона и интегрируется с Home Assistant и ESPHome для различных автоматизаций.",
      "Подробные шаги предоставлены для модификации чипа ESP-01S, прошивки микропрограммы, подключения и интеграции с Home Assistant, демонстрируя простоту и доступность проектов умного дома своими руками."
    ],
    "commentSummary": [
      "Статья обсуждает преобразование проводного дверного звонка в умный дверной звонок с использованием ESPHome, подчеркивая как возможные точки отказа, так и преимущества, такие как удаленные уведомления и интеграция с домашней автоматизацией.",
      "Примеры включают использование дверного звонка Amcrest AD110 для локальной потоковой передачи видео и пользовательских уведомлений, а также предложения по использованию кнопок Zigbee или Z-Wave для простоты.",
      "«Основная цель - продемонстрировать простоту и удовольствие от проектов умного дома своими руками с использованием ESPHome и Home Assistant.»"
    ],
    "points": 135,
    "commentCount": 64,
    "retryCount": 0,
    "time": 1719224655
  },
  {
    "id": 40773957,
    "title": "EPA выпускает отчет о нарушениях Apple в области опасных отходов на городском кремниевом заводе",
    "originLink": "https://mastodon.social/@ashleygjovik/112668309100333232/?",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40773957",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Отчет EPA подчеркивает нарушения Apple в области опасных отходов, в частности незаконный выброс опасных химикатов на городском кремниевом заводе.",
      "Apple не смогла учесть все отходы, проходящие через угольные фильтры, что делает невозможным оценку «времени прорыва» фильтров, что потенциально может привести к утечкам в окружающую среду с декабря 2020 года.",
      "«Обсуждение этой темы было перенесено в новую ветку на Hacker News, что свидетельствует о значительном интересе сообщества.»"
    ],
    "points": 132,
    "commentCount": 4,
    "retryCount": 0,
    "time": 1719221000
  },
  {
    "id": 40770358,
    "title": "Экономика сумки Birkin",
    "originLink": "https://www.wsj.com/style/fashion/hermes-birkin-bag-investment-031c215c",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40770358",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Рынок сумок Birkin процветает благодаря эксклюзивности и высокому спросу, покупателям дается 24 часа на покупку, что создает азарт, похожий на лотерею.",
      "Продажи ограничены лояльными клиентами, которые значительно тратятся на другие товары, поддерживая статус сумки как символа и инвестиции.",
      "«Подобно рынку кроссовок, эта модель ограниченной доступности и персонализированного обслуживания обеспечивает успех рынка роскоши за счет дефицита и престижа, привлекая состоятельных потребителей.»"
    ],
    "points": 126,
    "commentCount": 222,
    "retryCount": 0,
    "time": 1719174368
  }
]
