[
  {
    "id": 40774277,
    "title": "Fitur mikro yang saya sukai di blog dan situs web pribadi",
    "originLink": "https://danilafe.com/blog/blog_microfeatures/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40774277",
    "commentBody": "",
    "originSummary": [
      "Postingan tersebut menyoroti berbagai fitur mikro yang dapat meningkatkan pengalaman pengguna di blog dan situs web pribadi, terinspirasi oleh artikel Hillel Wayne tentang bahasa pemrograman.",
      "Fitur utama termasuk catatan samping, daftar isi, judul yang dapat ditautkan, pengelompokan seri, dialog, blok kode dengan asal dan tautan yang dapat diklik, penanda untuk tautan eksternal, pratinjau tautan, dan umpan RSS.",
      "Fitur-fitur ini, meskipun tidak esensial, meningkatkan navigasi, keterlibatan, dan aksesibilitas, sehingga membuat pengalaman membaca lebih menyenangkan dan efisien."
    ],
    "commentSummary": [
      "Diskusi berpusat pada mikrofitur dalam blog dan situs web pribadi, menyoroti baik aspek positif maupun negatif.",
      "Hal-hal yang menjadi poin perdebatan meliputi penggunaan bilah kemajuan, dekorasi tautan, dan popup pratinjau, dengan beberapa pengguna merasa bahwa hal-hal tersebut mengganggu dan tidak perlu.",
      "Percakapan tersebut juga menyentuh tentang penyusutan scrollbar asli dan potensi manfaat dari alat navigasi alternatif seperti daftar isi dan indeks yang selalu terlihat."
    ],
    "points": 630,
    "commentCount": 270,
    "retryCount": 0,
    "time": 1719224711
  },
  {
    "id": 40773883,
    "title": "Apple ditemukan melanggar aturan persaingan UE",
    "originLink": "https://www.theguardian.com/technology/article/2024/jun/24/apple-breach-eu-competition-rules-digital-markets-act",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40773883",
    "commentBody": "",
    "originSummary": [
      "Komisi Eropa menemukan bahwa Apple melanggar undang-undang baru Uni Eropa yang bertujuan melindungi pesaing yang lebih kecil dan memungkinkan konsumen menemukan aplikasi yang lebih murah.",
      "Apple memiliki waktu 12 bulan untuk mematuhi peraturan atau menghadapi denda hingga 10% dari pendapatan globalnya, setelah penyelidikan yang dimulai pada bulan Maret.",
      "Ini menandai investigasi ketidakpatuhan ketiga terhadap Apple sejak Undang-Undang Pasar Digital (DMA) diberlakukan, yang berfokus pada biaya dan praktik Apple yang membatasi pengembang untuk mengarahkan konsumen ke opsi pembelian alternatif."
    ],
    "commentSummary": [
      "Apple telah ditemukan melanggar aturan persaingan UE, memicu seruan untuk tindakan serupa di AS.",
      "Kritikus berpendapat bahwa kontrol Apple atas penerbitan aplikasi dan biaya pengembang menghambat persaingan, dengan kekhawatiran khusus terhadap aturan anti-steering yang mencegah pengembang memberi tahu pengguna tentang opsi pembayaran yang lebih murah di luar App Store.",
      "Apple menunggu putusan Pengadilan Uni Eropa mengenai konstitusionalitas ketentuan yang mewajibkan API iOS gratis untuk pengembang, di tengah klaim bahwa kepatuhannya terhadap hukum Uni Eropa bersifat dangkal."
    ],
    "points": 509,
    "commentCount": 493,
    "retryCount": 0,
    "time": 1719220256
  },
  {
    "id": 40773151,
    "title": "Jaksa AS merekomendasikan Departemen Kehakiman untuk menuntut Boeing secara pidana",
    "originLink": "https://www.voanews.com/a/us-prosecutors-recommend-justice-department-criminally-charge-boeing-as-deadline-looms/7667194.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40773151",
    "commentBody": "",
    "originSummary": [
      "Jaksa AS menyarankan dakwaan pidana terhadap Boeing karena diduga melanggar penyelesaian tahun 2021 terkait dua kecelakaan fatal 737 MAX.",
      "Kementerian Kehakiman memiliki waktu hingga 7 Juli untuk memutuskan penuntutan, dengan Boeing membantah klaim pelanggaran dan diskusi yang sedang berlangsung.",
      "Kasus pidana dapat memperburuk krisis Boeing, mempengaruhi kontrak mereka dengan pemerintah AS, sementara keluarga korban mengadvokasi denda sebesar $25 miliar dan penuntutan."
    ],
    "commentSummary": [
      "Kejaksaan AS merekomendasikan dakwaan pidana terhadap Boeing, dengan beberapa pihak menyarankan langkah-langkah drastis seperti mengambil alih 51% saham perusahaan, memecat eksekutif puncak, dan mengenakan denda.",
      "Kritikus berpendapat bahwa pemegang saham tidak memiliki kekuatan untuk menegakkan pengawasan yang tepat, dan investor institusional sering kali gagal memantau perilaku perusahaan secara efektif.",
      "Terkait kasus Boeing, hal ini menyoroti masalah sistemik yang lebih luas dalam tata kelola perusahaan dan pengawasan regulasi."
    ],
    "points": 429,
    "commentCount": 332,
    "retryCount": 0,
    "time": 1719211984
  },
  {
    "id": 40773139,
    "title": "Kosmopolitan v3.5.0",
    "originLink": "https://github.com/jart/cosmopolitan/releases/tag/3.5.0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40773139",
    "commentBody": "",
    "originSummary": [
      "Cosmopolitan Libc v3.5.0 telah dirilis, menjadikan C sebagai bahasa yang dapat dibangun sekali dan dijalankan di mana saja tanpa memerlukan interpreter atau mesin virtual.",
      "Kemajuan utama mencakup implementasi peta memori berkualitas lebih tinggi, penulisan ulang manajer memori, dan pembaruan Lua ke 5.4.6.",
      "Fitur-fitur baru C++ STL diperkenalkan, seperti optimasi string kecil ctl::string, ctl::set, ctl::map, dan ctl::unique_ptr, bersama dengan berbagai perbaikan bug dan optimasi."
    ],
    "commentSummary": [
      "Cosmopolitan v3.5.0 telah dirilis, menarik minat yang signifikan karena kemampuannya untuk membuat executable yang sangat portabel yang dapat berjalan di berbagai sistem operasi dan arsitektur tanpa modifikasi.",
      "Versi baru ini menawarkan kinerja yang ditingkatkan, dengan klaim bahwa Cosmopolitan Libc dua kali lebih cepat daripada Musl Libc untuk banyak program antarmuka baris perintah (CLI) dan menawarkan dukungan thread yang kuat, menjadikannya cocok untuk perangkat lunak AI berkinerja tinggi.",
      "Rilis ini mencakup dukungan untuk WebAssembly (WASM) dan fitur-fitur seperti header \"Actually Portable Executable\" (APE), yang meningkatkan kompatibilitas lintas platform, termasuk dukungan untuk Android."
    ],
    "points": 301,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1719211800
  },
  {
    "id": 40773136,
    "title": "Fasilitas fabrikasi silikon rahasia Apple di sebelah ribuan rumah",
    "originLink": "https://www.ashleygjovik.com/3250scott.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40773136",
    "commentBody": "",
    "originSummary": [
      "Pada tahun 2015, Apple memulai pembuatan semikonduktor secara rahasia di sebuah fasilitas di Santa Clara, California, yang mengeluarkan gas beracun yang mempengaruhi penduduk sekitar.",
      "Ashley M. Gjovik, seorang penduduk pada tahun 2020, mengalami masalah kesehatan yang parah dan menemukan asap pabrik di rumah dan tubuhnya, yang mengarah pada berbagai keluhan dan penyelidikan.",
      "Apple menghadapi pelanggaran terkait limbah berbahaya dan masalah keselamatan, dengan inspeksi dan investigasi yang sedang berlangsung terkait gangguan publik dan aktivitas ultraberbahaya yang menyebabkan kerugian signifikan bagi Gjovik dan lingkungan."
    ],
    "commentSummary": [],
    "points": 269,
    "commentCount": 2,
    "retryCount": 0,
    "time": 1719211763
  },
  {
    "id": 40770171,
    "title": "LINQPad – Tempat Bermain Programmer .NET",
    "originLink": "https://www.linqpad.net/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40770171",
    "commentBody": "",
    "originSummary": [
      "LINQPad adalah alat serbaguna untuk pemrogram .NET untuk menguji cuplikan C#/F#/VB secara instan, melakukan query pada basis data, dan mengotomatisasi skrip dengan manfaat REPL (Read-Eval-Print Loop).",
      "Itu mendukung C# 12 dan .NET 8, memungkinkan kueri basis data interaktif dalam LINQ atau SQL, dan menyertakan driver untuk berbagai basis data seperti SQL Server, Oracle, dan MySQL.",
      "LINQPad menawarkan fitur-fitur canggih seperti penyelesaian otomatis AI, debugging terintegrasi, dan pemformatan output yang kaya, menjadikannya alat yang kuat untuk pengkodean cepat dan pengembangan dinamis."
    ],
    "commentSummary": [
      "LINQPad sangat dihargai karena kemudahan penggunaannya, terutama di kalangan pengembang .NET, untuk scripting, debugging, dan menjalankan kueri LINQ.",
      "Pengguna menghargai fitur-fiturnya seperti koneksi database SQL Server tetapi mengungkapkan frustrasi atas eksklusivitas Windows dan biayanya.",
      "Alternatif yang disebutkan termasuk winmerge, NetPad, dotnetfiddle.net, dan RoslynPad, dengan beberapa pengguna menginginkan dukungan lintas platform dan integrasi ke dalam Visual Studio."
    ],
    "points": 261,
    "commentCount": 116,
    "retryCount": 0,
    "time": 1719172953
  },
  {
    "id": 40776951,
    "title": "Kantor penjualan mobil kembali menggunakan pena dan kertas setelah serangan siber pada penyedia perangkat lunak",
    "originLink": "https://apnews.com/article/car-dealerships-cyberattack-cdk-outage-3f7c81f6be0e212172b33cdc9f49feba",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40776951",
    "commentBody": "",
    "originSummary": [
      "Kantor penjualan mobil di Amerika Utara mengalami gangguan signifikan akibat serangan siber terhadap CDK Global, penyedia perangkat lunak utama untuk dealer mobil.",
      "Serangan pada 19 Juni 2024 menyebabkan pemadaman yang berkelanjutan, yang mengakibatkan penundaan dan pemrosesan manual di dealer yang terkena dampak.",
      "Perusahaan otomotif besar seperti Stellantis, Ford, dan BMW mengonfirmasi dampaknya tetapi tetap melanjutkan operasi menggunakan metode alternatif, sementara CDK Global bekerja untuk memulihkan sistemnya."
    ],
    "commentSummary": [
      "Dealer mobil kembali menggunakan pena dan kertas setelah serangan siber pada penyedia perangkat lunak mereka, CDK Global, mengganggu operasi digital mereka.",
      "Serangan siber telah sangat mempengaruhi bagian suku cadang dan layanan lebih dari penjualan kendaraan baru, karena informasi inventaris mereka disimpan dalam sistem CDK yang telah dikompromikan.",
      "Insiden tersebut menyoroti kerentanan industri yang sangat bergantung pada satu penyedia perangkat lunak, menekankan perlunya langkah-langkah keamanan siber yang lebih baik dan mungkin solusi perangkat lunak yang lebih beragam."
    ],
    "points": 178,
    "commentCount": 260,
    "retryCount": 0,
    "time": 1719241762
  },
  {
    "id": 40772224,
    "title": "Penegakan dan Kepatuhan EPA AS pada Pembuatan Apple",
    "originLink": "https://www.dropbox.com/scl/fo/312oqvretg7yyhfx0ohx4/AGZduVXs0_1geqIyi0NA9nE?e=1&preview=2024_04_30_RCRA_Insp_Report_REPORT_Apple_3250_Scott_Redacted.pdf&rlkey=3aa2tw15ek3trqlbdh7pw9erh&st=4b364mkx&dl=0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40772224",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "The US EPA sedang menyelidiki Apple atas potensi pelanggaran lingkungan di fasilitas Santa Clara, dengan fokus pada penanganan dan pelepasan limbah berbahaya yang tidak semestinya.",
      "Bekas karyawan Apple, Ashley Gjovik, telah mengemukakan kekhawatiran tentang dampak kesehatan pribadi dari emisi fasilitas tersebut, meskipun klaimnya disambut dengan skeptisisme.",
      "Kasus ini menyoroti kompleksitas regulasi industri dan tanggung jawab korporasi, dengan membandingkannya dengan insiden industri lainnya dan kekhawatiran tentang penegakan regulasi."
    ],
    "points": 163,
    "commentCount": 219,
    "retryCount": 0,
    "time": 1719195635
  },
  {
    "id": 40769880,
    "title": "Suara lalu lintas merusak otak anak-anak",
    "originLink": "https://www.bbc.com/future/article/20240621-how-traffic-noise-pollution-harms-childrens-health-and-development",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40769880",
    "commentBody": "",
    "originSummary": [
      "Anak-anak sangat rentan terhadap polusi kebisingan lalu lintas, yang berdampak negatif pada kesehatan dan kemampuan belajar mereka.",
      "Studi-studi, termasuk studi tahun 1975 oleh Arline Bronzaft dan studi tahun 2022 di Barcelona, menunjukkan bahwa polusi suara dapat mengganggu kinerja membaca, memori kerja, dan rentang perhatian pada anak-anak.",
      "Kota-kota seperti Buenos Aires dan Barcelona sedang menerapkan langkah-langkah seperti meningkatkan ruang hijau dan mengurangi batas kecepatan untuk memerangi polusi suara, dengan inisiatif seperti 'superblocks' di Barcelona yang memprioritaskan pejalan kaki dan ruang hijau daripada mobil."
    ],
    "commentSummary": [
      "Studi mengungkapkan bahwa kebisingan lalu lintas jalan di sekolah terkait dengan perkembangan yang lebih lambat dari memori kerja dan perhatian anak-anak.",
      "Solusi potensial termasuk mengurangi lalu lintas di sekitar sekolah dan meredam suara di ruang kelas untuk mengurangi dampak kebisingan lingkungan.",
      "Diskusi tersebut juga membahas isu-isu yang lebih luas seperti ketergantungan pada mobil, polusi suara, dan keuntungan dari lingkungan perkotaan yang lebih tenang dan dapat dijelajahi dengan berjalan kaki."
    ],
    "points": 162,
    "commentCount": 127,
    "retryCount": 0,
    "time": 1719170425
  },
  {
    "id": 40775301,
    "title": "Panduan konversi Akun Microsoft ke akun lokal dihapus dari panduan Windows 11",
    "originLink": "https://www.tomshardware.com/software/windows/microsoft-account-to-local-account-conversion-guide-erased-from-official-windows-11-guide-instructions-redacted-earlier-this-week",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40775301",
    "commentBody": "",
    "originSummary": [
      "Microsoft telah menghapus panduan untuk mengonversi Akun Microsoft ke akun lokal dari halaman dukungan Windows 11, efektif mulai 17 Juni 2024.",
      "Pengguna masih dapat beralih ke akun lokal secara manual melalui Pengaturan > Akun > Info Anda dan memilih \"Masuk dengan akun lokal sebagai gantinya.\"",
      "Langkah ini menyoroti dorongan Microsoft bagi pengguna untuk mengadopsi Akun Microsoft, dengan menekankan manfaat seperti integrasi layanan dan peningkatan keamanan, sejalan dengan strategi dari Google dan Apple."
    ],
    "commentSummary": [
      "Microsoft telah menghapus panduan untuk mengonversi Akun Microsoft ke akun lokal dari dokumentasi Windows 11.",
      "Pengguna sedang mendiskusikan alternatif seperti menggunakan versi LTSC (Long-Term Servicing Channel) dari Windows 11, yang biasanya merupakan produk perusahaan tetapi dapat diaktifkan melalui skrip GitHub.",
      "Percakapan tersebut menyoroti perdebatan yang sedang berlangsung tentang etika dan legalitas penggunaan skrip aktivasi serta pertimbangan antara Windows dan Linux untuk gaming dan komputasi umum."
    ],
    "points": 161,
    "commentCount": 235,
    "retryCount": 0,
    "time": 1719232686
  },
  {
    "id": 40773749,
    "title": "CentOS Linux 7 akan mencapai EOL pada hari Minggu",
    "originLink": "https://www.redhat.com/en/topics/linux/centos-linux-eol",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40773749",
    "commentBody": "",
    "originSummary": [
      "CentOS Linux 7 akan mencapai Akhir Masa Pakai (EOL) pada 30 Juni 2024, yang berarti tidak akan lagi menerima pembaruan atau tambalan keamanan setelah tanggal ini.",
      "Red Hat menawarkan beberapa alat dan layanan migrasi, seperti Convert2RHEL, Red Hat Insights, dan Red Hat Consulting, untuk membantu pengguna dalam beralih ke Red Hat Enterprise Linux (RHEL).",
      "RHEL menyediakan pengalaman pengguna yang mirip dengan CentOS, dengan fitur tambahan, dukungan, dan keamanan, serta kompatibel dengan penyedia cloud utama dan penerapan cloud hybrid."
    ],
    "commentSummary": [
      "CentOS Linux 7 akan mencapai Akhir Masa Pakai (EOL) pada hari Minggu, mendorong pengguna untuk mencari alternatif.",
      "SUSE menawarkan solusi dengan mengalihkan repositori pembaruan CentOS 7 ke milik SUSE, menghindari migrasi yang mengganggu, sementara Oracle Linux adalah opsi lain, meskipun beberapa pengguna berhati-hati terhadapnya.",
      "Banyak pengguna beralih ke alternatif seperti Rocky Linux, AlmaLinux, atau Debian, dengan beberapa menghadapi tantangan dalam peningkatan dan mempertimbangkan kontainer untuk mengurangi perubahan OS."
    ],
    "points": 142,
    "commentCount": 115,
    "retryCount": 0,
    "time": 1719218720
  },
  {
    "id": 40769867,
    "title": "Keturunan OOP Berjenis Tergantung dari Prinsip-Prinsip Pertama",
    "originLink": "https://arxiv.org/abs/2403.06707",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40769867",
    "commentBody": "",
    "originSummary": [
      "The paper addresses the expression problem, which involves the challenge of extending types with new producers and consumers in programming.",
      "Teks ini mengeksplorasi pemrograman berorientasi objek dengan tipe tergantung dengan menurunkannya dari prinsip-prinsip pertama menggunakan dualitas, menyediakan kalkulus bertipe tergantung dengan fragmen bahasa ganda.",
      "Versi yang diperpanjang ini mencakup lampiran tambahan dan akan menjadi bagian dari edisi PACMPL untuk OOPSLA 2024, menunjukkan pentingnya dan penelitian yang sedang berlangsung di bidang ini."
    ],
    "commentSummary": [
      "Kertas kerja 'Deriving Dependently-Typed OOP from First Principles' telah memicu diskusi yang signifikan, menerima 141 poin di arxiv.org.",
      "Diskusi utama mencakup esensi dari Pemrograman Berorientasi Objek (OOP) versus Pemrograman Fungsional (FP), dengan beberapa pengguna mencatat bahwa contoh-contoh dalam makalah tersebut tampak lebih fungsional daripada berorientasi objek.",
      "Berbagai sumber dan referensi dibagikan, termasuk makalah William Cook tentang abstraksi data, ceramah Noel Welsh tentang FP dan OO, serta buku \"A Little Java, A Few Patterns\" untuk memahami hubungan antara pemrograman fungsional dan OO."
    ],
    "points": 141,
    "commentCount": 14,
    "retryCount": 0,
    "time": 1719170341
  },
  {
    "id": 40774270,
    "title": "Ubah bel pintu berkabel yang ada menjadi bel pintu pintar menggunakan ESPHome",
    "originLink": "https://frenck.dev/diy-smart-doorbell-for-just-2-dollar/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40774270",
    "commentBody": "",
    "originSummary": [
      "Artikel tersebut menjelaskan cara mengubah bel pintu tradisional menjadi bel pintu pintar yang terhubung dengan WiFi dengan biaya sekitar $2, tanpa memerlukan penyolderan atau keahlian elektronik.",
      "Kami menggunakan chip ESP-01S dan modul relay dalam proyek ini, yang ditenagai oleh charger ponsel lama, serta terintegrasi dengan Home Assistant dan ESPHome untuk berbagai otomatisasi.",
      "Langkah-langkah terperinci disediakan untuk memodifikasi chip ESP-01S, mem-flash firmware, menghubungkan kabel, dan mengintegrasikan dengan Home Assistant, menunjukkan kemudahan dan keterjangkauan proyek rumah pintar DIY."
    ],
    "commentSummary": [
      "Artikel tersebut membahas tentang mengubah bel pintu berkabel menjadi bel pintu pintar menggunakan ESPHome, dengan menyoroti baik titik-titik kegagalan potensial maupun manfaat seperti notifikasi jarak jauh dan integrasi otomatisasi rumah.",
      "Contohnya termasuk menggunakan bel pintu Amcrest AD110 untuk streaming video lokal saja dan notifikasi khusus, serta saran untuk menggunakan tombol Zigbee atau Z-Wave untuk kesederhanaan.",
      "Tujuan utamanya adalah untuk menunjukkan kemudahan dan kesenangan dari proyek rumah pintar DIY dengan ESPHome dan Home Assistant."
    ],
    "points": 135,
    "commentCount": 64,
    "retryCount": 0,
    "time": 1719224655
  },
  {
    "id": 40773957,
    "title": "EPA merilis laporan tentang pelanggaran limbah berbahaya Apple di pabrik silikon perkotaan",
    "originLink": "https://mastodon.social/@ashleygjovik/112668309100333232/?",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40773957",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Keterangan EPA menyoroti pelanggaran limbah berbahaya oleh Apple, terutama pembuangan ilegal bahan kimia berbahaya di pabrik silikon perkotaan.",
      "Apple gagal memperhitungkan semua limbah yang melewati filter karbon, sehingga tidak mungkin untuk menilai \"waktu terobosan\" filter tersebut, yang berpotensi menyebabkan kebocoran lingkungan sejak Desember 2020.",
      "Kajian mengenai topik ini telah dipindahkan ke thread baru di Hacker News, menunjukkan minat yang signifikan dari komunitas."
    ],
    "points": 132,
    "commentCount": 4,
    "retryCount": 0,
    "time": 1719221000
  },
  {
    "id": 40770358,
    "title": "Ekonomi tas Birkin",
    "originLink": "https://www.wsj.com/style/fashion/hermes-birkin-bag-investment-031c215c",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40770358",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Pasar tas Birkin berkembang berkat eksklusivitas dan permintaan tinggi, dengan pembeli diberi waktu 24 jam untuk membeli, menciptakan kegembiraan seperti lotere.",
      "Penjualan dibatasi untuk pelanggan setia yang menghabiskan banyak uang untuk barang-barang lain, menjaga status tas sebagai simbol dan investasi.",
      "Mirip dengan pasar sepatu kets, model ketersediaan terbatas dan layanan yang dipersonalisasi ini memastikan kesuksesan pasar barang mewah melalui kelangkaan dan prestise, menarik konsumen kaya."
    ],
    "points": 126,
    "commentCount": 222,
    "retryCount": 0,
    "time": 1719174368
  }
]
