[
  {
    "id": 40774277,
    "title": "Microfunksjoner jeg elsker i blogger og personlige nettsteder",
    "originLink": "https://danilafe.com/blog/blog_microfeatures/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40774277",
    "commentBody": "",
    "originSummary": [
      "Innlegget fremhever ulike mikrofunksjoner som kan forbedre brukeropplevelsen på blogger og personlige nettsteder, inspirert av Hillel Waynes artikkel om programmeringsspråk.",
      "Viktige funksjoner inkluderer sidemerknader, innholdsfortegnelser, lenkbare overskrifter, seriergruppering, dialoger, kodeblokker med opprinnelse og klikkbare lenker, markører for eksterne lenker, lenkeforhåndsvisninger og RSS-feeder.",
      "Disse funksjonene, selv om de ikke er essensielle, forbedrer navigasjon, engasjement og tilgjengelighet, noe som gjør leseopplevelsen mer fornøyelig og effektiv."
    ],
    "commentSummary": [
      "Diskusjonen dreier seg om mikrofunksjoner i blogger og personlige nettsteder, og fremhever både positive og negative aspekter.",
      "Viktige stridspunkter inkluderer bruken av fremdriftslinjer, lenkedekorasjoner og forhåndsvisningspopups, med noen brukere som finner dem distraherende og unødvendige.",
      "Diskusjonen berører også krympingen av native rullefelt og de potensielle fordelene med alternative navigasjonshjelpemidler som innholdsfortegnelser og alltid synlige indekser."
    ],
    "points": 630,
    "commentCount": 270,
    "retryCount": 0,
    "time": 1719224711
  },
  {
    "id": 40773883,
    "title": "Apple funnet i brudd på EUs konkurranseregler",
    "originLink": "https://www.theguardian.com/technology/article/2024/jun/24/apple-breach-eu-competition-rules-digital-markets-act",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40773883",
    "commentBody": "",
    "originSummary": [
      "EU-kommisjonen har funnet at Apple bryter nye EU-lover som tar sikte på å beskytte mindre konkurrenter og gjøre det mulig for forbrukere å finne billigere apper.",
      "Apple har 12 måneder på seg til å overholde forskriftene eller risikere bøter på opptil 10 % av sine globale inntekter, etter en etterforskning som ble igangsatt i mars.",
      "Dette markerer den tredje etterforskningen av manglende overholdelse mot Apple siden loven om digitale markeder (DMA) ble vedtatt, med fokus på Apples avgifter og praksis som begrenser utviklere fra å lede forbrukere til alternative kjøpsalternativer."
    ],
    "commentSummary": [
      "Apple har blitt funnet i strid med EUs konkurranseregler, noe som har utløst krav om lignende tiltak i USA.",
      "Kritikere hevder at Apples kontroll over app-publisering og utvikleravgifter hemmer konkurransen, med særlig bekymring over anti-styringsregler som forhindrer utviklere fra å informere brukere om billigere betalingsalternativer utenfor App Store.",
      "Apple venter på en EU-domstolsavgjørelse om grunnlovsmessigheten av bestemmelser som krever gratis iOS API-er for utviklere, midt i påstander om at selskapets overholdelse av EU-lover er overfladisk."
    ],
    "points": 509,
    "commentCount": 493,
    "retryCount": 0,
    "time": 1719220256
  },
  {
    "id": 40773151,
    "title": "Amerikanske påtalemyndigheter anbefaler at Justisdepartementet straffeforfølger Boeing",
    "originLink": "https://www.voanews.com/a/us-prosecutors-recommend-justice-department-criminally-charge-boeing-as-deadline-looms/7667194.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40773151",
    "commentBody": "",
    "originSummary": [
      "Amerikanske påtalemyndigheter foreslår strafferettslige anklager mot Boeing for angivelig å ha brutt en avtale fra 2021 angående to dødelige 737 MAX-ulykker.",
      "Justisdepartementet har frist til 7. juli for å avgjøre om det skal reises tiltale, med Boeing som bestrider påstandene om brudd og pågående diskusjoner.",
      "Kriminelle anklager kan forverre Boeings krise, påvirke selskapets kontrakter med den amerikanske regjeringen, mens ofrenes familier går inn for en bot på 25 milliarder dollar og rettsforfølgelse."
    ],
    "commentSummary": [
      "Amerikanske påtalemyndigheter anbefaler strafferettslige anklager mot Boeing, med noen som foreslår drastiske tiltak som å ekspropriere 51% av selskapet, sparke toppledere og ilegge bøter.",
      "Kritikere hevder at aksjonærene mangler makt til å håndheve skikkelig tilsyn, og institusjonelle investorer ofte ikke klarer å overvåke bedriftens atferd effektivt.",
      "Boing-saken understreker bredere systemiske problemer i selskapsstyring og reguleringstilsyn."
    ],
    "points": 429,
    "commentCount": 332,
    "retryCount": 0,
    "time": 1719211984
  },
  {
    "id": 40773139,
    "title": "Cosmopolitan v3.5.0",
    "originLink": "https://github.com/jart/cosmopolitan/releases/tag/3.5.0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40773139",
    "commentBody": "",
    "originSummary": [
      "Cosmopolitan Libc v3.5.0 har blitt utgitt, noe som gjør C til et bygg-en-gang kjør-hvor-som-helst språk uten behov for en tolk eller virtuell maskin.",
      "Viktige forbedringer inkluderer en implementering av minnekart av høyere kvalitet, en omskriving av minneadministratoren, og oppdatert Lua til 5.4.6.",
      "Ny C++ STL-funksjoner introdusert, som ctl::string small-string optimalisering, ctl::set, ctl::map, og ctl::unique_ptr, sammen med ulike feilrettinger og optimaliseringer."
    ],
    "commentSummary": [
      "Cosmopolitan v3.5.0 har blitt lansert, og har skapt betydelig interesse på grunn av sin evne til å lage svært bærbare kjørbare filer som kan kjøres på tvers av flere operativsystemer og arkitekturer uten modifikasjon.",
      "Den nye versjonen kan skilte med forbedret ytelse, med påstander om at Cosmopolitan Libc er dobbelt så rask som Musl Libc for mange kommandolinjegrensesnitt (CLI) programmer og tilbyr robust trådstøtte, noe som gjør den egnet for høyytelses AI-programvare.",
      "Utgivelsen inkluderer støtte for WebAssembly (WASM) og funksjoner som \"Actually Portable Executable\" (APE)-headeren, som forbedrer plattformuavhengig kompatibilitet, inkludert støtte for Android."
    ],
    "points": 301,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1719211800
  },
  {
    "id": 40773136,
    "title": "Apples hemmelige silisiumfabrikk ved siden av tusenvis av hjem",
    "originLink": "https://www.ashleygjovik.com/3250scott.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40773136",
    "commentBody": "",
    "originSummary": [
      "I 2015 begynte Apple hemmelig halvlederfabrikasjon på et anlegg i Santa Clara, California, som slapp ut giftige gasser som påvirket nærliggende innbyggere.",
      "Ashley M. Gjovik, en beboer i 2020, led av alvorlige helseproblemer og oppdaget fabrikkens utslipp i hjemmet og kroppen sin, noe som førte til flere klager og undersøkelser.",
      "Apple sto overfor brudd på farlig avfall og sikkerhetsproblemer, med pågående inspeksjoner og undersøkelser av den offentlige ulempen og ultrafarlige aktiviteter som forårsaker betydelig skade på Gjovik og miljøet."
    ],
    "commentSummary": [],
    "points": 269,
    "commentCount": 2,
    "retryCount": 0,
    "time": 1719211763
  },
  {
    "id": 40770171,
    "title": "LINQPad – .NET-programmererens lekeplass",
    "originLink": "https://www.linqpad.net/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40770171",
    "commentBody": "",
    "originSummary": [
      "LINQPad er et allsidig verktøy for .NET-programmerere for å umiddelbart teste C#/F#/VB-kodebiter, spørre databaser og automatisere skript med REPL (Read-Eval-Print Loop) fordeler.",
      "Den støtter C# 12 og .NET 8, og tillater interaktive databaseforespørsler i LINQ eller SQL, og inkluderer drivere for flere databaser som SQL Server, Oracle og MySQL.",
      "LINQPad tilbyr avanserte funksjoner som AI-autofullføring, integrert feilsøking og rik utdataformatering, noe som gjør det til et kraftig verktøy for rask koding og dynamisk utvikling."
    ],
    "commentSummary": [
      "LINQPad er høyt ansett for sin brukervennlighet, spesielt blant .NET-utviklere, for skripting, feilsøking og kjøring av LINQ-spørringer.",
      "Brukere setter pris på funksjoner som SQL Server-databaseforbindelser, men uttrykker frustrasjon over at det kun er tilgjengelig for Windows og kostnaden.",
      "Alternativer som nevnes inkluderer winmerge, NetPad, dotnetfiddle.net og RoslynPad, med noen brukere som ønsker plattformuavhengig støtte og integrasjon i Visual Studio."
    ],
    "points": 261,
    "commentCount": 116,
    "retryCount": 0,
    "time": 1719172953
  },
  {
    "id": 40776951,
    "title": "Bilforhandlere går tilbake til penner og papir etter cyberangrep på programvareleverandør",
    "originLink": "https://apnews.com/article/car-dealerships-cyberattack-cdk-outage-3f7c81f6be0e212172b33cdc9f49feba",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40776951",
    "commentBody": "",
    "originSummary": [
      "Bilforhandlere i Nord-Amerika opplevde betydelige forstyrrelser på grunn av cyberangrep på CDK Global, en viktig programvareleverandør for bilforhandlere.",
      "Angrepene 19. juni 2024 forårsaket vedvarende strømbrudd, noe som førte til forsinkelser og manuell behandling hos berørte forhandlere.",
      "Store bilselskaper som Stellantis, Ford og BMW bekreftet påvirkningen, men fortsetter driften ved hjelp av alternative metoder, mens CDK Global jobber med å gjenopprette systemene sine."
    ],
    "commentSummary": [
      "Bilforhandlere går tilbake til å bruke penner og papir etter cyberangrep på deres programvareleverandør, CDK Global, som forstyrrer deres digitale operasjoner.",
      "Cyberangrepene har alvorlig påvirket deler og serviceavdelinger mer enn salg av nye kjøretøy, ettersom lagerinformasjonen deres er lagret i det kompromitterte CDK-systemet.",
      "Den hendelsen fremhever sårbarheten til industrier som er sterkt avhengige av en enkelt programvareleverandør, og understreker behovet for bedre cybersikkerhetstiltak og muligens mer diversifiserte programvareløsninger."
    ],
    "points": 178,
    "commentCount": 260,
    "retryCount": 0,
    "time": 1719241762
  },
  {
    "id": 40772224,
    "title": "US EPA håndhevelse og overholdelse på Apple Fabrication",
    "originLink": "https://www.dropbox.com/scl/fo/312oqvretg7yyhfx0ohx4/AGZduVXs0_1geqIyi0NA9nE?e=1&preview=2024_04_30_RCRA_Insp_Report_REPORT_Apple_3250_Scott_Redacted.pdf&rlkey=3aa2tw15ek3trqlbdh7pw9erh&st=4b364mkx&dl=0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40772224",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "USAs EPA etterforsker Apple for potensielle miljøbrudd ved et anlegg i Santa Clara, med fokus på feilaktig håndtering og utslipp av farlig avfall.",
      "Den tidligere Apple-ansatte Ashley Gjovik har uttrykt bekymring for personlige helsekonsekvenser fra anleggets utslipp, selv om hennes påstander møtes med skepsis.",
      "Tilfellet understreker kompleksiteten i industriell regulering og bedriftsansvar, og trekker sammenligninger med andre industrielle hendelser og bekymringer om håndheving av regelverk."
    ],
    "points": 163,
    "commentCount": 219,
    "retryCount": 0,
    "time": 1719195635
  },
  {
    "id": 40769880,
    "title": "Støy fra trafikk skader barns hjerner",
    "originLink": "https://www.bbc.com/future/article/20240621-how-traffic-noise-pollution-harms-childrens-health-and-development",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40769880",
    "commentBody": "",
    "originSummary": [
      "Barn er svært sårbare for trafikkstøyforurensning, noe som påvirker helsen og læringsevnen deres negativt.",
      "Studier, inkludert en studie fra 1975 av Arline Bronzaft og en studie fra 2022 i Barcelona, viser at støyforurensning kan svekke leseferdigheter, arbeidsminne og oppmerksomhetsspenn hos barn.",
      "Byer som Buenos Aires og Barcelona implementerer tiltak som å forbedre grønne områder og redusere fartsgrenser for å bekjempe støyforurensning, med initiativer som Barcelonas \"superblokker\" som prioriterer fotgjengere og grønne områder over biler."
    ],
    "commentSummary": [
      "En studie viser at veitrafikkstøy ved skoler er knyttet til langsommere utvikling av barns arbeidsminne og oppmerksomhet.",
      "Potensielle løsninger inkluderer å redusere trafikken rundt skoler og lydisolere klasserom for å dempe virkningen av miljøstøy.",
      "Diskusjonen tar også opp bredere spørsmål som bilavhengighet, støyforurensning og fordelene med roligere, gangbare urbane miljøer."
    ],
    "points": 162,
    "commentCount": 127,
    "retryCount": 0,
    "time": 1719170425
  },
  {
    "id": 40775301,
    "title": "Microsoft-konto til lokal konto konverteringsveiledning slettet fra Windows 11-veiledning",
    "originLink": "https://www.tomshardware.com/software/windows/microsoft-account-to-local-account-conversion-guide-erased-from-official-windows-11-guide-instructions-redacted-earlier-this-week",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40775301",
    "commentBody": "",
    "originSummary": [
      "Microsoft har fjernet veiledningen for å konvertere en Microsoft-konto til en lokal konto fra sin Windows 11-støtteside, med virkning fra 17. juni 2024.",
      "Brukere kan fortsatt bytte til en lokal konto manuelt via Innstillinger > Kontoer > Din informasjon og velge \"Logg på med en lokal konto i stedet.\"",
      "Dette tiltaket fremhever Microsofts innsats for å få brukere til å ta i bruk Microsoft-kontoer, og understreker fordeler som tjenesteintegrasjon og forbedret sikkerhet, i tråd med strategier fra Google og Apple."
    ],
    "commentSummary": [
      "Microsoft har fjernet veiledningen for å konvertere en Microsoft-konto til en lokal konto fra Windows 11-dokumentasjonen.",
      "Brukere diskuterer alternativer som å bruke LTSC (Long-Term Servicing Channel)-versjonen av Windows 11, som vanligvis er et bedriftsprodukt, men som kan aktiveres gjennom GitHub-skript.",
      "Diskusjonen fremhever den pågående debatten om etikken og lovligheten ved bruk av aktiveringsskript og avveiningene mellom Windows og Linux for gaming og generell databehandling."
    ],
    "points": 161,
    "commentCount": 235,
    "retryCount": 0,
    "time": 1719232686
  },
  {
    "id": 40773749,
    "title": "CentOS Linux 7 vil nå EOL på søndag",
    "originLink": "https://www.redhat.com/en/topics/linux/centos-linux-eol",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40773749",
    "commentBody": "",
    "originSummary": [
      "CentOS Linux 7 vil nå End of Life (EOL) den 30. juni 2024, noe som betyr at det ikke lenger vil motta oppdateringer eller sikkerhetsoppdateringer etter denne datoen.",
      "Red Hat tilbyr flere migreringsverktøy og -tjenester, som Convert2RHEL, Red Hat Insights og Red Hat Consulting, for å hjelpe brukere med overgangen til Red Hat Enterprise Linux (RHEL).",
      "RHEL gir en lignende brukeropplevelse som CentOS, med tilleggsegenskaper, støtte og sikkerhet, og er kompatibel med store skyleverandører og hybride skyimplementeringer."
    ],
    "commentSummary": [
      "CentOS Linux 7 vil nå End of Life (EOL) på søndag, noe som får brukere til å søke alternativer.",
      "SUSE tilbyr en løsning ved å bytte CentOS 7 oppdateringslagre til SUSE sine, og unngår forstyrrende migrasjoner, mens Oracle Linux er et annet alternativ, selv om noen brukere er forsiktige med det.",
      "Mange brukere går over til alternativer som Rocky Linux, AlmaLinux eller Debian, og noen møter utfordringer med oppgradering og vurderer containere for å redusere endringer i operativsystemet."
    ],
    "points": 142,
    "commentCount": 115,
    "retryCount": 0,
    "time": 1719218720
  },
  {
    "id": 40769867,
    "title": "Avlede avhengighetstypet OOP fra første prinsipper",
    "originLink": "https://arxiv.org/abs/2403.06707",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40769867",
    "commentBody": "",
    "originSummary": [
      "Artikkelen tar for seg uttrykksproblemet, som innebærer utfordringen med å utvide typer med nye produsenter og forbrukere i programmering.",
      "Den utforsker avhengighetstypet objektorientert programmering ved å utlede det fra første prinsipper ved bruk av dualitet, og gir en avhengighetstypet kalkulus med duale språkfragmenter.",
      "Denne utvidede versjonen inkluderer ytterligere vedlegg og vil være en del av PACMPL-utgaven for OOPSLA 2024, som demonstrerer betydningen og den pågående forskningen på dette området."
    ],
    "commentSummary": [
      "Papiret \"Deriving Dependently-Typed OOP from First Principles\" har skapt betydelig diskusjon og mottatt 141 poeng på arxiv.org.",
      "Viktige diskusjoner inkluderer essensen av objektorientert programmering (OOP) versus funksjonell programmering (FP), med noen brukere som bemerker at eksemplene i artikkelen virker mer funksjonelle enn objektorienterte.",
      "Ulike ressurser og referanser ble delt, inkludert William Cooks artikkel om dataabstraksjon, Noel Welshs foredrag om FP og OO, og boken \"A Little Java, A Few Patterns\" for å forstå sammenhengene mellom funksjonell og objektorientert programmering."
    ],
    "points": 141,
    "commentCount": 14,
    "retryCount": 0,
    "time": 1719170341
  },
  {
    "id": 40774270,
    "title": "Konverter en eksisterende kablet ringeklokke til en smart ringeklokke ved hjelp av ESPHome",
    "originLink": "https://frenck.dev/diy-smart-doorbell-for-just-2-dollar/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40774270",
    "commentBody": "",
    "originSummary": [
      "Artikkelen forklarer hvordan man kan konvertere en tradisjonell ringeklokke til en smart, WiFi-aktivert ringeklokke for omtrent $2, uten å kreve lodding eller elektronikkekspertise.",
      "Prosjektet bruker en ESP-01S-brikke og et relémodul, drevet av en gammel telefonlader, og integreres med Home Assistant og ESPHome for ulike automatiseringer.",
      "Detaljerte trinn er gitt for å modifisere ESP-01S-brikken, blinke firmware, koble ledninger og integrere med Home Assistant, som viser hvor enkelt og rimelig DIY smarthjemprosjekter kan være."
    ],
    "commentSummary": [
      "Artikkelen diskuterer hvordan man kan konvertere en kablet ringeklokke til en smart ringeklokke ved hjelp av ESPHome, og fremhever både potensielle feilkilder og fordeler som fjernvarsler og integrasjon med hjemmeautomatisering.",
      "Eksempler inkluderer bruk av en Amcrest AD110 ringeklokke for kun lokal videostrømming og tilpassede varsler, og forslag til bruk av Zigbee- eller Z-Wave-knapper for enkelhet.",
      "Det viktigste målet er å demonstrere hvor enkelt og morsomt det er med gjør-det-selv smarthjemprosjekter med ESPHome og Home Assistant."
    ],
    "points": 135,
    "commentCount": 64,
    "retryCount": 0,
    "time": 1719224655
  },
  {
    "id": 40773957,
    "title": "EPA utgir rapport om Apples brudd på farlig avfall i urban silisiumfabrikk",
    "originLink": "https://mastodon.social/@ashleygjovik/112668309100333232/?",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40773957",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "EPA-rapporten fremhever Apples brudd på farlig avfall, spesielt den ulovlige utluftingen av farlige kjemikalier ved en urban silisiumfabrikk.",
      "Apple klarte ikke å redegjøre for alt avfall som passerer gjennom karbonfiltre, noe som gjør det umulig å vurdere filtrenes \"gjennombruddstid\", noe som potensielt kan føre til miljølekkasjer siden desember 2020.",
      "Diskusjonen om dette emnet har blitt flyttet til en ny tråd på Hacker News, noe som indikerer betydelig interesse fra samfunnet."
    ],
    "points": 132,
    "commentCount": 4,
    "retryCount": 0,
    "time": 1719221000
  },
  {
    "id": 40770358,
    "title": "Økonomien til Birkin-håndvesken",
    "originLink": "https://www.wsj.com/style/fashion/hermes-birkin-bag-investment-031c215c",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40770358",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Markedet for Birkin-håndvesker blomstrer på eksklusivitet og høy etterspørsel, med kjøpere som får 24 timer til å kjøpe, noe som skaper en lotterilignende spenning.",
      "Salget er begrenset til lojale kunder som bruker betydelige beløp på andre varer, for å opprettholde veskenes status som et symbol og en investering.",
      "På samme måte som markedet for joggesko, sikrer denne modellen med begrenset tilgjengelighet og personlig service luksusmarkedets suksess gjennom knapphet og prestisje, og tiltrekker seg velstående forbrukere."
    ],
    "points": 126,
    "commentCount": 222,
    "retryCount": 0,
    "time": 1719174368
  }
]
