[
  {
    "id": 39815805,
    "title": "சாக்ரதா குடும்பம் 2026 க்குள் முடிக்கப்படும்",
    "originLink": "https://www.cnn.com/2024/03/25/travel/sagrada-familia-barcelona-completion-scli-intl/index.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39815805",
    "commentBody": "",
    "originSummary": [
      "உரை உள்ளமைவு அமைப்புகள், குறியீடு துணுக்குகள் மற்றும் சி.என்.என் வலைத்தளம், மீடியா பிளேயர்கள் மற்றும் தரவு குறியாக்கம் / டிகோடிங் முறைகள் தொடர்பான அம்சங்களை உள்ளடக்கியது.",
      "இது பயனர் ஒப்புதல் நிர்வாகத்தையும் விவாதிக்கிறது மற்றும் பல வருட கட்டுமானத்திற்குப் பிறகு 2026 இல் பார்சிலோனாவில் உள்ள Sagrada Familia இன் திட்டமிடப்பட்ட நிறைவு தேதியை வெளிப்படுத்துகிறது."
    ],
    "commentSummary": [
      "பேச்சு பார்சிலோனாவில் உள்ள சாக்ரடா ஃபேமிலியாவின் கட்டுமானம் மற்றும் விளைவுகளைச் சுற்றி வருகிறது, அதன் வடிவமைப்பு, முக்கியத்துவம் மற்றும் நிறைவு செய்வதற்கான காலக்கெடு ஆகியவற்றில் மாறுபட்ட கண்ணோட்டங்களுடன்.",
      "நகர்ப்புற வளர்ச்சி தடைகள், வீட்டுவசதி பற்றாக்குறை, நவீன கட்டிடக்கலை மற்றும் வரலாற்று பாதுகாப்பு போன்ற சவால்களையும், மக்கள்தொகை வளர்ச்சி கட்டிடக்கலையை எவ்வாறு பாதிக்கிறது மற்றும் மாறிவரும் கட்டிடக்கலை போக்குகளையும் இது விவாதிக்கிறது.",
      "ஆராயப்பட்ட பிற பகுதிகள் கைவினைத்திறன் குறைவு, கட்டுமானத்தில் நவீன தொழில்நுட்பத்தின் பங்கு மற்றும் மத நிறுவனங்களைப் பற்றி விவாதிக்கும்போது துல்லியமான சொற்களின் அவசியம் ஆகியவை ஆகும்."
    ],
    "points": 459,
    "commentCount": 306,
    "retryCount": 0,
    "time": 1711372004
  },
  {
    "id": 39819599,
    "title": "ZenHammer: AMD Zen இயங்குதளங்கள் Rowhammer க்கு பாதிக்கப்படக்கூடியவை",
    "originLink": "https://comsec.ethz.ch/research/dram/zenhammer/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39819599",
    "commentBody": "",
    "originSummary": [
      "டிஆர்ஆர் தணிப்புகள் இருந்தபோதிலும் ஏஎம்டி ஜென் அடிப்படையிலான இயங்குதளங்கள் ரோவ்ஹாமர் தாக்குதல்களுக்கு ஆளாகின்றன என்பதை ஜென்ஹாமர் ஆய்வு வெளிப்படுத்துகிறது, இன்டெல் காபி ஏரியுடன் ஒப்பிடும்போது ஜென் 3 அமைப்புகள் அதிக பாதிப்பைக் காட்டுகின்றன.",
      "DDR5 சாதனங்களும் ஆராய்ச்சியில் சோதிக்கப்பட்டன, இது சாத்தியமான பிட் ஃபிளிப் அபாயங்களைக் குறிக்கிறது, மேலும் ஆய்வின் ஃபஸ்ஸர் கருவி கூடுதல் விசாரணைகளுக்கு Github இல் அணுகக்கூடியது.",
      "DDR5 சாதனங்களில் பாதிப்புகளின் முழுமையான நோக்கத்தை அளவிடுவதற்கு மேலும் ஆராய்ச்சி தேவைப்படுகிறது, மேலும் ஆராய்ச்சி மானியங்களால் ஆதரிக்கப்படும் இந்த ஆய்வு, பொறுப்பான வெளிப்படுத்தல் நெறிமுறைகளைப் பின்பற்றி AMD உடன் பகிரப்பட்டது."
    ],
    "commentSummary": [
      "AMD Zen-அடிப்படையிலான இயங்குதளங்கள் Rowhammer தாக்குதல்களால் பாதிக்கப்படக்கூடியவை, பாதுகாப்பை மேம்படுத்த ECC நினைவகத்தைப் பயன்படுத்துவதன் அவசியத்தை வலியுறுத்துகின்றன.",
      "AMD இயங்குதளங்களில் ECC நினைவகத்தை செயல்படுத்துவது சவால்கள் மற்றும் செலவுகளை ஏற்படுத்துகிறது, CPU மாதிரிகள் முழுவதும் மாறுபட்ட அளவிலான ஆதரவுடன்.",
      "நினைவகப் பிழைகளைக் கண்காணித்தல் மற்றும் நிவர்த்தி செய்வதன் முக்கியத்துவத்தை உரை எடுத்துக்காட்டுகிறது மற்றும் Ryzen CPUகள் மீதான தாக்குதல்களைக் கண்டறிந்து தணிப்பதில் ECC நினைவகத்தின் செயல்திறனை வலியுறுத்துகிறது."
    ],
    "points": 281,
    "commentCount": 115,
    "retryCount": 0,
    "time": 1711390805
  },
  {
    "id": 39816836,
    "title": "Jampack: சிறந்த செயல்திறனுக்காக நிலையான வலைத்தளங்களை மேம்படுத்துதல்",
    "originLink": "https://github.com/divriots/jampack",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39816836",
    "commentBody": "",
    "originSummary": [
      "Jampack என்பது நிலையான தள ஜெனரேட்டர்களின் வெளியீட்டை மேம்படுத்துவதன் மூலம் பயனர் அனுபவம் மற்றும் கோர் வெப் வைட்டல்ஸ் மதிப்பெண்களை மேம்படுத்த வடிவமைக்கப்பட்ட ஒரு பிந்தைய செயலாக்க கருவியாகும்.",
      "இது படங்கள், CSS, ப்ரீஃபெட்ச் இணைப்புகளை மேம்படுத்தலாம், உலாவி பொருந்தக்கூடிய தன்மையை உறுதிப்படுத்தலாம், HTML சிக்கல்களை சரிசெய்யலாம் மற்றும் சொத்துக்களை சுருக்கலாம், எந்த SSG அல்லது கட்டமைப்புடனும் பணிபுரியலாம்.",
      "‹div›RIOTS குழுவால் உருவாக்கப்பட்டது, Jampack குறியீட்டை எளிதாக்குகிறது மற்றும் வலைத்தள செயல்திறனை அதிகரிக்கிறது, இது வலைத்தள தேர்வுமுறைக்கான மதிப்புமிக்க கருவியாக அமைகிறது."
    ],
    "commentSummary": [
      "Jampack என்பது ஒரு பிந்தைய செயலாக்க கருவியாகும், இது பயனர் அனுபவம் மற்றும் Core Web Vitals மதிப்பெண்களை அதிகரிக்க படங்கள், CSS மற்றும் சொத்துக்களை மேம்படுத்துவதன் மூலம் நிலையான வலைத்தளங்களை மேம்படுத்துகிறது.",
      "பயனர்கள் Jampack உடன் குறிப்பிடத்தக்க செயல்திறன் மேம்பாடுகளைக் கண்டுள்ளனர், லைட்ஹவுஸ் மதிப்பெண் நிலைத்தன்மை, ஹேக்கர் நியூஸ் போன்ற தளங்களில் பகிரப்பட்ட நுண்ணறிவுகள் மற்றும் PageSpeed தொகுதிகள் தொடர்பான திட்டங்களின் பராமரிப்பு பற்றி விவாதிக்கின்றனர்.",
      "உரையாடல் முக்கியமான CSS பயன்பாடு, நிலையான தள ஜெனரேட்டர்கள், பட தேர்வுமுறை, சோம்பேறி ஏற்றுதல் மற்றும் சோம்பேறி உள்ளடக்கத்தை ஒத்திவைக்க ஒரு Jampack அம்சத்திற்கான சாத்தியக்கூறுகளை உள்ளடக்கியது, பல்வேறு திட்ட அமைப்புகளுக்கான நுண்ணறிவு மற்றும் பரிந்துரைகளை வழங்குகிறது."
    ],
    "points": 279,
    "commentCount": 53,
    "retryCount": 0,
    "time": 1711377166
  },
  {
    "id": 39819409,
    "title": "குறியீடு தெளிவை அதிகரிக்கிறது: esbuild மற்றும் Redis ஆவணங்கள்",
    "originLink": "https://johnjago.com/great-docs/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39819409",
    "commentBody": "",
    "originSummary": [
      "கோட்பேஸ்களில் நல்ல ஆவணங்கள், எஸ்பில்ட் மற்றும் ரெடிஸ் ஆகியோரால் எடுத்துக்காட்டப்பட்டது, புதிய பயனர்களுக்கு உதவுவதற்கும், எளிதான பங்களிப்புகளை செயல்படுத்துவதற்கும், நேரத்தை மிச்சப்படுத்துவதற்கும், சிக்கல்களைத் தடுப்பதற்கும், சிக்கலைத் தீர்ப்பதை மேம்படுத்துவதற்கும் முக்கியமானது.",
      "esbuild மற்றும் Redis அவர்களின் விரிவான READMEகள், கட்டிடக்கலை ஆவணங்கள் மற்றும் குறியீடு கருத்துகள், பயனர் மற்றும் பங்களிப்பாளர் வழிசெலுத்தல் மற்றும் புரிதலை எளிதாக்குதல், எஸ்பில்டின் வெற்றிக்கு பங்களிக்கிறது.",
      "குறியீட்டை ஆவணப்படுத்துவதற்கு நேரத்தை அர்ப்பணிப்பதன் முக்கியத்துவத்தை கட்டுரை அடிக்கோடிட்டுக் காட்டுகிறது, வெளித்தோற்றத்தில் மிதமான அல்லது தனிப்பட்ட திட்டங்களுக்கு கூட அதன் நன்மைகளை வலியுறுத்துகிறது."
    ],
    "commentSummary": [
      "திறந்த மூல திட்டங்களில் கட்டிடக்கலை ஆவணங்களின் முக்கியத்துவம் முன்னிலைப்படுத்தப்படுகிறது, ரெடிஸ் மற்றும் லாரவெல் ஆகியவற்றை வலுவான ஆவணங்களுடன் எடுத்துக்காட்டுகளாகப் பயன்படுத்துகிறது.",
      "திட்டங்களை ஆவணப்படுத்துவதன் சவால்கள் மற்றும் நன்மைகள் லிட்டரேட் புரோகிராமிங் மற்றும் டயடாக்சிஸ் போன்ற கருவிகளுடன் விவாதிக்கப்படுகின்றன, அதே நேரத்தில் குயில் திட்டம் மற்றும் எஸ்.டி.எல் 2 போன்ற திட்டங்கள் அவற்றின் போதிய ஆவணங்களுக்காக மேற்கோள் காட்டப்படுகின்றன.",
      "கட்டற்ற ஆவணமாக்கம் பற்றிய குனு தத்துவத்தை மேற்கோள் காட்டி, கட்டற்ற மென்பொருள் சமூகத்தில் மேம்படுத்தப்பட்ட ஆவணமாக்கத்தின் அவசியம் வலியுறுத்தப்படுகிறது."
    ],
    "points": 253,
    "commentCount": 23,
    "retryCount": 0,
    "time": 1711389536
  },
  {
    "id": 39825033,
    "title": "பால்டிமோரில் பிரான்சிஸ் ஸ்காட் கீ பாலம் இடிந்து விழுந்தது",
    "originLink": "https://twitter.com/sentdefender/status/1772514015790477667",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39825033",
    "commentBody": "",
    "originSummary": [
      "மேரிலாந்தின் பால்டிமோர் நகரில் உள்ள பிரான்சிஸ் ஸ்காட் கீ பாலம் ஒரு பெரிய கொள்கலன் கப்பலுடன் மோதியதைத் தொடர்ந்து இடிந்து விழுந்தது, இதனால் ஏராளமான கார்கள் மற்றும் தனிநபர்கள் பாதிக்கப்பட்டனர்.",
      "பாலம் இடிந்து விழுந்ததால் அப்பகுதியில் குறிப்பிடத்தக்க அவசரகால பதில் மற்றும் மீட்பு நடவடிக்கை எடுக்கப்பட்டது.",
      "இந்த சம்பவம் உள்கட்டமைப்பு பாதுகாப்பு நடவடிக்கைகளின் முக்கியமான முக்கியத்துவத்தையும், பாலங்களுக்கு அருகில் பெரிய கப்பல்கள் சம்பந்தப்பட்ட விபத்துக்களின் சாத்தியமான விளைவுகளையும் எடுத்துக்காட்டுகிறது."
    ],
    "commentSummary": [
      "மேரிலாந்தின் பால்டிமோரில் உள்ள பிரான்சிஸ் ஸ்காட் கீ பாலத்தின் சரிவு பாலத்தின் பாதுகாப்பு மற்றும் பாலங்களில் பெரிய கப்பல்களின் செல்வாக்கு பற்றிய விவாதங்களைத் தூண்டியது, வலுவான கட்டுமானத் தரங்களின் முக்கியத்துவத்தையும் பாலப் பொறியியலில் உள்ள சிக்கல்களையும் வலியுறுத்தியது.",
      "இந்த சம்பவம் பேரழிவு தரும் தோல்விகளைத் தவிர்ப்பதில் பராமரிப்பு மற்றும் வடிவமைப்பின் முக்கிய பங்கை அடிக்கோடிட்டுக் காட்டுகிறது, ஊடக கவரேஜ், ஆன்லைன் சமூக எதிர்வினைகள் மற்றும் சரிவைச் சுற்றியுள்ள ஊகங்களுக்கு கவனத்தை ஈர்க்கிறது.",
      "எஃப்.பி.ஐ விசாரணைக்கான சாத்தியக்கூறு, ஆன்லைனில் தவறான தகவல்கள் மற்றும் நிகழ்வின் கவரேஜில் செல்வாக்கு செலுத்தும் அரசியல் காரணிகள், நடந்து கொண்டிருக்கும் உரையாடலுக்கு அடுக்குகளை பங்களிக்கின்றன என்று அறிக்கைகள் குறிப்பிடுகின்றன."
    ],
    "points": 202,
    "commentCount": 121,
    "retryCount": 0,
    "time": 1711437909
  },
  {
    "id": 39815936,
    "title": "மார்ட்டின் ஸ்கோர்செஸியின் விரிவான வி.எச்.எஸ் சேகரிப்பு பல்கலைக்கழகத்தில் பாதுகாக்கப்படுகிறது",
    "originLink": "https://www.theguardian.com/film/2024/mar/25/martin-scorsese-vhs-video-collection-archive",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39815936",
    "commentBody": "",
    "originSummary": [
      "மார்ட்டின் ஸ்கோர்செஸி தாராளமாக வி.எச்.எஸ் நாடாக்களால் நிரப்பப்பட்ட 50 க்கும் மேற்பட்ட சேமிப்பு பெட்டிகளை கொலராடோ போல்டர் பல்கலைக்கழகத்திற்கு நன்கொடையாக வழங்கினார், இது 80 கள் மற்றும் 2000 களுக்கு இடையில் பதிவு செய்யப்பட்ட அவரது பரந்த வகைப்படுத்தப்பட்ட திரைப்படங்கள் மற்றும் தொலைக்காட்சி நிகழ்ச்சிகளைக் காட்சிப்படுத்தியது.",
      "ஸ்கோர்செஸியின் காப்பக முயற்சி யூடியூப் மற்றும் நெட்ஃபிக்ஸ் ஆகியவற்றிற்கு முந்தையது, அங்கு அவர் ஆயிரக்கணக்கான நாடாக்களை சிரமப்பட்டு பட்டியலிட்டார், அவற்றை அவரது திரைப்படத் தயாரிப்பு பயணத்தில் குறிப்புகளாகப் பயன்படுத்தினார்.",
      "நாடாக்களில் உள்ள மாறுபட்ட வகைகள் அவரது படைப்பு பணிப்பாய்வுகளில் முக்கிய பங்கு வகிக்கின்றன, இது பாதுகாப்பு மற்றும் ஆராய்ச்சி முயற்சிகளுக்காக சேகரிப்பை டிஜிட்டல் மயமாக்க பல்கலைக்கழகத்தைத் தூண்டுகிறது."
    ],
    "commentSummary": [
      "மார்ட்டின் ஸ்கோர்செஸி, பாப் மோங்க்ஹவுஸ் மற்றும் மரியன் ஸ்டோக்ஸ் ஆகியோர் வி.எச்.எஸ் டேப் சேகரிப்பாளர்களாக இருந்தனர், ஸ்கோர்செஸியின் சேகரிப்பு இப்போது கொலராடோ போல்டர் பல்கலைக்கழகத்தில் பாதுகாப்பிற்காக உள்ளது.",
      "உரையாடல் நாடாக்களை டிஜிட்டல் மயமாக்க வி.எச்.எஸ்-டிகோட் மென்பொருளைப் பயன்படுத்துவது, பழைய பதிவுகளின் சவால்களை காப்பகப்படுத்துவது மற்றும் உயர் கல்வியில் பிரதிநிதித்துவப்படுத்தப்படாத மாணவர்களுக்கு ஆதரவளிப்பது ஆகியவற்றை உள்ளடக்கியது.",
      "வரலாற்று பாதுகாப்புக்கு முன்னுரிமை அளிக்கப்படுவதில் முக்கியத்துவம் அளிக்கப்படுகிறது, காப்பக திட்டங்களில் பாத்திரங்களை துல்லியமாக கற்பிக்கிறது."
    ],
    "points": 197,
    "commentCount": 81,
    "retryCount": 0,
    "time": 1711372820
  },
  {
    "id": 39819458,
    "title": "ட்ரேஸ்கேட் அறிமுகம்: திறந்த மூல பாதுகாப்பு எச்சரிக்கை ஆட்டோமேஷன் தளம்",
    "originLink": "https://github.com/TracecatHQ/tracecat",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39819458",
    "commentBody": "",
    "originSummary": [
      "Tracecat என்பது விழிப்பூட்டல்களுக்கு பதிலளிப்பதில் பாதுகாப்பு ஆய்வாளர்களின் பணிகளை எளிதாக்குவதற்காக பாதுகாப்பு விழிப்பூட்டல்களுக்காக வடிவமைக்கப்பட்ட ஒரு திறந்த மூல ஆட்டோமேஷன் தளமாகும்.",
      "Splunk SOAR போன்ற நிறுவப்பட்ட தீர்வுகளுடன் இணைந்திருக்கும்போது, நிகழ்வு-உந்துதல் பணிப்பாய்வுகள், REST API ஒருங்கிணைப்புகள் மற்றும் தரவு சரிபார்ப்பு ஆகியவற்றை உள்ளடக்கியது செலவு குறைந்த மற்றும் பயனர் நட்பு.",
      "Tracecat, அதன் ஆரம்ப வளர்ச்சி கட்டத்தில், முக்கிய பாதுகாப்பு கருவிகளுடன் ஒருங்கிணைக்கவும், முன் கட்டப்பட்ட பணிப்பாய்வுகளை வழங்கவும், ஆவணங்களை மேம்படுத்தவும், மேலும் மேம்படுத்த பயனர் கருத்துக்களை நாடவும் விரும்புகிறது."
    ],
    "commentSummary": [
      "Tracecat என்பது பாதுகாப்பு விழிப்பூட்டல்களை தானியக்கமாக்குவதற்கான ஒரு திறந்த மூல தளமாகும், இது Splunk SOAR க்கு செலவு குறைந்த மாற்றாக நிலைநிறுத்தப்பட்டுள்ளது, இது Python மற்றும் SQLite ஐப் பயன்படுத்தி உருவாக்கப்பட்டது.",
      "விவாதங்களில் ட்ரேஸ்கேட்டின் பாதுகாப்பு நடைமுறைகள், திறந்த மூல பாதுகாப்பு கருவிகளை உருவாக்குவதில் உள்ள சவால்கள் மற்றும் வாய்ப்புகள் மற்றும் வணிக மாதிரியாக இலவச மற்றும் திறந்த மூல மென்பொருளின் (FOSS) நம்பகத்தன்மை ஆகியவை அடங்கும்.",
      "மற்றொரு மென்பொருள் தயாரிப்பான Quickwit/Tantivy மற்றும் Tracecat என்ற புதிய SOAR கருவியின் அறிமுகம் பற்றிய குறிப்பு உள்ளது."
    ],
    "points": 193,
    "commentCount": 46,
    "retryCount": 0,
    "time": 1711389907
  },
  {
    "id": 39816423,
    "title": "முதல் எல்.எஸ்.டி பிளாட்டரை பேக்கேஜிங் செய்தல்: எரிக் கோஸ்டின் வண்ணமயமான கண்டுபிடிப்பு",
    "originLink": "https://thereader.mitpress.mit.edu/for-brilliant-color-packaging-the-first-lsd-blotter/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39816423",
    "commentBody": "",
    "originSummary": [
      "1960களின் மாற்றுக் கலாச்சாரத்தின் முக்கியப் பிரமுகரான எரிக் கோஸ்ட், எல்எஸ்டியை ஃபிலிம் ஸ்டாக் என்ற போர்வையில் விநியோகித்து, நவீன ஊடகத் தொழில்நுட்பத்துடன் இணைத்து, அதன் உருமாறும் விளைவுகளை உயர்த்திக் காட்டினார்.",
      "கோஸ்ட் எல்எஸ்டி விநியோகத்தில் புரட்சியை ஏற்படுத்தியது, எல்எஸ்டி சொட்டுகளுடன் உட்செலுத்தப்பட்ட முதல் வெகுஜன உற்பத்தி ப்ளாட்டர் காகிதத்தை அறிமுகப்படுத்தியது, நவீன ஆராய்ச்சி மற்றும் மருந்து நிறுவனங்களால் ஈர்க்கப்பட்ட ஒரு அறிவியல் தயாரிப்பாக மருந்தை வடிவமைத்தது.",
      "சைகடெலிக் அனுபவங்களை பாதிக்கும் \"செட் அண்ட் செட்டிங்\" என்ற கருத்து போருக்குப் பிந்தைய சைகடெலிக் கலாச்சாரத்தில் முக்கியமானது, மேலும் கோஸ்டின் விவரிப்பு எல்.எஸ்.டி.யின் மருத்துவ பயன்பாடுகள், சர்ச்சைகள், ஓரினச்சேர்க்கைக்கான \"சிகிச்சை\" போன்ற சர்ச்சைகளை ஆராய்கிறது, இது எரிக் டேவிஸின் புத்தகத்தில் விவரிக்கப்பட்டுள்ளது \"ப்ளாட்டர்: தி அன்டோல்ட் ஸ்டோரி ஆஃப் அன் ஆசிட் மீடியம்.\""
    ],
    "commentSummary": [
      "இந்த கட்டுரை மார்க் மெக்லவுட்டின் எல்.எஸ்.டி ப்ளாட்டர் தாவல்களின் தொகுப்பு, டி.இ.ஏ உடனான அவரது சந்திப்புகள் மற்றும் இந்த தனித்துவமான சேகரிப்பைப் பற்றிய ஒரு புத்தகத்தில் எரிக் டேவிஸுடனான அவரது ஒத்துழைப்பு ஆகியவற்றை ஆராய்கிறது.",
      "விவாதத்தில் உள்ள கருத்துக்கள் மருந்து பேக்கேஜிங், எல்.எஸ்.டி அளவு, விளைவுகள், சைகடெலிக்ஸுடனான தனிப்பட்ட அனுபவங்கள், சட்டப்பூர்வமாக்கல் விவாதங்கள் மற்றும் படைப்பாற்றல் மற்றும் அறிவாற்றலில் சைகடெலிக்ஸின் தாக்கம் ஆகியவற்றின் பல்வேறு அம்சங்களை உள்ளடக்கியது.",
      "சைகடெலிக் ஆராய்ச்சி மற்றும் பயன்பாட்டிற்கான சட்ட கட்டுப்பாடுகள் விவாதிக்கப்படுகின்றன, சிலர் பாதுகாப்பான அணுகலை உறுதி செய்வதற்காக அவற்றின் சட்டப்பூர்வமாக்கல் மற்றும் ஒழுங்குமுறைக்கு வாதிடுகின்றனர் மற்றும் படைப்பாற்றல் மற்றும் சுய விழிப்புணர்வு மீதான சைகடெலிக்ஸின் விளைவுகளின் அகநிலை தன்மையை எடுத்துக்காட்டுகின்றனர்."
    ],
    "points": 184,
    "commentCount": 192,
    "retryCount": 0,
    "time": 1711375275
  },
  {
    "id": 39814877,
    "title": "SPQR 1.3.0: மேம்படுத்தப்பட்ட PostgreSQL கிடைமட்ட அளவிடுதல்",
    "originLink": "https://github.com/pg-sharding/spqr/discussions/569",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39814877",
    "commentBody": "",
    "originSummary": [
      "SPQR 1.3.0 வெளிவந்துள்ளது, ஷார்டிங் உள்ளமைவு, மேம்பட்ட நெறிமுறை ஆதரவு மற்றும் அறிவார்ந்த ஷார்ட் மறுசீரமைப்பு ஆகியவற்றிற்கான புதிய தொடரியல் அறிமுகப்படுத்துகிறது.",
      "பணிச்சுமைகளை சமமாக விநியோகிக்கவும், பூட்டுதல் விளைவுகளை குறைக்கவும் துண்டுகளுக்கு இடையில் தரவு இடம்பெயர்வு உகந்ததாக உள்ளது.",
      "வெளியீட்டு குறிப்புகள் இந்த பதிப்பில் சேர்க்கப்பட்டுள்ள அனைத்து புதுப்பிப்புகள் மற்றும் மேம்பாடுகள் பற்றிய ஆழமான தகவல்களை வழங்குகின்றன."
    ],
    "commentSummary": [
      "பயனர்கள் PostgreSQL ஐ கிடைமட்டமாக அளவிடுவதற்காக வடிவமைக்கப்பட்ட SPQR 1.3.0 அமைப்பைப் பற்றி விவாதிக்கின்றனர், அதன் செயல்திறனை செங்குத்து அளவிடுதலுக்கு எதிராக விவாதித்தல், PostgreSQL உடன் தரவு செயலாக்கத்தில் அனுபவங்களைப் பகிர்ந்து கொள்ளுதல் மற்றும் கிடைமட்டமாக அளவிடுதல் விநியோகிக்கப்பட்ட நிகழ்வுகளின் சிக்கல்கள்.",
      "AWS அரோராவில் PostgreSQL இயங்கும் சவால்கள், செயல்திறன் மேம்பாட்டு உத்திகள், PgBouncer உடன் இணைப்பதில் உள்ள வரம்புகள் மற்றும் AGPL உரிமத்தின் கீழ் Citus ஐ மாற்றியமைத்து வரிசைப்படுத்த வேண்டிய அவசியம் ஆகியவை முன்னிலைப்படுத்தப்பட்டுள்ளன.",
      "உரையாடல் ஒரு திசைவியின் அம்சங்கள் மற்றும் பல்வேறு சூழ்நிலைகளில் அளவிடுதல் சிக்கல்கள் தொடர்பான சிக்கல்களை விளக்க வரலாற்று குறிப்புகள் மற்றும் ரோமானிய சொற்களை உள்ளடக்கியது."
    ],
    "points": 178,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1711365879
  },
  {
    "id": 39817850,
    "title": "AutoSpec: லோக்கல் ஹோஸ்ட் போக்குவரத்திலிருந்து OpenAPI ஸ்பெக்கை உருவாக்கவும்",
    "originLink": "https://github.com/Adawg4/openapi-autospec",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39817850",
    "commentBody": "",
    "originSummary": [
      "OpenAPI AutoSpec தானாகவே லோக்கல் ஹோஸ்ட் நெட்வொர்க் போக்குவரத்திலிருந்து OpenAPI விவரக்குறிப்புகளை உருவாக்குகிறது, API ஆவண வளர்ச்சியை நெறிப்படுத்துகிறது.",
      "கருவி ஒரு உள்ளூர் சேவையக ப்ராக்ஸியாக செயல்படுகிறது, இறுதிப்புள்ளிகள், கோரிக்கைகள் மற்றும் பதில்களை சிரமமின்றி ஆவணப்படுத்துகிறது, NPM மற்றும் குறைந்தபட்ச கட்டளை வரி உள்ளீடுகளைப் பயன்படுத்தி எளிதான நிறுவலுடன்.",
      "எதிர்கால புதுப்பிப்புகள் HTTPS மற்றும் OpenAPI 3.1 க்கான ஆதரவை அறிமுகப்படுத்தும், கருவி எந்த உள்ளூர் வலைத்தளம் அல்லது பயன்பாட்டு அமைப்புடனும் தடையின்றி ஒருங்கிணைக்க வடிவமைக்கப்பட்டுள்ளது."
    ],
    "commentSummary": [
      "கையேடு மற்றும் தானியங்கி OpenAPI விவரக்குறிப்பு உருவாக்கம் பற்றிய விவாதம் விவாதிக்கப்படுகிறது, இது API வளர்ச்சியில் வேண்டுமென்றே API வடிவமைப்பின் முக்கியத்துவத்தை வலியுறுத்துகிறது.",
      "OpenAPI AutoSpec போன்ற கருவிகள் நெட்வொர்க் போக்குவரத்திலிருந்து விவரக்குறிப்புகளை உருவாக்குவதை எளிதாக்குகின்றன, அதே நேரத்தில் FastAPI போன்ற கட்டமைப்புகள் OpenAPI விவரக்குறிப்புகளை உருவாக்குவதில் பயனுள்ளதாக இருக்கும்.",
      "Akita, Schemathesis மற்றும் Optic போன்ற குறிப்பிடப்பட்ட கருவிகள் API சோதனை மற்றும் ஆய்வில் முக்கிய பங்கு வகிக்கின்றன, இது துல்லியமான மற்றும் தற்போதைய API ஆவணங்களின் முக்கியத்துவத்தை அடிக்கோடிட்டுக் காட்டுகிறது."
    ],
    "points": 153,
    "commentCount": 66,
    "retryCount": 0,
    "time": 1711381798
  },
  {
    "id": 39815976,
    "title": "நானோ-வலை: SPA களுக்கான வேகமான பைனரி வெப்சர்வர்",
    "originLink": "https://github.com/radiosilence/nano-web",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39815976",
    "commentBody": "",
    "originSummary": [
      "ஆசிரியர் கொள்கலன்கள் அல்லது யூனிகர்னல்களுக்கான ஒற்றை வரிசைப்படுத்தக்கூடிய பைனரி வடிவத்தில் ஒரு வலை சேவை தீர்வை உருவாக்கினார், இது nginx போன்ற அமைப்புகளுடன் காணப்படும் சிக்கல்களைச் சமாளிக்கிறது.",
      "இந்த தீர்வு நினைவகத்தில் உள்ள அனைத்து கோப்புகளையும் தேக்ககப்படுத்துவதன் மூலம் குறைந்த தாமதத்தை வழங்குகிறது மற்றும் ஒற்றை பக்க பயன்பாடுகளுக்கான (SPAகள்) இயக்க நேரத்தில் உள்ளமைவு மாறிகளை செலுத்த அனுமதிக்கிறது.",
      "ரூட்டிங் சிக்கல்களை நிவர்த்தி செய்வதன் மூலம் எஸ் 3 இலிருந்து ஆஸ்ட்ரோ போன்ற பயன்பாட்டு சேவை செயல்முறையை நெறிப்படுத்துவதை இது இலக்காகக் கொண்டுள்ளது, மேலும் ஆசிரியர் திட்டத்துடன் பரிசோதனை செய்ய மற்றவர்களை அழைக்கிறார்."
    ],
    "commentSummary": [
      "விவாதம் நானோ-வலையை மையமாகக் கொண்டுள்ளது, இது ஒற்றை பக்க பயன்பாடுகளுக்கு (SPAs) திறம்பட சேவை செய்வதற்காக வடிவமைக்கப்பட்ட குறைந்த-தாமத வலை சேவையகம், Nginx போன்ற அமைப்புகளை விட அதன் நன்மைகள் மற்றும் ஆஸ்ட்ரோ போன்ற SPA களுக்கான ரூட்டிங் நிர்வகிக்கும் திறனை எடுத்துக்காட்டுகிறது.",
      "SPA பாதை மேலாண்மை சம்பந்தப்பட்ட சவால்கள், சரியான HTTP நிலைக் குறியீடுகளை உறுதி செய்தல் மற்றும் பிற வலை அபிவிருத்தி அணுகுமுறைகளுக்கு மாறாக SPA களின் குறைந்து வரும் ஆதரவு ஆகியவை ஆராயப்படுகின்றன.",
      "பல்வேறு வலை சேவையக விருப்பங்கள், ரூட்டிங் தந்திரோபாயங்கள் மற்றும் எஸ்சிஓ பொருந்தக்கூடிய தன்மையை நிலைநிறுத்துவதன் முக்கியத்துவம் ஆகியவை விவாதிக்கப்படுகின்றன, வலை பயன்பாட்டு வரிசைப்படுத்தலுக்கான யூனிகர்னல்கள் மற்றும் மாற்று கருவிகளை மேம்படுத்துவதற்கான பரிசீலனைகளுடன்."
    ],
    "points": 151,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1711373024
  },
  {
    "id": 39819903,
    "title": "Meta $40K கட்டணத்திற்கு மேல் வணிகத்தை இடைநிறுத்துகிறது",
    "originLink": "https://tidbyt.com/blogs/tidbyt/meta-takes-40k-holds-our-business-ransom",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39819903",
    "commentBody": "",
    "originSummary": [
      "மெட்டா தங்கள் கிரெடிட் கார்டை விளம்பரத்திற்காக $ 40K வசூலிப்பதை ஆசிரியர் விவரிக்கிறார், பின்னர் பணத்தை இழந்ததற்காக அவர்களின் வணிகக் கணக்கை இடைநிறுத்தி, கம்பி பரிமாற்றம் மூலம் கூடுதல் $ 40K கோருகிறார்.",
      "மெட்டா ஊழியர்களைத் தொடர்புகொள்வது மற்றும் சார்ஜ்பேக் செய்வது குறித்து சிந்திப்பது உட்பட சிக்கலைத் தீர்ப்பதற்கான ஆசிரியரின் முயற்சிகள் இருந்தபோதிலும், அவர்கள் கணக்கு அணுகலை இழப்பது மற்றும் மெட்டாவிலிருந்து சாத்தியமான விளைவுகளை எதிர்கொள்கின்றனர்.",
      "இந்த கதை வணிக நடவடிக்கைகளுக்கு பெரிய தொழில்நுட்ப தளங்களை சார்ந்திருப்பதன் சிரமங்களையும் ஆபத்துகளையும் எடுத்துக்காட்டுகிறது, தொடர்புடைய சவால்கள் மற்றும் நிச்சயமற்ற தன்மைகளை வலியுறுத்துகிறது."
    ],
    "commentSummary": [
      "ஒரு வணிகம் விளம்பர சேவைகளுக்காக Meta க்கு $40K செலுத்தியது, ஆனால் முடிவில் அதிருப்தி அடைந்தது, பணத்தைத் திரும்பப் பெறுவதற்கான கட்டணத்தைப் பற்றி சிந்திக்கிறது, ஆனால் Meta விளம்பரங்களிலிருந்து தடை செய்யப்படலாம் என்று அஞ்சுகிறது.",
      "சார்ஜ்பேக்கிற்கு முன் மீண்டும் விலைப்பட்டியலை செலுத்துவதைக் கருத்தில் கொள்வது, உதவிக்காக பங்குதாரர் உறவுகளை அணுகுவது மற்றும் சாத்தியமான விளைவுகளை கவனத்தில் கொள்வது ஆகியவை பரிந்துரைகளில் அடங்கும்.",
      "பங்கேற்பாளர்கள் குறிப்பிடத்தக்க நிறுவனங்களுடன் சர்ச்சைக்குரிய குற்றச்சாட்டுகளின் அபாயங்கள் மற்றும் விளைவுகளைப் பற்றி விவாதிக்கின்றனர், பெரிய நிறுவனங்களின் பொறுப்புக்கூறல் இல்லாததால் ஏற்பட்ட விரக்திகளுக்கு மத்தியில் மெட்டா மற்றும் ஒத்த நிறுவனங்களுடனான சிக்கல்களைத் தீர்ப்பதற்கான உத்திகளைப் பகிர்ந்து கொள்கிறார்கள்."
    ],
    "points": 147,
    "commentCount": 59,
    "retryCount": 0,
    "time": 1711392398
  }
]
