[
  {
    "id": 41406550,
    "title": "क्या मेरी दृष्टि इतनी खराब है? नहीं, यह सिर्फ एप्पल के कैलकुलेटर में एक बग है।",
    "originLink": "https://martin.wojtczyk.de/2024/08/31/is-my-vision-that-bad-no-its-just-a-bug-in-apples-calculator/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41406550",
    "commentBody": "",
    "originSummary": [
      "Apple के Calculator ऐप में एक बग के कारण Mac पर बाइनरी डिस्प्ले में अंक एक पिक्सेल से हटकर दिखाई देते हैं, जिससे एक डगमगाने वाला प्रभाव उत्पन्न होता है।",
      "समस्या ऐसा प्रतीत होती है कि ऐप कई दिनों तक खुला रहने के कारण उत्पन्न हो रही है, जिससे UI समन्वय प्रणाली में एक राउंडिंग त्रुटि हो सकती है।",
      "लेखक ने बग को ऑनलाइन साझा किया क्योंकि Apple से प्रतिक्रिया विकल्प की कमी थी, यह आश्वासन देते हुए कि दृश्य विकृति कोई दृष्टि समस्या नहीं है।"
    ],
    "commentSummary": [
      "एप्पल के कैलकुलेटर ऐप में एक बग है जहां तेज बटन दबाने पर वे रजिस्टर नहीं होते, जिससे उपयोगकर्ताओं में निराशा होती है और एप्पल के उपयोगकर्ता इंटरैक्शन पर ध्यान देने पर सवाल उठते हैं।",
      "उपयोगकर्ता एप्पल के यूआई डिज़ाइन की आलोचना करते हैं, जैसे कि iPhone 12 Mini की धीमी एनिमेशन और CarPlay के खराब डिज़ाइन का हवाला देते हुए, जो कॉल का उत्तर देते समय नक्शे को कवर कर देता है।",
      "इन समस्याओं के बावजूद, एप्पल का इकोसिस्टम और सेवाएं उपयोगकर्ता की वफादारी बनाए रखते हैं, हालांकि सार्वजनिक बग ट्रैकर की कमी और धीमी प्रतिक्रिया प्रतिक्रिया अभी भी चिंताएं बनी हुई हैं।"
    ],
    "points": 512,
    "commentCount": 291,
    "retryCount": 0,
    "time": 1725078549
  },
  {
    "id": 41405195,
    "title": "कौवे हमारी सोच से भी अधिक चतुर होते हैं",
    "originLink": "https://nautil.us/crows-are-even-smarter-than-we-thought-820066/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41405195",
    "commentBody": "",
    "originSummary": [
      "नॉटिलस मैगज़ीन मानवविज्ञान, खगोल विज्ञान, प्रौद्योगिकी, और मनोविज्ञान सहित कई विषयों को कवर करता है, जो विज्ञान और संस्कृति में रुचि रखने वाले पाठकों के लिए विविध सामग्री प्रदान करता है।",
      "विशेष लेख ऐसे रोचक विषयों की खोज करते हैं जैसे कि 5 साल के बच्चे की तुलना में एआई की बुद्धिमत्ता, पेड़ों की उपचार शक्ति, और कौवों की बुद्धिमत्ता, जो पत्रिका की विचारोत्तेजक और अत्याधुनिक अनुसंधान के प्रति प्रतिबद्धता को उजागर करते हैं।",
      "नॉटिलस सदस्य एक विज्ञापन-मुक्त अनुभव और असीमित लेखों की पहुंच के लिए सदस्यता शुल्क का लाभ उठाते हैं, जिससे समर्पित पाठकों के लिए पढ़ने का अनुभव बेहतर होता है।"
    ],
    "commentSummary": [
      "एक उपयोगकर्ता ने कौवों की बुद्धिमत्ता और सामाजिक व्यवहार को उजागर करते हुए एक कहानी साझा की, जिसमें एक कौवे की चोट ने अन्य कौवों से समन्वित प्रतिक्रिया को जन्म दिया।",
      "लेख में उल्लेखित एक अध्ययन से पता चलता है कि हुडेड कौवे उपकरण बना सकते हैं, जो न्यू कैलेडोनियन कौवों के समान है, यह कौवों में व्यापक बुद्धिमत्ता का संकेत देता है।",
      "चर्चा का विस्तार पशु बुद्धिमत्ता और मानव धारणा के व्यापक विषयों तक हुआ, जिसमें उपयोगकर्ताओं ने कौवों के सामाजिक जीवन और संचार क्षमताओं के बारे में अपने अनुभव और अंतर्दृष्टि साझा की।"
    ],
    "points": 461,
    "commentCount": 253,
    "retryCount": 0,
    "time": 1725058019
  },
  {
    "id": 41407562,
    "title": "ईयू चैटकंट्रोल फिर से एजेंडा में शामिल है",
    "originLink": "https://digitalcourage.social/@echo_pbreyer/113055345076289453",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41407562",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "ईयू चैटकंट्रोल पर पुनर्विचार किया जा रहा है, जिससे राजनेताओं की संचार की निगरानी करने और दुरुपयोग को रोकने बनाम सरकारी पारदर्शिता सुनिश्चित करने के बारे में बहस छिड़ गई है।",
      "आलोचकों को चिंता है कि ये उपाय एक निगरानी राज्य की ओर ले जा सकते हैं, जिससे गोपनीयता अधिकारों का उल्लंघन हो सकता है और नागरिक स्वतंत्रताओं पर प्रभाव पड़ सकता है।",
      "यह चर्चा डिजिटल युग में सुरक्षा और गोपनीयता के बीच चल रहे तनाव को रेखांकित करती है।"
    ],
    "points": 266,
    "commentCount": 232,
    "retryCount": 0,
    "time": 1725096303
  },
  {
    "id": 41406799,
    "title": "इस महीने Servo में: टैब्ड ब्राउज़िंग, विंडोज़ बफ्स, डेवलपमेंट टूल्स, और अधिक",
    "originLink": "https://servo.org/blog/2024/08/31/this-month-in-servo/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41406799",
    "commentBody": "",
    "originSummary": [
      "सर्वो के नवीनतम नाइटली बिल्ड्स अब डिफ़ॉल्ट रूप से फ्लेक्सबॉक्स और वेबएक्सआर को सक्षम करते हैं, जिससे कई नए फीचर्स और अपग्रेड्स पेश किए जा रहे हैं।",
      "मुख्य अपडेट्स में HTMLDialogElement show() का समर्थन, WAV ऑडियो प्लेबैक, और crypto.randomUUID() API शामिल हैं, अन्य के साथ।",
      "प्रदर्शन और विश्वसनीयता में महत्वपूर्ण सुधार, जिसमें पुनः डिज़ाइन किया गया टूलबार, टैब्ड ब्राउज़िंग, और उन्नत विंडोज प्रदर्शन शामिल हैं।"
    ],
    "commentSummary": [
      "सर्वो, एक वेब ब्राउज़र इंजन परियोजना, ने टैब्ड ब्राउज़िंग और आरटीएल (दाएं-से-बाएं) समर्थन जैसी नई सुविधाओं को पेश किया है, जिससे फिर से रुचि जागृत हो गई है।",
      "अपनी संभावनाओं के बावजूद, सर्वो को वित्तपोषण में कठिनाइयों का सामना करना पड़ता है, मुख्य रूप से बड़े संगठनों के समर्थन के बजाय व्यक्तिगत दान पर निर्भर रहना पड़ता है।",
      "लिनक्स फाउंडेशन ने मोज़िला से इस परियोजना को अपने हाथ में ले लिया है, जो निरंतर विकास और संभावित वृद्धि का संकेत देता है।"
    ],
    "points": 251,
    "commentCount": 20,
    "retryCount": 0,
    "time": 1725083113
  },
  {
    "id": 41404748,
    "title": "शोधकर्ताओं ने लंबे कोविड मरीजों में अल्जाइमर जैसी मस्तिष्क में बदलाव पाए",
    "originLink": "https://uknow.uky.edu/research/uk-researchers-find-alzheimer-s-brain-changes-long-covid-patients",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41404748",
    "commentBody": "",
    "originSummary": [
      "यूके के केंटकी विश्वविद्यालय के सैंडर्स-ब्राउन सेंटर ऑन एजिंग के शोधकर्ताओं ने पाया कि लंबे समय तक COVID से पीड़ित मरीजों में संज्ञानात्मक हानि अल्जाइमर रोग के समान होती है।",
      "अल्जाइमर और डिमेंशिया में प्रकाशित अध्ययन, साझा मस्तिष्क विकार तंत्रों का सुझाव देता है, जो संभावित रूप से नए अनुसंधान और उपचार के मार्ग खोल सकता है।",
      "निष्कर्ष नियमित ईईजी परीक्षाओं की सिफारिश करते हैं ताकि COVID-19 से बचे लोगों में मस्तिष्क में होने वाले प्रारंभिक परिवर्तनों का पता लगाया जा सके, जिससे प्रारंभिक हस्तक्षेप और उपचार में सहायता मिल सके।"
    ],
    "commentSummary": [
      "शोधकर्ताओं ने लंबे कोविड मरीजों में अल्जाइमर जैसी मस्तिष्क में बदलावों की पहचान की है, जिनमें से कई गंभीर संज्ञानात्मक समस्याओं जैसे मस्तिष्क धुंध और स्मृति समस्याओं की रिपोर्ट कर रहे हैं।",
      "रोगियों को हृदय और श्वसन संबंधी लक्षण भी अनुभव होते हैं, लेकिन अक्सर वे गलत समझे जाते हैं और उन्हें अवसाद जैसी स्थितियों का गलत निदान किया जाता है।",
      "चिकित्सा समुदाय से आग्रह किया जा रहा है कि वे लंबे कोविड के बारे में जागरूकता और अनुसंधान को बढ़ाएं ताकि इन लक्षणों की समझ और उपचार में सुधार हो सके।"
    ],
    "points": 217,
    "commentCount": 155,
    "retryCount": 0,
    "time": 1725053888
  },
  {
    "id": 41406453,
    "title": "छोटे वेब की पुनः खोज (2020)",
    "originLink": "https://neustadt.fr/essays/the-small-web/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41406453",
    "commentBody": "",
    "originSummary": [
      "पोस्ट व्यावसायिक वेब, जो सगाई और रूपांतरण के लिए अनुकूलित है, की तुलना 'छोटे वेब' से करती है, जो व्यक्तियों द्वारा अपने रुचियों और शौकों को साझा करने के लिए बनाया गया एक रचनात्मक स्थान है।",
      "यह प्रारंभिक वेब के इतिहास को उजागर करता है, जिसे Geocities जैसे मुफ्त वेब होस्ट द्वारा लोकतांत्रित किया गया था, और कैसे आधुनिक प्लेटफार्म और सर्च इंजन व्यावसायिक हितों को प्राथमिकता देते हैं।",
      "प्रोजेक्ट्स जैसे Wiby.me, Neocities.org, और Curlie को छोटे वेब को जीवित रखने के प्रयासों के रूप में उल्लेख किया गया है, जो पाठकों को बुनियादी HTML और CSS का उपयोग करके अपनी खुद की वेबसाइट बनाने के लिए प्रोत्साहित करते हैं।"
    ],
    "commentSummary": [
      "‘छोटा वेब’ आंदोलन गति पकड़ रहा है, जिसमें कागी स्मॉल वेब जैसे प्रोजेक्ट्स खोज परिणामों में छोटे, स्वतंत्र ब्लॉगों को इंडेक्स और प्राथमिकता दे रहे हैं।",
      "इस परियोजना ने हाल ही में अपनी एक हजारवीं कमिट का जश्न मनाया, जो सक्रिय विकास और समुदाय की भागीदारी को दर्शाता है।",
      "बड़े, व्यावसायिक वेबसाइटों के प्रभुत्व से बढ़ती असंतोष और अधिक व्यक्तिगत, कम व्यावसायिक वेब अनुभवों को फिर से खोजने की इच्छा को \"छोटे वेब\" में रुचि के पुनरुत्थान ने उजागर किया है।"
    ],
    "points": 202,
    "commentCount": 47,
    "retryCount": 0,
    "time": 1725076598
  },
  {
    "id": 41404187,
    "title": "ब्राज़ीलियाई अदालत ने X के निलंबन का आदेश दिया",
    "originLink": "https://www.theguardian.com/technology/article/2024/aug/30/elon-musk-x-could-face-ban-in-brazil-after-failure-to-appoint-legal-representative",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41404187",
    "commentBody": "",
    "originSummary": [
      "ब्राज़ील के सुप्रीम कोर्ट ने एलन मस्क के सोशल मीडिया प्लेटफॉर्म, X, को ब्राज़ील में कानूनी प्रतिनिधि नियुक्त न करने के कारण निलंबित करने का आदेश दिया है।",
      "न्यायाधीश अलेक्जेंड्रे डी मोराएस ने अदालत के आदेशों का पालन, जुर्माने का भुगतान और एक कानूनी प्रतिनिधि की नियुक्ति होने तक X के संचालन की 'तत्काल, पूर्ण और कुल निलंबन' का आदेश दिया।",
      "निर्णय में वीपीएन के माध्यम से X का उपयोग करने पर दैनिक जुर्माना शामिल है, और मस्क की स्टारलिंक के बैंक खातों को X के खिलाफ जुर्माना लागू करने के लिए अवरुद्ध कर दिया गया है, हालांकि स्टारलिंक चालू है और अपने खातों को अनफ्रीज करने की कोशिश कर रहा है।"
    ],
    "commentSummary": [
      "एक ब्राज़ीलियाई अदालत ने ब्राज़ील में X (पूर्व में ट्विटर) को निलंबित करने का आदेश दिया है, और वीपीएन के माध्यम से इसे एक्सेस करने वाले उपयोगकर्ताओं पर प्रतिदिन $8,900 का जुर्माना लगाया है।",
      "अदालत ने एप्पल और गूगल से अपने स्टोर्स से वीपीएन ऐप्स को हटाने और उन्हें उपयोगकर्ताओं के फोन से डिलीट करने की भी मांग की, जिससे महत्वपूर्ण बहस छिड़ गई।",
      "एक्स द्वारा गलत सूचना फैलाने के आरोपित खातों को ब्लॉक करने से इनकार करने के कारण आए फैसले ने ब्राजील में अभिव्यक्ति की स्वतंत्रता और न्यायपालिका की शक्ति के बारे में चिंताएं बढ़ा दी हैं।"
    ],
    "points": 185,
    "commentCount": 335,
    "retryCount": 0,
    "time": 1725050128
  },
  {
    "id": 41407768,
    "title": "डेबियन में bcachefs-tools को अनाथ करना",
    "originLink": "https://jonathancarter.org/2024/08/29/orphaning-bcachefs-tools-in-debian/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41407768",
    "commentBody": "",
    "originSummary": [
      "लेखक ने रखरखाव की चुनौतियों, विशेष रूप से रस्ट निर्भरताओं और अपस्ट्रीम लेखक की निर्भरताओं को बंडल करने की जिद के कारण, डेबियन में bcachefs-tools पैकेज को अनाथ करने का निर्णय लिया।",
      "Bcachefs, bcache ब्लॉक कैश सिस्टम का एक विकास, अंतर्निहित संपीड़न, एन्क्रिप्शन, चेकसमिंग, और RAID जैसी सुविधाएँ प्रदान करता है, लेकिन इसमें dkms मॉड्यूल की कमी है, जिससे इसका एकीकरण जटिल हो जाता है।",
      "पैकेज अब डेबियन के प्रायोगिक रिपॉजिटरी में उपलब्ध है, लेकिन संभावित समस्याओं से बचने के लिए इसे अस्थिर और स्थिर संस्करणों से हटा दिया गया है, जो इसकी दीर्घकालिक समर्थन क्षमता और स्थिरता के बारे में चिंताओं को उजागर करता है।"
    ],
    "commentSummary": [
      "डेबियन निर्भरता प्रबंधन मुद्दों और अपस्ट्रीम डेवलपर, केंट ओवरस्ट्रीट के साथ संघर्षों के कारण bcachefs-tools को अनाथ कर रहा है।",
      "यह स्थिति तेज़ी से बदलते, निर्भरता-भारी परियोजनाओं को स्थिर वितरणों जैसे कि डेबियन में एकीकृत करने की चुनौतियों को उजागर करती है।",
      "व्यापक चर्चा में आधुनिक सॉफ़्टवेयर पारिस्थितिक तंत्रों में निर्भरताओं का प्रबंधन शामिल है, विशेष रूप से ऐसे भाषाओं के साथ जैसे कि रस्ट जो वेंडरिंग को बढ़ावा देते हैं, स्थिरता, सुरक्षा और अद्यतित सॉफ़्टवेयर की आवश्यकता के बीच संतुलन बनाना।"
    ],
    "points": 158,
    "commentCount": 165,
    "retryCount": 0,
    "time": 1725099730
  },
  {
    "id": 41403971,
    "title": "एलिक्सिर से नसों तक",
    "originLink": "https://underjord.io/to-nerves-from-elixir.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41403971",
    "commentBody": "",
    "originSummary": [
      "अंडरजॉर्ड, जो एक छोटी टीम है और एलीक्सिर परामर्श प्रदान करती है, ने नर्व्स कोर टीम में एक नए सदस्य को शामिल किया है जिसका उद्देश्य हार्डवेयर को विश्वसनीय, समवर्ती सॉफ़्टवेयर के साथ एकीकृत करने में मदद करना है।",
      "यह पोस्ट नर्व्स के साथ शुरुआत करने के लिए एक विस्तृत मार्गदर्शिका प्रदान करती है, जिसमें निर्भरताओं की स्थापना के चरण, रास्पबेरी पाई सेटअप और वाई-फाई कॉन्फ़िगर करना शामिल है।",
      "Nerves अनोखी विशेषताएँ प्रदान करता है जैसे नेटवर्किंग के लिए VintageNet, समय प्रबंधन के लिए NervesTime, और A/B फर्मवेयर विभाजन, साथ ही अतिरिक्त उपकरण जैसे फर्मवेयर अपडेट के लिए NervesHub और हार्डवेयर एन्क्रिप्शन के लिए NervesKey।"
    ],
    "commentSummary": [
      "Nerves एक न्यूनतम Linux और OTP/BEAM VM के साथ बूट करता है, जिससे Elixir एक एम्बेडेड ऑपरेटिंग सिस्टम में परिवर्तित हो जाता है।",
      "GRiSP परियोजना BEAM VM को हार्डवेयर पर सीधे बूट करने की अनुमति देती है, जिससे इसका उपयोग एम्बेडेड सिस्टम में बढ़ जाता है।",
      "एटमवीएम बीईएएम वीएम का एक मिनी संस्करण है जो माइक्रोकंट्रोलर्स के लिए डिज़ाइन किया गया है, और यह अर्दुइनो या रास्पबेरी पाई पिको जैसे उपकरणों पर एरलैंग और एलीक्सिर चलाने के लिए एक समाधान प्रदान करता है।"
    ],
    "points": 152,
    "commentCount": 35,
    "retryCount": 0,
    "time": 1725048339
  },
  {
    "id": 41405364,
    "title": "Expect – इंटरएक्टिव प्रोग्रामों को स्वचालित करने के लिए लिनक्स टूल",
    "originLink": "https://linux.die.net/man/1/expect",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41405364",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Expect एक मजबूत लिनक्स उपकरण है जो इंटरैक्टिव प्रोग्रामों को स्वचालित करने के लिए उपयोग किया जाता है। इसे 1990 में डॉन लिब्स द्वारा बनाया गया था, यहां तक कि लिनक्स के अस्तित्व में आने से पहले।",
      "उपयोगकर्ताओं ने हार्डवेयर कॉन्फ़िगरेशन, SSH लॉगिन, और सीरियल-पोर्ट संचार जैसी कार्यों को स्वचालित करने के लिए Expect का सफलतापूर्वक उपयोग किया है।",
      "अपनी उम्र के बावजूद, Expect अपनी बहुमुखी प्रतिभा और विश्वसनीयता के कारण प्रासंगिक बना हुआ है, जबकि पायथन के लिए pexpect और sshpass जैसे विकल्प भी उपलब्ध हैं।"
    ],
    "points": 151,
    "commentCount": 81,
    "retryCount": 0,
    "time": 1725059858
  },
  {
    "id": 41404733,
    "title": "लिनक्स में रस्ट का पुनरावलोकन",
    "originLink": "https://drewdevault.com/2024/08/30/2024-08-30-Rust-in-Linux-revisited.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41404733",
    "commentBody": "",
    "originSummary": [
      "लेखक अपने पिछले संदेह को पुनः देखता है कि रस्ट को लिनक्स कर्नेल में एकीकृत करना चाहिए या नहीं, अब एक अधिक सहानुभूतिपूर्ण दृष्टिकोण के साथ।",
      "वे रस्ट-फॉर-लिनक्स परियोजना में डेवलपर्स द्वारा अनुभव किए गए बर्नआउट को स्वीकार करते हैं और एक वैकल्पिक प्रस्ताव रखते हैं: रस्ट का उपयोग करके शुरू से एक नया लिनक्स-संगत कर्नेल बनाना।",
      "यह नया प्रोजेक्ट लिनक्स समुदाय की राजनीतिक चुनौतियों से बच सकता है, योगदानकर्ताओं को आकर्षित कर सकता है, और नए कर्नेल डेवलपर्स को मार्गदर्शन प्रदान कर सकता है, जिससे डेवलपर बर्नआउट का संभावित समाधान मिल सकता है।"
    ],
    "commentSummary": [
      "ड्रू डेवॉल्ट का प्रस्ताव है कि रस्ट-फॉर-लिनक्स डेवलपर्स को मौजूदा लिनक्स कर्नेल के हिस्सों को रस्ट में फिर से लिखने के बजाय, शुरू से एक नया लिनक्स-संगत कर्नेल बनाना चाहिए।",
      "वह तर्क देते हैं कि मुख्य समस्या लिनक्स की संरचना में है, जहां ड्राइवर बाकी कर्नेल के साथ चलते हैं, और एक नए माइक्रोकर्नेल जैसे हेलिओस का सुझाव देते हैं, जो ड्राइवरों को उपयोगकर्ता-स्थान में चलाने की अनुमति देता है, एक बेहतर समाधान के रूप में।",
      "यह दृष्टिकोण मौजूदा लिनक्स कर्नेल में रस्ट को एकीकृत करने से जुड़े राजनीतिक चुनौतियों और थकान को दरकिनार कर सकता है, भले ही आलोचक रस्ट की सी की तुलना में बेहतर मेमोरी सुरक्षा को उजागर करते हों।"
    ],
    "points": 151,
    "commentCount": 143,
    "retryCount": 0,
    "time": 1725053809
  },
  {
    "id": 41409503,
    "title": "कठिन ड्राइव: हार्ड ड्राइव्स जो हम नहीं चाहते थे, या जरूरत नहीं थी [वीडियो] (2022)",
    "originLink": "http://tom7.org/harder/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41409503",
    "commentBody": "",
    "originSummary": [
      "पेपर \"हार्डर ड्राइव: हार्ड ड्राइव्स जो हम नहीं चाहते थे या जिनकी हमें आवश्यकता नहीं थी\" को SIGBOVIK 2022 में प्रस्तुत किया गया, जो कंप्यूटर विज्ञान पर अपने हास्यपूर्ण और व्यंग्यात्मक दृष्टिकोण के लिए जाना जाता है।",
      "IPv4 पता स्थान का अन्वेषण करने के लिए एक ऐप 64-बिट विंडोज मशीनों के लिए उपलब्ध है जिसमें 32 जीबी रैम है, जो अप्रैल 2022 तक एक विशिष्ट टोरेंट के माध्यम से सुलभ है।",
      "अतिरिक्त सामग्री, जिसमें संबंधित वीडियो और रिंगटोन शामिल हैं, लेखक के YouTube चैनल और ब्लॉग पर पाई जा सकती है।"
    ],
    "commentSummary": [
      "टॉम7 का वीडियो 'हार्डर ड्राइव' डेटा स्टोरेज के अपरंपरागत तरीकों की खोज करता है, जिससे उनके रचनात्मक कार्य में नई रुचि जागृत होती है।",
      "इस अवधारणा में गुप्त डेटा को विभाजित करना और उसे गैर-मौजूद ईमेल पतों पर भेजना शामिल है ताकि बाद में उसे पुनः प्राप्त किया जा सके, जो पुराने डेटा भंडारण तकनीकों जैसे देरी-रेखा मेमोरी की याद दिलाता है।",
      "यह चर्चा टॉम7 के टाइपसेटिंग के प्रति उनके सूक्ष्म दृष्टिकोण और उनकी आकर्षक वीडियो प्रस्तुतियों को उजागर करती है, जो नए और पुराने दोनों अनुयायियों का ध्यान आकर्षित करती है।"
    ],
    "points": 150,
    "commentCount": 28,
    "retryCount": 0,
    "time": 1725117690
  },
  {
    "id": 41409475,
    "title": "रस्ट अधूरी कर्नेल लिनक्स एपीआई दस्तावेज़ों की समस्या का समाधान करता है",
    "originLink": "https://vt.social/@lina/113056457969145576",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41409475",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "रस्ट एक मजबूत प्रकार प्रणाली का उपयोग करके लिनक्स कर्नेल एपीआई दस्तावेज़ीकरण में सुधार करता है, अस्पष्टता को कम करता है और कोड सुरक्षा को बढ़ाता है।",
      "रस्ट में प्रकार प्रणाली थ्रेड सुरक्षा और म्यूटेशन सुरक्षा सुनिश्चित करती है, कोड समीक्षा को सरल बनाती है और व्यापक दस्तावेज़ीकरण की आवश्यकता को कम करती है।",
      "हालांकि यह केवल लिनक्स कर्नेल तक सीमित नहीं है, रस्ट का दृष्टिकोण किसी भी कोडबेस को लाभ पहुंचाता है क्योंकि यह डेवलपर्स को इनवेरिएंट्स को बनाए रखने के बजाय व्यापारिक तर्क पर अधिक ध्यान केंद्रित करने की अनुमति देता है।"
    ],
    "points": 150,
    "commentCount": 51,
    "retryCount": 0,
    "time": 1725117414
  },
  {
    "id": 41405961,
    "title": "कैसेट टेप संग्रह",
    "originLink": "http://www.tapedeck.org/index.php",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41405961",
    "commentBody": "",
    "originSummary": [
      "Tapedeck.org एक परियोजना है जो एनालॉग ऑडियो टेप कैसेट्स की पुरानी यादों और इतिहास का जश्न मनाती है, जिसमें 60 के दशक से 90 के दशक तक के विभिन्न ब्रांडों और डिज़ाइनों का संग्रह शामिल है।",
      "कॉम्पैक्ट कैसेट, जिसे 1963 में फिलिप्स द्वारा पेश किया गया था, 1980 के दशक में सोनी वॉकमैन के आगमन के साथ काफी लोकप्रिय हो गया और आधुनिक तकनीकों के बावजूद कुछ क्षेत्रों में आज भी लोकप्रिय है।",
      "उपयोगकर्ताओं को संग्रह का अन्वेषण करने, टेप के इतिहास के बारे में जानने, और अपनी टेपों की तस्वीरें भेजकर योगदान करने के लिए प्रोत्साहित किया जाता है।"
    ],
    "commentSummary": [
      "यह पोस्ट कैसेट टेप्स के लिए पुरानी यादों को ताजा करती है, व्यक्तिगत अनुभवों और मिक्स टेप्स बनाने और रेडियो से गाने रिकॉर्ड करने की संस्कृति को उजागर करती है।",
      "यहां एक मजबूत कैसेट हैकिंग संस्कृति का उल्लेख है, जिसमें सर्किट बेंडिंग वॉकमैन और लूप्स बनाना शामिल है, और इसके लिए पाठ्यक्रम और चर्चाओं जैसी संसाधन उपलब्ध कराए गए हैं।",
      "उपयोगकर्ता टेप ट्रेडिंग की यादें साझा करते हैं, टेप ट्रीज़ को संगठित करने के सामाजिक पहलुओं और विभिन्न टेपों की अनूठी ध्वनि गुणों के बारे में बताते हैं।"
    ],
    "points": 128,
    "commentCount": 13,
    "retryCount": 0,
    "time": 1725067088
  },
  {
    "id": 41404117,
    "title": "तकनीकी साक्षात्कार के दौरान स्थिति बदलने के लिए तीन प्रश्न",
    "originLink": "https://bellmar.medium.com/three-critical-questions-to-turn-the-table-during-technical-interviews-dd1594c278b8",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41404117",
    "commentBody": "",
    "originSummary": [
      "जब एक साक्षात्कारकर्ता पूछता है, 'क्या आपके पास मेरे लिए कोई प्रश्न हैं?' यह क्षण उम्मीदवारों के लिए कार्य वातावरण और कंपनी संस्कृति को समझने के लिए महत्वपूर्ण होता है।",
      "साक्षात्कार को न केवल उम्मीदवार के कौशल का आकलन करना चाहिए बल्कि उम्मीदवार को यह भी समझाना चाहिए कि संगठन उनके लिए क्यों उपयुक्त है, विशेष रूप से उनके लिए जो अपने करियर की शुरुआत में हैं।",
      "साक्षात्कार प्रक्रिया के प्रत्येक चरण में साक्षात्कारकर्ताओं से पूछने के लिए एक मानक प्रश्नों का सेट तैयार करना उम्मीदवारों को महत्वपूर्ण जानकारियाँ एकत्र करने में मदद कर सकता है।"
    ],
    "commentSummary": [
      "तकनीकी साक्षात्कार के दौरान पूछे जाने वाले तीन महत्वपूर्ण प्रश्नों में शामिल हैं: व्यक्तिगत योगदानकर्ताओं (ICs) से नए विचारों को संभालना, प्रमुख माइग्रेशन के अनुभव, और छह महीने की नौकरी के बाद अपेक्षित परिवर्तन।",
      "ये प्रश्न कंपनी की संस्कृति, परियोजना प्रबंधन प्रथाओं और भूमिका के संभावित प्रभाव का आकलन करने में मदद करते हैं।",
      "भूमिका में एक सामान्य दिन या सप्ताह के बारे में पूछना वास्तविक नौकरी और नौकरी विवरण के बीच अंतर्दृष्टि प्रदान कर सकता है, साक्षात्कार को एक पारस्परिक मूल्यांकन प्रक्रिया के रूप में महत्व देते हुए।"
    ],
    "points": 125,
    "commentCount": 88,
    "retryCount": 0,
    "time": 1725049514
  }
]
