[
  {
    "id": 40469592,
    "title": "Spot: Ny plattformsoberoende, reaktiv GUI-verktygslåda för Go-utvecklare",
    "originLink": "https://github.com/roblillack/spot",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40469592",
    "commentBody": "",
    "originSummary": [
      "Spot är ett nytt plattformsoberoende GUI-bibliotek för programmeringsspråket Go, inspirerat av React, som syftar till att tillhandahålla ett konsekvent API för Mac, Linux och BSD, med framtida planer för Windows-stöd.",
      "Det använder FLTK och Cocoa för att erbjuda en traditionell, inbyggd widgetuppsättning och antar en reaktiv UI-modell.",
      "Skaparen utvecklade Spot för att tillgodose behovet av ett traditionellt utseende, plattformsoberoende GUI-verktyg i Go och söker designåterkoppling och bidrag."
    ],
    "commentSummary": [
      "Spot är en ny plattformsoberoende GUI-verktygslåda för Go, inspirerad av React, utformad för att erbjuda ett konsekvent API för Mac, Linux och BSD, med framtida planer för Windows-stöd.",
      "Det använder FLTK och Cocoa för inbyggda widgetar och syftar till att slå samman Go's prestanda med en modern, reaktiv användargränssnittsstrategi, och skaparen söker feedback och bidrag från samhället.",
      "Diskussionerna betonar fördelarna med ett virtuellt kontrollträd för tillståndshantering och jämför det med deklarativa GUI:er, medan användarna delar med sig av sina erfarenheter av andra ramverk som GTK och Fyne och belyser utmaningar med plattformsoberoende byggande och behov av effektiv tillståndshantering."
    ],
    "points": 276,
    "commentCount": 47,
    "retryCount": 0,
    "time": 1716578371
  },
  {
    "id": 40474712,
    "title": "Säkerhetsproblem med icke-Go-förvar i Go's Checksum-databas",
    "originLink": "https://reverse.put.as/2024/05/24/abusing-go-infrastructure/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40474712",
    "commentBody": "",
    "originSummary": [
      "Författaren hittade icke-Go-arkiv i Go:s checksummedatabas, vilket väckte frågor om dess integritet och säkerhet.",
      "De demonstrerade möjligheten att ladda in godtycklig data i Go:s publika proxy med hjälp av GitHub-arkiv och visade på potentiella sårbarheter trots begränsningar i filstorlek.",
      "Författaren menar att Go-infrastrukturen inte är särskilt sårbar, men att den kan missbrukas och förbättras, och efterlyser ytterligare undersökningar av hur icke-Go-projekt inkluderas i checksum-databasen."
    ],
    "commentSummary": [
      "Onlinetjänster som Twitter, Telegram och GitHub utnyttjas ofta för skadliga aktiviteter, vilket innebär utmaningar på grund av deras dubbla användningsområden, vilket försvårar arbetet med att blockera missbruk utan att påverka legitim användning.",
      "Integritetsfrågor uppstår när användardata övervakas för att upptäcka missbruk, och diskussionerna omfattar även plattformar som Gmail, Google Drive, HuggingFace och GitHub för fildelning.",
      "CUE-teamet samarbetade med Go-teamet om modulsystem, valde OCI-register framför Go:s proxy på grund av säkerhetsproblem och diskuterade den mindre frågan om potentiellt missbruk av Go-modulproxyer för att lagra godtyckliga data."
    ],
    "points": 231,
    "commentCount": 42,
    "retryCount": 0,
    "time": 1716641400
  },
  {
    "id": 40473198,
    "title": "Effektiv finjustering av Mistral-modeller med LoRA Training Paradigm",
    "originLink": "https://github.com/mistralai/mistral-finetune",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40473198",
    "commentBody": "",
    "originSummary": [
      "Mistral-finetune är en lätt kodbas utformad för minneseffektiv och högpresterande finjustering av Mistrals modeller med hjälp av LoRA (Low-Rank Adaptation) träningsparadigm.",
      "Den stöder både multi-GPU- och single-GPU-konfigurationer, med optimal prestanda på A100- eller H100-GPU:er, och innehåller omfattande instruktioner för dataformatering, installation och förberedelse av dataset.",
      "Kodbasen innehåller verktyg för omformatering och validering av dataset, detaljerade steg för installation och hantering av utbildning samt riktlinjer för användning av mistral-inferens för modellinteraktion och felsökning av vanliga problem som CUDA-minnesfel."
    ],
    "commentSummary": [
      "Diskussionen fokuserar på relevansen och strategierna för att finjustera språkmodeller (LM) mitt i den snabba utvecklingen, och betonar dess värde för nischapplikationer men noterar utmaningar på grund av modellföråldring.",
      "Retrieval-Augmented Generation (RAG) lyfts fram som ett praktiskt alternativ för att integrera specifika data och erbjuder en annan metod för finjustering.",
      "Rekommendationerna inkluderar att använda stationära datorer med spel framför bärbara datorer för att köra modeller, överväga molntjänster och eGPU:er och använda verktyg som HuggingFaces SFTTrainer för att optimera modellernas prestanda."
    ],
    "points": 181,
    "commentCount": 58,
    "retryCount": 0,
    "time": 1716620987
  },
  {
    "id": 40474202,
    "title": "Googles algoritmuppdatering drabbar oberoende utgivare, gynnar stora sajter och Reddit",
    "originLink": "https://www.bbc.com/future/article/20240524-how-googles-new-algorithm-will-shape-your-internet",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40474202",
    "commentBody": "",
    "originSummary": [
      "Googles senaste uppdateringar av sökalgoritmen har haft en betydande inverkan på oberoende utgivare och gynnat större livsstilsmagasin och användargenererade plattformar som Reddit.",
      "Införandet av AI-genererade svar syftar till att minska innehåll av låg kvalitet men har lett till drastiska minskningar av trafik och intäkter för mindre webbplatser, vilket tvingat vissa att minska sin verksamhet.",
      "Google står inför flera antitrusträttegångar, bland annat en från det amerikanska justitiedepartementet, som anklagar företaget för att upprätthålla ett olagligt monopol i sökmotorbranschen."
    ],
    "commentSummary": [
      "Googles uppdaterade sökalgoritm har lett till betydande minskningar av webbplatstrafiken och tvingat fram förändringar i SEO-strategier, vilket kan leda till att vissa webbplatser stängs.",
      "Användare uttrycker missnöje med Googles annonstunga sökresultat, lägger ofta till \"Reddit\" i frågor för mer relevanta resultat och utforskar alternativ som Kagi och DuckDuckGo.",
      "Diskussionen speglar en bredare frustration över nuvarande sökmotorer, och lyfter fram ett skifte mot AI-drivet innehåll och behovet av bättre sökverktyg, trots utmaningar från nya konkurrenter."
    ],
    "points": 161,
    "commentCount": 155,
    "retryCount": 0,
    "time": 1716635666
  },
  {
    "id": 40472374,
    "title": "Omfamna misstag: En uppmaning till konstruktiv kritik inom programvaruutveckling",
    "originLink": "https://rachelbythebay.com/w/2018/04/28/meta/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40472374",
    "commentBody": "",
    "originSummary": [
      "Blogginlägget tar upp vanlig kritik inom mjukvaruutveckling, bland annat dålig kodkvalitet, rekryteringsproblem och otillräcklig testning.",
      "Författaren betonar att misstag är oundvikliga, även för erfarna utvecklare, och lyfter fram programmeringens samarbetsinriktade karaktär.",
      "Inlägget avslutas med en sarkastisk kommentar som antyder att kritiker bör förklara sin överlägsenhet och låta andra hantera praktiska utmaningar."
    ],
    "commentSummary": [
      "Diskussionen belyser balansen mellan att sträva efter perfekt kod och att hantera teknisk skuld i teammiljöer.",
      "Betonar vikten av konstruktiv feedback, att förstå sammanhanget bakom kodningsbeslut och att upprätthålla professionalism.",
      "Förespråkar en kultur av öppenhet, ständiga förbättringar och empati, och inser att det är oundvikligt med buggar och att perfektion är opraktiskt."
    ],
    "points": 161,
    "commentCount": 65,
    "retryCount": 0,
    "time": 1716606788
  },
  {
    "id": 40472146,
    "title": "JetBrains lanserar RustRover IDE med AI-assistans för utveckling av Rust",
    "originLink": "https://www.infoworld.com/article/3715317/jetbrains-releases-rustrover-ide-for-rust-development.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40472146",
    "commentBody": "",
    "originSummary": [
      "JetBrains har introducerat RustRover, en specialiserad integrerad utvecklingsmiljö (IDE) för Rust-programmering, som lanserades den 21 maj 2024.",
      "RustRover erbjuder funktioner som en integrerad Rust-verktygskedja, feedback i realtid, kodförslag, förenklad verktygskedjehantering och teamsamarbete.",
      "RustRover är tillgängligt under både betalda kommersiella och fria icke-kommersiella licenser och stöder Rust-kompilatorn, versionshantering, feldetektering, frontend-teknik, databaser, enhetstestning och JetBrains AI Assistant-plugin."
    ],
    "commentSummary": [
      "JetBrains har introducerat RustRover, en IDE för Rust som är gratis och inte kan användas kommersiellt, men har tagit bort JavaScript/TypeScript-stödet, vilket gör det exklusivt för den betalda IntelliJ-prenumerationen.",
      "Denna förändring har väckt kontroverser eftersom ingen enskild IDE nu har fullt stöd för både Rust och webbprojekt, även om JetBrains planerar att erbjuda Rust plugin-stöd i IntelliJ IDEA Ultimate gratis.",
      "Användare diskuterar olika IDE:er och textredigerare, inklusive Vim, Neovim, VSCode, IntelliJ och den kommande Fleet IDE, och belyser avvägningar mellan anpassning, bekvämlighet, kostnad och licensiering."
    ],
    "points": 161,
    "commentCount": 85,
    "retryCount": 0,
    "time": 1716603358
  },
  {
    "id": 40474236,
    "title": "Googles AI-rusning äventyrar sökkvaliteten, säger John Gruber",
    "originLink": "https://daringfireball.net/linked/2024/05/24/publishing-ai-slop-is-a-choice",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40474236",
    "commentBody": "",
    "originSummary": [
      "John Gruber kritiserar Google för att snabbt ha integrerat AI i sin sökmotor, vilket leder till fel och försämrad sökkvalitet.",
      "Han menar att Google offrar användarnas långsiktiga förtroende för att konkurrera med sina konkurrenter, trots att de har möjlighet att fokusera på kvalitet.",
      "Gruber anser att Googles brådska att undvika att verka \"bakom\" leder till att opålitlig information sprids."
    ],
    "commentSummary": [
      "Google har offentliggjort AI-översikter i USA, vilket har väckt oro för deras tillförlitlighet och potential för manipulation, trots ansträngningar för att förbättra noggrannheten med AGREE-ramverket.",
      "Användarna är missnöjda med Googles annonstunga, AI-drivna sökresultat, vilket har fått dem att utforska alternativ som Phind och OpenAI, och de uttrycker ett behov av mer pålitliga, socialt drivna söklösningar.",
      "Diskussionen belyser en bredare fråga om snabb, oreglerad AI-utveckling, potentiell felaktig information och behovet av bättre kunskap om AI-utfall och ansvarstagande från teknikföretag."
    ],
    "points": 158,
    "commentCount": 61,
    "retryCount": 0,
    "time": 1716636352
  },
  {
    "id": 40471798,
    "title": "Dynamisk webbsidestil och säkerhet med CSS och JavaScript",
    "originLink": "https://email.ml/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40471798",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Hacker News diskussion om Email.ml, en minimalistisk tillfällig e-posttjänst, understryker utmaningar som att bli blockerad eller svartlistad när de blir allt populärare.",
      "Användarna föreslår alternativ som personliga domäner med alias och filter, och noterar att tillfälliga e-posttjänster är olika effektiva på grund av sofistikerade detekteringsmetoder.",
      "Det finns farhågor om transparensen och trovärdigheten hos vissa tjänster, särskilt de som använder .ml-domäner, och balansen mellan att förhindra spam och säkerställa användartillgänglighet diskuteras."
    ],
    "points": 152,
    "commentCount": 74,
    "retryCount": 0,
    "time": 1716598322
  },
  {
    "id": 40474165,
    "title": "Lapis 1.16.0: Förbättrat Lua Web Framework för OpenResty med nya funktioner",
    "originLink": "https://leafo.net/lapis/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40474165",
    "commentBody": "",
    "originSummary": [
      "Lapis är ett webbramverk för att bygga applikationer i Lua eller MoonScript, optimerat för den högpresterande OpenResty-plattformen men även kompatibelt med andra servermiljöer.",
      "Version 1.16.0 introducerar `types.params_map` och förbättrade `model:update`, vilket förbättrar dess funktionalitet.",
      "Viktiga funktioner inkluderar URL-routing, HTML-templating, CSRF-skydd, sessionsstöd och databasmodeller för PostgreSQL, MySQL och SQLite, som utnyttjar LuaJIT för effektiv körning inom Nginx och stöder asynkrona operationer via Lua coroutines."
    ],
    "commentSummary": [
      "Lapis, ett Lua-webbramverk som används av itch.io, styrs främst av itch.ios behov, vilket orsakar förseningar i funktioner som websocket-stöd på grund av OpenRestys API-begränsningar.",
      "Diskussioner på Hacker News belyser projektunderhållares rätt att avvisa pull requests för icke-kärnfunktioner och förespråkar öppenhet om projektbegränsningar.",
      "Användarna diskuterar fördelarna och nackdelarna med Lua och dess varianter, där vissa föredrar alternativ som Nelua, Teal och Luau, men konsensus föredrar att lära sig vanilla Lua för dess enkelhet och stabilitet."
    ],
    "points": 136,
    "commentCount": 39,
    "retryCount": 0,
    "time": 1716634601
  },
  {
    "id": 40472226,
    "title": "Neuralt nätverk lär sig spela NetHack och stöter på bisarr bugg",
    "originLink": "https://twitter.com/cupiabart/status/1793930355617259811",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40472226",
    "commentBody": "",
    "originSummary": [
      "Bartłomiej Cupiał berättade om en ovanlig bugg som uppstod när han tränade ett neuralt nätverk att spela roguelike-spelet NetHack.",
      "Projektet innebar ett samarbete med Maciej Wolczyk och belyste komplexiteten och de oväntade utmaningarna i AI-träning.",
      "Den här historien understryker hur oförutsägbart det är att utveckla AI-system, särskilt i komplexa miljöer som spel."
    ],
    "commentSummary": [
      "Användare av Hacker News uttrycker frustration över Twitters användbarhet, särskilt för trådar med flera delar som kräver inloggning, och föreslår alternativ som Thread Reader och Fediverse.",
      "I diskussionen förklaras datorproblem på ett humoristiskt sätt med \"fullmånar\" eller \"soleruptioner\" och tekniska förklaringar till oförutsägbart beteende hos programvaran diskuteras, t.ex. elektromagnetisk interferens (EMI) och dåliga kabelavslutningar.",
      "Tråden täcker också effekterna av verklig tid på AI-modeller och spel som NetHack, vilket belyser utmaningarna med att träna AI med fasta frön och riskerna med överjustering."
    ],
    "points": 134,
    "commentCount": 49,
    "retryCount": 0,
    "time": 1716604556
  },
  {
    "id": 40475578,
    "title": "Google skyndar sig att fixa AI-sökverktyg efter bisarra svarsfel",
    "originLink": "https://www.theverge.com/2024/5/24/24164119/google-ai-overview-mistakes-search-race-openai",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40475578",
    "commentBody": "",
    "originSummary": [
      "Google tar nu snabbt itu med bisarra och felaktiga svar från sitt AI-sökverktyg, AI Overview, efter reaktioner i sociala medier på förslag som att lägga lim på pizza eller äta stenar.",
      "Trots omfattande tester och kostnadsminskningar har utrullningen kritiserats för låg kvalitet, och Google tillskriver de flesta problemen ovanliga frågor eller manipulerade exempel.",
      "Experter lyfter fram svårigheten med att uppnå nästan perfekta AI-svar och konstaterar att avancerade resonemangsfunktioner är nödvändiga, medan pressen att konkurrera med rivaler som Bing och OpenAI har lett till en problematisk lansering som påverkar Googles rykte."
    ],
    "commentSummary": [
      "Google korrigerar AI-genererade sökfel manuellt, vilket påminner om tidigare algoritmjusteringar och väcker debatt om sökmotorernas roll.",
      "Kritiker hävdar att stora språkmodeller (LLM) genererar probabilistisk och ofta okontrollerbar text, vilket leder till \"hallucinationer\" och inkonsekventa resultat, vilket ifrågasätter deras tillförlitlighet.",
      "Diskussionen kritiserar Googles skifte från sökkvalitet till annonsintäkter och väcker frågor om AI:s tillförlitlighet, användningen av okrypterad data och behovet av bättre riskhantering och efterlevnad av standarder."
    ],
    "points": 131,
    "commentCount": 185,
    "retryCount": 0,
    "time": 1716650667
  },
  {
    "id": 40475178,
    "title": "Hikikomori: Den ökande globala utmaningen med social tillbakadragenhet",
    "originLink": "https://www.cnn.com/interactive/2024/05/world/hikikomori-asia-personal-stories-wellness/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40475178",
    "commentBody": "",
    "originSummary": [
      "CNN-artikeln handlar om fenomenet hikikomori, personer som isolerar sig i hemmet under långa perioder på grund av psykologiska, sociala och kulturella faktorer.",
      "Hikikomori identifierades ursprungligen i Japan, men är nu ett globalt problem som förvärrats av internet och covid-19-pandemin, med personliga berättelser från Hongkong och Japan som illustrerar utmaningarna och återhämtningsprocesserna.",
      "Arbetet med att återintegrera hikikomori är brådskande på grund av åldrande befolkningar och sjunkande födelsetal, med program för kollektivt boende i Sydkorea och krav på specialiserad behandling för att motverka social tillbakadragenhet."
    ],
    "commentSummary": [
      "I artikeln undersöks hikikomori, ett tillstånd av extrem social tillbakadragenhet, och dess förvärring på grund av ekonomiska och hälsorelaterade problem, tillsammans med Kinas \"lay flat\"-rörelse som drivs av brist på jobb och höga levnadskostnader.",
      "Den utforskar teman som social isolering, effekterna av modern teknik, samhälleliga påtryckningar och individualism, och kontrasterar historiska och moderna existentiella hot som kärnvapenkrig och klimatförändringar.",
      "Berättelsen kritiserar försvagade skyddsnät, samhällsnormer som främjar isolering, ekonomiska skillnader och det potentiella hotet från AI mot anställningstryggheten, samtidigt som den föreslår lösningar på ungdomars oengagemang."
    ],
    "points": 119,
    "commentCount": 158,
    "retryCount": 0,
    "time": 1716646236
  },
  {
    "id": 40470134,
    "title": "Förstå ACATS: Komplexiteten i överföringar av mäklarkonton",
    "originLink": "https://www.bitsaboutmoney.com/archive/how-acats-transfers-work/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40470134",
    "commentBody": "",
    "originSummary": [
      "Patrick McKenzie diskuterar komplexiteten i att överföra mäklarkonton med hjälp av ACATS (Automated Customer Assets Transfer System) och den roll som självreglerande organisationer som FINRA spelar för att övervaka dessa processer.",
      "FINRA-regel 11870 föreskriver snabba tillgångsöverföringar mellan mäklare, med stöd av ACATS, som standardiserar processen och involverar bakomliggande komplexiteter som kalkylblad och Depository Trust Company (DTC).",
      "Texten belyser frågor som risken för bedrägerier, mäklarpersonalens roll när det gäller att hjälpa till med överföringar och effekterna av dålig kundservice på kunder som söker finansiell rådgivning från opålitliga källor."
    ],
    "commentSummary": [
      "Medallion Signature Guarantee är en säkerhetsåtgärd vid finansiella transaktioner i USA för att verifiera identitet och auktorisera stora överföringar, vilket ger ett extra lager av säkerhet.",
      "Användare diskuterar komplexiteten i traditionella finans- och kryptovalutasystem och betonar behovet av flera betalningsmetoder för att minska risker som bedrägliga avgifter.",
      "Samtalet belyser också de byråkratiska utmaningarna med att hantera privatekonomi och vikten av tredjepartsverifiering i säkra transaktioner."
    ],
    "points": 110,
    "commentCount": 59,
    "retryCount": 0,
    "time": 1716581903
  },
  {
    "id": 40476410,
    "title": "Varför \"värre är bättre\"-filosofin gör tmux till ett pålitligt val för utvecklare",
    "originLink": "https://hiandrewquinn.github.io/til-site/posts/tmux-is-worse-is-better/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40476410",
    "commentBody": "",
    "originSummary": [
      "Artikeln handlar om tmux, en terminalmultiplexerare, som kan användas för att hantera flera skal utan en grafisk miljö, vilket är särskilt användbart för programmerare som använder SSH.",
      "Kovid Goyal, utvecklare av terminalemulatorn Kitty, kritiserar tmux för dess komplexitet och ineffektivitet, men författaren föredrar tmux för dess tillförlitlighet och enkelhet i olika system.",
      "Artikeln avslutas med filosofin \"sämre är bättre\", som betonar vikten av att optimera programvaran för vanliga användningsfall, även om det innebär att man måste acceptera vissa suboptimala aspekter."
    ],
    "commentSummary": [
      "Diskussionen fokuserar på användbarheten och effektiviteten hos terminalmultiplexare som `tmux` och `screen` för att hantera SSH-sessioner och upprätthålla ihållande terminaltillstånd.",
      "Användare diskuterar komplexiteten i `tmux`, dess nyckelbindningar och alternativ som Zellij, Byobu och terminalemulatorer med tmux-integration (t.ex. iTerm2).",
      "Samtalet belyser utmaningarna med att upprätthålla konfigurationer i olika inställningar och att balansera funktionalitet med användarvänlighet i terminalmultiplexers."
    ],
    "points": 97,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1716657630
  },
  {
    "id": 40472161,
    "title": "Bygga ett enkelt och pålitligt jobbsystem i Clojure med core.async",
    "originLink": "https://blog.janetacarr.com/creating-a-dead-simple-asynchronous-job-system-in-clojure/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40472161",
    "commentBody": "",
    "originSummary": [
      "Författaren har utvecklat Scinamalink, ett Clojure-baserat system för att skicka magiska inloggningslänkar via ett enkelt REST API.",
      "Istället för att använda komplexa meddelandemäklare som RabbitMQ implementerade de ett core.async-baserat jobbsystem som använder PostgreSQL för spårning av jobbstatus och en maskin med finit tillstånd för jobbbearbetning.",
      "Systemet betonar enkelhet och tillförlitlighet och utnyttjar core.async för samtidighet och en JSON-blob för flexibel lagring av jobbkontexten, med målet att balansera enkel implementering med praktisk tillförlitlighet."
    ],
    "commentSummary": [
      "Janet Carrs blogginlägg förespråkar ett enkelt core.async-jobbsystem i Clojure, med betoning på minimalism i teknikstackar.",
      "Kommentatorer varnar för komplexiteten och riskerna med att använda flera olika tekniker, särskilt i nystartade företag, och nämner problem som \"för tidig polyglott programmering\" och \"single points of failure\".",
      "Diskussionen belyser fördelarna med core.async för samtidighet i Clojure och föreslår det som ett gynnsamt alternativ till verktyg som RabbitMQ för mindre projekt, med ett samförstånd om att minimera beroenden och komplexitet."
    ],
    "points": 92,
    "commentCount": 15,
    "retryCount": 0,
    "time": 1716603563
  }
]
