[
  {
    "id": 39034160,
    "title": "Používatelia na Stack Exchange špekulujú o pôvode a význame lopty s obrázkom sekery a písmenom \"Y",
    "originLink": "https://english.stackexchange.com/questions/395382/which-word-begins-with-y-and-looks-like-an-axe-in-this-picture",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39034160",
    "commentBody": "",
    "originSummary": [
      "Používatelia na portáli Stack Exchange diskutujú o lopte s obrázkom sekery a písmenom \"Y\" a špekulujú o jej pôvode a význame, pričom sa spomínajú aj možné švédske vplyvy.",
      "V rozhovore sa tiež skúma používanie termínu \"U-boat\" a pokúša sa identifikovať výrobcu lopty.",
      "Diskusia sa zmení na humornú, keď používatelia vymýšľajú slová začínajúce na písmeno Y."
    ],
    "commentSummary": [
      "Článok sa zaoberá diskusiami a špekuláciami o obrázku, ktorý pripomína sekeru a začína na písmeno \"y\".",
      "Uvádzajú sa rôzne teórie vrátane špekulácií o čínskej výrobe, švédskych slovách a chybách v preklade.",
      "Diskusie sa týkajú aj nesúvisiacich tém, ako sú matematické problémy, mémy a humor pri preklade jazyka."
    ],
    "points": 887,
    "commentCount": 208,
    "retryCount": 0,
    "time": 1705528995
  },
  {
    "id": 39036842,
    "title": "Hľadanie sily: Cesta rodiča cez tragédiu a nádej",
    "originLink": "https://www.fortressofdoors.com/i-lost-my-son/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39036842",
    "commentBody": "",
    "originSummary": [
      "Sedemročnému synovi spisovateľky sa zastavilo srdce a utrpel vážne poškodenie mozgu, čo viedlo k neradostnej prognóze.",
      "Napriek výzvam si autorka zachováva nádej a opiera sa o vieru, pričom vyjadruje emocionálny vplyv výsledkov magnetickej rezonancie ich syna.",
      "Syn je v súčasnosti v domácej hospicovej starostlivosti a rodičia sa plne venujú jeho starostlivosti, čo viedlo k tomu, že autorka sa stiahla z projektu vývoja hry.",
      "Finančná podpora je poskytovaná prostredníctvom verejnej zdravotnej pomoci a spisovateľ sa v súčasnosti zaoberá technológiou oceňovania nehnuteľností.",
      "Napriek ťažkostiam, s ktorými sa spisovateľ stretáva, zdôrazňuje, že je dôležité nájsť radosť a silu uprostred zúfalstva, pričom sa zamýšľa nad tragickými príbehmi."
    ],
    "commentSummary": [
      "Rozhovory sa týkajú rôznych tém, napríklad starostlivosti o postihnuté dieťa, traumy z detstva, prekonávania traumy, smútku a straty a tragédií.",
      "Ľudia v rozhovoroch poskytujú podporu a empatiu tým, ktorí sa delia o svoje skúsenosti, zatiaľ čo iní diskutujú o rôznych prístupoch k liečbe a zvládaniu traumy a smútku.",
      "Diskutuje sa aj o zložitosti a výzvach spojených s vyrovnávaním sa so stratou a traumou, ako aj o nezhodách a rôznych pohľadoch na niektoré témy."
    ],
    "points": 884,
    "commentCount": 126,
    "retryCount": 0,
    "time": 1705545264
  },
  {
    "id": 39029801,
    "title": "AlphaGeometry: Systém umelej inteligencie rieši geometrické úlohy na úrovni olympiády a zlepšuje uvažovanie pre umelú inteligenciu novej generácie",
    "originLink": "https://deepmind.google/discover/blog/alphageometry-an-olympiad-level-ai-system-for-geometry/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39029801",
    "commentBody": "",
    "originSummary": [
      "AlphaGeometry je systém umelej inteligencie vytvorený spoločnosťou Google DeepMind a Newyorskou univerzitou, ktorý rieši zložité geometrické problémy.",
      "Kombinuje model neurónového jazyka a motor symbolickej dedukcie na zdôvodňovanie geometrických tvrdení.",
      "AlphaGeometry prekonáva predchádzajúce systémy umelej inteligencie a v riešení geometrických úloh na úrovni olympiád sa približuje úrovni ľudských zlatých medailistov.",
      "Systém bol vycvičený pomocou 100 miliónov príkladov syntetických údajov vytvorených v procese budovania znalostí.",
      "Riešenia AlphaGeometry sú overiteľné, čisté a čitateľné pre človeka.",
      "Cieľom projektu je pokročiť v zdôvodňovaní systémov umelej inteligencie novej generácie a prispieť k rozvoju všeobecnej umelej inteligencie.",
      "Kód a model AlphaGeometry sú otvorené."
    ],
    "commentSummary": [
      "Spoločnosť DeepMind vyvinula AlphaGeometry, systém umelej inteligencie, ktorý exceluje v riešení geometrických úloh na úrovni olympiády.",
      "AlphaGeometry používa na hľadanie riešení výpočty hrubou silou a ďalšie geometrické konštrukcie.",
      "Uvoľnenie kódu a váh pre ich model spoločnosťou DeepMind umožňuje ďalšie skúmanie a používanie technológie umelej inteligencie pri riešení matematických problémov.",
      "Systémy umelej inteligencie, ako je AlphaGeometry, majú potenciál napredovať v oblastiach, ako je veda a matematika, ale vo výskumných prácach existujú obmedzenia a nezrovnalosti, ktoré je potrebné riešiť.",
      "Kombinácia neurónových sietí s tradičnými matematickými systémami je sľubnou cestou ďalšieho rozvoja v tejto oblasti."
    ],
    "points": 463,
    "commentCount": 150,
    "retryCount": 0,
    "time": 1705508537
  },
  {
    "id": 39028672,
    "title": "Apple využíva Cassandru a FoundationDB na vytvorenie iCloudu na ukladanie miliárd databáz",
    "originLink": "https://read.engineerscodex.com/p/how-apple-built-icloud-to-store-billions",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39028672",
    "commentBody": "",
    "originSummary": [
      "Spoločnosť Apple vyvinula iCloud s využitím technológií ako Cassandra a FoundationDB na ukladanie miliárd databáz a zlepšenie funkcií používateľov prostredníctvom asynchrónneho spracovania a bezstavovej architektúry.",
      "Článok zdôrazňuje význam budovania abstrakcií a pochopenia potrieb používateľov pri návrhu infraštruktúry.",
      "Spoločnosť Apple čelila problémom so škálovateľnosťou systému Cassandra a obrátila sa na FoundationDB, ktorá poskytuje výkonné abstrakcie prostredníctvom vrstvy záznamov FoundationDB pre aplikácie. CloudKit, cloudová služba spoločnosti Apple, využíva bezstavovú architektúru a abstrakciu úložiska záznamov pre jednoduchú škálovateľnosť.",
      "FoundationDB pomáha riešiť výzvy, ako je personalizované fulltextové vyhľadávanie a zóny s vysokou frekvenciou, zatiaľ čo vrstva záznamov zlepšuje latenciu a riadi konflikty transakcií."
    ],
    "commentSummary": [
      "V zhrnutí sa skúmajú podobnosti a rozdiely medzi databázami a súborovými systémami a rozoberajú sa problémy spojené s používaním databáz na ukladanie súborov.",
      "Predstavuje koncept relačného súborového systému a upozorňuje na problémy s funkciou synchronizácie súborov iCloud.",
      "Zhrnutie sa týka rôznych aspektov možností ukladania, úspor z rozsahu pri ukladaní údajov a obmedzení súčasných implementácií ukladania."
    ],
    "points": 459,
    "commentCount": 177,
    "retryCount": 0,
    "time": 1705503944
  },
  {
    "id": 39030302,
    "title": "Hacker získal prístup k citlivým údajom zákazníkov prostredníctvom kalkulačky poistného poisťovne.",
    "originLink": "https://eaton-works.com/2024/01/17/ttibi-email-hack/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39030302",
    "commentBody": "",
    "originSummary": [
      "Výskumník sa úspešne nabúral do webovej stránky kalkulačky poistného spoločnosti Eicher Motors, ktorá je umiestnená na subdoméne spoločnosti Toyota Tsusho Insurance Broker India (TTIBI).",
      "Využitím zraniteľnosti v rozhraní API webovej stránky na odosielanie e-mailov získal výskumník prístup k e-mailovému účtu spoločnosti Microsoft, ktorý obsahoval 657 tisíc e-mailov vrátane informácií o zákazníkoch, súborov PDF s poistnými zmluvami, odkazov na resetovanie hesiel a OTP.",
      "Napriek upozorneniu TTIBI nezmenila heslo e-mailového konta a výskumník nedostal odmenu za nahlásenie problému CERT-In."
    ],
    "commentSummary": [
      "Zbierka diskusií sa týka rôznych bezpečnostných incidentov, zraniteľností a chýb v IT systémoch.",
      "Medzi témy patria kultúrne problémy v indických IT firmách, zlé postupy pri ukladaní údajov v autosalóne, zraniteľnosť e-mailového systému, úniky údajov a nedostatočné bezpečnostné opatrenia v spoločnostiach, nekompetentnosť jednotlivcov na pozíciách v IT, chyby v kryptografii, zodpovednosť spoločností za predchádzanie únikom a odmeny za chyby.",
      "Vyjadrujú sa obavy o účinnosť bezpečnostných opatrení, nedostatočnú reakciu alebo právne sankcie a úlohu jednotlivcov pri odhaľovaní zraniteľností a ich nahlasovaní."
    ],
    "points": 415,
    "commentCount": 90,
    "retryCount": 0,
    "time": 1705510649
  },
  {
    "id": 39030991,
    "title": "John Lasseter: Od režiséra filmu \"Toy Story\" po návrhára loga BSD Daemon",
    "originLink": "https://www.jacobelder.com/2024/01/17/director-of-toy-story-also-drew-bsd-daemon.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39030991",
    "commentBody": "",
    "originSummary": [
      "Režisér filmu Toy Story John Lassetter navrhol logo BSD Daemon a na blšom trhu MIT objavil sadu príručiek 4.3 BSD.",
      "Príručky s ikonickým maskotom Beastie Daemon s trojzubcom navrhol sám Lassetter pred svojou prácou v Pixare.",
      "Knihy boli vydané v apríli 1986, čo naznačuje, že Lassetterova spolupráca so spoločnosťou Pixar sa začala už vtedy."
    ],
    "commentSummary": [
      "Text sa zaoberá celým radom tém vrátane vytvorenia loga démona BSD Johnom Lasseterom, skúseností s OpenBSD ako operačným systémom a umeleckých diel súvisiacich s OpenBSD a maskotom Go(lang).",
      "Skúma prepojenia medzi vedúcimi predstaviteľmi priemyslu v rámci technologickej revolúcie a prípady prechodu myšlienkových lídrov do rôznych odvetví.",
      "Diskutuje sa aj o kontroverziách okolo osobností ako Steve Jobs, Bill Gates a John Lasseter vrátane obvinení zo sexuálneho obťažovania voči Johnovi Lasseterovi."
    ],
    "points": 407,
    "commentCount": 88,
    "retryCount": 0,
    "time": 1705513787
  },
  {
    "id": 39026791,
    "title": "Vŕba: Bezpečný a efektívny protokol na ukladanie dát typu \"peer-to-peer",
    "originLink": "https://willowprotocol.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39026791",
    "commentBody": "",
    "originSummary": [
      "Willow je protokol na ukladanie dát typu peer-to-peer, ktorý poskytuje jemné oprávnenia, súkromie, deštruktívne úpravy a nízku šírku pásma a spotrebu pamäte.",
      "Ponúka vždy dostupné úložisko, šifrovanie end-to-end, úplné vymazanie údajov a presnú kontrolu prístupu.",
      "Willow podporuje čiastočnú synchronizáciu, deštruktívne úpravy a súbežný zápis z viacerých zariadení."
    ],
    "commentSummary": [
      "Protokol Willow je univerzálny protokol, ktorý umožňuje používateľom prispôsobiť si identifikátory menného priestoru, pričom diskusie sa zameriavajú na kompatibilitu protokolov, šifrovanie, peer-to-peer siete a vymazávanie údajov.",
      "Účastníci vyjadrujú zmätok a skepsu v súvislosti s Willow, pričom spomínajú aj alternatívne protokoly a technológie.",
      "Earthstar, implementácia Willow, sa stretáva s nadšením aj skepticizmom a diskusie sa týkajú aj škálovateľnosti a kompatibility protokolu. Okrem toho bol Iroh vydaný pre rôzne operačné systémy."
    ],
    "points": 404,
    "commentCount": 103,
    "retryCount": 0,
    "time": 1705494470
  },
  {
    "id": 39034277,
    "title": "Úvahy o odchode zo spoločnosti Google: Osobný príbeh vyrovnávania sa s prepúšťaním a zmenou kultúry",
    "originLink": "https://social.clawhammer.net/blog/posts/2024-01-10-GoogleExitLetter/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39034277",
    "commentBody": "",
    "originSummary": [
      "Autor a mnohí ďalší boli prepustení zo spoločnosti Google v rámci nedávneho kola prepúšťania v rámci úsporných opatrení.",
      "Prepúšťanie bolo neosobné a pravdepodobne bolo výsledkom všeobecných úsporných opatrení.",
      "Autor sa so situáciou vyrovnáva dobre, pripravil sa na prepúšťanie a plánuje si vziať dovolenku, kým sa podelí o svoje kariérne skúsenosti v spoločnosti Google a o to, ako sa kultúra v budúcnosti vyvinula."
    ],
    "commentSummary": [
      "V súhrne sa skúmajú rôzne aspekty spoločnosti Google vrátane zmien v jej firemnej kultúre, kritiky vedenia, akvizícií, inovácií, prepúšťania, obáv o ochranu osobných údajov a vnímania technologického priemyslu.",
      "V diskusii zaznievajú rôzne názory a skúsenosti, ktoré osvetľujú pozitívne aj negatívne aspekty práce v spoločnosti Google.",
      "Dotýka sa aj širších tém, ako je etika, ziskovosť a budúcnosť technologického priemyslu."
    ],
    "points": 395,
    "commentCount": 254,
    "retryCount": 0,
    "time": 1705529533
  },
  {
    "id": 39034951,
    "title": "Kontroverzná 27% daň spoločnosti Apple obmedzuje konkurenciu pri nákupe cez web",
    "originLink": "https://twitter.com/TimSweeneyEpic/status/1747408148799881390",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39034951",
    "commentBody": "",
    "originSummary": [
      "Spoločnosť Apple zaviedla 27 % daň na nákupy cez internet, čo bráni cenovej konkurencii a vyvoláva obavy z protisúťažného správania.",
      "Vývojári musia teraz účtovať rovnakú cenu za digitálne položky na webe ako v App Store, a to aj napriek vzniknutej dani.",
      "Tento krok spoločnosti Apple bol kritizovaný za potláčanie hospodárskej súťaže a obmedzovanie výberu pre spotrebiteľov."
    ],
    "commentSummary": [
      "Spoločnosť Apple teraz povoľuje americkým vývojárom ponúkať nákupy mimo App Store, ale po rozhodnutí súdu, ktorý povolil alternatívne možnosti platieb, stále vyžaduje, aby vývojári sprístupnili nákupy v aplikáciách Apple.",
      "Existujú obavy týkajúce sa potenciálnych nákladov a nerovnomerného presadzovania týchto nových pravidiel, ako aj zodpovednosti spoločnosti Apple za nákupy v aplikáciách a súdne spory týkajúce sa neoprávnených nákupov.",
      "Diskutuje sa o prebiehajúcom súdnom spore medzi spoločnosťami Apple a Epic Games vrátane rôznych pohľadov na ich správanie a motiváciu. Rozhovor sa dotýka významu hospodárskej súťaže, obáv o dostupnosť aplikácií a vplyvu poplatkov spoločnosti Apple na vývojárov."
    ],
    "points": 375,
    "commentCount": 293,
    "retryCount": 0,
    "time": 1705533179
  },
  {
    "id": 39027154,
    "title": "Prečo mám rád Obsidian: Zlepšenie tvorby poznámok a produktivity",
    "originLink": "https://www.ddanieltan.com/posts/obsidian/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39027154",
    "commentBody": "",
    "originSummary": [
      "Nástroj na zaznamenávanie poznámok Obsidian ponúka používateľom pozitívne a jedinečné skúsenosti.",
      "Obsidian umožňuje organický rast štruktúry poznámok, čím zvyšuje ich organizáciu a flexibilitu.",
      "Možnosť prepojenia atómových myšlienok v programe Obsidian podporuje lepšie porozumenie a prepojenie medzi pojmami.",
      "Používanie textových súborov v systéme Obsidian zaručuje budúcnosť a ľahkú dostupnosť."
    ],
    "commentSummary": [
      "Používatelia sa zapájajú do diskusie o funkciách a obmedzeniach aplikácie Obsidian na zaznamenávanie poznámok.",
      "Ako potenciálne alternatívy k Obsidianu sa uvádzajú iné systémy na písanie poznámok, ako napríklad OneNote, Zettelkasten a alternatívne aplikácie, ako napríklad Logseq, Trilium a Dendron.",
      "Rozhovor sa týka tém, ako sú problémy so synchronizáciou a kompatibilitou, výhody a nevýhody Obsidianu v porovnaní s inými nástrojmi, formáty súborov, zásuvné moduly a potreba flexibilného pohybu údajov."
    ],
    "points": 267,
    "commentCount": 326,
    "retryCount": 0,
    "time": 1705497087
  },
  {
    "id": 39034421,
    "title": "Čitatelia Hacker News' Top Books of 2023 Revealed by HN Reads",
    "originLink": "https://hnreads.com/post/top40_2023/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39034421",
    "commentBody": "",
    "originSummary": [
      "HN Reads je nová webová stránka, ktorá analyzuje údaje z Hacker News a vytvára zoznam 40 najlepších kníh odporúčaných v roku 2023.",
      "Zoznam obsahuje populárne tituly ako \"Štruktúra a interpretácia počítačových programov\" a \"Gödel, Escher, Bach\".",
      "Kontroverzné osobnosti ako Elon Musk a Ayn Randová sa do prvej štyridsiatky nedostali, ale v zozname \"takmer\" sú knihy, ktoré sa spomínajú 5 alebo 6-krát.",
      "Webová stránka obsahuje partnerské odkazy na uvedené knihy od spoločnosti Amazon."
    ],
    "commentSummary": [
      "Portál Hacker News zostavil zoznam najlepších kníh na rok 2023 na základe návrhov používateľov, čo vyvolalo diskusiu o zaujatosti používateľov.",
      "Používatelia odporúčajú a diskutujú o odborných knihách, ako je napríklad \"Crafting Interpreters\", a zapájajú sa do diskusií o rôznych žánroch, prístupnosti a cenovej frustrácii.",
      "Rozhovor sa zväčša sústreďuje na knihy o úspechu, vodcovstve a osobnom rozvoji, pričom niektorí vyjadrujú cynizmus voči týmto typom zoznamov."
    ],
    "points": 256,
    "commentCount": 78,
    "retryCount": 0,
    "time": 1705530229
  },
  {
    "id": 39026855,
    "title": "Projekt Rust bojuje s vyhorením: Riešenie tohto cyklu a hľadanie riešení",
    "originLink": "https://jyn.dev/2024/01/16/the-rust-project-has-a-burnout-problem.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39026855",
    "commentBody": "",
    "originSummary": [
      "Projekt Rust čelí významnému problému s vyhorením svojich členov, čo má za následok odchod mnohých jednotlivcov a ďalších, ktorí sa blížia k bodu vyhorenia.",
      "Cyklus vyhorenia sa pripisuje jednotlivcom, ktorí sa cítia byť nútení napredovať a preberajú na seba nadmerné pracovné zaťaženie.",
      "Medzi návrhy na boj proti vyhoreniu patrí považovať prácu na projekte za prácu, vyhýbať sa nadmerným nadčasom a dobrovoľníckej práci a poskytovať dokumentáciu o riešení problému vyhorenia.",
      "Vedúcich tímov vyzývame, aby striedali zodpovednosti, riešili nadmernú kontrolu práce a uprednostňovali vytváranie zdravého prostredia pred technickými záležitosťami.",
      "Autor uznáva, že riešenie problému vyhorenia si vyžaduje kultúrne, organizačné a zdrojové zmeny v rámci projektu Rust."
    ],
    "commentSummary": [
      "Projekt Rust čelí problému vyhorenia svojich prispievateľov, ktoré je spôsobené faktormi, ako je nadmerné pracovné zaťaženie a oprávnené pripomienky používateľov.",
      "Diskutuje sa aj o obmedzeniach platforiem, ako je GitHub, pri budovaní komunity, pričom sa zdôrazňuje vplyv angažovanosti na GitHub a Microsoft, ako aj obavy zo zmien platformy a nespokojnosti používateľov.",
      "Navrhujú sa stratégie na riešenie vyhorenia a zvýšenie angažovanosti komunity, ako aj diskusie o výzvach spojených s udržiavaním projektov s otvoreným zdrojovým kódom a klesajúcou popularitou niektorých programovacích jazykov."
    ],
    "points": 224,
    "commentCount": 225,
    "retryCount": 0,
    "time": 1705494889
  },
  {
    "id": 39036796,
    "title": "WhisperSpeech: open-source systém na prevod textu na reč založený na technológii Whisper",
    "originLink": "https://github.com/collabora/WhisperSpeech",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39036796",
    "commentBody": "",
    "originSummary": [
      "WhisperSpeech je open-source systém na prevod textu na reč postavený na výkonnom modeli Whisper, ktorý sa snaží byť prispôsobiteľný a podobný stabilnému systému Diffusion.",
      "Súčasné modely sú vyškolené na anglickom súbore údajov LibreLight, pričom budúce verzie sa zameriavajú na viacero jazykov.",
      "Projekt sponzorujú spoločnosti Collabora a LAION a tím je k dispozícii na konzultácie v oblasti open-source a proprietárnych projektov umelej inteligencie."
    ],
    "commentSummary": [
      "Diskusia sa zameriava na rôzne nástroje a zdroje na prevod textu na reč (TTS) vrátane WhisperSpeech, EmotiVoice a Mimic 3 s dôrazom na syntézu reči v mandarínskej čínštine.",
      "TTS od spoločnosti OpenAI sa odporúča pre svoju kvalitu a cenovú dostupnosť a porovnávajú sa s generátormi TTS, ktoré používajú spoločnosti chatGPT, Eleven Labs a Azure.",
      "Používatelia sa podelia o svoje skúsenosti a výzvy pri používaní modelov umelej inteligencie v rôznych aplikáciách a zároveň diskutujú o ťažkostiach spojených s výrobou novej technológie. Vysvetľuje sa aj koncept exponenciálneho rastu modelov ML, ktorý vyvoláva ďalší záujem a otázky."
    ],
    "points": 212,
    "commentCount": 39,
    "retryCount": 0,
    "time": 1705544998
  },
  {
    "id": 39027543,
    "title": "Predstavujeme HtmlDocs: Vytvárajte krásne PDF súbory pomocou HTML/CSS",
    "originLink": "https://htmldocs.com",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39027543",
    "commentBody": "",
    "originSummary": [
      "HtmlDocs je editor, ktorý používa HTML/CSS na vytváranie dobre formátovaných súborov PDF, ako sú faktúry a životopisy.",
      "Má šablónovací engine a vykresľovací kanál Chromium na generovanie súborov PDF.",
      "HtmlDocs sa odlišuje tým, že podporuje moderné funkcie CSS a minimalizuje rozdiely medzi dokumentom HTML a PDF."
    ],
    "commentSummary": [
      "Používatelia vyjadrujú frustráciu zo zastaraných a obmedzených nástrojov, ako je wkhtmltopdf, na konverziu dokumentov HTML/CSS do formátu PDF.",
      "Ako lepšie možnosti sa navrhujú alternatívy ako Typst, Paged.js a WeasyPrint.",
      "Vedie sa diskusia o tom, či CSS môže efektívne nahradiť LaTeX pri sadzbe a tvorbe vedeckých publikácií."
    ],
    "points": 209,
    "commentCount": 83,
    "retryCount": 0,
    "time": 1705499041
  }
]
