[
  {
    "id": 41629475,
    "title": "В 1870 году лорд Рэлей использовал масло и воду для расчета размера молекул",
    "originLink": "https://www.atomsonly.news/p/franklin-oil",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41629475",
    "commentBody": "",
    "originSummary": [
      "Лорд Рэлей оценил размер одной молекулы, используя простой эксперимент с маслом, водой и ручкой, вдохновленный наблюдениями Бенджамина Франклина из 1770-х годов.",
      "Расчёт длины молекулы масла, выполненный Рэлейем (1,63 нанометра), был удивительно близок к современным измерениям (1,67 нанометра), что демонстрирует силу базовых научных методов.",
      "«Этот исторический эксперимент подчеркивает, как простые методы могут привести к значительным научным открытиям, как подробно описано в книге Чарльза Тэнфорда \"Бен Франклин успокоил волны\".»"
    ],
    "commentSummary": [
      "В 1870 году лорд Рэлей оценил размер молекул, распространяя масло по воде и вычисляя толщину пленки, предполагая, что она образует один молекулярный слой.",
      "Этот метод был вдохновлен более ранними наблюдениями Бенджамина Франклина.",
      "Исторические научные достижения, такие как оценка скорости света Ремером в 1676 году и эксперимент Милликана с масляными каплями для измерения заряда электрона, демонстрируют, как простые наблюдения могут привести к значительным научным открытиям."
    ],
    "points": 516,
    "commentCount": 176,
    "retryCount": 0,
    "time": 1727118494
  },
  {
    "id": 41636804,
    "title": "Исходный код проигрывателя Winamp Legacy",
    "originLink": "https://github.com/WinampDesktop/winamp",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41636804",
    "commentBody": "",
    "originSummary": [
      "Winamp, мультимедийный плеер, запущенный в 1997 году, теперь является открытым исходным кодом, что позволяет сообществу модернизировать его код.",
      "Для сборки настольного клиента Winamp требуется Visual Studio 2019 и Intel IPP v6.1.1.035, с двумя основными вариантами сборки: с использованием скрипта или в среде разработки Visual Studio IDE.",
      "Зависимости включают libvpx, libmpg123, OpenSSL, DirectX 9 SDK, исправление библиотеки Microsoft ATLMFC и Intel IPP, каждая из которых требует определенных модификаций и шагов по распаковке."
    ],
    "commentSummary": [
      "Исходный код проигрывателя Winamp Legacy был опубликован на GitHub с ограничениями, включая запрет на распространение модифицированных версий, запрет на форк и разрешение на распространение модификаций только официальным сопровождающим.",
      "Эти ограничения противоречат Условиям использования GitHub, которые разрешают форкать публичные репозитории, что приводит к спорам о толковании термина «форкать».",
      "Релиз считается «доступным исходным кодом», а не по-настоящему открытым исходным кодом, что вызывает смешанные реакции в техническом сообществе."
    ],
    "points": 453,
    "commentCount": 204,
    "retryCount": 0,
    "time": 1727188029
  },
  {
    "id": 41630913,
    "title": "Мы донастроили Llama 405B на графических процессорах AMD",
    "originLink": "https://publish.obsidian.md/felafax/pages/Tune+Llama3+405B+on+AMD+MI300x+(our+journey)",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41630913",
    "commentBody": "",
    "originSummary": [
      "Стартап настроил модель LLaMA3.1 405B на 8xAMD MI300x GPU, используя JAX вместо PyTorch, достигнув значительных улучшений в производительности.",
      "Они открыли исходный код и поделились техниками шардирования, подчеркнув способность JAX компилировать код моделей машинного обучения в аппаратно-независимые графы HLO, оптимизированные компилятором XLA.",
      "Этот подход позволяет бесшовное выполнение одного и того же кода как на Google TPU, так и на AMD GPU, решая проблемы, с которыми сталкиваются компании из-за глубоких связей PyTorch с экосистемой NVIDIA."
    ],
    "commentSummary": [
      "«Стартап успешно настроил Llama 405B на графических процессорах AMD с использованием JAX вместо более распространенного PyTorch, используя передовые API шардирования JAX для улучшения производительности.»",
      "«Аппаратно-независимые графы HLO JAX, оптимизированные компилятором XLA, позволили одному и тому же коду выполняться как на Google TPU, так и на AMD GPU без изменений, решая общую проблему глубокой интеграции PyTorch с оборудованием NVIDIA.»",
      "Стартап открыл исходный код и ищет отзывы о своем подходе и видении инфраструктуры ИИ на оборудовании, не относящемся к NVIDIA."
    ],
    "points": 434,
    "commentCount": 85,
    "retryCount": 0,
    "time": 1727127746
  },
  {
    "id": 41635592,
    "title": "OpenFreeMap – хостинг карт с открытым исходным кодом",
    "originLink": "https://openfreemap.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41635592",
    "commentBody": "",
    "originSummary": [
      "После 9 лет разработки создатель MapHub сделал исходный код своего сервера тайлов OpenStreetMap открытым, теперь он называется OpenFreeMap.",
      "OpenFreeMap позволяет пользователям самостоятельно размещать или использовать публичный экземпляр, при этом все компоненты полностью с открытым исходным кодом и без модели 'open-core'.",
      "Проект предлагает еженедельные полные загрузки планеты в форматах Btrfs и MBTiles и стремится покрыть расходы на публичные экземпляры за счет пожертвований."
    ],
    "commentSummary": [
      "OpenFreeMap — это сервис хостинга карт с открытым исходным кодом, запущенный hyperknot после 9 лет работы сервера тайлов OpenStreetMap для MapHub.",
      "Пользователи могут самостоятельно размещать или использовать публичный экземпляр, при этом все компоненты являются открытым исходным кодом, а данные карт получены из OpenStreetMap.",
      "Еженедельные полные загрузки планеты доступны в форматах Btrfs и MBTiles, и проект стремится покрыть расходы на публичные экземпляры за счет пожертвований."
    ],
    "points": 425,
    "commentCount": 122,
    "retryCount": 0,
    "time": 1727179162
  },
  {
    "id": 41631130,
    "title": "Расширение хранилища iPhone 16 Pro с 128 ГБ до 1 ТБ [видео]",
    "originLink": "https://www.youtube.com/watch?v=KRRNR4HyYaw",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41631130",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "iPhone 16 Pro теперь предлагает расширение памяти от 128 ГБ до 1 ТБ, что вызывает интерес у техноэнтузиастов и моддеров.",
      "Видео демонстрирует технические навыки, необходимые для замены чипа NAND, подчеркивая точность и стабильность, требуемые для таких модификаций.",
      "Обсуждения касаются того, могут ли использование более высококачественных NAND-чипов улучшить производительность и долговечность, а также эстетическое и дизайнерское качество аппаратного обеспечения Apple."
    ],
    "points": 372,
    "commentCount": 257,
    "retryCount": 0,
    "time": 1727129516
  },
  {
    "id": 41631912,
    "title": "WP Engine отправила письмо с требованием прекратить и воздержаться компании Automattic",
    "originLink": "https://twitter.com/wpengine/status/1838350670564377051",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41631912",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "WP Engine направила письмо с требованием прекратить и воздержаться компании Automattic, обвинив генерального директора Мэтта Мулленвега в клевете и вымогательстве из-за заявлений, сделанных в его программной речи.",
      "Малленвег якобы заявил, что WP Engine эксплуатирует экосистему WordPress и неправомерно использует товарный знак \"WP\", требуя $40 миллионов, чтобы избежать дальнейшей негативной огласки.",
      "Инцидент подчеркивает продолжающееся напряжение в отношении вкладов в разработку WordPress и использования товарного знака, разделяя мнения сообщества о практике обеих сторон."
    ],
    "points": 252,
    "commentCount": 180,
    "retryCount": 0,
    "time": 1727137318
  },
  {
    "id": 41635583,
    "title": "Двигайся быстро и бросай вещи",
    "originLink": "https://engineersneedart.com/blog/movefast/movefast.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41635583",
    "commentBody": "",
    "originSummary": [
      "Разработчик выпустил коллекцию старых shareware-игр и незавершенных проектов с ранней эпохи Macintosh на GitHub под названием Soft Dorothy Software.",
      "«Образы дисков можно использовать с эмуляторами Mac на базе 68K или PPC, такими как Basilisk II, Sheepshaver или MiniVMac, что позволяет пользователям исследовать эти ностальгические элементы истории программного обеспечения.»",
      "Этот релиз предлагает уникальный взгляд на процесс разработки игр прошлого, демонстрируя как завершенные, так и заброшенные проекты, и подчеркивая итеративную природу дизайна игр."
    ],
    "commentSummary": [
      "Статья «Двигайся быстро и отказывайся от вещей» подчеркивает важность быстрого прототипирования и отказа от бесперспективных проектов для стимулирования инноваций.",
      "Автор предполагает, что всеобщий базовый доход (ВБД) может позволить большему числу людей заниматься творческой деятельностью без финансовых ограничений, что вызвало дискуссию среди комментаторов о его влиянии на психическое здоровье и креативность.",
      "Обсуждение также подчеркивает баланс между завершением проектов и преимуществами сосредоточения на меньших, управляемых задачах, чтобы избежать ловушек слишком поспешного отказа от проектов."
    ],
    "points": 222,
    "commentCount": 65,
    "retryCount": 0,
    "time": 1727179082
  },
  {
    "id": 41633155,
    "title": "Maker Pipe – Структурные трубные фитинги для самодельщиков",
    "originLink": "https://makerpipe.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41633155",
    "commentBody": "",
    "originSummary": [
      "Maker Pipe предлагает систему стальных соединителей труб, предназначенную для превращения электромонтажных труб (EMT Conduit) в доступную и универсальную строительную платформу, для сборки которой требуются только простые ручные инструменты.",
      "Соединители изготовлены из прочной стали, что обеспечивает прочность и надежность для различных проектов своими руками, от мебели до индивидуальных стеллажей.",
      "Отзывы клиентов подчеркивают простоту использования продукта, его доступность и адаптируемость для широкого спектра творческих и практических применений."
    ],
    "commentSummary": [
      "Maker Pipe предлагает структурные трубные фитинги для самодельщиков, делая акцент на их Make Pipe Minis для прототипирования, которые можно напечатать на 3D-принтере, используя загружаемые STL-файлы.",
      "Пользователи сравнивают Maker Pipe с другими системами, такими как 80/20 и Kee Klamp, обсуждают их плюсы и минусы, а также предлагают альтернативы, такие как трубопровод EMT, черная труба, unistrut или экструдированный алюминий для более прочных проектов.",
      "Обсуждение включает в себя практичность, доступность и качество материалов и фурнитуры для различных проектов «сделай сам»."
    ],
    "points": 193,
    "commentCount": 104,
    "retryCount": 0,
    "time": 1727153010
  },
  {
    "id": 41632460,
    "title": "Выброшенная апельсиновая кожура превратила бесплодное пастбище (2017)",
    "originLink": "https://www.sciencealert.com/how-12-000-tonnes-of-dumped-orange-peel-produced-something-nobody-imagined",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41632460",
    "commentBody": "",
    "originSummary": [
      "В середине 1990-х годов проект по охране природы в Коста-Рике использовал 12 000 тонн отходов апельсиновой кожуры, чтобы превратить бесплодное пастбище в пышный лес.",
      "Проект, возглавляемый исследователями из Принстона, был приостановлен из-за судебного иска, но вновь обнаружен в 2013 году, что позволило выявить густые джунгли с более плодородной почвой и разнообразными видами деревьев.",
      "Успех этого проекта, опубликованного в журнале Restoration Ecology, предполагает потенциал для аналогичных усилий по сохранению, хотя точные механизмы остаются неясными."
    ],
    "commentSummary": [
      "В 2017 году 12 000 метрических тонн апельсиновых корок были выброшены на деградированные земли в Коста-Рике, что привело к судебному иску и решению Верховного суда против проекта.",
      "«Через 15 лет исследования показали, что земля превратилась в пышную, биоразнообразную территорию, вызвав дебаты о этике и законности использования органических отходов для восстановления окружающей среды.»",
      "Дело подчеркнуло потенциальные преимущества органических отходов в восстановлении экосистем, несмотря на первоначальные юридические и корпоративные препятствия."
    ],
    "points": 190,
    "commentCount": 130,
    "retryCount": 0,
    "time": 1727143546
  },
  {
    "id": 41633400,
    "title": "Колокация: Хостинг без клоунов",
    "originLink": "http://rachelbythebay.com/w/2024/09/23/colo/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41633400",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Обсуждение касается услуг колокации (colo), которые предполагают размещение серверов в стороннем дата-центре, а не дома.",
      "Пользователи делятся различными вариантами colo и предложениями, включая скидки и личный опыт с разными провайдерами.",
      "Разговор подчеркивает плюсы и минусы колокации по сравнению с домашним хостингом, такие как надежность, стоимость и технические проблемы, такие как CGNAT (Carrier-Grade Network Address Translation)."
    ],
    "points": 170,
    "commentCount": 165,
    "retryCount": 0,
    "time": 1727156367
  },
  {
    "id": 41629620,
    "title": "Telegram теперь будет передавать номера телефонов и IP-адреса подозреваемых в преступлениях",
    "originLink": "https://www.theverge.com/2024/9/23/24252276/telegram-disclose-user-data-legal-requests-criminal-activity",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41629620",
    "commentBody": "",
    "originSummary": [
      "Теперь Telegram будет передавать номер телефона и IP-адрес пользователя властям, если они являются подозреваемыми в преступлении, согласно обновленной политике конфиденциальности.",
      "Это изменение политики последовало за арестом генерального директора Telegram Павла Дурова, которому было предъявлено обвинение в содействии незаконной деятельности на платформе.",
      "Telegram будет включать эти раскрытия в свои ежеквартальные отчеты о прозрачности и использовать ИИ для удаления проблемного контента, наряду с изменениями в своих политиках модерации."
    ],
    "commentSummary": [
      "Теперь Telegram будет передавать номера телефонов и IP-адреса подозреваемых в преступлениях властям, соблюдая законные ордера.",
      "В отличие от Signal, который собирает минимальные данные о пользователях, отсутствие у Telegram шифрования по умолчанию делает его более уязвимым для запросов данных.",
      "Это решение вызывает продолжающиеся дебаты о проблемах конфиденциальности и последствиях соблюдения требований в различных международных юрисдикциях."
    ],
    "points": 163,
    "commentCount": 121,
    "retryCount": 0,
    "time": 1727119715
  },
  {
    "id": 41632719,
    "title": "Трейси: профилировщик кадров с разрешением в наносекунды в реальном времени",
    "originLink": "https://github.com/wolfpld/tracy",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41632719",
    "commentBody": "",
    "originSummary": [
      "Tracy Profiler — это высокоточный, работающий в реальном времени профайлер, предназначенный для игр и других приложений, поддерживающий профилирование как ЦП, так и ГП в различных языках программирования и графических API.",
      "Он предлагает обширные функции, включая отслеживание распределения памяти, профилирование блокировок, мониторинг переключения контекста и автоматическое присвоение скриншотов кадрам.",
      "Возможности и обновления инструмента демонстрируются в различных выпусках и презентациях, включая CppCon 2023, с доступной подробной документацией и бинарными файлами для Windows x64."
    ],
    "commentSummary": [
      "Tracy — это бесплатный профилировщик кадров в реальном времени с разрешением в наносекунды, доступный на GitHub, который получил высокую оценку за свои обширные функции и производительность.",
      "«В отличие от автоматических профилировщиков выборки, Tracy требует добавления макросов в кодовую базу, при этом каждый макрос добавляет около 50 наносекунд накладных расходов.»",
      "Пользователи ценят подробное окно статистики Tracy и часто комбинируют его с другими профилировщиками для всестороннего анализа, несмотря на некоторые трудности с настройкой и проблемы с приложениями для GPU."
    ],
    "points": 152,
    "commentCount": 26,
    "retryCount": 0,
    "time": 1727146667
  },
  {
    "id": 41636038,
    "title": "«Halide отклонен из App Store, потому что не объясняет, зачем делает фотографии»",
    "originLink": "https://9to5mac.com/2024/09/24/halide-rejected-from-the-app-store-because-it-doesnt-explain-why-the-camera-takes-photos/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41636038",
    "commentBody": "",
    "originSummary": [
      "Улучшения макрофотографии в iPhone 16 могут быть связаны больше с программными улучшениями, чем с изменениями в аппаратной части.",
      "Это предполагает, что Apple сосредотачивается на программных алгоритмах для улучшения качества фотографий, возможно, предлагая лучшие макроснимки без необходимости значительных обновлений оборудования.",
      "Акцент на программное обеспечение может означать, что существующие модели iPhone также могут получить аналогичные улучшения через обновления программного обеспечения."
    ],
    "commentSummary": [
      "Halide, популярное приложение для камеры, было отклонено из App Store за то, что не объяснило, почему оно делает фотографии, что подчеркивает распространенную проблему, с которой сталкиваются разработчики при проверке приложений в магазине.",
      "Разработчики испытывали аналогичные разочарования с Play Store, включая отклонения из-за несуществующих проблем и необходимость добавления политик защиты данных для получения одобрения.",
      "«Ситуация подчеркивает сложности и несоответствия в процессах проверки приложений в магазинах приложений, вызывая призывы к более четким руководящим принципам и более прозрачным политикам, несмотря на аргументы о том, что строгие проверки необходимы для защиты пользователей.»"
    ],
    "points": 132,
    "commentCount": 159,
    "retryCount": 0,
    "time": 1727182950
  },
  {
    "id": 41629923,
    "title": "Внутри чипа ферроэлектрической оперативной памяти",
    "originLink": "http://www.righto.com/2024/09/ramtron-ferroelectric-fram-die.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41629923",
    "commentBody": "",
    "originSummary": [
      "«Блог-пост Кена Ширриффа исследует ферроэлектрическую оперативную память (FRAM), технологию энергонезависимой памяти, известную своей долговечностью и способностью к быстрому записыванию данных.»",
      "«Несмотря на свои преимущества, высокие производственные затраты и сложность FRAM ограничили его использование нишевыми приложениями, что подтверждается примером чипа FRAM компании Ramtron, выпущенного в 1999 году.»",
      "Блог описывает историю, структуру и работу FRAM, отмечая, что, несмотря на перспективность, его широкое распространение было затруднено, и в конечном итоге компания Ramtron была приобретена Cypress Semiconductor."
    ],
    "commentSummary": [
      "Компания Texas Instruments интегрировала FRAM (ферроэлектрическую память) в некоторые микроконтроллеры, которая сохраняет данные без питания, в отличие от флэш-памяти.",
      "FRAM совместим по выводам и функциям с другими типами энергонезависимой памяти, такими как NVRAM и EEPROM, и является экономически эффективным в небольших объемах.",
      "«Несмотря на то, что деструктивные чтения требуют перезаписи, высокая скорость записи и высокая выносливость FRAM делают его популярным в промышленных системах управления и в качестве замены SRAM с батарейной поддержкой в таких устройствах, как игровые консоли.»"
    ],
    "points": 132,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1727121963
  },
  {
    "id": 41635962,
    "title": "Давая Т-клеткам дополнительные батареи, их суперзаряжают против рака",
    "originLink": "https://newatlas.com/cancer/cancer-immunotherapy-t-cells-extra-batteries-supercharges/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41635962",
    "commentBody": "",
    "originSummary": [
      "«Ученые из Бригамской и Женской больницы разработали метод улучшения Т-клеток, основной защиты организма от рака, путем предоставления им дополнительных митохондрий из стромальных клеток костного мозга (BMSCs).»",
      "Эти улучшенные Т-клетки, названные Mito+, показали улучшенное проникновение в опухоль и значительно уменьшили размер опухоли у мышей, при этом 75% обработанных мышей выжили в течение 60-дневного исследования.",
      "Этот прорыв, опубликованный в журнале Cell, предполагает новый подход к усилению иммунных клеток пациентов для более эффективного лечения рака."
    ],
    "commentSummary": [
      "Исследователи обнаружили, что добавление дополнительных митохондрий в Т-клетки может улучшить их способность бороться с раком.",
      "Исследование поднимает вопросы о эволюционном балансе митохондрий в клетках, так как их избыток может привести к таким проблемам, как активные формы кислорода или гибель клеток.",
      "Эти результаты могут проложить путь к новым методам лечения рака, хотя точные механизмы и более широкие последствия все еще исследуются."
    ],
    "points": 127,
    "commentCount": 55,
    "retryCount": 0,
    "time": 1727182295
  }
]
