[
  {
    "id": 41629475,
    "title": "১৮৭০ সালে, লর্ড রেলি তেল এবং পানি ব্যবহার করে অণুর আকার নিরূপণ করেছিলেন",
    "originLink": "https://www.atomsonly.news/p/franklin-oil",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41629475",
    "commentBody": "",
    "originSummary": [
      "লর্ড রেলি একটি সহজ পরীক্ষার মাধ্যমে একটি একক অণুর আকার অনুমান করেছিলেন, যেখানে তেল, পানি এবং একটি কলম ব্যবহার করা হয়েছিল, যা বেঞ্জামিন ফ্র্যাঙ্কলিনের ১৭৭০-এর দশকের পর্যবেক্ষণ দ্বারা অনুপ্রাণিত হয়েছিল।",
      "রেলির তেলের অণুর দৈর্ঘ্যের হিসাব (১.৬৩ ন্যানোমিটার) আধুনিক পরিমাপের (১.৬৭ ন্যানোমিটার) সাথে আশ্চর্যজনকভাবে মিল ছিল, যা মৌলিক বৈজ্ঞানিক পদ্ধতির শক্তি প্রদর্শন করে।",
      "এই ঐতিহাসিক পরীক্ষা দেখায় যে কীভাবে সরল কৌশলগুলি গুরুত্বপূর্ণ বৈজ্ঞানিক আবিষ্কারের দিকে নিয়ে যেতে পারে, যেমনটি চার্লস ট্যানফোর্ডের বই, 'বেন ফ্র্যাঙ্কলিন স্টিলড দ্য ওয়েভস'-এ বিস্তারিতভাবে বর্ণনা করা হয়েছে।"
    ],
    "commentSummary": [
      "১৮৭০ সালে, লর্ড রেলি তেলের একটি স্তর পানির উপর ছড়িয়ে দিয়ে এবং সেই স্তরের পুরুত্ব গণনা করে অণুর আকার অনুমান করেছিলেন, ধরে নিয়েছিলেন যে এটি একটি একক অণু স্তর গঠন করেছে।",
      "এই পদ্ধতিটি বেঞ্জামিন ফ্র্যাঙ্কলিনের পূর্ববর্তী পর্যবেক্ষণ দ্বারা অনুপ্রাণিত হয়েছিল।",
      "রোমারের ১৬৭৬ সালে আলোর গতির অনুমান এবং মিলিকানের তেলের ফোঁটা পরীক্ষার মাধ্যমে ইলেকট্রনের চার্জ পরিমাপের মতো ঐতিহাসিক বৈজ্ঞানিক সাফল্যগুলি দেখায় যে কীভাবে সাধারণ পর্যবেক্ষণগুলি গুরুত্বপূর্ণ বৈজ্ঞানিক অন্তর্দৃষ্টিতে পরিণত হতে পারে।"
    ],
    "points": 516,
    "commentCount": 176,
    "retryCount": 0,
    "time": 1727118494
  },
  {
    "id": 41636804,
    "title": "উইনঅ্যাম্প লিগ্যাসি প্লেয়ার সোর্স কোড",
    "originLink": "https://github.com/WinampDesktop/winamp",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41636804",
    "commentBody": "",
    "originSummary": [
      "উইনঅ্যাম্প, একটি মাল্টিমিডিয়া প্লেয়ার যা ১৯৯৭ সালে চালু হয়েছিল, এখন ওপেন-সোর্স, যা সম্প্রদায়কে এর কোড আধুনিকায়ন করার সুযোগ দিচ্ছে।",
      "উইনঅ্যাম্প ডেস্কটপ ক্লায়েন্ট তৈরি করতে ভিজ্যুয়াল স্টুডিও ২০১৯ এবং ইন্টেল আইপিপি v6.1.1.035 প্রয়োজন, দুটি প্রধান বিল্ড বিকল্প সহ: একটি স্ক্রিপ্ট ব্যবহার করে বা ভিজ্যুয়াল স্টুডিও আইডিই এর মধ্যে।",
      "নির্ভরশীলতাগুলির মধ্যে রয়েছে libvpx, libmpg123, OpenSSL, DirectX 9 SDK, Microsoft ATLMFC lib fix, এবং Intel IPP, প্রতিটি নির্দিষ্ট পরিবর্তন এবং আনপ্যাকিং ধাপের প্রয়োজন।"
    ],
    "commentSummary": [
      "উইনঅ্যাম্প লিগ্যাসি প্লেয়ারের সোর্স কোড গিটহাবে প্রকাশ করা হয়েছে কিছু সীমাবদ্ধতার সাথে, যার মধ্যে রয়েছে পরিবর্তিত সংস্করণ বিতরণ না করা, ফর্কিং না করা, এবং শুধুমাত্র অফিসিয়াল রক্ষণাবেক্ষণকারীরা পরিবর্তনগুলি বিতরণ করতে পারবেন।",
      "এই বিধিনিষেধগুলি GitHub-এর পরিষেবার শর্তাবলীর সাথে বিরোধ সৃষ্টি করে, যা পাবলিক রেপোজিটরিগুলির ফর্কিং অনুমোদন করে, যার ফলে \"ফর্কিং\" এর ব্যাখ্যা নিয়ে বিতর্ক সৃষ্টি হয়।",
      "মুক্তি \"উৎস উপলব্ধ\" হিসাবে বিবেচিত হয় বরং সত্যিকারের ওপেন সোর্স নয়, যার ফলে প্রযুক্তি সম্প্রদায়ের মধ্যে মিশ্র প্রতিক্রিয়া সৃষ্টি হয়েছে।"
    ],
    "points": 453,
    "commentCount": 204,
    "retryCount": 0,
    "time": 1727188029
  },
  {
    "id": 41630913,
    "title": "আমরা AMD GPU-তে Llama 405B ফাইন-টিউন করেছি",
    "originLink": "https://publish.obsidian.md/felafax/pages/Tune+Llama3+405B+on+AMD+MI300x+(our+journey)",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41630913",
    "commentBody": "",
    "originSummary": [
      "একটি স্টার্টআপ ৮টি AMD MI300x GPU ব্যবহার করে JAX এর পরিবর্তে PyTorch ব্যবহার করে LLaMA3.1 405B মডেলটি ফাইন-টিউন করেছে, যা উল্লেখযোগ্য কর্মক্ষমতা উন্নতি অর্জন করেছে।",
      "তারা তাদের কোড ওপেন-সোর্স করেছে এবং শার্ডিং কৌশলগুলি শেয়ার করেছে, যা JAX-এর ক্ষমতাকে হাইলাইট করে ML মডেল কোডকে হার্ডওয়্যার-স্বাধীন HLO গ্রাফে কম্পাইল করতে যা XLA কম্পাইলার দ্বারা অপ্টিমাইজ করা হয়।",
      "এই পদ্ধতিটি Google TPU এবং AMD GPU উভয়েই একই কোড নির্বিঘ্নে কার্যকর করতে দেয়, যা NVIDIA ইকোসিস্টেমের সাথে PyTorch-এর গভীর সম্পর্কের কারণে কোম্পানিগুলি যে চ্যালেঞ্জগুলির মুখোমুখি হয় তা সমাধান করে।"
    ],
    "commentSummary": [
      "একটি স্টার্টআপ সফলভাবে Llama 405B কে AMD GPU তে JAX ব্যবহার করে ফাইন-টিউন করেছে, যেখানে সাধারণত PyTorch ব্যবহৃত হয়। তারা JAX এর উন্নত শার্ডিং API গুলি ব্যবহার করে কর্মক্ষমতা উন্নত করেছে।",
      "JAX-এর হার্ডওয়্যার-স্বাধীন HLO গ্রাফগুলি, যা XLA কম্পাইলার দ্বারা অপ্টিমাইজ করা হয়েছে, একই কোডকে কোনো পরিবর্তন ছাড়াই Google TPU এবং AMD GPU উভয়েই চালাতে সক্ষম করেছে, যা PyTorch-এর NVIDIA হার্ডওয়্যারের সাথে গভীর সংহতির একটি সাধারণ চ্যালেঞ্জকে সমাধান করেছে।",
      "স্টার্টআপটি তাদের কোড ওপেন-সোর্স করেছে এবং নন-এনভিডিয়া হার্ডওয়্যারে এআই অবকাঠামোর জন্য তাদের পদ্ধতি এবং দৃষ্টিভঙ্গি সম্পর্কে প্রতিক্রিয়া চাইছে।"
    ],
    "points": 434,
    "commentCount": 85,
    "retryCount": 0,
    "time": 1727127746
  },
  {
    "id": 41635592,
    "title": "ওপেনফ্রিম্যাপ – ওপেন-সোর্স ম্যাপ হোস্টিং",
    "originLink": "https://openfreemap.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41635592",
    "commentBody": "",
    "originSummary": [
      "৯ বছরের উন্নয়নের পর, MapHub-এর স্রষ্টা তাদের OpenStreetMap টাইল সার্ভারকে ওপেন-সোর্স করেছেন, যা এখন OpenFreeMap নামে পরিচিত।",
      "OpenFreeMap ব্যবহারকারীদের স্ব-হোস্ট বা একটি পাবলিক ইনস্ট্যান্স ব্যবহার করার অনুমতি দেয়, যেখানে সমস্ত উপাদান সম্পূর্ণরূপে ওপেন-সোর্স এবং কোনো 'ওপেন-কোর' মডেল নেই।",
      "প্রকল্পটি সাপ্তাহিকভাবে সম্পূর্ণ গ্রহের ডাউনলোড Btrfs এবং MBTiles ফরম্যাটে প্রদান করে এবং অনুদানের মাধ্যমে পাবলিক ইনস্ট্যান্সের খরচ কভার করার লক্ষ্য রাখে।"
    ],
    "commentSummary": [
      "ওপেনফ্রিম্যাপ একটি ওপেন-সোর্স মানচিত্র হোস্টিং পরিষেবা যা হাইপারনট দ্বারা চালু করা হয়েছে, যা ম্যাপহাবের জন্য ৯ বছর ধরে একটি ওপেনস্ট্রিটম্যাপ টাইল সার্ভার পরিচালনা করার পর।",
      "ব্যবহারকারীরা স্ব-হোস্ট করতে পারেন বা পাবলিক ইনস্ট্যান্স ব্যবহার করতে পারেন, সমস্ত উপাদান ওপেন-সোর্স এবং মানচিত্রের ডেটা OpenStreetMap থেকে প্রাপ্ত।",
      "সাপ্তাহিক পূর্ণ গ্রহ ডাউনলোডগুলি Btrfs এবং MBTiles ফরম্যাটে উপলব্ধ, এবং প্রকল্পটি দানের মাধ্যমে পাবলিক ইনস্ট্যান্স খরচগুলি কভার করার লক্ষ্য রাখে।"
    ],
    "points": 425,
    "commentCount": 122,
    "retryCount": 0,
    "time": 1727179162
  },
  {
    "id": 41631130,
    "title": "আইফোন ১৬ প্রো স্টোরেজ সম্প্রসারণ ১২৮জিবি থেকে ১টিবি [ভিডিও]",
    "originLink": "https://www.youtube.com/watch?v=KRRNR4HyYaw",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41631130",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "আইফোন ১৬ প্রো এখন ১২৮জিবি থেকে ১টিবি পর্যন্ত স্টোরেজ সম্প্রসারণের সুযোগ দিচ্ছে, যা প্রযুক্তি উত্সাহীদের এবং মডারদের মধ্যে আগ্রহ সৃষ্টি করেছে।",
      "ভিডিওটি NAND চিপ প্রতিস্থাপনের জন্য প্রয়োজনীয় প্রযুক্তিগত দক্ষতা প্রদর্শন করে, যা এমন পরিবর্তনের জন্য প্রয়োজনীয় নির্ভুলতা এবং স্থিতিশীলতাকে তুলে ধরে।",
      "আলোচনাগুলি ঘুরপাক খাচ্ছে যে উচ্চ-গ্রেডের NAND চিপ ব্যবহার করলে কর্মক্ষমতা এবং স্থায়িত্ব উন্নত হতে পারে কিনা, এবং অ্যাপলের হার্ডওয়্যারের নান্দনিকতা ও নকশার গুণমান নিয়ে।"
    ],
    "points": 372,
    "commentCount": 257,
    "retryCount": 0,
    "time": 1727129516
  },
  {
    "id": 41631912,
    "title": "WP Engine Automattic-কে 'বিরত থাকুন এবং থামুন' চিঠি পাঠিয়েছে",
    "originLink": "https://twitter.com/wpengine/status/1838350670564377051",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41631912",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "WP Engine Automattic-কে একটি \"বিরতি এবং বিরত\" চিঠি পাঠিয়েছে, যেখানে CEO ম্যাট মুলেনওয়েগকে একটি মূল বক্তব্যে দেওয়া বক্তব্যের জন্য মানহানি এবং চাঁদাবাজির অভিযোগ করা হয়েছে।",
      "মুলেনওয়েগ অভিযোগ করেছেন যে WP ইঞ্জিন ওয়ার্ডপ্রেস ইকোসিস্টেমকে শোষণ করে এবং \"WP\" ট্রেডমার্কের অপব্যবহার করে, এবং আরও নেতিবাচক প্রচার এড়াতে $40 মিলিয়ন দাবি করেছেন।",
      "ঘটনাটি ওয়ার্ডপ্রেস উন্নয়ন এবং ট্রেডমার্ক ব্যবহারের অবদানের বিষয়ে চলমান উত্তেজনাকে তুলে ধরে, যা উভয় পক্ষের অনুশীলন সম্পর্কে সম্প্রদায়ের মতামতকে বিভক্ত করেছে।"
    ],
    "points": 252,
    "commentCount": 180,
    "retryCount": 0,
    "time": 1727137318
  },
  {
    "id": 41635583,
    "title": "দ্রুত চলুন এবং জিনিসগুলি পরিত্যাগ করুন",
    "originLink": "https://engineersneedart.com/blog/movefast/movefast.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41635583",
    "commentBody": "",
    "originSummary": [
      "একজন ডেভেলপার গিটহাবে সফট ডরোথি সফটওয়্যার নামে প্রাচীন ম্যাকিনটোশ যুগের পুরানো শেয়ারওয়্যার গেমস এবং অসমাপ্ত প্রকল্পগুলির একটি সংগ্রহ প্রকাশ করেছেন।",
      "ডিস্ক ইমেজগুলি 68K বা PPC ম্যাক এমুলেটর যেমন Basilisk II, Sheepshaver, বা MiniVMac এর সাথে ব্যবহার করা যেতে পারে, যা ব্যবহারকারীদের এই নস্টালজিক সফটওয়্যার ইতিহাসের অংশগুলি অন্বেষণ করতে দেয়।",
      "এই প্রকাশনাটি অতীতের গেম ডেভেলপমেন্ট প্রক্রিয়ার একটি অনন্য ঝলক প্রদান করে, যেখানে সম্পূর্ণ এবং পরিত্যক্ত প্রকল্প উভয়ই প্রদর্শিত হয়, এবং গেম ডিজাইনের পুনরাবৃত্তিমূলক প্রকৃতিকে তুলে ধরা হয়।"
    ],
    "commentSummary": [
      "প্রবন্ধটি \"দ্রুত এগিয়ে যান এবং জিনিসগুলি পরিত্যাগ করুন\" দ্রুত প্রোটোটাইপিং এবং অনুপ্রেরণাহীন প্রকল্পগুলি পরিত্যাগ করার গুরুত্বকে জোর দেয় যাতে উদ্ভাবনকে উৎসাহিত করা যায়।",
      "লেখক প্রস্তাব করেছেন যে সার্বজনীন মৌলিক আয় (UBI) আরও বেশি মানুষকে আর্থিক সীমাবদ্ধতা ছাড়াই সৃজনশীল প্রচেষ্টা অনুসরণ করতে সক্ষম করতে পারে, যা এর মানসিক স্বাস্থ্য এবং সৃজনশীলতার উপর প্রভাব নিয়ে মন্তব্যকারীদের মধ্যে বিতর্ক উস্কে দেয়।",
      "আলোচনাটি এছাড়াও প্রকল্পগুলি শেষ করার এবং খুব তাড়াতাড়ি প্রকল্পগুলি পরিত্যাগ করার ফাঁদগুলি এড়াতে ছোট, পরিচালনাযোগ্য কাজগুলিতে মনোনিবেশ করার সুবিধার মধ্যে ভারসাম্যকে তুলে ধরে।"
    ],
    "points": 222,
    "commentCount": 65,
    "retryCount": 0,
    "time": 1727179082
  },
  {
    "id": 41633155,
    "title": "মেকার পাইপ – ডিআইওয়াই নির্মাতাদের জন্য কাঠামোগত পাইপ ফিটিংস",
    "originLink": "https://makerpipe.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41633155",
    "commentBody": "",
    "originSummary": [
      "মেকার পাইপ একটি সিস্টেম অফার করে যা ইএমটি কনডুইটকে একটি সাশ্রয়ী এবং বহুমুখী নির্মাণ প্ল্যাটফর্মে রূপান্তরিত করার জন্য স্টিল পাইপ সংযোগকারী ব্যবহার করে, যা শুধুমাত্র সাধারণ হাতিয়ার প্রয়োজন হয়।",
      "সংযোগকারীগুলি টেকসই ইস্পাত দিয়ে তৈরি, যা আসবাবপত্র থেকে কাস্টম শেল্ভিং পর্যন্ত বিভিন্ন DIY প্রকল্পের জন্য শক্তি এবং নির্ভরযোগ্যতা নিশ্চিত করে।",
      "গ্রাহকদের প্রশংসাপত্রগুলি পণ্যের ব্যবহারিক সহজতা, সাশ্রয়ীতা এবং বিভিন্ন সৃজনশীল ও ব্যবহারিক প্রয়োগের জন্য এর অভিযোজনযোগ্যতাকে তুলে ধরে।"
    ],
    "commentSummary": [
      "মেকার পাইপ ডিআইওয়াই নির্মাতাদের জন্য কাঠামোগত পাইপ ফিটিং সরবরাহ করে, তাদের প্রোটোটাইপিংয়ের জন্য মেক পাইপ মিনিসের উপর জোর দেয়, যা ডাউনলোডযোগ্য এসটিএল ফাইল ব্যবহার করে 3ডি প্রিন্ট করা যেতে পারে।",
      "ব্যবহারকারীরা মেকার পাইপকে ৮০/২০ এবং কী ক্ল্যাম্পের মতো অন্যান্য সিস্টেমের সাথে তুলনা করেন, প্রতিটির সুবিধা এবং অসুবিধা নিয়ে আলোচনা করেন, এবং আরও শক্তিশালী প্রকল্পের জন্য ইএমটি কনডুইট, ব্ল্যাক পাইপ, ইউনিস্ট্রুট, বা এক্সট্রুডেড অ্যালুমিনিয়ামের মতো বিকল্পগুলি প্রস্তাব করেন।",
      "আলোচনায় বিভিন্ন ডিআইওয়াই প্রকল্পের জন্য উপকরণ এবং ফিটিংসের ব্যবহারিকতা, প্রাপ্যতা এবং গুণমান অন্তর্ভুক্ত রয়েছে।"
    ],
    "points": 193,
    "commentCount": 104,
    "retryCount": 0,
    "time": 1727153010
  },
  {
    "id": 41632460,
    "title": "ফেলে দেওয়া কমলার খোসা একটি অনুর্বর চারণভূমিকে রূপান্তরিত করেছে (২০১৭)",
    "originLink": "https://www.sciencealert.com/how-12-000-tonnes-of-dumped-orange-peel-produced-something-nobody-imagined",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41632460",
    "commentBody": "",
    "originSummary": [
      "১৯৯০-এর দশকের মাঝামাঝি সময়ে, কোস্টা রিকায় একটি সংরক্ষণ প্রকল্প ১২,০০০ টন কমলার খোসার বর্জ্য ব্যবহার করে একটি অনুর্বর চারণভূমিকে একটি সবুজ বনভূমিতে রূপান্তরিত করেছিল।",
      "প্রিন্সটন গবেষকদের নেতৃত্বে পরিচালিত প্রকল্পটি একটি মামলার কারণে স্থগিত হয়েছিল, কিন্তু ২০১৩ সালে পুনরায় আবিষ্কৃত হয়, যা একটি ঘন জঙ্গল, উর্বর মাটি এবং বৈচিত্র্যময় গাছের প্রজাতি প্রকাশ করে।",
      "এই প্রকল্পের সাফল্য, যা রেস্টোরেশন ইকোলজি-তে প্রকাশিত হয়েছে, অনুরূপ সংরক্ষণ প্রচেষ্টার সম্ভাবনা নির্দেশ করে, যদিও সুনির্দিষ্ট প্রক্রিয়াগুলি এখনও অস্পষ্ট।"
    ],
    "commentSummary": [
      "২০১৭ সালে, কোস্টা রিকার একটি অবনমিত জমিতে ১২,০০০ মেট্রিক টন কমলার খোসা ফেলা হয়, যার ফলে একটি মামলা এবং প্রকল্পের বিরুদ্ধে সুপ্রিম কোর্টের রায় হয়।",
      "১৫ বছর পর, গবেষণায় প্রকাশ পেয়েছে যে জমিটি একটি সবুজ, জীববৈচিত্র্যময় এলাকায় রূপান্তরিত হয়েছে, যা পরিবেশ পুনর্বাসনের জন্য জৈব বর্জ্য ব্যবহারের নৈতিকতা এবং বৈধতা নিয়ে বিতর্কের সূত্রপাত করেছে।",
      "মামলাটি প্রাথমিক আইনি এবং কর্পোরেট বাধার সম্মুখীন হওয়া সত্ত্বেও, বাস্তুতন্ত্র পুনরুদ্ধারে জৈব বর্জ্যের সম্ভাব্য উপকারিতা তুলে ধরেছে।"
    ],
    "points": 190,
    "commentCount": 130,
    "retryCount": 0,
    "time": 1727143546
  },
  {
    "id": 41633400,
    "title": "কোলোকেশন: নন-ক্লাউন হোস্টিং",
    "originLink": "http://rachelbythebay.com/w/2024/09/23/colo/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41633400",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "আলোচনাটি কোলোকেশন (কোলো) পরিষেবাগুলির চারপাশে ঘোরে, যা বাড়িতে নয় বরং তৃতীয় পক্ষের ডেটা সেন্টারে সার্ভার হোস্টিং জড়িত।",
      "ব্যবহারকারীরা বিভিন্ন রঙের বিকল্প এবং ডিল শেয়ার করছেন, যার মধ্যে ছাড় এবং বিভিন্ন প্রদানকারীর সাথে ব্যক্তিগত অভিজ্ঞতাও অন্তর্ভুক্ত রয়েছে।",
      "আলোচনাটি কোলোকেশন বনাম হোম হোস্টিংয়ের সুবিধা এবং অসুবিধাগুলি তুলে ধরে, যেমন নির্ভরযোগ্যতা, খরচ এবং CGNAT (ক্যারিয়ার-গ্রেড নেটওয়ার্ক অ্যাড্রেস ট্রান্সলেশন) এর মতো প্রযুক্তিগত চ্যালেঞ্জগুলি।"
    ],
    "points": 170,
    "commentCount": 165,
    "retryCount": 0,
    "time": 1727156367
  },
  {
    "id": 41629620,
    "title": "টেলিগ্রাম এখন অপরাধী সন্দেহভাজনদের ফোন নম্বর এবং আইপি হস্তান্তর করবে",
    "originLink": "https://www.theverge.com/2024/9/23/24252276/telegram-disclose-user-data-legal-requests-criminal-activity",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41629620",
    "commentBody": "",
    "originSummary": [
      "টেলিগ্রাম এখন ব্যবহারকারীর ফোন নম্বর এবং আইপি ঠিকানা কর্তৃপক্ষের সাথে শেয়ার করবে যদি তারা অপরাধী সন্দেহভাজন হয়, তার আপডেট করা গোপনীয়তা নীতির অনুযায়ী।",
      "এই নীতির পরিবর্তন টেলিগ্রামের সিইও পাভেল দুরভের গ্রেপ্তারের পর আসে, যিনি প্ল্যাটফর্মে অবৈধ কার্যকলাপ সক্ষম করার অভিযোগে অভিযুক্ত হয়েছিলেন।",
      "টেলিগ্রাম তার ত্রৈমাসিক স্বচ্ছতা প্রতিবেদনে এই প্রকাশনাগুলি অন্তর্ভুক্ত করবে এবং সমস্যাযুক্ত বিষয়বস্তু অপসারণের জন্য এআই ব্যবহার করছে, পাশাপাশি এর মডারেশন নীতিগুলিতে পরিবর্তন আনছে।"
    ],
    "commentSummary": [
      "টেলিগ্রাম এখন আইনগত পরোয়ানার সাথে সম্মতি জানিয়ে অপরাধী সন্দেহভাজনদের ফোন নম্বর এবং আইপি ঠিকানা কর্তৃপক্ষের সাথে শেয়ার করবে।",
      "সিগন্যালের বিপরীতে, যা ন্যূনতম ব্যবহারকারীর তথ্য সংগ্রহ করে, টেলিগ্রামের ডিফল্ট এন্ড-টু-এন্ড এনক্রিপশনের অভাব এটিকে তথ্য অনুরোধের জন্য আরও সংবেদনশীল করে তোলে।",
      "এই সিদ্ধান্তটি গোপনীয়তা উদ্বেগ এবং আন্তর্জাতিক বিচারব্যবস্থার মধ্যে সম্মতির প্রভাব সম্পর্কে চলমান বিতর্ক উত্থাপন করে।"
    ],
    "points": 163,
    "commentCount": 121,
    "retryCount": 0,
    "time": 1727119715
  },
  {
    "id": 41632719,
    "title": "ট্রেসি: একটি রিয়েল টাইম, ন্যানোসেকেন্ড রেজোলিউশন ফ্রেম প্রোফাইলার",
    "originLink": "https://github.com/wolfpld/tracy",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41632719",
    "commentBody": "",
    "originSummary": [
      "ট্রেসি প্রোফাইলার একটি উচ্চ-রেজোলিউশন, রিয়েল-টাইম প্রোফাইলার যা গেম এবং অন্যান্য অ্যাপ্লিকেশনের জন্য ডিজাইন করা হয়েছে, যা একাধিক ভাষা এবং গ্রাফিক্স এপিআই জুড়ে সিপিইউ এবং জিপিইউ প্রোফাইলিং সমর্থন করে।",
      "এটি বিস্তৃত বৈশিষ্ট্যগুলি প্রদান করে, যার মধ্যে রয়েছে মেমরি বরাদ্দ ট্র্যাকিং, লক প্রোফাইলিং, কনটেক্সট সুইচ মনিটরিং, এবং ফ্রেমগুলিতে স্বয়ংক্রিয় স্ক্রিনশট অ্যাট্রিবিউশন।",
      "টুলটির ক্ষমতা এবং আপডেটগুলি বিভিন্ন রিলিজ এবং উপস্থাপনায় প্রদর্শিত হয়, যার মধ্যে রয়েছে CppCon 2023, যেখানে বিস্তৃত ডকুমেন্টেশন এবং উইন্ডোজ x64 বাইনারিগুলি উপলব্ধ।"
    ],
    "commentSummary": [
      "ট্রেসি একটি বিনামূল্যের, রিয়েল-টাইম ফ্রেম প্রোফাইলার যা ন্যানোসেকেন্ড রেজোলিউশন সহ গিটহাবে উপলব্ধ, এর বিস্তৃত বৈশিষ্ট্য এবং কর্মক্ষমতার জন্য প্রশংসিত।",
      "স্বয়ংক্রিয় স্যাম্পলিং প্রোফাইলারগুলির বিপরীতে, ট্রেসি কোডবেসে ম্যাক্রো যোগ করার প্রয়োজন হয়, যেখানে প্রতিটি ম্যাক্রো প্রায় ৫০ ন্যানোসেকেন্ড ওভারহেড যোগ করে।",
      "ব্যবহারকারীরা ট্রেসির বিস্তারিত পরিসংখ্যান উইন্ডোকে প্রশংসা করে এবং প্রায়ই সেটআপের কিছু অসুবিধা এবং GPU অ্যাপ্লিকেশনগুলির সাথে চ্যালেঞ্জ থাকা সত্ত্বেও ব্যাপক বিশ্লেষণের জন্য এটি অন্যান্য প্রোফাইলারগুলির সাথে একত্রিত করে।"
    ],
    "points": 152,
    "commentCount": 26,
    "retryCount": 0,
    "time": 1727146667
  },
  {
    "id": 41636038,
    "title": "হ্যালাইড অ্যাপ স্টোর থেকে প্রত্যাখ্যাত হয়েছে কারণ এটি কেন ছবি তোলে তা ব্যাখ্যা করে না",
    "originLink": "https://9to5mac.com/2024/09/24/halide-rejected-from-the-app-store-because-it-doesnt-explain-why-the-camera-takes-photos/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41636038",
    "commentBody": "",
    "originSummary": [
      "আইফোন ১৬-এর ম্যাক্রো ফটোগ্রাফির উন্নতি সম্ভবত হার্ডওয়্যার পরিবর্তনের চেয়ে সফটওয়্যার উন্নতির কারণে হতে পারে।",
      "এটি প্রস্তাব করে যে অ্যাপল ফটো গুণমান উন্নত করতে সফটওয়্যার অ্যালগরিদমের উপর মনোযোগ দিচ্ছে, সম্ভবত উল্লেখযোগ্য হার্ডওয়্যার আপগ্রেডের প্রয়োজন ছাড়াই উন্নত ম্যাক্রো শট সরবরাহ করতে পারে।",
      "সফটওয়্যারের উপর জোর দেওয়া মানে হতে পারে যে বিদ্যমান আইফোন মডেলগুলিও সফটওয়্যার আপডেটের মাধ্যমে অনুরূপ উন্নতির সুবিধা পেতে পারে।"
    ],
    "commentSummary": [
      "হ্যালাইড, একটি জনপ্রিয় ক্যামেরা অ্যাপ, অ্যাপ স্টোর থেকে প্রত্যাখ্যাত হয়েছে কারণ এটি কেন ছবি তোলে তা ব্যাখ্যা করেনি, যা অ্যাপ স্টোর পর্যালোচনার সাথে ডেভেলপারদের সাধারণ সমস্যার দিকে ইঙ্গিত করে।",
      "ডেভেলপাররা প্লে স্টোরের সাথে একই ধরনের হতাশার সম্মুখীন হয়েছেন, যার মধ্যে অকারণ সমস্যার জন্য প্রত্যাখ্যান এবং অনুমোদন পেতে ডেটা-সুরক্ষা নীতিমালা যোগ করার প্রয়োজনীয়তা অন্তর্ভুক্ত রয়েছে।",
      "পরিস্থিতিটি অ্যাপ স্টোর পর্যালোচনা প্রক্রিয়ার জটিলতা এবং অসঙ্গতিগুলিকে তুলে ধরে, যা স্পষ্ট নির্দেশিকা এবং আরও স্বচ্ছ নীতির আহ্বান জানায়, যদিও কঠোর পর্যালোচনাগুলি ব্যবহারকারীর সুরক্ষার জন্য প্রয়োজনীয় বলে যুক্তি দেওয়া হয়।"
    ],
    "points": 132,
    "commentCount": 159,
    "retryCount": 0,
    "time": 1727182950
  },
  {
    "id": 41629923,
    "title": "ফেরোইলেকট্রিক র্যাম চিপের ভিতরে",
    "originLink": "http://www.righto.com/2024/09/ramtron-ferroelectric-fram-die.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41629923",
    "commentBody": "",
    "originSummary": [
      "কেন শিরিফের ব্লগ পোস্টটি ফেরোইলেকট্রিক র্যাম (এফআরএএম) নিয়ে আলোচনা করে, যা তার টেকসইতা এবং দ্রুত লেখার ক্ষমতার জন্য পরিচিত একটি ননভোলাটাইল মেমরি প্রযুক্তি।",
      "এর সুবিধাগুলি সত্ত্বেও, FRAM-এর উচ্চ উৎপাদন খরচ এবং জটিলতা এর ব্যবহারকে সীমিত করে দিয়েছে নির্দিষ্ট প্রয়োগে, যার উদাহরণ হিসেবে রামট্রনের ১৯৯৯ সালের FRAM চিপটি উল্লেখযোগ্য।",
      "ব্লগটি FRAM-এর ইতিহাস, গঠন এবং কার্যক্রমের বিবরণ দেয়, উল্লেখ করে যে এটি প্রতিশ্রুতিশীল হলেও এর ব্যাপক গ্রহণ বাধাগ্রস্ত হয়েছে, এবং শেষ পর্যন্ত Ramtron কে Cypress Semiconductor দ্বারা অধিগ্রহণ করা হয়।"
    ],
    "commentSummary": [
      "টেক্সাস ইন্সট্রুমেন্টস কিছু মাইক্রোকন্ট্রোলারে FRAM (ফেরোইলেকট্রিক RAM) সংযুক্ত করেছে, যা ফ্ল্যাশ মেমরির বিপরীতে বিদ্যুৎ ছাড়াই ডেটা সংরক্ষণ করে।",
      "FRAM পিন এবং ফাংশন অনুযায়ী অন্যান্য নন-ভোলাটাইল মেমরি টাইপ যেমন NVRAM এবং EEPROM এর সাথে সামঞ্জস্যপূর্ণ, এবং ছোট ক্ষমতায় এটি খরচ-সাশ্রয়ী।",
      "ধ্বংসাত্মক রিডগুলি পুনরায় লেখার প্রয়োজন সত্ত্বেও, FRAM-এর দ্রুত লেখার গতি এবং উচ্চ সহনশীলতা এটিকে শিল্প নিয়ন্ত্রণ ব্যবস্থায় এবং গেম কনসোলের মতো ডিভাইসগুলিতে ব্যাটারি-সমর্থিত SRAM-এর প্রতিস্থাপন হিসাবে জনপ্রিয় করে তুলেছে।"
    ],
    "points": 132,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1727121963
  },
  {
    "id": 41635962,
    "title": "টি কোষগুলিকে অতিরিক্ত ব্যাটারি দেওয়া তাদের ক্যান্সারের বিরুদ্ধে সুপারচার্জ করে",
    "originLink": "https://newatlas.com/cancer/cancer-immunotherapy-t-cells-extra-batteries-supercharges/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41635962",
    "commentBody": "",
    "originSummary": [
      "ব্রিগহাম অ্যান্ড উইমেনস হাসপাতালের বিজ্ঞানীরা একটি পদ্ধতি উদ্ভাবন করেছেন যা টি কোষগুলিকে উন্নত করতে সহায়তা করে, যা ক্যান্সারের বিরুদ্ধে শরীরের প্রধান প্রতিরক্ষা ব্যবস্থা। এই পদ্ধতিতে তারা টি কোষগুলিকে অস্থিমজ্জার স্ট্রোমাল কোষ (BMSCs) থেকে অতিরিক্ত মাইটোকন্ড্রিয়া সরবরাহ করেন।",
      "এই উন্নত টি কোষগুলি, যেগুলিকে Mito+ বলা হয়, ইঁদুরের মধ্যে টিউমারে প্রবেশের ক্ষমতা বৃদ্ধি পেয়েছে এবং টিউমারের আকার উল্লেখযোগ্যভাবে হ্রাস পেয়েছে, যেখানে ৭৫% চিকিৎসা করা ইঁদুর ৬০ দিনের গবেষণায় বেঁচে ছিল।",
      "এই অগ্রগতি, যা সেল জার্নালে প্রকাশিত হয়েছে, রোগীদের প্রতিরোধকোষকে আরও কার্যকর ক্যান্সার চিকিৎসার জন্য উন্নত করার একটি সম্ভাব্য নতুন পদ্ধতির ইঙ্গিত দেয়।"
    ],
    "commentSummary": [
      "গবেষকরা আবিষ্কার করেছেন যে, টি কোষে অতিরিক্ত মাইটোকন্ড্রিয়া যোগ করলে তাদের ক্যান্সার প্রতিরোধের ক্ষমতা বৃদ্ধি পায়।",
      "গবেষণাটি কোষে মাইটোকন্ড্রিয়ার বিবর্তনীয় ভারসাম্য সম্পর্কে প্রশ্ন উত্থাপন করে, কারণ অতিরিক্ত মাইটোকন্ড্রিয়া প্রতিক্রিয়াশীল অক্সিজেন প্রজাতি বা কোষের মৃত্যুর মতো সমস্যার দিকে নিয়ে যেতে পারে।",
      "এই আবিষ্কারগুলি নতুন ক্যান্সার চিকিৎসার পথ প্রশস্ত করতে পারে, যদিও সুনির্দিষ্ট প্রক্রিয়া এবং বিস্তৃত প্রভাবগুলি এখনও তদন্তাধীন রয়েছে।"
    ],
    "points": 127,
    "commentCount": 55,
    "retryCount": 0,
    "time": 1727182295
  }
]
