[
  {
    "id": 41629475,
    "title": "1870 yılında Lord Rayleigh, moleküllerin boyutunu hesaplamak için yağ ve su kullandı",
    "originLink": "https://www.atomsonly.news/p/franklin-oil",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41629475",
    "commentBody": "",
    "originSummary": [
      "Lord Rayleigh, 1770'lerde Benjamin Franklin'in gözlemlerinden ilham alarak, yağ, su ve bir kalem kullanarak basit bir deneyle tek bir molekülün boyutunu tahmin etti.",
      "Rayleigh'in bir yağ molekülünün uzunluğuna dair hesaplaması (1.63 nanometre), modern ölçümlerle (1.67 nanometre) şaşırtıcı derecede yakındı ve temel bilimsel yöntemlerin gücünü gösteriyordu.",
      "Bu tarihi deney, Charles Tanford'un \"Ben Franklin Dalgaları Durdurdu\" adlı kitabında ayrıntılı olarak açıklandığı gibi, basit tekniklerin nasıl önemli bilimsel keşiflere yol açabileceğini vurgulamaktadır."
    ],
    "commentSummary": [
      "1870 yılında Lord Rayleigh, su üzerine yağ yayarak ve filmin kalınlığını hesaplayarak moleküllerin boyutunu tahmin etti, bunun tek bir moleküler tabaka oluşturduğunu varsaydı.",
      "Bu yöntem, Benjamin Franklin'in önceki gözlemlerinden ilham alınarak geliştirilmiştir.",
      "Roemer'in 1676'daki ışık hızı tahmini ve Millikan'ın elektronun yükünü ölçmek için yaptığı yağ damlası deneyi gibi tarihsel bilimsel başarılar, basit gözlemlerin nasıl önemli bilimsel içgörülere yol açabileceğini göstermektedir."
    ],
    "points": 516,
    "commentCount": 176,
    "retryCount": 0,
    "time": 1727118494
  },
  {
    "id": 41636804,
    "title": "Winamp Legacy oynatıcı kaynak kodu",
    "originLink": "https://github.com/WinampDesktop/winamp",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41636804",
    "commentBody": "",
    "originSummary": [
      "Winamp, 1997 yılında piyasaya sürülen bir multimedya oynatıcı, artık açık kaynaklı olup, topluluğun kodunu modernize etmesine olanak tanıyor.",
      "Winamp masaüstü istemcisini oluşturmak için Visual Studio 2019 ve Intel IPP v6.1.1.035 gereklidir, iki ana derleme seçeneği vardır: bir betik kullanarak veya Visual Studio IDE içinde.",
      "Bağımlılıklar arasında libvpx, libmpg123, OpenSSL, DirectX 9 SDK, Microsoft ATLMFC lib düzeltmesi ve Intel IPP bulunur; her biri belirli değişiklikler ve açma adımları gerektirir."
    ],
    "commentSummary": [
      "Winamp Legacy oynatıcı kaynak kodu, GitHub'da kısıtlamalarla yayınlandı; değiştirilmiş sürümlerin dağıtımı, çatallanma yasak ve yalnızca resmi bakımcılar değişiklikleri dağıtabilir.",
      "Bu kısıtlamalar, GitHub'ın kamuya açık depoların çatallanmasına izin veren Hizmet Şartları ile çelişiyor ve \"çatallama\" teriminin yorumlanması hakkında tartışmalara yol açıyor.",
      "Yayın, gerçekten açık kaynak yerine \"kaynak erişilebilir\" olarak kabul ediliyor ve bu durum teknoloji topluluğundan karışık tepkiler alıyor."
    ],
    "points": 453,
    "commentCount": 204,
    "retryCount": 0,
    "time": 1727188029
  },
  {
    "id": 41630913,
    "title": "Llama 405B'yi AMD GPU'lar üzerinde ince ayar yaptık",
    "originLink": "https://publish.obsidian.md/felafax/pages/Tune+Llama3+405B+on+AMD+MI300x+(our+journey)",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41630913",
    "commentBody": "",
    "originSummary": [
      "Bir girişim, LLaMA3.1 405B modelini 8xAMD MI300x GPU'ları kullanarak JAX yerine PyTorch ile ince ayar yaparak dikkate değer performans iyileştirmeleri elde etti.",
      "Kodlarını açık kaynak yaptılar ve sharding tekniklerini paylaştılar, JAX'in ML model kodunu XLA derleyicisi tarafından optimize edilen donanımdan bağımsız HLO grafiklerine derleme yeteneğini vurguladılar.",
      "Bu yaklaşım, şirketlerin PyTorch'un NVIDIA ekosistemiyle olan derin bağlarıyla ilgili karşılaştıkları zorlukları ele alarak, aynı kodun hem Google TPU'larında hem de AMD GPU'larında sorunsuz bir şekilde çalıştırılmasını sağlar."
    ],
    "commentSummary": [
      "Taze bir girişim, daha yaygın olan PyTorch yerine JAX kullanarak AMD GPU'larında Llama 405B'yi başarıyla ince ayar yaptı ve JAX'in gelişmiş parçalama API'lerini kullanarak performansı artırdı.",
      "JAX'in donanımdan bağımsız HLO grafikleri, XLA derleyicisi tarafından optimize edilerek, aynı kodun hem Google TPU'larda hem de AMD GPU'larda değişiklik yapılmadan çalışmasını sağladı ve bu, PyTorch'un NVIDIA donanımıyla derin entegrasyonunda karşılaşılan yaygın bir sorunu çözdü.",
      "Startup, kodlarını açık kaynaklı hale getirdi ve NVIDIA dışı donanımda AI altyapısı için yaklaşımları ve vizyonları hakkında geri bildirim arıyor."
    ],
    "points": 434,
    "commentCount": 85,
    "retryCount": 0,
    "time": 1727127746
  },
  {
    "id": 41635592,
    "title": "OpenFreeMap – Açık Kaynak Harita Barındırma",
    "originLink": "https://openfreemap.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41635592",
    "commentBody": "",
    "originSummary": [
      "9 yıllık geliştirme sürecinin ardından, MapHub'un yaratıcısı OpenStreetMap döşeme sunucusunu açık kaynaklı hale getirdi, şimdi OpenFreeMap olarak adlandırılıyor.",
      "AçıkÖzgürHarita, kullanıcıların kendi sunucularında barındırmalarına veya genel bir örneği kullanmalarına olanak tanır, tüm bileşenler tamamen açık kaynaklıdır ve 'açık çekirdek' modeli yoktur.",
      "Proje, haftalık olarak Btrfs ve MBTiles formatlarında tam gezegen indirmeleri sunar ve bağışlar yoluyla genel örnek maliyetlerini karşılamayı amaçlar."
    ],
    "commentSummary": [
      "OpenFreeMap, hyperknot tarafından 9 yıl boyunca MapHub için bir OpenStreetMap döşeme sunucusu işletmesinin ardından başlatılan açık kaynaklı bir harita barındırma hizmetidir.",
      "Kullanıcılar, tüm bileşenlerin açık kaynaklı olduğu ve harita verilerinin OpenStreetMap'ten alındığı bir ortamda, kendi sunucularında barındırabilir veya genel örneği kullanabilirler.",
      "Haftalık tam gezegen indirmeleri Btrfs ve MBTiles formatlarında mevcuttur ve proje, bağışlar yoluyla genel örnek maliyetlerini karşılamayı amaçlamaktadır."
    ],
    "points": 425,
    "commentCount": 122,
    "retryCount": 0,
    "time": 1727179162
  },
  {
    "id": 41631130,
    "title": "iPhone 16 Pro Depolama Genişletme 128GB'dan 1TB'a [video]",
    "originLink": "https://www.youtube.com/watch?v=KRRNR4HyYaw",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41631130",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "iPhone 16 Pro artık 128GB'dan 1TB'a kadar depolama genişletme imkanı sunuyor, bu da teknoloji meraklıları ve modderlar arasında ilgi uyandırıyor.",
      "Video, NAND çipini değiştirmek için gereken teknik beceriyi sergileyerek, bu tür değişiklikler için gereken hassasiyet ve kararlılığı vurguluyor.",
      "Yüksek dereceli NAND çiplerinin kullanılması performans ve dayanıklılığı artırabilir mi ve Apple'ın donanımının estetik ve tasarım kalitesi etrafında tartışmalar dönüyor."
    ],
    "points": 372,
    "commentCount": 257,
    "retryCount": 0,
    "time": 1727129516
  },
  {
    "id": 41631912,
    "title": "WP Engine, Automattic'e \"durdurma ve vazgeçme\" mektubu gönderdi",
    "originLink": "https://twitter.com/wpengine/status/1838350670564377051",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41631912",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "WP Engine, CEO Matt Mullenweg'i bir açılış konuşmasında yaptığı açıklamalar nedeniyle iftira ve şantajla suçlayarak Automattic'e bir 'durdurma ve vazgeçme' mektubu gönderdi.",
      "Mullenweg iddiaya göre WP Engine'in WordPress ekosistemini sömürdüğünü ve 'WP' ticari markasını kötüye kullandığını, daha fazla olumsuz tanıtımdan kaçınmak için 40 milyon dolar talep ettiğini iddia etti.",
      "Olay, WordPress geliştirmesine yapılan katkılar ve ticari marka kullanımı konusundaki devam eden gerilimleri vurguluyor ve topluluğun her iki tarafın uygulamaları hakkındaki görüşlerini bölüyor."
    ],
    "points": 252,
    "commentCount": 180,
    "retryCount": 0,
    "time": 1727137318
  },
  {
    "id": 41635583,
    "title": "Hızlı Hareket Et ve Şeyleri Terk Et",
    "originLink": "https://engineersneedart.com/blog/movefast/movefast.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41635583",
    "commentBody": "",
    "originSummary": [
      "Bir geliştirici, Soft Dorothy Software adı altında GitHub'da eski shareware oyunlar ve erken Macintosh dönemine ait tamamlanmamış projelerden oluşan bir koleksiyon yayınladı.",
      "Disk görüntüleri, kullanıcıların bu nostaljik yazılım tarihini keşfetmelerine olanak tanıyan Basilisk II, Sheepshaver veya MiniVMac gibi 68K veya PPC Mac emülatörleri ile kullanılabilir.",
      "Bu sürüm, geçmişteki oyun geliştirme sürecine benzersiz bir bakış sunarak, hem tamamlanmış hem de terk edilmiş projeleri sergiliyor ve oyun tasarımının yinelemeli doğasını vurguluyor."
    ],
    "commentSummary": [
      "Makale \"Hızlı Hareket Et ve Şeyleri Terk Et\", yeniliği teşvik etmek için hızlı prototip oluşturmanın ve umut vaat etmeyen projeleri terk etmenin önemini vurguluyor.",
      "Yazar, Evrensel Temel Gelir'in (UBI) daha fazla insanın mali kısıtlamalar olmadan yaratıcı uğraşlar peşinde koşmasını sağlayabileceğini öne sürüyor ve bu da yorumcular arasında ruh sağlığı ve yaratıcılık üzerindeki etkisi hakkında bir tartışma başlatıyor.",
      "Bu tartışma, projeleri tamamlama ile projeleri çok aceleyle terk etmenin tuzaklarından kaçınmak için daha küçük, yönetilebilir görevlere odaklanmanın faydaları arasındaki dengeyi de vurgulamaktadır."
    ],
    "points": 222,
    "commentCount": 65,
    "retryCount": 0,
    "time": 1727179082
  },
  {
    "id": 41633155,
    "title": "Maker Pipe – Kendin Yap Yapıcılar için Yapısal Boru Bağlantı Elemanları",
    "originLink": "https://makerpipe.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41633155",
    "commentBody": "",
    "originSummary": [
      "Maker Pipe, EMT Borusunu uygun fiyatlı ve çok yönlü bir yapı platformuna dönüştürmek için tasarlanmış çelik boru bağlantı elemanları sistemi sunar ve montaj için yalnızca basit el aletleri gerektirir.",
      "Bağlayıcılar, mobilyadan özel raflara kadar çeşitli kendin yap projeleri için güç ve güvenilirlik sağlayan dayanıklı çelikten yapılmıştır.",
      "Müşteri referansları, ürünün kullanım kolaylığını, uygun fiyatını ve geniş bir yelpazede yaratıcı ve pratik uygulamalara uyum sağlama yeteneğini vurgulamaktadır."
    ],
    "commentSummary": [
      "Maker Pipe, DIY yapımcıları için yapısal boru bağlantı parçaları sunar ve prototipleme için 3D yazıcı ile basılabilen indirilebilir STL dosyaları kullanılarak üretilebilen Make Pipe Minis'i vurgular.",
      "Kullanıcılar, Maker Pipe'ı 80/20 ve Kee Klamp gibi diğer sistemlerle karşılaştırarak her birinin artılarını ve eksilerini tartışıyor ve daha sağlam projeler için EMT boru, siyah boru, unistrut veya ekstrüde alüminyum gibi alternatifler öneriyor.",
      "Bu tartışma, çeşitli kendin yap projeleri için malzemelerin ve donanımların pratikliği, bulunabilirliği ve kalitesi konularını içermektedir."
    ],
    "points": 193,
    "commentCount": 104,
    "retryCount": 0,
    "time": 1727153010
  },
  {
    "id": 41632460,
    "title": "Atılan portakal kabuğu, çorak bir merayı dönüştürdü (2017)",
    "originLink": "https://www.sciencealert.com/how-12-000-tonnes-of-dumped-orange-peel-produced-something-nobody-imagined",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41632460",
    "commentBody": "",
    "originSummary": [
      "1990'ların ortalarında, Kosta Rika'da bir koruma projesi, 12.000 ton atık portakal kabuğunu kullanarak çorak bir merayı yemyeşil bir ormana dönüştürdü.",
      "Princeton araştırmacıları tarafından yürütülen proje, bir dava nedeniyle durduruldu ancak 2013 yılında yeniden keşfedildi ve daha zengin topraklara ve çeşitli ağaç türlerine sahip yoğun bir orman ortaya çıkardı.",
      "Bu projenin Restoration Ecology'de yayımlanan başarısı, benzer koruma çabaları için potansiyel olduğunu öne sürüyor, ancak kesin mekanizmalar belirsizliğini koruyor."
    ],
    "commentSummary": [
      "2017 yılında, Kosta Rika'da bozulmuş araziye 12.000 metrik ton portakal kabuğu döküldü, bu da bir davaya ve projeye karşı Yüksek Mahkeme kararıyla sonuçlandı.",
      "15 yıl sonra, yapılan çalışmalar, arazinin yemyeşil, biyolojik çeşitliliğe sahip bir alana dönüştüğünü ortaya çıkardı ve organik atıkların çevresel rehabilitasyon için kullanılmasının etiği ve yasallığı konusunda tartışmalara yol açtı.",
      "Vaka, başlangıçta karşılaşılan yasal ve kurumsal engellere rağmen, ekosistem restorasyonunda organik atıkların potansiyel faydalarını vurguladı."
    ],
    "points": 190,
    "commentCount": 130,
    "retryCount": 0,
    "time": 1727143546
  },
  {
    "id": 41633400,
    "title": "Ortak Yerleşim: Palyaço Olmayan Barındırma",
    "originLink": "http://rachelbythebay.com/w/2024/09/23/colo/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41633400",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Bu tartışma, sunucuların evde değil, üçüncü taraf bir veri merkezinde barındırılmasını içeren kolokasyon (colo) hizmetleri etrafında dönmektedir.",
      "Kullanıcılar, çeşitli renk seçenekleri ve fırsatları, indirimler ve farklı sağlayıcılarla ilgili kişisel deneyimlerini paylaşıyor.",
      "Konuşma, colocation ile evde barındırma arasındaki artıları ve eksileri, güvenilirlik, maliyet ve CGNAT (Taşıyıcı Sınıfı Ağ Adresi Çevirisi) gibi teknik zorluklar gibi konuları vurgulamaktadır."
    ],
    "points": 170,
    "commentCount": 165,
    "retryCount": 0,
    "time": 1727156367
  },
  {
    "id": 41629620,
    "title": "Telegram artık suç şüphelilerinin telefon numarası ve IP adresini teslim edecek",
    "originLink": "https://www.theverge.com/2024/9/23/24252276/telegram-disclose-user-data-legal-requests-criminal-activity",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41629620",
    "commentBody": "",
    "originSummary": [
      "Telegram, güncellenmiş gizlilik politikasına göre, artık bir kullanıcının telefon numarasını ve IP adresini, suç şüphelisi olmaları durumunda yetkililerle paylaşacak.",
      "Bu politika değişikliği, platformda yasa dışı faaliyetlere olanak sağlamakla suçlanan Telegram CEO'su Pavel Durov'un tutuklanmasının ardından geldi.",
      "Telegram, bu açıklamaları üç aylık şeffaflık raporlarına dahil edecek ve sorunlu içeriği kaldırmak için yapay zeka kullanacak, ayrıca moderasyon politikalarında değişiklikler yapacak."
    ],
    "commentSummary": [
      "Telegram artık yasal emirlerle uyumlu olarak suç şüphelilerinin telefon numaralarını ve IP adreslerini yetkililerle paylaşacak.",
      "Signal'in minimal kullanıcı verisi toplamasının aksine, Telegram'ın varsayılan uçtan uca şifreleme eksikliği, onu veri taleplerine karşı daha hassas hale getiriyor.",
      "Bu karar, gizlilik endişeleri ve uluslararası yargı bölgelerinde uyumun sonuçları hakkında süregelen tartışmaları gündeme getiriyor."
    ],
    "points": 163,
    "commentCount": 121,
    "retryCount": 0,
    "time": 1727119715
  },
  {
    "id": 41632719,
    "title": "Tracy: Gerçek zamanlı, nanosaniye çözünürlüklü bir kare profilleyici",
    "originLink": "https://github.com/wolfpld/tracy",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41632719",
    "commentBody": "",
    "originSummary": [
      "Tracy Profiler, oyunlar ve diğer uygulamalar için tasarlanmış, yüksek çözünürlüklü, gerçek zamanlı bir profil oluşturucudur ve birden fazla dil ve grafik API'si arasında hem CPU hem de GPU profil oluşturmayı destekler.",
      "Bellek tahsisi takibi, kilit profilleme, bağlam değiştirme izleme ve otomatik ekran görüntüsü çerçevelere atama gibi kapsamlı özellikler sunar.",
      "Aracın yetenekleri ve güncellemeleri, CppCon 2023 dahil olmak üzere çeşitli sürümler ve sunumlarda sergilenmektedir, kapsamlı belgeler ve Windows x64 ikili dosyaları mevcuttur."
    ],
    "commentSummary": [
      "Tracy, GitHub'da bulunan, nanosecond çözünürlüğe sahip, ücretsiz ve gerçek zamanlı bir kare profil oluşturucusudur ve kapsamlı özellikleri ve performansı ile övülmektedir.",
      "Tracy, otomatik örnekleme profilleyicilerinin aksine, kod tabanına makrolar eklemeyi gerektirir ve her makro yaklaşık 50 nanosaniye ek yük getirir.",
      "Tracy'nin ayrıntılı istatistik penceresini kullanıcılar takdir ediyor ve bazı kurulum zorlukları ve GPU uygulamalarıyla ilgili zorluklara rağmen, kapsamlı analiz için genellikle diğer profilleyicilerle birleştiriyorlar."
    ],
    "points": 152,
    "commentCount": 26,
    "retryCount": 0,
    "time": 1727146667
  },
  {
    "id": 41636038,
    "title": "Halide, fotoğraf çekme nedenini açıklamadığı için App Store'dan reddedildi",
    "originLink": "https://9to5mac.com/2024/09/24/halide-rejected-from-the-app-store-because-it-doesnt-explain-why-the-camera-takes-photos/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41636038",
    "commentBody": "",
    "originSummary": [
      "iPhone 16'nın makro fotoğrafçılık iyileştirmeleri, donanım değişikliklerinden ziyade yazılım geliştirmelerine daha fazla atfedilebilir.",
      "Bu, Apple'ın fotoğraf kalitesini artırmak için yazılım algoritmalarına odaklandığını ve önemli donanım yükseltmelerine ihtiyaç duymadan daha iyi makro çekimler sunabileceğini öne sürüyor.",
      "Yazılıma verilen önem, mevcut iPhone modellerinin de yazılım güncellemeleri aracılığıyla benzer iyileştirmelerden faydalanabileceği anlamına gelebilir."
    ],
    "commentSummary": [
      "Halide, popüler bir kamera uygulaması, fotoğraf çekme nedenini açıklamadığı için App Store'dan reddedildi ve bu durum, geliştiricilerin uygulama mağazası incelemelerinde karşılaştığı yaygın bir sorunu vurguladı.",
      "Yazılımcılar, Play Store ile ilgili olarak, var olmayan sorunlar nedeniyle reddedilmeler ve onay almak için veri koruma politikaları ekleme gerekliliği gibi benzer hayal kırıklıkları yaşamışlardır.",
      "Durum, uygulama mağazası inceleme süreçlerindeki karmaşıklıkları ve tutarsızlıkları vurguluyor, daha net yönergeler ve daha şeffaf politikalar için çağrılara yol açıyor, katı incelemelerin kullanıcı koruması için gerekli olduğu yönündeki argümanlara rağmen."
    ],
    "points": 132,
    "commentCount": 159,
    "retryCount": 0,
    "time": 1727182950
  },
  {
    "id": 41629923,
    "title": "Bir Ferroelektrik RAM Çipinin İçinde",
    "originLink": "http://www.righto.com/2024/09/ramtron-ferroelectric-fram-die.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41629923",
    "commentBody": "",
    "originSummary": [
      "Ken Shirriff'in blog yazısı, dayanıklılığı ve hızlı yazma yetenekleriyle bilinen uçucu olmayan bir bellek teknolojisi olan ferroelektrik RAM'i (FRAM) inceliyor.",
      "Avantajlarına rağmen, FRAM'ın yüksek üretim maliyetleri ve karmaşıklığı, kullanımını niş uygulamalarla sınırlamıştır; Ramtron'un 1999 FRAM çipi buna bir örnektir.",
      "Blog, FRAM'in tarihini, yapısını ve işleyişini detaylandırıyor ve umut verici olmasına rağmen yaygın olarak benimsenmesinin engellendiğini ve Ramtron'un sonunda Cypress Semiconductor tarafından satın alındığını belirtiyor."
    ],
    "commentSummary": [
      "Teksas Enstrümanları, bazı mikrodenetleyicilere güç olmadan verileri koruyan FRAM (Ferroelektrik RAM) entegre etti, bu flash bellekten farklıdır.",
      "FRAM, NVRAM ve EEPROM gibi diğer uçucu olmayan bellek türleriyle pin ve işlev uyumludur ve küçük kapasitelerde maliyet etkindir.",
      "Yıkıcı okumalara rağmen yeniden yazma gerektirse de, FRAM'in hızlı yazma hızı ve yüksek dayanıklılığı, onu endüstriyel kontrol sistemlerinde ve oyun konsolları gibi cihazlarda pil destekli SRAM'in yerine popüler hale getirir."
    ],
    "points": 132,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1727121963
  },
  {
    "id": 41635962,
    "title": "T hücrelerine ekstra pil vermek, onları kansere karşı süper şarj eder",
    "originLink": "https://newatlas.com/cancer/cancer-immunotherapy-t-cells-extra-batteries-supercharges/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41635962",
    "commentBody": "",
    "originSummary": [
      "Brigham ve Kadın Hastanesi'ndeki bilim insanları, kemik iliği stromal hücrelerinden (BMSC'ler) ek mitokondri sağlayarak, vücudun kansere karşı birincil savunması olan T hücrelerini güçlendirmek için bir yöntem geliştirdiler.",
      "Bu geliştirilmiş T hücreleri, Mito+ olarak adlandırılan, farelerde tümör penetrasyonunu iyileştirdi ve tümör boyutunu önemli ölçüde azalttı, tedavi edilen farelerin %75'i 60 günlük bir çalışmada hayatta kaldı.",
      "Bu atılım, Cell dergisinde yayımlandı ve hastaların bağışıklık hücrelerini daha etkili kanser tedavisi için güçlendirebilecek potansiyel yeni bir yaklaşımı öneriyor."
    ],
    "commentSummary": [
      "Araştırmacılar, T hücrelerine ekstra mitokondri eklemenin, kanserle mücadele yeteneklerini artırabileceğini keşfettiler.",
      "Çalışma, hücrelerdeki mitokondrilerin evrimsel dengesine dair sorular ortaya çıkarıyor, çünkü fazlalık reaktif oksijen türleri veya hücre ölümü gibi sorunlara yol açabilir.",
      "Bulgular, kesin mekanizmalar ve daha geniş etkiler hala araştırılmakta olsa da, yeni kanser tedavilerinin yolunu açabilir."
    ],
    "points": 127,
    "commentCount": 55,
    "retryCount": 0,
    "time": 1727182295
  }
]
