[
  {
    "id": 41629475,
    "title": "Lord Rayleigh brukte olje og vann til å beregne størrelsen på molekyler i 1870",
    "originLink": "https://www.atomsonly.news/p/franklin-oil",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41629475",
    "commentBody": "",
    "originSummary": [
      "Lord Rayleigh estimerte størrelsen på et enkelt molekyl ved å bruke et enkelt eksperiment med olje, vann og en penn, inspirert av Benjamin Franklins observasjoner fra 1770-årene.",
      "Rayleighs beregning av lengden på et oljemolekyl (1,63 nanometer) var bemerkelsesverdig nær moderne målinger (1,67 nanometer), noe som demonstrerer kraften i grunnleggende vitenskapelige metoder.",
      "Dette historiske eksperimentet understreker hvordan enkle teknikker kan føre til betydelige vitenskapelige oppdagelser, som beskrevet i Charles Tanfords bok, 'Ben Franklin Stilled the Waves.'"
    ],
    "commentSummary": [
      "Lord Rayleigh estimerte størrelsen på molekyler i 1870 ved å spre olje på vann og beregne tykkelsen på filmen, og antok at den dannet et enkelt molekylært lag.",
      "Denne metoden ble inspirert av Benjamin Franklins tidligere observasjoner.",
      "Historiske vitenskapelige prestasjoner som Roemers lysfartsestimering i 1676 og Millikans oljedråpeksperiment for å måle elektronets ladning viser hvordan enkle observasjoner kan føre til betydelige vitenskapelige innsikter."
    ],
    "points": 516,
    "commentCount": 176,
    "retryCount": 0,
    "time": 1727118494
  },
  {
    "id": 41636804,
    "title": "Winamp Legacy-spillerens kildekode",
    "originLink": "https://github.com/WinampDesktop/winamp",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41636804",
    "commentBody": "",
    "originSummary": [
      "Winamp, en multimediaspiller lansert i 1997, er nå åpen kildekode, noe som gjør det mulig for fellesskapet å modernisere koden.",
      "Å bygge Winamp desktop-klienten krever Visual Studio 2019 og Intel IPP v6.1.1.035, med to hovedbyggingsalternativer: ved å bruke et skript eller innenfor Visual Studio IDE.",
      "Avhengigheter inkluderer libvpx, libmpg123, OpenSSL, DirectX 9 SDK, Microsoft ATLMFC lib fix, og Intel IPP, som hver krever spesifikke modifikasjoner og utpakkingssteg."
    ],
    "commentSummary": [
      "Winamp Legacy-spillerens kildekode har blitt utgitt på GitHub med restriksjoner, inkludert ingen distribusjon av modifiserte versjoner, ingen forking, og kun offisielle vedlikeholdere kan distribuere modifikasjoner.",
      "Disse restriksjonene er i konflikt med GitHubs bruksvilkår, som tillater forking av offentlige repositorier, noe som fører til debatter om tolkningen av \"forking.\"",
      "Utgivelsen anses som \"kilde tilgjengelig\" i stedet for virkelig åpen kildekode, noe som resulterer i blandede reaksjoner fra teknologisamfunnet."
    ],
    "points": 453,
    "commentCount": 204,
    "retryCount": 0,
    "time": 1727188029
  },
  {
    "id": 41630913,
    "title": "Vi finjusterte Llama 405B på AMD GPUer",
    "originLink": "https://publish.obsidian.md/felafax/pages/Tune+Llama3+405B+on+AMD+MI300x+(our+journey)",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41630913",
    "commentBody": "",
    "originSummary": [
      "En oppstartsbedrift har finjustert LLaMA3.1 405B-modellen på 8xAMD MI300x GPUer ved å bruke JAX i stedet for PyTorch, og oppnådd betydelige ytelsesforbedringer.",
      "De gjorde koden sin åpen kildekode og delte sharding-teknikker, og fremhevet JAXs evne til å kompilere ML-modellkode til maskinvareuavhengige HLO-grafer optimalisert av XLA-kompilatoren.",
      "Denne tilnærmingen muliggjør sømløs kjøring av den samme koden på både Google TPUs og AMD GPUs, og løser utfordringer selskaper står overfor med PyTorchs dype bånd til NVIDIA-økosystemet."
    ],
    "commentSummary": [
      "En oppstartsbedrift har med suksess finjustert Llama 405B på AMD GPUer ved å bruke JAX i stedet for den mer vanlige PyTorch, og utnyttet JAXs avanserte sharding APIer for forbedret ytelse.",
      "JAXs maskinvareuavhengige HLO-grafer, optimalisert av XLA-kompilatoren, gjorde det mulig å kjøre den samme koden på både Google TPUs og AMD GPUs uten modifikasjoner, og løste en vanlig utfordring med PyTorchs dype integrasjon med NVIDIA-maskinvare.",
      "Oppstartsselskapet har gjort koden sin åpen kildekode og søker tilbakemelding på tilnærmingen og visjonen deres for AI-infrastruktur på ikke-NVIDIA maskinvare."
    ],
    "points": 434,
    "commentCount": 85,
    "retryCount": 0,
    "time": 1727127746
  },
  {
    "id": 41635592,
    "title": "OpenFreeMap – Åpen kildekode kartvertstjeneste",
    "originLink": "https://openfreemap.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41635592",
    "commentBody": "",
    "originSummary": [
      "Etter 9 år med utvikling har skaperen av MapHub gjort deres OpenStreetMap-flisserver åpen kildekode, nå kalt OpenFreeMap.",
      "OpenFreeMap lar brukere selv være vert eller bruke en offentlig instans, med alle komponenter som er fullstendig åpen kildekode og ingen 'open-core' modell.",
      "Prosjektet tilbyr ukentlige nedlastinger av hele planeten i Btrfs- og MBTiles-formater, og har som mål å dekke kostnadene for offentlige instanser gjennom donasjoner."
    ],
    "commentSummary": [
      "OpenFreeMap er en åpen kildekode kartvertstjeneste lansert av hyperknot etter 9 år med drift av en OpenStreetMap flisserver for MapHub.",
      "Brukere kan selv være vert eller bruke den offentlige instansen, med alle komponenter som er åpen kildekode og kartdata hentet fra OpenStreetMap.",
      "Ukentlige fullstendige planetnedlastinger er tilgjengelige i Btrfs- og MBTiles-formater, og prosjektet har som mål å dekke kostnadene for offentlige instanser gjennom donasjoner."
    ],
    "points": 425,
    "commentCount": 122,
    "retryCount": 0,
    "time": 1727179162
  },
  {
    "id": 41631130,
    "title": "iPhone 16 Pro Lagringsutvidelse 128GB til 1TB [video]",
    "originLink": "https://www.youtube.com/watch?v=KRRNR4HyYaw",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41631130",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "iPhone 16 Pro tilbyr nå lagringsutvidelse fra 128GB til 1TB, noe som vekker interesse blant teknologientusiaster og moddere.",
      "Videoen viser den tekniske ferdigheten som kreves for å bytte ut NAND-brikken, og fremhever presisjonen og stabiliteten som trengs for slike modifikasjoner.",
      "Diskusjoner dreier seg om hvorvidt bruk av NAND-brikker av høyere kvalitet kan forbedre ytelse og holdbarhet, samt den estetiske og designmessige kvaliteten på Apples maskinvare."
    ],
    "points": 372,
    "commentCount": 257,
    "retryCount": 0,
    "time": 1727129516
  },
  {
    "id": 41631912,
    "title": "WP Engine sendte et «cease and desist»-brev til Automattic",
    "originLink": "https://twitter.com/wpengine/status/1838350670564377051",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41631912",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "WP Engine utstedte et \"cease and desist\"-brev til Automattic, og anklaget CEO Matt Mullenweg for ærekrenkelse og utpressing over uttalelser gitt i en hovedtale.",
      "Angivelig hevdet Mullenweg at WP Engine utnytter WordPress-økosystemet og misbruker \"WP\"-varemerket, og krevde 40 millioner dollar for å unngå ytterligere negativ publisitet.",
      "Den hendelsen understreker de pågående spenningene angående bidrag til WordPress-utvikling og varemerkebruk, og deler fellesskapets meninger om begge parters praksis."
    ],
    "points": 252,
    "commentCount": 180,
    "retryCount": 0,
    "time": 1727137318
  },
  {
    "id": 41635583,
    "title": "Beveg deg raskt og forlat ting",
    "originLink": "https://engineersneedart.com/blog/movefast/movefast.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41635583",
    "commentBody": "",
    "originSummary": [
      "En utvikler har gitt ut en samling av gamle shareware-spill og uferdige prosjekter fra den tidlige Macintosh-æraen på GitHub, under navnet Soft Dorothy Software.",
      "Diskavbildningene kan brukes med 68K- eller PPC Mac-emulatorer som Basilisk II, Sheepshaver eller MiniVMac, slik at brukere kan utforske disse nostalgiske delene av programvarehistorien.",
      "Dette utgivelsen gir et unikt innblikk i spillutviklingsprosessen fra fortiden, og viser både fullførte og forlatte prosjekter, samtidig som den fremhever den iterative naturen til spilldesign."
    ],
    "commentSummary": [
      "Artikkelen \"Move Fast and Abandon Things\" understreker viktigheten av raskt å lage prototyper og forlate lite lovende prosjekter for å fremme innovasjon.",
      "Forfatteren antyder at universell grunninntekt (UBI) kan gjøre det mulig for flere mennesker å forfølge kreative sysler uten økonomiske begrensninger, noe som utløser en debatt blant kommentatorer om dens innvirkning på mental helse og kreativitet.",
      "Diskusjonen fremhever også balansen mellom å fullføre prosjekter og fordelene ved å fokusere på mindre, håndterbare oppgaver for å unngå fallgruvene ved å forlate prosjekter for raskt."
    ],
    "points": 222,
    "commentCount": 65,
    "retryCount": 0,
    "time": 1727179082
  },
  {
    "id": 41633155,
    "title": "Maker Pipe – Strukturelle rørkoblinger for gjør-det-selv-byggere",
    "originLink": "https://makerpipe.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41633155",
    "commentBody": "",
    "originSummary": [
      "Maker Pipe tilbyr et system med stålrørskoblinger designet for å gjøre EMT Conduit til en rimelig og allsidig byggeplattform, som kun krever enkelt håndverktøy for montering.",
      "Kontaktene er laget av slitesterkt stål, noe som sikrer styrke og pålitelighet for ulike gjør-det-selv-prosjekter, fra møbler til spesialtilpassede hyller.",
      "Tilbakemeldinger fra kunder fremhever produktets brukervennlighet, rimelighet og tilpasningsevne for et bredt spekter av kreative og praktiske bruksområder."
    ],
    "commentSummary": [
      "Maker Pipe tilbyr strukturelle rørkoblinger for DIY-byggere, med vekt på deres Make Pipe Minis for prototyping, som kan 3D-printes ved hjelp av nedlastbare STL-filer.",
      "Brukere sammenligner Maker Pipe med andre systemer som 80/20 og Kee Klamp, diskuterer fordeler og ulemper ved hver, og foreslår alternativer som EMT-rør, svart rør, unistrut eller ekstrudert aluminium for mer robuste prosjekter.",
      "Diskusjonen inkluderer praktisk anvendelse, tilgjengelighet og kvalitet på materialer og beslag for ulike gjør-det-selv-prosjekter."
    ],
    "points": 193,
    "commentCount": 104,
    "retryCount": 0,
    "time": 1727153010
  },
  {
    "id": 41632460,
    "title": "Dumpet appelsinskall forvandlet en gold beitemark (2017)",
    "originLink": "https://www.sciencealert.com/how-12-000-tonnes-of-dumped-orange-peel-produced-something-nobody-imagined",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41632460",
    "commentBody": "",
    "originSummary": [
      "På midten av 1990-tallet brukte et bevaringsprosjekt i Costa Rica 12 000 tonn avfall fra appelsinskall for å forvandle en øde beitemark til en frodig skog.",
      "Prosjektet, ledet av Princeton-forskere, ble stoppet på grunn av en rettssak, men ble gjenoppdaget i 2013, og avslørte en tett jungel med rikere jord og mangfoldige treslag.",
      "Prosjektets suksess, publisert i Restoration Ecology, antyder potensial for lignende bevaringsinnsatser, selv om de eksakte mekanismene fortsatt er uklare."
    ],
    "commentSummary": [
      "12 000 metriske tonn appelsinskall ble dumpet på degradert land i Costa Rica i 2017, noe som førte til en rettssak og en høyesterettsavgjørelse mot prosjektet.",
      "Etter 15 år viste studier at landet hadde forvandlet seg til et frodig, biologisk mangfoldig område, noe som utløste debatter om etikken og lovligheten av å bruke organisk avfall til miljørehabilitering.",
      "Tilfellet understreket de potensielle fordelene med organisk avfall i økosystemrestaurering, til tross for innledende juridiske og bedriftsmessige hindringer."
    ],
    "points": 190,
    "commentCount": 130,
    "retryCount": 0,
    "time": 1727143546
  },
  {
    "id": 41633400,
    "title": "Colocation: Ikke-klovne hosting",
    "originLink": "http://rachelbythebay.com/w/2024/09/23/colo/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41633400",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Diskusjonen dreier seg om colocation (colo)-tjenester, som innebærer å hoste servere i et tredjeparts datasenter i stedet for hjemme.",
      "Brukere deler ulike fargealternativer og tilbud, inkludert rabatter og personlige erfaringer med forskjellige leverandører.",
      "Diskusjonen fremhever fordeler og ulemper ved samlokalisering versus hjemmehosting, som pålitelighet, kostnader og tekniske utfordringer som CGNAT (Carrier-Grade Network Address Translation)."
    ],
    "points": 170,
    "commentCount": 165,
    "retryCount": 0,
    "time": 1727156367
  },
  {
    "id": 41629620,
    "title": "Telegram vil nå overlevere telefonnummer og IP for kriminelle mistenkte",
    "originLink": "https://www.theverge.com/2024/9/23/24252276/telegram-disclose-user-data-legal-requests-criminal-activity",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41629620",
    "commentBody": "",
    "originSummary": [
      "Telegram vil nå dele en brukers telefonnummer og IP-adresse med myndighetene hvis de er kriminelle mistenkte, i henhold til den oppdaterte personvernpolitikken.",
      "Denne policyendringen følger arrestasjonen av Telegram-sjef Pavel Durov, som ble siktet for å muliggjøre ulovlig aktivitet på plattformen.",
      "Telegram vil inkludere disse avsløringene i sine kvartalsvise gjennomsiktighetsrapporter og bruker AI for å fjerne problematisk innhold, sammen med endringer i sine modereringsretningslinjer."
    ],
    "commentSummary": [
      "Telegram vil nå dele telefonnumre og IP-adresser til kriminelle mistenkte med myndighetene, i samsvar med rettslige kjennelser.",
      "Til forskjell fra Signal, som samler inn minimal brukerdata, gjør mangelen på standard ende-til-ende-kryptering hos Telegram det mer utsatt for dataforespørsler.",
      "Dette vedtaket reiser pågående debatter om personvernproblemer og implikasjonene av overholdelse på tvers av internasjonale jurisdiksjoner."
    ],
    "points": 163,
    "commentCount": 121,
    "retryCount": 0,
    "time": 1727119715
  },
  {
    "id": 41632719,
    "title": "Tracy: En sanntids, nanosekund oppløsning rammeprofiler",
    "originLink": "https://github.com/wolfpld/tracy",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41632719",
    "commentBody": "",
    "originSummary": [
      "Tracy Profiler er en høyoppløselig, sanntidsprofiler designet for spill og andre applikasjoner, som støtter både CPU- og GPU-profilering på tvers av flere språk og grafikk-APIer.",
      "Den tilbyr omfattende funksjoner, inkludert sporing av minnetildeling, låseprofilering, overvåking av kontekstbytte og automatisk skjermbildeattribusjon til rammer.",
      "Verktøyets kapabiliteter og oppdateringer vises i ulike utgivelser og presentasjoner, inkludert CppCon 2023, med omfattende dokumentasjon og Windows x64-binærfiler tilgjengelig."
    ],
    "commentSummary": [
      "Tracy er en gratis, sanntids rammeprofiler med nanosekund oppløsning tilgjengelig på GitHub, rost for sine omfattende funksjoner og ytelse.",
      "Til forskjell fra automatiske prøvetakingsprofilerere, krever Tracy at makroer legges til i kodebasen, hvor hver makro introduserer omtrent 50 nanosekunder med overhead.",
      "Brukere setter pris på Tracys detaljerte statistikkvindu og kombinerer det ofte med andre profilere for omfattende analyse, til tross for noen oppsettsvansker og utfordringer med GPU-applikasjoner."
    ],
    "points": 152,
    "commentCount": 26,
    "retryCount": 0,
    "time": 1727146667
  },
  {
    "id": 41636038,
    "title": "Halide avvist fra App Store fordi det ikke forklarer hvorfor det tar bilder",
    "originLink": "https://9to5mac.com/2024/09/24/halide-rejected-from-the-app-store-because-it-doesnt-explain-why-the-camera-takes-photos/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41636038",
    "commentBody": "",
    "originSummary": [
      "iPhone 16s forbedringer innen makrofotografering kan tilskrives mer til programvareforbedringer enn maskinvareendringer.",
      "Dette antyder at Apple fokuserer på programvarealgoritmer for å forbedre bildekvaliteten, og potensielt tilby bedre makrobilder uten å trenge betydelige maskinvareoppgraderinger.",
      "Fokuset på programvare kan bety at eksisterende iPhone-modeller også kan dra nytte av lignende forbedringer gjennom programvareoppdateringer."
    ],
    "commentSummary": [
      "Halide, en populær kameraapp, ble avvist fra App Store for ikke å forklare hvorfor den tar bilder, noe som fremhever et vanlig problem utviklere står overfor med appanmeldelser.",
      "Utviklere har opplevd lignende frustrasjoner med Play Store, inkludert avvisninger for ikke-eksisterende problemer og behovet for å legge til databeskyttelsesregler for å få godkjenning.",
      "Situasjonen understreker kompleksitetene og inkonsekvensene i appbutikkens vurderingsprosesser, og fremkaller oppfordringer til klarere retningslinjer og mer transparente retningslinjer, til tross for argumenter om at strenge vurderinger er nødvendige for brukervern."
    ],
    "points": 132,
    "commentCount": 159,
    "retryCount": 0,
    "time": 1727182950
  },
  {
    "id": 41629923,
    "title": "Innenfor en ferroelektrisk RAM-brikke",
    "originLink": "http://www.righto.com/2024/09/ramtron-ferroelectric-fram-die.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41629923",
    "commentBody": "",
    "originSummary": [
      "Ken Shirriff's blogginnlegg utforsker ferroelektrisk RAM (FRAM), en ikke-flyktig minneteknologi kjent for sin holdbarhet og raske skriveegenskaper.",
      "Til tross for sine fordeler har FRAMs høye produksjonskostnader og kompleksitet begrenset bruken til nisjeapplikasjoner, med Ramtrons FRAM-brikke fra 1999 som et case-studie.",
      "Bloggen beskriver historien, strukturen og driften av FRAM, og bemerker at selv om den er lovende, har dens utbredte adopsjon blitt hindret, og Ramtron ble til slutt kjøpt opp av Cypress Semiconductor."
    ],
    "commentSummary": [
      "Texas Instruments har integrert FRAM (Ferroelectric RAM) i noen mikrokontrollere, som beholder data uten strøm, i motsetning til flashminne.",
      "FRAM er pinne- og funksjonskompatibel med andre typer ikke-flyktig minne som NVRAM og EEPROM, og er kostnadseffektiv i små kapasiteter.",
      "Til tross for destruktive lesninger som krever omskrivinger, gjør FRAMs raske skrivehastighet og høye utholdenhet det populært i industrielle kontrollsystemer og som en erstatning for batteristøttet SRAM i enheter som spillkonsoller."
    ],
    "points": 132,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1727121963
  },
  {
    "id": 41635962,
    "title": "Å gi T-celler ekstra batterier superlader dem mot kreft",
    "originLink": "https://newatlas.com/cancer/cancer-immunotherapy-t-cells-extra-batteries-supercharges/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41635962",
    "commentBody": "",
    "originSummary": [
      "Forskere ved Brigham and Women’s Hospital har utviklet en metode for å forbedre T-celler, kroppens primære forsvar mot kreft, ved å tilføre dem ekstra mitokondrier fra benmargstromaceller (BMSCs).",
      "Disse forbedrede T-cellene, kalt Mito+, viste forbedret tumorpenetrasjon og betydelig redusert tumorstørrelse hos mus, med 75 % av de behandlede musene som overlevde en 60-dagers studie.",
      "Dette gjennombruddet, publisert i tidsskriftet Cell, antyder en potensiell ny tilnærming for å styrke pasientenes immunceller for mer effektiv kreftbehandling."
    ],
    "commentSummary": [
      "Forskere oppdaget at tilskudd av T-celler med ekstra mitokondrier kan forbedre deres evne til å bekjempe kreft.",
      "Studien reiser spørsmål om den evolusjonære balansen av mitokondrier i celler, da et overskudd kan føre til problemer som reaktive oksygenarter eller celledød.",
      "Disse funnene kan bane vei for nye kreftbehandlinger, selv om de nøyaktige mekanismene og bredere implikasjoner fortsatt er under etterforskning."
    ],
    "points": 127,
    "commentCount": 55,
    "retryCount": 0,
    "time": 1727182295
  }
]
