[
  {
    "id": 41444700,
    "title": "ReMarkable Paper Pro",
    "originLink": "https://remarkable.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41444700",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "ReMarkable 2:n käyttäjät ilmaisevat tyytymättömyytensä hitaiden ohjelmistopäivitysten ja laitteisto-ongelmien huonon käsittelyn vuoksi, mikä on saanut osan siirtymään kilpailijoiden, kuten Supernoten ja Booxin, käyttäjiksi.",
      "reMarkable 2:n keskittyminen näppäimistön käyttöön on turhauttanut käyttäjiä, jotka käyttävät sitä pääasiassa käsinkirjoittamiseen, sillä monet päivitykset ovat tiettävästi heikentäneet kynän käyttökokemusta.",
      "Vaihtoehdot, kuten Boox Note Air 2 Plus ja Supernote A5X, saavat kiitosta paremmasta ohjelmistotuesta, lisäominaisuuksista ja yleisestä käyttökokemuksesta."
    ],
    "points": 419,
    "commentCount": 380,
    "retryCount": 0,
    "time": 1725451647
  },
  {
    "id": 41445413,
    "title": "Ilya Sutskeverin SSI Inc kerää miljardi dollaria",
    "originLink": "https://www.reuters.com/technology/artificial-intelligence/openai-co-founder-sutskevers-new-safety-focused-ai-startup-ssi-raises-1-billion-2024-09-04/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41445413",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Ilya Sutskeverin SSI Inc on kerännyt miljardin dollarin rahoituksen, mikä on herättänyt keskustelua tekoälyinvestointien toteutettavuudesta ja liiketoimintasuunnitelmista.",
      "Investoinnin tavoitteena on kehittää superälykkyyttä, ja joidenkin arvioiden mukaan se voisi mullistaa aloja, kuten lääketeollisuuden, mahdollisesti parantaen sairauksia ja saavuttaen 2 biljoonan dollarin arvon.",
      "Skeptisyyttä on olemassa superälykkyyden saavuttamisen aikataulusta ja käytännöllisyydestä, ja sitä verrataan historiallisiin teknologisiin investointeihin ja Manhattan-projektiin."
    ],
    "points": 316,
    "commentCount": 328,
    "retryCount": 0,
    "time": 1725455875
  },
  {
    "id": 41442490,
    "title": "State of S3 – Kannettavasi ei ole enää kannettava – henkilökohtainen purkaus",
    "originLink": "https://blog.jeujeus.de/blog/hardware/laptops-will-not-sleep-anymore/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41442490",
    "commentBody": "",
    "originSummary": [
      "Artikkeli käsittelee siirtymistä S3-valmiustilasta S0 \"moderniin valmiustilaan\" nykyaikaisissa kannettavissa tietokoneissa, tuoden esiin merkittäviä ongelmia uuden standardin kanssa.",
      "S0ix, jonka tarkoituksena on tarjota parempia energiansäästöjä, epäonnistuu usein aiheuttaen ylikuumenemista ja akun tyhjenemistä, mikä vaikuttaa sekä Linux- että Windows-käyttäjiin.",
      "Kirjoittaja ehdottaa, että kuluttajat ilmaisevat tyytymättömyytensä valitsemalla kannettavia tietokoneita, jotka edelleen tukevat perinteistä S3-valmiustilaa."
    ],
    "commentSummary": [
      "Moderni valmiustila (S0) korvaa perinteisen lepotilan (S3) kannettavissa tietokoneissa, mikä johtaa ongelmiin, kuten ylikuumenemiseen ja akun tyhjenemiseen.",
      "Käyttäjät kritisoivat valmistajia S3-tuen poistamisesta, mikä tekee kannettavista tietokoneista epäluotettavia lepotilassa ja jakavat kiertotapoja ja turhautumisiaan.",
      "Keskustelussa korostetaan modernin valmiustilan vaikutusta akun kestoon, turvallisuuteen ja käyttökokemukseen, ja jotkut ehdottavat siirtymistä MacBookeihin paremman lepotilan toiminnallisuuden vuoksi."
    ],
    "points": 276,
    "commentCount": 271,
    "retryCount": 0,
    "time": 1725431271
  },
  {
    "id": 41438060,
    "title": "Mondragon uutena kaupunkivaltiona",
    "originLink": "https://www.elysian.press/p/mondragon-as-the-new-city-state",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41438060",
    "commentBody": "",
    "originSummary": [
      "Mondragon Corporation, maailman suurin työntekijöiden osuuskuntien ryhmä, toimii kuin liittovaltio, johon kuuluu 84 osuuskuntaa. Viime vuonna se ansaitsi 11 miljardia euroa ja työllisti yli 70 500 työntekijää.",
      "Vuonna 1956 Baskimaassa perustetun Mondragonin demokraattinen rakenne antaa työntekijöille mahdollisuuden äänestää johtajuudesta ja voitonjaosta, mikä edistää korkeampia tuloja ja tasa-arvoa alueella.",
      "Yhteistoimintamalli varmistaa työpaikkojen turvallisuuden siirtämällä työntekijöitä verkoston sisällä taloudellisten laskusuhdanteiden aikana ja tukee työntekijöiden koulutusta ja yrittäjyyttä, tarjoten menestyksekkään vaihtoehdon perinteiselle kapitalismille."
    ],
    "commentSummary": [
      "Mondragonin osuustoimintamalli sai alkunsa baskien solidaarisuudesta ja Francon sortotoimista, mutta jotkut osuuskunnat, kuten Fagor, ovat epäonnistuneet, mikä herättää kysymyksiä sen tehokkuudesta.",
      "Kriitikot väittävät, että Mondragonin poliittinen luonne ja suojelusverkostot saattavat estää sen menestystä, ja vertailut italialaisiin osuuskuntiin viittaavat siihen, että vähemmän keskittyneet mallit saattavat olla tehokkaampia.",
      "Kasvava kiinnostus kapitalismin vaihtoehtoihin, mukaan lukien teknologiaosuuskunnat, tuo esiin haasteita, kuten kyvyn houkutella lahjakkuuksia ja ylläpitää demokraattista hallintoa."
    ],
    "points": 200,
    "commentCount": 256,
    "retryCount": 0,
    "time": 1725390386
  },
  {
    "id": 41441041,
    "title": "Haastattelu Tim Sweeneyn ja Neal Stephensonin kanssa",
    "originLink": "https://www.matthewball.co/all/sweeneystephenson",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41441041",
    "commentBody": "",
    "originSummary": [
      "Tim Sweeney, Epic Gamesin toimitusjohtaja, ja Neal Stephenson, \"Snow Crash\" -kirjan kirjoittaja, keskustelivat Metaversen määritelmistä ja visioista, korostaen sen kasvua ja tulevaisuuden potentiaalia.",
      "Sweeney ja Stephenson olivat yhtä mieltä siitä, että vaikka VR-lasit eivät ole välttämättömiä Metaverselle, parempi laitteisto parantaa käyttäjäkokemuksia, ja immersiiviset pelit kuten Fortnite ja Roblox menestyvät.",
      "Haastattelussa käsiteltiin erilaisia aiheita, kuten lohkoketjuteknologiaa, tekoälyn etiikkaa ja Fortniten tulevaisuutta, korostaen reaaliaikaisen 3D-pelaamisen kehittyvää maisemaa ja eettisen tekoälyn käytön tärkeyttä."
    ],
    "commentSummary": [
      "Tim Sweeney ja Neal Stephenson haastateltiin, mikä herätti keskusteluja Stephensonin laajasta tuotannosta ja hänen koetusta väsymyksestään puhua vanhemmasta kirjastaan, \"Snow Crash.\"",
      "Keskustelu toi esiin Metaversen kehittyvän käsitteen, korostaen käyttäjien luomia 3D-maailmoja, joissa ihmiset ovat vuorovaikutuksessa avatarien kautta, esimerkkeinä Roblox ja Fortnite.",
      "Mainittiin avoimen lähdekoodin Metaverse-projekti nimeltä Substrata, joka sisältää yhden päämaailman täynnä käyttäjien luomaa sisältöä ja mahdollisuuden käyttää Ethereum NFT:itä maan kaupankäyntiin."
    ],
    "points": 186,
    "commentCount": 142,
    "retryCount": 0,
    "time": 1725413823
  },
  {
    "id": 41439983,
    "title": "llms.txt",
    "originLink": "https://llmstxt.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41439983",
    "commentBody": "",
    "originSummary": [
      "Jeremy Howard ehdottaa standardoitua /llms.txt-tiedostoa, joka tarjoaa olennaista tietoa muodossa, joka on helposti saatavilla suurille kielimalleille (LLM:ille).",
      "Tiedosto /llms.txt, joka on kirjoitettu markdown-muodossa, sijaitsisi verkkosivuston juurihakemistossa ja sisältäisi jäsenneltyjä osioita, kuten projektin nimi, yhteenveto, yksityiskohtaiset tiedot ja linkit.",
      "Tämä ehdotus pyrkii täydentämään olemassa olevia standardeja, kuten robots.txt ja sitemap.xml, parantaen LLM:ien kykyä käsitellä verkkosivustojen sisältöä tehokkaasti."
    ],
    "commentSummary": [
      "Ehdotus uudesta tiedostosta, llms.txt, pyrkii auttamaan kielimalleja (LLM) ymmärtämään paremmin verkkosivustojen sisältöä, mikä on herättänyt keskustelua llmstxt.org-sivustolla.",
      "Huolenaiheisiin kuuluu koneen käytettävyyden asettaminen etusijalle ihmisen käyttökokemuksen sijaan sekä mahdollisuus manipulointiin tai päällekkäisyyteen olemassa olevien metatietoratkaisujen kanssa.",
      "Keskusteluissa korostetaan myös standardoitujen polkujen, kuten /.well-known/, merkitystä ja laajempia vaikutuksia, kun verkkosisältöä tehdään helpommin saatavilla LLM:ille, mukaan lukien mahdollinen väärinkäyttö sekä ihmisten ja koneiden tarpeiden tasapainottaminen."
    ],
    "points": 184,
    "commentCount": 154,
    "retryCount": 0,
    "time": 1725402631
  },
  {
    "id": 41441159,
    "title": "Tuomari estää FTC:tä panemasta täytäntöön kilpailukieltosopimusten kiellon",
    "originLink": "https://www.computerworld.com/article/3496192/court-handcuffs-employees-with-non-compete-agreements-again.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41441159",
    "commentBody": "",
    "originSummary": [
      "Äskettäinen oikeuden päätös on palauttanut voimaan kilpailukieltosopimukset, kumoten FTC:n kiellon ja rajoittaen työntekijöiden työpaikkaliikkuvuutta ja palkkakehitystä.",
      "Piirituomari Ada Brown päätti, että FTC ylitti toimivaltansa, korostaen, että vain kongressi tai osavaltiot voivat säädellä kilpailukieltolausekkeita.",
      "Päätös heijastaa konservatiivista muutosta, joka rajoittaa liittovaltion virastojen valtuuksia, ja siihen on vaikuttanut korkeimman oikeuden äskettäinen Loper Bright -päätös, joka rajoittaa virastojen valtuuksia ja jättää politiikan tulkinnan tuomareille."
    ],
    "commentSummary": [
      "Tuomari on keskeyttänyt FTC:n täytäntöönpanon kilpailukieltosopimusten kiellosta, mikä on käynnistänyt keskustelun niiden tarpeellisuudesta ja mahdollisesta väärinkäytöstä korkeiden johtotehtävien ulkopuolella.",
      "Kriitikot väittävät, että kongressin, ei toimeenpanoelinten, tulisi säätää kilpailukieltosopimuksista, korostaen huolia vallan tasapainosta toimeenpano- ja oikeuslaitoksen välillä.",
      "Ratkaisu on herättänyt merkittäviä kysymyksiä työkäytäntöjen sääntelyn asianmukaisista mekanismeista ja eri hallinnon haarojen roolista tällaisissa päätöksissä."
    ],
    "points": 173,
    "commentCount": 178,
    "retryCount": 0,
    "time": 1725415295
  },
  {
    "id": 41448022,
    "title": "Dynaaminen maa 2024",
    "originLink": "https://dynamicland.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41448022",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Dynaaminen maa 2024, Bret Victorin johdolla, pyrkii mullistamaan tietojenkäsittelyn tekemällä ohjelmista fyysisiä esineitä, parantaen saavutettavuutta ja yhteistyötä.",
      "Projekti on tällä hetkellä rajoitettu tiettyihin tiloihin eikä ole avoimen lähdekoodin, mutta samankaltaisia järjestelmiä on saatavilla kokeilua varten.",
      "Tavoitteena on tehdä tietotekniikasta yhtä intuitiivista ja arkipäivään integroitunutta kuin sähkövalo."
    ],
    "points": 167,
    "commentCount": 54,
    "retryCount": 0,
    "time": 1725469334
  },
  {
    "id": 41446428,
    "title": "Debianin turvattomuus",
    "originLink": "https://unix.foo/posts/insecurity-of-debian/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41446428",
    "commentBody": "",
    "originSummary": [
      "Kesäkuussa 2023 Red Hat muutti Red Hat Enterprise Linux (RHEL) -lähdekoodin jakelua, mikä aiheutti kiistaa ja epävarmuutta alavirran uudelleenrakennuksille, kuten Rocky Linux, AlmaLinux ja Oracle Linux.",
      "Avoimen lähdekoodin yhteisö kritisoi Red Hatin päätöstä, ja jotkut harkitsivat siirtymistä Debianiin, vaikka Debianin tietoturvatoimenpiteet eivät ole yhtä kattavat kuin Red Hatin SELinux.",
      "SELinux, jota Red Hat käyttää, tarjoaa vankkaa turvallisuutta oletuskäytäntöjen ja Multi-Category Security (MCS) -tunnisteiden avulla, kun taas Debianin AppArmor on yksinkertaisempi mutta vähemmän kattava ja perustuu käyttäjän toteuttamiin käytäntöihin."
    ],
    "commentSummary": [
      "Keskustelussa verrataan Debianin ja Red Hatin turvallisuutta, keskittyen SELinuxiin ja AppArmooriin.",
      "Red Hatin käyttämä SELinux on usein käyttäjien poistama käytöstä sen monimutkaisuuden vuoksi, huolimatta sen turvallisuuseduista, kun taas Debianin AppArmoria pidetään vähemmän rajoittavana ja helpompana käyttää.",
      "Väittelyssä korostuu tasapaino turvallisuuden ja käytettävyyden välillä, kun jotkut käyttäjät suosivat Debiania sen joustavuuden vuoksi ja toiset suosivat Red Hatia sen vankkojen turvatoimien takia."
    ],
    "points": 158,
    "commentCount": 137,
    "retryCount": 0,
    "time": 1725461200
  },
  {
    "id": 41445209,
    "title": "Pieni asteroidi osuu Maan ilmakehään tänään",
    "originLink": "https://earthsky.org/space/small-asteroid-hit-earth-philippines-sept-4-5-2024/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41445209",
    "commentBody": "",
    "originSummary": [
      "Pieni asteroidi, 2024 RW1, iskeytyi Maan ilmakehään Lao-Lun yläpuolella Cagayanissa, Filippiineillä, 4. syyskuuta 2024, luoden vihreän tulipallon ilman raportoituja vahinkoja.",
      "Asteroidi löydettiin vain kahdeksan tuntia ennen törmäystä Jacqueline Fazekasin toimesta Catalina Sky Survey -ohjelmassa, mikä merkitsi yhdeksättä kertaa, kun asteroidi havaittiin ennen osumistaan Maahan.",
      "Tapahtuma korostaa edistysaskeleita planeettapuolustuksessa, Euroopan avaruusjärjestön ja NASA:n Planeettapuolustuksen koordinointitoimiston valvonnassa, ja tuo esiin yhteisön osallistumisen, kun monet filippiiniläiset tallensivat ja jakoivat kuvamateriaalia."
    ],
    "commentSummary": [
      "Pieni asteroidi odotetaan saapuvan Maan ilmakehään tänään, mutta se on vaaraton ja todennäköisesti palaa loppuun, luoden tulipallon.",
      "NASAn NEO Surveyor -projekti ja muut teleskoopit, kuten Vera Rubinin LSST, tulevat merkittävästi lisäämään asteroidien havaitsemisnopeutta tulevina vuosina.",
      "Tämä tapahtuma merkitsee vasta yhdeksättä kertaa, kun asteroidi on löydetty ennen sen törmäämistä Maahan, mikä korostaa havaintokyvyn parantumista."
    ],
    "points": 158,
    "commentCount": 92,
    "retryCount": 0,
    "time": 1725455027
  },
  {
    "id": 41446766,
    "title": "Intel Rehellisyys",
    "originLink": "https://stratechery.com/2024/intel-honesty/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41446766",
    "commentBody": "",
    "originSummary": [
      "Intel'in lasku johtuu sen epäonnistumisesta siirtyä 10nm teknologiaan ja haluttomuudesta ottaa käyttöön Extreme Ultraviolet (EUV) litografiaa, mikä on antanut kilpailijoille kuten TSMC ja AMD mahdollisuuden ohittaa sen.",
      "Toimitusjohtaja Pat Gelsingerin IDM 2.0 -suunnitelma pyrki erottamaan valmistuksen, mutta pitämään sen Intelin alaisuudessa; kuitenkin Intel harkitsee nyt tuote-suunnittelu- ja valmistusliiketoimintojensa erottamista.",
      "Yhdysvaltojen saattaa olla tarpeen tukea muita kuin taiwanilaisia valmistusvaihtoehtoja, mahdollisesti ostotakuilla, varmistaakseen Intelin elinkelpoisuuden valimona, sillä teknologia-ala on suurelta osin siirtynyt eteenpäin Intelistä."
    ],
    "commentSummary": [
      "Intel kohtaa merkittäviä taloudellisia haasteita, mukaan lukien massiiviset velanmaksut ja heikko osakekurssi, mikä johtaa palkkojen pysähtymiseen ja vaikeuksiin houkutella huippuosaajia.",
      "Korkea elinkustannus Bay Area -alueella tekee Intelistä vähemmän houkuttelevan verrattuna kilpailijoihin, kuten TSMC Taiwanissa, huolimatta korkeammista palkoista.",
      "Jatkuvat irtisanomiset ja vastustus palkankorotuksia kohtaan edistävät laskukierrettä, jolloin yritys saattaa tarvita uutta johtoa ja tukeutua CHIPS-lakiin ja valtion tukeen käänteen aikaansaamiseksi."
    ],
    "points": 154,
    "commentCount": 101,
    "retryCount": 0,
    "time": 1725462949
  },
  {
    "id": 41440842,
    "title": "Nopeampi kokonaislukujen ohjelmointi",
    "originLink": "https://cacm.acm.org/news/faster-integer-programming/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41440842",
    "commentBody": "",
    "originSummary": [
      "Victor Reis ja Thomas Rothvoss ovat todistaneet, että kaikki kokonaislukuiset ohjelmat voidaan teoreettisesti ratkaista paljon nopeammin kuin aiemmin taattiin, perustuen Daniel Dadushin algoritmiin.",
      "Uusi todiste vähentää kokonaislukujen lineaaristen ohjelmien ratkaisemiseen tarvittavan vähimmäisajan (log n)O(n):ään, mikä merkitsee merkittävää teoreettista edistysaskelta.",
      "Huolimatta läpimurrosta, käytännön toteutus on edelleen haastavaa suurten muistivaatimusten ja tehottomien aliohjelmien vuoksi, mikä edellyttää lisätutkimusta todellisen maailman sovellettavuuden saavuttamiseksi."
    ],
    "commentSummary": [
      "Keskustelu keskittyy kokonaislukusuunnittelun ratkaisijoiden tehokkuuteen ja soveltamiseen, erityisesti teollisuuden mittakaavan ongelmissa, joissa on miljoonia muuttujia ja rajoitteita.",
      "Keskeisiä kohtia ovat työkalujen, kuten FICO Xpressin, Gurobin ja CPLEX:n, käyttö, joista Gurobi on tunnettu vaikuttavasta suorituskyvystään ja ilmaisesta akateemisesta käytöstä.",
      "Keskustelu koskettaa myös sekalukujen ohjelmointiongelmien ratkaisemisen haasteita ja avoimen lähdekoodin ratkaisijoiden, kuten HiGHS:n, potentiaalia."
    ],
    "points": 150,
    "commentCount": 41,
    "retryCount": 0,
    "time": 1725411551
  },
  {
    "id": 41438107,
    "title": "Howm: Henkilökohtainen wiki Emacsille",
    "originLink": "https://github.com/Emacs101/howm-manual",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41438107",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "\"Howm\" (Handy Own Wiki Mode) on henkilökohtainen wiki-järjestelmä Emacsille, joka edeltää Org-modea ja tarjoaa ainutlaatuisia ominaisuuksia, kuten \"comefrom-linkit\" ja syntaktista sokeria hakuihin.",
      "Kayttäjät arvostavat Howm:ia sen yksinkertaisuuden, itsejärjestäytymisen ja yhteensopivuuden vuoksi Org-tiedostojen kanssa, mikä tekee siitä suositumman valinnan kuin uudemmat järjestelmät, kuten Org Roam ja Denote.",
      "Yhteisö keskustelee aktiivisesti kokoonpanoista, työnkuluista ja vianmäärityksestä, mikä osoittaa uudistunutta kiinnostusta ja jatkuvaa ylläpitoa Howmille."
    ],
    "points": 149,
    "commentCount": 40,
    "retryCount": 0,
    "time": 1725390686
  },
  {
    "id": 41443336,
    "title": "Firefox harkitsee JPEG-XL:n Rust-toteutusta",
    "originLink": "https://github.com/mozilla/standards-positions/pull/1064",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41443336",
    "commentBody": "",
    "originSummary": [
      "Mozilla tutkii JPEG-XL:n Rust-toteutusta Firefoxille korvatakseen nykyisen C++-dekooderin, jolla on suuri hyökkäyspinta.",
      "Google Researchin tehtävänä on kehittää turvallinen, suorituskykyinen ja kompaktin kokoinen Rust-dekooderi mahdollisten muistiturvallisuusongelmien lieventämiseksi.",
      "Pull-pyyntö tälle toteutukselle on tarkistettu, hyväksytty ja yhdistetty päähaaraan, mikä osoittaa edistystä mahdollisen käyttöönoton suuntaan."
    ],
    "commentSummary": [
      "Firefox tutkii JPEG-XL:n Rust-toteutusta Googlen tuella luodakseen turvallisen, suorituskykyisen ja yhteensopivan dekooderin.",
      "On olemassa oleva Rust-dekooderi, jxl-oxide, mutta se ei välttämättä ole tarpeeksi kypsä tai suorituskykyinen, mikä on herättänyt keskusteluja siitä, pitäisikö sitä tukea vai aloittaa alusta.",
      "JPEG-XL tarjoaa etuja, kuten paremman pakkauksen, parannetun laadun ja merkittävät kaistanleveyssäästöt, mikä tekee siitä houkuttelevan valinnan nykyaikaisille verkkosovelluksille."
    ],
    "points": 136,
    "commentCount": 59,
    "retryCount": 0,
    "time": 1725439477
  },
  {
    "id": 41438162,
    "title": "OpenAI vetoaa, ettei se voi ansaita rahaa ilman tekijänoikeudella suojattujen materiaalien ilmaista käyttöä",
    "originLink": "https://futurism.com/the-byte/openai-copyrighted-material-parliament",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41438162",
    "commentBody": "",
    "originSummary": [
      "OpenAI on pyytänyt Britannian parlamentilta lupaa käyttää tekijänoikeudella suojattua materiaalia tekoälymalliensa kouluttamiseen, väittäen, että julkisen sektorin sisältö ei riitä suurten kielimallien (LLM) kehittämiseen.",
      "Yhtiö väittää noudattavansa tekijänoikeuslakeja, mutta kohtaa vastustusta, mukaan lukien oikeusjutut The New York Timesilta ja The Authors Guildilta, jotka väittävät, että tekijänoikeudella suojatun materiaalin käyttö ilman korvausta vahingoittaa luojia.",
      "OpenAI etsii uusia kumppanuuksia kustantajien kanssa, mutta tällaisten yhteistyökuvioiden hyväksyminen on vielä epävarmaa."
    ],
    "commentSummary": [
      "OpenAI väittää, että tekijänoikeudella suojatun materiaalin ilmainen käyttö on olennaista sen tekoälymallien kouluttamisessa, mikä herättää keskustelua tämän käytännön laillisuudesta ja eettisyydestä.",
      "Kriitikot väittävät, että OpenAI:n laajentuminen perustui oikeudellisesti kyseenalaisiin menetelmiin ja kohtaa nyt korkeita liiketoimintakustannuksia, mikä viittaa siihen, että sen tulisi keskittyä näytteenoton tehokkuuteen ja tekijänoikeusvapaaseen dataan.",
      "Kiista korostaa jatkuvaa jännitettä teknologisen innovaation ja immateriaalioikeuksien välillä, ja siihen liittyy vaatimuksia tekijänoikeusreformista ja luojien oikeuksien suojelusta."
    ],
    "points": 123,
    "commentCount": 171,
    "retryCount": 0,
    "time": 1725390992
  }
]
