[
  {
    "id": 38069710,
    "title": "Yanlışlıkla şirketime yarım milyon dolar kazandırdım",
    "originLink": "https://ludic.mataroa.blog/blog/i-accidentally-saved-half-a-million-dollars/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38069710",
    "commentBody": "",
    "originSummary": [
      "Yazar, analitik platformlarındaki bir verimsizliği tespit edip çözerek şirketlerine farkında olmadan sadece beş dakika içinde 500.000 dolar kazandırdı.",
      "Platform, teknik borç ve karmaşık süreçler nedeniyle kaotik ve verimsiz olarak tanımlanıyordu; başlangıçta kuruluş için gelir yaratması amaçlanmamıştı.",
      "Yazar, önemli bir olumlu etki yaratmasına rağmen, yönetim tarafından takdir edilmediğini ve cezalandırıldığını hissettiğini ifade ediyor."
    ],
    "commentSummary": [
      "Hacker News tartışması öncelikle zehirli çalışma kültürü ve işin takdir edilmemesi gibi işyeri sorunlarına odaklanmaktadır.",
      "Çeşitli sektörlerdeki bireylerden gelen ortak deneyimler, hayal kırıklıkları ve iyileştirme önerileri var.",
      "Diğer tartışma noktaları da büyük kuruluşlardaki verimsizliklere ve bazı veritabanı yönetim sistemleriyle ilişkili yüksek maliyetlere değinmektedir."
    ],
    "points": 909,
    "commentCount": 396,
    "retryCount": 0,
    "time": 1698675307
  },
  {
    "id": 38078063,
    "title": "Apple M3, M3 Pro ve M3 Max'i tanıttı",
    "originLink": "https://www.apple.com/newsroom/2023/10/apple-unveils-m3-m3-pro-and-m3-max-the-most-advanced-chips-for-a-personal-computer/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38078063",
    "commentBody": "",
    "originSummary": [
      "Apple, MacBook Pro ve iMac için özel olarak tasarlanan ve en gelişmiş kişisel bilgisayar özelliklerine sahip yeni M3, M3 Pro ve M3 Max çiplerini piyasaya sürdü.",
      "Bu çipler CPU ve GPU performansında, bellek desteğinde yükseltmeler sunuyor ve gelişmiş yapay zeka ve video işleme özelliklerine sahip.",
      "Grafik mimarisinde bir sıçrama yapan M3 ailesi, Apple'ın sürdürülebilirlik ve enerji verimliliğine olan bağlılığını da teyit ediyor."
    ],
    "commentSummary": [
      "Tartışma öncelikle Apple'ın yeni M3 işlemcilerine odaklanıyor, performanslarını önceki sürümlerle ve rakip markalarla karşılaştırıyor ve MacBook Pro'nun donanım özelliklerindeki kısıtlamaları inceliyor.",
      "Konuşma, Apple cihazlarının parasal değerini analiz ediyor ve daha yeni modellere yükseltme veya mevcut olanlarla kalma kararını tartıyor.",
      "Ayrıca, Apple'ın iş performansı, donanım dışı ürünlere açılımı, potansiyel güvenlik sorunları ve bazı kullanıcıların yeni teknolojileri benimseme konusundaki tereddütleri de inceleniyor."
    ],
    "points": 636,
    "commentCount": 693,
    "retryCount": 0,
    "time": 1698712214
  },
  {
    "id": 38074992,
    "title": "Gmail ve Yahoo, toplu göndericiler için yeni 2024 kimlik doğrulama gereksinimlerini duyurdu",
    "originLink": "https://blog.google/products/gmail/gmail-security-authentication-spam-protection/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38074992",
    "commentBody": "",
    "originSummary": [
      "Gmail, e-posta güvenliğini güçlendirmek ve istenmeyen postaları azaltmak amacıyla toplu göndericilerin e-postaları doğrulaması, kolay abonelikten çıkma seçeneklerini etkinleştirmesi ve bildirilen Spam eşiği içinde kalması için yeni şartlar getiriyor.",
      "Şubat 2024'ten itibaren yeni değişiklikler, göndericilerin uyum sağlamasına yardımcı olmak için sağlanan rehberlik ile uygulanacaktır.",
      "Yapılan düzenlemeler sektör ortakları tarafından desteklenmekte ve güvenli, spam içermeyen bir e-posta ortamı sağlamak için işbirliğine dayalı çabalara duyulan ihtiyacı vurgulamaktadır."
    ],
    "commentSummary": [
      "Tartışmaların konusu spam e-postalar, posta listelerinden abonelikten çıkmanın zorluğu ve spam e-postalarla ilişkili potansiyel risklerdir.",
      "Abonelikten çıkmanın çeşitli yollarının etkinliği, spam e-postaların yasallığı ve e-posta filtreleri ve onay konularıyla ilgili zorluklar etrafında tartışmalar var.",
      "Bazı kullanıcılar, e-posta hizmet sağlayıcılarının spam filtreleme sistemlerinden memnuniyetsizliklerini dile getirerek, kullanıcıların ve yasal toplu göndericilerin karşılaştığı zorlukları vurgulamaktadır."
    ],
    "points": 481,
    "commentCount": 352,
    "retryCount": 0,
    "time": 1698696427
  },
  {
    "id": 38074701,
    "title": "İngilizce telaffuzunuzu geliştirmek için YouTube'u kullanın",
    "originLink": "https://youglish.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38074701",
    "commentBody": "",
    "originSummary": [
      "YouGlish, YouTube videolarını pratik örnekler olarak kullanarak İngilizce telaffuzu geliştiren yenilikçi bir araçtır.",
      "Bu platform, gerçek insanlardan çeşitli durumlarda ve bağlamlarda İngilizce kullanımını sergileyerek gerçek dünya deneyimi sağlar.",
      "Çoklu dil desteğine ve gelişmiş arama özelliğine sahip olması, kullanılabilirliğini ve kullanıcı katılımını genişletiyor."
    ],
    "commentSummary": [
      "Makale, ana dili İngilizce olmayanların İngilizce telaffuzda karşılaştıkları zorlukları vurgulamakta ve telaffuz becerilerini geliştirmek için YouTube, Youglish ve BoldVoice gibi araçların kullanılmasını önermektedir.",
      "Tartışmada, kullanıcılar bu kaynakların etkinliğini ve belirli kelimelerin ve yer adlarının telaffuzunu tartışmaktadır.",
      "Konuşmadaki önemli bir tartışma noktası, dil öğreniminde doğru telaffuz ve aksanın gramer doğruluğu karşısındaki göreceli önemidir."
    ],
    "points": 450,
    "commentCount": 251,
    "retryCount": 0,
    "time": 1698695230
  },
  {
    "id": 38069197,
    "title": "Özel sermaye ABD ekonomisini yutuyor",
    "originLink": "https://www.theatlantic.com/ideas/archive/2023/10/private-equity-publicly-traded-companies/675788/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38069197",
    "commentBody": "",
    "originSummary": [
      "Özel sermaye şirketlerinin halka açık şirketleri satın alıp bunları özel kuruluşlara dönüştürme eğiliminin artması, piyasanın önemli bir bölümünü yatırımcılar, düzenleyiciler ve medya için daha az şeffaf hale getirdiğinden endişe yaratıyor.",
      "Özel sermayeye doğru olan bu kayma, deregülasyon tarafından yönlendirilmiş ve öncelikle şirketlerin ortaklarına fayda sağlarken işten çıkarmalar, hizmet kalitesinin düşmesi ve iflaslar gibi potansiyel olarak zararlı sonuçlara yol açmıştır.",
      "Hükümet özel sermaye danışmanları için açıklama gerekliliklerini artıracak değişiklikler önermiştir, ancak potansiyel sistemik riskleri ele almak ve daha yüksek getiri iddialarını doğrulamak için daha sağlam önlemler gerekli olabilir."
    ],
    "commentSummary": [
      "ABD'de özel sermayenin yükselişi, sıradan yatırımcıların yüksek büyüme oranına sahip şirketlere erişiminin azalması, girişimciler için daha az fırsat ve servet yoğunlaşması gibi sorunlara yol açıyor.",
      "Başlıca tartışma konuları arasında belirli eylemlerin ahlaki ve yasallığı, konutun bir yatırım olarak görülmesi, 401k emeklilik planındaki kusurlar, bireysel yatırımcıların karşılaştığı zorluklar ve emeklilik tasarruflarının yeterliliği yer almaktadır.",
      "Endişeler ayrıca emeklilik planlamasının karmaşıklığı, 401k planlarına duyulan güven, katkı paylarının karşılanabilirliği ve genellikle yetersiz görülen konut ve sağlık masraflarının emeklilik tasarrufları üzerindeki etkilerine odaklanmaktadır."
    ],
    "points": 388,
    "commentCount": 421,
    "retryCount": 0,
    "time": 1698672347
  },
  {
    "id": 38076886,
    "title": "Grug Beyinli Geliştirici (2022)",
    "originLink": "https://grugbrain.dev/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38076886",
    "commentBody": "",
    "originSummary": [
      "Yazar, yazılım geliştirmede sadeliğin, gereksiz özelliklerden kaçınmanın ve verimli çözümler uygulamanın önemini vurguluyor.",
      "Kod organizasyonu, test, çevik metodolojiler, araçlar ve hata ayıklayıcılar, tip sistemleri, DRY (Kendini Tekrar Etme), SoC (Endişelerin Ayrılması), kapanışlar, günlüğe kaydetme, eşzamanlılık, optimizasyon, API'ler (Uygulama Programlama Arayüzleri) ve yazılım geliştirme bağlamında ayrıştırma gibi çeşitli konular tartışılmaktadır.",
      "Yazar, belirli ön uç geliştirme uygulamalarını eleştirerek, giderek daha karmaşık hale gelse de yeni fikirlere temkinli yaklaşmanın, öğrenme sürecine değer vermenin ve hata yapmaktan korkmamanın çok önemli olduğunu vurguluyor."
    ],
    "commentSummary": [
      "Makale, yazılım geliştirmede aşırı mühendislik sorununu tartışmakta, çeşitli yönlerden etkilenen zorluklarını ve dezavantajlarını ortaya koymaktadır.",
      "Tipli ve dinamik tipli dillerle ilgili tartışmaları tetiklemekte, web geliştirme için HTMX'i tanıtmakta ve yazılım geliştirmedeki karmaşıklığı tartışmaktadır.",
      "Yazar, karmaşıklık yerine basitliğe öncelik verilmesini tavsiye etmekte, aşırı karmaşıklığa karşı uyarıda bulunmakta ancak nüansları ve konuya ilişkin farklı bakış açılarını kabul etmektedir."
    ],
    "points": 380,
    "commentCount": 131,
    "retryCount": 0,
    "time": 1698705206
  },
  {
    "id": 38069915,
    "title": "Mikro hizmetlerin maliyetleri (2020)",
    "originLink": "https://robertovitillo.com/costs-of-microservices/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38069915",
    "commentBody": "",
    "originSummary": [
      "Makale, mikro hizmet mimarisi kullanmanın artılarını ve eksilerini değerlendiriyor; geliştirme hızının ve ölçeklenebilirliğin artmasını avantaj olarak belirtirken, iletişim ve kaynak sağlama gibi karmaşıklıklara ve zorluklara da dikkat çekiyor.",
      "Mikro hizmetler mimari tarzı operasyonel engelleri beraberinde getirir; bu nedenle, bu zorlukların üstesinden gelmek için önceden uzmanlık ve altyapı gereklidir.",
      "Makale, çoğu durumda daha uygulanabilir bir yaklaşım olarak monolitik bir yapıyla başlamayı ve gerektiğinde mikro hizmetlere geçmeyi tavsiye ediyor."
    ],
    "commentSummary": [
      "Tartışmanın ana konusu, ölçeklenebilirlik, esneklik ve gelişmiş kod kalitesi gibi ilişkili faydaları incelerken, yazılım geliştirmede mikro hizmetlerin kullanılmasıdır.",
      "Artan karmaşıklık, potansiyel bağımlılık sorunları ve mikro hizmetlerle ortaya çıkabilecek veri çoğaltma gibi çeşitli endişeler dile getirildi.",
      "Tartışılan diğer konular arasında ideal hizmet boyutu ve sayısı, mimari tasarıma sıkı sıkıya bağlı kalmanın önemi, kod incelemelerinin rolü, soyutlamaların ve API'lerin iyileştirilmesi gibi alternatif yaklaşımlar ve mikro hizmetleri benimserken kurumsal bağlamı dikkate alma ihtiyacı yer alıyor."
    ],
    "points": 374,
    "commentCount": 346,
    "retryCount": 0,
    "time": 1698676421
  },
  {
    "id": 38072218,
    "title": "Google Brain'in kurucusu büyük teknolojinin yapay zeka tehlikesi konusunda yalan söylediğini söylüyor",
    "originLink": "https://www.afr.com/technology/google-brain-founder-says-big-tech-is-lying-about-ai-human-extinction-danger-20231027-p5efnz",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38072218",
    "commentBody": "",
    "originSummary": [
      "Google Brain'in kurucusu Andrew Ng, büyük teknoloji firmalarını, daha sıkı düzenlemelere başvurmak amacıyla yapay zekanın insanlar için varoluşsal riskler oluşturduğuna dair yanlış söylemler yaymakla eleştiriyor.",
      "Ng'ye göre bu şirketler, yapay zeka pazarındaki rekabeti engelleyerek kendilerine fayda sağlamak için sert düzenlemelerden yararlanmayı amaçlıyor.",
      "Ng, zorlu lisanslama gereklilikleri uygulamak yerine, yapay zeka alanında şeffaflığı savunuyor."
    ],
    "commentSummary": [
      "Diyalog öncelikle şeffaflık, kendini ifşa etme ve sorumlu YZ geliştirme argümanlarıyla YZ'nin düzenlenmesi etrafında dönüyor.",
      "Tartışmada ayrıca yapay zeka tarafından üretilen içeriğin potansiyel riskleri, Çin'in yapay zeka endüstrisi üzerindeki etkisi ve yapay zekanın yeteneklerinin net bir şekilde anlaşılması ihtiyacı da ele alınıyor.",
      "Ayrıca, tartışmalar YZ'nin toplumsal etkisine, iş piyasaları üzerindeki etkisine ve gerekli tüketici korumasına odaklanmakta ve YZ'nin faydaları ve riskleri konusundaki farklı bakış açılarını yansıtmaktadır."
    ],
    "points": 371,
    "commentCount": 361,
    "retryCount": 0,
    "time": 1698685417
  },
  {
    "id": 38068801,
    "title": "Raspberry Pi 5'te donanım video kodlaması yok ve sadece HEVC kod çözme var",
    "originLink": "https://www.raspberrypi.com/news/introducing-raspberry-pi-5/#comment-1594055",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38068801",
    "commentBody": "",
    "originSummary": [
      "Raspberry Pi Vakfı, daha hızlı bir işlemci, gelişmiş grafik özellikleri ve gelişmiş bağlantı seçenekleri gibi önemli yükseltmeler içeren tek kartlı bir bilgisayar olan Raspberry Pi 5'in piyasaya sürüldüğünü duyurdu.",
      "'Bookworm' olarak adlandırılan yeni Raspberry Pi OS, donanım sürümüne eşlik ederek sistem özellikleri ve potansiyel iyileştirmeler konusunda önemli tartışmalara yol açtı.",
      "Kullanıcılar, yeni Pi 5'te TrustZone güvenliği ve USB-C desteğinin bulunmamasıyla ilgili endişelerini dile getirdiler ve Raspberry Pi personeli şu anda bunları açıklığa kavuşturup ele alıyor."
    ],
    "commentSummary": [
      "Raspberry Pi 5'in donanımsal video kodlama yeteneklerinden yoksun olması, video ile ilgili görevlere ihtiyaç duyan kullanıcılar arasında hayal kırıklığına yol açıyor. Eleştirmenler, mevcut modelleri daha ekonomik ve erişilebilir hale getirmek yerine daha pahalı yeni modellere odaklanılması konusundaki endişelerini dile getiriyor.",
      "Raspberry Pi Vakfı'nın eğitim ve hobi kullanıcılarından ziyade endüstriyel iş kullanıcılarına öncelik verdiği görülüyor ve Beaglebone Black ve Orange Pi gibi alternatif tek kartlı bilgisayarlar hakkında bir tartışma başlatıyor.",
      "Tartışma noktaları arasında mini HDMI bağlantı noktalarının kullanımı, iş ve lisans maliyetleri nedeniyle olduğu tahmin edilen HEVC video kodlaması için donanım desteğinin kaldırılması ve Raspberry Pi 5 ile rakipleri arasındaki güç-performans karşılaştırmaları yer alıyor."
    ],
    "points": 311,
    "commentCount": 230,
    "retryCount": 0,
    "time": 1698670028
  },
  {
    "id": 38077684,
    "title": "Dünyanın en popüler ressamı, incelemem nedeniyle takipçilerini peşimden gönderdi",
    "originLink": "https://news.artnet.com/opinion/devon-rodriguez-parasocial-aesthetics-2380960",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38077684",
    "commentBody": "",
    "originSummary": [
      "Yazar, Rodriguez'in çalışmalarına yönelik eleştirel bir incelemenin ardından sanatçı Devon Rodriguez'in hayranlarının tepkisiyle karşılaştı.",
      "Yazar, sanat alanında gelişen dikkat ekonomisinin ortasında, özellikle önemli takipçileri olan sanatçılar için eleştirel analize duyulan ihtiyacı vurguluyor.",
      "Makale ayrıca Rodriguez'in sosyal medyadaki özgünlüğüne meydan okuyor ve parasosyal ilişkilerin sanat eleştirisi üzerindeki etkisini tartışıyor."
    ],
    "commentSummary": [
      "Tartışma, olumsuz eleştirilerin bir sanatçının kariyeri üzerindeki etkisini ve sosyal medyanın bir sanatçının şöhreti ve tanınırlığı üzerindeki etkisini vurgulayarak dikkat ekonomisi kavramıyla nasıl örtüştüğünü araştırıyor.",
      "Parasosyal ilişkiler kavramı ve bazı önde gelen sanatçıların yüzeyselliği, bir TikTok sanatçısının durumu vurgulanarak başarı için sosyal medyadaki varlığın önemi ile birlikte ele alınmaktadır.",
      "Ayrıca, sosyal medya aracılığıyla iletişimin evrimi, eleştirilerin ele alınmasındaki zorluklar, sanatçılar tarafından alınan tepkiler ve belirli sanatçılara yönelik potansiyel pazarlama önyargıları da tartışılmaktadır."
    ],
    "points": 300,
    "commentCount": 130,
    "retryCount": 0,
    "time": 1698709958
  },
  {
    "id": 38072267,
    "title": "Küresel CO2 Seviyeleri",
    "originLink": "https://www.co2levels.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38072267",
    "commentBody": "",
    "originSummary": [
      "Metinde, 800.000 yıl öncesinden günümüze kadar atmosferik CO2 seviyelerini gösteren interaktif bir grafik açıklanmaktadır.",
      "Özelleştirilebilir, yakınlaştırılabilir ve yazdırılabilir olan grafikte Antarktika buz çekirdeği ölçümlerinden ve Hawaii Mauna Loa'dan alınan in situ hava ölçümlerinden elde edilen veriler kullanılmaktadır.",
      "Bu ücretsiz araç, iklim değişikliğine karşı harekete geçmeyi amaçlayan ve kâr amacı gütmeyen 2 Derece Enstitüsü'nün bir projesidir."
    ],
    "commentSummary": [
      "Konuşma, sülfür dioksitin karbon dioksit seviyeleri üzerindeki etkileri ve bir jeo-mühendislik yaklaşımı olarak sülfür enjeksiyonu, hem riskleri hem de potansiyel çevresel etkileri gibi çeşitli iklim değişikliği konularını kapsamaktadır.",
      "Karbon yakalama tesisleri ve güneş enerjisi çiftlikleri, etkinliklerine ve karşılaştıkları zorluklara odaklanılarak tartışılıyor. Diyalog, iklim değişikliğiyle mücadele yolları olarak insan inovasyonuna ve karbonun doğal olarak tutulmasına işaret ediyor.",
      "Söylemde ayrıca iklim değişikliğinin inkârı, emisyon azaltımına yönelik bireysel sorumluluklar ve iklim değişikliği verilerinin geçerliliğinin yanı sıra buzul çağı ve sera gazı senaryolarına atıfta bulunulmaktadır."
    ],
    "points": 276,
    "commentCount": 285,
    "retryCount": 0,
    "time": 1698685570
  },
  {
    "id": 38069974,
    "title": "WebRTC'nin değiştirilmesi: WebTransport ve WebCodecs ile gerçek zamanlı gecikme",
    "originLink": "https://quic.video/blog/replacing-webrtc/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38069974",
    "commentBody": "",
    "originSummary": [
      "Yazar, web üzerinde gerçek zamanlı medya iletişimi için bir araç olan WebRTC'yi değerlendiriyor. Konferans için etkili olsa da, sınırlı özelleştirilebilirlik ve tehlikeye atılan kalite nedeniyle video dağıtımında eksiktir.",
      "WebCodecs ve WebTransport, daha fazla kontrol ve çok yönlülük sağlayarak WebRTC'ye olası alternatifler olarak sunulmaktadır. Ancak WebRTC'nin yerini tam olarak alabilmeleri için gelişmiş tıkanıklık kontrolü ve ekstra kodlama seçenekleri gibi iyileştirmeler gerekmektedir.",
      "Yazı, WebRTC'yi yeni bir standartla değiştirmenin uzun ve karmaşık prosedürünü vurgulayarak sona eriyor."
    ],
    "commentSummary": [
      "Chrome WebCodecs ekibi, WebTransport ve WebCodecs ile gerçek zamanlı gecikmeyi artırmaya odaklanıyor ve referans olmayan çerçeveler, SVC ve verimli çerçeve dilimleme gibi çözümleri araştırıyor.",
      "Kullanıcılar cep telefonlarında VideoFrame'in copyTo yöntemiyle ilgili sorunlar bildirmiş ve alfa kodlama ve kare kare arama gibi özellikler önermişlerdir. Ayrıca, rolling shutter ve IMU bilgilerinin web kameralarına entegre edilmesi, düşük gecikmeli web kameralarının geliştirilmesini kolaylaştırabilir.",
      "Web sitesi DDOS saldırılarını hafifletmek için tasarlanan WebRTC'nin sınırlamaları ve karmaşıklıkları ve odaklanmış hedeflere sahip temiz bir tasarım gibi daha etkili alternatiflerin olasılığı üzerine bir tartışma var. Güvenlik kısıtlamaları ve yeteneklerinin dengelenmesi önemli bir zorluk teşkil etmektedir."
    ],
    "points": 264,
    "commentCount": 70,
    "retryCount": 0,
    "time": 1698676716
  },
  {
    "id": 38077889,
    "title": "Android ve RISC-V: Hazır olmak için bilmeniz gerekenler",
    "originLink": "https://opensource.googleblog.com/2023/10/android-and-risc-v-what-you-need-to-know.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38077889",
    "commentBody": "",
    "originSummary": [
      "Google, Android işletim sistemine açık bir komut seti olan RISC-V mimarisi için destek eklediğini, yamaları kabul ettiğini ve mimari için kritik özellikleri özetlediğini duyurdu.",
      "Geliştiriciler artık Cuttlefish Sanal Cihaz desteğini kullanarak Android'i RISC-V üzerinde oluşturabilir, test edebilir ve çalıştırabilir. 2024 yılına kadar farklı cihaz form faktörlerinde uygulamaları test etmek için emülatörlerin halka açık olması bekleniyor.",
      "Google ayrıca RISE projesi ile ortak girişimler ve RISC-V International'a yatırım yoluyla RISC-V çekirdekleri için yazılım kullanılabilirliğini artırıyor ve katkıda bulunmak isteyen geliştiriciler için GitHub ve AOSP aracılığıyla kaynaklar sunuyor."
    ],
    "commentSummary": [
      "Makale, RISC-V mimarisinin Android işletim sistemine entegrasyonu üzerine bir tartışma yürütmekte ve böyle bir geçişin sunabileceği avantajları ve potansiyel zorlukları vurgulamaktadır.",
      "Google ve Apple'ın yeni mimarileri benimseme yaklaşımları arasında paralellikler kurarak sorunsuz bir geçişin çok önemli olduğunun altını çiziyor.",
      "Yazı, RISC-V'nin mobil alandaki rekabet gücü, Çinli firmaların RISC-V telefonlara olan ilgisi ve teknoloji dünyasında açık kaynaklı yazılım ve donanımın önemi üzerine tartışmalara yol açıyor."
    ],
    "points": 255,
    "commentCount": 82,
    "retryCount": 0,
    "time": 1698711128
  },
  {
    "id": 38081633,
    "title": "Alman mahkemesi Do Not Track'in yasal olarak bağlayıcı olduğunu ilan etti",
    "originLink": "https://www.vzbv.de/urteile/gericht-untersagt-datenschutzverstoesse-von-linkedin",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38081633",
    "commentBody": "",
    "originSummary": [
      "Alman Tüketici Federasyonu (vzbv), veri gizliliği düzenlemelerini ihlal etmekle suçladığı LinkedIn'e karşı açtığı davadan galip çıktı.",
      "Kararda, LinkedIn'in kullanıcılara \"Do-Not-Track\" sinyallerini görmezden geldiği konusunda bilgi vermemesi gerektiği belirtilerek, bireylerin tarama davranışlarının izlenmesinden vazgeçmelerine izin veriliyor.",
      "Karar ayrıca LinkedIn'in farklı web sitelerindeki kullanıcı profillerini izin almadan otomatik olarak doldurmasını yasaklıyor ve üye olmayanlara istenmeyen e-postalar göndermesini de kısıtlıyor."
    ],
    "commentSummary": [
      "Almanya'da yakın zamanda alınan bir mahkeme kararı, \"Do Not Track\" (DNT) sinyalini yasal olarak tanıyarak LinkedIn'in bunu göz ardı etmesini veya diğer platformlarda kullanıcı profillerini ayarlamasını yasakladı.",
      "Bu karar diğer web sitelerini de etkileyebilir ve potansiyel olarak her web sitesinde benzersiz çerez bildirimlerine olan ihtiyacı ortadan kaldırarak kullanıcıların izleme çerezleriyle ilgili hayal kırıklıklarını yatıştırabilir.",
      "DNT etrafındaki tartışma, DNT'nin uygulanması, etkinliği ve web sitelerinin sinyale uyması için yasal gerekliliği içermekte ve DNT'nin izlemenin reddi olarak görülüp görülmemesi gerektiği konusunda tartışmalara yol açmaktadır."
    ],
    "points": 253,
    "commentCount": 126,
    "retryCount": 0,
    "time": 1698740562
  },
  {
    "id": 38072495,
    "title": "Threads Software Limited, Meta'ya Threads adını kullanmayı bırakması için 30 gün süre verir",
    "originLink": "https://www.businesswire.com/news/home/20231030082004/en/Threads-Software-Limited-Gives-Meta%E2%80%99s-Instagram-30-Days-to-Desist-from-Using-the-Service-Name-Threads",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38072495",
    "commentBody": "",
    "originSummary": [
      "İngiltere merkezli Threads Software Limited, Meta's Instagram'ı 30 gün içinde İngiltere'deki hizmetleri için \"Threads\" adını kullanmayı bırakması veya potansiyel yasal işlemle karşı karşıya kalması konusunda uyarıyor.",
      "Ticari markayı elinde bulunduran ve 2014'ten bu yana mesajlaşma merkezi hizmetini küresel çapta tanıtan Threads Software Limited, Instagram'ın kullanımını işine yönelik bir tehdit olarak görüyor.",
      "Temmuz 2023'te kendi 'threads' sosyal medya platformunu duyuran Meta, Threads Software Ltd'den 'threads.app' alan adını satın almak için başarısız girişimlerde bulundu."
    ],
    "commentSummary": [
      "Bir yazılım şirketi olan Threads Software Limited, Meta'nın sosyal medya platformu için \"Threads\" adının kullanılması nedeniyle ticari marka ihlali iddiasıyla Meta'ya meydan okudu.",
      "Threads Software Limited, bu ismin ticari markasını 2012 yılında aldığını ve 2014 yılından bu yana Threads isimli bir ürününün faaliyette olduğunu belirtiyor. Meta'nın Threads Software'den \"threads.app\" alan adını satın alma girişimi başarısız oldu.",
      "Meta, \"Threads\" sosyal medya platformunu Temmuz 2023'te piyasaya sürmüş ve ardından Threads Software Limited'i Facebook platformundan çıkarmıştır. Bu yasal çekişmenin sonucu henüz belli değil ve büyük ölçüde her iki kuruluşun yasal taktiklerine ve kaynaklarına dayanıyor."
    ],
    "points": 229,
    "commentCount": 204,
    "retryCount": 0,
    "time": 1698686401
  }
]
