[
  {
    "id": 40024062,
    "title": "حثت لجنة الاتصالات الفيدرالية على منع الممرات السريعة 5G في تصويت حيادية الإنترنت",
    "originLink": "https://cyberlaw.stanford.edu/blog/2024/04/harmful-5g-fast-lanes-are-coming-fcc-needs-stop-them",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40024062",
    "commentBody": "",
    "originSummary": [
      "ستصوت لجنة الاتصالات الفيدرالية (FCC) على استعادة حماية حيادية الإنترنت في 25 أبريل لمنع مزودي خدمة الإنترنت من تفضيل تطبيقات محددة ذات ممرات سريعة ، بما في ذلك الممرات السريعة المحتملة ل 5G.",
      "تهدف مسودة القواعد إلى السماح لشركات الجوال بالحفاظ على جودة الفيديو ولكنها قد تؤدي إلى حصول بعض التطبيقات على ميزة غير عادلة ، مما يؤثر على اختيار المستخدم والمنافسة.",
      "يدفع مؤيدو حيادية الإنترنت لجنة الاتصالات الفيدرالية (FCC) إلى تحديد وحظر الممرات السريعة لحماية التطبيقات الصغيرة والشركات الناشئة من الضرر المحتمل وعدم اليقين."
    ],
    "commentSummary": [
      "تؤكد المقالة على أهمية قواعد حيادية الإنترنت وسط مخاوف بشأن الممارسات غير العادلة في قطاع مزودي خدمة الإنترنت ، لا سيما فيما يتعلق بالممرات السريعة 5G.",
      "ويتعمق في الحجج المحيطة بالمنافسة والاحتكارات والمشاركة الحكومية والآثار على إمكانية وصول المستهلك والتسعير.",
      "تتم مناقشة وجهات النظر المختلفة حول حيادية الإنترنت ، ولوائح مزودي خدمة الإنترنت ، والقدرة التنافسية في السوق ، مع أمثلة عالمية تسلط الضوء على نتائج إنفاذ أو إلغاء قوانين حيادية الإنترنت."
    ],
    "points": 393,
    "commentCount": 268,
    "retryCount": 0,
    "time": 1713024550
  },
  {
    "id": 40028643,
    "title": "تذكر راي هاريل: قوة التأثير الهادئ",
    "originLink": "https://bittersoutherner.com/feature/2023/obituary-for-a-quiet-life",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40028643",
    "commentBody": "",
    "originSummary": [
      "يكرم النعي راي هاريل ، وهو رجل من ولاية كارولينا الشمالية ، عاش حياة هادئة ولكنها مؤثرة وفقا لحفيده.",
      "كان راي هاريل ، على الرغم من تواضعه ، معروفا بإحساسه القوي بالعدالة والدعوة إلى البر.",
      "يسلط المقال الضوء على أهمية الأفراد المتواضعين مثل راي هاريل ، الذين غالبا ما لا يتم التعرف على مساهماتهم المؤثرة ولكنها تمس حياة الآخرين بعمق."
    ],
    "commentSummary": [
      "يتعمق المقال في الصراع بين الرضا والطموح وسط أزمات منتصف العمر ، مع التأكيد على النمو الشخصي وإيجاد الانسجام بين الاثنين.",
      "يقترح الانخراط في الهوايات ومساعدة الآخرين كمسارات نحو الإنجاز ، مما يؤكد على أهمية الفرح الداخلي ، والروابط الهادفة ، وقيادة حياة مباشرة ومؤثرة.",
      "بالإشارة إلى المقاطع الكتابية ووجهات النظر المتناقضة بين الأجيال حول النجاح والرضا ، تدعو المقالة إلى الاعتراف بالأفراد الذين يكتفون بتحقيق \"ما يكفي\" لحياة مرضية وتكريمهم."
    ],
    "points": 334,
    "commentCount": 81,
    "retryCount": 0,
    "time": 1713068678
  },
  {
    "id": 40025339,
    "title": "كشف النقاب عن التضخم: يدعي الخبراء 18٪ في عام 2022 باستثناء تكاليف الفائدة",
    "originLink": "https://www.forbes.com/sites/theapothecary/2024/03/23/summers-inflation-reached-18-in-2022-using-the-governments-previous-formula/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40025339",
    "commentBody": "",
    "originSummary": [
      "يدعي الاقتصاديون من جامعة هارفارد وصندوق النقد الدولي ، بقيادة لورانس سامرز ، أن معدل التضخم لعام 2022 ارتفع إلى 18٪ لأن صيغة مؤشر أسعار المستهلكين تستبعد تكاليف الفائدة.",
      "ارتفاع أسعار الفائدة ، التي لم يتم أخذها في الاعتبار في أرقام التضخم الرسمية ، يضيف ضغوطا اقتصادية على الأمريكيين بناء على حجة الباحثين.",
      "يؤكد التحليل على ضرورة إعادة تقييم كيفية قياس تضخم أسعار المستهلك ، مما يشير إلى أن التدابير المختلفة يمكن أن تؤثر على مجموعات اجتماعية واقتصادية متنوعة بشكل متباين."
    ],
    "commentSummary": [
      "يستكشف المقال تناقضات التضخم ، خاصة في مؤشر أسعار المستهلك (CPI) ، مع تسليط الضوء على تأثيره على الرخاء والتفاوتات الاقتصادية.",
      "يناقش الأحداث التاريخية ، والأيديولوجيات السياسية ، وتغيير مستويات المعيشة ، وتأثير أسعار الفائدة على التضخم ، والقدرة على تحمل تكاليف الإسكان.",
      "يؤكد على أهمية وجهات النظر المتنوعة والسياقات التاريخية في تحليل الآثار الاجتماعية للتضخم والدعوة إلى تحسين المؤشرات الاقتصادية."
    ],
    "points": 285,
    "commentCount": 277,
    "retryCount": 0,
    "time": 1713036282
  },
  {
    "id": 40023319,
    "title": "اهتزاز الأشجار: تحسين كفاءة تجميع الويب",
    "originLink": "https://wingolog.org/archives/2023/11/24/tree-shaking-the-horticulturally-misguided-algorithm",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40023319",
    "commentBody": "",
    "originSummary": [
      "يتعمق المقال في العقبات والإنجازات التي تحققت في الاستفادة من WebAssembly لتطوير الويب ، وعرض التحديات مع لغات مثل C # و Python.",
      "مع التأكيد على أهمية اهتزاز الأشجار بكفاءة لتقليل حجم الملف ، فإنه يعالج دعم المتصفح القادم لأنواع المراجع وجمع البيانات المهملة.",
      "كما يسلط الضوء على تحديات تحسين اهتزاز الأشجار في لغات مثل Scheme و Python ، إلى جانب استكشاف إمكانية برمجة DOM بلغات غير JavaScript ، ويختتم بإشارة إلى Pyodide والمتطلبات الحسابية المختلفة ل REPLs."
    ],
    "commentSummary": [
      "تستكشف المقالة خوارزمية اهتزاز الأشجار لتقليل أحجام حزم wasm في تطبيقات Rust و WASM ، مع التركيز على مصطلحات تحسين البرامج وتحديات التخلص من التعليمات البرمجية الميتة.",
      "يسلط الضوء على مزايا وعقبات WebAssembly في تطوير الويب ، ومناقشة تحسين الأداء وإمكانات تقليل الحجم باستخدام WASM.",
      "علاوة على ذلك ، فإنه يغطي تحسين التعليمات البرمجية في المتصفحات ، والتعامل مع المكتبات الديناميكية ، وتمكين لغات متعددة في المتصفحات من خلال WebAssembly ، وإلقاء الضوء على تقنيات التحسين المتنوعة وفوائد تطبيقات الويب وكفاءة التعليمات البرمجية."
    ],
    "points": 209,
    "commentCount": 126,
    "retryCount": 0,
    "time": 1713018020
  },
  {
    "id": 40025195,
    "title": "مجموعة الطاقة الشمسية ذاتية التثبيت للمستأجرين: حل طاقة احتياطية خارج الشبكة",
    "originLink": "https://sunboxlabs.com",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40025195",
    "commentBody": "",
    "originSummary": [
      "تقدم Sunboxlabs مجموعة شمسية يمكن الوصول إليها لمساحات مختلفة مثل الشقق أو أسطح المنازل أو الشرفات أو الساحات الخلفية ، مما يعزز الطاقة الاحتياطية والتوفير واستقلال الطاقة من خلال توليد الطاقة الشمسية.",
      "تنتقل المجموعة بسلاسة إلى وضع تمرير المرافق عند الحاجة ، مما يجذب الملاك ، ويكون خارج الشبكة ، ويتجنب الطاقة الزائدة التي يتم تغذيتها مرة أخرى إلى الشبكة.",
      "يستلزم النظام تشغيل كابلات التمديد إلى \"صندوق الشمس\" من كل غرفة ، مصحوبة بتفاصيل التكلفة ، وتحليل الاسترداد المالي ، ومعلومات بصمة الإنتاج ، والمراقبة عن بعد ، ودليل تعليمي ، مما يضمن الراحة والشرعية."
    ],
    "commentSummary": [
      "يناقش المقال تحديات تركيب أنظمة النسخ الاحتياطي للطاقة الشمسية خارج الشبكة للمستأجرين ، ويسلط الضوء على مخاطر السلامة ، وموافقة المالك ، والآثار القانونية.",
      "يستكشف عوامل مثل الإعفاءات الضريبية الفيدرالية وتكاليف الكهرباء والمخاوف البيئية التي تؤثر على جدوى الطاقة الشمسية للمستأجرين.",
      "يتم تغطية جوانب مختلفة من استخدام الطاقة الشمسية ، ولوائح السلامة ، واعتبارات التأمين ، وانقطاع التيار الكهربائي ، والحلول المحتملة مثل إعدادات DIY ، مما يعكس الاتجاه المتزايد لبطاريات DIY والحلول الشمسية بسبب الانقطاعات المتكررة."
    ],
    "points": 204,
    "commentCount": 199,
    "retryCount": 0,
    "time": 1713034744
  },
  {
    "id": 40028338,
    "title": "تلتزم Truth Social بترخيص AGPL بعد طلب الامتثال",
    "originLink": "https://boehs.org/node/truth-social",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40028338",
    "commentBody": "",
    "originSummary": [
      "أنشأ الجمهوريون منصات التواصل الاجتماعي الخاصة بهم لمشاركة المحتوى دون اعتدال.",
      "تم اكتشاف أن هذه المنصات تستخدم رمزا من Mastodon ، مرخصا بموجب AGPL.",
      "يحقق المؤلف ، إيفان ، ويطالب بالامتثال من Truth Social ، وهي منصة من قبل Trump Media and Technology Group ، والتي تصدر في النهاية شفرة المصدر المحدثة ، وتسلط الضوء على المساءلة والالتزام القانوني."
    ],
    "commentSummary": [
      "تركز المناقشة على التزام Truth Social بترخيص AGPL ، مع تسليط الضوء على أهمية مشاركة شفرة المصدر واتباع شروط ترخيص المصدر المفتوح.",
      "يتناول ثقافة الشركة، عقبات تطوير البرمجيات، الإشراف على المحتوى، والمسؤوليات القانونية المتعلقة بتراخيص البرمجيات الحرة.",
      "تتعمق المحادثة في مشاركة مجموعات مختلفة في مجتمعات الترميز والمصادر المفتوحة ، وتعرض الصراعات الأيديولوجية داخل قطاع التكنولوجيا."
    ],
    "points": 147,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1713064240
  },
  {
    "id": 40023892,
    "title": "تطور تصميم الويب: CSS عبر العصور",
    "originLink": "https://eev.ee/blog/2020/02/01/old-css-new-css/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40023892",
    "commentBody": "",
    "originSummary": [
      "يستكشف النص تطور تصميم الويب من جداول HTML إلى تقنيات تخطيط CSS الحديثة ، مع التركيز على التحديات والتطورات.",
      "يناقش هيمنة Internet Explorer 6 ، وظهور Firefox و Safari ، وتطوير خصائص CSS جديدة مثل Flexbox و Grid.",
      "يؤكد على أهمية مواكبة ممارسات تصميم الويب الحديثة ، بما في ذلك توافق المتصفح ، لإنشاء مواقع ويب سريعة الاستجابة وجذابة بصريا."
    ],
    "commentSummary": [
      "تركز المناقشة على تطور CSS في عام 2020 ، حيث يسعى المستخدمون إلى زيادة الابتكار والتحكم في تخطيط الويب.",
      "تغطي الموضوعات التأثير المحتمل ل Houdini على تطوير الويب ، والتحسينات المقترحة لشبكة CSS ، وقيود CSS العالمية ، ومزايا تطبيقات الويب القائمة على المكونات ، والتحديات التاريخية في تصميم الويب ، وقيمة وظائف CSS المختلفة.",
      "بالإضافة إلى ذلك ، يتم تسليط الضوء على مشكلات توافق المستعرض ، واستخدام محدد CSS المتقدم ، واستهلاك ذاكرة الحوسبة المبكر ، واعتبارات الألوان الآمنة للويب ، وتعقيدات تطوير الواجهة الأمامية."
    ],
    "points": 141,
    "commentCount": 48,
    "retryCount": 0,
    "time": 1713023286
  },
  {
    "id": 40029283,
    "title": "تحديات بيع أدوات المطور: افتقار المطورين إلى القوة الشرائية",
    "originLink": "https://twitter.com/d_feldman/status/1779203622351339955",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40029283",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "يمثل بيع أدوات المطور للشركات تحديات بسبب افتقار المطورين عادة إلى سلطة الشراء.",
      "تغطي المناقشة استخدام Excel وتطبيقات الويب في الأعمال التجارية ، والعقبات التي تواجه تطبيقات الاستضافة الذاتية ، وتعقيدات شراء الأدوات داخل المؤسسات الكبيرة.",
      "وتشمل الموضوعات التي تم تناولها العقبات البيروقراطية، وإجراءات الشراء، وأهمية الدعم الإداري لخيارات الشراء، إلى جانب التأكيد على توافق الفريق واختيار الأدوات المصممة خصيصا للمتطلبات الفردية لتحسين الأداء."
    ],
    "points": 124,
    "commentCount": 108,
    "retryCount": 0,
    "time": 1713078800
  },
  {
    "id": 40027249,
    "title": "استكشاف جدران سوبر ماريو 64 غير المرئية",
    "originLink": "https://www.youtube.com/watch?v=YsXCVsDFiXA",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40027249",
    "commentBody": "",
    "originSummary": ["يتعمق الفيديو في مفهوم الجدران غير المرئية في Super Mario 64 على مدار 3 ساعات و 45 دقيقة."],
    "commentSummary": [
      "أثار مقطع فيديو من pannenkoek2012 على الجدران غير المرئية في Super Mario 64 مناقشات حول ميكانيكا اللعبة المعقدة ومواطن الخلل ، مما يلقي الضوء على تأثيرها على تطوير منصات 3D وتصميم محرك اللعبة.",
      "تمت الإشادة بالفيديو لمحتواه التعليمي ، حيث يقدم مفاهيم علوم الكمبيوتر والرياضيات ، لكن الآراء منقسمة حول أهمية الاهتمامات المتخصصة مثل الجري السريع ، مع مناقشات حول قيمة مشاريع العاطفة مقابل المخاوف بشأن عمليتها وآثارها الشخصية.",
      "حظرت Hackernews التعليقات التي تم إنشاؤها الذكاء الاصطناعي لكونها غير دقيقة ، مع التأكيد على أهمية التحقق اليدوي للحفاظ على جودة المناقشة."
    ],
    "points": 119,
    "commentCount": 42,
    "retryCount": 0,
    "time": 1713051748
  },
  {
    "id": 40022651,
    "title": "العوامل التي تشكل مهارات الملاحة بما يتجاوز علم الوراثة",
    "originLink": "https://knowablemagazine.org/content/article/society/2024/why-do-some-people-always-get-lost-but-others-dont",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40022651",
    "commentBody": "",
    "originSummary": [
      "تتأثر مهارات الملاحة في الغالب بالتربية والخبرات والجوانب الثقافية بدلا من علم الوراثة ، حيث يتفوق الأفراد من مناطق الشمال والمناطق الريفية في كثير من الأحيان في هذا المجال.",
      "يظهر الملاحون الجيدون قدرات مثل تقدير المسافات وقراءة الخرائط وبناء خرائط ذهنية دقيقة ، وهي مهارات يمكن شحذها من خلال الممارسة.",
      "قد يؤدي الاعتماد بشكل كبير على تقنية GPS إلى تقليل مهارات الملاحة بمرور الوقت ؛ يعتبر الانخراط في الأنشطة الخارجية والاستكشاف وتطوير الخرائط الذهنية مفيدا لتعزيز كفاءة الملاحة."
    ],
    "commentSummary": [
      "يمكن أن تختلف مهارات الملاحة بين الأفراد ، متأثرة بعوامل مثل التنشئة واستخدام التكنولوجيا والقدرات المعرفية.",
      "يمكن أن يؤدي ضبط تطبيقات التنقل على وضع \"الشمال لأعلى\" إلى تعزيز إحساس المرء بالاتجاه لبعض الأفراد.",
      "تستكشف المناقشة أهمية الوعي المكاني ، وتأثير التكنولوجيا على الملاحة ، والروابط المحتملة بين الذكاء وإتقان الملاحة."
    ],
    "points": 118,
    "commentCount": 146,
    "retryCount": 0,
    "time": 1713010645
  }
]
