[
  {
    "title": "시스템반도체 테마주, 동운아나텍과 고영 주가 상승, 2025년까지 시장 규모 4,773억 달러 예상",
    "originLink": "https://biz.chosun.com/stock/c-biz_bot/2023/11/06/JS2C3H5CMUSP3GM3UX6IKBLJZM/",
    "originBody": "",
    "originSummary": [
      "시스템 반도체 주제가 화제가 되고 있으며, 동운아나텍, 고영, 네페스 등의 기업을 중심으로 전일 대비 1.91% 상승했습니다.",
      "시스템 반도체 시장은 2025년까지 4,7730억 달러에 달할 것으로 예측되며, 이는 메모리 반도체 시장의 두 배입니다.",
      "한국의 여러 기업들이 2030년까지 최첨단 공장 5곳을 건설할 예정인 시스템 반도체에 대해 크게 투자하고 있으며, 2025년까지 7000억 달러에 달할 것으로 예상되는 AI 반도체 시장의 확장은 시스템 반도체에 대한 수요를 더욱 높일 것입니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "시스템 반도체 테마가 동원아나텍, 고영, 네페스를 포함한 회사들의 선두 주도하에 앞세워, 전날보다 1.91% 상승했습니다.",
      "시스템 반도체 시장은 2025년까지 4,7730억 달러에 이를 전망이며, 이는 메모리 반도체 시장의 두 배입니다.",
      "여러 한국 기업들이 시스템 반도체에 대한 투자를 확대하고 있으며, 2030년까지 최신 기술 공장 5곳을 건설할 계획입니다. 주요 참여사로는 DI, 알파홀딩스, 자람테크놀러지, ITEC, 아나패스 등이 있습니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699276530846
  },
  {
    "title": "2023 반도체대전, AI와 시스템 반도체 혁신에 초점",
    "originLink": "http://www.sisa-news.com/news/article.html?no=238760",
    "originBody": "",
    "originSummary": [
      "2023년 제25회 반도체 컨퍼런스가 서울에서 320개 이상의 회사들의 참가로 열렸으며, 이번 행사는 AI와 시스템 반도체에 중점을 두었습니다.",
      "한편, 서울은 북서쪽에서 들어오는 찬 공기로 인해 기온이 급격히 떨어질 것으로 예상합니다.",
      "인프라가 구축되어 자산 관리 서비스를 제공할 예정이며, G-드래곤이 경찰 조사에서 마약 사용에 대해 음성 반응을 보였습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "2023년 반도체 컨퍼런스가 대한민국 서울에서 320개 이상의 기업 참가로 개최되었습니다. 이번 행사는 AI와 시스템 반도체에 중점을 두었습니다.",
      "한편, 대한민국은 북서쪽에서 부는 찬 바람으로 인해 기온이 크게 떨어질 것으로 예상됩니다.",
      "자산 관리 서비스를 제공하기 위한 인프라가 구축되었으며, G-Dragon은 경찰 조사에서 마약 사용에 대해 음성 판정을 받았습니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699276530846
  },
  {
    "title": "금리 및 외환 조정에 따른 시장 반등에 반도체 ETF 성능 상승",
    "originLink": "https://news.nate.com/view/20231106n30313?mid=n1101",
    "originBody": "",
    "originSummary": [
      "반도체 ETFs의 성능이 이자율 및 외환율 조정으로 인해 시장이 반등함에 따라 개선되고 있습니다.",
      "KODEX Fn 반도체 시스템은 4.66% 증가하였으며, SOL 반도체는 4.52% 증가하였습니다.",
      "4분기 이후 스마트폰과 PC에 대한 수요 증가 예측이 있습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "반도체 ETF의 성능이 금리 및 외환율 조정으로 시장이 반등함에 따라 향상되고 있습니다.",
      "KODEX Fn 반도체 시스템은 4.66% 증가하고, SOL 반도체는 4.52% 증가를 기록했습니다.",
      "4분기 이후 스마트폰과 PC에 대한 수요 증가 예측이 있습니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699276530846
  },
  {
    "title": "[ET단상]반도체 패키징 기술 개발과 인력양성에 대한 전략 필요",
    "originLink": "https://www.etnews.com/20231106000112",
    "originBody": "",
    "originSummary": [
      "반도체 산업은 컴퓨터, 스마트폰, 자동차 등 전자 기기에 사용되는 기술로 현대 사회 발전에 중추적 역할을 하고 있습니다. 세계 반도체 시장에서 미국이 50% 이상을 차지하는 반면, 한국은 약 20%를 차지하고 있습니다.",
      "메모리 반도체 시장에서 한국이 중요한 위치를 차지하고 있지만, 시스템 반도체 시장은 여전히 미국과 일본에 크게 의존하고 있습니다. TSMC의 칩소와퍼온서브스트레이트(CoWoS)와 같은 고급 패키징 기술이 점점 더 중요해져 가고 있습니다.",
      "한국의 반도체 산업의 미래는 시스템 반도체와 장비 국산화, 패키징 기술 개발, 고급 인력 개발에 달려있습니다. 반도체 패키징 전문가에 대한 수요와 공급의 불균형이 인식되고 있으나, 이 분야에서는 정부, 기업, 대학 간 협력이 필요합니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "반도체 산업은 컴퓨터, 스마트폰, 차량 등의 전자기기에서 사용되는 기술로 현대 사회 발전에 결정적인 역할을 합니다. 전세계 반도체 시장의 50% 이상을 미국이, 한국이 약 20%를 차지하고 있습니다.",
      "메모리 반도체 시장에서는 한국이 중요한 위치를 차지하고 있지만, 시스템 반도체 시장은 미국과 일본에 크게 의존하고 있습니다. TSMC의 CoWoS와 같은 진보된 패키징 기술이 점점 중요해지고 있습니다.",
      "한국의 반도체 산업은 시스템 반도체 및 장비 국내화, 패키징 기술 개발, 고급 인력 개발 등을 통해 미래를 준비하고 있지만, 반도체 패키징 전문가에 대한 수요-공급 불균형 문제가 있으며, 이를 해결하기 위해서는 정부, 기업, 대학 간의 협력이 필요합니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699276530846
  },
  {
    "title": "삼성전자, 스마트폰 시장 호황에 GNK 이미지 센서 개발로 시스템 반도체 부문 강화",
    "originLink": "https://www.mk.co.kr/news/business/10867717",
    "originBody": "",
    "originSummary": [
      "삼성전자는 Google의 Pixel 8 Pro 등 내년의 스마트폰 모델로 탑재하려는 새로운 GNK 이미지 센서를 통해 시스템 반도체 부문에서의 위치를 강화하려고 합니다.",
      "GNK 이미지 센서는 전작보다 낮은 전력을 사용함으로써 제품의 배터리 효율성을 향상시키며, 차량 및 움직이는 물체에 대한 이미지 센서 사업을 확장할 계획입니다.",
      "삼성전자는 프리미엄 모델인 갤럭시 S 울트라 등에 사용될 200 메가픽셀 이미지 센서를 개발하고 있습니다. 이는 스마트폰 시장이 2024년에 4.5% 성장하고 2027년까지 회복될 것으로 예상되는 가운데 발생하는 일이며, 이 정보는 시장 연구 기관 IDC에 의해 제공됩니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "삼성전자는 Google의 Pixel 8 Pro와 같은 내년 스마트폰 모델에 장착할 새로운 GNK 이미지 센서를 통해 시스템 반도체 부문에 대한 입지를 강화하고자 합니다.",
      "GNK 이미지 센서는 이전 모델에 비해 더 낮은 전력을 사용하여 제품의 배터리 효율을 높입니다.",
      "삼성전자는 자동차와 움직이는 물체에 대한 이미지 센서 사업을 확장하고 Galaxy S Ultra와 같은 고급 모델을 위한 200 메가픽셀 이미지 센서를 개발할 계획입니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699276530846
  },
  {
    "title": "내년 R&D 예산 16.6% 감소, 반도체 인재양성 프로그램에 타격 - 2031년 국내 반도체 산업 인력 부족 우려",
    "originLink": "https://biz.chosun.com/science-chosun/science/2023/11/06/CG4EKBIEVFHGZAO35PTC34F65E/",
    "originBody": "",
    "originSummary": [
      "내년 연구 개발(R&D) 예산이 16.6% 감소하여 총 21.7조원으로 결정되었고, 이는 정부 총 지출의 3.9%를 차지합니다.",
      "이러한 삭감으로 인해 과학 기술 커뮤니티 내에서 혼란과 불안이 퍼지고 있습니다.",
      "특히, 학생들에게 무료 반도체 칩 제조 서비스를 제공하는 프로그램의 500억원이 삭감되어 2031년까지 한국 반도체 산업의 인력 부족이 우려되고 있습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "내년 연구 개발(R&D) 예산이 16.6% 줄어들어 총 21.7조원이 됨, 이는 정부 총 지출의 3.9%를 차지.",
      "이러한 예산 삭감으로 인해 과학기술 커뮤니티 내에서 혼란과 고통이 일어나고 있음.",
      "특히, 학생들에게 무료 반도체 칩 제조 서비스를 제공하는 프로그램에서 5천만 달러가 삭감되어 2031년까지 한국 반도체 산업의 근로자 부족 문제가 예상됨."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699276530846
  },
  {
    "title": "월 스트리트 거물들, 이스라엘-하마스 충돌이 전 세계 경제침체를 초래할 수 있다고 경고",
    "originLink": "https://kr.investing.com/news/stock-market-news/article-963270",
    "originBody": "",
    "originSummary": [
      "월스트리트의 거물들이 이스라엘-하마스 갈등이 세계 경제 불황을 초래할 수 있다고 경고하고 있습니다.",
      "이 경고는 미주 중동 외교 정책에 큰 변화를 가져올 수 있습니다.",
      "현재 전 세계의 주목을 받고 있는 중요한 이슈입니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "월스트리트의 거물들이 이스라엘-하마스 간의 갈등이 전 세계적인 경제 불황을 초래할 수 있다고 경고하고 있다.",
      "이 둘 간의 갈등이 전 세계 경제에 부정적인 영향을 미칠 수 있음을 시사하는 입장을 밝혔다.",
      "현 상태에서는 이 갈등이 언제 어떻게 종결될지 예측하기 어려워, 글로벌 경제에 대한 불확실성을 높이고 있다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699276530846
  },
  {
    "title": "심텍, 3분기 성적 부진과 4분기 어두운 전망으로 목표 주가 하향",
    "originLink": "https://m.news.nate.com/view/20231106n22347",
    "originBody": "",
    "originSummary": [
      "SK증권은 Q3 성적이 떨어지고 Q4 전망이 암울하다는 이유로 한국 반도체 전문 기업 Simtek에 대한 목표 가격을 하향 조정했습니다.",
      "반도체 고객사들의 메모리 공급 감소와 시스템 반도체 재고 조정이 Simtek의 성과에 영향을 미쳐 주가를 흔들었습니다.",
      "SK증권은 약해진 Q4 영업 수익을 예상하면서도 내년에 반등할 것으로 기대하고 '구입' 등급을 유지했습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "SK증권은 Simtek의 나쁜 Q3 성과와 어두운 Q4 전망으로 인해 이 반도체 전문 회사에 대한 목표 가격을 하향 조정하였습니다.",
      "반도체 고객 회사로부터의 메모리 공급 감소와 시스템 반도체 재고 조정이 Simtek의 성과에 영향을 미쳐 주가가 변동하였습니다.",
      "그럼에도 불구하고 SK증권은 내년에 반등을 예상하며 '구매' 등급을 유지하였습니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699276530846
  }
]
