[
  {
    "id": 39973467,
    "title": "Llm.c - शुद्ध C/CUDA में बड़े भाषा मॉडल को प्रशिक्षित करें",
    "originLink": "https://github.com/karpathy/llm.c",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39973467",
    "commentBody": "",
    "originSummary": [
      "दस्तावेज़ में PyTorch जैसे व्यापक ढांचे पर भरोसा किए बिना, GPT-2 जैसे बड़े भाषा मॉडल के प्रशिक्षण के लिए एक सीधा C/CUDA कार्यान्वयन का विवरण दिया गया है।",
      "लेखक कार्यान्वयन की गति और दक्षता को बढ़ाने पर ध्यान केंद्रित करता है, सटीकता आश्वासन के लिए यूनिट परीक्षणों और ट्यूटोरियल के साथ-साथ सी में डेटासेट अधिग्रहण, वजन आरंभीकरण और मॉडल प्रशिक्षण के लिए दिशानिर्देश प्रदान करता है।",
      "यह परियोजना एमआईटी लाइसेंस के तहत ओपन-सोर्स है, जो तकनीकी समुदाय में पहुंच और सहयोग की सुविधा प्रदान करती है।"
    ],
    "commentSummary": [
      "Github चर्चा मशीन लर्निंग, GPU मेमोरी डिज़ाइन, पूर्वानुमान के लिए GPT-2, PyTorch सीमाओं और वैकल्पिक GPU जैसे विविध विषयों पर प्रकाश डालती है।",
      "उत्साही उपयोगकर्ता Google के TPU के साथ तकनीकी चुनौतियों, सुधारों और भाषा मॉडल प्रशिक्षण पर अंतर्दृष्टि का आदान-प्रदान करते हुए Karpathy के इनपुट की प्रशंसा करते हैं।",
      "बातचीत मेमोरी क्षमता, एक्सेस विधियों, एमएल पुस्तकालयों के अनुकूलन, अलग-अलग डेटा संरचनाओं, प्रोग्रामिंग भाषाओं और कोडिंग में स्वचालित संसाधन प्रबंधन की पड़ताल करती है।"
    ],
    "points": 805,
    "commentCount": 133,
    "retryCount": 0,
    "time": 1712608729
  },
  {
    "id": 39970915,
    "title": "विद्या हार्प मैकगवर्न: उदय, पतन और टेक में विरासत",
    "originLink": "https://every.to/the-crazy-ones/the-woman-that-tech-history-forgot",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39970915",
    "commentBody": "",
    "originSummary": [
      "लोर हार्प मैकगवर्न ने एक समृद्ध कंप्यूटर कंपनी वेक्टर ग्राफिक की स्थापना की, लेकिन बाद में दिवालियापन के लिए अग्रणी चुनौतियों का सामना करना पड़ा, जो उनके तकनीकी उद्योग और परोपकारी योगदान के बावजूद पुरुष अग्रदूतों द्वारा ओवरशेड किया गया।",
      "समाचार पत्र में गैरेथ और विविध विषयों को कवर करने वाले दैनिक निबंधों जैसी उत्थान कहानियां हैं।"
    ],
    "commentSummary": [
      "तकनीकी उद्योग में महिलाओं को चुनौतियों और भेदभाव का सामना करना पड़ता है, खासकर पुरुष-वर्चस्व वाले क्षेत्रों में, जैसे कि प्रौद्योगिकी।",
      "लोर हार्प मैकगवर्न के माइक्रो कंप्यूटर साम्राज्य जैसी सफलता की कहानियां लिंग पूर्वाग्रह से ढकी हुई हैं, जो स्टीव जॉब्स जैसे पुरुष आंकड़ों की तुलना में स्पष्ट है।",
      "विविधता कार्यक्रमों के महत्व पर जोर देना और काम पर रखने और कार्यस्थल संस्कृति में पूर्वाग्रह का मुकाबला करना अधिक समावेशी तकनीकी वातावरण को बढ़ावा देने के लिए महत्वपूर्ण है।"
    ],
    "points": 455,
    "commentCount": 103,
    "retryCount": 0,
    "time": 1712591328
  },
  {
    "id": 39972990,
    "title": "एआई ट्रायम्फ के बाद, गो प्लेयर्स निर्णय लेने और रचनात्मकता को बढ़ाते हैं",
    "originLink": "https://www.henrikkarlsson.xyz/p/go",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39972990",
    "commentBody": "",
    "originSummary": [
      "पेशेवर गो खिलाड़ियों को एआई तक एक कौशल पठार का सामना करना पड़ा, विशेष रूप से अल्फागो, ने बेहतर क्षमताओं का प्रदर्शन किया, जिससे खिलाड़ियों के बीच बेहतर निर्णय लेने और रचनात्मकता में सुधार हुआ।",
      "गो में ट्रेंड शिफ्ट अल्फागो के 18 महीने बाद हुआ, जो लीला ज़ीरो के लॉन्च के साथ संरेखित हुआ, एक ओपन-सोर्स गो इंजन, जो लिज़ी जैसे टूल के साथ, एआई तर्क तक पहुंच प्रदान करता है, इनपुट सीखने को बढ़ावा देता है और मानव रचनात्मकता को उजागर करता है।",
      "प्रतिस्पर्धी क्षेत्रों में मनुष्यों और एआई के बीच संबंध, शतरंज और गो में देखा गया, एआई के लिए मानव कौशल को बढ़ाने और मौजूदा सीमाओं से परे प्रगति को चलाने की क्षमता प्रदर्शित करता है।"
    ],
    "commentSummary": [
      "गो और शतरंज जैसे खेलों पर एआई के प्रभाव पर चर्चा की जाती है, इस बात पर ध्यान केंद्रित करते हुए कि कंप्यूटर विश्लेषण खिलाड़ियों को उनके गेमप्ले को बढ़ाने में कैसे सहायता करता है।",
      "अधिक आक्रामक गेमप्ले को बढ़ावा देने के लिए शतरंज में एक पदोन्नति और निर्वासन प्रणाली शुरू करने के लिए सिफारिशें की जाती हैं।",
      "बहस मनोरंजन, कला और संगीत निर्माण में एआई की क्षमता को भी संबोधित करती है, विभिन्न डोमेन में मानव रचनात्मकता और निर्णय के महत्व पर बल देती है।"
    ],
    "points": 360,
    "commentCount": 183,
    "retryCount": 0,
    "time": 1712605341
  },
  {
    "id": 39968761,
    "title": "दुर्भावनापूर्ण नोटपैड ++ प्रतिरूपणकर्ता का मुकाबला करना",
    "originLink": "https://notepad-plus-plus.org/news/help-to-take-down-parasite-site/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39968761",
    "commentBody": "",
    "originSummary": [
      "https://notepad.plus/ वेबसाइट आधिकारिक नोटपैड ++ साइट के रूप में मुखौटा लगा रही है, जिसमें दुर्भावनापूर्ण विज्ञापन हैं जो उपयोगकर्ता सुरक्षा को खतरा देते हैं।",
      "यह उपयोगकर्ताओं को प्रामाणिक साइट, notepad-plus-plus.org से भ्रामक रणनीति से लाभ के लिए चलाने का इरादा रखता है।",
      "उपयोगकर्ताओं को नोटपैड ++ समुदाय की सुरक्षा के लिए साइट को हानिकारक के रूप में रिपोर्ट करना चाहिए और एक सुरक्षित ऑनलाइन स्थान सुनिश्चित करना चाहिए।"
    ],
    "commentSummary": [
      "वेबसाइट notepad-plus-plus.org धोखेबाज रणनीति के लिए आग में है, जैसे उपयोगकर्ताओं को आधिकारिक नोटपैड ++ साइट पर पुनर्निर्देशित करना, स्केची डाउनलोड लिंक की आशंका को बढ़ाना।",
      "उपयोगकर्ता साइट के सुरक्षा निहितार्थ और विज्ञापन-संचालित लाभ उद्देश्यों के बारे में चिंता करते हैं, इसके संभावित धोखाधड़ी व्यवहार पर चर्चा करते हैं।",
      "दुर्भावनापूर्ण इरादे पर बहस उत्पन्न होती है, भ्रामक वेबसाइटों से जुड़े जोखिमों को कम करने और डोमेन नियंत्रण और ब्रांड सुरक्षा पर जोर देने के लिए केवल आधिकारिक चैनलों से सॉफ़्टवेयर डाउनलोड की सोर्सिंग के महत्व पर जोर दिया जाता है।"
    ],
    "points": 337,
    "commentCount": 98,
    "retryCount": 0,
    "time": 1712577120
  },
  {
    "id": 39974374,
    "title": "OLMo 7B: ओपन लैंग्वेज मॉडल के साथ AI रिसर्च को सशक्त बनाना",
    "originLink": "https://blog.allenai.org/hello-olmo-a-truly-open-llm-43f7e7359222?gi=760105621962",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39974374",
    "commentBody": "",
    "originSummary": [
      "एलन इंस्टीट्यूट फॉर एआई ने ओएलएमओ 7 बी लॉन्च किया है, जो एक खुला बड़ा भाषा मॉडल ढांचा है, जो शोधकर्ताओं और डेवलपर्स को भाषा मॉडल विज्ञान को सामूहिक रूप से आगे बढ़ाने में सुविधा प्रदान करता है।",
      "OLMo में पारदर्शिता और सहयोग को बढ़ावा देने के उद्देश्य से सटीक और टिकाऊ AI अनुसंधान के लिए प्रीट्रेनिंग डेटा, प्रशिक्षण कोड और मूल्यांकन सूट शामिल हैं।",
      "हगिंग फेस और गिटहब पर उपलब्ध, ओएलएमओ एआई अनुसंधान समुदाय के लाभ के लिए जिम्मेदार एआई प्रौद्योगिकी विकास को प्रोत्साहित करता है।"
    ],
    "commentSummary": [
      "बहस allenai.org से ओएलएमओ भाषा मॉडल के लाइसेंसिंग और खुलेपन पर केंद्रित है, व्युत्पन्न कार्यों के लिए व्युत्पन्न प्रभाव रिपोर्ट की आवश्यकता पर जोर देती है और एक विकल्प के रूप में पाइल डेटासेट को उजागर करती है।",
      "पाइल डेटासेट के बारे में कानूनी और नैतिक चिंताएं, डेटाब्रिक्स के साथ एएमडी पर प्रशिक्षण मॉडल, बंद एआई सिस्टम के संभावित जोखिम और अधिक खुले और पारदर्शी एआई सिस्टम के लिए कॉल का पता लगाया जाता है।",
      "बातचीत पूर्वाग्रह, पारदर्शिता, कॉपीराइट संरक्षण और मॉडल विकास में कलात्मक स्वतंत्रता और नैतिक विचारों के बीच संतुलन खोजने, लामा जैसे प्रतियोगियों को संदर्भित करने और OpenAI और Anthropic जैसी कंपनियों द्वारा बंद मॉडल की तुलना करने में तल्लीन करती है।"
    ],
    "points": 262,
    "commentCount": 37,
    "retryCount": 0,
    "time": 1712615217
  },
  {
    "id": 39969131,
    "title": "वाला: गनोम टेक्नोलॉजीज के लिए ऑब्जेक्ट-ओरिएंटेड प्रोग्रामिंग",
    "originLink": "https://vala.dev/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39969131",
    "commentBody": "",
    "originSummary": [
      "वाला एक ऑब्जेक्ट-ओरिएंटेड प्रोग्रामिंग लैंग्वेज है जो गोबेक्ट और जीटीके जैसे गनोम टूल्स के साथ मूल रूप से संगत है, जो उच्च-स्तरीय अमूर्त और तेजी से देशी बाइनरी संकलन पेश करती है।",
      "यह पहले से मौजूद सी कोड के उपयोग की सुविधा प्रदान करता है, जो इसे जीयूआई ऐप, कमांड-लाइन टूल और पुस्तकालयों को क्राफ्ट करने के लिए इष्टतम बनाता है, जो ओपन-सोर्स समुदाय से जीवंत समर्थन का दावा करता है।",
      "उपयोगकर्ता वाला परियोजनाओं में तल्लीन हो सकते हैं, डिस्कॉर्ड और मैट्रिक्स जैसे प्लेटफार्मों पर सामुदायिक चर्चाओं में संलग्न हो सकते हैं, वर्तमान संस्करण 0.56.13 और निरंतर विकास पर खड़ा है।"
    ],
    "commentSummary": [
      "बातचीत वाला प्रोग्रामिंग लैंग्वेज में तल्लीन करती है, जीटीके और अन्य फ्रेमवर्क अनुप्रयोगों को बनाने में इसकी भूमिका, विशेष रूप से फ्रिडा और डिनो जैसी परियोजनाओं में, इलेक्ट्रॉन जैसे अधिक पोर्टेबल समाधानों की ओर बढ़ने और स्किटर जैसे ढांचे के साथ चुनौतियों के बीच।",
      "चर्चाएँ क्यूटी और अवलोनियायूआई जैसे विकल्पों पर भी स्पर्श करती हैं, कोड आकार को कम करने, विभिन्न जीयूआई टूलकिट को एकीकृत करने और स्विफ्ट, सी # और जावा जैसी भाषाओं के साथ मेमोरी प्रबंधन और एबीआई संगतता की तुलना करने पर ध्यान केंद्रित करती हैं।",
      "उपयोगकर्ता जीटीके ऐप डेवलपमेंट में वाला की सादगी और संभावित अपग्रेड में रुचि के लिए उदासीनता दोनों व्यक्त करते हैं, जैसे गनोम संभवतः फ्लटर जैसी आधुनिक तकनीकों को गले लगाते हुए, गनोम समुदाय के भीतर डेस्कटॉप ऐप विकास में वृद्धि के लिए वाला के अद्वितीय पहलुओं, चुनौतियों और क्षेत्रों को उजागर करता है।"
    ],
    "points": 248,
    "commentCount": 175,
    "retryCount": 0,
    "time": 1712580297
  },
  {
    "id": 39968103,
    "title": "ब्लॉकी: स्थानीय नेटवर्क के लिए DNS प्रॉक्सी और विज्ञापन-अवरोधक",
    "originLink": "https://0xerr0r.github.io/blocky/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39968103",
    "commentBody": "",
    "originSummary": [
      "ब्लॉकी ब्लॉकी एक डीएनएस प्रॉक्सी और विज्ञापन-अवरोधक है जिसे स्थानीय नेटवर्क के लिए डिज़ाइन किया गया है, जिसे गो में विकसित किया गया है, जो बाहरी सूचियों के साथ डीएनएस प्रश्नों को फ़िल्टर करने, प्रत्येक क्लाइंट समूह के लिए व्यक्तिगत काले और सफेद सूचियों, उन्नत डीएनएस सेटअप विकल्पों, कई प्रोटोकॉल के लिए समर्थन, मजबूत सुरक्षा और गोपनीयता उपायों जैसी सुविधाओं की पेशकश करता है।",
      "प्लेटफ़ॉर्म सादगी, प्रदर्शन और सामुदायिक सहायता को प्राथमिकता देता है, यह सुनिश्चित करता है कि कोई उपयोगकर्ता डेटा संग्रह न हो और ओपन-सोर्स कोड प्रदान न करे।",
      "ब्लॉकी ब्लॉकी उपयोगकर्ता की गोपनीयता पर जोर देने के साथ काम करता है, जिससे यह स्थानीय नेटवर्क पर डीएनएस प्रश्नों के प्रबंधन के लिए एक विश्वसनीय विकल्प बन जाता है।"
    ],
    "commentSummary": [
      "चर्चा इंटरनेट सुरक्षा और गोपनीयता को बढ़ावा देने के लिए ब्लॉकी, पाई-होल, एडगार्ड होम और डीएनस्क्रिप्ट-प्रॉक्सी जैसे डीएनएस ब्लॉकिंग टूल पर केंद्रित है।",
      "उपयोगकर्ता विज्ञापन-अवरोधक तकनीकों जैसे नेटवर्क-स्तरीय ब्लॉकर्स, ब्राउज़र एक्सटेंशन और एडब्लॉक-सक्षम YouTube विकल्पों के बारे में बात करते हैं।",
      "विज्ञापन-अवरोधन के कारण कुछ वेबसाइटों के खराब होने के साथ चुनौतियां उत्पन्न होती हैं, लेकिन पाई-होल रिमोट और ब्राउज़र एक्सटेंशन जैसे समाधान अस्थायी विकलांगता विकल्प प्रदान करते हैं, जो इंटरनेट ब्राउज़िंग और नेटवर्क सुरक्षा के लिए विभिन्न डीएनएस ब्लॉकिंग टूल का उपयोग करने के पेशेवरों और विपक्षों को प्रदर्शित करते हैं।."
    ],
    "points": 224,
    "commentCount": 94,
    "retryCount": 0,
    "time": 1712570868
  },
  {
    "id": 39971673,
    "title": "एंड्रॉइड का फाइंड माई डिवाइस: आसानी से डिवाइस और आइटम का पता लगाएं",
    "originLink": "https://blog.google/products/android/android-find-my-device/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39971673",
    "commentBody": "",
    "originSummary": [
      "एंड्रॉइड पर नया फाइंड माई डिवाइस फीचर उपयोगकर्ताओं को एक अरब से अधिक एंड्रॉइड डिवाइसों के विशाल नेटवर्क का लाभ उठाकर खोए हुए उपकरणों और वस्तुओं का पता लगाने में सक्षम बनाता है।",
      "यह ऑफ़लाइन स्थान ट्रैकिंग, ब्लूटूथ टैग समर्थन, निकटता ट्रैकिंग, नेस्ट उपकरणों के साथ एकीकरण और संपर्कों के साथ सहायक उपकरण साझा करने की क्षमता जैसे कई ट्रैकिंग विकल्प प्रदान करता है।",
      "यह सुविधा सुरक्षा, गोपनीयता की गारंटी देती है, और एंड्रॉइड 9 और इसके बाद के संस्करण पर काम करने वाले उपकरणों के साथ काम करती है, जेबीएल और सोनी जैसे ब्रांडों के हेडफ़ोन के लिए आगामी अपडेट के साथ फाइंड माई डिवाइस नेटवर्क में एकीकृत करने के लिए।"
    ],
    "commentSummary": [
      "फ़ोरम टाइल और Apple Airtags जैसे विभिन्न ट्रैकिंग उपकरणों पर चर्चा करता है, उनकी विशेषताओं, सीमाओं और चोरी-रोधी प्रभावशीलता की तुलना करता है।",
      "उपयोगकर्ता तकनीकी कंपनियों के बीच इंटरऑपरेबिलिटी चुनौतियों, स्थान ट्रैकिंग के साथ गोपनीयता के मुद्दों और उद्योग मानकीकरण के लिए कॉल को संबोधित करते हैं।",
      "सुझावों में यूडब्ल्यूबी तकनीक का उपयोग करना, गोपनीयता नियंत्रण के लिए हार्डवेयर स्विच को शामिल करना और ऐप्पल और गूगल द्वारा छोटे व्यवसायों के लिए नवाचार को दबाने के बारे में चिंता व्यक्त करते हुए डिवाइस ट्रैकिंग सिस्टम को बढ़ाना शामिल है।"
    ],
    "points": 207,
    "commentCount": 276,
    "retryCount": 0,
    "time": 1712595834
  },
  {
    "id": 39968382,
    "title": "कैसे डिजिटल उपकरण कार्पोरेशन इंजीनियरों ने ईथरनेट को बचाया",
    "originLink": "https://spectrum.ieee.org/how-dec-engineers-saved-ethernet",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39968382",
    "commentBody": "",
    "originSummary": [
      "डिजिटल उपकरण कार्पोरेशन के इंजीनियरों ने लैन प्रदर्शन को बढ़ाने और ईथरनेट को संरक्षित करने के लिए एक क्रांतिकारी शिक्षण पुल प्रौद्योगिकी बनाई।",
      "एलन किर्बी और मार्क केम्पफ ने इस नवीन तकनीक को विकसित करने में महत्वपूर्ण भूमिका निभाई।"
    ],
    "commentSummary": [
      "बातचीत विविध नेटवर्किंग विषयों जैसे ईथरनेट प्रौद्योगिकी विकास, नेटवर्क गति उन्नयन, और आईपीवी 4 से आईपीवी 6 या यहां तक कि आईपीवी 7 में संक्रमण पर बहस करती है।",
      "यह पता स्थान, आईपीवी 6 में साइट-स्थानीय पते और नए नेटवर्किंग प्रोटोकॉल को अपनाने के पेशेवरों और विपक्षों के विस्तार जैसी चुनौतियों पर भी चर्चा करता है।",
      "कुल मिलाकर, चर्चा नेटवर्किंग बुनियादी ढांचे को बढ़ाने और ठीक करने पर विचार करने के लिए पेचीदगियों और कारकों पर प्रकाश डालती है।"
    ],
    "points": 206,
    "commentCount": 73,
    "retryCount": 0,
    "time": 1712573520
  },
  {
    "id": 39969448,
    "title": "Cloudflare डेटा सेंटर पावर आउटेज के बाद लचीलापन बढ़ाता है",
    "originLink": "https://blog.cloudflare.com/major-data-center-power-failure-again-cloudflare-code-orange-tested",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39969448",
    "commentBody": "",
    "originSummary": [
      "क्लाउडफ्लेयर को अपने पोर्टलैंड डेटा सेंटर में एक महत्वपूर्ण बिजली आउटेज का सामना करना पड़ा, जो पांच महीने के भीतर दूसरा था, लेकिन संवर्द्धन के लिए धन्यवाद, वे सेवाओं में न्यूनतम व्यवधान के साथ तेजी से ठीक हो गए।",
      "आउटेज स्विचबोर्ड में अत्यधिक संवेदनशील ओवरकुरेंट सुरक्षा के परिणामस्वरूप हुआ, जिसे अब ठीक कर दिया गया है, क्योंकि टीम मैन्युअल हस्तक्षेपों से बचने के लिए एनालिटिक्स प्लेटफॉर्म के लिए लचीलापन कार्यक्रम को अंतिम रूप देने को प्राथमिकता देती है और परिचालन संवर्द्धन के लिए फ्लेक्सेंशियल के साथ टीम बनाती है।",
      "Cloudflare मजबूत सेवाएं प्रदान करने, नौकरी की संभावनाएं पैदा करने और परिचालन उत्कृष्टता के लिए प्रयास करने के लिए प्रतिबद्ध है।"
    ],
    "commentSummary": [
      "क्लाउडफ्लेयर ने एक महत्वपूर्ण डेटा सेंटर बिजली विफलता का अनुभव किया, जिससे भविष्य की घटना की रोकथाम के लिए रैक-स्तरीय यूपीएस सिस्टम को तैनात करने के बारे में बातचीत हुई।",
      "Cloudflare के आउटेज इतिहास और शमन रणनीतियों के बाद, तीसरे पक्ष द्वारा प्रबंधित डेटा केंद्रों में बिजली अतिरेक, उपकरण रखरखाव और सुरक्षा पर जोर दिया गया था।",
      "चर्चाओं ने सुरक्षा जोखिमों, विफलता के एकल बिंदुओं और कुबेरनेट्स क्लस्टर, भौगोलिक दागी, सहनशीलता और वितरित आर्किटेक्चर में बेहतर विश्वसनीयता के लिए एक ही विश्वव्यापी क्लस्टर पर कई समूहों की संभावना जैसे समाधानों का पता लगाया।"
    ],
    "points": 179,
    "commentCount": 38,
    "retryCount": 0,
    "time": 1712582436
  },
  {
    "id": 39970501,
    "title": "रिवर्स्ट: गो में रिवर्स टनल के साथ सुरक्षित रूप से सेवाओं को उजागर करना",
    "originLink": "https://github.com/flipt-io/reverst",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39970501",
    "commentBody": "",
    "originSummary": [
      "रिवर्स्ट एक लोड-संतुलित रिवर्स-टनल सर्वर है और QUIC और HTTP / 3 पर आधारित सर्वर-क्लाइंट लाइब्रेरी है, जो प्रतिबंधित नेटवर्क से सार्वजनिक इंटरनेट पर सेवा जोखिम की सुविधा प्रदान करता है।",
      "यह एक सुरंग के पीछे कई सेवा उदाहरणों का समर्थन करता है, जहां सुरंग बाइनरी को सार्वजनिक इंटरनेट पर रखा जाता है, और क्लाइंट सर्वर लक्ष्य सुरंग समूहों में शामिल होते हैं।",
      "रिवर्स्ट का उपयोग करने के लिए, टनल सर्वर और उदाहरण सर्वर चलाएं, और कर्ल का उपयोग करके टनल के माध्यम से अनुरोध भेजें।"
    ],
    "commentSummary": [
      "पोस्ट रिवर्स्ट का परिचय देता है, जो गो ओवर एचटीटीपी/3 और क्विक में रिवर्स टनल का उपयोग करने वाली एक परियोजना है, जो अक्सर बदलते आईपी पते और लंबे समय तक रहने वाले कनेक्शन को बाधित करते समय डिबगिंग के लिए फायदेमंद है।",
      "वैकल्पिक उपकरण जैसे Zerotier, wireguard, और wstunnel भी समान उद्देश्यों को प्राप्त करने के विकल्प के रूप में उल्लेख कर रहे हैं.",
      "यह संवर्द्धन, संदर्भ संबंधित परियोजनाओं और आगे की खोज के लिए अतिरिक्त संसाधनों के लिए सुझाव प्रदान करता है।"
    ],
    "points": 172,
    "commentCount": 22,
    "retryCount": 0,
    "time": 1712588652
  },
  {
    "id": 39968384,
    "title": "KDE6 को सुरक्षित करना: D-Bus और Polkit कमजोरियों को संबोधित करना",
    "originLink": "https://security.opensuse.org/2024/04/02/kde6-dbus-polkit.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39968384",
    "commentBody": "",
    "originSummary": [
      "लेख KDE6 रिलीज में D-Bus और Polkit के सुरक्षा निहितार्थों की जांच करता है, इन घटकों में कमजोरियों और संवर्द्धन पर ध्यान केंद्रित करता है।",
      "यह विरासत पैकेजों में असुरक्षित डी-बस सेवाओं से संबंधित मुद्दों, पोलकिट कार्यों में सुरक्षित प्रमाणीकरण की आवश्यकता और केडीई घटकों में फाइल सिस्टम संचालन से जुड़े जोखिमों पर जोर देता है।",
      "सिफारिशों में KAuth ढांचे का उपयोग करना, रूट विशेषाधिकारों के साथ चलने वाली डी-बस सेवाओं से सुरक्षा जोखिमों को संबोधित करना, और विशेषाधिकारों को छोड़ने और केडीई संचालन में पथ पर फ़ाइल वर्णनकर्ताओं का उपयोग करने जैसी सुरक्षित प्रथाओं को अपनाना शामिल है।"
    ],
    "commentSummary": [
      "KDE6 रिलीज़ सुरक्षा पर चर्चा शुरू करती है, D-Bus और Polkit कमजोरियों पर ध्यान केंद्रित करती है, और उपयोगकर्ता PolKit एजेंटों की भेद्यता और विशेषाधिकार वृद्धि संवादों में जानकारी की कमी के बारे में चिंतित हैं।",
      "एंड्रॉइड और विंडोज सुरक्षा सुविधाओं के साथ तुलना की जाती है, जो मजबूत सुरक्षा उपायों के लिए डिजाइन के महत्व पर प्रकाश डालती है।",
      "उपयोगकर्ता केडीई के विकास, प्लाज्मा मोबाइल में संवर्द्धन और प्लाज्मा 5 की हल्की प्रकृति, डेस्कटॉप वातावरण को स्विच करने और लिनक्स सिस्टम में वैकल्पिक आईपीसी और सरल समाधानों के लिए क्षमता प्रतिनिधिमंडल प्रोटोकॉल जैसे संभावित सुधारों की खोज करने में अनुभव साझा करते हैं।"
    ],
    "points": 163,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1712573521
  },
  {
    "id": 39973296,
    "title": "स्टो प्रोजेक्ट स्थिरता के लिए सह-अनुरक्षक चाहता है",
    "originLink": "https://savannah.gnu.org/bugs/index.php?65569",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39973296",
    "commentBody": "",
    "originSummary": [
      "स्टो प्रोजेक्ट का वर्तमान अनुरक्षक स्थिरता के मुद्दों के कारण सह-अनुरक्षक की तलाश कर रहा है, जिसमें पर्ल में प्रवीणता, स्टोव के साथ परिचितता, कोड समीक्षाओं में कौशल, गिट और ओपन-सोर्स प्रोजेक्ट, मजबूत संचार और प्रभावी समन्वय की आवश्यकता होती है।",
      "नए सह-अनुरक्षक को प्रतिबद्धता स्तर में लचीलेपन के साथ, फॉलो-अप के बिना मदद की पेशकश करने से बचते हुए प्रभावी ढंग से प्रतिबद्ध होना चाहिए।",
      "रुचि रखने वालों से आग्रह किया जाता है कि वे पुल अनुरोधों (पीआर) की समीक्षा और जमा करके इसमें शामिल हों।"
    ],
    "commentSummary": [
      "उपयोगकर्ता YADM, Chezmoi और Nix जैसे वैकल्पिक उपकरणों के साथ-साथ पैकेज और डॉटफाइल को संभालने में GNU Stow की उपयोगिता पर बहस कर रहे हैं।",
      "पैकेज प्रबंधन के लिए स्टोव की प्रभावशीलता पर राय अलग-अलग होती है, जिससे यूनिक्स सिस्टम पर सॉफ़्टवेयर इंस्टॉलेशन को कॉन्फ़िगर करने के विभिन्न दृष्टिकोणों पर चर्चा होती है।",
      "बातचीत सिम्लिंक, सॉफ्टवेयर संस्करणों, पर्ल स्क्रिप्ट के उपयोग और प्रोग्रामिंग भाषाओं की दीर्घायु के प्रबंधन में तल्लीन करती है।"
    ],
    "points": 147,
    "commentCount": 75,
    "retryCount": 0,
    "time": 1712607613
  }
]
