[
  {
    "id": 40410404,
    "title": "نقد برنامج أرتميس التابع لناسا: التكاليف المرتفعة والتعقيد وعدم الكفاءة",
    "originLink": "https://idlewords.com/2024/5/the_lunacy_of_artemis.htm",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40410404",
    "commentBody": "",
    "originSummary": [
      "ينتقد المقال برنامج أرتميس التابع لناسا بسبب تعقيده وتكاليفه المرتفعة وعدم كفاءته مقارنة ببعثات أبولو ، على الرغم من التقدم التكنولوجي.",
      "تشمل الانتقادات الرئيسية التكاليف المرتفعة والتكنولوجيا القديمة لنظام الإطلاق الفضائي (SLS) ، وتحديات التصميم مع المركبة الفضائية أوريون ، والتعقيد الإضافي ومخاطر استخدام مدار هالو شبه المستقيم (NRHO).",
      "يعتبر الجدول الزمني الطموح لإعادة البشر إلى القمر بحلول عام 2026 غير واقعي ، مع تأخيرات محتملة وتكاليف متصاعدة ، مما يهدد بالتأجيل الدائم للهبوط المأهول على سطح القمر."
    ],
    "commentSummary": [
      "تقارن المناقشة الحلول المبتكرة لمهمة أبولو للسفر إلى القمر مع تحديات استكشاف الفضاء الحديثة ، وتسلط الضوء على التعقيدات والمخاطر.",
      "ينتقد عدم كفاءة ناسا وممارساتها البيروقراطية وتقنياتها القديمة ، ويقارنها بمناهج سبيس إكس المبتكرة.",
      "تؤكد المحادثة على القيود السياسية والمالية على برنامج أرتميس التابع لناسا ، والدعوة إلى بعثات روبوتية أكثر فعالية من حيث التكلفة واستكشاف دوافع وفوائد استكشاف الفضاء."
    ],
    "points": 553,
    "commentCount": 384,
    "retryCount": 0,
    "time": 1716159761
  },
  {
    "id": 40414316,
    "title": "3M تثبط نتائج الكيميائي بشأن السلفونات المشبع بالفلور أوكتين السام في دم الإنسان لعقود",
    "originLink": "https://www.propublica.org/article/3m-forever-chemicals-pfas-pfos-inside-story",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40414316",
    "commentBody": "",
    "originSummary": [
      "واكتشفت كريس هانسن، وهي كيميائية في شركة 3M، في عام 1997 أن السلفونات المشبع بالفلور أوكتين، وهو مادة كيميائية ضارة، كانت موجودة في دم الإنسان، ولكن بحثها أوقفه رؤساؤها الذين أكدوا لها سلامته.",
      "بعد عقود ، تفرض وكالة حماية البيئة إزالة المواد الكيميائية PFAS من مياه الشرب ، وتكشف أن شركة 3M كانت على علم بسمية السلفونات المشبع بالفلور أوكتين منذ سبعينيات القرن العشرين ولكنها استمرت في الإنتاج.",
      "على الرغم من تسوية بقيمة 12.5 مليار دولار لمعالجة تلوث PFAS ، لا تزال التكلفة الكاملة والمسؤولية دون حل ، حيث يتطوع هانسن الآن في الحفاظ على البيئة."
    ],
    "commentSummary": [
      "أقنع المسؤولون التنفيذيون في شركة 3M العالم جونسون بإخفاء النتائج الضارة حول المواد الكيميائية للسلفونات المشبع بالفلور أوكتين، مما يسلط الضوء على ثقافة لا تشجع على معالجة مثل هذه المخاوف.",
      "تنتقد المناقشة السرية والقضايا الأخلاقية لشركة 3M ، وتدعو إلى إجراء أبحاث مستقلة ، ولوائح أقوى ، وعقوبات صارمة على سوء سلوك الشركات.",
      "ويؤكد النص على الحاجة إلى تحسين حماية المبلغين عن المخالفات والإصلاحات النظامية لمساءلة الشركات والمديرين التنفيذيين عن الأعمال غير الأخلاقية."
    ],
    "points": 355,
    "commentCount": 215,
    "retryCount": 0,
    "time": 1716204311
  },
  {
    "id": 40409588,
    "title": "عملية CHARM: الوصول الشامل إلى كتيبات إصلاح السيارات لجميع العلامات التجارية الكبرى",
    "originLink": "https://charm.li/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40409588",
    "commentBody": "",
    "originSummary": [
      "عملية CHARM يقدم كتيبات إصلاح السيارات لمختلف ماركات السيارات، مثل أكورا، أودي، بي ام دبليو، شيفروليه، فورد، هوندا، وتويوتا.",
      "هدف المبادرة هو جعل أدلة الخدمة في متناول الجمهور."
    ],
    "commentSummary": [
      "توفر عملية CHARM (charm.li) أدلة إصلاح السيارات المقرصنة ، بشكل أساسي من ALLDATA ، حتى عام 2013 ، حيث تعتمد الأدلة الأحدث على الاشتراك ويصعب أرشفتها.",
      "الخدمة أكثر شيوعا في أمريكا الشمالية ولكنها تفتقر إلى تغطية لنماذج معينة ، وخاصة السيارات غير الأمريكية ، وتواجه انتقادات لانتهاك حقوق الطبع والنشر والمعلومات غير الكاملة.",
      "تؤكد أدلة السيارات الحديثة على استبدال الأجزاء بدلا من استكشاف الأخطاء وإصلاحها التفصيلية ، مما يجعل الإصلاحات أكثر صعوبة للميكانيكيين العاديين بسبب الحاجة إلى معدات متخصصة."
    ],
    "points": 253,
    "commentCount": 74,
    "retryCount": 0,
    "time": 1716151152
  },
  {
    "id": 40413891,
    "title": "أوبر تنقل بنجاح بيانات دفتر الأستاذ تريليون إدخال إلى LedgerStore المخصص",
    "originLink": "https://www.uber.com/blog/migrating-from-dynamodb-to-ledgerstore/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40413891",
    "commentBody": "",
    "originSummary": [
      "قامت أوبر بترحيل أكثر من تريليون إدخال بيانات دفتر الأستاذ من DynamoDB إلى LedgerStore (LSG) المصمم خصيصا لتعزيز كفاءة التكلفة وتبسيط البنية وتحسين الأداء.",
      "تضمن الترحيل 1.2 بيتابايت من السجلات غير القابلة للتغيير و 0.5 بيتابايت من الفهارس الثانوية ، مما يضمن اكتمال البيانات وصحتها دون تعطيل العمليات ، وتحقيق دقة 99.99٪.",
      "استخدمت العملية Apache Spark للتعامل مع أحجام البيانات الكبيرة ومعالجة تحديات مثل أخطاء التعليمات البرمجية ومهلات RPC مع محددات المعدل واستراتيجيات الطرح المحافظة ، وإكمال الترحيل لمدة عامين دون توقف."
    ],
    "commentSummary": [
      "يعد ترحيل بيانات دفتر الأستاذ التي تبلغ 1.7 بيتابايت من Uber من DynamoDB إلى SQLite أمرا غير عملي نظرا لقابلية توسع SQLite وقيود حجم الكتابة العالية.",
      "تنتقد المناقشة استراتيجيات أوبر لتوفير التكاليف، وتتساءل عن جدوى الحلول المخصصة وتكاليفها الخفية مقابل الخدمات السحابية التجارية مثل DynamoDB.",
      "تسلط المحادثة الضوء على أهمية التخزين الفعال للبيانات ، وتعقيدات ترحيل أنظمة المؤسسة ، والحاجة إلى توثيق شامل ومعايير موثوقة لجذب العملاء."
    ],
    "points": 234,
    "commentCount": 240,
    "retryCount": 0,
    "time": 1716199296
  },
  {
    "id": 40410341,
    "title": "قامت شركة Hertz بشحن زائد لمستأجري Tesla للحصول على الغاز بسبب خطأ في النظام ، مما أدى إلى استرداد الأموال",
    "originLink": "https://www.thedrive.com/news/hertz-charging-a-tesla-renter-for-gas-was-not-an-isolated-incident",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40410341",
    "commentBody": "",
    "originSummary": [
      "كانت هيرتز تفرض عن طريق الخطأ رسوما على العملاء مقابل البنزين في تأجير السيارات الكهربائية (EV) ، وتحديدا Teslas ، بسبب \"خطأ في الأنظمة\" استمر لأكثر من عام.",
      "قامت الشركة بتصحيح المشكلة وتقدم المبالغ المستردة والائتمانات للعملاء المتأثرين ، ولكن تم انتقاد خدمة العملاء الخاصة بهم لصعوبة الوصول إليها.",
      "أدت أخطاء الفواتير هذه وتحديات خدمة العملاء إلى عدم الرضا ويمكن أن تردع تأجير المركبات الكهربائية في المستقبل من هرتز."
    ],
    "commentSummary": [
      "تم اتهام هيرتز بفرض رسوم على مستأجري تسلا مقابل الغاز ، مما يسلط الضوء على ممارسات الفوترة المشكوك فيها على نطاق أوسع في صناعة تأجير السيارات ، بما في ذلك الرسوم الباهظة لخدمات مثل EZ Pass دون إفصاح واضح.",
      "يواجه العملاء صعوبات في الطعن في هذه الرسوم بسبب الفواتير المربكة والطباعة الدقيقة ، مما يؤدي إلى إحباط هذه الشركات وتجنبها ؛ تتضمن المشكلات الرسوم غير الصحيحة ، والمبالغ المستردة البطيئة ، وتكتيكات المبيعات عالية الضغط.",
      "وتؤكد المناقشة على الحاجة إلى لوائح وحماية أقوى للمستهلك، واقتراح عقوبات أكثر صرامة على سوء سلوك الشركات، وتعزيز قوانين حماية المستهلك، وإمكانية اللجوء من خلال محكمة المطالبات الصغيرة أو الإجراءات التشريعية."
    ],
    "points": 218,
    "commentCount": 181,
    "retryCount": 0,
    "time": 1716159121
  },
  {
    "id": 40409718,
    "title": "دفع Raspberry Pi 5 إلى 3.3 جيجاهرتز: الحد الأدنى من المكاسب على الرغم من اختراق الجهد",
    "originLink": "https://jonatron.github.io/randomstuff/pivolt/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40409718",
    "commentBody": "",
    "originSummary": [
      "حاول المؤلف تجاوز رفع تردد التشغيل 3.14 جيجاهرتز على Raspberry Pi 5 لكنه وجد أن النظام غير مستقر عند 3.3 جيجاهرتز.",
      "لتحقيق ذلك ، تحايل المؤلف على حد 1V الذي تفرضه البرامج الثابتة ل Raspberry Pi عن طريق تعديل ذاكرة النظام وإنشاء خدمة لإدارة تردد وحدة المعالجة المركزية والجهد.",
      "على الرغم من الوصول إلى سرعة أعلى على مدار الساعة ، إلا أن مكاسب الأداء كانت ضئيلة ، مما يشير إلى أن الجهد قد لا يكون مجديا."
    ],
    "commentSummary": [
      "قام مستخدم يدعى jonatron برفع تردد التشغيل عن Raspberry Pi 5 إلى 3.14 جيجاهرتز ، متجاوزا الرقم القياسي السابق البالغ 3.3 جيجاهرتز الذي سجله جيف جيرلينج.",
      "سلطت المناقشات الضوء على السرعة الافتراضية المثلى البالغة 2.4 جيجاهرتز لشريحة BCM2712 ، بسبب تناقص العوائد وزيادة استهلاك الطاقة بسرعات أعلى.",
      "تضمنت المحادثة مناقشات حول طرق التبريد ، ومقارنات الأداء مع وحدات المعالجة المركزية القديمة ، وعدم وجود دعم تسريع الأجهزة في نواة Linux الرئيسية ل Raspberry Pi 5."
    ],
    "points": 200,
    "commentCount": 43,
    "retryCount": 0,
    "time": 1716152556
  },
  {
    "id": 40415646,
    "title": "سد الفجوة: لماذا يكافح الباحثون عن عمل وأصحاب العمل للتواصل",
    "originLink": "https://news.ycombinator.com/item?id=40415646",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40415646",
    "commentBody": "",
    "originSummary": [
      "يناقش المؤلف المفارقة حيث يكافح كل من الباحثين عن عمل وأصحاب العمل للعثور على تطابقات مناسبة ، حيث غالبا ما تكون إعلانات الوظائف إما محددة للغاية أو واسعة جدا.",
      "وهي تسلط الضوء على التكاليف المرتفعة لمنصات نشر الوظائف والمخاطر المرتبطة بتوظيف المرشحين الخطأ، لا سيما بالنسبة للشركات الناشئة.",
      "يسعى المؤلف إلى الحصول على مدخلات حول الحلول والخبرات الفعالة من الآخرين لسد الفجوة بين قوائم الوظائف ومتطلبات الوظيفة الفعلية."
    ],
    "commentSummary": [
      "يواجه سوق العمل مفارقة حيث يكافح الباحثون عن عمل للعثور على عمل ، ولا يمكن لأصحاب العمل العثور على مرشحين مناسبين بسبب إعلانات الوظائف غير المتطابقة والتوقعات غير الواقعية.",
      "تتفاقم البطالة الهيكلية في مجال التكنولوجيا بسبب عدم تطابق المهارات وممارسات التوظيف غير الفعالة ، بما في ذلك المرشحات الخوارزمية والمناهج غير الموحدة.",
      "تشمل الحلول المقترحة إعادة التدريب ، وتبسيط المقابلات ، والتركيز على المهارات الأساسية ، وتحسين الشبكات ، مع انتقاد استخدام اختبارات الذكاء ، والنقل إلى الخارج ، والحاجة إلى استراتيجيات أفضل لتدريب الموظفين والاحتفاظ بهم."
    ],
    "points": 187,
    "commentCount": 263,
    "retryCount": 0,
    "time": 1716214259
  },
  {
    "id": 40414718,
    "title": "تسمح الثغرة الأمنية الحرجة في PDF.js بتنفيذ جافا سكريبت بشكل تعسفي",
    "originLink": "https://codeanlabs.com/blog/research/cve-2024-4367-arbitrary-js-execution-in-pdf-js/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40414718",
    "commentBody": "",
    "originSummary": [
      "اكتشفت Codean Labs CVE-2024-4367 ، وهي ثغرة أمنية في PDF.js Mozilla تسمح بتنفيذ جافا سكريبت بشكل تعسفي عند فتح ملف PDF ضار ، مما يشكل مخاطر أمنية كبيرة.",
      "تؤثر هذه الثغرة الأمنية على جميع مستخدمي Firefox ويمكن أن تؤدي إلى هجمات XSS (البرمجة النصية عبر المواقع) وتنفيذ التعليمات البرمجية الأصلية المحتملة في تطبيقات Electron.",
      "يمكن تخفيف المشكلة عن طريق تحديث PDF.js إلى الإصدار 4.2.67 أو أعلى ، والتحقق من التبعيات ، وضبط إعدادات الأمان ؛ تم الكشف عنه لشركة Mozilla في 26 أبريل 2024 ، مع إصدار الإصلاحات بحلول منتصف مايو 2024."
    ],
    "commentSummary": [
      "CVE-2024-4367 هي ثغرة أمنية في PDF.js تسمح بتنفيذ جافا سكريبت بشكل تعسفي ، مما قد يؤدي إلى هجمات البرمجة النصية عبر المواقع (XSS).",
      "تؤكد المناقشة على تعقيدات أمان الويب ، لا سيما مع جافا سكريبت من جانب العميل والمدخلات غير الموثوق بها ، وتقترح عزل عارضي PDF على أصول مختلفة.",
      "يناقش المشاركون الآثار الأمنية لاستخدام PDF.js ، مع التركيز على مخاطر XSS ، والتوصية بتنفيذ سياسات أمان محتوى قوية في التطبيقات المضمنة PDF.js ، مثل تطبيقات Electron."
    ],
    "points": 178,
    "commentCount": 88,
    "retryCount": 0,
    "time": 1716208031
  },
  {
    "id": 40409956,
    "title": "ممارسات برمجة C الأساسية لسهولة القراءة والصيانة",
    "originLink": "https://github.com/mcinglis/c-style",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40409956",
    "commentBody": "",
    "originSummary": [
      "يؤكد المؤلف على إعطاء الأولوية للصحة وسهولة القراءة والبساطة وقابلية الصيانة في برمجة C على السرعة ، والدعوة إلى رمز واضح وقابل للصيانة قبل التحسين.",
      "تشمل الممارسات الرئيسية استخدام معايير C الحديثة (يفضل C11) ، وتجنب الامتدادات غير القياسية ، واستخدام المسافات فوق علامات التبويب ، والحفاظ على الأسطر أقل من 79 حرفا ، والحفاظ على اللغة الإنجليزية الأمريكية متسقة في التعليمات البرمجية والوثائق.",
      "ينصح الدليل بعدم استخدام الشروط المعقدة وعبارات التبديل ووحدات الماكرو التي تحجب تدفق التحكم ، ويوصي باستخدام \"const\" للثبات ، وتجنب الأنواع غير الموقعة ، وتفضيل هياكل البيانات غير القابلة للتغيير والوظائف النقية."
    ],
    "commentSummary": [
      "يناقش مؤلف كتاب \"C Style: ممارسات برمجة C المفضلة لدي\" وجهات نظرهم المتطورة حول أسلوب الترميز ، مع التركيز على الإنفاذ الميكانيكي والتعليقات في الوقت الفعلي لتحسين جودة الكود.",
      "تشمل الموضوعات الرئيسية موازنة قابلية القراءة والأداء ، وتجنب التحسين السابق لأوانه ، واتخاذ قرارات تعتمد على السياق في البرمجة المضمنة.",
      "تغطي المناقشة معايير الترميز ، مثل حد الأسطر البالغ 80 حرفا ، وعلامات التبويب مقابل المسافات ، وأفضل الممارسات مثل استخدام مطهرات Clang ، وإدارة التبعيات ، وتقليل النطاق المتغير."
    ],
    "points": 176,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1716154748
  },
  {
    "id": 40414565,
    "title": "داخل صنع \"Guberniya\": مقدمة 64k من مراجعة 2017",
    "originLink": "https://www.lofibucket.com/articles/64k_intro.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40414565",
    "commentBody": "",
    "originSummary": [
      "يناقش مقال Pekka Väänänen على lofibucket.com إنشاء مقدمة 64k \"Guberniya\" ، التي تم تقديمها في حفلة مراجعة 2017 التجريبية ، حيث تقدم مقدمة للمشهد الديموقراطي ومفصلة بعد الوفاة للمشروع.",
      "تم تطوير المشروع من قبل فريق مكون من ستة أشخاص باستخدام C ++ و OpenGL وتقنيات عرض مختلفة على مدار أربعة أشهر ، مع تأثيرات من \"Half-Life 2\" والمناظر الطبيعية الأيسلندية وفيلم \"Koyaanisqatsi\".",
      "تشمل الميزات الفنية استخدام Visual Studio 2013 ، وخطاف لوحة مفاتيح مخصص لتحرير التظليل المباشر ، وشوكة GNU Rocket للرسوم المتحركة ، و raymarching مع مكتبة \"hg_sdf\" ، وتحويل فورييه المنفصل المخصص المستند إلى GPU للحصول على صوت ممتد للوقت."
    ],
    "commentSummary": [
      "تركز المناقشة على مقدمات 64k ، وهو شكل من أشكال الفن الرقمي مقيد بحجم ملف 64 كيلو بايت ، مع التركيز على العملية الإبداعية على التفسيرات الفنية.",
      "لاحظ المشاركون تحولا في المجتمع الديموقراطي نحو مقدمات أصغر (4k / 1k) بسبب الجهد الكبير المطلوب لمقدمات 64k ، مما يشير إلى تسجيل عملية الإنشاء أو بثها مباشرة لالتقاط الرحلة الإبداعية.",
      "تسلط المحادثة الضوء على التوقعات المتطورة والأدوات المحسنة ، مما يجعل إنتاج مقدمات 64k عالية الجودة أمرا متطلبا بشكل متزايد."
    ],
    "points": 146,
    "commentCount": 29,
    "retryCount": 0,
    "time": 1716206878
  },
  {
    "id": 40411115,
    "title": "تحسين سياسة التوسع المسؤولة لمنع إساءة استخدام الذكاء الاصطناعي وضمان السلامة",
    "originLink": "https://www.anthropic.com/news/reflections-on-our-responsible-scaling-policy",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40411115",
    "commentBody": "",
    "originSummary": [
      "يوضح منشور \"انعكاسات السياسة على سياسة التوسع المسؤول الخاصة بنا\" تفاصيل تطوير سياسة التوسع المسؤول (RSP) لمنع فشل السلامة وإساءة استخدام النماذج المتقدمة ، مع التركيز على معايير السلامة القوية وتمديد السياسة التكرارية.",
      "وتشمل الالتزامات الرئيسية تحديد واختبار \"قدرات الخط الأحمر\"، وتنفيذ معيار ASL-3 للسلامة الصارمة، وتشكيل فريق متعدد التخصصات لدمج الممارسات من مجالات مثل الأمن النووي والأمن السيبراني.",
      "تهدف المنظمة إلى تعزيز التعاون الصناعي وإبلاغ الجهود الحكومية بشأن أطر إدارة المخاطر ، مع خطط لمناقشتها في قمة سيول الذكاء الاصطناعي."
    ],
    "commentSummary": [
      "تهدف \"سياسة التوسع المسؤول\" الخاصة بشركة أنثروبيك إلى معالجة قدرات الذكاء الاصطناعي عالية المخاطر ، مثل الأسلحة البيولوجية وتهديدات الأمن السيبراني ، من خلال التأكيد على المخاطر المستقبلية وتدابير الاحتواء الصارمة.",
      "يجادل النقاد بأن السياسة متساهلة وأساسية للغاية ، وتدعو إلى معايير أكثر صرامة ، وتحسين استقلالية الذكاء الاصطناعي ، والتوازن بين الابتكار والسلامة.",
      "يسلط النقاش الضوء على وجهات النظر المختلفة حول سلامة الذكاء الاصطناعي والشفافية والآثار الأخلاقية ، حيث يؤكد البعض على التنمية المسؤولة والفهم العام ، بينما يعتقد آخرون أن مخاطر الذكاء الاصطناعي مبالغ فيها لأغراض تسويقية أو تنظيمية."
    ],
    "points": 146,
    "commentCount": 130,
    "retryCount": 0,
    "time": 1716167704
  },
  {
    "id": 40410603,
    "title": "استكشاف الفن التوليدي: تقاطع الخوارزميات والطبيعة والإبداع",
    "originLink": "https://www.amygoodchild.com/blog/what-is-generative-art",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40410603",
    "commentBody": "",
    "originSummary": [
      "يتضمن الفن التوليدي إنشاء عمل فني من خلال عمليات مستقلة ، باستخدام عناصر مثل العشوائية والقواعد والأنظمة الطبيعية ، مع إدخال PRNGs التباين والعشوائية الحقيقية التي يتم الحصول عليها من الظواهر الطبيعية.",
      "يسلط النص الضوء على رواد مثل فيرا مولنار ويستكشف التوليد الإجرائي والفن القائم على القواعد والسلوكيات الناشئة ، مستشهدا بأمثلة مثل تعليمات سول ليويت ولعبة كونواي للحياة.",
      "يتم التأكيد على توازن التحكم بين الفنان والآلة ، مع أمثلة على الفن القائم على البيانات والفن الذكاء الاصطناعي ، وتشجع المقالة على مزيد من الاستكشاف والابتكار في المجال المتطور للفن التوليدي."
    ],
    "commentSummary": [
      "تستكشف المناقشة حول الفن التوليدي العديد من الأدوات والسياقات التاريخية ولغات الترميز مثل Swift و JavaScript ، مع تسليط الضوء على منصات مثل Context Free Art و AARON.",
      "يناقش المساهمون تسييل الفن التوليدي من خلال NFTs ، وتحقيق التوازن بين المتعة الفنية والجدوى التجارية ، ومناقشة دور العشوائية والخوارزميات في الإبداع الفني.",
      "تتناول المحادثة أيضا تأثير الذكاء الاصطناعي على مجالات الفن التقليدي ، وإمكانية الحلول مفتوحة المصدر ، والحاجة إلى الاتصال البشري والسرد في المخرجات التوليدية."
    ],
    "points": 143,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1716162227
  },
  {
    "id": 40410637,
    "title": "برنامج GitHub النصي \"ffmpeg-english\" يلتقط إطارات الفيديو إلى JPG كل ثانية",
    "originLink": "https://github.com/dheera/scripts/blob/master/ffmpeg-english",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40410637",
    "commentBody": "",
    "originSummary": [
      "يتميز مستودع GitHub \"dheera / scripts\" ببرنامج نصي يسمى \"ffmpeg-english\" مع 50 سطرا من التعليمات البرمجية.",
      "حصل المستودع على 8 شوكات و 45 نجمة ، مما يشير إلى اهتمام المجتمع ومشاركته المعتدلة.",
      "يتضمن ميزات شاملة مثل المشكلات وطلبات السحب والإجراءات والمشاريع و wiki ، إلى جانب أحدث محفوظات الالتزام والبيانات الوصفية للملف."
    ],
    "commentSummary": [
      "تركز مناقشة GitHub على التقاط الصور من \"/ dev / video0\" كل ثانية باستخدام \"ffmpeg\" ، حيث يقترح المستخدمون بدائل مثل GitHub Copilot CLI ويعبرون عن مخاوف أمنية بشأن الأوامر التي تم إنشاؤها بواسطة الذكاء الاصطناعي.",
      "يوصي المستخدمون بأدوات مثل \"aichat\" و \"subprocess\". Popen' لتنفيذ أكثر أمانا ، وناقش التوازن بين الراحة والأمان في الذكاء الاصطناعي توليد الأوامر.",
      "تسلط المحادثة الضوء على أهمية فهم الأوامر والتحقق منها ، سواء الذكاء الاصطناعي إنشاؤها أو كتابتها بشريا ، وتناقش دمج الذكاء الاصطناعي في واجهات سطر الأوامر مع الاحتياطات مثل حاويات Docker وتأكيدات المستخدم."
    ],
    "points": 131,
    "commentCount": 91,
    "retryCount": 0,
    "time": 1716162610
  },
  {
    "id": 40409757,
    "title": "تصحيح تشوهات منظور النص باستخدام علامات الحذف المحولة: نهج مبسط",
    "originLink": "https://mzucker.github.io/2016/10/11/unprojecting-text-with-ellipses.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40409757",
    "commentBody": "",
    "originSummary": [
      "تقدم المقالة طريقة مبسطة لتصحيح تشوهات المنظور في الصور النصية باستخدام علامات الحذف المحولة ، مستوحاة من طريقة معقدة من Carlos Merino-Gracia et al.",
      "يتضمن النهج تحديد العتبة وتسمية المكونات المتصلة لعزل الحروف ، ثم استخدام المتجانسات (مصفوفة ذات 8 معلمات) لضبط الصورة بحيث يكون لأشكال الحروف مساحات موحدة.",
      "الطريقة ، التي تتضمن تحويلات المنظور والتدوير والانحراف ، فعالة والكود متاح على GitHub ، على الرغم من أنه ليس على أحدث طراز."
    ],
    "commentSummary": [
      "تناقش المقالة طريقة لتصحيح تشويه المنظور في النص باستخدام الجبر الخطي وضرب المصفوفة وتحويل Hough.",
      "لا تتطلب هذه التقنية تحديد حدود الكلمات أو الصفحات ، والتي يجدها البعض معقدة ولكنها قد تكون مفيدة في سيناريوهات مختلفة.",
      "تتضمن المحادثة مناقشات حول تعقيد الطريقة وفعاليتها وبدائل تصحيح النص ، خاصة في الصور."
    ],
    "points": 128,
    "commentCount": 18,
    "retryCount": 0,
    "time": 1716152897
  }
]
