[
  {
    "id": 40410404,
    "title": "Crítica ao programa Artemis da NASA: Altos custos, complexidade e ineficiência",
    "originLink": "https://idlewords.com/2024/5/the_lunacy_of_artemis.htm",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40410404",
    "commentBody": "",
    "originSummary": [
      "O artigo critica o programa Artemis da NASA por sua complexidade, altos custos e ineficiência em comparação com as missões Apollo, apesar dos avanços tecnológicos.",
      "As principais críticas incluem os altos custos e a tecnologia ultrapassada do Sistema de Lançamento Espacial (SLS), os desafios de projeto da espaçonave Orion e a complexidade e o risco adicionais do uso da órbita de halo quase retilíneo (NRHO).",
      "O ambicioso cronograma de retorno de humanos à Lua até 2026 é considerado irrealista, com possíveis atrasos e custos crescentes, arriscando o adiamento perpétuo do pouso lunar tripulado."
    ],
    "commentSummary": [
      "A discussão compara as soluções inovadoras da missão Apollo para a viagem lunar com os desafios modernos da exploração espacial, destacando as complexidades e os riscos.",
      "Ele critica as ineficiências, as práticas burocráticas e a tecnologia ultrapassada da NASA, contrastando-as com as abordagens inovadoras da SpaceX.",
      "A conversa enfatiza as restrições políticas e financeiras do programa Artemis da NASA, defendendo missões robóticas mais econômicas e explorando as motivações e os benefícios da exploração espacial."
    ],
    "points": 553,
    "commentCount": 384,
    "retryCount": 0,
    "time": 1716159761
  },
  {
    "id": 40414316,
    "title": "A 3M suprimiu as descobertas de um químico sobre PFOS tóxico no sangue humano durante décadas",
    "originLink": "https://www.propublica.org/article/3m-forever-chemicals-pfas-pfos-inside-story",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40414316",
    "commentBody": "",
    "originSummary": [
      "Kris Hansen, uma química da 3M, descobriu em 1997 que o PFOS, um produto químico nocivo, estava presente no sangue humano, mas sua pesquisa foi interrompida por superiores que lhe garantiram a segurança do produto.",
      "Décadas mais tarde, a EPA determinou a remoção dos produtos químicos PFAS da água potável, revelando que a 3M sabia da toxicidade do PFOS desde a década de 1970, mas continuou produzindo.",
      "Apesar de um acordo de US$ 12,5 bilhões para tratar da contaminação por PFAS, o custo total e a responsabilidade continuam sem solução, e Hansen agora é voluntário em conservação ambiental."
    ],
    "commentSummary": [
      "Os executivos da 3M convenceram o cientista Johnson a ocultar descobertas prejudiciais sobre os produtos químicos PFOS, destacando uma cultura que desencoraja a abordagem de tais preocupações.",
      "A discussão critica o sigilo e as questões éticas da 3M, defendendo pesquisas independentes, regulamentações mais rígidas e penalidades severas para a má conduta corporativa.",
      "O texto ressalta a necessidade de melhorar as proteções aos denunciantes e as reformas sistêmicas para responsabilizar as empresas e os executivos por ações antiéticas."
    ],
    "points": 355,
    "commentCount": 215,
    "retryCount": 0,
    "time": 1716204311
  },
  {
    "id": 40409588,
    "title": "Operação CHARM: Acesso universal a manuais de reparo de carros de todas as principais marcas",
    "originLink": "https://charm.li/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40409588",
    "commentBody": "",
    "originSummary": [
      "A Operation CHARM oferece manuais de reparo de automóveis para várias marcas de veículos, como Acura, Audi, BMW, Chevrolet, Ford, Honda e Toyota.",
      "O objetivo da iniciativa é tornar os manuais de serviço facilmente acessíveis ao público."
    ],
    "commentSummary": [
      "A operação CHARM (charm.li) fornece manuais de reparo de carros piratas, principalmente da ALLDATA, até 2013, pois os manuais mais recentes são baseados em assinatura e mais difíceis de arquivar.",
      "O serviço é mais comum na América do Norte, mas não tem cobertura para determinados modelos, especialmente veículos de fora dos EUA, e enfrenta críticas por violação de direitos autorais e informações incompletas.",
      "Os manuais de carros modernos enfatizam a substituição de peças em vez da solução detalhada de problemas, tornando os reparos mais desafiadores para mecânicos casuais devido à necessidade de equipamentos especializados."
    ],
    "points": 253,
    "commentCount": 74,
    "retryCount": 0,
    "time": 1716151152
  },
  {
    "id": 40413891,
    "title": "Uber migra com sucesso dados do Ledger de entrada de trilhões para o LedgerStore personalizado",
    "originLink": "https://www.uber.com/blog/migrating-from-dynamodb-to-ledgerstore/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40413891",
    "commentBody": "",
    "originSummary": [
      "A Uber migrou mais de um trilhão de entradas de dados contábeis do DynamoDB para seu LedgerStore (LSG) personalizado para aumentar a eficiência de custos, simplificar a arquitetura e melhorar o desempenho.",
      "A migração envolveu 1,2 PB de registros imutáveis e 0,5 PB de índices secundários, garantindo a integridade e a correção dos dados sem interromper as operações, alcançando 99,99% de precisão.",
      "O processo utilizou o Apache Spark para lidar com grandes volumes de dados e enfrentou desafios como bugs de código e timeouts de RPC com limitadores de taxa e estratégias conservadoras de implementação, concluindo a migração de dois anos sem tempo de inatividade."
    ],
    "commentSummary": [
      "Migrar os 1,7 petabytes de dados de registro da Uber do DynamoDB para o SQLite é impraticável devido à escalabilidade do SQLite e às limitações de alto volume de gravação.",
      "A discussão critica as estratégias de economia de custos da Uber, questionando a viabilidade e os custos ocultos das soluções personalizadas em comparação com os serviços comerciais em nuvem, como o DynamoDB.",
      "A conversa destaca a importância do armazenamento eficiente de dados, as complexidades da migração de sistemas corporativos e a necessidade de documentação completa e benchmarks confiáveis para atrair clientes."
    ],
    "points": 234,
    "commentCount": 240,
    "retryCount": 0,
    "time": 1716199296
  },
  {
    "id": 40410341,
    "title": "A Hertz cobrou a mais dos locatários da Tesla pela gasolina devido a um erro de sistema, o que levou a reembolsos",
    "originLink": "https://www.thedrive.com/news/hertz-charging-a-tesla-renter-for-gas-was-not-an-isolated-incident",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40410341",
    "commentBody": "",
    "originSummary": [
      "A Hertz tem cobrado erroneamente dos clientes a gasolina no aluguel de veículos elétricos (EV), especificamente Teslas, devido a um \"erro de sistema\" que durou mais de um ano.",
      "A empresa corrigiu o problema e está oferecendo reembolsos e créditos aos clientes afetados, mas seu serviço de atendimento ao cliente foi criticado por ser de difícil acesso.",
      "Esses erros de faturamento e desafios de atendimento ao cliente levaram à insatisfação e podem potencialmente impedir futuros aluguéis de veículos elétricos da Hertz."
    ],
    "commentSummary": [
      "A Hertz foi acusada de cobrar gasolina dos locatários da Tesla, destacando práticas de cobrança questionáveis mais amplas no setor de aluguel de carros, incluindo taxas exorbitantes para serviços como o EZ Pass sem divulgação clara.",
      "Os clientes enfrentam dificuldades para contestar essas cobranças devido a faturas confusas e letras miúdas, o que leva a frustrações e a evitar essas empresas; os problemas incluem cobranças incorretas, reembolsos lentos e táticas de vendas de alta pressão.",
      "A discussão enfatiza a necessidade de regulamentações mais rígidas e proteções ao consumidor, sugerindo penalidades mais rigorosas para a má conduta corporativa, leis de proteção ao consumidor aprimoradas e possíveis recursos por meio de tribunais de pequenas causas ou ações legislativas."
    ],
    "points": 218,
    "commentCount": 181,
    "retryCount": 0,
    "time": 1716159121
  },
  {
    "id": 40409718,
    "title": "Empurrando o Raspberry Pi 5 para 3,3 GHz: Ganhos mínimos apesar do hack de voltagem",
    "originLink": "https://jonatron.github.io/randomstuff/pivolt/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40409718",
    "commentBody": "",
    "originSummary": [
      "O autor tentou superar um overclock de 3,14 GHz em um Raspberry Pi 5, mas achou o sistema instável a 3,3 GHz.",
      "Para conseguir isso, o autor contornou o limite de 1 V imposto pelo firmware do Raspberry Pi modificando a memória do sistema e criando um serviço para gerenciar a frequência e a tensão da CPU.",
      "Apesar de atingir uma velocidade de clock mais alta, os ganhos de desempenho foram mínimos, sugerindo que o esforço pode não valer a pena."
    ],
    "commentSummary": [
      "Um usuário chamado jonatron fez o overclock de um Raspberry Pi 5 para 3,14 GHz, superando o recorde anterior de 3,3 GHz estabelecido por Jeff Geerling.",
      "As discussões destacaram a velocidade padrão ideal de 2,4 GHz para o chip BCM2712, devido à diminuição dos retornos e ao aumento do consumo de energia em velocidades mais altas.",
      "A conversa incluiu debates sobre métodos de resfriamento, comparações de desempenho com CPUs mais antigas e a falta de suporte à aceleração de hardware no kernel principal do Linux para o Raspberry Pi 5."
    ],
    "points": 200,
    "commentCount": 43,
    "retryCount": 0,
    "time": 1716152556
  },
  {
    "id": 40415646,
    "title": "Preenchendo a lacuna: por que candidatos a emprego e empregadores têm dificuldade para se conectar",
    "originLink": "https://news.ycombinator.com/item?id=40415646",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40415646",
    "commentBody": "",
    "originSummary": [
      "O autor discute o paradoxo em que tanto os candidatos a emprego quanto os empregadores lutam para encontrar correspondências adequadas, já que as ofertas de emprego costumam ser muito específicas ou muito amplas.",
      "Eles destacam os altos custos das plataformas de publicação de vagas e os riscos associados à contratação dos candidatos errados, principalmente para as startups.",
      "O autor busca informações sobre soluções eficazes e experiências de outras pessoas para preencher a lacuna entre as listas de empregos e os requisitos reais dos empregos."
    ],
    "commentSummary": [
      "O mercado de trabalho enfrenta um paradoxo em que os candidatos a emprego lutam para encontrar trabalho e os empregadores não conseguem encontrar candidatos adequados devido a anúncios de emprego incompatíveis e expectativas irrealistas.",
      "O desemprego estrutural na área de tecnologia é agravado pela incompatibilidade de habilidades e práticas de contratação ineficazes, incluindo filtros algorítmicos e currículos não padronizados.",
      "As soluções propostas incluem o retreinamento, a simplificação das entrevistas, o foco nas habilidades essenciais e o aprimoramento da rede de contatos, ao mesmo tempo em que criticam o uso de testes de QI, offshoring e a necessidade de melhores estratégias de treinamento e retenção de funcionários."
    ],
    "points": 187,
    "commentCount": 263,
    "retryCount": 0,
    "time": 1716214259
  },
  {
    "id": 40414718,
    "title": "Vulnerabilidade crítica no PDF.js permite a execução arbitrária de JavaScript",
    "originLink": "https://codeanlabs.com/blog/research/cve-2024-4367-arbitrary-js-execution-in-pdf-js/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40414718",
    "commentBody": "",
    "originSummary": [
      "O Codean Labs descobriu a CVE-2024-4367, uma vulnerabilidade no PDF.js do Mozilla que permite a execução arbitrária de JavaScript quando um PDF malicioso é aberto, o que representa riscos significativos à segurança.",
      "Essa vulnerabilidade afeta todos os usuários do Firefox e pode levar a ataques XSS (Cross-Site Scripting) e à possível execução de código nativo em aplicativos Electron.",
      "O problema pode ser atenuado atualizando o PDF.js para a versão 4.2.67 ou superior, verificando as dependências e ajustando as configurações de segurança; ele foi divulgado à Mozilla em 26 de abril de 2024, com correções lançadas em meados de maio de 2024."
    ],
    "commentSummary": [
      "CVE-2024-4367 é uma vulnerabilidade de segurança no PDF.js que permite a execução arbitrária de JavaScript, o que pode levar a ataques de XSS (Cross-Site Scripting).",
      "A discussão enfatiza as complexidades da segurança na Web, especialmente com JavaScript do lado do cliente e entradas não confiáveis, e sugere o isolamento de visualizadores de PDF em origens diferentes.",
      "Os participantes debatem as implicações de segurança do uso do PDF.js, com foco nos riscos de XSS, e recomendam a implementação de políticas robustas de segurança de conteúdo em aplicativos que incorporam o PDF.js, como os aplicativos Electron."
    ],
    "points": 178,
    "commentCount": 88,
    "retryCount": 0,
    "time": 1716208031
  },
  {
    "id": 40409956,
    "title": "Práticas essenciais de programação em C para facilitar a leitura e a manutenção",
    "originLink": "https://github.com/mcinglis/c-style",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40409956",
    "commentBody": "",
    "originSummary": [
      "O autor enfatiza a prioridade da correção, legibilidade, simplicidade e facilidade de manutenção na programação em C em relação à velocidade, defendendo um código claro e de fácil manutenção antes da otimização.",
      "As principais práticas incluem o uso de padrões C modernos (de preferência C11), evitando extensões não padrão, usando espaços em vez de tabulações, mantendo as linhas com menos de 79 caracteres e mantendo o inglês americano consistente no código e na documentação.",
      "O guia desaconselha condicionais complexas, instruções switch e macros que obscurecem o fluxo de controle, recomendando o uso de `const` para imutabilidade, evitando tipos sem sinal e preferindo estruturas de dados imutáveis e funções puras."
    ],
    "commentSummary": [
      "O autor de \"C Style: My favorite C programming practices\" discute suas visões evolutivas sobre o estilo de codificação, enfatizando a aplicação mecanicista e o feedback em tempo real para melhorar a qualidade do código.",
      "Os principais tópicos incluem o equilíbrio entre legibilidade e desempenho, evitando a otimização prematura e tomando decisões dependentes do contexto na programação incorporada.",
      "A discussão aborda padrões de codificação, como o limite de 80 caracteres de linha, tabulações versus espaços e práticas recomendadas, como o uso de sanitizadores Clang, o gerenciamento de dependências e a minimização do escopo de variáveis."
    ],
    "points": 176,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1716154748
  },
  {
    "id": 40414565,
    "title": "Por dentro da criação de \"Guberniya\": Uma introdução de 64k da revisão de 2017",
    "originLink": "https://www.lofibucket.com/articles/64k_intro.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40414565",
    "commentBody": "",
    "originSummary": [
      "O artigo de Pekka Väänänen no lofibucket.com discute a criação da introdução de 64k \"Guberniya\", apresentada na festa de demonstração Revision 2017, fornecendo uma introdução à demoscene e um post-mortem detalhado do projeto.",
      "O projeto foi desenvolvido por uma equipe de seis pessoas usando C++, OpenGL e várias técnicas de renderização durante quatro meses, com influências de \"Half-Life 2\", paisagens islandesas e o filme \"Koyaanisqatsi\".",
      "Os destaques técnicos incluem o uso do Visual Studio 2013, um gancho de teclado personalizado para edição de sombreador ao vivo, GNU Rocket fork para animação, raymarching com a biblioteca `hg_sdf` e uma Transformada de Fourier Discreta baseada em GPU personalizada para áudio com alongamento de tempo."
    ],
    "commentSummary": [
      "A discussão se concentra nas introduções de 64k, uma forma de arte digital limitada a um arquivo de 64 kilobytes, enfatizando o processo criativo em vez de explicações técnicas.",
      "Os participantes observam uma mudança na comunidade demoscene em direção a introduções menores (4k/1k) devido ao esforço significativo necessário para introduções de 64k, sugerindo a gravação ou a transmissão ao vivo do processo de criação para capturar a jornada criativa.",
      "A conversa destaca a evolução das expectativas e as ferramentas aprimoradas, tornando a produção de introduções de 64k de alta qualidade cada vez mais exigente."
    ],
    "points": 146,
    "commentCount": 29,
    "retryCount": 0,
    "time": 1716206878
  },
  {
    "id": 40411115,
    "title": "Refinando a política de dimensionamento responsável para evitar o uso indevido de IA e garantir a segurança",
    "originLink": "https://www.anthropic.com/news/reflections-on-our-responsible-scaling-policy",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40411115",
    "commentBody": "",
    "originSummary": [
      "A postagem \"Policy Reflections on our Responsible Scaling Policy\" (Reflexões sobre nossa Política de Escalonamento Responsável) detalha o desenvolvimento da Política de Escalonamento Responsável (RSP) para evitar falhas de segurança e uso indevido de modelos avançados, enfatizando padrões de segurança robustos e extensão iterativa da política.",
      "Os principais compromissos incluem a identificação e o teste das \"Capacidades da Linha Vermelha\", a implementação do Padrão ASL-3 para segurança rigorosa e a formação de uma equipe interdisciplinar para integrar práticas de áreas como segurança nuclear e segurança cibernética.",
      "A organização tem como objetivo promover a colaboração do setor e informar os esforços do governo sobre as estruturas de gerenciamento de riscos, com planos de discutir essas estruturas na AI Seoul Summit."
    ],
    "commentSummary": [
      "A \"Política de Escalonamento Responsável\" da Anthropic visa abordar recursos de IA de alto risco, como armas biológicas e ameaças à segurança cibernética, enfatizando riscos futuros e medidas de contenção rigorosas.",
      "Os críticos argumentam que a política é muito branda e básica, exigindo padrões mais rígidos, maior autonomia da IA e um equilíbrio entre inovação e segurança.",
      "O debate destaca diferentes pontos de vista sobre a segurança, a transparência e as implicações éticas da IA, com alguns enfatizando o desenvolvimento responsável e a compreensão do público, enquanto outros acreditam que os riscos da IA são exagerados para fins de marketing ou regulatórios."
    ],
    "points": 146,
    "commentCount": 130,
    "retryCount": 0,
    "time": 1716167704
  },
  {
    "id": 40410603,
    "title": "Explorando a arte generativa: A interseção de algoritmos, natureza e criatividade",
    "originLink": "https://www.amygoodchild.com/blog/what-is-generative-art",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40410603",
    "commentBody": "",
    "originSummary": [
      "A arte generativa envolve a criação de obras de arte por meio de processos autônomos, usando elementos como aleatoriedade, regras e sistemas naturais, com PRNGs introduzindo variabilidade e verdadeira aleatoriedade proveniente de fenômenos naturais.",
      "O texto destaca pioneiros como Vera Molnar e explora a geração de procedimentos, a arte baseada em regras e os comportamentos emergentes, citando exemplos como as instruções de Sol LeWitt e o Game of Life de Conway.",
      "O equilíbrio de controle entre o artista e a máquina é enfatizado, com exemplos de arte orientada por dados e de IA, e o artigo incentiva mais exploração e inovação no campo em evolução da arte generativa."
    ],
    "commentSummary": [
      "A discussão sobre arte generativa explora várias ferramentas, contextos históricos e linguagens de codificação como Swift e JavaScript, destacando plataformas como Context Free Art e AARON.",
      "Os colaboradores debatem a monetização da arte generativa por meio de NFTs, equilibrando o prazer artístico com a viabilidade comercial, e discutem o papel da aleatoriedade e dos algoritmos na criação artística.",
      "A conversa também aborda o impacto da IA nos campos artísticos tradicionais, o potencial de soluções de código aberto e a necessidade de conexão humana e narrativa em resultados generativos."
    ],
    "points": 143,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1716162227
  },
  {
    "id": 40410637,
    "title": "Script do GitHub 'ffmpeg-english' captura quadros de vídeo em JPG a cada segundo",
    "originLink": "https://github.com/dheera/scripts/blob/master/ffmpeg-english",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40410637",
    "commentBody": "",
    "originSummary": [
      "O repositório do GitHub \"dheera/scripts\" apresenta um script chamado \"ffmpeg-english\" com 50 linhas de código.",
      "O repositório obteve 8 bifurcações e 45 estrelas, indicando interesse e envolvimento moderados da comunidade.",
      "Ele inclui recursos abrangentes, como problemas, solicitações pull, ações, projetos e um wiki, juntamente com o histórico de commits e metadados de arquivos mais recentes."
    ],
    "commentSummary": [
      "A discussão no GitHub se concentra na captura de imagens de `/dev/video0` a cada segundo usando `ffmpeg`, com usuários sugerindo alternativas como o GitHub Copilot CLI e expressando preocupações de segurança sobre comandos gerados por IA.",
      "Os usuários recomendam ferramentas como `aichat` e `subprocess.Popen` para uma execução mais segura e debatem o equilíbrio entre conveniência e segurança na geração de comandos de IA.",
      "A conversa destaca a importância de compreender e verificar os comandos, sejam eles gerados por IA ou escritos por humanos, e discute a integração da IA às interfaces de linha de comando com precauções como contêineres do Docker e confirmações do usuário."
    ],
    "points": 131,
    "commentCount": 91,
    "retryCount": 0,
    "time": 1716162610
  },
  {
    "id": 40409757,
    "title": "Correção de distorções de perspectiva de texto usando elipses transformadas: Uma abordagem simplificada",
    "originLink": "https://mzucker.github.io/2016/10/11/unprojecting-text-with-ellipses.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40409757",
    "commentBody": "",
    "originSummary": [
      "O artigo apresenta um método simplificado para corrigir distorções de perspectiva em fotografias de texto usando elipses transformadas, inspirado em um método complexo de Carlos Merino-Gracia et al.",
      "A abordagem envolve limiarização e rotulagem de componentes conectados para isolar as letras e, em seguida, usar homografias (uma matriz de 8 parâmetros) para ajustar a imagem de modo que as formas das letras tenham áreas uniformes.",
      "O método, que inclui transformações de perspectiva, rotação e inclinação, é eficaz e o código está disponível no GitHub, embora não seja de última geração."
    ],
    "commentSummary": [
      "O artigo discute um método para corrigir a distorção de perspectiva no texto usando álgebra linear, multiplicação de matriz e a transformação de Hough.",
      "Essa técnica não requer a identificação de limites de palavras ou páginas, o que alguns consideram complexo, mas potencialmente útil em vários cenários.",
      "A conversa inclui debates sobre a complexidade, a eficácia e as alternativas do método para retificação de texto, especialmente em imagens."
    ],
    "points": 128,
    "commentCount": 18,
    "retryCount": 0,
    "time": 1716152897
  }
]
