[
  {
    "id": 40410404,
    "title": "Критика программы НАСА \"Артемида\": Высокие затраты, сложность и неэффективность",
    "originLink": "https://idlewords.com/2024/5/the_lunacy_of_artemis.htm",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40410404",
    "commentBody": "",
    "originSummary": [
      "В статье критикуется программа НАСА \"Артемида\" за ее сложность, высокую стоимость и неэффективность по сравнению с миссиями \"Аполлон\", несмотря на технологический прогресс.",
      "Среди основных критических замечаний - высокая стоимость и устаревшие технологии системы космических запусков (SLS), проблемы с проектированием космического корабля Orion, а также дополнительные сложности и риски, связанные с использованием околопрямоугольной гало-орбиты (NRHO).",
      "Амбициозные сроки возвращения людей на Луну к 2026 году считаются нереальными, возможны задержки и рост расходов, что чревато вечной отсрочкой пилотируемой высадки на Луну."
    ],
    "commentSummary": [
      "В ходе дискуссии инновационные решения миссии \"Аполлон\" для лунного путешествия сравниваются с современными задачами освоения космоса, подчеркиваются сложности и риски.",
      "В ней критикуются неэффективность, бюрократизм и устаревшие технологии NASA, противопоставляя их инновационным подходам SpaceX.",
      "В беседе подчеркиваются политические и финансовые ограничения программы НАСА \"Артемида\", пропагандируются более экономически эффективные роботизированные миссии, изучаются мотивы и преимущества освоения космоса."
    ],
    "points": 553,
    "commentCount": 384,
    "retryCount": 0,
    "time": 1716159761
  },
  {
    "id": 40414316,
    "title": "Компания 3M десятилетиями скрывала результаты исследований химика о содержании токсичного PFOS в крови человека",
    "originLink": "https://www.propublica.org/article/3m-forever-chemicals-pfas-pfos-inside-story",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40414316",
    "commentBody": "",
    "originSummary": [
      "Крис Хансен, химик из компании 3M, в 1997 году обнаружила, что вредный химикат PFOS присутствует в крови человека, но ее исследования были остановлены начальством, которое заверило ее в его безопасности.",
      "Спустя десятилетия EPA предписывает удалить химические вещества PFAS из питьевой воды, и выясняется, что компания 3M знала о токсичности PFOS еще в 1970-х годах, но продолжала его производство.",
      "Несмотря на урегулирование проблемы загрязнения PFAS на сумму 12,5 миллиарда долларов, вопрос о полной стоимости и ответственности остается нерешенным, и Хансен теперь добровольно занимается охраной окружающей среды."
    ],
    "commentSummary": [
      "Руководители компании 3M убедили ученого Джонсона скрыть данные о вредных химических веществах PFOS, что свидетельствует о культуре, которая не поощряет обращение к подобным проблемам.",
      "В дискуссии критикуется секретность и этические проблемы компании 3M, высказывается мнение о необходимости проведения независимых исследований, более строгих правил и суровых наказаний за неправомерные действия корпорации.",
      "В тексте подчеркивается необходимость усиления защиты информаторов и проведения системных реформ для привлечения корпораций и руководителей к ответственности за неэтичные действия."
    ],
    "points": 355,
    "commentCount": 215,
    "retryCount": 0,
    "time": 1716204311
  },
  {
    "id": 40409588,
    "title": "Операция CHARM: Универсальный доступ к руководствам по ремонту автомобилей всех основных марок",
    "originLink": "https://charm.li/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40409588",
    "commentBody": "",
    "originSummary": [
      "Operation CHARM предлагает руководства по ремонту автомобилей различных марок, таких как Acura, Audi, BMW, Chevrolet, Ford, Honda и Toyota.",
      "Цель инициативы - сделать сервисные руководства легкодоступными для общественности."
    ],
    "commentSummary": [
      "Операция CHARM (charm.li) предоставляет пиратские руководства по ремонту автомобилей, в основном от ALLDATA, до 2013 года, так как более новые руководства доступны по подписке и их сложнее архивировать.",
      "Сервис более распространен в Северной Америке, но не охватывает некоторые модели, особенно неамериканские автомобили, и подвергается критике за нарушение авторских прав и неполную информацию.",
      "В современных руководствах по эксплуатации автомобилей основное внимание уделяется замене деталей, а не детальному поиску неисправностей, что делает ремонт более сложным для механиков-новичков из-за необходимости использования специализированного оборудования."
    ],
    "points": 253,
    "commentCount": 74,
    "retryCount": 0,
    "time": 1716151152
  },
  {
    "id": 40413891,
    "title": "Uber успешно переносит данные триллионной бухгалтерской книги в пользовательское хранилище LedgerStore",
    "originLink": "https://www.uber.com/blog/migrating-from-dynamodb-to-ledgerstore/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40413891",
    "commentBody": "",
    "originSummary": [
      "Компания Uber перенесла более триллиона записей бухгалтерских книг из DynamoDB в созданное на заказ хранилище LedgerStore (LSG), чтобы повысить экономическую эффективность, упростить архитектуру и улучшить производительность.",
      "Миграция включала 1,2 ПБ неизменяемых записей и 0,5 ПБ вторичных индексов, обеспечивая полноту и корректность данных без сбоев в работе и достигая точности 99,99 %.",
      "В процессе использовался Apache Spark для обработки больших объемов данных, а такие проблемы, как ошибки в коде и таймауты RPC, решались с помощью ограничителей скорости и консервативных стратегий развертывания, что позволило завершить двухлетний переход без простоев."
    ],
    "commentSummary": [
      "Перенос 1,7 петабайт бухгалтерских данных Uber из DynamoDB в SQLite нецелесообразен из-за масштабируемости SQLite и ограничений на большой объем записи.",
      "В ходе обсуждения критикуются стратегии экономии Uber, ставится вопрос о целесообразности и скрытых затратах на собственные решения в сравнении с коммерческими облачными сервисами, такими как DynamoDB.",
      "В беседе подчеркивается важность эффективного хранения данных, сложности переноса корпоративных систем, а также необходимость тщательного документирования и надежных контрольных показателей для привлечения клиентов."
    ],
    "points": 234,
    "commentCount": 240,
    "retryCount": 0,
    "time": 1716199296
  },
  {
    "id": 40410341,
    "title": "Из-за ошибки в системе компания Hertz переплатила арендаторам Tesla за бензин, что привело к возврату средств",
    "originLink": "https://www.thedrive.com/news/hertz-charging-a-tesla-renter-for-gas-was-not-an-isolated-incident",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40410341",
    "commentBody": "",
    "originSummary": [
      "Компания Hertz по ошибке взимала с клиентов плату за бензин при аренде электромобилей (EV), в частности Teslas, из-за \"системной ошибки\", которая длилась более года.",
      "Компания устранила проблему и предлагает пострадавшим клиентам возврат средств и кредиты, но ее служба поддержки подверглась критике за то, что до нее трудно дозвониться.",
      "Эти ошибки при выставлении счетов и проблемы с обслуживанием клиентов привели к недовольству и могут стать причиной отказа от аренды электромобилей в компании Hertz в будущем."
    ],
    "commentSummary": [
      "Компанию Hertz обвинили в том, что она взимает с арендаторов Tesla плату за бензин, что свидетельствует о более широкой практике выставления счетов в индустрии проката автомобилей, включая непомерную плату за такие услуги, как EZ Pass, без четкого раскрытия информации.",
      "Клиенты сталкиваются с трудностями при оспаривании этих платежей из-за запутанных счетов и мелкого шрифта, что приводит к разочарованию и отказу от услуг этих компаний; проблемы включают неправильные начисления, медленный возврат средств и тактику продаж под высоким давлением.",
      "В ходе обсуждения подчеркивается необходимость усиления регулирования и защиты прав потребителей, предлагаются более строгие наказания за неправомерные действия корпораций, усиление законов о защите прав потребителей, а также возможность обращения в суд по мелким искам или в законодательные органы."
    ],
    "points": 218,
    "commentCount": 181,
    "retryCount": 0,
    "time": 1716159121
  },
  {
    "id": 40409718,
    "title": "Разгон Raspberry Pi 5 до 3,3 ГГц: Минимальный прирост, несмотря на взлом напряжения",
    "originLink": "https://jonatron.github.io/randomstuff/pivolt/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40409718",
    "commentBody": "",
    "originSummary": [
      "Автор попытался разогнать Raspberry Pi 5 до 3,14 ГГц, но обнаружил, что система нестабильна на частоте 3,3 ГГц.",
      "Для этого автор обошел установленное прошивкой Raspberry Pi ограничение в 1 В, изменив системную память и создав сервис для управления частотой и напряжением процессора.",
      "Несмотря на более высокую тактовую частоту, прирост производительности был минимальным, что говорит о нецелесообразности затраченных усилий."
    ],
    "commentSummary": [
      "Пользователь под ником jonatron разогнал Raspberry Pi 5 до 3,14 ГГц, превзойдя предыдущий рекорд в 3,3 ГГц, установленный Джеффом Гирлингом.",
      "В ходе обсуждения было отмечено, что оптимальная частота по умолчанию для чипа BCM2712 составляет 2,4 ГГц, что связано с уменьшением отдачи и увеличением энергопотребления на более высоких скоростях.",
      "В ходе беседы обсуждались методы охлаждения, сравнение производительности со старыми процессорами, а также отсутствие поддержки аппаратного ускорения в основном ядре Linux для Raspberry Pi 5."
    ],
    "points": 200,
    "commentCount": 43,
    "retryCount": 0,
    "time": 1716152556
  },
  {
    "id": 40415646,
    "title": "Преодоление разрыва: почему соискатели и работодатели не могут найти общий язык",
    "originLink": "https://news.ycombinator.com/item?id=40415646",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40415646",
    "commentBody": "",
    "originSummary": [
      "Автор обсуждает парадокс, когда и соискатели, и работодатели пытаются найти подходящие варианты, при этом объявления о вакансиях часто бывают либо слишком специфическими, либо слишком широкими.",
      "Они подчеркивают высокую стоимость платформ для размещения вакансий и риски, связанные с наймом неподходящих кандидатов, особенно для стартапов.",
      "Автор просит поделиться эффективными решениями и опытом других людей, чтобы преодолеть разрыв между объявлениями о вакансиях и реальными требованиями к ним."
    ],
    "commentSummary": [
      "Рынок труда сталкивается с парадоксом, когда соискатели пытаются найти работу, а работодатели не могут подобрать подходящих кандидатов из-за несоответствия объявлений о вакансиях и нереалистичных ожиданий.",
      "Структурная безработица в сфере технологий усугубляется несоответствием квалификации и неэффективной практикой найма, включая алгоритмические фильтры и нестандартизированные учебные программы.",
      "Предлагаются такие решения, как переобучение, упрощение собеседований, фокусировка на основных навыках и улучшение сетевого взаимодействия, при этом критикуется использование тестов на IQ, перевод на периферию, а также необходимость улучшения стратегий обучения и удержания сотрудников."
    ],
    "points": 187,
    "commentCount": 263,
    "retryCount": 0,
    "time": 1716214259
  },
  {
    "id": 40414718,
    "title": "Критическая уязвимость в PDF.js позволяет выполнить произвольный JavaScript",
    "originLink": "https://codeanlabs.com/blog/research/cve-2024-4367-arbitrary-js-execution-in-pdf-js/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40414718",
    "commentBody": "",
    "originSummary": [
      "Компания Codean Labs обнаружила CVE-2024-4367, уязвимость в Mozilla PDF.js, которая позволяет произвольно выполнять JavaScript при открытии вредоносного PDF-файла, что представляет значительный риск для безопасности.",
      "Эта уязвимость затрагивает всех пользователей Firefox и может привести к XSS-атакам (межсайтовый скриптинг) и потенциальному выполнению собственного кода в приложениях Electron.",
      "Проблема может быть устранена путем обновления PDF.js до версии 4.2.67 или выше, проверки зависимостей и корректировки настроек безопасности; она была раскрыта Mozilla 26 апреля 2024 года, а исправления выпущены к середине мая 2024 года."
    ],
    "commentSummary": [
      "CVE-2024-4367 - это уязвимость безопасности в PDF.js, которая позволяет выполнить произвольный JavaScript, что потенциально может привести к атакам межсайтового скриптинга (XSS).",
      "В ходе обсуждения подчеркиваются сложности веб-безопасности, особенно в отношении JavaScript на стороне клиента и недоверенных входных данных, а также предлагается изолировать программы просмотра PDF на разных источниках.",
      "Участники обсуждают последствия использования PDF.js для безопасности, уделяя особое внимание XSS-рискам, и рекомендуют внедрять надежные политики безопасности контента в приложениях, использующих PDF.js, например, в приложениях Electron."
    ],
    "points": 178,
    "commentCount": 88,
    "retryCount": 0,
    "time": 1716208031
  },
  {
    "id": 40409956,
    "title": "Основные практики программирования на языке Си для удобства чтения и сопровождения",
    "originLink": "https://github.com/mcinglis/c-style",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40409956",
    "commentBody": "",
    "originSummary": [
      "Автор подчеркивает приоритет корректности, читабельности, простоты и сопровождаемости в программировании на Си над скоростью, выступая за то, чтобы понятный и сопровождаемый код был лучше оптимизации.",
      "Ключевыми практиками являются использование современных стандартов языка C (предпочтительно C11), отказ от нестандартных расширений, использование пробелов вместо табуляций, сохранение строк менее 79 символов, а также последовательное использование американского английского языка в коде и документации.",
      "Руководство советует отказаться от сложных условных символов, операторов switch и макросов, которые заслоняют поток управления, рекомендует использовать `const` для неизменяемости, избегать беззнаковых типов и отдавать предпочтение неизменяемым структурам данных и чистым функциям."
    ],
    "commentSummary": [
      "Автор книги \"Стиль Си: Мои любимые практики программирования на Си\" рассказывает о своих эволюционирующих взглядах на стиль кодирования, делая акцент на механическом принуждении и обратной связи в реальном времени для повышения качества кода.",
      "Среди ключевых тем - баланс между удобочитаемостью и производительностью, предотвращение преждевременной оптимизации и принятие контекстно-зависимых решений при программировании для встраиваемых систем.",
      "Обсуждаются стандарты кодирования, такие как ограничение на 80 символов в строке, табуляции и пробелы, а также лучшие практики, такие как использование санитаров Clang, управление зависимостями и минимизация области видимости переменных."
    ],
    "points": 176,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1716154748
  },
  {
    "id": 40414565,
    "title": "Внутри создания \"Губернии\": 64k Intro from Revision 2017",
    "originLink": "https://www.lofibucket.com/articles/64k_intro.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40414565",
    "commentBody": "",
    "originSummary": [
      "Статья Пекки Вяянянена на lofibucket.com посвящена созданию 64k-интро \"Губерния\", представленного на демо-вечеринке Revision 2017, в ней дается введение в демосцену и подробное вскрытие проекта.",
      "Проект был разработан командой из шести человек с использованием C++, OpenGL и различных техник рендеринга в течение четырех месяцев под влиянием \"Half-Life 2\", исландских пейзажей и фильма \"Кояанискатси\".",
      "Среди технических особенностей - использование Visual Studio 2013, пользовательский клавиатурный хук для редактирования шейдеров в реальном времени, форк GNU Rocket для анимации, реймаркинг с библиотекой `hg_sdf` и пользовательское дискретное преобразование Фурье на базе GPU для растягивания звука во времени."
    ],
    "commentSummary": [
      "В центре обсуждения - 64-килобайтные интро, форма цифрового искусства, ограниченная размером файла в 64 килобайта, в которой акцент делается на творческом процессе, а не на технических объяснениях.",
      "Участники отмечают, что в сообществе демосцены наметился сдвиг в сторону более компактных интро (4k/1k) из-за значительных усилий, необходимых для создания 64k интро, и предлагают записывать или транслировать процесс создания, чтобы запечатлеть творческий путь.",
      "Разговор идет об изменении ожиданий и совершенствовании инструментов, что делает производство высококачественных 64k интро все более требовательным."
    ],
    "points": 146,
    "commentCount": 29,
    "retryCount": 0,
    "time": 1716206878
  },
  {
    "id": 40411115,
    "title": "Совершенствование политики ответственного масштабирования для предотвращения злоупотреблений ИИ и обеспечения безопасности",
    "originLink": "https://www.anthropic.com/news/reflections-on-our-responsible-scaling-policy",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40411115",
    "commentBody": "",
    "originSummary": [
      "В публикации \"Размышления о нашей политике ответственного масштабирования\" рассказывается о разработке политики ответственного масштабирования (RSP) для предотвращения сбоев в системе безопасности и неправильного использования передовых моделей с упором на надежные стандарты безопасности и итеративное расширение политики.",
      "Основные обязательства включают определение и тестирование \"возможностей красной линии\", внедрение стандарта ASL-3 для обеспечения строгой безопасности и формирование междисциплинарной команды для интеграции практик из таких областей, как ядерная безопасность и кибербезопасность.",
      "Организация стремится содействовать сотрудничеству между отраслями и информировать правительства об основах управления рисками, планируя обсудить их на саммите AI Seoul Summit."
    ],
    "commentSummary": [
      "Политика ответственного масштабирования\" компании Anthropic направлена на борьбу с высокорискованными возможностями ИИ, такими как биооружие и угрозы кибербезопасности, путем акцентирования внимания на будущих рисках и строгих мерах сдерживания.",
      "Критики утверждают, что политика слишком мягкая и базовая, призывая к более строгим стандартам, улучшению автономности ИИ и балансу между инновациями и безопасностью.",
      "В ходе дебатов выявляются различные взгляды на безопасность, прозрачность и этические последствия ИИ: одни выступают за ответственное развитие и понимание общественности, другие считают, что риски ИИ преувеличиваются в маркетинговых или регуляторных целях."
    ],
    "points": 146,
    "commentCount": 130,
    "retryCount": 0,
    "time": 1716167704
  },
  {
    "id": 40410603,
    "title": "Исследование генеративного искусства: Пересечение алгоритмов, природы и творчества",
    "originLink": "https://www.amygoodchild.com/blog/what-is-generative-art",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40410603",
    "commentBody": "",
    "originSummary": [
      "Генеративное искусство подразумевает создание произведений искусства с помощью автономных процессов, используя такие элементы, как случайность, правила и природные системы, при этом ГПСЧ вносят изменчивость и истинную случайность, полученную из природных явлений.",
      "В тексте рассказывается о таких первопроходцах, как Вера Молнар, исследуются процедурная генерация, искусство, основанное на правилах, и эмерджентное поведение, приводятся такие примеры, как инструкции Сола ЛеВитта и \"Игра жизни\" Конвея.",
      "Подчеркивается баланс контроля между художником и машиной, приводятся примеры искусства, основанного на данных и искусственном интеллекте, и статья поощряет дальнейшие исследования и инновации в развивающейся области генеративного искусства."
    ],
    "commentSummary": [
      "В ходе обсуждения генеративного искусства рассматриваются различные инструменты, исторические контексты и языки кодирования, такие как Swift и JavaScript, и выделяются такие платформы, как Context Free Art и AARON.",
      "Авторы обсуждают монетизацию генеративного искусства с помощью NFT, балансируя между художественным наслаждением и коммерческой целесообразностью, а также обсуждают роль случайности и алгоритмов в создании искусства.",
      "В беседе также обсуждаются вопросы влияния искусственного интеллекта на традиционные области искусства, потенциал решений с открытым исходным кодом, а также необходимость человеческой связи и повествования в генеративных продуктах."
    ],
    "points": 143,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1716162227
  },
  {
    "id": 40410637,
    "title": "GitHub Скрипт 'ffmpeg-english' снимает кадры видео в JPG каждую секунду",
    "originLink": "https://github.com/dheera/scripts/blob/master/ffmpeg-english",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40410637",
    "commentBody": "",
    "originSummary": [
      "В репозитории GitHub \"dheera/scripts\" есть скрипт под названием \"ffmpeg-english\" с 50 строками кода.",
      "Хранилище получило 8 форков и 45 звезд, что говорит об умеренном интересе и вовлеченности сообщества.",
      "Он включает в себя такие обширные функции, как проблемы, запросы на вытягивание, действия, проекты и вики, а также историю последних коммитов и метаданные файлов."
    ],
    "commentSummary": [
      "Обсуждение на GitHub сосредоточено на захвате изображений с `/dev/video0` каждую секунду с помощью `ffmpeg`, при этом пользователи предлагают альтернативы вроде GitHub Copilot CLI и выражают опасения по поводу безопасности команд, генерируемых искусственным интеллектом.",
      "Пользователи рекомендуют такие инструменты, как `aichat` и `subprocess.Popen` для более безопасного выполнения, а также обсуждают баланс между удобством и безопасностью при генерации команд ИИ.",
      "В беседе подчеркивается важность понимания и проверки команд, как сгенерированных ИИ, так и написанных человеком, а также обсуждается интеграция ИИ в интерфейсы командной строки с такими мерами предосторожности, как контейнеры Docker и подтверждение пользователя."
    ],
    "points": 131,
    "commentCount": 91,
    "retryCount": 0,
    "time": 1716162610
  },
  {
    "id": 40409757,
    "title": "Коррекция перспективных искажений текста с помощью трансформированных эллипсов: Упрощенный подход",
    "originLink": "https://mzucker.github.io/2016/10/11/unprojecting-text-with-ellipses.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40409757",
    "commentBody": "",
    "originSummary": [
      "В статье представлен упрощенный метод коррекции перспективных искажений на текстовых фотографиях с помощью трансформированных эллипсов, вдохновленный сложным методом Карлоса Мерино-Грасиа и др.",
      "Подход включает в себя пороговую обработку и маркировку связанных компонентов для выделения букв, а затем с помощью гомографики (матрицы с 8 параметрами) корректирует изображение так, чтобы формы букв имели одинаковую площадь.",
      "Метод, включающий преобразования перспективы, поворота и перекоса, эффективен, а его код доступен на GitHub, хотя и не является самым современным."
    ],
    "commentSummary": [
      "В статье рассматривается метод коррекции перспективных искажений в тексте с помощью линейной алгебры, матричного умножения и преобразования Хафа.",
      "Эта техника не требует определения границ слов или страниц, что некоторые считают сложным, но потенциально полезным в различных сценариях.",
      "В ходе беседы обсуждаются сложность, эффективность метода и альтернативные варианты ректификации текста, особенно на изображениях."
    ],
    "points": 128,
    "commentCount": 18,
    "retryCount": 0,
    "time": 1716152897
  }
]
