[
  {
    "id": 40410404,
    "title": "NASA의 아르테미스 프로그램에 대한 비판: 높은 비용, 복잡성 및 비효율성",
    "originLink": "https://idlewords.com/2024/5/the_lunacy_of_artemis.htm",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40410404",
    "commentBody": "",
    "originSummary": [
      "이 기사에서는 NASA의 아르테미스 프로그램이 기술 발전에도 불구하고 아폴로 미션에 비해 복잡하고 비용이 많이 들며 비효율적이라고 비판합니다.",
      "주요 비판 사항으로는 우주 발사 시스템(SLS)의 높은 비용과 구식 기술, 오리온 우주선의 설계 문제, 근직선 헤일로 궤도(NRHO) 사용으로 인한 복잡성과 위험 증가 등이 있습니다.",
      "2026년까지 인간을 달에 귀환시키겠다는 야심찬 일정은 비현실적인 것으로 간주되며, 지연 가능성과 비용 증가로 인해 유인 달 착륙이 영구적으로 연기될 위험이 있습니다."
    ],
    "commentSummary": [
      "이 토론에서는 달 여행을 위한 아폴로 미션의 혁신적인 솔루션과 현대의 우주 탐사 과제를 비교하여 복잡성과 위험성을 강조합니다.",
      "NASA의 비효율성, 관료주의적 관행, 구식 기술을 비판하며 SpaceX의 혁신적인 접근 방식과 대조합니다.",
      "이 대화에서는 NASA의 아르테미스 프로그램에 대한 정치적, 재정적 제약을 강조하며 보다 비용 효율적인 로봇 임무를 옹호하고 우주 탐험의 동기와 이점을 탐구합니다."
    ],
    "points": 553,
    "commentCount": 384,
    "retryCount": 0,
    "time": 1716159761
  },
  {
    "id": 40414316,
    "title": "3M, 수십 년 동안 인간 혈액 내 독성 PFOS에 대한 화학자의 연구 결과 억제",
    "originLink": "https://www.propublica.org/article/3m-forever-chemicals-pfas-pfos-inside-story",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40414316",
    "commentBody": "",
    "originSummary": [
      "3M의 화학자였던 크리스 한센은 1997년에 사람의 혈액에 유해한 화학물질인 PFOS가 존재한다는 사실을 발견했지만, 안전성을 확신한 상사가 연구를 중단시켰습니다.",
      "수십 년 후, EPA는 식수에서 PFAS 화학물질을 제거하도록 의무화했고, 3M은 1970년대부터 PFOS의 독성을 알고 있었음에도 생산을 계속한 것으로 드러났습니다.",
      "PFAS 오염 문제를 해결하기 위해 125억 달러의 합의가 이루어졌지만, 전체 비용과 책임은 여전히 해결되지 않았으며, 한센은 현재 환경 보호에 자원봉사를 하고 있습니다."
    ],
    "commentSummary": [
      "3M 경영진은 과학자 존슨에게 PFOS 화학물질에 대한 유해한 연구 결과를 숨기도록 설득했고, 이러한 우려를 제기하지 못하게 하는 문화를 강조했습니다.",
      "이 토론에서는 3M의 비밀주의와 윤리적 문제를 비판하며 독립적인 연구, 더 강력한 규제, 기업 위법 행위에 대한 엄중한 처벌을 옹호합니다.",
      "이 글은 기업과 경영진이 비윤리적 행위에 대해 책임을 지도록 내부고발자 보호와 시스템 개혁의 필요성을 강조합니다."
    ],
    "points": 355,
    "commentCount": 215,
    "retryCount": 0,
    "time": 1716204311
  },
  {
    "id": 40409588,
    "title": "작전 참: 모든 주요 브랜드의 자동차 수리 매뉴얼에 대한 보편적 액세스",
    "originLink": "https://charm.li/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40409588",
    "commentBody": "",
    "originSummary": [
      "오퍼레이션 참은 Acura, Audi, BMW, Chevrolet, Ford, Honda, Toyota 등 다양한 차량 브랜드에 대한 자동차 수리 매뉴얼을 제공합니다.",
      "이 이니셔티브의 목표는 대중이 서비스 매뉴얼에 쉽게 접근할 수 있도록 하는 것입니다."
    ],
    "commentSummary": [
      "최신 매뉴얼은 구독 기반이고 보관이 어렵기 때문에, Operation CHARM(charm.li)은 주로 ALLDATA에서 2013년까지의 해적판 자동차 수리 매뉴얼을 제공합니다.",
      "이 서비스는 북미에서 더 보편적이지만 특정 모델, 특히 미국 외 차량에 대한 서비스가 부족하고 저작권 침해 및 불완전한 정보로 인해 비판에 직면해 있습니다.",
      "최신 자동차 매뉴얼은 상세한 문제 해결보다 부품 교체를 강조하기 때문에 일반 정비사에게는 전문 장비가 필요하기 때문에 수리가 더 어렵습니다."
    ],
    "points": 253,
    "commentCount": 74,
    "retryCount": 0,
    "time": 1716151152
  },
  {
    "id": 40413891,
    "title": "Uber, 수조 건에 달하는 원장 데이터를 커스텀 레저스토어로 성공적으로 마이그레이션 완료",
    "originLink": "https://www.uber.com/blog/migrating-from-dynamodb-to-ledgerstore/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40413891",
    "commentBody": "",
    "originSummary": [
      "Uber는 비용 효율성을 높이고 아키텍처를 간소화하며 성능을 개선하기 위해 1조 개가 넘는 원장 데이터 항목을 DynamoDB에서 맞춤형으로 구축한 LedgerStore(LSG)로 마이그레이션했습니다.",
      "마이그레이션에는 1.2 PB의 불변 레코드와 0.5 PB의 보조 인덱스가 포함되었으며, 운영 중단 없이 데이터 완전성과 정확성을 보장하여 99.99%의 정확도를 달성했습니다.",
      "이 프로세스는 대량의 데이터를 처리하기 위해 Apache Spark를 활용했으며, 속도 제한기와 보수적인 롤아웃 전략으로 코드 버그 및 RPC 시간 초과와 같은 문제를 해결하여 다운타임 없이 2년간의 마이그레이션을 완료했습니다."
    ],
    "commentSummary": [
      "Uber의 1.7페타바이트에 달하는 원장 데이터를 DynamoDB에서 SQLite로 마이그레이션하는 것은 SQLite의 확장성과 높은 쓰기 볼륨 제한으로 인해 비현실적입니다.",
      "이 토론에서는 Uber의 비용 절감 전략에 대해 비판하며, 맞춤형 솔루션의 실현 가능성과 숨겨진 비용에 대해 DynamoDB와 같은 상용 클라우드 서비스와 비교하여 의문을 제기합니다.",
      "이 대화에서는 효율적인 데이터 스토리지의 중요성, 기업 시스템 마이그레이션의 복잡성, 고객 유치를 위한 철저한 문서화 및 신뢰할 수 있는 벤치마크의 필요성을 강조합니다."
    ],
    "points": 234,
    "commentCount": 240,
    "retryCount": 0,
    "time": 1716199296
  },
  {
    "id": 40410341,
    "title": "허츠가 시스템 오류로 인해 테슬라 임차인에게 가스 요금을 과다 청구하여 환불을 요청했습니다.",
    "originLink": "https://www.thedrive.com/news/hertz-charging-a-tesla-renter-for-gas-was-not-an-isolated-incident",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40410341",
    "commentBody": "",
    "originSummary": [
      "Hertz는 1년 넘게 지속된 '시스템 오류'로 인해 전기 자동차(EV), 특히 Tesla 렌터카에서 고객에게 휘발유 요금을 잘못 청구하는 일이 발생했습니다.",
      "이 회사는 문제를 수정하고 영향을 받은 고객에게 환불 및 크레딧을 제공하고 있지만, 고객 서비스는 연락이 어렵다는 비판을 받고 있습니다.",
      "이러한 청구 오류와 고객 서비스 문제는 불만족으로 이어져 향후 Hertz의 전기차 렌터카 이용을 저해할 수 있습니다."
    ],
    "commentSummary": [
      "허츠는 테슬라 렌트카 이용자에게 가스 요금을 청구했다는 비난을 받아왔으며, 명확한 공개 없이 EZ Pass와 같은 서비스에 대해 과도한 수수료를 부과하는 등 렌터카 업계에서 의심스러운 청구 관행이 광범위하게 나타나고 있습니다.",
      "고객들은 혼란스러운 청구서와 작은 글씨로 인해 이러한 청구에 이의를 제기하는 데 어려움을 겪고 있으며, 잘못된 청구, 느린 환불, 고압적인 판매 전략 등의 문제로 인해 불만을 품고 해당 업체를 기피하게 됩니다.",
      "이 토론에서는 더 강력한 규제와 소비자 보호의 필요성을 강조하며 기업의 위법 행위에 대한 더 엄격한 처벌, 강화된 소비자 보호법, 소액 청구 법원 또는 입법 조치를 통한 잠재적 구제를 제안합니다."
    ],
    "points": 218,
    "commentCount": 181,
    "retryCount": 0,
    "time": 1716159121
  },
  {
    "id": 40409718,
    "title": "라즈베리 파이 5를 3.3GHz로 올리기: 전압 해킹에도 불구하고 최소한의 이득",
    "originLink": "https://jonatron.github.io/randomstuff/pivolt/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40409718",
    "commentBody": "",
    "originSummary": [
      "필자는 라즈베리 파이 5에서 3.14GHz 오버클럭을 넘어서는 것을 시도했지만 3.3GHz에서 시스템이 불안정하다는 것을 발견했습니다.",
      "이를 위해 저자는 시스템 메모리를 수정하고 CPU 주파수 및 전압을 관리하는 서비스를 만들어 라즈베리 파이의 펌웨어가 부과하는 1V 제한을 우회했습니다.",
      "더 높은 클럭 속도에 도달했음에도 불구하고 성능 향상은 미미하여 그만한 가치가 없을 수도 있음을 시사합니다."
    ],
    "commentSummary": [
      "jonatron이라는 사용자가 라즈베리 파이 5를 3.14GHz로 오버클럭하여 Jeff Geerling이 세운 이전 기록인 3.3GHz를 넘어섰습니다.",
      "더 높은 속도에서는 수익률이 감소하고 전력 소비가 증가하기 때문에 BCM2712 칩의 최적 기본 속도인 2.4GHz가 논의의 초점이 되었습니다.",
      "이 대화에는 냉각 방법, 구형 CPU와의 성능 비교, 라즈베리 파이 5용 Linux 메인라인 커널의 하드웨어 가속 지원 부족에 대한 토론이 포함되었습니다."
    ],
    "points": 200,
    "commentCount": 43,
    "retryCount": 0,
    "time": 1716152556
  },
  {
    "id": 40415646,
    "title": "격차 해소: 구직자와 고용주가 연결에 어려움을 겪는 이유",
    "originLink": "https://news.ycombinator.com/item?id=40415646",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40415646",
    "commentBody": "",
    "originSummary": [
      "저자는 구인 공고가 너무 구체적이거나 너무 광범위한 경우가 많아 구직자와 고용주 모두 적합한 매칭을 찾는 데 어려움을 겪는 역설에 대해 설명합니다.",
      "특히 스타트업의 경우 채용 공고 플랫폼의 높은 비용과 잘못된 지원자를 채용할 경우 발생할 수 있는 위험성을 강조합니다.",
      "저자는 구인 공고와 실제 직무 요구 사항 간의 격차를 해소하기 위해 다른 사람들의 효과적인 솔루션과 경험에 대한 의견을 구합니다."
    ],
    "commentSummary": [
      "구직자는 취업에 어려움을 겪고, 고용주는 채용 공고의 불일치와 비현실적인 기대치로 인해 적합한 지원자를 찾지 못하는 역설에 직면해 있는 취업 시장입니다.",
      "기술 분야의 구조적 실업은 알고리즘 필터와 비표준화된 커리큘럼을 포함한 기술 불일치와 비효율적인 채용 관행으로 인해 더욱 악화되고 있습니다.",
      "재교육, 면접 간소화, 필수 기술 집중, 네트워킹 개선 등의 해결책이 제시되었으며, IQ 테스트 사용, 오프쇼어링, 더 나은 직원 교육 및 유지 전략의 필요성에 대해서도 비판했습니다."
    ],
    "points": 187,
    "commentCount": 263,
    "retryCount": 0,
    "time": 1716214259
  },
  {
    "id": 40414718,
    "title": "PDF.js의 치명적인 취약점으로 인해 임의의 자바스크립트 실행 허용",
    "originLink": "https://codeanlabs.com/blog/research/cve-2024-4367-arbitrary-js-execution-in-pdf-js/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40414718",
    "commentBody": "",
    "originSummary": [
      "코데안 랩은 악성 PDF를 열었을 때 임의의 자바스크립트 실행을 허용하여 심각한 보안 위험을 초래하는 Mozilla의 PDF.js 취약점인 CVE-2024-4367을 발견했습니다.",
      "이 취약점은 모든 Firefox 사용자에게 영향을 미치며 XSS(크로스 사이트 스크립팅) 공격과 일렉트로닉 앱에서 잠재적인 네이티브 코드 실행으로 이어질 수 있습니다.",
      "이 문제는 PDF.js를 버전 4.2.67 이상으로 업데이트하고 종속성을 확인하며 보안 설정을 조정하여 완화할 수 있으며, 2024년 4월 26일 Mozilla에 공개되었고 2024년 5월 중순까지 수정 사항이 릴리스되었습니다."
    ],
    "commentSummary": [
      "CVE-2024-4367은 임의의 자바스크립트 실행을 허용하여 잠재적으로 크로스 사이트 스크립팅(XSS) 공격으로 이어질 수 있는 PDF.js의 보안 취약점입니다.",
      "이 토론에서는 웹 보안의 복잡성, 특히 클라이언트 측 자바스크립트 및 신뢰할 수 없는 입력에 대해 강조하고 다양한 출처의 PDF 뷰어를 격리할 것을 제안합니다.",
      "참가자들은 XSS 위험에 초점을 맞춰 PDF.js 사용의 보안 영향에 대해 토론하고, Electron 앱과 같이 PDF.js를 임베드하는 애플리케이션에 강력한 콘텐츠 보안 정책을 구현할 것을 권장합니다."
    ],
    "points": 178,
    "commentCount": 88,
    "retryCount": 0,
    "time": 1716208031
  },
  {
    "id": 40409956,
    "title": "가독성 및 유지보수성을 위한 필수 C 프로그래밍 사례",
    "originLink": "https://github.com/mcinglis/c-style",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40409956",
    "commentBody": "",
    "originSummary": [
      "저자는 C 프로그래밍에서 속도보다 정확성, 가독성, 단순성, 유지보수성을 우선시해야 한다고 강조하며 최적화보다 명확하고 유지보수 가능한 코드를 우선시해야 한다고 주장합니다.",
      "주요 관행에는 최신 C 표준(가급적 C11) 사용, 비표준 확장자 피하기, 탭보다 공백 사용하기, 줄을 79자 이내로 유지하기, 코드와 문서에서 일관된 미국식 영어 유지 등이 있습니다.",
      "이 가이드는 제어 흐름을 모호하게 만드는 복잡한 조건문, 스위치 문, 매크로를 피하고, 불변성을 위해 'const'를 사용하고, 부호 없는 유형을 피하고, 불변 데이터 구조와 순수 함수를 선호하도록 권장합니다."
    ],
    "commentSummary": [
      "\"C 스타일: 내가 가장 좋아하는 C 프로그래밍 관행\"의 저자는 코딩 스타일에 대한 진화하는 관점에 대해 설명하며, 코드 품질 향상을 위한 기계적인 시행과 실시간 피드백을 강조합니다.",
      "주요 주제에는 가독성과 성능의 균형, 조기 최적화 방지, 임베디드 프로그래밍에서 컨텍스트에 따른 의사 결정이 포함됩니다.",
      "이 토론에서는 80자 행 제한, 탭과 공백, Clang 소독제 사용, 종속성 관리, 변수 범위 최소화 등의 모범 사례와 같은 코딩 표준에 대해 다룹니다."
    ],
    "points": 176,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1716154748
  },
  {
    "id": 40414565,
    "title": "\"구베르니야\" 제작 비하인드 스토리: 리비전 2017의 64k 인트로",
    "originLink": "https://www.lofibucket.com/articles/64k_intro.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40414565",
    "commentBody": "",
    "originSummary": [
      "lofibucket.com에 게시된 Pekka Väänänen의 글에서는 리비전 2017 데모 파티에서 선보인 64k 인트로 'Guberniya'의 제작에 대해 설명하며 데모 장면에 대한 소개와 프로젝트에 대한 자세한 사후 평가를 제공합니다.",
      "이 프로젝트는 \"하프라이프 2\", 아이슬란드의 풍경, 영화 \"코야니스카치\"에서 영향을 받아 6명의 팀이 4개월에 걸쳐 C++, OpenGL 및 다양한 렌더링 기법을 사용하여 개발했습니다.",
      "기술적인 주요 특징으로는 비주얼 스튜디오 2013, 라이브 셰이더 편집을 위한 커스텀 키보드 후크, 애니메이션을 위한 GNU 로켓 포크, `hg_sdf` 라이브러리를 사용한 레이마칭, 시간 스트레칭 오디오를 위한 커스텀 GPU 기반 이산 푸리에 변환 등이 있습니다."
    ],
    "commentSummary": [
      "이 토론에서는 64킬로바이트 파일 크기로 제한된 디지털 아트 형식인 64k 인트로를 중심으로 기술적인 설명보다 창작 과정을 강조합니다.",
      "참가자들은 64k 인트로에 상당한 노력이 필요하기 때문에 데모 장면 커뮤니티에서 더 작은 인트로(4k/1k)로 전환하는 추세에 주목하며, 창작 과정을 녹화하거나 라이브 스트리밍하여 창작 여정을 담을 것을 제안했습니다.",
      "이 대화는 진화하는 기대치와 개선된 도구로 인해 고품질 64k 인트로 제작이 점점 더 까다로워지고 있음을 강조합니다."
    ],
    "points": 146,
    "commentCount": 29,
    "retryCount": 0,
    "time": 1716206878
  },
  {
    "id": 40411115,
    "title": "AI 오용을 방지하고 안전을 보장하기 위한 책임 있는 확장 정책 개선",
    "originLink": "https://www.anthropic.com/news/reflections-on-our-responsible-scaling-policy",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40411115",
    "commentBody": "",
    "originSummary": [
      "'책임 있는 확장 정책에 대한 정책적 고찰' 게시물에서는 안전 실패와 고급 모델의 오용을 방지하기 위한 책임 있는 확장 정책(RSP)의 개발에 대해 자세히 설명하며, 강력한 안전 기준과 반복적인 정책 확장을 강조합니다.",
      "주요 공약에는 '레드라인 역량'을 파악 및 테스트하고, 엄격한 안전을 위한 ASL-3 표준을 구현하며, 핵 보안 및 사이버 보안과 같은 분야의 관행을 통합하기 위한 학제 간 팀을 구성하는 것이 포함됩니다.",
      "이 단체는 업계 협력을 촉진하고 위험 관리 프레임워크에 대한 정부의 노력을 알리는 것을 목표로 하며, AI 서울 서밋에서 이를 논의할 계획입니다."
    ],
    "commentSummary": [
      "Anthropic의 '책임 있는 확장 정책'은 미래의 위험과 엄격한 억제 조치를 강조함으로써 생물무기 및 사이버 보안 위협과 같은 고위험 AI 기능에 대처하는 것을 목표로 합니다.",
      "비평가들은 이 정책이 너무 관대하고 기본적이라고 주장하며 더 엄격한 기준, 향상된 AI 자율성, 혁신과 안전 사이의 균형을 요구합니다.",
      "이 토론에서는 AI의 안전성, 투명성, 윤리적 영향에 대한 다양한 견해가 제시되었으며, 일부는 책임감 있는 개발과 대중의 이해를 강조하는 반면 다른 일부는 마케팅이나 규제 목적으로 AI의 위험이 과장되었다고 주장합니다."
    ],
    "points": 146,
    "commentCount": 130,
    "retryCount": 0,
    "time": 1716167704
  },
  {
    "id": 40410603,
    "title": "제너레이티브 아트 살펴보기: 알고리즘, 자연, 창의성의 교차점: 제너레이티브 아트 살펴보기",
    "originLink": "https://www.amygoodchild.com/blog/what-is-generative-art",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40410603",
    "commentBody": "",
    "originSummary": [
      "제너레이티브 아트는 무작위성, 규칙, 자연 시스템과 같은 요소를 사용하여 자율적인 프로세스를 통해 예술 작품을 제작하는 것으로, PRNG는 자연 현상에서 얻은 가변성과 진정한 무작위성을 도입합니다.",
      "이 책에서는 베라 몰나르 같은 선구자를 조명하고 솔 르윗의 지침과 콘웨이의 게임 오브 라이프 같은 사례를 들며 절차적 생성, 규칙 기반 예술, 즉흥적 행동에 대해 살펴봅니다.",
      "데이터 기반 예술과 인공지능 예술의 사례를 통해 예술가와 기계 사이의 제어 균형을 강조하고, 진화하는 제너레이티브 아트 분야에서 더 많은 탐구와 혁신을 장려하는 기사입니다."
    ],
    "commentSummary": [
      "제너레이티브 아트에 대한 논의에서는 다양한 도구와 역사적 맥락, 그리고 Swift와 JavaScript와 같은 코딩 언어를 살펴보고 컨텍스트 프리 아트와 AARON과 같은 플랫폼을 강조합니다.",
      "기고자들은 예술적 즐거움과 상업적 실행 가능성의 균형을 맞추고, 예술 창작에서 무작위성과 알고리즘의 역할에 대해 논의하며 NFT를 통한 제너레이티브 아트의 수익화에 대해 토론합니다.",
      "이 대담에서는 AI가 전통적인 예술 분야에 미치는 영향, 오픈소스 솔루션의 잠재력, 창작 결과물에서 인간적 연결과 내러티브의 필요성에 대해서도 다룹니다."
    ],
    "points": 143,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1716162227
  },
  {
    "id": 40410637,
    "title": "매초마다 비디오 프레임을 JPG로 캡처하는 GitHub 스크립트 'ffmpeg-english'",
    "originLink": "https://github.com/dheera/scripts/blob/master/ffmpeg-english",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40410637",
    "commentBody": "",
    "originSummary": [
      "GitHub 리포지토리 \"dheera/scripts\"에는 50줄의 코드가 포함된 \"ffmpeg-english\"라는 스크립트가 있습니다.",
      "이 리포지토리는 8개의 포크와 45개의 별을 획득하여 커뮤니티의 관심과 참여가 보통 수준임을 나타냅니다.",
      "최신 커밋 기록 및 파일 메타데이터와 함께 이슈, 풀 리퀘스트, 작업, 프로젝트, 위키와 같은 포괄적인 기능이 포함되어 있습니다."
    ],
    "commentSummary": [
      "GitHub 토론에서는 `/dev/video0`에서 `ffmpeg`를 사용하여 매초마다 이미지를 캡처하는 것에 초점을 맞추고 있으며, 사용자들은 GitHub Copilot CLI와 같은 대안을 제안하고 AI 생성 명령에 대한 보안 우려를 표명하고 있습니다.",
      "사용자들은 보다 안전한 실행을 위해 `aichat` 및 `subprocess.Popen`과 같은 도구를 추천하고, AI 명령 생성에서 편의성과 보안 사이의 균형에 대해 논의합니다.",
      "이 대화에서는 AI가 생성한 명령이든 사람이 작성한 명령이든 명령의 이해와 검증의 중요성을 강조하고, Docker 컨테이너 및 사용자 확인과 같은 예방 조치를 통해 명령줄 인터페이스에 AI를 통합하는 방법에 대해 논의합니다."
    ],
    "points": 131,
    "commentCount": 91,
    "retryCount": 0,
    "time": 1716162610
  },
  {
    "id": 40409757,
    "title": "변형 타원을 사용하여 텍스트 원근 왜곡 보정하기: 간단한 접근 방식",
    "originLink": "https://mzucker.github.io/2016/10/11/unprojecting-text-with-ellipses.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40409757",
    "commentBody": "",
    "originSummary": [
      "이 글에서는 변형 타원을 사용하여 텍스트 사진의 원근 왜곡을 보정하는 간단한 방법을 소개하며, 카를로스 메리노-그라시아 외의 복잡한 방법에서 영감을 얻었습니다.",
      "이 접근 방식에는 임계값과 연결된 구성 요소 레이블을 사용하여 문자를 분리한 다음 동형(8-파라미터 매트릭스)을 사용하여 문자 모양이 균일한 영역을 갖도록 이미지를 조정하는 것이 포함됩니다.",
      "원근, 회전, 기울기 변환을 포함하는 이 방법은 효과적이며, 최신 기술은 아니지만 GitHub에서 코드를 사용할 수 있습니다."
    ],
    "commentSummary": [
      "이 문서에서는 선형 대수, 행렬 곱셈, 휴 변환을 사용하여 텍스트의 원근 왜곡을 보정하는 방법에 대해 설명합니다.",
      "이 기술은 단어 또는 페이지 경계를 식별할 필요가 없어 복잡하지만 다양한 시나리오에서 잠재적으로 유용할 수 있습니다.",
      "이 대화에는 특히 이미지에서 텍스트 보정을 위한 방법의 복잡성, 효과 및 대안에 대한 토론이 포함됩니다."
    ],
    "points": 128,
    "commentCount": 18,
    "retryCount": 0,
    "time": 1716152897
  }
]
