[
  {
    "title": "Finance Near Foundation and Polygon Labs Build ZK Solution, Ritual Decentralizes AI Access, and Banks SEBA & HSBC Expand Crypto Services",
    "originLink": "https://www.coindesk.com/business/",
    "originBody": "Finance Near Foundation and Polygon Labs Collaborate to Build ZK Solution The aim of the tie-up is to allow for greater interoperability across chains. By Lyllah Ledesma Nov 8, 2023 Artificial Intelligence Platform Ritual Looks to 'Decentralize Access to AI' With $25M Backing Ritual's aim is to open access to the infrastructure that lies behind AI innovation, which it claims at present \"lies in the hands of a few powerful companies.\" By Jamie Crawley Nov 8, 2023 Swiss Crypto Bank SEBA Wins Hong Kong License The bank's Hong Kong unit can now deal in and distribute securities, including products related to virtual assets related. By Sandali Handagama Nov 8, 2023 HSBC to Offer Tokenized Securities Custody Service for Institutions The platform, planned for 2024, complements its new offering for tokenized gold as well as one for issuing digital assets. By Ian Allison Nov 8, 2023 Trending in Finance 1 Ripple Broadens Remittances Between Africa, Gulf States, UK and Australia Nov 8, 2023 2 Robinhood to Expand Crypto Trading Into EU, Plans to Start UK Brokerage Nov 7, 2023 3 Crypto VC Funding Slowed Last Week as $35M Raised in 9 Deals Including Uniswap DAO Nov 7, 2023 4 Crypto Broker sFOX Offers Commission-Free Blockchain Staking from Regulated Custody Nov 7, 2023 Opinion Crypto for Advisors: Opinion: Direct Crypto Ownership Is Best By Sarah MortonChris King Nov 2, 2023 On Bitcoin White Paper's 15th Anniversary, Wall Street Threatens to Swallow Its One-Time Challenger By Nick Baker Oct 31, 2023 Crypto for Advisors: ETH Futures ETFs and What’s Next By Sarah MortonRoxanna Islam Oct 26, 2023 Interview Former FTX.US President’s New Venture Is Seeking to Harness AI for Crypto Trading Brett Harrison’s new firm, Architect, aims to be an one-stop platform for institutional-grade crypto trading. Jul 5, 2023 Recent Videos What a New U.S. Consumer Watchdog Proposal Could Mean for Crypto Payments Nov 8, 2023 CoinDesk Managing Editor of Global Policy and Regulation Nikhilesh De explains what a new proposal published by the U.S. Consumer Financial Protection Bureau (CFPB) could mean for large nonbank payment providers, like PayPal or Jack Dorsey's Block. Show more Up Next 04:13 How Companies Like PayPal, Jack Dorsey's Block Could Be Impacted by CFPB Plan Nov 8, 2023 01:22 Injective Labs CEO Discusses a 'Highly Promising Sign' for the Evolution of DeFi Nov 8, 2023 08:17 Injective Survey Suggests Many Traders Use Centralized and Decentralized Exchanges Nov 8, 2023 10:56 Widening Crypto Rally Lifts Total Crypto Market Cap to $1.3T Nov 8, 2023 View all More from Finance Today Finance Near foundation Near Foundation and Polygon Labs Collaborate to Build ZK Solution The aim of the tie-up is to allow for greater interoperability across chains. By Lyllah Ledesma Sponsored Nov 8, 2023 at 1:59 p.m. UTC Nov 8, 2023 Near foundation Near Polygon labs Finance Ai Artificial Intelligence Platform Ritual Looks to 'Decentralize Access to AI' With $25M Backing Ritual's aim is to open access to the infrastructure that lies behind AI innovation, which it claims at present \"lies in the hands of a few powerful companies.\" By Jamie Crawley Sponsored Nov 8, 2023 at 1:31 p.m. UTC Nov 8, 2023 AI Funding Rounds Policy Regulations Swiss Crypto Bank SEBA Wins Hong Kong License The bank's Hong Kong unit can now deal in and distribute securities, including products related to virtual assets related. By Sandali Handagama Sponsored Nov 8, 2023 at 12:47 p.m. UTC Nov 8, 2023 Regulations Hong Kong SFC SEBA Switzerland Finance Hsbc HSBC to Offer Tokenized Securities Custody Service for Institutions The platform, planned for 2024, complements its new offering for tokenized gold as well as one for issuing digital assets. By Ian Allison Sponsored Nov 8, 2023 at 9:50 a.m. UTC Nov 8, 2023 HSBC Tokenization Custody Metaco Real World Assets Finance Binance Trust Wallet's TWT Falls as Parent Company Binance Releases Web3 Wallet Binance acquired Trust Wallet in 2018 in a deal that included cash and BNB tokens, which at the time were worth $14.80. By Oliver Knight Sponsored Nov 8, 2023 at 7:47 a.m. UTC Nov 8, 2023 Binance Trust Wallet Wallet Web3 Finance Binance Binance Rolls Out Its First Ever Self-Custody Web3 Wallet Users can download and access the wallet through Binance's app. By Oliver Knight Sponsored Nov 8, 2023 at 7:30 a.m. UTC Nov 8, 2023 Binance Web3 Wallet Show More",
    "originSummary": [
      "Finance Near Foundation and Polygon Labs are collaborating to develop a Zero-Knowledge (ZK) solution for improved interoperability between different digital transaction chains.",
      "AI platform Ritual has received a $25M investment to decentralize access to AI, focusing on the infrastructure responsible for AI innovation.",
      "Swiss cryptocurrency bank SEBA obtained a Hong Kong license to deal in and distribute securities, including virtual assets, while HSBC plans to start a tokenized securities custody service by 2024. Other key highlights include Ripple extending remittance services and Robinhood expanding its crypto trading operations into the EU."
    ],
    "commentBody": "",
    "commentSummary": [
      "Finance Near Foundation and Polygon Labs are collaborating to develop a Zero-Knowledge (ZK) solution for enhanced interoperability across different blockchain networks.",
      "Ritual, an AI platform, with a $25M investment, is targeting the infrastructure that supports AI innovation, with the goal of making AI more accessible.",
      "Various financial institutions are making significant moves: SEBA, a Swiss crypto bank, has gained a license in Hong Kong to deal with securities related to virtual assets; HSBC is preparing to launch a tokenized securities custody service in 2024; Ripple is extending its remittance services, and Robinhood is expanding its crypto trading operations into the EU, and planning a UK brokerage."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699461086429
  },
  {
    "title": "NEAR Foundation and Polygon Labs to Develop zkWASM, a Zero-Knowledge Prover for WASM Blockchains, Enhancing Web3 Interoperability",
    "originLink": "https://www.prnewswire.co.uk/news-releases/near-foundation-and-polygon-labs-join-forces-to-build-zero-knowledge-solution-for-wasm-chains-301978368.html",
    "originBody": "NEAR Foundation and Polygon Labs join forces to build Zero-Knowledge Solution for WASM Chains News provided by NEAR Foundation 08 Nov, 2023, 14:01 GMT Share this article Share toX Share this article Share toX Leading ZK researchers and WASM experts to develop a zero-knowledge prover for WASM blockchains available via Polygon CDK The zkWASM collaboration leverages Polygon Labs' groundbreaking zero-knowledge R&D with NEAR Foundation's WASM expertise, positioning this ZK solution at the forefront of the Web3 market zkWASM will eventually be one of three provers available for developers who choose to build with Polygon Chain Development Kit (CDK), an open source codebase for launching ZK-powered L2 chains for Ethereum NEAR Foundation becomes a core contributor to Polygon CDK This pioneering research initiative will pave the way for greater trustless interoperability across Web3, including between NEAR and the Ethereum ecosystem LISBON, Portugal, Nov. 8, 2023 /PRNewswire/ --NEAR Foundation, the non-profit that supports the growth and development of the NEAR ecosystem, and Polygon Labs, a software development company for leading Ethereum Layer 2 scaling architecture, announce a strategic collaboration to build zkWASM, a zero-knowledge (ZK) prover for WASM blockchains. With Polygon Labs' authority in ZK scaling technology and NEAR's deep WASM runtime expertise, the zkWASM prover is positioned to lead the market among other wasm provers when it launches next year. Both teams shared the announcement today at the NEAR ecosystem's annual flagship conference, NEARCON, in Lisbon. Continue Reading NEAR Foundation and Polygon Labs join forces to build Zero-Knowledge Solution for WASM Chains This announcement brings together two leading protocol teams to build a more secure, interoperable Web3 ecosystem. A zkWASM prover positions NEAR Protocol closer to Ethereum and enables WASM chains to tap into Ethereum liquidity. In the future, through an in-development interoperability layer, chains will also be able to access shared liquidity in a unified ecosystem of CDK-deployed chains, including alternative layer-1s, EVM layer-2s, and WASM chains. Using a zkWASM prover, WASM chains will be able to settle transactions efficiently and cost-effectively with maximum security guarantees, unlocking the full potential of zero-knowledge for the multichain future of Web3. \"We are proud to collaborate with NEAR on this exciting research initiative to further drive the development and adoption of ZK technology. The zkWASM prover maximizes developer customizability, which means projects will be able to select from a number of provers when building with CDK, whether that's launching or migrating an EVM chain, or building a WASM chain for closer Ethereum alignment and access to liquidity,\" said Sandeep Nailwal, co-founder of Polygon. A zkWASM prover will be an upgrade for NEAR validators–instead of the hard work of validating a shard, validators will instead be able to generate a single zero-knowledge proof, greatly simplifying validator requirements. This means better scalability and increased decentralization for the NEAR Protocol. \"We are very excited to work with Polygon Labs to bring all the benefits of zero-knowledge proofs not just to NEAR but all of Web3,\" said Illia Polosukhin, co-founder of NEAR Protocol. \"NEAR is integrating more with Ethereum by innovating in new research frontiers, and the shared expertise of NEAR and Polygon will expand the ZK landscape and defragment liquidity across chains. Creating and using the zkWASM prover will also improve the scalability and decentralization of the NEAR L1.\" The zkWASM prover is now in active development and is expected to launch next year. About NEAR Foundation: NEAR foundation is a Switzerland-based nonprofit foundation whose mission is to enable community driven innovation to benefit people around the world. One of its core areas of focus is the NEAR ecosystem, which includes a fully operational decentralized Blockchain-based platform for building decentralized applications. NF carries out its mission, primarily through the allocation of support and resources to other nodes in the near ecosystem, rather than via direct intervention or operations. Unlike many organizations of its type, NF's ultimate goal is to minimize its own scope and footprint by continuing to divide functions and resources to the ecosystem; and support the development of decentralized infrastructure necessary for those ecosystem functions to operate in a self-sufficient manner. For more information visit the website. About Polygon Labs: Polygon Labs develops Ethereum scaling solutions for Polygon protocols. Polygon Labs engages with other ecosystem developers to help make available scalable, affordable, secure and sustainable blockchain infrastructure for web3. Polygon Labs has initially developed a growing suite of protocols for developers to gain easy access to major scaling solutions, including layer 2s (zero-knowledge rollups and optimistic rollups), sidechains, hybrid chains, app-specific chains, enterprise chains, and data availability protocols. Scaling solutions that Polygon Labs initially developed have seen widespread adoption with tens of thousands of decentralized apps, unique addresses exceeding 220.8 million, over 1.18 million smart contracts created and 2.48 billion total transactions processed since inception. The existing Polygon network is home for some of the biggest web3 projects, such as Aave, Uniswap, and OpenSea, and well-known enterprises, including Robinhood, Stripe and Adobe. Polygon Labs is carbon neutral with the goal of leading web3 in becoming carbon negative. If you're an Ethereum Developer, you're already a Polygon developer! Leverage Polygon's fast and secure transactions for dApps you develop, get started here. WebsiteTwitterDeveloper TwitterTelegramLinkedInRedditDiscordInstagramFacebook CONTACT: Georgia Hanias press@near.foundation Photo - https://mma.prnewswire.com/media/2267120/polygon_social.jpg Logo - https://mma.prnewswire.com/media/2039011/NEAR_logo_Logo.jpg × Modal title",
    "originSummary": [
      "The NEAR Foundation, a non-profit organization, and Polygon Labs are joining forces to develop a zero-knowledge prover named zkWASM for WASM blockchains, using Polygon Labs' knowledge of zero-knowledge scaling technology and NEAR's WASM runtime expertise.",
      "Slated to debut in 2024, zkWASM will be among three provers available for developers using the Polygon Chain Development Kit, with NEAR, a principal contributor to the Kit, foreseeing enhanced trustless interoperability across Web3, including NEAR and Ethereum connections.",
      "This partnership is anticipated to exploit the full potential of zero-knowledge technology for the future evolution of the multichain Web3."
    ],
    "commentBody": "",
    "commentSummary": [
      "Non-profit NEAR Foundation is collaborating with Polygon Labs to develop a zero-knowledge prover named zkWASM for WASM blockchains, leveraging Polygon Labs' expertize in zero-knowledge scaling technology and NEAR's WASM runtime skills.",
      "Expected for release in 2024, zkWASM will be one of three provers accessible to developers using the Polygon Chain Development Kit (Polygon CDK), with NEAR being a primary contributor.",
      "This partnership aims to enhance trustless interoperability across Web3, including between NEAR and Ethereum, potentially unlocking more possibilities for zero-knowledge technology in the multi-chain Web3 future."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699461086429
  },
  {
    "title": "Kraken Cryptocurrency Exchange Explores Partnerships for Building Layer-2 Blockchain Network",
    "originLink": "https://www.coindesk.com/tech/2023/11/07/kraken-said-to-seek-partner-to-help-build-it-a-layer-2-blockchain-network/",
    "originBody": "Technology Kraken Said to Seek Partner to Help Build It a Layer 2 Blockchain Network The crypto exchange is still considering which blockchain developer should build its network, with Polygon, Matter Labs and the Nil Foundation in the mix, according to people familiar with the situation. Rival crypto exchange Coinbase blazed the trail with Base. By Margaux Nijkerk Nov 7, 2023 at 1:16 a.m. UTC Updated Nov 7, 2023 at 5:20 p.m. UTC Kraken Chairman Jesse Powell (CoinDesk) 10 Years of Decentralizing the Future May 29-31, 2024 - Austin, Texas The biggest and most established global hub for everything crypto, blockchain and Web3. Register Now Kraken, the big U.S. cryptocurrency exchange, is considering several of the leading blockchain-technology firms to help launch its own layer 2 network, people familiar with the matter told CoinDesk. Such a move would bring Kraken in line with the move earlier this year by rival Coinbase to launch its own layer-2 network. Kraken is considering Polygon, Matter Labs and Nil Foundation among others about using their technology as the basis for the new network, according to the sources, who asked not to be named because the effort was not publicly disclosed and the conversations are still fluid. There may also be other teams in the discussions. “We’re always looking to identify and solve for new industry challenges and opportunities,\" a Kraken spokesperson told CoinDesk. \"We don’t have anything further to share at this time.” Major crypto companies with established brands and customer followings have been seeking to grow their presence as blockchain builders, either as a potential source of new revenue or simply as an extension of their current operations. In August, crypto exchange Coinbase released its own layer 2 network, Base, which makes use of the OP Stack, from the OP Labs team that built Optimism, the second-biggest layer-2 network atop the Ethereum blockchain. Polygon, a leading developer of Ethereum scaling solutions with its Polygon PoS network and more recently the Polygon zkEVM, earlier this year came out with a new software toolkit that developers can use to spin up their own blockchains. Matter Labs, the developer behind the zkSync layer-2 network, also offers its technology to upstart builders. Kraken recently added a job posting on the careers section of its website, advertising for a \"Senior Cryptography Engineer\" with \"knowledge of modern cryptography (including ZK proofs)\" whose opportunities could include \"design and implementation of layer-2 solutions.\" \"We are enthusiastic about open source, layer-2 technologies, zero-knowledge proofs, multi-party computation, and continuously strive to explore the potential of on-chain scaling solutions,\" the job description reads. \"The team has recently embarked on exploring how more protocols and decentralized applications can be integrated into Kraken.\" With reporting by Elizabeth Napolitano. Edited by Bradley Keoun. A D V E R T I S E M E N T A D V E R T I S E M E N T DISCLOSURE Please note that our privacy policy, terms of use, cookies, and do not sell my personal information has been updated. The leader in news and information on cryptocurrency, digital assets and the future of money, CoinDesk is a media outlet that strives for the highest journalistic standards and abides by a strict set of editorial policies. CoinDesk is an independent operating subsidiary of Digital Currency Group, which invests in cryptocurrencies and blockchain startups. As part of their compensation, certain CoinDesk employees, including editorial employees, may receive exposure to DCG equity in the form of stock appreciation rights, which vest over a multi-year period. CoinDesk journalists are not allowed to purchase stock outright in DCG. Margaux Nijkerk Margaux Nijkerk reports on the Ethereum protocol and L2s. A graduate of Johns Hopkins and Emory universities, she has a masters in International Affairs & Economics. She holds a small amount of ETH and other altcoins. Follow @cryptauxmargaux on Twitter Learn more about Consensus 2024, CoinDesk’s longest-running and most influential event that brings together all sides of crypto, blockchain and Web3. Head to consensus.coindesk.com to register and buy your pass now. Read more about Kraken layer 2 rollup Rollups ZK rollups Zero-Knowledge Proofs Crypto Exchange Polygon Matter Labs",
    "originSummary": [
      "Kraken, a significant U.S. cryptocurrency exchange, is considering partnerships with blockchain developers to construct its own layer 2 network, a move that could expand its operations and earn additional revenue.",
      "The initiative mirrors Coinbase's effort earlier this year to generate its own layer-2 network. Potential collaboration teams include Polygon, Matter Labs, and Nil Foundation, but official confirmation is still pending.",
      "A recent job advertisement for a Senior Cryptography Engineer suggests that Kraken is serious about developing this aspect of its business."
    ],
    "commentBody": "",
    "commentSummary": [
      "U.S. cryptocurrency exchange, Kraken, is reportedly looking into collaborating with blockchain developers to establish its layer 2 network, potentially aligning its operations with Coinbase's earlier initiative to launch its own layer 2 network.",
      "The move aims at expanding Kraken's operations and generating additional revenue streams. Potential collaborators include Polygon, Matter Labs, and Nil Foundation, but no official confirmation has been provided.",
      "The recent job advertisement for a Senior Cryptography Engineer by the company implies a serious commitment to this new endeavor."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699461086429
  },
  {
    "title": "Menyala Leads $4M Seed Funding for NFT Platform Authentick",
    "originLink": "https://www.nftgators.com/sui-blockchain-teams-up-with-space-and-time-to-power-web3-games-with-zk-proofs/",
    "originBody": "INDUSTRY NEWS NFT NEWS Temasek-Backed Menyala Leads $4M Seed Round for NFT Platform Authentick by Nicholas Kitonyi November 8, 2023",
    "originSummary": [
      "Temasek-backed company, Menyala, has spearheaded a $4M seed funding round for Authentick, an NFT platform.",
      "Non-fungible tokens, or NFTs, are unique digital assets verified using blockchain technology, popular in the art and collectibles space.",
      "This investment indicates growing interest and financial involvement in the NFT sector."
    ],
    "commentBody": "",
    "commentSummary": [
      "Menyala, backed by Temasek, directed a $4M seed funding round for Authentick, an NFT (non-fungible tokens) platform.",
      "This funding demonstrates an increased interest and investment in the NFT market.",
      "Authentick, as a platform, facilitates the creation, sale, and trading of NFTs."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699461086429
  },
  {
    "title": "Comprehensive Cryptocurrency Market Analysis: Updates on Bitcoin, Ethereum and Top Altcoins",
    "originLink": "https://www.coindesk.com/price/xen-crypto/",
    "originBody": "This website uses cookies We use cookies to personalise content and ads, to provide social media features and to analyse our traffic. We also share information about your use of our site with our social media, advertising and analytics partners who may combine it with other information that you’ve provided to them or that they’ve collected from your use of their services. You consent to our cookies if you continue to use our website. Show details Do not sell or share my personal information OK Consensus Startup Bundle Now Available Register Now TV & Videos Newsletters Podcasts Events Indices Markets Finance Policy Technology Learn Consensus Magazine Protocol Village Sponsored Content Bitcoin $35,237.77+1.44% Ethereum $1,890.62+1.32% Binance Coin $246.26+0.45% XRP $0.68445012+1.80% Solana $42.78+3.04% Cardano $0.35651221+4.87% Dogecoin $0.07411825+1.88% Tron $0.09734963+1.24% Chainlink $13.99+8.91% Polygon $0.78493335+11.13% Polkadot $4.96+3.21% Wrapped Bitcoin $35,512.69+1.81% Crypto Prices CoinDesk Market Index XEN Crypto XEN $0,064597 0.21% 0,064346 24H Price 0,064843 Buy / Sell Get Crypto Share Chart About XEN Crypto The XEN Crypto price is $0.0000004597, a change of 0.21% over the past 24 hours as of 4:34 p.m. The recent price action in XEN Read more... Buy crypto on a secure, trusted platform. Cryptoassets are highlCryptoasset investing is highly volatile and unregulated in some EU countries. No consumer protection. Tax on profits may apply. Don’t invest unless you’re prepared to lose all the money you invest. Latest About XEN Crypto Markets First mover First Mover Americas: Binance Unveils Self-Custody Wallet The latest price moves in crypto markets in context for Nov. 8, 2023. By Jamie CrawleyOmkar Godbole Sponsored Nov 8, 2023 at 1:01 p.m. UTC Nov 8, 2023 First Mover Markets Bitcoin Markets Market wrap Bitcoin Squeezes to $35.5K as 'Mini Altcoin Season' Lifts Crypto Market Cap to $1.3 Trillion Capital rotation from bitcoin to altcoins accelerated further but steady inflows into BTC funds compensated, one analyst noted. By Krisztian Sandor Sponsored Nov 7, 2023 at 8:47 p.m. UTC Nov 7, 2023 Market Wrap Markets Bitcoin Solana Altcoins Markets First mover First Mover Americas: Bitcoin Ordinals Protocol Token Jumps 50% The latest price moves in crypto markets in context for Nov. 7, 2023. By Lyllah LedesmaOmkar Godbole Sponsored Nov 7, 2023 at 1:01 p.m. UTC Nov 7, 2023 First Mover Markets Bitcoin Markets Shib SHIB, DOGE Top Open Futures Rankings as Bitcoin Rally Spurs Risk-Taking SHIB and DOGE have seen highest percentage growth in futures open interest since Nov. 1, outshining bitcoin and ether in a sign of increased investor risk appetite in the cryp... By Omkar Godbole Sponsored Nov 7, 2023 at 10:56 a.m. UTC Nov 7, 2023 SHIB DOGE Dogecoin Markets Futures open interest XEN Crypto Price Buy / Sell 24H Low 0,064346 24H High 0,064843 24H Open 0,064588 24H Change 0,099407 52 Week Low $0 52 Week High $0.00001500 All Time High $0.00037000 Returns (YTD) -90.38% XEN Crypto Market Stats Market Cap $14.54M 24H Volume Max Supply Total Supply 31.63T 24H Value Transacted 30D Volatility 1.50 24H Transaction Count 24H Average Transaction Fee Show more stats Trending Assets View All eToro Sponsored Discover a friendly, trusted crypto investing platform Enjoy an easy-to-use experience as you trade over 70 top cryptoassets such as Bitcoin, Ethereum, Shiba and more. Cryptoasset investing is highly volatile and unregulated in some EU countries. No consumer protection. Tax on profits may apply. Don’t invest unless you’re prepared to lose all the money you invest.XBX Bitcoin Price Index XBX The CoinDesk Bitcoin Price Index (XBX) is the world’s leading reference for the price of bitcoin, used by the largest institutions active in crypto assets. It is the crypto market standard, benchmarking billions of dollars in registered financial products and pricing hundreds of millions in daily over-the-counter transactions. Built for replicability and reliability, in continuous operation since 2014, the XBX is relied upon by asset allocators, asset managers, market participants and exchanges. The XBX is the flagship in a portfolio of single- and multi-asset indices offered by CoinDesk. Learn more on CoinDesk Indices BTC Bitcoin $35,237.77 1.44% eToro Sponsored Discover a friendly, trusted crypto investing platform Enjoy an easy-to-use experience as you trade over 70 top cryptoassets such as Bitcoin, Ethereum, Shiba and more. Cryptoasset investing is highly volatile and unregulated in some EU countries. No consumer protection. Tax on profits may apply. Don’t invest unless you’re prepared to lose all the money you invest. ETH Ethereum $1,890.62 1.32% BNB Binance Coin $246.26 0.45% XRP XRP $0.68445012 1.80% SOL Solana $42.78 3.04% ADA Cardano $0.35651221 4.87% DOGE Dogecoin $0.07411825 1.88% First Mover OpenSea Investor Reportedly Slashes Marketplace's Valuation; Could Bitcoin Top $40K? The Information reports the valuation of NFT marketplace OpenSea has been slashed by 90% from asset manager Coatue Management Read more... Watch CoinDesk TVView all videos eToro Sponsored Buy crypto with FREE cold storage Your top cryptoassets deserve top-tier security. Own a wide variety of cryptos on a trusted and safe platform. Cryptoasset investing is highly volatile and unregulated in some EU countries. No consumer protection. Tax on profits may apply. Don’t invest unless you’re prepared to lose all the money you invest. Crypto Sectors Sectors Assets Industry & Group XEN Crypto (XEN) is not in the CoinDesk DACS 500. DACS Of the undefined assets in sector, XEN Crypto represents undefined% of the Marketcap. Top assets in Sector Assets Weight 24H% Source: Coindesk DACS monthly update. CoinDesk Indices View All Top Indices including XEN Crypto Index name Ticker Weight 24H Bitcoin Calculator Crypto to FIAT Crypto to Crypto BTC USD Buy / Sell Last Updated on 11/08/23 4:34 PM UTC CoinDesk’s Bitcoin and Cryptocurrency Calculator determines the exchange rates between major fiat currencies and cryptocurrencies – including BTC, BCH, ETH and XRP to USD, EUR, GBP, IDR and NGN – with up to six decimal places of accuracy. Conversion rates are based on CoinDesk’s Bitcoin Price Index and the price indices of other digital assets. World currency prices are based on rates obtained via Open Exchange Rates. Go To Bitcoin Calculator Market Analysis Returns Number of Transactions Price Performance Average Time Token is Held Social Analysis Twitter Sentiment Search Trends Research Reports Diving in deeper on cryptocurrency. CoinDesk Research’s 2022 Annual Crypto Review Introducing Consensus Magazine: Putting Web3 in Perspective CoinDesk 2021 Annual Crypto Review About About Masthead Contributors Careers CoinDesk News Stay Updated Events CoinDesk Studios Newsletters Follow Get In Touch Contact Us Advertise Accessibility Help Sitemap The Fine Print Ethics Policy Privacy Terms Of Use Update My Cookie Consent Do Not Sell My Personal Information Please note that our privacy policy, terms of use, cookies, and do not sell my personal information has been updated. The leader in news and information on cryptocurrency, digital assets and the future of money, CoinDesk is a media outlet that strives for the highest journalistic standards and abides by a strict set of editorial policies. CoinDesk is an independent operating subsidiary of Digital Currency Group, which invests in cryptocurrencies and blockchain startups. As part of their compensation, certain CoinDesk employees, including editorial employees, may receive exposure to DCG equity in the form of stock appreciation rights, which vest over a multi-year period. CoinDesk journalists are not allowed to purchase stock outright in DCG. ©2023 CoinDesk English",
    "originSummary": [
      "The website offers customized content through cookies, including ads, social media features, and traffic analysis.",
      "Current prices for cryptocurrencies like Bitcoin and Ethereum are provided, along with updates on others such as Binance Coin, Solana, Cardano, Dogecoin, and Polkadot.",
      "It includes cautionary advice about the high volatility of cryptocurrency investment, and potential total loss, especially in some unregulated EU countries. The website also features market analysis, social analysis, and related research reports."
    ],
    "commentBody": "",
    "commentSummary": [
      "The website offers personalized content, ads, traffic analysis, and social media features, with a focus on various cryptocurrencies like Bitcoin, Ethereum, Binance Coin, Solana, Cardano, Dogecoin, and Polkadot.",
      "It provides updated prices for said cryptocurrencies - Bitcoin valued at $35,237.77 and Ethereum at $1,890.62, among others.",
      "There's a warning about the volatility and regulatory status of crypto investment in certain EU countries, advising users they might lose all their investments, alongside sections on market and social analysis and research reports for further insights in the crypto market."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699461086429
  },
  {
    "title": "Analyzing Bonk Coin: Market Trends, Price Movements, and Cryptocurrency Risks",
    "originLink": "https://www.coindesk.com/price/bonk/",
    "originBody": "This website uses cookies We use cookies to personalise content and ads, to provide social media features and to analyse our traffic. We also share information about your use of our site with our social media, advertising and analytics partners who may combine it with other information that you’ve provided to them or that they’ve collected from your use of their services. You consent to our cookies if you continue to use our website. Show details Do not sell or share my personal information OK Consensus Startup Bundle Now Available Register Now TV & Videos Newsletters Podcasts Events Indices Markets Finance Policy Technology Learn Consensus Magazine Protocol Village Sponsored Content Bitcoin $35,237.77+1.44% Ethereum $1,890.62+1.32% Binance Coin $246.26+0.45% XRP $0.68445012+1.80% Solana $42.78+3.04% Cardano $0.35651221+4.87% Dogecoin $0.07411825+1.88% Tron $0.09734963+1.24% Chainlink $13.99+8.91% Polygon $0.78493335+11.13% Polkadot $4.96+3.21% Wrapped Bitcoin $35,512.69+1.81% Crypto Prices CoinDesk Market Index Bonk BONK $0,051099 36.42% 0,068013 24H Price 0,051190 Buy / Sell Get Crypto Share Chart About Bonk The Bonk price is $0.0000010994, a change of 36.42% over the past 24 hours as of 4:35 p.m. The recent price action in Bonk Read more... Buy crypto on a secure, trusted platform. Cryptoassets are highlCryptoasset investing is highly volatile and unregulated in some EU countries. No consumer protection. Tax on profits may apply. Don’t invest unless you’re prepared to lose all the money you invest. Latest About Bonk View All Markets Doge DOGE, Floki Soaring After Musk Tweets Photo of His Dog in Twitter CEO Chair Doge, Floki and SHIB are up, while BONK is flat after Musk declares his dog Floki is an amazing CEO of Twitter and “better than that other guy.” By Sam Reynolds Sponsored Feb 15, 2023 at 5:52 a.m. UTC Feb 15, 2023 DOGE Floki Elon Musk SHIB Bonk Markets Market wrap Crypto Markets Today: Bitcoin Finishes Best Week Since March; Solana’s Bonk Barks ALSO: Bitcoin cash jumps ahead of optimistic May hard fork. Traders are starting to handicap various market scenarios ahead of Ethereum's next big milestone in March. By Jocelyn Yang Sponsored Jan 13, 2023 at 10:25 p.m. UTC Jan 13, 2023 Market Wrap Markets Bitcoin Ether Altcoins Crypto Markets Today CDI Data Tech Meme coin Inside Bonk Inu: How 22 Developers Put the Shiba Inu Fun Into Solana and Away From FTX Distraught, disgusted, and jaded: Solana’s popularity took a hit when reports of possible fraud at Sam Bankman-Fried’s then-behemoth crypto exchange FTX first came to light. B... By Shaurya Malwa Sponsored Jan 13, 2023 at 10:43 a.m. UTC Jan 13, 2023 meme coin Bonk inu Solana Exclusive Markets Shiba inu Bonk Inu to Mint NFTs on Solana-Based Marketplace Magic Eden. But There's a Catch A representative told CoinDesk that all BONK tokens used to mint the NFTs will be permanently burned. By Shaurya Malwa Sponsored Jan 10, 2023 at 11:20 a.m. UTC Jan 10, 2023 Shiba Inu meme coin DeFi Web3 NFT Solana Bonk Bonk Price Buy / Sell 24H Low 0,068013 24H High 0,051190 24H Open 0,068059 24H Change 0,062935 52 Week Low $0 52 Week High 0,055000 All Time High 0,055000 Returns (YTD) 658.68% Bonk Market Stats Market Cap $47.25M 24H Volume Max Supply 93.86T Total Supply 93.86T 24H Value Transacted 30D Volatility 2.59 24H Transaction Count 24H Average Transaction Fee Show more stats Trending Assets View All eToro Sponsored Discover a friendly, trusted crypto investing platform Enjoy an easy-to-use experience as you trade over 70 top cryptoassets such as Bitcoin, Ethereum, Shiba and more. Cryptoasset investing is highly volatile and unregulated in some EU countries. No consumer protection. Tax on profits may apply. Don’t invest unless you’re prepared to lose all the money you invest.XBX Bitcoin Price Index XBX The CoinDesk Bitcoin Price Index (XBX) is the world’s leading reference for the price of bitcoin, used by the largest institutions active in crypto assets. It is the crypto market standard, benchmarking billions of dollars in registered financial products and pricing hundreds of millions in daily over-the-counter transactions. Built for replicability and reliability, in continuous operation since 2014, the XBX is relied upon by asset allocators, asset managers, market participants and exchanges. The XBX is the flagship in a portfolio of single- and multi-asset indices offered by CoinDesk. Learn more on CoinDesk Indices BTC Bitcoin $35,237.77 1.44% eToro Sponsored Discover a friendly, trusted crypto investing platform Enjoy an easy-to-use experience as you trade over 70 top cryptoassets such as Bitcoin, Ethereum, Shiba and more. Cryptoasset investing is highly volatile and unregulated in some EU countries. No consumer protection. Tax on profits may apply. Don’t invest unless you’re prepared to lose all the money you invest. ETH Ethereum $1,890.62 1.32% BNB Binance Coin $246.26 0.45% XRP XRP $0.68445012 1.80% SOL Solana $42.78 3.04% ADA Cardano $0.35651221 4.87% DOGE Dogecoin $0.07411825 1.88% First Mover OpenSea Investor Reportedly Slashes Marketplace's Valuation; Could Bitcoin Top $40K? The Information reports the valuation of NFT marketplace OpenSea has been slashed by 90% from asset manager Coatue Management Read more... Watch CoinDesk TVView all videos eToro Sponsored Buy crypto with FREE cold storage Your top cryptoassets deserve top-tier security. Own a wide variety of cryptos on a trusted and safe platform. Cryptoasset investing is highly volatile and unregulated in some EU countries. No consumer protection. Tax on profits may apply. Don’t invest unless you’re prepared to lose all the money you invest. Crypto Sectors Sectors Assets Industry & Group Bonk (BONK) is not in the CoinDesk DACS 500. DACS Of the undefined assets in sector, Bonk represents undefined% of the Marketcap. Top assets in Sector Assets Weight 24H% Source: Coindesk DACS monthly update. CoinDesk Indices View All Top Indices including Bonk Index name Ticker Weight 24H Bitcoin Calculator Crypto to FIAT Crypto to Crypto BTC USD Buy / Sell Last Updated on 11/08/23 4:35 PM UTC CoinDesk’s Bitcoin and Cryptocurrency Calculator determines the exchange rates between major fiat currencies and cryptocurrencies – including BTC, BCH, ETH and XRP to USD, EUR, GBP, IDR and NGN – with up to six decimal places of accuracy. Conversion rates are based on CoinDesk’s Bitcoin Price Index and the price indices of other digital assets. World currency prices are based on rates obtained via Open Exchange Rates. Go To Bitcoin Calculator Market Analysis Returns Number of Transactions Price Performance Average Time Token is Held Social Analysis Twitter Sentiment Search Trends Research Reports Diving in deeper on cryptocurrency. CoinDesk Research’s 2022 Annual Crypto Review Introducing Consensus Magazine: Putting Web3 in Perspective CoinDesk 2021 Annual Crypto Review About About Masthead Contributors Careers CoinDesk News Stay Updated Events CoinDesk Studios Newsletters Follow Get In Touch Contact Us Advertise Accessibility Help Sitemap The Fine Print Ethics Policy Privacy Terms Of Use Update My Cookie Consent Do Not Sell My Personal Information Please note that our privacy policy, terms of use, cookies, and do not sell my personal information has been updated. The leader in news and information on cryptocurrency, digital assets and the future of money, CoinDesk is a media outlet that strives for the highest journalistic standards and abides by a strict set of editorial policies. CoinDesk is an independent operating subsidiary of Digital Currency Group, which invests in cryptocurrencies and blockchain startups. As part of their compensation, certain CoinDesk employees, including editorial employees, may receive exposure to DCG equity in the form of stock appreciation rights, which vest over a multi-year period. CoinDesk journalists are not allowed to purchase stock outright in DCG. ©2023 CoinDesk English",
    "originSummary": [
      "The website employs cookies to personalize content, ads, and analyze traffic, with select data shared with social media, and analytics partners.",
      "It offers updates about multiple cryptocurrencies, including Bitcoin, Ethereum, Binance Coin, and more, with detailed market trends for Bonk coin.",
      "Besides information, the website provides a platform for cryptocurrency trading, emphasizing the risk and volatility associated with such investments."
    ],
    "commentBody": "",
    "commentSummary": [
      "This website provides personalized content and ads, along with traffic analysis, by using cookies.",
      "The site offers information and updates about different cryptocurrencies including but not limited to Bitcoin, Ethereum, and Cardano, including detailed market trends for specific coins like Bonk coin.",
      "It also functions as a platform for cryptocurrency transactions and emphasizes the potential risks and volatility of such investments."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699461086429
  },
  {
    "title": "Forecasting Marlin's Value: An Analysis of Potential Growth and Risks Up To 2030",
    "originLink": "https://crowdwisdom.live/crypto/marlin-price-prediction-pond/",
    "originBody": "Marlin Price Prediction 2023, 2025 and 2030 Subhash Chandra November 8, 2023 Latest Marlin Price Performance of Marlin 7 Days: +16.7% 1 M: -39.2% 12 M: -10.4% What is Marlin? Marlin is an open protocol that enables users with spare computing resources to share them with application developers. The network supports various services, including: Jobs or long-running backend services: These services can be safeguarded against tampering using secure hardware environments known as enclaves. zk-based prover computations: These computations facilitate the verification of proofs without exposing the underlying data, ensuring privacy and security. Scheduling actions based on events in the mempool: Developers can schedule specific actions to occur when certain events transpire in the mempool, which is a pool of pending transactions awaiting inclusion in a block. Caching and efficient transmission of blocks or transactions: Marlin allows developers to cache data and optimize the transmission of blocks and transactions, leading to improved efficiency in data transfer. Marlin Price Prediction: Ecosystem Marlin’s ecosystem comprises several integral components, which include: The Marlin Protocol: Serving as the foundation of the ecosystem, the Marlin Protocol is a layer-0 protocol that introduces numerous features to enhance the scalability, efficiency, and security of blockchain applications. The Marlin Network: Comprised of a network of nodes, the Marlin Network operates the Marlin Protocol. These nodes contribute the necessary computing resources to power blockchain applications within the ecosystem. The Marlin Token: The Marlin Token serves as the native cryptocurrency within the Marlin ecosystem. It is utilized for payments associated with services rendered on the Marlin Network and plays a vital role in securing the network’s operations. Together, these components work cohesively to support and strengthen the Marlin ecosystem. Is Marlin a Good Investment? Marlin presents several factors that could make it a compelling investment opportunity: Potential to address critical blockchain challenges: Marlin Protocol has the potential to tackle pressing issues encountered by blockchain networks. It offers solutions to scale blockchain applications by allowing the distribution of computational load across network nodes, mitigating scalability concerns. Rapid growth of the Marlin Network: The Marlin Network has been experiencing steady expansion with the increasing number of participating nodes. As awareness grows regarding the advantages of utilizing Marlin, this trend is likely to persist, potentially enhancing the network’s adoption and value. Limited supply of Marlin Tokens: Marlin Tokens have a finite supply of only 100 million. This scarcity has the potential to increase the value of the token over time, considering the growing demand and limited availability. While Marlin showcases promising aspects, it is essential to acknowledge the associated investment risks: Early-stage development: The Marlin Protocol is still in its early stages, implying some level of risk as the project continues to evolve. Investors should be aware of the uncertainties and potential challenges that may arise during the development process. Limited adoption compared to other networks: Marlin Network may have less widespread adoption compared to some other established blockchain networks. This could impact liquidity within the Marlin market, potentially affecting ease of token sale or conversion. Volatility in the blockchain market: The blockchain market is known for its volatility, meaning that the price of Marlin Tokens could experience significant fluctuations. Investors should be prepared for potential price volatility and the associated risks that come with it. In conclusion, Marlin demonstrates promise as an investment opportunity. However, conducting thorough research and understanding the associated risks is crucial before making any investment decisions. Marlin Price Prediction Today, Tomorrow and Week UTC: Nov 8th, 2023 12:03 PM Marlin Price Prediction in the next 24 hours is between $0.0105 and $0.0110 Marlin Price Prediction this week is between $0.00969 and $0.0116 UTC: Nov 8th, 2023 12:10 PM Overall Outlook Bullish 1. Market's Wisdom Bullish 1a. Market Data Partially Bullish 1b. Technical Recommendation Buy 2. Crowd's Wisdom Neutral 2a. Social Media Buzz Lower 2b. Social Media Sentiment Higher Marlin Price Prediction: Social Media Sentiment Metric Trend Social Mentions Lower Marlin Price Prediction 2023, 2025 and 2030 Marlin Price Prediction 2023 is $0.0174 Marlin Price Prediction 2025 is $0.032 Marlin Price Prediction 2030 is $0.149 How to buy Marlin Token? Steps to buy Marlin Token: Select a cryptocurrency exchange or DEX: Choose a reputable exchange or DEX that offers Marlin Token trading. Popular options include Binance, KuCoin, Gate.io, Uniswap, and SushiSwap. Create an account and deposit funds: Register an account on the chosen exchange or DEX and proceed to deposit funds. You can fund your account using various methods, such as fiat currency, other cryptocurrencies, or wire transfers, depending on the platform’s supported options. Purchase Marlin Token: With funds deposited, navigate to the trading section of the platform and place a buy order for Marlin Token. Consider the current market price and set the desired quantity to complete your purchase. Take note of any applicable fees or trading restrictions. Withdraw Marlin Token to a secure wallet: After completing the purchase, it is advisable to withdraw your Marlin Token from the exchange or DEX to a secure wallet. Several wallets support Marlin Token, such as the Marlin wallet, MyMarlin wallet, and Atomic wallet. Choose a wallet that aligns with your preferences and provides robust security measures. There are several popular options for purchasing Marlin Token. These are: Cryptocurrency exchanges: Well-known exchanges like Binance, KuCoin, and Gate.io list Marlin Token. To acquire Marlin Token through an exchange, create an account, deposit funds, and place a buy order. Decentralized exchanges (DEXs): DEXs such as Uniswap and SushiSwap offer trading without intermediaries. Utilize a wallet compatible with the Marlin network, deposit funds, and place a buy order on the DEX platform to acquire Marlin Token. Peer-to-peer (P2P) marketplaces: P2P marketplaces, like LocalBitcoins and Paxful, enable direct cryptocurrency transactions between users. Create an account and find a seller willing to sell Marlin Token to initiate the purchase. Where to buy Marlin Token? Few of the well-known exchanges have listed Marlin token. Marlin Token is currently listed cryptocurrency exchanges, including Binance, LBank, Deepcoin, Bitrue, and Bitget. Note: Crowdwisdom360 collates Predictions and data from all over the net and has no in-house view on the likely trends in the Stocks or Crypto Coins. Please consult a registered investment advisor to guide you on your financial decisions.",
    "originSummary": [
      "Marlin is an open protocol that allows individuals to share their unused computing resources with app developers for different services, including long-term backend services and efficient block transmission.",
      "The Marlin ecosystem specifically consists of the Marlin Protocol, Network, and Token - it's being identified as a potential good investment due to its capacity to address blockchain challenges, anticipated network growth, and token scarcity.",
      "However, investments in Marlin come with certain risks, such as its early-stage development, limited adoption, and exposure to blockchain market volatility. The Marlin token can be bought via cryptocurrency exchanges and the short-term price predictions are rather bullish."
    ],
    "commentBody": "",
    "commentSummary": [
      "Marlin is a user-friendly open protocol that allows individuals to share their computing resources with application developers. This protocol can support services such as long-term backend services, zk-based prover computations, caching, and efficient block transmission.",
      "The Marlin environment includes the Marlin Protocol, Network, and Token. Its potential to combat blockchain issues, foster network growth, and token scarcity has led to predictions that it could be a good investment.",
      "It's important to consider risks such as early-stage development stages, limited adoption, and the instability of the blockchain market. Marlin tokens can be obtained via cryptocurrency or decentralized exchanges, and their value is projected to increase in the future."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699461086429
  },
  {
    "title": "US Legislator Proposes Reducing SEC Chair Gary Gensler's Salary to $1",
    "originLink": "https://coinculture.com/au/business/kraken-reportedly-exploring-partnerships-to-develop-its-own-layer-2-blockchain-network/",
    "originBody": "US Legislator Proposes Slashing SEC Chair Gary Gensler’s Salary to $1",
    "originSummary": ["A U.S. legislator has suggested reducing the salary of SEC Chair Gary Gensler to only $1."],
    "commentBody": "",
    "commentSummary": [
      "A US legislator has put forward a proposal to significantly reduce the salary of SEC Chair Gary Gensler to a mere $1."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699461086429
  }
]
