[
  {
    "id": 36940871,
    "title": "HN ஐக் கேளுங்கள்: உண்மையான வேலைக்கு யாராவது PyPy ஐப் பயன்படுத்துகிறார்களா?",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36940871",
    "commentBody": "",
    "originSummary": [
      "ஆசிரியர் 2015 முதல் பைபியின் வெளியீட்டு மேலாளராக உள்ளார்.",
      "கோண்டா-ஃபோர்ஜ் மற்றும் நேரடி பதிவிறக்கம் மூலம் பைபி கிடைக்கச் செய்வதற்கான முயற்சிகளை அவர்கள் மேற்கொண்டுள்ளனர்.",
      "அறிவியல் மலைப்பாம்பு தரவு அடுக்கை இயக்க சி-ஏபிஐ எமுலேஷன் அடுக்கை மேம்படுத்துவதில் ஆசிரியர் பணியாற்றியுள்ளார்.",
      "இருப்பினும், அவர்கள் பயனர்களிடமிருந்து வரையறுக்கப்பட்ட கருத்துக்களைப் பெறுகிறார்கள் மற்றும் மேம்பாடுகளை வழிநடத்த பயனர் அனுபவம் இல்லாததால் விரக்தியடைகிறார்கள்.",
      "பைபி உடனான தங்கள் அனுபவம் குறித்த கருத்துக்களை வழங்குமாறு ஆசிரியர் பயனர்களைக் கேட்டுக்கொள்கிறார்."
    ],
    "commentSummary": [
      "விவாத நூல்கள் பல்வேறு திட்டங்களில் செயல்திறன் மேம்பாட்டிற்கான பைத்தானின் மாற்று செயல்படுத்தலாக பைபையின் பயன்பாடு மற்றும் நன்மைகளை மையமாகக் கொண்டுள்ளன.",
      "பயனர்கள் தங்கள் அனுபவங்களை பைபியுடன் பகிர்ந்து கொள்கிறார்கள், இதில் வேகமான செயல்பாட்டு நேரங்கள் மற்றும் நூலக பொருந்தக்கூடிய சிக்கல்கள் ஆகியவை அடங்கும்.",
      "செயல்திறன் தேர்வுமுறைக்கான மாற்று கருவிகள் மற்றும் குறிப்பிட்ட நூலகங்களின் வரம்புகளும் விவாதிக்கப்படுகின்றன.",
      "சில பயனர்கள் லுவாஜித் போன்ற பைத்தான் ஜஸ்ட்-இன்-டைம் கம்பைலரில் ஆர்வத்தை வெளிப்படுத்துகிறார்கள்."
    ],
    "points": 520,
    "commentCount": 156,
    "retryCount": 0,
    "time": 1690800818
  },
  {
    "id": 36944978,
    "title": "கிழக்கு கிரீன்லாந்தில் ஐஸ் கோர் விஞ்ஞானிகள்",
    "originLink": "https://news.ku.dk/all_news/2023/07/pay-dirt-for-ice-core-scientists-in-east-greenland-as-they-reach-bedrock/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36944978",
    "commentBody": "",
    "originSummary": [
      "கோபன்ஹேகன் பல்கலைக்கழகத்தைச் சேர்ந்த ஐஸ் கோர் விஞ்ஞானிகள் வடகிழக்கு கிரீன்லாந்தில் உள்ள ஒரு பனி நீரோடை வழியாக வெற்றிகரமாக தோண்டி, கீழே உள்ள அடித்தளத்தை அடைந்துள்ளனர்.",
      "கடந்த 120,000 ஆண்டுகளில் பூமியின் காலநிலை மாற்றங்கள் குறித்த மதிப்புமிக்க தகவல்களை வழங்கும் ஒரு பனி நீரோட்டத்தின் வழியாக ஒரு ஆழமான பனிக்கட்டி கோர் தோண்டப்படுவது இதுவே முதல் முறையாகும்.",
      "பனிக்கட்டிக்கு அடியில் இருந்து பெறப்பட்ட மண் மாதிரிகள் காலநிலை வடிவங்களைப் புரிந்துகொள்வதற்கும், கடல் மட்டம் உயர்வதைத் திட்டமிடுவதற்கும் பகுப்பாய்வு செய்யப்படும்.",
      "கடந்த 120,000 ஆண்டுகளில் காலநிலை மாற்றங்களை ஆவணப்படுத்த உலகெங்கிலும் உள்ள ஆய்வகங்களில் ஐஸ் கோர் ஆய்வு செய்யப்படும்.",
      "இந்த முன்னேற்றம் பனி நீரோட்ட நடத்தை மற்றும் உயரும் கடல் மட்டங்களில் அதன் தாக்கம் பற்றிய புரிதலை மேம்படுத்துகிறது.",
      "இந்த திட்டத்தில் 12 நாடுகள் பங்கேற்றன மற்றும் டென்மார்க்கிடமிருந்து நிதி உதவியைப் பெற்றன."
    ],
    "commentSummary": [
      "கிழக்கு கிரீன்லாந்தில் உள்ள ஐஸ் கோர் விஞ்ஞானிகள் வெற்றிகரமாக அடித்தளத்தை அடைந்துள்ளனர், இது காலநிலை ஆராய்ச்சிக்கு ஒரு குறிப்பிடத்தக்க சாதனையாகும்.",
      "இந்த மைல்கல் பனி இயக்கம் குறித்த நமது புரிதலுக்கும் காலநிலை மாதிரிகளை மேம்படுத்துவதற்கும் பங்களிக்கும்.",
      "சாதனையைச் சுற்றியுள்ள உரையாடலில் மேக உருவாக்கம் மற்றும் வெப்பநிலையில் அதன் தாக்கம் பற்றிய விவாதங்கள் அடங்கும்.",
      "காலநிலை மாற்றம், பனியுகம், கார்பன் பிடிப்பு, நிலையான ஆற்றல் மற்றும் எரிமலை உமிழ்வு தொடர்பான பல்வேறு தலைப்புகளும் ஆராயப்படுகின்றன.",
      "கிரீன்லாந்தில் உள்ள பனி மையங்களுக்கான துளையிடும் செயல்முறை விவரிக்கப்பட்டுள்ளது, இது அறிவியல் ஆராய்ச்சி நோக்கங்களுக்காக ஆழமான துளை துளையிடலை நடத்துவதன் நன்மைகள் மற்றும் சவால்களை எடுத்துக்காட்டுகிறது.",
      "புவி இயற்பியல் மற்றும் நீரியல் ஆய்வகங்கள், பனியில் டி.என்.ஏவைப் பாதுகாத்தல் மற்றும் பனிப்பாறையில் சிக்கியுள்ள வைரஸ்களால் ஏற்படும் எதிர்கால தொற்றுநோய்களின் சாத்தியமான ஆபத்து ஆகியவை ஆராயப்படும் பிற தலைப்புகளில் அடங்கும்."
    ],
    "points": 505,
    "commentCount": 276,
    "retryCount": 0,
    "time": 1690820548
  },
  {
    "id": 36940626,
    "title": "வாயேஜர் 2 உடனான தொடர்பை நாசா தவறுதலாக துண்டித்தது",
    "originLink": "https://www.theregister.com/2023/07/31/nasa_mistakenly_disconnects_voyager_2/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36940626",
    "commentBody": "",
    "originSummary": [
      "வாயேஜர் 2 விண்கலம் தவறாக வடிவமைக்கப்பட்ட ஆண்டெனா காரணமாக தற்போது நாசாவுடன் தொடர்பு கொள்ள முடியவில்லை.",
      "இந்த ஆண்டெனா தவறான அமைப்பு ஒரு வாரத்திற்கும் மேலாக நடந்து வருகிறது, இது விண்கலம் கட்டளைகளைப் பெறுவதையோ அல்லது தரவை அனுப்புவதையோ தடுக்கிறது.",
      "இந்த நிலைமை தற்காலிகமானது என்றும், வாயேஜர் 2 இன் பாதையையோ அல்லது விண்வெளியில் அதன் பயணத்தையோ பாதிக்காது என்றும் நாசா நம்புகிறது.",
      "வாயேஜர் 2 விண்கலம் தற்போது பூமியில் இருந்து 32 பில்லியன் கிலோ மீட்டர் தொலைவில் உள்ளது.",
      "இருப்பினும், வாயேஜர் 1, பூமியுடன் தொடர்பில் உள்ளது மற்றும் இந்த கோளாறால் பாதிக்கப்படவில்லை.",
      "ஆன்டெனா சீரமைப்பு சிக்கலை சரிசெய்யவும், வாயேஜர் 2 இன் பணி ஆயுளை நீட்டிக்கவும் பொறியாளர்கள் பணியாற்றி வருகின்றனர்.",
      "இது வெற்றி பெற்றால், வாயேஜர் 1-க்கும் இதேபோன்ற மாற்றம் செய்யப்படலாம்."
    ],
    "commentSummary": [
      "வாயேஜர் 2 விண்கலம் தற்போது தகவல் தொடர்பு தடையை சந்தித்து வருகிறது.",
      "வாயேஜர் 2 விண்கலத்தின் பணி முடியும் தருவாயில் உள்ளது.",
      "வாயேஜர் 2 விண்கலம் தொடர்பாக வானியல் வழிசெலுத்தல் பயன்படுத்தப்படுகிறது.",
      "விண்கல பொறியியல் மற்றும் செயல்பாடுகள் குறித்து விவாதிக்கப்படுகிறது.",
      "மென்பொருள் பொறியியல் மற்றும் பிற துறைகளுக்கு இடையிலான வேறுபாடுகள் ஆராயப்படுகின்றன.",
      "விண்வெளி ஆராய்ச்சியில் பொறுப்பு மற்றும் பொறுப்பின் முக்கியத்துவம் வலியுறுத்தப்படுகிறது.",
      "அறிவியல் புனைகதை புத்தகங்கள் மற்றும் விண்வெளி பயணத்தில் அவற்றின் பொருத்தம் குறித்து விவாதிக்கப்படுகிறது.",
      "விண்வெளிப் பயணத்தின் சவால்கள், அதில் உள்ள அபரிமிதமான தொலைவுகள் உள்ளிட்டவை முன்னிலைப்படுத்தப்படுகின்றன.",
      "இந்த மகத்தான தூரங்களை ஒப்பிடுவதற்கும் புரிந்துகொள்வதற்கும் பழக்கமான அளவீட்டு அலகுகள் பயன்படுத்தப்படுகின்றன."
    ],
    "points": 450,
    "commentCount": 413,
    "retryCount": 0,
    "time": 1690798550
  },
  {
    "id": 36943866,
    "title": "மஸ்டோடன் பற்றிய பிபிசி",
    "originLink": "https://www.bbc.co.uk/rd/blog/2023-07-mastodon-distributed-decentralised-fediverse-activitypub",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36943866",
    "commentBody": "",
    "originSummary": [
      "பிபிசி ஆராய்ச்சி மற்றும் மேம்பாடு மாஸ்டோடன் சமூக ஊடக தளத்தை சோதித்து வருகிறது.",
      "மாஸ்டோடன் ஒரு விநியோகிக்கப்பட்ட மற்றும் பரவலாக்கப்பட்ட தளமாகும்.",
      "பிபிசி தங்கள் சொந்த மாஸ்டோடன் சேவையகத்தை அமைத்துள்ளது, அங்கு பயனர்கள் பிபிசி சமூக ஊடக கணக்குகளைப் பின்தொடரலாம்.",
      "மாஸ்டோடனின் கூட்டாட்சி மாதிரி ஒரு பொது சேவை இணையத்தை ஆதரிக்கும் பிபிசியின் குறிக்கோளுடன் ஒத்துப்போகிறது.",
      "சோதனை அதன் மதிப்பை மதிப்பிடுவதற்கும் தொடர வேண்டுமா என்பதை தீர்மானிக்கவும் 6 மாதங்கள் நீடிக்கும்.",
      "உள்ளடக்கத்தை வெளியிடுவதற்கான பிற ஆக்டிவிடிபப் பயன்பாடுகளையும் பிபிசி ஆராய்ந்து வருகிறது."
    ],
    "commentSummary": [
      "மஸ்டோடன் இயங்குதளத்தில் உள்ள பயனர்கள் தங்கள் மையப்படுத்தப்பட்ட பயன்பாட்டான பிபிசி சவுண்ட்ஸை விளம்பரப்படுத்த தங்கள் போட்காஸ்ட் ஊட்டங்களில் தாமதத்தை சேர்க்கும் பிபிசியின் முடிவால் விரக்தியடைந்துள்ளனர்.",
      "பிபிசியின் டிஜிட்டல் முன்முயற்சிகள் குறித்து வருவாய் அதிகரிப்பு மற்றும் தனியார்மயமாக்கல் குறித்த கவலைகள் எழுப்பப்படுகின்றன.",
      "பயனர்கள் பிபிசி உள்ளடக்கத்தின் கிடைக்கும் தன்மை மற்றும் பயன்பாடு மற்றும் போட்காஸ்ட்களில் விளம்பர செருகுதல்கள் பற்றி விவாதிக்கின்றனர்.",
      "பிபிசி நிர்வாகத்தின் மீதான விமர்சனங்கள் உரையாடலில் முன்வைக்கப்படுகின்றன.",
      "மாஸ்டோடனில் ஆக்டிவிடிபப் நெறிமுறையை செயல்படுத்துவதற்கான சவால்கள் மற்றும் பரிசீலனைகள் விவாதிக்கப்படுகின்றன.",
      "தொழில்நுட்பம் அல்லாத பயனர்களுக்கு மாஸ்டோடனின் வரம்புகள் முன்னிலைப்படுத்தப்படுகின்றன.",
      "புதிய ஊடகங்களைப் பரிசோதித்த பிபிசியின் வரலாறும், மாஸ்டோடனுக்கு அவர்கள் சமீபத்தில் நகர்ந்த வரலாறும் குறிப்பிடப்பட்டுள்ளன.",
      "இந்த உரையாடலில் மாஸ்டோடனை ஏற்றுக்கொள்வது, அமைப்புகளின் பங்கு மற்றும் பரவலாக்கத்தின் சிக்கல்கள் ஆகியவை அடங்கும்.",
      "சமூக ஊடகங்கள் மற்றும் இணைய மன்றங்களுக்கு இடையிலான வேறுபாடு குறித்த விவாதம் விவாதிக்கப்படுகிறது.",
      "ஆட்சேபகரமான உள்ளடக்கத்தை எதிர்த்துப் போராட கூட்டாட்சி வடிகட்டலுக்கான சாத்தியக்கூறுகள் ஆராயப்படுகின்றன."
    ],
    "points": 417,
    "commentCount": 164,
    "retryCount": 0,
    "time": 1690816506
  },
  {
    "id": 36951140,
    "title": "LK99 இனப்பெருக்க முயற்சியில் அரைகுறை போக்குவரத்து",
    "originLink": "https://arxiv.org/abs/2307.16802",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36951140",
    "commentBody": "",
    "originSummary": [
      "இந்த கட்டுரை மாற்றியமைக்கப்பட்ட ஈயம்-அபாடைட் சேர்மத்தில் அறை-வெப்பநிலை அதிகடத்துத்திறன் கண்டுபிடிப்பு பற்றிய சமீபத்திய கூற்றை விவாதிக்கிறது.",
      "இச்சேர்மத்தின் மின் மற்றும் காந்தப் பண்புகள் குறித்து ஆசிரியர்கள் விரிவான பகுப்பாய்வுகளை மேற்கொண்டனர்.",
      "இதன் விளைவாக ஏற்பட்ட கலவை செமிகண்டக்டர் போன்ற போக்குவரத்து நடத்தையைக் காட்டியது, இது கூற்றின் மீது சந்தேகத்தை ஏற்படுத்தியது.",
      "அறை-வெப்பநிலை அதிகடத்துத்திறன் கூற்றை சரிபார்க்க கூடுதல் ஆய்வு தேவை."
    ],
    "commentSummary": [
      "ரெட்டிட் விவாதங்கள் அறிவியல் சோதனைகளை நகலெடுப்பதில் உள்ள சவால்களில் கவனம் செலுத்துகின்றன, குறிப்பாக பொருள் அறிவியலில்.",
      "மாறுபட்ட நிலைமைகளைக் கொண்ட வெவ்வேறு ஆய்வகங்களில் நகலெடுப்புக்கு மாற்றங்கள் மற்றும் தழுவல்கள் தேவைப்படுகின்றன.",
      "முன்னதாக ஆராய்ச்சி முடிவுகளை வெளியிடுவதன் நன்மைகள் மற்றும் குறைபாடுகள் விவாதிக்கப்படுகின்றன.",
      "ஆரம்பகால வெளியீடுகளின் செல்லுபடியாகும் தன்மை மற்றும் தாக்கம் கேள்விக்குள்ளாக்கப்படுகிறது, குறிப்பாக அறை வெப்பநிலை சூப்பர் கண்டக்டர் பற்றிய கூற்று தொடர்பாக.",
      "விஞ்ஞானிகள் சந்தேகத்தை வெளிப்படுத்துகிறார்கள் மற்றும் கூற்றை சரிபார்க்க நகலெடுக்க அழைப்பு விடுக்கின்றனர்.",
      "அறிவியல் கண்டுபிடிப்புகளை வெளியிடுவதற்கும் சரிபார்ப்பதற்கும் பொருத்தமான செயல்முறையைச் சுற்றி விவாதங்கள் சுழல்கின்றன.",
      "ஒருங்கிணைக்கப்பட்ட பொருளின் எக்ஸ்-கதிர் விளிம்பு வடிவத்தை நகலெடுக்கும் முயற்சிகள் அசல் பொருந்தாது.",
      "படிகங்களை ஒருங்கிணைப்பதில் உள்ள சிரமம் மற்றும் மோசடி அல்லது திறமையின்மைக்கான சாத்தியக்கூறுகள் குறித்து கவலைகள் எழுகின்றன.",
      "உயர் வெப்பநிலை சூப்பர் கண்டக்டர்களுக்கான பொருட்களை ஒருங்கிணைப்பதில் உள்ள சவால்கள் விவாதிக்கப்படுகின்றன.",
      "ஐயம் என்பது அதிகடத்துத்திறனில் ஒரு சாத்தியமான முன்னேற்றத்தைச் சூழ்ந்துள்ளது."
    ],
    "points": 377,
    "commentCount": 154,
    "retryCount": 0,
    "time": 1690852721
  },
  {
    "id": 36946104,
    "title": "மரிஜுவானா போதை: போராடுபவர்கள் பெரும்பாலும் சந்தேகத்தை எதிர்கொள்கின்றனர்",
    "originLink": "https://www.washingtonpost.com/health/2023/07/31/marijuana-addiction-legal-recreational-sales/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36946104",
    "commentBody": "",
    "originSummary": [
      "மரிஜுவானாவின் வளர்ந்து வரும் ஏற்றுக்கொள்ளல் இருந்தபோதிலும், போதைப்பொருளுக்கு அடிமையாதல் உள்ளது மற்றும் பெரும்பாலும் சந்தேகத்தை எதிர்கொள்கிறது.",
      "மரிஜுவானா எதிர்மறையான விளைவுகள் இல்லாமல் பயன்படுத்தப்படலாம் என்று சிலர் வாதிட்டாலும், இது ஆல்கஹால் அல்லது பரிந்துரைக்கப்பட்ட மருந்துகள் போன்ற போதைக்குரியது என்று அங்கீகரிக்கப்பட்டுள்ளது.",
      "மதிப்பீடுகள் வேறுபடுகின்றன, ஆனால் கஞ்சா பயன்பாட்டுக் கோளாறுடன் போராடும் நபர்கள் உள்ளனர், அவர்களுக்கு உதவி தேவைப்படுகிறது.",
      "அதிகரித்த மரிஜுவானா பயன்பாடு மற்றும் ஆற்றலின் தாக்கம் குறித்து கவலைகள் எழுகின்றன, குறிப்பாக பதின்ம வயதினரின் வளரும் மூளையில்.",
      "போதைப்பொருள் துஷ்பிரயோகம் மற்றும் மனநல சேவைகள் நிர்வாகம் 2021 ஆம் ஆண்டில் அமெரிக்காவில் மில்லியன் கணக்கான நபர்களுக்கு கஞ்சா பயன்பாட்டுக் கோளாறு இருப்பதாகக் கூறுகிறது.",
      "மருத்துவ மரிஜுவானா பயனர்கள் தவறாக கண்டறியப்படலாம், இது மேம்பட்ட கண்டறியும் அளவுகோல்களின் அவசியத்தை எடுத்துக்காட்டுகிறது.",
      "தற்போது, நடத்தை சிகிச்சை மரிஜுவானா போதைக்கு முதன்மை சிகிச்சையாகும், ஏனெனில் எந்த மருந்தும் கிடைக்கவில்லை.",
      "மரிஜுவானா பயன்பாட்டை விட்டுவிடுவது திரும்பப் பெறுவதற்கான அறிகுறிகளை ஏற்படுத்தும்.",
      "கட்டுரை மரிஜுவானா பயன்பாட்டின் அதிகரித்து வரும் ஏற்பையும் குறிப்பிடுகிறது மற்றும் தலைப்பில் கூடுதல் ஆதாரங்களை வழங்குகிறது."
    ],
    "commentSummary": [
      "போதைப்பொருள், அளவு, டி.எச்.சி ஆற்றல், சட்டப்பூர்வமாக்குதல் மற்றும் பதட்டத்தில் அதன் விளைவுகள் உள்ளிட்ட கஞ்சா தொடர்பான பல்வேறு தலைப்புகளை விவாத நூல் உள்ளடக்கியது.",
      "பங்கேற்பாளர்கள் கஞ்சா பயன்பாடு குறித்த தங்கள் தனிப்பட்ட அனுபவங்கள், பரிந்துரைகள் மற்றும் கருத்துக்களைப் பகிர்ந்து கொள்கிறார்கள்.",
      "கஞ்சா பயன்பாடு குறித்த சமூக பார்வையும் விவாதிக்கப்படுகிறது.",
      "கிராஃப்ட் பீர் தொழில் குறிப்பிடப்பட்டு கஞ்சா தொழிலுடன் ஒப்பிடப்படுகிறது."
    ],
    "points": 354,
    "commentCount": 660,
    "retryCount": 0,
    "time": 1690825015
  },
  {
    "id": 36942266,
    "title": "இப்போது நான் வைத்திருக்கும் குளிர்சாதன பெட்டியை விட 70 ஆண்டுகளுக்கு முந்தைய குளிர்சாதன பெட்டி சிறந்த அம்சங்களைக் கொண்டுள்ளது",
    "originLink": "https://mstdn.social/@Pandamoanimum/110808340828034444",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36942266",
    "commentBody": "",
    "originSummary": [
      "மாஸ்டோடன் தளத்தின் எடுத்துக்காட்டு, எம்.எஸ்.டி.என்.சோஷியல், பல்வேறு விவாதங்களில் ஈடுபட்டுள்ள 38,000 செயலில் உள்ள பயனர்களைக் கொண்டுள்ளது.",
      "தலைப்புகளில் முதலாளித்துவம், நவீன உபகரணங்களின் ஆயுட்காலம், குளிர்சாதன பெட்டி வடிவமைப்பு மற்றும் பழங்கால உபகரணங்களுக்கான நாஸ்டால்ஜியா ஆகியவை அடங்கும்.",
      "குறைந்த தரமான பொருட்களின் உற்பத்தியில் முதலாளித்துவத்தின் விளைவுகள் மற்றும் நவீன உபகரணங்களுக்கான அணுகலை வழங்குவதில் அதன் பங்கு குறித்து பயனர்கள் விவாதிக்கின்றனர்.",
      "விவாதங்கள் விண்டேஜ் மற்றும் நவீன குளிர்சாதன பெட்டிகளுக்கான விருப்பங்களைச் சுற்றி வருகின்றன.",
      "நிலைத்தன்மை மற்றும் சுற்றுச்சூழல் தாக்கம் ஆகியவை விவாதத்தின் கூடுதல் புள்ளிகள்.",
      "பங்கேற்பாளர்கள் முதலாளித்துவம், நுகர்வுவாதம், ஆயுட்காலம் மற்றும் வடிவமைப்பு விருப்பத்தேர்வுகள் குறித்து மாறுபட்ட கண்ணோட்டங்களைக் கொண்டுள்ளனர்."
    ],
    "commentSummary": [
      "குளிர்சாதனப் பெட்டிகள், டோஸ்டர்கள், அடுப்புகள் மற்றும் மைக்ரோவேவ்கள் போன்ற வீட்டு உபகரணங்கள் தொடர்பான பல்வேறு தலைப்புகளை விவாதங்கள் உள்ளடக்குகின்றன.",
      "பங்கேற்பாளர்கள் பழைய மற்றும் நவீன உபகரணங்களின் அம்சங்கள், ஆயுட்காலம், நம்பகத்தன்மை, செயல்திறன் மற்றும் செலவு குறித்து தங்கள் கருத்துக்களைப் பகிர்ந்து கொள்கிறார்கள்.",
      "நுகர்வோர் கலாச்சாரம், சுற்றுச்சூழல் தாக்கம் மற்றும் உபகரணங்கள் பற்றிய நம்பகமான தகவல்களைக் கண்டுபிடிப்பதில் உள்ள சிரமம் ஆகியவையும் விவாதிக்கப்படுகின்றன.",
      "வீட்டு உபயோகப் பொருட்களின் தரம் மற்றும் ஆயுட்காலம் குறித்து பரந்த அளவிலான கண்ணோட்டங்கள் மற்றும் விவாதங்கள் உள்ளன."
    ],
    "points": 335,
    "commentCount": 493,
    "retryCount": 0,
    "time": 1690810651
  },
  {
    "id": 36951815,
    "title": "LK99 இல் தொடர்புடைய தனிமைப்படுத்தப்பட்ட தட்டையான பட்டைகளின் தோற்றம்",
    "originLink": "https://arxiv.org/abs/2307.16892",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36951815",
    "commentBody": "",
    "originSummary": [
      "தாமிர மாற்று ஈய பாஸ்பேட் அபேடைட்டில் அறை வெப்பநிலை அதிகடத்துத்திறன் கண்டறியப்பட்டுள்ளது.",
      "ஃபெர்மி மட்டத்தில் தொடர்புடைய தனிமைப்படுத்தப்பட்ட தட்டையான பட்டைகளை அடையாளம் காண இந்த ஆய்வு அடர்த்தி செயல்பாட்டு கோட்பாடு கணக்கீடுகளைப் பயன்படுத்துகிறது.",
      "இந்த தட்டையான பட்டைகள் தாமிர அயனிகளால் தூண்டப்பட்ட கட்டமைப்பு சிதைவு மற்றும் ஈய ஒற்றை ஜோடிகளிலிருந்து சிரல் சார்ஜ் அடர்த்தி அலை ஆகியவற்றால் ஏற்படுகின்றன.",
      "ஒரு குறைந்தபட்ச இரு-பட்டை மாதிரி இந்த அமைப்பில் குறைந்த ஆற்றல் இயற்பியலின் குறிப்பிடத்தக்க பகுதியை விளக்க முடியும்.",
      "தாமிர-ஊக்கமருந்து அபாடைட்டில் சாத்தியமான அதிகடத்துத்திறன் குறித்த கண்டுபிடிப்புகளின் தாக்கங்கள் விவாதிக்கப்படுகின்றன."
    ],
    "commentSummary": [
      "எல்.கே-99 என்பது அதன் தொகுப்பு மற்றும் பண்புகளுக்காக விவாதிக்கப்படும் ஒரு சூப்பர் கண்டக்டிங் பொருள் ஆகும்.",
      "பதிலீடுகள், இசைக்குழு கட்டமைப்புகள் மற்றும் தொகுப்பு சவால்கள் விவாதங்களில் முக்கிய காரணிகளாகும்.",
      "உருவகப்படுத்துதல், இயந்திர கற்றல் மற்றும் செயற்கை நுண்ணறிவு ஆகியவை பொருள் கண்டுபிடிப்புக்கான சாத்தியமான கருவிகள்.",
      "ஆற்றல் விநியோகம் மற்றும் குவாண்டம் கம்ப்யூட்டிங்கில் சூப்பர் கண்டக்டிங் பொருட்கள் சாத்தியமான பயன்பாடுகளைக் கொண்டுள்ளன.",
      "சூப்பர் கன்டக்டிங் பொருட்களின் நடைமுறை மற்றும் வரம்புகள் கவலைக்குரிய ஒரு தலைப்பு.",
      "அறிவியல் சமூகத்தில் மேம்பட்ட தகவல்தொடர்பு தேவை.",
      "அறிவியல் கண்டுபிடிப்புகளை மிகைப்படுத்த வாய்ப்பு உள்ளது."
    ],
    "points": 306,
    "commentCount": 148,
    "retryCount": 0,
    "time": 1690858956
  },
  {
    "id": 36950075,
    "title": "குடிமையியல் பற்றிய பொது அறிவை மேம்படுத்த காங்கிரஸ் நூலகத்திற்கு விளையாட்டுகளை உருவாக்க உதவுங்கள்",
    "originLink": "https://blogs.loc.gov/law/2023/06/help-the-library-of-congress-create-video-games-that-improve-public-knowledge-of-civics/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36950075",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [],
    "points": 288,
    "commentCount": 119,
    "retryCount": 0,
    "time": 1690844665
  },
  {
    "id": 36944152,
    "title": "HN ஐக் காட்டுங்கள்: Markwhen: Markdown for Timelines",
    "originLink": "https://app.markwhen.com",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36944152",
    "commentBody": "",
    "originSummary": [
      "அந்த நபர் மார்க்வென் என்ற கருவியை உருவாக்கியுள்ளார்.",
      "மார்க்ஹென் வெற்று உரையை காலவரிசைகள் மற்றும் நாட்காட்டிகளாக மாற்ற வடிவமைக்கப்பட்டுள்ளது.",
      "இந்த நோக்கத்திற்காக ஒரு பயனர் நட்பு கருவியை வழங்குவதே மார்க்வின் குறிக்கோள்.",
      "மார்க்வின் படைப்பாளி பயனர்களை கேள்விகளைக் கேட்க அல்லது கருத்துக்களை வழங்க ஊக்குவிக்கிறார்."
    ],
    "commentSummary": [
      "Markwhen.com என்பது எளிய உரை மற்றும் மார்க்டவுனைப் பயன்படுத்தி காலவரிசைகள் மற்றும் காலெண்டர்களை உருவாக்க பயனர்களை அனுமதிக்கும் ஒரு வலைத்தளமாகும்.",
      "ஐபாட் சாதனங்களில் உள்ள சிக்கல்கள் உட்பட பயனர் இடைமுகம் குறித்த கருத்துக்களை பயனர்கள் வழங்கியுள்ளனர்.",
      "ஒப்சிடியன் மற்றும் விஷுவல் ஸ்டுடியோ கோட் போன்ற பிற கருவிகளுடன் மார்க்வெனை ஒருங்கிணைப்பதற்கான சாத்தியம் உள்ளது.",
      "வெவ்வேறு விலை கட்டமைப்புகளுடன் மார்க்வெனின் ஆஃப்லைன் மற்றும் ஆன்லைன் பதிப்புகளை வெளியிட படைப்பாளி திட்டமிட்டுள்ளார்.",
      "பயனர்கள் மார்க்வெனை மற்ற கருவிகளுடன் ஒப்பிட்டு, அப்சிடியன் செருகுநிரல் போன்ற மேம்பாடுகளை பரிந்துரைத்துள்ளனர்.",
      "இந்த திட்டம் நேர்மறையான கருத்துக்களைப் பெற்றுள்ளது மற்றும் பயனர்களிடமிருந்து ஆர்வத்தை உருவாக்கியுள்ளது.",
      "சில பயனர்கள் மார்க்ஹென் எனப்படும் தயாரிப்பு வரைபட கருவியின் செயல்பாடு மற்றும் பயன்பாட்டைப் பற்றி விவாதிக்கிறார்கள், மேம்பாடுகளை பரிந்துரைக்கிறார்கள் மற்றும் அதன் பயனுக்கு பாராட்டுகளைத் தெரிவிக்கின்றனர்."
    ],
    "points": 272,
    "commentCount": 51,
    "retryCount": 0,
    "time": 1690817486
  }
]
