[
  {
    "id": 36940871,
    "title": "Spýtajte sa HN: Používa niekto PyPy na reálnu prácu?",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36940871",
    "commentBody": "",
    "originSummary": [
      "Autor je správcom vydania PyPy od roku 2015.",
      "Vynaložili úsilie na sprístupnenie PyPy prostredníctvom conda-forge a priameho stiahnutia.",
      "Autor pracoval na vylepšení emulačnej vrstvy C-API na spúšťanie vedeckého dátového zásobníka Python.",
      "Od používateľov však dostávajú len obmedzenú spätnú väzbu a sú frustrovaní z nedostatku používateľských skúseností, ktoré by im pomohli pri zlepšovaní.",
      "Autor žiada používateľov, aby poskytli spätnú väzbu o svojich skúsenostiach s PyPy."
    ],
    "commentSummary": [
      "Diskusné vlákna sa sústreďujú na použitie a výhody PyPy ako alternatívnej implementácie jazyka Python na zlepšenie výkonu v rôznych projektoch.",
      "Používatelia sa podelia o svoje skúsenosti s PyPy vrátane rýchlejších časov vykonávania a problémov s kompatibilitou knižníc.",
      "Diskutuje sa aj o alternatívnych nástrojoch na optimalizáciu výkonu a obmedzeniach konkrétnych knižníc.",
      "Niektorí používatelia prejavujú záujem o kompilátor Python Just-in-Time, ako je LuaJIT."
    ],
    "points": 520,
    "commentCount": 156,
    "retryCount": 0,
    "time": 1690800818
  },
  {
    "id": 36944978,
    "title": "Vedci z ľadového jadra vo východnom Grónsku sa dostali k horninovému podložiu",
    "originLink": "https://news.ku.dk/all_news/2023/07/pay-dirt-for-ice-core-scientists-in-east-greenland-as-they-reach-bedrock/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36944978",
    "commentBody": "",
    "originSummary": [
      "Vedci z Kodanskej univerzity úspešne prevŕtali ľadový prúd v severovýchodnom Grónsku a dostali sa až k horninovému podložiu.",
      "Je to po prvýkrát, čo bolo vyvŕtané hlboké ľadové jadro cez ľadový prúd, ktoré poskytuje cenné informácie o klimatických zmenách na Zemi za posledných 120 000 rokov.",
      "Vzorky bahna získané spod ľadu sa budú analyzovať s cieľom pochopiť klimatické zákonitosti a predpovedať stúpanie hladiny morí.",
      "Ľadové jadro sa bude skúmať v laboratóriách po celom svete s cieľom zdokumentovať klimatické zmeny za posledných 120 000 rokov.",
      "Tento prelomový objav zlepšuje pochopenie správania ľadových prúdov a ich vplyvu na zvyšovanie hladiny morí.",
      "Do projektu sa zapojilo 12 zúčastnených krajín a finančne ho podporilo Dánsko."
    ],
    "commentSummary": [
      "Vedci z ľadového jadra vo východnom Grónsku úspešne dosiahli skalné podložie, čo je významný úspech pre výskum klímy.",
      "Tento míľnik prispeje k pochopeniu pohybu ľadu a k zlepšeniu klimatických modelov.",
      "Konverzácia o tomto úspechu zahŕňa diskusie o tvorbe oblakov a ich vplyve na teplotu.",
      "Skúmajú sa aj rôzne témy súvisiace so zmenou klímy, dobou ľadovou, zachytávaním uhlíka, udržateľnou energiou a sopečnými emisiami.",
      "Opisuje sa proces vŕtania ľadových jadier v Grónsku, pričom sa zdôrazňujú výhody a problémy pri vŕtaní hlbokých vrtov na účely vedeckého výskumu.",
      "Medzi ďalšie skúmané témy patria geofyzikálne a hydrologické observatóriá, uchovávanie DNA v ľade a potenciálne riziko budúcich pandémií spôsobených vírusmi zachytenými v ľadovcovom ľade."
    ],
    "points": 505,
    "commentCount": 276,
    "retryCount": 0,
    "time": 1690820548
  },
  {
    "id": 36940626,
    "title": "NASA omylom prerušila komunikáciu s Voyagerom 2",
    "originLink": "https://www.theregister.com/2023/07/31/nasa_mistakenly_disconnects_voyager_2/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36940626",
    "commentBody": "",
    "originSummary": [
      "Sonda Voyager 2 momentálne nemôže komunikovať s NASA kvôli nesprávne nastavenej anténe.",
      "Toto nesprávne nastavenie antény trvá už viac ako týždeň a znemožňuje sonde prijímať príkazy alebo vysielať údaje.",
      "NASA sa domnieva, že táto situácia je dočasná a nebude mať vplyv na trajektóriu sondy Voyager 2 ani na jej misiu vo vesmíre.",
      "Voyager 2 je v súčasnosti od Zeme vzdialený približne 32 miliárd kilometrov a vzďaľuje sa rýchlosťou 15 km za sekundu.",
      "Sonda Voyager 1 však zostáva v kontakte so Zemou a táto porucha sa jej netýka.",
      "Inžinieri pracujú na odstránení problému s nastavením antény a predĺžení životnosti sondy Voyager 2.",
      "Ak sa to podarí, podobná úprava sa môže vykonať aj na sonde Voyager 1."
    ],
    "commentSummary": [
      "Sonda Voyager 2 má v súčasnosti prerušenú komunikáciu.",
      "Misia sondy Voyager 2 sa blíži ku koncu.",
      "Astronomická navigácia sa používa v súvislosti so sondou Voyager 2.",
      "Diskutuje sa o technike a prevádzke kozmickej lode.",
      "Skúmajú sa rozdiely medzi softvérovým inžinierstvom a inými disciplínami.",
      "Zdôrazňuje sa dôležitosť zodpovednosti pri výskume vesmíru.",
      "Diskutuje sa o vedecko-fantastických knihách a ich význame pre cestovanie do vesmíru.",
      "Zdôrazňujú sa výzvy spojené s cestovaním do vesmíru vrátane obrovských vzdialeností.",
      "Na porovnanie a pochopenie týchto obrovských vzdialeností sa používajú známe merné jednotky."
    ],
    "points": 450,
    "commentCount": 413,
    "retryCount": 0,
    "time": 1690798550
  },
  {
    "id": 36943866,
    "title": "BBC o skupine Mastodon",
    "originLink": "https://www.bbc.co.uk/rd/blog/2023-07-mastodon-distributed-decentralised-fediverse-activitypub",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36943866",
    "commentBody": "",
    "originSummary": [
      "BBC Research & Development testuje platformu Mastodon pre sociálne médiá.",
      "Mastodon je distribuovaná a decentralizovaná platforma.",
      "BBC zriadila vlastný server Mastodon, na ktorom môžu používatelia sledovať účty BBC na sociálnych sieťach.",
      "Federatívny model Mastodonu je v súlade s cieľom BBC podporovať verejnú službu internetu.",
      "Experiment bude prebiehať 6 mesiacov, aby sa vyhodnotila jeho hodnota a rozhodlo sa o jeho pokračovaní.",
      "BBC skúma aj ďalšie aplikácie ActivityPub na publikovanie obsahu."
    ],
    "commentSummary": [
      "Používatelia platformy Mastodon sú frustrovaní rozhodnutím BBC pridať oneskorenie do ich podcastových kanálov, aby propagovali svoju centralizovanú aplikáciu BBC Sounds.",
      "V súvislosti s digitálnymi iniciatívami BBC sa vyjadrujú obavy z maximalizácie príjmov a privatizácie.",
      "Používatelia diskutujú o dostupnosti a použiteľnosti obsahu BBC, ako aj o vkladaní reklamy do podcastov.",
      "V rozhovore zaznieva kritika vedenia BBC.",
      "Diskutuje sa o výzvach a úvahách týkajúcich sa implementácie protokolu ActivityPub v systéme Mastodon.",
      "Zdôrazňujú sa obmedzenia Mastodonu pre netechnických používateľov.",
      "Spomína sa história experimentovania BBC s novými médiami, ako aj nedávny prechod na Mastodon.",
      "Rozhovor sa týka aj prijatia systému Mastodon, úlohy organizácií a zložitosti decentralizácie.",
      "Diskutuje sa o rozdiele medzi sociálnymi médiami a internetovými fórami.",
      "Skúma sa potenciál federatívneho filtrovania na boj proti nevhodnému obsahu."
    ],
    "points": 417,
    "commentCount": 164,
    "retryCount": 0,
    "time": 1690816506
  },
  {
    "id": 36951140,
    "title": "Polovodičový transport pri pokuse o reprodukciu LK99",
    "originLink": "https://arxiv.org/abs/2307.16802",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36951140",
    "commentBody": "",
    "originSummary": [
      "Tento článok sa zaoberá nedávnym tvrdením o objavení supravodivosti pri izbovej teplote v modifikovanej zlúčenine olova a apatitu.",
      "Autori vykonali podrobné analýzy elektrických a magnetických vlastností zlúčeniny.",
      "Výsledná zlúčenina vykazovala transportné správanie podobné polovodičom, čo spochybnilo toto tvrdenie.",
      "Na potvrdenie tvrdenia o supravodivosti pri izbovej teplote je potrebné ďalšie skúmanie."
    ],
    "commentSummary": [
      "Diskusie na Reddite sa zameriavajú na problémy spojené s replikovaním vedeckých experimentov, konkrétne v oblasti materiálových vied.",
      "Replikácia v rôznych laboratóriách s rôznymi podmienkami si vyžaduje úpravy a prispôsobenia.",
      "Diskutuje sa o výhodách a nevýhodách skoršieho zverejňovania výsledkov výskumu.",
      "Platnosť a vplyv prvých publikácií sú spochybnené, najmä v súvislosti s tvrdením o supravodiči s izbovou teplotou.",
      "Vedci vyjadrujú skepsu a žiadajú replikáciu, aby sa toto tvrdenie potvrdilo.",
      "Diskusie sa vedú o vhodnom postupe pri publikovaní a overovaní vedeckých objavov.",
      "Prebiehajúce snahy o replikáciu röntgenového difrakčného vzoru syntetizovaného materiálu, ktorý sa nezhoduje s originálom.",
      "Vznikajú obavy týkajúce sa náročnosti syntézy kryštálov a možnosti podvodu alebo nekompetentnosti.",
      "Diskutuje sa o výzvach pri syntéze materiálov pre vysokoteplotné supravodiče.",
      "Potenciálny prielom v supravodivosti sprevádza skepsa."
    ],
    "points": 377,
    "commentCount": 154,
    "retryCount": 0,
    "time": 1690852721
  },
  {
    "id": 36946104,
    "title": "Závislosť od marihuany: tí, ktorí s ňou bojujú, často čelia skepticizmu",
    "originLink": "https://www.washingtonpost.com/health/2023/07/31/marijuana-addiction-legal-recreational-sales/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36946104",
    "commentBody": "",
    "originSummary": [
      "Napriek rastúcej akceptácii marihuany existuje závislosť od tejto drogy a často sa stretáva so skepticizmom.",
      "Hoci niektorí tvrdia, že marihuanu možno užívať bez negatívnych následkov, je známe, že je návyková podobne ako alkohol alebo lieky na predpis.",
      "Odhady sa líšia, ale existujú osoby, ktoré bojujú s poruchou užívania kanabisu a potrebujú pomoc.",
      "Objavujú sa obavy z vplyvu zvýšeného užívania marihuany a jej silnej intenzity, najmä na vyvíjajúci sa mozog dospievajúcich.",
      "Úrad pre zneužívanie psychoaktívnych látok a služby duševného zdravia uvádza, že v roku 2021 mali v USA poruchu spôsobenú užívaním konope milióny osôb.",
      "Užívatelia lekárskej marihuany môžu byť nesprávne diagnostikovaní, čo poukazuje na potrebu zlepšenia diagnostických kritérií.",
      "V súčasnosti je hlavnou liečbou závislosti od marihuany behaviorálna terapia, pretože nie sú k dispozícii žiadne lieky.",
      "Ukončenie užívania marihuany môže mať za následok abstinenčné príznaky.",
      "V článku sa tiež spomína rastúca akceptácia užívania marihuany a uvádzajú sa ďalšie zdroje na túto tému."
    ],
    "commentSummary": [
      "Diskusné vlákno sa zaoberá rôznymi témami súvisiacimi s konopou vrátane závislosti, dávkovania, sily THC, legalizácie a jej účinkov na úzkosť.",
      "Účastníci sa podelia o svoje osobné skúsenosti, odporúčania a názory na užívanie konope.",
      "Diskutuje sa aj o spoločenskom vnímaní užívania kanabisu.",
      "Spomína sa priemysel remeselného piva a porovnáva sa s konopným priemyslom."
    ],
    "points": 354,
    "commentCount": 660,
    "retryCount": 0,
    "time": 1690825015
  },
  {
    "id": 36942266,
    "title": "Chladnička spred 70 rokov má lepšie vlastnosti ako chladnička, ktorú mám teraz",
    "originLink": "https://mstdn.social/@Pandamoanimum/110808340828034444",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36942266",
    "commentBody": "",
    "originSummary": [
      "Inštancia platformy Mastodon, mstdn.social, sa môže pochváliť 38 000 aktívnymi používateľmi zapojenými do rôznych diskusií.",
      "Témy zahŕňajú kapitalizmus, odolnosť moderných spotrebičov, dizajn chladničiek a nostalgiu za historickými spotrebičmi.",
      "Používatelia diskutujú o vplyve kapitalizmu na výrobu nekvalitného tovaru a o jeho úlohe pri zabezpečovaní prístupu k moderným spotrebičom.",
      "Diskusie sa vedú aj o preferenciách historických a moderných chladničiek.",
      "Udržateľnosť a vplyv na životné prostredie sú ďalšími bodmi diskusie.",
      "Účastníci majú rôzne názory na kapitalizmus, konzumný spôsob života, trvanlivosť a dizajnové preferencie."
    ],
    "commentSummary": [
      "Diskusie sa týkajú rôznych tém súvisiacich s domácimi spotrebičmi, ako sú chladničky, hriankovače, rúry a mikrovlnné rúry.",
      "Účastníci sa podelia o svoje názory na vlastnosti, životnosť, spoľahlivosť, účinnosť a cenu starších aj moderných spotrebičov.",
      "Diskutuje sa aj o spotrebiteľskej kultúre, vplyve na životné prostredie a ťažkostiach pri hľadaní spoľahlivých informácií o spotrebičoch.",
      "Existuje široká škála názorov a diskusií týkajúcich sa kvality a životnosti domácich spotrebičov."
    ],
    "points": 335,
    "commentCount": 493,
    "retryCount": 0,
    "time": 1690810651
  },
  {
    "id": 36951815,
    "title": "Pôvod korelovaných izolovaných plochých pásov v LK99",
    "originLink": "https://arxiv.org/abs/2307.16892",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36951815",
    "commentBody": "",
    "originSummary": [
      "Supravodivosť pri izbovej teplote bola objavená v meďou substituovanom fosfáte olova.",
      "Štúdia využíva výpočty teórie funkčnej hustoty na identifikáciu korelovaných izolovaných plochých pásov na Fermiho úrovni.",
      "Tieto ploché pásy sa pripisujú štrukturálnej deformácii vyvolanej iónmi medi a chirálnej vlne hustoty náboja z osamelých párov olova.",
      "Minimálny dvojpásmový model môže vysvetliť významnú časť fyziky nízkych energií v tomto systéme.",
      "Diskutuje sa o dôsledkoch týchto zistení na potenciálnu supravodivosť v apatite dopovanom meďou."
    ],
    "commentSummary": [
      "LK-99 je supravodivý materiál, o ktorom sa diskutuje pre jeho syntézu a vlastnosti.",
      "Substitúcie, pásové štruktúry a problémy syntézy sú dôležitými faktormi v diskusiách.",
      "Simulácia, strojové učenie a umelá inteligencia sú potenciálne nástroje na objavovanie materiálov.",
      "Supravodivé materiály majú potenciálne využitie v oblasti distribúcie energie a kvantových počítačov.",
      "Praktickosť a obmedzenia supravodivých materiálov sú predmetom záujmu.",
      "Je potrebné zlepšiť komunikáciu vo vedeckej komunite.",
      "Existuje možnosť, že sa vedecké objavy preceňujú."
    ],
    "points": 306,
    "commentCount": 148,
    "retryCount": 0,
    "time": 1690858956
  },
  {
    "id": 36950075,
    "title": "Pomôžte Kongresovej knižnici vytvoriť hry na zlepšenie občianskych vedomostí verejnosti",
    "originLink": "https://blogs.loc.gov/law/2023/06/help-the-library-of-congress-create-video-games-that-improve-public-knowledge-of-civics/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36950075",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [],
    "points": 288,
    "commentCount": 119,
    "retryCount": 0,
    "time": 1690844665
  },
  {
    "id": 36944152,
    "title": "Zobraziť HN: Markwhen: Markdown pre časové osi",
    "originLink": "https://app.markwhen.com",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=36944152",
    "commentBody": "",
    "originSummary": [
      "Táto osoba vyvinula nástroj s názvom markwhen.",
      "markwhen je určený na konverziu obyčajného textu na časové osi a kalendáre.",
      "Cieľom markwhen je poskytnúť na tento účel používateľsky prívetivý nástroj.",
      "Tvorca markwhen vyzýva používateľov, aby kládli otázky alebo poskytovali spätnú väzbu."
    ],
    "commentSummary": [
      "Markwhen.com je webová lokalita, ktorá umožňuje používateľom vytvárať časové osy a kalendáre pomocou obyčajného textu a Markdown.",
      "Používatelia poskytli spätnú väzbu k používateľskému rozhraniu vrátane problémov na zariadeniach iPad.",
      "Existuje potenciál na integráciu Markwhen s inými nástrojmi, ako sú Obsidian a Visual Studio Code.",
      "Tvorca plánuje vydať offline a online verziu Markwhen s rôznymi cenovými štruktúrami.",
      "Používatelia porovnali Markwhen s inými nástrojmi a navrhli vylepšenia, napríklad zásuvný modul Obsidian.",
      "Projekt získal pozitívnu spätnú väzbu a vyvolal záujem používateľov.",
      "Niektorí používatelia diskutujú o funkčnosti a použiteľnosti nástroja na plánovanie produktov s názvom Markwhen, navrhujú jeho vylepšenia a oceňujú jeho užitočnosť."
    ],
    "points": 272,
    "commentCount": 51,
    "retryCount": 0,
    "time": 1690817486
  }
]
