[
  {
    "id": 37526047,
    "title": "Benim favori API'm Avrupa Merkez Bankası'nın web sitesindeki bir zip dosyasıdır",
    "originLink": "https://csvbase.com/blog/5",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37526047",
    "commentBody": "",
    "originSummary": [
      "Yazar, Avrupa Merkez Bankası'ndan (ECB) döviz kuru verilerini almak ve dönüştürmek için temel bir web veritabanı olan csvbase'i kullanma metodolojilerini detaylandırmaktadır.",
      "Etkileşimli süreç, verilerin indirilmesini, pandas adlı bir yazılım kütüphanesi kullanılarak daha pratik bir formata dönüştürülmesini ve ardından csvbase'e yüklenmesini; ardından gnuplot ile görselleştirmeyi ve duckdb aracılığıyla karmaşık analizi içerir.",
      "Açık veri mevcudiyeti, basit kullanım ve ECB verilerinin bir değişim formatı olarak etkinliği metinde güçlü bir şekilde vurgulanmaktadır."
    ],
    "commentSummary": [
      "Yazı ve konu başlığı, Avrupa Merkez Bankası'nın kullanıcıların CSV dosyalarını indirmesine olanak tanıyan, verimliliği ve güvenilirliği ile takdir edilen zipfile API'sine odaklanıyor.",
      "Tartışma, kamu veri kullanımının zorlukları ve kısıtlamalarından bahsetmekte ve verimsiz veri yönetimi ve API (Uygulama Programlama Arayüzü) tasarımı konularını gündeme getirmektedir.",
      "Katılımcılar, kullanıcı dostu, optimize edilmiş çözümlere duyulan ihtiyaç üzerinde ısrarla durmakta ve etkin veri depolama ve işleme için çeşitli araçlar, teknikler ve veri formatları önermektedir."
    ],
    "points": 869,
    "commentCount": 232,
    "retryCount": 0,
    "time": 1694797155
  },
  {
    "id": 37527720,
    "title": "Uber için Excel oluşturdum ve onu terk ettiler",
    "originLink": "https://basta.substack.com/p/no-sacred-masterpieces",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37527720",
    "commentBody": "",
    "originSummary": [
      "Yazar, Uber Çin'de Crystal Ball olarak bilinen bir proje için R-Crusher adlı otomatik bir veri bilimi model aracı geliştirmiştir.",
      "Başarıya rağmen, proje Uber Çin'in satışından sonra durduruldu ve kodun geçici doğası ve iş değeri sağlamanın önemi üzerine düşünceleri ateşledi.",
      "Yazar, yazılım mühendisliği camiasından gelen teşvik edici geri bildirimleri paylaşmakta ve daha fazla okuma için önceki yazılara bağlantılar sunmaktadır."
    ],
    "commentSummary": [
      "Tartışma, ekonomik ve endüstriyel casusluk, kod sahipliği, kullanım hakları, fikri mülkiyet hırsızlığı ve yazılım araçlarının satın alınması ile oluşturulmasının etkileri konuları etrafında şekilleniyor.",
      "Farklı bakış açıları tartışılmakta, bazıları kod sahipliğinin etik ve yasal sonuçlarına odaklanırken, diğerleri kod paylaşımını savunmakta ve algılanan Batı ikiyüzlülüğünü eleştirmektedir.",
      "Teknoloji alanında kod sahipliği ve fikri mülkiyetin karmaşık ve çoğu zaman kafa karıştırıcı doğasının bir göstergesi olarak, iş sözleşmelerini anlamaya ve yasal tavsiye almaya vurgu yapılıyor."
    ],
    "points": 538,
    "commentCount": 396,
    "retryCount": 0,
    "time": 1694804509
  },
  {
    "id": 37522858,
    "title": "Carrefour markaları utandırmak için gıdalara 'shrinkflation' fiyat uyarıları koyuyor",
    "originLink": "https://www.theguardian.com/business/2023/sep/14/carrefour-puts-shrinkflation-price-warnings-on-food-to-shame-brands",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37522858",
    "commentBody": "",
    "originSummary": [
      "Fransız süpermarket zinciri Carrefour, üreticilerin fiyatları yükseltmek yerine paket boyutlarını küçülttüğü bir durum olan \"shrinkflation\" konusunda alışveriş yapanları uyaran etiketler kullanmaya başladı.",
      "Bu stratejiyi sözleşme görüşmelerinden önce Nestlé, PepsiCo ve Unilever gibi büyük tedarikçilere baskı yapmak için uyguladı. Carrefour bu uygulamayı sergileyecek 26 ürün belirlemiş olup, tedarikçilerin fiyat indirimlerini kabul etmemesi halinde benzer etiketleme planları yapmaktadır.",
      "Carrefour'un CEO'su Alexandre Bompard, hammadde maliyetlerindeki düşüşü göz önünde bulundurarak fiyatların düşürülmesine yardımcı olmadıkları için bu şirketleri eleştirdi."
    ],
    "commentSummary": [
      "Büyük süpermarket zinciri Carrefour, fiyatlar sabit kalırken ambalaj boyutlarının küçüldüğü bir olgu olan \"shrinkflation \"dan etkilenen ürünleri etiketleyerek sorumlu markaları öne çıkarıyor.",
      "Avrupa'da enflasyon konusunda süregelen tartışmalar, enflasyonun şirketlerin kar marjlarını şişirmelerinden mi yoksa tedarik zincirindeki sorunlar gibi diğer unsurlardan mı kaynaklandığına dair tartışmaları da içeriyor.",
      "Söylem, doğal afetlerdeki fiyat artışları, ambalaj boyutlarını standartlaştırmaya yönelik mevzuatın etkisi, fiyatlandırma stratejileri, gelir eşitsizliği ve ürünlerde net birim fiyatlandırma gerekliliği konularına uzanıyor."
    ],
    "points": 470,
    "commentCount": 359,
    "retryCount": 0,
    "time": 1694785487
  },
  {
    "id": 37521710,
    "title": "TikTok, çocuk hesaplarıyla ilgili AB veri yasasını ihlal ettiği için 345 milyon Avro para cezasına çarptırıldı",
    "originLink": "https://www.theguardian.com/technology/2023/sep/15/tiktok-fined-345m-for-breaking-eu-data-law-on-childrens-accounts",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37521710",
    "commentBody": "",
    "originSummary": [
      "TikTok, çocuk kullanıcıların hesaplarıyla ilgili AB veri yasalarını ihlal ettiği gerekçesiyle İrlanda Veri Koruma Komisyonu (DPC) tarafından 345 milyon € (296 milyon £) cezaya çarptırıldı.",
      "İhlaller arasında çocuk hesaplarının varsayılan olarak herkese açık ayarlara getirilmesi, çocuklara veri bilgilerinin sağlanmasında şeffaflık eksikliği, yetişkinlere çocuk kullanıcıların hesaplarına erişim izni verilmesi ve reşit olmayan kullanıcılara yönelik risklerin değerlendirilmesinde ihmal yer alıyor.",
      "Bundan önce TikTok, 13 yaşın altındaki 1,4 milyon çocuğun verilerini ebeveyn izni olmadan yasadışı bir şekilde işlediği için Birleşik Krallık veri düzenleyicisi tarafından 12,7 milyon £ para cezasına çarptırılmıştı."
    ],
    "commentSummary": [
      "TikTok, çocuk hesaplarıyla ilgili veri koruma düzenlemelerini ihlal ettiği gerekçesiyle Avrupa Birliği'nden 345 milyon Avro para cezası aldı.",
      "Bu kararı izleyen tartışmalar, disiplin tedbiri olarak para cezalarının etkinliği, gizlilik yasalarının uygulanması ve teknoloji firmalarının veri güvenliğini garanti etme yükümlülüğü etrafında dönmektedir.",
      "Bazı tartışmalar konudan saparak AB'nin Yunanistan'daki mali krizi ele alış biçimi ve mültecilerin durumu gibi ana haberlerle doğrudan ilgisi olmayan konulara yöneliyor."
    ],
    "points": 367,
    "commentCount": 298,
    "retryCount": 0,
    "time": 1694779347
  },
  {
    "id": 37522106,
    "title": "Akiyoshi'nin İllüzyon Sayfaları",
    "originLink": "https://www.ritsumei.ac.jp/~akitaoka/index-e.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37522106",
    "commentBody": "",
    "originSummary": [
      "Akiyoshi Kitaoka tarafından geliştirilen web sitesi, eşlik eden açıklamalar ve bağlamsal arka planla birlikte sunulan illüzyon görüntüleri ve tasarımlarının bir derlemesini sunuyor.",
      "Sitede temel içeriğin yanı sıra optik illüzyonlar konusuyla ilgili haberler, yarışmalar ve fotoğraflar da yer alıyor.",
      "Özellikle ticari uygulamaları yasaklayan kullanım kısıtlamaları mevcuttur ve kullanıcılar içeriğin baş dönmesine neden olabileceği konusunda uyarılmaktadır."
    ],
    "commentSummary": [
      "Makale, Akiyoshi Kitaoka'nın yakın zamanda gerçekleştirdiği ve insanların renkli halkaları nasıl farklı algıladıklarını, gözlük ve baş hareketi gibi değişkenlerin etkiyi nasıl etkilediğini gösteren bir illüzyonu ele alıyor.",
      "Forum katılımcıları kişisel deneyimlerini paylaşıyor ve optik illüzyonların beyin üzerindeki etkisini tartışarak illüzyon sanatının daha geniş alanını keşfediyor.",
      "İllüzyonların reklamcılık ve oyun gibi alanlarda potansiyel kullanımına vurgu yapılarak, optik illüzyonlara yönelik süregelen hayranlığın altı çiziliyor."
    ],
    "points": 349,
    "commentCount": 55,
    "retryCount": 0,
    "time": 1694781832
  },
  {
    "id": 37527773,
    "title": "Sıfırdan bir ekonomi simülatörü inşa etmek",
    "originLink": "https://thomassimon.dev/ps/4",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37527773",
    "commentBody": "",
    "originSummary": [
      "Yazar, sıfırdan bir ekonomi simülasyonu yaratıyor ve ilerlemelerini kaydediyor.",
      "Tek bir kuruluşla başlayıp kaynak kullanımı ve üretimi ile ilgili teorileri ortaya koymakta ve kademeli olarak su üretiminde uzmanlaşmış daha fazla çalışanı bünyelerine katmaktadırlar.",
      "Paylaşılan kaynakları hesaba katmak için bir mekanizma olarak parayı tanıtıyorlar ve simülasyonlarına ilginç bir dinamik sağlıyorlar."
    ],
    "commentSummary": [
      "Hacker News tartışması bir ekonomi simülatörünün yaratılmasına odaklanıyor ve bunun ekonomi, psikoloji ve gerçek dünya verileriyle ilişkisini araştırıyor.",
      "Katılımcılar, karmaşık ekonomik sistemleri doğru bir şekilde modellemenin ve simüle etmenin zorluklarını vurgulayarak, gerçek dünya verilerini dahil etmenin ve kötü aktörleri ve istismarı hesaba katmanın önemini vurgulamaktadır.",
      "Tartışma aynı zamanda kapitalist ekonomik sistemlerin dışında kalan kapitalistlerin varlığına ve rollerine de değinmektedir. Tartışma, servetin yoğunlaşması ve ekonomik modellerin sınırlılıkları gibi kilit konuların altını çizmektedir."
    ],
    "points": 348,
    "commentCount": 144,
    "retryCount": 0,
    "time": 1694804772
  },
  {
    "id": 37524202,
    "title": "Shrinkflation Tracker",
    "originLink": "https://www.shrinkflation.io/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37524202",
    "commentBody": "",
    "originSummary": [
      "Shrinkflation.io, fiyatlar sabit kalırken ürünlerin boyutlarının küçüldüğü bir olgu olan shrinkflation ile mücadele etmek için tasarlanmış bir web sitesidir.",
      "Site, Cadbury Dairy Milk, Mars Maltesers ve Nestlé Kit Kat gibi küçülmeye uğradığı bilinen farklı ürün ve markaların bir arama kaydını tutuyor.",
      "Kullanıcılar bu ürün ve markaları doğrudan web sitesinden izleme olanağına sahiptir."
    ],
    "commentSummary": [
      "Hacker News forumu, shrinkflation'ın ürün kalitesi üzerindeki etkisine, işletmelerin aldatıcı uygulamalarına, şeffaflık ve gelişmiş etiketleme talebine ve ilgili etik ikilemlere odaklanan çeşitli tartışmalara ev sahipliği yapıyor.",
      "Diğer konu başlıkları arasında küçültülmüş ürünlerin takibine yönelik mekanizmalar, hayvan deneyleriyle ilgili sorunlar ve abur cuburun satın alınabilirliği ve sağlık üzerindeki etkileri yer alıyor.",
      "Shrinkflation, şirketlerin, genellikle tüketicileri açıkça bilgilendirmeden, fiyatlarını korurken veya artırırken ürünlerinin boyutunu veya miktarını azalttığı süreci ifade eder."
    ],
    "points": 305,
    "commentCount": 211,
    "retryCount": 0,
    "time": 1694790402
  },
  {
    "id": 37526477,
    "title": "Kopia: Hızlı ve güvenli açık kaynaklı yedekleme yazılımı",
    "originLink": "https://kopia.io/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37526477",
    "commentBody": "",
    "originSummary": [
      "Web sitesi, GUI (Grafik Kullanıcı Arayüzü) ve CLI (Komut Satırı Arayüzü) aracılığıyla hız, güvenlik ve çoklu işletim sistemleriyle uyumluluğa sahip açık kaynaklı bir yedekleme yazılımı olan Kopia'yı tanıtıyor.",
      "Kopia, kullanıcının tercih ettiği bulut depolama alanını kullanarak şifrelenmiş, sıkıştırılmış ve tekilleştirilmiş yedeklemeleri kolaylaştırır ve anlık görüntüleri, politikaları ve dosya geri yüklemeyi yönetmek için bir masaüstü uygulaması içerir.",
      "Web sitesi, GitHub'da bir Çekme İsteği iş akışı aracılığıyla Kopia için katkıları ve hata raporlarını davet ediyor ve Slack'te Kopia özellikleri ve sorunları hakkında kullanıcı tartışmalarına katılıyor."
    ],
    "commentSummary": [
      "Hızlı ve güvenli bir açık kaynak yedekleme yazılımı olan Kopia, hatalı depolama ve yavaş sürüm güncellemeleri gibi bazı dezavantajları nedeniyle tartışılıyor.",
      "Kullanıcılar Kopia ile yedeklemeleri tamamlayamama, hatalı ilerleme göstergeleri ve büyük veri setlerini geri yükleme sorunları gibi zorluklar yaşadı.",
      "Kopia'ya alternatifler, çevrimdışı yedeklemenin avantajları ve kurumsal ortamda yedekleme hizmetleri için kapsamlı test ihtiyacı da tartışıldı."
    ],
    "points": 268,
    "commentCount": 104,
    "retryCount": 0,
    "time": 1694799145
  },
  {
    "id": 37521240,
    "title": "Linux bir süreci nasıl başlatır?",
    "originLink": "https://iq.thc.org/how-does-linux-start-a-process",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37521240",
    "commentBody": "",
    "originSummary": [
      "Makale, Linux'un bir süreci başlatma ve yürütme yığınını hazırlama mekanizmasını incelemekte, özellikle de bir sürecin execve() işlevini ne zaman çağırdığına odaklanmaktadır.",
      "Talimatların ve program yığınının analizi için gdb (GNU Debugger) kullanarak ikili bir dosyanın ayrıntılarının derinlemesine incelenmesini sağlar.",
      "Parça ayrıca Linux çekirdeğinin argüman listeleri ve ortam değişkenleri gibi bilgilerle yığını nasıl tahsis ettiğini ve doldurduğunu göstererek 'Zapper' gibi araçlar için yararlı bilgiler sağlıyor."
    ],
    "commentSummary": [
      "Hacker News'deki tartışma konusu, Linux'un bir süreci nasıl başlattığını ve ELF (Çalıştırılabilir ve Bağlanabilir Biçim) başlıklarının yorumlanmasını anlamaya odaklanıyor.",
      "Bu konuda daha derinlemesine bilgi edinmek için çok sayıda kaynak ve referans paylaşılmıştır.",
      "Tartışmanın bir kısmı, konu başlığında diğer kullanıcılar tarafından paylaşılan yorumların ve bilgilerin kalitesine ilişkin eleştiri ve geri bildirimleri içerir."
    ],
    "points": 265,
    "commentCount": 28,
    "retryCount": 0,
    "time": 1694776086
  },
  {
    "id": 37523992,
    "title": "Google, aldatıcı konum takibi nedeniyle 93 milyon dolar ödeyecek",
    "originLink": "https://www.theguardian.com/technology/2023/sep/14/google-location-tracking-data-settlement",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37523992",
    "commentBody": "",
    "originSummary": [
      "Google, konum izleme uygulamaları konusunda tüketicileri yanılttığı iddiaları üzerine 93 milyon dolar ödemeyi kabul etti.",
      "Kaliforniya başsavcısı, Google'ı kullanıcılar konum geçmişlerini devre dışı bıraktıklarında bile kullanıcı konum verilerini toplamaya ve depolamaya devam etmekle suçlayarak davayı açtı.",
      "Anlaşma ayrıca Google'ın izleme yöntemleri konusunda daha şeffaf olması ve gizlilik ayarlarında değişiklik yapmadan önce onay alması şartlarını da içeriyor."
    ],
    "commentSummary": [
      "Google, hileli konum izleme uygulamaları iddiaları üzerine 93 milyon dolarlık bir uzlaşmayı kabul etti ve bu anlaşma Google'ın yıllık geliri göz önüne alındığında gelecekteki ihlalleri önlemek için yetersiz olmakla eleştirildi.",
      "Mahremiyetin korunması için daha katı cezaların ve mevzuatın gerekliliğine ilişkin tartışmaların yanı sıra Google'ın internet hakimiyetine ve uzlaşma çözümlerinin etkinliğine yönelik eleştiriler de ortaya çıkıyor.",
      "Konum geçmişi ayarlarının karmaşık yönetimi, bazı uygulamalar tarafından cihaz ayarlarının izinsiz değiştirilmesi ve konum takibini etkinleştirmek için bir Google hesabının gerekliliği konusunda endişeler dile getirildi."
    ],
    "points": 230,
    "commentCount": 69,
    "retryCount": 0,
    "time": 1694789636
  },
  {
    "id": 37528816,
    "title": "\"Ters aşı\" MS ve diğer otoimmün hastalıkları tedavi etme potansiyeli gösteriyor",
    "originLink": "https://pme.uchicago.edu/news/inverse-vaccine-shows-potential-treat-multiple-sclerosis-and-other-autoimmune-diseases",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37528816",
    "commentBody": "",
    "originSummary": [
      "Chicago Üniversitesi Pritzker Moleküler Mühendislik Okulu'ndan araştırmacılar, multipl skleroz ve tip I diyabet dahil olmak üzere otoimmün hastalıkları potansiyel olarak iyileştirmek için bir 'ters aşı' oluşturdular.",
      "Bağışıklık sistemini virüsleri veya bakterileri tanıması ve bunlarla mücadele etmesi için eğiten geleneksel aşıların aksine, bu yeni aşı bağışıklık sisteminin belirli bir molekülü tanımasını ortadan kaldırarak otoimmün reaksiyonları önler.",
      "'Ters aşı', karaciğerin bozulan hücrelerdeki molekülleri 'saldırmayın' etiketleriyle işaretleme sürecini kullanıyor. Ön laboratuvar testleri aşının multipl sklerozla ilişkili otoimmün reaksiyonları etkili bir şekilde tersine çevirdiğini göstermiştir ve güvenlik denemeleri halihazırda başlamıştır."
    ],
    "commentSummary": [
      "Chicago Üniversitesi'ndeki araştırmacılar, bağışıklık sisteminin sorunlu moleküllere ilişkin hafızasını ortadan kaldırarak otoimmün hastalıkları tedavi etmeyi amaçlayan bir \"ters aşı\" geliştirdi.",
      "Bu aşı, mevcut bağışıklık bastırma tedavilerine daha kesin bir alternatif sunarak daha etkili sonuçlar vaat ediyor.",
      "Potansiyel yan etkilerin yanı sıra otoimmün hastalıkların daha geniş bir şekilde anlaşılmasına ilişkin endişeler devam etmektedir. Çiçek aşısının rolü ve bağışıklığın korunmasının önemi de tartışılmaktadır."
    ],
    "points": 198,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1694810351
  },
  {
    "id": 37524158,
    "title": "Kaliforniya, veri simsarlarından veri silmeyi kolaylaştıracak yasa tasarısını kabul etti",
    "originLink": "https://www.latimes.com/politics/story/2023-09-14/california-bill-delete-online-personal-data",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37524158",
    "commentBody": "",
    "originSummary": [
      "Kaliforniya yasama meclisi, tüketiciler için veri aracılarından kişisel bilgileri silme sürecini basitleştirmeyi amaçlayan Delete Act (Silme Yasası) tasarısını kabul etti.",
      "Kaliforniya Gizlilik Koruma Ajansı, tüketicilerin tek bir taleple kayıtlarının veri simsarlarından kaldırılmasını talep edebilecekleri bir sistem oluşturmakla görevlendirilerek kişisel veriler üzerindeki şeffaflığı ve kontrolü artıracaktır.",
      "Bazı işletmeler ve sektör dernekleri, istenmeyen sonuçlar doğurabileceği ve küçük işletmelere zarar verebileceği gerekçesiyle tasarıya karşı çıktı. Tasarı şu anda valinin onayını bekliyor."
    ],
    "commentSummary": [
      "Kaliforniya, bireylerin verilerini veri aracılarından kolayca silebilmelerini sağlamaya odaklanan bir yasayı kabul etti; ancak bu yasa, halihazırda talep üzerine verileri silmekle yükümlü olan Google ve Facebook gibi şirketleri muaf tutuyor.",
      "Tasarının temel amacı kişisel verilerin kontrolünü ve gizliliğin korunmasını geliştirmek olsa da, tasarının etkinliği ve belirli işletmelerin muafiyeti konusunda endişeler dile getirilmektedir.",
      "Tartışmada ayrıca veri satışı, kredi puanları ve mevcut düzenlemelerin etkinliği gibi konular da ele alınmaktadır. Kaliforniya Tüketici Gizliliği Yasası (CCPA), etkileri, potansiyel boşluklar ve veri silmenin karmaşıklığı daha ayrıntılı olarak incelenmektedir. Tasarı, kurumların bir silme mekanizması oluşturmasını zorunlu kılıyor ve uyulmamasını cezalandırıyor."
    ],
    "points": 188,
    "commentCount": 70,
    "retryCount": 0,
    "time": 1694790212
  },
  {
    "id": 37532355,
    "title": "Instagram yalnızca 3 mühendisle 14 milyon kullanıcıya nasıl ulaştı?",
    "originLink": "https://engineercodex.substack.com/p/how-instagram-scaled-to-14-million",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37532355",
    "commentBody": "",
    "originSummary": [
      "Instagram, yalnızca üç mühendisten oluşan küçük bir ekiple bir yıldan biraz daha uzun bir süre içinde 14 milyon kullanıcıya ulaşarak önemli bir büyüme kaydetti.",
      "Bunu üç yol gösterici ilke ve AWS, Ubuntu Linux, EC2, NGINX, Django, Gunicorn, Postgres, S3, Redis, Memcached, pyapns ve Gearman gibi teknolojileri içeren güvenilir bir teknoloji yığını benimseyerek başardılar.",
      "Ayrıca altyapılarının etkinliğini ve güvenilirliğini sağlamak için Sentry, Munin, Pingdom ve PagerDuty gibi izleme araçlarından da yararlandılar."
    ],
    "commentSummary": [
      "Makale, Instagram'ın yalnızca üç mühendisten oluşan küçük bir ekiple 14 milyon kullanıcıya ulaşma konusundaki etkileyici başarısını ele alıyor ve girişimlerde küçük ekip boyutlarının potansiyel verimliliğini gösteriyor.",
      "Instagram'ın basit ama etkili mimarisi vurgulanmakta ve mikro hizmetlerin uygulama geliştirmede kullanımı, faydaları ve zorluklarına atıfta bulunularak tartışılmaktadır.",
      "Metin ayrıca veritabanlarını ölçeklendirmenin pratik sonuçlarına ve Instagram'ın veritabanı mimarisine değinmekte ve Roblox'un mikro hizmetlerin uygulanmasında karşılaştığı zorluklardan bahsetmektedir."
    ],
    "points": 177,
    "commentCount": 103,
    "retryCount": 0,
    "time": 1694843484
  },
  {
    "id": 37531801,
    "title": "Subdomain.center - bir alan adı için tüm alt alan adlarını keşfedin",
    "originLink": "https://www.subdomain.center/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37531801",
    "commentBody": "",
    "originSummary": [
      "Subdomain Center, ARPSyndicate tarafından geliştirilen ve Apache'nin Nutch ve OpenAI'nin Embedding Modelleri gibi araçları kullanarak diğer tüm hizmetlerden daha fazla alt alan adı keşfeden bir araştırma projesidir.",
      "Kötüye kullanımı önlemek için hizmet, kullanıcıları dakikada en fazla üç istekle sınırlandırır ve artan talep nedeniyle potansiyel kesinti meydana gelebilir.",
      "ARPSyndicate, Subdomain Center'ın yanı sıra bir komut satırı yardımcı aracı olan Puncia ve istismar gözlemi, saldırı yüzeyi yönetimi, güvenlik açığı taraması ve açık kaynak istihbaratı ile ilgili diğer kaynakları sunar."
    ],
    "commentSummary": [
      "Forumda alt alan adlarına bağlı güvenlik açıkları ve riskler tartışılıyor ve kullanıcılar IPv4 internetini tarama, sertifika şeffaflık günlüklerinden yararlanma ve özel araçlar kullanma gibi farklı keşif yöntemlerini paylaşıyor.",
      "Herkes tarafından görülebilen alt alan adlarının gizlilik ve güvenlik sorunları ve dahili alt alan adlarının güvenliğini sağlamanın zorluğu hakkında endişeler vardır ve ek güvenlik için bağlantı noktalarını açarken ve hizmetleri açığa çıkarırken dikkatli olunması tavsiye edilir.",
      "Bu bağlamlarda IPv4 yerine IPv6 kullanmanın avantajlarının yanı sıra daha fazla güvenlik için port kapama veya Tor kullanımı önerilmektedir."
    ],
    "points": 173,
    "commentCount": 75,
    "retryCount": 0,
    "time": 1694835147
  },
  {
    "id": 37521931,
    "title": "Evet, Android 14 hala sistem sertifikalarının değiştirilmesine izin veriyor",
    "originLink": "https://www.g1a55er.net/Android-14-Still-Allows-Modification-of-System-Certificates",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37521931",
    "commentBody": "",
    "originSummary": [
      "Blog yazısı, Tim Perry'nin Android 14'ün sistem sertifikalarındaki tüm değişiklikleri kısıtladığı iddiasına karşı çıkarak, ayarlamaların hala yapılabileceğine ve kullanıcıların sistem sertifikası güvenini iptal edebileceğine dair kanıtlar sunuyor.",
      "Yazar, geliştiricilerin, Android ile çalışan bir cihazla iletişim kurmak için kullanılan çok yönlü bir komut satırı aracı olan ADB (Android Debug Bridge) aracılığıyla güvenilir sistem sertifikaları ekleyebileceklerini ileri sürmektedir.",
      "Android 14 ile yapılan değişiklikler kabul edilmekle birlikte, kullanıcı özgürlüğünün korunduğu ve bu değişikliklerin sertifika deposunun havadan güncellenmesine yardımcı olduğu, dolayısıyla Android 14 ile uyumlu araçların güncellenmesinin beklendiği sonucuna varılmıştır."
    ],
    "commentSummary": [
      "Tartışma, Android 14'teki sistem sertifikası değişikliklerini ve diğerlerinin pahasına belirli özelliklere ve uygulamalara erişim elde etmek de dahil olmak üzere rooting cihazlarının etkilerini ve potansiyel faydalarını vurgulamaktadır.",
      "Kullanıcılar değişiklik yapmak ve kullanıcı özgürlüğü ile cihaz korumasını dengelemek için ADB + Frida veya Magisk + safetynet-fix gibi alternatif yöntemleri değerlendiriyor.",
      "Yazı, Android ve Apple cihazlarının artan düşmanlığı karşısında kullanıcı sahipliğinin öneminin altını çiziyor. Apple'ın güvenlik önlemlerini takdir ederken, uyarılar içeren bir geliştirici modunun dahil edilmesini öneriyor."
    ],
    "points": 164,
    "commentCount": 64,
    "retryCount": 0,
    "time": 1694780823
  },
  {
    "id": 37528453,
    "title": "ABD v. Google davasının ilk haftası - Varsayılanlar her şeydir ve kimse Bing'i sevmez",
    "originLink": "https://www.theverge.com/2023/9/15/23875342/justice-department-google-antitrust-search-trial-week-one-recap",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37528453",
    "commentBody": "",
    "originSummary": [
      "ABD hükümeti Google'a karşı bir antitröst davası başlattı ve teknoloji devini arama motoru pazarındaki hakimiyetini adil rekabet yerine zorlayıcı anlaşmalar yoluyla kurmakla suçladı.",
      "Dava, Google'ın tekelci konumunu sürdürmek için varsayılanlar ve veri kullanımı ile ilgili uygulamaları etrafında dönecek ve ayrıca bu eylemlerin tüketiciler için yararlı olup olmadığını veya yalnızca Google'ın çıkarlarına hizmet edip etmediğini inceleyecektir.",
      "Dava, Google'ın hakimiyeti nedeniyle tüketicilere ve reklamverenlere yönelik potansiyel zararı araştıracak ve hakimin kararının özünü, arama motorları gibi ücretsiz ürünlerin gerçekten de tüketiciye zarar verip veremeyeceği belirleyecek."
    ],
    "commentSummary": [
      "U.S. v. Google davası, varsayılan arama motoru olmak için ödeme yapmanın rekabet kurallarını ihlal edip etmediğini araştırıyor ve daha net kurallar belirlemeyi amaçlıyor.",
      "Eleştirmenler, çalışan beyanlarının kötüye kullanıldığını ve gerçek rekabet karşıtı uygulamalardan saptırıldığını öne sürüyor. Google'ın hakimiyeti, etkin rekabetin azlığı ve bunun Bing ve Mozilla gibi diğer arama motorları üzerindeki etkisi temel endişeleri oluşturuyor.",
      "Kullanıcılar mevcut alternatiflerden memnuniyetsizliklerini dile getirerek daha iyi arama motoru seçenekleri talep ediyor. Tartışılan diğer konular arasında internet kullanımı, Chromium'un bağımsızlığı ve Mozilla'nın mali yeterliliği yer alıyor."
    ],
    "points": 163,
    "commentCount": 136,
    "retryCount": 0,
    "time": 1694808221
  },
  {
    "id": 37525348,
    "title": "Bir satranç pozisyonu bit seviyesi sihir kullanılarak 26 baytta nasıl saklanır (2022)",
    "originLink": "https://www.ezzeriesa.com/index/Writing%20efa7772a3ae64a8193c7ef981ac619fc/Compressing%20chess%20positions%20for%20fun%20and%20profit%20df1fdb5364eb42fdac11eb23b25e9605.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37525348",
    "commentBody": "",
    "originSummary": [
      "Makale, bir satranç pozisyonunu 26 baytta kompakt bir şekilde saklamak için yenilikçi bir teknik sunmaktadır.",
      "Yöntem, şahların ve piyonların eşsiz yerleşimlerinden yararlanarak ele geçirme, rok atma kabiliyeti ve en passant hedefini temsil etmenin yanı sıra terfiler için ayırt edici bir kodlama yapar ve böylece gerekli depolama alanını azaltır.",
      "Depolama tekniği, pozisyonun farklı yönlerini verimli bir şekilde karakterize etmek için bitmaplerin ve sıralamanın kullanılmasını içerir, böylece bir satranç pozisyonunun sadece yaklaşık 26 baytta depolanmasını sağlar."
    ],
    "commentSummary": [
      "Makaleler, önemli bilgileri korurken veri gereksinimlerini azaltmak için satranç pozisyonlarını daha kompakt ve verimli bir şekilde sıkıştırma ve saklama yöntemlerini inceliyor.",
      "Bit seviyesinde büyü, blok zinciri teknolojisinin kullanımı, hamle geçmişinin saklanması, hafızadan geri çağırma ve özellikle satranç motorları için kompakt kodlama gibi çeşitli stratejileri kapsar. Ayrıca sıkıştırılmış formatların JSON'a göre avantajını vurgulamaktadır.",
      "Amaç, satranç veritabanları ve uygulamalarında performans, depolama ve işlem verimliliğini artırmaktır."
    ],
    "points": 161,
    "commentCount": 169,
    "retryCount": 0,
    "time": 1694794554
  },
  {
    "id": 37527928,
    "title": "Oyun Geliştiricileri için Kitaplar",
    "originLink": "https://mrelusive.com/books/books.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37527928",
    "commentBody": "",
    "originSummary": [
      "Yazıda, oyun geliştiricileri için önerilen kitapların ayrıntılı bir listesi sunuluyor ve alanla ilgili çok sayıda konu ele alınıyor.",
      "Bu kitaplar bilgisayar grafikleri, oyun programlama, yapay zeka, fizik ve dinamik simülasyonu konularında değerli bilgiler sunmaktadır.",
      "Bu ciltlerde ele alınan diğer konular arasında tasarım ve uygulama, lineer cebir, optimizasyon ve algoritmalar yer almakta olup, hevesli ve deneyimli oyun geliştiricileri için kapsamlı bir bilgi tabanı sağlamaktadır."
    ],
    "commentSummary": [
      "Forum tartışması, daha fazla okuma için tavsiyeler içeren bir oyun geliştirme kitapları koleksiyonunu çevreliyor.",
      "Saygın, merhum bir oyun geliştiricisi için bu alandaki etkisini gösteren bir anma ve hatırlama bölümü var.",
      "Tartışmada kuaterniyonlar üzerinde duruluyor; kullanıcıların 3D dönüşleri temsil etmek için oyun geliştirmede faydalı buldukları karmaşık bir sayı sistemi."
    ],
    "points": 158,
    "commentCount": 50,
    "retryCount": 0,
    "time": 1694805518
  },
  {
    "id": 37529359,
    "title": "Johnny Cash Her Yerdeydi (Man)",
    "originLink": "http://www.johnnycashhasbeeneverywhere.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37529359",
    "commentBody": "",
    "originSummary": [
      "Iain Mullan, Music Hack Day London 2012 sırasında MusixMatch, Toma.HK ve Covers FM'i kullanarak Johnny Cash'in \"I've Been Everywhere\" şarkısını içeren yenilikçi bir hack yarattı.",
      "Hack, efsanevi sanatçı Johnny Cash'in şarkısında anlattığı gibi seyahat ettiği coğrafi alanı gösteren bir harita içeriyor.",
      "Bu yaratıcı coğrafi temsil, Google'ın ve INEGI'nin harita verileri kullanılarak görselleştirilmiştir."
    ],
    "commentSummary": [
      "Makale, Johnny Cash'in \"I've Been Everywhere\" şarkısında adı geçen tüm yerleri listeleyen \"Johnny Cash Has Been Everywhere (Man)\" adlı bir web sitesini vurguluyor.",
      "Makaledeki kullanıcı tartışmaları, söz konusu varış noktaları arasındaki en kısa yol da dahil olmak üzere ilgili konular etrafında yoğunlaşmaktadır.",
      "Tartışmada Johnny Cash'in bağımlılık sorunları gibi kişisel konulara da değiniliyor."
    ],
    "points": 156,
    "commentCount": 28,
    "retryCount": 0,
    "time": 1694813409
  },
  {
    "id": 37524890,
    "title": "Veri Seti Perspektifinden LLM'lerin Optimize Edilmesi",
    "originLink": "https://sebastianraschka.com/blog/2023/optimizing-LLMs-dataset-perspective.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37524890",
    "commentBody": "",
    "originSummary": [
      "Makale, özenle seçilmiş veri kümeleri ile ince ayar kullanarak büyük dil modellerini (LLM'ler) optimize etme stratejisini araştırmaktadır.",
      "LIMA veri kümesi üzerinde 7B parametreli bir dil modeline ince ayar yapma sürecini detaylandırmakta ve otomatik kalite filtrelemenin potansiyelinden bahsetmektedir.",
      "Makale ayrıca NeurIPS LLM Efficiency Challenge'a atıfta bulunmakta ve hem LLM tarafından oluşturulan hem de insan tarafından küratörlüğü yapılan veri kümelerinin önemini vurgulamaktadır."
    ],
    "commentSummary": [
      "Makale, büyük dil modellerini (LLM'ler) daha küçük, üstün kaliteli veri kümelerini formüle etmek için kullanarak rafine etme kavramını incelemektedir.",
      "Süreç, çeşitli veriler üzerinde geniş bir modelin eğitilmesini, kaynak verileri lekesiz veri kümelerine ayırmak için kullanılmasını ve daha sonra bunlar üzerinde daha küçük modellerin eğitilmesini gerektirir. Amaç, daha erişilebilir, daha hızlı çıkarım yapabilen ve muhtemelen telif hakkı sorunlarından arınmış modeller geliştirmektir.",
      "LLM'lerin zekâsını geliştirmeye yönelik, erişim artırımlı üretim (RAG) ve dil çevirisi için ince ayar veri kümelerinin kullanımı gibi diğer teknikler de tartışılmaktadır."
    ],
    "points": 129,
    "commentCount": 23,
    "retryCount": 0,
    "time": 1694792949
  }
]
