[
  {
    "id": 37526047,
    "title": "A kedvenc API-m az Európai Központi Bank honlapján található zip-fájl.",
    "originLink": "https://csvbase.com/blog/5",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37526047",
    "commentBody": "",
    "originSummary": [
      "A szerző részletesen ismerteti a csvbase, egy alapvető webes adatbázis felhasználásának módszertanát az Európai Központi Bank (EKB) devizaárfolyam-adatainak kinyerésére és átalakítására.",
      "Az interaktív folyamat magában foglalja az adatok letöltését, a pandas nevű szoftverkönyvtár segítségével praktikusabb formátumba való átalakítását, majd feltöltését a csvbase-re; ezt követi a gnuplot segítségével történő vizualizáció és a duckdb segítségével történő komplex elemzés.",
      "A szövegben nagy hangsúlyt kap a nyílt adatelérhetőség, az egyszerű használat és az EKB adatainak mint csereformátumnak a hatékonysága."
    ],
    "commentSummary": [
      "A bejegyzés és a téma az Európai Központi Bank zipfile API-jára összpontosít, amely lehetővé teszi a felhasználók számára a CSV fájlok letöltését, és amelyet hatékonysága és megbízhatósága miatt nagyra értékelnek.",
      "A vita megemlíti a kormányzati adatfelhasználás nehézségeit és korlátait, és felveti a nem hatékony adatkezelés és az API (alkalmazásprogramozási interfész) kialakításának kérdéseit.",
      "A résztvevők hangsúlyozzák a felhasználóbarát, optimalizált megoldások szükségességét, és különböző eszközöket, technikákat és adatformátumokat javasolnak a hatékony adattároláshoz és -feldolgozáshoz."
    ],
    "points": 869,
    "commentCount": 232,
    "retryCount": 0,
    "time": 1694797155
  },
  {
    "id": 37527720,
    "title": "Az Uber számára készítettem az Excel-t, de ők elvetették.",
    "originLink": "https://basta.substack.com/p/no-sacred-masterpieces",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37527720",
    "commentBody": "",
    "originSummary": [
      "A szerző az Uber China egyik Crystal Ball nevű projektje számára fejlesztett ki egy R-Crusher nevű automatizált adattudományi modelleszközt.",
      "A siker ellenére a projektet az Uber China eladása után leállították, ami a kód múlandóságáról és az üzleti érték biztosításának fontosságáról szóló gondolatokat indított el.",
      "A szerző megosztja a szoftverfejlesztő közösség bátorító visszajelzéseit, és további olvasmányok linkjeit kínálja a korábbi munkákhoz."
    ],
    "commentSummary": [
      "A vita középpontjában a gazdasági és ipari kémkedés, a kódtulajdonlás, a felhasználási jogok, a szellemi tulajdon lopása, valamint a szoftvereszközök készítésének és megvásárlásának következményei állnak.",
      "Különböző nézőpontok kerülnek megvitatásra: egyesek a kódtulajdonlás etikai és jogi következményeire összpontosítanak, míg mások a kódmegosztás mellett érvelnek, és a nyugati képmutatást kritizálják.",
      "A hangsúly a munkaszerződések megértésén és a jogi tanácsadáson van, ami jelzi a kódtulajdonlás és a szellemi tulajdon összetett és gyakran zavaros természetét a technológiai szférában."
    ],
    "points": 538,
    "commentCount": 396,
    "retryCount": 0,
    "time": 1694804509
  },
  {
    "id": 37522858,
    "title": "A Carrefour \"zsugorodási\" árfigyelmeztetést helyez el az élelmiszereken, hogy megszégyenítse a márkákat",
    "originLink": "https://www.theguardian.com/business/2023/sep/14/carrefour-puts-shrinkflation-price-warnings-on-food-to-shame-brands",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37522858",
    "commentBody": "",
    "originSummary": [
      "A Carrefour francia szupermarketlánc bevezette a vásárlókat a \"zsugorodásra\" figyelmeztető címkéket, amikor a gyártók az áremelés helyett inkább csökkentik a csomagolási méreteket.",
      "Ezt a stratégiát azért alkalmazta, hogy a szerződéses tárgyalások előtt nyomást gyakoroljon az olyan nagy beszállítókra, mint a Nestlé, a PepsiCo és az Unilever. A Carrefour 26 olyan terméket azonosított, amelyeken ez a gyakorlat látható, és hasonló címkézést tervez, ha a beszállítók nem egyeznek bele az árcsökkentésbe.",
      "A Carrefour vezérigazgatója, Alexandre Bompard kritizálta ezeket a vállalatokat, amiért a nyersanyagköltségek csökkenését figyelembe véve nem segítettek az árak csökkentésében."
    ],
    "commentSummary": [
      "A Carrefour nagy szupermarketlánc a \"zsugorodás\" (a csomagolás méretének csökkenése, miközben az árak változatlanok maradnak) által érintett termékeket címkével látja el, hogy kiemelje a felelős márkákat.",
      "Az európai inflációról folyó vita során arról folyik a vita, hogy az infláció a vállalatok haszonkulcsának felduzzasztása vagy más tényezők, például az ellátási lánc bonyolultsága miatt következik-e be.",
      "A diskurzus kiterjed a természeti katasztrófák során tapasztalható árdrágításra, a csomagolási méretek szabványosítására vonatkozó jogszabályok hatására, az árképzési stratégiákra, a jövedelmi egyenlőtlenségekre és a termékek egyértelmű egységárképzésének szükségességére."
    ],
    "points": 470,
    "commentCount": 359,
    "retryCount": 0,
    "time": 1694785487
  },
  {
    "id": 37521710,
    "title": "A TikTok 345 millió eurós bírságot kapott a gyermekek fiókjaira vonatkozó uniós adatvédelmi törvény megsértése miatt",
    "originLink": "https://www.theguardian.com/technology/2023/sep/15/tiktok-fined-345m-for-breaking-eu-data-law-on-childrens-accounts",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37521710",
    "commentBody": "",
    "originSummary": [
      "A TikTokot 345 millió euró (296 millió font) büntetéssel sújtotta az ír adatvédelmi bizottság (DPC), mert megsértette a gyermekfelhasználók fiókjaira vonatkozó uniós adatvédelmi jogszabályokat.",
      "A jogsértések közé tartozik a gyermekfiókok nyilvános beállításainak alapértelmezett beállítása, az átláthatóság hiánya a gyermekeknek nyújtott adatszolgáltatások terén, a felnőttek hozzáférésének biztosítása a gyermekfelhasználók fiókjaihoz, valamint a kiskorú felhasználókra vonatkozó kockázatok értékelésének hanyagsága.",
      "Ezt megelőzően a TikTok-ot az Egyesült Királyság adatvédelmi szabályozó hatósága 12,7 millió fontra bírságolta, mert szülői beleegyezés nélkül, jogellenesen dolgozta fel 1,4 millió 13 év alatti gyermek adatait."
    ],
    "commentSummary": [
      "A TikTok 345 millió eurós bírságot kapott az Európai Uniótól a gyermekek fiókjaira vonatkozó adatvédelmi előírások megsértése miatt.",
      "A döntést követő viták a bírságok mint fegyelmi intézkedések hatékonysága, az adatvédelmi törvények végrehajtása és a technológiai cégek adatbiztonságra vonatkozó kötelezettsége körül forognak.",
      "Egyes viták eltérnek a témától, és az EU görög pénzügyi válsággal és a menekültügyi helyzettel kapcsolatos kérdésekre térnek ki, amelyek nem kapcsolódnak közvetlenül az elsődleges hírekhez."
    ],
    "points": 367,
    "commentCount": 298,
    "retryCount": 0,
    "time": 1694779347
  },
  {
    "id": 37522106,
    "title": "Akiyoshi illúziós oldalai",
    "originLink": "https://www.ritsumei.ac.jp/~akitaoka/index-e.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37522106",
    "commentBody": "",
    "originSummary": [
      "Az Akiyoshi Kitaoka által kifejlesztett weboldal illúzióképek és -tervek gyűjteményét tartalmazza, magyarázatokkal és háttér-információkkal kiegészítve.",
      "Az alaptartalmon kívül az oldal híreket, versenyeket és az optikai illúziók témájához kapcsolódó fotókat is tartalmaz.",
      "Használati korlátozások vannak érvényben, amelyek kifejezetten tiltják a kereskedelmi célú alkalmazásokat, és a felhasználókat figyelmeztetik, hogy a tartalom szédülést okozhat."
    ],
    "commentSummary": [
      "A cikk Akiyoshi Kitaoka egy nemrégiben készült illúzióját tárgyalja, amely bemutatja, hogy az emberek különbözőképpen érzékelik a színes gyűrűket, és hogy az olyan változók, mint a szemüveg és a fejmozgás befolyásolják a hatást.",
      "A fórum résztvevői személyes tapasztalataikat osztják meg egymással, és megvitatják az optikai illúziók agyra gyakorolt hatását, felfedezve az illúzióművészet tágabb területét.",
      "Hangsúlyt fektetnek az illúziók lehetséges felhasználására olyan területeken, mint a reklám és a játék, ami aláhúzza az optikai illúziók folyamatos vonzalmát."
    ],
    "points": 349,
    "commentCount": 55,
    "retryCount": 0,
    "time": 1694781832
  },
  {
    "id": 37527773,
    "title": "Gazdasági szimulátor építése a semmiből",
    "originLink": "https://thomassimon.dev/ps/4",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37527773",
    "commentBody": "",
    "originSummary": [
      "A szerző egy gazdasági szimulációt hoz létre az alapoktól kezdve, és rögzíti a fejlődésüket.",
      "Egyetlen egységgel kezdik, és bevezetik az erőforrás-felhasználás és termelés elméleteit, majd fokozatosan több, a víztermelésre szakosodott dolgozót vonnak be.",
      "Bevezetik a pénzt, mint a megosztott erőforrások elszámolására szolgáló mechanizmust, ami érdekes dinamikát kölcsönöz a szimulációjuknak."
    ],
    "commentSummary": [
      "A Hacker News vitája egy gazdasági szimulátor létrehozására összpontosít, és a közgazdaságtannal, a pszichológiával és a valós adatokkal való kapcsolatát vizsgálja.",
      "A résztvevők kiemelik az összetett gazdasági rendszerek pontos modellezésének és szimulációjának kihívásait, hangsúlyozva a valós adatok beépítésének, valamint a rossz szereplők és a kizsákmányolás figyelembevételének fontosságát.",
      "A vita kitér a kapitalisták létezésére és szerepére a kapitalista gazdasági rendszereken kívül is. A vita kiemeli az olyan kulcsfontosságú kérdéseket, mint a vagyon koncentrációja és a gazdasági modellek korlátai."
    ],
    "points": 348,
    "commentCount": 144,
    "retryCount": 0,
    "time": 1694804772
  },
  {
    "id": 37524202,
    "title": "Shrinkflation Tracker",
    "originLink": "https://www.shrinkflation.io/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37524202",
    "commentBody": "",
    "originSummary": [
      "A Shrinkflation.io egy olyan weboldal, amelyet a zsugorodás ellen hoztak létre, amely jelenség során a termékek mérete csökken, miközben az árak változatlanok maradnak.",
      "Az oldal keresési naplót vezet a különböző termékekről és márkákról, amelyekről ismert, hogy zsugorodáson mentek keresztül, beleértve a Cadbury Dairy Milk, a Mars Maltesers és a Nestlé Kit Kat termékeket.",
      "A felhasználóknak lehetőségük van arra, hogy ezeket a termékeket és márkákat közvetlenül a weboldalról nyomon kövessék."
    ],
    "commentSummary": [
      "A Hacker News fóruma a zsugorodás köré csoportosuló különféle vitáknak ad otthont, amelyek középpontjában a zsugorodás termékminőségre gyakorolt hatása, a vállalkozások megtévesztő gyakorlatai, az átláthatóság és a jobb címkézés iránti igény, valamint a kapcsolódó etikai dilemmák állnak.",
      "További témák között szerepelnek a zsugorított áruk nyomon követésére szolgáló mechanizmusok, az állatkísérletekkel kapcsolatos kérdések, valamint az egészségtelen élelmiszerek megfizethetősége és egészségügyi hatásai.",
      "A zsugorítás azt a folyamatot jelenti, amikor a vállalatok csökkentik termékeik méretét vagy mennyiségét, miközben fenntartják vagy növelik az árat, gyakran a fogyasztók egyértelmű tájékoztatása nélkül."
    ],
    "points": 305,
    "commentCount": 211,
    "retryCount": 0,
    "time": 1694790402
  },
  {
    "id": 37526477,
    "title": "Kopia: Kopia: Gyors és biztonságos nyílt forráskódú mentőszoftver",
    "originLink": "https://kopia.io/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37526477",
    "commentBody": "",
    "originSummary": [
      "A weboldal bemutatja a Kopia nevű nyílt forráskódú mentőszoftvert, amely gyorsasággal, biztonsággal és több operációs rendszerrel való kompatibilitással büszkélkedhet a GUI (grafikus felhasználói felület) és a CLI (parancssori felület) segítségével.",
      "A Kopia megkönnyíti a titkosított, tömörített és deduplikált biztonsági mentéseket a felhasználó által preferált felhőalapú tároló használatával, és asztali alkalmazással rendelkezik a pillanatfelvételek, házirendek és fájlok helyreállításának kezelésére.",
      "A weboldal a GitHubon keresztül Pull Request munkafolyamaton keresztül várja a Kopia-hoz való hozzájárulásokat és hibajelentéseket, és a Slacken a Kopia funkcióiról és problémáiról szóló felhasználói vitákat folytat."
    ],
    "commentSummary": [
      "A Kopia, egy gyors és biztonságos nyílt forráskódú biztonsági mentőszoftver, néhány hátránya, köztük a helytelen tárolás és a lassú frissítések miatt vita tárgyát képezi.",
      "A felhasználók kihívásokat tapasztaltak a Kopiával kapcsolatban, többek között a biztonsági mentések befejezésének képtelenségét, a pontatlan előrehaladási mutatókat és a nagy adathalmazok visszaállításával kapcsolatos problémákat.",
      "A Kopia alternatívái, az offline biztonsági mentések előnyei és a biztonsági mentési szolgáltatások vállalati környezetben történő átfogó tesztelésének szükségessége is szóba került."
    ],
    "points": 268,
    "commentCount": 104,
    "retryCount": 0,
    "time": 1694799145
  },
  {
    "id": 37521240,
    "title": "Hogyan indít el egy folyamatot a Linux",
    "originLink": "https://iq.thc.org/how-does-linux-start-a-process",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37521240",
    "commentBody": "",
    "originSummary": [
      "A cikk azt a mechanizmust vizsgálja, amellyel a Linux elindít egy folyamatot és előkészíti a végrehajtási vermet, különös tekintettel arra, amikor egy folyamat meghívja az execve() parancsot.",
      "Alaposan megvizsgálja a bináris fájl részleteit, a gdb (GNU Debugger) segítségével az utasítások és a program verem elemzésére.",
      "A cikk azt is bemutatja, hogy a Linux kernel hogyan osztja ki és tölti fel a veremet információkkal, beleértve az argumentumlistákat és a környezeti változókat, ami hasznos betekintést nyújt az olyan eszközök számára, mint a 'Zapper'."
    ],
    "commentSummary": [
      "A Hacker News-on folyó vita témája annak megértése, hogy a Linux hogyan indít el egy folyamatot, és az ELF (Executable and Linkable Format) fejlécek értelmezése.",
      "Számos forrás és hivatkozás kerül megosztásra a témával kapcsolatos további elmélyült tanuláshoz.",
      "A vita része a kritika és a visszajelzés a többi felhasználó által a témában megosztott megjegyzések és információk minőségéről."
    ],
    "points": 265,
    "commentCount": 28,
    "retryCount": 0,
    "time": 1694776086
  },
  {
    "id": 37523992,
    "title": "A Google 93 millió dollárt fizet a megtévesztő helymeghatározás miatt",
    "originLink": "https://www.theguardian.com/technology/2023/sep/14/google-location-tracking-data-settlement",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37523992",
    "commentBody": "",
    "originSummary": [
      "A Google beleegyezett, hogy 93 millió dollárt fizet a helymeghatározási gyakorlatával kapcsolatos fogyasztók megtévesztésével kapcsolatos vádak miatt.",
      "A kaliforniai főügyész indította a pert, azzal vádolva a Google-t, hogy továbbra is gyűjti és tárolja a felhasználók helymeghatározási adatait, még akkor is, ha a felhasználók letiltották a helymeghatározási előzményeket.",
      "A megállapodás tartalmazza azt is, hogy a Google-nek átláthatóbbnak kell lennie a nyomon követési módszereivel kapcsolatban, és az adatvédelmi beállítások módosítása előtt beleegyezést kell kérnie."
    ],
    "commentSummary": [
      "A Google beleegyezett egy 93 millió dolláros megállapodásba a helymeghatározás megtévesztő gyakorlatával kapcsolatos vádak miatt, amelyet a Google éves bevételét tekintve kritizáltak, mivel nem elegendő a jövőbeli jogsértések megelőzésére.",
      "Vita alakult ki arról, hogy szigorúbb büntetésekre és jogszabályokra van szükség a magánélet védelmében, valamint kritikák hangzottak el a Google internetes dominanciájával és a megegyezéssel kapcsolatos jogorvoslatok hatékonyságával kapcsolatban.",
      "Aggályokat vetett fel a helymeghatározási előzmények beállításainak összetett kezelése, az eszközbeállítások egyes alkalmazások általi, nem engedélyezett módosítása, valamint a helymeghatározás aktiválásához szükséges Google-fiók megléte."
    ],
    "points": 230,
    "commentCount": 69,
    "retryCount": 0,
    "time": 1694789636
  },
  {
    "id": 37528816,
    "title": "Az \"inverz vakcina\" lehetőséget mutat az MS és más autoimmun betegségek kezelésére",
    "originLink": "https://pme.uchicago.edu/news/inverse-vaccine-shows-potential-treat-multiple-sclerosis-and-other-autoimmune-diseases",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37528816",
    "commentBody": "",
    "originSummary": [
      "A Chicagói Egyetem Pritzker School of Molecular Engineering kutatói létrehoztak egy \"inverz vakcinát\", amely potenciálisan gyógyíthatja az autoimmun betegségeket, köztük a szklerózis multiplexet és az I. típusú cukorbetegséget.",
      "A hagyományos vakcinákkal ellentétben, amelyek az immunrendszert a vírusok vagy baktériumok azonosítására és leküzdésére képezik, ez az új vakcina megszünteti az immunrendszer egy adott molekula felismerését, elkerülve az autoimmun reakciókat.",
      "Az \"inverz vakcina\" a máj folyamatát használja fel arra, hogy a romló sejtek molekuláit \"ne támadjon\" címkével jelölje meg. Az előzetes laboratóriumi tesztek azt mutatják, hogy a vakcina hatékonyan fordította vissza a szklerózis multiplexszel kapcsolatos autoimmun reakciókat, és a biztonsági vizsgálatok már megkezdődtek."
    ],
    "commentSummary": [
      "A Chicagói Egyetem kutatói kifejlesztettek egy \"inverz vakcinát\", amelynek célja az autoimmun betegségek kezelése az immunrendszer problémás molekulákra vonatkozó memóriájának megszüntetésével.",
      "Ez a vakcina a jelenlegi immunszuppressziós terápiák pontosabb alternatíváját kínálja, és hatékonyabb eredményeket ígér.",
      "Továbbra is aggályok merülnek fel a lehetséges mellékhatásokkal, valamint az autoimmun betegségek szélesebb körű megértésével kapcsolatban. A himlő elleni védőoltás szerepe és az immunitás fenntartásának jelentősége is vita tárgyát képezi."
    ],
    "points": 198,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1694810351
  },
  {
    "id": 37524158,
    "title": "Kalifornia törvényjavaslatot nyújt be az adatbrókerek adatainak könnyebb törléséről",
    "originLink": "https://www.latimes.com/politics/story/2023-09-14/california-bill-delete-online-personal-data",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37524158",
    "commentBody": "",
    "originSummary": [
      "A kaliforniai törvényhozás elfogadta a Delete Act nevű törvényjavaslatot, amelynek célja, hogy a fogyasztók számára egyszerűsítse a személyes adatok törlésének folyamatát az adatbrókereknél.",
      "A Kaliforniai Adatvédelmi Ügynökség feladata lenne egy olyan rendszer létrehozása, amelynek segítségével a fogyasztók egyetlen kérelemmel kérhetnék adataik eltávolítását az adatbrókerektől, növelve ezzel az átláthatóságot és a személyes adatok feletti ellenőrzést.",
      "Egyes vállalkozások és iparági szövetségek ellenezték a törvényjavaslatot, hivatkozva a nem szándékolt következményekre és a kisvállalkozásoknak okozott lehetséges károkra. A törvényjavaslat a kormányzó jóváhagyására vár."
    ],
    "commentSummary": [
      "Kalifornia elfogadott egy olyan jogszabályt, amely arra összpontosít, hogy az egyének könnyen törölhessék adataikat az adatbrókereknél, bár kivételt képez az olyan vállalatok, mint a Google és a Facebook, amelyek már kötelesek kérésre törölni az adatokat.",
      "A törvényjavaslat fő célja a személyes adatok ellenőrzésének és a magánélet védelmének javítása, ugyanakkor aggályok merültek fel a hatékonyságával és egyes vállalkozások mentesítésével kapcsolatban.",
      "A vita olyan témákat is bemutat, mint az adatértékesítés, a hitelpontszámok és a meglévő szabályozások hatékonysága. A kaliforniai fogyasztói adatvédelmi törvény (CCPA), annak következményei, lehetséges kiskapuk és az adatok törlésének összetettsége is szóba kerül. A törvényjavaslat kötelezi az ügynökségeket, hogy hozzanak létre törlési mechanizmust, és szankcionálja az előírások be nem tartását."
    ],
    "points": 188,
    "commentCount": 70,
    "retryCount": 0,
    "time": 1694790212
  },
  {
    "id": 37532355,
    "title": "Hogyan nőtt az Instagram 14 millió felhasználóra mindössze 3 mérnökkel",
    "originLink": "https://engineercodex.substack.com/p/how-instagram-scaled-to-14-million",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37532355",
    "commentBody": "",
    "originSummary": [
      "Az Instagram jelentős növekedést ért el, alig több mint egy év alatt elérte a 14 millió felhasználót, mindössze három mérnökből álló kis csapattal.",
      "Ezt három vezérelv és egy megbízható technológiai stack elfogadásával érték el, amely olyan technológiákat tartalmaz, mint az AWS, Ubuntu Linux, EC2, NGINX, Django, Gunicorn, Postgres, S3, Redis, Memcached, pyapns és Gearman.",
      "Az infrastruktúra hatékonyságának és megbízhatóságának biztosítása érdekében olyan felügyeleti eszközöket is igénybe vettek, mint a Sentry, a Munin, a Pingdom és a PagerDuty."
    ],
    "commentSummary": [
      "A cikk foglalkozik az Instagram lenyűgöző teljesítményével, hogy mindössze három mérnökből álló kis csapattal 14 millió felhasználóra tudott bővülni, ami jól szemlélteti a kis létszámú csapatokban rejlő hatékonyságot a startupoknál.",
      "Kiemeli az Instagram egyszerű, de hatékony architektúráját, és tárgyalja a mikroszolgáltatások alkalmazását az alkalmazásfejlesztésben, utalva azok előnyeire és kihívásaira.",
      "A szöveg kitér az adatbázisok skálázásának gyakorlati következményeire és az Instagram adatbázis-architektúrájára is, valamint megemlíti a Roblox mikroszolgáltatások megvalósításával kapcsolatos kihívásait."
    ],
    "points": 177,
    "commentCount": 103,
    "retryCount": 0,
    "time": 1694843484
  },
  {
    "id": 37531801,
    "title": "Subdomain.center - egy domain összes aldomainjének felfedezése",
    "originLink": "https://www.subdomain.center/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37531801",
    "commentBody": "",
    "originSummary": [
      "A Subdomain Center az ARPSyndicate által kifejlesztett kutatási projekt, amely olyan eszközöket használ, mint az Apache Nutch és az OpenAI Embedding Models, hogy minden más szolgáltatásnál több aldomaint fedezzen fel.",
      "A visszaélések elkerülése érdekében a szolgáltatás percenként legfeljebb három lekérdezésre korlátozza a felhasználókat, és a megnövekedett kereslet miatt előfordulhat, hogy leállásra kerül sor.",
      "A Subdomain Center mellett az ARPSyndicate egy parancssori segédeszközt, a Puncia-t és más, az exploit-megfigyeléssel, a támadási felület kezelésével, a sebezhetőségi szkenneléssel és a nyílt forráskódú hírszerzéssel kapcsolatos erőforrásokat kínál."
    ],
    "commentSummary": [
      "A fórumon megvitatják az aldomainekhez kapcsolódó sebezhetőségeket és kockázatokat, és a felhasználók megosztják egymással a különböző felderítési módszereket, például az IPv4 internet átvizsgálását, a tanúsítványok átláthatósági naplóinak felhasználását és a saját fejlesztésű eszközök használatát.",
      "A nyilvánosan látható aldomainek adatvédelmi és biztonsági kérdései, valamint a belső aldomainek biztosításának nehézségei aggodalomra adnak okot, és azt tanácsolják, hogy a további biztonság érdekében óvatosan járjunk el a portok megnyitásakor és a szolgáltatások felfedésekor.",
      "A fokozott biztonság érdekében javasolt a portok kopogtatásának bevezetése vagy a Tor használata, valamint az IPv6-nak az IPv4-gyel szembeni előnyei ezekben az esetekben."
    ],
    "points": 173,
    "commentCount": 75,
    "retryCount": 0,
    "time": 1694835147
  },
  {
    "id": 37521931,
    "title": "Igen, az Android 14 továbbra is lehetővé teszi a rendszer tanúsítványainak módosítását.",
    "originLink": "https://www.g1a55er.net/Android-14-Still-Allows-Modification-of-System-Certificates",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37521931",
    "commentBody": "",
    "originSummary": [
      "A blogbejegyzés megkérdőjelezi Tim Perry állítását, miszerint az Android 14 korlátozza a rendszer-tanúsítványok minden módosítását, és bizonyítékot szolgáltat arra, hogy a módosítások továbbra is elvégezhetők, és a felhasználók visszavonhatják a rendszer-tanúsítványok bizalmát.",
      "A szerző azt állítja, hogy a fejlesztők az ADB (Android Debug Bridge), egy sokoldalú parancssoros eszközön keresztül képesek megbízható rendszer-tanúsítványokat hozzáadni az Androidot futtató eszközzel való kommunikációhoz.",
      "Bár elismeri az Android 14-gyel kapcsolatos változásokat, arra a következtetésre jutott, hogy a felhasználó szabadsága megmarad, és ezek a módosítások segítik a tanúsítványtároló fedélzeti frissítéseit, ami az Android 14-gyel kompatibilis eszközök várható frissítését jelenti."
    ],
    "commentSummary": [
      "A vita kiemeli az Android 14 rendszer tanúsítványának módosítását, valamint a rootolás következményeit és lehetséges előnyeit, beleértve a bizonyos funkciókhoz és alkalmazásokhoz való hozzáférést mások rovására.",
      "A felhasználók alternatív módszereket, például az ADB + Frida vagy a Magisk + safetynet-fix módszereket értékelnek a módosítások elvégzésére és a felhasználói szabadság és az eszközvédelem egyensúlyának megteremtésére.",
      "A poszt hangsúlyozza a felhasználói tulajdonjog fontosságát az Android és az Apple készülékek növekvő ellenségeskedésével szemben. Dicséri az Apple biztonsági intézkedéseit, ugyanakkor javasolja a figyelmeztetésekkel ellátott fejlesztői mód beépítését."
    ],
    "points": 164,
    "commentCount": 64,
    "retryCount": 0,
    "time": 1694780823
  },
  {
    "id": 37528453,
    "title": "Az USA kontra Google első hete - Az alapértelmezések mindent jelentenek, és senki sem szereti a Binget",
    "originLink": "https://www.theverge.com/2023/9/15/23875342/justice-department-google-antitrust-search-trial-week-one-recap",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37528453",
    "commentBody": "",
    "originSummary": [
      "Az amerikai kormány trösztellenes eljárást indított a Google ellen, azzal vádolva a technológiai óriást, hogy a tisztességes verseny helyett erőltetett alkukkal alapozta meg keresőmotor-piaci dominanciáját.",
      "Az ügy a Google-nak a monopolhelyzetének fenntartása érdekében alkalmazott, a defaultokat és az adatfelhasználást érintő gyakorlatát fogja körüljárni, és azt is megvizsgálja, hogy ezek az intézkedések a fogyasztók számára előnyösek-e, vagy csak a Google érdekeit szolgálják.",
      "A tárgyalás a Google erőfölénye miatt a fogyasztóknak és a hirdetőknek okozott lehetséges károkat vizsgálja, és a bíró döntésének lényege az lesz, hogy az olyan ingyenes termékek, mint a keresőmotorok, valóban okozhatnak-e kárt a fogyasztóknak."
    ],
    "commentSummary": [
      "Az USA kontra Google per azt vizsgálja, hogy az alapértelmezett keresőmotorrá válásért való fizetés megszegi-e a versenyszabályokat, és célja, hogy egyértelműbb irányelveket határozzon meg.",
      "A kritikusok szerint a munkavállalói nyilatkozatokkal visszaélnek, és elterelik a figyelmet a valódi versenyellenes gyakorlatokról. A fő aggályok a Google dominanciája, a hatékony verseny hiánya, valamint a többi keresőmotorra, például a Bingre és a Mozillára gyakorolt hatás miatt merülnek fel.",
      "A felhasználók elégedetlenségüket fejezik ki a jelenlegi alternatívákkal kapcsolatban, és jobb keresőmotorok iránti igényüket fejezik ki. További megvitatott témák az internethasználat, a Chromium függetlensége és a Mozilla pénzügyi életképessége."
    ],
    "points": 163,
    "commentCount": 136,
    "retryCount": 0,
    "time": 1694808221
  },
  {
    "id": 37525348,
    "title": "Hogyan tároljunk egy sakkpozíciót 26 bájtban bit-szintű mágiával (2022)",
    "originLink": "https://www.ezzeriesa.com/index/Writing%20efa7772a3ae64a8193c7ef981ac619fc/Compressing%20chess%20positions%20for%20fun%20and%20profit%20df1fdb5364eb42fdac11eb23b25e9605.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37525348",
    "commentBody": "",
    "originSummary": [
      "A cikk egy innovatív technikát mutat be egy sakkpozíció kompakt tárolására 26 bájtban.",
      "A módszer kihasználja a királyok és gyalogok egyedi elhelyezését az elfogások, a sáncolás képessége és az en passant cél, valamint az előléptetések megkülönböztető kódolása érdekében, így csökkentve a szükséges tárhelyet.",
      "A tárolási technika magában foglalja a bitképek és a rendezés használatát a pozíció különböző aspektusainak hatékony jellemzésére, lehetővé téve ezáltal egy sakkpozíció tárolását mindössze körülbelül 26 bájtban."
    ],
    "commentSummary": [
      "A cikkek a sakkpozíciók tömörítésének és tárolásának módszereivel foglalkoznak, hogy az adatigényt csökkentsék, miközben a fontos információk megmaradnak.",
      "Különböző stratégiákkal foglalkozik, mint például a bit-szintű mágia, a blokklánc technológia használata, a lépéstörténet tárolása, a memória-visszahívás és a kompakt kódolás kifejezetten a sakkmotorok számára. Kiemeli továbbá a tömörített formátumok előnyeit a JSON-nal szemben.",
      "A cél a sakk-adatbázisok és alkalmazások teljesítményének, tárolási és feldolgozási hatékonyságának növelése."
    ],
    "points": 161,
    "commentCount": 169,
    "retryCount": 0,
    "time": 1694794554
  },
  {
    "id": 37527928,
    "title": "Könyvek játékfejlesztőknek",
    "originLink": "https://mrelusive.com/books/books.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37527928",
    "commentBody": "",
    "originSummary": [
      "A poszt a játékfejlesztők számára ajánlott könyvek részletes listáját tartalmazza, amely számos, a területhez kapcsolódó témát ölel fel.",
      "Ezek a könyvek értékes betekintést nyújtanak a számítógépes grafikába, a játékprogramozásba, a mesterséges intelligenciába, valamint a fizika és a dinamikai szimulációba.",
      "A kötetek egyéb témái között szerepel a tervezés és alkalmazás, a lineáris algebra, az optimalizálás és az algoritmusok, átfogó tudásbázist nyújtva a feltörekvő és a már befutott játékfejlesztők számára."
    ],
    "commentSummary": [
      "A fórumbeszélgetés a játékfejlesztéssel kapcsolatos könyvek gyűjteménye körül zajlik, további olvasmányokra vonatkozó ajánlásokkal.",
      "Van egy tisztelgő és visszaemlékező rész egy elismert, elhunyt játékfejlesztőnek, ami a területre gyakorolt hatására utal.",
      "A vita a kvaternionokra helyezi a hangsúlyt; ez egy olyan komplex számrendszer, amelyet a felhasználók a játékfejlesztésben hasznosnak találnak a 3D-s forgások ábrázolására."
    ],
    "points": 158,
    "commentCount": 50,
    "retryCount": 0,
    "time": 1694805518
  },
  {
    "id": 37529359,
    "title": "Johnny Cash Has Been Everywhere (Ember)",
    "originLink": "http://www.johnnycashhasbeeneverywhere.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37529359",
    "commentBody": "",
    "originSummary": [
      "Iain Mullan a MusixMatch, a Toma.HK és a Covers FM segítségével a 2012-es londoni Music Hack Day során egy innovatív hacket készített Johnny Cash \"I've Been Everywhere\" című dalával.",
      "A hack egy olyan térképet tartalmaz, amely a legendás művész, Johnny Cash által bejárt földrajzi területet mutatja be, ahogyan azt a dalában leírta.",
      "Ez a kreatív földrajzi ábrázolás a Google és az INEGI térképi adatainak felhasználásával kerül megjelenítésre."
    ],
    "commentSummary": [
      "A cikk kiemeli a \"Johnny Cash Has Been Everywhere (Man)\" nevű weboldalt, amely Johnny Cash \"I've Been Everywhere\" című dalában említett összes helyszínt feltünteti.",
      "A cikk felhasználói vitái a kapcsolódó témák körül forognak, beleértve az említett úti célok közötti legrövidebb utat.",
      "A beszélgetés olyan személyes témákat is érint, mint Johnny Cash függőségi problémái."
    ],
    "points": 156,
    "commentCount": 28,
    "retryCount": 0,
    "time": 1694813409
  },
  {
    "id": 37524890,
    "title": "Az LLM-ek optimalizálása az adathalmaz szempontjából",
    "originLink": "https://sebastianraschka.com/blog/2023/optimizing-LLMs-dataset-perspective.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37524890",
    "commentBody": "",
    "originSummary": [
      "A cikk a nagyméretű nyelvi modellek (LLM) optimalizálásának stratégiáját vizsgálja a gondosan kiválasztott adathalmazok finomhangolásával.",
      "Részletesen ismerteti egy 7B paraméteres nyelvi modell finomhangolásának folyamatát a LIMA adathalmazon, és megemlíti az automatikus minőségszűrés lehetőségeit.",
      "A cikk utal a NeurIPS LLM Efficiency Challenge-re is, és hangsúlyozza mind az LLM által generált, mind az ember által kurált adathalmazok jelentőségét."
    ],
    "commentSummary": [
      "A cikk a nagy nyelvi modellek (LLM) finomításának koncepcióját vizsgálja, kisebb, kiváló minőségű adathalmazok kialakítására használva azokat.",
      "A folyamat során egy széles körű modellt képeznek ki különböző adatokon, majd a forrásadatokat a nem szennyezett adatkészletekre desztillálják, és ezt követően kisebb modelleket képeznek ki rajtuk. A cél olyan modellek kifejlesztése, amelyek könnyebben hozzáférhetőek, gyorsabban következtetnek, és lehetőleg mentesülnek a szerzői jogi problémáktól.",
      "Az LLM-ek intelligenciájának növelésére szolgáló egyéb technikák, mint például a keresés kiterjesztett generálása (RAG) és a finomhangoló adathalmazok felhasználása a nyelvi fordításhoz, szintén megvitatásra kerülnek."
    ],
    "points": 129,
    "commentCount": 23,
    "retryCount": 0,
    "time": 1694792949
  }
]
