[
  {
    "title": "손흥민, 해리 케인 대체 한수: 토트넘 매니저 포체티노",
    "originLink": "https://www.chosun.com/sports/world-football/2023/11/06/BWNYQHCAQRIDTY2UPXNOL6AT3E/",
    "originBody": "",
    "originSummary": [
      "토트넘 감독 안토니오 포체티노는 해리 케인 선수의 이탈로 생긴 공백을 메우는 것은 불가능하며 손흥민 선수가 유일한 현실적인 대체 선수라고 밝혔습니다.",
      "포체티노 감독은 손 선수의 중앙 공격수 역할과 시즌 25골 이상을 넣을 수 있는 능력을 칭찬했습니다.이후 토트넘은 자메스 매디슨, 브레논 존슨 등을 영입하여 팀을 강화했습니다.",
      "호세 무리뉴, 안토니오 콘테 같은 감독들로부터 비판을 받았지만, 손 선수는 그의 기술을 성공적으로 증명, 토트넘이 현재 EPL 최고 팀인 지위에 크게 기여했습니다. 그러나 토트넘은 여전히 중앙 공격수를 찾고 있으며 에레디비시의 페이네메디 팀에서 활약하는 젊은 공격수 산티아고 헤르메네스 선수를 주목하고 있다는 소문이 있습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "토트넘 감독인 안토니오 포체티노는 해리 케인의 퇴장이 남긴 공백을 채우는 것은 불가능하며, 손흥민이 유일한 현실적인 대체품이라고 밝혔습니다.",
      "손흥민의 성공적인 중앙 공격수 역할에 대한 조세 무리뉴와 안토니오 콘테 같은 감독들의 비판에도 불구하고, 손흥민은 경기장에서 자신의 기량을 성공적으로 입증해 토트넘의 현재 EPL 최고 팀의 순위에 크게 기여했습니다.",
      "그러나 토트넘은 여전히 중앙 공격수를 찾고 있으며, 에레디비시팀 페이에노르트에서 활동하는 젊은 공격수인 상티아고 히메네즈를 눈여겨보고 있다는 소문이 있습니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699284038364
  },
  {
    "title": "질병청, 빈대에 저항성 보인 기존 살충제 대신 대체 살충제 사용 검토",
    "originLink": "https://www.yna.co.kr/view/AKR20231106156000530",
    "originBody": "",
    "originSummary": [
      "한국질병관리청(KDCA)은 현재 피레스로이드계 살충제에 저항성을 보이는 나라에서 널리 퍼져있는 침팬에 대해 교체 살충제 사용을 검토하고 있다.",
      "저항성 문제로 인해 다른 나라들이 이용하고 있는 다른 해결책을 사용하기 위해 환경부와 함께 다른 살충제 사용에 대한 논의가 활발히 진행되고 있다."
    ],
    "commentBody": "",
    "commentSummary": [
      "한국 질병관리청(KDCA)은 현재 피레스로이드계 살충제에 저항력을 보이는 국내 침대벌레에 대처하기 위해 대체 살충제 사용을 고려하고 있습니다.",
      "저항성 문제로 인해 다른 국가들이 다른 해결책을 사용하게 된 것을 인식한 KDCA는 환경부와 함께 대체 살충제 사용에 대해 적극적으로 논의하고 있습니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699284038364
  },
  {
    "title": "비타민 C의 다양한 건강 효과: 노화방지부터 암 치료까지",
    "originLink": "https://kormedi.com/1634230/%ED%99%98%EC%A0%88%EA%B8%B0%EC%97%90-%EA%BC%AD-%EC%B1%99%EA%B8%B0%EB%9D%BC%EB%8A%94-%EB%B9%84%ED%83%80%EB%AF%BC-c-%EB%8C%80%EC%B2%B4-%EB%AD%90%EA%B0%80-%EC%A2%8B%EA%B8%B8%EB%9E%98/",
    "originBody": "",
    "originSummary": [
      "오렌지에 풍부한 비타민 C는 노화 예방, 면역체계 강화, 그 외 건강에 도움이 됩니다. 이는 콜라겐을 합성하는 데 중요한 요소이며, 이로 인해 피부의 건강과 탄력이 유지됩니다.",
      "비타민 C는 항산화제로 작용하여 몸 안의 과도한 활성 산소를 줄임으로써 면역 체계를 강화해줍니다. Anticancer Research의 연구에 따르면, 비타민 C의 고용량 섭취는 특히 유방암 치료를 지원할 수 있습니다.",
      "팔색조, 감귤류, 키위, 브로콜리, 토마토, 미니 양배추 등 비타민 C가 풍부한 음식을 꾸준히 섭취하는 것이 건강에 좋습니다. 미국 국립 보건 연구소에 따르면 성인 여성은 하루에 비타민 C를 75mg, 성인 남성은 90mg 섭취하는 것이 좋습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "오렌지에 풍부한 비타민 C는 노화 예방, 면역 체계 개선 등의 건강 이익에 중요한 역할을 합니다.",
      "비타민 C는 콜라겐 합성에 도움이 되어 피부 건강 및 탄력 유지에 필수적이며, 과도한 활성 산소를 감소시켜 면역 체계를 강화하는 항산화제 역할을 합니다.",
      "'안티캔서 리서치'의 연구에 따르면, 비타민 C의 고용량 복용은 특히 유방암 치료를 지원하며, 철분 흡수를 돕고 연령 관련 황반변성을 지연시킬 수 있습니다. 단, 식단이나 보충제를 통한 고용량 섭취는 어려울 수 있습니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699284038364
  },
  {
    "title": "기존 살충제에 면역력 가진 빈대, 대체 살충제 개발을 위한 질병관리청의 노력",
    "originLink": "https://www.nocutnews.co.kr/news/6041350",
    "originBody": "",
    "originSummary": [
      "한국 질병관리본부(KCDC)는 현재 살충제에 대해 저항성을 가진 침대벌레와 싸우기 위한 대체 살충제를 탐구하고 있습니다.",
      "KCDC는 벌레의 침략을 감시하고 다른 침대 벌레 종을 연구하기 위해 해충 퇴치 전문가들과 업계 관계자들과 함께 업무군을 구성하고 있습니다.",
      "이런 조치들은 벌레 저항성의 급증에 대응하기 위한 것이며, KCDC의 노력은 새로운 비포에 대한 연구로 이어질 것입니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "한국질병관리본부(KCDC)는 현재의 살충제에 저항력을 가진 바퀴벌레와 싸우기 위한 대체 살충제를 탐구하고 있습니다.",
      "KCDC는 감염을 모니터링하고 다른 바퀴벌레 종을 연구하기 위해 해충 통제 전문가와 산업 내부자와 협력하여 작업팀을 구성하고 있습니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699284038364
  },
  {
    "title": "질병관리청, 빈대 살충제 내성 문제로 대체 살충제 검토 공고",
    "originLink": "https://m.segye.com/view/20231106522561",
    "originBody": "",
    "originSummary": [
      "한국 질병관리청(KDCA)은 이전에 침대벌레 퇴치에 사용되던 피레스로이드계 살충제에 대한 저항성을 보이는 주요 침대벌레에 대해 대체 살충제의 사용을 고려하고 있습니다.",
      "이는 국내 침대벌레 상황에 대해 해충 퇴치 전문가들과의 토론 후 발표된 것으로, 환경부와 상의하여 이러한 대체 살충제의 사용을 검토하고 있다고 첨언하였습니다.",
      "침대벌레 문제는 올해 갑자기 생긴 것이 아니며, 해충 퇴치 회사들은 지난 달부터 숙박시설에서의 침대벌레 관련 불만을 여러 차례 처리해야 했습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "대한민국 질병관리청(KDCA)이 기존에 사용되던 피레스로이드계 살충제에 내성을 보이는 침대벌레에 대응하기 위해 대체 살충제 사용을 검토 중임을 발표하였습니다.",
      "이는 전국 침대벌레 상황에 대한 전문가들의 토론 후에 발표되었으며, 환경부와 협의하여 대체 살충제 사용을 검토하고 있다고 KDCA는 덧붙였습니다.",
      "해당 침대벌레 문제는 올해 갑자기 발생한 것이 아니며, 지난 달부터 숙박 시설에서의 침대벌레 관련 불만 사항을 처리하는 해충 퇴치 업체가 많았습니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699284038364
  },
  {
    "title": "빈대 저항성 상승으로 인한 대체 살충제 검토…피부 감염 걱정",
    "originLink": "http://www.kukinews.com/newsView/kuk202311060310",
    "originBody": "",
    "originSummary": [
      "한국의 보건 당국자들이 침대벌레의 기존 치료제인 피레스로이드계 살충제에 대한 저항성 증가로 인해 대체 살충제 사용을 고려하고 있습니다.",
      "침대벌레는 병을 전파하지 않지만, 물림으로 인한 피부 감염 가능성으로 인해 침대벌레의 발생은 우려를 일으킵니다.",
      "벌레 물림을 완화하기 위한 조치로는 해당 부위를 깨끗이 청소하고 적절한 약을 바르는 것이 포함됩니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "한국의 보건 당국은 침대벌레에 대한 전통적인 처리방법인 피레스로이드계 살충제에 대한 저항성 증가로 인해 대체 살충제로 전환하는 것을 고려하고 있습니다.",
      "침대벌레는 병을 전파하지 않지만, 부작용으로 피부 감염을 일으킬 수 있어 문제가 됩니다.",
      "이물질이 들어간 부위를 청소하고 적절한 약물을 사용하는 척추병 고약을 완화시키는 조치들이 있습니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699284038364
  },
  {
    "title": "벌레의 약물내성 강화…질병청, 새로운 살충제 사용 검토",
    "originLink": "https://news.nate.com/view/20231106n36180?mid=n0600",
    "originBody": "",
    "originSummary": [
      "2023년 11월 6일에 한국 질병관리청(KCDC)은 지역 침대버그가 일반적으로 사용되는 피레스로이드곤충제에 저항성을 개발했다고 보고했습니다.",
      "KCDC는 환경부와 협의하여 대안적인 해결책을 고려하고 있습니다.",
      "숙박사업체들로부터의 침대버그에 대한 불만이 증가하고 있으며, 이는 침대버그의 생존력과 저항성이 증가하고 있음을 보여줍니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "2023년 11월 6일, 한국 질병관리청(KCDC)은 본 지역의 침대벌레가 일반적으로 사용되는 피레스로이드곤충제에 대해 저항성을 키우고 있다고 보고했습니다.",
      "질병관리청은 환경부와 협의하여 대체 방안을 고려하고 있습니다.",
      "이는 숙박업에서 침대벌레에 대한 불만이 증가하고 있음을 보여주며, 이는 그들의 생존률과 저항성 증가를 강조합니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699284038364
  },
  {
    "title": "퍼즐 해결을 통한 의심스러운 활동으로부터 계정 보호를 위한 새로운 보안 프로토콜 도입",
    "originLink": "https://hypebeast.kr/2023/11/dog-hair-beats-cashmere-in-almost-every-way",
    "originBody": "",
    "originSummary": [
      "이 텍스트는 사용자가 스팸과 의심스러운 활동으로부터 계정을 보호하기 위해 퍼즐을 풀어 인간임을 확인하는 보안 프로토콜에 대한 언급입니다.",
      "다양한 언어로 지원되는 안내가 제공된다고 나타났습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "이 글은 사용자가 사람임을 확인하기 위해 퍼즐을 풀어야 하는 보안 프로토콜에 대한 것입니다.",
      "이는 그들의 계정이 스팸과 의심스러운 활동으로부터 보호받도록 하기 위함입니다.",
      "지시사항은 여러 언어로 사용할 수 있음을 나타냅니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699284038364
  },
  {
    "title": "가뭄 대응과 안정적 용수 공급 위해 환경부, 대체수자원 전략 개발",
    "originLink": "https://www.sedaily.com/NewsView/29X4Q7D2WK",
    "originBody": "",
    "originSummary": [
      "한국 환경부는 증가하는 가뭄과 수요에 대응하기 위해 종합적인 급수 전략을 개발 중입니다.",
      "이 계획은 산업용 및 생활용 수도를 포함하며, 하수 재이용 및 해수 담수화와 같은 대체 수원에 관한 전략을 포함할 예정입니다.",
      "이 전략은 연말까지 발표될 예정입니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "한국 환경부는 증가하는 가뭄과 물 수요에 대응하고자 종합적인 수자원 공급 전략을 개발 중입니다.",
      "이 계획은 산업과 가정용 수자원 사용을 포함하며, 하수 재사용 및 해수 염제화와 같은 대체 수원을 활용하는 전략이 포함됩니다.",
      "이 전략은 올해 말까지 발표될 예정입니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699284038364
  }
]
