[
  {
    "title": "New Apple Vision Pro Onboarding Videos Revealed in Latest visionOS Beta",
    "originLink": "https://www.macrumors.com/2023/11/15/apple-vision-pro-onboarding-videos-visionos-beta-6/",
    "originBody": "",
    "originSummary": [
      "Apple has released the sixth beta of visionOS, specifically for the Vision Pro headset.",
      "The update includes tutorial videos explaining how users can interact with visionOS and set up their customized \"Persona.\"",
      "The Vision Pro headset is expected to launch in early 2024, with a price tag of $3,500, and will likely be released in the UK and Canada later that year."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700054658198
  },
  {
    "title": "Apple Releases New Videos Showcasing Interface and Features of Vision Pro Headset",
    "originLink": "https://www.techradar.com/computing/virtual-reality-augmented-reality/new-apple-vision-pro-videos-give-us-a-closer-look-at-the-sci-fi-visionos",
    "originBody": "",
    "originSummary": [
      "Apple has released new demo videos of its Vision Pro mixed-reality headset, running on the visionOS software.",
      "The videos showcase features like 'Persona Enrollment' for FaceTime calls and 'input training' for app navigation using eye and finger movements.",
      "The videos suggest Apple's commitment to positioning the Vision Pro as a next-generation computing platform, with an expected release in early 2024."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700054658198
  },
  {
    "title": "Telegram Unveils Translucent Design and Voice Input for Upcoming Apple Vision Pro App",
    "originLink": "https://www.phonearena.com/news/Telegram-teases-upcoming-app-version-tailored-for-the-Apple-Vision-Pro_id152620",
    "originBody": "",
    "originSummary": [
      "Telegram is launching a version of its messaging app specifically designed for Apple's Vision Pro headset.",
      "The app will have a translucent design, a sidebar for easy navigation, and features like media, audio messages, and AR stickers.",
      "Voice input capabilities will be available through Siri dictation and the system's virtual keyboard.",
      "Telegram has time to make any necessary adjustments to the app before the Vision Pro headset is released in 2024."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700054658198
  },
  {
    "title": "Apple's Vision Pro Beta 6 Introduces How-To Video for Persona Enrollment Setup",
    "originLink": "https://forums.appleinsider.com/discussion/234334",
    "originBody": "",
    "originSummary": [
      "Apple's Vision Pro, currently in beta, includes a video tutorial for setting up the view of your eyes on the exterior display.",
      "The feature called Persona Enrollment enables complete eye coverage by the headset while displaying a recording of the user's eyes on the front display.",
      "The setup process, which takes about 30 seconds to complete, is guided by the tutorial, along with suggestions to try different Light Seal cushions for adjusting eye-to-display distance. Apple intends to release Vision Pro in early 2024."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700054658198
  },
  {
    "title": "Apple Music Replay 2023: Discover Your Top Songs, Albums, and Artists of the Year",
    "originLink": "https://9to5mac.com/2023/11/14/visionos-beta-6-onboarding-videos/",
    "originBody": "",
    "originSummary": [
      "Apple Music Replay 2023 is a feature that helps users discover their favorite songs, albums, and artists from the year.",
      "Users can access their top music content from the year through this feature.",
      "It allows users to reflect on their music preferences and trends for 2023."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700054658198
  },
  {
    "title": "Apple Vision Pro's Spatial Video: An Impressive and Expensive 3D Viewing Experience",
    "originLink": "https://macdailynews.com/2023/11/14/spatial-video-looks-like-apple-vision-pros-first-killer-app/",
    "originBody": "",
    "originSummary": [
      "Apple's iPhone 15 Pro features new spatial computing technology that enables users to capture and watch 3D spatial videos on the upcoming Apple Vision Pro headset.",
      "The videos provide an immersive and lifelike experience, but the headset's hefty price of $3,499 may limit its adoption among consumers.",
      "Nevertheless, the technology is remarkable, and the interface is designed to be easy to use."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700054658198
  },
  {
    "title": "Telegram Reveals Translucent Design and Immersive Features for Apple's Vision Pro AR/VR Headset",
    "originLink": "https://timesofindia.indiatimes.com/gadgets-news/watch-heres-how-telegram-app-will-look-on-apple-vision-pro/articleshow/105219613.cms",
    "originBody": "",
    "originSummary": [
      "Apple is set to release its AR/VR headset, Vision Pro, in the US in 2024 and is urging developers to create apps for the device.",
      "Telegram is the first app to demonstrate its concepts for the headset, with its founder sharing a video showcasing how the messaging app will look on Vision Pro.",
      "The app will feature a translucent design, immersive video playback, and animated emoji characters. Users can send messages using a virtual keyboard or dictation through Siri."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700054658198
  },
  {
    "title": "Apple Unveils Onboarding Videos for Vision Pro Mixed Reality Headset in Latest Beta Release",
    "originLink": "https://www.benzinga.com/news/23/11/35797997/apples-visionos-beta-6-release-unveils-onboarding-videos-for-its-highly-anticipated-mixed-reality-he",
    "originBody": "",
    "originSummary": [
      "Apple has released onboarding videos in the latest beta version of its visionOS operating system for its upcoming Vision Pro mixed reality headset.",
      "The videos help users learn how to navigate the interface and use different gestures with the headset.",
      "The stable version of visionOS is expected to be released soon, and the Vision Pro headset will be available in stores in early 2024."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700054658198
  }
]
