[
  {
    "id": 39844936,
    "title": "أصبح تطوير تطبيقات جنوم أسهل مع Swift",
    "originLink": "https://www.swift.org/blog/adwaita-swift/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39844936",
    "commentBody": "",
    "originSummary": [
      "يستكشف المقال استخدام Swift لتطوير تطبيقات GNOME ، مع التركيز على حزمة Adwaita for Swift.",
      "تشمل مزايا Swift بناء جملة أنظف وإمكانية قراءة محسنة للكود عند مقارنتها بلغات مثل Python.",
      "يعمل Adwaita for Swift على تبسيط تطوير تطبيقات جنوم من خلال تسهيل تصميم واجهة المستخدم المرتكزة على البيانات ، ودعم التطوير عبر الأنظمة الأساسية ، والتكامل مع Flathub لتوزيع التطبيقات."
    ],
    "commentSummary": [
      "يتعمق المنشور في عقبات تطوير تطبيقات Gnome باستخدام Swift ، مع التركيز على غلاف يشبه SwiftUI لميزات Gnome ، ومعالجة التحديات مثل التزامن ، وربط البيانات ، والدعم عبر الأنظمة الأساسية ، وصيانة المشروع على المدى الطويل.",
      "يشارك المستخدمون مواجهاتهم مع تحديثات واجهة المستخدم والصعوبات في التعامل مع طرق عرض تقسيم التنقل على وجه التحديد على macOS ، مما يلقي الضوء على أنماط الهندسة المعمارية مثل MVVM وأهمية وضع إرشادات لتطوير واجهة المستخدم.",
      "تمتد المناقشات إلى التأثير المحتمل لتقنيات Microsoft على Linux ، واستكشاف لغات وأطر عمل مختلفة لتطوير واجهة المستخدم الرسومية ، مع تحديد إيجابيات وسلبيات برمجة واجهة المستخدم المرتكزة على التعليمات البرمجية."
    ],
    "points": 530,
    "commentCount": 263,
    "retryCount": 0,
    "time": 1711575659
  },
  {
    "id": 39848847,
    "title": "الكشف عن اختراقات التعلم الآلي غير المسموعة",
    "originLink": "https://news.ycombinator.com/item?id=39848847",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39848847",
    "commentBody": "",
    "originSummary": [
      "العمل الذي قامت به سينثيا رودين على الذكاء الاصطناعي القابلة للتفسير يحدث تطورات مثيرة في عالم التعلم الآلي وعلوم البيانات.",
      "تحظى نماذج مثل GPT و Diffusion و MultiModal بشعبية حاليا ، مما يلقي بظلاله على التطورات المهمة الأخرى في هذا المجال.",
      "على الرغم من الاهتمام بنماذج معينة ، هناك تطورات مهمة أخرى في التعلم الآلي وعلوم البيانات تستحق التقدير."
    ],
    "commentSummary": [
      "يناقش المنشور التطورات الجديدة في التعلم الآلي وعلوم البيانات ، بما في ذلك إعادة بناء مشهد 3D ، والصور الرمزية الغاوسية ، وتكنولوجيا تحويل النص إلى كلام ، الذكاء الاصطناعي القابلة للتفسير ، وسط الضجة حول نماذج مثل GPT.",
      "ويسلط الضوء على التقدم المحرز في العرض العصبي والتعلم العميق ، إلى جانب التطبيقات الصناعية المحتملة ، مع الخوض أيضا في العقبات التي تواجه اعتماد وتفسير نماذج الذكاء الاصطناعي ، مع ذكر تقنيات مثل NeRFs و NAS.",
      "المجالات الأخرى التي تم استكشافها هي دمج الذكاء الاصطناعي في علوم المواد والكيمياء والرسوم المتحركة 3D ، مما يوفر رؤية واسعة لتأثير الذكاء الاصطناعي المتزايد عبر مجالات متنوعة."
    ],
    "points": 319,
    "commentCount": 85,
    "retryCount": 0,
    "time": 1711614358
  },
  {
    "id": 39854182,
    "title": "المفكرةالتالى: إعادة تنفيذ Notepad ++ عبر الأنظمة الأساسية",
    "originLink": "https://github.com/dail8859/NotepadNext",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39854182",
    "commentBody": "",
    "originSummary": [
      "Notepad Next هو بديل متعدد المنصات ل Notepad ++ ، متوافق مع Windows و Linux و MacOS.",
      "على الرغم من استقراره ، ينصح بعدم استخدامه للمهام الأساسية بسبب الأخطاء والميزات غير المكتملة.",
      "التطوير نشط ومفتوح للمساهمات ، ويقدم حزم تثبيت لجميع الأنظمة الأساسية ، مع مكونات إضافية لنظام التشغيل Windows وخيار لمستخدمي MacOS لتعطيل تجانس الخط."
    ],
    "commentSummary": [
      "يناقش المستخدمون برامج تحرير النصوص مثل Notepad ++ و Geany و Kate ، مع تسليط الضوء على الميزات وسهولة الاستخدام والتوافق عبر الأنظمة الأساسية.",
      "تمت الإشادة ب Notepad ++ لواجهة المستخدم السريعة والبسيطة ، على النقيض من المخاوف بشأن المحررين الآخرين ذوي الواجهات المزدحمة.",
      "تختلف الآراء حول محرر النصوص المثالي للترميز ، حيث يتميز Notepad ++ بقدرته على التكيف وسهولة الاستخدام."
    ],
    "points": 286,
    "commentCount": 178,
    "retryCount": 0,
    "time": 1711644659
  },
  {
    "id": 39844960,
    "title": "إزالة الغموض عن أمان المحفظة الرقمية بما يتجاوز Apple Pay",
    "originLink": "https://birchtree.me/blog/digital-wallets-and-the-only-apple-pay-does-this-mythology/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39844960",
    "commentBody": "",
    "originSummary": [
      "فضح مات بيرشلر الأسطورة القائلة بأن Apple Pay فقط هي التي تحمي تفاصيل بطاقة الائتمان ، مشيرا إلى أن Google Pay و Samsung Pay يحميان أيضا أرقام البطاقات.",
      "يميز بين FPAN و DPAN ، مؤكدا على المزايا الأمنية ل DPANs ، خاصة أثناء خروقات البيانات.",
      "يوضح بيرشلر أن Apple Pay لا تخفي المعلومات الشخصية الأساسية عن التجار ، مشددا على أن المحافظ الرقمية الأخرى توفر تدابير أمنية مماثلة."
    ],
    "commentSummary": [
      "تتعمق مناقشة Hacker News في Apple Pay و Google Pay ، مع التأكيد على توافقها مع محطات الدفع المادية والتدابير الأمنية والقيود ، بما في ذلك اعتماد تقنية NFC.",
      "ويحدد التحديات التي تواجهها البنوك في التفاوض مع شركة آبل، والمخاوف التنظيمية بشأن المحافظ الرقمية، ورسوم المعاملات، والعواقب القانونية لدعاوى مكافحة الاحتكار ضد شركة آبل.",
      "يغطي الحوار أيضا المعاملات غير المتصلة بالإنترنت ، واستخدام البطاقة الذكية ، وكيف تؤثر لوائح الاتحاد الأوروبي على عمليات Apple."
    ],
    "points": 267,
    "commentCount": 253,
    "retryCount": 0,
    "time": 1711575839
  },
  {
    "id": 39852167,
    "title": "Dioxus 0.5: تطوير تطبيقات الجيل التالي في Rust",
    "originLink": "https://dioxuslabs.com/blog/release-050/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39852167",
    "commentBody": "",
    "originSummary": [
      "جلب Dioxus 0.5 ، الذي تم إطلاقه في 28 مارس 2024 ، تحسينات كبيرة ، بما في ذلك إعادة كتابة الإشارة ، وحذف الأعمار ، وإعادة تحميل CSS الساخن ، وميزات أخرى لتبسيط تطوير التطبيق.",
      "عزز التحديث تطوير المكونات وإدارة الذاكرة والأداء وقدم وظائف جديدة مثل إعادة التحميل السريع ل CSS ونظام الأحداث عبر الأنظمة الأساسية.",
      "ستركز تحديثات Dioxus المستقبلية على استقرار نظام الأصول ، وإدخال مكونات الخادم ، ودمج LiveView ، بينما يدعو الفريق مساهمات المجتمع لزيادة تعزيز النظام الأساسي."
    ],
    "commentSummary": [
      "Dioxus 0.5 هو إطار عمل Rust لمختلف التطبيقات ، يتنافس مع Leptos و Yew ، وغالبا ما يتم دمجه مع Bevy لمشاريع سطح المكتب والجوال.",
      "تعمل Dioxus Labs على تحسين تجربة المستخدم مع الإصدارات المستضافة ذاتيا المحتملة وخيارات الترخيص ، مع التركيز على استخدام المؤسسة والميزات المميزة القادمة.",
      "تستلزم المناقشات التمويل مفتوح المصدر ، وعقبات تمويل رأس المال الاستثماري ، والمقارنات مع أطر مثل Tauri ، ومعالجة المخاوف بشأن كود Rust غير الآمن ، وطرق العرض ، والتفاوتات في تطوير التطبيقات بين Dioxus و Tauri."
    ],
    "points": 238,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1711636883
  },
  {
    "id": 39852118,
    "title": "الذكاء الاصطناعي استرجاع المعرفة Chatbots كشفت النقاب عن LLMs",
    "originLink": "https://news.mit.edu/2024/large-language-models-use-surprisingly-simple-mechanism-retrieve-stored-knowledge-0325",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39852118",
    "commentBody": "",
    "originSummary": [
      "تستخدم نماذج اللغة الكبيرة ، مثل تلك التي تقف وراء روبوتات المحادثة الذكاء الاصطناعي ، الوظائف الخطية الأساسية للوصول إلى البيانات المخزنة حول مواضيع مختلفة ، مما يمكن الباحثين من التحقيق في النموذج وتصحيح عدم الدقة.",
      "يسمح تحديد هذه الوظائف للباحثين بتصحيح المعلومات الخاطئة داخل النموذج ، مما يعزز فهم تخزين المعرفة وربما يعزز دقة وموثوقية روبوتات المحادثة الذكاء الاصطناعي.",
      "أجرت مجموعة من العلماء من معهد ماساتشوستس للتكنولوجيا وجامعة نورث إيسترن وجامعة هارفارد والمعهد الإسرائيلي للتكنولوجيا البحث ، والذي سيتم عرضه في المؤتمر الدولي حول تمثيلات التعلم."
    ],
    "commentSummary": [
      "يتعمق المشاركون في التحديات والتطورات والقيود المفروضة على نماذج اللغة الكبيرة (LLMs) والمحولات في تكنولوجيا الذكاء الاصطناعي ، مع التركيز على آليات استرجاع المعرفة والقوة الحسابية وتكاليف التنفيذ العملي.",
      "هناك جدل حول ما إذا كانت المحولات قد بلغت ذروتها أو إذا كانت هناك إمكانات غير مستغلة للتقدم ، إلى جانب المخاوف بشأن الطبيعة المفقودة لضغط LLM وقدرة النماذج على فهم المفاهيم بشكل كامل.",
      "تشمل المناقشات تعقيد نماذج اللغة ، ودور الوظائف الخطية في الذكاء الاصطناعي ، وأهمية بيانات التدريب ، وتحسين الوظائف ، بالإضافة إلى نقل المعرفة بين اللغات و \"الانغماس\" في الهندسة التفاضلية."
    ],
    "points": 238,
    "commentCount": 89,
    "retryCount": 0,
    "time": 1711636670
  },
  {
    "id": 39848862,
    "title": "تغريم أمازون 8 ملايين دولار في بولندا بسبب أساليب التصميم الخادعة",
    "originLink": "https://techcrunch.com/2024/03/27/amazon-dark-pattern-design-fine/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39848862",
    "commentBody": "",
    "originSummary": [
      "تم تغريم أمازون في بولندا بسبب الممارسات الخادعة المتعلقة بعقود البيع في سوقها عبر الإنترنت ، مع غرامة تقارب 8 ملايين دولار.",
      "تم تسليط الضوء على عناصر التصميم الخادعة ، التي تخلق إحساسا زائفا بالإلحاح ، وتضلل المستهلكين بشأن توافر المنتج وتواريخ التسليم ، من قبل هيئة مراقبة المستهلك.",
      "كانت ممارسة الشركة المتمثلة في إلغاء الطلبات بعد الدفع ، واعتبار الشراء ليس إبرام العقد ، واستخدام \"تصميم النمط الداكن\" من القضايا الرئيسية التي تم تحديدها ، مما أتاح لشركة أمازون الفرصة لاستئناف الحكم."
    ],
    "commentSummary": [
      "تم تغريم أمازون في بولندا لاستخدامها تقنيات تصميم الأنماط المظلمة ، على الرغم من أنها ليست مهيمنة في البلاد مثل منافستها المحلية Allegro.",
      "أثار المستخدمون في بولندا مخاوف بشأن عروض أمازون ومحرك البحث وخدمة العملاء ، مما دفع البعض إلى تفضيل Amazon.de للحصول على مجموعة أوسع وموثوقية وشحن أسرع.",
      "تسلط المناقشات الضوء على الأنماط المظلمة في التجارة الإلكترونية ، وخاصة استراتيجيات الإلحاح الخادعة التي تستخدمها شركات مثل Amazon ، بينما ينتقد المستخدمون أيضا واجهة Zoom وتصميمها ، مما يشير إلى ضرورة التحسينات."
    ],
    "points": 221,
    "commentCount": 59,
    "retryCount": 0,
    "time": 1711614521
  },
  {
    "id": 39849727,
    "title": "عمليات إعادة شراء إنتل بقيمة 152 مليار دولار تثير تساؤلات حول دعم بقيمة 8 مليارات دولار",
    "originLink": "https://www.commondreams.org/opinion/intel-subsidy-chips-act-stock-buyback",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39849727",
    "commentBody": "",
    "originSummary": [
      "تجري إدارة بايدن محادثات لتقديم أكثر من 10 مليارات دولار من الإعانات لشركة إنتل كورب ، مما يثير تساؤلات حول الحاجة إلى تمويل إضافي بالنظر إلى تاريخ الشركة البالغ 152 مليار دولار في عمليات إعادة شراء الأسهم في السنوات ال 35 الماضية.",
      "ظهرت مخاوف بشأن إساءة الاستخدام المحتملة لمنح دافعي الضرائب من قبل إنتل لمزيد من عمليات إعادة شراء الأسهم ، مما يلقي بظلال من الشك على الغرض من الدعم المقترح وفائدته."
    ],
    "commentSummary": [
      "حصلت إنتل على دعم بقيمة 8 مليارات دولار من الحكومة الأمريكية لإنشاء مصنع محليا، مما أثار مناقشات حول الآثار المترتبة على الملكية الحكومية، والأمن القومي، ومواءمة قيمة المساهمين.",
      "تركز المناقشات على كفاءة عمليات إعادة شراء الأسهم ، وتأثيرها على أسعار الأسهم ، والعلاقة مع توزيعات الأرباح ، وتوليد قيمة للمساهمين ، ومعالجة تجاوز الضرائب ، وتأثير قيمة الأسهم ، والأخلاق ، والتلاعب.",
      "تتعمق المحادثة في الإعانات الحكومية ، وتحقيق التوازن بين التدخل والأسواق المفتوحة ، وتحديات التصنيع في الولايات المتحدة ، ومبادرات إدارة بايدن بشأن التلمذة الصناعية ، ومكافحة الاعتماد ، ولوائح مكافحة التلاعب ، بهدف إيجاد حلول اقتصادية مقبولة اجتماعيا."
    ],
    "points": 219,
    "commentCount": 273,
    "retryCount": 0,
    "time": 1711624324
  },
  {
    "id": 39852219,
    "title": "يكشف خطاب Mining OpenAI عن مشاعر المستخدم ورؤاه",
    "originLink": "https://julep-ai.github.io/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39852219",
    "commentBody": "",
    "originSummary": [
      "تدير OpenAI مجتمع مطورين على Discourse ، حيث تستضيف 20,000 مستخدم وأكثر من 100,000 مشاركة بدءا من مارس 2021.",
      "تم إنشاء مجموعة بيانات من مشاركات المنتدى لدراسة تجارب المستخدمين ومشاعرهم واستخراج الأفكار ، والتي تغطي المنشورات والمناقشات وتحليل المشاعر ونماذج الموضوعات.",
      "تتكون البيانات في الغالب من منشورات محايدة ، مع فئات معينة تعرض مشاعر سلبية أو إيجابية إضافية ، يمكن الوصول إليها للجمهور لاستكشاف متعمق لتقنيات الذكاء الاصطناعي."
    ],
    "commentSummary": [
      "يستكشف المنشور استخدام الذكاء الاصطناعي لتحليل المشاعر لمشاركات منتدى المجتمع على منصة OpenAI ، مما يسلط الضوء على المخاوف بشأن الموافقة والخصوصية.",
      "يعبر المستخدمون عن مخاوفهم بشأن معالجة البيانات وقضايا الخصوصية والامتثال التنظيمي ومشاركة الآراء في منتديات OpenAI.",
      "تنشأ الانتقادات من محور OpenAI نحو التركيز التجاري ، بما في ذلك عدم الموافقة على علامتها \"المفتوحة\" ، مع اقتراحات لاستخدام واجهة برمجة تطبيقات OpenAI مباشرة لتحسين التحكم والشفافية."
    ],
    "points": 212,
    "commentCount": 37,
    "retryCount": 0,
    "time": 1711637073
  },
  {
    "id": 39847728,
    "title": "ST-DOS: نواة متقدمة مع التوافق مع MS-DOS",
    "originLink": "http://sininenankka.dy.fi/~sami/fdshell/doskernel.php",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39847728",
    "commentBody": "",
    "originSummary": [
      "ST-DOS عبارة عن نواة تم تجميعها باستخدام برنامج التحويل البرمجي Open Watcom ، وتقدم ميزات مثل دعم القرص الكبير والتخزين المؤقت الديناميكي وتوافق MS-DOS.",
      "يبحث محمل الإقلاع عن KERNEL. BIN في نظام ملفات FAT للتحميل في الذاكرة بمتطلبات محددة.",
      "تتوفر تحديثات سجل التغيير ، ويمكن الوصول إلى التعليمات البرمجية المصدر للنواة عبر الإنترنت."
    ],
    "commentSummary": [
      "\"ST-DOS\" هو استنساخ MS-DOS شخصي تم تطويره بواسطة Sami Tikkanen ، ويجمع بين مفاهيم MS-DOS وعناصر فريدة.",
      "تتضمن المناقشة Atari ST و DR-DOS وذكريات حول حوسبة المدرسة القديمة باستخدام شاشات CRT وجماليات الطلب الهاتفي.",
      "يتطرق إلى شفرة مصدر MS-DOS وتطور أنظمة تشغيل DOS."
    ],
    "points": 191,
    "commentCount": 44,
    "retryCount": 0,
    "time": 1711599290
  },
  {
    "id": 39850925,
    "title": "الشبكة الاجتماعية اللامركزية Fandom.ink تمكن المستخدمين من خيارات البحث وفلاتر اللغة",
    "originLink": "https://fandom.ink/@Rozzychan/112161902225538242",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39850925",
    "commentBody": "",
    "originSummary": [
      "Fandom.ink هي شبكة اجتماعية لامركزية تعمل على Mastodon ، وتوفر وظائف البحث وفلاتر اللغة.",
      "يمكن للمستخدمين التفاعل مع المنشورات ومتابعة الملفات الشخصية والتنقل عبر النظام الأساسي ، مع إدارة المسؤولين لإحصائيات الخادم وميزاته.",
      "تسمح المنصة بالتفاعلات اللامركزية واكتشاف المحتوى ، مما يوفر تجربة شبكات اجتماعية سهلة الاستخدام."
    ],
    "commentSummary": [
      "علقت Google حساب مؤلف رومانسي بسبب محتوى جنسي صريح ، مما أثار جدلا حول مخاطر الاعتماد حصريا على الخدمات السحابية لتخزين البيانات.",
      "تضمنت الاقتراحات النسخ الاحتياطي الآمن للبيانات باستخدام التشفير من جانب العميل وإدارة مفاتيح التشفير للحفاظ على التحكم في البيانات وموازنة السحابة مع النسخ الاحتياطية المادية.",
      "سلطت المخاوف الضوء على احتمال تعليق الحسابات والرقابة وفقدان البيانات على منصات مثل Google ، إلى جانب المناقشات حول التصورات المجتمعية للعنف والجنس ودور شركات التكنولوجيا في الإشراف على المحتوى."
    ],
    "points": 182,
    "commentCount": 192,
    "retryCount": 0,
    "time": 1711631673
  },
  {
    "id": 39849126,
    "title": "فهم إصلاح الحمض النووي في تكوين الذاكرة طويلة المدى",
    "originLink": "https://www.nature.com/articles/d41586-024-00930-y",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39849126",
    "commentBody": "",
    "originSummary": [
      "كشفت دراسة أجريت على الفئران ، نشرت في مجلة Nature ، أن الذكريات طويلة المدى يتم تأسيسها من خلال استجابة التهابية تساعد في إصلاح تلف الحمض النووي.",
      "يشير البحث إلى أنه أثناء تكوين الذاكرة ، يتسبب النشاط الكهربائي المكثف في حدوث فواصل في الحمض النووي في خلايا الدماغ ، مما يؤدي إلى استجابة مناعية للإصلاح ، مما قد يؤثر على الحالات التنكسية العصبية مثل مرض الزهايمر.",
      "تؤكد هذه الدراسة على أهمية فهم الآليات الكامنة وراء إنشاء الذاكرة وصيانتها داخل الخلايا."
    ],
    "commentSummary": [
      "يتم تخزين الذكريات في أجزاء مختلفة من الدماغ وتشمل التغيرات اللاجينية في الخلايا العصبية ، مع تعديل الحمض النووي بالقرب من نقاط الاشتباك العصبي لتعزيز الروابط العصبية.",
      "ينصب التركيز على أهمية الحمض النووي في خلق الذاكرة ، واستكشاف آليات تتجاوز الانتقاء الطبيعي ، ودراسة كيفية تأثير المواد والحالات العقلية على الذاكرة.",
      "وتؤكد المناقشات على الطبيعة المعقدة للتنمية البيولوجية، ملمحا إلى الآليات والتعقيدات المحتملة غير المكتشفة في إطار العملية."
    ],
    "points": 181,
    "commentCount": 71,
    "retryCount": 0,
    "time": 1711618000
  },
  {
    "id": 39853958,
    "title": "مختبرات AI21 تكشف النقاب عن جامبا: نموذج الذكاء الاصطناعي متطور يعتمد على بنية مامبا",
    "originLink": "https://www.maginative.com/article/ai21-labs-unveils-jamba-the-first-production-grade-mamba-based-ai-model/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39853958",
    "commentBody": "",
    "originSummary": [
      "قدمت AI21 Labs جامبا ، أول نموذج الذكاء الاصطناعي مبني على بنية مامبا للاستخدام الإنتاجي.",
      "يدمج جامبا نموذج مساحة الحالة الهيكلية من مامبا مع بنية المحول ، مما يعزز الأداء والكفاءة.",
      "يتضمن النموذج طبقات MoE لنوافذ السياق الموسعة والإنتاجية الأسرع ، وعرض نتائج مرجعية رائعة ويمكن الوصول إليها بموجب ترخيص Apache 2.0 للبحث ، مع خطط لإصدار أكثر ملاءمة تجاريا قريبا."
    ],
    "commentSummary": [
      "Jamba هو نموذج الذكاء الاصطناعي من فئة الإنتاج مشتق من Mamba ، تم تطويره بواسطة AI21 ، يمزج بين طبقات المحولات والمامبا لتحسين الكفاءة والأداء.",
      "يتميز النموذج بنافذة سياق واسعة ويوظف مزيجا من الخبراء ، باستخدام ما يقرب من 12 مليار معلمة أثناء الاستدلال ، لكن بعض المستخدمين واجهوا تحديات في تشغيله على Linux باستخدام وحدات معالجة رسومات محددة.",
      "تؤكد المناقشات على المفاضلات بين طبقات نموذج المحولات والدولة الفضائية ، وإمكانات وقيود نوافذ السياق الواسعة. يمكن الوصول إلى Jamba بموجب ترخيص Apache 2.0."
    ],
    "points": 173,
    "commentCount": 37,
    "retryCount": 0,
    "time": 1711643816
  },
  {
    "id": 39848268,
    "title": "Endlessh-go: Golang SSH Tarpit لمحاصرة الروبوتات وتصور المقاييس",
    "originLink": "https://github.com/shizunge/endlessh-go",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39848268",
    "commentBody": "",
    "originSummary": [
      "Endlessh-go هي نسخة Golang من Endlessh ، تقدم مقاييس بروميثيوس وتعرضها على لوحة معلومات Grafana أثناء محاصرة مهاجمي SSH وتقديم بيانات تحديد الموقع الجغرافي.",
      "يمكن إعداده عن طريق بنائه من الكود المصدري أو باستخدام صورة Docker ، مما يسمح بالتخصيص من خلال وسيطات CLI مختلفة.",
      "تغطي المقاييس المصدرة اتصالات العميل ونقل البيانات والوقت المستخدم على Endlessh ، بينما تتطلب لوحة معلومات Grafana الإصدار 8.2 ويمكن دمجها باستخدام معرف محدد ، مع توفر الدعم عبر GitHub للاستفسارات أو المشاكل."
    ],
    "commentSummary": [
      "يدور النقاش حول استخدام منافذ SSH غير القياسية ، وتكوينات جدار الحماية ، وتدابير أمنية إضافية لإحباط الروبوتات والماسحات الضوئية.",
      "تشمل الاستراتيجيات الاستفادة من أدوات مثل Endlessh ، وتنفيذ قواعد جدار الحماية في iptables ، وتكتيكات مثل CAPTCHAs وإخفاء المنفذ لتثبيط الهجمات الآلية.",
      "يناقش المستخدمون لقاءاتهم مع أدوات إعادة التنفيذ مثل Endlessh في Golang لتعزيز الكفاءة والفعالية."
    ],
    "points": 145,
    "commentCount": 56,
    "retryCount": 0,
    "time": 1711606999
  }
]
