[
  {
    "id": 39844936,
    "title": "GNOME-alkalmazások fejlesztése egyszerűbbé válik a Swift segítségével",
    "originLink": "https://www.swift.org/blog/adwaita-swift/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39844936",
    "commentBody": "",
    "originSummary": [
      "A cikk a Swift felhasználását vizsgálja GNOME-alkalmazások fejlesztéséhez, kiemelve az Adwaita for Swift csomagot.",
      "A Swift előnyei közé tartozik a tisztább szintaxis és a kód jobb olvashatósága az olyan nyelvekhez képest, mint a Python.",
      "Az Adwaita for Swift racionalizálja a GNOME-alkalmazások fejlesztését az adatközpontú felhasználói felület tervezésének megkönnyítésével, a platformok közötti fejlesztés támogatásával és a Flathubba való integrációval az alkalmazások terjesztéséhez."
    ],
    "commentSummary": [
      "A bejegyzés a Gnome-alkalmazások Swift használatával történő fejlesztésének akadályait vizsgálja, kiemelve a SwiftUI-szerű csomagolást a Gnome funkcióira, olyan kihívásokkal foglalkozva, mint az egyidejűség, az adatkötés, a platformok közötti támogatás és a hosszú távú projektkarbantartás.",
      "A felhasználók megosztják az UI-frissítésekkel kapcsolatos tapasztalataikat és a navigációs osztott nézetek kezelésének nehézségeit, különösen a macOS-en, megvilágítva az olyan architektúramintákat, mint az MVVM, és az UI-fejlesztésre vonatkozó iránymutatások meghatározásának jelentőségét.",
      "A megbeszélések kiterjednek a Microsoft technológiáinak a Linuxra gyakorolt lehetséges hatására, a különböző nyelvek és keretrendszerek feltárására a GUI-fejlesztéshez, miközben felvázolja a kódközpontú felhasználói felület programozás előnyeit és hátrányait."
    ],
    "points": 530,
    "commentCount": 263,
    "retryCount": 0,
    "time": 1711575659
  },
  {
    "id": 39848847,
    "title": "Hallatlan gépi tanulási áttörések feltárása",
    "originLink": "https://news.ycombinator.com/item?id=39848847",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39848847",
    "commentBody": "",
    "originSummary": [
      "Cynthia Rudin magyarázható mesterséges intelligenciával kapcsolatos munkája izgalmas fejleményeket hoz a gépi tanulás és az adattudomány világában.",
      "Az olyan modellek, mint a GPT, a Diffúzió és a MultiModal jelenleg népszerűek, és háttérbe szorítják a terület egyéb fontos fejlesztéseit.",
      "Annak ellenére, hogy bizonyos modelleknek nagy figyelmet szenteltek, a gépi tanulás és az adattudomány más jelentős előrelépések is elismerést érdemelnek."
    ],
    "commentSummary": [
      "A poszt a gépi tanulás és az adattudomány új vívmányait tárgyalja, beleértve a 3D-s jelenetrekonstrukciót, a Gauss-avatárokat, a szövegből beszéddé váló technológiát és a megmagyarázható mesterséges intelligenciát, a GPT-hez hasonló modellek körüli felhajtás közepette.",
      "Kiemeli a neurális renderelés és a mélytanulás terén elért eredményeket, valamint a lehetséges ipari alkalmazásokat, ugyanakkor kitér a mesterséges intelligencia modellek elfogadásának és értelmezésének akadályaira is, megemlítve az olyan technológiákat, mint a NeRF és a NAS.",
      "További vizsgált területek a mesterséges intelligencia integrálása az anyagtudományba, a kémiába és a 3D animációba, széleskörű képet nyújtva a mesterséges intelligencia egyre növekvő hatásáról a legkülönbözőbb területeken."
    ],
    "points": 319,
    "commentCount": 85,
    "retryCount": 0,
    "time": 1711614358
  },
  {
    "id": 39854182,
    "title": "JegyzettömbKövetkező: Cross-Platform Notepad++ újraimplementálás",
    "originLink": "https://github.com/dail8859/NotepadNext",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39854182",
    "commentBody": "",
    "originSummary": [
      "A Notepad Next a Notepad++ keresztplatformos alternatívája, amely kompatibilis a Windows, Linux és MacOS rendszerekkel.",
      "Bár stabil, a hibák és a befejezetlen funkciók miatt nem ajánlott alapvető feladatokra használni.",
      "A fejlesztés aktív és nyitott a közreműködésre, telepítőcsomagokat kínál minden platformra, extra komponensekkel a Windowshoz, és a MacOS felhasználók számára a betűsimítás kikapcsolásának lehetőségével."
    ],
    "commentSummary": [
      "A felhasználók olyan szövegszerkesztőket vitatnak meg, mint a Notepad++, a Geany és a Kate, kiemelve a funkciókat, a használhatóságot és a platformok közötti kompatibilitást.",
      "A Notepad++-t gyors és minimalista felhasználói felülete miatt dicsérik, ami ellentétben áll a többi, zsúfolt felületű szerkesztővel kapcsolatos aggodalmakkal.",
      "A kódoláshoz ideális szövegszerkesztővel kapcsolatban megoszlanak a vélemények, a Notepad++ kiemelkedik alkalmazkodóképessége és könnyű kezelhetősége miatt."
    ],
    "points": 286,
    "commentCount": 178,
    "retryCount": 0,
    "time": 1711644659
  },
  {
    "id": 39844960,
    "title": "A digitális pénztárca biztonságának demisztifikálása az Apple Pay-en túl",
    "originLink": "https://birchtree.me/blog/digital-wallets-and-the-only-apple-pay-does-this-mythology/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39844960",
    "commentBody": "",
    "originSummary": [
      "Matt Birchler lerántja a leplet arról, hogy csak az Apple Pay védi a hitelkártyaadatokat, és rámutat, hogy a Google Pay és a Samsung Pay is védi a kártyaszámokat.",
      "Különbséget tesz az FPAN és a DPAN között, kiemelve a DPAN-ok biztonsági előnyeit, különösen az adatvédelmi incidensek során.",
      "Birchler tisztázza, hogy az Apple Pay nem rejti el az alapvető személyes adatokat a kereskedők elől, és hangsúlyozza, hogy más digitális pénztárcák hasonló biztonsági intézkedéseket biztosítanak."
    ],
    "commentSummary": [
      "A Hacker News beszélgetése az Apple Pay és a Google Pay témakörét járja körül, kiemelve a fizikai fizetési terminálokkal való kompatibilitást, a biztonsági intézkedéseket és a korlátokat, beleértve az NFC technológia elfogadását.",
      "Bemutatja a bankoknak az Apple-lel folytatott tárgyalások során felmerülő kihívásokat, a digitális pénztárcákkal kapcsolatos szabályozási aggályokat, a tranzakciós díjakat és az Apple ellen indított trösztellenes perek jogi következményeit.",
      "A párbeszéd kiterjed az offline tranzakciókra, az intelligens kártyák használatára, valamint arra is, hogy az uniós szabályozás hogyan befolyásolja az Apple működését."
    ],
    "points": 267,
    "commentCount": 253,
    "retryCount": 0,
    "time": 1711575839
  },
  {
    "id": 39852167,
    "title": "Dioxus 0.5: Következő generációs alkalmazásfejlesztés Rustban",
    "originLink": "https://dioxuslabs.com/blog/release-050/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39852167",
    "commentBody": "",
    "originSummary": [
      "A 2024. március 28-án indított Dioxus 0.5 jelentős fejlesztéseket hozott, többek között a jelek újraírását, az élettartam elhagyását, a CSS forró újratöltését és más, az alkalmazásfejlesztést egyszerűsítő funkciókat.",
      "A frissítés javította a komponensfejlesztést, a memóriakezelést, a teljesítményt, és új funkciókat vezetett be, mint például a CSS forró újratöltése és a platformokon átívelő eseményrendszer.",
      "A Dioxus jövőbeli frissítései az eszközrendszer stabilizálására, a szerverkomponensek bevezetésére és a LiveView integrálására fognak összpontosítani, miközben a csapat várja a közösség hozzájárulásait a platform további fejlesztéséhez."
    ],
    "commentSummary": [
      "A Dioxus 0.5 egy Rust keretrendszer különböző alkalmazásokhoz, a Leptos és a Yew versenytársa, gyakran a Bevy-vel kombinálva asztali és mobil projektekhez.",
      "A Dioxus Labs a felhasználói élmény fokozásán dolgozik a potenciális önállóan hosztolt verziókkal és a licencválasztékkal, a vállalati felhasználásra és a közelgő megkülönböztető funkciókra összpontosítva.",
      "A megbeszélések kiterjednek a nyílt forráskódú finanszírozásra, a kockázatitőke-finanszírozás akadályaira és az olyan keretrendszerekkel való összehasonlításra, mint a Tauri, a nem biztonságos rozsdás kóddal, a renderelési módszerekkel és a Dioxus és a Tauri közötti alkalmazásfejlesztési különbségekkel kapcsolatos aggodalmak kezelésére."
    ],
    "points": 238,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1711636883
  },
  {
    "id": 39852118,
    "title": "AI Chatbots \"Tudásszerzés által leleplezett LLM-k",
    "originLink": "https://news.mit.edu/2024/large-language-models-use-surprisingly-simple-mechanism-retrieve-stored-knowledge-0325",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39852118",
    "commentBody": "",
    "originSummary": [
      "A nagy nyelvi modellek, mint például az AI chatbotok mögött álló modellek, alapvető lineáris függvényeket használnak a különböző témákról tárolt adatok eléréséhez, lehetővé téve a kutatók számára a modell vizsgálatát és a pontatlanságok kijavítását.",
      "Ezen funkciók azonosítása lehetővé teszi a kutatók számára, hogy a modellben lévő hamis információkat korrigálják, javítva a tudástárolás megértését, és potenciálisan növelve az AI chatbotok pontosságát és megbízhatóságát.",
      "Az MIT, a Northeastern University, a Harvard University és az Izraeli Technológiai Intézet tudósainak egy csoportja végezte a kutatást, amelyet a Learning Representations nemzetközi konferencián mutatnak be."
    ],
    "commentSummary": [
      "A résztvevők elmélyednek a nagy nyelvi modellek (LLM) és transzformátorok kihívásaiban, fejlődésében és korlátaiban a mesterséges intelligencia technológiában, a tudáskeresési mechanizmusokra, a számítási teljesítményre és a gyakorlati megvalósítási költségekre összpontosítva.",
      "Vita folyik arról, hogy a transzformátorok elérte-e a csúcspontját, vagy van-e még kiaknázatlan fejlődési potenciál, valamint az LLM tömörítés veszteséges jellegével és a modellek fogalmak teljes körű megragadására való képességével kapcsolatos aggályok.",
      "Szó lesz többek között a nyelvi modellek bonyolultságáról, a lineáris függvények szerepéről a mesterséges intelligenciában, a képzési adatok fontosságáról és a függvények optimalizálásáról, valamint a nyelvek közötti tudásátadásról és a differenciálgeometriában való \"elmélyülésről\"."
    ],
    "points": 238,
    "commentCount": 89,
    "retryCount": 0,
    "time": 1711636670
  },
  {
    "id": 39848862,
    "title": "Az Amazon 8 millió dollárra bírságolták Lengyelországban a megtévesztő tervezési taktikák miatt",
    "originLink": "https://techcrunch.com/2024/03/27/amazon-dark-pattern-design-fine/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39848862",
    "commentBody": "",
    "originSummary": [
      "Az Amazont Lengyelországban megbírságolták az online piactéren kötött adásvételi szerződésekkel kapcsolatos megtévesztő gyakorlatok miatt, a büntetés közel 8 millió dollár.",
      "A fogyasztóvédelmi hatóság kiemelte a megtévesztő, a sürgősség hamis érzetét keltő, a fogyasztókat a termék elérhetőségével és a szállítási határidőkkel kapcsolatban félrevezető tervezési elemeket.",
      "A vállalat azon gyakorlata, hogy a megrendeléseket a kifizetés után törli, a vásárlást nem tekinti szerződéskötésnek, és \"sötét mintát használ\" - ezek voltak a fő problémák, amelyek lehetővé tették az Amazon számára, hogy fellebbezzen az ítélet ellen."
    ],
    "commentSummary": [
      "Az Amazont Lengyelországban megbírságolták a sötét mintás dizájntechnikák alkalmazása miatt, bár nem olyan domináns az országban, mint a helyi rivális Allegro.",
      "A lengyelországi felhasználók aggodalmakat fogalmaztak meg az Amazon kínálatával, keresőmotorjával és ügyfélszolgálatával kapcsolatban, ami egyeseket arra késztet, hogy a szélesebb választék, a megbízhatóság és a gyorsabb szállítás miatt az Amazon.de-t részesítsék előnyben.",
      "A viták rávilágítanak az e-kereskedelem sötét mintáira, különösen az olyan cégek által alkalmazott megtévesztő sürgősségi stratégiákra, mint az Amazon, miközben a felhasználók kritizálják a Zoom felhasználói felületét és kialakítását is, ami a fejlesztések szükségességét sugallja."
    ],
    "points": 221,
    "commentCount": 59,
    "retryCount": 0,
    "time": 1711614521
  },
  {
    "id": 39849727,
    "title": "Az Intel 152B dolláros visszavásárlásai kérdéseket vetnek fel a 8 milliárd dolláros támogatással kapcsolatban",
    "originLink": "https://www.commondreams.org/opinion/intel-subsidy-chips-act-stock-buyback",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39849727",
    "commentBody": "",
    "originSummary": [
      "A Biden-kormányzat tárgyalásokat folytat arról, hogy több mint 10 milliárd dolláros támogatást ajánljon fel az Intel Corp. számára, ami kérdéseket vet fel a további finanszírozás szükségességével kapcsolatban, tekintettel arra, hogy a vállalat az elmúlt 35 évben 152 milliárd dollár értékben vásárolt vissza részvényeket.",
      "Aggályok merültek fel azzal kapcsolatban, hogy az Intel visszaélhet az adófizetői támogatásokkal további részvény-visszavásárlásokra, ami kétségessé teszi a javasolt támogatás célját és hasznát."
    ],
    "commentSummary": [
      "Az Intel 8 milliárd dolláros támogatást kapott az amerikai kormánytól egy hazai gyár létrehozásához, ami vitákat váltott ki a kormányzati tulajdon következményeiről, a nemzetbiztonságról és a részvényesi értékek összehangolásáról.",
      "A viták középpontjában a részvény-visszavásárlások hatékonysága, a részvényárfolyamokra gyakorolt hatása, az osztalékkal való kapcsolat és a részvényesi értékteremtés áll, az adók megkerülése, a részvények értékére gyakorolt hatás, az etika és a manipuláció témakörében.",
      "A beszélgetés kitér a kormányzati támogatásokra, a beavatkozás és a nyitott piacok egyensúlyának megteremtésére, az amerikai gyártás kihívásaira, valamint a Biden-kormányzatnak a tanulószerződéses gyakorlati képzésre, a bizonyítványok elleni küzdelemre és a manipulációellenes szabályozásra vonatkozó kezdeményezéseire, amelyek társadalmilag elfogadható gazdasági megoldásokat céloznak."
    ],
    "points": 219,
    "commentCount": 273,
    "retryCount": 0,
    "time": 1711624324
  },
  {
    "id": 39852219,
    "title": "Az OpenAI diskurzusának bányászata feltárja a felhasználói hangulatot és a betekintést",
    "originLink": "https://julep-ai.github.io/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39852219",
    "commentBody": "",
    "originSummary": [
      "Az OpenAI a Discourse-on fejlesztői közösséget működtet, amely 2021 márciusától 20 000 felhasználónak és több mint 100 000 hozzászólásnak ad otthont.",
      "A fórumbejegyzésekből adathalmazt hoztunk létre a felhasználói tapasztalatok és érzések tanulmányozására, valamint a bejegyzések, a viták, a hangulatelemzés és a témamodellek elemzésére.",
      "Az adatok többnyire semleges hozzászólásokból állnak, bizonyos kategóriák további negatív vagy pozitív érzelmeket mutatnak be, amelyek nyilvánosan hozzáférhetők a mesterséges intelligencia technológiák mélyreható feltárásához."
    ],
    "commentSummary": [
      "A poszt az OpenAI platformján a közösségi fórumbejegyzések hangulatelemzésére szolgáló mesterséges intelligencia felhasználását vizsgálja, kiemelve a hozzájárulással és az adatvédelemmel kapcsolatos aggodalmakat.",
      "A felhasználók aggodalmukat fejezik ki az adatfeldolgozással, az adatvédelmi kérdésekkel és a jogszabályi megfeleléssel kapcsolatban, és véleményt osztanak meg az OpenAI fórumain.",
      "Kritikák merülnek fel az OpenAI kereskedelmi fókuszúvá válása miatt, beleértve a \"nyílt\" címke helytelenítését, és azt javasolják, hogy a jobb ellenőrzés és átláthatóság érdekében közvetlenül az OpenAI API-t használják."
    ],
    "points": 212,
    "commentCount": 37,
    "retryCount": 0,
    "time": 1711637073
  },
  {
    "id": 39847728,
    "title": "ST-DOS: Fejlett mag MS-DOS kompatibilitással",
    "originLink": "http://sininenankka.dy.fi/~sami/fdshell/doskernel.php",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39847728",
    "commentBody": "",
    "originSummary": [
      "Az ST-DOS az Open Watcom fordítóprogrammal fordított kernel, amely olyan funkciókat kínál, mint a nagy lemezek támogatása, a dinamikus gyorsítótár és az MS-DOS kompatibilitás.",
      "A rendszerbetöltő a KERNEL.BIN fájlt keresi a FAT fájlrendszerben, hogy betöltse a memóriába a speciális követelményeket.",
      "A napló frissítései elérhetőek, és a rendszermag forráskódja online elérhető."
    ],
    "commentSummary": [
      "Az \"ST-DOS\" egy Sami Tikkanen által kifejlesztett MS-DOS klón, amely az MS-DOS koncepciókat egyedi elemekkel kombinálja.",
      "A beszélgetés az Atari ST-ről, a DR-DOS-ról és a régi iskolai számítógépekről szól, a CRT-monitorokról és a betárcsázós esztétikáról.",
      "Érinti az MS-DOS forráskódját és a DOS operációs rendszerek fejlődését."
    ],
    "points": 191,
    "commentCount": 44,
    "retryCount": 0,
    "time": 1711599290
  },
  {
    "id": 39850925,
    "title": "A decentralizált közösségi hálózat Fandom.ink keresési lehetőségekkel és nyelvi szűrőkkel bővíti a felhasználókat",
    "originLink": "https://fandom.ink/@Rozzychan/112161902225538242",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39850925",
    "commentBody": "",
    "originSummary": [
      "A Fandom.ink egy decentralizált közösségi hálózat, amely a Mastodonon fut, keresési funkciókat és nyelvi szűrőket biztosít.",
      "A felhasználók részt vehetnek a posztokban, követhetik a profilokat és navigálhatnak a platformon, az adminok pedig a szerver statisztikáit és funkcióit kezelhetik.",
      "A platform decentralizált interakciókat és tartalomkeresést tesz lehetővé, felhasználóbarát közösségi hálózati élményt nyújtva."
    ],
    "commentSummary": [
      "A Google felfüggesztette egy romantikus szerző fiókját szexuális tartalmak miatt, ami vitát váltott ki arról, hogy milyen kockázatokkal jár, ha az adatok tárolása kizárólag felhőszolgáltatásoktól függ.",
      "A javaslatok között szerepelt az adatok biztonságos biztonsági mentése ügyféloldali titkosítással és a titkosítási kulcsok kezelése az adatok feletti ellenőrzés fenntartása és a felhő és a fizikai biztonsági mentések egyensúlyának fenntartása érdekében.",
      "Az aggodalmak a lehetséges fiókfelfüggesztésekre, cenzúrára és adatvesztésre hívták fel a figyelmet az olyan platformokon, mint a Google, valamint az erőszak és a szexualitás társadalmi megítéléséről és a technológiai vállalatok szerepéről a tartalom moderálásában."
    ],
    "points": 182,
    "commentCount": 192,
    "retryCount": 0,
    "time": 1711631673
  },
  {
    "id": 39849126,
    "title": "A DNS-javítás megértése a hosszú távú memória kialakulásában",
    "originLink": "https://www.nature.com/articles/d41586-024-00930-y",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39849126",
    "commentBody": "",
    "originSummary": [
      "Egy egereken végzett, a Nature folyóiratban közzétett tanulmány szerint a hosszú távú emlékezet a DNS-károsodások javítását segítő gyulladásos válaszon keresztül jön létre.",
      "A kutatás azt jelzi, hogy a memória kialakulása során az intenzív elektromos aktivitás DNS-töréseket okoz az agysejtekben, ami a javítás érdekében immunválaszhoz vezet, és potenciálisan befolyásolhatja az olyan neurodegeneratív állapotokat, mint az Alzheimer-kór.",
      "Ez a tanulmány kiemeli a sejteken belüli memóriateremtés és -fenntartás mögött álló mechanizmusok megértésének jelentőségét."
    ],
    "commentSummary": [
      "Az emlékeket az agy különböző részein tárolják, és a neuronok epigenetikai változásait is magukban foglalják, a szinapszisok közelében lévő DNS-t módosítják az idegi kapcsolatok erősítése érdekében.",
      "A középpontban a DNS jelentősége áll az emlékezet létrehozásában, a természetes szelekción túli mechanizmusok feltárása, valamint annak vizsgálata, hogy az anyagok és a mentális állapotok hogyan befolyásolják az emlékezetet.",
      "A viták a biológiai fejlődés bonyolult természetét hangsúlyozzák, utalva a folyamat lehetséges, még fel nem fedezett mechanizmusaira és összetettségére."
    ],
    "points": 181,
    "commentCount": 71,
    "retryCount": 0,
    "time": 1711618000
  },
  {
    "id": 39853958,
    "title": "Az AI21 Labs bemutatja a Jamba: A Mamba architektúrán alapuló csúcstechnológiás mesterséges intelligenciamodell",
    "originLink": "https://www.maginative.com/article/ai21-labs-unveils-jamba-the-first-production-grade-mamba-based-ai-model/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39853958",
    "commentBody": "",
    "originSummary": [
      "Az AI21 Labs bemutatta a Jamba-t, az első Mamba architektúrára épülő, gyártói használatra szánt mesterséges intelligencia modellt.",
      "A Jamba egyesíti a Mamba strukturált állapottér modelljét a Transformer architektúrával, növelve a teljesítményt és a hatékonyságot.",
      "A modell MoE-rétegeket tartalmaz a kiterjesztett kontextusablakok és a gyorsabb átviteli sebesség érdekében, lenyűgöző benchmark eredményeket mutat, és az Apache 2.0 licenc alatt hozzáférhető a kutatás számára, és hamarosan tervezik egy kereskedelmi szempontból alkalmasabb verzió elkészítését."
    ],
    "commentSummary": [
      "A Jamba a Mambából származó, az AI21 által kifejlesztett, gyártási szintű AI-modell, amely a transzformátor és a Mamba rétegeket keveri a nagyobb hatékonyság és teljesítmény érdekében.",
      "A modell széles kontextusablakkal büszkélkedhet, és szakértőket használ, a következtetés során körülbelül 12 milliárd paramétert használ fel, de néhány felhasználó kihívásokkal szembesült a Linuxon, bizonyos GPU-kon történő futtatása során.",
      "A viták hangsúlyozzák a transzformátor és az állapottér modellrétegek közötti kompromisszumokat, valamint a kiterjedt kontextusablakok lehetőségeit és korlátait. A Jamba az Apache 2.0 licenc alatt érhető el."
    ],
    "points": 173,
    "commentCount": 37,
    "retryCount": 0,
    "time": 1711643816
  },
  {
    "id": 39848268,
    "title": "Endlessh-go: Golang SSH Tarpit botok csapdázására és mérőszámok vizualizálására",
    "originLink": "https://github.com/shizunge/endlessh-go",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39848268",
    "commentBody": "",
    "originSummary": [
      "Az Endlessh-go az Endlessh Golang változata, amely Prometheus metrikákat kínál, és Grafana műszerfalon jeleníti meg őket, miközben csapdába ejti az SSH-támadókat és földrajzi helymeghatározási adatokat mutat be.",
      "Beállítható a forráskódból történő építéssel vagy egy Docker-kép felhasználásával, amely különböző CLI-argumentumokkal lehetővé teszi a testreszabást.",
      "Az exportált mérőszámok az ügyfélkapcsolatokra, az adatátvitelre és az Endlessh-en felhasznált időre vonatkoznak, míg a Grafana műszerfalhoz a 8.2-es verzióra van szükség, és egy adott azonosító használatával integrálható, a GitHubon keresztül elérhető támogatással a kérdések vagy problémák esetén."
    ],
    "commentSummary": [
      "A vita a nem szabványos SSH-portok, tűzfal-konfigurációk és extra biztonsági intézkedések alkalmazása körül forog, hogy meghiúsítsák a botokat és a szkennereket.",
      "A stratégiák magukban foglalják az olyan eszközök kihasználását, mint az Endlessh, tűzfalszabályok bevezetését az iptables-ben, valamint olyan taktikákat, mint a CAPTCHA-k és a portok elrejtése az automatizált támadások visszaszorítása érdekében.",
      "A felhasználók megbeszélik, hogy a hatékonyság és eredményesség növelése érdekében hogyan implementáltak újra olyan eszközöket, mint az Endlessh a Golangban."
    ],
    "points": 145,
    "commentCount": 56,
    "retryCount": 0,
    "time": 1711606999
  }
]
