[
  {
    "id": 40184673,
    "title": "تحديث خوارزمية Google يعطل مدونة التكنولوجيا المناهضة للرأسمالية",
    "originLink": "https://theluddite.org/#!post/google-ads",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40184673",
    "commentBody": "",
    "originSummary": [
      "The Luddite ، وهي مدونة تقنية مناهضة للرأسمالية ، تروج للدعم والاشتراكات عبر Hall of Shame وتوفر تفاصيل الاتصال بأصدقاء The Luddite.",
      "يوصون باستخدام موجز RSS الخاص بهم في حالة تعطيل جافا سكريبت."
    ],
    "commentSummary": [
      "تركز المناقشة على الصراعات في الإعلان عبر الإنترنت ، خاصة فيما يتعلق بإعلانات Google ، وكيف تؤثر هيمنة Google على تصنيفات البحث وتجربة المستخدم.",
      "يناقش المستخدمون التلاعب بتحسين محركات البحث ، وانخفاض جودة نتائج البحث ، وأساليب تحقيق الدخل البديلة ، وكفاءة الإعلانات المستهدفة ، واحتكارات الإعلانات عبر الإنترنت ، والمخاوف الأخلاقية المتعلقة بالتلاعب بالنظام.",
      "تستكشف المحادثة أيضا كيف يؤثر سلوك المستخدم على تصنيفات البحث وتحقيق الدخل من مواقع الويب والصعوبات في اختيار الإعلانات المناسبة لمواقع الويب."
    ],
    "points": 658,
    "commentCount": 256,
    "retryCount": 0,
    "time": 1714261931
  },
  {
    "id": 40180821,
    "title": "SVGViewer: تحرير ملفات SVG وتصديرها وتحسينها",
    "originLink": "https://www.svgviewer.dev",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40180821",
    "commentBody": "",
    "originSummary": [
      "يتيح SVGViewer للمستخدمين عرض ملفات SVG وتحريرها وتصديرها وتحسينها ، بما في ذلك وظائف مثل التدوير والتقليب وتعديلات الأبعاد والتجميل.",
      "يمكن للمستخدمين أيضا مسح المحتوى وتحميل الملفات وتنزيل ملفات SVG ومشاركتها ومعاينتها باستخدام هذه الأداة.",
      "توفر الأداة خيارات التخصيص ، مع سياسات الخصوصية المتاحة ، والشروط والأحكام ، وآليات التعليقات."
    ],
    "commentSummary": [
      "تستكشف المناقشة العديد من أدوات SVG المستندة إلى الويب مثل SVG Viewer و SVGOMG و SVG Path Editor و SVG Shape Generator لعرض ملفات SVG وتحريرها وتحسينها بمستويات عالية من التحكم والتخصيص.",
      "يتحدث المستخدمون عن أداة تحسب الحد الأدنى من المربع المحيط للعناصر في SVG ، وتتلقى تعليقات إيجابية ، واقتراحات للتحسينات.",
      "بالإضافة إلى ذلك ، هناك ذكر لموقع ويب يقوم بترميز SVGs كعناوين URI للبيانات ، وتلقي تعليقات إيجابية ، وتوصيات مثل BoxySVG للتحرير و ChatGPT لإنشاء SVGs بناء على الأوصاف ، مما أثار آراء متباينة حول الصور التي تم إنشاؤها الذكاء الاصطناعي مقابل أدوات التحرير التقليدية ل SVGs."
    ],
    "points": 410,
    "commentCount": 65,
    "retryCount": 0,
    "time": 1714232634
  },
  {
    "id": 40182868,
    "title": "ابق بعيدا! - لعبة WebGL مع تحليلات جوجل",
    "originLink": "http://www.playkeepout.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40182868",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "يغطي موضوع المنتدى المناقشات حول الألعاب المستندة إلى الويب والمتصفح ، مع التركيز على Keep Out من عام 2015 ، حيث يشارك المستخدمون التعليقات حول طريقة اللعب وعناصر التحكم واقتراحات التحسينات.",
      "يسلط المستخدمون الضوء على الحاجة إلى إضافات مثل المستويات والتنوع وخيارات التخصيص وحل المشكلات الفنية ، بينما يتحدثون أيضا عن الألعاب المماثلة وبرامج زحف الأبراج المحصنة المستقلة وأدوات تطوير الألعاب.",
      "في حين أن التعليقات العامة إيجابية ، يذكر بعض المستخدمين مواجهة الأخطاء ويوصون بتحسينات على طريقة اللعب وعناصر التحكم."
    ],
    "points": 357,
    "commentCount": 108,
    "retryCount": 0,
    "time": 1714247350
  },
  {
    "id": 40179232,
    "title": "حدود نماذج اللغة الكبيرة في الاستدلال",
    "originLink": "https://www.strangeloopcanon.com/p/what-can-llms-never-do",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40179232",
    "commentBody": "",
    "originSummary": [
      "تتفوق نماذج اللغة الكبيرة (LLMs) في المهام المعقدة ولكنها تكافح مع فهم الأسئلة البسيطة وألعاب الكلمات والتفكير طويل المدى ، مما يشير إلى مجالات التحسين في موثوقية نموذج الذكاء الاصطناعي.",
      "يقترح دمج الذكاء البشري والذاكرة المنظمة في الشبكات العصبية ومعالجة قضايا مثل \"انحراف الهدف\" لتعزيز أداء LLMs في المهام غير التقليدية.",
      "التركيز على الحاجة إلى فهم أنماط الفشل الذكاء الاصطناعي ، وتحسين الموثوقية ، ومعالجة التحديات مثل التعميم واعتماد الدولة في مجموعات البيانات للتقدم في الذكاء الاصطناعي العام (AGI) وتقنيات التدريب الفعالة."
    ],
    "commentSummary": [
      "يتم انتقاد نماذج اللغة الكبيرة (LLMs) بسبب أوجه القصور في مهام مثل Wordle والتفكير المنطقي والبرمجة ، مما يلقي بظلال من الشك على قدرتها على تحقيق الذكاء الاصطناعي العام (AGI).",
      "على الرغم من أن LLMs تظهر الكفاءة في مجالات محددة ، إلا أنها تواجه تحديات في التعامل مع المهام المعقدة وإظهار قدرات التفكير المستقل.",
      "يتم التركيز على تحسين أداء LLM من خلال مطالبات أفضل ، والتدريب على حل المشكلات ، والاعتراف بقيودها ، مع معالجة المخاوف المتعلقة بالتحيزات والقيم والرقابة البشرية الأساسية في تطوير الذكاء الاصطناعي الأخلاقية."
    ],
    "points": 323,
    "commentCount": 251,
    "retryCount": 0,
    "time": 1714218529
  },
  {
    "id": 40179553,
    "title": "أتاري 2600 MovieCart: أفلام وصوت بالألوان الكاملة",
    "originLink": "https://github.com/lodefmode/moviecart",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40179553",
    "commentBody": "",
    "originSummary": [
      "تمكن برامج وأجهزة MovieCart المستخدمين من إنتاج خراطيش أفلام وصوت ملونة كاملة الطول ل Atari 2600 بدقة 80 × 262 وصوت أحادي 4 بت.",
      "تم تقديم MovieCart في عام 1977 ، ويقدم مجموعات الطلب المسبق على Tindie ، مما يسمح بالتحكم في السطوع والحجم وموضع المكوك بمعدل 60 إطارا في الثانية.",
      "يتطلب كل حقل على MovieCart 2.5K من البيانات ، مما يستلزم أكثر من نصف مليون خرطوشة لفيلم مدته ساعتان ، مع إخلاء مسؤولية حقوق الطبع والنشر للاستخدام العادل لأغراض مختلفة."
    ],
    "commentSummary": [
      "يناقش مستخدمو Github استخدام خراطيش الأفلام والصوت الملونة كاملة الطول لوحدات تحكم Atari 2600 ، مع الأخذ في الاعتبار إضافة المزيد من قوة الحوسبة إلى الأجهزة القديمة.",
      "تشمل المشاريع دمج رقائق ARM في الخراطيش وتشغيل البرامج الحديثة على الأنظمة القديمة ، وعرض الأفكار المبتكرة في الحوسبة الرجعية.",
      "المجتمع متحمس لتقنية ضغط محتملة لتخزين مكتبة أفلام كاملة على خرطوشة واحدة ، مما يعزز الإبداع والابتكار في هذا الفضاء."
    ],
    "points": 306,
    "commentCount": 34,
    "retryCount": 0,
    "time": 1714222195
  },
  {
    "id": 40180790,
    "title": "تطور Apple: التحديات في المشهد التكنولوجي المتغير",
    "originLink": "https://www.theverge.com/24141929/apple-iphone-imessage-antitrust-dma-lock-in",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40180790",
    "commentBody": "",
    "originSummary": [
      "تتحول Apple من قوة رائدة في مجال الهواتف الذكية إلى علامة تجارية تواجه تحديات في سوق مشبعة حيث أصبحت الهواتف الذكية في كل مكان.",
      "تعتمد الشركة بشكل كبير على مبيعات iPhone وتسعى جاهدة للسيطرة على نظامها البيئي من خلال ميزات وخدمات حصرية وسط معارك قانونية حول سياسات متجر التطبيقات.",
      "تخضع شركة آبل لتدقيق تنظيمي متزايد وتواجه منافسة تتحدى هيمنتها الطويلة الأمد في قطاع التكنولوجيا ، مما يشير إلى تحول محتمل في السوق."
    ],
    "commentSummary": [
      "يفحص المقال اتفاق Apple مع تأثير AT &T على نجاح iPhone في سوق الهواتف الخلوية في أمريكا الشمالية ويقارن ميزات التخصيص في Android و iPhone.",
      "ويؤكد على الدور المحوري للمطورين والمنظمين وجشع الصناعة في تشكيل سوق الهواتف المحمولة ، ومناقشة Android كرد فعل على قيود J2ME وتأثير iPhone على الصناعة.",
      "بالإضافة إلى ذلك ، فإنه يتعمق في تحولات القوة في التوزيع وتصفح الويب وابتكارات اللمس المتعدد من قبل iPhone ، وممارسات Apple التجارية ، وتعديلات OEM لنظامي Android و Windows ، وأهمية ثقة المستخدم واختياره والمنافسة في تعزيز الابتكار في تكنولوجيا الاتصالات."
    ],
    "points": 240,
    "commentCount": 350,
    "retryCount": 0,
    "time": 1714232301
  },
  {
    "id": 40182271,
    "title": "مصلحة الضرائب تقرر تجديد موقع ضريبة الملف المباشر",
    "originLink": "https://www.washingtonpost.com/business/2024/04/26/irs-direct-file/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40182271",
    "commentBody": "",
    "originSummary": [
      "أعلنت إدارة بايدن عن نجاح موقع الإيداع الضريبي المجاني Direct File ، والذي كان أقل من الميزانية واستقبله أكثر من 140,000 ألف أسرة لتقديم إقراراتهم الضريبية لعام 2023.",
      "استثمرت مصلحة الضرائب 10.5 مليون دولار في تطوير الموقع و 2.4 مليون دولار في التكاليف التشغيلية ، مما أدى إلى انخفاض النفقات لكل إقرار ضريبي تتم معالجته ، مع خطط لاتخاذ قرار بشأن تجديد البرنامج هذا الربيع.",
      "أثار النقاد ، بما في ذلك شركات إعداد الضرائب والجمهوريون ، مخاوف ، في حين ذكرت GSA أن غالبية مستخدمي Direct File أعطوا تقييمات إيجابية للموقع."
    ],
    "commentSummary": [
      "تتعمق المناقشة في تعقيدات النظام الضريبي الأمريكي ، ومعالجة مخاوف الخصوصية ، ومشاركة الحكومة في الإقرارات الضريبية ، وتأثيرها على الأسر ذات الدخل المنخفض.",
      "يتم تبادل وجهات نظر مختلفة فيما يتعلق بتبسيط قانون الضرائب ، ووصول الحكومة إلى البيانات المالية ، وضرورة إجراء إيداع ضريبي أكثر بساطة وانفتاحا.",
      "تستكشف المناقشات تضارب المصالح ، وتأثير المال على السياسات الضريبية ، ونقص تمويل مصلحة الضرائب ، وفوائد موقع الإيداع الضريبي بدون تكلفة ، وأدوار شركات إعداد الضرائب الخاصة ، وفعالية أنظمة الإيداع الضريبي التي تديرها الحكومة."
    ],
    "points": 221,
    "commentCount": 245,
    "retryCount": 0,
    "time": 1714242619
  },
  {
    "id": 40184434,
    "title": "أزمة نفايات المنسوجات: ابتكارات لمكافحة الأثر البيئي",
    "originLink": "https://grist.org/international/burn-after-wearing-fashion-waste-chile/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40184434",
    "commentBody": "",
    "originSummary": [
      "يتعمق المقال في التأثير البيئي لنفايات المنسوجات في صحراء أتاكاما في تشيلي ، ويسلط الضوء على حادث تفريغ ملابس وحريق كبير.",
      "على الرغم من الإجراءات القانونية والنشاط ، لا تزال نفايات الملابس قضية ملحة ، مما يؤدي إلى تطوير مبادرات إعادة التدوير والأزياء المستدامة في المنطقة.",
      "تقدم مدينة نيويورك ومناطق أخرى تشريعات لجعل صناعة الأزياء مسؤولة عن دعم برامج إعادة التدوير ، مما يعرض جهدا أوسع لمكافحة نفايات المنسوجات على مستوى العالم."
    ],
    "commentSummary": [
      "Grist.org تسهيل مناقشة حول التداعيات البيئية والمعضلات الأخلاقية المرتبطة بحرق الملابس الفائضة ، وآثار الموضة السريعة ، واستدامة عادات الاستهلاك.",
      "يناقش المشاركون الأساس المنطقي وراء إنتاج الملابس والتخلص منها بكميات كبيرة ، ومعالجة قضايا مثل القوالب النمطية الجنسانية ، والتوصية باستراتيجيات لإعادة استخدام وتسويق العناصر غير المستخدمة.",
      "يتوسع الحوار ليشمل موضوعات مثل تدمير المخزون المفرط ، والتخلص غير السليم من النفايات الطبية ، والمساهمات البشرية في التدهور البيئي ، وأساليب معالجة النفايات المتنوعة ، إلى جانب تبادل المشورة بشأن إطالة عمر الملابس واقتراح حلول إدارة النفايات البيئية."
    ],
    "points": 156,
    "commentCount": 90,
    "retryCount": 0,
    "time": 1714259440
  },
  {
    "id": 40181000,
    "title": "استكشاف ESPHome: مشاريع إلكترونية مبتكرة تعزز الحياة اليومية",
    "originLink": "https://news.ycombinator.com/item?id=40181000",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40181000",
    "commentBody": "",
    "originSummary": [
      "تم تسليط الضوء على ESPHome على موقع ويب رئيسي ، يعرض المستخدمين الذين يشاركون إبداعاتهم الإلكترونية.",
      "ينصب التركيز على استكشاف العديد من مشاريع الإلكترونيات التي عززت الحياة اليومية أو زادت من المتعة."
    ],
    "commentSummary": [
      "يسخر عشاق DIY قوة ESP8266 و ESP32 microcontrollers لمجموعة من المشاريع ، من أتمتة المنزل الذكي إلى البستنة والترفيه.",
      "يشارك أعضاء المجتمع النصائح والخبرات ويطلبون المشورة بشأن استخدام أجهزة الاستشعار والمحركات ومكونات الأجهزة المخصصة في إبداعاتهم المبتكرة.",
      "تسلط هذه المشاريع الضوء على مرونة وقدرات هذه المتحكمات الدقيقة في صياغة حلول مفيدة ومسلية لمختلف التطبيقات."
    ],
    "points": 154,
    "commentCount": 124,
    "retryCount": 0,
    "time": 1714233945
  },
  {
    "id": 40179015,
    "title": "فهم تقاطعات الطائرة في الفضاء 3D",
    "originLink": "https://alexharri.com/blog/planes",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40179015",
    "commentBody": "",
    "originSummary": [
      "تتعمق المقالة في تقنيات تحديد وحساب تقاطعات الطائرات في الفضاء ثلاثي الأبعاد (3D) ، مثل الاستفادة من المتجهات العادية والمنتجات النقطية والمنتجات المتقاطعة.",
      "ويناقش تحديد نقاط التقاطع، ومعالجة سيناريوهات المستويات المتوازية، وتعزيز كفاءة الحساب.",
      "يتضمن المحتوى مقتطفات التعليمات البرمجية ، ويقترح المزيد من القراءات ، ويسعى جاهدا لتعزيز فهم هندسة 3D لتحقيق مكاسب الكفاءة في تطبيقات البرامج مثل Arkio."
    ],
    "commentSummary": [
      "تستكشف المناقشة استخدام مصفوفات 4x4 لاشتقاق معادلات مستوية في الفضاء ثلاثي الأبعاد من رؤوس رباعي السطوح ، مع التركيز على إحداثيات الأفين الإسقاطية وتطبيق الجبر الخطي لفهم المستوى.",
      "يتعمق في دور المتجهات الثنائية في تمثيل المستويات ويسلط الضوء على أهمية الحدس والتصور في حل المشكلات ، ورسم روابط لنظرية النسبية العامة لأينشتاين ووجهات نظر كارل ماركس حول الابتكار.",
      "تعرض المحادثة أهمية فهم المفاهيم الرياضية للاختراقات العلمية ، كما يتضح من الإشارات التاريخية لشخصيات بارزة مثل أينشتاين وماركس."
    ],
    "points": 144,
    "commentCount": 44,
    "retryCount": 0,
    "time": 1714215657
  },
  {
    "id": 40182695,
    "title": "دعنا نملأ الفراغات: الحساب المخفي للمحول.",
    "originLink": "https://arxiv.org/abs/2404.15758",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40182695",
    "commentBody": "",
    "originSummary": [
      "يمكن للمحولات الاستفادة من رموز الحشو التي لا معنى لها لتحسين أدائها في المهام الخوارزمية الصعبة ، كما هو موضح في الدراسة.",
      "يتناول البحث الصعوبات في تعلم استخدام رموز الحشو ويثير مخاوف بشأن نماذج اللغة الكبيرة التي يحتمل أن تؤدي حسابات سرية.",
      "من خلال تقديم إطار نظري ، تحدد الورقة السيناريوهات التي تجلب فيها رموز الحشو مزايا وتقترح أن الرموز الإضافية يمكن أن توفر فوائد حسابية بغض النظر عن محتواها المحدد."
    ],
    "commentSummary": [
      "تتعمق الورقة في الحساب الخفي داخل نماذج لغة المحولات ، مع التركيز على دور رموز الحشو في التأثير على أداء النموذج.",
      "يمكن أن تؤدي زيادة الإسهاب ودمج رموز الحشو إلى تعزيز منطق النموذج وقدراته الحسابية ، على الرغم من أن النماذج الحالية تكافح للاستفادة من رموز الحشو بشكل فعال.",
      "تثير الدراسة أيضا مخاوف بشأن هجمات الباب الخلفي المرتبطة باستخدام رمز الحشو ، مما يؤكد أهمية البحث المستمر لتعزيز نماذج المحولات في الذكاء الاصطناعي ومعالجة التطورات المستقبلية المحتملة."
    ],
    "points": 138,
    "commentCount": 27,
    "retryCount": 0,
    "time": 1714246106
  },
  {
    "id": 40182555,
    "title": "احتضان قوة Makefiles",
    "originLink": "https://gagor.pro/2024/02/how-i-stopped-worrying-and-loved-makefiles/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40182555",
    "commentBody": "",
    "originSummary": [
      "تمت الإشادة ب Makefiles لتبسيط بناء البرامج ، والتعامل مع التبعيات ، والسماح بالإنشاءات المتوازية في مشاريع البرمجيات.",
      "يعرض المؤلف براعة Makefiles من خلال أتمتة المهام في مشاريع مختلفة مثل تكوين Postfix و Python و Terraform و Hugo و Pelican.",
      "يتم تشجيع القراء على استكشاف فوائد Makefiles نظرا لبساطتها وفائدتها للأتمتة ، مع روابط لموارد إضافية كمرجع."
    ],
    "commentSummary": [
      "تمت الإشادة ب Makefiles لإدارة التبعيات والمهام المتوازية بكفاءة ، على الرغم من أن بعض المستخدمين يجدون صعوبة في بناء الجملة.",
      "يقترح المستخدمون أداة CLI \"فقط\" كبديل أكثر سهولة في الاستخدام ل Makefiles ، حيث يقدمون نصائح حول تحسين قابلية قراءة makefile ووظائفه باستخدام أوامر awk و sed والأعمدة.",
      "تتعمق المناقشة في أدوات البناء البديلة مثل CMake و Ninja و Rakefiles ، وتعرض التفضيلات المتنوعة بين المطورين والعقبات التي يواجهونها ، بما في ذلك صراعات استخدام makefiles على Windows وإعادة اختراع العجلة بدلا من استخدام Make."
    ],
    "points": 126,
    "commentCount": 78,
    "retryCount": 0,
    "time": 1714244940
  },
  {
    "id": 40179619,
    "title": "Ubuntu Desktop 24.04 LTS: تمكين مطوري البرامج مفتوحة المصدر",
    "originLink": "https://ubuntu.com/blog/ubuntu-desktop-24-04-noble-numbat-deep-dive",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40179619",
    "commentBody": "",
    "originSummary": [
      "يستهدف Ubuntu Desktop 24.04 LTS ، المعروف أيضا باسم Noble Numbat ، مطوري البرامج مفتوحة المصدر والابتكار على مدار ال 12 عاما القادمة ، ويتميز بتحسينات في الأمان والتوافق والأداء.",
      "يعرض الإصدار ميزات مثل عمليات التثبيت المبسطة وخيارات التشفير المحسنة والتثبيت التلقائي المتكامل ومركز التطبيقات الجديد و GNOME 46 و Netplan 1.0 لاستقرار الشبكة ودعم GPO القوي مع Active Directory.",
      "ويؤكد على إنشاء أساس قوي للمساعي مفتوحة المصدر القادمة ويسلط الضوء على تحسينات إدارة البرامج الآمنة."
    ],
    "commentSummary": [
      "يستخدم أحد المستخدمين Xubuntu على كمبيوتر محمول قوي لمدة 16 عاما بسبب جماليات Xfce وقدراته الطرفية القوية ، باستخدام Vim لجميع الأعمال ، بما في ذلك أطروحة الدكتوراه الصينية الطويلة.",
      "تشمل المحادثة موضوعات مثل الاستثمار في أجهزة الكمبيوتر المحمولة عالية الأداء ، وإصدارات الدعم طويل الأجل (LTS) ، وتوزيعات Linux المختلفة ، وخيارات البرامج المكتبية ، وقيود الوسائط البصرية.",
      "تتضمن المناقشات أيضا قضايا توافق الأجهزة مع Linux على أجهزة الكمبيوتر المحمولة ، وتحديات استخدام Ubuntu على الأجهزة الحديثة ، وضرورة دعم الأجهزة المحسن لتوسيع جاذبية المستخدم ، مع التأكيد على التوازن بين برامج Linux وتوافق الأجهزة للحصول على تجربة مستخدم مواتية."
    ],
    "points": 125,
    "commentCount": 107,
    "retryCount": 0,
    "time": 1714222691
  },
  {
    "id": 40179398,
    "title": "تمكين DIY: نماذج الاستضافة الذاتية باستخدام n8n و NocoDB",
    "originLink": "https://karelvo.com/blog/selfhosting-forms-the-sane-way",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40179398",
    "commentBody": "",
    "originSummary": [
      "يناقش المؤلف نماذج الاستضافة الذاتية لمواقع الهوايات باستخدام n8n لمعالجة البيانات ، و NocoDB للتجميع ، وتنبيهات البريد الإلكتروني للإشعارات.",
      "يتم التركيز على المرونة والتحكم اللذين توفرهما هذه الأدوات مفتوحة المصدر ، متوازنة مع المخاوف المتعلقة بموثوقية الخادم.",
      "إعطاء الأولوية لحلول DIY ، يدعو المؤلف إلى إدارة مواقع الويب بشكل فعال باستخدام النماذج المستضافة ذاتيا."
    ],
    "commentSummary": [
      "تستكشف المقالة استخدام نماذج \"mailto:\" للاستضافة الذاتية دون معالجة الواجهة الخلفية ، مما يثير مخاوف بشأن تعرض البريد الإلكتروني لكاشطات الويب وإزعاج المستخدم.",
      "تغطي الموضوعات ترميز البيانات في نماذج البريد الإلكتروني ، والالتزامات القانونية للمواقع التجارية ، والإحباطات حول الاتصال عبر البريد الإلكتروني ، واقتراح أدوات بديلة لبناء النماذج مثل NocoDB و Airtable.",
      "تتضمن التوصيات الخاصة بأدوات بناء نماذج SaaS getinput.co و quillforms.com و heyform.net و snoopforms.com و Fillout."
    ],
    "points": 119,
    "commentCount": 90,
    "retryCount": 0,
    "time": 1714220429
  },
  {
    "id": 40183179,
    "title": "لجنة التجارة الفيدرالية تتهم المديرين التنفيذيين لشركة أمازون بتدمير الأدلة",
    "originLink": "https://www.theverge.com/2024/4/26/24141801/ftc-amazon-antitrust-signal-ephemeral-messaging-evidence",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40183179",
    "commentBody": "",
    "originSummary": [
      "اتهمت لجنة التجارة الفيدرالية المديرين التنفيذيين لشركة أمازون ، مثل جيف بيزوس وآندي جاسي ، باستخدام تطبيق المراسلة Signal لحذف الأدلة المحتملة المرتبطة بتحقيق مكافحة الاحتكار.",
      "يزعم أن أمازون لم تحتفظ بالرسائل ، مما أدى إلى شكوك في التدمير المتعمد للبيانات ذات الصلة ، مما دفع لجنة التجارة الفيدرالية إلى إجراء مزيد من التحقيق.",
      "يمكن فرض عقوبات على أمازون إذا ثبت أن الشركة كانت مهملة أو متعمدة في تعاملها مع حفظ المستندات ، حيث تسعى الوكالة للحصول على مزيد من المعلومات حول هذه المسألة."
    ],
    "commentSummary": [
      "يخضع المسؤولون التنفيذيون في أمازون للتحقيق بسبب احتمال محو الأدلة باستخدام تطبيقات مثل Signal ، مما يثير مخاوف بشأن لوائح الاحتفاظ بالرسائل في أماكن العمل.",
      "يسلط النقاش الضوء على أهمية حقوق الخصوصية والشفافية والمساءلة في الاتصالات ، لا سيما في بيئات الحكومة والشركات.",
      "كما تتم مناقشة استخدام تطبيقات المراسلة سريعة الزوال ، وتوازن مراقبة الخصوصية ، والاحتفاظ بالبريد الإلكتروني / المستندات لأسباب قانونية ، وإثبات إخفاء البيانات المتعمد. تتطرق المحادثة بإيجاز إلى القوة المميتة وتعدد استخدامات الأسلحة النارية."
    ],
    "points": 117,
    "commentCount": 126,
    "retryCount": 0,
    "time": 1714249601
  }
]
