[
  {
    "id": 39084137,
    "title": "Flipper Zero: univerzálny multifunkčný nástroj pre hackerov a geekov",
    "originLink": "https://flipperzero.one",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39084137",
    "commentBody": "",
    "originSummary": [
      "Flipper Zero je prenosné multifunkčné zariadenie určené pre pentesterov a geekov, ktoré ponúka možnosti prispôsobenia a otvoreného zdroja na hacking digitálnych systémov, ako sú rádiové protokoly, systémy kontroly prístupu a hardvér.",
      "Je vybavený 1,4\" monochromatickým displejom LCD, päťtlačidlovým smerovým panelom a rôznymi možnosťami pripojenia, ako sú Bluetooth, NFC a infračervené pripojenie.",
      "Zariadenie dokáže čítať a emulovať karty RFID, má slot na kartu microSD na ukladanie a možno ho ovládať samostatne alebo ho pripojiť k počítaču či smartfónu a využívať pokročilé funkcie, vďaka čomu je skúmanie a vývoj hardvéru príjemnejší a pohodlnejší."
    ],
    "commentSummary": [
      "Flipper Zero je všestranné multifunkčné zariadenie s rôznymi funkciami vrátane funkcie infračerveného diaľkového ovládania.",
      "V porovnaní s inými alternatívami a čínskymi značkami s infračervenými blastermi v telefónoch vyvolal diskusie o jeho cenovej dostupnosti.",
      "Zariadenie čelilo kontroverziám a obmedzeniam vrátane rozbíjania iPhonov, zákazu zo strany Amazonu a obavám o možnosti výmeny údajov a dôsledkov na súkromie."
    ],
    "points": 429,
    "commentCount": 197,
    "retryCount": 0,
    "time": 1705879671
  },
  {
    "id": 39078669,
    "title": "NASA obnovila spojenie s minivrtulníkom na Marse počas výpadku komunikácie",
    "originLink": "https://phys.org/news/2024-01-nasa-regains-contact-mini-helicopter.amp",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39078669",
    "commentBody": "",
    "originSummary": [
      "NASA úspešne obnovila kontakt so svojou minivrtulníkom na Marse po prerušení komunikácie.",
      "Poskytnutý kód CSS sa používa na štylizáciu rôznych prvkov na webovej lokalite, ako sú funkcie, omrvinky, správy o kontrole faktov a posuvné menu.",
      "Kód zabezpečuje konzistentný vizuálny vzhľad webových stránok a obsahuje mediálne dotazy pre responzívny dizajn."
    ],
    "commentSummary": [
      "NASA úspešne obnovila komunikáciu so svojou minivrtulníkom Ingenuity na Marse poháňaným Linuxom.",
      "Diskusia sa točí okolo vývoja softvéru pre misiu vrátane použitia skriptov Python a potenciálu zníženia nákladov v leteckom priemysle.",
      "Zdôrazňujú sa stratégie spoločnosti SpaceX na znižovanie nákladov a vlastnú výrobu komponentov, ako aj význam radiačného vytvrdzovania v kritických aplikáciách. Skúma sa aj potenciálne využitie vrtuľníkov na Marse a výzvy pri navrhovaní leteckých systémov na prieskum Marsu."
    ],
    "points": 379,
    "commentCount": 127,
    "retryCount": 0,
    "time": 1705847018
  },
  {
    "id": 39078372,
    "title": "Obmedzenia hesla: Vyhnite sa funkciám Vybrať, Vložiť, Aktualizovať, Odstrániť, Odstrániť",
    "originLink": "https://id.uni-lj.si/DigitalnaIdentiteta/PonastavitevGesla?culture=en-GB",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39078372",
    "commentBody": "",
    "originSummary": [
      "Táto stránka sa používa na resetovanie hesla digitálnej identity.",
      "Používatelia sú povinní poskytnúť svoje osobné údaje a používateľské meno na obnovenie hesla.",
      "Heslo musí byť silné a spĺňať určité kritériá."
    ],
    "commentSummary": [
      "Diskusie pokrývajú celý rad tém týkajúcich sa zabezpečenia hesiel, firewallov webových aplikácií, šifrovania, nesprávneho nakladania s údajmi a osvedčených postupov pri správe databáz.",
      "Účastníci preskúmajú zraniteľnosti spojené s heslami, útokmi SQL injection, ukladaním obyčajného textu a nesprávnym spracovaním vstupných údajov používateľa.",
      "Odporúčania zahŕňajú správne ukladanie hesiel, sanitizáciu vstupov, parametrizovaný jazyk SQL a používanie vrstiev šifrovania."
    ],
    "points": 357,
    "commentCount": 225,
    "retryCount": 0,
    "time": 1705844805
  },
  {
    "id": 39086106,
    "title": "Zraniteľnosť GPT-3.5: Chybne napísaná fráza spôsobuje chybové hlásenie a vyvoláva obavy z otravy údajov",
    "originLink": "https://iter.ca/post/gpt-crash/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39086106",
    "commentBody": "",
    "originSummary": [
      "Pridanie špecifickej frázy na začiatok odpovede do ChatGPT 3.5 neustále vyvoláva chybovú správu.",
      "Táto chyba sa nevyskytuje pri GPT-4 ani pri používaní rozhrania API GPT-3.5.",
      "Chyba je pravdepodobne spôsobená procesom tokenizácie, ktorý sa používa v modeloch OpenAI GPT.",
      "Konkrétna fráza je nesprávne napísaný názov možnosti, ktorý sa nachádza v konfiguračných súboroch XML pre softvér Katalon Studio.",
      "Súbor údajov použitý na trénovanie GPT-3.5 mohol vylúčiť súbory XML, čo viedlo k tomu, že model nevedel o nesprávne napísanom tokene a vytváral nesprávne odpovede.",
      "Toto zistenie vyvoláva obavy z možného otrávenia údajov a oslabenia sumarizačných schopností GPT-3.5."
    ],
    "commentSummary": [
      "Diskusia sa zameriava na jazykové modely umelej inteligencie, najmä na poruchy so špecifickými tokenmi, generovanie tokenov a ich vplyv na konverziu textu.",
      "Rozhovor zahŕňa témy, ako sú tréningové súbory, tokenizéry a vzhľad a funkčnosť modelov GPT-3.5 a GPT-4.",
      "Používatelia majú zmiešané názory na vizuálne problémy, rýchlosť a užitočnosť GPT-4 s API, ako aj skepsu voči prístupu OpenAI a schopnosti dokázať myslieť."
    ],
    "points": 284,
    "commentCount": 73,
    "retryCount": 0,
    "time": 1705896927
  },
  {
    "id": 39077867,
    "title": "Legendárne laboratórium Bell Labs sa chystá opustiť svoj domov v New Jersey, vyvoláva nostalgické spomienky",
    "originLink": "https://www.nj.com/essex/2024/01/remembering-bell-labs-as-legendary-idea-factory-prepares-to-leave-nj-home.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39077867",
    "commentBody": "",
    "originSummary": [
      "Spoločnosť Nokia Bell Labs, známa svojimi prelomovými vynálezmi, presúva svoje sídlo z Murray Hill do nového technologického centra v New Brunswicku, čo vyvoláva nostalgiu medzi súčasnými a bývalými zamestnancami.",
      "Cieľom presťahovania do inovačného centra HELIX v New Brunswicku, ktoré sa má začať v roku 2025, je vytvoriť najmodernejšie výskumné a vývojové zariadenie, ktoré bude spĺňať potreby výskumníkov spoločnosti Bell Labs.",
      "Napriek tomuto kroku Bell Labs nepredpokladá zníženie počtu zamestnancov a naďalej sa venuje inováciám a vytváraniu transformačných technológií."
    ],
    "commentSummary": [
      "Spoločnosť Nokia Bell Labs sa sťahuje z New Jersey do New Brunswicku, čo vyvoláva diskusie o historickom význame areálu Murray Hill a nového inovačného centra HELIX.",
      "V rozhovore sa rozoberajú rôzne témy, ako sú významné stavby, osobné skúsenosti a odporúčania na knihy.",
      "Obdivujú sa spoločnosti zamerané na výskum, ako sú Bell Labs, a požaduje sa viac koncentrovaných výskumných a vývojových centier."
    ],
    "points": 220,
    "commentCount": 120,
    "retryCount": 0,
    "time": 1705840317
  },
  {
    "id": 39084146,
    "title": "Vedci vyvinuli peptidovú zlúčeninu zameranú na proteín podporujúci rakovinu",
    "originLink": "https://phys.org/news/2024-01-scientists-chaotic-protein-fueling-cancers.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39084146",
    "commentBody": "",
    "originSummary": [
      "Vedci z Kalifornskej univerzity v Riverside vytvorili peptidovú zlúčeninu, ktorá je zameraná na proteín MYC, ktorý sa bežne vyskytuje v rakovinových bunkách.",
      "Úpravou štruktúry peptidu výskumníci zvýšili jeho schopnosť interagovať s MYC, čo mu umožnilo silnú väzbu na proteín.",
      "Tento vývoj je prísľubom pre vývoj nových spôsobov liečby rakoviny a výskumníci sa zameriavajú na zlepšenie schopnosti peptidu vstupovať do buniek."
    ],
    "commentSummary": [
      "Vedci identifikovali molekulu, ktorá dokáže blokovať aktivitu proteínu MYC, ktorý je zodpovedný za 75 % prípadov rakoviny.",
      "Tento objav ponúka potenciálnu možnosť liečby rakoviny, ale jeho účinnosť, spôsob podávania a možné vedľajšie účinky zatiaľ nie sú známe.",
      "Aj keď ide o sľubný vývoj, je dôležité poznamenať, že je stále v počiatočnom štádiu a nebol testovaný na ľuďoch. Výskum rakoviny je zložitá oblasť a jeho úspech nie je zaručený, ale zohráva dôležitú úlohu pri napredovaní v liečbe rakoviny."
    ],
    "points": 219,
    "commentCount": 37,
    "retryCount": 0,
    "time": 1705879784
  },
  {
    "id": 39078417,
    "title": "Spoločnosť Google priznáva sledovanie používateľov v režime Inkognito napriek tvrdeniam o ochrane osobných údajov",
    "originLink": "https://news.abplive.com/technology/google-incognito-new-disclaimer-canary-version-you-are-being-tracked-even-in-google-incognito-mode-new-disclaimer-is-up-privacy-lawsuit-1658159",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39078417",
    "commentBody": "",
    "originSummary": [
      "Spoločnosť Google aktualizovala svoje vyhlásenie o odmietnutí zodpovednosti pre režim Inkognito, aby bolo jasné, že napriek tvrdeniam o ochrane súkromia sa údaje používateľov stále zhromažďujú.",
      "V aktualizovanom vyhlásení o odmietnutí zodpovednosti sa uvádza, že hoci ostatní používatelia toho istého zariadenia neuvidia aktivitu používateľa, navštívené webové lokality a používané služby vrátane samotnej spoločnosti Google budú naďalej zhromažďovať údaje.",
      "To potvrdzuje podozrenie, že spoločnosť Google sleduje aktivity používateľov, aj keď sú v režime Inkognito, preto používateľom odporúčame, aby boli pri jeho používaní opatrní."
    ],
    "commentSummary": [
      "V súčasnosti prebieha diskusia o postupoch sledovania v režime inkognito a o možnom vplyve na súkromie používateľov.",
      "Niektorí používatelia tvrdia, že spoločnosť Google stále sleduje ich aktivitu aj v režime inkognito, zatiaľ čo iní spochybňujú rozsah sledovania a jeho prepojenie s reláciami bez režimu inkognito.",
      "Medzi návrhy na zachovanie súkromia patrí používanie alternatívnych prehliadačov alebo nástrojov zameraných na ochranu súkromia, pričom spoločnosť Google žiada jasnejšiu komunikáciu o obmedzeniach režimu inkognito."
    ],
    "points": 209,
    "commentCount": 163,
    "retryCount": 0,
    "time": 1705845212
  },
  {
    "id": 39078061,
    "title": "Byvoly vzdorujú starnutiu: Niektoré žijú aj po 100 rokoch a zostávajú zdravé",
    "originLink": "https://www.nationalgeographic.com/premium/article/buffalofish-oldest-hundred-years-mystery",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39078061",
    "commentBody": "",
    "originSummary": [
      "Nedávna štúdia uskutočnená v jazere Apache v Arizone zistila, že byvoly, druh sladkovodných rýb, sa môžu dožiť viac ako 100 rokov a majú silný imunitný systém a reakcie na stres, keď starnú.",
      "Predtým sa predpokladalo, že byvoly sa dožívajú len do 20 rokov.",
      "Zistenia naznačujú, že ďalší výskum dlhovekosti byvolov by mohol priniesť poznatky o predlžovaní života stavovcov vrátane ľudí. Okrem toho štúdia zdôrazňuje potrebu úsilia o ochranu, keďže populácie byvolov klesajú a v súčasnosti neexistujú žiadne predpisy týkajúce sa ich lovu."
    ],
    "commentSummary": [
      "Diskusia sa venuje rôznym témam, napríklad dĺžke života druhov rýb, vplyvu nesmrteľnosti na spoločnosť, pokroku v technológiách predlžovania života a problémom preľudnenia.",
      "Zdôrazňuje význam prispôsobivosti, spoločenskej spravodlivosti a potenciálnej potreby vládnych zásahov.",
      "Konverzácia obsahuje okrem vážnych diskusií aj humorné a sarkastické poznámky."
    ],
    "points": 204,
    "commentCount": 133,
    "retryCount": 0,
    "time": 1705842071
  },
  {
    "id": 39081948,
    "title": "Štandard C23 zavádza nové funkcie do programovacieho jazyka C",
    "originLink": "https://lemire.me/blog/2024/01/21/c23-a-slightly-better-c/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39081948",
    "commentBody": "",
    "originSummary": [
      "Kód demonštruje rôzne funkcie zavedené v štandarde C23, ako sú smernice preprocesora a atribúty funkcií.",
      "Venuje sa aj binárnym literálom, operátoru typeof, oddeľovačom číslic v číselných literáloch, kľúčovému slovu constexpr, kľúčovému slovu static_assert a logickým poliam.",
      "Autor sa delí o svoje postrehy týkajúce sa nových funkcií a diskutuje o ich potenciálnych výhodách a vplyve na vývoj kódu."
    ],
    "commentSummary": [
      "Článok poukazuje na vylepšenia programovacieho jazyka C23 vrátane nových funkcií a problémov s kompatibilitou s rôznymi kompilátormi.",
      "Preberajú sa témy ako návrhové vzory, trigrafy a hľadanie programovacieho jazyka, ktorý ponúka pamäťovú bezpečnosť a dobre spolupracuje s knižnicami jazyka C.",
      "Medzi potenciálne alternatívne jazyky patria Go, Rust, Zig, D, Nim a Swift. Článok sa zaoberá aj rozdielmi medzi jazykmi C a C++ a poskytuje názory na ich silné a slabé stránky."
    ],
    "points": 199,
    "commentCount": 154,
    "retryCount": 0,
    "time": 1705865032
  },
  {
    "id": 39080003,
    "title": "Naučte sa Datalog: Interaktívny výukový program pre databázový dopytovací jazyk",
    "originLink": "https://www.learndatalogtoday.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39080003",
    "commentBody": "",
    "originSummary": [
      "\"Naučte sa Datalog dnes\" je interaktívny výukový program, ktorý učí dialekt Datomic, deklaratívny databázový dopytovací jazyk.",
      "Učebnica zahŕňa témy, ako je dopytovanie, dátové vzory, transformačné funkcie a ďalšie.",
      "Bol napísaný pre projekt Lisp In Summer Projects 2013 a je otvorený pre návrhy na zlepšenie na GitHube."
    ],
    "commentSummary": [
      "Diskusia sa zaoberá rozdielmi medzi Datalogom a tradičným datalogom a zdôrazňuje jeho obmedzenia a výhody.",
      "Implementácie a aplikácie Datalogu v rôznych databázach a dotazovacích jazykoch demonštrujú jeho všestrannosť.",
      "Diskutuje sa o alternatívnych nástrojoch a jazykoch pre rekurzívne uvažovanie a deduktívne dotazy, ktoré poskytujú ďalšie možnosti skúmania týchto konceptov."
    ],
    "points": 181,
    "commentCount": 47,
    "retryCount": 0,
    "time": 1705855120
  },
  {
    "id": 39085830,
    "title": "Prístup k údajom Národnej parkovej služby pomocou rozhrania NPS Data API",
    "originLink": "https://www.nps.gov/subjects/digital/nps-data-api.htm",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39085830",
    "commentBody": "",
    "originSummary": [
      "Rozhranie API pre údaje Národného parku (NPS) je k dispozícii vývojárom, ktorí môžu využívať údaje NPS vo svojich projektoch, ako sú aplikácie, mapy a webové stránky.",
      "API ponúka rôzne informácie o upozorneniach, článkoch, kempoch, podujatiach, učebných plánoch, správach, parkoch a návštevníckych centrách.",
      "Vývojári môžu získať prístup k zdrojom API a zaregistrovať sa pre kľúč API na webovej stránke NPS Data API, pričom v pláne API NPS sú uvedené budúce aktualizácie a vylepšenia API."
    ],
    "commentSummary": [
      "Služba národných parkov USA API čelí problémom kvôli nedostatočnému počtu zamestnancov a nedostatočnému financovaniu, čo vedie k obavám používateľov.",
      "Používatelia našli alternatívne metódy prístupu k údajom, ale vznikajú diskusie o nákladoch a závislosti na dodávateľoch tretích strán.",
      "Diskutuje sa o témach, ako je platenie za verejné údaje, obmedzenia prístupu a používanie kľúčov API na overovanie a ochranu pred DDoS, ako aj o účinnosti a nevyhnutnosti obmedzovania rýchlosti a alternatívnych spôsoboch overovania. Spomínajú sa aj bezpečnostné obavy súvisiace s kľúčmi API."
    ],
    "points": 172,
    "commentCount": 104,
    "retryCount": 0,
    "time": 1705893920
  },
  {
    "id": 39077622,
    "title": "Prečo je škaredá estetika trendom v móde a dizajne",
    "originLink": "https://www.nplusonemag.com/issue-44/the-intellectual-situation/why-is-everything-so-ugly/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39077622",
    "commentBody": "",
    "originSummary": [
      "Článok skúma rastúci trend \"škaredej estetiky\" v móde a dizajne.",
      "Skúma možné dôvody popularity tohto trendu.",
      "Článok kladie otázky o spoločenských hodnotách a estetických preferenciách v súčasnej kultúre."
    ],
    "commentSummary": [
      "Článok skúma vplyv LED svetiel na nočnú atmosféru miest a význam zachovania historickej estetiky.",
      "Skúma trendy a preferencie v oblasti dizajnu a estetiky, ako aj výzvy pri výstavbe jedinečných a krásnych stavieb.",
      "Účastníci diskutujú o rôznych faktoroch, ako je vplyv osvetlenia na spánok, osobná estetika, ekonomické hľadisko pri výstavbe a subjektívna povaha krásy."
    ],
    "points": 168,
    "commentCount": 260,
    "retryCount": 0,
    "time": 1705837607
  }
]
