[
  {
    "id": 38841080,
    "title": "لاعب Tetris يسجل رقما قياسيا عالميا جديدا ، ويؤدي إلى تحطم اللعبة بعد 34 عاما",
    "originLink": "https://www.youtube.com/watch?v=GuJ5UuknsHU",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38841080",
    "commentBody": "",
    "originSummary": [
      "لاعب Tetris Blue Scuti يسجل رقما قياسيا عالميا جديدا من خلال الوصول إلى المستوى 157 وإحداث تحطم لعبة يعرف باسم \"True\" Killscreen.",
      "يتجاوز هذا الإنجاز السجلات والتقنيات السابقة ، حيث يعرض التطورات في طريقة اللعب والاستراتيجية.",
      "أدت مستويات الألوان المشوهة التي وصل إليها الذكاء الاصطناعي يدعى stackrabbit وتمرير Blue Scuti العرضي لتحطم اللعبة إلى تنشيط مجتمع Tetris ، مما ألهم استراتيجيات جديدة ومطاردات قياسية."
    ],
    "commentSummary": [
      "تغطي التعليقات مجموعة من الموضوعات المتعلقة بلعبة Tetris ، مثل استراتيجيات اللعب ، والوصول إلى المعالم ، وشرح المصطلحات المتخصصة.",
      "تمت مناقشة تحقيق تنفيذ التعليمات البرمجية التعسفي في NES Tetris ، والذي يعرض براعة ومهارة اللاعب.",
      "تشمل الموضوعات الأخرى مفهوم الوصول إلى \"شاشة القتل\" ، واستغلال الخلل في الألعاب ، وقيود الأجهزة والبرامج ، والاستمتاع بالألعاب كنشاط ترفيهي."
    ],
    "points": 550,
    "commentCount": 155,
    "retryCount": 0,
    "time": 1704199582
  },
  {
    "id": 38844274,
    "title": "إصلاح الأعمى DIY: إصلاح الستائر الخاصة بك بسهولة مع قطع الغيار ومقاطع الفيديو التعليمية",
    "originLink": "https://fixmyblinds.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38844274",
    "commentBody": "",
    "originSummary": [
      "يقدم الموقع خدمة إصلاح الستائر DIY ، وتوفير قطع الغيار ومقاطع الفيديو التعليمية.",
      "تمت مساعدة أكثر من 1 مليون شخص في إصلاح ستائرهم بمساعدة هذا الموقع.",
      "يقدر العملاء قائمة الأجزاء التفصيلية والتسليم السريع ، بالإضافة إلى الموارد لفهم كيفية عمل الستائر."
    ],
    "commentSummary": [
      "تغطي المناقشات موضوعات مثل الستائر والمصاريع وتوافر قطع الغيار لإصلاح الأجهزة.",
      "يشارك المشاركون تجاربهم مع إصلاحات افعلها بنفسك ويعبرون عن إحباطهم من الأجهزة الحديثة.",
      "تتضمن المحادثة أيضا مناقشات حول قيمة إصلاح الأجهزة مقابل شراء أجهزة جديدة وتذكر مواقع ويب محددة مثل fixmyblinds.com وخيارات الستائر الآلية."
    ],
    "points": 525,
    "commentCount": 122,
    "retryCount": 0,
    "time": 1704216705
  },
  {
    "id": 38847613,
    "title": "إحياء متصفح Dillo: يقوم المستخدم بإحياء المشروع بعد انتهاء صلاحية المجال",
    "originLink": "https://dillo-browser.github.io/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38847613",
    "commentBody": "",
    "originSummary": [
      "انتهت صلاحية المضيف dillo.org في منتصف عام 2022 ، مما أدى إلى تعطل موقع Dillo على الويب ، والريبو الزئبقي ، والقائمة البريدية ، وخادم البريد الإلكتروني لمطوري Dillo.",
      "تدخل مستخدم لمنع المشروع من الموت عن طريق تحميل نسخة من الريبو إلى GitHub ، وإجراء صيانة التعليمات البرمجية ، وإنشاء صفحة ويب جديدة.",
      "قام المستخدم بإجراء تحسينات على Dillo ، مثل إضافة دعم لبروتوكولات متعددة وتنفيذ CI المناسب مع اختبارات العرض. إنهم يخططون لإصدار الإصدار 3.1 بعد الاختبار ويسعون للحصول على تعليقات ومساهمات من المستخدمين."
    ],
    "commentSummary": [
      "تم إحياء متصفح Dillo ، الذي تم إزالته سابقا ، بواسطة مطور قام بتحميل الكود إلى GitHub.",
      "أجرى المطور تحسينات على المتصفح ، بما في ذلك دعم OpenSSL و mbedTLS ، ويسعى للحصول على تعليقات ومساهمات من المستخدمين.",
      "يقدر المستخدمون كفاءة Dillo وسرعتها على الأجهزة المنخفضة ، لكنهم يناقشون القيود مثل مشكلات تشغيل الفيديو ونقاط الضعف في التعليمات البرمجية الخاصة به. كما يناقشون توافق المتصفحات خفيفة الوزن مع أنظمة التشغيل المختلفة."
    ],
    "points": 446,
    "commentCount": 122,
    "retryCount": 0,
    "time": 1704232508
  },
  {
    "id": 38840626,
    "title": "صعود LLMs والبرمجة في عام 2024",
    "originLink": "http://antirez.com/news/140",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38840626",
    "commentBody": "",
    "originSummary": [
      "تكتسب برامج LLMs (ماجستير في القانون) ومهارات البرمجة شعبية في أوائل عام 2024.",
      "يناقش المقال الأسباب الكامنة وراء الاهتمام المتزايد ب LLMs ومهارات البرمجة.",
      "يوفر نظرة ثاقبة حول الفوائد والفرص الوظيفية المحتملة المرتبطة بمجالات الدراسة هذه."
    ],
    "commentSummary": [
      "يتمتع المستخدمون بتجارب مختلفة مع نماذج اللغة في مساعدة التعليمات البرمجية ، حيث يجدونها مفيدة لإنشاء التعليمات البرمجية والأتمتة ولكن أيضا ملاحظة القيود في التغطية والموثوقية.",
      "هناك نقاش حول تأثير مساعدة التعليمات البرمجية الآلية على إزاحة الوظائف ، مع اختلاف الآراء حول فوائدها والمخاوف بشأن فقدان الوظائف.",
      "تتم مناقشة نماذج اللغة في أدوات التعاون وتحرير التعليمات البرمجية ، مع مشاركة المستخدمين للخبرات واقتراح التحسينات. بشكل عام ، تعمل النماذج اللغوية على تحسين إنتاجية البرمجة وكفاءتها ، لكن المستخدمين يؤكدون على أهمية الخبرة البشرية ويحذرون من الاعتماد المفرط على أدوات الذكاء الاصطناعي."
    ],
    "points": 416,
    "commentCount": 267,
    "retryCount": 0,
    "time": 1704195837
  },
  {
    "id": 38842977,
    "title": "دعوة جميع الباحثين عن عمل: فرص التوظيف في يناير 2024 - العمل عن بعد والتدريب الداخلي ورعاية التأشيرة المتاحة",
    "originLink": "https://news.ycombinator.com/item?id=38842977",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38842977",
    "commentBody": "",
    "originSummary": [
      "يطلب البيان من الأفراد مشاركة فرص العمل والكشف عما إذا كان العمل عن بعد أو التدريب الداخلي أو رعاية التأشيرة متاحا.",
      "تنصح بعدم الشكوى من إعلانات الوظائف وتقدم روابط لمنصات البحث عن عمل.",
      "يذكر مواضيع أخرى لأولئك الذين يبحثون عن عمل أو فرص عمل مستقل."
    ],
    "commentSummary": [
      "يجمع هذا المنشور فرص العمل من مختلف الشركات في مختلف الصناعات ، بما في ذلك المناصب في هندسة البرمجيات الذكاء الاصطناعي والتعلم الآلي وتحليل البيانات.",
      "تقدم العديد من الشركات المذكورة خيار العمل عن بعد وتقديم مزايا تنافسية.",
      "أمثلة على الشركات المدرجة في القائمة هي Apple و JP Morgan Chase and Co و Datadog و AngelList."
    ],
    "points": 341,
    "commentCount": 272,
    "retryCount": 0,
    "time": 1704211278
  },
  {
    "id": 38849580,
    "title": "الرئيس التنفيذي لشركة موزيلا يحصل على زيادة بنسبة 20٪ على الرغم من انخفاض الإيرادات ، والتركيز على الذكاء الاصطناعي يثير تساؤلات",
    "originLink": "https://www.theregister.com/2024/01/02/mozilla_in_2024_ai_privacy/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38849580",
    "commentBody": "",
    "originSummary": [
      "حصل الرئيس التنفيذي لشركة موزيلا ، ميتشل بيكر ، على تعويض أعلى على الرغم من انخفاض الإيرادات ، مما أثار دعوات لوتيرة أسرع من الشركة.",
      "يحدد التقرير الذكاء الاصطناعي ، لا سيما في قطاع الرعاية الصحية ، كمحور رئيسي لخطط موزيلا المستقبلية.",
      "هناك مخاوف بشأن ما إذا كان التركيز على الذكاء الاصطناعي سيؤدي إلى ابتكار حقيقي أو مجرد إضافة ضحلة إلى عروض الشركة. يؤكد التقرير أيضا على تفاني موزيلا في الخصوصية والتشفير وأمن البيانات."
    ],
    "commentSummary": [
      "يدور النقاش حول العديد من القضايا المتعلقة ب Mozilla ورئيسها التنفيذي ، مثل انتقادات الإدارة ، وانخفاض مخاوف الإيرادات ، وعدم الرضا عن ميزات Firefox ، ومناقشات تعويض الرئيس التنفيذي ، ومستقبل سوق المتصفحات.",
      "هناك مزيج من الآراء حول موزيلا وعروضها ، حيث أعرب البعض عن الدعم والبعض الآخر عن الإحباط والدعوة إلى إجراء تغييرات."
    ],
    "points": 332,
    "commentCount": 233,
    "retryCount": 0,
    "time": 1704245359
  },
  {
    "id": 38843388,
    "title": "تبسيط استقطاعات الرواتب باستخدام مخطط التبعية: تجربة صاحب عمل كندي",
    "originLink": "https://www.daemonology.net/blog/2023-12-31-Canadian-payroll-dependency-chart.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38843388",
    "commentBody": "",
    "originSummary": [
      "يشارك الكاتب تجربته في استخدام مستند \"صيغ استقطاعات الرواتب\" التابع لوكالة الإيرادات الكندية لحساب استقطاعات الرواتب لأعمالهم الصغيرة في كندا.",
      "يصفون المستند بأنه معقد ويتطلب تقليبا مستمرا بين الأقسام للعثور على الحسابات اللازمة.",
      "لتبسيط العملية ، أنشأ الكاتب مخطط تبعية باستخدام GraphViz مع 79 عقدة ، مما يسمح لهم بتحديد أولويات العمليات الحسابية بشكل أكثر فعالية."
    ],
    "commentSummary": [
      "تغطي المناقشة عبر الإنترنت مواضيع مختلفة مثل حسابات الرواتب ، ومدفوعات الرهن العقاري ، والخدمات المصرفية المفتوحة ، وقوانين الضرائب ، والإيداع الضريبي ، وخطط التقاعد ، والأنظمة الحكومية.",
      "يعبر المشاركون عن إحباطهم من التعقيد وانعدام الشفافية في العمليات المالية مثل حساب كشوف المرتبات والوصول إلى بيانات الحساب المصرفي.",
      "هناك مناقشات حول تحديات التنقل في قوانين الضرائب ، وتقديم الضرائب كمقاول مستقل ، وفهم مساهمات صاحب العمل في حسابات التقاعد."
    ],
    "points": 318,
    "commentCount": 273,
    "retryCount": 0,
    "time": 1704212768
  },
  {
    "id": 38844943,
    "title": "قم بإجراء OCR على جهاز Mac باستخدام CLI أو Python مجانا",
    "originLink": "https://blog.greg.technology/2024/01/02/how-do-you-ocr-on-a-mac.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38844943",
    "commentBody": "",
    "originSummary": [
      "يشارك المؤلف دليلا حول كيفية إجراء OCR على جهاز Mac باستخدام واجهة سطر الأوامر أو Python ، دون أي تكلفة.",
      "يتم توفير إرشادات خطوة بخطوة لإعداد خدمة OCR محلية باستخدام تطبيق الاختصارات وتشغيل OCR على صورة باستخدام الاختصار الذي تم إنشاؤه.",
      "يتضمن المنشور أيضا مقتطف شفرة Python لتنفيذ OCR على ملف."
    ],
    "commentSummary": [
      "يناقش المستخدمون OCR (التعرف الضوئي على الأحرف) على منصات مختلفة مثل Mac و iOS و macOS ، ويشاركون الخبرات مع أدوات مثل Apple Vision و Tesseract.",
      "تشمل الموضوعات التي يتم تناولها الدقة ودعم اللغة واستخراج الجدول والتعرف على خط اليد واستخدام الاختصارات.",
      "تم ذكر قيود OCR لأحرف معينة ، بالإضافة إلى إمكانية استخدام Python للمهام المتقدمة."
    ],
    "points": 289,
    "commentCount": 76,
    "retryCount": 0,
    "time": 1704219656
  },
  {
    "id": 38845878,
    "title": "سوء استخدام الذكاء الاصطناعي في برنامج مكافأة الأخطاء من curl و libcurl يؤدي إلى تقارير أمنية خاطئة",
    "originLink": "https://daniel.haxx.se/blog/2024/01/02/the-i-in-llm-stands-for-intelligence/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38845878",
    "commentBody": "",
    "originSummary": [
      "يتم إساءة استخدام الذكاء الاصطناعي (الذكاء الاصطناعي) في برنامج مكافأة الأخطاء الخاص ب curl و libcurl ، مما يؤدي إلى إنشاء تقارير أمنية خاطئة.",
      "يقدم المؤلف أمثلة على التقارير التي تم إنشاؤها الذكاء الاصطناعي والتي بدت مشروعة ولكنها كانت غير صحيحة في النهاية.",
      "هناك حاجة إلى أدوات أفضل للكشف عن التقارير التي تم إنشاؤها الذكاء الاصطناعي ، ويقترح المؤلف إضافة فحص بشري لتحسين الدقة.",
      "يتوقع المؤلف زيادة في القمامة الناتجة عن الذكاء الاصطناعي في صناديق البريد الوارد لتقرير الأخطاء."
    ],
    "commentSummary": [
      "يثير استخدام التقارير الأمنية التي يتم إنشاؤها بواسطة الذكاء الاصطناعي مخاوف بشأن اللغة غير الشبيهة بالإنسان المستخدمة والحاجة إلى اتصال حقيقي.",
      "هناك جدل حول سوء استخدام وكسل الاستجابات التي يتم إنشاؤها الذكاء الاصطناعي ، والتي يمكن أن تقلل من جودة برامج مكافأة الأخطاء.",
      "تسلط المناقشات الضوء أيضا على الإحباط من التقارير الآلية والأفراد الذين يفتقرون إلى الفهم والسياق في عمليات تقديم الثغرات الأمنية."
    ],
    "points": 272,
    "commentCount": 95,
    "retryCount": 0,
    "time": 1704223726
  },
  {
    "id": 38847719,
    "title": "يمكن للمتصفحات تعطيل الاحتكار الثنائي للجوال",
    "originLink": "https://infrequently.org/2024/01/the-web-is-the-app-store/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38847719",
    "commentBody": "",
    "originSummary": [
      "يفشل المراسلون التقنيون في الإبلاغ بشكل كاف عن الاضطراب المحتمل للاحتكار الثنائي لتطبيقات الأجهزة المحمولة بواسطة المتصفحات.",
      "تعيق Apple و Google نمو تطبيقات الويب التقدمية ، مما يؤكد الحاجة إلى اختيار المتصفح والمنافسة.",
      "تتم مناقشة دور المنظمين في تشكيل التشريعات والتحديات التي تواجهها المتصفحات غير Chrome ، إلى جانب سيطرة Apple على الويب وتأثيرها على المطورين."
    ],
    "commentSummary": [
      "يستكشف المقال هيمنة Apple و Google في صناعة الهواتف المحمولة وتأثيرها على تطوير التطبيقات وتوزيعها.",
      "يناقش قيود متصفحات الويب مقارنة بالتطبيقات الأصلية وتحديات تحقيق الدخل من تطبيقات الويب.",
      "يتعمق المقال أيضا في قضايا مثل الخصوصية وتحكم المستخدم والحاجة إلى منصات وأسواق بديلة في صناعة الهواتف المحمولة."
    ],
    "points": 212,
    "commentCount": 261,
    "retryCount": 0,
    "time": 1704233106
  },
  {
    "id": 38841708,
    "title": "اصطدمت JAL A350 بخفر السواحل DH8C ، مما أدى إلى إشعال النار على مدرج طوكيو",
    "originLink": "http://avherald.com/h?article=5132b9fe",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38841708",
    "commentBody": "",
    "originSummary": [
      "اصطدمت طائرة إيرباص A350 تابعة للخطوط الجوية اليابانية بطائرة خفر السواحل اليابانية Dash 8-300 على مدرج مطار طوكيو هانيدا ، مما أدى إلى نشوب حريق ووفيات.",
      "تم إجلاء جميع الركاب البالغ عددهم 379 راكبا على متن A350 بأمان ، ولكن لسوء الحظ ، لم ينج 5 من أصل 6 ركاب على داش 8.",
      "لا يزال سبب الحادث قيد التحقيق ، وقد بدأت المناقشات حول أخطاء مراقبة الحركة الجوية وسلامة الطائرات وتخصيص الموارد."
    ],
    "commentSummary": [
      "يدور النقاش حول سلامة الطيران ، ويغطي الحوادث في مطار طوكيو ، ومشاكل الاتصال مع مراقبة الحركة الجوية ، وأهمية بروتوكولات الإخلاء.",
      "يستكشف التوازن بين المضايقات وتدابير السلامة ، مثل استخدام الأجهزة الإلكترونية أثناء الرحلات الجوية والقيود المفروضة على استخدام الكمبيوتر المحمول.",
      "وتسلط المحادثة الضوء على موثوقية وقيود السيارات ذاتية القيادة وإمكانية دمج الأنظمة الآلية في مجال الطيران، مع التأكيد على أهمية التقدم المستمر والحد من المخاطر في صناعة الطيران."
    ],
    "points": 179,
    "commentCount": 459,
    "retryCount": 0,
    "time": 1704204522
  },
  {
    "id": 38845461,
    "title": "اتخاذ الإجراءات: الطريق إلى النجاح",
    "originLink": "https://twitter.com/addyosmani/status/1739052802314539371",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38845461",
    "commentBody": "",
    "originSummary": [
      "يسلط الاقتباس الضوء على أهمية أخذ زمام المبادرة والشروع في رحلة نحو النجاح ، حتى لو لم تكن خالية من العيوب.",
      "وهذا يعني أنه يمكن إجراء تعديلات وتعزيزات مع إحراز تقدم."
    ],
    "commentSummary": [
      "تشمل المناقشة مجموعة واسعة من موضوعات تطوير البرمجيات ، مثل تحديد أولويات العمليات ، وميزات إمكانية الوصول ، والاختيار بين تطبيقات Electron والتطبيقات الأصلية.",
      "يتم تسليط الضوء على أهمية تحسين البرامج وتحديات صنع القرار.",
      "تتم مناقشة التعليمات البرمجية النظيفة والقابلة للصيانة والأساليب المختلفة لتطوير البرمجيات."
    ],
    "points": 165,
    "commentCount": 122,
    "retryCount": 0,
    "time": 1704221824
  },
  {
    "id": 38842571,
    "title": "ذئب البحر: مغامرات توماس كوكرين في القيادة البحرية والنشاط السياسي",
    "originLink": "https://sergey.substack.com/p/thomas-cochrane",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38842571",
    "commentBody": "",
    "originSummary": [
      "كان توماس كوكرين ، إيرل دوندونالد 10 ، يتمتع بمهنة رائعة كقائد بحري وناشط سياسي.",
      "على الرغم من محاكمته العسكرية في وقت مبكر من حياته المهنية ، أصبح كوكرين معروفا بتكتيكاته الذكية ومناوراته الجريئة في الاستيلاء على سفن العدو.",
      "شارك كوكرين أيضا في الأنشطة السياسية والحملات ضد الفساد وعمل كعضو في البرلمان.",
      "لعب كوكرين دورا مهما في حروب الاستقلال المختلفة ، بما في ذلك حروب تشيلي والبرازيل واليونان.",
      "على الرغم من الجدل والسجن والنكسات الشخصية ، تركت شخصية كوكرين الشجاعة إرثا دائما.",
      "تعلمنا قصة كوكرين درسين رئيسيين: الاستخدام الحكيم للمتفجرات وإمكانية النجاح في المساعي التي تبدو ميؤوسا منها."
    ],
    "commentSummary": [
      "يستكشف هذا المنشور خيارات توماس كوكرين في التعليم والسياسة ، ويقارنها بالحفلات ويناقش استراتيجية حملته في المناطق الفاسدة.",
      "يذكر قانون الإصلاح لعام 1832 وتأثيره على البرلمان ، وكذلك قانون إلغاء العبودية لعام 1833 وعلاقة اللورد كوكرين بالبحرية التشيلية.",
      "تنحرف المحادثة إلى دور الشتات الأيرلندي في حركات الاستقلال وتتعمق في الكتب حول التاريخ البحري ، بما في ذلك مقارنة بين سلسلة Hornblower و Aubrey / Maturin ، ومناقشات حول تصوير الشخصية والدقة التاريخية ، ويذكر حجم ووزن البنادق التي يحملها كوكرين."
    ],
    "points": 165,
    "commentCount": 59,
    "retryCount": 0,
    "time": 1704209265
  },
  {
    "id": 38842788,
    "title": "اليابان تحتضن التنمية الذكاء الاصطناعي: حقوق التأليف والنشر لا تنطبق على التدريب",
    "originLink": "https://www.biia.com/japan-goes-all-in-copyright-doesnt-apply-to-ai-training/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38842788",
    "commentBody": "",
    "originSummary": [
      "لن تفرض الحكومة اليابانية حقوق الطبع والنشر على البيانات المستخدمة في التدريب الذكاء الاصطناعي لتعزيز التقدم التكنولوجي الذكاء الاصطناعي.",
      "تهدف هذه الخطوة إلى وضع اليابان كقائد الذكاء الاصطناعي وربما زيادة ناتجها المحلي الإجمالي بنسبة 50٪ أو أكثر.",
      "لدى الفنانين والمبدعين مخاوف ، بينما يدفع القطاعان الأكاديمي والتجاري من أجل تخفيف قوانين البيانات للاستفادة من الفوائد. وتسعى اليابان أيضا إلى التأثير على اللوائح الذكاء الاصطناعي العالمية داخل مجموعة ال 7 والوصول إلى موارد البيانات الغربية لأغراض التدريب، والمساهمة في النقاش حول التنظيم العالمي والمنافسة في التنمية الذكاء الاصطناعي."
    ],
    "commentSummary": [
      "تستكشف المناقشة الجوانب المختلفة لقوانين حقوق الطبع والنشر وآثارها على الذكاء الاصطناعي ، بما في ذلك المحتوى الذي تم إنشاؤه الذكاء الاصطناعي ، وبيانات التدريب ، وتكرار الأساليب الفنية ، والتحقق من حقوق الطبع والنشر ، والمزيد.",
      "تم تسليط الضوء على حكم اليابان الأخير بشأن حق المؤلف الذكاء الاصطناعي كدراسة حالة.",
      "توجد آراء مختلفة حول كيفية تطبيق قوانين حق المؤلف على الذكاء الاصطناعي والحاجة إلى إصلاح محتمل لقانون حق المؤلف."
    ],
    "points": 162,
    "commentCount": 157,
    "retryCount": 0,
    "time": 1704210463
  }
]
