[
  {
    "id": 38841080,
    "title": "Tetris-pelaaja teki uuden maailmanennätyksen, ja peli kaatui 34 vuoden jälkeen",
    "originLink": "https://www.youtube.com/watch?v=GuJ5UuknsHU",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38841080",
    "commentBody": "",
    "originSummary": [
      "Tetris-pelaaja Blue Scuti tekee uuden maailmanennätyksen saavuttamalla tason 157 ja käynnistämällä pelin kaatumisen, joka tunnetaan nimellä \"True\" Killscreen.",
      "Tämä saavutus ylittää aiemmat ennätykset ja tekniikat ja osoittaa pelattavuuden ja strategian kehittymistä.",
      "Stackrabbit-nimisen tekoälyn saavuttamat glitched-väritasot ja Blue Scutin vahingossa tapahtunut pelin kaatuminen ovat elvyttäneet Tetris-yhteisöä ja innoittaneet uusiin strategioihin ja ennätysten jahtaamiseen."
    ],
    "commentSummary": [
      "Kommentit käsittelevät erilaisia Tetris-peliin liittyviä aiheita, kuten pelistrategioita, virstanpylväiden saavuttamista ja erikoisterminologian selittämistä.",
      "Keskustellaan NES Tetriksessä saavutetusta mielivaltaisen koodin suorittamisesta, joka osoittaa pelaajan kekseliäisyyden ja taidon.",
      "Muita aiheita ovat muun muassa käsite \"tapporuudun\" saavuttaminen, häiriöiden hyödyntäminen peleissä, laitteistojen ja ohjelmistojen rajoitukset sekä pelaamisesta nauttiminen virkistystoimintana."
    ],
    "points": 550,
    "commentCount": 155,
    "retryCount": 0,
    "time": 1704199582
  },
  {
    "id": 38844274,
    "title": "DIY Blind Repair: Korjaa kaihtimet helposti varaosien ja opetusvideoiden avulla.",
    "originLink": "https://fixmyblinds.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38844274",
    "commentBody": "",
    "originSummary": [
      "Verkkosivusto tarjoaa DIY-kaihtimien korjauspalvelua, jossa on varaosia ja opetusvideoita.",
      "Yli 1 miljoonaa ihmistä on saanut apua kaihtimiensa korjaamisessa tämän verkkosivuston avulla.",
      "Asiakkaat arvostavat yksityiskohtaista osaluetteloa ja nopeaa toimitusta sekä resursseja, joiden avulla he ymmärtävät, miten kaihtimet toimivat."
    ],
    "commentSummary": [
      "Keskusteluissa käsitellään muun muassa kaihtimia, ikkunaluukkuja ja varaosien saatavuutta kodinkoneiden korjauksia varten.",
      "Osallistujat jakavat kokemuksiaan tee-se-itse -korjauksista ja ilmaisevat turhautumisensa nykyaikaisiin laitteisiin.",
      "Keskustelussa keskustellaan myös kodinkoneiden korjaamisen arvosta verrattuna uusien ostamiseen ja mainitaan erityisiä verkkosivustoja, kuten fixmyblinds.com, sekä moottoroidut kaihtimet."
    ],
    "points": 525,
    "commentCount": 122,
    "retryCount": 0,
    "time": 1704216705
  },
  {
    "id": 38847613,
    "title": "Dillo-selaimen herättäminen henkiin: Käyttäjä elvyttää projektin verkkotunnuksen päättymisen jälkeen",
    "originLink": "https://dillo-browser.github.io/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38847613",
    "commentBody": "",
    "originSummary": [
      "Host dillo.org päättyi vuoden 2022 puolivälissä, mikä johti Dillon verkkosivuston, mercurial-repojen, postituslistan ja Dillon kehittäjien sähköpostipalvelimen alasajoon.",
      "Eräs käyttäjä esti projektin kuoleman lataamalla kopion reposta GitHubiin, tekemällä koodin ylläpitoa ja luomalla uuden verkkosivun.",
      "Käyttäjä on tehnyt parannuksia Dilloon, kuten lisännyt tuen useille protokollille ja toteuttanut kunnollisen CI:n renderöintitesteillä. Hän aikoo julkaista version 3.1 testauksen jälkeen ja pyytää palautetta ja panosta käyttäjiltä."
    ],
    "commentSummary": [
      "Dillo-selaimen, joka oli aiemmin poistettu käytöstä, on elvyttänyt kehittäjä, joka latasi koodin GitHubiin.",
      "Kehittäjä on tehnyt selaimeen parannuksia, mukaan lukien OpenSSL- ja mbedTLS-tuki, ja pyytää käyttäjiltä palautetta ja panosta.",
      "Käyttäjät arvostavat Dillon tehokkuutta ja nopeutta low-end-koneilla, mutta keskustelevat rajoituksista, kuten videon toistoon liittyvistä ongelmista ja koodin haavoittuvuuksista. He keskustelevat myös kevyiden selainten yhteensopivuudesta eri käyttöjärjestelmien kanssa."
    ],
    "points": 446,
    "commentCount": 122,
    "retryCount": 0,
    "time": 1704232508
  },
  {
    "id": 38840626,
    "title": "LLM:n ja ohjelmoinnin nousu vuonna 2024",
    "originLink": "http://antirez.com/news/140",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38840626",
    "commentBody": "",
    "originSummary": [
      "LLM-ohjelmat (oikeustieteen maisterit) ja ohjelmointitaidot kasvattavat suosiotaan vuoden 2024 alussa.",
      "Artikkelissa käsitellään syitä, jotka ovat syynä lisääntyneeseen kiinnostukseen LLM-opintoja ja ohjelmointitaitoja kohtaan.",
      "Se tarjoaa tietoa näihin opintoaloihin liittyvistä eduista ja mahdollisista uramahdollisuuksista."
    ],
    "commentSummary": [
      "Käyttäjillä on vaihtelevia kokemuksia kielimalleista koodin avustamisessa, ja he pitävät niitä hyödyllisinä koodin luomisessa ja automatisoinnissa, mutta toteavat myös rajoituksia kattavuudessa ja luotettavuudessa.",
      "Automaattisen koodauksen vaikutuksesta työpaikkojen siirtymiseen käydään keskustelua, ja sen hyödyistä ja työpaikkojen menetyksistä ollaan eri mieltä.",
      "Keskustellaan yhteistyö- ja koodinmuokkaustyökalujen kielimalleista, ja käyttäjät jakavat kokemuksiaan ja ehdottavat parannuksia. Kaiken kaikkiaan kielimallit parantavat ohjelmoinnin tuottavuutta ja tehokkuutta, mutta käyttäjät korostavat inhimillisen asiantuntemuksen merkitystä ja varoittavat liiallisesta luottamisesta tekoälytyökaluihin."
    ],
    "points": 416,
    "commentCount": 267,
    "retryCount": 0,
    "time": 1704195837
  },
  {
    "id": 38842977,
    "title": "Kutsu kaikille työnhakijoille: Tammikuu 2024 - Etätyö, harjoittelupaikat ja viisumisponsorointi saatavilla",
    "originLink": "https://news.ycombinator.com/item?id=38842977",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38842977",
    "commentBody": "",
    "originSummary": [
      "Lausunnossa pyydetään henkilöitä kertomaan työmahdollisuuksista ja ilmoittamaan, onko tarjolla etätyötä, harjoittelupaikkoja tai viisumisponsorointia.",
      "Se kehottaa olemaan valittamatta työpaikkailmoituksista ja tarjoaa linkkejä työnhakualustoihin.",
      "Siinä mainitaan muita aiheita niille, jotka etsivät työtä tai freelance-mahdollisuuksia."
    ],
    "commentSummary": [
      "Tähän postaukseen on koottu avoimia työpaikkoja eri yrityksiltä eri toimialoilta, muun muassa ohjelmistosuunnittelun, tekoälyn, koneoppimisen ja data-analyysin aloilta.",
      "Monet mainituista yrityksistä tarjoavat mahdollisuuden etätyöhön ja kilpailukykyisiä etuja.",
      "Esimerkkejä listalla olevista yrityksistä ovat Apple, JP Morgan Chase & Co, Datadog ja AngelList."
    ],
    "points": 341,
    "commentCount": 272,
    "retryCount": 0,
    "time": 1704211278
  },
  {
    "id": 38849580,
    "title": "Mozillan toimitusjohtaja saa 20 prosentin palkankorotuksen laskevista tuloista huolimatta, keskittyminen tekoälyyn herättää kysymyksiä",
    "originLink": "https://www.theregister.com/2024/01/02/mozilla_in_2024_ai_privacy/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38849580",
    "commentBody": "",
    "originSummary": [
      "Mozillan toimitusjohtaja Mitchell Baker sai korkeamman korvauksen tulojen laskusta huolimatta, mikä sai yhtiön vaatimaan nopeampaa tahtia.",
      "Raportissa todetaan, että tekoäly, erityisesti terveydenhuoltoalalla, on Mozillan tulevaisuuden suunnitelmien keskeinen painopistealue.",
      "On huolestuttavaa, johtaako tekoälyn painottaminen todelliseen innovointiin vai onko se vain pinnallinen lisä yhtiön tarjontaan. Raportissa korostetaan myös Mozillan sitoutumista yksityisyyteen, salaukseen ja tietoturvaan."
    ],
    "commentSummary": [
      "Keskustelu pyörii useiden Mozillaa ja sen toimitusjohtajaa koskevien kysymysten ympärillä, kuten johdon kritiikki, huoli tulojen vähenemisestä, tyytymättömyys Firefoxin ominaisuuksiin, toimitusjohtajan palkkiokeskustelut ja selainmarkkinoiden tulevaisuus.",
      "Mielipiteet Mozillasta ja sen tarjonnasta vaihtelevat, ja jotkut kannattavat sitä, toiset taas ovat turhautuneita ja vaativat muutoksia."
    ],
    "points": 332,
    "commentCount": 233,
    "retryCount": 0,
    "time": 1704245359
  },
  {
    "id": 38843388,
    "title": "Palkkavähennysten yksinkertaistaminen riippuvuustaulukon avulla: Kanadalaisen yrityksen omistajan kokemuksia",
    "originLink": "https://www.daemonology.net/blog/2023-12-31-Canadian-payroll-dependency-chart.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38843388",
    "commentBody": "",
    "originSummary": [
      "Kirjoittaja kertoo kokemuksestaan, jonka hän on saanut käyttämällä Kanadan veroviraston \"Payroll Deductions Formulas\" -asiakirjaa palkkavähennysten laskemiseen pienyritykselleen Kanadassa.",
      "He kuvaavat asiakirjaa monimutkaiseksi ja vaativat jatkuvaa jaksojen välillä selaamista tarvittavien laskelmien löytämiseksi.",
      "Prosessin yksinkertaistamiseksi kirjoittaja loi GraphViz-ohjelmalla riippuvuustaulukon, jossa oli 79 solmua ja jonka avulla hän pystyi priorisoimaan laskelmat tehokkaammin."
    ],
    "commentSummary": [
      "Verkkokeskustelussa käsitellään erilaisia aiheita, kuten palkanlaskentaa, asuntolainojen maksamista, avointa pankkitoimintaa, verolakeja, veroilmoituksia, eläkesuunnitelmia ja viranomaisjärjestelmiä.",
      "Osallistujat ovat turhautuneita rahoitusprosessien, kuten palkanlaskennan ja pankkitilitietojen käytön, monimutkaisuuteen ja avoimuuden puutteeseen.",
      "Keskustelua käydään verolakien noudattamiseen liittyvistä haasteista, verojen ilmoittamisesta itsenäisenä yrittäjänä ja työnantajan eläkemaksujen ymmärtämisestä."
    ],
    "points": 318,
    "commentCount": 273,
    "retryCount": 0,
    "time": 1704212768
  },
  {
    "id": 38844943,
    "title": "Suorita OCR Macilla CLI:n tai Pythonin avulla ilmaiseksi",
    "originLink": "https://blog.greg.technology/2024/01/02/how-do-you-ocr-on-a-mac.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38844943",
    "commentBody": "",
    "originSummary": [
      "Kirjoittaja jakaa oppaan siitä, miten OCR voidaan suorittaa Macilla komentorivikäyttöliittymän tai Pythonin avulla ilman kustannuksia.",
      "Paikallisen OCR-palvelun luominen OCR-sovelluksen avulla ja OCR-toiminnon suorittaminen kuvaan luodun pikakuvakkeen avulla on ohjeistettu vaiheittain.",
      "Postaus sisältää myös Python-koodinpätkän OCR:n suorittamiseksi tiedostoon."
    ],
    "commentSummary": [
      "Käyttäjät keskustelevat OCR:stä (optinen merkintunnistus) eri alustoilla, kuten Mac, iOS ja macOS, ja jakavat kokemuksiaan työkaluista, kuten Apple Vision ja Tesseract.",
      "Käsiteltäviä aiheita ovat muun muassa tarkkuus, kielituki, taulukkojen poiminta, käsialan tunnistus ja pikanäppäinten käyttö.",
      "Lisäksi mainitaan OCR:n rajoitukset tiettyjen merkkien osalta sekä Pythonin käyttömahdollisuudet kehittyneissä tehtävissä."
    ],
    "points": 289,
    "commentCount": 76,
    "retryCount": 0,
    "time": 1704219656
  },
  {
    "id": 38845878,
    "title": "Tekoälyn väärinkäyttö curl- ja libcurl-ohjelmien bugipalkkio-ohjelmassa johtaa vääriin tietoturvaraportteihin",
    "originLink": "https://daniel.haxx.se/blog/2024/01/02/the-i-in-llm-stands-for-intelligence/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38845878",
    "commentBody": "",
    "originSummary": [
      "Tekoälyä (AI) käytetään väärin curl- ja libcurl-ohjelmien bugipalkkio-ohjelmassa, mikä tuottaa vääriä tietoturvaraportteja.",
      "Kirjoittaja antaa esimerkkejä tekoälyn luomista raporteista, jotka näyttivät laillisilta mutta olivat lopulta virheellisiä.",
      "Tekoälyn tuottamien raporttien havaitsemiseksi tarvitaan parempia työkaluja, ja kirjoittaja ehdottaa, että tarkkuuden parantamiseksi lisätään ihmisen tekemä tarkistus.",
      "Kirjoittaja ennustaa tekoälyn tuottaman roskan lisääntyvän heidän vikailmoitustensa postilaatikoissa."
    ],
    "commentSummary": [
      "Tekoälyn tuottamien turvallisuusraporttien käyttö herättää huolta siitä, että käytetty kieli ei ole ihmismäistä ja että viestinnän on oltava aitoa.",
      "Keskustelua käydään tekoälyn tuottamien vastausten väärinkäytöstä ja laiskuudesta, mikä saattaa heikentää virhepalkkio-ohjelmien laatua.",
      "Keskusteluissa korostetaan myös turhautumista automaattisiin raportteihin ja sitä, että yksittäiset henkilöt eivät ymmärrä haavoittuvuusilmoituksia ja niiden asiayhteyttä."
    ],
    "points": 272,
    "commentCount": 95,
    "retryCount": 0,
    "time": 1704223726
  },
  {
    "id": 38847719,
    "title": "Selaimet voivat häiritä matkapuhelinten duopolia.",
    "originLink": "https://infrequently.org/2024/01/the-web-is-the-app-store/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38847719",
    "commentBody": "",
    "originSummary": [
      "Teknologiatoimittajat eivät raportoi riittävästi siitä, että selaimet saattavat häiritä mobiilisovellusten duopolia.",
      "Apple ja Google haittaavat progressiivisten verkkosovellusten kasvua ja korostavat selainvalinnan ja kilpailun tarvetta.",
      "Lisäksi keskustellaan sääntelyviranomaisten roolista lainsäädännön muotoilussa ja muiden kuin Chrome-selainten kohtaamista haasteista sekä Applen määräysvallasta verkossa ja sen vaikutuksesta kehittäjiin."
    ],
    "commentSummary": [
      "Artikkelissa tarkastellaan Applen ja Googlen valta-asemaa mobiilialalla ja niiden vaikutusta sovellusten kehittämiseen ja jakeluun.",
      "Siinä käsitellään verkkoselaimien rajoituksia verrattuna natiivisovelluksiin ja verkkosovellusten rahaksi muuttamisen haasteita.",
      "Artikkelissa tarkastellaan myös yksityisyyden suojaa, käyttäjien valvontaa sekä vaihtoehtoisten alustojen ja markkinapaikkojen tarvetta mobiilialalla."
    ],
    "points": 212,
    "commentCount": 261,
    "retryCount": 0,
    "time": 1704233106
  },
  {
    "id": 38841708,
    "title": "JAL A350 törmäsi rannikkovartioston DH8C:hen sytyttäen tulipalon Tokion kiitoradalla.",
    "originLink": "http://avherald.com/h?article=5132b9fe",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38841708",
    "commentBody": "",
    "originSummary": [
      "Japan Airlinesin Airbus A350 -lentokone törmäsi Japanin rannikkovartioston Dash 8-300 -lentokoneeseen Tokion Hanedan lentoaseman kiitoradalla, mikä johti tulipaloon ja kuolonuhreihin.",
      "Kaikki A350-koneen 379 matkustajaa evakuoitiin turvallisesti, mutta valitettavasti Dash 8 -koneen kuudesta matkustajasta viisi ei selvinnyt hengissä.",
      "Onnettomuuden syytä tutkitaan edelleen, ja lennonjohdon virheistä, lentoturvallisuudesta ja resurssien jakamisesta on aloitettu keskustelut."
    ],
    "commentSummary": [
      "Keskustelu pyörii lentoturvallisuuden ympärillä, ja siinä käsitellään Tokion lentokentällä sattuneita vaaratilanteita, lennonjohdon viestintäongelmia ja evakuointiprotokollien merkitystä.",
      "Siinä tarkastellaan tasapainoa haittojen ja turvallisuustoimenpiteiden välillä, kuten elektronisten laitteiden käyttöä lennoilla ja kannettavien tietokoneiden käyttöä koskevia rajoituksia.",
      "Keskustelussa korostetaan itseajavien autojen luotettavuutta ja rajoituksia sekä mahdollisuutta integroida automatisoituja järjestelmiä ilmailuun ja korostetaan samalla jatkuvan kehityksen ja riskien vähentämisen merkitystä ilmailuteollisuudessa."
    ],
    "points": 179,
    "commentCount": 459,
    "retryCount": 0,
    "time": 1704204522
  },
  {
    "id": 38845461,
    "title": "Toiminta: Menestyksen tie",
    "originLink": "https://twitter.com/addyosmani/status/1739052802314539371",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38845461",
    "commentBody": "",
    "originSummary": [
      "Lainauksessa korostetaan, että on tärkeää tehdä aloitteita ja lähteä matkalle kohti menestystä, vaikka se ei olisikaan virheetön.",
      "Se tarkoittaa, että mukautuksia ja parannuksia voidaan tehdä sitä mukaa kuin edistystä tapahtuu."
    ],
    "commentSummary": [
      "Keskustelussa käsitellään monenlaisia ohjelmistokehitykseen liittyviä aiheita, kuten prosessien priorisointia, saavutettavuusominaisuuksia ja valintaa Electron- ja natiivisovellusten välillä.",
      "Ohjelmistojen optimoinnin tärkeyttä ja päätöksenteon haasteita korostetaan.",
      "Keskustellaan puhtaasta ja ylläpidettävästä koodista sekä erilaisista ohjelmistokehityksen lähestymistavoista."
    ],
    "points": 165,
    "commentCount": 122,
    "retryCount": 0,
    "time": 1704221824
  },
  {
    "id": 38842571,
    "title": "Merisusi: Thomas Cochranen seikkailut laivaston komentajana ja poliittisena aktivistina",
    "originLink": "https://sergey.substack.com/p/thomas-cochrane",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38842571",
    "commentBody": "",
    "originSummary": [
      "Thomas Cochrane, Dundonaldin kymmenes jaarli, teki merkittävän uran merivoimien komentajana ja poliittisena aktivistina.",
      "Vaikka Cochrane joutui sotaoikeuteen uransa alkuvaiheessa, hän tuli tunnetuksi nokkelista taktiikoistaan ja rohkeista manöövereistään vihollisalusten kaappaamisessa.",
      "Cochrane osallistui myös poliittiseen toimintaan, kampanjoi korruptiota vastaan ja toimi parlamentin jäsenenä.",
      "Cochranella oli merkittävä rooli useissa itsenäisyyssodissa, kuten Chilen, Brasilian ja Kreikan itsenäisyyssodissa.",
      "Kiistoista, vangitsemisesta ja henkilökohtaisista takaiskuista huolimatta Cochranen peloton luonne jätti pysyvän perinnön.",
      "Cochranen tarina opettaa kaksi keskeistä asiaa: räjähteiden viisaan käytön ja menestymisen mahdollisuudet näennäisen toivottomissa yrityksissä."
    ],
    "commentSummary": [
      "Tässä postauksessa tarkastellaan Thomas Cochranen valintoja koulutuksen ja politiikan alalla, asetetaan ne vastakkain juhlimisen kanssa ja keskustellaan hänen kampanjastrategiastaan korruptoituneissa piireissä.",
      "Siinä mainitaan vuoden 1832 uudistuslaki ja sen vaikutus parlamenttiin sekä vuoden 1833 orjuuden lakkauttamislaki ja lordi Cochranen yhteys Chilen laivastoon.",
      "Keskustelussa käsitellään irlantilaisen diasporan roolia itsenäisyysliikkeissä ja syvennytään merenkulun historiaa käsitteleviin kirjoihin, kuten Hornblower- ja Aubrey/Maturin-sarjojen vertailuun, hahmojen esittämiseen ja historialliseen tarkkuuteen liittyviin keskusteluihin sekä Cochranen kantamien aseiden kokoa ja painoa koskeviin mainintoihin."
    ],
    "points": 165,
    "commentCount": 59,
    "retryCount": 0,
    "time": 1704209265
  },
  {
    "id": 38842788,
    "title": "Japani omaksuu tekoälyn kehityksen: Tekijänoikeudet eivät koske koulutusta",
    "originLink": "https://www.biia.com/japan-goes-all-in-copyright-doesnt-apply-to-ai-training/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38842788",
    "commentBody": "",
    "originSummary": [
      "Japanin hallitus ei aio valvoa tekoälykoulutuksessa käytettävien tietojen tekijänoikeuksia edistääkseen tekoälyteknologian kehittymistä.",
      "Tavoitteena on nostaa Japani tekoälyalan johtavaksi maaksi ja kasvattaa Japanin bruttokansantuotetta 50 prosentilla tai enemmän.",
      "Taiteilijat ja luovan työn tekijät ovat huolissaan, kun taas akateemiset ja liike-elämän alat vaativat tietosuojalakien lieventämistä hyötyjen hyödyntämiseksi. Japani pyrkii myös vaikuttamaan globaaliin tekoälyä koskevaan sääntelyyn G7-maiden puitteissa ja käyttämään länsimaisia tietoresursseja koulutustarkoituksiin, mikä edistää keskustelua globaalista sääntelystä ja kilpailusta tekoälyn kehittämisessä."
    ],
    "commentSummary": [
      "Keskustelussa tarkastellaan tekijänoikeuslainsäädännön eri näkökohtia ja niiden vaikutuksia tekoälyyn, kuten tekoälyn tuottamaa sisältöä, harjoitusdataa, taiteellisten tyylien jäljittelyä, tekijänoikeuksien todentamista ja muuta.",
      "Japanin äskettäinen tekijänoikeutta ja tekoälyä koskeva päätös on tapausesimerkki.",
      "Siitä, miten tekijänoikeuslainsäädäntöä olisi sovellettava tekoälyyn ja onko tekijänoikeuslainsäädäntöä mahdollisesti uudistettava, on erilaisia mielipiteitä."
    ],
    "points": 162,
    "commentCount": 157,
    "retryCount": 0,
    "time": 1704210463
  }
]
