[
  {
    "id": 38232767,
    "title": "এক্সপেরিয়ানে আপনার নকল করা উদ্বেগজনকভাবে সহজ: দুর্বল সুরক্ষা ব্যবস্থা উন্মোচিত",
    "originLink": "https://krebsonsecurity.com/2023/11/its-still-easy-for-anyone-to-become-you-at-experian/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38232767",
    "commentBody": "",
    "originSummary": [
      "লেখকের এক্সপেরিয়ান অ্যাকাউন্ট হ্যাক করা হয়েছিল এবং তারা তাদের ব্যক্তিগত তথ্য এবং একটি ভিন্ন ইমেল ঠিকানা ব্যবহার করে এটি পুনরায় তৈরি করতে সক্ষম হয়েছিল, অপর্যাপ্ত সুরক্ষা ব্যবস্থা প্রকাশ করেছিল।",
      "অ্যাকাউন্ট তৈরির জন্য প্রমাণীকরণ প্রক্রিয়াদুর্বল, পাবলিক রেকর্ডের উপর ভিত্তি করে সহজেই উত্তরযোগ্য নিরাপত্তা প্রশ্ন রয়েছে।",
      "এক্সপেরিয়ান যাচাইকরণের প্রয়োজন ছাড়াই অ্যাকাউন্ট পরিবর্তনের জন্য কেবল একটি বিজ্ঞপ্তি ইমেল প্রেরণ করে, যার ফলে সম্ভাব্য নিরাপত্তা দুর্বলতা দেখা দেয়।"
    ],
    "commentSummary": [
      "আলোচনায় গোপনীয়তা, পরিচয় চুরি, ক্রেডিট রিপোর্টিং এজেন্সি, সাইবার নিরাপত্তা এবং ক্রেডিট ব্যুরো শিল্পকে ঘিরে উদ্বেগ এবং হতাশাতুলে ধরা হয়েছে।",
      "এটি এই সমস্যাগুলি মোকাবেলার জন্য শক্তিশালী প্রবিধান, জবাবদিহিতা এবং বিকল্প ব্যবস্থার প্রয়োজনীয়তার পরামর্শ দেয়।",
      "এই আলোচনায় ছদ্মবেশ, ক্রেডিট স্কোর প্রভাব, জালিয়াতি সমাধান, পরিচয় যাচাইকরণ এবং ইমেল ঠিকানা মিশ্রণের মতো বিষয়গুলিও স্পর্শ করা হয়েছে। ক্রেডিট শিল্পে আরও ভাল গোপনীয়তা সুরক্ষা, সুরক্ষা ব্যবস্থা এবং সংস্কারের জন্য সামগ্রিক আহ্বান রয়েছে।"
    ],
    "points": 651,
    "commentCount": 230,
    "retryCount": 0,
    "time": 1699725958
  },
  {
    "id": 38232243,
    "title": "কানাত নামে পরিচিত প্রাচীন ভূগর্ভস্থ জল ব্যবস্থা শুষ্ক অঞ্চলে টেকসই জল ব্যবস্থাপনা সরবরাহ করে",
    "originLink": "https://en.wikipedia.org/wiki/Qanat",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38232243",
    "commentBody": "",
    "originSummary": [
      "কানাত, যা কারিজ নামেও পরিচিত, প্রাচীন ভূগর্ভস্থ জল ব্যবস্থা যা পাম্পিংয়ের প্রয়োজন ছাড়াই ভূগর্ভস্থ উত্স থেকে পৃষ্ঠে জল পরিবহন করে।",
      "প্রায় 3,000 বছর আগে ইরানে উদ্ভূত, উত্তর আফ্রিকা এবং মধ্য প্রাচ্যের বেশ কয়েকটি দেশে শুষ্ক অঞ্চলে নির্ভরযোগ্য জল সরবরাহ ের জন্য কানাত ব্যবহার করা হয়।",
      "সেচ, পানীয় জল সরবরাহ, শীতলকরণ এবং বরফ সংরক্ষণ সহ কানাতগুলির বিভিন্ন ব্যবহার রয়েছে এবং এটি টেকসই এবং কার্যকর জল ব্যবস্থাপনা ব্যবস্থা হিসাবে প্রমাণিত হয়েছে, মরুকরণ রোধ এবং মাটির লবণাক্ততা নিয়ন্ত্রণ করে।"
    ],
    "commentSummary": [
      "এই হ্যাকার নিউজ থ্রেডটি কানাত এবং ইয়াখচালের প্রাচীন ফার্সি প্রযুক্তি এবং তাদের ঐতিহাসিক তাৎপর্য অন্বেষণ করে।",
      "কথোপকথনটি ফার্সি ভাষা এবং সাংস্কৃতিক পরিচয়, বিশেষত \"ফার্সি\" এবং \"ফার্সি\" ব্যবহারের জন্য ব্যবহৃত পরিভাষার দিকে মনোনিবেশ করে।",
      "আচ্ছাদিত অন্যান্য বিষয়গুলির মধ্যে রয়েছে ইচ্ছাকৃত ক্ষতির জন্য কানাতের দুর্বলতা, অন্যান্য জল পরিবহন পদ্ধতির সাথে তুলনা, জলের ঘাটতির কারণে কানাতের পতন, বিভিন্ন অঞ্চলে জল ব্যবস্থাপনা, \"কানাত\" শব্দটির ব্যুৎপত্তি এবং ভবিষ্যতে সম্ভাব্য অগ্রগতি।"
    ],
    "points": 342,
    "commentCount": 70,
    "retryCount": 0,
    "time": 1699723096
  },
  {
    "id": 38231704,
    "title": "দ্বিভাষিক শিশুর নাম আবিষ্কার করুন: বহুভাষী পিতামাতার জন্য একটি অনন্য সরঞ্জাম",
    "originLink": "https://mixedname.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38231704",
    "commentBody": "",
    "originSummary": [
      "এই ওয়েবসাইটটি বাবা-মাকে দ্বিভাষিক শিশুর নাম খুঁজে পেতে সহায়তা করে যা একাধিক ভাষায় কাজ করে।",
      "এটি 58 টি ভাষা সমর্থন করে এবং উভয় ভাষায় প্রদর্শিত নামগুলির পরামর্শ দেয়।",
      "সরঞ্জামটি ধারণা তৈরি করার জন্য, তবে প্রস্তাবিত নামগুলির উপযুক্ততার কোনও গ্যারান্টি নেই।"
    ],
    "commentSummary": [
      "দ্বিভাষিক শিশুর নাম নির্বাচন একাধিক ভাষায় উচ্চারণ এবং লেখার ক্ষেত্রে চ্যালেঞ্জ তৈরি করে।",
      "আলোচনায় অংশগ্রহণকারীরা তাদের অভিজ্ঞতা ভাগ করে নেয় এবং এই জাতীয় নামগুলি বেছে নেওয়ার জন্য বিকল্প পদ্ধতির পরামর্শ দেয়।",
      "নাম পরামর্শ ওয়েবসাইটগুলির কার্যকারিতা সম্পর্কে সন্দেহ রয়েছে, সাংস্কৃতিক প্রেক্ষাপট, ধ্বনিবিদ্যা এবং নির্ভুলতা এবং সাংস্কৃতিক সংবেদনশীলতার জন্য আন্তর্জাতিক স্বীকৃতি বিবেচনা করার উপর জোর দেওয়া হয়েছে।"
    ],
    "points": 272,
    "commentCount": 155,
    "retryCount": 0,
    "time": 1699720212
  },
  {
    "id": 38229001,
    "title": "গো ওপেন সোর্স রিলিজ ফিচার-পূর্ণ আপডেট এবং ভবিষ্যতের উন্নতির সাথে 14 বছর উদযাপন করে",
    "originLink": "https://go.dev/blog/14years",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38229001",
    "commentBody": "",
    "originSummary": [
      "গো ওপেন সোর্স রিলিজ তার চতুর্দশ জন্মদিন উদযাপন করছে এবং দুটি বৈশিষ্ট্যপূর্ণ রিলিজ, গো 1.20 এবং গো 1.21 এর সাথে সাফল্য দেখেছে।",
      "এই রিলিজগুলির ফোকাস টি প্রোফাইল-গাইডেড অপ্টিমাইজেশন এবং উন্নত সামঞ্জস্যতা সংযোজন সহ নতুন ভাষা পরিবর্তনের পরিবর্তে বাস্তবায়নের উন্নতিতে ছিল।",
      "গো 1.21 বিল্ট-ইন টুলচেইন ম্যানেজমেন্ট, উন্নত গোপলস ইন্টিগ্রেশন, জেনেরিক এবং স্ট্রাকচার্ড লগিংয়ের জন্য নতুন প্যাকেজ, ওয়েবঅ্যাসেম্বলি সিস্টেম ইন্টারফেস (ওয়াএসআই) এর জন্য সমর্থন এবং সুরক্ষা বর্ধন চালু করেছে।"
    ],
    "commentSummary": [
      "আলোচনাটি প্রোগ্রামিং ভাষা গো এবং এর বৈশিষ্ট্যগুলির চারপাশে ঘোরে, ত্রুটি পরিচালনা, স্থিতিশীলতা, রক্ষণাবেক্ষণযোগ্যতা এবং ভবিষ্যতের কার্যকারিতা সহ।",
      "ট্যাগযুক্ত ইউনিয়ন এবং সমষ্টি প্রকারের ব্যবহার সম্পর্কিত বিতর্ক রয়েছে, পাশাপাশি গুগল আগ্রহ হারালে গো'র দীর্ঘায়ু সম্পর্কে উদ্বেগ রয়েছে।",
      "আলোচনায় অন্যান্য প্রোগ্রামিং ভাষার সাথে সামঞ্জস্যতা এবং রক্ষণাবেক্ষণচ্যালেঞ্জ, পাইথনের তুলনায় গো এর জনপ্রিয়তা এবং আতঙ্ক এবং ব্যতিক্রমপরিচালনার বিষয়েও আলোচনা করা হয়েছে।"
    ],
    "points": 217,
    "commentCount": 277,
    "retryCount": 0,
    "time": 1699698011
  },
  {
    "id": 38229398,
    "title": "অপ্রচলিত সঙ্গীত মোকাবেলার চ্যালেঞ্জগুলি: অদ্ভুত অ্যালবামের নাম, বিভ্রান্তিকর কভার এবং লাইসেন্সিং সমস্যাগুলির দিকে নজর দিন",
    "originLink": "https://dustri.org/b/horrible-edge-cases-to-consider-when-dealing-with-music.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38229398",
    "commentBody": "",
    "originSummary": [
      "নিবন্ধটি উদ্ভট অ্যালবামের নাম, সমস্যাযুক্ত অ্যালবাম কভার এবং বিভ্রান্তিকর ট্র্যাক শিরোনাম সহ সংগীত ডেটা পরিচালনার অনন্য চ্যালেঞ্জগুলি অন্বেষণ করে।",
      "এটি সঙ্গীত শিল্পে আন্তর্জাতিকীকরণ এবং লাইসেন্সিংয়ের অসুবিধাগুলি তুলে ধরে।",
      "নিবন্ধটি অপ্রচলিত নাম এবং ট্র্যাক শিরোনামযুক্ত শিল্পীদের উদাহরণ প্রদর্শন করে, সংগীত ডেটা সংগঠিত করার জটিলতার উপর জোর দেয়।"
    ],
    "commentSummary": [
      "সারসংক্ষেপটি সংগীতের ক্ষেত্রে বিভিন্ন চ্যালেঞ্জিং দৃশ্যকে সম্বোধন করে, যার মধ্যে রয়েছে কঠিন নামযুক্ত ব্যান্ডগুলি, অভিন্ন অ্যালবামের নামগুলির কারণে সৃষ্ট বিভ্রান্তি এবং অনুসন্ধান অ্যালগরিদম এবং দীর্ঘ ট্র্যাকগুলির সমস্যা।",
      "এটি পদ্ধতিগতভাবে উত্পাদিত সংগীত এবং ট্র্যাকগুলিতে বিজ্ঞাপন এম্বেড করার মতো আকর্ষণীয় বিষয়গুলিও নিয়ে আসে, গানের শিরোনাম এবং সংগীত মেটাডেটার জটিলতার উপর আলোকপাত করে।",
      "আলোচনাটি সংগীতের জটিলতাগুলি যেমন ইউনিকোড অক্ষরগুলির সাথে চ্যালেঞ্জ, অ্যালবাম গ্রুপিং, সেন্সরশিপ এবং বিভিন্ন নামকরণ ের কনভেনশনগুলির পাশাপাশি সংগীত তত্ত্বে মাইক্রোটোনালিটি এবং অ-সমান-মেজাজের স্কেলগুলিতে ক্রমবর্ধমান আগ্রহের দিকে আরও নজর দেয়।"
    ],
    "points": 215,
    "commentCount": 82,
    "retryCount": 0,
    "time": 1699702422
  },
  {
    "id": 38232334,
    "title": "ডিউন 3 ডি ব্যবহার করে জিআইএমপির জন্য একটি র্যাডিকাল পুনরায় ডিজাইনের সম্ভাবনা পুনরুজ্জীবিত করা",
    "originLink": "https://librearts.org/2023/11/radical-redesign-of-gimp/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38232334",
    "commentBody": "",
    "originSummary": [
      "নিবন্ধটি জিআইএমপি চিত্র সম্পাদনা সফ্টওয়্যারটির একটি উল্লেখযোগ্য পুনরায় ডিজাইনের সম্ভাবনা অন্বেষণ করে।",
      "গ্লিম্প নামে পরিচিত জিআইএমপি পুনরায় ডিজাইন করার পূর্ববর্তী প্রচেষ্টাটি একটি ক্লিনার ইউজার ইন্টারফেস তৈরিতে সফল হয়নি।",
      "নিবন্ধটি সম্ভাব্য সমাধান হিসাবে ডুন 3 ডি নামে একটি নতুন অ্যাপ্লিকেশন প্রবর্তন করে, জিআইএমপির জটিল কার্যকারিতা সহজ করার জন্য একটি অনুসন্ধান বার এবং মেনু সরবরাহ করে।",
      "ব্লেন্ডারের মতো মিথস্ক্রিয়া ইঙ্গিতগুলি প্রয়োগ করা, জিআইএমপিকে আরও ব্যবহারকারী-বান্ধব করার পরামর্শ দেওয়া হয়।",
      "ডুন 3 ডি এর বৈশিষ্ট্যগুলি ব্যবহার করে পুনরায় ডিজাইনের পুনরুজ্জীবন উপকারী হবে কিনা সে সম্পর্কে লেখক মতামত চান।"
    ],
    "commentSummary": [
      "ব্যবহারকারীরা জিআইএমপি এবং ইঙ্কস্কেপের মতো সফ্টওয়্যার অ্যাপ্লিকেশনগুলির ব্যবহারযোগ্যতা এবং নকশা নিয়ে আলোচনা করেন।",
      "বিষয়গুলির মধ্যে রয়েছে ইন্টারফেস ডিজাইন, মেনু সংগঠন, বৈশিষ্ট্য আবিষ্কারযোগ্যতা এবং অনুসন্ধান কার্যকারিতার গুরুত্ব।",
      "আলোচনাগুলি ওপেন-সোর্স সফ্টওয়্যার বিকাশের চ্যালেঞ্জগুলি, জিআইএমপি এবং অন্যান্য চিত্র সম্পাদনা প্রোগ্রামগুলির মধ্যে তুলনা এবং কাস্টমাইজযোগ্য ইন্টারফেস এবং পাই মেনুগুলির মতো উন্নতির জন্য পরামর্শগুলিও কভার করে। জিআইএমপির তহবিল এবং অনুদান অনুশীলনগুলিও উল্লেখ করা হয়েছে।"
    ],
    "points": 212,
    "commentCount": 253,
    "retryCount": 0,
    "time": 1699723629
  },
  {
    "id": 38230476,
    "title": "ফ্লাইস্ক্র্যাপ: একটি শক্তিশালী এবং ব্যবহারকারী-বান্ধব ওয়েব স্ক্র্যাপিং সরঞ্জাম",
    "originLink": "https://github.com/philippta/flyscrape",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38230476",
    "commentBody": "",
    "originSummary": [
      "ফ্লাইস্ক্র্যাপ হ'ল একটি ওয়েব স্ক্র্যাপার যা ডেটা নিষ্কাশনকে অগ্রাধিকার দিয়ে জাভাস্ক্রিপ্টের বহুমুখীতার সাথে গো এর গতিকে একত্রিত করে।",
      "এটি উচ্চ কনফিগারেবিলিটি, স্বতন্ত্র সম্পাদন, স্ক্রিপ্টেবিলিটি, একটি সাধারণ এপিআই, দ্রুত পুনরাবৃত্তি, অনুরোধ ক্যাচিং এবং শূন্য নির্ভরতা সহ বিভিন্ন বৈশিষ্ট্য সরবরাহ করে।",
      "স্ক্র্যাপার সহজ ইনস্টলেশন এবং ব্যবহারের জন্য সম্পূর্ণ ডকুমেন্টেশন এবং উদাহরণ সরবরাহ করে।",
      "এটিতে এইচটিএমএল উপাদানগুলি পরিচালনা করার জন্য একটি কোয়েরি এপিআই এবং অনুরোধ করার জন্য একটি এইচটিটিপি এপিআই অন্তর্ভুক্ত রয়েছে।",
      "ব্যবহারকারীদের সমস্যাগুলি রিপোর্ট করতে এবং সরঞ্জামের উন্নতির পরামর্শ দিতে উত্সাহিত করা হয়।"
    ],
    "commentSummary": [
      "ফ্লাইস্ক্র্যাপ হ'ল গোতে লিখিত একটি ওয়েব স্ক্র্যাপিং সরঞ্জাম যা মৌলিক স্ক্র্যাপিং কাজের জন্য উপযুক্ত, তবে আরও জটিল প্রকল্পগুলির সাথে ভাল কাজ নাও করতে পারে।",
      "বাস্তব বিশ্বের সাইটগুলি স্ক্র্যাপ করার ক্ষেত্রে এটির সীমাবদ্ধতা রয়েছে এবং কোলির সাথে সম্পূর্ণ বৈশিষ্ট্য সমতার অভাব রয়েছে।",
      "যাইহোক, এটি জাভাস্ক্রিপ্টের সাথে পরিচিত ব্যবহারকারীদের জন্য সুবিধাজনক এবং ব্রাউজার সমর্থনের জন্য স্ক্র্যাপিংবির মতো তৃতীয় পক্ষের পরিষেবাগুলির সাথে ব্যবহার করা যেতে পারে।"
    ],
    "points": 184,
    "commentCount": 38,
    "retryCount": 0,
    "time": 1699712299
  },
  {
    "id": 38232378,
    "title": "\"বেনামী\" ডেটার বিভ্রম আনমাস্কিং: কেন আমাদের গোপনীয়তা ঝুঁকিতে রয়েছে",
    "originLink": "https://www.eff.org/deeplinks/2023/11/debunking-myth-anonymous-data",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38232378",
    "commentBody": "",
    "originSummary": [
      "কর্পোরেশনগুলি সম্মতি ছাড়াই ব্যক্তিগত ডেটা সংগ্রহ এবং ব্যবহার করছে, এটি ডি-আইডেন্টিফিকেশন দাবি করছে, তবে এটি প্রায়শই পুনরায় সনাক্ত করা যেতে পারে।",
      "অবস্থানের ডেটা বিশেষত সংবেদনশীল এবং ডি-আইডেন্টিফিকেশন করা চ্যালেঞ্জিং।",
      "আরও বিশদ ডেটা সেট তৈরি করার চাপ রয়েছে, তবে ব্যবহারকারীর গোপনীয়তাকে অগ্রাধিকার দেওয়া এবং ডেটা সংগ্রহের জন্য সম্মতি অর্জন করা অত্যন্ত গুরুত্বপূর্ণ।"
    ],
    "commentSummary": [
      "নিবন্ধটি ব্যক্তিগত ডেটা অ্যানোনিমাইজকরার চ্যালেঞ্জ এবং সীমাবদ্ধতাগুলি অন্বেষণ করে এবং ব্যবহারকারীর গোপনীয়তা রক্ষার জন্য কার্যকর অ্যানোনিমাইজেশন কৌশলগুলির প্রয়োজনীয়তার উপর জোর দেয়।",
      "এটি এমন পদ্ধতিগুলির সমালোচনা করে যা কেবল মাত্র প্রত্যক্ষ সনাক্তকারীগুলি সরিয়ে দেয় এবং আরও উন্নত পদ্ধতির পক্ষে সমর্থন করে যা পরোক্ষ সনাক্তকারী এবং ব্যক্তিগত বৈশিষ্ট্যগুলিকে অজ্ঞাত করে।",
      "মন্তব্য বিভাগটি গোপনীয়তা এবং ইউটিলিটির মধ্যে ভারসাম্য, সত্যিকারের অ্যানোনিমাইজেশন অর্জনে অসুবিধা এবং ছদ্মনামযুক্ত ডেটার সাথে যুক্ত সম্ভাব্য ঝুঁকি সম্পর্কে উদ্বেগ উত্থাপন করে। ডেটা সংগ্রহের ক্ষেত্রে সত্যিকারের নামহীনতা নিশ্চিত করার চ্যালেঞ্জগুলির পাশাপাশি ডেটা গোপনীয়তার আইনী এবং নৈতিক দিকগুলিও আলোচনা করা হয়।"
    ],
    "points": 182,
    "commentCount": 80,
    "retryCount": 0,
    "time": 1699723938
  },
  {
    "id": 38229576,
    "title": "কেডিই প্লাজমা 6.0: উন্নত কর্মক্ষমতা এবং সামঞ্জস্যের জন্য ওয়েল্যান্ড সক্ষম করা",
    "originLink": "https://www.phoronix.com/news/Plasma-6.0-Wayland-Default",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38229576",
    "commentBody": "",
    "originSummary": [
      "কেডিই প্লাজমা 6.0 ডিফল্টরূপে ওয়েল্যান্ড সক্ষম করবে, যার ফলে কর্মক্ষমতা এবং সামঞ্জস্যতা বৃদ্ধি পাবে।",
      "আপডেটটি ব্রিজ অ্যাপ শৈলী, প্রিন্টার ইন্টিগ্রেশন এবং এইচডিআর-সক্ষম গেমগুলির জন্য সমর্থনে উল্লেখযোগ্য উন্নতি আনবে।",
      "আপডেটে আরও বিভিন্ন উন্নতি অন্তর্ভুক্ত করা হবে।"
    ],
    "commentSummary": [
      "আলোচনায় কেডিই প্লাজমা, ওয়েল্যান্ড, এনভিডিয়া গ্রাফিক্স কার্ড, সফটওয়্যার সামঞ্জস্যতা, উইন্ডো ম্যানেজার, ডেস্কটপ এনভায়রনমেন্ট এবং লিনাক্স সিস্টেমের ডিজাইন নান্দনিকতার মতো বিভিন্ন বিষয়ের উপর দৃষ্টি নিবদ্ধ করা হয়।",
      "ব্যবহারকারীরা তাদের অভিজ্ঞতা এবং মতামত ভাগ করে নেয়, এই বিষয়গুলির ইতিবাচক এবং নেতিবাচক উভয় দিক নিয়ে আলোচনা করে।",
      "আলোচনাটি ডিজাইন পছন্দগুলির বিষয়গত প্রকৃতি এবং বিভিন্ন হার্ডওয়্যার কনফিগারেশনে সফ্টওয়্যার সামঞ্জস্যতা এবং কর্মক্ষমতা সম্পর্কিত চ্যালেঞ্জগুলি তুলে ধরে।"
    ],
    "points": 162,
    "commentCount": 181,
    "retryCount": 0,
    "time": 1699704176
  },
  {
    "id": 38233694,
    "title": "সার্ভারে ব্যবহারকারীর ডেটা প্রেরণের জন্য মাইক্রোসফ্ট আউটলুক সমালোচিত: গোপনীয়তা উদ্বেগ এবং জিডিপিআর লঙ্ঘন",
    "originLink": "https://mailbox.org/en/post/warning-new-outlook-sends-passwords-mails-and-other-data-to-microsoft?nl=e",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38233694",
    "commentBody": "",
    "originSummary": [
      "মাইক্রোসফ্ট আউটলুকের সর্বশেষ সংস্করণটি মাইক্রোসফ্ট সার্ভারগুলিতে পাসওয়ার্ড এবং ইমেল সহ সংবেদনশীল ব্যবহারকারীর ডেটা প্রেরণের জন্য প্রতিক্রিয়া পাচ্ছে, সম্ভাব্যভাবে ব্যবহারকারীর গোপনীয়তার সাথে আপস করছে।",
      "এই ধরনের ডেটা ট্রান্সমিশন ব্যবসায়িক গ্রাহকদের জন্য জিডিপিআর প্রবিধানের লঙ্ঘনও হতে পারে, যা মাইক্রোসফ্টকে আইনি পরিণতির মুখোমুখি হওয়ার ঝুঁকিতে ফেলতে পারে।",
      "জার্মান আইটি পোর্টাল, হেইজ অনলাইন, নতুন আউটলুক ব্যবহারের বিরুদ্ধে দৃঢ়ভাবে পরামর্শ দেয় এবং সম্ভাব্য গোপনীয়তা ঝুঁকি এড়াতে থান্ডারবার্ড বা ওয়েবমেল ব্যবহারের মতো বিকল্প বিকল্পগুলির পরামর্শ দেয়।",
      "জার্মান ফেডারেল কমিশনার ফর ডেটা প্রোটেকশন অ্যান্ড ফ্রিডম অফ ইনফরমেশনও এই ইস্যুতে উদ্বিগ্ন এবং ব্যবহারকারীর গোপনীয়তা সম্পর্কে উদ্বেগের সমাধানের জন্য এটি ইউরোপীয় পর্যায়ে আনতে চায়।"
    ],
    "commentSummary": [
      "আউটলুকের সর্বশেষ সংস্করণটি পাসওয়ার্ড এবং ইমেল সহ ব্যক্তিগত ডেটা মাইক্রোসফ্টের সার্ভারগুলিতে প্রেরণ করছে, যা কোম্পানির ডেটা সংগ্রহের অনুশীলনগুলি সম্পর্কে উদ্বেগ সৃষ্টি করেছে।",
      "ব্যবহারকারীরা নতুন মেইল প্রোগ্রামের মধ্যে বিজ্ঞাপনঅন্তর্ভুক্তি এবং একটি ঐতিহ্যবাহী ইমেল ক্লায়েন্ট থেকে ওয়েব অ্যাপ্লিকেশনে রূপান্তর নিয়ে হতাশ।",
      "কর্মক্ষেত্রে আউটলুকের ব্যাপক ব্যবহার অনেক ব্যবহারকারীকে এই উদ্বেগ এবং হতাশা সত্ত্বেও নতুন সংস্করণটি ব্যবহার করা ছাড়া আর কোনও বিকল্প রাখে না।"
    ],
    "points": 146,
    "commentCount": 25,
    "retryCount": 0,
    "time": 1699731327
  },
  {
    "id": 38229041,
    "title": "আয়ারল্যান্ডে অবৈধ নজরদারি ও তথ্য সংগ্রহের অভিযোগে মেটা ও ইউটিউবকে চ্যালেঞ্জ জানালেন প্রাইভেসি কনসালটেন্ট",
    "originLink": "https://www.theregister.com/2023/11/11/meta_youtube_criminal_charges/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38229041",
    "commentBody": "",
    "originSummary": [
      "আয়ারল্যান্ডে ট্র্যাকিং স্ক্রিপ্টের মাধ্যমে ইইউ নাগরিকদের অবৈধ নজরদারিতে জড়িত থাকার অভিযোগে মেটা (পূর্বে ফেসবুক) এবং ইউটিউব ফৌজদারি অভিযোগের মুখোমুখি হচ্ছে।",
      "প্রাইভেসি কনসালটেন্ট আলেকজান্ডার হ্যানফ স্পষ্ট সম্মতি ছাড়াই ডেটা সংগ্রহের জন্য মেটাকে চ্যালেঞ্জ করেছেন এবং বিজ্ঞাপন-ব্লকিং এক্সটেনশনগুলি সনাক্ত করতে স্ক্রিপ্ট ব্যবহার করার জন্য ইউটিউবের বিরুদ্ধে অনুরূপ অভিযোগ দায়ের করেছেন।",
      "হ্যানফ যুক্তি দেখান যে উভয় সংস্থাই কোনও আইনি ভিত্তি ছাড়াই আচরণগত বিজ্ঞাপন টার্গেটিংয়ের জন্য ডেটা প্রক্রিয়া করেছে এবং এই স্ক্রিপ্টগুলির স্থাপন এবং সম্পাদন অবৈধ। তিনি আশা করেন যে এই অভিযোগগুলি কর্পোরেট কর্মকর্তাদের জবাবদিহি করবে এবং সংস্থাগুলিকে তাদের অবৈধ আচরণ পুনর্বিবেচনা করতে বাধ্য করবে।"
    ],
    "commentSummary": [
      "আয়ারল্যান্ডের এক প্রাইভেসি কনসালট্যান্ট প্রতিষ্ঠানটির বিরুদ্ধে গোপনীয়তা লঙ্ঘনের অভিযোগ এনে আইনি ব্যবস্থা নিয়েছেন।",
      "পরামর্শদাতা একটি ফৌজদারি অভিযোগ দায়ের করেছেন, যা আয়ারল্যান্ডের বেসরকারী নাগরিকদের দ্বারা করা যেতে পারে।",
      "মামলাটি আইরিশ প্রসিকিউটিং এজেন্সিদ্বারা অনুসরণ করা হচ্ছে না, তবে গোপনীয়তা উদ্বেগের দিকে মনোযোগ আকর্ষণ করতে এবং সম্ভাব্য তদন্তের জন্য পরামর্শদাতার দ্বারা একটি ব্যক্তিগত ফৌজদারি পদক্ষেপ।"
    ],
    "points": 143,
    "commentCount": 31,
    "retryCount": 0,
    "time": 1699698390
  },
  {
    "id": 38230495,
    "title": "নিকোটিনের সম্ভাব্য সুবিধা এবং ভুল বোঝাবুঝি",
    "originLink": "https://gwern.net/nicotine",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38230495",
    "commentBody": "",
    "originSummary": [
      "নিকোটিন, যখন মাড়ি বা প্যাচগুলির মতো খাঁটি আকারে ব্যবহৃত হয়, তখন মোডাফিনিলের মতো অন্যান্য উত্তেজকগুলির তুলনায় ন্যূনতম ক্ষতি হয়।",
      "কিছু গবেষণা পরামর্শ দেয় যে নিকোটিন পূর্বের ধারণার মতো আসক্তিযুক্ত নাও হতে পারে, যদিও এর আসক্তির সম্ভাবনা এবং সম্ভাব্য পার্শ্ব প্রতিক্রিয়াগুলির কারণে সতর্কতা অবলম্বন করা উচিত।",
      "নিকোটিন রিপ্লেসমেন্ট থেরাপি পণ্য, যেমন মাড়ি বা প্যাচগুলি অধূমপায়ীদের মধ্যে আসক্তির কম হারের সাথে নিরাপদ হিসাবে বিবেচিত হয়।"
    ],
    "commentSummary": [
      "হ্যাকার নিউজের একটি আলোচনা নিকোটিন আসক্তিসম্পর্কে বিভিন্ন দৃষ্টিভঙ্গি অন্বেষণ করে, আসক্তির হার, ছেড়ে দেওয়ার চ্যালেঞ্জ এবং কোকেন এবং কফির মতো পদার্থের তুলনায় আসক্তির গুণাবলী সহ।",
      "অংশগ্রহণকারীরা নিকোটিন আসক্তির সাথে তাদের ব্যক্তিগত অভিজ্ঞতা ভাগ করে নেয় এবং নিকোটিনকে নোট্রপিক হিসাবে ব্যবহারের সম্ভাব্য ঝুঁকি এবং সুবিধাগুলি নিয়ে আলোচনা করে।",
      "কথোপকথনটি মস্তিষ্কের ক্রিয়াকলাপকে প্রভাবিত করে এমন পদার্থগুলি ব্যবহার করার সময় সতর্কতার গুরুত্ব, সুষম এবং স্বাস্থ্যকর জীবনযাত্রার প্রয়োজনীয়তা এবং অভ্যাস গঠন এবং এডিএইচডির মতো পরিস্থিতি পরিচালনায় নিকোটিনের সম্ভাব্য ব্যবহারসম্পর্কেও আলোচনা করে।"
    ],
    "points": 137,
    "commentCount": 242,
    "retryCount": 0,
    "time": 1699712463
  },
  {
    "id": 38236684,
    "title": "Win-vind: উইন্ডোজ 11 এর জন্য একটি ভিমের মতো ইন্টারফেস",
    "originLink": "https://pit-ray.github.io/win-vind/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38236684",
    "commentBody": "",
    "originSummary": [
      "উইন-ভিন্ড উইন্ডোজের জন্য একটি লাইটওয়েট হাইব্রিড ইউআই সিস্টেম যা ব্যবহারকারীদের ভিমের মতো পদ্ধতিতে উইন্ডোজ জিইউআই নেভিগেট করতে দেয়।",
      "এটি ভিম ব্যবহারকারীদের জন্য একটি ব্যবহারকারী-বান্ধব ইন্টারফেস সরবরাহ করে, অন্তর্নির্মিত কমান্ড এবং একটি .vimrc স্টাইল কনফিগারেশন ফাইল ব্যবহার করে এটি কনফিগার করার ক্ষমতা সহ।",
      "উইন-ভিন্ড ওপেন সোর্স এবং এমআইটি লাইসেন্সের অধীনে বিতরণ করা হয়, এটি ব্যবহার এবং পরিবর্তনের জন্য বিনামূল্যে উপলব্ধ করে তোলে।"
    ],
    "commentSummary": [
      "উইন-ভিন্ড একটি উইন্ডোজ সফ্টওয়্যার যা ব্যবহারকারীদের ভিমের মতো কমান্ড এবং শর্টকাট ব্যবহার করে তাদের কম্পিউটারনেভিগেট এবং নিয়ন্ত্রণ করতে সক্ষম করে।",
      "হ্যাকার নিউজের আলোচনায় লিনাক্স এবং ম্যাকওএসের জন্য অনুরূপ সরঞ্জাম এবং বিভিন্ন অপারেটিং সিস্টেমের কীবোর্ড-বান্ধব বৈশিষ্ট্যগুলি অন্বেষণ করা হয়েছে।",
      "হ্যাকার নিউজের কথোপকথনটি ভিমের মতো সরঞ্জামগুলির জনপ্রিয়তা এবং দক্ষ কম্পিউটার নেভিগেশনের জন্য তারা যে সম্ভাব্য সুবিধাগুলি সরবরাহ করে তা স্বীকার করে।"
    ],
    "points": 134,
    "commentCount": 43,
    "retryCount": 0,
    "time": 1699756345
  }
]
