[
  {
    "id": 36044977,
    "timestamp": 1684852755,
    "title": "Apple announces multibillion deal with Broadcom to make components in the USA",
    "url": "https://www.macrumors.com/2023/05/23/apple-announces-deal-to-make-components-in-the-usa/",
    "hn_url": "http://news.ycombinator.com/item?id=36044977",
    "content": "Apple Announces Multibillion-Dollar Deal With Broadcom to Make Components in the USATuesday May 23, 2023 6:05 am PDT by Hartley CharltonApple today announced a multibillion-dollar deal with American technology company Broadcom to make several key components for its devices in the United States.The multi-year agreement with Broadcom will see Apple use 5G radio frequency and wireless connectivity components, including FBAR filters, that are designed and manufactured in the U.S. Apple CEO Tim Cook said:We're thrilled to make commitments that harness the ingenuity, creativity, and innovative spirit of American manufacturing. All of Apple's products depend on technology engineered and built here in the United States, and we'll continue to deepen our investments in the U.S. economy because we have an unshakable belief in America's future.Apple has collaborated with Broadcom for many years, with the company providing important chips for devices like the AirPort and iPhone 5S. Apple noted that it already supports over 1,100 jobs in Broadcom's Fort Collins FBAR filter manufacturing facility, and the partnership will see continued investment in automation projects and training programs for technicians and engineers.The investments are part of the commitment Apple made in 2021 to invest $430 billion in the U.S. economy over a period of five years. The company today said that it is on track to meet its target through direct spending with American suppliers, data centers, capital expenditures, and more.Tags: United States, 5G, Broadcom[ 65 comments ]",
    "summary": "- Apple has announced a multibillion-dollar deal with Broadcom to make several key components for Apple devices in the United States.\n- The multi-year agreement involves the use of 5G radio frequency and wireless connectivity components designed and manufactured in America, including FBAR filters.\n- The investment will help Apple meet its $430 billion commitment to the US economy, and there will be continued investment in automation projects and training programs for technicians and engineers.",
    "hn_title": "Apple announces multibillion deal with Broadcom to make components in the USA",
    "original_title": "Apple announces multibillion deal with Broadcom to make components in the USA",
    "score": 577,
    "hn_content": "Apple has announced that it has partnered with component manufacturer Broadcom and will invest $430 billion in a facility in North Carolina that will create \"as many as 15,000 jobs.\" Apple CEO Tim Cook announced the investment on Thursday, saying that the deal would help Apple to make key components for its products in the United States. In a statement, Cook said, \"At this moment of recovery and rebuilding, Apple is doubling down on our commitment to US innovation and manufacturing.\" The new facility will produce components for iPhones, iPads, and other Apple products. The company has not yet said when the plant will begin operating or what products it would produce first.Some tech companies like HP, Intel, and AMD have downsized in Fort Collins, CO, causing some to comment on the area's infrastructure and livable wages for engineers. Apple's new factory in the area may be creating redundancy in their supply chain in case there are issues with China, but some speculate that they may still be sourcing the critical parts from China despite final assembly happening in the US or Mexico. The pay and working conditions for some positions may be lower than expected or compared to previous years.Broadcom announced a new partnership with Apple to supply wireless components for its products. The deal should generate $15 billion in revenue for Broadcom over the course of three and a half years. Some commenters on the news expressed their concerns about Broadcom's history of providing poorly documented hardware and problematic drivers for open source operating systems. Meanwhile, other commenters discussed the potential impact of the deal as it relates to manufacturing jobs and trade relations, particularly considering suggestions that countries like Mexico and Vietnam could become more popular destinations for large tech companies as they seek alternatives to Chinese manufacturing.No meaningful content found.",
    "hn_summary": "- Apple partners with Broadcom, invests $430 billion in a North Carolina facility to create 15,000 jobs and produce components for Apple products in the US.\n- Some concerns are raised about infrastructure, wages, and sourcing critical parts from China despite final assembly happening in the US or Mexico.\n- Broadcom will supply wireless components for Apple products, generating $15 billion in revenue, but concerns are also raised about the company's history of problematic hardware and drivers for open source operating systems."
  },
  {
    "id": 36041059,
    "timestamp": 1684826813,
    "title": "FBI misused surveillance powers more than 280k times in a year",
    "url": "https://www.theregister.com/2023/05/22/fbi_fisa_abuse/",
    "hn_url": "http://news.ycombinator.com/item?id=36041059",
    "content": "PERSONAL TECHFBI abused spy law but only like 280,000 times in a year35Well, well, well, if it isn't the Leaning Tower of FISA againJessica Lyons HardcastleMon 22 May 2023 // 19:59 UTCThe FBI misused controversial surveillance powers more than 278,000 times between 2020 and early 2021 to conduct warrantless searches on George Floyd protesters, January 6 rioters who stormed the Capitol, and donors to a Congressional campaign, according to a newly unclassified court opinion.On Friday, the US Foreign Intelligence Surveillance Court made public a heavily redacted April 2022 opinion [PDF] that details hundreds of thousands of violations of Section 702 of the Foreign Intelligence Surveillance Act (FISA) — the legislative instrument that allows warrantless snooping.The Feds were found to have abused the spy law in a \"persistent and widespread\" manner, according to the court, repeatedly failing to adequately justify the need to go through US citizens' communications using a law aimed at foreigners.Section 702 is supposed to permit the federal government to spy on communications belonging to foreign individuals outside of America, theoretically to prevent criminal and terrorist acts. Those communications can sweep up phone calls, texts and emails with US persons, however, and are stored in massive databases. The FBI, CIA and NSA can search these communications without a warrant.In the doublespeak world of American intelligence, such information isn't technically stored; it's only considered so if it's actually used by analysts. And while foreign communications are fair game, the Feds can search about three levels down in data - ie, who the suspect talked to, and who their contact spoke to, and the next line in the communications link - so think Kevin Bacon levels of contacts.Although the law is not supposed to be used to surveil American citizens, the government has historically used this data to monitor activists, journalists, and others without obtaining a warrant. These communications can then be used to prosecute people for crimes, and have been.The police power is set to expire at the end of the year unless Congress renews it. With this looming deadline, the now-unclassified court documents add fuel to Section 702 opponents' arguments that the government routinely abuses these warrantless searches.\"These abuses have been going on for years and despite recent changes in FBI practices, these systematic violations of Americans' privacy require congressional action,\" US Senator Ron Wyden (D-OR) said in a statement. \"If Section 702 is to be reauthorized, there must be statutory reforms to ensure that the checks and balances are in place to put an end to these abuses.\"The court opinion details FBI queries run on thousands of individuals between 2020 and early 2021. This includes 133 people arrested during the George Floyd protests and more than 19,000 donors to a congressional campaign.In the latter, \"the analyst who ran the query advised that the campaign was a target of foreign influence, but NSD determined that only eight identifiers used in the query had sufficient ties to foreign influence activities to comply with the querying standard,\" the opinion says, referring to the Justice Department's National Security Division (NSD). In other words, there wasn't a strong enough foreign link to fully justify the communications search.For the Black Lives Matter protests, the division determined that the FBI queries \"were not reasonably likely to retrieve foreign intelligence information or evidence of a crime.\" Again, an overreach of foreign surveillance powers.Feds rethink warrantless search stats and – oh look, a huge drop in numbersSupreme Court not interested in hearing about NSA's super-snoop schemesChina has 50 hackers for every FBI cyber agent, says Bureau bossUK's GDPR replacement could wipe out oversight of live facial recognitionAdditional \"significant violations of the querying standard\" occurred in searched related to the January 6, 2021 breach of the US Capitol, domestic drug and gang investigations, and domestic terrorism probes, according to the court. It's said that more than 23,000 queries were run on people suspected of storming the Capitol.While the FBI has said it has implemented several changes to prevent Section 702 abuse, including better query training and stricter approval requirements for some \"sensitive\" searches, like those involving American elected officials and journalists, Section 702 opponents argue that the spying on US citizens won't stop unless Congress enacts FISA report.\"Even with the long history of FBI misuse of FISA 702, these latest revelations should set off alarm bells across Congress,\" Jake Laperruque, deputy director of the Center for Democracy and Technology's Security and Surveillance Project, said in a statement. \"The systemic misuse of this warrantless surveillance tool has made FISA 702 as toxic as COINTELPRO and the FBI abuses of the Hoover years,\" he added. \"Absent a full overhaul of Section 702 and related surveillance powers, Congress should not allow the law to be extended past this year.\" ®Similar topicsFBIForeign Intelligence Surveillance ActPrivacyMore like these35 COMMENTSTIP US OFFSend us news",
    "summary": "- The FBI misused surveillance powers over 280,000 times to conduct warrantless searches on individuals involved in George Floyd protests, January 6th riots, donors to a congressional campaign, and other surveillance.\n- The surveillance powers were authorized under Section 702 of the Foreign Intelligence Surveillance Act, which is meant to permit surveillance on foreign individuals outside of America to prevent criminal and terrorist acts.\n- Although this law is not supposed to be used to surveil American citizens, the government has historically used this data to monitor activists, journalists, and others without obtaining a warrant, and these communications can be used to prosecute people for crimes.",
    "hn_title": "FBI misused surveillance powers more than 280k times in a year",
    "original_title": "FBI misused surveillance powers more than 280k times in a year",
    "score": 556,
    "hn_content": "The FBI has utilized surveillance powers over 280k times in a year. Most democracies have fundamental protections against spying on their own citizens, so the USA set up a Five Eyes agreement. This lets each government spy on all its citizens through trusted foreign proxies legally. The intelligence agencies from five eyes jurisdictions, the USA, and the UK, spy on each others' citizens and share it under the Five Eyes agreement. However, the agreement is to not spy on each other's citizens. Bill Binney, technical director of NSA at that time, had a system in place that heavily utilized filters to collect what was needed and excluded citizens before Gen Michael Hayden switched priorities to TrailBlazer, which contained everything and failed to sift through, requiring costly contracts to sustain.Foreign countries are hesitant about sharing citizen data due to the risk of cyber attacks and information misuse. Sanctions and military benefits drive cooperation. Evidence obtained through espionage is often inadmissible in court due to bypassing legal protections. Congress is at fault for creating loopholes in the line between espionage and law enforcement. The FBI's remit has expanded beyond investigating crimes that have already occurred. Protection from foreign and domestic enemies is essential, but it becomes complicated when it comes to citizens. Schrems II is crucial in protecting citizen data. The Universal Declaration of Human Rights can be violated by the US's actions.The article discusses the US government's surveillance program, specifically Section 702, which allows the foreign surveillance of non-Americans but ultimately ends up spying on Americans. There is a lack of trust in the US due to this program, and the FISA court system is criticized for being abused. Americans have more rights than non-citizens, but these rights are not necessarily a superset of any internationally agreed upon rights. The government is not held accountable for their actions, and instead of legal solutions, there needs to be a political reform. Many past events, such as the Cuban missile crisis and Operation Northwoods, have shown the US government's history of unethical behavior and abuse of power. However, more people are becoming aware of these actions due to the transparency of current events.The FISA court has found that the FBI conducted unauthorized searches targeting Americans' internet data. This violation occurred between 2018 and 2020 under Section 702 of the Foreign Intelligence Surveillance Act. The FBI's non-compliance with restrictions and procedures has raised concerns among critics who argue that the US citizens are gradually losing their privacy. Some people suggest that the FBI should be dismantled due to its history of surveillance abuse. However, there was no immediate comment from the FBI regarding the report. The apparent lack of accountability and transparency by the intelligence community has led to growing mistrust of government institutions among some Americans.The article discusses the issue of spy agencies going rogue and acting without consequences, and the lack of democracy in the US government. The Verfassungsschutz in Germany is also mentioned as an example of an agency that has become a political weapon and a danger to democracy. The article also touches on the Russia Collusion and Durham report controversies and how conspiracy theories are often rooted in reality. Both parties are criticized for their hypocrisy on government abuses and crime. The article suggests that to address the problem, we need to understand why some people support the state of affairs and find a way to reach them, using the example of the negative effects of nuclear weapons to illustrate the importance of compromise.The article discusses the emotions and feelings that underpin support for surveillance, and how proposing alternatives can change these feelings. The largest expansion of the \"five eyes\" program happened during the Obama presidency. The FBI was founded by a Republican and has always been controlled by Republicans, but there are checks and balances in place in the US democracy. No meaningful new technology or development is discussed in this text.",
    "hn_summary": "- The FBI misused surveillance powers over 280k times in a year, raising concerns about privacy violation for US citizens.\n- Lack of accountability and transparency of the intelligence community has led to increasing mistrust of government institutions among some Americans.\n- The Five Eyes agreement allows for legal spying on citizens through foreign proxies, but there is a risk of cyber attacks and information misuse."
  },
  {
    "id": 36038796,
    "timestamp": 1684805881,
    "title": "Why do recipe writers lie about how long it takes to caramelize onions? (2012)",
    "url": "https://slate.com/human-interest/2012/05/how-to-cook-onions-why-recipe-writers-lie-and-lie-about-how-long-they-take-to-caramelize.html",
    "hn_url": "http://news.ycombinator.com/item?id=36038796",
    "content": "FOODLayers of DeceitWhy do recipe writers lie and lie and lie about how long it takes to caramelize onions?BY TOM SCOCCAMAY 02, 20127:12 AMHow long does it really take to caramelize onions?AdeFinlay/iStockBrowning onions is a matter of patience. My own patience ran out earlier this year while leafing through the New York Times food section. There, in the newspaper of record, was a recipe for savory scones with onions, currants, and caraway. Though I wasn’t particularly interested in making savory scones, one passage caught my eye:Add the onions to the skillet and increase the heat to medium-high. Cook until they begin to turn dark brown and somewhat soft, about 5 minutes. Add the oil and a pinch of the fine sea salt; continue cooking until the onions are soft and caramelized, about 5 minutes longer.Soft, dark brown onions in five minutes. That is a lie. Fully caramelized onions in five minutes more. Also a lie.There is no other word for it. Onions do not caramelize in five or 10 minutes. They never have, they never will—yet recipe writers have never stopped pretending that they will. I went on Twitter and said so, rudely, using CAPS LOCK. A chorus of frustrated cooks responded in kind (“That’s on some bullshit. You want caramelized onions? Stir for 45 minutes”).As long as I’ve been cooking, I’ve been reading various versions of this lie, over and over. Here’s Madhur Jaffrey, from her otherwise reliable Indian Cooking, explaining how to do the onions for rogan josh: “Stir and fry for about 5 minutes or until the onions turn a medium-brown colour.” The Boston Globe, on preparing pearl onions for coq au vin: “Add the onions and cook, stirring often, for 5 minutes or until golden.” The Washington Post, on potato-green bean soup: “Add the onion and cook for 8 to 10 minutes, stirring occasionally, until golden brown.”If you added all those cooking times together end to end, you still wouldn’t have caramelized onions. Here, telling the truth about how to prepare onions for French onion soup, is Julia Child: “[C]ook slowly until tender and translucent, about 10 minutes. Blend in the salt and sugar, raise heat to moderately high, and let the onions brown, stirring frequently until they are a dark walnut color, 25 to 30 minutes.” Ten minutes plus 25 to 30 minutes equals 35 to 40 minutes. That is how long it takes to caramelize onions.Telling the truth about caramelized onions would turn a lot of dinner-in-half-an-hour recipes into dinner-in-a-little-over-an-hour recipes. I emailed Sam Sifton, the Times food critic turned national editor, to ask if the Recipe Writing Guild had some secret agreement to print false estimates of onion-cooking time. He wrote back: “I can reveal that onion caramelization takes longer than the Guild believes. But it need not take as long as you believe it to take! You can speed it up with butter, so long as you are careful not to burn.”Could onions be browned, at all, in 10 minutes? I embarked on a quest to find out. Someone on Twitter had suggested things would go faster with sweet onions. This seemed a little like pepping up a bread pudding recipe by treating sliced pound cake as a kind of bread. But I bought a Tampico sweet onion, chopped half of it into tiny bits—only half, so as not to crowd the pan—and turned my biggest burner as high as it would go. Butter seemed a little risky at that temperature, so I went with olive oil, in a cheap, lightweight nonstick skillet. In five minutes, a few flecks of brown had appeared among the otherwise raw-looking onion bits. After eight minutes, some of the onion had begun to take on the scorched aspect of the unfortunate onions stuck to bagels. At the 10-minute mark, the brown flecks had turned black, in a mince that was a mix of brown and still-pale bits. The onion was done cooking—that is, it was beginning to be ruined—but it was not very well caramelized. At 11 minutes, I scraped an inedible mess out of the pan.But the onion lies had not yet been fully refuted. Melissa Clark, the author of the Times’ scone recipe, claimed in a Diner’s Journal post that she relies on “a somewhat unusual technique,” one that “takes less than half the time of the traditional slow-cooked method of caramelization and makes for sweeter, more intensely flavored onions with a complex, chewy texture.” The secret, she writes, is starting the onions in a dry pan, and adding the oil later.Note that half the time of the traditional method is still 20 minutes, not 10. Nevertheless, I decided to follow her instructions to the letter. I used a red onion, as Clark specified, “halved through the root and thinly sliced crosswise.” I started slicing it paper-thin. Not good enough? I got out the knife sharpener and touched up the edge on the cleaver. Now it was tissue-paper thin. I heated the pan—dry—over a generously medium-high flame, then added the onions.After five minutes—when according to Clark, it would “begin to turn dark brown and somewhat soft”—the onion was resolutely white and pink, and only slightly translucent. I added the oil: one tablespoon, extra-virgin. The white parts turned the color of extra-virgin olive oil.At 10 minutes, when it was supposed to be done, the onion was translucent and soft, with only a tinge of gold. Soon after, one golden speck appeared. By 15 minutes, the onion was even softer and more golden. At 20 minutes, there were deep brown patches, and I was afraid they would scorch while I set down my spatula to take notes. At 24 minutes, the risk of scorching forced me to lower the heat to medium. By 25 minutes, they were pretty well caramelized, and at 28 minutes they were as done as I’d want.So Clark was only off by 180 percent on the cooking time. You can save 12 minutes off caramelizing onions, provided you pin yourself to the stove.That is the deeper problem with all the deceit around the question of caramelized onions. The premise is wrong. The faster you try to do it, the more you waste your time. This isn’t some kitchen koan. It’s a practical fact. The 10-minute-cum-28-minute caramelized onion is all labor and anxiety. Give yourself 45 or 50 minutes to brown onions, working slowly on a moderate flame, and it’s an untaxing background activity. You can chop other vegetables, wash some pots, duck out to have a look at the ballgame on TV in the next room. Keep half an eye on the pan. It will only need close tending toward the end.Recipe writers approach kitchen time with a stopwatch. The Times’ scone recipe, as written, claimed to take 45 minutes. Once you subtract out the (fictitiously shortened) onion-cooking time, the one-minute caraway-seed-toasting time, the 15-to-17 minute baking time, and the 10-minute cooling time, that leaves the cook seven to nine minutes in the middle to mix the dough (including grating frozen butter into it), shape it, cut it into scones, and lay the scones out on a parchment-lined baking sheet. Oh, and somewhere in there, the onions needed to “cool completely.” Isn’t home baking soothing?In truth, the best time to caramelize onions is yesterday. Often enough, you need to have them ready before you can start on the rest of the dish. Thus the recipe-writers’ impulse to deceive. Browning onions is slow work, and it comes first. So get a pan going after dinner, and they’ll be ready when you need them. Or throw the onions in a crock pot and go to bed. In recipe time, that’s hours and hours. In your time, the time that matters, it’s less than five minutes.",
    "summary": "- Recipe writers often lie about how long it takes to caramelize onions, claiming that it only takes 5-10 minutes when it actually takes around 35-40 minutes.\n- Many popular cookbooks use this misleading information, but there are some writers who tell the truth about the proper caramelization process.\n- While some recipe writers claim to have shortcuts or different techniques for caramelizing onions faster, these methods still take twice the amount of time they claim and do not result in true caramelization.",
    "hn_title": "Why do recipe writers lie about how long it takes to caramelize onions? (2012)",
    "original_title": "Why do recipe writers lie about how long it takes to caramelize onions? (2012)",
    "score": 527,
    "hn_content": "Recipe writers don't accurately describe the process involved in caramelizing onions, leading to confusion for readers. Thinly sliced onions should be cooked on medium heat with oil for 10-15 minutes, then on low heat for 45-60 minutes with periodic stirring. After reduction to 1/6th of the original volume, the onions are finished when deep brown. Confusion comes from imprecise language using the term caramelization, which implies a long and complex process involving sugar, heat, and time. Most recipes require only softened onions of light to medium caramel color, with a few recipes needing the sweet, dark caramelized onions. French onion soup and coq-a-vin are a delicious example of dishes requiring the more extended caramelization process. Some authors know that there is no substitute for authentic caramelized onions, but others use the term imprecisely, leading to confusion for those who follow recipes closely.The discussion revolves around the proper technique and quality of pans needed to properly caramelize onions, with some claiming that it can be done on any stove or pan; while others argue that a good pan and heat source is necessary. There is also a debate about the misuse of the term \"caramelized,\" with some saying it's used loosely and imprecisely. The conversation then diverges into other cooking tips and techniques such as cooking times, temperature, and equipment. The takeaway message is that while there may be different opinions on techniques and ingredients, it ultimately comes down to personal preference, and with some patience and effort, most dishes can be cooked to one's liking.The article discusses the difficulties of cooking chicken and how cooking times provided in recipes are often inaccurate. Cooking times vary based on factors such as heat output, thickness of the chicken, and pan type. Butterflied chicken can be cooked quickly, but other forms take longer to brown properly and achieve good flavor. Chefs tend to preheat pans, use thin carbon steel pans and more powerful gas burners. Domestic pans with heavier bottoms and weak burners are more challenging to use. While some recipes claim chicken can be cooked in 3-4 minutes, it takes time and lower heat to cook through, create good flavor, and achieve good texture. The article also addresses the definition of \"cooking time\" and the need to learn Linux through experimentation.The post contains a discussion about the pros and cons of using Linux, macOS, and Python packaging. It also includes a section on tips for cooking caramelized onions in a slow cooker. Some users express frustration with Linux's steep learning curve, while others praise the simplicity of ArchLinux. The discussion on Python packaging highlights the challenges of forward compatibility. The section on slow cookers provides a cheap and easy way to caramelize onions. Overall, the post covers various topics related to technology and cooking, showcasing the diverse interests of the community.No meaningful content to provide a summary.- Recipe writing can be inaccurate or oversimplified, leading to confusion or subpar results.\n- \"Caramelizing onions\" is a poorly defined term that can cause different interpretations and outcomes.\n- Recipe writers often prioritize simplified and convenient recipes over authentic or nuanced ones.\n- Some tips to improve cooking efficiency include visualization, mise en place, efficient set up, knife skills, and cleaning while cooking.This text discusses tips and tricks for more efficient cooking, including the benefits of parallelizing tasks and minimizing dirty dishes. Many of the respondents mention how their prior experience in the professional culinary industry has helped them become more efficient. Meal kit delivery services can also be helpful but may exaggerate the speed of execution. Overall, this post provides useful advice for those looking to streamline their cooking experience at home.Home cooks underestimate the amount of time prep work takes for cooking. Experienced chefs are much faster, often 4x as fast as decent home cooks. Planning ahead and prepping ingredients beforehand can save time. Experience and knowledge of techniques for preparing certain foods can also speed up cooking time. Some meal kit services do not accurately disclose cook times. Time allocation for cutting specific ingredients can vary, and prepping everything can take a lot of time, particularly for inexperienced cooks. Cooking multiple things at the same time can save time. Some services may advertise preparation times that do not reflect reality. It is essential to pre-prep food beforehand as well as learn kitchen skills to reduce cooking time.No meaningful content to provide a summary.",
    "hn_summary": "- Recipe writers often use imprecise language, leading to confusion for readers and subpar results.\n- Authentic caramelized onions require a longer cooking process than most recipes specify.\n- The quality of the pan and stove can impact the outcome of caramelizing onions."
  },
  {
    "id": 36043322,
    "timestamp": 1684844919,
    "title": "Waymo & Uber partner to bring autonomous driving technology to Uber",
    "url": "https://blog.waymo.com/2023/05/waymo-and-uber-partner-to-bring-waymos.html",
    "hn_url": "http://news.ycombinator.com/item?id=36043322",
    "content": "Back to all postsMay 23, 2023Waymo and Uber partner to bring Waymo’s autonomous driving technology to the Uber platformThe Waymo & Uber TeamsToday, Waymo and Uber are excited to announce a new, multi-year strategic partnership to make the Waymo Driver available to more people via the Uber platform starting in Phoenix.Since both companies were founded in 2009, Waymo and Uber have in their own ways each revolutionized access to mobility. Now, we’re partnering to bring together Waymo’s world-leading autonomous driving technology with the massive scale of Uber’s ridesharing and delivery networks.This integration will launch publicly later this year with a set number of Waymo vehicles across Waymo’s newly expanded operating territory in Phoenix, and will include local deliveries and ride-hailing trips. Uber users will be able to experience the safety and delight of the Waymo Driver on both the Uber and Uber Eats apps. Riders will also still be able to hail a Waymo vehicle directly through the Waymo One app. At over 180 square miles, Waymo’s Phoenix operations are currently the largest fully autonomous service area in the world.“We’re excited to offer another way for people to experience the enjoyable and life-saving benefits of full autonomy,” said Tekedra Mawakana, co-CEO of Waymo. “Uber has long been a leader in human-operated ridesharing, and the pairing of our pioneering technology and all-electric fleet with their customer network provides Waymo with an opportunity to reach even more people.”\"Uber provides access to a global and reliable marketplace across mobility, delivery, and freight,” said Dara Khosrowshahi, CEO of Uber. “Fully autonomous driving is quickly becoming part of everyday life, and we're excited to bring Waymo's incredible technology to the Uber platform.\"Waymo and Uber look forward to providing a safe, enjoyable – fully electric and fully autonomous – experience.",
    "summary": "- Waymo and Uber have announced a new strategic partnership that will bring Waymo's autonomous driving technology to the Uber platform starting in Phoenix.\n- The integration will launch later this year with a set number of Waymo vehicles across Waymo's operating territory and include local deliveries and ride-hailing trips.\n- Uber users will experience the safety and delight of the Waymo Driver on both the Uber and Uber Eats apps, and riders can still hail a Waymo vehicle directly through the Waymo One app.",
    "hn_title": "Waymo and Uber partner to bring autonomous driving technology to Uber",
    "original_title": "Waymo and Uber partner to bring autonomous driving technology to Uber",
    "score": 394,
    "hn_content": "Waymo and Uber have partnered to bring autonomous driving technology to Uber by offering Waymo's vehicles on the Uber app. Waymo benefits by offering autonomous driving services while still using Uber's customer base and infrastructure. However, both companies' long-term negotiations are uncertain. Tesla's potential for developing an end-to-end AI system may make them a competitor to Waymo. Uber has agreed to allow Waymo to offer its vehicles on the app, which could cause Uber's customers to lose trust in the company if there's a shortage of available Waymo vehicles. Acquiring riders is cheap, so other companies may buy a lot of Teslas or partner with Waymo's competitors, leaving Waymo with a significant amount of leverage.Google has the legal and financial resources to compete with Uber, and could potentially recruit employees from the ride-sharing giant. However, Google Fiber's struggle with regulatory roadblocks shows that regional regulations are a major obstacle, though there is no equivalent to other ISPs preventing Waymo from operating. While Google could theoretically build the necessary legal structure and network of riders, they have historically shied away from operations-heavy businesses that require significant real-world investments. Additionally, building a large-scale ride-sharing platform and brand recognition is challenging, as illustrated by Google's failed attempts at messaging apps and social media. Nevertheless, Waymo's driverless technology could enable them to instantly gain market share by offering competitive pricing.Google's self-driving car arm, Waymo One, is already live and serving customers in Phoenix, AZ. While Google could easily replicate Uber's app, the challenge would be getting users and drivers to sign up. Waymo One's advantage is that it controls the driving side, making it a one-sided marketplace. Replicating Uber is hard as it is a two-sided market, but Waymo doesn't have to convince drivers to sign up. Meanwhile, Uber is trying to eliminate its drivers, as seen through its recent deal with Waymo. The power of Uber lies in its name recognition and installed user base in a two-sided marketplace, making it hard for competitors to replicate. Nonetheless, Uber's pivot to doing partnerships with self-driving players seeking customer bases seems to be a smart move.Alphabet's self-driving unit Waymo has formed a partnership with ride-sharing company Uber. Uber will now work on an autonomous vehicle pilot project with Waymo as its hardware provider. The firms will also team up in the creation of an independent self-driving technology organisation to help transform the existing automotive industry. The first to benefit from this will be Uber, with Waymo to provide an autonomous driving system for the ride-hailing service’s vehicles. Meanwhile, Waymo and Uber will work together to develop Uber’s application for booking and managing rides in self-driving cars.\nWaymo has partnered with Uber to bring self-driving cars to customers via Uber's ride-hailing app. The deal will allow Waymo to roll out its autonomous vehicles to more passengers, while Uber gets to finally introduce driverless cars. The partnership will enable Waymo to have a slow rollout, soft launch, with data collection on user and market behaviour at each step. It is not an exclusive contract and Uber could strike a similar deal with Cruise. However, Waymo is building a 'driver-as-a-service' model, whereby they lease out its AV technology, rather than being the owner-operator. Google owns a stake in Uber and a large percentage of Waymo, which incentivises it to succeed and grow. The deal is significant as ride-hailing services are looking to be 100% autonomous with self-driving cars. Uber and Waymo, Google's self-driving car unit, have signed a deal for Waymo to provide autonomous car technology to Uber. The agreement, which will allow Waymo to use Uber to test its autonomous cars, underlines the likelihood of the technology becoming integrated with ride-hailing services more widely. The deal reflects Uber's need to pivot and Waymo's impatience in attaining a head start in ride hailing. This step will enable Waymo to get hands-on experience using Uber's customer and supply chain. Meanwhile, Uber will be able to supplement its ride-hailing offering with Waymo's innovational autonomous tech. Uber's legal wrangling with Waymo's parent company Google over IP stolen by former engineer Anthony Levandowski in 2016 doesn't seem to have impacted the deal.Waymo and Uber have announced a partnership to bring Waymo's autonomous vehicles to Uber's platform in Phoenix, Arizona. Waymo will still operate its own direct-to-consumer ride-hail service in the area. The partnership allows both companies to give passengers more choices in terms of ride options and has the potential to increase overall demand for self-driving rides. However, some commenters have raised concerns about the popularity of autonomous taxis among consumers and the potential for induced demand if road capacity is not addressed in a broader sense. Tesla's progress in FSD technology has also been noted, with some believing that they may eventually introduce their own autonomous ride-hailing network using their vehicles.",
    "hn_summary": "- Waymo and Uber have partnered to bring autonomous driving technology to Uber's app, benefitting both companies.\n- Tesla's potential for competing with Waymo and the uncertain nature of the long-term negotiations between Uber and Waymo are concerns.\n- Waymo One, Google's self-driving car arm, already serves customers in Phoenix, AZ and has an advantage as a one-sided marketplace."
  },
  {
    "id": 36047861,
    "timestamp": 1684863552,
    "title": "Kanboard: free & open source Kanban project management software",
    "url": "https://kanboard.org/",
    "hn_url": "http://news.ycombinator.com/item?id=36047861",
    "content": "KanboardKanboard is a free and open source Kanban project management software.Visualize your workLimit your work in progress to focus on your goalDrag and drop tasks to manage your projectSelf-hostedSuper simple installationFeaturesPluginsDonationsDownload latest releaseDocumentation (Czech, French, Russian, Spanish, Portuguese, Turkish)RequirementsInstallation instructionsUpdate to a new versionDocker usageDiscourse Forum - GitHub DiscussionsBug tracker (only for bugs)Code RepositoriesRSS feedTwitter - MastodonFeaturesSimpleThere is no fancy user interface, Kanboard focuses on simplicity and minimalism. The number of features is voluntarily limited.Visual and clear overview of your tasksThe Kanban board is the best way to know the current status of a project because it's visual. It's very easy to understand, there is nothing to explain and no training is required.Drag and drop tasks between columns easilyYou can add, rename and remove columns at any time to adapt the board to your project.Limit your work in progress to be more efficientAvoid multitasking to stay focused on your work. When you are over the limit, the column is highlighted.Search and filter tasksKanboard has a very simple query language that offers the flexibility to find tasks in no time. Dynamically apply custom filters on the board to find what you need. Search by assignees, description, categories, due date, etc.Tasks, subtasks, attachments and commentsBreak down a task into sub-tasks, estimate the time or the complexity.Describe your task by using Markdown syntax.Add comments, documents, change the color, the category, the assignee, the due date.Move or duplicate your tasks across projects with one click.Automatic actionsDon't repeat yourself! Automate your workflow with automated actions. Stop doing again and again the same thing manually. Change automatically the assignee, colors, categories and almost anything based on events.Translated in 30+ languagesThanks to the different contributors, Kanboard is translated in Bahasa Indonesia, Bosnian, Brazilian Portuguese, Chinese, Chinese (Taiwan), Czech, Danish, Dutch, English, Finnish, French, German, Greek, Hungarian, Italian, Japanese, Korean, Malay, Norwegian, Polish, Portuguese, Romanian, Russian, Serbian, Spanish, Swedish, Thai, Turkish, Vietnamese.Multiple Authentication BackendsConnect Kanboard to your LDAP/Active Directory server or use any OAuth2 provider (Google, GitHub, GitLab...).Free and Open Source softwareKanboard is distributed under the permissive MIT License. The software is mainly developed by Frédéric Guillot, but more than 267+ people have contributed!DonationsIf you are using Kanboard every day at your company, consider making a small donation.LiberaPayMake a donation to Kanboard on LiberaPay.PayPalDiscover Miniflux, a minimalist of opinionated feed reader.",
    "summary": "- Kanboard is an open source project management software that uses the Kanban methodology.\n- It provides a clear and visual overview of your tasks and allows for simple drag-and-drop task management.\n- Kanboard has a simple query language to search and filter tasks and provides multiple authentication backends, including OAuth2 providers.",
    "hn_title": "Kanboard: free and open source Kanban project management software",
    "original_title": "Kanboard: free and open source Kanban project management software",
    "score": 394,
    "hn_content": "Kanboard is free and open-source Kanban project management software with an Obsidian plugin, also there are several other plugins available for Obsidian users.\nUsers can make their Kanban board on Kanboard, back it up using Git, or sync it across multiple devices via a cloud service.\nUsers have also suggested using physical corkboards or Taiga.io as other Kanban board alternatives.\nWeKan is another well-regarded Kanban board that has",
    "hn_summary": "- Kanboard is a free and open-source Kanban project management software with an Obsidian plugin and other plugins for users.\n- Users can back up their Kanban boards using Git or sync them across multiple devices via a cloud service.\n- Other suggested Kanban board alternatives include physical corkboards or Taiga.io, and WeKan is another popular Kanban board."
  },
  {
    "id": 36046662,
    "timestamp": 1684859468,
    "title": "How to start a Go project in 2023",
    "url": "https://boyter.org/posts/how-to-start-go-project-2023/",
    "hn_url": "http://news.ycombinator.com/item?id=36046662",
    "content": "Ben E. C. Boyter's blog post offers a comprehensive guide for anyone interested in beginning a Go project in 2023. The post includes information on installing and setting up Go, starting a project, getting dependencies, building and installing, unit testing, and more. Additionally, the article covers topics such as linting, profiling, and deploying, as well as the Go community, useful tools, and packages, and helpful resources for learning. The post focuses on providing detailed guidance for newbies while including helpful tips for experienced developers. Overall, the article is an excellent resource for anyone looking to start their Go journey or improve their current skills.- Having multiple main.go files in the main package provides entry points to an application.\n- A pattern for achieving this is to create a directory inside the application's root and place main.go files in there.\n- Entry points can import from the root package, allowing for multiple entry points to an application.\n- OS-specific code can be created using a file structure that specifies the operating system.\n- Docker allows for easy running of applications with multiple entry points.\n- Tools and packages like gow, hyperfine, and golangci-lint can help with Go development and testing.\n- Packages like gjson and zerolog can assist with JSON parsing and structured logging.\n- Google's go-cmp and uuid packages are recommended for equality checks and UUID creation, respectively.",
    "summary": "- The blog post offers a comprehensive guide for starting a Go project in 2023, including installation, setting up, dependencies, testing, and more.\n- The guide provides tips for both newbies and experienced developers, with topics covering linting, profiling, deploying, and helpful resources for learning.\n- A pattern for creating multiple entry points to an application is to create a directory inside the root package and placing main.go files in there.",
    "hn_title": "How to start a Go project in 2023",
    "original_title": "How to start a Go project in 2023",
    "score": 367,
    "hn_content": "A post on Hacker News discusses how to start a Go project, with a focus on using the default toolchain and not using \"go mod vendor\" to avoid bloating the repo. Several comments debate the merits of vendoring dependencies, with some advocating for it as a way to have control over dependencies and avoid external HTTP calls in CI/CD pipelines. Others suggest using a cache-proxy to avoid bloating the repo. Another topic debated is the use of UPX to strip binaries, with opinions divided on whether it's worth it or if it increases memory usage. One commenter suggests using gzip instead. Overall, the post sparked debate among commenters about best practices for starting a Go project.The post covers various tools and patterns for Go development, including vendoring, cli creation, logging, testing, and file watching. The use of build tags for integration tests is discouraged in favor of environment variables or CLI flags. The article is ideal for newcomers as it provides information on what people will almost certainly need to know and includes links toA user is asking for ways to reduce binary file size in Golang.\nAnother user suggests using the tool \"goda\" to analyze package dependencies and estimate potential savings.\nSome commenters note that the K8s client package in Golang can be bloated and offer alternative solutions.\nA user asks about the negative perception of Golang on Hacker News and receives no direct answer.",
    "hn_summary": "- The post debates whether to use vendoring for dependencies in Go projects, with some advocating for it and others suggesting using a cache-proxy instead.\n- The use of UPX to strip binaries is also discussed, with opinions divided on its effectiveness.\n- The article covers various tools and patterns for Go development, making it ideal for newcomers. One user suggests using \"goda\" to analyze package dependencies and reduce binary file size."
  },
  {
    "id": 36043944,
    "timestamp": 1684848533,
    "title": "Launch HN: Common Paper (YC W23) – SAFEs for Commercial Contracts",
    "url": "",
    "hn_url": "http://news.ycombinator.com/item?id=36043944",
    "content": "",
    "summary": "",
    "hn_title": "Launch HN: Common Paper (YC W23) – SAFEs for Commercial Contracts",
    "original_title": "Launch HN: Common Paper (YC W23) – SAFEs for Commercial Contracts",
    "score": 358,
    "hn_content": "Contract management platform Common Paper has launched a series of standard open-source contracts for free use, along with a platform for users to sign them quickly. With a committee of 40 attorneys from tech companies and law firms contributing, the contracts include non-disclosure and sales agreements, as well as service level and design partner agreements. The platform is modelled like an open-source project, with users uploading feedback and suggestions for updates similar to code contributions. Contracts are split between standards, which remain consistent across all uses of that agreement, and cover pages, which permit customisation for individual companies and deals. The company's business model provides contracts for free, and charges for use of the software.Common Paper, a startup that provides open-source standardized contracts for cloud services, is gaining traction in the market. The startup's contracts are available on GitHub and are maintained by a committee of contributors, mostly attorneys. Common Paper also offers APIs for integration and uses Dropbox Sign to embed signatures. While there are concerns about the contracts' ability to capture all the nuances of sophisticated commercial parties, Common Paper has seen some success in persuading Fortune 500 companies to sign six-figure deals on its paper. The startup aims to change the culture around legal documentation and incentivize lawyers to use standardized contracts. Common Paper's contracts are released under the CC BY 4.0 license and are intended to help startups avoid costly legal fees.CommonPaper is a contract management and negotiation platform that offers a free standard contract template created by attorneys who specialize in tech law. The platform charges users for additional features, including contract management and support. The primary target customers are B2B SaaS startups and small businesses. The company has already seen success with Fortune 500 companies using their standard contracts, though larger companies such as Oracle are less likely to adopt it. The platform may serve as an example in a push towards industry standardization of contracts, which could reduce legal expenses and earn the trust of larger organizations. The platform's founders plan to expand its services to include a Standard Business Associate Agreement (BAA) for healthcare providers.Common Paper, a start-up, has launched an automated contract management software. Contracts are standardised using either the Federal Acquisition Regulations or the Defense Federal Acquisition Regulations, eliminating the need for lawyers. Once standardised, the software helps automate contract creation, redlines and amendments. The software includes an eSignature function through Dropbox, single sign-on, integrations with Slack and G Suite, and searchable text and data. The service comes at a cost, though, with businesses paying $5 per contracted customer per month, unless they have self-serve customers that click through agreements.- Common Paper, a startup using technology to aid contract management, aims to help focus on key changes from contract to contract and minimize hunting for words within a contract.\n- The startup, initially targeting Silicon Valley tech companies, offers a series of free, standardized contract templates created with help from lawyers. Users can also customize contracts based on their requirements.\n- While some users appreciate the notion that much of the wording can be standardized, with key variables identified and extracted as structured data, others are skeptical about the product's scalability and suitability for various industries.\n- Common Paper has plans to expand beyond tech and also aims to add versions for other countries.",
    "hn_summary": "- Common Paper, a contract management platform, has launched a series of standard, open-source contracts for free use, with feedback and suggestions from users similar to code contributions.\n- The platform charges for additional features, including contract management and support, and has seen success persuading Fortune 500 companies to sign six-figure deals on its paper.\n- Common Paper's contracts are released under a CC BY 4.0 license and are intended to help startups avoid costly legal fees; it aims to change the culture around legal documentation and incentivize lawyers to use standardized contracts."
  },
  {
    "id": 36038868,
    "timestamp": 1684806600,
    "title": "RWKV: Reinventing RNNs for the Transformer Era",
    "url": "https://arxiv.org/abs/2305.13048",
    "hn_url": "http://news.ycombinator.com/item?id=36038868",
    "content": "",
    "summary": "- RWKV is a new method for enhancing the performance of RNNs (Recurrent Neural Networks) in natural language processing tasks.\n- This new method incorporates techniques from the Transformer architecture, which is the basis of popular models such as BERT and GPT-2.\n- RWKV reportedly achieves state-of-the-art results on four different NLP tasks, including language modeling and sentiment analysis.",
    "hn_title": "RWKV: Reinventing RNNs for the Transformer Era",
    "original_title": "RWKV: Reinventing RNNs for the Transformer Era",
    "score": 343,
    "hn_content": "Researchers are questioning whether attention mechanisms can hold up as token size increases, wondering if models will start to generalize and lose granularity, while reminiscing about the expansive memories of the human brain. Some are pointing out that \"attention\" is a misnomer and suggesting a new term for it. Meanwhile, it is discussed whether the transformer approach poses a hurdle on the path to more human-like AGI, as the system lacks advanced long-term memory, unlike humans. There is also discussion of newer models that employ sparse attention to cope with memory use effectively. The article provokes thought and engages the community in a discussion on the potential of models and fundamental differences between humans and AI.A discussion on the limitations of Language Models (LLMs) in handling large contexts while recalling minutiae information. Linear attention of Recursive Weighted Keys Variant (RWKV) can limit the model's ability to \"look back\" at previous tokens compared to standard self-attention mechanisms. Prompt engineering is crucial for the model's performance on tasks. An LLM's context window can be compared to the human mind's limited capacity to recall discussed topics while reading long books. However, humans have demonstrated exceptional memory abilities in some cases. As such, LLMs may require specific datasets optimized for large context sizes, such as code, to become efficient in handling such contexts. Lastly, the difference between LLMs and the human mind must not be overlooked despite the output similarities.- Transformers have benefits over RNNs as they can reference things within context, but require more memory and compute power.\n- Using books as an example, humans don't remember every word, but may vaguely remember which section or book events occur.\n- People condense information from over several thousand tokens ago into higher-level chunks, and it's not clear how to teach this.\n- There may be a universality principle at work, where model size and dataset size matter more than architecture.\n- RWKV is an open-source chat model that can be used commercially on the chatbot arena score board and is undertrained.\n- There are low-hanging fruit contributions, such as improving code quality and helping with datasets, that beginners without PhDs can make.\n- Raising funds for RWKV is critical to sustain and scale the project, and GPUs are more accessible than money in some cases.\n- There are plans for a RWKV5 and focus on models with 1-14B parameters, and there is interest in testing at ~60B model size.Researchers discuss training a 30B model in six months with the new neural network architecture called RWKV, which uses recurrent neural networks (RNNs) instead of transformers; RWKV is said to provide a 10-fold reduction in GPU time for inference and training tokens over transformers. The RWKV community is mostly led by one person and has churned out an open-source LLM called ChatRWKV backed by LLM, which could leverage RWKV's parallelism. While RWKV might increase the focus on innovative architecture beyond transformers, there is a need to improve its attention span, maintain context outside the RNN, and aligning it to the dataset for better interpretability. RWKV requires a more substantial dataset, good model design, and a large number of GPU cards, which makes it an expensive model to train with a limited dataset universe; EleutherAI is willing to collaborate with RWKV developers to help test the system, among others.The Receptance Weighted Key Value (RWKV) model architecture is proposed, combining the parallelizable training of transformers with the efficient inference of RNNs. RWKV is comparable to transformers in performance but is more efficient, allowing for larger models on smaller datasets. The RWKV community is open source and welcomes contributions. There are plans to create larger RWKV models, but this requires more computational resources. The chinchilla law, stating that the amount of data required to train a language model grows exponentially with the model size, is mentioned but disputed as colloquial.\n",
    "hn_summary": "- Attention mechanisms in models are being questioned as token size increases and the granularity loss is a concern.\n- Transformers perform better for referencing within context, but require more memory and compute power.\n- RWKV is an innovative model architecture combining the parallelizable training of transformers with efficient inference of RNNs, leading to more efficiency and larger models on smaller datasets."
  },
  {
    "id": 36038950,
    "timestamp": 1684807496,
    "title": "SimCity 4 was released 20 years ago",
    "url": "https://www.rockpapershotgun.com/simcity-4-the-greatest-citybuilder-of-all-time-was-released-20-years-ago",
    "hn_url": "http://news.ycombinator.com/item?id=36038950",
    "content": "Home News SimCity 4SimCity 4, the greatest citybuilder of all time, was released 20 years agoWe may never see its like againNews by Graham Smith ContributorPublished on Jan. 15, 2023Follow SimCity 4When it was released on January 14th 2003, SimCity 4 had its problems. Its huge cities would chug on even decent PCs, for one, and its traffic simulation seemed outright broken.Twenty years later - thanks to faster PCs, the Rush Hour expansion, and a huge modding community - SimCity 4 is the best of all SimCity games. If what you care about is simulation, scale, variety, and the beauty of urban sprawl, it's also the best citybuilder.Setting aside fantasy and medieval variants, the template laid down by the SimCity series remains the expectation for most citybuilders. As the mayor of a fledgling town, you zone commercial, residential and industrial districts, place down amenities and services to satisfy residents, and attempt to balance the budget as your town begins to take on a life of its own. Then, when you've constructed a sprawling metropolis and have grown weary, you trigger some natural (or unnatural) disasters and start over.SimCity 4 did nothing to change this formula but continued its logical progression. It has 3D terrain and crisp, clear sprite-art buildings, which are one of the reasons it still looks great today. It lets you build enormous cities, and then trade resources with the neighbouring city you built previously. It has a day/night cycle, so you can see your skyscrapers twinkling in the dark. You can plop individual Sims into your city - The Sims 1 released in 2000 - and then track their lives as they commute from your polluted suburbs to their awful job, then move out of town or die.Perhaps most importantly, SimCity 4 included the BAT, the Building Architect Tool, which enabled modders to create their own buildings and place them in the game. Custom buildings, maps and mods have greatly extended the life of SimCity 4 and at the time of writing there are over 21,000 files available from community site Simtropolis, including several new uploads in the past 24 hours.Mods are why I'm confident calling SimCity 4 the best citybuilder of all time. More specifically, it's thanks to the Network Addon Mod. NAM set out in 2004 to fix SimCity 4's traffic issues, and as of its last update in September 2022 has expanded to include new UI tools, road types, light rail and much more. Given that every modern-day citybuilder inevitably boils down to tinkering with road networks and mitigating traffic jams, NAM is essential.To address the skyscraper in the room: I love Cities: Skylines and if you're new to this genre, Paradox's SimCity milkshake-drinker is where you should start. If you have been playing Cities: Skylines and you're tired of it, however, or if you don't want to cough up for the next piece of DLC, then you should graduate to SimCity 4. The SimCity 4 Deluxe Edition (including the Rush Hour expansion, also released 2003) is on Steam and GOG. Given that 2013's SimCity was a bomb, and Maxis's original studio in Emeryville closed in 2015, we may never see its like again.",
    "summary": "- SimCity 4, a popular city-building game, turned 20 years old.\n- Despite its initial flaws, the game is hailed as the best-ever SimCity game due to its large cities, 3D terrain, and customizable buildings.\n- The game's thriving modding community and the Network Addon Mod, in particular, have extended its lifespan and continue to make it popular among players.",
    "hn_title": "SimCity 4 was released 20 years ago",
    "original_title": "SimCity 4 was released 20 years ago",
    "score": 322,
    "hn_content": "SimCity 4, a popular city-building game, was released 20 years ago and some users on Hacker News shared their opinions on it. There is debate over whether SimCity 2000 or 3000 was the best version, and some users criticized the added complexity of SimCity 4. However, the comments also included recommendations for other sim games like Factorio, Banished, and Civ games, and discussion on the trend of prioritizing graphics over content in modern games. Some users also mentioned their love for games with level editors and the ability to create their own content. Overall, the post is a discussion amongst gamers and a reminder of classic games from the past.- The success of World of Warcraft changed the direction of gaming to focus more on multiplayer games and smooth UX\n- Most game generations have their \"best of\" games, with only a small handful being worth playing\n- 2D/2.5D games with deep gameplay can be more enjoyable than AAA 3D games due to the limitations of isometric projections\n- SimCity 3000 was an excellent game, with a cleaner overall design compared to the more complex and less enjoyable SimCity 4The post discusses the desire for a seamless transport tycoon game that would cover an entire country, require freight to travel long distances, and be played in multiplayer mode. The comment section includes reminiscing about SimCity 2000 and the desire for more realistic timeframes and supply chain management in city building games. There is also discussion about the compatibility of certain games, specifically Civ 6 and SimCity 2000, with modern hardware and how they push systems to their limits. The release of an Apple Silicon version of SC2K is noted. There are mentions of OpenTTD and OpenRTC, which allow for multiplayer competition and collaboration. An \"OpenSC4\" project is also discussed.Users on Hacker News share their experiences and thoughts on Sim City 4, Sim City 2000, and Cities Skylines. Some reminisce about their childhood experiences playing the game while others discuss the advantages and disadvantages of each game. A few users express interest in a city builder game that simulates bureaucracy. One user provides links to the music found in the game upon request. Overall, the thread seems to be a nostalgic and light-hearted conversation about the beloved game.Readers discuss the strengths and weaknesses of various city-building games, including Sim City 4 and Cities: Skylines. Many express a desire for more freeform zoning and larger city size limits. The role of traffic management and realistic city simulation is debated, including the use of mods to enhance gameplay. Some mention the nostalgia for older Sim City versions, while others find newer games more enjoyable. One user praises SimCity 2013 for its graphics and music, but others criticize it for its smaller city plot sizes and problematic DRM system. Prices and discounts on various games are also mentioned.- Discussion on the decline of the SimCity franchise and disappointment with the 2013 release\n- Nostalgia and appreciation for older SimCity games like SimCity 2000, 3000, and 4\n- Suggestions for modernizing SimCity 4 with AI and fixing traffic problems with mods\n- Fond memories of other Sim-based games like SimAnt and appreciation for the influence of SimCity on game design\n- Excitement over recent updates and releases, including a version for Apple Silicon and a sale on Steam\n- Opinion that Cities: Skylines is now the best city-building game, but recognizing the significance of SimCity 4 in its time.",
    "hn_summary": "- Debate over the best version of SimCity and criticism of the added complexity of SimCity 4\n- Recommendations for other sim games, discussion on prioritizing graphics over content in modern games, and praise for level editors\n- Nostalgia and reminiscing about SimCity 2000 and the desire for more realism and supply chain management in city building games"
  },
  {
    "id": 36041432,
    "timestamp": 1684829778,
    "title": "Ableton Push 3",
    "url": "https://www.ableton.com/en/push/",
    "hn_url": "http://news.ycombinator.com/item?id=36041432",
    "content": "LivePushNoteLinkShopPacksHelpMoreTry Live for freeLog in or registerOverviewTech specsLearn PushBuy nowPause: 'Push - an expressive standalone instrument'Push shown from the side, with hands playing the padsPushAn expressive standalone instrumentBuy nowFocus and feelPush gives you independence from your computer so you can be fully in the moment with your music. Connect your gear. Sculpt your sound. Play in a style that’s recognizably yours. An upgradeable instrument with replaceable components and an ever-evolving bond with Ableton Live, Push is designed to sit at the heart of your setup for years to come.Play:MPE-enabled padsShape your sound with pads that respond to the slightest movement of your fingers. Bend, slide and shift between different notes, sounds and articulations.Play:Standalone playabilityPush invites you to disconnect and be fully in the moment with your music. Send your Live sets to Push to work without a computer, then back again.Play:Built-in audio interfacePlug your instruments into Push’s own audio interface to record straight into your set. Plus, send CV and gate signals to your modular setup.Play video: Push overview videoExpressive touchResponsive MPE-enabled pads make Push an individually expressive instrument. Design multi-faceted sounds and perform them in your own style with the movement of your fingertips within each pad.Multi-directional padsMovement and articulationFilters and effectsRealistic or imagined drumsExpressive sound collectionPlay: Multi-directional padsUnmute: Multi-directional padsA person playing Push’s pads expressively with two hands. They slide between pads, change the pressure they apply, and move their fingers around within the pads to alter the sound.Push’s 64 XY-sensitive pads respond to the subtlest shifts in finger placement and pressure. Feel your way around the pads to fluidly change your sound in multiple ways as you play.The heart of your setupFrom sampling records to controlling modular jams, to making multi-track recordings of your band’s rehearsal, Push works as a flexible creative hub. Built robustly for frequent travel between sessions and stages, and made to work with your trusty old gear and your newest toys, it’ll see you through many changes in setup, sound and scene.Play: Push shown in various setups.Play video:Made to evolveWith sturdy construction and a feature set that grows alongside Live’s development, every generation of Push has a deliberately long lifespan. Push 3’s user-upgradeable parts take longevity one step further. Watch and learn about the ethos behind the instrument.Intuitive designPush’s navigation is designed to get out of your way so you can stay focused on creating. Smoothly source sounds and devices from your library, and edit MIDI quickly using the jog wheel. See your session at a glance and your devices in detail on the large LCD display. See full specsOpen DialogdolorumdignissimosenimofficiisexpeditafugiatoptioeosrepellendusautnobisOne Push, two configurationsSet your Push up in a configuration that works for your budget and music-making needs. With a processor, battery and hard drive, Push functions as a standalone instrument. Without those components you need to connect Push to your computer to make music. You can add the standalone components later using the Upgrade Kit, and replace your processor, battery or hard drive to keep up with advances in technology. See full comparisonPush (standalone)Use Push as a standalone instrument64 expressive padsBuilt-in audio interfaceIntel 11th Gen Core™ i3-1115G4 processor with 8GB of RAMBuilt-in lithium battery with up to 2.5 hours play timeBuilt-in 256GB SSD hard driveReplace processor, battery and hard drive as technology improvesUSD 1999Buy nowPushConnect Push to your computer64 expressive padsBuilt-in audio interfaceAdd a processor, battery and hard drive later using the Upgrade Kit ›USD 999Buy nowUpgrade KitIf you’ve configured your Push to connect to your computer, but later you want to use it as a standalone instrument, you can easily upgrade it yourself using the Upgrade Kit. Each Upgrade Kit contains a processor, hard drive, battery, heatsink and all the tools you need for assembly. Upgrade Kits will cost USD 1049.00 and will be available in late 2023.Learn moreSign up to our newsletterEnter your email address to stay up to date with the latest offers, tutorials, downloads, surveys and more.Register Live or PushAbout AbletonJobsFacebookTwitterYoutubeInstagramEducationOffers for students and teachersAbleton for the ClassroomAbleton for Colleges and UniversitiesCommunityFind Ableton User GroupsFind Certified TrainingBecome a Certified TrainerLanguage and LocationEnglishDeutschFrançais日本語简体中文EspañolPlease chooseUnited StatesUnited KingdomFranceGermanyCanadaJapanChinaAfghanistanAland IslandsAlbaniaAlgeriaAmerican SamoaAndorraAngolaAnguillaAntarcticaAntigua And BarbudaArgentinaArmeniaArubaAustraliaAustriaAzerbaijanBahamasBahrainBangladeshBarbadosBelarusBelgiumBelizeBeninBermudaBhutanBoliviaBonaire, Sint Eustatius and SabaBosnia And HerzegovinaBotswanaBouvet IslandBrazilBritish Indian Ocean TerritoryBrunei DarussalamBulgariaBurkina FasoBurundiCambodiaCameroonCanadaCape VerdeCayman IslandsCentral African RepublicChadChileChinaChristmas IslandCocos (Keeling) IslandsColombiaComorosCongoCongo, The Democratic Republic Of TheCook IslandsCosta RicaCote D'IvoireCroatiaCubaCuracaoCyprusCzech RepublicDenmarkDjiboutiDominicaDominican RepublicEcuadorEgyptEl SalvadorEquatorial GuineaEritreaEstoniaEthiopiaFalkland Islands (Malvinas)Faroe IslandsFijiFinlandFranceFrench GuianaFrench PolynesiaGabonGambiaGeorgiaGermanyGhanaGibraltarGreeceGreenlandGrenadaGuadeloupeGuamGuatemalaGuernseyGuineaGuinea-BissauGuyanaHaitiHeard Island And McDonald IslandsHondurasHong Kong SAR, ChinaHungaryIcelandIndiaIndonesiaIran (Islamic Republic Of)IraqIrelandIsle Of ManIsraelItalyJamaicaJapanJerseyJordanKazakhstanKenyaKiribatiKorea, Democratic People's RepublicKorea, Republic OfKuwaitKyrgyzstanLao People's Democratic RepublicLatviaLebanonLesothoLiberiaLibyaLiechtensteinLithuaniaLuxembourgMacao SAR, ChinaMadagascarMalawiMalaysiaMaldivesMaliMaltaMarshall IslandsMartiniqueMauritaniaMauritiusMayotteMexicoMicronesia, Federated States OfMoldova, Republic OfMonacoMongoliaMontenegroMontserratMoroccoMozambiqueMyanmarNamibiaNauruNepalNetherlandsNew CaledoniaNew ZealandNicaraguaNigerNigeriaNiueNorfolk IslandNorth Macedonia, Republic ofNorthern Mariana IslandsNorwayOmanPakistanPalauPalestinian Territory, OccupiedPanamaPapua New GuineaParaguayPeruPhilippinesPitcairnPolandPortugalPuerto RicoQatarReunionRomaniaRussian FederationRwandaSaint HelenaSaint Kitts And NevisSaint LuciaSaint Martin (French Part)Saint Pierre And MiquelonSaint Vincent And The GrenadinesSamoaSan MarinoSao Tome And PrincipeSaudi ArabiaSenegalSerbiaSeychellesSierra LeoneSingaporeSint MaartenSlovakiaSloveniaSolomon IslandsSomaliaSouth AfricaSouth Georgia And The South Sandwich IslandsSouth SudanSpainCanary Islands (Spain)Sri LankaSudanSurinameSvalbard And Jan MayenSwazilandSwedenSwitzerlandSyrian Arab RepublicTaiwanTajikistanTanzania, United Republic OfTerritory of the French Southern and Antarctic LandsThailandTimor-LesteTogoTokelauTongaTrinidad And TobagoTunisiaTurkeyTurkmenistanTurks And Caicos IslandsTuvaluUgandaUkraineUnited Arab EmiratesUnited KingdomUnited StatesUnited States Minor Outlying IslandsUruguayUzbekistanVanuatuVatican City State (Holy See)VenezuelaViet NamVirgin Islands (British)Virgin Islands (U.S.)Wallis And FutunaWestern SaharaYemenZambiaZimbabweContact UsPress ResourcesLegal InfoPrivacy PolicyCookie SettingsImprintMade in Berlin/* Blocked by AdGuard */",
    "summary": "- Ableton Push 3 is a standalone instrument that gives musicians independence from their computers while making music.\n- It has 64 MPE-enabled pads that respond to finger movement and pressure, giving the user more expressive sound design and control.\n- Push can be used as a creative hub for different musical setups and has a long lifespan with user-upgradeable parts.",
    "hn_title": "Ableton Push 3",
    "original_title": "Ableton Push 3",
    "score": 313,
    "hn_content": "Ableton has released the Push 3, an improved version of its popular MIDI controller used with Live digital audio workstation (DAW). The device can also function as a standalone product to allow musicians to create tracks without a computer. The Push 3 features more advanced pads with MPE (multidimensional polyphonic expression) and is suitable for both hobby musicians and professionals. While the price for the controller is not inexpensive, replacing it in case of damage is made easier with an upgradeable processor, battery, and hard drive. The device integrates well with Live as compared to other controllers, and reviewers recommend getting Push 3 to use with Ableton Live. The addition of controls beyond pads appears to have drummed up the most excitement among its target audiences, making it a must-have for music enthusiasts.HN's famous/infamous Dropbox comment made three distinct arguments that were mocked at the time but later turned out to be kind of correct. The Push 3, a standalone device that offers deep control of Ableton Live 11, became the subject of discussions on the comment. The primary appeal of the Push 3 is its physical knobs, buttons, and pads, a massive selling point to loads of musicians since iPads lack the same appeal. The Standalone Push 3 runs on a Linux operating system and depends only on Ableton Live 11, making it perfectly integrated hardware. It is not a substitute for iPad or any other device as you cannot add plugins to it. Ableton Live 11 may not be coming to iOS anytime soon due to iOS's architecture, which does not allow a sustainable practice.A discussion between musicians and developers on the shift in priorities of Apple towards its pro users. Some believe that Apple's neglect of its pro users has caused problems, including sound card driver issues and the use of third-party kernel extensions. Others argue that Apple is still committed to its pro users and point to new releases of Logic Pro and an iPad version as proof. Multiple users suggest purchasing stage pianos with MIDI capabilities over pure MIDI controllers for better key action. The Zynthian project is also recommended as a way to access numerous sounds and functionalities on a Raspberry Pi.Professional musicians may delay upgrading their Mac OS due to compatibility issues with plugins and hardware, with some even using older systems perpetually. Many musicians prioritize stability over having the latest Mac OS. However, amateur musicians may be more likely to update quickly. The Push 3, a musical device produced by Ableton for performers, has been released to the market and is considered by some as the ultimate musical instrument. While some musicians prefer to use traditional tools such as a keyboard and mouse to create music, others find value in using a separate, physically embodied musical instrument, such as a pad controller, which can facilitate a different way of thinking and creating. However, some individuals find using a pad controller too expensive and clunky, and not an efficient way to create electronic music.Users discuss their preferences for different music creation workflows, debating the advantages and disadvantages of physical instruments, MIDI keyboards, DAWs, and devices such as the Ableton Push and Linnstrument. Some users praise the Push 3's built-in battery, self-explanatory controls, and slick movement, while others express skepticism about the tediousness of using such devices compared to physical instruments. The discussion also touches on the constraints and potential benefits of MPE and similar MIDI features. Overall, the thread offers a valuable perspective on the use of technology in music creation and how different users' preferences and experiences shape their workflows.Ableton has unveiled the Push 3, a standalone device that allows musicians to produce music without a computer. The device is modular and can be upgraded with a hard drive and processor. The standalone version is priced at $2,199 and is powered by an 11th Gen Core i3-1115G4 processor with 8GB of RAM. It features MPE and CV-capable output, as well as a Linux stack. Ableton will also bring its music-making software to Live 10 and Live 11. The device was highly anticipated, with many users requesting a standalone version for years. It is set to compete against devices such as Akai's MPC X and Akai Force.Ableton has announced their new Push 3 controller for music production, which is priced at $799. The device features MPE (MIDI Polyphonic Expression) and a battery, making it portable. However, some users commented that it is expensive and wished for a cheaper standalone device instead. Others recommended Novation Launchpad models as an alternative with Ableton Live Lite license, or groove boxes from the market such as Circuit Tracks as an entry-level device. Additionally, some users suggested going for iPad with logic or other music production apps as an option. Lastly, there was a discussion about the challenge of providing tech support for Linux users, and companies often have to make decisions on which configurations they officially support.No meaningful content to provide a summary.",
    "hn_summary": "- Ableton has released the Push 3, an updated MIDI controller that can also function as a standalone device for music production without a computer.\n- The device features advanced pads with MPE, upgradeable components, and integration with Ableton Live, making it a must-have for many musicians.\n- Discussions revolve around preferences in music creation workflows, with some users preferring physical instruments or MIDI keyboards over pad controllers like the Push, while others praise its self-explanatory controls and slick movement."
  }
]
