[
  {
    "id": 38132016,
    "title": "מפתח פורש שישחרר ארבעה עשורים של קוד מקור, כולל מערכות הפעלה נדירות",
    "originLink": "https://dunfield.themindfactory.com/dnldsrc.htm",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38132016",
    "commentBody": "",
    "originSummary": [
      "דייב, מפתח תוכנה שפרש לגמלאות, הופך את קוד המקור בן 40 השנים שלו למערכות הפעלה, כלי עזר, כלים ותוכניות שונות לציבורי, מתוך כוונה שהוא יועיל או יחנך אחרים.",
      "תרומותיו הבולטות כוללות את \"ARMOS\", ליבה מרובת תהליכים/משימות עבור ARM, \"CUBIX\", מערכת הפעלה שתוכננה עבור מעבד 6809, ו-\"DMS\", מערכת ההפעלה הראשונה שלו שפותחה בשנת 1980.",
      "מהדורה זו מספקת הזדמנות ייחודית לאנשי טכנולוגיה עתידיים או מתעניינים ללמוד מעבודתו של מתכנת מנוסה וממורשת הקוד."
    ],
    "commentSummary": [
      "דייב, מפתח תוכנה ותיק, משחרר את 40 שנות קודי המקור שלו של מערכות הפעלה, כלי עזר, כלים ותוכנות מגוונים לטובת מפתחים אחרים.",
      "תוכניות ראויות לציון שהוא תרם להן כוללות את \"ARMOS\", ליבה המאפשרת מספר תהליכים/משימות עבור מעבדי ARM, \"CUBIX\", מערכת הפעלה עבור מעבד 6809, ו-\"DMS\", מערכת ההפעלה המוקדמת ביותר שלו שפותחה בשנת 1980.",
      "פעולה ייחודית זו מעודדת למידה ושיתוף ידע בקהילת פיתוח התוכנה ומספקת משאבים שלא יסולא בפז למפתחים מנוסים ומתחילים כאחד."
    ],
    "points": 797,
    "commentCount": 202,
    "retryCount": 0,
    "time": 1699032376
  },
  {
    "id": 38130418,
    "title": "אישיות YouTube יוצרת פלטפורמת הונאה כדי ללכוד רמאי ביטקוין: שיתוף פעולה עם בורסת הקריפטו Kraken מתגלה",
    "originLink": "https://www.youtube.com/watch?v=dWzz3NeDz3E",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38130418",
    "commentBody": "",
    "originSummary": [
      "אושיית היוטיוב קיד קיד בוגר, וצוותו פיתחו פלטפורמת הונאה כדי ללכוד רמאים של ביטקוין, עם תכונות כמו כרטיס מתנה מזויף של ביטקוין ושירות לקוחות מזויף שמכניסים את המתקשרים להמתנה בלתי מוגבלת.",
      "ישות זו, שהחלה במקור כצחוק, הפכה כעת למיזם רציני, המסייע לקורבנות הונאות ומקל על חקירת פעילויות הונאה.",
      "יוזמה זו המשבשת את ניצול כספומטי ביטקוין משותפת כסיפור הצלחה על ידי היוצר, ומדגישה את הפוטנציאל של רעיונות קטנים להוביל לתוצאות משמעותיות."
    ],
    "commentSummary": [
      "הצוות של איש היוטיוב קיד קיד בוגרר פיתח פלטפורמת הונאה שנועדה ללכוד רמאים של ביטקוין, ומציעה כרטיסי מתנה או קבלות פיקטיביות של ביטקוין.",
      "הפלטפורמה, שנוצרה בתחילה כבדיחה, משרתת כעת מטרה רצינית, מעכבת נוכלים עם אתגרים ועצירת שירות לקוחות בלתי נגמרת, ומשבשת את פעילותם של אלה המנצלים כספומטים של ביטקוין.",
      "כלי לא קונבנציונלי זה מסייע לקורבנות הונאה ומשתף פעולה עם פלטפורמת הקריפטו, Kraken, כדי לחקור הונאות, מה שמחזק את החשיבות של רעיונות קטנים עם פוטנציאל לייצר תוצאות משמעותיות."
    ],
    "points": 638,
    "commentCount": 286,
    "retryCount": 0,
    "time": 1699025931
  },
  {
    "id": 38128699,
    "title": "מפתח תוכנה מעריך כלי איתור באגים למרות תהליך פתרון בעיות בן שבוע",
    "originLink": "https://shmck.substack.com/p/no-dogs-were-harmed-in-the-making",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38128699",
    "commentBody": "",
    "originSummary": [
      "שון, מפתח תוכנה, משתף את החוויה שלו בפוסט ב-Substack על תהליך ניפוי באגים מאתגר בן שבוע שגרם לו לפקפק בבחירת הקריירה שלו.",
      "לאחר שקיבל תובנות מחברים בתחומים כמו הנדסה, רפואה וטרינרית ומדעי המחקר, שון מכיר בכך שבעוד שכל המקצועות מתמודדים עם אתגרים ייחודיים, למפתחי תוכנה יש את הפריבילגיה להשתמש בכלי ניפוי באגים יעילים.",
      "הוא מביע הכרת תודה על כלי ניפוי הבאגים הללו, למרות שגיאת קידוד קלה שהובילה לתהליך ניפוי באגים בן שבוע."
    ],
    "commentSummary": [
      "שון, מפתח תוכנה, מתעד את חוויית ניפוי הבאגים בת השבוע שלו ב-Substack, פלטפורמה מקוונת שבה מפרסמים פרטיים יכולים לשתף תוכן.",
      "תהליך ניפוי הבאגים המאומץ הוביל אותו לפקפק בבחירת הקריירה שלו, אך קיבל פרספקטיבה באמצעות דיונים עם חברים במקצועות כמו הנדסה, רפואה וטרינרית ומדעי המחקר.",
      "כשהוא מגיע להבנה, הוא מעריך את הערך של כלי ניפוי באגים יעילים הזמינים למפתחי תוכנה למרות הבעיות הנגרמות על ידי שגיאת קידוד פשוטה."
    ],
    "points": 430,
    "commentCount": 186,
    "retryCount": 0,
    "time": 1699019273
  },
  {
    "id": 38136607,
    "title": "להקת רוק פורטוגל. האתר הרשמי של האיש הוסב למסמך Google Sheets",
    "originLink": "https://www.portugaltheman.com/?frontpage=true",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38136607",
    "commentBody": "",
    "originSummary": [
      "דף זה הוא פלטפורמת הרשמה לקבלת העדכונים האחרונים אודות פורטוגל. האיש, להקה מוזיקלית.",
      "הוא מספק אפשרויות מרובות כמו יצירת קשר, משוב, תנאי שימוש, מדיניות פרטיות, אפשרויות בחירה של מודעות ומדיניות קובצי Cookie.",
      "למשתמשים ניתנת אפשרות למנוע מכירה או שיתוף של הנתונים האישיים שלהם, מה שמבטיח פרטיות נתונים משופרת."
    ],
    "commentSummary": [
      "זהו דף הרשמה לקבלת עדכונים אחרונים על פורטוגל. האיש, מציע כמה בחירות.",
      "התכונות כוללות פרטי קשר, אפשרויות משוב, תנאי שימוש, מדיניות פרטיות, בחירות מודעות ומדיניות קובצי Cookie.",
      "למשתמשים ניתנת גם אפשרות למנוע מכירה או שיתוף של המידע האישי שלהם."
    ],
    "points": 310,
    "commentCount": 89,
    "retryCount": 0,
    "time": 1699055994
  },
  {
    "id": 38127560,
    "title": "רואנדה וקניה יוזמות נסיעות ללא ויזה לאזרחים אפריקאים כדי להגביר את הסחר והתיירות",
    "originLink": "https://africa.businessinsider.com/local/leaders/from-barriers-to-unity-rwanda-joins-kenya-to-initiate-visa-free-travel-for-all/hhqe29q",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38127560",
    "commentBody": "",
    "originSummary": [
      "רואנדה וקניה מציגות נסיעות ללא ויזה לכל אזרחי אפריקה, במטרה להגביר את התיירות והסחר הפנים-אפריקאים.",
      "ההכרזות נמסרו על ידי נשיא רואנדה פול קגאמה בפסגה העולמית ה-23 של מועצת הנסיעות והתיירות העולמית, ועל ידי נשיא קניה ויליאם רוטו, שהצהיר כי השינוי ייושם עד סוף השנה.",
      "שינויים אלה עולים בקנה אחד עם יוזמות האיחוד האפריקני לאחדות וסחר חופשי, כולל השקת דרכון אפריקאי בשנת 2016 והקמת אזור סחר חופשי יבשתי בשווי של כ -3.4 טריליון דולר."
    ],
    "commentSummary": [
      "רואנדה וקניה מציגות נסיעות ללא ויזה לכל אזרחי אפריקה כדי לתמוך בתיירות ובסחר פנים-אפריקאים.",
      "הן נשיא רואנדה פול קגאמה והן נשיא קניה ויליאם רוטו הדגישו את חשיבות הסחר בין מדינות אפריקה ואת הפוטנציאל לחיזוק אחדות היבשת.",
      "האיחוד האפריקני השיק את הדרכון האפריקאי בשנת 2016 והקים אזור סחר חופשי ברחבי היבשת המוערך בשווי של 3.4 טריליון דולר."
    ],
    "points": 248,
    "commentCount": 112,
    "retryCount": 0,
    "time": 1699013703
  },
  {
    "id": 38127313,
    "title": "ההשבתה בת 24 השעות של Cloudflare מדגישה את החשיבות של ניהול צריכת החשמל במרכזי נתונים ואת הסיכונים של הסתמכות על חברות בודדות",
    "originLink": "https://news.ycombinator.com/item?id=38112515",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38127313",
    "commentBody": "",
    "originSummary": [
      "Cloudflare, חברה המספקת שירותים מקוונים שונים, חוותה השבתה של API עקב אובדן כוח במרכזי הנתונים שלה.",
      "המשתמשים הדגישו את המשמעות של אל-פסק (UPS) וחצרות גנרטורים, ואת הצורך בתוכניות מגירה מקיפות ואזורי זמינות כדי למזער את הנזק מתקריות כאלה.",
      "בעוד שציינו את ההסתמכות על חברות גדולות בודדות כמו אמזון, גוגל, מיקרוסופט וקלאודפלייר עבור שירותי ליבה, משתמשים העלו גם חששות לגבי סיכוני אבטחה אפשריים והשבתות. עם זאת, Cloudflare זכתה לשבחים על שירותי ההגנה והשקיפות שלה."
    ],
    "commentSummary": [
      "Cloudflare חוותה השבתת API עקב אובדן חשמל אפשרי במרכזי נתונים, שהשפיע על שירותים שונים.",
      "התקרית עוררה דיונים על חשיבותן של תוכניות מגירה מקיפות לאספקת חשמל, אל-פסק (UPS) ואזורי זמינות במרכזי נתונים, שנגרמו על-ידי התרחשויות דומות בעבר.",
      "הוויכוח נסב גם סביב הסתמכות על חברות בודדות כמו אמזון, גוגל, מיקרוסופט וקלאודפלייר עבור שירותים חיוניים, לצד חששות לגבי סיכוני אבטחה ושיבושים אפשריים, למרות יכולות ההגנה והשקיפות המוכרות שלהן."
    ],
    "points": 232,
    "commentCount": 66,
    "retryCount": 0,
    "time": 1699012045
  },
  {
    "id": 38126997,
    "title": "מדענים וארגונים לא ממשלתיים מפרסמים הצהרה משותפת על רפורמת eIDAS של האיחוד האירופי באמצעות פלטפורמה מאובטחת",
    "originLink": "https://eidas-open-letter.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38126997",
    "commentBody": "",
    "originSummary": [
      "המסמך בשם \"eIDAS letter.pdf\", עם גודל קובץ של 198KB, זמין להורדה.",
      "ניתן למצוא קובץ זה ב- Nextcloud, פלטפורמה הידועה בתכונות האבטחה וביכולות ניהול הנתונים שלה."
    ],
    "commentSummary": [
      "המסמך \"eIDAS letter.pdf\", שהוא 198KB, זמין להורדה.",
      "המסמך מתארח ב-Nextcloud, פלטפורמה הידועה בטיפול המאובטח שלה בנתונים."
    ],
    "points": 215,
    "commentCount": 58,
    "retryCount": 0,
    "time": 1699009722
  },
  {
    "id": 38127906,
    "title": "תצפית חסרת תקדים על היצמדות של נגיף לווייני לבקטריופאג' עוזר: נתיב חדש להישרדות",
    "originLink": "https://umbc.edu/stories/first-observed-virus-attaching-to-another/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38127906",
    "commentBody": "",
    "originSummary": [
      "מדענים מאוניברסיטת מרילנד, מחוז בולטימור (UMBC) ערכו את התצפית הראשונה של וירוס לוויין שנצמד כל הזמן לבקטריופאג' עוזר – וירוס שמדביק תאי חיידקים.",
      "בבדיקות שנערכו על 50 לווייני עזר נמצא כי ל-80% מהם היה לוויין קשור בצוואר.",
      "צוות UMBC גילה לוויין ייחודי נטול כל גן אינטגרציה, מה שמרמז על כך שהוא מבטיח הישרדות בתוך המארח על ידי היצמדות לעוזר, במקום להשתלב בדנ\"א של התא המארח."
    ],
    "commentSummary": [
      "מדענים מאוניברסיטת מרילנד, מחוז בולטימור (UMBC) גילו וירוס לוויין שנצמד באופן עקבי לבקטריופאג', שהוא וירוס שמדביק חיידקים.",
      "בניסויים שנעשו על 50 לווייני עזר, ל-80% מהם היה לוויין קשור בצוואר, תצפית ראשונה.",
      "החוקרים גילו לוויין ללא גן לאינטגרציה, מה שמאותת שהוא נצמד לעוזר הישרדות בתוך הפונדקאי במקום להשתלב בדנ\"א של התא המארח."
    ],
    "points": 209,
    "commentCount": 55,
    "retryCount": 0,
    "time": 1699015662
  },
  {
    "id": 38136314,
    "title": "חבר מושבעים בקליפורניה הורה לבאייר לשלם 332 מיליון דולר בתביעת סרטן ראונדאפ",
    "originLink": "https://fortune.com/2023/11/03/bayer-332-million-judgement-trial-man-cancer-decades-monsanto-roundup-weedkiller/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38136314",
    "commentBody": "",
    "originSummary": [
      "חבר מושבעים בקליפורניה פסק למייק דניס 332 מיליון דולר בתביעה נגד מונסנטו, כיום חטיבה של באייר, בטענה שהצורה הנדירה שלו של לימפומה שאינה הודג'קין נבעה משימוש בקוטל העשבים ראונדאפ של מונסנטו.",
      "החומר הפעיל בראונדאפ, גלייפוסט, נמצא בלב התביעה. חלק (7 מיליון דולר) מסך הפיצויים שנפסקו על ידי דניס מכסה פיצויים, ואילו החלק הארי (325 מיליון דולר) מיועד לפיצויים עונשיים.",
      "באייר, שמתמודדת עם אלפי תביעות דומות הקשורות לראונדאפ, מתכננת לערער על פסק הדין. זאת בהמשך להתחייבות של באייר לשנת 2020 של עד 10.9 מיליארד דולר שהופרשו ליישוב כ-125,000 תביעות."
    ],
    "commentSummary": [
      "חבר מושבעים בקליפורניה העניק למייק דניס 332 מיליון דולר בתביעה נגד מונסנטו, כיום חלק מבאייר, בטענה שלימפומה נדירה שאינה הודג'קין נבעה מעשרות שנים של שימוש בקוטל העשבים ראונדאפ של מונסנטו, בעיקר המרכיב שלו, גלייפוסט.",
      "הסכום שנפסק מורכב מ-7 מיליון דולר פיצויים ו-325 מיליון דולר פיצויים עונשיים. עם זאת, באייר מתכננת לערער על פסק דין זה.",
      "תביעה זו היא אחת מאלפי תביעות שבאייר התמודדה איתן הקשורות לראונדאפ. בשנת 2020 הקצתה באייר עד 10.9 מיליארד דולר ליישוב כ-125,000 תביעות."
    ],
    "points": 203,
    "commentCount": 171,
    "retryCount": 0,
    "time": 1699053413
  },
  {
    "id": 38133963,
    "title": "Podman Desktop Rollouts גרסה 1.5: כולל קלות התקנה, תמיכה משופרת ב-Kubernetes וחוויית משתמש משופרת",
    "originLink": "https://podman-desktop.io/blog/podman-desktop-release-1.5",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38133963",
    "commentBody": "",
    "originSummary": [
      "Podman Desktop גרסה 1.5 שוחררה, הכוללת שיפורים שונים ופונקציות חדשות כגון הגדרת קליטה מודרכת, לוח פקודות המופעל על ידי המקלדת, ותמיכה בקבצי סביבה.",
      "מספר שינויים בוצעו כדי לשפר את חוויית המשתמש הקשורים לשינויי מצב, אזור הגדרות ו- API של הרחבה. בנוסף, נוספה כרטיסיית \"סיכום\" מורחבת עבור תרמילי Kubernetes.",
      "הצוות מעריך את התרומות מהקהילה במהדורה זו, מעודד משתמשים לעסוק על ידי בדיקת מאגר GitHub, והעדכון זמין להורדה מהאתר שלהם."
    ],
    "commentSummary": [
      "Podman Desktop גרסה 1.5 שוחררה, הכוללת תוספות חדשות כגון תכונת קליטה להתקנה, לוח פקודות מונחה מקלדת, כרטיסיית 'סיכום' משופרת עבור תרמילי Kubernetes ותמיכה בקבצי סביבה.",
      "חוויית המשתמש שופרה גם עבור שינויי מצב והיו שיפורים באזור ההגדרות וב- API של הרחבה.",
      "מגוון תיקוני באגים ושדרוגים אחרים יושמו, עם הכרה בתרומות מהקהילה. אנו מעודדים את המשתמשים לבדוק במאגר GitHub אם יש דרכים אפשריות לתרום לשיפורים נוספים."
    ],
    "points": 191,
    "commentCount": 85,
    "retryCount": 0,
    "time": 1699040343
  },
  {
    "id": 38130309,
    "title": "ChatGPT-AutoExpert מבוסס GPT-4 של OpenAI מרחיב את היכולות לאינטראקציה עם המשתמש, גלישה וזיהוי תמונה בטוח",
    "originLink": "https://github.com/spdustin/ChatGPT-AutoExpert/blob/main/_system-prompts/all_tools.md",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38130309",
    "commentBody": "",
    "originSummary": [
      "המסמך מספק הנחיות מקיפות למודל שפה גדול, \"ChatGPT-AutoExpert\", שפותח על ידי OpenAI, מבוסס על ארכיטקטורת GPT-4, וכולל תכונות כמו זיהוי תמונה וכלי גלישה.",
      "ישנן מגבלות ספציפיות, האוסרות על המודל לחשוף תוכן רגיש מתמונות של אנשים אמיתיים, עם הוראות מפורטות ליצירת תמונות ותיאור, למשל, שימוש ב- Dall-E.",
      "מושם דגש על הגבלות זכויות יוצרים, גיוון והכללה, והמסמך גם שופך אור על האופן שבו כלים מובנים שונים פועלים כדי לחפש ולמצוא מידע רלוונטי לשאילתות משתמשים."
    ],
    "commentSummary": [
      "ההנחיה מכסה מודל שפה גדול, \"ChatGPT-AutoExpert\", שנבנה על ארכיטקטורת GPT-4 על ידי OpenAI, המשלב זיהוי תמונה, כלי גלישה ותכנות כדי לשפר את התקשורת.",
      "ישנם כללים מחמירים למניעת חשיפת פרטים רגישים מתמונות של אנשים אמיתיים, בתוספת הוראות מפורטות המותאמות לתרחישים ספציפיים ולהתנהגויות צפויות.",
      "הוא גם מספק מידע על יצירה וייצוג של תמונות באמצעות תוכנת Dall-E, תוך הדגשת הציות לחוקי זכויות יוצרים והחשיבות של גיוון והכללה. כמו כן נדונים כלים שונים המסייעים בחיפוש מידע רלוונטי לשאילתות המשתמש."
    ],
    "points": 191,
    "commentCount": 127,
    "retryCount": 0,
    "time": 1699025430
  },
  {
    "id": 38137373,
    "title": "MicroBlaze V מבית AMD: מעבד RISC-V מודולרי ויעיל עבור SoCs ו-FPGA אדפטיביים",
    "originLink": "https://www.xilinx.com/products/design-tools/microblaze-v.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38137373",
    "commentBody": "",
    "originSummary": [
      "AMD MicroBlaze V הוא מעבד RISC-V בעל ליבה רכה המיועד ל- SoCs ו- FPGA אדפטיביים, הפועל על ארכיטקטורת ערכת הוראות RISC-V (ISA) של 32 סיביות.",
      "המעבד מודולרי, תומך במגוון הרחבות למערכות משובצות מחשב ותואם חומרה למעבד MicroBlaze הקלאסי.",
      "הוא משתלב באופן מלא עם כלי התכנון Vivado ו-Vitis, ומאפשר למפתחים למנף את סביבת התוכנה RISC-V בקוד פתוח ולהתמקד בהתקני SoC או FPGA אדפטיביים של AMD הנתמכים על ידי Vivado Design Suite."
    ],
    "commentSummary": [
      "מעבד AMD MicroBlaze™ V, המבוסס על ארכיטקטורת ערכת הוראות RISC-V של 32 סיביות (ISA), הוא IP מעבד בעל ליבה רכה המיועד למערכות על שבבים אדפטיביות של AMD (SoCs) ומערכי שער הניתנים לתכנות שדה (FPGA).",
      "MicroBlaze V מציע תאימות חומרה עם מעבד MicroBlaze הקלאסי ומשתלב עם כלי העיצוב Vivado™ ו-Vitis™ של AMD, ובכך מקל על הפיתוח.",
      "מעבד זה מאפשר למפתחים לגשת למערכת האקולוגית של תוכנת הקוד הפתוח RISC-V ולהתמקד בכל SoC או FPGA אדפטיבי של AMD הנתמך על ידי Vivado Design Suite."
    ],
    "points": 188,
    "commentCount": 31,
    "retryCount": 0,
    "time": 1699063305
  },
  {
    "id": 38130870,
    "title": "Okta מתמודדת עם פרצת אבטחה נוספת עם 5,000 נתוני עובדים שנגנבו מספק צד שלישי",
    "originLink": "https://arstechnica.com/security/2023/11/okta-hit-by-another-breach-this-one-stealing-employee-data-from-3rd-party-vendor/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38130870",
    "commentBody": "",
    "originSummary": [
      "Okta, חברה המתמחה בניהול זהויות ואימותים, חוותה פרצת אבטחה נוספת, כאשר פורצים השיגו נתונים אישיים של כ-5,000 עובדים מספק צד שלישי, Rightway Healthcare.",
      "הפריצה, שהתרחשה בסוף ספטמבר והתגלתה באוקטובר, כללה גניבת שמות, מספרי ביטוח לאומי ופרטי תוכניות ביטוח בריאות.",
      "למרות חומרת הפריצה, Okta טוענת כי נתוני הלקוחות שלה לא הושפעו, ומדגישה כי הפריצה באה בעקבות פריצה קודמת שבה הייתה מעורבת מערכת תמיכת הלקוחות שלה."
    ],
    "commentSummary": [
      "Okta, ספקית ניהול זהויות ואימותים, חוותה פרצת אבטחה נוספת, שהובילה לגניבת נתונים אישיים של 5,000 מעובדיה מספק צד שלישי, Rightway Healthcare.",
      "הפריצה התרחשה בסוף ספטמבר, אך התגלתה רק באוקטובר. הנתונים שנחשפו הכילו שמות, מספרי ביטוח לאומי ומספרי תוכניות ביטוח בריאות.",
      "למרות דליפת הנתונים, נתוני הלקוחות של Okta עדיין לא מושפעים. תקרית זו באה בעקבות פריצה קודמת שבה מערכת תמיכת הלקוחות של Okta נפרצה."
    ],
    "points": 188,
    "commentCount": 85,
    "retryCount": 0,
    "time": 1699028113
  },
  {
    "id": 38133279,
    "title": "בית המשפט לערעורים סירב פה אחד להעניק חסינות לשופט לשעבר בגין חיפוש בלתי חוקי בבית",
    "originLink": "https://ij.org/press-release/victory-appeals-court-unanimously-denies-judicial-immunity-to-west-virginia-judge-who-personally-searched-home-ordered-items-removed/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38133279",
    "commentBody": "",
    "originSummary": [
      "בית המשפט הרביעי לערעורים בארה\"ב פסק לטובת מתיו גיבסון נגד שופטת בית המשפט לענייני משפחה לשעבר לואיז גולדסטון, וקבע כי היא חרגה מסמכויות שיפוטיות בכך שביצעה חיפוש ללא צו בביתו של גיבסון במהלך גירושים.",
      "גולדסטון התמודדה בעבר עם צנזורה, קנסות וגינויים על ידי בית המשפט העליון של מערב וירג'יניה, מה שהביא לפרישתה במהלך הליכי ההדחה.",
      "למרות פרישתו של גולדסטון, גיבסון והמכון לצדק (משרד עורכי דין לאומי ללא מטרות רווח המגן על זכויות חוקתיות) המשיכו בתביעתם למנוע הפרות דומות ולהגביל את התפשטותה של דוקטרינת החסינות השיפוטית."
    ],
    "commentSummary": [
      "בית המשפט הרביעי לערעורים בארה\"ב פסק פה אחד נגד שופטת בית המשפט לענייני משפחה לשעבר לואיז גולדסטון, והסכים שהיא ערכה חיפוש ללא צו בביתו של מתיו גיבסון במהלך הליך גירושין, תוך חריגה מסמכויותיה השיפוטיות.",
      "גולדסטון, שצונזר בעבר, נקנס וגונה על ידי בית המשפט העליון של מערב וירג'יניה, פרש על רקע מאמצי ההדחה, אך גיבסון והמכון לצדק (IJ), משרד עורכי דין לאומי ללא מטרות רווח המגן על זכויות חוקתיות, המשיכו בתביעתם כדי להרתיע מפני הפרות דומות.",
      "לגיבסון ולמאבק של ה-IJ בתביעה נגד גולדסטון, למרות פרישתה, יש השלכות פוטנציאליות על דוקטרינת החסינות השיפוטית, המבקשת למנוע התערבות יתר של שופטים."
    ],
    "points": 181,
    "commentCount": 164,
    "retryCount": 0,
    "time": 1699037677
  },
  {
    "id": 38127203,
    "title": "עובדים, במיוחד דמוגרפיה צעירה יותר, פתוחים להקרבות עבור שבוע עבודה של ארבעה ימים, כך עולה מהסקר",
    "originLink": "https://www.cnbc.com/2023/11/01/what-young-people-would-give-up-for-a-4-day-workweek.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38127203",
    "commentBody": "",
    "originSummary": [
      "סקר חדש של Bankrate מצביע על כך ש-92% מהעובדים הצעירים ו-86% מהעובדים המבוגרים פתוחים לפשרות מסוימות לטובת שבוע עבודה בן ארבעה ימים.",
      "הקורבנות שעובדים אלה מוכנים להקריב יכולים לנוע בין מעבר לעבודה פנים אל פנים והשקעת שעות ארוכות יותר לעבודה בסופי שבוע או בערבים ואפילו קבלת שכר נמוך יותר.",
      "כאשר רק 15% מהמעסיקים בארה\"ב מציעים כיום שבוע עבודה בן ארבעה ימים להטבות בתחום בריאות הנפש נכון לשנת 2023, זהו תחום צמיחה פוטנציאלי והזדמנות לשינוי בפרקטיקות ארגוניות."
    ],
    "commentSummary": [
      "הסקר החדש של Bankrate מגלה כי 92% מהעובדים הצעירים ו-86% מהעובדים המבוגרים יעדיפו שבוע עבודה בן ארבעה ימים, גם אם הוא מחייב הקרבה כמו שעות ארוכות יותר, עבודה בסופי שבוע וקיצוצים בשכר.",
      "הסקר מראה גם נטייה בקרב עובדים להחליף עבודה או לחזור לעבודה פנים אל פנים כדי לעמוד בלוח זמנים של ארבעה ימים.",
      "למרות ההתעניינות, רק 15% מהמעסיקים בארה\"ב מציעים אפשרות של ארבעה ימים בשבוע להטבות בתחום בריאות הנפש, מה שמרמז על הזדמנות שלא מומשה עבור ארגונים למשוך ולשמר כישרונות."
    ],
    "points": 174,
    "commentCount": 203,
    "retryCount": 0,
    "time": 1699011227
  }
]
