[
  {
    "id": 38132016,
    "title": "Pensioneret udvikler frigiver fire årtiers kildekode, inklusiv sjældne operativsystemer",
    "originLink": "https://dunfield.themindfactory.com/dnldsrc.htm",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38132016",
    "commentBody": "",
    "originSummary": [
      "Dave, en pensioneret softwareudvikler, offentliggør sin 40 år lange kildekode til forskellige operativsystemer, hjælpeprogrammer, værktøjer og programmer med den hensigt, at det skal være til gavn eller uddannelse for andre.",
      "Hans bemærkelsesværdige bidrag omfatter \"ARMOS\", en multiproces/task-kerne til ARM, \"CUBIX\", et operativsystem designet til 6809-CPU'en, og \"DMS\", hans første operativsystem udviklet i 1980.",
      "Denne udgivelse giver en unik mulighed for kommende eller interesserede tech-personer til at lære af en erfaren programmørs arbejde og kodearv."
    ],
    "commentSummary": [
      "Dave, en erfaren softwareudvikler, frigiver sine 40 års kildekoder til forskellige operativsystemer, hjælpeprogrammer, værktøjer og programmer til gavn for andre udviklere.",
      "Bemærkelsesværdige programmer, han har bidraget til, omfatter \"ARMOS\", en kerne, der muliggør flere processer/opgaver til ARM-processorer, \"CUBIX\", et operativsystem til 6809-CPU'en, og \"DMS\", hans tidligste operativsystem udviklet i 1980.",
      "Dette unikke tiltag tilskynder til læring og vidensdeling i softwareudviklingsmiljøet og giver uvurderlige ressourcer til både erfarne og uerfarne udviklere."
    ],
    "points": 797,
    "commentCount": 202,
    "retryCount": 0,
    "time": 1699032376
  },
  {
    "id": 38130418,
    "title": "YouTube-personlighed skaber lokkedueplatform for at fange Bitcoin-svindlere: Samarbejde med kryptovaluta-børsen Kraken dukker op",
    "originLink": "https://www.youtube.com/watch?v=dWzz3NeDz3E",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38130418",
    "commentBody": "",
    "originSummary": [
      "YouTube-personligheden Kid Kid Buger og hans team udviklede en bedragerisk platform til at fange Bitcoin-svindlere med funktioner som et falsk Bitcoin-gavekort og en falsk kundeservice, der sætter opkaldere i venteposition på ubestemt tid.",
      "Denne enhed, der oprindeligt blev startet som en spøg, har nu udviklet sig til et seriøst foretagende, der hjælper ofre for svindel og letter efterforskningen af svigagtige aktiviteter.",
      "Dette initiativ, der forstyrrer udnyttelsen af Bitcoin-pengeautomater, deles som en succeshistorie af skaberen og understreger potentialet i mindre ideer, der kan føre til betydelige konsekvenser."
    ],
    "commentSummary": [
      "YouTube-personligheden Kid Kid Buger's team har udviklet en lokkeplatform, der er designet til at fange Bitcoin-svindlere ved at tilbyde fiktive Bitcoin-gavekort eller -kvitteringer.",
      "Platformen, der oprindeligt blev skabt som en joke, tjener nu et seriøst formål, idet den forhindrer svindlere med udfordringer og en uendelig ventetid på kundeservice og forstyrrer driften af dem, der udnytter Bitcoin-pengeautomater.",
      "Dette utraditionelle værktøj hjælper ofre for svindel og samarbejder med kryptovaluta-platformen Kraken om at efterforske svindel, hvilket understreger vigtigheden af små ideer med potentiale til at skabe betydelige resultater."
    ],
    "points": 638,
    "commentCount": 286,
    "retryCount": 0,
    "time": 1699025931
  },
  {
    "id": 38128699,
    "title": "Softwareudvikler sætter pris på fejlfindingsværktøjer trods ugelang problemløsningsproces",
    "originLink": "https://shmck.substack.com/p/no-dogs-were-harmed-in-the-making",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38128699",
    "commentBody": "",
    "originSummary": [
      "Shawn, en softwareudvikler, deler sin erfaring i et indlæg på Substack om en udfordrende ugelang fejlfindingsproces, der fik ham til at sætte spørgsmålstegn ved sit karrierevalg.",
      "Efter at have fået indsigt fra venner inden for områder som ingeniørvidenskab, veterinærmedicin og forskningsvidenskab, erkender Shawn, at selvom alle erhverv står over for unikke udfordringer, har softwareudviklere det privilegium at bruge effektive debugging-værktøjer.",
      "Han udtrykker taknemmelighed for disse debugging-værktøjer, på trods af at en mindre kodefejl førte til en ugelang debugging-proces."
    ],
    "commentSummary": [
      "Shawn, en softwareudvikler, skriver dagbog om sin ugelange debug-oplevelse på Substack, en online platform, hvor individuelle udgivere kan dele indhold.",
      "Den anstrengende fejlfindingsproces fik ham til at sætte spørgsmålstegn ved sit karrierevalg, men han fik perspektiv gennem diskussioner med venner inden for erhverv som ingeniørvidenskab, veterinærmedicin og forskningsvidenskab.",
      "Han indser værdien af de effektive debugging-værktøjer, som softwareudviklere har til rådighed, på trods af de problemer, som en simpel kodefejl kan forårsage."
    ],
    "points": 430,
    "commentCount": 186,
    "retryCount": 0,
    "time": 1699019273
  },
  {
    "id": 38136607,
    "title": "Rock Band Portugal. The Mans officielle hjemmeside konverteret til Google Sheets-dokument",
    "originLink": "https://www.portugaltheman.com/?frontpage=true",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38136607",
    "commentBody": "",
    "originSummary": [
      "Denne side er en tilmeldingsplatform til at få de seneste opdateringer om Portugal. The Man, et musikalsk band.",
      "Det giver flere muligheder som kontakt, feedback, brugsbetingelser, privatlivspolitik, annoncevalg og cookiepolitik.",
      "Brugerne kan vælge at forhindre salg eller deling af deres personlige data, hvilket sikrer øget databeskyttelse."
    ],
    "commentSummary": [
      "Dette er en registreringsside, hvor du kan få de seneste opdateringer om Portugal. The Man, der tilbyder flere valgmuligheder.",
      "Funktionerne omfatter kontaktoplysninger, feedback-muligheder, brugsbetingelser, privatlivspolitik, annoncevalg og en cookie-politik.",
      "Brugerne får også mulighed for at forhindre salg eller deling af deres personlige oplysninger."
    ],
    "points": 310,
    "commentCount": 89,
    "retryCount": 0,
    "time": 1699055994
  },
  {
    "id": 38127560,
    "title": "Rwanda og Kenya indfører visumfrihed for afrikanske statsborgere for at styrke handel og turisme",
    "originLink": "https://africa.businessinsider.com/local/leaders/from-barriers-to-unity-rwanda-joins-kenya-to-initiate-visa-free-travel-for-all/hhqe29q",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38127560",
    "commentBody": "",
    "originSummary": [
      "Rwanda og Kenya indfører visumfrihed for alle afrikanske statsborgere med det formål at sætte skub i turisme og handel inden for Afrika.",
      "Meddelelserne blev givet af Rwandas præsident Paul Kagame på det 23. globale topmøde i World Travel and Tourism Council, og af Kenyas præsident William Ruto, som sagde, at ændringen ville blive gennemført inden årets udgang.",
      "Disse ændringer stemmer overens med Den Afrikanske Unions initiativer for enhed og frihandel, herunder lanceringen af et afrikansk pas i 2016 og etableringen af et kontinentalt frihandelsområde til en værdi af omkring 3,4 billioner dollars."
    ],
    "commentSummary": [
      "Rwanda og Kenya er ved at indføre visumfrihed for alle afrikanske statsborgere for at støtte turisme og handel inden for Afrika.",
      "Både Rwandas præsident Paul Kagame og Kenyas præsident William Ruto understregede betydningen af handel mellem afrikanske nationer og potentialet for et styrket kontinentalt sammenhold.",
      "Den Afrikanske Union lancerede det afrikanske pas i 2016 og har etableret et frihandelsområde på hele kontinentet, som anslås at være 3,4 billioner dollars værd."
    ],
    "points": 248,
    "commentCount": 112,
    "retryCount": 0,
    "time": 1699013703
  },
  {
    "id": 38127313,
    "title": "Cloudflares 24-timers nedbrud understreger vigtigheden af strømstyring i datacentre og risikoen ved at forlade sig på enkelte virksomheder",
    "originLink": "https://news.ycombinator.com/item?id=38112515",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38127313",
    "commentBody": "",
    "originSummary": [
      "Cloudflare, en virksomhed, der leverer forskellige onlinetjenester, oplevede en API-nedetid, der muligvis skyldtes et strømsvigt i deres datacentre.",
      "Brugerne fremhævede betydningen af UPS (Uninterruptable Power Supply) og generatoranlæg, og behovet for omfattende beredskabsplaner og tilgængelighedszoner for at minimere skaderne fra sådanne hændelser.",
      "Mens de bemærkede afhængigheden af enkelte store virksomheder som Amazon, Google, Microsoft og Cloudflare til kernetjenester, udtrykte brugerne også bekymring over mulige sikkerhedsrisici og udfald. Cloudflare blev dog rost for sine beskyttelsestjenester og gennemsigtighed."
    ],
    "commentSummary": [
      "Cloudflare oplevede en API-nedetid på grund af mulig strømafbrydelse i datacentre, hvilket påvirkede forskellige tjenester.",
      "Hændelsen har sat gang i diskussioner om vigtigheden af omfattende strømberedskabsplaner, UPS (Uninterruptable Power Supply) og tilgængelighedszoner i datacentre, udløst af tidligere lignende hændelser.",
      "Der var også debat om afhængigheden af enkeltfirmaer som Amazon, Google, Microsoft og Cloudflare til vigtige tjenester, sammen med bekymringer om mulige sikkerhedsrisici og afbrydelser, på trods af deres anerkendte beskyttelsesfunktioner og gennemsigtighed."
    ],
    "points": 232,
    "commentCount": 66,
    "retryCount": 0,
    "time": 1699012045
  },
  {
    "id": 38126997,
    "title": "Forskere og NGO'er udsender fælles erklæring om EU's eIDAS-reform via sikker platform",
    "originLink": "https://eidas-open-letter.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38126997",
    "commentBody": "",
    "originSummary": [
      "Dokumentet med navnet \"eIDAS letter.pdf\", med en filstørrelse på 198KB, er tilgængeligt til download.",
      "Denne fil kan findes på Nextcloud, en platform, der er kendt for sine sikkerhedsfunktioner og datastyringsfunktioner."
    ],
    "commentSummary": [
      "Dokumentet \"eIDAS letter.pdf\", som fylder 198 KB, kan downloades.",
      "Dokumentet er hostet på Nextcloud, en platform, der er kendt for sin sikre datahåndtering."
    ],
    "points": 215,
    "commentCount": 58,
    "retryCount": 0,
    "time": 1699009722
  },
  {
    "id": 38127906,
    "title": "Enestående observation af satellitvirus, der klamrer sig til hjælperbakteriofag: En ny vej til overlevelse",
    "originLink": "https://umbc.edu/stories/first-observed-virus-attaching-to-another/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38127906",
    "commentBody": "",
    "originSummary": [
      "Forskere ved University of Maryland, Baltimore County (UMBC) har for første gang observeret en satellitvirus, der konstant binder sig til en hjælpe-bakteriofag - en virus, der inficerer bakterieceller.",
      "I tests udført på 50 hjælpesatellitter viste det sig, at 80% havde en satellit bundet i nakken.",
      "UMBC-holdet opdagede en unik satellit uden noget integrationsgen, hvilket tyder på, at den sikrer overlevelse inde i værten ved at binde sig til en hjælper i stedet for at integrere sig i værtscellens DNA."
    ],
    "commentSummary": [
      "Forskere ved University of Maryland, Baltimore County (UMBC) har opdaget en satellitvirus, der konsekvent binder sig til en bakteriofag, som er en virus, der inficerer bakterier.",
      "I tests udført på 50 hjælpesatellitter havde 80% en satellit, der var bundet i nakken, en førstegangsobservation.",
      "Forskerne opdagede en satellit uden et gen for integration, hvilket signalerer, at den binder sig til en hjælper for at overleve inde i værten i stedet for at integrere sig i værtscellens DNA."
    ],
    "points": 209,
    "commentCount": 55,
    "retryCount": 0,
    "time": 1699015662
  },
  {
    "id": 38136314,
    "title": "Californisk jury beordrer Bayer til at betale 332 mio. dollars i Roundup-kræftretssag",
    "originLink": "https://fortune.com/2023/11/03/bayer-332-million-judgement-trial-man-cancer-decades-monsanto-roundup-weedkiller/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38136314",
    "commentBody": "",
    "originSummary": [
      "En jury i Californien har tildelt Mike Dennis 332 millioner dollars i en retssag mod Monsanto, nu en afdeling af Bayer, med påstand om, at hans sjældne form for non-Hodgkins lymfom skyldtes brug af Monsantos Roundup-ukrudtsmiddel.",
      "Den aktive ingrediens i Roundup, glyphosat, er kernen i retssagen. En del (7 millioner dollars) af Dennis' samlede erstatning dækker kompenserende skader, mens størstedelen (325 millioner dollars) går til strafferetslig erstatning.",
      "Bayer, der håndterer tusindvis af lignende Roundup-relaterede krav, planlægger at appellere dommen. Dette følger Bayers 2020-forpligtelse på op til 10,9 milliarder dollars, der er afsat til at afvikle ca. 125.000 krav."
    ],
    "commentSummary": [
      "En jury i Californien tilkendte Mike Dennis 332 millioner dollars i en retssag mod Monsanto, nu en del af Bayer, og hævdede, at hans sjældne non-Hodgkins lymfom var resultatet af årtiers brug af Monsantos Roundup-ukrudtsmiddel, primært dets ingrediens, glyphosat.",
      "Det tilkendte beløb består af 7 millioner dollars i kompenserende erstatning og 325 millioner dollars i strafferetslig erstatning. Bayer har dog planer om at appellere dommen.",
      "Denne retssag er blandt tusindvis af krav, som Bayer har stået over for i forbindelse med Roundup. I 2020 øremærkede Bayer op til 10,9 milliarder dollars til at afvikle cirka 125.000 krav."
    ],
    "points": 203,
    "commentCount": 171,
    "retryCount": 0,
    "time": 1699053413
  },
  {
    "id": 38133963,
    "title": "Podman Desktop udruller version 1.5: Nem opsætning, forbedret Kubernetes-understøttelse og forbedret brugeroplevelse",
    "originLink": "https://podman-desktop.io/blog/podman-desktop-release-1.5",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38133963",
    "commentBody": "",
    "originSummary": [
      "Podman Desktop version 1.5 er blevet frigivet med forskellige forbedringer og nye funktioner, såsom en guidet onboarding-opsætning, en kommandopalet, der betjenes med tastaturet, og understøttelse af miljøfiler.",
      "Der er foretaget flere ændringer for at forbedre brugeroplevelsen i forbindelse med tilstandsændringer, indstillingsområde og udvidelses-API. Derudover er der tilføjet en udvidet \"Summary\"-fane til Kubernetes-pods.",
      "Teamet sætter pris på bidragene fra fællesskabet i denne udgivelse og opfordrer brugerne til at engagere sig ved at tjekke GitHub-repositoriet, og opdateringen kan downloades fra deres hjemmeside."
    ],
    "commentSummary": [
      "Podman Desktop version 1.5 er blevet frigivet med nye tilføjelser som en onboarding-funktion til opsætning, en tastaturdrevet kommandopalet, forbedret 'Summary'-fane til Kubernetes-pods og understøttelse af miljøfiler.",
      "Brugeroplevelsen er også blevet forbedret i forbindelse med tilstandsændringer, og der er sket forbedringer af indstillingsområdet og udvidelses-API'en.",
      "En række fejlrettelser og andre opgraderinger er blevet implementeret, og bidrag fra fællesskabet anerkendes. Brugere opfordres til at tjekke GitHub repository for potentielle måder at bidrage til yderligere forbedringer."
    ],
    "points": 191,
    "commentCount": 85,
    "retryCount": 0,
    "time": 1699040343
  },
  {
    "id": 38130309,
    "title": "OpenAI's GPT-4-baserede 'ChatGPT-AutoExpert' udvider mulighederne for brugerinteraktion, browsing og sikker billedgenkendelse",
    "originLink": "https://github.com/spdustin/ChatGPT-AutoExpert/blob/main/_system-prompts/all_tools.md",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38130309",
    "commentBody": "",
    "originSummary": [
      "Dokumentet giver omfattende retningslinjer for en stor sprogmodel, \"ChatGPT-AutoExpert\", udviklet af OpenAI, baseret på GPT-4-arkitekturen, og inkluderer funktioner som billedgenkendelse og browsingværktøjer.",
      "Der er specifikke begrænsninger på plads, som forhindrer modellen i at afsløre følsomt indhold fra billeder af rigtige mennesker, med detaljerede instruktioner til billedskabelse og afbildning, for eksempel brug af Dall-E.",
      "Der lægges vægt på copyright-restriktioner, mangfoldighed og inklusivitet, og dokumentet kaster også lys over, hvordan forskellige indbyggede værktøjer fungerer til at søge og finde information, der er relevant for brugerens forespørgsler."
    ],
    "commentSummary": [
      "Retningslinjen dækker en stor sprogmodel, \"ChatGPT-AutoExpert\", bygget på GPT-4-arkitektur af OpenAI, som inkorporerer billedgenkendelse, browserværktøjer og programmering for at forbedre kommunikationen.",
      "Der er strenge regler for at forhindre modellen i at afsløre følsomme detaljer fra billeder af virkelige personer, suppleret med detaljerede instruktioner, der er skræddersyet til specifikke scenarier og forventet adfærd.",
      "Det giver også information om at skabe og repræsentere billeder ved hjælp af Dall-E-software, understreger overholdelse af ophavsretslove og vigtigheden af mangfoldighed og inklusivitet. Forskellige værktøjer, der hjælper med at søge relevant information til brugerens forespørgsler, diskuteres også."
    ],
    "points": 191,
    "commentCount": 127,
    "retryCount": 0,
    "time": 1699025430
  },
  {
    "id": 38137373,
    "title": "AMD's MicroBlaze V: En modulær, effektiv RISC-V-processor til adaptive SoC'er og FPGA'er",
    "originLink": "https://www.xilinx.com/products/design-tools/microblaze-v.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38137373",
    "commentBody": "",
    "originSummary": [
      "AMD MicroBlaze V er en soft-core RISC-V-processor IP designet til adaptive SoC'er og FPGA'er, der kører på en 32-bit RISC-V instruction set architecture (ISA).",
      "Processoren er modulær, understøtter en række udvidelser til indlejrede systemer og er hardwarekompatibel med den klassiske MicroBlaze-processor.",
      "Det integreres fuldt ud med Vivado- og Vitis-designværktøjerne, så udviklere kan udnytte open source RISC-V-softwareøkosystemet og målrette AMD-adaptive SoC- eller FPGA-enheder, der understøttes af Vivado Design Suite."
    ],
    "commentSummary": [
      "AMD MicroBlaze™ V-processoren, der er baseret på en 32-bit RISC-V instruction set architecture (ISA), er en soft-core processor IP designet til AMD adaptive Systems-On-Chips (SoCs) og Field-Programmable Gate Arrays (FPGAs).",
      "MicroBlaze V tilbyder hardwarekompatibilitet med den klassiske MicroBlaze-processor og integreres med AMD's Vivado™- og Vitis™-designværktøjer, hvilket letter udviklingen.",
      "Denne processor gør det muligt for udviklere at få adgang til open source RISC-V-softwareøkosystemet og målrette mod enhver AMD adaptiv SoC eller FPGA, der understøttes af Vivado Design Suite."
    ],
    "points": 188,
    "commentCount": 31,
    "retryCount": 0,
    "time": 1699063305
  },
  {
    "id": 38130870,
    "title": "Okta står over for endnu et sikkerhedsbrud med 5.000 medarbejderes data stjålet fra tredjepartsleverandør",
    "originLink": "https://arstechnica.com/security/2023/11/okta-hit-by-another-breach-this-one-stealing-employee-data-from-3rd-party-vendor/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38130870",
    "commentBody": "",
    "originSummary": [
      "Okta, en virksomhed, der specialiserer sig i identitets- og autentifikationsstyring, oplevede endnu et sikkerhedsbrud, hvor ubudne gæster fik fat i personlige data om omkring 5.000 medarbejdere fra en tredjepartsleverandør, Rightway Healthcare.",
      "Indbruddet, som fandt sted i slutningen af september og blev opdaget i oktober, omfattede tyveri af navne, CPR-numre og oplysninger om sygesikringsordninger.",
      "På trods af angrebets alvorlighed fastholder Okta, at deres kundedata ikke blev påvirket, og understreger, at angrebet kom efter et tidligere angreb, der involverede deres kundesupportsystem."
    ],
    "commentSummary": [
      "Okta, en udbyder af identitets- og autentificeringsstyring, har oplevet endnu et sikkerhedsbrud, som har resulteret i tyveri af personoplysninger om 5.000 af deres medarbejdere fra en tredjepartsleverandør, Rightway Healthcare.",
      "Bruddet skete i slutningen af september, men det blev først opdaget i oktober. De kompromitterede data indeholdt navne, CPR-numre og sygesikringsnumre.",
      "På trods af databruddet er Oktas kundedata ikke blevet påvirket. Denne hændelse følger et tidligere brud, hvor Oktas kundesupportsystem blev kompromitteret."
    ],
    "points": 188,
    "commentCount": 85,
    "retryCount": 0,
    "time": 1699028113
  },
  {
    "id": 38133279,
    "title": "Enstemmig appeldomstol afviser immunitet til eksdommer for ulovlig ransagning af hjem",
    "originLink": "https://ij.org/press-release/victory-appeals-court-unanimously-denies-judicial-immunity-to-west-virginia-judge-who-personally-searched-home-ordered-items-removed/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38133279",
    "commentBody": "",
    "originSummary": [
      "4th U.S. Circuit Court of Appeals gav Matthew Gibson medhold i, at den tidligere familieretsdommer Louise Goldston havde overskredet sine beføjelser ved at foretage en ransagning uden dommerkendelse af Gibsons hjem midt i en skilsmisse.",
      "Goldston har tidligere været udsat for mistillid, bøder og fordømmelse af West Virginias højesteret, hvilket resulterede i, at hun trak sig tilbage under en rigsretssag.",
      "På trods af Goldstons pensionering fortsatte Gibson og Institute for Justice (et nationalt non-profit advokatfirma, der beskytter forfatningsmæssige rettigheder) deres retssag for at forhindre lignende overtrædelser og begrænse udbredelsen af doktrinen om retlig immunitet."
    ],
    "commentSummary": [
      "4th U.S. Circuit Court of Appeals har enstemmigt dømt den tidligere familieretsdommer Louise Goldston, og er enig i, at hun foretog en ransagning uden dommerkendelse af Matthew Gibsons hjem under en skilsmissesag og dermed overskred sine juridiske beføjelser.",
      "Goldston, som tidligere var blevet censureret, idømt bøder og fordømt af West Virginias højesteret, trak sig tilbage midt i en rigsretssag, men Gibson og Institute for Justice (IJ), et nationalt non-profit advokatfirma, der forsvarer forfatningsmæssige rettigheder, fortsatte med deres retssag for at forhindre lignende overtrædelser.",
      "Gibson og IJ's fortsættelse af retssagen mod Goldston, på trods af hendes pensionering, har potentielle konsekvenser for doktrinen om dommerimmunitet, som søger at forhindre dommere i at overtræde loven."
    ],
    "points": 181,
    "commentCount": 164,
    "retryCount": 0,
    "time": 1699037677
  },
  {
    "id": 38127203,
    "title": "Arbejdstagere, især den yngre del af befolkningen, er åbne for at ofre noget for en firedages arbejdsuge, viser undersøgelse",
    "originLink": "https://www.cnbc.com/2023/11/01/what-young-people-would-give-up-for-a-4-day-workweek.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38127203",
    "commentBody": "",
    "originSummary": [
      "En ny undersøgelse fra Bankrate viser, at 92% af de unge og 86% af de ældre arbejdstagere er åbne for at indgå visse kompromiser for at få en firedages arbejdsuge.",
      "De ofre, disse medarbejdere er klar til at bringe, kan variere fra at skifte til personligt arbejde og arbejde længere til at arbejde i weekender eller om aftenen og endda acceptere lavere løn.",
      "Med kun 15% af de amerikanske arbejdsgivere, der i øjeblikket tilbyder en firedages arbejdsuge for mental sundhed fra 2023, udgør dette et potentielt vækstområde og mulighed for ændring i organisatorisk praksis."
    ],
    "commentSummary": [
      "Bankrates nye undersøgelse viser, at 92 % af de unge og 86 % af de ældre arbejdstagere ville foretrække en firedages arbejdsuge, selv om det kræver ofre som længere arbejdstid, weekendarbejde og lønnedgang.",
      "Undersøgelsen viser også en tilbøjelighed blandt medarbejderne til at skifte job eller vende tilbage til personligt arbejde for at overholde en firedagesplan.",
      "På trods af interessen er det kun 15% af de amerikanske arbejdsgivere, der tilbyder en firedages arbejdsuge, hvilket tyder på en uopfyldt mulighed for organisationer til at tiltrække og fastholde talenter."
    ],
    "points": 174,
    "commentCount": 203,
    "retryCount": 0,
    "time": 1699011227
  }
]
