[
  {
    "id": 38132016,
    "title": "रिटायर डेवलपर दुर्लभ ऑपरेटिंग सिस्टम सहित चार दशकों का स्रोत कोड जारी करेगा",
    "originLink": "https://dunfield.themindfactory.com/dnldsrc.htm",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38132016",
    "commentBody": "",
    "originSummary": [
      "डेव, एक सेवानिवृत्त सॉफ्टवेयर डेवलपर, विभिन्न ऑपरेटिंग सिस्टम, उपयोगिताओं, उपकरणों और कार्यक्रमों के लिए अपने 40 साल लंबे स्रोत कोड को सार्वजनिक कर रहा है, इसके इरादे से कि यह दूसरों के लिए फायदेमंद या शिक्षाप्रद हो।",
      "उनके उल्लेखनीय योगदान में \"ARMOS\", एआरएम के लिए एक बहु प्रक्रिया / कार्य कर्नेल, \"क्यूबिक्स\", 6809 सीपीयू के लिए डिज़ाइन किया गया एक ऑपरेटिंग सिस्टम और \"डीएमएस\", 1980 में विकसित उनका पहला ऑपरेटिंग सिस्टम शामिल है।",
      "यह रिलीज आगामी या इच्छुक तकनीकी व्यक्तियों को एक अनुभवी प्रोग्रामर के काम और कोड विरासत से सीखने का एक अनूठा अवसर प्रदान करती है।"
    ],
    "commentSummary": [
      "डेव, एक अनुभवी सॉफ्टवेयर डेवलपर, अन्य डेवलपर्स के लाभ के लिए विभिन्न ऑपरेटिंग सिस्टम, उपयोगिताओं, उपकरणों और कार्यक्रमों के अपने 40 साल के स्रोत कोड जारी कर रहा है।",
      "उल्लेखनीय कार्यक्रमों में उन्होंने \"ARMOS\", एआरएम प्रोसेसर के लिए कई प्रक्रियाओं / कार्यों की सुविधा प्रदान करने वाला कर्नेल, \"क्यूबिक्स\", 6809 सीपीयू के लिए एक ऑपरेटिंग सिस्टम और \"डीएमएस\" शामिल करने में योगदान दिया, जो 1980 में विकसित उनका सबसे पहला ओएस था।",
      "यह अनूठी कार्रवाई सॉफ्टवेयर विकास समुदाय में सीखने और ज्ञान साझा करने को प्रोत्साहित करती है और अनुभवी और नौसिखिया डेवलपर्स दोनों के लिए अमूल्य संसाधन प्रदान करती है।"
    ],
    "points": 797,
    "commentCount": 202,
    "retryCount": 0,
    "time": 1699032376
  },
  {
    "id": 38130418,
    "title": "यूट्यूब व्यक्तित्व बिटकॉइन स्कैमर्स को फंसाने के लिए डिकॉय प्लेटफॉर्म बनाता है: क्रिप्टोक्यूरेंसी एक्सचेंज क्रैकन के साथ सहयोग उभरता है",
    "originLink": "https://www.youtube.com/watch?v=dWzz3NeDz3E",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38130418",
    "commentBody": "",
    "originSummary": [
      "यूट्यूब पर्सनैलिटी किड किड बुगर और उनकी टीम ने बिटकॉइन स्कैमर्स को फंसाने के लिए एक धोखा मंच विकसित किया, जिसमें नकली बिटकॉइन गिफ्ट कार्ड और एक नकली ग्राहक सेवा जैसी विशेषताएं थीं, जो कॉल करने वालों को अनिश्चित काल के लिए रोक देती थीं।",
      "मूल रूप से एक मजाक के रूप में शुरू किया गया, यह इकाई अब एक गंभीर उद्यम में बदल गई है, जो धोखाधड़ी के पीड़ितों की सहायता करती है और धोखाधड़ी गतिविधियों की जांच की सुविधा प्रदान करती है।",
      "बिटकॉइन एटीएम के शोषण को बाधित करने वाली इस पहल को निर्माता द्वारा सफलता की कहानी के रूप में साझा किया जाता है, जो मामूली विचारों की क्षमता को पर्याप्त परिणामों तक ले जाने की क्षमता को रेखांकित करता है।"
    ],
    "commentSummary": [
      "यूट्यूब व्यक्तित्व किड किड बुगर की टीम ने बिटकॉइन स्कैमर्स को फंसाने के लिए डिज़ाइन किया गया एक डिकॉय प्लेटफॉर्म विकसित किया, जो काल्पनिक बिटकॉइन उपहार कार्ड या रसीदों की पेशकश करता है।",
      "प्लेटफॉर्म, जिसे शुरू में एक मजाक के रूप में बनाया गया था, अब एक गंभीर उद्देश्य प्रदान करता है, चुनौतियों और कभी न खत्म होने वाली ग्राहक सेवा पकड़ के साथ स्कैमर्स को बाधित करता है, बिटकॉइन एटीएम का शोषण करने वालों के संचालन को बाधित करता है।",
      "यह अपरंपरागत उपकरण घोटाले के पीड़ितों की सहायता कर रहा है और धोखाधड़ी की जांच करने के लिए क्रिप्टोक्यूरेंसी प्लेटफॉर्म, क्रैकन के साथ सहयोग कर रहा है, महत्वपूर्ण परिणामों का उत्पादन करने की क्षमता के साथ छोटे विचारों के महत्व को मजबूत करता है।"
    ],
    "points": 638,
    "commentCount": 286,
    "retryCount": 0,
    "time": 1699025931
  },
  {
    "id": 38128699,
    "title": "सॉफ्टवेयर डेवलपर ने सप्ताह भर की समस्या समाधान प्रक्रिया के बावजूद डीबगिंग टूल की सराहना की",
    "originLink": "https://shmck.substack.com/p/no-dogs-were-harmed-in-the-making",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38128699",
    "commentBody": "",
    "originSummary": [
      "एक सॉफ्टवेयर डेवलपर शॉन ने सबस्टैक पर एक पोस्ट में एक चुनौतीपूर्ण सप्ताह भर की डिबगिंग प्रक्रिया के बारे में अपना अनुभव साझा किया, जिसने उन्हें अपने करियर की पसंद पर सवाल उठाया।",
      "इंजीनियरिंग, पशु चिकित्सा और अनुसंधान विज्ञान जैसे क्षेत्रों में दोस्तों से अंतर्दृष्टि प्राप्त करने के बाद, शॉन स्वीकार करता है कि जबकि सभी व्यवसायों को अद्वितीय चुनौतियों का सामना करना पड़ता है, सॉफ्टवेयर डेवलपर्स को कुशल डिबगिंग टूल का उपयोग करने का विशेषाधिकार है।",
      "वह एक सप्ताह की डिबगिंग प्रक्रिया के कारण मामूली कोडिंग त्रुटि के बावजूद, इन डिबगिंग टूल के लिए आभार व्यक्त करता है।"
    ],
    "commentSummary": [
      "शॉन, एक सॉफ्टवेयर डेवलपर, सबस्टैक पर अपने सप्ताह भर के डिबगिंग अनुभव को जर्नलाइज्ड करता है, जो व्यक्तिगत प्रकाशकों के लिए सामग्री साझा करने के लिए एक ऑनलाइन मंच है।",
      "ज़ोरदार डिबगिंग प्रक्रिया ने उन्हें अपने करियर की पसंद पर सवाल उठाने के लिए प्रेरित किया, लेकिन इंजीनियरिंग, पशु चिकित्सा और अनुसंधान विज्ञान जैसे व्यवसायों में दोस्तों के साथ चर्चा के माध्यम से परिप्रेक्ष्य प्राप्त किया।",
      "एक एहसास में आते हुए, वह एक साधारण कोडिंग त्रुटि के कारण होने वाले मुद्दों के बावजूद सॉफ्टवेयर डेवलपर्स के लिए उपलब्ध कुशल डिबगिंग टूल के मूल्य की सराहना करता है।"
    ],
    "points": 430,
    "commentCount": 186,
    "retryCount": 0,
    "time": 1699019273
  },
  {
    "id": 38136607,
    "title": "रॉक बैंड पुर्तगाल। व्यक्ति की आधिकारिक वेबसाइट को गूगल शीट ्स दस्तावेज में बदल दिया गया",
    "originLink": "https://www.portugaltheman.com/?frontpage=true",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38136607",
    "commentBody": "",
    "originSummary": [
      "यह पृष्ठ पुर्तगाल के बारे में नवीनतम अपडेट प्राप्त करने के लिए एक साइन-अप प्लेटफ़ॉर्म है। द मैन, एक संगीत बैंड।",
      "यह संपर्क, प्रतिक्रिया, उपयोग की शर्तें, गोपनीयता नीति, विज्ञापन विकल्प और कुकीज़ नीति जैसे कई विकल्प प्रदान करता है।",
      "उपयोगकर्ताओं को अपने व्यक्तिगत डेटा की बिक्री या साझाकरण को रोकने का विकल्प दिया जाता है, जिससे बढ़ी हुई डेटा गोपनीयता सुनिश्चित होती है।"
    ],
    "commentSummary": [
      "यह पुर्तगाल पर हाल के अपडेट प्राप्त करने के लिए एक पंजीकरण पृष्ठ है। द मैन, कई चयन ों की पेशकश करता है।",
      "सुविधाओं में संपर्क जानकारी, फ़ीडबैक विकल्प, उपयोग की शर्तें, गोपनीयता नीति, विज्ञापन चयन और कुकी नीति शामिल हैं.",
      "उपयोगकर्ताओं को अपनी व्यक्तिगत जानकारी की बिक्री या साझा करने से रोकने का विकल्प भी दिया जाता है।"
    ],
    "points": 310,
    "commentCount": 89,
    "retryCount": 0,
    "time": 1699055994
  },
  {
    "id": 38127560,
    "title": "रवांडा और केन्या ने व्यापार और पर्यटन को बढ़ावा देने के लिए अफ्रीकी नागरिकों के लिए वीजा मुक्त यात्रा शुरू की",
    "originLink": "https://africa.businessinsider.com/local/leaders/from-barriers-to-unity-rwanda-joins-kenya-to-initiate-visa-free-travel-for-all/hhqe29q",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38127560",
    "commentBody": "",
    "originSummary": [
      "रवांडा और केन्या सभी अफ्रीकी नागरिकों के लिए वीजा मुक्त यात्रा शुरू कर रहे हैं, जिसका उद्देश्य अंतर-अफ्रीकी पर्यटन और व्यापार को बढ़ावा देना है।",
      "रवांडा के राष्ट्रपति पॉल कागमे ने विश्व यात्रा और पर्यटन परिषद के 23 वें वैश्विक शिखर सम्मेलन में और केन्याई राष्ट्रपति विलियम रुटो ने कहा कि परिवर्तन साल के अंत तक लागू किया जाएगा।",
      "ये परिवर्तन एकता और मुक्त व्यापार के लिए अफ्रीकी संघ की पहल के साथ संरेखित हैं, जिसमें 2016 में अफ्रीकी पासपोर्ट का शुभारंभ और लगभग 3.4 ट्रिलियन डॉलर के महाद्वीपीय मुक्त व्यापार क्षेत्र की स्थापना शामिल है।"
    ],
    "commentSummary": [
      "रवांडा और केन्या अंतर-अफ्रीकी पर्यटन और व्यापार का समर्थन करने के लिए सभी अफ्रीकी नागरिकों के लिए वीजा मुक्त यात्रा शुरू कर रहे हैं।",
      "रवांडा के राष्ट्रपति पॉल कागमे और केन्या के राष्ट्रपति विलियम रुटो दोनों ने अफ्रीकी देशों के बीच व्यापार के महत्व और मजबूत महाद्वीपीय एकता की संभावना पर जोर दिया।",
      "अफ्रीकी संघ ने 2016 में अफ्रीकी पासपोर्ट लॉन्च किया और 3.4 ट्रिलियन डॉलर के अनुमानित महाद्वीप-व्यापी मुक्त व्यापार क्षेत्र की स्थापना की है।"
    ],
    "points": 248,
    "commentCount": 112,
    "retryCount": 0,
    "time": 1699013703
  },
  {
    "id": 38127313,
    "title": "Cloudflare का 24 घंटे का आउटेज डेटा केंद्रों में बिजली प्रबंधन के महत्व और एकल कंपनियों पर निर्भरता के जोखिम पर प्रकाश डालता है",
    "originLink": "https://news.ycombinator.com/item?id=38112515",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38127313",
    "commentBody": "",
    "originSummary": [
      "विभिन्न ऑनलाइन सेवाएं प्रदान करने वाली कंपनी Cloudflare ने अपने डेटा केंद्रों में बिजली के नुकसान के कारण संभावित रूप से एपीआई डाउनटाइम का अनुभव किया।",
      "उपयोगकर्ताओं ने निर्बाध बिजली आपूर्ति (यूपीएस) और जनरेटर यार्ड के महत्व पर प्रकाश डाला, और ऐसी घटनाओं से नुकसान को कम करने के लिए व्यापक बिजली आकस्मिक योजनाओं और उपलब्धता क्षेत्रों की आवश्यकता पर प्रकाश डाला।",
      "कोर सेवाओं के लिए अमेज़ॅन, गूगल, माइक्रोसॉफ्ट और क्लाउडफ्लेयर जैसी एकल बड़ी कंपनियों पर निर्भरता को देखते हुए, उपयोगकर्ताओं ने संभावित सुरक्षा जोखिमों और आउटेज के बारे में भी चिंता व्यक्त की। हालांकि, Cloudflare को इसकी सुरक्षात्मक सेवाओं और पारदर्शिता के लिए सराहा गया था।"
    ],
    "commentSummary": [
      "Cloudflare ने डेटा केंद्रों में संभावित बिजली हानि के कारण एपीआई डाउनटाइम का अनुभव किया, जिससे विभिन्न सेवाएं प्रभावित हुईं।",
      "इस घटना ने व्यापक बिजली आकस्मिक योजनाओं, निर्बाध बिजली आपूर्ति (यूपीएस) और डेटा केंद्रों में उपलब्धता क्षेत्रों के महत्व पर चर्चा को प्रेरित किया है, जो पिछली समान घटनाओं से शुरू हुआ है।",
      "बहस ने आवश्यक सेवाओं के लिए अमेज़ॅन, गूगल, माइक्रोसॉफ्ट और क्लाउडफ्लेयर जैसी एकल फर्मों पर निर्भरता को भी घेर लिया, साथ ही उनकी मान्यता प्राप्त सुरक्षात्मक क्षमताओं और पारदर्शिता के बावजूद संभावित सुरक्षा जोखिमों और व्यवधानों के बारे में चिंताओं के साथ।"
    ],
    "points": 232,
    "commentCount": 66,
    "retryCount": 0,
    "time": 1699012045
  },
  {
    "id": 38126997,
    "title": "वैज्ञानिकों और गैर सरकारी संगठनों ने सुरक्षित मंच के माध्यम से यूरोपीय संघ के ईआईडीएएस सुधार पर संयुक्त बयान जारी किया",
    "originLink": "https://eidas-open-letter.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38126997",
    "commentBody": "",
    "originSummary": [
      "198KB के फ़ाइल आकार के साथ \"eIDAS पत्र.pdf\" नामक दस्तावेज़ डाउनलोड के लिए उपलब्ध है।",
      "यह फ़ाइल Nextcloud पर पाई जा सकती है, एक मंच जो अपनी सुरक्षा सुविधाओं और डेटा प्रबंधन क्षमताओं के लिए प्रसिद्ध है।"
    ],
    "commentSummary": [
      "दस्तावेज़ \"eIDAS पत्र.pdf,\" जो 198KB है, डाउनलोड के लिए उपलब्ध है।",
      "दस्तावेज़ को नेक्स्टक्लाउड पर होस्ट किया गया है, एक मंच जो अपने सुरक्षित डेटा हैंडलिंग के लिए जाना जाता है।"
    ],
    "points": 215,
    "commentCount": 58,
    "retryCount": 0,
    "time": 1699009722
  },
  {
    "id": 38127906,
    "title": "हेल्पर बैक्टीरियोफेज से चिपके उपग्रह वायरस का अभूतपूर्व अवलोकन: जीवित रहने के लिए एक नया मार्ग",
    "originLink": "https://umbc.edu/stories/first-observed-virus-attaching-to-another/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38127906",
    "commentBody": "",
    "originSummary": [
      "मैरीलैंड विश्वविद्यालय, बाल्टीमोर काउंटी (यूएमबीसी) के वैज्ञानिकों ने एक उपग्रह वायरस का पहला अवलोकन किया है जो लगातार एक सहायक बैक्टीरियोफेज से जुड़ा हुआ है- एक वायरस जो बैक्टीरिया कोशिकाओं को संक्रमित करता है।",
      "50 सहायक उपग्रहों पर किए गए परीक्षणों में, यह पाया गया कि 80% के गले में एक उपग्रह बंधा हुआ था।",
      "यूएमबीसी टीम ने किसी भी एकीकरण जीन से रहित एक अद्वितीय उपग्रह की खोज की, यह सुझाव देते हुए कि यह मेजबान सेल के डीएनए में एकीकृत होने के बजाय एक सहायक से जुड़कर मेजबान के अंदर अस्तित्व सुनिश्चित करता है।"
    ],
    "commentSummary": [
      "मैरीलैंड विश्वविद्यालय, बाल्टीमोर काउंटी (यूएमबीसी) के वैज्ञानिकों ने एक उपग्रह वायरस की खोज की है जो लगातार एक बैक्टीरियोफेज से जुड़ता है, जो एक वायरस है जो बैक्टीरिया को संक्रमित करता है।",
      "50 सहायक उपग्रहों पर किए गए परीक्षणों में, 80% के गर्दन पर एक उपग्रह बंधा हुआ था, जो पहली बार अवलोकन था।",
      "शोधकर्ताओं ने एक उपग्रह की खोज की जिसमें एकीकरण के लिए कोई जीन नहीं था, यह संकेत देता है कि यह मेजबान सेल के डीएनए में एकीकृत होने के बजाय मेजबान के अंदर जीवित रहने के लिए एक सहायक से जुड़ा हुआ है।"
    ],
    "points": 209,
    "commentCount": 55,
    "retryCount": 0,
    "time": 1699015662
  },
  {
    "id": 38136314,
    "title": "कैलिफोर्निया जूरी ने बायर को राउंडअप कैंसर मुकदमे में $ 332 मिलियन का भुगतान करने का आदेश दिया",
    "originLink": "https://fortune.com/2023/11/03/bayer-332-million-judgement-trial-man-cancer-decades-monsanto-roundup-weedkiller/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38136314",
    "commentBody": "",
    "originSummary": [
      "कैलिफोर्निया की एक जूरी ने माइक डेनिस को मोनसेंटो के खिलाफ एक मुकदमे में 33.2 करोड़ डॉलर का जुर्माना लगाया है, जिसमें आरोप लगाया गया है कि मोनसेंटो के राउंडअप वीडकिलर का उपयोग करने के परिणामस्वरूप गैर-हॉजकिन के लिंफोमा का उनका दुर्लभ रूप था।",
      "राउंडअप में सक्रिय घटक, ग्लाइफोसेट, मुकदमे के केंद्र में है। डेनिस के सम्मानित कुल का एक हिस्सा ($ 7 मिलियन) प्रतिपूरक क्षति को कवर करता है, जबकि थोक ($ 325 मिलियन) दंडात्मक क्षति के लिए है।",
      "इसी तरह के हजारों राउंडअप से संबंधित दावों से निपटने वाली बेयर ने फैसले के खिलाफ अपील करने की योजना बनाई है। यह बायर की 2020 की प्रतिबद्धता का अनुसरण करता है जिसमें लगभग 125,000 दावों के निपटान के लिए $ 10.9 बिलियन तक अलग रखा गया है।"
    ],
    "commentSummary": [
      "कैलिफोर्निया की एक जूरी ने माइक डेनिस को मोनसेंटो के खिलाफ एक मुकदमे में 332 मिलियन डॉलर दिए, जो अब बेयर का एक हिस्सा है, जिसमें दावा किया गया है कि उनके दुर्लभ गैर-हॉजकिन के लिंफोमा के परिणामस्वरूप मोनसेंटो के राउंडअप वीडकिलर, मुख्य रूप से इसके घटक, ग्लाइफोसेट का उपयोग करने के दशकों के परिणामस्वरूप हुआ।",
      "सम्मानित राशि में प्रतिपूरक क्षति में $ 7 मिलियन और दंडात्मक क्षति में $ 325 मिलियन शामिल हैं। हालांकि, बेयर ने इस फैसले के खिलाफ अपील करने की योजना बनाई है।",
      "यह मुकदमा उन हजारों दावों में से एक है जिनका सामना बायर ने राउंडअप से संबंधित किया है। 2020 में, बेयर ने लगभग 125,000 दावों को निपटाने के लिए $ 10.9 बिलियन तक निर्धारित किए।"
    ],
    "points": 203,
    "commentCount": 171,
    "retryCount": 0,
    "time": 1699053413
  },
  {
    "id": 38133963,
    "title": "पॉडमैन डेस्कटॉप रोलआउट संस्करण 1.5: सेटअप में आसानी, एन्हांस्ड कुबेरनेट्स समर्थन और बेहतर उपयोगकर्ता अनुभव",
    "originLink": "https://podman-desktop.io/blog/podman-desktop-release-1.5",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38133963",
    "commentBody": "",
    "originSummary": [
      "पॉडमैन डेस्कटॉप संस्करण 1.5 जारी किया गया है, जिसमें विभिन्न संवर्द्धन और नए कार्य जैसे कि निर्देशित ऑनबोर्डिंग सेटअप, कीबोर्ड द्वारा संचालित कमांड पैलेट और पर्यावरण फ़ाइल समर्थन शामिल हैं।",
      "राज्य परिवर्तन, सेटिंग्स क्षेत्र और एक्सटेंशन एपीआई से संबंधित उपयोगकर्ता अनुभव को बेहतर बनाने के लिए कई बदलाव किए गए थे। इसके अतिरिक्त, कुबेरनेट्स पॉड्स के लिए एक विस्तारित \"सारांश\" टैब जोड़ा गया है।",
      "टीम इस रिलीज में समुदाय के योगदान की सराहना करती है, उपयोगकर्ताओं को गिटहब रिपॉजिटरी की जांच करके संलग्न करने के लिए प्रोत्साहित कर रही है, और अपडेट उनकी वेबसाइट से डाउनलोड के लिए उपलब्ध है।"
    ],
    "commentSummary": [
      "पॉडमैन डेस्कटॉप संस्करण 1.5 जारी किया गया है, जिसमें सेटअप के लिए एक ऑनबोर्डिंग सुविधा, एक कीबोर्ड-संचालित कमांड पैलेट, कुबेरनेट्स पॉड्स के लिए एन्हांस्ड 'सारांश' टैब और पर्यावरण फ़ाइलों के लिए समर्थन जैसे नए परिवर्धन शामिल हैं।",
      "राज्य परिवर्तनों के लिए उपयोगकर्ता अनुभव में भी सुधार किया गया है और सेटिंग्स क्षेत्र और एक्सटेंशन एपीआई में वृद्धि हुई है।",
      "बग फिक्स और अन्य उन्नयन की एक श्रृंखला लागू की गई है, जिसमें समुदाय के योगदान को स्वीकार किया गया है। उपयोगकर्ताओं को आगे के शोधन की दिशा में योगदान करने के संभावित तरीकों के लिए गिटहब रिपॉजिटरी की जांच करने के लिए प्रोत्साहित किया जाता है।"
    ],
    "points": 191,
    "commentCount": 85,
    "retryCount": 0,
    "time": 1699040343
  },
  {
    "id": 38130309,
    "title": "ओपनएआई का जीपीटी-4-आधारित 'चैटजीपीटी-ऑटोएक्सपर्ट' उपयोगकर्ता इंटरैक्शन, ब्राउज़िंग और सुरक्षित छवि पहचान के लिए क्षमताओं का विस्तार करता है",
    "originLink": "https://github.com/spdustin/ChatGPT-AutoExpert/blob/main/_system-prompts/all_tools.md",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38130309",
    "commentBody": "",
    "originSummary": [
      "दस्तावेज़ जीपीटी -4 आर्किटेक्चर पर आधारित ओपनएआई द्वारा विकसित एक बड़े भाषा मॉडल, \"चैटजीपीटी-ऑटोएक्सपर्ट\" के लिए व्यापक दिशानिर्देश प्रदान करता है, और इसमें छवि पहचान और ब्राउज़िंग टूल जैसी विशेषताएं शामिल हैं।",
      "मॉडल को वास्तविक लोगों की छवियों से संवेदनशील सामग्री को अलग करने से रोकने के लिए विशिष्ट सीमाएं हैं, उदाहरण के लिए, छवि निर्माण और चित्रण के लिए विस्तृत निर्देशों के साथ, उदाहरण के लिए, डैल-ई का उपयोग।",
      "कॉपीराइट प्रतिबंधों, विविधता और समावेशिता पर जोर दिया गया है, और दस्तावेज़ इस बात पर भी प्रकाश डालता है कि उपयोगकर्ता के प्रश्नों के लिए प्रासंगिक जानकारी खोजने और खोजने के लिए विभिन्न अंतर्निहित उपकरण कैसे कार्य करते हैं।"
    ],
    "commentSummary": [
      "दिशानिर्देश में ओपनएआई द्वारा जीपीटी -4 आर्किटेक्चर पर निर्मित एक बड़ी भाषा मॉडल, \"चैटजीपीटी-ऑटोएक्सपर्ट\" शामिल है, जिसमें संचार को बढ़ाने के लिए छवि पहचान, ब्राउज़िंग टूल और प्रोग्रामिंग शामिल हैं।",
      "मॉडल को वास्तविक व्यक्तियों की छवियों से संवेदनशील विवरण प्रकट करने से रोकने के लिए कड़े नियम हैं, जो विशिष्ट परिदृश्यों और अपेक्षित व्यवहारों के अनुरूप विस्तृत निर्देशों के साथ पूरक हैं।",
      "यह डैल-ई सॉफ्टवेयर का उपयोग करके छवियों को बनाने और प्रतिनिधित्व करने के बारे में जानकारी भी प्रदान करता है, कॉपीराइट कानूनों के पालन पर जोर देता है, और विविधता और समावेशिता के महत्व पर जोर देता है। उपयोगकर्ता के प्रश्नों के लिए प्रासंगिक जानकारी खोज में सहायता करने वाले विभिन्न उपकरणों पर भी चर्चा की जाती है।"
    ],
    "points": 191,
    "commentCount": 127,
    "retryCount": 0,
    "time": 1699025430
  },
  {
    "id": 38137373,
    "title": "एएमडी का माइक्रोब्लेज वी: अनुकूली एसओसी और एफपीजीए के लिए एक मॉड्यूलर, कुशल आरआईएससी-वी प्रोसेसर",
    "originLink": "https://www.xilinx.com/products/design-tools/microblaze-v.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38137373",
    "commentBody": "",
    "originSummary": [
      "एएमडी माइक्रोब्लेज़ वी एक सॉफ्ट-कोर आरआईएससी-वी प्रोसेसर आईपी है जिसे अनुकूली एसओसी और एफपीजीए के लिए डिज़ाइन किया गया है, जो 32-बिट आरआईएससी-वी इंस्ट्रक्शन सेट आर्किटेक्चर (आईएसए) पर चल रहा है।",
      "प्रोसेसर मॉड्यूलर है, एम्बेडेड सिस्टम के लिए विभिन्न प्रकार के एक्सटेंशन का समर्थन करता है और क्लासिक माइक्रोब्लेज प्रोसेसर के साथ हार्डवेयर-संगत है।",
      "यह विवाडो और विटिस डिज़ाइन टूल के साथ पूरी तरह से एकीकृत है, जिससे डेवलपर्स को ओपन-सोर्स आरआईएससी-वी सॉफ्टवेयर इकोसिस्टम का लाभ उठाने और विवाडो डिज़ाइन सूट द्वारा समर्थित एएमडी अनुकूली एसओसी या एफपीजीए उपकरणों को लक्षित करने में सक्षम बनाता है।"
    ],
    "commentSummary": [
      "एएमडी माइक्रोब्लेज™ वी प्रोसेसर, 32-बिट आरआईएससी-वी इंस्ट्रक्शन सेट आर्किटेक्चर (आईएसए) पर आधारित है, एक सॉफ्ट-कोर प्रोसेसर आईपी है जिसे एएमडी एडेप्टिव सिस्टम-ऑन-चिप्स (एसओसी) और फील्ड-प्रोग्रामेबल गेट एरे (एफपीजीए) के लिए डिज़ाइन किया गया है।",
      "माइक्रोब्लेज वी क्लासिक माइक्रोब्लेज प्रोसेसर के साथ हार्डवेयर संगतता प्रदान करता है और एएमडी के विवाडो™ और विटिस डिजाइन टूल के साथ एकीकृत करता है, जिससे विकास की सुविधा मिलती है™।",
      "यह प्रोसेसर डेवलपर्स को ओपन-सोर्स आरआईएससी-वी सॉफ्टवेयर इकोसिस्टम तक पहुंचने और विवाडो डिज़ाइन सुइट द्वारा समर्थित किसी भी एएमडी अनुकूली एसओसी या एफपीजीए को लक्षित करने में सक्षम बनाता है।"
    ],
    "points": 188,
    "commentCount": 31,
    "retryCount": 0,
    "time": 1699063305
  },
  {
    "id": 38130870,
    "title": "Okta को तीसरे पक्ष के विक्रेता से 5,000 कर्मचारी डेटा चोरी के साथ एक और सुरक्षा उल्लंघन का सामना करना पड़ता है",
    "originLink": "https://arstechnica.com/security/2023/11/okta-hit-by-another-breach-this-one-stealing-employee-data-from-3rd-party-vendor/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38130870",
    "commentBody": "",
    "originSummary": [
      "पहचान और प्रमाणीकरण प्रबंधन में विशेषज्ञता रखने वाली कंपनी ओक्टा ने एक और सुरक्षा उल्लंघन का अनुभव किया, जिसमें घुसपैठियों ने तीसरे पक्ष के विक्रेता, राइटवे हेल्थकेयर से लगभग 5,000 कर्मचारियों के व्यक्तिगत डेटा प्राप्त किए।",
      "घुसपैठ, जो सितंबर के अंत में हुई और अक्टूबर में खोजी गई, में नाम, सामाजिक सुरक्षा संख्या और स्वास्थ्य बीमा योजना के विवरण की चोरी शामिल थी।",
      "उल्लंघन की गंभीरता के बावजूद, ओक्टा का कहना है कि उसका ग्राहक डेटा अप्रभावित रहा, इस बात पर जोर देते हुए कि उल्लंघन ने अपने ग्राहक सहायता प्रणाली से जुड़े पूर्व समझौते का पालन किया।"
    ],
    "commentSummary": [
      "एक पहचान और प्रमाणीकरण प्रबंधन प्रदाता ओक्टा ने एक और सुरक्षा उल्लंघन का अनुभव किया है, जिसके परिणामस्वरूप तीसरे पक्ष के विक्रेता, राइटवे हेल्थकेयर से अपने 5,000 कर्मचारियों के व्यक्तिगत डेटा की चोरी हुई है।",
      "यह उल्लंघन सितंबर के अंत में हुआ था, लेकिन इसका पता अक्टूबर में चला। हैक किए गए डेटा में नाम, सामाजिक सुरक्षा नंबर और स्वास्थ्य बीमा योजना नंबर शामिल थे।",
      "डेटा उल्लंघन के बावजूद, Okta ग्राहक डेटा अप्रभावित रहता है। यह घटना पिछले उल्लंघन के बाद हुई है जहां ओक्टा की ग्राहक सहायता प्रणाली से समझौता किया गया था।"
    ],
    "points": 188,
    "commentCount": 85,
    "retryCount": 0,
    "time": 1699028113
  },
  {
    "id": 38133279,
    "title": "अपीली अदालत ने सर्वसम्मति से पूर्व न्यायाधीश को गैरकानूनी घर तलाशी के लिए छूट देने से इनकार किया",
    "originLink": "https://ij.org/press-release/victory-appeals-court-unanimously-denies-judicial-immunity-to-west-virginia-judge-who-personally-searched-home-ordered-items-removed/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38133279",
    "commentBody": "",
    "originSummary": [
      "चौथे अमेरिकी सर्किट कोर्ट ऑफ अपील्स ने पूर्व फैमिली कोर्ट जज लुईस गोल्डस्टन के खिलाफ मैथ्यू गिब्सन के पक्ष में फैसला सुनाया, जिसमें कहा गया कि उन्होंने तलाक के बीच गिब्सन के घर की वारंटरहित तलाशी लेकर न्यायिक शक्तियों का उल्लंघन किया।",
      "गोल्डस्टन को पहले वेस्ट वर्जीनिया उच्च न्यायालय द्वारा निंदा, जुर्माना और निंदा का सामना करना पड़ा, जिसके परिणामस्वरूप महाभियोग की कार्यवाही के दौरान उनकी सेवानिवृत्ति हुई।",
      "गोल्डस्टन की सेवानिवृत्ति के बावजूद, गिब्सन और इंस्टीट्यूट फॉर जस्टिस (संवैधानिक अधिकारों की रक्षा करने वाली एक राष्ट्रीय गैर-लाभकारी कानूनी फर्म) ने इसी तरह के उल्लंघनों को रोकने और न्यायिक प्रतिरक्षा के सिद्धांत के प्रसार को सीमित करने के लिए अपने मुकदमे का पीछा किया।"
    ],
    "commentSummary": [
      "चौथे अमेरिकी सर्किट कोर्ट ऑफ अपील्स ने सर्वसम्मति से पूर्व फैमिली कोर्ट जज लुईस गोल्डस्टन के खिलाफ फैसला सुनाया, इस बात पर सहमति व्यक्त की कि उन्होंने तलाक की कार्यवाही के दौरान मैथ्यू गिब्सन के घर की वारंटरहित तलाशी ली, जो उनकी न्यायिक शक्तियों से अधिक थी।",
      "गोल्डस्टन, जिन्हें पहले वेस्ट वर्जीनिया उच्च न्यायालय द्वारा निंदा, जुर्माना और निंदा की गई थी, महाभियोग के प्रयासों के बीच सेवानिवृत्त हो गए, लेकिन गिब्सन और संवैधानिक अधिकारों की रक्षा करने वाली एक राष्ट्रीय गैर-लाभकारी कानूनी फर्म इंस्टीट्यूट फॉर जस्टिस (आईजे) ने इसी तरह के उल्लंघनों को रोकने के लिए अपने मुकदमे को जारी रखा।",
      "गिब्सन और आईजे की सेवानिवृत्ति के बावजूद, गोल्डस्टन के खिलाफ मुकदमे का पीछा करना, न्यायिक प्रतिरक्षा के सिद्धांत पर संभावित प्रभाव डालता है, जो न्यायाधीशों द्वारा अति पहुंच को रोकने का प्रयास करता है।"
    ],
    "points": 181,
    "commentCount": 164,
    "retryCount": 0,
    "time": 1699037677
  },
  {
    "id": 38127203,
    "title": "श्रमिक, विशेष रूप से युवा जनसांख्यिकीय, चार दिवसीय कार्य सप्ताह के लिए बलिदान के लिए खुले हैं, सर्वेक्षण में पाया गया",
    "originLink": "https://www.cnbc.com/2023/11/01/what-young-people-would-give-up-for-a-4-day-workweek.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38127203",
    "commentBody": "",
    "originSummary": [
      "एक नए बैंकरेट सर्वेक्षण से संकेत मिलता है कि 92% युवा श्रमिक और 86% पुराने श्रमिक चार-दिवसीय कार्यसप्ताह की खातिर कुछ समझौते करने के लिए खुले हैं।",
      "ये श्रमिक जो बलिदान देने के लिए तैयार हैं, वे इन-पर्सन काम में शिफ्ट होने और लंबे समय तक काम करने से लेकर सप्ताहांत या शाम को काम करने और यहां तक कि कम वेतन स्वीकार करने तक हो सकते हैं।",
      "वर्तमान में 2023 तक मानसिक स्वास्थ्य लाभ के लिए केवल 15% अमेरिकी नियोक्ता चार दिवसीय कार्यसप्ताह की पेशकश कर रहे हैं, यह एक संभावित विकास क्षेत्र और संगठनात्मक प्रथाओं में बदलाव के लिए अवसर प्रस्तुत करता है।"
    ],
    "commentSummary": [
      "बैंकरेट के नए सर्वेक्षण से पता चलता है कि 92% युवा श्रमिक और 86% पुराने श्रमिक चार-दिवसीय कार्यसप्ताह पसंद करेंगे, भले ही इसके लिए लंबे घंटे, सप्ताहांत के काम और वेतन में कटौती जैसे बलिदान की आवश्यकता हो।",
      "सर्वेक्षण में यह भी पता चलता है कि कर्मचारियों में नौकरी बदलने या चार दिवसीय कार्यक्रम का पालन करने के लिए इन-पर्सन काम पर लौटने का झुकाव है।",
      "रुचि के बावजूद, केवल 15% अमेरिकी नियोक्ता मानसिक स्वास्थ्य लाभ के लिए चार-दिवसीय सप्ताह का विकल्प प्रदान करते हैं, जो संगठनों को प्रतिभा को आकर्षित करने और बनाए रखने के लिए एक अपूर्ण अवसर का सुझाव देता है।"
    ],
    "points": 174,
    "commentCount": 203,
    "retryCount": 0,
    "time": 1699011227
  }
]
