[
  {
    "id": 38132016,
    "title": "Un dezvoltator care se retrage va publica patru decenii de cod sursă, inclusiv sisteme de operare rare",
    "originLink": "https://dunfield.themindfactory.com/dnldsrc.htm",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38132016",
    "commentBody": "",
    "originSummary": [
      "Dave, un dezvoltator de software care se pensionează, face public codul sursă al celor 40 de ani de activitate pentru diverse sisteme de operare, utilitare, instrumente și programe, cu intenția de a fi benefic sau educativ pentru alții.",
      "Printre contribuțiile sale notabile se numără \"ARMOS\", un kernel multiproces/task pentru ARM, \"CUBIX\", un sistem de operare conceput pentru procesorul 6809 și \"DMS\", primul său sistem de operare dezvoltat în 1980.",
      "Această versiune oferă o oportunitate unică pentru viitorii tehnicieni sau pentru cei interesați de a învăța din munca unui programator cu experiență și din moștenirea codului."
    ],
    "commentSummary": [
      "Dave, un dezvoltator de software cu vechime, pune la dispoziția celorlalți dezvoltatori codurile sale sursă din ultimii 40 de ani ale diverselor sisteme de operare, utilitare, instrumente și programe.",
      "Printre programele la care a contribuit se numără \"ARMOS\", un nucleu care facilitează procesele/activitățile multiple pentru procesoarele ARM, \"CUBIX\", un sistem de operare pentru procesorul 6809 și \"DMS\", primul său sistem de operare dezvoltat în 1980.",
      "Această acțiune unică încurajează învățarea și schimbul de cunoștințe în cadrul comunității de dezvoltare de software și oferă resurse neprețuite atât pentru dezvoltatorii experimentați, cât și pentru cei începători."
    ],
    "points": 797,
    "commentCount": 202,
    "retryCount": 0,
    "time": 1699032376
  },
  {
    "id": 38130418,
    "title": "O personalitate YouTube creează o platformă de înșelăciune pentru a prinde escrocii Bitcoin: Apare o colaborare cu bursa de criptomonede Kraken",
    "originLink": "https://www.youtube.com/watch?v=dWzz3NeDz3E",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38130418",
    "commentBody": "",
    "originSummary": [
      "Personalitatea YouTube Kid Kid Buger și echipa sa au dezvoltat o platformă de înșelăciune pentru a prinde escrocii Bitcoin, cu caracteristici precum un card cadou Bitcoin fals și un serviciu clienți fals care pune apelanții în așteptare pe termen nelimitat.",
      "Începută inițial ca o glumă, această entitate s-a transformat acum într-o întreprindere serioasă, ajutând victimele fraudelor și facilitând investigarea activităților frauduloase.",
      "Această inițiativă care perturbă exploatarea bancomatelor Bitcoin este împărtășită ca o poveste de succes de către creator, subliniind potențialul ideilor minore de a duce la consecințe substanțiale."
    ],
    "commentSummary": [
      "Echipa personalității YouTube Kid Kid Buger a dezvoltat o platformă de momeală concepută pentru a prinde escrocii Bitcoin, oferind carduri cadou sau chitanțe Bitcoin fictive.",
      "Platforma, creată inițial ca o glumă, are acum un scop serios, împiedicând escrocii cu provocări și o așteptare interminabilă a serviciului clienți, perturbând operațiunile celor care exploatează bancomatele Bitcoin.",
      "Acest instrument neconvențional ajută victimele înșelăciunilor și colaborează cu platforma de criptomonede Kraken pentru a investiga fraudele, ceea ce întărește importanța ideilor mici cu potențial de a produce rezultate semnificative."
    ],
    "points": 638,
    "commentCount": 286,
    "retryCount": 0,
    "time": 1699025931
  },
  {
    "id": 38128699,
    "title": "Dezvoltatorul de software apreciază instrumentele de depanare în ciuda procesului de rezolvare a problemelor care durează o săptămână",
    "originLink": "https://shmck.substack.com/p/no-dogs-were-harmed-in-the-making",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38128699",
    "commentBody": "",
    "originSummary": [
      "Shawn, un dezvoltator de software, își împărtășește experiența într-o postare pe Substack despre un proces dificil de depanare de o săptămână care l-a făcut să se îndoiască de alegerea sa profesională.",
      "După ce a obținut informații de la prieteni din domenii precum ingineria, medicina veterinară și cercetarea științifică, Shawn recunoaște că, deși toate profesiile se confruntă cu provocări unice, dezvoltatorii de software au privilegiul de a utiliza instrumente eficiente de depanare.",
      "El își exprimă recunoștința pentru aceste instrumente de depanare, în ciuda unei erori minore de codare care a dus la un proces de depanare care a durat o săptămână."
    ],
    "commentSummary": [
      "Shawn, un dezvoltator de software, își consemnează în jurnalul său experiența de depanare de o săptămână pe Substack, o platformă online care permite editorilor individuali să partajeze conținut.",
      "Procesul obositor de depanare l-a făcut să se îndoiască de alegerea sa profesională, dar a căpătat o perspectivă prin discuții cu prieteni cu profesii precum ingineria, medicina veterinară și cercetarea științifică.",
      "Ajuns la o constatare, el apreciază valoarea instrumentelor eficiente de depanare disponibile pentru dezvoltatorii de software, în ciuda problemelor cauzate de o simplă eroare de codare."
    ],
    "points": 430,
    "commentCount": 186,
    "retryCount": 0,
    "time": 1699019273
  },
  {
    "id": 38136607,
    "title": "Rock Band Portugalia. Site-ul oficial al lui The Man a fost convertit în document Google Sheets",
    "originLink": "https://www.portugaltheman.com/?frontpage=true",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38136607",
    "commentBody": "",
    "originSummary": [
      "Această pagină este o platformă de înscriere pentru a obține cele mai recente actualizări despre Portugalia. The Man, o trupă muzicală.",
      "Oferă mai multe opțiuni, cum ar fi contact, feedback, termeni de utilizare, politica de confidențialitate, opțiuni publicitare și politica privind cookie-urile.",
      "Utilizatorii au posibilitatea de a alege să împiedice vânzarea sau partajarea datelor lor personale, asigurând astfel o mai mare confidențialitate a datelor."
    ],
    "commentSummary": [
      "Aceasta este o pagină de înregistrare pentru a obține actualizări recente privind Portugalia. The Man, care oferă mai multe selecții.",
      "Caracteristicile includ informații de contact, opțiuni de feedback, termeni de utilizare, politică de confidențialitate, selecții de anunțuri și o politică privind cookie-urile.",
      "De asemenea, utilizatorii au posibilitatea de a împiedica vânzarea sau partajarea informațiilor lor personale."
    ],
    "points": 310,
    "commentCount": 89,
    "retryCount": 0,
    "time": 1699055994
  },
  {
    "id": 38127560,
    "title": "Rwanda și Kenya inițiază călătorii fără vize pentru cetățenii africani pentru a stimula comerțul și turismul",
    "originLink": "https://africa.businessinsider.com/local/leaders/from-barriers-to-unity-rwanda-joins-kenya-to-initiate-visa-free-travel-for-all/hhqe29q",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38127560",
    "commentBody": "",
    "originSummary": [
      "Rwanda și Kenya introduc călătorii fără vize pentru toți cetățenii africani, cu scopul de a stimula turismul și comerțul intra-african.",
      "Anunțurile au fost făcute de președintele rwandez Paul Kagame la cel de-al 23-lea summit global al Consiliului Mondial al Călătoriilor și Turismului, precum și de președintele kenyan William Ruto, care a declarat că schimbarea va fi implementată până la sfârșitul anului.",
      "Aceste schimbări se aliniază cu inițiativele Uniunii Africane pentru unitate și liber schimb, inclusiv lansarea unui pașaport african în 2016 și crearea unei zone continentale de liber schimb în valoare de aproximativ 3.400 de miliarde de dolari."
    ],
    "commentSummary": [
      "Rwanda și Kenya introduc călătorii fără vize pentru toți cetățenii africani pentru a sprijini turismul și comerțul intra-african.",
      "Atât președintele Rwandei, Paul Kagame, cât și președintele Kenyei, William Ruto, au subliniat importanța comerțului între națiunile africane și potențialul de consolidare a unității continentale.",
      "Uniunea Africană a lansat pașaportul african în 2016 și a stabilit o zonă de liber schimb la nivelul întregului continent, a cărei valoare este estimată la 3.400 de miliarde de dolari."
    ],
    "points": 248,
    "commentCount": 112,
    "retryCount": 0,
    "time": 1699013703
  },
  {
    "id": 38127313,
    "title": "Întreruperea de 24 de ore a Cloudflare evidențiază importanța gestionării energiei în centrele de date și riscurile dependenței de o singură companie",
    "originLink": "https://news.ycombinator.com/item?id=38112515",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38127313",
    "commentBody": "",
    "originSummary": [
      "Cloudflare, o companie care oferă diverse servicii online, a suferit o întrerupere a API-ului, posibil din cauza unei pene de curent în centrele sale de date.",
      "Utilizatorii au evidențiat importanța sistemelor de alimentare neîntreruptă cu energie electrică (UPS) și a parcurilor de generatoare, precum și necesitatea unor planuri cuprinzătoare de urgență și a unor zone de disponibilitate a energiei electrice pentru a minimiza daunele provocate de astfel de incidente.",
      "În timp ce remarcau dependența de companii mari precum Amazon, Google, Microsoft și Cloudflare pentru serviciile de bază, utilizatorii și-au exprimat îngrijorarea cu privire la posibilele riscuri de securitate și întreruperi. Cu toate acestea, Cloudflare a fost lăudat pentru serviciile sale de protecție și pentru transparență."
    ],
    "commentSummary": [
      "Cloudflare a înregistrat o întrerupere a API din cauza unei posibile pierderi de energie electrică în centrele de date, cu impact asupra diverselor servicii.",
      "Incidentul a provocat discuții privind importanța unor planuri de urgență cuprinzătoare privind alimentarea cu energie electrică, a sistemelor de alimentare neîntreruptă (UPS) și a zonelor de disponibilitate în centrele de date, ca urmare a unor evenimente similare din trecut.",
      "De asemenea, dezbaterea a vizat dependența de firme unice precum Amazon, Google, Microsoft și Cloudflare pentru servicii esențiale, alături de preocupările legate de posibilele riscuri de securitate și întreruperi, în ciuda capacităților de protecție și a transparenței recunoscute ale acestora."
    ],
    "points": 232,
    "commentCount": 66,
    "retryCount": 0,
    "time": 1699012045
  },
  {
    "id": 38126997,
    "title": "Oameni de știință și ONG-uri publică o declarație comună privind reforma eIDAS a UE prin intermediul unei platforme securizate",
    "originLink": "https://eidas-open-letter.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38126997",
    "commentBody": "",
    "originSummary": [
      "Documentul intitulat \"eIDAS letter.pdf\", cu o dimensiune a fișierului de 198KB, este disponibil pentru descărcare.",
      "Acest fișier poate fi găsit pe Nextcloud, o platformă renumită pentru caracteristicile sale de securitate și pentru capacitățile de gestionare a datelor."
    ],
    "commentSummary": [
      "Documentul \"eIDAS letter.pdf\", care are 198KB, este disponibil pentru descărcare.",
      "Documentul este găzduit pe Nextcloud, o platformă cunoscută pentru manipularea sigură a datelor."
    ],
    "points": 215,
    "commentCount": 58,
    "retryCount": 0,
    "time": 1699009722
  },
  {
    "id": 38127906,
    "title": "Observarea fără precedent a unui virus satelit care se agață de un bacteriofag ajutător: O nouă cale de supraviețuire",
    "originLink": "https://umbc.edu/stories/first-observed-virus-attaching-to-another/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38127906",
    "commentBody": "",
    "originSummary": [
      "Oamenii de știință de la Universitatea din Maryland, Baltimore County (UMBC) au observat pentru prima dată un virus satelit care se atașează în mod constant la un bacteriofag ajutător - un virus care infectează celulele bacteriene.",
      "În cadrul testelor efectuate pe 50 de sateliți ajutători, s-a constatat că 80% dintre aceștia aveau un satelit legat la gât.",
      "Echipa de la UMBC a descoperit un satelit unic, lipsit de orice genă de integrare, ceea ce sugerează că acesta își asigură supraviețuirea în interiorul gazdei prin atașarea la un ajutor, în loc să se integreze în ADN-ul celulei gazdă."
    ],
    "commentSummary": [
      "Oamenii de știință de la Universitatea din Maryland, Baltimore County (UMBC) au descoperit un virus satelit care se atașează în mod constant la un bacteriofag, care este un virus care infectează bacteriile.",
      "În cadrul testelor efectuate pe 50 de sateliți ajutători, 80% dintre aceștia au avut un satelit legat la gât, o observație inedită.",
      "Cercetătorii au descoperit un satelit care nu are nicio genă de integrare, ceea ce înseamnă că se atașează la un ajutor pentru a supraviețui în interiorul gazdei în loc să se integreze în ADN-ul celulei gazdă."
    ],
    "points": 209,
    "commentCount": 55,
    "retryCount": 0,
    "time": 1699015662
  },
  {
    "id": 38136314,
    "title": "Un juriu din California obligă Bayer la plata a 332 de milioane de dolari în procesul privind cancerul Roundup",
    "originLink": "https://fortune.com/2023/11/03/bayer-332-million-judgement-trial-man-cancer-decades-monsanto-roundup-weedkiller/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38136314",
    "commentBody": "",
    "originSummary": [
      "Un juriu din California i-a acordat lui Mike Dennis 332 de milioane de dolari într-un proces împotriva Monsanto, în prezent o divizie a companiei Bayer, susținând că forma sa rară de limfom non-Hodgkin a fost cauzată de utilizarea erbicidului Roundup de la Monsanto.",
      "Ingredientul activ din Roundup, glifosatul, se află în centrul procesului. O parte (7 milioane de dolari) din suma totală acordată lui Dennis acoperă daunele compensatorii, în timp ce cea mai mare parte (325 de milioane de dolari) se referă la daune punitive.",
      "Bayer, care se confruntă cu mii de reclamații similare legate de Roundup, intenționează să facă apel la verdict. Acest lucru urmează angajamentului Bayer din 2020 de până la 10,9 miliarde de dolari, pus deoparte pentru soluționarea a aproximativ 125.000 de reclamații."
    ],
    "commentSummary": [
      "Un juriu californian i-a acordat lui Mike Dennis 332 de milioane de dolari într-un proces împotriva Monsanto, acum parte a companiei Bayer, susținând că limfomul său non-Hodgkin rar a rezultat în urma deceniilor de utilizare a erbicidului Roundup de la Monsanto, în principal a ingredientului său, glifosatul.",
      "Suma acordată constă în 7 milioane de dolari în daune compensatorii și 325 de milioane de dolari în daune punitive. Cu toate acestea, Bayer intenționează să facă apel împotriva acestui verdict.",
      "Acest proces se numără printre miile de plângeri cu care Bayer s-a confruntat în legătură cu Roundup. În 2020, Bayer a alocat până la 10,9 miliarde de dolari pentru a soluționa aproximativ 125.000 de reclamații."
    ],
    "points": 203,
    "commentCount": 171,
    "retryCount": 0,
    "time": 1699053413
  },
  {
    "id": 38133963,
    "title": "Podman Desktop lansează versiunea 1.5: oferă ușurință în configurare, suport îmbunătățit pentru Kubernetes și experiență de utilizare îmbunătățită",
    "originLink": "https://podman-desktop.io/blog/podman-desktop-release-1.5",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38133963",
    "commentBody": "",
    "originSummary": [
      "Podman Desktop versiunea 1.5 a fost lansată, oferind diverse îmbunătățiri și funcții noi, cum ar fi o configurare ghidată de îmbarcare, o paletă de comenzi operate de la tastatură și suport pentru fișiere de mediu.",
      "Au fost efectuate mai multe modificări pentru a îmbunătăți experiența utilizatorului în ceea ce privește modificările de stare, zona de setări și API-ul de extensie. În plus, a fost adăugată o filă \"Summary\" extinsă pentru podurile Kubernetes.",
      "Echipa apreciază contribuțiile comunității la această versiune, încurajează utilizatorii să se implice prin verificarea depozitului GitHub, iar actualizarea este disponibilă pentru descărcare de pe site-ul lor."
    ],
    "commentSummary": [
      "A fost lansată versiunea 1.5 a Podman Desktop, care include noi adăugiri, cum ar fi o funcție de integrare pentru configurare, o paletă de comenzi de la tastatură, o filă \"Summary\" îmbunătățită pentru podurile Kubernetes și suport pentru fișierele de mediu.",
      "Experiența utilizatorului a fost, de asemenea, îmbunătățită pentru schimbările de stare și au fost aduse îmbunătățiri la zona de setări și la API-ul pentru extensii.",
      "Au fost implementate o serie de corecturi de erori și alte actualizări, cu recunoașterea contribuțiilor din partea comunității. Utilizatorii sunt încurajați să verifice depozitul GitHub pentru potențiale modalități de a contribui la perfecționări ulterioare."
    ],
    "points": 191,
    "commentCount": 85,
    "retryCount": 0,
    "time": 1699040343
  },
  {
    "id": 38130309,
    "title": "'ChatGPT-AutoExpert', bazat pe GPT-4 de la OpenAI, extinde capacitățile de interacțiune cu utilizatorul, navigare și recunoaștere sigură a imaginilor",
    "originLink": "https://github.com/spdustin/ChatGPT-AutoExpert/blob/main/_system-prompts/all_tools.md",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38130309",
    "commentBody": "",
    "originSummary": [
      "Documentul oferă orientări cuprinzătoare pentru un model lingvistic de mari dimensiuni, \"ChatGPT-AutoExpert\", dezvoltat de OpenAI, bazat pe arhitectura GPT-4, și include caracteristici precum recunoașterea imaginilor și instrumente de navigare.",
      "Există limitări specifice, care interzic modelului să divulge conținut sensibil din imagini ale unor persoane reale, cu instrucțiuni detaliate pentru crearea și reprezentarea imaginilor, de exemplu, utilizarea lui Dall-E.",
      "Accentul este pus pe restricțiile privind drepturile de autor, pe diversitate și pe incluziune, iar documentul face lumină și asupra modului în care funcționează diverse instrumente încorporate pentru a căuta și a găsi informații relevante pentru interogările utilizatorilor."
    ],
    "commentSummary": [
      "Ghidul se referă la un model lingvistic mare, \"ChatGPT-AutoExpert\", construit pe arhitectura GPT-4 de OpenAI, care încorporează recunoașterea imaginilor, instrumente de navigare și programare pentru a îmbunătăți comunicarea.",
      "Există reguli stricte pentru a împiedica modelul să dezvăluie detalii sensibile din imaginile unor persoane reale, completate de instrucțiuni detaliate adaptate la scenarii specifice și la comportamentele așteptate.",
      "De asemenea, oferă informații despre crearea și reprezentarea imaginilor cu ajutorul software-ului Dall-E, subliniind respectarea legilor privind drepturile de autor și importanța diversității și a incluziunii. De asemenea, sunt discutate diferite instrumente care ajută la căutarea de informații relevante pentru interogările utilizatorilor."
    ],
    "points": 191,
    "commentCount": 127,
    "retryCount": 0,
    "time": 1699025430
  },
  {
    "id": 38137373,
    "title": "MicroBlaze V de la AMD: Un procesor RISC-V modular și eficient pentru SoC-uri și FPGA-uri adaptive",
    "originLink": "https://www.xilinx.com/products/design-tools/microblaze-v.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38137373",
    "commentBody": "",
    "originSummary": [
      "AMD MicroBlaze V este un procesor IP RISC-V cu nucleu moale conceput pentru SoC-uri și FPGA-uri adaptive, care funcționează pe o arhitectură RISC-V de 32 de biți cu set de instrucțiuni (ISA).",
      "Procesorul este modular, suportând o varietate de extensii pentru sisteme integrate și este compatibil din punct de vedere hardware cu procesorul clasic MicroBlaze.",
      "Acesta se integrează complet cu instrumentele de proiectare Vivado și Vitis, permițând dezvoltatorilor să profite de ecosistemul software RISC-V cu sursă deschisă și să vizeze dispozitivele AMD adaptive SoC sau FPGA acceptate de Vivado Design Suite."
    ],
    "commentSummary": [
      "Procesorul AMD MicroBlaze™ V, bazat pe o arhitectură de set de instrucțiuni (ISA) RISC-V pe 32 de biți, este un procesor soft-core IP conceput pentru sistemele pe cipuri (SoC) și pentru rețelele de porți programabile pe teren (FPGA) AMD.",
      "MicroBlaze V oferă compatibilitate hardware cu procesorul clasic MicroBlaze și se integrează cu instrumentele de proiectare Vivado™ și Vitis™ de la AMD, facilitând astfel dezvoltarea.",
      "Acest procesor permite dezvoltatorilor să acceseze ecosistemul software RISC-V cu sursă deschisă și să vizeze orice SoC sau FPGA adaptiv AMD acceptat de Vivado Design Suite."
    ],
    "points": 188,
    "commentCount": 31,
    "retryCount": 0,
    "time": 1699063305
  },
  {
    "id": 38130870,
    "title": "Okta se confruntă cu o altă breșă de securitate, cu 5.000 de date ale angajaților furate de la un furnizor terț",
    "originLink": "https://arstechnica.com/security/2023/11/okta-hit-by-another-breach-this-one-stealing-employee-data-from-3rd-party-vendor/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38130870",
    "commentBody": "",
    "originSummary": [
      "Okta, o companie specializată în gestionarea identității și autentificării, a suferit o nouă breșă de securitate, intrușii obținând datele personale a aproximativ 5.000 de angajați de la un furnizor terț, Rightway Healthcare.",
      "Intruziunea, care a avut loc la sfârșitul lunii septembrie și a fost descoperită în octombrie, a inclus furtul de nume, numere de asigurări sociale și detalii despre planurile de asigurări de sănătate.",
      "În pofida gravității breșei, Okta susține că datele clienților săi nu au fost afectate, subliniind că încălcarea a urmat unui compromis anterior care a implicat sistemul de asistență pentru clienți."
    ],
    "commentSummary": [
      "Okta, furnizor de servicii de gestionare a identității și autentificării, a suferit o nouă breșă de securitate, care a dus la furtul datelor personale a 5.000 de angajați ai săi de la un furnizor terț, Rightway Healthcare.",
      "Încălcarea a avut loc la sfârșitul lunii septembrie, dar a fost descoperită abia în octombrie. Datele compromise conțineau nume, numere de asigurări sociale și numere de planuri de asigurări de sănătate.",
      "În ciuda încălcării securității datelor, datele clienților Okta nu au fost afectate. Acest incident vine după o încălcare anterioară în care sistemul de asistență pentru clienți al Okta a fost compromis."
    ],
    "points": 188,
    "commentCount": 85,
    "retryCount": 0,
    "time": 1699028113
  },
  {
    "id": 38133279,
    "title": "Curtea de Apel a refuzat în unanimitate imunitatea unui fost judecător pentru percheziție domiciliară ilegală",
    "originLink": "https://ij.org/press-release/victory-appeals-court-unanimously-denies-judicial-immunity-to-west-virginia-judge-who-personally-searched-home-ordered-items-removed/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38133279",
    "commentBody": "",
    "originSummary": [
      "Curtea de Apel a celui de-al patrulea circuit al SUA a dat dreptate lui Matthew Gibson împotriva fostei judecătoare de la tribunalul de familie Louise Goldston, stabilind că aceasta și-a depășit atribuțiile judiciare prin efectuarea unei percheziții fără mandat la domiciliul lui Gibson în plin divorț.",
      "Goldston s-a confruntat anterior cu cenzura, amenzile și condamnarea de către Înalta Curte din Virginia de Vest, ceea ce a dus la retragerea sa în timpul procedurii de punere sub acuzare.",
      "În ciuda pensionării lui Goldston, Gibson și Institutul pentru Justiție (o firmă de avocatură națională non-profit care protejează drepturile constituționale) au continuat procesul pentru a preveni încălcări similare și pentru a limita răspândirea doctrinei imunității judiciare."
    ],
    "commentSummary": [
      "Curtea de Apel a celui de-al patrulea circuit al Statelor Unite a decis în unanimitate împotriva fostului judecător al tribunalului de familie Louise Goldston, convenind că aceasta a efectuat o percheziție fără mandat la domiciliul lui Matthew Gibson în timpul unei proceduri de divorț, depășindu-și atribuțiile judiciare.",
      "Goldston, care fusese anterior cenzurat, amendat și condamnat de către Înalta Curte din Virginia de Vest, s-a retras pe fondul eforturilor de punere sub acuzare, dar Gibson și Institutul pentru Justiție (IJ), o firmă de avocatură națională non-profit care apără drepturile constituționale, au continuat procesul pentru a descuraja încălcări similare.",
      "Urmărirea de către Gibson și IJ a procesului împotriva lui Goldston, în pofida pensionării acesteia, are implicații potențiale asupra doctrinei imunității judiciare, care urmărește să prevină depășirea atribuțiilor de către judecători."
    ],
    "points": 181,
    "commentCount": 164,
    "retryCount": 0,
    "time": 1699037677
  },
  {
    "id": 38127203,
    "title": "Lucrătorii, în special cei mai tineri, sunt dispuși să facă sacrificii pentru o săptămână de lucru de patru zile, potrivit unui sondaj",
    "originLink": "https://www.cnbc.com/2023/11/01/what-young-people-would-give-up-for-a-4-day-workweek.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38127203",
    "commentBody": "",
    "originSummary": [
      "Un nou sondaj Bankrate indică faptul că 92% dintre lucrătorii tineri și 86% dintre lucrătorii mai în vârstă sunt dispuși să facă anumite compromisuri pentru a avea o săptămână de lucru de patru zile.",
      "Sacrificiile pe care acești lucrători sunt gata să le facă pot varia de la trecerea la munca în persoană și la un program de lucru mai lung, la lucrul în weekend sau seara și chiar la acceptarea unui salariu mai mic.",
      "Având în vedere că doar 15% dintre angajatorii din SUA oferă în prezent o săptămână de lucru de patru zile pentru beneficii de sănătate mintală începând cu 2023, aceasta reprezintă o zonă de creștere potențială și o oportunitate de schimbare a practicilor organizaționale."
    ],
    "commentSummary": [
      "Noul sondaj al Bankrate arată că 92% dintre lucrătorii tineri și 86% dintre lucrătorii mai în vârstă ar prefera o săptămână de lucru de patru zile, chiar dacă acest lucru necesită sacrificii precum ore mai lungi, muncă în weekend și reduceri salariale.",
      "De asemenea, sondajul arată o înclinație în rândul angajaților de a schimba locul de muncă sau de a reveni la munca în persoană pentru a respecta programul de patru zile.",
      "În ciuda interesului, doar 15% dintre angajatorii din SUA oferă o opțiune de patru zile pe săptămână pentru beneficiile de sănătate mintală, ceea ce sugerează o oportunitate nesatisfăcută pentru ca organizațiile să atragă și să păstreze talentele."
    ],
    "points": 174,
    "commentCount": 203,
    "retryCount": 0,
    "time": 1699011227
  }
]
