[
  {
    "id": 40088106,
    "title": "Zosnul známy filozof Daniel Dennett",
    "originLink": "https://dailynous.com/2024/04/19/daniel-dennett-death-1942-2024/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40088106",
    "commentBody": "",
    "originSummary": [
      "Zomrel významný filozof Daniel Dennett, ktorý svojou prácou v oblasti filozofie mysle a kognitívnej vedy výrazne ovplyvnil filozofickú komunitu.",
      "Dennett je spomínaný pre svoje príspevky k intencionalite, diskusie o slobodnej vôli a otvorený ateizmus, pričom sa na jeho počesť vyzdvihuje jeho charizma, humor a intelektuálny vplyv.",
      "Hoci sa jeho odchod považuje za významnú stratu, predpokladá sa, že jeho myšlienky a vplyv vo filozofii pretrvajú."
    ],
    "commentSummary": [
      "V texte sa rozoberá vplyv filozofa Daniela Dennetta na bezpečnosť a etiku umelej inteligencie, čo podnietilo diskusie v týchto oblastiach.",
      "Skúma pôvod a rast hackerskej kultúry, úlohu kognitívnej vedy v informatike a spojenie filozofie s disciplínami STEM.",
      "Diskusie sa týkajú významu filozofie pri chápaní poznatkov, hraníc vedy a interpretácií kvantovej mechaniky, pričom sa uvádzajú paralely medzi programovými jazykmi a filozofickými koncepciami."
    ],
    "points": 826,
    "commentCount": 392,
    "retryCount": 0,
    "time": 1713540821
  },
  {
    "id": 40085565,
    "title": "Spoločnosť Tesla vydáva stiahnutie cybervozidiel z trhu kvôli chybným pedálom akcelerátora",
    "originLink": "https://techcrunch.com/2024/04/19/tesla-cybertruck-throttle-accelerator-pedal-stuck/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40085565",
    "commentBody": "",
    "originSummary": [
      "Spoločnosť Tesla sťahuje 3 878 vozidiel Cybertrucks kvôli chybným pedálom akcelerátora, ktoré sa môžu zaseknúť, čo predstavuje pre vodičov riziko nehody.",
      "Toto stiahnutie prichádza po náročnom týždni, ktorý spoločnosť Tesla poznačilo prepúšťanie a odchod najvyšších manažérov.",
      "Spoločnosť rieši tento problém výmenou alebo opravou pedálov na súčasných vozidlách a výrobou nových vozidiel Cybertrucks s aktualizovaným dizajnom plynového pedálu."
    ],
    "commentSummary": [
      "Spoločnosť Tesla stiahla všetky vozidlá Cybertrucks z dôvodu chybného pedálu akcelerátora, ktorý vznikol neoprávnenou zmenou počas výroby, čo vyvolalo diskusiu o proaktívnych a reaktívnych bezpečnostných opatreniach.",
      "Diskusia sa točí okolo únavy pracovníkov, kultúry bezpečnosti spoločnosti Tesla, výrobných chýb a porúch komunikácie v technologických spoločnostiach.",
      "Zdôrazňuje význam správnej dokumentácie, schvaľovacích procesov a kontroly kvality v stavebníctve a automobilovom priemysle v podmienkach vyvíjajúcich sa výrobných procesov a riešenia problémov spojených so stiahnutím výrobkov z trhu."
    ],
    "points": 407,
    "commentCount": 529,
    "retryCount": 0,
    "time": 1713526938
  },
  {
    "id": 40089460,
    "title": "Quill v2: Prispôsobiteľný textový editor",
    "originLink": "https://quilljs.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40089460",
    "commentBody": "",
    "originSummary": [
      "Quill Rich Text Editor je bezplatný editor WYSIWYG s otvoreným zdrojovým kódom, ktorý je známy svojou modulárnou architektúrou a všestranným rozhraním API, ktoré vyhovuje rôznym potrebám prispôsobenia.",
      "Vďaka používateľsky prívetivému rozhraniu zabezpečuje konzistentný výkon na rôznych platformách a zároveň poskytuje podrobnú kontrolu nad obsahom, úpravami a udalosťami prostredníctvom rozhrania API.",
      "Quill je veľmi obľúbený, na GitHube má viac ako 37 000 hviezdičiek a dôverujú mu malé projekty aj spoločnosti z rebríčka Fortune 500."
    ],
    "commentSummary": [
      "Používatelia si pochvaľujú textový editor Quill v2 pre jeho používateľsky prívetivé rozhranie, ale niektorí z nich uvažujú o prechode na ProseMirror pre pokročilejšie funkcie prispôsobenia, a to napriek náročnej krivke učenia.",
      "Diskusie sa točia okolo rôznych textových editorov, ako sú Quill, ProseMirror a TinyMCE, pričom sa zdôrazňuje dôležitosť jasnej dokumentácie a filozofie projektu pre hladšie používanie.",
      "Niektorí používatelia odporúčajú ProseMirror pre jeho flexibilitu a možnosti, čo vyvolalo diskusie o uplatnení Quill v zdravotníctve a jeho prijatí veľkými technologickými firmami, ako je Microsoft."
    ],
    "points": 352,
    "commentCount": 71,
    "retryCount": 0,
    "time": 1713547049
  },
  {
    "id": 40091622,
    "title": "Prihláška do Y Combinator pre S24 - uzávierka 22. apríla",
    "originLink": "https://news.ycombinator.com/item?id=40091622",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40091622",
    "commentBody": "",
    "originSummary": [
      "Y Combinator (YC) vyzýva jednotlivcov, aby sa prihlásili, a zdôrazňuje, že pochybnosti o pripravenosti alebo načasovaní by ich nemali odradiť.",
      "YC vyhľadáva potenciálnych zakladateľov a poskytuje poradenstvo pri orientácii vo svete startupov.",
      "Uzávierka prihlášok pre YC je 22. apríla o 20.00 h SEČ a rozhodnutia sa očakávajú do 29. mája."
    ],
    "commentSummary": [
      "Rozhovor sa zameriava na proces podávania žiadostí o členstvo v Y Combinator (YC) vrátane výziev, výhod a mylných predstáv o kritériách prijatia.",
      "Zakladateľské vlastnosti, ako je odhodlanie a vynaliezavosť, sú v podnikaní kľúčové, najmä pri budovaní úspešných podnikov prostredníctvom netradičných vzdelávacích ciest.",
      "Medzi zdôrazňované témy patrí rozmanitosť, etika, osobná spokojnosť a dôležitosť pomalého, ziskového rastu v startupoch, ako aj diskusie o predsudkoch rizikového kapitálu, rovnováhe pri realizácii nápadov a postupoch pri podávaní žiadostí o YC."
    ],
    "points": 243,
    "commentCount": 297,
    "retryCount": 0,
    "time": 1713558816
  },
  {
    "id": 40086779,
    "title": "Mastering Programming with C++: Stroustrup's Latest Edition",
    "originLink": "https://www.stroustrup.com/programming.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40086779",
    "commentBody": "",
    "originSummary": [
      "\"Programovanie: Bjarne Stroustrup: Princípy a prax v C++ (3. vydanie)\" je úvodná kniha pre začiatočníkov a skúsených programátorov, ktorí chcú zlepšiť svoje programátorské zručnosti.",
      "V knihe sa rozoberajú základné koncepty programovania, kladie sa dôraz na písanie efektívneho a udržiavateľného kódu a využívajú sa moderné štandardy jazyka C++, ako sú C++20 a C++23.",
      "Zahŕňa procedurálne, objektovo orientované a generické programovanie, ako aj praktické techniky programovania, funkcie jazyka a knižnice nevyhnutné pre reálne aplikácie."
    ],
    "commentSummary": [
      "Diskusia o 3. vydaní knihy \"Programovanie: Princípy a prax v C++\" kritizuje riadok \"import std;\" v prvom programe a vyjadruje obavy zo zmätku pre začiatočníkov a z nutnosti zostavovania systémov.",
      "Rozhovory sa rozširujú na vývoj grafického rozhrania pomocou QT s Meta Object Compiler a Qt Creator, pričom sa diskutuje o kódovacích nástrojoch, knižniciach, konvenciách pomenovania a dôležitosti vlastnej dokumentácie kódu.",
      "Diskutuje sa o preferenciách jazykov ako C++, Python, Rust a Swift, ako aj o zdrojoch na učenie, moderných postupoch, nutnosti učiť sa C++ pre pokročilý vývoj, problémoch s výkonom a alternatívach na prekonanie obmedzení jazyka."
    ],
    "points": 233,
    "commentCount": 193,
    "retryCount": 0,
    "time": 1713534322
  },
  {
    "id": 40085543,
    "title": "Efektívne štruktúrovanie domovského adresára: Tipy a triky",
    "originLink": "https://unixdigest.com/tutorials/tips-on-how-to-structure-your-home-directory.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40085543",
    "commentBody": "",
    "originSummary": [
      "Efektívne štruktúrujte adresár $HOME usporiadaním podľa kategórií a dátumov a použitím systému Git pre súbory s bodkami.",
      "Správa prípojných bodov, konfiguračných súborov a ukladania údajov pomocou skriptov shellu, súborov údajov ZFS a techník šifrovania na lepšiu organizáciu.",
      "Dôraz na stratégie zálohovania, bezpečnosť údajov, prehľadnú organizáciu súborov a pravidelnú údržbu s cieľom zvýšiť produktivitu a zlepšiť nastavenie."
    ],
    "commentSummary": [
      "V článku sa kladie dôraz na efektívnu organizáciu domovského adresára s cieľom zvýšiť produktivitu a zabrániť neporiadku, pričom sa navrhujú metódy ako konvencia XDG a vytváranie samostatných priečinkov pre osobné súbory.",
      "Používatelia diskutujú o rôznych stratégiách organizácie súborov, systémoch zálohovania a metódach ukladania, pričom zdôrazňujú význam personalizovaných riešení pre efektívne pracovné postupy.",
      "Hlavným cieľom je zefektívniť správu súborov, zlepšiť dostupnosť a zabrániť strate údajov prostredníctvom prispôsobených a štruktúrovaných prístupov."
    ],
    "points": 215,
    "commentCount": 152,
    "retryCount": 0,
    "time": 1713526795
  },
  {
    "id": 40088751,
    "title": "Vývoj Monkey Island: Odhalená kliatba",
    "originLink": "https://www.filfre.net/2024/04/the-curse-of-monkey-island/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40088751",
    "commentBody": "",
    "originSummary": [
      "Článok sa venuje dejovým zvratom a prekvapivému záveru hry Monkey Island 2, ktorý pripravil pôdu pre populárny tretí diel The Curse of Monkey Island.",
      "Napriek počiatočnej neochote si hra zachovala humor a šarm pôvodnej série a plynule ho spojila s novými technologickými prvkami.",
      "Hra získala uznanie za pôsobivý vizuál, strhujúcu hrateľnosť a pokračovanie obľúbenej série, čo znamenalo posun k modernej technológii spoločnosti LucasArts."
    ],
    "commentSummary": [
      "Fanúšikovia diskutujú o rôznych aspektoch série videohier Monkey Island, napríklad o zobrazení žien, mechanikách riešenia hádaniek, vývoji herného dizajnu a prijatí konkrétnych dielov, ako sú The Curse of Monkey Island a Secret of Monkey Island.",
      "Ocenené bolo výtvarné spracovanie, humor a príbeh hry, pričom sa objavili určité obavy týkajúce sa vývoja estetiky a úrovní obtiažnosti.",
      "V rozhovore sme sa dotkli aj vplyvu herných príručiek a nostalgie za klasickými dobrodružnými hrami, ako je Loom."
    ],
    "points": 208,
    "commentCount": 92,
    "retryCount": 0,
    "time": 1713543917
  },
  {
    "id": 40089609,
    "title": "Zlepšenie konektivity: Viaccestný protokol TCP prichádza do Linuxu",
    "originLink": "https://www.mptcp.dev/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40089609",
    "commentBody": "",
    "originSummary": [
      "Viaccestný protokol TCP (MPTCP) rozširuje štandardný protokol TCP a umožňuje zariadeniam využívať viacero rozhraní súčasne na odosielanie a prijímanie paketov TCP prostredníctvom jedného pripojenia.",
      "MPTCP agreguje šírku pásma, uprednostňuje cesty s nižšou latenciou a v prípade zlyhania plynule presúva cesty, čo sa zisťuje prostredníctvom dodatočných možností v hlavičkách TCP a na čo dohliada správca ciest a plánovač paketov.",
      "Podporuje rôzne typy správy ciest, možnosti zásuviek a funkcie ladenia, ktoré udržiava komunita MPTCP prostredníctvom nástrojov, ako je démon MPTCP a Packetdrill."
    ],
    "commentSummary": [
      "Viaccestný protokol TCP (MPTCP) pre Linux sa v poslednom desaťročí zavádzal pomaly, čo sa pripisovalo zložitosti implementácie na skutočných serveroch a problémom s middleboxom.",
      "Úsilie sa zameriava na zvýšenie výkonnosti siete pomocou viacerých ciest na prenos dát s inovatívnymi riešeniami, ako sú ECMP, Maglev, QUIC a MPQUIC.",
      "Diskusie sa týkajú obmedzení protokolov TCP a UDP, prísľubu QUIC pre výkon UDP, úlohy SCTP v telekomunikačných sieťach a WebRTC, výhod MPTCP v rôznych systémoch a prebiehajúcich diskusií o bezpečnosti, ochrane súkromia a dôsledkoch pripojenia."
    ],
    "points": 189,
    "commentCount": 76,
    "retryCount": 0,
    "time": 1713547725
  },
  {
    "id": 40086571,
    "title": "Súkromný vyhľadávač DuckDuckGo s AI Chat a ďalšie",
    "originLink": "https://duckduckgo.com/?q=DuckDuckGo&ia=chat",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40086571",
    "commentBody": "",
    "originSummary": [
      "DuckDuckGo poskytuje skratky na vyhľadávanie na rôznych lokalitách, ako sú obrázky, videá, správy, mapy a nakupovanie, pričom kladie dôraz na súkromie a ponúka chat s umelou inteligenciou, témy a možnosti prehliadača.",
      "Vyhľadávač si cení súkromie a poskytuje používateľom zdroje na lepšie pochopenie svojich služieb, ktoré sú k dispozícii na viacerých platformách.",
      "DuckDuckGo vyniká svojím záväzkom k ochrane súkromia a používateľsky prívetivými funkciami, ako sú témy a chat s umelou inteligenciou, vďaka čomu je obľúbenou voľbou medzi používateľmi, ktorí dbajú na ochranu súkromia."
    ],
    "commentSummary": [
      "Diskusia sa zaoberá využívaním umelej inteligencie vo vyhľadávačoch, najmä v DuckDuckGo, pričom používatelia sa delia o rôzne názory na výhody a nevýhody výsledkov vyhľadávania poháňaných umelou inteligenciou.",
      "Objavili sa obavy o súkromie, zdieľanie údajov a spoľahlivosť funkcií chatu s umelou inteligenciou, čo vyvolalo diskusie o používaní služieb tretích strán, ako je Bing, a o obchodných stratégiách spoločností zameraných na umelú inteligenciu.",
      "Používatelia sa rozchádzajú v názoroch na účinnosť algoritmov umelej inteligencie pri vytváraní výsledkov vyhľadávania a na rozsah zabezpečenia ochrany súkromia, ktoré poskytuje DuckDuckGo, čo zdôrazňuje problém zosúladenia pokroku v oblasti umelej inteligencie s ochranou súkromia v technológii vyhľadávačov."
    ],
    "points": 183,
    "commentCount": 153,
    "retryCount": 0,
    "time": 1713533267
  },
  {
    "id": 40087063,
    "title": "Vyhodený zamestnanec spoločnosti Google vyzýva na pokračovanie protestov",
    "originLink": "https://www.thehandbasket.co/p/google-worker-fired-protest-israel-project-nimbus",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40087063",
    "commentBody": "",
    "originSummary": [
      "Spoločnosť Google prepustila 28 zamestnancov na čele s Hasanom Ibraheemom za protest proti zmluve s Izraelom v hodnote 1,2 miliardy dolárov, čo vyvolalo obvinenia z odvetných opatrení.",
      "Prepustení zamestnanci sa napriek hrozbám a zatknutiam postavili na odpor, čím zdôraznili význam vyjadrovania sa proti kontroverzným projektom.",
      "Ibraheem sa zasadzuje za neustálu podporu a protest proti spoločnostiam, ktoré sa zúčastňujú na sporných aktivitách, a zdôrazňuje, že je dôležité zaujať stanovisko."
    ],
    "commentSummary": [
      "Diskusia sa točí okolo zamestnanca spoločnosti Google, ktorý bol prepustený za to, že namietal proti zmluve spoločnosti s Izraelom, a poukazuje na problém zosúladenia osobného presvedčenia s profesionálnym pracovným prostredím.",
      "Rozoberá vplyv protestov na pracovisku, úlohu demokracie v obchodných a osobných vzťahoch a zložitosť politického aktivizmu a vyjadrovania nepopulárnych názorov.",
      "Okrem toho sa dotýka etických aspektov pri obchodovaní s kontroverznými vládami, vývoja akceptácie aktivizmu zo strany verejnosti a pretrvávajúcich preventívnych opatrení COVID-19, ako je nosenie masiek na protestoch."
    ],
    "points": 182,
    "commentCount": 307,
    "retryCount": 0,
    "time": 1713535946
  },
  {
    "id": 40092449,
    "title": "Valkey naberá na sile oproti Redisu",
    "originLink": "https://devops.com/valkey-is-rapidly-overtaking-redis/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40092449",
    "commentBody": "",
    "originSummary": [
      "Databáza Redis čelila zmenám v licenciách, ktoré vyvolali nespokojnosť vývojárov a používateľov, čo viedlo k vytvoreniu forku s názvom Valkey.",
      "Valkey získal významnú podporu od významných spoločností a správcov, čo spôsobilo výrazný odklon od Redisu a podporu od hlavných hráčov, ako sú AWS, Google Cloud a Oracle.",
      "Redis sa stretáva s problémami, pretože špičkoví zákazníci migrujú na Valkey, čo vyvoláva neistotu o jeho budúcnosti v dôsledku výrazného posunu záujmu databázového odvetvia na základe empirických údajov."
    ],
    "commentSummary": [
      "Zameriava sa na Valkey, ktorý získava popularitu ako alternatíva k Redisu v súvislosti s obavami o udržateľnosť riadenia a open source projektu Redis Labs.",
      "Diskusie sa týkajú výziev pri komercializácii softvéru s otvoreným zdrojovým kódom, vplyvu licencií na prispievateľov a podniky a významu dôvery komunity v takéto projekty.",
      "Spomínanie historických prípadov, ako sú Jenkins a Oracle, spolu s porovnávaním s úspešnými spoločnosťami založenými na softvéri s otvoreným zdrojovým kódom, zdôrazňuje dôležitosť údržby a bezpečnosti softvéru, spolu s možným rozdelením komunity z forkov, ako sú Redict a Valkey."
    ],
    "points": 176,
    "commentCount": 69,
    "retryCount": 0,
    "time": 1713564500
  },
  {
    "id": 40093263,
    "title": "Skúmanie transakcií Bitcoin a štýlovania CSS na webových stránkach",
    "originLink": "https://mempool.space/block/0000000000000000000320283a032748cef8227873ff4872689bf23f1cda83a5",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40093263",
    "commentBody": "",
    "originSummary": [
      "Text sa zaoberá vlastnosťami štýlov CSS pre prvky webovej stránky, ako sú štýly písma, animácie a úpravy responzívneho dizajnu.",
      "Venuje sa aj témam týkajúcim sa Bitcoinu, ako sú transakcie, ťažobné pooly, podrobnosti o blokoch, transakčné poplatky a technické údaje o blockchaine.",
      "Spomína webovú stránku s názvom InClassicBlueMattwiz, ktorá poskytuje zdroje na preskúmanie ekosystému Bitcoinu, ako sú panely na ťažbu a dokumentácia API."
    ],
    "commentSummary": [
      "Diskusie sa týkajú rôznych tém súvisiacich s Bitcoinom, ako je ťažba, vplyv na životné prostredie, zabezpečenie proti inflácii, vplyv sankcií a hrozba 51 % útoku na sieť.",
      "Účastníci diskutujú o rôznych prístupoch k ťažbe, spotrebe energie, úlohe Bitcoinu vo vojne, vládnom dohľade a prekážkach prijatia kryptomeny v oblastiach s obmedzeným pripojením na internet.",
      "Rozhovory zdôrazňujú zložitú povahu a kompromisy v sektore kryptomien, ktoré ovplyvňujú globálnu ekonomiku a geopolitiku."
    ],
    "points": 175,
    "commentCount": 328,
    "retryCount": 0,
    "time": 1713572049
  },
  {
    "id": 40085237,
    "title": "C-Macs: Ľahká aplikácia pre macOS napísaná v čistom jazyku C",
    "originLink": "https://github.com/CodaFi/C-Macs",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40085237",
    "commentBody": "",
    "originSummary": [
      "C-Macs je aplikácia Cocoa vytvorená výlučne v jazyku C bez Nibs alebo Objective-C, ktorá spotrebuje menej ako 1,5 MB pamäte.",
      "Aplikácia zobrazuje červený štvorec pomocou Core Graphics, nemá licenciu a obsahuje upozornenie, že ju používatelia používajú na vlastné riziko.",
      "Napriek známym chybám a obmedzeniam sa softvér plánuje prepracovať tak, aby podporoval staršie verzie operačného systému a architektúry iné ako Intel."
    ],
    "commentSummary": [
      "Príspevok sa zaoberá vytvorením aplikácie pre macOS v čistom jazyku C a pohľadom vývojára na obmedzenia a hľadiská, pričom chváli projekt za prijatie hackerského étosu a použitie netradičných metód, ako sú objc_msgSend, CoreGraphics a Carbon.",
      "Medzi preberané témy patrí rozhranie Win32 API, aplikácie s grafickým rozhraním, rôzne programovacie jazyky, využitie pamäte a dôležitosť vytvárania aplikácií pre MacOS pomocou pokročilejších jazykov.",
      "Používatelia sa podelia o anekdoty týkajúce sa Objective-C, vývoja softvéru pre Mac a Unixové systémy, vývoja OS, ako aj riešenia licenčných problémov, autorských práv a licencie GPL."
    ],
    "points": 170,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1713524028
  },
  {
    "id": 40085260,
    "title": "Profesor univerzity Tsinghua objavil chybu v kvantovom algoritme pre LWE",
    "originLink": "http://www.chenyilei.net/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40085260",
    "commentBody": "",
    "originSummary": [
      "Yilei Chen, odborný asistent na Tsinghua University, získal doktorát z kryptografie na Bostonskej univerzite a venuje sa kvantovým algoritmom pre mriežkové problémy.",
      "Chyba objavená v jednom z jeho algoritmov na riešenie LWE ho podnietila k aktualizácii jeho výskumu, pričom zvyšok práce zostal nedotknutý, aby sa zachovala hodnota jeho myšlienok pre budúce použitie.",
      "Chen príležitostne zdieľa komiksové ukážky týkajúce sa kryptografie a spravuje stránku Github, na ktorej prezentuje svoju prácu."
    ],
    "commentSummary": [
      "Autor objavil a otvorene riešil chybu v dokumente o kvantovom algoritme týkajúcu sa mriežkových problémov, ktorá by mohla mať vplyv na kryptografiu.",
      "Reakcia na chybu bola pozitívna, chválila sa transparentnosť a priebežné príspevky k výskumu, ktoré poukazujú na zodpovednosť a odhodlanie v rámci komunity.",
      "Zdôraznili sa odborné znalosti a skúsenosti osôb, ktoré sa podieľali na identifikácii a oprave chyby, čím sa zdôraznila dôležitosť zručností v oblasti kvantovej výpočtovej techniky."
    ],
    "points": 150,
    "commentCount": 20,
    "retryCount": 0,
    "time": 1713524293
  }
]
