[
  {
    "id": 40918052,
    "title": "Google Chrome memiliki API tersembunyi khusus yang hanya dapat diakses dari *.google.com",
    "originLink": "https://twitter.com/lcasdev/status/1810696257137959018",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40918052",
    "commentBody": "",
    "originSummary": [
      "Google Chrome menyediakan semua situs *.google.com dengan akses luas ke penggunaan CPU, GPU, dan memori sistem dan tab, serta informasi prosesor yang terperinci dan saluran balik pencatatan.",
      "API ini hanya dapat diakses oleh situs *.google.com, yang menimbulkan kekhawatiran privasi dan keamanan di kalangan pengguna dan pengembang."
    ],
    "commentSummary": [
      "Google Chrome memiliki API tersembunyi yang hanya dapat diakses dari *.google.com, kemungkinan digunakan untuk Google Meet, yang menyediakan informasi sistem terperinci seperti penggunaan CPU/GPU/RAM.",
      "Eksklusivitas ini menimbulkan kekhawatiran tentang perilaku anti-persaingan dan privasi pengguna, karena situs web lain tidak dapat mengakses informasi ini.",
      "API ini dibangun ke dalam Chrome dan tidak terdaftar di chrome://extensions, memicu perdebatan tentang etika dan legalitas praktik semacam itu."
    ],
    "points": 438,
    "commentCount": 183,
    "retryCount": 0,
    "time": 1720542911
  },
  {
    "id": 40911637,
    "title": "Rye: Pengalaman Python Tanpa Repot",
    "originLink": "https://rye.astral.sh/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40911637",
    "commentBody": "",
    "originSummary": [
      "Rye adalah solusi manajemen proyek dan paket yang komprehensif untuk Python, menawarkan pengalaman terpadu untuk mengelola instalasi Python, proyek, dependensi, dan lingkungan virtual.",
      "Itu mendukung proyek-proyek kompleks, monorepos (repositori yang berisi beberapa proyek), dan instalasi alat global, menjadikannya serbaguna untuk berbagai kebutuhan pengembangan.",
      "Kegiatan instalasi cukup sederhana, dengan instruksi khusus yang disediakan untuk Linux, macOS, dan Windows, serta opsi untuk mengompilasi dari sumber menggunakan Rust dan Cargo."
    ],
    "commentSummary": [
      "Kentang adalah alat pengemasan Python yang sekarang mendukung resolusi 'universal', memungkinkan pembuatan file requirements.txt yang terkunci yang berfungsi di semua platform dan sistem operasi.",
      "Rye menggunakan alat uv di balik layar, yang telah ditingkatkan untuk mendukung fitur resolusi universal ini, membuat manajemen dependensi lebih teratur dan efisien.",
      "Pengguna telah melaporkan transisi yang berhasil dari alat lain seperti Poetry ke Rye, terutama untuk proyek kompleks yang melibatkan dependensi seperti PyTorch, karena kemampuan resolusi yang ditingkatkan dari Rye."
    ],
    "points": 421,
    "commentCount": 271,
    "retryCount": 0,
    "time": 1720487895
  },
  {
    "id": 40915082,
    "title": "PySkyWiFi: Wi-Fi gratis yang bodoh di penerbangan jarak jauh",
    "originLink": "https://robertheaton.com/pyskywifi/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40915082",
    "commentBody": "",
    "originSummary": [
      "PySkyWiFi adalah sebuah alat yang memanfaatkan celah dalam sistem Wi-Fi di dalam penerbangan dengan menggunakan akun airmiles untuk menyalurkan data internet, memberikan akses internet gratis pada penerbangan jarak jauh.",
      "Alat ini beroperasi dengan dua komponen: sebuah proxy langit di pesawat dan sebuah daemon darat, yang memproses permintaan dan tanggapan HTTP melalui akun airmiles.",
      "Pengembang berhasil menguji PySkyWiFi untuk pesan instan, pembaruan langsung, dan akses internet penuh, menunjukkan potensinya untuk melewati biaya Wi-Fi dalam penerbangan."
    ],
    "commentSummary": [
      "Pengguna mengenang trik kreatif dengan perangkat Kindle lama, seperti menggunakan Google Voice untuk mengirim pesan teks dan menampilkan pesan di layar beranda.",
      "Diskusi mencakup pertimbangan etis dan nostalgia terhadap trik teknologi lama, seperti melewati layanan Wi-Fi berbayar dan menggunakan tunneling DNS untuk mengakses internet.",
      "Percakapan tersebut menyoroti kecerdikan dan akal pengguna dalam menemukan solusi akses internet gratis, memicu perdebatan tentang etika dan kepraktisan metode tersebut."
    ],
    "points": 407,
    "commentCount": 219,
    "retryCount": 0,
    "time": 1720526497
  },
  {
    "id": 40909076,
    "title": "DB Browser for SQLite (Windows, macOS, dan Sebagian Besar Versi Linux)",
    "originLink": "https://sqlitebrowser.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40909076",
    "commentBody": "",
    "originSummary": [
      "DB Browser for SQLite (DB4S) adalah alat sumber terbuka berkualitas tinggi yang bersifat visual untuk mengelola file database SQLite, dengan antarmuka mirip spreadsheet dan kemampuan kueri SQL penuh.",
      "Versi resmi saat ini adalah 3.12.2, dengan kandidat rilis 3.13.x-rc1 yang tersedia, dan build harian bagi mereka yang mencari fitur terbaru, meskipun mungkin tidak stabil.",
      "DB4S mendukung pembuatan, pengeditan, dan pengelolaan file database, tabel, dan catatan, serta mengimpor/mengekspor data dan mengeluarkan kueri SQL, menjadikannya alat yang serbaguna untuk manajemen database."
    ],
    "commentSummary": [
      "DB Browser for SQLite, tersedia di Windows, macOS, dan Linux, ditampilkan di Hacker News, dengan versi stabil baru yang akan segera diumumkan oleh pemelihara lucydodo.",
      "Pengguna memuji perangkat lunak tersebut karena kemudahan penggunaannya, terutama dalam menangani file CSV berukuran besar, dan membandingkannya secara positif dengan alat lain seperti DBeaver dan SQLiteStudio.",
      "Komunitas membahas fitur-fitur yang diinginkan seperti dukungan STRICT dan lisensi offline, serta mengungkapkan rasa terima kasih atas pentingnya alat tersebut dalam aplikasi seperti permainan kompetitif dan pengembangan."
    ],
    "points": 332,
    "commentCount": 56,
    "retryCount": 0,
    "time": 1720469283
  },
  {
    "id": 40908878,
    "title": "Anna's Archive Menghadapi Kerugian Jutaan dan Perintah Permanen",
    "originLink": "https://torrentfreak.com/annas-archive-faces-millions-in-damages-and-a-permanent-injunction-240708/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40908878",
    "commentBody": "",
    "originSummary": [
      "Anna's Archive, sebuah mesin pencari perpustakaan bajakan, menghadapi kerugian finansial dan perintah permanen di pengadilan AS setelah tidak menanggapi gugatan oleh OCLC.",
      "Klaim hukum ini berasal dari pengambilan data dan publikasi daring basis data WorldCat milik OCLC, dengan OCLC mengklaim kerugian lebih dari $5 juta dan mencari putusan default serta bantuan injunksi.",
      "Meskipun ada masalah hukum, Arsip Anna telah beralih ke domain .GS yang baru, menyulitkan upaya penegakan hukum terhadap situs tersebut."
    ],
    "commentSummary": [
      "Anna's Archive menghadapi gugatan dengan klaim kerugian jutaan dan perintah permanen karena dugaan serangan siber, terutama melalui web scraping.",
      "Organisasi OCLC mengklaim telah mengalami kerugian lebih dari $5 juta, termasuk biaya untuk peningkatan perangkat keras, kontrak Cloudflare, dan gaji untuk karyawan yang menangani serangan tersebut.",
      "Kasus ini menimbulkan pertanyaan tentang apakah web scraping merupakan serangan siber dan implikasi yang lebih luas untuk praktik pengambilan data, termasuk dampak potensial pada pelatihan AI dan industri lainnya."
    ],
    "points": 288,
    "commentCount": 164,
    "retryCount": 0,
    "time": 1720468351
  },
  {
    "id": 40908521,
    "title": "Admin Z-Library 'melarikan diri dari tahanan rumah' setelah hakim menyetujui ekstradisi ke AS",
    "originLink": "https://torrentfreak.com/z-library-admins-escape-house-arrest-after-judge-approves-u-s-extradition-240708/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40908521",
    "commentBody": "",
    "originSummary": [
      "Dua operator Z-Library yang diduga, Anton Napolsky dan Valeriia Ermakova, melarikan diri dari tahanan rumah di Argentina setelah mengajukan permohonan status pengungsi politik.",
      "Mereka menghadapi ekstradisi ke AS atas tuduhan termasuk pelanggaran hak cipta kriminal, penipuan melalui kawat, dan pencucian uang.",
      "Kementerian Kehakiman AS dan FBI mulai menyita domain Z-Library pada November 2022, dan surat perintah penangkapan internasional telah dikeluarkan untuk pasangan tersebut, yang keberadaannya saat ini tidak diketahui."
    ],
    "commentSummary": [
      "Administrator Z-Library dilaporkan telah \"melarikan diri dari tahanan rumah\" setelah seorang hakim menyetujui ekstradisi mereka ke AS.",
      "Mereka menghadapi tuduhan pencucian uang, kemungkinan berasal dari penggunaan donasi pengguna untuk mendanai situs tersebut, yang dianggap sebagai pencucian uang menurut hukum AS.",
      "Kasus ini menyoroti sifat agresif dari penuntutan federal dan memunculkan perdebatan etis dan hukum tentang perpustakaan bayangan seperti Z-Library."
    ],
    "points": 243,
    "commentCount": 200,
    "retryCount": 0,
    "time": 1720466341
  },
  {
    "id": 40917312,
    "title": "Router Linksys Velop mengirimkan kata sandi Wi-Fi dalam teks biasa ke server di AS",
    "originLink": "https://stackdiary.com/linksys-velop-routers-send-wi-fi-passwords-in-plaintext-to-us-servers/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40917312",
    "commentBody": "",
    "originSummary": [
      "Testaankoop, Asosiasi Konsumen Belgia, menemukan bahwa router Linksys Velop Pro 6E dan Velop Pro 7 mengirimkan detail login Wi-Fi dalam teks biasa ke server Amazon di AS, yang menimbulkan risiko keamanan yang signifikan.",
      "Meskipun ada peringatan pada bulan November, Linksys belum mengambil langkah-langkah efektif untuk mengatasi masalah ini, yang dapat menyebabkan potensi serangan Man-In-The-Middle (MITM).",
      "Testaankoop menyarankan untuk mengubah nama dan kata sandi Wi-Fi melalui antarmuka web dan merekomendasikan untuk tidak membeli router ini karena kerentanan keamanan."
    ],
    "commentSummary": [
      "Router Linksys Velop mengirimkan kata sandi Wi-Fi dalam teks biasa ke server AS, menyebabkan kekhawatiran keamanan yang signifikan di kalangan pengguna.",
      "Meskipun telah dilaporkan pada bulan November, tidak ada langkah efektif yang diambil untuk mengatasi masalah ini, mendorong diskusi tentang praktik serupa oleh ISP dan produsen router lainnya.",
      "Kondisi ini menekankan perlunya peningkatan keamanan dan transparansi dalam perangkat jaringan konsumen, dengan beberapa pihak merekomendasikan firmware sumber terbuka seperti OpenWRT untuk mengurangi kerentanan semacam itu."
    ],
    "points": 242,
    "commentCount": 91,
    "retryCount": 0,
    "time": 1720539209
  },
  {
    "id": 40909327,
    "title": "Membuat cincin pernikahan saya sendiri",
    "originLink": "https://geoff.greer.fm/2024/07/07/making-my-own-wedding-rings/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40909327",
    "commentBody": "",
    "originSummary": [
      "Penulis memutuskan untuk membuat cincin pernikahan mereka sendiri menggunakan metode pengecoran PLA yang hilang, terinspirasi oleh video Nile Red tentang emas ungu.",
      "Kegiatan tersebut melibatkan pencetakan 3D, pembuatan cetakan plester, dan menuangkan logam cair, dengan uji coba awal menggunakan perak murni dan kemudian mencampur perak dengan emas.",
      "Setelah beberapa kali mencoba dan melakukan penyesuaian, penulis berhasil menciptakan cincin yang unik dan tampak profesional, menghabiskan enam akhir pekan dan sekitar $3.500 untuk proyek tersebut."
    ],
    "commentSummary": [
      "Kami berbagi pengalaman membuat cincin pernikahan sendiri menggunakan baja tahan karat dan mesin bubut, menyoroti daya tahan dan makna pribadi cincin tersebut selama hampir 20 tahun.",
      "Kami membahas berbagai metode dan bahan untuk cincin pernikahan DIY, seperti titanium, emas, dan perak, dengan pengguna berbagi tips dan anekdot pribadi tentang proses pembuatan cincin mereka.",
      "Kirimannya menekankan nilai sentimental dan pengalaman unik dalam membuat cincin kawin khusus, dengan banyak pengguna mencatat kenangan abadi dan sentuhan pribadi yang terlibat dalam proses tersebut."
    ],
    "points": 232,
    "commentCount": 112,
    "retryCount": 0,
    "time": 1720470548
  },
  {
    "id": 40912684,
    "title": "Kekeliruan zombie dalam ilmu komputer teoretis",
    "originLink": "https://scottaaronson.blog/?p=8106",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40912684",
    "commentBody": "",
    "originSummary": [
      "Posting blog Scott Aaronson menjelaskan kesalahpahaman umum dalam ilmu komputer teoretis, khususnya perbedaan antara keterhitungan dan kompleksitas.",
      "Dia menggunakan contoh-contoh, seperti fungsi yang menentukan keberadaan Tuhan, untuk mengilustrasikan bahwa keterhitungan berkaitan dengan fungsi, bukan pertanyaan individu, dan membahas kesalahpahaman tentang masalah P vs. NP.",
      "Aaronson menjelaskan bahwa keterhitungan berkaitan dengan keberadaan sebuah program untuk memetakan input ke output, bukan kesulitan dalam membuat program tersebut, dan membahas fungsi Busy Beaver untuk menyoroti nilai-nilai yang tidak dapat dihitung versus yang dapat dihitung."
    ],
    "commentSummary": [
      "Ilmu komputer teoretis sering berurusan dengan konsep-konsep yang melibatkan ketakterhinggaan, membuatnya tidak intuitif, seperti kompleksitas Kolmogorov dan masalah penghentian.",
      "P=NP tetap menjadi perdebatan filosofis, dengan beberapa orang membandingkan kompleksitasnya dengan hipotesis kontinuum (CH).",
      "Perbedaan antara keterhitungan dan keterbuktian ditekankan, menunjukkan bahwa sebuah fungsi dapat dihitung meskipun implementasi tepatnya saat ini belum ditentukan."
    ],
    "points": 203,
    "commentCount": 164,
    "retryCount": 0,
    "time": 1720501627
  },
  {
    "id": 40913915,
    "title": "Xandr milik Microsoft memberikan hak GDPR dengan tingkat 0%",
    "originLink": "https://noyb.eu/en/microsofts-xandr-grants-gdpr-rights-rate-0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40913915",
    "commentBody": "",
    "originSummary": [
      "Xandr, anak perusahaan Microsoft, mengumpulkan dan membagikan data pribadi jutaan orang Eropa untuk iklan tertarget, melelang ruang iklan kepada ribuan pengiklan, meskipun hanya satu iklan yang ditampilkan.",
      "Data Xandr sering tidak akurat, menggambarkan pengguna dengan cara yang bertentangan, dan gagal mematuhi permintaan akses GDPR, dengan tingkat respons yang dilaporkan sebesar 0%.",
      "noyb telah mengajukan keluhan GDPR terhadap Xandr karena masalah transparansi, data yang tidak akurat, dan ketidakpatuhan terhadap permintaan akses dan penghapusan, mendesak otoritas perlindungan data Italia untuk menyelidiki dan menjatuhkan denda."
    ],
    "commentSummary": [
      "Xandr milik Microsoft dilaporkan memberikan hak GDPR (Peraturan Perlindungan Data Umum) dengan tingkat 0%, menimbulkan kekhawatiran privasi yang signifikan.",
      "Masalah ini menyoroti tantangan yang terus berlanjut dalam industri periklanan terkait kepatuhan terhadap undang-undang privasi dan perlindungan data pengguna.",
      "Diskusi tersebut mencerminkan frustrasi yang lebih luas terhadap cara perusahaan menangani privasi pengguna, yang sering kali memprioritaskan kepentingan bisnis di atas kewajiban hukum dan etika."
    ],
    "points": 185,
    "commentCount": 88,
    "retryCount": 0,
    "time": 1720515605
  },
  {
    "id": 40909334,
    "title": "The Deadlock Empire: Panduan Interaktif untuk Kunci",
    "originLink": "https://deadlockempire.github.io",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40909334",
    "commentBody": "",
    "originSummary": [
      "\"The Deadlock Empire\" adalah sebuah permainan edukatif yang dirancang untuk mengajarkan pemrograman konkuren dan multi-threaded dalam C# dengan mengeksploitasi kelemahan program untuk menyebabkan crash atau malfungsi.",
      "Permainan ini mencakup tutorial tentang antarmuka dan instruksi non-atomik, serta berbagai tantangan seperti kode yang tidak tersinkronisasi, deadlock, dan primitif sinkronisasi tingkat tinggi.",
      "Dibuat oleh Petr Hudeček dan Michal Pokorný di HackCambridge 2016, permainan ini memungkinkan pengguna untuk mengirimkan umpan balik atau ide melalui GitHub."
    ],
    "commentSummary": [
      "The Deadlock Empire\" adalah panduan interaktif yang berfokus pada pemahaman dan pengelolaan kunci dalam pemrograman multithreaded.",
      "Kajian menyoroti praktik terbaik seperti menghindari keadaan yang dapat diubah bersama, menggunakan ring buffer untuk pengiriman pesan, dan memanfaatkan struktur data konkuren atau saluran.",
      "Komentar panduan dan komunitas menekankan pentingnya kesederhanaan dalam multithreading dan tantangan menulis kode non-blocking."
    ],
    "points": 181,
    "commentCount": 33,
    "retryCount": 0,
    "time": 1720470580
  },
  {
    "id": 40908444,
    "title": "Dear Roku, Anda merusak TV saya",
    "originLink": "https://www.theverge.com/24188282/roku-tv-update-motion-smoothing-turn-off",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40908444",
    "commentBody": "",
    "originSummary": [
      "Kabar terbaru dari pembaruan Roku (versi 13.0.0) memperkenalkan fitur yang disebut Roku Smart Picture, yang memaksa penghalusan gerakan pada semua konten, membuat TV tidak dapat ditonton oleh beberapa pengguna.",
      "Banyak pemilik TV Roku telah melaporkan masalah ini, tetapi Roku belum memberikan solusi atau menanggapi keluhan pelanggan dengan memadai.",
      "Masalah ini bukanlah hal baru; masalah serupa terjadi pada tahun 2020 dan tetap belum terselesaikan, membuat beberapa pengguna mempertimbangkan untuk membeli TV yang tidak terhubung ke internet."
    ],
    "commentSummary": [
      "Kebaruan pembaruan Roku telah menyebabkan frustrasi di kalangan pengguna dengan mengaktifkan motion smoothing, yang banyak tidak disukai, lebih memilih kecepatan bingkai asli untuk film.",
      "Kajian ini menyoroti masalah yang lebih luas terkait pembaruan perangkat lunak yang tidak diinginkan dan tantangan dalam menemukan TV 'bodoh' yang tidak terhubung ke internet.",
      "Pengguna sedang mempertimbangkan alternatif seperti Apple TV atau Nvidia Shield untuk menjaga kontrol yang lebih baik atas pengalaman menonton mereka dan menghindari masalah pada smart TV."
    ],
    "points": 169,
    "commentCount": 158,
    "retryCount": 0,
    "time": 1720465942
  },
  {
    "id": 40911869,
    "title": "Keadaan Rendering Teks 2024",
    "originLink": "https://behdad.org/text2024/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40911869",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Kemungkinan masa depan font mencakup fitur-fitur canggih seperti gambar berwarna penuh, kode Web Assembly, dan streaming jaringan, yang menimbulkan kekhawatiran tentang kebutuhan dan kompleksitasnya.",
      "Oxidize, sebuah kerangka kerja Rust, bertujuan untuk menyatukan kompilasi dan konsumsi font, yang berpotensi mengurangi biaya pengembangan, tetapi menimbulkan pertanyaan tentang dukungan jangka panjang untuk alat-alat yang ada seperti FreeType dan HarfBuzz.",
      "Artikel tersebut membahas perdebatan yang sedang berlangsung tentang pembentukan teks yang melibatkan paradigma yang dapat diprogram seperti WASM versus penggunaan shader GPU yang sudah ada, dengan menyoroti kekhawatiran tentang kompleksitas dan kinerja."
    ],
    "points": 162,
    "commentCount": 54,
    "retryCount": 0,
    "time": 1720490685
  },
  {
    "id": 40913736,
    "title": "Crawlee untuk Python – sebuah perpustakaan web scraping dan otomatisasi browser",
    "originLink": "https://crawlee.dev/python/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40913736",
    "commentBody": "",
    "originSummary": [
      "Crawlee untuk Python adalah perpustakaan baru untuk web scraping dan otomatisasi browser yang dirancang untuk membangun crawler yang andal dengan cepat, sekarang tersedia untuk pengguna awal.",
      "Fitur utama termasuk dukungan untuk browser tanpa antarmuka, penskalaan otomatis, manajemen proxy, dan petunjuk tipe untuk peningkatan penyelesaian kode dan deteksi bug.",
      "Crawlee gratis, sumber terbuka, dan dapat diinstal melalui pip; pengguna dapat bergabung dengan komunitas di Discord untuk mendapatkan dukungan."
    ],
    "commentSummary": [
      "Crawlee untuk Python, sebuah perpustakaan baru untuk web scraping dan otomatisasi browser, telah diluncurkan oleh Jan, pendiri Apify.",
      "Fitur utama mencakup antarmuka terpadu untuk HTTP dan perayapan browser tanpa kepala, perayapan paralel otomatis, petunjuk tipe, pengulangan otomatis, rotasi proxy, manajemen sesi, pengaturan rute permintaan yang dapat dikonfigurasi, antrean URL yang persisten, dan penyimpanan yang dapat dipasang.",
      "Koleksi perpustakaan ini bersifat open-source dan gratis, bertujuan untuk menyederhanakan web scraping dengan menangani tugas-tugas kompleks, memungkinkan pengembang untuk fokus pada logika bisnis, dengan perbaikan dokumentasi di masa depan dan fitur tambahan yang direncanakan."
    ],
    "points": 145,
    "commentCount": 43,
    "retryCount": 0,
    "time": 1720513838
  },
  {
    "id": 40912650,
    "title": "Hampir 2 juta metrik ton ikan liar digunakan untuk memberi makan salmon ternak Norwegia setiap tahun",
    "originLink": "https://www.seafoodsource.com/news/aquaculture/report-nearly-2-million-metric-tons-of-wild-fish-used-to-feed-norwegian-farmed-salmon-annually",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40912650",
    "commentBody": "",
    "originSummary": [
      "Sebuah laporan oleh Feedback dan berbagai organisasi di Afrika Barat dan Norwegia menyoroti bahwa hampir 2 juta metrik ton ikan liar dipanen setiap tahun untuk memproduksi minyak ikan bagi pakan salmon ternak Norwegia.",
      "Praktik ini berdampak negatif pada mata pencaharian dan menyebabkan malnutrisi di negara-negara Afrika Barat seperti Gambia, Senegal, dan Mauritania, dengan potensi untuk melipatgandakan permintaan ikan tangkapan liar pada tahun 2050.",
      "Produsen pakan utama seperti Mowi, Skretting, Cargill, dan Biomar mendapatkan minyak ikan dari Afrika barat laut, yang menyebabkan penurunan signifikan dalam stok ikan lokal dan pendapatan, mendorong seruan untuk langkah-langkah keberlanjutan."
    ],
    "commentSummary": [
      "Hampir 2 juta metrik ton ikan liar digunakan setiap tahun untuk memberi makan salmon ternak Norwegia, menimbulkan kekhawatiran tentang keberlanjutan dan efisiensi.",
      "Kritikus berpendapat bahwa menggunakan makanan kaya protein seperti kedelai untuk memberi makan ternak daripada langsung kepada manusia adalah pemborosan dan menyoroti ketidakefisienan dalam produksi pangan.",
      "Pengaruh lingkungan dari peternakan daging dan ikan, termasuk deforestasi dan polusi, sangat signifikan, mendorong seruan untuk mengurangi konsumsi daging dan memperbaiki praktik peternakan."
    ],
    "points": 145,
    "commentCount": 219,
    "retryCount": 0,
    "time": 1720501008
  }
]
