[
  {
    "id": 40918052,
    "title": "« Google Chrome possède une API spéciale cachée accessible uniquement depuis *.google.com »",
    "originLink": "https://twitter.com/lcasdev/status/1810696257137959018",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40918052",
    "commentBody": "",
    "originSummary": [
      "« Google Chrome fournit à tous les sites *.google.com un accès étendu à l'utilisation du CPU, du GPU et de la mémoire du système et des onglets, ainsi qu'à des informations détaillées sur le processeur et à un canal de journalisation. »",
      "« Cet accès API est exclusif aux sites *.google.com, soulevant des préoccupations potentielles en matière de confidentialité et de sécurité parmi les utilisateurs et les développeurs. »"
    ],
    "commentSummary": [
      "« Google Chrome dispose d'une API cachée accessible uniquement depuis *.google.com, probablement utilisée pour Google Meet, fournissant des informations détaillées sur le système telles que l'utilisation du CPU/GPU/RAM. »",
      "« Cette exclusivité soulève des préoccupations concernant les comportements anticoncurrentiels et la confidentialité des utilisateurs, car d'autres sites web ne peuvent pas accéder à ces informations. »",
      "« L'API est intégrée dans Chrome et n'est pas répertoriée dans chrome://extensions, suscitant des débats sur l'éthique et la légalité de telles pratiques. »"
    ],
    "points": 438,
    "commentCount": 183,
    "retryCount": 0,
    "time": 1720542911
  },
  {
    "id": 40911637,
    "title": "« Rye : Une expérience Python sans tracas »",
    "originLink": "https://rye.astral.sh/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40911637",
    "commentBody": "",
    "originSummary": [
      "« Le seigle est une solution complète de gestion de projets et de paquets pour Python, offrant une expérience unifiée pour la gestion des installations Python, des projets, des dépendances et des environnements virtuels. »",
      "« Il prend en charge des projets complexes, des monorepos (dépôts contenant plusieurs projets) et des installations d'outils globaux, ce qui le rend polyvalent pour divers besoins de développement. »",
      "« Le processus d'installation est simple, avec des instructions spécifiques fournies pour Linux, macOS et Windows, ainsi qu'une option pour compiler à partir du code source en utilisant Rust et Cargo. »"
    ],
    "commentSummary": [
      "« Rye est un outil de packaging Python qui prend désormais en charge la résolution \"universelle\", permettant la génération d'un fichier requirements.txt verrouillé qui fonctionne sur toutes les plateformes et systèmes d'exploitation. »",
      "« Le seigle utilise l'outil uv sous le capot, qui a été amélioré pour prendre en charge cette fonctionnalité de résolution universelle, rendant la gestion des dépendances plus rationalisée et efficace. »",
      "« Les utilisateurs ont signalé des transitions réussies d'autres outils comme Poetry vers Rye, en particulier pour des projets complexes impliquant des dépendances comme PyTorch, grâce aux capacités de résolution améliorées de Rye. »"
    ],
    "points": 421,
    "commentCount": 271,
    "retryCount": 0,
    "time": 1720487895
  },
  {
    "id": 40915082,
    "title": "« PySkyWiFi : Wi-Fi gratuit et stupide sur les vols long-courriers »",
    "originLink": "https://robertheaton.com/pyskywifi/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40915082",
    "commentBody": "",
    "originSummary": [
      "« PySkyWiFi est un outil qui exploite une faille dans les systèmes Wi-Fi en vol en utilisant des comptes de miles aériens pour acheminer les données internet, offrant ainsi un accès internet gratuit sur les vols long-courriers. »",
      "« L'outil fonctionne avec deux composants : un proxy ciel dans l'avion et un démon au sol, qui traitent les requêtes et réponses HTTP via le compte airmiles. »",
      "« Le développeur a testé avec succès PySkyWiFi pour la messagerie instantanée, les mises à jour en direct et l'accès complet à Internet, démontrant ainsi son potentiel à contourner les frais de Wi-Fi en vol. »"
    ],
    "commentSummary": [
      "Les utilisateurs se sont souvenus de piratages créatifs avec d'anciens appareils Kindle, comme l'utilisation de Google Voice pour envoyer des SMS et afficher des messages sur l'écran d'accueil.",
      "« Les discussions ont inclus des considérations éthiques et de la nostalgie pour les anciens piratages technologiques, comme contourner les services Wi-Fi payants et utiliser le tunneling DNS pour accéder à Internet. »",
      "« La conversation a mis en lumière l'ingéniosité et la débrouillardise des utilisateurs pour trouver des solutions d'accès gratuit à Internet, suscitant des débats sur l'éthique et la praticité de telles méthodes. »"
    ],
    "points": 407,
    "commentCount": 219,
    "retryCount": 0,
    "time": 1720526497
  },
  {
    "id": 40909076,
    "title": "« DB Browser for SQLite (Windows, macOS et la plupart des versions de Linux) »",
    "originLink": "https://sqlitebrowser.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40909076",
    "commentBody": "",
    "originSummary": [
      "« DB Browser for SQLite (DB4S) est un outil visuel open-source de haute qualité pour gérer les fichiers de base de données SQLite, doté d'une interface de type tableur et de capacités complètes de requêtes SQL. »",
      "« La version officielle actuelle est la 3.12.2, avec un candidat à la version 3.13.x-rc1 disponible, et des versions nocturnes pour ceux qui recherchent les dernières fonctionnalités, bien qu'elles puissent être instables. »",
      "« DB4S prend en charge la création, l'édition et la gestion des fichiers de base de données, des tables et des enregistrements, ainsi que l'importation/l'exportation de données et l'exécution de requêtes SQL, ce qui en fait un outil polyvalent pour la gestion de bases de données. »"
    ],
    "commentSummary": [
      "« DB Browser for SQLite, disponible sur Windows, macOS et Linux, a été présenté sur Hacker News, avec une nouvelle version stable annoncée prochainement par le mainteneur lucydodo. »",
      "« Les utilisateurs ont loué le logiciel pour sa convivialité, en particulier dans la gestion de grands fichiers CSV, et l'ont comparé favorablement à d'autres outils comme DBeaver et SQLiteStudio. »",
      "« La communauté a discuté des fonctionnalités souhaitées telles que le support STRICT et les licences hors ligne, et a exprimé sa gratitude pour l'importance de l'outil dans des applications comme les jeux compétitifs et le développement. »"
    ],
    "points": 332,
    "commentCount": 56,
    "retryCount": 0,
    "time": 1720469283
  },
  {
    "id": 40908878,
    "title": "Anna's Archive risque des millions en dommages et une injonction permanente",
    "originLink": "https://torrentfreak.com/annas-archive-faces-millions-in-damages-and-a-permanent-injunction-240708/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40908878",
    "commentBody": "",
    "originSummary": [
      "Anna's Archive, un moteur de recherche de bibliothèque pirate, fait face à des dommages-intérêts et à une injonction permanente devant un tribunal américain après ne pas avoir répondu à une poursuite intentée par OCLC.",
      "« La poursuite découle du grattage et de la publication en ligne de la base de données WorldCat d'OCLC, OCLC réclamant plus de 5 millions de dollars en dommages-intérêts et cherchant à obtenir un jugement par défaut et une injonction. »",
      "« Malgré les problèmes juridiques, Anna's Archive est passé à un nouveau domaine .GS, compliquant les efforts d'application de la loi contre le site. »"
    ],
    "commentSummary": [
      "Anna's Archive fait face à un procès avec des réclamations de millions en dommages et une injonction permanente en raison d'attaques informatiques présumées, principalement par le biais de l'extraction de données web.",
      "« L'organisation OCLC affirme avoir subi plus de 5 millions de dollars de dommages, y compris les coûts pour les mises à niveau du matériel, les contrats Cloudflare et les salaires des employés atténuant les attaques. »",
      "« L'affaire soulève des questions sur le fait de savoir si le web scraping constitue une cyberattaque et les implications plus larges pour les pratiques de scraping de données, y compris les impacts potentiels sur la formation de l'IA et d'autres industries. »"
    ],
    "points": 288,
    "commentCount": 164,
    "retryCount": 0,
    "time": 1720468351
  },
  {
    "id": 40908521,
    "title": "« Les administrateurs de Z-Library \"s'évadent de l'assignation à résidence\" après que le juge a approuvé l'extradition vers les États-Unis »",
    "originLink": "https://torrentfreak.com/z-library-admins-escape-house-arrest-after-judge-approves-u-s-extradition-240708/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40908521",
    "commentBody": "",
    "originSummary": [
      "« Deux présumés opérateurs de Z-Library, Anton Napolsky et Valeriia Ermakova, se sont échappés de leur assignation à résidence en Argentine après avoir demandé le statut de réfugiés politiques. »",
      "Ils risquent l'extradition vers les États-Unis pour des accusations incluant la violation criminelle des droits d'auteur, la fraude électronique et le blanchiment d'argent.",
      "« Le ministère de la Justice des États-Unis et le FBI ont commencé à saisir les domaines de Z-Library en novembre 2022, et un mandat d'arrêt international a été émis contre le couple, dont la localisation actuelle est inconnue. »"
    ],
    "commentSummary": [
      "« Les administrateurs de Z-Library auraient \"échappé à l'assignation à résidence\" après l'approbation par un juge de leur extradition vers les États-Unis. »",
      "Ils font face à des accusations de blanchiment d'argent, probablement en raison de l'utilisation des dons des utilisateurs pour financer le site, ce qui est considéré comme du blanchiment d'argent selon la loi américaine.",
      "« Cette affaire souligne la nature agressive des poursuites fédérales et soulève des débats éthiques et juridiques sur les bibliothèques de l'ombre comme Z-Library. »"
    ],
    "points": 243,
    "commentCount": 200,
    "retryCount": 0,
    "time": 1720466341
  },
  {
    "id": 40917312,
    "title": "Les routeurs Linksys Velop envoient les mots de passe Wi-Fi en texte clair aux serveurs américains",
    "originLink": "https://stackdiary.com/linksys-velop-routers-send-wi-fi-passwords-in-plaintext-to-us-servers/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40917312",
    "commentBody": "",
    "originSummary": [
      "« Testaankoop, l'Association belge des consommateurs, a découvert que les routeurs Linksys Velop Pro 6E et Velop Pro 7 envoient les identifiants de connexion Wi-Fi en texte clair aux serveurs d'Amazon aux États-Unis, posant des risques de sécurité importants. »",
      "« Malgré les avertissements en novembre, Linksys n'a pas pris de mesures efficaces pour résoudre ce problème, ce qui pourrait entraîner des attaques de type Man-In-The-Middle (MITM). »",
      "Testaankoop conseille de changer les noms et mots de passe Wi-Fi via l'interface web et recommande de ne pas acheter ces routeurs en raison des vulnérabilités de sécurité."
    ],
    "commentSummary": [
      "Les routeurs Linksys Velop transmettent les mots de passe Wi-Fi en texte clair vers des serveurs américains, ce qui suscite d'importantes préoccupations en matière de sécurité parmi les utilisateurs.",
      "« Malgré le fait qu'il ait été signalé en novembre, aucune mesure efficace n'a été mise en œuvre pour résoudre le problème, ce qui a suscité des discussions sur des pratiques similaires par d'autres FAI et fabricants de routeurs. »",
      "« La situation souligne la nécessité d'améliorer la sécurité et la transparence des appareils réseau grand public, certains recommandant des micrologiciels open-source comme OpenWRT pour atténuer de telles vulnérabilités. »"
    ],
    "points": 242,
    "commentCount": 91,
    "retryCount": 0,
    "time": 1720539209
  },
  {
    "id": 40909327,
    "title": "Fabriquer mes propres alliances",
    "originLink": "https://geoff.greer.fm/2024/07/07/making-my-own-wedding-rings/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40909327",
    "commentBody": "",
    "originSummary": [
      "Le·auteur·e a décidé de fabriquer ses propres alliances en utilisant la méthode de moulage à la cire perdue PLA, inspiré·e par une vidéo de Nile Red sur l'or violet.",
      "Le processus impliquait l'impression 3D, la création d'un moule en plâtre et le coulage de métal en fusion, avec des essais initiaux utilisant de l'argent fin et plus tard l'alliage de l'argent avec de l'or.",
      "« Après plusieurs tentatives et ajustements, l'auteur a réussi à créer des bagues uniques et d'apparence professionnelle, en consacrant six week-ends et environ 3 500 $ au projet. »"
    ],
    "commentSummary": [
      "« Un utilisateur a partagé son expérience de fabrication de ses propres alliances en utilisant de l'acier inoxydable et un tour, soulignant la durabilité et la signification personnelle des bagues pendant près de 20 ans. »",
      "« La discussion inclut diverses méthodes et matériaux pour des alliances DIY, tels que le titane, l'or et l'argent, avec des utilisateurs partageant des conseils et des anecdotes personnelles sur leurs processus de fabrication de bagues. »",
      "« Le message souligne la valeur sentimentale et l'expérience unique de la création de bagues de mariage sur mesure, de nombreux utilisateurs notant les souvenirs durables et les touches personnelles impliquées dans le processus. »"
    ],
    "points": 232,
    "commentCount": 112,
    "retryCount": 0,
    "time": 1720470548
  },
  {
    "id": 40912684,
    "title": "« Le malentendu zombie de l'informatique théorique »",
    "originLink": "https://scottaaronson.blog/?p=8106",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40912684",
    "commentBody": "",
    "originSummary": [
      "« Le billet de blog de Scott Aaronson clarifie les idées fausses courantes en informatique théorique, en particulier la différence entre la calculabilité et la complexité. »",
      "« Il utilise des exemples, tels qu'une fonction déterminant l'existence de Dieu, pour illustrer que la calculabilité concerne les fonctions, et non les questions individuelles, et aborde les malentendus concernant le problème P vs. NP. »",
      "Aaronson explique que la calculabilité concerne l'existence d'un programme pour mapper des entrées à des sorties, et non la difficulté de créer ce programme, et discute de la fonction du Castor Occupé pour mettre en évidence les valeurs non calculables par rapport aux valeurs calculables."
    ],
    "commentSummary": [
      "« La science informatique théorique traite souvent de concepts impliquant l'infini, les rendant contre-intuitifs, tels que la complexité de Kolmogorov et le problème de l'arrêt. »",
      "« Le problème P=NP reste un débat philosophique, certains comparant sa complexité à celle de l'hypothèse du continu (CH). »",
      "« La distinction entre calculabilité et démontrabilité est soulignée, montrant qu'une fonction peut être calculable même si sa mise en œuvre exacte est actuellement indéterminée. »"
    ],
    "points": 203,
    "commentCount": 164,
    "retryCount": 0,
    "time": 1720501627
  },
  {
    "id": 40913915,
    "title": "« Microsoft Xandr accorde les droits GDPR à un taux de 0 % »",
    "originLink": "https://noyb.eu/en/microsofts-xandr-grants-gdpr-rights-rate-0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40913915",
    "commentBody": "",
    "originSummary": [
      "« Xandr, une filiale de Microsoft, collecte et partage les données personnelles de millions d'Européens pour la publicité ciblée, en mettant aux enchères des espaces publicitaires à des milliers d'annonceurs, même si une seule publicité est affichée. »",
      "Les données de Xandr sont souvent inexactes, représentant les utilisateurs de manière contradictoire, et ne respectent pas les demandes d'accès GDPR, avec un taux de réponse signalé de 0%.",
      "« noyb a déposé une plainte RGPD contre Xandr pour des problèmes de transparence, des données inexactes et le non-respect des demandes d'accès et d'effacement, exhortant l'autorité italienne de protection des données à enquêter et à imposer des amendes. »"
    ],
    "commentSummary": [
      "« On rapporte que Xandr de Microsoft accorde les droits RGPD (Règlement Général sur la Protection des Données) à un taux de 0 %, ce qui soulève d'importantes préoccupations en matière de confidentialité. »",
      "« Cette question met en lumière les défis persistants dans l'industrie de la publicité en ce qui concerne le respect des lois sur la vie privée et la protection des données des utilisateurs. »",
      "« La discussion reflète des frustrations plus larges quant à la manière dont les entreprises gèrent la confidentialité des utilisateurs, privilégiant souvent les intérêts commerciaux au détriment des obligations légales et éthiques. »"
    ],
    "points": 185,
    "commentCount": 88,
    "retryCount": 0,
    "time": 1720515605
  },
  {
    "id": 40909334,
    "title": "« L'Empire du Blocage : Un Guide Interactif des Verrous »",
    "originLink": "https://deadlockempire.github.io",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40909334",
    "commentBody": "",
    "originSummary": [
      "« \"The Deadlock Empire\" est un jeu éducatif conçu pour enseigner la programmation concurrente et multi-thread en C# en exploitant les défauts des programmes pour provoquer des plantages ou des dysfonctionnements. »",
      "« Le jeu comprend des tutoriels sur l'interface et les instructions non atomiques, ainsi que divers défis tels que le code non synchronisé, les interblocages et les primitives de synchronisation de haut niveau. »",
      "Créé par Petr Hudeček et Michal Pokorný lors de HackCambridge 2016, le jeu permet aux utilisateurs de soumettre des commentaires ou des idées via GitHub."
    ],
    "commentSummary": [
      "« \"The Deadlock Empire\" est un guide interactif axé sur la compréhension et la gestion des verrous dans la programmation multithread. »",
      "« Les discussions mettent en avant les meilleures pratiques telles que l'évitement de l'état mutable partagé, l'utilisation de tampons circulaires pour le passage de messages, et l'exploitation de structures de données concurrentes ou de canaux. »",
      "« Le guide et les commentaires de la communauté soulignent l'importance de la simplicité dans le multithreading et les défis de l'écriture de code non bloquant. »"
    ],
    "points": 181,
    "commentCount": 33,
    "retryCount": 0,
    "time": 1720470580
  },
  {
    "id": 40908444,
    "title": "« Cher Roku, vous avez ruiné ma télévision »",
    "originLink": "https://www.theverge.com/24188282/roku-tv-update-motion-smoothing-turn-off",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40908444",
    "commentBody": "",
    "originSummary": [
      "« Une récente mise à jour de Roku (version 13.0.0) a introduit une fonctionnalité appelée Roku Smart Picture, qui impose le lissage de mouvement sur tous les contenus, rendant les téléviseurs inutilisables pour certains utilisateurs. »",
      "« De nombreux propriétaires de téléviseurs Roku ont signalé ce problème, mais Roku n'a pas fourni de solution ni répondu de manière adéquate aux plaintes des clients. »",
      "« Ce problème n'est pas nouveau ; un problème similaire s'est produit en 2020 et reste non résolu, ce qui pousse certains utilisateurs à envisager l'achat de téléviseurs non connectés à Internet. »"
    ],
    "commentSummary": [
      "« Une mise à jour de Roku a provoqué de la frustration parmi les utilisateurs en activant le lissage de mouvement, que beaucoup n'aiment pas, préférant les taux de trame originaux pour les films. »",
      "« La discussion met en lumière des problèmes plus larges liés aux mises à jour logicielles indésirables et le défi de trouver des téléviseurs \"bêtes\" non connectés à Internet. »",
      "« Les utilisateurs envisagent des alternatives comme Apple TV ou Nvidia Shield pour mieux contrôler leur expérience de visionnage et éviter les problèmes des téléviseurs intelligents. »"
    ],
    "points": 169,
    "commentCount": 158,
    "retryCount": 0,
    "time": 1720465942
  },
  {
    "id": 40911869,
    "title": "État du rendu de texte 2024",
    "originLink": "https://behdad.org/text2024/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40911869",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "« L'avenir des polices de caractères pourrait inclure des fonctionnalités avancées telles que des images en couleur, du code Web Assembly et du streaming réseau, soulevant des préoccupations quant à leur nécessité et leur complexité. »",
      "« Oxidize, un framework Rust, vise à unifier la compilation et la consommation de polices, ce qui pourrait réduire les coûts de développement, mais soulève des questions sur le support à long terme des outils existants comme FreeType et HarfBuzz. »",
      "Cet article traite des débats en cours sur la mise en forme du texte impliquant des paradigmes programmables comme WASM par rapport à l'utilisation des shaders GPU existants, en soulignant les préoccupations concernant la complexité et les performances."
    ],
    "points": 162,
    "commentCount": 54,
    "retryCount": 0,
    "time": 1720490685
  },
  {
    "id": 40913736,
    "title": "« Crawlee pour Python – une bibliothèque de web scraping et d'automatisation de navigateur »",
    "originLink": "https://crawlee.dev/python/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40913736",
    "commentBody": "",
    "originSummary": [
      "« Crawlee pour Python est une nouvelle bibliothèque d'extraction de données web et d'automatisation de navigateur conçue pour créer rapidement des robots d'exploration fiables, désormais disponible pour les premiers utilisateurs. »",
      "« Les principales caractéristiques incluent la prise en charge des navigateurs sans interface utilisateur, la mise à l'échelle automatique, la gestion des proxys et les annotations de type pour une meilleure complétion de code et la détection des bogues. »",
      "« Crawlee est gratuit, open source, et peut être installé via pip ; les utilisateurs peuvent rejoindre la communauté sur Discord pour obtenir de l'aide. »"
    ],
    "commentSummary": [
      "« Crawlee pour Python, une nouvelle bibliothèque d'extraction de données web et d'automatisation de navigateur, a été lancée par Jan, le fondateur d'Apify. »",
      "« Les principales caractéristiques incluent une interface unifiée pour le crawling HTTP et sans tête, le crawling parallèle automatique, les annotations de type, les nouvelles tentatives automatiques, la rotation des proxys, la gestion des sessions, le routage des requêtes configurable, une file d'attente d'URL persistante et un stockage modulaire. »",
      "« La bibliothèque est open-source et gratuite, visant à simplifier le web scraping en gérant des tâches complexes, permettant aux développeurs de se concentrer sur la logique métier, avec des améliorations de la documentation et des fonctionnalités supplémentaires prévues. »"
    ],
    "points": 145,
    "commentCount": 43,
    "retryCount": 0,
    "time": 1720513838
  },
  {
    "id": 40912650,
    "title": "« Près de 2 millions de tonnes métriques de poissons sauvages sont utilisées chaque année pour nourrir les saumons d'élevage norvégiens »",
    "originLink": "https://www.seafoodsource.com/news/aquaculture/report-nearly-2-million-metric-tons-of-wild-fish-used-to-feed-norwegian-farmed-salmon-annually",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40912650",
    "commentBody": "",
    "originSummary": [
      "« Un rapport de Feedback et de diverses organisations ouest-africaines et norvégiennes souligne que près de 2 millions de tonnes métriques de poissons sauvages sont récoltées chaque année pour produire de l'huile de poisson destinée à l'alimentation des saumons d'élevage norvégiens. »",
      "« Cette pratique a un impact négatif sur les moyens de subsistance et cause la malnutrition dans des pays d'Afrique de l'Ouest tels que la Gambie, le Sénégal et la Mauritanie, avec la possibilité de tripler la demande de poissons sauvages d'ici 2050. »",
      "Les principaux producteurs d'aliments pour animaux comme Mowi, Skretting, Cargill et Biomar s'approvisionnent en huile de poisson en Afrique du Nord-Ouest, ce qui entraîne des baisses significatives des stocks de poissons locaux et des revenus, incitant à des appels pour des mesures de durabilité."
    ],
    "commentSummary": [
      "« Près de 2 millions de tonnes métriques de poissons sauvages sont utilisés chaque année pour nourrir les saumons d'élevage norvégiens, soulevant des préoccupations en matière de durabilité et d'efficacité. »",
      "« Les critiques soutiennent que l'utilisation d'aliments riches en protéines comme le soja pour nourrir le bétail au lieu de les donner directement aux humains est un gaspillage et met en évidence les inefficacités de la production alimentaire. »",
      "« L'impact environnemental de l'élevage de viande et de poissons, y compris la déforestation et la pollution, est significatif, ce qui incite à réduire la consommation de viande et à améliorer les pratiques agricoles. »"
    ],
    "points": 145,
    "commentCount": 219,
    "retryCount": 0,
    "time": 1720501008
  }
]
