[
  {
    "id": 40918052,
    "title": "Google Chrome에는 *.google.com에서만 접근할 수 있는 특별한 숨겨진 API가 있습니다.",
    "originLink": "https://twitter.com/lcasdev/status/1810696257137959018",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40918052",
    "commentBody": "",
    "originSummary": [
      "구글 크롬은 모든 *.google.com 사이트에 시스템 및 탭의 CPU, GPU, 메모리 사용량, 상세한 프로세서 정보 및 로깅 백채널에 대한 광범위한 접근 권한을 제공합니다.",
      "이 API 접근은 *.google.com 사이트에만 독점적으로 허용되며, 사용자와 개발자들 사이에서 잠재적인 개인정보 보호 및 보안 문제를 야기할 수 있습니다."
    ],
    "commentSummary": [
      "Google Chrome에는 *.google.com에서만 접근할 수 있는 숨겨진 API가 있으며, 이는 Google Meet에서 사용되는 것으로 보이며 CPU/GPU/RAM 사용량과 같은 자세한 시스템 정보를 제공합니다.",
      "이 독점성은 다른 웹사이트가 이 정보를 접근할 수 없기 때문에 반경쟁적 행동과 사용자 프라이버시에 대한 우려를 제기합니다.",
      "API는 Chrome에 내장되어 있으며 chrome://extensions에 나열되지 않아 이러한 관행의 윤리성과 합법성에 대한 논쟁을 불러일으키고 있습니다."
    ],
    "points": 438,
    "commentCount": 183,
    "retryCount": 0,
    "time": 1720542911
  },
  {
    "id": 40911637,
    "title": "라이: 번거로움 없는 파이썬 경험",
    "originLink": "https://rye.astral.sh/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40911637",
    "commentBody": "",
    "originSummary": [
      "Rye는 Python 설치, 프로젝트, 종속성 및 가상 환경 관리를 위한 통합 경험을 제공하는 포괄적인 프로젝트 및 패키지 관리 솔루션입니다.",
      "복잡한 프로젝트, 모노레포(여러 프로젝트를 포함하는 저장소) 및 글로벌 도구 설치를 지원하여 다양한 개발 요구에 맞게 다재다능합니다.",
      "설치 과정은 간단하며, Linux, macOS 및 Windows에 대한 구체적인 지침이 제공되며, Rust와 Cargo를 사용하여 소스에서 컴파일하는 옵션도 있습니다."
    ],
    "commentSummary": [
      "Rye는 이제 모든 플랫폼과 운영 체제에서 작동하는 잠금된 requirements.txt 파일을 생성할 수 있는 '범용' 해상도를 지원하는 Python 패키징 도구입니다.",
      "Rye는 후드 아래에서 uv 도구를 사용하며, 이 도구는 이 범용 해상도 기능을 지원하도록 개선되어 종속성 관리를 더욱 간소화하고 효율적으로 만듭니다.",
      "사용자들은 PyTorch와 같은 종속성을 포함한 복잡한 프로젝트에서 Rye의 향상된 해상 능력 덕분에 Poetry와 같은 다른 도구에서 Rye로의 성공적인 전환을 보고했습니다."
    ],
    "points": 421,
    "commentCount": 271,
    "retryCount": 0,
    "time": 1720487895
  },
  {
    "id": 40915082,
    "title": "PySkyWiFi: 장거리 비행에서 무료로 제공되는 멍청한 와이파이",
    "originLink": "https://robertheaton.com/pyskywifi/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40915082",
    "commentBody": "",
    "originSummary": [
      "PySkyWiFi는 항공 마일리지 계정을 사용하여 인터넷 데이터를 터널링함으로써 장거리 비행에서 무료 인터넷 접속을 제공하는 기내 Wi-Fi 시스템의 허점을 악용하는 도구입니다.",
      "이 도구는 두 가지 구성 요소로 작동합니다: 비행기에 있는 하늘 프록시와 지상 데몬으로, 이들은 에어마일 계정을 통해 HTTP 요청과 응답을 처리합니다.",
      "개발자는 인스턴트 메시징, 실시간 업데이트 및 전체 인터넷 액세스를 위해 PySkyWiFi를 성공적으로 테스트하여 기내 Wi-Fi 요금을 우회할 수 있는 잠재력을 입증했습니다."
    ],
    "commentSummary": [
      "사용자들은 구글 보이스를 사용해 문자 메시지를 보내고 홈 화면에 메시지를 표시하는 등 오래된 킨들 기기를 활용한 창의적인 해킹에 대해 회상했습니다.",
      "논의에는 유료 Wi-Fi 서비스를 우회하고 DNS 터널링을 사용하여 인터넷에 접속하는 것과 같은 옛 기술 해킹에 대한 윤리적 고려와 향수가 포함되었습니다.",
      "그 대화는 무료 인터넷 접속 솔루션을 찾는 데 있어 사용자의 창의성과 자원 활용 능력을 강조하며, 이러한 방법의 윤리성과 실용성에 대한 논쟁을 불러일으켰다."
    ],
    "points": 407,
    "commentCount": 219,
    "retryCount": 0,
    "time": 1720526497
  },
  {
    "id": 40909076,
    "title": "SQLite용 DB 브라우저 (Windows, macOS, 대부분의 Linux 버전)",
    "originLink": "https://sqlitebrowser.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40909076",
    "commentBody": "",
    "originSummary": [
      "DB Browser for SQLite (DB4S)는 스프레드시트와 유사한 인터페이스와 완전한 SQL 쿼리 기능을 갖춘 고품질의 시각적 오픈 소스 SQLite 데이터베이스 파일 관리 도구입니다.",
      "현재 공식 버전은 3.12.2이며, 3.13.x-rc1 릴리스 후보가 제공되고 있습니다. 최신 기능을 원하는 사용자들을 위해 야간 빌드도 제공되지만, 이는 불안정할 수 있습니다.",
      "DB4S는 데이터베이스 파일, 테이블 및 레코드를 생성, 편집 및 관리할 수 있으며, 데이터의 가져오기/내보내기와 SQL 쿼리 실행도 지원하여 데이터베이스 관리에 있어 다재다능한 도구입니다."
    ],
    "commentSummary": [
      "Windows, macOS, 및 Linux에서 사용할 수 있는 SQLite용 DB Browser가 Hacker News에 소개되었으며, 유지 관리자인 lucydodo가 곧 새로운 안정 버전을 발표할 예정입니다.",
      "사용자들은 특히 대용량 CSV 파일을 처리하는 데 있어 소프트웨어의 사용자 친화성을 칭찬하며, DBeaver와 SQLiteStudio와 같은 다른 도구들과 비교하여 긍정적으로 평가했습니다.",
      "커뮤니티는 STRICT 지원 및 오프라인 라이선스와 같은 원하는 기능에 대해 논의하고, 경쟁 게임 및 개발과 같은 애플리케이션에서 도구의 중요성에 대해 감사의 뜻을 표했습니다."
    ],
    "points": 332,
    "commentCount": 56,
    "retryCount": 0,
    "time": 1720469283
  },
  {
    "id": 40908878,
    "title": "Anna의 아카이브, 수백만 달러의 손해 배상과 영구 금지 명령에 직면",
    "originLink": "https://torrentfreak.com/annas-archive-faces-millions-in-damages-and-a-permanent-injunction-240708/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40908878",
    "commentBody": "",
    "originSummary": [
      "Anna's Archive, 해적 도서관 검색 엔진, OCLC의 소송에 응답하지 않아 미국 법원에서 금전적 손해 배상과 영구 금지 명령에 직면하고 있다.",
      "이 소송은 OCLC의 WorldCat 데이터베이스를 스크래핑하고 온라인에 게시한 것에서 비롯되었으며, OCLC는 500만 달러 이상의 손해 배상을 청구하고 있으며, 궐석 판결과 금지 명령을 구하고 있습니다.",
      "법적 문제에도 불구하고, Anna's Archive는 새로운 .GS 도메인으로 전환하여 사이트에 대한 집행 노력을 복잡하게 만들고 있다."
    ],
    "commentSummary": [
      "안나의 아카이브는 주로 웹 스크래핑을 통한 사이버 공격 혐의로 인해 수백만 달러의 손해 배상 청구와 영구 금지 명령을 받는 소송에 직면해 있습니다.",
      "조직 OCLC는 하드웨어 업그레이드, Cloudflare 계약, 공격 완화에 투입된 직원들의 급여를 포함하여 500만 달러 이상의 손해를 입었다고 주장합니다.",
      "이 사건은 웹 스크래핑이 사이버 공격에 해당하는지 여부와 AI 훈련 및 기타 산업에 미치는 잠재적 영향을 포함한 데이터 스크래핑 관행에 대한 더 넓은 함의를 제기합니다."
    ],
    "points": 288,
    "commentCount": 164,
    "retryCount": 0,
    "time": 1720468351
  },
  {
    "id": 40908521,
    "title": "Z-Library 관리자, 판사가 미국 송환을 승인한 후 '가택 연금 탈출'",
    "originLink": "https://torrentfreak.com/z-library-admins-escape-house-arrest-after-judge-approves-u-s-extradition-240708/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40908521",
    "commentBody": "",
    "originSummary": [
      "두 명의 Z-도서관 운영자로 지목된 안톤 나폴스키와 발레리아 예르마코바가 정치적 난민 지위를 요청한 후 아르헨티나에서 가택 연금을 탈출했다.",
      "그들은 형사 저작권 침해, 전신 사기 및 자금 세탁을 포함한 혐의로 미국으로의 송환에 직면해 있다.",
      "미국 법무부와 FBI는 2022년 11월에 Z-Library의 도메인을 압수하기 시작했으며, 현재 행방이 알려지지 않은 두 사람에 대해 국제 체포 영장이 발부되었습니다."
    ],
    "commentSummary": [
      "Z-Library 관리자들이 판사가 미국으로의 인도를 승인한 후 '가택 연금에서 탈출'한 것으로 전해졌습니다.",
      "그들은 사용자 기부금을 사이트 운영 자금으로 사용한 것에서 비롯된 것으로 보이는 자금 세탁 혐의에 직면해 있으며, 이는 미국 법에 따라 자금 세탁으로 간주됩니다.",
      "이 사건은 연방 기소의 공격적인 성격을 강조하며 Z-Library와 같은 그림자 도서관에 대한 윤리적 및 법적 논쟁을 불러일으킨다."
    ],
    "points": 243,
    "commentCount": 200,
    "retryCount": 0,
    "time": 1720466341
  },
  {
    "id": 40917312,
    "title": "Linksys Velop 라우터가 Wi-Fi 비밀번호를 평문으로 미국 서버에 전송",
    "originLink": "https://stackdiary.com/linksys-velop-routers-send-wi-fi-passwords-in-plaintext-to-us-servers/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40917312",
    "commentBody": "",
    "originSummary": [
      "벨기에 소비자 협회인 Testaankoop은 Linksys Velop Pro 6E 및 Velop Pro 7 라우터가 Wi-Fi 로그인 정보를 평문으로 미국의 아마존 서버에 전송하여 심각한 보안 위험을 초래한다는 사실을 발견했습니다.",
      "11월의 경고에도 불구하고, Linksys는 이 문제를 해결하기 위한 효과적인 조치를 취하지 않아 잠재적인 중간자 공격(MITM)에 노출되고 있습니다.",
      "Testaankoop은 웹 인터페이스를 통해 Wi-Fi 이름과 비밀번호를 변경할 것을 권장하며, 보안 취약점으로 인해 이러한 라우터를 구매하지 말 것을 권고합니다."
    ],
    "commentSummary": [
      "Linksys Velop 라우터가 Wi-Fi 비밀번호를 평문으로 미국 서버에 전송하여 사용자들 사이에서 심각한 보안 우려를 일으키고 있습니다.",
      "11월에 보고되었음에도 불구하고 문제를 해결하기 위한 효과적인 조치가 시행되지 않아 다른 인터넷 서비스 제공업체(ISP)와 라우터 제조업체의 유사한 관행에 대한 논의가 촉발되었습니다.",
      "이 상황은 소비자 네트워크 장치의 보안 및 투명성을 개선할 필요성을 강조하며, 일부는 이러한 취약점을 완화하기 위해 OpenWRT와 같은 오픈 소스 펌웨어를 권장하고 있습니다."
    ],
    "points": 242,
    "commentCount": 91,
    "retryCount": 0,
    "time": 1720539209
  },
  {
    "id": 40909327,
    "title": "내 결혼 반지 만들기",
    "originLink": "https://geoff.greer.fm/2024/07/07/making-my-own-wedding-rings/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40909327",
    "commentBody": "",
    "originSummary": [
      "저자는 Nile Red의 보라색 금에 관한 비디오에서 영감을 받아, 잃어버린 PLA 주조 방법을 사용하여 자신들의 결혼 반지를 직접 만들기로 결정했습니다.",
      "이 과정에는 3D 프린팅, 석고 몰드 제작, 그리고 용융 금속 주조가 포함되었으며, 초기 실험에서는 순은을 사용하고 나중에는 은과 금을 합금하는 작업이 이루어졌습니다.",
      "여러 번의 시도와 조정을 거친 후, 저자는 여섯 주말과 약 3,500달러를 들여 독특하고 전문적인 외관의 반지를 성공적으로 만들었다."
    ],
    "commentSummary": [
      "한 사용자가 스테인리스 스틸과 선반을 사용하여 자신만의 결혼 반지를 만든 경험을 공유하며, 거의 20년 동안 반지의 내구성과 개인적인 의미를 강조했습니다.",
      "토론에는 티타늄, 금, 은과 같은 DIY 결혼 반지에 대한 다양한 방법과 재료가 포함되어 있으며, 사용자들은 반지 제작 과정에 대한 팁과 개인적인 일화를 공유하고 있습니다.",
      "이 게시물은 맞춤형 결혼 반지를 만드는 것의 감정적 가치와 독특한 경험을 강조하며, 많은 사용자들이 이 과정에서 지속되는 추억과 개인적인 터치에 대해 언급하고 있습니다."
    ],
    "points": 232,
    "commentCount": 112,
    "retryCount": 0,
    "time": 1720470548
  },
  {
    "id": 40912684,
    "title": "이론 컴퓨터 과학에 대한 좀비 오해",
    "originLink": "https://scottaaronson.blog/?p=8106",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40912684",
    "commentBody": "",
    "originSummary": [
      "Scott Aaronson의 블로그 게시물은 이론 컴퓨터 과학에서 흔히 발생하는 오해, 특히 계산 가능성과 복잡성의 차이를 명확히 설명합니다.",
      "그는 하나님의 존재를 결정하는 함수와 같은 예를 사용하여 계산 가능성이 개별 질문이 아닌 함수에 관련된다는 것을 설명하고, P 대 NP 문제에 대한 오해를 다룹니다.",
      "아론슨은 계산 가능성이 입력을 출력으로 매핑하는 프로그램의 존재에 관한 것이지, 그 프로그램을 만드는 어려움에 관한 것이 아님을 설명하고, 계산 불가능한 값과 계산 가능한 값을 강조하기 위해 바쁜 비버 함수를 논의합니다."
    ],
    "commentSummary": [
      "이론 컴퓨터 과학은 종종 콜모고로프 복잡도와 정지 문제와 같이 무한과 관련된 개념을 다루기 때문에 직관적이지 않습니다.",
      "여전히 P=NP 문제는 철학적 논쟁으로 남아 있으며, 일부는 그 복잡성을 연속체 가설(CH)과 비교하고 있다.",
      "계산 가능성과 증명 가능성의 차이를 강조하며, 함수의 정확한 구현이 현재 미확정일지라도 함수가 계산 가능할 수 있음을 보여준다."
    ],
    "points": 203,
    "commentCount": 164,
    "retryCount": 0,
    "time": 1720501627
  },
  {
    "id": 40913915,
    "title": "Microsoft의 Xandr는 GDPR 권리를 0%의 비율로 부여합니다",
    "originLink": "https://noyb.eu/en/microsofts-xandr-grants-gdpr-rights-rate-0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40913915",
    "commentBody": "",
    "originSummary": [
      "Xandr는 마이크로소프트의 자회사로, 수백만 유럽인의 개인 데이터를 수집하고 공유하여 타겟 광고를 위해 광고 공간을 수천 명의 광고주에게 경매로 판매합니다. 이는 단 하나의 광고가 표시되더라도 마찬가지입니다.",
      "Xandr의 데이터는 종종 부정확하며, 사용자들을 모순된 방식으로 잘못 표현하고, GDPR 접근 요청을 준수하지 않으며, 보고된 응답률이 0%입니다.",
      "noyb는 투명성 문제, 부정확한 데이터, 접근 및 삭제 요청의 불이행에 대해 Xandr를 상대로 GDPR 불만을 제기했으며, 이탈리아 데이터 보호 당국에 조사를 실시하고 벌금을 부과할 것을 촉구했습니다."
    ],
    "commentSummary": [
      "보도에 따르면, 마이크로소프트의 Xandr는 GDPR(일반 데이터 보호 규정) 권리를 0%의 비율로 부여하고 있어 상당한 프라이버시 우려를 불러일으키고 있습니다.",
      "이 문제는 광고 산업에서 개인정보 보호법 준수와 사용자 데이터 보호와 관련된 지속적인 도전 과제를 강조합니다.",
      "이 논의는 기업들이 사용자 프라이버시를 처리하는 방식에 대한 더 넓은 좌절감을 반영하며, 종종 법적 및 윤리적 의무보다 비즈니스 이익을 우선시하는 경우가 많습니다."
    ],
    "points": 185,
    "commentCount": 88,
    "retryCount": 0,
    "time": 1720515605
  },
  {
    "id": 40909334,
    "title": "교착 상태 제국: 자물쇠에 대한 인터랙티브 가이드",
    "originLink": "https://deadlockempire.github.io",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40909334",
    "commentBody": "",
    "originSummary": [
      "‘데드락 엠파이어’는 프로그램의 결함을 이용해 충돌이나 오작동을 일으키는 방식으로 C#에서 동시성과 멀티스레드 프로그래밍을 가르치기 위해 설계된 교육용 게임입니다.",
      "게임에는 인터페이스 및 비원자적 명령어에 대한 튜토리얼뿐만 아니라 비동기화된 코드, 교착 상태, 고수준 동기화 원시 기능과 같은 다양한 도전 과제가 포함되어 있습니다.",
      "이 게임은 2016년 HackCambridge에서 Petr Hudeček와 Michal Pokorný에 의해 만들어졌으며, 사용자는 GitHub를 통해 피드백이나 아이디어를 제출할 수 있습니다."
    ],
    "commentSummary": [
      "\"데드락 엠파이어\"는 멀티스레드 프로그래밍에서 락을 이해하고 관리하는 데 중점을 둔 인터랙티브 가이드입니다.",
      "토론에서는 공유 가능한 변경 가능한 상태를 피하고, 메시지 전달을 위해 링 버퍼를 사용하며, 동시 데이터 구조나 채널을 활용하는 등의 모범 사례를 강조합니다.",
      "가이드와 커뮤니티 댓글은 멀티스레딩에서 단순함의 중요성과 논블로킹 코드를 작성하는 데 따른 어려움을 강조합니다."
    ],
    "points": 181,
    "commentCount": 33,
    "retryCount": 0,
    "time": 1720470580
  },
  {
    "id": 40908444,
    "title": "친애하는 Roku, 당신은 내 TV를 망쳤습니다",
    "originLink": "https://www.theverge.com/24188282/roku-tv-update-motion-smoothing-turn-off",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40908444",
    "commentBody": "",
    "originSummary": [
      "최근 Roku 업데이트(버전 13.0.0)에서는 모든 콘텐츠에 모션 스무딩을 강제로 적용하는 Roku Smart Picture라는 기능이 도입되어 일부 사용자에게는 TV 시청이 불가능하게 만들었습니다.",
      "많은 Roku TV 소유자들이 이 문제를 보고했지만, Roku는 해결책을 제공하지 않았으며 고객 불만에 적절히 대응하지 않았습니다.",
      "이 문제는 새로운 것이 아닙니다. 2020년에 유사한 문제가 발생했으며 여전히 해결되지 않아 일부 사용자들은 인터넷에 연결되지 않은 TV를 구매하는 것을 고려하고 있습니다."
    ],
    "commentSummary": [
      "Roku 업데이트로 인해 사용자들이 불만을 토로하고 있습니다. 이는 많은 사람들이 싫어하는 모션 스무딩 기능을 활성화했기 때문입니다. 사용자들은 영화의 원래 프레임 속도를 선호합니다.",
      "이 논의는 원치 않는 소프트웨어 업데이트와 인터넷에 연결되지 않은 '단순한' TV를 찾는 어려움과 관련된 더 넓은 문제를 강조합니다.",
      "사용자들은 시청 경험을 더 잘 제어하고 스마트 TV 문제를 피하기 위해 Apple TV나 Nvidia Shield와 같은 대안을 고려하고 있습니다."
    ],
    "points": 169,
    "commentCount": 158,
    "retryCount": 0,
    "time": 1720465942
  },
  {
    "id": 40911869,
    "title": "텍스트 렌더링의 현황 2024",
    "originLink": "https://behdad.org/text2024/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40911869",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "폰트의 미래에는 풀 컬러 이미지, 웹 어셈블리 코드, 네트워크 스트리밍과 같은 고급 기능이 포함될 수 있으며, 이러한 기능의 필요성과 복잡성에 대한 우려가 제기되고 있습니다.",
      "Oxidize라는 Rust 프레임워크는 폰트 컴파일 및 소비를 통합하여 개발 비용을 줄이는 것을 목표로 하지만, FreeType 및 HarfBuzz와 같은 기존 도구에 대한 장기적인 지원에 대한 의문을 제기합니다.",
      "이 기사는 WASM과 같은 프로그래머블 패러다임을 사용하는 것과 기존의 GPU 셰이더를 사용하는 것에 대한 텍스트 형성에 관한 지속적인 논쟁을 다루며, 복잡성과 성능에 대한 우려를 강조합니다."
    ],
    "points": 162,
    "commentCount": 54,
    "retryCount": 0,
    "time": 1720490685
  },
  {
    "id": 40913736,
    "title": "Crawlee for Python – 웹 스크래핑 및 브라우저 자동화 라이브러리",
    "originLink": "https://crawlee.dev/python/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40913736",
    "commentBody": "",
    "originSummary": [
      "Crawlee for Python은 신뢰할 수 있는 크롤러를 빠르게 구축할 수 있도록 설계된 새로운 웹 스크래핑 및 브라우저 자동화 라이브러리로, 이제 초기 사용자에게 제공됩니다.",
      "주요 기능으로는 헤드리스 브라우저 지원, 자동 확장, 프록시 관리, 그리고 코드 완성 및 버그 탐지를 향상시키기 위한 타입 힌트가 포함됩니다.",
      "크롤리는 무료이며 오픈 소스이고 pip를 통해 설치할 수 있습니다. 사용자는 지원을 위해 Discord 커뮤니티에 참여할 수 있습니다."
    ],
    "commentSummary": [
      "Apify의 창립자인 Jan이 새로운 웹 스크래핑 및 브라우저 자동화 라이브러리인 Crawlee for Python을 출시했습니다.",
      "주요 기능으로는 HTTP 및 헤드리스 브라우저 크롤링을 위한 통합 인터페이스, 자동 병렬 크롤링, 타입 힌트, 자동 재시도, 프록시 회전, 세션 관리, 구성 가능한 요청 라우팅, 지속적인 URL 큐, 그리고 플러그인 가능한 스토리지가 포함됩니다.",
      "이 라이브러리는 오픈 소스이며 무료로 제공되며, 복잡한 작업을 처리하여 웹 스크래핑을 단순화하고 개발자가 비즈니스 로직에 집중할 수 있도록 합니다. 향후 문서 개선 및 추가 기능이 계획되어 있습니다."
    ],
    "points": 145,
    "commentCount": 43,
    "retryCount": 0,
    "time": 1720513838
  },
  {
    "id": 40912650,
    "title": "매년 노르웨이 양식 연어를 먹이기 위해 거의 200만 미터톤의 야생 어류가 사용된다",
    "originLink": "https://www.seafoodsource.com/news/aquaculture/report-nearly-2-million-metric-tons-of-wild-fish-used-to-feed-norwegian-farmed-salmon-annually",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40912650",
    "commentBody": "",
    "originSummary": [
      "피드백과 여러 서아프리카 및 노르웨이 조직의 보고서에 따르면, 노르웨이 양식 연어 사료용 어유를 생산하기 위해 매년 약 200만 미터톤의 야생 어류가 수확되고 있습니다.",
      "이 관행은 생계에 부정적인 영향을 미치고 감비아, 세네갈, 모리타니아와 같은 서아프리카 국가에서 영양실조를 초래하고 있으며, 2050년까지 자연산 어류에 대한 수요를 세 배로 증가시킬 가능성이 있습니다.",
      "모위, 스크레팅, 카길, 비오마르와 같은 주요 사료 생산업체들이 북서 아프리카에서 어유를 조달하고 있어 현지 어류 자원과 수입이 크게 감소하고 있으며, 지속 가능성 조치를 촉구하는 목소리가 높아지고 있습니다."
    ],
    "commentSummary": [
      "매년 거의 200만 미터톤의 야생 어류가 노르웨이 양식 연어를 먹이기 위해 사용되며, 이는 지속 가능성과 효율성에 대한 우려를 불러일으키고 있습니다.",
      "비평가들은 콩과 같은 단백질이 풍부한 식품을 인간에게 직접 제공하는 대신 가축에게 먹이는 것이 낭비이며 식량 생산의 비효율성을 부각시킨다고 주장합니다.",
      "삼림 벌채와 오염을 포함한 육류 및 어류 양식의 환경적 영향은 상당하여, 육류 소비 감소와 농업 관행 개선을 촉구하는 목소리가 높아지고 있습니다."
    ],
    "points": 145,
    "commentCount": 219,
    "retryCount": 0,
    "time": 1720501008
  }
]
