[
  {
    "title": "SK지오센트릭, 화학제품 포장재에 재활용 원료 활용",
    "originLink": "https://m.hankookilbo.com/News/Read/A2023110610120004881",
    "originBody": "",
    "originSummary": [
      "SK 지심이 화학 제품 포장에 재활용 재료를 적용하였다.",
      "이는 환경을 보호하고 지속 가능한 사업 운영을 추구하는 새로운 전략이다.",
      "이를 통해 SK 지심은 건설 및 화학 산업에도 환경 친화적인 접근법을 확산시키고 있다."
    ],
    "commentBody": "",
    "commentSummary": [
      "SK 지심선은 재활용 재료를 화학 제품 포장에 적용하였습니다.",
      "이로써 지속 가능한 환경 보호에 기여하며, 환경 친화적인 기업 이미지를 강화하였습니다.",
      "이는 새롭고 흥미로운 것으로, 기술 선도자들에게 갑자기 관심을 끌었습니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699283348080
  },
  {
    "title": "SK지오센트릭, 화학제품 포장재에 재활용 원료 사용으로 연간 264톤의 플라스틱 사용 줄일 계획",
    "originLink": "https://www.sedaily.com/NewsView/29X4OWCQ69",
    "originBody": "",
    "originSummary": [
      "SK Innovation의 자회사인 SK Geo Centric는 플라스틱 폐기물을 줄이기 위해 화학 제품의 포장재로 재활용 재료를 사용하기 시작할 것이며, 이는 한국 석유화학 회사가 처음으로 이런 결정을 내린 것이다.",
      "이 조치는 매년 새로운 플라스틱 사용을 약 264톤 줄일 것으로 예상되며, 이는 회사의 환경 보존 노력의 일부이다."
    ],
    "commentBody": "",
    "commentSummary": [
      "SK Innovation의 자회사인 SK Geo Centric은 플라스틱 쓰레기를 줄이기 위해 화학 제품의 포장에 재활용 물질을 사용하기 시작하며, 이는 한국 석유화학 회사가 처음으로 시도한 것입니다.",
      "이번 조치는 매년 약 264톤의 새로운 플라스틱 사용을 줄일 것으로 예상되며, 회사의 환경 보호 노력의 일부입니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699283348080
  },
  {
    "title": "SK지오센트릭, 화학 포장재에 재활용 원료 사용 계획 발표",
    "originLink": "https://www.hankyung.com/article/2023110666881",
    "originBody": "",
    "originSummary": [
      "한국의 SK 지심주는 폴리머 화학 포장재에 재활용 물질을 사용할 계획이라고 발표했습니다.",
      "이 회사는 이로 인해 연간 폴리프로필렌 사용량이 264톤 감소할 것으로 예상하고 있습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "한국의 SK Geocentric는 폴리머 화학 포장재에 재활용 재료를 사용할 계획을 발표했습니다.",
      "이 회사는 이런 변화로 인해 연간 폴리프로필렌 사용량이 264톤을 줄일 것으로 예상합니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699283348080
  },
  {
    "title": "SK지오센트릭, 재활용 플라스틱 포장재 도입으로 연간 264만톤의 플라스틱 사용 감소 예상",
    "originLink": "https://biz.chosun.com/industry/company/2023/11/06/UWPXYLSJZFASNDEF3LAU3XTSKQ/",
    "originBody": "",
    "originSummary": [
      "SK Innovation의 석유화학 자회사인 SK Geo Centric은 폴리에틸렌 및 폴리프로필렌의 포장재에 재활용 소재를 사용할 계획입니다.",
      "이런 움직임으로 인해 매년 약 264톤의 신규 플라스틱 사용량이 줄어들 것으로 예상됩니다.",
      "특히, SK Geo Centric은 대한민국 석유화학 산업에서 재활용 플라스틱 재료를 혼합한 포장재를 사용하는 첫 회사입니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "SK Innovation의 석유화학 자회사인 SK Geo Centric는 폴리에틸렌 및 폴리프로필렌의 포장재에 재활용 재료를 사용할 계획입니다.",
      "이번 조치는 연간 약 264톤의 새로운 플라스틱 사용을 줄일 것으로 예상됩니다.",
      "특히, SK Geo Centric는 재활용 플라스틱 재료를 혼합한 포장재를 사용하는 한국 석유화학산업에서 최초의 기업입니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699283348080
  },
  {
    "title": "미국 연금기금 CalPERS, '손실 및 피해 기금' 창설 후 기후투자를 $1000억으로 늘릴 계획",
    "originLink": "https://www.newstree.kr/newsView/ntr202311060002",
    "originBody": "",
    "originSummary": [
      "'첫 번째 국제 기후대응 기금인 '손실 및 피해 기금'협정이 체결되었고, 미국 연금 기금인 CalPERS가 그 는 기후 투자를 두 배로 늘려 7년 후에는 1,000억 달러에 이를 계획을 세우고 있다.",
      "탄소 배출을 줄이기 위한 노력에도 불구하고 어려움이 계속되고 있다. 전문가들은 세계가 예상보다 빨리 따뜻해지는 것과 더위에 관련된 사망률이 급증할 것이라고 경고하며, 시민을 보호하기 위한 경고 시스템의 필요성을 강조하고 있다.",
      "Sustainvest의 CEO인 Ryu Young-jae는 자산 관리의 성공 또는 실패가 '재정 배출량'에 달려 있다고 주장하고 있다."
    ],
    "commentBody": "",
    "commentSummary": [
      "최초의 국제 기후 대응 펀드인 '손실과 피해 펀드'가 합의되었으며, 미국 연금 펀드인 CalPERS는 그의 기후 투자를 두 배로 늘려 7년 내에 1000억 달러에 이를 계획을 세우고 있습니다.",
      "그러나 탄소 배출량을 줄이기 위한 노력에도 불구하고 난제들이 계속됩니다. 전문가들은 예상보다 빠른 기후 변화와 열파 관련 사망률이 급증하고 있다는 경고하며, 시민들을 보호하기 위한 경보 시스템의 필요성을 강조합니다.",
      "Sustainvest의 CEO인 류영재는 자산 관리의 성공 또는 실패가 '재정적인 배출'에 달려 있다고 말합니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699283348080
  },
  {
    "title": "SK지오센트릭, 재활용 플라스틱을 이용한 화학제품 포장재 제조 계획",
    "originLink": "https://www.upinews.kr/newsView/1065598722849151",
    "originBody": "",
    "originSummary": [
      "SK Geocentric는 폴리에틸렌 및 폴리프로필렌 화학 제품의 포장에 재활용 재료를 사용할 계획이며, 이로 인해 연간 신규 플라스틱 사용량이 약 264톤 감소할 것으로 예상됩니다.",
      "회사의 친환경 브랜드인 Cyclers를 활용하여 포장에는 새로운 폴리프로필렌과 Post Industrial Recycled (PIR) 플라스틱이 조합될 예정입니다.",
      "이 프로젝트는 탄소에서 그린 비즈니스로 전환하려는 SK Geocentric의 'Green Transformation' 전략의 일부입니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "한국의 SK Geocentric사는 폴리에틸렌과 폴리프로필렌 화학 제품의 포장재에 재활용 재료를 사용할 계획입니다.",
      "이 동작은 매년 새로운 플라스틱 사용량을 약 264톤 줄일 것으로 예상됩니다.",
      "이 계획은 SK Geocentric의 'Green Transformation' 전략의 일부로, 회사의 친환경 Cyclers 브랜드를 활용하여, 새로운 폴리프로필렌과 Post Industrial Recycled (PIR) 플라스틱을 결합하여 포장재를 만들 것입니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699283348080
  },
  {
    "title": "SK지오센트릭, 화학제품 포장재에 재활용 원료 사용으로 플라스틱 사용량 연간 264톤 감소 예상",
    "originLink": "https://www.businesspost.co.kr/BP?command=article_view&num=332137",
    "originBody": "",
    "originSummary": [
      "SK Geocentric는 화학 제품의 플라스틱 사용을 줄이기 위해 재활용 소재를 포장재에 활용하는 계획을 발표했습니다.",
      "이 회사는 Post Industrial Recycled (PIR) 플라스틱과 새로운 폴리프로필렌을 섞어 제작한 폴리에틸렌 및 폴리프로필렌 플라스틱 포장재를 소개할 예정입니다.",
      "이 동향은 SK Geocentric를 재활용 플라스틱을 섞어 포장재를 생산하는 첫 번째 지역 석유화학 회사로 만듭니다. 재활용 재료의 적용은 연간 새로운 플라스틱 사용량을 264톤 줄일 것으로 예상됩니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "한국 기반의 SK 지오센트릭이 화학 제품의 포장에 재활용 소재를 사용하는 계획을 발표하였습니다. 이는 플라스틱 사용량을 줄이기 위한 조치입니다.",
      "회사는 산업 폐기물에서 남는 플라스틱(PIR)과 새로운 폴리프로필렌을 혼합한 폴리에틸렌과 폴리프로필렌 플라스틱 포장을 도입할 예정입니다.",
      "이 프로젝트로 SK 지오센트릭은 재활용 플라스틱을 혼합한 포장을 생산하는 첫 번째 현지 석유화학 회사가 될 것입니다. 이 재활용 소재의 적용은 연간 신규 플라스틱 사용량을 264톤 줄일 것으로 예상됩니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699283348080
  }
]
