[
  {
    "id": 36083620,
    "timestamp": 1685106710,
    "title": "Evidence that the shingles vaccine prevents a good chunk of dementia cases",
    "url": "https://twitter.com/PGeldsetzer1/status/1661776663074738176",
    "hn_url": "http://news.ycombinator.com/item?id=36083620",
    "content": "Thread ReaderPascal GeldsetzerSubscribe@PGeldsetzer1May 25 • 18 tweets • 24 min read Read on TwitterBookmarkSave as PDFBiggest thing to ever come out of my little group. Pls help spread this finding!We found clean, CAUSAL evidence that the shingles vaccine prevents a good chunk of dementia cases. So, could a virus cause Alzheimer’s->YES!Hear me out & see preprint: bit.ly/3MVqXU9🧵1/There’s recently been ⬆️ interest in the possibility that a virus may be involved in the causal pathways of dementia. Most attention has been on herpesviruses, incl the VZV that causes chickenpox and shingles, partly because of their lifelong latency (bit.ly/3nibvYk).2/In Wales starting in Sept 2013, the shingles vaccine was rolled out using an exact DOB cutoff. Those born on or after Sept 2 1933 were eligible, while those born earlier weren’t and remained ineligible for life. We analyzed EHR data for all of Wales with DOB exact to the week.3/We first show that just a one-week difference in age causes a massive (47 %-point) difference in the probability of ever getting the vaccine.This is paradise for getting at CAUSATION rather than correlation!4/After all, there’s no reason why those born one week before Sept 2 1933 should differ in anything from those born just one week later, EXCEPT for this diff in vacc receipt. This is just like a clinical trial: two exchangeable groups with only one getting the intervention.5/So, no need for the usual heroic assumption of perfect info on all confounders that make those who get the vacc different from those who don’t. This is crucial, and why our study is fundamentally different to other (all correlational) analyses in this area.What did we find?6/We first tried to replicate the vaccine’s known effect from clinical trials that it prevents shingles and PHN. It does – no surprise here but nice proof of concept.Now we test our real hypothesis: does getting vaccinated ⬇️ your chance of a dementia diagnosis years later?7/It does! We estimate that over a 7-year follow-up period, getting vaccinated averts one in five new dementia diagnoses. In the paper, we demonstrate through extensive robustness checks that it is essentially impossible that this finding is due to confounding.8/Given how robust this finding is across a large variety of specifications and series of robustness checks, it’s also extremely unlikely to be due to pure chance.9/We then show that the vaccine has no effect on any other common causes of morbidity or mortality. This is unlike correlational analyses that usually suffer from bias because healthier/more health motivated folk with better healthcare access are more likely to get vaccinated.10/Shingles is more common in women + ⬆️ recognition that the causes of Alzheimer’s may differ by sex (bit.ly/3HqGh8k). We find strong protective effects of the vaccine for women but none for men, and that this diff is driven by Alzheimer’s (not vascular) dementia.11/What’s needed next? 1) Randomized trials w/ precise cognition measures to determine exact effect size + optimal pop groups & time interval for vacc. Any interest @Merck @merckgroup @MerckFoundation @Merck_lifesci @GSK @GSKUS @GSK_bio? I have ideas for doing this ethically.12/2) Research to understand how the shingles vaccine prevents or delays dementia; and 3) trials to determine if the vaccine reduces (or maybe even reverses) cognitive decline among those with MCI or mild dementia.#neurotwitter #NeuroTwitterNetwork #Neuroscience13/Preprint: bit.ly/3MVqXU9FANTASTIC team: @meyting3, Min Xie, @simonhhessBig thanks to mentors: @steveaschmd, T Bärnighausen, S VollmerAnd funders: @czbiohub @NIAIDNews@Stanford @StanfordDeptMed @StanfordMed @stanford_pcph @StanfordEpiNews @StanfordHP @StanPopHealthWould LOVE comments from the causal inference crowd #epitwitter #econtwitter @melodem_group @MariaGlymour @goodmanmetrics @BaiocchiMike @drehkopf @ProfMattFox @guido_imbens @Susan_Athey @ER_Mayeda @PennCausal @NoahHaber @AnupamBJena @JacobBor @societyforepi @JeremySussman …… dementia leaders @RudyTanzi @alzfdn @TheADDF @AlzResearchUK @CureAlzheimers @ABFbrain @FisherCenter @StanfordBrain @BrainResilience @Stanford_Neuro @NIHAging @NeuroscienceNew @DementiaAllianc @AlzDisInt @womensbrainpro @UsAgainstAlz @womensalz @_BrightFocus… sci comm leaders @hmkyale @EricTopol @Bob_Wachter @hubermanlab @davidasinclair @PeterAttiaMD @thehowie @foundmyfitness @docartemis @NakedScientists @profvrr @garwboy @sleepdiplomat @kevinmd @Rbaltman @choo_ek @NAChristakis @devisridhar @CarlosdelRio7… & colleagues @IDDocJen @nikkilsud @vcharuMD @dkowens @boussard @SalomonJA @NathanLo3579 @RanakTrivedi @JuliaRaifman @oziadias @BruceNeal1 @mbondy2 @HeartBobH @JasonAndrewsMD @Shuchi_Anand @SaraJeanSinger @jjaimemiranda @uniklinik_hd @StanfordCDH @LongevityCenter @StanfordDBDS• • •Missing some Tweet in this thread? You can try to force a refreshTweetShareEmailKeep Current with Pascal GeldsetzerStay in touch and get notified when new unrolls are available from this author!Add to \"My Authors\" Read all threadsThis Thread may be Removed Anytime!Twitter may remove this content at anytime! Save it as PDF for later use!Save this thread as PDFTry unrolling a thread yourself!Follow @ThreadReaderApp to mention us!From a Twitter thread mention us with a keyword \"unroll\"@threadreaderapp unrollPractice here first or read more on our help page!Did Thread Reader help you today?Support us! We are indie developers!This site is made by just two indie developers on a laptop doing marketing, support and development! Read more about the story.Become a Premium Member ($3/month or $30/year) and get exclusive features!Become PremiumDon't want to be a Premium member but still want to support us?Make a small donation by buying us coffee ($5) or help with server cost ($10)Donate via PaypalOr Donate anonymously using crypto!Ethereum0xfe58350B80634f60Fa6Dc149a72b4DFbc17D341E copyBitcoin3ATGMxNzCUFzxpMCHL5sWSt4DVtS8UqXpi copyThank you for your support!Follow Us on Twitter!TweetShareHelp | About | TOS | Privacy | Twitter Files",
    "summary": "- The shingles vaccine has been found to have a protective effect against dementia, particularly Alzheimer's disease.\n- The study analyzed electronic health records and found that getting vaccinated reduces the chances of a dementia diagnosis by a fifth over a seven-year follow-up period.\n- The study also found that the vaccine has no effect on other common causes of morbidity or mortality, and that it has a stronger protective effect on women compared to men. Further research is needed to determine the exact effect size and optimal population groups and time interval for vaccination, as well as to understand how the vaccine prevents or delays dementia.",
    "hn_title": "Evidence that the shingles vaccine prevents a good chunk of dementia cases",
    "original_title": "Evidence that the shingles vaccine prevents a good chunk of dementia cases",
    "score": 598,
    "hn_content": "A study suggests that the shingles vaccine decreases the risk of getting dementia. Herpes viruses, including HSV1/2, may cause Alzheimer's, with the APOE4 genome making it worse. Other herpesvirus types can also be asymptomatic. There are ongoing efforts to develop cures and vaccines for herpes viruses, including chickenpox and shingles. Research shows that the chickenpox vaccine does not eliminate the risk of Alzheimer's, but it reduces the chances of contracting the varicella-zoster virus, which causes shingles. Epstein-Barr virus may be a key factor in multiple sclerosis, but there are no effective antivirals to treat it. People diagnosed with chronic herpes infections might be at risk of chickenpox-related dementia. Few first-line therapies are available, causing chronic mono patients to suffer fatigue and malaise with no cure in sight.Graduate school and academia can be difficult to navigate for people with disabilities, especially those with chronic illnesses and limited financial resources. Despite this, some individuals with disabilities continue to pursue STEM fields, such as software engineering and medical research, in hopes of making a difference. However, high barriers to entry and limited funding for research in certain fields can make it difficult for non-traditional candidates to participate. Additionally, evidence suggests that some chronic illnesses, such as multiple sclerosis and chronic fatigue syndrome, may be linked to certain viruses, such as Epstein-Barr virus and herpes simplex virus, creating further complications for individuals with these conditions. Despite these challenges, some companies and researchers are exploring new approaches, such as mRNA vaccines, to address disease.The article discusses how mutations in viruses can affect the effectiveness of vaccines. The spike protein in Covid-19, for example, was highly conserved until it mutated to evade the highly-specific immunity created by mRNA vaccines, resulting in the Omicron variant. mRNA vaccines, however, can \"target specific sequences\" and avoid problematic sequences. The article also includes discussions on nucleic-acid based vaccines and protein-based vaccines, as well as the positive impact of mRNA technology on rapid vaccine development. The comment section contains discussions on the cost and funding priorities of medical research, herpes zoster, and possible links between viral infections and dementia.A study on the potential link between the shingles vaccine and the prevention of Alzheimer's disease has found that being eligible for the vaccine can have a prophylactic effect against dementia. Researchers found a significant decrease in dementia rates in the vaccinated population born one week after the eligibility cut-off date compared to those born one week before the cut-off date. The study also found the protective effects were stronger for women than men, and that the vaccine may be beneficial against Alzheimer's but not vascular dementia. The apparent link raises questions about Alzheimer's as a potential virus-related disease. However, several commenters warned that the effect could be too small to prompt preventive measures and that the study only demonstrated an indirect link.A new study suggests the shingles vaccine might have \"significant protective effects\" against Alzheimer's disease in women. The study found that women who had received the shingles vaccine were found 70% less likely to develop Alzheimer's. Researchers suggest that the vaccine might stimulate immune cells to help clear the brain of toxic beta-amyloid and tau proteins, which have been linked to Alzheimer's. However, the results in men were inconclusive, with some suggesting that there was a potential protective effect that the study could not detect due to lack of statistical power. The Shingrix vaccine should still be taken to protect against shingles, as shingles is also a potentially debilitating illness.",
    "hn_summary": "- The shingles vaccine may decrease the risk of developing dementia.\n- Herpes viruses, including HSV1/2, may cause Alzheimer's, with the APOE4 genome making it worse.\n- Ongoing research is exploring new approaches, such as mRNA vaccines, to address disease and viruses."
  },
  {
    "id": 36078746,
    "timestamp": 1685065402,
    "title": "Amazon Backs Out of Climate Pledge, Deletes Shipment Zero Initiative Blogpost",
    "url": "https://www.businessinsider.com/amazon-shipment-zero-gives-up-most-important-part-climate-pledge-2023-5",
    "hn_url": "http://news.ycombinator.com/item?id=36078746",
    "content": "Amazon CEO Andy Jassy. Jerod Harris/Getty Images for Vox MediaAmazon scrapped its Shipment Zero initiative, which was announced a few years ago.The company has rolled the goal into its broader Climate Pledge to become carbon-neutral by 2040.Amazon deleted the original Shipment Zero blog post. We dug it up.Often, it can feel like big corporations choose their bottom line when it comes to hard choices over profit versus the environment. Amazon is giving off that vibe this week.The ecommerce giant recently backed out of a commitment to make 50% of its shipments net-zero carbon by 2030. Amazon said in a statement that it would roll this goal into a broader Climate Pledge to reach net-zero carbon across all its operations by 2040. That's a decade later than the 50% goal, which was called \"Shipment Zero\" at the time.\"As we examined our work toward The Climate Pledge, we realized that it no longer made sense to have a separate and more narrow Shipment Zero goal that applied to only one part of our business, so we've decided to eliminate it,\" Amazon wrote in the statement.The investigative reporter Will Evans squeezed this information from Amazon and tweeted about it Thursday. Last year, Evans uncovered a study that said the company had drastically undercounted its carbon footprint. At the time, an Amazon spokesman reiterated the company's commitment to cutting emissions, including ordering a fleet of electric delivery vans and buying renewable energy for its electricity needs.Dropping the specific shipment pledge is noteworthy because Amazon's ecommerce operation relies on vast fleets of vehicles and aircraft to deliver packages to consumers quickly. Most of this activity chews up vast quantities of fossil fuels and spews out greenhouse gases. However, fast delivery is a key selling point for shoppers and the main reason millions subscribe to the company's Prime program.Amazon announced the Shipment Zero initiative in a blog a few years ago. The company has since deleted the post. However, through the magic of the Internet Archive's Wayback Machine, large corporations cannot rewrite online history. Here's a version of the blog.Some choice phrases from the announcement, so you can see what Amazon is backing out of now:\"We can now see a path to net zero carbon delivery of shipments to customers, and we are setting an ambitious goal for ourselves to reach 50% of all Amazon shipments with net zero carbon by 2030.\"\"We believe that lower costs include lowering the costs to the environment we all live and work in every day. We'll keep you posted as we work towards achieving Shipment Zero.\"\"It won't be easy to achieve this goal, but it's worth being focused and stubborn on this vision and we're committed to seeing it through.\"Read nextE-CommerceAmazonAmazon Climate PledgeMore...",
    "summary": "- Amazon has backed out of its Shipment Zero initiative, which aimed for 50% of its shipments to be net-zero carbon by 2030.\n- The company will instead roll this goal into its broader Climate Pledge to become carbon-neutral by 2040.\n- Amazon has deleted the original Shipment Zero blog post, but an archived version is available.",
    "hn_title": "Amazon Backs Out of Climate Pledge, Deletes Shipment Zero Initiative Blogpost",
    "original_title": "Amazon Backs Out of Climate Pledge, Deletes Shipment Zero Initiative Blogpost",
    "score": 481,
    "hn_content": "Amazon has backed out of its Climate Pledge and removed the Shipment Zero initiative. Amazon bought the naming rights for the Climate Pledge Arena in Seattle, yet public transportation infrastructure around the arena is considered horrendous, leading people to avoid it entirely. The West Seattle/Ballard Link Extensions may include stops at Seattle Center, but shovels will not be in the ground until 2026, and there is no ETA for completion. The slow progress in Seattle's planning and construction has been attributed to modern civil engineering methods being incredibly inefficient, as each possible way of building the infrastructure must be considered along each segment, including studying environmental impact, leading to massive delays. The tech industry in Seattle has grown faster than infrastructure can keep up with, leading to horrendous traffic and two-hour commutes.There is no meaningful content in this text.The article discusses the topic of holding corporations accountable for their carbon emissions goals. Some argue that companies that promote goals for PR purposes should be held accountable for missing them, while others believe that the focus should be on laws that set emissions limits. The idea of carbon offsetting is criticized as greenwashing accounting shenanigans. Microsoft is mentioned as the only hyperscaler that seems to take carbon emissions seriously, aiming for carbon zero by 2030. However, some criticize the emissions caused by resource-demanding OSes and unwanted features within them. One person quit Amazon Prime due to the environmental impact caused by delivery vans. Some argue that having fewer people driving to a neighborhood through delivery could be more efficient than people driving to stores individually.- Amazon is no longer committed to its pledge to reduce delivery emissions by 50% by 2030.\n- Instead, the company is rolling the goal into a broader Climate Pledge.\n- Some customers are unhappy and have canceled their Prime subscriptions in response to the news.\n- There is debate over whether individual actions, such as canceling subscriptions, are effective in promoting change.\n- Companies are struggling to balance environmental commitments and financial profits.\n- The effectiveness of carbon offsets and biofuels as solutions to reducing emissions is disputed.",
    "hn_summary": "- Amazon has backed out of its Climate Pledge and removed the Shipment Zero initiative.\n- Some customers have canceled Prime subscriptions due to the change.\n- Debate exists over the effectiveness of individual actions in promoting change, and the usefulness of carbon offsetting and biofuels in reducing emissions."
  },
  {
    "id": 36087442,
    "timestamp": 1685123292,
    "title": "Paper Airplane Designs",
    "url": "https://www.foldnfly.com/#/1-1-1-1-1-1-1-1-2",
    "hn_url": "http://news.ycombinator.com/item?id=36087442",
    "content": "Hangar(current)AirplanesRunwayTips & TricksLoungeRead & LearnSign InKid ModePaper Airplane DesignsA database of paper airplanes with easy to follow folding instructions, video tutorials and printable folding plans. Find the best paper airplanes that fly the furthest and stay aloft the longest. Learn how to make paper airplanes that will impress your friends.Today isMay 26thNational Paper Airplane DayGrab a friend and celebrate!Search Airplanes48 out of 48.TypeDistanceTime AloftAcrobaticDecorativeDifficultyEasyMediumHardExpertScissors    No Scissors    Yes Scissors    Whatever    Parents & TeachersActivities & ExperimentsLesson PlansParty GamesScience ExperimentsHow to SteerBest Paper PlanesMore...The BasicEasytime aloftBasic DartEasydistanceThe StableEasytime aloft, acrobaticThe BuzzMediumdistance, time aloftThe SprinterMediumdistance, acrobaticThe Sea GliderMediumdecorativeHunting FlightMediumdistance, time aloftHeavy-Nosed PlaneHarddistance, time aloftRoyal WingHardacrobaticGliding PlaneHardtime aloft, acrobaticTailed PlaneMediumdistance, time aloftStar WingMediumacrobatic, decorativeWater PlaneEasytime aloft, acrobaticThe UFOMediumtime aloft, acrobaticCross WingMediumdistance, time aloftSpin PlaneHardacrobaticStunt PlaneHardacrobaticThe SquareMediumdistance, time aloftOrigami PlaneExpertdistance, time aloft, acrobaticEagle EyeMediumdecorativeWhite DoveMediumdecorativeFast HawkExpertdistance, time aloftKing BeeMediumacrobaticZip DartHarddistance, time aloftJet FighterHarddistance, time aloftUnderside PlaneMediumtime aloftSailor Wing PlaneExpertdistance, time aloftLock-Bottom PlaneEasydistance, time aloftThe BirdHarddistanceFast SwallowHarddistance, time aloftSoaring EagleHardtime aloftNavy PlaneHarddistance, time aloftCanard PlaneHarddistanceTail SpinEasyacrobaticLift OffEasydistanceV-WingMediumdistance, time aloftVultureHarddistance, time aloftSonic JetHarddistance, time aloftSpinner PlaneMediumacrobatic, decorativeStealth GliderMediumdistance, time aloftLight SpinnerMediumdistance, acrobaticFun FlyerHarddistanceLoop PlaneEasyacrobatic, decorativeWedge PlaneMediumdistanceFast GliderMediumdistance, time aloftThe ArrowExpertdistanceThe RavenEasydistanceThe TrooperMediumdistanceAbout Fold'NFlyFor more than 10 years, Fold'NFly has been teaching people around the world how to make paper airplanes. Our extensive database of designs includes step-by-step instructions, video guides and printable templates where you simply fold on the numbered lines to get a perfect paper plane, every time.In addition to the paper airplane plans, we have a collection of expert tips & tricks that will help you perfect your folded aircraft and achieve optimal performance. We also have a collection of paper airplane articles on a variety of topics that enthusiasts may find interesting. For example, discover some paper airplane world records or learn how to make a paper airplane launcher.Whether you are an expert paper airplane ace pilot or a novice student aviator, we have something for everyone. We hope that you will enjoy this fun activity and share it with friends and family.Copyright © 2023 Privacy & Terms Contact Us",
    "summary": "- 'Paper Airplane Designs' is a website that teaches people how to make paper airplanes with easy to follow folding instructions, video tutorials and printable folding plans.\n- The website offers a database of over 48 paper airplane designs categorized based on their level of difficulty, type, and purpose, including acrobatic, decorative, and distance flyers.\n- The website also includes expert tips & tricks, articles on various topics, and activities & experiments for paper airplane enthusiasts to explore and enjoy.",
    "hn_title": "Paper Airplane Designs",
    "original_title": "Paper Airplane Designs",
    "score": 470,
    "hn_content": "Hacker News new | past | comments | ask | show | jobs | submit loginPaper Airplane Designs (foldnfly.com)471 points by thunderbong 12 hours ago | hide | past | favorite | 52 commentsktm5j 11 hours ago | next [–]I think it's really cute how they handled the case if the user unchecks all of either the \"Type\" or \"Difficulty\" filters hehereplyrootusrootus 9 hours ago | parent | next [–]I wonder if they've tested that one against conventional designs. Depending on how well you compress the ball, it might well be very competitive for distance.replyHiroProtagonist 11 hours ago | parent | prev | next [–]Same, thank you for mentioning it elsewise I would never have seen it.replyduxup 10 hours ago | parent | prev | next [–]I like the implication that there was a goof on someone’s part.I get a lot of “yeah but what if they do something like search for things that don’t exist” (or similar situations) and some weird ideas follow about how they user gets confused and the software is supposed to solve all “user behaves illogically” problems and we get some really strange solutions that makes the software even more unpredictable.Like no man, search for nothing is “yo you goofed and searched for nothing”./rantreplyyabones 9 hours ago | prev | next [–]I'm surprised they don't have the \"lock fold\" or \"Nakamura Lock\" design. When I was younger, that was the most consistent design for a good plane. Not always the best, but never the worst. Somebody talented could fold up a dart to beat it on distance, or a glider to stay up longer, but everybody could make a decent \"lock fold\".https://origamimag.com/nakamura-lock-paper-airplane/replyvasvir 1 hour ago | parent | next [–]I agree. I didn't know it had a name. Thanks for it.Also plus points. 1) It was easy to remember how to fold it. 2) It had good structural resistance and could withstand several flights and bumps. 3) It provided the first lesson in aeronautical engineering i.e. you could slightly tilt the one or the other wing in order to make flight behavior corrections.My real love was one model that I didn't know how to make. An older cousin did. It was a tailed design. Best Flight Ever... See, when you are 5 it is easy to impress!replytakoid 9 hours ago | parent | prev | next [–]This is the exact same design I used in middle school to win a paper airplane competition! It is called \"The Moth\" on the website I found it on back in the day: https://www.10paperairplanes.com/how-to-make-paper-airplanes.... I still remember how to make it to this day.replyandrewflnr 9 hours ago | parent | prev | next [–]This one doesn't cut it? https://www.foldnfly.com/2.html#The-Stable Granted, they fold the wings a really weird/ugly way. Also this variant for some reason: https://www.foldnfly.com/29.html#Lock-Bottom-PlaneThat's not even the kind of lock I expected. It's possible to design a plane so once the wings are folded down, the fuselage is locked in a tightly folded position. I don't have a good online reference at the moment...replymarkdown 1 hour ago | parent | prev | next [–]This is the only plane design made in my country. Every kid makes these.replyselecsosi 23 minutes ago | prev | next [–]One of my favorite research projects on the subject. This research publication from the 2014 siggraph conference covers a ML backed design optimization approach to design novel paper airplanes designs, and simulate flight paths.[Research]: http://www.nobuyuki-umetani.com/publication/2014_sigg_pterom...[Video]: https://www.youtube.com/watch?v=-KJUVJAUY8oreplydang 11 hours ago | prev | next [–]Related:Paper Airplane Designs (2013) - https://news.ycombinator.com/item?id=32134691 - July 2022 (96 comments)Paper Airplane Designs - https://news.ycombinator.com/item?id=29466325 - Dec 2021 (8 comments)Wake Turbulence from a Paper Airplane (2020) [video] - https://news.ycombinator.com/item?id=27137827 - May 2021 (29 comments)Paper Airplane Designs - https://news.ycombinator.com/item?id=23545860 - June 2020 (8 comments)Paper Airplane Designs - https://news.ycombinator.com/item?id=18249755 - Oct 2018 (206 comments)Designing, folding, and flying the finest paper airplanes [video] - https://news.ycombinator.com/item?id=16784941 - April 2018 (11 comments)Learn How to Fold a World-Record-Setting Paper Airplane - https://news.ycombinator.com/item?id=16715728 - March 2018 (14 comments)Real Paper Airplane Designs - https://news.ycombinator.com/item?id=12632253 - Oct 2016 (1 comment)The best paper airplane in the world - https://news.ycombinator.com/item?id=420523 - Jan 2009 (30 comments)replyrekoros 3 hours ago | prev | next [–]When I was pretty young - maybe six - I spent about a month at a hospital in the USSR. I don’t know why I was there (observation?), and it’s not be point - the point is, while there, slightly older patients taught me how to fold beautiful paper airplanes, with unbelievable aerodynamic properties - I mean those things could fly.Many years later, I was taking an aerodynamics course at Embry-Riddle Aeronautical University taught by Bob Sweginnis (died in plane crash, while practicing aerobatics), who dedicated an entire class to a paper airplane contest. The winning criteria was “plane that stays in the air the longest wins”.My plane came in second - I designed it to make an easy curve through the bungalow to maximise air time, and Bob Sweginnis did an excellent job launching it. He stopped the timer when my plane hit the wall of the bungalow, with plenty of altitude to spare.The winner? A sheet of paper, basically, that pendulumed to the green carpet in a swinging motion, like a leaf, about a second slower than it took my Mona Lisa to commit suicide.replyshanewwarren 3 hours ago | parent | next [–]That's great! Reminds me of elementary school when I was in \"gifted and talented... \" program. We did a similar experiment. Each kid had some ornate paper airplane, but my simple design won out.replymg 11 hours ago | prev | next [–]I tried a lot of paper plane designs and this one is by far the most elegant design and the best flying plane I found so far:https://www.youtube.com/watch?v=EDiC9iMcWTcThe simple flight path in the video does not relly do it justice. When you throw it outside, it will have a beautiful loooong curved flight. When there is some wind, it often goes to explore the sky for quite a while before it comes back down again.If anybody knows a design that can compete with this one, I would be very interested to try it!replynielsbot 10 hours ago | parent | next [–]That's a great one. (The \"Suzanne\") Wired covered it a few years ago. Simple enough my 7 year old son can do a credible job of folding it.https://www.wired.com/story/learn-how-to-fold-a-world-record...replyJKCalhoun 12 hours ago | prev | next [–]Very cool. I always upvote anything about paper airplanes, ha ha.Many, many hours of my youth were spent making paper airplanes and flying them. I also enjoyed modifying designs with my own embellishments to see if my changes were improvements or no.Perhaps after catching \"The Birdmen\" (1971) on TV I became obsessed with building catapult-like paper airplane launchers using thread, paper clips and weights to drag the airplanes along the length of the kitchen table and send them sailing off the end.I think part of this was due to a lack of toys to entertain myself with (my sister and I, growing up with a single mother who worked as a secretary — she stole office products so that I was kept in letter-size paper, pencils, pens). Perhaps too there were a lot of those months spent indoors in the either too-cold or too-hot/humid Midwest.replyjareklupinski 10 hours ago | prev | next [–]Spent a lot of time throwing paper rings: https://www.10paperairplanes.com/how-to-make-paper-airplanes...you get some really good distance if you throw it like a (american) football, managed to clear a couple city blocks once, thrown on a hot dry day from a high floor at school...replyJKCalhoun 1 hour ago | parent | next [–]Those are cool.Because I am unsafe, I started making them from aluminum cans with the top/bottom cut off. Some strips of duct tape along one of the edges balances it (and so defines your leading edge).The right wrist action was needed but you could send them sailing across an auditorium to clatter against the far wall.replym463 11 hours ago | prev | next [–]Many years as a kid were spent reading through this old book my father had:The Great International Paper Airplane Bookhttps://archive.org/details/greatinternation00mandrichreplycaboteria 7 hours ago | parent | next [–]When I was 10 or 11 years old I won a mai-tai cocktail in a paper airplane contest at Club Med. I used the helicopter from this book!replycwilkes 7 hours ago | parent | prev | next [–]Hah! Me too. Fond memories.replystandardly 11 hours ago | prev | next [–]My cousin and I were particularly destructive children and used to build paper airplanes and fly them up into the ceiling fan. Sometimes they'd get caught on a blade and come flying off. Was playing a lot of Starfox 64 at the time, so we imagined we were attacking a boss. We'd try and see how many attacks we could get in before our plane was completely mangled and wouldn't fly anymore. Good times.Another destructive game we used to play was lighting army men on fire and fusing their melted plastic bodies together to create a zombie army of plastic amalgamations. Half-green, half-tan grenadiers with bazookas for a heads, etc. God bless America!replytimbeccue 10 hours ago | parent | next [–]Hah, I flew planes into ceiling fans too! I also remember scraping my planes against the floor until holes wore into the paper, and seeing how well they could continue flying. There was something really cool about seeing a plane with so much accumulated damage still able to fly.replyfelipesabino 12 hours ago | prev | next [–]It has been a while that I try to find the design for this type of paper plane [1] that glides so smoothly and allows you to guide it.I am not even sure how to search for it, even with this database in hands[1] https://youtu.be/UVUQC_yZe_YreplyJKCalhoun 11 hours ago | parent | next [–]Filter by \"Time Aloft\" [1]. I did and don't see the specific plane in the YT video (they certainly don't have every airplane in their database).Search for Walkalong Glider [2] to find what you want.[1] https://www.foldnfly.com/#/0-1-0-0-1-1-1-1-2[2] https://www.youtube.com/results?search_query=walkalong+glide...replyfelipesabino 11 hours ago | root | parent | next [–]\"Walkalong Glider\", uow, I didn't even know the term to look for, thanks!replylelanthran 11 hours ago | parent | prev | next [–]Honestly it looks like it is flying solely on the thermals from his breath.Still pretty cool though :-)replydrewtato 10 hours ago | prev | next [–]There's 48 designs, so this isn't much of a database, more like a short list. For something completely different, my favorite collection of paper planes are those by Jayson Merrill: https://www.youtube.com/@jayson5674 They're the most complex planes I've seen under the restrictions of no cuts and no adhesive. Here's a good one: https://www.youtube.com/watch?v=K-n6NAbJdukreplydoublepg23 10 hours ago | parent | next [–]The fact we have YouTube channels for people making paper airplanes, eating MREs and reviewing junk MP3 players is what keeps me optimistic of the Internet.replycoin 6 hours ago | prev | next [–]Many of those are from the classic Great International Paper Airplane Book published in 1967.replycarapace 5 hours ago | parent | next [–]FWIW, the site presents a variation of the origami design of Prof. James M. Sakoda of Brown University \"winner of the origami award in the First International Paper Airplane Contest\" in 1967 as published in that book.replyjtr1 9 hours ago | prev | next [–]I spent a very fun holiday break methodically working through these with my nephew and documenting how far we could get them to fly. Big takeaway is that simpler is better and the classics are classic for a reason!replycpayne624 6 hours ago | prev | next [–]Love it. My 8 y/o is stoked to use up all of daddy's printer paper on designs :)replyjhanschoo 8 hours ago | prev | next [–]My childhood interest in paper airplanes was completely fuelled by the excellent https://archive.org/details/PAPERAIR , which you can now find on the Internet Archive by the link! The emulation is imperfect, though.replylbotos 9 hours ago | prev | next [–]If you'll accept one piece of tape (not totally needed but does help) one of my favorite designs is the tube. Super easy to make, flies decently well, and surprises most people: https://www.instructables.com/The-Incredible-Flying-Paper-Tu...replyhackernewds 9 hours ago | parent | next [–]Unacceptable!replydang 11 hours ago | prev | next [–]We changed the url from https://www.foldnfly.com/lounge/national-paper-airplane-day.... to the home page, which is a better match for the title.replythunderbong 11 hours ago | parent | next [–]I should have titled it 'National Paper Airplane Day'!replymysterydip 11 hours ago | prev | next [–]Something I've been curious about, are there paper airplane designs that translate to usable full scale designs? If not, why not?replyPxtl 11 hours ago | prev | next [–]Paper Plane:- 1oz Amaro Nonino- 1oz Aperol- 1oz bourbon- 1oz lemon juiceshake with ice, strain to a chilled coupe glass.replydoublepg23 10 hours ago | parent | next [–]I appreciated OpenWRT’s prior release naming system which included cocktail recipes in the Message of the Day (MOTD) https://en.wikipedia.org/wiki/OpenWrt#:~:text=OpenWrt%20rele....replyswarnie 11 hours ago | parent | prev | next [–]A very short one and done drink by the sounds of it.replyvoynich 10 hours ago | prev | next [–]Glad to see that paper airplane culture is still alive, haha. I was looking forward to this day for a while!replyphotochemsyn 5 hours ago | prev | next [–]Look up whitewingsreplysacnoradhq 4 hours ago | parent | next [–]I have an unused set of the original vintage kits. There are quite a number of loop wing and asymmetric ones. These are more advanced than paper airplanes.replywhoisthis4chan 6 hours ago | prev | next [–]the lock-bottom plane used to be my bread & butter in elementary schoolreplyhk1337 11 hours ago | prev | next [–]Put this in the list of things I didn't know I needed.replytommywiseausmom 8 hours ago | prev | next [–]design this paper plane. (grabs crotch) oh!replyokl 11 hours ago | prev | next [–]I had a book around the turn of the century with paper airplane folding instructions. Lazily, I stuck to the simple ones and my favourite was called \"Phoenix\". Could not find it on this page but searching for the book I found a video where the author demonstrates: https://m.youtube.com/watch?v=2V55rc58cDgreplyakramer 2 hours ago | parent | next [–]The book you're thinking of is called \"the gliding flight\" and is my favorite paper airplane book.https://www.amazon.com/Gliding-Flight-Paper-Make-Original-Ai...replysumtechguy 11 hours ago | parent | prev | next [–]whenever a discussion like this comes up I try to recommend this bookhttps://www.amazon.com/gp/product/0671555510Not as simple as the one in that vid. But a decent selection of them.replynoobcoder 11 hours ago | prev [–]is there a way to query it?replyApplications are open for YC Summer 2023Guidelines | FAQ | Lists | API | Security | Legal | Apply to YC | ContactSearch:",
    "hn_summary": "- A website has a collection of paper airplane designs, with filters for type and difficulty\n- Users discuss the effectiveness of the designs and suggest other designs that should be included\n- Some users share personal stories and memories of paper airplanes, and others reference past posts about paper airplane designs on Hacker News"
  },
  {
    "id": 36078709,
    "timestamp": 1685065094,
    "title": "htmx",
    "url": "https://htmx.org/",
    "hn_url": "http://news.ycombinator.com/item?id=36078709",
    "content": "</> htmxdocsreferenceexamplestalkessays</> htmx high power tools for HTMLNEWS: We are excited to announce that htmx has been accepted into the first class of the Github Open Source Accelerator!introductionhtmx gives you access to AJAX, CSS Transitions, WebSockets and Server Sent Events directly in HTML, using attributes, so you can build modern user interfaces with the simplicity and power of hypertexthtmx is small (~14k min.gz’d), dependency-free, extendable, IE11 compatible & has reduced code base sizes by 67% when compared with reactmotivationWhy should only <a> and <form> be able to make HTTP requests?Why should only click & submit events trigger them?Why should only GET & POST methods be available?Why should you only be able to replace the entire screen?By removing these arbitrary constraints, htmx completes HTML as a hypertextquick start <script src=\"https://unpkg.com/htmx.org@1.9.2\"></script> <!-- have a button POST a click via AJAX --> <button hx-post=\"/clicked\" hx-swap=\"outerHTML\">  Click Me </button>The hx-post and hx-swap attributes on this button tell htmx:“When a user clicks on this button, issue an AJAX request to /clicked, and replace the entire button with the HTML response”htmx is the successor to intercooler.jsRead the docs introduction for a more in-depth… introduction.sponsorshtmx development can be supported via Github SponsorsThank you to all our generous supporters, including:ʕ •ᴥ•ʔ made in montanahaikujavascript fatigue:longing for a hypertextalready in handdocsreferenceexamplestalkessays@htmx_org",
    "summary": "- htmx is a tool that allows users to access AJAX, CSS Transitions, WebSockets and Server Sent Events directly in HTML, making it easy to build modern user interfaces.\n- It is small, dependency-free, extendable, IE11 compatible, and reduces code base sizes by 67% compared to react.\n- The tool removes arbitrary constraints on HTTP requests and replaces intercooler.js as its successor. You can start with just one line of code and support htmx's development through Github sponsors.",
    "hn_title": "htmx",
    "original_title": "htmx",
    "score": 414,
    "hn_content": "Developers discuss the benefits of htmx, a library that substitutes a DOM element with the HTML response acquired from an on-click HTTP request instead of redirecting to a new page. htmx simplifies hypermedia development modalities, allows back-end teams to work with preferred languages, and permits developers to integrate with other JavaScript libraries, besides enabling interdependent data manipulation and allowing server-side routing. Bibliographic comparisons were made with Handlebars, jQuery, React, and Angular during development. The notion behind the platform is to attain the right balance between simplicity and offering a goody worth adding some salt to the web development recipe. Concerns have been expressed about the update actions often being too unrestricted, not allowing systematic progress analysis of the program's source code.The post discusses different approaches to programming with JavaScript, such as using HTMX and React for structuring components and interactions. While some commenters argue against using frameworks due to their complexity and constantly changing nature, others tout the benefits of having some structure and organization in the form of API endpoints, one-way data flow, and reusable components. Additionally, some discuss the challenges of developing for poor network connections and whether a native app might be better suited for certain use cases. Overall, the post provides insights into various perspectives on using JavaScript and frameworks.- JavaScript developers argue that the negative image of their code is a result of junior developers creating sloppy code and not reflective of the language's actual capabilities.\n- The ecosystem of JavaScript and web development is constantly changing, with new frameworks and libraries emerging regularly.\n- React has emerged as the dominant framework over the past six years, and it is recommended for developers looking to build their skills and remain employable.\n- Some developers are criticizing the complexity of JavaScript and the challenges of maintaining complex web apps.\n- HTMX, a dependency-free JavaScript library, is gaining traction as a solution for simplifying web development and improving productivity.HTMX, a client-side web framework, is gaining popularity due to its ease of use and ability to create dynamic web applications without extensive knowledge of JavaScript or other complex frameworks. HTMX is based on HyperTalk, the scripting language of HyperCard, while incorporating web-specific syntax. HTMX allows developers to write web apps the way they did in 1999, but with the ability to update pages partially, make forms more dynamic, and create interactive features with ease. Many developers have used HTMX to build small or medium-scale projects, such as internal tools or marketing agency websites that require simple forms and dynamic features. HTMX’s strengths primarily lie in its ease of use, the simplicity of the primary documentation, and its strong focus on backend development.HTMX is a library that targets web developers who need interactivity on their website while still using plain vanilla HTML, allowing developers to use good old anchor and form tags to fall back to full-page loads if JavaScript is disabled. By submitting a form with a post request and then loading an entire page with a thank you message, the local hair salon taking reservations, mom and pop store's contact form, or a local newspaper's letter to the editor form can be done without htmx or JavaScript. HTMX removes abstractions from web projects, extending the existing abstraction of hypermedia to implement many common UI patterns without additional concepts. HTMX does have some limitations as progressive enhancement requires good knowledge of HTTP and the DOM. HTMX does require JavaScript to work, although it can fall back to full-page loads if JavaScript is disabled. Overall, HTMX provides a simple, accessible solution for some use cases but may not serve as a long-term solution for more complex use cases.Developers are discussing the benefits and purpose of htmx, a tool that aims to remove arbitrary limitations from HTML and reduce the need for JavaScript. Some commenters argue that HTML is designed to be dynamic via hypermedia controls, while others believe that the distinction between HTML, CSS, and JS is already well-defined and serves as a useful separation of concerns. Nonetheless, some believe that htmx is a valuable tool for simplifying web development, particularly for backend developers who may not have extensive JS knowledge. Some commenters also mention alternative tools and frameworks, including Unpoly, Phoenix LiveView, and Hotwire. The discussion touches on various aspects of web development, including web crawling, web design, and frontend vs. backend development.- HTMX is a client-side JS system for building interactive HTML applications without directly touching JavaScript. \n- HTML itself is barely useful as a starting point for building applications. \n- Unpoly would be easier to use for creating interactive documentation websites with static site generators like Hugo. \n- It is technically feasible to create interactive documentation with HTMX in Hugo but the tooling is not there yet. \n- There are debates about how to write idiomatic HTML and the use of other technologies such as React. \n- The aesthetic of the filler text on HTMX examples is generated by Hipster Ipsum. \n- The <details> tag can be used for a hamburger menu but it can be bad for accessibility.",
    "hn_summary": "- HTMX is a library that substitutes a DOM element with the HTML response acquired from an on-click HTTP request instead of redirecting to a new page, simplifying hypermedia development modalities and allowing backend teams to work with preferred languages.\n- Some developers criticize the complexity of JavaScript and challenges of maintaining complex web apps, while others discuss the benefits of having some structure and organization in the form of API endpoints, one-way data flow, and reusable components.\n- HTMX is gaining popularity due to its ease of use and ability to create dynamic web applications without extensive knowledge of JavaScript or other complex frameworks, but may not serve as a long-term solution for more complex use cases."
  },
  {
    "id": 36088672,
    "timestamp": 1685130132,
    "title": "0AD, an open source historical RTS in development for 22 years",
    "url": "https://play0ad.com/",
    "hn_url": "http://news.ycombinator.com/item?id=36088672",
    "content": "The next alpha of 0 A.D. will feature an experimental Vulkan backend!Posted on January 13, 2023 by Stan in NewsThe next alpha of 0 A.D. will feature an experimental Vulkan backend!You can test it and report bugs by downloading the development version of the game.More information here: https://wildfiregames.com/forum/topic/104382-vulkan-new-graphics-api/#comments",
    "summary": "- The next alpha of 0 A.D., an open-source historical RTS game, will have an experimental Vulkan graphical interface.\n- The Vulkan backend can be tested by downloading the development version of the game.\n- Users can report bugs related to the Vulkan backend on the game's forums.",
    "hn_title": "0AD, an open source historical RTS in development for 22 years",
    "original_title": "0AD, an open source historical RTS in development for 22 years",
    "score": 410,
    "hn_content": "- 0AD, an open-source historical RTS, has been in development for 22 years and has gained popularity due to its similarity to Age of Empires II.\n- Its pathfinding algorithm has been praised for its naturalistic and immersive experience, compared to AOEII's.\n- The importance of good pathfinding can make or break an RTS game; sub-par pathfinding can strongly affect player experience.\n- The success of nostalgic games like Breath of the Wild and League of Legends proves that old games can still hold a following.\n- The free and open-source nature of games like 0AD and Pokemon Showdown add to their appeal for players seeking original and untainted content.0AD, an open-source RTS game that has been in development for over a decade, has captured players' hearts due to its ubiquity, accessibility, and gameplay elements such as building capture. People are passionate about games such as Age of Empires, with 0AD often being preferred over the actual games due to its stable gameplay. The game is still deemed \"alpha\" due to the significant changes between releases, but it is completely playable and stable for all conditions. The game has had almost 30 thousand commits and has a GitHub mirror. The game's matchmaking and gameplay experience, in general, is excellent. The future macOS ARM build is highly anticipated, and it is hoped that the developers will eventually release a 1.0 version.0 AD, an open-source historical RTS game, is being continuously developed by a community of volunteers, each working on features they are interested in. While some users feel that the development focus should be on improving core functionality rather than adding new features, others appreciate the evergreen aspect of such \"Never-Done\" projects. 0 AD is a unique game with its \"region of control\" concept, where players cannot build anything anywhere, and soldiers are also used as builders and resource gatherers. The game is an enjoyable experience for kids who want to learn about history, building resources, building alliances, and destroying empires. While a few users have faced issues with network gameplay, the game is well-received by the community and continues to be developed.",
    "hn_summary": "- 0AD is an open-source historical RTS game that has been in development for over a decade and gained popularity due to its similarity to Age of Empires II.\n- The game's pathfinding algorithm has been praised for its naturalistic and immersive experience, which is crucial to the player experience in RTS games.\n- The free and open-source nature of 0AD and similar games like Pokemon Showdown adds to their appeal for players seeking original and untainted content."
  },
  {
    "id": 36081655,
    "timestamp": 1685090900,
    "title": "Layoffs push down scores on Glassdoor – how companies respond",
    "url": "https://newsletter.pragmaticengineer.com/p/layoffs-push-down-scores-on-glassdoor",
    "hn_url": "http://news.ycombinator.com/item?id=36081655",
    "content": "Several tech companies are flagging negative reviews on Glassdoor for removal and encouraging staff to post 5-star reviews to balance out the negative. Glassdoor is able to remove unfavorable reviews that violate its guidelines; however, they do not notify the user whose review was removed and do not share the reasons behind removing the review. Glassdoor is a neutral platform that enforces its own terms and conditions but could make the process clearer by publishing a moderation log explaining why a review was removed. Companies often encourage employees to leave positive reviews on Glassdoor, ranging from sending out reminders to organizing review events. Some companies even asked employees to leave a positive review during their first week of work. Some companies saw an increase in their Glassdoor scores after layoffs, like Trustwave, with anonymous “spam” reviews contributing heavily to the score increase.- Fake 5-star Glassdoor reviews have a going rate of $10-25 per review on marketplaces, according to solution scientist Shikhar Sachdev's investigation of the underground economy of Glassdoor reviews.\n- It is advised to approach Glassdoor reviews with caution and context, considering the potential for fake reviews.\n- The full 'The Scoop' edition covers exclusive topics like the weight to assign to Glassdoor reviews, when Amazon will join the generative AI race, a 1.5 month-long code freeze at Stack Overflow, early warning of recent layoffs at AWS and NVIDIA's earnings revealing bigger-than-expected demand for hardware to run and train AI models.\n- 'The Scoop' provides inside information on Big Tech and high-growth startups, and is highly relevant for software engineers and managers in the tech industry.",
    "summary": "- Tech companies are asking staff to post positive reviews on Glassdoor to balance out negative ones, and they can also flag negative reviews for removal.\n- Glassdoor does not notify users when their reviews are removed or provide reasons why; a moderation log could make the process clearer.\n- Be cautious when viewing Glassdoor reviews, as fake 5-star reviews can be purchased for $10-25 each. Check for context and consider the potential for fake reviews.",
    "hn_title": "Layoffs push down scores on Glassdoor – how companies respond",
    "original_title": "Layoffs push down scores on Glassdoor – how companies respond",
    "score": 366,
    "hn_content": "Glassdoor reviews can have a significant impact on a company's reputation, but their value can be subjective. Negative reviews may not always accurately reflect the specific program or manager in question, so it's essential to look for trends and assess the broader policies. The interview process should be bidirectional, with candidates asking questions that help identify a company's culture and values. It's important not to take an overly negative attitude into an interview, but asking prepared questions shows initiative. Questions that can help identify a good team lead include what the organization thinks about psychological safety, how it holds employees accountable for its values, and what happens when employees challenge the status quo. Scripted interviews can provide a more consistent experience and be more inclusive, but they can be disadvantageous to neurodiverse people.A discussion on the trustworthiness of Glassdoor reviews and their vulnerability to manipulation by companies. Some claim that Glassdoor is influenced by money and that companies can use its \"premier program\" to remove negative reviews. Others suggest treating Glassdoor reviews like Amazon reviews, looking for patterns rather than just looking at the overall average. Some also propose creating a worker-owned Glassdoor competitor that allows users to own their own data, with the possibility of private sharing and monetization. Overall, the discussion highlights the challenges of trust and transparency in online review platforms.An iOS/macOS app for deployment site management is being developed, but concerns arise regarding customer-base expansion, and a potential web client may be implemented in the future. The business model of Glassdoor, which runs a job board, is questioned because of its prioritization toward its real customers, companies using it for hiring, rather than neutrality. There is discussion about whether Glassdoor could inform users of its removed reviews by using a simple placeholder text with a reason for removal. Despite the potential for fake or negative reviews, Glassdoor remains a useful resource for mining which LeetCode problems may be asked during an interview and indicative of company cultures and issues.Glassdoor reviews are being manipulated by managers and HR departments to make their companies look better. There are claims that fake, 5-star reviews have a going rate of up to $25 on marketplaces, with providers offering removal services for a price. Others complained the platform has become inundated with \"subjective phrases,\" rather than data, while sites like Yelp and Amazon are accused of engaging in similar fraudulent practices. Experts opine that the problem goes beyond trust and reputation, with potential legal repercussions if companies are seen to be structuring reviews. Proposed solutions include recency filters, review verification of an anonymous nature and a like-for-like ratings system that assigns quantitative data to reviews. \nA discussion on Hacker News explores the idea of a Glassdoor competitor, including how to verify reviews, prevent manipulation, handle legal challenges, and generate funding. Suggestions for identity verification methods include uploading recent pay slips or providing employer domain emails to receive verification codes, but some users express concerns about the sensitivity of this information and the potential for data breaches. Some users suggest a government body for identity verification, while others propose a donation or pay-for-access model. The feasibility and viability of such a competitor are debated, with some users expressing skepticism about the usefulness of review sites in general and the potential for manipulation and bias.The topic of conversation is predominantly centered around the usefulness/accuracy of employee reviews on websites like Glassdoor. Some commentators argue that it's difficult to distinguish \"real\" reviews from those that are intended to either boost or lower the ratings of a company. There's also discussion around whether or not people can trust certain sources for reviews, as there are concerns about vested interests at play. The potential for both companies and reporters to manipulate online reviews is also noted. Many agree that it's important to look beyond the simple ratings and try to find trends/themes across multiple reviews to form a more accurate picture of a company/position.- Glassdoor, a job and company review website, is losing trust due to allegations of companies manipulating reviews by flagging negative ones for removal and encouraging positive ones to increase their ratings. \n- Some commenters argue that review sites struggle to combat fake reviews and those that violate terms of service. \n- The author suggests that Glassdoor's business model allows employers to buy protection from bad reviews while potentially enticing employees to leave positive ones. \n- Some commenters question the validity and usefulness of Glassdoor reviews as a whole. \n- Anonymity on Glassdoor is also criticized, leading to a suggestion of a more transparent feedback system. \n- Overall, the post highlights growing concerns about the integrity of company review sites, particularly from the perspective of the employees reviewing them.",
    "hn_summary": "- Glassdoor reviews can be subjective and may not reflect specific programs or managers; it's important to look for trends and assess broader policies when evaluating a company's culture.\n- Discussion on the trustworthiness of Glassdoor reviews, with some claiming companies can manipulate reviews using money or its \"premier program,\" and suggestions for creating a worker-owned Glassdoor competitor.\n- Concerns over fake or manipulated reviews, with proposed solutions including review verification, like-for-like ratings systems, and recency filters."
  },
  {
    "id": 36079317,
    "timestamp": 1685070526,
    "title": "Tesla Model Y overtakes Corolla to be world's best-selling car in 2023",
    "url": "https://thedriven.io/2023/05/26/tesla-model-y-overtakes-corolla-to-be-worlds-best-selling-car-in-2023/",
    "hn_url": "http://news.ycombinator.com/item?id=36079317",
    "content": "19 COMMENTSTesla Model Y overtakes Corolla to be world’s best-selling car in 2023MAY 26, 202319 COMMENTS2 MINUTE READRIZ AKHTARTESLA IMPACT REPORTSHARETWEETThe Tesla Model Y electric crossover is now the best-selling car in the world, knocking the Toyota Corolla from the top of the podium. New data from JATO Dynamics has revealed that in the first quarter of 2023 the Tesla Model Y is the best-selling car in the world, selling 267,200 in the first three months of the year, eclipsing Toyota Corolla’s 256,400 sales.This was predicted a few years ago by Tesla boss Elon Musk before the car was even launched and now it’s happened.Here in Australia, Tesla Model Y has been a hugely popular model since its launch in June last year and is already the second best selling SUV of any type, just behind the Toyota RAV4.It has sold more than 14,000 of these electric SUVs in Australia. This year, over 5,000 have been sold with this quarter looking to be its best so far. The start of it saw April’s sales coming up to 2,095 according to data from FCAI vFacts.SOURCE: VFACTSThe sales continue to rise in Australia, despite the vehicle price not qualifying for many state and territory incentives due to its higher starting price when compared to the Tesla Model 3.When comparing it to ICE vehicles, the Tesla Model Y is the best-selling Medium SUV in the over $60,000, in the country by a wide margin. With 5,264 sales, it far outpaces the next best-selling Medium SUV which is the Audi !5 with 1,618 sales.Earlier this year, data compiled by Tesla and EV News enthusiast Sawyer Merritt on Twitter shows how Model Y has fared in total sales when compared to the world’s best-selling vehicles in 2022.This is a huge milestone for the EV transition. It shows legacy automakers that the time to produce and sell more compelling EVs is now if they are to survive the automotive valley of death.Riz AkhtarRiz is the founder of carloop based in Melbourne, specialising in Australian EV data, insight reports and trends. He is a mechanical engineer who spent the first 7 years of his career building transport infrastructure before starting carloop. He has a passion for cars, particularly EVs and wants to help reduce transport emissions in Australia. He currently drives a red Tesla Model 3.SHARETWEETRelated TopicsELECTRIC CAR SALESMODEL YTESLA",
    "summary": "- The Tesla Model Y electric crossover has become the best-selling car in the world, selling 267,200 units in the first quarter of 2023.\n- This milestone has been achieved ahead of Tesla boss Elon Musk's predictions before the car was even launched.\n- The Model Y has been hugely popular in Australia, selling over 14,000 units, and continuing to rise in sales despite higher starting prices than other EVs.",
    "hn_title": "Tesla Model Y overtakes Corolla to be world’s best-selling car in 2023",
    "original_title": "Tesla Model Y overtakes Corolla to be world’s best-selling car in 2023",
    "score": 359,
    "hn_content": "The Tesla Model Y became the world's best-selling car in 2023, overtaking the Corolla. The reduced footprint of EV drivetrains creates more interior space, which is a significant advantage. The breadth of EV offerings has pleasantly surprised buyers looking for a new car. Best-selling metrics are somewhat limited and easy to breach, and build quality is a hallmark of the Corolla, which is not necessarily a hallmark of Tesla. Integrated backup cameras provide better visibility than traditional rear windows, and car cameras can improve it further. Competitors designed EVs from the ground up, just like Tesla. Tesla's minimalist cabin design is more spacious and feels more spacious thanks to the glass roof. The Polestar 1 looks great on the outside, and the UX is something that Ford would have been proud of in 2009. The Polestar 2 is built off a Volvo/Geely ICE platform, but the Polestar 3 will be built off a dedicated EV platform.The comment thread discusses various aspects of electric vehicles (EVs) and their performance, reliability, innovation, and market competition. The conversation covers the difference between Tesla and Polestar 2 EV models in terms of their glass roof, range, efficiency, and power. It also compares EVs with traditional combustion engine cars, highlights the need for dedicated EV platforms, and mentions the importance of reliability, build quality, and dealer networks. Additionally, the thread includes insights into the technology and design of EVs from Toyota, Korean, and Chinese manufacturers, and their potential impact on the automotive industry. Some commenters share personal experiences and anecdotes about EV ownership, maintenance, and cost-effectiveness.Commenters on Hacker News discuss the obsession with top speed and power in cars, noting that it is largely a subjective evaluation rather than an objective one. Some also criticize the marketing tactics of traditional car manufacturers and note the superior technology and marketing of companies like Tesla. However, there are also criticisms of Tesla's build quality and service, and a discussion of the limitations of technology in the automobile industry.The article discusses a conversation on Hacker News about what qualifies as \"technology\". The conversation then transitions to a discussion about the state of electric vehicles. The main focus is on the lack of affordable options for a \"second car\" or \"economy car\". The article includes personal experiences with Tesla vehicles and mentions other affordable options available outside of the US. The conversation also touches on the limitations of current EV technology, such as range anxiety and charging availability, and the slow adoption of EVs by traditional car manufacturers. Minivans are suggested as an ideal form factor for EVs due to their room/capacity per footprint.Readers engage in a discussion regarding the practicality, reliability, and cost of EVs, specifically Tesla's Model 3 and Model Y. Many praised the efficiency of the Tesla charging network while a few users mentioned the difficulties in finding charging stations. The debate included comparisons to other automobile manufacturers such as VW and Volvo. One user highlighted how purchase price of EVs is still a barrier for some potential customers, as people tend to keep old cars much longer due to an evolving market. However, surveys on reliability are expected to expand and include new EV models, including the Volkswagen ID Buzz, with some focused on distinguishing build quality versus reliability.A Tesla Model S P85 has driven up to 1 million km with only a few motor replacements. The battery was replaced under warranty and installed a loaner battery, which was used for half a year or 150,000 km before installing a new, final battery. Apartments generally have a shortage of EV chargers, making it difficult for people living in apartments to own and operate their cars. EVs degrade more slowly if they use a lot of energy from the battery to power cooling systems. Maintenance costs of Tesla vehicles are expensive, with brake pads, shattered roofs, fogging taillights, broken control arms, drive units, worn-out seats, MCUs, and tail bumpers requiring repairs. However, maintenance savings add up significantly over its lifespan.Despite the myth that Tesla parts are more expensive than other vehicles of the same model year, most parts cost the same. Of the frequently replaced parts on traditional ICE vehicles, the Tesla typically doesn't have the same parts. EVs are more expensive than non-EVs, and their total cost of ownership might be lower in perfect, ideal scenarios. Tesla's lowering of car prices appears to be a strategy to gain market share and take advantage of other manufacturers raising prices and lengthening lead times. Ford and other manufacturers are potentially selling their EVs at a loss. Investing in EVs may be a risky move for some manufacturers, as they will have to anticipate lower sales numbers. EVs offer lower maintenance costs, but battery replacement may be costly. Despite this, Tesla batteries can last up to 300,000 miles, and LFP batteries have an estimated 750,000-mile life.• Electric vehicle (EV) batteries lose efficiency over time\n• Battery replacement cost is still high, but expected to decrease in the future\n• EVs may last longer than traditional cars since they require less preventative maintenance on belts and transmissions\n• Some people may use lower range EVs as second vehicles for around-town driving\n• There are differing opinions on the cost and ease of maintenance for car parts such as belts and transmissions",
    "hn_summary": "- Tesla Model Y surpassed Corolla to become the best-selling car worldwide in 2023\n- Hacker News commenters discuss various aspects of EVs, including range, efficiency, build quality, and competition\n- Maintenance costs for Tesla vehicles are high, but the total cost of ownership may be lower due to lower maintenance needs and savings over its lifespan. EVs offer lower maintenance costs but may require costly battery replacements."
  },
  {
    "id": 36088783,
    "timestamp": 1685130797,
    "title": "Times New Bastard",
    "url": "https://github.com/weiweihuanghuang/Times-New-Bastard",
    "hn_url": "http://news.ycombinator.com/item?id=36088783",
    "content": "Download Times New BastardIt's Times New Roman but every seventh letter is jarringly sans serif. Original idea by ommanyte on Tumblr:Times New Bastard is a modified version of Nimbus Roman No. 9 L and Nimbus Sans, original source here.Using it on the WebTurn on ligatures and optimiseLegibility:font-feature-settings: \"kern\" on, \"liga\" on;text-rendering: optimizeLegibility;Using it in Microsoft OfficeTurn on Ligatures.LicenseThe font and related files in this directory are distributed under the GNU AFFERO GENERAL PUBLIC LICENSE Version 3 (see the file COPYING), with the following exemption:As a special exception, permission is granted to include these font programs in a Postscript or PDF file that consists of a document that contains text to be displayed or printed using this font, regardless of the conditions or license applying to the document itself.",
    "summary": "- Times New Bastard is a modified version of Times New Roman where every seventh letter is sans serif.\n- It is based on Nimbus Roman No. 9 L and Nimbus Sans fonts and is available for download.\n- It can be used on the web with ligatures and optimizing legibility or in Microsoft Office by turning on ligatures.",
    "hn_title": "Times New Bastard",
    "original_title": "Times New Bastard",
    "score": 333,
    "hn_content": "The Times New Bastard font, resembling Times New Roman with varying serif sizes and letter spacing, is causing mixed reactions among people on Hacker News. Some people find it fascinating for its tastefully jarring and awful look, while others find it overdone and unnecessary. The discussion also touches upon the use of Comic Sans and other handwritten fonts, the x-height of font families, and variation in letterforms. Additionally, users share links to related projects and tools such as Hellvetica and scripts for using different fonts for each letter.",
    "hn_summary": "- A font called Times New Bastard is causing mixed reactions among Hacker News readers\n- Some find it fascinating for its unique look, while others find it overdone and unnecessary\n- Discussion also touches upon the use of Comic Sans, x-height of font families, and related projects like Hellvetica"
  },
  {
    "id": 36085642,
    "timestamp": 1685115824,
    "title": "Mozilla stops Firefox fullscreen VPN ads after user outrage",
    "url": "https://www.bleepingcomputer.com/news/security/mozilla-stops-firefox-fullscreen-vpn-ads-after-user-outrage/",
    "hn_url": "http://news.ycombinator.com/item?id=36085642",
    "content": "Mozilla stops Firefox fullscreen VPN ads after user outrageBy Bill ToulasMay 26, 2023 10:52 AM 7Firefox users have been complaining about very intrusive full-screen advertisements promoting Mozilla VPN displayed in the web browser when navigating an unrelated page.The ads popping in Firefox disable the web browser's functionality, denying users access to the interface and graying out everything in the background until they close them.Some users reported on Reddit that the annoying full-screen ads even cause Firefox to become unresponsive for up to 30 seconds, forcing them to terminate the browser's process.Top StoriesREAD MOREThe Week in Ransomware - May 26th 2023 -Cities Under AttackBesides the disruptive nature of the advertisement, Firefox users showed their irritation at the aggressive promoting method from a company that theoretically has great respect for user choice and claims to value a people-first experience.The advertisement boosts Mozilla VPN, a paid open-source VPN service that constitutes a crucial revenue source for the not-for-profit company.Advert randomly served to Firefox users (Bugzilla)Mozilla VPN is not available worldwide, only in the United States, Austria, Belgium, Canada, Finland, France, Germany, Ireland, Italy, Malaysia, the Netherlands, New Zealand, Singapore, Spain, Sweden, Switzerland, and the UK; so it is safe to assume that only users from these regions saw the overlay ads in Firefox.Mozilla switches off the adsThe Firefox user community immediately expressed indignation towards Mozilla’s blatant product promotional practice by filing multiple reports on Bugzilla.The most recent relevant report on Mozilla’s bug tracking platform received the \"RESOLVED WORKSFORME\" tag, which means that ads work as intended and there is nothing to fix.BleepingComputer has contacted Mozilla about the matter and received the following statement following the barrage of complaints from Firefox users:\"We’re continuously working to understand the best ways to communicate with people who use Firefox. Ultimately, we accomplished the exact opposite of what we intended in this experiment and quickly rolled the experience back. We apologize for any confusion or concern\" - MozillaA quick solution for people who find Mozilla VPN ads unacceptable is to open Firefox, enter “about:config” in the URL bar, and then set browser.vpn_promo.enabled to false by clicking to toggle button on the right.Disabling the VPN ad from Firefox advanced settings (BleepingComputer)Alternatively, users may install an ad blocker like AdGuard, which some people reported that it was effective in blocking the pop-up.Related Articles:Firefox now blocks cross-site tracking by default for all usersZyxel warns of critical vulnerabilities in firewall and VPN devicesGet multi-layer protection with this $199.99 DPN hardware dealMicrosoft investigates slow Windows VPN speeds after May updatesBrave unveils new \"Forgetful Browsing\" anti-tracking feature",
    "summary": "- Firefox users have been complaining about intrusive full-screen ads promoting Mozilla VPN that disable web browser functionality and cause unresponsiveness.\n- Mozilla faced criticism for the aggressive advertising method that contradicted their respect for user choice and people-first experience values.\n- After the user outrage, Mozilla issued an apology and turned off the fullscreen VPN ads, and users can also disable the VPN ad by following a quick solution or using ad blockers like AdGuard.",
    "hn_title": "Mozilla stops Firefox fullscreen VPN ads after user outrage",
    "original_title": "Mozilla stops Firefox fullscreen VPN ads after user outrage",
    "score": 304,
    "hn_content": "Mozilla has stopped displaying full-screen VPN ads on Firefox after users expressed outrage. A recent ad-caused popping up on an unrelated web page and considered being detrimental to the experience. A notable long-time Firefox user reported changing sentiments the first time in over 20 years using the browser. The article mentions previous similar controversial moves by Mozilla in 2017 and claims the current display shows an arrogance not typical of a browser provider supposedly focusing on user privacy. Some reports claim that Mozilla may find these non-traditional ways of promoting its VPN service detrimental to its reputation. Discussions on the use of conspiracy theories, future Firefox updates, Brave browser as well as Firefox's competitors Safari and Edge are also mentioned.Firefox users express frustration with the browser in a discussion on Hacker News. Users comment on their dislike for Firefox and their experiences switching to alternative browsers such as Brave, Duck, and Vivaldi. Some also criticize Firefox's recent experiment with an ad overlay, which they perceive as a fundamental misunderstanding of what Firefox was built on. Many users are disappointed with Mozilla's recent direction and management, leading to commentary on the decline of Firefox. Despite these issues, some users still prefer Firefox to its competitors due to its extensibility and customization options.Mozilla's recent experiment of promoting its paid VPN service through a user-hostile advertisement has caused backlash, with users criticizing the design and questioning whether Mozilla can still be considered a non-profit. The advertisement was part of Firefox's interface, and some users reported difficulty closing it. The incident has led to concerns about accountability and decision-making at Mozilla. Some users have started looking for alternative browsers, with suggestions ranging from Safari to Falkon to ungoogled-chromium. Some advocate for Firefox to adopt a freemium model, while others argue for a decentralization of open-source browser development. There are also questions raised about the accuracy of labeling Mozilla as non-profit. The incident emphasizes the importance of considering user experience and incentives in tech business models.Firefox faced criticism for displaying an unskippable promotional message for Mozilla's VPN service. Although Firefox claimed it was an accidental experiment, users expressed their disapproval, and Mozilla reverted the feature. The incident raises questions about user privacy and the use of obtrusive advertisements by browser developers. Some users considered switching to alternative browsers such as Vivaldi or Brave, which were seen as better alternatives to Firefox and Chrome. Others suggested creating new browsers or forking the Firefox project to return to a mostly volunteer model focused on the browser. Some people preferred the Mullvad VPN service, which powered Mozilla's VPN and did not pay for commission or special sale prices, avoiding conflicts of interest.Mozilla, the developers of the Firefox browser, faced criticism from users after injecting a sponsored ad campaign into the browser chrome, causing a pop-up ad to appear. This is not the first time Mozilla has injected ads into the browser chrome, previously doing so in 2018 with a plugin that was force-installed on users. The move has sparked concerns about user privacy and potential distrust towards Mozilla. The post also includes a sarcastic comment about the situation. No new or exciting developments or releases are mentioned in the post.",
    "hn_summary": "- Mozilla has stopped displaying full-screen VPN ads on Firefox due to user outrage and negative impact on user experience.\n- Users criticize Mozilla for recent experimental promotions of its VPN service and question its non-profit status.\n- Some users switch to alternative browsers such as Brave or Vivaldi due to disappointment with Mozilla's recent direction and management."
  },
  {
    "id": 36087252,
    "timestamp": 1685122400,
    "title": "There oughta be a bullet time video booth",
    "url": "https://there.oughta.be/a/bullet-time-video-booth",
    "hn_url": "http://news.ycombinator.com/item?id=36087252",
    "content": "An expert journalist recounts his experience creating a video booth with a bullet time effect for his cousin's wedding. He used an array of twelve old DSLRs arranged in an arch, triggering them simultaneously to create the effect. He combined sequences from multiple guests to create longer bullet time footage and used DaVinci Resolve to smoothly slow down the effect. He also included a main 1080p camera and mounted everything on a quarter circle stand made from a B-stock e-drum rack. The biggest challenge was powering the cameras, and the author had to experiment with multiple USB chargers before finding a reliable solution. Despite the setbacks, the resulting video was a unique and memorable way to capture memories at the wedding.A DIY bullet time video booth was created using multiple cameras, a Raspberry Pi Pico, Bluetooth push buttons, and video lights. Cameras were controlled via USB and triggered using a simple circuit with the Canon trigger input. Push buttons were made wireless using a Bluetooth module on the Pi Pico and powered by AA batteries. Video lights were brought to ensure consistency in exposure throughout the day. The preview and idle loop were displayed on an old Dell XPS 12, while the post-processing was done manually in DaVinci Resolve. The project was implemented using Python code and gphoto2, while the interface was built using Flask and shown in Chromium.A tech-savvy individual created a DIY photo booth with a bullet time effect using 13 cameras that recorded stabilized versions of all recordings with different amounts of artificial frames and generated transitions with airborne kids, flowing hair, and flying items with DaVinci Resolve through Python automation. The project required an appropriate understanding of technology and spare time and was not suitable for a bride or groom to set up on their wedding day, given the potential technical difficulties. The bullet time effect was a fantastic alternative to the traditional photo booth, and guests enjoyed posing in front of the camera array and playing with the effect, particularly later in the evening. The video booth relies on DIY infrared remote and wifi SD card interfaces to start recording and retrieving the results.",
    "summary": "- An expert journalist created a memorable DIY video booth with a bullet time effect using an array of cameras for a wedding.\n- A newer version of the DIY video booth used a Raspberry Pi Pico, wireless Bluetooth push buttons, and video lights, controlled using Python code and gphoto2.\n- The bullet time effect created fantastic footage but can be technically challenging and not suitable for a wedding event without proper preparation.",
    "hn_title": "There oughta be a bullet time video booth",
    "original_title": "There oughta be a bullet time video booth",
    "score": 289,
    "hn_content": "A thread on Hacker News discusses the affordability and quality of DSLR cameras for photography enthusiasts, as well as the growing popularity of mirrorless cameras. The thread also includes tips for using older cameras as webcams and for creating \"bullet time\" effects with rotating platforms or camera arrays. While some express interest in the technique, others voice concerns about the need for choreography and proper timing to create effective sequences. Additionally, readers speculate about potential applications for such equipment.A Reddit post shares an innovative idea for a DIY bullet-time photo booth, using DSLR cameras, a rig made of PVC pipes, and custom-written code to synchronize the cameras. The resulting footage is a choppy but novel 2-second, 60-frame scene of a pitch being thrown, a technique first popularized in the 1999 movie \"The Matrix\". The post also includes discussions on the technical challenges of using synchronized camera arrays for bullet-time effects, alternative methods such as AI in-betweening and Neural Radiance Fields, and existing commercial offerings for bullet-time booths. Despite some limitations and complexities, the DIY solution offers a fun and unique experience that could be adapted to different events and settings.",
    "hn_summary": "- Hacker News discusses quality and affordability of DSLR and growing popularity of mirrorless cameras\n- Tips for using old cameras as webcams and for creating bullet time effects with rotating platforms or camera arrays\n- Reddit post shares innovative DIY bullet-time photo booth using DSLR cameras, PVC pipes, and custom-written code"
  }
]
