[
  {
    "id": 41223774,
    "title": "ABD Hükümeti, 'abonelikten çık' düğmesine tıklamayı sizin için daha kolay hale getirmek istiyor",
    "originLink": "https://apnews.com/article/consumer-protection-ftc-fcc-biden-250f6eece6e2665535019128e8fa38da",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41223774",
    "commentBody": "",
    "originSummary": [
      "ABD hükümeti, istenmeyen üyeliklerden ve yinelenen ödeme hizmetlerinden çıkmayı kolaylaştırmak için \"Zaman Para\" girişimini başlattı.",
      "Bu girişim, tüketicilerin mali kayıplarını önlemek için sağlık hizmetleri, fitness ve medya abonelikleri gibi sektörleri hedef alarak birden fazla federal ajansı içeriyor.",
      "Temel eylemler arasında Federal Ticaret Komisyonu'nun \"tıklayarak iptal et\" kural koyma süreci, Federal İletişim Komisyonu'nun yeni gereksinimleri ve Çalışma ve Sağlık ve İnsan Hizmetleri departmanlarının sağlık sigortası şirketleriyle müşteri etkileşimlerinde yaptığı iyileştirmeler yer almaktadır."
    ],
    "commentSummary": [
      "ABD Hükümeti, hizmetlerden abonelikten çıkma sürecini, kaydolmak kadar kolay hale getirecek yeni bir girişim önermektedir.",
      "Teklif, tüketicilerin abone oldukları yöntemi kullanarak abonelikten çıkabilmelerini zorunlu kılmakta ve bu sürecin basit ve hızlı olmasını sağlamaktadır.",
      "Bunun girişimi, tüketicileri aldatıcı uygulamalardan korumak ve genel kullanıcı deneyimini geliştirmek için daha geniş çabaların bir parçasıdır."
    ],
    "points": 390,
    "commentCount": 187,
    "retryCount": 0,
    "time": 1723466769
  },
  {
    "id": 41221252,
    "title": "Blitz: Hafif, modüler, genişletilebilir bir web renderleyici",
    "originLink": "https://github.com/DioxusLabs/blitz",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41221252",
    "commentBody": "",
    "originSummary": [
      "Blitz, JavaScript motorunu Rust kütüphaneleriyle doğrudan arayüz oluşturmak için yerel bir Rust API ile değiştiren \"Dioxus Native\" projesi için yeni bir web renderleyicisidir.",
      "İki ön yüzü vardır: biri HTML/markdown'u render etmek için, diğeri ise Stylo, Vello, WGPU, Taffy, Parley, AccessKit ve Winit gibi teknolojilerden yararlanarak tam etkileşimli bir Dioxus VirtualDom'u render etmek için.",
      "Blitz deneysel bir projedir, üretim için önerilmez ve Apache 2.0 ile MIT lisansları altında çift lisanslıdır, katkılar MIT lisansı altında memnuniyetle kabul edilir."
    ],
    "commentSummary": [
      "Blitz, Dioxus Labs tarafından geliştirilen, hafif, modüler ve genişletilebilir bir web renderleyicisidir. Şu anda erken aşamada olup, birkaç eksik özellik ve performans sorunları bulunmaktadır.",
      "Proje, Webkit ve Servo gibi ağır tarayıcı motorlarına daha basit bir alternatif sunmayı amaçlıyor, özelleştirme ve daha küçük boyuta (optimizasyonlarla potansiyel olarak 3.5MB) odaklanıyor.",
      "Blitz, HTML/CSS kullanarak yerleşim düzeni oluşturan yerel uygulamalar gibi tam bir tarayıcı motoru gerektirmeyen kullanım durumları için tasarlanmıştır ve PDF oluşturma ve daha iyi CSS desteği gibi gelecekteki özellikler için potansiyele sahiptir."
    ],
    "points": 372,
    "commentCount": 98,
    "retryCount": 0,
    "time": 1723438341
  },
  {
    "id": 41224853,
    "title": "Apple'ın gereksinimleri, Patreon'daki yaratıcıları ve hayranları etkilemek üzere",
    "originLink": "https://news.patreon.com/articles/understanding-apple-requirements-for-patreon",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41224853",
    "commentBody": "",
    "originSummary": [
      "Apple, Patreon'a 2024 Kasım ayına kadar iOS uygulama içi satın alma sistemini benimsemesini zorunlu kılıyor ve iOS uygulaması üzerinden satın alınan yeni üyelikler için %30 ücret uyguluyor.",
      "Mevcut üyeler etkilenmeyecek, ancak tüm içerik oluşturucuların Kasım 2025'e kadar abonelik faturalandırmasına geçmesi gerekecek.",
      "Patreon, iOS uygulamasında fiyatları artırarak Apple'ın ücretini dengelemek için araçlar sunar ve geçiş sürecinde içerik üreticilerine yardımcı olacak kaynaklar sağlar."
    ],
    "commentSummary": [
      "Apple'ın yeni gereksinimleri, Patreon içerik oluşturucularının eser başına ödeme modelinden aylık abonelik modeline geçmelerini zorunlu kılıyor, bu da birçok içerik oluşturucunun memnuniyetsizliğine neden oluyor.",
      "Bu değişiklik, Apple'ın App Store'da abonelik tabanlı modellere yönelik daha geniş çaplı hamlesinin bir parçası olup, içerik oluşturucuların içeriklerini ve finansmanlarını nasıl yönettiklerini etkiliyor.",
      "Bazı içerik üreticileri alternatif platformları araştırıyor ve bu durum, Apple'ın uygulama tabanlı işlemler üzerindeki önemli etkisini ve içerik üreticileri için yarattığı zorlukları vurguluyor."
    ],
    "points": 342,
    "commentCount": 322,
    "retryCount": 0,
    "time": 1723473286
  },
  {
    "id": 41224225,
    "title": "Antimemetikler Bölümü Yoktur (2018)",
    "originLink": "https://qntm.org/scp",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41224225",
    "commentBody": "",
    "originSummary": [
      "qntm tarafından yazılan 'Antimemetics Bölümü Yok' antimemlerin, yani paylaşılmaya veya hatırlanmaya direnen fikirlerin kavramını araştırıyor ve bu durumun içerdiği benzersiz zorlukları ele alıyor.",
      "Birden fazla formatta mevcut olan bu seri, SCP Foundation wiki sitesinde ücretsiz çevrimiçi okuma imkanı da dahil olmak üzere, silinmiş sahneler ve crossover hayran kurgusu gibi ekstralar içerir.",
      "Yazar, bazı olay örgüsü noktalarının karakterlerin deneyimlerini yansıtmak amacıyla kasıtlı olarak çözülmeden bırakıldığını ve tetikleyici uyarılar ve karakter gelişimi hakkındaki geri bildirimlerin memnuniyetle karşılandığını belirtiyor."
    ],
    "commentSummary": [
      "Qntm tarafından yazılan 'There Is No Antimemetics Division', derin metaforları ve insan iletişimi ile hafızasını benzersiz bir şekilde keşfetmesiyle övgü alıyor ve 'Godel, Escher, Bach' ile Lewis Carroll'un eserleriyle karşılaştırılıyor.",
      "Kitabın antimemler kavramı, okuyucuları büyülemiş, bunun sonuçları ve gerçek hayattaki fenomenlerle karşılaştırmaları hakkında tartışmalar başlatmıştır.",
      "Qntm'nin diğer eserleri, \"Hatetris,\" \"Absurdle,\" \"Ra,\" ve \"Fine Structure\" da şiddetle tavsiye edilir, ancak bunların karmaşıklığı ve erişilebilirliği hakkındaki görüşler değişiklik gösterir."
    ],
    "points": 342,
    "commentCount": 106,
    "retryCount": 0,
    "time": 1723469862
  },
  {
    "id": 41220059,
    "title": "Nasıl eşyalarınızı kaybetmekten kaçınırsınız? Kalemleri tutmak",
    "originLink": "https://blog.alexwendland.com/2024-07-07-holding-pens/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41220059",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [],
    "points": 339,
    "commentCount": 218,
    "retryCount": 0,
    "time": 1723420055
  },
  {
    "id": 41223934,
    "title": "Tamam, WezTerm'i beğendim",
    "originLink": "https://alexplescan.com/posts/2024/08/10/wezterm/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41223934",
    "commentBody": "",
    "originSummary": [
      "WezTerm, yapılandırma için Lua kullanan bir terminal emülatörüdür ve bu sayede son derece özelleştirilebilir ve farklı makineler arasında taşınabilir.",
      "Bu gönderi, görünüm, tuş atamaları, çoklama, çalışma alanı gezintisi, durum çubuğu ayarları ve dinamik temalandırma gibi konuları kapsayan WezTerm yapılandırması için başlangıç seviyesinde bir rehber sunmaktadır.",
      "Rehber, Lua'nın YAML veya TOML gibi diğer yapılandırma formatlarına göre avantajlarını vurguluyor ve karmaşık ve dinamik betik yazma yeteneğini öne çıkarıyor."
    ],
    "commentSummary": [
      "WezTerm, üstün kutudan çıktığı gibi özellikleri ve Kitty'ye kıyasla daha basit yapılandırması ile popülerlik kazanıyor.",
      "Lua tabanlı yapılandırma, WezTerm'de özelleştirmenin kolaylığı ve çoklu platform desteği ile öne çıkıyor, bu da birden fazla işletim sistemi üzerinde çalışan kullanıcılar için faydalıdır.",
      "Yazı tipi işleme ve performansla ilgili bazı bildirilen sorunlara rağmen, WezTerm hızı, yapılandırılabilirliği ve duyarlı geliştirmesi ile övülmektedir."
    ],
    "points": 295,
    "commentCount": 175,
    "retryCount": 0,
    "time": 1723467751
  },
  {
    "id": 41224689,
    "title": "PGlite – tarayıcı içi WASM Postgres, pgvector ve canlı senkronizasyon ile",
    "originLink": "https://pglite.dev/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41224689",
    "commentBody": "",
    "originSummary": [
      "PGlite, ek bağımlılıklar olmadan tarayıcıda, Node.js'de ve Bun'da çalışabilen bir Postgres'i etkinleştiren TypeScript/JavaScript istemci kütüphanesine paketlenmiş bir WASM (WebAssembly) Postgres yapısıdır.",
      "PGlite v0.2 sürümünün piyasaya sürülmesi büyük ilgi topladı ve Supabase ekibi, bunun üzerine inşa edilen http://postgres.new sitesini başlattı.",
      "PGlite, küçük boyutu (3MB Gzipped), birçok Postgres uzantısını desteklemesi ve reaktif 'canlı sorgu' API'si ile dikkat çekiyor, bu da onu geliştiriciler için hızlı ve verimli bir çözüm haline getiriyor."
    ],
    "commentSummary": [
      "PGlite, ek bağımlılıklar olmadan tarayıcıda, Node.js'de ve Bun'da Postgres'in çalışmasına olanak tanıyan bir TypeScript/JavaScript istemci kütüphanesine paketlenmiş bir WASM (WebAssembly) Postgres yapısıdır.",
      "3MB Gzipped boyutundadır, pgvector dahil olmak üzere çeşitli Postgres uzantılarını destekler ve son derece hızlı sorgu yürütme sürelerine sahip reaktif bir \"canlı sorgu\" API'si sunar.",
      "PGlite sürüm 0.2'ye ulaştı, Supabase ekibi tarafından kullanılıyor, tarayıcı tarafı kalıcılık için IndexedDB ve OPFS'yi destekliyor ve gelecekte diğer dilleri ve yerel bir C kütüphanesini desteklemeyi planlıyor."
    ],
    "points": 291,
    "commentCount": 81,
    "retryCount": 0,
    "time": 1723472403
  },
  {
    "id": 41219080,
    "title": "Adbfs-rootless – Android telefonları Linux'ta adb ile bağlayın. Root gerektirmez",
    "originLink": "https://github.com/spion/adbfs-rootless",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41219080",
    "commentBody": "",
    "originSummary": [
      "Adbfs'in yeni bir varyantı, kullanıcılar için daha erişilebilir hale getirerek Android cihazlarını root erişimi gerektirmeden bağlamaya olanak tanır.",
      "Kurulum, bağımlılıkların yüklenmesini, depoyu klonlamayı, projeyi derlemeyi ve isteğe bağlı olarak Android SDK ile entegrasyonu içerir.",
      "Temel sorun giderme ipuçları arasında USB Hata Ayıklama'nın etkin olduğundan emin olmak ve \"cihaz bulunamadı\" veya \"cihaz çevrimdışı\" gibi yaygın hataları çözmek için android-sdk-tools'u güncellemek yer alır."
    ],
    "commentSummary": [
      "Adbfs-rootless, kullanıcılar için süreci basitleştirerek, root erişimi gerektirmeden adb kullanarak Android telefonları Linux'a bağlamayı mümkün kılar.",
      "Bakımcı spion, GitHub eylem çalıştırıcılarındaki test sorunlarını vurguladı ancak GitHub Actions sanallaştırmasındaki son iyileştirmelere dikkat çekti.",
      "Kullanıcılar, yedeklemeler ve dosya transferleri için güvenilirlik ve kullanım durumlarını tartışarak adbfs'yi KDE Connect, Termux, rsync, mtpfs ve Primitive FTPD gibi diğer araçlarla karşılaştırdı."
    ],
    "points": 223,
    "commentCount": 23,
    "retryCount": 0,
    "time": 1723407731
  },
  {
    "id": 41226039,
    "title": "Onar ve Kal: Yerinde Kalmanın Yavaş, Zor ve İyi İşini Nasıl Yapmalı",
    "originLink": "https://comment.org/repair-and-remain/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41226039",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Bu tartışma, evde kendin yap (DIY) onarımları ile profesyonel yardım almanın dengesi üzerinde durarak, bunun zihinsel sağlık ve zaman yönetimi üzerindeki etkisini vurgulamaktadır.",
      "Yorumlar çeşitli bakış açılarını yansıtıyor: bazıları DIY'yi ödüllendirici ve eğitici bulurken, diğerleri stresi azaltmak ve aile ve kişisel aktiviteler için zaman kazanmak amacıyla yardım almayı tercih ediyor.",
      "Konuşma ayrıca, hem evlerde hem de ilişkilerde uzun vadeli bakımın daha geniş temalarına değinerek, onarımlara yaklaşımın yaşam seçimlerini ve önceliklerini yansıtabileceğini öne sürüyor."
    ],
    "points": 214,
    "commentCount": 64,
    "retryCount": 0,
    "time": 1723478802
  },
  {
    "id": 41220098,
    "title": "Çin'in toplam rüzgar ve güneş enerjisi kapasitesi kömürü geride bıraktı",
    "originLink": "https://renewablesnow.com/news/chinas-total-wind-and-solar-capacity-outstrips-coal-rystad-says-865106/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41220098",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Çin'in rüzgar ve güneş enerjisi kapasitesi artık kömür kapasitesini geçti ve güneş enerjisinin 2026 yılına kadar 1,38 teravat (TW) seviyesine ulaşması bekleniyor.",
      "2023 yılında, Çin 293 gigavat (GW) rüzgar ve güneş enerjisi ekledi, buna karşılık sadece 40 GW kömür ekleyerek yenilenebilir enerjiye doğru önemli bir kayma olduğunu gösterdi.",
      "Çin, en büyük kömür tüketicisi olmasına rağmen, yenilenebilir enerji altyapısını hızla genişletiyor ve 2024 yılında 230 GW yeni güneş enerjisi kurulumları ve 75 GW rüzgar kapasitesi projeksiyonları bulunuyor."
    ],
    "points": 166,
    "commentCount": 156,
    "retryCount": 0,
    "time": 1723420458
  },
  {
    "id": 41219562,
    "title": "Z3 ile Simpson Paradoksu Oluşturma",
    "originLink": "https://kevinlynagh.com/z3-simpsons-paradox/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41219562",
    "commentBody": "",
    "originSummary": [
      "Bu gönderi, mantıksal formülleri çözmek için bir araç olan Z3 Teorem İspatlayıcısı kullanarak Simpson Paradoksu'nun bir örneğinin nasıl oluşturulacağını göstermektedir.",
      "Simpson Paradoksu, bir beyzbol senaryosuyla açıklanır; burada bir oyuncunun genel vuruş ortalaması daha iyidir, ancak diğer oyuncu hem solak hem de sağ elini kullanan atıcılara karşı daha iyi ortalamalara sahiptir.",
      "Tüm oyuncuların farklı atıcılarla karşılaşmış olması, paradoksal sonuçları açıklayan temel içgörüdür."
    ],
    "commentSummary": [
      "Simpson Paradoksu, istatistiksel sonuçların veri ayrıntı düzeylerine göre nasıl değişebileceğini ve bu durumun görünüşte çelişkili sonuçlara yol açabileceğini gösterir.",
      "Z3, kısıtlamalara dayalı akıl yürütme ve optimizasyon için bir araç olarak, finansal piyasalar ve araştırma dahil olmak üzere çeşitli alanlarda veri analizi için kullanışlılığı ile öne çıkmaktadır.",
      "Anscombe'nin Dörtlüsü ve Datasaurus Dozen gibi araçlar aracılığıyla görselleştirildiği üzere, korelasyon ve nedensellik arasındaki ayrımı anlamak, doğru veri analizi için çok önemlidir."
    ],
    "points": 165,
    "commentCount": 46,
    "retryCount": 0,
    "time": 1723413194
  },
  {
    "id": 41224749,
    "title": "Postgres.yeni",
    "originLink": "https://postgres.new/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41224749",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Supabase, Postgres.new'u piyasaya sürdü; bu, PGLite'ı, yani Postgres'in WebAssembly (WASM) yapısını kullanan, tarayıcı içinde çalışan bir Postgres sanal alanıdır ve yapay zeka desteği sunar.",
      "Hizmet, GPT-4'ü AI destekli veritabanı yönetimi için entegre eder ve şema oluşturma, veri sorguları, CSV yüklemeleri, grafik oluşturma ve Retrieval-Augmented Generation (RAG) için gömüler oluşturma gibi görevleri mümkün kılar.",
      "Şu anda, hizmet yalnızca masaüstü için mevcuttur ve tam işlevsellik için bir GitHub girişi gerektirir. Daha fazla ayrıntı ve bir demo videosu GitHub ve YouTube'da mevcuttur."
    ],
    "points": 162,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1723472710
  },
  {
    "id": 41224253,
    "title": "AMD, onlarca yılın en yüksek sunucu pazar payını kaydetti",
    "originLink": "https://www.tomshardware.com/pc-components/cpus/amd-records-its-highest-server-market-share-in-decades-but-intel-fights-back-in-client-pcs",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41224253",
    "commentBody": "",
    "originSummary": [
      "Mercury Research'e göre, AMD, 2024'ün ikinci çeyreğinde %24,1'lik payla on yıllardır en yüksek sunucu pazar payına ulaştı ve bu, sırasıyla %0,5'lik bir ardışık ve %5,6'lık bir yıllık artışı işaret ediyor.",
      "AMD'nin kazançlarına rağmen, Intel, %78,9'luk pay ile müşteri PC pazarında hakimiyetini sürdürdü.",
      "AMD'nin mobil CPU payı, %1'lik bir artışla %20,3'e yükselerek yıllık bazda %3,8'lik bir artış gösterdi. Buna karşılık, masaüstü CPU payı %1 düşerek %23'e geriledi, ancak yıllık bazda %3,6'lık bir artış kaydetti."
    ],
    "commentSummary": [
      "AMD, on yıllardır en yüksek sunucu pazar payına ulaşarak veri merkezi CPU sevkiyatlarının %24,1'ini ele geçirdi, Intel ise %75,9'luk paya sahip.",
      "AMD'nin masaüstü pazar payı yaklaşık %25 civarında kalıyor, bu durum muhtemelen sınırlı hazır sistem seçenekleri ve Intel'e olan güçlü müşteri sadakatinden kaynaklanıyor.",
      "Intel'in tarihsel üstünlüğü, pazarlama stratejileri ve belirli iş yükü avantajları, pazar dinamiklerini etkilerken, AMD ve Intel arasındaki gelecekteki rekabet belirsizliğini koruyor."
    ],
    "points": 152,
    "commentCount": 83,
    "retryCount": 0,
    "time": 1723470021
  },
  {
    "id": 41218737,
    "title": "Hetzner fiziksel makinesinde (fiziksel erişim / KVM konsolu yok) QEMU aracılığıyla OpenBSD 7.5",
    "originLink": "https://hackmd.gfuzz.de/s/Qsk14kc3i",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41218737",
    "commentBody": "",
    "originSummary": [
      "OpenBSD 7.5, iki SSD üzerinde RAID1 ve şifreli bir bölüm kullanarak QEMU ile bir Hetzner fiziksel makinesine kurulabilir.",
      "Bu süreç, Hetzner'in Linux kurtarma sistemini etkinleştirmeyi, diskleri hazırlamayı ve OpenBSD kurulum ISO'sundan önyükleme yapmak için QEMU'yu kullanmayı içerir.",
      "Kurulum sonrası adımlar, şifrelenmiş bir bölüm oluşturmayı, işletim sistemini güncellemeyi ve sistemi güvenli ve verimli bir şekilde çalışacak şekilde yapılandırmayı içerir."
    ],
    "commentSummary": [
      "OpenBSD 7.5, fiziksel erişim veya bir KVM (Klavye, Video, Fare) konsolu olmadan bile Hetzner fiziksel makinelerinde QEMU aracılığıyla çalıştırılabilir.",
      "Hetzner, FreeBSD kurtarma sistemini sonlandırdı ve kullanıcıları BSD sistemlerini kurmak ve yönetmek için alternatif yöntemler bulmaya yönlendirdi.",
      "Kullanıcılar, Hetzner'in kurtarma sistemine önyükleme yapma, Linux'tan FreeBSD'yi başlatmak için betikler kullanma ve kurtarma ve kurulum süreçlerini otomatikleştirmek için araçlar kullanma gibi çeşitli geçici çözümler paylaştılar."
    ],
    "points": 145,
    "commentCount": 42,
    "retryCount": 0,
    "time": 1723404781
  },
  {
    "id": 41224173,
    "title": "Astroloji işe yarıyor mu? 152 astrologun yeteneğini test ettik",
    "originLink": "https://threadreaderapp.com/thread/1822663687145972105.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41224173",
    "commentBody": "",
    "originSummary": [
      "Tespit edilen bir çalışmada, 152 astrologun insanları astrolojik haritalarına göre eşleştirip eşleştiremeyecekleri test edildi ve %21'den daha az doğrulukla rastgele tahmin yapmaktan daha iyi performans göstermedikleri bulundu.",
      "Deneyimli astrologlar, daha az deneyimli olanlardan daha iyi performans göstermedi ve astrologlar arasında yalnızca %28'lik bir fikir birliği ile düşük bir anlaşma vardı.",
      "Çalışma, astrologların insanları doğru bir şekilde haritalarına eşleştirme yeteneğinden yoksun olduğunu sonucuna vardı."
    ],
    "commentSummary": [
      "152 astrologerin katıldığı bir çalışma, aralarındaki anlaşmanın düşük olduğunu ve sonuçların rastgele tahminlerle karşılaştırılabilir olduğunu gösterdi.",
      "Deneyimli astrologlar yalnızca %28 oranında hemfikir oldular, bu da şans eseri beklenen %20'nin biraz üzerinde olup tutarlılık eksikliğini göstermektedir.",
      "Doğum mevsimlerinin kişilik özelliklerini etkilediğine dair bazı iddialara rağmen, yapılan çalışmalar önemli bir korelasyon bulamamış ve astrolojinin güvenilmezliğini ve bilimsel temelden yoksun olduğunu vurgulamıştır."
    ],
    "points": 129,
    "commentCount": 138,
    "retryCount": 0,
    "time": 1723469532
  }
]
