[
  {
    "id": 41886256,
    "title": "लिनक्स सीपीयू शेड्यूलर में लेज़ी प्रीएम्प्शन के लिए लंबा रास्ता",
    "originLink": "https://lwn.net/SubscriberLink/994322/45aa5211a50bc63a/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41886256",
    "commentBody": "",
    "originSummary": [
      "लिनक्स कर्नेल का सीपीयू शेड्यूलर \"लेज़ी प्रीएम्प्शन\" नामक एक नई अवधारणा पेश कर रहा है, जो शेड्यूलिंग को सरल बनाने और सिस्टम प्रदर्शन को सुधारने के लिए डिज़ाइन की गई है।",
      "लेज़ी प्रीएम्प्शन का उद्देश्य मौजूदा मोड्स PREEMPT_NONE और PREEMPT_VOLUNTARY को PREEMPT_LAZY के साथ बदलना है, जिसमें एक नया फ्लैग, TIF_NEED_RESCHED_LAZY, का उपयोग किया जाता है ताकि कार्यों को तब तक चलने की अनुमति दी जा सके जब तक कि तत्काल प्रीएम्प्शन आवश्यक न हो।",
      "यह परिवर्तन कर्नेल को छोटा और सरल बनाने का प्रयास करता है, जिसमें अधिक पूर्वानुमानित विलंबता होती है, हालांकि इसे पूर्ण कार्यान्वयन से पहले व्यापक परीक्षण और समायोजन की आवश्यकता होती है।"
    ],
    "commentSummary": [
      "लिनक्स सीपीयू शेड्यूलर आलसी प्रीएम्प्शन का अन्वेषण कर रहा है ताकि कर्नेल को सरल बनाया जा सके और अधिक पूर्वानुमानित विलंबता प्राप्त की जा सके, जो EEVDF (Earliest Eligible Virtual Deadline First) मॉडल के समान है।",
      "पूर्वग्रहण, जो प्रणालियों को घटनाओं पर तेजी से प्रतिक्रिया देने की अनुमति देता है, समग्र थ्रूपुट को नकारात्मक रूप से प्रभावित कर सकता है और लॉक प्रतिस्पर्धा को बढ़ा सकता है, जिससे विभिन्न कार्यभार के लिए विभिन्न पूर्वग्रहण मोड के बीच संतुलन की आवश्यकता होती है।",
      "प्रारंभिक परीक्षण से संकेत मिलता है कि लेज़ी प्रीएम्प्शन मौजूदा PREEMPT_VOLUNTARY मोड की तुलना में थ्रूपुट को थोड़ा कम कर देता है, जो कर्नेल में इवेंट प्राथमिकता और प्रीएम्प्शन स्तरों के प्रबंधन की जटिलता को उजागर करता है।"
    ],
    "points": 182,
    "commentCount": 47,
    "retryCount": 0,
    "time": 1729322996
  },
  {
    "id": 41884740,
    "title": "अमेरिका ने घातक दुर्घटना के बाद 2.4 मिलियन कारों में टेस्ला के फुल सेल्फ-ड्राइविंग सॉफ्टवेयर की जांच शुरू की।",
    "originLink": "https://www.reuters.com/business/autos-transportation/nhtsa-opens-probe-into-24-mln-tesla-vehicles-over-full-self-driving-collisions-2024-10-18/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41884740",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "संयुक्त राज्य अमेरिका टेस्ला के फुल सेल्फ-ड्राइविंग (FSD) सॉफ़्टवेयर की जांच कर रहा है, जो 2.4 मिलियन वाहनों में स्थापित है, एक घातक दुर्घटना के कारण।",
      "यह जांच स्वायत्त ड्राइविंग प्रौद्योगिकियों की सुरक्षा और विश्वसनीयता के बारे में चल रही चिंताओं को उजागर करती है।",
      "टेस्ला के FSD सॉफ़्टवेयर की जांच का स्वायत्त ड्राइविंग कारों के नियमों और विकास के भविष्य पर महत्वपूर्ण प्रभाव पड़ सकता है।"
    ],
    "points": 139,
    "commentCount": 7,
    "retryCount": 0,
    "time": 1729298775
  },
  {
    "id": 41882955,
    "title": "एक्सप्रेस v5",
    "originLink": "https://expressjs.com/2024/10/15/v5-release.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41882955",
    "commentBody": "",
    "originSummary": [
      "एक्सप्रेस v5 जारी किया गया है, जो Node.js फ्रेमवर्क के लिए एक महत्वपूर्ण अपडेट है, जो स्थिरता, सुरक्षा और रखरखाव को सरल बनाने पर केंद्रित है।",
      "मुख्य अपडेट में पुराने Node.js संस्करणों के लिए समर्थन को हटाना, बेहतर पथ मिलान, उन्नत सुरक्षा, प्रॉमिस समर्थन, और बॉडी पार्सर में बदलाव शामिल हैं।",
      "अप्रचलित विधि हस्ताक्षर एक सुसंगत एपीआई के लिए हटा दिए गए हैं, और v4 से अपग्रेड करने वालों के लिए एक विस्तृत माइग्रेशन गाइड उपलब्ध है।"
    ],
    "commentSummary": [
      "एक दशक के बाद Express v5 को जारी किया गया है, जिसमें प्रमुख अपडेट जैसे उन्नत सुरक्षा और असिंक्रोनस हैंडलर्स के लिए समर्थन शामिल हैं।- रिलीज़ में देरी सुरक्षा ऑडिट को प्राथमिकता देने और एक स्थिर संस्करण सुनिश्चित करने के लिए की गई थी, जो टीम की विश्वसनीयता के प्रति प्रतिबद्धता को दर्शाता है।- जबकि कुछ उपयोगकर्ताओं को अपग्रेड करने में चुनौतियों का सामना करना पड़ता है, Express टीम की प्रयासों की सराहना की जाती है, और इसकी तुलना अन्य फ्रेमवर्क जैसे Fastify और Koa के साथ की जाती है।"
    ],
    "points": 137,
    "commentCount": 37,
    "retryCount": 0,
    "time": 1729281731
  },
  {
    "id": 41888061,
    "title": "क्या मैकिन्से और इसके परामर्श प्रतिद्वंद्वी बहुत बड़े हो गए हैं?",
    "originLink": "https://www.economist.com/business/2024/03/25/have-mckinsey-and-its-consulting-rivals-got-too-big",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41888061",
    "commentBody": "",
    "originSummary": [
      "पूर्व मैकिन्से भागीदारों से एक गुमनाम ज्ञापन परामर्श कंपनी की तीव्र वृद्धि और रणनीतिक ध्यान की कमी की आलोचना करता है, यह सुझाव देते हुए कि इसकी प्रतिष्ठा खतरे में है।",
      "यह ज्ञापन इस बारे में व्यापक उद्योग चिंताओं को उजागर करता है कि क्या प्रमुख परामर्श फर्मों, जैसे मैकिन्से, ने बहुत अधिक विस्तार किया है।",
      "अन्य प्रचलित व्यापार विषयों में नाइकी की विपणन सफलता, बड़ी तकनीकी कंपनियों की कृत्रिम बुद्धिमत्ता रणनीतियाँ, और ग्राहक सेवा में एआई का बढ़ता उपयोग शामिल हैं।"
    ],
    "commentSummary": [
      "चर्चा में बड़े परामर्श फर्मों जैसे मैकिन्से की आलोचना की गई है कि वे अल्पकालिक लाभों को प्राथमिकता देते हैं, विषाक्त कार्य वातावरण को बढ़ावा देते हैं, और संदिग्ध नैतिक प्रथाओं में संलग्न होते हैं।",
      "इन फर्मों के कॉर्पोरेट निर्णय-निर्माण में महत्वपूर्ण प्रभाव के बारे में चिंताएँ उठाई जा रही हैं, जो अक्सर कार्यकारियों के लिए एक दायित्व कवच के रूप में कार्य करती हैं और रणनीतिक मूल्य के बजाय राजनीतिक आवरण प्रदान करती हैं।",
      "आलोचना उनके विवादास्पद परियोजनाओं में शामिल होने तक फैली हुई है, जिसमें यह सुझाव दिया गया है कि उनके आकार और प्रभाव के कारण जवाबदेही की कमी होती है।"
    ],
    "points": 114,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1729349208
  },
  {
    "id": 41885231,
    "title": "इंटरएक्टिव विज़ुअलाइज़ेशन के साथ क्लॉड की क्षमताओं का लाभ कैसे उठाएं",
    "originLink": "https://github.com/anthropics/anthropic-quickstarts/tree/main/financial-data-analyst",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41885231",
    "commentBody": "",
    "originSummary": [
      "क्लॉड फाइनेंशियल डेटा एनालिस्ट एक नेक्स्ट.जेएस एप्लिकेशन है जो क्लॉड की एआई का उपयोग करके चैट के माध्यम से इंटरैक्टिव वित्तीय डेटा विश्लेषण करता है, जिसमें बुद्धिमान डेटा विश्लेषण और बहु-प्रारूप फ़ाइल समर्थन की विशेषताएं शामिल हैं।",
      "ऐप विभिन्न डेटा विज़ुअलाइज़ेशन का समर्थन करता है, जिसमें लाइन, बार, एरिया, स्टैक्ड एरिया, और पाई चार्ट शामिल हैं, और सेटअप के लिए Node.js 18+ और एक Anthropic API कुंजी की आवश्यकता होती है।",
      "यह Next.js, React, TailwindCSS, और Recharts जैसी तकनीकी स्टैक के साथ फ्रंटेंड के लिए निर्मित है, और बैकएंड के लिए Next.js API Routes और Anthropic SDK का उपयोग करता है, जो पर्यावरणीय डेटा और सोशल मीडिया विश्लेषण जैसे विविध क्षेत्रों में उपयोग के मामले प्रस्तुत करता है।"
    ],
    "commentSummary": [
      "एक कंपनी ने अपने बड़े भाषा मॉडल (LLM) बैकएंड को Claude से ChatGPT में स्थानांतरित कर दिया, क्योंकि Claude की प्रतिक्रियाओं में अप्रत्याशित बदलाव आ गए थे, जो कि लगातार API आउटपुट की महत्ता को दर्शाता है।",
      "क्लॉड के साथ अनुप्रयोग विकसित करने की चुनौतियों और संभावनाओं के बारे में चर्चाएँ होती हैं, जहाँ कुछ लोग इसके ऊपर न्यूनतम परतें बनाने के मूल्य पर सवाल उठाते हैं और अन्य इसे विशेष अवसरों के रूप में देखते हैं।",
      "वार्तालाप विश्वसनीय एपीआई प्रतिक्रियाओं की आवश्यकता, ओपन-सोर्स परियोजनाओं में रुचि, और क्लॉड में अधिक मजबूत बुनियादी विशेषताओं की मांग पर जोर देता है।"
    ],
    "points": 98,
    "commentCount": 26,
    "retryCount": 0,
    "time": 1729305569
  }
]
