[
  {
    "id": 41886256,
    "title": "الطريق الطويل إلى الاستباق الكسول في مجدول وحدة المعالجة المركزية لنظام لينكس",
    "originLink": "https://lwn.net/SubscriberLink/994322/45aa5211a50bc63a/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41886256",
    "commentBody": "",
    "originSummary": [
      "يقدم مجدول وحدة المعالجة المركزية في نواة لينكس مفهومًا جديدًا يُسمى \"التأجيل الكسول\"، والذي يهدف إلى تبسيط الجدولة وتحسين أداء النظام.",
      "يهدف التأجيل الكسول إلى استبدال الأوضاع الحالية PREEMPT_NONE و PREEMPT_VOLUNTARY بـ PREEMPT_LAZY، باستخدام علم جديد، TIF_NEED_RESCHED_LAZY، للسماح للمهام بالعمل لفترة أطول ما لم تكن الحاجة إلى التأجيل الفوري ضرورية.",
      "يهدف هذا التغيير إلى جعل النواة أصغر وأبسط، مع تقليل التأخيرات بشكل أكثر توقعًا، على الرغم من أنه يتطلب اختبارات مكثفة وتعديلات قبل التنفيذ الكامل."
    ],
    "commentSummary": [
      "يستكشف مجدول وحدة المعالجة المركزية في نظام لينكس تقنية التأجيل الكسول لتبسيط النواة وتحقيق فترات انتظار أكثر قابلية للتنبؤ، وذلك بشكل مشابه لنموذج EEVDF (الأولوية الافتراضية لأقرب موعد نهائي مؤهل).",
      "يمكن أن تؤثر الأولوية، التي تسمح للأنظمة بالاستجابة السريعة للأحداث، سلبًا على الإنتاجية العامة وتزيد من التنافس على الأقفال، مما يستلزم تحقيق توازن بين أوضاع الأولوية المختلفة لمختلف أعباء العمل.",
      "تشير الاختبارات الأولية إلى أن الاستباقية الكسولة تقلل قليلاً من الإنتاجية مقارنة بوضع PREEMPT_VOLUNTARY الحالي، مما يبرز تعقيد إدارة أولوية الأحداث ومستويات الاستباقية في النواة."
    ],
    "points": 182,
    "commentCount": 47,
    "retryCount": 0,
    "time": 1729322996
  },
  {
    "id": 41884740,
    "title": "الولايات المتحدة تحقق في برنامج القيادة الذاتية الكاملة من تسلا في 2.4 مليون سيارة بعد حادث مميت",
    "originLink": "https://www.reuters.com/business/autos-transportation/nhtsa-opens-probe-into-24-mln-tesla-vehicles-over-full-self-driving-collisions-2024-10-18/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41884740",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "تجري الولايات المتحدة تحقيقًا في برنامج القيادة الذاتية الكاملة (FSD) الخاص بشركة تسلا، والذي تم تثبيته في 2.4 مليون مركبة، بسبب حادث مميت.",
      "تسلط هذه التحقيقات الضوء على المخاوف المستمرة بشأن سلامة وموثوقية تقنيات القيادة الذاتية.",
      "قد يكون لفحص برنامج القيادة الذاتية الكاملة (FSD) من تسلا تأثيرات كبيرة على مستقبل تنظيم وتطوير السيارات ذاتية القيادة."
    ],
    "points": 139,
    "commentCount": 7,
    "retryCount": 0,
    "time": 1729298775
  },
  {
    "id": 41882955,
    "title": "إكسبريس الإصدار 5",
    "originLink": "https://expressjs.com/2024/10/15/v5-release.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41882955",
    "commentBody": "",
    "originSummary": [
      "تم إصدار Express v5، مما يمثل تحديثًا مهمًا لإطار عمل Node.js، مع التركيز على الاستقرار والأمان وتبسيط الصيانة.",
      "تشمل التحديثات الرئيسية إسقاط دعم الإصدارات القديمة من Node.js، وتحسين مطابقة المسارات، وتعزيز الأمان، ودعم الوعود، وتغييرات في محلل الجسم.",
      "تمت إزالة توقيعات الطرق المهملة للحصول على واجهة برمجة تطبيقات متسقة، ويتوفر دليل ترحيل مفصل لأولئك الذين يقومون بالترقية من الإصدار الرابع."
    ],
    "commentSummary": [
      "تم إصدار Express v5 بعد عقد من الزمن، مع تحديثات رئيسية مثل تعزيز الأمان ودعم المعالجات غير المتزامنة. تم تأجيل الإصدار لإعطاء الأولوية لمراجعات الأمان وضمان نسخة مستقرة، مما يعكس التزام الفريق بالموثوقية. بينما يواجه بعض المستخدمين تحديات في الترقية، يُشاد بفريق Express على جهودهم، وتُجرى مقارنات مع أطر عمل أخرى مثل Fastify وKoa."
    ],
    "points": 137,
    "commentCount": 37,
    "retryCount": 0,
    "time": 1729281731
  },
  {
    "id": 41888061,
    "title": "هل أصبحت ماكينزي ومنافسيها في مجال الاستشارات كبيرة جدًا؟",
    "originLink": "https://www.economist.com/business/2024/03/25/have-mckinsey-and-its-consulting-rivals-got-too-big",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41888061",
    "commentBody": "",
    "originSummary": [
      "مذكرة مجهولة من شركاء سابقين في شركة ماكينزي تنتقد الشركة الاستشارية بسبب نموها السريع وافتقارها للتركيز الاستراتيجي، مشيرة إلى أن سمعتها في خطر.",
      "تسلط هذه المذكرة الضوء على مخاوف أوسع في الصناعة بشأن ما إذا كانت شركات الاستشارات الكبرى، مثل ماكينزي، قد توسعت بشكل مفرط.",
      "تشمل مواضيع الأعمال الرائجة الأخرى نجاح تسويق نايكي، واستراتيجيات الذكاء الاصطناعي للشركات التقنية الكبرى، والاستخدام المتزايد للذكاء الاصطناعي في خدمة العملاء."
    ],
    "commentSummary": [
      "ينتقد النقاش الشركات الاستشارية الكبيرة مثل ماكينزي لتركيزها على المكاسب قصيرة الأجل، وتعزيزها لبيئات عمل سامة، وانخراطها في ممارسات أخلاقية مشكوك فيها.",
      "تُثار مخاوف بشأن التأثير الكبير لهذه الشركات في اتخاذ القرارات المؤسسية، حيث تعمل غالبًا كدرع حماية للمسؤولين التنفيذيين وتوفر غطاءً سياسيًا بدلاً من تقديم قيمة استراتيجية.",
      "تمتد الانتقادات إلى مشاركتهم في مشاريع مثيرة للجدل، مع اقتراحات بأن حجمهم ونفوذهم يسهمان في نقص المساءلة."
    ],
    "points": 114,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1729349208
  },
  {
    "id": 41885231,
    "title": "كيفية الاستفادة من قدرات كلود من خلال التصور التفاعلي",
    "originLink": "https://github.com/anthropics/anthropic-quickstarts/tree/main/financial-data-analyst",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41885231",
    "commentBody": "",
    "originSummary": [
      "كلود محلل البيانات المالية هو تطبيق Next.js يستفيد من الذكاء الاصطناعي لكلود لتحليل البيانات المالية بشكل تفاعلي عبر الدردشة، ويتميز بتحليل البيانات الذكي ودعم الملفات متعددة الصيغ.",
      "يدعم التطبيق تصورات بيانات متنوعة، بما في ذلك الرسوم البيانية الخطية والشريطية والمساحية والمكدسة والدائرية، ويتطلب Node.js 18+ ومفتاح API من Anthropic للإعداد.",
      "تم بناؤه باستخدام مجموعة تقنيات تتضمن Next.js وReact وTailwindCSS وRecharts للواجهة الأمامية، وNext.js API Routes وAnthropic SDK للواجهة الخلفية، مما يوفر حالات استخدام في مجالات متنوعة مثل بيانات البيئة وتحليلات وسائل التواصل الاجتماعي."
    ],
    "commentSummary": [
      "انتقلت شركة من استخدام نموذج اللغة الكبير (LLM) الخاص بها من Claude إلى ChatGPT بسبب تغييرات غير متوقعة في استجابات Claude، مما يبرز أهمية الاتساق في مخرجات واجهة برمجة التطبيقات.",
      "تثار مناقشات حول التحديات والإمكانات في تطوير التطبيقات باستخدام كلود، حيث يشكك البعض في قيمة إنشاء طبقات بسيطة فوقه بينما يرى آخرون فرصًا في الأسواق المتخصصة.",
      "تؤكد المحادثة على الحاجة إلى استجابات موثوقة من واجهات برمجة التطبيقات، والاهتمام بالمشاريع مفتوحة المصدر، والطلب على ميزات أساسية أكثر قوة في كلود."
    ],
    "points": 98,
    "commentCount": 26,
    "retryCount": 0,
    "time": 1729305569
  }
]
