[
  {
    "id": 37810144,
    "title": "ஃபிளாப்பி டிர்ட்: மேகோஸ் கண்டுபிடிப்பாளரில் ஃபிளாப்பி பறவை செயல்படுத்தப்பட்டது",
    "originLink": "https://eieio.games/nonsense/game-11-flappy-bird-finder/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37810144",
    "commentBody": "",
    "originSummary": [
      "மேகோஸ் ஃபைண்டர் இடைமுகத்திற்குள் இயங்கும் \"ஃபிளாப்பி பேர்ட்\" இன் பிரதிபலிப்பான \"ஃபிளாப்பி டிர்ட்\" என்ற விளையாட்டை ஆசிரியர் உருவாக்கியுள்ளார்.",
      "ஃபைண்டரில் உள்ள \"தேதி கடைசியாகத் திறக்கப்பட்டது\" புலத்தைக் கையாளுவதன் மூலம் இந்த உருவாக்கம் அடையப்பட்டது, டிஸ்ப்ளேவைக் கட்டுப்படுத்த ஆப்பிள்ஸ்கிரிப்ட் மூலம், வினாடிக்கு 4 பிரேம்களில் இயங்குகிறது, இருப்பினும் எப்போதாவது உள்ளீடுகளைக் கைவிடுகிறது.",
      "இந்த வளர்ச்சி செயல்முறை ஆசிரியரால் விவாதிக்கப்பட்டு ரசிக்கப்பட்டது, இந்த அணுகுமுறையைப் பயன்படுத்தி உருவாக்கப்பட்ட பிற விளையாட்டுகளின் சாத்தியத்தை பரிந்துரைத்தது."
    ],
    "commentSummary": [
      "\"ஃபிளாப்பி டிர்ட்\" திட்டம் மேகோஸ் ஃபைண்டருக்குள் ஃபிளாப்பி பேர்ட் என்ற விளையாட்டின் செயல்படுத்தலாகும், இது விளையாட்டு வளர்ச்சிக்கு ஒரு தனித்துவமான அணுகுமுறையைக் காட்டுகிறது.",
      "இந்த திட்டம் அதன் அசல் தன்மை மற்றும் அது செயல்படுத்தப்பட்ட விதத்திற்காக நேர்மறையான எதிர்வினைகளைப் பெற்றுள்ளது.",
      "இது சாத்தியமான ஒத்த திட்டங்கள் மற்றும் ஆப்பிள்ஸ்கிரிப்ட் மற்றும் ஃபைண்டரின் திறன்களைப் பற்றிய விவாதங்களைத் தூண்டியுள்ளது."
    ],
    "points": 470,
    "commentCount": 51,
    "retryCount": 0,
    "time": 1696770636
  },
  {
    "id": 37813895,
    "title": "சக பார்வையற்ற கணினி பயனர்களுக்கு நான் ஏன் இனி மேக்கை பரிந்துரைக்க முடியாது",
    "originLink": "https://www.applevis.com/blog/we-deserve-better-apple-why-i-can-no-longer-recommend-mac-fellow-blind-computer-users",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37813895",
    "commentBody": "",
    "originSummary": [
      "சஃபாரியில் உள்ள வாய்ஸ்ஓவர் அம்சத்தில் தீர்க்கப்படாத சிக்கல் காரணமாக, குறிப்பாக பார்வையற்ற பயனர்களுக்கு அணுகல் வழக்கறிஞர் டேவிட் குட்வின் மேக்ஸ் மீது அதிருப்தி அடைந்துள்ளார்.",
      "குட்வின் இந்த பிழையை சரிசெய்ய ஆப்பிளின் நடவடிக்கையின்மையை விமர்சிக்கிறார் மற்றும் ஆப்பிளின் அணுகல் குழுவுடன் மேம்பட்ட தகவல்தொடர்புக்கு வேண்டுகோள் விடுக்கிறார்.",
      "குரல் அதிருப்திக்கு ஒரு குழு பதிலை அவர் ஊக்குவிக்கிறார், மேலும் சிக்கல் சரிசெய்யப்படும் வரை மேக்குகளை வாங்குவதை அல்லது அங்கீகரிப்பதைத் தவிர்க்கிறார், சிலர் விரக்திகளை வெளிப்படுத்துகிறார்கள், மற்றவர்கள் குறிப்பிடத்தக்க சிக்கல்களைப் புகாரளிக்கவில்லை."
    ],
    "commentSummary": [
      "உரையாடல் வெவ்வேறு இயக்க முறைமைகளில் பார்வையற்ற பயனர்களுக்கான அணுகல் அம்சங்களில் கவனம் செலுத்துகிறது, மாறுபட்ட பயனர் விருப்பத்துடன்.",
      "சில பயனர்கள் ஆப்பிளின் அணுகல் முயற்சிகளைப் பாராட்டுகிறார்கள், ஆனால் மற்றவர்கள் மேகோஸில் உள்ள வாய்ஸ்ஓவர் அம்சத்தில் சிக்கல்களைப் புகாரளிக்கின்றனர், இதனால் அவர்கள் விண்டோஸ் மற்றும் லினக்ஸ் போன்ற மாற்றுகளுக்கு மாறுகிறார்கள்.",
      "இந்த விவாதம் அணுகலின் சார்புத்தன்மையை அடிக்கோடிட்டுக் காட்டுகிறது மற்றும் ஆப்பிள் பிழைகளை நிவர்த்தி செய்து அதன் வாய்ஸ்ஓவர் அம்சத்தின் ஸ்திரத்தன்மையை மேம்படுத்த வேண்டியதன் அவசியத்தை வலியுறுத்துகிறது."
    ],
    "points": 344,
    "commentCount": 70,
    "retryCount": 0,
    "time": 1696795160
  },
  {
    "id": 37812217,
    "title": "OpenIPC: உங்கள் IP கேமராவுக்கான மாற்று திறந்த சாதனநிரல்",
    "originLink": "https://github.com/OpenIPC",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37812217",
    "commentBody": "",
    "originSummary": [
      "ஓபன்ஐபிசி என்பது ஐபி கேமரா உற்பத்தியாளர்களால் வழங்கப்பட்ட பாதுகாப்பற்ற மற்றும் தனியுரிம ஃபார்ம்வேரை மாற்ற வடிவமைக்கப்பட்ட திறந்த மூல ஃபார்ம்வேர் ஆகும்.",
      "நேரடி நிறுவலுக்காக முன்பே தொகுக்கப்பட்ட வடிவத்தில் கிடைக்கும் ஃபார்ம்வேர், மேலும் மாற்றங்கள் மற்றும் மேம்பாட்டிற்கான மூல கோப்புகளை அணுக அனுமதிக்கிறது. இது ஆரம்பத்தில் ஹைசிலிகான் செயலிகளுடன் இணக்கமாக இருந்தது, ஆனால் இப்போது வெவ்வேறு உற்பத்தியாளர்களின் சிப்களை உள்ளடக்கியது.",
      "இந்த திட்டம் பயனர் பங்களிப்புகளை ஊக்குவிக்கிறது மற்றும் கருத்து மற்றும் பரிந்துரைகளை தீவிரமாகக் கோருகிறது, ஒத்துழைப்புக்கான பல களஞ்சியங்களை வழங்குகிறது."
    ],
    "commentSummary": [
      "ஓபன்ஐபிசி திட்டம் ஐபி கேமராக்களுக்கான திறந்த ஃபார்ம்வேரை வழங்குகிறது, இது சீன ஐபி கேமராக்களை ஃபார்ம்வேரைத் திறப்பது தொடர்பான சிக்கல்களைப் பூர்த்தி செய்கிறது.",
      "இருப்பினும், ஃபார்ம்வேரின் சில பகுதிகள் தனியுரிமமாக இருப்பது மற்றும் உட்பொதிக்கப்பட்ட லினக்ஸின் வரம்புகள் குறித்த கவலைகள் எழுப்பப்படுகின்றன, இது ஓபன்ஐபிசி திட்டத்தில் திறந்த மூலத்தை முழுமையாக ஏற்றுக்கொள்வது குறித்த சந்தேகத்தை சமிக்ஞை செய்கிறது.",
      "முதன்மையாக ரஷ்ய மையக் குழு காரணமாக தகவல்தொடர்பு மற்றும் பங்களிப்பு சிக்கல்களும் உள்ளன, மேலும் திறந்த மூல தீர்வுகளின் தேவை மற்றும் சட்டம் அல்லது ஓபன்வொர்ட் மாதிரியைப் பின்பற்றுவது போன்ற சாத்தியமான உத்திகள் குறித்த விவாதங்களும் உள்ளன."
    ],
    "points": 323,
    "commentCount": 53,
    "retryCount": 0,
    "time": 1696784222
  },
  {
    "id": 37815674,
    "title": "2023 ஆம் ஆண்டின் பிற்பகுதியில் எனது தனிப்பட்ட சி குறியீட்டு பாணி",
    "originLink": "https://nullprogram.com/blog/2023/10/08/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37815674",
    "commentBody": "",
    "originSummary": [
      "ஆசிரியர் சி மொழிக்கான தங்கள் தனிப்பட்ட குறியீட்டு பாணியைப் பகிர்ந்து கொள்கிறார், உற்பத்தித்திறன் மற்றும் ஒட்டுமொத்த நிறுவனத்தை மேம்படுத்த அவர்கள் செய்த மாற்றங்களை முன்னிலைப்படுத்துகிறார்.",
      "பழங்கால வகைகளுக்கான குறுகிய பெயர்கள், மேம்பட்ட தெளிவுக்காக தட்டச்சுகளின் பயன்பாடு மற்றும் மேக்ரோக்கள், அளவுருக்கள், செயல்பாடுகள் மற்றும் சரங்களுக்கான குறிப்பிட்ட விருப்பத்தேர்வுகள் ஆகியவை பயன்படுத்தப்படும் நுட்பங்களில் அடங்கும்.",
      "குறியீட்டுக்கான அவர்களின் அணுகுமுறை அனைவரையும் ஈர்க்காது என்பதை ஆசிரியர் ஒப்புக்கொள்கிறார், மேலும் பிற திட்டங்களுக்கு பங்களிக்கும்போது அவர்கள் தங்கள் பாணியை மாற்றியமைக்க தயாராக உள்ளனர். சர வகைகள், கட்டமைப்பு வருவாய்கள், தொடக்கப்படுத்தல் பணிகளுக்கான விருப்பங்களும் எடுத்துக்காட்டுகளுடன் பகிர்ந்து கொள்ளப்படுகின்றன."
    ],
    "commentSummary": [
      "சுருக்கங்கள் குறியீட்டு பாணி, மரபுகள் மற்றும் சி நிரலாக்கத்தில் சிறந்த நடைமுறைகள் குறித்த நுண்ணறிவுகளை வழங்குகின்றன, இது மேல் கேஸ் / லோயர்கேஸ் மேக்ரோ பயன்பாடு, தனிப்பயன் வகைகள் வரையறை, பெயரிடல் முரண்பாடு குழப்பங்கள் போன்ற அம்சங்களை உள்ளடக்கியது.",
      "அவர்கள் ஸ்ட்ரக்ட்களை வருவாய் வகைகளாகப் பயன்படுத்துவது குறித்து விவாதிக்கிறார்கள், டைப்டெஃப்களின் நன்மை தீமைகளை மதிப்பிடுகிறார்கள், கான்ஸ்ட் மற்றும் கையொப்பமிடப்பட்ட குறியீட்டெண்களின் சாத்தியமான அபாயங்களைப் பற்றி விவாதிக்கிறார்கள், உற்பத்தித்திறன் மற்றும் தனிப்பட்ட குறியீட்டு விருப்பங்களை சமப்படுத்த வேண்டியதன் அவசியத்தை வலியுறுத்துகின்றனர்.",
      "இந்த விஷயங்களில் கருத்துக்கள் மற்றும் விருப்பங்கள் குறியீட்டு பயிற்சியாளர்களிடையே மாறுபடும் என்பது சிறப்பம்சமாகும்."
    ],
    "points": 316,
    "commentCount": 228,
    "retryCount": 0,
    "time": 1696811403
  },
  {
    "id": 37809276,
    "title": "டெபியன் ஏன் இப்படி இருக்கிறான்?",
    "originLink": "https://blog.liw.fi/posts/2023/debian-reasons/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37809276",
    "commentBody": "",
    "originSummary": [
      "டெபியன் என்பது ஒரு இலவச, திறந்த மூல பொது-நோக்க இயக்க முறைமையாகும், இது ஒரு ஜனநாயக நிர்வாக கட்டமைப்பைக் கொண்டுள்ளது, அங்கு திட்டத் தலைவர் ஆண்டுதோறும் தேர்ந்தெடுக்கப்படுகிறார்.",
      "கட்டற்ற மென்பொருளுக்கான அர்ப்பணிப்பு, சார்புநிலைகள் மீதான கட்டுப்பாடு மற்றும் சுய-கட்டுப்படுத்தப்பட்ட தளத்தை வழங்குவதை நோக்கமாகக் கொண்ட ஒரு சமூக ஒப்பந்தம் மற்றும் வழிகாட்டுதல்களை இது பின்பற்றுகிறது. இதை அடைய தொகுக்கப்பட்ட நூலகங்களைப் பயன்படுத்துவதைத் தவிர்க்கிறது.",
      "இதில் உள்ள முக்கியத்துவம் மற்றும் நம்பிக்கை காரணமாக தொகுப்பு பதிவேற்றங்களுக்கு டெபியன் ஒரு முறையான உறுப்பினர் செயல்முறையைப் பின்பற்றுகிறார். குழப்பத்தைத் தடுக்கவும், பிரதிபலிப்பதை எளிதாக்கவும், அதன் வெளியீடுகளுக்கு குறியீட்டு பெயர்களைப் பயன்படுத்துகிறது. அதன் சிக்கலான தன்மை காரணமாக, இது படிப்படியாக உருவாகிறது, விரிவான உரையாடல் மற்றும் ஒருமித்த கருத்து தேவைப்படுகிறது."
    ],
    "commentSummary": [
      "உரையாடல் டெபியனின் பல்வேறு அம்சங்களை ஆராய்கிறது, இதில் அதன் பேக்கேஜிங், சார்பு மேலாண்மை உத்திகள் மற்றும் அதன் தொகுப்பு மேலாளரின் குறியீட்டின் தரம் ஆகியவை அடங்கும்.",
      "பங்கேற்பாளர்கள் கணினியின் விளைவுகள், டெபியனுக்கான ஆதரவு மற்றும் நிதி, லினக்ஸ் விநியோகங்களின் எதிர்காலம் மற்றும் டெபியனைப் பயன்படுத்துவதன் நன்மை தீமைகள் பற்றியும் விவாதிக்கிறார்கள்.",
      "உரையாடல் பலவிதமான பார்வைகள் மற்றும் விவாதங்களை உள்ளடக்கியது, பயனர் முன்னோக்குகளின் பன்முகத்தன்மை மற்றும் டெபியன் பயன்பாட்டுடன் தொடர்புடைய உள்ளார்ந்த சவால்களை வெளிப்படுத்துகிறது."
    ],
    "points": 285,
    "commentCount": 169,
    "retryCount": 0,
    "time": 1696760519
  },
  {
    "id": 37809721,
    "title": "ஹாஷிகார்ப் நிறுவனத்திற்கு எச்சரிக்கை சேர்க்க ஹோம்ப்ரூ",
    "originLink": "https://github.com/Homebrew/homebrew-core/pull/139538",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37809721",
    "commentBody": "",
    "originSummary": [
      "ஒரு கிட்ஹப் இழுப்பு கோரிக்கை மேகோஸுக்கு பரவலாகப் பயன்படுத்தப்படும் தொகுப்பு மேலாளரான ஹோம்ப்ரூவிலிருந்து சில மென்பொருள் சூத்திரங்களை நீக்க முன்மொழிகிறது.",
      "டெராஃபார்ம் மற்றும் கன்சல் உள்ளிட்ட ஹாஷிகார்ப் நிறுவனத்திடமிருந்து பெறப்பட்ட கருவிகள், அவற்றின் உரிமத்தில் சமீபத்திய மாற்றத்திலிருந்து உருவானவை.",
      "இழுப்பு கோரிக்கை டெர்ராஃபார்முக்கு ஒரு சாத்தியமான மாற்றீட்டை பரிந்துரைக்கிறது: ஓபன்டோஃபு, மற்றும் உரிம மாற்றத்தைத் தொடர்ந்து ஹோம்ப்ரூவைப் புதுப்பிக்கும் தற்போதைய செயல்பாட்டில் குழு உறுப்பினர்களிடமிருந்து கருத்துக்களை தீவிரமாக அழைக்கிறது."
    ],
    "commentSummary": [
      "இந்த உரையாடல் முக்கியமாக ஹாஷிகார்ப் மற்றும் அதன் தயாரிப்புகளைப் பற்றிய பயனர் அனுபவங்கள் மற்றும் கண்ணோட்டங்களை நிவர்த்தி செய்கிறது, குறிப்பாக உரிமம், விலை நிர்ணயம் மற்றும் நேர்காணல் செயல்முறையில் சிக்கல்களைப் புகாரளிக்கும் சில பயனர்களில் கவனம் செலுத்துகிறது.",
      "ஹாஷிகார்ப்பின் விஎம்வேர் அடாப்டருடன் ஒரு எதிர்மறையான அனுபவம் பகிர்ந்து கொள்ளப்பட்டது, இது ஒட்டுமொத்த விமர்சனத்திற்கு பங்களித்தது.",
      "ஹோம்ப்ரூவின் வடிவமைப்பு தேர்வுகளும் ஆராயப்படுகின்றன, குறிப்பாக உரிம அச்சங்கள் காரணமாக ஹாஷிகார்ப்பின் டெர்ராஃபார்மை தொகுப்பு மேலாளரில் சேர்க்க வேண்டாம் என்ற முடிவு."
    ],
    "points": 253,
    "commentCount": 93,
    "retryCount": 0,
    "time": 1696766408
  },
  {
    "id": 37809516,
    "title": "ஒரு ராஸ்பெர்ரி பை 5 இரண்டு பை 4 எஸ் ஐ விட சிறந்தது",
    "originLink": "https://hackaday.com/2023/09/28/a-raspberry-pi-5-is-better-than-two-pi-4s/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37809516",
    "commentBody": "",
    "originSummary": [
      "அதிகரித்த வேகம், மேம்பட்ட வைஃபை மற்றும் இரட்டை டிஸ்ப்ளேக்களுக்கான ஆதரவு போன்ற மேம்பாடுகளைக் கொண்ட ராஸ்பெர்ரி பை 5 அறிமுகப்படுத்தப்பட்டுள்ளது. இருப்பினும், இது அதிக வெப்பத்தை உருவாக்குகிறது மற்றும் கூடுதல் குளிரூட்டல் தேவைப்படுகிறது என்ற கவலைகள் உள்ளன.",
      "பயனர்கள் சாதனத்தின் காட்சி பொருந்தக்கூடிய தன்மை மற்றும் யூ.எஸ்.பி-சி பயன்பாடு பற்றி விவாதிக்கின்றனர். கலவையான விமர்சனங்கள் உள்ளன, அதன் செயல்திறன், விலை நிர்ணயம் மற்றும் சில அம்சங்களை அகற்றுதல் ஆகியவற்றைச் சுற்றி விவாதங்கள் வட்டமிடுகின்றன.",
      "சமூகம் ராஸ்பெர்ரி பை 5 இன் சாத்தியமான பயன்பாடுகளுக்கான மாறுபட்ட பரிந்துரைகளைக் காட்டுகிறது, அதாவது திசைவியாக அல்லது மென்பொருள் வரையறுக்கப்பட்ட ரேடியோ காட்சிகளுக்கு அதைப் பயன்படுத்துவது, அதன் பன்முகத்தன்மையை நிரூபிக்கிறது."
    ],
    "commentSummary": [
      "இந்த உரையாடல் முக்கியமாக ராஸ்பெர்ரி பை 5 இன் அம்சங்களை உள்ளடக்கியது, இதில் அதன் சக்தி தேவைகள், யூ.எஸ்.பி-சி தரநிலை, ராஸ்பெர்ரி பை 4 உடன் ஒப்பிடும்போது செயல்திறன், குளிரூட்டும் தேவை மற்றும் புதுப்பிக்கப்பட்ட விவரக்குறிப்புகள் ஆகியவை அடங்கும்.",
      "மாறுபட்ட திட்டங்களுக்கு ராஸ்பெர்ரி பை 5 இன் பொருத்தம், கிடைக்கக்கூடிய மாற்று வழிகள் மற்றும் செலவு மற்றும் நினைவக கட்டுப்பாடுகள் குறித்த அச்சங்கள் குறித்து பலவிதமான கருத்துக்கள் உள்ளன.",
      "ராஸ்பெர்ரி பை என்பது அடிப்படை கணினி அறிவியலைக் கற்பிப்பதற்கும், ஒரு அடிப்படை மைக்ரோ-கன்ட்ரோலரை விட அதிகமாக தேவைப்படும் பணிகளைச் செய்வதற்கும் பயன்படுத்தப்படும் சிறிய ஒற்றை-பலகை கணினிகளின் தொடர் ஆகும்."
    ],
    "points": 245,
    "commentCount": 185,
    "retryCount": 0,
    "time": 1696763535
  },
  {
    "id": 37814748,
    "title": "நாற்பது வருட நிரலாக்கம்",
    "originLink": "https://fabiensanglard.net/40/index.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37814748",
    "commentBody": "",
    "originSummary": [
      "அனுபவம் வாய்ந்த புரோகிராமர், ஃபேபியன் சாங்லார்ட், பணிச்சூழலியல் பணிநிலைய அமைப்புகள் மற்றும் நீண்டகால நிரலாக்கத்திலிருந்து மன அழுத்தத்தைக் குறைக்க வலி நிவாரண உத்திகளுக்கான உதவிக்குறிப்புகளை வழங்குகிறார்.",
      "செங்குத்து மவுஸ், மேஜிக் டிராக்பேட் மற்றும் எர்கோடாக்ஸ் இசட் விசைப்பலகை ஆகியவற்றைப் பயன்படுத்துவது மற்றும் மணிக்கட்டு மற்றும் கை திரிபுகளைக் கட்டுப்படுத்த உரை எடிட்டர்களில் விஐஎம் பயன்முறையை இயக்குவது ஆகியவை சாங்லார்டின் பரிந்துரைகளில் அடங்கும்.",
      "அவர் ஒரு நிலையான மேசையின் நன்மைகளை மேலும் எடுத்துக்காட்டுகிறார், மேலும் மன அழுத்த அளவை நிர்வகிக்க நீட்சி பயிற்சிகள் மற்றும் தியானத்தைப் பயன்படுத்த பரிந்துரைக்கிறார்."
    ],
    "commentSummary": [
      "மன்ற விவாதம் நிரலாக்கம் மற்றும் உடல் ஆரோக்கியத்தைச் சுற்றி சுழல்கிறது, தொடர்ச்சியான விசைப்பலகை வேலையால் முன்வைக்கப்படும் சிரமங்களை ஆராய்கிறது.",
      "இது மீண்டும் மீண்டும் திரிபு காயங்களைத் தடுப்பதற்கான பணிச்சூழலியல் மற்றும் உத்திகளின் முக்கியத்துவத்தை வலியுறுத்துகிறது, கருத்துரையாளர்கள் விசைப்பலகை தளவமைப்புகள், பயிற்சிகள் மற்றும் இடைவேளைகள் தொடர்பான தங்கள் சொந்த அனுபவங்களையும் பரிந்துரைகளையும் பகிர்ந்து கொள்கிறார்கள்.",
      "சுருக்கமாக, இது தொழில்முறை வளர்ச்சியில் நிரலாக்க திறன்கள் மற்றும் அனுபவங்களின் செல்வாக்கையும் தொடுகிறது."
    ],
    "points": 234,
    "commentCount": 126,
    "retryCount": 0,
    "time": 1696802109
  },
  {
    "id": 37817152,
    "title": "ஐபோன் பிளாக்மேஜிக் கேமரா",
    "originLink": "https://www.blackmagicdesign.com/products/blackmagiccamera",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37817152",
    "commentBody": "",
    "originSummary": [
      "ஐபோனுக்கான பிளாக்மேஜிக் கேமரா பயன்பாடு தொழில்முறை தர கேமரா கட்டுப்பாடுகள் மற்றும் பட செயலாக்க திறன்களை வழங்குகிறது, இது பயனர்களுக்கு உயர்தர சினிமா உள்ளடக்கத்தை உருவாக்க உதவுகிறது.",
      "பயன்பாட்டின் பயனர்கள் அமைப்புகளை எளிதாக மாற்றலாம், கூட்டு வேலைக்காக பிளாக்மேஜிக் கிளவுட்டில் பதிவு செய்யலாம் மற்றும் கவனம் உதவி மற்றும் பட உறுதிப்படுத்தல் போன்ற சிறப்பு அம்சங்களைப் பயன்படுத்தலாம்.",
      "இந்த பயன்பாடு வண்ணத்தைத் திருத்துவதற்கும் தரப்படுத்துவதற்கும் டாவின்சி ரிசல்வுடன் ஒருங்கிணைக்கப்பட்டுள்ளது, இது ஐபோன் பயனர்களுக்கு மேம்பட்ட கட்டுப்பாடு மற்றும் எடிட்டிங் செயல்பாடுகளை வழங்குகிறது."
    ],
    "commentSummary": [
      "பிளாக்மேஜிக் ஐபோன்களுக்கான இலவச கேமரா பயன்பாட்டை அறிமுகப்படுத்தியுள்ளது, இது தொழில்முறை தரமான, கையேடு கட்டுப்பாட்டு அம்சங்களை வழங்குகிறது, இது திரைப்பட மாணவர்களுக்கு மதிப்புமிக்கது.",
      "பயன்பாடு ஒரு சினிமா விளைவுக்கான வெளிப்பாடு மற்றும் பிரேம் விகிதம் போன்ற அமைப்புகளின் கையேடு மாற்றங்களை அனுமதிக்கிறது, மேலும் டேவின்சி ரிசல்வுடன் ஒருங்கிணைக்கிறது, இது நேர்மறையான பயனர் மதிப்புரைகளுக்கு வழிவகுக்கிறது.",
      "உரையாடல்கள் தற்போது தொழில்முறை கேமராக்கள் மற்றும் ஸ்மார்ட்போன்களின் திறன்களுக்கு இடையிலான ஒப்பீட்டை மையமாகக் கொண்டுள்ளன, படப்பிடிப்புக்கான ஸ்மார்ட்போன்களின் வசதி மற்றும் சிக்கன நன்மைகளை வலியுறுத்துகின்றன."
    ],
    "points": 221,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1696829257
  },
  {
    "id": 37812142,
    "title": "டெயில்ஸ்கேல் யுனிவர்சல் டாக்கர் மோட்",
    "originLink": "https://tailscale.dev/blog/docker-mod-tailscale",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37812142",
    "commentBody": "",
    "originSummary": [
      "டெயில்ஸ்கேல் ஒரு புதிய டாக்கர் மோடை அறிமுகப்படுத்தியுள்ளது, இது பயனர்கள் டெயில்ஸ்கேலை எந்தவொரு டாக்கர் கொள்கலனிலும் ஒருங்கிணைக்க அனுமதிக்கிறது, இது அவர்களின் டெயில்நெட் மற்றும் எஸ்.எஸ்.எச் பயன்பாடுகளை கொள்கலன்களில் சேர்க்க அனுமதிக்கிறது.",
      "டோக்கர் கொள்கலனின் கிக்ஆஃப் கட்டத்தில் வழிமுறைகளைச் செருக மோட் எஸ் 6-ஓவர்லேவைப் பயன்படுத்துகிறது, இது பயனர் அனுபவத்தையும் செயல்பாட்டையும் மேம்படுத்துகிறது.",
      "இந்த கட்டுரை டெயில்ஸ்கேலுடன் தனியார் உள்கட்டமைப்பைப் பயன்படுத்துவதன் நன்மைகள் குறித்த நுண்ணறிவுகளை வழங்குகிறது, டாக்கர் மோட்ஸ் பயன்பாட்டின் எடுத்துக்காட்டுகளை உள்ளடக்கியது, மேலும் சாத்தியமான ஆதரவு விருப்பங்கள் மற்றும் வரவிருக்கும் மேம்பாடுகளைப் பற்றி விவாதிக்கிறது."
    ],
    "commentSummary": [
      "இந்த கட்டுரை டெயில்ஸ்கேல் யுனிவர்சல் டாக்கர் மோடை வெளிச்சம் போட்டுக் காட்டுகிறது, இது பயனர்கள் டாக்கர் கொள்கலன்களில் டெயில்ஸ்கேலை இயக்க உதவுகிறது, இது எளிதான குறுக்கு-கொள்கலன் தகவல்தொடர்புக்கு உதவுகிறது, குறிப்பாக மாறுபட்ட சேவையகங்களில் அமைந்துள்ள கொள்கலன்களுக்கு.",
      "கலந்துரையாடல் நூல் நெட்வொர்க்கிங் மோட்கள் மற்றும் கொள்கலன்களைப் பயன்படுத்துவதைச் சுற்றி சுழல்கிறது, இது மோட் சாத்தியமான திறந்த-ஆதாரம் மற்றும் கொள்கலன்களில் ஒருங்கிணைப்பைக் குறிக்கிறது.",
      "வயர்கார்ட் மற்றும் சாக்ஸ் 5 பினாமிகள் உள்ளிட்ட நெட்வொர்க்கிங் கருவிகள் மற்றும் நுட்பங்களும் உரையாடலில் கொண்டு வரப்படுகின்றன, இது நெட்வொர்க்கிங் துறையில் மோட்கள் மற்றும் கொள்கலன்கள் மீது வைக்கப்படும் கணிசமான ஆர்வத்தையும் மதிப்பையும் வலியுறுத்துகிறது."
    ],
    "points": 217,
    "commentCount": 46,
    "retryCount": 0,
    "time": 1696783888
  },
  {
    "id": 37812113,
    "title": "ஜென் 5 இன் லீக்ஸ் ஸ்லைடுகள்",
    "originLink": "https://chipsandcheese.com/2023/10/08/zen-5s-leaked-slides/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37812113",
    "commentBody": "",
    "originSummary": [
      "ஒரு யூடியூபர் ஏஎம்டியின் வரவிருக்கும் ஜென் 5 கட்டமைப்பு குறித்த ஸ்லைடுகளை கசியவிட்டார், இது மேம்பட்ட கிளை கணிப்பு, அடிப்படை பிளாக் மற்றும் நினைவக துணை அமைப்பு மற்றும் பெரிய எல் 1 தரவு தேக்ககம் உள்ளிட்ட பல்வேறு மேம்பாடுகளை சுட்டிக்காட்டியது.",
      "கசிவின்படி, ஜென் 5 சிறந்த நினைவக அணுகல் செயல்திறனுக்காக மிகவும் விரிவான கேச் அளவு, டி.டி.எல்.பி திறன் மற்றும் பி.டபிள்யூ.சி அளவு ஆகியவற்றைக் கொண்டிருக்கலாம், அத்துடன் ஒரு பெரிய, மிகவும் ஒருங்கிணைந்த திட்டமிடல், விரிவாக்கப்பட்ட ஓபி இணைவு திறன்கள், பெரிய கட்டமைப்பு அளவு, ஆறு ஏ.எல்.யுக்கள் மற்றும் சிறந்த முழு எண் த்ரூபுட் ஆகியவற்றைக் கொண்டிருக்கலாம்.",
      "உற்சாகமான கசிவு இருந்தபோதிலும், இறுதி வடிவமைப்பு மாறுபடலாம் என்பதால் எச்சரிக்கையாக இருக்க கட்டுரை அறிவுறுத்துகிறது, செயல்திறன் ஆதாயங்களை மற்ற சிபியு உற்பத்தியாளர்களுடன் ஒப்பிட வேண்டியதன் அவசியத்தை வலியுறுத்துகிறது மற்றும் சிதைந்த ஆரம்ப செயல்திறன் எண்களை பெரிதும் நம்ப வேண்டாம்."
    ],
    "commentSummary": [
      "ஜென் 5 ஸ்லைடுகளின் கசிவு, எஸ்ஓசி மற்றும் ரேம் உடன் ஆப்பிளின் மூலோபாய அமலாக்கம், எக்ஸ் 86 இன் பலங்கள் மற்றும் பலவீனங்கள் மற்றும் ஹைப்பர்த்ரெடிங் செயல்திறனை எவ்வாறு பாதிக்கிறது போன்ற பல்வேறு செயலி தொடர்பான தலைப்புகளை விவாத நூல் கையாளுகிறது.",
      "இது சிபியு நினைவக அலைவரிசையை மேம்படுத்துவதில் உள்ள தடைகள் மற்றும் சமரசங்கள், ஆப்டிகல் இன்டர்கனெக்ஷன்களின் பயன்பாடு மற்றும் நினைவக அணுகல் வடிவங்களை மேம்படுத்துவதில் உள்ள சிரமங்கள் ஆகியவற்றை ஆராய்கிறது.",
      "குறிப்பாக, ஆப்பிள் ஏ 17 ப்ரோ மற்றும் ஏஎம்டி ரைசன் 9 7950 எக்ஸ் ஆகிய வெவ்வேறு செயலிகளுக்கு இடையே ஒரு ஒப்பீடு உள்ளது, இது ஆற்றல் நுகர்வு, செயல்திறன், நினைவகத்தை மேம்படுத்தும்போது முக்கியமான காரணிகள், வெவ்வேறு பயனர்களுக்கு நினைவகத்தின் முக்கியத்துவத்தைப் புரிந்துகொள்வது மற்றும் ஆன்-டை நினைவகத்தின் சாத்தியமான நன்மைகள் பற்றிய விவாதங்களின் ஆதரவுடன் உள்ளது."
    ],
    "points": 201,
    "commentCount": 143,
    "retryCount": 0,
    "time": 1696783766
  },
  {
    "id": 37815945,
    "title": "தூக்கமின்மையின் விளைவுகள்",
    "originLink": "https://belkarx.github.io/posts/finished/Impacts%20Of%20Lack%20Of%20Sleep.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37815945",
    "commentBody": "",
    "originSummary": [
      "தூக்கமின்மை வளர்சிதை மாற்றத்தை குறைத்தல், பசியை அதிகரித்தல், மனச்சோர்வு, நீரிழிவு நோய், டிமென்ஷியா மற்றும் போதைப்பொருள் துஷ்பிரயோகம் போன்ற நிலைமைகளின் அபாயத்தை அதிகரிப்பது போன்ற ஆரோக்கியத்தில் பல தீங்கு விளைவிக்கும் விளைவுகளை ஏற்படுத்துகிறது.",
      "தூக்கமின்மையின் இந்த சுகாதார விளைவுகள் எடை அதிகரிப்பு, அதிகரித்த சுகாதார செலவுகள், சிக்கலான உறவுகள் மற்றும் வரையறுக்கப்பட்ட அறிவுசார் திறன் ஆகியவற்றை ஏற்படுத்தும்.",
      "ஹார்வர்டு மற்றும் தேசிய சுகாதார நிறுவனங்கள் போன்ற மதிப்புமிக்க நிறுவனங்கள் நடத்திய ஆய்வுகள் இந்த கண்டுபிடிப்புகளை உறுதிப்படுத்துகின்றன."
    ],
    "commentSummary": [
      "விவாதத்தின் முக்கிய தலைப்புகளில் பழிவாங்கும் படுக்கை நேர ஒத்திவைப்பு கருத்து, தூக்க பழக்கத்தை மேம்படுத்துவதற்கான நடைமுறை உத்திகள் மற்றும் பெற்றோர்கள் பெரும்பாலும் எதிர்கொள்ளும் குறிப்பிட்ட தூக்கம் தொடர்பான சவால்கள் ஆகியவை அடங்கும்.",
      "இந்த உரையாடல் உடல் மற்றும் மன ஆரோக்கியத்தில் தூக்கமின்மையின் தீங்கு விளைவிக்கும் விளைவுகளையும், பெற்றோர்கள் அத்தகைய பற்றாக்குறையை நிர்வகிப்பதற்கான வழிகளையும் உள்ளடக்கியது.",
      "வாழ்க்கை முறை மாற்றங்கள், தூக்கப் பிரச்சினைகளுக்கான சாத்தியமான தீர்வுகள் மற்றும் தூக்கக் கண்காணிப்பில் ஸ்மார்ட் கடிகாரங்களின் நம்பகத்தன்மை ஆகியவற்றில் குழந்தைகளைப் பெறுவதன் தாக்கத்தையும் இந்த விவாதம் ஆராய்கிறது."
    ],
    "points": 191,
    "commentCount": 120,
    "retryCount": 0,
    "time": 1696814418
  },
  {
    "id": 37810052,
    "title": "உட்புற மரத்தை எரிப்பது பெண்களின் நுரையீரல் புற்றுநோயின் அபாயத்தை 43% அதிகரிக்கிறது",
    "originLink": "https://www.sciencedirect.com/science/article/pii/S0160412023004014",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37810052",
    "commentBody": "",
    "originSummary": [
      "ஒரு சமீபத்திய ஆய்வு அடுப்புகள் மற்றும் அடுப்புகளிலிருந்து உட்புற விறகு எரிப்பதை புகைபிடிக்காதவர்கள் உட்பட அமெரிக்க பெண்களிடையே நுரையீரல் புற்றுநோயின் பாதிப்பு 70% அதிகரித்துள்ளது என்று கூறுகிறது.",
      "வழக்கமானது மட்டுமல்லாமல், எப்போதாவது விறகு எரியும் வெப்பமூட்டும் மூலங்களைப் பயன்படுத்துவது கூட தீங்கு விளைவிக்கும் என்று சுட்டிக்காட்டப்படுகிறது, இது மர புகையில் கார்சினோஜென்கள் இருப்பதால் நுரையீரல் புற்றுநோய்க்கு பங்களிக்கிறது.",
      "குறிப்பாக, இந்த ஆய்வு ரேடான் வெளிப்பாடு மற்றும் தரமற்ற வீட்டு நிலைமைகள் போன்ற பிற காரணிகளைக் கருத்தில் கொள்ளவில்லை, இது இந்த விஷயத்தில் மேலும் ஆராய்ச்சிக்கு வாய்ப்பை வழங்குகிறது."
    ],
    "commentSummary": [
      "உட்புற விறகு எரிப்புகள், விறகு அடுப்புகள் மற்றும் அடுப்புகளைப் போலவே, பெண்களில் நுரையீரல் புற்றுநோயின் அபாயத்தை 43% அதிகரிப்பதாகவும், குறிப்பாக குழந்தைகள் மற்றும் வயதானவர்களுக்கு சுவாச பிரச்சினைகளை ஏற்படுத்துவதாகவும் கண்டறியப்பட்டுள்ளது.",
      "சுகாதார அபாயங்கள் மற்றும் சுற்றியுள்ள குடியிருப்பாளர்களுக்கு ஏற்படக்கூடிய தீங்கு காரணமாக கடுமையான விதிமுறைகள் அல்லது மரம் எரிப்பதற்கான தடை பரிசீலனையில் உள்ளன.",
      "தடைகளின் செயல்திறன், மாற்று தீர்வுகள், காற்றின் தரம் மற்றும் காலநிலை மாற்றத்தில் அவற்றின் தாக்கம் மற்றும் அத்தகைய கட்டுப்பாடுகளை அமல்படுத்துவதில் உள்ள சவால்கள் குறித்து தொடர்ந்து விவாதம் நடந்து வருகிறது, இது மேலும் விசாரணையின் அவசியத்தை எடுத்துக்காட்டுகிறது."
    ],
    "points": 185,
    "commentCount": 184,
    "retryCount": 0,
    "time": 1696769886
  },
  {
    "id": 37809834,
    "title": "வரையறை: நவீன மற்றும் வேகமான முனைய முன்மாதிரி",
    "originLink": "https://github.com/contour-terminal/contour",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37809834",
    "commentBody": "",
    "originSummary": [
      "கான்டூர் என்பது பல தளங்களில் அணுகக்கூடிய ஒரு அதிநவீன முனைய முன்மாதிரி ஆகும், இது ஜிபியு-விரைவுபடுத்தப்பட்ட பதிப்பு மற்றும் எழுத்துரு இணைப்புகள், யூனிகோட் மற்றும் கிராஃபீம் கிளஸ்டர்களுக்கான ஆதரவு போன்ற அம்சங்களைக் கொண்டுள்ளது.",
      "பயன்பாட்டில் பல்வேறு தனிப்பயனாக்க விருப்பங்கள் மற்றும் கிளிக் செய்யக்கூடிய ஹைப்பர்லிங்க்கள், முனைய பக்க இடையக பிடிப்பு மற்றும் உள்ளமைக்கப்பட்ட ஃபிரா கோட் தூண்டப்பட்ட முன்னேற்ற பட்டி போன்ற கூடுதல் அம்சங்கள் உள்ளன.",
      "வரையறை தொகுப்பு மேலாளர்கள் மூலம் பெறலாம் அல்லது மூலக் குறியீட்டிலிருந்து கட்டப்படலாம், மேலும் அப்பாச்சி உரிமம், பதிப்பு 2.0 இன் கீழ் உரிமம் பெற்றுள்ளது."
    ],
    "commentSummary": [
      "விவாதம் முனைய முன்மாதிரிகளைச் சுற்றி சுழல்கிறது, அவற்றின் செயல்திறன், அம்சங்கள் மற்றும் பொருந்தக்கூடிய தன்மையை மதிப்பிடுகிறது.",
      "மெதுவான தொடக்க நேரங்கள், வண்ண சிக்கல்கள் மற்றும் தாமதம் போன்ற கவலைகளை பயனர்கள் வெளிப்படுத்தினர், மேலும் முனையங்களில் செயற்கை நுண்ணறிவு மற்றும் குறைந்த நிலை இயந்திரம் (எல்.எல்.எம்) திறன்களின் திறனை முன்னிலைப்படுத்தினர்.",
      "கான்டோர் மற்றும் வெஸ்டெர்ம் போன்ற குறிப்பிட்ட முன்மாதிரிகளுடன் பல தனிப்பட்ட அனுபவங்கள் இருந்தபோதிலும், வெவ்வேறு விருப்பங்கள் மற்றும் தேவைகளைக் குறிக்கும் சிறந்த முன்மாதிரி குறித்து ஒருமித்த உடன்பாடு இல்லை."
    ],
    "points": 177,
    "commentCount": 166,
    "retryCount": 0,
    "time": 1696767623
  },
  {
    "id": 37812332,
    "title": "வடிகட்டப்படாத எண்ணங்களை எழுதுவது சுய அறிவை மேம்படுத்துகிறது",
    "originLink": "https://www.scientificamerican.com/article/know-yourself-better-by-writing-what-pops-into-your-head/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37812332",
    "commentBody": "",
    "originSummary": [
      "மருத்துவரும் எழுத்தாளருமான சில்கே ஹெய்ம்ஸின் கூற்றுப்படி, வடிகட்டப்படாத எண்ணங்களை தினமும் 5 முதல் 20 நிமிடங்கள் எழுதுவது ஆரோக்கியத்தை மேம்படுத்தலாம், மன அழுத்தத்தைக் குறைக்கலாம், தன்னம்பிக்கையை அதிகரிக்கும் மற்றும் கற்பனையை மேம்படுத்தலாம்.",
      "எழுதுவதற்கான நுட்பங்களில் தானியங்கி எழுத்து, அரை வாக்கியங்களை நிறைவு செய்தல் மற்றும் தடைகளை சமாளிக்க தனிப்பட்ட பெயர்களைப் பயன்படுத்துதல் ஆகியவை அடங்கும். இருப்பினும், தொடர்ந்து எழுதுவதன் மூலம் தூண்டப்படும் உணர்ச்சிகளுக்கு தொழில்முறை உதவி தேவைப்படலாம்.",
      "ஆய்வுகள் வெளிப்படையான அல்லது சிகிச்சை எழுத்துகளின் நேர்மறையான விளைவுகளை எடுத்துக்காட்டுகின்றன. முக்கிய நன்மைகள் அதிக சுயமரியாதை மற்றும் உயர்ந்த உணர்வு முதல் அதிகரித்த நினைவாற்றல் மற்றும் அறிவாற்றல் தெளிவு வரை இருக்கும், இது மன சுகாதாரத்தின் முக்கிய பகுதியாக அமைகிறது."
    ],
    "commentSummary": [
      "வடிகட்டப்படாத எழுத்து சுய அறிவின் ஒரு வழியாகவும், படைப்பாற்றலைத் தூண்டுவதாகவும், சிகிச்சை நன்மைகளை வழங்குவதாகவும், தனிநபர்கள் தங்கள் எண்ணங்களையும் உணர்வுகளையும் ஆராய அனுமதிக்கிறது.",
      "சிலர் எழுதுவதைக் கட்டுப்படுத்துவதாகக் கருதுகிறார்கள், மற்றவர்கள் அதை ரசிக்கிறார்கள் மற்றும் உணர்ச்சிகளைச் சமாளிப்பதற்கும் பதட்டத்தைத் தணிப்பதற்கும் தூக்கத்தை அதிகரிப்பதற்கும் ஒரு சிறந்த கருவியாகப் பயன்படுத்துகின்றனர்.",
      "எழுத்தின் ஒரு துணைப்பிரிவான ஜர்னலிங், சுய பிரதிபலிப்பு மற்றும் கண்டுபிடிப்புக்கான ஒரு நன்மை பயக்கும் நடைமுறையாக முன்னிலைப்படுத்தப்படுகிறது."
    ],
    "points": 170,
    "commentCount": 65,
    "retryCount": 0,
    "time": 1696784891
  }
]
