[
  {
    "id": 37810144,
    "title": "Flappy Dird: Flappy Bird MacOS Finder'da Uygulandı",
    "originLink": "https://eieio.games/nonsense/game-11-flappy-bird-finder/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37810144",
    "commentBody": "",
    "originSummary": [
      "Yazar, MacOS Finder arayüzü içinde çalışan \"Flappy Bird \"ün bir kopyası olan \"Flappy Dird\" adlı bir oyun geliştirdi.",
      "Yaratım, Finder'daki \"Son Açılış Tarihi\" alanını manipüle ederek, AppleScript'in ekranı kontrol etmesiyle, zaman zaman girişleri düşürmesine rağmen saniyede 4 kare hızında çalışarak gerçekleştirildi.",
      "Geliştirme süreci yazar tarafından tartışılmış ve beğenilmiş olup, bu yaklaşım kullanılarak başka oyunların da geliştirilebileceğini düşündürmektedir."
    ],
    "commentSummary": [
      "\"Flappy Dird\" projesi, Flappy Bird oyununun MacOS Finder içindeki bir uygulamasıdır ve oyun geliştirmeye benzersiz bir yaklaşım göstermektedir.",
      "Proje, özgünlüğü ve uygulanış biçimi nedeniyle olumlu tepkiler aldı.",
      "Bu, potansiyel benzer projeler ve AppleScript ile Finder'ın yetenekleri hakkında tartışmalara yol açtı."
    ],
    "points": 470,
    "commentCount": 51,
    "retryCount": 0,
    "time": 1696770636
  },
  {
    "id": 37813895,
    "title": "Görme engelli bilgisayar kullanıcılarına neden artık Mac tavsiye edemiyorum?",
    "originLink": "https://www.applevis.com/blog/we-deserve-better-apple-why-i-can-no-longer-recommend-mac-fellow-blind-computer-users",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37813895",
    "commentBody": "",
    "originSummary": [
      "Erişilebilirlik savunucusu David Goodwin, özellikle görme engelli kullanıcılar için Safari'deki VoiceOver özelliği ile ilgili çözülmemiş bir sorun nedeniyle Mac'lerden memnun değil.",
      "Goodwin, Apple'ın bu hatayı düzeltmek için harekete geçmemesini eleştiriyor ve Apple'ın erişilebilirlik ekibiyle daha fazla iletişim kurulması çağrısında bulunuyor.",
      "Memnuniyetsizliği dile getirmek ve sorun çözülene kadar Mac satın almaktan veya desteklemekten kaçınmak için bir grup tepkisini teşvik ediyor ve bazılarının hayal kırıklıklarını ifade ettiği ve diğerlerinin önemli bir sorun bildirmediği kullanıcılar arasında karışık deneyimlerin altını çiziyor."
    ],
    "commentSummary": [
      "Bu konuşma, farklı işletim sistemlerinde, farklı kullanıcı tercihlerine sahip görme engelli kullanıcılar için erişilebilirlik özelliklerine odaklanmaktadır.",
      "Bazı kullanıcılar Apple'ın erişilebilirlik çabalarını takdir ediyor, ancak diğerleri MacOS'taki VoiceOver özelliği ile ilgili sorunlar bildiriyor ve bu da Windows ve Linux gibi alternatiflere geçmelerine neden oluyor.",
      "Bu tartışma, erişilebilirliğin öznelliğinin altını çiziyor ve Apple'ın hataları gidermesi ve VoiceOver özelliğinin kararlılığını artırması gerektiğini vurguluyor."
    ],
    "points": 344,
    "commentCount": 70,
    "retryCount": 0,
    "time": 1696795160
  },
  {
    "id": 37812217,
    "title": "OpenIPC: IP kameranız için alternatif açık ürün yazılımı",
    "originLink": "https://github.com/OpenIPC",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37812217",
    "commentBody": "",
    "originSummary": [
      "OpenIPC, IP kamera üreticileri tarafından sağlanan güvensiz ve tescilli ürün yazılımının yerini almak üzere tasarlanmış açık kaynaklı bir ürün yazılımıdır.",
      "Kolay kurulum için önceden derlenmiş biçimde sunulan ürün yazılımı, daha fazla ince ayar ve geliştirme için kaynak dosyalara erişime de izin veriyor. Başlangıçta HiSilicon işlemcilerle uyumluydu ancak şimdi farklı üreticilerin çiplerini de içeriyor.",
      "Proje, kullanıcı katkılarını teşvik eder ve işbirliği için çeşitli depolar sunarak aktif olarak geri bildirim ve öneriler arar."
    ],
    "commentSummary": [
      "OpenIPC projesi, IP kameralar için açık ürün yazılımı sağlamakta ve Çin IP kameralarının açık ürün yazılımına geçişiyle ilgili sorunları ele almaktadır.",
      "Bununla birlikte, ürün yazılımının bazı bölümlerinin tescilli kalması ve gömülü Linux'un sınırlamaları ile ilgili endişeler dile getirilerek OpenIPC projesinde açık kaynağın tamamen benimsenmesi konusunda şüpheciliğe işaret edilmektedir.",
      "Daha fazla açık kaynak çözümüne duyulan ihtiyaç ve mevzuat ya da OpenWrt modelinin benimsenmesi gibi olası stratejilere ilişkin tartışmaların yanı sıra, çekirdek ekibin ağırlıklı olarak Rus olmasından kaynaklanan iletişim ve katkı zorlukları da bulunmaktadır."
    ],
    "points": 323,
    "commentCount": 53,
    "retryCount": 0,
    "time": 1696784222
  },
  {
    "id": 37815674,
    "title": "2023'ün sonlarında kişisel C kodlama stilim",
    "originLink": "https://nullprogram.com/blog/2023/10/08/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37815674",
    "commentBody": "",
    "originSummary": [
      "Yazar, C dili için kişisel kodlama stilini paylaşıyor, üretkenliği ve genel organizasyonu geliştirmek için yaptığı değişiklikleri vurguluyor.",
      "Kullanılan teknikler arasında ilkel tipler için kısa isimler, daha iyi anlaşılırlık için typedef kullanımı ve makrolar, parametreler, fonksiyonlar ve dizeler için özel tercihler yer almaktadır.",
      "Yazar, kodlama yaklaşımlarının herkese hitap etmeyebileceğini ve diğer projelere katkıda bulunurken tarzlarını uyarlamaya hazır olduklarını kabul etmektedir. Dize türleri, yapı geri dönüşleri, başlatma atamaları için tercihler de açıklayıcı örneklerle paylaşılmaktadır."
    ],
    "commentSummary": [
      "Özetler, büyük/küçük harf makro kullanımı, özel tip tanımı, adlandırma tutarsızlığı karışıklıkları gibi konuları kapsayarak C programlamada kodlama stili, kurallar ve en iyi uygulamalar hakkında içgörüler sağlar.",
      "Dönüş tipi olarak struct kullanımı üzerine tartışıyor, typedef'lerin artılarını ve eksilerini değerlendiriyor, const ve işaretli indekslerin potansiyel risklerini tartışıyor ve üretkenlik ile kişisel kodlama tercihlerinin dengelenmesi gerektiğini vurguluyorlar.",
      "Bu konulardaki görüş ve tercihlerin kodlama uygulayıcıları arasında farklılık gösterebileceği vurgulanmıştır."
    ],
    "points": 316,
    "commentCount": 228,
    "retryCount": 0,
    "time": 1696811403
  },
  {
    "id": 37809276,
    "title": "Debian neden bu şekilde?",
    "originLink": "https://blog.liw.fi/posts/2023/debian-reasons/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37809276",
    "commentBody": "",
    "originSummary": [
      "Debian, proje liderinin yıllık olarak seçildiği demokratik bir yönetişim yapısına sahip ücretsiz, açık kaynaklı genel amaçlı bir işletim sistemidir.",
      "Özgür yazılıma bağlılığı sürdürmeyi, bağımlılıkları kontrol etmeyi ve kendi kendine yeten bir platform sunmayı amaçlayan bir sosyal sözleşme ve yönergeleri takip eder. Bunu başarmak için paketlenmiş kütüphaneler kullanmaktan kaçınır.",
      "Debian, içerdiği önem ve güven nedeniyle paket yüklemeleri için metodik bir üyelik süreci benimser. Karışıklığı önlemek ve yansıtmayı kolaylaştırmak için, sürümleri için kod adları kullanır. Karmaşıklığı nedeniyle aşamalı olarak gelişir, kapsamlı diyalog ve fikir birliği gerektirir."
    ],
    "commentSummary": [
      "Konuşmada Debian'ın paketleme, bağımlılık yönetimi stratejileri ve paket yöneticisi kodunun kalitesi de dahil olmak üzere çeşitli yönleri ele alınıyor.",
      "Katılımcılar ayrıca systemd'nin etkilerini, Debian için destek ve finansmanı, Linux dağıtımlarının geleceğini ve Debian kullanmanın artılarını ve eksilerini tartışıyorlar.",
      "Diyalog, kullanıcı perspektiflerinin çeşitliliğini ve Debian kullanımıyla ilişkili doğal zorlukları sergileyen bir dizi görüş ve tartışmayı içermektedir."
    ],
    "points": 285,
    "commentCount": 169,
    "retryCount": 0,
    "time": 1696760519
  },
  {
    "id": 37809721,
    "title": "Homebrew kullanımdan kaldırılacak ve HashiCorp için uyarı eklenecek",
    "originLink": "https://github.com/Homebrew/homebrew-core/pull/139538",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37809721",
    "commentBody": "",
    "originSummary": [
      "Bir GitHub çekme isteği, macOS için yaygın olarak kullanılan bir paket yöneticisi olan Homebrew'daki belirli yazılım formüllerinin kullanımdan kaldırılmasını öneriyor.",
      "Kullanımdan kaldırılması düşünülen yazılım formülleri, lisanslarında yakın zamanda yapılan bir değişiklikten kaynaklanan Terraform ve Consul dahil olmak üzere HashiCorp'un araçlarıdır.",
      "Çekme isteği ayrıca Terraform için potansiyel bir yedek önermektedir: OpenTofu'yu önermekte ve lisans değişikliğinin ardından devam eden Homebrew güncelleme sürecinde ekip üyelerinden aktif olarak geri bildirim istemektedir."
    ],
    "commentSummary": [
      "Görüşmede ağırlıklı olarak HashiCorp ve ürünleri hakkındaki kullanıcı deneyimleri ve bakış açıları ele alınmakta, özellikle lisanslama, fiyatlandırma ve bazı kullanıcıların görüşme süreciyle ilgili bildirdiği sorunlara odaklanılmaktadır.",
      "HashiCorp'un VMware adaptörü ile ilgili olumsuz bir deneyim paylaşıldı ve bu da genel eleştiriye katkıda bulundu.",
      "Homebrew'un tasarım seçimleri de mercek altına alınıyor, özellikle de lisanslama korkuları nedeniyle HashiCorp'un Terraform'unu paket yöneticisine dahil etmeme kararı."
    ],
    "points": 253,
    "commentCount": 93,
    "retryCount": 0,
    "time": 1696766408
  },
  {
    "id": 37809516,
    "title": "Bir Raspberry Pi 5, iki Pi 4S'ten daha iyidir",
    "originLink": "https://hackaday.com/2023/09/28/a-raspberry-pi-5-is-better-than-two-pi-4s/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37809516",
    "commentBody": "",
    "originSummary": [
      "Raspberry Pi 5, daha yüksek hız, gelişmiş WiFi ve çift ekran desteği gibi geliştirmelerle piyasaya sürüldü. Bununla birlikte, daha fazla ısı üretmesi ve ekstra soğutma gerektirmesi konusunda endişeler var.",
      "Kullanıcılar cihazın ekran uyumluluğunu ve USB-C kullanımını tartışıyor. Verimlilik, fiyatlandırma ve bazı özelliklerin kaldırılması etrafında dönen tartışmalarla birlikte karışık yorumlar var.",
      "Topluluk, Raspberry Pi 5'in yönlendirici olarak veya yazılım tanımlı radyo senaryoları için kullanılması gibi potansiyel uygulamaları için çeşitli öneriler sunarak çok yönlülüğünü ortaya koyuyor."
    ],
    "commentSummary": [
      "Söylem ağırlıklı olarak Raspberry Pi 5'in güç ihtiyaçları, USB-C standardı, Raspberry Pi 4'e göre performansı, soğutma gereksinimi ve güncellenmiş özellikleri de dahil olmak üzere özelliklerini kapsıyor.",
      "Raspberry Pi 5'in çeşitli projeler için uygunluğu, mevcut alternatifler ve maliyet ve bellek kısıtlamaları konusundaki endişeler hakkında çeşitli görüşler vardır.",
      "Raspberry Pi, temel bilgisayar bilimlerinin öğretilmesinde ve temel bir mikro denetleyiciden daha fazlasını gerektiren görevleri yerine getirmek için kullanılan bir dizi küçük tek kartlı bilgisayardır."
    ],
    "points": 245,
    "commentCount": 185,
    "retryCount": 0,
    "time": 1696763535
  },
  {
    "id": 37814748,
    "title": "Kırk yıllık programlama",
    "originLink": "https://fabiensanglard.net/40/index.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37814748",
    "commentBody": "",
    "originSummary": [
      "Deneyimli programcı Fabien Sanglard, ergonomik iş istasyonu kurulumları için ipuçları ve uzun süreli programlamadan kaynaklanan gerginliği hafifletmek için ağrı kesici stratejiler sunuyor.",
      "Sanglard'ın önerileri arasında dikey bir fare, Magic Trackpad ve Ergodox EZ klavye kullanmak ve bilek ve kol gerginliğini sınırlamak için metin düzenleyicilerde VIM modunu etkinleştirmek yer alıyor.",
      "Ayrıca ayakta çalışma masasının avantajlarını vurgulamakta ve stres seviyelerini yönetmek için esneme egzersizleri ve meditasyon yapılmasını önermektedir."
    ],
    "commentSummary": [
      "Forum tartışması programlama ve fiziksel sağlık etrafında dönüyor ve sürekli klavye çalışmasının getirdiği zorlukları araştırıyor.",
      "Ergonominin ve tekrarlayan zorlanma yaralanmalarını önlemeye yönelik stratejilerin öneminin vurgulandığı raporda, yorumcular klavye düzenleri, egzersizler ve molalarla ilgili kendi deneyimlerini ve önerilerini paylaşıyor.",
      "Kısaca, programlama becerilerinin ve deneyimlerinin mesleki gelişim üzerindeki etkisine de değinmektedir."
    ],
    "points": 234,
    "commentCount": 126,
    "retryCount": 0,
    "time": 1696802109
  },
  {
    "id": 37817152,
    "title": "iPhone için Blackmagic Kamera",
    "originLink": "https://www.blackmagicdesign.com/products/blackmagiccamera",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37817152",
    "commentBody": "",
    "originSummary": [
      "iPhone için Blackmagic Camera uygulaması, profesyonel düzeyde kamera kontrolleri ve görüntü işleme özellikleri sunarak kullanıcıların yüksek kaliteli sinematik içerikler üretmesini sağlıyor.",
      "Uygulamanın kullanıcıları ayarları kolayca değiştirebilir, ortak çalışma için Blackmagic Cloud'a kayıt yapabilir ve odak yardımı ve görüntü sabitleme gibi özel özellikleri kullanabilir.",
      "Renk düzenleme ve tonlama için DaVinci Resolve ile entegre olan uygulama, iPhone kullanıcılarına gelişmiş kontrol ve düzenleme işlevleri sunuyor."
    ],
    "commentSummary": [
      "Blackmagic, iPhone'lar için film öğrencileri için değerli olan profesyonel kalitede, manuel kontrol özellikleri sağlayan ücretsiz bir kamera uygulaması başlattı.",
      "Sinematik bir etki için pozlama ve kare hızı gibi ayarların manuel olarak ayarlanmasına izin veren uygulama, Davinci Resolve ile de entegre olarak olumlu kullanıcı yorumlarına yol açıyor.",
      "Diyaloglar şu anda profesyonel kameralar ile akıllı telefonların yeteneklerinin karşılaştırılması etrafında şekilleniyor ve akıllı telefonların film çekimi için sağladığı kolaylık ve ekonomik faydalar vurgulanıyor."
    ],
    "points": 221,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1696829257
  },
  {
    "id": 37812142,
    "title": "Tailscale Evrensel Docker Modu",
    "originLink": "https://tailscale.dev/blog/docker-mod-tailscale",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37812142",
    "commentBody": "",
    "originSummary": [
      "Tailscale, kullanıcıların Tailscale'i herhangi bir Docker konteynerine entegre etmelerini sağlayan, tailnet'lerine uygulama eklenmesine ve konteynerlere SSH eklenmesine izin veren yeni bir Docker modu başlattı.",
      "Mod, bir Docker konteynerinin başlangıç aşamasında talimatlar eklemek için s6-overlay kullanarak kullanıcı deneyimini ve işlevselliğini geliştiriyor.",
      "Makale, Tailscale ile özel altyapı kullanmanın avantajları hakkında bilgi vermekte, Docker modlarının kullanım örneklerini içermekte ve olası destek seçeneklerini ve gelecekteki geliştirmeleri tartışmaktadır."
    ],
    "commentSummary": [
      "Makale, kullanıcıların Tailscale'i Docker konteynerleri üzerinde çalıştırmasını kolaylaştıran ve özellikle farklı sunucularda bulunan konteynerler için konteynerler arası iletişimi kolaylaştıran Tailscale Evrensel Docker Modu'na dikkat çekiyor.",
      "Tartışma başlığı, modların ve konteynerlerin ağ oluşturmada kullanımı etrafında dönüyor ve modun potansiyel açık kaynak kullanımına ve konteynerlere entegrasyonuna işaret ediyor.",
      "Wireguard ve SOCKS5 proxy'leri gibi ağ araçları ve teknikleri de sohbette gündeme getirilerek ağ alanında modlara ve konteynerlere gösterilen büyük ilgi ve değer vurgulanıyor."
    ],
    "points": 217,
    "commentCount": 46,
    "retryCount": 0,
    "time": 1696783888
  },
  {
    "id": 37812113,
    "title": "Zen 5'in Sızdırılan Slaytları",
    "originLink": "https://chipsandcheese.com/2023/10/08/zen-5s-leaked-slides/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37812113",
    "commentBody": "",
    "originSummary": [
      "Bir YouTuber, AMD'nin yaklaşmakta olan Zen 5 mimarisine ilişkin slaytları sızdırarak, gelişmiş dallanma tahmini, temel blok getirme ve bellek alt sistemi ve daha büyük bir L1 veri önbelleği dahil olmak üzere çeşitli iyileştirmelere işaret etti.",
      "Sızıntıya göre Zen 5, daha iyi bellek erişim performansı için daha kapsamlı bir önbellek boyutu, DTLB kapasitesi ve PWC boyutunun yanı sıra daha büyük, daha birleşik bir programlayıcı, genişletilmiş op füzyon yetenekleri, daha büyük bir yapı boyutu, altı ALU ve daha iyi tamsayı verimi sunabilir.",
      "Heyecan verici sızıntıya rağmen makalede, nihai tasarım değişebileceğinden dikkatli olunması tavsiye ediliyor, performans kazanımlarının diğer CPU üreticileriyle karşılaştırılması ve potansiyel olarak çarpıtılmış erken performans rakamlarına büyük ölçüde güvenilmemesi gerektiği vurgulanıyor."
    ],
    "commentSummary": [
      "Tartışma başlığı, Zen 5 slaytlarının sızması, Apple'ın SOC ve RAM ile stratejik uygulaması, x86'nın güçlü ve zayıf yönleri ve hyperthreading'in performansı nasıl etkilediği gibi işlemciyle ilgili çeşitli konuları ele alıyor.",
      "Ayrıca, CPU bellek bant genişliğinin artırılması, optik ara bağlantıların uygulanması ve bellek erişim modellerinin optimize edilmesindeki zorluklarla ilgili kısıtlamaları ve uzlaşmaları da incelemektedir.",
      "Özellikle Apple A17 Pro ve AMD Ryzen 9 7950X gibi farklı işlemciler arasında bir karşılaştırma yapılıyor ve güç tüketimi, performans, bellek yükseltme sırasında kritik faktörler, farklı kullanıcılar için belleğin öneminin anlaşılması ve kalıp üstü belleğin potansiyel avantajları üzerine tartışmalarla destekleniyor."
    ],
    "points": 201,
    "commentCount": 143,
    "retryCount": 0,
    "time": 1696783766
  },
  {
    "id": 37815945,
    "title": "Uyku Eksikliğinin Etkileri",
    "originLink": "https://belkarx.github.io/posts/finished/Impacts%20Of%20Lack%20Of%20Sleep.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37815945",
    "commentBody": "",
    "originSummary": [
      "Uykusuzluğun sağlık üzerinde metabolizmayı yavaşlatma, iştahı artırma, depresyon, diyabet, bunama gibi rahatsızlıkların riskini artırma ve madde bağımlılığını artırma gibi çok sayıda zararlı etkisi vardır.",
      "Uyku yoksunluğunun bu sağlık sonuçları kilo alımı, artan sağlık masrafları, gergin ilişkiler ve sınırlandırılmış entelektüel potansiyel ile sonuçlanabilir.",
      "Harvard ve Ulusal Sağlık Enstitüleri gibi saygın kurumlar tarafından yürütülen çalışmalar bu bulguları doğrulamaktadır."
    ],
    "commentSummary": [
      "Tartışmanın ana konuları arasında yatma zamanı ertelemesinin intikamı kavramı, uyku alışkanlıklarını geliştirmeye yönelik pratik stratejiler ve ebeveynlerin sıklıkla karşılaştığı uykuyla ilgili belirli zorluklar yer almaktadır.",
      "Diyalog, uyku yoksunluğunun hem fiziksel hem de zihinsel sağlık üzerindeki zararlı etkilerinin yanı sıra ebeveynlerin bu yoksunluğu nasıl yönetebileceklerini de kapsamaktadır.",
      "Tartışmada ayrıca çocuk sahibi olmanın yaşam tarzı düzenlemeleri üzerindeki etkisi, uyku sorunları için potansiyel çözümler ve uyku takibinde akıllı saatlerin güvenilirliği de ele alınıyor."
    ],
    "points": 191,
    "commentCount": 120,
    "retryCount": 0,
    "time": 1696814418
  },
  {
    "id": 37810052,
    "title": "Kapalı alanda odun yakmak kadınların akciğer kanseri riskini %43 artırıyor",
    "originLink": "https://www.sciencedirect.com/science/article/pii/S0160412023004014",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37810052",
    "commentBody": "",
    "originSummary": [
      "Yakın zamanda yapılan bir çalışma, soba ve şöminelerde odun yakılmasını, sigara içmeyenler de dahil olmak üzere ABD'li kadınlar arasında akciğer kanseri prevalansında %70'lik bir artışla ilişkilendirmektedir.",
      "Odun yakan ısıtma kaynaklarının sadece düzenli olarak değil, ara sıra kullanılmasının bile potansiyel olarak zararlı olduğu ve odun dumanında kanserojen maddelerin bulunması nedeniyle akciğer kanserine katkıda bulunduğu belirtilmektedir.",
      "Bu çalışmada radona maruz kalma ve standart altı konut koşulları gibi diğer faktörlerin dikkate alınmamış olması, konuyla ilgili daha fazla araştırma yapılması için bir alan sunmaktadır."
    ],
    "commentSummary": [
      "Odun sobaları ve şöminelerde olduğu gibi iç mekanlarda odun yakmanın kadınlarda akciğer kanseri riskini %43 oranında artırdığı ve özellikle çocuklarda ve yaşlılarda solunum sorunlarına neden olduğu keşfedilmiştir.",
      "Sağlık riskleri ve çevre sakinlerine olası zararları nedeniyle daha katı düzenlemeler veya odun yakmanın yasaklanması düşünülmektedir.",
      "Yasakların etkinliği, alternatif çözümler, hava kalitesi ve iklim değişikliği üzerindeki etkileri ve bu tür kısıtlamaları uygulamanın zorlukları hakkında devam eden tartışmalar, daha fazla araştırmaya duyulan ihtiyacı vurgulamaktadır."
    ],
    "points": 185,
    "commentCount": 184,
    "retryCount": 0,
    "time": 1696769886
  },
  {
    "id": 37809834,
    "title": "Kontur: Modern ve hızlı terminal emülatörü",
    "originLink": "https://github.com/contour-terminal/contour",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37809834",
    "commentBody": "",
    "originSummary": [
      "Contour, GPU hızlandırmalı işleme ve yazı tipi bitişik harfleri, Unicode ve grapheme kümeleri desteği gibi özelliklere sahip, çok sayıda platformda erişilebilen son teknoloji bir terminal emülatörüdür.",
      "Uygulama, çeşitli özelleştirme seçeneklerinin yanı sıra tıklanabilir köprüler, terminal sayfası arabelleği yakalama ve Fira Code'dan esinlenen yerleşik bir ilerleme çubuğu gibi ek özelliklere sahiptir.",
      "Contour, paket yöneticileri aracılığıyla elde edilebilir veya kaynak koddan oluşturulabilir ve Apache Lisansı, Sürüm 2.0 altında lisanslanmıştır."
    ],
    "commentSummary": [
      "Tartışma terminal emülatörleri etrafında dönüyor, performanslarını, özelliklerini ve uyumluluklarını değerlendiriyor.",
      "Kullanıcılar yavaş başlatma süreleri, renk sorunları ve gecikme gibi endişelerini dile getirerek terminallerdeki yapay zeka ve düşük seviyeli makine (LLM) yeteneklerinin potansiyelini vurguladılar.",
      "Contour ve WezTerm gibi belirli emülatörlerle çok sayıda bireysel deneyime rağmen, farklı tercihleri ve gereksinimleri gösteren en iyi emülatör konusunda fikir birliği yoktur."
    ],
    "points": 177,
    "commentCount": 166,
    "retryCount": 0,
    "time": 1696767623
  },
  {
    "id": 37812332,
    "title": "Filtrelenmemiş düşünceleri yazmak kendini tanımayı geliştirir",
    "originLink": "https://www.scientificamerican.com/article/know-yourself-better-by-writing-what-pops-into-your-head/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37812332",
    "commentBody": "",
    "originSummary": [
      "Doktor ve yazar Silke Heimes'a göre, her gün 5 ila 20 dakika boyunca filtrelenmemiş düşünceleri yazmak sağlığı iyileştirebilir, stresi azaltabilir, özgüveni artırabilir ve hayal gücünü geliştirebilir.",
      "Yazma teknikleri arasında otomatik yazma, yarım cümleleri tamamlama ve engellemelerin üstesinden gelmek için kişisel isimlerin kullanılması yer alır. Ancak, ısrarcı olunması halinde yazma yoluyla tetiklenen duygular profesyonel yardım gerektirebilir.",
      "Araştırmalar, ifade edici veya terapötik yazmanın olumlu etkilerini vurgulamaktadır. Temel faydalar, daha yüksek öz saygı ve artan algıdan, artan farkındalık ve bilişsel netliğe kadar uzanmakta ve bu da onu zihinsel hijyenin hayati bir parçası haline getirmektedir."
    ],
    "commentSummary": [
      "Filtrelenmemiş yazı, kendini tanımanın bir yolu olarak hizmet eder, yaratıcılığı teşvik eder, terapötik faydalar sağlar ve bireylerin düşüncelerini ve algılarını derinlemesine incelemelerine olanak tanır.",
      "Bazıları yazmayı kısıtlayıcı bulurken, diğerleri bundan zevk alır ve bunu duygularla başa çıkmak, kaygıyı azaltmak ve uykuyu artırmak için etkili bir araç olarak kullanır.",
      "Yazmanın bir alt kümesi olan günlük tutma, kendini yansıtma ve keşfetme için faydalı bir uygulama olarak vurgulanmaktadır."
    ],
    "points": 170,
    "commentCount": 65,
    "retryCount": 0,
    "time": 1696784891
  }
]
