[
  {
    "title": "Temu: The Popular Online Shopping App Raises Concerns about Data Security",
    "originLink": "https://www.wsbradio.com/news/local/online-shopping-app-temu-offers-deals-high-99-off-is-it-safe/NW4QRRW2OJBZZDBKOKOSY3ACXI/",
    "originBody": "ATLANTA — A new online shopping app is taking the digital marketplace by storm. Temu is currently the number one apps in the Apple and Google Play stores. It boasts major discounts of up to 99% off on some items. Temu is technically based in Boston, but is actually owned by Pinduoduo, a Chinese-base e-commerce site. A brief by a U.S. government commission expresses concerns that Pinduoduo has had issues with data security and malware in the last year. WSB-TV’s Justin Gray contributed to this story. ©2023 Cox Media Group",
    "originSummary": [
      "Temu, a new online shopping app owned by Chinese e-commerce site Pinduoduo, has become the top app in both the Apple and Google Play stores.",
      "There have been concerns raised about Pinduoduo's data security and malware issues in the past year."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699707955517
  },
  {
    "title": "Retailers Embrace Discounts and Livestream Commerce to Woo Singles Day Shoppers",
    "originLink": "https://www.paymentsjournal.com/retailers-prioritize-discounts-and-livestream-commerce-to-attract-budget-conscious-singles-day-shoppers/",
    "originBody": "Retailers Prioritize Steep Discounts and Livestream Commerce to Attract Singles Day Shoppers November 10, 2023",
    "originSummary": [
      "Retailers are leveraging Singles Day, which occurs on November 11 annually, to attract shoppers through substantial discounts and livestream commerce.",
      "Livestream commerce is becoming an increasingly popular marketing strategy for retailers to engage with customers and showcase products in real-time.",
      "Singles Day is a significant shopping event in which retailers offer special promotions and discounts to encourage consumer spending."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699707955517
  },
  {
    "title": "E-commerce Giants Cut Prices on 'Singles Day' Amid Chinese Economic Slowdown",
    "originLink": "https://www.btimesonline.com/articles/161909/20231110/e-commerce-giants-slash-prices-amidst-chinese-economic-slowdown.htm",
    "originBody": "Share Tweet China Updated November 10, 2023 11:06 p.m. ET E-Commerce Giants Slash Prices on 'Singles Day' Amidst Chinese Economic Slowdown Chris Liu FILE PHOTO: The Pinduoduo logo is seen in this illustration photo taken July 17, 2018. (Photo: REUTERS/Thomas White/Illustration/File Photo GLOBAL BUSINESS WEEK AHEAD) Amidst China's economic headwinds, the annual \"Singles Day\" shopping festival has become a battleground for e-commerce giants, reflecting deeper issues of consumer confidence and spending habits in the world's second-largest economy. Originally a 24-hour event on November 11, Singles Day has now evolved into weeks of promotions, both online and in physical stores, making it the globe's largest shopping festival. This year, the event is under intense scrutiny as an indicator of consumer sentiment in China, where the economy faces deflation risks and aims to boost household demand to avoid stagnant growth. Major e-commerce platforms like Alibaba's Taobao and Tmall, PDD Holdings' Pinduoduo, and JD.com are offering significant discounts and cashback deals to entice customers. For instance, Alibaba has pledged to offer 80 million products at their lowest prices this year, while competitors have indicated billions in cashback deals. Despite these efforts, market research and consumer surveys paint a picture of cautious spending. According to Bain and Company, 77% of surveyed consumers plan to cut or maintain their spending levels compared to last year. The survey revealed a growing trend among consumers to seek value, with many opting for cheaper brands or private label products. Similarly, data provider Syntun estimated a 7.1% decrease in sales by e-commerce platforms in the early days of the festival. The ongoing challenges in China's property sector, high youth unemployment rates, and falling wages in certain industries have led consumers to adopt a thrifty approach. This cautious consumer behavior is in stark contrast to the optimism expressed by some analysts like Jacob Cooke of WPIC Marketing+Technologies, who predicts a total sales growth of 14%-18%, suggesting a stabilization in Chinese growth. However, the reality remains that consumer prices are dropping, signaling a potential economic slowdown. As the Singles Day event continues to unfold, it remains to be seen whether these massive sales and promotions can truly invigorate the Chinese consumer market or if they simply reflect the broader economic challenges facing the nation. In the face of these economic uncertainties, Chinese consumers like Tan Jiapeng, a 35-year-old office worker in Beijing, are becoming increasingly cautious about their spending. This sentiment is widespread among Chinese shoppers, who are reining in their expenditures, particularly on nonessential items. The evolving nature of the Singles Day festival, coupled with the current economic context, suggests that while it remains a significant event on the retail calendar, its impact and significance are shifting in response to broader economic trends and consumer behaviors. As China grapples with these challenges, the world watches closely, understanding that the nation's consumer market is a critical component of global economic health and stability. © 2023 Business Times All rights reserved. Do not reproduce without permission. More From BusinessTImes Prince Harry Demands King Charles, Prince William 'Apologize to Meghan Profusely', Threatens to Skip King's Milestone Birthday: Report November 11, 2023 by E-Commerce Giants Slash Prices on 'Singles Day' Amidst Chinese Economic Slowdown November 10, 2023 by Chris Liu Xi Jinping and Biden Convene in San Francisco for Landmark Summit November 10, 2023 by Larry Lee King Charles III Celebrates 75th Birthday with a Clear Mandate: No Prince Harry and Meghan Markle Talk November 10, 2023 by Betty Tzeng Meghan Markle and Prince Harry Confront Hollywood's Mockery Amid Image Crisis November 10, 2023 by Betty Tzeng Royal Biographer Criticizes Meghan Markle and Prince Harry Amidst Birthday Celebration Controversy November 09, 2023 by Betty Tzeng Loading... Most Popular Articles G-Dragon's Regular Hair Removal, 'Infinite Challenge' from 10 Years Ago as Evidence: 'Nothing is Impossible for MuDo' Drugs, Divorce, and Death: The Continued 'Curse' of November in the K-pop Industry FBI's Dramatic Seizure of NYC Mayor Eric Adams' Devices Amidst Political Vendetta Suspicions BTS V Ranked as the Most Memorable Idol of the 3rd Quarter G-Dragon Booked on Drug Charges: 'Female Manager’s Testimony' Revealed OUR NEWSLETTERS The best of BusinessTimes news delivered right into your email box absolutely free. All the news you need to start your day. Back to Top",
    "originSummary": [
      "E-commerce giants in China are reducing prices during the \"Singles Day\" shopping festival amid the country's economic slowdown.",
      "Market research and consumer surveys indicate cautious spending habits and a preference for cheaper brands among consumers.",
      "The cautious behavior reflects broader economic challenges in China, with dropping consumer prices suggesting a potential economic slowdown."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699707955517
  }
]
