[
  {
    "id": 40298927,
    "title": "AlphaFold 3 přináší revoluci v predikci molekulární struktury",
    "originLink": "https://blog.google/technology/ai/google-deepmind-isomorphic-alphafold-3-ai-model/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40298927",
    "commentBody": "",
    "originSummary": [
      "Umělá inteligence AlphaFold 3, která vznikla ve spolupráci společností Google DeepMind a Isomorphic Labs, přesně předpovídá strukturu a chování proteinů, DNA, RNA a dalších molekul a usiluje o revoluci v biologii a vývoji léčiv.",
      "Uživatelé mohou volně přistupovat k AlphaFold 3 prostřednictvím serveru AlphaFold Server, což umožňuje spolupráci na iniciativách týkajících se návrhu léčiv a využívá jeho lepších prediktivních schopností ve srovnání s předchozím modelem AlphaFold 2.",
      "Odpovědným sdílením výkonu AlphaFold 3 mohou výzkumní pracovníci po celém světě urychlit své objevy a pokrok v biologii a medicíně."
    ],
    "commentSummary": [
      "Debata se zaměřuje na pokroky v predikci struktury proteinů, zejména na modely AlphaFold 3 a RoseTTAFold-All-Atom.",
      "Diskutuje se o obavách týkajících se přesnosti modelů, technologií umožňujících bioterorismus a rovnováhy mezi předpovědní silou a vědeckými zásadami.",
      "Rozhovor se zabývá také rolemi modelů umělé inteligence, výzvami v oblasti lidského porozumění, důsledky komercializace, významem financování ve výzkumu a výhodami a nevýhodami modelů strojového učení ve výzkumu."
    ],
    "points": 933,
    "commentCount": 405,
    "retryCount": 0,
    "time": 1715180830
  },
  {
    "id": 40300454,
    "title": "Poznatky o vývoji z knihy xkcd \"Machine\"",
    "originLink": "https://chromakode.com/post/xkcd-machine/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40300454",
    "commentBody": "",
    "originSummary": [
      "Chromakode se zabývá tvorbou každoročního projektu xkcd \"Machine\", v němž čtenáři spolupracují na stavbě masivního rube goldbergova stroje inspirovaného virálním GIFem.",
      "Projekt zahrnoval implementaci omezení kreativity, použití generátoru map pro hádanky a optimalizaci výkonu pomocí fyzikálního enginu Rapier v jazyce Rust.",
      "Výzvy zahrnovaly výběr designu, správu podání s pozitivními výsledky uživatelské zkušenosti a výzvu k dalším příspěvkům k designu a nápadům na hacking pro globální simulaci stroje."
    ],
    "commentSummary": [
      "Uživatelé sdílejí své zkušenosti s projektem xkcd \"Machine\", vytvářejí stroje s barevnými kuličkami a jedinečnými funkcemi, přičemž někteří si užívají interaktivní prvky, zatímco jiní se potýkají s problémy s herní mechanikou.",
      "Článek se zabývá procesem spolupráce při tvorbě komiksů XKCD, obdivem k Randallově kreativitě, technickými detaily stroje a myšlenkou inkluzivního herního designu zahrnujícího omezení a iluze.",
      "Omezení ve hrách, jako je Space Engineers, zvyšují výkon fyzikálního enginu, ale mohou omezovat některé aspekty hratelnosti, což poukazuje na rovnováhu mezi optimalizací výkonu a dynamikou hry."
    ],
    "points": 549,
    "commentCount": 70,
    "retryCount": 0,
    "time": 1715188157
  },
  {
    "id": 40297748,
    "title": "Námořní kolo: Podvodní posilovač rychlosti poháněný pedály",
    "originLink": "https://newatlas.com/marine/seabike-swimming-propeller/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40297748",
    "commentBody": "",
    "originSummary": [
      "Francouzská společnost Seabike vytvořila podvodní zařízení poháněné pedály s názvem Seabike, které pomocí vrtule poháněné klikou pohání plavce mimořádnou rychlostí.",
      "Uživatelé mohou zařízení ovládat rukama nebo nohama, což představuje zábavnou a efektivní metodu navigace ve vodě, vhodnou do bazénů i na volnou vodu.",
      "Seabike stojí od 290 EUR (310 USD) a nabízí tak cenově dostupnou variantu pro zájemce o tento inovativní způsob průzkumu podmořského prostředí."
    ],
    "commentSummary": [
      "Francouzská společnost Seabike vytvořila podvodní kolo, které plavce pohání pozoruhodnou rychlostí, což vedlo k debatám o jeho účinnosti a dopadu na mořské živočichy.",
      "Diskuse se týkají plavidel poháněných lidskou silou, podvodní dopravy, sportovních technologií a efektivity plaveckého vybavení a vyvolávají různé názory na praktičnost a výhody těchto inovativních pohonných zařízení.",
      "U těchto nejmodernějších technologií založených na vodě je třeba brát v úvahu rovnováhu, zapojení svalů a výkonnost."
    ],
    "points": 478,
    "commentCount": 247,
    "retryCount": 0,
    "time": 1715174002
  },
  {
    "id": 40300023,
    "title": "Vzpomínka na ikonického producenta Steva Albiniho: Průkopník indie rocku",
    "originLink": "https://pitchfork.com/news/steve-albini-storied-producer-and-icon-of-the-rock-underground-dies-at-61/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40300023",
    "commentBody": "",
    "originSummary": [
      "Známý producent a ikona indie rocku Steve Albini tragicky zemřel ve věku 61 let na infarkt.",
      "Albini, který se proslavil spoluprací s kapelami jako Nirvana, Pixies a PJ Harvey, byl také členem skupin Shellac a Big Black, známý svým zásadovým postojem proti vykořisťovatelským praktikám v hudebním průmyslu.",
      "Jeho odkaz v oblasti alternativního rocku a osobitých nahrávacích metod zanechává trvalý vliv na hudební průmysl a mnozí na něj vzpomínají."
    ],
    "commentSummary": [
      "Zemřel velmi vlivný hudebník a producent Steve Albini, známý svou spoluprací s kapelami Big Black, Pixies a Nirvana.",
      "Fanoušci si Albiniho pamatují díky jeho jedinečnému producentskému stylu, syrovému zvuku a neurvalé osobnosti, která v 80. a 90. letech formovala alternativní rock.",
      "Diskuse se zaměřuje na Albiniho vliv na hudební průmysl, kontroverzní názory a jeho odkaz, zatímco fanoušci truchlí nad jeho smrtí a oslavují jeho přínos."
    ],
    "points": 459,
    "commentCount": 149,
    "retryCount": 0,
    "time": 1715186003
  },
  {
    "id": 40302201,
    "title": "Konzistence velkých jazykových modelů: Zrychlení odvozování 3,5x",
    "originLink": "https://hao-ai-lab.github.io/blogs/cllm/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40302201",
    "commentBody": "",
    "originSummary": [
      "Modely konzistentních velkých jazyků (CLLM) jsou novou rodinou paralelních dekodérů využívajících Jacobiho dekódování ke zvýšení rychlosti generování bez dodatečných nákladů na paměť.",
      "CLLM dokáže dekódovat více tokenů současně, čímž překonává autoregresivní metody, má rychlejší konvergenci a efektivní predikci více slov pomocí Jacobiho trajektorií.",
      "\"CLLMs: a kol., dostupný na arXiv, představuje metodu pro trénování CLLMs pro různé úlohy, která nabízí významné zvýšení rychlosti a přizpůsobivosti, aniž by vyžadovala změny v původní architektuře modelu."
    ],
    "commentSummary": [
      "Převod jazykového modelu (LLM) na paralelní dekodéry zvyšuje rychlost odvozování, připomíná kreslení tříd a zdůrazňuje konzistentní LLM.",
      "Příspěvek se zabývá metodami trénování, využitím datové sady, přístupy k dekódování a vlivem ztráty konzistence a ztráty AR.",
      "Zabývá se také řešeními RAG, spekulativním dekódováním a simultánní predikcí tokenů, zkoumá deterministický aspekt LLM a hardwarová vylepšení pro neuronové sítě, osvětluje tvorbu vět a osobní sklony při zpracování přirozeného jazyka."
    ],
    "points": 354,
    "commentCount": 70,
    "retryCount": 0,
    "time": 1715198107
  },
  {
    "id": 40300126,
    "title": "Představení nelineárního uživatelského rozhraní pro ChatGPT",
    "originLink": "https://www.grafychat.com",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40300126",
    "commentBody": "",
    "originSummary": [
      "Aplikace byla vyvinuta z důvodu frustrace z množství modelů umělé inteligence a klade důraz na vizuální přístup pro lepší kontrolu a předvídatelnost.",
      "Nabízí funkce, jako je knihovna výzev, hlasové zadávání, vyhledávání textu a vyprávění, je lokální, bezplatná a umožňuje uživatelům používat jejich klíče API.",
      "Podporuje se zpětná vazba od uživatelů, což z ní činí uživatelsky přívětivou a komunitou řízenou platformu pro používání modelů AI."
    ],
    "commentSummary": [
      "Uživatelé vyjadřují frustraci z rostoucí složitosti modelů a funkcí umělé inteligence v aplikaci ChatGPT, což vedlo k vývoji nelineárního uživatelského rozhraní, které nabízí větší volnost a kontrolu.",
      "Diskuse se točí kolem hledání softwaru podobného Gingko, integrace AI, cen, generativní AI a významu otevřených metodik budování.",
      "Pozitivní zpětná vazba a návrhy na vylepšení se týkají nástrojů pro převod textu na řeč, organizaci chatu a zadávání dat, přičemž uživatelé oceňují nelineární uživatelské rozhraní, absenci předplatného a možnost vlastního hostování v různých softwarových řešeních."
    ],
    "points": 342,
    "commentCount": 98,
    "retryCount": 0,
    "time": 1715186472
  },
  {
    "id": 40304453,
    "title": "Klamný triumf: Jak jsem zachránil neúspěšný projekt",
    "originLink": "https://GrumpyOldDev.com/post/the-one-where-i-lie-to-the-cto/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40304453",
    "commentBody": "",
    "originSummary": [
      "Grumpy Old Dev se zamýšlí nad svou minulostí a přiznává, že podvedl technického ředitele ohledně neúspěšného projektu s dodavatelem, ale později s malým týmem vytvořil úspěšný náhradní systém.",
      "Přestože jim hrozilo vyhoření, pracovali o prázdninách v utajení, lhali o pokroku technickému řediteli a zároveň dali týmu odpočinout, což vedlo k vítěznému výsledku projektu.",
      "Tato zkušenost vedla k pocitu úspěchu, že se podařilo překonat výzvy a úspěšně realizovat projekt."
    ],
    "commentSummary": [
      "Diskuze na fóru se zabývá řadou témat včetně přepracovanosti, vedení, zdravé kultury a etiky v technologiích.",
      "Účastníci zdůrazňují význam transparentnosti, komunikace, rozhodování a rovnováhy mezi pracovním a soukromým životem pro úspěšné pracovní prostředí.",
      "Rozhovor se týká také výzev, rizik a přínosů práce v oblasti technologií a obhajuje zdravější přístup k práci a kariérnímu růstu."
    ],
    "points": 294,
    "commentCount": 206,
    "retryCount": 0,
    "time": 1715218767
  },
  {
    "id": 40302792,
    "title": "Uživatelé rozladěni kvůli odstraňování příspěvků po integraci OpenAI-Stack Overflow",
    "originLink": "https://build5nines.com/stack-overflow-upset-over-users-deleting-answers-after-openai-partnership/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40302792",
    "commentBody": "",
    "originSummary": [
      "Společnost Stack Overflow navázala spolupráci s OpenAI, aby začlenila umělou inteligenci do zkušeností vývojářů, což vyvolalo kontroverzi ohledně používání obsahu bez řádného uvedení autorství.",
      "Uživatelé, kteří na protest smazali nebo znehodnotili svůj obsah, čelili pozastavení účtu kvůli narušování platformy.",
      "Cílem spolupráce je zlepšit uživatelské zkušenosti a prosazovat etické aplikace umělé inteligence."
    ],
    "commentSummary": [
      "Uživatelé na platformách, jako je Stack Overflow, diskutují o licencování, moderování a hodnotě uživatelského obsahu v souvislosti s modely AI, jako je ChatGPT.",
      "Diskutuje se o legálnosti a etice změn licencí, o zisku z obsahu vytvářeného uživateli a o kvalitě informací na platformách.",
      "Obavy se týkají i dopadu umělé inteligence na pracovní příležitosti, monopolizace internetu a snižování kvality a dostupnosti platforem, jako jsou Quora a Stack Overflow."
    ],
    "points": 262,
    "commentCount": 273,
    "retryCount": 0,
    "time": 1715203013
  },
  {
    "id": 40296926,
    "title": "Oživení hry ZX Spectrum: Kontrabant 2 na FM rádiu",
    "originLink": "https://www.racunalniski-muzej.si/en/40-years-later-a-game-for-the-zx-spectrum-will-be-once-again-broadcast-over-fm-radio/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40296926",
    "commentBody": "",
    "originSummary": [
      "Rádio Študent ve Slovinsku vysílalo hry Sinclair ZX Spectrum na rozhlasových vlnách, které bylo možné přehrávat nahráváním zvuku na kazety, aby bylo možné hry načíst.",
      "U příležitosti 55. výročí založení rozhlasové stanice budou dva členové redakce Software v Muzeu počítačů diskutovat o tvorbě klasických her, jako jsou \"Kontrabant\" a \"Kontrabant 2\".",
      "Ve 21:30 si účastníci mohou vychutnat vysílání hry \"Kontrabant 2\" na Rádiu Študent a vyzkoušet si hru na Spectru ZX přímo na akci nebo online."
    ],
    "commentSummary": [
      "Článek se zabývá nostalgií po počítačových systémech z 80. let, jako byly ZX Spectrum a ZX81 v Jugoslávii, a popisuje ukládání dat na kazetové pásky, přenos dat, problémy s ochranou proti kopírování a vývoj paměťových médií.",
      "Pojednává o používání magnetofonových kazet k nahrávání her, kódování dat jako zvuku a používání magnetofonových kazet k ukládání dat v rané éře výpočetní techniky.",
      "Jsou sdíleny informace o standardech, jako je Kansas City Standard (KCS) a CUTS pro sdílení a vysílání dat prostřednictvím rádia."
    ],
    "points": 259,
    "commentCount": 88,
    "retryCount": 0,
    "time": 1715168946
  },
  {
    "id": 40297946,
    "title": "TimesFM: Základní model časových řad společnosti Google pro předpovídání",
    "originLink": "https://github.com/google-research/timesfm",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40297946",
    "commentBody": "",
    "originSummary": [
      "TimesFM (Time Series Foundation Model) je předtrénovaný model společnosti Google Research pro předpovídání časových řad, který se zaměřuje na bodové předpovědi bez pravděpodobnostních předpovědí.",
      "Může zpracovávat až 512 časových bodů a různých horizontů s možností udávat frekvenci, přičemž pro pohodlí uživatelů poskytuje veřejné kontrolní body na Hugging Face.",
      "Uživatelé mohou využívat rozhraní API TimesFM k vytváření předpovědí ze vstupních polí nebo datových rámců pandas a upravovat parametr frekvence podle svých individuálních požadavků, jak je podrobně popsáno v poskytnuté dokumentaci."
    ],
    "commentSummary": [
      "Společnost TimesFM pořádá diskusi o využití strojového učení pro předpovídání časových řad, která se zabývá jeho výzvami a potenciálem v různých odvětvích.",
      "Účastníci diskutují o účinnosti základních modelů časových řad, významu datových vzorů a využití prediktivních modelů v hrách, mimo jiné o detekci anomálií a předtrénování modelů.",
      "Rozhovor zdůrazňuje výhody a nevýhody modelů časových řad v různých scénářích a zdůrazňuje význam rozpoznávání vzorů a přesnosti předpovědí."
    ],
    "points": 255,
    "commentCount": 88,
    "retryCount": 0,
    "time": 1715175274
  },
  {
    "id": 40296744,
    "title": "Netradiční výhra tisícovky Press Your Luck Thousandaire",
    "originLink": "https://www.damninteresting.com/who-wants-to-be-a-thousandaire/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40296744",
    "commentBody": "",
    "originSummary": [
      "Michael Larson ohromil diváky tím, že v pořadu Press Your Luck získal více než 110 000 dolarů zneužitím systému pořadu, což vyvolalo podezření z podvodu.",
      "Larson navzdory pochybnostem dodržel pravidla a odjel jako šampion.",
      "Po prohře v Ponziho schématu a zapojení do podvodu se Larsonova cesta uzavřela jeho úmrtím."
    ],
    "commentSummary": [
      "Debata se zaměřuje na možnost vyhrát peněžní cenu na základě shody sériových čísel na dolarových bankovkách, což vyvolává pochybnosti o legitimitě a jedinečnosti těchto čísel na bankovkách.",
      "Zkoumá strategie pro efektivní třídění velkého množství účtů, myšlení podvodníků a netradiční metody vydělávání peněz.",
      "Rozhovor se rozšiřuje o předpisy týkající se her, o tom, jak je důležité najít v práci radost a jak může být finanční úspěch a spokojenost dočasná, včetně získávání bonusů od bank a výhodných finančních taktik."
    ],
    "points": 219,
    "commentCount": 147,
    "retryCount": 0,
    "time": 1715167643
  },
  {
    "id": 40299091,
    "title": "Devv: Vyhledávač pro vývojáře s umělou inteligencí",
    "originLink": "https://devv.ai",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40299091",
    "commentBody": "",
    "originSummary": [
      "Devv je nový vyhledávač s umělou inteligencí určený pro vývojáře, který klade důraz na obsah související s programováním, jako je kód, dokumenty a webové vyhledávání jazyků a knihoven.",
      "Platforma nabízí tři režimy, včetně beta verze režimu GitHub, který klade důraz na vysoce kvalitní index a není závislý výhradně na velkých jazykových modelech (LLM).",
      "Budoucí plány Devv zahrnují rozšíření indexu o týmová úložiště a důraz na lokalizaci pro zvýšení soukromí a bezpečnosti, přičemž platforma je stále v rané fázi vývoje a je otevřená zpětné vazbě."
    ],
    "commentSummary": [
      "Devv.ai je nový vyhledávač s umělou inteligencí pro vývojáře, který klade důraz na kvalitu indexů, režim GitHub, čisté rozhraní a připravované rozšíření pro Chrome a doplněk VSCode.",
      "Uživatelé se věnují tématům, jako jsou LLM, modely AI, zpětná vazba k uživatelskému rozhraní/UX a potenciální integrace, a vyjadřují spokojenost s funkcemi, jako je režim GitHub a plány integrace API.",
      "Platforma využívá RAG pro vylepšení výsledků generování, chválí přesnost a funkčnost, zatímco doporučení zahrnují zdokonalení tokenizace a vážení termínů; Agent Mode zahrnuje GPT-4 pro přesné odpovědi."
    ],
    "points": 171,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1715181580
  },
  {
    "id": 40298486,
    "title": "Společnost Tesla je vyšetřována kvůli podvodům s cennými papíry a podvodům s bankovními převody v souvislosti s tvrzeními o samořízených vozidlech",
    "originLink": "https://www.theverge.com/2024/5/8/24151881/tesla-justice-investigation-securities-wire-fraud-self-driving",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40298486",
    "commentBody": "",
    "originSummary": [
      "Společnost Tesla je vyšetřována ministerstvem spravedlnosti kvůli podvodům s cennými papíry a podvodům s elektronickými penězi, zejména v souvislosti s jejími prohlášeními o technologii samořízení.",
      "Pozornost se soustředí na možné zavádějící informace poskytované spotřebitelům, investorům a regulačním orgánům ohledně slibů společnosti Tesla o plně autonomních vozidlech, přičemž výrokům generálního ředitele Elona Muska je věnována velká pozornost.",
      "Komise pro cenné papíry a burzy také zkoumá, zda Tesla ve svých sděleních neuváděla nepravdivé údaje o schopnostech samořízení."
    ],
    "commentSummary": [
      "Společnost Tesla a její generální ředitel Elon Musk čelí vyšetřování kvůli podvodům s cennými papíry a podvodům s bankovními převody v souvislosti s tvrzeními o technologii samořízení, což vyvolává obavy ohledně transparentnosti a možných zavádějících prohlášení s cílem zvýšit příjmy a ceny akcií.",
      "Diskuse se vedou o problémech spojených s vyvozením odpovědnosti generálních ředitelů za klamavá tvrzení, o důsledcích nesplněných slibů, o možnosti vrácení peněz zákazníkům a o zákonnosti budoucích závazků, přičemž se objevují paralely s případem obchodování s důvěrnými informacemi Marthy Stewartové.",
      "Uživatelé se rozcházejí v názorech na Muskův vliv, věrnost celebritám, nakládání s dezinformacemi na Twitteru, odstraňování online obsahu, zákaz účtu @ElonJet a jeho vliv na image společnosti Tesla."
    ],
    "points": 160,
    "commentCount": 137,
    "retryCount": 0,
    "time": 1715178379
  },
  {
    "id": 40302200,
    "title": "Dechová cvičení: Nefarmakologická cesta ke změněným stavům.",
    "originLink": "https://www.researchsquare.com/article/rs-3976380/v1",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40302200",
    "commentBody": "",
    "originSummary": [
      "Preprint zkoumá terapeutické výhody kruhové dechové terapie při vytváření změněných stavů vědomí podobných psychedelickým.",
      "Zabývá se fyziologickými a psychologickými procesy práce s dechem a ukazuje, jak záměrná hyperventilace snižuje hladinu CO2 a navozuje změněné stavy.",
      "Zjištění navrhují dechovou práci jako nefarmakologickou možnost léčby duševního zdraví s výsledky podobnými psychedelickým terapiím, což zdůrazňuje její potenciál jako psychoterapeutického nástroje."
    ],
    "commentSummary": [
      "Dechová cvičení mohou vyvolat změněné stavy vědomí tím, že hyperventilace omezí přísun kyslíku do mozku, což vede k halucinacím a změně vnímání.",
      "Vědecký výzkum tento fenomén zkoumal a přirovnal ho k psychedelickým drogám.",
      "Diskuse se soustředí na to, jak může práce s dechem ovlivnit chemii mozku, duševní zdraví a celkovou pohodu."
    ],
    "points": 128,
    "commentCount": 41,
    "retryCount": 0,
    "time": 1715198098
  },
  {
    "id": 40303661,
    "title": "Vytváření systému Linux Windows bez Xlib: Přístup založený na soketech",
    "originLink": "https://hereket.com/posts/from-scratch-x11-windowing/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40303661",
    "commentBody": "",
    "originSummary": [
      "Příspěvek podrobně popisuje vytváření oken v Linuxu pomocí soketů a programování v jazyce C bez xlib a zaměřuje se na protokol X11 pro komunikaci se serverem X.",
      "Obsahuje funkce pro inicializaci komunikace, vytváření oken, zpracování odpovědí, zpracování událostí, nastavení barev a zápis textu do oken.",
      "Aplikace pracuje nepřetržitě, spravuje chyby, uzavírá spojení a podtrhuje uchopení binární komunikace a správy prostředků v X11."
    ],
    "commentSummary": [
      "Článek se zabývá různými protokoly a technikami používanými pro otevírání oken v Linuxu, jako jsou sokety, SSH, VNC, xpra a X2GO.",
      "Řeší omezení Xlib ve srovnání s alternativami, jako je XCB, při interakci s protokolem X11.",
      "Porovnává se tradiční protokol X11 s moderními metodami vykreslování grafiky, přičemž se zdůrazňují jejich silné a slabé stránky."
    ],
    "points": 123,
    "commentCount": 50,
    "retryCount": 0,
    "time": 1715210068
  }
]
