[
  {
    "id": 39629044,
    "title": "Eloquent JavaScript 4. Baskı: JavaScript ve Programlama için Kapsamlı Bir Kılavuz",
    "originLink": "https://eloquentjavascript.net/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39629044",
    "commentBody": "",
    "originSummary": [
      "\"Eloquent JavaScript 4th edition\", Marijn Haverbeke tarafından JavaScript, programlama ve dijital kavramları kapsayan bir kitaptır ve Creative Commons lisansı altında çevrimiçi olarak veya ciltsiz olarak mevcuttur.",
      "Kitap, dil, tarayıcı, Node.js, farklı sanatçıların illüstrasyonları, kod kum havuzu, alıştırma çözümleri ve birden fazla kitap sürümü gibi kaynaklar sunuyor.",
      "Çeşitli baskıları yapılmış ve farklı dillere çevrilmiş olan bu kitap, JavaScript ve dijital dünya ile ilgilenen öğrenciler için değerli bir kaynaktır."
    ],
    "commentSummary": [
      "Eloquent JavaScript 4. baskı, erişilebilirliği ve uygun fiyatıyla JavaScript'e daha derinlemesine dalmak için en iyi seçimdir.",
      "Kyle Simpson'ın 'You Don't Know JavaScript' adlı kitabı, yazım üslubuna ilişkin karışık eleştirilere rağmen, öğrenciler için değerli bilgiler sunması açısından tavsiye edilmektedir.",
      "JavaScript'te değişken bağlama ve web geliştirmede TypeScript ve JavaScript arasındaki tartışmaların yanı sıra not alma, zaman yönetimi ve aktif katılımın vurgulandığı programlama kitaplarından etkili öğrenme için ipuçları paylaşılmaktadır."
    ],
    "points": 922,
    "commentCount": 174,
    "retryCount": 0,
    "time": 1709819536
  },
  {
    "id": 39631139,
    "title": "İsveç Kolektif Savunma İçin NATO'ya Katıldı",
    "originLink": "https://www.government.se/press-releases/2024/03/sweden-is-a-nato-member/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39631139",
    "commentBody": "",
    "originSummary": [
      "İsveç, katılım belgesini Amerika Birleşik Devletleri Hükümeti'ne sunarak 7 Mart 2024 tarihinde NATO'ya 32. üye olarak katılmıştır.",
      "NATO'nun kolektif savunmasının bir parçası olan İsveç'in üyeliğinin dış ve güvenlik politikaları üzerinde etkileri olacaktır.",
      "İsveç Başbakanlığı ve Dışişleri Bakanlığı İsveç'in NATO üyeliğine ilişkin çeşitli açıklamalar ve basın bildirileri yayınlamıştır."
    ],
    "commentSummary": [
      "NATO, Rusya, Ukrayna, İsveç, Finlandiya, Macaristan, Türkiye ve ABD'yi ilgilendiren çeşitli konuların ele alındığı tartışmada tarihsel çatışmalar, NATO'nun küresel güvenlik rolü, Rusya'nın saldırganlık endişeleri, Ukrayna'nın NATO üyeliği potansiyeli ve demokratik değerlerin desteklenmesi gibi konulara odaklanılıyor.",
      "Putin, Orban ve Erdoğan gibi liderlerin etkisi, NATO'nun genişleme etkileri, askeri yetenekler, savunma sanayi, potansiyel çatışma senaryoları ve ABD'nin NATO'daki rolü konuşmanın kilit noktalarını oluşturuyor.",
      "Uluslararası ittifakların karmaşıklığı, Rusya'nın yayılma tehdidi ve barış ve istikrarın korunması için birlik ve işbirliğinin gerekliliği vurgulanmıştır."
    ],
    "points": 487,
    "commentCount": 560,
    "retryCount": 0,
    "time": 1709829821
  },
  {
    "id": 39636470,
    "title": "Chrome Uzantısı 2.0 ile Kopyala-Yapıştır Kısıtlamalarını Atlayın",
    "originLink": "https://github.com/aaronraimist/DontFuckWithPaste",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39636470",
    "commentBody": "",
    "originSummary": [
      "Metin, web uygulamalarında kopyala ve yapıştır kısıtlamalarıyla karşılaşmanın yarattığı hayal kırıklığını ele alıyor.",
      "Kopyalama ve yapıştırma engellemesini aşmak için bir Google Chrome uzantısı kullanıma sunuldu ve yakın zamanda yapılan 2. sürüm güncellemesiyle desteklenen siteler üzerinde daha fazla kontrol ve veri işleme konusunda daha fazla şeffaflık sağlandı.",
      "Bu sürüm, kullanıcıları çeşitli web sitelerindeki kopyala ve yapıştır sınırlamalarını verimli bir şekilde aşmak için daha fazla seçenekle güçlendirmeyi amaçlamaktadır."
    ],
    "commentSummary": [
      "GitHub tartışmaları, uygulama güvenliği, Chrome uzantı izinleri, tarayıcı araması, kopyala/yapıştır engelleri, klavye kısayolları ve web sitesi güvenlik özellikleriyle ilgili hayal kırıklıkları gibi konuları kapsayarak parola güvenliği, kullanıcı deneyimi ve kullanıcı girişi kısıtlamalarını ele alıyor.",
      "Kullanıcılar, kullanılabilirliği artırmak ve güvenlik kontrollerini atlamak için tarayıcı araçlarından ve uzantılarından yararlanmayı keşfediyor.",
      "Konuşmada ayrıca dil ve kültürel çeşitliliğin çevrimiçi etkileşimler üzerindeki etkisine de değiniliyor."
    ],
    "points": 449,
    "commentCount": 221,
    "retryCount": 0,
    "time": 1709858967
  },
  {
    "id": 39637487,
    "title": "Pürüzsüz UI Animasyonları için Üstel Düzgünleştirmeyi Keşfetme",
    "originLink": "https://lisyarus.github.io/blog/programming/2023/02/21/exponential-smoothing.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39637487",
    "commentBody": "",
    "originSummary": [
      "Metin, özellikle geçiş düğmeleri gibi kullanıcı arayüzü öğelerinde yumuşak animasyonlar oluşturmak için üstel yumuşatmanın kullanımını, matematiksel kavramını açıklayarak ve diğer yumuşatma işlevleriyle karşılaştırarak inceliyor.",
      "Üstel yumuşatmanın uygulanmasına ilişkin pratik örnekler sunmakta ve animasyon titremesi ve kayan nokta hassasiyeti gibi zorluklara değinmektedir.",
      "Üstel yumuşatma, kullanıcı arayüzü tasarımında sorunsuz bir kullanıcı deneyimi sunan, kesintisiz ve gerçekçi animasyonlar oluşturmak için değerli bir teknik olarak ortaya çıkmaktadır."
    ],
    "commentSummary": [
      "Makale, kullanıcı algısı ve etkileşiminin önemini vurgulayarak animasyonların kullanıcı arayüzlerindeki rolünü inceliyor.",
      "Animasyonların kullanışlılığı konusunda, kullanıcı deneyimini geliştirdiğine inananlar ve rahatsız edici bulanlar arasında bir tartışma vardır.",
      "Kullanıcı arayüzü tasarımında tutarlılık, netlik ve erişilebilirlik gibi temel unsurlar vurgulanarak, geliştiriciler görsel olarak hoş ve işlevsel arayüzler için teknik verimlilik ve kullanıcı girdisini dengelemeye teşvik ediliyor."
    ],
    "points": 371,
    "commentCount": 168,
    "retryCount": 0,
    "time": 1709868426
  },
  {
    "id": 39630985,
    "title": "Dikkatli Olun: Özel Bağlantılardan Potansiyel Veri İfşası",
    "originLink": "https://vin01.github.io/piptagole/security-tools/soar/urlscan/hybrid-analysis/data-leaks/urlscan.io/cloudflare-radar%22/2024/03/07/url-database-leaks-private-urls.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39630985",
    "commentBody": "",
    "originSummary": [
      "urlscan.io, Hybrid Analysis ve Cloudflare Radar gibi kötü amaçlı yazılım/url analiz platformları, bulut depolama dosyaları ve parola sıfırlama bağlantıları da dahil olmak üzere kullanıcılar tarafından gönderilen çok sayıda özel bağlantıyı depolar.",
      "Bu bağlantılara arama motorları aracılığıyla herkese açık olarak erişilebildiğinden, veri gizliliği ve güvenliğini tehlikeye atabilecek endişeler ortaya çıkmaktadır.",
      "Bazı platformlar bu tür bağlantıları işaretleme ve kaldırma seçeneği sunsa da, kullanıcılar sızıntıları önleme ve hassas bilgileri koruma konusunda zorluklarla karşılaşmaktadır. Kimlik avı ve kötü amaçlı yazılım risklerini azaltmak için bu bağlantılara erişirken dikkatli olun."
    ],
    "commentSummary": [
      "Tartışma, özel güvenli bağlantıların kamuya açık bir şekilde paylaşılmasının güvenlik tehlikelerine odaklanıyor, sızan bağlantıların risklerini vurguluyor ve gizli verileri ifşa etmek için dorking kullanıyor.",
      "Öneriler arasında URL'lerde kimlik doğrulama belirteçlerinin kullanılması, güvenlik ile kullanıcı rahatlığının dengelenmesi ve daha kısa ömürlü URL'ler veya kimlik doğrulama başlıkları gibi güvenlik önlemlerinin uygulanması yer almaktadır.",
      "URL'ler veya parolalar aracılığıyla hassas bilgileri paylaşırken kimlik doğrulama, yetkilendirme, erişim kontrolü ve güvenli uygulamaların önemine vurgu yapılır."
    ],
    "points": 345,
    "commentCount": 182,
    "retryCount": 0,
    "time": 1709828987
  },
  {
    "id": 39628842,
    "title": "Google Eski Mühendisi Yapay Zeka Hırsızlığından Hapis Cezasıyla Karşı Karşıya",
    "originLink": "https://apnews.com/article/china-google-justice-department-63156ade1e564d15d92adbef91e9c5da",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39628842",
    "commentBody": "",
    "originSummary": [
      "Eski Google yazılım mühendisi Linwei Ding, Çinli şirketlerle işbirliği yaparken Google'dan yapay zeka ticari sırlarını çalmakla suçlanıyor ve 10 yıla kadar hapisle cezalandırılıyor.",
      "Google hırsızlığı tespit ederek kolluk kuvvetlerinin olaya müdahil olmasını sağladı ve Ding'in tutuklanması ve çalınan verilerin bulunduğu elektronik cihazlara el konulmasıyla sonuçlandı.",
      "Adalet Bakanlığı, yabancı kuruluşların yapay zeka teknolojisini kötü niyetli faaliyetler için kullanma potansiyeli nedeniyle ulusal güvenlikle ilgili endişelerin altını çiziyor."
    ],
    "commentSummary": [
      "Özellikle teknoloji alanındaki Çin vatandaşları tarafından gerçekleştirilen ticari sırlar ve fikri mülkiyet hırsızlığına odaklanılarak casusluk vakaları, motivasyonları ve hukuki sonuçları tartışılmaktadır.",
      "Çinli şirketlerin etkisi, Çin Komünist Partisi ve küresel ekonomik ilişkiler, casusluk ve ulusal güvenlik arasındaki hassas denge hakkında endişeler dile getirilmektedir.",
      "Diyalogda ayrıca çifte vatandaşlık, önyargılar ve yapay zeka geliştirme ve casusluk çabalarındaki uluslararası ilişkilerin karmaşık dinamikleri de ele alınıyor."
    ],
    "points": 323,
    "commentCount": 399,
    "retryCount": 0,
    "time": 1709818426
  },
  {
    "id": 39631516,
    "title": "The Pile: 800 GB Açık Kaynaklı Dil Modelleme Veri Seti (2020)",
    "originLink": "https://pile.eleuther.ai/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39631516",
    "commentBody": "",
    "originSummary": [
      "The Pile, The Eye tarafından barındırılan 800 GB'lık açık kaynaklı bir dil modelleme veri kümesidir ve 22 küçük veri kümesini jsonlines formatında birleştirerek alanlar arası bilgi ve model genellemesini geliştirir.",
      "Pile BPB'deki iyi performans, farklı alanların kavrandığını göstererek modelleri değerlendirmek için bir ölçüt görevi görür ve dil modelleme ölçütlerinde iyileştirmelere yol açar.",
      "GPT-3 ve GPT-2, The Pile veri kümesinde güçlü bir performans göstererek veri kümesinin model eğitimi ve değerlendirmesi üzerindeki etkisini ortaya koymuştur."
    ],
    "commentSummary": [
      "Tartışma, telif hakkı ihlali, adil kullanım ve yaratıcı sektörler üzerindeki etkileri vurgulayarak, yapay zeka modellerini eğitmek için kapsamlı veri kümelerinin kullanılmasının yasallığı ve etiği üzerine odaklanıyor.",
      "Endişeler, telif hakkıyla korunan materyallere izinsiz erişim, yasal engeller ve yazarlar ile sanatçılar üzerindeki etkilerin yanı sıra yapay zeka tarafından üretilen içerik ve Metinden Sese teknolojisinin sınırlamaları hakkındaki tartışmaları da içeriyor.",
      "Tartışmalarda ayrıca veri edinme zorlukları, telif hakkı düzenlemelerine bağlılık ve inovasyon ile fikri mülkiyet haklarının korunması arasında bir denge kurulması konularına da değinildi."
    ],
    "points": 319,
    "commentCount": 214,
    "retryCount": 0,
    "time": 1709831691
  },
  {
    "id": 39635483,
    "title": "Answer.AI, QLoRA Eğitimi için Çoklu GPU'lardan Yararlanma Projesini Başlattı",
    "originLink": "https://www.answer.ai/posts/2024-03-06-fsdp-qlora.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39635483",
    "commentBody": "",
    "originSummary": [
      "Jeremy liderliğindeki Answer.AI, QLoRA eğitimi için birden fazla GPU'nun kullanımını vurgulayan Ar-Ge laboratuvarlarını başlattıktan sonraki ilk projelerini açıkladı.",
      "Girişim, Tim Dettmers'ın projeyi başlatmak için verdiği destekle açık kaynaklı model üreticilerinin birincil talebinden kaynaklandı.",
      "Jeremy, proje hakkındaki soruları ve geri bildirimleri memnuniyetle karşılayarak katılımı teşvik eder."
    ],
    "commentSummary": [
      "Answer.AI'nın Ar-Ge laboratuvarı, açık kaynaklı model geliştiricileri arasında oldukça talep gören QLoRA eğitimi ile evde birden fazla GPU kullanarak 70 milyarlık bir dil modelini optimize etmek için bir proje başlattı.",
      "QLoRA'nın önemi NeurIPS Efficiency Challenge'da vurgulanarak ilgi uyandırdı ve olumlu eleştiriler aldı.",
      "Proje, kapsamlı dil modellerinin eğitiminde erişilebilirliği ve verimliliği artırmaya çalışarak donanım kısıtlamalarını, ayrıştırmayı, çeşitli eğitim tekniklerini ve gelecekteki gelişmeleri ele almaktadır."
    ],
    "points": 253,
    "commentCount": 41,
    "retryCount": 0,
    "time": 1709851129
  },
  {
    "id": 39628285,
    "title": "Fütüristik görsel programlama: Flyde kodlamada devrim yaratıyor",
    "originLink": "https://github.com/flydelabs/flyde",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39628285",
    "commentBody": "",
    "originSummary": [
      "Flyde, manuel kod çevirisine ihtiyaç duymadan karmaşık diyagramların yürütülmesini sağlayarak geleneksel kodlamayı geliştirmek için oluşturulmuş açık kaynaklı bir görsel programlama dilidir.",
      "TypeScript/JavaScript kodu ile sorunsuz bir şekilde entegre olur, Node.js ve web tarayıcıları ile uyumludur, görsel ve metin tabanlı kodlama arasında bir köprü sunar.",
      "Gabriel, yapay zekanın kodlama görevlerini üstlendiği, orkestrasyon ve üst düzey sorun çözümünü vurguladığı bir gelecek öngörürken, Flyde'ın gelişim yönüne ilişkin girdileri de davet ediyor."
    ],
    "commentSummary": [
      "Kullanıcılar, geleneksel kodlama uygulamalarını geliştirmeyi amaçlayan açık kaynaklı bir görsel programlama dili olan Flyde'yi tartışıyor.",
      "Sohbet, metin tabanlı kodlamaya karşı görsel programlama dillerinin artılarını ve eksilerini araştırıyor, etkinliklerini ve gelecekteki evrimlerini düşünüyor.",
      "Kullanıcılar, metin tabanlı kodlamanın sunduğu kolaylık ve esnekliğin farkında olarak Flyde, Luna Park ve Node Red gibi görsel programlama araçlarının farklı özelliklerini takdir etmektedir."
    ],
    "points": 246,
    "commentCount": 115,
    "retryCount": 0,
    "time": 1709814816
  },
  {
    "id": 39627443,
    "title": "Küresel Enerji Sistemlerinin Uzaydan İzlenmesi",
    "originLink": "https://blog.datadesk.eco/p/sky-lapse-in-two-tone",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39627443",
    "commentBody": "",
    "originSummary": [
      "Avrupa Uzay Ajansı'nın Sentinel-1 uydusu, açık deniz rüzgar çiftlikleri, nakliye rotaları ve açık deniz petrol ve gaz altyapısındaki değişiklikler gibi denizdeki küresel enerji sektöründeki değişimleri izlemek için radar görüntülerini kullanıyor.",
      "Makalede, Avrupa'nın Rus petrolüne uyguladığı yaptırımların küresel ham petrol hareketlerini nasıl yeniden şekillendirdiğinin yanı sıra kuraklığın Panama Kanalı üzerindeki etkisi ve bunun dünya LNG piyasasına yansımaları vurgulanıyor."
    ],
    "commentSummary": [
      "Arama ve kurtarma çalışmalarında yer alan Alman sivil toplum kuruluşu Space-Eye'ın uydu görüntülerine odaklanılarak SAR görüntüleme ve açık deniz enerji üretimi konuları ele alınıyor.",
      "SAR görüntüleme, rüzgâr çiftliği yerleşimleri ve Manş Denizi'ndeki gemi şeridi yoğunluğuna ilişkin teknik sorular konuşmanın merkezinde yer alıyor.",
      "Diyalog, SAR görüntüsü oluşturma ve rüzgar türbinlerinin rüzgar çiftlikleri içinde verimli bir şekilde yerleştirilmesi gibi konuları kapsıyor."
    ],
    "points": 245,
    "commentCount": 31,
    "retryCount": 0,
    "time": 1709808519
  },
  {
    "id": 39630457,
    "title": "UNIX'in Evrimi: Berkeley Yazılımının Öyküsü.",
    "originLink": "https://www.abortretry.fail/p/the-berkley-software-distribution",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39630457",
    "commentBody": "",
    "originSummary": [
      "Makale, UNIX işletim sisteminin tarihini ve gelişimini incelemekte ve 1970'lerde AT&T tarafından akademik kurumlara ve araştırma merkezlerine dağıtımına vurgu yapmaktadır.",
      "Bill Joy ve Ken Thompson gibi önemli şahsiyetlerin yanı sıra Kaliforniya Üniversitesi, Berkeley'deki UNIX gelişmeleri, yasal engeller ve BSD'nin macOS ve FreeBSD gibi çağdaş sistemler üzerindeki etkisi vurgulanmaktadır.",
      "Bradford Morgan White'ın \"Abort Retry Fail\" adlı kitabını bilgisayar endüstrisinin tarihini belgelemek için değerli bir kaynak olarak referans gösteriyor."
    ],
    "commentSummary": [
      "Makale, BSD Unix'in Ford Aerospace'teki ilk ticari uygulamasını incelemekte, lisanslama ve TCP/IP ilerlemesinin karmaşıklıklarını vurgulamaktadır.",
      "Ağ uyumluluğu sağlamanın zorluklarını, TCP/IP teknolojisinin gelişimini ve Apple gibi şirketler için yasal sonuçları ele alıyor.",
      "Yazıda ayrıca sürüm kontrol sistemleri, GPL ve BSD gibi lisanslama farklılıkları, Richard Stallman'ın etkisi ve Linux ve Microsoft tarafından yönlendirilen endüstri değişimleri de ele alınıyor."
    ],
    "points": 179,
    "commentCount": 59,
    "retryCount": 0,
    "time": 1709826382
  },
  {
    "id": 39633172,
    "title": "Bilgisayarlar Sinüs Fonksiyonlarını Nasıl Hesaplar?",
    "originLink": "https://androidcalculator.com/how-do-calculators-compute-sine/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39633172",
    "commentBody": "",
    "originSummary": [
      "Blog yazısı, hesap makinelerinin sinüs fonksiyonunu indirgeme, yaklaştırma ve yeniden yapılandırma adımlarıyla nasıl hesapladığını açıklıyor.",
      "Daha az hassas Taylor serisi yaklaşımı ile Intel işlemciler tarafından kullanılan daha hassas minimax yaklaşım yöntemlerini karşılaştırmaktadır.",
      "Bu teknikleri anlamak, bilgisayar simülasyonlarını ve hesaplama araçlarını destekleyen matematik hesaplamalarına bir bakış sunar."
    ],
    "commentSummary": [
      "Tartışma, özellikle SNES gibi eski sistemlerde grafik programlamada arama tablolarının ve trigonometrik fonksiyonların kullanımını incelemekte, optimizasyon tekniklerine ve transandantal sayıların yuvarlanmasındaki zorluklara odaklanmaktadır.",
      "CPU mimarileri arasındaki kayan nokta hesaplamalarındaki farklılıkları ve trigonometrik hesaplamalar için CORDIC gibi algoritmaların verimliliğini ele alır.",
      "Konuşmada ayrıca kayan noktalı sayıların hassasiyeti ve sınırlamaları, FMA talimatlarının etkisi ve matematiksel hesaplamalar için modern CPU'larda ve GPU'larda arama tablolarının potansiyel kullanımına da değiniliyor."
    ],
    "points": 178,
    "commentCount": 139,
    "retryCount": 0,
    "time": 1709837955
  },
  {
    "id": 39629213,
    "title": "51. Bölge (2005) Kaynak Kodu Garaj Satışında Ortaya Çıktı",
    "originLink": "https://github.com/ProjectDreamland/area51",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39629213",
    "commentBody": "",
    "originSummary": [
      "Area 51 (2005) video oyunu kaynak kodunun resmi olmayan sürümü, 2000'lerin başından kalma bu nostaljik kült klasiği korumayı amaçlıyor.",
      "Mart 2005 tarihli kaynak kodu anlık görüntüsü, Entropy motorunu, oyun mantığını ve çapraz platform hedeflerini içeriyor ve oyunun derlenmesi, hata ayıklanması ve potansiyel olarak mevcut sistemlere taşınması için katkıda bulunanlar arıyor.",
      "İlgilenenler, depoyu çatallayarak ve restorasyon projesine yardımcı olmak için Discord ve GitHub Tartışmaları gibi platformlarda toplulukla etkileşime geçerek katılabilirler."
    ],
    "commentSummary": [
      "Midway Studios'un 2005 tarihli \"Area 51\" oyununun kaynak kodu bir garaj satışında keşfedildi ve David Duchovny ile Marilyn Manson'ın seslendirme yaptığı Github'da paylaşıldı.",
      "Tartışmada diğer oyun motorlarıyla karşılaştırmalar, ilk FPS oyunlarında motorların yeniden kullanımı, yeni oyunlarda optimizasyon ve performans endişeleri ve oyun geliştirmede devam eden yenilikler ele alınıyor.",
      "Bunun gibi eski kaynak kodlarını bulmak, telif hakkı sorunları ve kayıp medyayı keşfetmenin değeri üzerine tartışmalarla birlikte oyun geliştirmenin önceki dönemini yansıtıyor."
    ],
    "points": 176,
    "commentCount": 63,
    "retryCount": 0,
    "time": 1709820473
  }
]
