[
  {
    "id": 41364549,
    "title": "Box64 и RISC-V в 2024 году: что нужно, чтобы запустить Ведьмака 3 на RISC-V",
    "originLink": "https://box86.org/2024/08/box64-and-risc-v-in-2024/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41364549",
    "commentBody": "",
    "originSummary": [
      "Ведьмак 3 успешно запущен на ПК с архитектурой RISC-V, став первой игрой класса AAA, которой это удалось, благодаря достижениям в Box64, Wine и DXVK.",
      "Значительный прогресс был достигнут в бэкенде RISC-V, включая исправление ошибок RV64 DynaRec и добавление новых инструкций x86, чему способствовало новое оборудование, такое как Milk-V Pioneer и VisionFive 2.",
      "Несмотря на такие трудности, как отсутствие 16-байтовых атомарных инструкций и более низкая эффективность трансляции по сравнению с другими архитектурами, The Witcher 3 работает со скоростью до 15 кадров в секунду в игре на RISC-V."
    ],
    "commentSummary": [
      "Box64 — это эмулятор, позволяющий приложениям x86-64 работать на архитектурах, отличных от x86-64, таких как RISC-V, используя нативные системные библиотеки для повышения производительности.",
      "Запуск The Witcher 3 на RISC-V включает перевод инструкций x86-64 на RISC-V, что является сложной задачей из-за различий в наборах инструкций и необходимости эффективного перевода для GPU.",
      "Открытая и гибкая природа RISC-V, несмотря на отсутствие некоторых функций, таких как оптимизации SIMD, делает его многообещающей альтернативой проприетарным архитектурам, таким как x86-64 и ARM, с продолжающимися усилиями по повышению его производительности и совместимости."
    ],
    "points": 324,
    "commentCount": 121,
    "retryCount": 0,
    "time": 1724732607
  },
  {
    "id": 41365868,
    "title": "Цукерберг заявляет о сожалении по поводу уступки давлению Белого дома на контент",
    "originLink": "https://www.politico.com/news/2024/08/26/zuckerberg-meta-white-house-pressure-00176399",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41365868",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Цукерберг признал сожаление по поводу подчинения давлению Белого дома в вопросе модерации контента, подчеркивая значительную проблему в управлении платформой.",
      "Пользователи критиковали новостную ленту Facebook за чрезмерное количество контента, созданного ИИ, и кликбейт, предпочитая старую версию, с аналогичными жалобами на Twitter.",
      "Были высказаны опасения по поводу увеличения политического и неподобающего контента на Facebook, что привело к тому, что некоторые пользователи покинули платформу, и обсуждалась более широкая проблема того, что социальные сети ставят приоритет на вовлеченность, а не на пользовательский опыт."
    ],
    "points": 288,
    "commentCount": 570,
    "retryCount": 0,
    "time": 1724752215
  },
  {
    "id": 41361281,
    "title": "Кодирование стирания для распределенных систем",
    "originLink": "https://transactional.blog/blog/2024-erasure-coding",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41361281",
    "commentBody": "",
    "originSummary": [
      "«Кодирование стиранием повышает эффективность хранения и отказоустойчивость, разделяя данные на фрагменты и добавляя фрагменты четности, что позволяет восстанавливать данные даже при потере некоторых фрагментов.»",
      "Ключевые приложения включают системы хранения (снижение затрат и увеличение долговечности) и кворумные системы (улучшение производительности чтения с некоторыми ограничениями на запись).",
      "Популярные библиотеки для реализации кодов стирания — это Jerasure и Intel ISA-L, а адаптивные схемы, такие как HRaft, настраиваются в зависимости от доступных реплик."
    ],
    "commentSummary": [
      "Обсуждение сосредоточено на кодировании стирания, методе защиты данных в распределенных системах, подчеркивая его использование в различных технологиях, таких как Ceph и RaptorQ.",
      "Кодирование стиранием хвалят за его эффективность в восстановлении данных и устойчивость к сбоям, но оно также имеет сложности и ограничения, такие как неэластичность при обновлении параметров кодирования и вычислительная интенсивность.",
      "Разговор включает ссылки на конкретные реализации и алгоритмы, такие как код Луби, RaptorQ и Wirehair, и затрагивает потенциальные патентные вопросы и практические применения в реальных системах."
    ],
    "points": 268,
    "commentCount": 51,
    "retryCount": 0,
    "time": 1724702625
  },
  {
    "id": 41364637,
    "title": "«Anthropic публикует 'системные подсказки', которые заставляют Клода работать»",
    "originLink": "https://techcrunch.com/2024/08/26/anthropic-publishes-the-system-prompt-that-makes-claude-tick/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41364637",
    "commentBody": "",
    "originSummary": [
      "Anthropic выпустила системные подсказки для своих новейших моделей ИИ (Claude 3 Opus, Claude 3.5 Sonnet и Claude 3 Haiku) для повышения прозрачности.",
      "Эти подсказки инструктируют ИИ о допустимых поведениях, включая избегание распознавания лиц и сохранение беспристрастности по спорным вопросам.",
      "Эта инициатива может повлиять на других поставщиков ИИ, побудив их принять аналогичные практики прозрачности, при этом Anthropic обязуется регулярно предоставлять обновления и раскрывать информацию."
    ],
    "commentSummary": [
      "«Anthropic выпустила системные подсказки для Claude, их модели ИИ, которая теперь признает возможность \"галлюцинаций\" и советует пользователям проверять цитаты по малоизвестным темам.»",
      "Пользователи заметили, что Клод более напорист и менее извиняющийся по сравнению с другими моделями ИИ, и некоторые считают его более надежным, чем GPT-4, для выполнения конкретных задач, таких как написание сценариев.",
      "Подробные системные подсказки предназначены для управления поведением Клода, хотя некоторые пользователи считают, что эти подсказки иногда игнорируются; они доступны на сайте документации Anthropic."
    ],
    "points": 238,
    "commentCount": 150,
    "retryCount": 0,
    "time": 1724733946
  },
  {
    "id": 41363549,
    "title": "Тройной провал 2U, EdX и Axim",
    "originLink": "https://www.classcentral.com/report/2u-edx-bankruptcy/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41363549",
    "commentBody": "",
    "originSummary": [
      "В 2021 году компания 2U приобрела edX за 800 миллионов долларов, что привело к финансовым трудностям и в конечном итоге к банкротству в 2024 году.",
      "Приобретение добавило 42 миллиона долларов ежегодных процентных расходов, и усилия по снижению затрат и объединению операций под брендом edX не увенчались успехом.",
      "«Axim Collaborative, некоммерческая организация, владеющая $800 миллионами от продажи, оказала минимальное влияние на сферу образовательных технологий, став в основном грантодающей организацией.»"
    ],
    "commentSummary": [
      "«Пост обсуждает предполагаемое снижение качества и эффективности массовых открытых онлайн-курсов (MOOCs) с таких платформ, как Coursera, EdX и Udacity.»",
      "Ключевые проблемы включают упрощенные задания, отсутствие обратной связи и менее строгие курсы по сравнению с традиционными университетскими программами.",
      "Несмотря на некоторые положительные моменты, общая тенденция воспринимается как негативная: добавляется меньше новых качественных курсов, а многие старые, ценные курсы архивируются."
    ],
    "points": 219,
    "commentCount": 155,
    "retryCount": 0,
    "time": 1724718845
  },
  {
    "id": 41368866,
    "title": "Подрядчики крыла Сейнсбери находят письмо 1990 года от донора",
    "originLink": "https://www.theartnewspaper.com/2024/08/27/sainsbury-wing-contractors-find-1990-letter-from-donor-anticipating-their-demolition-of-false-columns",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41368866",
    "commentBody": "",
    "originSummary": [
      "Подрядчики, занимающиеся ремонтом крыла Сейнсбери в Лондонской Национальной галерее, обнаружили письмо 1990 года от донора Джона Сейнсбери, критикующее включение ложных колонн в фойе, что он считал ошибкой архитекторов.",
      "Письмо, обнаруженное во время недавнего ремонта, выражало надежду Сейнсбери на то, что будущие поколения уберут ненужные колонны.",
      "Крыло Сейнсбери, проходящее модернизацию стоимостью 85 миллионов фунтов стерлингов для создания более открытого фойе, планируется вновь открыть в мае следующего года, при значительных вкладах семьи Сейнсбери."
    ],
    "commentSummary": [
      "Подрядчики обнаружили письмо 1990 года от донора в неструктурной колонне на первом этаже крыла Сейнсбери.",
      "Открытие вызвало обсуждения о назначении колонн, их дизайне и архитектурных решениях.",
      "Письмо привело к размышлениям о намерениях архитектора и донора, некоторые находят в этом юмор, а другие обсуждают связанные архитектурные теории."
    ],
    "points": 172,
    "commentCount": 37,
    "retryCount": 0,
    "time": 1724773767
  },
  {
    "id": 41365637,
    "title": "У Tinyboxes наконец-то появилась кнопка «Купить сейчас»",
    "originLink": "https://twitter.com/realgeorgehotz/status/1828197925874463166",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41365637",
    "commentBody": "",
    "originSummary": [
      "Товар Tinyboxes, созданный Джорджем Хотцем, теперь имеет кнопку «купить сейчас» после 18 месяцев разработки.",
      "В настоящее время доступно для покупки 13 единиц, при этом tinybox red за $15k предлагает наилучшую производительность за доллар для машинного обучения (ML) и полностью поддерживает сетевое подключение.",
      "Заинтересованные покупатели могут посетить предоставленную ссылку на аккаунте @__tinygrad__ в Twitter, чтобы совершить покупку."
    ],
    "commentSummary": [
      "Миникомпьютеры Tinyboxes, высокопроизводительные вычислительные устройства, теперь оснащены кнопкой «купить сейчас», что делает их более доступными для покупки.",
      "Устройство, стоимость которого составляет $15k для Radeon и $25k для Nvidia, требует значительной мощности (3200 Вт) и может потребовать двух отдельных цепей в жилых помещениях.",
      "Были высказаны опасения по поводу его сетевых возможностей (64 ГБ/с по PCIe) и пригодности для тонкой настройки крупных моделей машинного обучения, таких как LLama 3.1 / 70B, из-за ограничений VRAM и пропускной способности межсоединений."
    ],
    "points": 171,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1724748884
  },
  {
    "id": 41363499,
    "title": "Прогнозирование будущего распределенных систем",
    "originLink": "https://blog.colinbreck.com/predicting-the-future-of-distributed-systems/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41363499",
    "commentBody": "",
    "originSummary": [
      "Значительные изменения в распределенных системах включают центральную роль объектного хранилища, слияние транзакционных и аналитических инструментов, а также новые модели программирования.",
      "Концепция Джеффа Безоса о решениях через одностороннюю дверь (необратимых) и двустороннюю дверь (обратимых) имеет решающее значение для управления рисками, связанными с внедрением новых технологий.",
      "Объектное хранилище набирает популярность благодаря своей надежности, гибкости и таким функциям, как межрегиональная репликация и шифрование, при этом в будущем ожидаются улучшения в производительности и совместимости."
    ],
    "commentSummary": [
      "Обсуждение подчеркивает необходимость улучшения маркетинга инновационных инструментов, таких как mgmt config, и перехода к неизменяемым системам.",
      "Ключевые темы включают важность локальных сред разработки, роль API и изменяющийся ландшафт хранения и баз данных в распределенных системах.",
      "Разговор отражает смесь оптимизма и скептицизма по поводу будущего распределенных систем, обсуждая эффективность текущих инструментов и потенциал более умных решений для хранения данных."
    ],
    "points": 156,
    "commentCount": 38,
    "retryCount": 0,
    "time": 1724718397
  },
  {
    "id": 41367964,
    "title": "Новые атаки нулевого дня связаны с китайской группировкой 'Volt Typhoon'",
    "originLink": "https://krebsonsecurity.com/2024/08/new-0-day-attacks-linked-to-chinas-volt-typhoon/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41367964",
    "commentBody": "",
    "originSummary": [
      "Злоумышленники используют уязвимость нулевого дня (CVE-2024-39717) в Versa Director, программном обеспечении, используемом многими интернет- и ИТ-провайдерами.",
      "Группа кибершпионажа Volt Typhoon, связанная с Китаем, подозревается в атаке на критические сети США через эту уязвимость, которая позволяет злоумышленникам загружать файлы на уязвимые системы.",
      "Versa призвала клиентов установить патч для устранения уязвимости с помощью Versa Director версии 22.1.4 или более поздней, в то время как исследователи из Black Lotus Labs обнаружили веб-ориентированную бэкдор на нескольких системах и приписали эту активность Volt Typhoon с умеренной уверенностью."
    ],
    "commentSummary": [
      "Новые атаки нулевого дня были связаны с 'Volt Typhoon' из Китая, спонсируемой государством группой, согласно недавнему предупреждению.",
      "Консультативное заключение критиковало клиентов Versa за то, что они не внедрили меры по усилению системы и рекомендации по настройке брандмауэра, оставив порты управления открытыми для интернета.",
      "Эти атаки подчеркивают важность кибергигиены и потенциальные риски оставления открытыми портов управления, что считается базовой практикой системного администрирования."
    ],
    "points": 154,
    "commentCount": 31,
    "retryCount": 0,
    "time": 1724769110
  },
  {
    "id": 41364776,
    "title": "Фонд Суверенных Технологий инвестирует 686 тыс. евро в модернизацию инфраструктуры FreeBSD",
    "originLink": "https://freebsdfoundation.org/blog/sovereign-tech-fund-to-invest-e686400-in-freebsd-infrastructure-modernization/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41364776",
    "commentBody": "",
    "originSummary": [
      "Фонд суверенных технологий Германии (STF) инвестирует 686 400 евро в проект FreeBSD для модернизации его инфраструктуры, безопасности и опыта разработчиков.",
      "Инвестиции будут сосредоточены на создании нулевого доверия, автоматизации CI/CD, снижении технического долга, усилении мер безопасности и улучшении процессов SBOM (список материалов программного обеспечения).",
      "«Эта инициатива соответствует приоритетам Управления национального директора по кибербезопасности США и направлена на укрепление экосистемы открытого исходного кода, что принесет пользу глобальному общественному, исследовательскому и коммерческому секторам.»"
    ],
    "commentSummary": [
      "Фонд Sovereign Tech инвестирует 686 тысяч евро в модернизацию инфраструктуры FreeBSD, с целью уменьшения технического долга и улучшения системы.",
      "Этот немецкий фонд имеет историю поддержки значительных проектов с открытым исходным кодом, таких как curl, ffmpeg, GNOME и PHP.",
      "FreeBSD широко используется такими компаниями, как Juniper, Sony и Netflix, что подчеркивает его важность в сетевой инфраструктуре и более широкой сообществе с открытым исходным кодом."
    ],
    "points": 154,
    "commentCount": 71,
    "retryCount": 0,
    "time": 1724736229
  },
  {
    "id": 41368935,
    "title": "80% проектов в области ИИ терпят крах, миллиарды потрачены впустую, говорится в отчете Rand",
    "originLink": "https://salesforcedevops.net/index.php/2024/08/19/ai-apocalypse/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41368935",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Отчет RAND указывает, что 80% проектов в области ИИ терпят неудачу из-за недопонимания проблем, которые ИИ должен решать, недостаточных данных и плохой инфраструктуры.",
      "Успешные проекты в области ИИ требуют раннего участия специалистов по данным и инженеров по машинному обучению (ML), чтобы обеспечить значимый эффект и преодолеть разрыв между техническими и отраслевыми экспертами.",
      "Многие инициативы в области ИИ движимы ажиотажем, а не реальными потребностями, что приводит к дорогостоящим неудачам, при этом управленческие проблемы и нереалистичные ожидания мешают раскрытию потенциала ИИ."
    ],
    "points": 131,
    "commentCount": 128,
    "retryCount": 0,
    "time": 1724774156
  },
  {
    "id": 41360808,
    "title": "Сноуден: Арест Дурова является нападением на основные права человека",
    "originLink": "https://twitter.com/Snowden/status/1827695836832334169",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41360808",
    "commentBody": "",
    "originSummary": [
      "Эдвард Сноуден раскритиковал арест Павла Дурова, рассматривая его как нападение на свободу слова и ассоциаций.",
      "Сноуден выразил разочарование в отношении президента Франции Эммануэля Макрона за использование тактик для доступа к частным коммуникациям, что, по его мнению, подрывает Францию и мировые стандарты."
    ],
    "commentSummary": [
      "Эдвард Сноуден назвал арест основателя Telegram Павла Дурова нападением на основные права человека.",
      "Дебаты сосредоточены на соблюдении мессенджерами юридических ордеров и повесток, сравнивая отказ Telegram сотрудничать с минимальным предоставлением данных Signal.",
      "Дуров сталкивается с множеством обвинений, включая соучастие в распространении детской порнографии и отказ предоставить необходимую информацию властям, что вызывает серьезные юридические и этические вопросы."
    ],
    "points": 130,
    "commentCount": 249,
    "retryCount": 0,
    "time": 1724700256
  },
  {
    "id": 41363231,
    "title": "Конец финала",
    "originLink": "https://www.finalemusic.com/blog/end-of-finale-new-journey-dorico-letter-from-president/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41363231",
    "commentBody": "",
    "originSummary": [
      "Компания Coda Music Technologies (ныне MakeMusic) объявила о прекращении разработки Finale, ведущего программного обеспечения для нотной записи, из-за эволюции технологий и сложности обслуживания.",
      "С настоящего момента дальнейшие обновления не будут производиться, и Finale больше нельзя будет приобрести или обновить; начиная с августа 2025 года, его нельзя будет авторизовать на новых устройствах или повторно авторизовать, и техническая поддержка прекратится.",
      "MakeMusic заключила партнерство с Steinberg, чтобы предложить пользователям Finale эксклюзивную скидку на Dorico Pro, новое программное обеспечение для нотной записи, по цене $149 (розничная цена $579)."
    ],
    "commentSummary": [
      "Компания MakeMusic, создатель Finale, через год прекратит авторизацию новых установок программного обеспечения, фактически прекращая его использование на новых устройствах.",
      "MakeMusic сотрудничает с Steinberg, чтобы предложить скидку на Dorico Pro, предлагая план перехода для существующих пользователей Finale.",
      "Пользователям рекомендуется конвертировать свои файлы Finale в MusicXML, открытый формат, так как будущие установки и активации будут невозможны."
    ],
    "points": 125,
    "commentCount": 117,
    "retryCount": 0,
    "time": 1724715261
  },
  {
    "id": 41366436,
    "title": "Ядерные реакторы на глубине мили под землей обещают безопасную и дешевую энергию",
    "originLink": "https://newatlas.com/energy/underground-nuclear-reactors/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41366436",
    "commentBody": "",
    "originSummary": [
      "Стартап Deep Fission предлагает разместить ядерный реактор шириной 30 дюймов на глубине одной мили под землей для решения экономических и вопросов безопасности в ядерной энергетике.",
      "Реактор, основанный на обычном водо-водяном энергетическом реакторе (PWR), работает при давлении 160 атмосфер и температуре 315 °C (600 °F), используя пассивную систему охлаждения и вес водяного столба для прессуризации.",
      "Этот проект устраняет необходимость в дорогостоящих инженерных и защитных сооружениях, и реактор можно извлечь для осмотра или обслуживания в течение нескольких часов; в настоящее время Deep Fission находится на этапе предварительного рассмотрения заявки в Министерстве энергетики."
    ],
    "commentSummary": [
      "Новая концепция предлагает строить ядерные реакторы на глубине мили под землей для повышения безопасности и снижения затрат.",
      "«Несмотря на то, что существующие ядерные реакторы являются чрезвычайно безопасными, опасения общественности по поводу безопасности продолжают препятствовать их строительству.»",
      "Идея захоронения реакторов глубоко под землей может непреднамеренно усилить восприятие ядерной энергии как чрезвычайно опасной."
    ],
    "points": 124,
    "commentCount": 250,
    "retryCount": 0,
    "time": 1724758585
  },
  {
    "id": 41366304,
    "title": "Почему Япония столкнулась с нехваткой риса, несмотря на нормальные урожаи?",
    "originLink": "https://mainichi.jp/english/articles/20240823/p2a/00m/0bu/024000c",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41366304",
    "commentBody": "",
    "originSummary": [
      "Япония сталкивается с нехваткой риса и ростом цен, несмотря на нормальные урожаи, из-за давней политики сокращения посевных площадей, направленной на контроль рыночных цен.",
      "Эта политика, действующая более 50 лет, стимулирует фермеров переходить на другие культуры, что приводит к строго управляемому производству риса и уязвимости к колебаниям спроса.",
      "Эксперты предлагают отменить политику, увеличить производство риса и нарастить экспорт для повышения продовольственной безопасности и выгоды потребителей."
    ],
    "commentSummary": [
      "В Японии наблюдается нехватка риса, несмотря на нормальные урожаи, из-за государственной политики, стимулирующей фермеров сокращать производство для поддержания высоких цен.",
      "Эта 60-летняя политика ограничивает предложение, вызывая даже при незначительном увеличении спроса, например, из-за туризма, дефицит и повышение цен.",
      "Критики предлагают Японии отказаться от этой политики, чтобы увеличить производство, потенциально стать крупным экспортером риса и улучшить продовольственную безопасность."
    ],
    "points": 119,
    "commentCount": 151,
    "retryCount": 0,
    "time": 1724757582
  }
]
