[
  {
    "id": 41364549,
    "title": "Box64 و RISC-V في عام 2024: ما الذي يتطلبه تشغيل لعبة The Witcher 3 على RISC-V",
    "originLink": "https://box86.org/2024/08/box64-and-risc-v-in-2024/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41364549",
    "commentBody": "",
    "originSummary": [
      "لقد تم تشغيل لعبة The Witcher 3 بنجاح على حاسوب بمعمارية RISC-V، مما يجعلها أول لعبة AAA تقوم بذلك، بفضل التقدم في Box64 وWine وDXVK.",
      "تم إحراز تقدم كبير في الخلفية RISC-V، بما في ذلك إصلاح أخطاء RV64 DynaRec وإضافة تعليمات x86 جديدة، وذلك بفضل الأجهزة الجديدة مثل Milk-V Pioneer وVisionFive 2.",
      "على الرغم من التحديات مثل عدم وجود تعليمات ذرية بحجم 16 بايت وكفاءة الترجمة الأقل مقارنة بالمعماريات الأخرى، فإن لعبة The Witcher 3 تعمل بسرعة تصل إلى 15 إطارًا في الثانية على معمارية RISC-V."
    ],
    "commentSummary": [
      "Box64 هو محاكي يمكّن تطبيقات x86-64 من العمل على معماريات غير x86-64، مثل RISC-V، باستخدام مكتبات النظام الأصلية لتحسين الأداء.",
      "تشغيل لعبة The Witcher 3 على معمارية RISC-V يتطلب ترجمة تعليمات x86-64 إلى RISC-V، وهو أمر صعب بسبب الاختلافات في مجموعات التعليمات والحاجة إلى ترجمة فعالة لوحدة معالجة الرسومات (GPU).",
      "تجعل الطبيعة المفتوحة والمرنة لـ RISC-V، على الرغم من افتقارها لبعض الميزات مثل تحسينات SIMD، منها بديلاً واعدًا للمعماريات المملوكة مثل x86-64 وARM، مع جهود مستمرة لتعزيز أدائها وتوافقها."
    ],
    "points": 324,
    "commentCount": 121,
    "retryCount": 0,
    "time": 1724732607
  },
  {
    "id": 41365868,
    "title": "زوكربيرج يدعي الندم على الرضوخ لضغوط البيت الأبيض بشأن المحتوى",
    "originLink": "https://www.politico.com/news/2024/08/26/zuckerberg-meta-white-house-pressure-00176399",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41365868",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "اعترف زوكربيرج بالندم على الخضوع لضغوط البيت الأبيض بشأن تعديل المحتوى، مما يسلط الضوء على قضية مهمة في إدارة المنصات.",
      "انتقد المستخدمون خلاصة الأخبار في فيسبوك بسبب المحتوى المولّد بواسطة الذكاء الاصطناعي بشكل مفرط والعناوين الجاذبة للنقر، مفضلين النسخة القديمة، مع شكاوى مماثلة حول تويتر.",
      "أثيرت مخاوف بشأن زيادة المحتوى السياسي وغير المناسب على فيسبوك، مما دفع بعض المستخدمين إلى التخلي عن المنصة، وتمت مناقشة القضية الأوسع المتعلقة بتركيز وسائل التواصل الاجتماعي على التفاعل بدلاً من تجربة المستخدم."
    ],
    "points": 288,
    "commentCount": 570,
    "retryCount": 0,
    "time": 1724752215
  },
  {
    "id": 41361281,
    "title": "الترميز المحو لأنظمة التوزيع",
    "originLink": "https://transactional.blog/blog/2024-erasure-coding",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41361281",
    "commentBody": "",
    "originSummary": [
      "يُحسّن الترميز المحو كفاءة التخزين وتحمل الأخطاء عن طريق تقسيم البيانات إلى أجزاء وإضافة أجزاء تساوي، مما يسمح بإعادة بناء البيانات حتى إذا فُقدت بعض الأجزاء.",
      "تشمل التطبيقات الرئيسية أنظمة التخزين (تقليل التكاليف وزيادة المتانة) وأنظمة النصاب (تحسين أداء القراءة مع بعض القيود على الكتابة).",
      "المكتبات الشهيرة لتنفيذ أكواد المحو هي Jerasure و Intel ISA-L، مع وجود مخططات تكيفية مثل HRaft التي تتكيف بناءً على النسخ المتاحة."
    ],
    "commentSummary": [
      "تتمحور المناقشة حول ترميز المحو، وهو طريقة لحماية البيانات في الأنظمة الموزعة، مع تسليط الضوء على استخدامه في تقنيات مختلفة مثل Ceph وRaptorQ.",
      "يُشيد بالترميز المحو لكفاءته في استعادة البيانات وتحمل الأخطاء، ولكنه يحتوي أيضًا على تعقيدات وقيود، مثل عدم المرونة في تحديث معايير الترميز وشدة العمليات الحسابية.",
      "تتضمن المحادثة إشارات إلى تطبيقات وخوارزميات محددة، مثل كود لابي التحويلي، وRaptorQ، وWirehair، وتتناول قضايا براءات الاختراع المحتملة والتطبيقات العملية في الأنظمة الواقعية."
    ],
    "points": 268,
    "commentCount": 51,
    "retryCount": 0,
    "time": 1724702625
  },
  {
    "id": 41364637,
    "title": "أنثروبيك تنشر 'مطالبات النظام' التي تجعل كلود يعمل",
    "originLink": "https://techcrunch.com/2024/08/26/anthropic-publishes-the-system-prompt-that-makes-claude-tick/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41364637",
    "commentBody": "",
    "originSummary": [
      "أصدرت شركة Anthropic التعليمات النظامية لأحدث نماذج الذكاء الاصطناعي الخاصة بها (Claude 3 Opus، Claude 3.5 Sonnet، وClaude 3 Haiku) لتعزيز الشفافية.",
      "توجه هذه التعليمات الذكاء الاصطناعي نحو السلوكيات المقبولة، بما في ذلك تجنب التعرف على الوجوه والحفاظ على الحياد في القضايا المثيرة للجدل.",
      "قد تؤثر هذه المبادرة على بائعي الذكاء الاصطناعي الآخرين لاعتماد ممارسات شفافية مماثلة، حيث تلتزم شركة Anthropic بتقديم تحديثات وإفصاحات منتظمة."
    ],
    "commentSummary": [
      "أصدرت شركة أنثروبيك التعليمات الخاصة بنظام كلود، نموذج الذكاء الاصطناعي الخاص بها، والذي يعترف الآن بحدوث \"الهلوسات\" وينصح المستخدمين بالتحقق من الاستشهادات في المواضيع الغامضة.",
      "لاحظ المستخدمون أن كلود أكثر حزمًا وأقل اعتذارًا مقارنةً بنماذج الذكاء الاصطناعي الأخرى، ويجد البعض أنه أكثر موثوقية من GPT-4 في مهام محددة مثل كتابة النصوص.",
      "تم تصميم التعليمات التفصيلية للنظام لتوجيه سلوك كلود، على الرغم من أن بعض المستخدمين يشعرون بأن هذه التعليمات يتم تجاهلها أحيانًا؛ وهي متاحة على موقع توثيق أنثروبيك."
    ],
    "points": 238,
    "commentCount": 150,
    "retryCount": 0,
    "time": 1724733946
  },
  {
    "id": 41363549,
    "title": "الفشل الثلاثي لشركات 2U وEdX وAxim",
    "originLink": "https://www.classcentral.com/report/2u-edx-bankruptcy/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41363549",
    "commentBody": "",
    "originSummary": [
      "في عام 2021، استحوذت شركة 2U على edX مقابل 800 مليون دولار، مما أدى إلى ضغوط مالية وإفلاسها في نهاية المطاف بحلول عام 2024.",
      "أضافت عملية الاستحواذ 42 مليون دولار إلى النفقات السنوية للفوائد، وفشلت الجهود المبذولة لخفض التكاليف وتوحيد العمليات تحت علامة edX التجارية.",
      "أظهرت منظمة أكسيم التعاونية، التي تحتفظ بمبلغ 800 مليون دولار من عملية البيع، تأثيرًا ضئيلًا على مجال التكنولوجيا التعليمية، وأصبحت في الأساس منظمة تمنح المنح."
    ],
    "commentSummary": [
      "تتناول المقالة التراجع الملحوظ في جودة وفعالية الدورات التعليمية المفتوحة عبر الإنترنت (MOOCs) من منصات مثل كورسيرا، وإدكس، ويوداسيتي.",
      "تشمل القضايا الرئيسية التي تم تسليط الضوء عليها التكاليف المبسطة، ونقص التغذية الراجعة، والدورات التي تكون أقل صرامة مقارنة بالعروض التقليدية للجامعات.",
      "على الرغم من بعض التجارب الإيجابية، يُنظر إلى الاتجاه العام على أنه سلبي، حيث يتم إضافة عدد أقل من الدورات عالية الجودة الجديدة ويتم أرشفة العديد من الدورات القديمة والقيمة."
    ],
    "points": 219,
    "commentCount": 155,
    "retryCount": 0,
    "time": 1724718845
  },
  {
    "id": 41368866,
    "title": "عثر مقاولون في جناح ساينسبري على رسالة من متبرع تعود لعام 1990",
    "originLink": "https://www.theartnewspaper.com/2024/08/27/sainsbury-wing-contractors-find-1990-letter-from-donor-anticipating-their-demolition-of-false-columns",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41368866",
    "commentBody": "",
    "originSummary": [
      "اكتشف المقاولون الذين يقومون بتجديد جناح ساينسبري في المعرض الوطني بلندن رسالة تعود لعام 1990 من المتبرع جون ساينسبري ينتقد فيها إدراج أعمدة زائفة في البهو، والتي اعتبرها خطأ من قبل المهندسين المعماريين.",
      "الرسالة، التي اكتُشفت خلال التجديدات الأخيرة، عبّرت عن أمل ساينسبري في أن تقوم الأجيال القادمة بإزالة الأعمدة غير الضرورية.",
      "من المقرر إعادة افتتاح جناح ساينسبري، الذي يخضع لتحديث بقيمة 85 مليون جنيه إسترليني لإنشاء بهو أكثر انفتاحًا، في مايو من العام المقبل، مع مساهمات كبيرة من عائلة ساينسبري."
    ],
    "commentSummary": [
      "اكتشف المقاولون رسالة تعود لعام 1990 من متبرع في عمود غير هيكلي في الطابق الأرضي من جناح ساينسبري.",
      "أثار الاكتشاف مناقشات حول الغرض من الأعمدة وتصميمها والخيارات المعمارية التي تم اتخاذها.",
      "أدت الرسالة إلى تأملات حول نوايا المهندس المعماري والمتبرع، حيث وجد البعض فيها طرافة بينما ناقش آخرون النظريات المعمارية ذات الصلة."
    ],
    "points": 172,
    "commentCount": 37,
    "retryCount": 0,
    "time": 1724773767
  },
  {
    "id": 41365637,
    "title": "أخيرًا، تحتوي Tinyboxes على زر الشراء الآن",
    "originLink": "https://twitter.com/realgeorgehotz/status/1828197925874463166",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41365637",
    "commentBody": "",
    "originSummary": [
      "تحتوي Tinyboxes، وهو منتج من جورج هوتز، الآن على زر \"اشترِ الآن\" بعد 18 شهرًا من التطوير.",
      "حاليًا، تتوفر 13 وحدة للشراء، حيث يقدم tinybox الأحمر بسعر 15 ألف دولار أفضل أداء مقابل السعر لتعلم الآلة (ML) ويتميز بإمكانية الشبكة الكاملة.",
      "يمكن للمشترين المهتمين زيارة الرابط المقدم على حساب تويتر @__tinygrad__ لإجراء عملية الشراء."
    ],
    "commentSummary": [
      "تتميز أجهزة Tinyboxes، وهي أجهزة حوسبة عالية الأداء، الآن بزر \"اشترِ الآن\"، مما يجعلها أكثر سهولة في الشراء.",
      "يبلغ سعر الجهاز 15 ألف دولار لبطاقة Radeon و25 ألف دولار لبطاقة Nvidia، ويتطلب طاقة كبيرة (3200 واط) وقد يحتاج إلى دائرتين كهربائيتين منفصلتين في البيئات السكنية.",
      "تم التعبير عن مخاوف بشأن قدراته على الشبكات (64 جيجابايت/ثانية عبر PCIe) ومدى ملاءمته لضبط النماذج الكبيرة لتعلم الآلة، مثل LLama 3.1 / 70B، بسبب قيود ذاكرة الفيديو وعرض النطاق الترددي للاتصال البيني."
    ],
    "points": 171,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1724748884
  },
  {
    "id": 41363499,
    "title": "التنبؤ بمستقبل الأنظمة الموزعة",
    "originLink": "https://blog.colinbreck.com/predicting-the-future-of-distributed-systems/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41363499",
    "commentBody": "",
    "originSummary": [
      "تشمل التغييرات الكبيرة في الأنظمة الموزعة الدور المركزي لتخزين الكائنات، ودمج الأدوات التحليلية والمعاملاتية، ونماذج البرمجة الجديدة.",
      "مفهوم جيف بيزوس للقرارات ذات الاتجاه الواحد (غير القابلة للعكس) والقرارات ذات الاتجاهين (القابلة للعكس) هو أمر بالغ الأهمية لإدارة المخاطر المرتبطة بتبني التقنيات الجديدة.",
      "تكتسب تخزين الكائنات شعبية متزايدة بسبب موثوقيتها ومرونتها وميزات مثل النسخ المتماثل عبر المناطق والتشفير، مع توقع تحسينات مستقبلية في الأداء والتشغيل البيني."
    ],
    "commentSummary": [
      "تؤكد المناقشة على الحاجة إلى تحسين تسويق الأدوات المبتكرة مثل mgmt config والتحول نحو الأنظمة غير القابلة للتغيير.",
      "تشمل المواضيع الرئيسية أهمية بيئات التطوير المحلية، ودور واجهات برمجة التطبيقات (APIs)، والمشهد المتطور للتخزين وقواعد البيانات في الأنظمة الموزعة.",
      "تعكس المحادثة مزيجًا من التفاؤل والتشكيك بشأن مستقبل الأنظمة الموزعة، حيث يتم مناقشة فعالية الأدوات الحالية وإمكانية حلول التخزين الأكثر ذكاءً."
    ],
    "points": 156,
    "commentCount": 38,
    "retryCount": 0,
    "time": 1724718397
  },
  {
    "id": 41367964,
    "title": "هجمات يوم الصفر الجديدة مرتبطة بـ 'إعصار فولت' الصيني",
    "originLink": "https://krebsonsecurity.com/2024/08/new-0-day-attacks-linked-to-chinas-volt-typhoon/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41367964",
    "commentBody": "",
    "originSummary": [
      "يستغل القراصنة الخبيثون ثغرة يوم الصفر (CVE-2024-39717) في برنامج Versa Director، وهو برنامج يستخدمه العديد من مزودي خدمات الإنترنت وتكنولوجيا المعلومات.",
      "يُشتبه في أن مجموعة التجسس الإلكتروني Volt Typhoon، المرتبطة بالصين، تستهدف الشبكات الأمريكية الحيوية من خلال هذا الخلل، الذي يسمح للمهاجمين بتحميل ملفات إلى الأنظمة الضعيفة.",
      "حثت شركة فيرسا العملاء على تصحيح الثغرة باستخدام Versa Director 22.1.4 أو إصدار أحدث، بينما حدد الباحثون من مختبرات بلاك لوتس وجود باب خلفي على الويب في عدة أنظمة ونسبوا النشاط إلى Volt Typhoon بثقة متوسطة."
    ],
    "commentSummary": [
      "تم ربط هجمات جديدة من نوع 0-day بمجموعة 'Volt Typhoon' الصينية المدعومة من الدولة، وفقًا لتحذير حديث.",
      "انتقدت الاستشارة عملاء Versa لعدم تنفيذهم لتوجيهات تعزيز النظام والجدار الناري، مما ترك منافذ الإدارة مكشوفة على الإنترنت.",
      "تسلط الهجمات الضوء على أهمية النظافة الإلكترونية والمخاطر المحتملة لترك منافذ الإدارة مفتوحة، وهو ما يُعتبر ممارسة أساسية في إدارة الأنظمة."
    ],
    "points": 154,
    "commentCount": 31,
    "retryCount": 0,
    "time": 1724769110
  },
  {
    "id": 41364776,
    "title": "صندوق التكنولوجيا السيادية يستثمر 686 ألف يورو في تحديث بنية FreeBSD التحتية",
    "originLink": "https://freebsdfoundation.org/blog/sovereign-tech-fund-to-invest-e686400-in-freebsd-infrastructure-modernization/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41364776",
    "commentBody": "",
    "originSummary": [
      "سيستثمر صندوق التكنولوجيا السيادية الألماني (STF) مبلغ 686,400 يورو في مشروع FreeBSD لتحديث بنيته التحتية وأمنه وتجربة المطورين.",
      "سيركز الاستثمار على بناء الثقة الصفرية، وأتمتة CI/CD، وتقليل الديون التقنية، وتعزيز ضوابط الأمان، وتحسين عمليات SBOM (قائمة مواد البرمجيات).",
      "تتوافق هذه المبادرة مع أولويات مكتب المدير الوطني للأمن السيبراني في الولايات المتحدة وتهدف إلى تعزيز نظام المصادر المفتوحة، مما يعود بالفائدة على القطاعات العامة والبحثية والتجارية العالمية."
    ],
    "commentSummary": [
      "يستثمر صندوق التكنولوجيا السيادية مبلغ 686 ألف يورو في تحديث بنية FreeBSD التحتية، بهدف تقليل الديون التقنية وتحسين النظام.",
      "لدى هذا الصندوق الألماني تاريخ في دعم مشاريع المصادر المفتوحة الهامة مثل curl وffmpeg وGNOME وPHP.",
      "يُستخدم FreeBSD على نطاق واسع من قبل شركات مثل Juniper وSony وNetflix، مما يبرز أهميته في البنية التحتية للشبكات والمجتمع الأوسع مفتوح المصدر."
    ],
    "points": 154,
    "commentCount": 71,
    "retryCount": 0,
    "time": 1724736229
  },
  {
    "id": 41368935,
    "title": "80% من مشاريع الذكاء الاصطناعي تفشل وتنهار، مليارات مهدرة وفقًا لتقرير راند",
    "originLink": "https://salesforcedevops.net/index.php/2024/08/19/ai-apocalypse/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41368935",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "يشير تقرير من مؤسسة راند إلى أن 80% من مشاريع الذكاء الاصطناعي تفشل بسبب سوء الفهم حول المشكلات التي يجب أن يعالجها الذكاء الاصطناعي، ونقص البيانات، وضعف البنية التحتية.",
      "تتطلب مشاريع الذكاء الاصطناعي الناجحة مشاركة مبكرة من علماء البيانات ومهندسي التعلم الآلي لضمان تأثير ملموس وسد الفجوة بين الخبراء التقنيين والمتخصصين في المجال.",
      "العديد من المبادرات المتعلقة بالذكاء الاصطناعي مدفوعة بالضجة الإعلامية بدلاً من الاحتياجات الفعلية، مما يؤدي إلى إخفاقات مكلفة، حيث تعيق مشاكل الإدارة والتوقعات غير الواقعية إمكانيات الذكاء الاصطناعي."
    ],
    "points": 131,
    "commentCount": 128,
    "retryCount": 0,
    "time": 1724774156
  },
  {
    "id": 41360808,
    "title": "سنودن: اعتقال دوروف هو اعتداء على حقوق الإنسان الأساسية",
    "originLink": "https://twitter.com/Snowden/status/1827695836832334169",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41360808",
    "commentBody": "",
    "originSummary": [
      "انتقد إدوارد سنودن اعتقال بافل دوروف، معتبرًا ذلك هجومًا على حرية التعبير والتجمع.",
      "أعرب سنودن عن خيبة أمله في الرئيس الفرنسي إيمانويل ماكرون لاستخدامه تكتيكات للوصول إلى الاتصالات الخاصة، مما يعتقد أنه يقوض فرنسا والمعايير العالمية."
    ],
    "commentSummary": [
      "إدوارد سنودن وصف اعتقال مؤسس تليجرام بافيل دوروف بأنه هجوم على حقوق الإنسان الأساسية.",
      "يدور النقاش حول امتثال تطبيقات المراسلة لأوامر التفتيش والاستدعاءات القانونية، مع مقارنة رفض تيليجرام للتعاون مع تقديم سيجنال الحد الأدنى من البيانات.",
      "يواجه دوروف عدة تهم، بما في ذلك التواطؤ في نشر مواد إباحية للأطفال ورفض تقديم المعلومات اللازمة للسلطات، مما يثير مخاوف قانونية وأخلاقية كبيرة."
    ],
    "points": 130,
    "commentCount": 249,
    "retryCount": 0,
    "time": 1724700256
  },
  {
    "id": 41363231,
    "title": "نهاية النهاية",
    "originLink": "https://www.finalemusic.com/blog/end-of-finale-new-journey-dorico-letter-from-president/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41363231",
    "commentBody": "",
    "originSummary": [
      "أعلنت شركة كودا ميوزيك تكنولوجيز (التي أصبحت الآن مايك ميوزيك) عن إنهاء تطوير برنامج فينالي، وهو برنامج رائد في تدوين الموسيقى، بسبب تطور التكنولوجيا وتعقيد الصيانة.",
      "اعتبارًا من الآن، لن يتم إجراء أي تحديثات أخرى، ولا يمكن شراء أو ترقية Finale؛ وبدءًا من أغسطس 2025، لن يمكن تفعيله على الأجهزة الجديدة أو إعادة تفعيله، وستنتهي خدمات الدعم الفني.",
      "تعاونت شركة MakeMusic مع Steinberg لتقديم خصم حصري لمستخدمي Finale على برنامج Dorico Pro، وهو برنامج تدوين موسيقي جديد بمعايير الصناعة، متاح بسعر 149 دولارًا (السعر التجزئة 579 دولارًا)."
    ],
    "commentSummary": [
      "ستتوقف شركة MakeMusic، المسؤولة عن برنامج Finale، عن السماح بتثبيتات جديدة للبرنامج بعد عام، مما يعني فعليًا انتهاء صلاحيته على الأجهزة الجديدة.",
      "تعاونت شركة MakeMusic مع Steinberg لتقديم خصم على Dorico Pro، مقترحة خطة انتقالية لمستخدمي Finale الحاليين.",
      "يُنصح المستخدمون بتحويل ملفات Finale الخاصة بهم إلى MusicXML، وهو تنسيق مفتوح، حيث سيكون من المستحيل إجراء التثبيتات والتفعيلات المستقبلية."
    ],
    "points": 125,
    "commentCount": 117,
    "retryCount": 0,
    "time": 1724715261
  },
  {
    "id": 41366436,
    "title": "المفاعلات النووية على عمق ميل تحت الأرض تعد بتوفير طاقة آمنة ورخيصة",
    "originLink": "https://newatlas.com/energy/underground-nuclear-reactors/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41366436",
    "commentBody": "",
    "originSummary": [
      "تقترح شركة ديب فيشن الناشئة مفاعلًا نوويًا بعرض 30 بوصة يتم وضعه على عمق ميل تحت الأرض لمعالجة القضايا الاقتصادية والسلامة في الطاقة النووية.",
      "يعتمد المفاعل على مفاعل الماء المضغوط التقليدي (PWR)، ويعمل عند ضغط 160 جو ودرجة حرارة 315 درجة مئوية (600 درجة فهرنهايت)، مستخدمًا نظام تبريد سلبي ووزن عمود الماء للضغط.",
      "يلغي هذا التصميم الحاجة إلى الهندسة المدنية المكلفة وهياكل الاحتواء، ويمكن استرجاع المفاعل للفحص أو الصيانة في غضون ساعات؛ حاليًا، شركة ديب فيجن في مرحلة مراجعة ما قبل التقديم مع وزارة الطاقة."
    ],
    "commentSummary": [
      "يقترح مفهوم جديد بناء مفاعلات نووية على عمق ميل تحت الأرض لتعزيز السلامة وتقليل التكاليف.",
      "على الرغم من أن المفاعلات النووية الحالية آمنة للغاية، إلا أن مخاوف السلامة العامة لا تزال تعيق بنائها.",
      "قد تعزز فكرة دفن المفاعلات في أعماق الأرض بشكل غير مقصود التصور بأن الطاقة النووية شديدة الخطورة."
    ],
    "points": 124,
    "commentCount": 250,
    "retryCount": 0,
    "time": 1724758585
  },
  {
    "id": 41366304,
    "title": "لماذا تعاني اليابان من نقص في الأرز رغم المحاصيل الطبيعية؟",
    "originLink": "https://mainichi.jp/english/articles/20240823/p2a/00m/0bu/024000c",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41366304",
    "commentBody": "",
    "originSummary": [
      "تواجه اليابان نقصًا في الأرز وارتفاعًا في الأسعار على الرغم من المحاصيل الطبيعية بسبب سياسة تقليص المساحات المزروعة التي تهدف إلى التحكم في أسعار السوق.",
      "هذه السياسة، التي تم تطبيقها لأكثر من 50 عامًا، تحفز المزارعين على التحول إلى محاصيل أخرى، مما يؤدي إلى إدارة مشددة لإنتاج الأرز وتعرضه لتقلبات الطلب.",
      "يقترح الخبراء إلغاء السياسة، وزيادة إنتاج الأرز، وتعزيز الصادرات لتعزيز الأمن الغذائي وفائدة المستهلكين."
    ],
    "commentSummary": [
      "تشهد اليابان نقصًا في الأرز على الرغم من المحاصيل الطبيعية بسبب السياسات الحكومية التي تحفز المزارعين على تقليل الإنتاج للحفاظ على الأسعار مرتفعة.",
      "تحد هذه السياسة التي تبلغ من العمر 60 عامًا من العرض، مما يؤدي إلى أن أي زيادة طفيفة في الطلب، مثل تلك الناتجة عن السياحة، تتسبب في حدوث نقص وارتفاع الأسعار.",
      "يقترح النقاد أن تتخلى اليابان عن هذه السياسة لزيادة الإنتاج، مما قد يجعلها مصدرًا رئيسيًا للأرز ويحسن الأمن الغذائي."
    ],
    "points": 119,
    "commentCount": 151,
    "retryCount": 0,
    "time": 1724757582
  }
]
