[
  {
    "id": 41863061,
    "title": "Οι υπολογιστές με AI δεν είναι καλοί στο AI: Η CPU νικά την NPU",
    "originLink": "https://github.com/usefulsensors/qc_npu_benchmark",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41863061",
    "commentBody": "",
    "originSummary": [
      "Η αξιολόγηση της Μονάδας Νευρωνικής Επεξεργασίας (NPU) της Qualcomm σε ένα Microsoft Surface Tablet αποκάλυψε απόδοση μόλις 1,3% των διαφημιζόμενων 45 Teraops/s, επιτυγχάνοντας μόνο 573 δισεκατομμύρια λειτουργίες ανά δευτερόλεπτο.",
      "Οι δοκιμές, οι οποίες περιλάμβαναν πολλαπλασιασμούς μητρών παρόμοιους με αυτούς στα μοντέλα μετασχηματιστών, έδειξαν ότι η NPU αποδίδει πιο αργά από την CPU, παρά τη χρήση εργαλείων όπως το Python, το Cmake και το Visual Studio.",
      "Διάφοροι παράγοντες όπως οι ρυθμίσεις ισχύος, η τοπολογία του μοντέλου και τα σφάλματα διαμόρφωσης ελήφθησαν υπόψη, υποδεικνύοντας ότι η απόδοση του NPU είναι σημαντικά χαμηλότερη από το διαφημιζόμενο δυναμικό του."
    ],
    "commentSummary": [
      "Οι υπολογιστές AI που χρησιμοποιούν τη Μονάδα Νευρωνικής Επεξεργασίας (NPU) της Qualcomm δεν ανταποκρίνονται στις προσδοκίες απόδοσης, με τους επεξεργαστές (CPUs) συχνά να υπερέχουν των NPU.",
      "Η NPU είναι σχεδιασμένη για ενεργειακή απόδοση παρά για ταχύτητα, οδηγώντας σε ένα ελάχιστο κενό απόδοσης μεταξύ CPU και GPU, υποδεικνύοντας πιθανές αναποτελεσματικότητες.",
      "Η τρέχουσα υλοποίηση των NPUs μπορεί να μην είναι πλήρως βελτιστοποιημένη, υπογραμμίζοντας την ανάγκη για βελτιωμένη υποστήριξη και βελτιστοποίηση για να αξιοποιηθούν τα αναμενόμενα οφέλη εξοικονόμησης ενέργειας."
    ],
    "points": 460,
    "commentCount": 264,
    "retryCount": 0,
    "time": 1729107842
  },
  {
    "id": 41870040,
    "title": "Το νέο εργαλείο περιστροφής εικόνας της Adobe είναι ένα από τα πιο εντυπωσιακά εργαλεία τεχνητής νοημοσύνης που έχουμε δει.",
    "originLink": "https://www.creativebloq.com/design/adobes-new-image-rotation-tool-is-one-of-the-most-impressive-ai-concepts-weve-seen",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41870040",
    "commentBody": "",
    "originSummary": [
      "Η Adobe παρουσίασε το 'Project Turntable' στο συνέδριο MAX, ένα εργαλείο που βασίζεται στην τεχνητή νοημοσύνη και επιτρέπει στους χρήστες να περιστρέφουν δισδιάστατα διανυσματικά γραφικά σε 3D, διατηρώντας την εμφάνισή τους ως 2D.",
      "Το εργαλείο μπορεί να συμπληρώσει έξυπνα τις ελλείπουσες λεπτομέρειες, όπως να προσθέσει πόδια σε ένα άλογο όταν η εικόνα περιστρέφεται, επιδεικνύοντας προηγμένες δυνατότητες τεχνητής νοημοσύνης.",
      "Η Adobe αποκάλυψε πάνω από 100 νέες δυνατότητες αυτή την εβδομάδα, υπογραμμίζοντας ένα σημαντικό άλμα στην τεχνολογία AI, αν και δεν είναι σαφές αν το 'Project Turntable' θα είναι εμπορικά διαθέσιμο."
    ],
    "commentSummary": [
      "Η Adobe έχει εισαγάγει ένα νέο εργαλείο περιστροφής εικόνας με τεχνητή νοημοσύνη που επιτρέπει την περιστροφή δισδιάστατων διανυσματικών γραφικών σε τρισδιάστατο χώρο, καλύπτοντας πρακτικές ανάγκες των χρηστών.",
      "Το εργαλείο επαινείται για την καινοτομία του, σε αντίθεση με άλλες τεχνολογικές εταιρείες που συχνά επικεντρώνονται στην τεχνητή νοημοσύνη για να προσελκύσουν επενδυτές παρά για το όφελος των χρηστών.",
      "Παρά την κριτική που έχει δεχθεί η Adobe για τις επιχειρηματικές της πρακτικές, το εργαλείο θεωρείται μια έξυπνη κίνηση, ιδιαίτερα επωφελής για τους εικονογράφους, τονίζοντας την ισορροπία μεταξύ καινοτομίας και σχεδιασμού με επίκεντρο τον χρήστη στην ανάπτυξη της τεχνητής νοημοσύνης."
    ],
    "points": 440,
    "commentCount": 163,
    "retryCount": 0,
    "time": 1729175478
  },
  {
    "id": 41864632,
    "title": "Η χρήση του Cloudflare στην ιστοσελίδα σας θα μπορούσε να μπλοκάρει τους χρήστες RSS.",
    "originLink": "https://openrss.org/blog/using-cloudflare-on-your-website-could-be-blocking-rss-users",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41864632",
    "commentBody": "",
    "originSummary": [
      "Η λειτουργία Bot Fight Mode και οι δυνατότητες αποκλεισμού AI scraper της Cloudflare μπορούν να αποκλείσουν ακούσια νόμιμους αναγνώστες RSS, επηρεάζοντας τη λειτουργικότητά τους. - Οι χρήστες μπορούν να επιτρέψουν την πρόσβαση στους αναγνώστες RSS αναγνωρίζοντας τον χρήστη-πράκτορα ή τη διεύθυνση IP τους στον πίνακα ελέγχου της Cloudflare, αν και αυτή η διαδικασία είναι δύσκολη και αναξιόπιστη. - Η Open RSS, μια μη κερδοσκοπική οργάνωση, προτείνει δωρεές για την υποστήριξη της υπηρεσίας τους, υπογραμμίζοντας την ανάγκη για τη Cloudflare να βελτιώσει το σύστημά της για να αποτρέψει τον αποκλεισμό των αναγνωστών RSS."
    ],
    "commentSummary": [
      "Τα μέτρα ασφαλείας της Cloudflare εμποδίζουν ακούσια τους χρήστες RSS, επηρεάζοντας υπηρεσίες όπως το NewsBlur, έναν ανοιχτού κώδικα αναγνώστη RSS, προκαλώντας σφάλματα 403.",
      "Παρά το γεγονός ότι βρίσκεται στη λίστα επαληθευμένων bots της Cloudflare, το NewsBlur και άλλοι αναγνώστες RSS αντιμετωπίζουν προκλήσεις λόγω της προστασίας από bots της Cloudflare, η οποία συχνά μπλοκάρει νόμιμη κίνηση RSS.",
      "Οι προτεινόμενες λύσεις περιλαμβάνουν την προσθήκη των URL των RSS στη λίστα επιτρεπόμενων ή την απενεργοποίηση των ελέγχων bot για τις ροές RSS, αλλά οι προεπιλεγμένες ρυθμίσεις του Cloudflare συνεχίζουν να δημιουργούν προβλήματα, εγείροντας ανησυχίες σχετικά με την ιδιωτικότητα και την προσβασιμότητα στο διαδίκτυο."
    ],
    "points": 415,
    "commentCount": 195,
    "retryCount": 0,
    "time": 1729118797
  },
  {
    "id": 41866802,
    "title": "Διαφυγή από το Chrome Sandbox μέσω DevTools",
    "originLink": "https://ading.dev/blog/posts/chrome_sandbox_escape.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41866802",
    "commentBody": "",
    "originSummary": [
      "Δύο ευπάθειες, CVE-2024-6778 και CVE-2024-5836, ανακαλύφθηκαν στον περιηγητή ιστού Chromium, επιτρέποντας την απόδραση από το sandbox μιας επέκτασης περιηγητή και επιτρέποντας την εκτέλεση εντολών κελύφους στον υπολογιστή ενός χρήστη.",
      "Οι ευπάθειες βρέθηκαν στα συστήματα WebUI και πολιτικής επιχειρήσεων του Chromium, περιλαμβάνοντας χειρισμό της σελίδας chrome://policy και της λειτουργίας Browser Switcher, καθώς και παράκαμψη περιορισμών χρησιμοποιώντας το API chrome.devtools.inspectedWindow.",
      "Η Google κατηγοριοποίησε αυτές τις ευπάθειες ως υψηλής σοβαρότητας, επιβράβευσε τον ερευνητή με $20,000 και εφάρμοσε διορθώσεις, υπογραμμίζοντας την ανάγκη για λεπτομερείς ελέγχους ασφαλείας του παλιού κώδικα και των μη τεκμηριωμένων χαρακτηριστικών."
    ],
    "commentSummary": [
      "Ένας μαθητής λυκείου εντόπισε μια ευπάθεια στα DevTools του Chrome, επιτρέποντας την απόδραση από το sandbox του προγράμματος περιήγησης, το οποίο είναι ένας μηχανισμός ασφαλείας για την απομόνωση του περιεχομένου του ιστού.",
      "Η εκμετάλλευση απαιτεί αλληλεπίδραση από τον χρήστη, όπως η εγκατάσταση μιας επέκτασης και το άνοιγμα των DevTools, και επηρεάζει μόνο τις εκδόσεις Chromium και Chrome Canary, όχι τις σταθερές εκδόσεις του Chrome.",
      "Το περιστατικό προκαλεί συζήτηση σχετικά με τα προγράμματα επιβράβευσης εντοπισμού σφαλμάτων, με ορισμένους να υποστηρίζουν υψηλότερες αμοιβές για να αποτρέψουν την πώληση εκμεταλλεύσεων στη μαύρη αγορά, ενώ άλλοι τονίζουν τους ηθικούς κινδύνους της πώλησης σε εγκληματίες."
    ],
    "points": 346,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1729144504
  },
  {
    "id": 41866328,
    "title": "Η αντίποινα του WordPress επηρεάζει την κοινότητα",
    "originLink": "https://lwn.net/SubscriberLink/993895/c0438e0ee9382c5f/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41866328",
    "commentBody": "",
    "originSummary": [
      "Η σύγκρουση μεταξύ της Automattic και της WP Engine προκαλεί αναταραχή στην κοινότητα του WordPress, με τον CEO της Automattic, Matt Mullenweg, να ανταποδίδει στην WP Engine δημιουργώντας μια εχθρική διακλάδωση ενός πρόσθετου.",
      "Η WP Engine έχει καταθέσει αγωγή κατά της Automattic, οδηγώντας σε μια διχαστική ατμόσφαιρα όπου οι συνεισφέροντες πρέπει να επιλέξουν πλευρές, και κάποιοι αντιμετωπίζουν απαγορεύσεις για την αμφισβήτηση πολιτικών.",
      "Αυτή η κατάσταση υπογραμμίζει τις προκλήσεις διακυβέρνησης και εμπορευματοποίησης σε έργα ανοιχτού κώδικα, εγείροντας ανησυχίες για το μέλλον του WordPress και τη δυναμική της κοινότητας."
    ],
    "commentSummary": [
      "Η κοινότητα του WordPress βιώνει αναταραχή λόγω κατηγοριών εναντίον του Matt Mullenweg ότι χρησιμοποιεί το Ίδρυμα WordPress για προσωπικά έργα αντί να διατηρεί την ανεξαρτησία του.",
      "Αμφιλεγόμενες ενέργειες του Mullenweg, όπως η ανάληψη ενός δημοφιλούς πρόσθετου και η απαγόρευση του WP Engine από το WordPress.org, έχουν οδηγήσει σε σημαντική αντίδραση.",
      "Η Automattic, η εταιρεία πίσω από το WordPress, προσέφερε εξαγορές σε υπαλλήλους που διαφωνούσαν με τις ενέργειες του Mullenweg, προκαλώντας συζητήσεις για τη διακυβέρνηση ανοιχτού κώδικα και τη σχέση WordPress-Automattic."
    ],
    "points": 221,
    "commentCount": 137,
    "retryCount": 0,
    "time": 1729138011
  },
  {
    "id": 41869460,
    "title": "Ανάπτυξη παιχνιδιών σε Lisp. Μέρος 2: Υπόγεια και Διεπαφές",
    "originLink": "https://gitlab.com/lockie/cl-fast-ecs/-/wikis/tutorial-2",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41869460",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Το άρθρο \"Gamedev in Lisp Part 2: Dungeons and Interfaces\" στο GitLab επαινείται για την καθαρότητά του, το βάθος και τις ολοκληρωμένες οδηγίες του, που περιλαμβάνουν δείγματα κώδικα και οπτικά βοηθήματα.",
      "Καλύπτει τη διαχείριση κατασκευών σε πολλαπλά λειτουργικά συστήματα και παρέχει πληροφορίες για την ιστορία της Lisp και τις εφαρμογές της στην ανάπτυξη παιχνιδιών.",
      "Η συζήτηση γύρω από το άρθρο αναδεικνύει την ευελιξία και την πολυπλοκότητα της Lisp, με αναγνώστες να μοιράζονται τα έργα και τις εμπειρίες τους, ενώ κάποιοι εκφράζουν μια νέα εκτίμηση για τη γλώσσα."
    ],
    "points": 194,
    "commentCount": 31,
    "retryCount": 0,
    "time": 1729171585
  },
  {
    "id": 41871375,
    "title": "Κροκινόλ",
    "originLink": "https://pudding.cool/2024/10/crokinole/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41871375",
    "commentBody": "",
    "originSummary": [
      "Τον Οκτώβριο του 2024, οι Connor Reinman και Jason Slater, διάσημοι παίκτες του Crokinole, πέτυχαν διπλούς τέλειους γύρους στους ημιτελικούς του Παγκόσμιου Πρωταθλήματος Crokinole, ένα σπάνιο κατόρθωμα με πιθανότητες 1 στις 277 γύρους.",
      "Το Crokinole είναι ένα επιτραπέζιο παιχνίδι από το Οντάριο του Καναδά, παρόμοιο με το shuffleboard και το curling, όπου οι παίκτες πετούν δίσκους σε περιοχές βαθμολόγησης, στοχεύοντας σε μια κεντρική τρύπα που αξίζει 20 πόντους.",
      "Το παιχνίδι κερδίζει διεθνή δημοτικότητα, αν και δεν έχει ακόμα αναγνωριστεί ως Ολυμπιακό άθλημα."
    ],
    "commentSummary": [
      "Το Crokinole είναι ένα παραδοσιακό επιτραπέζιο παιχνίδι με πλούσια ιστορία, ιδιαίτερα δημοφιλές στον Καναδά, και συχνά παίζεται σε χειροποίητες σανίδες που περνούν από γενιά σε γενιά.",
      "Το παιχνίδι είναι απτικό και κοινωνικό, παρόμοιο με το shuffleboard ή το curling, και μπορεί να παιχτεί σε ένα μικρό τραπέζι, καθιστώντας το προσβάσιμο και ευχάριστο για όλες τις ηλικίες.",
      "Ψηφιακές εκδόσεις και προσαρμογές, όπως το Crokicurl, ένας συνδυασμός του Crokinole και του curling, έχουν εμφανιστεί, επεκτείνοντας την εμβέλεια και την απήχησή του στην κοινότητα των επιτραπέζιων παιχνιδιών."
    ],
    "points": 160,
    "commentCount": 60,
    "retryCount": 0,
    "time": 1729184089
  },
  {
    "id": 41868683,
    "title": "Οι γάτες είναι (σχεδόν) υγρές",
    "originLink": "https://www.cell.com/iscience/fulltext/S2589-0042(24)02024-8",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41868683",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Οι γάτες διαθέτουν υψηλό επίπεδο προσαρμοστικότητας, που τους επιτρέπει να κινούνται με ευκολία σε στενούς χώρους, σε αντίθεση με τους σκύλους.",
      "Οι ευαίσθητες τρίχες τους, γνωστές ως δονήσεις, και οι ευέλικτες σπονδυλικές στήλες τους βοηθούν στην ευκινησία τους και στην ικανότητά τους να κινούνται μέσα από στενούς χώρους.",
      "Η συμπεριφορά και τα φυσικά χαρακτηριστικά των γατών διαμορφώνονται από τον διπλό τους ρόλο ως θηρευτές και θηράματα, αναζητώντας κλειστούς χώρους για ασφάλεια και κυνήγι, συμβάλλοντας στις ρευστές, υγρές κινήσεις τους."
    ],
    "points": 153,
    "commentCount": 97,
    "retryCount": 0,
    "time": 1729165380
  },
  {
    "id": 41863278,
    "title": "Θα πρέπει να συνομιλήσουμε κι εμείς; Ανάλυση Ασφαλείας του Πρωτοκόλλου Κρυπτογράφησης Mmtls του WeChat",
    "originLink": "https://citizenlab.ca/2024/10/should-we-chat-too-security-analysis-of-wechats-mmtls-encryption-protocol/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41863278",
    "commentBody": "",
    "originSummary": [
      "Η αναφορά αποτελεί την πρώτη δημόσια ανάλυση του πρωτοκόλλου κρυπτογράφησης MMTLS του WeChat, εντοπίζοντας σημαντικές αδυναμίες ασφαλείας λόγω προσαρμοσμένων κρυπτογραφικών τροποποιήσεων. - Θέματα όπως οι ντετερμινιστικοί Αρχικοί Διανύσματα (IVs) και η έλλειψη προόδου μυστικότητας επισημαίνονται, υποδεικνύοντας αποτυχία υιοθέτησης των βέλτιστων πρακτικών κρυπτογράφησης στις κινεζικές εφαρμογές. - Οι συγγραφείς προτείνουν τη μετάβαση σε πρότυπα πρωτόκολλα κρυπτογράφησης όπως το TLS ή το QUIC+TLS για ενισχυμένη ασφάλεια και παρέχουν εργαλεία και τεκμηρίωση για περαιτέρω έρευνα σχετικά με την ασφάλεια του WeChat."
    ],
    "commentSummary": [
      "Το άρθρο επισημαίνει ανησυχίες για την ασφάλεια του πρωτοκόλλου κρυπτογράφησης Mmtls του WeChat, υποδεικνύοντας τις αδυναμίες και τις πιθανές ευπάθειές του.",
      "Υποδηλώνει ότι αυτές οι ευπάθειες πιθανότατα οφείλονται σε υπερβολικά επιβαρυμένους προγραμματιστές παρά σε κυβερνητική εντολή, παρά την άμεση πρόσβαση της κινεζικής κυβέρνησης στο backend του WeChat.",
      "Η συζήτηση εγείρει ευρύτερα ζητήματα σχετικά με τη χρήση μη τυποποιημένων πρωτοκόλλων κρυπτογράφησης και τις προκλήσεις της διατήρησης ασφαλών επικοινωνιών εν μέσω πιθανής κυβερνητικής παρακολούθησης."
    ],
    "points": 150,
    "commentCount": 83,
    "retryCount": 0,
    "time": 1729109218
  },
  {
    "id": 41866742,
    "title": "OpenVMM – Ένα Νέο VMM για Windows και Linux, Γραμμένο σε Rust",
    "originLink": "https://github.com/microsoft/openvmm",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41866742",
    "commentBody": "",
    "originSummary": [
      "Το OpenVMM είναι ένας αρθρωτός και διαλειτουργικός Επόπτης Εικονικής Μηχανής (VMM) που έχει αναπτυχθεί στη γλώσσα προγραμματισμού Rust.",
      "Ενθαρρύνονται οι συνεισφορές στο OpenVMM, αλλά οι περισσότερες απαιτούν την υπογραφή μιας Συμφωνίας Άδειας Χρήσης Συνεισφέροντα (CLA), η οποία διευκολύνεται από ένα bot CLA κατά τη διάρκεια των αιτημάτων έλξης.",
      "Το έργο συμμορφώνεται με τον Κώδικα Συμπεριφοράς Ανοιχτού Κώδικα της Microsoft, και ερωτήσεις μπορούν να απευθύνονται στο opencode@microsoft.com."
    ],
    "commentSummary": [
      "Το OpenVMM είναι ένας νέος Επόπτης Εικονικής Μηχανής (VMM) για Windows και Linux, αναπτυγμένος σε Rust, δίνοντας έμφαση στα χαρακτηριστικά ασφαλείας σε σχέση με τις παραδοσιακές γλώσσες όπως η C/C++.",
      "Το έργο επικεντρώνεται στο OpenHCL ως παραβίζορ, αλλά στερείται φινέτσας σε παραδοσιακά περιβάλλοντα υποδοχής και δεν εγγυάται τη σταθερότητα του API.",
      "Το OpenVMM χρησιμοποιείται από τους υπαλλήλους της Microsoft και είναι ενσωματωμένο στην υποδομή του Azure, υπογραμμίζοντας τη σημασία του σε περιβάλλοντα υπολογιστικού νέφους."
    ],
    "points": 142,
    "commentCount": 107,
    "retryCount": 0,
    "time": 1729143726
  },
  {
    "id": 41863398,
    "title": "Αυτόματες ομαλές παραγώγοι Ν-ου τάξης θορυβώδους δεδομένων",
    "originLink": "https://github.com/hugohadfield/kalmangrad",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41863398",
    "commentBody": "",
    "originSummary": [
      "Το έργο στοχεύει στη διαφοροποίηση των δεδομένων αισθητήρων για ανάλυση χρησιμοποιώντας φίλτρα Kalman, γνωστά για την επαναδειγματοληψία σε σταθερό ρυθμό και την εξομάλυνση των ακραίων τιμών.",
      "Μια νέα βιβλιοθήκη για φιλτράρισμα/εξομάλυνση με βάση το numpy, με το όνομα Kalmangrad, έχει αναπτυχθεί και είναι διαθέσιμη στο GitHub.",
      "Ο προγραμματιστής είναι ανοιχτός σε σχόλια, αιτήματα για νέες λειτουργίες και αναφορές σφαλμάτων για να βελτιώσει περαιτέρω τη βιβλιοθήκη."
    ],
    "commentSummary": [
      "Το έργο επικεντρώνεται στη διαφοροποίηση των θορυβωδών δεδομένων αισθητήρων χρησιμοποιώντας φίλτρα Kalman, τα οποία προτιμώνται για την εξομάλυνση και την επαναδειγματοληψία.",
      "Αναπτύχθηκε μια βιβλιοθήκη φιλτραρίσματος Bayesian για να αντιμετωπιστεί αυτή η πρόκληση, με τη δυνατότητα επέκτασης χαρακτηριστικών βάσει της ανατροφοδότησης των χρηστών.",
      "Το έργο είναι εφαρμόσιμο σε τομείς όπως η παρακολούθηση της ποιότητας του αέρα και τα αυτοκινούμενα αυτοκίνητα, και είναι χρήσιμο για τον υπολογισμό παραγώγων σε θορυβώδη, μη ομοιόμορφα δειγματοληπτημένα δεδομένα."
    ],
    "points": 137,
    "commentCount": 39,
    "retryCount": 0,
    "time": 1729109866
  }
]
