[
  {
    "id": 41863061,
    "title": "AI-tietokoneet eivät ole hyviä tekoälyssä: CPU voittaa NPU:n",
    "originLink": "https://github.com/usefulsensors/qc_npu_benchmark",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41863061",
    "commentBody": "",
    "originSummary": [
      "Qualcommin neuroprosessointiyksikön (NPU) vertailuarviointi Microsoft Surface -tabletilla paljasti suorituskyvyn olevan vain 1,3 % mainostetusta 45 teraoperaatiosta sekunnissa, saavuttaen vain 573 miljardia operaatiota sekunnissa.",
      "Testit, jotka sisälsivät matriisikertolaskuja vastaavia kuin transformer-malleissa, osoittivat NPU:n toimivan hitaammin kuin CPU, vaikka käytössä oli työkaluja kuten Python, Cmake ja Visual Studio.",
      "Erilaisia tekijöitä, kuten tehoasetuksia, mallin topologiaa ja konfiguraatiovirheitä, otettiin huomioon, mikä osoittaa, että NPU:n suorituskyky on huomattavasti sen markkinoidun potentiaalin alapuolella."
    ],
    "commentSummary": [
      "Qualcommin Neural Processing Unit (NPU) -yksikköä hyödyntävät tekoälytietokoneet eivät täytä suorituskykyodotuksia, sillä suorittimet (CPU) ylittävät usein NPU:iden suorituskyvyn.",
      "NPU on suunniteltu energiatehokkuutta silmällä pitäen pikemminkin kuin nopeutta, mikä johtaa vähäiseen suorituskykyeroon CPU:n ja GPU:n välillä, mikä viittaa mahdollisiin tehottomuuksiin.",
      "Nykyinen NPU:iden toteutus ei välttämättä ole täysin optimoitu, mikä korostaa tarvetta parantaa tukea ja optimointia niiden aiottujen virransäästöetujen hyödyntämiseksi."
    ],
    "points": 460,
    "commentCount": 264,
    "retryCount": 0,
    "time": 1729107842
  },
  {
    "id": 41870040,
    "title": "Adoben uusi kuvan kiertotyökalu on yksi vaikuttavimmista tekoälytyökaluista, joita on nähty",
    "originLink": "https://www.creativebloq.com/design/adobes-new-image-rotation-tool-is-one-of-the-most-impressive-ai-concepts-weve-seen",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41870040",
    "commentBody": "",
    "originSummary": [
      "Adobe esitteli MAX-konferenssissa 'Project Turntable' -nimisen työkalun, joka on tekoälyohjattu ja mahdollistaa käyttäjien pyörittää 2D-vektorigrafiikkaa 3D-muodossa säilyttäen sen 2D-ulkonäön.",
      "Työkalu voi älykkäästi täydentää puuttuvia yksityiskohtia, kuten lisätä hevoselle jalat, kun kuvaa käännetään, mikä osoittaa kehittyneitä tekoälyominaisuuksia.",
      "Adobe on julkistanut tällä viikolla yli 100 uutta ominaisuutta, mikä korostaa merkittävää harppausta tekoälyteknologiassa, vaikka ei olekaan selvää, tuleeko 'Project Turntable' kaupallisesti saataville."
    ],
    "commentSummary": [
      "Adobe on esitellyt uuden tekoälypohjaisen kuvan kiertotyökalun, joka mahdollistaa 2D-vektorigrafiikan kiertämisen 3D-tilassa, vastaten käytännön käyttäjätarpeisiin.",
      "Työkalua ylistetään sen innovatiivisuudesta, mikä on vastakohta muille teknologiayrityksille, jotka usein keskittyvät tekoälyyn sijoittajien houkuttelemiseksi käyttäjien hyötyjen sijaan.",
      "Huolimatta joistakin kritiikeistä Adoben liiketoimintakäytäntöjä kohtaan, työkalua pidetään älykkäänä siirtona, joka on erityisen hyödyllinen kuvittajille, korostaen innovaation ja käyttäjäkeskeisen suunnittelun tasapainoa tekoälyn kehityksessä."
    ],
    "points": 440,
    "commentCount": 163,
    "retryCount": 0,
    "time": 1729175478
  },
  {
    "id": 41864632,
    "title": "Cloudflaren käyttäminen verkkosivustollasi saattaa estää RSS-käyttäjiä",
    "originLink": "https://openrss.org/blog/using-cloudflare-on-your-website-could-be-blocking-rss-users",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41864632",
    "commentBody": "",
    "originSummary": [
      "Cloudflaren Bot Fight Mode ja tekoälyyn perustuvat kaavintojen estotoiminnot voivat tahattomasti estää laillisia RSS-lukijoita, mikä vaikuttaa niiden toimivuuteen. - Käyttäjät voivat lisätä RSS-lukijat sallittujen listalle tunnistamalla niiden käyttäjäagentin tai IP-osoitteen Cloudflaren hallintapaneelissa, vaikka tämä prosessi onkin työläs ja epäluotettava. - Open RSS, voittoa tavoittelematon järjestö, ehdottaa lahjoituksia palvelunsa tukemiseksi, korostaen tarvetta Cloudflaren järjestelmän parantamiselle estääkseen RSS-lukijoiden estämisen."
    ],
    "commentSummary": [
      "Cloudflaren turvatoimet estävät tahattomasti RSS-käyttäjiä, mikä vaikuttaa palveluihin kuten NewsBlur, avoimen lähdekoodin RSS-lukija, aiheuttamalla 403-virheitä.",
      "Vaikka NewsBlur ja muut RSS-lukijat ovat Cloudflaren vahvistettujen bottien listalla, ne kohtaavat haasteita Cloudflaren bottisuojauksen vuoksi, joka usein estää laillisen RSS-liikenteen.",
      "Esitettyjä ratkaisuja ovat esimerkiksi RSS-URL-osoitteiden salliminen tai bottitarkistusten poistaminen käytöstä RSS-syötteille, mutta Cloudflaren oletusasetukset aiheuttavat edelleen ongelmia, mikä herättää huolta verkkoyksityisyydestä ja saavutettavuudesta."
    ],
    "points": 415,
    "commentCount": 195,
    "retryCount": 0,
    "time": 1729118797
  },
  {
    "id": 41866802,
    "title": "Poistuminen Chrome-hiekkalaatikosta DevTools-työkalujen avulla",
    "originLink": "https://ading.dev/blog/posts/chrome_sandbox_escape.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41866802",
    "commentBody": "",
    "originSummary": [
      "Kaksi haavoittuvuutta, CVE-2024-6778 ja CVE-2024-5836, löydettiin Chromium-verkkoselaimesta, mahdollistaen hiekkalaatikosta pakenemisen selainlaajennuksen kautta ja kuorikomentojen suorittamisen käyttäjän tietokoneella.",
      "Haavoittuvuudet löydettiin Chromiumin WebUI- ja yrityspolitiikkajärjestelmistä, ja ne liittyivät chrome://policy-sivun ja Browser Switcher -ominaisuuden manipulointiin sekä rajoitusten kiertämiseen käyttämällä chrome.devtools.inspectedWindow API:a.",
      "Google luokitteli nämä haavoittuvuudet korkean vakavuusasteen mukaisiksi, palkitsi tutkijan 20 000 dollarilla ja toteutti korjauksia korostaen vanhan koodin ja dokumentoimattomien ominaisuuksien perusteellisten turvallisuustarkastusten tarvetta."
    ],
    "commentSummary": [
      "Eräs lukiolainen tunnisti haavoittuvuuden Chromen DevToolsissa, mikä mahdollisti pakenemisen selaimen hiekkalaatikosta, joka on tietoturvamekanismi verkkosisällön eristämiseksi.",
      "Hyväksikäyttö vaatii käyttäjän vuorovaikutusta, kuten laajennuksen asentamista ja DevTools-työkalun avaamista, ja se vaikuttaa vain Chromiumiin ja Chrome Canaryyn, ei vakaaseen Chrome-versioon.",
      "Tapauksen myötä herää keskustelu bugipalkkio-ohjelmista, joissa jotkut kannattavat korkeampia palkkioita estääkseen haavoittuvuuksien myymisen mustassa pörssissä, kun taas toiset korostavat rikollisille myymisen eettisiä riskejä."
    ],
    "points": 346,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1729144504
  },
  {
    "id": 41866328,
    "title": "WordPressin vastatoimet vaikuttavat yhteisöön",
    "originLink": "https://lwn.net/SubscriberLink/993895/c0438e0ee9382c5f/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41866328",
    "commentBody": "",
    "originSummary": [
      "Automatticin ja WP Enginen välinen konflikti aiheuttaa häiriöitä WordPress-yhteisössä, kun Automatticin toimitusjohtaja Matt Mullenweg vastatoimena WP Enginelle luo vihamielisen haaran yhdestä lisäosasta.",
      "WP Engine on nostanut kanteen Automatticia vastaan, mikä on johtanut jakautuneeseen ilmapiiriin, jossa osallistujien on valittava puolensa, ja jotkut kohtaavat kieltoja kyseenalaistaessaan käytäntöjä.",
      "Tämä tilanne korostaa hallinnon ja kaupallistamisen haasteita avoimen lähdekoodin projekteissa, herättäen huolta WordPressin tulevaisuudesta ja yhteisön dynamiikasta."
    ],
    "commentSummary": [
      "WordPress-yhteisössä on levottomuutta syytösten vuoksi, joiden mukaan Matt Mullenweg käyttää WordPress-säätiötä henkilökohtaisiin projekteihin sen sijaan, että säilyttäisi sen riippumattomuuden.",
      "Kiistanalaiset toimet Mullenwegin taholta, kuten suositun lisäosan haltuunotto ja WP Enginen kieltäminen WordPress.orgista, ovat johtaneet merkittävään vastareaktioon.",
      "Automattic, WordPressin taustalla oleva yritys, tarjosi irtisanoutumispaketteja työntekijöille, jotka olivat eri mieltä Mullenwegin toimista, mikä herätti keskusteluja avoimen lähdekoodin hallinnosta ja WordPressin ja Automatticin suhteesta."
    ],
    "points": 221,
    "commentCount": 137,
    "retryCount": 0,
    "time": 1729138011
  },
  {
    "id": 41869460,
    "title": "Pelinkehitys Lispillä. Osa 2: Luolastot ja käyttöliittymät",
    "originLink": "https://gitlab.com/lockie/cl-fast-ecs/-/wikis/tutorial-2",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41869460",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Artikkelia \"Gamedev in Lisp Part 2: Dungeons and Interfaces\" GitLabissa kiitetään sen selkeydestä, syvällisyydestä ja kattavista tutoriaaleista, jotka sisältävät koodiesimerkkejä ja visuaalisia apuvälineitä.",
      "Se käsittelee rakennusten hallintaa useissa käyttöjärjestelmissä ja tarjoaa näkemyksiä Lispin historiasta ja sen sovelluksista pelikehityksessä.",
      "Keskustelu artikkelin ympärillä korostaa Lispin monipuolisuutta ja monimutkaisuutta, kun lukijat jakavat projektejaan ja kokemuksiaan, ja jotkut ilmaisevat uutta arvostusta kieltä kohtaan."
    ],
    "points": 194,
    "commentCount": 31,
    "retryCount": 0,
    "time": 1729171585
  },
  {
    "id": 41871375,
    "title": "Crokinole",
    "originLink": "https://pudding.cool/2024/10/crokinole/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41871375",
    "commentBody": "",
    "originSummary": [
      "Lokakuussa 2024 tunnetut Crokinole-pelaajat Connor Reinman ja Jason Slater saavuttivat kaksinkertaiset täydelliset kierrokset Crokinolen maailmanmestaruuskilpailujen välierissä, mikä on harvinainen saavutus, jonka todennäköisyys on 1:ssä 277 kierroksesta.",
      "Crokinole on pöytäpeli Ontariosta, Kanadasta, joka muistuttaa shuffleboardia ja curlingia. Pelaajat napsauttavat kiekkoja pisteytysalueille, pyrkien keskellä olevaan reikään, josta saa 20 pistettä.",
      "Peli saavuttaa kansainvälistä suosiota, vaikka sitä ei ole vielä tunnustettu olympialajiksi."
    ],
    "commentSummary": [
      "Crokinole on perinteinen lautapeli, jolla on rikas historia ja joka on erityisen suosittu Kanadassa. Sitä pelataan usein käsintehdyillä laudoilla, jotka on siirretty sukupolvelta toiselle.",
      "Peli on taktiilinen ja sosiaalinen, samanlainen kuin curling tai pöytäcurling, ja sitä voidaan pelata pienellä pöydällä, mikä tekee siitä helposti lähestyttävän ja nautittavan kaikenikäisille.",
      "Digitaaliset versiot ja sovellukset, kuten Crokicurl, joka yhdistää Crokinolen ja curlingin, ovat nousseet esiin, laajentaen sen ulottuvuutta ja vetovoimaa lautapeliyhteisössä."
    ],
    "points": 160,
    "commentCount": 60,
    "retryCount": 0,
    "time": 1729184089
  },
  {
    "id": 41868683,
    "title": "Kissat ovat (melkein) nestemäisiä",
    "originLink": "https://www.cell.com/iscience/fulltext/S2589-0042(24)02024-8",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41868683",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Kissat ovat erittäin sopeutumiskykyisiä, mikä mahdollistaa niiden liikkumisen kapeissa tiloissa vaivattomasti, toisin kuin koirat.",
      "Heidän herkät viiksensä, jotka tunnetaan nimellä vibrissae, ja joustavat selkärangansa auttavat heitä ketteryydessä ja kyvyssä liikkua ahtaissa tiloissa.",
      "Kissojen käyttäytymistä ja fyysisiä piirteitä muokkaa niiden kaksoisrooli saalistajina ja saaliina, mikä saa ne etsimään suljettuja tiloja turvaksi ja saalistukseen, ja tämä vaikuttaa niiden sulaviin, nestemäisiin liikkeisiin."
    ],
    "points": 153,
    "commentCount": 97,
    "retryCount": 0,
    "time": 1729165380
  },
  {
    "id": 41863278,
    "title": "Analysoidaanko mekin? WeChatin Mmtls-salausprotokollan turvallisuusanalyysi",
    "originLink": "https://citizenlab.ca/2024/10/should-we-chat-too-security-analysis-of-wechats-mmtls-encryption-protocol/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41863278",
    "commentBody": "",
    "originSummary": [
      "Raportti on ensimmäinen julkinen analyysi WeChatin MMTLS-salausprotokollasta, ja se tunnistaa merkittäviä tietoturvaheikkouksia mukautettujen kryptografisten muutosten vuoksi. - Ongelmat, kuten deterministiset alustusvektorit (IV:t) ja eteenpäin suuntautuvan salaisuuden puute, korostavat kryptografisten parhaiden käytäntöjen laiminlyöntiä kiinalaisissa sovelluksissa. - Tekijät suosittelevat siirtymistä standardeihin salausprotokolliin, kuten TLS tai QUIC+TLS, parannetun turvallisuuden takaamiseksi ja tarjoavat työkaluja ja dokumentaatiota WeChatin tietoturvan jatkotutkimukseen."
    ],
    "commentSummary": [
      "Artikkeli tuo esiin turvallisuushuolia WeChatin Mmtls-salausprotokollan suhteen, korostaen sen heikkouksia ja mahdollisia haavoittuvuuksia.",
      "Se viittaa siihen, että nämä haavoittuvuudet johtuvat todennäköisesti ylikuormitetuista kehittäjistä sen sijaan, että ne olisivat hallituksen määräämiä, huolimatta siitä, että Kiinan hallituksella on suora pääsy WeChatin taustajärjestelmään.",
      "Keskustelu nostaa esiin laajempia kysymyksiä ei-standardi salausprotokollien käytöstä ja haasteista ylläpitää turvallista viestintää mahdollisen hallituksen valvonnan keskellä."
    ],
    "points": 150,
    "commentCount": 83,
    "retryCount": 0,
    "time": 1729109218
  },
  {
    "id": 41866742,
    "title": "OpenVMM – Uusi VMM Windowsille ja Linuxille, kirjoitettu Rustilla",
    "originLink": "https://github.com/microsoft/openvmm",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41866742",
    "commentBody": "",
    "originSummary": [
      "OpenVMM on modulaarinen ja monialustainen virtuaalikoneen valvoja (VMM), joka on kehitetty Rust-ohjelmointikielellä.",
      "OpenVMM:ään kannustetaan tekemään panostuksia, mutta useimmat niistä edellyttävät Contributor License Agreement (CLA) -sopimuksen allekirjoittamista, mikä tapahtuu CLA-botin avulla vetopyyntöjen yhteydessä.",
      "Projekti noudattaa Microsoftin avointa lähdekoodia koskevaa käytännesääntöä, ja tiedustelut voi lähettää osoitteeseen opencode@microsoft.com."
    ],
    "commentSummary": [
      "OpenVMM on uusi Virtual Machine Monitor (VMM) Windowsille ja Linuxille, kehitetty Rust-kielellä, painottaen turvallisuusominaisuuksia perinteisten kielten kuten C/C++ sijaan.",
      "Projekti keskittyy OpenHCL:ään paravisorina, mutta se ei ole hiottu perinteisissä isäntäympäristöissä eikä takaa API:n vakautta.",
      "OpenVMM:ää käyttävät Microsoftin työntekijät, ja se on integroitu Azure-infrastruktuuriin, mikä korostaa sen merkitystä pilvilaskentaympäristöissä."
    ],
    "points": 142,
    "commentCount": 107,
    "retryCount": 0,
    "time": 1729143726
  },
  {
    "id": 41863398,
    "title": "Automaattiset sujuvat N. asteen derivaatat meluisasta datasta",
    "originLink": "https://github.com/hugohadfield/kalmangrad",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41863398",
    "commentBody": "",
    "originSummary": [
      "Projektin tavoitteena on erotella anturidataa analysointia varten käyttämällä Kalman-suodattimia, jotka tunnetaan uudelleennäytteistyksestä yhtenäiseen tahtiin ja poikkeamien tasoittamisesta.",
      "Uusi numpy-pohjainen Bayes-suodatus/tasoittamiskirjasto nimeltä Kalmangrad on kehitetty ja se on saatavilla GitHubissa.",
      "Kehittäjä on avoin palautteelle, ominaisuuspyynnöille ja virheraporteille kirjaston parantamiseksi edelleen."
    ],
    "commentSummary": [
      "Projekti keskittyy erottamaan meluisaa anturidataa Kalman-suodattimien avulla, joita suositaan tasoittamiseen ja uudelleennäytteistämiseen.",
      "Bayesilainen suodatuskirjasto kehitettiin vastaamaan tähän haasteeseen, ja siinä on mahdollisuus laajentaa ominaisuuksia käyttäjäpalautteen perusteella.",
      "Projekti soveltuu aloille, kuten ilmanlaadun seuranta ja itseajavat autot, ja se on hyödyllinen derivaattojen laskemiseen meluisassa, epätasaisesti näytetyssä datassa."
    ],
    "points": 137,
    "commentCount": 39,
    "retryCount": 0,
    "time": 1729109866
  }
]
