[
  {
    "id": 41863061,
    "title": "AI-datorer är inte bra på AI: CPU:n slår NPU:n",
    "originLink": "https://github.com/usefulsensors/qc_npu_benchmark",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41863061",
    "commentBody": "",
    "originSummary": [
      "Benchmarking av Qualcomms Neural Processing Unit (NPU) på en Microsoft Surface-surfplatta visade en prestanda på endast 1,3 % av de utlovade 45 Teraops/s, vilket uppnådde bara 573 miljarder operationer per sekund.",
      "Tester, som inkluderade matrisberäkningar liknande de i transformermodeller, visade att NPU:n presterade långsammare än CPU:n, trots användning av verktyg som Python, Cmake och Visual Studio.",
      "Olika faktorer som ströminställningar, modellens topologi och konfigurationsfel beaktades, vilket indikerar att NPU:ns prestanda är avsevärt under dess marknadsförda potential."
    ],
    "commentSummary": [
      "AI-datorer som använder Qualcomms Neural Processing Unit (NPU) uppfyller inte prestandaförväntningarna, då CPU:er ofta överträffar NPU:er.",
      "NPU:n är utformad för energieffektivitet snarare än hastighet, vilket leder till en minimal prestandaskillnad mellan CPU och GPU, vilket indikerar potentiella ineffektiviteter.",
      "Den nuvarande implementeringen av NPU:er kanske inte är fullt optimerad, vilket betonar behovet av förbättrat stöd och optimering för att utnyttja deras avsedda energibesparande fördelar."
    ],
    "points": 460,
    "commentCount": 264,
    "retryCount": 0,
    "time": 1729107842
  },
  {
    "id": 41870040,
    "title": "Adobes nya verktyg för bildrotation är ett av de mest imponerande AI-verktygen som setts",
    "originLink": "https://www.creativebloq.com/design/adobes-new-image-rotation-tool-is-one-of-the-most-impressive-ai-concepts-weve-seen",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41870040",
    "commentBody": "",
    "originSummary": [
      "Adobe introducerade 'Project Turntable' på MAX-konferensen, ett AI-drivet verktyg som gör det möjligt för användare att rotera 2D-vektorkonst i 3D samtidigt som dess 2D-utseende bevaras.",
      "Verktyget kan intelligent fylla i saknade detaljer, såsom att lägga till ben på en häst när bilden roteras, vilket visar på avancerade AI-funktioner.",
      "Adobe har lanserat över 100 nya funktioner den här veckan, vilket markerar ett betydande framsteg inom AI-teknologi, även om det är oklart om 'Project Turntable' kommer att finnas tillgängligt kommersiellt."
    ],
    "commentSummary": [
      "Adobe har introducerat ett nytt AI-verktyg för bildrotation som gör det möjligt att rotera 2D-vektorgrafik i 3D-utrymme, vilket tillgodoser praktiska användarbehov.",
      "Verktyget beröms för sin innovation, i kontrast till andra teknikföretag som ofta fokuserar på AI för att tilltala investerare snarare än att gynna användarna.",
      "Trots viss kritik mot Adobes affärsmetoder anses verktyget vara ett smart drag, särskilt fördelaktigt för illustratörer, och betonar balansen mellan innovation och användarcentrerad design i AI-utveckling."
    ],
    "points": 440,
    "commentCount": 163,
    "retryCount": 0,
    "time": 1729175478
  },
  {
    "id": 41864632,
    "title": "Att använda Cloudflare på din webbplats kan blockera RSS-användare",
    "originLink": "https://openrss.org/blog/using-cloudflare-on-your-website-could-be-blocking-rss-users",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41864632",
    "commentBody": "",
    "originSummary": [
      "Cloudflares Bot Fight Mode och AI-scraper-blockeringsfunktioner kan oavsiktligt blockera legitima RSS-läsare, vilket påverkar deras funktionalitet. Användare kan vitlista RSS-läsare genom att identifiera deras användaragent eller IP-adress i Cloudflares instrumentpanel, även om denna process är besvärlig och opålitlig. Open RSS, en ideell organisation, föreslår donationer för att stödja deras tjänst och betonar behovet av att Cloudflare förbättrar sitt system för att förhindra blockering av RSS-läsare."
    ],
    "commentSummary": [
      "Cloudflares säkerhetsåtgärder blockerar oavsiktligt RSS-användare, vilket påverkar tjänster som NewsBlur, en öppen källkod RSS-läsare, genom att orsaka 403-fel.",
      "Trots att NewsBlur och andra RSS-läsare finns med på Cloudflares lista över verifierade botar, står de inför utmaningar på grund av Cloudflares bot-skydd, som ofta blockerar legitim RSS-trafik.",
      "Föreslagna lösningar inkluderar att vitlista RSS-URL:er eller inaktivera botkontroller för RSS-flöden, men Cloudflares standardinställningar fortsätter att orsaka problem, vilket väcker oro kring webbens integritet och tillgänglighet."
    ],
    "points": 415,
    "commentCount": 195,
    "retryCount": 0,
    "time": 1729118797
  },
  {
    "id": 41866802,
    "title": "Att undkomma Chrome Sandbox genom DevTools",
    "originLink": "https://ading.dev/blog/posts/chrome_sandbox_escape.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41866802",
    "commentBody": "",
    "originSummary": [
      "Två sårbarheter, CVE-2024-6778 och CVE-2024-5836, upptäcktes i webbläsaren Chromium, vilket möjliggör en sandbox-flykt från en webbläsartillägg och möjliggör exekvering av shell-kommandon på en användares dator.",
      "Svagheterna hittades i Chromiums WebUI och företags policy-system, vilket involverade manipulation av sidan chrome://policy och funktionen Browser Switcher, samt att kringgå restriktioner med hjälp av API:et chrome.devtools.inspectedWindow.",
      "Google klassificerade dessa sårbarheter som hög svårighetsgrad, belönade forskaren med 20 000 dollar och implementerade åtgärder, vilket betonade behovet av noggranna säkerhetskontroller av gammal kod och odokumenterade funktioner."
    ],
    "commentSummary": [
      "Ett gymnasieelev identifierade en sårbarhet i Chromes DevTools, vilket möjliggjorde en flykt från webbläsarens sandbox, som är en säkerhetsmekanism för att isolera webb-innehåll.",
      "Exploiten kräver användarinteraktion, såsom att installera en tillägg och öppna DevTools, och påverkar endast Chromium och Chrome Canary, inte de stabila Chrome-versionerna.",
      "Incidenten väcker debatt om bug bounty-program, där vissa förespråkar högre utbetalningar för att avskräcka från att sälja exploateringar på svarta marknaden, medan andra betonar de etiska riskerna med att sälja till kriminella."
    ],
    "points": 346,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1729144504
  },
  {
    "id": 41866328,
    "title": "WordPress vedergällning påverkar gemenskapen",
    "originLink": "https://lwn.net/SubscriberLink/993895/c0438e0ee9382c5f/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41866328",
    "commentBody": "",
    "originSummary": [
      "Konflikten mellan Automattic och WP Engine orsakar störningar i WordPress-gemenskapen, där Automattics VD, Matt Mullenweg, svarar mot WP Engine genom att skapa en fientlig förgrening av ett plugin.",
      "WP Engine har lämnat in en stämningsansökan mot Automattic, vilket har lett till en splittrad atmosfär där bidragsgivare måste välja sida, och vissa riskerar avstängningar för att ifrågasätta policyer.",
      "Denna situation understryker styrnings- och kommersialiseringsutmaningar i öppen källkodsprojekt, vilket väcker oro för WordPress framtid och gemenskapsdynamik."
    ],
    "commentSummary": [
      "WordPress-gemenskapen upplever oro på grund av anklagelser mot Matt Mullenweg om att använda WordPress Foundation för personliga projekt istället för att upprätthålla dess oberoende.",
      "Kontroversiella åtgärder av Mullenweg, såsom att ta över ett populärt plugin och förbjuda WP Engine från WordPress.org, har lett till betydande motreaktioner.",
      "Automattic, företaget bakom WordPress, erbjöd utköp till anställda som inte höll med om Mullenwegs åtgärder, vilket ledde till diskussioner om öppen källkods-styrning och relationen mellan WordPress och Automattic."
    ],
    "points": 221,
    "commentCount": 137,
    "retryCount": 0,
    "time": 1729138011
  },
  {
    "id": 41869460,
    "title": "Spelutveckling i Lisp. Del 2: Dungeons och gränssnitt",
    "originLink": "https://gitlab.com/lockie/cl-fast-ecs/-/wikis/tutorial-2",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41869460",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Artikeln 'Gamedev in Lisp Part 2: Dungeons and Interfaces' på GitLab beröms för sin klarhet, djup och omfattande handledningar, inklusive kodexempel och visuella hjälpmedel.",
      "Den täcker hantering av builds över flera operativsystem och ger insikter i Lisps historia och dess tillämpningar inom spelutveckling.",
      "Diskussionen kring artikeln belyser Lisps mångsidighet och komplexitet, där läsare delar sina projekt och erfarenheter, och några uttrycker en nyfunnen uppskattning för språket."
    ],
    "points": 194,
    "commentCount": 31,
    "retryCount": 0,
    "time": 1729171585
  },
  {
    "id": 41871375,
    "title": "Crokinole",
    "originLink": "https://pudding.cool/2024/10/crokinole/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41871375",
    "commentBody": "",
    "originSummary": [
      "I oktober 2024 uppnådde Connor Reinman och Jason Slater, kända Crokinole-spelare, dubbla perfekta rundor i semifinalerna vid världsmästerskapet i Crokinole, en sällsynt bedrift med odds på 1 av 277 rundor.",
      "Crokinole är ett bordsspel från Ontario, Kanada, liknande shuffleboard och curling, där spelare knäpper iväg skivor in i poängområden, med målet att träffa ett centralt hål värt 20 poäng.",
      "Spelet vinner internationell popularitet, även om det ännu inte har erkänts som en olympisk sport."
    ],
    "commentSummary": [
      "Crokinole är ett traditionellt brädspel med en rik historia, särskilt populärt i Kanada, och spelas ofta på handgjorda bräden som gått i arv genom generationer.",
      "Spelet är taktilt och socialt, liknande shuffleboard eller curling, och kan spelas på ett litet bord, vilket gör det tillgängligt och roligt för alla åldrar.",
      "Digitala versioner och anpassningar, såsom Crokicurl, en blandning av Crokinole och curling, har dykt upp och utökat dess räckvidd och attraktionskraft inom brädspelsgemenskapen."
    ],
    "points": 160,
    "commentCount": 60,
    "retryCount": 0,
    "time": 1729184089
  },
  {
    "id": 41868683,
    "title": "Katter är (nästan) flytande",
    "originLink": "https://www.cell.com/iscience/fulltext/S2589-0042(24)02024-8",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41868683",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Katter har en hög nivå av anpassningsförmåga, vilket gör att de kan navigera genom trånga utrymmen med lätthet, till skillnad från hundar.",
      "Deras känsliga morrhår, kända som vibrissae, och flexibla ryggar hjälper dem i deras smidighet och förmåga att röra sig genom trånga utrymmen.",
      "Kattens beteende och fysiska egenskaper formas av deras dubbla roll som rovdjur och byte, där de söker slutna utrymmen för säkerhet och jakt, vilket bidrar till deras flytande, vätskeliknande rörelser."
    ],
    "points": 153,
    "commentCount": 97,
    "retryCount": 0,
    "time": 1729165380
  },
  {
    "id": 41863278,
    "title": "Skulle vi också chatta? Säkerhetsanalys av WeChats Mmtls-krypteringsprotokoll",
    "originLink": "https://citizenlab.ca/2024/10/should-we-chat-too-security-analysis-of-wechats-mmtls-encryption-protocol/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41863278",
    "commentBody": "",
    "originSummary": [
      "Rapporten är den första offentliga analysen av WeChats MMTLS-krypteringsprotokoll och identifierar betydande säkerhetssvagheter på grund av anpassade kryptografiska modifieringar. Problem som deterministiska initialiseringsvektorer (IV) och avsaknad av framåtsekretess lyfts fram, vilket indikerar ett misslyckande med att anta kryptografiska bästa praxis i kinesiska appar. Författarna rekommenderar en övergång till standardkrypteringsprotokoll som TLS eller QUIC+TLS för förbättrad säkerhet och tillhandahåller verktyg och dokumentation för vidare forskning om WeChats säkerhet."
    ],
    "commentSummary": [
      "Artikeln belyser säkerhetsproblem med WeChats Mmtls-krypteringsprotokoll, och pekar på dess svagheter och potentiella sårbarheter.",
      "Det antyder att dessa sårbarheter sannolikt beror på överarbetade utvecklare snarare än att de är statligt påbjudna, trots den kinesiska regeringens direkta tillgång till WeChats backend.",
      "Diskussionen väcker bredare frågor om användningen av icke-standardiserade krypteringsprotokoll och utmaningarna med att upprätthålla säker kommunikation mitt i potentiell statlig övervakning."
    ],
    "points": 150,
    "commentCount": 83,
    "retryCount": 0,
    "time": 1729109218
  },
  {
    "id": 41866742,
    "title": "OpenVMM – En ny VMM för Windows och Linux, skriven i Rust",
    "originLink": "https://github.com/microsoft/openvmm",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41866742",
    "commentBody": "",
    "originSummary": [
      "OpenVMM är en modulär och plattformsoberoende Virtual Machine Monitor (VMM) utvecklad i programmeringsspråket Rust.",
      "Bidrag till OpenVMM uppmuntras, men de flesta kräver att man undertecknar ett Contributor License Agreement (CLA), vilket underlättas av en CLA-bot under pull-begäranden.",
      "Projektet följer Microsofts Open Source Code of Conduct, och frågor kan riktas till opencode@microsoft.com."
    ],
    "commentSummary": [
      "OpenVMM är en ny Virtual Machine Monitor (VMM) för Windows och Linux, utvecklad i Rust, med betoning på säkerhetsfunktioner jämfört med traditionella språk som C/C++.",
      "Projektet fokuserar på OpenHCL som en paravisor men saknar finess i traditionella värdkontexter och garanterar inte API-stabilitet.",
      "OpenVMM används av Microsoft-anställda och är integrerat i Azures infrastruktur, vilket understryker dess betydelse i molndatormiljöer."
    ],
    "points": 142,
    "commentCount": 107,
    "retryCount": 0,
    "time": 1729143726
  },
  {
    "id": 41863398,
    "title": "Automatiserade släta derivator av N:te ordningen för brusiga data",
    "originLink": "https://github.com/hugohadfield/kalmangrad",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41863398",
    "commentBody": "",
    "originSummary": [
      "Projektet syftar till att differentiera sensordata för analys med hjälp av Kalman-filter, som är kända för att omprova till en konsekvent frekvens och jämna ut avvikelser.",
      "En ny numpy-baserad bibliotek för Bayesiansk filtrering/utjämning, kallad Kalmangrad, har utvecklats och finns tillgänglig på GitHub.",
      "Utvecklaren är öppen för feedback, önskemål om funktioner och felrapporter för att ytterligare förbättra biblioteket."
    ],
    "commentSummary": [
      "Projektet fokuserar på att differentiera brusiga sensordata med hjälp av Kalman-filter, som föredras för utjämning och omprovtagning.",
      "En Bayesiansk filtreringsbibliotek utvecklades för att hantera denna utmaning, med potential för funktionsutvidgning baserat på användarfeedback.",
      "Projektet är tillämpligt inom områden som luftkvalitetsövervakning och självkörande bilar, och är användbart för att beräkna derivator i bullriga, icke-enhetligt samplade data."
    ],
    "points": 137,
    "commentCount": 39,
    "retryCount": 0,
    "time": 1729109866
  }
]
